{
  "source_id": "洞真太上八素真经修习功业妙诀",
  "source_file": "chunked_daozang\\洞真太上八素真经修习功业妙诀.json",
  "total_chunks": 5,
  "total_original_chars": 5019,
  "total_translated_chars": 32563,
  "total_translation_time": 160.98854231834412,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\洞真太上八素真经修习功业妙诀.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Wondrous Oral Instructions on Cultivating the Meritorious Practice of the Supreme Perfected Eightfold Simplicity Scripture**\n\n**Scripture Title:** *The Wondrous Oral Instructions on Cultivating the Meritorious Practice of the Supreme Perfected Eightfold Simplicity Scripture*\n*Author unknown, approximately composed during the Eastern Jin or Liu-Song dynasties. Originally part of the* Eightfold Simplicity Scripture*, later circulated independently. One fascicle.*\n\n**Source:** *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n---\n\nThe Four Perfected Ones of the Great Ultimate respectfully inquired of the Supreme Lord of the Great Dao: \"We have received the methods and transmitted the scriptures, and have heard the teachings. But in the stages of cultivation and practice, where does one begin?\"\n\nThe Lord of the Dao replied: \"For those in the initial stages of learning, they should enshrine the scriptures in a separate chamber, upon a table or desk, and morning and night offer incense, lamps, and reverent contemplation, paying homage at dawn and dusk to what they have received.\n\nThe lofty and exalted adapt to circumstances in their practice, for the precepts and methods vary, each contained within the scriptures. Some are to be transmitted orally, depending on the individual.\n\nIf a disciple neglects the morning rites, they will repeatedly incur disrespect and humiliation, and their merit and practice will not flourish. If one truly aspires to attain perfection, they must not neglect the morning rites. If karmic obstacles arise, preventing consistency in day and night practice, one must not fail on auspicious mornings, for there will naturally be responsive effects.\n\nI reiterate this for your benefit, to ensure it is entrusted to the right person.\"\n\nThe Perfected Ones bowed their heads, received the command, and vowed to follow it.\n\n---\n\nIn all meritorious practice, one must diligently study the scriptures and edicts, uphold the essential precepts, recite them from memory, and contemplate their meaning with unwavering resolve. Without slackening or retreating, one must advance with daily renewal, adapting to the teachings of the age and acting in accordance with the times.\n\nThe scriptures of the Three Caverns will alternately emerge and recede; one must follow the flow to aid in urgent matters, never forcibly resisting conditions. The application may be high or low, but it must not be suppressed or cut off. Circumstances may require ascending or descending, but nothing should be discarded. One must seek the middle way, neither blocking nor forcing passage. If passage is forced yet remains obstructed, whether in the high, low, or middle, inversion and opposition will bring calamities and trials—this must be carefully considered.\n\nWhen the great cosmic forces are harmonious, proceed according to rank and order. On inharmonious days, each receives a lesser portion. Depth and quantity must not transgress the stages. Advancement depends on conditions, but one must not act contrary to the cosmic flow. With focused intention and strict adherence to the precepts, one may aspire to perfection.\n\n---\n\nThe fasting precepts number ten:\n\n1. Do not consume beings containing blood or life-*qi*, nor anything pungent or sudden, except for vegetables, which may be eaten except during the months when they face their growing season.\n2. At dawn, take congee; at midday, take a meal. Thereafter, all rich, sweet, or fine flavors must not be consumed again. By day, burn incense; by night, light lamps. Incense must not be lacking even for a moment, and in sitting, rising, lying, or resting, one must not depart from the Dharma.\n3. Abandon all worldly entanglements and devote oneself solely to the Dao.\n4. Reflect on the scriptures and precepts, purify the mind, and advance with diligence.\n5. Be compassionate and filial toward all, pity the suffering and poor, reveal the path of life, and exhort the ignorant.\n6. Repent and confess transgressions, seeking deliverance from hardship.\n7. Forsake glory and splendor, treasuring only the Dao.\n8. Labor the body and endure hardship, serving the Dao.\n9. Vow to alleviate all pains, the ten sufferings and eight adversities, deliver beings from the perilous age, and become a seed of Great Peace.\n10. Honor the Dao and esteem virtue, ensuring one’s words and heart align. Purify the mind and advance with diligence, aspiring to join the company of immortals. Receive the scriptures and precepts without daring to transgress, so that on the day of ascension, one may unite with the Dao.\n\n---\n\nThe exalted precepts state: \"The supervisor of the fast, along with the officiating officials, recites scriptures and performs the Dao. When ascending the high seat to recite a thousand words of scripture, they may receive one drink—this does not apply to those who do not recite.\"\n\nThis clause is from the *Middle Section of the Luminous Precepts of the Four Poles*.\n\n---\n\nThe exalted precepts further state: \"Those who receive the governance of the stellar lodges, or who uphold the scriptures and methods of the Three Treasures, the *Mysterious Scripture of the Cavern of Perfection*, and who participate in the rites after receiving the fasting precepts, must all receive the Five Precepts of the Dharma Trial. Those who do not receive these Five Precepts may not be included among the ranks of fasting officials or recorded in the registers.\n\nThose who have received the *True Contract of the Three Ones* or the *True One* and above, yet do not receive the Five Precepts of the Dharma Trial, may not have their names listed in the Upper Palace, nor may they submit memorials on the stellar lodges’ grand petitions. If one submits a petition without having received the precepts, their name will not be recorded in the Immortal Capital, and the petition will not be presented to the throne. The reason is that without the Dharma’s regulations, the body is not pure and upright, and thus it cannot be presented to the throne.\n\nMoreover, the officials of the stellar lodges do not accept petitions from masters who have not received the precepts and lack integrity. Therefore, there are major and minor precepts and regulations, each to be followed accordingly.\"\n\n---\n\nFasts are of five types, as follows:\n\n1. **Emergency healing of illness**, following the teachings and methods of the Celestial Master. This includes entering the Three Primes to repent, seeking life and sustenance, binding oneself with mud on the forehead, and the methods of covering in ashes—all are within the Celestial Master’s teachings.\n2. **The Brahmanic conduct of the Numinous Treasure**, gathering the worthy to observe transformation, cultivating the body and planting blessings. Within this are methods for repenting the sins of life and death, holding oneself accountable, and reflecting on transgressions.\n3. **The reclusive immortality of the Highest Clarity**, a fast for the ascension of the seven generations of ancestors, also practiced according to the monthly ordinances and virtuous conduct.\n4. **The True One’s guardianship of quiescence**, a fast of meditating on the spirits, swallowing *qi*, and guiding and pulling.\n5. **The Divine Elixir of the Great One**, methods for offering to the furnace and fire, the Golden Liquor, and month-long seclusion in a chamber.\n\nOther practices, such as secluded tranquility, nurturing the spirit and extending life, chanting in purity, and prolonged fasting, are not included in these five categories.\n\n---\n\nFurthermore, Daoist masters, libationers, and male and female officials who have already received the *True Contract*, the scriptures of the Three Caverns of Highest Clarity, and the methods of stellar lodge governance, and who seek to have their names recorded in the Mysterious Capital and their memorials presented to the throne, must receive the Five Precepts of the Mysterious Capital’s Dharma Trial.\n\nThe text of the precepts is as follows:\n\n1. **The first precept**: Do not fail to revere Heaven, nor claim that Heaven has no spirits. Do not call the Earth ghostless, nor treat the earth deities, mountains, rivers, and great marshes with disdain, digging and boring without restraint. To declare that Heaven and Earth are without numen is to commit a transgression without fear. Nor may one teach others to treat Heaven and Earth with disrespect, claiming there are no spirits or ghosts.\n\nViolating this first precept incurs a deduction of three hundred years from one’s celestial allotment. A single transgression shortens one’s lifespan by seven years and obstructs affairs for seven years. One must examine one’s faults, reflect on errors, and establish merit to atone for wrongdoing. If one’s virtue surpasses that of the past, one may prostrate and swear three times, then petition to restore one’s former rank, reckoning merit to extend life. The Dao does not fail humanity.\n\n**The second precept**: Do not kill living beings or destroy nests and eggs. Nor may one teach others to kill living beings or destroy nests and eggs. Violating this precept incurs a deduction of one hundred sixty years from one’s celestial allotment. A single transgression shortens one’s lifespan by five years and obstructs affairs for five years. One must examine one’s faults, reflect on errors, and establish merit to atone for wrongdoing, cultivating purity until attainment. If one’s virtue surpasses that of the past, one may prostrate and swear three times, then petition to restore one’s former rank, reckoning merit to extend life. The Dao does not fail humanity.\n\n**The third precept**: Do not engage in deceit, theft, or avarice, nor covet others’ possessions or obstruct their aspirations. Nor may one teach others to steal, covet possessions, or seize what others cherish. Violating this precept incurs a deduction of one hundred twenty years from one’s celestial allotment. A single transgression shortens one’s lifespan by four years and obstructs affairs for four years. One must examine one’s faults, reflect on errors, and accumulate merit to cultivate virtue. If one’s virtue surpasses that of the past, one may prostrate and swear three times, then petition to restore one’s former rank, reckoning merit to extend life. The Dao does not fail humanity.\n\n**The fourth precept**: Do not consume alcohol, commit adultery with others’ wives, engage in licentious conduct, or exploit public office for private gain. Nor may one teach others to drink, seduce others’ spouses, engage in licentious conduct, or exploit public office for private gain. Violating this precept incurs a deduction of one hundred twenty years from one’s celestial allotment. A single transgression shortens one’s lifespan by four years and obstructs affairs for four years. One must reflect on errors, examine one’s faults, and establish merit to atone for wrongdoing. If one’s virtue surpasses that of the past, one may prostrate and swear three times, then petition to restore one’s former rank, reckoning merit to extend life. The Dao does not fail humanity.\n\n**The fifth precept**: Do not slander, envy, or poison others, nor engage in malicious scheming, harm the virtuous, or burn others’ dwellings. Nor may one teach others to slander, envy, or poison, engage in malicious scheming, harm the virtuous, burn dwellings, destroy gates and doors, or seek vengeance. Violating this precept incurs a deduction of one hundred twenty years from one’s celestial allotment. A single transgression shortens one’s lifespan by three years and obstructs affairs for three years. One must examine one’s faults, reflect on errors, and establish merit to atone for wrongdoing. If one’s merit surpasses that of the past, one may prostrate and swear three times, then petition to restore one’s former rank, reckoning merit to extend life. The Dao does not fail humanity.\n\nAs for Daoists and libationers who do not receive the Dharma precepts, neglect their Daoist conduct, and violate the various prohibitions, their memorials and petitions go unheard, and their attempts at deliverance often prove ineffective. This is because their practice lacks proper method and discipline, entangling them in the trials of wine and meat, the height of carelessness. Since the ascension of the Three Sages, the true statutes have fallen into obscurity, repeatedly subjected to the world’s disdain. The Dharma regulations have scattered, and ancient canons are no longer preserved. Even if libationers have not received the precepts, their names are already marked as universally forbidden in the registers. In recent times, when submitting memorials, inconsistencies abound, and many petitions to the celestial bureaus go unanswered or unvalidated. If one in a hundred proves effective, it is due to the sincerity of virtuous petitioners whose devotion moves the highest powers, prompting the Celestial Thearch to shield and permit their pleas. The merit lies in preserving life, not in the libationer’s memorials. Yet foolish masters, seizing upon the rare success of a devout petitioner’s earnest plea, claim it as their own achievement, then intimidate the people, making endless demands. Unaware of the hidden consequences, they incur indictments, have their names stricken from the rolls of the living, and their lifespans shortened, soon meeting an untimely end. Though minor transgressions may not immediately invite punishment, one should not assume Heaven and Earth are vast and overlook small faults. If one accrues minor merit, the reckoning of errors may be deferred, prolonging the delay. Those who escape minor trials do so because their hidden sins are grave, already marked for expulsion. Only after annihilation are they consigned to the torments of knife mountains and sword trees, hence the absence of minor trials. The foolish, unaware of this, assume their sins go unpunished, believing Heaven permits indulgence. They claim the heavens are boundless and do not scrutinize minor faults, thus incurring no reckoning. Utterly deluded, they compound their daily errors, even asserting that Heaven and Earth are without spirits. Those who warn them are dismissed as deceivers, unaware they are already marked for expulsion, their doom imminent and unforeseen. How can one deceive the luminous heavens? The foolish, ignorant of the Dao’s weight, regard it lightly. I grieve for them with a pained heart. Let each clearly discern and diligently cultivate goodness, avoiding greed and impurity, for the consequences of sin are not light.\n\nThe Highest Statutes state: Daoists and libationers, both men and women, who receive the true and ultimate Dharma, the precious scriptures of the Highest Dao, and the correct governance of stellar lodges, and who hold ranks of True Unity or above, must also receive the Five Precepts of the Dharma Trial and the Great Precepts of Karmic Conditions, even if they are virtuous and devoted. Those who receive the ultimate Dharma but neglect these Five Precepts will not have their names inscribed on the cinnabar tablets of the Immortal Capital. Their names will be absent from the Jade Register and the Ink Ledger, and their ghostly names will not be erased from the White Records of the Three Offices. After passing, they will remain as lower ghosts, their souls denied immortality, subjected to endless trials, and their misfortunes extending to their descendants. The efficacy of Daoist devotees’ sincerity or negligence is addressed elsewhere, recorded after the Ink Ledger’s upper section.\n\nThe Highest Statutes state: Those who study the Dao should be diligent and earnest, establishing merit to atone for the sins of their seven ancestral generations, advancing the immortal names of their family and themselves, and escaping the ten sufferings and eight difficulties. They must receive the Five Precepts of the Dharma Trial, establish merit and virtue, seek inscription in the Jade Register of the Immortal Capital, and erase their names from the White Ledgers of the Three Offices and the death registers.\n\nYou, as Daoist disciples, have received the great inner and outer true covenants of the Dharma, accumulating years of practice, yet your conduct does not align with the natural Way. Moreover, you have not accepted the Five Precepts of the Dharma Trial, your bodies defiled by wine, meat, and greed, your Daoist practice devoid of method. Thus, you commit transgressions and evil, forfeiting your destined years and shortening your lives. Upon death, you become lower ghosts, unable to escape the torments of blade mountains and sword trees, the cruel agonies of boiling cauldrons—how grievous, how grievous indeed!\n\nYou who follow the Dao must clearly adhere to the precepts and laws, practicing diligently for three years without weariness, thereby gaining longevity and the augmentation of your heavenly allotment. The Heavenly Bureau reviews the Ink Ledgers thrice yearly, calculating merits to extend your destined years. The Director of Destinies submits these records above, distinguishing good from evil. Meritorious deeds are inscribed on the left covenant, while transgressions and unexpiated faults are recorded on the right—all matters made manifestly clear.\n\nThe Dao does not fail humanity; rather, few truly believe, while many violate the precepts and laws, thus incurring guilt and suffering punishment. Take heed, all of you, and be cautious in your conduct. Caution itself is virtue.\n\nAll Daoist priests, libationers, and male and female officials who receive the true Dharma, seek immortal deliverance, prolong life, uphold the precepts, establish merit to atone for transgressions, heal the people, and present memorials to the throne must engage in purification rites, observe the precepts, and not transgress the statutes. By fulfilling their vows, they may calculate their merits for promotion and ascension, their blessings and longevity boundless.\n\nThe Highest Statutes state: There are those born of noble rank whose conduct already aligns with the natural Way, though they have not received these precepts in writing. They need not undergo the formal precepts again. From ancient times to the present, such individuals exist, though in this age, scarcely one in a hundred may be found. They cannot be taken as a standard. Only those whose virtue and conduct conform to the precepts—those of lofty aspiration and unwavering resolve—may establish the Daoist enterprise through the precepts. Thus, the precepts and statutes must be proclaimed without fail.\n\nThe Highest Statutes state: All who wish to study the Dao and seek truth, establishing merit and virtue in the world, inscribing their names in the heavens, and ascending to the ranks of immortal officials must receive the Five Precepts of the Dharma Trial. They must practice the Dao in accordance with the precepts for three years, establishing true merit before presenting a memorial to the Immortal Capital. Their names are inscribed on the Cinnabar Registers, recorded in the Jade Calendar above, and their immortal titles are established. The Director of Destinies issues decrees to the Five Peaks, notifying the Three Offices to acknowledge them as perfected persons, erasing their names from the White Ledgers of death and removing their ghostly designations. Only then may they rightfully be called Daoist priests or libationers in training.\n\nThus, their true names and diligent efforts are recorded in the Immortal Capital, and all their memorials are heard without obstruction. Those who neither receive the precepts nor practice with earnest diligence have no merit or name in the Immortal Capital. Their memorials and petitions are all suspended, their Daoist practice unrecognized. They merely waste the people’s offerings of paper, ink, incense, and oil, while enduring the trials of consuming wine and meat. Their souls are constantly subjected to litigation, and their worldly endeavors meet with misfortune.\n\nSome may evade punishment for violating the laws, or their names may not yet appear in the death registers of the Three Offices, so they only encounter good fortune, with misfortune yet to befall them. Others may have long-standing grievances, and the examining officials deliberately obscure their judgment, compounding their offenses for severe adjudication. Thus, they avoid minor trials, only to accumulate impurities until they are driven to premature death. How lamentable, how lamentable indeed!\n\nNovice Daoist priests, libationers, and male and female officials—you who wish to cultivate life, endure hardship in seeking truth, subdue ghosts, and heal illnesses with proven efficacy, revered by the people—must receive the Five Precepts of the Dharma Trial. Once received, your names are recorded in the Immortal Capital. After three years of diligent practice without violating the precepts, the Director of Destinies submits your merits to the Heavenly Emperor. Your names are inscribed in the Jade Calendar, and you receive the dispersed titles of perfected persons, capable of subduing ghosts and healing illnesses with unfailing efficacy. Such goodness—how can it not be cultivated?\n\nDaoist priests, libationers, and male and female officials who wish to study the arts of subduing ghosts and healing illnesses must receive the Five Precepts of the Middle Terrace for Establishing Life. Upon receiving these precepts, their positions are rectified in the Immortal Capital, their names recorded in the Cinnabar Registers. After three years of meritorious effort, their names are inscribed in the Jade Calendar above. The Heavenly Bureau then reviews their merits, recording them in the registers of the mountains, rivers, Five Peaks, Four Waterways, and Three Offices. Knowing of your diligent accumulation of merit, your names are revered by the celestial deities of the Mysterious Capital and the earthly spirits of the Dark Capital, subduing all ghosts. Your healing and memorials ascend above, and you undertake great inner and outer affairs, mastering the wonders of the True Unity.\n\nIf you do not receive the Dharma Trial or heed the Five Precepts, you will have no position in the Immortal Capital, no name in the Jade Calendar. You will incur the sins of libationers who conceal defilement, disrespected by the gods of the Five Peaks, Four Waterways, Three Offices, and all spirits. Your memorials will be suppressed and unpresented. For indulging in wandering alleys, greed, and defilement, refusing to reform your transgressions, violating the statutes and taboos, the Director of Destinies will impeach and report your deeds, diminishing your destined years.\n\nThough you may be teachers of others, minor violations of the laws are not counted among the trials. If you show remorse, your offenses may be compounded for severe judgment.\n\nNow, the foolish among men, deluded and blind, suppose that so long as their transgressions bring no immediate affliction, Heaven and Earth remain unaware of their sins, or even claim there are no gods—unaware that their hidden misdeeds have already been memorialized in the unseen courts. Though minor grievances may not be reported at once, this is but to accumulate their filth until the measure is full, whereupon they shall be swept away in the great purgation. Thus, their doom is sealed: no minor reckoning shall delay the final verdict. Suddenly, they are struck down in their prime, cut short before attaining the three spans of life. Their crimes compounded, they endure the torments of blade-mountains and fire-whirls, dying to become lowly ghosts, forever subjected to agony—how can this be borne?\n\nYou who have received the True Teaching, though outwardly you seek merit in healing and salvation, and inwardly aspire to refine the Three Origins, nurture the spirit, and prolong life, must first seek out enlightened masters and uphold the Dharma Precepts. Do not indulge in wine and meat, nor sink into dissipation, nor pursue wayward deeds. Every transgression, great or small, shall be impeached and reported. Only through dawn-to-dusk vigilance, accumulating merit to redress faults, and reverently awaiting the mysterious grace of the Dao may you halt the depletion of your years and await judgment.\n\nThus may you extend your life, restore your allotted span, and begin anew, where merit and fault offset one another in the most minute accounting. Take heed, all of you—take heed in your cultivation, that you may preserve your immortality.\n\nThe Highest Statutes decree: Daoists, libationers, and officials of both sexes—you who wish to refine the Divine Elixir of Great Clarity, master the arts of the Three Origins’ Yin and Yang, or seclude yourselves in mountains and marshes to contemplate immortality and nurture your resolve—must first receive the Five Precepts of Preserving Life. You must further endure the Seven Trials and Nine Refinements, crushing your nature to endure humiliation, bearing others’ scorn without resentment; and you must not entertain wayward thoughts or stray desires, but keep the spirit serene and undivided.\n\nOnce more, you must endure hunger and cold, bearing humiliation without resentment or faltering. You must accumulate diligent merit on a vast scale, rescuing those in dire straits and delivering lives from death, that you may receive the beginning of renewed existence. You must subsist on meager fare in utmost austerity, amassing hidden virtue until it shines forth, yet when Heaven has not yet repaid your merit, you dare not entertain hope. When your meritorious deeds and righteousness move all to reverence, when your accumulated diligence is great, yet your body is beset by hardship and ruin, when none near or far inquire after you, you dare not lament your plight. When vast kindness flows forth, yet you suffer further unjust humiliation without taking it as harm—such is the greatness of wisdom and virtue.\n\nThere are five virtues, and without profound devotion and earnest love, none can establish such conduct. Thus, they are called the Five Virtues, and their weight is most grave indeed. Those who study the Dao for years endure tenfold trials and ninefold humiliations, with filth and malice heaped upon them, yet still harbor the compassion of forbearance and meekness—this is the first wisdom. To practice vigorously and broadly, esteeming both inner and outer cultivation, nurturing the Three Origins so that the Five Spirits remain unharmed, advancing without decline, your countenance never withering—this is constancy, the second wisdom. To persist in cultivation without retreat, traversing the eight directions, now ascending in clarity, now descending in turbidity, now floating, now sinking, diligently serving the world without seeking record or fame, accumulating virtue without cease, and never daring to deem it labor—this is the third wisdom. To inwardly refine medicinal qi, embodying virtue to nurture your nature, turning through nine years, or even twenty-four, or up to thirty-two years, enduring hardship and proving your diligence, yet suffering unjust setbacks without reckoning or complaint, dwelling in tranquil serenity, never recording merit, yet ever more deeply concerned—this is the fourth wisdom. When your Daoist practice yields no worldly merit, when you have but briefly followed your master’s teachings and devoted yourself to their gate, yet midway encounter calamity, your true nature scattered and ruined, enduring ten thousand trials of forbearance, yet still maintaining a gentle demeanor, never grinding your teeth in anger—this is the fifth wisdom.\n\nThe Highest Statutes decree: All who study the Dao must guard their hearts with steadfast singularity, practice goodness with sincerity, and though they have not yet attained enlightenment, having endured the Seven Trials and Nine Tribulations without resentment or retreat, upholding the Five Precepts and aligning with the Five Wisdoms, never transgressing the precepts or neglecting the scriptures, dwelling in secluded tranquility and harmonious non-action—even after long immersion in the dust of the world, they do not reckon unjust humiliation; when encountering misfortune and adversity, they knock upon their breasts and beg forgiveness, enduring repeated hardships without resentment, instead ever more generously bestowing kindness, humbly entreating others, ever fearful of losing past merit and diligence, ever anxious that deep karmic obstacles may bring misfortune. Those who possess such towering virtue, whose merit is vast and boundless, never deeming it labor, purifying their elixir through austerity, ever more resolute, ever fearful of falling into the abyss, whether by morning or by evening—such wisdom is truly profound and great.\n\nWith such virtue and conduct, one may truly establish the Daoist path. After five years of practice, serene and free from desire, one may withdraw to the forests and secluded peaks to entrust one’s fate. You who seek the Dao and refine your life to extend your years among mortals must first dwell in seclusion, harmonizing your spirit and nurturing your resolve, guiding and refining the Three Origins, accumulating diligence with single-minded devotion. When the numinous perfected respond from on high, and your body is beset by misfortune, you do not seek redress; when unjust humiliation and adversity befall you, you remain joyful and composed, never taking it as misfortune. By practicing these Five Precepts and perfecting the Five Wisdoms, your Daoist conduct becomes pure, your merit towering and weighty—yet you dare not hope for reward, instead redoubling your courage and advancing with ever greater vigor, surpassing all you once could not. With merit thus accumulated, what could you not attain? What wish would not be fulfilled? What plea would go unheard? What aspiration would not be realized?\n\nThe Highest Statutes decree: Immortals have nine ranks, arts have thirty-six gates, and there are one hundred twenty prohibitions—all essential to the foundation of extending life. Yet there has never been one who, following the statutes and enduring hardship, did not attain their goal. The only obstacle is that practitioners lack diligence, their thoughts of the Dao are not single-minded, they lack constancy, and have no like-minded companions to share their resolve—how then can the Dao be cultivated? Some hear of morning deeds and expect evening rewards, lightly dismissing the true teachings as devoid of numinous response. Many are stingy and greedy, indulging in humiliation, sinking into the company of wine and meat, lacking the resolve to endure austerity for the Mysterious Origin. Their conduct is confused and disordered, their sins piled high in the celestial archives, their souls tormented and battered, suffering punishment in the earthly prisons—until judgment is passed. Thus, one must deeply reflect and reform, diligently practicing virtue with single-minded devotion to seek the efficacy of true illumination. Those of wisdom, hearing this, will practice it, reverently upholding the Five Precepts—is this not wondrous?\n\n**Lesser Fasting Ritual:**\nThe host provides for one virtuous person, with one person contributing one hundred coins per day, along with rice, vegetables, tea, fruit, honey, and ginger.\n\n**Middle Fasting Ritual:**\nA thousand meals are offered, with one person contributing two hundred coins per day, along with rice, vegetables, incense, flowers, lamps, candles, tea, fruit, honey, and ginger.\n\nThe above two rites are calculated per person invited, with each participant contributing accordingly.\n\n**Another Rule:**\nFor fasting rituals to relieve illness or distress, the vegetarian offerings follow the Lesser Fasting Ritual.\n\n**Lingbao Longevity Fasting:**\nA thousand meals are provided at the host’s discretion, with the sole prohibition against killing living beings or violating the statutes.\n\n**Shangqing Scripture-Recitation and Secluded Mountain Forest Fasting:**\nRice and vegetables are consumed regularly, with no fixed monetary contribution.\n\nThe above five grades follow their respective standards.\n\n**Great Fasting Ritual of the Great One’s Secluded Chamber for Elixir Refinement (One Hundred Days):**\nThis is not subject to monetary limits.\n\nIn ancient times, oaths were sworn with gold and silk; now, they are replaced with forty feet of cinnabar and silk, and a pair of gold rings.\n\nHere ends the wondrous essentials of the practice and merits of the *Wondrous Scripture of the Eight Pure Ones of the Highest Perfected of the Cavernous Truth*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞真太上八素真经修习功业妙诀 经名：洞真太上八素真经修习功业妙诀。 撰人不详，约出於东晋南朝。 原为《八素真经》之一，后分出单行。 一卷。 底本出处：《正统道藏》正一部。 洞真太上八素真经修习功业妙诀 太极四真人，请问太上大道君曰：受法传经，言闻之矣，修习阶渐，缘何始乎？ 道君曰：初学之俦，奉经治写别室几案，晨夜香灯供养存神，朝夕礼拜所受。 高上随缘行之，科法有异，各在经中，或应自口，在乎其人。 受学不事朝礼，即犯毁辱屡至，功行不兴。 必愿成真，勿忘朝礼。 因缘有碍，日夕不恒。 良晨不亏，自有感效。 重为子言之，审付其人也。 真人稽首，受命奉行。 凡习功业，精寻经诰，受持要戒，谙诵在心，心存意解，行之不疑，不懈不退，精进日新，随世教化，依时行藏。 三洞诸经，更互出没，顺运济急，勿强违缘，应用高低，不可抑绝。 缘宜上下，不可弃捐，当须得中，不可闭塞而强通。 通而苟塞，上下及中，颠倒违逆，皆有灾考，不可不详。 大运和时，品依次第，不和之日，各受少分，深浅多少，不得违阶，超越由缘，慎勿乖运，精心期真，严持戒耳。 斋法有十戒： 一者不得食含血之物，有生炁并熏卒之属，唯菜非向生之月得食之。 二者平旦啜粥，日中则食，自是之后，有甘肥美味，一切不得复飨。 昼则烧香，夜则然灯，烧香不乏须臾，坐起卧息不离法则。 三者弃写因缘，唯道是务。 四者思经念诫，洗心精进。 五者慈孝一切，愍念悲穷，开示生道，以劝愚民。 六者悔谢罪过，求乞生活。 七者委舍荣华，所宝在道。 八者劳身苦体，为道驱使。 九者愿除众痛，十苦八难，免度厄世，为太平种民。 十者尊道贵德，心口相副，洗心精进，志求仙俦，承受经戒，不敢亏违，升 度之日，与道合同。 高上科曰：监斋法师，从斋之官，诵经行道，上高座读经一千言，听得一饮，不在不诵之例。 此一条出《四极明科》中篇。 高上科曰：夫受星宿正治，及奉受三宝经法，洞真玄经之法，拜署斋法之后，悉应受法难五戒，而不受此五戒者，不得参同斋官缤录之例。 并受真契三一、真一以上，又不受法难五戒者，不得列名上宫，又不得表奏星宿大章。 若未受而奏章，仙都无名，露章不被奏御。 所以尔者，既无法轨，身不清廉，是故不为奏御。 又且星宿之官，不受未戒不廉之师奏事。 故有大小科戒之法，明各依承。 凡斋有五种之格，如左： 第一救急治病，承用天师旨教法。 入三元方谢，乞生丐活，自缚泥额，涂炭之法，并在旨教之中。 第二灵宝梵行，集贤观化，修身种福之法，其中又有生死谢罪，责己思愆之法。 第三上清仙隐，为七世先亡迁升之斋，亦随月修直，善行之法。 第四真一守寂，思神吞炁，导引之斋。 第五太一神丹，宜祭炉火金液之法，闭房经月之斋。 其别隐静，养神续命，清咏长斋，不在五条之例。 又道士、祭酒、男女官，已参受真契，并受上清三洞之经，及星宿治法，为道欲得标名玄都，奏御旨闻，当受玄都法难五戒。 其戒文如左： 第一之戒，不得不敬於天，不得谓天无神，呼地无鬼，不得轻慢地祇山川大泽，而穿凿无忌。 是谓天地无灵，罪犯无畏。 又不得教令人轻慢天地，谓无神鬼。",
      "translated_text": "**The Wondrous Oral Instructions on Cultivating the Meritorious Practice of the Supreme Perfected Eightfold Simplicity Scripture**\n\n**Scripture Title:** *The Wondrous Oral Instructions on Cultivating the Meritorious Practice of the Supreme Perfected Eightfold Simplicity Scripture*\n*Author unknown, approximately composed during the Eastern Jin or Liu-Song dynasties. Originally part of the* Eightfold Simplicity Scripture*, later circulated independently. One fascicle.*\n\n**Source:** *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n---\n\nThe Four Perfected Ones of the Great Ultimate respectfully inquired of the Supreme Lord of the Great Dao: \"We have received the methods and transmitted the scriptures, and have heard the teachings. But in the stages of cultivation and practice, where does one begin?\"\n\nThe Lord of the Dao replied: \"For those in the initial stages of learning, they should enshrine the scriptures in a separate chamber, upon a table or desk, and morning and night offer incense, lamps, and reverent contemplation, paying homage at dawn and dusk to what they have received.\n\nThe lofty and exalted adapt to circumstances in their practice, for the precepts and methods vary, each contained within the scriptures. Some are to be transmitted orally, depending on the individual.\n\nIf a disciple neglects the morning rites, they will repeatedly incur disrespect and humiliation, and their merit and practice will not flourish. If one truly aspires to attain perfection, they must not neglect the morning rites. If karmic obstacles arise, preventing consistency in day and night practice, one must not fail on auspicious mornings, for there will naturally be responsive effects.\n\nI reiterate this for your benefit, to ensure it is entrusted to the right person.\"\n\nThe Perfected Ones bowed their heads, received the command, and vowed to follow it.\n\n---\n\nIn all meritorious practice, one must diligently study the scriptures and edicts, uphold the essential precepts, recite them from memory, and contemplate their meaning with unwavering resolve. Without slackening or retreating, one must advance with daily renewal, adapting to the teachings of the age and acting in accordance with the times.\n\nThe scriptures of the Three Caverns will alternately emerge and recede; one must follow the flow to aid in urgent matters, never forcibly resisting conditions. The application may be high or low, but it must not be suppressed or cut off. Circumstances may require ascending or descending, but nothing should be discarded. One must seek the middle way, neither blocking nor forcing passage. If passage is forced yet remains obstructed, whether in the high, low, or middle, inversion and opposition will bring calamities and trials—this must be carefully considered.\n\nWhen the great cosmic forces are harmonious, proceed according to rank and order. On inharmonious days, each receives a lesser portion. Depth and quantity must not transgress the stages. Advancement depends on conditions, but one must not act contrary to the cosmic flow. With focused intention and strict adherence to the precepts, one may aspire to perfection.\n\n---\n\nThe fasting precepts number ten:\n\n1. Do not consume beings containing blood or life-*qi*, nor anything pungent or sudden, except for vegetables, which may be eaten except during the months when they face their growing season.\n2. At dawn, take congee; at midday, take a meal. Thereafter, all rich, sweet, or fine flavors must not be consumed again. By day, burn incense; by night, light lamps. Incense must not be lacking even for a moment, and in sitting, rising, lying, or resting, one must not depart from the Dharma.\n3. Abandon all worldly entanglements and devote oneself solely to the Dao.\n4. Reflect on the scriptures and precepts, purify the mind, and advance with diligence.\n5. Be compassionate and filial toward all, pity the suffering and poor, reveal the path of life, and exhort the ignorant.\n6. Repent and confess transgressions, seeking deliverance from hardship.\n7. Forsake glory and splendor, treasuring only the Dao.\n8. Labor the body and endure hardship, serving the Dao.\n9. Vow to alleviate all pains, the ten sufferings and eight adversities, deliver beings from the perilous age, and become a seed of Great Peace.\n10. Honor the Dao and esteem virtue, ensuring one’s words and heart align. Purify the mind and advance with diligence, aspiring to join the company of immortals. Receive the scriptures and precepts without daring to transgress, so that on the day of ascension, one may unite with the Dao.\n\n---\n\nThe exalted precepts state: \"The supervisor of the fast, along with the officiating officials, recites scriptures and performs the Dao. When ascending the high seat to recite a thousand words of scripture, they may receive one drink—this does not apply to those who do not recite.\"\n\nThis clause is from the *Middle Section of the Luminous Precepts of the Four Poles*.\n\n---\n\nThe exalted precepts further state: \"Those who receive the governance of the stellar lodges, or who uphold the scriptures and methods of the Three Treasures, the *Mysterious Scripture of the Cavern of Perfection*, and who participate in the rites after receiving the fasting precepts, must all receive the Five Precepts of the Dharma Trial. Those who do not receive these Five Precepts may not be included among the ranks of fasting officials or recorded in the registers.\n\nThose who have received the *True Contract of the Three Ones* or the *True One* and above, yet do not receive the Five Precepts of the Dharma Trial, may not have their names listed in the Upper Palace, nor may they submit memorials on the stellar lodges’ grand petitions. If one submits a petition without having received the precepts, their name will not be recorded in the Immortal Capital, and the petition will not be presented to the throne. The reason is that without the Dharma’s regulations, the body is not pure and upright, and thus it cannot be presented to the throne.\n\nMoreover, the officials of the stellar lodges do not accept petitions from masters who have not received the precepts and lack integrity. Therefore, there are major and minor precepts and regulations, each to be followed accordingly.\"\n\n---\n\nFasts are of five types, as follows:\n\n1. **Emergency healing of illness**, following the teachings and methods of the Celestial Master. This includes entering the Three Primes to repent, seeking life and sustenance, binding oneself with mud on the forehead, and the methods of covering in ashes—all are within the Celestial Master’s teachings.\n2. **The Brahmanic conduct of the Numinous Treasure**, gathering the worthy to observe transformation, cultivating the body and planting blessings. Within this are methods for repenting the sins of life and death, holding oneself accountable, and reflecting on transgressions.\n3. **The reclusive immortality of the Highest Clarity**, a fast for the ascension of the seven generations of ancestors, also practiced according to the monthly ordinances and virtuous conduct.\n4. **The True One’s guardianship of quiescence**, a fast of meditating on the spirits, swallowing *qi*, and guiding and pulling.\n5. **The Divine Elixir of the Great One**, methods for offering to the furnace and fire, the Golden Liquor, and month-long seclusion in a chamber.\n\nOther practices, such as secluded tranquility, nurturing the spirit and extending life, chanting in purity, and prolonged fasting, are not included in these five categories.\n\n---\n\nFurthermore, Daoist masters, libationers, and male and female officials who have already received the *True Contract*, the scriptures of the Three Caverns of Highest Clarity, and the methods of stellar lodge governance, and who seek to have their names recorded in the Mysterious Capital and their memorials presented to the throne, must receive the Five Precepts of the Mysterious Capital’s Dharma Trial.\n\nThe text of the precepts is as follows:\n\n1. **The first precept**: Do not fail to revere Heaven, nor claim that Heaven has no spirits. Do not call the Earth ghostless, nor treat the earth deities, mountains, rivers, and great marshes with disdain, digging and boring without restraint. To declare that Heaven and Earth are without numen is to commit a transgression without fear. Nor may one teach others to treat Heaven and Earth with disrespect, claiming there are no spirits or ghosts.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1292,
      "start_sentence": 0,
      "end_sentence": 54,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.13589000701904,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八素真经修习功业妙诀.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "犯此一戒，夺天算三百。 一犯此过，减寿七年，格事七年，责己思愆，立功补过。 有殊於先，伏誓三通，然后启复先位，计功续命。 道不负人。 第二戒，不得杀害众生，探巢破卵。 又不得教令人杀害众生，探巢破卵。 犯此一戒，夺天算一百六十。 一犯此过，减寿五年，格事五年，责已思愆，立功补过，清善至到。 有殊於先，伏誓三通，然后启复先位，计功续命。 道不负人。 第三戒：不得行欺巧窃盗，贪心恣恶，规图人物，夺人志愿。 又不得教令人为巧窃，贪图人物，夺人所爱。 犯此一戒，夺天算一百二十。 一犯减寿四年，格事四年，责己思愆，积功补德。 有殊於先，然后伏誓三通，启复先位，计功续命。 道不负人。 第四戒、不得饮酒，外淫略他妇女，淫通不道，因公行私。 又不得教令人饮酒欢妻，略他子女，淫通不道，因公行私。 犯此一戒，夺天算一百二十。 一犯此过，减寿四年，格事四年，思愆责己，立功补过。 有殊於先，然后伏誓三通，启复先位，计功续命。 道不负人。 第五戒，不得诅佞嫉毒，妬无道，谗害善人，焚烧人舍。 又不得教令人诅佞嫉毒，妬无道，谗害善人，焚烧人舍，破人门户，以报怨仇。 犯此一戒，夺天算一百二十。 一犯此过，减寿三年，格事三年，责己思愆，立功自补。 功德有殊於先，然后伏誓三通，启复先位，计功续命。 道不负人。 其为道士、祭酒，不受法戒，不慎道行，犯诸法禁，拜表上章既自不闻，至於救解往往无验。 皆是为道无有法轨，沦逮酒肉之考，不慎之至。 自从三圣升化之后，真科沉隐，累遭天地鄙烈； 法科零落，旧章不存，纵使祭酒未受法戒，录籍之上己为总忌，自顷常慎上章，先后云云纷互，天曹不觉验效者甚多。 百中误有一效，皆是善民告乞，感彻丹善之至，天帝直为拥护，开许所奏，全在性命示，功不在奏章祭酒。 而愚痴师辈，或因承吉善之民感彻之心，旁此一效，以为己功，便恐动百姓，求欲非一，不知吞藏之咎，已被纠奏，削其生名，减其寿命，不久奄而至。 以小愆目下未即考病，便谓天地寥廓，无校小漏。 或中有小功，申延其考愆，目转多延，不加小考者，并其脏漏罪大，在驱除之例示，必灭之后，方付刀山剑树之楚，故不数加小考。 愚人不知，谓为罪不即被考病，谓天地许之纵恣。 又云上天漫漫，不简小愆，故无考咎。 大以专愚推之通日愆咎，转谓天地无神，有戒之者，专虚妄示，不知已在驱除之例，奄至不期也。 天之昭昭，其可欺也。 愚人无知，谓道为轻，吾念之痛心，明各详慎为善，勿为贪浊，罪坐不轻也。 高上科曰：道士、祭酒男女，受真至法，并受上法宝经，星宿正治，位次真一以上，并伏法受真好向之贤，亦不可不参受法难五戒，及因缘大戒。 既受至法，不受此五戒，名故不上仙都丹简，墨箓玉历无名，三官白籍鬼名不除，灭度之后故为下鬼，魂不得仙，考对无已，殃及子孙。 其道民别有精诚否泰之验，不在此条中，纪在墨箓上篇后也。 高上科曰：夫学道宜精勤，立功补过，以赎先亡七祖罪请，并又为家门及一身进上仙名，去离十苦八难之中。 当受法难五戒，立功建德，求上名仙都玉历，削除三官白簿死籍。",
      "translated_text": "Violating this first precept incurs a deduction of three hundred years from one’s celestial allotment. A single transgression shortens one’s lifespan by seven years and obstructs affairs for seven years. One must examine one’s faults, reflect on errors, and establish merit to atone for wrongdoing. If one’s virtue surpasses that of the past, one may prostrate and swear three times, then petition to restore one’s former rank, reckoning merit to extend life. The Dao does not fail humanity.\n\n**The second precept**: Do not kill living beings or destroy nests and eggs. Nor may one teach others to kill living beings or destroy nests and eggs. Violating this precept incurs a deduction of one hundred sixty years from one’s celestial allotment. A single transgression shortens one’s lifespan by five years and obstructs affairs for five years. One must examine one’s faults, reflect on errors, and establish merit to atone for wrongdoing, cultivating purity until attainment. If one’s virtue surpasses that of the past, one may prostrate and swear three times, then petition to restore one’s former rank, reckoning merit to extend life. The Dao does not fail humanity.\n\n**The third precept**: Do not engage in deceit, theft, or avarice, nor covet others’ possessions or obstruct their aspirations. Nor may one teach others to steal, covet possessions, or seize what others cherish. Violating this precept incurs a deduction of one hundred twenty years from one’s celestial allotment. A single transgression shortens one’s lifespan by four years and obstructs affairs for four years. One must examine one’s faults, reflect on errors, and accumulate merit to cultivate virtue. If one’s virtue surpasses that of the past, one may prostrate and swear three times, then petition to restore one’s former rank, reckoning merit to extend life. The Dao does not fail humanity.\n\n**The fourth precept**: Do not consume alcohol, commit adultery with others’ wives, engage in licentious conduct, or exploit public office for private gain. Nor may one teach others to drink, seduce others’ spouses, engage in licentious conduct, or exploit public office for private gain. Violating this precept incurs a deduction of one hundred twenty years from one’s celestial allotment. A single transgression shortens one’s lifespan by four years and obstructs affairs for four years. One must reflect on errors, examine one’s faults, and establish merit to atone for wrongdoing. If one’s virtue surpasses that of the past, one may prostrate and swear three times, then petition to restore one’s former rank, reckoning merit to extend life. The Dao does not fail humanity.\n\n**The fifth precept**: Do not slander, envy, or poison others, nor engage in malicious scheming, harm the virtuous, or burn others’ dwellings. Nor may one teach others to slander, envy, or poison, engage in malicious scheming, harm the virtuous, burn dwellings, destroy gates and doors, or seek vengeance. Violating this precept incurs a deduction of one hundred twenty years from one’s celestial allotment. A single transgression shortens one’s lifespan by three years and obstructs affairs for three years. One must examine one’s faults, reflect on errors, and establish merit to atone for wrongdoing. If one’s merit surpasses that of the past, one may prostrate and swear three times, then petition to restore one’s former rank, reckoning merit to extend life. The Dao does not fail humanity.\n\nAs for Daoists and libationers who do not receive the Dharma precepts, neglect their Daoist conduct, and violate the various prohibitions, their memorials and petitions go unheard, and their attempts at deliverance often prove ineffective. This is because their practice lacks proper method and discipline, entangling them in the trials of wine and meat, the height of carelessness. Since the ascension of the Three Sages, the true statutes have fallen into obscurity, repeatedly subjected to the world’s disdain. The Dharma regulations have scattered, and ancient canons are no longer preserved. Even if libationers have not received the precepts, their names are already marked as universally forbidden in the registers. In recent times, when submitting memorials, inconsistencies abound, and many petitions to the celestial bureaus go unanswered or unvalidated. If one in a hundred proves effective, it is due to the sincerity of virtuous petitioners whose devotion moves the highest powers, prompting the Celestial Thearch to shield and permit their pleas. The merit lies in preserving life, not in the libationer’s memorials. Yet foolish masters, seizing upon the rare success of a devout petitioner’s earnest plea, claim it as their own achievement, then intimidate the people, making endless demands. Unaware of the hidden consequences, they incur indictments, have their names stricken from the rolls of the living, and their lifespans shortened, soon meeting an untimely end. Though minor transgressions may not immediately invite punishment, one should not assume Heaven and Earth are vast and overlook small faults. If one accrues minor merit, the reckoning of errors may be deferred, prolonging the delay. Those who escape minor trials do so because their hidden sins are grave, already marked for expulsion. Only after annihilation are they consigned to the torments of knife mountains and sword trees, hence the absence of minor trials. The foolish, unaware of this, assume their sins go unpunished, believing Heaven permits indulgence. They claim the heavens are boundless and do not scrutinize minor faults, thus incurring no reckoning. Utterly deluded, they compound their daily errors, even asserting that Heaven and Earth are without spirits. Those who warn them are dismissed as deceivers, unaware they are already marked for expulsion, their doom imminent and unforeseen. How can one deceive the luminous heavens? The foolish, ignorant of the Dao’s weight, regard it lightly. I grieve for them with a pained heart. Let each clearly discern and diligently cultivate goodness, avoiding greed and impurity, for the consequences of sin are not light.\n\nThe Highest Statutes state: Daoists and libationers, both men and women, who receive the true and ultimate Dharma, the precious scriptures of the Highest Dao, and the correct governance of stellar lodges, and who hold ranks of True Unity or above, must also receive the Five Precepts of the Dharma Trial and the Great Precepts of Karmic Conditions, even if they are virtuous and devoted. Those who receive the ultimate Dharma but neglect these Five Precepts will not have their names inscribed on the cinnabar tablets of the Immortal Capital. Their names will be absent from the Jade Register and the Ink Ledger, and their ghostly names will not be erased from the White Records of the Three Offices. After passing, they will remain as lower ghosts, their souls denied immortality, subjected to endless trials, and their misfortunes extending to their descendants. The efficacy of Daoist devotees’ sincerity or negligence is addressed elsewhere, recorded after the Ink Ledger’s upper section.\n\nThe Highest Statutes state: Those who study the Dao should be diligent and earnest, establishing merit to atone for the sins of their seven ancestral generations, advancing the immortal names of their family and themselves, and escaping the ten sufferings and eight difficulties. They must receive the Five Precepts of the Dharma Trial, establish merit and virtue, seek inscription in the Jade Register of the Immortal Capital, and erase their names from the White Ledgers of the Three Offices and the death registers.",
      "overlap_context": "rma Trial.\n\nThe text of the precepts is as follows:\n\n1. **The first precept**: Do not fail to revere Heaven, nor claim that Heaven has no spirits. Do not call the Earth ghostless, nor treat the earth deities, mountains, rivers, and great marshes with disdain, digging and boring without restraint. To declare that Heaven and Earth are without numen is to commit a transgression without fear. Nor may one teach others to treat Heaven and Earth with disrespect, claiming there are no spirits or ghosts.",
      "start_char": 1293,
      "end_char": 2531,
      "start_sentence": 55,
      "end_sentence": 100,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.73612833023071,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八素真经修习功业妙诀.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "汝等为道徒，受大法内外真契，积历年载，而用行不合自然，又不受法难五戒，身犯酒肉贪秽，道行无法，故犯愆恶，亡算减命，死为下鬼，不免刀山剑树之楚，涂酷之心，为之痛心痛心。 汝曹为道，明依法戒，奉行三年不倦，克获延年，天算加益。 天曹一年三考墨箓，计功益算纪，司命奏上，分别善恶，即度功德着左契，犯恶非度着右契，事有炳然。 道不负人，但人信真者少，罪法犯戒者多，故罹罪坐愆尔。 明各慎之，慎之为善。 凡为道士、祭酒、男女官，受真法，请求仙度，延续生命，并行戒法，立功补过，医治百姓，表章旨御者，当由修练斋直，奉受法戒，不违科制，举向从愿，计功升度，禄寿不訾也。 高上科曰：其有出自贵分，虽不受此戒之文，用行已合自然，不须复受科戒。 自古及今多有此人，然今时百中获有一耳，不可准以为例。 要标其德行合科戒者，自非抗志绝尚之人，故须科戒成生道业，如此不可不宣告戒制也。 高上科曰：凡欲学道求真，於世立功建德，纪名上天，升度仙官者，当受法难五戒，依法戒行道三年，功立真名，然后表上仙都，纪在丹简，上讳玉历，仙籍名立，司命宣勑五岳，告下三官，纪知真人，削灭三官死籍白簿，除去鬼名，然后正可得为修学道士、祭酒尔。 如此真名勤在仙都，所奏无不彻闻。 既不受戒，又不精苦，仙都无有功名，表章启奏悉备停奏，是为道行无闻，徒损民人敬向纸笔、香油之费，更受吞藏酒肉之考，魂神常被讼对，凡向不利。 或有冒法未被考坐，或是卷首三官未有死籍，常见好事，恶事未至者； 或是宿有冤对，考官故迷其心，罪并重论，故不被小考，近使脏满，并入驱除夭终之也。 岂不痛哉痛哉。 始学道士、祭酒、男女官，汝曹欲修命，清苦求真，并制鬼治病，立有验效，为百姓所崇，当受法难五戒。 既受戒，仙都便以纪名，修勤三年，不犯法目，司命列奉，上白天帝，纪名玉历，便，受真人之散号，能制鬼治病，无不明效。 如此之善，可不修乎。 道士、祭酒、男女官，欲修学制鬼治病，当受太上中台成生五戒。 既受此戒，仙都正位，丹简有录，功勤三年，标名上勒玉历，天帝曹即考校功勤，勒山川五岳四渎三官录纪，知汝曹精进积感之功，名标玄都天神、玄都地祇所钦，百鬼所伏，救治表奏上达，汝曹徒受中外大事，真一之妙，不受法难，不慎五戒，则仙都无位，玉历无名，身受祭酒藏秽之罪，五岳四渎三官鬼神所不敬畏，章奏寝不被呈御。 坐其好走里巷，贪浊毁辱，不知改忤，违科犯忌，司命随事纠奏，减夺寿算。 既为人师，冒法小事，不足数考，蒙其知悔，故并之重论。",
      "translated_text": "You, as Daoist disciples, have received the great inner and outer true covenants of the Dharma, accumulating years of practice, yet your conduct does not align with the natural Way. Moreover, you have not accepted the Five Precepts of the Dharma Trial, your bodies defiled by wine, meat, and greed, your Daoist practice devoid of method. Thus, you commit transgressions and evil, forfeiting your destined years and shortening your lives. Upon death, you become lower ghosts, unable to escape the torments of blade mountains and sword trees, the cruel agonies of boiling cauldrons—how grievous, how grievous indeed!\n\nYou who follow the Dao must clearly adhere to the precepts and laws, practicing diligently for three years without weariness, thereby gaining longevity and the augmentation of your heavenly allotment. The Heavenly Bureau reviews the Ink Ledgers thrice yearly, calculating merits to extend your destined years. The Director of Destinies submits these records above, distinguishing good from evil. Meritorious deeds are inscribed on the left covenant, while transgressions and unexpiated faults are recorded on the right—all matters made manifestly clear.\n\nThe Dao does not fail humanity; rather, few truly believe, while many violate the precepts and laws, thus incurring guilt and suffering punishment. Take heed, all of you, and be cautious in your conduct. Caution itself is virtue.\n\nAll Daoist priests, libationers, and male and female officials who receive the true Dharma, seek immortal deliverance, prolong life, uphold the precepts, establish merit to atone for transgressions, heal the people, and present memorials to the throne must engage in purification rites, observe the precepts, and not transgress the statutes. By fulfilling their vows, they may calculate their merits for promotion and ascension, their blessings and longevity boundless.\n\nThe Highest Statutes state: There are those born of noble rank whose conduct already aligns with the natural Way, though they have not received these precepts in writing. They need not undergo the formal precepts again. From ancient times to the present, such individuals exist, though in this age, scarcely one in a hundred may be found. They cannot be taken as a standard. Only those whose virtue and conduct conform to the precepts—those of lofty aspiration and unwavering resolve—may establish the Daoist enterprise through the precepts. Thus, the precepts and statutes must be proclaimed without fail.\n\nThe Highest Statutes state: All who wish to study the Dao and seek truth, establishing merit and virtue in the world, inscribing their names in the heavens, and ascending to the ranks of immortal officials must receive the Five Precepts of the Dharma Trial. They must practice the Dao in accordance with the precepts for three years, establishing true merit before presenting a memorial to the Immortal Capital. Their names are inscribed on the Cinnabar Registers, recorded in the Jade Calendar above, and their immortal titles are established. The Director of Destinies issues decrees to the Five Peaks, notifying the Three Offices to acknowledge them as perfected persons, erasing their names from the White Ledgers of death and removing their ghostly designations. Only then may they rightfully be called Daoist priests or libationers in training.\n\nThus, their true names and diligent efforts are recorded in the Immortal Capital, and all their memorials are heard without obstruction. Those who neither receive the precepts nor practice with earnest diligence have no merit or name in the Immortal Capital. Their memorials and petitions are all suspended, their Daoist practice unrecognized. They merely waste the people’s offerings of paper, ink, incense, and oil, while enduring the trials of consuming wine and meat. Their souls are constantly subjected to litigation, and their worldly endeavors meet with misfortune.\n\nSome may evade punishment for violating the laws, or their names may not yet appear in the death registers of the Three Offices, so they only encounter good fortune, with misfortune yet to befall them. Others may have long-standing grievances, and the examining officials deliberately obscure their judgment, compounding their offenses for severe adjudication. Thus, they avoid minor trials, only to accumulate impurities until they are driven to premature death. How lamentable, how lamentable indeed!\n\nNovice Daoist priests, libationers, and male and female officials—you who wish to cultivate life, endure hardship in seeking truth, subdue ghosts, and heal illnesses with proven efficacy, revered by the people—must receive the Five Precepts of the Dharma Trial. Once received, your names are recorded in the Immortal Capital. After three years of diligent practice without violating the precepts, the Director of Destinies submits your merits to the Heavenly Emperor. Your names are inscribed in the Jade Calendar, and you receive the dispersed titles of perfected persons, capable of subduing ghosts and healing illnesses with unfailing efficacy. Such goodness—how can it not be cultivated?\n\nDaoist priests, libationers, and male and female officials who wish to study the arts of subduing ghosts and healing illnesses must receive the Five Precepts of the Middle Terrace for Establishing Life. Upon receiving these precepts, their positions are rectified in the Immortal Capital, their names recorded in the Cinnabar Registers. After three years of meritorious effort, their names are inscribed in the Jade Calendar above. The Heavenly Bureau then reviews their merits, recording them in the registers of the mountains, rivers, Five Peaks, Four Waterways, and Three Offices. Knowing of your diligent accumulation of merit, your names are revered by the celestial deities of the Mysterious Capital and the earthly spirits of the Dark Capital, subduing all ghosts. Your healing and memorials ascend above, and you undertake great inner and outer affairs, mastering the wonders of the True Unity.\n\nIf you do not receive the Dharma Trial or heed the Five Precepts, you will have no position in the Immortal Capital, no name in the Jade Calendar. You will incur the sins of libationers who conceal defilement, disrespected by the gods of the Five Peaks, Four Waterways, Three Offices, and all spirits. Your memorials will be suppressed and unpresented. For indulging in wandering alleys, greed, and defilement, refusing to reform your transgressions, violating the statutes and taboos, the Director of Destinies will impeach and report your deeds, diminishing your destined years.\n\nThough you may be teachers of others, minor violations of the laws are not counted among the trials. If you show remorse, your offenses may be compounded for severe judgment.",
      "overlap_context": "es state: Those who study the Dao should be diligent and earnest, establishing merit to atone for the sins of their seven ancestral generations, advancing the immortal names of their family and themselves, and escaping the ten sufferings and eight difficulties. They must receive the Five Precepts of the Dharma Trial, establish merit and virtue, seek inscription in the Jade Register of the Immortal Capital, and erase their names from the White Ledgers of the Three Offices and the death registers.",
      "start_char": 2531,
      "end_char": 3545,
      "start_sentence": 101,
      "end_sentence": 122,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.66505575180054,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八素真经修习功业妙诀.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "今人愚痴，谓为愆目下未病，便言天地不知其罪，又云无神，不知阴考已奏。 既有冤对小事，故不数奏者，欲积其脏满，并在驱除之例尔。 如此死名已定，不复小考，奄被大除，夭折当世，不终三寿，罪目兼重，复加刀山火霍之楚，死为下鬼，长被痛毒，当可言乎。 汝辈受真，外欲立功救治，欲练气三元，养神续命，当访求明师，奉行法戒，勿贪酒肉，沉湎相逐不轨之事，过无大小，悉受纠奏。 唯晨夕斋直，积功补过，仰希玄泽，停年住考尔。 如此延续性命，还其年算，与之更始，功过相补，细而不漏。 汝曹明各慎之，慎之修练，保得长在不朽。 高上科曰：道士、祭酒、男女官，汝欲修炼太清神丹，并练三元牝牡之术，冥身山泽，思仙养志者，先受成生五戒。 又经七试九炼，摧性忍弱，被人凌辱，不以怨耻者； 又不以外想邪心，静神专一者；",
      "translated_text": "Now, the foolish among men, deluded and blind, suppose that so long as their transgressions bring no immediate affliction, Heaven and Earth remain unaware of their sins, or even claim there are no gods—unaware that their hidden misdeeds have already been memorialized in the unseen courts. Though minor grievances may not be reported at once, this is but to accumulate their filth until the measure is full, whereupon they shall be swept away in the great purgation. Thus, their doom is sealed: no minor reckoning shall delay the final verdict. Suddenly, they are struck down in their prime, cut short before attaining the three spans of life. Their crimes compounded, they endure the torments of blade-mountains and fire-whirls, dying to become lowly ghosts, forever subjected to agony—how can this be borne?\n\nYou who have received the True Teaching, though outwardly you seek merit in healing and salvation, and inwardly aspire to refine the Three Origins, nurture the spirit, and prolong life, must first seek out enlightened masters and uphold the Dharma Precepts. Do not indulge in wine and meat, nor sink into dissipation, nor pursue wayward deeds. Every transgression, great or small, shall be impeached and reported. Only through dawn-to-dusk vigilance, accumulating merit to redress faults, and reverently awaiting the mysterious grace of the Dao may you halt the depletion of your years and await judgment.\n\nThus may you extend your life, restore your allotted span, and begin anew, where merit and fault offset one another in the most minute accounting. Take heed, all of you—take heed in your cultivation, that you may preserve your immortality.\n\nThe Highest Statutes decree: Daoists, libationers, and officials of both sexes—you who wish to refine the Divine Elixir of Great Clarity, master the arts of the Three Origins’ Yin and Yang, or seclude yourselves in mountains and marshes to contemplate immortality and nurture your resolve—must first receive the Five Precepts of Preserving Life. You must further endure the Seven Trials and Nine Refinements, crushing your nature to endure humiliation, bearing others’ scorn without resentment; and you must not entertain wayward thoughts or stray desires, but keep the spirit serene and undivided.",
      "overlap_context": "ur Waterways, Three Offices, and all spirits. Your memorials will be suppressed and unpresented. For indulging in wandering alleys, greed, and defilement, refusing to reform your transgressions, violating the statutes and taboos, the Director of Destinies will impeach and report your deeds, diminishing your destined years.\n\nThough you may be teachers of others, minor violations of the laws are not counted among the trials. If you show remorse, your offenses may be compounded for severe judgment.",
      "start_char": 3545,
      "end_char": 3879,
      "start_sentence": 123,
      "end_sentence": 132,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.315574407577515,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八素真经修习功业妙诀.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "又当忍受饥寒，委辱不恚不坠者； 又当积勤立功广大，济度厄急，拔度死命，受更生之始者； 又当箪食精苦，阴德广着，天未报功，不敢希望者； 勋义感彻，积勤之大，身婴困弊，远近无问，不敢自悼者； 弘惠流布，更被曲辱，不以为害，皆此智德大矣。 其德有五，自非冥心笃好，不能立此行也。 是故有五德之号，其至甚重大矣哉。 学道积年，乃经十折九辱，秽恶横加，犹怀慊恪忍弱之仁，此为一智。 强行广博，好尚内外，导养三元，五神不伤，迈而不衰，容色不悴，是为有恒，其为二智。 尚修不退，周流八方，一清一沉，一浊一浮，勤功世间，不纪不名，积德不已，敢以为劳，其为三智。 阴结药气，含德养性，展转九年，中至二十四年，上至三十二年，积苦效勤，而横被曲折，愍念不计，恬靖自居，恒无功可纪，更怀忧切，其智四矣。 为道既无世功相及，少修师教，伏勤师门，而中遭祸构，散荡弊真，经十折万忍，犹怀颐颐，不硎於口，其智五也。 高上科曰：凡人学道，守心贞一，施行善笃，终未感悟，又经历七试九折，心无恚退，奉行五戒，合於五智，不违法戒，不亏经教，幽静恬和，行及无为，久染风尘，曲辱不计，遭逢凶横，叩搏乞过，累遭轗轲，不以为恚，殊更施惠自幸，布乞於人，恒惧失先功勤，恐宿缘深重，收致不利，有此巍巍之德，勋着旷大，不名为劳，清净丹苦，殊更坚恪，惧坠渊谷，不朝则夕，如此之智，真为厚大。 德行如此，正可以立道行，行之五年，恬然无欲，可得投身林隐，托命岩薮。 汝等求道修命，延寿人间，当先处曲室，和神养志，导练三元，积勤专到，上感灵真，身被灾咎，不求申论，曲辱不利，欢心颐颐，不以为否。 行此五戒，成生五智，道行清洁，克功巍巍之重，未敢希报、反更勇猛精进，常所未能相及。 其功既积，何求不得，何愿不合，何叩不闻，何志不成耶。 高上科曰：仙有九品，术有三十六门，又有百二十禁法，皆延生之原要。 未有依科求志，苦到而不获者乎。 但患人修学无勤，思道不专，执无恒，无有同心志契者，道安可修乎。 但闻朝施暮望，轻忽正教，谓无灵感，多有悭贪媾辱，沦逐酒肉之座，无志精苦於玄元，施为混错，罪盘於天府，魂思闭击，考楚於地狱，未蒙判析，故宜深思自改，勤施德专，以求真明之效。 有智之人，闻而行之，奉慎五戒，不亦妙乎。 小斋法，主人供一贤德，一日一人长钱一百，米菜茶果蜜姜之属。 中斋，千食供，一人一日长钱二百，米菜香花灯烛茶果蜜姜之属。 右二件，计人请齐官，人率增之。 又一条，其困病祈请斋，菜食如小斋之法。 灵宝延年斋，千食随主人供，唯不得杀生犯科尔。 上清转经清寂山林长斋，米菜服食菜食为恒，不在钱数之料。 右五等如品格。 太一闭房舍丹药百日大斋法，不在钱限之例。 古者盟誓金彩之属，今以丹青四十尺，金环一双代之也。 洞真太上八素真经修习功业妙诀竟",
      "translated_text": "Once more, you must endure hunger and cold, bearing humiliation without resentment or faltering. You must accumulate diligent merit on a vast scale, rescuing those in dire straits and delivering lives from death, that you may receive the beginning of renewed existence. You must subsist on meager fare in utmost austerity, amassing hidden virtue until it shines forth, yet when Heaven has not yet repaid your merit, you dare not entertain hope. When your meritorious deeds and righteousness move all to reverence, when your accumulated diligence is great, yet your body is beset by hardship and ruin, when none near or far inquire after you, you dare not lament your plight. When vast kindness flows forth, yet you suffer further unjust humiliation without taking it as harm—such is the greatness of wisdom and virtue.\n\nThere are five virtues, and without profound devotion and earnest love, none can establish such conduct. Thus, they are called the Five Virtues, and their weight is most grave indeed. Those who study the Dao for years endure tenfold trials and ninefold humiliations, with filth and malice heaped upon them, yet still harbor the compassion of forbearance and meekness—this is the first wisdom. To practice vigorously and broadly, esteeming both inner and outer cultivation, nurturing the Three Origins so that the Five Spirits remain unharmed, advancing without decline, your countenance never withering—this is constancy, the second wisdom. To persist in cultivation without retreat, traversing the eight directions, now ascending in clarity, now descending in turbidity, now floating, now sinking, diligently serving the world without seeking record or fame, accumulating virtue without cease, and never daring to deem it labor—this is the third wisdom. To inwardly refine medicinal qi, embodying virtue to nurture your nature, turning through nine years, or even twenty-four, or up to thirty-two years, enduring hardship and proving your diligence, yet suffering unjust setbacks without reckoning or complaint, dwelling in tranquil serenity, never recording merit, yet ever more deeply concerned—this is the fourth wisdom. When your Daoist practice yields no worldly merit, when you have but briefly followed your master’s teachings and devoted yourself to their gate, yet midway encounter calamity, your true nature scattered and ruined, enduring ten thousand trials of forbearance, yet still maintaining a gentle demeanor, never grinding your teeth in anger—this is the fifth wisdom.\n\nThe Highest Statutes decree: All who study the Dao must guard their hearts with steadfast singularity, practice goodness with sincerity, and though they have not yet attained enlightenment, having endured the Seven Trials and Nine Tribulations without resentment or retreat, upholding the Five Precepts and aligning with the Five Wisdoms, never transgressing the precepts or neglecting the scriptures, dwelling in secluded tranquility and harmonious non-action—even after long immersion in the dust of the world, they do not reckon unjust humiliation; when encountering misfortune and adversity, they knock upon their breasts and beg forgiveness, enduring repeated hardships without resentment, instead ever more generously bestowing kindness, humbly entreating others, ever fearful of losing past merit and diligence, ever anxious that deep karmic obstacles may bring misfortune. Those who possess such towering virtue, whose merit is vast and boundless, never deeming it labor, purifying their elixir through austerity, ever more resolute, ever fearful of falling into the abyss, whether by morning or by evening—such wisdom is truly profound and great.\n\nWith such virtue and conduct, one may truly establish the Daoist path. After five years of practice, serene and free from desire, one may withdraw to the forests and secluded peaks to entrust one’s fate. You who seek the Dao and refine your life to extend your years among mortals must first dwell in seclusion, harmonizing your spirit and nurturing your resolve, guiding and refining the Three Origins, accumulating diligence with single-minded devotion. When the numinous perfected respond from on high, and your body is beset by misfortune, you do not seek redress; when unjust humiliation and adversity befall you, you remain joyful and composed, never taking it as misfortune. By practicing these Five Precepts and perfecting the Five Wisdoms, your Daoist conduct becomes pure, your merit towering and weighty—yet you dare not hope for reward, instead redoubling your courage and advancing with ever greater vigor, surpassing all you once could not. With merit thus accumulated, what could you not attain? What wish would not be fulfilled? What plea would go unheard? What aspiration would not be realized?\n\nThe Highest Statutes decree: Immortals have nine ranks, arts have thirty-six gates, and there are one hundred twenty prohibitions—all essential to the foundation of extending life. Yet there has never been one who, following the statutes and enduring hardship, did not attain their goal. The only obstacle is that practitioners lack diligence, their thoughts of the Dao are not single-minded, they lack constancy, and have no like-minded companions to share their resolve—how then can the Dao be cultivated? Some hear of morning deeds and expect evening rewards, lightly dismissing the true teachings as devoid of numinous response. Many are stingy and greedy, indulging in humiliation, sinking into the company of wine and meat, lacking the resolve to endure austerity for the Mysterious Origin. Their conduct is confused and disordered, their sins piled high in the celestial archives, their souls tormented and battered, suffering punishment in the earthly prisons—until judgment is passed. Thus, one must deeply reflect and reform, diligently practicing virtue with single-minded devotion to seek the efficacy of true illumination. Those of wisdom, hearing this, will practice it, reverently upholding the Five Precepts—is this not wondrous?\n\n**Lesser Fasting Ritual:**\nThe host provides for one virtuous person, with one person contributing one hundred coins per day, along with rice, vegetables, tea, fruit, honey, and ginger.\n\n**Middle Fasting Ritual:**\nA thousand meals are offered, with one person contributing two hundred coins per day, along with rice, vegetables, incense, flowers, lamps, candles, tea, fruit, honey, and ginger.\n\nThe above two rites are calculated per person invited, with each participant contributing accordingly.\n\n**Another Rule:**\nFor fasting rituals to relieve illness or distress, the vegetarian offerings follow the Lesser Fasting Ritual.\n\n**Lingbao Longevity Fasting:**\nA thousand meals are provided at the host’s discretion, with the sole prohibition against killing living beings or violating the statutes.\n\n**Shangqing Scripture-Recitation and Secluded Mountain Forest Fasting:**\nRice and vegetables are consumed regularly, with no fixed monetary contribution.\n\nThe above five grades follow their respective standards.\n\n**Great Fasting Ritual of the Great One’s Secluded Chamber for Elixir Refinement (One Hundred Days):**\nThis is not subject to monetary limits.\n\nIn ancient times, oaths were sworn with gold and silk; now, they are replaced with forty feet of cinnabar and silk, and a pair of gold rings.\n\nHere ends the wondrous essentials of the practice and merits of the *Wondrous Scripture of the Eight Pure Ones of the Highest Perfected of the Cavernous Truth*.",
      "overlap_context": "ine the Divine Elixir of Great Clarity, master the arts of the Three Origins’ Yin and Yang, or seclude yourselves in mountains and marshes to contemplate immortality and nurture your resolve—must first receive the Five Precepts of Preserving Life. You must further endure the Seven Trials and Nine Refinements, crushing your nature to endure humiliation, bearing others’ scorn without resentment; and you must not entertain wayward thoughts or stray desires, but keep the spirit serene and undivided.",
      "start_char": 3879,
      "end_char": 5038,
      "start_sentence": 133,
      "end_sentence": 164,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.13589382171631,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\洞真太上八素真经修习功业妙诀.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}