{
  "source_id": "洪恩灵济真君集福晚朝仪",
  "source_file": "chunked_daozang\\洪恩灵济真君集福晚朝仪.json",
  "total_chunks": 5,
  "total_original_chars": 2632,
  "total_translated_chars": 18229,
  "total_translation_time": 99.20376324653625,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君集福晚朝仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**Rite of the Evening Audience for Gathering Blessings of the Venerable Sovereign of Vast Grace and Numinous Aid**\n\n**Scripture Title:** *Rite of the Evening Audience for Gathering Blessings of the Venerable Sovereign of Vast Grace and Numinous Aid*\n**Author:** Unknown\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Section of Cavernous Mystery (Dongxuan)*, *Category of Dignified Rites*\n\n---\n\n**Rite of the Evening Audience for Gathering Blessings of the Venerable Sovereign of Vast Grace and Numinous Aid**\n\nThe ritual proceeds according to form. Each pays reverence to the master and maintains mindfulness as prescribed.\n\n**Invocation of the Divine Incantation:**\nThe radiance of divine light illumines brightly,\nAuspicious qi swirls in encompassing grace.\nThe Dipper and Ladle gleam with limpid splendor,\nThe halls of lingzhi mushrooms stand serene.\nEyes of jade and spirits of gold—pure perfection,\nThe precious altar is wholly of the Qian trigram.\nTransforming night into day,\nReversing midnight to noon.\nThe Great Flower streams forth its hues,\nThe vermilion phoenix soars in mystery.\nQuelling demons and vanquishing treachery,\nIt strides aloft through propitious mist.\nThe Perfected of Heaven gather in full,\nAll arriving before the Celestial Emperor.\n\n**Strike the Dharma Drum twenty-four times.**\n\n**Invocation of the Most High Mysterious Origin, the Five Numinous Venerable Lords:**\nSummon forth from within this servant’s body the Three and Five Merit Officials, the Attendants of the Left and Right, the Golden Lads of Incense Transmission, the Jade Maidens of Message-Bearing, the Incense Officials of the Current Day, the Merit Officials and Envoys, the Three Qi Correct Spirits.\nHasten to report above to the Five Great Marshals—Wei, Zhao, Diao, and the Boundary Marshals—Yue and Xu, the Heavenly Ding Warriors, the Divine Officials of the Left and Right.\nOn this evening audience, ascending the altar to expound affairs:\nWe, in reverent compliance with the Sacred Edict, have recorded all intentions and submitted them above.\nMay the qi of the Correct and Perfected be bestowed, descending to flow into our bodies, that the words we now present may swiftly reach the Celestial Golden Palace of the Venerable Sovereign of Vast Grace, the Jade Palace of the Nine Heavens of the Venerable Sovereign of Vast Grace.\n\n**Proclamation of the Dharma Titles:**\nWe, your humble servants [Name] and the assembled altar officials, with utmost sincerity, jointly address and reverently invoke:\nThe Great Immortal of the Golden Palace of the Nine Heavens, Illuminator of the Dao, Attainer of Virtue, Manifest in Numinous Aid, Vast in Salvation, Pure and Subtle, Cavernously Mysterious, Voidly Wondrous, Compassionate and Benevolent, Protector of the State and Shelter of the People—**Venerable Sovereign of Vast Grace**;\nThe Supreme Immortal of the Jade Palace of the Nine Heavens, Proclaimer of Transformation, Upholder of the Teachings, Radiant in Numinous Aid, Vast in Salvation, Lofty and Serene, Profound and Tranquil, Responsive to Benevolence, Assistant to the State and Protector of the People—**Venerable Sovereign of Vast Grace**;\n**Sacred Father, Loyal and Martial True Lord of Qi**;\n**Sacred Mother, Benevolent and Longevous, Kind and Virtuous Immortal Consort**;\n**Sacred Consort, Lady of Jing State, Aider of Benevolence, Upholder of Chastity, Responsive and Virtuous Immortal Consort**;\n**Lady of Wei State, Aider of Kindness, Gracious and Serene Immortal Consort**;\n**Sacred Brothers: Prince Tangyu, Prince Hong, Prince E, Prince Guangling**;\n**Sacred Uncles: Duke of State Protection, Duke of State Service**;\n**Sacred Sons-in-Law: Marquis of Martial Peace, Marquis of State Tranquility**;\n**Sacred Sons: Marquis of Preserving Greatness, Marquis of Manifest Trust, Marquis of Preserving Trust, Marquis of Preserving Tranquility, Duke of Martial Tranquility**;\n**Sacred Nephews: Marquis of Illustrious Virtue, Marquis of Peace and Stability, Marquis of Supreme Tranquility**;\n**Sacred Grandsons: Marquis of Martial Prosperity, Marquis of Southern Prosperity**;\nAll the sacred sons, grandsons, and nephews, the various dukes and marquises;\n**Immortal Consort of the Tang King, Illustrious and Solemn**;\n**Immortal Consort of the Hong King, Benevolent and Kind**;\n**Immortal Consort of the E King, Compliant and Gracious**;\n**Immortal Consort of the Guangling King, Auspicious and Joyous**;\n**Sacred Daughters: Immortal Ladies of Pure Grace, Illustrious Grace**;\n**Sacred Daughters-in-Law: Ladies of Kind Grace, Gentle Benevolence, Gracious Compliance, Illustrious Grace, Compliant Reverence, Illustrious Wisdom, Reverent Grace, Serene Grace, Illustrious and Harmonious, Benevolent and Filial**;\nAll the sacred daughters-in-law, the various ladies.\n\nThe **Officials and Generals of the Heavenly Mechanism Bureau of the Great Register of Supreme Purity, the Thunder Ministry, the Celestial Patterns Bureau, and the Earthly Offices**, who drive away evil, seize malevolent spirits, transmit talismans and edicts, dispel calamities and deliver from distress, expel misfortune and ward off monstrosities, oversee the altar and protect the Dharma;\nThe **Generals of Observation and Patrol**;\nThe **Venerable Spirits of the Twelve Monthly Marshals**;\nThe **Star Officials of the Original Destiny of One’s Life**;\nThe **Immortal Hosts of the Wind, Thunder, and Rain Departments**;\nThe **Left and Right Chancellors, Grand Masters, and Lesser Masters**;\nThe **Ministers of the Six Ministries, the Inner Court Dukes and Ministers**;\nThe **Left and Right Supreme Ministers of Life Registration and Longevity Registration**;\nThe **Left and Right Supreme Ministers of Emolument and Fortune**;\nThe **Left and Right Attendants, Envoys, and Gentlemen of Communication**;\nThe **Various Officials and Clerks of the Hundred Offices and Ministries**;\nThe **Officials and Clerks of the Twenty-Four Bureaus under the Left and Right Bureaus of Fortune and Emolument**;\nThe **Left and Right Escorting Immortal Officials**;\n**Lady of Smooth Success**;\n**Ladies of Illustrious Splendor, Comely Grace, Cultivated Demeanor, Cultivated Bearing, Illustrious Bearing**;\n**Ladies of the Inner Canon, Weaving and Sericulture, Mat and Storehouse, Account Records, Fiscal Affairs**;\nAll the **Talented Ladies, Female Invocators, Female Attendants, and Noble Ladies**;\nAll the **Sacred Kin and Ladies of the Inner Palace**;\nThe **Ladies of the Hall of Joyous Celebration**:\nThe **Heavenly One of Life Registration of the Life-Regulating Bureau**;\nThe **Supreme Ministers of Emolument and Destiny**;\nThe **Ladies of Embryo Protection and Chamber Guardianship**;\nThe **Ladies of Embryo Preservation and Life Protection**;\nThe **Left and Right Ladies of Benevolent Instruction**;\nThe **Ladies of Transmission and Protection**;\nThe **Left and Right Ladies of Record-Keeping**;\nThe **Lady of Seal-Keeping**;\nThe **Ladies of Nursing, Embracing and Delivering, Nurturing, and Midwives of Transformation**;\n**Marshal Cha, Guardian of Eternal Peace**;\n**Marshal Bian, Guardian of Martial Peace**;\n**Marshal Wei, Left Gatekeeper and Military Commissioner**;\n**Marshal Zhao, Right Gatekeeper and Commander of the United Armies**;\n**Marshal Diao, Commander of the Vanguard**;\nThe **Valiant Generals and Fierce Soldiers under the Five Marshals**;\nThe **Left and Right Marshals Yue and Xu**;\nThe **Attendants and Officials of the Left and Right Traveling Palaces**;\nThe **Officials of Emolument, Merit, Personnel, and Records**;\nThe **Officials of Agriculture, Husbandry, Silk, and Hemp**;\nThe **Officials of Markets, Commerce, Craftsmanship, and Material Refinement**;\nThe **Kitchen Officials, Entertainers, and Musicians**;\nThe **Divine, Spiritual, and Human Agile Ones**;\nThe **Officials of Divination, Lots, Cups, and Phoenix**;\nThe **Lads of Dream Transmission**;\nThe **Ranked Officers of the Spirit Bureau**;\nThe **Altar-Attending and Talisman-Bearing Incense Officials and Envoys**;\nThe **Earth Gods and Assembled Numinous Spirits of the Temple of Numinous Aid**.\n\nMay all deign to gaze upon us with vast compassion and condescend to scrutinize us with penetrating insight.\n\nWe have heard that movement gives rise to yang, stillness gives rise to yin, and the wondrous subtleties of the Dao secretly emerge from the Supreme Ultimate.\n\nRites speak of reverence, virtue speaks of abundance, and the canons of ceremonial observances are fully recorded in the liturgical codes. The ceaseless mechanism of movement manifests the resplendent virtue of cherishing life. Dragon scripts and phoenix seals gather the radiance of stars and sun. Whirlwind chariots and feathered conveyances descend in solemnity from the clouds and heavens to the earth. The court’s rites are solemnly observed, and the audience is grandly held; the offerings of the jiao rite are presented with earnest words. The grace of imperial favor is majestically bestowed upon the imperial banners, and the thick fragrance of incense drifts through the evening hall. The scrutiny is illustrious, and the regard and acceptance are without omission. The long-held aspirations are earnest and lofty, and the original sincerity remains unswerving. The assembly of the hundred spirits and host of perfected beings, the ten directions and three realms, all arrive in unison. The fast is for serving Heaven, and the august countenance is seen most near; as dusk falls into evening, the joyous radiance shines forth in splendor. Crimson clouds and vermilion mists soar, auspicious stars and propitious clouds gleam brilliantly. In stately and majestic array, august and resplendent, they witness the sincerity of the jiao offerings and bestow abundant and manifold blessings.\n\nOn this evening audience, ascending the altar to perform the Dao, the assembled ritualists now present the first pinch of incense, chanting in harmony: *The incense reaches the Palace of Numinous Aid, pervading the Nine Heavens’ Golden Gates to form a canopy of blossoms, offering to the Manifestly Numinous and Vastly Beneficent Perfected Lord.* May this fragrant smoke offer to the Vastly Beneficent Perfected Lord of the Nine Heavens’ Golden Gates and the Vastly Beneficent Perfected Lord of the Nine Heavens’ Jade Gates. We, your servants, take refuge in body, spirit, and life to the host of perfected immortals and sagely beings of the Palace of Numinous Aid. May the merit of this pinch of incense be dedicated to the Vastly Beneficent Perfected Lords of the Nine Heavens’ Golden and Jade Gates, that they may illumine the Dao and attain virtue, broadly benefiting all with manifest numinosity. May their literary splendor shine in the celestial mechanisms, their radiance illuminating the stars; may their mighty prestige resound in the Thunder Department, governing the revolutions of yin and yang. Blossoms unite in brilliance, ocarinas and flutes play in succession; their divine works are beyond recounting, their sagely transformations are boundless. Thus, we now burn incense, taking refuge in the virtue of the Great Sages and host of perfected beings, the Perfected Lords. Since attaining the Dao, they have preserved Heaven and endured eternally, chanting in harmony: *In union with the Dao, they merge with the Perfected.*\n\nWe have heard that fragrant mists fill the sky, and evening clouds congeal in emerald. The earnest aspirations of morning attendance and the vigilant hearts of evening watchfulness—on this evening audience, ascending the altar to perform the Dao, we now present the second pinch of incense, chanting in harmony: *The incense reaches the Palace of Numinous Aid, pervading the Nine Heavens’ Jade Gates to form a canopy of treasures, offering to the Manifestly Numinous and Vastly Beneficent Perfected Lord.* May this fragrant smoke offer to the Vastly Beneficent Perfected Lords of the Nine Heavens’ Golden and Jade Gates and the host of perfected immortals and sagely beings of the Palace of Numinous Aid. We, your servants, take refuge in body, spirit, and life to the host of perfected immortals and sagely beings of the Palace of Numinous Aid. May the merit of this pinch of incense be dedicated to the supreme prayer for His Imperial Majesty, that the Dao may unite with Heaven and Earth, and his wisdom may shine like the sun and moon. May the jade chart of ten thousand generations remain firm, and the nine-tiered imperial repast be honored and secure. May rains be timely and winds harmonious, the people prosperous and creatures abundant; may the hundred officials be loyal and reverent, and all ranks just and incorrupt.\n\nAt the frontier, the dust settles, as shields and spears are stilled and martial might laid to rest. In villages and hamlets, virtue transforms, as plows and sowing return the people to farming. Perfect governance unfolds without striving, and the signs of Great Peace appear.\n\nThus we now burn incense, taking refuge in the virtue of the Perfected Lords, the Great Sages, and the host of perfected immortals. Since attaining the Dao, they have preserved Heaven’s enduring existence. *Harmonizing with the Dao, uniting with the Real.*\n\nWe, your servants, have heard that Heaven’s net is vast in its clarity, and the sun sets to rest. The fragrance of incense scatters like wind through the hall, while the moon of wisdom hangs in the mid-heaven.\n\nOn this evening audience, ascending the altar to perform the Dao, we, the assembly of ritualists, offer this third pinch of incense. *Harmonizing: May the incense reach the Palace of Numinous Aid, spreading through the palaces of the Nine Heavens to form a canopy of clouds, offering to the perfected immortals and sagely beings of the Palace of Numinous Aid.*\n\nMay the merit of this incense smoke be dedicated to the Vastly Beneficent Perfected Lords of the Nine Heavens’ Golden and Jade Gates and the host of perfected immortals and sagely beings of the Palace of Numinous Aid. We, your servants, take refuge in body, spirit, and life to the host of perfected immortals and sagely beings of the Palace of Numinous Aid. May the merit of this pinch of incense flow to the heir apparent, the imperial princes, the chief ministers and officials, the people of the realm, and all beings within the four seas.\n\nWe humbly pray that the first goodness of spring may melt away, and the six dusts disperse like clouds. May karmic obstructions and habitual tendencies dissolve, while vows and practices deepen through cultivation. May the two luminaries and five phases radiate auspicious light in brilliance; may the six palaces and hundred offices turn the wheel of propitious qi in harmony. May the jade body remain pure and balanced, and the golden branches flourish and multiply.\n\nThus we now burn incense, taking refuge in the virtue of the Perfected Lords, the Great Sages, and the host of perfected immortals. Since attaining the Dao, may they forever preserve eternal life. *Harmonizing with the Dao, uniting with the Real.*\n\n*Chant the directions. Repent.*\n\n**Threefold Invocation, Triple Bows, Reaffirming the Dharma-Seats**\n\nWe, the humble officiant [Name], together with all present at this altar, reverently and earnestly offer this solemn petition:\n\nTo the **Perfected Lords of the Golden Towers of the Nine Heavens, Vast Grace True Lords**; to the **Perfected Lords of the Jade Towers of the Nine Heavens, Vast Grace True Lords**; to the **host of perfected immortals and sacred assembly of the Palace of Numinous Aid**; and to all majestic spirits invoked in this rite—\n\nWe have heard that the **Dao** is most exalted, **virtue** most noble, their subtlety and wonder merging in wordless silence. Vast in transformation, sagely and numinous, their responsive resonance flows unseen, as if winged. Ninefold are the heavens, veiled in mystery; thrice daily do we reverently pray—profound within, boundless above.\n\nWe, your servants, heed the sacred edicts with reverence, diligently following the mystic model in our morning devotions. The altar is adorned with pine blossoms and lustral herbs, our minds racing to the Great Desert. We gaze upon the crimson banners and jade wheels, shimmering in the distant skies, our eyes fixed upon the layered heavens.\n\nWe revere the **Pure Capital**, yearning for the **Numinous Aid**. Beholding the defilements of the six dusts, we redouble our vigilance like ice. Tasting the profundity of the **Three Caverns**, we have long relied upon their cloud-like shelter. We humbly seek the guidance of those who have attained, entreating with unwavering sincerity.\n\nMay our highest prayers ascend:\nThat the **sacred lifespan** equal the heavens, the **imperial radiance** rival the sun.\nMay jade and silk flow from distant isles, and weapons of war be forever cleansed at the frontiers.\nMay blessings reach the heir’s palace, granting abundant peace and well-being; may grace extend to the vassal lords, uniting all in purity and honor.\nMay the counsels of loyal ministers shine ever brighter, and all people ascend to benevolence and longevity.\nMay the palace chambers know tranquility, and the **Dao’s** transformative power spread its light.\n\nThus shall the luminous teachings of the **True Lords’** great compassion be fulfilled above, and our devotion in taking refuge below be answered.\n\nWe respectfully present this petition.\n\n**Twelve Vows, Visualizing the Spirit, Burning Incense**\n\n**Incense Officials, Divine Envoys, Left and Right Spirit Lords, Attendant Incense Spirits**—may this place of our evening audience naturally birth golden elixirs, cinnabar mushrooms, and azure herbs. May the **hundred spirits and host of perfected ones** gather here before this incense burner.\n\nMay our sincere hearts shine through, the rite’s offerings be perfected. May the **jade maidens and immortal youths of the ten directions** attend the orchid-scented smoke, conveying our petition swiftly and directly to the **Perfected Lords of the Golden Towers of the Nine Heavens, Vast Grace True Lords**, and the **Perfected Lords of the Jade Towers of the Nine Heavens, Vast Grace True Lords**.\n\n**Hymn of Exiting the Hall, Exiting the Chamber**\n\n**Rite of the Vast Grace Numinous Aid Perfected Lord’s Evening Gathering for Blessings Concluded**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洪恩灵济真君集福晚朝仪 经名：洪恩灵济真君集福晚朝仪。 撰人不详。 一卷。 底本出处：《正统道藏》洞玄部威仪类。 洪恩灵济真君集福晚朝仪 法事如式 各礼师存念如法 请宣神咒 神光朗照，瑞气匝旋。 箕斗澄辉，芝宇晏然。 玉眸金真，宝坛纯乾。 变夜作昼，回子午前。 太华流彩，丹凤飞玄。 息魔灭奸，高步祥烟。 天真普集，齐到帝前。 呜法鼓二十四通 太上玄元五灵老君，召出臣身中三五功曹、左右官使者、侍香金童，传言玉女，直日香官，功曹使者，三炁正神。 速上关启查边魏赵刁五大元帅，岳许二元帅，天丁力士，左右神官。 以今晚朝，升坛阐事。 臣等钦奉圣旨，其诸意旨，已录上闻。 愿得正真生炁，下降流入臣等身中，令今所启之言，速达九天金阙洪恩真君、九天玉阙洪恩真君圣前。 请称法位 具位臣某，与临坛官众等，谨同诚上启：九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君， 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛应仁惠辅国佑民洪恩真君， 圣父齐王忠武斓亮真君， 圣母仁寿淑善仙妃， 圣妃泾国夫人顺助仁惠贞应仙妃， 卫国夫人善助慈懿恭静仙妃， 圣兄唐玉、洪王、鄂王、广陵王，圣舅护国公、奉国公，圣婿武安侯、宁国侯，圣子保大侯、彰信侯、保信侯、保宁侯、武宁公，圣侄昭德侯、安定侯、太宁侯，圣孙武昌侯、南昌侯，圣子圣孙圣侄列位公侯，唐王后明肃仙妃，洪王后仁慈仙妃，鄂王后顺懿仙妃，广陵王后善庆仙妃，圣女冲懿仙姬、明懿仙姬，圣妇善懿夫人、仁柔夫人、惠顺夫人、昭懿夫人、顺恭夫人、明哲夫人、恭懿夫人、靖懿夫人、昭穆夫人、慈孝夫人、圣妇列位夫人。 上清大洞箓天机院雷霆省天文院地府诸司承行官将，驱邪捉祟，传符勅法，消灾度厄，逐凶辟怪，监坛护法，观察巡捕将军，太岁尊神十二月将，本命元辰星官，风雷雨部仙众，左右丞相太宰少宰，六部尚侍内府公卿，左右注生注寿上宰，左右司禄司福上宰，左右侍从通事舍人，百官庶司所属曹僚列位公卿，左右福禄司所属二十四司曹官典，左右引进仙官，内侍顺成夫人，昭华夫人、容华夫人、修容夫人，修仪夫人，昭仪夫人，内典妇功夫人，丝枲夫人，莞库夫人，帐籍夫人，度支夫人，女府女史列位才人，女祝女御列位贵人，内殿内侍内典列位圣眷夫人，燕喜堂内注生司天一注生神后、太乙监生神后，司禄司命上相夫人，守胎卫房夫人，保胎护命夫人，左右慈训夫人，保传夫人，左右掌籍夫人，掌印夫人，诸宫乳哺夫人、抱送夫人、抚育夫人、托生化婆神，永安留守查元帅，武安留守边元帅，节度使左监门魏元帅，都统军使右监门赵元帅，都监军使先锋刁元帅，五帅部下精兵猛将，左右岳、许二元帅，左右行宫侍御从官，司禄、司勋、司士、司书、列位曹僚，司农、司稼、典丝、掌葛列位曹僚，司市、掌货、考工、饬材列位曹僚，厨官、优官、伶官，天捷、神捷、人捷，掌卜，掌签，掌杯、掌鸾，传梦童子，神局节级，直殿直符香官使者，灵济宫土地合属威灵。 咸望洪慈，俯垂洞鉴。 臣闻动生阳，静生阴，道妙密生於太极。",
      "translated_text": "**Rite of the Evening Audience for Gathering Blessings of the Venerable Sovereign of Vast Grace and Numinous Aid**\n\n**Scripture Title:** *Rite of the Evening Audience for Gathering Blessings of the Venerable Sovereign of Vast Grace and Numinous Aid*\n**Author:** Unknown\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Section of Cavernous Mystery (Dongxuan)*, *Category of Dignified Rites*\n\n---\n\n**Rite of the Evening Audience for Gathering Blessings of the Venerable Sovereign of Vast Grace and Numinous Aid**\n\nThe ritual proceeds according to form. Each pays reverence to the master and maintains mindfulness as prescribed.\n\n**Invocation of the Divine Incantation:**\nThe radiance of divine light illumines brightly,\nAuspicious qi swirls in encompassing grace.\nThe Dipper and Ladle gleam with limpid splendor,\nThe halls of lingzhi mushrooms stand serene.\nEyes of jade and spirits of gold—pure perfection,\nThe precious altar is wholly of the Qian trigram.\nTransforming night into day,\nReversing midnight to noon.\nThe Great Flower streams forth its hues,\nThe vermilion phoenix soars in mystery.\nQuelling demons and vanquishing treachery,\nIt strides aloft through propitious mist.\nThe Perfected of Heaven gather in full,\nAll arriving before the Celestial Emperor.\n\n**Strike the Dharma Drum twenty-four times.**\n\n**Invocation of the Most High Mysterious Origin, the Five Numinous Venerable Lords:**\nSummon forth from within this servant’s body the Three and Five Merit Officials, the Attendants of the Left and Right, the Golden Lads of Incense Transmission, the Jade Maidens of Message-Bearing, the Incense Officials of the Current Day, the Merit Officials and Envoys, the Three Qi Correct Spirits.\nHasten to report above to the Five Great Marshals—Wei, Zhao, Diao, and the Boundary Marshals—Yue and Xu, the Heavenly Ding Warriors, the Divine Officials of the Left and Right.\nOn this evening audience, ascending the altar to expound affairs:\nWe, in reverent compliance with the Sacred Edict, have recorded all intentions and submitted them above.\nMay the qi of the Correct and Perfected be bestowed, descending to flow into our bodies, that the words we now present may swiftly reach the Celestial Golden Palace of the Venerable Sovereign of Vast Grace, the Jade Palace of the Nine Heavens of the Venerable Sovereign of Vast Grace.\n\n**Proclamation of the Dharma Titles:**\nWe, your humble servants [Name] and the assembled altar officials, with utmost sincerity, jointly address and reverently invoke:\nThe Great Immortal of the Golden Palace of the Nine Heavens, Illuminator of the Dao, Attainer of Virtue, Manifest in Numinous Aid, Vast in Salvation, Pure and Subtle, Cavernously Mysterious, Voidly Wondrous, Compassionate and Benevolent, Protector of the State and Shelter of the People—**Venerable Sovereign of Vast Grace**;\nThe Supreme Immortal of the Jade Palace of the Nine Heavens, Proclaimer of Transformation, Upholder of the Teachings, Radiant in Numinous Aid, Vast in Salvation, Lofty and Serene, Profound and Tranquil, Responsive to Benevolence, Assistant to the State and Protector of the People—**Venerable Sovereign of Vast Grace**;\n**Sacred Father, Loyal and Martial True Lord of Qi**;\n**Sacred Mother, Benevolent and Longevous, Kind and Virtuous Immortal Consort**;\n**Sacred Consort, Lady of Jing State, Aider of Benevolence, Upholder of Chastity, Responsive and Virtuous Immortal Consort**;\n**Lady of Wei State, Aider of Kindness, Gracious and Serene Immortal Consort**;\n**Sacred Brothers: Prince Tangyu, Prince Hong, Prince E, Prince Guangling**;\n**Sacred Uncles: Duke of State Protection, Duke of State Service**;\n**Sacred Sons-in-Law: Marquis of Martial Peace, Marquis of State Tranquility**;\n**Sacred Sons: Marquis of Preserving Greatness, Marquis of Manifest Trust, Marquis of Preserving Trust, Marquis of Preserving Tranquility, Duke of Martial Tranquility**;\n**Sacred Nephews: Marquis of Illustrious Virtue, Marquis of Peace and Stability, Marquis of Supreme Tranquility**;\n**Sacred Grandsons: Marquis of Martial Prosperity, Marquis of Southern Prosperity**;\nAll the sacred sons, grandsons, and nephews, the various dukes and marquises;\n**Immortal Consort of the Tang King, Illustrious and Solemn**;\n**Immortal Consort of the Hong King, Benevolent and Kind**;\n**Immortal Consort of the E King, Compliant and Gracious**;\n**Immortal Consort of the Guangling King, Auspicious and Joyous**;\n**Sacred Daughters: Immortal Ladies of Pure Grace, Illustrious Grace**;\n**Sacred Daughters-in-Law: Ladies of Kind Grace, Gentle Benevolence, Gracious Compliance, Illustrious Grace, Compliant Reverence, Illustrious Wisdom, Reverent Grace, Serene Grace, Illustrious and Harmonious, Benevolent and Filial**;\nAll the sacred daughters-in-law, the various ladies.\n\nThe **Officials and Generals of the Heavenly Mechanism Bureau of the Great Register of Supreme Purity, the Thunder Ministry, the Celestial Patterns Bureau, and the Earthly Offices**, who drive away evil, seize malevolent spirits, transmit talismans and edicts, dispel calamities and deliver from distress, expel misfortune and ward off monstrosities, oversee the altar and protect the Dharma;\nThe **Generals of Observation and Patrol**;\nThe **Venerable Spirits of the Twelve Monthly Marshals**;\nThe **Star Officials of the Original Destiny of One’s Life**;\nThe **Immortal Hosts of the Wind, Thunder, and Rain Departments**;\nThe **Left and Right Chancellors, Grand Masters, and Lesser Masters**;\nThe **Ministers of the Six Ministries, the Inner Court Dukes and Ministers**;\nThe **Left and Right Supreme Ministers of Life Registration and Longevity Registration**;\nThe **Left and Right Supreme Ministers of Emolument and Fortune**;\nThe **Left and Right Attendants, Envoys, and Gentlemen of Communication**;\nThe **Various Officials and Clerks of the Hundred Offices and Ministries**;\nThe **Officials and Clerks of the Twenty-Four Bureaus under the Left and Right Bureaus of Fortune and Emolument**;\nThe **Left and Right Escorting Immortal Officials**;\n**Lady of Smooth Success**;\n**Ladies of Illustrious Splendor, Comely Grace, Cultivated Demeanor, Cultivated Bearing, Illustrious Bearing**;\n**Ladies of the Inner Canon, Weaving and Sericulture, Mat and Storehouse, Account Records, Fiscal Affairs**;\nAll the **Talented Ladies, Female Invocators, Female Attendants, and Noble Ladies**;\nAll the **Sacred Kin and Ladies of the Inner Palace**;\nThe **Ladies of the Hall of Joyous Celebration**:\nThe **Heavenly One of Life Registration of the Life-Regulating Bureau**;\nThe **Supreme Ministers of Emolument and Destiny**;\nThe **Ladies of Embryo Protection and Chamber Guardianship**;\nThe **Ladies of Embryo Preservation and Life Protection**;\nThe **Left and Right Ladies of Benevolent Instruction**;\nThe **Ladies of Transmission and Protection**;\nThe **Left and Right Ladies of Record-Keeping**;\nThe **Lady of Seal-Keeping**;\nThe **Ladies of Nursing, Embracing and Delivering, Nurturing, and Midwives of Transformation**;\n**Marshal Cha, Guardian of Eternal Peace**;\n**Marshal Bian, Guardian of Martial Peace**;\n**Marshal Wei, Left Gatekeeper and Military Commissioner**;\n**Marshal Zhao, Right Gatekeeper and Commander of the United Armies**;\n**Marshal Diao, Commander of the Vanguard**;\nThe **Valiant Generals and Fierce Soldiers under the Five Marshals**;\nThe **Left and Right Marshals Yue and Xu**;\nThe **Attendants and Officials of the Left and Right Traveling Palaces**;\nThe **Officials of Emolument, Merit, Personnel, and Records**;\nThe **Officials of Agriculture, Husbandry, Silk, and Hemp**;\nThe **Officials of Markets, Commerce, Craftsmanship, and Material Refinement**;\nThe **Kitchen Officials, Entertainers, and Musicians**;\nThe **Divine, Spiritual, and Human Agile Ones**;\nThe **Officials of Divination, Lots, Cups, and Phoenix**;\nThe **Lads of Dream Transmission**;\nThe **Ranked Officers of the Spirit Bureau**;\nThe **Altar-Attending and Talisman-Bearing Incense Officials and Envoys**;\nThe **Earth Gods and Assembled Numinous Spirits of the Temple of Numinous Aid**.\n\nMay all deign to gaze upon us with vast compassion and condescend to scrutinize us with penetrating insight.\n\nWe have heard that movement gives rise to yang, stillness gives rise to yin, and the wondrous subtleties of the Dao secretly emerge from the Supreme Ultimate.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1238,
      "start_sentence": 0,
      "end_sentence": 32,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.97433161735535,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君集福晚朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "礼言恭，德言盛，典仪备载於斋科。 运行不息之机，丕显好生之德。 龙文凤篆，集星日之辉煌。 飙车羽输，俨云霄而陆降。 肃朝仪而肆觐，奉醮悃以敷言，恩光俨格於宸斿，香炁浓飘於夕殿。 鉴临有赫，顾飨无遗。 拳拳夙志之颙，耿耿初心之素。 百灵众真之交会，十方三界以齐临。 斋以事天，睹威颜之孔迩； 暮焉日夕，喜光耀以腾辉。 绛霞丹雾之飞扬，景星庆云之灿煜。 跄跄济济，穆穆皇皇，鉴醮享之精诚，介骈蕃之景福。 以今晚朝，升坛行道，请法众等，运兹初捻上香，和：香至灵济宫，遍九天金阙成华盖，供养显灵溥济洪恩真君。 愿此香烟，供养九天金阙洪恩真君、九天玉阙洪恩真君。 臣等皈身皈神皈命灵济宫真仙众圣，愿以是捻香功德，洪惟九天金阙洪恩真君、九天玉阙洪恩真君，明道达德，博济昭灵。 焕文彩於天机，光芒星斗； 震声威於雷部，斡运阴阳。 华萼联辉，埙箎迭奏，神功难纪，圣化无方。 今故烧香，自皈依真君大圣众至真之德，得道之后，保天长存，和：与道合真。 臣闻香雾俘空，暮云凝碧。 耿耿朝趋之志，拳拳夕惕之心，以今晚朝，升坛行道，运兹二捻上香，和：香至灵济宫，遍九天玉阙成宝盖，供养昭灵博济洪恩真君。 愿此香烟，供养九天金阙洪恩真君，九天玉阙洪恩真君、灵济宫真仙圣众。 臣等皈身皈神皈命灵济宫真仙众圣，愿以是捻香功德，上祝皇帝陛下，恭愿道合乾坤，明同日月。 万载之瑶图巩固，九重之玉食尊安。 雨顺风调，民康物阜，百僚忠谨，庶位公廉。",
      "translated_text": "Rites speak of reverence, virtue speaks of abundance, and the canons of ceremonial observances are fully recorded in the liturgical codes. The ceaseless mechanism of movement manifests the resplendent virtue of cherishing life. Dragon scripts and phoenix seals gather the radiance of stars and sun. Whirlwind chariots and feathered conveyances descend in solemnity from the clouds and heavens to the earth. The court’s rites are solemnly observed, and the audience is grandly held; the offerings of the jiao rite are presented with earnest words. The grace of imperial favor is majestically bestowed upon the imperial banners, and the thick fragrance of incense drifts through the evening hall. The scrutiny is illustrious, and the regard and acceptance are without omission. The long-held aspirations are earnest and lofty, and the original sincerity remains unswerving. The assembly of the hundred spirits and host of perfected beings, the ten directions and three realms, all arrive in unison. The fast is for serving Heaven, and the august countenance is seen most near; as dusk falls into evening, the joyous radiance shines forth in splendor. Crimson clouds and vermilion mists soar, auspicious stars and propitious clouds gleam brilliantly. In stately and majestic array, august and resplendent, they witness the sincerity of the jiao offerings and bestow abundant and manifold blessings.\n\nOn this evening audience, ascending the altar to perform the Dao, the assembled ritualists now present the first pinch of incense, chanting in harmony: *The incense reaches the Palace of Numinous Aid, pervading the Nine Heavens’ Golden Gates to form a canopy of blossoms, offering to the Manifestly Numinous and Vastly Beneficent Perfected Lord.* May this fragrant smoke offer to the Vastly Beneficent Perfected Lord of the Nine Heavens’ Golden Gates and the Vastly Beneficent Perfected Lord of the Nine Heavens’ Jade Gates. We, your servants, take refuge in body, spirit, and life to the host of perfected immortals and sagely beings of the Palace of Numinous Aid. May the merit of this pinch of incense be dedicated to the Vastly Beneficent Perfected Lords of the Nine Heavens’ Golden and Jade Gates, that they may illumine the Dao and attain virtue, broadly benefiting all with manifest numinosity. May their literary splendor shine in the celestial mechanisms, their radiance illuminating the stars; may their mighty prestige resound in the Thunder Department, governing the revolutions of yin and yang. Blossoms unite in brilliance, ocarinas and flutes play in succession; their divine works are beyond recounting, their sagely transformations are boundless. Thus, we now burn incense, taking refuge in the virtue of the Great Sages and host of perfected beings, the Perfected Lords. Since attaining the Dao, they have preserved Heaven and endured eternally, chanting in harmony: *In union with the Dao, they merge with the Perfected.*\n\nWe have heard that fragrant mists fill the sky, and evening clouds congeal in emerald. The earnest aspirations of morning attendance and the vigilant hearts of evening watchfulness—on this evening audience, ascending the altar to perform the Dao, we now present the second pinch of incense, chanting in harmony: *The incense reaches the Palace of Numinous Aid, pervading the Nine Heavens’ Jade Gates to form a canopy of treasures, offering to the Manifestly Numinous and Vastly Beneficent Perfected Lord.* May this fragrant smoke offer to the Vastly Beneficent Perfected Lords of the Nine Heavens’ Golden and Jade Gates and the host of perfected immortals and sagely beings of the Palace of Numinous Aid. We, your servants, take refuge in body, spirit, and life to the host of perfected immortals and sagely beings of the Palace of Numinous Aid. May the merit of this pinch of incense be dedicated to the supreme prayer for His Imperial Majesty, that the Dao may unite with Heaven and Earth, and his wisdom may shine like the sun and moon. May the jade chart of ten thousand generations remain firm, and the nine-tiered imperial repast be honored and secure. May rains be timely and winds harmonious, the people prosperous and creatures abundant; may the hundred officials be loyal and reverent, and all ranks just and incorrupt.",
      "overlap_context": "ads of Dream Transmission**;\nThe **Ranked Officers of the Spirit Bureau**;\nThe **Altar-Attending and Talisman-Bearing Incense Officials and Envoys**;\nThe **Earth Gods and Assembled Numinous Spirits of the Temple of Numinous Aid**.\n\nMay all deign to gaze upon us with vast compassion and condescend to scrutinize us with penetrating insight.\n\nWe have heard that movement gives rise to yang, stillness gives rise to yin, and the wondrous subtleties of the Dao secretly emerge from the Supreme Ultimate.",
      "start_char": 1238,
      "end_char": 1823,
      "start_sentence": 33,
      "end_sentence": 57,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.21529984474182,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君集福晚朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "边鄙尘清，戢干戈而偃武。 闾阎德化，力耕稼以归农。 至治无为，太平有象。 今故烧香，自皈依真君大圣众至真之德，得道之后，保天长存，和：与道合真。 臣闻天维显思，日入而息。 散香风於合殿，悬慧月於中天。 以今晚朝，升坛行道，请法众等，运兹三捻上香，和：香至灵济宫，遍九天宫阙成云盖，供养灵济宫真仙圣众。 愿此香烟，供养九天金阙洪恩真君、九天玉阙洪恩真君、灵济宫真仙圣众。 臣等皈身皈神皈命灵济宫真仙众圣，愿以是捻香功德，归流储宫藩屏、宰辅臣僚，天下人民，寰中庶类。 伏愿一善春融，六尘云散，无障缘之结习，增行愿以熏修。 二曜五行，焕祥光而朗照； 六宫百辟，转瑞气以和融。 玉体清调，金枝茂衍。 今故烧香，自皈依真君、大圣众至真之德，得道之后，永保长生，和：与道合真。 唱方 忏悔",
      "translated_text": "At the frontier, the dust settles, as shields and spears are stilled and martial might laid to rest. In villages and hamlets, virtue transforms, as plows and sowing return the people to farming. Perfect governance unfolds without striving, and the signs of Great Peace appear.\n\nThus we now burn incense, taking refuge in the virtue of the Perfected Lords, the Great Sages, and the host of perfected immortals. Since attaining the Dao, they have preserved Heaven’s enduring existence. *Harmonizing with the Dao, uniting with the Real.*\n\nWe, your servants, have heard that Heaven’s net is vast in its clarity, and the sun sets to rest. The fragrance of incense scatters like wind through the hall, while the moon of wisdom hangs in the mid-heaven.\n\nOn this evening audience, ascending the altar to perform the Dao, we, the assembly of ritualists, offer this third pinch of incense. *Harmonizing: May the incense reach the Palace of Numinous Aid, spreading through the palaces of the Nine Heavens to form a canopy of clouds, offering to the perfected immortals and sagely beings of the Palace of Numinous Aid.*\n\nMay the merit of this incense smoke be dedicated to the Vastly Beneficent Perfected Lords of the Nine Heavens’ Golden and Jade Gates and the host of perfected immortals and sagely beings of the Palace of Numinous Aid. We, your servants, take refuge in body, spirit, and life to the host of perfected immortals and sagely beings of the Palace of Numinous Aid. May the merit of this pinch of incense flow to the heir apparent, the imperial princes, the chief ministers and officials, the people of the realm, and all beings within the four seas.\n\nWe humbly pray that the first goodness of spring may melt away, and the six dusts disperse like clouds. May karmic obstructions and habitual tendencies dissolve, while vows and practices deepen through cultivation. May the two luminaries and five phases radiate auspicious light in brilliance; may the six palaces and hundred offices turn the wheel of propitious qi in harmony. May the jade body remain pure and balanced, and the golden branches flourish and multiply.\n\nThus we now burn incense, taking refuge in the virtue of the Perfected Lords, the Great Sages, and the host of perfected immortals. Since attaining the Dao, may they forever preserve eternal life. *Harmonizing with the Dao, uniting with the Real.*\n\n*Chant the directions. Repent.*",
      "overlap_context": "of Numinous Aid. May the merit of this pinch of incense be dedicated to the supreme prayer for His Imperial Majesty, that the Dao may unite with Heaven and Earth, and his wisdom may shine like the sun and moon. May the jade chart of ten thousand generations remain firm, and the nine-tiered imperial repast be honored and secure. May rains be timely and winds harmonious, the people prosperous and creatures abundant; may the hundred officials be loyal and reverent, and all ranks just and incorrupt.",
      "start_char": 1823,
      "end_char": 2156,
      "start_sentence": 58,
      "end_sentence": 73,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.353416919708252,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君集福晚朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "三启颂 三礼 重称法位 具位某，与临坛官众等，谨重诚上启：九天金阙洪恩真君，九天玉阙洪恩真君灵济宫真仙圣众，醮筵设像一切威灵。 臣闻道之尊，德之贵，希微妙合於无言。 大而化，圣而神，应响潜通於有翼。 天九重而密勿，日三接以虔祈，洞洞乎中，洋洋在上。 臣等钦奉纶音而昭事，恪遵玄范以朝修。 醮松花蕴藻以斋明，驰心太漠。 瞻绛节琼轮之缥缈，注目层霄。 臣等敬仰清都，翘勤灵济。 顾六尘之障染，倍切冰兢。 味三洞之渊微，久依云覆。 丐汲提之有造，庶恳祷以无遗。 上愿圣寿齐天，皇明并日。 玉帛远来於海岛，甲兵永洗於边陲。 福及储宫，茂介康宁之祉，恩流藩屏，同臻清浄之荣。 弼谟益着於忠良，民庶咸跻於仁寿。 宫闱宁谧，道化光扬，则上明真君大慈之化，下副臣等皈命之诚。 谨启以闻。 十二愿 存神烧香 香官使者、左右神君、侍香诸灵官，当令臣向来晚朝之所，自然生金液丹碧芝英，百灵众真，交会在此香火炉前。 当愿诚心昭彻，醮款圆成，十方仙童玉女，接侍兰烟，传臣向来所启之言，速达径诣九天金阙洪恩真君、九天玉阙洪恩真君圣前。 出堂颂 出户",
      "translated_text": "**Threefold Invocation, Triple Bows, Reaffirming the Dharma-Seats**\n\nWe, the humble officiant [Name], together with all present at this altar, reverently and earnestly offer this solemn petition:\n\nTo the **Perfected Lords of the Golden Towers of the Nine Heavens, Vast Grace True Lords**; to the **Perfected Lords of the Jade Towers of the Nine Heavens, Vast Grace True Lords**; to the **host of perfected immortals and sacred assembly of the Palace of Numinous Aid**; and to all majestic spirits invoked in this rite—\n\nWe have heard that the **Dao** is most exalted, **virtue** most noble, their subtlety and wonder merging in wordless silence. Vast in transformation, sagely and numinous, their responsive resonance flows unseen, as if winged. Ninefold are the heavens, veiled in mystery; thrice daily do we reverently pray—profound within, boundless above.\n\nWe, your servants, heed the sacred edicts with reverence, diligently following the mystic model in our morning devotions. The altar is adorned with pine blossoms and lustral herbs, our minds racing to the Great Desert. We gaze upon the crimson banners and jade wheels, shimmering in the distant skies, our eyes fixed upon the layered heavens.\n\nWe revere the **Pure Capital**, yearning for the **Numinous Aid**. Beholding the defilements of the six dusts, we redouble our vigilance like ice. Tasting the profundity of the **Three Caverns**, we have long relied upon their cloud-like shelter. We humbly seek the guidance of those who have attained, entreating with unwavering sincerity.\n\nMay our highest prayers ascend:\nThat the **sacred lifespan** equal the heavens, the **imperial radiance** rival the sun.\nMay jade and silk flow from distant isles, and weapons of war be forever cleansed at the frontiers.\nMay blessings reach the heir’s palace, granting abundant peace and well-being; may grace extend to the vassal lords, uniting all in purity and honor.\nMay the counsels of loyal ministers shine ever brighter, and all people ascend to benevolence and longevity.\nMay the palace chambers know tranquility, and the **Dao’s** transformative power spread its light.\n\nThus shall the luminous teachings of the **True Lords’** great compassion be fulfilled above, and our devotion in taking refuge below be answered.\n\nWe respectfully present this petition.\n\n**Twelve Vows, Visualizing the Spirit, Burning Incense**\n\n**Incense Officials, Divine Envoys, Left and Right Spirit Lords, Attendant Incense Spirits**—may this place of our evening audience naturally birth golden elixirs, cinnabar mushrooms, and azure herbs. May the **hundred spirits and host of perfected ones** gather here before this incense burner.\n\nMay our sincere hearts shine through, the rite’s offerings be perfected. May the **jade maidens and immortal youths of the ten directions** attend the orchid-scented smoke, conveying our petition swiftly and directly to the **Perfected Lords of the Golden Towers of the Nine Heavens, Vast Grace True Lords**, and the **Perfected Lords of the Jade Towers of the Nine Heavens, Vast Grace True Lords**.\n\n**Hymn of Exiting the Hall, Exiting the Chamber**",
      "overlap_context": "ses radiate auspicious light in brilliance; may the six palaces and hundred offices turn the wheel of propitious qi in harmony. May the jade body remain pure and balanced, and the golden branches flourish and multiply.\n\nThus we now burn incense, taking refuge in the virtue of the Perfected Lords, the Great Sages, and the host of perfected immortals. Since attaining the Dao, may they forever preserve eternal life. *Harmonizing with the Dao, uniting with the Real.*\n\n*Chant the directions. Repent.*",
      "start_char": 2156,
      "end_char": 2618,
      "start_sentence": 74,
      "end_sentence": 99,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.558616399765015,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君集福晚朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "洪恩灵济真君集福晚期仪竟",
      "translated_text": "**Rite of the Vast Grace Numinous Aid Perfected Lord’s Evening Gathering for Blessings Concluded**",
      "overlap_context": "d ones** gather here before this incense burner.\n\nMay our sincere hearts shine through, the rite’s offerings be perfected. May the **jade maidens and immortal youths of the ten directions** attend the orchid-scented smoke, conveying our petition swiftly and directly to the **Perfected Lords of the Golden Towers of the Nine Heavens, Vast Grace True Lords**, and the **Perfected Lords of the Jade Towers of the Nine Heavens, Vast Grace True Lords**.\n\n**Hymn of Exiting the Hall, Exiting the Chamber**",
      "start_char": 2618,
      "end_char": 2633,
      "start_sentence": 100,
      "end_sentence": 100,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 1.1020984649658203,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君集福晚朝仪.txt",
        "category": "威仪类"
      }
    }
  ]
}