{
  "source_id": "洪恩灵济真君七政星灯仪",
  "source_file": "chunked_daozang\\洪恩灵济真君七政星灯仪.json",
  "total_chunks": 6,
  "total_original_chars": 5390,
  "total_translated_chars": 36556,
  "total_translation_time": 189.53169465065002,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君七政星灯仪.txt",
    "category": "威仪类"
  },
  "full_translation": "The *Rite of the Seven Luminaries’ Lamps for the Venerable Lord of Vast Grace and Numinous Salvation*\n\n**Title:** *Rite of the Seven Luminaries’ Lamps for the Venerable Lord of Vast Grace and Numinous Salvation*\n**Author:** Unknown\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongxuan* Section, *Weiyi* Category\n\n---\n\n**Rite of the Seven Luminaries’ Lamps for the Venerable Lord of Vast Grace and Numinous Salvation**\n*Proceedings as Prescribed*\n\nThe Great Dao shines resplendent, its silent virtue ever-responsive.\nWith reverent care, every prayer finds its way.\n\nDevoutly we kindle the true incense, offering with utmost sincerity:\nTo the Venerable Lord of Vast Grace—\nTranscendent Immortal of the Golden Towers of the Nine Heavens, who embodies the Dao and manifests its power, whose numinous salvation pervades the Pure and Subtle, the Cavernous and Mysterious, the Void and Wondrous, whose compassion and kindness shield the realm and shelter the people;\nTo the Venerable Lord of Vast Grace—\nExalted Immortal of the Jade Towers of the Nine Heavens, who proclaims transformation and upholds the teaching, whose radiant and boundless salvation is vast and luminous, serene and profound, wondrously responsive, benevolent and merciful, aiding the realm and protecting the people;\nAnd to all the divine immortals and spirit-officials of the Palace of Numinous Salvation, we make this common offering.\n\nWe humbly recall: when the Dragon Han first unfolded the cosmic pattern, the primordial qi of the Mysterious and Original divided. When the Turtle Peak first took form, the positions of Heaven, Earth, and Humanity were fixed.\nYet for mortals, the Great Dao is rarely encountered, and birth in the Middle Land is hard to attain. Endowed with yang and sustained by yin, with limbs properly aligned, one must esteem this form, preserve this life, and keep the myriad qi ever-abiding.\nYet all fear the sorrows of old age, sickness, and death, and each delights in longevity, growth, and beauty.\nHuman desires are many, but Heaven shows no partiality.\nWhy are some granted wealth while others suffer poverty?\nWhy does Pengzu enjoy longevity while Yanling meets an early end?\nIf not by the reckoning of fate, then seek the answer within yourself.\n\nAt that time, the Venerable Lord of Numinous Salvation, wandering in the sacred precincts of the Jade Clarity, in the radiance of the Emperor’s reign and the brilliance of Heaven’s mandate, established a great karmic connection and expounded for the assembly:\n“The Five Celestial Bodies I govern—now waxing, now waning, never constant.\nThe Two Luminaries I traverse—now heat, now cold, in perfect order.”\n\nTo follow the Way brings prosperity and joy; to defy it invites calamity and sorrow. Only jade-like sincerity can move the gods, and thus the accumulation of good deeds must yield abundant blessings. Bathed in the radiance of your illumination, how dare we forget our humble gratitude?\n\nOn this day, the humble Daoist devotee [Name], reverently opens the sacred altar and presents modest offerings. In accordance with the Jade Calendar of Primordial Yang, we burn incense and recite scriptures. Following the Golden Precepts of the Numinous Treasure, we observe the fast and uphold the precepts. We illuminate the sacred texts and kindle the divine lamps. Gazing upward at the patterns of the celestial weave, we envision the image of the armillary sphere. The orchid incense burns bright—its flourishing seen, its waning unseen. The iron basin holds the oil—its increase visible, its depletion invisible. Above, it illumines the Thirty-Two Heavens with boundless light; below, it enables hundreds of thousands to behold, revere, and take refuge. From this light, all good arises; within this light, all evil perishes.\n\nWe bow once, then bow again, our devotion moving the divine. First we offer incense, then a second, then a third—each time, the jade-like voice rings clear. We look up, trusting in your all-seeing gaze, and humbly beseech your gracious radiance. May the Three Realms assemble, and the myriad gods give their assent. Let baleful stars retreat, so that through the four seasons, no harm nor disaster befalls. Let auspicious constellations descend, bestowing the Five Blessings: wealth and longevity.\n\nWe prostrate and take refuge in the Ever-Radiant Heavenly Worthy of the Most Wondrous Dao and Constant Virtue.\n\nWe, the ritual assembly, wholeheartedly take refuge and pledge ourselves to:\nThe Great Immortal of the Nine Heavens’ Golden Portal, Illuminator of the Dao and Attainer of Virtue, Manifest in Spirit, Universally Salvific, Pure and Subtle, Profound and Void, Wondrously Responsive, Compassionate and Benevolent, Protector of the Realm and Shelter of the People, Vastly Merciful Perfected Lord;\nThe Supreme Immortal of the Nine Heavens’ Jade Portal, Propagator of Transformation and Upholder of the Teachings, Illustrious in Spirit, Vastly Salvific, Lofty and Bright, Vast and Serene, Profound and Tranquil, Wondrously Responsive, Benevolent and Kind, Supporter of the Realm and Guardian of the People, Vastly Merciful Perfected Lord;\nAnd all the divine officials of the Palace of Numinous Salvation.\n\nWe reverently kindle the Seven Luminaries’ Lamp of the Armillary Sphere, arraying above the image of the sun’s radiance.\n\nWe humbly recall: the Dao dwells in the beginning of the Great Ultimate—unseen in its concealment, yet manifest in its subtlety. The sun is the essence of all yang, fulfilling every aspiration and perceiving all that is hidden. Its mystery is unfathomable, its presence divine. Its majesty blazes forth, inspiring awe like Zhao Dun. Its brilliance shines above, and all people look up to it as they did to the Duke of Zhou. Its virtue radiates, vast and glorious; its purity gleams, bright as jade. The crow-wheel stands in solemn readiness, paying homage in the Palace of Resplendent Splendor. The chariot of Xi is adorned in majesty, feasting in the Hall of Penetrating Yang. It emits a thousand-yard halo, universally illuminating the Three Thousand Worlds. Entering our gate, no dwelling remains in shadowed doubt. Following our Way, the ailments of the dark path vanish.\n\nWe reflect upon all beings: lost in the dust, submerged in obscurity, they toil in vain pursuit of shadows; like lightning or dew, their splendor is fleeting, leaving only the lament of a fleeting moment. From this day forth, may they turn inward and abide in the constant brightness of the Dao.\n\nWe pray that those who dwell in markets may prosper in trade and commerce; those who labor in the fields may find peace in tilling and well-digging. May the skilled artisans measure shadows with jade; may the diligent craftsmen burn the midnight oil. May scholars compose verses of five-hued brilliance; may officials be honored as Eight-Brick Scholars. In the twilight of their years, may they rival the pine and cypress in endurance. May the glow of fireflies enhance their splendor, and may even the lowliest creatures share in their grace. With the devotion of sunflowers turning to the sun, may they receive the radiant reflection of your divine regard.\n\nWe, the ritual assembly, now reverently follow the incantation of the Sun Sovereign as taught by the Most High, prostrating in refuge and chanting with devotion:\n\nWholeheartedly we take refuge and sincerely worship:\nThe Great Immortal of the Nine Heavens’ Golden Portal, Illuminator of the Dao and Attainer of Virtue, Manifest in Spirit, Universally Salvific, Pure and Subtle, Profound and Void, Wondrously Responsive, Compassionate and Benevolent, Protector of the Realm and Shelter of the People, Vastly Merciful Perfected Lord.\nWholeheartedly we take refuge and sincerely worship:\nThe Supreme Immortal of the Nine Heavens’ Jade Portal, Propagator of Transformation and Upholder of the Teachings, Illustrious in Spirit, Vastly Salvific, Lofty and Bright, Vast and Serene, Profound and Tranquil, Wondrously Responsive, Benevolent and Kind, Supporter of the Realm and Guardian of the People, Vastly Merciful Perfected Lord.\n\nWe form the noon mudra, inhale the noon qi, and in distant contemplation, envision the Perfected Lord of the Palace of Resplendent Yang as if present.\n\nGazing east toward the Fusang Palace, we prostrate and pay homage to the Resplendent One:\nO radiant sun of the cavernous brightness,\nIn boundless vastness, what thoughts arise?\nGrant me the golden hue to worship,\nAwaiting the celestial vision of your majestic form.\nThe imperial blossoms and jade maidens\nDescend to the terrace at this very hour.\n\n*Response:* May the light of this lamp be dedicated to the Perfected Lord.\nScatter flowers to the Heavenly Worthy of the Great Illumination and Ultimate Perfection.\n\nWe, the ritual assembly, wholeheartedly take refuge and pledge ourselves to:\nThe Great Immortal of the Nine Heavens’ Golden Portal, Illuminator of the Dao and Attainer of Virtue, Manifest in Spirit, Universally Salvific, Pure and Subtle, Profound and Void, Wondrously Responsive, Compassionate and Benevolent, Protector of the Realm and Shelter of the People, Vastly Merciful Perfected Lord;\nThe Supreme Immortal of the Nine Heavens’ Jade Portal, Propagator of Transformation and Upholder of the Teachings, Illustrious in Spirit, Vastly Salvific, Lofty and Bright, Vast and Serene, Profound and Tranquil, Wondrously Responsive, Benevolent and Kind, Supporter of the Realm and Guardian of the People, Vastly Merciful Perfected Lord;\nAnd all the divine officials of the Palace of Numinous Salvation.\n\nWe reverently kindle the Seven Luminaries’ Lamp of the Armillary Sphere, arraying above the image of the moon’s radiance.\n\nWe humbly recall: the ancestral qi resides in the vastness of the Great Void, formless and without trace. The moon’s essence suffuses the tenfold splendor of the flowers, endowed with nature and sentiment. It traverses the Winnowing Basket and stirs the wind; it departs from the Net and brings forth rain—such is the work of Heaven, divine and luminous. It treads the eight myriad and three thousand gates of the Toad Palace, its pure light ready to be drawn. It gazes upon the Crane Terrace, where after fifteen hundred years, the sacred traces remain. When Liu Yue stone repelled the barbarian siege, his aspiration to ascend the tower was fulfilled. When Cao Mengde achieved hegemony, what hindered him from strumming the zither and singing? At times, its essence congealed to bestow the Han’s tally; at others, its reflection conferred the Wu’s auspice. Its name is pure and bright, its achievements illustrious.\n\nWe reflect upon all beings: lurking in shadowed caves, stealing light, cloaked in dust and nurturing obscurity. They conceal their faults and magnify their virtues—how can they avoid the transgressions of blemish and flaw? They embellish their errors and disguise their wrongs—how can they escape the sins of murkiness and delusion? We now humbly offer our gratitude, fortunate to behold this radiance.\n\nWe pray that in the marshes where swans gather, there may be no fear of crows taking flight; within the borders where the cock crows, there may be no worry of oxen panting. May those who pound the hare’s elixir attain longevity; may those who gather the oyster’s pearl acquire wealth.\n\nMay those who enter officialdom early pass the selection of the Moon Goddess; may those who arrange marriages see their unions fulfilled as the Old Man of the Southern Dipper foretold. When the Jade Light appears, may it bring the conception of fine sons; when the Jade Axe is wielded, may craftsmanship attain exquisite skill. Bowing in wait for the Weaver Maid to mark the sundial, we humbly confess our shame before Venus’s raised cup.\n\nWe, the assembled ritualists, now reverently follow the divine incantation of the Supreme Yin Sovereign as taught by the Most High, prostrating in devotion and chanting with sincere praise:\n\nWith wholehearted devotion, we take refuge and bow in reverence to the Nine Heavens’ Golden Portal, Radiant Dao and Penetrating Virtue, Great Immortal Manifesting Numinous Grace, Universally Salvific, Pure and Subtle, Cavernously Mysterious, Profoundly Void, Wondrously Responsive, Compassionate and Benevolent, Protector of the State and Shelter of the People, Vastly Merciful Perfected Lord.\n\nWith wholehearted devotion, we take refuge and bow in reverence to the Nine Heavens’ Jade Portal, Propagating Transformation and Upholding the Teachings, Supreme Immortal of Illustrious Numinosity, Vastly Salvific, Lofty and Illuminating, Vastly Tranquil, Profoundly Serene, Wondrously Responsive, Benevolent and Kind, Assistant to the State and Guardian of the People, Vastly Merciful Perfected Lord.\n\nBefore reciting the incantation, we inhale the unspoken qi and visualize the Perfected Lords of the Cavernous Yin Palace of Radiant Essence as though present.\n\nGazing upward to survey the eight directions, we see the moon pregnant with yin essence.\nWithin it dwells the Primordial Sovereign,\nHer Ladyship riding a chariot of green.\nHer luminous splendor illumines the Two Poles,\nHer blended radiance shines through the Three Pure Realms.\nEarnestly seeking the Supreme Dao,\nThe Five Colors descend to welcome her.\n\n*Response:* May this lamp’s light be dedicated to the Perfected Lords.\n\nScattering flowers—\nThe Round Mirror illumines the Cavernous Heavenly Worthy.\n\nWe, the assembled ritualists, with wholehearted devotion, take refuge and bow in reverence to:\nThe Nine Heavens’ Golden Portal, Radiant Dao and Penetrating Virtue, Great Immortal Manifesting Numinous Grace, Universally Salvific, Pure and Subtle, Cavernously Mysterious, Profoundly Void, Wondrously Responsive, Compassionate and Benevolent, Protector of the State and Shelter of the People, Vastly Merciful Perfected Lord;\nThe Nine Heavens’ Jade Portal, Propagating Transformation and Upholding the Teachings, Supreme Immortal of Illustrious Numinosity, Vastly Salvific, Lofty and Illuminating, Vastly Tranquil, Profoundly Serene, Wondrously Responsive, Benevolent and Kind, Assistant to the State and Guardian of the People, Vastly Merciful Perfected Lord;\nand all the divine immortals and spirit officials of the Numinous Salvation Palace.\n\nWe reverently kindle the Seven Luminaries’ astral lamp, arranging above it the eastern image of the Wood Power and Jupiter.\n\nWe have heard that the heart of the Dao is singular, so profound and silent that it defies description. The spirit of Wood embodies benevolence, its wondrous transformations ceaselessly giving rise to life. In time, it is spring, and the spring winds nurture all; in virtue, it is the Primal, and the primal qi forms the embryo. Though all equally receive its sustaining power, they still depend on its pruning and shaping force. Gazing up at the lofty mountain, all under heaven feel the same awe.\n\nXie Shi obtained it and revealed the numinous power of the Eight Lords; the Duke of Zhou obtained it and dispelled the slander of the golden casket. When the plum was used to soothe Shun, he dreamed of seeking the worthy in the wilds; when the mulberry was gathered, Yi Yin was divinely appointed at Xin. Their achievements stood towering in their time, their names fragrant through ten thousand generations.\n\nWe reflect upon all beings: clinging to stumps and content with their lot, overreaching their station in seeking shade. Though their talents be as coarse as the oak or the catalpa, dull and unadorned, yet like the willow or the mulberry, their nature may be fashioned into cups and bowls. When guided by the marking-line, they become straight; without the carpenter’s square, no shape is formed.\n\nWe pray that those who hold office may display the elegance of the thorn-elm; that those who hear lawsuits may govern with the kindness of the sweet pear. Observing the way of the catalpa and the pagoda tree, may fathers be kind and sons filial; singing the poem of the flowering calyx, may elder brothers be friendly and younger brothers respectful. May those who bear sons wish them to be sagely youths, sprouting like the five-branched cassia; may those who form friendships seek ageless companions, towering like the thousand-year pine. May the peach blossom with its radiance bring harmony to home and household; may the autumn fruits be offered in reverence to honor ancestors and venerate forebears. Though we present the humble gift of dates and jujubes, it is not meant to rival the grand rite of burning offerings.\n\nLet the Dharma assembly now reverently follow the divine incantation of the Star Lord of Wood Virtue as proclaimed by the Most High, bowing in homage and reciting with devout sincerity.\n\nWith wholehearted devotion, we take refuge and pay reverence:\nTo the Radiant Dao and Attained Virtue Great Immortal of the Nine Heavens’ Golden Palace, whose wondrous efficacy pervades the Pure Subtlety, Cavernous Mystery, and Void Wonder—Compassionate and Benevolent, Protector of the Realm and Shelter of the People, the Vastly Merciful Perfected Lord.\n\nWith wholehearted devotion, we take refuge and pay reverence:\nTo the Propagating Transformation and Upholding Teaching Supreme Immortal of the Nine Heavens’ Jade Palace, whose luminous majesty broadly aids the Lofty and Serene, the Profound and Tranquil—Responsive and Benevolent, Assistant of the Realm and Guardian of the People, the Vastly Merciful Perfected Lord.\n\nForm the mudra of *yin* and *hai*, drawing the *qi* of *yin* and *hai*, and visualize the Perfected Lord of the Azure Flower Azure Heaven Palace as present.\n\nThe Year Star rides the virtue of Wood,\nExtending its radiance to the eastern quarter.\nIts celestial form exudes moisture and grace,\nIts true hue illumines the August Emperor.\nSeeking blossoms, it sings in boundless joy;\nCasting waters, it chants in the chamber of mushrooms.\nThrough seasons of frequent prayers and rites,\nBlessings naturally grow everlasting.\n\n*Response:* May the light of these lamps be dedicated to the Perfected Lord.\n*Scattering flowers:*\nThe Heavenly Worthy of Wondrous Wisdom and Perfect Clarity.\n\nWe, the Dharma assembly, with wholehearted devotion, prostrate and entreat:\nThe Radiant Dao and Attained Virtue Great Immortal of the Nine Heavens’ Golden Palace, whose wondrous efficacy pervades the Pure Subtlety, Cavernous Mystery, and Void Wonder—Compassionate and Benevolent, Protector of the Realm and Shelter of the People, the Vastly Merciful Perfected Lord;\nThe Propagating Transformation and Upholding Teaching Supreme Immortal of the Nine Heavens’ Jade Palace, whose luminous majesty broadly aids the Lofty and Serene, the Profound and Tranquil—Responsive and Benevolent, Assistant of the Realm and Guardian of the People, the Vastly Merciful Perfected Lord;\nAnd all the divine immortals and spirit officials of the Palace of Numinous Aid.\n\nWe now solemnly kindle the stellar lamps of the Seven Governors, arraying above the symbol of the Fire Virtue’s Sparkling Deluder Star of the southern quarter.\n\nWe reverently recall that Fire holds the virtue of the southern quarter, where the Flame Emperor wields authority.\nThe spirit is lord of the Eastern Sea,\nThe Perfected One bestowed with title.\nHis essence is forged of jade,\nHis form tempered by golden elixir.\nHe studied the texts beyond the world,\nHis goodness like a shadow in light.\nResponding to conditions, he transforms,\nVowing to deliver all beings.\nHe lifts the people from mire and fire,\nPlacing them in the comfort of their mats.\nHe pities the scorched and parched,\nTurning their lot to songs of joy.\nFor laboring to pacify the realm,\nThe streaming crow presents auspicious omens.\nIn warding off calamity and disaster,\nThe Fire God reverses the winds.\nHis voice resounds in brilliance,\nHis majesty blazes in awe.\n\nWe reflect upon all beings:\nTheir desires yet unquenched,\nTheir study of the Dao unclear.\nIn their pursuit of power,\nThey cannot but fawn and flatter to seek favor.\nIn their schemes,\nHow dare they not resort to treachery and venom?\nTo quell boiling with more boiling—\nHow foolish!\nTo salvage what remains after the embers—\nIs it not too late?\nFortunate are those who heed the warning\nTo bend the chimney and move the firewood,\nFor prevention is ever wise.\nYet when snow touches the red furnace,\nOne awakens to the moment of enlightenment.\nAnxiety burns like smoke—\nWho can grasp heat?\nTo claim wildfire can be extinguished—\nHow can one allow jade to burn with it?\n\nWe humbly pray:\nMay our weapons be stilled,\nThe alarms of wolf-smoke forever silenced.\nMay the people’s suffering be relieved,\nSpared the labor of moxibustion’s cure.\nThose who cook and boil\nMay find sustenance for life.\nThose who gather firewood and tend hearths\nMay each secure their livelihood.\nAs Heaven observes the one virtue,\nSo it is said: Sincerity becomes clarity,\nClarity becomes sincerity.\nGoodness brings forth a hundred blessings,\nThat you may flourish and prosper,\nProsper and flourish.\nA single stick of heart-incense\nMay reach the azure vault.\nThe triple beams of divine light\nShall manifest upon the sacred altar.\n\nLet the Dharma assembly now reverently follow the divine incantation of the Star Lord of Fire Virtue as proclaimed by the Most High, bowing in homage and reciting with devout sincerity.\n\nWith wholehearted devotion, we prostrate and entreat:\nThe Radiant Dao and Attained Virtue Great Immortal of the Nine Heavens’ Golden Palace, whose wondrous efficacy pervades the Pure Subtlety, Cavernous Mystery, and Void Wonder—Compassionate and Benevolent, Protector of the Realm and Shelter of the People, the Vastly Merciful Perfected Lord.\n\nWith wholehearted devotion, we prostrate and entreat:\nThe Propagating Transformation and Upholding Teaching Supreme Immortal of the Nine Heavens’ Jade Palace, whose luminous majesty broadly aids the Lofty and Serene, the Profound and Tranquil—Responsive and Benevolent, Assistant of the Realm and Guardian of the People, the Vastly Merciful Perfected Lord.\n\nForm the mudra of *mao* and *xu*, drawing the *qi* of *mao* and *xu*, and visualize the Perfected Lord of the Vermilion Numinous Fire-Refining Palace as present.\n\nDragon and phoenix sprout pointed horns,\nTheir majestic light rebuking the ten directions.\nCinnabar strength gleams through five nights,\nVermilion fire flames along three edges.\nCrystal clarity accords with the true *qi*,\nSwords and halberds gleam with martial authority.\nSwiftly they seize and extinguish traces,\nComets dare not advance.\n\n*Response:* May the light of these lamps be dedicated to the Perfected Lord.\n*Scattering flowers:*\nThe Heavenly Worthy of Radiant Wisdom Torch.\n\nWe, the Dharma assembly, with wholehearted devotion, prostrate and entreat:\nThe Radiant Dao and Attained Virtue Great Immortal of the Nine Heavens’ Golden Palace, whose wondrous efficacy pervades the Pure Subtlety, Cavernous Mystery, and Void Wonder—Compassionate and Benevolent, Protector of the Realm and Shelter of the People, the Vastly Merciful Perfected Lord;\nThe Propagating Transformation and Upholding Teaching Supreme Immortal of the Nine Heavens’ Jade Palace, whose luminous majesty broadly aids the Lofty and Serene, the Profound and Tranquil—Responsive and Benevolent, Assistant of the Realm and Guardian of the People, the Vastly Merciful Perfected Lord;\nAnd all the divine immortals and spirit officials of the Palace of Numinous Aid.\n\nWe now solemnly kindle the stellar lamps of the Seven Governors, arraying above the symbol of the Metal Virtue’s Grand White Star of the western quarter.\n\nWe reverently recall that Metal conceives the essence of Grand White,\nThe western quarter bears its sign.\nThe spirit ranks among the Upper Clarity,\nThe Northern Dipper transforms his form.\nHis literary brilliance long shone on Mount Tiantai,\nHis origins trace to the Lishui’s flow.\nHis odes and hymns\nResound with melodious beauty.\nHis inscriptions on bells and tripods\nDisplay unyielding integrity.\nLi Shaojun thereby attained the elixir,\nFu Yue of Shang thereby sharpened his tools.\nAs a treasure, it is truly precious;\nAs an instrument, how could it be slighted?\nThe higher one gazes, the loftier it seems;\nThe deeper one delves, the firmer it proves.\nDistinctly ordered,\nHarmoniously reasoned.\n\nWe reflect upon all beings:\nAware of the four knowings, they feel shame,\nYet vainly admire Yang Zhen’s virtue.\nThrice invited, they prove incapable,\nIdly envying the wealth of Tao Zhu.\nFrom this day forward, let them reform—\nTruly relying on the refining crucible.\n\nWe humbly pray:\nMay the fruits of our practice remain unburned,\nGladdened by the teachings of a full basket.\nThough culture may seem lost,\nStill we hear the ring of jade cast to earth.\nWords that can be acted upon,\nNames that can be spoken—\nThe promises of the people of Chu\nAre as steadfast as Ji Bu’s.\nSages emulate Heaven,\nThe worthy emulate sages—\nConfucius’ casting was not for Yan Hui alone.\n\nAshamed we lack the grand treasures to offer,\nWe present but humble ritual vessels.\n\nLet the Dharma assembly now reverently follow the divine incantation of the Star Lord of Metal Virtue as proclaimed by the Most High, bowing in homage and reciting with devout sincerity.\n\nWith devout hearts we bow in homage and faith,\nTo the Great Immortal of the Nine Heavens’ Golden Portal,\nRadiant in Dao, perfected in virtue,\nManifesting numinous power, universally saving,\nPure and subtle, penetrating the mysterious, empty and void,\nWondrously responsive, compassionate and kind,\nProtecting the realm and sheltering the people—\nTrue Lord of Vast Grace.\n\nWith devout hearts we bow in homage and faith,\nTo the Supreme Immortal of the Nine Heavens’ Jade Portal,\nProclaiming transformation and upholding the teachings,\nIllustrious in spirit, broadly salvific,\nLofty and luminous, vast and tranquil,\nDeeply serene, wondrously responsive,\nBenevolent and kind,\nAssisting the realm and aiding the people—\nTrue Lord of Vast Grace.\n\nForm the mudra of chén-xū,\nDraw the qi of chén-xū,\nEnvision the True Lord of the Palace of Primordial Simplicity in the Golden Heavens as present.\n\nVenerable Venus ascends the limpid Han,\nFrost-borne, it gleams with pristine radiance.\nTowering, it floats in auspicious splendor,\nResplendent, it exalts the Evening Star.\nIts blade, lofty, can repel invaders,\nIts hue, lustrous, often stays the armies.\nTracing the depths of celestial cycles,\nIt unites with the Dao and long life.\n\n*Response:* May the light of these lamps be turned toward the True Lord.\n\nScatter blossoms—\nThe Luminous True One nurtures the Vast Heaven.\n\nWe, the Dharma assembly, with devout hearts prostrate ourselves in homage:\nTo the Great Immortal of the Nine Heavens’ Golden Portal,\nRadiant in Dao, perfected in virtue,\nManifesting numinous power, universally saving,\nPure and subtle, penetrating the mysterious, empty and void,\nWondrously responsive, compassionate and kind,\nProtecting the realm and sheltering the people—\nTrue Lord of Vast Grace;\nTo the Supreme Immortal of the Nine Heavens’ Jade Portal,\nProclaiming transformation and upholding the teachings,\nIllustrious in spirit, broadly salvific,\nLofty and luminous, vast and tranquil,\nDeeply serene, wondrously responsive,\nBenevolent and kind,\nAssisting the realm and aiding the people—\nTrue Lord of Vast Grace;\nTo the divine immortals and all spirit officials of the Palace of Numinous Salvation.\n\nReverently kindling the stellar lamps of the Seven Governors,\nWe array above the image of the Water Virtue’s Chen Star of the Northern Palace.\n\nWe humbly recall: the spirit of water is called Dark Mystery.\nIts source is deep, its flow far-reaching.\nLike water beneath the earth,\nWhere does it not reach? Where does it not pass?\nVast and boundless—how can I name it?\nAbysmal and fathomless—truly beyond measure.\nSpeak of its benevolence: fish and turtles find their place.\nSpeak of its majesty: dragons revere its numen.\nFlying sands and raging waves once revealed the dream of Three Mountains.\nRising clouds and bringing rain, all gaze upon the shrines of the Four Rivers.\nCrossing the frozen Fen and Tuo, the words of kings and hegemons—how divine!\nLeveling Huai and Cai with snow, Li Guang’s merit—was it not heaven-sent?\nEqual in the grace of moistening and descending,\nDare we make our plea to the east?\n\nWe reflect with shame upon all beings:\nAt the Thieves’ Spring, they halt to slake their thirst—\nWhat gluttony is beyond their ken?\nThe turbid Wei flows ever on,\nMaking foul and fetid all it touches.\nWe must cleanse and purify,\nLest we provoke vexation and excess.\n\nWe pray:\nMay the courts enjoy peace, pearls return to Hepu.\nMay talents flourish and endure, boats cross mighty rivers.\nWhen mulberries in floating groves ripen, silkworms ascend.\nWhen swords from Yanshi’s pool are sold, oxen may be raised.\nMay the wish for wealth and profit run deep as an abyss—\nWith abundance achieved, what more is needed? Let them be enriched.\nMay descendants thrive and prosper,\nFor after great virtue, there must be those who rise.\nMay the waves of grace overflow,\nThe sea of blessings vast and profound.\nWe offer but the rites of a humble stream,\nAshamed of our meager puddle’s inadequacy.\n\nLet the Dharma assembly now reverently follow the divine incantation of the Star Lord of Water Virtue as proclaimed by the Most High, bowing in homage and reciting with devout sincerity.\n\nWith devout hearts we bow in homage and faith,\nTo the Great Immortal of the Nine Heavens’ Golden Portal,\nRadiant in Dao, perfected in virtue,\nManifesting numinous power, universally saving,\nPure and subtle, penetrating the mysterious, empty and void,\nWondrously responsive, compassionate and kind,\nProtecting the realm and sheltering the people—\nTrue Lord of Vast Grace.\n\nWith devout hearts we bow in homage and faith,\nTo the Supreme Immortal of the Nine Heavens’ Jade Portal,\nProclaiming transformation and upholding the teachings,\nIllustrious in spirit, broadly salvific,\nLofty and luminous, vast and tranquil,\nDeeply serene, wondrously responsive,\nBenevolent and kind,\nAssisting the realm and aiding the people—\nTrue Lord of Vast Grace.\n\nForm the mudra of sì-shēn,\nDraw the qi of sì-shēn,\nEnvision the True Lord of the Palace of Dark Numen and Great Virtue as present.\n\nWondrous! The talisman unites the five qi,\nTopknots reveal the true gate.\nTowering in the chǒu position,\nRén-Guǐ guards the numinous lord.\nIts splendor congeals in purity,\nIts subtle influences hasten to our thoughts.\nWith immortal songs and dancing Dao,\nAfter long moments, descend from the golden heavens.\n\n*Response:* May the light of these lamps be turned toward the True Lord.\n\nScatter blossoms—\nThe Dragon Virtue universally illuminates the Heavenly Venerable.\n\nWe, the Dharma assembly, with devout hearts prostrate ourselves in homage:\nTo the Great Immortal of the Nine Heavens’ Golden Portal,\nRadiant in Dao, perfected in virtue,\nManifesting numinous power, universally saving,\nPure and subtle, penetrating the mysterious, empty and void,\nWondrously responsive, compassionate and kind,\nProtecting the realm and sheltering the people—\nTrue Lord of Vast Grace;\nTo the Supreme Immortal of the Nine Heavens’ Jade Portal,\nProclaiming transformation and upholding the teachings,\nIllustrious in spirit, broadly salvific,\nLofty and luminous, vast and tranquil,\nDeeply serene, wondrously responsive,\nBenevolent and kind,\nAssisting the realm and aiding the people—\nTrue Lord of Vast Grace;\nTo the divine immortals and all spirit officials of the Palace of Numinous Salvation.\n\nReverently kindling the stellar lamps of the Seven Governors,\nWe array above the image of the Earth Virtue’s Zhen Star of the Central Palace.\n\nWe humbly recall: in she rites, earth is sacrificed to,\nFitting the harmony of Earth.\nThe spirit’s virtue accords with Heaven’s Dao.\nStone inscriptions herald auspices,\nYin and yang harmonize for the Tang house.\nClods in the wild present omens,\nThe gods lend aid to the Jin court.\nWhen Qin took Shu, the omens of Baogu Valley were no mere marvel.\nWhen Liu swallowed Huan, the Xianbei dream was no mere coincidence.\nThe filial son Zong buried his father here, revealing hidden merit.\nThe Iron-Wheel King made offerings here, fulfilling karmic fruit.\nThe great ship of governance may draw upon its weight.\nLu Jiang’s virtuous rule flows through ten thousand ages.\nThe sword of Lei Huan may gain luster.\nThe sacred traces of Huayin endure for a thousand years.\nMixing sand with wine, it once became a remedy for Lord Gao’s illness.\nForming dust into pills, it became Ge Xuan’s elixir to revive the dead.\nWith yellow as its virtue, its numen shines resplendent.\n\nWe reflect with shame upon all beings:\nAnts in their holes cling to life, wall insects guard their dullness.\nEvil abounds, good is scarce—\nIs there no lack of even a single basket?\nRevealing the past, knowing the future—\nCan we escape the charge of a hundred generations?\nThis is but filth and muck—of what use is it?\nOr is this mud and mire to be cast aside?\n\nFrom this day forth, let us follow the true path in conduct,\nDare we not raise walls and offer reverence?\n\nWe pray:\nMay Mount Hua store its essence, so scholars may be born wise.\nMay gold hold equal value, so merchants may prosper in trade.\nLet artisans refine their skills and reap their due.\nLet the fat of the earth pulse, so farmers may toil in the fields.\nStriking bells and sounding chimes, we offer but the rites of drum and mallet.\nPouring water and presenting flowers, we are ashamed of our lack of splendid tribute.\n\nLet the assembly of dharma followers now reverently follow the divine incantation of the Star Lord of Earthly Virtue as proclaimed by the Most High, bowing in homage and reciting with devotion.\n\nWith sincere hearts we take refuge and pay reverence:\nTo the Radiant Dao and Penetrating Virtue Great Immortal of the Golden Towers of the Nine Heavens, whose wondrous responsiveness and boundless compassion protect the realm and shelter the people, the Vastly Benevolent Perfected Lord of Great Grace.\n\nWith sincere hearts we take refuge and pay reverence:\nTo the Propagating Transformation and Upholding the Dao High Immortal of the Jade Towers of the Nine Heavens, whose luminous efficacy and profound tranquility assist the realm and bless the people, the Vastly Benevolent Perfected Lord of Great Grace.\n\nThe incantation gathers the essence of zi and chou,\nDrawing the qi of zi and chou,\nEnvisioning the Perfected Lord of the Yellow Center Palace of Primordial Qi as though present.\n\nOn high, the talisman aligns with wu and ji,\nConcealed in the earth, it ascends through layered heavens.\nThe Five Phases honor the hidden luminaries,\nThe Nine Lands witness radiant illumination.\nGan and Shi discern the subtle and profound,\nTao and Wu calculate the deep and distant.\nThe High Immortals bestow rain and dew,\nProstrate upon the earth, we offer empty hymns.\n\nIn harmony we chant:\nMay this lamp’s light be dedicated to the Perfected Lord.\n\nScattering flowers:\nThe numinous light illumines the Heavenly Worthy.\n\nReciting the scripture and incantation,\nThe merit of kindling these lamps is now complete.\n\nWe reverently hear that observing celestial patterns reveals human affairs,\nThus enabling foreknowledge.\nCultivating human affairs in accord with celestial patterns,\nAll undertakings shall be auspicious.\nWe must rely on the divine lamps for illumination,\nAnd depend on the ritual codes for proclamation.\nDedicating this to the Perfected Lord,\nWe humbly beseech your abundant blessings.\nFrom this day forth, may your numinous power be greatly manifested.\n\nWe pray:\nMay stars gather in Kui,\nThat we may again witness a reign of literary brilliance.\nMay light suffuse the Bi,\nThat we may restore the purity of ancient times.\nAbove, embody the will of Heaven;\nBelow, fulfill the hopes of the people.\nFurthermore, after kindling these lamps,\nMay the Five Planets follow their proper courses,\nThe Two Luminaries shine with increased splendor,\nCold and heat arrive without fail,\nAnd all people ascend to benevolence and longevity.\nMay rain and sunshine arrive in due season,\nPraying for the abundant harvest of all grains.\nMay all moving and sentient beings\nBe nurtured by transformation and cultivation.\n\nRelying on the dharma assembly,\nWe offer this supreme good cause.\n\nWe chant:\nThe Heavenly Worthies of the Three Clarities and Three Realms,\nThe Heavenly Worthies who bestow blessings from the Nine Heavens,\nThe Heavenly Worthies of the Numinous Treasure in the Ten Directions,\nWhose merit is inconceivable.\n\nThe Rite of the Seven Luminaries’ Star Lamps for the Vastly Benevolent and Numinously Efficacious Perfected Lord is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洪恩灵济真君七政星灯仪 经名：洪恩灵济真君七政星灯仪。 撰人不详。 一卷。 底本出处：《正统道藏》洞玄部威仪类。 洪恩灵济真君七政星灯仪 法事如式 大道昭昭，不言善应。 小心翼翼，有祷必通。 恭炷真香，虔诚供养： 九天金阙咀道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君， 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君， 灵济宫中神仙诸灵官普同供养。 恭闻龙汉开图，而玄元始之炁分。 鳌极初化，而天地人之位定。 夫人也，大道难遇，中土难生。 况抱以阳，负以阴，四肢既正。 必贵其形，保其命，万气长存。 惟恐老死病苦之为忧，各以长大美好而自悦。 人有所欲，天无私亲。 何赐也富，而宪也贫？ 何彭之寿，而颜之夭？ 毋诱之数，盍求诸身。 尔时灵济真君，游宴玉清圣境，熙帝之载，则天之明，作大因缘，为众演说。 五辰我抚，或盈或缩之不常。 两曜我经，一暑一寒之有序。",
      "translated_text": "The *Rite of the Seven Luminaries’ Lamps for the Venerable Lord of Vast Grace and Numinous Salvation*\n\n**Title:** *Rite of the Seven Luminaries’ Lamps for the Venerable Lord of Vast Grace and Numinous Salvation*\n**Author:** Unknown\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongxuan* Section, *Weiyi* Category\n\n---\n\n**Rite of the Seven Luminaries’ Lamps for the Venerable Lord of Vast Grace and Numinous Salvation**\n*Proceedings as Prescribed*\n\nThe Great Dao shines resplendent, its silent virtue ever-responsive.\nWith reverent care, every prayer finds its way.\n\nDevoutly we kindle the true incense, offering with utmost sincerity:\nTo the Venerable Lord of Vast Grace—\nTranscendent Immortal of the Golden Towers of the Nine Heavens, who embodies the Dao and manifests its power, whose numinous salvation pervades the Pure and Subtle, the Cavernous and Mysterious, the Void and Wondrous, whose compassion and kindness shield the realm and shelter the people;\nTo the Venerable Lord of Vast Grace—\nExalted Immortal of the Jade Towers of the Nine Heavens, who proclaims transformation and upholds the teaching, whose radiant and boundless salvation is vast and luminous, serene and profound, wondrously responsive, benevolent and merciful, aiding the realm and protecting the people;\nAnd to all the divine immortals and spirit-officials of the Palace of Numinous Salvation, we make this common offering.\n\nWe humbly recall: when the Dragon Han first unfolded the cosmic pattern, the primordial qi of the Mysterious and Original divided. When the Turtle Peak first took form, the positions of Heaven, Earth, and Humanity were fixed.\nYet for mortals, the Great Dao is rarely encountered, and birth in the Middle Land is hard to attain. Endowed with yang and sustained by yin, with limbs properly aligned, one must esteem this form, preserve this life, and keep the myriad qi ever-abiding.\nYet all fear the sorrows of old age, sickness, and death, and each delights in longevity, growth, and beauty.\nHuman desires are many, but Heaven shows no partiality.\nWhy are some granted wealth while others suffer poverty?\nWhy does Pengzu enjoy longevity while Yanling meets an early end?\nIf not by the reckoning of fate, then seek the answer within yourself.\n\nAt that time, the Venerable Lord of Numinous Salvation, wandering in the sacred precincts of the Jade Clarity, in the radiance of the Emperor’s reign and the brilliance of Heaven’s mandate, established a great karmic connection and expounded for the assembly:\n“The Five Celestial Bodies I govern—now waxing, now waning, never constant.\nThe Two Luminaries I traverse—now heat, now cold, in perfect order.”",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 391,
      "start_sentence": 0,
      "end_sentence": 25,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.820700407028198,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君七政星灯仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "顺之财为吉隆之喜，逆之则为凶危之忧。 惟玉诚可以感神，故积善必有余庆。 既沐照临之下，敢忘昭谢之私。 今辰谨有奉道某，恭启灵坛，具陈菲供。 依元阳之玉历，行香诵经。 按灵宝之金科，修斋奉戒。 发明章典，然点神灯。 仰观经纬之文，遐想玑衡之象。 兰炷热火，见其盛未见其微。 铁盆盛膏，见其增未见其减。 上照三十二天，光明廓落。 下使百千万人，瞻仰皈依。 众善自光中生，众恶自光中灭。 一作礼而再作礼，精意感孚。 初上香至三上香，玉音嘹亮。 仰惟洞鉴，俯赐恩光。 更冀三界齐临，万神恭诺。 凶星退舍，在四时则无害无灾。 吉曜临轩，锡五福以曰富曰寿。 稽首皈依 至真妙道德光常曜天尊。 臣法众等，志心皈命： 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君， 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君， 灵济宫中神仙诸灵官。 谨然玑衡七政神灯，上布日曜太阳之象。 恭闻道在太极之始，莫见乎隐，莫显乎微。 日者众阳所宗，无愿不成，无幽不察。 莫测其妙，所存者神。 赫赫厥灵，人可畏之如赵盾。 明明在上，民皆仰之若周公。 辉光其德，盛矣乎。 洁白其节，皎如也。 乌轮肃备，朝觐郁仪之宫。 羲驾庄严，燕享洞阳之殿。 放出毫光万丈，普照世界三千。 入吾门也，无蔀屋之疑。 遵吾道也，灭索涂之病。 伏念一切众生，尘埃汩没，徒穷逐影之劳； 电露虚华，惟有过隙之叹。 自今反照，与道常明。 伏愿中为市者，获行商坐贾之财。 出而作之，安耕田凿井之业。 艺之巧者，以圭测影。 工之勤者，继晷焚膏。 为儒者，赋夸五色文章。 入仕者，名号八砖学士。 桑榆残照，争同松栢。 以长青萤磷增辉，愿与昆虫而被泽。 少竭葵倾之敬，愿垂藻鉴之光。 请法众等，敬依太上所说太阳帝君神咒，稽首皈依，虔诚赞咏。 志心皈命信礼 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命信礼 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 咒捻午文，吸午气，遥想洞阳郁仪宫真君如在。 东望扶桑宫，稽首朝郁仪。 太阳洞明景，寥寥何所思。 令我拜金色，候天望英姿。 皇华将玉女，临轩降此时。 和：愿此灯光回向真君。 散花大明圆极天尊。 臣法众等，志心皈命： 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君， 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君， 灵济宫中神仙诸灵官。 谨然玑衡七政神灯，上布月曜太阴之象。 恭闻祖气在太空之中，无色无绪。 月魄泛十华之彩，有性有情。 经於箕而起风，离於毕而作雨，天之工也，神而明之。 步蟾宫八万三千门，清光可挹。 眺鹤台一千五百载，圣迹犹存。 刘越石之却虏围，果遂登楼之兴。 曹孟德之成霸业，何妨鼓瑟而歌。 或沦精而授汉之符。 或委照而应吴之瑞。 其名清亮，厥绩彰明。 伏念一切众生，穴影偷光，尘笼养晦。 将长护短，岂无玷缺之愆。 文过饰非，未免朦胧之罪。 谨当昭谢，幸睹光明。 伏愿鸿集泽中，安有乌飞之恐。 鸡呜境内，永无牛喘之忧。 捣兔药者可以长生，采蚌珠者可以获富。",
      "translated_text": "To follow the Way brings prosperity and joy; to defy it invites calamity and sorrow. Only jade-like sincerity can move the gods, and thus the accumulation of good deeds must yield abundant blessings. Bathed in the radiance of your illumination, how dare we forget our humble gratitude?\n\nOn this day, the humble Daoist devotee [Name], reverently opens the sacred altar and presents modest offerings. In accordance with the Jade Calendar of Primordial Yang, we burn incense and recite scriptures. Following the Golden Precepts of the Numinous Treasure, we observe the fast and uphold the precepts. We illuminate the sacred texts and kindle the divine lamps. Gazing upward at the patterns of the celestial weave, we envision the image of the armillary sphere. The orchid incense burns bright—its flourishing seen, its waning unseen. The iron basin holds the oil—its increase visible, its depletion invisible. Above, it illumines the Thirty-Two Heavens with boundless light; below, it enables hundreds of thousands to behold, revere, and take refuge. From this light, all good arises; within this light, all evil perishes.\n\nWe bow once, then bow again, our devotion moving the divine. First we offer incense, then a second, then a third—each time, the jade-like voice rings clear. We look up, trusting in your all-seeing gaze, and humbly beseech your gracious radiance. May the Three Realms assemble, and the myriad gods give their assent. Let baleful stars retreat, so that through the four seasons, no harm nor disaster befalls. Let auspicious constellations descend, bestowing the Five Blessings: wealth and longevity.\n\nWe prostrate and take refuge in the Ever-Radiant Heavenly Worthy of the Most Wondrous Dao and Constant Virtue.\n\nWe, the ritual assembly, wholeheartedly take refuge and pledge ourselves to:\nThe Great Immortal of the Nine Heavens’ Golden Portal, Illuminator of the Dao and Attainer of Virtue, Manifest in Spirit, Universally Salvific, Pure and Subtle, Profound and Void, Wondrously Responsive, Compassionate and Benevolent, Protector of the Realm and Shelter of the People, Vastly Merciful Perfected Lord;\nThe Supreme Immortal of the Nine Heavens’ Jade Portal, Propagator of Transformation and Upholder of the Teachings, Illustrious in Spirit, Vastly Salvific, Lofty and Bright, Vast and Serene, Profound and Tranquil, Wondrously Responsive, Benevolent and Kind, Supporter of the Realm and Guardian of the People, Vastly Merciful Perfected Lord;\nAnd all the divine officials of the Palace of Numinous Salvation.\n\nWe reverently kindle the Seven Luminaries’ Lamp of the Armillary Sphere, arraying above the image of the sun’s radiance.\n\nWe humbly recall: the Dao dwells in the beginning of the Great Ultimate—unseen in its concealment, yet manifest in its subtlety. The sun is the essence of all yang, fulfilling every aspiration and perceiving all that is hidden. Its mystery is unfathomable, its presence divine. Its majesty blazes forth, inspiring awe like Zhao Dun. Its brilliance shines above, and all people look up to it as they did to the Duke of Zhou. Its virtue radiates, vast and glorious; its purity gleams, bright as jade. The crow-wheel stands in solemn readiness, paying homage in the Palace of Resplendent Splendor. The chariot of Xi is adorned in majesty, feasting in the Hall of Penetrating Yang. It emits a thousand-yard halo, universally illuminating the Three Thousand Worlds. Entering our gate, no dwelling remains in shadowed doubt. Following our Way, the ailments of the dark path vanish.\n\nWe reflect upon all beings: lost in the dust, submerged in obscurity, they toil in vain pursuit of shadows; like lightning or dew, their splendor is fleeting, leaving only the lament of a fleeting moment. From this day forth, may they turn inward and abide in the constant brightness of the Dao.\n\nWe pray that those who dwell in markets may prosper in trade and commerce; those who labor in the fields may find peace in tilling and well-digging. May the skilled artisans measure shadows with jade; may the diligent craftsmen burn the midnight oil. May scholars compose verses of five-hued brilliance; may officials be honored as Eight-Brick Scholars. In the twilight of their years, may they rival the pine and cypress in endurance. May the glow of fireflies enhance their splendor, and may even the lowliest creatures share in their grace. With the devotion of sunflowers turning to the sun, may they receive the radiant reflection of your divine regard.\n\nWe, the ritual assembly, now reverently follow the incantation of the Sun Sovereign as taught by the Most High, prostrating in refuge and chanting with devotion:\n\nWholeheartedly we take refuge and sincerely worship:\nThe Great Immortal of the Nine Heavens’ Golden Portal, Illuminator of the Dao and Attainer of Virtue, Manifest in Spirit, Universally Salvific, Pure and Subtle, Profound and Void, Wondrously Responsive, Compassionate and Benevolent, Protector of the Realm and Shelter of the People, Vastly Merciful Perfected Lord.\nWholeheartedly we take refuge and sincerely worship:\nThe Supreme Immortal of the Nine Heavens’ Jade Portal, Propagator of Transformation and Upholder of the Teachings, Illustrious in Spirit, Vastly Salvific, Lofty and Bright, Vast and Serene, Profound and Tranquil, Wondrously Responsive, Benevolent and Kind, Supporter of the Realm and Guardian of the People, Vastly Merciful Perfected Lord.\n\nWe form the noon mudra, inhale the noon qi, and in distant contemplation, envision the Perfected Lord of the Palace of Resplendent Yang as if present.\n\nGazing east toward the Fusang Palace, we prostrate and pay homage to the Resplendent One:\nO radiant sun of the cavernous brightness,\nIn boundless vastness, what thoughts arise?\nGrant me the golden hue to worship,\nAwaiting the celestial vision of your majestic form.\nThe imperial blossoms and jade maidens\nDescend to the terrace at this very hour.\n\n*Response:* May the light of this lamp be dedicated to the Perfected Lord.\nScatter flowers to the Heavenly Worthy of the Great Illumination and Ultimate Perfection.\n\nWe, the ritual assembly, wholeheartedly take refuge and pledge ourselves to:\nThe Great Immortal of the Nine Heavens’ Golden Portal, Illuminator of the Dao and Attainer of Virtue, Manifest in Spirit, Universally Salvific, Pure and Subtle, Profound and Void, Wondrously Responsive, Compassionate and Benevolent, Protector of the Realm and Shelter of the People, Vastly Merciful Perfected Lord;\nThe Supreme Immortal of the Nine Heavens’ Jade Portal, Propagator of Transformation and Upholder of the Teachings, Illustrious in Spirit, Vastly Salvific, Lofty and Bright, Vast and Serene, Profound and Tranquil, Wondrously Responsive, Benevolent and Kind, Supporter of the Realm and Guardian of the People, Vastly Merciful Perfected Lord;\nAnd all the divine officials of the Palace of Numinous Salvation.\n\nWe reverently kindle the Seven Luminaries’ Lamp of the Armillary Sphere, arraying above the image of the moon’s radiance.\n\nWe humbly recall: the ancestral qi resides in the vastness of the Great Void, formless and without trace. The moon’s essence suffuses the tenfold splendor of the flowers, endowed with nature and sentiment. It traverses the Winnowing Basket and stirs the wind; it departs from the Net and brings forth rain—such is the work of Heaven, divine and luminous. It treads the eight myriad and three thousand gates of the Toad Palace, its pure light ready to be drawn. It gazes upon the Crane Terrace, where after fifteen hundred years, the sacred traces remain. When Liu Yue stone repelled the barbarian siege, his aspiration to ascend the tower was fulfilled. When Cao Mengde achieved hegemony, what hindered him from strumming the zither and singing? At times, its essence congealed to bestow the Han’s tally; at others, its reflection conferred the Wu’s auspice. Its name is pure and bright, its achievements illustrious.\n\nWe reflect upon all beings: lurking in shadowed caves, stealing light, cloaked in dust and nurturing obscurity. They conceal their faults and magnify their virtues—how can they avoid the transgressions of blemish and flaw? They embellish their errors and disguise their wrongs—how can they escape the sins of murkiness and delusion? We now humbly offer our gratitude, fortunate to behold this radiance.\n\nWe pray that in the marshes where swans gather, there may be no fear of crows taking flight; within the borders where the cock crows, there may be no worry of oxen panting. May those who pound the hare’s elixir attain longevity; may those who gather the oyster’s pearl acquire wealth.",
      "overlap_context": "ing meets an early end?\nIf not by the reckoning of fate, then seek the answer within yourself.\n\nAt that time, the Venerable Lord of Numinous Salvation, wandering in the sacred precincts of the Jade Clarity, in the radiance of the Emperor’s reign and the brilliance of Heaven’s mandate, established a great karmic connection and expounded for the assembly:\n“The Five Celestial Bodies I govern—now waxing, now waning, never constant.\nThe Two Luminaries I traverse—now heat, now cold, in perfect order.”",
      "start_char": 391,
      "end_char": 1651,
      "start_sentence": 26,
      "end_sentence": 109,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.32287812232971,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君七政星灯仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "入仕者早中嫦娥之选，定婚者果符老人之言。 瑶光现而孕产佳儿，玉斧修而工精艺巧。 拱俟纤阿而按晷，自惭太白之举杯。 请法众等，谨依太上所说太阴皇君神咒，稽首皈依，虔诚赞咏。 志心皈依信礼 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈依信礼 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 咒捻未文，吸未气，想洞阴结璘之宫真君如在。 仰望顾八表，惟月孕阴精。 中有太素皇，夫人驾绿軿。 耀华光二极，混明照三清。 殷勤求至道，五色下来迎。 和：愿此灯光回向真君。 散花 圆鉴洞昭一天尊。 臣法众等，志心皈命： 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君， 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君， 灵济宫中神仙诸灵官。 谨然玑衡七政神灯，上布束方木德岁星之象。 恭闻道心惟一，昏昏嘿嘿以难名。 木神则仁，化化生生之为妙。 在时为春，而春风长养。 於德为元，而元气胚胎。 均蒙扶植之功，犹赖剸裁之力。 高山仰止，易地皆然。 谢石得之，以显八公之灵。 周公得之，以释金滕之谤。 调梅用说，则梦求诸野。 采桑得尹，则神降於莘。 功卓立於一时，名流芳於万世。 伏念一切众生，守株安分，托荫过情。 虽樗栎之才，槌鲁无文。 然杞柳其性，杯桩可用。 从绳则正，非矩不成。 伏愿能官者，棫朴其章。 听讼者，甘棠其政。 观桥梓之道，而父慈子孝。 歌华萼之诗，而兄友弟恭。 生子愿为圣小儿，挺挺五枝之桂。 结交须作忘年友，森森千岁之松。 桃灼其华，宜其家，宜其室。 果秋以荐，尊尔祖，敬尔宗。 少伸实枣之仪，非拟燔柴之典。",
      "translated_text": "May those who enter officialdom early pass the selection of the Moon Goddess; may those who arrange marriages see their unions fulfilled as the Old Man of the Southern Dipper foretold. When the Jade Light appears, may it bring the conception of fine sons; when the Jade Axe is wielded, may craftsmanship attain exquisite skill. Bowing in wait for the Weaver Maid to mark the sundial, we humbly confess our shame before Venus’s raised cup.\n\nWe, the assembled ritualists, now reverently follow the divine incantation of the Supreme Yin Sovereign as taught by the Most High, prostrating in devotion and chanting with sincere praise:\n\nWith wholehearted devotion, we take refuge and bow in reverence to the Nine Heavens’ Golden Portal, Radiant Dao and Penetrating Virtue, Great Immortal Manifesting Numinous Grace, Universally Salvific, Pure and Subtle, Cavernously Mysterious, Profoundly Void, Wondrously Responsive, Compassionate and Benevolent, Protector of the State and Shelter of the People, Vastly Merciful Perfected Lord.\n\nWith wholehearted devotion, we take refuge and bow in reverence to the Nine Heavens’ Jade Portal, Propagating Transformation and Upholding the Teachings, Supreme Immortal of Illustrious Numinosity, Vastly Salvific, Lofty and Illuminating, Vastly Tranquil, Profoundly Serene, Wondrously Responsive, Benevolent and Kind, Assistant to the State and Guardian of the People, Vastly Merciful Perfected Lord.\n\nBefore reciting the incantation, we inhale the unspoken qi and visualize the Perfected Lords of the Cavernous Yin Palace of Radiant Essence as though present.\n\nGazing upward to survey the eight directions, we see the moon pregnant with yin essence.\nWithin it dwells the Primordial Sovereign,\nHer Ladyship riding a chariot of green.\nHer luminous splendor illumines the Two Poles,\nHer blended radiance shines through the Three Pure Realms.\nEarnestly seeking the Supreme Dao,\nThe Five Colors descend to welcome her.\n\n*Response:* May this lamp’s light be dedicated to the Perfected Lords.\n\nScattering flowers—\nThe Round Mirror illumines the Cavernous Heavenly Worthy.\n\nWe, the assembled ritualists, with wholehearted devotion, take refuge and bow in reverence to:\nThe Nine Heavens’ Golden Portal, Radiant Dao and Penetrating Virtue, Great Immortal Manifesting Numinous Grace, Universally Salvific, Pure and Subtle, Cavernously Mysterious, Profoundly Void, Wondrously Responsive, Compassionate and Benevolent, Protector of the State and Shelter of the People, Vastly Merciful Perfected Lord;\nThe Nine Heavens’ Jade Portal, Propagating Transformation and Upholding the Teachings, Supreme Immortal of Illustrious Numinosity, Vastly Salvific, Lofty and Illuminating, Vastly Tranquil, Profoundly Serene, Wondrously Responsive, Benevolent and Kind, Assistant to the State and Guardian of the People, Vastly Merciful Perfected Lord;\nand all the divine immortals and spirit officials of the Numinous Salvation Palace.\n\nWe reverently kindle the Seven Luminaries’ astral lamp, arranging above it the eastern image of the Wood Power and Jupiter.\n\nWe have heard that the heart of the Dao is singular, so profound and silent that it defies description. The spirit of Wood embodies benevolence, its wondrous transformations ceaselessly giving rise to life. In time, it is spring, and the spring winds nurture all; in virtue, it is the Primal, and the primal qi forms the embryo. Though all equally receive its sustaining power, they still depend on its pruning and shaping force. Gazing up at the lofty mountain, all under heaven feel the same awe.\n\nXie Shi obtained it and revealed the numinous power of the Eight Lords; the Duke of Zhou obtained it and dispelled the slander of the golden casket. When the plum was used to soothe Shun, he dreamed of seeking the worthy in the wilds; when the mulberry was gathered, Yi Yin was divinely appointed at Xin. Their achievements stood towering in their time, their names fragrant through ten thousand generations.\n\nWe reflect upon all beings: clinging to stumps and content with their lot, overreaching their station in seeking shade. Though their talents be as coarse as the oak or the catalpa, dull and unadorned, yet like the willow or the mulberry, their nature may be fashioned into cups and bowls. When guided by the marking-line, they become straight; without the carpenter’s square, no shape is formed.\n\nWe pray that those who hold office may display the elegance of the thorn-elm; that those who hear lawsuits may govern with the kindness of the sweet pear. Observing the way of the catalpa and the pagoda tree, may fathers be kind and sons filial; singing the poem of the flowering calyx, may elder brothers be friendly and younger brothers respectful. May those who bear sons wish them to be sagely youths, sprouting like the five-branched cassia; may those who form friendships seek ageless companions, towering like the thousand-year pine. May the peach blossom with its radiance bring harmony to home and household; may the autumn fruits be offered in reverence to honor ancestors and venerate forebears. Though we present the humble gift of dates and jujubes, it is not meant to rival the grand rite of burning offerings.",
      "overlap_context": "ransgressions of blemish and flaw? They embellish their errors and disguise their wrongs—how can they escape the sins of murkiness and delusion? We now humbly offer our gratitude, fortunate to behold this radiance.\n\nWe pray that in the marshes where swans gather, there may be no fear of crows taking flight; within the borders where the cock crows, there may be no worry of oxen panting. May those who pound the hare’s elixir attain longevity; may those who gather the oyster’s pearl acquire wealth.",
      "start_char": 1651,
      "end_char": 2343,
      "start_sentence": 110,
      "end_sentence": 154,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.37122130393982,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君七政星灯仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "请法众等，敬依太上所说木德星君神咒，稽首皈依，虔诚赞咏。 志心皈依信礼 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈信礼 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 咒捻寅亥文，取寅亥气，想青华青天之宫真君如在。 岁星乘木德，展辅耀东乡。 凌天姿润泽，正色滉明皇。 寻花歌浩漾，掷水咏芝房。 经时频梼礼，获福自然长。 和：愿此灯光回向真君。 散花 妙智圆明天尊。 臣法众等，志心皈命： 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君， 灵济宫中神仙诸灵官。 谨然玑衡七政神灯，上布南方火德荧惑星之象。 恭闻火秉南方之德，炎帝行权。 神为东海之君，真人锡号。 玉精铸魄，金液炼形。 学参方外之书，善似光中之影。 随机应化，发誓度人。 挈涂炭之民，而置诸衽席之安。 悯焦熬之俗，而转为讴歌之乐。 以劳定国，则流乌呈瑞。 捍难御灾，则回禄反风。 声迩荧煌，威灵烜赫。 伏念一切众生，欲心未灭，道学不明。 其狗势，则未免阿佞以趋炎。 其措谋，则岂敢险奸而煽毒。 扬汤止沸，何其愚也。 收烬之余，不几晚乎？ 幸曲突徙薪，犹有豫防之戒。 然红炉点雪，会知解悟之机。 忧甚如熏，谁能执热。 曾谓燎原而可扑，岂宜与玉以俱焚。 伏愿戢我干戈，永绝狼烽之警。 救民疾苦，何劳艾灸之功。 烹炊者，得养其生。 樵爨者，各安其业。 惟天鉴于一德，故曰诚则明，明则诚。 作善降之百祥，俾尔炽而昌，昌而炽。 心香一炷，可通於碧落。 神光三烛，载显於灵坛。 请法众等，敬依太上所说火德星君神咒，稽首皈依，虔诚赞咏。 志心皈命信礼 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命信礼 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 咒捻卯戌文，取卯戌气，想朱陵火炼之宫真君如在。 芒角生龙凤，威光叱十方。 丹刚耀五夜，朱火焰三边。 晶明符正气，剑戟焕兵权。 搀抢应灭迹，孛彗敢当前。 和：愿此灯光回向真君。 散花 智炬赫奕天尊。 臣法众等，志心皈命： 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君， 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君， 灵济宫中神仙诸灵官。 谨然玑衡七政神灯，上布西方金德太白之象。 恭闻金孕太白之精，西方有象。 神位上清之列，北斗化形。 文章久着於天台，源振其来於丽水。 歌诗雅颂，有铿锵之美。 勒铭锺鼎，负刚介之才。 李少君因此以成丹，商传说用之而作砺。 其为宝也诚可贵，其为器也宁可轻。 仰之弥高，钻之弥坚。 截然有条，浑然有理。 伏念一切众生，四知有愧，素钦杨震之贤，三致无能，空羡陶朱之富。 过自今而湔改，诚有赖於陶镕。 伏愿经果不焚，喜得满籯之教； 文如未丧，犹闻掷地之声。 言可行，名可言，楚人之诺皆如季布。 圣希天，贤希圣，孔子之铸岂特颜回。 愧无鸿宝之陈，略具彝樽之献。 请法众等，敬依太上所说金德星君神咒，稽首皈依，虔诚赞咏。",
      "translated_text": "Let the Dharma assembly now reverently follow the divine incantation of the Star Lord of Wood Virtue as proclaimed by the Most High, bowing in homage and reciting with devout sincerity.\n\nWith wholehearted devotion, we take refuge and pay reverence:\nTo the Radiant Dao and Attained Virtue Great Immortal of the Nine Heavens’ Golden Palace, whose wondrous efficacy pervades the Pure Subtlety, Cavernous Mystery, and Void Wonder—Compassionate and Benevolent, Protector of the Realm and Shelter of the People, the Vastly Merciful Perfected Lord.\n\nWith wholehearted devotion, we take refuge and pay reverence:\nTo the Propagating Transformation and Upholding Teaching Supreme Immortal of the Nine Heavens’ Jade Palace, whose luminous majesty broadly aids the Lofty and Serene, the Profound and Tranquil—Responsive and Benevolent, Assistant of the Realm and Guardian of the People, the Vastly Merciful Perfected Lord.\n\nForm the mudra of *yin* and *hai*, drawing the *qi* of *yin* and *hai*, and visualize the Perfected Lord of the Azure Flower Azure Heaven Palace as present.\n\nThe Year Star rides the virtue of Wood,\nExtending its radiance to the eastern quarter.\nIts celestial form exudes moisture and grace,\nIts true hue illumines the August Emperor.\nSeeking blossoms, it sings in boundless joy;\nCasting waters, it chants in the chamber of mushrooms.\nThrough seasons of frequent prayers and rites,\nBlessings naturally grow everlasting.\n\n*Response:* May the light of these lamps be dedicated to the Perfected Lord.\n*Scattering flowers:*\nThe Heavenly Worthy of Wondrous Wisdom and Perfect Clarity.\n\nWe, the Dharma assembly, with wholehearted devotion, prostrate and entreat:\nThe Radiant Dao and Attained Virtue Great Immortal of the Nine Heavens’ Golden Palace, whose wondrous efficacy pervades the Pure Subtlety, Cavernous Mystery, and Void Wonder—Compassionate and Benevolent, Protector of the Realm and Shelter of the People, the Vastly Merciful Perfected Lord;\nThe Propagating Transformation and Upholding Teaching Supreme Immortal of the Nine Heavens’ Jade Palace, whose luminous majesty broadly aids the Lofty and Serene, the Profound and Tranquil—Responsive and Benevolent, Assistant of the Realm and Guardian of the People, the Vastly Merciful Perfected Lord;\nAnd all the divine immortals and spirit officials of the Palace of Numinous Aid.\n\nWe now solemnly kindle the stellar lamps of the Seven Governors, arraying above the symbol of the Fire Virtue’s Sparkling Deluder Star of the southern quarter.\n\nWe reverently recall that Fire holds the virtue of the southern quarter, where the Flame Emperor wields authority.\nThe spirit is lord of the Eastern Sea,\nThe Perfected One bestowed with title.\nHis essence is forged of jade,\nHis form tempered by golden elixir.\nHe studied the texts beyond the world,\nHis goodness like a shadow in light.\nResponding to conditions, he transforms,\nVowing to deliver all beings.\nHe lifts the people from mire and fire,\nPlacing them in the comfort of their mats.\nHe pities the scorched and parched,\nTurning their lot to songs of joy.\nFor laboring to pacify the realm,\nThe streaming crow presents auspicious omens.\nIn warding off calamity and disaster,\nThe Fire God reverses the winds.\nHis voice resounds in brilliance,\nHis majesty blazes in awe.\n\nWe reflect upon all beings:\nTheir desires yet unquenched,\nTheir study of the Dao unclear.\nIn their pursuit of power,\nThey cannot but fawn and flatter to seek favor.\nIn their schemes,\nHow dare they not resort to treachery and venom?\nTo quell boiling with more boiling—\nHow foolish!\nTo salvage what remains after the embers—\nIs it not too late?\nFortunate are those who heed the warning\nTo bend the chimney and move the firewood,\nFor prevention is ever wise.\nYet when snow touches the red furnace,\nOne awakens to the moment of enlightenment.\nAnxiety burns like smoke—\nWho can grasp heat?\nTo claim wildfire can be extinguished—\nHow can one allow jade to burn with it?\n\nWe humbly pray:\nMay our weapons be stilled,\nThe alarms of wolf-smoke forever silenced.\nMay the people’s suffering be relieved,\nSpared the labor of moxibustion’s cure.\nThose who cook and boil\nMay find sustenance for life.\nThose who gather firewood and tend hearths\nMay each secure their livelihood.\nAs Heaven observes the one virtue,\nSo it is said: Sincerity becomes clarity,\nClarity becomes sincerity.\nGoodness brings forth a hundred blessings,\nThat you may flourish and prosper,\nProsper and flourish.\nA single stick of heart-incense\nMay reach the azure vault.\nThe triple beams of divine light\nShall manifest upon the sacred altar.\n\nLet the Dharma assembly now reverently follow the divine incantation of the Star Lord of Fire Virtue as proclaimed by the Most High, bowing in homage and reciting with devout sincerity.\n\nWith wholehearted devotion, we prostrate and entreat:\nThe Radiant Dao and Attained Virtue Great Immortal of the Nine Heavens’ Golden Palace, whose wondrous efficacy pervades the Pure Subtlety, Cavernous Mystery, and Void Wonder—Compassionate and Benevolent, Protector of the Realm and Shelter of the People, the Vastly Merciful Perfected Lord.\n\nWith wholehearted devotion, we prostrate and entreat:\nThe Propagating Transformation and Upholding Teaching Supreme Immortal of the Nine Heavens’ Jade Palace, whose luminous majesty broadly aids the Lofty and Serene, the Profound and Tranquil—Responsive and Benevolent, Assistant of the Realm and Guardian of the People, the Vastly Merciful Perfected Lord.\n\nForm the mudra of *mao* and *xu*, drawing the *qi* of *mao* and *xu*, and visualize the Perfected Lord of the Vermilion Numinous Fire-Refining Palace as present.\n\nDragon and phoenix sprout pointed horns,\nTheir majestic light rebuking the ten directions.\nCinnabar strength gleams through five nights,\nVermilion fire flames along three edges.\nCrystal clarity accords with the true *qi*,\nSwords and halberds gleam with martial authority.\nSwiftly they seize and extinguish traces,\nComets dare not advance.\n\n*Response:* May the light of these lamps be dedicated to the Perfected Lord.\n*Scattering flowers:*\nThe Heavenly Worthy of Radiant Wisdom Torch.\n\nWe, the Dharma assembly, with wholehearted devotion, prostrate and entreat:\nThe Radiant Dao and Attained Virtue Great Immortal of the Nine Heavens’ Golden Palace, whose wondrous efficacy pervades the Pure Subtlety, Cavernous Mystery, and Void Wonder—Compassionate and Benevolent, Protector of the Realm and Shelter of the People, the Vastly Merciful Perfected Lord;\nThe Propagating Transformation and Upholding Teaching Supreme Immortal of the Nine Heavens’ Jade Palace, whose luminous majesty broadly aids the Lofty and Serene, the Profound and Tranquil—Responsive and Benevolent, Assistant of the Realm and Guardian of the People, the Vastly Merciful Perfected Lord;\nAnd all the divine immortals and spirit officials of the Palace of Numinous Aid.\n\nWe now solemnly kindle the stellar lamps of the Seven Governors, arraying above the symbol of the Metal Virtue’s Grand White Star of the western quarter.\n\nWe reverently recall that Metal conceives the essence of Grand White,\nThe western quarter bears its sign.\nThe spirit ranks among the Upper Clarity,\nThe Northern Dipper transforms his form.\nHis literary brilliance long shone on Mount Tiantai,\nHis origins trace to the Lishui’s flow.\nHis odes and hymns\nResound with melodious beauty.\nHis inscriptions on bells and tripods\nDisplay unyielding integrity.\nLi Shaojun thereby attained the elixir,\nFu Yue of Shang thereby sharpened his tools.\nAs a treasure, it is truly precious;\nAs an instrument, how could it be slighted?\nThe higher one gazes, the loftier it seems;\nThe deeper one delves, the firmer it proves.\nDistinctly ordered,\nHarmoniously reasoned.\n\nWe reflect upon all beings:\nAware of the four knowings, they feel shame,\nYet vainly admire Yang Zhen’s virtue.\nThrice invited, they prove incapable,\nIdly envying the wealth of Tao Zhu.\nFrom this day forward, let them reform—\nTruly relying on the refining crucible.\n\nWe humbly pray:\nMay the fruits of our practice remain unburned,\nGladdened by the teachings of a full basket.\nThough culture may seem lost,\nStill we hear the ring of jade cast to earth.\nWords that can be acted upon,\nNames that can be spoken—\nThe promises of the people of Chu\nAre as steadfast as Ji Bu’s.\nSages emulate Heaven,\nThe worthy emulate sages—\nConfucius’ casting was not for Yan Hui alone.\n\nAshamed we lack the grand treasures to offer,\nWe present but humble ritual vessels.\n\nLet the Dharma assembly now reverently follow the divine incantation of the Star Lord of Metal Virtue as proclaimed by the Most High, bowing in homage and reciting with devout sincerity.",
      "overlap_context": "unger brothers respectful. May those who bear sons wish them to be sagely youths, sprouting like the five-branched cassia; may those who form friendships seek ageless companions, towering like the thousand-year pine. May the peach blossom with its radiance bring harmony to home and household; may the autumn fruits be offered in reverence to honor ancestors and venerate forebears. Though we present the humble gift of dates and jujubes, it is not meant to rival the grand rite of burning offerings.",
      "start_char": 2343,
      "end_char": 3627,
      "start_sentence": 155,
      "end_sentence": 234,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.4845495223999,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君七政星灯仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "志心皈依信礼 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈依信礼 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 咒捻辰酉文，取辰酉气，想金天素灵之宫真君如在。 太白凌清汉，腾霜耀素英。 亭亭浮瑞彩，皎皎盛长庚。 锋高能御寇，色润每降兵。 推穷符历数，合道与长生。 和：愿此灯光回向真君。 散花 明真养皓天尊。 臣法众等，志心皈命： 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君， 灵济官中神仙诸灵官。 谨然玑衡七政神灯，上布北方水德辰星之象。 恭闻水之神故曰玄冥，其源也深，其流也远。 神如水之在地下，何所不至，何往不通。 荡荡乎，吾无能名。 渊渊乎，诚不可测。 言其仁，则鱼鳖得其所。 言其威，则蛟龙神其灵。 飞沙怒涛，曾显三山之梦。 兴云致雨，具瞻四渎之祠。 冰渡滤沱，王霸之言，何其神也。 雪平淮蔡，李怨之功，岂非天乎。 均蒙润下之仁，敢有朝东之请。 伏念一切众生，盗泉止渴，何饕餮之不才； 浊渭常流，使秽污而自臭。 谨当洗濯，毋即恼淫。 伏愿官府升平，珠果还於合浦。 人才泰长，舟可济於巨川。 浮林之桑熟，而蚕乃登。 演池之剑卖，而牛可畜。 财利之愿渊积，既庶何加，又曰富之。 子孙之振流长，盛德之后，必有兴者。 恩波洋缢，福海弘深。 少伸行潦之仪，深愧蹄涔之陋。 请法众等，敬依太上所说水德星君神咒，稽首皈依，虔诚赞咏。 志心皈依信礼 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈依信礼 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 咒捻巳申文，取巳申气，想玄灵大德之宫真君如在。 妙哉符五气，髻鬃见真门。 嵯峨当丑位，壬癸洞灵君。 分辉凝皎洁，肸蠁赴思存。 仙歌将舞道，良久下金天。 和愿此灯光回向真君。 散花 龙德普照天尊。 臣法众等，志心皈命： 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君， 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君， 灵济宫中神仙诸灵官。 谨然玑衡七政神灯，上布中央土德镇星之象。 恭闻社而祭土，配地之宜。 神之为德，合天之道。 石文荐瑞，阴克相於唐家。 野块呈祥，神有扶於晋室。 秦如得蜀，则褒谷之妖不足为怪。 刘既吞桓，则鲜卑之梦夫岂偶然。 宗孝子以此葬父，而显阴功。 铁轮王以此施佛，而成因果。 洪规之船，可以借重。 卢江德政，万古流传。 雷焕之剑，可以增光。 华阴圣迹，千年如在。 以沙渍酒，曾授高府君疗病之方。 取尘为圆，尝得葛仙钩活人之剂。 以黄尚德，有赫厥灵。 伏念一切众生，穴蚁偷生，壁虫守拙。 恶多善少，岂无一篑之亏。 彰往知来，未免百昌之托。 靖惟粪壤，无所用也。 或者泥涂，其可弃乎。 从今正道以由行，敢不立墙而起敬。 伏愿华岳储精，为士者生而颖悟。 黄金同价，为商者富而贸迁。 慢艺精，而工食其功。 膏脉动，而农力於穑。 编锺击磬，略陈桴鼓之仪。 酌水献花，愧乏青华之贡。",
      "translated_text": "With devout hearts we bow in homage and faith,\nTo the Great Immortal of the Nine Heavens’ Golden Portal,\nRadiant in Dao, perfected in virtue,\nManifesting numinous power, universally saving,\nPure and subtle, penetrating the mysterious, empty and void,\nWondrously responsive, compassionate and kind,\nProtecting the realm and sheltering the people—\nTrue Lord of Vast Grace.\n\nWith devout hearts we bow in homage and faith,\nTo the Supreme Immortal of the Nine Heavens’ Jade Portal,\nProclaiming transformation and upholding the teachings,\nIllustrious in spirit, broadly salvific,\nLofty and luminous, vast and tranquil,\nDeeply serene, wondrously responsive,\nBenevolent and kind,\nAssisting the realm and aiding the people—\nTrue Lord of Vast Grace.\n\nForm the mudra of chén-xū,\nDraw the qi of chén-xū,\nEnvision the True Lord of the Palace of Primordial Simplicity in the Golden Heavens as present.\n\nVenerable Venus ascends the limpid Han,\nFrost-borne, it gleams with pristine radiance.\nTowering, it floats in auspicious splendor,\nResplendent, it exalts the Evening Star.\nIts blade, lofty, can repel invaders,\nIts hue, lustrous, often stays the armies.\nTracing the depths of celestial cycles,\nIt unites with the Dao and long life.\n\n*Response:* May the light of these lamps be turned toward the True Lord.\n\nScatter blossoms—\nThe Luminous True One nurtures the Vast Heaven.\n\nWe, the Dharma assembly, with devout hearts prostrate ourselves in homage:\nTo the Great Immortal of the Nine Heavens’ Golden Portal,\nRadiant in Dao, perfected in virtue,\nManifesting numinous power, universally saving,\nPure and subtle, penetrating the mysterious, empty and void,\nWondrously responsive, compassionate and kind,\nProtecting the realm and sheltering the people—\nTrue Lord of Vast Grace;\nTo the Supreme Immortal of the Nine Heavens’ Jade Portal,\nProclaiming transformation and upholding the teachings,\nIllustrious in spirit, broadly salvific,\nLofty and luminous, vast and tranquil,\nDeeply serene, wondrously responsive,\nBenevolent and kind,\nAssisting the realm and aiding the people—\nTrue Lord of Vast Grace;\nTo the divine immortals and all spirit officials of the Palace of Numinous Salvation.\n\nReverently kindling the stellar lamps of the Seven Governors,\nWe array above the image of the Water Virtue’s Chen Star of the Northern Palace.\n\nWe humbly recall: the spirit of water is called Dark Mystery.\nIts source is deep, its flow far-reaching.\nLike water beneath the earth,\nWhere does it not reach? Where does it not pass?\nVast and boundless—how can I name it?\nAbysmal and fathomless—truly beyond measure.\nSpeak of its benevolence: fish and turtles find their place.\nSpeak of its majesty: dragons revere its numen.\nFlying sands and raging waves once revealed the dream of Three Mountains.\nRising clouds and bringing rain, all gaze upon the shrines of the Four Rivers.\nCrossing the frozen Fen and Tuo, the words of kings and hegemons—how divine!\nLeveling Huai and Cai with snow, Li Guang’s merit—was it not heaven-sent?\nEqual in the grace of moistening and descending,\nDare we make our plea to the east?\n\nWe reflect with shame upon all beings:\nAt the Thieves’ Spring, they halt to slake their thirst—\nWhat gluttony is beyond their ken?\nThe turbid Wei flows ever on,\nMaking foul and fetid all it touches.\nWe must cleanse and purify,\nLest we provoke vexation and excess.\n\nWe pray:\nMay the courts enjoy peace, pearls return to Hepu.\nMay talents flourish and endure, boats cross mighty rivers.\nWhen mulberries in floating groves ripen, silkworms ascend.\nWhen swords from Yanshi’s pool are sold, oxen may be raised.\nMay the wish for wealth and profit run deep as an abyss—\nWith abundance achieved, what more is needed? Let them be enriched.\nMay descendants thrive and prosper,\nFor after great virtue, there must be those who rise.\nMay the waves of grace overflow,\nThe sea of blessings vast and profound.\nWe offer but the rites of a humble stream,\nAshamed of our meager puddle’s inadequacy.\n\nLet the Dharma assembly now reverently follow the divine incantation of the Star Lord of Water Virtue as proclaimed by the Most High, bowing in homage and reciting with devout sincerity.\n\nWith devout hearts we bow in homage and faith,\nTo the Great Immortal of the Nine Heavens’ Golden Portal,\nRadiant in Dao, perfected in virtue,\nManifesting numinous power, universally saving,\nPure and subtle, penetrating the mysterious, empty and void,\nWondrously responsive, compassionate and kind,\nProtecting the realm and sheltering the people—\nTrue Lord of Vast Grace.\n\nWith devout hearts we bow in homage and faith,\nTo the Supreme Immortal of the Nine Heavens’ Jade Portal,\nProclaiming transformation and upholding the teachings,\nIllustrious in spirit, broadly salvific,\nLofty and luminous, vast and tranquil,\nDeeply serene, wondrously responsive,\nBenevolent and kind,\nAssisting the realm and aiding the people—\nTrue Lord of Vast Grace.\n\nForm the mudra of sì-shēn,\nDraw the qi of sì-shēn,\nEnvision the True Lord of the Palace of Dark Numen and Great Virtue as present.\n\nWondrous! The talisman unites the five qi,\nTopknots reveal the true gate.\nTowering in the chǒu position,\nRén-Guǐ guards the numinous lord.\nIts splendor congeals in purity,\nIts subtle influences hasten to our thoughts.\nWith immortal songs and dancing Dao,\nAfter long moments, descend from the golden heavens.\n\n*Response:* May the light of these lamps be turned toward the True Lord.\n\nScatter blossoms—\nThe Dragon Virtue universally illuminates the Heavenly Venerable.\n\nWe, the Dharma assembly, with devout hearts prostrate ourselves in homage:\nTo the Great Immortal of the Nine Heavens’ Golden Portal,\nRadiant in Dao, perfected in virtue,\nManifesting numinous power, universally saving,\nPure and subtle, penetrating the mysterious, empty and void,\nWondrously responsive, compassionate and kind,\nProtecting the realm and sheltering the people—\nTrue Lord of Vast Grace;\nTo the Supreme Immortal of the Nine Heavens’ Jade Portal,\nProclaiming transformation and upholding the teachings,\nIllustrious in spirit, broadly salvific,\nLofty and luminous, vast and tranquil,\nDeeply serene, wondrously responsive,\nBenevolent and kind,\nAssisting the realm and aiding the people—\nTrue Lord of Vast Grace;\nTo the divine immortals and all spirit officials of the Palace of Numinous Salvation.\n\nReverently kindling the stellar lamps of the Seven Governors,\nWe array above the image of the Earth Virtue’s Zhen Star of the Central Palace.\n\nWe humbly recall: in she rites, earth is sacrificed to,\nFitting the harmony of Earth.\nThe spirit’s virtue accords with Heaven’s Dao.\nStone inscriptions herald auspices,\nYin and yang harmonize for the Tang house.\nClods in the wild present omens,\nThe gods lend aid to the Jin court.\nWhen Qin took Shu, the omens of Baogu Valley were no mere marvel.\nWhen Liu swallowed Huan, the Xianbei dream was no mere coincidence.\nThe filial son Zong buried his father here, revealing hidden merit.\nThe Iron-Wheel King made offerings here, fulfilling karmic fruit.\nThe great ship of governance may draw upon its weight.\nLu Jiang’s virtuous rule flows through ten thousand ages.\nThe sword of Lei Huan may gain luster.\nThe sacred traces of Huayin endure for a thousand years.\nMixing sand with wine, it once became a remedy for Lord Gao’s illness.\nForming dust into pills, it became Ge Xuan’s elixir to revive the dead.\nWith yellow as its virtue, its numen shines resplendent.\n\nWe reflect with shame upon all beings:\nAnts in their holes cling to life, wall insects guard their dullness.\nEvil abounds, good is scarce—\nIs there no lack of even a single basket?\nRevealing the past, knowing the future—\nCan we escape the charge of a hundred generations?\nThis is but filth and muck—of what use is it?\nOr is this mud and mire to be cast aside?\n\nFrom this day forth, let us follow the true path in conduct,\nDare we not raise walls and offer reverence?\n\nWe pray:\nMay Mount Hua store its essence, so scholars may be born wise.\nMay gold hold equal value, so merchants may prosper in trade.\nLet artisans refine their skills and reap their due.\nLet the fat of the earth pulse, so farmers may toil in the fields.\nStriking bells and sounding chimes, we offer but the rites of drum and mallet.\nPouring water and presenting flowers, we are ashamed of our lack of splendid tribute.",
      "overlap_context": "cast to earth.\nWords that can be acted upon,\nNames that can be spoken—\nThe promises of the people of Chu\nAre as steadfast as Ji Bu’s.\nSages emulate Heaven,\nThe worthy emulate sages—\nConfucius’ casting was not for Yan Hui alone.\n\nAshamed we lack the grand treasures to offer,\nWe present but humble ritual vessels.\n\nLet the Dharma assembly now reverently follow the divine incantation of the Star Lord of Metal Virtue as proclaimed by the Most High, bowing in homage and reciting with devout sincerity.",
      "start_char": 3628,
      "end_char": 4902,
      "start_sentence": 235,
      "end_sentence": 317,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.30963611602783,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君七政星灯仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "请法众等，敬依太上所说土德星君神咒，稽首皈依，虔诚赞咏。 志心皈依信礼 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈依信礼 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 咒捻子丑文，取子丑气，想黄中元气之宫真君如在。 高穹符戊己，藏陆起重霄。 五行尊暗曜，九土见光昭。 甘石推留伏，陶巫算沈寥。 上仙垂雨露，伏地礼空谣。 和：愿此灯光回向真君。 散花 灵光炳曜天尊。 诵咏经咒 上来然灯功德，并已周圆。 恭闻睹天文而察人事，可以前知。 修人事以应天文，吉无不利。 须仗神灯而点照，特凭科典以宣扬。 回向真君，仰祈景贶。 自今已后，丕阐厥灵。 伏愿星聚於奎，再睹文明之治。 光含於璧，复还淳古之风。 上体天心，下孚民望。 更冀然灯之后，五星顺度，两曜增辉，寒暑不愆，跻兆民於仁寿。 雨旸时若，祈百谷之丰登。 蠢动含灵，咸资化育。 仰凭法众，为上良缘。 念： 三清三境天尊，九天锡庆天尊，十方灵宝天尊，不可思议功德。 洪恩灵济真君七政星灯仪竟",
      "translated_text": "Let the assembly of dharma followers now reverently follow the divine incantation of the Star Lord of Earthly Virtue as proclaimed by the Most High, bowing in homage and reciting with devotion.\n\nWith sincere hearts we take refuge and pay reverence:\nTo the Radiant Dao and Penetrating Virtue Great Immortal of the Golden Towers of the Nine Heavens, whose wondrous responsiveness and boundless compassion protect the realm and shelter the people, the Vastly Benevolent Perfected Lord of Great Grace.\n\nWith sincere hearts we take refuge and pay reverence:\nTo the Propagating Transformation and Upholding the Dao High Immortal of the Jade Towers of the Nine Heavens, whose luminous efficacy and profound tranquility assist the realm and bless the people, the Vastly Benevolent Perfected Lord of Great Grace.\n\nThe incantation gathers the essence of zi and chou,\nDrawing the qi of zi and chou,\nEnvisioning the Perfected Lord of the Yellow Center Palace of Primordial Qi as though present.\n\nOn high, the talisman aligns with wu and ji,\nConcealed in the earth, it ascends through layered heavens.\nThe Five Phases honor the hidden luminaries,\nThe Nine Lands witness radiant illumination.\nGan and Shi discern the subtle and profound,\nTao and Wu calculate the deep and distant.\nThe High Immortals bestow rain and dew,\nProstrate upon the earth, we offer empty hymns.\n\nIn harmony we chant:\nMay this lamp’s light be dedicated to the Perfected Lord.\n\nScattering flowers:\nThe numinous light illumines the Heavenly Worthy.\n\nReciting the scripture and incantation,\nThe merit of kindling these lamps is now complete.\n\nWe reverently hear that observing celestial patterns reveals human affairs,\nThus enabling foreknowledge.\nCultivating human affairs in accord with celestial patterns,\nAll undertakings shall be auspicious.\nWe must rely on the divine lamps for illumination,\nAnd depend on the ritual codes for proclamation.\nDedicating this to the Perfected Lord,\nWe humbly beseech your abundant blessings.\nFrom this day forth, may your numinous power be greatly manifested.\n\nWe pray:\nMay stars gather in Kui,\nThat we may again witness a reign of literary brilliance.\nMay light suffuse the Bi,\nThat we may restore the purity of ancient times.\nAbove, embody the will of Heaven;\nBelow, fulfill the hopes of the people.\nFurthermore, after kindling these lamps,\nMay the Five Planets follow their proper courses,\nThe Two Luminaries shine with increased splendor,\nCold and heat arrive without fail,\nAnd all people ascend to benevolence and longevity.\nMay rain and sunshine arrive in due season,\nPraying for the abundant harvest of all grains.\nMay all moving and sentient beings\nBe nurtured by transformation and cultivation.\n\nRelying on the dharma assembly,\nWe offer this supreme good cause.\n\nWe chant:\nThe Heavenly Worthies of the Three Clarities and Three Realms,\nThe Heavenly Worthies who bestow blessings from the Nine Heavens,\nThe Heavenly Worthies of the Numinous Treasure in the Ten Directions,\nWhose merit is inconceivable.\n\nThe Rite of the Seven Luminaries’ Star Lamps for the Vastly Benevolent and Numinously Efficacious Perfected Lord is now complete.",
      "overlap_context": "us follow the true path in conduct,\nDare we not raise walls and offer reverence?\n\nWe pray:\nMay Mount Hua store its essence, so scholars may be born wise.\nMay gold hold equal value, so merchants may prosper in trade.\nLet artisans refine their skills and reap their due.\nLet the fat of the earth pulse, so farmers may toil in the fields.\nStriking bells and sounding chimes, we offer but the rites of drum and mallet.\nPouring water and presenting flowers, we are ashamed of our lack of splendid tribute.",
      "start_char": 4902,
      "end_char": 5355,
      "start_sentence": 318,
      "end_sentence": 347,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.22270917892456,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君七政星灯仪.txt",
        "category": "威仪类"
      }
    }
  ]
}