{
  "source_id": "洪恩灵济真君祈谢设醮科",
  "source_file": "chunked_daozang\\洪恩灵济真君祈谢设醮科.json",
  "total_chunks": 4,
  "total_original_chars": 3284,
  "total_translated_chars": 22435,
  "total_translation_time": 117.0885648727417,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君祈谢设醮科.txt",
    "category": "威仪类"
  },
  "full_translation": "**Ritual for Offering Thanksgiving and Establishing the Jiao for the Venerable Lords of Vast Grace and Numinous Aid**\n\n**Title:** *Ritual for Offering Thanksgiving and Establishing the Jiao for the Venerable Lords of Vast Grace and Numinous Aid*\n**Author:** Unknown\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongxuan* Section, *Weiyi* (Ritual Propriety) Category\n\n---\n\n**Ritual for Offering Thanksgiving and Establishing the Jiao for the Venerable Lords of Vast Grace and Numinous Aid**\n\n**Ritual Procedures**\nEach bows to the masters and recollects the mind in accordance with the Dharma.\n\n**Invocation of the Divine Mantra**\nThe Five Stars array their radiance, illuminating the five directions.\nThe Water Star averts calamity; the virtue of Wood brings prosperity.\nMars dispels misfortune; Venus repels warfare.\nSaturn guards the four quarters, ensuring the state and household thrive.\nNames inscribed on jade tablets, characters recorded in the imperial chambers.\nRiding the whirlwind, scattering light, soaring through the vast heavens.\nMoving in and out of the unseen, roaming and feasting in the ten directions.\nFive-colored clouds float as canopies, summoning spirits and commanding winds.\nCommanding the myriad spirits, upholding the immortal elders above.\n\n**Striking the Dharma Drum Twenty-Four Times**\nThe Most High Mysterious Origin, the Five Numinous Elder Lord, summons forth the Three and Five Merit Officials within our bodies, the Left and Right Fragrant Official Envoys, the Golden Youth Attendant of Incense, the Jade Maiden Dispersing Flowers and Transmitting Words, the Direct-Day Fragrant Official, the Merit Official Envoys, and the Three Qi True Spirits.\nHasten to report to the Five Great Marshals—Wei, Guan, Bian, Zhao, and Diao—the Two Marshals Yue and Xu, the Heavenly Soldiers and Mighties, and the Left and Right Divine Officials.\nOn this solemn occasion of establishing the jiao rites, we reverently receive the sacred decree. All intentions and decrees have been recorded and submitted above.\nMay the true qi of life descend and flow into our bodies, that the words we now present may swiftly reach the Golden Towers of the Nine Heavens before the Great Immortal of Illuminating Dao and Penetrating Virtue, the Manifestly Numinous and Universally Beneficent, the Pure and Subtle, the Cavernously Mysterious, the Profoundly Void, the Wondrously Responsive, the Compassionate and Benevolent, the Protector of the State and Shelter of the People, the Venerable Lord of Vast Grace;\nAnd before the Supreme Immortal of the Jade Towers of the Nine Heavens, the Proclaimer of Transformation and Upholder of the Dao, the Illustrious and Numinously Vast, the Lofty and Serene, the Profoundly Tranquil and Wondrously Responsive, the Benevolent and Merciful, the Assistant of the State and Guardian of the People, the Venerable Lord of Vast Grace.\n\n**Proclamation of the Dharma Titles**\nWe, your humble servants, along with the assembled officials at the altar, reverently and sincerely submit this petition before:\nThe Great Immortal of the Golden Towers of the Nine Heavens, Illuminating Dao and Penetrating Virtue, Manifestly Numinous and Universally Beneficent, Pure and Subtle, Cavernously Mysterious, Profoundly Void, Wondrously Responsive, Compassionate and Benevolent, Protector of the State and Shelter of the People, the Venerable Lord of Vast Grace;\nThe Supreme Immortal of the Jade Towers of the Nine Heavens, Proclaimer of Transformation and Upholder of the Dao, Illustrious and Numinously Vast, Lofty and Serene, Profoundly Tranquil and Wondrously Responsive, Benevolent and Merciful, Assistant of the State and Guardian of the People, the Venerable Lord of Vast Grace;\nThe Sacred Father, the Loyal and Martial Duke of Qi, the True Lord of Upholding Brilliance;\nThe Sacred Mother, the Benevolent and Longevous, Kind and Virtuous Immortal Consort;\nThe Sacred Consort, the Lady of Jing State, the Assisting and Benevolent, Upright and Responsive Immortal Consort;\nThe Lady of Wei State, the Kindly Assisting, Compassionate and Dignified, Reverent and Serene Immortal Consort;\nThe Sacred Brothers, the Prince of Tang, the Prince of Hong, the Prince of E, the Prince of Guangling;\nThe Sacred Uncle, the Duke Protecting the State, the Duke Serving the State;\nThe Sacred Sons-in-Law, the Marquis of Wu’an, the Marquis of Ningguo;\nThe Sacred Sons, the Marquis of Baoda, the Marquis of Zhangxin, the Marquis of Baoxin, the Marquis of Baoning, the Duke of Wuning;\nThe Sacred Nephews, the Marquis of Zhaode, the Marquis of Anding, the Marquis of Taining;\nThe Sacred Grandsons, the Marquis of Wuchang, the Marquis of Nanchang;\nThe Sacred Sons, Grandsons, and Nephews, all the ranked Dukes and Marquises;\nThe Sacred Consorts of the Prince of Tang, the Illustrious and Solemn Immortal Consort;\nThe Sacred Consorts of the Prince of Hong, the Benevolent and Compassionate Immortal Consort;\nThe Sacred Consorts of the Prince of E, the Compliant and Dignified Immortal Consort;\nThe Sacred Consorts of the Prince of Guangling, the Kindly and Auspicious Immortal Consort;\nThe Sacred Daughters, the Pure and Dignified Immortal Maiden, the Illustrious and Dignified Immortal Maiden;\nThe Sacred Daughters-in-Law, the Kindly and Dignified Lady, the Benevolent and Gentle Lady, the Gracious and Compliant Lady, the Illustrious and Dignified Lady, the Compliant and Reverent Lady, the Illustrious and Wise Lady, the Reverent and Dignified Lady, the Serene and Dignified Lady, the Illustrious and Harmonious Lady, the Compassionate and Filial Lady;\nAll the Sacred Daughters-in-Law, the ranked Ladies.\n\nThe Officials and Generals of the Upper Clarity Great Cavern Register, the Heavenly Mechanism Bureau, the Thunderclap Ministry, the Celestial Astronomy Bureau, and the Earthly Prisons, who expel evil and seize malevolent spirits, transmit talismans and decrees, dispel disasters and deliver from calamity, drive away misfortune and repel monstrosities, oversee the altar and protect the Dharma;\nThe Inspecting and Patrolling Generals;\nThe Venerable Spirits of the Year-Star and the Twelve Monthly Generals;\nThe Star Officials of the Original Destiny and Celestial Time;\nThe Immortal Hosts of the Wind, Thunder, and Rain Departments;\nThe Left and Right Chancellors, Grand Masters, and Lesser Masters;\nThe Ministers of the Six Ministries and the Inner Court Dukes and Ministers;\nThe Left and Right High Ministers of Life-Recording and Longevity-Recording;\nThe Left and Right High Ministers of Emolument and Fortune;\nThe Left and Right Attendants and Envoys;\nThe various officials and subordinates of the hundred bureaus;\nThe ranked Dukes and Ministers of the Twenty-Four Bureaus under the Left and Right Emolument and Fortune Departments;\nThe Left and Right Introducing Immortal Officials;\nThe Inner Attendants: the Lady of Shuncheng, the Lady of Zhaohua, the Lady of Ronghua, the Lady of Xiurong, the Lady of Xiuyi, the Lady of Zhaoyi;\nThe Ladies of the Inner Canon, the Weaving and Hemp Bureau, the Mat and Treasury Bureau, the Curtain and Register Bureau, the Revenue Bureau, and the Women’s Palace;\nThe female scribes and all the talented women;\nThe female invocators and female attendants, all the noble women;\nThe inner attendants and inner canonists, all the sacred kin Ladies of the inner palace;\nThe Ladies of the Yanxi Hall, the Life-Recording Bureau of the Celestial Unity, the Life-Recording Spirit of Taiyi;\nThe High Minister of Emolument and Destiny;\nThe Lady Guarding the Womb and Protecting the Chamber;\nThe Lady Protecting the Fetus and Safeguarding Life;\nThe Left and Right Ladies of Compassionate Instruction;\nThe Lady of Transmission and Protection;\nThe Left and Right Ladies of Record-Keeping;\nThe Lady of Seal-Keeping;\nThe Ladies of the various palaces responsible for nursing, holding, nurturing, and delivering infants;\nThe Transforming Matrons of Birth;\nMarshal Cha, the Eternal Guardian of Yong’an;\nMarshal Bian, the Martial Guardian of Wu’an;\nMarshal Wei, the Left Gate-Monitoring Commissioner and Military Commissioner;\nMarshal Zhao, the Right Gate-Monitoring Commissioner and Commander-in-Chief;\nMarshal Diao, the Vanguard Commander and Military Supervisor;\nThe valiant generals and fierce soldiers under the command of the Five Marshals;\nThe Left and Right Marshals Yue and Xu;\nThe attendants and officials of the traveling palaces;\nThe officials of the Emolument, Merit, Scholars, and Archives Bureaus;\nThe officials of the Agriculture, Crops, Silk, and Hemp Bureaus;\nThe officials of the Markets, Commerce, Merit Assessment, and Material Preparation Bureaus;\nThe Kitchen Officials, Entertainers, and Performers;\nThe Celestial, Divine, and Human Swift Responders;\nThe Diviners of Staves, Lots, Cups, and Phoenixes, and the Dream-Transmitting Youths;\nThe spirit bureau officers;\nThe direct-duty and direct-talisman fragrant official envoys;\nThe local earth deities and all numinous spirits of the Temple of Numinous Aid.\n\nMay we reverently beseech Your Vast Compassion to condescend and manifest Your radiant presence.\n\nWe recall how Gou Long governed the earth and Zhu governed the valleys, thus establishing the altars of the state. The people of Zhou venerated fragrance, the people of Shang venerated sound, thereby communicating the virtue of the divine luminaries. Were not sacrificial animals offered solely for their blood? Yet even humble ferns may be presented to kings and dukes.\n\nTo be sagely yet unknowing is called divine; to be divine yet luminous is to enter into sageliness.\n\nWe reverently recall the Nine Heavens’ Golden Portal Illuminating Dao and Manifesting Virtue Great Immortal, Manifesting Universal Salvation, Vast and Subtle, Profoundly Empty and Wondrously Responsive, Compassionate and Benevolent Protector of the State and Shelter of the People, Vastly Gracious Perfected Lord; and the Nine Heavens’ Jade Portal Proclaiming Transformation and Upholding the Teachings Supreme Immortal, Radiantly Manifesting Universal Salvation, Lofty and Illustrious, Vastly Serene, Profoundly Tranquil, Wondrously Responsive, Benevolent and Compassionate Supporter of the State and Protector of the People, Vastly Gracious Perfected Lord.\n\nUprightness is their virtue, and fortune or misfortune moves people. They permeate the earth and the earth responds; they permeate the heavens and the heavens respond—none can fathom the subtlety of their numinous power. When they command the sun, the sun shines; when they command the rain, the rain falls, for they alone hold the authority of creation.\n\nTheir fame resounds gloriously, and their presence overflows as if near. Above, they assist the Dipper Perfected at the Northern Culmen; silently, they partake in the mysterious learning of Eastern Florescence. In harmony with the Dao, they abide in the divine. Their names ascend the Golden Portal, honored with the conferral of thirty-two characters. Their Dao accords with the Terrace of Dan, where they delved into the essence of over five thousand words. Responding to karmic conditions, they vowed to deliver beings.\n\nHaving already received the grace of their sheltering nurture, how dare we neglect the rites of gratitude and supplication? We reverently welcome the arrival of their dharma-chariot to descend upon this Daoist sanctuary.\n\nSome, clad in the rhythmic sway of immortal pendants, follow the eight phoenixes’ refrain. Others, robed in the dignified array of court attire, lead the hundred riders in welcome. Above and below, the immortals’ retinue arrays in splendor; to left and right, the numinous officials stand in guard.\n\nThough the wine offered is humble and the rites unadorned, may their virtue perceive the sincerity of our water-cress devotion. We, the assembly, can but bow with utmost reverence, awaiting the arrival of the Perfected Ones’ chariot.\n\nWe invite the Two Ranks—\nWe invoke the Sages.\n\nWhen the crane-drawn chariot arrives at the hall, we invite its ascent to the ritual altar. The officials and assembly offer incense, and the first libation of wine is presented. The chime sounds, and flowers are scattered.\n\nWe reverently recall how his renown in benevolence and righteousness spread like the branches of King Yan’s lineage; how his unyielding loyalty and martial valor inherited the noble ranks of the Qi state. His benevolent fame first flourished in Min, his virtuous reputation resounding throughout the land. His name was inscribed on bronze tripods, his deeds recorded in historical annals. When he was stationed south of the Gorge River, the people and soldiers remained secure as before. When he raised his banner atop Aofeng, the remnants of bandits were eradicated. Today, the peace of this blessed land is as gracious as the reign of Yao. How could we forget the debt of gratitude, like the binding grass? His praise is sung in the ode of the sweet pear tree. In death, he is venerated with temple offerings; in life, he was enfeoffed as a king—such honor is supreme. His virtue bestowed upon the people, his toil stabilized the realm—even now, he is extolled.\n\nIn times past, the grasses and trees responded to the numinous power of Mount Gong; today, the fields are spared the scourge of floods. Boats striking rocks would hear the cry of the yellow banner’s rescue. Neighboring fires would reverse their winds, sparing homes from the fate of the crooked chimney’s ruin. In Jiading, locusts dared not cross the border; in Baoqing, drought demons brought no disaster. When the red serpent appeared, rain poured from the nine heavens; when the divine dragon rose, thunder roared across ten thousand miles. Though no trace is visible—how could night reveal the lanterns of heaven? Though no sound is heard—how could day echo the strings and flutes?\n\nHis deeds endure for a thousand years, carved in stone steles; his royal enfeoffments, inscribed in gold across generations. Thus, the people come from a thousand miles to pay homage, and incense is offered in all four seasons with reverence. It is virtue we assist, not the fragrance of millet and grain. No improper offerings are made; only the purity of sacrificial grains is esteemed. Through meritorious deeds and accumulated goodness, through holding fast to precepts and maintaining purity—had he not profoundly aligned with the celestial will, how could he have ascended to the ranks of immortals?\n\nBy imperial decree, he was graced with the names of the Golden and Jade Towers, bestowed the titles of Great Immortal and Supreme Immortal. The Dao is our Dao; virtue is our virtue. Transform what is numinous, teach what is divine. Not merely to glorify a single moment or honor one life, but to illuminate what came before and inspire what follows. He taught harmony among kin, and the Hall of Joyful Feasting stands—above, the majesty of the Sacred Father and Sacred Mother; below, the prosperity of the Sacred Sons and Sacred Grandsons. The Sacred Uncle’s name is recorded in the Purple Court; the Sacred Elder Brother receives temple offerings in Jinling. The Divine Empress and her retinue oversee the Register of Life. The Sacred Consort and her immortal kin surround the ranks of inner attendants. Some govern the offices of fortune and emolument; others hold the posts of ministers and nobles. Their authority surpasses the Five Marshals, their valor leads the Three Armies. Whether martial or civil, whether to the left or right—this temple guards the seven Min lands, its grandeur unmatched. His virtue rivals the numinous power of the Five Peaks; who but the most sagely could compare?\n\nWe, sheltered by his divine protection, inherit peace. In every sip and bite, we dare not forget. Thrice bathed in fragrance, thrice anointed—we revere him as if he were present. Humbly welcoming his precious chariot, may he deign to witness the devotion of this humble servant’s rites. Gathering the feathered and robed, we dare to offer the auspicious hymns of the azure void.\n\nWe, the assembly, bow a hundred times and reverently pray: May the present emperor reign for a hundred million years, safeguarding the people as a father protects his children, bestowing a thousand blessings and a hundred fortunes. May the sovereign’s rule endure forever, and the imperial domain remain eternal. We, with utmost reverence, dare not cease in our proclamations. All sincere words shall now be recited.\n\n**Recitation:**\nAs the words dictate, they have been duly proclaimed. Humbly, we pray the immortal grace may condescend to regard them.\n\nWe reverently recall how warding off calamities and averting disasters demands the strictest observance of ritual. To repay merit and exalt virtue is the duty of advancing one’s immortal rank. May he be honored with the crimson decrees of the Golden Tower, and grace the incense altar of the Jade Emperor. In the ebb and flow of the Two Qi, may he master the arts of emerging from the azure and entering the mysterious. In the circulation of the Seven Fluids, may he attain the wonders of embracing the purple and holding the yellow. In himself, he embodies the beauty of self-cultivation; for others, he extends the merit of universal salvation. What he senses is surely communicated; no request goes unanswered. To relieve the people’s suffering, what need is there for Bian Que’s remedies? To divine the yin and yang of land, he silently imparts Guo Pu’s learning. For those seeking marriage, may homes and chambers prosper. For those praying for descendants, may sons and grandsons flourish. For those pursuing office, may they be exhorted to establish themselves through loyalty and filial piety. For merchants, may they be instructed that benevolence and righteousness are the true profit. Farmers toil in the fields; artisans perfect their skills. Near and far, all are pleased and drawn near—manifesting benevolence while concealing its application. Those who turn their hearts to the Dao are all enlightened by his grace. Whether tonsured or with hair bound, all rely on his sheltering protection.\n\nToday, we, the assembly, reverently follow the sacred decree, establishing this ritual to repay the true blessings and pray for abundant favor. Humbly, we pray: May his sagely virtue remain pure, his divine merit resplendent. May the Nine Heavens bestow blessings, bringing boundless fortune; may the Two Luminaries shine together, opening the vast realm of longevity. May all living things flourish, and all undertakings prosper.\n\nThe assembly bows, offers incense and wine, and presents the second libation. The chime sounds, and flowers are scattered.\n\nWe have heard how the stele of Luo Chi endures forever, its heroic spirit indelible. The Donghua Cave of a thousand years—who has carried on its true essence? We revere the local deity, whose deeds span the heavens. His skeletal form merges with the immortals in vast beneficence; his literary brilliance rivals that of Lord Liu. Had he not stored the essence of the stars, he must have been nurtured by the mountains and rivers. His poems, odes, and eulogies are worthy of recitation—indeed, they demand grand inscription, repeated inscription, and yet more inscription.\n\nIn matters of fortune and misfortune, there is no error; yet we dare not presume, lest we trespass again and again. Clearly perceiving the principles of the manifest and hidden, he foresees the mechanisms of dependence and reversal. His countenance is grave and awe-inspiring, feared like the frost and scorching sun. His Dao is lofty and distant, revered like the North Star and Mount Tai. His illustrious virtue shines brightly; his imperial numen gleams sharply.\n\nToday, we, the assembly, reverently follow the sacred decree, establishing this precious fast to manifestly repay divine favor and pray for abundant blessings. Humbly, we pray: May the imperial domain stand firm, as enduring as the mountains and peaks.\n\nMay the sacred body enjoy abundant peace, as enduring as Heaven and Earth. May the six palaces ever know felicity, and the myriad realms all attain tranquility.\n\nThe assembly bows in reverence, offering incense and wine, presenting the final libation. The proclamation is read, and the sacred departure begins.\n\nWe hear that the towering peaks of Ao rise in majesty, nearly touching the celestial stars. The dragon’s head rears proudly, bestowing upon the mortal realm its rain and dew. Having long received such grace in ordinary times, how shall we repay it now? Pure offerings are arrayed, yet we humbly lack jade urns and golden nectar. The fare of the immortals—nothing but fire-dates and intertwined pears.\n\nNow the precious talismans’ incense fades, the silver lamps’ flames grow cold. Star-crowned and feather-robed, the steps of emptiness resound afar in the jade palace. Mist-borne chariots and cloud-borne carriages, the celestial procession prepares to return to the golden portals. Though our hearts race with lingering devotion, we pray still for descending blessings and exorcising rites.\n\nThe assembly, with utmost reverence, bows twice more in farewell.\n\n**Sending Forth the Deities**\n\nThe incense-burning officials, the divine lords left and right, and the attending spirit-officials of the incense—at this place of the present fast, may golden elixirs, cinnabar mushrooms, and azure herbs naturally arise. May the hundred spirits and host of perfected ones gather in celebration before this incense burner.\n\nMay the imperial will be conveyed in full, and the true mirror perceive all without omission. May the jade maidens and immortal youths of the ten directions attend the rising incense, transmitting the words we have just uttered, swiftly delivering them to the presence of the **Radiant Dao and Virtuous Great Immortal of the Golden Portals of the Nine Heavens, Manifestly Potent and Universally Beneficent, Pure and Subtle, Profoundly Empty and Wondrously Responsive, Compassionate and Gracious, Protector of the State and Shelter of the People, Vastly Benevolent Perfected Lord**; and to the **Illustrious and Vastly Beneficent Perfected Lord of the Jade Portals of the Nine Heavens, Propagator of Transformation and Upholder of the Dao, Brilliant and Potent, Lofty and Serene, Profoundly Still and Wondrously Responsive, Benevolent and Gracious, Supporter of the State and Protector of the People**.\n\nTo the **Vastly Benevolent and Spiritually Efficacious Perfected Lord**, we offer thanks and conclude the rites of this fast.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洪恩灵济真君祈谢设醮科 经名：洪恩灵济真君祈谢设醮科。 撰人不祥。 一卷。 底本出处：《正统道藏》洞玄部威仪类。 洪恩灵济真君祈谢设醮科 法事 各礼师存念如法 请宣神咒 五星列照，焕明五方。 水星却灾，木德致昌。 荧惑消祸，太白辟兵。 镇星四据，家国利亨。 名刊玉简，字录帝房。 乘飙散景，飞腾太空。 出入冥无，游宴十方。 五云浮盖，招神摄风。 役使万灵，上卫仙翁。 呜法鼓二十四通 太上玄元五灵老君，召出臣等身中三五功曹，左右香官使者，侍香金童，传言散花玉女，直日香官，功曹使者，三炁正神。 速上关启查边魏赵刁五大元帅，岳许二元帅，天丁力士，左右神官。 以今严陈醮礼，谨钦奉圣旨，其诸意旨，已录上闻。 愿得正真生炁，下降流入臣等身中，令今所启之言，速达九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君、九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君道前。 请称法位 具位臣某，与临坛官众等，谨同诚上启：九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君， 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君， 圣父齐王忠武翊亮真君， 圣母仁寿淑善仙妃， 圣妃泾国夫人顺助仁惠贞应仙妃， 卫国夫人善助慈懿恭静仙妃， 圣兄唐王、洪王、鄂王、广陵王，圣舅护国公、奉国公，圣婿武安侯，宁国侯，圣子保大侯、彰信侯、保信侯、保宁侯、武宁公，圣侄昭德侯、安定侯、太宁侯，圣孙武昌侯、南昌侯，圣子圣孙圣侄列位公侯，唐王后明肃仙妃，洪王后仁慈仙妃，鄂王后顺懿仙妃，广陵王后善庆仙妃，圣女冲懿仙姬、明懿仙姬，圣妇善懿夫人、仁柔夫人、惠顺夫人、昭懿夫人、顺恭夫人、明哲夫人、恭懿夫人、靖懿夫人、昭穆夫人、慈孝夫人，圣妇列位夫人。 上清大洞箓天机院雷霆省天文院地府诸司承行官将，驱邪捉祟，传符勅法、消灾度厄、逐凶辟怪、监坛护法，观察巡捕将军，太岁尊神十二月将，本命元辰星官，风雷雨部仙众，左右丞相太宰少宰，六部尚侍内府公卿，左右注生注寿上宰，左右司禄司福上宰，左右侍从通事舍人，百官庶司所属曹僚列位公卿，左右福禄司所属二十四司曹官典，左右引进仙官内侍顺成夫人、昭华夫人、容华夫人、修容夫人、修仪夫人、昭仪夫人、内典妇功夫人、丝枲夫人、莞库夫人、帐籍夫人、度支夫人、女府女史列位才人，女祝女御列位贵人，内殿内侍内典列位圣眷夫人，燕喜堂内注生司天一注生神后、太一监生神后，司禄司命上相夫人，守胎卫房夫人，保胎护命夫人，左右慈训夫人，保传夫人，左右掌籍夫人，掌印夫人，诸宫乳哺夫人、抱送夫人、抚育夫人、托生化婆神，永安留守查元帅，武安留守边元帅，节度使左监门魏元帅，都统军使右监门赵元帅，都监军使先锋刁元帅，五帅部下精兵猛将，左右岳、许二元帅，左右行宫侍御从官，司禄、司勋、司士、司书、列位曹僚、司农、司稼、典丝、掌葛列位曹僚，司市、掌货、考功、饬材列位曹僚，厨官、优官、伶官，天捷、神捷、人捷，掌卜、掌签、掌杯、掌鸾、传梦童子，神局节级，直殿直符香官使者，灵济宫土地合属威灵。",
      "translated_text": "**Ritual for Offering Thanksgiving and Establishing the Jiao for the Venerable Lords of Vast Grace and Numinous Aid**\n\n**Title:** *Ritual for Offering Thanksgiving and Establishing the Jiao for the Venerable Lords of Vast Grace and Numinous Aid*\n**Author:** Unknown\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongxuan* Section, *Weiyi* (Ritual Propriety) Category\n\n---\n\n**Ritual for Offering Thanksgiving and Establishing the Jiao for the Venerable Lords of Vast Grace and Numinous Aid**\n\n**Ritual Procedures**\nEach bows to the masters and recollects the mind in accordance with the Dharma.\n\n**Invocation of the Divine Mantra**\nThe Five Stars array their radiance, illuminating the five directions.\nThe Water Star averts calamity; the virtue of Wood brings prosperity.\nMars dispels misfortune; Venus repels warfare.\nSaturn guards the four quarters, ensuring the state and household thrive.\nNames inscribed on jade tablets, characters recorded in the imperial chambers.\nRiding the whirlwind, scattering light, soaring through the vast heavens.\nMoving in and out of the unseen, roaming and feasting in the ten directions.\nFive-colored clouds float as canopies, summoning spirits and commanding winds.\nCommanding the myriad spirits, upholding the immortal elders above.\n\n**Striking the Dharma Drum Twenty-Four Times**\nThe Most High Mysterious Origin, the Five Numinous Elder Lord, summons forth the Three and Five Merit Officials within our bodies, the Left and Right Fragrant Official Envoys, the Golden Youth Attendant of Incense, the Jade Maiden Dispersing Flowers and Transmitting Words, the Direct-Day Fragrant Official, the Merit Official Envoys, and the Three Qi True Spirits.\nHasten to report to the Five Great Marshals—Wei, Guan, Bian, Zhao, and Diao—the Two Marshals Yue and Xu, the Heavenly Soldiers and Mighties, and the Left and Right Divine Officials.\nOn this solemn occasion of establishing the jiao rites, we reverently receive the sacred decree. All intentions and decrees have been recorded and submitted above.\nMay the true qi of life descend and flow into our bodies, that the words we now present may swiftly reach the Golden Towers of the Nine Heavens before the Great Immortal of Illuminating Dao and Penetrating Virtue, the Manifestly Numinous and Universally Beneficent, the Pure and Subtle, the Cavernously Mysterious, the Profoundly Void, the Wondrously Responsive, the Compassionate and Benevolent, the Protector of the State and Shelter of the People, the Venerable Lord of Vast Grace;\nAnd before the Supreme Immortal of the Jade Towers of the Nine Heavens, the Proclaimer of Transformation and Upholder of the Dao, the Illustrious and Numinously Vast, the Lofty and Serene, the Profoundly Tranquil and Wondrously Responsive, the Benevolent and Merciful, the Assistant of the State and Guardian of the People, the Venerable Lord of Vast Grace.\n\n**Proclamation of the Dharma Titles**\nWe, your humble servants, along with the assembled officials at the altar, reverently and sincerely submit this petition before:\nThe Great Immortal of the Golden Towers of the Nine Heavens, Illuminating Dao and Penetrating Virtue, Manifestly Numinous and Universally Beneficent, Pure and Subtle, Cavernously Mysterious, Profoundly Void, Wondrously Responsive, Compassionate and Benevolent, Protector of the State and Shelter of the People, the Venerable Lord of Vast Grace;\nThe Supreme Immortal of the Jade Towers of the Nine Heavens, Proclaimer of Transformation and Upholder of the Dao, Illustrious and Numinously Vast, Lofty and Serene, Profoundly Tranquil and Wondrously Responsive, Benevolent and Merciful, Assistant of the State and Guardian of the People, the Venerable Lord of Vast Grace;\nThe Sacred Father, the Loyal and Martial Duke of Qi, the True Lord of Upholding Brilliance;\nThe Sacred Mother, the Benevolent and Longevous, Kind and Virtuous Immortal Consort;\nThe Sacred Consort, the Lady of Jing State, the Assisting and Benevolent, Upright and Responsive Immortal Consort;\nThe Lady of Wei State, the Kindly Assisting, Compassionate and Dignified, Reverent and Serene Immortal Consort;\nThe Sacred Brothers, the Prince of Tang, the Prince of Hong, the Prince of E, the Prince of Guangling;\nThe Sacred Uncle, the Duke Protecting the State, the Duke Serving the State;\nThe Sacred Sons-in-Law, the Marquis of Wu’an, the Marquis of Ningguo;\nThe Sacred Sons, the Marquis of Baoda, the Marquis of Zhangxin, the Marquis of Baoxin, the Marquis of Baoning, the Duke of Wuning;\nThe Sacred Nephews, the Marquis of Zhaode, the Marquis of Anding, the Marquis of Taining;\nThe Sacred Grandsons, the Marquis of Wuchang, the Marquis of Nanchang;\nThe Sacred Sons, Grandsons, and Nephews, all the ranked Dukes and Marquises;\nThe Sacred Consorts of the Prince of Tang, the Illustrious and Solemn Immortal Consort;\nThe Sacred Consorts of the Prince of Hong, the Benevolent and Compassionate Immortal Consort;\nThe Sacred Consorts of the Prince of E, the Compliant and Dignified Immortal Consort;\nThe Sacred Consorts of the Prince of Guangling, the Kindly and Auspicious Immortal Consort;\nThe Sacred Daughters, the Pure and Dignified Immortal Maiden, the Illustrious and Dignified Immortal Maiden;\nThe Sacred Daughters-in-Law, the Kindly and Dignified Lady, the Benevolent and Gentle Lady, the Gracious and Compliant Lady, the Illustrious and Dignified Lady, the Compliant and Reverent Lady, the Illustrious and Wise Lady, the Reverent and Dignified Lady, the Serene and Dignified Lady, the Illustrious and Harmonious Lady, the Compassionate and Filial Lady;\nAll the Sacred Daughters-in-Law, the ranked Ladies.\n\nThe Officials and Generals of the Upper Clarity Great Cavern Register, the Heavenly Mechanism Bureau, the Thunderclap Ministry, the Celestial Astronomy Bureau, and the Earthly Prisons, who expel evil and seize malevolent spirits, transmit talismans and decrees, dispel disasters and deliver from calamity, drive away misfortune and repel monstrosities, oversee the altar and protect the Dharma;\nThe Inspecting and Patrolling Generals;\nThe Venerable Spirits of the Year-Star and the Twelve Monthly Generals;\nThe Star Officials of the Original Destiny and Celestial Time;\nThe Immortal Hosts of the Wind, Thunder, and Rain Departments;\nThe Left and Right Chancellors, Grand Masters, and Lesser Masters;\nThe Ministers of the Six Ministries and the Inner Court Dukes and Ministers;\nThe Left and Right High Ministers of Life-Recording and Longevity-Recording;\nThe Left and Right High Ministers of Emolument and Fortune;\nThe Left and Right Attendants and Envoys;\nThe various officials and subordinates of the hundred bureaus;\nThe ranked Dukes and Ministers of the Twenty-Four Bureaus under the Left and Right Emolument and Fortune Departments;\nThe Left and Right Introducing Immortal Officials;\nThe Inner Attendants: the Lady of Shuncheng, the Lady of Zhaohua, the Lady of Ronghua, the Lady of Xiurong, the Lady of Xiuyi, the Lady of Zhaoyi;\nThe Ladies of the Inner Canon, the Weaving and Hemp Bureau, the Mat and Treasury Bureau, the Curtain and Register Bureau, the Revenue Bureau, and the Women’s Palace;\nThe female scribes and all the talented women;\nThe female invocators and female attendants, all the noble women;\nThe inner attendants and inner canonists, all the sacred kin Ladies of the inner palace;\nThe Ladies of the Yanxi Hall, the Life-Recording Bureau of the Celestial Unity, the Life-Recording Spirit of Taiyi;\nThe High Minister of Emolument and Destiny;\nThe Lady Guarding the Womb and Protecting the Chamber;\nThe Lady Protecting the Fetus and Safeguarding Life;\nThe Left and Right Ladies of Compassionate Instruction;\nThe Lady of Transmission and Protection;\nThe Left and Right Ladies of Record-Keeping;\nThe Lady of Seal-Keeping;\nThe Ladies of the various palaces responsible for nursing, holding, nurturing, and delivering infants;\nThe Transforming Matrons of Birth;\nMarshal Cha, the Eternal Guardian of Yong’an;\nMarshal Bian, the Martial Guardian of Wu’an;\nMarshal Wei, the Left Gate-Monitoring Commissioner and Military Commissioner;\nMarshal Zhao, the Right Gate-Monitoring Commissioner and Commander-in-Chief;\nMarshal Diao, the Vanguard Commander and Military Supervisor;\nThe valiant generals and fierce soldiers under the command of the Five Marshals;\nThe Left and Right Marshals Yue and Xu;\nThe attendants and officials of the traveling palaces;\nThe officials of the Emolument, Merit, Scholars, and Archives Bureaus;\nThe officials of the Agriculture, Crops, Silk, and Hemp Bureaus;\nThe officials of the Markets, Commerce, Merit Assessment, and Material Preparation Bureaus;\nThe Kitchen Officials, Entertainers, and Performers;\nThe Celestial, Divine, and Human Swift Responders;\nThe Diviners of Staves, Lots, Cups, and Phoenixes, and the Dream-Transmitting Youths;\nThe spirit bureau officers;\nThe direct-duty and direct-talisman fragrant official envoys;\nThe local earth deities and all numinous spirits of the Temple of Numinous Aid.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1273,
      "start_sentence": 0,
      "end_sentence": 31,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.38692116737366,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君祈谢设醮科.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "恭望洪慈，俯垂昭格。 伏以句龙能土，柱能谷，乃兴社稷之祠。 周人尚臭，商尚声，以通神明之德。 岂牺牲特为之血食，然苹苹可荐於王公。 圣而不知，是谓之神，神而能明，乃入於圣。 恭惟九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君、九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君，正直为德，祸福动人。 潜地而地，潜天而天，莫测威灵之妙。 曰旸而旸，曰雨而雨，独专造化之权。 赫赫厥声，洋洋如在。 上佐斗真於北极，默参玄学於东华，与道合真，惟神是守。 名登金阙荣颁三十二字之封。 道契丹台，探得五千余言之旨。 随机赴感，发誓度人。 既蒙覆育之恩，敢昧谢祈之典。 恭迎法驾，来降道场。 或服仙佩之跄跄，八鸾后唱。 或衣朝衣之济济，百骑前迎。 上下之仙眷森罗，左右之灵官拥卫。 酒陈菲礼，德鉴芹诚。 众等无任勤拳，奉迎真驭。 请两班 请圣",
      "translated_text": "May we reverently beseech Your Vast Compassion to condescend and manifest Your radiant presence.\n\nWe recall how Gou Long governed the earth and Zhu governed the valleys, thus establishing the altars of the state. The people of Zhou venerated fragrance, the people of Shang venerated sound, thereby communicating the virtue of the divine luminaries. Were not sacrificial animals offered solely for their blood? Yet even humble ferns may be presented to kings and dukes.\n\nTo be sagely yet unknowing is called divine; to be divine yet luminous is to enter into sageliness.\n\nWe reverently recall the Nine Heavens’ Golden Portal Illuminating Dao and Manifesting Virtue Great Immortal, Manifesting Universal Salvation, Vast and Subtle, Profoundly Empty and Wondrously Responsive, Compassionate and Benevolent Protector of the State and Shelter of the People, Vastly Gracious Perfected Lord; and the Nine Heavens’ Jade Portal Proclaiming Transformation and Upholding the Teachings Supreme Immortal, Radiantly Manifesting Universal Salvation, Lofty and Illustrious, Vastly Serene, Profoundly Tranquil, Wondrously Responsive, Benevolent and Compassionate Supporter of the State and Protector of the People, Vastly Gracious Perfected Lord.\n\nUprightness is their virtue, and fortune or misfortune moves people. They permeate the earth and the earth responds; they permeate the heavens and the heavens respond—none can fathom the subtlety of their numinous power. When they command the sun, the sun shines; when they command the rain, the rain falls, for they alone hold the authority of creation.\n\nTheir fame resounds gloriously, and their presence overflows as if near. Above, they assist the Dipper Perfected at the Northern Culmen; silently, they partake in the mysterious learning of Eastern Florescence. In harmony with the Dao, they abide in the divine. Their names ascend the Golden Portal, honored with the conferral of thirty-two characters. Their Dao accords with the Terrace of Dan, where they delved into the essence of over five thousand words. Responding to karmic conditions, they vowed to deliver beings.\n\nHaving already received the grace of their sheltering nurture, how dare we neglect the rites of gratitude and supplication? We reverently welcome the arrival of their dharma-chariot to descend upon this Daoist sanctuary.\n\nSome, clad in the rhythmic sway of immortal pendants, follow the eight phoenixes’ refrain. Others, robed in the dignified array of court attire, lead the hundred riders in welcome. Above and below, the immortals’ retinue arrays in splendor; to left and right, the numinous officials stand in guard.\n\nThough the wine offered is humble and the rites unadorned, may their virtue perceive the sincerity of our water-cress devotion. We, the assembly, can but bow with utmost reverence, awaiting the arrival of the Perfected Ones’ chariot.\n\nWe invite the Two Ranks—\nWe invoke the Sages.",
      "overlap_context": " the Agriculture, Crops, Silk, and Hemp Bureaus;\nThe officials of the Markets, Commerce, Merit Assessment, and Material Preparation Bureaus;\nThe Kitchen Officials, Entertainers, and Performers;\nThe Celestial, Divine, and Human Swift Responders;\nThe Diviners of Staves, Lots, Cups, and Phoenixes, and the Dream-Transmitting Youths;\nThe spirit bureau officers;\nThe direct-duty and direct-talisman fragrant official envoys;\nThe local earth deities and all numinous spirits of the Temple of Numinous Aid.",
      "start_char": 1273,
      "end_char": 1643,
      "start_sentence": 32,
      "end_sentence": 53,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.655611038208008,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君祈谢设醮科.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "鹤驾临轩，请升醮座，官众上香，酒陈初献。 磬举散花 恭闻仁义着称，枝叶分偃王之裔； 忠武不屈，簪缨袭齐国之封。 仁声肇着於闽中，德誉远闻於海内。 勒名锺鼎，立传史书。 出戍於峡江之南，吏兵之安堵如故。 立帜於鳌峰之上，盗贼之余党剿除。 顿今福地之安，均荷尧天之赐。 恩敢忘於结草，诗可咏於甘棠。 死庙食，生封王，可谓至矣。 德施民，劳定国，于今称之。 昔焉草木效公山之灵，今也田畴息洪水之害。 民船激石，果闻黄旗救援之声。 邻火返风，永无曲突焦烂之患。 嘉定之蝗虫不入境，宝庆之旱魃不为灾。 红蛇见而雨沛九天，神龙起而雷轰万里。 无迹可见，夜何见於天灯。 无声可闻，日何闻於丝竹。 事迹千年留石碣，王封累代侈金书。 致士民千里以来归，宜香火四时而寅奉。 惟德是辅，岂图黍稷之馨。 非类不故，特重粢盛之洁。 建功积善，执戒清斋，若非上格於天心，何以超升於仙秩。 钦承帝命，仰沐玄风，特书金阙玉阙之名，颁降大仙上仙之号。 道吾道也，德吾德也。 化神化之，教神教之。 不惟夸一时而荣一身，抑亦光乃前而振乃后。 亲睦是教，燕喜有堂，上瞻圣父圣母之尊严，下列圣子圣孙之富贵。 圣舅名登於紫府，圣兄庙食於金陵。 神后夫人，专掌注生之籍。 圣妃仙眷，环居内侍之班。 或分福禄之司，或任公卿之职，权尊五帅，勇冠三军，乃武乃文，在左在右。 庙镇七闽之地，其甚盛蔑以加诸。 德参五岳之灵，非至圣孰能与此。 某等席神之庇，遗我以安。 一饮一啄，初不敢忘。 三沐三熏，敬之如在。 祇迎宝驭，少鉴鬯人斋事之勤。 爰集羽流，敢献碧落空歌之瑞。 臣等百拜，恭祝当今皇帝，亿载万年，为父母保子姓以安全，千禄百福，宜君王畀皇图而永久。 某等钦承惟谨，敢息宣行，所有诚词，谨当宣奏。 宣词 按如词旨，已具敷宣。 伏冀仙慈，俯垂省览。 恭闻捍患御灾，礼特严於祀典。 报功崇德，职宜进於仙阶。 荐膺金阙之缇书，荣侍玉皇之香案。 二气吐纳，深究出青入玄之方。 七液周流，有得回紫抱黄之妙。 在身为独善之美，於人施兼济之功。 所感必通，无求不应。 救民疾苦，何须扁鹊之方。 卜地阴阳，默授景纯之学。 问婚者，宜家宜室。 祈嗣者，生子生孙。 求仕者，劝之以忠孝立身。 行商者，告之以仁义为利。 农力於穑，工精其能。 近者悦而远者来，显诸仁而藏诸用。 皈心向道，皆蒙启迪之恩。 戴发垂髻，俱托帡蒙之庇。 以今臣等，钦承圣旨，用建醮因，答谢真麻，祈敷景贶。 伏愿圣德凝纯，神功丕着。 九天锡庆，来浩浩之福源，二景齐明，开巍巍之寿域。 百昌均被，庶绩咸熙。 众等设拜，上香酒，陈亚献。 知磬举散花 伏闻一片罗池碑，终古难磨其英气。 千年东华洞，至今孰绍於真风。 洪惟守土神，积此弥天之行。 骨像合仙於广惠，文章并驾於柳侯。 若非星宿之储精，必也山川之孕秀。 有诗歌赋颂之可述，须严大书特书至於屡书。 言吉凶祸福以无差，未免初渎再渍烦于三渎。 灼见显幽之理，预明倚伏之机。 貌重而威，畏之如严霜烈日。 道高且远，仰之如北斗泰山。 盛德昭昭，皇灵剡剡。 以今臣等钦承圣旨，崇建宝斋，昭答灵庥，祈敷景贶。 伏愿皇图巩固，并山岳以同坚。",
      "translated_text": "When the crane-drawn chariot arrives at the hall, we invite its ascent to the ritual altar. The officials and assembly offer incense, and the first libation of wine is presented. The chime sounds, and flowers are scattered.\n\nWe reverently recall how his renown in benevolence and righteousness spread like the branches of King Yan’s lineage; how his unyielding loyalty and martial valor inherited the noble ranks of the Qi state. His benevolent fame first flourished in Min, his virtuous reputation resounding throughout the land. His name was inscribed on bronze tripods, his deeds recorded in historical annals. When he was stationed south of the Gorge River, the people and soldiers remained secure as before. When he raised his banner atop Aofeng, the remnants of bandits were eradicated. Today, the peace of this blessed land is as gracious as the reign of Yao. How could we forget the debt of gratitude, like the binding grass? His praise is sung in the ode of the sweet pear tree. In death, he is venerated with temple offerings; in life, he was enfeoffed as a king—such honor is supreme. His virtue bestowed upon the people, his toil stabilized the realm—even now, he is extolled.\n\nIn times past, the grasses and trees responded to the numinous power of Mount Gong; today, the fields are spared the scourge of floods. Boats striking rocks would hear the cry of the yellow banner’s rescue. Neighboring fires would reverse their winds, sparing homes from the fate of the crooked chimney’s ruin. In Jiading, locusts dared not cross the border; in Baoqing, drought demons brought no disaster. When the red serpent appeared, rain poured from the nine heavens; when the divine dragon rose, thunder roared across ten thousand miles. Though no trace is visible—how could night reveal the lanterns of heaven? Though no sound is heard—how could day echo the strings and flutes?\n\nHis deeds endure for a thousand years, carved in stone steles; his royal enfeoffments, inscribed in gold across generations. Thus, the people come from a thousand miles to pay homage, and incense is offered in all four seasons with reverence. It is virtue we assist, not the fragrance of millet and grain. No improper offerings are made; only the purity of sacrificial grains is esteemed. Through meritorious deeds and accumulated goodness, through holding fast to precepts and maintaining purity—had he not profoundly aligned with the celestial will, how could he have ascended to the ranks of immortals?\n\nBy imperial decree, he was graced with the names of the Golden and Jade Towers, bestowed the titles of Great Immortal and Supreme Immortal. The Dao is our Dao; virtue is our virtue. Transform what is numinous, teach what is divine. Not merely to glorify a single moment or honor one life, but to illuminate what came before and inspire what follows. He taught harmony among kin, and the Hall of Joyful Feasting stands—above, the majesty of the Sacred Father and Sacred Mother; below, the prosperity of the Sacred Sons and Sacred Grandsons. The Sacred Uncle’s name is recorded in the Purple Court; the Sacred Elder Brother receives temple offerings in Jinling. The Divine Empress and her retinue oversee the Register of Life. The Sacred Consort and her immortal kin surround the ranks of inner attendants. Some govern the offices of fortune and emolument; others hold the posts of ministers and nobles. Their authority surpasses the Five Marshals, their valor leads the Three Armies. Whether martial or civil, whether to the left or right—this temple guards the seven Min lands, its grandeur unmatched. His virtue rivals the numinous power of the Five Peaks; who but the most sagely could compare?\n\nWe, sheltered by his divine protection, inherit peace. In every sip and bite, we dare not forget. Thrice bathed in fragrance, thrice anointed—we revere him as if he were present. Humbly welcoming his precious chariot, may he deign to witness the devotion of this humble servant’s rites. Gathering the feathered and robed, we dare to offer the auspicious hymns of the azure void.\n\nWe, the assembly, bow a hundred times and reverently pray: May the present emperor reign for a hundred million years, safeguarding the people as a father protects his children, bestowing a thousand blessings and a hundred fortunes. May the sovereign’s rule endure forever, and the imperial domain remain eternal. We, with utmost reverence, dare not cease in our proclamations. All sincere words shall now be recited.\n\n**Recitation:**\nAs the words dictate, they have been duly proclaimed. Humbly, we pray the immortal grace may condescend to regard them.\n\nWe reverently recall how warding off calamities and averting disasters demands the strictest observance of ritual. To repay merit and exalt virtue is the duty of advancing one’s immortal rank. May he be honored with the crimson decrees of the Golden Tower, and grace the incense altar of the Jade Emperor. In the ebb and flow of the Two Qi, may he master the arts of emerging from the azure and entering the mysterious. In the circulation of the Seven Fluids, may he attain the wonders of embracing the purple and holding the yellow. In himself, he embodies the beauty of self-cultivation; for others, he extends the merit of universal salvation. What he senses is surely communicated; no request goes unanswered. To relieve the people’s suffering, what need is there for Bian Que’s remedies? To divine the yin and yang of land, he silently imparts Guo Pu’s learning. For those seeking marriage, may homes and chambers prosper. For those praying for descendants, may sons and grandsons flourish. For those pursuing office, may they be exhorted to establish themselves through loyalty and filial piety. For merchants, may they be instructed that benevolence and righteousness are the true profit. Farmers toil in the fields; artisans perfect their skills. Near and far, all are pleased and drawn near—manifesting benevolence while concealing its application. Those who turn their hearts to the Dao are all enlightened by his grace. Whether tonsured or with hair bound, all rely on his sheltering protection.\n\nToday, we, the assembly, reverently follow the sacred decree, establishing this ritual to repay the true blessings and pray for abundant favor. Humbly, we pray: May his sagely virtue remain pure, his divine merit resplendent. May the Nine Heavens bestow blessings, bringing boundless fortune; may the Two Luminaries shine together, opening the vast realm of longevity. May all living things flourish, and all undertakings prosper.\n\nThe assembly bows, offers incense and wine, and presents the second libation. The chime sounds, and flowers are scattered.\n\nWe have heard how the stele of Luo Chi endures forever, its heroic spirit indelible. The Donghua Cave of a thousand years—who has carried on its true essence? We revere the local deity, whose deeds span the heavens. His skeletal form merges with the immortals in vast beneficence; his literary brilliance rivals that of Lord Liu. Had he not stored the essence of the stars, he must have been nurtured by the mountains and rivers. His poems, odes, and eulogies are worthy of recitation—indeed, they demand grand inscription, repeated inscription, and yet more inscription.\n\nIn matters of fortune and misfortune, there is no error; yet we dare not presume, lest we trespass again and again. Clearly perceiving the principles of the manifest and hidden, he foresees the mechanisms of dependence and reversal. His countenance is grave and awe-inspiring, feared like the frost and scorching sun. His Dao is lofty and distant, revered like the North Star and Mount Tai. His illustrious virtue shines brightly; his imperial numen gleams sharply.\n\nToday, we, the assembly, reverently follow the sacred decree, establishing this precious fast to manifestly repay divine favor and pray for abundant blessings. Humbly, we pray: May the imperial domain stand firm, as enduring as the mountains and peaks.",
      "overlap_context": "’ refrain. Others, robed in the dignified array of court attire, lead the hundred riders in welcome. Above and below, the immortals’ retinue arrays in splendor; to left and right, the numinous officials stand in guard.\n\nThough the wine offered is humble and the rites unadorned, may their virtue perceive the sincerity of our water-cress devotion. We, the assembly, can but bow with utmost reverence, awaiting the arrival of the Perfected Ones’ chariot.\n\nWe invite the Two Ranks—\nWe invoke the Sages.",
      "start_char": 1643,
      "end_char": 2871,
      "start_sentence": 54,
      "end_sentence": 134,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.9448344707489,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君祈谢设醮科.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "圣体裕安，等乾坤而齐永。 六宫恒吉，万国咸宁。 众等设拜，上香酒，陈终献。 宣状 送圣 伏闻鳌峰耸杰，可攀天上之星辰。 龙首轩昂，沛作人间之雨露。 良以感恩於平日，将何酬报於今时。 清供载陈，愧乏玉瓮金醴。 仙家所茹，无非火枣交梨。 今则宝篆香残，银釭焰冷。 星冠羽服，步虚远彻於瑶宫。 雾辈云軿，队仗将旋於金阙。 徒切驰情於恋恋，更祈降福以禳禳。 众等虔诚，再拜奉送。 送神 复炉 香官使者、左右神君、侍香诸灵官，当今设醮之所，自然生金液丹碧芝英，百灵众真庆会，在此香火炉前。 当愿宸衷孚达，真鉴无遗。 十方仙童玉女，接侍香烟，传臣向来所启之言，速达径御九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君、九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君圣前。 洪恩灵济真君祈谢设醮科竟",
      "translated_text": "May the sacred body enjoy abundant peace, as enduring as Heaven and Earth. May the six palaces ever know felicity, and the myriad realms all attain tranquility.\n\nThe assembly bows in reverence, offering incense and wine, presenting the final libation. The proclamation is read, and the sacred departure begins.\n\nWe hear that the towering peaks of Ao rise in majesty, nearly touching the celestial stars. The dragon’s head rears proudly, bestowing upon the mortal realm its rain and dew. Having long received such grace in ordinary times, how shall we repay it now? Pure offerings are arrayed, yet we humbly lack jade urns and golden nectar. The fare of the immortals—nothing but fire-dates and intertwined pears.\n\nNow the precious talismans’ incense fades, the silver lamps’ flames grow cold. Star-crowned and feather-robed, the steps of emptiness resound afar in the jade palace. Mist-borne chariots and cloud-borne carriages, the celestial procession prepares to return to the golden portals. Though our hearts race with lingering devotion, we pray still for descending blessings and exorcising rites.\n\nThe assembly, with utmost reverence, bows twice more in farewell.\n\n**Sending Forth the Deities**\n\nThe incense-burning officials, the divine lords left and right, and the attending spirit-officials of the incense—at this place of the present fast, may golden elixirs, cinnabar mushrooms, and azure herbs naturally arise. May the hundred spirits and host of perfected ones gather in celebration before this incense burner.\n\nMay the imperial will be conveyed in full, and the true mirror perceive all without omission. May the jade maidens and immortal youths of the ten directions attend the rising incense, transmitting the words we have just uttered, swiftly delivering them to the presence of the **Radiant Dao and Virtuous Great Immortal of the Golden Portals of the Nine Heavens, Manifestly Potent and Universally Beneficent, Pure and Subtle, Profoundly Empty and Wondrously Responsive, Compassionate and Gracious, Protector of the State and Shelter of the People, Vastly Benevolent Perfected Lord**; and to the **Illustrious and Vastly Beneficent Perfected Lord of the Jade Portals of the Nine Heavens, Propagator of Transformation and Upholder of the Dao, Brilliant and Potent, Lofty and Serene, Profoundly Still and Wondrously Responsive, Benevolent and Gracious, Supporter of the State and Protector of the People**.\n\nTo the **Vastly Benevolent and Spiritually Efficacious Perfected Lord**, we offer thanks and conclude the rites of this fast.",
      "overlap_context": "and reversal. His countenance is grave and awe-inspiring, feared like the frost and scorching sun. His Dao is lofty and distant, revered like the North Star and Mount Tai. His illustrious virtue shines brightly; his imperial numen gleams sharply.\n\nToday, we, the assembly, reverently follow the sacred decree, establishing this precious fast to manifestly repay divine favor and pray for abundant blessings. Humbly, we pray: May the imperial domain stand firm, as enduring as the mountains and peaks.",
      "start_char": 2871,
      "end_char": 3232,
      "start_sentence": 135,
      "end_sentence": 155,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.101198196411133,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君祈谢设醮科.txt",
        "category": "威仪类"
      }
    }
  ]
}