{
  "source_id": "洪恩灵济真君礼愿文",
  "source_file": "chunked_daozang\\洪恩灵济真君礼愿文.json",
  "total_chunks": 13,
  "total_original_chars": 14644,
  "total_translated_chars": 96356,
  "total_translation_time": 429.59987235069275,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君礼愿文.txt",
    "category": "威仪类"
  },
  "full_translation": "**Rite and Vows to the Venerable Lord of Vast Grace and Numinous Aid**\n\n**Title:** *Rite and Vows to the Venerable Lord of Vast Grace and Numinous Aid*\n**Author:** Unknown\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongxuan* Section, *Weiyi* (Ritual Propriety) Category\n\n---\n\n**Preface to the Vows to the Venerable Lord of Vast Grace and Numinous Aid**\n\nVows are the aspirations of the perfected, and also the aspirations of all people. Each kneel and bow is the focus of the heart; the focus of the heart is the utmost of goodness. The goodness of human nature is like water flowing downward. If one does not correct what is not good, this is my sorrow. These vows are thus established for those who would be good—how could they be mere words of aspiration?\n\nGazing upward at heaven, one obtains the number twenty-five. Looking downward to earth, one obtains the number thirty. Combined, they yield fifty-five. It is by this number that the vow is fulfilled, for without sharing in the work of heaven and earth, how could this be achieved? The good person is the guiding principle of heaven and earth. If there is even a trace of deceit, arrogance, or negligence, this is not what I call a vow. How could such a one be spoken of in the same breath as the good?\n\nThe *Tradition* says: \"Goodness has no constant master; it harmonizes with those who achieve unity.\" There is no other reason for this—beginning with it, ending with it, never halting halfway, this is to be perfectly good and perfectly beautiful.\n\nGoodness is the foundation of fortune; fortune is the accumulation of goodness. Gao Ying of the Tang said: \"Accumulate goodness to attain fortune; do not expend wealth to seek fortune.\" Since fortune can be sought without expending wealth, can those who do good be said to expend wealth? Seeing goodness, one should point it out; hearing goodness, one should proclaim it. All who share this aspiration should thus encourage one another, that we may be without shame before heaven and earth, and also without shame before the Venerable Lord. This, too, is the great vow of the Venerable Lord.\n\n---\n\n**Rite and Vows to the Venerable Lord of Vast Grace and Numinous Aid**\n\nToday, with reverence, we burn precious incense and offer sincere devotion to:\nThe Great Immortal of the Nine Heavens’ Golden Gate, who illuminates the Dao and manifests virtue, whose numinous power is vast and whose aid is universal, who dwells in the pure and mysterious, the empty and subtle, whose compassion and kindness protect the state and shelter the people—the Venerable Lord of Vast Grace;\nThe Supreme Immortal of the Nine Heavens’ Jade Gate, who proclaims transformation and upholds the teaching, whose numinous radiance is far-reaching and whose aid is abundant, who is lofty and serene, empty and profound, whose wondrous responses are benevolent, who assists the state and protects the people—the Venerable Lord of Vast Grace;\nAnd all the divine officials and immortals of the Palace of Numinous Aid, to whom we offer our common devotion.\n\nWe have heard that the manifest virtue of the spirits is called uprightness and wisdom. The common desire of people is for peace and ease, for wealth and honor. If sacrifices must bring blessings, then the rites must not be too simple. For over four hundred years, the temple offerings have flourished; the incense fire burns as brightly as ever. The stele inscriptions number a thousand characters, and their compositions may still be heard. Their illustrious and imperishable names, their awe-inspiring and lifelike righteousness—these have preserved the altars of the state and bestowed virtue upon the living.\n\nThe farmer labors in the fields, and there is celebration of millet, rice, and grain. The artisan refines his craft, meeting the standards of plumb line, compass, and square. The scholar establishes himself through loyalty and filial piety; the merchant profits through benevolence and righteousness. Those who seek marriage find harmony in family and home; those who pray for descendants beget sons and grandsons. Wind and rain nourish the people, fulfilling the wishes of all life. Clothing and food sustain us, granting the kindness of warmth and fullness. Bestowed upon the myriad things, all is fitting; arranged through the four seasons, all is in order.\n\nGazing up to them is like beholding Mount Tai or the Northern Dipper—their radiance is vast. They do not abandon us in the distance; when they manifest, it is as light, as stars and clouds contending in splendor, a joy to behold first. They are fitting recipients of great rites, that their numinous power may be proclaimed.\n\nIn the past, they received the honor of imperial bestowal; today, they bear the favor of heaven’s grace. Their rank has ascended to the Golden and Jade Gates; their names have advanced to the Great and Supreme Immortals. Their honorific titles are exalted, their majesty resplendent; their sacrifices endure for a hundred generations, their example rectifies the myriad spirits. They walk with the great creators, ever ancient yet never aging.\n\nI, so-and-so, though my heart yearns for the Dao, my talent does not compare to others. I humbly extend my private gratitude and offer a small token of respect. Having prepared this solemn Dharma assembly, I presumptuously invoke the true wisdom of the Venerable Lord.\n\nI pray that the jade phoenix may sing *jiujiu*, that the eight dragons may coil and glide, that clouds and rainbows may lead the way, that the gates may open at the sound of your approach. First, let Fenglong advance as your vanguard; then, let Feilian hasten as your retinue. Bestow your beauty with ease, repay with serene longevity. Offer cassia wine and peppered libations, orchid mats and magnolia feasts. Roam freely and linger, look back with care and affection.\n\nMy humble devotion is boundless; I await your presence with reverence.\n\nThere is the Venerable Lord’s original vow and divine incantation, which I shall now recite with care:\n\n*Venerable Lord, Venerable Lord, Great Spirit of the Northern Dipper.*\n*Heaven and earth praise your transformation; sun and moon shine together.*\n*Below, you govern Fengdu; above, you attend the imperial court.*\n*Upholding the true Dharma, you slay and vanquish evil spirits.*\n*Your numinous title, Lingji, brings fortune to the myriad people.*\n*Those who seek are answered, as echo follows sound.*\n*Those who feel are moved, as shadow follows form.*\n*Those who oppose me perish; those who follow me live.*\n*Om, Radiant Numinous One, Radiant Numinous One, universally aid the living.*\n*Qianyuan,亨利贞, swiftly, swiftly, as the law commands.*\n*Venerable Lord of Numinous Aid, descend swiftly.*\n\nThe virtue of cherishing life pervades the hearts of the people. Preserve my two *qi*: the fiery *yang* and the watery *yin*. Dissolve disasters, cross over calamities, bring fortune to the good and misfortune to the licentious.\n*Swiftly, swiftly, as the law commands.*\n\n*Venerable Lord, Venerable Lord, born of the Northern Dipper.*\n*Acting on heaven’s behalf, you transform; assisting the state, you save the people.*\n*Transmitting the true Dharma, you slay and vanquish evil spirits.*\n*Demon kings guard you; true qi abides forever.*\n*Swiftly, swiftly, as the law commands.*\n\nThe divine incantations have now been fully proclaimed. We respectfully invite:\nThe Sacred Father, the Loyal and Martial True Lord of Aid and Brightness, Prince Qi;\nThe Sacred Mother, the Benevolent and Longevous, Kind and Virtuous Immortal Consort;\nThe Two Venerable Lords of Numinous Aid, the Two Immortal Consorts;\nTheir divine processions to descend and join the assembly of the perfected, to array themselves in ranks and pay homage.\n\nHaving completed the homage, each ascends to their Dharma throne. With reverence, we set out the offerings and burn incense.\n\n*Ode to the Incense*\n\nWe humbly submit that bright virtue, when offered, surpasses the fragrance of millet and grain; those who cultivate goodness share their scent with orchids and angelicas. This incense—jade censers present auspicious omens, golden tripods manifest felicity. Dense and abundant, it coalesces into clouds of mist and vapor; warm and radiant, it steeps the cosmos in spring. When held aloft, messengers stand before us; when attended, youths stand behind. In rites with libations, we bow in reverence and make offerings. In rites without, the first cup of wine is presented, this incense accompanying the chalice—let the Dharma assembly focus their minds and make offerings with devotion.\n\n*Incense Verse*\nIn the heavens, clouds sow their seeds;\nA mighty wind scatters them across the four seas.\nDeep within the dragon palace’s secrets,\nSea spirits offer them to the immortals.\nNow, fervently kindled with sincerity,\nIts mist ascends to the Purple Palace.\nPenetrating the boundless void,\nAll prayers are fulfilled as wished.\n\n*Response:* Together, we make offerings with one heart.\n\n*Scattering flowers.*\nFrom the censer’s depths, smoke arises.\n*Scattering flowers through the forest.*\nThe incense of the effortless Dao and virtue.\n*Scattering flowers to fill the Dharma realm.*\nOfferings before the True Lords.\n\n*Ode to the Water*\n\nWe humbly submit: though turbid waters may be offered to lords and nobles, only loyalty and sincerity form their true essence. The source-water flows ceaselessly day and night, yet we blush at the excess of our own reputation. This water—neither muddied nor dim—remains ever clear, ever pure. In heaven it becomes rain and dew, caught upon bronze pillars and golden stalks; on earth it turns to sweet springs, savored like jade nectar. The wise act without pretense, and the highest good, like water, contends with none.\n\nIts current never fails to flow east, yet its source lies in the north.\n\n*With ritual present:* We bow our heads in reverent offering.\n*Without ritual:* The second cup of wine is presented, this incense accompanying the chalice—let the Dharma assembly focus their minds and make offerings with devotion.\n\n*Ode to the Water*\nIn heaven the Silver River overflows,\nits limpid depths reflecting the ten directions.\nTransformed into rain and dew it descends,\nbestowing grace across heaven and earth.\nMoistening what is withered, nourishing all life,\nits bounty revives the parched and sustains the myriad beings.\nPouring forth, it expresses our deepest sorrow—\nbody and mind wholly purified.\n\n*Response:* Together, we make offerings with one heart.\n\n*Scattering flowers.*\nThe source flows not from earthly veins.\n*Scattering flowers through the forest.*\nIt waters all from the celestial river.\n*Scattering flowers to fill the Dharma realm.*\nOfferings before the True Lords.\n\n*Ode to the Flowers*\nWe humbly submit: layered emerald leaves cast their shade upon the limpid isles; jade blossoms flourish, giving rise to spirit in the courts of abundance. These flowers—fragrant in their very essence, their hues unbound by fixed form. The red lotus of the pool may suddenly turn jade-green; the white peony can be dyed golden. In the Palace of Broad Cold, a single cassia branch trails its shadow beneath the autumn moon; within the Wu-ling grotto, a thousand peach trees smile in the breath of spring. Though we long to pour forth the devotion of sunflowers, we offer but the modest tribute of repeated veneration.\n\n*With ritual present:* We bow our heads in reverent offering.\n*Without ritual:* The final cup of wine is presented, this incense accompanying the chalice—let the Dharma assembly focus their minds and make offerings with devotion.\n\n*Ode to the Flowers*\nRare blossoms of the Dark Garden flourish,\ntheir roots spreading through the ten directions.\nStanding tall for eight hundred years,\ntheir fragrance lingers in the dusty world.\nResplendent in the realm of radiant light,\na cascade of jeweled petals rains down.\nGathering the purest essence,\nwe now rise to make our offering.\n\n*Response:* Together, we make offerings with one heart.\n\n*Scattering flowers.*\nTen thousand flowers arise in offering.\n*Scattering flowers through the forest.*\nDancing, they descend from heaven.\n*Scattering flowers to fill the Dharma realm.*\nOfferings before the True Lords.\n\nWe humbly submit: in roaming the spirit through the Dao, one sees without seeing, hears without hearing. Abiding in the Dao with spirit, one gazes ahead—suddenly behind. Concealment has no end, and names are not forced upon it. Since the dawn of the Red Clarity, when celestial scriptures first descended, and the Heavenly Perfected took up their brushes, human culture began to flourish. The Emperor Shun received it before the Terrace of Pastoral Virtue; the Yellow Emperor transmitted it upon Mount Emei. Some obtained it at Gourd Valley, fulfilling the wish of King Helü; others descended upon Bell Mountain, completing the work of Yu the Great. Through the transmission of these scriptures and teachings, we sentient beings awaken to understanding.\n\nThus, we reverently invoke:\nThe Nine Heavens’ Golden Portal, Illuminating Dao and Manifesting Virtue, Great Immortal of Resplendent Efficacy, Vast Salvation, Pure and Subtle, Cavernous and Mysterious, Marvelously Responsive, Compassionate and Benevolent, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord;\nThe Nine Heavens’ Jade Portal, Proclaiming Transformation and Upholding the Teachings, Supreme Immortal of Radiant Efficacy, Vast Salvation, Lofty and Serene, Profound and Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nAssisting the Dipper Perfected in the northern pole, inwardly participating in the mysteries of Eastern Florescence. Through a hundred million kalpas, kalpa after kalpa of cultivation; fifty-five vows, vow after vow fulfilled. Refining gold into phoenix-script, kneading jade into dragon-chapters. May all sentient beings together attain the supreme Dao.\n\nThe assembly of this Daoist sanctuary bows in reverence, pledging devotion and singing praises.\n\n*In unison, we chant the True Lords’ Original Vows:*\nAscending the imperial throne, advancing upon the celestial steps.\nRadiance companion to sun and moon, duties spanning the Three Terraces.\nConstellations arrayed in guard, the Silver River shines in revolution.\nThe Dragon’s Horn in the east claims the Dipper’s head;\nthe Canopy and Chamber Steeds serve as strict attendants.\nFeathered Forest generals escort left and right;\nocarinas and flutes play in turn, harmonizing with pitch-pipes.\nReturning in glory to the celestial palace,\na journey of ten thousand leagues through the clouds.\n\nLet all in this sanctuary rise, each offering reverent praise according to ritual.\n\nWith devoted hearts we bow and take refuge, proclaiming:\nVirtue matching heaven and earth, merit equaling sun and moon,\nmysterious efficacy of spiritual power, upright and enlightened.\nGreat compassion, great mercy, great sanctity, great vows—\nresponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Golden Portal, Illuminating Dao and Manifesting Virtue, Great Immortal of Resplendent Efficacy, Vast Salvation, Pure and Subtle, Cavernous and Mysterious, Marvelously Responsive, Compassionate and Benevolent, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith devoted hearts we bow and take refuge, proclaiming:\nMight shaking thunder, grace descending like rain and dew,\nspiritual power at ease, boundless blessings.\nGreat compassion, great mercy, great sanctity, great vows—\nresponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Jade Portal, Proclaiming Transformation and Upholding the Teachings, Supreme Immortal of Radiant Efficacy, Vast Salvation, Lofty and Serene, Profound and Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nThe Dao, majestic and beyond naming,\nthe flourishing qi of the Nine Heavens belongs to the True Lords.\nFrom ancient times to the present, without end,\na hundred thousand transformations, wondrously divine.\n\n*Response:* Now we sing of their sacred virtues with reverence,\nmay their awe-inspiring radiance witness our sincerity.\nMay all sentient beings together take refuge in the supreme Dao.\n\nWith devoted hearts we bow and take refuge, proclaiming:\nVirtue matching heaven and earth, merit equaling sun and moon,\nmysterious efficacy of spiritual power, upright and enlightened.\nGreat compassion, great mercy, great sanctity, great vows—\nresponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Golden Portal, Illuminating Dao and Manifesting Virtue, Great Immortal of Resplendent Efficacy, Vast Salvation, Pure and Subtle, Cavernous and Mysterious, Marvelously Responsive, Compassionate and Benevolent, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith devoted hearts we bow and take refuge, proclaiming:\nMight shaking thunder, grace descending like rain and dew,\nspiritual power at ease, boundless blessings.\nGreat compassion, great mercy, great sanctity, great vows—\nresponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Jade Portal, Proclaiming Transformation and Upholding the Teachings, Supreme Immortal of Radiant Efficacy, Vast Salvation, Lofty and Serene, Profound and Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nOur primal ancestor laid the nation’s foundation in Xu,\nWith crimson bow and vermilion arrows descending auspicious signs.\nHis descendants flourished, branches vast and grand,\nHeroes and luminaries recorded in history’s annals.\n\n*Refrain:*\nNow with reverence we praise your sacred virtue,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nTake refuge in the supreme Dao.\n\nWith devoted hearts we bow and take refuge, proclaiming:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nMarvelously Responsive, Upright and Wise,\nGreat compassion, great mercy, great sanctity, great vows—\nresponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Jade Portal, Proclaiming Transformation and Upholding the Teachings, Supreme Immortal of Radiant Efficacy, Vast Salvation, Pure and Subtle, Cavernous and Mysterious, Profound and Tranquil, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith devoted hearts we bow and take refuge, proclaiming:\nMight shaking thunder, grace descending like rain and dew,\nspiritual power at ease, boundless blessings,\nGreat compassion, great mercy, great sanctity, great vows—\nresponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Jade Portal, Proclaiming Transformation and Upholding the Teachings, Supreme Immortal of Radiant Efficacy, Vast Salvation, Lofty and Serene, Profound and Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nAmid the tumult of Five Dynasties’ rival hegemonies,\nHe alone rose in Huainan to establish great merit.\nHis loyal and martial renown inscribed on bamboo and silk,\nFor a thousand years the state of Qi bore his royal legacy.\n\n*Refrain:*\nNow with reverence we praise your sacred virtue,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nTake refuge in the supreme Dao.\n\nWith devoted hearts we bow and take refuge, proclaiming:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nMarvelously Responsive, Upright and Wise,\nGreat compassion, great mercy, great sanctity, great vows—\nresponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Jade Portal, Proclaiming Transformation and Upholding the Teachings, Supreme Immortal of Radiant Efficacy, Vast Salvation, Pure and Subtle, Cavernous and Mysterious, Profound and Tranquil, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith devoted hearts we bow and take refuge, proclaiming:\nMight shaking thunder, grace descending like rain and dew,\nspiritual power at ease, boundless blessings,\nGreat compassion, great mercy, great sanctity, great vows—\nresponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Jade Portal, Proclaiming Transformation and Upholding the Teachings, Supreme Immortal of Radiant Efficacy, Vast Salvation, Lofty and Serene, Profound and Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nWith righteous armies he descended upon the Seven Min,\nThe Seven Min submitted without battle.\nOfficials and people remained undisturbed in their places,\nBaskets of food and cups of drink joyfully offered in welcome.\n\n*Refrain:*\nNow with reverence we praise your sacred virtue,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nTake refuge in the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Golden Portal, Illuminating the Dao and Manifesting Virtue, Supreme Immortal of Radiant Efficacy, Vast Salvation, Pure and Subtle, Penetrating Mystery, Profound and Void, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine freedom in transformations, boundless blessings and virtue—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Jade Portal, Proclaiming Transformation and Upholding the Teachings, Supreme Immortal of Radiant Efficacy, Vast Salvation, Lofty and Serene, Profound and Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nGrand ceremonies as before, joyously welcomed in the east,\nHow dare the people of this land stir up strife?\nBorn and raised in Ao Peak’s true blessed land,\nSuddenly even chickens and dogs hear the divine voice again.\n\n*Refrain:*\nNow with reverence we praise your sacred virtue,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nTake refuge in the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Golden Portal, Illuminating the Dao and Manifesting Virtue, Supreme Immortal of Radiant Efficacy, Vast Salvation, Pure and Subtle, Penetrating Mystery, Profound and Void, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine freedom in transformations, boundless blessings and virtue—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Jade Portal, Proclaiming Transformation and Upholding the Teachings, Supreme Immortal of Radiant Efficacy, Vast Salvation, Lofty and Serene, Profound and Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nClearing brambles and felling trees to build the temple hall,\nMorning and night incense rises in prayers for longevity.\nWith imperial favor the temple receives offerings, fulfilling the people’s vows,\nThe august spirit’s radiance shines forth, descending in majestic splendor.\n\n*Refrain:*\nNow with reverence we praise your sacred virtue,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nTake refuge in the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Golden Portal, Illuminating the Dao and Manifesting Virtue, Supreme Immortal of Radiant Efficacy, Vast Salvation, Pure and Subtle, Penetrating Mystery, Profound and Void, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine freedom in transformations, boundless blessings and virtue—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Jade Portal, Proclaiming Transformation and Upholding the Teachings, Supreme Immortal of Radiant Efficacy, Vast Salvation, Lofty and Serene, Profound and Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nClaiming Ao Peak as a grotto-heaven,\nThe scenery before the temple remains unchanged:\nVines and creepers intertwine in emerald beyond the clouds,\nWhile dragon pools and waterfalls cascade in splendor.\n\n*Refrain:*\nNow with reverence we praise your sacred virtue,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nTake refuge in the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Golden Portal, Illuminating the Dao and Manifesting Virtue, Supreme Immortal of Radiant Efficacy, Vast Salvation, Pure and Subtle, Penetrating Mystery, Profound and Void, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine freedom in transformations, boundless blessings and virtue—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Jade Portal, Proclaiming Transformation and Upholding the Teachings, Supreme Immortal of Radiant Efficacy, Vast Salvation, Lofty and Serene, Profound and Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nFive-colored clouds part to reveal purple banners,\nThe wooden incense burner remains unscathed—what wondrous portent!\nTwo dragons descend from heaven to guard it,\nTruly a divine treasure with proof of its power.\n\n*Refrain:*\nNow with reverence we praise your sacred virtue,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nTake refuge in the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Golden Portal, Illuminating the Dao and Manifesting Virtue, Supreme Immortal of Radiant Efficacy, Vast Salvation, Pure and Subtle, Penetrating Mystery, Profound and Void, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine freedom in transformations, boundless blessings and virtue—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Jade Portal, Proclaiming Transformation and Upholding the Teachings, Supreme Immortal of Radiant Efficacy, Vast Salvation, Lofty and Serene, Profound and Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nOne morning, thunder and rain summoned twin dragons,\nThey ascended the stream straight to the islet’s heart.\nTransforming into a wooden incense burner, they displayed a sacred sign,\nAnd so the villagers built a temple in gratitude.\n\n*Refrain:*\nNow with reverence we praise your sacred virtue,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nTake refuge in the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Golden Portal, Illuminating the Dao and Manifesting Virtue, Supreme Immortal of Radiant Efficacy, Vast Salvation, Pure and Subtle, Penetrating Mystery, Profound and Void, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine freedom in transformations, boundless blessings and virtue—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.\n\nSupreme Immortal of the Jade Portal of the Nine Heavens, Proclaiming Transformations and Upholding the Dao, Illuminating the Spirit, Vastly Salvific, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nOf old, customs were simple and pure,\nAn age called harmonious, a world at peace.\nWhether rain or sunshine, ever responsive,\nWe beg to inscribe these two words upon your august title.\n\n*Response:*\nNow with reverence we praise your sagely virtue,\nMay your divine radiance witness this sincerity.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Golden Portal, Illuminating the Dao and Manifesting Virtue, Supreme Immortal of Radiant Efficacy, Vast Salvation, Pure and Subtle, Penetrating Mystery, Profound and Void, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine freedom in transformations, boundless blessings and virtue—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nSupreme Immortal of the Jade Portal of the Nine Heavens, Proclaiming Transformations and Upholding the Dao, Illuminating the Spirit, Vastly Salvific, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nIn days past, the temple was moved by Yan Brook,\nBeside the brook, a stretch of low hills.\nAs mulberry fields turned to seas through the ages,\nThe elders still call it the Earth Altar.\n\n*Response:*\nNow with reverence we praise your sagely virtue,\nMay your divine radiance witness this sincerity.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Golden Portal, Illuminating the Dao and Manifesting Virtue, Supreme Immortal of Radiant Efficacy, Vast Salvation, Pure and Subtle, Penetrating Mystery, Profound and Void, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine freedom in transformations, boundless blessings and virtue—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nSupreme Immortal of the Jade Portal of the Nine Heavens, Proclaiming Transformations and Upholding the Dao, Illuminating the Spirit, Vastly Salvific, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nThe temple of Zhenghe stands grand in scale,\nIts dragon-headed eaves soaring, its gates numerous.\nBeyond the eaves, the wind through the pines sounds crisp,\nBefore the hall, the osmanthus moon casts swaying shadows.\n\n*Response:*\nNow with reverence we praise your sagely virtue,\nMay your divine radiance witness this sincerity.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Golden Portal, Illuminating the Dao and Manifesting Virtue, Supreme Immortal of Radiant Efficacy, Vast Salvation, Pure and Subtle, Penetrating Mystery, Profound and Void, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine freedom in transformations, boundless blessings and virtue—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nSupreme Immortal of the Jade Portal of the Nine Heavens, Proclaiming Transformations and Upholding the Dao, Illuminating the Spirit, Vastly Salvific, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nNo scent, no sound—yet affairs transcend the unseen,\nThe virtue of perfect harmony moves the divine.\nRadiant lights appear at night, auspicious as star-lamps,\nNinefold music is heard at times, celestial melodies.\n\n*Response:*\nNow with reverence we praise your sagely virtue,\nMay your divine radiance witness this sincerity.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Golden Portal, Illuminating the Dao and Manifesting Virtue, Supreme Immortal of Radiant Efficacy, Vast Salvation, Pure and Subtle, Penetrating Mystery, Profound and Void, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine freedom in transformations, boundless blessings and virtue—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nSupreme Immortal of the Jade Portal of the Nine Heavens, Proclaiming Transformations and Upholding the Dao, Illuminating the Spirit, Vastly Salvific, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nThe banner-dragon’s manifestation gave the place its name,\nIn the royal palace for rain-prayers, a temple was built anew.\nThe events are recorded in stele inscriptions, recited by all,\nAutumn and winter mark the seasons of thanksgiving rites.\n\n*Response:*\nNow with reverence we praise your sagely deeds,\nMay your divine radiance witness this sincerity.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and wise—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Golden Portal, Illuminating the Dao and Manifesting Virtue, Supreme Immortal of Radiant Efficacy, Vast Salvation, Pure and Subtle, Penetrating Mystery, Profound and Void, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine freedom in transformations, boundless blessings and virtue—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nSupreme Immortal of the Jade Portal of the Nine Heavens, Proclaiming Transformations and Upholding the Dao, Illuminating the Spirit, Vastly Salvific, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nTemples stand in every direction, their branches countless through the ages.\nMerit and virtue shine bright as sun and moon,\nAs attested by the elders, their words like living steles.\n\n*Response:*\nNow with reverence we praise your sagely virtue,\nMay your divine radiance witness this sincerity.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.\n\nCelestial Golden Palaces’ Illuminator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.\n\nCelestial Jade Palaces’ Propagator of Transformation, Upholder of the Teachings, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nTemples have received offerings for four hundred years,\nWith orchid meats and cassia wine, rites performed with utmost devotion.\nAuspicious rain sacrifices match the omens as if by contract,\nVirtue resides in human hearts, moving both Heaven and Earth.\n\n*Response:*\nNow with reverence we praise your sagely virtue,\nMay your divine radiance witness this sincerity.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened,\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.\n\nCelestial Golden Palaces’ Illuminator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.\n\nCelestial Jade Palaces’ Propagator of Transformation, Upholder of the Teachings, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nOnce on Mount Gong, even grasses and trees bore numinous signs,\nThe imperial decree of Jiaxi bestowed new honors.\nThe title \"Lingji\" was conferred in golden script,\nThe temple’s grandeur has crowned the seven Min lands for a thousand years.\n\n*Response:*\nNow with reverence we praise your sagely virtue,\nMay your divine radiance witness this sincerity.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened,\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.\n\nCelestial Golden Palaces’ Illuminator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.\n\nCelestial Jade Palaces’ Propagator of Transformation, Upholder of the Teachings, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nTowering stone pagodas reach the clouds,\nWhen deeds are complete and merit fulfilled, old affinities are entrusted.\nMay the Dharma-body remain eternally undiminished,\nIts radiance universally illuminating the three thousand worlds.\n\n*Response:*\nNow with reverence we praise your sagely virtue,\nMay your divine radiance witness this sincerity.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened,\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.\n\nCelestial Golden Palaces’ Illuminator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.\n\nCelestial Jade Palaces’ Propagator of Transformation, Upholder of the Teachings, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nThe Chan master Dingying was the Primordial Buddha,\nI once attained this meditation.\nFreely entering the realm of suchness,\nA single point of the numinous mind becomes suddenly clear.\n\n*Response:*\nNow with reverence we praise your sagely virtue,\nMay your divine radiance witness this sincerity.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened,\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.\n\nCelestial Golden Palaces’ Illuminator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.\n\nCelestial Jade Palaces’ Propagator of Transformation, Upholder of the Teachings, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nIn the Jiading era, plague insects filled the fields,\nPeople came to the temple to pray and offer thanks, and the pests moved south.\nThat year, a dream omen of fish appeared,\nMillet and grain filled the granaries for ten thousand years.\n\n*Response:*\nNow with reverence we praise your sagely virtue,\nMay your divine radiance witness this sincerity.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened,\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.\n\nCelestial Golden Palaces’ Illuminator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.\n\nCelestial Jade Palaces’ Propagator of Transformation, Upholder of the Teachings, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nAmidst the night, a salt-laden vessel met fierce winds,\nIts mooring snapped, adrift—east or west, none knew.\nYet a single heart’s incense rose, the spirit near,\nAnd lo! The ship glided forth, the waterway made clear.\n\n*Response:*\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching heaven and earth, merit rivaling sun and moon,\nDivine transformations wondrously wrought, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nInitiator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palaces’ Propagator of Transformation, Upholder of the Teachings, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nFoolish and ignorant, the benighted folk,\nWhy bend the chimney yet leave the firewood in place?\nSuddenly, a banner of salvation flashes bright,\nAnd the wind reverses—dark aid through divine might.\n\n*Response:*\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching heaven and earth, merit rivaling sun and moon,\nDivine transformations wondrously wrought, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nInitiator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palaces’ Propagator of Transformation, Upholder of the Teachings, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nOnce in Baoqing, drought scorched the land like fire,\nJade tablets and sincerity reached the divine ear.\nUpon the altar, a red serpent’s form took shape,\nWith a single drum’s thunder, rain poured in torrents.\n\n*Response:*\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching heaven and earth, merit rivaling sun and moon,\nDivine transformations wondrously wrought, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nInitiator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palaces’ Propagator of Transformation, Upholder of the Teachings, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nA boat of Qiangxia struck the rocky shoals,\nMidstream, the oars lost—hearts turned cold with dread.\nYet at the urgent cry of the divine name, a yellow banner appeared,\nAnd rescue came in an instant, the call heard.\n\n*Response:*\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching heaven and earth, merit rivaling sun and moon,\nDivine transformations wondrously wrought, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nInitiator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palaces’ Propagator of Transformation, Upholder of the Teachings, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nIn Shaoding, the Yanxi’s torrents raged,\nFields drowned in sorrow, the land submerged in woe.\nThen came the news—divine soldiers cleared the channel,\nAnd joy returned as harvests thrived thrice over.\n\n*Response:*\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching heaven and earth, merit rivaling sun and moon,\nDivine transformations wondrously wrought, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nInitiator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palaces’ Propagator of Transformation, Upholder of the Teachings, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nIn the age of Chunxi, customs were pure and fine,\nYet why did a comet appear from the western sky?\nDisasters averted, calamities dissolved—through divine power,\nWhy seek omens from astrologers when gods bring harmony?\n\n*Response:*\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching heaven and earth, merit rivaling sun and moon,\nDivine transformations wondrously wrought, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nInitiator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palace Proclaiming Transformation and Upholding the Teachings, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Lofty and Serene, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nSince ancient times, literature could establish one’s standing,\nIn Shaoxing, omens revealed the numinous.\nTwo prefects’ glory shone in mutual reflection,\nOne examination roster now celebrates the worthy.\n\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching heaven and earth, merit rivaling sun and moon,\nDivine transformations wondrously wrought, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nInitiator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palace Proclaiming Transformation and Upholding the Teachings, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Lofty and Serene, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nIn crimson robes, dreams foretold two scholars’ rise,\nTheir fame in Jiading followed Shaoxing’s glory.\nSixty years a cycle, heaven’s reckoning proved true,\nThe lineage of Shusun’s mantle passed through generations.\n\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching heaven and earth, merit rivaling sun and moon,\nDivine transformations wondrously wrought, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nInitiator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palace Proclaiming Transformation and Upholding the Teachings, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Lofty and Serene, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nA man’s noble ambition aspires to merit and fame,\nHow much more when an official ranks among the stars.\nDreams arose from the cliffs, foretelling great service,\nHere in this ancestral temple, the numinous power shines.\n\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching heaven and earth, merit rivaling sun and moon,\nDivine transformations wondrously wrought, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nInitiator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palace Proclaiming Transformation and Upholding the Teachings, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Lofty and Serene, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nBy the Bi River, the gentry flourished,\nTwo families’ sons brought joy as worthy men.\nIn Jiaxi, the imperial examinations revealed heaven’s craft,\nAuspicious dreams foretold a poet’s rise.\n\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching heaven and earth, merit rivaling sun and moon,\nDivine transformations wondrously wrought, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nInitiator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palace Proclaiming Transformation and Upholding the Teachings, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Lofty and Serene, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nIn Xianchun, the imperial edict ordered local examinations,\nThe gods themselves preside over scholarly success.\nTwo moons in mid-month bore auspicious omens,\nHeaven’s secrets revealed in the brush’s springtime flourish.\n\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching heaven and earth, merit rivaling sun and moon,\nDivine transformations wondrously wrought, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nInitiator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palace Proclaiming Transformation and Upholding the Teachings, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Lofty and Serene, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nGenerous in giving, careless of wealth, he was called the elder,\nVain to say hidden virtue goes unrewarded.\nThe ancestral hall’s name and lineage endure through ages,\nSix generations passed the examinations, five attained high rank.\n\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\n\nMay all sentient beings together return to the supreme Dao/Way.\nWith devoted heart we bow and take refuge,\nWhose virtue matches heaven and earth, whose merit rivals sun and moon,\nWhose numinous power works wondrous transformations, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Golden Palace Illuminating the Dao/Way and Attaining Virtue, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Pure and Subtle, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith devoted heart we bow and take refuge,\nWhose might shakes thunder, whose grace descends as rain and dew,\nWhose numinous power is unhindered, whose blessings and virtue are boundless,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palace Proclaiming Transformation and Upholding the Teachings, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Lofty and Serene, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nExemplary conduct endures like the House of Dou in Yanshan,\nFive branches of cinnamon bloom in fragrant succession.\nHeirs arise in families that accumulate goodness,\nAuspicious dreams foretell the birth of noble sons.\n\n*Refrain:*\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together return to the supreme Dao/Way.\n\nWith devoted heart we bow and take refuge,\nWhose virtue matches heaven and earth, whose merit rivals sun and moon,\nWhose numinous power works wondrous transformations, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Golden Palace Illuminating the Dao/Way and Attaining Virtue, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Pure and Subtle, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith devoted heart we bow and take refuge,\nWhose might shakes thunder, whose grace descends as rain and dew,\nWhose numinous power is unhindered, whose blessings and virtue are boundless,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palace Proclaiming Transformation and Upholding the Teachings, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Lofty and Serene, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nGreen cloth woven into gauze shimmers with kingfisher hues,\nRed dust transformed into brocade glows with added splendor.\nSince ancient times, prophetic omens have heralded auspicious signs,\nMay the divine spirit’s blessings overflow to ten thousand households.\n\n*Refrain:*\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together return to the supreme Dao/Way.\n\nWith devoted heart we bow and take refuge,\nWhose virtue matches heaven and earth, whose merit rivals sun and moon,\nWhose numinous power works wondrous transformations, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Golden Palace Illuminating the Dao/Way and Attaining Virtue, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Pure and Subtle, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith devoted heart we bow and take refuge,\nWhose might shakes thunder, whose grace descends as rain and dew,\nWhose numinous power is unhindered, whose blessings and virtue are boundless,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palace Proclaiming Transformation and Upholding the Teachings, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Lofty and Serene, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nThe Dao/Way’s origin is vast and boundless, descending from heaven,\nThe River Chart and Luo Writ have been transmitted through the ages.\nHeaven favors this culture, which shall not perish,\nAll proclaim the Numinous Treasure as the Literary Immortal.\n\n*Refrain:*\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this remembrance.\nMay all sentient beings together return to the supreme Dao/Way.\n\nWith devoted heart we bow and take refuge,\nWhose virtue matches heaven and earth, whose merit rivals sun and moon,\nWhose numinous power works wondrous transformations, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Golden Palace Illuminating the Dao/Way and Attaining Virtue, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Pure and Subtle, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith devoted heart we bow and take refuge,\nWhose might shakes thunder, whose grace descends as rain and dew,\nWhose numinous power is unhindered, whose layered virtue is boundless,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palace Proclaiming Transformation and Upholding the Teachings, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Lofty and Serene, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nSerene and empty within, the spirit naturally abides,\nAccumulating merit and cultivating conduct perfects the true.\nThe *Huangting* silently imparts the secret of longevity,\nFreely I ascend, riding the jade wheel.\n\n*Refrain:*\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together return to the supreme Dao/Way.\n\nWith devoted heart we bow and take refuge,\nWhose virtue matches heaven and earth, whose merit rivals sun and moon,\nWhose numinous power works wondrous transformations, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Golden Palace Illuminating the Dao/Way and Attaining Virtue, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Pure and Subtle, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith devoted heart we bow and take refuge,\nWhose might shakes thunder, whose grace descends as rain and dew,\nWhose numinous power is unhindered, whose blessings and virtue are boundless,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palace Proclaiming Transformation and Upholding the Teachings, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Lofty and Serene, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nHis name inscribed in the Golden Palace shines resplendent,\nHis learning received from the Eastern Flower Patriarch Zhengyang.\nHe oversees celestial patterns as Director of the Celestial Bureau,\nHis office dispenses emoluments, assisting Wenchang.\n\n*Refrain:*\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together return to the supreme Dao/Way.\n\nWith devoted heart we bow and take refuge,\nWhose virtue matches heaven and earth, whose merit rivals sun and moon,\nWhose numinous power works wondrous transformations, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Golden Palace Illuminating the Dao/Way and Attaining Virtue, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Pure and Subtle, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith devoted heart we bow and take refuge,\nWhose might shakes thunder, whose grace descends as rain and dew,\nWhose numinous power is unhindered, whose blessings and virtue are boundless,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.\n\nCelestial Jade Palace Proclaiming Transformation and Upholding the Teachings, Supreme Immortal Manifesting Numinous Power, Vastly Beneficent, Lofty and Serene, Profoundly Void, Subtly Responsive, Benevolent and Kind, Assisting the Nation and Protecting the People, Greatly Merciful True Lord.\n\nSilently contemplating the mysterious learning of the Eastern Flowery Realm,\nIn the Jade Palace’s court ranks, bowing to the Purple Tenuity.\nSouthern Culmen governs life, holding the highest office,\nWith duties spanning the earthly realm and leading all bureaus.\n\n*Response:*\nNow with reverent heart we extol your sacred virtue,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together take refuge in the supreme Dao/Way.\n\nWith devoted heart we bow and take refuge,\nWhose virtue/power matches heaven and earth, whose merit parallels sun and moon,\nWhose numinous power works wondrous transformations, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Golden Palace Illuminating the Dao/Way and Attaining Virtue, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Pure and Subtle, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith devoted heart we bow and take refuge,\nWhose might shakes thunder, whose grace descends as rain and dew,\nWhose numinous power is unhindered, whose blessings and virtue are boundless,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palace Proclaiming Transformation and Upholding the Teachings, Supreme Immortal Manifesting Numinous Power, Vastly Beneficent, Lofty and Serene, Profoundly Void, Subtly Responsive, Benevolent and Kind, Assisting the Nation and Protecting the People, Greatly Merciful True Lord.\n\nIn the ninth month, when the Season of Longevity arrives,\nClouds part to reveal the Golden Palace ascending to the azure heavens.\nNow in the Hall of Longevity, I bow like a tiger,\nTogether we pray for Yao’s reign to endure a million years.\n\n*Response:*\nNow with reverent heart we extol your sacred virtue,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together take refuge in the supreme Dao/Way.\n\nWith devoted heart we bow and take refuge,\nWhose virtue/power matches heaven and earth, whose merit parallels sun and moon,\nWhose numinous power works wondrous transformations, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Golden Palace Illuminating the Dao/Way and Attaining Virtue, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Pure and Subtle, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith devoted heart we bow and take refuge,\nWhose might shakes thunder, whose grace descends as rain and dew,\nWhose numinous power is unhindered, whose blessings and virtue are boundless,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palace Proclaiming Transformation and Upholding the Teachings, Supreme Immortal Manifesting Numinous Power, Vastly Beneficent, Lofty and Serene, Profoundly Void, Subtly Responsive, Benevolent and Kind, Assisting the Nation and Protecting the People, Greatly Merciful True Lord.\n\nRejoicing in the grand celebration of the Zhongyuan Festival,\nThe gods descend upon Mount Song, revealing earth’s numinous power.\nIn the Jade Palace, golden censers waft fragrant smoke,\nColored clouds bear forth the Old Man Star.\n\n*Response:*\nNow with reverent heart we extol your sacred virtue,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together take refuge in the supreme Dao/Way.\n\nWith devoted heart we bow and take refuge,\nWithin the Hall of Numinous Aid, in the Hall of Joyous Feasting,\nWhose nature embodies humility and gentleness, whose beneficence equals earth’s depth,\nDiligent in the virtue of the inner court, assisting with hidden merit,\nAdorned with feathered canopy and rainbow robes,\nInscribed in purple among the immortal maidens of Mount Gou,\nIn golden chambers and jade halls, receiving the *Huangting* scripture before the Lady of Southern Marchmount,\nWhose grace extends to all beings, whose sacrifices endure a hundred generations,\nMost sacred, most numinous, most yielding, most serene—\nJingguo Lady, Compassionate Assistant, Benevolent and Chaste, Responsive Immortal Consort.\n\nUpon her head, a golden crown adorned with the Seven Stars,\nSeven dragons and five phoenixes welcome her in profusion.\nMay she pour forth jade nectar and golden libations,\nTo sprinkle as rain and dew upon the human world.\n\nWith devoted heart we bow and take refuge,\nWithin the Hall of Numinous Aid, in the Hall of Joyous Feasting,\nWho personally upholds frugality, governing with diligent care,\nThereby providing the goodness of inner virtue, enabling the earth’s nurturing aid,\nSeeking a virtuous consort as in the *Guanju* ode, without guile or private favor,\nObtaining a worthy consort as in the *Jiming* ode, ever vigilant in mutual support,\nWhose merit completes inner assistance, whose virtue spreads to all beings,\nMost sacred, most numinous, most yielding, most serene—\nWeiguo Lady, Kindly Assistant, Reverent and Tranquil Immortal Consort.\n\nSpecially entrusted to the Jade Maiden for transmission,\nHer position rightful in the inner palace, her teachings complete in the four virtues.\nAll things rely on her for life, none fail to prosper,\nMost yielding, most serene, she matches earth’s primal power.\n\nWith devoted heart we bow and take refuge,\nWithin the Hall of Numinous Aid, in the Hall of Kinship,\nNone more revered than the father, whose consort is heaven,\nOne must know the debt of gratitude that cannot be repaid, yet follows the Way of due reverence,\nMoreover, receiving the king’s decree, answering with civil and martial glory,\nEstablishing the state and founding the household, entrusted with the legacy of Yi and Zhou,\nWhose merit secures the altars of the land, whose blessings extend to descendants,\nMost sacred, most numinous, most venerable, most solemn—\nDivine Father, Prince of Qi, Loyal and Martial, Illustrious and Bright True Lord.\n\nWith earnest teachings of ritual and propriety passed in the Hall of the Carp,\nThe inner assistance of family precepts is most strict.\nBefore the hall, learning the play of the patterned robe,\nA thousand springs of longevity are wished, presented with rhinoceros cups.\n\nWith devoted heart we bow and take refuge,\nWithin the Hall of Numinous Aid, in the Hall of Kinship,\nMost sagely, most kind, with bright vows, gentle and serene,\nHer position rightful in the central palace, her merit complete in inner assistance,\nHer frugal virtue manifest, transforming those below,\nHer glorious deeds recorded in poetry and song,\nThe yin rites perfected, her teachings spread,\nHer fragrant name shining in the historical records,\nMindful of a mother’s loving care,\nDaring to express the rites of family celebration,\nMost sacred, most numinous, most compassionate, most loving—\nDivine Mother, Benevolent and Longevous, Gentle and Kind Immortal Consort.\n\nA mother’s toil must never be forgotten,\nHow vast is earth’s virtue, boundless in harmony.\nForever upholding her compassionate teachings, transmitting family precepts,\nSinging the four chapters of the *Sizi* ode in remembrance.\n\nWith devoted heart we bow and take refuge,\nWithin the Hall of Numinous Aid, in the Hall of Kinship,\nOcarina and flute play in alternation, wings supporting one another,\nPossessing both civil and martial talents,\nFulfilling the virtues of elder and younger brothers,\nEnfeoffed with lands and titles, guarding the frontier with added honors,\nExalting virtue and repaying merit, on the same day receiving royal titles of splendor,\nCherishing kin without resentment, ever abundant,\nMost sacred, most numinous, most fraternal, most affectionate—\nDivine Elder Brothers, the Enfeoffed Princes.\n\nBefore the Hall of Flourishing Blossoms, the village of accumulated goodness,\nIn former years, on the same day, they received royal titles of splendor.\nA family of filial piety and fraternal love, their lofty integrity commended,\nTheir loving legacy enduring a thousand years in the Hall of Kinship.\n\nWith devoted heart we bow and take refuge,\nWithin the Hall of Numinous Aid, in the Hall of Joyous Feasting,\nAdorned in proper robes, surrounded by silken curtains,\nThe family reveres its matriarch, rites accord with the lady’s love,\nHer literary talents renowned, like the Lady of the Xie clan,\nHer virtuous conduct praised, like the Lady of the Zhong clan,\nPersonally upholding the four teachings, bestowing blessings upon the people,\nMost sacred, most numinous, most yielding, most serene—\nDivine Elder Brothers’ Wives, the Sacred Consorts.\n\nIn reverence above, the matriarch’s countenance delights in fraternal love,\nThe hall brims with harmonious qi, laughter and joy steal unseen.\nRank and order preserve the family’s transmitted law,\nEven the semblance of a cap worn at dawn bars one from the chamber.\n\nWith devoted heart we bow and take refuge,\nWithin the Hall of Numinous Aid, in the Hall of Kinship,\nDescendants inherit abundance, a fragrant legacy spanning a hundred generations,\nSons and nephews renowned for virtue, fit to nurture orchids and irises,\nGrandfathers and grandsons share in grand affairs, rejoicing in the enduring bamboo and shoots,\nSinging the ode of *Gelu* and *Zong*,\nExtolling the virtue of *Zhongsi*—\nMost sacred, most numinous, most compliant, most reverent—\nDivine Sons and Divine Grandsons, the Noble Lords.\n\nA legacy of purity and integrity, its teachings endure,\nRenown resounds, magnifying the gate.\nNobles beget nobles, their lineage assured,\nFor hidden blessings lie ever in sons and grandsons.\n\nWith devoted heart we bow and take refuge,\nWithin the Hall of Numinous Aid, in the Hall of Kinship,\nTeachings uphold the great bonds of kinship.\nHarmonizing the three clans, they receive Heaven’s emolument—\nA thousand measures, even ten thousand measures,\nEnfeoffed upon the land, first among those of the same surname, then among others,\nHaving humbly received the profound love of General Liu Hong,\nAnd knowing the prudent virtue of Minister Fu of Zheng,\nTheir names weighty in their time, their rewards enduring through the ages—\nMost sacred, most numinous, most kindred, most benevolent—\nDivine Uncles and Divine Sons-in-Law, the Noble Lords.\n\nThe maternal uncle of Weiyang, kin to the mother,\nOnce knew the radiant luster of pearls and jade.\nFurther compiling the works of Han Yu of Changli,\nLi Han’s literary fame spread far and wide.\n\nWith devoted heart we bow and take refuge,\nWithin the Hall of Numinous Aid, in the Hall of Joyous Feasting,\nThe inner chambers ordered and solemn, laws and disciplines strict,\nWhether in coarse or fine cloth, their purpose lies in women’s work,\nGathering duckweed and pondweed, teaching that wifely virtue comes first,\nRites dictate reverence for parents-in-law,\nFilial piety never forgets one’s own parents—\nMost sacred, most numinous, most reverent, most compliant—\nDivine Daughters and Divine Wives, the Immortal Consorts.\n\nSeven chapters of the *Nü Jie* follow in harmony,\nHonoring uncles and parents-in-law as one’s own parents.\nThe sash and kerchief, the orchid and angelica, bestowed as gifts,\nDiligence in wifely virtue, solemn and harmonious.\n\nWith devoted heart we bow and take refuge,\nWithin the Hall of Numinous Aid, in the Hall of Joyous Feasting,\nCloud-canopied and carefree, the Moon Palace’s opulence,\nTheir robes resplendent, embroidered garments draped in cassia and osmanthus,\nTheir forms majestic, adorned with luminous pearls and golden kingfisher plumes,\nFair and radiant, warm and resplendent.\nMay the numen of Wu Mountain be dispelled,\nForever serving as the auspicious omen of this blessed land—\nMost sacred, most numinous, free and unbound—\nThe Sacred Consorts of the Entire Hall.\n\nPearl-trimmed slippers and golden hairpins fill the palace courts,\nTheir bearing rich yet refined, virtuous and chaste.\nGathering duckweed from the pond, the affairs of lords and nobles,\nUnlike the consorts of the Jia or the Guo, who brought ruin to the palace.\n\nWith devoted heart we bow and take refuge,\nWithin the Hall of Numinous Aid, in the Hall of Joyous Feasting,\nThe sun as spirit, the moon as soul,\nTaiyi presides over the Register of Life,\nTianyi governs the Office of Birth,\nThe constellations store their essence, moved by Venus to enter dreams,\nMountains and rivers nurture brilliance, rejoicing in the descent of numen from Mount Song,\nBearing the celestial qilin,\nAll become marvels among mortals—\nMost sacred, most numinous, responsive to every invocation—\nTaiyi, Overseer of Life, Tianyi, Registrar of Birth, and all attendant consorts.\n\nWhat auspicious dream heralds the joy of a son’s birth?\nThe numinous peak’s vital qi emits propitious light.\nSons beget grandsons, grandsons beget sons,\nThe lineage flourishes for ten thousand generations, thriving and prosperous.\n\nWith devoted heart we bow and take refuge,\nIn the Dragon-Headed Temple’s courtyard, the Sacred Realm of Ao Peak,\nTheir offices span the hundred ranks, their positions among the nine ministers,\nOverseeing emolument as the authority of Wenchang,\nGoverning fortune as the sovereign of the Registrar of Birth,\nTheir teachings follow the *Hongfan*:\n\"Long life, wealth, health, and peace,\"\nTheir praises offered in the *Biyong*:\n\"May they thrive, prosper, and reach venerable age,\"\nEvery person rejoicing, every place blessed—\nMost sacred, most numinous, responsive as echo to sound—\nThe True Lords and Sovereigns of Left and Right Fortune and Emolument.\n\nThe twin stars of Fortune and Emolument appear at the pivot of the Dipper,\nTheir offices to the left and right advance the worthy.\nA family of accumulated goodness, known as gentlemen,\nSons and grandsons abound in blessings.\n\nWith devoted heart we bow and take refuge,\nIn the Dragon-Headed Temple’s courtyard, the Sacred Realm of Ao Peak,\nLightning flashes, clouds rise high,\nHeaven speaks not, yet its voice thunders in wrath,\nThe earth’s bounty relies on rain and dew to nurture life,\nDivine mechanisms operate in the unfathomable,\nWondrous transformations turn in the formless,\nGrace descends upon the nine regions,\nBlessings extend to all living beings—\nMost sacred, most numinous, transforming and changing—\nLord Thunder, Mother Lightning, Earl Wind, Master Rain,\nThe Illustrious Dragon Kings of this temple,\nThe Earth Gods of the Five Directions,\nThe Rain-Bringing Dragon Spirits, and all others.\n\nDragons ride the clouds, their power assured,\nTheir voices shake the thunder for ten thousand miles.\nThe world’s people long for timely rain,\nAt once their fortunes rise, their horns emerge—\n\nWith devoted heart we bow and take refuge,\nIn the Sacred Realm of Ao Peak, the Dragon-Headed Temple’s courtyard,\nMost sacred, most numinous, to the left and right,\nSome present their jesting arts,\nOthers excel in the arts of the *guanlu*,\nThose who oversee the kitchen wield the eight delicacies,\nThose who direct music harmonize the six pitches,\nThe Sixteen Guardians of the Army, all born with the talents of generals,\nThe Three Hundred Cavalry, each destined for enfeoffment,\nTheir majesty and numen manifest,\nTheir images fierce and vivid—\nMost sacred, most numinous, stern and protective—\nAll the numinous powers of the entire hall.\n\nFor their labors in stabilizing the state and enacting laws for the people,\nTheir incense and karmic ties enshrine them in the temple.\nThe renown of generals and ministers endures through the ages,\nTheir images praised for a thousand years, likened to the qilin.\n\nThe rites complete, each rises and kneels in devotion,\nSincerely repenting with reverence.\nWith devoted heart, body, spirit, and life, we take refuge\nIn the Nine Heavens’ True Lord of Numinous Aid and all the majestic immortals of the hall.\n\nWe humbly beseech the sacred compassion,\nTo bestow vast blessings and descend abundant grace.\nThrough this day’s solemn fast and devotion,\nWe sincerely take refuge and repent.\nWe have heard that misfortune and fortune have no fixed gate,\nOnly summoned by one’s own actions;\nOmens of good and ill follow like shadows.\nGood serves as the tally of evil,\nEvil as the proof of good.\nFor those who do good,\nThe Five Phases support them, the Overseer of Fate befriends them.\nFor those who do evil,\nMalevolent qi overwhelms them, baleful stars shine upon them.\n\nThough Heaven’s net is hard to escape,\nYet all lies in the awakening of the human heart.\n\nThis day, we prostrate in reflection:\nAll sentient beings turn their hearts toward the Dao,\nTheir utmost sincerity moving the gods.\nWe bow in reverence before the True and All-Hearing,\nFirst confessing our faults,\nFrom past kalpas to this present life.\nAshamed of wrongs, we have acted perversely,\nTurned from right to follow wrong,\nAltered our nature to chase power,\nEmbraced deceit to exploit flaws.\nIn darkness and secrecy, we schemed with cunning,\nIn cruelty and savagery, we wrought harm.\nDeluded by dreams, we wandered lost\nIn the fields of profit, fame, and cunning.\nKilling, stealing, lust, and deceit—\nWe sank into the mire of greed, wrath, and delusion.\nIn great matters, we deceived Heaven and Earth;\nIn secret, we betrayed the gods.\nWe cursed the heat, railed against the cold,\nScolded the wind, reviled the rain.\nBefore the stars, we sought advantage;\nBefore the sun and moon, we bared ourselves.\nWe pointed at rainbows, swore by mountains and seas,\nDefiled temples and shrines, polluted sacred precincts.\nUnmindful of the wrongs of body, heart, mouth, and intent,\nUnsettled in the roles of scholar, farmer, artisan, merchant.\nWe honored not the Three Treasures, nor practiced the Five Constants.\nIn serving others, we were disloyal;\nIn friendship, untrustworthy.\nToward parents, unfilial;\nToward lords, ungrateful.\nWealthy yet unkind,\nGreedy yet unjust.\nWe called sacrifice futile,\nViolence harmless.\nDeemed reverence unworthy,\nWords unworthy of fear.\nWe rebelled against superiors, stirred chaos,\nLoved violence, hated poverty,\nSlandered the loyal, bullied the weak.\nWe served public ends for private gain,\nExalted ourselves at others’ expense.\nWe incited lawsuits, sowed enmity,\nArrogant in self-regard, cruel in self-will.\nUnclear in goodness, insincere in conduct.\nSmall resentments eroded the bond of father and son,\nNeglect dissolved the love of brothers.\nWhen customs decayed, we sang the *Gu Feng* in reproach;\nWhen kin turned to hatred, we chanted the *Jiao Gong* in lament.\nNow, knowing our sins have filled the measure,\nWe humbly face the merciful and repent.\n\nWho among us is without fault?\nYet faults, once mended, bring trembling fear.\nThe gods accept no fixed offerings,\nBut respond to utmost sincerity—\nThus we offer our earnest, reverent devotion.\n\nWe pray the Most Benevolent grant protection,\nThe Great Dao show compassion,\nForgive our past transgressions,\nBestow future blessings.\nLet all regions rejoice,\nAll lands receive grace.\nMay this day bring great peace,\nDisasters cease, misfortunes end.\nMay every blessing arrive,\nThe old grow strong, the young vigorous.\nLong have we revered the awe-inspiring power of your virtue,\nNow we dedicate ourselves to works that aid the people.\n\nWith utmost sincerity, we bow our heads,\nTwice prostrating to give thanks to the Two True Lords of Numinous Aid.\nWe perform the Triple Rite of Thanksgiving.\n\nDisciples, with one heart, bow in reverence and thanks\nTo the True Lord of the Nine Heavens’ Golden Portal.\nDisciples, with one heart, bow in reverence and thanks\nTo the True Lord of the Nine Heavens’ Jade Portal.\nDisciples, with one heart, bow in reverence and thanks\nTo the Illustrious Father, True Lord of Supportive Brilliance.\n\nThe rites of thanksgiving complete,\nOur repentance fully revealed,\nWe reverently follow the wondrous canon,\nDaring to approach your numinous wisdom.\nWith sincere devotion, we lay bare our humble wishes.\n\nWe pray your sacred compassion deign to look upon us.\n\nFirst, may the present emperor’s life be long,\nHis harmony and longevity matching Heaven’s—ten thousand, ten thousand springs.\nSecond, may ministers and officials enjoy rank and emolument,\nTheir blessings like wind and clouds—enduring for a thousand years of joy and prosperity.\nThird, may scholars attain wealth and honor,\nTheir names rising to Heaven’s court as dukes and ministers.\nFourth, may farmers diligently till the soil,\nFrom this year onward, year after year, rejoicing in triple harvests.\nFifth, may all artisans perfect their crafts,\nAwaiting summons to the Golden Gate to hear the jade decree.\nSixth, may the path to wealth be great,\nComparable to the lords of a thousand households.\nSeventh, may wind and rain be timely,\nAll under Heaven celebrating universal peace.\nEighth, may incense and offerings ever flourish,\nThe temple’s majesty and numinous power enduring for a thousand years.\nNinth, may the Nine Heavens bestow their mandate,\nJade pendants chiming as we approach the Purple Court.\nTenth, may all faithful and good in the ten directions\nTurn to the Three Treasures with utmost devotion.\n\nThe above hymn of praise and rites now complete,\nThe merit and virtue fulfilled.\n\nAll in the ritual assembly, each with reverence, speak again:\nWe have heard that with trembling caution,\nWe shame ourselves for our repeated offenses.\nIn awe of your radiant majesty,\nWe behold your numinous presence close at hand.\nGrateful in heart, we bow and declare:\nYour virtue shines forth—manifest and luminous,\nYour merit extends boundlessly, aiding all.\nYou are the bridge across the sea of suffering,\nThe sun and moon guiding the lost.\n\nToday, we reverently follow the sacred decree,\nConducting this ritual of gratitude and prayer for blessings.\nWe face your true wisdom, proclaiming your wondrous example.\nWith the devotion of triple ablutions and triple incense,\nWe dare to offer our gaze and our reverence.\nMay the impartial gods see our sincerity,\nWashing away the sins of past kalpas and this life,\nThat we may plant the seeds of present and future karma.\nWith beginning and end, without evil or song,\nWhat can be grasped, the foolish cannot reach;\nYet the gods transform, and the people are rightly guided.\nWhen merit is complete and deeds perfected,\nWe may ascend to the Jade Chamber and Cinnabar Terrace.\nWhen qi abides and spirit is upright,\nWe may open the brocade pouch of the Purple Sun.\nMay all faithful men and women attain long life,\nCountless generations of ancestors be delivered.\nExtending even to the departed in darkness,\nAll may return to the vast Mahayana.\nFor these supreme causes, we earnestly invoke:\nThe Heaven-Blessed Honored Lord of the Nine Heavens,\nThe Ten-Thousand-Fortunes-Protecting-Body Honored Lord,\nThe Heaven-Invoked-Fruit-Attaining Honored Lord.\nTogether: Inconceivable merit and virtue.\n\nThe *Ritual Text of Offering and Prayer to the Numinous Aid True Lord* is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洪恩灵济真君礼愿文 经名：洪恩灵济真君礼愿文。 撰人不详。 一卷。 底本出处：《正统道藏》洞玄部威仪类。 洪恩灵济真君愿文序 愿者，真人之愿也，亦人之所愿也。 一跪一拜，心之专也。 心之专，善之至也。 人性之善，犹水就下也。 不善不改，是吾忧也。 此愿所以为善者设是，岂徒愿文乎哉。 仰观於天，得数二十五。 俯法於地，得数三十。 合而言，得数五十五。 盖因此数得以成其愿，若非与天地同功，安能至此。 善人天地之纪也。 苟有一毫矫伪慢怠之意，非吾之所谓愿也。 其可与善者同日语耶？ 《传》曰：善无常主，协于克一。 此无他，始於是，终於是，不以半涂而自画，斯为尽善而尽美也。 善者，福之基。 福者，善之积。 唐高郢有言：积善以致福，不费财以求福，福既可以不费财而求，则为善者可曰费财乎。 见善以相示，闻善以相告，凡吾同志，当以此自相勉励。 庶无愧於天地，亦无愧於真君，此又真君之大愿也。 洪恩灵济真君礼愿文 以今恭焚宝香，虔诚供养： 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君， 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君， 灵济宫中神仙诸灵官普同供养。 恭闻神之显德，曰正直而曰聪明。 人所常情，欲安逸而顾富贵。 祭之必受福也，礼其无太简乎。 庙食余四百年，香火如彼其盛。 碑铭凡一千字，文章可得而闻。 昭昭不朽之名，凛凛如生之义。 功全社稷，德在生灵。 农力於耕，有黍稷稻粱之庆。 工精其艺，合准绳规矩之程。 士以忠孝立身，商以仁义为利。 问婚者，宜家宜室。 祈嗣者，生子生孙。 风风人，雨雨人，均遂生成之愿。 衣衣我，食食我，俱沾温饱之仁。 施之万物得其宜，措之四时得其序。 仰之如太山北斗，厥光大矣。 不我遐遗，现则为景，星庆云争，先睹之以为快乐。 宜受大礼，以宣厥灵。 昔膺勅额之荣，今荷天恩之宠。 位既登於金阙玉阙，名乃进於大仙上仙。 徽号褒崇，威仪赫奕，祀延百世，表正万神。 与大造以为徒，长上古而不老。 伏念某心虽慕道，才不如人。 少伸昭谢之私，略致涓埃之敬。 具严法会，干冒真聪。 伏愿呜玉鸾兮啾啾，驾八龙兮蜿蜿，率云霓兮来迓，令闻阖兮开关，先使．丰隆兮前驱，后使飞廉兮奔属，委厥美兮从容，赛将澹兮寿光，桂酒奠兮椒浆，蕙肴蒸兮兰籍，逍遥兮容与，低回兮顾怀。 某下情无任勤拳，颙俟之至所； 有真君本愿神咒，谨当持诵： 真君真君，北斗大神。 天地赞化，日月并明。 下主酆都，上朝帝庭。 奉行正法，斩伐邪精。 灵济徽号，福及万民。 有求必应，如谷随声。 有感必通，如影随形。 逆我者死，顺我者生。 唵昭灵昭灵，普济生灵。 乾元亨利贞，急急如律令。 灵济真君，速降来临。 好生之德，洽于民心。 存吾二气，火阳水阴。 消灾度厄，福善祸淫。 急急如律令。 真君真君，北斗降生。 代天行化，助国救民。 流传正法，斩伐邪精。 魔王拱卫，真气常存。 急急如律令。 向来神咒，已具敷宣。 奉请： 圣父齐王忠武翊亮真君， 圣母仁寿淑善仙妃， 灵济二位真君、二位仙妃，法驾降临预会众真，列班朝礼。 朝礼既周，各升法座。 虔诚设拜上香。 叹香",
      "translated_text": "**Rite and Vows to the Venerable Lord of Vast Grace and Numinous Aid**\n\n**Title:** *Rite and Vows to the Venerable Lord of Vast Grace and Numinous Aid*\n**Author:** Unknown\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongxuan* Section, *Weiyi* (Ritual Propriety) Category\n\n---\n\n**Preface to the Vows to the Venerable Lord of Vast Grace and Numinous Aid**\n\nVows are the aspirations of the perfected, and also the aspirations of all people. Each kneel and bow is the focus of the heart; the focus of the heart is the utmost of goodness. The goodness of human nature is like water flowing downward. If one does not correct what is not good, this is my sorrow. These vows are thus established for those who would be good—how could they be mere words of aspiration?\n\nGazing upward at heaven, one obtains the number twenty-five. Looking downward to earth, one obtains the number thirty. Combined, they yield fifty-five. It is by this number that the vow is fulfilled, for without sharing in the work of heaven and earth, how could this be achieved? The good person is the guiding principle of heaven and earth. If there is even a trace of deceit, arrogance, or negligence, this is not what I call a vow. How could such a one be spoken of in the same breath as the good?\n\nThe *Tradition* says: \"Goodness has no constant master; it harmonizes with those who achieve unity.\" There is no other reason for this—beginning with it, ending with it, never halting halfway, this is to be perfectly good and perfectly beautiful.\n\nGoodness is the foundation of fortune; fortune is the accumulation of goodness. Gao Ying of the Tang said: \"Accumulate goodness to attain fortune; do not expend wealth to seek fortune.\" Since fortune can be sought without expending wealth, can those who do good be said to expend wealth? Seeing goodness, one should point it out; hearing goodness, one should proclaim it. All who share this aspiration should thus encourage one another, that we may be without shame before heaven and earth, and also without shame before the Venerable Lord. This, too, is the great vow of the Venerable Lord.\n\n---\n\n**Rite and Vows to the Venerable Lord of Vast Grace and Numinous Aid**\n\nToday, with reverence, we burn precious incense and offer sincere devotion to:\nThe Great Immortal of the Nine Heavens’ Golden Gate, who illuminates the Dao and manifests virtue, whose numinous power is vast and whose aid is universal, who dwells in the pure and mysterious, the empty and subtle, whose compassion and kindness protect the state and shelter the people—the Venerable Lord of Vast Grace;\nThe Supreme Immortal of the Nine Heavens’ Jade Gate, who proclaims transformation and upholds the teaching, whose numinous radiance is far-reaching and whose aid is abundant, who is lofty and serene, empty and profound, whose wondrous responses are benevolent, who assists the state and protects the people—the Venerable Lord of Vast Grace;\nAnd all the divine officials and immortals of the Palace of Numinous Aid, to whom we offer our common devotion.\n\nWe have heard that the manifest virtue of the spirits is called uprightness and wisdom. The common desire of people is for peace and ease, for wealth and honor. If sacrifices must bring blessings, then the rites must not be too simple. For over four hundred years, the temple offerings have flourished; the incense fire burns as brightly as ever. The stele inscriptions number a thousand characters, and their compositions may still be heard. Their illustrious and imperishable names, their awe-inspiring and lifelike righteousness—these have preserved the altars of the state and bestowed virtue upon the living.\n\nThe farmer labors in the fields, and there is celebration of millet, rice, and grain. The artisan refines his craft, meeting the standards of plumb line, compass, and square. The scholar establishes himself through loyalty and filial piety; the merchant profits through benevolence and righteousness. Those who seek marriage find harmony in family and home; those who pray for descendants beget sons and grandsons. Wind and rain nourish the people, fulfilling the wishes of all life. Clothing and food sustain us, granting the kindness of warmth and fullness. Bestowed upon the myriad things, all is fitting; arranged through the four seasons, all is in order.\n\nGazing up to them is like beholding Mount Tai or the Northern Dipper—their radiance is vast. They do not abandon us in the distance; when they manifest, it is as light, as stars and clouds contending in splendor, a joy to behold first. They are fitting recipients of great rites, that their numinous power may be proclaimed.\n\nIn the past, they received the honor of imperial bestowal; today, they bear the favor of heaven’s grace. Their rank has ascended to the Golden and Jade Gates; their names have advanced to the Great and Supreme Immortals. Their honorific titles are exalted, their majesty resplendent; their sacrifices endure for a hundred generations, their example rectifies the myriad spirits. They walk with the great creators, ever ancient yet never aging.\n\nI, so-and-so, though my heart yearns for the Dao, my talent does not compare to others. I humbly extend my private gratitude and offer a small token of respect. Having prepared this solemn Dharma assembly, I presumptuously invoke the true wisdom of the Venerable Lord.\n\nI pray that the jade phoenix may sing *jiujiu*, that the eight dragons may coil and glide, that clouds and rainbows may lead the way, that the gates may open at the sound of your approach. First, let Fenglong advance as your vanguard; then, let Feilian hasten as your retinue. Bestow your beauty with ease, repay with serene longevity. Offer cassia wine and peppered libations, orchid mats and magnolia feasts. Roam freely and linger, look back with care and affection.\n\nMy humble devotion is boundless; I await your presence with reverence.\n\nThere is the Venerable Lord’s original vow and divine incantation, which I shall now recite with care:\n\n*Venerable Lord, Venerable Lord, Great Spirit of the Northern Dipper.*\n*Heaven and earth praise your transformation; sun and moon shine together.*\n*Below, you govern Fengdu; above, you attend the imperial court.*\n*Upholding the true Dharma, you slay and vanquish evil spirits.*\n*Your numinous title, Lingji, brings fortune to the myriad people.*\n*Those who seek are answered, as echo follows sound.*\n*Those who feel are moved, as shadow follows form.*\n*Those who oppose me perish; those who follow me live.*\n*Om, Radiant Numinous One, Radiant Numinous One, universally aid the living.*\n*Qianyuan,亨利贞, swiftly, swiftly, as the law commands.*\n*Venerable Lord of Numinous Aid, descend swiftly.*\n\nThe virtue of cherishing life pervades the hearts of the people. Preserve my two *qi*: the fiery *yang* and the watery *yin*. Dissolve disasters, cross over calamities, bring fortune to the good and misfortune to the licentious.\n*Swiftly, swiftly, as the law commands.*\n\n*Venerable Lord, Venerable Lord, born of the Northern Dipper.*\n*Acting on heaven’s behalf, you transform; assisting the state, you save the people.*\n*Transmitting the true Dharma, you slay and vanquish evil spirits.*\n*Demon kings guard you; true qi abides forever.*\n*Swiftly, swiftly, as the law commands.*\n\nThe divine incantations have now been fully proclaimed. We respectfully invite:\nThe Sacred Father, the Loyal and Martial True Lord of Aid and Brightness, Prince Qi;\nThe Sacred Mother, the Benevolent and Longevous, Kind and Virtuous Immortal Consort;\nThe Two Venerable Lords of Numinous Aid, the Two Immortal Consorts;\nTheir divine processions to descend and join the assembly of the perfected, to array themselves in ranks and pay homage.\n\nHaving completed the homage, each ascends to their Dharma throne. With reverence, we set out the offerings and burn incense.\n\n*Ode to the Incense*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1253,
      "start_sentence": 0,
      "end_sentence": 86,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.741785764694214,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君礼愿文.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "伏以明德以荐，非黍稷之能馨，为善之徒，与芝兰而俱臭。 是香也，玉炉献瑞，金鼎呈祥。 郁郁纷纷，结为云烟之气。 融融霭霭，陶成宇宙之春。 捧之，则有使者立吾前。 侍之，则有童子立吾后。 有醮云：稽首虔诚供养。 无醮云：酒陈初献，奉此侑樽，法众运心，虔诚供养。 吟香偈 天上云阿种，刚风落四溟。 深沉秘龙宫，海神献仙众。 今热荐诚恳，氤氲上紫宸。 洞达入杳冥，所求皆如愿。 和：众等一心供养。 散花。 洞案炉烟起。 散花林。 无为道德香。 散满道场。 真君前供养。 叹水",
      "translated_text": "We humbly submit that bright virtue, when offered, surpasses the fragrance of millet and grain; those who cultivate goodness share their scent with orchids and angelicas. This incense—jade censers present auspicious omens, golden tripods manifest felicity. Dense and abundant, it coalesces into clouds of mist and vapor; warm and radiant, it steeps the cosmos in spring. When held aloft, messengers stand before us; when attended, youths stand behind. In rites with libations, we bow in reverence and make offerings. In rites without, the first cup of wine is presented, this incense accompanying the chalice—let the Dharma assembly focus their minds and make offerings with devotion.\n\n*Incense Verse*\nIn the heavens, clouds sow their seeds;\nA mighty wind scatters them across the four seas.\nDeep within the dragon palace’s secrets,\nSea spirits offer them to the immortals.\nNow, fervently kindled with sincerity,\nIts mist ascends to the Purple Palace.\nPenetrating the boundless void,\nAll prayers are fulfilled as wished.\n\n*Response:* Together, we make offerings with one heart.\n\n*Scattering flowers.*\nFrom the censer’s depths, smoke arises.\n*Scattering flowers through the forest.*\nThe incense of the effortless Dao and virtue.\n*Scattering flowers to fill the Dharma realm.*\nOfferings before the True Lords.\n\n*Ode to the Water*",
      "overlap_context": "cred Father, the Loyal and Martial True Lord of Aid and Brightness, Prince Qi;\nThe Sacred Mother, the Benevolent and Longevous, Kind and Virtuous Immortal Consort;\nThe Two Venerable Lords of Numinous Aid, the Two Immortal Consorts;\nTheir divine processions to descend and join the assembly of the perfected, to array themselves in ranks and pay homage.\n\nHaving completed the homage, each ascends to their Dharma throne. With reverence, we set out the offerings and burn incense.\n\n*Ode to the Incense*",
      "start_char": 1253,
      "end_char": 1481,
      "start_sentence": 87,
      "end_sentence": 107,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.413378715515137,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君礼愿文.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "伏以演污可荐於王公，惟有忠信以为质。 源水不舍於昼夜，自惭声闻之过情。 是水也，不浊不昏，常清常净。 天上为雨露，承之以铜柱金茎。 地下为醴泉，餐之如琼浆玉液。 知者行其所无事，上善若此而不争。 无水不朝东，其源来自北。 有醮云：稽首虔诚供养。 无醮云：酒陈亚献，奉此侑樽，法众运心，虔诚供养。 吟水偈 天上银河溢，泓澄映十方。 变成雨露来，覃恩遍天地。 润下滋枯槁，涵濡泽万生。 酌水表丹哀，身心悉清净。 和：众等一心供养。 散花。 源流非地脉。 散花林。 灌溉自天河。 散满道场。 真君前供养。 叹花 伏以翠叶重重，以停荫於清泠之渚。 玉葩郁郁，乃生神於大有之庭。 是花也，香本自香，色无定色。 池莲红者，忽变为碧。 牡丹白者，可染为黄。 广寒官中桂一枝，影拖秋月。 武陵洞裹桃千树，靥笑春风。 欲倾葵藿之情，少寓频系之礼。 有醮云：稽首虔诚供养。 无忏云：酒陈终献，奉此侑樽，法众运心，虔诚供养。 吟花偈 玄圃珍葩盛，盘根蔓十方。 挺秀八百年，垂芳及尘世。 伟灿光明界，缤纷雨宝花。 采得最清英，我今兴供养。 和：众等一心供养。 散花。 万花兴供养。 散花林。 飞舞自天来。 散满道场。 真君前供养。 伏以游神於道，视不见，听不闻。 守道以神，瞻在前，忽在后。 隐无终隐，名岂强名。 自赤明开图，天书之所由降。 及天真按笔，人文之所以兴。 帝誉受之於牧德台前，黄帝传之於峨眉山上。 或得於勾曲，符阖闾之愿。 或降於锺山，成夏禹之功。 蚓兹经教之流传，使我众生而解悟。 兹盖伏遇 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君， 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君， 上佐斗真於北极，内参玄学於东华。 百万亿劫，劫劫修来，五十五愿，愿愿得度。 炼金成凤篆，揉玉写龙章。 愿共诸有情，同成无上道。 道场众等，稽首皈依，志心赞咏。 唱咏真君本愿赞同声 上朝帝座，身进天阶。 光依日月，职掌三台。 列宿拱卫，云汉昭回。 东方龙角，独占斗魁。 华盖房驷，辅弼严明。 羽林将军，左导右迎。 埙箎迭奏，律吕合声。 荣归天府，万里云程。 举道场众等人，各虔诚赞礼如法。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 大道巍巍不可名，九天旺气属真君。 古往今来无纪极，百千变化妙通神。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命，礼德配乾坤。 功参日月，神通妙用，正直聪明。 大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。",
      "translated_text": "We humbly submit: though turbid waters may be offered to lords and nobles, only loyalty and sincerity form their true essence. The source-water flows ceaselessly day and night, yet we blush at the excess of our own reputation. This water—neither muddied nor dim—remains ever clear, ever pure. In heaven it becomes rain and dew, caught upon bronze pillars and golden stalks; on earth it turns to sweet springs, savored like jade nectar. The wise act without pretense, and the highest good, like water, contends with none.\n\nIts current never fails to flow east, yet its source lies in the north.\n\n*With ritual present:* We bow our heads in reverent offering.\n*Without ritual:* The second cup of wine is presented, this incense accompanying the chalice—let the Dharma assembly focus their minds and make offerings with devotion.\n\n*Ode to the Water*\nIn heaven the Silver River overflows,\nits limpid depths reflecting the ten directions.\nTransformed into rain and dew it descends,\nbestowing grace across heaven and earth.\nMoistening what is withered, nourishing all life,\nits bounty revives the parched and sustains the myriad beings.\nPouring forth, it expresses our deepest sorrow—\nbody and mind wholly purified.\n\n*Response:* Together, we make offerings with one heart.\n\n*Scattering flowers.*\nThe source flows not from earthly veins.\n*Scattering flowers through the forest.*\nIt waters all from the celestial river.\n*Scattering flowers to fill the Dharma realm.*\nOfferings before the True Lords.\n\n*Ode to the Flowers*\nWe humbly submit: layered emerald leaves cast their shade upon the limpid isles; jade blossoms flourish, giving rise to spirit in the courts of abundance. These flowers—fragrant in their very essence, their hues unbound by fixed form. The red lotus of the pool may suddenly turn jade-green; the white peony can be dyed golden. In the Palace of Broad Cold, a single cassia branch trails its shadow beneath the autumn moon; within the Wu-ling grotto, a thousand peach trees smile in the breath of spring. Though we long to pour forth the devotion of sunflowers, we offer but the modest tribute of repeated veneration.\n\n*With ritual present:* We bow our heads in reverent offering.\n*Without ritual:* The final cup of wine is presented, this incense accompanying the chalice—let the Dharma assembly focus their minds and make offerings with devotion.\n\n*Ode to the Flowers*\nRare blossoms of the Dark Garden flourish,\ntheir roots spreading through the ten directions.\nStanding tall for eight hundred years,\ntheir fragrance lingers in the dusty world.\nResplendent in the realm of radiant light,\na cascade of jeweled petals rains down.\nGathering the purest essence,\nwe now rise to make our offering.\n\n*Response:* Together, we make offerings with one heart.\n\n*Scattering flowers.*\nTen thousand flowers arise in offering.\n*Scattering flowers through the forest.*\nDancing, they descend from heaven.\n*Scattering flowers to fill the Dharma realm.*\nOfferings before the True Lords.\n\nWe humbly submit: in roaming the spirit through the Dao, one sees without seeing, hears without hearing. Abiding in the Dao with spirit, one gazes ahead—suddenly behind. Concealment has no end, and names are not forced upon it. Since the dawn of the Red Clarity, when celestial scriptures first descended, and the Heavenly Perfected took up their brushes, human culture began to flourish. The Emperor Shun received it before the Terrace of Pastoral Virtue; the Yellow Emperor transmitted it upon Mount Emei. Some obtained it at Gourd Valley, fulfilling the wish of King Helü; others descended upon Bell Mountain, completing the work of Yu the Great. Through the transmission of these scriptures and teachings, we sentient beings awaken to understanding.\n\nThus, we reverently invoke:\nThe Nine Heavens’ Golden Portal, Illuminating Dao and Manifesting Virtue, Great Immortal of Resplendent Efficacy, Vast Salvation, Pure and Subtle, Cavernous and Mysterious, Marvelously Responsive, Compassionate and Benevolent, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord;\nThe Nine Heavens’ Jade Portal, Proclaiming Transformation and Upholding the Teachings, Supreme Immortal of Radiant Efficacy, Vast Salvation, Lofty and Serene, Profound and Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nAssisting the Dipper Perfected in the northern pole, inwardly participating in the mysteries of Eastern Florescence. Through a hundred million kalpas, kalpa after kalpa of cultivation; fifty-five vows, vow after vow fulfilled. Refining gold into phoenix-script, kneading jade into dragon-chapters. May all sentient beings together attain the supreme Dao.\n\nThe assembly of this Daoist sanctuary bows in reverence, pledging devotion and singing praises.\n\n*In unison, we chant the True Lords’ Original Vows:*\nAscending the imperial throne, advancing upon the celestial steps.\nRadiance companion to sun and moon, duties spanning the Three Terraces.\nConstellations arrayed in guard, the Silver River shines in revolution.\nThe Dragon’s Horn in the east claims the Dipper’s head;\nthe Canopy and Chamber Steeds serve as strict attendants.\nFeathered Forest generals escort left and right;\nocarinas and flutes play in turn, harmonizing with pitch-pipes.\nReturning in glory to the celestial palace,\na journey of ten thousand leagues through the clouds.\n\nLet all in this sanctuary rise, each offering reverent praise according to ritual.\n\nWith devoted hearts we bow and take refuge, proclaiming:\nVirtue matching heaven and earth, merit equaling sun and moon,\nmysterious efficacy of spiritual power, upright and enlightened.\nGreat compassion, great mercy, great sanctity, great vows—\nresponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Golden Portal, Illuminating Dao and Manifesting Virtue, Great Immortal of Resplendent Efficacy, Vast Salvation, Pure and Subtle, Cavernous and Mysterious, Marvelously Responsive, Compassionate and Benevolent, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith devoted hearts we bow and take refuge, proclaiming:\nMight shaking thunder, grace descending like rain and dew,\nspiritual power at ease, boundless blessings.\nGreat compassion, great mercy, great sanctity, great vows—\nresponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Jade Portal, Proclaiming Transformation and Upholding the Teachings, Supreme Immortal of Radiant Efficacy, Vast Salvation, Lofty and Serene, Profound and Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nThe Dao, majestic and beyond naming,\nthe flourishing qi of the Nine Heavens belongs to the True Lords.\nFrom ancient times to the present, without end,\na hundred thousand transformations, wondrously divine.\n\n*Response:* Now we sing of their sacred virtues with reverence,\nmay their awe-inspiring radiance witness our sincerity.\nMay all sentient beings together take refuge in the supreme Dao.\n\nWith devoted hearts we bow and take refuge, proclaiming:\nVirtue matching heaven and earth, merit equaling sun and moon,\nmysterious efficacy of spiritual power, upright and enlightened.\nGreat compassion, great mercy, great sanctity, great vows—\nresponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Golden Portal, Illuminating Dao and Manifesting Virtue, Great Immortal of Resplendent Efficacy, Vast Salvation, Pure and Subtle, Cavernous and Mysterious, Marvelously Responsive, Compassionate and Benevolent, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith devoted hearts we bow and take refuge, proclaiming:\nMight shaking thunder, grace descending like rain and dew,\nspiritual power at ease, boundless blessings.\nGreat compassion, great mercy, great sanctity, great vows—\nresponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Jade Portal, Proclaiming Transformation and Upholding the Teachings, Supreme Immortal of Radiant Efficacy, Vast Salvation, Lofty and Serene, Profound and Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.",
      "overlap_context": "rets,\nSea spirits offer them to the immortals.\nNow, fervently kindled with sincerity,\nIts mist ascends to the Purple Palace.\nPenetrating the boundless void,\nAll prayers are fulfilled as wished.\n\n*Response:* Together, we make offerings with one heart.\n\n*Scattering flowers.*\nFrom the censer’s depths, smoke arises.\n*Scattering flowers through the forest.*\nThe incense of the effortless Dao and virtue.\n*Scattering flowers to fill the Dharma realm.*\nOfferings before the True Lords.\n\n*Ode to the Water*",
      "start_char": 1481,
      "end_char": 2768,
      "start_sentence": 108,
      "end_sentence": 192,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.46799683570862,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君礼愿文.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "鼻祖开基国始徐，朱弓赤矢降祥符。 子孙枝叶昌而大，魁士名人载史书。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆。 泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 纷纷五代霸争雄，独起淮南立大功。 忠武盛名垂竹帛，千年齐国袭王封。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同归无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 义举王师下七闽，七闽效顺不交兵。 吏民按堵皆如故，箪食台浆喜出迎。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。",
      "translated_text": "Our primal ancestor laid the nation’s foundation in Xu,\nWith crimson bow and vermilion arrows descending auspicious signs.\nHis descendants flourished, branches vast and grand,\nHeroes and luminaries recorded in history’s annals.\n\n*Refrain:*\nNow with reverence we praise your sacred virtue,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nTake refuge in the supreme Dao.\n\nWith devoted hearts we bow and take refuge, proclaiming:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nMarvelously Responsive, Upright and Wise,\nGreat compassion, great mercy, great sanctity, great vows—\nresponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Jade Portal, Proclaiming Transformation and Upholding the Teachings, Supreme Immortal of Radiant Efficacy, Vast Salvation, Pure and Subtle, Cavernous and Mysterious, Profound and Tranquil, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith devoted hearts we bow and take refuge, proclaiming:\nMight shaking thunder, grace descending like rain and dew,\nspiritual power at ease, boundless blessings,\nGreat compassion, great mercy, great sanctity, great vows—\nresponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Jade Portal, Proclaiming Transformation and Upholding the Teachings, Supreme Immortal of Radiant Efficacy, Vast Salvation, Lofty and Serene, Profound and Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nAmid the tumult of Five Dynasties’ rival hegemonies,\nHe alone rose in Huainan to establish great merit.\nHis loyal and martial renown inscribed on bamboo and silk,\nFor a thousand years the state of Qi bore his royal legacy.\n\n*Refrain:*\nNow with reverence we praise your sacred virtue,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nTake refuge in the supreme Dao.\n\nWith devoted hearts we bow and take refuge, proclaiming:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nMarvelously Responsive, Upright and Wise,\nGreat compassion, great mercy, great sanctity, great vows—\nresponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Jade Portal, Proclaiming Transformation and Upholding the Teachings, Supreme Immortal of Radiant Efficacy, Vast Salvation, Pure and Subtle, Cavernous and Mysterious, Profound and Tranquil, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith devoted hearts we bow and take refuge, proclaiming:\nMight shaking thunder, grace descending like rain and dew,\nspiritual power at ease, boundless blessings,\nGreat compassion, great mercy, great sanctity, great vows—\nresponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Jade Portal, Proclaiming Transformation and Upholding the Teachings, Supreme Immortal of Radiant Efficacy, Vast Salvation, Lofty and Serene, Profound and Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nWith righteous armies he descended upon the Seven Min,\nThe Seven Min submitted without battle.\nOfficials and people remained undisturbed in their places,\nBaskets of food and cups of drink joyfully offered in welcome.\n\n*Refrain:*\nNow with reverence we praise your sacred virtue,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nTake refuge in the supreme Dao.",
      "overlap_context": "descending like rain and dew,\nspiritual power at ease, boundless blessings.\nGreat compassion, great mercy, great sanctity, great vows—\nresponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Jade Portal, Proclaiming Transformation and Upholding the Teachings, Supreme Immortal of Radiant Efficacy, Vast Salvation, Lofty and Serene, Profound and Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.",
      "start_char": 2769,
      "end_char": 3308,
      "start_sentence": 193,
      "end_sentence": 213,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.043052911758423,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君礼愿文.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 盛仪如旧喜东迎，赤子演池敢弄兵。 生长鳌峰真福地，顿令鸡犬复闻声。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人， 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 斩茅伐木建祠堂，祝寿朝朝夜夜香。 庙食王封男子愿，皇灵剡剡降威光。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 占断鳌峰一洞天，祠前景物尚依然。 藤萝交翠青云外，更有龙湫瀑布泉。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 五色云开现紫旗，木炉不坏瑞何奇。 天降双龙来拥卫，果然神物有凭依。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤。 功参日月，神通妙用，正直听明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 一朝雷雨起双龙，直泝溪流抵屿中。 化作木炉呈圣瑞，乡人因此立祠宫。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人",
      "translated_text": "With reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Golden Portal, Illuminating the Dao and Manifesting Virtue, Supreme Immortal of Radiant Efficacy, Vast Salvation, Pure and Subtle, Penetrating Mystery, Profound and Void, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine freedom in transformations, boundless blessings and virtue—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Jade Portal, Proclaiming Transformation and Upholding the Teachings, Supreme Immortal of Radiant Efficacy, Vast Salvation, Lofty and Serene, Profound and Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nGrand ceremonies as before, joyously welcomed in the east,\nHow dare the people of this land stir up strife?\nBorn and raised in Ao Peak’s true blessed land,\nSuddenly even chickens and dogs hear the divine voice again.\n\n*Refrain:*\nNow with reverence we praise your sacred virtue,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nTake refuge in the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Golden Portal, Illuminating the Dao and Manifesting Virtue, Supreme Immortal of Radiant Efficacy, Vast Salvation, Pure and Subtle, Penetrating Mystery, Profound and Void, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine freedom in transformations, boundless blessings and virtue—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Jade Portal, Proclaiming Transformation and Upholding the Teachings, Supreme Immortal of Radiant Efficacy, Vast Salvation, Lofty and Serene, Profound and Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nClearing brambles and felling trees to build the temple hall,\nMorning and night incense rises in prayers for longevity.\nWith imperial favor the temple receives offerings, fulfilling the people’s vows,\nThe august spirit’s radiance shines forth, descending in majestic splendor.\n\n*Refrain:*\nNow with reverence we praise your sacred virtue,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nTake refuge in the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Golden Portal, Illuminating the Dao and Manifesting Virtue, Supreme Immortal of Radiant Efficacy, Vast Salvation, Pure and Subtle, Penetrating Mystery, Profound and Void, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine freedom in transformations, boundless blessings and virtue—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Jade Portal, Proclaiming Transformation and Upholding the Teachings, Supreme Immortal of Radiant Efficacy, Vast Salvation, Lofty and Serene, Profound and Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nClaiming Ao Peak as a grotto-heaven,\nThe scenery before the temple remains unchanged:\nVines and creepers intertwine in emerald beyond the clouds,\nWhile dragon pools and waterfalls cascade in splendor.\n\n*Refrain:*\nNow with reverence we praise your sacred virtue,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nTake refuge in the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Golden Portal, Illuminating the Dao and Manifesting Virtue, Supreme Immortal of Radiant Efficacy, Vast Salvation, Pure and Subtle, Penetrating Mystery, Profound and Void, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine freedom in transformations, boundless blessings and virtue—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Jade Portal, Proclaiming Transformation and Upholding the Teachings, Supreme Immortal of Radiant Efficacy, Vast Salvation, Lofty and Serene, Profound and Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nFive-colored clouds part to reveal purple banners,\nThe wooden incense burner remains unscathed—what wondrous portent!\nTwo dragons descend from heaven to guard it,\nTruly a divine treasure with proof of its power.\n\n*Refrain:*\nNow with reverence we praise your sacred virtue,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nTake refuge in the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Golden Portal, Illuminating the Dao and Manifesting Virtue, Supreme Immortal of Radiant Efficacy, Vast Salvation, Pure and Subtle, Penetrating Mystery, Profound and Void, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine freedom in transformations, boundless blessings and virtue—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Jade Portal, Proclaiming Transformation and Upholding the Teachings, Supreme Immortal of Radiant Efficacy, Vast Salvation, Lofty and Serene, Profound and Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nOne morning, thunder and rain summoned twin dragons,\nThey ascended the stream straight to the islet’s heart.\nTransforming into a wooden incense burner, they displayed a sacred sign,\nAnd so the villagers built a temple in gratitude.\n\n*Refrain:*\nNow with reverence we praise your sacred virtue,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nTake refuge in the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Golden Portal, Illuminating the Dao and Manifesting Virtue, Supreme Immortal of Radiant Efficacy, Vast Salvation, Pure and Subtle, Penetrating Mystery, Profound and Void, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine freedom in transformations, boundless blessings and virtue—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.",
      "overlap_context": "nsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nWith righteous armies he descended upon the Seven Min,\nThe Seven Min submitted without battle.\nOfficials and people remained undisturbed in their places,\nBaskets of food and cups of drink joyfully offered in welcome.\n\n*Refrain:*\nNow with reverence we praise your sacred virtue,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nTake refuge in the supreme Dao.",
      "start_char": 3309,
      "end_char": 4621,
      "start_sentence": 214,
      "end_sentence": 257,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.40852403640747,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君礼愿文.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 古来风俗朴而淳，时号雍熙世太平。 曰雨曰旸常感应，请将两字上徽称。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心扳命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 昔日演溪迁庙祀，溪边一带小坡山。 桑田沧海时更变，父老于今号社坛。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君 政和祠宇大规模，龙首轩昂门地多。 檐外杉风声爽亮，堂前桂月影婆娑。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 无臭无声事杳冥，至和之德感神明。 重光夜现星灯瑞，九奏时闻天乐声。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，天直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道运德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 旗龙显迹因名地，祈雨王宫再立祠。 事载碑文人口诵，秋冬以报祭维时。 和：今将圣行虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直总明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 四方香火立群祠，派别支分不计时。 功德昭昭垂日月，质之父老口如碑。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人",
      "translated_text": "Supreme Immortal of the Jade Portal of the Nine Heavens, Proclaiming Transformations and Upholding the Dao, Illuminating the Spirit, Vastly Salvific, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nOf old, customs were simple and pure,\nAn age called harmonious, a world at peace.\nWhether rain or sunshine, ever responsive,\nWe beg to inscribe these two words upon your august title.\n\n*Response:*\nNow with reverence we praise your sagely virtue,\nMay your divine radiance witness this sincerity.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Golden Portal, Illuminating the Dao and Manifesting Virtue, Supreme Immortal of Radiant Efficacy, Vast Salvation, Pure and Subtle, Penetrating Mystery, Profound and Void, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine freedom in transformations, boundless blessings and virtue—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nSupreme Immortal of the Jade Portal of the Nine Heavens, Proclaiming Transformations and Upholding the Dao, Illuminating the Spirit, Vastly Salvific, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nIn days past, the temple was moved by Yan Brook,\nBeside the brook, a stretch of low hills.\nAs mulberry fields turned to seas through the ages,\nThe elders still call it the Earth Altar.\n\n*Response:*\nNow with reverence we praise your sagely virtue,\nMay your divine radiance witness this sincerity.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Golden Portal, Illuminating the Dao and Manifesting Virtue, Supreme Immortal of Radiant Efficacy, Vast Salvation, Pure and Subtle, Penetrating Mystery, Profound and Void, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine freedom in transformations, boundless blessings and virtue—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nSupreme Immortal of the Jade Portal of the Nine Heavens, Proclaiming Transformations and Upholding the Dao, Illuminating the Spirit, Vastly Salvific, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nThe temple of Zhenghe stands grand in scale,\nIts dragon-headed eaves soaring, its gates numerous.\nBeyond the eaves, the wind through the pines sounds crisp,\nBefore the hall, the osmanthus moon casts swaying shadows.\n\n*Response:*\nNow with reverence we praise your sagely virtue,\nMay your divine radiance witness this sincerity.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Golden Portal, Illuminating the Dao and Manifesting Virtue, Supreme Immortal of Radiant Efficacy, Vast Salvation, Pure and Subtle, Penetrating Mystery, Profound and Void, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine freedom in transformations, boundless blessings and virtue—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nSupreme Immortal of the Jade Portal of the Nine Heavens, Proclaiming Transformations and Upholding the Dao, Illuminating the Spirit, Vastly Salvific, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nNo scent, no sound—yet affairs transcend the unseen,\nThe virtue of perfect harmony moves the divine.\nRadiant lights appear at night, auspicious as star-lamps,\nNinefold music is heard at times, celestial melodies.\n\n*Response:*\nNow with reverence we praise your sagely virtue,\nMay your divine radiance witness this sincerity.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Golden Portal, Illuminating the Dao and Manifesting Virtue, Supreme Immortal of Radiant Efficacy, Vast Salvation, Pure and Subtle, Penetrating Mystery, Profound and Void, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine freedom in transformations, boundless blessings and virtue—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nSupreme Immortal of the Jade Portal of the Nine Heavens, Proclaiming Transformations and Upholding the Dao, Illuminating the Spirit, Vastly Salvific, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nThe banner-dragon’s manifestation gave the place its name,\nIn the royal palace for rain-prayers, a temple was built anew.\nThe events are recorded in stele inscriptions, recited by all,\nAutumn and winter mark the seasons of thanksgiving rites.\n\n*Response:*\nNow with reverence we praise your sagely deeds,\nMay your divine radiance witness this sincerity.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and wise—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nThe Nine Heavens’ Golden Portal, Illuminating the Dao and Manifesting Virtue, Supreme Immortal of Radiant Efficacy, Vast Salvation, Pure and Subtle, Penetrating Mystery, Profound and Void, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine freedom in transformations, boundless blessings and virtue—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings:\nSupreme Immortal of the Jade Portal of the Nine Heavens, Proclaiming Transformations and Upholding the Dao, Illuminating the Spirit, Vastly Salvific, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nTemples stand in every direction, their branches countless through the ages.\nMerit and virtue shine bright as sun and moon,\nAs attested by the elders, their words like living steles.\n\n*Response:*\nNow with reverence we praise your sagely virtue,\nMay your divine radiance witness this sincerity.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.",
      "overlap_context": "e Immortal of Radiant Efficacy, Vast Salvation, Pure and Subtle, Penetrating Mystery, Profound and Void, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine freedom in transformations, boundless blessings and virtue—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.",
      "start_char": 4621,
      "end_char": 5952,
      "start_sentence": 258,
      "end_sentence": 303,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.06038498878479,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君礼愿文.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 庙食于今四百年，蕙肴桂酒礼精专。 荣雩之卜如符契，德在人心感二天。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 曾效公山草木灵，嘉熙圣诏宠恩新。 勅封灵济金书侈，庙貌千年冠七闽。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤。 功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 岧尧石塔与云连，行满功成托旧缘。 惟愿法身常不灭，光明普照遍三千。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 定应禅师盘古佛，我曾参得此中禅。 任教直入真如境，一点灵台自豁然。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤。 功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 嘉定妖虫飞满野，诣祠禳谢即南迁。 是年梦占维鱼兆，黍稷仓箱积万年。 和：今将圣德虔诚赞，愿‘赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明。 大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。",
      "translated_text": "Celestial Golden Palaces’ Illuminator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.\n\nCelestial Jade Palaces’ Propagator of Transformation, Upholder of the Teachings, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nTemples have received offerings for four hundred years,\nWith orchid meats and cassia wine, rites performed with utmost devotion.\nAuspicious rain sacrifices match the omens as if by contract,\nVirtue resides in human hearts, moving both Heaven and Earth.\n\n*Response:*\nNow with reverence we praise your sagely virtue,\nMay your divine radiance witness this sincerity.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened,\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.\n\nCelestial Golden Palaces’ Illuminator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.\n\nCelestial Jade Palaces’ Propagator of Transformation, Upholder of the Teachings, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nOnce on Mount Gong, even grasses and trees bore numinous signs,\nThe imperial decree of Jiaxi bestowed new honors.\nThe title \"Lingji\" was conferred in golden script,\nThe temple’s grandeur has crowned the seven Min lands for a thousand years.\n\n*Response:*\nNow with reverence we praise your sagely virtue,\nMay your divine radiance witness this sincerity.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened,\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.\n\nCelestial Golden Palaces’ Illuminator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.\n\nCelestial Jade Palaces’ Propagator of Transformation, Upholder of the Teachings, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nTowering stone pagodas reach the clouds,\nWhen deeds are complete and merit fulfilled, old affinities are entrusted.\nMay the Dharma-body remain eternally undiminished,\nIts radiance universally illuminating the three thousand worlds.\n\n*Response:*\nNow with reverence we praise your sagely virtue,\nMay your divine radiance witness this sincerity.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened,\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.\n\nCelestial Golden Palaces’ Illuminator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.\n\nCelestial Jade Palaces’ Propagator of Transformation, Upholder of the Teachings, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nThe Chan master Dingying was the Primordial Buddha,\nI once attained this meditation.\nFreely entering the realm of suchness,\nA single point of the numinous mind becomes suddenly clear.\n\n*Response:*\nNow with reverence we praise your sagely virtue,\nMay your divine radiance witness this sincerity.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened,\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.\n\nCelestial Golden Palaces’ Illuminator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.\n\nCelestial Jade Palaces’ Propagator of Transformation, Upholder of the Teachings, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nIn the Jiading era, plague insects filled the fields,\nPeople came to the temple to pray and offer thanks, and the pests moved south.\nThat year, a dream omen of fish appeared,\nMillet and grain filled the granaries for ten thousand years.\n\n*Response:*\nNow with reverence we praise your sagely virtue,\nMay your divine radiance witness this sincerity.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened,\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.\n\nCelestial Golden Palaces’ Illuminator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.\n\nCelestial Jade Palaces’ Propagator of Transformation, Upholder of the Teachings, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.",
      "overlap_context": "attested by the elders, their words like living steles.\n\n*Response:*\nNow with reverence we praise your sagely virtue,\nMay your divine radiance witness this sincerity.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching Heaven and Earth, merit rivaling sun and moon,\nWondrous efficacy in divine transformations, upright and enlightened—\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.",
      "start_char": 5952,
      "end_char": 7255,
      "start_sentence": 304,
      "end_sentence": 349,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.51665997505188,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君礼愿文.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "光泽盐船遇恶风，中宵缆断失西东。 心香一瓣神如在，顿使船移水路通。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 无知蠢蠢是愚民，曲突胡为不徙薪。 现出救焚旗闪闪，反风阴助赖神灵。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高弘静冲湛妙应仁惠辅国佑民洪恩真君。 曾闻宝庆旱如焚，圭璧精诚神我闻。 几上红蛇形化现，声雷一鼓雨倾盆。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 呛峡民船打石滩，中流失楫已心寒。 急呼神号黄旗现，救援声闻顷刻间。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 绍定演溪瀑水流，田畴垫溺不堪忧。 时闻开港神兵出，又喜三登岁有收。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 人道淳熙风俗美，彗星胡乃出西方。 弭灾销变神明力，何必祆祥责保章。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随极赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。",
      "translated_text": "Amidst the night, a salt-laden vessel met fierce winds,\nIts mooring snapped, adrift—east or west, none knew.\nYet a single heart’s incense rose, the spirit near,\nAnd lo! The ship glided forth, the waterway made clear.\n\n*Response:*\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching heaven and earth, merit rivaling sun and moon,\nDivine transformations wondrously wrought, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nInitiator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palaces’ Propagator of Transformation, Upholder of the Teachings, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nFoolish and ignorant, the benighted folk,\nWhy bend the chimney yet leave the firewood in place?\nSuddenly, a banner of salvation flashes bright,\nAnd the wind reverses—dark aid through divine might.\n\n*Response:*\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching heaven and earth, merit rivaling sun and moon,\nDivine transformations wondrously wrought, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nInitiator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palaces’ Propagator of Transformation, Upholder of the Teachings, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nOnce in Baoqing, drought scorched the land like fire,\nJade tablets and sincerity reached the divine ear.\nUpon the altar, a red serpent’s form took shape,\nWith a single drum’s thunder, rain poured in torrents.\n\n*Response:*\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching heaven and earth, merit rivaling sun and moon,\nDivine transformations wondrously wrought, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nInitiator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palaces’ Propagator of Transformation, Upholder of the Teachings, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nA boat of Qiangxia struck the rocky shoals,\nMidstream, the oars lost—hearts turned cold with dread.\nYet at the urgent cry of the divine name, a yellow banner appeared,\nAnd rescue came in an instant, the call heard.\n\n*Response:*\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching heaven and earth, merit rivaling sun and moon,\nDivine transformations wondrously wrought, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nInitiator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palaces’ Propagator of Transformation, Upholder of the Teachings, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nIn Shaoding, the Yanxi’s torrents raged,\nFields drowned in sorrow, the land submerged in woe.\nThen came the news—divine soldiers cleared the channel,\nAnd joy returned as harvests thrived thrice over.\n\n*Response:*\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching heaven and earth, merit rivaling sun and moon,\nDivine transformations wondrously wrought, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nInitiator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palaces’ Propagator of Transformation, Upholder of the Teachings, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.\n\nIn the age of Chunxi, customs were pure and fine,\nYet why did a comet appear from the western sky?\nDisasters averted, calamities dissolved—through divine power,\nWhy seek omens from astrologers when gods bring harmony?\n\n*Response:*\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching heaven and earth, merit rivaling sun and moon,\nDivine transformations wondrously wrought, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nInitiator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.",
      "overlap_context": "s we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.\n\nCelestial Jade Palaces’ Propagator of Transformation, Upholder of the Teachings, Lofty and Serene, Profoundly Tranquil, Marvelously Responsive, Benevolent and Kind, Supporter of the Nation and Guardian of the People, Vastly Merciful True Lord.",
      "start_char": 7256,
      "end_char": 8592,
      "start_sentence": 350,
      "end_sentence": 395,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.146748781204224,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君礼愿文.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 自古文章可立身，绍兴符谶泄神灵。 两家太守辉相映，一榜于今贺得人。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命橙，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 朱衣梦报两书生，嘉定声名继绍兴。 甲子一周天数验，叔孙衣钵世相承。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄仲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 丈夫慷慨志功名，况是郎官应列星。 梦起传岩终大用，此中祖庙显精灵。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命，礼德配乾坤； 功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 璧水衣冠人物盛，两家生子贺人贤。 嘉熙混试天机巧，吉梦为传赋乐天。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正真聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 咸淳圣诏行乡举，主宰科名自有神。 两月月中符吉谶，天机漏泄笔端春。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 好施轻财称长者，谩言阴隐不相扶。 祠堂姓字传千古，六世登科五大夫。 和：今将圣德虔诚赞，愿赐威光鉴此忱。",
      "translated_text": "With reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palace Proclaiming Transformation and Upholding the Teachings, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Lofty and Serene, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nSince ancient times, literature could establish one’s standing,\nIn Shaoxing, omens revealed the numinous.\nTwo prefects’ glory shone in mutual reflection,\nOne examination roster now celebrates the worthy.\n\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching heaven and earth, merit rivaling sun and moon,\nDivine transformations wondrously wrought, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nInitiator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palace Proclaiming Transformation and Upholding the Teachings, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Lofty and Serene, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nIn crimson robes, dreams foretold two scholars’ rise,\nTheir fame in Jiading followed Shaoxing’s glory.\nSixty years a cycle, heaven’s reckoning proved true,\nThe lineage of Shusun’s mantle passed through generations.\n\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching heaven and earth, merit rivaling sun and moon,\nDivine transformations wondrously wrought, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nInitiator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palace Proclaiming Transformation and Upholding the Teachings, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Lofty and Serene, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nA man’s noble ambition aspires to merit and fame,\nHow much more when an official ranks among the stars.\nDreams arose from the cliffs, foretelling great service,\nHere in this ancestral temple, the numinous power shines.\n\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching heaven and earth, merit rivaling sun and moon,\nDivine transformations wondrously wrought, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nInitiator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palace Proclaiming Transformation and Upholding the Teachings, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Lofty and Serene, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nBy the Bi River, the gentry flourished,\nTwo families’ sons brought joy as worthy men.\nIn Jiaxi, the imperial examinations revealed heaven’s craft,\nAuspicious dreams foretold a poet’s rise.\n\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching heaven and earth, merit rivaling sun and moon,\nDivine transformations wondrously wrought, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nInitiator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palace Proclaiming Transformation and Upholding the Teachings, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Lofty and Serene, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nIn Xianchun, the imperial edict ordered local examinations,\nThe gods themselves preside over scholarly success.\nTwo moons in mid-month bore auspicious omens,\nHeaven’s secrets revealed in the brush’s springtime flourish.\n\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together\nReturn to the supreme Dao.\n\nWith reverent hearts we bow in homage:\nVirtue matching heaven and earth, merit rivaling sun and moon,\nDivine transformations wondrously wrought, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nInitiator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith reverent hearts we bow in homage:\nMight shaking like thunder, grace descending like rain and dew,\nDivine transformations freely wrought, boundless blessings and virtue,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palace Proclaiming Transformation and Upholding the Teachings, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Lofty and Serene, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nGenerous in giving, careless of wealth, he was called the elder,\nVain to say hidden virtue goes unrewarded.\nThe ancestral hall’s name and lineage endure through ages,\nSix generations passed the examinations, five attained high rank.\n\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.",
      "overlap_context": "d earth, merit rivaling sun and moon,\nDivine transformations wondrously wrought, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nInitiator of the Dao, Attainer of Virtue, Great Immortal Manifesting Numinous Power, Universally Beneficent, Subtly Penetrating the Mysteries, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.",
      "start_char": 8593,
      "end_char": 9911,
      "start_sentence": 396,
      "end_sentence": 441,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.72388434410095,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君礼愿文.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 典刑如在燕山窦，丹桂连芳发五枝。 继有人焉家积善，梦传吉梦产佳儿。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 青布成罗罗织翠，红尘化锦锦添华。 古来符谶呈祥瑞，愿泄神灵福万家。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 道原溥博出於天，河洛图书世所传。 天相斯文文未丧，争传灵宝是文仙。 和：今将圣德虔诚赞，愿赐威光鉴此忆。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，层德无边，大慈大悲，大圣大愿，随机赴感，发誓度人。 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 恬淡虚中自有神，积功累行乃成真。 黄庭默授长生诀，任我飞升驾玉轮。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 名登金阙字辉煌，学授东华祖正阳。 上掌天文行院事，职分司禄佐文昌。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人",
      "translated_text": "May all sentient beings together return to the supreme Dao/Way.\nWith devoted heart we bow and take refuge,\nWhose virtue matches heaven and earth, whose merit rivals sun and moon,\nWhose numinous power works wondrous transformations, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Golden Palace Illuminating the Dao/Way and Attaining Virtue, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Pure and Subtle, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith devoted heart we bow and take refuge,\nWhose might shakes thunder, whose grace descends as rain and dew,\nWhose numinous power is unhindered, whose blessings and virtue are boundless,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palace Proclaiming Transformation and Upholding the Teachings, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Lofty and Serene, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nExemplary conduct endures like the House of Dou in Yanshan,\nFive branches of cinnamon bloom in fragrant succession.\nHeirs arise in families that accumulate goodness,\nAuspicious dreams foretell the birth of noble sons.\n\n*Refrain:*\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together return to the supreme Dao/Way.\n\nWith devoted heart we bow and take refuge,\nWhose virtue matches heaven and earth, whose merit rivals sun and moon,\nWhose numinous power works wondrous transformations, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Golden Palace Illuminating the Dao/Way and Attaining Virtue, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Pure and Subtle, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith devoted heart we bow and take refuge,\nWhose might shakes thunder, whose grace descends as rain and dew,\nWhose numinous power is unhindered, whose blessings and virtue are boundless,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palace Proclaiming Transformation and Upholding the Teachings, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Lofty and Serene, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nGreen cloth woven into gauze shimmers with kingfisher hues,\nRed dust transformed into brocade glows with added splendor.\nSince ancient times, prophetic omens have heralded auspicious signs,\nMay the divine spirit’s blessings overflow to ten thousand households.\n\n*Refrain:*\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together return to the supreme Dao/Way.\n\nWith devoted heart we bow and take refuge,\nWhose virtue matches heaven and earth, whose merit rivals sun and moon,\nWhose numinous power works wondrous transformations, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Golden Palace Illuminating the Dao/Way and Attaining Virtue, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Pure and Subtle, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith devoted heart we bow and take refuge,\nWhose might shakes thunder, whose grace descends as rain and dew,\nWhose numinous power is unhindered, whose blessings and virtue are boundless,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palace Proclaiming Transformation and Upholding the Teachings, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Lofty and Serene, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nThe Dao/Way’s origin is vast and boundless, descending from heaven,\nThe River Chart and Luo Writ have been transmitted through the ages.\nHeaven favors this culture, which shall not perish,\nAll proclaim the Numinous Treasure as the Literary Immortal.\n\n*Refrain:*\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this remembrance.\nMay all sentient beings together return to the supreme Dao/Way.\n\nWith devoted heart we bow and take refuge,\nWhose virtue matches heaven and earth, whose merit rivals sun and moon,\nWhose numinous power works wondrous transformations, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Golden Palace Illuminating the Dao/Way and Attaining Virtue, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Pure and Subtle, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith devoted heart we bow and take refuge,\nWhose might shakes thunder, whose grace descends as rain and dew,\nWhose numinous power is unhindered, whose layered virtue is boundless,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palace Proclaiming Transformation and Upholding the Teachings, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Lofty and Serene, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nSerene and empty within, the spirit naturally abides,\nAccumulating merit and cultivating conduct perfects the true.\nThe *Huangting* silently imparts the secret of longevity,\nFreely I ascend, riding the jade wheel.\n\n*Refrain:*\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together return to the supreme Dao/Way.\n\nWith devoted heart we bow and take refuge,\nWhose virtue matches heaven and earth, whose merit rivals sun and moon,\nWhose numinous power works wondrous transformations, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Golden Palace Illuminating the Dao/Way and Attaining Virtue, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Pure and Subtle, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith devoted heart we bow and take refuge,\nWhose might shakes thunder, whose grace descends as rain and dew,\nWhose numinous power is unhindered, whose blessings and virtue are boundless,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palace Proclaiming Transformation and Upholding the Teachings, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Lofty and Serene, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nHis name inscribed in the Golden Palace shines resplendent,\nHis learning received from the Eastern Flower Patriarch Zhengyang.\nHe oversees celestial patterns as Director of the Celestial Bureau,\nHis office dispenses emoluments, assisting Wenchang.\n\n*Refrain:*\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together return to the supreme Dao/Way.\n\nWith devoted heart we bow and take refuge,\nWhose virtue matches heaven and earth, whose merit rivals sun and moon,\nWhose numinous power works wondrous transformations, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Golden Palace Illuminating the Dao/Way and Attaining Virtue, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Pure and Subtle, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith devoted heart we bow and take refuge,\nWhose might shakes thunder, whose grace descends as rain and dew,\nWhose numinous power is unhindered, whose blessings and virtue are boundless,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.",
      "overlap_context": ", Lofty and Serene, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nGenerous in giving, careless of wealth, he was called the elder,\nVain to say hidden virtue goes unrewarded.\nThe ancestral hall’s name and lineage endure through ages,\nSix generations passed the examinations, five attained high rank.\n\nNow with reverence we chant the sacred virtue’s praise,\nMay your majestic radiance witness this devotion.",
      "start_char": 9911,
      "end_char": 11237,
      "start_sentence": 442,
      "end_sentence": 485,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.788564682006836,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君礼愿文.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 默参玄学东华洞，玉阙朝班拜紫微。 南极注生权上相，职兼地府领诸司。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 九月时当延寿节，云开金阙上青天。 我今虎拜长生殿，共祝尧云百万年。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，德配乾坤，功参日月，神通妙用，正直聪明，大慈大悲，大圣大愿，随机赴感，发誓度人 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君。 志心皈命礼，威震雷霆，泽垂雨露，神通自在，福德无边，大慈大悲，大圣大愿，随机赴感，发誓度人 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君。 喜逢大庆中元节，神降嵩高泄地灵。 玉阙金炉香袅袅，彩云捧出老人星。 和：今将圣德虔诚赞，愿赐威光鉴此忱。 愿共诸有情，同皈无上道。 志心皈命礼，灵济殿内，燕喜堂中，性禀谦柔，利同坤厚，执勤后德，内助阴功，羽盖霓裳，刻紫字於缑氏女仙之列，金房玉室，授黄庭於南岳夫人之前，泽及群生，祀延百世，至圣至灵，至柔至静泾国夫人顺助仁惠贞应仙妃。 头上金冠戴七星，七龙五凤纷相迎。 愿将玉醴金浆水，洒作人间雨露仁。 志心皈命礼，灵济宫中，燕喜堂内，躬持节俭，政在忧勤，乃资后德之良，俾式坤仪之助，关雎之求淑女，以无险诐私谒之心，鸡呜之得贤妃，盖有儆戒相成之道，功成内辅，德被群生，至圣至灵，至柔至静卫国夫人善助慈懿恭静仙妃。 特凭玉女为通传，位正宫闱四教全。 万物资生无不利，至柔至静配坤元。 志心皈命礼，灵济宫中，亲睦堂内，莫严於父，所配者天，须知莫报之恩，自有尊归之道，况御王册命，答扬文武之光，开国成家，独任伊周之寄，功全社稷，福及子孙，至圣至灵，至尊至严神父齐王忠武翊亮真君。 诗礼谆谆过鲤庭，内助家法最严明。 堂前且学莱衣戏，寿祝千春献兕觥。 志心皈命礼，灵济宫内，亲睦堂中，圣善明誓，柔闲静专，位正中宫，功成内助，俭德着而下化，盛烈载於声诗，阴礼修而教行，芳名光於史册，既念亲慈之爱，敢伸家庆之仪，至圣至灵，至慈军爱神母仁寿淑善仙妃。 母氏劬劳不敢忘，至哉坤德合无疆。 永遵慈训传家法，载咏思齐诗四章。 志心皈命礼，灵济宫中，亲睦堂内，埙箎迭奏，羽翼相成，兼乃文乃武之才，得宜兄宜弟之义，列茅分土，守藩加食邑之荣，崇德报功，同日拜王封之侈，亲亲不怨，绰绰有余，至圣至灵，至友至爱神兄列位郡王。 华萼楼前积善乡，昔年同日侈封王。 一门孝友旌高节，遗爱千年亲睦堂。 志心皈命礼，灵济宫中，燕喜堂内，惟裳整肃，绫帐森严，家有家妇之尊，礼锺夫人之爱，以文辞着，素闻谢氏女之才，以德行称，兼有锺夫人之美，躬持四教，福锡庶民，至圣至灵，至柔至静神兄列位圣眷夫人。",
      "translated_text": "Celestial Jade Palace Proclaiming Transformation and Upholding the Teachings, Supreme Immortal Manifesting Numinous Power, Vastly Beneficent, Lofty and Serene, Profoundly Void, Subtly Responsive, Benevolent and Kind, Assisting the Nation and Protecting the People, Greatly Merciful True Lord.\n\nSilently contemplating the mysterious learning of the Eastern Flowery Realm,\nIn the Jade Palace’s court ranks, bowing to the Purple Tenuity.\nSouthern Culmen governs life, holding the highest office,\nWith duties spanning the earthly realm and leading all bureaus.\n\n*Response:*\nNow with reverent heart we extol your sacred virtue,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together take refuge in the supreme Dao/Way.\n\nWith devoted heart we bow and take refuge,\nWhose virtue/power matches heaven and earth, whose merit parallels sun and moon,\nWhose numinous power works wondrous transformations, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Golden Palace Illuminating the Dao/Way and Attaining Virtue, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Pure and Subtle, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith devoted heart we bow and take refuge,\nWhose might shakes thunder, whose grace descends as rain and dew,\nWhose numinous power is unhindered, whose blessings and virtue are boundless,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palace Proclaiming Transformation and Upholding the Teachings, Supreme Immortal Manifesting Numinous Power, Vastly Beneficent, Lofty and Serene, Profoundly Void, Subtly Responsive, Benevolent and Kind, Assisting the Nation and Protecting the People, Greatly Merciful True Lord.\n\nIn the ninth month, when the Season of Longevity arrives,\nClouds part to reveal the Golden Palace ascending to the azure heavens.\nNow in the Hall of Longevity, I bow like a tiger,\nTogether we pray for Yao’s reign to endure a million years.\n\n*Response:*\nNow with reverent heart we extol your sacred virtue,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together take refuge in the supreme Dao/Way.\n\nWith devoted heart we bow and take refuge,\nWhose virtue/power matches heaven and earth, whose merit parallels sun and moon,\nWhose numinous power works wondrous transformations, upright and wise,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Golden Palace Illuminating the Dao/Way and Attaining Virtue, Supreme Immortal Manifesting Numinous Power, Universally Beneficent, Pure and Subtle, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith devoted heart we bow and take refuge,\nWhose might shakes thunder, whose grace descends as rain and dew,\nWhose numinous power is unhindered, whose blessings and virtue are boundless,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings—\nCelestial Jade Palace Proclaiming Transformation and Upholding the Teachings, Supreme Immortal Manifesting Numinous Power, Vastly Beneficent, Lofty and Serene, Profoundly Void, Subtly Responsive, Benevolent and Kind, Assisting the Nation and Protecting the People, Greatly Merciful True Lord.\n\nRejoicing in the grand celebration of the Zhongyuan Festival,\nThe gods descend upon Mount Song, revealing earth’s numinous power.\nIn the Jade Palace, golden censers waft fragrant smoke,\nColored clouds bear forth the Old Man Star.\n\n*Response:*\nNow with reverent heart we extol your sacred virtue,\nMay your majestic radiance witness this devotion.\nMay all sentient beings together take refuge in the supreme Dao/Way.\n\nWith devoted heart we bow and take refuge,\nWithin the Hall of Numinous Aid, in the Hall of Joyous Feasting,\nWhose nature embodies humility and gentleness, whose beneficence equals earth’s depth,\nDiligent in the virtue of the inner court, assisting with hidden merit,\nAdorned with feathered canopy and rainbow robes,\nInscribed in purple among the immortal maidens of Mount Gou,\nIn golden chambers and jade halls, receiving the *Huangting* scripture before the Lady of Southern Marchmount,\nWhose grace extends to all beings, whose sacrifices endure a hundred generations,\nMost sacred, most numinous, most yielding, most serene—\nJingguo Lady, Compassionate Assistant, Benevolent and Chaste, Responsive Immortal Consort.\n\nUpon her head, a golden crown adorned with the Seven Stars,\nSeven dragons and five phoenixes welcome her in profusion.\nMay she pour forth jade nectar and golden libations,\nTo sprinkle as rain and dew upon the human world.\n\nWith devoted heart we bow and take refuge,\nWithin the Hall of Numinous Aid, in the Hall of Joyous Feasting,\nWho personally upholds frugality, governing with diligent care,\nThereby providing the goodness of inner virtue, enabling the earth’s nurturing aid,\nSeeking a virtuous consort as in the *Guanju* ode, without guile or private favor,\nObtaining a worthy consort as in the *Jiming* ode, ever vigilant in mutual support,\nWhose merit completes inner assistance, whose virtue spreads to all beings,\nMost sacred, most numinous, most yielding, most serene—\nWeiguo Lady, Kindly Assistant, Reverent and Tranquil Immortal Consort.\n\nSpecially entrusted to the Jade Maiden for transmission,\nHer position rightful in the inner palace, her teachings complete in the four virtues.\nAll things rely on her for life, none fail to prosper,\nMost yielding, most serene, she matches earth’s primal power.\n\nWith devoted heart we bow and take refuge,\nWithin the Hall of Numinous Aid, in the Hall of Kinship,\nNone more revered than the father, whose consort is heaven,\nOne must know the debt of gratitude that cannot be repaid, yet follows the Way of due reverence,\nMoreover, receiving the king’s decree, answering with civil and martial glory,\nEstablishing the state and founding the household, entrusted with the legacy of Yi and Zhou,\nWhose merit secures the altars of the land, whose blessings extend to descendants,\nMost sacred, most numinous, most venerable, most solemn—\nDivine Father, Prince of Qi, Loyal and Martial, Illustrious and Bright True Lord.\n\nWith earnest teachings of ritual and propriety passed in the Hall of the Carp,\nThe inner assistance of family precepts is most strict.\nBefore the hall, learning the play of the patterned robe,\nA thousand springs of longevity are wished, presented with rhinoceros cups.\n\nWith devoted heart we bow and take refuge,\nWithin the Hall of Numinous Aid, in the Hall of Kinship,\nMost sagely, most kind, with bright vows, gentle and serene,\nHer position rightful in the central palace, her merit complete in inner assistance,\nHer frugal virtue manifest, transforming those below,\nHer glorious deeds recorded in poetry and song,\nThe yin rites perfected, her teachings spread,\nHer fragrant name shining in the historical records,\nMindful of a mother’s loving care,\nDaring to express the rites of family celebration,\nMost sacred, most numinous, most compassionate, most loving—\nDivine Mother, Benevolent and Longevous, Gentle and Kind Immortal Consort.\n\nA mother’s toil must never be forgotten,\nHow vast is earth’s virtue, boundless in harmony.\nForever upholding her compassionate teachings, transmitting family precepts,\nSinging the four chapters of the *Sizi* ode in remembrance.\n\nWith devoted heart we bow and take refuge,\nWithin the Hall of Numinous Aid, in the Hall of Kinship,\nOcarina and flute play in alternation, wings supporting one another,\nPossessing both civil and martial talents,\nFulfilling the virtues of elder and younger brothers,\nEnfeoffed with lands and titles, guarding the frontier with added honors,\nExalting virtue and repaying merit, on the same day receiving royal titles of splendor,\nCherishing kin without resentment, ever abundant,\nMost sacred, most numinous, most fraternal, most affectionate—\nDivine Elder Brothers, the Enfeoffed Princes.\n\nBefore the Hall of Flourishing Blossoms, the village of accumulated goodness,\nIn former years, on the same day, they received royal titles of splendor.\nA family of filial piety and fraternal love, their lofty integrity commended,\nTheir loving legacy enduring a thousand years in the Hall of Kinship.\n\nWith devoted heart we bow and take refuge,\nWithin the Hall of Numinous Aid, in the Hall of Joyous Feasting,\nAdorned in proper robes, surrounded by silken curtains,\nThe family reveres its matriarch, rites accord with the lady’s love,\nHer literary talents renowned, like the Lady of the Xie clan,\nHer virtuous conduct praised, like the Lady of the Zhong clan,\nPersonally upholding the four teachings, bestowing blessings upon the people,\nMost sacred, most numinous, most yielding, most serene—\nDivine Elder Brothers’ Wives, the Sacred Consorts.",
      "overlap_context": "inous Power, Universally Beneficent, Pure and Subtle, Profoundly Void, Marvelously Responsive, Benevolent and Kind, Protector of the Nation and Shelter of the People, Vastly Merciful True Lord.\n\nWith devoted heart we bow and take refuge,\nWhose might shakes thunder, whose grace descends as rain and dew,\nWhose numinous power is unhindered, whose blessings and virtue are boundless,\nGreat mercy, great compassion, great sanctity, great vows,\nResponding to circumstances, pledged to deliver all beings.",
      "start_char": 11237,
      "end_char": 12585,
      "start_sentence": 486,
      "end_sentence": 522,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.34790396690369,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君礼愿文.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "上奉慈颜喜友于，满堂和气笑愉偷。 尊卑有分传家法，稍似卯冠不入庐。 志心皈命礼，灵济宫中，亲睦堂内，后昆垂裕，百世传芳，子侄名贤，宜芝兰之毓秀，祖孙盛事，喜簪笋之尚存，载歌葛虆之诗，爰咏螽斯之德，至圣至灵，至顺至敬神子神孙列位公侯。 清白遗风教尚存，声名高显大于门。 公侯自有公侯种，阴惊元来在子孙。 志心皈命礼，灵济殿内，亲睦堂中，教有大伦。 睦亲三族，受天之禄食千锺，以至万锺，列地而封，先同姓而后异姓，既辱刘将军弘深之爱，还知富郑公修谨之贤，名重于时，赏延于世＋至圣至灵，至亲至仁神舅神婿列位公侯。 渭阳舅氏母之亲，曾知珠玉朗然明。 更为编序昌黎集，李汉文章播盛名。 志心皈命礼，灵济宫中，燕喜堂内，阖闱整肃，法度严明，为绤为絺，志在女工之事，采苹采藻，教以妇德为先，礼 宜奉於舅姑，孝不忘於父母，至圣至灵，至敬至顺神女神妇列位仙妃。 七篇女戒曲相从，惟舅惟姑父母同。 佩帨苣兰如所赐，执勤妇德肃而雍。 志心皈命礼，灵济殿内，燕喜堂中，云幕逍遥，月宫富贵，其服济济，振绣衣而被桂裳，其状峨峨，缀明珠而戴金翠，美矣丽矣，温乎烨乎。 愿泄巫山之灵，永为福地之相，至圣至灵，自由自在合殿列位圣眷夫人。 珠履金钗满掖庭，态秾意远淑而贞。 采苹于沼公侯事，不比椒房虢与秦。 志心皈命礼，灵济殿内，燕喜堂中，日曜为魂，月曜为魄，太一有监生之典，天一有注生之司，星宿储精感长庚而入梦，山川孕秀喜嵩岳之降神，抱来天上之麒麟，并作人间之惊惊，至圣至灵，随感随应太一监生神后，天一注生神后，列位合属夫人。 吉梦维何喜弄璋，鳌峰秀气发祥光。 子生孙兮孙生子，本支万世炽而昌。 志心皈命礼，龙首庙庭，鳌峰圣境，职分百辟，位列九卿，司禄乃文昌之权衡，司福乃注生之主宰，训遵洪范，曰寿曰富曰康宁，颂献閟宫，俾炽俾昌俾耆艾，人人胥庆，在在蒙恩，至圣至灵，如响如答，左右福禄列位真司主宰。 福禄双星现斗枢，职分左右进贤书。 世家积善称君子，子子孙孙庆有余。 志心皈命礼，龙首庙庭，鳌峰圣境，电光闪闪，云气高高，天何言哉，声雷霆而震怒，地之利也，资雨露以相生，神机运於不测之中，妙化斡於无形之境，恩沾九有，泽被群生，至圣至灵，则变则化，雷公电母风伯雨师，本宫昭灵，孚济龙王，及五方社令，行雨龙神等众。 龙乘云气固能灵，声动雷霆万里惊。 天下苍生霖雨愿，顿令头角起峥嵘。 志心皈命礼，鳌峰圣境，龙首庙庭，乃圣乃神，在左在右，或献优旃之技，或精管辂之能，掌膳者物用八珍，典乐者声谐六律，兵十六卫，举皆出将之才，骑三百人，各有封侯之相，威灵显赫，图像生狞，至圣至灵，有严有翼，合殿合属一切威灵。 以劳定国法施民，香火因缘配庙庭。 将相声名长在世，千年图像赞麒麟。 举。 礼足各长跪，虔诚忏悔。 志心皈身皈神皈命九天灵济真君、合殿威灵仙众。 伏望圣慈，同垂巨泽，普降洪恩。 以今斋恪，虔诚皈投忏悔。 伏闻祸福无门，惟人自召，吉凶有兆，如影随形。 善者恶之符，恶者善之信。 为善者，五行扶我，司命与我。 为恶者，凶气覆之，恶星照之。",
      "translated_text": "In reverence above, the matriarch’s countenance delights in fraternal love,\nThe hall brims with harmonious qi, laughter and joy steal unseen.\nRank and order preserve the family’s transmitted law,\nEven the semblance of a cap worn at dawn bars one from the chamber.\n\nWith devoted heart we bow and take refuge,\nWithin the Hall of Numinous Aid, in the Hall of Kinship,\nDescendants inherit abundance, a fragrant legacy spanning a hundred generations,\nSons and nephews renowned for virtue, fit to nurture orchids and irises,\nGrandfathers and grandsons share in grand affairs, rejoicing in the enduring bamboo and shoots,\nSinging the ode of *Gelu* and *Zong*,\nExtolling the virtue of *Zhongsi*—\nMost sacred, most numinous, most compliant, most reverent—\nDivine Sons and Divine Grandsons, the Noble Lords.\n\nA legacy of purity and integrity, its teachings endure,\nRenown resounds, magnifying the gate.\nNobles beget nobles, their lineage assured,\nFor hidden blessings lie ever in sons and grandsons.\n\nWith devoted heart we bow and take refuge,\nWithin the Hall of Numinous Aid, in the Hall of Kinship,\nTeachings uphold the great bonds of kinship.\nHarmonizing the three clans, they receive Heaven’s emolument—\nA thousand measures, even ten thousand measures,\nEnfeoffed upon the land, first among those of the same surname, then among others,\nHaving humbly received the profound love of General Liu Hong,\nAnd knowing the prudent virtue of Minister Fu of Zheng,\nTheir names weighty in their time, their rewards enduring through the ages—\nMost sacred, most numinous, most kindred, most benevolent—\nDivine Uncles and Divine Sons-in-Law, the Noble Lords.\n\nThe maternal uncle of Weiyang, kin to the mother,\nOnce knew the radiant luster of pearls and jade.\nFurther compiling the works of Han Yu of Changli,\nLi Han’s literary fame spread far and wide.\n\nWith devoted heart we bow and take refuge,\nWithin the Hall of Numinous Aid, in the Hall of Joyous Feasting,\nThe inner chambers ordered and solemn, laws and disciplines strict,\nWhether in coarse or fine cloth, their purpose lies in women’s work,\nGathering duckweed and pondweed, teaching that wifely virtue comes first,\nRites dictate reverence for parents-in-law,\nFilial piety never forgets one’s own parents—\nMost sacred, most numinous, most reverent, most compliant—\nDivine Daughters and Divine Wives, the Immortal Consorts.\n\nSeven chapters of the *Nü Jie* follow in harmony,\nHonoring uncles and parents-in-law as one’s own parents.\nThe sash and kerchief, the orchid and angelica, bestowed as gifts,\nDiligence in wifely virtue, solemn and harmonious.\n\nWith devoted heart we bow and take refuge,\nWithin the Hall of Numinous Aid, in the Hall of Joyous Feasting,\nCloud-canopied and carefree, the Moon Palace’s opulence,\nTheir robes resplendent, embroidered garments draped in cassia and osmanthus,\nTheir forms majestic, adorned with luminous pearls and golden kingfisher plumes,\nFair and radiant, warm and resplendent.\nMay the numen of Wu Mountain be dispelled,\nForever serving as the auspicious omen of this blessed land—\nMost sacred, most numinous, free and unbound—\nThe Sacred Consorts of the Entire Hall.\n\nPearl-trimmed slippers and golden hairpins fill the palace courts,\nTheir bearing rich yet refined, virtuous and chaste.\nGathering duckweed from the pond, the affairs of lords and nobles,\nUnlike the consorts of the Jia or the Guo, who brought ruin to the palace.\n\nWith devoted heart we bow and take refuge,\nWithin the Hall of Numinous Aid, in the Hall of Joyous Feasting,\nThe sun as spirit, the moon as soul,\nTaiyi presides over the Register of Life,\nTianyi governs the Office of Birth,\nThe constellations store their essence, moved by Venus to enter dreams,\nMountains and rivers nurture brilliance, rejoicing in the descent of numen from Mount Song,\nBearing the celestial qilin,\nAll become marvels among mortals—\nMost sacred, most numinous, responsive to every invocation—\nTaiyi, Overseer of Life, Tianyi, Registrar of Birth, and all attendant consorts.\n\nWhat auspicious dream heralds the joy of a son’s birth?\nThe numinous peak’s vital qi emits propitious light.\nSons beget grandsons, grandsons beget sons,\nThe lineage flourishes for ten thousand generations, thriving and prosperous.\n\nWith devoted heart we bow and take refuge,\nIn the Dragon-Headed Temple’s courtyard, the Sacred Realm of Ao Peak,\nTheir offices span the hundred ranks, their positions among the nine ministers,\nOverseeing emolument as the authority of Wenchang,\nGoverning fortune as the sovereign of the Registrar of Birth,\nTheir teachings follow the *Hongfan*:\n\"Long life, wealth, health, and peace,\"\nTheir praises offered in the *Biyong*:\n\"May they thrive, prosper, and reach venerable age,\"\nEvery person rejoicing, every place blessed—\nMost sacred, most numinous, responsive as echo to sound—\nThe True Lords and Sovereigns of Left and Right Fortune and Emolument.\n\nThe twin stars of Fortune and Emolument appear at the pivot of the Dipper,\nTheir offices to the left and right advance the worthy.\nA family of accumulated goodness, known as gentlemen,\nSons and grandsons abound in blessings.\n\nWith devoted heart we bow and take refuge,\nIn the Dragon-Headed Temple’s courtyard, the Sacred Realm of Ao Peak,\nLightning flashes, clouds rise high,\nHeaven speaks not, yet its voice thunders in wrath,\nThe earth’s bounty relies on rain and dew to nurture life,\nDivine mechanisms operate in the unfathomable,\nWondrous transformations turn in the formless,\nGrace descends upon the nine regions,\nBlessings extend to all living beings—\nMost sacred, most numinous, transforming and changing—\nLord Thunder, Mother Lightning, Earl Wind, Master Rain,\nThe Illustrious Dragon Kings of this temple,\nThe Earth Gods of the Five Directions,\nThe Rain-Bringing Dragon Spirits, and all others.\n\nDragons ride the clouds, their power assured,\nTheir voices shake the thunder for ten thousand miles.\nThe world’s people long for timely rain,\nAt once their fortunes rise, their horns emerge—\n\nWith devoted heart we bow and take refuge,\nIn the Sacred Realm of Ao Peak, the Dragon-Headed Temple’s courtyard,\nMost sacred, most numinous, to the left and right,\nSome present their jesting arts,\nOthers excel in the arts of the *guanlu*,\nThose who oversee the kitchen wield the eight delicacies,\nThose who direct music harmonize the six pitches,\nThe Sixteen Guardians of the Army, all born with the talents of generals,\nThe Three Hundred Cavalry, each destined for enfeoffment,\nTheir majesty and numen manifest,\nTheir images fierce and vivid—\nMost sacred, most numinous, stern and protective—\nAll the numinous powers of the entire hall.\n\nFor their labors in stabilizing the state and enacting laws for the people,\nTheir incense and karmic ties enshrine them in the temple.\nThe renown of generals and ministers endures through the ages,\nTheir images praised for a thousand years, likened to the qilin.\n\nThe rites complete, each rises and kneels in devotion,\nSincerely repenting with reverence.\nWith devoted heart, body, spirit, and life, we take refuge\nIn the Nine Heavens’ True Lord of Numinous Aid and all the majestic immortals of the hall.\n\nWe humbly beseech the sacred compassion,\nTo bestow vast blessings and descend abundant grace.\nThrough this day’s solemn fast and devotion,\nWe sincerely take refuge and repent.\nWe have heard that misfortune and fortune have no fixed gate,\nOnly summoned by one’s own actions;\nOmens of good and ill follow like shadows.\nGood serves as the tally of evil,\nEvil as the proof of good.\nFor those who do good,\nThe Five Phases support them, the Overseer of Fate befriends them.\nFor those who do evil,\nMalevolent qi overwhelms them, baleful stars shine upon them.",
      "overlap_context": "\nWithin the Hall of Numinous Aid, in the Hall of Joyous Feasting,\nAdorned in proper robes, surrounded by silken curtains,\nThe family reveres its matriarch, rites accord with the lady’s love,\nHer literary talents renowned, like the Lady of the Xie clan,\nHer virtuous conduct praised, like the Lady of the Zhong clan,\nPersonally upholding the four teachings, bestowing blessings upon the people,\nMost sacred, most numinous, most yielding, most serene—\nDivine Elder Brothers’ Wives, the Sacred Consorts.",
      "start_char": 12586,
      "end_char": 13855,
      "start_sentence": 523,
      "end_sentence": 560,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.138460636138916,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君礼愿文.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "虽天网之难逃，在人心之知觉。 今辰伏念，一切众生，归心向道，至诚感神。 躬礼真聪，首陈自责，爰从曩劫，迨至今生。 耻过作非，去顺效逆，变情徇势，挟诈抵巇。 以幽阴诡侧而行其奸，以毒酷残忍而肆其害。 颠倒梦想，昏迷乎利名智之场。 杀盗邪淫，沉汨於贪嗔痴之境。 大则欺於天地，幽则负於神明。 咨暑怨寒，呵风骂雨。 或对星辰而便利，或对日月而裸裎。 或指虹霓，或盟山海。 破坏庙社，触秽道场。 不知身心口意之非，不安士农工贾之分。 不崇三宝，不习五常。 为人谋而不忠，与朋交而不信。 事亲非孝，背主忘恩。 为富不仁，重财不义。 谓祭无益，谓暴无伤。 谓敬不足行，谓言不足畏。 犯上作乱，好勇疾贫，斥陷忠良，侵凌孤弱。 欺公灭私，薄人厚己。 教唆词讼，结构冤雠。 侮慢自贤，傲虐自作。 不明乎善，不诚乎身。 小弁作而或父子之恩亏，常鄂废而或兄弟之情缺。 国俗败而兴谷风之刺，骨肉怨而歌角弓之诗。 既知罪恶之贯盈，恭对慈悲而忏悔。 人谁无过，过而能改，每怀战战栗栗之忧。 神无常享，享于克诚，少致切切拳拳之悃。 伏愿至仁孚佑，大道垂怜，赦其已往之愆，锡以方来之祉。 群方胥庆，率土蒙恩。 当今之日太平，灾不生，祸不作。 诸福之物毕至，老者壮，少者强。 久钦灵德之威光，用作济民之事业。 臣等至心稽首，再拜礼谢灵济 二位真君。 举三礼谢 弟子一心稽首礼谢 九天金阙真君。 弟子一心稽首礼谢 九天玉阙真君。 弟子一心稽首礼谢 圣父翊亮真君。 礼谢已周，忏情毕露，恭依妙典，干冒威聪。 谨按丹诚，披陈素愿。 伏愿圣慈俯赐鉴临。 一愿当今皇帝寿，和寿与天齐万万春。 二愿臣僚资禄位，和风云千载庆嘉亨。 三愿儒冠多富贵，和名登天府作公卿。 四愿农民勤稼穑，和自今岁岁喜三登。 五愿百工精技艺，和待诏金门听玉音。 六愿生财有大道，和千户封君可比伦。 七愿风调并雨顺，和普天率土贺升平。 八愿香火常隆盛，和千年庙貌显威灵。 九愿九天加锡命，和玉佩锵趋拜紫宸。 十愿十方诸信善，和皈依三宝各虔诚。 上来恭礼赞文，功德已周。 道场众等人，各虔诚再伸启白： 伏闻兢兢业业，自惭童渎之再三。 赫赫明明，恭睹威颜之咫尺。 铭心知感，稽首扬言。 德之着者，曰显灵昭灵，功可推而为溥济博济。 津梁众苦，日月群迷。 今辰钦奉圣旨，修设酬恩祈福道场。 臣等恭对真聪，宣扬妙范。 少伸三沐三熏之敬，敢殚一瞻一礼之恭。 神听无私，情由可鉴。 用涤曩劫今生之罪业，愿作见在未来之果因。 有始有终，无恶无歌。 知可及，愚不可及； 神化之，民使宜之。 行满功圆，可以进於玉室丹台之上。 气存神正，可以开於紫阳云锦之囊。 信女善男，咸得长生。 亿曾万祖，皆即受度。 遍及幽冥之异类，尽归缥缈之大乘。 为上因缘，志心称念： 九天锡庆天尊，万福护身天尊，请天证果天尊。 和：不可思议功德。 洪恩灵济真君礼愿文竟",
      "translated_text": "Though Heaven’s net is hard to escape,\nYet all lies in the awakening of the human heart.\n\nThis day, we prostrate in reflection:\nAll sentient beings turn their hearts toward the Dao,\nTheir utmost sincerity moving the gods.\nWe bow in reverence before the True and All-Hearing,\nFirst confessing our faults,\nFrom past kalpas to this present life.\nAshamed of wrongs, we have acted perversely,\nTurned from right to follow wrong,\nAltered our nature to chase power,\nEmbraced deceit to exploit flaws.\nIn darkness and secrecy, we schemed with cunning,\nIn cruelty and savagery, we wrought harm.\nDeluded by dreams, we wandered lost\nIn the fields of profit, fame, and cunning.\nKilling, stealing, lust, and deceit—\nWe sank into the mire of greed, wrath, and delusion.\nIn great matters, we deceived Heaven and Earth;\nIn secret, we betrayed the gods.\nWe cursed the heat, railed against the cold,\nScolded the wind, reviled the rain.\nBefore the stars, we sought advantage;\nBefore the sun and moon, we bared ourselves.\nWe pointed at rainbows, swore by mountains and seas,\nDefiled temples and shrines, polluted sacred precincts.\nUnmindful of the wrongs of body, heart, mouth, and intent,\nUnsettled in the roles of scholar, farmer, artisan, merchant.\nWe honored not the Three Treasures, nor practiced the Five Constants.\nIn serving others, we were disloyal;\nIn friendship, untrustworthy.\nToward parents, unfilial;\nToward lords, ungrateful.\nWealthy yet unkind,\nGreedy yet unjust.\nWe called sacrifice futile,\nViolence harmless.\nDeemed reverence unworthy,\nWords unworthy of fear.\nWe rebelled against superiors, stirred chaos,\nLoved violence, hated poverty,\nSlandered the loyal, bullied the weak.\nWe served public ends for private gain,\nExalted ourselves at others’ expense.\nWe incited lawsuits, sowed enmity,\nArrogant in self-regard, cruel in self-will.\nUnclear in goodness, insincere in conduct.\nSmall resentments eroded the bond of father and son,\nNeglect dissolved the love of brothers.\nWhen customs decayed, we sang the *Gu Feng* in reproach;\nWhen kin turned to hatred, we chanted the *Jiao Gong* in lament.\nNow, knowing our sins have filled the measure,\nWe humbly face the merciful and repent.\n\nWho among us is without fault?\nYet faults, once mended, bring trembling fear.\nThe gods accept no fixed offerings,\nBut respond to utmost sincerity—\nThus we offer our earnest, reverent devotion.\n\nWe pray the Most Benevolent grant protection,\nThe Great Dao show compassion,\nForgive our past transgressions,\nBestow future blessings.\nLet all regions rejoice,\nAll lands receive grace.\nMay this day bring great peace,\nDisasters cease, misfortunes end.\nMay every blessing arrive,\nThe old grow strong, the young vigorous.\nLong have we revered the awe-inspiring power of your virtue,\nNow we dedicate ourselves to works that aid the people.\n\nWith utmost sincerity, we bow our heads,\nTwice prostrating to give thanks to the Two True Lords of Numinous Aid.\nWe perform the Triple Rite of Thanksgiving.\n\nDisciples, with one heart, bow in reverence and thanks\nTo the True Lord of the Nine Heavens’ Golden Portal.\nDisciples, with one heart, bow in reverence and thanks\nTo the True Lord of the Nine Heavens’ Jade Portal.\nDisciples, with one heart, bow in reverence and thanks\nTo the Illustrious Father, True Lord of Supportive Brilliance.\n\nThe rites of thanksgiving complete,\nOur repentance fully revealed,\nWe reverently follow the wondrous canon,\nDaring to approach your numinous wisdom.\nWith sincere devotion, we lay bare our humble wishes.\n\nWe pray your sacred compassion deign to look upon us.\n\nFirst, may the present emperor’s life be long,\nHis harmony and longevity matching Heaven’s—ten thousand, ten thousand springs.\nSecond, may ministers and officials enjoy rank and emolument,\nTheir blessings like wind and clouds—enduring for a thousand years of joy and prosperity.\nThird, may scholars attain wealth and honor,\nTheir names rising to Heaven’s court as dukes and ministers.\nFourth, may farmers diligently till the soil,\nFrom this year onward, year after year, rejoicing in triple harvests.\nFifth, may all artisans perfect their crafts,\nAwaiting summons to the Golden Gate to hear the jade decree.\nSixth, may the path to wealth be great,\nComparable to the lords of a thousand households.\nSeventh, may wind and rain be timely,\nAll under Heaven celebrating universal peace.\nEighth, may incense and offerings ever flourish,\nThe temple’s majesty and numinous power enduring for a thousand years.\nNinth, may the Nine Heavens bestow their mandate,\nJade pendants chiming as we approach the Purple Court.\nTenth, may all faithful and good in the ten directions\nTurn to the Three Treasures with utmost devotion.\n\nThe above hymn of praise and rites now complete,\nThe merit and virtue fulfilled.\n\nAll in the ritual assembly, each with reverence, speak again:\nWe have heard that with trembling caution,\nWe shame ourselves for our repeated offenses.\nIn awe of your radiant majesty,\nWe behold your numinous presence close at hand.\nGrateful in heart, we bow and declare:\nYour virtue shines forth—manifest and luminous,\nYour merit extends boundlessly, aiding all.\nYou are the bridge across the sea of suffering,\nThe sun and moon guiding the lost.\n\nToday, we reverently follow the sacred decree,\nConducting this ritual of gratitude and prayer for blessings.\nWe face your true wisdom, proclaiming your wondrous example.\nWith the devotion of triple ablutions and triple incense,\nWe dare to offer our gaze and our reverence.\nMay the impartial gods see our sincerity,\nWashing away the sins of past kalpas and this life,\nThat we may plant the seeds of present and future karma.\nWith beginning and end, without evil or song,\nWhat can be grasped, the foolish cannot reach;\nYet the gods transform, and the people are rightly guided.\nWhen merit is complete and deeds perfected,\nWe may ascend to the Jade Chamber and Cinnabar Terrace.\nWhen qi abides and spirit is upright,\nWe may open the brocade pouch of the Purple Sun.\nMay all faithful men and women attain long life,\nCountless generations of ancestors be delivered.\nExtending even to the departed in darkness,\nAll may return to the vast Mahayana.\nFor these supreme causes, we earnestly invoke:\nThe Heaven-Blessed Honored Lord of the Nine Heavens,\nThe Ten-Thousand-Fortunes-Protecting-Body Honored Lord,\nThe Heaven-Invoked-Fruit-Attaining Honored Lord.\nTogether: Inconceivable merit and virtue.\n\nThe *Ritual Text of Offering and Prayer to the Numinous Aid True Lord* is now complete.",
      "overlap_context": "ast blessings and descend abundant grace.\nThrough this day’s solemn fast and devotion,\nWe sincerely take refuge and repent.\nWe have heard that misfortune and fortune have no fixed gate,\nOnly summoned by one’s own actions;\nOmens of good and ill follow like shadows.\nGood serves as the tally of evil,\nEvil as the proof of good.\nFor those who do good,\nThe Five Phases support them, the Overseer of Fate befriends them.\nFor those who do evil,\nMalevolent qi overwhelms them, baleful stars shine upon them.",
      "start_char": 13855,
      "end_char": 15022,
      "start_sentence": 561,
      "end_sentence": 640,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.8025267124176,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君礼愿文.txt",
        "category": "威仪类"
      }
    }
  ]
}