{
  "source_id": "洪恩灵济真君集福早朝仪",
  "source_file": "chunked_daozang\\洪恩灵济真君集福早朝仪.json",
  "total_chunks": 5,
  "total_original_chars": 2413,
  "total_translated_chars": 17281,
  "total_translation_time": 99.09237766265869,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君集福早朝仪.txt",
    "category": "威仪类"
  },
  "full_translation": "*The Rite of Morning Audience for Assembling Blessings of the Venerable Sovereign of Vast Grace and Numinous Aid*\n\n**Scripture Title:** *The Rite of Morning Audience for Assembling Blessings of the Venerable Sovereign of Vast Grace and Numinous Aid*\n**Author:** Unknown\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongxuan* Section, *Weiyi* (Ritual Propriety) Category\n\n---\n\n### *The Rite of Morning Audience for Assembling Blessings of the Venerable Sovereign of Vast Grace and Numinous Aid*\n\nThe ritual proceeds according to form.\nEach pays reverence; the master visualizes as prescribed.\n\nGolden perfection records the rosy clouds, resplendent across the Three Heavens.\nCrimson auroras soar through the cinnabar skies, where all heavens guide their chariots.\nDawn’s radiance awakens the day, dispelling all shadows of yin.\nThe Nine Subtleties shake the void; the Five Stars wheel in their courses.\nMyriad immortals respond to the resonance, spontaneously wondrous and mysterious.\nIn the profound and obscure, their forms disperse, dividing into hundreds and thousands.\nThe luminous Pearl of the Dao shines forth; auspicious omens descend upon the altar’s heavens.\nManifesting hidden blessings, they merge with the Three Fields of Radiance.\n\n**Response:** In harmony with the Dao, united with the True.\n\n*Sound the ritual drum twenty-four times.*\n\nMost High and Mysterious Origin, Fivefold Numinous Elder Lord:\nSummon forth the Three and Five Merit Officials within this servant’s body,\nthe Attendant Perfume Officers of the Left and Right,\nthe Golden Lads who tend incense, the Jade Maidens who transmit words,\nthe Incense Officers of the Day, the Merit Officials and Messengers,\nthe Three Qi’s Orthodox Deities.\nHasten to report to the Five Great Marshals—Wei, Cha, Bian, Zhao, and Diao—\nthe Two Marshals Yue and Xu,\nthe Heavenly Soldiers and Mighties,\nthe Divine Officers of the Left and Right.\n\nThis servant now ascends the altar to perform the ritual,\nreverently obeying the Sacred Edict,\nsolemnly conducting the fast and offering,\nassembling blessings for the state and the people.\nAll sincere petitions have been recorded and submitted.\nMay the Qi of the Orthodox and True descend and flow into this servant’s body,\nso that the words this servant utters may swiftly reach\nthe Golden Portal of the Nine Heavens before the Venerable Sovereign of Vast Grace,\nthe Jade Portal of the Nine Heavens before the Venerable Sovereign of Vast Grace.\n\n**Proclaim the ritual titles:**\n\nThis humble servant [Name], along with the assembled altar officials,\njointly and sincerely reveres and petitions:\n\nThe Great Immortal of the Golden Portal of the Nine Heavens,\nIlluminating the Dao and Manifesting Virtue,\nUniversally Numinous and Vastly Aiding,\nPure and Subtle, Empty and Wondrous,\nCompassionate and Benevolent,\nProtecting the State and Sheltering the People—\n**Venerable Sovereign of Vast Grace**;\n\nThe Supreme Immortal of the Jade Portal of the Nine Heavens,\nProclaiming Transformation and Upholding the Teachings,\nBrilliantly Numinous and Broadly Aiding,\nLofty and Serene, Empty and Profound,\nWondrously Responsive, Benevolent and Kind,\nAssisting the State and Protecting the People—\n**Venerable Sovereign of Vast Grace**;\n\n**Sacred Father:** Loyal and Martial Duke Qi, True Lord of Illustrious Brightness;\n**Sacred Mother:** Benevolent and Longevous, Pure and Good Immortal Consort;\n**Sacred Consorts:**\n- Princess of Jing State, Assisting with Benevolence and Upright Response, Immortal Consort;\n- Princess of Wei State, Aiding with Kindness and Reverent Serenity, Immortal Consort;\n**Sacred Brothers:** Prince Tang, Prince Hong, Prince E, Prince Guangling;\n**Sacred Uncles:** Duke of State Protection, Duke of State Service;\n**Sacred Sons-in-Law:** Marquis of Martial Peace, Marquis of Tranquil State;\n**Sacred Sons:** Marquis of Preserving Greatness, Marquis of Manifesting Trust, Marquis of Preserving Trust, Marquis of Preserving Peace, Duke of Martial Peace;\n**Sacred Nephews:** Marquis of Illustrious Virtue, Marquis of Peaceful Stability, Marquis of Supreme Peace;\n**Sacred Grandsons:** Marquis of Martial Prosperity, Marquis of Southern Prosperity;\n**Sacred Sons, Grandsons, and Nephews:** All the noble lords among the ranks of dukes and marquises;\n**Consorts of the Sacred Brothers:**\n- Consort of Prince Tang, Illustrious and Solemn Immortal Consort;\n- Consort of Prince Hong, Benevolent and Kind Immortal Consort;\n- Consort of Prince E, Compliant and Reverent Immortal Consort;\n- Consort of Prince Guangling, Auspicious and Joyous Immortal Consort;\n**Sacred Daughters:** Pure and Reverent Immortal Maiden, Illuminating and Reverent Immortal Maiden;\n**Sacred Daughters-in-Law:** Kind and Reverent Lady, Gentle and Soft Lady, Benevolent and Compliant Lady;\n**Illustrious Ladies:** Illustrious and Reverent Lady, Compliant and Respectful Lady, Illuminating and Wise Lady, Respectful and Reverent Lady, Serene and Reverent Lady, Illustrious and Harmonious Lady, Compassionate and Filial Lady;\n**All the Sacred Daughters-in-Law among the ranks of ladies.**\n\nThe Heavenly Mechanism Bureau of the Great Register of the Supreme Clarity,\nthe Thunderbolt Ministry of the Celestial Patterns Bureau,\nthe Earthly Prison and all its subordinate offices and generals,\nthose who expel evil and seize malevolent spirits,\ntransmit talismans and activate the Dao,\ndispel disasters and deliver from calamity,\npursue misfortune and repel monstrosities,\noversee the altar and protect the Dharma,\nobserve and patrol as generals—\nthe Venerable Deities of the Year-Star,\nthe Twelve Monthly Generals,\nthe Star Officials of the Original Destiny of One’s Birth,\nthe immortals of the Wind, Thunder, and Rain Departments,\nthe Left and Right Chancellors, Grand Masters, and Junior Masters,\nthe Six Ministries, the Attendants of the Inner Court, the Dukes and Ministers,\nthe Left and Right Supreme Masters of Life-Recording and Longevity-Recording,\nthe Left and Right Supreme Masters of Bestowing Emolument and Bestowing Blessings,\nthe Left and Right Attendants, Envoys, and Gentlemen of Transmission,\nall the officials, functionaries, and subordinate clerks among the various bureaus,\nthe Twenty-Four Bureau Officials subordinate to the Left and Right Bureaus of Blessings and Emoluments,\nthe Left and Right Escorting Immortals,\nthe Attendant Ladies of Fulfilling Harmony, Illustrious Splendor, Comely Grace, Cultivated Demeanor, Cultivated Bearing, Illustrious Bearing,\nthe Inner Scribes and Women of Merit,\nthe Ladies of Silk and Hemp, the Keepers of the Seal Treasury, the Registrars of Accounts,\nthe Stewardesses of Expenditures,\nthe Women Scribes and Historians, all the Talented Ladies,\nthe Female Invocators and Female Attendants, all the Noble Ladies,\nthe Sacred Kin and Ladies of the Inner Palace,\nall the Ladies of the Inner Chambers,\nthe Heavenly Concubine of the Celestial One, Registrar of Births in the Hall of Joyous Celebration,\nthe Heavenly Concubine of the Great One, Overseer of Births,\nthe Supreme Matriarchs of Bestowing Emolument and Bestowing Destiny,\nthe Ladies Guarding the Womb and Protecting the Chamber,\nthe Ladies Protecting the Fetus and Safeguarding Life,\nthe Left and Right Ladies of Compassionate Instruction,\nthe Ladies of Transmission and Protection,\nthe Left and Right Ladies of Record-Keeping,\nthe Lady of the Seal,\nthe Ladies of Nursing and Nurturing in the various palaces,\nthe Ladies of Holding and Delivering, of Rearing and Raising,\nthe Spirit of Transformation and Rebirth,\nMarshal Cha, Guardian of Eternal Peace,\nMarshal Bian, Guardian of Martial Peace,\nMarshal Wei, Left Gatekeeper and Military Commissioner,\nMarshal Zhao, Right Gatekeeper and Commander-in-Chief of the Armies,\nMarshal Diao, Vanguard and Military Overseer,\nthe valiant soldiers and fierce generals under the command of the Five Marshals,\nthe Left and Right Marshals Yue and Xu,\nthe Attendants and Escorts of the Left and Right Traveling Palaces,\nthe Bureaus of Emolument, Merit, Officials, and Documents, all their subordinate clerks,\nthe Bureaus of Agriculture, Crops, Silk, and Hemp, all their subordinate clerks,\nthe Bureaus of Markets, Commerce, Crafts, and Materials, all their subordinate clerks,\nthe Kitchen Officers, Entertainers, and Musicians,\nthe Heavenly, Divine, and Human Champions,\nthe Keepers of the Upper Registers, Tallies, Cups, and Phoenix,\nthe Lad Who Transmits Dreams,\nthe Hierarchs of the Spirit Bureau,\nthe Incense Officers and Messengers on duty in the halls and before the altars,\nthe Earth Deities and all numinous spirits of the Temple of Numinous Aid.\n\nReverently we gaze upward, beseeching the Sacred Compassion to condescend and cast its penetrating gaze.\n\nThis servant has heard:\nThat which gives birth to Heaven and Earth is the primordial origin of the undifferentiated Qi.\n\nThe Bureaus of Yin and Yang, wondrously dispersing the myriad differentiated forms.\nThey array the sun, moon, and stars in the workings of Qian, establish mountains, rivers, seas, and peaks in the weave of Kun.\nAll things take shape, yet of these, humans are most noble.\nEvery kind nurtured into being relies wholly on the benevolence of transformation and nurturance.\n\nThis servant, by the name of [X], has long been bound by karmic affinity and thus gained intimacy with the true teachings.\nAdorned with starry pins and feathered robes, I have been steeped in the profound grace of rain and dew.\nEntrusted with duties and performing rites, I have partaken in the subtle transformations of the Dark Prime’s embroidered splendor.\n\nFor every prayer and petition, I humbly beseech responsive communion.\n\nBy imperial decree, we reverently undertake this pure jiao offering to gather blessings for the state and the household.\nThis morning, as we perform the Dao rites, we, the assembled dharma hosts, now raise the first pinch of incense, chanting in unison:\n\n*May this incense reach the Palace of Numinous Aid,\npervade the Nine Heavens’ golden towers to form a canopy of blossoms,\nand offer sustenance to the Illustrious Lord of Vast Grace and Universal Salvation.*\n\nMay the smoke of this incense serve as offering\nto the Lord of Vast Grace of the Nine Heavens’ golden towers,\nand to the perfected immortals and sacred hosts of the Palace of Numinous Aid.\n\nWe, your servants, surrender body, spirit, and life to the Lord and the assembled sages.\nThrough the merit of this pinch of incense,\nwe reverently pray for the August Emperor, His Majesty.\n\nMay his Dao harmonize with that of Tang and Yu, his achievements equal those of Xuan and Hao.\nMay he govern with effortless grace, his chariots and script unifying all under heaven.\nMay he face the screen and receive the court at dawn, jade and silk arriving from distant shores.\nMay fortune and longevity forever attend his sacred person,\nand loyal ministers capably assist his imperial designs.\n\nNow, therefore, we kindle this incense,\nsurrendering to the virtue and power of the Perfected Lords, the Great Sage Hosts, and the Most True,\nthat after attaining the Dao, they may preserve heaven and endure eternally.\n*In harmony: With the Dao, united in truth.*\n\nAt this dawn rite of the Dao, we invoke the Dharma assembly,\noffering this second pinch of incense.\n*In harmony: The incense ascends to the Palace of Numinous Aid,\npervading the Nine Heavens’ jade towers to form a canopy of treasures,\nas offering to the Lord of Manifest Numinosity and Vast Grace.*\n\nMay the smoke of this incense serve as offering\nto the Lord of Vast Grace of the Nine Heavens’ jade towers,\nand to the perfected immortals and sacred hosts of the Palace of Numinous Aid.\n\nWe, your servants, surrender body, spirit, and life to the Lord and the assembled sages.\nThrough the merit of this pinch of incense,\nwe reverently pray that its blessings flow to the Four Peaks and Nine Governors,\nto the myriad officials and all ministers,\nwho with refined virtue assist the turning of the times,\nand with ordered grace share in benevolent rule.\nMay they reverently illuminate and aid the One Sovereign,\npresenting counsel and sustaining all governance.\n\nWe humbly invoke the Perfected Lord,\nwho harmonizes with and augments the mysterious workings,\nupholding the sagely transformation.\nMay he magnify the imperial court’s grandeur,\nthat its glory endure for a hundred million myriad years.\nMay the luminous numinous Dao be manifest,\nand the dual forces of yin and yang unite in virtue.\n\nNow, therefore, we kindle this incense,\nsurrendering to the virtue and power of the Perfected Lords, the Great Sage Hosts, and the Most True,\nthat after attaining the Dao, they may forever preserve enduring peace.\n*In harmony: With the Dao, united in truth.*\n\nAt this dawn rite of the Dao, we invoke the Dharma assembly,\noffering this third pinch of incense.\n*In harmony: The incense ascends to the Palace of Numinous Aid,\npervading the Nine Heavens’ palatial towers to form a canopy of clouds,\nas offering to the perfected immortals and sacred hosts of the Palace of Numinous Aid.*\n\nMay the smoke of this incense serve as offering\nto the Sacred Father and Sacred Mother, the Immortal Consorts and their retinue,\nand to the perfected immortals and sacred hosts of the Palace of Numinous Aid.\n\nWe, your servants, surrender body, spirit, and life to the Lord and the assembled sages.\nThrough the merit of this pinch of incense,\nwe reverently pray that its blessings flow to the Nine Provinces and Four Seas,\nto all the people under heaven,\nthat every household be filled and wives and children dwell in peace,\nthat the five grains ripen and the people flourish.\n\nWe humbly invoke the Sacred Father and Sacred Mother, the Immortal Consorts and their retinue,\nand all the sacred hosts of the Hall of Life-Registration.\nMay the Nine Heavens resound with celebration,\nand the Five Emperors oversee life’s unfolding.\nMay the essence of the Three Qi’s radiance suffuse all,\nand the purest essence of heaven and earth unite in harmony.\nRooting life and nurturing growth,\nmay they witness the sincerity of the people’s earnest prayers.\nSummoning the spirits and commanding the winds,\nmay they grant every household the beauty of unbroken lineage and continuous progeny.\nAll who turn in devotion shall have their prayers answered.\n\nNow, therefore, we kindle this incense,\nsurrendering to the virtue and power of the Perfected Lords, the Great Sage Hosts, and the Most True,\nthat after attaining the Dao, they may forever preserve enduring life.\n*In harmony: With the Dao, united in truth.*\n\n*Chanting the directions*\n*Confession*\n\nTo the One and Two we invoke, with the Three Rituals we honor,\nReverently proclaiming once more the sacred ranks—\nWe, the assembled officiants and all present before the altar,\nwith utmost sincerity and solemnity, now humbly address the august thrones.\n\nWe have heard that the Nine Qi intertwine and bind,\nknitting the root of life at the Purple Portal.\nThe Three Origins nurture and sustain,\ncongealing the stem of destiny within the Yellow Chamber.\nThus, the embryonic soul and spirit,\nthe completeness of life’s mandate,\nrely upon the blending of red and white, blue and yellow, black.\nWith reverent assent and obedience,\nwe align with the wondrous signs that shake heaven and earth.\nWith devout chanting and reverence,\nwe harmonize with the mystery of yin embracing yang.\nThough form is bestowed within the central realm,\nqi is truly received from the Primordial One.\n\nWe, your servants, uphold the celestial mandate,\nacting on behalf of the people below.\nWe perform the fast, recite the scriptures,\nburn incense, and practice the Dao.\nMay numinous blessings shine afar and near,\nand luminous fortune gather for the nation and its households.\n\nWe humbly implore the vast outpouring of boundless grace,\nthe generous bestowal of the mysterious creation.\nFor all the supplications of the people,\nonly the great virtue remains impartial.\nMay the living receive the glory of lineage and progeny,\nand the departed be spared the lament of Ruo’ao.\nMay the Three Luminaries shine resplendent,\nthe Four Qi radiant and clear,\nwind and rain harmoniously balanced,\nand the people joyfully nurtured.\n\nThus, may the enlightened governance of the Perfected Lords and their great compassion be manifest above,\nwhile below, our devotion in surrender finds its answer.\n\nWe respectfully present this petition for your hearing.\n\n**Twelve Vows**\n**Invoking the Spirit, Burning Incense**\n\nIncense Officials and Envoys,\nLeft and Right Divine Lords,\nAttendant Incense Spirits—\nAt this place of early audience,\nmay golden liquid, cinnabar, and azure mushrooms spontaneously arise.\nMay the hundred spirits and host of perfected ones\nconverge here before this incense burner.\nMay our sincerity ascend on high,\nbringing peace to the nation and its households.\nMay the jade maidens and immortal youths of the ten directions\nattend the fragrant smoke,\nconveying our words of invocation\nswiftly to the Golden Gates of the Nine Heavens,\nbefore the august presence of the Vast Grace Perfected Lords of the Nine Heavens,\nthe Vast Grace Perfected Lords of the Jade Gates of the Nine Heavens.\n\n**Hymn of Departure from the Hall**\n**Exiting the Chamber**\n\n**The Early Audience Rite for Invoking Blessings of the Vast Grace Numinous Aid Perfected Lord Concludes**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洪恩灵济真君集福早朝仪 经名：洪恩灵济真君集福早期仪。 撰人不详。 一卷。 底本出处：《正统道藏》洞玄部威仪类。 洪恩灵济真君集福早朝仪 法事如式 各礼师存念如法 金真录霞，焕映三天。 飞云丹霄，诸天控軿。 晨晖启旦，阴翳俱捐。 九微震空，五星回旋。 万仙应感，自然妙玄。 杳冥散体，分形百千。 玄珠光耀，瑞降坛乾。 显幽蒙惠，合景三田。 和：与道合真。 呜法鼓二十四通 太上玄元五灵老君，召出臣身中三五功曹，左右香官使者，侍香金童，传言玉女，直日香官，功曹使者，三炁正神。 速上关启查边魏赵刁五大元帅，岳许二元帅，天丁力士，左右神官。 臣今升坛法事，钦奉圣旨，崇修斋醮，集福邦家，其诸丹悃，已录告闻。 愿得正真生炁，下降流入臣等身中，令臣所启之言，速达九天金阙洪恩真君、九天玉阙洪恩真君圣前。 请称法位 具位臣某，与临坛官众等，谨同诚上启：九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君， 九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君， 圣父齐王忠武翊亮真君， 圣母仁寿淑善仙妃， 圣妃泾国夫人顺助仁惠贞应仙妃、 卫国夫人善助慈懿恭静仙妃，圣兄唐王、洪王、鄂王、广陵王，圣舅护国公、奉国公，圣婿武安侯、宁国侯，圣子保大侯，彰信侯、保信侯、保宁侯、武宁公，圣侄昭德侯，安定侯、太宁侯，圣孙武昌侯，南昌侯，圣子圣孙圣侄列位公侯，唐王后明肃仙妃，洪王后仁慈仙妃，鄂王后顺懿仙妃，广陵王后善庆仙妃，圣女冲懿仙姬、明懿仙姬，圣妇善懿夫人、仁柔夫人、惠顺夫人，昭懿夫人、顺恭夫人、明哲夫人、恭懿夫人、靖懿夫人、昭穆夫人、慈孝夫人、圣妇列位夫人。 上清大洞箓天机院雷霆省天文院地府诸司承行官将，驱邪捉祟、传符动法、消灾度厄、逐凶辟怪、监坛护法、观察巡捕将军，太岁尊神十二月将，本命元辰星官，风雷雨部仙众，左右丞相太宰少宰，六部尚侍内府公卿，左右注生注寿上宰，左右司禄司福上宰，左右侍从通事舍人，百官庶司所属曹僚列位公卿，左右福禄司所属二十四司曹官典，左右引进仙官，内侍顺成夫人、昭华夫人、容华夫人、修容夫人、修仪夫人、昭仪夫人、内典妇功夫人、丝枲夫人、筦库夫人、帐籍夫人、度支夫人，女府女史列位才人，女祝女御列位贵人，内殿内侍内典列位圣眷夫人，燕喜堂内注生司天乙注生神后、太乙监生神后，司禄司命上相夫人，守胎卫房夫人，保胎护命夫人，左右慈训夫人，保传夫人，左右掌籍夫人，掌印夫人，诸宫乳哺夫人、抱送夫人、抚育夫人、托生化婆神，永安留守查元帅，武安留守边元帅，节度使左监门魏元帅，都统军使右监门赵元帅，都监军使先锋刁元帅，五帅部下精兵猛将，左右岳、许二元帅，左右行宫侍御从官，司禄、司勋、司士、司书列位曹僚，司农、司稼、典丝、掌葛列位曹僚，司市、掌货、考工、饬材列位曹僚，厨官、优官、伶官，天捷、神捷、人捷、掌上、掌签、掌杯、掌鸾，传梦童子，神局节级，直殿直符香官使者，灵济宫土地合属威灵。 恭望圣慈，俯垂洞鉴。 臣闻生天生地，混成一炁之宗。",
      "translated_text": "*The Rite of Morning Audience for Assembling Blessings of the Venerable Sovereign of Vast Grace and Numinous Aid*\n\n**Scripture Title:** *The Rite of Morning Audience for Assembling Blessings of the Venerable Sovereign of Vast Grace and Numinous Aid*\n**Author:** Unknown\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongxuan* Section, *Weiyi* (Ritual Propriety) Category\n\n---\n\n### *The Rite of Morning Audience for Assembling Blessings of the Venerable Sovereign of Vast Grace and Numinous Aid*\n\nThe ritual proceeds according to form.\nEach pays reverence; the master visualizes as prescribed.\n\nGolden perfection records the rosy clouds, resplendent across the Three Heavens.\nCrimson auroras soar through the cinnabar skies, where all heavens guide their chariots.\nDawn’s radiance awakens the day, dispelling all shadows of yin.\nThe Nine Subtleties shake the void; the Five Stars wheel in their courses.\nMyriad immortals respond to the resonance, spontaneously wondrous and mysterious.\nIn the profound and obscure, their forms disperse, dividing into hundreds and thousands.\nThe luminous Pearl of the Dao shines forth; auspicious omens descend upon the altar’s heavens.\nManifesting hidden blessings, they merge with the Three Fields of Radiance.\n\n**Response:** In harmony with the Dao, united with the True.\n\n*Sound the ritual drum twenty-four times.*\n\nMost High and Mysterious Origin, Fivefold Numinous Elder Lord:\nSummon forth the Three and Five Merit Officials within this servant’s body,\nthe Attendant Perfume Officers of the Left and Right,\nthe Golden Lads who tend incense, the Jade Maidens who transmit words,\nthe Incense Officers of the Day, the Merit Officials and Messengers,\nthe Three Qi’s Orthodox Deities.\nHasten to report to the Five Great Marshals—Wei, Cha, Bian, Zhao, and Diao—\nthe Two Marshals Yue and Xu,\nthe Heavenly Soldiers and Mighties,\nthe Divine Officers of the Left and Right.\n\nThis servant now ascends the altar to perform the ritual,\nreverently obeying the Sacred Edict,\nsolemnly conducting the fast and offering,\nassembling blessings for the state and the people.\nAll sincere petitions have been recorded and submitted.\nMay the Qi of the Orthodox and True descend and flow into this servant’s body,\nso that the words this servant utters may swiftly reach\nthe Golden Portal of the Nine Heavens before the Venerable Sovereign of Vast Grace,\nthe Jade Portal of the Nine Heavens before the Venerable Sovereign of Vast Grace.\n\n**Proclaim the ritual titles:**\n\nThis humble servant [Name], along with the assembled altar officials,\njointly and sincerely reveres and petitions:\n\nThe Great Immortal of the Golden Portal of the Nine Heavens,\nIlluminating the Dao and Manifesting Virtue,\nUniversally Numinous and Vastly Aiding,\nPure and Subtle, Empty and Wondrous,\nCompassionate and Benevolent,\nProtecting the State and Sheltering the People—\n**Venerable Sovereign of Vast Grace**;\n\nThe Supreme Immortal of the Jade Portal of the Nine Heavens,\nProclaiming Transformation and Upholding the Teachings,\nBrilliantly Numinous and Broadly Aiding,\nLofty and Serene, Empty and Profound,\nWondrously Responsive, Benevolent and Kind,\nAssisting the State and Protecting the People—\n**Venerable Sovereign of Vast Grace**;\n\n**Sacred Father:** Loyal and Martial Duke Qi, True Lord of Illustrious Brightness;\n**Sacred Mother:** Benevolent and Longevous, Pure and Good Immortal Consort;\n**Sacred Consorts:**\n- Princess of Jing State, Assisting with Benevolence and Upright Response, Immortal Consort;\n- Princess of Wei State, Aiding with Kindness and Reverent Serenity, Immortal Consort;\n**Sacred Brothers:** Prince Tang, Prince Hong, Prince E, Prince Guangling;\n**Sacred Uncles:** Duke of State Protection, Duke of State Service;\n**Sacred Sons-in-Law:** Marquis of Martial Peace, Marquis of Tranquil State;\n**Sacred Sons:** Marquis of Preserving Greatness, Marquis of Manifesting Trust, Marquis of Preserving Trust, Marquis of Preserving Peace, Duke of Martial Peace;\n**Sacred Nephews:** Marquis of Illustrious Virtue, Marquis of Peaceful Stability, Marquis of Supreme Peace;\n**Sacred Grandsons:** Marquis of Martial Prosperity, Marquis of Southern Prosperity;\n**Sacred Sons, Grandsons, and Nephews:** All the noble lords among the ranks of dukes and marquises;\n**Consorts of the Sacred Brothers:**\n- Consort of Prince Tang, Illustrious and Solemn Immortal Consort;\n- Consort of Prince Hong, Benevolent and Kind Immortal Consort;\n- Consort of Prince E, Compliant and Reverent Immortal Consort;\n- Consort of Prince Guangling, Auspicious and Joyous Immortal Consort;\n**Sacred Daughters:** Pure and Reverent Immortal Maiden, Illuminating and Reverent Immortal Maiden;\n**Sacred Daughters-in-Law:** Kind and Reverent Lady, Gentle and Soft Lady, Benevolent and Compliant Lady;\n**Illustrious Ladies:** Illustrious and Reverent Lady, Compliant and Respectful Lady, Illuminating and Wise Lady, Respectful and Reverent Lady, Serene and Reverent Lady, Illustrious and Harmonious Lady, Compassionate and Filial Lady;\n**All the Sacred Daughters-in-Law among the ranks of ladies.**\n\nThe Heavenly Mechanism Bureau of the Great Register of the Supreme Clarity,\nthe Thunderbolt Ministry of the Celestial Patterns Bureau,\nthe Earthly Prison and all its subordinate offices and generals,\nthose who expel evil and seize malevolent spirits,\ntransmit talismans and activate the Dao,\ndispel disasters and deliver from calamity,\npursue misfortune and repel monstrosities,\noversee the altar and protect the Dharma,\nobserve and patrol as generals—\nthe Venerable Deities of the Year-Star,\nthe Twelve Monthly Generals,\nthe Star Officials of the Original Destiny of One’s Birth,\nthe immortals of the Wind, Thunder, and Rain Departments,\nthe Left and Right Chancellors, Grand Masters, and Junior Masters,\nthe Six Ministries, the Attendants of the Inner Court, the Dukes and Ministers,\nthe Left and Right Supreme Masters of Life-Recording and Longevity-Recording,\nthe Left and Right Supreme Masters of Bestowing Emolument and Bestowing Blessings,\nthe Left and Right Attendants, Envoys, and Gentlemen of Transmission,\nall the officials, functionaries, and subordinate clerks among the various bureaus,\nthe Twenty-Four Bureau Officials subordinate to the Left and Right Bureaus of Blessings and Emoluments,\nthe Left and Right Escorting Immortals,\nthe Attendant Ladies of Fulfilling Harmony, Illustrious Splendor, Comely Grace, Cultivated Demeanor, Cultivated Bearing, Illustrious Bearing,\nthe Inner Scribes and Women of Merit,\nthe Ladies of Silk and Hemp, the Keepers of the Seal Treasury, the Registrars of Accounts,\nthe Stewardesses of Expenditures,\nthe Women Scribes and Historians, all the Talented Ladies,\nthe Female Invocators and Female Attendants, all the Noble Ladies,\nthe Sacred Kin and Ladies of the Inner Palace,\nall the Ladies of the Inner Chambers,\nthe Heavenly Concubine of the Celestial One, Registrar of Births in the Hall of Joyous Celebration,\nthe Heavenly Concubine of the Great One, Overseer of Births,\nthe Supreme Matriarchs of Bestowing Emolument and Bestowing Destiny,\nthe Ladies Guarding the Womb and Protecting the Chamber,\nthe Ladies Protecting the Fetus and Safeguarding Life,\nthe Left and Right Ladies of Compassionate Instruction,\nthe Ladies of Transmission and Protection,\nthe Left and Right Ladies of Record-Keeping,\nthe Lady of the Seal,\nthe Ladies of Nursing and Nurturing in the various palaces,\nthe Ladies of Holding and Delivering, of Rearing and Raising,\nthe Spirit of Transformation and Rebirth,\nMarshal Cha, Guardian of Eternal Peace,\nMarshal Bian, Guardian of Martial Peace,\nMarshal Wei, Left Gatekeeper and Military Commissioner,\nMarshal Zhao, Right Gatekeeper and Commander-in-Chief of the Armies,\nMarshal Diao, Vanguard and Military Overseer,\nthe valiant soldiers and fierce generals under the command of the Five Marshals,\nthe Left and Right Marshals Yue and Xu,\nthe Attendants and Escorts of the Left and Right Traveling Palaces,\nthe Bureaus of Emolument, Merit, Officials, and Documents, all their subordinate clerks,\nthe Bureaus of Agriculture, Crops, Silk, and Hemp, all their subordinate clerks,\nthe Bureaus of Markets, Commerce, Crafts, and Materials, all their subordinate clerks,\nthe Kitchen Officers, Entertainers, and Musicians,\nthe Heavenly, Divine, and Human Champions,\nthe Keepers of the Upper Registers, Tallies, Cups, and Phoenix,\nthe Lad Who Transmits Dreams,\nthe Hierarchs of the Spirit Bureau,\nthe Incense Officers and Messengers on duty in the halls and before the altars,\nthe Earth Deities and all numinous spirits of the Temple of Numinous Aid.\n\nReverently we gaze upward, beseeching the Sacred Compassion to condescend and cast its penetrating gaze.\n\nThis servant has heard:\nThat which gives birth to Heaven and Earth is the primordial origin of the undifferentiated Qi.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1247,
      "start_sentence": 0,
      "end_sentence": 31,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 51.8496835231781,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君集福早朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "司阴司阳，妙散万殊之象。 列日月星辰於乾造，奠山川海岳於坤维。 品物流形，惟人为贵。 凡囿生成之类，悉依化育之仁。 臣某韦际夙缘，获亲正教。 簪星服羽，沾濡雨露之深恩。 领职行科，黼黻玄元之妙化。 凡有祈告，愿赐感通。 臣等钦奉圣旨，崇修清醮，集福邦家。 以今清旦行道，请法众等，运兹初捻上香，和：香至灵济宫，遍九天金阙成华盖，供养显灵溥济洪恩真君。 愿此香烟，供养九天金阙洪恩真君，灵济宫真仙圣众。 臣等归身归神归命真君众圣，以是捻香功德，上祝皇帝陛下。 恭愿道契唐虞，功侔轩昊。 垂衣御极，车书昭文轨之同。 负扆朝元，玉帛来梯航之远。 福寿永臻於圣体，忠良克赞於皇猷。",
      "translated_text": "The Bureaus of Yin and Yang, wondrously dispersing the myriad differentiated forms.\nThey array the sun, moon, and stars in the workings of Qian, establish mountains, rivers, seas, and peaks in the weave of Kun.\nAll things take shape, yet of these, humans are most noble.\nEvery kind nurtured into being relies wholly on the benevolence of transformation and nurturance.\n\nThis servant, by the name of [X], has long been bound by karmic affinity and thus gained intimacy with the true teachings.\nAdorned with starry pins and feathered robes, I have been steeped in the profound grace of rain and dew.\nEntrusted with duties and performing rites, I have partaken in the subtle transformations of the Dark Prime’s embroidered splendor.\n\nFor every prayer and petition, I humbly beseech responsive communion.\n\nBy imperial decree, we reverently undertake this pure jiao offering to gather blessings for the state and the household.\nThis morning, as we perform the Dao rites, we, the assembled dharma hosts, now raise the first pinch of incense, chanting in unison:\n\n*May this incense reach the Palace of Numinous Aid,\npervade the Nine Heavens’ golden towers to form a canopy of blossoms,\nand offer sustenance to the Illustrious Lord of Vast Grace and Universal Salvation.*\n\nMay the smoke of this incense serve as offering\nto the Lord of Vast Grace of the Nine Heavens’ golden towers,\nand to the perfected immortals and sacred hosts of the Palace of Numinous Aid.\n\nWe, your servants, surrender body, spirit, and life to the Lord and the assembled sages.\nThrough the merit of this pinch of incense,\nwe reverently pray for the August Emperor, His Majesty.\n\nMay his Dao harmonize with that of Tang and Yu, his achievements equal those of Xuan and Hao.\nMay he govern with effortless grace, his chariots and script unifying all under heaven.\nMay he face the screen and receive the court at dawn, jade and silk arriving from distant shores.\nMay fortune and longevity forever attend his sacred person,\nand loyal ministers capably assist his imperial designs.",
      "overlap_context": "s of the Upper Registers, Tallies, Cups, and Phoenix,\nthe Lad Who Transmits Dreams,\nthe Hierarchs of the Spirit Bureau,\nthe Incense Officers and Messengers on duty in the halls and before the altars,\nthe Earth Deities and all numinous spirits of the Temple of Numinous Aid.\n\nReverently we gaze upward, beseeching the Sacred Compassion to condescend and cast its penetrating gaze.\n\nThis servant has heard:\nThat which gives birth to Heaven and Earth is the primordial origin of the undifferentiated Qi.",
      "start_char": 1247,
      "end_char": 1518,
      "start_sentence": 32,
      "end_sentence": 47,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.983174562454224,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君集福早朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "今故烧香，自皈依真君大圣众至真之德，得道之后，保天长存，和：与道合真。 以今清旦行道，请法众等，运兹二捻上香，和：香至灵济宫，遍九天玉阙成宝盖，供养昭灵博济洪恩真君。 愿此香烟，供养九天玉阙洪恩真君、灵济宫真仙圣众。 臣等归身归神归命真君圣众，愿以是捻香功德，归流四岳九牧，庶尹百寮，彬彬佐运，秩秩同仁，寅亮而弼一人，献纳而毗庶政。 恭惟真君，协赞玄功，主张圣化。 辅皇朝之弘大，亿万斯年。 显神道之昭明，二五合德。 今故烧香，自皈依真君大圣众至真之德，得道之后，永保长宁，和：与道合真。 以今清旦行道，请法众等，运兹三捻上香，和：香至灵济宫，遍九天宫阙成云盖，供养灵济宫真仙圣众。 愿此香烟，供养圣父圣母、仙妃眷属，灵济宫真仙圣众。 臣等皈身皈神皈命真君圣众，愿以是捻香功德，归流九州四海，天下苍生，百室盈而妇子宁，五谷熟而人民育。 恭惟圣父圣母、仙妃眷属，注生堂一切圣众。 九天称庆，五帝监生。 周圆三炁之英华，混合二仪之精粹。 生根育秀，鉴黎民伸精祈恳祷之诚。 招神摄风，使比屋获嗣续蝉联之美。 凡伸皈向，悉遂感通。 今故烧香，自皈依真君大圣众至真之德，得道之后，永保长生，和：与道合真。 唱方 忏悔",
      "translated_text": "Now, therefore, we kindle this incense,\nsurrendering to the virtue and power of the Perfected Lords, the Great Sage Hosts, and the Most True,\nthat after attaining the Dao, they may preserve heaven and endure eternally.\n*In harmony: With the Dao, united in truth.*\n\nAt this dawn rite of the Dao, we invoke the Dharma assembly,\noffering this second pinch of incense.\n*In harmony: The incense ascends to the Palace of Numinous Aid,\npervading the Nine Heavens’ jade towers to form a canopy of treasures,\nas offering to the Lord of Manifest Numinosity and Vast Grace.*\n\nMay the smoke of this incense serve as offering\nto the Lord of Vast Grace of the Nine Heavens’ jade towers,\nand to the perfected immortals and sacred hosts of the Palace of Numinous Aid.\n\nWe, your servants, surrender body, spirit, and life to the Lord and the assembled sages.\nThrough the merit of this pinch of incense,\nwe reverently pray that its blessings flow to the Four Peaks and Nine Governors,\nto the myriad officials and all ministers,\nwho with refined virtue assist the turning of the times,\nand with ordered grace share in benevolent rule.\nMay they reverently illuminate and aid the One Sovereign,\npresenting counsel and sustaining all governance.\n\nWe humbly invoke the Perfected Lord,\nwho harmonizes with and augments the mysterious workings,\nupholding the sagely transformation.\nMay he magnify the imperial court’s grandeur,\nthat its glory endure for a hundred million myriad years.\nMay the luminous numinous Dao be manifest,\nand the dual forces of yin and yang unite in virtue.\n\nNow, therefore, we kindle this incense,\nsurrendering to the virtue and power of the Perfected Lords, the Great Sage Hosts, and the Most True,\nthat after attaining the Dao, they may forever preserve enduring peace.\n*In harmony: With the Dao, united in truth.*\n\nAt this dawn rite of the Dao, we invoke the Dharma assembly,\noffering this third pinch of incense.\n*In harmony: The incense ascends to the Palace of Numinous Aid,\npervading the Nine Heavens’ palatial towers to form a canopy of clouds,\nas offering to the perfected immortals and sacred hosts of the Palace of Numinous Aid.*\n\nMay the smoke of this incense serve as offering\nto the Sacred Father and Sacred Mother, the Immortal Consorts and their retinue,\nand to the perfected immortals and sacred hosts of the Palace of Numinous Aid.\n\nWe, your servants, surrender body, spirit, and life to the Lord and the assembled sages.\nThrough the merit of this pinch of incense,\nwe reverently pray that its blessings flow to the Nine Provinces and Four Seas,\nto all the people under heaven,\nthat every household be filled and wives and children dwell in peace,\nthat the five grains ripen and the people flourish.\n\nWe humbly invoke the Sacred Father and Sacred Mother, the Immortal Consorts and their retinue,\nand all the sacred hosts of the Hall of Life-Registration.\nMay the Nine Heavens resound with celebration,\nand the Five Emperors oversee life’s unfolding.\nMay the essence of the Three Qi’s radiance suffuse all,\nand the purest essence of heaven and earth unite in harmony.\nRooting life and nurturing growth,\nmay they witness the sincerity of the people’s earnest prayers.\nSummoning the spirits and commanding the winds,\nmay they grant every household the beauty of unbroken lineage and continuous progeny.\nAll who turn in devotion shall have their prayers answered.\n\nNow, therefore, we kindle this incense,\nsurrendering to the virtue and power of the Perfected Lords, the Great Sage Hosts, and the Most True,\nthat after attaining the Dao, they may forever preserve enduring life.\n*In harmony: With the Dao, united in truth.*\n\n*Chanting the directions*\n*Confession*",
      "overlap_context": "s.\nThrough the merit of this pinch of incense,\nwe reverently pray for the August Emperor, His Majesty.\n\nMay his Dao harmonize with that of Tang and Yu, his achievements equal those of Xuan and Hao.\nMay he govern with effortless grace, his chariots and script unifying all under heaven.\nMay he face the screen and receive the court at dawn, jade and silk arriving from distant shores.\nMay fortune and longevity forever attend his sacred person,\nand loyal ministers capably assist his imperial designs.",
      "start_char": 1518,
      "end_char": 2015,
      "start_sentence": 48,
      "end_sentence": 67,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.573607206344604,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君集福早朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "一二启 三礼 重称法位 具位某与临坛官众等，谨重诚上启 圣位。 伏闻九炁捆缢，结生根於紫户。 三元育养，凝命蒂於黄房，故胞胎魂魄，命之周圆，藉赤白青黄黑之混合。 敬诺敬顺，符惊天骇地之祥。 唱奉唱恭，契负阴抱阳之妙。 虽赋形於中土，实受炁於一玄。 臣等钦承上命，溥为下民，修斋诵经，烧香行道。 昭灵庥於遐迩，集景福於邦家。 伏冀广沛洪恩，诞敷玄造。 凡庶情之有恳，惟大德之无私。 生身蒙嗣续之荣，上世免若敖之叹。 上愿三光焕耀，四炁朗清，风雨均调，生民乐育。 则上明真君大慈之化，下副臣等皈命之诚。 谨启以闻。 十二愿 存神烧香 香官使者、左右神君、侍香诸灵官，当令向来早朝之所，自然生金液丹碧芝英，百灵众真，交会在此香火炉前。 当愿精诚上达，家国安宁，十方仙童玉女，接侍香烟，传臣向来所启之言，速达径诣九天金阙洪恩真君，九天玉阙洪恩真君圣前。 出堂颂 出户",
      "translated_text": "To the One and Two we invoke, with the Three Rituals we honor,\nReverently proclaiming once more the sacred ranks—\nWe, the assembled officiants and all present before the altar,\nwith utmost sincerity and solemnity, now humbly address the august thrones.\n\nWe have heard that the Nine Qi intertwine and bind,\nknitting the root of life at the Purple Portal.\nThe Three Origins nurture and sustain,\ncongealing the stem of destiny within the Yellow Chamber.\nThus, the embryonic soul and spirit,\nthe completeness of life’s mandate,\nrely upon the blending of red and white, blue and yellow, black.\nWith reverent assent and obedience,\nwe align with the wondrous signs that shake heaven and earth.\nWith devout chanting and reverence,\nwe harmonize with the mystery of yin embracing yang.\nThough form is bestowed within the central realm,\nqi is truly received from the Primordial One.\n\nWe, your servants, uphold the celestial mandate,\nacting on behalf of the people below.\nWe perform the fast, recite the scriptures,\nburn incense, and practice the Dao.\nMay numinous blessings shine afar and near,\nand luminous fortune gather for the nation and its households.\n\nWe humbly implore the vast outpouring of boundless grace,\nthe generous bestowal of the mysterious creation.\nFor all the supplications of the people,\nonly the great virtue remains impartial.\nMay the living receive the glory of lineage and progeny,\nand the departed be spared the lament of Ruo’ao.\nMay the Three Luminaries shine resplendent,\nthe Four Qi radiant and clear,\nwind and rain harmoniously balanced,\nand the people joyfully nurtured.\n\nThus, may the enlightened governance of the Perfected Lords and their great compassion be manifest above,\nwhile below, our devotion in surrender finds its answer.\n\nWe respectfully present this petition for your hearing.\n\n**Twelve Vows**\n**Invoking the Spirit, Burning Incense**\n\nIncense Officials and Envoys,\nLeft and Right Divine Lords,\nAttendant Incense Spirits—\nAt this place of early audience,\nmay golden liquid, cinnabar, and azure mushrooms spontaneously arise.\nMay the hundred spirits and host of perfected ones\nconverge here before this incense burner.\nMay our sincerity ascend on high,\nbringing peace to the nation and its households.\nMay the jade maidens and immortal youths of the ten directions\nattend the fragrant smoke,\nconveying our words of invocation\nswiftly to the Golden Gates of the Nine Heavens,\nbefore the august presence of the Vast Grace Perfected Lords of the Nine Heavens,\nthe Vast Grace Perfected Lords of the Jade Gates of the Nine Heavens.\n\n**Hymn of Departure from the Hall**\n**Exiting the Chamber**",
      "overlap_context": "rayers.\nSummoning the spirits and commanding the winds,\nmay they grant every household the beauty of unbroken lineage and continuous progeny.\nAll who turn in devotion shall have their prayers answered.\n\nNow, therefore, we kindle this incense,\nsurrendering to the virtue and power of the Perfected Lords, the Great Sage Hosts, and the Most True,\nthat after attaining the Dao, they may forever preserve enduring life.\n*In harmony: With the Dao, united in truth.*\n\n*Chanting the directions*\n*Confession*",
      "start_char": 2015,
      "end_char": 2404,
      "start_sentence": 68,
      "end_sentence": 91,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.426741361618042,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君集福早朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "洪恩灵济真君集福早朝仪竟",
      "translated_text": "**The Early Audience Rite for Invoking Blessings of the Vast Grace Numinous Aid Perfected Lord Concludes**",
      "overlap_context": "ere before this incense burner.\nMay our sincerity ascend on high,\nbringing peace to the nation and its households.\nMay the jade maidens and immortal youths of the ten directions\nattend the fragrant smoke,\nconveying our words of invocation\nswiftly to the Golden Gates of the Nine Heavens,\nbefore the august presence of the Vast Grace Perfected Lords of the Nine Heavens,\nthe Vast Grace Perfected Lords of the Jade Gates of the Nine Heavens.\n\n**Hymn of Departure from the Hall**\n**Exiting the Chamber**",
      "start_char": 2404,
      "end_char": 2419,
      "start_sentence": 92,
      "end_sentence": 92,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 1.2591710090637207,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\洪恩灵济真君集福早朝仪.txt",
        "category": "威仪类"
      }
    }
  ]
}