{
  "source_id": "海客论",
  "source_file": "chunked_daozang\\海客论.json",
  "total_chunks": 11,
  "total_original_chars": 10333,
  "total_translated_chars": 55491,
  "total_translation_time": 282.7543065547943,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\海客论.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "**The Discourse of the Sea Traveler**\n\n**Title:** *The Discourse of the Sea Traveler*\nComposed by Li Guangyuan (also known as Li Guangxuan) of Bohai during the late Tang and Five Dynasties period. Its content aligns with the spurious edition of *The Hundred Questions and Secrets of the Golden Elixir and Returned Cinnabar*, though the text is briefer and contains many errors. The author’s name avoids Song taboos, suggesting it was abridged by a disciple from *The Hundred Questions and Secrets*. One scroll.\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Great Mystery Section*.\n**Collated Edition:** *The Hundred Questions and Secrets of the Golden Elixir and Returned Cinnabar*.\n\n---\n\n**The Discourse of the Sea Traveler**\n\nThe sea traveler Li Guangyuan was a man of Bohai. Orphaned in youth, his family possessed vast wealth. Upon reaching adulthood, he sailed with fellow villagers to Qingzhou and Huaizhou as a merchant. Later, he crossed the sea again, where a Daoist traveled on the same vessel.\n\nThe Daoist asked him, “Who remains in your household, and what of your wealth? Why do you brave the sea?”\n\nLi replied, “I am orphaned with only my brothers, and our wealth amounts to ten thousand. The Daoist said, “Given this, why risk the winds and waves for profit? The boundless sea and its endless swells may overturn your vessel in an instant—fish and dragons would seize the chance, and none could foresee the outcome.”\n\nLi Guangyuan answered, “I do not cross the waves for profit. I reflect that all in this world is but a dream, like morning dew that cannot linger, or lightning that vanishes in a flash. Old graves are not yet dry before new ones follow. Heaps of gold buried in the earth are of no use to the dead; jade piled to the heavens cannot preserve life. Thus, I traverse the sea to enter the Central Kingdom, seeking perfected ones and realized masters, hoping to learn what practice might prolong my years. Having met no such teachers, I now return home—not for profit.”\n\nThe Daoist said, “You are still young, yet already weary of worldly desires and glory, aspiring to cultivate the Dao to extend your life. This is truly rare. Why doubt your destiny to ascend as an immortal?”\n\nLi Guangyuan replied, “How could an earthworm’s form become a dragon? A sandpiper’s smallness can hardly match the phoenix. I dare not hope for great awakening—if I might only learn the art of cultivating the body to prolong life, that would suffice. Should a noble master deign to instruct this unworthy one, I would be most fortunate.”\n\nThe Daoist said, “The great medicine of the Golden Elixir cannot be obtained without encountering a perfected one, but preserving life and prolonging years lies within its essence. The Golden Elixir resides within the body—there is no other medicine. If you can distance yourself from the bedchamber, purify the turbid to attain clarity, rest your head on stone, rinse your mouth with flowing water, shed vexations for tranquility, and prevent the dissipation of primordial *qi*, you may attain longevity. This primordial *qi* is the original, undifferentiated *qi* within the body—the foundation of a person, the root of life. When thoughts cease, *qi* stabilizes; when spirit is at peace, *qi* settles. Thus, the wise still their judgments, sever sensory desires, ensure their breath does not stray beyond the nose, and direct their thoughts inward. When the Three Fields yield their treasures, longevity is assured. Further practices—absorbing the new and expelling the old, rinsing and swallowing saliva—all serve to extend life and secure the body. As the ancient song says:\n\n*Qi* is the medicine that adds years,\nSaliva the herb that extends life.\nThe world rushes and races in vain—\nWho else should one seek but oneself?”\n\nThis is the truth made clear.\n\nGuangyuan remarked, “The noble one’s bearing and appearance are extraordinary—surely this is the proof of it.”\nThe other replied, “I have practiced this Way and thus attained such a state. Now I am a hundred years old, yet illness has never touched me.”\nGuangyuan bowed again in gratitude and said, “How fortunate I am to hear of the great Dao! Had I not a predestined affinity, how could I have beheld this?”\nThe Daoist then disembarked on the eastern shore, intending to travel to Silla, and so they bade each other farewell.\n\nGuangyuan returned to Bohai and, following this Way, turned away from worldly vanity. He withdrew to Changyun Island, where he cultivated himself for several years. The benefits and confirmations were evident, and because of his comings and goings, people of the time called him the “Sea Traveler.”\n\nLater, Guangyuan reflected that among the teachings of the world, there must be a gate to transcendence, a Way of golden elixir and jade liquid. Dwelling only here, how could he ever attain it? The Central Lands abounded with famous mountains and sacred realms of the various schools. Thus, he abruptly left the island and journeyed among the renowned mountains to seek these matters.\n\nOn the third day of the eighth month in the *jisi* year, he arrived at Mount Song’s Shaoshi Peak. He lodged in a monastic guesthouse for over ten days. Later, he walked south alone, surveying the ravines and valleys. After five or six *li*, he suddenly encountered an elderly man beneath a pine by the roadside. The man leaned on a staff adorned with three gourds, wore a short hemp robe and a long headscarf, and bore an air unlike ordinary people.\n\nThe old man asked Guangyuan, “What are you doing here?”\nGuangyuan replied, “Nothing in particular—just admiring the mountains and waters.”\n“Where have you come from?”\nGuangyuan said, “For ten years, I have come from the sea, traveling through famous mountains until I reached this place. What brings you here?”\nThe old man said, “I was orphaned young, with a family fortune of ten thousand. I always scorned glory and wealth, caring only for the wondrous Dao, and so I came here.”\n“How many years have you sought the Dao? Have you encountered anything?”\nGuangyuan said, “I have wandered within the seas for over twenty years. Several years ago, on a boat, I met a Daoist who taught me to preserve and nurture essence and *qi*, and to guide and stretch the four limbs. Following his instructions, I have seen some confirmation.”\nThe old man said, “If so, then the Dao is already accomplished. What more do you seek?”\nGuangyuan replied, “I have heard that the Way of immortals includes the arts of golden liquid and returning elixir. Fearing I might waste my years in vain, I have secretly set my heart on seeking them.”\nThe old man asked, “In your search for the golden liquid and returning elixir, have you encountered anything?”\nGuangyuan said, “I have sought them for ten years but have found nothing.”\nThe old man smiled faintly and said, “Do you recognize me?”\nGuangyuan replied, “I am dull and do not recognize this noble one.”\nThe old man said, “I am Master Yuanshou.”\nHe then asked, “What is your surname?”\nGuangyuan said, “My surname is Li, and my name is Guangyuan.”\nThe old man laughed again and said, “My style is Yuanshou, and your name is Guangyuan—we match each other. I have found my man.”\nHe then asked, “In seeking the Way of the golden elixir, do you do so for others or for yourself?”\nGuangyuan replied, “If I can achieve it for myself, I will also lift up those with the proper destiny.”\nThe master said, “This may be transmitted. If it were only for oneself, immortality would not be granted.”\nGuangyuan bowed again in gratitude.\nThe master said, “Had you not a predestined affinity, even if you labored your whole life, you would not have encountered this. Your immortal bones are already manifest, and your spiritual foundation is gradually taking shape. If you truly listen to my words…”\nHe then set down his staff and sat upon a stone, gesturing for Guangyuan to sit as well.\nGuangyuan said, “If the master wishes to transmit the supreme Dao, how can I, unworthy as I am, be so discourteous?”\nThe master replied, “The supreme Dao is not distant. In the space of this single day’s discourse, its mysteries may be exhausted. I cannot let you stand for long.”\nGuangyuan then bowed and sat.\nThe master said, “The returning elixir is not some other medicine. The true One is its foundation; lead and mercury depend on each other; the yellow sprout is its root—only then can it be accomplished.”\nGuangyuan said, “I have seen people of the time discuss the yellow sprout, but none know its profound principle. Without knowing the yellow sprout, what can be used to refine and complete it?”\nThe master said, “Lead emerges from within lead—only then is it the supreme treasure. Mercury transmits the *qi* of gold—only then is it called the yellow sprout. Have you not seen the ancient song:\n\n*Yellow sprout, lead, and mercury refine,\nThe yin husk holds the yang flower.\nWithout the principle of the yellow sprout,\nThe returning elixir’s path is distant.*\n\nPeople of the world refine the supreme medicine,\nAll mistaking it for yellow blossoms.\nLead yellow is a dead thing—\nHow could it reach the immortals’ home?\n\nThe yellow sprout is not in medicine;\nFrom the inner image, take its essence.\nIf you reach the yellow sprout’s ground,\nGold and silver are but empty boasts.\nThis is what it means.”\n\nGuangyuan said, “I have seen *The Five Categories of Gold and Jade*, which says, ‘Lead has great toxicity. How can it accomplish the supreme medicine?’”\nThe master replied, “Though it has great toxicity, that is because people of the world do not understand how to use it. For example, among the world’s toxic medicines, are there not many like croton? Yet if one knows how to use them, they can cure illness. Lead is the same. Thus, *The Ode of Tao Zhi* says:\n\n*Within lead there is gold,\nWithin gold there is treasure.\nThe wise obtain it—\nWould they refine gold from lead\nRather than treasure from gold?*\n\nThis is not the lead of the world. People of the world directly use lead, hoping to obtain the yellow sprout, but not one in ten thousand succeeds. This is because they neither recognize nor understand lead.”\nGuangyuan asked, “Are there two kinds of lead?”\nThe master said, “Lead is not two. It is like raising a child: if you cut flesh from the parents’ bodies and place it in the child’s belly, how could the child be born? If separated from the parents, how could the child come into being? The ancient song says:\n\n*The crucible is fundamentally without crucible,\nThe medicine fundamentally without medicine.\nThe yellow sprout does not use lead—\nIt must be made from within lead.\nThe yellow sprout is the yellow sprout,\nBut lead is ten thousand *li* from lead.\nThe yellow sprout is not the yellow sprout—\nOnly in lead does it begin.\nLead is the father of the sprout,\nThe sprout is the child of lead.\nThe child hides in the mother’s womb,\nThe mother hides in the child’s placenta.\nKnow the white, guard the black—\nSpiritual illumination will come of itself.*\n\nThis is what it means. Thus, the various scriptures praise only the efficacy of lead.”\n\nIf one abandons this lead, it is like forsaking parents to seek a child. The ancient song says:\n\n*Do not ruin my lead—\nLet my life be preserved.\nDo not break my chariot—\nLet me return home.\nIf lead severs the river chariot, all efforts are in vain;\nIf lead shatters the river chariot, all works come to naught.*\n\nIt also says:\n*The Mystery arises from the Golden Duke,\nMajestically standing at the very beginning.*\n\nAnd again:\n*A single thing contains five hues.*\n\nThe *Taozhi Pian* states:\n*The union of five hues accords with the natural Dao,\nThus giving birth to heaven and earth, becoming female and male.\nThen the essence of the sun is returned to the moon’s cavern,\nThe flower of spirit congeals within the void,\nAble to generate the essence of purple qi,\nSecretly uniting with the true in perfect harmony.\nWere one not an immortal, none could perceive this.*\n\nThose who do not understand or comprehend it will err by the slightest misstep, losing it by a thousand *li*. Thus the song says:\n\n*To use lead yet not use lead,\nOne must work within lead.\nIf common folk use lead,\nUsing lead is still wrong.*\n\nAnother song says:\n*To use lead, do not use common lead—\nThe lead used is the old cinnabar field.*\n\nAll these make clear that one must not abandon lead but rather understand how to employ it. When used, yin and yang fall into order; when misapplied, husband and wife turn against each other. The key lies in delving deeply into lead. The *Yuanyangzi Song* says:\n\n*True yin and true yang are the true Dao,\nRight before your eyes—why seek afar?\nFools year after year refine divine elixirs,\nSuddenly seeing blue and yellow, they call it good.\nThose of resolve must seek the Dharma’s rule,\nLest they waste their spirit in vain confusion.\nIf one can but obtain the true yellow sprout,\nThose who ingest it will live without aging.*\n\nThis is evident.\n\nGuangyuan says: I have often heard people claim that cinnabar and mercury are the yellow sprout. What principle is this?\n\nIt is said: This is not the teaching of the perfected ancients. Cinnabar and mercury, lacking fixed nature and form, cannot generate life—just as a woman cannot conceive alone. Thus the *Li Xichan Pian* says:\n\n*Cinnabar and mercury dwell together,\nYet the two maidens never know each other.*\n\nIf self-establishment is so difficult, how can the great Dao be achieved? The yellow sprout arises from the union of Kan and Li, the mutual generation of metal and water, the crowning of the male and the readiness of the female, the following of female and male. From non-being it enters being; when yin stirs and bowels intertwine, only then can it be accomplished, in accord with the highest principle. Thus the *Yin Zhenjun Song* says:\n\n*The true qi of the north is the river chariot,\nThe Jia and Yi of the east are golden sand.\nWhen the two essences nurture and return as one,\nThe Vermilion Bird stirs and gives birth to the golden flower.\nThe golden flower can generate heaven and earth’s treasure—\nThose who grasp this speak the true Dao.*\n\nThis is evident.\n\nGuangyuan says: I have also seen people take gold as the yellow sprout, silver as the yellow sprout, refined cinnabar-silver as the yellow sprout, extracted silver as the yellow sprout, or tin, bamboo-node lead, Jin Yao lead, desiccated lead, and the like as the yellow sprout. Others take litharge, red lead, or lead-yellow-flower as the yellow sprout. What principle is this?\n\nIt is said: None of these are correct. All such substances are crude and inert; when refined, their color fades and form withers; when burned, they turn to dust or mutate into earth. They are but dry bones and dead flesh—what use are they? Solitary yin and widowed yang cannot match the supreme transformation. Ingesting them scorches the viscera; consuming them shortens one’s years. How could they compare to the yellow sprout or approach the great Dao?\n\nThe yellow sprout arises from the union of lead and mercury, the merging of metal and wood, the intercourse of dragon and tiger, the restraint of water and fire. By aligning emotion with nature, making the hun follow the po, it fulfills the work of return and reversal, clarifies the principle of breath, and thus achieves the union of yang and the conception of yin. The mother is preserved within the child, obtaining heaven and earth’s essence to complete the primordial Dao. The ancient song says:\n\n*Mercury does not reveal its ore,\nGold does not expose its form.*\n\nAnd again:\n*Cinnabar is the essence of wood,\nOnly when joined with metal does it unite.*\n\nAnd again:\n*When the dragon comes, the body contracts and the hun is sated;\nWhen the tiger comes, it devours and generates marrow and fat.*\n\nThis is now clear.\n\nGuangyuan says: If the yellow sprout is said to be made from lead and mercury, the mutual generation of metal and water, I remain confused and do not yet understand how it can be accomplished.\n\nIt is said: It is like farming in the human world. When planting crops, farmers first plow and select good land, then await the proper season, relying on wind and rain to harmonize, the seasons to hasten growth. By year’s end, the harvest is reaped in full. The cause of the yellow sprout is the same. By harmonizing lead and mercury, matching Kan and Li, water and fire following one another, the time fully ripening, they naturally unite, transforming beyond compare. When the yellow sprout is formed, the great Dao is complete. The song says:\n\n*Lead and the yellow sprout, together with the three flowers,\nGather my qi to congeal into cinnabar.\nFirst, the sun’s movement is like fire’s conveyance,\nFive hues hidden within the divine flower.\nOnce made the servant, the Dao is without flaw—\nWhen the three are complete, one is a immortal.*\n\nThis is evident.\n\nLord Guangyuan asked: \"Having now heard of the yellow sprout, how then is the supreme medicine formed? I venture to inquire into its essential principle.\"\n\nThe master replied: \"The supreme medicine employs only the Five Phases—nothing else is added. Should any extraneous elements be introduced, it ceases to be the supreme medicine. An ancient song says:\n\n*Seize the Azure Dragon of the East,\nPair it with the White Tiger of the West.\nThen take the Vermilion Bird of the South,\nTo meet the Dark Warrior of the North.\nYet the subtlest art lies within—\nLose not the Central Earth.*\n\nThis is evident. These Five Phases are the fundamental categories of lead, by which the elixir is formed. If non-conforming elements are present, the elixir cannot be achieved. It is like a household of father, mother, husband, and wife—no outsiders may enter. Lead, mercury, and the Five Phases are likewise.\"\n\n\"When subdued and congealed into medicine, the bones, flesh, essence, qi, and blood vessels are all complete, and only then is it fit for ingestion. Another ancient song says:\n\n*Why speak of Metal, Wood, Water, Fire, Earth?\nTo preserve the body and safeguard life—these are Dragon and Tiger.\nIf students fail to recognize the essence of the Five Phases,\nThey mistakenly take others for their parents.\nWood governs qi, the Tiger governs bones,\nBlood governs Water, flesh governs Earth.\nThe Way of immortality lies in the Li Palace—\nWhen the Five Phases are mastered, the body has its lord.\nThe Five Phases must be kin to mercury,\nFor external substances are unfit as companions.*\n\nAnother song by Helan Qiu states:\n\n*The Azure Dragon rises, the White Tiger rests,\nThe Dark Warrior soars, the Vermilion Bird sits,\nThe Yellow Dragon in the center bears fruit itself.\nMother cherishes child, child cherishes mother,\nIn the crucible, a single cloud congeals—\nIngesting a knife-tip’s measure, nothing is impossible.*\n\nThis is the Dao.\"\n\nLord Guangyuan asked: \"Though the great medicine arises from the Dragon and Tiger’s subjugation and the true qi of the Five Phases, when it comes time to ingest it, what is its most essential form?\"\n\nThe master replied: \"The completed medicine is but a single substance—mercury. Though it is the embryo of divine water and becomes purple-gold powder, already containing the five hues and manifesting the Five Phases, when embodied, it is called the Golden Liquid Returned Elixir. The immortals of highest antiquity all followed this single method. An ancient song says:\n\n*Mercury alone is the immortal’s medicine,\nPassed down through ages, its fire-taming hard.\nWhen the River Chariot transforms it to purple powder,\nThat powder in an instant becomes the Golden Elixir.*\n\n*The true method of the Golden Elixir has no hooks,\nMercury alone is most profound.\nA knife-tip’s touch verifies its transmutation—\nIngest it, never die, and sail the immortal’s boat.*\n\nAnother song says:\n\n*Take the drawn-out mercury,\nReturn it to burning, reverse it to cinnabar.\nIn the womb, it receives the five hues,\nWhen the moon is full, it is the yellow sprout.\nLost on the path, it cannot be seen—\nFace to face, yet separated by heaven and sea.\nWhen you reach the River Chariot’s ground,\nThis alone is the immortal’s home.*\n\nThis is clear.\"\n\nGuangyuan asked: \"If mercury refined by fire becomes an elixir, then since ancient times there have been many who have subdued cinnabar and mercury with fire—why is it that none of them have prolonged their years through ingestion, nor found success in transmutation? What is the reason for this?\"\n\nThe master replied: \"This is because they have not grasped the wondrous arts of the immortals, have not followed the principles of the scriptures, have not mastered the system of the Five Phases, and have not obtained the essence of the sun and moon. Some have mixed incompatible substances, while others have strayed far from the utmost truth. Even if they refine a thousand pounds of mercury with fire, it is no different from tiles and stones. Not only is it useless for transmutation, but ingesting it will even shorten one’s lifespan. Thus, the *Biography of Master Wang* states: 'In ancient times, there were two brothers who took a pound of mercury to Yangshan and refined it for three years. The mercury, subdued by fire, turned the color of red glass, and they believed it to be the supreme elixir. Each brother ingested half a pound, but within six months, they were wearing padded robes and had to be supported while walking. What they hoped would prolong their years instead harmed their bodies. Is this not due to the differences in medicinal substances and the errors in their methods? This serves as clear proof. Those who seek the truth must obtain the true formula—then not one in ten thousand will fail.\n\nSince the Yellow Sprout is the foundation of the great elixir, and the elixir is formed by the Five Phases, one who understands the true origin—how could they not transcend the world? I do not yet know the proper measurements, the duration of refinement, or the method for achieving success. I humbly request the formula.\"\n\nThe master said: \"The measurements of the immortal’s supreme elixir are not fixed by the great Dao. The refinement of the Golden Elixir follows a rhythm, for not only must the furnace and vessel take proper form, but the crucible must also embody Heaven and Earth. The fire begins at *zi* as its starting point, and one must understand the hexagrams’ omens. It continues from *li* and ends at *hai*, only then will the radiant splendor appear. This is like a child in the womb, which must await the fullness of the moon, or a chick within the egg, which must endure the cycle of the sun. As for measurements, the two eights dwell together; as for timing, a single stellar cycle must be completed. Only then can the dragon rise with clouds and rain, and the tiger roar upon the mountain crags—naturally prolonging one’s years above the world, rather than becoming a dead thing of the mortal realm.\"\n\nA song says:\n*The maid of sixteen, the essence of lead,\nWhen yang arises, kindle the fire; when yin is exhausted, cease.\nA stellar cycle completes the rain—\nThe supreme elixir attains numinous power.*\n\nAnother verse by Tao Hongjing in *Gazing at the Southern River* says:\n*The elixir of long life is formed by the Five Phases.\nThe gates of *zi* and *wu* open, while *mao* and *you* govern the four seasons.\nFire unites with Heaven and Earth—\nDragon and tiger devour each other.*\nThis is what it means.\n\nGuangyuan said: \"I have received your instruction on the Great Elixir. Yet I have seen in various texts many names—*Sun’s Essence and Moon’s Spirit, White Tiger and Azure Dragon, Cinnabar and River Chariot, True Lead and Proper Mercury*—which confuse the mind. I do not yet know which among these is the correct designation. May I ask the reason?\"\n\nThe master replied: \"Though there are many names, they all follow the same path. The *Sun’s Essence* is the essence of yang; the *Moon’s Spirit* returns to the body of yin. The *Azure Dragon* is Wood, how could it depart from the East? The *White Tiger* is Metal, and thus resides in the West. *River Chariot* and *Golden Liquid* are the favored names of immortals. *True Lead* and *Proper Mercury* are the designations of those who have attained understanding. As long as one grasps the subtle workings, what need is there for hesitation? They do not transcend the Five Phases, nor is there any other principle.\"\n\nGuangyuan said: \"I have also seen in the *Yellow Emperor’s Scripture of the Hidden Talisman* that among the hundred methods of the Returned Elixir, the essential lies in the *Divine Water* and *Flowery Pond*. Within the Flowery Pond, the utmost spirit and wonder reside. Thus, the Yellow Emperor encountered this and ascended to perfection, and Ma Ming thereby attained the Dao. The principle of the Flowery Pond is fully expounded in the earlier chapter on the Five Phases. Thus, the *Song of Master Yuanyang* says:\n*The Divine Water and Flowery Pond are rare in the world,\nTheir transmission forbids the knowledge of the vulgar.\nIf worldly lead and mercury are used,\nThey will only deceive people forever without doubt.*\"\n\nGuangyuan said: \"I have seen in various elixir scriptures the phrase: *Three, Five, and One—the essence of Heaven and Earth.* I do not yet understand what this refers to.\"\n\nThe master replied: \"The earlier chapter thoroughly explained that *Three, Five, and One* are also the Five Phases—nothing else. If you study this further, you will surely reach the root. Have you not seen the ancient song:\n*Yin’s *kan* vainly seeks the One,\nYang’s *li* takes the Five’s radiant form.\nTo know the three places,\nEmbrace the spirit of Wood.\nRefine the elixir—first master the secret,\nThen delve into the ancient scriptures.\nWhen you complete the numinous cinnabar,\nHeaven’s chariot will plow the five clouds.*\"\n\nGuangyuan said: \"Among the myriad medicines in the world, why is it that only the *Golden Liquid Returned Elixir* can prolong life, preserve longevity, and even ascend one to perfection?\"\n\nThe master replied: \"Your ignorance is such that you still do not understand. As for the people of the world...\"\n\nAll things in the world are endowed by the Five Phases, and their life extends to the heart, liver, spleen, lungs, and kidneys—how could they depart from the Five Phases of yin and yang? When one comprehends the essence of the Five Phases and unites it with the radiance of all phenomena, penetrating the wondrous use of *purple gold*, its flowing nectar earns the name *Pool of Flowers*. Consuming it, how could one not secure the four limbs, fortify the five viscera, naturally attain longevity, and transcend the world as if it were already before one’s eyes?\n\nYet the deluded cling to the ancient song:\n*\"Golden sand enters the five viscera,\nMist scatters like wind and rain.\nSteaming, it reaches the four limbs,\nAnd one’s complexion becomes bright and fair.\nThe old man regains youthful vigor,\nThe aged woman becomes a maiden once more.\nWhite hair turns black again,\nFallen teeth grow anew.\nThus is one called a True Person.\"*\n\nAs for mineral medicines, the Five Phases do not record them. Consumed raw, they poison and harm the organs; refined by fire, they differ little from tiles and pebbles. They may cure minor ailments, but how can they compare to the Great Elixir? The principle is clear, the true source unobscured.\n\nHerbal medicines, subject to the decay of the four seasons, cannot withstand frost and snow. Though a thousand flavors may blend, they only treat wind and dampness—how can they compare to the Great Elixir?\n\nGuangyuan asked: \"The Golden Elixir, when consumed, grants long life and even ascension to immortality. Beyond this, what other use does it have in the world?\"\n\nThe master replied: \"Deluded, oh so deluded! Does the Great Elixir of the Golden Medicine have no other use? When this elixir is complete after a year, its ten-month cycle fulfilled, opening the furnace yields *purple powder turned gold*, and lifting the cauldron scatters the *yellow sprout* in abundance. It encompasses the five colors and gathers the hundred spirits. First, it transmutes mercury into yellow gold. Only then is it verified that after ingestion, one’s sinews and bones are eternally fortified, life and household are saved—this is no empty word.\n\nAs the ancient song says:\n*Cinnabar, oh cinnabar,\nYou save my life, you save my home.*\n\nAnd Tao Hongjing’s *Wang Jiangnan*:\n*When the tenth month is full,\nOpen the cauldron—a mass of red.\nA few flecks of lingering frost hold the five colors,\nThe divine water of the embryo rings clear,\nIts fragrance rich and rare.*\n\nThus may it be known.\n\nGuangyuan asked: \"Beyond this *yellow sprout*, what other medicine can turn mercury into a treasure?\"\n\nThe master replied: \"Beyond this *yellow sprout*, there is no other medicine.\"\n\nGuangyuan asked: \"How are other medicines refined?\"\n\nThe master said: \"What is refined is mercury. Mercury is the essence of heaven and earth, the spirit of the five metals. Its nature is fluid and unstained by impurities—hence the common saying that mercury is without falsehood. How could other substances enter the *yellow sprout*? The *yellow sprout* is inherently mercury, formed by the essence of the Five Phases. Without it, nothing is achieved.\n\nYet people exhaust their days and strength seeking the essence of alum and minerals, traveling thousands of miles in vain. Even if they obtain them, they achieve nothing in the end, their thoughts labored and hearts weary, only to return to the yellow springs. Is this not lamentable? All because they do not understand the nature of medicines, nor recognize that like gathers with like. Alum and minerals do not share the same origin as metal. Since mercury is the spirit of gold, how can mineral medicines enter and transmute it into gold?\n\nThus the song says:\n*Gold can be made, the world can be delivered.\nIf gold is not made, you only deceive yourself.*\nThis is no falsehood. The great joy lies before your eyes, yet people remain unaware. To insist on using alum and minerals is like seeking fish in the mountains or casting nets for rabbits in the sea—how can it succeed?\"\n\nGuangyuan asked: \"Some people use the five metals as a crucible to refine mercury, yet after years of effort, nothing is achieved. What is the reason?\"\n\nThe master replied: \"The five metals are mere worldly substances, not the supreme medicine. The *Yellow Sprout* chapter explains this in detail. Moreover, the art has its hidden secrets, the Dao its profound subtleties. Only through oral transmission and heart-to-heart instruction can the elixir be completed. Yet people recklessly rely on superficial sayings, blindly following ancient formulas to refine mercury, seeking great attainment. They do not realize that the Five Phases contain gestation like a pregnant woman, and lead and mercury depend on each other like a morning hen brooding her eggs. As for the wondrous Dao, it connects to the divine. The slightest deviation disrupts the order of yin and yang.\n\nThus Tao Hongjing’s *Wang Jiangnan* says:\n*The secret of the Returned Elixir,\nA wondrous art passed mouth to mouth.\nIf you trust ancient formulas, you will surely err,\nTossing and turning, wasting money in vain—\nDo not blame the immortals.*\n\nAnd his *Pusa Man*:\n*Every household has the medicine of long life,\nYet people use it incorrectly.\nThe qi and timing still drift and sink—\nWhere, sir, do you seek it?\nBefore your eyes, yet unrecognized,\nYou mistakenly search in lead.\nThis thing lacks the yellow sprout,\nWasting years in vain.*\n\nExamine this principle closely, and you will understand.\n\nGuangyuan asked: \"The four yellows and eight minerals have no relation to the Great Dao and do not harmonize with mercury. Yet sulfur can instantly refine mercury into cinnabar. What is the reason?\"\n\nThe master replied: \"Mercury is true yin, sulfur is borrowed yang. True qi is restrained by borrowed yang, and they depend on each other from beginning to end—this is the great principle of yin and yang. Moreover, sulfur is the liquid of alum, alum is the fluid of iron, and magnetite is the mother of iron. Needle sand and magnetite refine sulfur into *cloud powder*—this is one root. Sulfur is thus the descendant of iron, while mercury is the essence and spirit of gold. Though the two qi temporarily harmonize, they ultimately achieve nothing. Only by carefully investigating the principle can the root be seen.\"\n\nGuangyuan asked: \"Various alums cannot refine mercury, nor do they harmonize with it. Yet I have seen green alum mixed with salt refine mercury into powder or frost. What is the reason?\"\n\nThe master replied: \"Mercury is the spirit and soul of gold. Green alum is the essence of iron. In terms of the five metals, the two qi share a root, but in the discourse of lead and mercury, copper and iron are far apart. Thus, green alum can temporarily refine mercury into powder, but it serves no great purpose.\"\n\nJust as when refining yellow arsenic by sublimation, covering its vessel with a lid turns it white—yet without salt, its color remains unchanged. All such matters are trivial and unrelated to the Great Dao. You must simply delve deeply and forever cast aside distractions.\n\nThe ancient scriptures say: *\"Flying mice follow mercury; the river chariot subdues it.\"* If杂 impurities are present, there can be no success. An old verse declares:\n\n*\"By the riverside, an old woman,\nMost wondrous and divine.\nAt fire’s touch, she takes flight,\nUnsoiled by dust or grime.\nLike ghosts concealed or dragons hidden,\nHer whereabouts unknown.\nTo master her, the yellow sprout\nMust be the root alone.\"*\n\nThis much is clear.\n\nGuangyuan asked: \"The world does not understand lead and mercury, nor does it recognize the Five Phases. People use the Four Yellows to refine mercury, the Eight Stones to concoct the supreme elixir, and employ every manner of preparation—alum, male and female minerals, magnetite, arsenic, chalcanthite, and green vitriol—all to no avail. They mistake divine frost for black tin, or revere the ignorant as sages. They temper with fire a thousand times, refine with water ten thousand cycles, tend the crucible for three years, or watch the furnace for five—yet achieve nothing, exhausting their spirit in vain. I fear that even immortals may not know: among all the alums, has anyone truly succeeded in refining mercury? I humbly request an outline of the method.\"\n\nThe master replied: \"In all things under heaven, even the most minute, nothing exists without principle, analogy, or affinity between kindred types. How can this remain obscure? Mercury is the essence, spirit, and marrow of gold. It shares a root with lead and a body with water. Within the Five Phases, they conceive one another; metal and water generate each other. Only when qi transforms into radiance does the supreme elixir take form. Once transmuted into mercury, its changes are boundless, its transformations infinite—unmatched in the world.\n\nThus, *The Treatise of Tao Hongjing* states: *'Metal is the mother of water; the mother conceals the child in her womb. Water is the child of metal; the child nests within the mother’s embrace.'* This speaks of how metal and water naturally contain one another, the calf hidden within its mother, awaiting transformation to coalesce. *'The eldest son inherits the father’s body, establishing lineage through the mother.'* This means cinnabar is born of metal, and mercury flows as its child—nurtured by gold, it inherits the body and flourishes. The Dao accords with nature; its workings are profoundly subtle, beyond knowing, beyond thought.\n\nIf one relies on alums, stones, or miscellaneous substances, the form and essence become entirely estranged, the ancestral lineage lost, and return to the origin impossible. It is like birds and chickens sharing a nest, or cats and mice dwelling in the same burrow—like using lacquer to mend a cauldron, or mercury to treat a wound. Not only is there no benefit, but harm is certain. A song says:\n\n*'The world prefers the false over the true,\nMixing stone medicines with mercury.\nThe alchemical maiden scatters into mist,\nLeaving only vain repute to cling together.\nAlums and chalcanthite drain one’s estate,\nFools trust charlatans as kin.\nWithout encountering immortals to speak of the supreme principle,\nOne’s white-haired years end in futility.'*\n\nThis, too, is clear.\"\n\nMoreover, mineral medicines number roughly seventy-two in total. The sages of antiquity carefully distinguished their sour and salty properties, recording them in medical treatises—yet these serve only to treat various illnesses and repel demonic influences, bearing no relation to the workings of creation nor aligning with the Five Phases. Even if one were to obtain an original formula and master its most subtle refinements, it would but temporarily preserve the hair and temples; how could it ever transform the sinews and bones?\n\nThe world, lost in delusion, recklessly transmits these methods, deceiving others with claims of divine transcendence. They recklessly grind alums and stones together with lead and mercury, mix them with willow ash, boil them with jujube leaves, or refine them with vinegar and honey. Some even sublimate them with water or wine—yet never achieve success, squandering their days in vain. They speak of \"solidifying the crucible,\" yet iron and stone prove no match for true firmness; they boast of \"covering and insulating,\" yet before long, all efforts come to naught. After three years of labor, what remains has crumbled to dust. Then they claim that chickens and dogs have ascended, or that dragons and serpents have transformed—never realizing the principle of the Great Dao, blindly blaming heaven and resenting others. Such deluded souls are not rare in this world.\n\nStill others exhaust every mineral and herb under heaven, depleting their wealth in pursuit, their minds growing ever more confused. Is this not lamentable? Guangyuan said: \"People take mulberry wood ash to refine cinnabar and mercury.\" An ancient song states:\n\n*'The dragon dwells in the forty-eighth position of Zhen.'*\n*(Note: Zhen (震) is the third trigram, corresponding to the character \"sang\" (桑, mulberry).)*\n\nAnother song says:\n*'Gather it before the silkworms feed,\nUse it after the fire’s transformation.'*\n\nThese are all said to be the root of the Great Medicine—yet who truly knows if this is so?\n\nIt is said: The foundation of the Great Medicine has already been fully expounded. As for using mulberry ash and the like, these are all inventions of the deluded, recitations of fools, passed down in succession yet achieving nothing. The \"forty-eighth position of Zhen\" mentioned in the Immortal’s song refers to the weight and directional alignment of the supreme medicine, not the character for \"mulberry.\" The unenlightened, failing to grasp this, cling to emptiness, chasing illusions like deer pursuing sheep or apes grasping at the moon. How could they ever succeed? The Great Medicine relies purely on the Five Phases, with no other substances involved.\n\nAlum mixed with other stones still fails to form the elixir—how much further astray are those who rely on mulberry firewood and the like! Thus the *Cantong Qi* states: \"Foxes do not nurse horses, nor do swallows give birth to phoenixes.\"\n\nGuangyuan said: \"Many in the world take soot from chimney flues, claiming it to be the essence of wood, matching it to the position of the Green Dragon.\" The *Song of Yuanyangzi* says:\n*\"To know cinnabar as the essence of wood,\nMove it west to join with metal.*\n*Where do the deluded seek Dragon and Tiger?\nIn the dim vastness, all is vague and obscure.\"*\nThis is precisely the case.\n\nOthers seek well salt from Yongzhou or use the *Taiyin* Primordial Essence Stone to pair with the White Tiger’s image. How could this align with the true Way of Dragon and Tiger, the origin of the Great Elixir?\n\nI say: How deeply you struggle to awaken! The supreme Way is not distant, yet people fail to recognize it. Fools and the wise alike pass down these errors—how lamentable! The supreme medicine is a living, transformative substance, its nature concealed in immortal records, extending human life below. Those who obtain it understand the Five Phases intuitively; those who encounter it see all phenomena illuminated. Once the golden elixir is achieved, poverty and illness vanish together.\n\nAs for soot, ore, and primordial essence—these are dead things of the world, no different from tiles and pebbles. Ingesting them halts the flow of blood and qi; refining them exhausts the spirit. How could they transform into the Great Elixir? The truth lies before your eyes, yet the deluded remain blind.\n\nThe *Song of Yuanyangzi* speaks of the true Way of Dragon and Tiger—how could it refer to soot and ore? Yuanyangzi was a true immortal; how could he be so misled? The true Dragon and Tiger are the essence of the returning elixir, the heart of lead and mercury. Immortals have expounded this clearly in scriptures and treatises, yet the deluded grow ever more confused.\n\nThus the *Inscription of the Golden Elixir* states:\n*\"Cinnabar’s position is not inherently red;\nArranged through the four seasons, it resides in the southern abode.*\n*Belonging to the south, the fire of Bing and Ding,\nIts form is red.\"*\nExtract the mercury within cinnabar, and it aligns with the east, the wood of Jia and Yi—its form is the image of the Green Dragon.\n\n*\"Black lead is not inherently black;\nWithin it holds the embrace of the Five Virtues.\"*\nMatching the north, the water of Ren and Gui, its form is black. Extract its essence, and it belongs to the west, the metal of Geng and Xin—its form is white, the image of the White Tiger.\n\nThe song says:\n*\"When the Five Phases do not proceed in order,\nThe Tiger is born within water.*\n*When the Five Phases are inverted,\nThe Dragon emerges from fire.\"*\n\nThe *Rhapsody of the Golden Elixir* also states: \"Fire turns east to become the Dragon; water revolves west to become the Tiger.\" Li Bingchan said: \"The *Taiyin* resides in the southern abode; the *Taiyang* in the northern. Fire’s wood is mercury; water’s metal is lead. Governed from the central palace, qi assists by kind.\" All these expound the Dragon and Tiger, verifying the divine elixir. How could soot, ore, or primordial essence compare? Reflect deeply—there is not a single error. To trust the deluded is to suffer in vain.\n\nGuangyuan said: \"Master, you have fully expounded the Way of the Great Elixir. I have heard that in ancient times, Liu Wang of Huainan refined *qiushi* into the supreme medicine, consuming it to ascend to heaven. What is *qiushi*? I have also seen many alchemical records referring to the title 'Saint Without Knowledge,' which the world calls 'green salt.' Is this true?\"\n\nI say: The *qiushi* refined by the King of Huainan *was* the Great Elixir—there is no other principle. It is one thing with many names. Sages adapt their terms to the moment, assigning names as they see fit. The \"Green Metal Tiger\" is the foundation of the Great Elixir. Its color is congealed white, belonging to the west. The west corresponds to autumn, hence its name. It is like the \"River Chariot\" and \"Yellow Sprout\"—all of one kind.\n\n\"Saint Without Knowledge\" refers to the marrow of cinnabar, the profound gate of lead and mercury. When the Five Phases govern and subdue, it generates flesh and bone; when all phenomena are encompassed, blood and qi are complete. Immortals seek it yet do not know it; sages ponder it yet do not attain it—hence its name. How could it be green salt? The deluded are mistaken.\n\nGuangyuan said: \"The Way of the Great Elixir is wondrous and subtle—how did the immortals first come to know it?\"\n\nI say: Gold is the child of water; mercury is the soul of gold. Though they share a root with the Five Phases, they cannot unite across ten thousand years. Lingyangzi Ming, a sage of the primordial beginning, and the immortals of antiquity knew this return to the source must hold a secret Way. Thus they paired south with north, west with east, arranging these four directions without neglecting the central path. For a year they tended the fire; for ten months they opened the furnace. After seven returns without loss and nine revolutions complete, the flying soul was subdued and the wandering spirit returned home—hence the name *Purple Gold Fire-Liquid Great Return Divine Elixir*.\n\nThe song says:\n*\"Nine returns, seven reversals, three-five-one,\nDragon and Tiger unite in the divine chamber.*\n*The ash pool’s flames refine heaven and earth’s essence;\nThe golden liquid returning elixir’s work is complete.\"*\n\nGuangyuan said: \"I have reverently heard your teaching on the Way of the Great Elixir. Yet many in the world use herbs—red celery, lettuce, *zhangliu*, pine resin, all gathered and employed. They extract juice from *didan*, uproot *tianweng*, combine *yinxian* and purslane, and use *longnao* and dodder, forming them into pellets in hopes of obtaining gold. Such people are as numerous as hemp or reeds—will any succeed?\"\n\nI say: Though humans are of one kind, wisdom and folly vary endlessly. Endowments differ, and so do achievements. The wise comprehend all within the realm; the foolish do not see what lies in their palm. It is like clouds rising to the heavens while tiles and pebbles remain on the earth. The vital qi of *lei* cannot be suppressed, nor can tiles and pebbles be lifted—so too with the wise and foolish; transformation is not possible.\n\nMoreover, mercury is the accumulated qi of yin, the essence of primordial water. It takes ten thousand years to take form, joining with the Five Metals to become their spirit. Heavier than gold, pure and untouched by dust—it lies before your eyes. What is difficult to see?\n\nHerbs sprout in spring, grow in summer, wither in autumn, and decay in winter. Their branches and leaves are not sturdy, their roots and stems not enduring. Split them, and they yield water; burn them, and they turn to ash. To expect them to congeal into mercury is as distant as heaven from earth.\n\nThose who blindly chase profit, devoid of knowledge, deceive and mislead their contemporaries—how could they ever succeed? Some in Hebei point to the Three Hao regions, claiming herbs grow there; others in Lingnan speak of success in the Two Shu territories. All are empty transmissions, devoid of truth. Passed down through generations, their errors are lamentable. The wise discern this; the foolish remain ignorant.\n\nGuangyuan said: \"Is it possible that herbs might yet produce cinnabar?\"\nThe master replied: \"How long is a rabbit’s horn? How much fur does a tortoise have?\"\nGuangyuan said: \"Rabbits have no horns; tortoises have no fur.\"\nThe master said: \"Then how is the notion of herbs yielding cinnabar any different?\"\n\nGuangyuan said: \"If herbs cannot produce cinnabar, why do so many in the world speak of the *Three Yellows and One Vault*, claiming herbs can refine cinnabar into gold?\"\nThe master said: \"The nature of the Three Yellows differs from mercury, and they are volatile. How could they be controlled to form gold? When raw, they turn to smoke and ash; when subdued by fire, they become like tiles and pebbles—no transformation occurs. If the mother is but tiles and pebbles, how can the child become gold or silver? It defies reason. Just as in the world, flying creatures bear male and female, walking creatures bear male and female, so too with ants, insects, and fish—all follow this pattern. How then could the *Three Yellows and One Vault* or herb-derived cinnabar ever succeed? If they could, why not simply use gold to produce gold? What harm would there be? Moreover, gold is the root; once formed, it does not vanish entirely. It does not defy the workings of creation. Those who leave behind such alchemical texts achieve nothing, for they point to herbs.\n\nHerb-derived cinnabar has, from ancient times to now, been but a phantom name—like seeking dust in water, drilling ice for fire, expecting cicadas to birth phoenixes, or cranes to bear serpents. Even mineral medicines differ fundamentally; how could herbs ever enter the process? Yet falsehoods are passed down, driving men to futile searches—north of the ridges, south of the ridges, beyond the seas, within the seas—crafting clever arguments about branches and leaves, expounding on sour and salty flavors, only to harm themselves in the end. Shi Chong lost his family because of this; Liang Ji’s clan was destroyed. They pursued countless schemes, seeking every possible means, yet only managed to stave off poverty and hunger. Why then seek motherless cinnabar to make gold and silver? The deeper the greed, the farther from the Dao.\n\nTrue immortals, when refining medicines to create gold and silver, do not require motherless cinnabar. They regard glory and wealth as dirt, and gold and jewels as nothing to covet. If they transform small amounts, it is only to demonstrate the efficacy of their medicines, to aid the poor and hungry—not to indulge desires and destroy themselves. Those who insist on using motherless cinnabar to make gold and silver are utterly deluded.\n\nMotherless cinnabar, when burned, cannot be contained—it flees like a spirit. Compared to raw mercury, how much less can it achieve? In the end, it is all vanity. The wise hear this and awaken; the foolish cling to it until their hair turns white. Seeking snakes that dance, turtles that fly—is this not tragic?\"\n\nGuangyuan said: \"I see many in the world exhaust their wealth trying to make gold and silver from motherless cinnabar, yet achieve nothing. What is the reason for this?\"\nThe master said: \"These are not true seekers of the Dao, but those who compete for wealth. The Dao takes emptiness and tranquility as its foundation, stillness and clarity as its basis. One must temper desires and dwell in the mountains, abandon greed and live in the world, preserve the spirit and nurture qi, eat cypress and pine. Only then can one gradually attain purity, slowly reach the true realm.\n\nGold and silver are worldly things, meant only to briefly aid fleeting life. If it is your portion, they will come without seeking; if not, seeking will not bring them. When scattered, they reveal one’s virtue; when gathered, they demand careful consideration. Do not lose yourself in error.\n\nGuangyuan asked again: \"What is motherless cinnabar?\"\nThe master laughed and said: \"You insist on creating gold and silver, yet require motherless cinnabar. Why not simply use gold and silver as the mother? Mercury returns to its mother’s body—is this not reasonable? If you must have no mother, then what of the cinnabar, divine cinnabar, calomel, and light powder of the world—all formed from mercury, yet containing no metals? Are they not the same as motherless cinnabar?\n\nRemember my words, and you will not be deceived by the illusions of your time.\"\n\nGuangyuan said: \"I have heard your instruction. But among the herbs of the world, are there any that can extend life and transcend the mundane?\"\nThe master said: \"Many famous herbs can extend life. Have you not read the *Records of the Ten Continents* or the *Biographies of Divine Immortals*? They contain countless accounts of transcending the world. Lingzhi mushrooms stand tall, red herbs display their beauty, yellow essence and white wood, red arrows and poria—peach blossoms and apricot kernels, cypress leaves and pine seeds—all are suitable for cultivation, as recorded in the medical texts. Some boil white stones to stave off hunger, refine primordial essence to transcend the world. These are the practices of those beyond the mundane, the extraordinary men of mountains and wilds, who go without grain for years, cultivate the true for decades. Thus, inner and outer align, and consuming herbs yields results. Is this not extending life and transcending the world?\n\nBut the common folk know nothing of the supreme Dao. Their greed knows no end. They only amass jade and pile gold, considering it worldly joy. Indulging in arrogance and extravagance, they vie in ostentation, never a day without fine flavors, never a day without fine silks. Their seven orifices flow ceaselessly, their three fields are not secure. Even if they consume myriad divine medicines, what good will it do? How could they ever transcend the world?\n\nFollow my words, and the great Dao is not far; the true realm will surely be attained.\"\n\nGuangyuan said: \"By chance, I ascended the heights and encountered a true person. You have not dismissed me as a mere fool but entrusted me with profound mysteries. Your kindness is as vast as heaven and earth, beyond words to express. Now I wish to prepare these medicines and enter the famous mountains to refine them. Is this permissible?\"\n\nThe master said: \"This Dao is most vast and most wondrous. You must guard it with utmost care. Should you leak its celestial mysteries, not only will your seven generations suffer calamity, but your own body will be destroyed. Keep it strictly concealed, and do not speak of it or associate with those unworthy.\n\nThough this mountain is renowned, it lies near the great capital. Now, with warfare just breaking out, this mountain stands in the path of conflict, and many fugitives take refuge here. You cannot refine the divine elixir here.\n\nIn the Wu and Yue regions of Jiang-Zhe, there are many famous mountains—Luofu, Maoling, Mount Lu, Tiantai—all currently at peace, with no troubles to come. These are the places where worthy sages gather and the immortals roam. You should go there to refine the great elixir, and you will surely transcend the world.\n\nAll that I have told you is without error. Guard it well.\"\n\nGuangyuan said: \"Your kindness is as deep as the Bohai Sea, as weighty as the mountains. I am but a humble man—how can I ever repay you?\"\n\nThe master replied: \"That you have this destiny is a meeting of karmic conditions. I see the people of the world in turmoil, all greedy for glory and rank, all loving extravagance and abandoning simplicity. In an instant, they all die, and I grieve deeply for them.\n\nIf you record what I have taught and compile it into a manual to guide those with the proper destiny, that will be your repayment to me. This is my wish as well.\"\n\nGuangyuan was overcome with emotion and could not speak.\n\nThe master then asked: \"You have spent much time by the sea—have you ever drunk the primordial wine?\"\n\nGuangyuan replied: \"I do not know what primordial wine is.\"\n\nThe master then untied the gourd from his staff and drew water for Guangyuan. He added medicine to the gourd, covered it with a leaf, and in moments, it turned into wine—crimson and purple in hue, with an extraordinary fragrance and taste. The master drank a cup himself and gave the rest to Guangyuan to finish. Immediately, his spirit felt refreshed, and he bowed again in gratitude.\n\nThe master pointed and said: \"The day grows late. You should return now. My dwelling is just south of this peak. Come again if you have no pressing matters.\"\n\nWith that, he departed. A wisp of cloud flashed by, and his traces vanished.\n\nGuangyuan returned to the temple lodging. The next day, he went directly to the south of the peak to seek the master, but the paths were all lost. When he reached the southern slope, there were no trails at all—only white clouds, flying crows, and the warm murmur of the mountain stream. No person was to be seen. Then he knew the master did not dwell among mortals.\n\nWith deep regret, he recorded these teachings into a volume, hoping that scholars and gentlemen would examine them carefully.\n\n*The Discourse of the Sea Traveler* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "海客论 经名：海客论。 唐末五代渤海人李光元（即李光玄）撰其内容与《全液还丹百问诀》篡本相同，但文字较少，且多讹误，作者名字避宋讳，当系徒人删节《百问诀》而成。 一卷。 底本出处：《正统道藏》太玄部。 参校本：《金液还丹百问诀》。 海客论 海客李光元，渤海人也。 少孤，而家财巨万。 洎弱冠，随乡人舟，往来於青社淮制为商贾。 后却过海，而同舟有一道人。 问子曰； 君家有何人，及货产，涉海何为者也。 曰：少孤兄弟，货财及万。 道人日：既若如此，更涉风波，以贪其利，漫漫大海，浩浩长波，一旦倾危，鱼龙得便，甚非所知也。 光元日：我非为利而涉风波，绿思世问，皆若梦耳，朝露岂可久留，还同电光，瞥然即灭。 旧冢未乾，新坟相次，累金褊地，全不关身。 积玉倚天，岂能留命。 是以经涉海浪，直入中华，寻访真人达士，欲将何卫，可延其生。 既无所逢遇，遂且归乡，即非为利也。 道人曰：君方年少，正贪爱欲荣华，早慕修真，以延身命。 可谓奇器矣，又何愁仙分而登真也。 光元日：蚯蚓之质，岂能成龙。 斥鸥之微，应难及凤。 非敢望其大悟，仅得修身之术，以延其生，斯可矣。 傥高人不以不肖，少垂诲焉，幸亦甚矣。 道人日：金丹大药，未遇至人，保命延年，斯得其旨。 金丹只在身中，更无别药。 尔能远离房室，去浊澄清，枕石漱流，核烦就静，元气不散，可以长生。 夫元气者，身中混元之气也。 是人之基，命之根。 念住即气停，神安即气定，是以智人息是非，绝声色，喘息不由於鼻外，思惟只在於身中，三田得宝，长生可保。 更有纳新吐故，漱液咽津，悉是延年，皆为固身之道。 故古歌日：气是添年药，津为续命芝。 世上馒忙兼馒走，不知求己更求谁。 此可明也。",
      "translated_text": "**The Discourse of the Sea Traveler**\n\n**Title:** *The Discourse of the Sea Traveler*\nComposed by Li Guangyuan (also known as Li Guangxuan) of Bohai during the late Tang and Five Dynasties period. Its content aligns with the spurious edition of *The Hundred Questions and Secrets of the Golden Elixir and Returned Cinnabar*, though the text is briefer and contains many errors. The author’s name avoids Song taboos, suggesting it was abridged by a disciple from *The Hundred Questions and Secrets*. One scroll.\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Great Mystery Section*.\n**Collated Edition:** *The Hundred Questions and Secrets of the Golden Elixir and Returned Cinnabar*.\n\n---\n\n**The Discourse of the Sea Traveler**\n\nThe sea traveler Li Guangyuan was a man of Bohai. Orphaned in youth, his family possessed vast wealth. Upon reaching adulthood, he sailed with fellow villagers to Qingzhou and Huaizhou as a merchant. Later, he crossed the sea again, where a Daoist traveled on the same vessel.\n\nThe Daoist asked him, “Who remains in your household, and what of your wealth? Why do you brave the sea?”\n\nLi replied, “I am orphaned with only my brothers, and our wealth amounts to ten thousand. The Daoist said, “Given this, why risk the winds and waves for profit? The boundless sea and its endless swells may overturn your vessel in an instant—fish and dragons would seize the chance, and none could foresee the outcome.”\n\nLi Guangyuan answered, “I do not cross the waves for profit. I reflect that all in this world is but a dream, like morning dew that cannot linger, or lightning that vanishes in a flash. Old graves are not yet dry before new ones follow. Heaps of gold buried in the earth are of no use to the dead; jade piled to the heavens cannot preserve life. Thus, I traverse the sea to enter the Central Kingdom, seeking perfected ones and realized masters, hoping to learn what practice might prolong my years. Having met no such teachers, I now return home—not for profit.”\n\nThe Daoist said, “You are still young, yet already weary of worldly desires and glory, aspiring to cultivate the Dao to extend your life. This is truly rare. Why doubt your destiny to ascend as an immortal?”\n\nLi Guangyuan replied, “How could an earthworm’s form become a dragon? A sandpiper’s smallness can hardly match the phoenix. I dare not hope for great awakening—if I might only learn the art of cultivating the body to prolong life, that would suffice. Should a noble master deign to instruct this unworthy one, I would be most fortunate.”\n\nThe Daoist said, “The great medicine of the Golden Elixir cannot be obtained without encountering a perfected one, but preserving life and prolonging years lies within its essence. The Golden Elixir resides within the body—there is no other medicine. If you can distance yourself from the bedchamber, purify the turbid to attain clarity, rest your head on stone, rinse your mouth with flowing water, shed vexations for tranquility, and prevent the dissipation of primordial *qi*, you may attain longevity. This primordial *qi* is the original, undifferentiated *qi* within the body—the foundation of a person, the root of life. When thoughts cease, *qi* stabilizes; when spirit is at peace, *qi* settles. Thus, the wise still their judgments, sever sensory desires, ensure their breath does not stray beyond the nose, and direct their thoughts inward. When the Three Fields yield their treasures, longevity is assured. Further practices—absorbing the new and expelling the old, rinsing and swallowing saliva—all serve to extend life and secure the body. As the ancient song says:\n\n*Qi* is the medicine that adds years,\nSaliva the herb that extends life.\nThe world rushes and races in vain—\nWho else should one seek but oneself?”\n\nThis is the truth made clear.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 678,
      "start_sentence": 0,
      "end_sentence": 35,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.511395692825317,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\海客论.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "光元日：高人仪貌有异，必此验乎。 曰：我行此道，遂得如斯，今已百岁矣，疾病未尝染也。 光元再拜而谢日：不肖得闻大道，何其幸也。 若非夙绿，无由睹此。 道人到东岸下船。 欲游新罗，遂相告别。 光元归渤海，乃依行此道，不顾浮华，乃往长云岛中，修行数年，固有益验，因彼往来，时人号之日海客。 光元后复思人问更有出世之门，金丹玉液之道，止居此中，何由而达。 中华甚有名山诸方圣境，乃幡然舍岛，而游名山，以寻其事也。 己巳#1年八月三日，至嵩高山少室中，於僧舍止宿十余日。 后独步南登，看骯岔谷，行五六里，忽於路侧松下，遇一人年老擭节，节有三瓢，短褐长巾，於人有异。 遂问光元曰：子在此何为。 光元曰：无他，看骯山水耳。 子从何来，光元曰：十年从海来，历游名山，乃至于此。 有何事也。 曰：少孤家财巨万，每笑荣贵，不恋繁华，惟求妙道，乃至于此。 曰：求道几年，有所遇乎。 光元曰：海内游历二十余年，数年前於船中遇一道人，教以保养精气，导引四肢，依而行之，亦有其验。 曰：如斯则道成矣，夫复何求。 光元曰：窃闻神仙之道，更有、金液及还丹之术，虑恐虚度年华，是以窃心寻访也。 曰：所求金液还丹，曾遇否乎。 光元曰：求之十年，未有所遇。 老人微笑曰：识吾否。 曰：愚蠢不识高人也。 曰：我是元寿先生。 又曰：子何姓。 曰：姓李，名光元。 老人又笑曰：我号元寿，子名光元，与我相符，我得人矣。 又曰：子求金丹之道，将为人乎，为己乎。 光元曰：既能为己，亦将提拔有分之人。 先生曰：斯可传矣。 若为一身，神仙非许。 光元乃再拜而谢之。 先生曰：子若非夙分，虽加辛劳没世，亦不遇也。 子仙骨已彰，神基渐就，子诚听吾说焉。 乃放杖坐石，更指光元令坐。 光元曰：先生欲传至道，不肖得无礼耶。 先生曰：至道无远，尽此一日论说，可终其奥，不可令子久立也。 光元乃拜而坐。 先生曰：还丹者，非是别药。 真一为基，铅汞相依，黄芽是本，乃可成也。 光元曰：亦见时人论黄芽，皆不知其至理，不知黄芽，将何物制造得成也。 曰：铅出铅中，方为至宝。 汞传金气，乃号黄芽。 不见古歌云：黄芽铅汞造，阴壳含阳花。 不得黄芽理，还丹应路赊。 世人炼至药，尽认是黄华。 铅黄是死物，那得到仙家。 黄芽非在药，内象取精华。 若到黄芽地，金银徒尔夸。 此之谓也。 光元曰：窃见《 金玉五相类》 云：铅有大毒。 争堪成就至药。 曰：虽有大毒，盖为世人不解取用。 譬如世上毒药非一，若巴豆之类，岂无毒也。 若解用之，即能治病，铅亦如是。 故《 陶植篇》 云：铅中有金，金中有宝。 贤人得之，宁修铅中金，不炼金中宝。 此非世问铅也。 世人直下用铅，希求黄芽，万无一得，盖不识不知铅也。 光元曰：铅有二耶。 曰：铅非有二。 譬如养子，若割父母身上肉，内於腹中，而孩子生，应难得。 若离父母，孩子自何而生。 古歌云：鼎鼎元无鼎，药药元无药。 黄芽不用铅，须用铅中作。 黄芽是黄芽，铅去铅万里。 黄芽非黄芽，却向铅而始。 铅为芽父#2，芽#3为铅子，子隐母胎，母隐子胞。 知白守黑，神明自来。 此之谓也。 故诸经唯赞铅之功能。",
      "translated_text": "Guangyuan remarked, “The noble one’s bearing and appearance are extraordinary—surely this is the proof of it.”\nThe other replied, “I have practiced this Way and thus attained such a state. Now I am a hundred years old, yet illness has never touched me.”\nGuangyuan bowed again in gratitude and said, “How fortunate I am to hear of the great Dao! Had I not a predestined affinity, how could I have beheld this?”\nThe Daoist then disembarked on the eastern shore, intending to travel to Silla, and so they bade each other farewell.\n\nGuangyuan returned to Bohai and, following this Way, turned away from worldly vanity. He withdrew to Changyun Island, where he cultivated himself for several years. The benefits and confirmations were evident, and because of his comings and goings, people of the time called him the “Sea Traveler.”\n\nLater, Guangyuan reflected that among the teachings of the world, there must be a gate to transcendence, a Way of golden elixir and jade liquid. Dwelling only here, how could he ever attain it? The Central Lands abounded with famous mountains and sacred realms of the various schools. Thus, he abruptly left the island and journeyed among the renowned mountains to seek these matters.\n\nOn the third day of the eighth month in the *jisi* year, he arrived at Mount Song’s Shaoshi Peak. He lodged in a monastic guesthouse for over ten days. Later, he walked south alone, surveying the ravines and valleys. After five or six *li*, he suddenly encountered an elderly man beneath a pine by the roadside. The man leaned on a staff adorned with three gourds, wore a short hemp robe and a long headscarf, and bore an air unlike ordinary people.\n\nThe old man asked Guangyuan, “What are you doing here?”\nGuangyuan replied, “Nothing in particular—just admiring the mountains and waters.”\n“Where have you come from?”\nGuangyuan said, “For ten years, I have come from the sea, traveling through famous mountains until I reached this place. What brings you here?”\nThe old man said, “I was orphaned young, with a family fortune of ten thousand. I always scorned glory and wealth, caring only for the wondrous Dao, and so I came here.”\n“How many years have you sought the Dao? Have you encountered anything?”\nGuangyuan said, “I have wandered within the seas for over twenty years. Several years ago, on a boat, I met a Daoist who taught me to preserve and nurture essence and *qi*, and to guide and stretch the four limbs. Following his instructions, I have seen some confirmation.”\nThe old man said, “If so, then the Dao is already accomplished. What more do you seek?”\nGuangyuan replied, “I have heard that the Way of immortals includes the arts of golden liquid and returning elixir. Fearing I might waste my years in vain, I have secretly set my heart on seeking them.”\nThe old man asked, “In your search for the golden liquid and returning elixir, have you encountered anything?”\nGuangyuan said, “I have sought them for ten years but have found nothing.”\nThe old man smiled faintly and said, “Do you recognize me?”\nGuangyuan replied, “I am dull and do not recognize this noble one.”\nThe old man said, “I am Master Yuanshou.”\nHe then asked, “What is your surname?”\nGuangyuan said, “My surname is Li, and my name is Guangyuan.”\nThe old man laughed again and said, “My style is Yuanshou, and your name is Guangyuan—we match each other. I have found my man.”\nHe then asked, “In seeking the Way of the golden elixir, do you do so for others or for yourself?”\nGuangyuan replied, “If I can achieve it for myself, I will also lift up those with the proper destiny.”\nThe master said, “This may be transmitted. If it were only for oneself, immortality would not be granted.”\nGuangyuan bowed again in gratitude.\nThe master said, “Had you not a predestined affinity, even if you labored your whole life, you would not have encountered this. Your immortal bones are already manifest, and your spiritual foundation is gradually taking shape. If you truly listen to my words…”\nHe then set down his staff and sat upon a stone, gesturing for Guangyuan to sit as well.\nGuangyuan said, “If the master wishes to transmit the supreme Dao, how can I, unworthy as I am, be so discourteous?”\nThe master replied, “The supreme Dao is not distant. In the space of this single day’s discourse, its mysteries may be exhausted. I cannot let you stand for long.”\nGuangyuan then bowed and sat.\nThe master said, “The returning elixir is not some other medicine. The true One is its foundation; lead and mercury depend on each other; the yellow sprout is its root—only then can it be accomplished.”\nGuangyuan said, “I have seen people of the time discuss the yellow sprout, but none know its profound principle. Without knowing the yellow sprout, what can be used to refine and complete it?”\nThe master said, “Lead emerges from within lead—only then is it the supreme treasure. Mercury transmits the *qi* of gold—only then is it called the yellow sprout. Have you not seen the ancient song:\n\n*Yellow sprout, lead, and mercury refine,\nThe yin husk holds the yang flower.\nWithout the principle of the yellow sprout,\nThe returning elixir’s path is distant.*\n\nPeople of the world refine the supreme medicine,\nAll mistaking it for yellow blossoms.\nLead yellow is a dead thing—\nHow could it reach the immortals’ home?\n\nThe yellow sprout is not in medicine;\nFrom the inner image, take its essence.\nIf you reach the yellow sprout’s ground,\nGold and silver are but empty boasts.\nThis is what it means.”\n\nGuangyuan said, “I have seen *The Five Categories of Gold and Jade*, which says, ‘Lead has great toxicity. How can it accomplish the supreme medicine?’”\nThe master replied, “Though it has great toxicity, that is because people of the world do not understand how to use it. For example, among the world’s toxic medicines, are there not many like croton? Yet if one knows how to use them, they can cure illness. Lead is the same. Thus, *The Ode of Tao Zhi* says:\n\n*Within lead there is gold,\nWithin gold there is treasure.\nThe wise obtain it—\nWould they refine gold from lead\nRather than treasure from gold?*\n\nThis is not the lead of the world. People of the world directly use lead, hoping to obtain the yellow sprout, but not one in ten thousand succeeds. This is because they neither recognize nor understand lead.”\nGuangyuan asked, “Are there two kinds of lead?”\nThe master said, “Lead is not two. It is like raising a child: if you cut flesh from the parents’ bodies and place it in the child’s belly, how could the child be born? If separated from the parents, how could the child come into being? The ancient song says:\n\n*The crucible is fundamentally without crucible,\nThe medicine fundamentally without medicine.\nThe yellow sprout does not use lead—\nIt must be made from within lead.\nThe yellow sprout is the yellow sprout,\nBut lead is ten thousand *li* from lead.\nThe yellow sprout is not the yellow sprout—\nOnly in lead does it begin.\nLead is the father of the sprout,\nThe sprout is the child of lead.\nThe child hides in the mother’s womb,\nThe mother hides in the child’s placenta.\nKnow the white, guard the black—\nSpiritual illumination will come of itself.*\n\nThis is what it means. Thus, the various scriptures praise only the efficacy of lead.”",
      "overlap_context": "sires, ensure their breath does not stray beyond the nose, and direct their thoughts inward. When the Three Fields yield their treasures, longevity is assured. Further practices—absorbing the new and expelling the old, rinsing and swallowing saliva—all serve to extend life and secure the body. As the ancient song says:\n\n*Qi* is the medicine that adds years,\nSaliva the herb that extends life.\nThe world rushes and races in vain—\nWho else should one seek but oneself?”\n\nThis is the truth made clear.",
      "start_char": 678,
      "end_char": 1925,
      "start_sentence": 36,
      "end_sentence": 107,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.103049516677856,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\海客论.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "若舍其铅，如弃父母求子也。 古歌云：莫坏我铅，令我命全。 莫破我车，令我还家。 铅断河车空，所作必无功。 铅破河车绝，所作无处出。 又云：玄生因#4金公，巍巍立始初。 又云：一物含五彩。 又《 陶植篇》 云：五彩之合，道契自然。 故生天地，为牝为牡。 然后还日之精於月窟，结精华於虚中#5，能生紫气之精#6，潜与真合符。 若非神仙，莫能窥也。 人不晓不解，用之遂使差之毫厘，失之千里。 故歌云：用铅不用铅，须用铅中作。 世人若用铅，用铅还是错。 又歌云：用铅不得用凡铅，用铅铅是旧丹#7田。 此并明不弃铅而解用之也，用之则阴阳得序，作之则夫妇相违，只在铅中而研究之达也。 《元阳子歌》曰：真阴真阳是真道，只在目前何远讨。 凡流岁岁烧神丹，忽见青黄自云好。 志士应须求法则，勿损精神虚颠倒。 但能求得真黄芽，人若服之寿无老。 此可知也。 光元曰：切见世人云：朱砂水银是黄芽。 是何理也。 曰：此非至人之古。 且朱砂水银者，无定性，自无身形，阴不有生，女无自孕。 故李西蟾篇云：朱砂水银同一处，二女终是不相知。 自立既难，安可得成大道。 夫黄芽者，坎离相孕，金水相生，男冠女羿，牝牡相从，从无入有，阴动肠交，方可得成，契於至理。 故《阴真君歌》云：北方正气为河车，束方甲乙为金砂。 两情含养归一体，朱雀调运生金花。 金花能生天地宝，人会此言真至道。 此可知也。 光元曰：又见世人以金为黄芽，以银为黄芽，研#8朱砂银为黄芽#9，取银为黄芽，或以锡为黄芽，草节铅、金姚铅、枯铅等为黄芽，或以蜜陀僧、黄丹、铅黄花等为黄芽，是何理也。 曰此并非也。 诸类皆是朴质之物，顽滞之徒，炼之则色悴形枯，烧之则尘非土变，枯骨死肉，终亦何为。 孤阴寡阳，争同至化，服之则灼人脏腑，饵之乃促彼生年，岂及於黄芽，吁於大道。 夫黄芽者，铅汞合体，金木相并，龙虎相交，水火相制，推情合性，以魂随魄，成还返之用，明呼吸之理，乃得阳交阴孕，母在子全，得天地之精，成混元之道。 古歌云：汞不呈璞，金不露形。 又曰：丹砂木精，得金乃并。 又曰：龙来身敛魂充饥，虎来啖食生髓脂。 乃可明矣。 光元曰：黄芽既云铅汞所造，金水相生，愚意尚迷，而未晓末知，若何得成。 曰：譬如人间种植，世上田农，果子初生，犁垦以选好地，及彼良时，仍赖风雨调匀，节候催促，年终稼穑，尽获收成。 黄芽之因，亦复如是。 合和铅汞，配类坎离，水火相仍，时候周足，自然和合，变化无有比伦，黄芽若成，大道全矣。 歌云：铅黄芽，同三华，采我气，结成砂。 初问日运如火输，五彩港藏入神华。 曾为使作道无邪，三者既备是仙家。 此可知也。",
      "translated_text": "If one abandons this lead, it is like forsaking parents to seek a child. The ancient song says:\n\n*Do not ruin my lead—\nLet my life be preserved.\nDo not break my chariot—\nLet me return home.\nIf lead severs the river chariot, all efforts are in vain;\nIf lead shatters the river chariot, all works come to naught.*\n\nIt also says:\n*The Mystery arises from the Golden Duke,\nMajestically standing at the very beginning.*\n\nAnd again:\n*A single thing contains five hues.*\n\nThe *Taozhi Pian* states:\n*The union of five hues accords with the natural Dao,\nThus giving birth to heaven and earth, becoming female and male.\nThen the essence of the sun is returned to the moon’s cavern,\nThe flower of spirit congeals within the void,\nAble to generate the essence of purple qi,\nSecretly uniting with the true in perfect harmony.\nWere one not an immortal, none could perceive this.*\n\nThose who do not understand or comprehend it will err by the slightest misstep, losing it by a thousand *li*. Thus the song says:\n\n*To use lead yet not use lead,\nOne must work within lead.\nIf common folk use lead,\nUsing lead is still wrong.*\n\nAnother song says:\n*To use lead, do not use common lead—\nThe lead used is the old cinnabar field.*\n\nAll these make clear that one must not abandon lead but rather understand how to employ it. When used, yin and yang fall into order; when misapplied, husband and wife turn against each other. The key lies in delving deeply into lead. The *Yuanyangzi Song* says:\n\n*True yin and true yang are the true Dao,\nRight before your eyes—why seek afar?\nFools year after year refine divine elixirs,\nSuddenly seeing blue and yellow, they call it good.\nThose of resolve must seek the Dharma’s rule,\nLest they waste their spirit in vain confusion.\nIf one can but obtain the true yellow sprout,\nThose who ingest it will live without aging.*\n\nThis is evident.\n\nGuangyuan says: I have often heard people claim that cinnabar and mercury are the yellow sprout. What principle is this?\n\nIt is said: This is not the teaching of the perfected ancients. Cinnabar and mercury, lacking fixed nature and form, cannot generate life—just as a woman cannot conceive alone. Thus the *Li Xichan Pian* says:\n\n*Cinnabar and mercury dwell together,\nYet the two maidens never know each other.*\n\nIf self-establishment is so difficult, how can the great Dao be achieved? The yellow sprout arises from the union of Kan and Li, the mutual generation of metal and water, the crowning of the male and the readiness of the female, the following of female and male. From non-being it enters being; when yin stirs and bowels intertwine, only then can it be accomplished, in accord with the highest principle. Thus the *Yin Zhenjun Song* says:\n\n*The true qi of the north is the river chariot,\nThe Jia and Yi of the east are golden sand.\nWhen the two essences nurture and return as one,\nThe Vermilion Bird stirs and gives birth to the golden flower.\nThe golden flower can generate heaven and earth’s treasure—\nThose who grasp this speak the true Dao.*\n\nThis is evident.\n\nGuangyuan says: I have also seen people take gold as the yellow sprout, silver as the yellow sprout, refined cinnabar-silver as the yellow sprout, extracted silver as the yellow sprout, or tin, bamboo-node lead, Jin Yao lead, desiccated lead, and the like as the yellow sprout. Others take litharge, red lead, or lead-yellow-flower as the yellow sprout. What principle is this?\n\nIt is said: None of these are correct. All such substances are crude and inert; when refined, their color fades and form withers; when burned, they turn to dust or mutate into earth. They are but dry bones and dead flesh—what use are they? Solitary yin and widowed yang cannot match the supreme transformation. Ingesting them scorches the viscera; consuming them shortens one’s years. How could they compare to the yellow sprout or approach the great Dao?\n\nThe yellow sprout arises from the union of lead and mercury, the merging of metal and wood, the intercourse of dragon and tiger, the restraint of water and fire. By aligning emotion with nature, making the hun follow the po, it fulfills the work of return and reversal, clarifies the principle of breath, and thus achieves the union of yang and the conception of yin. The mother is preserved within the child, obtaining heaven and earth’s essence to complete the primordial Dao. The ancient song says:\n\n*Mercury does not reveal its ore,\nGold does not expose its form.*\n\nAnd again:\n*Cinnabar is the essence of wood,\nOnly when joined with metal does it unite.*\n\nAnd again:\n*When the dragon comes, the body contracts and the hun is sated;\nWhen the tiger comes, it devours and generates marrow and fat.*\n\nThis is now clear.\n\nGuangyuan says: If the yellow sprout is said to be made from lead and mercury, the mutual generation of metal and water, I remain confused and do not yet understand how it can be accomplished.\n\nIt is said: It is like farming in the human world. When planting crops, farmers first plow and select good land, then await the proper season, relying on wind and rain to harmonize, the seasons to hasten growth. By year’s end, the harvest is reaped in full. The cause of the yellow sprout is the same. By harmonizing lead and mercury, matching Kan and Li, water and fire following one another, the time fully ripening, they naturally unite, transforming beyond compare. When the yellow sprout is formed, the great Dao is complete. The song says:\n\n*Lead and the yellow sprout, together with the three flowers,\nGather my qi to congeal into cinnabar.\nFirst, the sun’s movement is like fire’s conveyance,\nFive hues hidden within the divine flower.\nOnce made the servant, the Dao is without flaw—\nWhen the three are complete, one is a immortal.*\n\nThis is evident.",
      "overlap_context": "\nIt must be made from within lead.\nThe yellow sprout is the yellow sprout,\nBut lead is ten thousand *li* from lead.\nThe yellow sprout is not the yellow sprout—\nOnly in lead does it begin.\nLead is the father of the sprout,\nThe sprout is the child of lead.\nThe child hides in the mother’s womb,\nThe mother hides in the child’s placenta.\nKnow the white, guard the black—\nSpiritual illumination will come of itself.*\n\nThis is what it means. Thus, the various scriptures praise only the efficacy of lead.”",
      "start_char": 1925,
      "end_char": 2963,
      "start_sentence": 108,
      "end_sentence": 156,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.747405767440796,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\海客论.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "光元曰：黄芽既得闻命矣，至药如何得成，敢请其旨。 曰：至药唯用五行，更无杂物。 若有诸类，不成至药。 古歌云：捉取束青龙，配与西白虎。 更将南朱雀，会偶北玄武。 就中尤妙处，莫失中央土。 此可知也。 此五行是铅本类，乃得成丹。 若有非类，即不成也。 譬如一家父母夫妇，无有外人。 铅汞五行，亦复如是。 制伏成药，骨肉精气血脉皆全，方堪服饵。 古歌云：何言金木水火土，留身保命是龙虎。 学人不识五行精，强认他人为父母。 木主气兮骨主虎，血主水兮肉主土，不死之道在离官，会得五行身有主。 五行须是水银亲，外质不堪为伴倡。 又贺兰球本歌曰：青龙起，白虎卧，玄武飞，朱雀坐，黄龙中央自结果。 母怜子，子怜母，炉中结成云一朵，饵服刀圭无不可。 此之道也。 光元曰：大药虽是龙虎制伏，五行真气成药，饵服之时，最是何物。 曰：成药只是一味水银，虽神水之胎，作紫金之粉，已含五彩，已表五行，成身号曰金液还丹，太古神仙皆同一法。 古歌云：水银一味是仙药。 从上流传伏火难。 若遇河车成紫粉，紫粉一时化金丹。 ．金丹正法本无钩，水银一味独难幽。 刀圭点化将为验，服之不死泛仙舟。 又歌云：却取抽成汞，还烧反作砂。 胎中受五彩，月足是黄芽。 迷途不可见，对面隔天涯。 若到河车地，只此是仙家。 可明也。",
      "translated_text": "Lord Guangyuan asked: \"Having now heard of the yellow sprout, how then is the supreme medicine formed? I venture to inquire into its essential principle.\"\n\nThe master replied: \"The supreme medicine employs only the Five Phases—nothing else is added. Should any extraneous elements be introduced, it ceases to be the supreme medicine. An ancient song says:\n\n*Seize the Azure Dragon of the East,\nPair it with the White Tiger of the West.\nThen take the Vermilion Bird of the South,\nTo meet the Dark Warrior of the North.\nYet the subtlest art lies within—\nLose not the Central Earth.*\n\nThis is evident. These Five Phases are the fundamental categories of lead, by which the elixir is formed. If non-conforming elements are present, the elixir cannot be achieved. It is like a household of father, mother, husband, and wife—no outsiders may enter. Lead, mercury, and the Five Phases are likewise.\"\n\n\"When subdued and congealed into medicine, the bones, flesh, essence, qi, and blood vessels are all complete, and only then is it fit for ingestion. Another ancient song says:\n\n*Why speak of Metal, Wood, Water, Fire, Earth?\nTo preserve the body and safeguard life—these are Dragon and Tiger.\nIf students fail to recognize the essence of the Five Phases,\nThey mistakenly take others for their parents.\nWood governs qi, the Tiger governs bones,\nBlood governs Water, flesh governs Earth.\nThe Way of immortality lies in the Li Palace—\nWhen the Five Phases are mastered, the body has its lord.\nThe Five Phases must be kin to mercury,\nFor external substances are unfit as companions.*\n\nAnother song by Helan Qiu states:\n\n*The Azure Dragon rises, the White Tiger rests,\nThe Dark Warrior soars, the Vermilion Bird sits,\nThe Yellow Dragon in the center bears fruit itself.\nMother cherishes child, child cherishes mother,\nIn the crucible, a single cloud congeals—\nIngesting a knife-tip’s measure, nothing is impossible.*\n\nThis is the Dao.\"\n\nLord Guangyuan asked: \"Though the great medicine arises from the Dragon and Tiger’s subjugation and the true qi of the Five Phases, when it comes time to ingest it, what is its most essential form?\"\n\nThe master replied: \"The completed medicine is but a single substance—mercury. Though it is the embryo of divine water and becomes purple-gold powder, already containing the five hues and manifesting the Five Phases, when embodied, it is called the Golden Liquid Returned Elixir. The immortals of highest antiquity all followed this single method. An ancient song says:\n\n*Mercury alone is the immortal’s medicine,\nPassed down through ages, its fire-taming hard.\nWhen the River Chariot transforms it to purple powder,\nThat powder in an instant becomes the Golden Elixir.*\n\n*The true method of the Golden Elixir has no hooks,\nMercury alone is most profound.\nA knife-tip’s touch verifies its transmutation—\nIngest it, never die, and sail the immortal’s boat.*\n\nAnother song says:\n\n*Take the drawn-out mercury,\nReturn it to burning, reverse it to cinnabar.\nIn the womb, it receives the five hues,\nWhen the moon is full, it is the yellow sprout.\nLost on the path, it cannot be seen—\nFace to face, yet separated by heaven and sea.\nWhen you reach the River Chariot’s ground,\nThis alone is the immortal’s home.*\n\nThis is clear.\"",
      "overlap_context": "ter and fire following one another, the time fully ripening, they naturally unite, transforming beyond compare. When the yellow sprout is formed, the great Dao is complete. The song says:\n\n*Lead and the yellow sprout, together with the three flowers,\nGather my qi to congeal into cinnabar.\nFirst, the sun’s movement is like fire’s conveyance,\nFive hues hidden within the divine flower.\nOnce made the servant, the Dao is without flaw—\nWhen the three are complete, one is a immortal.*\n\nThis is evident.",
      "start_char": 2964,
      "end_char": 3479,
      "start_sentence": 157,
      "end_sentence": 187,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.819080591201782,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\海客论.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "光元曰：服火水银若成药，自古已来，亦有朱砂水银，伏火者不少，因何服食，皆不延年，及点化之问，亦无使用，此何也。 曰：此皆不得神仙之妙术，不按经书之理，不得五行制度，不得日月精华。 或因诸类相和，或与至真违远，纵得千斤伏火，亦与瓦石一般。 非惟点化无堪，亦且服食夭寿。 故《王真人传》云：古有兄弟二人，将水银一斤。 於阳山修炼三年，伏火如红玻办色，谓是至药。 兄弟二人各服半斤，六月便衣绵衣，行又要人扶策，此则皆是希望延年，反有坠身。 岂非药类之不同，方术之错误，此既可验，窃见求真，若得真方，万不失一。 既黄芽是大药之本，药是五行之所成，并晓真元，何#10知出世#11。 未委几何分两，烧制何时，乃可成就，敢请其方。 曰：神仙至药分两，争无大道。 金丹烧成有节，不惟炉作器象，亦且鼎有乾坤。 火从子以为初，须明卦兆。 复从离而终亥，始见光华。 亦同#12子在胎中，直须月满。 鸡居卵内，须要日周。 分两则二八同居，节候则一星周雨，方可龙兴云雨，虎啸山岩，自延世上之年，不是人间死物。 歌云：二八姥女，十六铅精。 阳生起火，阴尽须停。 星辰周雨，至药通灵。 又陶隐居望江南云：长生药，本是五行作#13。 子午二门开，卯酉四时运，火合乾坤，龙虎自相吞。 此之谓也。 光元曰：大丹恭闻命矣。 又见诸书所云：日魂月魄，白虎青龙，丹砂河车，真铅正汞，名字不少，疑惑人心，未审此中谁为正号，敢问其由。 曰：多般多号，皆是一涂。 日魂即是阳精，月魄还归阴体，青龙是木，岂离束方。 白虎为金，还居西面。 河车金液，是仙人得意之名。 正汞真铅，乃达士当时之号。 但令消息，何用迟疑。 不越五行，更无别理。 光元曰：又见《黄帝阴符经》云：还丹之术百数。 其要在神水华池。 华池之内，至神至妙。 故黄帝遇此而升真，马明因兹而得道。 华池之理，亦在五行前章之中，具陈仔细。 故《元阳子歌》日； 神水华池世所稀，流传不许俗人知。 世上若将凡铅汞，相似教人永不疑。 光元曰：见诸丹经云：三五与一，天地至精。 未委此言是何事也。 曰：前章备陈三五一者，亦是五行，且非别物。 尔更研究，必达根元。 不见古歌云：阴坎徒迷一，阳离五彩形。 欲知三处所，偏抱木之灵。 炼药先通诀，仍须诣古经。 琼丹君若毕，天驾五云耕。 光元曰：世上诸药，何止万般，唯金液还丹，即得延年保寿，及至升真，何也。 曰：尔之愚钝，犹不知之。 且世上之人。",
      "translated_text": "Guangyuan asked: \"If mercury refined by fire becomes an elixir, then since ancient times there have been many who have subdued cinnabar and mercury with fire—why is it that none of them have prolonged their years through ingestion, nor found success in transmutation? What is the reason for this?\"\n\nThe master replied: \"This is because they have not grasped the wondrous arts of the immortals, have not followed the principles of the scriptures, have not mastered the system of the Five Phases, and have not obtained the essence of the sun and moon. Some have mixed incompatible substances, while others have strayed far from the utmost truth. Even if they refine a thousand pounds of mercury with fire, it is no different from tiles and stones. Not only is it useless for transmutation, but ingesting it will even shorten one’s lifespan. Thus, the *Biography of Master Wang* states: 'In ancient times, there were two brothers who took a pound of mercury to Yangshan and refined it for three years. The mercury, subdued by fire, turned the color of red glass, and they believed it to be the supreme elixir. Each brother ingested half a pound, but within six months, they were wearing padded robes and had to be supported while walking. What they hoped would prolong their years instead harmed their bodies. Is this not due to the differences in medicinal substances and the errors in their methods? This serves as clear proof. Those who seek the truth must obtain the true formula—then not one in ten thousand will fail.\n\nSince the Yellow Sprout is the foundation of the great elixir, and the elixir is formed by the Five Phases, one who understands the true origin—how could they not transcend the world? I do not yet know the proper measurements, the duration of refinement, or the method for achieving success. I humbly request the formula.\"\n\nThe master said: \"The measurements of the immortal’s supreme elixir are not fixed by the great Dao. The refinement of the Golden Elixir follows a rhythm, for not only must the furnace and vessel take proper form, but the crucible must also embody Heaven and Earth. The fire begins at *zi* as its starting point, and one must understand the hexagrams’ omens. It continues from *li* and ends at *hai*, only then will the radiant splendor appear. This is like a child in the womb, which must await the fullness of the moon, or a chick within the egg, which must endure the cycle of the sun. As for measurements, the two eights dwell together; as for timing, a single stellar cycle must be completed. Only then can the dragon rise with clouds and rain, and the tiger roar upon the mountain crags—naturally prolonging one’s years above the world, rather than becoming a dead thing of the mortal realm.\"\n\nA song says:\n*The maid of sixteen, the essence of lead,\nWhen yang arises, kindle the fire; when yin is exhausted, cease.\nA stellar cycle completes the rain—\nThe supreme elixir attains numinous power.*\n\nAnother verse by Tao Hongjing in *Gazing at the Southern River* says:\n*The elixir of long life is formed by the Five Phases.\nThe gates of *zi* and *wu* open, while *mao* and *you* govern the four seasons.\nFire unites with Heaven and Earth—\nDragon and tiger devour each other.*\nThis is what it means.\n\nGuangyuan said: \"I have received your instruction on the Great Elixir. Yet I have seen in various texts many names—*Sun’s Essence and Moon’s Spirit, White Tiger and Azure Dragon, Cinnabar and River Chariot, True Lead and Proper Mercury*—which confuse the mind. I do not yet know which among these is the correct designation. May I ask the reason?\"\n\nThe master replied: \"Though there are many names, they all follow the same path. The *Sun’s Essence* is the essence of yang; the *Moon’s Spirit* returns to the body of yin. The *Azure Dragon* is Wood, how could it depart from the East? The *White Tiger* is Metal, and thus resides in the West. *River Chariot* and *Golden Liquid* are the favored names of immortals. *True Lead* and *Proper Mercury* are the designations of those who have attained understanding. As long as one grasps the subtle workings, what need is there for hesitation? They do not transcend the Five Phases, nor is there any other principle.\"\n\nGuangyuan said: \"I have also seen in the *Yellow Emperor’s Scripture of the Hidden Talisman* that among the hundred methods of the Returned Elixir, the essential lies in the *Divine Water* and *Flowery Pond*. Within the Flowery Pond, the utmost spirit and wonder reside. Thus, the Yellow Emperor encountered this and ascended to perfection, and Ma Ming thereby attained the Dao. The principle of the Flowery Pond is fully expounded in the earlier chapter on the Five Phases. Thus, the *Song of Master Yuanyang* says:\n*The Divine Water and Flowery Pond are rare in the world,\nTheir transmission forbids the knowledge of the vulgar.\nIf worldly lead and mercury are used,\nThey will only deceive people forever without doubt.*\"\n\nGuangyuan said: \"I have seen in various elixir scriptures the phrase: *Three, Five, and One—the essence of Heaven and Earth.* I do not yet understand what this refers to.\"\n\nThe master replied: \"The earlier chapter thoroughly explained that *Three, Five, and One* are also the Five Phases—nothing else. If you study this further, you will surely reach the root. Have you not seen the ancient song:\n*Yin’s *kan* vainly seeks the One,\nYang’s *li* takes the Five’s radiant form.\nTo know the three places,\nEmbrace the spirit of Wood.\nRefine the elixir—first master the secret,\nThen delve into the ancient scriptures.\nWhen you complete the numinous cinnabar,\nHeaven’s chariot will plow the five clouds.*\"\n\nGuangyuan said: \"Among the myriad medicines in the world, why is it that only the *Golden Liquid Returned Elixir* can prolong life, preserve longevity, and even ascend one to perfection?\"\n\nThe master replied: \"Your ignorance is such that you still do not understand. As for the people of the world...\"",
      "overlap_context": "ks,\nMercury alone is most profound.\nA knife-tip’s touch verifies its transmutation—\nIngest it, never die, and sail the immortal’s boat.*\n\nAnother song says:\n\n*Take the drawn-out mercury,\nReturn it to burning, reverse it to cinnabar.\nIn the womb, it receives the five hues,\nWhen the moon is full, it is the yellow sprout.\nLost on the path, it cannot be seen—\nFace to face, yet separated by heaven and sea.\nWhen you reach the River Chariot’s ground,\nThis alone is the immortal’s home.*\n\nThis is clear.\"",
      "start_char": 3480,
      "end_char": 4443,
      "start_sentence": 188,
      "end_sentence": 238,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.406290292739868,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\海客论.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "无不禀於五行，而生至於心肝脾肺肾脏，岂离阴肠五行。 晓五行之精，合万象之精光，透得紫金之妙用，流津成华池之名，服之岂不保固四肢，坚牢五脏，自然长生有地，去世成因，若在目前。 迷人但执古歌云：金砂#14入五内。 雾散若风雨。 熏蒸达四肢，颜色悦择好。 老翕复丁壮，耆妪成诧女。 发白又再黑，齿落更重生#15。 号之曰真人。 石药者，五行不录，生服则毒损人藏腑，伏火则与瓦砾何殊，止可医治小病，宁比於大丹。 事理皎然，真源不昧。 草木为药者，四时雕变，自不固於霜雪，万味相和，只可治其风湿，尤不可比於大丹也。 光元曰：金丹服之长寿，乃至升仙，未委世问，更有何用。 先生曰：迷人迷人，金丹大药，岂无所用，此丹一年满足，十月周圆，开炉而紫粉成金，启鼎而黄芽散惧，包含五彩，聚集百灵，先将点化。 水银，立成黄金。 始验服食之后，永固筋骨，济命济家，非虚言也。 古歌云：丹砂丹砂，能济我命，能济我家。 又陶隐居望江南云：十月满，开鼎一团红。 数片残霜含五彩，解胎神水响玲珑，气馥异香浓。 此可知也。 光元曰：水银除此黄芽外，更有何药得成宝物。 曰：除此黄芽，无药可也。 光元曰：诸药何为制得。 曰：制得者水银，水银者天地之精，五金之魄，性流利而不染诸杂，故俗言水银无假也。 诸物焉能入得黄芽，黄芽者体是水银，感五行之精而成，故舍此即不成也。 世人多用药，以至穷日尽力，寻求矾石之精，不远千里而行，纵然求得，终无所成，劳思焦心，倏归泉土，可不悲哉。 皆由不晓药之性情，不知药之类聚，且矾之与石，不与金同，水银既是金魄，石药因何得入而成其金。 故歌曰：金可作，世可度。 金不作，徒自误。 此不虚矣。 大乐只在目前，人自不知。 必欲矾石为之，亦犹上山求鱼，入海网兔，何可得也。 光元曰：世人或以五金为匮，伏制水银，亦是经年，必无所成，是何事也。 曰：五金者，人世质物，亦与至药不同，黄芽篇中具陈仔细。 且术有幽秘，道有玄微，皆须口传心授，方可成丹。 世人妄凭泛说，专按古方，乱制水银，欲求大事。 殊不知五行含孕，如妊妇之怀胎，铅汞相须，若晨鸡之抱卵，至于妙道，通于神明，毫厘有差，阴阳失序。 故陶隐居望江南云：还丹诀，妙术口相传。 若信古方应自误，颠来倒去枉烧钱，不得怨神仙。 又菩萨蛮云：家家尽有长生药，时人取用皆差错。 气候尚浮沉，问君何处寻，眼看犹不识，误向铅中觅。 此物没黄芽，徒劳岁月赊。 细看此理，即可明也。 光元曰：四黄八石，全无大道之理，不与水银合同，而硫黄又能立制水银成砂，是何理也。 曰：水银者正阴，硫黄者假阳，正气被假阳所制，终始相依，此阴阳之大理。 且硫黄者，是矾之液。 矾者，铁之津。 磁石，铁之母。 针砂磁石，伏制硫黄，立成云粉，此一根也。 硫黄即为铁之孙裔，水银本是金之精魂，二气虽暂相和，终无成事。 但细穷理路，可见根源。 光元曰：诸矾制伏水银不得，亦不与水银相和。 又见碌矾和盐，制水银成粉成霜，是何理也。 曰：水银者，金之魂魄。 碌矾者，铁之精华。 论五金则二气同根，议铅汞则铜铁殊远，是以暂制水银成粉，亦无大功。",
      "translated_text": "All things in the world are endowed by the Five Phases, and their life extends to the heart, liver, spleen, lungs, and kidneys—how could they depart from the Five Phases of yin and yang? When one comprehends the essence of the Five Phases and unites it with the radiance of all phenomena, penetrating the wondrous use of *purple gold*, its flowing nectar earns the name *Pool of Flowers*. Consuming it, how could one not secure the four limbs, fortify the five viscera, naturally attain longevity, and transcend the world as if it were already before one’s eyes?\n\nYet the deluded cling to the ancient song:\n*\"Golden sand enters the five viscera,\nMist scatters like wind and rain.\nSteaming, it reaches the four limbs,\nAnd one’s complexion becomes bright and fair.\nThe old man regains youthful vigor,\nThe aged woman becomes a maiden once more.\nWhite hair turns black again,\nFallen teeth grow anew.\nThus is one called a True Person.\"*\n\nAs for mineral medicines, the Five Phases do not record them. Consumed raw, they poison and harm the organs; refined by fire, they differ little from tiles and pebbles. They may cure minor ailments, but how can they compare to the Great Elixir? The principle is clear, the true source unobscured.\n\nHerbal medicines, subject to the decay of the four seasons, cannot withstand frost and snow. Though a thousand flavors may blend, they only treat wind and dampness—how can they compare to the Great Elixir?\n\nGuangyuan asked: \"The Golden Elixir, when consumed, grants long life and even ascension to immortality. Beyond this, what other use does it have in the world?\"\n\nThe master replied: \"Deluded, oh so deluded! Does the Great Elixir of the Golden Medicine have no other use? When this elixir is complete after a year, its ten-month cycle fulfilled, opening the furnace yields *purple powder turned gold*, and lifting the cauldron scatters the *yellow sprout* in abundance. It encompasses the five colors and gathers the hundred spirits. First, it transmutes mercury into yellow gold. Only then is it verified that after ingestion, one’s sinews and bones are eternally fortified, life and household are saved—this is no empty word.\n\nAs the ancient song says:\n*Cinnabar, oh cinnabar,\nYou save my life, you save my home.*\n\nAnd Tao Hongjing’s *Wang Jiangnan*:\n*When the tenth month is full,\nOpen the cauldron—a mass of red.\nA few flecks of lingering frost hold the five colors,\nThe divine water of the embryo rings clear,\nIts fragrance rich and rare.*\n\nThus may it be known.\n\nGuangyuan asked: \"Beyond this *yellow sprout*, what other medicine can turn mercury into a treasure?\"\n\nThe master replied: \"Beyond this *yellow sprout*, there is no other medicine.\"\n\nGuangyuan asked: \"How are other medicines refined?\"\n\nThe master said: \"What is refined is mercury. Mercury is the essence of heaven and earth, the spirit of the five metals. Its nature is fluid and unstained by impurities—hence the common saying that mercury is without falsehood. How could other substances enter the *yellow sprout*? The *yellow sprout* is inherently mercury, formed by the essence of the Five Phases. Without it, nothing is achieved.\n\nYet people exhaust their days and strength seeking the essence of alum and minerals, traveling thousands of miles in vain. Even if they obtain them, they achieve nothing in the end, their thoughts labored and hearts weary, only to return to the yellow springs. Is this not lamentable? All because they do not understand the nature of medicines, nor recognize that like gathers with like. Alum and minerals do not share the same origin as metal. Since mercury is the spirit of gold, how can mineral medicines enter and transmute it into gold?\n\nThus the song says:\n*Gold can be made, the world can be delivered.\nIf gold is not made, you only deceive yourself.*\nThis is no falsehood. The great joy lies before your eyes, yet people remain unaware. To insist on using alum and minerals is like seeking fish in the mountains or casting nets for rabbits in the sea—how can it succeed?\"\n\nGuangyuan asked: \"Some people use the five metals as a crucible to refine mercury, yet after years of effort, nothing is achieved. What is the reason?\"\n\nThe master replied: \"The five metals are mere worldly substances, not the supreme medicine. The *Yellow Sprout* chapter explains this in detail. Moreover, the art has its hidden secrets, the Dao its profound subtleties. Only through oral transmission and heart-to-heart instruction can the elixir be completed. Yet people recklessly rely on superficial sayings, blindly following ancient formulas to refine mercury, seeking great attainment. They do not realize that the Five Phases contain gestation like a pregnant woman, and lead and mercury depend on each other like a morning hen brooding her eggs. As for the wondrous Dao, it connects to the divine. The slightest deviation disrupts the order of yin and yang.\n\nThus Tao Hongjing’s *Wang Jiangnan* says:\n*The secret of the Returned Elixir,\nA wondrous art passed mouth to mouth.\nIf you trust ancient formulas, you will surely err,\nTossing and turning, wasting money in vain—\nDo not blame the immortals.*\n\nAnd his *Pusa Man*:\n*Every household has the medicine of long life,\nYet people use it incorrectly.\nThe qi and timing still drift and sink—\nWhere, sir, do you seek it?\nBefore your eyes, yet unrecognized,\nYou mistakenly search in lead.\nThis thing lacks the yellow sprout,\nWasting years in vain.*\n\nExamine this principle closely, and you will understand.\n\nGuangyuan asked: \"The four yellows and eight minerals have no relation to the Great Dao and do not harmonize with mercury. Yet sulfur can instantly refine mercury into cinnabar. What is the reason?\"\n\nThe master replied: \"Mercury is true yin, sulfur is borrowed yang. True qi is restrained by borrowed yang, and they depend on each other from beginning to end—this is the great principle of yin and yang. Moreover, sulfur is the liquid of alum, alum is the fluid of iron, and magnetite is the mother of iron. Needle sand and magnetite refine sulfur into *cloud powder*—this is one root. Sulfur is thus the descendant of iron, while mercury is the essence and spirit of gold. Though the two qi temporarily harmonize, they ultimately achieve nothing. Only by carefully investigating the principle can the root be seen.\"\n\nGuangyuan asked: \"Various alums cannot refine mercury, nor do they harmonize with it. Yet I have seen green alum mixed with salt refine mercury into powder or frost. What is the reason?\"\n\nThe master replied: \"Mercury is the spirit and soul of gold. Green alum is the essence of iron. In terms of the five metals, the two qi share a root, but in the discourse of lead and mercury, copper and iron are far apart. Thus, green alum can temporarily refine mercury into powder, but it serves no great purpose.\"",
      "overlap_context": "Embrace the spirit of Wood.\nRefine the elixir—first master the secret,\nThen delve into the ancient scriptures.\nWhen you complete the numinous cinnabar,\nHeaven’s chariot will plow the five clouds.*\"\n\nGuangyuan said: \"Among the myriad medicines in the world, why is it that only the *Golden Liquid Returned Elixir* can prolong life, preserve longevity, and even ascend one to perfection?\"\n\nThe master replied: \"Your ignorance is such that you still do not understand. As for the people of the world...\"",
      "start_char": 4443,
      "end_char": 5673,
      "start_sentence": 239,
      "end_sentence": 293,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.75841236114502,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\海客论.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "亦如飞烧毗黄，上覆其盛即白，若无盐其色不白。 悉皆小事，非关大道。 尔但穷究永除他虑也。 古经云：飞鼠继汞，河车伏汞。 若有杂物，无因得成。 古歌云：河上姥女，灵而最神。 见火即飞，不染垢尘。 鬼匿龙隐，莫知所存。 欲得制他，黄芽是根。 此可知也。 光元曰：世人不晓铅汞，不识五行，将四黄以制水银，将八石以成至药，炮矾雌雄之类，无不褊寻，磁毗胆碌之徒，悉皆入用，指神符霜於黑锡，认圣无知作青盥，火缎千回，水飞万遍，或三年守鼎，五载临炉，皆无所成，虚劳神思，但恐神仙未知诸矾之中，还有人制得水银否，敢请其略。 曰：世间万事，乃至纤毫，未有不因理例相依，种类相取，可不明之。 夫水银者，是金之魂魄精华也。 与铅同根，与水同体，五行相孕，金水相生，得气转华，方乃成其至药。 转至水银，万变千通，世无比类。 故《陶植篇》云：金为水母，母隐子胎。 水者金子，子藏母胞。 此言金水自含孕，窃犊於母中，须化集而成。 又长子继父体，因母立兆基。 此言砂产於金，汞流为子，以金养汞，继体而荣。 道合自然，事根至妙，不可以知，不可以思。 若因矾石杂类之药，则形体全乖，祖宗并失，还返无由而得。 但若雀鸡同窠，猫鼠共穴，将漆补釜，以商涂疮，非唯无益，而又损焉。 歌云：世人好假不好真，并将石药和水银，诧女化归烟露散，只留磁誉自相亲。 炮矾碌胆倾家产，多信狂徒疏作亲。 不遇神仙谈至理，终归白首得无因。 此可知也。",
      "translated_text": "Just as when refining yellow arsenic by sublimation, covering its vessel with a lid turns it white—yet without salt, its color remains unchanged. All such matters are trivial and unrelated to the Great Dao. You must simply delve deeply and forever cast aside distractions.\n\nThe ancient scriptures say: *\"Flying mice follow mercury; the river chariot subdues it.\"* If杂 impurities are present, there can be no success. An old verse declares:\n\n*\"By the riverside, an old woman,\nMost wondrous and divine.\nAt fire’s touch, she takes flight,\nUnsoiled by dust or grime.\nLike ghosts concealed or dragons hidden,\nHer whereabouts unknown.\nTo master her, the yellow sprout\nMust be the root alone.\"*\n\nThis much is clear.\n\nGuangyuan asked: \"The world does not understand lead and mercury, nor does it recognize the Five Phases. People use the Four Yellows to refine mercury, the Eight Stones to concoct the supreme elixir, and employ every manner of preparation—alum, male and female minerals, magnetite, arsenic, chalcanthite, and green vitriol—all to no avail. They mistake divine frost for black tin, or revere the ignorant as sages. They temper with fire a thousand times, refine with water ten thousand cycles, tend the crucible for three years, or watch the furnace for five—yet achieve nothing, exhausting their spirit in vain. I fear that even immortals may not know: among all the alums, has anyone truly succeeded in refining mercury? I humbly request an outline of the method.\"\n\nThe master replied: \"In all things under heaven, even the most minute, nothing exists without principle, analogy, or affinity between kindred types. How can this remain obscure? Mercury is the essence, spirit, and marrow of gold. It shares a root with lead and a body with water. Within the Five Phases, they conceive one another; metal and water generate each other. Only when qi transforms into radiance does the supreme elixir take form. Once transmuted into mercury, its changes are boundless, its transformations infinite—unmatched in the world.\n\nThus, *The Treatise of Tao Hongjing* states: *'Metal is the mother of water; the mother conceals the child in her womb. Water is the child of metal; the child nests within the mother’s embrace.'* This speaks of how metal and water naturally contain one another, the calf hidden within its mother, awaiting transformation to coalesce. *'The eldest son inherits the father’s body, establishing lineage through the mother.'* This means cinnabar is born of metal, and mercury flows as its child—nurtured by gold, it inherits the body and flourishes. The Dao accords with nature; its workings are profoundly subtle, beyond knowing, beyond thought.\n\nIf one relies on alums, stones, or miscellaneous substances, the form and essence become entirely estranged, the ancestral lineage lost, and return to the origin impossible. It is like birds and chickens sharing a nest, or cats and mice dwelling in the same burrow—like using lacquer to mend a cauldron, or mercury to treat a wound. Not only is there no benefit, but harm is certain. A song says:\n\n*'The world prefers the false over the true,\nMixing stone medicines with mercury.\nThe alchemical maiden scatters into mist,\nLeaving only vain repute to cling together.\nAlums and chalcanthite drain one’s estate,\nFools trust charlatans as kin.\nWithout encountering immortals to speak of the supreme principle,\nOne’s white-haired years end in futility.'*\n\nThis, too, is clear.\"",
      "overlap_context": "gyuan asked: \"Various alums cannot refine mercury, nor do they harmonize with it. Yet I have seen green alum mixed with salt refine mercury into powder or frost. What is the reason?\"\n\nThe master replied: \"Mercury is the spirit and soul of gold. Green alum is the essence of iron. In terms of the five metals, the two qi share a root, but in the discourse of lead and mercury, copper and iron are far apart. Thus, green alum can temporarily refine mercury into powder, but it serves no great purpose.\"",
      "start_char": 5673,
      "end_char": 6248,
      "start_sentence": 294,
      "end_sentence": 320,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.053516387939453,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\海客论.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "且石药大约七十二件，太古圣人尽别酸咸，着在方论，只可治诸疾，辟邪沙，不关造化，不合五行。 假令别得元方，穷极妙制，亦是暂留须鬓，岂得同成筋骨。 世问迷谬，乱传方卫，诬诳神仙，漫将矾石以同铅汞研，以柳础和，以枣叶煮，以醋蜜，飞以水酒，未尝有成，虚度光景。 言固济则铁石非坚，说覆藉则寻莫延及，三年满足，已化成尘。 却云鸡犬来冲，龙蛇变去，殊不知大道之理，漫怨天而尤人。 若此之流，世间非一。 更有用尽石中海内诸药，罄竭资产，精意转迷，可不悲哉。 光元曰：世人取桑柴灰煎炼，以制砂汞。 古歌云：龙居震#16位四十八，是桑字。 又歌云：采於蚕食之前。 用乎火化之后，此皆大药之根，未知果然也。 曰：大药之本，前已具陈。 且用桑灰等，皆是迷人所作，愚者所陈，递互相承，一无所就。 真人歌言龙居震#17位四十八者，自是至药分两，方位之号，非桑字也。 凡流不达，妄认虚无，似鹿逐羊，如猿探月，何可得也。 大药者纯用五行，更无别药。",
      "translated_text": "Moreover, mineral medicines number roughly seventy-two in total. The sages of antiquity carefully distinguished their sour and salty properties, recording them in medical treatises—yet these serve only to treat various illnesses and repel demonic influences, bearing no relation to the workings of creation nor aligning with the Five Phases. Even if one were to obtain an original formula and master its most subtle refinements, it would but temporarily preserve the hair and temples; how could it ever transform the sinews and bones?\n\nThe world, lost in delusion, recklessly transmits these methods, deceiving others with claims of divine transcendence. They recklessly grind alums and stones together with lead and mercury, mix them with willow ash, boil them with jujube leaves, or refine them with vinegar and honey. Some even sublimate them with water or wine—yet never achieve success, squandering their days in vain. They speak of \"solidifying the crucible,\" yet iron and stone prove no match for true firmness; they boast of \"covering and insulating,\" yet before long, all efforts come to naught. After three years of labor, what remains has crumbled to dust. Then they claim that chickens and dogs have ascended, or that dragons and serpents have transformed—never realizing the principle of the Great Dao, blindly blaming heaven and resenting others. Such deluded souls are not rare in this world.\n\nStill others exhaust every mineral and herb under heaven, depleting their wealth in pursuit, their minds growing ever more confused. Is this not lamentable? Guangyuan said: \"People take mulberry wood ash to refine cinnabar and mercury.\" An ancient song states:\n\n*'The dragon dwells in the forty-eighth position of Zhen.'*\n*(Note: Zhen (震) is the third trigram, corresponding to the character \"sang\" (桑, mulberry).)*\n\nAnother song says:\n*'Gather it before the silkworms feed,\nUse it after the fire’s transformation.'*\n\nThese are all said to be the root of the Great Medicine—yet who truly knows if this is so?\n\nIt is said: The foundation of the Great Medicine has already been fully expounded. As for using mulberry ash and the like, these are all inventions of the deluded, recitations of fools, passed down in succession yet achieving nothing. The \"forty-eighth position of Zhen\" mentioned in the Immortal’s song refers to the weight and directional alignment of the supreme medicine, not the character for \"mulberry.\" The unenlightened, failing to grasp this, cling to emptiness, chasing illusions like deer pursuing sheep or apes grasping at the moon. How could they ever succeed? The Great Medicine relies purely on the Five Phases, with no other substances involved.",
      "overlap_context": "ing lacquer to mend a cauldron, or mercury to treat a wound. Not only is there no benefit, but harm is certain. A song says:\n\n*'The world prefers the false over the true,\nMixing stone medicines with mercury.\nThe alchemical maiden scatters into mist,\nLeaving only vain repute to cling together.\nAlums and chalcanthite drain one’s estate,\nFools trust charlatans as kin.\nWithout encountering immortals to speak of the supreme principle,\nOne’s white-haired years end in futility.'*\n\nThis, too, is clear.\"",
      "start_char": 6248,
      "end_char": 6645,
      "start_sentence": 321,
      "end_sentence": 336,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.1991548538208,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\海客论.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "矾石相杂，犹且不成。 桑柴之徒，何其远矣。 故《参同》云：狐不乳马，燕不生凤也。 光元曰：世人多取窟突中姻矿，云是木之精，配青龙之位。 《元阳子歌》云：要识丹砂是木精，移来西位与金并。 迷人何处寻龙虎，恍惚之问在杳冥。 言此是也。 复觅墉州井盐，或以太阴元精石，配白虎之象。 正真龙虎之道，大丹之元，此理如何。 曰：甚哉，子之难悟也。 至真之道匪遥，时人不识，愚智相沿，良可痛也。 夫至药活利之物，变化之身，上秘仙籍，下延人寿。 得之者五行自晓，遇之者万象长明，金丹一成，贫病俱失。 具烟矿元精之类，是世上死物，瓦砾无殊，服之则血脉不生，炼之则精神转悴，将何变化，得成大丹。 理在目前，昧者自＇误。 元阳子歌言真龙真虎之道，岂姻矿之徒。 元阳子素是真人，何昧若是也。 且真龙真虎者，是还丹之体，铅汞之心，神仙悉陈，经书明论，虚妄之人错乱益甚。 故《金丹铭》云：丹砂其位元非赤，四季排来在南宅。 位属南方丙丁火，其形赤。 抽取砂中水银，配属东方甲乙木，其形青龙之象。 黑铅本性元非黑，其为内含抱五德。 配属北方壬癸水，其形黑，抽取砂中精，属西方庚辛金，其形白，白虎之象也。 歌曰：五行不顺行，虎向水中生。 五行颠倒术，龙从火裹出。 又《金丹赋》云：火东转以成龙，水西旋而为虎。 又李柄蟾云：太阴在南宅，太阳在北宅。 火之木曰汞，水之金曰铅。 制在中宫，气以类助。 并是发扬龙虎，证验神丹。 言以姻矿之徒，元精之类，岂得同此耶。 更宜思究，万无一差。 若信迷人，徒自苦耳。 光元曰：先生所说大丹之道尽已，光元窃闻昔淮南刘王炼秋石，以成至药，服食冲天。 未知秋石是何物也。 又见丹记多识圣无知之号，世人云青盐，未知果然耶。 曰：淮王炼秋石者，亦是大丹，更无别理，还如一物，而有数名。 圣人临时各随意，以安其号。 绿金虎者，是大丹之本，其色凝白属西方，西方至秋，故得其号。 亦犹河车黄芽，其一类也。 圣无知者，亦是丹砂心髓，铅汞深门，当五行制伏之时，自生肌骨，及万象包罗之日，血脉皆全。 仙人寻而不知，圣人思而不得，故得其号。 岂是青盐，迷人误矣。 光元曰：大丹之道，神矣妙矣，何仙始知也。 曰：金者水子，汞者金魂，与五行虽是根源，历万载不能合体。 有陵阳子明者，太初真哲，与上古仙人，知此归源，必有秘道。 故将南与北，以西配束，配此四方，不遗中道。 一年运火，十月开炉，七返无亏，九还周足，乃得飞魂伏体，走魄归家，故号紫金火液大还神丹。 歌云：九还七返三五一，龙虎相交．入神室。 灰池焰灼天地精，金液还丹功及毕。 光元曰：大丹之道，恭闻命矣。 世人多将草药，至於赤芹葛苣，章柳含松，皆采而用，地胆裂汁，田翁除根，银苋马齿苋相兼，龙脑兔丝并使，结为砂子，以望黄金，如此之人，如麻似苇，未知有成耶。 曰：人虽一类，愚智万般，所禀不同，所成各异，智者间通域内，愚者不见掌中。 亦由云气生而上天，瓦砾生而在地，蕾买气抑之不住，瓦砾举而不升，愚智亦然，改换非可。 且汞者积阴之气，元水之精，遇万岁以成形，与五金而作魄，重於金体，洁不许尘，悉在目前，有何难睹。",
      "translated_text": "Alum mixed with other stones still fails to form the elixir—how much further astray are those who rely on mulberry firewood and the like! Thus the *Cantong Qi* states: \"Foxes do not nurse horses, nor do swallows give birth to phoenixes.\"\n\nGuangyuan said: \"Many in the world take soot from chimney flues, claiming it to be the essence of wood, matching it to the position of the Green Dragon.\" The *Song of Yuanyangzi* says:\n*\"To know cinnabar as the essence of wood,\nMove it west to join with metal.*\n*Where do the deluded seek Dragon and Tiger?\nIn the dim vastness, all is vague and obscure.\"*\nThis is precisely the case.\n\nOthers seek well salt from Yongzhou or use the *Taiyin* Primordial Essence Stone to pair with the White Tiger’s image. How could this align with the true Way of Dragon and Tiger, the origin of the Great Elixir?\n\nI say: How deeply you struggle to awaken! The supreme Way is not distant, yet people fail to recognize it. Fools and the wise alike pass down these errors—how lamentable! The supreme medicine is a living, transformative substance, its nature concealed in immortal records, extending human life below. Those who obtain it understand the Five Phases intuitively; those who encounter it see all phenomena illuminated. Once the golden elixir is achieved, poverty and illness vanish together.\n\nAs for soot, ore, and primordial essence—these are dead things of the world, no different from tiles and pebbles. Ingesting them halts the flow of blood and qi; refining them exhausts the spirit. How could they transform into the Great Elixir? The truth lies before your eyes, yet the deluded remain blind.\n\nThe *Song of Yuanyangzi* speaks of the true Way of Dragon and Tiger—how could it refer to soot and ore? Yuanyangzi was a true immortal; how could he be so misled? The true Dragon and Tiger are the essence of the returning elixir, the heart of lead and mercury. Immortals have expounded this clearly in scriptures and treatises, yet the deluded grow ever more confused.\n\nThus the *Inscription of the Golden Elixir* states:\n*\"Cinnabar’s position is not inherently red;\nArranged through the four seasons, it resides in the southern abode.*\n*Belonging to the south, the fire of Bing and Ding,\nIts form is red.\"*\nExtract the mercury within cinnabar, and it aligns with the east, the wood of Jia and Yi—its form is the image of the Green Dragon.\n\n*\"Black lead is not inherently black;\nWithin it holds the embrace of the Five Virtues.\"*\nMatching the north, the water of Ren and Gui, its form is black. Extract its essence, and it belongs to the west, the metal of Geng and Xin—its form is white, the image of the White Tiger.\n\nThe song says:\n*\"When the Five Phases do not proceed in order,\nThe Tiger is born within water.*\n*When the Five Phases are inverted,\nThe Dragon emerges from fire.\"*\n\nThe *Rhapsody of the Golden Elixir* also states: \"Fire turns east to become the Dragon; water revolves west to become the Tiger.\" Li Bingchan said: \"The *Taiyin* resides in the southern abode; the *Taiyang* in the northern. Fire’s wood is mercury; water’s metal is lead. Governed from the central palace, qi assists by kind.\" All these expound the Dragon and Tiger, verifying the divine elixir. How could soot, ore, or primordial essence compare? Reflect deeply—there is not a single error. To trust the deluded is to suffer in vain.\n\nGuangyuan said: \"Master, you have fully expounded the Way of the Great Elixir. I have heard that in ancient times, Liu Wang of Huainan refined *qiushi* into the supreme medicine, consuming it to ascend to heaven. What is *qiushi*? I have also seen many alchemical records referring to the title 'Saint Without Knowledge,' which the world calls 'green salt.' Is this true?\"\n\nI say: The *qiushi* refined by the King of Huainan *was* the Great Elixir—there is no other principle. It is one thing with many names. Sages adapt their terms to the moment, assigning names as they see fit. The \"Green Metal Tiger\" is the foundation of the Great Elixir. Its color is congealed white, belonging to the west. The west corresponds to autumn, hence its name. It is like the \"River Chariot\" and \"Yellow Sprout\"—all of one kind.\n\n\"Saint Without Knowledge\" refers to the marrow of cinnabar, the profound gate of lead and mercury. When the Five Phases govern and subdue, it generates flesh and bone; when all phenomena are encompassed, blood and qi are complete. Immortals seek it yet do not know it; sages ponder it yet do not attain it—hence its name. How could it be green salt? The deluded are mistaken.\n\nGuangyuan said: \"The Way of the Great Elixir is wondrous and subtle—how did the immortals first come to know it?\"\n\nI say: Gold is the child of water; mercury is the soul of gold. Though they share a root with the Five Phases, they cannot unite across ten thousand years. Lingyangzi Ming, a sage of the primordial beginning, and the immortals of antiquity knew this return to the source must hold a secret Way. Thus they paired south with north, west with east, arranging these four directions without neglecting the central path. For a year they tended the fire; for ten months they opened the furnace. After seven returns without loss and nine revolutions complete, the flying soul was subdued and the wandering spirit returned home—hence the name *Purple Gold Fire-Liquid Great Return Divine Elixir*.\n\nThe song says:\n*\"Nine returns, seven reversals, three-five-one,\nDragon and Tiger unite in the divine chamber.*\n*The ash pool’s flames refine heaven and earth’s essence;\nThe golden liquid returning elixir’s work is complete.\"*\n\nGuangyuan said: \"I have reverently heard your teaching on the Way of the Great Elixir. Yet many in the world use herbs—red celery, lettuce, *zhangliu*, pine resin, all gathered and employed. They extract juice from *didan*, uproot *tianweng*, combine *yinxian* and purslane, and use *longnao* and dodder, forming them into pellets in hopes of obtaining gold. Such people are as numerous as hemp or reeds—will any succeed?\"\n\nI say: Though humans are of one kind, wisdom and folly vary endlessly. Endowments differ, and so do achievements. The wise comprehend all within the realm; the foolish do not see what lies in their palm. It is like clouds rising to the heavens while tiles and pebbles remain on the earth. The vital qi of *lei* cannot be suppressed, nor can tiles and pebbles be lifted—so too with the wise and foolish; transformation is not possible.\n\nMoreover, mercury is the accumulated qi of yin, the essence of primordial water. It takes ten thousand years to take form, joining with the Five Metals to become their spirit. Heavier than gold, pure and untouched by dust—it lies before your eyes. What is difficult to see?",
      "overlap_context": "d, recitations of fools, passed down in succession yet achieving nothing. The \"forty-eighth position of Zhen\" mentioned in the Immortal’s song refers to the weight and directional alignment of the supreme medicine, not the character for \"mulberry.\" The unenlightened, failing to grasp this, cling to emptiness, chasing illusions like deer pursuing sheep or apes grasping at the moon. How could they ever succeed? The Great Medicine relies purely on the Five Phases, with no other substances involved.",
      "start_char": 6645,
      "end_char": 7883,
      "start_sentence": 337,
      "end_sentence": 391,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.649112939834595,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\海客论.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "草药者，春生夏长，秋落冬残，枝叶匪坚，根茎不永，裂之成水，烧之成灰，若将结汞，天高地远矣。 足认无知苟利之辈，诳惑时人，岂有成事。 居河北指三昊有草，在岭南云两蜀得成，尽是虚传，皆无实理。 相承既远，讹谬堪悲，智者自明，愚人不达。 光元曰：未知草结砂子，终或有之。 曰：兔角长短，龟毛几何。 曰：兔无角，龟无毛。 曰：草结砂子，何异此也。 光元曰：草砂既无，世上多说三黄一匮，以草砂庵成黄金，何也。 曰：三黄体与水银不同#18，又见飞走。 将何以制得成金。 生制即为烟烬，伏火又如瓦砾，别无变化。 母既瓦砾，令子成金银，非理也。 亦如世上飞者即生雌雄，走者即生牝牡，蝼蚁虫鱼并皆如是。 三黄一匮砂草，岂得成事。 若是有成，只以金结，又且何妨。 况金是本根，成了非失到底，不合造化，遗彼丹经，终无所成，故指草也。 且草砂从古至今，只是鬼名，有同向水求尘，钻冰觅火，令蝉乳凤，使鹤怀蛇，石药尚自不同，草则因何得入，递传虚事，妄使搜寻，岭北岭南，海外海内，巧论枝叶，广说酸咸，到底害其己身。 石崇由此而灭家，梁冀因兹而覆族，但要多途营运，百计希求，自然得济贫寒，无至饥阙，岂在须寻无母砂子，以作金银，苟利已深，与道千远。 且神仙以药制造金银，岂须无母砂子，视荣贵如泥土，金宝非有爱也。 至於变化些小，以表药功，乃济饥贫，非沽嗜欲，以灭其身也。 凡流必将无母砂子，欲成金银，是亦大迷。 且无母砂子，烧之不住，飞走如神，与生汞相较，几何无成，至终虚妄。 智者闻而晓悟，愚者执而发白，觅舞之蛇，解飞之鳖，可不悲欤。 光元曰：又见世人将无母砂子，欲成金银，皆罄资财，终无所就，此理如何。 曰：此非好道之人，皆是竞财之辈。 夫道希夷为本，寂湛为基，节嗜欲以居山，去贪婪而处世，存神养气，食柏餐松，方乃渐至清冻，稍达真境。 其金银世问之物，暂济浮生，有分则不求自来，无分则求之不得。 散则彰其德行，聚则更宜熟思，无自迷谬。 先生复问，何谓无母砂子。 光元曰：无有母，只是水银。 先生大笑曰：必要生金银，且有母砂子。 ‘何妨母是金银，汞归母体，岂非理耶。 若必无母，则世问朱砂灵砂，粉霜轻粉，及诸感气之类，亦是水银结成，无有五金，可不同于无母砂子乎。 尔记吾所说，免为时人捕影矣。 光元曰：恭闻命矣，未知世间诸草，还有延年出世否乎。 先生曰：诸名草药亦有延年，子不见《十洲记》、《神仙传》中，极有出世之事也。 若乃灵芝挺秀，朱草呈妍，黄精白木之徒，赤箭狭苓之类，桃花杳仁，柏叶松子，悉堪修事，皆在方书。 亦有煮白石以充饥，炼元精而度世，此皆方外之士，山野奇人，绝粒数年，修真累岁，故得内外相应，服草有功，岂不是延年出世耶。 尔凡流者不知至道，贪爱不休，惟积玉堆金，是为世乐，恣骄奢侈，赛昼相矜，无一日不闲滋味，无一日不顾绮罗，七窍长流，三田不固，任是万般灵药，饵服何为，岂能出世也。 子依吾说，大道匪遥，真境必达。 光元曰：偶因登骯，获遇真人，不外凡愚，幽玄尽付，恩深天地，匪言可训。 今欲营其药类，拟入名山烧制，未知可乎。",
      "translated_text": "Herbs sprout in spring, grow in summer, wither in autumn, and decay in winter. Their branches and leaves are not sturdy, their roots and stems not enduring. Split them, and they yield water; burn them, and they turn to ash. To expect them to congeal into mercury is as distant as heaven from earth.\n\nThose who blindly chase profit, devoid of knowledge, deceive and mislead their contemporaries—how could they ever succeed? Some in Hebei point to the Three Hao regions, claiming herbs grow there; others in Lingnan speak of success in the Two Shu territories. All are empty transmissions, devoid of truth. Passed down through generations, their errors are lamentable. The wise discern this; the foolish remain ignorant.\n\nGuangyuan said: \"Is it possible that herbs might yet produce cinnabar?\"\nThe master replied: \"How long is a rabbit’s horn? How much fur does a tortoise have?\"\nGuangyuan said: \"Rabbits have no horns; tortoises have no fur.\"\nThe master said: \"Then how is the notion of herbs yielding cinnabar any different?\"\n\nGuangyuan said: \"If herbs cannot produce cinnabar, why do so many in the world speak of the *Three Yellows and One Vault*, claiming herbs can refine cinnabar into gold?\"\nThe master said: \"The nature of the Three Yellows differs from mercury, and they are volatile. How could they be controlled to form gold? When raw, they turn to smoke and ash; when subdued by fire, they become like tiles and pebbles—no transformation occurs. If the mother is but tiles and pebbles, how can the child become gold or silver? It defies reason. Just as in the world, flying creatures bear male and female, walking creatures bear male and female, so too with ants, insects, and fish—all follow this pattern. How then could the *Three Yellows and One Vault* or herb-derived cinnabar ever succeed? If they could, why not simply use gold to produce gold? What harm would there be? Moreover, gold is the root; once formed, it does not vanish entirely. It does not defy the workings of creation. Those who leave behind such alchemical texts achieve nothing, for they point to herbs.\n\nHerb-derived cinnabar has, from ancient times to now, been but a phantom name—like seeking dust in water, drilling ice for fire, expecting cicadas to birth phoenixes, or cranes to bear serpents. Even mineral medicines differ fundamentally; how could herbs ever enter the process? Yet falsehoods are passed down, driving men to futile searches—north of the ridges, south of the ridges, beyond the seas, within the seas—crafting clever arguments about branches and leaves, expounding on sour and salty flavors, only to harm themselves in the end. Shi Chong lost his family because of this; Liang Ji’s clan was destroyed. They pursued countless schemes, seeking every possible means, yet only managed to stave off poverty and hunger. Why then seek motherless cinnabar to make gold and silver? The deeper the greed, the farther from the Dao.\n\nTrue immortals, when refining medicines to create gold and silver, do not require motherless cinnabar. They regard glory and wealth as dirt, and gold and jewels as nothing to covet. If they transform small amounts, it is only to demonstrate the efficacy of their medicines, to aid the poor and hungry—not to indulge desires and destroy themselves. Those who insist on using motherless cinnabar to make gold and silver are utterly deluded.\n\nMotherless cinnabar, when burned, cannot be contained—it flees like a spirit. Compared to raw mercury, how much less can it achieve? In the end, it is all vanity. The wise hear this and awaken; the foolish cling to it until their hair turns white. Seeking snakes that dance, turtles that fly—is this not tragic?\"\n\nGuangyuan said: \"I see many in the world exhaust their wealth trying to make gold and silver from motherless cinnabar, yet achieve nothing. What is the reason for this?\"\nThe master said: \"These are not true seekers of the Dao, but those who compete for wealth. The Dao takes emptiness and tranquility as its foundation, stillness and clarity as its basis. One must temper desires and dwell in the mountains, abandon greed and live in the world, preserve the spirit and nurture qi, eat cypress and pine. Only then can one gradually attain purity, slowly reach the true realm.\n\nGold and silver are worldly things, meant only to briefly aid fleeting life. If it is your portion, they will come without seeking; if not, seeking will not bring them. When scattered, they reveal one’s virtue; when gathered, they demand careful consideration. Do not lose yourself in error.\n\nGuangyuan asked again: \"What is motherless cinnabar?\"\nThe master laughed and said: \"You insist on creating gold and silver, yet require motherless cinnabar. Why not simply use gold and silver as the mother? Mercury returns to its mother’s body—is this not reasonable? If you must have no mother, then what of the cinnabar, divine cinnabar, calomel, and light powder of the world—all formed from mercury, yet containing no metals? Are they not the same as motherless cinnabar?\n\nRemember my words, and you will not be deceived by the illusions of your time.\"\n\nGuangyuan said: \"I have heard your instruction. But among the herbs of the world, are there any that can extend life and transcend the mundane?\"\nThe master said: \"Many famous herbs can extend life. Have you not read the *Records of the Ten Continents* or the *Biographies of Divine Immortals*? They contain countless accounts of transcending the world. Lingzhi mushrooms stand tall, red herbs display their beauty, yellow essence and white wood, red arrows and poria—peach blossoms and apricot kernels, cypress leaves and pine seeds—all are suitable for cultivation, as recorded in the medical texts. Some boil white stones to stave off hunger, refine primordial essence to transcend the world. These are the practices of those beyond the mundane, the extraordinary men of mountains and wilds, who go without grain for years, cultivate the true for decades. Thus, inner and outer align, and consuming herbs yields results. Is this not extending life and transcending the world?\n\nBut the common folk know nothing of the supreme Dao. Their greed knows no end. They only amass jade and pile gold, considering it worldly joy. Indulging in arrogance and extravagance, they vie in ostentation, never a day without fine flavors, never a day without fine silks. Their seven orifices flow ceaselessly, their three fields are not secure. Even if they consume myriad divine medicines, what good will it do? How could they ever transcend the world?\n\nFollow my words, and the great Dao is not far; the true realm will surely be attained.\"\n\nGuangyuan said: \"By chance, I ascended the heights and encountered a true person. You have not dismissed me as a mere fool but entrusted me with profound mysteries. Your kindness is as vast as heaven and earth, beyond words to express. Now I wish to prepare these medicines and enter the famous mountains to refine them. Is this permissible?\"",
      "overlap_context": " like clouds rising to the heavens while tiles and pebbles remain on the earth. The vital qi of *lei* cannot be suppressed, nor can tiles and pebbles be lifted—so too with the wise and foolish; transformation is not possible.\n\nMoreover, mercury is the accumulated qi of yin, the essence of primordial water. It takes ten thousand years to take form, joining with the Five Metals to become their spirit. Heavier than gold, pure and untouched by dust—it lies before your eyes. What is difficult to see?",
      "start_char": 7883,
      "end_char": 9114,
      "start_sentence": 392,
      "end_sentence": 434,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.503416538238525,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\海客论.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "曰：此道至大至神，子宜至保，若漏天机，不惟殃尔七祖，即灭尔身，切在秘藏，勿与非人言论交游也。 此山虽是名岳，且近大都，今值兵革方兴，此山当道，多人窜伏，不可制造神丹。 昊越江浙名山甚多，或罗浮、茅岭、庐岳、天台，目下并安，后亦无事，乃是覃贤柄依之地，众圣所游之方，子宜往彼，以制大丹，定是出世。 吾之所论，悉无谬辞，子宜秘保。 光元曰：恩深渤海，荷重丘山，一介微人，将何以报。 曰：尔之有分，济会如兹。 吾见世人扰扰，悉贪荣禄，尽爱繁华丧朴，俄然皆死，吾甚悼此辈也。 将吾所论，录成方册，接引有分之人，即是报吾，吾亦愿也。 光元感极，默尔无言。 先生曰：子久於海上，曾饮元酒否，曰：不识元酒。 先生遂解杖头瓢，与光元汲水。 先生以药投瓢中，木叶盖之，边巡成酒，红紫色，香味非常，先生自饮一杯，余令光元并饮。 讫精神顿爽，乃再拜而谢之。 先生指曰：日已暮，汝且归，吾所止只在峰南，无事却来。 言讫遂行，片云瞥然，踪迹已失。 光元遂归寺舍。 明日直过峰南，以寻先生，径路皆迷，泊至峰南，全无径路，白云飞乌，涧水暖声而已，殊不见人，乃知先生非居凡也。 怅恨再三，谨录以成一卷，达士君子幸细详之也。 海客论竟 #1『己巳』《百问诀》本作『巳酉』。 #2『父』原本作『母』，依《百问诀》本改。 #3『芽』原本作『母』，于义不通，依《百问诀》本改。 #4『玄生因』原本作『白』，于义不通，依《百问诀》本改。 #5『虚中』原本作『中』，依《百问诀》本改。 #6『能生紫气之精』原本作『气紫霜』，于义不通，依《百问诀》本改。 #7『丹』原本作『金』，依《百问诀》本改。 #8『研』原本作『坑』，依《百问诀》本改。 #9『银为黄芽』原本作『粉根』，于义不通，依《百问诀》本改。 #10『何』原本作『可』，依《百问诀》本改。 #11『世』原本作『也』，依《百问诀》本改。 #12『同』原本作『问』，依《百问诀》本改。 #13『本是五行作』原本作『重鼎复重温，于义不通，依《百问诀》本改。 #14『砂』原本作『炒』，依《百问诀》本改。 #15『齿落更重生』原本作『更生异牙齿』，于义不通，依《百问诀》本改。 #16#17『震』原本作『三』，于义不通，依《百问诀》本改。 #18『不同』原本无，依《百问诀》本补。",
      "translated_text": "The master said: \"This Dao is most vast and most wondrous. You must guard it with utmost care. Should you leak its celestial mysteries, not only will your seven generations suffer calamity, but your own body will be destroyed. Keep it strictly concealed, and do not speak of it or associate with those unworthy.\n\nThough this mountain is renowned, it lies near the great capital. Now, with warfare just breaking out, this mountain stands in the path of conflict, and many fugitives take refuge here. You cannot refine the divine elixir here.\n\nIn the Wu and Yue regions of Jiang-Zhe, there are many famous mountains—Luofu, Maoling, Mount Lu, Tiantai—all currently at peace, with no troubles to come. These are the places where worthy sages gather and the immortals roam. You should go there to refine the great elixir, and you will surely transcend the world.\n\nAll that I have told you is without error. Guard it well.\"\n\nGuangyuan said: \"Your kindness is as deep as the Bohai Sea, as weighty as the mountains. I am but a humble man—how can I ever repay you?\"\n\nThe master replied: \"That you have this destiny is a meeting of karmic conditions. I see the people of the world in turmoil, all greedy for glory and rank, all loving extravagance and abandoning simplicity. In an instant, they all die, and I grieve deeply for them.\n\nIf you record what I have taught and compile it into a manual to guide those with the proper destiny, that will be your repayment to me. This is my wish as well.\"\n\nGuangyuan was overcome with emotion and could not speak.\n\nThe master then asked: \"You have spent much time by the sea—have you ever drunk the primordial wine?\"\n\nGuangyuan replied: \"I do not know what primordial wine is.\"\n\nThe master then untied the gourd from his staff and drew water for Guangyuan. He added medicine to the gourd, covered it with a leaf, and in moments, it turned into wine—crimson and purple in hue, with an extraordinary fragrance and taste. The master drank a cup himself and gave the rest to Guangyuan to finish. Immediately, his spirit felt refreshed, and he bowed again in gratitude.\n\nThe master pointed and said: \"The day grows late. You should return now. My dwelling is just south of this peak. Come again if you have no pressing matters.\"\n\nWith that, he departed. A wisp of cloud flashed by, and his traces vanished.\n\nGuangyuan returned to the temple lodging. The next day, he went directly to the south of the peak to seek the master, but the paths were all lost. When he reached the southern slope, there were no trails at all—only white clouds, flying crows, and the warm murmur of the mountain stream. No person was to be seen. Then he knew the master did not dwell among mortals.\n\nWith deep regret, he recorded these teachings into a volume, hoping that scholars and gentlemen would examine them carefully.\n\n*The Discourse of the Sea Traveler* concludes.",
      "overlap_context": "nes, what good will it do? How could they ever transcend the world?\n\nFollow my words, and the great Dao is not far; the true realm will surely be attained.\"\n\nGuangyuan said: \"By chance, I ascended the heights and encountered a true person. You have not dismissed me as a mere fool but entrusted me with profound mysteries. Your kindness is as vast as heaven and earth, beyond words to express. Now I wish to prepare these medicines and enter the famous mountains to refine them. Is this permissible?\"",
      "start_char": 9115,
      "end_char": 10095,
      "start_sentence": 435,
      "end_sentence": 470,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.003471612930298,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\海客论.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}