{
  "source_id": "海琼传道集",
  "source_file": "chunked_daozang\\海琼传道集.json",
  "total_chunks": 4,
  "total_original_chars": 4226,
  "total_translated_chars": 24864,
  "total_translation_time": 128.65754914283752,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\海琼传道集.txt",
    "category": "藏外"
  },
  "full_translation": "**Preface to *Haiqiong’s Transmission of the Dao***\n\nMaster Guan Yin said: \"What can be transmitted is called *affairs*, not the Dao.\" Lord Lao said: \"I know not its name; I forcefully name it the Dao.\" The circulation of this collection stands in profound contrast to the three thousand six hundred methods and the dozens of schools of life-nurturing. May all of like mind delve deeply into it, as one would into the Lu dialect.\n\nSome say that the Master’s words on *nature* and the *Dao of Heaven* cannot be heard. Alas! Later generations, failing to grasp the Master’s intent, take these as matters of lofty difficulty. Yet how could they know that among the Master’s disciples, only Yan Yuan was singled out for praise? Having attained it, Yan Yuan went three months without straying from *ren*, and spent his days in such stillness that he seemed dull-witted. Thus, dwelling in a humble alley, he found joy in a bamboo bowl of rice and a gourd of water—until at thirty-two, he shed his mortal form.\n\nIf one awakens to Yan Yuan’s teaching of the *fast of the mind*, one comprehends the discourse on the *chamber of spirit*. Having grasped the *chamber of spirit*, one grasps *spirit-water*. Mencius said: \"Nature is like water.\" Is this not what he meant?\n\n*The Awakening to Reality* states: \"The essence of life-cultivation lies in the Golden Elixir; the essence of the Golden Elixir lies in the *spirit-water* of the Flowery Pond.\" So simple, so effortless—even the dullest and most ignorant, by practicing it, may ascend to sagehood in an instant.\n\nThe *Daodejing* says: \"My Dao is most easily known, most easily practiced.\" Long ago, Zhongli Quan transmitted this to Lü Dongbin; Lü to Liu Haichan; Liu to Zhang Boduan; Zhang to Shi Tai; Shi to the Venerable Daoguang; Daoguang to Chen Nianzu; and Chen to Bai Yuchan—who is my teacher.\n\nIn the autumn of the *yihai* year, I encountered him at Mount Wuyi. In the spring of the *wuyin* year, we met again on Mount Lu. Passing through the Temple of Supreme Peace and Prosperity, we met the Daoist Hong Zhichang, styled Mingdao, who called himself the Master of Kan and Li. He had long devoted himself to the inner and outer elixirs, exhaustively studying the teachings of a thousand masters and poring over ten thousand scriptures without finding the trace. Yet in an instant of karmic affinity, with but half a phrase, the golden needle scraped away the film from his eyes; in a fleeting moment, the Mystery Pearl took form.\n\nHong the Venerable resolved to conceal his form and vanish from the world, sealing his gate and severing all ties. Seated in meditation, he refined the fire and timing to nurture the sacred embryo. Fearing this Dao would be lost without transmission, he thus published for the world his master’s *Shortcut to the Golden Elixir*, the *Linked and Locked Cyclical Scripture*, and the *Song of Joy from Mount Lu*—compiling them under the title *Anthology of the Transmitted Dao*, that all under heaven might share in it.\n\nDisciple of the Elixir-Spoon, Chen Shoumo, styled Zizhi, and Zhan Jirui bow in reverence and inscribe this record.\n\n**Illustrated Transformation: On Medicinal Substances**\n*(Lord Lao said: \"Put the self behind, and the self leads; forget the self, and the self endures.\")*\n\n**First Turn of the Golden Elixir**\nCalled the *First Return*, called the *First Restoration*.\nLike the dung-beetle in filth—use lead yet not lead, for within lead the work must be done.\n\n**Second Turn of the Golden Elixir**\nCalled the *Second Return*, called the *Second Restoration*.\nAs the dung-beetle shapes dung into a pellet, the Mystery Pearl takes form, the Great One returns to truth.\n\n**Third Turn of the Golden Elixir**\nCalled the *Third Return*, called the *Third Restoration*.\nLike the dung-beetle with its pair—one male, one female—an aged couple reunited, their affection lingering.\n\n**Fourth Turn of the Golden Elixir**\nCalled the *Fourth Return*, called the *Fourth Restoration*.\nAs the beetles roll the dung-pellet together, moving across the earth, the fire and timing of the Celestial Cycle flow freely in the River Chariot.\n\n**Fifth Turn of the Golden Elixir**\nCalled the *Fifth Return*, called the *Fifth Restoration*.\nLike the two beetles embracing the dung-pellet, guarding it with focused intent, nurturing the upright and holding fullness, embracing the feminine and the One.\n\n**Sixth Turn of the Golden Elixir**\nCalled the *Sixth Return*, called the *Sixth Restoration*.\nWithin the dung-pellet, wriggling white grubs gather—spirit and essence converge to form the sacred embryo.\n\n**Seventh Turn of the Golden Elixir**\nCalled the *Seventh Return*, called the *Sevenfold Restoration*.\nWithin the dung-pellet, the white grub transforms into a cicada’s shape.\nWithin it is essence, dim and obscure;\nWithin it is substance, faint and indistinct.\n\n**Eighth Turn of the Golden Elixir**\nCalled the *Eighth Restoration*.\nLike the cicada shedding the shell of the dung-pellet, the seasonal cycle complete, the embryo emerges through divine transformation.\n\n**Ninth Turn of the Golden Elixir**\nCalled the *Ninth Restoration*.\nAs the dung-beetle dies, the dung-pellet splits, and the cicada takes flight—form and spirit both perfected.\n\n**Heavenly Mechanism: On Fire and Timing**\n*(Lord Lao said: \"Subtle and unceasing, as if present; use it without exhaustion.\")*\n\n**First Turn of Fire and Timing (Eleventh Month)**\nLike a peach pit planted in soil.\nDraw the solid center from the Kan position to pierce the yin within the Li palace.\n\n**Second Turn of Fire and Timing (Twelfth Month)**\nLike a peach pit sprouting.\nFrom formlessness, form arises—this is the restored elixir. Who would believe a child is nurtured from nothing?\n\n**Third Turn of Fire and Timing (First Month)**\nLike a peach pit sending forth shoots.\nWhite snow and yellow sprouts—once past, a fierce fire forges the red peach.\n\n**Second Month**\nThis month belongs to *mao* Wood, flourishing in *mao*.\nGuard against danger, tend with care—bathe the elixir’s head.\n\n**Fourth Turn of Fire and Timing (Third Month)**\nLike peach shoots bursting into bloom.\nIn a flash, flames soar, and the true person appears.\n\n**Fifth Turn of Fire and Timing (Fourth Month)**\nLike peach shoots unfurling leaves.\nDraw the White Tiger back to nurture it, and it yields a luminous pearl like the full moon.\n\n**Sixth Turn of Fire and Timing (Fifth Month)**\nLike the peach tree blossoming.\nAt this stage, cinnabar must be bathed, refined, and replenished—apply caution in operation.\n\n**Seventh Turn of Fire and Timing (Sixth Month)**\nLike the peach blossoms fallen.\nThe calyx remains; drink the elixir-spoon, ingest the cinnabar.\n\n**Eighth Turn of Fire and Timing (Seventh Month)**\nLike the calyx of the peach blossom.\nThe seed forms within the egg, the white within the Yellow Dragon’s pearl.\n\n**Eighth Month**\nThis month belongs to *you* Metal, flourishing in *you*.\nOnly tend the fire; do not indulge or bathe.\n\n**Ninth Turn of Fire and Timing (Ninth Month)**\nLike the peach ripening to crimson.\n\n**Tenth Month**\nFrost descends, the elixir matures.\nThe embryo rounds in the tenth month, transcending the mortal to enter sagehood.\nIn the tenth month, the embryo sheds its husk, swallowed into the belly—only then does one know: \"My fate is not ruled by heaven.\"\n\nLord Lao said: \"The Dao does not seek emptiness; emptiness naturally returns to it.\nIf one can empty the heart, the Dao naturally returns.\"\n\n**Diagram of Heaven and Earth in Union**\n**Diagram of Sun and Moon Conjoined**\n\n**Oral Instructions on the Fire and Timing of the Golden Elixir**\nThe ancients said: \"Sages transmit the medicine but not the fire.\"\nThis *Shortcut to the Golden Elixir* fully expounds the subtle principles of the elixir method—yet it dare not openly speak of the fire and timing.\nFor the fire and timing entail seizing the qi of heaven and earth, stealing the essence of sun and moon—one must not treat this lightly.\nOnly those with innate immortal bones will naturally have a share in it.\n\n**Illustration of Creation**\nWhite Jade Toad said: \"Emptiness and spontaneity—from nothing, something arises.\nAll things are one thing; the one is prized in its constancy.\nWhirling wind blends, all day like drunkenness.\nAwakening from the great dream, thunder roars and lightning flashes.\nClouds disperse, rain scatters—heaven endures, earth abides.\"\n\n**Immortals’ Register**\nPerfected Lord of True Yang, Zhongli Quan\nPerfected Lord of Pure Yang, Lü Dongbin\nPerfected Lord of the Sea Toad, Liu Haichan\nPerfected Man of Purple Yang, Zhang Boduan\nPerfected Man of Apricot Grove, Shi Tai\nPerfected Man Daoguang, Xue Shi\nPerfected Man of Mud Pill, Chen Nan\nPerfected Man of Jade Toad, Bai Yuchan\n\n**Linked and Locked Cyclical Scripture**\nThe Supreme Unity Sovereign said: The Golden Elixir is mercury; mercury is lead; lead is silver; silver is cinnabar; cinnabar is gold; gold is tin; tin is quicksilver; quicksilver is verdigris; verdigris is white gold; white gold is black gold; black gold is yellow gold; yellow gold is purple gold; purple gold is the River Chariot; the River Chariot is the Yellow Sprout; the Yellow Sprout is White Snow; White Snow is the Jade Talisman; the Jade Talisman is divine water; divine water is the Flowery Pond; the Flowery Pond is the Green Dragon; the Green Dragon is the White Tiger; the White Tiger is the Vermilion Bird; the Vermilion Bird is the Dark Warrior; the Dark Warrior is the Hooked Array; the Hooked Array is the Yellow Chamber; the Yellow Chamber is true earth; true earth is wu and ji; wu and ji are metal and wood; metal and wood are water and fire.\n\nFire is mao and you; mao and you are the Hare and the Rooster; the Hare and the Rooster are the Crow and the Rabbit; the Crow and the Rabbit are the Tortoise and the Serpent; the Tortoise and the Serpent are the Horse and the Ox; the Horse and the Ox are Qian and Kun; Qian and Kun are Kan and Li; Kan and Li are the female and the male; the female and the male are husband and wife; husband and wife are children and grandchildren; children and grandchildren are the lunar mansions Fang and Bi; Fang and Bi are the sun and the moon; the sun and the moon are heaven and earth; heaven and earth are humanity; humanity is the Yellow Dame; the Yellow Dame is the Metal Duke; the Metal Duke is the Alchemical Maiden; the Alchemical Maiden is the Infant; the Infant is Ding the Elder; Ding the Elder is the Red Child; the Red Child is the Sacred Embryo; the Sacred Embryo is the Three Passes; the Three Passes are the Golden Liquor; the Golden Liquor is the Jade Liquor; the Jade Liquor is the Knife-Point; the Knife-Point is the Cinnabar Field; the Cinnabar Field is the Crimson Palace; the Crimson Palace is the Muddy Pellet; the Muddy Pellet is the Sea of Qi; the Sea of Qi is the kidneys; the kidneys are the heart; the heart is the Dao; the Dao is the Dharma; the Dharma is the Art; the Art is emptiness; emptiness is spontaneity; spontaneity is application; application is fire; fire is the elixir; the elixir is qi; qi is spirit; spirit is the Elixir Head; the Elixir Head is the Great Return; the Great Return is the Seven Reversions; the Seven Reversions are the Nine Returns; the Nine Returns are Metal and Fire; Metal and Fire are the Purple Mushroom; the Purple Mushroom is the Water Source; the Water Source is the Earthen Cauldron; the Earthen Cauldron is the Metal Tripod; the Metal Tripod is the Jade Furnace; the Jade Furnace is the Spirit Chamber; the Spirit Chamber is the Primordial Altar; the Primordial Altar is the Yellow Court; the Yellow Court is the eyes; the eyes are the nose; the nose are the ears; the ears are the pine; the pine is the dung beetle; the dung beetle is the peach; the peach is the red tangerine; the red tangerine are the Six Thieves; the Six Thieves are the Three Corpses; the Three Corpses are the Three Hun; the Three Hun are the Seven Po; the Seven Po are the Five Spirits; the Five Spirits are the Myriad Spirits; the Myriad Spirits are the One Spirit; the One Spirit are the Myriad Treasures; the Myriad Treasures are bathing; bathing is withdrawal and replenishment; withdrawal and replenishment are advance and retreat; advance and retreat are civil and martial; civil and martial are weight and measure; weight and measure are fortune and misfortune; fortune and misfortune are punishment and virtue; punishment and virtue are existence and extinction; existence and extinction are black and white; black and white are being and non-being; being and non-being are beginning and end; beginning and end are movement and stillness; movement and stillness are cold and heat; cold and heat are yin and yang; yin and yang are the winter solstice; the winter solstice is the summer solstice; the summer solstice is the full moon; the full moon is the new moon; the new moon are the quarters; the quarters is the dark moon; the dark moon are the tidal signs; the tidal signs is the lunar orb; the lunar orb is the solar radiance; the solar radiance is the Great One; the Great One is the Mysterious Pearl; the Mysterious Pearl are the Four Symbols; the Four Symbols are the Five Phases; the Five Phases are the Eight Trigrams; the Eight Trigrams are the Three Powers; the Three Powers are the Three Luminaries; the Three Luminaries are the Two Modes; the Two Modes is the Great Ultimate; the Great Ultimate is the Supreme; the Supreme is the Primordial Chaos; the Primordial Chaos is the Beginningless; the Beginningless is the Endless; the Endless is the Primordial Beginning; the Primordial Beginning is the One Qi; the One Qi is the Void; the Void is emptiness; emptiness is the Undifferentiated; the Undifferentiated is the Golden Elixir.\n\nThe Old Lord said: \"Attain the One, and the myriad affairs are complete; complete the myriad, and the One is accomplished.\"\nZhang Ziyang said: \"Hooks and locks link in an unbroken chain—Dao has no end or beginning, flowing ceaselessly. Only humanity is most numinous; with the heart, one joins the Dao. The Dao is in heaven and earth, yet heaven and earth do not know the Dao; it is in the myriad things, yet the myriad things do not know. Thus, those who attain the Dao—body is heaven and earth; heaven is earth; earth is heaven; heaven is the Dao; the Dao is heaven and earth; heaven and earth is the body; body is the heart; heart is spirit.\"\n\nChen Niniwan said: \"The ancient immortals and sagely worthies transmitted it mouth to mouth, without establishing written words. Now I record it in writing for the world. The superior person attains it, and the heart becomes like the Great Void; the middling person attains it, and the body becomes like withered wood; the inferior person attains it, and body and heart remain restless.\"\n\nGuan Yinzi said: \"The worthy cling to the inner; the multitude cling to the outer; the sage regards both as false.\"\n\nBai Yuchan said: \"Those who attain awakening may transmit the sagely Dao. Without awakening, there is no attainment; those who awaken attain the sagely Dao. It has no past, no present—its departure is not past, its arrival is not present. What can be transmitted is only called 'affair,' not 'Dao.' The Dao is fundamentally untransmittable; the Dao has no sound or color; the Dao has no form or appearance; the Dao has no past or present; the Dao has no coming or going.\"\n\nDao Guang said: \"Practice for one year, and the Sacred Embryo forms; practice for two years, and the Infant becomes numinous; practice for three years, and the body outside the body appears; practice for four years, and children beget grandchildren; practice for nine years, and one may ascend in flight. If merit and practice are incomplete, there may be gathering and dispersal—gathered, it forms a body; dispersed, it becomes a wind-child. But for a fleeting moment, behold the Mysterious Pearl! The Mysterious Pearl is the essence of the Primordial Chaos. When refining, simmer the fire gently to preserve your body, aligning with heaven and earth.\"\n\nLiu Haichan said: \"Diligent yet unmet, one may still encounter a sagely teacher; met yet indolent, one ultimately becomes a lesser ghost.\"\n\nLü the Realized said: \"To lightly divulge or carelessly leak brings calamity upon the nine ancestors; through cultivation and practice, the body ascends to the Great Tenuity.\"\n\nZhongli Quan said: \"Gently roll up, silently gather; bathe in joyous harmony, ever-flowing.\" The *Daodejing* says: \"Ceaseless as if existing, concentrate qi to attain softness, like a newborn babe. Constant virtue does not depart, returning to the state of the infant.\"\n\n*Song of Joy* (For the Daoist Chen Zhibai)\n\nJoyful, joyful, truly joyful,\nAll at once, I cast it all away.\nHands unbound, I sing loudly and return,\nGinger and pepper—ah, how pungent!\n\nNow joyful, greatly joyful,\nSometimes wild, sometimes unruly.\nWithin this body, husband and wife reside,\nTell this to others, and they’ll surely laugh.\n\nOnce joyful, a small joy,\nLike a rootless tree, plucked clean.\nA man, truly pregnant,\nMother and child, one form, lively and free.\n\nJoyful, joyful, truly joyful,\nThe void shattered like an autumn hair’s end.\nThrough countless lives of rebirth,\nOnly this great death brings true life today.\n\nOld nests and hollows, past livelihoods,\nNow all swept clean, cast away.\nIt turns out father was only father,\nBewildered, entangled in one’s own web.\n\nLately, vaguely discerning east from west,\nForty-eight, as before, after seven sevens.\nLike a dragon nurturing its pearl, heart unwavering,\nLike a hen brooding her eggs, breath unbroken.\n\nLike the cold cicada sipping dawn’s breeze,\nLike the old oyster holding the autumn moon.\nA single idle man between heaven and earth,\nA great laugh shakes the vastness of heaven and earth.\n\nClothing: one robe for all four seasons,\nFood: one bowl from a thousand homes.\nIn a three-house village, I play the madman,\nThrough ten-house streets, I dash wildly.\n\nOne husband, one wife, with six children,\nWhether walking or sitting, ever steadfast.\nGather and release, act freely,\nThis is the Buddha of the ten directions and three times.\n\nOne cup of wine, then another,\nOne song sung, then another.\n\nAt midday, clear and bright, three meals taken,\nAfter eating, a snoring nap.\nLetting go of ten thousand entanglements, all cast aside,\nOnly when freed and at ease does true joy arise.\n\nExhausting all cleverness to learn folly,\nAt this moment, the scene transforms—dawn’s secret attained.\nOrdinary folk fail to turn somersaults,\nLike eating salt when hungry, only increasing thirst.\n\nBy chance, wandering to Mount Lu,\nAmid white duckweed and red smartweed.\nAscending the Pavilion of Heavenly Sounds to gaze,\nThe yellow crane has not returned—spring rain chills.\nHow many in this world feel heartache,\nFailing to refine the golden elixir of the Great Return.\n\nForgetting form to nurture qi is the golden liquid,\nFacing scenes with no mind is the Great Return.\nForgetting form, transforming qi; qi transforming spirit,\nThis is the Great Dao penetrating the Three Passes.\n\nThe Crimson Palace burns like a crescent moon furnace,\nThe Spirit Terrace stands silent as the Great Mystic Altar.\nCinnabar is the blood of the red phoenix,\nQuicksilver is the liver of the black tortoise.\nGolden lead gathered into the earthen crucible,\nWooden mercury flees to dwell in the Mud Pill Palace.\n\nThe Flowery Pond lies within the Sea of Qi,\nThe Spirit Chamber rests between the Yellow Court.\nScattered, eyes and ears, nose and tongue grow busy,\nGathered, meridians and protective qi lie at ease.\nThe five viscera and six bowels each have their spirits,\nMyriad spirits pay homage to the One Spirit.\n\nThis One Spirit is called the Primordial Essence,\nPreceding and following heaven, the Creative flourishes.\nSages gather this as medicinal material,\nAssembled, it exists; scattered, it vanishes.\nDay and night, the River Chariot never pauses,\nSilently harmonizing with the Great Creation in its course.\n\nEvery person originally possesses a drop of gold,\nGolden essence and wooden liquid, each half a catty.\nThe twenty-eight constellations return to one furnace,\nOne water, one fire—balance must be precise.\nOne phase firm, one phase yielding,\nOne line strong, one line gentle.\n\nThe heart’s sky marks the seasons of cold and heat,\nThe nature’s earth divides realms like Chu and Qin.\nIn a single day, eighty-four thousand miles,\nThe Dipper’s handle turns the celestial wheel.\nWhen one sheds the shell beyond yin and yang,\nOne cannot but refine mercury into silver.\n\nOnly when the Yellow Dame arrives at the Purple Court,\nDo the Golden Elder and the Mysterious Maiden wed.\nGreen Dragon and White Tiger encircle the golden tripod,\nAt midnight, a sprig of yellow sprout blooms.\nAt the bend of the Nine-Curved River, white snow flies,\nAtop Kunlun’s peak, purple clouds surge.\n\nDing Gong silently guards the jade furnace,\nIn union and gentle nurturing, the fetal immortal forms.\nDivine water extinguishes the fire of the Three Corpses,\nThe sword of wisdom sweeps away the armies of the Six Thieves.\nFrom nothing, something arises—a grain of powder,\nWithin the dung pellet, the scarab’s form.\n\nTruly, one gain becomes eternal,\nIn a fleeting moment, it may coalesce.\nSuddenly, the four great elements birth empty whiteness,\nUnknowing, the One Spirit ascends to the Great Clarity.\nEven if skillfully mercury meets lead,\nWithout knowing the firing times, all is in vain.\n\nIn general, one must rely on the celestial fire,\nOnly after ten months does the sacred embryo begin to round.\nThough the elixir’s head may form, it ultimately dissipates,\nOnly with the firing times does it solidify and endure.\nMovement and stillness, life and death—bathe them,\nFortune and misfortune, advance and retreat—value withdrawal and addition.\n\nAfter nine revolutions of ceaseless fire,\nThe medicinal substances may become the fetal immortal.\nOne hour and eight quarters make one celestial cycle,\nTwelve double-hours correspond to one year.\nFrom each yang union onward,\nRefinement proceeds until the six pure yangs.\n\nSpirit and essence come and go, knowing the tides,\nQi and blood wax and wane like the moon’s soul.\nA single hub has always had thirty spokes,\nThe wonder lies in the waxing and waning arcs.\nConcentrating qi to achieve softness is utmost benevolence,\nRitual, righteousness, wisdom, and trust fuse into benevolence.\n\nTrue earth returning to its place is utmost truth,\nWater, fire, metal, and wood all perfectly whole.\nEssence-water, spirit-fire, and intent-earth,\nRefine them so soul and spirit return to their root.\nThe primordial qi of former heaven now abides,\nScattered among the ten thousand things and the human body.\n\nFlowers bloom in spring winds, birds sing on their own,\nWho knows the Creator’s heaven as spring?\nThe common folk use it daily yet remain unaware,\nQi enters the four limbs, only to wither and fade.\nPines and bamboo, hollow-hearted, receive qi in full,\nDefying frost and snow, they stay verdant through the years.\n\nHow much more so the human primordial spirit, which never dies—\nThis qi is the yellow sprout, the lead.\nThe old may become young, the sick may grow healthy,\nThe scattered may gather, the short-lived may extend.\nThe heart enters emptiness, practicing the firing times,\nInner scenes, inner images—the heaven within the pot.\n\nKnow that each speck of dust is Penglai,\nAnd each leaf is a transcendent.\nSpirit is fire, qi is medicine,\nThe heart is the furnace, the body the field.\nCultivate, plant, and refine yourself,\nEach day, a grain like millet.\n\nThe magic mushroom’s life brings sweet dew to fall,\nTortoise and snake, through the ages, ever entwined.\nOne morning, thunder and lightning shake mountains and rivers,\nOne becomes the sun, ten thousand become smoke.\nWithin the sun, the golden crow flies,\nEvery night at the third watch, it enters the Broad Cold.\n\nChildren and grandchildren, hundreds of millions,\nFurnace, tripod, chickens, and dogs all ascend to heaven.\nThe Great Dao has thirty-two transmissions,\nPassed to Zhang Wuzhen of Tiantai.\nFour transmissions later, to Bai Yuchan,\nWhose eyes spanned the four seas, sighing for lack of people.\n\nBy chance, at the Taiping Xingguo Palace,\nAn old Daoist with white hair, surnamed Chen.\nHalf a lifetime resolved to study lead and mercury,\nWandering myriad waters and mountains in vain hardship.\nOne day, by chance at the foot of Mount Lu,\nHe waved his hand, laughing, and stepped out of the world’s dust.\n\nOn a windy, rainy night in a jade pavilion, beds side by side,\nThe elixir method was taught to restore the origin.\nWhat is a human life like? A cup of wine,\nWhat is a human life like? A lamp’s flame.\nWhere are Penglai and Fangzhang?\nI long to return on blue clouds and white cranes.\n\nJoyful, joyful—truly joyful,\nFor you, I speak these final words.\nThe final words, personally imparted,\nUniversally for all under heaven who study immortality,\nClearly pointing out the path to Penglai.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "海琼传道集 序 关尹子曰：所可传者，只谓之事，不谓之道。 老君曰：吾不知其名，强名曰道。 此集之行，其与三千六百法，养命数十家，大故天渊矣。 凡我同志，其精研之鲁语。 有谓夫子之言，性与天道，不可得而闻也。 吁天下后世，不审夫子之意，即以为甚高难行之事。 夫岂知夫子之门，独称颜渊。 颜渊得之，则三月不违仁，而又终日如愚。 故其在陋巷，甘以箪食瓢饮为乐，所以三十二岁而蜕去矣。 人能悟颜渊心斋之旨，则知神室之说。 既知神室，则知神水。 孟子曰：性犹水也。 其斯之谓乎？ 悟真篇云：修生之要，在乎金丹； 金丹之要，在乎神水华池。 至简至易，虽愚暗小人行之立跻圣地。 道德经云：吾道甚易知，甚易行。 昔者钟离云房以此传之吕洞宾，吕传之刘海蟾，刘传之张平叔，张传之石泰，石传之道光和尚，道光传之陈泥丸，陈传之白玉蟾，则吾师也。 乙亥之秋，遇之于武夷山越，戊寅之春，复于庐山相会。 过太平兴国宫，有道士洪知常，字明道，自号坎离子，于内外二丹留意久矣。 千师外友参究已遍，千经万论搜括无踪。 一旦与之因缘契合，半句之下，金篦刮膜； 片晌之间，玄珠成象。",
      "translated_text": "**Preface to *Haiqiong’s Transmission of the Dao***\n\nMaster Guan Yin said: \"What can be transmitted is called *affairs*, not the Dao.\" Lord Lao said: \"I know not its name; I forcefully name it the Dao.\" The circulation of this collection stands in profound contrast to the three thousand six hundred methods and the dozens of schools of life-nurturing. May all of like mind delve deeply into it, as one would into the Lu dialect.\n\nSome say that the Master’s words on *nature* and the *Dao of Heaven* cannot be heard. Alas! Later generations, failing to grasp the Master’s intent, take these as matters of lofty difficulty. Yet how could they know that among the Master’s disciples, only Yan Yuan was singled out for praise? Having attained it, Yan Yuan went three months without straying from *ren*, and spent his days in such stillness that he seemed dull-witted. Thus, dwelling in a humble alley, he found joy in a bamboo bowl of rice and a gourd of water—until at thirty-two, he shed his mortal form.\n\nIf one awakens to Yan Yuan’s teaching of the *fast of the mind*, one comprehends the discourse on the *chamber of spirit*. Having grasped the *chamber of spirit*, one grasps *spirit-water*. Mencius said: \"Nature is like water.\" Is this not what he meant?\n\n*The Awakening to Reality* states: \"The essence of life-cultivation lies in the Golden Elixir; the essence of the Golden Elixir lies in the *spirit-water* of the Flowery Pond.\" So simple, so effortless—even the dullest and most ignorant, by practicing it, may ascend to sagehood in an instant.\n\nThe *Daodejing* says: \"My Dao is most easily known, most easily practiced.\" Long ago, Zhongli Quan transmitted this to Lü Dongbin; Lü to Liu Haichan; Liu to Zhang Boduan; Zhang to Shi Tai; Shi to the Venerable Daoguang; Daoguang to Chen Nianzu; and Chen to Bai Yuchan—who is my teacher.\n\nIn the autumn of the *yihai* year, I encountered him at Mount Wuyi. In the spring of the *wuyin* year, we met again on Mount Lu. Passing through the Temple of Supreme Peace and Prosperity, we met the Daoist Hong Zhichang, styled Mingdao, who called himself the Master of Kan and Li. He had long devoted himself to the inner and outer elixirs, exhaustively studying the teachings of a thousand masters and poring over ten thousand scriptures without finding the trace. Yet in an instant of karmic affinity, with but half a phrase, the golden needle scraped away the film from his eyes; in a fleeting moment, the Mystery Pearl took form.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 456,
      "start_sentence": 0,
      "end_sentence": 24,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.095152616500854,
      "metadata": {
        "source_file": "dao\\藏外\\海琼传道集.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "洪公将隐形遁迹，杜门绝交，坐进火候，以图圣胎。 恐此道无传，故以所得吾师金丹捷径一篇，钩锁连环经一卷，及庐山快活歌一章，刊行于世。 总而名之曰：传道集，欲天下共之。 刀圭子陈守默紫芝，詹继瑞稽首拜书。 仙化图此图论药物（老君曰后其身而身先忘其身而身存） 图第一转金丹 谓之一返，谓之一还。 如粪壤中有虫名曰蜣螂用铅不用铅须向铅中作 图第二转金丹 谓之二返，谓之二还。 如蜣螂才粪成丸子玄珠成象太乙归真 图第三转金丹 谓之三返，谓之三还。 如蜣螂有两个一雌一雄夫妇老相逢恩情自留恋 图第四专金丹 谓之四返，谓之四还。 如蜣螂共滚粪丸从地上行周天火候自在河车 图第五转金丹 谓之五返，谓之五还。 如两个蜣螂共抱粪丸守而精思养正持盈守雌抱一 图第六转金丹 谓之六返，谓之六还。 如粪丸之中有蠕白者精神聚会结成圣胎 图第七转金丹 谓之七返还丹，谓之七还。 如粪丸中蠕白已成蝉形。 其中有精，杳杳冥冥； 其中有物，恍恍惚惚。 图第八转金丹 谓之八还。 如蝉形已弃其粪丸之壳，节候既周，脱胎神化。 图第九转金丹 谓之九还。 如蜣螂死，粪丸裂，其蝉飞，形神俱妙。 天机图此图论火候（老君曰绵绵若存用之不勤） 十一月，第一转火候，如桃核入土。 取将坎位中心实点破离宫腹内阴 十二月，第二转火候，如桃核生芽。 无质生质是还丹谁信无中养就儿。 正月，第三转火候，如桃核抽条。 白雪黄芽才过了一炉猛火锻红桃 二月，此一月属卯木， 旺在卯，防危虑险，沐浴丹头。 三月，第四转火候，如桃条发英。 一霎火焰飞，真人自出现。 四月，第五转火候，如桃条敷叶。 牵将白虎归来养，产个明珠似月圆。 五月，第六转火候，如桃树生花。 到此丹砂须沐浴抽添，运用更防危。 六月，第七转火候，如桃花已落。 花蒂留其萼，饮刀圭，服丹砂。 七月，第八转火候，如桃花之萼。 结子鸡卵中，黄龙珠内白。 八月，此一月属酉金，旺在酉。 只宜养火，不可放逸沐浴。 九月，第九转火候，如桃实红熟。 十月霜飞丹始熟。 十月胎圆，超凡入圣。 十月，十月脱胎吞入腹，始知我命不由天。 老君曰：道非欲虚，虚自归之。 人能虚心，道自归之。 天地交乾之图：                             日月合璧之图： 金丹火候口诀 古云：圣人传药不传火。 此金丹捷径，备言丹法细微之旨矣。 终不敢明说火候。 夫火候者，乃夺天地之气，盗日月之精，不敢轻世。 夙有仙骨，自然有分。 造物图： 白玉蟾曰：虚无自然，无中生有。 万物一物，一贵乎守。 回风混合，终日如酒。 大梦得醒，雷轰电走。 云收雨散，天长地久。 仙泒： 正阳真君钟离权　纯阳真君吕洞宾　海蟾真君刘海蟾 紫阳真人张伯端　杏林真人石  泰　道光真人薛  式 泥丸真人陈  楠　玉蟾真人白玉蟾 钩锁连环经 太乙元君曰金丹即是汞汞即是铅铅即银 银即砂砂即金金即锡锡即水银水银即青 金青金即白金白金即黑金黑金即黄金黄 金即紫金紫金即河车河车即黄芽黄芽即 白雪白雪即玉符玉符即神水神水即华池 华池即青龙青龙即白虎白虎即朱雀朱雀 即玄武玄武即勾陈勾陈即黄房黄房即真 土真土即戊己戊己即金木金木即水火水",
      "translated_text": "Hong the Venerable resolved to conceal his form and vanish from the world, sealing his gate and severing all ties. Seated in meditation, he refined the fire and timing to nurture the sacred embryo. Fearing this Dao would be lost without transmission, he thus published for the world his master’s *Shortcut to the Golden Elixir*, the *Linked and Locked Cyclical Scripture*, and the *Song of Joy from Mount Lu*—compiling them under the title *Anthology of the Transmitted Dao*, that all under heaven might share in it.\n\nDisciple of the Elixir-Spoon, Chen Shoumo, styled Zizhi, and Zhan Jirui bow in reverence and inscribe this record.\n\n**Illustrated Transformation: On Medicinal Substances**\n*(Lord Lao said: \"Put the self behind, and the self leads; forget the self, and the self endures.\")*\n\n**First Turn of the Golden Elixir**\nCalled the *First Return*, called the *First Restoration*.\nLike the dung-beetle in filth—use lead yet not lead, for within lead the work must be done.\n\n**Second Turn of the Golden Elixir**\nCalled the *Second Return*, called the *Second Restoration*.\nAs the dung-beetle shapes dung into a pellet, the Mystery Pearl takes form, the Great One returns to truth.\n\n**Third Turn of the Golden Elixir**\nCalled the *Third Return*, called the *Third Restoration*.\nLike the dung-beetle with its pair—one male, one female—an aged couple reunited, their affection lingering.\n\n**Fourth Turn of the Golden Elixir**\nCalled the *Fourth Return*, called the *Fourth Restoration*.\nAs the beetles roll the dung-pellet together, moving across the earth, the fire and timing of the Celestial Cycle flow freely in the River Chariot.\n\n**Fifth Turn of the Golden Elixir**\nCalled the *Fifth Return*, called the *Fifth Restoration*.\nLike the two beetles embracing the dung-pellet, guarding it with focused intent, nurturing the upright and holding fullness, embracing the feminine and the One.\n\n**Sixth Turn of the Golden Elixir**\nCalled the *Sixth Return*, called the *Sixth Restoration*.\nWithin the dung-pellet, wriggling white grubs gather—spirit and essence converge to form the sacred embryo.\n\n**Seventh Turn of the Golden Elixir**\nCalled the *Seventh Return*, called the *Sevenfold Restoration*.\nWithin the dung-pellet, the white grub transforms into a cicada’s shape.\nWithin it is essence, dim and obscure;\nWithin it is substance, faint and indistinct.\n\n**Eighth Turn of the Golden Elixir**\nCalled the *Eighth Restoration*.\nLike the cicada shedding the shell of the dung-pellet, the seasonal cycle complete, the embryo emerges through divine transformation.\n\n**Ninth Turn of the Golden Elixir**\nCalled the *Ninth Restoration*.\nAs the dung-beetle dies, the dung-pellet splits, and the cicada takes flight—form and spirit both perfected.\n\n**Heavenly Mechanism: On Fire and Timing**\n*(Lord Lao said: \"Subtle and unceasing, as if present; use it without exhaustion.\")*\n\n**First Turn of Fire and Timing (Eleventh Month)**\nLike a peach pit planted in soil.\nDraw the solid center from the Kan position to pierce the yin within the Li palace.\n\n**Second Turn of Fire and Timing (Twelfth Month)**\nLike a peach pit sprouting.\nFrom formlessness, form arises—this is the restored elixir. Who would believe a child is nurtured from nothing?\n\n**Third Turn of Fire and Timing (First Month)**\nLike a peach pit sending forth shoots.\nWhite snow and yellow sprouts—once past, a fierce fire forges the red peach.\n\n**Second Month**\nThis month belongs to *mao* Wood, flourishing in *mao*.\nGuard against danger, tend with care—bathe the elixir’s head.\n\n**Fourth Turn of Fire and Timing (Third Month)**\nLike peach shoots bursting into bloom.\nIn a flash, flames soar, and the true person appears.\n\n**Fifth Turn of Fire and Timing (Fourth Month)**\nLike peach shoots unfurling leaves.\nDraw the White Tiger back to nurture it, and it yields a luminous pearl like the full moon.\n\n**Sixth Turn of Fire and Timing (Fifth Month)**\nLike the peach tree blossoming.\nAt this stage, cinnabar must be bathed, refined, and replenished—apply caution in operation.\n\n**Seventh Turn of Fire and Timing (Sixth Month)**\nLike the peach blossoms fallen.\nThe calyx remains; drink the elixir-spoon, ingest the cinnabar.\n\n**Eighth Turn of Fire and Timing (Seventh Month)**\nLike the calyx of the peach blossom.\nThe seed forms within the egg, the white within the Yellow Dragon’s pearl.\n\n**Eighth Month**\nThis month belongs to *you* Metal, flourishing in *you*.\nOnly tend the fire; do not indulge or bathe.\n\n**Ninth Turn of Fire and Timing (Ninth Month)**\nLike the peach ripening to crimson.\n\n**Tenth Month**\nFrost descends, the elixir matures.\nThe embryo rounds in the tenth month, transcending the mortal to enter sagehood.\nIn the tenth month, the embryo sheds its husk, swallowed into the belly—only then does one know: \"My fate is not ruled by heaven.\"\n\nLord Lao said: \"The Dao does not seek emptiness; emptiness naturally returns to it.\nIf one can empty the heart, the Dao naturally returns.\"\n\n**Diagram of Heaven and Earth in Union**\n**Diagram of Sun and Moon Conjoined**\n\n**Oral Instructions on the Fire and Timing of the Golden Elixir**\nThe ancients said: \"Sages transmit the medicine but not the fire.\"\nThis *Shortcut to the Golden Elixir* fully expounds the subtle principles of the elixir method—yet it dare not openly speak of the fire and timing.\nFor the fire and timing entail seizing the qi of heaven and earth, stealing the essence of sun and moon—one must not treat this lightly.\nOnly those with innate immortal bones will naturally have a share in it.\n\n**Illustration of Creation**\nWhite Jade Toad said: \"Emptiness and spontaneity—from nothing, something arises.\nAll things are one thing; the one is prized in its constancy.\nWhirling wind blends, all day like drunkenness.\nAwakening from the great dream, thunder roars and lightning flashes.\nClouds disperse, rain scatters—heaven endures, earth abides.\"\n\n**Immortals’ Register**\nPerfected Lord of True Yang, Zhongli Quan\nPerfected Lord of Pure Yang, Lü Dongbin\nPerfected Lord of the Sea Toad, Liu Haichan\nPerfected Man of Purple Yang, Zhang Boduan\nPerfected Man of Apricot Grove, Shi Tai\nPerfected Man Daoguang, Xue Shi\nPerfected Man of Mud Pill, Chen Nan\nPerfected Man of Jade Toad, Bai Yuchan\n\n**Linked and Locked Cyclical Scripture**\nThe Supreme Unity Sovereign said: The Golden Elixir is mercury; mercury is lead; lead is silver; silver is cinnabar; cinnabar is gold; gold is tin; tin is quicksilver; quicksilver is verdigris; verdigris is white gold; white gold is black gold; black gold is yellow gold; yellow gold is purple gold; purple gold is the River Chariot; the River Chariot is the Yellow Sprout; the Yellow Sprout is White Snow; White Snow is the Jade Talisman; the Jade Talisman is divine water; divine water is the Flowery Pond; the Flowery Pond is the Green Dragon; the Green Dragon is the White Tiger; the White Tiger is the Vermilion Bird; the Vermilion Bird is the Dark Warrior; the Dark Warrior is the Hooked Array; the Hooked Array is the Yellow Chamber; the Yellow Chamber is true earth; true earth is wu and ji; wu and ji are metal and wood; metal and wood are water and fire.",
      "overlap_context": "g through the Temple of Supreme Peace and Prosperity, we met the Daoist Hong Zhichang, styled Mingdao, who called himself the Master of Kan and Li. He had long devoted himself to the inner and outer elixirs, exhaustively studying the teachings of a thousand masters and poring over ten thousand scriptures without finding the trace. Yet in an instant of karmic affinity, with but half a phrase, the golden needle scraped away the film from his eyes; in a fleeting moment, the Mystery Pearl took form.",
      "start_char": 456,
      "end_char": 1885,
      "start_sentence": 25,
      "end_sentence": 111,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.60604786872864,
      "metadata": {
        "source_file": "dao\\藏外\\海琼传道集.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "火即卯酉卯酉即兔鸡兔鸡即乌兔乌兔即 龟蛇龟蛇即马牛马牛即乾坤乾坤即坎离 坎离即雌雄雌雄即夫妇夫妇即子孙子孙 即房毕房毕即日月日月即天地天地即人 人即黄婆黄婆即金公金公即姹女姹女即 婴儿婴儿即丁公丁公即赤子赤子即圣胎 圣胎即三关三关即金液金液即玉液玉液 即刀圭刀圭即丹田丹田即绛宫绛宫即泥 丸泥丸即气海气海即肾肾即心心即道道 即法法即术术即虚无虚无即自然自然即 运用运用即火火即药药即气气即神神即 丹头丹头即大还大还即七返七返即九还 九还即金火金火即紫芝紫芝即水源水源 即土釜土釜即金鼎金鼎即玉炉玉炉即神 室神室即元坛元坛即黄庭黄庭即眼眼即 鼻鼻即耳耳即松松即蜣螂蜣螂即桃桃即 朱橘朱橘即六贼六贼即三尸三尸即三魂 三魂即七魄七魄即五神五神即万神万神 即一神一神即万宝万宝即沐浴沐浴即抽 添抽添即进退进退即文武文武即斤两斤 两即吉凶吉凶即刑德刑德即存亡存亡即 黑白黑白即有无有无即始终始终即动静 动静即寒暑寒暑即阴阳阴阳即冬至冬至 即夏至夏至即望望即朔朔即弦弦即晦晦 即潮候潮候即月轮月轮即日华日华即太 一太一即玄珠玄珠即四象四象即五行五 行即八卦八卦即三才三才即三光三光即 两仪两仪即太极太极即太上太上即混元 混元即无始无始即无终无终即元始元始 即一气一气即虚空虚空即虚无虚无即混 沌混沌即金丹 老君曰得其一万事毕毕其万一事办 张紫阳曰钩锁连环相续不断道无终始流 转无穷惟人最灵以心契道道在天地天地 不知道在万物万物不知故得道者身即天 地天即地地即天天即道道而天地天地即 身身即心心即神 陈泥丸云古仙上圣口口相传不立文字吾 今于世书而录之上士得之心同太虚中士 得之身同枯木下士得之身心营营 关尹子曰贤人执于内众人执于外圣人皆 伪之 白玉蟾曰得悟之者可传圣道无悟无得悟 者自得得悟圣道无古无今其去非古其来 非今所可传者只谓之事不谓之道道本无 传道无声色道无相貌道无古今道无往来 道光和尚曰行之一年圣胎成行之二年婴 儿灵行之三年身外身行之四年子生孙行 之九年可飞升功行未备或聚散聚则成形 散则风子但片晌见玄珠玄珠即是混元精 日炼时烹火温温保尔身同天地存 刘海蟾曰勤而不遇终遇圣师遇而不勤终 为下鬼 吕真人曰轻泄漏慢殃及九祖修炼行持身 登太微 钟离云房曰轻轻卷默默收灌沐怡怡兮滚 滚道德经云绵绵若存专气致柔犹于婴儿 常德不离复归于婴儿 快活歌（赠道士陈知白） 快活快活真快活，被我一时都掉脱。 散手浩歌归去来，生姜胡椒果是辣。 如今快活大快活，有时放颠或放劣。 自家身里有夫妻，说向时人须笑杀。 向时快活小快活，无影树子和根拔。 男儿端的会怀胎，子母同形活泼泼。 快活快活真快活，虚空粉碎秋毫末。 轮回生死几千生，这回大死方今活。 旧时巢臼泼生涯，于今净尽都掉脱。 元来爹爹只是爹，懵懵懂懂自瓜葛。 近来仿佛辩东西，七七依前四十八。 如龙养珠心不忘，如鸡抱卵气不绝。 又似寒蝉吸晓风，又如老蚌含秋月。 一个闲人天地间，大笑一声天地阔。 衣则四时惟一衲，饭则千家可一钵。 三家村里弄风狂，十家街头打鹘突。 一夫一妻将六儿，或行或坐常兀兀。 收来放去任纵横，即是十方三世佛。",
      "translated_text": "Fire is mao and you; mao and you are the Hare and the Rooster; the Hare and the Rooster are the Crow and the Rabbit; the Crow and the Rabbit are the Tortoise and the Serpent; the Tortoise and the Serpent are the Horse and the Ox; the Horse and the Ox are Qian and Kun; Qian and Kun are Kan and Li; Kan and Li are the female and the male; the female and the male are husband and wife; husband and wife are children and grandchildren; children and grandchildren are the lunar mansions Fang and Bi; Fang and Bi are the sun and the moon; the sun and the moon are heaven and earth; heaven and earth are humanity; humanity is the Yellow Dame; the Yellow Dame is the Metal Duke; the Metal Duke is the Alchemical Maiden; the Alchemical Maiden is the Infant; the Infant is Ding the Elder; Ding the Elder is the Red Child; the Red Child is the Sacred Embryo; the Sacred Embryo is the Three Passes; the Three Passes are the Golden Liquor; the Golden Liquor is the Jade Liquor; the Jade Liquor is the Knife-Point; the Knife-Point is the Cinnabar Field; the Cinnabar Field is the Crimson Palace; the Crimson Palace is the Muddy Pellet; the Muddy Pellet is the Sea of Qi; the Sea of Qi is the kidneys; the kidneys are the heart; the heart is the Dao; the Dao is the Dharma; the Dharma is the Art; the Art is emptiness; emptiness is spontaneity; spontaneity is application; application is fire; fire is the elixir; the elixir is qi; qi is spirit; spirit is the Elixir Head; the Elixir Head is the Great Return; the Great Return is the Seven Reversions; the Seven Reversions are the Nine Returns; the Nine Returns are Metal and Fire; Metal and Fire are the Purple Mushroom; the Purple Mushroom is the Water Source; the Water Source is the Earthen Cauldron; the Earthen Cauldron is the Metal Tripod; the Metal Tripod is the Jade Furnace; the Jade Furnace is the Spirit Chamber; the Spirit Chamber is the Primordial Altar; the Primordial Altar is the Yellow Court; the Yellow Court is the eyes; the eyes are the nose; the nose are the ears; the ears are the pine; the pine is the dung beetle; the dung beetle is the peach; the peach is the red tangerine; the red tangerine are the Six Thieves; the Six Thieves are the Three Corpses; the Three Corpses are the Three Hun; the Three Hun are the Seven Po; the Seven Po are the Five Spirits; the Five Spirits are the Myriad Spirits; the Myriad Spirits are the One Spirit; the One Spirit are the Myriad Treasures; the Myriad Treasures are bathing; bathing is withdrawal and replenishment; withdrawal and replenishment are advance and retreat; advance and retreat are civil and martial; civil and martial are weight and measure; weight and measure are fortune and misfortune; fortune and misfortune are punishment and virtue; punishment and virtue are existence and extinction; existence and extinction are black and white; black and white are being and non-being; being and non-being are beginning and end; beginning and end are movement and stillness; movement and stillness are cold and heat; cold and heat are yin and yang; yin and yang are the winter solstice; the winter solstice is the summer solstice; the summer solstice is the full moon; the full moon is the new moon; the new moon are the quarters; the quarters is the dark moon; the dark moon are the tidal signs; the tidal signs is the lunar orb; the lunar orb is the solar radiance; the solar radiance is the Great One; the Great One is the Mysterious Pearl; the Mysterious Pearl are the Four Symbols; the Four Symbols are the Five Phases; the Five Phases are the Eight Trigrams; the Eight Trigrams are the Three Powers; the Three Powers are the Three Luminaries; the Three Luminaries are the Two Modes; the Two Modes is the Great Ultimate; the Great Ultimate is the Supreme; the Supreme is the Primordial Chaos; the Primordial Chaos is the Beginningless; the Beginningless is the Endless; the Endless is the Primordial Beginning; the Primordial Beginning is the One Qi; the One Qi is the Void; the Void is emptiness; emptiness is the Undifferentiated; the Undifferentiated is the Golden Elixir.\n\nThe Old Lord said: \"Attain the One, and the myriad affairs are complete; complete the myriad, and the One is accomplished.\"\nZhang Ziyang said: \"Hooks and locks link in an unbroken chain—Dao has no end or beginning, flowing ceaselessly. Only humanity is most numinous; with the heart, one joins the Dao. The Dao is in heaven and earth, yet heaven and earth do not know the Dao; it is in the myriad things, yet the myriad things do not know. Thus, those who attain the Dao—body is heaven and earth; heaven is earth; earth is heaven; heaven is the Dao; the Dao is heaven and earth; heaven and earth is the body; body is the heart; heart is spirit.\"\n\nChen Niniwan said: \"The ancient immortals and sagely worthies transmitted it mouth to mouth, without establishing written words. Now I record it in writing for the world. The superior person attains it, and the heart becomes like the Great Void; the middling person attains it, and the body becomes like withered wood; the inferior person attains it, and body and heart remain restless.\"\n\nGuan Yinzi said: \"The worthy cling to the inner; the multitude cling to the outer; the sage regards both as false.\"\n\nBai Yuchan said: \"Those who attain awakening may transmit the sagely Dao. Without awakening, there is no attainment; those who awaken attain the sagely Dao. It has no past, no present—its departure is not past, its arrival is not present. What can be transmitted is only called 'affair,' not 'Dao.' The Dao is fundamentally untransmittable; the Dao has no sound or color; the Dao has no form or appearance; the Dao has no past or present; the Dao has no coming or going.\"\n\nDao Guang said: \"Practice for one year, and the Sacred Embryo forms; practice for two years, and the Infant becomes numinous; practice for three years, and the body outside the body appears; practice for four years, and children beget grandchildren; practice for nine years, and one may ascend in flight. If merit and practice are incomplete, there may be gathering and dispersal—gathered, it forms a body; dispersed, it becomes a wind-child. But for a fleeting moment, behold the Mysterious Pearl! The Mysterious Pearl is the essence of the Primordial Chaos. When refining, simmer the fire gently to preserve your body, aligning with heaven and earth.\"\n\nLiu Haichan said: \"Diligent yet unmet, one may still encounter a sagely teacher; met yet indolent, one ultimately becomes a lesser ghost.\"\n\nLü the Realized said: \"To lightly divulge or carelessly leak brings calamity upon the nine ancestors; through cultivation and practice, the body ascends to the Great Tenuity.\"\n\nZhongli Quan said: \"Gently roll up, silently gather; bathe in joyous harmony, ever-flowing.\" The *Daodejing* says: \"Ceaseless as if existing, concentrate qi to attain softness, like a newborn babe. Constant virtue does not depart, returning to the state of the infant.\"\n\n*Song of Joy* (For the Daoist Chen Zhibai)\n\nJoyful, joyful, truly joyful,\nAll at once, I cast it all away.\nHands unbound, I sing loudly and return,\nGinger and pepper—ah, how pungent!\n\nNow joyful, greatly joyful,\nSometimes wild, sometimes unruly.\nWithin this body, husband and wife reside,\nTell this to others, and they’ll surely laugh.\n\nOnce joyful, a small joy,\nLike a rootless tree, plucked clean.\nA man, truly pregnant,\nMother and child, one form, lively and free.\n\nJoyful, joyful, truly joyful,\nThe void shattered like an autumn hair’s end.\nThrough countless lives of rebirth,\nOnly this great death brings true life today.\n\nOld nests and hollows, past livelihoods,\nNow all swept clean, cast away.\nIt turns out father was only father,\nBewildered, entangled in one’s own web.\n\nLately, vaguely discerning east from west,\nForty-eight, as before, after seven sevens.\nLike a dragon nurturing its pearl, heart unwavering,\nLike a hen brooding her eggs, breath unbroken.\n\nLike the cold cicada sipping dawn’s breeze,\nLike the old oyster holding the autumn moon.\nA single idle man between heaven and earth,\nA great laugh shakes the vastness of heaven and earth.\n\nClothing: one robe for all four seasons,\nFood: one bowl from a thousand homes.\nIn a three-house village, I play the madman,\nThrough ten-house streets, I dash wildly.\n\nOne husband, one wife, with six children,\nWhether walking or sitting, ever steadfast.\nGather and release, act freely,\nThis is the Buddha of the ten directions and three times.",
      "overlap_context": "w Sprout; the Yellow Sprout is White Snow; White Snow is the Jade Talisman; the Jade Talisman is divine water; divine water is the Flowery Pond; the Flowery Pond is the Green Dragon; the Green Dragon is the White Tiger; the White Tiger is the Vermilion Bird; the Vermilion Bird is the Dark Warrior; the Dark Warrior is the Hooked Array; the Hooked Array is the Yellow Chamber; the Yellow Chamber is true earth; true earth is wu and ji; wu and ji are metal and wood; metal and wood are water and fire.",
      "start_char": 1885,
      "end_char": 3296,
      "start_sentence": 112,
      "end_sentence": 188,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.32954406738281,
      "metadata": {
        "source_file": "dao\\藏外\\海琼传道集.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "有酒一杯复一杯，有歌一阙又一阙。 日中了了饭三餐，饭后齁齁睡一歇。 放下万缘都掉脱，脱得自如方快活。 用尽惺惺学得痴，此时化景登晨诀。 时人不会翻筋斗，如饥吃盐加得渴。 偶然放浪到庐山，身在白苹红蓼间。 一登天籁亭前望，黄鹤未归春雨寒。 心酸世上几多人，不炼金液大还丹。 忘形养气乃金液，对景无心是大还。 忘形化气气化神，斯乃大道透三关。 绛宫炎炎偃月炉，灵台寂寂大玄坛。 朱砂乃是赤凤血，水银乃是黑龟肝。 金铅采归入土釜，木汞飞走居泥丸。 华池政在气海内，神室政在黄庭间。 散则眼耳鼻舌忙，聚则经络荣卫闲。 五脏六腑各有神，万神朝元归一灵。 一灵是谓混元精，先天后天乾元亨。 圣人采此为药材，聚之则有散则零。 昼夜河车不暂停，默契大造同运行。 人人本有一滴金，金精木液各半斤。 二十八宿归一炉，一水一火须调匀。 一候刚兮一候柔，一爻武兮一爻文。 心天节候定寒暑，性地分野分楚秦。 一日八万四千里，自有斗柄周天轮。 人将蜕壳阴阳外，不可不炼水银银。 但得黄婆来紫庭，金翁姹女即婚姻。 青龙白虎绕金鼎，黄芽半夜一枝春。 九曲江头飞白雪，昆仑山颠腾紫云。 丁公默默守玉炉，交媾温养成胎婴。 神水沃灭三尸火，慧剑扫除六贼兵。 无中生有一刀圭，粪丸中有蜣螂形。 诚哉一得即永得，片晌中间可结成。 忽然四大生虚白，不觉一灵升太清。 纵使工夫汞见铅，不知火候也徒然。 大都要籍周天火，十月圣胎方始圆。 虽结丹头终耗失，要须火候始凝坚。 动静存亡宜沐浴，吉凶进退贵抽添。 火力绵绵九转后，药物始可成胎仙。 一时八刻一周天，十二时辰准一年。 每自一阳交媾后，工夫炼到六纯乾。 精神来往知潮候，气血盈虚似月魂。 一毂从来三十辐，妙处都由前后弦。 专气致柔为至仁，礼义智信融为仁。 真土归位为至真，水火金木俱浑全。 精水神火与意土，炼使魂魄归其根。 先天一气今常存，散在万物与人身。 花自春风鸟自啼，岂知造物天为春。 百姓日用而不知，气入四肢徒凋零。 松竹虚心受气足，凌霜傲雪长年青。 况人元神本不死。 此气即是黄芽铅。 老者可少病可健，散者可聚促可延。 心入虚无行火候，内景内象壶中天。 须知一尘一蓬莱，与夫一叶一偓佺。 神即火兮气即药，心为炉兮身为田。 自耕自种自烹炼，一日一粒如黍然。 灵芝一生甘露降，龟蛇千古常相缠。 一朝雷电撼山川，一之则日万则烟。 日中自有金乌飞，夜夜三更入广寒。 子子孙孙千百亿，炉鼎鸡犬皆登天。 大道三十有二传，传到天台张悟真。 四传复至白玉蟾，眼空四海嗟无人。 偶遇太平兴国宫，白发道士其姓陈。 半生立志学铅汞，万水千山徒苦辛。 一朝懈逅庐山下，摆手笑出人间尘。 翠阁对床风雨夜，授以丹法使还元。 人生何似一杯酒，人生何如一盏灯。 蓬莱方丈在何处，青云白鹤欲归去。 快活快活真快活，为君说此末后句。 末后句，亲分付，普为天下学仙者，晓然指出蓬莱路。",
      "translated_text": "One cup of wine, then another,\nOne song sung, then another.\n\nAt midday, clear and bright, three meals taken,\nAfter eating, a snoring nap.\nLetting go of ten thousand entanglements, all cast aside,\nOnly when freed and at ease does true joy arise.\n\nExhausting all cleverness to learn folly,\nAt this moment, the scene transforms—dawn’s secret attained.\nOrdinary folk fail to turn somersaults,\nLike eating salt when hungry, only increasing thirst.\n\nBy chance, wandering to Mount Lu,\nAmid white duckweed and red smartweed.\nAscending the Pavilion of Heavenly Sounds to gaze,\nThe yellow crane has not returned—spring rain chills.\nHow many in this world feel heartache,\nFailing to refine the golden elixir of the Great Return.\n\nForgetting form to nurture qi is the golden liquid,\nFacing scenes with no mind is the Great Return.\nForgetting form, transforming qi; qi transforming spirit,\nThis is the Great Dao penetrating the Three Passes.\n\nThe Crimson Palace burns like a crescent moon furnace,\nThe Spirit Terrace stands silent as the Great Mystic Altar.\nCinnabar is the blood of the red phoenix,\nQuicksilver is the liver of the black tortoise.\nGolden lead gathered into the earthen crucible,\nWooden mercury flees to dwell in the Mud Pill Palace.\n\nThe Flowery Pond lies within the Sea of Qi,\nThe Spirit Chamber rests between the Yellow Court.\nScattered, eyes and ears, nose and tongue grow busy,\nGathered, meridians and protective qi lie at ease.\nThe five viscera and six bowels each have their spirits,\nMyriad spirits pay homage to the One Spirit.\n\nThis One Spirit is called the Primordial Essence,\nPreceding and following heaven, the Creative flourishes.\nSages gather this as medicinal material,\nAssembled, it exists; scattered, it vanishes.\nDay and night, the River Chariot never pauses,\nSilently harmonizing with the Great Creation in its course.\n\nEvery person originally possesses a drop of gold,\nGolden essence and wooden liquid, each half a catty.\nThe twenty-eight constellations return to one furnace,\nOne water, one fire—balance must be precise.\nOne phase firm, one phase yielding,\nOne line strong, one line gentle.\n\nThe heart’s sky marks the seasons of cold and heat,\nThe nature’s earth divides realms like Chu and Qin.\nIn a single day, eighty-four thousand miles,\nThe Dipper’s handle turns the celestial wheel.\nWhen one sheds the shell beyond yin and yang,\nOne cannot but refine mercury into silver.\n\nOnly when the Yellow Dame arrives at the Purple Court,\nDo the Golden Elder and the Mysterious Maiden wed.\nGreen Dragon and White Tiger encircle the golden tripod,\nAt midnight, a sprig of yellow sprout blooms.\nAt the bend of the Nine-Curved River, white snow flies,\nAtop Kunlun’s peak, purple clouds surge.\n\nDing Gong silently guards the jade furnace,\nIn union and gentle nurturing, the fetal immortal forms.\nDivine water extinguishes the fire of the Three Corpses,\nThe sword of wisdom sweeps away the armies of the Six Thieves.\nFrom nothing, something arises—a grain of powder,\nWithin the dung pellet, the scarab’s form.\n\nTruly, one gain becomes eternal,\nIn a fleeting moment, it may coalesce.\nSuddenly, the four great elements birth empty whiteness,\nUnknowing, the One Spirit ascends to the Great Clarity.\nEven if skillfully mercury meets lead,\nWithout knowing the firing times, all is in vain.\n\nIn general, one must rely on the celestial fire,\nOnly after ten months does the sacred embryo begin to round.\nThough the elixir’s head may form, it ultimately dissipates,\nOnly with the firing times does it solidify and endure.\nMovement and stillness, life and death—bathe them,\nFortune and misfortune, advance and retreat—value withdrawal and addition.\n\nAfter nine revolutions of ceaseless fire,\nThe medicinal substances may become the fetal immortal.\nOne hour and eight quarters make one celestial cycle,\nTwelve double-hours correspond to one year.\nFrom each yang union onward,\nRefinement proceeds until the six pure yangs.\n\nSpirit and essence come and go, knowing the tides,\nQi and blood wax and wane like the moon’s soul.\nA single hub has always had thirty spokes,\nThe wonder lies in the waxing and waning arcs.\nConcentrating qi to achieve softness is utmost benevolence,\nRitual, righteousness, wisdom, and trust fuse into benevolence.\n\nTrue earth returning to its place is utmost truth,\nWater, fire, metal, and wood all perfectly whole.\nEssence-water, spirit-fire, and intent-earth,\nRefine them so soul and spirit return to their root.\nThe primordial qi of former heaven now abides,\nScattered among the ten thousand things and the human body.\n\nFlowers bloom in spring winds, birds sing on their own,\nWho knows the Creator’s heaven as spring?\nThe common folk use it daily yet remain unaware,\nQi enters the four limbs, only to wither and fade.\nPines and bamboo, hollow-hearted, receive qi in full,\nDefying frost and snow, they stay verdant through the years.\n\nHow much more so the human primordial spirit, which never dies—\nThis qi is the yellow sprout, the lead.\nThe old may become young, the sick may grow healthy,\nThe scattered may gather, the short-lived may extend.\nThe heart enters emptiness, practicing the firing times,\nInner scenes, inner images—the heaven within the pot.\n\nKnow that each speck of dust is Penglai,\nAnd each leaf is a transcendent.\nSpirit is fire, qi is medicine,\nThe heart is the furnace, the body the field.\nCultivate, plant, and refine yourself,\nEach day, a grain like millet.\n\nThe magic mushroom’s life brings sweet dew to fall,\nTortoise and snake, through the ages, ever entwined.\nOne morning, thunder and lightning shake mountains and rivers,\nOne becomes the sun, ten thousand become smoke.\nWithin the sun, the golden crow flies,\nEvery night at the third watch, it enters the Broad Cold.\n\nChildren and grandchildren, hundreds of millions,\nFurnace, tripod, chickens, and dogs all ascend to heaven.\nThe Great Dao has thirty-two transmissions,\nPassed to Zhang Wuzhen of Tiantai.\nFour transmissions later, to Bai Yuchan,\nWhose eyes spanned the four seas, sighing for lack of people.\n\nBy chance, at the Taiping Xingguo Palace,\nAn old Daoist with white hair, surnamed Chen.\nHalf a lifetime resolved to study lead and mercury,\nWandering myriad waters and mountains in vain hardship.\nOne day, by chance at the foot of Mount Lu,\nHe waved his hand, laughing, and stepped out of the world’s dust.\n\nOn a windy, rainy night in a jade pavilion, beds side by side,\nThe elixir method was taught to restore the origin.\nWhat is a human life like? A cup of wine,\nWhat is a human life like? A lamp’s flame.\nWhere are Penglai and Fangzhang?\nI long to return on blue clouds and white cranes.\n\nJoyful, joyful—truly joyful,\nFor you, I speak these final words.\nThe final words, personally imparted,\nUniversally for all under heaven who study immortality,\nClearly pointing out the path to Penglai.",
      "overlap_context": "wn’s breeze,\nLike the old oyster holding the autumn moon.\nA single idle man between heaven and earth,\nA great laugh shakes the vastness of heaven and earth.\n\nClothing: one robe for all four seasons,\nFood: one bowl from a thousand homes.\nIn a three-house village, I play the madman,\nThrough ten-house streets, I dash wildly.\n\nOne husband, one wife, with six children,\nWhether walking or sitting, ever steadfast.\nGather and release, act freely,\nThis is the Buddha of the ten directions and three times.",
      "start_char": 3297,
      "end_char": 4513,
      "start_sentence": 189,
      "end_sentence": 258,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.62680459022522,
      "metadata": {
        "source_file": "dao\\藏外\\海琼传道集.txt",
        "category": "藏外"
      }
    }
  ]
}