{
  "source_id": "清微丹诀",
  "source_file": "chunked_daozang\\清微丹诀.json",
  "total_chunks": 4,
  "total_original_chars": 3572,
  "total_translated_chars": 20857,
  "total_translation_time": 108.46347403526306,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\众术类\\清微丹诀.txt",
    "category": "众术类"
  },
  "full_translation": "**The Qingwei Alchemical Secrets**\n\n**Text Title:** *Qingwei Alchemical Secrets*\n**Author:** Unknown\n**Volume:** One\n**Source:** *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Miscellaneous Arts* Category\n\n---\n\n### **Chapter One: The Qingwei Concealed Truth and Union with the Dao**\n\nThe three supreme medicines—spirit, qi, and essence—preserve essence to generate qi, refine qi to generate spirit. Refining the form through spirit enables one to preserve the form and abide in the world. The form is the dwelling of spirit and qi. Thus, when the body is at peace, essence is firm; when essence is firm, qi is abundant; when qi is abundant, spirit is whole; and when spirit is whole, longevity is attained.\n\nIf essence is depleted, qi is exhausted; if qi is exhausted, spirit departs; and when spirit departs, death follows. Therefore, those who attain immortality refine essence into qi, refine qi into spirit, and refine spirit to merge with the Dao—thus is the great work accomplished.\n\nIs this not the method of the Dao? Preserving the form is precisely the refinement of essence. One must sever the six senses, maintain a single thought of true purity, enter the chamber at the proper time, sit upright, and concentrate the spirit. After stilling the breath for a long while, strike the Red Dragon. Ascend to strike the seventy-two celestial dragons, whereupon the *li* fire naturally descends and the *kan* water naturally ascends, converging in the Yellow Court. Subdue the true qi, refine the yin, and evil cold sweat will emerge. After five repetitions, completing the three hundred sixty-five cycles of the celestial revolution, yang light suffuses the body, rendering it pure yang. Thus is the Dao of preserving form and qi achieved. Former calamities dissolve, and all illnesses vanish. One becomes free from hatred and desire, from excess and indulgence, and may then refine qi to merge with spirit.\n\nRefining qi requires stilling the mind and regulating the breath, abiding in primordial quiescence, guarding the spirit within the chamber. Qi enters the cinnabar field; the navel’s movement and breath continue unbroken. With both hands embracing the navel, the elixir fire warms gently. The six senses are settled and at peace; self and other are forgotten—this is the Dao of refining qi.\n\nWalk without reckless steps, speak without hasty words, and then refine spirit to merge with the Dao.\n\nRefining spirit requires entering the chamber and sitting upright. When spirit and qi are stilled, neither issuing nor entering, the mind is undivided, thoughts unattached. Seeing yet not seeing, hearing yet not hearing, qi halts and becomes breath; spirit enters and forms the embryo. In profound obscurity, the mind wanders the vast emptiness, beholding a luminous vision like a golden tangerine—neither within nor without—guarding this image. Like the moon’s light, like a mirror’s reflection, grasp and preserve it without separation. In the indistinct and subtle, it naturally expands like a chariot wheel. Form perceives spirit, spirit perceives form; form and spirit intermingle, the heart leaps with joy, and the light scatters. Like the sun and moon illuminating the void, form and spirit attain subtlety, merging with the true Dao.\n\nWhen spirit returns to the body, the true spirit becomes numinous. With a thousand days of practice, one may leave the form and ascend; with a hundred days, transcend the ordinary and enter sagehood. Without contrivance or artifice, the principle is natural.\n\n---\n\n### **Chapter Two: The Chamber Practice**\n\nThis aperture is no ordinary aperture—it is formed by the union of Heaven and Earth. Called the Cavern of Spirit and Qi, it contains the essence of *kan* and *li*. Located between the heart below and the kidneys above, to the west of the liver and left of the lungs, it is neither the intestines nor the stomach, yet qi flows freely within. This is the true aperture.\n\nThe common teaching of \"one *cun* and three *fen* below the navel\" is incorrect. The correct location is \"one *cun* and three *fen* above the navel.\" It lies behind the navel, before the kidneys, to the left of the large intestine, and right of the small intestine—a hollow space that opens when intent arrives. It is the Yellow Chamber where the essence of the Heavenly Father and the blood of the Earthly Mother coalesce to form the embryo, the Cavern of Spirit and Qi, which conceals the essence of water and fire.\n\nWithin it, to the left is the fire aperture. At all times, day and night, without fixed hours, perform three, five, or seven repetitions. Alternatively, sit cross-legged at any time, left foot above and right foot below, close the eyes, and concentrate. Focus the spirit within the primordial chaos without emergence. Drive the Red Dragon upward to strike the seventy-two heavens, whereupon true fire descends and numinous springs surge upward. Press the tongue against the upper palate, wait for the Flower Pool to fill, rinse and swallow five to seven times. Visualize a single qi merging and harmonizing, its numinous light vast and boundless.\n\nAlternatively, follow the master’s instructions to refine spirit, recite incantations, and narrate affairs—proceeding as one wishes. Detach from form and knowledge, forgetting self and other. After twenty-one days or a month of such practice, press the hands beside the aperture. If warmth like fire is felt, and movement stirs on both sides, this is the sign—what is called \"gathering as embryonic breathing, guarding as the aperture.\"\n\nWith half a year or a full year of diligent, unceasing effort, former calamities are entirely dispelled. The supreme work of the Golden Elixir and the great Dao lies in nothing beyond this.\n\n**Chapter Three: Summoning and Uniting at the Altar**\nClose the eyes and concentrate the spirit, gathering qi within the primordial chaos—neither exhaling nor inhaling, circulating the single qi seven times. With the sword mudra, refine the true writ with fire, swallow it into the ancestral palace, pass through the three barriers, and ascend into the Celestial Gate. Let the mind roam the vast sky, open the eyes and gaze straight ahead. Behold the three golden characters radiating light, illuminating heaven and earth. Issue commands, and the ten thousand perfected beings obey.\n\n**Chapter Four: Activation and Application**\nThe Thunder-Enshrouded Perfected One said: When the ears grow hot, wind arises; when the eyes emit qi, clouds form. When the abdomen trembles, thunder resounds; when sweat flows in great and small streams, rain falls. When the eyes blur, fire is born.\n\nInhaling to stillness, after a long while the spirit and breath settle. Once harmonized, wait in readiness—inner realms do not emerge, outer realms do not enter. Only perceive the body as no longer one’s own, heaven and earth as empty and vast, entering the light of samādhi.\n\nAt times, the ancestral master appears, issuing commands like thunder, the ten thousand perfected following in train. Whatever five matters the mind desires all assemble in clarity. Dispatching, then returning, gathering and refining, the subtlety lies in circulating the single qi seven times. Gazing near, see the celestial qi descending and the earthly qi ascending, steaming mountains and boiling seas, merging in the Yellow Center to ferment the five affairs. At the altar’s edge, stir the mechanism of the barriers, and the power issues forth through the apertures.\n\nWhen the ears grow hot, raise both hands with the jade writ, ascending from the waist and kidneys to the ears. A single sweep upward summons the southern wind; downward, the northern wind; forward, the eastern; and behind, the western.\n\nFor the qi of the eyes, ascend as above, gazing straight into the vast sky. Scatter the clouds and drizzle qi, ceasing when the eyes move.\n\nWhen the abdomen’s thunder stirs, employ the *ju* mudra, ascending from the waist to the ears. Lift the ears with the *ju* mudra, pressing thrice to release, sweat flowing without end. If urgency arises in great or small movements, shake the body so all apertures open, and a torrential rain pours forth.\n\nWhen the eyes blur, ascend as above, flashing left or right as the gaze shifts.\n\nThe above mechanisms operate within profound stillness—what is called \"generating being from non-being.\" One cannot act with a mind of absence, nor seek with a mind of presence. Only when daily practice is pure and mature does this arise naturally and spiritually. One knows not how it is spiritual, yet prayers and exorcisms respond as swiftly as drum to mallet. Beyond this mystery, there is no further mystery.\n\nThis treasure is not transmitted even for a thousand gold—those who obtain it, guard it well.\n\n**Seated Practice and Sleeping Method**\nThe Gate of the Mysterious Female lies between the two kidneys, called the Great Sea, also known as Weak Water. This is the Cinnabar Field: green on the left, white on the right, red above, qi below, and yellow at the center. In men, it stores essence; in women, it stores blood—this is the womb of gestation, the root of human life, the origin of the five qi.\n\nWithin dwells the divine tortoise, inhaling and exhaling primordial qi. When flowing, it becomes wind and rain; when clashing, it becomes thunder and lightning, coursing through the four limbs without fail.\n\nThe left and right kidneys are the essence of the sun and moon, the transformations of dragon and tiger. The navel is Kunlun, the great mountain, the abyss, the Five Cities. Within resides the true person, the Five Emperors. Beyond the Five Cities are the Eight Envoys, the great spirits of the eight trigrams. Together with the Great One, they form the Nine Ministers. Above are the Twelve-Storied Tower, where the twelve officers and the three *jiao* spirits dwell, totaling twenty-seven great officials. Combined with the spirits of the four limbs, they form eighty-one primordial scholars.\n\nThe Supreme Unity Perfected Person resides in the navel, presiding over the thirteen thousand divine generals within the body. The suburban altar is in the brain’s chamber atop the head; the temple is at the crown behind the neck; the altar of soil is at the left edge of the spleen; the altar of grain is at the end of the large intestine; the Earl of Wind is at the right side below the navel’s pivot; the Master of Rain is at the end of the small intestine; the Duke of Thunder is in the Great Sea at the right kidney; the Mother of Lightning is at the summit of Weak Water, above the eight gates.\n\nWithin the body are thirty-six divine palaces, each with its officials and ministers, all receiving commands from the Supreme Unity Perfected Person.\n\nWhen sleeping, one must guard the assembled body spirits, sever the Three Corpses, and examine the Six Bandits. Only then can one merge with the transformations of creation, peer into the mysteries of heaven and earth. Though heaven and earth are vast, all lies within this body.\n\nGather the body in cross-legged sitting, eyes gazing at the nose and heart, guarding the Mysterious Female. Then stabilize the spirit and form. Qi guards the spirit, the spirit guards the life force. Where intention goes, qi follows, and the spirit moves naturally. Lower the heart’s spirit with utmost sincerity. With a single exhalation, gather the body’s spirits. Gaze at the tip of the nose, then observe the ancestral palace. Stillness upon stillness, circulate the single qi seven times.\n\n**The Pearl of Supreme Transformation**\n*Verse:*\nOne method gives rise to ten thousand methods,\nTen thousand methods return to the One Void.\n\nThe Most High said: If within there is even a hair’s breadth of deviation, heaven and earth become distant realms. Achievements have levels, but attainment has no before or after—later learners, ponder this carefully. Do not treat this as easily obtained; resolve to practice it.\n\nThis method is the gateway of all methods, the pivot of the Three Caverns. One must nurture the spirit and cultivate qi, refine the body and congeal essence, banish stray thoughts, sever cravings, slay the Three Corpses, and relinquish the single qi. Let no inner thoughts arise, no outer thoughts be born. Maintain purity and simplicity, abide in correct samādhi and non-action. Only then can one proceed with reverence, preserving life and attaining longevity.\n\nFirst, raise both hands with the great *sha* mudra to the crown. Rinse the mouth once, twice, and swallow; the third rinse fills the mouth with saliva. The first two mouthfuls are thick saliva born of the five flavors, so take the third—this is the Golden Fluid Returning Elixir. Curl the tongue downward, concealing its flavor and condensing its fragrance. Close the two apertures, inwardly observe the Mud Pill Palace, and visualize the five-colored cloud qi. Then sit evenly, left hand covering the right, left foot atop the right, and meditate within.\n\nWhen one spirit is open, all spirits are open.\nWhen one aperture is open, all nine apertures are open.\nI am endowed with the two qi of yin and yang—when they emerge, they shake heaven and earth.\n\nThe *gang* spirits return to the mountains and cause their peaks to crumble; the *sha* dispels essence-demons and shatters them to dust. The essence of the method does not lie solely in talismans, nor is it confined to incantations. First, unite your upright *qi* with that of the general. The strike of the numinous method lies in the Dipper; what the Dipper governs aligns with the upright and the askew—these are the *qi* of the Four Directions, the meaning of central uprightness. The *qi-gang* is the *sha* of the Dipper; follow the celestial Dipper as it turns with the body, and the askew does likewise. Yet where do my Dipper and my *gang* reside? One must clarify one’s own *gang* and one’s own Dipper, employing the Three Harmonies—then there is nothing that does not prove efficacious, nothing that does not flow unimpeded. When condensed, the subtlety of the apertures becomes visible; when moved, the workings of the silent are known. The spirit-*qi* is clear and bright as the autumn moon. The subtlety within stillness, the mystery within the method—its silence enables knowing. The general resides in heaven; why unite with it? Simply abide within the Two Dippers and the Radiant Calm. With my spirit and *qi* interpenetrating, I unite with the general to become the general—then all illnesses vanish, and all demons submit as guests. Thus, virtue is the talisman of the Dao, and sincerity is the root of the method. The Dao without virtue is insufficient to be the Dao; the method without sincerity is unworthy of being called method. To uphold the Dao is to be upright; when the upright method transforms and spreads, following the method without partiality, the general must heed and be commanded. The method is for rectifying oneself; the Dao is for preserving oneself. If these two matters remain unblemished and the mind unwavering, even kings, dukes, and great ministers may be seated and subdued—this is why the Dao is the method.\n\nNow, when transmitting the method, ancestral masters adopt surnames of rivers and lakes, roam the world, and display their arts—yet they bear only the name without the reality. They practice the method through the Dao and also practice the method through the method. As a result, later learners remain ignorant of the method; how then can they grasp the Dao? With hearts contrary to the Dao, how can they possess the method? Heaven does not speak yet silently revolves; Earth does not speak yet brings forth life. The Dao does not speak yet encompasses all; the method does not speak yet responds with numinosity. Heaven descends with *qi*; Earth ascends with *qi*. The Dao presides over *qi*; the method transforms through *qi*. Heaven’s general is Earth’s spirit; the Dao’s talisman is the method’s seal. To enter the Dao through the method, first clarify the root of Heaven and Earth, then investigate spirit and *qi*. Employing Heaven’s silent revolution, thunder roars, rain pours, lightning flashes, spring generates, and autumn slays—endless transformations. Earth’s silent bearing yields roots, sprouts, fruits, and seedlings—growth, nourishment, and boundless sustenance. The Dao’s all-embracing nature encompasses above, Heaven; below, Earth; and in the center, humanity—nothing is left unenveloped. Only thus can one illuminate the Dao and practice the method. This requires rectifying oneself and fostering sincerity, with spirit and *qi* harmoniously surging. Therefore, the Dao is the method, and the method is the Dao.\n\nHeaven’s generals guard the law; Earth’s spirits protect the gates. The primal stars govern affairs; the numinous light endures. One may expel demons, cure illnesses, reach the Emperor, command wind and thunder with a whistle, and govern the workings of creation. Initially, there is no need for excessive elaboration—only the single word \"upright\" suffices, through which all is attained. One must not take the Dao as the gate and the method as the door, thereby creating obstacles, lest the spirit-generals turn to evil and their employment become irredeemable. Those who cultivate reality and study the Dao must take this as a warning.\n\nThe great transformations of Heaven and Earth all reside within a single aperture. If one knows this aperture, all methods become thoroughly understood. The *Central Palace Diagram of Pointing to the Mysterious* is also called the *Mysterious Pass Aperture*, or the *Gate of the Mysterious Female*. It faces the navel in front and the kidneys behind, white as silk floss, connected like a ring, one *cun* and two *fen* in breadth. The essence of the entire body gathers here, located approximately one *cun* above the navel. Draw in the water of the Celestial River, enter it into the body, and circulate the Yellow River’s water again. From the double passes of the spine, reverse the flow into the talisman, and urgently use light ink-water. Obtaining the central *qi* of Heaven and Earth, draw in one breath for every fifteen strokes, then spray it into the talisman—this becomes clouds and rain. The Black Warrior’s water and fire, the tortoise and snake, lie beneath the Black Warrior.\n\nWith reverence, align inwardly—\nthe myriad black *qi* return to the One *Qi*.\nWith righteousness, square outwardly—\nthe myriad spirits return to the One Spirit.\n\nThe *Mysterious Pass Aperture* is the primordial One *Qi*, the essence of all methods, the pivot of the Golden Elixir. In the *Lingbao* tradition, it is called the *Mysterious Pearl*; in the *Shenxiao* tradition, the *True King*; in thunder methods, the *Thunder Ancestor*; in refinement and deliverance, *Water and Fire*; in the Southern Culmen, the *Circular Light*; in the tradition of the Old Lord, the *Dharma Master*; and in talisman-water methods, the *Numinous Light*. This is the true One *Qi*, an infinitely transforming great spirit. It can subdue the demons of the Six Heavens, summon the spirits of the Nine Earths, refine and deliver the deceased to be born in Heaven, and absolve the transgressions of many lives.\n\nThis is the utmost secret of Daoist methods; it must not be lightly disclosed, for to do so invites heavenly punishment, a grave offense.\n\n**Qingwei Sitting Practice**\nWhenever entering a quiet chamber, wash the feet, sit upright, and clasp the hands firmly. Release all thoughts, settle the mind as if in the primordial chaos before the Great Ultimate divided, within the empty and round luminosity. Or, as if within the round luminosity of a single aperture, undifferentiated chaos—body and mind both absent, limpid and profound, universally illuminating the ten directions. Heaven and Earth cannot fathom it; ghosts and spirits cannot know it. Practice this in the morning and evening, always employing it.\n\n**Internal Refinement of Yin-Yang Thunder Spirits**\nIn this method, first visualize Kan and Li. Ascend from the Mud Pill Palace, emerging as the Two Dippers in union—its wonder lies therein. Kan and Li unite and emerge from the Mud Pill; the Two Dippers intersect before the neck. The heart’s fire and the kidneys’ water follow the ascent and descent; the Jade Pivot emerges on both sides. When the Two Marshals are refined, no words are needed—the Three Platforms of the Primal Beginning transform naturally. In an instant, thunderous rain pours down, and transformations endure for thousands upon thousands of years.\n\nShould incense or paper be used, talismans may also suffice. For urgent clearing of skies, write in vermilion with the brush pointed upward. To pray for clear weather in all four seasons, always employ the Kan trigram; for other matters, follow the indications of the relevant hexagram.\n\nFor Water and Fire in mutual completion, point the brush downward.\n\nHere ends the *Qingwei* Elixir Formulae.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "清微丹诀 经名：清微丹诀。 撰人不详。 一卷。 底本出处：《正统道藏》洞真部众术类。 清微丹诀 清微隐真合道章第一 上药三品，神与气精，保精生气，炼气生神。 形炼其神，则可以留形住世。 而形者，神气宅也。 是故身安者，其精固，精固则其气盈，气盈, 则其神全，神全故长生。 若乃精虚则气竭，气竭则神迁，神迁则死矣。 故不死者，炼精成气，炼气成神，炼神合道，能事毕矣。 道法云乎哉，全形者，即炼精之谓也。 须其六根断绝，一念真纯，以时入室，端坐凝神，定息良久，即鞭赤龙。 上击七十二天龙，则离火自降，坎水自升，往来结於黄庭，伏其真气，炼其阴，邪，冷汗自出。 如此五遍，合周天三百六十五之数，阳光遍体为纯阳，则全形气之道，宿殃自解，万病消除。 不憎不始，不欲不淫，然后炼气合神也。 夫炼气者，冥心定息，元寂绵绵，神室内守， 炁入丹田，脐中动息，绵绵续续，两手抱脐，丹火温温，六根定安，物我两忘，乃炼气之道。 行无狂步，言无疾声，然后炼神合道也。 夫炼神者，入室端坐，神气既息，不出不入，心无二用，一念无着，视而不见，听而．不闻， 炁住而为息，神入而成胎，昏昏默默，杳杳冥冥，意游长空，见一景物光如金橘，非内非外，守其物矣。 如月之光，如镜之影。 操之存之，初不相离，恍惚自然，大如车轮，形见其神，神见其形，形神相杂，心生踊跃，其光自散。 如日月照虚空，形神俱妙，与道合真矣。 神归体则真神自灵。 若守千日之功，离形飞升，百日之功，超凡入圣。 不枢不机，其理自然也。 入室功夫章第二 此窍非凡窍，乾坤共合成，名为神炁穴，内有坎离精，心下肾上处，肝西肺左中，非肠非胃院，一炁自流通，盖一此窍。 世传脐下一寸三分者，非也。 正对脐上一寸三分者，是也。 所谓脐之后、肾之前、大肠之左、小肠之右，其中空洞，意到即开，乃乾父之精，坤母之血，结胎之黄房也。 名为神 炁穴，中藏水火精。 其中，左有· 火窍，居常昼夜，不拘时，三五七次。 或逐时趺坐，左足上，右足下，暝目定时，凝神於混沌之中不出，运赤龙上击七十二天，则真火自降，灵泉上涌，即以舌柱上愕，俟华池水满，盥漱五七通咽下。 其中想见，一 炁混融，灵光浩荡。 或奏师炼神，持呎述事，如此随意，行持即用，离形去知，物我两忘。 如此用工三七日，或】 月，以手按窍两傍，如火之热，觉左右掷掷而动，是其验者，所谓收为胎息守为窍也。 半年一载勤而不息，宿殃悉去。 向上工夫，金丹大道，不外是矣。",
      "translated_text": "**The Qingwei Alchemical Secrets**\n\n**Text Title:** *Qingwei Alchemical Secrets*\n**Author:** Unknown\n**Volume:** One\n**Source:** *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Miscellaneous Arts* Category\n\n---\n\n### **Chapter One: The Qingwei Concealed Truth and Union with the Dao**\n\nThe three supreme medicines—spirit, qi, and essence—preserve essence to generate qi, refine qi to generate spirit. Refining the form through spirit enables one to preserve the form and abide in the world. The form is the dwelling of spirit and qi. Thus, when the body is at peace, essence is firm; when essence is firm, qi is abundant; when qi is abundant, spirit is whole; and when spirit is whole, longevity is attained.\n\nIf essence is depleted, qi is exhausted; if qi is exhausted, spirit departs; and when spirit departs, death follows. Therefore, those who attain immortality refine essence into qi, refine qi into spirit, and refine spirit to merge with the Dao—thus is the great work accomplished.\n\nIs this not the method of the Dao? Preserving the form is precisely the refinement of essence. One must sever the six senses, maintain a single thought of true purity, enter the chamber at the proper time, sit upright, and concentrate the spirit. After stilling the breath for a long while, strike the Red Dragon. Ascend to strike the seventy-two celestial dragons, whereupon the *li* fire naturally descends and the *kan* water naturally ascends, converging in the Yellow Court. Subdue the true qi, refine the yin, and evil cold sweat will emerge. After five repetitions, completing the three hundred sixty-five cycles of the celestial revolution, yang light suffuses the body, rendering it pure yang. Thus is the Dao of preserving form and qi achieved. Former calamities dissolve, and all illnesses vanish. One becomes free from hatred and desire, from excess and indulgence, and may then refine qi to merge with spirit.\n\nRefining qi requires stilling the mind and regulating the breath, abiding in primordial quiescence, guarding the spirit within the chamber. Qi enters the cinnabar field; the navel’s movement and breath continue unbroken. With both hands embracing the navel, the elixir fire warms gently. The six senses are settled and at peace; self and other are forgotten—this is the Dao of refining qi.\n\nWalk without reckless steps, speak without hasty words, and then refine spirit to merge with the Dao.\n\nRefining spirit requires entering the chamber and sitting upright. When spirit and qi are stilled, neither issuing nor entering, the mind is undivided, thoughts unattached. Seeing yet not seeing, hearing yet not hearing, qi halts and becomes breath; spirit enters and forms the embryo. In profound obscurity, the mind wanders the vast emptiness, beholding a luminous vision like a golden tangerine—neither within nor without—guarding this image. Like the moon’s light, like a mirror’s reflection, grasp and preserve it without separation. In the indistinct and subtle, it naturally expands like a chariot wheel. Form perceives spirit, spirit perceives form; form and spirit intermingle, the heart leaps with joy, and the light scatters. Like the sun and moon illuminating the void, form and spirit attain subtlety, merging with the true Dao.\n\nWhen spirit returns to the body, the true spirit becomes numinous. With a thousand days of practice, one may leave the form and ascend; with a hundred days, transcend the ordinary and enter sagehood. Without contrivance or artifice, the principle is natural.\n\n---\n\n### **Chapter Two: The Chamber Practice**\n\nThis aperture is no ordinary aperture—it is formed by the union of Heaven and Earth. Called the Cavern of Spirit and Qi, it contains the essence of *kan* and *li*. Located between the heart below and the kidneys above, to the west of the liver and left of the lungs, it is neither the intestines nor the stomach, yet qi flows freely within. This is the true aperture.\n\nThe common teaching of \"one *cun* and three *fen* below the navel\" is incorrect. The correct location is \"one *cun* and three *fen* above the navel.\" It lies behind the navel, before the kidneys, to the left of the large intestine, and right of the small intestine—a hollow space that opens when intent arrives. It is the Yellow Chamber where the essence of the Heavenly Father and the blood of the Earthly Mother coalesce to form the embryo, the Cavern of Spirit and Qi, which conceals the essence of water and fire.\n\nWithin it, to the left is the fire aperture. At all times, day and night, without fixed hours, perform three, five, or seven repetitions. Alternatively, sit cross-legged at any time, left foot above and right foot below, close the eyes, and concentrate. Focus the spirit within the primordial chaos without emergence. Drive the Red Dragon upward to strike the seventy-two heavens, whereupon true fire descends and numinous springs surge upward. Press the tongue against the upper palate, wait for the Flower Pool to fill, rinse and swallow five to seven times. Visualize a single qi merging and harmonizing, its numinous light vast and boundless.\n\nAlternatively, follow the master’s instructions to refine spirit, recite incantations, and narrate affairs—proceeding as one wishes. Detach from form and knowledge, forgetting self and other. After twenty-one days or a month of such practice, press the hands beside the aperture. If warmth like fire is felt, and movement stirs on both sides, this is the sign—what is called \"gathering as embryonic breathing, guarding as the aperture.\"\n\nWith half a year or a full year of diligent, unceasing effort, former calamities are entirely dispelled. The supreme work of the Golden Elixir and the great Dao lies in nothing beyond this.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 991,
      "start_sentence": 0,
      "end_sentence": 39,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.66240406036377,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\清微丹诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "临坛召合章第三 瞑目凝神，聚气於混沌之中，不出不入，一炁七遍。 剑诀火炼真文，咽下祖宫，过三关，升入天门，意游长空，张目直视，见三字金光进出，照天烛地，放出号令，万真禀行。 发用章第四 雷困真人曰：耳热生风，眼炁生云，腹中震动即雷呜，汗流大小皆为雨，目眩之时便火生。 入息静定，良久神息，既调直待，内境不出，外境不入，但觉身非我有、天地虚然，入定光中。 或见祖师，出令雷霆，万真随行，意欲五事，皆集丁宁，发遣、次复、收敛、运一炁七遍之妙，近视天炁下降、地炁上腾，蒸山煮海，交合混沌於黄中，酿成五事，临坛之际，拨动关捩，随窍而发也。 耳热，则双手玉文运起，从腰肾间，上升至耳，一拂而上，即南风，下北风，前东而后西也。 眼 炁，即如上运升，以目光直视长空，散云沥炁，目动而止。 腹霆动，即以局运，从腰间上升至耳，以局提提耳，三按而发，汗流不止。 或大小进急，则以身振动，窍穴俱开，大雨如注。 目眩之时，即如上运升，以目闪左则左、右则右。 已上关捩，在大静定中，所谓无中生有，不可以为无心作，不可以有心求，平日工夫纯熟，至此自然而神。 不知其所以神，祈祷芟邪，应如桴鼓，此玄之外，更无玄矣。 千金不传，得此宝之。 坐功睡法 玄牝之门，在两肾中间，名曰大海，又为弱水。 其为丹田，左青右白，上赤下炁中黄。 男以藏精，女以藏血，乃孕毓之地，为人之根本，五炁之元始也。 中有神龟，呼吸元气，流行则为风雨，激搏则为雷霆，通贯四肢，无所不至。 左右肾为日月之精华，为龙虎之变化，前脐为昆仑、为大山、为渊、为五城，中有真人，即五帝也。 五城之外有八使，即八卦大神，八使并大一为九卿，上有十二重楼，楼中十二子并三焦神，为二十七大夫，又并四肢神为八十一元士。 太一至真人居脐中，主身中一万三千神将，郊在头上脑户中，庙在项后顶上，社在脾左端，稷在大肠穷处，风伯在脐输下右傍，雨师在小肠尽处，雷公在大海右肾，电母在八门右上弱水之颠。 一身之中神宫，凡三十有六，各有官僚宰辅，皆受命於太一真人。 凡人当睡，法守之集身神，斩三尸，勘六贼，方可混合造化，窥测乾坤，天地虽大，皆在吾身中也。 敛身趺坐，目视鼻心，守玄牝，然后定精神形体。 气神气相守命神，念之所至运炁，神自然而然，降心神专至诚，一呼集身中之神，时以眼视鼻端，就观祖府，静而又静，一炁七遍。 泰珠造化 颂曰：一法生万法，万法归一无。 太上云：如於内，毫厘有差，天壤异处，功有等级，达无先后，后学详之。 勿为易得，决欲行之。 此法乃万法之关津、三洞之枢机，当颐神养炁，炼体凝精，屏杂念，绝嗜欲，斩三尸，舍一炁。 内念莫作，外念莫生，纯一守素，正定无为，方可安手顿脚，敬而行之，保命长生。 先以两手大煞运上顶，漱一口、二口咽下，第三口漱了，使津液满口，前二口乃五味所生稠唾，故取第三口，金液还丹是也。 以舌卷下，藏味凝香，二穴关闭，目内观泥丸，存五色云气，却平坐，左手覆右手，左足迭右足，存思中。 一神通，万神俱通。 一窍通，九窍齐通。 我禀阴阳二炁，出则轰天震地。",
      "translated_text": "**Chapter Three: Summoning and Uniting at the Altar**\nClose the eyes and concentrate the spirit, gathering qi within the primordial chaos—neither exhaling nor inhaling, circulating the single qi seven times. With the sword mudra, refine the true writ with fire, swallow it into the ancestral palace, pass through the three barriers, and ascend into the Celestial Gate. Let the mind roam the vast sky, open the eyes and gaze straight ahead. Behold the three golden characters radiating light, illuminating heaven and earth. Issue commands, and the ten thousand perfected beings obey.\n\n**Chapter Four: Activation and Application**\nThe Thunder-Enshrouded Perfected One said: When the ears grow hot, wind arises; when the eyes emit qi, clouds form. When the abdomen trembles, thunder resounds; when sweat flows in great and small streams, rain falls. When the eyes blur, fire is born.\n\nInhaling to stillness, after a long while the spirit and breath settle. Once harmonized, wait in readiness—inner realms do not emerge, outer realms do not enter. Only perceive the body as no longer one’s own, heaven and earth as empty and vast, entering the light of samādhi.\n\nAt times, the ancestral master appears, issuing commands like thunder, the ten thousand perfected following in train. Whatever five matters the mind desires all assemble in clarity. Dispatching, then returning, gathering and refining, the subtlety lies in circulating the single qi seven times. Gazing near, see the celestial qi descending and the earthly qi ascending, steaming mountains and boiling seas, merging in the Yellow Center to ferment the five affairs. At the altar’s edge, stir the mechanism of the barriers, and the power issues forth through the apertures.\n\nWhen the ears grow hot, raise both hands with the jade writ, ascending from the waist and kidneys to the ears. A single sweep upward summons the southern wind; downward, the northern wind; forward, the eastern; and behind, the western.\n\nFor the qi of the eyes, ascend as above, gazing straight into the vast sky. Scatter the clouds and drizzle qi, ceasing when the eyes move.\n\nWhen the abdomen’s thunder stirs, employ the *ju* mudra, ascending from the waist to the ears. Lift the ears with the *ju* mudra, pressing thrice to release, sweat flowing without end. If urgency arises in great or small movements, shake the body so all apertures open, and a torrential rain pours forth.\n\nWhen the eyes blur, ascend as above, flashing left or right as the gaze shifts.\n\nThe above mechanisms operate within profound stillness—what is called \"generating being from non-being.\" One cannot act with a mind of absence, nor seek with a mind of presence. Only when daily practice is pure and mature does this arise naturally and spiritually. One knows not how it is spiritual, yet prayers and exorcisms respond as swiftly as drum to mallet. Beyond this mystery, there is no further mystery.\n\nThis treasure is not transmitted even for a thousand gold—those who obtain it, guard it well.\n\n**Seated Practice and Sleeping Method**\nThe Gate of the Mysterious Female lies between the two kidneys, called the Great Sea, also known as Weak Water. This is the Cinnabar Field: green on the left, white on the right, red above, qi below, and yellow at the center. In men, it stores essence; in women, it stores blood—this is the womb of gestation, the root of human life, the origin of the five qi.\n\nWithin dwells the divine tortoise, inhaling and exhaling primordial qi. When flowing, it becomes wind and rain; when clashing, it becomes thunder and lightning, coursing through the four limbs without fail.\n\nThe left and right kidneys are the essence of the sun and moon, the transformations of dragon and tiger. The navel is Kunlun, the great mountain, the abyss, the Five Cities. Within resides the true person, the Five Emperors. Beyond the Five Cities are the Eight Envoys, the great spirits of the eight trigrams. Together with the Great One, they form the Nine Ministers. Above are the Twelve-Storied Tower, where the twelve officers and the three *jiao* spirits dwell, totaling twenty-seven great officials. Combined with the spirits of the four limbs, they form eighty-one primordial scholars.\n\nThe Supreme Unity Perfected Person resides in the navel, presiding over the thirteen thousand divine generals within the body. The suburban altar is in the brain’s chamber atop the head; the temple is at the crown behind the neck; the altar of soil is at the left edge of the spleen; the altar of grain is at the end of the large intestine; the Earl of Wind is at the right side below the navel’s pivot; the Master of Rain is at the end of the small intestine; the Duke of Thunder is in the Great Sea at the right kidney; the Mother of Lightning is at the summit of Weak Water, above the eight gates.\n\nWithin the body are thirty-six divine palaces, each with its officials and ministers, all receiving commands from the Supreme Unity Perfected Person.\n\nWhen sleeping, one must guard the assembled body spirits, sever the Three Corpses, and examine the Six Bandits. Only then can one merge with the transformations of creation, peer into the mysteries of heaven and earth. Though heaven and earth are vast, all lies within this body.\n\nGather the body in cross-legged sitting, eyes gazing at the nose and heart, guarding the Mysterious Female. Then stabilize the spirit and form. Qi guards the spirit, the spirit guards the life force. Where intention goes, qi follows, and the spirit moves naturally. Lower the heart’s spirit with utmost sincerity. With a single exhalation, gather the body’s spirits. Gaze at the tip of the nose, then observe the ancestral palace. Stillness upon stillness, circulate the single qi seven times.\n\n**The Pearl of Supreme Transformation**\n*Verse:*\nOne method gives rise to ten thousand methods,\nTen thousand methods return to the One Void.\n\nThe Most High said: If within there is even a hair’s breadth of deviation, heaven and earth become distant realms. Achievements have levels, but attainment has no before or after—later learners, ponder this carefully. Do not treat this as easily obtained; resolve to practice it.\n\nThis method is the gateway of all methods, the pivot of the Three Caverns. One must nurture the spirit and cultivate qi, refine the body and congeal essence, banish stray thoughts, sever cravings, slay the Three Corpses, and relinquish the single qi. Let no inner thoughts arise, no outer thoughts be born. Maintain purity and simplicity, abide in correct samādhi and non-action. Only then can one proceed with reverence, preserving life and attaining longevity.\n\nFirst, raise both hands with the great *sha* mudra to the crown. Rinse the mouth once, twice, and swallow; the third rinse fills the mouth with saliva. The first two mouthfuls are thick saliva born of the five flavors, so take the third—this is the Golden Fluid Returning Elixir. Curl the tongue downward, concealing its flavor and condensing its fragrance. Close the two apertures, inwardly observe the Mud Pill Palace, and visualize the five-colored cloud qi. Then sit evenly, left hand covering the right, left foot atop the right, and meditate within.\n\nWhen one spirit is open, all spirits are open.\nWhen one aperture is open, all nine apertures are open.\nI am endowed with the two qi of yin and yang—when they emerge, they shake heaven and earth.",
      "overlap_context": "shes. Detach from form and knowledge, forgetting self and other. After twenty-one days or a month of such practice, press the hands beside the aperture. If warmth like fire is felt, and movement stirs on both sides, this is the sign—what is called \"gathering as embryonic breathing, guarding as the aperture.\"\n\nWith half a year or a full year of diligent, unceasing effort, former calamities are entirely dispelled. The supreme work of the Golden Elixir and the great Dao lies in nothing beyond this.",
      "start_char": 992,
      "end_char": 2230,
      "start_sentence": 40,
      "end_sentence": 77,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.19073796272278,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\清微丹诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "罡 神归山岳摧崩，煞去精邪粉碎 法中之要，非专於符，非泥於咒。 先以我之正炁合将之，灵法之击在乎斗，斗之所统，参於正歪，乃四正之炁，中正之谓也。 炁罡乃斗之煞也，以天之斗随身之转，歪亦如之。 然我之斗、我之罡，在於何处。 须明我之罡、我之斗，三合用之，无不验、无不通者也。 凝则窍妙可见，动则运默可知，神炁清明朗如秋月。 静中之妙，法中之玄，其默能知，将本居天，合之何也。 但居二斗之中、定光之内，吾以神炁相贯，合将为将，则万病俱消，万邪宾伏。 故德者道之符，诚者法之本，道无德不足为道，法非诚不足言法。 守道者正，正法化行，循法无私，将必听役驱役，法乃正己也，道者守己也。 如此二事不亏，一心不易，虽王公大臣，亦可坐伏，此道之所以为法也。 今传法时，祖师所以江湖之姓，游天下，为伎能，徒有其名而无其实，皆法以道行法，亦法以法行法也。 遂使后学之人，法俱不明，何有於道，心而悖道，何有於法。 夫天不言而默运，地不言而发生，道不言而包罗，法不言而灵应，天以炁而降，地以炁而升，道以炁而为主，法以炁而化。 天之将即地之神，道之符即法之印。 入道从法，先明天地之根，次究神炁。 用天之默运，则轰雷雨电，春生秋煞，变化无穷。 地之默载，则果荄根苗，发生长养，厚载无量。 道之包罗，上而天，下而地，中而人，无所不包。 必如是，后可以明道，可以行法。 是必正己诚意，神炁冲和，故道即法也，法即道也。 天将守律，地祇卫门，元辰用事，灵光常存。 可以驱邪，可以治病，可以达帝，可以啸命风雷，可以斡旋造化。 初不必许多枝蔓，惟正一字而已，无所不达。 不可以道为门，以法为户，而生诸障，恐神将为邪，所使则无救也。 修真学道之士，审此为戒行。 天地大造化，总在一窍中，人能知此窍，万法悉皆通。 中宫指玄之图，又名玄关一窍，又名为玄牝之门。 前对脐，后对肾，其白如绵，其连如环，方广一寸二分，一身之精粹，皆聚於此，在脐上约寸。 吸天河之水，入我身中，黄河水再运，从夹脊双关倒贯入符急用淡墨水。 得天地之中炁，十五画吸一口，噀在符中，乃为云雨。 玄武水火，龟蛇在玄武下。 敬以直内，　　万黑归一炁， 义以方外。 万神归一神。 玄关一窍，乃先天一炁，此乃万法英华，金丹之枢纽，在于灵宝谓之玄珠，在于神霄谓之真王，在于雷法谓之雷祖，在于炼度谓之水火，在于南极谓之圆光，在于老君谓之法主，在于符水一谓之灵光。 此是真一之炁，变化无量大神，可降伏六天魔鬼，可追九地精灵，炼度亡灵以生天，解释多生罪咎。 此道法之至秘，不宜轻泄，即招天谴罪非轻也。 清微坐功 凡入静室，铣足端身正坐，两手握固，万绿放下，定心如在太极混沌未判之先，虚空圆光之内。 又如在圆光一窍之中，混沌一同，身心俱无，澄澄湛湛，普照十方，天地莫测，鬼神莫知。 早晚静坐亦然，常要运用。 内炼阴阳雷神 右法先存坎离，上升自泥丸宫，出成二斗混合，妙在其中矣。 坎离混合出泥丸，二斗相交照项前。 一心火肾水随升降，璇玑一出在两边。 炼得二帅不须言，元始三台变自然。 须臾雷雨霶霈降，化运千千万万年。",
      "translated_text": "The *gang* spirits return to the mountains and cause their peaks to crumble; the *sha* dispels essence-demons and shatters them to dust. The essence of the method does not lie solely in talismans, nor is it confined to incantations. First, unite your upright *qi* with that of the general. The strike of the numinous method lies in the Dipper; what the Dipper governs aligns with the upright and the askew—these are the *qi* of the Four Directions, the meaning of central uprightness. The *qi-gang* is the *sha* of the Dipper; follow the celestial Dipper as it turns with the body, and the askew does likewise. Yet where do my Dipper and my *gang* reside? One must clarify one’s own *gang* and one’s own Dipper, employing the Three Harmonies—then there is nothing that does not prove efficacious, nothing that does not flow unimpeded. When condensed, the subtlety of the apertures becomes visible; when moved, the workings of the silent are known. The spirit-*qi* is clear and bright as the autumn moon. The subtlety within stillness, the mystery within the method—its silence enables knowing. The general resides in heaven; why unite with it? Simply abide within the Two Dippers and the Radiant Calm. With my spirit and *qi* interpenetrating, I unite with the general to become the general—then all illnesses vanish, and all demons submit as guests. Thus, virtue is the talisman of the Dao, and sincerity is the root of the method. The Dao without virtue is insufficient to be the Dao; the method without sincerity is unworthy of being called method. To uphold the Dao is to be upright; when the upright method transforms and spreads, following the method without partiality, the general must heed and be commanded. The method is for rectifying oneself; the Dao is for preserving oneself. If these two matters remain unblemished and the mind unwavering, even kings, dukes, and great ministers may be seated and subdued—this is why the Dao is the method.\n\nNow, when transmitting the method, ancestral masters adopt surnames of rivers and lakes, roam the world, and display their arts—yet they bear only the name without the reality. They practice the method through the Dao and also practice the method through the method. As a result, later learners remain ignorant of the method; how then can they grasp the Dao? With hearts contrary to the Dao, how can they possess the method? Heaven does not speak yet silently revolves; Earth does not speak yet brings forth life. The Dao does not speak yet encompasses all; the method does not speak yet responds with numinosity. Heaven descends with *qi*; Earth ascends with *qi*. The Dao presides over *qi*; the method transforms through *qi*. Heaven’s general is Earth’s spirit; the Dao’s talisman is the method’s seal. To enter the Dao through the method, first clarify the root of Heaven and Earth, then investigate spirit and *qi*. Employing Heaven’s silent revolution, thunder roars, rain pours, lightning flashes, spring generates, and autumn slays—endless transformations. Earth’s silent bearing yields roots, sprouts, fruits, and seedlings—growth, nourishment, and boundless sustenance. The Dao’s all-embracing nature encompasses above, Heaven; below, Earth; and in the center, humanity—nothing is left unenveloped. Only thus can one illuminate the Dao and practice the method. This requires rectifying oneself and fostering sincerity, with spirit and *qi* harmoniously surging. Therefore, the Dao is the method, and the method is the Dao.\n\nHeaven’s generals guard the law; Earth’s spirits protect the gates. The primal stars govern affairs; the numinous light endures. One may expel demons, cure illnesses, reach the Emperor, command wind and thunder with a whistle, and govern the workings of creation. Initially, there is no need for excessive elaboration—only the single word \"upright\" suffices, through which all is attained. One must not take the Dao as the gate and the method as the door, thereby creating obstacles, lest the spirit-generals turn to evil and their employment become irredeemable. Those who cultivate reality and study the Dao must take this as a warning.\n\nThe great transformations of Heaven and Earth all reside within a single aperture. If one knows this aperture, all methods become thoroughly understood. The *Central Palace Diagram of Pointing to the Mysterious* is also called the *Mysterious Pass Aperture*, or the *Gate of the Mysterious Female*. It faces the navel in front and the kidneys behind, white as silk floss, connected like a ring, one *cun* and two *fen* in breadth. The essence of the entire body gathers here, located approximately one *cun* above the navel. Draw in the water of the Celestial River, enter it into the body, and circulate the Yellow River’s water again. From the double passes of the spine, reverse the flow into the talisman, and urgently use light ink-water. Obtaining the central *qi* of Heaven and Earth, draw in one breath for every fifteen strokes, then spray it into the talisman—this becomes clouds and rain. The Black Warrior’s water and fire, the tortoise and snake, lie beneath the Black Warrior.\n\nWith reverence, align inwardly—\nthe myriad black *qi* return to the One *Qi*.\nWith righteousness, square outwardly—\nthe myriad spirits return to the One Spirit.\n\nThe *Mysterious Pass Aperture* is the primordial One *Qi*, the essence of all methods, the pivot of the Golden Elixir. In the *Lingbao* tradition, it is called the *Mysterious Pearl*; in the *Shenxiao* tradition, the *True King*; in thunder methods, the *Thunder Ancestor*; in refinement and deliverance, *Water and Fire*; in the Southern Culmen, the *Circular Light*; in the tradition of the Old Lord, the *Dharma Master*; and in talisman-water methods, the *Numinous Light*. This is the true One *Qi*, an infinitely transforming great spirit. It can subdue the demons of the Six Heavens, summon the spirits of the Nine Earths, refine and deliver the deceased to be born in Heaven, and absolve the transgressions of many lives.\n\nThis is the utmost secret of Daoist methods; it must not be lightly disclosed, for to do so invites heavenly punishment, a grave offense.\n\n**Qingwei Sitting Practice**\nWhenever entering a quiet chamber, wash the feet, sit upright, and clasp the hands firmly. Release all thoughts, settle the mind as if in the primordial chaos before the Great Ultimate divided, within the empty and round luminosity. Or, as if within the round luminosity of a single aperture, undifferentiated chaos—body and mind both absent, limpid and profound, universally illuminating the ten directions. Heaven and Earth cannot fathom it; ghosts and spirits cannot know it. Practice this in the morning and evening, always employing it.\n\n**Internal Refinement of Yin-Yang Thunder Spirits**\nIn this method, first visualize Kan and Li. Ascend from the Mud Pill Palace, emerging as the Two Dippers in union—its wonder lies therein. Kan and Li unite and emerge from the Mud Pill; the Two Dippers intersect before the neck. The heart’s fire and the kidneys’ water follow the ascent and descent; the Jade Pivot emerges on both sides. When the Two Marshals are refined, no words are needed—the Three Platforms of the Primal Beginning transform naturally. In an instant, thunderous rain pours down, and transformations endure for thousands upon thousands of years.",
      "overlap_context": "lden Fluid Returning Elixir. Curl the tongue downward, concealing its flavor and condensing its fragrance. Close the two apertures, inwardly observe the Mud Pill Palace, and visualize the five-colored cloud qi. Then sit evenly, left hand covering the right, left foot atop the right, and meditate within.\n\nWhen one spirit is open, all spirits are open.\nWhen one aperture is open, all nine apertures are open.\nI am endowed with the two qi of yin and yang—when they emerge, they shake heaven and earth.",
      "start_char": 2231,
      "end_char": 3494,
      "start_sentence": 78,
      "end_sentence": 127,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.84249711036682,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\清微丹诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "用香亦可纸亦可符 急晴 用朱书出笔向上 祈晴四时，俱用指坎，余则随事，按卦所指。 水火既济 出笔向下 清微丹诀竟",
      "translated_text": "Should incense or paper be used, talismans may also suffice. For urgent clearing of skies, write in vermilion with the brush pointed upward. To pray for clear weather in all four seasons, always employ the Kan trigram; for other matters, follow the indications of the relevant hexagram.\n\nFor Water and Fire in mutual completion, point the brush downward.\n\nHere ends the *Qingwei* Elixir Formulae.",
      "overlap_context": "ll Palace, emerging as the Two Dippers in union—its wonder lies therein. Kan and Li unite and emerge from the Mud Pill; the Two Dippers intersect before the neck. The heart’s fire and the kidneys’ water follow the ascent and descent; the Jade Pivot emerges on both sides. When the Two Marshals are refined, no words are needed—the Three Platforms of the Primal Beginning transform naturally. In an instant, thunderous rain pours down, and transformations endure for thousands upon thousands of years.",
      "start_char": 3495,
      "end_char": 3565,
      "start_sentence": 128,
      "end_sentence": 133,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 2.7678349018096924,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\清微丹诀.txt",
        "category": "众术类"
      }
    }
  ]
}