{
  "source_id": "清微玄枢奏告仪",
  "source_file": "chunked_daozang\\清微玄枢奏告仪.json",
  "total_chunks": 8,
  "total_original_chars": 4511,
  "total_translated_chars": 32038,
  "total_translation_time": 178.1923532485962,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\威仪类\\清微玄枢奏告仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**Ritual of Memorializing the Mysterious Pivot of the Qingwei Tradition**\n\n**Title:** *Ritual of Memorializing the Mysterious Pivot of the Qingwei Tradition*\n**Author:** Unknown\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Weiyi* Category\n\n---\n\n### **Entering the Altar**\n\nBurn the *Purification Talisman* in the water vessel.\nRecite the *Heaven and Earth Incantation* and kneel to invoke:\n\nWith reverence, we acknowledge the wondrous realm of the *Mystic Capital*, where divine responsiveness arises from the sincerity of even the smallest intent. Though the numinous treasures are difficult to attain, the fragrance of non-action and purity pervades all with a single incense offering.\n\nYour humble servant [Name], trembling with awe, bows his head and prostrates himself twice to reverently address:\nThe *Celestial Emperor of the Wondrous Transformation of the Primordial Qi of Qingwei*,\nThe *Celestial Emperor of the Great Florescence of the Purple Palace of Qingwei*,\nThe *Heavenly Lord of the Supreme Beginning of Qingwei*,\nThe *August Thearch of Mysterious Heaven, Benevolent and Majestic*,\nThe *Primordial Lady of Purple Emptiness, Lofty and Pure*,\nThe *Primordial Lady of Jade Florescence, All-Pervading Wisdom*,\nThe *Supreme Minister of the Great Mystery, Orthodox Unity Perfected Lord*,\nThe *Perfected Lord of the Divine Merit of the Inner Minister of Heavenly Mechanism, Wondrous Salvation*,\nThe *Primordial Lady of the Luminous Congealing of the Golden Watchtower, Guardian of the Dao and Immortal Essence*,\nThe *Primordial Lord of the Radiant Dao of Dragon Light*,\nThe *Primordial Lady of Purple Splendor and Jade Wisdom*,\nThe *Perfected Lord of the Pure Emptiness of the Western Florescence*,\nThe *Perfected Lord Zhu of Qingcheng, All-Pervading Wisdom*,\nThe *Perfected Lord Li of Yunshan, Guardian of Unity*,\nThe *Perfected Lord Nan of Meishan, Concealed in Chaos*,\nThe *Perfected Lord Huang of Danshan, Thunder Abyss*,\nThe *Lineage Master, Perfected Lord Ye of Yunlai*,\nAnd all the great lineage masters of past and present who transmitted the Dao, bestowed teachings, and expounded the scriptures.\n\nWe humbly beseech your compassion, deign to cast your gaze upon us.\n\nNow, as the *Numinous Treasure* unfolds its radiance, the ancestral *qi* weaves its canopy over the Five Hundred Million, and the wondrous divine merit of the *Mysterious Origin* blazes forth across the Three Thousand. The Dao is supreme, and none are delivered without a master.\n\nOn this auspicious day, I, [Name], have chosen this night to memorialize the *Northern Dipper* and the *Polar Star*, beseeching deliverance from baleful stars and the bestowal of blessings to dispel calamities.\n\nWe implore you to shake the jade pendants of your girdles upon the celestial thoroughfares and descend in graceful procession. Raise the warp and weft of our Dao, and lodge within the embroidered halls of our morning devotions. The assembly of ritualists, with utmost sincerity, prepares the fast and invokes your presence.\n\nAs the fast is observed, the cloud chariots disperse, flowers are scattered, and tea is offered.\n\nAgain, your humble servant reverently addresses:\nThe *Celestial Emperor of the Wondrous Transformation of the Primordial Qi of Qingwei*,\nThe *Celestial Emperor of the Great Florescence of the Purple Palace of Qingwei*,\nThe *Heavenly Lord of the Supreme Beginning of Qingwei*,\nThe *August Thearch of Mysterious Heaven, Benevolent and Majestic*,\nThe *Primordial Lady of Purple Emptiness, Lofty and Pure*,\nThe *Primordial Lady of Jade Florescence, All-Pervading Wisdom*,\nThe *Supreme Minister of the Great Mystery, Orthodox Unity Perfected Lord*,\nThe *Perfected Lord of the Divine Merit of the Inner Minister of Heavenly Mechanism, Wondrous Salvation*,\nThe *Primordial Lady of the Luminous Congealing of the Golden Watchtower, Guardian of the Dao and Immortal Essence*,\nThe *Primordial Lord of the Radiant Dao of Dragon Light*,\nThe *Primordial Lady of Purple Splendor and Jade Wisdom*,\nThe *Perfected Lord of the Pure Emptiness of the Western Florescence*,\nThe *Perfected Lord Zhu of Qingcheng, All-Pervading Wisdom*,\nThe *Perfected Lord Li of Yunshan, Guardian of Unity*,\nThe *Perfected Lord Nan of Meishan, Concealed in Chaos*,\nThe *Perfected Lord Huang of Danshan, Thunder Abyss*,\nThe *Lineage Master, Perfected Lord Ye of Yunlai*,\nAnd all the great lineage masters of past and present who transmitted the Dao, bestowed teachings, and expounded the scriptures.\n\nWe humbly beseech your compassion, deign to cast your gaze upon us.\n\nNow, as the *Primordial Beginning* suspended the *Jeweled Pearl*, unfolding the wondrous decree of delivering humanity, and the *Venerable Lord* ascended the *Jade Bureau*, inaugurating the mysterious statutes for resolving calamities—these can preserve life and extend years, dispel disasters and deliver from misfortune.\n\nMay the transmission to the virtuous be unbroken, generation after generation, and the good affinity thus proclaimed be relied upon, life after life. May all return to the true Dao and escape the deluded ford.\n\nReflecting upon myself, I planted good roots in past lives and early embraced the true Dharma. Yet, unworthily entrusted with the duty of practice and transmission, I dare not lag in its propagation, though I remain benighted in the steps of cultivation and advancement. My apprehension runs deep; without the refining influence of your molding, how could I attain the mechanism of efficacy and trustworthiness?\n\nI, [Name], now enter the intent and receive the liturgy, performing the rites with reverence and strict adherence to the prescribed forms.\n\nGazing upon the *Polar Star*, I invoke the *qi* and burn the talisman. Arraying the star altar, I model heaven and emulate earth. Without the august presence of the lineage masters, how could this rite unfold?\n\nWe humbly implore you to dispatch generals and troops to descend upon this altar, sweeping away all defilements and impurities, and drawing near the true banners. Whether tasked with sealing decrees or providing dedicated protection, assigning offices or transmitting sincerity, may our communion be felt, and the mysterious favor thus manifested.\n\nNow, I purify my heart and dispel desires, contemplating the Dao and meditating upon the true. Relying on the upright *qi* for support and the auspicious radiance for illumination, the true fire scorches and purifies the five viscera, while the numinous wind brushes across the three fields. Transforming this mortal frame, it fuses into the wondrous form.\n\nMay the *flying *gang** be wielded with precision, the *qi* harmonized with the spirit. Recognizing the true form amidst the vast and boundless void, it appears like an image in a mirror. Seeking the original destiny within the numinous luminosity of wondrous being, it responds like an echo in a valley.\n\nMay the winds and clouds be serene, the stars and constellations resplendent. As the memorial is received, may the grace of abundant blessings descend, and our heartfelt prayers be answered through divine communion.\n\nYour humble servant, trembling with awe, bows his head and prostrates himself twice, reverently awaiting the arrival of the mandate. Thus, I speak with utmost sincerity.\n\nRecite the *Golden Light Incantation*, visualize the deities, and pace the *gang*.\nBurn the talisman to summon the generals.\n\nThe *Northern Dipper* has its generals, who assist the turning of the *jade armillary*, rewarding the good and punishing the wicked, scrutinizing transgressions and falsehoods. By the command of the *Jade Thearch*, their might guards the *Jasper Pool*. Hearing my summons, let them hasten like wind and fire to descend upon this altar, without delay.\n\nThe *General Overseer of the Unified Qi*, the *Bureau of Thunder*, burns incense and dispatches the talisman to summon:\nThe *Swift Memorializing Messenger of the Mysterious Pivot, Fang Yangzhong*,\nThe *Heavenly Lord Wang Zhi, Auxiliary of the Great Unity of the Mysterious Dipper*,\nThe *Heavenly Lord Gong Hong, Controller of the Numinous Response of the Armillary*,\nThe *Heavenly Lord Liu Qian, Guardian of the Pivot of Illustrious Origin*.\n\nMay they heed the summons and swiftly descend to the ritual altar, entrusted with our commission.\n\nClad in feathered robes and girded with the *Seven Stars*, they discern the fortunes and misfortunes of the human realm with unerring clarity.\n\nBy imperial decree, the talisman commands their descent:\nThe *Immortal Messenger Yang Ruming, Bearer of the Goat in the Dipper*,\nThe *Great Immortal Messenger Geng Miaozhen, Bearer of the Alms-Bowl in the Dipper*,\nThe *Perfected Lord, Supreme Minister of the Level Pivot*,\nThe *Attendant of the Dipper’s Mechanism*.\n\nHearing this summons, hasten to the altar, entrusted with our commission.\n\nThe spirits of the Central Heaven, the essences of the Dipper’s radiance,\nTo the left stands Ruming, to the right stands Miaozhen,\nTheir numinous power unfathomable, emerging from darkness and entering the unseen.\nWe now hasten the summons—swiftly attend the altar court.\nTo defy our command is to rebel against the imperial will.\n*Swiftly, swiftly, in accordance with the Northern Emperor’s Rescuing Summons Decree.*\n\nThe *Commander of the Unified Qi*, the *Branch Bureau of the Thunder Palace*, issues the flying talisman to hasten the summons:\nThe *Swift-Flying, Urgent Memorializing Messenger of the Dipper’s Mysterious Pivot, Marshal Fang*,\nThe *Assisting Guardian of the Mysterious Dipper, Grand Unity Heavenly Lord, Marshal Wang*,\nThe *Wandering Mechanism, Numinous Response, Commander of All Perfected, Heavenly Lord, Marshal Gong*,\nThe *Guardian of the Illustrious Origin’s Pivot, Heavenly Lord, Marshal Liu*,\nThe *Dipper’s Goat-Bearing Immortal Messenger Yang*,\nThe *Dipper’s Alms-Bowl-Bearing Great Immortal Messenger Geng*,\nThe *Supreme Minister of the Level Pivot, Perfected Lord*,\nThe *Attendant of the Dipper’s Mechanism*.\n\nEach divides their presence, transforming into qi to descend,\nInspecting the lamp altar, revealing matters with clarity,\nDisasters and fortunes made manifest, karmic responses fulfilled.\nIn prayer, we rely on the gods—\nTheir numinous power resplendent, transformations boundless,\nAchieving without action, arriving instantly at the call.\nWithin the blink of an eye or the raise of a brow, they ascend to the Nine Heavens.\nIn the turn of a head or the clap of a hand, they traverse the Three Realms.\nAll requests are answered, no wish unfulfilled.\n\nBy virtue of their current office, they are charged on this day to act on behalf of [Name],\nWho this night offers divination and petitions the Dipper’s Pole,\nPraying for the bestowal of gracious command.\nSpecifically, for [Name]’s protection and peace,\nWe humbly beseech the Dipper’s immortal messengers,\nTo bear the talismanic decree and reverently knock at the *Numinous Response Palace of the Northern Dipper’s Mechanism*,\nPetitioning:\nThe *Nine Celestial Star Lords of the Northern Dipper’s Supreme Dao*,\nThe *Nine August Ladies of the Northern Dipper*,\nThe *Multitude of Dipper-Officed Numinous Officials*,\nTo descend together upon the star altar and witness the covenant’s observance.\nMay the proclamations be relayed, and all be granted as petitioned this day.\n\nWhen the immortals are summoned, may they arrive;\nWhen the sages are invoked, may they attend.\nPresent this talisman, uniting with the luminous great heart.\n*Swiftly, swiftly, in accordance with the Primordial Descent Decree.*\n\nNow we humbly beseech the mighty power of the *Heavenly Physician of the Dipper*,\nThe *Multitude of Great Numinous Officials*,\nThe *Spirits of Disaster Relief*,\nTo convene with the *Guardians of the Worn Talismans*,\nThe *Thunder Bureau’s Officials and Generals*,\nThe *Earthly Deities’ Supreme General Wen*,\nThe *Orthodox Unity’s Wind-and-Fire Numinous Official Ma*,\nThe *Altar-Executing Marshal Zhao*,\nThe *Earth Bureau’s Grand Marshal of the Year Gu*,\nThe *Marshall Guan of the Fengdu Illuminating Numinosity*,\nThe *Fierce Marshal of the Vast Expanse Wang*,\nThe *Vice Marshals of the Various Bureaus*,\nThe *Memorializing Merit Recorders*,\nThe *Immortal Youths and Officials of Talismanic Water for Driving Away Evil and Curing Illness*,\nThe *Officials and Generals of Karmic Response in Charge of Numinous Might*,\nTo descend as one upon the lamp altar,\nTo examine the truth of matters,\nTo assist in the ritual’s execution,\nTo propagate the teachings’ power.\n\nWe further request the assembly of the *Five Blessing Gods of the Inner Court*,\nTo swiftly inspect all within [Name]’s field of existence,\nRevealing the auspices and omens of the future with clarity.\nThus may divination be precise, karmic response unerring,\nUpholding the Dipper’s numinous law above,\nFulfilling the people’s earnest pleas below.\nMay well-being serve as proof, and gracious resonance be granted.\nWe stand before the altar, awaiting the manifest response.\n*As the occasion demands, respond to the Celestial Worthies’ call.*\n*Each bows to the master, contemplating as prescribed by the method.*\n\nThe Guardians of the Numinous, Essence of the Mystic Dipper and Primordial Radiance,\nThe Three Pure Ones shine resplendent.\nThe myriad perfected open the Dao, sweeping away calamitous hordes.\nThe Eight Might Jade Talismans universally proclaim to the ten thousand spirits.\nThe Nine Celestial Guards stand ready, seizing evil and slaying demonic essences.\nExtending years without end, attaining longevity and eternal life.\nThe Luminous Youths stand guard, defending the Imperial Court.\nStarlight penetrates all darkness, divine qi suffuses the four voids.\nSevering the heads of the Six Heavens’ rebels, subduing the assembly at Mount Feng.\nBinding and dispatching to the Northern Wastes—dare any delay?\nGolden spears restrain forms, the Imperial Dao shines forth in rectitude.\nSubdued souls and spirits, in union with the Dao, attain perfection.\nThe mighty deities of the eight directions sweep away filth and dispel miasma.\nThe Seven Primes descend, jade tablets inscribe names.\nRiding the luminous chariot, ascending to the Jade Clarity.\nStrike the Dharma drum twenty-four times.\n\nThe Supreme Three Heavens, the Primordial Qi of the First Origin,\nThe Most High Five Numinous Venerable Lord,\nSummon forth from within us:\nThe Three and Five Merit Officers,\nThe Left and Right Attendant Envoys,\nThe Left and Right Incense-Bearing Dragon-Riding Couriers,\nThe Golden Lads who attend the incense,\nThe Jade Maidens who transmit words and scatter flowers,\nThe Five Thearchs’ Direct Talismans and the Incense Officials of the Day—\nEach thirty-six in number—emerge.\nEmerging, they don their solemn attire, robes and sashes adorned with pendants.\nThey report to the Mystic Altar, the Celestial Thearchs and Perfected Ones,\nThe local earth gods and territorial deities of this place.\nWe now ascend the altar to present our petition,\nReverently submitting this matter for consideration.\nAll earnest sincerity has been recorded and made known.\nMay we receive the life-generating qi of the Most High’s Ten Directions of True Perfection,\nDescending to flow into our bodies,\nThat the sincerity of our supplication swiftly reach\nThe August Jade Thearch of the Vast Heaven of the Supreme and Boundless Dao,\nThe Northern Pole Purple Tenuity Great Thearch,\nThe Nine August Star Lords of the Northern Dipper in the Celestial Presence.\nThe True Light Illuminates the Heavenly Worthy.\n\nLight the lamps and recite the incantation:\nBy the Emperor’s decree, the Dipper lamps are kindled.\nThe Seven Kings descend to succor all living beings.\nLeft Assistants and Right Supporters manifest their numinous might.\nThe Heavenly Peng Marshal commands the immortal hosts.\nThe Five Thunder Envoys, the Six Jia and Six Ding,\nThe Great Sage Dark Warrior, the Three Stars of the Terrace—\nThey cure illness, dispel misfortune, and turn death into life.\nThose who defy the decree perish; those who receive salvation live.\nMighty power descends, slaying and beheading demonic spirits.\nThe three hun return to the body; the seven po are pacified.\nA single illumination of the Dipper lamp brightens body and dwelling.\n\nBurn the True Talisman to summon the Nine August Ones.\n\nYour humble servant [Name], offering profound reverence, petitions:\nThe Great Saintly Celestial Pivot of the Northern Dipper’s Net-Pole Palace, the August Star Lord of Greedy Wolf,\nThe Northern Dipper’s Numinous Pass Palace, the Prime Minister, the August Star Lord of Giant Gate,\nThe Northern Dipper’s Purple Pole Palace, the Minister of Works, the August Star Lord of Store of Wealth,\nThe Northern Dipper’s Heaven-Ruling Palace, the Patrol General, the August Star Lord of Literary Brilliance,\nThe Northern Dipper’s Imperial Seat Palace, the Dipper Lord, the August Star Lord of Integrity and Chastity,\nThe Northern Dipper’s Supreme Honor Palace, the Grand Constancy, the August Star Lord of Military Brilliance,\nThe Northern Dipper’s Pass-Meeting Palace, the August Thearch, the August Star Lord of Ruptured Army,\nThe Jade Thearch of the Cavern Yang Palace, the August Star Lord of Outer Assistance,\nThe August Perfected of the Hidden Primordial Palace, the August Star Lord of Inner Counsel,\nThe Nine August Consorts of the Northern Dipper.\n\nWe reverently gaze upon the Dao’s compassion,\nHumbly beseeching the descent of luminous radiance upon this altar.\nScrutinize our petition, clearly reveal auspices and omens.\n\nShould the signs manifest in the flicker of lamp-light,\nOr subtly reveal themselves in the patterns of things—\nWith single-minded reverence and silence,\nMay all ten thousand prayers be fulfilled.\n\nYour servant bows twice in profound gratitude,\nHumbly welcoming the sacred presence.\nAs the cloud-borne chariot descends in truth,\nI now offer my petition once more.\nHaving already received your luminous descent,\nI bow again in deepest reverence,\nPresenting pure wine and fragrant tea in solemn offering.\nScattered blossoms, cast into the basin—\nThe talisman serves as divination,\nThe memorial is conveyed in full.\n\nYour devoted servant, [Name], in utmost sincerity,\nReverently addresses:\nThe Primordial Celestial Venerable of the Northern Dipper’s Ancestral Teacher, the Great Dao of Cavern Truth, the Original Heavenly Honored One;\nThe Mystic Teacher of the Northern Dipper, the Great Dao of Cavern Mystery, the Most High Dao Lord;\nThe Perfected Teacher of the Northern Dipper, the Great Dao of Cavern Spirit, the Most High Lord Lao;\nThe Jade August Thearch;\nThe August Thearch of the Lofty Empyrean;\nThe August Thearch of the Purple Tenuity’s Upper Palace;\nThe August Thearch of the Northern Culmen in the Purple Tenuity’s Central Palace;\nThe August Supreme Jade Thearch of the Northern Dipper;\nThe Jade Thearch of the Grand Tenuity;\nThe August Thearch of the Mystic Ministers;\nThe Imperial Lord of the Sun in the Upper Clarity’s Solar Palace;\nThe Sovereign of the Moon in the Upper Clarity’s Lunar Mansion;\nThe Patrol General, the August Star Lord of Greedy Wolf in the Northern Dipper’s Guiding Culmen Palace;\nThe Grand Minister, the August Star Lord of Great Gate in the Northern Dipper’s Numinous Pass Palace;\nThe Minister of Works, the August Star Lord of Store of Prosperity in the Northern Dipper’s Purple Culmen Palace;\nThe August Thearch, the August Star Lord of Literary Brilliance in the Northern Dipper’s Heaven-Circling Palace;\nThe Dipper Lord, the August Star Lord of Integrity and Chastity in the Northern Dipper’s Imperial Seat Palace;\nThe Grand Constancy, the August Star Lord of Military Brilliance in the Northern Dipper’s Supreme Honor Palace;\nThe August Thearch, the August Star Lord of Ruptured Army in the Northern Dipper’s Pass-Meeting Palace;\nThe Jade Thearch of Outer Assistance in the Cavern Yang Palace;\nThe August Perfected of Inner Counsel in the Hidden Primordial Palace;\nThe Nine August Consorts of the Northern Dipper, the Life-Prolonging Ladies;\nThe Great Sage of the Celestial Stem, the August Thearch of Radiant Stride, Commander of the Myriad Perfected;\nThe Three Dipper Star Lords of East, West, and Center;\nThe Three Terraces and Canopy Star Lords;\nThe Twenty-Eight Constellations of the Four Quarters;\nThe Star Lords of the Twelve Palaces;\nThe Star Lords of the Sixty Celestial Stems and Earthly Branches;\nThe Illuminating Star Lord of the Year, Month, and Day of Birth in the Upper Clarity’s Governing Light;\nThe Great and Lesser Star Lords of the Two Cycles;\nThe Great and Lesser Star Lords of the Two Limits;\nThe Star Lords of Prosperity, Horses, and the Two Treasuries;\nThe Eight Divine Generals of Embryonic Birth;\nThe True Sovereigns overseeing the Palaces of Destiny and Fortune;\nThe Three August Thearchs of the Three Origins;\nThe Three Marshals of the Northern Culmen;\nThe Perfected Lord of the Northern Culmen, the True Martial and Numinous Responsive Protector;\nThe Ancestral Celestial Master, the Supreme Minister of the Great Mystery, the Perfected Lord of Orthodox Unity;\nThe Perfected Lord of the Nine Provinces’ Immortal Historiographers;\nThe Perfected Lord of the Grand Ultimate Immortal Elder;\nThe Three Perfected Lords of Mount Canopy;\nThe Myriad Masters of the Primal Pivot of Pure Tenuity, who have expounded the teachings through the ages;\nThe Swift Memorializing Messenger of the Mystic Pivot’s Flying Courier, Marshal Fang;\nThe Supreme Minister of the Dipper’s Pivot;\nThe Attendant of the Dipper’s Mechanism;\nThe Two Immortal Envoys of the Dipper’s Lifting Ram and Rāhu;\nThe Three August Thunder Lords Deng, Xin, and Zhang;\nThe Two August Lords of the Upper Clarity’s Divine Might, Gou and Bi;\nThe Divine Officials and Multitudes of the Dipper’s Scarf Immortals under this altar’s jurisdiction;\nAnd all the assembled Perfected of the lamp altar’s descending ranks.\n\nWe reverently gaze upon the Dao’s compassion,\nPraying for the radiant mirror of your scrutiny to turn and illumine us.\n\nYour servant has heard:\nAs the Pure Tenuity governs the turning of the ages...\n\nUnfurling the upright qi throughout the Purple Tenuity,\nThe Great Ultimate unfolds its chart, illuminating the Mystic Radiance of the Northern Pivot.\nThe Canopy of Flowers reflects the depths of the Jade Enclosure,\nThe Curved Array arrays the loftiness of the Golden Gates.\nLifting and guiding the Dark and Yellow, steering the Imperial Chariot to align the Seven Governances;\nCommanding and regulating the warp and weft, grasping the Celestial Stem to establish the Five Phases.\nThe Flying Cleaver descends upon the Tortoise Chart,\nThe Radiance of Astral Strands shines upon the Phoenix Tablet.\nMajestic are your merits and virtues,\nResplendent are your numinous powers.\n\nWe humbly recall: though we planted good roots in former lives,\nAnd were born to comprehend the turning of the Dao,\nWe ascended in flight yet trod upon soul and spirit,\nFailing to unite with the Vacuous and Nonexistent.\nWe drifted and dispersed, confounding our essence and spirit,\nMired in turbid dregs.\nOur transgressions easily fill the steelyard’s scale,\nOur merits scarcely accumulate in the blade’s measure.\nBending beneath your vast compassion,\nWe are molded to the office of the Mystic Charge.\n\nYour servant, so-and-so, acting on behalf of so-and-so, having chosen this propitious day,\nTonight offers morning audience to the Dipper’s Pivot,\nSolemnly beseeching to harmonize the stellar courses for so-and-so,\nAnd pray for peace and protection.\n\nOn this occasion, reverently following the original descent,\nWe earnestly invite such-and-such a general\nTo advance and bow before the Purple Pivot’s Mystic Axis,\nHastening to present the petition of the heart,\nThat it may ascend and be heard by the Imperial Pivot.\n\nWe prostrate ourselves in hope:\nMay the Primal August One bestow illumination,\nMay the Jade Imperial One shed forth radiance.\nCommand the Five Emperors and Four Offices\nTo inscribe our good deeds upon the Azure Tablets.\nUnseal the Three Bureaus and Nine Treasuries\nTo dissolve calamities and hardships from the Mystic Registers.\nWe pray for the grace of your sheltering protection,\nTo console the anxious longing below.\n\nYour servant, with awe and trepidation,\nKowtows and bows deeply, prostrating before the altar.\nAwaiting the response of your Mystic Grace,\nWe shall prepare the written petition,\nAnd reverently proceed to proclaim and present it.\n\nProclaiming the petition, we fumigate the document and consign it to the incense burner,\nBurning it along with the accompanying talismans.\nThe talismans are to be transmitted in sequence:\nMay the August Emperor bestow favor,\nMay the Seven Perfected and Immortal Numinous Ones...\n[...] inspect the demonic camps,\n[...] descend,\nTo eternally preserve peace and tranquility.\n\nHastily, hastily, as in the statutes and ordinances!\n\nProstrating in silent audience, we perform the Three Bows in gratitude.\n\nThe officiating minister [Name], with reverent solemnity, humbly presents this petition in profound sincerity:\n\nTo the Supreme Venerables of the Dipper and Pole:\nThe Primordial Heavenly Worthy of the Great Dao of Cavernous Truth, the Most High Dao Lord of the Great Dao of Cavernous Mystery, the Most High Lord Lao of the Great Dao of Cavernous Spirit;\nThe Jade Emperor, the August Heavenly Thearch of the Dark Vault, the Heavenly Emperor of the Purple Tenuity’s Upper Palace, the Great Emperor of the Northern Culmen of the Purple Tenuity’s Central Palace, the August Emperor of the Lofty Northern Dipper, the Jade Emperor of the Grand Tenuity, the Great Emperor of the Dark Ministers;\nThe Imperial Lord of the Sun Palace of Supreme Clarity, the August Sovereign of the Moon Mansion of Supreme Clarity;\nThe Imperial Lords of the Northern Dipper’s Stellar Sovereigns: the Grand Commandant of the Net-Extending Palace, the Royal Lord of the Greedy Wolf Star; the Grand Steward of the Numinous Pass, the Royal Lord of the Gate of Ghosts Star; the Minister of Works of the Purple Tenuity Palace, the Royal Lord of the Star of Emolument; the Mobile General of the Heaven-Circulating Palace, the Royal Lord of the Literary Star; the Dipper Lord of the Imperial Seat Palace, the Royal Lord of the Upright Star; the Grand Master of Ceremonies of the August Upper Palace, the Royal Lord of the Martial Star; the Supreme Thearch of the Pass-Convening Palace, the Royal Lord of the Star of Destruction; the Imperial Lord of the Outer Assistant Star of the Cavernous Yang Palace; the Imperial Lord of the Inner Counselor Star of the Hidden Origin Palace;\nThe Nine August Consorts of the Northern Dipper, the Life-Prolonging Ladies;\nThe Heavenly Stem Great Sage, the Myriad Perfected Numinous Marshal, the Radiant Imperial Lord of Astral Effulgence;\nThe Three Dipper Star Lords of East, West, and Center;\nThe Three Terraces and Canopy Star Lords;\nThe Twenty-Eight Constellations of the Four Quarters;\nThe Star Lords of the Twelve Palaces;\nThe Star Lords of the Sixty Celestial Stems;\nThe Supreme Clarity Illuminating Star Lord of the Native Constellation governing the birth on the [specific] day of the [specific] month of the [specific] year;\nThe Greater and Lesser Cyclical Star Lords, the Greater and Lesser Limit Star Lords;\nThe Star Lords of Emolument and Steed, the Two Treasuries;\nThe Eight Divine Generals of the Sovereign’s Natal Palace;\nThe True Governors of the Constellations presiding over the Palaces of Destiny and Cyclical Limits;\nThe Three Primordials and Three Officials, the Great August Lords;\nThe Three Marshals of the Northern Culmen;\nThe Perfected Lord of the Northern Culmen, the True Martial Numinous Responsive Protector Sage;\nThe Ancestral Heavenly Master, the Supreme Minister of the Great Mystery, the Perfected Lord of the Orthodox Unity;\nThe Perfected Lord of the Grand Scribe of the Nine Provinces;\nThe Perfected Lord of the Celestial Pole Immortal;\nThe Three Perfected Lords of the Canopy Mountain;\nThe Ancient and Modern Lineage of Preaching Masters of the Dark Pivot of Pure Tenuity;\nThe Swift Memorializing Envoy of the Dark Pivot’s Flying Mechanism, Marshal Fang;\nThe Grand Minister of the Dipper’s Pivot;\nThe Attendant of the Dipper’s Mechanism;\nThe Two Immortal Envoys of the Dipper’s Center, the Lifting Ram and the Bindu;\nThe Three Great Heavenly Lords of Thunder: Deng, Xin, and Zhang;\nThe Two Great Heavenly Lords of Supreme Clarity: Gou and Bi;\nThe Multitudes of Divine and Numinous Officials of the Dipper’s Center;\nAll the Officers and Generals subordinate to this oratory;\nAnd all the Perfected Ones descending to the Lamp Altar.\n\nWe reverently beseech your Dao compassion to turn and cast your luminous gaze upon us.\n\nYour servant has heard that from the Jade Palace of the August Emperor, the morning radiance descends, and the cedar’s age unfolds in luxuriant splendor.\n\nThe Jade Secretariat of the Dark Pivot receives the celestial fragrance, and the mushroom-sealed missives flow like streams. Only through the profound resonance of stillness and response does one契 the subtle luminosity of the hidden and manifest. Moreover, the Nine August Ones suspend their images, streaming their essence downward to illumine the earthly quadrant; the Eight Trigrams take form, receiving their purest quintessence to accord with the celestial measure. Gazing upward to the encompassing model, we are ever winged; with bellows and keys, we never transgress.\n\nNow your servant, earnestly devoted to the Purple Ultimate, has purified the Flowery Hall. Arraying the majestic rites of the world’s appearances, we have prepared the protocols and methods for the audience with Heaven. To dispel calamities and cross tribulations, to entreat blessings and prolong life—yet we fear that this servant’s defiled and turbid frame has presumptuously assumed the mandate of morning cultivation. The arcane and subtle essentials remain obscure, and the method of transmission and reception is not understood. In facing the divine, we may err; in visualization and contemplation, we may falter. We humbly hope for lenient guidance for later learners and rely upon the amnesty of past transgressions.\n\nNext, we pray that the Seven Origins guard our forms and the Nine Numinous Ones bestow life. Commanding the majestic stars to withdraw, may a hundred blessings arrive in full. Directing the radiance of virtue to descend upon the threshold, may the Three Calamities dissolve and vanish.\n\nAbove, we wish for the Heavenly Origin to be serene and tranquil, the earthly order to be peaceful and secure; for the Two Luminaries to link as pearls, the Five Planets to unite as jade discs. May the seasons harmonize like the Jade Candle, laying the foundation for the state’s prosperity and great fortune. May the year be blessed with golden abundance, fulfilling the common people’s wish for whole and flourishing lives. Thus shall the great transformative compassion of the Most High Heavenly Worthy be manifest above, and below, our sincerity in surrendering our lives be answered.\n\nWe reverently submit this memorial for your hearing.\n\nResuming the vow before the incense burner:\nThe Envoys of the Incense Palace, the Left and Right Dragon-Tiger Lords, and the Attendant Numinous Officials of Incense—we, in the place where we have just performed our audience and memorial, invoke the spontaneous arising of the golden liquid and the cinnabar essence of the Elixir. May the Hundred Spirits and Multitudes of Perfected Ones gather here before this incense burner. May our cinnabar sincerity ascend to reach the divine, and may the mysterious boon descend to bestow itself.\n\nMay the jade maidens and immortal youths of the ten directions attend and convey the fragrant smoke bearing the sincerity of our just-offered memorial, swiftly reaching and directly ascending to the Most High Boundless Dao, the August Jade Emperor of the Vast Heaven, and the Great Emperor of the Purple Tenuity of the Northern Ultimate.\n\nBefore the Dao of the Great Sage of the Central Heaven, the Nine August Star Lords of the Northern Dipper, and upon the completion of the memorial rites at the Mysterious Pivot of the Qingwei Tradition.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "清微玄枢奏告仪 经名：清微玄枢奏告仪。 撰人不详。 一卷。 底本出处：《正统道藏》洞真部威义类。 清微玄枢奏告仪 入坛 焚争秽符於水盂中 念天地咒跪启 恭以玄都境妙，有神通寸诚，难达灵宝，香无为清净，一炷遍闻。 具位臣某，诚惶诚恐，稽首顿首再拜上启：祖师清微真元妙化天帝，清微紫宸大华天帝，清微太初天君，祖师玄天仁威上帝，祖师高元清真紫虚元君，祖师玉华通惠元君，祖师泰玄上相正一真君，祖师天机内相神功妙济真君，祖师金阙昭凝妙道保仙元君，祖师龙光道明元君，祖师紫英玉惠元君，祖师西华清虚真君，祖师青城通惠朱真人，云山保一李真人，眉山混隐南真人，丹山雷渊黄真人，宗师云莱叶真人，古今历代传法授道演教诸大宗师。 恭望师慈，俯垂省览。 切以灵宝开光，祖炁云罗於五亿，玄元演妙神功，日赫於三千，惟道为尊，无师不度。 以今某涓卜今宵，朝告斗极专为某顺禳星度，请福消灾。 伏望振环佩於霄衢，联翩下迈。 揭纲维於吾道，馆黻朝修。 法众运诚，修斋奉请。 修斋云舆散花献茶 臣重诚上启：祖师清微真元妙化天帝，清微紫宸大华天帝，清微太初天君，祖师玄天仁威上帝，祖师高元清真紫虚元君，祖师玉华通惠元君，祖师泰玄上相正一真君，祖师天机内相神功妙济真君，祖师金阙昭凝妙道保仙元君，祖师龙光道明元君，祖师紫英玉惠元君，祖师西华清虚真君，祖师青城通惠朱真人，云山保一李真人，眉山混隐南真人，丹山雷渊黄真人，宗师云莱叶真人，古今历代传法授道演教诸大宗师。 恭望师慈，俯垂省览。 切以元始悬宝珠，演度人之妙旨。 老君升玉局，肇解厄之玄科。 可以保命延年，可以消灾度厄。 令传善士，绳绳继继以相承。 为说良缘，世世生生而有赖。 咸归正道，遂兔迷津。 伏念臣宿植善根，早亲正法，谬领行持之职，敢后宣扬，罔明修进之阶。 惟深忧惧，匪赖陶镕之造，曷符效信之机。 臣今某，入意领词，虔恪按格，宣行以今。 瞻斗极而请炁焚符，列星坛而法天像地。 匪县宗主，曷遂开张。 伏乞差拨将兵，下临坛所，荡除氛秽，只近真斿。 或典封缄，或专翊卫，分司列职，达个通诚，庶获感孚，以昭玄贶。 臣今澄心遣欲，念道思真，赖正炁以资扶，仗祥光而照烛。 真火荡焚於五体，灵风披拂於三田。 变化凡躯，融成妙相。 庶俾飞罡激指，运炁合神。 认真形於虚无渺漠之间，如镜显相。 索本命於妙有灵明之景，似谷应声。 当愿风云澄静，星斗灿明。 奏告蒙霶霈之恩，存念遂感通之愿。 臣诚惶诚恐，稽首顿首再拜，虔祝侯命之至，谨言。 念金光咒存神步罡 焚符召将 斗枢有将，职赞瑽玑，赏善罚恶，察过言非。 玉帝有命，威镇瑶池。 闻吾呼召，风火奔驰。 降临坛所，母辄稽迟。 一炁都督，雷府分司，焚香飞符，宣召： 玄枢飞捷急奏报应使者方央中，翊辅玄斗太一天君王志，璇玑灵应总真天君龚洪，保元昭烈枢灵天君刘潜。 愿闻宣召，速降行坛，有事委请。 身披羽服，佩带七星，人间祸福，报应分明。 钦准元降，符命告召； 斗中擎羊上仙使者杨汝明，斗中陀罗大仙使者耿妙真，平枢上相真君，斗机通事舍人。 闻今召命，速赴坛场，有事委请。",
      "translated_text": "**Ritual of Memorializing the Mysterious Pivot of the Qingwei Tradition**\n\n**Title:** *Ritual of Memorializing the Mysterious Pivot of the Qingwei Tradition*\n**Author:** Unknown\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Weiyi* Category\n\n---\n\n### **Entering the Altar**\n\nBurn the *Purification Talisman* in the water vessel.\nRecite the *Heaven and Earth Incantation* and kneel to invoke:\n\nWith reverence, we acknowledge the wondrous realm of the *Mystic Capital*, where divine responsiveness arises from the sincerity of even the smallest intent. Though the numinous treasures are difficult to attain, the fragrance of non-action and purity pervades all with a single incense offering.\n\nYour humble servant [Name], trembling with awe, bows his head and prostrates himself twice to reverently address:\nThe *Celestial Emperor of the Wondrous Transformation of the Primordial Qi of Qingwei*,\nThe *Celestial Emperor of the Great Florescence of the Purple Palace of Qingwei*,\nThe *Heavenly Lord of the Supreme Beginning of Qingwei*,\nThe *August Thearch of Mysterious Heaven, Benevolent and Majestic*,\nThe *Primordial Lady of Purple Emptiness, Lofty and Pure*,\nThe *Primordial Lady of Jade Florescence, All-Pervading Wisdom*,\nThe *Supreme Minister of the Great Mystery, Orthodox Unity Perfected Lord*,\nThe *Perfected Lord of the Divine Merit of the Inner Minister of Heavenly Mechanism, Wondrous Salvation*,\nThe *Primordial Lady of the Luminous Congealing of the Golden Watchtower, Guardian of the Dao and Immortal Essence*,\nThe *Primordial Lord of the Radiant Dao of Dragon Light*,\nThe *Primordial Lady of Purple Splendor and Jade Wisdom*,\nThe *Perfected Lord of the Pure Emptiness of the Western Florescence*,\nThe *Perfected Lord Zhu of Qingcheng, All-Pervading Wisdom*,\nThe *Perfected Lord Li of Yunshan, Guardian of Unity*,\nThe *Perfected Lord Nan of Meishan, Concealed in Chaos*,\nThe *Perfected Lord Huang of Danshan, Thunder Abyss*,\nThe *Lineage Master, Perfected Lord Ye of Yunlai*,\nAnd all the great lineage masters of past and present who transmitted the Dao, bestowed teachings, and expounded the scriptures.\n\nWe humbly beseech your compassion, deign to cast your gaze upon us.\n\nNow, as the *Numinous Treasure* unfolds its radiance, the ancestral *qi* weaves its canopy over the Five Hundred Million, and the wondrous divine merit of the *Mysterious Origin* blazes forth across the Three Thousand. The Dao is supreme, and none are delivered without a master.\n\nOn this auspicious day, I, [Name], have chosen this night to memorialize the *Northern Dipper* and the *Polar Star*, beseeching deliverance from baleful stars and the bestowal of blessings to dispel calamities.\n\nWe implore you to shake the jade pendants of your girdles upon the celestial thoroughfares and descend in graceful procession. Raise the warp and weft of our Dao, and lodge within the embroidered halls of our morning devotions. The assembly of ritualists, with utmost sincerity, prepares the fast and invokes your presence.\n\nAs the fast is observed, the cloud chariots disperse, flowers are scattered, and tea is offered.\n\nAgain, your humble servant reverently addresses:\nThe *Celestial Emperor of the Wondrous Transformation of the Primordial Qi of Qingwei*,\nThe *Celestial Emperor of the Great Florescence of the Purple Palace of Qingwei*,\nThe *Heavenly Lord of the Supreme Beginning of Qingwei*,\nThe *August Thearch of Mysterious Heaven, Benevolent and Majestic*,\nThe *Primordial Lady of Purple Emptiness, Lofty and Pure*,\nThe *Primordial Lady of Jade Florescence, All-Pervading Wisdom*,\nThe *Supreme Minister of the Great Mystery, Orthodox Unity Perfected Lord*,\nThe *Perfected Lord of the Divine Merit of the Inner Minister of Heavenly Mechanism, Wondrous Salvation*,\nThe *Primordial Lady of the Luminous Congealing of the Golden Watchtower, Guardian of the Dao and Immortal Essence*,\nThe *Primordial Lord of the Radiant Dao of Dragon Light*,\nThe *Primordial Lady of Purple Splendor and Jade Wisdom*,\nThe *Perfected Lord of the Pure Emptiness of the Western Florescence*,\nThe *Perfected Lord Zhu of Qingcheng, All-Pervading Wisdom*,\nThe *Perfected Lord Li of Yunshan, Guardian of Unity*,\nThe *Perfected Lord Nan of Meishan, Concealed in Chaos*,\nThe *Perfected Lord Huang of Danshan, Thunder Abyss*,\nThe *Lineage Master, Perfected Lord Ye of Yunlai*,\nAnd all the great lineage masters of past and present who transmitted the Dao, bestowed teachings, and expounded the scriptures.\n\nWe humbly beseech your compassion, deign to cast your gaze upon us.\n\nNow, as the *Primordial Beginning* suspended the *Jeweled Pearl*, unfolding the wondrous decree of delivering humanity, and the *Venerable Lord* ascended the *Jade Bureau*, inaugurating the mysterious statutes for resolving calamities—these can preserve life and extend years, dispel disasters and deliver from misfortune.\n\nMay the transmission to the virtuous be unbroken, generation after generation, and the good affinity thus proclaimed be relied upon, life after life. May all return to the true Dao and escape the deluded ford.\n\nReflecting upon myself, I planted good roots in past lives and early embraced the true Dharma. Yet, unworthily entrusted with the duty of practice and transmission, I dare not lag in its propagation, though I remain benighted in the steps of cultivation and advancement. My apprehension runs deep; without the refining influence of your molding, how could I attain the mechanism of efficacy and trustworthiness?\n\nI, [Name], now enter the intent and receive the liturgy, performing the rites with reverence and strict adherence to the prescribed forms.\n\nGazing upon the *Polar Star*, I invoke the *qi* and burn the talisman. Arraying the star altar, I model heaven and emulate earth. Without the august presence of the lineage masters, how could this rite unfold?\n\nWe humbly implore you to dispatch generals and troops to descend upon this altar, sweeping away all defilements and impurities, and drawing near the true banners. Whether tasked with sealing decrees or providing dedicated protection, assigning offices or transmitting sincerity, may our communion be felt, and the mysterious favor thus manifested.\n\nNow, I purify my heart and dispel desires, contemplating the Dao and meditating upon the true. Relying on the upright *qi* for support and the auspicious radiance for illumination, the true fire scorches and purifies the five viscera, while the numinous wind brushes across the three fields. Transforming this mortal frame, it fuses into the wondrous form.\n\nMay the *flying *gang** be wielded with precision, the *qi* harmonized with the spirit. Recognizing the true form amidst the vast and boundless void, it appears like an image in a mirror. Seeking the original destiny within the numinous luminosity of wondrous being, it responds like an echo in a valley.\n\nMay the winds and clouds be serene, the stars and constellations resplendent. As the memorial is received, may the grace of abundant blessings descend, and our heartfelt prayers be answered through divine communion.\n\nYour humble servant, trembling with awe, bows his head and prostrates himself twice, reverently awaiting the arrival of the mandate. Thus, I speak with utmost sincerity.\n\nRecite the *Golden Light Incantation*, visualize the deities, and pace the *gang*.\nBurn the talisman to summon the generals.\n\nThe *Northern Dipper* has its generals, who assist the turning of the *jade armillary*, rewarding the good and punishing the wicked, scrutinizing transgressions and falsehoods. By the command of the *Jade Thearch*, their might guards the *Jasper Pool*. Hearing my summons, let them hasten like wind and fire to descend upon this altar, without delay.\n\nThe *General Overseer of the Unified Qi*, the *Bureau of Thunder*, burns incense and dispatches the talisman to summon:\nThe *Swift Memorializing Messenger of the Mysterious Pivot, Fang Yangzhong*,\nThe *Heavenly Lord Wang Zhi, Auxiliary of the Great Unity of the Mysterious Dipper*,\nThe *Heavenly Lord Gong Hong, Controller of the Numinous Response of the Armillary*,\nThe *Heavenly Lord Liu Qian, Guardian of the Pivot of Illustrious Origin*.\n\nMay they heed the summons and swiftly descend to the ritual altar, entrusted with our commission.\n\nClad in feathered robes and girded with the *Seven Stars*, they discern the fortunes and misfortunes of the human realm with unerring clarity.\n\nBy imperial decree, the talisman commands their descent:\nThe *Immortal Messenger Yang Ruming, Bearer of the Goat in the Dipper*,\nThe *Great Immortal Messenger Geng Miaozhen, Bearer of the Alms-Bowl in the Dipper*,\nThe *Perfected Lord, Supreme Minister of the Level Pivot*,\nThe *Attendant of the Dipper’s Mechanism*.\n\nHearing this summons, hasten to the altar, entrusted with our commission.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1241,
      "start_sentence": 0,
      "end_sentence": 54,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.19359374046326,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\清微玄枢奏告仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "天中之神，斗曜之精，左有汝明，右有妙真，神通莫测，出幽入冥。 吾今催召，速赴坛庭，有违吾令，如逆帝宸。 急急准北帝救召律令。 一炁都督，雷府分司，飞符催召： 斗中玄枢飞捷急奏报使者方元帅，翊辅玄斗太乙天君王元帅，游玑灵应总真天君龚元帅，保元昭烈枢灵天君刘元帅，斗中擎羊上仙杨使者，斗中陀罗大仙耿使者，斗枢上相真君，斗机通事舍人。 各各分身，化气下降，灯坛检察，事情昭示，祸福大彰，报应以副，祷祈惟神，灵通烜赫，变化难量，无为而成，有召立至。 瞬目扬眉之内，径达九天。 回头反掌之间，遍周三界。 所求皆应，无愿不从。 以今当职，奉为某涓卜今宵，朝告斗极，请颁恩命。 专为某祈保平安，仰烦斗中仙使，赍持，符命，敬叩北斗璇玑应灵宫。 奏请： 北斗九宸上道星君，北斗九皇夫人，斗巾诸灵官众，联降星坛，证盟修奉。 俾令关告，咸赐如言今也。 召仙仙到，请圣圣临，呈化此符，合明大心。 急急如元降律。 今就烦威力攀屈斗中天医，诸大灵官，解厄神吏。 仍烦关会本佩，雷霆诸司官将地祇上将温元帅，正一风火灵官马元帅，玄坛执法赵元帅，地司太岁股元帅，酆都朗灵关元帅，豁落猛吏王元帅，诸司副帅，传奏功曹，驱邪治病符水仙童将吏，主职威灵报应官将，一合下降灯坛，审实事理，佐助行持，阐扬教法。 仍请会同内庭五祝之神，速为照勘某身田一切，未来吉凶，详行昭示。 庶令推测有准，报应无差，上彰斗法之灵，下副众情之恳。 以康为信，愿赐感通，吾在坛前，立俟昭报。 随机赴感天尊 各礼师存念如法",
      "translated_text": "The spirits of the Central Heaven, the essences of the Dipper’s radiance,\nTo the left stands Ruming, to the right stands Miaozhen,\nTheir numinous power unfathomable, emerging from darkness and entering the unseen.\nWe now hasten the summons—swiftly attend the altar court.\nTo defy our command is to rebel against the imperial will.\n*Swiftly, swiftly, in accordance with the Northern Emperor’s Rescuing Summons Decree.*\n\nThe *Commander of the Unified Qi*, the *Branch Bureau of the Thunder Palace*, issues the flying talisman to hasten the summons:\nThe *Swift-Flying, Urgent Memorializing Messenger of the Dipper’s Mysterious Pivot, Marshal Fang*,\nThe *Assisting Guardian of the Mysterious Dipper, Grand Unity Heavenly Lord, Marshal Wang*,\nThe *Wandering Mechanism, Numinous Response, Commander of All Perfected, Heavenly Lord, Marshal Gong*,\nThe *Guardian of the Illustrious Origin’s Pivot, Heavenly Lord, Marshal Liu*,\nThe *Dipper’s Goat-Bearing Immortal Messenger Yang*,\nThe *Dipper’s Alms-Bowl-Bearing Great Immortal Messenger Geng*,\nThe *Supreme Minister of the Level Pivot, Perfected Lord*,\nThe *Attendant of the Dipper’s Mechanism*.\n\nEach divides their presence, transforming into qi to descend,\nInspecting the lamp altar, revealing matters with clarity,\nDisasters and fortunes made manifest, karmic responses fulfilled.\nIn prayer, we rely on the gods—\nTheir numinous power resplendent, transformations boundless,\nAchieving without action, arriving instantly at the call.\nWithin the blink of an eye or the raise of a brow, they ascend to the Nine Heavens.\nIn the turn of a head or the clap of a hand, they traverse the Three Realms.\nAll requests are answered, no wish unfulfilled.\n\nBy virtue of their current office, they are charged on this day to act on behalf of [Name],\nWho this night offers divination and petitions the Dipper’s Pole,\nPraying for the bestowal of gracious command.\nSpecifically, for [Name]’s protection and peace,\nWe humbly beseech the Dipper’s immortal messengers,\nTo bear the talismanic decree and reverently knock at the *Numinous Response Palace of the Northern Dipper’s Mechanism*,\nPetitioning:\nThe *Nine Celestial Star Lords of the Northern Dipper’s Supreme Dao*,\nThe *Nine August Ladies of the Northern Dipper*,\nThe *Multitude of Dipper-Officed Numinous Officials*,\nTo descend together upon the star altar and witness the covenant’s observance.\nMay the proclamations be relayed, and all be granted as petitioned this day.\n\nWhen the immortals are summoned, may they arrive;\nWhen the sages are invoked, may they attend.\nPresent this talisman, uniting with the luminous great heart.\n*Swiftly, swiftly, in accordance with the Primordial Descent Decree.*\n\nNow we humbly beseech the mighty power of the *Heavenly Physician of the Dipper*,\nThe *Multitude of Great Numinous Officials*,\nThe *Spirits of Disaster Relief*,\nTo convene with the *Guardians of the Worn Talismans*,\nThe *Thunder Bureau’s Officials and Generals*,\nThe *Earthly Deities’ Supreme General Wen*,\nThe *Orthodox Unity’s Wind-and-Fire Numinous Official Ma*,\nThe *Altar-Executing Marshal Zhao*,\nThe *Earth Bureau’s Grand Marshal of the Year Gu*,\nThe *Marshall Guan of the Fengdu Illuminating Numinosity*,\nThe *Fierce Marshal of the Vast Expanse Wang*,\nThe *Vice Marshals of the Various Bureaus*,\nThe *Memorializing Merit Recorders*,\nThe *Immortal Youths and Officials of Talismanic Water for Driving Away Evil and Curing Illness*,\nThe *Officials and Generals of Karmic Response in Charge of Numinous Might*,\nTo descend as one upon the lamp altar,\nTo examine the truth of matters,\nTo assist in the ritual’s execution,\nTo propagate the teachings’ power.\n\nWe further request the assembly of the *Five Blessing Gods of the Inner Court*,\nTo swiftly inspect all within [Name]’s field of existence,\nRevealing the auspices and omens of the future with clarity.\nThus may divination be precise, karmic response unerring,\nUpholding the Dipper’s numinous law above,\nFulfilling the people’s earnest pleas below.\nMay well-being serve as proof, and gracious resonance be granted.\nWe stand before the altar, awaiting the manifest response.\n*As the occasion demands, respond to the Celestial Worthies’ call.*\n*Each bows to the master, contemplating as prescribed by the method.*",
      "overlap_context": " with the *Seven Stars*, they discern the fortunes and misfortunes of the human realm with unerring clarity.\n\nBy imperial decree, the talisman commands their descent:\nThe *Immortal Messenger Yang Ruming, Bearer of the Goat in the Dipper*,\nThe *Great Immortal Messenger Geng Miaozhen, Bearer of the Alms-Bowl in the Dipper*,\nThe *Perfected Lord, Supreme Minister of the Level Pivot*,\nThe *Attendant of the Dipper’s Mechanism*.\n\nHearing this summons, hasten to the altar, entrusted with our commission.",
      "start_char": 1242,
      "end_char": 1865,
      "start_sentence": 55,
      "end_sentence": 77,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.033180475234985,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\清微玄枢奏告仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "卫灵 玄斗元精，三素朗明。 万真启道，扫除灾群。 八威玉策，普告万灵。 九辰备守，摄邪戮精。 延年无穷，寿得长生。 开明童子，备卫帝庭。 星光洞照，神炁四冥。 斩馘六天，制会酆山。 缚送朔单，敢有稽延。 金戈束形，皇道正明。 伏匿魂魄，与道合真。 八方威神，扫秽除氛。 七元来降，玉简刊名。 乘景飞軿，上升玉清。 呜法鼓二十四通 无上三天，始元玄三炁，太上五灵老君，当召出臣等身中：三五功曹，左右官使者，左右捧香驿龙骑吏，侍香金童，传言散花玉女，五帝直符直日香官，各三十六人出。 出者，严装显服，冠带垂缨。 关启玄坛，天帝天真，此间土地里域等神。 臣今升坛朝告，谨奏为入意，其诸忱悃，已录告闻。 愿得太上十方正真生炁，下降流入臣等身中，令臣所启之诚速达，径御。 太上无极大道昊天玉皇上帝、北极紫微大帝、北斗九皇星君御前。 真光朗照天尊 然灯念咒 上帝有敕，发点斗灯。 七王来降，救护群生。 左辅右弼，亲现威灵。 天蓬元帅，统领仙兵。 五雷使者，六甲六丁。 玄武大圣，台中三星。 治病除祸，回死作生。 违敕者死，禀救者生。 大降威力，诛斩妖精。 三魂附体，七魄安宁。 斗灯一照，身宅光明。 焚降真符降九皇 具位臣某，初谢百拜，奏请： 中天大圣北斗纲极宫太尉贪狼星皇君，北斗灵关宫上宰巨门星皇君，北斗紫极宫司空禄存星皇君，北斗运天宫游击文曲星皇君，北斗帝席宫斗君廉贞星皇君，北斗上尊宫大常武曲星皇君，北斗关会宫上帝破军星皇君，洞阳宫玉帝外辅星皇君，隐元宫帝真内弼星皇君，北斗九皇夫人。 臣等恭望道慈，特赐瑶光，降临坛所。 鉴臣关告，明示吉凶。",
      "translated_text": "The Guardians of the Numinous, Essence of the Mystic Dipper and Primordial Radiance,\nThe Three Pure Ones shine resplendent.\nThe myriad perfected open the Dao, sweeping away calamitous hordes.\nThe Eight Might Jade Talismans universally proclaim to the ten thousand spirits.\nThe Nine Celestial Guards stand ready, seizing evil and slaying demonic essences.\nExtending years without end, attaining longevity and eternal life.\nThe Luminous Youths stand guard, defending the Imperial Court.\nStarlight penetrates all darkness, divine qi suffuses the four voids.\nSevering the heads of the Six Heavens’ rebels, subduing the assembly at Mount Feng.\nBinding and dispatching to the Northern Wastes—dare any delay?\nGolden spears restrain forms, the Imperial Dao shines forth in rectitude.\nSubdued souls and spirits, in union with the Dao, attain perfection.\nThe mighty deities of the eight directions sweep away filth and dispel miasma.\nThe Seven Primes descend, jade tablets inscribe names.\nRiding the luminous chariot, ascending to the Jade Clarity.\nStrike the Dharma drum twenty-four times.\n\nThe Supreme Three Heavens, the Primordial Qi of the First Origin,\nThe Most High Five Numinous Venerable Lord,\nSummon forth from within us:\nThe Three and Five Merit Officers,\nThe Left and Right Attendant Envoys,\nThe Left and Right Incense-Bearing Dragon-Riding Couriers,\nThe Golden Lads who attend the incense,\nThe Jade Maidens who transmit words and scatter flowers,\nThe Five Thearchs’ Direct Talismans and the Incense Officials of the Day—\nEach thirty-six in number—emerge.\nEmerging, they don their solemn attire, robes and sashes adorned with pendants.\nThey report to the Mystic Altar, the Celestial Thearchs and Perfected Ones,\nThe local earth gods and territorial deities of this place.\nWe now ascend the altar to present our petition,\nReverently submitting this matter for consideration.\nAll earnest sincerity has been recorded and made known.\nMay we receive the life-generating qi of the Most High’s Ten Directions of True Perfection,\nDescending to flow into our bodies,\nThat the sincerity of our supplication swiftly reach\nThe August Jade Thearch of the Vast Heaven of the Supreme and Boundless Dao,\nThe Northern Pole Purple Tenuity Great Thearch,\nThe Nine August Star Lords of the Northern Dipper in the Celestial Presence.\nThe True Light Illuminates the Heavenly Worthy.\n\nLight the lamps and recite the incantation:\nBy the Emperor’s decree, the Dipper lamps are kindled.\nThe Seven Kings descend to succor all living beings.\nLeft Assistants and Right Supporters manifest their numinous might.\nThe Heavenly Peng Marshal commands the immortal hosts.\nThe Five Thunder Envoys, the Six Jia and Six Ding,\nThe Great Sage Dark Warrior, the Three Stars of the Terrace—\nThey cure illness, dispel misfortune, and turn death into life.\nThose who defy the decree perish; those who receive salvation live.\nMighty power descends, slaying and beheading demonic spirits.\nThe three hun return to the body; the seven po are pacified.\nA single illumination of the Dipper lamp brightens body and dwelling.\n\nBurn the True Talisman to summon the Nine August Ones.\n\nYour humble servant [Name], offering profound reverence, petitions:\nThe Great Saintly Celestial Pivot of the Northern Dipper’s Net-Pole Palace, the August Star Lord of Greedy Wolf,\nThe Northern Dipper’s Numinous Pass Palace, the Prime Minister, the August Star Lord of Giant Gate,\nThe Northern Dipper’s Purple Pole Palace, the Minister of Works, the August Star Lord of Store of Wealth,\nThe Northern Dipper’s Heaven-Ruling Palace, the Patrol General, the August Star Lord of Literary Brilliance,\nThe Northern Dipper’s Imperial Seat Palace, the Dipper Lord, the August Star Lord of Integrity and Chastity,\nThe Northern Dipper’s Supreme Honor Palace, the Grand Constancy, the August Star Lord of Military Brilliance,\nThe Northern Dipper’s Pass-Meeting Palace, the August Thearch, the August Star Lord of Ruptured Army,\nThe Jade Thearch of the Cavern Yang Palace, the August Star Lord of Outer Assistance,\nThe August Perfected of the Hidden Primordial Palace, the August Star Lord of Inner Counsel,\nThe Nine August Consorts of the Northern Dipper.\n\nWe reverently gaze upon the Dao’s compassion,\nHumbly beseeching the descent of luminous radiance upon this altar.\nScrutinize our petition, clearly reveal auspices and omens.",
      "overlap_context": "n [Name]’s field of existence,\nRevealing the auspices and omens of the future with clarity.\nThus may divination be precise, karmic response unerring,\nUpholding the Dipper’s numinous law above,\nFulfilling the people’s earnest pleas below.\nMay well-being serve as proof, and gracious resonance be granted.\nWe stand before the altar, awaiting the manifest response.\n*As the occasion demands, respond to the Celestial Worthies’ call.*\n*Each bows to the master, contemplating as prescribed by the method.*",
      "start_char": 1865,
      "end_char": 2527,
      "start_sentence": 78,
      "end_sentence": 117,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.58912229537964,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\清微玄枢奏告仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "或显证於灯光，或潜彰於物理。 一心恭默，万愿克从。 臣中谢再拜，祇迎圣驾。 云舆存真降 适伸奏请，已赐光临，再拜致恭，净酒香茶，谨伸进献。 散花投盆符作占 通章 具位臣某，谨谨虔诚，上启：斗极祖师洞真大道元始天尊，斗极玄师洞玄大道太上道君，斗极真师洞神大道太上老君，玉皇大天尊，玄穹高上帝，紫微上宫天皇大帝，紫微中宫北极大帝，北斗高上玉皇尊帝，太微玉帝，玄卿大帝，上清日宫太阳帝君，上、清月府太阴皇君，北斗纲极宫太尉贪狼星皇君，北斗灵关宫上宰巨门星皇君，北斗紫极宫司空禄存星皇君，北斗运天宫游击文曲星皇君，北斗帝席宫斗君廉贞星皇君，北斗上尊宫太常武曲星皇君，北斗关会官上帝破军星皇君，洞阳宫玉帝外辅星皇君，隐元宫帝真内弼星皇君，北斗九皇延生夫人，天罡大圣万真节度奎光帝君，东西中三斗星君，三台华盖星君，四方二十八宿星君，十二宫分星君，六十甲子星君，上清主照某年某月某日建生本命星君，大小二运星君，大小二限星君，禄马二库星君，胎生八位神将，命运限宫照临真宰，三元三官大帝君，北极三帅真君，北极镇天真武灵应佑圣真君，祖天师泰玄上相正一真君，九州都仙太史真君，太极仙翁真君，华盖山三仙真君，清微玄枢奏告古今历代演教诸大师，真斗中玄枢飞捷急奏报应使者方元帅，斗枢上相真君，斗机通事舍人，斗中擎羊陀罗二仙使者，雷霆邓、辛、张三大天君，上清神烈苟、毕二大天君，斗巾仙灵官众某靖所隶诸司官将，灯坛格降一切群真。 恭望道慈，洞回昭鉴。 臣闻清微御运，",
      "translated_text": "Should the signs manifest in the flicker of lamp-light,\nOr subtly reveal themselves in the patterns of things—\nWith single-minded reverence and silence,\nMay all ten thousand prayers be fulfilled.\n\nYour servant bows twice in profound gratitude,\nHumbly welcoming the sacred presence.\nAs the cloud-borne chariot descends in truth,\nI now offer my petition once more.\nHaving already received your luminous descent,\nI bow again in deepest reverence,\nPresenting pure wine and fragrant tea in solemn offering.\nScattered blossoms, cast into the basin—\nThe talisman serves as divination,\nThe memorial is conveyed in full.\n\nYour devoted servant, [Name], in utmost sincerity,\nReverently addresses:\nThe Primordial Celestial Venerable of the Northern Dipper’s Ancestral Teacher, the Great Dao of Cavern Truth, the Original Heavenly Honored One;\nThe Mystic Teacher of the Northern Dipper, the Great Dao of Cavern Mystery, the Most High Dao Lord;\nThe Perfected Teacher of the Northern Dipper, the Great Dao of Cavern Spirit, the Most High Lord Lao;\nThe Jade August Thearch;\nThe August Thearch of the Lofty Empyrean;\nThe August Thearch of the Purple Tenuity’s Upper Palace;\nThe August Thearch of the Northern Culmen in the Purple Tenuity’s Central Palace;\nThe August Supreme Jade Thearch of the Northern Dipper;\nThe Jade Thearch of the Grand Tenuity;\nThe August Thearch of the Mystic Ministers;\nThe Imperial Lord of the Sun in the Upper Clarity’s Solar Palace;\nThe Sovereign of the Moon in the Upper Clarity’s Lunar Mansion;\nThe Patrol General, the August Star Lord of Greedy Wolf in the Northern Dipper’s Guiding Culmen Palace;\nThe Grand Minister, the August Star Lord of Great Gate in the Northern Dipper’s Numinous Pass Palace;\nThe Minister of Works, the August Star Lord of Store of Prosperity in the Northern Dipper’s Purple Culmen Palace;\nThe August Thearch, the August Star Lord of Literary Brilliance in the Northern Dipper’s Heaven-Circling Palace;\nThe Dipper Lord, the August Star Lord of Integrity and Chastity in the Northern Dipper’s Imperial Seat Palace;\nThe Grand Constancy, the August Star Lord of Military Brilliance in the Northern Dipper’s Supreme Honor Palace;\nThe August Thearch, the August Star Lord of Ruptured Army in the Northern Dipper’s Pass-Meeting Palace;\nThe Jade Thearch of Outer Assistance in the Cavern Yang Palace;\nThe August Perfected of Inner Counsel in the Hidden Primordial Palace;\nThe Nine August Consorts of the Northern Dipper, the Life-Prolonging Ladies;\nThe Great Sage of the Celestial Stem, the August Thearch of Radiant Stride, Commander of the Myriad Perfected;\nThe Three Dipper Star Lords of East, West, and Center;\nThe Three Terraces and Canopy Star Lords;\nThe Twenty-Eight Constellations of the Four Quarters;\nThe Star Lords of the Twelve Palaces;\nThe Star Lords of the Sixty Celestial Stems and Earthly Branches;\nThe Illuminating Star Lord of the Year, Month, and Day of Birth in the Upper Clarity’s Governing Light;\nThe Great and Lesser Star Lords of the Two Cycles;\nThe Great and Lesser Star Lords of the Two Limits;\nThe Star Lords of Prosperity, Horses, and the Two Treasuries;\nThe Eight Divine Generals of Embryonic Birth;\nThe True Sovereigns overseeing the Palaces of Destiny and Fortune;\nThe Three August Thearchs of the Three Origins;\nThe Three Marshals of the Northern Culmen;\nThe Perfected Lord of the Northern Culmen, the True Martial and Numinous Responsive Protector;\nThe Ancestral Celestial Master, the Supreme Minister of the Great Mystery, the Perfected Lord of Orthodox Unity;\nThe Perfected Lord of the Nine Provinces’ Immortal Historiographers;\nThe Perfected Lord of the Grand Ultimate Immortal Elder;\nThe Three Perfected Lords of Mount Canopy;\nThe Myriad Masters of the Primal Pivot of Pure Tenuity, who have expounded the teachings through the ages;\nThe Swift Memorializing Messenger of the Mystic Pivot’s Flying Courier, Marshal Fang;\nThe Supreme Minister of the Dipper’s Pivot;\nThe Attendant of the Dipper’s Mechanism;\nThe Two Immortal Envoys of the Dipper’s Lifting Ram and Rāhu;\nThe Three August Thunder Lords Deng, Xin, and Zhang;\nThe Two August Lords of the Upper Clarity’s Divine Might, Gou and Bi;\nThe Divine Officials and Multitudes of the Dipper’s Scarf Immortals under this altar’s jurisdiction;\nAnd all the assembled Perfected of the lamp altar’s descending ranks.\n\nWe reverently gaze upon the Dao’s compassion,\nPraying for the radiant mirror of your scrutiny to turn and illumine us.\n\nYour servant has heard:\nAs the Pure Tenuity governs the turning of the ages...",
      "overlap_context": "Northern Dipper’s Pass-Meeting Palace, the August Thearch, the August Star Lord of Ruptured Army,\nThe Jade Thearch of the Cavern Yang Palace, the August Star Lord of Outer Assistance,\nThe August Perfected of the Hidden Primordial Palace, the August Star Lord of Inner Counsel,\nThe Nine August Consorts of the Northern Dipper.\n\nWe reverently gaze upon the Dao’s compassion,\nHumbly beseeching the descent of luminous radiance upon this altar.\nScrutinize our petition, clearly reveal auspices and omens.",
      "start_char": 2527,
      "end_char": 3151,
      "start_sentence": 118,
      "end_sentence": 127,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.932116508483887,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\清微玄枢奏告仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "敷正炁於紫微。 太极开图，焕灵光於北极。 华盖映玉垣之邃，勾陈罗金阙之崇。 提挈玄黄，运帝车而齐七政。 统制经纬，握天罡而建五行。 飞豁落於龟图，耀奎光於凤简。 巍巍功德，赫赫神灵。 伏念宿植善根，生达道运。 飞登而履魂魄，未契虚无。 流吹而溷精神，徒纷浊滓。 过易盈於钧石，功莫积於刀圭。 曲荷洪慈，俾陶玄职。 臣某奉为某涓卜，今宵朝告斗极，专为某顺禳星度，祈保平安。 以今恭依元降，谨请某将，进拜紫极玄枢，急告心章，上闻宸极。 伏愿元皇委照，玉宸流光。 敕五帝四司，纪善功於青简。 启三官九府，消灾难於玄编。 冀垂拥护之仁，下慰翘倾之个。 臣诚惶诚恐，稽首顿首，俯伏案前。 须待玄恩报应，具有章书，谨当宣奏。 宣章熏章就焚於香炉内 就焚随章诸符宣递符 上帝垂恩，七真仙灵。 □□□□，明检鬼营。 □□□降，永保安宁。 急急如律令。 俯伏默朝三礼 谢恩",
      "translated_text": "Unfurling the upright qi throughout the Purple Tenuity,\nThe Great Ultimate unfolds its chart, illuminating the Mystic Radiance of the Northern Pivot.\nThe Canopy of Flowers reflects the depths of the Jade Enclosure,\nThe Curved Array arrays the loftiness of the Golden Gates.\nLifting and guiding the Dark and Yellow, steering the Imperial Chariot to align the Seven Governances;\nCommanding and regulating the warp and weft, grasping the Celestial Stem to establish the Five Phases.\nThe Flying Cleaver descends upon the Tortoise Chart,\nThe Radiance of Astral Strands shines upon the Phoenix Tablet.\nMajestic are your merits and virtues,\nResplendent are your numinous powers.\n\nWe humbly recall: though we planted good roots in former lives,\nAnd were born to comprehend the turning of the Dao,\nWe ascended in flight yet trod upon soul and spirit,\nFailing to unite with the Vacuous and Nonexistent.\nWe drifted and dispersed, confounding our essence and spirit,\nMired in turbid dregs.\nOur transgressions easily fill the steelyard’s scale,\nOur merits scarcely accumulate in the blade’s measure.\nBending beneath your vast compassion,\nWe are molded to the office of the Mystic Charge.\n\nYour servant, so-and-so, acting on behalf of so-and-so, having chosen this propitious day,\nTonight offers morning audience to the Dipper’s Pivot,\nSolemnly beseeching to harmonize the stellar courses for so-and-so,\nAnd pray for peace and protection.\n\nOn this occasion, reverently following the original descent,\nWe earnestly invite such-and-such a general\nTo advance and bow before the Purple Pivot’s Mystic Axis,\nHastening to present the petition of the heart,\nThat it may ascend and be heard by the Imperial Pivot.\n\nWe prostrate ourselves in hope:\nMay the Primal August One bestow illumination,\nMay the Jade Imperial One shed forth radiance.\nCommand the Five Emperors and Four Offices\nTo inscribe our good deeds upon the Azure Tablets.\nUnseal the Three Bureaus and Nine Treasuries\nTo dissolve calamities and hardships from the Mystic Registers.\nWe pray for the grace of your sheltering protection,\nTo console the anxious longing below.\n\nYour servant, with awe and trepidation,\nKowtows and bows deeply, prostrating before the altar.\nAwaiting the response of your Mystic Grace,\nWe shall prepare the written petition,\nAnd reverently proceed to proclaim and present it.\n\nProclaiming the petition, we fumigate the document and consign it to the incense burner,\nBurning it along with the accompanying talismans.\nThe talismans are to be transmitted in sequence:\nMay the August Emperor bestow favor,\nMay the Seven Perfected and Immortal Numinous Ones...\n[...] inspect the demonic camps,\n[...] descend,\nTo eternally preserve peace and tranquility.\n\nHastily, hastily, as in the statutes and ordinances!\n\nProstrating in silent audience, we perform the Three Bows in gratitude.",
      "overlap_context": " Rāhu;\nThe Three August Thunder Lords Deng, Xin, and Zhang;\nThe Two August Lords of the Upper Clarity’s Divine Might, Gou and Bi;\nThe Divine Officials and Multitudes of the Dipper’s Scarf Immortals under this altar’s jurisdiction;\nAnd all the assembled Perfected of the lamp altar’s descending ranks.\n\nWe reverently gaze upon the Dao’s compassion,\nPraying for the radiant mirror of your scrutiny to turn and illumine us.\n\nYour servant has heard:\nAs the Pure Tenuity governs the turning of the ages...",
      "start_char": 3151,
      "end_char": 3519,
      "start_sentence": 128,
      "end_sentence": 155,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.92124104499817,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\清微玄枢奏告仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "焚谢恩符具位臣某，谨重诚上启： 斗极祖师洞真大道元始天尊，斗极玄师洞玄大道太上道君，斗极真师洞神大道太上老君，玉皇大天尊，玄穹高上帝，紫微上宫天皇大帝，紫微中宫北极大帝，北斗高上玉皇尊帝，太微玉帝，玄卿大帝，上清日宫太阳帝君，上清月府太阴皇君，北斗纲极宫太尉贪狼星皇君，北斗灵关上宰巨门星皇君，北斗紫微宫司空禄存星皇君，北斗运天官游击文曲星皇君，北斗帝席宫斗君廉贞星皇君，北帝上尊宫太常武曲星皇君，北斗关会宫上帝破军星皇君，洞阳宫玉帝外辅星皇君，隐元宫帝真内弼星皇君，北斗九皇延生夫人，天罡大圣万真节度奎光帝君，东西中三斗星君，三台华盖星君，四方二十八宿星君，十二宫分星君，六十甲子星君，上清主照某年某月某日建生本命星君，大小二运星君，大小二限星君，禄马二库星，君胎生八位神将，命运限宫照临真宰，三元三官大帝君，北极三帅真君，北极镇天真武灵应佑圣真君，祖天师泰玄上相正一真君，九州都仙太史真君，太极仙翁真君，华盖山三仙真君，清微玄枢奏告古今历代演教诸大师，真斗中玄枢飞捷急奏报应使者方元帅，斗枢上相真君，斗机通事舍人，斗中擎羊陀罗二仙使者，雷霆邓、辛、张、三大天君，上清神烈苟、毕二大天君，斗中仙灵官众，某靖所隶诸司官将，灯坛格降一切群真。 恭望道慈，洞回昭鉴。 臣闻尊帝琼宫，降晨华而椿龄衍茂。",
      "translated_text": "The officiating minister [Name], with reverent solemnity, humbly presents this petition in profound sincerity:\n\nTo the Supreme Venerables of the Dipper and Pole:\nThe Primordial Heavenly Worthy of the Great Dao of Cavernous Truth, the Most High Dao Lord of the Great Dao of Cavernous Mystery, the Most High Lord Lao of the Great Dao of Cavernous Spirit;\nThe Jade Emperor, the August Heavenly Thearch of the Dark Vault, the Heavenly Emperor of the Purple Tenuity’s Upper Palace, the Great Emperor of the Northern Culmen of the Purple Tenuity’s Central Palace, the August Emperor of the Lofty Northern Dipper, the Jade Emperor of the Grand Tenuity, the Great Emperor of the Dark Ministers;\nThe Imperial Lord of the Sun Palace of Supreme Clarity, the August Sovereign of the Moon Mansion of Supreme Clarity;\nThe Imperial Lords of the Northern Dipper’s Stellar Sovereigns: the Grand Commandant of the Net-Extending Palace, the Royal Lord of the Greedy Wolf Star; the Grand Steward of the Numinous Pass, the Royal Lord of the Gate of Ghosts Star; the Minister of Works of the Purple Tenuity Palace, the Royal Lord of the Star of Emolument; the Mobile General of the Heaven-Circulating Palace, the Royal Lord of the Literary Star; the Dipper Lord of the Imperial Seat Palace, the Royal Lord of the Upright Star; the Grand Master of Ceremonies of the August Upper Palace, the Royal Lord of the Martial Star; the Supreme Thearch of the Pass-Convening Palace, the Royal Lord of the Star of Destruction; the Imperial Lord of the Outer Assistant Star of the Cavernous Yang Palace; the Imperial Lord of the Inner Counselor Star of the Hidden Origin Palace;\nThe Nine August Consorts of the Northern Dipper, the Life-Prolonging Ladies;\nThe Heavenly Stem Great Sage, the Myriad Perfected Numinous Marshal, the Radiant Imperial Lord of Astral Effulgence;\nThe Three Dipper Star Lords of East, West, and Center;\nThe Three Terraces and Canopy Star Lords;\nThe Twenty-Eight Constellations of the Four Quarters;\nThe Star Lords of the Twelve Palaces;\nThe Star Lords of the Sixty Celestial Stems;\nThe Supreme Clarity Illuminating Star Lord of the Native Constellation governing the birth on the [specific] day of the [specific] month of the [specific] year;\nThe Greater and Lesser Cyclical Star Lords, the Greater and Lesser Limit Star Lords;\nThe Star Lords of Emolument and Steed, the Two Treasuries;\nThe Eight Divine Generals of the Sovereign’s Natal Palace;\nThe True Governors of the Constellations presiding over the Palaces of Destiny and Cyclical Limits;\nThe Three Primordials and Three Officials, the Great August Lords;\nThe Three Marshals of the Northern Culmen;\nThe Perfected Lord of the Northern Culmen, the True Martial Numinous Responsive Protector Sage;\nThe Ancestral Heavenly Master, the Supreme Minister of the Great Mystery, the Perfected Lord of the Orthodox Unity;\nThe Perfected Lord of the Grand Scribe of the Nine Provinces;\nThe Perfected Lord of the Celestial Pole Immortal;\nThe Three Perfected Lords of the Canopy Mountain;\nThe Ancient and Modern Lineage of Preaching Masters of the Dark Pivot of Pure Tenuity;\nThe Swift Memorializing Envoy of the Dark Pivot’s Flying Mechanism, Marshal Fang;\nThe Grand Minister of the Dipper’s Pivot;\nThe Attendant of the Dipper’s Mechanism;\nThe Two Immortal Envoys of the Dipper’s Center, the Lifting Ram and the Bindu;\nThe Three Great Heavenly Lords of Thunder: Deng, Xin, and Zhang;\nThe Two Great Heavenly Lords of Supreme Clarity: Gou and Bi;\nThe Multitudes of Divine and Numinous Officials of the Dipper’s Center;\nAll the Officers and Generals subordinate to this oratory;\nAnd all the Perfected Ones descending to the Lamp Altar.\n\nWe reverently beseech your Dao compassion to turn and cast your luminous gaze upon us.\n\nYour servant has heard that from the Jade Palace of the August Emperor, the morning radiance descends, and the cedar’s age unfolds in luxuriant splendor.",
      "overlap_context": "\n\nProclaiming the petition, we fumigate the document and consign it to the incense burner,\nBurning it along with the accompanying talismans.\nThe talismans are to be transmitted in sequence:\nMay the August Emperor bestow favor,\nMay the Seven Perfected and Immortal Numinous Ones...\n[...] inspect the demonic camps,\n[...] descend,\nTo eternally preserve peace and tranquility.\n\nHastily, hastily, as in the statutes and ordinances!\n\nProstrating in silent audience, we perform the Three Bows in gratitude.",
      "start_char": 3519,
      "end_char": 4069,
      "start_sentence": 156,
      "end_sentence": 159,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.778366088867188,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\清微玄枢奏告仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "玄枢玉省，承天芳而芝检飞流。 惟通寂感之玄，斯契潜昭之妙。 况九皇垂象，流精下映於坤维，而八卦成形，禀粹上符於乾度。 仰范围而有翼，每橐钥以无违。 今某翘勤紫极，清净华堂。 罗象世之威仪，备朝天之科法。 消灾度厄，请福延生。 尚虑臣华秽浊躯，滥领朝修之命。 玄微奥旨，罔明授受之方。 对越乖违，存思谬误，冀曲提於后学，赖肆赦於前非。 次愿七元守形，九灵锡命。 勒威星而退舍，百福来臻。 敕德曜以临几，三灾消落。 上愿天元澄晏，地纪安宁，二曜连珠，五星合璧。 时调玉烛，邦家隆泰运之基。 岁庆金穰，黎庶遂全生之愿。 则上明天尊大慈之化，下副臣等归命之诚。 谨启以闻。 发愿复炉 香宫使者，左右龙虎君，侍香诸灵官，臣等向来朝告之所，自然生金液丹碧之英，百灵众真交会在此香火炉前，当愿丹诚上格，玄贶下敷。 十方仙童玉女接侍，兰烟传臣向来所奏之诚，速达径诣 太上无极大道昊天玉皇上帝、 北极紫微大帝",
      "translated_text": "The Jade Secretariat of the Dark Pivot receives the celestial fragrance, and the mushroom-sealed missives flow like streams. Only through the profound resonance of stillness and response does one契 the subtle luminosity of the hidden and manifest. Moreover, the Nine August Ones suspend their images, streaming their essence downward to illumine the earthly quadrant; the Eight Trigrams take form, receiving their purest quintessence to accord with the celestial measure. Gazing upward to the encompassing model, we are ever winged; with bellows and keys, we never transgress.\n\nNow your servant, earnestly devoted to the Purple Ultimate, has purified the Flowery Hall. Arraying the majestic rites of the world’s appearances, we have prepared the protocols and methods for the audience with Heaven. To dispel calamities and cross tribulations, to entreat blessings and prolong life—yet we fear that this servant’s defiled and turbid frame has presumptuously assumed the mandate of morning cultivation. The arcane and subtle essentials remain obscure, and the method of transmission and reception is not understood. In facing the divine, we may err; in visualization and contemplation, we may falter. We humbly hope for lenient guidance for later learners and rely upon the amnesty of past transgressions.\n\nNext, we pray that the Seven Origins guard our forms and the Nine Numinous Ones bestow life. Commanding the majestic stars to withdraw, may a hundred blessings arrive in full. Directing the radiance of virtue to descend upon the threshold, may the Three Calamities dissolve and vanish.\n\nAbove, we wish for the Heavenly Origin to be serene and tranquil, the earthly order to be peaceful and secure; for the Two Luminaries to link as pearls, the Five Planets to unite as jade discs. May the seasons harmonize like the Jade Candle, laying the foundation for the state’s prosperity and great fortune. May the year be blessed with golden abundance, fulfilling the common people’s wish for whole and flourishing lives. Thus shall the great transformative compassion of the Most High Heavenly Worthy be manifest above, and below, our sincerity in surrendering our lives be answered.\n\nWe reverently submit this memorial for your hearing.\n\nResuming the vow before the incense burner:\nThe Envoys of the Incense Palace, the Left and Right Dragon-Tiger Lords, and the Attendant Numinous Officials of Incense—we, in the place where we have just performed our audience and memorial, invoke the spontaneous arising of the golden liquid and the cinnabar essence of the Elixir. May the Hundred Spirits and Multitudes of Perfected Ones gather here before this incense burner. May our cinnabar sincerity ascend to reach the divine, and may the mysterious boon descend to bestow itself.\n\nMay the jade maidens and immortal youths of the ten directions attend and convey the fragrant smoke bearing the sincerity of our just-offered memorial, swiftly reaching and directly ascending to the Most High Boundless Dao, the August Jade Emperor of the Vast Heaven, and the Great Emperor of the Purple Tenuity of the Northern Ultimate.",
      "overlap_context": "d Zhang;\nThe Two Great Heavenly Lords of Supreme Clarity: Gou and Bi;\nThe Multitudes of Divine and Numinous Officials of the Dipper’s Center;\nAll the Officers and Generals subordinate to this oratory;\nAnd all the Perfected Ones descending to the Lamp Altar.\n\nWe reverently beseech your Dao compassion to turn and cast your luminous gaze upon us.\n\nYour servant has heard that from the Jade Palace of the August Emperor, the morning radiance descends, and the cedar’s age unfolds in luxuriant splendor.",
      "start_char": 4069,
      "end_char": 4455,
      "start_sentence": 160,
      "end_sentence": 182,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.085587978363037,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\清微玄枢奏告仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "中天大圣北斗九皇星君道前。 清微玄枢奏告仪竟",
      "translated_text": "Before the Dao of the Great Sage of the Central Heaven, the Nine August Star Lords of the Northern Dipper, and upon the completion of the memorial rites at the Mysterious Pivot of the Qingwei Tradition.",
      "overlap_context": "rfected Ones gather here before this incense burner. May our cinnabar sincerity ascend to reach the divine, and may the mysterious boon descend to bestow itself.\n\nMay the jade maidens and immortal youths of the ten directions attend and convey the fragrant smoke bearing the sincerity of our just-offered memorial, swiftly reaching and directly ascending to the Most High Boundless Dao, the August Jade Emperor of the Vast Heaven, and the Great Emperor of the Purple Tenuity of the Northern Ultimate.",
      "start_char": 4455,
      "end_char": 4484,
      "start_sentence": 183,
      "end_sentence": 184,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 1.6591451168060303,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\清微玄枢奏告仪.txt",
        "category": "威仪类"
      }
    }
  ]
}