{
  "source_id": "清河内传",
  "source_file": "chunked_daozang\\清河内传.json",
  "total_chunks": 8,
  "total_original_chars": 6791,
  "total_translated_chars": 44375,
  "total_translation_time": 231.20910048484802,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\谱箓类\\清河内传.txt",
    "category": "谱箓类"
  },
  "full_translation": "**The Inner Transmission of Qinghe**\n\n**Title:** *The Inner Transmission of Qinghe*. The author is unknown, likely dating to the Ming dynasty. It falsely attributes its narrative to Wenchang Dijun, recounting his family lineage and life, with appended records of Song and Yuan imperial decrees conferring sacred titles upon Wenchang and accounts of his temples. One fascicle.\n\n**Source:** *Zhengtong Daoist Canon*, *Dongzhen* Section, Registers and Records Category.\n\n---\n\n**The Inner Transmission of Qinghe**\n\nI was originally a man of Wu and Kuaiji, born in the early Zhou dynasty. After seventy-three transformations, I repeatedly took the form of scholar-officials, never oppressing the people or tyrannizing as an official. My nature was stern and my conduct scrutinous—unyielding as autumn frost or the noonday sun.\n\nLater, at the end of the Western Jin, I was reborn between the two commanderies west of Yue and south of Jun. In the dingwei year, on the third day of the second month (jiazi, xinhai), I was born. Auspicious light filled the household, and yellow clouds veiled the fields. My dwelling lay near the sea, and the villagers called me the Old Man of Qinghe, saying, \"At sixty, you have been blessed with a noble heir.\"\n\nIn childhood, I disliked play and often longed for mountains and marshes. My speech was often cryptic, as if concealing and revealing truths. I recited books voraciously, and at night, I would avoid other children, laughing and rejoicing alone, my body radiating light. When the villagers came to pray, I would scoff and mock them, crying out, \"If mere clay and wood can clothe and feed men, receiving offerings and answering prayers, or inviting slander and misfortune, how can I, a man, lack spirit?\"\n\nThereafter, I dreamed strange dreams at night—sometimes as a dragon, sometimes as a king. Heavenly omens appeared, and I was appointed as the Water Bureau’s Transport Commissioner. Though I found it strange, I did not fully believe it, deeming it a good omen.\n\nLater, when the three harvests failed due to drought and no rain came to revive the land, the people performed the *wuyu* dance and prayed to the gods, but to no avail. I thought, \"The dream of governing the Water Bureau must now come to pass.\" That night, I went to the water’s edge and, using the official title from my dream, presented a document to the River Earl. I was terrified and hesitant, but suddenly, clouds gathered, wind and thunder roared, and an official prostrated before me, asking, \"Has the Transport Commissioner moved residence?\"\n\nI replied, \"It is not I. I am the son of Zhang the Elder, named Ya. Later, through the Water Bureau, I gained recognition, so I style myself Peifu.\"\n\nThe official said, \"I am here by command to summon you.\"\n\nI asked, \"What of my family?\"\n\nThe official replied, \"They will arrive at the administrative office first.\"\n\nAnxious and uneasy, I bowed to the official, who then mounted a white donkey and departed. Lowering my head as I passed through the village lanes, I was swept away by the sound of wind and rain, suddenly losing all trace of my homeland.\n\nI arrived at a mountain range where Sword Ridge met the towering halls of the Star Palace, resembling a phoenix perched below. There was an ancient pool, and the official led me into a vast cavern. At its entrance stood several stalagmites, and the official said, \"The people’s prayers are answered when they invoke these stones—they are called Thunder Pillars.\"\n\nAs I tucked up my robes to enter the cavern, the official asked, \"Do you recall your seventy-three transformations in the Zhou dynasty, how your family’s hidden virtue has been passed down to this day?\"\n\nI suddenly awoke, as if from a dream.\n\nThe official said, \"In the celestial registers, you are listed among the ranks of the gods, though few in the mortal world know this. The Jin dynasty will soon show signs of revival. You may seek a method to manifest your transformation.\"\n\nI replied, \"I thank the celestial messenger for this revelation.\"\n\nUpon entering the cavern, I felt as though I had fallen into an abyss a thousand *ren* deep, yet my feet did not touch the ground, as if I were soaring in empty space. There stood a palace fit for a king, guarded by attendants, and I entered. Indeed, my entire family was gathered there. Later, I transformed into a scholar and traveled to Xianyang, where I lectured on the deeds of Yao Chang in *The Inner Transmission of Qinghe*. Those who burn incense must remember this.\n\n---\n\n**Celestial Titles and Sacred Decrees**\n\n**Heavenly Conferred Sacred Titles:**\nSupreme Minister of the Golden Palace, Inspector and Grand Preceptor; Left Chancellor of the Nine Phoenixes Golden Palace; Inner Assistant of the Primordial, Supreme Minister of the Three Clarities; Commander-in-Chief of the Three Realms’ Yin Armies; Acting Plenipotentiary; Administrator of the Prisons of Heaven, Earth, and Water; Holder of the Tiger Tallies and Dragon Credentials of the Five Peaks and Four Waterways; Judge of the Stellar Offices and Registrar of the Immortals’ Lineages; Original Sovereign of the Upper Immortals; True Lord of the Bureau of Longevity and Tribute Examinations; Compiler of the Flying Immortals’ Separate Registers; Venerable Savior of the Primordial Wheel of Transformation and Cyclic Suffering; Daoist Perfected of the Pure and Tranquil Inner Realm of Jade Clarity; Manifesting in the Purple Cloud Grotto, Holding the Ruyi Scepter; Commander of the Myriad Spirits, Universally Relieving All Sufferings; Great Benevolent, Great Filial, Great Sage, Great Compassionate Commander-in-Chief; Faithful and Sincere Teacher of the Myriad Heavens; Heavenly Venerable Who Responds to Wishes; Sovereign of the Nine Heavens Who Stabilizes the Primordial, Protects Life, Upholds the Dao, and Spreads Enlightenment; Lord of Everlasting Joy; Great Emperor of Water Who Protects and Manifests Numinous Responses; King of Concentration and Wisdom, Bodhisattva Who Attains the Fruit, Tathāgata of True Suchness in the Śākya and Brahmā Realms; Venerable Who Clarifies Truth and Observes the Registers of Longevity; Radiant Treasure of Compassion Who Saves from Calamity, Great Merciful One Who Renews Life Eternally; Heavenly Venerable Who Responds to Wishes, Unarrogant and Joyfully Nurturing Heavenly Emperor.\n\n---\n\n**Song Dynasty Decree:**\nWe consider that the utmost in filial piety and fraternal duty communicates with the divine. Thus, one who is a filial son in life becomes a luminous spirit in death—this is certain.\n\nThe Divine, Civil, Martial, Peaceful, Blessed, Loyal, and Benevolent King was renowned for his filial conduct, his numinous power shining over western Shu. He warded off disasters and saved the people, and the fame of the Seven Curves Sacred Mountain spread throughout the world. Scholars who took the examinations and passed all turned to him in reverence.\n\nPossessing filial piety and virtue, his illustrious title is fittingly proclaimed. The people’s petition is just, and he should be restored to his former rank. Reverently receiving this august mandate, may he greatly protect our people. Let him be enfeoffed as before: **Divine, Civil, Martial, Filial, Virtuous, Loyal, and Benevolent King**.\n\nIssued on the twenty-ninth day of the third month in the fifth year of Jingding.\n\n---\n\n**Decree Conferring Titles upon the Sacred Parents:**\nThe *Records* state: \"There are ten principles in sacrifice, revealing the way of serving ghosts and spirits, and the proper relations between father and son.\" Thus, those who today offer sacrifices to the gods and also honor their parents uphold the ancient intent.\n\nThe father of the Numinous Response Temple’s deity is hereby enfeoffed as **Illustrious Prosperity, Benevolent and Protective, Benevolent and Abundant King**. His mother is enfeoffed as **Luminous Virtue, Accumulated Blessings, Compassionate and Gentle, Reverent and Wise Consort**. They gave birth to a sagely son who presides over the flourishing of culture. From Phoenix Ridge in Jian, they settled the numinous governance of Dragon Mountain. The officials, tracing the origins, have earnestly petitioned. Thus, we bestow these sacrificial favors and illustrious titles, upholding the ancient kings’ teachings of filial piety. Let these titles be specially conferred.\n\nIn the fifth year of Xianchun, the fifth month, on a certain day.\n\n**Decree for the Additional Ennoblement of the Divine Consort:**\nSichuan, situated in the earthly region of Kun, has long been devoted to serving the gods with goodness. The state observes its constant rites, wherein a wife’s rank follows her husband’s. Now, on the occasion of the suburban sacrifice, we extend these favors of grace and honor. The Divine Consort of the Numinous Response Temple, **Assisting Compliance, Harmonious Response, Virtue and Wisdom, Luminous and August Consort**, embodies dignity in her demeanor and aids with uprightness. She shares in the sacrifices of Dragon Mountain and brings forth the auspiciousness of Phoenix Pavilion. Her embroidered sashes gleam with splendor, surpassing the eight virtues in their perfection. Her illustrious titles, repeatedly bestowed with favor, now bear twofold beauty in their names. May they forever reflect her virtue and manifestly praise her hidden merits. Let her be specially ennobled as **Reverent Compliance, Gentle Response, Virtue and Wisdom, Luminous and August Consort**.\n\n**Decree for the Additional Ennoblement of the Divine Sons:**\nThe eldest divine son, **Heir Virtue King**, and the second divine son, **Flourishing Virtue King**, once mirrored the two sons of the ancient governor of Shu, whose meritorious deeds were recorded in the sacrifices of Jingji and Tongliang. Thus, the tradition of a father’s virtue benefiting the people has long endured. You, who receive temple offerings in the west, have inherited and perpetuated this excellence. Your sagely wisdom and numinous radiance shine forth. Now, with the suburban sacrifices completed, we bestow upon you additional illustrious titles. As filial piety is the foundation, we follow the people’s wishes. May you continue to receive offerings and uphold our decree. Let the eldest divine son be specially ennobled as **Heir Virtue, Treading Filial Piety King**, and the second divine son as **Flourishing Virtue, Establishing Filial Piety King**.\n\n**Decree for the Additional Ennoblement of the Divine Sons’ Wives:**\nThe wife of the eldest divine son, **Goodly Assisting, Manifest and August Lady**, and the wife of the second divine son, **Compliant Assisting, Wise and August Lady**, observe the order of the divine in seniority, as recorded in the ritual classics, and honor the sequence of the divine, as chronicled in historical texts. You, who inherit the hidden virtues of the divine and receive temple offerings in this corner, have extended your beneficence from west to east, widely bestowing your grace. Let your illustrious titles now advance in tandem, equally manifesting your virtuous numen. Let the wife of the eldest divine son be specially ennobled as **Goodly Assisting, Manifest and August, Following Filial Piety Lady**, and the wife of the second divine son as **Compliant Assisting, Wise and August, Achieving Filial Piety Lady**.\n\n**Decree for the Initial Ennoblement of the Divine Daughter:**\nThe **Pure and True, Wondrously Serene Princess**, as We regulate the fundamental sacrifices, reverently honor the divine in the order of father, sons, and their seniority, and have already bestowed ranks and rewards equally. There remains her younger sister, who stands in attendance by her side. The granting of fiefs and emoluments begins here and now. May she uphold the intent of green-clad devotion and righteousness. Let the divine daughter be specially ennobled as **August and Filial Lady**, and her husband as **Reverent Arrayed Marquis**.\n\n**Decree for the Additional Ennoblement of the Divine Grandsons:**\nThe eldest divine grandson, **Continuing Response, Luminous Numen Marquis**, the second divine grandson, **Inheriting Response, Proclaiming Numen Marquis**, the wife of the eldest divine grandson, **Gentle Response Lady**, and the wife of the second divine grandson, **Wise Response Lady**.\n\nWe reflect that Phoenix Ridge in Jian and Dragon Mountain in Kui, where numinous essence gathers and flourishing beauty emerges, are not unique in this regard. Their ancestors and fathers have all rendered meritorious deeds for the people. How, then, could We withhold ranks and titles from their grandsons and daughters-in-law? Let the eldest divine grandson be specially ennobled as **Continuing Response, Luminous Numen, Utmost Filial Marquis**; the second divine grandson as **Inheriting Response, Proclaiming Numen, Compliant Filial Marquis**; the wife of the eldest divine grandson as **Gentle Response, Continuing Filial Lady**; and the wife of the second divine grandson as **Wise Response, Embodying Filial Lady**.\n\n**Decree for the Additional Ennoblement of Baoshao:**\nBy the sacred mandate of Heaven, the August Emperor decrees: In the manifest realm, there are rites and music; in the hidden realm, there are gods and spirits. The wondrous and the evident are of one thread. In heaven, they are the stars; on earth, they are the rivers and mountains. Their forms and functions operate between the two realms. How much more do they subtly assist in the great Dao? Thus, there must be grand rites to respond and extol them.\n\nThe **Lord Emperor of Culture and Literature of Qiqu Mountain, Wenchang Shrine, Zitong**, whose light is divided among the Zhang constellation and whose friendship is praised in the Zhou odes, has aided Our prosperous fortune with loyalty and filial piety, guiding the people. He wields the literary power of Kun, selecting and nurturing many scholars through civil examinations. In every instance of relieving calamities and distress, he manifests responses to encourage and admonish. The edicts for imperial examinations have been issued twice, and the records for evaluations were established first. Though embellishments have been added to the vast decrees, the illustrious titles have not yet fulfilled Our heart’s intent.\n\nAlas! We desire that talents emerge in succession, and you brilliantly manifest the numen of the Jiang and Han rivers. We desire that the governance of culture shine forth, and you dredge and emit the treasury of the Kui and Bi constellations. May these auspicious signs be attained to answer your honored radiance. Let him be additionally ennobled as **Assisting the Origin, Initiating Transformation, Wenchang, Controller of Emoluments, Vast Benevolence Lord Emperor**.\n\nExecuted by the relevant authorities.\n\nOn a certain day in the seventh month of the third year of Yanyou.\n\n**Decree for the Additional Ennoblement of the Temple Plaque:**\nThe Ministry of Rites and Ceremonies of the Central Secretariat has determined that the deity of the Numinous Response Temple of Qiqu Mountain, **Divine, Sagely, Martial, Filial, Loyal, and Benevolent King**, is upright in his numinous efficacy, revered by scholars and officials alike. The court has bestowed favors and honors upon him, which is fitting. Yet, no ennoblement surpasses that of \"King,\" and no praise exceeds that of \"Divine.\" The titles \"Sagely, Martial, Filial, Loyal, and Benevolent\" encompass all virtues the deity possesses—this may be called perfection. When rank has reached its apex, there is no further addition; when titles have attained their fullest splendor, there is no need for alteration. However, to examine the old records and adopt the name \"Assisting Culture and Completing Transformation\" for the temple plaque would suffice to manifestly honor the divine, respond to the flourishing fortune, and establish a complete and ultimate ritual order, illuminating boundless reverence.\n\n**Proclamation to the Twenty-One Bureaus:**\nWe privately reflect that Heaven has inaugurated a prosperous governance, enlightening and clarifying all, and the multitudes gather under the mandate of the Lord Emperor of Culture. The hundred spirits assemble in virtue, truly bestowing upon the edict’s favor. The August Ultimate is now bright, and the Great Stairs are level. The harvests are repeatedly bountiful, and weapons are forever stilled. This may be called following the traces of the Three Dynasties’ prosperous paths.\n\nThe Earth’s Divine Pivot has long descended to assist and uphold the Qing Dynasty, its radiance like the resplendent Eastern Wall star, vigorously reviving the Daoist arts. Though unworthy, I have been entrusted with the weighty charge of fostering filial piety and fraternal devotion, governing the lands below. Often I reflect on my inadequacy before the Heavenly Mandate, ever mindful of the solemn weight of the divine office. Recently, I have been graced with imperial favor, bestowed with official rank. The Twenty-One Bureaus, each with its appointed duties, and the hearts of countless millions—how could they remain untouched?\n\nHitherto, we have administered justice in the unseen realms, leaving none, near or far, unaddressed. Now, we proclaim it in the resplendent court, where claws and fangs are bared, robes and caps stand in solemn array, and countenances are dignified. Hear now, O assembled ministers, and receive this command in silence.\n\nWe recall that those who stand in the temple halls to govern together are but a few worthy ones. If there be even one who can reverse the tide of decline, then among the multitudes of ten thousand, you, my lords, are the luminaries of past and present, heroes transcending heaven and earth. Your loyalty and filial piety blaze to the skies, steadfast as the pine and cypress that endure the frost. Your civil and martial virtues sustain the age, like salt and plum that harmonize the broth. Long have you borne extraordinary authority, truly the stalwart guardians of the realm. For your meritorious continuance, how dare we delay in bestowing due reward?\n\nThough you serve as our assisting officials, your mandate in truth derives from Heaven. Upright, discerning, and just, no superfluous words are needed. The Nine Offices of the Shen Terrace shall be divided for strict oversight and impeachment. The Six Ministries of the Northern Bureau shall be charged with the exclusive duty of recommending the worthy. Only those of broad renown, whose conduct and knowledge manifest their virtue, may assist in continuing the legacy of *Assisting Culture and Completing Transformation*, and stand as models in the ranks of the Primordial Bureau’s emoluments.\n\nThose who bestow blessings and encourage goodness shall be rewarded, and their encouragement must be thorough. Those who punish evil and chastise deceit shall be punished, and their chastisement must not be evaded. The Golden Register records emoluments—examine their merits and dispense grace accordingly. The Spring Source inscribes descendants—trace their original intent and determine rewards justly. For those who present filial conduct in the *Guiyin* examinations, select them first to report to the Commander-in-Chief. Officials who cultivate virtue and benefit the people shall have their ranks elevated.\n\nThose who oversee fields and silkworms must harbor no deceit. Those who manage finances must not act for private gain. Those who command troops must govern the seen and unseen alike. Those who control rain and sunshine must diligently attend to the mechanisms of abundance and scarcity. Those who judge the merits and faults of merchants, and those who oversee the virtues of Daoists and Buddhists, must order all matters clearly and without negligence.\n\nThe Heavenly Register records the destinies of mortals—indeed, it governs life and death. The soaring *feiluan* elucidates transformation—it concerns the rise and fall of the world’s fortunes. Those who oversee the hundred crafts and skills, though their tasks be small, must not be overlooked. Those who supervise miscellaneous trades must enforce strictness in every matter.\n\nRedress grievances and right wrongs, that the people may find justice. Investigate and impeach spectral thieves, that the realm may know peace. The Wenchang Divine Response Bureau shall report morning petitions and dream omens without fail. Within the Grand Commander’s Prefecture, the authority to approve and issue orders shall be absolute.\n\nEach office, each rank, has its appointed reckoning. Above, they correspond to the throat and tongue of the Nine Heavens; below, they inspire awe in the hearts of all nations. The long-serving ministers of former assistance, whose meritorious deeds are recorded, shall be united with the assisting prefecture and still partake in the sacrifices of the new temple. Commanding the profound regions of the Jiang and Du rivers, they shall sit in governance over Min and E, ensuring the encircling bureaus advance in order, and their illustrious insignia be further enhanced.\n\nOnly when their hearts are thus aligned can success be achieved. Now, the silver toad shines brightly, the jade clepsydra drips slowly. All sounds are stilled, the court gates silent; the four quarters are tranquil, the dust of clamor leaves no trace. Dragon tallies and tiger tablets have arrived for the temple sacrifices, their splendor redoubling the grandeur of imperial praise.\n\nReverently receiving this august mandate, we shall reverse the decadence of the age and restore the purity of high antiquity. Go now, fulfill your duties, and do not betray the favor of the Supreme Emperor. Pour forth your sincere devotion, and in homage, extol the gracious mandate of the Son of Heaven.\n\n*Record of the Temple’s Activities*\nComposed by Zhao Yanzhi of Taiyuan, former Prefect of Yuzhou, now enshrined in the temple of Biyi.\n\nThe Perfected Lord stored his essence, and the stellar ranks descended from the Zhou dynasty. His surname was Zhang, personal name Zhong, courtesy name Xiaoyou. He aided King Xuan in the restoration of the Zhou, and upon his passing became a radiant spirit. Through successive reigns, he rendered great service, ever diligent in loyalty to his sovereign and filial piety to his parents, taking as his duty the support of culture and the refinement of the people’s hearts. Formerly enfeoffed as Divine, Civil, Martial, Filial, Loyal, and Benevolent King, in the third year of the Yanyou era of the sagely Yuan Emperor Renzong, when the imperial examinations were established, the Ministry of Rites deliberated with the Grand Secretariat and revised his temple title, inscribing the shrine as the \"Temple of Assisting Culture and Completing Transformation.\" That autumn, a special edict was issued, ennobling him as the Perfected Lord of Assisting the Primordial, Initiating Transformation, Presiding over Literature, and Vastly Benevolent.\n\nThe edict proclaimed: \"His light divides the Zhang constellation, his friendship chants the Zhou odes. He aided my flourishing fortune through loyalty and filial piety, and in governing the people, he wielded the power of Earth’s culture through examination ranks, selecting and nurturing many scholars.\" It further declared: \"I desire talents to arise in succession, and you brilliantly manifest the numen of the Yangtze and Han. I desire the governance of culture to shine forth, and you dredge and release the treasury of the Kui and Bi constellations. Thereafter, people increasingly believed that the nature of the spirit inherently aligns with those who assist and glorify the teachings of names, truly manifesting in the state’s sacrificial canon, which cannot be gainsaid. Those who turn toward reverence and admiration, reforming their conduct and advancing in virtue, are like rivers converging and clouds gathering, ceaselessly.\"\n\nThe spirit dwelled at Sword Gate, residing in Shu as the land of his sojourns and regard. He rendered great contributions to the West, yet the temple in Chengdu lacked solemnity. The two or three shrines in the east and west were insufficient to express the people’s reverence. In the first year of the Tianli era, when stars gathered in the Kui constellation, on the *jiazi* day of the third month, I, Yanzhi, accompanied by my attendants, departed from ancient Yu and arrived at Chengdu via Phoenix Mountain. Roaming and lingering, I was moved by a surge of old sentiments. Shu was a forest of many scholars, owing to Lord Zhang’s hidden blessings, his luminous efficacy gathering and elevating them. Those who soared in the imperial examinations followed one another in succession. Moreover, the ancient custom of serving the spirit with sincerity was esteemed. The nobles, great officials, worthy gentlemen, and scholars wished to expand his temple but had not yet succeeded. Since I knew of this, could I remain indifferent? Thus, I followed the people’s desires, subtly aiding their fulfillment. The plans were drawn, and the scale was grand—yet to mobilize the masses for a great undertaking would invite criticism in spring and autumn. In the second year of the Zhiyuan era, Zhao Shiyan, former Grand Academician of the Kuizhang Pavilion, Hanlin Academician, Academician-in-Waiting, Drafter of Edicts, and Compiler of the National History, Silver and Blue Honorable Grand Master, Grand Councilor of the Secretariat, and Duke of Lu, retired to Chengdu. Mindful of past virtues, he was earnestly devoted to Lord Zhang. Upon his arrival, he first paid respects to the spirit and consulted the oracle. I then informed him of the temple construction, saying: \"For years, my heart has harbored this wish, yet it remained unfulfilled. If you, my lord, would assist the spirit’s decree, I dare to lay bare my sincerity and exert myself.\"\n\nOn the *jiayin* day of the sixth month, the matter was divined. We traversed the city’s interior and exterior, selecting an exceptional site: the southwest’s majesty, the *kun* trigram’s axis, the primacy of the terrain, and the finest of ducal residences. The temple’s affairs were thus determined. The Duke himself composed several memorials to gather resources. In the spring of the fourth year, during the first month of the royal calendar, Zhao Chengqing, former Participant in Government Affairs of the Sichuan Branch Secretariat, desired to fulfill the grand plan. On the *jichou* day of the third month, Wan Jialü, Vice Minister of the Ministry of Revenue, arrived in Shu. During his administration of governance and royal affairs, heaven moved his heart. He summoned me to consult the oracle, and I recounted Lord Zhang’s comings and goings, his role as the throat of culture, the balance of cassia and emolument, and the temple’s construction. The Vice Minister joyfully bowed and said: \"Sichuan has a provincial administration; this should be planned.\" Three days later, he consulted superiors and subordinates, and all willingly assented.\n\nOn the first day of the sixth month, I instructed Wang Yexian, an attendant of the province, to divine the auspices for the matter. The memorial was submitted, and within a month, officials of the provincial administration, guests and aides, subordinate functionaries, and over one hundred twenty clerks all contributed portions of their salaries, totaling over five hundred strings of cash. On the auspicious first day of the tenth month, I commanded Hou Jing Yuanhengji, a chiliarch and grandson of the Grand Preceptor Duke of Qin, and Liu Shou’an, the Marquis of the Hebei Wing of the Ten Thousand Households, to donate five hundred strings of cash to purchase the estate. The temple’s construction thus began. The site measured seventy-three *zhang* in depth, with its left and right wings half that length, curving inward. Thereupon, craftsmen were summoned to level the ground, clear away thickets and obstructions, and apply plaster. A grand gate was erected outside, and a smaller gate stood within.\n\nOn the twenty-fifth day, a feast was prepared with music, and the Vice Minister, accompanied by the Participant in Government Affairs and the hundred officials, escorted the Perfected Lord into the temple. On the first day of the eleventh month, the main hall was completed, and the temple plaque was unveiled, inscribed with \"Temple of Assisting Culture and Completing Transformation.\" Side halls were added to house the left and right assistants, and a slanted observation platform was built to enforce the distinctions of rank and hierarchy. A Hall of Assembled Virtues was established, with a place for sacrificial offerings. The structure was resplendent, its ornamentation complete, its grandeur imposing, its scale neither mean nor excessively vast, but perfectly suited to its purpose. Compared to the two or three other shrines, it was beyond comparison.\n\nAlas! Do spirit and matter rely on timing? Do affairs hinge on rise and decline? The one who led the grand vision was the Duke Zhao. The one who swiftly realized the plan was the Vice Minister. The one who toiled morning and night, laboring with his hands, was my attendant Yang Shireng. Those who spared no effort, running errands and enduring hardship, were Wang Jun, Wang Shouyong, and He Shanqing.\n\nIn the second month of the fifth year, the worthy gentlemen and good people of Shu, along with the temple’s assistants, filled the ranks of attendants. Thirteen honorary positions were established, and all vied to contribute and rejoice in its completion. The dignified, capped, and robed officials who stood in the center, attended and revered, were now embodied by Zhao Chengqing, the Surveillance Commissioner for Rectitude.\n\nFrom ancient times to the present, from Sword Gate to the towns and cities, temples were universally established to sacrifice to him. Even in the capital and the eastern regions of Shaanxi, some offered sacrifices, all revering Lord Zhang’s merits—but none matched the splendor of the present temple.\n\nThe Lord Emperor is the sovereign of Wenchang, the heart of the people and the pulse of the nation. Through all ages, who has upheld the guiding principles of civilization under heaven? The traces of Yao, Shun, Yu, Tang, Wen, and Wu have faded, and simplicity and purity have declined. Thus, Heaven has ordained this to enlighten and initiate—His Lordship, illuminating the Dao and expounding its teachings, shines as brightly as the sun and stars. From this day forward, if lords and worthies revere the temple of the Lord Emperor, they will also honor His Lordship’s Dao and teachings. Those who cultivate virtue and engage in affairs will flourish within the harmony of ritual and music, and thrive under its transformative influence. Thus, they will neither fail their sovereign and parents above nor betray their studies below. Emerging as worthy ministers and chancellors, they will achieve great deeds, their ranks stretching endlessly—how could they merely vie in wielding brush and paper, competing in ornate words, to seek flattery and profit?\n\nAs the *Book of Songs* says: *\"Those who know me say I am troubled in heart; those who do not know me ask what I seek.\"* Herein lies what cannot be restrained.\n\nMoreover, as for the one who graces the imperial court with his presence, bestows pure blessings upon the people, ensures abundant harvests, dispels plagues, fosters harmony, and brings forth prosperity—doubling the talents of the world—it is the Lord Emperor of Wenchang, who assists the primordial, initiates transformation, governs official rank, and magnifies benevolence. The construction of his temple began in the *Tianli* year of *Wuchen* and was completed in the *Zhiyuan* year of *Jimao*. Though its towers and pavilions are not newly built, the worthy successors who come after are many. Amidst these affairs, a stele is erected to record this. Pressed by the requests of many scholars and moved by Lord Zhang’s long-standing devotion, I have thus written an outline, including the names of those who presided over its completion, the dates of the temple’s construction, and its origins near and far, so that later generations may have something to examine.\n\nIn the first year of *Zhizheng*, the year *Xinsi*, on an auspicious day in the fifth month of summer.\n\n**Exhortation to Respect Written Characters**\nAll scholars who belong to my register have come from reverence for written characters. For instance, in the Song dynasty, Minister Wang Yi’s father, upon seeing discarded written paper, would always gather and wash it with fragrant water before burning it. One night, he dreamed that the Sage Confucius patted his back and said: *\"How diligently you respect my written characters! I regret that you are already old and cannot achieve greatness, but in the future, I shall send Zeng Shen to be reborn in your family to bring honor to your household.\"* Soon after, he indeed had a son, whom he named Zeng, who later passed the imperial examinations as the top scholar. Though this event is distant, it serves as proof.\n\nI privately wonder at the people of this age, who claim to be learned yet do not cherish books. They regard the texts of Buddhism and Daoism as weighty as ten thousand *jun*, yet treat the characters of our Six Classics as light as goose down. Some use written paper to paste walls, make screens, wrap bedding, or seal windows; they trample it underfoot or use it to wipe filth. Such acts are no better than covering jars with it. Why do they hold Buddhism and Daoism in such reverence while treating our own teachings so lightly? Do they not know that the Three Teachings are fundamentally one, and that they forcibly create such distinctions?\n\nMoreover, our tradition has its own bureaus of good and evil to investigate and act, warning those who disrespect written characters. For example, those who toil in study for years may, in the examination hall, be dismissed by the authorities for a misplaced rhyme or a single erroneous character, never once having their names inscribed on the Tiger Board. This is the divine retribution for their lifelong disrespect of written characters. Yet scholars willingly accept this retribution, oblivious to its cause. Even worse, their descendants may become illiterate, and their entire families may suffer as a result. Though distant examples are not sufficient as warnings, let us speak of recent cases: In Luzhou, Yang Bixing sat on a classic text, and his entire family was afflicted with leprosy. In Chang Prefecture, Xianyu Kun defaced the *Mencius*, and his whole household perished. The retribution is clear and evident to all.\n\nYet Yang Quanshan, the elder brother of Yang Bixing, buried written characters and saw five generations of his family pass the imperial examinations. Li Zicai buried written characters and rose to high office in his lifetime. If one can heed and cherish such hidden rewards, how can one not stand in awe?\n\n**Exhortation to Scholars**\nThose who are intelligent, upright, and depend on others must still make choices. Those who are magnanimous, loyal, trustworthy, and fond of righteousness—these are the ones who carry on the tradition.\n\nThus, relying on the essence of responsive sincerity, I reveal in silence the teachings of the voiceless transformation. Hearken, all you assembled, to my admonitory words.\n\nI have heard that wealth and honor lie with Heaven, while gain and loss are decreed by fate. Those who understand this rest in naturalness and make no appeals; those who do not grasp it covet certainty and make supplications. Some say that when spirit and essence commune, dreams and waking visions align; that when sacrifices are abundant, the gods and spirits descend; that palaces and towers must flaunt soaring green-tiled roofs; that steps and corridors must boast carved crimson railings—yet in pursuing such trivialities, they lose their fundamental truth. Unaware of when to advance or retreat, their survival or ruin hangs upon the Three Offices and Four Registers; their acceptance or rejection, their rise or fall, are examined by the Five Bureaus and Six Terraces. Though these records exist, how can one calculate and seize them? Yet one must not be bound by predestination, nor may one remain blind to self-cultivation. Thus, those who refine their conduct and strive in virtue shall not lack the hundred blessings, while those who violate the Dao and corrupt their power shall have the five fortunes snatched away. Though the principles are manifest, people remain unaware: when fate and numbers mysteriously align, one may suffer calamity; when baleful stars shine forth, one may yet encounter fortune. Creation’s fluctuations follow this pattern, and the divine luminaries thus add or subtract.\n\nAll you scholars, reverently practice the teachings and laws. Do not deceive Heaven by claiming it is distant; do not dismiss the spirits as obscure. Do not say that dark chambers can be deceived, nor that only the bright court must be feared. Do not bully the orphaned and widowed; do not slight the elderly and accomplished. Do not seize wealth that is not rightfully yours; do not lust after another’s spouse. Do not cultivate close ties with outsiders while estranging kin; do not form righteous bonds with strangers while sowing discord among brothers. Do not rely on your strengths; do not attack others’ weaknesses. Do not indulge in arrogance and pleasure; do not give free rein to hunting and wandering. Do not squander your talent and reputation; do not wield official power to oppress. Do not venerate immortals and Buddhists while slighting your parents; do not revere ghosts and gods while disrespecting your teachers.\n\nShould any defy these words, they shall not escape Heaven’s decree. Thus, those of outstanding talent may repeatedly fail in the examination halls, while those of sudden clarity may swiftly pass the provincial exams—all due to hidden affinities, not mere happenstance. Those who secretly slander in their hearts often find pretexts, while those who praise to one’s face yet defame behind their back merely deceive their kin. How could the arbiters of literature act with partiality? The registers of rank and emolument are not arbitrarily bestowed. O multitude of scholars, Heaven may yet oversee you. O towering achievements, I thus affirm them.\n\nProclaim this widely, that all may hear and know: the selection of scholars through examinations is not confined to a single method. The essential aim is to obtain men who fulfill the people’s expectations. First, hidden merit and filial conduct are paramount; next, modest and harmonious self-conduct is deemed worthy. Those who study diligently shall be rewarded for their labor; those of exceptional talent shall have their aspirations fulfilled. The arrogant and negligent shall not escape demotion; the frivolous shall be shown both encouragement and punishment. Literary works shall determine their advancement or removal, while the divine luminaries shall impartially govern their bestowal or deprivation.\n\nPeople do not reflect on their own faults, so I now declare these instructive words: I have often said that scholars possess no inherent ability—only diligent study makes them capable. Though poor, how can one not grow rich? To achieve renown is to become rich. Scholars are not divided by noble or base status; what matters is their industry. In every grand examination, moral conduct and learning are first compared, and only then do the examiners assess the quality of their compositions. One cannot claim predestination as an excuse for failing to study diligently, nor may one rely on past affinities to slacken in self-cultivation. Though called scholars, they may lack even an inch of scholarly virtue; though clad in the robes of Confucians, they may merely present an outward appearance of beauty.\n\nThey disrespect Heaven and Earth, disbelieve in the divine luminaries, mock the elderly and accomplished, and slight their elders. They defy their parents and idle in pleasure; they neglect their teachers and indulge in dissipation. When they fail the exams, they blame the examiners for injustice; when the results are posted, they call the successful mediocre. Those who demand much of others fail to demand it of themselves; those who criticize others thereby criticize Heaven. Some rely on their own views to suppress others’ abilities; some flaunt their strengths to attack others’ weaknesses. Some boast of their learning while disregarding the world; some cling to a single insight while belittling others. Those who conduct themselves improperly regard greed and avarice as skill; those whose resolve is weak prize cunning and deceit as victory. They compare strengths and weaknesses without fairness; they seize from one to give to another, heedless of others’ words. They praise to one’s face yet defame behind their back, seeking to ingratiate themselves; they speak approval while harboring opposition, leaving no room for tolerance. Though their demeanor may seem kind, they merely craft fine words; though their hearts may brim with cruelty, they delight in secret schemes and hidden plots. They choose friends without discernment, befriending the unrighteous; they sow discord in their households, lusting after others’ spouses. Abandoning their own fields to plow another’s, they lose much; engaging in the useless to harm the useful, what could be more damaging?\n\nThose who pass the provincial examinations grow complacent, believing their ambitions fulfilled, and no longer cultivate themselves further. Those who enter the metropolitan examinations take success and fame as theirs for the spitting, relying on talent to scorn others, flaunting their seniority to bully the solitary. They habitually curry favor with the powerful and boast of their peers, dismissing all equals with a mere couplet or fragment of prose. In the marketplace, they collude in trade to covet gains; before magistrates, they conspire in litigation to satisfy their demands. Disloyal and unfilial, they willingly flout the law and delight in impropriety. Devoid of benevolence and uprightness, they act without restraint. They roam and hunt without measure, squander time on gambling and games, drown themselves in drink to the ruin of their spirit, and wield power only to corrupt their virtue. Repeatedly humiliated in the examination halls, how dare they hope for glory? Having put forth no effort in three years of study, they suddenly entertain the vain hope of passing the imperial examinations. When they fail, they attribute it to fate; when they succeed, they ascribe it solely to prayer. Unaware that Heaven’s decree cannot be evaded, they deepen the delusion in men’s hearts. In every word and silence, action and withdrawal, Heaven observes; in every promotion and demotion, bestowal and deprivation, the gods preside. How can one seize fortune by luck or scheme? Yet if one’s conduct and deeds are worthy of record, why fear failure to ascend?\n\nOf late, the descendants of merchant families, inheriting their forebears’ enterprises, have gained renown, while the heirs of scholarly lineages, who once wore the Confucian cap through generations, have been cast aside. The sons of merchants, content in their station, devote themselves to study without pretense; the scions of scholarly families, however, trusting in their noble lineage, grow arrogant and haughty. The divine and enlightened select impartially, often spurring the frivolous to reform, while the Way of Heaven turns leftward, rewarding the honest and unadorned.\n\nIf one can awaken to this truth, conceal one’s light, and bide in obscurity, then with diligent effort and suffering resolve, one may fulfill every act of hidden merit, uphold loyalty and filial piety, and return to the unadorned customs of high antiquity, shunning the degenerate ways of the latter age. Naturally, the transmission of poetry and ritual will endure, and scholarly honors will be restored. Conducting oneself with humility and harmony, one’s bearing will return to its original state. Heaven does not fail those who strive; scholars must apply themselves earnestly. Let all who would be gentlemen take heed.\n\nWritten by the Literary Gentleman Yan on the birthday of Lord Lao’s descent into the world, as the Jade Emperor presided over the Palace of the Great Ultimate. Here ends the transmission from Qinghe.\n\n\"#1 'Yin Connection' should be corrected as 'Yin Connection' (夤缘).\"",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "清河内传 经名：清河内传。 撰人不详，约出於明代。 假托文昌帝君自迷家世生平，并附宋元加封文昌圣号及行祠记。 一卷。 底本出处：《正统道藏》洞真部谱录类。 清河内传 吾本吴会间人，生於周初，后七十三化，累为士大夫，未尝酷民虐吏，性烈而行察，同秋霜白日不可犯。 后西晋末，降生於越之西、隽之南两郡之间。 是时，丁未年甲子辛亥二月三日诞，祥光幕户，黄云迷野。 居处地俯近海，里人谓清河叟曰：君今六十而获贵嗣。 童稚时，不喜嬉戏，每慕山泽，往往语言若有隐显，书诵群书，夜避众子，自笑且乐，身体光射。 居民祈祷，则予嗤而讪，长啸曰：土木而能衣人之衣，食人之食，享之而有应，谤之而有祸，我为人而焉无灵乎！ 自后夜之怪梦，或为龙，或为王者，天符，为水府漕，自怪而不甚信，为吉兆。 后三农愆旱，膏泽无苏，舞雩祝神，恬然无验，予思曰：夜寐怪梦治水府，今久当验。 夜往水际，以梦中官衔牒河伯，而惊魂尤恐忸怩不能，忽尔之间，云四合，风雷震，一吏稽首予前，曰：运判徙居？ 予曰：非我也，我乃张户老之子，名亚，后缘水府得达，故字霈夫。 吏曰：奉命促子。 予曰：家人如何？ 吏曰：先到治所。 予惶惶未央，吏揖，上一白驴而去，俛首里闬，风雨声中，顿失乡地。 到一山连剑岭而撑参宫，星也若凤凰之偃下，有古湫，引吾入一巨穴，门有数石笋，吏曰：民之祈梼，祝此石而有应，名雷柱。 吾方寨衣入穴，吏曰：君记周室为人七十三化，阴德传家而迄今否？ 予方大悟，若梦觉也。 吏曰：君在天谱得神之品，於人世鲜有知之者，晋不日有中兴之兆，君可寻方而显化。 予曰：谢天吏响报也。 入穴则若堕千仞之壑，近地而足不沾，若腾身虚空。 有王者之宫，有禁卫，予遂入。 果一家悉都其间，改日作儒士而往咸阳，讲姚苌之故事《清河内传》，焚香者切记。 天封圣号 金阙上相检校太师，九凤金阙左丞相、混元内辅三清上宰大都督府、都统三界阴兵、行便宜事、管天地水三界狱事、收五岳四渎真形虎符龙券、总诸天星曜判桂禄嗣籍上仙元皇真人、司禄职贡举真君，编修飞仙别籍、掌混元造化轮回救苦天尊、玉清内境清净道真、身现紫云岩、手持如意杖、统御万灵普济诸苦大仁大孝大圣大慈都统、混天诚心接物万天教主、随愿灵应天尊、九天定元保生扶教开化主宰长乐、水佑英显灵应大帝、定慧王菩萨证果迦释梵正如来、澄真正观注禄定籍、宝光慈应救劫大慈悲更生永命天尊、随愿灵应天尊不骄乐育天帝。 宋制 勑：朕惟孝悌之至，通于神明，则生为孝子，殁为明神，信矣。 神文圣武安福忠仁王，夙着孝行，炳灵西蜀，御患救灾，七曲名山闻天下，而士之发策决科者皆归焉。 有孝有德，徽号允昭，邦人有请，宜复其旧，祇承休命，大庇吾人，可依旧封神文圣武孝德忠仁王。 景定五年三月二十九日。 圣父圣母加封制 勑：记曰：祭有十伦，见事鬼神之道焉，见父子之伦焉，则今之奉祠于神，而并及其父母，尚古意也。 灵应庙神父显庆慈佑仁裕王，神母昭德积庆慈淑妃，笃生圣子，宗主人文，爰自剑之凤岭，妥灵政之龙山，有司推本其由，率吁甚切，兹颁祭泽，并有徽称，尚先王教孝之意，可特加封神父显庆慈佑仁裕令德王，神母昭德积庆慈淑恭慧妃。",
      "translated_text": "**The Inner Transmission of Qinghe**\n\n**Title:** *The Inner Transmission of Qinghe*. The author is unknown, likely dating to the Ming dynasty. It falsely attributes its narrative to Wenchang Dijun, recounting his family lineage and life, with appended records of Song and Yuan imperial decrees conferring sacred titles upon Wenchang and accounts of his temples. One fascicle.\n\n**Source:** *Zhengtong Daoist Canon*, *Dongzhen* Section, Registers and Records Category.\n\n---\n\n**The Inner Transmission of Qinghe**\n\nI was originally a man of Wu and Kuaiji, born in the early Zhou dynasty. After seventy-three transformations, I repeatedly took the form of scholar-officials, never oppressing the people or tyrannizing as an official. My nature was stern and my conduct scrutinous—unyielding as autumn frost or the noonday sun.\n\nLater, at the end of the Western Jin, I was reborn between the two commanderies west of Yue and south of Jun. In the dingwei year, on the third day of the second month (jiazi, xinhai), I was born. Auspicious light filled the household, and yellow clouds veiled the fields. My dwelling lay near the sea, and the villagers called me the Old Man of Qinghe, saying, \"At sixty, you have been blessed with a noble heir.\"\n\nIn childhood, I disliked play and often longed for mountains and marshes. My speech was often cryptic, as if concealing and revealing truths. I recited books voraciously, and at night, I would avoid other children, laughing and rejoicing alone, my body radiating light. When the villagers came to pray, I would scoff and mock them, crying out, \"If mere clay and wood can clothe and feed men, receiving offerings and answering prayers, or inviting slander and misfortune, how can I, a man, lack spirit?\"\n\nThereafter, I dreamed strange dreams at night—sometimes as a dragon, sometimes as a king. Heavenly omens appeared, and I was appointed as the Water Bureau’s Transport Commissioner. Though I found it strange, I did not fully believe it, deeming it a good omen.\n\nLater, when the three harvests failed due to drought and no rain came to revive the land, the people performed the *wuyu* dance and prayed to the gods, but to no avail. I thought, \"The dream of governing the Water Bureau must now come to pass.\" That night, I went to the water’s edge and, using the official title from my dream, presented a document to the River Earl. I was terrified and hesitant, but suddenly, clouds gathered, wind and thunder roared, and an official prostrated before me, asking, \"Has the Transport Commissioner moved residence?\"\n\nI replied, \"It is not I. I am the son of Zhang the Elder, named Ya. Later, through the Water Bureau, I gained recognition, so I style myself Peifu.\"\n\nThe official said, \"I am here by command to summon you.\"\n\nI asked, \"What of my family?\"\n\nThe official replied, \"They will arrive at the administrative office first.\"\n\nAnxious and uneasy, I bowed to the official, who then mounted a white donkey and departed. Lowering my head as I passed through the village lanes, I was swept away by the sound of wind and rain, suddenly losing all trace of my homeland.\n\nI arrived at a mountain range where Sword Ridge met the towering halls of the Star Palace, resembling a phoenix perched below. There was an ancient pool, and the official led me into a vast cavern. At its entrance stood several stalagmites, and the official said, \"The people’s prayers are answered when they invoke these stones—they are called Thunder Pillars.\"\n\nAs I tucked up my robes to enter the cavern, the official asked, \"Do you recall your seventy-three transformations in the Zhou dynasty, how your family’s hidden virtue has been passed down to this day?\"\n\nI suddenly awoke, as if from a dream.\n\nThe official said, \"In the celestial registers, you are listed among the ranks of the gods, though few in the mortal world know this. The Jin dynasty will soon show signs of revival. You may seek a method to manifest your transformation.\"\n\nI replied, \"I thank the celestial messenger for this revelation.\"\n\nUpon entering the cavern, I felt as though I had fallen into an abyss a thousand *ren* deep, yet my feet did not touch the ground, as if I were soaring in empty space. There stood a palace fit for a king, guarded by attendants, and I entered. Indeed, my entire family was gathered there. Later, I transformed into a scholar and traveled to Xianyang, where I lectured on the deeds of Yao Chang in *The Inner Transmission of Qinghe*. Those who burn incense must remember this.\n\n---\n\n**Celestial Titles and Sacred Decrees**\n\n**Heavenly Conferred Sacred Titles:**\nSupreme Minister of the Golden Palace, Inspector and Grand Preceptor; Left Chancellor of the Nine Phoenixes Golden Palace; Inner Assistant of the Primordial, Supreme Minister of the Three Clarities; Commander-in-Chief of the Three Realms’ Yin Armies; Acting Plenipotentiary; Administrator of the Prisons of Heaven, Earth, and Water; Holder of the Tiger Tallies and Dragon Credentials of the Five Peaks and Four Waterways; Judge of the Stellar Offices and Registrar of the Immortals’ Lineages; Original Sovereign of the Upper Immortals; True Lord of the Bureau of Longevity and Tribute Examinations; Compiler of the Flying Immortals’ Separate Registers; Venerable Savior of the Primordial Wheel of Transformation and Cyclic Suffering; Daoist Perfected of the Pure and Tranquil Inner Realm of Jade Clarity; Manifesting in the Purple Cloud Grotto, Holding the Ruyi Scepter; Commander of the Myriad Spirits, Universally Relieving All Sufferings; Great Benevolent, Great Filial, Great Sage, Great Compassionate Commander-in-Chief; Faithful and Sincere Teacher of the Myriad Heavens; Heavenly Venerable Who Responds to Wishes; Sovereign of the Nine Heavens Who Stabilizes the Primordial, Protects Life, Upholds the Dao, and Spreads Enlightenment; Lord of Everlasting Joy; Great Emperor of Water Who Protects and Manifests Numinous Responses; King of Concentration and Wisdom, Bodhisattva Who Attains the Fruit, Tathāgata of True Suchness in the Śākya and Brahmā Realms; Venerable Who Clarifies Truth and Observes the Registers of Longevity; Radiant Treasure of Compassion Who Saves from Calamity, Great Merciful One Who Renews Life Eternally; Heavenly Venerable Who Responds to Wishes, Unarrogant and Joyfully Nurturing Heavenly Emperor.\n\n---\n\n**Song Dynasty Decree:**\nWe consider that the utmost in filial piety and fraternal duty communicates with the divine. Thus, one who is a filial son in life becomes a luminous spirit in death—this is certain.\n\nThe Divine, Civil, Martial, Peaceful, Blessed, Loyal, and Benevolent King was renowned for his filial conduct, his numinous power shining over western Shu. He warded off disasters and saved the people, and the fame of the Seven Curves Sacred Mountain spread throughout the world. Scholars who took the examinations and passed all turned to him in reverence.\n\nPossessing filial piety and virtue, his illustrious title is fittingly proclaimed. The people’s petition is just, and he should be restored to his former rank. Reverently receiving this august mandate, may he greatly protect our people. Let him be enfeoffed as before: **Divine, Civil, Martial, Filial, Virtuous, Loyal, and Benevolent King**.\n\nIssued on the twenty-ninth day of the third month in the fifth year of Jingding.\n\n---\n\n**Decree Conferring Titles upon the Sacred Parents:**\nThe *Records* state: \"There are ten principles in sacrifice, revealing the way of serving ghosts and spirits, and the proper relations between father and son.\" Thus, those who today offer sacrifices to the gods and also honor their parents uphold the ancient intent.\n\nThe father of the Numinous Response Temple’s deity is hereby enfeoffed as **Illustrious Prosperity, Benevolent and Protective, Benevolent and Abundant King**. His mother is enfeoffed as **Luminous Virtue, Accumulated Blessings, Compassionate and Gentle, Reverent and Wise Consort**. They gave birth to a sagely son who presides over the flourishing of culture. From Phoenix Ridge in Jian, they settled the numinous governance of Dragon Mountain. The officials, tracing the origins, have earnestly petitioned. Thus, we bestow these sacrificial favors and illustrious titles, upholding the ancient kings’ teachings of filial piety. Let these titles be specially conferred.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1274,
      "start_sentence": 0,
      "end_sentence": 38,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.83002042770386,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\清河内传.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "咸淳五年五月      日。 神后加封制 勑：蜀居坤土，好率善以事神，邦有常彝，惟从夫而爵妇，兹因郊霈，申锡恩荣，灵应庙神后助顺协应德慧昭懿妃，端静其仪，正直是助，并侑龙山之祀，聿闽凤阁之祥，锦绶有华，曾俾八徽之极，嘉章迭宠，载更二美之名，永副德仪，明褒阴施，可特加封恭顺淑应德慧昭懿妃。 神子加封制 勑：神长子嗣德王，次子昌德王等，昔蜀太守二子，有功烈于井给，铜梁之问皆在祀典，然则裕父功以作民估，其来尚矣，尔等庙食于西，世济其美，斯文幸慧，厥有灵光，郊堙告成，并衍徽号，曰孝为本，从民欲也，尚期居歆，服我成命，可特加封神长子嗣德履孝王，神次子昌德立孝王。 神子妇加封制 勑：神长子妇善助显懿夫人，次子妇顺助慧懿夫人等，序神之长幼，载诸礼经，见神之先后，纪於史传，尔等席神阴德，庙食一隅，自西徂东，厥施甚溥，并进美号，同彰淑灵，可特加封神长子妇善助显懿循孝夫人，神次子妇顺助慧懿克孝人。 神女初封制 勑：淑真妙静公主，朕称秩元祀，敬恭明神於其父子长幼之序，亦既均施爵赏矣，有女其妹，立侍左右，疏封汤沐，实昉于今，尚绿情起义之意，可特封神女懿孝夫人，神婿恭列侯。 神孙加封制 勑：神长孙绍应昭灵侯，神次孙承应宣灵侯，长孙妇淑应夫人，次孙妇慧应夫人等。 朕惟剑之凤岭，夔之龙山，所以锺灵而衍秀者，易地皆然也。 乃祖乃父，俱有功烈于民，若孙若妇，朕何爱封爵而不与之乎，可特加封神长孙绍应昭灵至孝侯，神次孙承应宣灵顺孝侯，神长孙妇淑应绍孝夫人，神次孙妇慧应体孝夫人。 元加封宝韶 上天眷命皇帝圣旨：维明有礼乐，维幽有鬼神，妙显征之一贯，在天为星辰，在地为河岳，形功用於两间，矧能阴惊於大猷，必有对扬之懋典。 蜀七曲山文昌官梓潼帝君，光分张宿，友咏周诗，相予泰运，则以忠孝，而左右斯民，柄我坤文，则以科名，而选造多士，每御救於菑患，彰感应於劝惩，贡举之令再颁，考察之籍先定，贲饰虽加於涣汗，徽称未究於朕心。 於戏！ 予欲人材辈出，尔丕炳江汉之灵，予欲文治昭宣，尔浚发奎壁之府，庶臻嘉眖，以答宠光，可加封辅元开化文昌司禄宏仁帝君，主者施行。 延佑三年七月     日。 元加封庙额 中书省部太常礼仪院，定拟七曲山灵应庙神文圣武孝德忠仁王，灵异正直，士大夫所共崇礼，朝廷加锡恩数，礼亦为宜，然神明封爵之隆，莫尊於王，褒称之美，莫盛於神，文圣武孝德忠仁之号，神备有之，可谓极矣，夫爵已极则无以复加，号已盛则无庸改作，若为稽其旧记，因以佑文成化之名，施诸庙额，斯足以式彰明神，对扬景运备秩至文，昭示无极矣。 告谕二十－司文 窃以天开泰治聪明，众拱于文昌帝命，百灵德聚，实敷于涣号，皇极既明，泰阶既平，年谷屡成，兵革永清，兹可谓追三代之舤辙矣。",
      "translated_text": "In the fifth year of Xianchun, the fifth month, on a certain day.\n\n**Decree for the Additional Ennoblement of the Divine Consort:**\nSichuan, situated in the earthly region of Kun, has long been devoted to serving the gods with goodness. The state observes its constant rites, wherein a wife’s rank follows her husband’s. Now, on the occasion of the suburban sacrifice, we extend these favors of grace and honor. The Divine Consort of the Numinous Response Temple, **Assisting Compliance, Harmonious Response, Virtue and Wisdom, Luminous and August Consort**, embodies dignity in her demeanor and aids with uprightness. She shares in the sacrifices of Dragon Mountain and brings forth the auspiciousness of Phoenix Pavilion. Her embroidered sashes gleam with splendor, surpassing the eight virtues in their perfection. Her illustrious titles, repeatedly bestowed with favor, now bear twofold beauty in their names. May they forever reflect her virtue and manifestly praise her hidden merits. Let her be specially ennobled as **Reverent Compliance, Gentle Response, Virtue and Wisdom, Luminous and August Consort**.\n\n**Decree for the Additional Ennoblement of the Divine Sons:**\nThe eldest divine son, **Heir Virtue King**, and the second divine son, **Flourishing Virtue King**, once mirrored the two sons of the ancient governor of Shu, whose meritorious deeds were recorded in the sacrifices of Jingji and Tongliang. Thus, the tradition of a father’s virtue benefiting the people has long endured. You, who receive temple offerings in the west, have inherited and perpetuated this excellence. Your sagely wisdom and numinous radiance shine forth. Now, with the suburban sacrifices completed, we bestow upon you additional illustrious titles. As filial piety is the foundation, we follow the people’s wishes. May you continue to receive offerings and uphold our decree. Let the eldest divine son be specially ennobled as **Heir Virtue, Treading Filial Piety King**, and the second divine son as **Flourishing Virtue, Establishing Filial Piety King**.\n\n**Decree for the Additional Ennoblement of the Divine Sons’ Wives:**\nThe wife of the eldest divine son, **Goodly Assisting, Manifest and August Lady**, and the wife of the second divine son, **Compliant Assisting, Wise and August Lady**, observe the order of the divine in seniority, as recorded in the ritual classics, and honor the sequence of the divine, as chronicled in historical texts. You, who inherit the hidden virtues of the divine and receive temple offerings in this corner, have extended your beneficence from west to east, widely bestowing your grace. Let your illustrious titles now advance in tandem, equally manifesting your virtuous numen. Let the wife of the eldest divine son be specially ennobled as **Goodly Assisting, Manifest and August, Following Filial Piety Lady**, and the wife of the second divine son as **Compliant Assisting, Wise and August, Achieving Filial Piety Lady**.\n\n**Decree for the Initial Ennoblement of the Divine Daughter:**\nThe **Pure and True, Wondrously Serene Princess**, as We regulate the fundamental sacrifices, reverently honor the divine in the order of father, sons, and their seniority, and have already bestowed ranks and rewards equally. There remains her younger sister, who stands in attendance by her side. The granting of fiefs and emoluments begins here and now. May she uphold the intent of green-clad devotion and righteousness. Let the divine daughter be specially ennobled as **August and Filial Lady**, and her husband as **Reverent Arrayed Marquis**.\n\n**Decree for the Additional Ennoblement of the Divine Grandsons:**\nThe eldest divine grandson, **Continuing Response, Luminous Numen Marquis**, the second divine grandson, **Inheriting Response, Proclaiming Numen Marquis**, the wife of the eldest divine grandson, **Gentle Response Lady**, and the wife of the second divine grandson, **Wise Response Lady**.\n\nWe reflect that Phoenix Ridge in Jian and Dragon Mountain in Kui, where numinous essence gathers and flourishing beauty emerges, are not unique in this regard. Their ancestors and fathers have all rendered meritorious deeds for the people. How, then, could We withhold ranks and titles from their grandsons and daughters-in-law? Let the eldest divine grandson be specially ennobled as **Continuing Response, Luminous Numen, Utmost Filial Marquis**; the second divine grandson as **Inheriting Response, Proclaiming Numen, Compliant Filial Marquis**; the wife of the eldest divine grandson as **Gentle Response, Continuing Filial Lady**; and the wife of the second divine grandson as **Wise Response, Embodying Filial Lady**.\n\n**Decree for the Additional Ennoblement of Baoshao:**\nBy the sacred mandate of Heaven, the August Emperor decrees: In the manifest realm, there are rites and music; in the hidden realm, there are gods and spirits. The wondrous and the evident are of one thread. In heaven, they are the stars; on earth, they are the rivers and mountains. Their forms and functions operate between the two realms. How much more do they subtly assist in the great Dao? Thus, there must be grand rites to respond and extol them.\n\nThe **Lord Emperor of Culture and Literature of Qiqu Mountain, Wenchang Shrine, Zitong**, whose light is divided among the Zhang constellation and whose friendship is praised in the Zhou odes, has aided Our prosperous fortune with loyalty and filial piety, guiding the people. He wields the literary power of Kun, selecting and nurturing many scholars through civil examinations. In every instance of relieving calamities and distress, he manifests responses to encourage and admonish. The edicts for imperial examinations have been issued twice, and the records for evaluations were established first. Though embellishments have been added to the vast decrees, the illustrious titles have not yet fulfilled Our heart’s intent.\n\nAlas! We desire that talents emerge in succession, and you brilliantly manifest the numen of the Jiang and Han rivers. We desire that the governance of culture shine forth, and you dredge and emit the treasury of the Kui and Bi constellations. May these auspicious signs be attained to answer your honored radiance. Let him be additionally ennobled as **Assisting the Origin, Initiating Transformation, Wenchang, Controller of Emoluments, Vast Benevolence Lord Emperor**.\n\nExecuted by the relevant authorities.\n\nOn a certain day in the seventh month of the third year of Yanyou.\n\n**Decree for the Additional Ennoblement of the Temple Plaque:**\nThe Ministry of Rites and Ceremonies of the Central Secretariat has determined that the deity of the Numinous Response Temple of Qiqu Mountain, **Divine, Sagely, Martial, Filial, Loyal, and Benevolent King**, is upright in his numinous efficacy, revered by scholars and officials alike. The court has bestowed favors and honors upon him, which is fitting. Yet, no ennoblement surpasses that of \"King,\" and no praise exceeds that of \"Divine.\" The titles \"Sagely, Martial, Filial, Loyal, and Benevolent\" encompass all virtues the deity possesses—this may be called perfection. When rank has reached its apex, there is no further addition; when titles have attained their fullest splendor, there is no need for alteration. However, to examine the old records and adopt the name \"Assisting Culture and Completing Transformation\" for the temple plaque would suffice to manifestly honor the divine, respond to the flourishing fortune, and establish a complete and ultimate ritual order, illuminating boundless reverence.\n\n**Proclamation to the Twenty-One Bureaus:**\nWe privately reflect that Heaven has inaugurated a prosperous governance, enlightening and clarifying all, and the multitudes gather under the mandate of the Lord Emperor of Culture. The hundred spirits assemble in virtue, truly bestowing upon the edict’s favor. The August Ultimate is now bright, and the Great Stairs are level. The harvests are repeatedly bountiful, and weapons are forever stilled. This may be called following the traces of the Three Dynasties’ prosperous paths.",
      "overlap_context": "is enfeoffed as **Luminous Virtue, Accumulated Blessings, Compassionate and Gentle, Reverent and Wise Consort**. They gave birth to a sagely son who presides over the flourishing of culture. From Phoenix Ridge in Jian, they settled the numinous governance of Dragon Mountain. The officials, tracing the origins, have earnestly petitioned. Thus, we bestow these sacrificial favors and illustrious titles, upholding the ancient kings’ teachings of filial piety. Let these titles be specially conferred.",
      "start_char": 1275,
      "end_char": 2419,
      "start_sentence": 39,
      "end_sentence": 61,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.21392488479614,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\清河内传.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "久以坤维之神降，弼辅清朝，粲然东壁之星明，勃兴道术，孝友忝膺重，寄俯治下方，每思不称上帝之委令，常念弗任神职之峻重，迩蒙嘉宠，锡以官班，二十一司属，各有攸存，千亿万民心，宁无所击，比则播理于冥冥之内，远迩弗遗，今则传扬于赫赫之庭，爪牙布露，衣冠济济，相貌堂堂，咨尔群臣，无哗听命。 爰念端委庙堂而共理，惟二三贤，苟力挽颓波之有人，贤十万众，卿等贯古今之清哲，迈宇宙之英雄，忠孝灼天，真后凋之松柏，文武经世为相济之盐梅，久膺不世之威，实负干城之杰，有嘉茂续，敢缓畴庸，虽官吾佐贰之司，实禀于上天之命，聪明正直，毋俟赘辞，分九职于申台，肃行紏劾，署六卿于北府，专隶举贤，非夫有令闻广誉，施诸身识，前言往行，蓄其德则何以助我，佑文成化之续，亦不能仪辅元司禄之班，凡锡福劝善者宜锡，劝者必周，罚恶惩欺者当罚，惩者毋避，金籍注禄，考其实续而敷恩，春源注嗣，原其初心而定赏，贡举定桂阴骘孝行者，首选以呈都督，官吏作德益民者，高甲其第，掌握田蚕而无慝，主领财赋而莫私，主握兵马幽明之理不殊，主掌雨旸丰歉之机当谨，主典商贾之功罪，主掌道释之善尤，井井有条，彰彰不素，天简注授，实掌人间之生死，飞鸾阐化，乃关世运之盛衰，掌百工技巧者，虽小事必录，提辖杂流者，每一事必严，雪冤平枉，俾天民之得伸，征劾鬼盗，令天下之宁戢，文昌灵应司，朝奏应梦之不爽，大都督府内，出纳总裁之可权，列职分斑，各有攸计，上应九天之喉舌，下孚万国之惧心，惟时旧弼之良，久籍勋劳之着，往联华于佐府，仍侑食于新庭，驾江读之奥区，控岷峨而坐镇，俾进司于环列，庸增峻于徽章，惟既厥心，乃克有济，兹者银蟾皎皎，玉漏迟迟，万籁寂而庭户无声，四方静而尘嚣绝影，虬旌豹节，已臻庙食之仪，龙券虎符，益耀褒崇之盛，钦承休命，挽一世之浇漓，祇励於猷，还上古之淳厚，往绥尔职，毋负上帝之宠光，罄沥丹忱，拜扬天子之休命。 行祠记 前渝州刺史庙食壁邑太原赵延之撰",
      "translated_text": "The Earth’s Divine Pivot has long descended to assist and uphold the Qing Dynasty, its radiance like the resplendent Eastern Wall star, vigorously reviving the Daoist arts. Though unworthy, I have been entrusted with the weighty charge of fostering filial piety and fraternal devotion, governing the lands below. Often I reflect on my inadequacy before the Heavenly Mandate, ever mindful of the solemn weight of the divine office. Recently, I have been graced with imperial favor, bestowed with official rank. The Twenty-One Bureaus, each with its appointed duties, and the hearts of countless millions—how could they remain untouched?\n\nHitherto, we have administered justice in the unseen realms, leaving none, near or far, unaddressed. Now, we proclaim it in the resplendent court, where claws and fangs are bared, robes and caps stand in solemn array, and countenances are dignified. Hear now, O assembled ministers, and receive this command in silence.\n\nWe recall that those who stand in the temple halls to govern together are but a few worthy ones. If there be even one who can reverse the tide of decline, then among the multitudes of ten thousand, you, my lords, are the luminaries of past and present, heroes transcending heaven and earth. Your loyalty and filial piety blaze to the skies, steadfast as the pine and cypress that endure the frost. Your civil and martial virtues sustain the age, like salt and plum that harmonize the broth. Long have you borne extraordinary authority, truly the stalwart guardians of the realm. For your meritorious continuance, how dare we delay in bestowing due reward?\n\nThough you serve as our assisting officials, your mandate in truth derives from Heaven. Upright, discerning, and just, no superfluous words are needed. The Nine Offices of the Shen Terrace shall be divided for strict oversight and impeachment. The Six Ministries of the Northern Bureau shall be charged with the exclusive duty of recommending the worthy. Only those of broad renown, whose conduct and knowledge manifest their virtue, may assist in continuing the legacy of *Assisting Culture and Completing Transformation*, and stand as models in the ranks of the Primordial Bureau’s emoluments.\n\nThose who bestow blessings and encourage goodness shall be rewarded, and their encouragement must be thorough. Those who punish evil and chastise deceit shall be punished, and their chastisement must not be evaded. The Golden Register records emoluments—examine their merits and dispense grace accordingly. The Spring Source inscribes descendants—trace their original intent and determine rewards justly. For those who present filial conduct in the *Guiyin* examinations, select them first to report to the Commander-in-Chief. Officials who cultivate virtue and benefit the people shall have their ranks elevated.\n\nThose who oversee fields and silkworms must harbor no deceit. Those who manage finances must not act for private gain. Those who command troops must govern the seen and unseen alike. Those who control rain and sunshine must diligently attend to the mechanisms of abundance and scarcity. Those who judge the merits and faults of merchants, and those who oversee the virtues of Daoists and Buddhists, must order all matters clearly and without negligence.\n\nThe Heavenly Register records the destinies of mortals—indeed, it governs life and death. The soaring *feiluan* elucidates transformation—it concerns the rise and fall of the world’s fortunes. Those who oversee the hundred crafts and skills, though their tasks be small, must not be overlooked. Those who supervise miscellaneous trades must enforce strictness in every matter.\n\nRedress grievances and right wrongs, that the people may find justice. Investigate and impeach spectral thieves, that the realm may know peace. The Wenchang Divine Response Bureau shall report morning petitions and dream omens without fail. Within the Grand Commander’s Prefecture, the authority to approve and issue orders shall be absolute.\n\nEach office, each rank, has its appointed reckoning. Above, they correspond to the throat and tongue of the Nine Heavens; below, they inspire awe in the hearts of all nations. The long-serving ministers of former assistance, whose meritorious deeds are recorded, shall be united with the assisting prefecture and still partake in the sacrifices of the new temple. Commanding the profound regions of the Jiang and Du rivers, they shall sit in governance over Min and E, ensuring the encircling bureaus advance in order, and their illustrious insignia be further enhanced.\n\nOnly when their hearts are thus aligned can success be achieved. Now, the silver toad shines brightly, the jade clepsydra drips slowly. All sounds are stilled, the court gates silent; the four quarters are tranquil, the dust of clamor leaves no trace. Dragon tallies and tiger tablets have arrived for the temple sacrifices, their splendor redoubling the grandeur of imperial praise.\n\nReverently receiving this august mandate, we shall reverse the decadence of the age and restore the purity of high antiquity. Go now, fulfill your duties, and do not betray the favor of the Supreme Emperor. Pour forth your sincere devotion, and in homage, extol the gracious mandate of the Son of Heaven.\n\n*Record of the Temple’s Activities*\nComposed by Zhao Yanzhi of Taiyuan, former Prefect of Yuzhou, now enshrined in the temple of Biyi.",
      "overlap_context": "y-One Bureaus:**\nWe privately reflect that Heaven has inaugurated a prosperous governance, enlightening and clarifying all, and the multitudes gather under the mandate of the Lord Emperor of Culture. The hundred spirits assemble in virtue, truly bestowing upon the edict’s favor. The August Ultimate is now bright, and the Great Stairs are level. The harvests are repeatedly bountiful, and weapons are forever stilled. This may be called following the traces of the Three Dynasties’ prosperous paths.",
      "start_char": 2419,
      "end_char": 3217,
      "start_sentence": 62,
      "end_sentence": 65,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.57351803779602,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\清河内传.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "帝君储精，列宿降自有周。 姓张讳仲，字孝友，辅宣王中兴，没为明神，累朝咸有大功，尤孜孜以忠君孝亲，扶植斯文，化淑民心为任，旧封神文圣武孝德忠仁王。 逮圣元仁宗皇帝设科取士，延佑三年春，中书因太常定议，改封庙号，榜曰佑文成化之祠，是年秋，特颁诏旨，褒封辅元开化文昌司禄宏仁帝君。 诏若曰：光分张宿，友咏周诗，相予泰运，则以忠孝，而左右斯民，柄我坤文，则以科名而选造多士。 又曰：予欲人材辈出，尔丕炳江汉之灵，予欲文治昭宣，尔浚发奎壁之府，然后人益信。 夫神之性本所自，与夫翊赞名教者，实昭彰乎国家祀典之不可诬，而趋向敬慕，改行迪德者，犹川会云嗡之不能已焉。 神栖剑门，住蜀为周游睠顾之地，是有大造于西也，而成都庙貌未严，东西二三其祠，不足称邦人敬在意。 天历改元，星聚于奎，三月甲子，延之自古渝携侍生出凤山至成都，纵观盘桓，慨增旧感。 蜀为多士之林，由张君阴骘，炳灵掇拾，科第雄飞当代者，迭相踵武，况事神以诚，古俗相尚，王公大人贤大夫士，欲宏其祠而未能，予既知之，得无情哉，故因人所欲，阴相成之，具计遂侈，非兴大众举大事，一为春秋讥。 后至元二年，前奎章阁大学士翰林学士承旨知制诰兼修国史银青荣禄大夫中书平章政事鲁国公赵世延，告老还成都，不忘旧德，则拳拳於张君，甫下车，先侍生而卜焉。 予因以建祠事告公曰：积岁存心愿莫之遂，若相神麻，敢披肝胆以勤。 六月甲寅，遂卜其事，步城内外，择异处焉，得西南之雄、坤文之维、地势之元，公侯之宅之尤者，祠事始定。 公自为疏若干，以鸠其资。 四年春王正月，前四川行省参知政事赵成庆，欲戏厥谋，以毕宏规，三月己丑，户部侍郎万嘉闾来会蜀，赋威行爱立理王事暇，天诱其衷，召侍生以卜，予具张君出没之机斯文喉舌，桂禄权衡，及建祠之事以报，侍郎忻然拜曰：蜀有省宪，明当图之，越三日，谋及上下，众愿乐从。 夏六月朔旦，予命省缘王也先，卜花左右其事，疏至，未越月，省宪官暨宾佐缘属，下及有司群吏百有二十余人，皆割俸以助，几五百余缗。 冬十月上吉，命千户侯靖元亨集、太师秦国公之孙，河东翼万户侯刘寿安，捐直五百缗，而易其第，祠事始成。 其地为深丈者七十有三，横左右者半折而曲深，於是来工师整上下，燔屏椔翳，爰塈乃涂，作远门于外，峙小门于中。 二十有五日，具食合乐，侍郎偕参政率百官，以导帝君入焉，十有一月朔，乃仍正屋揭庙额，表佑文成化之祠，乃更廊麻以司左右赞佐，乃位斜察以严尊卑陟降，聚德有堂，侑食有所，耽然而轮奂备，屹然而规模壮，不沦於陋，实敞虚旷，丰约得宜，惟称是适，回视二三，不可同日语矣。 呜呼！ 神物凭依有时者耶，事关兴废者耶，主盟胜槩者，赵相也，速成其图者，侍郎也，晨夕劬躬拮据卒徒者，侍生杨世仁也，不避劳勤往来走役於其间者，王钧、王寿永、何善庆焉。 五年春二月，士夫之贤邦人之良木赞佐，以实侍卫，嘉庆位十有三，咸争趋而乐成，堂堂冕服，以中居而立侍拱之者，今肃政廉访使赵成庆完焉。 缘古及今，自剑门至州邑，率庙而祀之，京师陕束亦或祀之者，咸敬张君之功，未若今之盛也。",
      "translated_text": "The Perfected Lord stored his essence, and the stellar ranks descended from the Zhou dynasty. His surname was Zhang, personal name Zhong, courtesy name Xiaoyou. He aided King Xuan in the restoration of the Zhou, and upon his passing became a radiant spirit. Through successive reigns, he rendered great service, ever diligent in loyalty to his sovereign and filial piety to his parents, taking as his duty the support of culture and the refinement of the people’s hearts. Formerly enfeoffed as Divine, Civil, Martial, Filial, Loyal, and Benevolent King, in the third year of the Yanyou era of the sagely Yuan Emperor Renzong, when the imperial examinations were established, the Ministry of Rites deliberated with the Grand Secretariat and revised his temple title, inscribing the shrine as the \"Temple of Assisting Culture and Completing Transformation.\" That autumn, a special edict was issued, ennobling him as the Perfected Lord of Assisting the Primordial, Initiating Transformation, Presiding over Literature, and Vastly Benevolent.\n\nThe edict proclaimed: \"His light divides the Zhang constellation, his friendship chants the Zhou odes. He aided my flourishing fortune through loyalty and filial piety, and in governing the people, he wielded the power of Earth’s culture through examination ranks, selecting and nurturing many scholars.\" It further declared: \"I desire talents to arise in succession, and you brilliantly manifest the numen of the Yangtze and Han. I desire the governance of culture to shine forth, and you dredge and release the treasury of the Kui and Bi constellations. Thereafter, people increasingly believed that the nature of the spirit inherently aligns with those who assist and glorify the teachings of names, truly manifesting in the state’s sacrificial canon, which cannot be gainsaid. Those who turn toward reverence and admiration, reforming their conduct and advancing in virtue, are like rivers converging and clouds gathering, ceaselessly.\"\n\nThe spirit dwelled at Sword Gate, residing in Shu as the land of his sojourns and regard. He rendered great contributions to the West, yet the temple in Chengdu lacked solemnity. The two or three shrines in the east and west were insufficient to express the people’s reverence. In the first year of the Tianli era, when stars gathered in the Kui constellation, on the *jiazi* day of the third month, I, Yanzhi, accompanied by my attendants, departed from ancient Yu and arrived at Chengdu via Phoenix Mountain. Roaming and lingering, I was moved by a surge of old sentiments. Shu was a forest of many scholars, owing to Lord Zhang’s hidden blessings, his luminous efficacy gathering and elevating them. Those who soared in the imperial examinations followed one another in succession. Moreover, the ancient custom of serving the spirit with sincerity was esteemed. The nobles, great officials, worthy gentlemen, and scholars wished to expand his temple but had not yet succeeded. Since I knew of this, could I remain indifferent? Thus, I followed the people’s desires, subtly aiding their fulfillment. The plans were drawn, and the scale was grand—yet to mobilize the masses for a great undertaking would invite criticism in spring and autumn. In the second year of the Zhiyuan era, Zhao Shiyan, former Grand Academician of the Kuizhang Pavilion, Hanlin Academician, Academician-in-Waiting, Drafter of Edicts, and Compiler of the National History, Silver and Blue Honorable Grand Master, Grand Councilor of the Secretariat, and Duke of Lu, retired to Chengdu. Mindful of past virtues, he was earnestly devoted to Lord Zhang. Upon his arrival, he first paid respects to the spirit and consulted the oracle. I then informed him of the temple construction, saying: \"For years, my heart has harbored this wish, yet it remained unfulfilled. If you, my lord, would assist the spirit’s decree, I dare to lay bare my sincerity and exert myself.\"\n\nOn the *jiayin* day of the sixth month, the matter was divined. We traversed the city’s interior and exterior, selecting an exceptional site: the southwest’s majesty, the *kun* trigram’s axis, the primacy of the terrain, and the finest of ducal residences. The temple’s affairs were thus determined. The Duke himself composed several memorials to gather resources. In the spring of the fourth year, during the first month of the royal calendar, Zhao Chengqing, former Participant in Government Affairs of the Sichuan Branch Secretariat, desired to fulfill the grand plan. On the *jichou* day of the third month, Wan Jialü, Vice Minister of the Ministry of Revenue, arrived in Shu. During his administration of governance and royal affairs, heaven moved his heart. He summoned me to consult the oracle, and I recounted Lord Zhang’s comings and goings, his role as the throat of culture, the balance of cassia and emolument, and the temple’s construction. The Vice Minister joyfully bowed and said: \"Sichuan has a provincial administration; this should be planned.\" Three days later, he consulted superiors and subordinates, and all willingly assented.\n\nOn the first day of the sixth month, I instructed Wang Yexian, an attendant of the province, to divine the auspices for the matter. The memorial was submitted, and within a month, officials of the provincial administration, guests and aides, subordinate functionaries, and over one hundred twenty clerks all contributed portions of their salaries, totaling over five hundred strings of cash. On the auspicious first day of the tenth month, I commanded Hou Jing Yuanhengji, a chiliarch and grandson of the Grand Preceptor Duke of Qin, and Liu Shou’an, the Marquis of the Hebei Wing of the Ten Thousand Households, to donate five hundred strings of cash to purchase the estate. The temple’s construction thus began. The site measured seventy-three *zhang* in depth, with its left and right wings half that length, curving inward. Thereupon, craftsmen were summoned to level the ground, clear away thickets and obstructions, and apply plaster. A grand gate was erected outside, and a smaller gate stood within.\n\nOn the twenty-fifth day, a feast was prepared with music, and the Vice Minister, accompanied by the Participant in Government Affairs and the hundred officials, escorted the Perfected Lord into the temple. On the first day of the eleventh month, the main hall was completed, and the temple plaque was unveiled, inscribed with \"Temple of Assisting Culture and Completing Transformation.\" Side halls were added to house the left and right assistants, and a slanted observation platform was built to enforce the distinctions of rank and hierarchy. A Hall of Assembled Virtues was established, with a place for sacrificial offerings. The structure was resplendent, its ornamentation complete, its grandeur imposing, its scale neither mean nor excessively vast, but perfectly suited to its purpose. Compared to the two or three other shrines, it was beyond comparison.\n\nAlas! Do spirit and matter rely on timing? Do affairs hinge on rise and decline? The one who led the grand vision was the Duke Zhao. The one who swiftly realized the plan was the Vice Minister. The one who toiled morning and night, laboring with his hands, was my attendant Yang Shireng. Those who spared no effort, running errands and enduring hardship, were Wang Jun, Wang Shouyong, and He Shanqing.\n\nIn the second month of the fifth year, the worthy gentlemen and good people of Shu, along with the temple’s assistants, filled the ranks of attendants. Thirteen honorary positions were established, and all vied to contribute and rejoice in its completion. The dignified, capped, and robed officials who stood in the center, attended and revered, were now embodied by Zhao Chengqing, the Surveillance Commissioner for Rectitude.\n\nFrom ancient times to the present, from Sword Gate to the towns and cities, temples were universally established to sacrifice to him. Even in the capital and the eastern regions of Shaanxi, some offered sacrifices, all revering Lord Zhang’s merits—but none matched the splendor of the present temple.",
      "overlap_context": "their splendor redoubling the grandeur of imperial praise.\n\nReverently receiving this august mandate, we shall reverse the decadence of the age and restore the purity of high antiquity. Go now, fulfill your duties, and do not betray the favor of the Supreme Emperor. Pour forth your sincere devotion, and in homage, extol the gracious mandate of the Son of Heaven.\n\n*Record of the Temple’s Activities*\nComposed by Zhao Yanzhi of Taiyuan, former Prefect of Yuzhou, now enshrined in the temple of Biyi.",
      "start_char": 3217,
      "end_char": 4447,
      "start_sentence": 66,
      "end_sentence": 87,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.879390001297,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\清河内传.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "帝君文昌之主也，人心国脉，斯文万古纪纲天下者，伊谁之力欤？ 尧舜禹汤文武之迹熄而淳朴衰，天盖以此沐之启之也，帝君明道阐教，炳然日星，继今公侯贤士知崇帝君之祠，则知尊帝君之道之教也，成德从事者，雍然于礼乐之中，熙然于陶镕之下，则上不负君亲，下不负问学，出为贤卿相，发为大事业，将项背相望，奚特操纸笔，竞辞华，以为缴媚利禄之阶哉！ 诗曰：知我者谓我心忧，不知我者谓我何求。 於是盖亦有所不能已焉。 若夫羽仪天朝，锡民纯嘏，屡丰年，消疫疠，导和致祥，人才倍出于天下者，辅元开化文昌司禄宏仁帝君望焉。 祠之经始于天历戊辰，落成以至元己卯。 楼阁虽未新，承继之贤，其来孔多，因事之中，才石以记，予既多士夫之请，又感张君夙好之笃，故书梗槩，及主成人名氏，祠建年月远近之由，俾来者有所览稽焉。 至正元年岁次辛巳夏五月上吉。 劝敬字纸文 士之隶吾籍者，皆自敬重字纸中来，如宋朝王沂公，其父见字纸遗坠，必掇拾以香汤洗烧之，一夕梦宣圣拊其背曰：汝何敬重吾字纸之勤也，恨汝老矣，无可成就，他日当令曾参来汝家受生，显大门户。 未几，果生一男，遂命名曾，及状元第。 此事虽远，可以为证。 予窃怪今世之人，名为知书，而不能惜书，视释老之文，非特万钧之重，其於吾六经之字，有如鸿毛之轻，或以字纸而泥糊，或以背屏，或以裹褥，或以泥窗，践踏脚底，或以拭秽。 如此之类，不啻盖覆瓿矣，何释老之重而吾道之轻耶？ 是岂知三教本一，而欲强兹分别耳。 况吾自有善恶二司，按察施行，以警不敬字纸之类，如平生苦学鹦窗，一旦场屋或以失韵误字，例为有司之黜，终不能一挂名虎榜者，皆神夺其鉴，以示平日不敬字纸之果报也。 诸生甘受此报，恬然不知觉，甚至於子孙之不识字，举家因之而害者，远则不足以为戒，姑以近者言之，且泸州杨百行坐经文，而举家害癞，昌郡鲜于坤残《孟子》，而全家灭亡，果报昭昭在人耳目。 杨全善亦百行之兄，埋字纸而五世登科，李子才葬字纸而一身显官，既能顾惜阴报，岂无可不敬畏哉。 戒士子文 聪明正直而依人，宁无所择，宽厚忠信而好义，是用相仍。",
      "translated_text": "The Lord Emperor is the sovereign of Wenchang, the heart of the people and the pulse of the nation. Through all ages, who has upheld the guiding principles of civilization under heaven? The traces of Yao, Shun, Yu, Tang, Wen, and Wu have faded, and simplicity and purity have declined. Thus, Heaven has ordained this to enlighten and initiate—His Lordship, illuminating the Dao and expounding its teachings, shines as brightly as the sun and stars. From this day forward, if lords and worthies revere the temple of the Lord Emperor, they will also honor His Lordship’s Dao and teachings. Those who cultivate virtue and engage in affairs will flourish within the harmony of ritual and music, and thrive under its transformative influence. Thus, they will neither fail their sovereign and parents above nor betray their studies below. Emerging as worthy ministers and chancellors, they will achieve great deeds, their ranks stretching endlessly—how could they merely vie in wielding brush and paper, competing in ornate words, to seek flattery and profit?\n\nAs the *Book of Songs* says: *\"Those who know me say I am troubled in heart; those who do not know me ask what I seek.\"* Herein lies what cannot be restrained.\n\nMoreover, as for the one who graces the imperial court with his presence, bestows pure blessings upon the people, ensures abundant harvests, dispels plagues, fosters harmony, and brings forth prosperity—doubling the talents of the world—it is the Lord Emperor of Wenchang, who assists the primordial, initiates transformation, governs official rank, and magnifies benevolence. The construction of his temple began in the *Tianli* year of *Wuchen* and was completed in the *Zhiyuan* year of *Jimao*. Though its towers and pavilions are not newly built, the worthy successors who come after are many. Amidst these affairs, a stele is erected to record this. Pressed by the requests of many scholars and moved by Lord Zhang’s long-standing devotion, I have thus written an outline, including the names of those who presided over its completion, the dates of the temple’s construction, and its origins near and far, so that later generations may have something to examine.\n\nIn the first year of *Zhizheng*, the year *Xinsi*, on an auspicious day in the fifth month of summer.\n\n**Exhortation to Respect Written Characters**\nAll scholars who belong to my register have come from reverence for written characters. For instance, in the Song dynasty, Minister Wang Yi’s father, upon seeing discarded written paper, would always gather and wash it with fragrant water before burning it. One night, he dreamed that the Sage Confucius patted his back and said: *\"How diligently you respect my written characters! I regret that you are already old and cannot achieve greatness, but in the future, I shall send Zeng Shen to be reborn in your family to bring honor to your household.\"* Soon after, he indeed had a son, whom he named Zeng, who later passed the imperial examinations as the top scholar. Though this event is distant, it serves as proof.\n\nI privately wonder at the people of this age, who claim to be learned yet do not cherish books. They regard the texts of Buddhism and Daoism as weighty as ten thousand *jun*, yet treat the characters of our Six Classics as light as goose down. Some use written paper to paste walls, make screens, wrap bedding, or seal windows; they trample it underfoot or use it to wipe filth. Such acts are no better than covering jars with it. Why do they hold Buddhism and Daoism in such reverence while treating our own teachings so lightly? Do they not know that the Three Teachings are fundamentally one, and that they forcibly create such distinctions?\n\nMoreover, our tradition has its own bureaus of good and evil to investigate and act, warning those who disrespect written characters. For example, those who toil in study for years may, in the examination hall, be dismissed by the authorities for a misplaced rhyme or a single erroneous character, never once having their names inscribed on the Tiger Board. This is the divine retribution for their lifelong disrespect of written characters. Yet scholars willingly accept this retribution, oblivious to its cause. Even worse, their descendants may become illiterate, and their entire families may suffer as a result. Though distant examples are not sufficient as warnings, let us speak of recent cases: In Luzhou, Yang Bixing sat on a classic text, and his entire family was afflicted with leprosy. In Chang Prefecture, Xianyu Kun defaced the *Mencius*, and his whole household perished. The retribution is clear and evident to all.\n\nYet Yang Quanshan, the elder brother of Yang Bixing, buried written characters and saw five generations of his family pass the imperial examinations. Li Zicai buried written characters and rose to high office in his lifetime. If one can heed and cherish such hidden rewards, how can one not stand in awe?\n\n**Exhortation to Scholars**\nThose who are intelligent, upright, and depend on others must still make choices. Those who are magnanimous, loyal, trustworthy, and fond of righteousness—these are the ones who carry on the tradition.",
      "overlap_context": "rejoice in its completion. The dignified, capped, and robed officials who stood in the center, attended and revered, were now embodied by Zhao Chengqing, the Surveillance Commissioner for Rectitude.\n\nFrom ancient times to the present, from Sword Gate to the towns and cities, temples were universally established to sacrifice to him. Even in the capital and the eastern regions of Shaanxi, some offered sacrifices, all revering Lord Zhang’s merits—but none matched the splendor of the present temple.",
      "start_char": 4447,
      "end_char": 5289,
      "start_sentence": 88,
      "end_sentence": 107,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.68146777153015,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\清河内传.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "故凭有感之精，衷曲示无声之教化，咨尔有众，听予格言。 盖闻富贵在天，得失有命，知之者，安於自然，而罔或控告，昧之者，贪於必得，而有所祈求。 或谓精神交而梦寐通，谓祭祀丰而神祇格，宫殿楼观，务碧瓦之翚飞，陛戟岩廊，夸朱栏之雕翠，从兹末务，失其本真。 不知进退，存亡系彼三班四属，行藏用舍，考慈五部六台，既有司存，岂容计取，然不可一拘於前定，天不可再昧於进修，故修身厉行者，未或降之百祥，反道败德者，神亦夺其五福，理所着者，人弗知之，是故运数冥符，而反受其殃，灾星显照，而或蒙其吉，造化以之倚伏，神明由是乘除。 凡厥儒流，恭行教法，汝等毋欺天远，毋谓神幽，毋言暗室可欺，毋道明庭可畏，毋凌孤寡，毋悔老成，毋取不义之财，毋淫非己之色，毋厚结他人而亲戚歧路，毋义交异姓而兄弟阋墙，毋恃己长，毋攻人短，毋傲逸乐，毋纵游畋，毋负才名，毋挟官贵，毋厚仙释而薄於父母，毋敬鬼神而慢於师资。 苟有负於吾言，端不逃於天宪，故平生俊彦者，屡困於场屋，一旦精明者，遽登於乡书，皆有寅缘#1，固非造次，世之腹诽心谤者，往往得以藉口，人之面誉背毁者，攸攸姑以欺亲，彼司文衡而岂得以私，此权禄籍，而故先有取，济济多士，天其或者临之，巍巍成功，吾则是之，取尔播告中外，咸使闻知。 科举取士，不止一端，要在得人以副众望，一以阴功孝行为上，次以处己谦和为贤，苦学者则酬其劳，高才者则遂其志，傲忽者则未免黜落，轻薄者姑示劝惩，文章假之以定其去留，神明司之以公其予夺，人不自省明示训言，尝谓惟士无能，苦学为能，居贫曷富，成名即富，士无分於贵贱，人切在於勤劳，凡大比，先较德业之短长，故有司始定文章之优劣，不可谓前定，而不能力学，岂可以宿缘而自怠操修，名虽曰士，初无士行之寸长，身虽曰儒，徒为儒服之观美。 不敬天地，不信神明，狎侮老成，轻慢前辈，违逆父母，而逸乐度日，息忽师长，而放荡无时，试不遂，则罪有司之不公，榜初张，则谓庸流之滥得，责人者不能於责己，议人者乃所以议天，或恃己之见而遏人之能，或衒己之长而攻人之短，或矜所学而忽略一世，或恃一解而轻视众人，立身不正，则以暧昧贪饕为能，用心不刚，则以机巧变诈为胜，较短论长，而不从公道，夺彼予此，而不恤人言，面誉背毁，而求苟合於人，口是心非，则绝不容於物外，貌虽慈祥，徒巧言而美语，中情多狠暴，好潜贼而阴谋，不择乎 友，而交不义之朋，不和其室，而淫非己之色，舍己田耘人田，失云多矣 ，作无益害有益，损孰甚焉",
      "translated_text": "Thus, relying on the essence of responsive sincerity, I reveal in silence the teachings of the voiceless transformation. Hearken, all you assembled, to my admonitory words.\n\nI have heard that wealth and honor lie with Heaven, while gain and loss are decreed by fate. Those who understand this rest in naturalness and make no appeals; those who do not grasp it covet certainty and make supplications. Some say that when spirit and essence commune, dreams and waking visions align; that when sacrifices are abundant, the gods and spirits descend; that palaces and towers must flaunt soaring green-tiled roofs; that steps and corridors must boast carved crimson railings—yet in pursuing such trivialities, they lose their fundamental truth. Unaware of when to advance or retreat, their survival or ruin hangs upon the Three Offices and Four Registers; their acceptance or rejection, their rise or fall, are examined by the Five Bureaus and Six Terraces. Though these records exist, how can one calculate and seize them? Yet one must not be bound by predestination, nor may one remain blind to self-cultivation. Thus, those who refine their conduct and strive in virtue shall not lack the hundred blessings, while those who violate the Dao and corrupt their power shall have the five fortunes snatched away. Though the principles are manifest, people remain unaware: when fate and numbers mysteriously align, one may suffer calamity; when baleful stars shine forth, one may yet encounter fortune. Creation’s fluctuations follow this pattern, and the divine luminaries thus add or subtract.\n\nAll you scholars, reverently practice the teachings and laws. Do not deceive Heaven by claiming it is distant; do not dismiss the spirits as obscure. Do not say that dark chambers can be deceived, nor that only the bright court must be feared. Do not bully the orphaned and widowed; do not slight the elderly and accomplished. Do not seize wealth that is not rightfully yours; do not lust after another’s spouse. Do not cultivate close ties with outsiders while estranging kin; do not form righteous bonds with strangers while sowing discord among brothers. Do not rely on your strengths; do not attack others’ weaknesses. Do not indulge in arrogance and pleasure; do not give free rein to hunting and wandering. Do not squander your talent and reputation; do not wield official power to oppress. Do not venerate immortals and Buddhists while slighting your parents; do not revere ghosts and gods while disrespecting your teachers.\n\nShould any defy these words, they shall not escape Heaven’s decree. Thus, those of outstanding talent may repeatedly fail in the examination halls, while those of sudden clarity may swiftly pass the provincial exams—all due to hidden affinities, not mere happenstance. Those who secretly slander in their hearts often find pretexts, while those who praise to one’s face yet defame behind their back merely deceive their kin. How could the arbiters of literature act with partiality? The registers of rank and emolument are not arbitrarily bestowed. O multitude of scholars, Heaven may yet oversee you. O towering achievements, I thus affirm them.\n\nProclaim this widely, that all may hear and know: the selection of scholars through examinations is not confined to a single method. The essential aim is to obtain men who fulfill the people’s expectations. First, hidden merit and filial conduct are paramount; next, modest and harmonious self-conduct is deemed worthy. Those who study diligently shall be rewarded for their labor; those of exceptional talent shall have their aspirations fulfilled. The arrogant and negligent shall not escape demotion; the frivolous shall be shown both encouragement and punishment. Literary works shall determine their advancement or removal, while the divine luminaries shall impartially govern their bestowal or deprivation.\n\nPeople do not reflect on their own faults, so I now declare these instructive words: I have often said that scholars possess no inherent ability—only diligent study makes them capable. Though poor, how can one not grow rich? To achieve renown is to become rich. Scholars are not divided by noble or base status; what matters is their industry. In every grand examination, moral conduct and learning are first compared, and only then do the examiners assess the quality of their compositions. One cannot claim predestination as an excuse for failing to study diligently, nor may one rely on past affinities to slacken in self-cultivation. Though called scholars, they may lack even an inch of scholarly virtue; though clad in the robes of Confucians, they may merely present an outward appearance of beauty.\n\nThey disrespect Heaven and Earth, disbelieve in the divine luminaries, mock the elderly and accomplished, and slight their elders. They defy their parents and idle in pleasure; they neglect their teachers and indulge in dissipation. When they fail the exams, they blame the examiners for injustice; when the results are posted, they call the successful mediocre. Those who demand much of others fail to demand it of themselves; those who criticize others thereby criticize Heaven. Some rely on their own views to suppress others’ abilities; some flaunt their strengths to attack others’ weaknesses. Some boast of their learning while disregarding the world; some cling to a single insight while belittling others. Those who conduct themselves improperly regard greed and avarice as skill; those whose resolve is weak prize cunning and deceit as victory. They compare strengths and weaknesses without fairness; they seize from one to give to another, heedless of others’ words. They praise to one’s face yet defame behind their back, seeking to ingratiate themselves; they speak approval while harboring opposition, leaving no room for tolerance. Though their demeanor may seem kind, they merely craft fine words; though their hearts may brim with cruelty, they delight in secret schemes and hidden plots. They choose friends without discernment, befriending the unrighteous; they sow discord in their households, lusting after others’ spouses. Abandoning their own fields to plow another’s, they lose much; engaging in the useless to harm the useful, what could be more damaging?",
      "overlap_context": "r of Yang Bixing, buried written characters and saw five generations of his family pass the imperial examinations. Li Zicai buried written characters and rose to high office in his lifetime. If one can heed and cherish such hidden rewards, how can one not stand in awe?\n\n**Exhortation to Scholars**\nThose who are intelligent, upright, and depend on others must still make choices. Those who are magnanimous, loyal, trustworthy, and fond of righteousness—these are the ones who carry on the tradition.",
      "start_char": 5289,
      "end_char": 6287,
      "start_sentence": 108,
      "end_sentence": 117,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.722278118133545,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\清河内传.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "。 预乡荐者，自为志得意满，不复进修，入省闱者，例曰功成名遂，直可唾取，恃才傲物，挟长欺孤，常交贵结援，而每夸等流，以双字片文，而蔑无同辈，在市道，则和合贸易以觊其所得，遇州县，则斗合争讼以满其所求，不忠不孝，甘心冒法而喜为非礼，非仁直情，径行而弗顾，游畋无度，博奕废时，耽饮而自丧其神，逞威而乃败於德，致屡困於场屋，安敢望於荣华，况三年初无伏案之功，而一旦遂萌登科之望，稍无成，直归之命运，才有力，专务於祷祈，不知天宪之难逃，深恐人心之愈惑，出处语默之际，天必察之，进退予夺之间，神所司者，岂容幸取，不可计求，苟有行业之可书，奚患飞腾之不遂。 迩者营业相传之后，屡有声名，儒冠世守之家，反被黜落，不知营业之子，安分读书，无形颜色，每见儒冠之后，自恃名族，多有骄矜，神明公取，专激励於轻薄之流，天道左旋，用奖予於淳朴之士。 若能自悟，晦迹韬光，望欲有成，劳心苦志，曲尽阴功之事，务存忠孝之心，返乎上古淳朴之风，无流末劫偷薄之俗，自然诗礼传家，科名复旧，谦和处己，气象如初，天不负人，人宜力学，凡为士者，各宜戒之。 老君降生之辰，玉帝御太极之殿修文郎颜公书。 清河内传竟",
      "translated_text": "Those who pass the provincial examinations grow complacent, believing their ambitions fulfilled, and no longer cultivate themselves further. Those who enter the metropolitan examinations take success and fame as theirs for the spitting, relying on talent to scorn others, flaunting their seniority to bully the solitary. They habitually curry favor with the powerful and boast of their peers, dismissing all equals with a mere couplet or fragment of prose. In the marketplace, they collude in trade to covet gains; before magistrates, they conspire in litigation to satisfy their demands. Disloyal and unfilial, they willingly flout the law and delight in impropriety. Devoid of benevolence and uprightness, they act without restraint. They roam and hunt without measure, squander time on gambling and games, drown themselves in drink to the ruin of their spirit, and wield power only to corrupt their virtue. Repeatedly humiliated in the examination halls, how dare they hope for glory? Having put forth no effort in three years of study, they suddenly entertain the vain hope of passing the imperial examinations. When they fail, they attribute it to fate; when they succeed, they ascribe it solely to prayer. Unaware that Heaven’s decree cannot be evaded, they deepen the delusion in men’s hearts. In every word and silence, action and withdrawal, Heaven observes; in every promotion and demotion, bestowal and deprivation, the gods preside. How can one seize fortune by luck or scheme? Yet if one’s conduct and deeds are worthy of record, why fear failure to ascend?\n\nOf late, the descendants of merchant families, inheriting their forebears’ enterprises, have gained renown, while the heirs of scholarly lineages, who once wore the Confucian cap through generations, have been cast aside. The sons of merchants, content in their station, devote themselves to study without pretense; the scions of scholarly families, however, trusting in their noble lineage, grow arrogant and haughty. The divine and enlightened select impartially, often spurring the frivolous to reform, while the Way of Heaven turns leftward, rewarding the honest and unadorned.\n\nIf one can awaken to this truth, conceal one’s light, and bide in obscurity, then with diligent effort and suffering resolve, one may fulfill every act of hidden merit, uphold loyalty and filial piety, and return to the unadorned customs of high antiquity, shunning the degenerate ways of the latter age. Naturally, the transmission of poetry and ritual will endure, and scholarly honors will be restored. Conducting oneself with humility and harmony, one’s bearing will return to its original state. Heaven does not fail those who strive; scholars must apply themselves earnestly. Let all who would be gentlemen take heed.\n\nWritten by the Literary Gentleman Yan on the birthday of Lord Lao’s descent into the world, as the Jade Emperor presided over the Palace of the Great Ultimate. Here ends the transmission from Qinghe.",
      "overlap_context": "pproval while harboring opposition, leaving no room for tolerance. Though their demeanor may seem kind, they merely craft fine words; though their hearts may brim with cruelty, they delight in secret schemes and hidden plots. They choose friends without discernment, befriending the unrighteous; they sow discord in their households, lusting after others’ spouses. Abandoning their own fields to plow another’s, they lose much; engaging in the useless to harm the useful, what could be more damaging?",
      "start_char": 6287,
      "end_char": 6773,
      "start_sentence": 118,
      "end_sentence": 123,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.209023237228394,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\清河内传.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "#1『寅缘』，当为『夤缘』之误。",
      "translated_text": "\"#1 'Yin Connection' should be corrected as 'Yin Connection' (夤缘).\"",
      "overlap_context": "smission of poetry and ritual will endure, and scholarly honors will be restored. Conducting oneself with humility and harmony, one’s bearing will return to its original state. Heaven does not fail those who strive; scholars must apply themselves earnestly. Let all who would be gentlemen take heed.\n\nWritten by the Literary Gentleman Yan on the birthday of Lord Lao’s descent into the world, as the Jade Emperor presided over the Palace of the Great Ultimate. Here ends the transmission from Qinghe.",
      "start_char": 6773,
      "end_char": 6791,
      "start_sentence": 124,
      "end_sentence": 124,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 1.099478006362915,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\清河内传.txt",
        "category": "谱箓类"
      }
    }
  ]
}