{
  "source_id": "灵宝六丁秘法",
  "source_file": "chunked_daozang\\灵宝六丁秘法.json",
  "total_chunks": 7,
  "total_original_chars": 5066,
  "total_translated_chars": 28863,
  "total_translation_time": 148.2197494506836,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\众术类\\灵宝六丁秘法.txt",
    "category": "众术类"
  },
  "full_translation": "**The Esoteric Method of the Six Ding of the Numinous Treasure**\n\n*Scripture Title:* The Esoteric Method of the Six Ding of the Numinous Treasure. Author unknown. One fascicle.\n*Source Text:* *Daoist Canon of the Zhengtong Era*, Dongxuan Section, Category of Miscellaneous Arts.\n\n---\n\nThe Esoteric Method of the Six Ding of the Numinous Treasure\n\nThe Yellow Emperor said: When the primordial qi divided, yin and yang found their places, the Five Phases were aligned, and the Six Jia were born. Thus, one Jia encompasses ten spirits, and the Six Ding are the deities who preside over the ten-day cycles of the Six Jia.\n\nThese spirits originated with Heaven and Earth, yet when the battles against Chiyou proved futile, they threw the cosmic order into chaos. Thereupon, the Emperor purified himself, performed rites with utmost reverence, and supplicated the Supreme Mystery. Moved by his devotion, the Mysterious Maiden of the Nine Heavens descended and bestowed upon him this true method, enabling him to repel misfortune and aid all beings for the benefit of humankind.\n\nThe Yellow Emperor cultivated this method and achieved victory over Chiyou. He inscribed talismans in plain white script and concealed them in renowned mountains. Later generations have repeatedly encountered them.\n\nThis method possesses numinous efficacy, which cannot be fully expounded. Should one transmit it carelessly or treat it with irreverence, thereby offending the true spirits, both parties shall suffer calamity.\n\nThis Daoist gate of method is a wondrous formula for delivering the world. Ancient renowned generals all received this transmission. Thus, they could foresee victory or defeat, discern good and ill fortune in advance, and clearly distinguish the wise from the foolish—all with divine assistance.\n\nIf one is not a heroic and enlightened person, or lacks predestined affinity with the Dao, they should not engage with this text, lest they waste their years in vain.\n\nThe Yellow Emperor said: The names of the Six Jia, Six Ding, and the divine maidens must first be purified with clean water to dispel impure qi before one may unroll the scripture, make offerings, and recite prayers to examine it. Should one violate this, misfortune shall extend to the nine generations of ancestors, and they shall be eternally enslaved by the Three Officials. Moreover, their heads may be mutilated, their forms destroyed, and they must never recklessly disclose this to those unworthy of the Dao.\n\nHe who transmits this must do so as if serving a strict teacher. Guard your speech and do not disseminate it carelessly. Refrain from taking life in vain, constantly practice hidden virtue, and cultivate a compassionate heart to save all beings. Always observe these precepts, refrain from idle speech, and make offerings to invoke the spirits. Thus, you shall foreknow future events, perceive the signs of things ten thousand miles away, and comprehend even the subtlest intentions—every action and movement shall be known.\n\nIf you have matters to attend to, divine and inquire of them, and the answers shall be immediately revealed.\n\nTo summon the Six Ding spirits: Dengming and Hekui are invoked on a *ding-mao* day in the third spring month; Taiyi and Tiangang, on a *ding-hai* day in the third autumn month; Chuansong and Xiaoji, on a *ding-you* day in the third summer month; Gongcao and Daji, along with Shenhou, on a *ding-chou* day in the third winter month. If the day falls on *ding-wei* or *ding-si*, when their power is at its peak, they may be summoned in pairs to descend among men. To discern good or ill fortune, invoke them and inquire—they shall answer at once.\n\n**Method of Offering and Invocation**\nFor the offering, prepare a clean mat, a new cloth towel, six portions of dried venison, six portions each of chestnuts and jujubes, six measures of fine wine, six measures of ghee and honey, one censer of incense, and six candles. Sweep a room clean, arrange the offerings, and sit quietly for a time. Speak softly so none may overhear, meditate upon the spirits for a while, then recite the invocation:\n\n\"Six Ding Jade Maidens, attend me and my master,\nSurvey the world, ensure all undertakings prevail,\nFathom past and future, repel noxious *qi*,\nDispel misfortune.\nBe my companions, and I shall honor you always,\nOffering wine, food, and dried meats,\nGranting every wish without fail.\nThose who seek the Dao and immortality,\nOr request aid in refining elixirs,\nShall attain their desires.\nMay divine immortals descend and unite with the true Way.\"\n\n*Hasten as the command of the Most High!*\n\n**Method of Invoking the Six Ding with Talismans**\nPrepare a clean mat, a six-foot cloth towel, six portions each of dried venison, wine, fruit, and fried cakes, and one censer of incense. Sweep a room clean and arrange the offerings. From the *jiazi* day, observe abstinence for three days. In a secluded chamber, burn incense, pray with utmost sincerity, and make your vows. On the day of the Six Ding, at the hour of *hai*, face the direction of their current dominance and inscribe the images of the Six Ding spirits and their talismans, laying them upon the mat. Light incense, bow deeply toward the east, and click your teeth thirty-six times. Recite the incantation:\n\n\"Nurtured by Heaven, born of Earth,\nReceiving the divine talisman, one may attain long life.\nImmortal beings assist me, Jade Maidens sustain my form,\nThe twenty-eight constellations record the names of the stars.\nThe Five Directions, the Five Colors—black and white, red and blue,\nThe Yellow Emperor of the Center—all accompany me.\nAfter receiving the talisman, may all wishes be fulfilled,\nVanquishing all malevolent spirits.\nThose who know not their own truth shall not claim mine;\nThose who know not their own divinity shall not claim mine.\nAdvance to be enfeoffed as a marquis,\nOr retreat to be beheaded.\n*Hasten as the law commands!*\"\n\nTo craft talismans, first purify oneself for three days—seven days is also acceptable. When inscribing the talisman, sit facing the auspicious direction, compose the mind in stillness, and maintain a demeanor as if in the presence of the divine. Recite the incantation:\n\n\"With reverence, I invoke the immortal officers of the Six Ding:\nThe Ding-mao spirit,\nThe Ding-you spirit of the Foot Day,\nThe Ding-hai spirit of Primordial Heaven,\nThe Ding-you spirit of Great Brightness,\nThe Ding-wei spirit of Salvation and Divine Efficacy,\nThe Ding-si spirit riding the purple clouds,\nThe Vermilion-Riding spirit of the *Canon*...\"\n\nThe *Canon* states: In practicing this method, one must maintain a sincere and devout heart, free from distracting thoughts. Then, swallow the talismans in sequence, and the practitioner’s heart will rejoice, as if enlightened.\n\nBy the next morning, inscribe and swallow another talisman. After seven days, retire to a secluded chamber, arrange an altar, and sit upright. Prepare one portion each of incense, flowers, lamps, and candles. Inscribe the talisman of one’s proper position and the names of the spirits, placing them upon the mat. Face east, click the teeth thirty-six times, and visualize the space between the five-colored clouds. Thereupon, the spirits will enter through the six gates and take their seats—do not gaze fixedly upon them. Simply concentrate the mind and present one’s wishes, and the prayer will surely be answered.\n\nIn ancient times, when Chiyou rebelled, the Yellow Emperor fought him repeatedly but could not prevail. The Emperor sighed, saying: \"I have heard that in the time of Fuxi, there were no weapons, yet the world was governed in clarity, heaven and earth were at peace, and all under heaven was tranquil. Now Chiyou is but a commoner, yet I attack him without just cause and cannot overcome him—this is my failing.\" Before his lament had ceased, he suddenly beheld five-colored clouds descending from the sky. Within the clouds, two youths held a golden casket, and behind them, six immortal maidens appeared together, bearing the sacred command of the Nine Heavens Mysterious Maiden. They bestowed upon the Emperor the source of creation, the fortunes and misfortunes of heaven and earth, the waxing and waning of the eight trigrams, the transformations of wind and clouds, the success and failure of climatic qi, the victory and defeat of sun and moon, the gains and losses of yin and yang, the auspiciousness and inauspiciousness of the stars, the compliance and defiance of human affairs, and the principles and methods of transformation.\n\nThe Emperor knelt in reverence to receive the gift. The youths ascended upon floating clouds and departed, and the six immortal maidens vanished. The Emperor then received the casket but dared not open it at once. He swiftly swept a chamber clean, purified himself for three days, and only then opened the casket. Within, he found a manual on the Six Ding, its upper scroll detailing the methods of offerings and sacrificial rites; the middle scroll expounding the Dao of long life and immortality; and the lower scroll teaching the arts of military strength, victory in battle, and the divination systems of Dunjia and Liuren.\n\nThe Method of Corpse-Liberation Taught by the Mysterious Woman. The Emperor followed the text with reverence and practiced it. Within ten days, he felt his body transformed, able to walk and fly. He again engaged Chiyou in battle, vanquishing him with a single drumbeat and driving him back to the source of Zhuolu. Was this not the result of obtaining the essence of primordial qi and dispelling the demonic miasma? Later, sensing the realm purified, heaven and earth restored to their proper places, and yin and yang maintaining their order, the Emperor cultivated the arts of long life and immortality. He personally composed a scroll titled *The Hidden Talisman Classic*, concealing its essential secrets. Thereafter, the Emperor ascended to heaven in broad daylight.\n\nThe *Hidden Talisman* states: The divine mechanisms of the Eight Trigrams and the Jiazi cycle conceal the workings of ghosts and spirits—this is the evolution of the Six Ding and Dunjia, the art of military strength and victory, derived from the Mysterious Woman of the Nine Heavens.\n\n**The Six Ding Concealment Method**\nThe Six Ding are the true spirits of heaven and earth, unlike ordinary deities. The Azure Dragon, Bright Hall, and Great Yin—these spirits constantly accompany the Jade Maidens, serving within heaven and earth. If one wishes to conceal oneself, rendering oneself invisible to all things:\n\nWhen the Azure Dragon reaches the Jade Maiden, one becomes unseen. To conceal oneself, hold a blade in the left hand and close the mouth, while the right hand traces a four-sided diagram. If evil persons are outside, draw the diagram six paces within the door. If they are within the door, draw it six paces in the courtyard. If they are in the central courtyard, draw it six feet within the chamber. If in the fields, draw it six *zhang* wide. Use counting rods one *chi* and two *cun* in length, following the Azure Dragon’s path in sequence, placing the rods straight until reaching the Gate of Heaven. Then, with the right hand, lay a rod horizontally to seal the Gate of Heaven and depart. Once the Gate of Heaven is sealed, the body is concealed. For each counting rod, visualize one person; when the Jade Maiden reaches the Great Yin and halts, imagine that outsiders can no longer see you.\n\nThe method states:\nDwell in the Azure Dragon, traverse the Star of Peng,\nPass through the Bright Hall, rest in the Great Yin,\nExit through the Gate of Heaven, enter the Earthly Door,\nHide beneath the Floral Canopy, conceal with the Jade Maiden.\n*Swiftly, swiftly, as the statutes of the Supreme Lord command.*\n\nOn Dingmao days, conceal the body; on Dingsi days, conceal fate; on Dinghai days, conceal emolument; on Dingyou days, conceal the soul; on Dingwei days, conceal the spirit; on Dingchou days, conceal essence and spirit. For all matters on Six Ding days, recite the incantation six times:\n*\"Ren Gao protects me, Dingchou guards me, Ren He delivers me.\nDingyou preserves me whole, Ren Can governs the soul, Dingsi nurtures the spirit.\nGreat Yin and Floral Canopy, Earthly Door and Gate of Heaven.\nI tread the Yu Steps, O True Person of the Mysterious Woman,\nBright Hall seated or reclining, conceal and hide the body.\nSwiftly, swiftly, as the statutes of the Mysterious Woman of the Nine Heavens command.\"*\n\nFor all offerings, consume them yourself; do not share with outsiders. Be ever cautious. On every Jiazi day, observe a day of purification.\n\n**The Jade Maidens of the Six Ding:**\n- **Dingmao Jade Maiden:** Named Wenbo, styled Ren Gao. The spirit wears a crown and ritual robes, holding a lotus in hand, clad in red above and blue below. She descends to the human realm on Zichou days. To know good or ill fortune, summon and inquire of her.\n- **Dingchou Jade Maiden:** Named Wenjian, styled Ren Yang. The spirit holds a lotus in both hands, clad in red above and yellow below. She descends on Yinmao days. To know good or ill fortune, summon and inquire of her.\n- **Dinghai Jade Maiden:** Named Wentong, styled Ren He. The right hand holds a mirror to her heart, the left a lotus, clad in red above and purple below. She descends on Chensi days. To know good or ill fortune, summon and inquire of her.\n- **Dingwei Jade Maiden:** Named Shutong, styled Ren Ji. The left hand holds a mirror, the right a lotus, clad in red above and yellow below. She descends on Wuwei days. To know good or ill fortune, summon and inquire of her.\n- **Dingsi Jade Maiden:** Named Tingqing, styled Ren Shu. The left hand holds a lotus, the right a white folded cloth, clad in brocade above and red below. She descends on Shenyou days. To know good or ill fortune, summon and inquire of her.\n- **Dingyou Jade Maiden:** Named Wenqing, styled Ren Tong. The spirit cradles a child in her left arm, stroking its head with a white folded cloth in her right, clad in red above and white below. She descends on Xuhai days. To know good or ill fortune, summon and inquire of her.\n\nThe Yellow Emperor said: The Six Ding spirits each have distinct names and styles. To employ them, call each by name, and their divine efficacy will manifest.\n\nThe immortal scriptures state: The names of the Six Ding Jade Maidens may seem small, yet calling their names enables their use—all wishes will be granted.\n\n**The Twelve-Hour Concealment Method with Counting Rods**\nThe song says:\nThe rat, losing its burrow, enters the dog’s market;\nThe ox enters the rabbit’s garden, halted by the cat.\nThe fierce tiger leaps to the south, reaching Si;\nThe rabbit enters the ox’s pen and lies still.\nThe dragon enters the horse’s stable to eat sweet grass;\nThe victorious snake coils, coming to Shen.\nThe horse enters the dragon’s spring to drink sweet water;\nThe sheep and chicken enter You together.\nThe agile monkey rises within the door’s wall;\nThe chicken flies and alights in the sheep’s pen.\nThe dog comes, the rat enters the Kan burrow;\nThe wolf blocks the east, drawn by the tiger.\n\nBefore each outing, recite the incantation:\n*\"Heaven overturns, earth overturns, heaven overturns, earth overturns,\nThe nine paths are all blocked.\nShould anyone come pursuing me, let them be confounded here.\nLet east become west, south become north.\nThose who come by chariot, break their axles;\nThose who come on horseback, cover their eyes;\nThose who come on foot, swell their feet;\nThose who come with weapons shall prostrate themselves and dare not rise.\nThe Bright Star and Northern Dipper repel the enemy.\nThose who pursue me for ten thousand li shall perish; those who seek me shall halt.\nThe Oxherd and Weaver Girl transform into rivers and seas.\nSwiftly, swiftly, as the statutes command.\"*\n\nAfter reciting, place the counting rods with the left hand, tread the Yu Steps, close the qi, and depart.\n\n**The Jade Maiden Incantation**\n*\"The Jade Maiden, celestial spirit, has arrived,\nEver attending my journey,\nTo such-and-such a place.\nVast and obscure, none perceive her form.\"*\n\nNone hear her voice, no ghost sees her essence.\nThose who favor me gain fortune; those who harm me meet calamity.\nGhosts and bandits who oppose me die; those who encounter me perish.\nA thousand, ten thousand people see me and rejoice.\nSwiftly, swiftly, as the statutes command.\n\nUpon reciting, immediately perform the door-closing method:\nWith the left hand, hold a blade and draw a line upon the earth to sever it, close the qi, and depart.\n\n**Boundary Method**\nWithin the chamber: six feet.\nWithin the courtyard: six paces.\nBeyond the gate: sixty paces.\nIn the wilds: six hundred paces—or six li.\nBefore each journey, invoke the Jade Maiden of the current旬 to protect me, lest the hundred ghosts harm me.\nLet no one see me; those who do become firewood.\nOpen only my door, and close all others.\n\n**General Incantation**\n\"I am the Celestial Eye, the Celestial Countenance,\nPursuing spirits like thunder and lightning,\nRadiant to the eight directions,\nPiercing sight within and without—\nNo being dares defy me.\nSwiftly, swiftly, as the statutes command.\"\n\n**Yu Steps and the Way of Silence**\n**Six Ding Silent Ten-Thousand-One Method** (also called the *Xuanyuan Formula*)\nFirst, burn incense and purify with clean water to dispel impure qi. Only then open the scroll, make offerings, and read.\n\nLong ago, the Daoist Zhang Qun, aspiring to the Daoist arts, cultivated for many years, yearning for purity and emptiness. While perusing immortal secrets in leisure, he suddenly stood in the moonlit courtyard at the second watch of a *ding-chou* night. He saw a five-colored cloud approaching from the southwest, drawing nearer with the sound of marching footsteps. Suddenly, a woman appeared within the cloud, saying: \"I am the Six Ding Jade Maiden, the *ding-chou* maiden.\"\n\nZhang Qun knelt and bowed deeply in reverence. The maiden said: \"You have long admired the immortal Dao. I know your purity and slight inclination toward the profound. Thus, I come to transmit to you the wondrous gate of learning the Dao—though you lack the destiny of an immortal. If you fast and purify yourself for a hundred days, set up a brocade canopy in your chamber, and complete the hundred-day fast, I will return to teach you the method.\"\n\nZhang Qun fasted and purified himself for a hundred days, then set up a brocade canopy in his chamber. At the third watch of the night, as before, a procession arrived from the south within the clouds. First appeared two youths, bearing a golden casket, saying they offered the arts of cultivation. Zhang Qun received the golden casket, which contained the *Scripture of the Six Ding* in three scrolls: the upper scroll expounded the methods of sacrifice and ritual; the middle scroll, the arts of the Jade Maiden’s concealment; the lower scroll, the techniques of flying and hiding the body, the sword, the Maiden’s Return of Essence, and the *Dun Jia* and *Liu Ren* arts.\n\nThe immortal maiden said: \"You lack the destiny of an immortal, but by diligently practicing these methods, after three years you may become a stubborn immortal of the earthly realm. A lifespan of one thousand two hundred years is called a stubborn immortal. These writings are the celestial secret formulas—only a gentleman with prior karmic ties to the Dao may encounter them.\"\n\nThe method states: To cultivate the art of concealment, one must be benevolent and aid all beings. To practice the sword arts and the ways of the chivalrous immortal, one must be upright, renounce wealth and lust, act with valor, walk alone in righteousness, and always practice compassion. After a year of cultivation, merit will accrue. To practice the Maiden’s Return of Essence, one must treat others with equality, filial piety, and kindness, never deceiving or acting falsely. After a year of practice, the art will be accomplished, granting a lifespan of a thousand years and the attainment of a stubborn immortal.\n\nZhang Qun cultivated these arts and transmitted them to Guiguzi, who, after less than three years, mastered myriad transformations, becoming peerless. Later generations who practice this method must have a heart aligned with the Dao; only then may they receive these teachings. If one encounters these secret arts and, though of humble talent, learns to conceal the body, one is already half a sword immortal. To fully embody chivalry, one must vow to be loyal and filial, repay kindness and uphold righteousness, never oppressing others. To slay the wicked and return to righteousness, one must first master concealment.\n\nThereafter, within a chamber, arrange a forest altar, burn incense, and maintain purity. No others may come and go. When rising or resting, first spread a mat before the altar, fast, burn incense, purify with clean water, meditate to dispel impurities, and make offerings to the Six Ding Jade Maidens. Perform the sacrifice on a *ding* day. At night, sit upright on the bed, close the eyes, and visualize: the bed as the altar table, the head facing west. Wear the Six Ding Jade Maiden’s seal, which is the seal of the Nine Heavens Mysterious Woman, overseer of the Jade Maidens.\n\n**Visualization of the Seal**\nFirst, visualize the northeast seal. The *ding-mao* Jade Maiden stands at the seal’s corner, wielding a green serpentine sword. Next, the *ding-si* Jade Maiden stands at the southeast corner, wielding a yellow or white serpentine sword. Then visualize the southwest seal. The *ding-wei* Jade Maiden stands at the seal’s corner, wielding a white or yellow sword. Next, the northwest seal. The *ding-chou* Jade Maiden stands at the seal’s corner, wielding a black or yellow sword. Then, the *ding-you* and *ding-hai* Jade Maidens stand to the left and right, each wielding a green or yellow serpentine sword.\n\nAfter visualization, softly recite the incantation one hundred and eighty times. Then, the *ding-you* and *ding-hai* Jade Maidens at your side enter your heart directly through the nose—the nose is the human gate. Next, visualize the *ding-mao* Jade Maiden at the northeast corner entering through the left ear to the southeast corner. Then, in order: the *ding-mao*, the *ding-wei* at the southwest, the *ding-chou* at the northwest, and the *ding-you* and *ding-hai*. They stand at your side and upon the seal, entering the heart directly. The left ear is the wind gate. Next, visualize the *ding-si* Jade Maiden at the southeast corner entering the heart through the right ear—the right ear is the ghost gate. Then, the *ding-wei* Jade Maiden at the southwest corner enters the heart through the mouth—the mouth is the earth gate. Finally, the *ding-chou* Jade Maiden at the northwest corner enters the heart through the eyes—the eyes are the celestial gates. Complete each visualization.\n\nWhen walking, standing, sitting, or lying down, always wear the seal on the left hand and never remove it. For major or minor matters, remove the seal and place it in a clean location; upon returning, wash the hands before reattaching the seal.\n\nIf in nightly dreams you ascend mountains, enter water, encounter violent slayings, or see a woman nearby, do not be alarmed or frightened—this is the Jade Maiden descending in bodily form.\n\n**Nine Heavens Mysterious Maiden Seal Formula:**\nUse *longjing* jujube wood and place it in a basin of water; if the wood floats and moves of its own accord, it is a true encounter. On the *jiazi* day, burn incense and carve the seal yourself—let no one witness it. Exercise utmost caution.\n\nThe seal formula is as follows:\n\n**Ding-mao Jade Maiden Talisman**\nThe Jade Maiden on the right is named Wenbo, styled Rengao. Her left hand strokes the child’s head; the child is unclothed.\n\n**Ding-chou Jade Maiden Talisman**\nThe Jade Maiden is named Wengong, styled Rengui. Her right hand has two fingers curled and three extended.\n\n**Ding-hai Jade Maiden Talisman**\nThe Jade Maiden on the right is named Wentong, styled Renhe. Her left hand has two fingers curled and three extended.\n\n**Ding-wei Jade Maiden Talisman**\nThe Jade Maiden on the right is named Shutong, styled Renfu. Her left hand holds a mirror, her right hand a lotus.\n\n**Ding-si Jade Maiden Talisman**\nThe Jade Maiden on the right is named Tingqing, styled Renshu. Her right hand holds a fan in the *dhyāna* mudrā.\n\n**Ding-you Jade Maiden Talisman**\nThe Jade Maiden on the right is named Wenqing, styled Renxiu. She stands upright with hands folded, riding upon colored clouds.\n\nBy cultivating the true method of *shijie* (corpse liberation), one may move through the world unimpeded; otherwise, the Dao cannot yet be abandoned. Additionally, one must practice this method—merely transforming the body into mist, riding upon colored clouds to return to the Great Ultimate.\n\nThe *Tai Xi Yin Jing* states: \"The inner breath has no name; only through practice does it take form.\" If one does not uphold the precepts and enters *taixi* (embryonic breathing) prematurely, one will not attain union with the True.\n\nThe *Tai Wei Yin Shu* says: \"Whenever *taixi* is practiced among people, the *shijie* follows the transformation.\" On the *gengchen* day, at the *chen* hour, in a cold chamber, burn a censer of incense. Set up a small table by the bed, placing upon it an incense burner, a staff, shoes, and a covering. Arrange these by the bedside, remove the lower garments, and cover the body with the clothing. Face outward toward the west, visualize oneself as a dead person in the yin state, and recite the incantation seven times:\n\n*\"Celestial spirits of the mysterious,\nReceive the essence of living beings.\nSeven thoughts, seven summons—\nThe three hun follow and welcome.\nTake my form,\nLet form follow transformation,\nAnd manifest as the change demands.\nSwiftly, swiftly, as decreed by law!\"*\n\nAfter reciting the incantation, sleep as usual and maintain the visualization. After a long while, under no circumstances speak to others, or the method will fail. Diligently practice this method for forty-nine days, and the technique will gradually take form. When needed, whether walking, standing, sitting, or lying down, silently recite this incantation. As soon as you grasp an object, swiftly turn away and depart from others. People will see only the object you carried, believing you have already died. Later, when the object returns to its original form, this hidden method can assist in *shijie* within the mortal realm, allowing one to change form and escape calamity. However, it must not be used for unlawful purposes.\n\nFor those who wish to cultivate the body, absolute stillness and secrecy are essential—do not leak the method. If lying on the bed, simply cover the body with a blanket, silently recite the incantation seven times, and rise to leave. Others will see only the clothing on the bed, while your own body remains unseen. If used to deceive others for wealth or lust, the gods will diminish your lifespan, and the Great Dao will not permit it. Remember this a thousandfold—do not transmit it recklessly. Hold it in reverence and secrecy.\n\n**Postscript**\n\nEmperor Huang said: The Six Ding Jade Maidens of the gods can lengthen or shorten, can exist or vanish. With sincere heart, inquire of them, and all matters shall follow your will. They may divine the state of one’s body a thousand *li* away, or the news of ten thousand *li*. If you desire an object, act as you wish, and it shall instantly arrive. This method, when encountered, brings purity and fortune to one’s dwelling, keeps the five poisons and disasters at bay, grants immortality to those who seek immortality, office to those who seek office, and ensures descendants flourish without decline. Even the most subtle matters shall be attained. When you wish to employ them, they descend as rain upon the mortal realm, assuming their appointed duty. Should you desire to know fortune or misfortune, inquire of them, and divine verification shall surely come.\n\nThe affairs of the Ding-Chou Jade Maiden of the gods are like the laws of a sovereign—take care never to transmit them orally, nor to revile or insult her with foul speech. Simply make offerings and revere her, and you shall foreknow future events, discern the signs of ten thousand *li*, and grasp the subtleties of written messages. In times of urgent peril or disputes of the tongue, summon and inquire of her, and all shall be known.\n\nThose who study the Dao, if they do not encounter this method, have no means to achieve completion. In ancient times, all enlightened scholars who did not abandon it obtained this text, made offerings to it, and attained immortality. This method is of utmost value—worth ten thousand gold, not to be transmitted even between father and son. It is the wondrous secret of the true arcane text.\n\n*The Secret Method of the Six Ding of the Numinous Treasure* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "灵宝六丁秘法 经名：灵宝六丁秘法。 撰人不详。 一卷。 底本出处：《正统道藏》洞玄部众术类。 灵宝六丁秘法 黄帝曰：一炁既分，阴阳得位，五行配定，六甲生焉。 是以一甲，十神，共六丁者。 乃六甲旬直神，已与天地各生，自数战蚩尤不胜，乃紊乱纲纪。 遂斋洁虔行，敬仰告上玄，感降九天玄女，受此真诀，令却去凶害，济物利人。 黄帝修之，有功战蚩尤，即以素白篆符，藏诸名山。 后世人数数有之。 此法即有神功，不具说。 若人轻传慢易，冒触真灵，两具受殃。 此道法门度世奇诀，古者名将，皆受此诀。 是以逆知胜负，预晓吉凶，明是非圣贤，皆有神助。 若非英雄达士，宿有道缘，莫过斯文，枉淹岁月。 黄帝曰：六甲、六丁、神女名字，先以净水涤净秽气，然后乃得启卷，梼祝看之。 若有触犯，即殃及九祖，长役三官，亦且残首毁形，不得妄有漏泄於非道人。 从吾所戒，万愿从心矣。 此事传者如常，如事严师。 慎口勿传，一不枉杀生命，常行阴德，慈心救物，常慎行此，口勿杂言，但祭而使之，预知未来之意。 察万万里之验，委曲之旨，举止一一并知。 若有事，占而问之，立知之矣。",
      "translated_text": "**The Esoteric Method of the Six Ding of the Numinous Treasure**\n\n*Scripture Title:* The Esoteric Method of the Six Ding of the Numinous Treasure. Author unknown. One fascicle.\n*Source Text:* *Daoist Canon of the Zhengtong Era*, Dongxuan Section, Category of Miscellaneous Arts.\n\n---\n\nThe Esoteric Method of the Six Ding of the Numinous Treasure\n\nThe Yellow Emperor said: When the primordial qi divided, yin and yang found their places, the Five Phases were aligned, and the Six Jia were born. Thus, one Jia encompasses ten spirits, and the Six Ding are the deities who preside over the ten-day cycles of the Six Jia.\n\nThese spirits originated with Heaven and Earth, yet when the battles against Chiyou proved futile, they threw the cosmic order into chaos. Thereupon, the Emperor purified himself, performed rites with utmost reverence, and supplicated the Supreme Mystery. Moved by his devotion, the Mysterious Maiden of the Nine Heavens descended and bestowed upon him this true method, enabling him to repel misfortune and aid all beings for the benefit of humankind.\n\nThe Yellow Emperor cultivated this method and achieved victory over Chiyou. He inscribed talismans in plain white script and concealed them in renowned mountains. Later generations have repeatedly encountered them.\n\nThis method possesses numinous efficacy, which cannot be fully expounded. Should one transmit it carelessly or treat it with irreverence, thereby offending the true spirits, both parties shall suffer calamity.\n\nThis Daoist gate of method is a wondrous formula for delivering the world. Ancient renowned generals all received this transmission. Thus, they could foresee victory or defeat, discern good and ill fortune in advance, and clearly distinguish the wise from the foolish—all with divine assistance.\n\nIf one is not a heroic and enlightened person, or lacks predestined affinity with the Dao, they should not engage with this text, lest they waste their years in vain.\n\nThe Yellow Emperor said: The names of the Six Jia, Six Ding, and the divine maidens must first be purified with clean water to dispel impure qi before one may unroll the scripture, make offerings, and recite prayers to examine it. Should one violate this, misfortune shall extend to the nine generations of ancestors, and they shall be eternally enslaved by the Three Officials. Moreover, their heads may be mutilated, their forms destroyed, and they must never recklessly disclose this to those unworthy of the Dao.\n\nHe who transmits this must do so as if serving a strict teacher. Guard your speech and do not disseminate it carelessly. Refrain from taking life in vain, constantly practice hidden virtue, and cultivate a compassionate heart to save all beings. Always observe these precepts, refrain from idle speech, and make offerings to invoke the spirits. Thus, you shall foreknow future events, perceive the signs of things ten thousand miles away, and comprehend even the subtlest intentions—every action and movement shall be known.\n\nIf you have matters to attend to, divine and inquire of them, and the answers shall be immediately revealed.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 451,
      "start_sentence": 0,
      "end_sentence": 23,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.97738265991211,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\灵宝六丁秘法.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "登明河魁从魁春三月丁卯日摄之。 太乙天罡太冲秋三月丁亥日摄之。 传送小吉胜光夏三月丁酉日摄之。 功曹大吉神后冬三月丁丑日摄之。 若是丁未丁巳随日旺宜应之，各召而使之，两两下在人间，要知吉凶，召而问之，即说也。 祭醮法 凡欲祭醮，先用不触净席一领，新布巾一条，鹿脯六分，栗子、枣子六分，新美酒、酥蜜六合，香一炉，烛六枝。 先酒扫地一室，铺置讫，少坐细说，勿使人闻，思神良久，方可祝之曰： 六丁玉女与我师，按行天下，举事必胜，洞晓往来，邪炁不侵，辟除不祥。 与子为友，我常祀汝，饮酒食菜脯，随其所愿，不得有违。 学道求仙，随心所请，烧丹炼药，必得遂成。 愿降神仙与道合真。 急急如太上律令。 祭醮六丁符法 用净席一领，手巾一条六尺，鹿脯、酒、果煎饼各六分，香一炉，洒扫一室，铺排讫。 从甲子日斋戒三日，於冷室烧香，虔心祷祝发愿。 至六丁日亥时，向旺方书六丁神像并符，皆布於席上，焚香稽首向束方，叩齿三十六通。 咒曰： 天之所育，地之所生，上受神符，可以长生。 仙人辅己，玉女佐形，二十八宿记列星名。 五方、五色、黑白、赤青、中央、黄帝，与我俱并。 受符之后，所愿如意，破灭群精。 自知不真，勿当吾真； 自知不神，不当吾神； 前去封侯，后出斩首。 急急如律令。",
      "translated_text": "To summon the Six Ding spirits: Dengming and Hekui are invoked on a *ding-mao* day in the third spring month; Taiyi and Tiangang, on a *ding-hai* day in the third autumn month; Chuansong and Xiaoji, on a *ding-you* day in the third summer month; Gongcao and Daji, along with Shenhou, on a *ding-chou* day in the third winter month. If the day falls on *ding-wei* or *ding-si*, when their power is at its peak, they may be summoned in pairs to descend among men. To discern good or ill fortune, invoke them and inquire—they shall answer at once.\n\n**Method of Offering and Invocation**\nFor the offering, prepare a clean mat, a new cloth towel, six portions of dried venison, six portions each of chestnuts and jujubes, six measures of fine wine, six measures of ghee and honey, one censer of incense, and six candles. Sweep a room clean, arrange the offerings, and sit quietly for a time. Speak softly so none may overhear, meditate upon the spirits for a while, then recite the invocation:\n\n\"Six Ding Jade Maidens, attend me and my master,\nSurvey the world, ensure all undertakings prevail,\nFathom past and future, repel noxious *qi*,\nDispel misfortune.\nBe my companions, and I shall honor you always,\nOffering wine, food, and dried meats,\nGranting every wish without fail.\nThose who seek the Dao and immortality,\nOr request aid in refining elixirs,\nShall attain their desires.\nMay divine immortals descend and unite with the true Way.\"\n\n*Hasten as the command of the Most High!*\n\n**Method of Invoking the Six Ding with Talismans**\nPrepare a clean mat, a six-foot cloth towel, six portions each of dried venison, wine, fruit, and fried cakes, and one censer of incense. Sweep a room clean and arrange the offerings. From the *jiazi* day, observe abstinence for three days. In a secluded chamber, burn incense, pray with utmost sincerity, and make your vows. On the day of the Six Ding, at the hour of *hai*, face the direction of their current dominance and inscribe the images of the Six Ding spirits and their talismans, laying them upon the mat. Light incense, bow deeply toward the east, and click your teeth thirty-six times. Recite the incantation:\n\n\"Nurtured by Heaven, born of Earth,\nReceiving the divine talisman, one may attain long life.\nImmortal beings assist me, Jade Maidens sustain my form,\nThe twenty-eight constellations record the names of the stars.\nThe Five Directions, the Five Colors—black and white, red and blue,\nThe Yellow Emperor of the Center—all accompany me.\nAfter receiving the talisman, may all wishes be fulfilled,\nVanquishing all malevolent spirits.\nThose who know not their own truth shall not claim mine;\nThose who know not their own divinity shall not claim mine.\nAdvance to be enfeoffed as a marquis,\nOr retreat to be beheaded.\n*Hasten as the law commands!*\"",
      "overlap_context": "taking life in vain, constantly practice hidden virtue, and cultivate a compassionate heart to save all beings. Always observe these precepts, refrain from idle speech, and make offerings to invoke the spirits. Thus, you shall foreknow future events, perceive the signs of things ten thousand miles away, and comprehend even the subtlest intentions—every action and movement shall be known.\n\nIf you have matters to attend to, divine and inquire of them, and the answers shall be immediately revealed.",
      "start_char": 452,
      "end_char": 986,
      "start_sentence": 24,
      "end_sentence": 49,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.297828912734985,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\灵宝六丁秘法.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "凡作符，先斋三日，七日亦可。 书符时，面向旺方端坐净思，神容如对，念咒曰： 谨请六丁仙吏，丁卯神，足日之丁酉神，元天上丁亥神，大明集丁酉神，救钦灵丁未神，乘紫云丁巳神，朱乘称#1 经曰：行此法，皆须志心虔诚，更莫起他念，便将符依次第吞之，其人心欢然，如有所晓。 至明朝，还作符吞，得七日后，即於冷室中结坛端坐，具香华灯烛各一分，书本位符及神名，安於席上，东向叩齿三十六通，想五色云气之间。 乃见其神各於六门而入，坐其座上，不得熟视。 但心念祈告所愿之意，其念必应。 昔蚩尤作乱，黄帝与蚩尤频战不克，帝曰：吾闻伏羲在位，无兵治天下廓清，乾坤康泰，天下安宁。 今蚩尤一庶人也，伐而无征，攻之不克，吾之过也。 告敬未息，目前忽睹五色云自空中而来，云中有二童子持金函，后有六仙女同於云中，奉九天玄女圣命，与帝送造化之源，天地之祸福，八卦之衰旺，风云之变动，气候之成败，日月之胜负，阴阳之得失，星辰之臧否，人情之逆顺，变化之理法。 帝乃长跪而受，童子浮云而去，六仙女已不见。 帝遂受得函，未敢便看，急酒扫一室，治斋三日，方始开函，受得六丁诀一部，上卷说供养、醮祭之法； 中卷说长生不死之道； 下卷说强兵战胜，遁甲六壬；",
      "translated_text": "To craft talismans, first purify oneself for three days—seven days is also acceptable. When inscribing the talisman, sit facing the auspicious direction, compose the mind in stillness, and maintain a demeanor as if in the presence of the divine. Recite the incantation:\n\n\"With reverence, I invoke the immortal officers of the Six Ding:\nThe Ding-mao spirit,\nThe Ding-you spirit of the Foot Day,\nThe Ding-hai spirit of Primordial Heaven,\nThe Ding-you spirit of Great Brightness,\nThe Ding-wei spirit of Salvation and Divine Efficacy,\nThe Ding-si spirit riding the purple clouds,\nThe Vermilion-Riding spirit of the *Canon*...\"\n\nThe *Canon* states: In practicing this method, one must maintain a sincere and devout heart, free from distracting thoughts. Then, swallow the talismans in sequence, and the practitioner’s heart will rejoice, as if enlightened.\n\nBy the next morning, inscribe and swallow another talisman. After seven days, retire to a secluded chamber, arrange an altar, and sit upright. Prepare one portion each of incense, flowers, lamps, and candles. Inscribe the talisman of one’s proper position and the names of the spirits, placing them upon the mat. Face east, click the teeth thirty-six times, and visualize the space between the five-colored clouds. Thereupon, the spirits will enter through the six gates and take their seats—do not gaze fixedly upon them. Simply concentrate the mind and present one’s wishes, and the prayer will surely be answered.\n\nIn ancient times, when Chiyou rebelled, the Yellow Emperor fought him repeatedly but could not prevail. The Emperor sighed, saying: \"I have heard that in the time of Fuxi, there were no weapons, yet the world was governed in clarity, heaven and earth were at peace, and all under heaven was tranquil. Now Chiyou is but a commoner, yet I attack him without just cause and cannot overcome him—this is my failing.\" Before his lament had ceased, he suddenly beheld five-colored clouds descending from the sky. Within the clouds, two youths held a golden casket, and behind them, six immortal maidens appeared together, bearing the sacred command of the Nine Heavens Mysterious Maiden. They bestowed upon the Emperor the source of creation, the fortunes and misfortunes of heaven and earth, the waxing and waning of the eight trigrams, the transformations of wind and clouds, the success and failure of climatic qi, the victory and defeat of sun and moon, the gains and losses of yin and yang, the auspiciousness and inauspiciousness of the stars, the compliance and defiance of human affairs, and the principles and methods of transformation.\n\nThe Emperor knelt in reverence to receive the gift. The youths ascended upon floating clouds and departed, and the six immortal maidens vanished. The Emperor then received the casket but dared not open it at once. He swiftly swept a chamber clean, purified himself for three days, and only then opened the casket. Within, he found a manual on the Six Ding, its upper scroll detailing the methods of offerings and sacrificial rites; the middle scroll expounding the Dao of long life and immortality; and the lower scroll teaching the arts of military strength, victory in battle, and the divination systems of Dunjia and Liuren.",
      "overlap_context": "n my form,\nThe twenty-eight constellations record the names of the stars.\nThe Five Directions, the Five Colors—black and white, red and blue,\nThe Yellow Emperor of the Center—all accompany me.\nAfter receiving the talisman, may all wishes be fulfilled,\nVanquishing all malevolent spirits.\nThose who know not their own truth shall not claim mine;\nThose who know not their own divinity shall not claim mine.\nAdvance to be enfeoffed as a marquis,\nOr retreat to be beheaded.\n*Hasten as the law commands!*\"",
      "start_char": 987,
      "end_char": 1489,
      "start_sentence": 50,
      "end_sentence": 63,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.299485921859741,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\灵宝六丁秘法.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "玄女尸解之法。 帝乃依文告敬修之，不旬日，似觉身异，举步飞行。 再约蚩尤交战，一鼓而灭，却蚩尤於泳鹿之源。 岂不是得元炁精，而除却妖氛也。 后感天下廓清，乾坤得位，阴阳不失其序，帝遂修长生不死之卫，自制阴符经一卷，藏隐机要。 后帝乃白日升天。 其阴符云：八卦甲子神机鬼藏，便是六丁遁甲，强兵战胜之衍，是九天玄女衍也。 六丁隐遁法局 六丁者，天地之正神也，不同寻常。 青龙、明堂、太阴，其神常随玉女，受使在天地之内。 如欲隐身，令人乃一切物不见己者。 青龙日行到玉女，即人不见也。 夫欲隐身，左手持刀闭口，右手画四方图子。 若恶人在外，於门内局子六步。 恶人在门中，便於庭作局子六步。 如恶人在中庭，於室内作局子六尺。 若在田野，作局子六丈，用算子长一尺二寸，逐青龙上依，次而行直，放算子到天门上，用右手横算子一条，闭天门而去。 闭天门了身已隐也。 每一算子存为一人，玉女到太阴住存，想外人已不见也。 术曰：居青龙，历蓬星，过明堂，住太阴，出天门，入地户，藏华盖，隐玉女。 急急如太上律令。 丁卯隐人身，丁巳隐人命，丁亥隐人禄，丁酉隐人魂，丁未隐人魄，丁丑隐人精神，凡事於六丁日，念咒六遍，咒曰： 仁高护我，丁丑保我，仁和度我。 丁酉保全，仁灿管魂，丁巳养神，太阴华盖，地户天门。 吾行禹步，玄女真人，明堂坐卧，隐伏藏身。 急急如九天玄女律令。 如每供养之物，并自吃，不得与外人，切宜慎之。 每遇甲子日，须斋戒一日。 丁卯玉女名文伯，字仁高。 神戴冠着礼衣，手把莲华，上朱衣下青衣，以子丑日下在人间，要知吉凶，召而问之。 丁丑玉女一名文件字仁鸯其神两手把莲华、上朱衣下黄衣，以寅卯日下人间，要知吉凶，召而问之。 丁亥玉女名文通，字仁和。 右手把镜自照揜心，左手把莲华，上朱衣下紫衣，以辰巳日下人间，要知吉凶，召而问之。 丁未玉女名叔通，字仁集。 左手把镜照，右手执莲华，上朱衣下黄衣，以午未日下人间，要知吉凶，召而问之。 丁巳玉女名庭卿，字仁叔。 神左手把莲华，右手执白迭布巾，上锦衣下赤衣，以申酉日下人间，要知吉凶，召而问之。 丁酉玉女名文卿，字仁通。 神领一小儿在仙手，抚头把白迭布巾，上朱衣下白衣，以戌亥日下人间，要知吉凶，召而问之。 黄帝曰：六丁神各有名，字不同。 若欲使之，各呼名字，皆神验也。 仙经曰：六丁玉女神名能小耳呼名字而使之，万愿从矣。 隐遁十二时算子法 歌曰：鼠行失穴入狗市，牛入兔园因猫止。 猛虎跳梁南到巳，兔入牛栏伏不起。 龙入马厩食甘草，胜蛇宛转来申裹。 马入龙泉饮甘水，羊鸡乌处入酉裹。 猿猴起健堵门内，鸡飞落泊羊栏裹。 狗来鼠入坎穴中，狠堵东游虎所牵。 每行出时须咒曰： 天反地覆，天反地覆，九道皆塞，空有人来追我者，从此而惑。 以东为西，以南为北。 乘车来者折其轴，骑马来者掩其目，步行来者肿其足，扬兵来者当自伏不敢起。 明星北斗却敌。 万里追我者亡，觅我者止。 牵牛识女化成江海。 急急如律令。 咒讫，便使左手下算，闭禹步闭炁而去。 玉女咒 玉女天神至矣，永与我侍行，到於某处，杳杳冥冥，莫睹其形。",
      "translated_text": "The Method of Corpse-Liberation Taught by the Mysterious Woman. The Emperor followed the text with reverence and practiced it. Within ten days, he felt his body transformed, able to walk and fly. He again engaged Chiyou in battle, vanquishing him with a single drumbeat and driving him back to the source of Zhuolu. Was this not the result of obtaining the essence of primordial qi and dispelling the demonic miasma? Later, sensing the realm purified, heaven and earth restored to their proper places, and yin and yang maintaining their order, the Emperor cultivated the arts of long life and immortality. He personally composed a scroll titled *The Hidden Talisman Classic*, concealing its essential secrets. Thereafter, the Emperor ascended to heaven in broad daylight.\n\nThe *Hidden Talisman* states: The divine mechanisms of the Eight Trigrams and the Jiazi cycle conceal the workings of ghosts and spirits—this is the evolution of the Six Ding and Dunjia, the art of military strength and victory, derived from the Mysterious Woman of the Nine Heavens.\n\n**The Six Ding Concealment Method**\nThe Six Ding are the true spirits of heaven and earth, unlike ordinary deities. The Azure Dragon, Bright Hall, and Great Yin—these spirits constantly accompany the Jade Maidens, serving within heaven and earth. If one wishes to conceal oneself, rendering oneself invisible to all things:\n\nWhen the Azure Dragon reaches the Jade Maiden, one becomes unseen. To conceal oneself, hold a blade in the left hand and close the mouth, while the right hand traces a four-sided diagram. If evil persons are outside, draw the diagram six paces within the door. If they are within the door, draw it six paces in the courtyard. If they are in the central courtyard, draw it six feet within the chamber. If in the fields, draw it six *zhang* wide. Use counting rods one *chi* and two *cun* in length, following the Azure Dragon’s path in sequence, placing the rods straight until reaching the Gate of Heaven. Then, with the right hand, lay a rod horizontally to seal the Gate of Heaven and depart. Once the Gate of Heaven is sealed, the body is concealed. For each counting rod, visualize one person; when the Jade Maiden reaches the Great Yin and halts, imagine that outsiders can no longer see you.\n\nThe method states:\nDwell in the Azure Dragon, traverse the Star of Peng,\nPass through the Bright Hall, rest in the Great Yin,\nExit through the Gate of Heaven, enter the Earthly Door,\nHide beneath the Floral Canopy, conceal with the Jade Maiden.\n*Swiftly, swiftly, as the statutes of the Supreme Lord command.*\n\nOn Dingmao days, conceal the body; on Dingsi days, conceal fate; on Dinghai days, conceal emolument; on Dingyou days, conceal the soul; on Dingwei days, conceal the spirit; on Dingchou days, conceal essence and spirit. For all matters on Six Ding days, recite the incantation six times:\n*\"Ren Gao protects me, Dingchou guards me, Ren He delivers me.\nDingyou preserves me whole, Ren Can governs the soul, Dingsi nurtures the spirit.\nGreat Yin and Floral Canopy, Earthly Door and Gate of Heaven.\nI tread the Yu Steps, O True Person of the Mysterious Woman,\nBright Hall seated or reclining, conceal and hide the body.\nSwiftly, swiftly, as the statutes of the Mysterious Woman of the Nine Heavens command.\"*\n\nFor all offerings, consume them yourself; do not share with outsiders. Be ever cautious. On every Jiazi day, observe a day of purification.\n\n**The Jade Maidens of the Six Ding:**\n- **Dingmao Jade Maiden:** Named Wenbo, styled Ren Gao. The spirit wears a crown and ritual robes, holding a lotus in hand, clad in red above and blue below. She descends to the human realm on Zichou days. To know good or ill fortune, summon and inquire of her.\n- **Dingchou Jade Maiden:** Named Wenjian, styled Ren Yang. The spirit holds a lotus in both hands, clad in red above and yellow below. She descends on Yinmao days. To know good or ill fortune, summon and inquire of her.\n- **Dinghai Jade Maiden:** Named Wentong, styled Ren He. The right hand holds a mirror to her heart, the left a lotus, clad in red above and purple below. She descends on Chensi days. To know good or ill fortune, summon and inquire of her.\n- **Dingwei Jade Maiden:** Named Shutong, styled Ren Ji. The left hand holds a mirror, the right a lotus, clad in red above and yellow below. She descends on Wuwei days. To know good or ill fortune, summon and inquire of her.\n- **Dingsi Jade Maiden:** Named Tingqing, styled Ren Shu. The left hand holds a lotus, the right a white folded cloth, clad in brocade above and red below. She descends on Shenyou days. To know good or ill fortune, summon and inquire of her.\n- **Dingyou Jade Maiden:** Named Wenqing, styled Ren Tong. The spirit cradles a child in her left arm, stroking its head with a white folded cloth in her right, clad in red above and white below. She descends on Xuhai days. To know good or ill fortune, summon and inquire of her.\n\nThe Yellow Emperor said: The Six Ding spirits each have distinct names and styles. To employ them, call each by name, and their divine efficacy will manifest.\n\nThe immortal scriptures state: The names of the Six Ding Jade Maidens may seem small, yet calling their names enables their use—all wishes will be granted.\n\n**The Twelve-Hour Concealment Method with Counting Rods**\nThe song says:\nThe rat, losing its burrow, enters the dog’s market;\nThe ox enters the rabbit’s garden, halted by the cat.\nThe fierce tiger leaps to the south, reaching Si;\nThe rabbit enters the ox’s pen and lies still.\nThe dragon enters the horse’s stable to eat sweet grass;\nThe victorious snake coils, coming to Shen.\nThe horse enters the dragon’s spring to drink sweet water;\nThe sheep and chicken enter You together.\nThe agile monkey rises within the door’s wall;\nThe chicken flies and alights in the sheep’s pen.\nThe dog comes, the rat enters the Kan burrow;\nThe wolf blocks the east, drawn by the tiger.\n\nBefore each outing, recite the incantation:\n*\"Heaven overturns, earth overturns, heaven overturns, earth overturns,\nThe nine paths are all blocked.\nShould anyone come pursuing me, let them be confounded here.\nLet east become west, south become north.\nThose who come by chariot, break their axles;\nThose who come on horseback, cover their eyes;\nThose who come on foot, swell their feet;\nThose who come with weapons shall prostrate themselves and dare not rise.\nThe Bright Star and Northern Dipper repel the enemy.\nThose who pursue me for ten thousand li shall perish; those who seek me shall halt.\nThe Oxherd and Weaver Girl transform into rivers and seas.\nSwiftly, swiftly, as the statutes command.\"*\n\nAfter reciting, place the counting rods with the left hand, tread the Yu Steps, close the qi, and depart.\n\n**The Jade Maiden Incantation**\n*\"The Jade Maiden, celestial spirit, has arrived,\nEver attending my journey,\nTo such-and-such a place.\nVast and obscure, none perceive her form.\"*",
      "overlap_context": " maidens vanished. The Emperor then received the casket but dared not open it at once. He swiftly swept a chamber clean, purified himself for three days, and only then opened the casket. Within, he found a manual on the Six Ding, its upper scroll detailing the methods of offerings and sacrificial rites; the middle scroll expounding the Dao of long life and immortality; and the lower scroll teaching the arts of military strength, victory in battle, and the divination systems of Dunjia and Liuren.",
      "start_char": 1489,
      "end_char": 2750,
      "start_sentence": 64,
      "end_sentence": 123,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.80599808692932,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\灵宝六丁秘法.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "人不闻其声，鬼不见其精。 善我者福，恶我者殃。 鬼贼当我者死，值我者亡。 千人万人见我喜悦。 急急如律令。 咒讫，即出便须闭门之法，左手持刀画地断之，闭气而去。 局法 室内六尺，庭中六步，门外六十步，野外六百步，或六里。 每临出行，当呼旬上玉女来护我，无令百鬼伤我。 人莫见我，见者为莱薪。 独开我门，而闭他户。 都咒 吾自是天目天相，逐精若雷电，明耀八极，彻视表裹，无物不伏。 急急如律令。 禹步罡 无言法 六丁无言万一法，亦云轩辕诀也。 先须焚香，净水涤秽气，方乃开卷，祷祝看之。 昔有道士张群，志慕道术，积修数载，慕其清虚。 闲阅仙秘，忽於丁丑夜二更，以来於闲庭月下立。 忽见西南方有云五色，而见渐近，云中有步队之声，目忽有一女子云：六丁玉女，丁丑女也。 群乃长跪，稽首礼之。 女曰：子久慕仙道，知子清洁，少慕幽玄。 故来传汝学道妙门，奈汝无仙分。 但汝斋戒百日，设锦帐於今室内，斋戒百日满后，再来示汝之法。 群乃清斋百日，设锦帐於争室内，了夜三更时，依前亦从南来队仗，云中来至。 先见二童子，捧一金函，言奉修行术。 群遂受得金函，言是六丁经三卷，上卷说祭醮之法，中卷说玉女隐形之术，下卷说飞身藏形、剑、少女还精、遁甲六壬之#2。 仙女曰：子无仙分，但备修此法，三年后可为地下顽仙矣。 人寿一千二百岁为顽仙。 此文是上天秘诀，莫非君子宿有道，不可知也。 法曰：如欲修隐形之法，须仁慈救物。 如修剑法并侠仙法，则为人正直去财色，为人猛烈，独行爱正，常行慈悲。 修一年，便有功也。 如修少女还精之法，即须为人平等、孝顺、心慈，勿行欺矫。 当行一年，事乃成矣。 得寿千岁，亦可为顽仙。 张群修之，传与鬼谷子修之，不三年千变万化，莫之圣也。 后世人修法，莫不心有道绿中人，以上方可得闻也。 若人遇此秘法术，为人劣凡解隐形，已是剑侠一半也。 凡须侠成，须戒为人忠孝，有恩有义，不可欺负人。 斩邪归正，先须知隐形。 之后，於一室之内安林，焚香洁序，不得有别人往来。 起卧，先於林前铺枕斋戒，焚香净水，存思解秽，供养六丁玉女。 祭醮祭遇丁日，夜於床上坐定，闭目存想：床为印案，一面西为头，身带六丁玉女印，其印是九天玄女管系玉女之印也。 存印法，先存东北印。 丁卯玉女立於印角，手执青蛇之剑； 次丁巳玉女在东南角，手执或黄或白蛇之剑。 次存西南印。 丁未玉女立在印角，手执或白或黄之剑。 次存西北印。 丁丑玉女立在印角，手执或黑或黄之剑； 次存丁酉丁亥玉女立在左，右手执或青或黄蛇之剑。 存想毕，低声念咒一百八十褊讫。 却身边丁酉丁亥玉女，从鼻中直入心中，鼻为人门。 次存东北角丁卯玉女，从左耳中直入东南角。 先次丁卯，次西南角丁未，次西北角丁丑，次丁酉丁亥。 在身边，亦在印上，直入心内，左耳为风门。 次存印东南角丁巳玉女，右耳直入心内，右耳为鬼门。 次存印西南角丁未玉女，从口中直入心内，口为地户。 次存印西北角丁丑玉女，从两目直入心内，目为天门。 各存思讫。 凡行住坐卧，须常带印在左手上，不得离身。 或大小二事解下印，安在净处，回来洗手却带印了。",
      "translated_text": "None hear her voice, no ghost sees her essence.\nThose who favor me gain fortune; those who harm me meet calamity.\nGhosts and bandits who oppose me die; those who encounter me perish.\nA thousand, ten thousand people see me and rejoice.\nSwiftly, swiftly, as the statutes command.\n\nUpon reciting, immediately perform the door-closing method:\nWith the left hand, hold a blade and draw a line upon the earth to sever it, close the qi, and depart.\n\n**Boundary Method**\nWithin the chamber: six feet.\nWithin the courtyard: six paces.\nBeyond the gate: sixty paces.\nIn the wilds: six hundred paces—or six li.\nBefore each journey, invoke the Jade Maiden of the current旬 to protect me, lest the hundred ghosts harm me.\nLet no one see me; those who do become firewood.\nOpen only my door, and close all others.\n\n**General Incantation**\n\"I am the Celestial Eye, the Celestial Countenance,\nPursuing spirits like thunder and lightning,\nRadiant to the eight directions,\nPiercing sight within and without—\nNo being dares defy me.\nSwiftly, swiftly, as the statutes command.\"\n\n**Yu Steps and the Way of Silence**\n**Six Ding Silent Ten-Thousand-One Method** (also called the *Xuanyuan Formula*)\nFirst, burn incense and purify with clean water to dispel impure qi. Only then open the scroll, make offerings, and read.\n\nLong ago, the Daoist Zhang Qun, aspiring to the Daoist arts, cultivated for many years, yearning for purity and emptiness. While perusing immortal secrets in leisure, he suddenly stood in the moonlit courtyard at the second watch of a *ding-chou* night. He saw a five-colored cloud approaching from the southwest, drawing nearer with the sound of marching footsteps. Suddenly, a woman appeared within the cloud, saying: \"I am the Six Ding Jade Maiden, the *ding-chou* maiden.\"\n\nZhang Qun knelt and bowed deeply in reverence. The maiden said: \"You have long admired the immortal Dao. I know your purity and slight inclination toward the profound. Thus, I come to transmit to you the wondrous gate of learning the Dao—though you lack the destiny of an immortal. If you fast and purify yourself for a hundred days, set up a brocade canopy in your chamber, and complete the hundred-day fast, I will return to teach you the method.\"\n\nZhang Qun fasted and purified himself for a hundred days, then set up a brocade canopy in his chamber. At the third watch of the night, as before, a procession arrived from the south within the clouds. First appeared two youths, bearing a golden casket, saying they offered the arts of cultivation. Zhang Qun received the golden casket, which contained the *Scripture of the Six Ding* in three scrolls: the upper scroll expounded the methods of sacrifice and ritual; the middle scroll, the arts of the Jade Maiden’s concealment; the lower scroll, the techniques of flying and hiding the body, the sword, the Maiden’s Return of Essence, and the *Dun Jia* and *Liu Ren* arts.\n\nThe immortal maiden said: \"You lack the destiny of an immortal, but by diligently practicing these methods, after three years you may become a stubborn immortal of the earthly realm. A lifespan of one thousand two hundred years is called a stubborn immortal. These writings are the celestial secret formulas—only a gentleman with prior karmic ties to the Dao may encounter them.\"\n\nThe method states: To cultivate the art of concealment, one must be benevolent and aid all beings. To practice the sword arts and the ways of the chivalrous immortal, one must be upright, renounce wealth and lust, act with valor, walk alone in righteousness, and always practice compassion. After a year of cultivation, merit will accrue. To practice the Maiden’s Return of Essence, one must treat others with equality, filial piety, and kindness, never deceiving or acting falsely. After a year of practice, the art will be accomplished, granting a lifespan of a thousand years and the attainment of a stubborn immortal.\n\nZhang Qun cultivated these arts and transmitted them to Guiguzi, who, after less than three years, mastered myriad transformations, becoming peerless. Later generations who practice this method must have a heart aligned with the Dao; only then may they receive these teachings. If one encounters these secret arts and, though of humble talent, learns to conceal the body, one is already half a sword immortal. To fully embody chivalry, one must vow to be loyal and filial, repay kindness and uphold righteousness, never oppressing others. To slay the wicked and return to righteousness, one must first master concealment.\n\nThereafter, within a chamber, arrange a forest altar, burn incense, and maintain purity. No others may come and go. When rising or resting, first spread a mat before the altar, fast, burn incense, purify with clean water, meditate to dispel impurities, and make offerings to the Six Ding Jade Maidens. Perform the sacrifice on a *ding* day. At night, sit upright on the bed, close the eyes, and visualize: the bed as the altar table, the head facing west. Wear the Six Ding Jade Maiden’s seal, which is the seal of the Nine Heavens Mysterious Woman, overseer of the Jade Maidens.\n\n**Visualization of the Seal**\nFirst, visualize the northeast seal. The *ding-mao* Jade Maiden stands at the seal’s corner, wielding a green serpentine sword. Next, the *ding-si* Jade Maiden stands at the southeast corner, wielding a yellow or white serpentine sword. Then visualize the southwest seal. The *ding-wei* Jade Maiden stands at the seal’s corner, wielding a white or yellow sword. Next, the northwest seal. The *ding-chou* Jade Maiden stands at the seal’s corner, wielding a black or yellow sword. Then, the *ding-you* and *ding-hai* Jade Maidens stand to the left and right, each wielding a green or yellow serpentine sword.\n\nAfter visualization, softly recite the incantation one hundred and eighty times. Then, the *ding-you* and *ding-hai* Jade Maidens at your side enter your heart directly through the nose—the nose is the human gate. Next, visualize the *ding-mao* Jade Maiden at the northeast corner entering through the left ear to the southeast corner. Then, in order: the *ding-mao*, the *ding-wei* at the southwest, the *ding-chou* at the northwest, and the *ding-you* and *ding-hai*. They stand at your side and upon the seal, entering the heart directly. The left ear is the wind gate. Next, visualize the *ding-si* Jade Maiden at the southeast corner entering the heart through the right ear—the right ear is the ghost gate. Then, the *ding-wei* Jade Maiden at the southwest corner enters the heart through the mouth—the mouth is the earth gate. Finally, the *ding-chou* Jade Maiden at the northwest corner enters the heart through the eyes—the eyes are the celestial gates. Complete each visualization.\n\nWhen walking, standing, sitting, or lying down, always wear the seal on the left hand and never remove it. For major or minor matters, remove the seal and place it in a clean location; upon returning, wash the hands before reattaching the seal.",
      "overlap_context": "n Dipper repel the enemy.\nThose who pursue me for ten thousand li shall perish; those who seek me shall halt.\nThe Oxherd and Weaver Girl transform into rivers and seas.\nSwiftly, swiftly, as the statutes command.\"*\n\nAfter reciting, place the counting rods with the left hand, tread the Yu Steps, close the qi, and depart.\n\n**The Jade Maiden Incantation**\n*\"The Jade Maiden, celestial spirit, has arrived,\nEver attending my journey,\nTo such-and-such a place.\nVast and obscure, none perceive her form.\"*",
      "start_char": 2750,
      "end_char": 3983,
      "start_sentence": 124,
      "end_sentence": 187,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.02777314186096,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\灵宝六丁秘法.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "如夜梦上山入水，相煞斩人，或见女子在边傍，切勿惊怖，此是玉女降身也。 九天玄女印式 用龙惊枣木，安於水盆内，其木自浮动者，为真遇。 甲子日，焚香自己克之，勿令人见，切宜慎之。 印式于左。 丁卯玉女符 右玉女名文伯，字仁高，左手摩孩子头，其孩子不着衣。 丁丑玉女符 玉女名文公，字仁贵，右手二指拳三指展。 丁亥玉女符 右玉女名文通，字仁和，左手把两指拳三指展。 丁未玉女符 右玉女名叔通，字仁富。 左手把镜，右手把莲花。 丁巳玉女符 右玉女名庭卿，字仁叔。 右手把扇如禅印。 丁酉玉女符 右玉女名文卿，字仁修。 直身番着手，乘服彩霞。 修真得尸解法，可於世无碍，不尔未可弃道乎。 兼要务此法，但雾化身尔，乘服彩霞归太极。 胎息阴经曰：内息无名，唯行相成。 若不遵戒，行入胎息，未得合真。 太微隐书曰：凡胎息游於人问，行尸解随所化者。 当庚辰日取辰时，於冷室内，焚香一炉，於床头边设几案，上着香炉、杜杖、鞋履、盖物； 并置於床头边，身衣下解，以衣覆盖。 其面了向西而外，自存念作死人阴，念咒七遍，咒曰： 天上玄灵，受自生灵，七思七召，三魂随迎。 代予之形，形随物化，应化而成。 急急如律令。 咒毕，但依常睡又存思一，食久，切不可与人通语话，则法不成。 志心依法修四十九日，渐渐法成。 或时要用，行住坐外默念此咒。 随手提物，便急回身别人而去。 众人只见某所提之物，是某身已死矣。 后却见物归本形。 此隐法，可以下界助道尸解，易形逃难，不可辄便行非法之事。 凡欲修身，切须静默隐不得漏泄。 若外在床，但以被覆盖其身，默念咒七遍，便起出门。 人只见所卧上衣裳，自己身不被形。 若以欺取财色，神明消折，大道不许。 千万记之，勿得乱传，宜敬之，秘之。 后　序",
      "translated_text": "If in nightly dreams you ascend mountains, enter water, encounter violent slayings, or see a woman nearby, do not be alarmed or frightened—this is the Jade Maiden descending in bodily form.\n\n**Nine Heavens Mysterious Maiden Seal Formula:**\nUse *longjing* jujube wood and place it in a basin of water; if the wood floats and moves of its own accord, it is a true encounter. On the *jiazi* day, burn incense and carve the seal yourself—let no one witness it. Exercise utmost caution.\n\nThe seal formula is as follows:\n\n**Ding-mao Jade Maiden Talisman**\nThe Jade Maiden on the right is named Wenbo, styled Rengao. Her left hand strokes the child’s head; the child is unclothed.\n\n**Ding-chou Jade Maiden Talisman**\nThe Jade Maiden is named Wengong, styled Rengui. Her right hand has two fingers curled and three extended.\n\n**Ding-hai Jade Maiden Talisman**\nThe Jade Maiden on the right is named Wentong, styled Renhe. Her left hand has two fingers curled and three extended.\n\n**Ding-wei Jade Maiden Talisman**\nThe Jade Maiden on the right is named Shutong, styled Renfu. Her left hand holds a mirror, her right hand a lotus.\n\n**Ding-si Jade Maiden Talisman**\nThe Jade Maiden on the right is named Tingqing, styled Renshu. Her right hand holds a fan in the *dhyāna* mudrā.\n\n**Ding-you Jade Maiden Talisman**\nThe Jade Maiden on the right is named Wenqing, styled Renxiu. She stands upright with hands folded, riding upon colored clouds.\n\nBy cultivating the true method of *shijie* (corpse liberation), one may move through the world unimpeded; otherwise, the Dao cannot yet be abandoned. Additionally, one must practice this method—merely transforming the body into mist, riding upon colored clouds to return to the Great Ultimate.\n\nThe *Tai Xi Yin Jing* states: \"The inner breath has no name; only through practice does it take form.\" If one does not uphold the precepts and enters *taixi* (embryonic breathing) prematurely, one will not attain union with the True.\n\nThe *Tai Wei Yin Shu* says: \"Whenever *taixi* is practiced among people, the *shijie* follows the transformation.\" On the *gengchen* day, at the *chen* hour, in a cold chamber, burn a censer of incense. Set up a small table by the bed, placing upon it an incense burner, a staff, shoes, and a covering. Arrange these by the bedside, remove the lower garments, and cover the body with the clothing. Face outward toward the west, visualize oneself as a dead person in the yin state, and recite the incantation seven times:\n\n*\"Celestial spirits of the mysterious,\nReceive the essence of living beings.\nSeven thoughts, seven summons—\nThe three hun follow and welcome.\nTake my form,\nLet form follow transformation,\nAnd manifest as the change demands.\nSwiftly, swiftly, as decreed by law!\"*\n\nAfter reciting the incantation, sleep as usual and maintain the visualization. After a long while, under no circumstances speak to others, or the method will fail. Diligently practice this method for forty-nine days, and the technique will gradually take form. When needed, whether walking, standing, sitting, or lying down, silently recite this incantation. As soon as you grasp an object, swiftly turn away and depart from others. People will see only the object you carried, believing you have already died. Later, when the object returns to its original form, this hidden method can assist in *shijie* within the mortal realm, allowing one to change form and escape calamity. However, it must not be used for unlawful purposes.\n\nFor those who wish to cultivate the body, absolute stillness and secrecy are essential—do not leak the method. If lying on the bed, simply cover the body with a blanket, silently recite the incantation seven times, and rise to leave. Others will see only the clothing on the bed, while your own body remains unseen. If used to deceive others for wealth or lust, the gods will diminish your lifespan, and the Great Dao will not permit it. Remember this a thousandfold—do not transmit it recklessly. Hold it in reverence and secrecy.\n\n**Postscript**",
      "overlap_context": "e Maiden at the southwest corner enters the heart through the mouth—the mouth is the earth gate. Finally, the *ding-chou* Jade Maiden at the northwest corner enters the heart through the eyes—the eyes are the celestial gates. Complete each visualization.\n\nWhen walking, standing, sitting, or lying down, always wear the seal on the left hand and never remove it. For major or minor matters, remove the seal and place it in a clean location; upon returning, wash the hands before reattaching the seal.",
      "start_char": 3983,
      "end_char": 4718,
      "start_sentence": 188,
      "end_sentence": 231,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.128450870513916,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\灵宝六丁秘法.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "黄帝曰：六丁玉女神，能长能短，能有能无。 虔心占而问之，万事从心。 亦占千里身，万里消息。 若要物，任意所为，并皆立至矣。 此法，遇者令人宅清吉，五毒灾难不近，求仙得仙，求官得官，子孙兴旺不衰。 微细并皆得之，若要使时，雨下人间当直。 欲要知凶吉，占而问之，必有神验矣。 丁丑玉女神事如君王法慎勿口传，勿恶语骂晋辱之。 但祭而虔之，先知未来之事意察万里之验委曲书信之意旨也。 或有急难、口舌之事，皆召而问之，可知之矣。 夫学道者，不遇此法，无以得成矣。 古者，各将达士不废者，皆得此文，祭而祀之，并得仙也。 此法贵重，万金不传，父子不相视，真秘文之妙诀耳。 灵宝六丁秘法竟 ＃１疑后有脱字。 ＃２『之』后疑脱『道』字。",
      "translated_text": "Emperor Huang said: The Six Ding Jade Maidens of the gods can lengthen or shorten, can exist or vanish. With sincere heart, inquire of them, and all matters shall follow your will. They may divine the state of one’s body a thousand *li* away, or the news of ten thousand *li*. If you desire an object, act as you wish, and it shall instantly arrive. This method, when encountered, brings purity and fortune to one’s dwelling, keeps the five poisons and disasters at bay, grants immortality to those who seek immortality, office to those who seek office, and ensures descendants flourish without decline. Even the most subtle matters shall be attained. When you wish to employ them, they descend as rain upon the mortal realm, assuming their appointed duty. Should you desire to know fortune or misfortune, inquire of them, and divine verification shall surely come.\n\nThe affairs of the Ding-Chou Jade Maiden of the gods are like the laws of a sovereign—take care never to transmit them orally, nor to revile or insult her with foul speech. Simply make offerings and revere her, and you shall foreknow future events, discern the signs of ten thousand *li*, and grasp the subtleties of written messages. In times of urgent peril or disputes of the tongue, summon and inquire of her, and all shall be known.\n\nThose who study the Dao, if they do not encounter this method, have no means to achieve completion. In ancient times, all enlightened scholars who did not abandon it obtained this text, made offerings to it, and attained immortality. This method is of utmost value—worth ten thousand gold, not to be transmitted even between father and son. It is the wondrous secret of the true arcane text.\n\n*The Secret Method of the Six Ding of the Numinous Treasure* concludes.",
      "overlap_context": "ute stillness and secrecy are essential—do not leak the method. If lying on the bed, simply cover the body with a blanket, silently recite the incantation seven times, and rise to leave. Others will see only the clothing on the bed, while your own body remains unseen. If used to deceive others for wealth or lust, the gods will diminish your lifespan, and the Great Dao will not permit it. Remember this a thousandfold—do not transmit it recklessly. Hold it in reverence and secrecy.\n\n**Postscript**",
      "start_char": 4718,
      "end_char": 5023,
      "start_sentence": 232,
      "end_sentence": 247,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.682829856872559,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\众术类\\灵宝六丁秘法.txt",
        "category": "众术类"
      }
    }
  ]
}