{
  "source_id": "灵宝无量度人上品妙经符图（宋佚名）",
  "source_file": "chunked_daozang\\灵宝无量度人上品妙经符图（宋佚名）.json",
  "total_chunks": 16,
  "total_original_chars": 16049,
  "total_translated_chars": 101751,
  "total_translation_time": 529.3602013587952,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\灵图类\\灵宝无量度人上品妙经符图（宋佚名）.txt",
    "category": "灵图类"
  },
  "full_translation": "**The Marvelous Charts of the Supreme Scripture of Limitless Salvation of the Numinous Treasure**\n\n**Scripture Title:** *The Marvelous Charts of the Supreme Scripture of Limitless Salvation of the Numinous Treasure*. The original text does not specify an author. The first volume includes a preface by Emperor Huizong of the Song, suggesting its composition during the Southern Song dynasty. Three volumes in total. Base text sourced from *The Orthodox Daoist Canon*, *Dongzhen* Section, *Lingtu* (Numinous Charts) Category.\n\n---\n\n**Preface to *The Marvelous Charts of the Supreme Scripture of Limitless Salvation of the Numinous Treasure***\n*Composed by Emperor Huizong of the Song*\n\nOf old, the numinous radiance of Hualing concealed the Three Qi within the primordial chaos; the divine splendor held brilliance, harboring the myriad perfected within the utmost mystery. In the flourishing of emptiness and non-being, kalpas transformed naturally, and from this arose the wondrous pole of the Divine Unity—this is the honored One of Primordial Beginning. It inaugurated the celestial charts before the imperial ancestors, congealing the essence and flowing forth the root of form, the origin of the profound and the yellow, the ancestor of all images.\n\nThus, it cleaved heaven and earth, ordered yin and yang, followed the four beginnings in their measures, and regulated the waxing and waning of the eight cords—all receiving the mandate of the supreme virtue, all governed by the authority of the celestial bureaus. It harmonized the spirits in hidden accord, nurtured their natures in concord, arrayed their positions and opened the directions, fostering and completing all things. Nine harmonies and ten unions—nothing failed to attain perfection. Flowing ceaselessly, it is boundless and unfathomable.\n\nThe Dao, though forced into a name, is called the *Numinous Treasure*. For the Numinous Treasure is the root of generation and transformation of the Great Primal. Since then, the subtle mechanism has unfolded, awakening the essence of dawn. One must reflect upon the era before the establishment of the primordial kalpa, when the myriad forms fused and crystallized, their brilliance and freshness radiant, the supreme principle shining forth in the Dragon Han, the marvelous scripture resplendent in the Crimson Clarity. The celestial net spread its splendor, cloud-like chapters unfurled in all directions; the five directions gleamed, the eight corners cast their rays. Subtle mysteries were concealed in the true profundities, divine functions lay hidden within the primordial net.\n\nTo expand the great teaching and let its compassionate fragrance flow, the scripture was inscribed by the brush of the august sage and its meaning proclaimed in the words of the Most High. Some took the form of charts and talismans, others of esoteric texts; some expounded the marvelous in the land of Fuli, others concealed the mysterious within the pearl of millet grain. Some were entrusted to us, others received from the Jade Void; some were secreted in the palaces of elixir, pearl, and mushroom, others revered in the divine halls of the numinous treasury.\n\nThey established ranks and categories, distinguishing types and dividing sections. Scattered, they upheld the warp of the Six Jia; united, they encompassed the standard of the One Primordial. They served as the great bridge of the Dao, traversing the profound ford, salvaging all without exception, exorcising all without fail. They sustained the turning of fate in times of distress, safeguarded the prosperity of the altars of soil and grain, pacified and stabilized the imperial destiny, and sealed the governance of mountains and rivers. Vast and majestic was their scope—nothing lay beyond their all-embracing order.\n\nThis is what is called the *Numinous Treasure*—truly the loftiest appellation of the Great Primordial. Within the grand palace of the Great Possession, this scripture was treasured, most revered among the ten thousand heavens. Those who, through diligence and toil, came to hear of it must first examine their worthiness, adhering to the luminous statutes of the Purple Tenuity and observing the rites of the divine kings in reverence. It was not to be lightly transmitted—once in ten thousand kalpas.\n\nIn the past, I presided over the Jade Realm of the Assembly of Perfected, opening the wondrous court of transformation. I embraced the ninefold radiance of auspicious clouds, soared with the phoenix canopy over the Three Floras, ascended the Dragon Terrace of Luyao’s splendor, and surveyed the turning of fate at the Primordial Gate. I examined the reckoning of kalpas and celebrated the era of Great Peace. Looking up, I prayed to the Supreme Emperor to descend into the world and save humanity.\n\nLater, in the years *renchen* and *gengzi*, the qi responded to the Nine Yangs, heterodox teachings dissolved, and the true Dao began to flourish. The masses were enlightened, and boundless salvations were bestowed. At that time, the purple-sealed treasure chest was opened, and the jade key unlocked the jeweled case. The jade-bound medicinal slips were to be proclaimed; those who aspired to the true might behold them—how fortunate!\n\nI often dwell in the Jasper Forest chamber, feasting in the jade dawn’s embrace, chanting in the lofty void, and expounding the subtle doctrines. I have elucidated the essentials within the divine treasury and beheld the supreme principle in the limpid mirror. Thus, I have unfurled and released the primordial meaning, aligning with the mysterious conveyance of the profound. I have discerned the profound purport of the original chapters and analyzed the graceful beauty of the numinous tones. I have expounded the pivot of the Limitless and meticulously investigated the obscure and distant.\n\nThis may enable one to ascend the ten-thousand-*ren* peak of the mysterious, to rescue those drowning in the vast and perilous abyss. For when the rosy clouds soar and gleam in the empty purity, nothing remains unilluminated in the depths of obscurity. The marvelous records are proclaimed, abiding in the way of simplicity. Bright and distinct, they awaken those with karmic affinity.\n\nLet scholars not neglect their utmost application. Cultivate and advance, and one may summon the numinous qi at the Three Passes, flourish the precious blossoms at the Nine Gates. When merit is complete and virtue perfected, one’s name is inscribed in the Upper Clarity. Loosening the reins, one soars aloft, roaming the Great Brilliance. The greatness of transformative virtue—how could one exhaust its ultimate ford?\n\n---\n\n**The Marvelous Charts of the Supreme Scripture of Limitless Salvation of the Numinous Treasure, Volume One**\n\nThe Numinous Treasure, in terms of the supreme Dao, is the generation of divine transformation. When the primordial chaos first divided, the Primordial Beginning unfolded the celestial charts. The true qi wove its network, universally planting the numinous spirits, perpetually nurturing and enduring, generating and completing without end.\n\nHuman life, in its essence, is the most precious of things. Endowed with consciousness and perception, its transformations and applications are boundless. Tracing its great root, all receive the celestial constancy. It is nurtured by the covering and bearing of heaven and earth, encompassed within the guiding principles.\n\nWhen the spirit descends, it becomes numinous; when qi gathers, it becomes treasure. The descent of spirit and the gathering of qi give form to substance. Nothing fails to be generated, nothing remains obscure, nothing is not established, nothing is not completed.\n\nThus, to the left resides the Non-Flourishing, to the right coalesces the White Prime. The Great One and the Director of Destinies, Peach Vitality and Union of Longevity, the Three Perfected and the Nine Palaces—all are scattered and complete. What room is there for conjecture or deliberation?\n\nThe millet pearl receives without limit, its nurturing and propagation flourishing and enduring. Great as heaven and earth, small as a single form, extending even to grasses and trees—the true essence of the myriad categories is all naturally managed thereby.\n\nThus, the Dao encompasses the ten thousand heavens, circumscribes the ten earths, propels the turning of yin and yang, and harmonizes cold and heat. It governs the eight trigrams, commands the Three Primordials, regulates ghosts and spirits, and preserves and nourishes the people and all things.\n\nThus its scripture summons the perfected and invokes the numinous, delivering countless beings—serving as the origin of the myriad Daoist traditions and acclaimed as the supreme scripture. For the Lingbao tradition encompasses the Three Ways, ascending to commune with Shangqing and descending to embrace Dongshen. The union of spirit and qi forms the root of primordial essence; its name stands majestic, exalted, and revered beyond all else.\n\nThe Dao declares: In ancient times, within the Azure Prime of Heaven, amidst the Celestial Void’s hymns of the Great Floating Li Land, the Heavenly Perfected Sovereign inscribed the Lingbao qi with a purple brush, where it intermingled with the Azure Prime’s qi to manifest its transformative forms. It governs the generative Dao of the world, heaven and earth, and ghosts and spirits, capable of nurturing and storing the qi of life, embracing the hun-soul and binding it through refinement to attain perfection. Those who possess it inscribe it in azure upon bamboo slips or silk, face the northwest to ingest it, preserving life and prolonging years, ensuring the spirit-qi does not scatter, thus securing the Dao of complete vitality. Wearing it draws the qi of life into the body, reversing aging to return to infancy, aligning with destiny to transcend mortality, and traversing the Great Yin. Donning the Azure Prime’s transformative chart, the Azure Prime Lord ascends with the adept, roaming the vast heavens.\n\nThe Heavenly Perfected Sovereign said: The qi of the Celestial Void in beings manifests as threads, vessels, sinews, and networks, interlinking and permeating. This qi originates in the Azure Prime of Heaven, generating in humans three hundred and sixty meridians, three hundred and sixty channels, three hundred and sixty collaterals, along with minute, branch, silk, and @ collaterals. The Great Bounds’ qi serves as their origin, coalescing within this scripture to form the chart. Those who wear it—immortals inscribe azure on silk to summon the perfected of the ten directions; a single hymn sung in the void is heard by all sages. Its ingestion and application follow the same method.\n\nThe Heavenly Perfected Sovereign fixed the script with a purple brush, using azure for the ground, yellow for the text, and red for the borders. Sealing this chart as the Floating Li Land demarcates the region encompassing the Zhixue’s abode. The luminous qi of the Central Yellow Supreme Mingfan revolves and flows, delineating the palaces, towers, and pavilions within its domain. Those who wear it find the hundred spirits attending their body, the Three Realms’ overseers welcoming them; demon kings receive commands, and the Five Emperors serve at their chariot. The Central Yellow Supreme Unity Emperor, if the adept recites the Dongzhang in unison, ascends with them to the Purple Chamber. This chart governs the spleen and stomach, nourishing supreme harmony—its application follows the prior method.\n\nReceiving the *Primordial Beginning’s Scripture of Delivering Countless Beings, Supreme Grade*, the Primordial Heavenly Worthy expounded this sutra, circling ten times to summon the ten directions, then ascending the throne.\n\nThe Heavenly Perfected Great Spirits, Supreme Sages of the Highest Rank, Wondrously Practiced Realized Ones, and countless hosts arrived riding the void, soaring through the cinnabar clouds of the empyrean. Their jade-green chariots and wheel-rimmed palanquins bore feathered canopies that trailed in response; streaming essences of jade radiance, five-colored qi surged in abundance, illuminating the Great Void with resplendence for seven days and seven nights. The sun, moon, and stellar lodges of the manifold heavens, along with the jade celestial pivots, all halted their revolutions at once. Divine winds stilled into silence; mountains and seas concealed their clouds; the sky held no drifting veils, and the four qi shone in clarity. The land of the entire realm—its mountains, rivers, and forests—leveled into perfect evenness, no longer possessing high or low; the earth transformed entirely into azure jade, without any differing hues.\n\nThe assembled Perfected attended the throne as the Primordial Heavenly Worthy, seated upon a darkly floating dais above five-colored lions, expounded the sutra once. The Great Sages of the manifold heavens simultaneously voiced their approval. At that moment, the deaf and ailing men and women of the realm all regained their hearing. When the sutra was expounded a second time, the blind received sight. A third recitation enabled the mute to speak. A fourth allowed the lame, the chronically ill, and the long-bedridden to rise and walk. A fifth restored those suffering from enduring ailments to their original forms. A sixth turned white hair black again and caused fallen teeth to regrow. A seventh rejuvenated the aged into youth and strengthened the young. An eighth enabled pregnant women, as well as birds and beasts—whether already bearing young or yet to conceive—to bring forth life in completion. A ninth caused the earth’s treasuries to open, revealing gold and jade. A tenth brought the withered bones back to life, all rising as whole persons.\n\nAt that time, every man and woman of the realm turned their hearts in devotion, all receiving protection and deliverance, attaining longevity without end. The Dao declared: When the Primordial Heavenly Worthy expounded the sutra once, the boundless and immeasurable hosts of the Perfected Great Spirits of the Eastern Direction arrived floating through the void. A second recitation summoned the boundless and immeasurable hosts of the Perfected Great Spirits of the Southern Direction. A third brought those of the Western Direction. A fourth, those of the Northern Direction. A fifth, those of the Northeastern Direction. A sixth, those of the Southeastern Direction. A seventh, those of the Southwestern Direction. An eighth, those of the Northwestern Direction. A ninth, those of the Upper Direction. A tenth, those of the Lower Direction. When the ten recitations were complete, the Perfected Great Spirits of the ten directions arrived simultaneously.\n\nThe men and women of the realm turned their hearts in reverence, their numbers like fine rain or dense mist. The countless hosts pressed upon half the land, causing the earth to sink unevenly, an effect that could not be restrained. Thereupon, the Primordial Heavenly Worthy suspended a single precious pearl, as large as a millet grain, in the dark emptiness of space, five *zhang* above the earth. The Primordial Heavenly Worthy led the Heavenly Perfected Great Spirits, Supreme Sages of the Highest Rank, Wondrously Practiced Realized Ones, and the boundless hosts of the Perfected Great Spirits of the ten directions into the pearl. The heavenly beings gazed upward, seeing only a surging movement as all entered through the pearl’s opening; once inside, their whereabouts became unknown. The people of the realm dispersed, and the earth returned to levelness, no longer uneven or sunken.\n\nWithin the pearl, the Primordial Heavenly Worthy completed the full exposition of the sutra. The assembled Perfected oversaw the deliverance and transmitted it to me. At that moment, joy and celebration defied description; the Dharma rites were roughly concluded, and the deities of the manifold heavens returned to their stations. In an instant, all fell silent, leaving no lingering echoes. The heavenly beings who encountered this sutra universally attained salvation, preserving their allotted years without harm. The entire land turned in reverence, all cultivating virtuous minds: refraining from killing or harming, from envy or jealousy, from licentiousness or theft, from greed or desire, from hatred or deceit; their speech bore no ornate falsity, their mouths no harsh words. United in compassion and love, even those of different lineages became kin. The realm knew peace, the people abundance, and all rejoiced in great harmony.\n\nWhen the sutra first emerged to instruct the realm in the Dao, those who had previously cultivated sincere devotion, reverence, and respect all attained deliverance across the ages. The Dao declared: The words spoken by the Primordial Heavenly Worthy in expounding the sutra comprise the inner names of the Heavenly Thearchs and the hidden rhymes of the heavens, as well as the secret taboos of demon kings and the concealed names of the hundred spirits. They are not the common speech of the world. Only the Supreme Sages who have attained perfection and the Realized Ones who have penetrated the mysteries can fully grasp its verses. Reciting it ten times causes the manifold heavens to chant in response from afar, the ten thousand Emperors to offer rites, rivers and seas to fall silent, mountains and peaks to conceal their clouds, the sun and moon to halt their radiance, the celestial pivots to cease their motion, demon hosts to bind their forms, ghostly spirits to lose their clarity, the dead to rise from their corpses, and white bones to become whole persons.\n\nFor those who diligently study this sutra, reciting it ten times will cause the Five Emperors to attend as guards, the Three Realms to bow in reverence, demonic spirits to lose their sight, ghostly beings to lose their clarity, and those on the verge of death to be delivered, snatching life from the jaws of extinction. The reason for this is that the student’s impure qi has not yet dissipated, and their body has not fully realized the Perfected; though they may summon and command the ten directions, their power does not yet govern the celestial administration. Their virtue may subdue and bind earthly demons, restraining and expelling malevolent spirits, but this only averts death—it does not restore life. To recite these verses lightly brings calamity upon oneself. To revere and honor them with offerings causes one’s household to flourish, bringing prosperity across generations, forming good karmic connections, shielding from the ten thousand disasters, and ensuring the protection of divine luminaries at one’s gate.\n\nThis sutra is supremely venerable, unmatched in the Jade Capital. It delivers countless beings, serving as the root of the ten thousand Daoist teachings. Its majestic and vast model of virtue is beyond measure.\n\nThe Dao speaks: Should one recite this sutra ten times, all the heavens assemble, and the suffering souls of countless generations of ancestors in the dark realms all receive deliverance, ascending to the Vermilion Palace. After nine years of refinement, they undergo transformation and rebirth, becoming noble persons. Those who diligently study this sutra to its fullest, with merits fulfilled and virtue perfected, all attain divine transcendence, soaring to the Golden Gates and roaming the Jade Capital.\n\nScholars of higher learning who cultivate and recite this sutra shall immediately receive deliverance, ascending to the Southern Palace. For those in the world who recite it, their lifespans extend, and in later times, they all attain the Way of *shijie*, their souls briefly extinguished yet spared from hell, swiftly regaining form to wander the vast heavens. This sutra is subtle and wondrous, universally delivering boundless beings. All heavenly and mortal beings receive immeasurable blessings, their lives and deaths graced with favor. Treasured by the heavens above, it is not transmitted to the lower world. Only the most devoted, bearing gold and treasures, may pledge their hearts to heaven to receive it. To lightly disclose or profane it brings calamity upon nine generations, condemning them to eternal servitude under the ghostly officials.\n\nTwenty-four Jade Lads and twenty-four Jade Maidens attend this sutra, safeguarding its divine script with protective spirits to shield the reciter’s body.\n\nThe Dao speaks: During the first month of the year, observe a prolonged fast and recite this sutra to sever the earthly bonds of past generations’ wandering souls, delivering them to the Southern Palace. In the seventh month, observe a prolonged fast and recite this sutra to attain divine transcendence, with one’s name inscribed by the heavens. On the Yellow Register and White Tablet, death is erased and life restored. In the tenth month, observe a prolonged fast and recite this sutra for the sake of kings, emperors, lords, ministers, fathers, and sons, to stabilize the nation’s destiny, preserve the heavens’ longevity, and ensure the lineage endures unbroken, perpetually ruling as sovereigns, securing peace in their lands, with the people proclaiming great harmony.\n\nOn the eight seasonal festivals, recite this sutra to become a Perfected One of the Nine Palaces. On one’s natal day, recite this sutra to purify the soul, preserving the myriad *qi* eternally, sparing oneself from suffering, and enveloping the body in radiant light. The Three Realms offer protection, the Five Emperors oversee reception, and ten thousand spirits pay homage. One’s name is inscribed in the heavens above, and with merits fulfilled and virtue perfected, one soars to the Supreme Clarity.\n\nThe Dao speaks: On the day of performing the rites, one must bathe in fragrant waters, observe abstinence, and enter the chamber facing east. On the day of recitation, first don proper attire, wash hands and rinse the mouth, then place the sutra upon the table. Thereafter, burn incense, bow in reverence, kneel, and declare one’s intent to recite. Then, facing east, sit upright, burn incense, open the sutra, and read with focused mind and measured gaze, reciting softly. Should one err or falter, return thirty characters and reread, neither hastening nor rushing. To greedily pursue quantity undermines merit, and none should be slighted. Modulate the voice in recitation to harmonize the spirit and soul. Ensure the incense’s fragrance lingers unbroken in the chamber, and thereafter, follow the prescribed methods of visualization and invocation.\n\nKnock the teeth twelve times to resonate with the Thirty-Two Heavens, and bow thirty-two times in the heart. To knock the teeth, bring the upper and lower central teeth together in pairs, producing a clear sound. Internally, this gathers the spirit; externally, it reaches the heavens. As the *Zhen Gao* states: \"Knock the teeth thrice to gather the spirit; swallow saliva to harmonize with the true.\"\n\nNext, visualize bowing to the Thirty-Two Heavens, imagining each celestial emperor as you bow once. Begin from the northeast, proceeding eastward in a leftward circuit, concluding in the northwest. With eyes closed, meditate upon sitting amidst clouds of three colors—azure, yellow, and white. The Mysterious *qi* is azure, the Primordial *qi* is yellow, and the Original *qi* is white. Within and without, all is veiled in mist, with the Azure Dragon, White Tiger, Vermilion Bird, Dark Warrior, lions, and white cranes arrayed to the left and right. The sun and moon illuminate the chamber, their radiance filling the room. A circular halo emerges from the crown of the head, its light suffusing the ten directions—all must be vividly imagined.\n\nThe secret incantation declares:\n*Azure Dragon to the left, White Tiger to the right,\nVermilion Bird before, Dark Warrior behind.\nLions in two rows on either side, eight in each,\nFacing one another in pairs.\nWhite cranes likewise.\nThe sun at the left of the brow, the moon at the right,\nTheir light filling the chamber.\nA circular halo from the crown, nine colors interwoven—\nAzure, crimson, yellow, white, black, green, red, purple, and gold—\nIlluminating the ten directions.\nVisualize all clearly, as if seen.*\n\nThen recite the secret incantation silently, moving the lips without sound:\n*Tanluo Yuluo, Fuwu Sutuo.\nGreat Thoroughfare, Supreme Ultimate,\nYin and Yang harmoniously enveloped.\nEmerging from existence, entering non-existence,\nBorn from life, returning to death.\nGhosts and spirits cannot fathom,\nTransformations arise naturally.\nPrimordial Chaos of the Original Beginning,\nMystery within mystery.\nAbove, it pierces the heavens’ summit;\nBelow, it penetrates the abyss.\nRecite once, and chronic ailments heal.\nRefine the soul, bathe the spirit,\nTrue Yang is preserved whole.\nWith abstinence, reverence, and recitation,\nTen thousand repetitions grant flight to immortality.\nThe supreme secret incantation,\nTen thousand spirits everlasting.*\n\nRecite the heart incantation repeatedly:\n*Tanluo Donglun, Jade Clarity’s Supreme Ultimate.\nNine *qi* intermingle, dividing spirits as they arise.\nDescending to infuse the body,\nForm and spirit both wondrous.\nTransform, ascend, and fly,\nAll as decreed.\nCommanding the ten thousand spirits,\nSwiftly, swiftly, as the law commands.*\n\nThe Most High Lord of the Dao of the Supreme Mystery, the Three *Qi* of the Primordial Origin, gave rise to the Three Treasures, each dwelling in its own heaven. The Three Heavens reside above the hairline on the human forehead: the Heaven of Pure Tenuity, governed by the Heavenly Treasure Lord; the left is the Heaven of Yu Remnant, governed by the Numinous Treasure Lord; the right is the Heaven of Great Crimson, governed by the Divine Treasure Lord. When reciting the sutra, one must visualize the Three Emperor Lords, summoning the myriad officials within one’s body to emerge.\n\nThe Three and Five Merit Officers and Direct Envoys reside in the heart, emerging from the mouth. The Orthodox Unity Merit Officer dwells in the gallbladder, emerging from the left eye. The Healing Merit Officer dwells in the spleen, emerging from the bridge of the nose. The Left Mysterious Merit Officer dwells in the liver, emerging from the right eye. The Right Mysterious Merit Officer dwells in the lungs, emerging from the nose. The Upper Section Merit Officer emerges from between the brows, the Middle Section Merit Officer from the mouth, and the Lower Section Merit Officer from the navel. The Left and Right Official Envoys—the Left Official Envoy dwells in the left flank, and the Right Official Envoy in the right flank.\n\nThe Incense-Attending Golden Youth resides between the left brow. The Message-Transmitting Jade Maiden resides between the right brow. The Five Thearchs’ Direct Talismans—each of the Five Thearchs corresponds to one of the five viscera, and each has its own Direct Talisman. Additionally, there are the Left Supporter, the Right Supporter, and the Attendant Within. The Incense Officials of the Day each number thirty-six, emerging forth. The Upper, Middle, and Lower Three Realms—each realm has eight officials, totaling twenty-four. The Three Hun and Seven Po, the Yin and Yang Lords, together make thirty-six. Clasp the Jade Emperor’s mudra, shift downward to *chou*, and restrain upward to *si*, then flick them forth.\n\nWhen presenting one’s petition, if one has received the register of the Dao, state one’s rank accordingly. If one has not yet received the register, declare oneself a devotee of the Dao. The disciple should express wholeheartedly what is in their mind, desiring to speak. Yet it is most noble to be concise and appropriate, silently presenting with utmost sincerity.\n\nToday is an auspicious day of perpetual fasting—on this certain day, one may say “auspicious,” following the day’s designation. If observing perpetual fasting, state so; if not, do not mention it. In the Pure Hall, one cultivates and recites the scriptures. If one knows the covenant of the Three Caverns, and sees the practice being carried out, one may say “cultivating and reciting the scriptures.” If one is not such a person, do not say so, but simply state “reciting the scriptures in the Pure Hall.”\n\nFor the immeasurable deliverance of beings, if reciting for a specific matter, state “reciting the scriptures for such-and-such a matter.” If reciting for the hidden souls of the ten directions, one may include the phrase “immeasurable deliverance of beings.” “Your servant and so-and-so (甲, 乙) turn the scriptures to receive rebirth.” If reciting for oneself at ordinary times, say “your servant and ancestors.” If reciting for another, say “your servant for so-and-so,” expressing the names of those involved as appropriate. “So-and-so” refers to the principle of such-and-such a person.\n\nMay the sincerity of this petition ascend directly to the presence of the Most High Thirty-Two Heavens’ Primordial Thearch, the August One. The Primordial Thearch here is not the Primordial Heavenly Worthy, but the Supreme Thearch, whose rank is equal to that of the Primordial One. Some say the Primordial Thearch is the Heavenly Worthy.\n\nOnce finished, draw in *qi* thirty-two times—“drawing” means inhaling through the nose and swallowing. “Thirty-two times” refers to the eight heavens of each of the four directions, drawing once for each. Draw in the blue-green *qi* of the East, storing it in the liver. Draw in the red *qi* of the South, storing it in the heart. Draw in the white *qi* of the West, storing it in the lungs. Draw in the dark *qi* of the North, storing it in the kidneys. Once the five viscera are thoroughly permeated, then recite the scriptures. Face east when reciting the scriptures—the East is the direction of long life, revered by all heavens.\n\nThe format for reciting the scriptures: for the first recitation, begin with the preface and proceed to this visualization. Once finished, recite the subsequent scripture. For the second recitation, begin directly with *The Marvelous Scripture of the Upper Chapters on the Immeasurable Deliverance of Beings*. Every ten recitations constitute one cycle. For exorcisms, supplications, or deliverances, ten recitations are optimal, adhering to the meaning of “delivering beings ten times.” If temporarily interrupted by other matters, or if the recitation lasts somewhat longer, one must return to reciting the preface and performing the visualization as before.\n\n*Thus concludes the first scroll of the talismanic charts of The Marvelous Scripture of the Upper Chapters on the Immeasurable Deliverance of Beings.*\n\n*Beginning of the second scroll of the talismanic charts of The Marvelous Scripture of the Upper Chapters on the Immeasurable Deliverance of Beings.*\n\nThe Primordial Cavernous Mystery’s Numinous Treasure’s root chapters, the marvelous head of the upper chapters, deliver beings ten times, conceal the hundred demons in hidden rhymes, and naturally separate and unite.\n\nThe Crimson Writ of the Chaotic Cavern\n\nThe Primordial began the movement, the Great Mystery initiated the numinous. The Void’s extremity had no form; one *qi* flowed into shape. It transformed and gave birth to the Two Effulgences, the Five Wefts congealed essence. Naturally mixed and united, it forever dispelled the bound embryo. The assembly of perfected beings spread its radiance, resplendent in the Nine Pures. Blazing and expansive, the Seven Epochs aligned. The Master Lu, the Vast, illuminated the Cinnabar Heaven with crystal brilliance. Vermilion light refined and delivered, red mists dispersed luminosity. The Three Flowers flourished luxuriantly, shining upon the Thearch’s dawn. The wondrous transformation of the Great Ultimate—divine and numinous, the Crimson Writ of the Chaotic Cavern.\n\nIn former times, the Heavenly Perfected Sovereign descended upon Jade Prosperity Ascending Victory Heaven and transmitted the Numinous Treasure Great Law of the Void Thearch to the Eastern Flower Upper Minister and Cavernous Spirit Grand Master, who oversaw the left officials of the Lower Origin’s register of the living and all the immortals’ officials. The Nine Empyreans’ Total Brahma and Eight Thearchs governed the heavens, for without the Crimson Writ of the Chaotic Cavern, one could not subdue and transform the Nine Yangs and illuminate the celestial deliverance.\n\nThus, the Jade Pure Void Thearch of the Divine Empyrean’s Jade Pure Heaven rode upon the effulgent *qi* of the Nine Yangs’ pure and void Brahma to form the celestial realm. The Vermilion Empyrean’s Southern Culmen Jade Writ Heaven rode upon the vermilion numinous and wondrous *qi* of the Cavernous Yang’s radiant true and original Brahma to form the celestial realm. The Azure Empyrean’s Great Void True Culmination Heaven rode upon the vast numinous and great effulgent *qi* of the Upper Yang’s original true and numinous Unity to form the celestial realm. The Jade Empyrean’s Jade Numinous Plain Effulgence Heaven rode upon the jade numinous plain effulgent *qi* of the pure Yang’s utmost true and original Unity to form the celestial realm. The Great Empyrean’s Great Numinous True Origin Heaven rode upon the great numinous cavernous effulgent *qi* of the Three Yangs’ Nine Perfected and Great Unity to form the celestial realm. The Lang Empyrean’s Plain Numinous Luminous Origin Heaven rode upon the plain numinous luminous effulgent *qi* of the Six Yangs’ cavernous true and utmost Unity to form the celestial realm. The Purple Empyrean’s Original Numinous Upper Culmination Heaven rode upon the original numinous purple effulgent *qi* of the pure Yang’s wondrous true Heavenly Unity to form the celestial realm. The Scenic Empyrean’s Wondrous Numinous Treasure Effulgence Heaven rode upon the wondrous numinous treasure effulgent *qi* of the radiant Yang’s essence-true and void Unity to form the celestial realm. The Azure Empyrean’s Jade Effulgent Non-Ultimate Heaven rode upon the azure numinous jade effulgent *qi* of the original Yang’s heavenly true and pure Unity to form the celestial realm.\n\nThese Nine Empyreans and Nine Heavens were all opened and transformed by the Crimson Writ of the Chaotic Cavern, their luminous and wondrous Brahma’s pure essence and purple cinnabar’s upper numinous splendor forming the celestial talismanic writs and true texts. Thus, the Crimson Writ transformed the Chaotic Cavern, and the Chaotic Cavern transformed the Miro. It is the Dao of the Nine *Qi* of the Heavenly Origin, descending to transform the Nine Causes and the Eight Brahma Perfected Jade Palaces—this too is the transformation of this writ.\n\nTherefore, within the Great Cinnabar Heaven lies the Crimson Bright Thearch’s Palace, the Wondrous Profit City, the Abandoned Worthy World, governed by the Brahma Treasure Cinnabar Numinous Crimson Thearch. Within it are the Vermilion Mound’s Prefecture, the Flowing Fire’s Court, the Great Blaze’s Palace, the Crimson Brightness’s Hall, and the Cinnabar Mound’s Fire Pool.\n\nThe Celestial Venerable of Primordial Beginning refined the true writs in the very place where the Chaotic Cavern’s Crimson Writ transformed into the Brahma. In the heavens, the middle and lower Perfected could not attain this. I now bestow upon you this writ together with the *Chaotic Cavern Brahma Primordial Chart*. After six times nine kalpas, when the cyclical signs align in harmony, the *ren-chen* year will meet its measure, and the *geng-zi* year will govern transformation—naturally, all shall be revealed. Its myriad secrets, its talismanic responses, are all fixed, beyond all reckoning.\n\nThe *Chaotic Cavern Crimson Writ Brahma Primordial Chart* arises from the *qi* of the Divine Numinous Jade Treasury, the Three-and-Five Revolving Mechanism, the Central Yellow’s partitioned *qi*, the Nine Heavens’ Chaotic Yang, and the Primordial Brahma’s Miro. It gives birth to the Nine Heavens. The methods it enacts are fully recorded in the *Three-and-Five Revolving Mechanism and Cavern Yang Heavenly Immortal Secret Register*; this text does not exhaustively record them.\n\nThe *Chaotic Cavern Crimson Writ Nine Radiances’ Qi Transforming the Nine Heavens Chart*:\nAt the inception of the Nine Heavens’ portents, it gathered the Cavern Yang’s Nine Radiant *qi*, the Chaotic Cavern’s Crimson Writ, summoned and grasped the Heavenly Origin, divided the numinous, dispersed the *qi*, and thus formed the Nine Heavens. Its profound mysteries are the innermost secrets of the Divine Treasury, of utmost weight—never to be lightly revealed.\n\nThe Chaotic Cavern’s Crimson Writ is the Non-Ultimate’s Supreme Perfected. From the Primordial Ancestral Kalpa, it gave birth to the myriad heavens, illumined the Three Luminaries, and became the Root of Heaven. Above, there is no further ancestor—only the Dao is its body. The Five Writs opened and expanded, universally planting the divine and numinous. Without the Writ, there is no radiance; without the Writ, there is no illumination; without the Writ, there is no establishment; without the Writ, there is no completion; without the Writ, there is no deliverance; without the Writ, there is no birth. This is the Great Model, the Heaven within Heaven.\n\nThe Dark Mystery’s Flute Terrace, the Jade Mountain’s Upper Capital, the Supreme Ultimate’s Great Peerless Jade Clarity—vast and boundless through kalpas, now present, now absent. The Three Flowers part and separate, the Great Existence’s Wondrous Court, the Golden Gates and Jade Chambers, the vast array of purity and clarity. The great flow of Brahma *qi* circulates through the ten directions. Within it dwell the gods who deliver people from death, the Southern Culmen’s Lord of Longevity, the Controller of the World’s Marshal Great Divinity, the Life-Favoring Elder Lord Han, the Southern Supreme’s Controller of Destiny and Recorder, the Extenders of Lifespan and Augmenters of Years, the Deliverers from Tribulation’s Venerable Divinities—who turn back bones and raise the dead, delivering boundless multitudes.\n\nToday, the celestial records are being reviewed, and the myriad heavens draw near. From the Eastern Limitless, the Flying Heavenly Divine King, the Great Sage of Longevity and Boundless Deliverance, named Hu. From the Southern Limitless, the Flying Heavenly Divine King, the Great Sage of Longevity and Boundless Deliverance, named Fei. From the Western Limitless, the Flying Heavenly Divine King, the Great Sage of Longevity and Boundless Deliverance, named Pu. From the Northern Limitless, the Flying Heavenly Divine King, the Great Sage of Longevity and Boundless Deliverance, named Yunshang. From the Northeastern Limitless, the Flying Heavenly Divine King, the Great Sage of Longevity and Boundless Deliverance, named Duxian. From the Southeastern Limitless, the Flying Heavenly Divine King, the Great Sage of Longevity and Boundless Deliverance, named Wujing. From the Southwestern Limitless, the Flying Heavenly Divine King, the Great Sage of Longevity and Boundless Deliverance, named Dise. From the Northwestern Limitless, the Flying Heavenly Divine King, the Great Sage of Longevity and Boundless Deliverance, named Nayu. From the Upper Limitless, the Flying Heavenly Divine King, the Great Sage of Longevity and Boundless Deliverance, named Jueyuan. From the Lower Limitless, the Flying Heavenly Divine King, the Great Sage of Longevity and Boundless Deliverance, named Ying.\n\nThe Ten Directions’ Utmost Perfected Flying Heavenly Divine Kings, the Great Divinities of Longevity and Boundless Deliverance, all ride flying clouds, cinnabar chariots with green canopies, feathered canopies and jade wheels, drawn by vermilion phoenixes and five-colored dark dragons. They bear nine-colored standards and ten absolute numinous banners, with nine phoenixes wailing ahead and harmonious flutes sounding behind, eight simurghs singing in unison. Lions and white cranes roar and chant in harmony; the Five Elders clear the way, and the host of immortals flank the chariots. Myriad chariots and ten thousand riders float through the void to arrive. Their radiant light turns back, their chariots return, overseeing the Perfected and delivering the living.\n\nThe myriad heavens’ chancellors, the Southern Prosperity’s Upper Palace, the Recorder Han, the Overseer of Life’s Great Divinity—holding records and grasping registers—all arrive before the Thearch. According to those who ought to be delivered, they strictly review the myriad heavens and universally proclaim to the Three Realms.\n\n**Universal Proclamation to the Three Realms Talisman**\nTo the Divine Realm beyond limits, the Yellow Springs’ Curved Prefecture, the Northern Capital’s Fengdu, the Three Offices and Nine Bureaus, the Twelve River Sources—release the ancestral progenitors and karmic kin of a hundred kalpas, swiftly erase their ledgers of transgressions, extinguish their roots of evil, and let them not be detained or pressed into the ghostly throng.\n\n**Primordial Beginning’s Talismanic Mandate**\nThe Primordial Beginning’s talismanic mandate, at the appointed hour, ascends and advances. The Northern Capital’s Cold Pool guards and protects forms and souls. It subdues demons, ensures promotion, and delivers ranks to the Southern Palace. Dead souls receive refinement and transform into immortals. Living beings receive deliverance and endure through kalpas. Following the kalpas’ revolutions, they share the heavens’ years. Forever delivered from the Three Paths, Five Sufferings, and Eight Tribulations, they transcend the Three Realms and roam freely in the Upper Clarity.\n\nThe Upper Clarity’s Heaven, the Heavenly Thearch’s Jade Perfected, the Formless Realm’s Brahma conduct. The Three Realms’ Jade Caskets’ Hidden Secrets. The Four Directions’ General Hidden Secrets. The Three Clarities’ Golden Gates’ Hidden Secrets.\n\n**Primordial Beginning’s Numinous Writ, Upper Scroll**\nComposed by the Dao Lord:\n\nThe Eastern Eight Heavens’ Great Yellow August Layered Heaven, ruled by Thearch Yulan Yuming. Its correct sound: *Kai Xuan She Ming* Heaven, yellow *qi*, belonging to Brahma *qi*. The Great Brightness’ Jade Complete Heaven, ruled by Thearch Xu Anatian. Its correct sound: *Liang Xuan Dao Ling* Heaven, green *qi*, belonging to the Wall Mansion. The Clear Brightness’ He Tong Heaven, ruled by Thearch Yuan Yu Qijing. Its correct sound: *Ming Sheng Jiu Zhen* Heaven, blue-green *qi*, belonging to the House Mansion. The Dark Womb’s Level Nurturing Heaven, ruled by Thearch Liu Du Neixian. Its correct sound: *Piao Lun Mo Ran* Heaven, red *qi*, belonging to the Rooftop Mansion. The Primordial Brightness’ Writ Upholding Heaven, ruled by Thearch Chou Falun. Its correct sound: *Kai Sheng Shu* Heaven, dark green *qi*, belonging to the Void Mansion. The Upper Brightness’ Seven Luminaries’ Ma Yi Heaven, ruled by Thearch Tian Kuaiyan. Its correct sound: *Yan Xu Ming* Heaven, black *qi*, belonging to the Woman Mansion. The Void’s Transcendent Balance Heaven, ruled by Thearch Zheng Dingguang. Its correct sound: *Jing Wu Qiao* Heaven, jade-green *qi*, belonging to the Ox Mansion. The Great Ultimate’s Veiled Heaven, ruled by Thearch Qu Yu Jiuchang. Its correct sound: *A Nan Yang Ming* Heaven, purple *qi*, belonging to the Dipper Mansion.\n\nThe Eight Southern Heavens\n\nThe Vermilion Brightness’ Harmonious Yang Heaven, ruled by Thearch Li Jinshangzhen. Its correct sound: *Zhi’an Baoxian* Heaven, white *qi*, belonging to the *Fan Qi*.\n\nThe Mysterious Brightness’ Reverent Florescence Heaven, ruled by Thearch Kong Yao Chouyin. Its correct sound: *Feiyin Dongling* Heaven, yellow *qi*, belonging to the Winnowing Basket Mansion.\n\nThe Radiant Brightness’ Ancestral Drifting Heaven, ruled by Thearch Chong Guangming. Its correct sound: *Qiaozhen Ying* Heaven, green *qi*, belonging to the Tail Mansion.\n\nThe Bamboo Grove’s August Reed-Pipe Heaven, ruled by Thearch Moyi Miaobian. Its correct sound: *Nanxuan Ming* Heaven, blue-green *qi*, belonging to the Heart Mansion.\n\nThe Void Brightness’ Hall Radiance Heaven, ruled by Thearch A✷Lou Sheng. Its correct sound: *Mixuan Ming* Heaven, red *qi*, belonging to the Room Mansion.\n\nThe Contemplative Brightness’ Upright Serenity Heaven, ruled by Thearch Yu Milo Qian. Its correct sound: *Langguan Yaoming* Heaven, dark green *qi*, belonging to the Clan Mansion.\n\nThe Mysterious Brightness’ Reverent Celebration Heaven, ruled by Thearch Long Luo Puti. Its correct sound: *Weiqing Daoxuan* Heaven, black *qi*, belonging to the Neck Mansion.\n\nThe Great Resplendence’s Jade-Polished Heaven, ruled by Thearch Wan Li Wuyan. Its correct sound: *Dongzhen Yongyao* Heaven, jade-green *qi*, belonging to the Horn Mansion.\n\n---\n\nThe Eight Western Heavens\n\nThe Primordial Ascent’s Cavernous Ascension Heaven, ruled by Thearch Kai Zhendinguang. Its correct sound: *Geguang Jingzhen* Heaven, purple *qi*, belonging to the *Fan Qi*.\n\nThe Great Peace’s August Precipice Heaven, ruled by Thearch Polou Atan. Its correct sound: *Huimo Ahun* Heaven, white *qi*, belonging to the Chariot Mansion.\n\nThe Manifest Stability’s Ultimate Wind Heaven, ruled by Thearch Zhao Zhentong. Its correct sound: *Huiqiao Wei* Heaven, yellow *qi*, belonging to the Wings Mansion.\n\nThe Origin Sovereign’s Filial Vastness Heaven, ruled by Thearch Salou Louwang. Its correct sound: *Junhua Daquan* Heaven, green *qi*, belonging to the Spread Mansion.\n\nThe Great August’s Convergent Floating Countenance Heaven, ruled by Thearch Min Ba Kuang. Its correct sound: *Huiwei Guang* Heaven, blue-green *qi*, belonging to the Star Mansion.\n\nThe Non-Thought’s River Flowing Heaven, ruled by Thearch Ming Fan Guang. Its correct sound: *Langfa Yuan* Heaven, red *qi*, belonging to the Willow Mansion.\n\nThe Upper Divination’s Joyous Heaven, ruled by Thearch Bobo Jian. Its correct sound: *Luanyuan Zhenxing* Heaven, dark green *qi*, belonging to the Ghost Mansion.\n\nThe Boundless’ Cloud Vow Heaven, ruled by Thearch Piaonu Qionglong. Its correct sound: *Feitian Xuying* Heaven, black *qi*, belonging to the Well Mansion.\n\n---\n\nThe Eight Northern Heavens\n\nThe Luminous Court’s Rosy Span Heaven, ruled by Thearch Hui Jue Hun. Its correct sound: *Wu Qingming* Heaven, jade-green *qi*, belonging to the *Fan Qi*.\n\nThe Abyssal Penetration’s Primordial Cavern Heaven, ruled by Thearch Fan Xing Guansheng. Its correct sound: *Faquan Daoxian* Heaven, purple *qi*, belonging to the Three Stars Mansion.\n\nThe Great Literature’s Graceful Wondrous Completion Heaven, ruled by Thearch Nayuchou Ying. Its correct sound: *Lingxun Huiguang* Heaven, white *qi*, belonging to the Turtle Beak Mansion.\n\nThe Great Simplicity’s Elegant Joyous Prohibition Heaven, ruled by Thearch Long Luo Juechang. Its correct sound: *Yangwei Yaoging* Heaven, yellow *qi*, belonging to the Net Mansion.\n\nThe Great Void’s Supreme Constant Fusion Heaven, ruled by Thearch Zong Jian Guishen. Its correct sound: *Sheling Zhen* Heaven, green *qi*, belonging to the Hairy Head Mansion.\n\nThe Great Release’s Jade Ascendant Ascendancy Heaven, ruled by Thearch Miaomiao Xingyuan. Its correct sound: *Kongwei Daoming* Heaven, blue-green *qi*, belonging to the Stomach Mansion.\n\nThe Dragon Transformation’s *Fan* Span Heaven, ruled by Thearch Yun Shang Xuanyuan. Its correct sound: *Juling Miaoguang* Heaven, red *qi*, belonging to the Bond Mansion.\n\nThe Great Ultimate’s Level Nurturing Prosperity Heaven, ruled by Thearch Da Ze Famen. Its correct sound: *Yongxuan Jiusheng* Heaven, dark green *qi*, belonging to the Straddling Mansion.\n\n---\n\nThe secret names of all these Heavenly Thearchs are inscribed in red-crystal jade with azure characters, concealed within the Palace of the Supreme Clarity.\n\nThe Thirty-Two Heavens, the Thirty-Two Thearchs—each with their hidden names, hidden sounds, and hidden rhythms—are the spontaneous, numinous scriptures of the heavens. The hidden melodies are the celestial sounds; the Celestial Great Honored Ones are the gods of the heavens; the demons of the heavens, the spirits of the heavens—nine harmonies and ten unions transform into the Supreme Clarity. Their boundless mysteries are too profound to fathom. They spread forth divine transcendents to universally deliver heaven and humanity.\n\nToday, in joyous celebration, we traverse the passes of all heavens.\n\n**Talisman for Traversing the Passes of All Heavens**\nMay the Three Evils be extinguished, the roots of the earth severed. Soaring through the Five Households, may your name be inscribed in the Great Mystery. The Demon Kings supervise the ascent, unbound by the gates of heaven. The Eastern Dipper governs fate, the Western Dipper records names. The Northern Dipper decrees death, the Southern Dipper bestows life. The Central Dipper’s Great Chief oversees all spirits.\n\nThe Azure Thearch guards the *hun*-souls, protecting the three *hun* of those who attain the Dao, enabling their numinous clarity. The Azure Thearch’s hymn says:\n*Facing east, I bow with clasped hands,*\n*To the Jade Sovereign of the Azure Thearch.*\n*The numinous winds stir the bellows’ pipes,*\n*Nurturing all things with the primal spring.*\n*Cloud-dragons harness the solemn chariot,*\n*Jade guards encircle the jasper wheels.*\n*Withered sprouts awash in dew,*\n*Great kindness knows no bounds.*\n*Myriad immortals sing of the Dao,*\n*Exhorting heaven and humanity with care.*\n*The root of the heart, deluded, clings fast—*\n*Kneeling, I uphold the vast benevolence.*\n\n**Talisman of the Azure Thearch for Guarding the *Hun***\nSurname: Yan. Personal name: Kaiming. Style: Lingweiyang.\nInscribe in azure on white silk and wear it; receive it on the day of *Lichun*. If ingested, write on bamboo membrane, three pieces.\n\nThe White Thearch attends the *po*-souls, safeguarding the seven *po* of those who attain the Dao, preventing their dispersal and sealing the ghostly paths. The White Thearch’s hymn says:\n*The Six Jia embrace the Golden Gate,*\n*The Seven Governors guard the numinous altar.*\n*Tossed bells transform into fire,*\n*The mighty sword coils with a giant dragon.*\n*I entreat the pure numinous ones,*\n*What audacity dares violate the bright statutes?*\n*Binding and restraining demonic ghosts,*\n*The cold winds of the empyrean howl.*\n*Once baleful *qi* is stilled,*\n*The myriad heavens swiftly find peace.*\n*True companions bear great shelter,*\n*Kowtowing, they sing in joy.*\n\n**Talisman of the White Thearch for Attending the *Po***\nSurname: Shangjin. Personal name: Changkai. Style: Yaobaobao.\nInscribe in white on purple silk and wear it; receive it on the day of *Liqiu*. If ingested, write on bamboo membrane, four pieces.\n\nThe Red Thearch nurtures *qi*; the Red Thearch governs fire and can generate and cultivate primordial *qi*. The Yellow Thearch said: \"Robust fire consumes *qi*, while gentle fire generates *qi*; *qi* is nurtured only after it is warmed.\"\n\nThe Red Thearch’s hymn says:\n*The Grand Vista opens the Jade Pivot,*\n*The cavernous hall unfolds the Golden Steps.*\n*The soaring forest shades the jade terrace,*\n*The cinnabar phoenix treads upon the jasper tree.*\n*The treasure chamber, named Qu Li,*\n*Is where the radiant spirits dwell.*\n*Soaring journeys clear the clouded paths,*\n*Drawing the gaze to behold the true capital.*\n*The celestial sun endures without dusk,*\n*Layered mists seal the pure abode.*\n*The Most High’s decree unfolds the seal,*\n*Silk and table array the scripted writs.*\n*The genial wind plants the mysterious transformation,*\n*Sincerity and toil surely abound.*\n\n**Talisman of the Red Thearch for Nurturing *Qi***\nSurname: Dongfu. Personal name: Jiyan. Style: Chibiaonu.\nInscribe in cinnabar on yellow silk and wear it; receive it on the day of *Lixia*. If ingested, write on bamboo membrane, two pieces.\n\nThe Black Thearch unblocks the blood, protecting and nurturing those who attain the Dao, ensuring the blood vessels flow smoothly, flourishing throughout the body without obstruction. The Black Thearch is the Supreme Water Thearch. Water within the human body becomes blood.\n\nThe Black Thearch’s hymn says:\n*Formless, yet it governs all things,*\n*Abyssal, it is the heart of the Supreme Lord.*\n*The Dao, unopened and unrevealed,*\n*Conceals profound transformations and deep mechanisms.*\n*Fear your leaks are not yet exhausted,*\n*Lest yin thoughts encroach and overwhelm.*\n*The turning wheel knows no boundless waves,*\n*Yet the bitter path leads to mutual confusion.*\n*For ten thousand years, ever cautious and restrained,*\n*In a single day, one may sink into oblivion.*\n*Do not rush into the ghostly realms,*\n*For calamities and retributions cannot be borne.*\n\n**Talisman of the Black Thearch for Unblocking Blood**\nSurname: Heijie. Personal name: Linghui. Style: Yinhouju.\nInscribe in black on blue-green silk and wear it; receive it on the day of *Lidong*. If ingested, write on bamboo membrane, one piece.\n\nThe Yellow Thearch, Central Lord, regulates the *ying* and *wei* within the central palace, restraining the myriad spirits to prevent them from straying. If considered in relation to the body, the liver stores the *hun*, and the lungs store the *po*. When the *qi* of the Crimson Palace and the Cinnabar Field intermingle, the red *qi* descends while the mysterious spring rises. The heart stores blood, and the kidneys store essence; the two *qi* cycle and reciprocally generate and nurture one another. Within the Yellow Court, the spirit and intent reside—none of the myriad spirits may transgress.\n\nThe Yellow Thearch’s hymn says:\n*The Yellow Heaven arches the central celestial pole,*\n*Guiding the jade root of transformation.*\n*The elevated mechanism spans countless eons,*\n*Illuminating and opening the four gates.*\n*The Great Possession blends with the August True Ones,*\n*Restraining the stellar spirits.*\n*Without the Thearch’s Dao, nothing moves;*\n*All directions rely on its existence.*\n*Wrath and fury bring autumn’s frost,*\n*Harmony and joy herald spring’s warmth.*\n*Creation and completion grasp the primordial order,*\n*Looking up, we bear and wear its boundless grace.*\n\n**Talisman of the Yellow Thearch, Central Lord**\nSurname: Tongban. Personal name: Yuancheng. Style: Hanshuniu.\nInscribe in yellow on crimson silk and wear it; receive it on the day of *Tuwang*. If ingested, write on bamboo membrane, five pieces.\n\n**The Five Heavenly Demon Kings**\n\nThe Demon King of the Azure Heaven: Bayuan Choubo.\nThe Demon King of the Vermilion Heaven: Futian Danshi.\nThe Demon King of the White Heaven: Fanshan Liumu.\nThe Demon King of the Black Heaven: Jianchou Langfu.\nThe Demon King of the Yellow Heaven: Hengtian Danli.\nThe Five Thearchic Great Demons, ancestors of the myriad spirits.\n\n**Incantation of the Azure Thearch, Eastern Lord of Primordial Youth, to Dissolve Demons**\n*\"Cavernous radiance nurtures the primordial crystal,*\n*Azure splendor unfolds the Great Luminance.*\n*Spreading and fostering the nine heavens’ qi,*\n*At first birth, it offers the peerless hero.*\n*Upholding yang, it governs and commands,*\n*Cinnabar groves unite with the assembled perfected.*\n*Accumulating dawn’s first glow above,*\n*Layered brilliance illumines the rosy morn.*\n*Spirit-light blazes through the celestial net,*\n*Guarding and nurturing form and soul.*\n*Blended transformation merges with the mysterious scene,*\n*Benevolence and grace dissolve demonic hordes.*\n*Recited ten thousand times, the Dao transcends,*\n*Merit shall be inscribed in the Upper Clarity.\"*\n\n**Incantation of the Vermilion Thearch, Southern True Lord of Cinnabar Youth, to Dissolve Demons**\n*\"Three qi suffuse the numinous portal,*\n*Luminous emptiness gleams with jade cinnabar.*\n*The Vermilion Mound harbors the Thearch’s perfected,*\n*Vermilion clouds soar with crimson chariots.*\n*Governing and guiding within the ten thousand realms,*\n*Pacifying and transcending countless eons.*\n*Holding the staff, consulting the celestial records,*\n*Cavernous scriptures unfold the divine chapters.*\n*Untying knots, dispersing the roots of calamity,*\n*Molten gold shatters the wicked and treacherous.*\n*If the will can accomplish this Dao,*\n*No demonic trial shall stand before it.*\n*Preserving passage across the dark kalpas,*\n*Reveling in boundless years.\"*\n\n**Incantation of the White Thearch, Western August Lord of Radiant Youth, to Dissolve Demons**\n*\"Western numen circles the seven revolutions,*\n*Vast and distant, luxuriant with luminous splendor.*\n*White primordiality binds my spirit,*\n*August perfected govern the scene of rosy clouds.*\n*Resplendent, the threefold purity shines,*\n*Brilliant, it shatters the hundred evils.*\n*Drawing forth the extended qi of utmost reach,*\n*Golden essence nurtures the three fields.*\n*Refining and congealing to solidify jade substance,*\n*Precious radiance reflects the freshness of jasper.*\n*Demon essence shall be extinguished in trial,*\n*Reaching earth, none shall sink or be fettered.*\n*Reining in the reins of the lofty pure abode,*\n*Aligning wheels with the Most High Immortals.\"*\n\n**Incantation of the Black Thearch, Northern Mysterious Lord of Fivefold Numinosity, to Dissolve Demons**\n*\"Northern mystery’s threefold elegance suffuses,*\n*The Most High Purple Thearch dwells within.*\n*Gathering qi to grasp the dark mechanism,*\n*Creation unfolds the numinous net.*\n*Below, it governs the essence of Void and Danger,*\n*Precious nurturing of Heaven’s primordial chamber.*\n*Numinous communion with the wondrously subtle spirit,*\n*Enwrapping and guarding the hundred passes.*\n*Vast and open, it extinguishes demonic trials,*\n*Calamities and disasters shall never encroach.*\n*The Great Dao preserves the natural order,*\n*Lifespan suffers no loss or decay.*\n*Through ten thousand kalpas, it enjoys blessed assemblies,*\n*Ascending the cloud-wheel in broad daylight.\"*\n\n**Incantation of the Yellow Thearch, Central Primordial Lord of Primordial Youth, to Dissolve Demons**\n*\"Blended transformation returns to the profound and subtle,*\n*The Primordial Thearch unites the Thearchic numina.*\n*The True Elder seals the Yellow Portal,*\n*The Four Governors align with the mysterious balance.*\n*Circular splendor soars above the Great Expansion,*\n*Together they grasp the Firm Jade Lord.*\n*Congealing essences to fortify the hundred bones,*\n*Jasper radiance enfolds the embryonic immortal.*\n*Morning brilliance pours into the luminous scene,*\n*Demons reflect and self-annihilate their forms.*\n*Myriad Dao preserves without loss,*\n*Reverting age to return to childlike infancy.*\n*The Five Assemblies merge into one qi,*\n*Soaring in flight to transcend the cloud capital.\"*\n\n---\n\n**Jade Text of the Azure Heavenly Demon King to Subdue Evil**\nSurname: Bin. Personal name: Chichengba.\n*\"Luxuriant and verdant, the azure crystal,*\n*Cavernous scene unfolds its brightness.*\n*Primordial yang’s ninefold qi,*\n*Stilled splendor nurtures the soul.*\n*Flowing hero of the wondrous palace,*\n*Numinous perfected, supreme spirit.*\n*Jasper and jade cloud-crown,*\n*Soaring light, feathered throng.*\n*Azure-waisted Jade Maidens,*\n*Most High Perfected Ones.*\n*Preserving passage through the immortal registers,*\n*Dissolving demons, dispelling miasma.\"*\n\nThis text, in communion with the Azure Thearch’s great talisman, transforms in unison, its regulatory power identical in efficacy.\n\n**Jade Text of the Vermilion Heavenly Demon King to Subdue Evil**\nSurname: Fo. Personal name: Yousu.\n*\"Prosperous yang, True Elder,*\n*Vermilion numinous august spirit.*\n*Governing the Cinnabar Heaven,*\n*Inspecting and restraining demonic hordes.*\n*Solemnly driving the vermilion phoenix,*\n*Three-horned qilin.*\n*Ascending the Dao of the Supreme Clarity,*\n*Root of the mysterious and primordial.*\n*Flaming blaze of the threefold qi,*\n*Coiling and descending in clouds.*\n*Nurturing the cinnabar palace,*\n*Preserving and governing for eternal endurance.\"*\n\nThis text, in communion with the Vermilion Thearch’s great talisman, transforms in unison, its regulatory power identical in efficacy.\n\n**Jade Text of the White Thearch’s Demon King to Subdue Evil**\nSurname: Chi. Personal name: Zhangbu.\n*\"Sevenfold numinous radiant qi,*\n*Threefold scenes of primordial perfection.*\n*Within resides the August Elder,*\n*Controlling and restraining demonic essence.*\n*Officers of Geng and Xin,*\n*Seven hundred thousand troops.*\n*Feathered banners, cloud standards,*\n*Golden tigers, cloud-borne gallop.*\n*Severing and eliminating the demonic and deluded,*\n*Refining and nurturing the flowering hero.*\n*Abiding with the Dao for eternal endurance,*\n*Through kalpas without collapse.\"*\n\nThis text, in communion with the White Thearch’s great talisman, transforms in unison, its regulatory power identical in efficacy.\n\n**Jade Text of the Black Heavenly Demon King to Subdue Evil**\nSurname: Xu. Personal name: Zhishi.\n*\"Northern darkness, somber and solitary,*\n*Palace of the mysterious qi.*\n*Thearchic perfected in numinous assembly,*\n*Driving spirits, charioting dragons.*\n*Within the chamber, Jade Maidens,*\n*Lads of nocturnal radiance.*\n*Holding the illustrated registers,*\n*Seizing and restraining demonic traces.*\n*Void and Danger merge in transformation,*\n*Purple mist spurs the wind.*\n*Precious crystal refines and nurtures,*\n*Posterior heaven knows no end.\"*\n\nThis text, in communion with the Black Thearch’s great talisman, transforms in unison, its regulatory power identical in efficacy.\n\n**Jade Text of the Yellow Heavenly Demon King to Subdue Evil**\nSurname: Tianmen. Personal name: Bokuang.\n*\"Primordial Thearch, supreme numen,*\n*August One of the profound and subtle,*\n*Blended perfection of uncarved simplicity,*\n*Mysterious root of creation and transformation.*\n*Stirring the dark and subtle,*\n*It engenders the great spirit.*\n*Drawing forth the myriad qi,*\n*Assembling in the flowering chamber.*\n*Dissolving the hundred demons,*\n*Flourishing together with the Dao.*\n*Preserving passage, averting calamity,*\n*Extinguishing trials, eliminating misfortune.\"*\n\nThis text, in communion with the Yellow Thearch’s great talisman, transforms in unison, its regulatory power identical in efficacy.\n\n---\n\n**Talismans of the Five Thearchs**\n\n**Azure Thearch’s Talisman to Govern Demons and Summon Perfection**\nThe talisman’s officer, Hua, commands nine hundred thousand troops to guard its text. This talisman, together with the previously mentioned vermilion-script true text, is to be inscribed in cinnabar on purple silk on a *jia* or *yi* day of spring and placed in the eastern direction. It wards off the myriad calamities, eternally preserves and stabilizes, summons and extends auspicious omens, and ensures abundance and timely prosperity. Those who study the Dao should ingest it at the proper time; after three years, the essence of azure jade shall grow within the liver palace, its light radiating beyond the body. Upon completion of the Dao, the Azure Thearch shall summon and welcome them. Those who wear it with sincerity shall dissolve misfortunes and disasters—utmost reverence is required.\n\n**Vermilion Thearch’s Talisman to Govern Demons and Summon Perfection**\nThe talisman’s officer, Mingzhen, commands three hundred thousand troops to guard its text. This talisman, together with the previously mentioned vermilion-script true text, is to be inscribed in cinnabar on green silk on a *bing* or *ding* day of summer and placed in the southern direction. It wards off the myriad calamities, eternally preserves and stabilizes, summons and extends auspicious omens, and ensures abundance and timely prosperity.\n\nThose who cultivate the Dao shall wear it in due season. After three years, the essence of vermilion jade shall grow within the heart palace, its light radiating beyond the body. Upon completion of the Dao, the Vermilion Thearch shall summon and welcome them. Those who wear it with sincerity shall forever dissolve misfortunes and disasters.\n\n**White Thearch’s Talisman to Govern Demons and Summon Perfection**\nThe talisman’s officer, Maocheng, commands seven hundred thousand troops to guard its text. This talisman, together with the previously mentioned vermilion-script true text, is to be inscribed in white on yellow silk on a *geng* or *xin* day of autumn and placed in the western direction. It wards off the myriad calamities, eternally preserves and stabilizes, summons and extends auspicious omens, and ensures abundance and timely prosperity.\n\nThose who cultivate the Dao shall wear it in due season. After three years, the essence of white jade shall grow within the lung palace, its light radiating beyond the body. Upon completion of the Dao, the White Thearch shall summon and welcome them. Those who wear it with sincerity shall forever dissolve misfortunes and disasters.\n\n**Black Thearch’s Talisman to Govern Demons and Summon Perfection**\nThe talisman’s officer, Shouyuan, commands five hundred thousand troops to guard its text. This talisman, together with the previously mentioned vermilion-script true text, is to be inscribed in black on white silk on a *ren* or *gui* day of winter and placed in the northern direction. It wards off the myriad calamities, eternally preserves and stabilizes, summons and extends auspicious omens, and ensures abundance and timely prosperity.\n\nThose who cultivate the Dao shall wear it in due season. After three years, the essence of dark jade shall grow within the kidney palace, its light radiating beyond the body. Upon completion of the Dao, the Black Thearch shall summon and welcome them. Those who wear it with sincerity shall forever dissolve misfortunes and disasters.\n\n**Yellow Thearch’s Talisman to Govern Demons and Summon Perfection**\nThe talisman’s officer, Xieming, commands ten million troops to guard its text. This talisman, together with the previously mentioned vermilion-script true text, is to be inscribed in cinnabar on yellow silk on a *wu* or *ji* day of the four seasons and placed in the central direction. It wards off the myriad calamities, eternally preserves and stabilizes, summons and extends auspicious omens, and ensures abundance and timely prosperity.\n\nThose who cultivate the Dao shall wear it in due season. After three years, the essence of yellow jade shall grow within the spleen palace, its light radiating beyond the body. Upon completion of the Dao, the Yellow Thearch shall summon and welcome them. Those who wear it with sincerity shall forever dissolve misfortunes and disasters.\n\nThe Flying Drum follows, commanding the ghostly troops, brandishing banners and beating drums, roaming and observing the great void. Self-proclaimed resplendent, all heavens unite in merit. Ascending to deliver humanity, sternly subduing the Northern Feng. The Divine Lords receive their mandate, universally sweeping away inauspiciousness. The Eight Mighties spew poison, fierce horses spread in four directions. Heavenly soldiers lead the way, great marshals wield their weapons. Fire is cast for ten thousand miles, flowing bells resound in eight directions. Should any dare to challenge or obstruct the perfected ones, the golden axes shall strike first, the mighty天后 shall execute punishment. Demons and specters shall be slaughtered, wind and fire shall never cease. Thousands upon thousands shall be beheaded, myriads upon myriads shall be dismembered. No demon shall dare to offend, no ghost shall harbor malevolence. The Three Palaces of Northern Feng shall inspect the ghostly camps. None shall be concealed, all shall be reported by the Golden Horse Courier. Universally proclaimed without end, all spirits shall heed. The Three Realms and Five Thearchs shall report to the Supreme Clarity. Thus concludes the *Marvelous Scripture of the Upper Chapters on the Limitless Salvation of Humanity from the Numinous Treasure* and its talismanic illustrations.\n\n**Yuan Dun Jade Calendar Chapter**\nTrue Yang unfolds transformation, the Brahma of boundless circulation. The Golden Tower stands above, the Jade Palace resides in the east. Five patterns interweave, nine apertures radiate brilliance. The marvelous qi naturally harbors unfathomable mysteries. The Three Numinous Ones together penetrate the myriad sages’ ancestral origin. Examining and verifying cultivation, marking and recording true merit. With spirit fully attuned, one merges with the Dao in unity. Securely stabilizing the imperial registers, enduring for a hundred million kalpas without end.\n\nOf old, in the primordial chaos of Hunyuan, the great Brahma of Miro, before the heavens were divided, the Nine Yangs merged in darkness. Thrice derived, ninefold transformed, six changes and seven revolutions. The Primordial Beginning took form, the Five Kalpas first unfolded. Thereupon, the Lord of the Dao of the Dawn of the Brahma Yuan Ancestor was commanded to record the celestial origin, traversing the Five Kalpas. Thus, *Yuan Dun* clarifies the ancestral qi; the *Jade Calendar* records the celestial origin. Five kalpas complete a cycle, returning to the One. From the One qi’s transformation and division, thrice derived to form nine—like dragons, like serpents, coiling through nine paths. Vast and boundless, it encompasses the primordial qi of the Nine Yangs. The Supreme One, through the threefold ninefold Brahma operation and the threefold fivefold primordial reckoning, combined forty-two qi to inaugurate the Azure Heaven. The qi of the Yuan Ancestor brightened, the eastern beginning of the Azure Primordial responded to the initial flourishing of the Nine Yangs’ Wood Thearch. Thus, the East received nine qi to divide the celestial realm, the kalpa named Longhan.\n\nNext, the ninefold derivation repeated, the yang qi unfolded and brightened. Vermilion patterns flowed with light, spreading across the five measures, unfolding the charts and cinnabar writings. The Supreme One, through threefold fivefold reckoning and threefold revolutions of vermilion essence, combined twenty-four qi to inaugurate the Vermilion Heaven’s Yuan Ancestor qi. Illuminating the southern beginning of the Vermilion Primordial, it responded to the initial flourishing of the Three Yangs’ Fire Thearch. Thus, the South received three qi to divide the celestial realm, the kalpa named Chiming.\n\nNext, the ninefold derivation accumulated again, the Central Yellow transformed the primordial. Heavenly wefts coiled and encircled, the Brahma Yuan rode the fivefold. The Supreme One, through fivefold fivefold threefold revolutions, blended the twelve yangs, combining fifty-two qi to inaugurate the Central Yellow Heaven’s Yuan Ancestor qi. Illuminating the central numinous Yellow Flower’s radiance, it responded to the initial flourishing of the Five Yangs’ Earth Thearch. Thus, the Central Realm received twelve qi to divide the celestial realm, the kalpa named Shanghuang.\n\nNext, the ninefold primordial repeated, the pristine luminosity inaugurated the yang. Sevenfold brightness illumined the Brahma, fivefold wefts rode the heavens. The Supreme One, through sevenfold fivefold threefold reckoning, combined thirty-six blacks to inaugurate the Pristine Numinous Heaven’s Yuan Ancestor qi. Illuminating the western radiance of the White Flower, it responded to the initial flourishing of the Seven Yangs’ Metal Thearch. Thus, the West received seven qi to divide the celestial realm, the kalpa named Yankang.\n\nNext, the ninefold derivation completed its cycle, transformation merged and returned to the origin, the One qi inaugurated brightness. The Supreme One, through twofold fivefold reckoning and thirteenfold accumulation of primordial yang, combined thirty qi to inaugurate the Northern Mysterious Heaven’s Yuan Ancestor qi. Illuminating the supreme luminosity of the Dark Mystery, it responded to the initial flourishing of the One Yang’s Water Thearch. Thus, the North received five qi to divide the celestial realm, the kalpa named Kaihuang.\n\nThus, the Five Kalpas having completed their cycle, the vast heavens took form.\n\nOne qi merged with the Dao, eight realms streamed with light;\nThree accumulations, ninefold reckoning—eight directions unfurled their radiance.\nEight Thearchs manifested form, nine heavens divided their transformations.\nThus, the Primordial Celestial Venerable commanded the Heavenly Perfected Sovereign to inscribe the Jade Chronicle, recording the inception of the Cavernous Undifferentiated Transformation, the foundational cycles of kalpas and revolutions, the division of celestial realms, and the coalescence of the Cavernous Primordial Upright Yang qi into the Jade Chronicle. Therein were marked the kalpic revolutions of Heavenly Perfected Ones and Heavenly People, the path of merit’s ascent and retreat, and the nine grades of the Nine Sages.\n\nThese profound mysteries reside within the Jade Treasury, with further details expounded in *The Wondrous Ninefold Registers of the Nine Daoist Mysteries of the Grand Tenuity*.\n\n**Chart of the Nine Heavens’ Brahmanic Emptiness**\n**Chart of the Five Kalpas’ Inaugural Transformations and Brahmanic Primordial Undifferentiated Luminous Jade Chronicle**\n\n**Dragon Han’s Beginning Azure Jade Chronicle’s Precious Stanzas, Inaugurating the Nine Yangs’ Heavenly Primordial Brahmanic Florescence qi**\nNine Yangs’ wondrous qi revolves, three luminances scatter primordial essence.\nVerdant mists float the numinous script, azure forests gleam with refined blossoms.\nTranscendent, distant—Jade Clarity’s precincts; remote, boundless—Penglai’s isles.\nTrue transformations traverse the unbroken, divine winds nourish the myriad beings.\n\n**Vermilion Luminance’s Cinnabar Light Jade Chronicle’s Precious Stanzas, Inaugurating the Three Yangs’ Heavenly Primordial Brahmanic Numinous qi**\nVast kalpas unfold divine workings, dragon scripts ripple with crimson clouds.\nEight Might surge like lightning, nine phoenixes shatter malevolence.\nRefined and delivered to the Cinnabar Thearch’s chamber, ascending to the Primordial Celestial’s abode.\nFlaming luminance perpetually illumines, numinous blessings inherit the dawn’s splendor.\n\n**Supreme Thearch’s Central Numinous Jade Chronicle’s Precious Stanzas, Inaugurating the Five Yangs’ Heavenly Primordial Brahmanic Treasure qi**\nUndifferentiated Yellow gave birth to the One qi, responsive transformations congealed true form.\nSupreme virtue upheld gentleness and compliance, golden light pierced the profound obscurity.\nEstablishing the center, it encompassed the Nine Ultimates; grasping the root, it governed the Three Luminaries.\nResplendent atop the celestial apex, flying radiance dazzled the Jade Numinous.\n\n**Yankang’s Primordial Numinous Jade Chronicle’s Precious Stanzas, Inaugurating the Seven Yangs’ Heavenly Primordial Brahmanic Florescence qi**\nYellow and Lao stored numinous essence, metal’s essence gleamed with Dipper’s majesty.\nSix Heavens were all vanquished, the myriad treasures returned to subtle obscurity.\nBracing qi floated above lofty palaces, frigid light suffused pristine radiance.\nEmpty Unity unfurled jade reins, resplendent—nine heavens soared.\n\n**Kaihuang’s Mysterious Supreme Jade Chronicle’s Precious Stanzas, Inaugurating the One Yang’s Heavenly Primordial Brahmanic Undifferentiated qi**\nFive qi aligned with primordial subtlety, all heavens merged with Grand Obscurity.\nCelestial essence flew with feathered darkness, jade maidens scattered azure blossoms.\nPurple registers sealed the celestial treasures, mysterious light chilled the Thearch’s court.\nAll demons revered the supreme transformation, the myriad lands preserved peace and tranquility.\n\nThe Primordial Cavernous Jade Chronicle—Dragon Han, Yankang—spanning boundless kalpas within the primordial chaos, above without layered hues, below without fathomless abyss.\nWind and marsh pervaded the void, vajra rode the heavens.\nAbove the heavens and below the heavens, no obscurity nor darkness, no form nor shadow, no limit nor end—vast Brahmanic expanse, boundless and lightless.\n\nVermilion Luminance unfolded its chart, the revolutions of destiny moved naturally.\n\n**Chart of the Heavenly Discipline’s All-Encompassing**\n**The Primordial Celestial’s Pacifying and Spreading Fivefold Vermilion Writ of Jade Script and Eight Might Dragon Script**\n\n**First Scroll**\nLuminous qi engendered and nurtured, wood’s essence took flight as blossoms—benevolent and gracious qi proliferated the myriad beings.\nHeaven’s boundaries and earth’s networks aligned with the seasons, all in rectitude.\nCongealing radiance in the divine realm, coalescing into Azure Writ, its light illumined ten thousand leagues.\nTitled *Supreme Clarity’s Nine Perfected Pacifying and Transforming Upper Love Jade Talisman*.\n\n**Second Scroll**\nGrand Cinnabar’s qi suffused light, resplendent and dazzling—whirling and transforming into fire, refining the Nine Yins.\nCrimson script congealed into stanzas, its patterns most extraordinary.\nSpreading to illumine nine hundred million, its essence shone brilliantly in the heavens.\nTitled *Intertwining Spirits’ Luminous Jade Transformation Talisman*.\n\n**Third Scroll**\nYellow Perfected’s qi congealed essence into flying blossoms.\nCentral Void’s qi, the undifferentiated Yellow Primordial’s essence.\nInterflowing through calendric rhythms, responsive transformations engendered script.\nLight dazzled ten thousand leagues, essence’s radiance blazed.\nAmidst the celestial apex, titled *True Thearch’s Undifferentiated Cinnabar and Solemn Mystery Talisman*.\n\n**Fourth Scroll**\nPrimal Might’s restraining qi streamed with refined purity.\nWafting authority illumined the divine, congealing into script.\nLight illumined ten thousand leagues, its patterns most extraordinary.\nArrayed brilliance vanquished the myriad demons.\nTitled *Eight Might’s Restraining Dragon, Taming Tiger, Flying Blossoms, and Grand White Jade Transformation Talisman*.\n\n**Fifth Scroll**\nMysterious essence radiated, the myriad things took form.\nGenerative origins inexhaustible, the celestial chronicle had its reckoning.\nJade Thearch’s Supreme Minister, loftily observed numinous transformations.\nGrasping and unfolding the mysterious sequence, inaugurating the celestial teachings.\nRegistering and sealing the myriad Thearchs, mysterious perfection harmonized.\nCelestial script spread its brilliance, canonically binding the pure rhythms.\nHeavenly transformations consummated, congealing into jade stanzas.\nLight illumined nine hundred million, titled *Luminous Discipline’s Mysterious Portents of the Grand Obscurity’s Nine Transformations Talisman*.\nPreserving and restraining kalpic revolutions, ensuring the heavens endure forever.\n\nBrahmanic qi pervaded the cosmos, the myriad Brahmans unfolded.\nPrimordial discipline flowed and evolved, the thirty-two heavens.\nRevolving without form, cycling through the ten directions.\nRotating the Dipper, traversing the Winnowing Basket, revolving through the Five Constants.\nThirty-five divisions, aggregating qi in the Supreme Mystery.\nEight luminances obscurely merged, qi entered the Profound Mystery.\nWithin the Mystery, the Grand Supreme Thearch, the Lofty Perfected.\nFloating upon the Grand Rosy Clouds, chanting and intoning the Cavernous Stanzas.\nGolden Perfected’s fragrance wafted, flowing echoes through cloudy encampments.\nJade tones gathered qi, numinous winds amassed mists.\nPurple Void’s luxuriance, assisting and aiding the myriad immortals.\nA thousand harmonies, ten thousand unions—naturally attaining perfection.\nWithin the Perfected dwelled the divine, the Great Lord of Longevity:\nLord Wu Ying, Venerable Bai Yuan, Grand Monad Controller of Destiny, Peach Prosperity and Longevity.\nGrasping talismans, holding registers, preserving life and rooting destiny.\nRoaming the Supreme Clarity, entering and exiting the Flowery Chambers.\nWithin the Eight Obscurities, amidst the subtle and minute.\nBelow, they governed the human body—Mud Pill Palace and Crimson Palace;\nCentering, they ordered the Five qi, harmonizing the hundred spirits.\nTen revolutions returned the numinous, the myriad qi ascended as immortals.\nThe immortal path prized life, boundlessly delivering beings.\nAbove, the Eight Gates were opened, the Flying Celestial Dharma Wheel.\nSins and blessings, prohibitions and precepts, karmic destinies and causes.\nUniversally receiving deliverance, the dead souls embodied life.\nOnce the body received life, it ascended to hear the myriad heavens.\nAbove the myriad heavens, each had its Gate of Life.\nWithin dwelled the *Empty Cavern’s Hymns and Songs*, the *Mara King’s Numinous Scroll*—their verses matched the Lofty Perfected.\n\nThe First Aerial Melody of the Desire Realm: The Demon King’s name is Yumo.\nThe human path is distant and faint, the immortal path vast and boundless.\nThe ghostly path delights—yet it is the Gate of Human Life.\nThe heavenly path treasures life, the ghostly path treasures death.\nThe immortal path is ever auspicious, the ghostly path ever inauspicious.\nThe lofty, pure, and numinous soar, their mournful songs resounding through the great void.\nI only wish the immortal path to flourish, not the human path to wither.\nIn the Northern Capital’s Yellow Springs and Crooked Mansion, a myriad ghosts gather,\nAll seeking to cut short human destiny, to sever the Gate of Human Life.\nAh! Sing the Cavern’s Hymns to subdue the Northern Feng of Luo.\nBefore dispatching the demonic spirits, sever the blades of the Six Ghosts.\nThe qi of the myriad heavens surges boundlessly—my Dao daily ascends in glory.\n\nThe Second Melody of the Form Realm’s Demon King: The Demon King’s name is Moluo.\nLofty and expansive, luminous qi spreads in all four directions,\nThe Brahma-conduct of the heavens encircles the ten directions.\nThe boundless great spirits all arise from my body.\nI possess the Cavern’s Hymns—recite them ten thousand times to attain immortality.\nThe immortal path values deliverance, the ghostly path clings to it.\nHeaven and earth stretch vast and dim, foul qi swirls thickly.\nThe Three Realms delight—pass beyond them to abide forever.\nCross my realm, and your body enters spontaneity.\nAt this moment of joy, how slight is my grace!\nThe Dragon Han eon surges boundlessly—how can one distinguish the true?\nMy realm is hard to cross, so I compose the Cavern’s Scriptures.\nTransforming and soaring through the void, I test your body.\nSuccess or failure, slackening or retreat—how few are those who cross!\nLaughing at those who fail to cross, I sing this melody.\n\nThe Third Melody of the Formless Realm’s Demon King: The Demon King’s name is Shao.\nAbove the Three Realms, the vast and distant Great Luo,\nBeyond the roots of form, clouds layer in towering peaks.\nOnly the Primordial Beginning dwells in the House of Vast Kalpas.\nMy realm is ordered and governed, inheriting the Mysterious Capital.\nThose who transgress my realm enter the Jade Void.\nI, the supreme king, rectify and command the host of demons.\nTen thousand transformations in the void, foul qi blooms in profusion.\nFew preserve the true—many are deluded.\nThe immortal path is hard to secure, the ghostly path easy to stray.\nThe human path lies in the heart—truly, it does not depend on others.\nThe immortal path values substance, the human path values splendor.\nIf you do not delight in the immortal path, how can you pass the Three Realms?\nShould you wish to turn the Five Paths, what can I do for you?\n\nAbove these Three Realms, amidst the soaring void,\nThe demon kings’ melodies harmonize with the Cavern’s Hymns.\nRecite them a hundred times, and your name ascends to the Southern Palace;\nA thousand times, and the demon kings safeguard and welcome you;\nTen thousand times, the Dao is perfected, and you soar into the great void.\nCrossing the Three Realms, you ascend to the rank of Immortal Elder.\nThose who hear the numinous melodies—the demon kings show reverence in form.\nThey command the earth spirits,\nIssuing talismans to command the earth spirits,\nEscorting and welcoming, delivering from the earthly prisons,\nRescuing from the Five Sufferings and Eight Hardships, raising the seven generations of ancestors,\nForever departing the ghostly bureaus.\nThe soul crosses the Vermilion Mound, undergoes refinement, and is reborn—\nThis is called boundless deliverance, universal salvation without end.\n\nThere are secret celestial texts, revered by all heavens.\nThose who leak or slight them fall into hell, their misfortune extending to the seven generations of ancestors.\n\nRecite the Cavern’s Hymns—\nThe Vermilion and Yellow of Tortoise Mountain, the Flying Mystery of the Purple Script—\nThis is the true text of the Cavern’s Hymns, the very one the Form Realm’s Demon King called \"my Cavern’s Hymns.\"\nThe Flying Mystery’s purple qi congeals the numinous root,\nThe net of Jade Numinosity binds the myriad spirits.\nIn the void, it seethes and coalesces naturally,\nAbove, twelve layered mounds transmit it.\nJade towers towering, radiant with luminous clouds,\nFlowing essence in the purple watchtowers, girded with golden chariots.\nResplendent jasper terraces encircled by eight soaring qi,\nWithin dwell the Nine Numinous Immortals of Azure Gold.\nThe Vermilion and Yellow True Mother is called Jingyan,\nWearing a flying azure feathered robe and a morning infant’s crown.\nIn her left hand, she holds a jade scepter and grasps the numinous banner,\nThe Five-Colored Life Demon faces the Imperial Honored One.\nHolding the talismanic registers before the Gate of Life,\nShe chews the sun and moon, sips the Jade Spring.\nRadiance from Li and Luo refines the five souls,\nInternally full, externally overflowing, the Crimson Talisman rejoices.\nGolden light shines brilliantly, the form perfectly round,\nFrom the new moon it enters the golden hue, turbid and indistinct.\nOnly the Enlightened One understands these words,\nThe fifth day of the fifth month, the essence of the Northern Origin.\nCarved and seen, the Flowery Canopy leads the Immortal Lords,\nPurple qi swirls leftward, linking with the Dipper.\nPassing through the twenty-eight lunar lodges to enter the Golden Gate—\nThis is where the Vermilion Emperor reviews the myriad immortals.\nThose who clearly understand this secret and apply diligent effort,\nUnfolding their forms and contemplating deeply, always discerning,\nWill perceive the wondrous scenes and attain the essential text.\nIn three years, they will surely secure long life.\nIn nine years, they will ride the void, donning feathered skirts,\nLightly soaring in phoenix robes to ascend Dragon Mountain.\nLooking up and down, they pay homage to the Nine Numinous Ones and the Jade Dawn,\nMerging with spontaneity to pay court to the Highest Clarity.\n\nCultivate this Dao in the first, second, third, fourth, sixth, seventh, eighth, ninth, eleventh, and twelfth months—\nTen months in a year.\nOn the third, fifth, ninth, fifteenth, and twenty-fifth days of each month—\nFive times a month—\nPurify and fast, reciting the Mystery Text once.\nAfter midnight, step into the central courtyard, gaze upward, and contemplate the Flowery Canopy within the Northern Dipper,\nWhere purple cloud qi emerges from the Dipper, swirling leftward,\nPassing through the twenty-eight lunar lodges to return above the Golden Gate.\nIf among humans the sky is overcast and lightless,\nContemplate within the chamber as prescribed, ensuring clarity.\nAfter contemplation, bow four times to the purple cloud at heart,\nKnock the teeth three times, and intone while gazing upward:\n*\"The night sky is bright and clear, the hidden and void reveal the true.\nFlowing clouds linger, golden blossoms bestow their grace.\nThe Vermilion Emperor spreads his radiance, numinous flight in the purple chariot.\nThis evening unfolds, Azure Gold receives the immortals.\nFulfill my lofty wish, may my body accord with spontaneity.\nBind the life to the moon’s essence, safeguard the years and days’ root.\nThe Three Numinous Ones merge with the scene, forever abiding on Dragon Mountain.\nIn the secret night, pure and unveiled, I request as spoken.\"*\nFinish, then knock the teeth, drawing in purple qi twenty-eight times before stopping.\n\nPractice this for three years, and there will be signs of divine descent upon your sleeping mat.\nYour body will be enveloped in purple qi, a single form interwoven with light,\nYour name inscribed in the Nine Heavens—you will surely attain the rank of Highest Immortal.\nWhen purple cloud qi appears in the heavens,\nDrying the sun and moon, dividing the five stars,\nIn the lands of their directions, there will be those who unite with the Dao.\n\nThe lord who attains immortality—\nsuch is the mark of this noble one, whose sign appears of itself.\nWhen you see the purple cloud, then follow the text and perform the rites of invocation,\nwithout needing to wait for the appointed day.\nApply yourself with diligence, and when the cloud descends at the appointed time,\nthere will be an ascension and a meeting.\n\nThis must be held within the heart alone;\ndo not lightly reveal it to others.\nIf the Dao is leaked, its numen scatters,\nand the immortal qi will have no means to take form.\nAs with Master Wen Shi, Lord Yin,\nwho attended the Golden Gates—\nthe Sage Lord set him as the standard.\n\nTake heed of these signs and strive to practice them.\nThe Dao says: These two chapters are the hidden voices of the Heavenly Thearchs of all heavens\nand the most numinous demon kings,\nall words of the Great Brahmā,\nnot the common speech of the world.\nTheir words lack ornate rhythm,\ntheir melodies lack florid grace.\nThus are they profound and obscure,\ndifficult to fathom in detail.\nThey are treasured by the heavens above,\nconcealed in the Purple Tenuity’s Upper Palace of Mystic Capital.\nAccording to the Mystic Statutes, they are transmitted but once in forty thousand kalpas.\nIf there be a perfected one whose heart is as steadfast as metal,\nwho follows the ancient protocols and pledges oaths to the Ten Heavens,\nonly then shall they be entrusted.\n\nThe Dao says: The revolutions of heaven and earth, too, have their ends in adversity.\nThe sun, moon, and five stars, too, have their waxings and wanings.\nEven the most sagely and divine beings have their times of flourishing and decline.\nAnd those of shallow learning, too, have their afflictions and harms.\n\nWhenever such calamities arise, those of shared qi must unite in heart to perform purification rites, burn incense in the six periods of the day, and recite the scriptures ten times over—whereupon virtue and power descend at once, dispelling all inauspicious omens. These boundless texts universally deliver limitless beings.\n\nThe Dao says: Those of shallow learning in the Way, or whose immortal rank remains unfulfilled, when their destined time of passing arrives, shall traverse the Great Yin. At the hour of their departure, fellow perfected ones of shared learning shall burn incense and recite the scriptures ten times, thereby delivering the bodily form according to the proper method. The hun-soul shall ascend directly to the Southern Palace, where, in accordance with the merit of their practice, they shall be reborn after a reckoning of days. Having thus transmigrated without annihilation, they shall attain the immortals’ ranks.\n\nThe Dao says: When the revolutions of heaven and earth reach their end, one must perform purification rites, burn incense, and recite the scriptures. When the stellar lodges fall into disarray and the sun and moon lose their proper course, one must perform purification rites, burn incense, and recite the scriptures. When the four seasons lose their order and yin and yang fall out of harmony, one must perform purification rites, burn incense, and recite the scriptures. When the sovereign faces calamity and warfare erupts on all sides, one must perform purification rites, burn incense, and recite the scriptures. When pestilence spreads and the multitudes perish, one must perform purification rites, burn incense, and recite the scriptures. When a teacher or companion passes from this life, one must perform purification rites, burn incense, and recite the scriptures.\n\nFor the merit of purification rites and scripture recitation is most weighty: above, it dissolves heavenly calamities and safeguards the emperor; below, it wards off poison and harm, delivering the multitudes. In life and death, all depend upon it—its blessings are beyond measure, and thus it is called the boundless universal deliverance of heaven and humanity.\n\nThe Dao says: Whoever possesses these scriptures and performs such meritorious deeds for heaven, earth, the sovereign, and the multitudes—on the day of calamity, if they resolve in heart to perform purification rites, burn incense, and recite the scriptures ten times—shall have their names recorded by all the heavens, with ten thousand spirits attending in guard. Those distinguished as perfected ones shall thereby become ministers of the Golden Gates of the Sagely Lord. The heavens record the merits and transgressions of humanity without the slightest error. The demon kings of heaven shall also safeguard your person, and those who attain the Way shall come to comprehend these most profound teachings.\n\nThe boundless hidden speech of the Great Brahma in the heavens,\nThe Central Chapter of the Numinous Writ of the Primordial Beginning,\nComposed by the Dao Lord of the Eastern Eight Heavens.\n\nThe Primal Venerable Azure, the Harmonious Contemplator of Sound.\nThe Radiant Head of Xuanyan, the Dharma-Grasping Bodhi-Tam.\nJiana Ayu, the Sudden Chant of Huhaluo.\nThe Curved Splendor of Huadu, the Fresh Bodhi-Blossom Attained.\nThe Falling Great Brahma, scattering mist and felicitous clouds.\nFlying and sprinkling upon the Jade Capital, the Luminous Demons ascend the gate.\nThe Peerless Foremost of Non-Action, the Revolving Tread of Flowing Mystery.\nAdhara and Nāga-Rāja, the Four Symbols sigh in harmony.\n\n**Eastern Numinous Script**\nKnock the teeth nine times, visualize the nine-colored dragons guiding before and behind, with nine layers of azure clouds enveloping the body.\nRecite the esoteric incantation:\n*\"Vermilion Radiance unfolds the chart, the eight qi return to the True.\nGoverning the Primordial Pass, the Azure Emperor, Great Spirit.\nFlowing transformation beyond the nine realms, entwining my body.\nThe numinous sounds of the Eight Scripts, sixty-four chapters.\nPenetrating heaven and earth, uniting with me in transcendence.\nDriving the dragon-chariot, ascending to the imperial axle.\"*\nUpon completion, draw in qi and swallow nine times.\nPracticing for nine years, the eight heavens each dispatch eight azure-waisted jade maidens and eight azure-flower jade lads to attend the body, bestowing the essence of the nine azure numina. The body’s radiance shines through the formless void. After ten thousand recitations, the Dao is accomplished, and one gains the power of flight. Seven generations of ancestors share the blessing, all ascending to the Southern Palace.\n\n**Southern Eight Heavens**\nThe Southern Yan-Dong-Floating Realm, where jade pupils gleam.\nBrahma-forms descend from the void, the Nine Numinous Ones advance.\nThe Lotus Terrace of Ze-Luo, the vast green net of the great kalpa.\nThe distant and boundless Nine Uglies, the melodious chants winding on.\nThe Nine Capitals above the clouds, where flying life soars of itself.\nNayū’s lush fragrance, the demonic Mara’s dharma subdued.\nHolding the mirrorless brightness, grasping posture and moving countenance.\nFragrant and resplendent, the divine tassels adorn the self-palace.\n\n**Southern Numinous Script**\nKnock the teeth three times, visualize the Vermilion Bird and phoenix soaring before and behind, with three layers of crimson clouds enveloping the body.\nRecite the esoteric incantation:\n*\"The three qi linger and circle, the numinous phoenix comes flying.\nThe jade sounds of eight characters, blazing in the Purple Tenuity.\nAuspicious day, great celebration—my Dao opens wide.\nCrimson cinnabar and sweet nectar, I gaze upward to absorb the numinous radiance.\nBody born of water and fire, clad in scarlet feathered robes.\nAscending the void in flying steps, treading the phoenix ladder.\nCircling the eight heavens, seven generations of ancestors commune.\"*\nUpon completion, draw in qi and swallow three times.\nPracticing for three years, the eight heavens each dispatch eight Great Cinnabar Jade Maidens and eight Great Yang Jade Lads to attend the body, descending the essence of the three crimson luminosities. The complexion reverses to youthful whiteness. After ten thousand kalpas, it remains unaged; seven generations of ancestors transcend and ascend, entering the Hall of Blessings. Returning to the immortal lineage, one is reborn anew.\n\n**Western Eight Heavens**\nThe Dao-Li Chan-You, the Po-Ni Fault-Passing.\nThe winding marsh’s purified hues, the hall of the vast and distant.\nThe flowing net of Brahma-sprouts, the radiant luxuriance of Xiao-Yu.\nThe distant and boundless, the silent—where the winding heads and young capitals dwell.\nAlam and Yuzhu, the blossoming desert’s extended reason.\nThe nine openings discern themselves, the Anāpāna’s foremost.\nThe immeasurable supporting canopy, the floating net uniting with the spirit.\nJade saliva and long mulberries, the cypress void ferrying immortals.\n\n**Western Numinous Script**\nKnock the teeth seven times, visualize the White Tiger and lion guiding left and right, with seven layers of white clouds enveloping the body.\nRecite the esoteric incantation:\n*\"The seven qi of golden numina, the honored spirits of the eight heavens.\nThe White Tiger spurs the chariot, the lion bears the axle.\nThe seven qi entwine, refining me into an immortal.\nBody ascending in golden light, reflecting the white clouds.\nInner and outer transformations, ascending into the cavern gate.\nSeven generations of ancestors emerge from the night, the nine dark realms’ souls revolve.\nAfter a hundred million kalpas, they open the path—following the movement, eternally preserved.\"*\nUpon completion, draw in qi and swallow seven times.\nPracticing for seven years, the eight heavens each dispatch eight White Numinous Jade Lads to attend the body, descending the fumigation of the seven qi of Great Simplicity. Age halts, and the worldly countenance remains youthful for ten thousand kalpas. When the seven generations of ancestors ascend to the Southern Palace, returning to the immortal lineage, they are reborn anew, generation after generation as immortals.\n\n**Northern Eight Heavens**\nThe self-nurturing Juewu, the nine suns guiding Qian.\nThe Mother of Kun covering the east, her form embracing the upper mystery.\nThe distant and vast Tuoluo, the subtle qi merging with the clouds.\nThe flying heavens’ great uglies, overseeing the upper heavens.\nThe Shatuo kalpa-measure, the dragon’s Han radiance.\nThe azure vault’s floating Li, the empty songs preserving the precious.\nThe evil Yi’s primordial rank, the cavern’s wondrous self-truth.\nThe primordial Brahma’s vast desert, the secluded and silent ferry of humanity.\n\n**Northern Numinous Script**\nKnock the teeth five times, visualize the flying tortoise and feathered canopy flourishing left and right, with five layers of black clouds enveloping the body. Divine lads and jade maidens in feathered robes and flying garments attend the body.\nRecite the esoteric incantation:\n*\"The heavens linger in primordial circling, the flowing radiance of the Upper Clarity.\"*\n\nThe Great Possession Initiates the Movement, the Eight Characters Ascend in Brilliance.\nThe flying heavens clarify the void, the cavernous yin spontaneously arises.\nThe five qi entwine and coil, irrigating my form.\nCrowned and girded with the Northern Unlined, receiving refinement from the cavernous numina.\nThe kidney palace issues forth to the north, inner and outer luminous essence.\nSoaring through the Three Realms, roaming and feasting in the Purple Court.\nSeven ancestors rejoice together, delighting in kalpa-long ages.\nWithin the Seven Treasures Grove, reborn through returning to the womb.\nEmerging from the Long Night, names recorded in the Southern Palace.\nYellow Registers and White Tallies, immortals born generation after generation.\nUpon concluding the incantation, draw qi and swallow five times, then cease. Practicing this for five years, each of the Eight Heavens dispatches eight Jade Lads of the Great Primordial to attend and guard the body.\nThey bestow the numinous essence of the five qi’s refinement, restoring years and preserving radiance, safeguarding life in the Three Clarities. Joy extends to the seven ancestors, immortals born generation after generation.\n\nThe Dao states: Among these heavens, the great Brahma’s hidden speech and the boundless sounds of ancient script were all a full *zhang* in length. The Heavenly Perfected Sovereign of Old inscribed these characters to establish the correct intonation. Those who know these sounds and can recite them in unison will have the flying heavens and divine kings descend to observe their form, record their meritorious diligence, and submit it to the heavens above. Myriad spirits pay homage, earthly numina attend at the gates. Great Merit Demon Kings advocate for their ascent as immortals. With the Dao perfected and attained, they may roam the Three Realms and ascend through the Golden Gate. These sounds repel all, exorcise all, deliver all, and accomplish all. They are the Heavenly Perfected’s natural sounds. Thus, reciting them summons the flying heavens to descend, while the Emperor from afar intones, myriad spirits pay homage, the Three Realms attend in reverence, and all demonic hordes submit. Ghostly essences perish of themselves, the jade-like resonance vibrates. The ten directions grow solemn and clear, rivers and seas fall silent, mountains and peaks swallow their mists, and all numina tremble in submission. Gathering the assembled immortals, the heavens are free of miasmic filth, the earth devoid of demonic dust. Profound wisdom illumines the cavernous clarity, the vast measure is profoundly mysterious.\n\n*Upper Chapters of the Numinous Treasure’s Boundless Deliverance of Humanity, Wondrous Sutra of Talismanic Charts, Scroll the Lower*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "灵宝无量度人上品妙经符图 经名：灵宝无量度人上品妙经符图。 原不题撰人，卷首有宋徽宗序，当出於南宋。 三卷。 底本出处：《正统道藏》洞真部灵图类。 灵宝无量度人经符图序 宋徽宗御制 原夫华灵隐蔼，藏三炁於鸿蒙； 神景含辉，潜万真於至赜。 虚无郁秀，劫化自然，中有妙极神一挺生，是为元始之尊。 开图帝先，凝粹流形之本，玄黄植象之宗也。 故其判辟天地，分序阴阳，四始循度，八索盈亏，并禀承於上德，咸统隶於司权。 隐配其神，协孕其性，列位开方，造育裁成； 九和十合，无物不臻； 绵绵而来，难极难穷。 道以强名，号为灵宝。 盖灵宝者，太元生化之本根也。 自尔幽机发明，启迪晨精，当思上古立运之前，融结万品，朗耀英鲜，至理昭彰於龙汉，妙文炜着於赤明。 圆罗敷灿，周布云章，五方焕落，八角垂芒，微蕴遁於真奥，神用晦於元纲。 将恢大教，慈惠流芳，书按於皇人之笔，义宣於太上之言。 或为符图，或为隐篇； 或演妙於浮黎之土，或藏玄於黍米之珠； 或付之於我等，或受之於玉虚； 或秘在於药珠芝宫，或严崇於神府华堂。 开联品秩，别类分条； 散则经维於六甲之数，合则总括於一元之标。 为大法梁，超涉玄津，无所不度，无所不禳。 抚运数於穷厄，保祥社於隆昌，安镇国祚，封掌山川，巍巍大范，靡不弥纶。 此其谓之灵宝者，实为元大之高称焉。 在其上馆大有之宫，宝禁此经，万天至重。 有勤苦而闻者，须审其贤，遵明科於紫微之格，视仰俯於神王之仪； 不许轻出，万劫一传。 我昔总真玉境，开化妙庭，拥瑞霞之九映，飞凤盖於三华，陆耀景之龙台，盻运会於元扃。 考校历数，称庆太平。 仰祈上帝，降世度人。 后至壬辰、庚子之年，炁应九阳，邪法消荡，正道方行，开悟群黎，授度无穷。 是其时也，启紫泥之宝笈，解玉钥於琅函。 琼编药简，当用宣明； 希真之子，得以见之，岂不幸哉！ ．我每居於碧琳之房，宴接於玉晨之范，啸咏高虚，研扩微诠，备明要於神府，览至理於澄鉴，故得披释元义，齐玄妙输； 辩深旨於本章，析宛丽於灵音； 阐无量之枢辖，精详究於杳冥。 将可以登玄峰於万仞，济浩荡之溺渊者焉。 盖濯罗腾焕於虚清，无不照於幽沉之间，妙纪敷扬，存乎简易之道； 昭昭可别，开悟有缘。 学者无忽於至用，修而进之，则可以召灵炁於三关，蔼宝华於九户，功满德就，名书上清，逸辔高上，翱翔太明。 德化之大，岂可议其津极者哉。 灵宝无量度人上品妙经符图卷上 灵宝者，以至道言之，即是神化之生也。 混沌一判，元始开图； 真炁罗络，普植神灵，滋演长存，生成无穷。 盖人之生也，唯物之珍； 具其情识，变用无方； 原其大本，悉禀天常。 覆载陶育，包括纪纲。 神降为灵，炁聚为宝，神降炁聚，具质成形。 无所不生，无所不明，无所不立，无所不成。 是以左居无英，右结白元，太一、司命，桃康、合延，三真、九宫，散布俱全，复何拟议而容心焉。 故其黍珠纳受无鞅，媾孕传播，蕃息绵昌。 大以天地，小以一形，下逮草木，品汇之真，莫不由此经营自然。 故其道也，弥纶万天，范围十地，推运阴阳，调和寒暑； 统行八卦，率御三元，部制鬼神，保养民物。",
      "translated_text": "**The Marvelous Charts of the Supreme Scripture of Limitless Salvation of the Numinous Treasure**\n\n**Scripture Title:** *The Marvelous Charts of the Supreme Scripture of Limitless Salvation of the Numinous Treasure*. The original text does not specify an author. The first volume includes a preface by Emperor Huizong of the Song, suggesting its composition during the Southern Song dynasty. Three volumes in total. Base text sourced from *The Orthodox Daoist Canon*, *Dongzhen* Section, *Lingtu* (Numinous Charts) Category.\n\n---\n\n**Preface to *The Marvelous Charts of the Supreme Scripture of Limitless Salvation of the Numinous Treasure***\n*Composed by Emperor Huizong of the Song*\n\nOf old, the numinous radiance of Hualing concealed the Three Qi within the primordial chaos; the divine splendor held brilliance, harboring the myriad perfected within the utmost mystery. In the flourishing of emptiness and non-being, kalpas transformed naturally, and from this arose the wondrous pole of the Divine Unity—this is the honored One of Primordial Beginning. It inaugurated the celestial charts before the imperial ancestors, congealing the essence and flowing forth the root of form, the origin of the profound and the yellow, the ancestor of all images.\n\nThus, it cleaved heaven and earth, ordered yin and yang, followed the four beginnings in their measures, and regulated the waxing and waning of the eight cords—all receiving the mandate of the supreme virtue, all governed by the authority of the celestial bureaus. It harmonized the spirits in hidden accord, nurtured their natures in concord, arrayed their positions and opened the directions, fostering and completing all things. Nine harmonies and ten unions—nothing failed to attain perfection. Flowing ceaselessly, it is boundless and unfathomable.\n\nThe Dao, though forced into a name, is called the *Numinous Treasure*. For the Numinous Treasure is the root of generation and transformation of the Great Primal. Since then, the subtle mechanism has unfolded, awakening the essence of dawn. One must reflect upon the era before the establishment of the primordial kalpa, when the myriad forms fused and crystallized, their brilliance and freshness radiant, the supreme principle shining forth in the Dragon Han, the marvelous scripture resplendent in the Crimson Clarity. The celestial net spread its splendor, cloud-like chapters unfurled in all directions; the five directions gleamed, the eight corners cast their rays. Subtle mysteries were concealed in the true profundities, divine functions lay hidden within the primordial net.\n\nTo expand the great teaching and let its compassionate fragrance flow, the scripture was inscribed by the brush of the august sage and its meaning proclaimed in the words of the Most High. Some took the form of charts and talismans, others of esoteric texts; some expounded the marvelous in the land of Fuli, others concealed the mysterious within the pearl of millet grain. Some were entrusted to us, others received from the Jade Void; some were secreted in the palaces of elixir, pearl, and mushroom, others revered in the divine halls of the numinous treasury.\n\nThey established ranks and categories, distinguishing types and dividing sections. Scattered, they upheld the warp of the Six Jia; united, they encompassed the standard of the One Primordial. They served as the great bridge of the Dao, traversing the profound ford, salvaging all without exception, exorcising all without fail. They sustained the turning of fate in times of distress, safeguarded the prosperity of the altars of soil and grain, pacified and stabilized the imperial destiny, and sealed the governance of mountains and rivers. Vast and majestic was their scope—nothing lay beyond their all-embracing order.\n\nThis is what is called the *Numinous Treasure*—truly the loftiest appellation of the Great Primordial. Within the grand palace of the Great Possession, this scripture was treasured, most revered among the ten thousand heavens. Those who, through diligence and toil, came to hear of it must first examine their worthiness, adhering to the luminous statutes of the Purple Tenuity and observing the rites of the divine kings in reverence. It was not to be lightly transmitted—once in ten thousand kalpas.\n\nIn the past, I presided over the Jade Realm of the Assembly of Perfected, opening the wondrous court of transformation. I embraced the ninefold radiance of auspicious clouds, soared with the phoenix canopy over the Three Floras, ascended the Dragon Terrace of Luyao’s splendor, and surveyed the turning of fate at the Primordial Gate. I examined the reckoning of kalpas and celebrated the era of Great Peace. Looking up, I prayed to the Supreme Emperor to descend into the world and save humanity.\n\nLater, in the years *renchen* and *gengzi*, the qi responded to the Nine Yangs, heterodox teachings dissolved, and the true Dao began to flourish. The masses were enlightened, and boundless salvations were bestowed. At that time, the purple-sealed treasure chest was opened, and the jade key unlocked the jeweled case. The jade-bound medicinal slips were to be proclaimed; those who aspired to the true might behold them—how fortunate!\n\nI often dwell in the Jasper Forest chamber, feasting in the jade dawn’s embrace, chanting in the lofty void, and expounding the subtle doctrines. I have elucidated the essentials within the divine treasury and beheld the supreme principle in the limpid mirror. Thus, I have unfurled and released the primordial meaning, aligning with the mysterious conveyance of the profound. I have discerned the profound purport of the original chapters and analyzed the graceful beauty of the numinous tones. I have expounded the pivot of the Limitless and meticulously investigated the obscure and distant.\n\nThis may enable one to ascend the ten-thousand-*ren* peak of the mysterious, to rescue those drowning in the vast and perilous abyss. For when the rosy clouds soar and gleam in the empty purity, nothing remains unilluminated in the depths of obscurity. The marvelous records are proclaimed, abiding in the way of simplicity. Bright and distinct, they awaken those with karmic affinity.\n\nLet scholars not neglect their utmost application. Cultivate and advance, and one may summon the numinous qi at the Three Passes, flourish the precious blossoms at the Nine Gates. When merit is complete and virtue perfected, one’s name is inscribed in the Upper Clarity. Loosening the reins, one soars aloft, roaming the Great Brilliance. The greatness of transformative virtue—how could one exhaust its ultimate ford?\n\n---\n\n**The Marvelous Charts of the Supreme Scripture of Limitless Salvation of the Numinous Treasure, Volume One**\n\nThe Numinous Treasure, in terms of the supreme Dao, is the generation of divine transformation. When the primordial chaos first divided, the Primordial Beginning unfolded the celestial charts. The true qi wove its network, universally planting the numinous spirits, perpetually nurturing and enduring, generating and completing without end.\n\nHuman life, in its essence, is the most precious of things. Endowed with consciousness and perception, its transformations and applications are boundless. Tracing its great root, all receive the celestial constancy. It is nurtured by the covering and bearing of heaven and earth, encompassed within the guiding principles.\n\nWhen the spirit descends, it becomes numinous; when qi gathers, it becomes treasure. The descent of spirit and the gathering of qi give form to substance. Nothing fails to be generated, nothing remains obscure, nothing is not established, nothing is not completed.\n\nThus, to the left resides the Non-Flourishing, to the right coalesces the White Prime. The Great One and the Director of Destinies, Peach Vitality and Union of Longevity, the Three Perfected and the Nine Palaces—all are scattered and complete. What room is there for conjecture or deliberation?\n\nThe millet pearl receives without limit, its nurturing and propagation flourishing and enduring. Great as heaven and earth, small as a single form, extending even to grasses and trees—the true essence of the myriad categories is all naturally managed thereby.\n\nThus, the Dao encompasses the ten thousand heavens, circumscribes the ten earths, propels the turning of yin and yang, and harmonizes cold and heat. It governs the eight trigrams, commands the Three Primordials, regulates ghosts and spirits, and preserves and nourishes the people and all things.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1225,
      "start_sentence": 0,
      "end_sentence": 61,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.65188241004944,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\灵图类\\灵宝无量度人上品妙经符图（宋佚名）.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "故其文也，招真召灵，度人无量，为万道之宗，称上品之经者也。 盖灵宝一门，洞该三道，上通上清，下兼洞神。 神炁玄合，元精之根； 巍巍其名，崇大尊高，莫甚於此者矣。 道言：昔於始青天中、碧落空歌大浮黎土， 天真皇人以紫笔记灵宝之炁，交始青之炁、变化之象也。 主世间及天地鬼神之生道，能资蓄生炁，以抱魂结，炼以得真也。 兆能有之，以青书竹帛之上，面西北服之，保生延年，神炁不散，固全生道也。 佩之则生炁归身，返老回婴，应运灭度，身经太阴。 带服始青变化之图，始青帝君与兆同升，逍遥太空也。 天真皇人曰：碧落之炁在人物为缕脉筋络，连贯穿注。 其炁生於碧落始青之天，在人生三百六十脉、三百六十经、三百六十络，又生眇络、支络、丝络、@络。 大范之炁，以为其元，中结此文以成图。 佩用者，神仙以碧书尺素召十方天真，空歌一奏，万圣齐闻。 服用施行，亦同上法。 天真皇人紫笔定书，以青为地，黄为文，赤为界。 封此图为浮黎土者，区贯跖穴之所在也。 中黄太上明梵之炁回旋流演，以正域内宫阙楼观之所存。 有能佩之，百神朝身，三界司迎； 魔王禀命，五帝侍轩。 中黄太一帝若与兆洞章同升紫房，此图主人脾胃，荣养太和，服用同前法。 受《元始度人无量上品》。 元始天尊当说是经，周回十过，以召十方，始当诣座。",
      "translated_text": "Thus its scripture summons the perfected and invokes the numinous, delivering countless beings—serving as the origin of the myriad Daoist traditions and acclaimed as the supreme scripture. For the Lingbao tradition encompasses the Three Ways, ascending to commune with Shangqing and descending to embrace Dongshen. The union of spirit and qi forms the root of primordial essence; its name stands majestic, exalted, and revered beyond all else.\n\nThe Dao declares: In ancient times, within the Azure Prime of Heaven, amidst the Celestial Void’s hymns of the Great Floating Li Land, the Heavenly Perfected Sovereign inscribed the Lingbao qi with a purple brush, where it intermingled with the Azure Prime’s qi to manifest its transformative forms. It governs the generative Dao of the world, heaven and earth, and ghosts and spirits, capable of nurturing and storing the qi of life, embracing the hun-soul and binding it through refinement to attain perfection. Those who possess it inscribe it in azure upon bamboo slips or silk, face the northwest to ingest it, preserving life and prolonging years, ensuring the spirit-qi does not scatter, thus securing the Dao of complete vitality. Wearing it draws the qi of life into the body, reversing aging to return to infancy, aligning with destiny to transcend mortality, and traversing the Great Yin. Donning the Azure Prime’s transformative chart, the Azure Prime Lord ascends with the adept, roaming the vast heavens.\n\nThe Heavenly Perfected Sovereign said: The qi of the Celestial Void in beings manifests as threads, vessels, sinews, and networks, interlinking and permeating. This qi originates in the Azure Prime of Heaven, generating in humans three hundred and sixty meridians, three hundred and sixty channels, three hundred and sixty collaterals, along with minute, branch, silk, and @ collaterals. The Great Bounds’ qi serves as their origin, coalescing within this scripture to form the chart. Those who wear it—immortals inscribe azure on silk to summon the perfected of the ten directions; a single hymn sung in the void is heard by all sages. Its ingestion and application follow the same method.\n\nThe Heavenly Perfected Sovereign fixed the script with a purple brush, using azure for the ground, yellow for the text, and red for the borders. Sealing this chart as the Floating Li Land demarcates the region encompassing the Zhixue’s abode. The luminous qi of the Central Yellow Supreme Mingfan revolves and flows, delineating the palaces, towers, and pavilions within its domain. Those who wear it find the hundred spirits attending their body, the Three Realms’ overseers welcoming them; demon kings receive commands, and the Five Emperors serve at their chariot. The Central Yellow Supreme Unity Emperor, if the adept recites the Dongzhang in unison, ascends with them to the Purple Chamber. This chart governs the spleen and stomach, nourishing supreme harmony—its application follows the prior method.\n\nReceiving the *Primordial Beginning’s Scripture of Delivering Countless Beings, Supreme Grade*, the Primordial Heavenly Worthy expounded this sutra, circling ten times to summon the ten directions, then ascending the throne.",
      "overlap_context": "d propagation flourishing and enduring. Great as heaven and earth, small as a single form, extending even to grasses and trees—the true essence of the myriad categories is all naturally managed thereby.\n\nThus, the Dao encompasses the ten thousand heavens, circumscribes the ten earths, propels the turning of yin and yang, and harmonizes cold and heat. It governs the eight trigrams, commands the Three Primordials, regulates ghosts and spirits, and preserves and nourishes the people and all things.",
      "start_char": 1225,
      "end_char": 1756,
      "start_sentence": 62,
      "end_sentence": 84,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.656764030456543,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\灵图类\\灵宝无量度人上品妙经符图（宋佚名）.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "天真大神、上圣高尊、妙行真人、无鞅数众，乘空而来，飞云丹霄，绿舆琼轮，羽盖垂应，流精玉光，五色郁勃，洞焕太空，七日七夜。 诸天日月星宿、璇玑玉衡，一时停轮。 神风静嘿，山海藏云，天无浮翳，四炁朗清。 一国地土、山川、林木，缅平一等，无复高下，土皆作碧玉，无有异色。 众真侍座，元始天尊玄座空浮五色师子之上，说经一遍，诸天大圣同时称善。 是时一国男女聋病，耳皆开聪； 说经二遍，盲者目明； 说经三遍，喑者能言； 说经四遍，跛痾积逮，皆能起行； 说经五遍，久病痼疾，一时复形； 说经六遍，发白反黑，齿落更生； 说经七遍，老者返壮，少者皆强； 说经八遍，妇人怀孕，鸟兽含胎已生未生，皆得生成； 说经九遍，地藏发泄，金玉露形； 说经十遍，枯骨更生，皆起成人。 是时，一国是男是女，莫不倾心，皆受护度，咸得长生。 道言：是时，元始天尊说经一遍，东方无极无量品至真大神、无鞅之众，浮空而至； 说经二遍，南方无极无量品至真大神、无鞅之众，浮空而至； 说经三遍，西方无极无量品至真大神、无鞅之众，浮空而至； 说经四遍，北方无极无量品至真大神、无鞅之众，浮空而至； 说经五遍，东北无极无量品至真大神、无鞅之众，浮空而至； 说经六遍，东南无极无量品至真大神、无鞅之众，浮空而至； 说经七遍，西南无极无量品至真大神、无鞅之众，浮空而至； 说经八遍，西北无极无量品至真大神、无鞅之众，浮空而至； 说经九遍，上方无极无量品至真大神、无鞅之众，浮空而至； 说经十遍，下方无极无量品至真大神、无鞅之众，浮空而至。 十遍周竟，十方无极天真大神一时同至。 一国男女倾心归仰，来者有如细雨密雾。 无鞅之众，迮国一半，土皆偏陷，非可禁止。 於是元始悬一宝珠，大如黍米，在空玄之中，去地五丈。 元始登引天真大神、上圣高尊、妙行真人、十方无极至真大神、无鞅数众俱入宝珠之中。 天人仰看，唯见勃勃从珠口中入； 既入珠口，不知所在。 国人廓散，地还平正，无复欹歌陷。 元始即於宝珠之内说经都竟，众真监度，以授於我。 当此之时，喜庆难言，法事粗悉，诸天复位。 鲦欻之间，寂无遗响。 是时天人遇值经法，普得济度，全其本年，无有中伤。 倾土归仰，咸行善心。 不杀不害，不嫉不妬，不淫不盗，不贪不欲，不憎不@，言无华绮，口无恶声。 齐同慈爱，异骨成亲，国安民丰，欣乐太平。 经始出教一国以道，预有至心，宗奉礼敬，皆得度世。 道言：元始天尊说经中所言，并是诸天上帝内名、隐韵之音，亦是魔王内讳、百灵之隐名也。 非世之常辞。 上圣已成，真人通玄究微，能悉其章。 诵之十过，诸天遥唱，万帝设礼，河海静默，山岳藏云，日月停景，璇玑不行，群魔束形，鬼精灭爽，回尸起死，白骨成人。 至学之士，诵之十过，则五帝侍卫，三界稽首，魔精丧眼，鬼妖灭爽，济度垂死，绝而得生。 所以尔者，学士秽炁未消，体未洞真，召制十方，威未制天政； 德可伏御地只，束缚魔灵，但却死而已，不能更生。 轻诵此章，身则被殃； 供养尊礼，门户兴隆，世世昌炽，与善因缘，万灾不干，神明护门。 斯经尊妙，独步玉京，度人无量，为万道之宗，巍巍大范，德难可胜。",
      "translated_text": "The Heavenly Perfected Great Spirits, Supreme Sages of the Highest Rank, Wondrously Practiced Realized Ones, and countless hosts arrived riding the void, soaring through the cinnabar clouds of the empyrean. Their jade-green chariots and wheel-rimmed palanquins bore feathered canopies that trailed in response; streaming essences of jade radiance, five-colored qi surged in abundance, illuminating the Great Void with resplendence for seven days and seven nights. The sun, moon, and stellar lodges of the manifold heavens, along with the jade celestial pivots, all halted their revolutions at once. Divine winds stilled into silence; mountains and seas concealed their clouds; the sky held no drifting veils, and the four qi shone in clarity. The land of the entire realm—its mountains, rivers, and forests—leveled into perfect evenness, no longer possessing high or low; the earth transformed entirely into azure jade, without any differing hues.\n\nThe assembled Perfected attended the throne as the Primordial Heavenly Worthy, seated upon a darkly floating dais above five-colored lions, expounded the sutra once. The Great Sages of the manifold heavens simultaneously voiced their approval. At that moment, the deaf and ailing men and women of the realm all regained their hearing. When the sutra was expounded a second time, the blind received sight. A third recitation enabled the mute to speak. A fourth allowed the lame, the chronically ill, and the long-bedridden to rise and walk. A fifth restored those suffering from enduring ailments to their original forms. A sixth turned white hair black again and caused fallen teeth to regrow. A seventh rejuvenated the aged into youth and strengthened the young. An eighth enabled pregnant women, as well as birds and beasts—whether already bearing young or yet to conceive—to bring forth life in completion. A ninth caused the earth’s treasuries to open, revealing gold and jade. A tenth brought the withered bones back to life, all rising as whole persons.\n\nAt that time, every man and woman of the realm turned their hearts in devotion, all receiving protection and deliverance, attaining longevity without end. The Dao declared: When the Primordial Heavenly Worthy expounded the sutra once, the boundless and immeasurable hosts of the Perfected Great Spirits of the Eastern Direction arrived floating through the void. A second recitation summoned the boundless and immeasurable hosts of the Perfected Great Spirits of the Southern Direction. A third brought those of the Western Direction. A fourth, those of the Northern Direction. A fifth, those of the Northeastern Direction. A sixth, those of the Southeastern Direction. A seventh, those of the Southwestern Direction. An eighth, those of the Northwestern Direction. A ninth, those of the Upper Direction. A tenth, those of the Lower Direction. When the ten recitations were complete, the Perfected Great Spirits of the ten directions arrived simultaneously.\n\nThe men and women of the realm turned their hearts in reverence, their numbers like fine rain or dense mist. The countless hosts pressed upon half the land, causing the earth to sink unevenly, an effect that could not be restrained. Thereupon, the Primordial Heavenly Worthy suspended a single precious pearl, as large as a millet grain, in the dark emptiness of space, five *zhang* above the earth. The Primordial Heavenly Worthy led the Heavenly Perfected Great Spirits, Supreme Sages of the Highest Rank, Wondrously Practiced Realized Ones, and the boundless hosts of the Perfected Great Spirits of the ten directions into the pearl. The heavenly beings gazed upward, seeing only a surging movement as all entered through the pearl’s opening; once inside, their whereabouts became unknown. The people of the realm dispersed, and the earth returned to levelness, no longer uneven or sunken.\n\nWithin the pearl, the Primordial Heavenly Worthy completed the full exposition of the sutra. The assembled Perfected oversaw the deliverance and transmitted it to me. At that moment, joy and celebration defied description; the Dharma rites were roughly concluded, and the deities of the manifold heavens returned to their stations. In an instant, all fell silent, leaving no lingering echoes. The heavenly beings who encountered this sutra universally attained salvation, preserving their allotted years without harm. The entire land turned in reverence, all cultivating virtuous minds: refraining from killing or harming, from envy or jealousy, from licentiousness or theft, from greed or desire, from hatred or deceit; their speech bore no ornate falsity, their mouths no harsh words. United in compassion and love, even those of different lineages became kin. The realm knew peace, the people abundance, and all rejoiced in great harmony.\n\nWhen the sutra first emerged to instruct the realm in the Dao, those who had previously cultivated sincere devotion, reverence, and respect all attained deliverance across the ages. The Dao declared: The words spoken by the Primordial Heavenly Worthy in expounding the sutra comprise the inner names of the Heavenly Thearchs and the hidden rhymes of the heavens, as well as the secret taboos of demon kings and the concealed names of the hundred spirits. They are not the common speech of the world. Only the Supreme Sages who have attained perfection and the Realized Ones who have penetrated the mysteries can fully grasp its verses. Reciting it ten times causes the manifold heavens to chant in response from afar, the ten thousand Emperors to offer rites, rivers and seas to fall silent, mountains and peaks to conceal their clouds, the sun and moon to halt their radiance, the celestial pivots to cease their motion, demon hosts to bind their forms, ghostly spirits to lose their clarity, the dead to rise from their corpses, and white bones to become whole persons.\n\nFor those who diligently study this sutra, reciting it ten times will cause the Five Emperors to attend as guards, the Three Realms to bow in reverence, demonic spirits to lose their sight, ghostly beings to lose their clarity, and those on the verge of death to be delivered, snatching life from the jaws of extinction. The reason for this is that the student’s impure qi has not yet dissipated, and their body has not fully realized the Perfected; though they may summon and command the ten directions, their power does not yet govern the celestial administration. Their virtue may subdue and bind earthly demons, restraining and expelling malevolent spirits, but this only averts death—it does not restore life. To recite these verses lightly brings calamity upon oneself. To revere and honor them with offerings causes one’s household to flourish, bringing prosperity across generations, forming good karmic connections, shielding from the ten thousand disasters, and ensuring the protection of divine luminaries at one’s gate.\n\nThis sutra is supremely venerable, unmatched in the Jade Capital. It delivers countless beings, serving as the root of the ten thousand Daoist teachings. Its majestic and vast model of virtue is beyond measure.",
      "overlap_context": " Emperors serve at their chariot. The Central Yellow Supreme Unity Emperor, if the adept recites the Dongzhang in unison, ascends with them to the Purple Chamber. This chart governs the spleen and stomach, nourishing supreme harmony—its application follows the prior method.\n\nReceiving the *Primordial Beginning’s Scripture of Delivering Countless Beings, Supreme Grade*, the Primordial Heavenly Worthy expounded this sutra, circling ten times to summon the ten directions, then ascending the throne.",
      "start_char": 1756,
      "end_char": 2987,
      "start_sentence": 85,
      "end_sentence": 136,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.38281464576721,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\灵图类\\灵宝无量度人上品妙经符图（宋佚名）.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "道言：凡诵是经十过，诸天齐到，亿曾万祖幽魂苦爽，皆得受度，上升朱宫，格皆九年，受化更生，得为贵人。 而好学至经，功满德就，皆得神仙，飞升金阙，游宴玉京也。 上学之士，修诵是经，皆即受度，飞升南宫，世人受诵则延寿长年，后皆得作尸解之道，魂神暂灭，不经地狱，即得返形，游行太空。 此经微妙，普度无穷，一切天人莫不受庆无量之福，生死蒙惠，上天所宝，不传下世。 至士赍金宝、效心盟天而传。 轻泄漏慢，殃及九祖，长役鬼官。 侍经五帝、玉童玉女各二十四人，营卫神文，保护受经者身。 道言：正月长赍，诵咏是经，为上世亡魂断地逮役，度上南宫。 七月长斋，诵咏是经，身得神仙，诸天书名。 黄箓白简，削死上生。 十月长齐，诵咏是经，为国王帝主、君臣父子，安镇国祚，保天长存，世世不绝，常为人君，安镇其方，民称太平。 八节之日诵咏是经，得为九宫真人。 本命之日诵咏是经，魂神澄正，万炁长存，不经苦恼，身有光明。 三界侍卫，五帝司迎，万神朝礼，名书上天，功满德就，飞升上清。 道言：行道之日，皆当香汤沐浴，斋戒，入室东向。 诵经之日，先被服盥漱，置经於案。 然后焚香，礼请跪启修诵之意。 即东向正坐，焚香披读，注心历目，微声诵咏。 若或错悮俟，则却上三十字读，勿促勿速。 苟贪遍数，翻为失功，俟人不少。 调声诵咏，令神魂和畅。 常令香炁不绝於室，已下依法存叩。 叩齿十二通，上闻三十二天，心拜三十二过。 叩齿者，当以中齿上下两两相叩，令响。 内以集神，外以彻天。 《真诰》云：叩齿三以集神，咽津以和真。 次则存拜三十二天，每想天帝，存一拜之。 从东北方首始，东行左旋，止於西北。 闭目静思，身坐青、黄、白三色云炁之中。 玄炁青，元炁黄，始炁白。 内外蓊冥，有青龙、白虎、朱雀、玄武、狮子、白鹤罗列左右。 日月照明，洞焕室内，项生圆象，光映十方，如此分明。 密咒曰：青龙左，白虎右，朱雀前，玄武后。 狮子左右各两行，行有其八，对坐相望。 白鹤亦然。 日在额左，月在额右，光明一室。 项生圆象，九色相间，青、赤、黄、白、黑、绿、红、紫、钳，照彻十方，存令分明如睹。 即密咒云。 密者，口动无声。 贪罗郁罗，符无苏陀。 太冲太极，阴阳包和。 出有入无，出生入死。 鬼神莫测，变化自然。 元始混炁，玄中又玄。 上干有顶，下洞太渊。 诵之一褊，沉痾自痊。 炼魂浴魄，真阳自全。 斋戒礼诵，万过飞仙。 无上秘咒，万神绵绵。 心中心咒，重复宣传。 贪罗洞轮，玉清太极。 九炁氤氲，分灵而然。 降注付身，形神俱妙。 变化飞升，一如令格。 统摄万灵，急急如律令。 无上玄元太上道君，玄元始三炁，化生三宝，各居一天。 三天在人额上发际中，为清微天，天宝君治之。 左为禹余天，灵宝君治之。 右为太赤天，神宝君治之。 凡诵经，当存思三帝君。 召出臣身中请我身中众官。 三五功曹、直使功曹在心，从口出。 正一功曹在胆，从左目出。 治病功曹在脾，从鼻准出。 左玄功曹在肝，从右目出。 右玄功曹在肺，从鼻出。 上部功曹从眉间出，中部功曹从口中出，下部功曹从脐间出。 左右官使者、左官使者在左胁，右官使者在右胁。",
      "translated_text": "The Dao speaks: Should one recite this sutra ten times, all the heavens assemble, and the suffering souls of countless generations of ancestors in the dark realms all receive deliverance, ascending to the Vermilion Palace. After nine years of refinement, they undergo transformation and rebirth, becoming noble persons. Those who diligently study this sutra to its fullest, with merits fulfilled and virtue perfected, all attain divine transcendence, soaring to the Golden Gates and roaming the Jade Capital.\n\nScholars of higher learning who cultivate and recite this sutra shall immediately receive deliverance, ascending to the Southern Palace. For those in the world who recite it, their lifespans extend, and in later times, they all attain the Way of *shijie*, their souls briefly extinguished yet spared from hell, swiftly regaining form to wander the vast heavens. This sutra is subtle and wondrous, universally delivering boundless beings. All heavenly and mortal beings receive immeasurable blessings, their lives and deaths graced with favor. Treasured by the heavens above, it is not transmitted to the lower world. Only the most devoted, bearing gold and treasures, may pledge their hearts to heaven to receive it. To lightly disclose or profane it brings calamity upon nine generations, condemning them to eternal servitude under the ghostly officials.\n\nTwenty-four Jade Lads and twenty-four Jade Maidens attend this sutra, safeguarding its divine script with protective spirits to shield the reciter’s body.\n\nThe Dao speaks: During the first month of the year, observe a prolonged fast and recite this sutra to sever the earthly bonds of past generations’ wandering souls, delivering them to the Southern Palace. In the seventh month, observe a prolonged fast and recite this sutra to attain divine transcendence, with one’s name inscribed by the heavens. On the Yellow Register and White Tablet, death is erased and life restored. In the tenth month, observe a prolonged fast and recite this sutra for the sake of kings, emperors, lords, ministers, fathers, and sons, to stabilize the nation’s destiny, preserve the heavens’ longevity, and ensure the lineage endures unbroken, perpetually ruling as sovereigns, securing peace in their lands, with the people proclaiming great harmony.\n\nOn the eight seasonal festivals, recite this sutra to become a Perfected One of the Nine Palaces. On one’s natal day, recite this sutra to purify the soul, preserving the myriad *qi* eternally, sparing oneself from suffering, and enveloping the body in radiant light. The Three Realms offer protection, the Five Emperors oversee reception, and ten thousand spirits pay homage. One’s name is inscribed in the heavens above, and with merits fulfilled and virtue perfected, one soars to the Supreme Clarity.\n\nThe Dao speaks: On the day of performing the rites, one must bathe in fragrant waters, observe abstinence, and enter the chamber facing east. On the day of recitation, first don proper attire, wash hands and rinse the mouth, then place the sutra upon the table. Thereafter, burn incense, bow in reverence, kneel, and declare one’s intent to recite. Then, facing east, sit upright, burn incense, open the sutra, and read with focused mind and measured gaze, reciting softly. Should one err or falter, return thirty characters and reread, neither hastening nor rushing. To greedily pursue quantity undermines merit, and none should be slighted. Modulate the voice in recitation to harmonize the spirit and soul. Ensure the incense’s fragrance lingers unbroken in the chamber, and thereafter, follow the prescribed methods of visualization and invocation.\n\nKnock the teeth twelve times to resonate with the Thirty-Two Heavens, and bow thirty-two times in the heart. To knock the teeth, bring the upper and lower central teeth together in pairs, producing a clear sound. Internally, this gathers the spirit; externally, it reaches the heavens. As the *Zhen Gao* states: \"Knock the teeth thrice to gather the spirit; swallow saliva to harmonize with the true.\"\n\nNext, visualize bowing to the Thirty-Two Heavens, imagining each celestial emperor as you bow once. Begin from the northeast, proceeding eastward in a leftward circuit, concluding in the northwest. With eyes closed, meditate upon sitting amidst clouds of three colors—azure, yellow, and white. The Mysterious *qi* is azure, the Primordial *qi* is yellow, and the Original *qi* is white. Within and without, all is veiled in mist, with the Azure Dragon, White Tiger, Vermilion Bird, Dark Warrior, lions, and white cranes arrayed to the left and right. The sun and moon illuminate the chamber, their radiance filling the room. A circular halo emerges from the crown of the head, its light suffusing the ten directions—all must be vividly imagined.\n\nThe secret incantation declares:\n*Azure Dragon to the left, White Tiger to the right,\nVermilion Bird before, Dark Warrior behind.\nLions in two rows on either side, eight in each,\nFacing one another in pairs.\nWhite cranes likewise.\nThe sun at the left of the brow, the moon at the right,\nTheir light filling the chamber.\nA circular halo from the crown, nine colors interwoven—\nAzure, crimson, yellow, white, black, green, red, purple, and gold—\nIlluminating the ten directions.\nVisualize all clearly, as if seen.*\n\nThen recite the secret incantation silently, moving the lips without sound:\n*Tanluo Yuluo, Fuwu Sutuo.\nGreat Thoroughfare, Supreme Ultimate,\nYin and Yang harmoniously enveloped.\nEmerging from existence, entering non-existence,\nBorn from life, returning to death.\nGhosts and spirits cannot fathom,\nTransformations arise naturally.\nPrimordial Chaos of the Original Beginning,\nMystery within mystery.\nAbove, it pierces the heavens’ summit;\nBelow, it penetrates the abyss.\nRecite once, and chronic ailments heal.\nRefine the soul, bathe the spirit,\nTrue Yang is preserved whole.\nWith abstinence, reverence, and recitation,\nTen thousand repetitions grant flight to immortality.\nThe supreme secret incantation,\nTen thousand spirits everlasting.*\n\nRecite the heart incantation repeatedly:\n*Tanluo Donglun, Jade Clarity’s Supreme Ultimate.\nNine *qi* intermingle, dividing spirits as they arise.\nDescending to infuse the body,\nForm and spirit both wondrous.\nTransform, ascend, and fly,\nAll as decreed.\nCommanding the ten thousand spirits,\nSwiftly, swiftly, as the law commands.*\n\nThe Most High Lord of the Dao of the Supreme Mystery, the Three *Qi* of the Primordial Origin, gave rise to the Three Treasures, each dwelling in its own heaven. The Three Heavens reside above the hairline on the human forehead: the Heaven of Pure Tenuity, governed by the Heavenly Treasure Lord; the left is the Heaven of Yu Remnant, governed by the Numinous Treasure Lord; the right is the Heaven of Great Crimson, governed by the Divine Treasure Lord. When reciting the sutra, one must visualize the Three Emperor Lords, summoning the myriad officials within one’s body to emerge.\n\nThe Three and Five Merit Officers and Direct Envoys reside in the heart, emerging from the mouth. The Orthodox Unity Merit Officer dwells in the gallbladder, emerging from the left eye. The Healing Merit Officer dwells in the spleen, emerging from the bridge of the nose. The Left Mysterious Merit Officer dwells in the liver, emerging from the right eye. The Right Mysterious Merit Officer dwells in the lungs, emerging from the nose. The Upper Section Merit Officer emerges from between the brows, the Middle Section Merit Officer from the mouth, and the Lower Section Merit Officer from the navel. The Left and Right Official Envoys—the Left Official Envoy dwells in the left flank, and the Right Official Envoy in the right flank.",
      "overlap_context": "ly brings calamity upon oneself. To revere and honor them with offerings causes one’s household to flourish, bringing prosperity across generations, forming good karmic connections, shielding from the ten thousand disasters, and ensuring the protection of divine luminaries at one’s gate.\n\nThis sutra is supremely venerable, unmatched in the Jade Capital. It delivers countless beings, serving as the root of the ten thousand Daoist teachings. Its majestic and vast model of virtue is beyond measure.",
      "start_char": 2988,
      "end_char": 4213,
      "start_sentence": 137,
      "end_sentence": 204,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.94620990753174,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\灵图类\\灵宝无量度人上品妙经符图（宋佚名）.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "侍香金童、在左眉间。 传言玉女、在右眉间。 五帝直符、五帝，五藏有五帝直符五帝，又有左扶、右扶、侍中。 直日香官各三十六人出。 上、中、下三境，每境八人，三八二十四人。 三魂七魄，阴阳二君，共三十六人。 掐玉皇诀，移下至丑，勒至巳上剔出。 关启所言，受法箓即具位。 如未受法箓即言奉道。 弟子当尽心中所，欲言。 然亦贵在简当，至诚默奏。 今日吉庆长斋，今日某日言庆，随其日言之。 如长斋即言长斋，如不长斋即不言。 清堂修行至经，若知三洞中盟之道，见行事即言修行至经，自非此人，即不言修行至经，但言清堂诵经。 无量度人，或为一事而诵，即言为某事诵经，若为十方幽爽，乃可无量度人之句言之。 臣及甲、乙，转经受生。 若常时自诵，即言臣及祖考。 若为他人，即言臣为某人，但以意而陈述甲乙者。 某人，某人之理也。 当愿所启之诚，上彻径御无上三十二天元始上帝至尊几前。 元始上帝者，即非元始天尊，乃上帝高尊，位齐元始者。 或云元始上帝即天尊。 毕，引炁三十二过，引者，以鼻引而咽之。 三十二过者，东、南、西、北方，每方八天，各一引。 东方青炁，纳於肝。 南方赤炁，纳於心。 西方白炁，纳於肺。 北方玄炁，纳於肾。 洞彻五脏之内，然后诵经。 东向诵经。 东方，长生之方，诸天所尊重。 诵经之格，初一遍从序诵起，至此存思。 毕，即诵后经。 第二遍则直从元始无量度人上品妙经起诵，每十遍为一过。 若欲禳禬济拔之类，须得十遍为佳，以遵十回度人之义也。 或有事务暂起，亦得若经时稍久，即须依前诵序存思。 灵宝无量度人上品妙经符图卷上竟 灵宝无量度人上品妙经符图卷中 元始洞玄灵宝本章，上品妙首，十回度人，百魔隐韵，离合自然。 混洞赤文章 元始开运，太玄肇灵。 虚极无象，一炁流形。 化生二景，五纬凝精。 混合自然，怛除结婴。 总真布景，焕赫九清。 炎持廓奕，七纪齐并。 析师卢浩，丹天耀晶。 朱光炼度，赤霭散明。 三华郁秀，辉映帝晨。 太极妙化，神灵混洞赤文章，昔天真皇人降玉隆腾胜天，授虚皇天尊灵宝大法，谓东华上卿、洞神大夫领下元生籍左官及诸仙官，日九霄总梵八帝治天，非混洞赤文不能摄化九阳而明天度。 是以神霄玉清虚皇天，泛上灵景华九阳清真虚梵之炁而成天境； 丹霄南极玉文天，泛丹灵妙华洞阳景真元梵之炁而成天境； 碧霄太虚真极天，泛广灵太华上阳元真灵一之炁而成天境； 玉霄玉灵素华天，泛玉灵素华纯阳至真元一之炁而成天境太霄太灵真元天，泛大灵洞华三阳九真太一之炁而成天境； 琅霄素灵皓元天，泛素灵皓华六阳洞真至一之炁而成天境； 紫霄元灵上极天，泛元灵紫华清阳妙真天一之炁而成天境； 景霄妙灵宝华天，泛妙灵宝华景阳精真虚一之炁而成天境； 青霄玉华无极天，泛青灵玉华元阳天真纯一之炁而成天境。 此九霄九天，皆混洞赤文之所开化，明焕妙梵清英、紫丹上灵之秀而成天篆真文矣。 故赤文化混洞，混洞化弥罗，总天元九炁之道，下复九因至八梵真玉官，亦此文之化也。 是以太丹天内有赤明帝宫宛利城弃贤世界，梵宝丹灵赤帝君所理，中有朱陵之府、流火之庭、大炎之宫、赤明之馆、丹丘火池。",
      "translated_text": "The Incense-Attending Golden Youth resides between the left brow. The Message-Transmitting Jade Maiden resides between the right brow. The Five Thearchs’ Direct Talismans—each of the Five Thearchs corresponds to one of the five viscera, and each has its own Direct Talisman. Additionally, there are the Left Supporter, the Right Supporter, and the Attendant Within. The Incense Officials of the Day each number thirty-six, emerging forth. The Upper, Middle, and Lower Three Realms—each realm has eight officials, totaling twenty-four. The Three Hun and Seven Po, the Yin and Yang Lords, together make thirty-six. Clasp the Jade Emperor’s mudra, shift downward to *chou*, and restrain upward to *si*, then flick them forth.\n\nWhen presenting one’s petition, if one has received the register of the Dao, state one’s rank accordingly. If one has not yet received the register, declare oneself a devotee of the Dao. The disciple should express wholeheartedly what is in their mind, desiring to speak. Yet it is most noble to be concise and appropriate, silently presenting with utmost sincerity.\n\nToday is an auspicious day of perpetual fasting—on this certain day, one may say “auspicious,” following the day’s designation. If observing perpetual fasting, state so; if not, do not mention it. In the Pure Hall, one cultivates and recites the scriptures. If one knows the covenant of the Three Caverns, and sees the practice being carried out, one may say “cultivating and reciting the scriptures.” If one is not such a person, do not say so, but simply state “reciting the scriptures in the Pure Hall.”\n\nFor the immeasurable deliverance of beings, if reciting for a specific matter, state “reciting the scriptures for such-and-such a matter.” If reciting for the hidden souls of the ten directions, one may include the phrase “immeasurable deliverance of beings.” “Your servant and so-and-so (甲, 乙) turn the scriptures to receive rebirth.” If reciting for oneself at ordinary times, say “your servant and ancestors.” If reciting for another, say “your servant for so-and-so,” expressing the names of those involved as appropriate. “So-and-so” refers to the principle of such-and-such a person.\n\nMay the sincerity of this petition ascend directly to the presence of the Most High Thirty-Two Heavens’ Primordial Thearch, the August One. The Primordial Thearch here is not the Primordial Heavenly Worthy, but the Supreme Thearch, whose rank is equal to that of the Primordial One. Some say the Primordial Thearch is the Heavenly Worthy.\n\nOnce finished, draw in *qi* thirty-two times—“drawing” means inhaling through the nose and swallowing. “Thirty-two times” refers to the eight heavens of each of the four directions, drawing once for each. Draw in the blue-green *qi* of the East, storing it in the liver. Draw in the red *qi* of the South, storing it in the heart. Draw in the white *qi* of the West, storing it in the lungs. Draw in the dark *qi* of the North, storing it in the kidneys. Once the five viscera are thoroughly permeated, then recite the scriptures. Face east when reciting the scriptures—the East is the direction of long life, revered by all heavens.\n\nThe format for reciting the scriptures: for the first recitation, begin with the preface and proceed to this visualization. Once finished, recite the subsequent scripture. For the second recitation, begin directly with *The Marvelous Scripture of the Upper Chapters on the Immeasurable Deliverance of Beings*. Every ten recitations constitute one cycle. For exorcisms, supplications, or deliverances, ten recitations are optimal, adhering to the meaning of “delivering beings ten times.” If temporarily interrupted by other matters, or if the recitation lasts somewhat longer, one must return to reciting the preface and performing the visualization as before.\n\n*Thus concludes the first scroll of the talismanic charts of The Marvelous Scripture of the Upper Chapters on the Immeasurable Deliverance of Beings.*\n\n*Beginning of the second scroll of the talismanic charts of The Marvelous Scripture of the Upper Chapters on the Immeasurable Deliverance of Beings.*\n\nThe Primordial Cavernous Mystery’s Numinous Treasure’s root chapters, the marvelous head of the upper chapters, deliver beings ten times, conceal the hundred demons in hidden rhymes, and naturally separate and unite.\n\nThe Crimson Writ of the Chaotic Cavern\n\nThe Primordial began the movement, the Great Mystery initiated the numinous. The Void’s extremity had no form; one *qi* flowed into shape. It transformed and gave birth to the Two Effulgences, the Five Wefts congealed essence. Naturally mixed and united, it forever dispelled the bound embryo. The assembly of perfected beings spread its radiance, resplendent in the Nine Pures. Blazing and expansive, the Seven Epochs aligned. The Master Lu, the Vast, illuminated the Cinnabar Heaven with crystal brilliance. Vermilion light refined and delivered, red mists dispersed luminosity. The Three Flowers flourished luxuriantly, shining upon the Thearch’s dawn. The wondrous transformation of the Great Ultimate—divine and numinous, the Crimson Writ of the Chaotic Cavern.\n\nIn former times, the Heavenly Perfected Sovereign descended upon Jade Prosperity Ascending Victory Heaven and transmitted the Numinous Treasure Great Law of the Void Thearch to the Eastern Flower Upper Minister and Cavernous Spirit Grand Master, who oversaw the left officials of the Lower Origin’s register of the living and all the immortals’ officials. The Nine Empyreans’ Total Brahma and Eight Thearchs governed the heavens, for without the Crimson Writ of the Chaotic Cavern, one could not subdue and transform the Nine Yangs and illuminate the celestial deliverance.\n\nThus, the Jade Pure Void Thearch of the Divine Empyrean’s Jade Pure Heaven rode upon the effulgent *qi* of the Nine Yangs’ pure and void Brahma to form the celestial realm. The Vermilion Empyrean’s Southern Culmen Jade Writ Heaven rode upon the vermilion numinous and wondrous *qi* of the Cavernous Yang’s radiant true and original Brahma to form the celestial realm. The Azure Empyrean’s Great Void True Culmination Heaven rode upon the vast numinous and great effulgent *qi* of the Upper Yang’s original true and numinous Unity to form the celestial realm. The Jade Empyrean’s Jade Numinous Plain Effulgence Heaven rode upon the jade numinous plain effulgent *qi* of the pure Yang’s utmost true and original Unity to form the celestial realm. The Great Empyrean’s Great Numinous True Origin Heaven rode upon the great numinous cavernous effulgent *qi* of the Three Yangs’ Nine Perfected and Great Unity to form the celestial realm. The Lang Empyrean’s Plain Numinous Luminous Origin Heaven rode upon the plain numinous luminous effulgent *qi* of the Six Yangs’ cavernous true and utmost Unity to form the celestial realm. The Purple Empyrean’s Original Numinous Upper Culmination Heaven rode upon the original numinous purple effulgent *qi* of the pure Yang’s wondrous true Heavenly Unity to form the celestial realm. The Scenic Empyrean’s Wondrous Numinous Treasure Effulgence Heaven rode upon the wondrous numinous treasure effulgent *qi* of the radiant Yang’s essence-true and void Unity to form the celestial realm. The Azure Empyrean’s Jade Effulgent Non-Ultimate Heaven rode upon the azure numinous jade effulgent *qi* of the original Yang’s heavenly true and pure Unity to form the celestial realm.\n\nThese Nine Empyreans and Nine Heavens were all opened and transformed by the Crimson Writ of the Chaotic Cavern, their luminous and wondrous Brahma’s pure essence and purple cinnabar’s upper numinous splendor forming the celestial talismanic writs and true texts. Thus, the Crimson Writ transformed the Chaotic Cavern, and the Chaotic Cavern transformed the Miro. It is the Dao of the Nine *Qi* of the Heavenly Origin, descending to transform the Nine Causes and the Eight Brahma Perfected Jade Palaces—this too is the transformation of this writ.\n\nTherefore, within the Great Cinnabar Heaven lies the Crimson Bright Thearch’s Palace, the Wondrous Profit City, the Abandoned Worthy World, governed by the Brahma Treasure Cinnabar Numinous Crimson Thearch. Within it are the Vermilion Mound’s Prefecture, the Flowing Fire’s Court, the Great Blaze’s Palace, the Crimson Brightness’s Hall, and the Cinnabar Mound’s Fire Pool.",
      "overlap_context": "emerging from the bridge of the nose. The Left Mysterious Merit Officer dwells in the liver, emerging from the right eye. The Right Mysterious Merit Officer dwells in the lungs, emerging from the nose. The Upper Section Merit Officer emerges from between the brows, the Middle Section Merit Officer from the mouth, and the Lower Section Merit Officer from the navel. The Left and Right Official Envoys—the Left Official Envoy dwells in the left flank, and the Right Official Envoy in the right flank.",
      "start_char": 4213,
      "end_char": 5440,
      "start_sentence": 205,
      "end_sentence": 265,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.1717255115509,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\灵图类\\灵宝无量度人上品妙经符图（宋佚名）.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "元始天尊炼真文之所，乃混洞赤文之所化梵也。 天中，中下二真由不能得此，吾以此文并混洞梵元图，并付之於汝。 此去六九运亨，壬辰合度，庚子政化，自然敷露，其诸秘妙，符应皆定，莫可测矣。 混洞赤文梵元之图 乃神霄玉府、三五璇玑、中黄分炁、九霄混阳、元梵弥罗之炁，化生九天。 其所行之法； 具三五璇玑、洞阳天仙秘录中，此不备载。 混洞赤文九光之炁化生九天之图 九霄朕兆之初，摄洞阳九光之炁，混洞赤文，招摄天元，分灵散炁，而成九霄。 其诸玄奥，神府内禁，所秘至重，不可轻露。 混洞赤文，无无上真。 元始祖劫，化生诸天，开明三景，是为天根。 上无复祖，唯道为身。 五文开廓，普植神灵。 无文不光，无文不明，无文不立，无文不成，无文不度，无文不生。 是为大范天中之天。 郁罗箫台，玉山上京，上极无上大罗玉清，渺渺劫仞，若亡若存。 三华离便，大有妙庭，金阙玉房，森罗净霐。 大行梵炁，周回十方。 中有度人不死之神，中有南极长生之君，中有度世司马大神，中有好生韩君丈人，中有南上司命司录、延寿益算、度厄尊神，回骸起死，无量度人。 今日校录，诸天临轩。 东方无极飞天神王长生大圣无量度人，讳忽。 南方无极飞天神王长生大圣无量度人，讳飞。 西方无极飞天神王长生大圣无量度人，菩。 北方无极飞天神王长生大圣无量度人，云上。 东北无极飞天神王长生大圣无量度人，度仙。 东南无极飞天神王长生大圣无量度人，无镜。 西南无极飞天神王长生大圣无量度人，涤色。 西北无极飞天神王长生大圣无量度人，那郁。 上方无极飞天神王长生大圣无量度人，玃元。 下方无极飞天神王长生大圣无量度人，瑛。 十方至真飞天神王长生度世无量大神，并乘飞云，丹舆绿辈、羽盖琼轮、骖驾朱凤、五色玄龙； 建九色之节，十绝灵幡，前啸九凤，齐唱后吹，八鸾同鸣。 狮子白鹤，啸歌邕邕； 五老启途，群仙翼辕。 亿乘万骑，浮空而来。 倾光回驾，监真度生。 诸天丞相、南昌上宫、韩司主录、监生大神，执录把籍，齐到帝前。 随所应度，严校诸天，普告三界。 普告三界符 无极神乡，泉曲之府，北都罗酆三官九署、十二河源，上解祖考亿劫种亲，疾除罪薄，落灭恶根，不得拘留，逼合鬼群。 元始符命 元始符命，时刻升迁。 北都寒池，部卫形魂。 制魔保举，度品南宫。 死魂受炼，仙化成人。 生身受度，劫劫长存。 随劫输转，与天齐年。 永度三涂五苦八难，超凌三界，逍遥上清。 上清之天，天帝玉真，无色之境梵行。 三境玉函隐讳 四方总隐讳 三清金阙隐讳 元始灵书上篇　道君撰： 东方八天大黄皇曾天，帝郁褴玉明。 正音云：开玄摄明天，炁黄，系梵炁。 太明玉完天，帝须阿那田。 正音云：梁玄道灵天、炁绿，系壁宿。 清明何童天，帝元育齐京。 正音云：明生九真天，炁青，系室宿。 玄胎平育天，帝刘度内鲜。 正音云：飘轮默然天，炁赤，系危宿。 元明文举天，帝丑法轮。 正音云：开生舒天，炁苍，系虚宿。 上明七曜摩夷天，帝恬侩延。 正音云：延虚明天，炁黑，系女宿。 虚无越衡天，帝正定光。 正音云：镜无翘天，炁碧，系牛宿。 太极蒙翳天，帝曲育九昌。 正音云：阿难洋明天，炁紫，系斗宿。",
      "translated_text": "The Celestial Venerable of Primordial Beginning refined the true writs in the very place where the Chaotic Cavern’s Crimson Writ transformed into the Brahma. In the heavens, the middle and lower Perfected could not attain this. I now bestow upon you this writ together with the *Chaotic Cavern Brahma Primordial Chart*. After six times nine kalpas, when the cyclical signs align in harmony, the *ren-chen* year will meet its measure, and the *geng-zi* year will govern transformation—naturally, all shall be revealed. Its myriad secrets, its talismanic responses, are all fixed, beyond all reckoning.\n\nThe *Chaotic Cavern Crimson Writ Brahma Primordial Chart* arises from the *qi* of the Divine Numinous Jade Treasury, the Three-and-Five Revolving Mechanism, the Central Yellow’s partitioned *qi*, the Nine Heavens’ Chaotic Yang, and the Primordial Brahma’s Miro. It gives birth to the Nine Heavens. The methods it enacts are fully recorded in the *Three-and-Five Revolving Mechanism and Cavern Yang Heavenly Immortal Secret Register*; this text does not exhaustively record them.\n\nThe *Chaotic Cavern Crimson Writ Nine Radiances’ Qi Transforming the Nine Heavens Chart*:\nAt the inception of the Nine Heavens’ portents, it gathered the Cavern Yang’s Nine Radiant *qi*, the Chaotic Cavern’s Crimson Writ, summoned and grasped the Heavenly Origin, divided the numinous, dispersed the *qi*, and thus formed the Nine Heavens. Its profound mysteries are the innermost secrets of the Divine Treasury, of utmost weight—never to be lightly revealed.\n\nThe Chaotic Cavern’s Crimson Writ is the Non-Ultimate’s Supreme Perfected. From the Primordial Ancestral Kalpa, it gave birth to the myriad heavens, illumined the Three Luminaries, and became the Root of Heaven. Above, there is no further ancestor—only the Dao is its body. The Five Writs opened and expanded, universally planting the divine and numinous. Without the Writ, there is no radiance; without the Writ, there is no illumination; without the Writ, there is no establishment; without the Writ, there is no completion; without the Writ, there is no deliverance; without the Writ, there is no birth. This is the Great Model, the Heaven within Heaven.\n\nThe Dark Mystery’s Flute Terrace, the Jade Mountain’s Upper Capital, the Supreme Ultimate’s Great Peerless Jade Clarity—vast and boundless through kalpas, now present, now absent. The Three Flowers part and separate, the Great Existence’s Wondrous Court, the Golden Gates and Jade Chambers, the vast array of purity and clarity. The great flow of Brahma *qi* circulates through the ten directions. Within it dwell the gods who deliver people from death, the Southern Culmen’s Lord of Longevity, the Controller of the World’s Marshal Great Divinity, the Life-Favoring Elder Lord Han, the Southern Supreme’s Controller of Destiny and Recorder, the Extenders of Lifespan and Augmenters of Years, the Deliverers from Tribulation’s Venerable Divinities—who turn back bones and raise the dead, delivering boundless multitudes.\n\nToday, the celestial records are being reviewed, and the myriad heavens draw near. From the Eastern Limitless, the Flying Heavenly Divine King, the Great Sage of Longevity and Boundless Deliverance, named Hu. From the Southern Limitless, the Flying Heavenly Divine King, the Great Sage of Longevity and Boundless Deliverance, named Fei. From the Western Limitless, the Flying Heavenly Divine King, the Great Sage of Longevity and Boundless Deliverance, named Pu. From the Northern Limitless, the Flying Heavenly Divine King, the Great Sage of Longevity and Boundless Deliverance, named Yunshang. From the Northeastern Limitless, the Flying Heavenly Divine King, the Great Sage of Longevity and Boundless Deliverance, named Duxian. From the Southeastern Limitless, the Flying Heavenly Divine King, the Great Sage of Longevity and Boundless Deliverance, named Wujing. From the Southwestern Limitless, the Flying Heavenly Divine King, the Great Sage of Longevity and Boundless Deliverance, named Dise. From the Northwestern Limitless, the Flying Heavenly Divine King, the Great Sage of Longevity and Boundless Deliverance, named Nayu. From the Upper Limitless, the Flying Heavenly Divine King, the Great Sage of Longevity and Boundless Deliverance, named Jueyuan. From the Lower Limitless, the Flying Heavenly Divine King, the Great Sage of Longevity and Boundless Deliverance, named Ying.\n\nThe Ten Directions’ Utmost Perfected Flying Heavenly Divine Kings, the Great Divinities of Longevity and Boundless Deliverance, all ride flying clouds, cinnabar chariots with green canopies, feathered canopies and jade wheels, drawn by vermilion phoenixes and five-colored dark dragons. They bear nine-colored standards and ten absolute numinous banners, with nine phoenixes wailing ahead and harmonious flutes sounding behind, eight simurghs singing in unison. Lions and white cranes roar and chant in harmony; the Five Elders clear the way, and the host of immortals flank the chariots. Myriad chariots and ten thousand riders float through the void to arrive. Their radiant light turns back, their chariots return, overseeing the Perfected and delivering the living.\n\nThe myriad heavens’ chancellors, the Southern Prosperity’s Upper Palace, the Recorder Han, the Overseer of Life’s Great Divinity—holding records and grasping registers—all arrive before the Thearch. According to those who ought to be delivered, they strictly review the myriad heavens and universally proclaim to the Three Realms.\n\n**Universal Proclamation to the Three Realms Talisman**\nTo the Divine Realm beyond limits, the Yellow Springs’ Curved Prefecture, the Northern Capital’s Fengdu, the Three Offices and Nine Bureaus, the Twelve River Sources—release the ancestral progenitors and karmic kin of a hundred kalpas, swiftly erase their ledgers of transgressions, extinguish their roots of evil, and let them not be detained or pressed into the ghostly throng.\n\n**Primordial Beginning’s Talismanic Mandate**\nThe Primordial Beginning’s talismanic mandate, at the appointed hour, ascends and advances. The Northern Capital’s Cold Pool guards and protects forms and souls. It subdues demons, ensures promotion, and delivers ranks to the Southern Palace. Dead souls receive refinement and transform into immortals. Living beings receive deliverance and endure through kalpas. Following the kalpas’ revolutions, they share the heavens’ years. Forever delivered from the Three Paths, Five Sufferings, and Eight Tribulations, they transcend the Three Realms and roam freely in the Upper Clarity.\n\nThe Upper Clarity’s Heaven, the Heavenly Thearch’s Jade Perfected, the Formless Realm’s Brahma conduct. The Three Realms’ Jade Caskets’ Hidden Secrets. The Four Directions’ General Hidden Secrets. The Three Clarities’ Golden Gates’ Hidden Secrets.\n\n**Primordial Beginning’s Numinous Writ, Upper Scroll**\nComposed by the Dao Lord:\n\nThe Eastern Eight Heavens’ Great Yellow August Layered Heaven, ruled by Thearch Yulan Yuming. Its correct sound: *Kai Xuan She Ming* Heaven, yellow *qi*, belonging to Brahma *qi*. The Great Brightness’ Jade Complete Heaven, ruled by Thearch Xu Anatian. Its correct sound: *Liang Xuan Dao Ling* Heaven, green *qi*, belonging to the Wall Mansion. The Clear Brightness’ He Tong Heaven, ruled by Thearch Yuan Yu Qijing. Its correct sound: *Ming Sheng Jiu Zhen* Heaven, blue-green *qi*, belonging to the House Mansion. The Dark Womb’s Level Nurturing Heaven, ruled by Thearch Liu Du Neixian. Its correct sound: *Piao Lun Mo Ran* Heaven, red *qi*, belonging to the Rooftop Mansion. The Primordial Brightness’ Writ Upholding Heaven, ruled by Thearch Chou Falun. Its correct sound: *Kai Sheng Shu* Heaven, dark green *qi*, belonging to the Void Mansion. The Upper Brightness’ Seven Luminaries’ Ma Yi Heaven, ruled by Thearch Tian Kuaiyan. Its correct sound: *Yan Xu Ming* Heaven, black *qi*, belonging to the Woman Mansion. The Void’s Transcendent Balance Heaven, ruled by Thearch Zheng Dingguang. Its correct sound: *Jing Wu Qiao* Heaven, jade-green *qi*, belonging to the Ox Mansion. The Great Ultimate’s Veiled Heaven, ruled by Thearch Qu Yu Jiuchang. Its correct sound: *A Nan Yang Ming* Heaven, purple *qi*, belonging to the Dipper Mansion.",
      "overlap_context": "cending to transform the Nine Causes and the Eight Brahma Perfected Jade Palaces—this too is the transformation of this writ.\n\nTherefore, within the Great Cinnabar Heaven lies the Crimson Bright Thearch’s Palace, the Wondrous Profit City, the Abandoned Worthy World, governed by the Brahma Treasure Cinnabar Numinous Crimson Thearch. Within it are the Vermilion Mound’s Prefecture, the Flowing Fire’s Court, the Great Blaze’s Palace, the Crimson Brightness’s Hall, and the Cinnabar Mound’s Fire Pool.",
      "start_char": 5440,
      "end_char": 6760,
      "start_sentence": 266,
      "end_sentence": 335,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.91059732437134,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\灵图类\\灵宝无量度人上品妙经符图（宋佚名）.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "南方八天 赤明和阳天，帝理禁上真。 正音云：治安保仙天，炁白，系梵炁。 玄明恭华天，帝空谣丑音。 正音云：飞音洞灵天，炁黄，系箕宿。 曜明宗飘天，帝重光明。 正音云：翘贞英天，炁绿，系尾宿。 竺落皇笳天，帝摩夷妙辩。 正音云：难玄明天，炁青，系心宿。 虚明堂曜天，帝阿＠娄生。 正音云：弥玄明天，炁赤。 系房宿。 观明端靖天，帝郁密罗千。 正音云：朗观曜明天，炁苍，系氏宿。 玄明恭庆天，帝龙罗菩题。 正音云：威清道玄天，炁黑，系亢宿。 太焕极瑶天，帝宛黎无延。 正音云：洞真永瑶天，炁碧，系角宿。 西方八天 元载孔升天，帝开真定光。 正音云：阁光竟真天，炁紫，系梵炁。 太安皇崖天，帝婆娄阿贪。 正音云：晖莫阿魂天，炁白，系轸宿。 显定极风天，帝招真童。 正音云：回翘威天，炁黄，系翼宿。 始皇孝芒天，帝萨罗娄王。 正音云：君华大权天，炁绿，系张宿。 太皇翕重浮容天，帝闵巴狂。 正音云：惠威光天，炁青，系星宿。 无思江由天，帝明梵光。 正音云：朗法元天，炁赤，系柳宿。 上揲阮乐天，帝勃勃监。 正音云：峦元真星天，炁苍，系鬼宿。 无极昙誓天，帝飘弩穹隆。 正音云：飞天虚英天，炁黑，系井宿。 北方八天 皓庭霄度天，帝慧觉昏。 正音云：无清明天，炁碧，系梵炁。 渊通元洞天，帝梵行观生。 正音云：法权道先天，炁紫，系参宿。 太文翰宠妙成天，帝那育丑英。 正音云：灵熏慧光天，炁白，系觜宿。 太素秀乐禁上天，帝龙罗觉长。 正音云 : 阳威耀清天，炁黄，系毕宿。 太虚无上常融天，帝总监鬼神。 正音云：摄灵真天，炁绿，系昴宿。 太释玉隆腾胜天，帝眇眇行元。 正音云空微道明天，炁青，系胃宿。 龙变梵度天，帝运上玄玄。 正音云：掬灵妙光天，炁赤，系娄宿。 太极平育贾奕天，帝大择法门。 正音云：永玄久生天，炁苍，系奎宿。 此诸天帝玉讳，皆以赤晶之玉，碧字刻之。 秘於上清帝宫之中矣。 三十二天、三十二帝诸天隐讳、诸天隐名，天中空洞自然灵章； 诸天隐韵，天中之音，天中大尊，天中之神，天中之魔，天中之灵，九和十合，变化上清。 无量之奥，深不可详。 敷落神真，普度天人。 今日欣庆，受度历关诸天。 历关诸天符 请灭三恶，斩绝地根，飞度五户，名列太玄。 魔王监举，无拘天门。 东斗主算，西斗记名。 北斗落死，南斗上生。 中斗大魁，总监众灵。 青帝护魂，护得道者三魂，使其通灵澄彻。 青帝歌曰： 东望重拜手，苍帝玉皇君。 灵风鼓橐钥，育物布元春。 云龙辔严驾，玉卫拥琼轮。 枯萌泛沾及，大惠无不均。 万仙歌以道，委曲戒天人。 心根迷自固，拱跽戴洪仁。 青帝护魂之符 姓阎，讳开明，字灵威仰。 右青书白素佩之，以立春之日受。 若吞服，书以竹膜上，三枚。 白帝侍魄，　侍得道者七魄，使无散乱，闭绝鬼道。 白帝歌曰： 六甲抱金关，七政守灵坛。 流铃掷 化火，威剑巨龙蟠。 恳彼素灵真，明宪孰敢干。 束制妖鬼魔，凛落霄风寒。 沴炁既已息，万天俄而安。 真俦荷大庇，抵颡相歌欢。 白帝侍魄之符 姓上金，讳昌开，字耀伯宝。 右白书紫素佩之，以立秋之日受。 若吞服，书以竹膜上，四枚。",
      "translated_text": "The Eight Southern Heavens\n\nThe Vermilion Brightness’ Harmonious Yang Heaven, ruled by Thearch Li Jinshangzhen. Its correct sound: *Zhi’an Baoxian* Heaven, white *qi*, belonging to the *Fan Qi*.\n\nThe Mysterious Brightness’ Reverent Florescence Heaven, ruled by Thearch Kong Yao Chouyin. Its correct sound: *Feiyin Dongling* Heaven, yellow *qi*, belonging to the Winnowing Basket Mansion.\n\nThe Radiant Brightness’ Ancestral Drifting Heaven, ruled by Thearch Chong Guangming. Its correct sound: *Qiaozhen Ying* Heaven, green *qi*, belonging to the Tail Mansion.\n\nThe Bamboo Grove’s August Reed-Pipe Heaven, ruled by Thearch Moyi Miaobian. Its correct sound: *Nanxuan Ming* Heaven, blue-green *qi*, belonging to the Heart Mansion.\n\nThe Void Brightness’ Hall Radiance Heaven, ruled by Thearch A✷Lou Sheng. Its correct sound: *Mixuan Ming* Heaven, red *qi*, belonging to the Room Mansion.\n\nThe Contemplative Brightness’ Upright Serenity Heaven, ruled by Thearch Yu Milo Qian. Its correct sound: *Langguan Yaoming* Heaven, dark green *qi*, belonging to the Clan Mansion.\n\nThe Mysterious Brightness’ Reverent Celebration Heaven, ruled by Thearch Long Luo Puti. Its correct sound: *Weiqing Daoxuan* Heaven, black *qi*, belonging to the Neck Mansion.\n\nThe Great Resplendence’s Jade-Polished Heaven, ruled by Thearch Wan Li Wuyan. Its correct sound: *Dongzhen Yongyao* Heaven, jade-green *qi*, belonging to the Horn Mansion.\n\n---\n\nThe Eight Western Heavens\n\nThe Primordial Ascent’s Cavernous Ascension Heaven, ruled by Thearch Kai Zhendinguang. Its correct sound: *Geguang Jingzhen* Heaven, purple *qi*, belonging to the *Fan Qi*.\n\nThe Great Peace’s August Precipice Heaven, ruled by Thearch Polou Atan. Its correct sound: *Huimo Ahun* Heaven, white *qi*, belonging to the Chariot Mansion.\n\nThe Manifest Stability’s Ultimate Wind Heaven, ruled by Thearch Zhao Zhentong. Its correct sound: *Huiqiao Wei* Heaven, yellow *qi*, belonging to the Wings Mansion.\n\nThe Origin Sovereign’s Filial Vastness Heaven, ruled by Thearch Salou Louwang. Its correct sound: *Junhua Daquan* Heaven, green *qi*, belonging to the Spread Mansion.\n\nThe Great August’s Convergent Floating Countenance Heaven, ruled by Thearch Min Ba Kuang. Its correct sound: *Huiwei Guang* Heaven, blue-green *qi*, belonging to the Star Mansion.\n\nThe Non-Thought’s River Flowing Heaven, ruled by Thearch Ming Fan Guang. Its correct sound: *Langfa Yuan* Heaven, red *qi*, belonging to the Willow Mansion.\n\nThe Upper Divination’s Joyous Heaven, ruled by Thearch Bobo Jian. Its correct sound: *Luanyuan Zhenxing* Heaven, dark green *qi*, belonging to the Ghost Mansion.\n\nThe Boundless’ Cloud Vow Heaven, ruled by Thearch Piaonu Qionglong. Its correct sound: *Feitian Xuying* Heaven, black *qi*, belonging to the Well Mansion.\n\n---\n\nThe Eight Northern Heavens\n\nThe Luminous Court’s Rosy Span Heaven, ruled by Thearch Hui Jue Hun. Its correct sound: *Wu Qingming* Heaven, jade-green *qi*, belonging to the *Fan Qi*.\n\nThe Abyssal Penetration’s Primordial Cavern Heaven, ruled by Thearch Fan Xing Guansheng. Its correct sound: *Faquan Daoxian* Heaven, purple *qi*, belonging to the Three Stars Mansion.\n\nThe Great Literature’s Graceful Wondrous Completion Heaven, ruled by Thearch Nayuchou Ying. Its correct sound: *Lingxun Huiguang* Heaven, white *qi*, belonging to the Turtle Beak Mansion.\n\nThe Great Simplicity’s Elegant Joyous Prohibition Heaven, ruled by Thearch Long Luo Juechang. Its correct sound: *Yangwei Yaoging* Heaven, yellow *qi*, belonging to the Net Mansion.\n\nThe Great Void’s Supreme Constant Fusion Heaven, ruled by Thearch Zong Jian Guishen. Its correct sound: *Sheling Zhen* Heaven, green *qi*, belonging to the Hairy Head Mansion.\n\nThe Great Release’s Jade Ascendant Ascendancy Heaven, ruled by Thearch Miaomiao Xingyuan. Its correct sound: *Kongwei Daoming* Heaven, blue-green *qi*, belonging to the Stomach Mansion.\n\nThe Dragon Transformation’s *Fan* Span Heaven, ruled by Thearch Yun Shang Xuanyuan. Its correct sound: *Juling Miaoguang* Heaven, red *qi*, belonging to the Bond Mansion.\n\nThe Great Ultimate’s Level Nurturing Prosperity Heaven, ruled by Thearch Da Ze Famen. Its correct sound: *Yongxuan Jiusheng* Heaven, dark green *qi*, belonging to the Straddling Mansion.\n\n---\n\nThe secret names of all these Heavenly Thearchs are inscribed in red-crystal jade with azure characters, concealed within the Palace of the Supreme Clarity.\n\nThe Thirty-Two Heavens, the Thirty-Two Thearchs—each with their hidden names, hidden sounds, and hidden rhythms—are the spontaneous, numinous scriptures of the heavens. The hidden melodies are the celestial sounds; the Celestial Great Honored Ones are the gods of the heavens; the demons of the heavens, the spirits of the heavens—nine harmonies and ten unions transform into the Supreme Clarity. Their boundless mysteries are too profound to fathom. They spread forth divine transcendents to universally deliver heaven and humanity.\n\nToday, in joyous celebration, we traverse the passes of all heavens.\n\n**Talisman for Traversing the Passes of All Heavens**\nMay the Three Evils be extinguished, the roots of the earth severed. Soaring through the Five Households, may your name be inscribed in the Great Mystery. The Demon Kings supervise the ascent, unbound by the gates of heaven. The Eastern Dipper governs fate, the Western Dipper records names. The Northern Dipper decrees death, the Southern Dipper bestows life. The Central Dipper’s Great Chief oversees all spirits.\n\nThe Azure Thearch guards the *hun*-souls, protecting the three *hun* of those who attain the Dao, enabling their numinous clarity. The Azure Thearch’s hymn says:\n*Facing east, I bow with clasped hands,*\n*To the Jade Sovereign of the Azure Thearch.*\n*The numinous winds stir the bellows’ pipes,*\n*Nurturing all things with the primal spring.*\n*Cloud-dragons harness the solemn chariot,*\n*Jade guards encircle the jasper wheels.*\n*Withered sprouts awash in dew,*\n*Great kindness knows no bounds.*\n*Myriad immortals sing of the Dao,*\n*Exhorting heaven and humanity with care.*\n*The root of the heart, deluded, clings fast—*\n*Kneeling, I uphold the vast benevolence.*\n\n**Talisman of the Azure Thearch for Guarding the *Hun***\nSurname: Yan. Personal name: Kaiming. Style: Lingweiyang.\nInscribe in azure on white silk and wear it; receive it on the day of *Lichun*. If ingested, write on bamboo membrane, three pieces.\n\nThe White Thearch attends the *po*-souls, safeguarding the seven *po* of those who attain the Dao, preventing their dispersal and sealing the ghostly paths. The White Thearch’s hymn says:\n*The Six Jia embrace the Golden Gate,*\n*The Seven Governors guard the numinous altar.*\n*Tossed bells transform into fire,*\n*The mighty sword coils with a giant dragon.*\n*I entreat the pure numinous ones,*\n*What audacity dares violate the bright statutes?*\n*Binding and restraining demonic ghosts,*\n*The cold winds of the empyrean howl.*\n*Once baleful *qi* is stilled,*\n*The myriad heavens swiftly find peace.*\n*True companions bear great shelter,*\n*Kowtowing, they sing in joy.*\n\n**Talisman of the White Thearch for Attending the *Po***\nSurname: Shangjin. Personal name: Changkai. Style: Yaobaobao.\nInscribe in white on purple silk and wear it; receive it on the day of *Liqiu*. If ingested, write on bamboo membrane, four pieces.",
      "overlap_context": "Mansion. The Upper Brightness’ Seven Luminaries’ Ma Yi Heaven, ruled by Thearch Tian Kuaiyan. Its correct sound: *Yan Xu Ming* Heaven, black *qi*, belonging to the Woman Mansion. The Void’s Transcendent Balance Heaven, ruled by Thearch Zheng Dingguang. Its correct sound: *Jing Wu Qiao* Heaven, jade-green *qi*, belonging to the Ox Mansion. The Great Ultimate’s Veiled Heaven, ruled by Thearch Qu Yu Jiuchang. Its correct sound: *A Nan Yang Ming* Heaven, purple *qi*, belonging to the Dipper Mansion.",
      "start_char": 6761,
      "end_char": 8105,
      "start_sentence": 336,
      "end_sentence": 425,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.87748980522156,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\灵图类\\灵宝无量度人上品妙经符图（宋佚名）.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "赤帝养炁，赤帝主火，能生养元炁。 黄帝曰壮火食炁，少火生炁，炁得温而后养。 赤帝歌曰： 太景开玉枢，洞堂启金除。 骞林荫瑶砌，丹鸾踏琼株。 宝房名曲丽，明珰神所居。 飞游豁云道，引目盻真都。 天日永不夕，重烟锁清庐。 太上勅印开，帕几罗简书。 裨风树玄化，悫辛谅有余。 赤帝养炁之符 姓洞浮，讳极炎，字赤熛弩。 右丹书黄素佩之，以立夏之日受。 若吞服，书以竹膜上，二枚。 黑帝通血，　护育得道之人，使血脉通利，荣盛一身，无有窒碍。 黑帝，太元水帝也。 水在人身而为血。 黑帝歌曰： 无质统有物，渊兮上帝心。 不启不发道，蕴妙化机深。 恐尔漏未尽，阴想勿侵淫。 转轮无涯波，苦道相迷寻。 万年尝谨约，一旦自湮沉。 无冲落鬼境，殃谴不可任。 黑帝通血之符 姓黑节，讳灵会，字隐候局。 右黑书青素佩之，以立冬之日受。 若吞服，书以竹膜上，一枚。 黄帝中主，　营卫中府，拘制万神，不令错越。 若近取一身，则肝藏魂，肺藏魄。 绛宫丹田二炁交媾，则赤炁下降，玄泉上升。 心藏血，肾藏精，二炁返复，交相生养。 黄庭之中，神意所在也。 万神无越。 黄帝歌曰： 黄天拱中宸，控驾玉化根。 翘机贯亿历，洞朗辟四门。 大有混皇真，＠制星宿魂。 非帝道不运，有方赖之存。 威忿即霜秋，和预为阳春。 生成握元纪，仰荷戴无垠。 黄帝中主之符 姓通班，讳元成，字含枢纽。 右黄书绛素佩之，以土王之日受。 若吞服，书以竹膜上，五枚。",
      "translated_text": "The Red Thearch nurtures *qi*; the Red Thearch governs fire and can generate and cultivate primordial *qi*. The Yellow Thearch said: \"Robust fire consumes *qi*, while gentle fire generates *qi*; *qi* is nurtured only after it is warmed.\"\n\nThe Red Thearch’s hymn says:\n*The Grand Vista opens the Jade Pivot,*\n*The cavernous hall unfolds the Golden Steps.*\n*The soaring forest shades the jade terrace,*\n*The cinnabar phoenix treads upon the jasper tree.*\n*The treasure chamber, named Qu Li,*\n*Is where the radiant spirits dwell.*\n*Soaring journeys clear the clouded paths,*\n*Drawing the gaze to behold the true capital.*\n*The celestial sun endures without dusk,*\n*Layered mists seal the pure abode.*\n*The Most High’s decree unfolds the seal,*\n*Silk and table array the scripted writs.*\n*The genial wind plants the mysterious transformation,*\n*Sincerity and toil surely abound.*\n\n**Talisman of the Red Thearch for Nurturing *Qi***\nSurname: Dongfu. Personal name: Jiyan. Style: Chibiaonu.\nInscribe in cinnabar on yellow silk and wear it; receive it on the day of *Lixia*. If ingested, write on bamboo membrane, two pieces.\n\nThe Black Thearch unblocks the blood, protecting and nurturing those who attain the Dao, ensuring the blood vessels flow smoothly, flourishing throughout the body without obstruction. The Black Thearch is the Supreme Water Thearch. Water within the human body becomes blood.\n\nThe Black Thearch’s hymn says:\n*Formless, yet it governs all things,*\n*Abyssal, it is the heart of the Supreme Lord.*\n*The Dao, unopened and unrevealed,*\n*Conceals profound transformations and deep mechanisms.*\n*Fear your leaks are not yet exhausted,*\n*Lest yin thoughts encroach and overwhelm.*\n*The turning wheel knows no boundless waves,*\n*Yet the bitter path leads to mutual confusion.*\n*For ten thousand years, ever cautious and restrained,*\n*In a single day, one may sink into oblivion.*\n*Do not rush into the ghostly realms,*\n*For calamities and retributions cannot be borne.*\n\n**Talisman of the Black Thearch for Unblocking Blood**\nSurname: Heijie. Personal name: Linghui. Style: Yinhouju.\nInscribe in black on blue-green silk and wear it; receive it on the day of *Lidong*. If ingested, write on bamboo membrane, one piece.\n\nThe Yellow Thearch, Central Lord, regulates the *ying* and *wei* within the central palace, restraining the myriad spirits to prevent them from straying. If considered in relation to the body, the liver stores the *hun*, and the lungs store the *po*. When the *qi* of the Crimson Palace and the Cinnabar Field intermingle, the red *qi* descends while the mysterious spring rises. The heart stores blood, and the kidneys store essence; the two *qi* cycle and reciprocally generate and nurture one another. Within the Yellow Court, the spirit and intent reside—none of the myriad spirits may transgress.\n\nThe Yellow Thearch’s hymn says:\n*The Yellow Heaven arches the central celestial pole,*\n*Guiding the jade root of transformation.*\n*The elevated mechanism spans countless eons,*\n*Illuminating and opening the four gates.*\n*The Great Possession blends with the August True Ones,*\n*Restraining the stellar spirits.*\n*Without the Thearch’s Dao, nothing moves;*\n*All directions rely on its existence.*\n*Wrath and fury bring autumn’s frost,*\n*Harmony and joy herald spring’s warmth.*\n*Creation and completion grasp the primordial order,*\n*Looking up, we bear and wear its boundless grace.*\n\n**Talisman of the Yellow Thearch, Central Lord**\nSurname: Tongban. Personal name: Yuancheng. Style: Hanshuniu.\nInscribe in yellow on crimson silk and wear it; receive it on the day of *Tuwang*. If ingested, write on bamboo membrane, five pieces.",
      "overlap_context": "ate the bright statutes?*\n*Binding and restraining demonic ghosts,*\n*The cold winds of the empyrean howl.*\n*Once baleful *qi* is stilled,*\n*The myriad heavens swiftly find peace.*\n*True companions bear great shelter,*\n*Kowtowing, they sing in joy.*\n\n**Talisman of the White Thearch for Attending the *Po***\nSurname: Shangjin. Personal name: Changkai. Style: Yaobaobao.\nInscribe in white on purple silk and wear it; receive it on the day of *Liqiu*. If ingested, write on bamboo membrane, four pieces.",
      "start_char": 8106,
      "end_char": 8718,
      "start_sentence": 426,
      "end_sentence": 470,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.225268125534058,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\灵图类\\灵宝无量度人上品妙经符图（宋佚名）.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "青天魔王巴元丑伯，赤天魔王负天担石，白天魔王返山六目，黑天魔王监丑朗馥，黄天魔王横天担力。 五帝大魔， 万神之宗。 东方青灵始老青帝消魔王咒曰 洞耀育元晶，青华开太明。 布育九天炁，始生荐无英。 扶阳通摄御，丹林合总真。 积霄始晖上，郁迭明霞晨。 灵光焕罗落，卫育保形魂。 混化合玄景，仁惠消魔群。 万遍道已超，功当书上清。 南方丹灵真老赤帝消魔王咒曰 三炁蔼灵阙，明虚焕玉丹。 朱陵有帝真，华云飞绛軿。 统御万界中，抚运超亿千。 执策按简录，洞章敷神篇。 解结散祸根，流金摧凶奸。 志能成此道，魔试俱无前。 保度冥劫津，宴盻无穷年。 西方皓灵皇老白帝消魔王咒曰 西灵徊七度，太渺郁明华。 白元维我神，皇真御景霞。 皎皎三素辉，昭昭破百邪。 摄音延至炁，金晶育三田。 练结固玉质，宝耀映琼鲜。 魔精当灭试，逮地无沉连。 逸辔高清馆，齐轮太上仙。 北方五灵玄老黑帝消魔王咒曰 北玄三秀蔼，太上紫皇居。 总炁摄幽机，造化敷灵纲。 下统虚危精，宝育天元房。 灵通太妙神，缠罗卫百关。 豁落灭魔试，凶灾永不干。 大道保自然，寿命无亏残。 万劫享庆会，白日登云轮。 中央元灵元老黄帝消魔王咒曰： 混化归冲妙，元皇总帝灵。 真老闭黄阙，四御齐玄钧。 圆华太张上，同携坚玉君。 结津固百骸，琼耀拥胎仙。 晨晖注明景，魔映自灭形。 万道保无亏，返老回童婴。 五会合一炁，飞驭超云京。 青天魔王制邪玉文 姓斌，讳齿成巴。 郁蔼苍晶，洞景开明。 始阳九炁，停华育魂。 流．英妙府，灵真上神。 琼碧云冠，飞光羽群。 青腰玉女，太上真人。 保度仙箓，消魔却氛。 右文与青帝大符通灵合变，节度同功。 赤天魔王制邪玉文 姓佛，讳由肃。 昌阳真老，赤灵尊神。 统御丹天，检制魔群。 严驾朱凤，三角之麟。 上道泰清，玄元之根。 炎熛三炁，盘徊降云。 育养丹府，保制长存。 右文与赤帝大符通灵合变，节度同功。 白帝魔王制邪玉文 姓赤，讳张布。 七灵皓炁，三景元真。 中有皇老，制摄魔精。 庚辛官将，七十万兵。 羽旗云节，金虎云奔。 断除妖妄，练育华英。 与道长存，历劫无倾。 右文与白帝大符通灵合变，节度同功。 黑天魔王制邪玉文 姓徐，讳直事。 北阴郁单，玄炁之官。 帝真灵会，驱神驾龙。 室有玉女，夜光之童。 掌握图箓，摄制魔踪。 虚危合化，紫烟激风。 宝晶练育，后天无终。 右文与黑帝大符通灵合变，节度同功。 黄天魔王制邪玉文 姓天门，讳波狂。 元皇上灵，冲妙之尊，混合真朴，造化玄根。 感激幽微，挺生大神。 摄召万炁，齐会华房。 消荡百魔，与道俱昌。 保度却灾，灭试除殃。 右文与黄帝大符通灵合变，节度同功。 五帝符 青帝御魔总真符 右符吏启华，领兵九十万人，守卫其文。 其符并前赤书真文、以春甲乙之日，朱书紫上，置於东方，禳却万灾，保镇无穷，召延嘉祥，物阜时康。 学道之士以时服之，三年之后，生青玉之英於肝府之中，光映形外。 道成，青帝召迎。 志诚佩之，未消殃患矣。 切须敬慎。 赤帝御魔总真符 右符吏明真，领兵三十万人，守卫其文。 其符并前赤书真文，以夏丙丁之日，朱书青上，置於南方。 禳却万灾，保镇无穷，召延嘉祥，物阜时康。",
      "translated_text": "**The Five Heavenly Demon Kings**\n\nThe Demon King of the Azure Heaven: Bayuan Choubo.\nThe Demon King of the Vermilion Heaven: Futian Danshi.\nThe Demon King of the White Heaven: Fanshan Liumu.\nThe Demon King of the Black Heaven: Jianchou Langfu.\nThe Demon King of the Yellow Heaven: Hengtian Danli.\nThe Five Thearchic Great Demons, ancestors of the myriad spirits.\n\n**Incantation of the Azure Thearch, Eastern Lord of Primordial Youth, to Dissolve Demons**\n*\"Cavernous radiance nurtures the primordial crystal,*\n*Azure splendor unfolds the Great Luminance.*\n*Spreading and fostering the nine heavens’ qi,*\n*At first birth, it offers the peerless hero.*\n*Upholding yang, it governs and commands,*\n*Cinnabar groves unite with the assembled perfected.*\n*Accumulating dawn’s first glow above,*\n*Layered brilliance illumines the rosy morn.*\n*Spirit-light blazes through the celestial net,*\n*Guarding and nurturing form and soul.*\n*Blended transformation merges with the mysterious scene,*\n*Benevolence and grace dissolve demonic hordes.*\n*Recited ten thousand times, the Dao transcends,*\n*Merit shall be inscribed in the Upper Clarity.\"*\n\n**Incantation of the Vermilion Thearch, Southern True Lord of Cinnabar Youth, to Dissolve Demons**\n*\"Three qi suffuse the numinous portal,*\n*Luminous emptiness gleams with jade cinnabar.*\n*The Vermilion Mound harbors the Thearch’s perfected,*\n*Vermilion clouds soar with crimson chariots.*\n*Governing and guiding within the ten thousand realms,*\n*Pacifying and transcending countless eons.*\n*Holding the staff, consulting the celestial records,*\n*Cavernous scriptures unfold the divine chapters.*\n*Untying knots, dispersing the roots of calamity,*\n*Molten gold shatters the wicked and treacherous.*\n*If the will can accomplish this Dao,*\n*No demonic trial shall stand before it.*\n*Preserving passage across the dark kalpas,*\n*Reveling in boundless years.\"*\n\n**Incantation of the White Thearch, Western August Lord of Radiant Youth, to Dissolve Demons**\n*\"Western numen circles the seven revolutions,*\n*Vast and distant, luxuriant with luminous splendor.*\n*White primordiality binds my spirit,*\n*August perfected govern the scene of rosy clouds.*\n*Resplendent, the threefold purity shines,*\n*Brilliant, it shatters the hundred evils.*\n*Drawing forth the extended qi of utmost reach,*\n*Golden essence nurtures the three fields.*\n*Refining and congealing to solidify jade substance,*\n*Precious radiance reflects the freshness of jasper.*\n*Demon essence shall be extinguished in trial,*\n*Reaching earth, none shall sink or be fettered.*\n*Reining in the reins of the lofty pure abode,*\n*Aligning wheels with the Most High Immortals.\"*\n\n**Incantation of the Black Thearch, Northern Mysterious Lord of Fivefold Numinosity, to Dissolve Demons**\n*\"Northern mystery’s threefold elegance suffuses,*\n*The Most High Purple Thearch dwells within.*\n*Gathering qi to grasp the dark mechanism,*\n*Creation unfolds the numinous net.*\n*Below, it governs the essence of Void and Danger,*\n*Precious nurturing of Heaven’s primordial chamber.*\n*Numinous communion with the wondrously subtle spirit,*\n*Enwrapping and guarding the hundred passes.*\n*Vast and open, it extinguishes demonic trials,*\n*Calamities and disasters shall never encroach.*\n*The Great Dao preserves the natural order,*\n*Lifespan suffers no loss or decay.*\n*Through ten thousand kalpas, it enjoys blessed assemblies,*\n*Ascending the cloud-wheel in broad daylight.\"*\n\n**Incantation of the Yellow Thearch, Central Primordial Lord of Primordial Youth, to Dissolve Demons**\n*\"Blended transformation returns to the profound and subtle,*\n*The Primordial Thearch unites the Thearchic numina.*\n*The True Elder seals the Yellow Portal,*\n*The Four Governors align with the mysterious balance.*\n*Circular splendor soars above the Great Expansion,*\n*Together they grasp the Firm Jade Lord.*\n*Congealing essences to fortify the hundred bones,*\n*Jasper radiance enfolds the embryonic immortal.*\n*Morning brilliance pours into the luminous scene,*\n*Demons reflect and self-annihilate their forms.*\n*Myriad Dao preserves without loss,*\n*Reverting age to return to childlike infancy.*\n*The Five Assemblies merge into one qi,*\n*Soaring in flight to transcend the cloud capital.\"*\n\n---\n\n**Jade Text of the Azure Heavenly Demon King to Subdue Evil**\nSurname: Bin. Personal name: Chichengba.\n*\"Luxuriant and verdant, the azure crystal,*\n*Cavernous scene unfolds its brightness.*\n*Primordial yang’s ninefold qi,*\n*Stilled splendor nurtures the soul.*\n*Flowing hero of the wondrous palace,*\n*Numinous perfected, supreme spirit.*\n*Jasper and jade cloud-crown,*\n*Soaring light, feathered throng.*\n*Azure-waisted Jade Maidens,*\n*Most High Perfected Ones.*\n*Preserving passage through the immortal registers,*\n*Dissolving demons, dispelling miasma.\"*\n\nThis text, in communion with the Azure Thearch’s great talisman, transforms in unison, its regulatory power identical in efficacy.\n\n**Jade Text of the Vermilion Heavenly Demon King to Subdue Evil**\nSurname: Fo. Personal name: Yousu.\n*\"Prosperous yang, True Elder,*\n*Vermilion numinous august spirit.*\n*Governing the Cinnabar Heaven,*\n*Inspecting and restraining demonic hordes.*\n*Solemnly driving the vermilion phoenix,*\n*Three-horned qilin.*\n*Ascending the Dao of the Supreme Clarity,*\n*Root of the mysterious and primordial.*\n*Flaming blaze of the threefold qi,*\n*Coiling and descending in clouds.*\n*Nurturing the cinnabar palace,*\n*Preserving and governing for eternal endurance.\"*\n\nThis text, in communion with the Vermilion Thearch’s great talisman, transforms in unison, its regulatory power identical in efficacy.\n\n**Jade Text of the White Thearch’s Demon King to Subdue Evil**\nSurname: Chi. Personal name: Zhangbu.\n*\"Sevenfold numinous radiant qi,*\n*Threefold scenes of primordial perfection.*\n*Within resides the August Elder,*\n*Controlling and restraining demonic essence.*\n*Officers of Geng and Xin,*\n*Seven hundred thousand troops.*\n*Feathered banners, cloud standards,*\n*Golden tigers, cloud-borne gallop.*\n*Severing and eliminating the demonic and deluded,*\n*Refining and nurturing the flowering hero.*\n*Abiding with the Dao for eternal endurance,*\n*Through kalpas without collapse.\"*\n\nThis text, in communion with the White Thearch’s great talisman, transforms in unison, its regulatory power identical in efficacy.\n\n**Jade Text of the Black Heavenly Demon King to Subdue Evil**\nSurname: Xu. Personal name: Zhishi.\n*\"Northern darkness, somber and solitary,*\n*Palace of the mysterious qi.*\n*Thearchic perfected in numinous assembly,*\n*Driving spirits, charioting dragons.*\n*Within the chamber, Jade Maidens,*\n*Lads of nocturnal radiance.*\n*Holding the illustrated registers,*\n*Seizing and restraining demonic traces.*\n*Void and Danger merge in transformation,*\n*Purple mist spurs the wind.*\n*Precious crystal refines and nurtures,*\n*Posterior heaven knows no end.\"*\n\nThis text, in communion with the Black Thearch’s great talisman, transforms in unison, its regulatory power identical in efficacy.\n\n**Jade Text of the Yellow Heavenly Demon King to Subdue Evil**\nSurname: Tianmen. Personal name: Bokuang.\n*\"Primordial Thearch, supreme numen,*\n*August One of the profound and subtle,*\n*Blended perfection of uncarved simplicity,*\n*Mysterious root of creation and transformation.*\n*Stirring the dark and subtle,*\n*It engenders the great spirit.*\n*Drawing forth the myriad qi,*\n*Assembling in the flowering chamber.*\n*Dissolving the hundred demons,*\n*Flourishing together with the Dao.*\n*Preserving passage, averting calamity,*\n*Extinguishing trials, eliminating misfortune.\"*\n\nThis text, in communion with the Yellow Thearch’s great talisman, transforms in unison, its regulatory power identical in efficacy.\n\n---\n\n**Talismans of the Five Thearchs**\n\n**Azure Thearch’s Talisman to Govern Demons and Summon Perfection**\nThe talisman’s officer, Hua, commands nine hundred thousand troops to guard its text. This talisman, together with the previously mentioned vermilion-script true text, is to be inscribed in cinnabar on purple silk on a *jia* or *yi* day of spring and placed in the eastern direction. It wards off the myriad calamities, eternally preserves and stabilizes, summons and extends auspicious omens, and ensures abundance and timely prosperity. Those who study the Dao should ingest it at the proper time; after three years, the essence of azure jade shall grow within the liver palace, its light radiating beyond the body. Upon completion of the Dao, the Azure Thearch shall summon and welcome them. Those who wear it with sincerity shall dissolve misfortunes and disasters—utmost reverence is required.\n\n**Vermilion Thearch’s Talisman to Govern Demons and Summon Perfection**\nThe talisman’s officer, Mingzhen, commands three hundred thousand troops to guard its text. This talisman, together with the previously mentioned vermilion-script true text, is to be inscribed in cinnabar on green silk on a *bing* or *ding* day of summer and placed in the southern direction. It wards off the myriad calamities, eternally preserves and stabilizes, summons and extends auspicious omens, and ensures abundance and timely prosperity.",
      "overlap_context": "rch’s Dao, nothing moves;*\n*All directions rely on its existence.*\n*Wrath and fury bring autumn’s frost,*\n*Harmony and joy herald spring’s warmth.*\n*Creation and completion grasp the primordial order,*\n*Looking up, we bear and wear its boundless grace.*\n\n**Talisman of the Yellow Thearch, Central Lord**\nSurname: Tongban. Personal name: Yuancheng. Style: Hanshuniu.\nInscribe in yellow on crimson silk and wear it; receive it on the day of *Tuwang*. If ingested, write on bamboo membrane, five pieces.",
      "start_char": 8719,
      "end_char": 10032,
      "start_sentence": 471,
      "end_sentence": 569,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 50.328954458236694,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\灵图类\\灵宝无量度人上品妙经符图（宋佚名）.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "学道之士以时服之，三年之后，生赤玉之英於心府之中，光映形外。 道成，赤帝召迎。 志心佩之，永消灾患矣。 白帝御魔总真符 右符吏茂成，领兵七十万人，守卫其文。 其符并前赤书真文，以秋庚辛之日，白书黄上，置於西方。 禳却万灾，保镇无穷，召延嘉祥，物阜时康。 学道之士以时服之，三年之后，生白玉之英於肺府之中，光映形外。 道成，白帝召迎。 志诚佩之，永消殃患矣。 黑帝御魔总真符 右符吏守元，领兵五十万人，守卫其文。 其符并前赤书真文以冬壬癸之日，黑书白上，置於北方。 禳却万灾，保镇无穷，召延嘉祥，物阜时康。 学道之士以时服之，三年之后，生玄玉之英於肾府之中，光映形外。 道成，黑帝召迎。 志诚佩之，永消殃患矣。 黄帝魔总真符 右符吏协冥，领兵一千万人，守卫其文。 其符并前赤书真文，於四季戊己之日，朱书黄素，置於中央。 禳却万灾，保镇无穷，召延嘉祥，物阜时康。 学道之士以时服之，三年之后，生黄玉之英於脾府之中，光映形外。 道成，黄帝召迎。 志心佩之，永消殃患矣。 飞行鼓从，总领鬼兵，麾幢鼓节，游观太空。 自号赫奕，诸天齐功。 上天度人，严摄北酆。 神公受命，普扫不祥。 八威吐毒，猛马四张。 天丁前驱，大帅仗磨。 掷火万里，流铃八冲。 敢有干试，拒遏上真。 金锚铖前戮，巨天后刑。 屠割鬼爽，风火无停。 千千截首，万万剪形。 魔无干犯，鬼无妖精。 三宫北酆，明检鬼营。 不得容隐，金马驿呈。 普告无穷，万神咸听。 三界五帝，列言上清。 灵宝无量度人上品妙经符图卷中竟 灵宝无量度人上品妙经符图卷下 元洞玉历章 真阳开化梵无流通。 金阙在上，玉府居东。 郁结五文，焕散九空。 妙炁自然蕴奥难穷。 三灵共贯万圣攸宗。 参稽学行，标纪真功。 以神俱契，与道合同。 安镇帝箓，亿劫无终。 昔混元溟涬，大梵弥罗，诸天未分，九阳冥合。 三因九转，六变七徊。 元始肇形，五劫初化，乃命梵元祖晨道君，笔录天元，运乘五劫。 故元洞者，以明祖炁； 玉历者，以纪天元。 劫运五周，复归其一，自一炁化分，三因成九，若龙若蜓，蟠曲九道； 漠漠无极，总九阳祖炁之元。 大上以三九运梵，三五乘元，合四十二炁，以开始青天。 元祖气明，东方始青之元应九阳木王之初，故东方得九炁以分天境，劫号龙汉。 次九因重复，阳炁开明，赤文流光，敷落五度，开图丹书。 太上以三乘五，三转朱英，合二十四炁，以开南丹天元祖炁。 明南方丹光之元，应三阳火王之初，故南方得三炁以分天境，劫号赤明。 次复九因重积，中黄化元，天纬周缠，梵元乘五，太上以五五三徊，混阳十二，合五十二炁，以开中黄天元祖炁，明中灵黄华之光，应五阳土王之初，故中央得一十二炁，以分天境，劫号上皇。 次九元复因素景肇阳，七明焕梵，五纬乘天。 太上以七五三乘，合三十六黑，以开素灵天元祖炁，明西华皓景之光，应七阳金王之初，故西方得七炁以分天境，劫号延康。 次复九因周竟，混化归本，一炁肇明。 太上以二五乘十三，积元阳合三十炁，以开北玄天元祖炁，明玄冥上景之光，应一阳水王之初，故北方得五炁以分天境，劫号开皇。 是以五劫既周，昊天成象；",
      "translated_text": "Those who cultivate the Dao shall wear it in due season. After three years, the essence of vermilion jade shall grow within the heart palace, its light radiating beyond the body. Upon completion of the Dao, the Vermilion Thearch shall summon and welcome them. Those who wear it with sincerity shall forever dissolve misfortunes and disasters.\n\n**White Thearch’s Talisman to Govern Demons and Summon Perfection**\nThe talisman’s officer, Maocheng, commands seven hundred thousand troops to guard its text. This talisman, together with the previously mentioned vermilion-script true text, is to be inscribed in white on yellow silk on a *geng* or *xin* day of autumn and placed in the western direction. It wards off the myriad calamities, eternally preserves and stabilizes, summons and extends auspicious omens, and ensures abundance and timely prosperity.\n\nThose who cultivate the Dao shall wear it in due season. After three years, the essence of white jade shall grow within the lung palace, its light radiating beyond the body. Upon completion of the Dao, the White Thearch shall summon and welcome them. Those who wear it with sincerity shall forever dissolve misfortunes and disasters.\n\n**Black Thearch’s Talisman to Govern Demons and Summon Perfection**\nThe talisman’s officer, Shouyuan, commands five hundred thousand troops to guard its text. This talisman, together with the previously mentioned vermilion-script true text, is to be inscribed in black on white silk on a *ren* or *gui* day of winter and placed in the northern direction. It wards off the myriad calamities, eternally preserves and stabilizes, summons and extends auspicious omens, and ensures abundance and timely prosperity.\n\nThose who cultivate the Dao shall wear it in due season. After three years, the essence of dark jade shall grow within the kidney palace, its light radiating beyond the body. Upon completion of the Dao, the Black Thearch shall summon and welcome them. Those who wear it with sincerity shall forever dissolve misfortunes and disasters.\n\n**Yellow Thearch’s Talisman to Govern Demons and Summon Perfection**\nThe talisman’s officer, Xieming, commands ten million troops to guard its text. This talisman, together with the previously mentioned vermilion-script true text, is to be inscribed in cinnabar on yellow silk on a *wu* or *ji* day of the four seasons and placed in the central direction. It wards off the myriad calamities, eternally preserves and stabilizes, summons and extends auspicious omens, and ensures abundance and timely prosperity.\n\nThose who cultivate the Dao shall wear it in due season. After three years, the essence of yellow jade shall grow within the spleen palace, its light radiating beyond the body. Upon completion of the Dao, the Yellow Thearch shall summon and welcome them. Those who wear it with sincerity shall forever dissolve misfortunes and disasters.\n\nThe Flying Drum follows, commanding the ghostly troops, brandishing banners and beating drums, roaming and observing the great void. Self-proclaimed resplendent, all heavens unite in merit. Ascending to deliver humanity, sternly subduing the Northern Feng. The Divine Lords receive their mandate, universally sweeping away inauspiciousness. The Eight Mighties spew poison, fierce horses spread in four directions. Heavenly soldiers lead the way, great marshals wield their weapons. Fire is cast for ten thousand miles, flowing bells resound in eight directions. Should any dare to challenge or obstruct the perfected ones, the golden axes shall strike first, the mighty天后 shall execute punishment. Demons and specters shall be slaughtered, wind and fire shall never cease. Thousands upon thousands shall be beheaded, myriads upon myriads shall be dismembered. No demon shall dare to offend, no ghost shall harbor malevolence. The Three Palaces of Northern Feng shall inspect the ghostly camps. None shall be concealed, all shall be reported by the Golden Horse Courier. Universally proclaimed without end, all spirits shall heed. The Three Realms and Five Thearchs shall report to the Supreme Clarity. Thus concludes the *Marvelous Scripture of the Upper Chapters on the Limitless Salvation of Humanity from the Numinous Treasure* and its talismanic illustrations.\n\n**Yuan Dun Jade Calendar Chapter**\nTrue Yang unfolds transformation, the Brahma of boundless circulation. The Golden Tower stands above, the Jade Palace resides in the east. Five patterns interweave, nine apertures radiate brilliance. The marvelous qi naturally harbors unfathomable mysteries. The Three Numinous Ones together penetrate the myriad sages’ ancestral origin. Examining and verifying cultivation, marking and recording true merit. With spirit fully attuned, one merges with the Dao in unity. Securely stabilizing the imperial registers, enduring for a hundred million kalpas without end.\n\nOf old, in the primordial chaos of Hunyuan, the great Brahma of Miro, before the heavens were divided, the Nine Yangs merged in darkness. Thrice derived, ninefold transformed, six changes and seven revolutions. The Primordial Beginning took form, the Five Kalpas first unfolded. Thereupon, the Lord of the Dao of the Dawn of the Brahma Yuan Ancestor was commanded to record the celestial origin, traversing the Five Kalpas. Thus, *Yuan Dun* clarifies the ancestral qi; the *Jade Calendar* records the celestial origin. Five kalpas complete a cycle, returning to the One. From the One qi’s transformation and division, thrice derived to form nine—like dragons, like serpents, coiling through nine paths. Vast and boundless, it encompasses the primordial qi of the Nine Yangs. The Supreme One, through the threefold ninefold Brahma operation and the threefold fivefold primordial reckoning, combined forty-two qi to inaugurate the Azure Heaven. The qi of the Yuan Ancestor brightened, the eastern beginning of the Azure Primordial responded to the initial flourishing of the Nine Yangs’ Wood Thearch. Thus, the East received nine qi to divide the celestial realm, the kalpa named Longhan.\n\nNext, the ninefold derivation repeated, the yang qi unfolded and brightened. Vermilion patterns flowed with light, spreading across the five measures, unfolding the charts and cinnabar writings. The Supreme One, through threefold fivefold reckoning and threefold revolutions of vermilion essence, combined twenty-four qi to inaugurate the Vermilion Heaven’s Yuan Ancestor qi. Illuminating the southern beginning of the Vermilion Primordial, it responded to the initial flourishing of the Three Yangs’ Fire Thearch. Thus, the South received three qi to divide the celestial realm, the kalpa named Chiming.\n\nNext, the ninefold derivation accumulated again, the Central Yellow transformed the primordial. Heavenly wefts coiled and encircled, the Brahma Yuan rode the fivefold. The Supreme One, through fivefold fivefold threefold revolutions, blended the twelve yangs, combining fifty-two qi to inaugurate the Central Yellow Heaven’s Yuan Ancestor qi. Illuminating the central numinous Yellow Flower’s radiance, it responded to the initial flourishing of the Five Yangs’ Earth Thearch. Thus, the Central Realm received twelve qi to divide the celestial realm, the kalpa named Shanghuang.\n\nNext, the ninefold primordial repeated, the pristine luminosity inaugurated the yang. Sevenfold brightness illumined the Brahma, fivefold wefts rode the heavens. The Supreme One, through sevenfold fivefold threefold reckoning, combined thirty-six blacks to inaugurate the Pristine Numinous Heaven’s Yuan Ancestor qi. Illuminating the western radiance of the White Flower, it responded to the initial flourishing of the Seven Yangs’ Metal Thearch. Thus, the West received seven qi to divide the celestial realm, the kalpa named Yankang.\n\nNext, the ninefold derivation completed its cycle, transformation merged and returned to the origin, the One qi inaugurated brightness. The Supreme One, through twofold fivefold reckoning and thirteenfold accumulation of primordial yang, combined thirty qi to inaugurate the Northern Mysterious Heaven’s Yuan Ancestor qi. Illuminating the supreme luminosity of the Dark Mystery, it responded to the initial flourishing of the One Yang’s Water Thearch. Thus, the North received five qi to divide the celestial realm, the kalpa named Kaihuang.\n\nThus, the Five Kalpas having completed their cycle, the vast heavens took form.",
      "overlap_context": "’s Talisman to Govern Demons and Summon Perfection**\nThe talisman’s officer, Mingzhen, commands three hundred thousand troops to guard its text. This talisman, together with the previously mentioned vermilion-script true text, is to be inscribed in cinnabar on green silk on a *bing* or *ding* day of summer and placed in the southern direction. It wards off the myriad calamities, eternally preserves and stabilizes, summons and extends auspicious omens, and ensures abundance and timely prosperity.",
      "start_char": 10032,
      "end_char": 11282,
      "start_sentence": 570,
      "end_sentence": 638,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.56852746009827,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\灵图类\\灵宝无量度人上品妙经符图（宋佚名）.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "一炁混道，八境流光； 三积九乘，八方开景。 八帝示形，九霄分化。 故元始天尊命天真皇人以玉历纪元，洞混化之初，劫运流复之本，诸天分境，结元洞正阳之炁为玉历，以纪天真、天民劫运，功积升退之道，明九圣九品之阶。 其诸玄秘，在玉府之中，别有《九道太微神妙九品仙箓经》，具载其详。 九霄梵无之图 五劫开化梵元混明玉历之图 龙汉始青玉历宝章开九阳天元梵华之炁 九阳回妙气，三景散元精。 碧霭浮灵篆，青林粲淑英。 超遥玉清府，辽邈蓬莱瀛。 真化通无间，神风滋万生。 赤明丹光玉历宝章开三阳天元梵灵之炁 浩劫开神运，龙文泛赤霞。 八威奔电激，九凤破凶邪。 炼度丹皇室，飞升元始家。 炎明常继照，灵庆袭晨华。 上皇中灵玉历宝章开五阳天元梵宝之炁 混黄生一炁，感化结真形。 上德持柔顺，金光洞杳冥。 建中该九极，执本统三辰。 炜烨天端上，飞芒耀玉灵。 延康素灵玉历宝章开七阳天元梵英之炁 黄老储灵粹，金精耀斗威。 六天咸馘灭，万宝复幽微。 爽炁浮高阙，寒光霭素辉。 空同披玉勒，华丽九霄飞。 开皇玄上玉历宝章开一阳天元梵混之炁 五炁符元妙，诸天混太冥。 辰精飞羽黑，玉女散华青。 紫册封天宝，玄光凛帝庭。 群魔钦至化，万国保安宁。 元洞玉历，龙汉延康，眇眇亿劫，混沌之中，上无复色，下无复渊。 风泽洞虚，金刚乘天。 天上天下，无幽无冥，无形无影，无极无穷，溟涬大梵，辽廓无光。 赤明开图，运度自然。 弥纶天纪之图 元始安镇敷落五篇赤书玉字八威龙文 第一篇 明炁发育，木精飞英，仁惠之炁，滋衍万生。 天界地纲，与时皆正。 凝耀神乡，结为青书，光映万里。 号太清九真安化上爱玉符。 第二篇 太丹之炁，衍光洞焕，飘掷化火，融炼九阴。 赤字凝章，其文甚异。 敷映九亿，精明炳天。 号交神生明玉化之符。 第三篇 黄真之炁，结精飞英。 中央虚落之炁，混沌黄元之精。 交流历律，化感生文。 光耀万里，精芒焜煜。 天端之间，号真皇混丹肃玄之符。 第四篇 素威禁炁，流化粹端。 飘权耀神，凝结成书。 光映万里，其文甚异。 列明凌芒，威摧万妖。 号八威禁龙制虎飞英太白．玉化之符。 第五篇 玄精发耀，万物滋形。 生端不竭，天历有纪。 玉皇上相，高观灵化。 接摘玄序，开明天教。 册封万帝，玄真感和。 天文敷炳，典约清律。 天化大成，凝结玉章。 光映九亿，号明纲玄兆大冥九化之符。 保制劫运，使天长存。 梵炁弥罗，万梵开张。 元纲流演，三十二天。 轮转无色，周回十方。 旋斗历箕，回度五常。 三十五分，总气上玄。 八景冥合，炁入玄玄。 玄中太皇，上帝高真。 泛景太霞，啸咏洞章。 金真朗郁，流响云营。 玉音摄炁，灵风聚烟。 紫虚郁秀，辅翼万仙。 千和万合，自然成真。 真中有神，长生大君。 无英公子、白元尊神、太一司命、桃康合延。 执符把箓，保命生根。 上游上清，出入华房。 八冥之内，细微之中。 下镇人身，泥丸绛宫； 中理五炁，混合百神。 十转回灵，万炁齐仙。 仙道贵生，无量度人。 上开八门，飞天法轮。 罪福禁戒，宿命因缘。 普受开度，死魂生身。 身得受生一，上闻诸天。 诸天之上，各有生门。 中有空洞谣歌之章、魔王灵篇，辞参高真。",
      "translated_text": "One qi merged with the Dao, eight realms streamed with light;\nThree accumulations, ninefold reckoning—eight directions unfurled their radiance.\nEight Thearchs manifested form, nine heavens divided their transformations.\nThus, the Primordial Celestial Venerable commanded the Heavenly Perfected Sovereign to inscribe the Jade Chronicle, recording the inception of the Cavernous Undifferentiated Transformation, the foundational cycles of kalpas and revolutions, the division of celestial realms, and the coalescence of the Cavernous Primordial Upright Yang qi into the Jade Chronicle. Therein were marked the kalpic revolutions of Heavenly Perfected Ones and Heavenly People, the path of merit’s ascent and retreat, and the nine grades of the Nine Sages.\n\nThese profound mysteries reside within the Jade Treasury, with further details expounded in *The Wondrous Ninefold Registers of the Nine Daoist Mysteries of the Grand Tenuity*.\n\n**Chart of the Nine Heavens’ Brahmanic Emptiness**\n**Chart of the Five Kalpas’ Inaugural Transformations and Brahmanic Primordial Undifferentiated Luminous Jade Chronicle**\n\n**Dragon Han’s Beginning Azure Jade Chronicle’s Precious Stanzas, Inaugurating the Nine Yangs’ Heavenly Primordial Brahmanic Florescence qi**\nNine Yangs’ wondrous qi revolves, three luminances scatter primordial essence.\nVerdant mists float the numinous script, azure forests gleam with refined blossoms.\nTranscendent, distant—Jade Clarity’s precincts; remote, boundless—Penglai’s isles.\nTrue transformations traverse the unbroken, divine winds nourish the myriad beings.\n\n**Vermilion Luminance’s Cinnabar Light Jade Chronicle’s Precious Stanzas, Inaugurating the Three Yangs’ Heavenly Primordial Brahmanic Numinous qi**\nVast kalpas unfold divine workings, dragon scripts ripple with crimson clouds.\nEight Might surge like lightning, nine phoenixes shatter malevolence.\nRefined and delivered to the Cinnabar Thearch’s chamber, ascending to the Primordial Celestial’s abode.\nFlaming luminance perpetually illumines, numinous blessings inherit the dawn’s splendor.\n\n**Supreme Thearch’s Central Numinous Jade Chronicle’s Precious Stanzas, Inaugurating the Five Yangs’ Heavenly Primordial Brahmanic Treasure qi**\nUndifferentiated Yellow gave birth to the One qi, responsive transformations congealed true form.\nSupreme virtue upheld gentleness and compliance, golden light pierced the profound obscurity.\nEstablishing the center, it encompassed the Nine Ultimates; grasping the root, it governed the Three Luminaries.\nResplendent atop the celestial apex, flying radiance dazzled the Jade Numinous.\n\n**Yankang’s Primordial Numinous Jade Chronicle’s Precious Stanzas, Inaugurating the Seven Yangs’ Heavenly Primordial Brahmanic Florescence qi**\nYellow and Lao stored numinous essence, metal’s essence gleamed with Dipper’s majesty.\nSix Heavens were all vanquished, the myriad treasures returned to subtle obscurity.\nBracing qi floated above lofty palaces, frigid light suffused pristine radiance.\nEmpty Unity unfurled jade reins, resplendent—nine heavens soared.\n\n**Kaihuang’s Mysterious Supreme Jade Chronicle’s Precious Stanzas, Inaugurating the One Yang’s Heavenly Primordial Brahmanic Undifferentiated qi**\nFive qi aligned with primordial subtlety, all heavens merged with Grand Obscurity.\nCelestial essence flew with feathered darkness, jade maidens scattered azure blossoms.\nPurple registers sealed the celestial treasures, mysterious light chilled the Thearch’s court.\nAll demons revered the supreme transformation, the myriad lands preserved peace and tranquility.\n\nThe Primordial Cavernous Jade Chronicle—Dragon Han, Yankang—spanning boundless kalpas within the primordial chaos, above without layered hues, below without fathomless abyss.\nWind and marsh pervaded the void, vajra rode the heavens.\nAbove the heavens and below the heavens, no obscurity nor darkness, no form nor shadow, no limit nor end—vast Brahmanic expanse, boundless and lightless.\n\nVermilion Luminance unfolded its chart, the revolutions of destiny moved naturally.\n\n**Chart of the Heavenly Discipline’s All-Encompassing**\n**The Primordial Celestial’s Pacifying and Spreading Fivefold Vermilion Writ of Jade Script and Eight Might Dragon Script**\n\n**First Scroll**\nLuminous qi engendered and nurtured, wood’s essence took flight as blossoms—benevolent and gracious qi proliferated the myriad beings.\nHeaven’s boundaries and earth’s networks aligned with the seasons, all in rectitude.\nCongealing radiance in the divine realm, coalescing into Azure Writ, its light illumined ten thousand leagues.\nTitled *Supreme Clarity’s Nine Perfected Pacifying and Transforming Upper Love Jade Talisman*.\n\n**Second Scroll**\nGrand Cinnabar’s qi suffused light, resplendent and dazzling—whirling and transforming into fire, refining the Nine Yins.\nCrimson script congealed into stanzas, its patterns most extraordinary.\nSpreading to illumine nine hundred million, its essence shone brilliantly in the heavens.\nTitled *Intertwining Spirits’ Luminous Jade Transformation Talisman*.\n\n**Third Scroll**\nYellow Perfected’s qi congealed essence into flying blossoms.\nCentral Void’s qi, the undifferentiated Yellow Primordial’s essence.\nInterflowing through calendric rhythms, responsive transformations engendered script.\nLight dazzled ten thousand leagues, essence’s radiance blazed.\nAmidst the celestial apex, titled *True Thearch’s Undifferentiated Cinnabar and Solemn Mystery Talisman*.\n\n**Fourth Scroll**\nPrimal Might’s restraining qi streamed with refined purity.\nWafting authority illumined the divine, congealing into script.\nLight illumined ten thousand leagues, its patterns most extraordinary.\nArrayed brilliance vanquished the myriad demons.\nTitled *Eight Might’s Restraining Dragon, Taming Tiger, Flying Blossoms, and Grand White Jade Transformation Talisman*.\n\n**Fifth Scroll**\nMysterious essence radiated, the myriad things took form.\nGenerative origins inexhaustible, the celestial chronicle had its reckoning.\nJade Thearch’s Supreme Minister, loftily observed numinous transformations.\nGrasping and unfolding the mysterious sequence, inaugurating the celestial teachings.\nRegistering and sealing the myriad Thearchs, mysterious perfection harmonized.\nCelestial script spread its brilliance, canonically binding the pure rhythms.\nHeavenly transformations consummated, congealing into jade stanzas.\nLight illumined nine hundred million, titled *Luminous Discipline’s Mysterious Portents of the Grand Obscurity’s Nine Transformations Talisman*.\nPreserving and restraining kalpic revolutions, ensuring the heavens endure forever.\n\nBrahmanic qi pervaded the cosmos, the myriad Brahmans unfolded.\nPrimordial discipline flowed and evolved, the thirty-two heavens.\nRevolving without form, cycling through the ten directions.\nRotating the Dipper, traversing the Winnowing Basket, revolving through the Five Constants.\nThirty-five divisions, aggregating qi in the Supreme Mystery.\nEight luminances obscurely merged, qi entered the Profound Mystery.\nWithin the Mystery, the Grand Supreme Thearch, the Lofty Perfected.\nFloating upon the Grand Rosy Clouds, chanting and intoning the Cavernous Stanzas.\nGolden Perfected’s fragrance wafted, flowing echoes through cloudy encampments.\nJade tones gathered qi, numinous winds amassed mists.\nPurple Void’s luxuriance, assisting and aiding the myriad immortals.\nA thousand harmonies, ten thousand unions—naturally attaining perfection.\nWithin the Perfected dwelled the divine, the Great Lord of Longevity:\nLord Wu Ying, Venerable Bai Yuan, Grand Monad Controller of Destiny, Peach Prosperity and Longevity.\nGrasping talismans, holding registers, preserving life and rooting destiny.\nRoaming the Supreme Clarity, entering and exiting the Flowery Chambers.\nWithin the Eight Obscurities, amidst the subtle and minute.\nBelow, they governed the human body—Mud Pill Palace and Crimson Palace;\nCentering, they ordered the Five qi, harmonizing the hundred spirits.\nTen revolutions returned the numinous, the myriad qi ascended as immortals.\nThe immortal path prized life, boundlessly delivering beings.\nAbove, the Eight Gates were opened, the Flying Celestial Dharma Wheel.\nSins and blessings, prohibitions and precepts, karmic destinies and causes.\nUniversally receiving deliverance, the dead souls embodied life.\nOnce the body received life, it ascended to hear the myriad heavens.\nAbove the myriad heavens, each had its Gate of Life.\nWithin dwelled the *Empty Cavern’s Hymns and Songs*, the *Mara King’s Numinous Scroll*—their verses matched the Lofty Perfected.",
      "overlap_context": "d brightness. The Supreme One, through twofold fivefold reckoning and thirteenfold accumulation of primordial yang, combined thirty qi to inaugurate the Northern Mysterious Heaven’s Yuan Ancestor qi. Illuminating the supreme luminosity of the Dark Mystery, it responded to the initial flourishing of the One Yang’s Water Thearch. Thus, the North received five qi to divide the celestial realm, the kalpa named Kaihuang.\n\nThus, the Five Kalpas having completed their cycle, the vast heavens took form.",
      "start_char": 11282,
      "end_char": 12565,
      "start_sentence": 639,
      "end_sentence": 735,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 48.623021602630615,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\灵图类\\灵宝无量度人上品妙经符图（宋佚名）.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "第一欲界飞空之音：魔王讳郁默。 人道眇眇，仙道莽莽。 鬼道乐兮，当人生门。 天道贵生，鬼道贵终。 仙道常自吉，鬼道常自凶。 高上清灵爽，悲歌朗太空。 唯愿仙道成，不欲人道穷。 北都泉曲府，中有万鬼群。 但欲遏人算，断绝人命门。 阿人歌洞章，以摄北罗酆。 未送妖魔精，斩馘六鬼锋。 诸天炁荡荡，我道日兴隆。 第二色界魔王之章：魔王讳摩罗。 落落高张，明炁四骞，梵行诸天，周回十方。 无量大神，皆由我身。 我有洞章，万遍成仙。 仙道贵度，鬼道相连。 天地眇莽，秽气氛氛。 三界乐兮，过之长存。 身度我界，体入自然。 此时乐兮，薄由我恩。 龙汉荡荡，何能别真。 我界难度，故作洞文。 变化飞空，以试尔身。 成败懈退，度者几人。 笑尔不度，故为歌音。 第三无色界魔王歌曰：魔王讳韶。 三界之上，眇眇大罗，上无色根，云层峨峨。 唯有元始，浩劫之家。 部制我界，统承玄都。 有过我界，身入玉虚。 我位上王，匡御众魔。 空中万变，秽气纷葩。 保真者少，迷惑者多。 仙道难固，鬼道易邪。 人道者心，谅不由他。 仙道贵实，人道贵华。 尔不乐仙道，三界那得过。 其欲转五道，我当复奈何。 此三界之上、飞空之中，魔王歌音，音参洞章。 诵之百遍，名度南宫； 诵之千遍，魔王保迎； 万遍道备，飞升太空。 过度三界，位登仙翁。 有闻灵音，魔王敬形。 动制地祇， 勅制地祇符 侍卫送迎拔出地户，五苦八难七祖升迁，永离鬼官。 魂度朱陵，受炼更生，是谓无量，普度无穷。 有秘上天文，诸天共所崇。 泄慢堕地狱，祸及七祖翁。 诵洞章 龟山丹黄飞玄紫文，此是洞章正文，即色界魔王称我有洞章者也。 飞玄紫炁凝灵根，纲维玉灵总万神。 空中郁勃结自然，上有陵层十二传。 玉楼峨峨曜景云，流精紫阙带金轩。 琼台玮铄绕八骞，中有青金九灵仙。 丹黄真母号精延，飞青羽禲晨婴冠。 左执玉节握灵幡，五色命魔对帝尊。 把持符籍当生门，咀日嚼月噏玉泉。 离罗吐晖炼五魂，内充外溢绛符欣。 金光焕焕形正圆，从朔入金色沌沌。 唯有开明晓此言，日五月十精北元。 刻见华盖领仙君，紫炁左回与斗连。 历度四七入金门，正是丹皇校万仙。 有明此诀加精勤，披形密思每令分。 妙景感会得要文，三年当审保长存。 九年乘空致羽裙，凤衣轻翔升龙山。 俯仰九灵谒玉晨，混合自然朝上清。 修其道，常以正、二、三、四、六、七、八、九、十一、十二月，一年计十月。 每月中三日、五日、九日、十五日、二十五日。 一月五过，清斋诵咏玄文一徧。 以半夜之后，露出中庭，仰思北斗华盖之中，有紫云之炁，从斗呈左回，历度二十八宿竟，还金门之上。 若在人中，天阴无光，当於室内存思如法，每令分明。 思毕，当心拜紫云四过，叩齿三通，仰祝曰： 天夜朗清，幽虚启真。 流云徘徊，金华赐褰。 丹皇敷晖，灵飞紫軿。 是夕开陈，青金受仙。 成我上愿，体应自然。 结命月华，保年日根。 三灵合景，永停龙山。 密夜清披，请如所言。 毕，便叩齿，口引紫炁二十八咽止。 行此三年，刻有神降兆寝席也。 身有紫炁，映络一形，九天书名，必获上仙也。 天有紫炁之云，干於日月，五星之分，在其方国，皆有合道之人。",
      "translated_text": "The First Aerial Melody of the Desire Realm: The Demon King’s name is Yumo.\nThe human path is distant and faint, the immortal path vast and boundless.\nThe ghostly path delights—yet it is the Gate of Human Life.\nThe heavenly path treasures life, the ghostly path treasures death.\nThe immortal path is ever auspicious, the ghostly path ever inauspicious.\nThe lofty, pure, and numinous soar, their mournful songs resounding through the great void.\nI only wish the immortal path to flourish, not the human path to wither.\nIn the Northern Capital’s Yellow Springs and Crooked Mansion, a myriad ghosts gather,\nAll seeking to cut short human destiny, to sever the Gate of Human Life.\nAh! Sing the Cavern’s Hymns to subdue the Northern Feng of Luo.\nBefore dispatching the demonic spirits, sever the blades of the Six Ghosts.\nThe qi of the myriad heavens surges boundlessly—my Dao daily ascends in glory.\n\nThe Second Melody of the Form Realm’s Demon King: The Demon King’s name is Moluo.\nLofty and expansive, luminous qi spreads in all four directions,\nThe Brahma-conduct of the heavens encircles the ten directions.\nThe boundless great spirits all arise from my body.\nI possess the Cavern’s Hymns—recite them ten thousand times to attain immortality.\nThe immortal path values deliverance, the ghostly path clings to it.\nHeaven and earth stretch vast and dim, foul qi swirls thickly.\nThe Three Realms delight—pass beyond them to abide forever.\nCross my realm, and your body enters spontaneity.\nAt this moment of joy, how slight is my grace!\nThe Dragon Han eon surges boundlessly—how can one distinguish the true?\nMy realm is hard to cross, so I compose the Cavern’s Scriptures.\nTransforming and soaring through the void, I test your body.\nSuccess or failure, slackening or retreat—how few are those who cross!\nLaughing at those who fail to cross, I sing this melody.\n\nThe Third Melody of the Formless Realm’s Demon King: The Demon King’s name is Shao.\nAbove the Three Realms, the vast and distant Great Luo,\nBeyond the roots of form, clouds layer in towering peaks.\nOnly the Primordial Beginning dwells in the House of Vast Kalpas.\nMy realm is ordered and governed, inheriting the Mysterious Capital.\nThose who transgress my realm enter the Jade Void.\nI, the supreme king, rectify and command the host of demons.\nTen thousand transformations in the void, foul qi blooms in profusion.\nFew preserve the true—many are deluded.\nThe immortal path is hard to secure, the ghostly path easy to stray.\nThe human path lies in the heart—truly, it does not depend on others.\nThe immortal path values substance, the human path values splendor.\nIf you do not delight in the immortal path, how can you pass the Three Realms?\nShould you wish to turn the Five Paths, what can I do for you?\n\nAbove these Three Realms, amidst the soaring void,\nThe demon kings’ melodies harmonize with the Cavern’s Hymns.\nRecite them a hundred times, and your name ascends to the Southern Palace;\nA thousand times, and the demon kings safeguard and welcome you;\nTen thousand times, the Dao is perfected, and you soar into the great void.\nCrossing the Three Realms, you ascend to the rank of Immortal Elder.\nThose who hear the numinous melodies—the demon kings show reverence in form.\nThey command the earth spirits,\nIssuing talismans to command the earth spirits,\nEscorting and welcoming, delivering from the earthly prisons,\nRescuing from the Five Sufferings and Eight Hardships, raising the seven generations of ancestors,\nForever departing the ghostly bureaus.\nThe soul crosses the Vermilion Mound, undergoes refinement, and is reborn—\nThis is called boundless deliverance, universal salvation without end.\n\nThere are secret celestial texts, revered by all heavens.\nThose who leak or slight them fall into hell, their misfortune extending to the seven generations of ancestors.\n\nRecite the Cavern’s Hymns—\nThe Vermilion and Yellow of Tortoise Mountain, the Flying Mystery of the Purple Script—\nThis is the true text of the Cavern’s Hymns, the very one the Form Realm’s Demon King called \"my Cavern’s Hymns.\"\nThe Flying Mystery’s purple qi congeals the numinous root,\nThe net of Jade Numinosity binds the myriad spirits.\nIn the void, it seethes and coalesces naturally,\nAbove, twelve layered mounds transmit it.\nJade towers towering, radiant with luminous clouds,\nFlowing essence in the purple watchtowers, girded with golden chariots.\nResplendent jasper terraces encircled by eight soaring qi,\nWithin dwell the Nine Numinous Immortals of Azure Gold.\nThe Vermilion and Yellow True Mother is called Jingyan,\nWearing a flying azure feathered robe and a morning infant’s crown.\nIn her left hand, she holds a jade scepter and grasps the numinous banner,\nThe Five-Colored Life Demon faces the Imperial Honored One.\nHolding the talismanic registers before the Gate of Life,\nShe chews the sun and moon, sips the Jade Spring.\nRadiance from Li and Luo refines the five souls,\nInternally full, externally overflowing, the Crimson Talisman rejoices.\nGolden light shines brilliantly, the form perfectly round,\nFrom the new moon it enters the golden hue, turbid and indistinct.\nOnly the Enlightened One understands these words,\nThe fifth day of the fifth month, the essence of the Northern Origin.\nCarved and seen, the Flowery Canopy leads the Immortal Lords,\nPurple qi swirls leftward, linking with the Dipper.\nPassing through the twenty-eight lunar lodges to enter the Golden Gate—\nThis is where the Vermilion Emperor reviews the myriad immortals.\nThose who clearly understand this secret and apply diligent effort,\nUnfolding their forms and contemplating deeply, always discerning,\nWill perceive the wondrous scenes and attain the essential text.\nIn three years, they will surely secure long life.\nIn nine years, they will ride the void, donning feathered skirts,\nLightly soaring in phoenix robes to ascend Dragon Mountain.\nLooking up and down, they pay homage to the Nine Numinous Ones and the Jade Dawn,\nMerging with spontaneity to pay court to the Highest Clarity.\n\nCultivate this Dao in the first, second, third, fourth, sixth, seventh, eighth, ninth, eleventh, and twelfth months—\nTen months in a year.\nOn the third, fifth, ninth, fifteenth, and twenty-fifth days of each month—\nFive times a month—\nPurify and fast, reciting the Mystery Text once.\nAfter midnight, step into the central courtyard, gaze upward, and contemplate the Flowery Canopy within the Northern Dipper,\nWhere purple cloud qi emerges from the Dipper, swirling leftward,\nPassing through the twenty-eight lunar lodges to return above the Golden Gate.\nIf among humans the sky is overcast and lightless,\nContemplate within the chamber as prescribed, ensuring clarity.\nAfter contemplation, bow four times to the purple cloud at heart,\nKnock the teeth three times, and intone while gazing upward:\n*\"The night sky is bright and clear, the hidden and void reveal the true.\nFlowing clouds linger, golden blossoms bestow their grace.\nThe Vermilion Emperor spreads his radiance, numinous flight in the purple chariot.\nThis evening unfolds, Azure Gold receives the immortals.\nFulfill my lofty wish, may my body accord with spontaneity.\nBind the life to the moon’s essence, safeguard the years and days’ root.\nThe Three Numinous Ones merge with the scene, forever abiding on Dragon Mountain.\nIn the secret night, pure and unveiled, I request as spoken.\"*\nFinish, then knock the teeth, drawing in purple qi twenty-eight times before stopping.\n\nPractice this for three years, and there will be signs of divine descent upon your sleeping mat.\nYour body will be enveloped in purple qi, a single form interwoven with light,\nYour name inscribed in the Nine Heavens—you will surely attain the rank of Highest Immortal.\nWhen purple cloud qi appears in the heavens,\nDrying the sun and moon, dividing the five stars,\nIn the lands of their directions, there will be those who unite with the Dao.",
      "overlap_context": " life, boundlessly delivering beings.\nAbove, the Eight Gates were opened, the Flying Celestial Dharma Wheel.\nSins and blessings, prohibitions and precepts, karmic destinies and causes.\nUniversally receiving deliverance, the dead souls embodied life.\nOnce the body received life, it ascended to hear the myriad heavens.\nAbove the myriad heavens, each had its Gate of Life.\nWithin dwelled the *Empty Cavern’s Hymns and Songs*, the *Mara King’s Numinous Scroll*—their verses matched the Lofty Perfected.",
      "start_char": 12566,
      "end_char": 13805,
      "start_sentence": 736,
      "end_sentence": 822,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.33694505691528,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\灵图类\\灵宝无量度人上品妙经符图（宋佚名）.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "得仙之君也。 如此之侯，其象自见。 得见紫云，便依文礼祝，不必须其常日也。 勤加在意，刻得云降，升腾有会也。 止可对之於心，不可轻以示人。 道泄则灵散，仙炁无由成也。 如文始先生尹君，侍金阙，圣君为标准矣。 兆宜慎之，勉而行之。 道言：此二章并是诸天上帝及至灵魔王隐秘之音，皆是大梵之言，非世上常辞。 言无韵丽，曲无华宛。 故为玄奥，难可寻详。 上天所宝，秘於玄都紫微上宫。 依玄科，四万劫一传。 若有至人齐金赍质心，依旧格，告盟十天，然后而付焉。 道言：夫天地运度，亦有否终。 日月五星，亦有亏盈。 至圣神人，亦有休否。 末学之夫，亦有疾伤。",
      "translated_text": "The lord who attains immortality—\nsuch is the mark of this noble one, whose sign appears of itself.\nWhen you see the purple cloud, then follow the text and perform the rites of invocation,\nwithout needing to wait for the appointed day.\nApply yourself with diligence, and when the cloud descends at the appointed time,\nthere will be an ascension and a meeting.\n\nThis must be held within the heart alone;\ndo not lightly reveal it to others.\nIf the Dao is leaked, its numen scatters,\nand the immortal qi will have no means to take form.\nAs with Master Wen Shi, Lord Yin,\nwho attended the Golden Gates—\nthe Sage Lord set him as the standard.\n\nTake heed of these signs and strive to practice them.\nThe Dao says: These two chapters are the hidden voices of the Heavenly Thearchs of all heavens\nand the most numinous demon kings,\nall words of the Great Brahmā,\nnot the common speech of the world.\nTheir words lack ornate rhythm,\ntheir melodies lack florid grace.\nThus are they profound and obscure,\ndifficult to fathom in detail.\nThey are treasured by the heavens above,\nconcealed in the Purple Tenuity’s Upper Palace of Mystic Capital.\nAccording to the Mystic Statutes, they are transmitted but once in forty thousand kalpas.\nIf there be a perfected one whose heart is as steadfast as metal,\nwho follows the ancient protocols and pledges oaths to the Ten Heavens,\nonly then shall they be entrusted.\n\nThe Dao says: The revolutions of heaven and earth, too, have their ends in adversity.\nThe sun, moon, and five stars, too, have their waxings and wanings.\nEven the most sagely and divine beings have their times of flourishing and decline.\nAnd those of shallow learning, too, have their afflictions and harms.",
      "overlap_context": " drawing in purple qi twenty-eight times before stopping.\n\nPractice this for three years, and there will be signs of divine descent upon your sleeping mat.\nYour body will be enveloped in purple qi, a single form interwoven with light,\nYour name inscribed in the Nine Heavens—you will surely attain the rank of Highest Immortal.\nWhen purple cloud qi appears in the heavens,\nDrying the sun and moon, dividing the five stars,\nIn the lands of their directions, there will be those who unite with the Dao.",
      "start_char": 13805,
      "end_char": 14066,
      "start_sentence": 823,
      "end_sentence": 840,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.77225136756897,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\灵图类\\灵宝无量度人上品妙经符图（宋佚名）.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "凡有此灾，同气皆当齐心修斋，六时行香，十遍转经，福德立降，消诸不祥。 无量之文，普度无穷。 道言：夫末学道浅，或仙品未充，运应灭度，身经太阴。 临过之时，同学至人为其行香诵经十过，以度尸形如法。 魂神径上南宫，随其学功，计日而得更生。 转输不灭，便得神仙。 道言：夫天地运终，亦当修斋行香诵经； 星宿错度，日月失昏，亦当修斋行香诵经； 四时失度，阴阳不调，亦当修斋行香诵经； 国主有灾，兵革四兴，亦当修斋行香诵经； 疫毒流行，兆民死伤，亦当修斋行香诵经； 师友命过，亦当修斋行香诵经。 夫斋戒诵经，功德甚重，上消天灾，保镇帝王； 下禳毒害，以度兆民。 生死受赖，其福难胜，故曰无量普度天人。 道言：凡有是经，能为天地帝主兆民行是功德，有灾之日，发心修斋烧香诵经十过，皆诸天记名，万神侍卫，右别至人，克得为圣君金阙之臣。 诸天记人功过，毫分无失。 天中魔王亦保举尔身，得道者乃当洞明至言也。 诸天中大梵隐语无量音 元始灵书中篇　道君撰 东方八天",
      "translated_text": "Whenever such calamities arise, those of shared qi must unite in heart to perform purification rites, burn incense in the six periods of the day, and recite the scriptures ten times over—whereupon virtue and power descend at once, dispelling all inauspicious omens. These boundless texts universally deliver limitless beings.\n\nThe Dao says: Those of shallow learning in the Way, or whose immortal rank remains unfulfilled, when their destined time of passing arrives, shall traverse the Great Yin. At the hour of their departure, fellow perfected ones of shared learning shall burn incense and recite the scriptures ten times, thereby delivering the bodily form according to the proper method. The hun-soul shall ascend directly to the Southern Palace, where, in accordance with the merit of their practice, they shall be reborn after a reckoning of days. Having thus transmigrated without annihilation, they shall attain the immortals’ ranks.\n\nThe Dao says: When the revolutions of heaven and earth reach their end, one must perform purification rites, burn incense, and recite the scriptures. When the stellar lodges fall into disarray and the sun and moon lose their proper course, one must perform purification rites, burn incense, and recite the scriptures. When the four seasons lose their order and yin and yang fall out of harmony, one must perform purification rites, burn incense, and recite the scriptures. When the sovereign faces calamity and warfare erupts on all sides, one must perform purification rites, burn incense, and recite the scriptures. When pestilence spreads and the multitudes perish, one must perform purification rites, burn incense, and recite the scriptures. When a teacher or companion passes from this life, one must perform purification rites, burn incense, and recite the scriptures.\n\nFor the merit of purification rites and scripture recitation is most weighty: above, it dissolves heavenly calamities and safeguards the emperor; below, it wards off poison and harm, delivering the multitudes. In life and death, all depend upon it—its blessings are beyond measure, and thus it is called the boundless universal deliverance of heaven and humanity.\n\nThe Dao says: Whoever possesses these scriptures and performs such meritorious deeds for heaven, earth, the sovereign, and the multitudes—on the day of calamity, if they resolve in heart to perform purification rites, burn incense, and recite the scriptures ten times—shall have their names recorded by all the heavens, with ten thousand spirits attending in guard. Those distinguished as perfected ones shall thereby become ministers of the Golden Gates of the Sagely Lord. The heavens record the merits and transgressions of humanity without the slightest error. The demon kings of heaven shall also safeguard your person, and those who attain the Way shall come to comprehend these most profound teachings.\n\nThe boundless hidden speech of the Great Brahma in the heavens,\nThe Central Chapter of the Numinous Writ of the Primordial Beginning,\nComposed by the Dao Lord of the Eastern Eight Heavens.",
      "overlap_context": "y thousand kalpas.\nIf there be a perfected one whose heart is as steadfast as metal,\nwho follows the ancient protocols and pledges oaths to the Ten Heavens,\nonly then shall they be entrusted.\n\nThe Dao says: The revolutions of heaven and earth, too, have their ends in adversity.\nThe sun, moon, and five stars, too, have their waxings and wanings.\nEven the most sagely and divine beings have their times of flourishing and decline.\nAnd those of shallow learning, too, have their afflictions and harms.",
      "start_char": 14066,
      "end_char": 14486,
      "start_sentence": 841,
      "end_sentence": 861,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.003987789154053,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\灵图类\\灵宝无量度人上品妙经符图（宋佚名）.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "亶娄阿苍，无和观音。 须延明首，法揽菩昙。 稼那阿奕，忽诃流吟。 华都曲丽，鲜菩育臻。 答落大梵，散烟庆云。 飞洒玉都，明魔上门。 无行上首，回跖流玄。 阿陀龙罗，四象吁员。 东方灵篆 叩齿九通，思九色之龙，导引从前后，青云九重，覆匝身形。 诵念密咒曰： 赤明开图，八炁回真。 总统元关，青帝大神。 流化九外，缠络我身。 灵音八书，六十四篇。 洞明天地，与我合仙。 运政龙驾，上升帝辕。 咒毕，引炁九咽止。 行之九年，八天各以青腰玉女、青华玉童各八人侍卫身形，致青灵九炁之精，主身光明，彻见虚无。 万遍道成，即得飞行，七祖同福，皆升南宫也。 南方八天南阎洞浮，玉眸诜诜。 梵形落空，九灵推前。 泽洛菩台，绿罗大千。 眇莽九丑，韶谣缘邅。 云上九都，飞生自骞。 那育郁馥，魔罗法输。 霐持无镜，揽姿运容。 馥朗廓奕，神缨自宫。 南方灵篆 叩齿三通，思朱雀、凤凰翻翔其前后，绛云三重覆匝身形。 诵密咒曰： 三炁徘徊，灵凤来飞。 玉音八字，烂焕紫微。 吉日大庆，我道洞开。 朱丹哺饴，仰吸灵晖。 身生水火，绛被羽衣。 登空飞步，足践凤梯。 周旋八天，七祖相通。 咒毕，引炁三咽止。 行之三年，八天各以太丹玉女、太阳玉童各八人，侍卫身形，降致朱丹三熙之精，反白留容。 万劫不倾，七祖超升，上入福堂。 反胎仙家，即得更生矣。 西方八天 刀利禅猷，婆泥咎通。 宛薮涤色，太渺之堂。 流罗梵萌，景蔚萧嵎。 易邈无寂，宛首少都。 阿褴郁竺，华漠延由。 九开自辩，阿那品首。 无量扶盖，浮罗合神。 玉诞长桑，栢空度仙。 西方灵篆 叩齿七通，思白虎、狮子导引左右，素云七重覆匝身形。 次诵念密咒曰： 七炁金灵，八天尊神。 白虎策辇，狮子捧辕。 七炁缠绵，炼我成仙。 身登金光，映照素云。 内外变化，升入洞门。 七祖出夜，九幽旋魂。 亿劫开度，随运长存。 咒毕，引炁七咽止。 行之七年，八天各以素灵玉童八人侍卫身形，降致太素七炁之熏，停年留世，万劫童颜。 及七祖升度南宫，反胎更生，世世仙家。 北方八天 玃无自育，九日导乾。 坤母东覆，形摄上玄。 陀罗育邈，眇气合云。 飞天大丑，总监上天。 沙陀劫量，龙汉瑛鲜。 碧落浮黎，空歌保珍。 恶奕元品，洞妙自真。 元梵恢漠，幽寂度人。 北方灵篆 叩齿五通，思飞龟羽盖蓊郁左右，黑云五重覆匝身形。 神童玉女羽衣飞裳，侍卫身形。 密咒曰： 天徘元徊，流景上清。",
      "translated_text": "The Primal Venerable Azure, the Harmonious Contemplator of Sound.\nThe Radiant Head of Xuanyan, the Dharma-Grasping Bodhi-Tam.\nJiana Ayu, the Sudden Chant of Huhaluo.\nThe Curved Splendor of Huadu, the Fresh Bodhi-Blossom Attained.\nThe Falling Great Brahma, scattering mist and felicitous clouds.\nFlying and sprinkling upon the Jade Capital, the Luminous Demons ascend the gate.\nThe Peerless Foremost of Non-Action, the Revolving Tread of Flowing Mystery.\nAdhara and Nāga-Rāja, the Four Symbols sigh in harmony.\n\n**Eastern Numinous Script**\nKnock the teeth nine times, visualize the nine-colored dragons guiding before and behind, with nine layers of azure clouds enveloping the body.\nRecite the esoteric incantation:\n*\"Vermilion Radiance unfolds the chart, the eight qi return to the True.\nGoverning the Primordial Pass, the Azure Emperor, Great Spirit.\nFlowing transformation beyond the nine realms, entwining my body.\nThe numinous sounds of the Eight Scripts, sixty-four chapters.\nPenetrating heaven and earth, uniting with me in transcendence.\nDriving the dragon-chariot, ascending to the imperial axle.\"*\nUpon completion, draw in qi and swallow nine times.\nPracticing for nine years, the eight heavens each dispatch eight azure-waisted jade maidens and eight azure-flower jade lads to attend the body, bestowing the essence of the nine azure numina. The body’s radiance shines through the formless void. After ten thousand recitations, the Dao is accomplished, and one gains the power of flight. Seven generations of ancestors share the blessing, all ascending to the Southern Palace.\n\n**Southern Eight Heavens**\nThe Southern Yan-Dong-Floating Realm, where jade pupils gleam.\nBrahma-forms descend from the void, the Nine Numinous Ones advance.\nThe Lotus Terrace of Ze-Luo, the vast green net of the great kalpa.\nThe distant and boundless Nine Uglies, the melodious chants winding on.\nThe Nine Capitals above the clouds, where flying life soars of itself.\nNayū’s lush fragrance, the demonic Mara’s dharma subdued.\nHolding the mirrorless brightness, grasping posture and moving countenance.\nFragrant and resplendent, the divine tassels adorn the self-palace.\n\n**Southern Numinous Script**\nKnock the teeth three times, visualize the Vermilion Bird and phoenix soaring before and behind, with three layers of crimson clouds enveloping the body.\nRecite the esoteric incantation:\n*\"The three qi linger and circle, the numinous phoenix comes flying.\nThe jade sounds of eight characters, blazing in the Purple Tenuity.\nAuspicious day, great celebration—my Dao opens wide.\nCrimson cinnabar and sweet nectar, I gaze upward to absorb the numinous radiance.\nBody born of water and fire, clad in scarlet feathered robes.\nAscending the void in flying steps, treading the phoenix ladder.\nCircling the eight heavens, seven generations of ancestors commune.\"*\nUpon completion, draw in qi and swallow three times.\nPracticing for three years, the eight heavens each dispatch eight Great Cinnabar Jade Maidens and eight Great Yang Jade Lads to attend the body, descending the essence of the three crimson luminosities. The complexion reverses to youthful whiteness. After ten thousand kalpas, it remains unaged; seven generations of ancestors transcend and ascend, entering the Hall of Blessings. Returning to the immortal lineage, one is reborn anew.\n\n**Western Eight Heavens**\nThe Dao-Li Chan-You, the Po-Ni Fault-Passing.\nThe winding marsh’s purified hues, the hall of the vast and distant.\nThe flowing net of Brahma-sprouts, the radiant luxuriance of Xiao-Yu.\nThe distant and boundless, the silent—where the winding heads and young capitals dwell.\nAlam and Yuzhu, the blossoming desert’s extended reason.\nThe nine openings discern themselves, the Anāpāna’s foremost.\nThe immeasurable supporting canopy, the floating net uniting with the spirit.\nJade saliva and long mulberries, the cypress void ferrying immortals.\n\n**Western Numinous Script**\nKnock the teeth seven times, visualize the White Tiger and lion guiding left and right, with seven layers of white clouds enveloping the body.\nRecite the esoteric incantation:\n*\"The seven qi of golden numina, the honored spirits of the eight heavens.\nThe White Tiger spurs the chariot, the lion bears the axle.\nThe seven qi entwine, refining me into an immortal.\nBody ascending in golden light, reflecting the white clouds.\nInner and outer transformations, ascending into the cavern gate.\nSeven generations of ancestors emerge from the night, the nine dark realms’ souls revolve.\nAfter a hundred million kalpas, they open the path—following the movement, eternally preserved.\"*\nUpon completion, draw in qi and swallow seven times.\nPracticing for seven years, the eight heavens each dispatch eight White Numinous Jade Lads to attend the body, descending the fumigation of the seven qi of Great Simplicity. Age halts, and the worldly countenance remains youthful for ten thousand kalpas. When the seven generations of ancestors ascend to the Southern Palace, returning to the immortal lineage, they are reborn anew, generation after generation as immortals.\n\n**Northern Eight Heavens**\nThe self-nurturing Juewu, the nine suns guiding Qian.\nThe Mother of Kun covering the east, her form embracing the upper mystery.\nThe distant and vast Tuoluo, the subtle qi merging with the clouds.\nThe flying heavens’ great uglies, overseeing the upper heavens.\nThe Shatuo kalpa-measure, the dragon’s Han radiance.\nThe azure vault’s floating Li, the empty songs preserving the precious.\nThe evil Yi’s primordial rank, the cavern’s wondrous self-truth.\nThe primordial Brahma’s vast desert, the secluded and silent ferry of humanity.\n\n**Northern Numinous Script**\nKnock the teeth five times, visualize the flying tortoise and feathered canopy flourishing left and right, with five layers of black clouds enveloping the body. Divine lads and jade maidens in feathered robes and flying garments attend the body.\nRecite the esoteric incantation:\n*\"The heavens linger in primordial circling, the flowing radiance of the Upper Clarity.\"*",
      "overlap_context": "ones shall thereby become ministers of the Golden Gates of the Sagely Lord. The heavens record the merits and transgressions of humanity without the slightest error. The demon kings of heaven shall also safeguard your person, and those who attain the Way shall come to comprehend these most profound teachings.\n\nThe boundless hidden speech of the Great Brahma in the heavens,\nThe Central Chapter of the Numinous Writ of the Primordial Beginning,\nComposed by the Dao Lord of the Eastern Eight Heavens.",
      "start_char": 14486,
      "end_char": 15460,
      "start_sentence": 862,
      "end_sentence": 939,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.378641843795776,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\灵图类\\灵宝无量度人上品妙经符图（宋佚名）.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "大有启运，八字高明。 飞天澄空，洞阴自生。 五炁缠绵，灌我身形。 冠带北单，受炼洞灵。 肾府北出，内外光精。 飞行三界，遨宴紫庭。 七祖同庆，欢乐劫龄。 七宝林中，反胎更生。 长夜出离，南宫记名。 黄箓白简，世世仙生。 咒毕，引炁五咽止，行之五年，八天各以太元玉童八人侍卫身形。 降致灵滋五炁之精，还年留景，保命三清，庆及七祖，世世仙生。 道言：此诸天中，大梵隐语、无量之音旧文字皆广长一丈。 天真皇人昔书其文以为正音，有知其音能齐而诵之者，诸天皆遣飞天神王下观其身，书其功勤，上奏诸天。 万神朝礼，地祇侍门。 大勋魔王，保举上仙。 道备克得游行三界，升入金门。 此音无所不辟，无所不禳，无所不度，无所不成。 天真自然之音也。 故诵之致飞天下，观上帝遥唱，万神朝礼，三界侍轩，群妖束首，鬼精自亡，琳琅振响。 十方肃清，河海静默，山岳吞烟，万灵振伏。 招集群仙，天无氛秽，地无妖尘。 冥慧洞清，大量玄玄也。 灵宝无量度人上品妙经符图卷下",
      "translated_text": "The Great Possession Initiates the Movement, the Eight Characters Ascend in Brilliance.\nThe flying heavens clarify the void, the cavernous yin spontaneously arises.\nThe five qi entwine and coil, irrigating my form.\nCrowned and girded with the Northern Unlined, receiving refinement from the cavernous numina.\nThe kidney palace issues forth to the north, inner and outer luminous essence.\nSoaring through the Three Realms, roaming and feasting in the Purple Court.\nSeven ancestors rejoice together, delighting in kalpa-long ages.\nWithin the Seven Treasures Grove, reborn through returning to the womb.\nEmerging from the Long Night, names recorded in the Southern Palace.\nYellow Registers and White Tallies, immortals born generation after generation.\nUpon concluding the incantation, draw qi and swallow five times, then cease. Practicing this for five years, each of the Eight Heavens dispatches eight Jade Lads of the Great Primordial to attend and guard the body.\nThey bestow the numinous essence of the five qi’s refinement, restoring years and preserving radiance, safeguarding life in the Three Clarities. Joy extends to the seven ancestors, immortals born generation after generation.\n\nThe Dao states: Among these heavens, the great Brahma’s hidden speech and the boundless sounds of ancient script were all a full *zhang* in length. The Heavenly Perfected Sovereign of Old inscribed these characters to establish the correct intonation. Those who know these sounds and can recite them in unison will have the flying heavens and divine kings descend to observe their form, record their meritorious diligence, and submit it to the heavens above. Myriad spirits pay homage, earthly numina attend at the gates. Great Merit Demon Kings advocate for their ascent as immortals. With the Dao perfected and attained, they may roam the Three Realms and ascend through the Golden Gate. These sounds repel all, exorcise all, deliver all, and accomplish all. They are the Heavenly Perfected’s natural sounds. Thus, reciting them summons the flying heavens to descend, while the Emperor from afar intones, myriad spirits pay homage, the Three Realms attend in reverence, and all demonic hordes submit. Ghostly essences perish of themselves, the jade-like resonance vibrates. The ten directions grow solemn and clear, rivers and seas fall silent, mountains and peaks swallow their mists, and all numina tremble in submission. Gathering the assembled immortals, the heavens are free of miasmic filth, the earth devoid of demonic dust. Profound wisdom illumines the cavernous clarity, the vast measure is profoundly mysterious.\n\n*Upper Chapters of the Numinous Treasure’s Boundless Deliverance of Humanity, Wondrous Sutra of Talismanic Charts, Scroll the Lower*",
      "overlap_context": " wondrous self-truth.\nThe primordial Brahma’s vast desert, the secluded and silent ferry of humanity.\n\n**Northern Numinous Script**\nKnock the teeth five times, visualize the flying tortoise and feathered canopy flourishing left and right, with five layers of black clouds enveloping the body. Divine lads and jade maidens in feathered robes and flying garments attend the body.\nRecite the esoteric incantation:\n*\"The heavens linger in primordial circling, the flowing radiance of the Upper Clarity.\"*",
      "start_char": 15460,
      "end_char": 15864,
      "start_sentence": 940,
      "end_sentence": 963,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.52512001991272,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\灵图类\\灵宝无量度人上品妙经符图（宋佚名）.txt",
        "category": "灵图类"
      }
    }
  ]
}