{
  "source_id": "灵宝天尊说洪恩灵济真君妙经",
  "source_file": "chunked_daozang\\灵宝天尊说洪恩灵济真君妙经.json",
  "total_chunks": 2,
  "total_original_chars": 1510,
  "total_translated_chars": 10685,
  "total_translation_time": 52.630374908447266,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\本文类\\灵宝天尊说洪恩灵济真君妙经.txt",
    "category": "本文类"
  },
  "full_translation": "**The Marvelous Scripture of the Vast Grace Numinous Salvation True Lords, Spoken by the Numinous Treasure Heavenly Worthy**\n\n**Scripture Title:** *The Marvelous Scripture of the Vast Grace Numinous Salvation True Lords, Spoken by the Numinous Treasure Heavenly Worthy*. Author unknown. One fascicle. Base text from the *Zhengtong Daoist Canon*, Dongxuan Section, Benwen Category.\n\n---\n\n**Imperially Composed Preface to *The Marvelous Scripture of the Vast Grace Numinous Salvation True Lords, Spoken by the Numinous Treasure Heavenly Worthy***\n\nWe reflect upon the Dao as teaching, which unfolds the profound mysteries of the primal chaos and the void, possessing the wondrous subtleties of the Boundless and the spontaneous. Dim and obscure, silent and still—gazing upon it, one sees no form; listening to it, one hears no sound. Above, it shades and assists the imperial rule; below, it benefits and succors all beings. Its merit and power are so vast they defy description.\n\nConsider the True Lords of Vast Grace: the Golden Portal of the Nine Heavens, Illuminating Dao and Manifesting Virtue, Great Immortal of Resplendent Numinosity and Universal Salvation, Pure and Subtle, Cavernous and Mysterious, Void and Wondrous, Compassionate and Benevolent, Protector of the State and Shelter of the People—Hong’en True Lord Jiang Wang; and the Jade Portal of the Nine Heavens, Proclaiming Transformation and Upholding the Teaching, Supreme Immortal of Radiant Numinosity and Vast Salvation, Lofty and Bright, Vast and Tranquil, Profound and Serene, Wondrously Responsive, Benevolent and Kind, Assistant to the State and Guardian of the People—Hong’en True Lord Rao Wang. Concentrating the essence of the numinous and the excellence of heaven, they were born as heroes among men. Broad in kindness and compassion, they cherished the people and loved all things. Loyal to their lord and filial to their parents, they revered the Three Treasures, devoted themselves to goodness, and practiced with unwavering diligence. Having perfected their merit and fulfilled their conduct, they were moved by heaven to receive titles, their ranks established among the immortals. They assist and illuminate the mechanisms of transformation, guiding beings from darkness into light, warding off disasters and averting calamities, dispelling misfortune and summoning blessings, spreading protection over the earth and benefiting all living things.\n\nRecently, they have magnified their numinous efficacy, shielding and guarding Our person, supporting and sheltering Us, bringing about peace and tranquility. Thereafter, they manifested talismans and medicines, widely bestowing them upon the realm, with the aim of enabling people to dispel illness and suffering and to flourish with descendants. Their great virtue and profound grace are equal to heaven and earth. Moved by the favor of the spirits, We have never forgotten it, day or night. Amidst the myriad affairs of state, We chanced upon *The Marvelous Scripture of the Vast Grace Numinous Salvation True Lords, Spoken by the Numinous Treasure Heavenly Worthy*, which reveals the subtle and profound, whose divine transformations are unfathomable, whose expedient benefits and deliverance span kalpas. Truly, it is the sun and moon illuminating the dark, the boat and oar crossing the sea. Thus, We have had it carved and printed to widely disseminate it, in repayment of the spirits’ blessings.\n\nIf devout and faithful persons can purify themselves through repentance, revere the Three Treasures, be utterly loyal and filial, practice benevolence and righteousness, and earnestly vow to receive, uphold, recite, and chant this scripture, then their households will enjoy good fortune, their destinies will flow smoothly, their descendants will flourish, disasters will be averted, calamities will be transcended, blessings will increase, and life will be prolonged, extending even to their nine generations, all attaining liberation and ascent. But if one slanders, belittles, or disdains the Three Treasures, is disloyal or unfilial, unkind or unrighteous, and fails to reverently believe and uphold this scripture, then one will incur evil karma, one’s household will decline, one’s descendants will weaken, one’s years will be cut short, and one’s nine generations will be burdened, forever sinking into darkness. Looking back at the past, there is clear evidence of this.\n\nAlas! Good and ill fortune, virtue and evil—all are created by the mind. Doing good brings blessings; doing evil brings misfortune. This is the natural principle. Thus it is said: “The family that accumulates goodness will surely have abundant blessings; the family that accumulates evil will surely have abundant misfortune.” It is also said: “Only the Supreme Lord is not constant: those who do good are bestowed with a hundred blessings; those who do evil are visited with a hundred misfortunes.” Therefore, those who contemplate this—how can they not be exhorted? How can they not be exhorted?\n\nWritten on the first day of the first lunar month in the eighteenth year of the Yongle reign.\n\n---\n\n**The Marvelous Scripture of the Vast Grace Numinous Salvation True Lords, Spoken by the Numinous Treasure Heavenly Worthy**\n\nAt that time, the Numinous Treasure Heavenly Worthy was in the Palace of Fivefold Clarity in the Great Brahma Heaven, seated by a table. Bells and chimes sounded of themselves as the assembly of star hosts of the Five Celestial Granaries gathered. The Heavenly Worthy expounded the wondrous Dao of the Supreme, the Boundless, and the Utmost Real.\n\nThen, the two envoys of the Central Granary of the Dipper—Ministers of Water—stood before the throne, the left holding a green tally, the right wielding a yellow axe. They bowed their heads, prostrated themselves twice, knelt, and addressed the Heavenly Worthy: “By good fortune in past lives, we have been counted among the heavenly and human realms. Looking down upon the beings of the Desire Realm, we see that they are neither loyal nor filial, neither righteous nor benevolent. They commit many evil deeds without shame or remorse, and their allotted span has come to an end. Now, in this final kalpa, they have lost the celestial charts, the cosmic net is torn, and the cords of order are broken. Warfare and fire rage unchecked, jade and stone alike are burned and destroyed. Some suffer from floods, others from famine. Punishments and taxes are harsh and oppressive; plagues and poisons spread unchecked. They endure all manner of suffering yet do not awaken, their vitality nearly extinguished, the human Dao on the verge of collapse. By what causes and conditions may they be saved? We beseech Your compassion to open the gate of expedient means.”\n\nThe Heavenly Worthy said: “Excellent, excellent. The beings of the final kalpa are like newborn infants. Since you have generated such a mind and made such a vow, follow Our teachings and widely expound the causes and conditions to all beings, enabling them to awaken their natures without doubt or hesitation. Loyalty and filial piety, benevolence and righteousness—cultivate even one of these four, and you will always dwell in good fortune.”\n\nThe ministers, having received these words, dared not fail to carry them out. Thus, in the year of *jiachen* during the *bingwu* cycle, they descended into the human realm, dividing their bodies to teach and transform. Their merit was accomplished in the Eastern Sea, and their traces were manifested in the Southern Region. After a full cycle of sixty years, they returned to their duties. In one region, incense and offerings continued for many years. When the time of their transformation came, they renewed their vows as before, advancing in the ranks of immortals and receiving the title of True Lord. The Heavenly Worthy praised and pitied them, embodying the Supreme’s virtue of cherishing life, so that all good men and women might know that body, nature, and life all depend on the Dao to generate loyalty, filial piety, benevolence, and righteousness, and to understand these causes.\n\nOn the Three Primes, the Eight Festivals, the Three Assemblies, the Five Fasts, the days of *gengshen* and *jiazi*, and one’s own life-day, one should burn incense, observe purification, and make offerings according to the proper rites. With a tranquil mind, face north, bow the head, and reverently recite the names:\n\n*Nine Heavens Golden Portal, Illuminating Dao and Manifesting Virtue, Great Immortal of Resplendent Numinosity and Universal Salvation, Pure and Subtle, Cavernous and Mysterious, Void and Wondrous, Compassionate and Benevolent, Protector of the State and Shelter of the People—Hong’en True Lord Jiang Wang;*\n\n*Nine Heavens Jade Portal, Proclaiming Transformation and Upholding the Teaching, Supreme Immortal of Radiant Numinosity and Vast Salvation, Lofty and Bright, Vast and Tranquil, Profound and Serene, Wondrously Responsive, Benevolent and Kind, Assistant to the State and Guardian of the People—Hong’en True Lord Rao Wang.*\n\nWith reverence before the sacred compassion, we repent in accordance with the scriptures, never transgressing the vows of the True Lords, each establishing ourselves through loyalty, filial piety, benevolence, and righteousness. Within, this may augment blessings and prolong life; without, it may dispel calamities and deliver from adversity. Above, it may enable the souls of ancestors to ascend and transcend; below, it may bring peace and tranquility to the household and kin. Universally, we wish all beings to partake in benefit and joy.\n\nThereupon, the Heavenly Worthy expounded further for the True Lords and proclaimed in verse:\n\n*True Lords of Numinous Salvation,*\n*Cultivated the Real and attained the Dao.*\n*They wander and feast in the Immortal Capital,*\n*Where the Heavenly Worthy bestowed their titles.*\n*The Northern Dipper sent down its spirit,*\n*Flowing abundantly to the left.*\n*Below, it oversees the Three Realms;*\n*Above, it pays homage to the Five Elders.*\n*Blessing the state and pacifying the home,*\n*Their merit is vast and boundless.*\n*No wish goes unfulfilled,*\n*Silently aligning with all prayers.*\n*Loyalty, filial piety, benevolence, and righteousness,*\n*Forever treasured as the essence of being.*\n*Used as the cause and condition,*\n*Never transgressing the sacred vow.*\n\n*All good and evil*\n*Arise from the heart’s creation.*\n*Those who do good reap blessings;*\n*Those who do evil incur misfortune.*\n\n*Hasten, hasten, in accordance with the decree of the Heavenly Worthy!*\n\nThus concludes the *Marvelous Sutra of the Numinous Salvation True Lords of Vast Grace*, spoken by the Numinous Treasure Heavenly Worthy.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "灵宝天尊说洪恩灵济真君妙经 经名：灵宝天尊说洪恩灵济真君妙经。 撰者不详。 一卷。 底本出处：《正统道藏》洞玄部本文类。 御制灵宝天尊说洪恩灵济真君妙经序 朕惟道之为教，阐鸿蒙虚玄之秘，具无极自然之妙。 窈窈冥冥，昏昏默默，视之而不见其形，听之而不闻其声。 上以阴翊皇度，下以利济群品。 功德之大，不可名言。 有若九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君江王，九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君饶王。 萃灵锺秀，天挺人豪，宽惠慈祥，仁民爱物，忠君孝亲，崇信三宝，笃志好善，精勤不二，功成行满，遂感天封，昭锡徽号，序列仙品，弼亮化机，出幽入明，御灾捍患，驱珍致祥，敷佑下土，利济群生。 乃者，弘阐灵既，翊卫朕躬，扶持保庇，载底平宁。 已而示以符药，广施寰宇，期在使人蠲除疾疢，蕃育子孙。 大德深恩，同於天地。 朕感神之惠，夙夜弗忘，万几之暇，因阅《灵宝天尊说洪恩灵济真君妙经》显微玄奥，神化莫测，方便利益，拔济旷劫，诚烛幽之日月，而济海之舟航也。 乃以锓梓，用广流传，以报神休。 善信之士，果能洗涤忏悔，崇信三宝，尽忠尽孝，行仁行义，弘发誓愿，受持讽诵，则身家吉庆，命运亨通，子孙蕃衍，消灾度厄，增福延寿，延及九祖，咸获超跻。 苟或訾毁轻慢，凌忽三宝，不忠不孝，不仁不义，不能敬信奉持，则身罹恶业，门户衰替，子孙微弱，寿年夭促，累及九祖，永堕沦冥。 历观已往，具有明征。 於乎吉凶善恶，皆由心造。 为善获福，为恶受殃，此自然之理。 故曰：积善之家，必有余庆，积不善之家，必有余殃。 又曰：惟上帝不常，作善降之百祥，作不善降之百殃。 然则观於此者，可不知所勉哉，可不知所勉哉。 水乐十八年正月初一日 灵宝天尊说洪恩灵济真君妙经 尔时，灵宝天尊在大罗天上五明宫中，凭几而坐，钟磬自呜，宴集诸天星众五斗大神，宣演太上无极至真妙道。 时有斗中都水二使者，左执青节，右仗黄钺，侍立帝前，稽首再拜，长跪而进言：臣等宿生庆幸，得预天人。 下观欲界众生，不忠不孝，不义不仁，多作恶业，全无惭愧，历数已终。 今生末劫，丑口失图，纲维折裂，兵火肆兴，玉石焚丧。 或遭洪水，或遇凶年，刑赋苛虐，灾毒流行，罹诸苦恼，不知解悟，生意几息，人道将穷，作何因缘可以救度？ 愿垂怜悯，开方便门。 天尊曰：善哉，善哉。 末劫众生，一如赤子。 发汝如是心成，汝如是愿依吾教法，广为众生说诸因缘，令开悟性，勿生疑虑。 曰忠与孝，曰仁与义，四者修特一，常居吉庆。 臣等既承斯语，敢不奉行。 乃於甲辰之岁丙午之年下降人间，分身教化，成功东海，显迹南邦。 甲子一周，复还职任。 香火一方，历年弥久，载逢灭度，复誓如初，躐进仙阶，真君锡号，蒙天尊嗟悯之。 仁体太上好生之德，使一切善男善女知身性命，皆凭道生忠孝仁义，了悟此因。 能於三元八节、三会五腊、庚申甲子、本命之日，焚香修斋，如法供养，冥心向北，稽首礼念： 九天金阙明道达德大仙显灵溥济清微洞玄冲虚妙感慈惠护国庇民洪恩真君江王，九天玉阙宣化扶教上仙昭灵博济高明弘静冲湛妙应仁惠辅国佑民洪恩真君饶王。",
      "translated_text": "**The Marvelous Scripture of the Vast Grace Numinous Salvation True Lords, Spoken by the Numinous Treasure Heavenly Worthy**\n\n**Scripture Title:** *The Marvelous Scripture of the Vast Grace Numinous Salvation True Lords, Spoken by the Numinous Treasure Heavenly Worthy*. Author unknown. One fascicle. Base text from the *Zhengtong Daoist Canon*, Dongxuan Section, Benwen Category.\n\n---\n\n**Imperially Composed Preface to *The Marvelous Scripture of the Vast Grace Numinous Salvation True Lords, Spoken by the Numinous Treasure Heavenly Worthy***\n\nWe reflect upon the Dao as teaching, which unfolds the profound mysteries of the primal chaos and the void, possessing the wondrous subtleties of the Boundless and the spontaneous. Dim and obscure, silent and still—gazing upon it, one sees no form; listening to it, one hears no sound. Above, it shades and assists the imperial rule; below, it benefits and succors all beings. Its merit and power are so vast they defy description.\n\nConsider the True Lords of Vast Grace: the Golden Portal of the Nine Heavens, Illuminating Dao and Manifesting Virtue, Great Immortal of Resplendent Numinosity and Universal Salvation, Pure and Subtle, Cavernous and Mysterious, Void and Wondrous, Compassionate and Benevolent, Protector of the State and Shelter of the People—Hong’en True Lord Jiang Wang; and the Jade Portal of the Nine Heavens, Proclaiming Transformation and Upholding the Teaching, Supreme Immortal of Radiant Numinosity and Vast Salvation, Lofty and Bright, Vast and Tranquil, Profound and Serene, Wondrously Responsive, Benevolent and Kind, Assistant to the State and Guardian of the People—Hong’en True Lord Rao Wang. Concentrating the essence of the numinous and the excellence of heaven, they were born as heroes among men. Broad in kindness and compassion, they cherished the people and loved all things. Loyal to their lord and filial to their parents, they revered the Three Treasures, devoted themselves to goodness, and practiced with unwavering diligence. Having perfected their merit and fulfilled their conduct, they were moved by heaven to receive titles, their ranks established among the immortals. They assist and illuminate the mechanisms of transformation, guiding beings from darkness into light, warding off disasters and averting calamities, dispelling misfortune and summoning blessings, spreading protection over the earth and benefiting all living things.\n\nRecently, they have magnified their numinous efficacy, shielding and guarding Our person, supporting and sheltering Us, bringing about peace and tranquility. Thereafter, they manifested talismans and medicines, widely bestowing them upon the realm, with the aim of enabling people to dispel illness and suffering and to flourish with descendants. Their great virtue and profound grace are equal to heaven and earth. Moved by the favor of the spirits, We have never forgotten it, day or night. Amidst the myriad affairs of state, We chanced upon *The Marvelous Scripture of the Vast Grace Numinous Salvation True Lords, Spoken by the Numinous Treasure Heavenly Worthy*, which reveals the subtle and profound, whose divine transformations are unfathomable, whose expedient benefits and deliverance span kalpas. Truly, it is the sun and moon illuminating the dark, the boat and oar crossing the sea. Thus, We have had it carved and printed to widely disseminate it, in repayment of the spirits’ blessings.\n\nIf devout and faithful persons can purify themselves through repentance, revere the Three Treasures, be utterly loyal and filial, practice benevolence and righteousness, and earnestly vow to receive, uphold, recite, and chant this scripture, then their households will enjoy good fortune, their destinies will flow smoothly, their descendants will flourish, disasters will be averted, calamities will be transcended, blessings will increase, and life will be prolonged, extending even to their nine generations, all attaining liberation and ascent. But if one slanders, belittles, or disdains the Three Treasures, is disloyal or unfilial, unkind or unrighteous, and fails to reverently believe and uphold this scripture, then one will incur evil karma, one’s household will decline, one’s descendants will weaken, one’s years will be cut short, and one’s nine generations will be burdened, forever sinking into darkness. Looking back at the past, there is clear evidence of this.\n\nAlas! Good and ill fortune, virtue and evil—all are created by the mind. Doing good brings blessings; doing evil brings misfortune. This is the natural principle. Thus it is said: “The family that accumulates goodness will surely have abundant blessings; the family that accumulates evil will surely have abundant misfortune.” It is also said: “Only the Supreme Lord is not constant: those who do good are bestowed with a hundred blessings; those who do evil are visited with a hundred misfortunes.” Therefore, those who contemplate this—how can they not be exhorted? How can they not be exhorted?\n\nWritten on the first day of the first lunar month in the eighteenth year of the Yongle reign.\n\n---\n\n**The Marvelous Scripture of the Vast Grace Numinous Salvation True Lords, Spoken by the Numinous Treasure Heavenly Worthy**\n\nAt that time, the Numinous Treasure Heavenly Worthy was in the Palace of Fivefold Clarity in the Great Brahma Heaven, seated by a table. Bells and chimes sounded of themselves as the assembly of star hosts of the Five Celestial Granaries gathered. The Heavenly Worthy expounded the wondrous Dao of the Supreme, the Boundless, and the Utmost Real.\n\nThen, the two envoys of the Central Granary of the Dipper—Ministers of Water—stood before the throne, the left holding a green tally, the right wielding a yellow axe. They bowed their heads, prostrated themselves twice, knelt, and addressed the Heavenly Worthy: “By good fortune in past lives, we have been counted among the heavenly and human realms. Looking down upon the beings of the Desire Realm, we see that they are neither loyal nor filial, neither righteous nor benevolent. They commit many evil deeds without shame or remorse, and their allotted span has come to an end. Now, in this final kalpa, they have lost the celestial charts, the cosmic net is torn, and the cords of order are broken. Warfare and fire rage unchecked, jade and stone alike are burned and destroyed. Some suffer from floods, others from famine. Punishments and taxes are harsh and oppressive; plagues and poisons spread unchecked. They endure all manner of suffering yet do not awaken, their vitality nearly extinguished, the human Dao on the verge of collapse. By what causes and conditions may they be saved? We beseech Your compassion to open the gate of expedient means.”\n\nThe Heavenly Worthy said: “Excellent, excellent. The beings of the final kalpa are like newborn infants. Since you have generated such a mind and made such a vow, follow Our teachings and widely expound the causes and conditions to all beings, enabling them to awaken their natures without doubt or hesitation. Loyalty and filial piety, benevolence and righteousness—cultivate even one of these four, and you will always dwell in good fortune.”\n\nThe ministers, having received these words, dared not fail to carry them out. Thus, in the year of *jiachen* during the *bingwu* cycle, they descended into the human realm, dividing their bodies to teach and transform. Their merit was accomplished in the Eastern Sea, and their traces were manifested in the Southern Region. After a full cycle of sixty years, they returned to their duties. In one region, incense and offerings continued for many years. When the time of their transformation came, they renewed their vows as before, advancing in the ranks of immortals and receiving the title of True Lord. The Heavenly Worthy praised and pitied them, embodying the Supreme’s virtue of cherishing life, so that all good men and women might know that body, nature, and life all depend on the Dao to generate loyalty, filial piety, benevolence, and righteousness, and to understand these causes.\n\nOn the Three Primes, the Eight Festivals, the Three Assemblies, the Five Fasts, the days of *gengshen* and *jiazi*, and one’s own life-day, one should burn incense, observe purification, and make offerings according to the proper rites. With a tranquil mind, face north, bow the head, and reverently recite the names:\n\n*Nine Heavens Golden Portal, Illuminating Dao and Manifesting Virtue, Great Immortal of Resplendent Numinosity and Universal Salvation, Pure and Subtle, Cavernous and Mysterious, Void and Wondrous, Compassionate and Benevolent, Protector of the State and Shelter of the People—Hong’en True Lord Jiang Wang;*\n\n*Nine Heavens Jade Portal, Proclaiming Transformation and Upholding the Teaching, Supreme Immortal of Radiant Numinosity and Vast Salvation, Lofty and Bright, Vast and Tranquil, Profound and Serene, Wondrously Responsive, Benevolent and Kind, Assistant to the State and Guardian of the People—Hong’en True Lord Rao Wang.*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1262,
      "start_sentence": 0,
      "end_sentence": 43,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.860759019851685,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\灵宝天尊说洪恩灵济真君妙经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "恭对圣慈，依经忏悔，不违真君之誓愿，各以忠孝仁义而立身。 内可以增福延年，外可以消灾度厄。 上可以使祖弥之魂神超度，下可以使家宅之眷属乂宁，普愿众生同沾利乐。 於是天尊重为真君演说而作偈曰： 灵济真君，修真得道。 游宴仙都，天尊锡号。 北斗降神，洋洋于左。 下临三界，上朝五老。 福国宁家，其功浩浩。 无愿不从，默符所祷。 忠孝仁义，永为身宝。 用作因缘，不违誓好。 一切善恶，皆由心造。 为善者福，为恶者祸。 急急如天尊律令勑。 灵宝天尊说洪恩灵济真君妙经竟",
      "translated_text": "With reverence before the sacred compassion, we repent in accordance with the scriptures, never transgressing the vows of the True Lords, each establishing ourselves through loyalty, filial piety, benevolence, and righteousness. Within, this may augment blessings and prolong life; without, it may dispel calamities and deliver from adversity. Above, it may enable the souls of ancestors to ascend and transcend; below, it may bring peace and tranquility to the household and kin. Universally, we wish all beings to partake in benefit and joy.\n\nThereupon, the Heavenly Worthy expounded further for the True Lords and proclaimed in verse:\n\n*True Lords of Numinous Salvation,*\n*Cultivated the Real and attained the Dao.*\n*They wander and feast in the Immortal Capital,*\n*Where the Heavenly Worthy bestowed their titles.*\n*The Northern Dipper sent down its spirit,*\n*Flowing abundantly to the left.*\n*Below, it oversees the Three Realms;*\n*Above, it pays homage to the Five Elders.*\n*Blessing the state and pacifying the home,*\n*Their merit is vast and boundless.*\n*No wish goes unfulfilled,*\n*Silently aligning with all prayers.*\n*Loyalty, filial piety, benevolence, and righteousness,*\n*Forever treasured as the essence of being.*\n*Used as the cause and condition,*\n*Never transgressing the sacred vow.*\n\n*All good and evil*\n*Arise from the heart’s creation.*\n*Those who do good reap blessings;*\n*Those who do evil incur misfortune.*\n\n*Hasten, hasten, in accordance with the decree of the Heavenly Worthy!*\n\nThus concludes the *Marvelous Sutra of the Numinous Salvation True Lords of Vast Grace*, spoken by the Numinous Treasure Heavenly Worthy.",
      "overlap_context": "tion, Pure and Subtle, Cavernous and Mysterious, Void and Wondrous, Compassionate and Benevolent, Protector of the State and Shelter of the People—Hong’en True Lord Jiang Wang;*\n\n*Nine Heavens Jade Portal, Proclaiming Transformation and Upholding the Teaching, Supreme Immortal of Radiant Numinosity and Vast Salvation, Lofty and Bright, Vast and Tranquil, Profound and Serene, Wondrously Responsive, Benevolent and Kind, Assistant to the State and Guardian of the People—Hong’en True Lord Rao Wang.*",
      "start_char": 1262,
      "end_char": 1499,
      "start_sentence": 44,
      "end_sentence": 59,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.769615888595581,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\灵宝天尊说洪恩灵济真君妙经.txt",
        "category": "本文类"
      }
    }
  ]
}