{
  "source_id": "灵宝天尊说禄库受生经",
  "source_file": "chunked_daozang\\灵宝天尊说禄库受生经.json",
  "total_chunks": 2,
  "total_original_chars": 1809,
  "total_translated_chars": 11148,
  "total_translation_time": 52.11590099334717,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\本文类\\灵宝天尊说禄库受生经.txt",
    "category": "本文类"
  },
  "full_translation": "*The Scripture on the Treasury of Life-Receiving Debts, Spoken by the Numinous Treasure Heavenly Worthy*\n\n**Scripture Title:** *The Scripture on the Treasury of Life-Receiving Debts, Spoken by the Numinous Treasure Heavenly Worthy*. Author unknown, approximately dated to the Sui-Tang period. Exhorts people to burn and repay their \"life-receiving money\" owed to the earthly hells. One fascicle.\n\n**Source of Base Text:** *Daoist Canon of the Zhengtong Era*, *Dongxuan Section*, *Category of Original Texts*.\n\n---\n\nAt that time, the Numinous Treasure Heavenly Worthy was in the Pure Bright Land of the Floating Gauze World, beneath the Seven Treasures Tree on Mount Good Accumulation, expounding the wondrous Dharma to an immeasurable assembly of flying heavenly deities and hosts of immortals and sages. Suddenly, nine-colored radiant light emanated, universally illuminating the karmic retributions of good and evil among all beings across the ten directions—some noble, some base, some wealthy, some impoverished.\n\nThe great assembly, harboring doubts about these beings and their respective fruits, dared not inquire. Then, the Perfected One of Radiant and Wondrous Sound arose from his seat, adjusted his robes and cap, prostrated, and knelt with reverence, addressing the Heavenly Worthy: \"Just now, I witnessed your awe-inspiring light illuminating the ten directions. Beings—whether male or female, rich or poor, noble or lowly—experience suffering and joy differently. What distinct causes do these beings possess? I humbly beseech your sagely compassion to grant us the decisive teaching in response to this plea.\"\n\nThe Heavenly Worthy replied: \"Excellent, excellent. Return to your seat, compose your spirit in silence, and listen single-mindedly.\"\n\nThe Heavenly Worthy declared: \"All beings across the ten directions belong to the celestial bureaus in life and are subject to the earthly hells in death. On the day they attain human form, they once borrowed 'life-receiving money' from the underworld treasuries governed by the dark offices. Their wealth and nobility are recorded in the ledgers of destiny. Those who are poor and lowly, however, have been indebted to the dark offices from kalpa to kalpa, their blessings seized for repayment. In the world, they suffer privation, for the dark officials have deducted their yang blessings to settle their yin debts. Thus, nobility and baseness, wealth and poverty, suffering and joy differ—you should reflect and understand this.\"\n\nThe Heavenly Worthy continued: \"Long ago, I bestowed a single Jeweled Tree upon the Northern Emperor of Fengdu, planting it in the nether capital to clearly observe the karmic retributions of all beings. I also granted three divine arrows and three spirit bows to men and women who attain human rebirth. They take up these bows and arrows and shoot at the Jeweled Tree. Those who strike the eastern branch attain official rank and long life. Those who strike the southern branch attain extended years and robust health. Those who strike the western branch attain wealth, nobility, and splendor. Those who strike the northern branch attain poverty, hardship, and suffering. This Jeweled Tree is the condition of karmic retribution.\n\n\"If, in life, one reveres the Three Treasures, practices expedient generosity, establishes vegetarian feasts, recites scriptures, cultivates various good conditions, and—following my teachings—recites this scripture and burns repayment for the 'life-receiving money,' one will attain a male body for three lifetimes. Even upon death, one will not pass through hell but will regain human form. If Fengdu were to use the bows and arrows to shoot at the Jeweled Tree, I would employ my divine power to support them, preventing them from striking the northern branch, so they may again attain a noble and prosperous body.\n\n\"If, however, one is miserly, greedy, and deluded in life, disbelieves in the scriptures and Dharma, defaults on debts, harbors jealousy, neglects good causes, and only cultivates evil, their name will be recorded in the ledgers of sin. The celestial bureaus will reduce their lifespan, and they will default on the 'life-receiving money' owed to the dark offices. If they do not repay in life but instead deceive and falsify, upon death they will enter hell, and only after ten thousand kalpas will they be reborn as beasts, cycling through karmic retribution. Even if they regain human form, they will again take up the divine bow and sacred arrows, and their natural karmic retribution will strike the northern branch. Though born human, they will be poor, lowly, and disbelieve in the retribution of good causes.\"\n\nThe Perfected One again addressed the Heavenly Worthy: \"I have not yet understood from which dark bureau and treasury one borrows the 'life-receiving money' at birth, nor to which treasury one repays it in life. Though you have enlightened us, this cause remains obscure. I humbly beseech your compassionate presence to distinguish it for the assembly.\"\n\nThe Heavenly Worthy replied: \"At the moment of human birth, there are twelve yearly palaces, each governed by an official who oversees the treasuries of destiny. I shall now reveal to you the names and affiliations of the twelve bureau officials.\n\n- Those born in the *zi* year owe 13,000 strings of cash, belonging to the First Treasury, governed by the official surnamed Li.\n- Those born in the *chou* year owe 280,000 strings of cash, belonging to the Second Treasury, governed by the official surnamed Tian.\n- Those born in the *yin* year owe 80,000 strings of cash, belonging to the Third Treasury, governed by the official surnamed Lei.\n- Those born in the *mao* year owe 80,000 strings of cash, belonging to the Fourth Treasury, governed by the official surnamed Liu.\n- Those born in the *chen* year owe 50,000 strings of cash, belonging to the Fifth Treasury, governed by the official surnamed Yuan.\n- Those born in the *si* year owe 70,000 strings of cash, belonging to the Sixth Treasury, governed by the official surnamed Ji.\n- Those born in the *wu* year owe 260,000 strings of cash, belonging to the Seventh Treasury, governed by the official surnamed Xu.\n- Those born in the *wei* year owe 100,000 strings of cash, belonging to the Eighth Treasury, governed by the official surnamed Zhu.\n- Those born in the *shen* year owe 40,000 strings of cash, belonging to the Ninth Treasury, governed by the official surnamed Che.\n- Those born in the *you* year owe 50,000 strings of cash, belonging to the Tenth Treasury, governed by the official surnamed Zheng.\n- Those born in the *xu* year owe 25,000 strings of cash, belonging to the Eleventh Treasury, governed by the official surnamed Cheng.\n- Those born in the *hai* year owe 9,000 strings of cash, belonging to the Twelfth Treasury, governed by the official surnamed Kang.\"\n\nThe Heavenly Worthy further stated: \"The twelve bureau officials of the preceding palaces each oversee the 'life-receiving money' borrowed by those born under their jurisdiction. Upon attaining human form, one pledges the money of their original destiny, petitioning to have it recorded in the ledgers of the Treasury of Life-Receiving Destiny, which aligns with the registers of the dark offices.\"\n\nThe Perfected One said: \"I have not yet understood the names, positions, and amounts of money associated with these original destinies. I again beseech your compassion to fully expound upon them.\"\n\nThe Heavenly Worthy smiled and replied: \"Excellent. You should strive to act for the sake of all beings. I shall now further expound upon the names and amounts of money for the twelve original destinies.\"\n\nThose born in the *zi* hour have as their original destiny Liu Wenzhen; upon attaining human form, they pledge 7,000 strings of cash. Those born in the *chou* hour have as their original destiny Meng Hou; upon attaining human form, they pledge 9,000 strings of cash. Those born in the *yin* hour have as their original destiny Zhong Yuan; upon attaining human form, they pledge 6,000 strings of cash. Those born in the *mao* hour have as their original destiny Hao Yuan; upon attaining human form, they pledge 10,000 strings of cash. Those born in the *chen* hour have as their original destiny Li Wenliang; upon attaining human form, they pledge 5,400 strings of cash. Those born in the *si* hour have as their original destiny Cao Jiao; upon attaining human form, they pledge 1,000 strings of cash. Those born in the *wu* hour have as their original destiny Zhang Si; upon attaining human form, they pledge 9,000 strings of cash. Those born in the *wei* hour have as their original destiny Sun Gong; upon attaining human form, they pledge 4,000 strings of cash. Those born in the *shen* hour have as their original destiny Du Zhun; upon attaining human form, they pledge 8,000 strings of cash. Those born in the *you* hour have as their original destiny Tian Jiaoyou; upon attaining human form, they pledge 5,000 strings of cash. Those born in the *xu* hour have as their original destiny Cui Jianjin; upon attaining human form, they pledge 5,000 strings of cash. Those born in the *hai* hour have as their original destiny Wang Shuang; upon attaining human form, they pledge 6,000 strings of cash.\n\nAt that time, the Heavenly Worthy addressed the fourfold assembly, saying: \"If there are faithful men and women who delight in the scriptural Dharma, and who, in accordance with this sutra, establish ritual precincts, prepare incense and flowers, adorn with lamps and candles, and make offerings to the Three Treasures of the Great Dao and the Perfected Sages, performing the six periods of ritual circumambulation, reciting the sutra ten times, observing fasts and holding jiao rites—if they duly prepare the full amount of their 'life-receiving money' and the pledged wealth of their original destiny, clearly itemizing each, and present a memorial petition to burn and return it to their respective treasury, they shall in this very life obtain blessings, honor, and noble karmic rewards, and in future lives forever be free from suffering and hardship. If there are beings who disbelieve in these karmic conditions and instead generate evil karma, once they descend into the Nine Springs, if they do not fully confess, they shall endure the retributions of suffering and joy in the cycle of birth and death. You, great assembly, should each reflect and take heed.\"\n\nThen, the Perfected One of Resplendent and Wondrous Sound, together with the assembled immortals, the North Emperor of Fengdu, the Underworld Officials of Yama, the clerks of the Treasury of Life-Receiving Destiny, the original destinies of each, and all present in the assembly, bowed their heads in reverence, gazed upon the honored countenance, prostrated, and withdrew.\n\nThereupon, the Perfected One of Resplendent and Wondrous Sound transmitted the teaching to the world, delivering the living and the deceased, praising and propagating it with joy. All received and upheld it with faith.\n\n*The Sutra of the Treasury of Life-Receiving Destiny, Spoken by the Numinous Treasure Heavenly Worthy, is now complete.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "灵宝天尊说禄库受生经 经名：灵宝天专说禄库受生经。 撰人不详，约出於隋唐。 劝人烧还地狱受生钱。 一卷。 底本出处：《正统道藏》洞玄部本文类。 灵宝天尊说禄库受生经 尔时，灵宝天尊在浮罗世界净明国土，善积山中七宝树下，与无量飞天神王，及诸仙圣众演说妙法。 乃放九色彩光，徧照十方一切众生善恶果报，或贵或贱，或富或贫。 大众怀疑此等众生，有如上果，未敢议问。 时有光妙音真人，从座而起，严整衣冠，叩头长跪，上白天尊曰：适见威光，照耀十方。 或男或女，富贵贫贱，苦乐不同。 此等众生，有何异因。 伏愿圣慈悯，以所请赐以诀言。 天尊曰：善哉善哉。 汝当复坐，静默安神，一心谛听。 天尊言：十方一切众生，命属天曹，身击地府，当得人身之日，曾於地府所属冥司，借贷禄库受生钱财。 方以禄簿注财，为人富贵。 其有贫贱者，为从劫至劫，负欠冥司夺禄，在世穷乏，皆冥官所克，阳禄填於阴债。 是使贵贱贫富，苦乐不同，汝当省知。 天尊言：吾昔赐宝树一株，付与酆都北帝，植於冥京，明察众生善恶果报。 以圣箭三只，神弓三张，给与得生人身男女。 将此弓箭望宝树而射，射得东枝，得官爵长命身。 射得南枝，得延年康健身。 射得西枝，得富贵荣华身。 射得北枝，得贫穷困苦身。 如上之宝树者，乃是业镜果报之缘。 若在生钦敬三宝，方便布施，设斋诵经，行种种善缘，及依吾教诵念此经，烧还禄库受生钱者，得三生为男子身。 若复死亡，不经地狱，再复人身。 酆都若以弓箭施为宝树，我以神力扶持，无使中於北枝，再得荣贵之身。 若复有人在世悭贪愚痴，不信经法，负债不还，更相嫉妬，不念善因，惟恶是修，致使罪簿注名，天曹减算，及负欠冥司受生钱财，在世不还，更相诳妄，死入地狱，万劫方生畜兽身，轮转果报。 若复得为人身，再以神弓圣箭，於宝树自然果报。 射中北枝，既得为人，贫穷下贱，及不信善缘之报。 真人又白天尊言：未审人之生身，从何所属冥曹库借过受生钱，在世贡还何库分。 虽蒙开悟，未测此因，幸望慈尊，为众分别。 天尊曰：人之生身，便有十二年直宫分，各有曹典，主掌禄库。 我今为汝显说十二官曹姓属。 子生人，欠钱一万三千贯，属第一库，曹官姓李。 丑生人，欠钱二十八万贯，属第二库，曹官姓田。 寅生人，欠钱八万贯，属第三库，曹官姓雷。 卯生人，欠钱八万贯，属第四库，曹官姓柳。 辰生人，欠钱五万贯，属第五库，曹官姓袁。 巳生人，欠钱七万贯，属第六库，曹官姓纪。 午生人，欠钱二十六万贯，属第七库，曹官姓许。 未生人，欠钱十万贯，属第八库，曹官姓朱。 申生人，欠钱四万贯，属第九库，曹官姓车。 酉生人，欠钱五万贯，属第十库，曹官姓郑。 戌生人，欠钱二万五千贯、属第十一库，曹官姓成。 亥生人，欠钱九千贯，属第十二库，曹官姓亢。 天尊又言：前十二宫库官，各主局生人欠受生钱博，及得为人身，曾许所属元辰钱财，乞注受生禄库之簿，合同冥司之籍。 真人曰：此之元辰，亦未审於名位钱数，更望慈悯，尽其所说。 天尊含笑而言曰：善哉。 汝当尽力，为於众生。 吾当再为汝开演十二所属元辰姓名钱数。",
      "translated_text": "*The Scripture on the Treasury of Life-Receiving Debts, Spoken by the Numinous Treasure Heavenly Worthy*\n\n**Scripture Title:** *The Scripture on the Treasury of Life-Receiving Debts, Spoken by the Numinous Treasure Heavenly Worthy*. Author unknown, approximately dated to the Sui-Tang period. Exhorts people to burn and repay their \"life-receiving money\" owed to the earthly hells. One fascicle.\n\n**Source of Base Text:** *Daoist Canon of the Zhengtong Era*, *Dongxuan Section*, *Category of Original Texts*.\n\n---\n\nAt that time, the Numinous Treasure Heavenly Worthy was in the Pure Bright Land of the Floating Gauze World, beneath the Seven Treasures Tree on Mount Good Accumulation, expounding the wondrous Dharma to an immeasurable assembly of flying heavenly deities and hosts of immortals and sages. Suddenly, nine-colored radiant light emanated, universally illuminating the karmic retributions of good and evil among all beings across the ten directions—some noble, some base, some wealthy, some impoverished.\n\nThe great assembly, harboring doubts about these beings and their respective fruits, dared not inquire. Then, the Perfected One of Radiant and Wondrous Sound arose from his seat, adjusted his robes and cap, prostrated, and knelt with reverence, addressing the Heavenly Worthy: \"Just now, I witnessed your awe-inspiring light illuminating the ten directions. Beings—whether male or female, rich or poor, noble or lowly—experience suffering and joy differently. What distinct causes do these beings possess? I humbly beseech your sagely compassion to grant us the decisive teaching in response to this plea.\"\n\nThe Heavenly Worthy replied: \"Excellent, excellent. Return to your seat, compose your spirit in silence, and listen single-mindedly.\"\n\nThe Heavenly Worthy declared: \"All beings across the ten directions belong to the celestial bureaus in life and are subject to the earthly hells in death. On the day they attain human form, they once borrowed 'life-receiving money' from the underworld treasuries governed by the dark offices. Their wealth and nobility are recorded in the ledgers of destiny. Those who are poor and lowly, however, have been indebted to the dark offices from kalpa to kalpa, their blessings seized for repayment. In the world, they suffer privation, for the dark officials have deducted their yang blessings to settle their yin debts. Thus, nobility and baseness, wealth and poverty, suffering and joy differ—you should reflect and understand this.\"\n\nThe Heavenly Worthy continued: \"Long ago, I bestowed a single Jeweled Tree upon the Northern Emperor of Fengdu, planting it in the nether capital to clearly observe the karmic retributions of all beings. I also granted three divine arrows and three spirit bows to men and women who attain human rebirth. They take up these bows and arrows and shoot at the Jeweled Tree. Those who strike the eastern branch attain official rank and long life. Those who strike the southern branch attain extended years and robust health. Those who strike the western branch attain wealth, nobility, and splendor. Those who strike the northern branch attain poverty, hardship, and suffering. This Jeweled Tree is the condition of karmic retribution.\n\n\"If, in life, one reveres the Three Treasures, practices expedient generosity, establishes vegetarian feasts, recites scriptures, cultivates various good conditions, and—following my teachings—recites this scripture and burns repayment for the 'life-receiving money,' one will attain a male body for three lifetimes. Even upon death, one will not pass through hell but will regain human form. If Fengdu were to use the bows and arrows to shoot at the Jeweled Tree, I would employ my divine power to support them, preventing them from striking the northern branch, so they may again attain a noble and prosperous body.\n\n\"If, however, one is miserly, greedy, and deluded in life, disbelieves in the scriptures and Dharma, defaults on debts, harbors jealousy, neglects good causes, and only cultivates evil, their name will be recorded in the ledgers of sin. The celestial bureaus will reduce their lifespan, and they will default on the 'life-receiving money' owed to the dark offices. If they do not repay in life but instead deceive and falsify, upon death they will enter hell, and only after ten thousand kalpas will they be reborn as beasts, cycling through karmic retribution. Even if they regain human form, they will again take up the divine bow and sacred arrows, and their natural karmic retribution will strike the northern branch. Though born human, they will be poor, lowly, and disbelieve in the retribution of good causes.\"\n\nThe Perfected One again addressed the Heavenly Worthy: \"I have not yet understood from which dark bureau and treasury one borrows the 'life-receiving money' at birth, nor to which treasury one repays it in life. Though you have enlightened us, this cause remains obscure. I humbly beseech your compassionate presence to distinguish it for the assembly.\"\n\nThe Heavenly Worthy replied: \"At the moment of human birth, there are twelve yearly palaces, each governed by an official who oversees the treasuries of destiny. I shall now reveal to you the names and affiliations of the twelve bureau officials.\n\n- Those born in the *zi* year owe 13,000 strings of cash, belonging to the First Treasury, governed by the official surnamed Li.\n- Those born in the *chou* year owe 280,000 strings of cash, belonging to the Second Treasury, governed by the official surnamed Tian.\n- Those born in the *yin* year owe 80,000 strings of cash, belonging to the Third Treasury, governed by the official surnamed Lei.\n- Those born in the *mao* year owe 80,000 strings of cash, belonging to the Fourth Treasury, governed by the official surnamed Liu.\n- Those born in the *chen* year owe 50,000 strings of cash, belonging to the Fifth Treasury, governed by the official surnamed Yuan.\n- Those born in the *si* year owe 70,000 strings of cash, belonging to the Sixth Treasury, governed by the official surnamed Ji.\n- Those born in the *wu* year owe 260,000 strings of cash, belonging to the Seventh Treasury, governed by the official surnamed Xu.\n- Those born in the *wei* year owe 100,000 strings of cash, belonging to the Eighth Treasury, governed by the official surnamed Zhu.\n- Those born in the *shen* year owe 40,000 strings of cash, belonging to the Ninth Treasury, governed by the official surnamed Che.\n- Those born in the *you* year owe 50,000 strings of cash, belonging to the Tenth Treasury, governed by the official surnamed Zheng.\n- Those born in the *xu* year owe 25,000 strings of cash, belonging to the Eleventh Treasury, governed by the official surnamed Cheng.\n- Those born in the *hai* year owe 9,000 strings of cash, belonging to the Twelfth Treasury, governed by the official surnamed Kang.\"\n\nThe Heavenly Worthy further stated: \"The twelve bureau officials of the preceding palaces each oversee the 'life-receiving money' borrowed by those born under their jurisdiction. Upon attaining human form, one pledges the money of their original destiny, petitioning to have it recorded in the ledgers of the Treasury of Life-Receiving Destiny, which aligns with the registers of the dark offices.\"\n\nThe Perfected One said: \"I have not yet understood the names, positions, and amounts of money associated with these original destinies. I again beseech your compassion to fully expound upon them.\"\n\nThe Heavenly Worthy smiled and replied: \"Excellent. You should strive to act for the sake of all beings. I shall now further expound upon the names and amounts of money for the twelve original destinies.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1239,
      "start_sentence": 0,
      "end_sentence": 53,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.00148367881775,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\灵宝天尊说禄库受生经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "子生人，本命元辰刘文真，当得人身，许钱七千贯。 丑生人，本命元辰孟候，当得人身，许钱九千贯。 寅生人，本命元辰锺元，当得人身，许钱六千贯。 卯生人，本命元辰郝元，当得人身，许钱一万贯。 辰生人，本命元辰李文亮，当得人身，许钱五千四佰贯。 巳生人，本命元辰曹交，当得人身，许钱一千贯。 午生人，本命元辰张巳，当得人身，许钱九千贯。 未生人，本命元辰孙恭，当得人身，许钱四千贯。 申生人，本命元辰杜准，当得人身，许钱八千贯。 酉生人，本命元辰田交佑，当得人身，许钱五千贯。 戌生人，本命元辰崔渐进，当得人身，许钱五千贯。 亥生人，本命元辰王爽，当得人身，许钱六千贯。 尔时，天尊告诸四众，若有善信男女，意乐经法，布施货财，依此经典，建立道场，严备香花，灯烛庄严，供养三宝大道、诸仙大圣，六时行道，十徧转经，修斋设醮，准备所欠受生钱数，及许元辰之财，一一明具，合伺疏牒，烧还本属库分者，即得见世获福，荣贵果报，来生永无苦难。 若有众生不信前缘，返生恶业者，一堕九泉，若不具陈，故有生死苦乐之报。 汝等大众，各自省知。 是时，光妙音真人，及诸仙众，酆都北帝、阎罗冥官、禄库曹典、本属元辰、在会大众，一切稽首，瞻仰尊颜，顶礼而退。 於是光妙音真人传教世间，济度存亡，赞欢敷扬，信受奉行。 灵宝天专说禄库受生经竟",
      "translated_text": "Those born in the *zi* hour have as their original destiny Liu Wenzhen; upon attaining human form, they pledge 7,000 strings of cash. Those born in the *chou* hour have as their original destiny Meng Hou; upon attaining human form, they pledge 9,000 strings of cash. Those born in the *yin* hour have as their original destiny Zhong Yuan; upon attaining human form, they pledge 6,000 strings of cash. Those born in the *mao* hour have as their original destiny Hao Yuan; upon attaining human form, they pledge 10,000 strings of cash. Those born in the *chen* hour have as their original destiny Li Wenliang; upon attaining human form, they pledge 5,400 strings of cash. Those born in the *si* hour have as their original destiny Cao Jiao; upon attaining human form, they pledge 1,000 strings of cash. Those born in the *wu* hour have as their original destiny Zhang Si; upon attaining human form, they pledge 9,000 strings of cash. Those born in the *wei* hour have as their original destiny Sun Gong; upon attaining human form, they pledge 4,000 strings of cash. Those born in the *shen* hour have as their original destiny Du Zhun; upon attaining human form, they pledge 8,000 strings of cash. Those born in the *you* hour have as their original destiny Tian Jiaoyou; upon attaining human form, they pledge 5,000 strings of cash. Those born in the *xu* hour have as their original destiny Cui Jianjin; upon attaining human form, they pledge 5,000 strings of cash. Those born in the *hai* hour have as their original destiny Wang Shuang; upon attaining human form, they pledge 6,000 strings of cash.\n\nAt that time, the Heavenly Worthy addressed the fourfold assembly, saying: \"If there are faithful men and women who delight in the scriptural Dharma, and who, in accordance with this sutra, establish ritual precincts, prepare incense and flowers, adorn with lamps and candles, and make offerings to the Three Treasures of the Great Dao and the Perfected Sages, performing the six periods of ritual circumambulation, reciting the sutra ten times, observing fasts and holding jiao rites—if they duly prepare the full amount of their 'life-receiving money' and the pledged wealth of their original destiny, clearly itemizing each, and present a memorial petition to burn and return it to their respective treasury, they shall in this very life obtain blessings, honor, and noble karmic rewards, and in future lives forever be free from suffering and hardship. If there are beings who disbelieve in these karmic conditions and instead generate evil karma, once they descend into the Nine Springs, if they do not fully confess, they shall endure the retributions of suffering and joy in the cycle of birth and death. You, great assembly, should each reflect and take heed.\"\n\nThen, the Perfected One of Resplendent and Wondrous Sound, together with the assembled immortals, the North Emperor of Fengdu, the Underworld Officials of Yama, the clerks of the Treasury of Life-Receiving Destiny, the original destinies of each, and all present in the assembly, bowed their heads in reverence, gazed upon the honored countenance, prostrated, and withdrew.\n\nThereupon, the Perfected One of Resplendent and Wondrous Sound transmitted the teaching to the world, delivering the living and the deceased, praising and propagating it with joy. All received and upheld it with faith.\n\n*The Sutra of the Treasury of Life-Receiving Destiny, Spoken by the Numinous Treasure Heavenly Worthy, is now complete.*",
      "overlap_context": "of the Treasury of Life-Receiving Destiny, which aligns with the registers of the dark offices.\"\n\nThe Perfected One said: \"I have not yet understood the names, positions, and amounts of money associated with these original destinies. I again beseech your compassion to fully expound upon them.\"\n\nThe Heavenly Worthy smiled and replied: \"Excellent. You should strive to act for the sake of all beings. I shall now further expound upon the names and amounts of money for the twelve original destinies.\"",
      "start_char": 1239,
      "end_char": 1782,
      "start_sentence": 54,
      "end_sentence": 71,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.11441731452942,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\灵宝天尊说禄库受生经.txt",
        "category": "本文类"
      }
    }
  ]
}