{
  "source_id": "灵宝毕法",
  "source_file": "chunked_daozang\\灵宝毕法.json",
  "total_chunks": 14,
  "total_original_chars": 17573,
  "total_translated_chars": 103102,
  "total_translation_time": 487.9608623981476,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\灵宝毕法.txt",
    "category": "藏外"
  },
  "full_translation": "**Preface to *The Complete Methods of the Numinous Treasure* by Zhongli Quan, Perfected of True Yang, styled Yunfang**\n\nThe Dao cannot be transmitted through words, nor can it be recorded by name. Since ancient times, those who ascended as immortals and attained the Dao have been many. I, in admiration of the former worthies, have long cherished the Great Dao in my heart. Yet unexpectedly, the age turned to warfare, and in perilous times, I first fled for survival, taking refuge in rivers and lakes, mountains and valleys. Retreating thus, I came to know my nature, and my mind dwelled only in purity, stillness, and the formless.\n\nI perused the alchemical classics and repeatedly consulted fellow Daoists, yet they spoke only of minor arts for nourishing life, never of the great Dao of true immortality. Then, within the stone cliffs of Mount Zhongnan, I obtained the *Scriptures of the Numinous Treasure* in thirty scrolls: the upper section, *The Golden Declarations*, composed by the Primordial Beginning; the middle section, *The Jade Record*, expounded by the Primordial Sovereign; and the lower section, *The True Source of Principle*, transmitted by the Most High. Together, they comprise several thousand words.\n\nI rose early and ate late, pondering deeply, and at last awakened to the truth: within yin there is yang, and within yang there is yin—this is the proper ascent and descent of Heaven and Earth. Qi generates water, and water generates qi—this is the principle of the union of heart and kidney. Comparing these phenomena, one sees that the Dao is not far from humanity.\n\nBy harmonizing *jia* and *geng*, one verifies the precision of the Golden Elixir; by adjusting *mao* and *you*, the fire timing naturally becomes flawless. Red lead and black lead, when exhausted, do not form the great medicine; only golden fluid and jade fluid, at their culmination, are the Returned Elixir. From non-being to being, one must harbor the resolve for struggle; from below to above, one gradually enters the realm of the formless and silent.\n\nDrawing out lead and mercury, one causes the dissipation of the two eights of yin; refining the bones and tempering the form, one allows the growth of the nine threes of yang. The clarity or turbidity of the water’s source is discerned at the moment of completion; the true emptiness of the inner vision is recognized on the day of seated forgetfulness. The mysterious mechanism and profound subtleties are difficult to fully express in written form; the wondrous principles of the Numinous Treasure may be employed to transcend the mundane and enter sagehood.\n\nCompiling these into the three vehicles’ methods, I name them *The Complete Methods of the Numinous Treasure*. The sacred words of the Great Dao must not be hoarded by one alone. I transmit them to Lü Dongbin; when the Dao is achieved, do not conceal them, but bequeath them to later scholars.\n\n---\n\n**Volume One: Lesser Vehicle Methods for Peace, Bliss, and Longevity**\n**Four Gates**\n**First Gate: The Union of Yin and Yang**\n\n*The Jade Record* states: “The Great Dao is formless; sight and hearing cannot perceive it. The Great Dao is nameless; calculations and measures cannot fathom it. It gives rise to form through the Dao, and names are established based on form. The greatest of names are Heaven and Earth. Heaven attains the Dao of *qian* and accumulates qi to cover below; Earth attains the Dao of *kun* and bears substance to support above. Between the covering and bearing, the distance between above and below is eighty-four thousand *li*. Qi and substance cannot interact, so Heaven seeks *kun* within Earth, and its yang, bearing yin, ascends; Earth seeks *qian* within Heaven, and its yin, embracing yang, descends. This ascent and descent, circulating through the Dao, is why Heaven and Earth endure.”\n\n*The True Source* states: “Between Heaven and Earth, that which is close to above is yang; from above downward forty-two thousand *li* is called the yang position. That which is close to below is yin; from below upward forty-two thousand *li* is called the yin position. Once form and name exist, they cannot escape measurement. Consider a year: it consists of four seasons, eight nodes, twenty-four qi, seventy-two pentads, three hundred sixty days, and four thousand three hundred twenty hours. Twelve hours make a day, five days make a pentad, three pentads make a qi, three qi make a node, two nodes make a season, and four seasons make a year.\n\nA year begins with the Winter Solstice node. At this time, yang ascends from within Earth. Each qi lasts fifteen days, rising seven thousand *li*; three qi make a node, forty-five days in total, with yang ascending twenty-one thousand *li*. Two nodes make a season, ninety days in total, with yang ascending forty-two thousand *li*, reaching precisely the center of Heaven and Earth, where yang meets the yin position. At this time, yin contains half yang, its qi is warm, and the season corresponds to the Spring Equinox node.\n\nBeyond this, yang continues to ascend into the yang position, now said to ‘attain qi and rise.’ Similarly, after forty-five days comes the Beginning of Summer. After another forty-five days, the Summer Solstice arrives. At the Summer Solstice node, yang has ascended a total of eighty-four thousand *li* to reach Heaven, where yang contains yang, its qi is hot, and accumulated yang generates yin—one yin arises within two yangs.\n\nBeginning with the Summer Solstice node, yin descends from within Heaven. Each qi lasts fifteen days, descending seven thousand *li*; three qi make a node, forty-five days in total, with yin descending twenty-one thousand *li*. Two nodes make a season, ninety days in total, with yin descending forty-two thousand *li*, reaching the center of Heaven and Earth, where yin meets the yang position. At this time, yang contains half yin, its qi is cool, and the season corresponds to the Autumn Equinox node.\n\nBeyond this, yin continues to descend into the yin position, now said to ‘attain qi and descend.’ Similarly, after forty-five days comes the Beginning of Winter. After another forty-five days, the Winter Solstice arrives. At the Winter Solstice node, yin has descended a total of eighty-four thousand *li* to reach Earth, where yin contains yin, its qi is cold, and accumulated yin generates yang—one yang arises within two yins.\n\nAfter the Winter Solstice, one yang is reborn, and the cycle continues without cease, ever returning to the Dao. At the Winter Solstice, yang is born, ascending to return to Heaven; at the Summer Solstice, yin is born, descending to return to Earth. When yang ascends to Heaven at the Summer Solstice, one yin arrives; when yin descends to Earth at the Winter Solstice, one yang arrives—hence the terms Summer Solstice and Winter Solstice.\n\nYang ascends above, passing the Spring Equinox to enter the yang position, departing from the yin position; yin descends below, passing the Autumn Equinox to enter the yin position, departing from the yang position—hence the terms Spring Equinox and Autumn Equinox.”\n\nAfter the Winter Solstice, as yang ascends from above downward, it is not that yin does not descend—what descends is merely the residual yin within yang, dissipating only within the yang position. Even if it descends to its proper place and encounters ascending yang, its qi is already exhausted. After the Summer Solstice, as yin descends from below upward, it is not that yang does not ascend—what ascends is merely the residual yang within yin, dissipating only within the yin position. Even if it ascends to its proper place and encounters descending yin, its qi is already exhausted.\n\nThe ascent and descent of yin and yang, above and below, do not exceed eighty-four thousand *li*, and their comings and goings cannot escape the three hundred and sixty days. Through the four qi of warmth, coolness, cold, and heat, one discerns yin and yang; through the eight nodes of yang ascending and yin descending, one understands Heaven and Earth. Measuring with the mechanism of Heaven, one may grasp the remnants of the Heavenly Dao. If one relies on mere hearsay to weigh the Dao of Heaven and Earth, how can one calculate and comprehend it?\n\nThe *Analogy* states: The Dao gives birth to the myriad things, and among them, Heaven and Earth are the greatest, while humans are the most spiritually endowed. Seeking the Dao separately, humans are akin to Heaven and Earth—compare the heart to Heaven, the kidneys to Earth; the liver is the yang position, the lungs the yin position. The distance between heart and kidneys is eight *cun* and four *fen*, which mirrors the space between Heaven’s covering and Earth’s bearing. Qi corresponds to yang, and fluids correspond to yin. The *zi* and *wu* hours correspond to the Summer Solstice and Winter Solstice; the *mao* and *you* hours correspond to the Spring Equinox and Autumn Equinox. One day is likened to one year. Using the eight trigrams within a day, the hours correspond to the eight nodes. At the *zi* hour, qi is born in the kidneys; at the *mao* hour, qi reaches the liver—the liver is yang, its qi flourishes, and yang ascends to enter the yang position, corresponding to the Spring Equinox. At the *wu* hour, qi reaches the heart, and accumulated qi generates fluids, corresponding to the Summer Solstice when yang ascends to Heaven and yin is born. At the *wu* hour, fluids are born in the heart; at the *you* hour, fluids reach the lungs—the lungs are yin, their fluids abound, and yin descends to enter the yin position, corresponding to the Autumn Equinox. At the *zi* hour, fluids reach the kidneys, and accumulated fluids generate qi, corresponding to the Winter Solstice when yin descends to Earth and yang is born. Revolving and returning, day and night circulate without loss or depletion, naturally prolonging life.\n\nThe *True Formula* states: The Dao of Heaven and Earth is grasped in one attainment, yet humans, shaped by their parents, generate form within form, drifting ever farther from the Dao. After the primordial qi of the embryo is sufficient, the six desires and seven emotions dissipate original yang, scattering true qi. Though natural qi and fluids generate one another, they do not ascend and descend like those of Heaven and Earth. With each exhalation, original qi departs; with each inhalation, original qi enters, connecting with the qi of Heaven and Earth. Yet once entered, it cannot be retained—following the exhalation, it departs again. The qi of one’s own palace is instead seized by Heaven and Earth. Thus, scattered qi struggles to generate fluids, and scant fluids struggle to generate qi. When qi is abundant, employ the *ding* trigram daily: for qi, inhale more and exhale less, forcibly retaining it in the abdomen. At that time, what ascends from below does not depart, and what enters from outside temporarily abides. The two qi converge, accumulating to generate the fluids of the five viscera, replenishing the origin ever more. Through daily accumulation, cease only upon seeing results.\n\nThe *Essentials of the Dao* states: To meet the eldest son of yang, one must inhale more and exhale less. Let the children contend, and after the time has passed, seek the true. This is the method of accumulating qi to generate fluids, accumulating fluids to generate qi, and harmonizing the mutual generation of qi and fluids. Practicing for no more than a year, seize the achievement with three hundred days as the term. Within ten days, one sees results: appetite improves, illnesses vanish, the head and eyes clear, the heart and abdomen feel light and unburdened, strength increases, fatigue lessens, and within the abdomen, the sound of wind and thunder is sometimes heard. Further effects are too numerous to record.\n\nThe *Explanation* states: The eldest son of yang is when *qian* seeks from *kun*, like qi ascending upward. The \"child\" is qi, ascending from the kidneys; the \"daughter\" is fluids, descending from the heart. Their contention arises from the ascent and descent of children. By restraining qi, fluids are generated; by accumulating fluids, qi is generated. Harmonizing the two, after the time has passed, one attains true water.\n\nThe *True Explanation* states: This is the initial step—during the *mao* trigram, when yang ascends and qi flourishes, inhale more of Heaven and Earth’s true qi and exhale less of one’s own original qi, allowing the two qi to converge. Qi accumulates to generate fluids, and abundant fluids generate qi—this is the method of harmonizing yin and yang, the mutual generation of qi and fluids.\n\n**Gathering and Dispersing Water and Fire, Second**\n\nThe *Golden Edict* states: The so-called Great Dao is lofty without superior. Looking up to observe it, above it there is no above—its beginning cannot be seen. The so-called Great Dao is lowly without inferior. Looking down to examine it, below it there is no below—its foundation cannot be seen. It begins without precedence—its front cannot be seen; it ends without exhaustion—its rear cannot be seen. Within the Great Dao, Heaven and Earth are born. Heaven and Earth possess the forms of high and low; within Heaven and Earth, yin and yang exist, and yin and yang possess the numbers of beginning and end. One ascends, one descends—looking up and down, one may gauge its mechanism. One begins, one ends—measuring and calculating, one may grasp its principle. By this, the Great Dao can be known.\n\nThe *True Source* states: From the positions of Heaven and Earth above and below, one knows the height and lowness of Heaven and Earth; from the periods of yin and yang’s beginning and end, one knows the before and after of the Heavenly Dao. Heaven and Earth do not depart from numbers, and numbers conclude in one year. Yin and yang do not lose their proper timing, and their timing divides at the eight nodes. When the first yang is born, at the Spring Equinox, yang is half within yin. Beyond this, pure yang prevails and yin is exhausted. At the Summer Solstice, yang reaches the Supreme Ultimate, and one yin is born. At the Autumn Equinox, yin is half within yang. Beyond this, pure yin prevails and yang is exhausted. At the Winter Solstice, yin reaches the Supreme Ultimate, and one yang is born. Ascending and descending as before, above and below, beginning and end—though one cannot fully exhaust the Great Dao, one does not lose its essence. To understand the Great Dao, one must model it on Heaven and Earth and examine the proper timing of yin and yang.\n\nThe *Simile* states: Compare heart and kidney to Heaven and Earth, qi and fluids to yin and yang, and one day to one year. In daily practice, the *Gen* hexagram corresponds to one year, applied at the *Lichun* (Beginning of Spring) solar term, while the *Qian* hexagram corresponds to one year, applied at the *Lidong* (Beginning of Winter) solar term.\n\nAt the center of Heaven and Earth, that which inclines toward the lower is yin. From below upward, forty-two thousand *li* marks the yin position. At the Winter Solstice, yang is born and ascends; when the time reaches *Lichun*, yang has risen twenty-one thousand *li* within the yin position—this is when yang struggles to overcome yin. At the center of Heaven and Earth, that which inclines toward the upper is yang. From above downward, forty-two thousand *li* marks the yang position. At the Summer Solstice, yin is born and descends; when the time reaches *Liqiu* (Beginning of Autumn), yin has descended twenty-one thousand *li* within the yang position—this is when yin struggles to overcome yang.\n\nWhen the time reaches *Lixia* (Beginning of Summer), yang ascends to its peak, sixty-three thousand *li* from the earth and twenty-one thousand *li* from Heaven—this is when yang attains its proper position and yin is extinguished. When the time reaches *Lidong*, yin descends to its peak, sixty-three thousand *li* from Heaven and twenty-one thousand *li* from the earth—this is when yin attains its proper position and yang is extinguished.\n\nWithin one year, *Lichun* corresponds to a moment in a single day, represented by the *Gen* hexagram. At this time, kidney qi descends to the bladder, weak within the fluids—this is when yang qi struggles to ascend. Within one year, *Lidong* corresponds to a moment in a single day, represented by the *Qian* hexagram. At this time, heart fluids descend and prepare to return to their origin, re-entering the kidneys—this is when yin prevails and yang is extinguished.\n\nThe cause of human illness lies solely in the disharmony of yin and yang, where yang is weak and yin excessive—thus, illness is frequent. The *True Formula* states: At *Lichun*, yang ascends from below upward, and in no time, yang is half within yin. At *Lidong*, yin descends from above downward, and in no time, yin is half within yang. The Dao of Heaven and Earth is thus. Only humans, when the qi of the *Gen* hexagram is faint, fail to recognize the method of nurturing qi; when the qi of the *Qian* hexagram scatters, they do not understand the principle of gathering qi. Day and night, the six desires and seven emotions deplete original yang, causing true qi to wane and scatter, preventing the generation of true fluids. Thus, one cannot attain the longevity of Heaven and Earth. Therefore, the ancients practiced the *Zhun* and *Meng* hexagrams daily, achieving long life in the world.\n\n*Morning Zhun* takes the meaning of one yang lying below, bent and not yet extended. For oneself, one nurtures and extends it, preventing its dissipation. *Evening Meng* takes the meaning of a child seeking enlightenment from me, turning from darkness to light—this is the principle of yin seeking yang. For oneself, one transforms obscurity into clarity, preventing the loss of yang.\n\nThus, at sunrise, when the *Gen* hexagram is in effect, one should nurture original qi. Do not let profit and fame disturb the heart, nor likes and dislikes interfere with the mind. One should don clothes and sit in stillness to cultivate qi, eliminating thoughts and forgetting emotions. Gently perform *daoyin*, alternately stretching and contracting the hands and feet three to five times, so that the qi of the four limbs arises evenly. Internally, preserve original qi as it ascends to the heart palace. Swallow saliva once or twice, and rub the face twenty to thirty times. The *He* (Yellow River) flows all night, damming up turbid and foul qi. Over time, the complexion becomes lustrous, the skin radiant.\n\nAt sunset, when the *Qian* hexagram is in effect, one should gather original qi. Enter a quiet chamber and sit in stillness. Swallow qi and retract the external kidneys. Swallowing qi draws heart fire downward; retracting the external kidneys gathers bladder qi inward. This unites the fire of kidney qi above and below, merging the three fires into one to warm and supplement the lower *dantian*. Without fluids, gather qi to generate fluids; with fluids, burn fluids to generate qi. This is called *gathering fire*, also known as *Taiyi containing true qi*.\n\nIn the early morning, swallowing saliva and rubbing the face, alternately stretching and contracting the hands and feet slightly, is called *dispersing fire*, also known as *minor refinement of form*.\n\nThe *Essentials of the Dao* states:\n*When flowers wither and leaves fall in late autumn,*\n*The jade-like person grows weary of ascending the high tower.*\n*To harmonize ruler and people,*\n*One must frequently swallow after feasting and gather inward.*\n\nThis means drawing heart qi downward and gathering bladder qi to prevent dissipation, uniting them with kidney qi to connect with the newly generated qi in the *Kan* hexagram’s sea of qi. One must begin at *Lidong* and continue until results are verified, practicing for no more than a year, with the goal set at three hundred days. Within ten days, results appear: the complexion becomes lustrous, the skin plump and radiant, the lower *dantian* warm, urination reduced, the four limbs light and strong, the spirit clear and refreshed, chronic and long-standing illnesses all vanish.\n\nIf one cherishes time and practices diligently, even within the *matching yin and yang* practice, slight results may appear. Incorporate this method, adding the *Gen* hexagram to daily practice, and briefly apply this technique. When the three origins of the *Qian* hexagram take effect, cease upon verification.\n\nExplanation: *\"When flowers wither and leaves fall in late autumn\"* describes a person whose qi is weak. At sunset, yang qi scatters and fails to ascend—hence, *\"grows weary of ascending the high tower.\"* The *tower* refers to the twelve-storied tower (the throat). The heart is the ruler fire, the bladder the people’s fire. Swallowing qi and retracting the external kidneys unites heart and external kidney qi into one—hence, *\"harmonize.\"* *Feasting* means swallowing; *gathering* means retracting. The morning practice is the foundation of this method.\n\nTrue Explanation: The *Gen* hexagram’s yang qi is faint, so one gently performs *daoyin*, stretching and contracting, swallowing saliva and rubbing the face to disperse fire throughout the four limbs and nurture original qi. The *Qian* hexagram’s yang qi scatters, so one swallows heart qi and retracts the external kidneys to unite kidney qi, merging the three fires into one to gather original qi. This is called *\"gathering and dispersing water and fire,\"* strengthening the root. *Third: The Union of Dragon and Tiger.*\n\nThe *Jin Gao* states: At the primal division of the Great Origin, there arose the Supreme Beginning. Within the Supreme Beginning lay the Supreme Nonbeing; within the Supreme Nonbeing lay the Supreme Void; within the Supreme Void lay the Supreme Emptiness; and within the Supreme Emptiness lay the Supreme Substance. This Supreme Substance was the pure and turbid essence of Heaven and Earth. Its form resembled an egg, its color dark and yellow—merely a single entity within the Supreme Emptiness. When yang ascends to Heaven, at the Supreme Ultimate it generates yin, which, in profound obscurity, embraces yang and descends. When yin descends to Earth, at the Supreme Ultimate it generates yang, which, in boundless vagueness, bears yin and ascends. With each cycle of descent and ascent, yin descends and yang ascends; thus Heaven and Earth enact the Dao, and the myriad things are born and completed.\n\nThe *Zhen Yuan* states: Heaven is like an overturned basin, and when yang reaches it, ascent becomes difficult. Earth is like a slab of stone, and when yin reaches it, entry becomes difficult. At the winter solstice, yang within the Earth ascends; when it reaches Heaven at the summer solstice, its yang attains the Supreme Ultimate and yin is born. The reason yin is born is that yang arises from within yin, emerging from the Earth in a state of indistinct vagueness—qi containing water, though this water has no form. When the summer solstice reaches Heaven, accumulated qi transforms into water; this is called *\"yang attains the Supreme Ultimate and yin is born.\"* At the summer solstice, yin within Heaven descends; when it reaches Earth at the winter solstice, its yin attains the Supreme Ultimate and yang is born. The reason yang is born is that yin arises from within yang, issuing from Heaven in profound obscurity—water containing qi, though this qi has no form. When the winter solstice reaches Earth, accumulated water generates qi; this is called *\"yin attains the Supreme Ultimate and yang is born.\"*\n\nThe *Bi Yu* states: Compare the body’s exterior to the Supreme Emptiness, the heart and kidneys to Heaven and Earth, qi and fluids to yin and yang, and the hours of *zi* and *wu* to winter and summer. The *zi* hour corresponds to the *Kan* hexagram, when qi is born within the kidneys; the *wu* hour corresponds to the *Li* hexagram, when fluids are born within the heart. When kidney qi reaches the heart, it unites with heart qi, and at the Supreme Ultimate, fluids are generated. The reason fluids are generated is that qi arises from within the kidneys—qi containing true water, though this water has no form. When the *Li* hexagram reaches the heart and joins with heart qi, the Supreme Ultimate thus generates fluids. When heart fluids reach the kidneys and join with kidney water, the Supreme Ultimate once more generates qi. The reason qi is generated is that fluids arise from within the heart—fluids containing true qi, though this qi has no form. When the *Kan* hexagram reaches the kidneys and joins with kidney water, the Supreme Ultimate thus generates qi. This may be likened to yang ascending and yin descending, reaching the Supreme Ultimate and generating one another. The yin and yang thus born contain water within yang and qi within yin.\n\nThe *Zhen Jue* states: Qi is born within the kidneys, and within this qi lies true water. Fluids are born within the heart, and within these fluids lies true qi. True water and true qi are the true Dragon and true Tiger. When yang reaches Heaven and ascent becomes difficult, the Supreme Ultimate generates yin; when yin reaches Earth and entry becomes difficult, the Supreme Ultimate generates yang—such is the principle of Heaven and Earth. Humans cannot compare to Heaven and Earth because the six desires and seven emotions, stirred by external things, scatter their original yang and dissipate their true qi. When kidney qi reaches the heart at the *Li* hexagram, the spirit and consciousness settle inwardly; the breath enters lightly and exits slowly, continuous as if present. Saliva fills the mouth and is swallowed, naturally uniting kidney qi with heart qi, and at the Supreme Ultimate, fluids are generated. When heart fluids reach the kidneys at the *Kan* hexagram and join with kidney water, heart fluids naturally unite with kidney qi, and at the Supreme Ultimate, qi is generated. As true qi clings to fluids and true water clings to qi, they are inherently united. Thus, fluids contain true qi and qi contains true water. When they mutually unite and descend in mutual embrace, this is called the *Union of Dragon and Tiger*. If the firing times are without error and the withdrawal and addition are appropriate, after three hundred days the true embryo is nurtured, and the Great Medicine is formed—this is the foundation of refining the body, burning the form, ascending to the origin, and transcending.\n\nThe *Dao Yao* states: When the primal qi first returns to the original movement, true yang is about to reach the *Li* Palace. Seize the true Dragon and true Tiger, and the Jade Pool’s spring waters flow abundantly. This is to prevent the leakage of original qi and the loss of true water beyond the body. If qi scatters, fluids are difficult to generate; if fluids are scant, there is no true qi. Without the union of qi and water, how can the Great Medicine be formed? During this year, use the months, beginning with the winter solstice; during the day, use the hours, awaiting the *Li* hexagram. For those who embrace the Dao in later years, whose root and origin are unstable, who assess their depletion and insufficiency of qi, ten years of depletion require one year of practice to replenish—this is called *Gathering and Replenishing the Cinnabar*. If the replenishment exceeds the required measure, cease this method and practice *Water and Fire Mutually Assisting*, which can prolong life and extend years—this is called the *Human Immortal*, and its efficacy cannot be fully recounted. If the replenishment is sufficient, sweet saliva will fill the mouth, the heart’s realm will be naturally cleared, desires and emotions will not stir, the hundred bones will be free of illness, and the spirit’s radiance will spontaneously appear in darkness, the eyes flashing like lightning. Beginning with the winter solstice, carefully regulate the method for three hundred days to release the true embryo—this is called the *Embryo Immortal*.\n\nExplanation: Externally, the *wu* hour corresponds to the *Li* hexagram, the sun to true yang; within the person, the heart is the *Li* Palace, and original yang is the true Dragon. The true Tiger is the water within kidney qi; the true Dragon is the qi within heart fluids. The mouth is the Jade Pool, and saliva is the spring waters.\n\nDirect Explanation: When the primal qi first returns to the original movement, take the winter solstice as the beginning—this is the *zi* month. When true yang is about to reach the *Li* Palace, await the *Li* hexagram—this is the *wu* hour. The true Dragon is the qi within heart fluids; the true Tiger is the water within kidney qi. When qi and water unite, this is called the *Union of Dragon and Tiger*.\n\n*Refining the Cinnabar Medicine, Fourth*\n\nThe *Jin Gao* states: Heaven and Earth are the forms of the Great Dao; yin and yang are the qi of the Great Dao. Cold, heat, warmth, and coolness—within form lies qi...\n\nClouds, mist, rain, and dew are the images within qi. Earth’s qi ascends, rising to become clouds and dispersing to become rain; heaven’s qi descends, scattering into mist and condensing into dew. When accumulated yin exceeds, dew transforms into rain, frost, or snow; when accumulated yang exceeds, mist turns into haze, clouds, or rosy dawn. When yang lies hidden within yin and yang qi fails to ascend, striking and clashing produce thunder and lightning; when yin lies hidden within yang and yin qi fails to descend, congealing and solidifying produce hail and graupel. When yin and yang fail to harmonize, their opposition generates lightning; when yin and yang are mismatched, their chaotic union produces rainbows and secondary rainbows. Accumulated true yang forms spirits, which adorn the heavens as stars; accumulated true yin forms shapes, which strengthen the earth as soil and stone. The greatest of stars are the sun and moon; the most precious of soil and stone are metals and jades. Yin and yang manifest in form as the sun and moon above and metals and jades below.\n\n*The True Source* states: Yin cannot generate without yang; yang cannot complete without yin. Accumulated yang spirits adorn the heavens, and the greatest among them are the sun and moon—the sun and moon are true yang, yet they require true yin to achieve completion. Accumulated yin shapes strengthen the earth, and the most precious among them are metals and jades—metals and jades are true yin, yet they require true yang to be generated.\n\n*The Analogy* states: True yang is likened to the true qi within heart fluids; true yin is likened to the true water within kidney qi. True water cannot generate without true qi; true qi cannot complete without true water. True water and true qi, akin to the *Li* hexagram, harmonize between the heart above and the lungs below, like a mother’s love for her child or a husband’s affection for his wife. From *Li* to *Dui*, when the *Dui* hexagram’s yin flourishes and yang weakens, it is like the moon’s last quarter or metals and jades hidden in darkness—useless at this time. The sun and moon complete yang with yin, and when their measure is full, brightness is born; metals and jades generate yin with yang, and when their qi is sufficient, they become treasures. Metals and jades become treasures because their qi is sufficient and further refined by yang; the sun and moon generate brightness because their measure is full and they receive the soul. This is likened to the *Qian* hexagram’s advancing fire, refining yang without decline, adding to the fire’s measure so that yang is perpetually born.\n\n*The True Formula* states: When the Dragon and Tiger unite in the *Li* hexagram, it is called *Gathering the Medicine*. When the time arrives at the *Qian* hexagram, qi and fluids are about to return to their origin, emerging above the bladder, below the spleen and stomach, before the kidneys, behind the navel, to the left of the liver, to the right of the lungs, to the right of the small intestine, and to the left of the large intestine. At this time, spleen qi flourishes and lung qi is abundant, while heart qi ceases and liver qi weakens. True qi originally arrives through union with yang qi, but when yang qi weakens, true qi has nothing to cling to, and efforts are in vain. All gatherings must occur at this moment: guard the spirit within, breathe softly through the nose, and gently contract the abdomen. When warmth is felt near the navel and kidneys, slightly relax the contraction; if the abdomen and navel remain cool, tighten it. Once warmth is achieved, maintain consistency, follow your intent, and fill the cosmos—this is called *Restraining the Yang Gate to Refine the Cinnabar Medicine*. Prevent qi from ascending to secure true water, guide it through the spleen palace, and with each breath, transport it to the *Ming* palace and the Yellow Court. As qi and fluids transform, they become essence; essence transforms into pearls, pearls into mercury, mercury into cinnabar, and cinnabar into gold—this is called the *Golden Elixir*, and its merit is no small matter.\n\n*The Essentials of the Dao* states: Gathering the medicine relies on the Jade Hare; achieving union depends on the Yellow Matron. When they meet in Yongzhou, a melody of yang is played. This is the daily practice of gathering medicine, a method to restore the ten losses of later years with one supplement—this technique is called *Refining Mercury to Supplement the Cinnabar Field*. Once the supplement’s measure is full, one should only gather medicine in the *Li* hexagram and refine it in the *Qian* hexagram by restraining the Yang Gate. In spring and winter, gather more and refine less—*Qian* as one and *Li* as two, doubling the effort. In autumn and summer, gather less and refine more—*Li* as one and *Qian* as two, doubling the effort. Follow the seasons and months when qi flourishes, and the efficacy of gathering and refining will precede you, extending years and abiding in the world as a human immortal. If the supplement’s measure is already full and progress is evident, proceed with caution. After one hundred days of gathering medicine, the medicine’s power is complete; after two hundred days, the sacred embryo is firm; after three hundred days, true qi is born, and the embryo immortal is perfected. Only when the medicine’s power is complete should fire be advanced and measures increased—this is called *Fire Timing*. After the sacred embryo is firm, increase the fire timing to the measure of the Small Celestial Cycle—this is called the *Small Celestial Cycle*. Once the embryo is rounded and true qi is born, increase the fire timing to the measure of the Great Celestial Cycle—this is called the *Celestial Fire Timing*. Gathering medicine unites the Dragon and Tiger; refining medicine advances the fire—only then does one enter the Dao. One must retreat to seclusion, focus inwardly, prevent inner visions from leaking out, and block outer distractions from entering. Like a woman nurturing a fetus or a dragon tending its pearl, even in eating, sleeping, speaking, or silence, one should act like an infant or a maiden, ever cautious of loss or harm, with the heart never straying from the Dao for even a moment.\n\n*Explanation*: The medicine is the true qi within the heart; the hare is the true water within the kidneys; the Yellow Matron is the true fluids within the spleen. They harmonize qi and water to enter the Yellow Court. Yongzhou is the *Qian* hexagram. Restraining the Yang Gate refers to the flanks and abdomen.\n\nThe four gates of the lesser vehicle pertain to human immortals.\n\n**Middle Scroll: The Middle Vehicle’s Three Gates of Longevity and Deathlessness**\n*Flying Golden Essence Behind the Elbow, Fifth*\n\n*The Jin Gao* states: The ascent and descent of yin and yang do not exceed the bounds of heaven and earth; the revolutions of the sun and moon occur beyond heaven and earth. Their rising and setting in the east and west divide day and night; their coming and going in the south and north determine cold and heat. Day and night do not cease; cold and heat alternate. Accumulated days form months; accumulated months form years.\n\nThe accumulation of days into months arises from the soul residing within the lunar essence and the lunar essence residing within the soul. The accumulation of months into years arises from the *lü* tones emerging within the *lü* and the *lü* tones emerging within the *lü*. The movements of the sun and moon align with the mechanism of heaven and earth, never departing from the numerical principles of *Qian* and *Kun*. Though the generation of the myriad things depends on yin and yang, their transformation also relies on daily celestial motions.\n\n*The True Source* states: The form of heaven and earth resembles an egg, and within the six directions, its roundness is like a sphere. The rising and setting of the sun and moon occur above one heaven and below one earth. Above and below, east and west, they revolve like a flying wheel. The sun rises in the east and sets in the west, traveling the Yang path; the moon rises in the west and sets in the east, traveling the Yin path. Within a single day, they divide day and night. After the winter solstice, the sun emerges from the south and moves northward; after the summer solstice, it emerges from the north and moves southward. The night of winter becomes the day of summer, and the night of summer becomes the day of winter. Within a single year, they determine cold and heat. The sun and moon each span 840 *li* in diameter. Four *chi* make one *bu*, and 360 *bu* make one *li*. Every eight *ke* and twenty *fen* constitute one *shi*, and twelve *shi* constitute one day. One month has thirty days, totaling 360 *shi*, which amounts to 3,000 *ke* and 180,000 *fen*.\n\nNow, the Yang travels through *Qian*, employing the number nine, while the Yin travels through *Kun*, employing the number six. The soul emerges within the lunar essence at dawn, but since nine does not pair with six, the soul begins to grow within the lunar essence only after three days. In one day and night, comprising 100 *ke* and sixty *fen*, the soul advances seventy *li* within the lunar essence. Over six days and nights, it advances 420 *li*, at which point the soul fills half the lunar essence—this is called the first quarter. After another six days and nights, advancing another 420 *li* (totaling 840 *li*), the soul completely fills the lunar essence, and Yang occupies the Yin position—this is called the full moon.\n\nBeginning on the sixteenth day, the lunar essence emerges within the soul. In one day and night, comprising 100 *ke* and sixty *fen*, the lunar essence advances seventy *li* within the soul. Over six days and nights, it advances 420 *li*, at which point the lunar essence fills half the soul—this is called the last quarter. After another six days and nights, advancing another 420 *li* (totaling 840 *li*), the lunar essence completely fills the soul, and Yin occupies the Yang position. Yet the moon still retains some light, for six does not exhaust nine, so three days later, the lunar essence fills the palace—this is called the dark moon.\n\nAfter the first day of the month, six gives rise to nine; before the dark moon, nine gives rise to six. Though the numbers are not yet exhausted, the next cycle begins in due course, accumulating days into months and months into years. In terms of the moon: the six *lü* and six *lü* tones begin with six, and when the numbers fill the six positions, six times six makes thirty-six—the complete number of Yin. In terms of the sun: five days make one *hou*, and seventy-two *hou* comprise the numbers eight and nine. At the double ninth, counting begins with nine, and when the numbers fill the six positions, six times nine makes fifty-four—the complete number of Yang. One six and one nine together make fifteen, and fifteen is the number of one *qi*. The twenty-four *qi* correspond to the eight nodes, revealing the proper ascent and descent of Yin and Yang. One six and one nine, multiplied by four, correspond to the four seasons. Each season yields ninety, and four times ninety makes 360. This transforms into 216 for Yang and 144 for Yin, totaling 360 and completing the celestial revolution.\n\n*The Analogy* states: The ascent and descent of Yin and Yang within heaven and earth resemble the method of harmonizing the qi and fluids of the heart and kidneys. The revolutions of the sun and moon beyond heaven and earth resemble the practice of *Flying Golden Essence Behind the Elbow*. The conjunction of the sun and moon resembles the method of advancing fire and reducing it. The ascent of Yang and descent of Yin are no different from the soul and lunar essence of the sun and moon; the alternation of the sun and moon is no different from the qi and fluids of the heart and kidneys.\n\nAfter the winter solstice, the sun rises at the *yi* position and sets at the *geng* position, with forty *ke* of daylight. Moving from south to north, over nine days it rises in the east and sets in the west, advancing sixty *fen* in total. At the spring equinox, day and night are equal, and by the summer solstice, daylight reaches sixty *ke*. After the summer solstice, the sun rises at the *jia* position and sets at the *xin* position, with sixty *ke* of daylight. Moving from north to south, over nine days it rises in the east and sets in the west, retreating sixty *fen* in total. At the autumn equinox, day and night are equal, and by the winter solstice, daylight returns to forty *ke*. The division of *ke* between day and night follows this pattern of advance and retreat from south to north.\n\nAfter the first day of the month, the soul emerges within the lunar essence over three days. By six days, they are balanced, and by another six days, the soul is complete—this employs the number nine. After the full moon, the lunar essence emerges within the soul. By six days, they are balanced, and by another six days, the lunar essence is complete—this employs the number six. The summer solstice of the year and the sixteenth day of the month correspond to the method of the *Li* hexagram in daily practice, which is the *wu* hour for humans. The winter solstice of the year and the first day of the month correspond to the method of the *Kan* hexagram in daily practice, which is the *zi* hour for humans.\n\nThe proper ascent and descent of Yin and Yang in heaven and earth, the principles governing the alternation of the soul and lunar essence in the sun and moon—these are all deduced through numbers, their conjunctions orderly and their revolutions without error. How could the qi and fluids of the human heart and kidneys, the soul and lunar essence of the liver and lungs, though regulated in daily practice, not require adjustments over months and years?\n\n*The True Formula* states: When Yang is born in the *Kan* hexagram, it corresponds to the true *zi* hour—neither beginning nor end—where the qi of the kidneys merges with the qi of the liver. Before the exchange, sit quietly in a still room, don your robe, assume the *yin* mudra, and sit cross-legged. Press down the liver with the lower abdomen, then rise slightly, thrusting the chest forward while gently tilting the head back. Close the double gates of the spine, slightly flap the elbows one or two times, stretch the waist, and from the *Weilü* point, let the fire-like sensation rise from the waist, gathering at the spine. Take care not to open the gates; soon, the heat will intensify, and the qi will strengthen. Gradually open the gates of the spine, allowing the qi to pass through. Then tilt the head back sharply to close the upper gate, taking care not to open it. The heat will become extreme, and the qi will strengthen further. Gradually open the gate to let the qi enter the crown, replenishing the sea of marrow in the *Niwan* palace. Only when the body can withstand cold and heat is the foundation of longevity established.\n\nNext, employ the method of returning the elixir. As before, thrust the chest forward and stretch the waist, close the double gates of the spine, then crouch and extend. If the fire in the waist does not rise, sit in stillness and inwardly observe. Repeat the method until the fire arises to the required degree. Begin at the *chou* hour and continue until the end of the *yin* hour, at which point one may stop. This is called \"flying golden essence behind the elbows,\" also known as \"drawing lead,\" whereby the qi of the kidneys generates the qi of the liver.\n\nMoreover, the human spine consists of twenty-four vertebrae. From the bottom upward, the first three correspond to the internal kidneys. From the top downward, the first three are called the \"Pillar of Heaven.\" Above the Pillar of Heaven lies the \"Jade Capital.\" Below the Pillar of Heaven, opposite the internal kidneys and above the *Weilü* point, are eighteen vertebrae. Among these, the middle section is called the \"double gates,\" with nine above and nine below. One must stabilize for one hundred days until the qi traverses all eighteen vertebrae and enters the *Niwan* palace. This must be practiced during the first yang hour, under the *Kan* trigram. This is called \"flying golden essence behind the elbows.\" Under the *Li* trigram, one gathers the medicine; under the *Qian* trigram, one advances the fire to refine the medicine and restrains the yang gate. Only then, after one hundred days, does the golden essence fly into the brain. With a single thrust through the three gates, it enters the upper palace of *Niwan*.\n\nBeginning with the *Kan* trigram, the practice continues until the *Gen* trigram. Under the *Li* trigram, one gathers the medicine, uniting the qi of the heart and kidneys, whereby the qi of the liver naturally arises from the qi of the heart. When the two qi become purely yang, the two eights of yin dissolve. Steaming upward into the lungs, the lung fluid descends, enveloping the true qi. Daily, a grain of millet in size enters the Yellow Court—this is called the material of the inner elixir. Only after one hundred days without error is the medicinal power complete.\n\nWhen gathering medicine under the *Li* trigram, observe the timing inwardly with even greater precision. When advancing the fire under the *Qian* trigram to refine the medicine and restrain the yang gate, begin at the *Dui* trigram and conclude at the *Qian* trigram. Thus, for another one hundred days, the golden essence flies behind the elbows, starting at the *Kan* trigram and ending at the *Zhen* trigram. During the time of gathering medicine under the *Li* trigram, follow the previous method, practicing from the *Kun* to the *Qian* trigram. After two hundred days without error, the sacred embryo becomes firm.\n\nThe method of restraining the yang gate concludes at the *Qian* trigram. After another one hundred days, the *Niwan* palace is fully replenished, and one reverts from old age to youth, no longer resembling ordinary people. Once the medicine is gathered and the embryo immortal is complete, true qi arises, its form like a round pellet, its color like a red tangerine. It permanently resides in the cinnabar field, and one becomes an immortal of the earthly realm.\n\nAfter three hundred days of practice, cease gathering medicine under the *Li* trigram and restraining the yang gate under the *Kun* trigram. Then proceed with the method of returning the jade fluid elixir. Thus, only after the winter solstice does one begin the practice. After three hundred days, the embryo is complete, the qi is full, and the inner elixir is achieved, with true qi generated.\n\nThis method is the inversion of the Five Phases and the reversal of the Three Fields. Before practicing, one must first harmonize yin and yang, ensuring the mutual generation of qi and fluid, and continue until verification is achieved. Next, gather and disperse water and fire, solidifying the root source until the qi moves and the fluid stabilizes, and verification is achieved. Then, unite the dragon and tiger, refining the elixir medicine, gathering and replenishing the returning elixir, and forging lead and mercury until verification is achieved. When the count of \"ten depletions and one replenishment\" is fulfilled, and the mutual generation of qi and fluid is verified, one may proceed.\n\nThe above practice is a method of the Lesser Vehicle, sufficient for prolonging life and extending years. Only after replenishment is complete and firmness is verified may one select a month in the year—specifically the winter solstice—and a day in the month—specifically the *jiazi* day—and an hour in the day—specifically the hours of the *Kan*, *Li*, and *Qian* trigrams—to begin. For the first one hundred days, proceed from *Kan* to *Gen* and from *Dui* to *Qian*. After two hundred days, proceed from *Kan* to *Zhen* and from *Kun* to *Qian*.\n\nAll such practice must be conducted in a secluded chamber within a tranquil dwelling, far from women and girls, ensuring that the sounds of chickens and dogs are unheard, foul odors do not enter the nose, the five flavors do not pass the lips, and the seven emotions and six desires are severed. Regulate the quantity of food and drink, and maintain moderation in cold and heat. Even in sleep, one must remain vigilant against loss or damage. Without diligent practice, the Dao is difficult to achieve. After three hundred days, observe the results.\n\nThe true explanation states: This is the method of the Three Origins. Under the *Kan* trigram, the golden essence flies—this is the lower field returning to the upper field. Under the *Li* trigram, the medicine is gathered—this is the lower field returning to the middle field. Under the *Qian* trigram, the yang gate is restrained—this is the middle returning to the lower. This is also called the reversal of the Three Fields.\n\n*The Essentials of the Dao* states: \"The sun and moon move together under the *Fu* trigram; crouch and rise for several days to open the gates. Greedily gather in Yangzhou; the six palaces are filled with fire in the golden field.\"\n\nThe explanation states: \"The sun and moon moving together under the *Fu* trigram\" refers to the time when the first yang arises—at the *zi* hour in the day and the winter solstice in the year. This is what is meant by selecting a day in the month and an hour in the day. \"Crouch and rise\" has been explained previously. \"Several days\" refers to the fixed one hundred days. \"Opening the gates\" means first opening the middle gate, then the upper gate. \"Greedily gathering in Yangzhou\"—Yangzhou corresponds to the heart in the human body, the *wu* hour in the day, and the *Li* trigram. \"Gathering\" refers to the union of true yin and true yang, hence the gathering of medicine. *Qian* represents the six palaces, and fire is qi. By restraining the yang gate and gathering qi, the lung qi is metal, descending to the kidney’s cinnabar field. Thus, \"the six palaces are filled with fire in the golden field\" refers to practicing under the *Qian* trigram to restrain the yang gate, gathering fire in the lower cinnabar field.\n\nThe direct explanation states: \"The sun and moon moving together under the *Fu* trigram\" refers to the hour of *jiazi* at the winter solstice. \"Crouch and rise for several days to open the gates\" means crouching the abdomen and rising the body to kindle the fire, opening the gates after one hundred days. This is the method of flying golden essence from *Kan* to *Gen*. \"Gathering in Yangzhou\" refers to the union of yin and yang under the *Li* trigram to gather medicine. \"The six palaces are filled with fire in the golden field\" refers to restraining the yang gate under the *Qian* trigram, gathering lung qi in the lower field—this is the practice from *Dui* to *Qian*.\n\nOn the road to Zhongnan, mountains are met—\nrising the body to repeatedly pass the Three Passes.\nGreedily seeking union in Yangzhou,\nhow could it compare to the maiden burning heaven?\n\nExplanation states: *Zhongnan* refers to the Sage’s hidden meaning in the *Middle Son*—the *Middle Son* being the *Kan* trigram. *Gen* is mountain, and mountain is power; the flying golden essence halts only upon reaching the *Xun* trigram—this is the time of the second hundred days of practice. \"Rising the body to repeatedly pass the Three Passes\" and \"greedily seeking union in Yangzhou\" have been explained previously. \"How could it compare to the maiden burning heaven?\"—the *maiden* is the *Dui* trigram, and restraining the yang gate halts only upon reaching the *Qian* trigram.\n\nFrom Yanzhou to Xuzhou,\nrising to walk wears out cart and ox.\nFor the sake of delighting in the Nine Provinces’ union,\nfire enters Yongzhou in the southwest.\n\nExplanation states: *Genzhou* is the *Gen* trigram; *Xuzhou* is the *Xun* trigram. Flying golden essence from the *Gen* trigram halts only upon reaching the *Xun* trigram. \"Rising to walk wears out cart and ox\"—the *cart* is yang, the *ox* is yin; this is the qi of the spine flying into the *Mud Pill*. The *Nine Provinces* correspond in man to the heart, and in time to the hour of *wu*—this is the medicine garden previously mentioned. The *southwest* is the *Kun* trigram; *Yongzhou* is the *Qian* trigram. Restraining the yang gate halts only upon reaching *Qian*—this is the time of the third hundred days of practice.\n\nDirect explanation states: This is the method of flying golden essence for the third hundred days, rising from *Gen* and halting at *Xun*. The union of the Nine Provinces is the gathering of medicine as before. Restraining the yang gate halts only upon reaching *you* in *Qian*. This is the daily practice, the method of the Three Primordials. Flying golden essence into the brain returns the lower field to the upper field; gathering medicine returns the lower field to the middle field; burning medicine and advancing fire returns the middle field to the lower field—this is called the practice of the Three Primordials. The method of the Middle Vehicle is already that of an Earth Immortal, and practice ceases only upon verification. One first notices that dreams are often startled and fearful, the four limbs and six viscera afflicted with illness, yet they heal without treatment. In a dark room with eyes closed, a radiant light like a canopy encircles the body; the golden gate and jade lock seal firmly, cutting off dream emissions and leakage. With a thunderous roar, the qi of the joints flows freely, and in dreams one may hold an infant in return or soar freely at will. The eight perverse qi cannot enter, the heart’s illusions vanish, and desires are extinguished. Inward contemplation is bright and unobscured; by day, the spirit’s countenance is clear and refined; by night, the cinnabar field is naturally warm. All these are signs of obtaining the medicine. Once the correction is proper, practice diligently with care, adding three hundred days to the previous method to complete the *Fetal Immortal*. Only after the fetal completion does one proceed to the subsequent practice.\n\n**Sixth: Jade Fluid Returning to the Cinnabar—Appendix on Jade Fluid Refining the Form**\n\n*The Jade Book* states: True yin and true yang mutually generate and complete one another. That which appears above is accumulated yang forming spirit; within spirit there is form, and that which adheres to heaven is the sun and moon. That which appears below is accumulated yin forming shape; within shape there is form, and that which adheres to earth is gold and jade. The essence of gold and jade is concealed within the elegant qi of mountains and rivers, floating above to exchange radiance with the sun and moon. Plants and trees receive it to become auspicious omens, birds and beasts obtain it to become extraordinary species.\n\n*The True Source* states: When yang ascends to heaven, the Supreme Ultimate generates yin; yin is insufficient while yang has surplus, thus accumulated yang generates spirit. When yin descends to earth, the Supreme Ultimate generates yang; yang is insufficient while yin has surplus, thus accumulated yin generates shape. Above, the sun and moon; below, gold and jade—true yang has spirit, true yin has form. Their qi intermingle, and above and below reflect one another; light fills heaven and earth, and thus gold and jade are precious. It is known that when the qi of gold and jade congeals in the void, it becomes auspicious qi and propitious mist; when it enters the earth, it transforms into sweet springs and magic herbs. People receive it to become heroes, birds and beasts obtain it to produce marvels. Though the essence of gold and jade is produced from accumulated yin’s shape, it embraces the qi of true yang and is further moved by the sun and moon formed from accumulated yang’s spirit. True yang’s downward reflection causes treasure to congeal.\n\n*The Analogy* states: Accumulated yin forms shape yet inwardly embraces true yang to become gold and jade—this is analogous to accumulating medicine and embracing true qi to become a *Fetal Immortal*. When the qi of gold and jade enters the earth to become sweet springs and magic herbs, it is analogous to jade fluid returning to the cinnabar field. When the qi of gold and jade congeals in the void to become auspicious qi and propitious mist, it is analogous to qi refining the form. Whenever the qi of gold and jade surges into the heavens, it rises with yang; whenever it enters the earth, it descends with yin. Since it follows the ascent and descent of yin and yang, it naturally has the four seasons. Thus, one may return fluid to the cinnabar field and refine the form with qi, analogous to the four seasons’ waxing and waning and the daily transformations.\n\n*The True Formula* states: For gathering and supplementing, verification is sought within the year; within the month, the day is chosen; within the day, the hour is selected. Practicing the Three Primordials for one hundred days, the medicine’s power is complete; for two hundred days, the sacred fetus is firm; for three hundred days, true qi is born, and the *Fetal Immortal* is complete. Practice diligently with care, adding time as appropriate. Only after the full three hundred days does one proceed to the method of returning the cinnabar and refining the form. Whenever using the *Gen* trigram to fly golden essence into the brain, it halts at the *Xun* trigram and ceases—this refers to flying golden essence after three hundred days. The *Li* trigram ceases gathering medicine; the *Kun* trigram ceases restraining the yang gate. Only the *Dui* trigram is employed, restraining the yang gate until it halts at the *Qian* trigram’s seal. Having ceased the *Li* trigram, the swallowing method for refining the form is added.\n\nThe swallowing method: With the tongue, stir between the upper palate and the two ridges, first swallowing the foul and turbid fluid, then retracting the tongue’s tip to fill the Jade Pool. The fluid is generated, not rinsed, and swallowed. In the three months of spring, when liver qi is flourishing and spleen qi is weak, the swallowing method is practiced daily under the *Li* trigram.\n\nIn the three months of summer, when heart qi flourishes and lung qi is weak, the swallowing method is practiced daily under the *Xun* trigram. In the three months of autumn, when lung qi flourishes and spleen qi is weak, the swallowing method is practiced daily under the *Gen* trigram. In the three months of winter, when kidney qi flourishes and heart qi is weak, the swallowing method is practiced daily under the *Zhen* trigram. During the transitional months of the four seasons, when spleen qi flourishes and kidney qi is weak—since kidney qi is the root of human life and weakness occurs in all four seasons—during the last eighteen days of each seasonal transition, the swallowing method is practiced daily under the *Dui* trigram, used concurrently with the previous swallowing method. Only in autumn is the *Dui* trigram’s swallowing method employed exclusively, discontinuing the *Gen* trigram’s practice.\n\nFor the above swallowing methods, first follow the previous method to swallow. If no fluid is generated between the teeth and the Jade Pool, simply fill the mouth with the tongue, close the Jade Pool, draw in the jaws, and swallow emptily as the method—this refers to swallowing qi, within which water naturally arises. The number of qi-swallowings: in the first year, thirty-six to forty-nine times; in the next year, eighty-one times; and in the following year, one hundred eighty-one times, at which point verification appears—this is the method of returning the fluid to the cinnabar. The practice should not exceed three years; it irrigates the cinnabar field, bathes the fetal immortal, and true qi grows ever more abundant.\n\nIf one practices this method of returning the jade fluid to the cinnabar, after three hundred days of nurturing the inner cinnabar and true qi begins to arise, the *Gen* trigram’s flying golden essence will strike the three passes and ascend to the Mud Pill Palace. Then, the method of returning the golden fluid to the cinnabar is performed: from the crown of the head, a stream of golden water descends, flowing back to the Yellow Court, where it transforms into gold and becomes cinnabar—this is called the Golden Cinnabar.\n\nWhen practicing the method of returning the golden fluid, one should be in a secluded chamber where wind, sunlight, and ordinary people do not reach. Burn incense, sit cross-legged with palms stacked, first crouching the body and then rising. As soon as the fire is felt to ignite, sit upright, extinguish all thoughts, forget all emotions, and inwardly observe. Precisely when the *Gen* trigram’s flying golden essence enters the crown, slightly raise the head and tilt the neck back, allowing the fire to fill the area beneath the neck. Then nod the head forward, lower it, and curve the neck. Retract the tongue, pressing it firmly against the upper palate, where clear and refreshing water arises, its taste sweet and fragrant. It ascends to the nape, descends through the hundred vessels, and a true fragrance is naturally detected in the nose, while an extraordinary flavor lingers on the tongue. Without rinsing, swallow it, sending it down to the Yellow Court—this is called the Golden Fluid Returning to the Cinnabar.\n\nIn spring, summer, autumn, and winter, regardless of the time, after the flying golden essence enters the brain, proceed step by step with this method, from *Gen* to *Xun* only. In the evening, the method of restraining the yang gate is practiced from *Dui* to *Qian* only. When practicing this method, one must strictly regulate conduct beyond previous standards to achieve success. Ultimately, it serves only to refine the form and abide in the world, attaining longevity without death, but not transcendence.\n\nThe *Essentials of the Dao* states: \"Recognize the root and stem of the Five Phases, and you will understand spring, summer, autumn, and winter. Drink several cups of nectar, and in drunkenness wander the Moon Palace.\"\n\nExplanation: \"Recognize the root and stem of the Five Phases\" refers to inverting the Five Phases’ mutual generation and restraint, employing different trigrams at different times to practice the swallowing method. \"Understand spring, summer, autumn, and winter\" means adjusting the timing accordingly. \"Nectar\" is the jade fluid. \"Moon Palace\" is the cinnabar field. \"Drunkenness\" refers to frequent swallowing.\n\n\"Gazing eastward at Fusang before dawn, rising behind and swallowing without cease. Galloping like a steed through the cosmos, the eldest son reaches only Yangzhou.\"\n\nExplanation: \"Gazing eastward at Fusang before dawn\" refers to the time before sunrise, the hour of the *Gen* trigram. \"Rising behind\" is the flying golden essence. \"Swallowing ahead\" is the jade fluid returning to the cinnabar. \"Galloping steed\" is the ignition of fire, the jade fluid refining the form. \"Wandering the cosmos\" means filling the four limbs. \"Eldest son\" is the *Zhen* trigram. \"Reaches only Yangzhou\" is the *Li* trigram. Refining the form with jade fluid begins with the *Zhen* trigram and ends with the *Li* trigram.\n\nDirect Explanation: The jade fluid is kidney fluid. When it ascends to the heart, the three qi harmonize and pass the Towering Pavilion, filling the Jade Pool—this is called jade fluid. If swallowed, it enters the lower field from the middle field, called returning cinnabar. If ascended, it enters the four limbs from the middle field, called refining the form—though in truth, it is the same substance.\n\nThis pertains to the completion of the three hundred days of gathering medicine, the perfection of the fetal cinnabar, the reduction of the flying golden essence by one trigram, the continued restraint of the yang gate, the cessation of medicine-gathering, and the addition of the swallowing method, which varies with the four seasons. This is the method of refining the form. After employing the trigrams, refining the form is added, beginning with the *Zhen* trigram and concluding with the *Li* trigram, without limit to years, months, or days—only ceasing upon verification. The body’s complexion becomes radiant, the spirit’s qi refined and elegant. Gradually, one grows averse to foul odors assaulting the mouth and stomach, worldly passions and attachments naturally dissolve, true qi becomes abundant and one feels perpetually sated, requiring little food. One can drink limitless wine, the mortal bones transform into spiritual awareness, movement is swift as a galloping horse, the eyes dark as lacquer, the body smooth as congealed fat. Azure hair regrows, wrinkled faces smooth anew, old age is forever replaced by a youthful countenance. One can see autumn down at a hundred paces. Old scars and blemishes on the body naturally vanish. Tears, saliva, and sweat no longer appear. The sacred cinnabar generates flavor, the numinous fluid exudes fragrance. Between mouth and nose, true fragrance and extraordinary flavors constantly arise. Rinsing the saliva produces a buttery substance that can heal others’ illnesses. The entire body transforms into white cream. All the above are verifications of the jade fluid returning to the cinnabar and refining the form.\n\nUpon verification, cease practice, strictly regulate conduct, follow the method according to the season, and proceed to subsequent matters.\n\n**Golden Fluid Returning to the Cinnabar, Seventh: Appended Method of Refining the Form with Golden Fluid**\n\nThe *Golden Edict* states: \"Accumulated yang forms spirit; within spirit, there is form. Form is born of the sun; the sun is born of the moon. Accumulated yin forms the body; within the body, there is spirit. Spirit is born of metal; metal is born of jade.\"\n\nThat which arises and vanishes with yin and yang is the light of the sun and moon, for light is born of number, and number originates in Qian and Kun. That which ascends and descends with yin and yang is the qi of metal and jade, for qi arises with the seasons, and the seasons originate in Heaven and Earth.\n\n*The True Source* states: \"The light of the sun and moon: after dawn, use nine; before the dark of the moon, use six. Six and nine are the numbers of Qian and Kun. The qi of metal and jade: in spring and summer, it ascends; in autumn and winter, it descends. Ascending and descending are the seasons of Heaven and Earth. Metal is born of jade, jade of stone, stone of earth—thus are those seen in form and below. Within the sun is the Golden Crow; within the moon, the Jade Hare. The moon awaits the sun’s soul to shine—thus are those seen in spirit and above.\"\n\n*The Analogy* states: \"The sun and moon are likened to qi: kidney qi is likened to the moon, and heart qi to the sun. Metal and jade are likened to fluid: kidney fluid is likened to metal, and heart fluid to jade. The so-called *jade fluid* originally ascends from kidney qi to the heart, uniting with heart qi. The two qi merge and pass the *Double Towers*, the mouth is closed so that saliva fills the *Jade Pool*, and when swallowed, it is called *jade fluid returning to the cinnabar*; when ascended, it is called *refining the form with jade fluid*. This fluid, born in the heart yet originating from the kidneys, is analogous to the saying that jade is born of stone, and stone of earth.\n\nThe so-called *golden fluid*: kidney qi unites with heart qi but does not ascend, instead steaming the lungs. The lungs, as the *Flower Canopy*, enshroud the two qi. Drawing lung fluid at midday, it ascends from the *Lower Field* through the *Weilü* cavity, called *flying golden essence into the brain* to replenish the *Mud Pill Palace*. From above, it descends again into the *Lower Field*, called *golden fluid returning to the cinnabar*. Once returned, it ascends again, filling the four limbs, then rises once more—this is called *refining the form with golden fluid*, which is also the saying that metal is born of earth.\n\nFor those who wish to refine the form and fly golden essence, they must remain in a quiet chamber, strictly avoiding wind and sunlight. From afar, they burn incense and secretly invoke the Three Pure Ones and Supreme Sages: *'Your disciple wishes for longevity in this world, to transmit and practice the Great Dao, to teach and transform others. First, I must personally practice the method of refining the form, to become untouched by cold or heat, to transcend grain and fasting, and to escape beyond yin and yang.'* After the incantation, they swallow the fluid.\n\n*The True Formula* states: \"Behind the back, the *Weilü* cavity is called the *Lower Pass*; beside the spine is the *Middle Pass*; behind the brain is the *Upper Pass*. First, fly the golden essence to open the Three Passes. The kidneys are likened to earth, the heart to heaven, and ascending to the crown is likened to the Nine Heavens. Refining the form with jade fluid ascends from the heart to the crown, opening the Nine Heavens.\n\nAfter three hundred days, the great medicine is complete, the fetal immortal is perfected, and true qi is born. When rising from the front, follow the old path of refining the form with jade fluid; when rising from the back, follow the old path of flying golden essence. As golden essence and jade fluid circulate, verification appears, beginning with the *Kan* trigram. After rising once to the crown, gently close both ears with the hands, inwardly observe as prescribed, and subtly swallow the saliva. Press the tongue firmly against the teeth, close the *Jade Pool* below, and wait for the fluid from the upper palate to descend before swallowing. After swallowing, rise again, with *Liangfeng* as the limit. In spring and winter, rise twice and swallow once; in autumn and summer, rise five times and swallow once. In each swallowing count, autumn and summer do not exceed fifty, and spring and winter do not exceed one hundred.\n\nAfter swallowing, rise from the front of the body, filling the head, face, four limbs, and five fingers until the qi is abundant, then stop. Rise and ascend again, with *Li* as the limit. After this, rising from the back to swallow saliva is called *golden fluid returning to the cinnabar*; after returning, rising from the front is called *refining the form with golden fluid*. From the *Gen* trigram onward, refining the form continues until the *Li* trigram, then restrains the *Yang Pass* at *Dui* until *Qian* is sealed. After rising from the back to the crown, descending from above is called *golden fluid returning to the cinnabar*; the qi of the golden elixir rising from the front, ascending from below, is called *refining the form with golden fluid*, manifesting as jade trees and golden flowers.\n\nIf, in *golden fluid returning to the cinnabar*, the ascent has not yet reached the *Lower Origin* but rises from both front and back, it is called *fire rising to burn the body*. This is *golden fluid returning to the cinnabar and refining the form*, where both front and back rise together, completing the burning of the body. In practicing this, one must strictly regulate conduct, endure hardship, and remain unwavering until verification is achieved.\n\n*The Essentials of the Dao* states: \"After rising, close the ears all night and drink golden fluid in due time. The feast reaches Qingzhou before stopping; at sunset, listen again to the yang song.\" The explanation: \"After rising, close the ears all night\" refers to practicing *golden fluid returning to the cinnabar*, where one must fly golden essence from behind the elbow, striking the Three Passes. As soon as the qi rises, quickly close both ears with the hands, for the ears are the gates of kidney qi, preventing its leakage outward so it does not enter the brain. \"Drink golden fluid in due time\" means that once the qi enters the brain, immediately follow the previous method: nod the head, curve the neck, retract the tongue so its tip nearly touches the upper palate, and invite the sweet water, which has an extraordinary effect, as sweet as honey. At the *Gen* trigram, fly golden essence once and swallow until the *Zhen* trigram. Qingzhou is the *Zhen* trigram. Sunset is the *Dui* trigram. \"Listen again to the yang song\" means that from the *Dui* trigram, restrain the *Yang Pass* until the *Qian* trigram, without needing to gather the medicine.\n\nAfter drinking all night, fire rises, ascending from the front and rising from the back to burn the body. Though not bound by years or months, within the day there is naturally *Qian*. The explanation: This formula is the method of *refining the form with golden fluid*. \"After drinking all night, fire rises\" refers to *golden fluid returning to the cinnabar* as before; refining the form at the *Gen* trigram is the rising of fire. Ascending from the front and rising from the back is flying golden essence to ignite the fire. The method of refining the form with jade fluid first rises from the back, flying golden essence into the crown, then returns the elixir and rises again from the front to refine the form—this differs from the method of refining the form with golden fluid.\"\n\nWhen golden essence flies and fire rises to enter the crown, then refine the form by rising from the front—both front and back rising together is called *fenshen* (body-burning). As fire rises to circulate the returning elixir, one must follow the seasonal augmentation and reduction cycles. This method is not bound by years, months, days, or hours; it requires only disciplined focus and secluded practice, free from worldly distractions.\n\nWithin the day, there is naturally *Qian* and *Kun*: burning *Qian* before noon and burning *Kun* after noon. In terms of the human body, the abdomen is *Kun*, and the back is *Qian*. Burning *Qian* before noon refers to flying golden essence from behind the elbows to rise and refine the form; burning *Kun* after noon begins at the *Dui* trigram, restraining the *Yang* pass, and continues until reaching *Qian*.\n\nDirect Explanation: *Golden fluid* is the fluid of the lungs. When it contains *Dragon* and *Tiger* and enters the lower *dantian*, the great medicine nears completion—this is called *golden fluid*. Drawing it from behind the elbows into the brain, then descending again to the lower *dantian*, is called *returning the elixir*. Rising once more to fill the entire body from below to above is called *refining the form*, also known as *refining the form into qi*.\n\nThis must be verified through the practice of *jade fluid returning the elixir* and refining the form. One should conduct this method with disciplined seclusion, burning incense. After *golden fluid returns the elixir* and sequentially refines the form by restraining the *Yang* pass, only after a year or more can *fenshen* be achieved. *Fenshen* is refining the form before the *Kan* trigram. In terms of the human body, the abdomen is *Kun*, and the back is *Qian*. Burning *Qian* before noon produces golden essence; burning *Kun* after noon restrains the *Yang* pass.\n\nWhen burning *Qian*, rise from below to above, both front and back igniting together. In winter and summer, practice the *jiji* (Completion) method for three or five days to prevent excess, ensuring the golden elixir remains moist. This is the *fenshen* method of swallowing fire amid the rising flames. Cease only upon verification. The inner will becomes pure and lofty, merging with the Great Void; the hun and shen do not wander, banishing dreams. The yang essence solidifies the body; the spirit’s abode becomes unshakable. One is no longer affected by the cold of winter or the heat of summer. The countenance transforms, and even when facing ordinary people, though they may be wealthy or noble, they seem foul and rank, further revealing the refinement of one’s bones and the transcendence of the mundane form.\n\nWhen merit and practice are complete, one secretly receives the three mysteries of true yang’s transformations. Matters of fortune and misfortune, the movements of spirits—all can be foreseen. The eyes perceive only the dust of the world, yet the mind is cut off from all realms. Vital qi fills the body, and the mouth no longer craves food or drink. A radiant aura emanates, golden in hue; the immortal flesh rivals jade blossoms. Wherever one goes, divine beings naturally appear, responding to commands as if by one’s own will. The true qi is purely yang, capable of refining external mercury.\n\nAll the above are the verifications of *golden fluid returning the elixir* and *golden fluid refining the form*.\n\n---\n\nThe Middle Vehicle’s Three Gates pertain to Earthly Immortals.\n\n**The Great Vehicle’s Three Gates of Transcending the Mundane and Entering Sagehood**\n**Chapter Eight: Refining Qi to Align with the Origin**\n\nThe *Golden Edict* states: When the primordial qi first divided, the Great Dao took form and established the binary patterns of yin and yang. Once yin and yang settled into their positions, the Great Dao acquired names and divided into the Five Emperors. The Five Emperors rule different lands, each guarding one direction; the five directions possess distinct qi, each governed by a child.\n\nThe child of the Green Emperor receives *jia* and *yi*, the nine qi of Heaven’s true Wood virtue.\nThe child of the Red Emperor receives *bing* and *ding*, the three qi of Heaven’s true Fire virtue.\nThe child of the White Emperor receives *geng* and *xin*, the seven qi of Heaven’s true Metal virtue.\nThe child of the Black Emperor receives *ren* and *gui*, the five qi of Heaven’s true Water virtue.\nThe child of the Yellow Emperor receives *wu* and *ji*, the one qi of Heaven’s true Earth virtue.\n\nFrom the one qi, True Unity is born. True Unity emerges through Earth, thus all things are generated in Earth, and the Five Phases are generated in the One. The Dao of the True Origin is born from the one qi.\n\nThe *Jade Book* states: One, three, five, seven, nine—these are the divisions of the Dao into numbers.\nMetal, Wood, Water, Fire, Earth—these are the transformations of the Dao into images.\nEast, West, South, North, Center—these are the arrangements of the Dao into positions.\nGreen, White, Red, Yellow, Black—these are the dispersals of the Dao into substances.\n\nNumbers return to the absence of numbers; images revert to the absence of images; positions dissolve into the absence of positions; substances resolve into the absence of substances.\n\nTo attain the Dao’s absence of numbers, do not divide—then there are no numbers.\nTo attain the Dao’s absence of images, do not transform—then there are no images.\nTo attain the Dao’s absence of positions, do not arrange—then there are no positions.\nTo attain the Dao’s absence of substances, do not disperse—then there are no substances.\n\nThe absence of numbers is the Dao’s source.\nThe absence of images is the Dao’s root.\nThe absence of positions is the Dao’s truth.\nThe absence of substances is the Dao’s subtlety.\n\nThe *True Source* states: Once the Dao’s source divided, it descended from the root and flowed to the branches. Those who awaken to its truth cultivate truth through truth; inner truth naturally manifests externally. Those who recognize its subtlety create subtlety through subtlety; inner subtlety naturally manifests externally.\n\nHeaven and Earth attain the Dao’s truth, yet their truth remains unmanifest—thus they are not free from positions.\nHeaven and Earth attain the Dao’s subtlety, yet their subtlety remains unmanifest—thus they are not free from substances.\nWith substances, there are images to seek; with positions, there are numbers to deduce.\n\nAmong all things between Heaven and Earth, none is more noble than humanity. Just as Heaven and Earth possess images to seek, one knows their substances and qi are like water. Just as Heaven and Earth possess numbers to deduce, one knows their positions are near or far. Examining this closely, the Dao is not distant from humanity.\n\nThe *Analogy* states: Heaven and Earth have the Five Emperors, just as humans have the five viscera.\nThe Green Emperor’s *jia* and *yi* (Wood), *jia* as yang and *yi* as yin, correspond to the liver’s qi and fluids.\nThe Black Emperor’s *ren* and *gui* (Water), *ren* as yang and *gui* as yin, correspond to the kidneys’ qi and fluids.\nThe Yellow Emperor’s *wu* and *ji* (Earth), *wu* as yang and *ji* as yin, correspond to the spleen’s qi and fluids.\nThe Red Emperor’s *bing* and *ding* (Fire), *bing* as yang and *ding* as yin, correspond to the heart’s qi and fluids.\n\nThe White Emperor’s *geng* and *xin* (Metal), *geng* as yang and *xin* as yin, correspond to the lungs’ qi and fluids.\n\nIn all the seasons of spring, summer, autumn, and winter, the heart, lungs, liver, and kidneys each flourish in their respective months. The *True Formula* states:\n\nIn the three months of spring, the liver’s qi flourishes. When the liver flourishes, the parents’ true qi follows the celestial movements and resides in the liver. If encountering a *jia* or *yi* day, which restrains Earth, during the hours of *chen*, *xu*, *chou*, or *wei*, one should kindle fire to refine the spleen’s qi at the appropriate time. When the *dui* trigram’s time arrives, Metal is diminished to deplete the lung’s qi—this is not the time to engage in practice. During the *kan* trigram’s time, kindle fire according to the method to refine the kidney’s qi. At the *zhen* trigram’s time, enter the chamber, inhaling deeply and exhaling lightly, with breath retention as the highest method, prolonged closure as secondary. Count to one thousand breaths as the measure. At that time, internally observe according to the method: first, empty the mind and close the eyes, and a green light will naturally appear. Gradually ascend the body to enter the *niwan* palace, from darkness to the *chen* hour, filling the *zhen* seal.\n\nIn the three months of summer, the heart’s qi flourishes. When the heart flourishes, the parents’ true qi follows the celestial demonic movements and resides in the heart. If encountering a fire day, *bing* or *ding*, which restrains Metal, during the *dui* seal’s time, kindle fire according to the method to refine the lung’s qi. On other days, during the *kan* seal’s time, Water is diminished to deplete the kidney’s qi—this is not the time to engage in practice. During the *zhen* trigram’s time, kindle fire according to the method to refine the liver’s qi. At the *li* seal’s time, enter the chamber and practice as before. A red light will naturally appear, gradually ascending the body to enter the *niwan* palace, from the *si* hour to the *wei* hour, filling the *li* trigram.\n\nIn the three months of autumn, the lung’s qi flourishes. When the lungs flourish, the parents’ true qi follows the celestial movements and resides in the lungs. If encountering a metal month, *geng* or *xin*, which restrains Wood, during the *zhen* trigram’s time, kindle fire according to the method to refine the liver’s qi. On other days, during the *li* trigram’s time, Fire is diminished to deplete the heart’s qi—this is not the time to engage in practice. During the *xun* trigram’s time, kindle fire according to the method to refine the spleen’s qi. At the *dui* trigram’s time, enter the chamber and practice as before. A white light will naturally appear, gradually ascending the body to enter the *niwan* palace, from the *shen* hour to the *xu* hour, filling the *dui* seal.\n\nIn the three months of winter, the kidney’s qi flourishes. When the kidneys flourish, the parents’ true qi follows the celestial movements and resides in the kidneys. If encountering a water day, *ren* or *gui*, which restrains Fire, during the *li* trigram’s time, kindle fire according to the method to refine the heart’s qi. On other days, during the hours of *chen*, *xu*, *chou*, or *wei*, Earth is diminished to deplete the spleen’s qi—this is not the time to engage in practice. During the *dui* trigram’s time, kindle fire according to the method to refine the lung’s qi. At the *kan* seal’s time, enter the chamber and practice as before. A black light will naturally appear, gradually ascending the body to enter the *niwan* palace, from the *hai* hour to the *chou* hour, filling the *kan* seal.\n\nExplanation: In spring, refine the liver for one thousand breaths until green qi emerges. In the last eighteen days of spring, do not practice as before; instead, use settled breathing as the method. Sit in stillness all day to nourish the spleen and refine one’s true qi. Only then can one kindle fire at the *kan* trigram’s time to refine the kidneys, lest the true qi be depleted.\n\nIn summer, refine the heart for one thousand breaths until red qi emerges. In the last eighteen days of summer, do not practice as before; instead, use settled breathing as the method. Sit in stillness all day, nourishing and refining as before. Only then can one kindle fire at the *zhen* trigram’s time as before.\n\nIn autumn, refine the lungs for one thousand breaths until white qi emerges. In the last eighteen days of autumn, do not practice as before; instead, use settled breathing as the method. Sit in stillness all day, nourishing and refining as before. Only then can one kindle fire at the *xun* trigram’s time as before.\n\nIn winter, refine the kidneys for one thousand breaths until black qi emerges. In the last eighteen days of winter, do not practice as before; instead, use settled breathing as the method. Sit in stillness all day, nourishing and refining as before. Only then can one kindle fire at the *dui* trigram’s time as before, until yellow qi forms a radiance, and one silently observes myriad rays encircling the body.\n\nThe method of settled breathing does not rely on forced retention or tight closure; rather, it should be continuous as if present, applied without strain, moving from existence into non-existence, allowing it to reside naturally.\n\nThe method of gathering the medicine: swallow saliva and secure it to press the heart, preventing the true qi from scattering.\n\nWhen entering the chamber, one must close the door, seclude oneself in a quiet dwelling, far from chickens, dogs, women, and all disturbing influences. Slightly open a small aperture to allow enough light to discern objects, but do not let wind or sunlight penetrate. There should be no sounds nearby.\n\nOne should calm the mind and cease thoughts, casting aside all worldly concerns. Internally and externally, maintain stillness, allowing nothing to disturb the intent.\n\nFor the yang spirit is newly gathered and the true qi is just congealing, it is like an infant, not yet mature. Day and night, burn incense, kneel, and bow in reverence: first, pray to Heaven; second, to the Heavenly Immortals; third, to the Earthly Immortals. After completing the three bows, sit in stillness, forgetting all schemes, and proceed with this method. One must also see verification step by step in the previous methods. If one takes this as the Dao, one may labor in vain and never achieve success, merely becoming a ghostly immortal with the yin soul leaving the body.\n\nThe *Essentials of the Dao* states: In practicing this method, there is no restriction on years, months, days, or hours; one must follow the previous methods until verification is seen before stopping. When the qi naturally appears, one must be diligent and unwavering, abandoning external affairs and focusing solely within the chamber, gauging the appropriate times.\n\nUse two pure yang youths or establish a bond with disciples, alternating their service for over a thousand days to complete one qi cycle. One gains tenfold with each cycle: in one hundred days, results appear; in five hundred days, qi is complete, and one can practice internal observation. Then, gather the yang spirit to merge with celestial spirits, refine the spirit to unite with the Dao, and ascend beyond the ordinary to become a sage.\n\nThe verification of refining qi: one feels the body extremely comfortable, often ascending as if lifted. The elixir light penetrates the bones, and an extraordinary fragrance fills the room. Next, in stillness, one externally observes purple auroras filling the eyes. Looking downward from the crown, a golden light envelops the body. Strange and wondrous signs of verification are too numerous to record.\n\n**Internal Observation and Transformation, Ninth Chapter**\n\nThe *Golden Teachings* states: The great Dao has no form; it resides in qi. Its vastness has no bounds, and nothing can contain it.\n\nThe great Dao has no function; it operates through things. Its depth is unfathomable, and no principle can exhaust it. Speaking of the Dao in terms of its essence, distinctions between external and internal arise; speaking of it in terms of its function, the foundation for observation and perception is established. Observe the internal and not the external, and though nothing external remains unexamined, the internal becomes clear. Observe the spirit and not the form, and though no form is left unprepared, the spirit becomes visible.\n\n*The True Source* states: With one mind, observe the myriad things, and the myriad things cannot be said to be excessive. With the myriad things disturbing the one qi, the one qi cannot be said to be insufficient. When the one qi returns to the one mind, the mind cannot be seized by things. When the one mind moves the one qi, the qi cannot be enslaved by methods. When the source of the mind is pure and clear, it illuminates the ten thousand and shatters them, yet remains unaware of things. When qi wages a fierce struggle, the ten thousand sensations rest in a single breath, yet remain unaware of methods. Things are no-things, returning to the original image; methods are no-methods, thus fulfilling the true self-attainment.\n\n*The Parable* states: From images arise forms, and from forms names are established. With names, one infers their numbers; with numbers, one grasps their principles. Yet the lofty and supreme void is such that nothing can compare to it. What can be likened to it is like a person’s cultivation: the sequence of stages is unerring, and attainment follows order. The harmonious qi congeals without dispersing; the utterly empty true nature is serene and without action. The spirit merges with the Dao and returns to spontaneity. At this moment, with no-mind as mind, how can one speak of responding to things? With no-thing as thing, how can one speak of employing methods? In true joy, radiant and blissful, one forgets the existence of one’s own body. Gradually entering the Dao of non-action, one reaches the realm of the subtle and imperceptible, becoming a guest who has entered sagehood and transcended the ordinary.\n\n*The True Formula* states: This method accords with the Dao, resembling the principle of visualization often discussed, or like the moment when a Chan monk enters samadhi. One should choose an auspicious site and prepare a chamber, kneel in reverence, burn incense, sit upright with legs crossed, let the hair down and the robe loose, clasp the hands to retain spirit, quiet the mind, and close the eyes. Before noon, slightly raise the body to kindle the fire and refine qi; after noon, slightly gather the body to concentrate the fire and refine the elixir. Regardless of day or night, when spirit and qi harmonize, joy arises naturally. During meditation, if sounds are heard, do not listen; if visions appear, do not acknowledge them. External phenomena will disperse on their own; if one acknowledges them, demonic obstacles will only intensify. When demonic obstacles arise without delay, swiftly proceed forward: slightly gather the body, then straighten the waist; afterward, slightly arch the chest, lean back without straightening the waist. After a short while, fire will rise before and behind—do not move when it ascends, for this is called \"firing the body.\" When the fire rises, demonic obstacles will scatter beyond the body, and yin evil will not enter the shell. After two or three repetitions, visualize all between heaven and earth as raging flames. When the fire subsides, all is cool and clear, with nothing remaining—only carriages and horses, singing and dancing, canopies and embroidered silks, wealth and splendor, joyous figures in processions, ascending on five-colored clouds as if entering the celestial realm. Upon arrival, one sees towering pavilions and jade-green terraces, courtyards and corridors, pearls and gold scattered ungathered, gardens and ponds, flowers and fruits beyond count. Suddenly, exotic fragrances arise on all sides, and the sounds of music and revelry fill the air. Guests and friends sit in abundance, with delicacies of land and sea laid out. Laughing and conversing, they celebrate great peace, exchanging rare treasures. At this moment, though these are not the armies of yin ghosts or demons, one must not regard them as auspicious events.\n\nFor those who cultivate the true, who abandon worldly affairs and willingly endure solitude—whether concealing themselves in rivers and lakes or secluding themselves in remote corners, cutting off thoughts and forgetting emotions, every action guarded—after long toil and hardship, once the work is accomplished and the method established, such splendor may appear. Yet if one does not recognize this as a manifestation of demons but instead believes it to be the true celestial palace, unaware that having shed the mortal coil, one’s own celestial palace lies within the crown—if one becomes attached and takes it as reality, failing to employ the method of transcendence, remaining within the body, the yang spirit will not emerge, and the immortal embryo will not transform—then one may claim to have risen above the dark paths, becoming a terrestrial immortal, merely achieving longevity without death. Yet one cannot shed the physical form to ascend as an immortal and return to the Three Isles as a transcendent being. At this point, what a pity! Students must consider that though transcendence is difficult, it cannot be neglected.\n\n*The Essentials of the Dao* states: It is not that the inexhaustible method has diminished.\n\n**Transcendence and Liberation of Form, Tenth Chapter**\n\n*The Golden Teachings* states: The Dao is originally nothing; to speak of it as existing is not the Dao. The Dao is originally empty; to speak of it as substantial is not the Dao. Since it is without form, neither questioning nor response can reach it. Since it is without image, neither sight nor hearing can grasp it. If one takes the mysterious and subtle as the Dao, the mysterious and subtle still cannot escape the burden of question and answer. If one takes the subtle and imperceptible as the Dao, the subtle and imperceptible still cannot avoid the burden of sight and hearing. If even the subtle and imperceptible are not the Dao, then the Dao is also beyond knowing how it is so.\n\n*The Jade Scripture* states: Its coming has a beginning, yet one does not know the beginning of the great Dao. What is this? Its going has an end, yet one does not know the end of the great Dao. What is this? Above the loftiest height, though there is still higher, one does not know that above the great Dao there is no limit. Below the deepest depth, though there is still lower, one does not know that below the great Dao there is no end. Vast and unfathomable, it is called the Dao. It accords with what things attain and arranges them in differing ranks. The Dao of non-action cannot be exhausted.\n\n*The True Formula* states: \"Transcend\" means transcending the mortal frame to enter sagehood; \"liberate\" means shedding the mundane embryo to become an immortal child. It is when the spirit enters the qi embryo, qi is complete, and true nature is realized—only when each stage of prior effort has been verified and is correct—should one reside in a chamber of purity.\n\nEntering the realm of the formless and soundless, one inwardly observes and recognizes the yang spirit. Next, one kindles the fire to subdue demons, burns the body to gather qi, and the true qi ascends to the celestial palace. Within the shell, all is serene—utterly devoid of anything. One must choose a secluded dwelling and rely solely on inward contemplation. After the three bows are completed, sit upright without rising, the body settled without need for stretching or contracting. Close the eyes, still the mind, and after profound tranquility reaches its apex, the body seems suspended in emptiness, the spirit and qi drifting freely, difficult to restrain. Silently turn the gaze inward, and all becomes luminous and unobscured: mountains and rivers appear resplendent, pavilions and terraces faintly discernible. Purple qi and crimson radiance swirl in profusion; auspicious simurghs and rainbow-feathered phoenixes sing with voices like reed pipes. Wondrous visions and resplendent scenes—this is the true delight within the alchemical crucible, the distinct landscape of the grotto-heaven. One roams at will, oblivious to the burdens of the dusty world. At this moment of true emptiness, the qi circulates of itself, without need for method or adherence to time.\n\nIf a green qi emerges from the east, accompanied by the bright strains of reed pipes and drums, with banners, chariots, and attendants—uncountable in number—appearing on all sides, soon a red qi arises from the south, a white qi from the west, a black qi from the north, and a yellow qi from the center. The five qi converge to form iridescent clouds, while music resounds in joyful tumult. Jade maidens and golden youths surround and support one’s body, some riding fiery dragons, some mounting black cranes, some journeying on rainbow phoenixes, some astride fierce tigers. Ascending into the void, they descend from above. Wherever they pass, towers and palaces manifest, too numerous to recount; divine officials and immortals appear, beyond full description. Arriving at another place, ten thousand ranks of female musicians stand in ordered rows, like the courtly procession of an earthly emperor. Sages and worthies gather in full assembly. At this moment, one remains unmoved by all around, ascending in one’s chariot until reaching a gate. The guards stand in solemn array, unapproachable. On all sides, officials, attendants, and musicians linger in reluctance, yet one ultimately passes through the gate without hindrance. The canopy of the chariot veils the face as one descends from above, returning to the former dwelling. Such ascents occur repeatedly, without number—this is the method of refining the spirit to exit the shell.\n\nWith days of accumulation and mastery, one ascends in a single motion to the celestial palace and descends in one motion to the original abode, moving up and down without the slightest obstruction. Then, ascending from below, one may climb a seven-tiered jeweled pagoda or ascend a three-story jade tower. At first, step by step, one climbs the seven tiers to the summit, yet must not look downward, lest the spirit be startled and cling to the body, failing to emerge. Once atop the seventh tier, close the eyes and leap as if in slumber or trance. A body exists outside the body, its form like that of an infant, its skin fresh and radiant, its spirit luminous. Looking back at the former shell, one sees nothing—only what resembles a dung heap or a withered tree. Shame and revulsion arise in full measure, yet one cannot immediately abandon it and wander afar. For the spirit’s exit is not yet perfected, and the sagely qi has congealed into form. One must re-enter the original body, coming and going freely, roaming at will. At first, one step, then two; then two leagues, then three. With days of accumulation and mastery, one moves like a warrior extending an arm—able to traverse a thousand or ten thousand leagues. The form and spirit grow robust, the courage steadfast. Then, one may entrust the mortal frame to a famous mountain or sacred realm, dwelling beyond the world of transient appearances, no longer equated with the vulgar. When merit is complete, one receives the celestial writ, rides simurghs and phoenixes, mounts tigers and dragons, journeying east and west to enter the Purple Palace. First, one meets the True Lord of the Grand Tenuity, then resides on the lower isles. To ascend to the grotto-heaven, one must transmit the Dao and accumulate merit among mortals, receive the celestial writ, and rise to the grotto-heaven as a celestial immortal.\n\nFew in ancient or modern times have succeeded in this practice, for most seek to hasten the process before their merit is complete, or attempt this path prematurely. Some, though their merit remains unverified, merely engage in quiet sitting, hoping for transcendence. Others, with unresolved yin spirits, become ghost immortals—unseen in form, wandering at will, yet ultimately without refuge, forced to seize mortal bodies and be reborn as humans. Some, unskilled in exit and entry, lack the method for return; once departed, they cannot re-enter their original body, and their spirit drifts without destination—this is the \"sitting transformation\" of Buddhist monks or the \"corpse liberation\" of Daoist adepts. Thus, in pursuing this path, one must ensure that prior merit is verified and correct, and choose a site to construct a chamber, far from all foul and putrid substances, noxious vapors, passing sounds, and the allure of women—lest they disturb the true qi and repulse the spirit.\n\nIf one exits and re-enters, enters and does not exit, then form and spirit attain perfection, matching the years of heaven and earth, enduring through eons without death. If one enters and then exits without re-entering, it is like the cicada shedding its husk—shifting the spirit to sagehood. This is transcending the mortal and shedding the mundane, becoming a true person and immortal child, dwelling beyond the dusty world, residing on the Three Isles and Ten Continents.\n\n*The Essentials of the Dao* states: \"The dharma of non-extinction has already ceased.\"\n\nThe above pertains to the three gates of the Great Vehicle, belonging to the celestial immortals.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "灵宝毕法 正阳真人钟离权云房序 道不可以言传，不可以名纪，历古以来，升仙达道者不为少矣。 仆志慕前贤，心怀大道，不意运起刀兵，时危世乱，始以逃生，寄迹江湖岩谷，退而识性，留心惟在清净希夷。 历看丹经，累参道友，止言养命之小端，不说真仙之大道。 因于终南山石壁间，获收《灵宝经》三十卷：上部《金诰书》，元始所着； 中部《玉书录》，元皇所述； 下部《真源义》，太上所传：共数千言。 予宵衣旰食，远虑深省，乃悟阴中有阳，阳中有阴，本天地升降之宜，气中生水，水中生气，亦心肾交合之理，比物之象，道不远人。 配合甲庚，方验金丹有准； 抽添卯酉，自然火候无差。 红铅黑铅，彻底不成大药； 金液玉液，到头方是还丹。 从无入有，尝怀征战之心； 自下升高，渐入希夷之域。 抽铅汞，致二八之阴消； 换骨炼形，使九三之阳长。 水源清浊，辨于既济之时； 内景真虚，识于坐忘之日。 玄机奥旨，难以尽形方册； 灵宝妙理，可用入圣超凡。 总而为三乘之法，名《灵宝毕法》。 大道圣言，不敢私于一己，用传洞宾足下，道成勿秘，当贻后来之士。 上卷小乘安乐延年法四门 匹配阴阳第一 《玉书》曰：“大道无形，视听不可以见闻； 大道无名，度数不可以筹算。 资道生形，因形立名，名之大者，天地也。 天得乾道而积气以覆于下，地得坤道而托质以载于上，覆载之间，上下相去八万四千里。 气质不能相交，天以乾索坤而还于地中，其阳负阴而上升； 地以坤索乾而还于天中，其阴抱阳而下降，一升一降运于道，所以天地长久。 《真源》曰：天地之间，亲乎上者为阳，自上而下四万二千里，乃曰阳位； 亲乎下者为阴，自下而上四万二千里，乃曰阴位。 既有形名，难逃度数，且一岁者，四时、八节、二十四气、七十二候、三百六十日、四千三百二十辰。 十二辰为一日，五日为一候，三候为一气，三气为一节，二节为一时，四时为一岁。 一岁以冬至节为始，是时也，地中阳升，凡一气十五日，上升七千里，三气为一节，一节四十五日，阳升共二万一千里，二节为一时，一时九十日，阳升共四万二千里，正到天地之中，而阳合阴位，是时阴中阳半，其气为温，而时当春分之节也。 过此阳升而入阳位，方曰得气而升，亦如前四十五日立夏。 立夏之后，四十五日夏至，夏至之节阳升，通前计八万四千里以到天，乃阳中有阳，其气热，积阳生阴，一阴生于二阳之中。 自夏至之节为始，是时也，天中阴降，凡一气十五日，下降七千里，三气为一节，一节四十五日，阴降共二万一千里，二节为一时，一时九十日，阴降共四万二千里，以到天地之中，而阴交阳位，是时阳中阴半，共气为凉，而时当秋分之节也。 过此阴降而入阴位，方曰得气而降，亦如前四十五日立冬，立冬之后，四十五冬至，冬至之节阴降，通前计八万四千里以到地，乃阴中有阴，其气寒，积阴生阳，一阳生于二阴之中。 自冬至之后，一阳复生，如前运行不已，周而复始，不失于道。 冬至阳生，上升而还天，夏至阴生，下降而还地。 夏至阳升到天，而一阴来至，冬至阴降到地，而一阳来至，故曰夏至、冬至。 阳升于上，过春分而入阳位，以离阴位，阴降于下，过秋分而入阴位，以离阳位，故曰春分、秋分。",
      "translated_text": "**Preface to *The Complete Methods of the Numinous Treasure* by Zhongli Quan, Perfected of True Yang, styled Yunfang**\n\nThe Dao cannot be transmitted through words, nor can it be recorded by name. Since ancient times, those who ascended as immortals and attained the Dao have been many. I, in admiration of the former worthies, have long cherished the Great Dao in my heart. Yet unexpectedly, the age turned to warfare, and in perilous times, I first fled for survival, taking refuge in rivers and lakes, mountains and valleys. Retreating thus, I came to know my nature, and my mind dwelled only in purity, stillness, and the formless.\n\nI perused the alchemical classics and repeatedly consulted fellow Daoists, yet they spoke only of minor arts for nourishing life, never of the great Dao of true immortality. Then, within the stone cliffs of Mount Zhongnan, I obtained the *Scriptures of the Numinous Treasure* in thirty scrolls: the upper section, *The Golden Declarations*, composed by the Primordial Beginning; the middle section, *The Jade Record*, expounded by the Primordial Sovereign; and the lower section, *The True Source of Principle*, transmitted by the Most High. Together, they comprise several thousand words.\n\nI rose early and ate late, pondering deeply, and at last awakened to the truth: within yin there is yang, and within yang there is yin—this is the proper ascent and descent of Heaven and Earth. Qi generates water, and water generates qi—this is the principle of the union of heart and kidney. Comparing these phenomena, one sees that the Dao is not far from humanity.\n\nBy harmonizing *jia* and *geng*, one verifies the precision of the Golden Elixir; by adjusting *mao* and *you*, the fire timing naturally becomes flawless. Red lead and black lead, when exhausted, do not form the great medicine; only golden fluid and jade fluid, at their culmination, are the Returned Elixir. From non-being to being, one must harbor the resolve for struggle; from below to above, one gradually enters the realm of the formless and silent.\n\nDrawing out lead and mercury, one causes the dissipation of the two eights of yin; refining the bones and tempering the form, one allows the growth of the nine threes of yang. The clarity or turbidity of the water’s source is discerned at the moment of completion; the true emptiness of the inner vision is recognized on the day of seated forgetfulness. The mysterious mechanism and profound subtleties are difficult to fully express in written form; the wondrous principles of the Numinous Treasure may be employed to transcend the mundane and enter sagehood.\n\nCompiling these into the three vehicles’ methods, I name them *The Complete Methods of the Numinous Treasure*. The sacred words of the Great Dao must not be hoarded by one alone. I transmit them to Lü Dongbin; when the Dao is achieved, do not conceal them, but bequeath them to later scholars.\n\n---\n\n**Volume One: Lesser Vehicle Methods for Peace, Bliss, and Longevity**\n**Four Gates**\n**First Gate: The Union of Yin and Yang**\n\n*The Jade Record* states: “The Great Dao is formless; sight and hearing cannot perceive it. The Great Dao is nameless; calculations and measures cannot fathom it. It gives rise to form through the Dao, and names are established based on form. The greatest of names are Heaven and Earth. Heaven attains the Dao of *qian* and accumulates qi to cover below; Earth attains the Dao of *kun* and bears substance to support above. Between the covering and bearing, the distance between above and below is eighty-four thousand *li*. Qi and substance cannot interact, so Heaven seeks *kun* within Earth, and its yang, bearing yin, ascends; Earth seeks *qian* within Heaven, and its yin, embracing yang, descends. This ascent and descent, circulating through the Dao, is why Heaven and Earth endure.”\n\n*The True Source* states: “Between Heaven and Earth, that which is close to above is yang; from above downward forty-two thousand *li* is called the yang position. That which is close to below is yin; from below upward forty-two thousand *li* is called the yin position. Once form and name exist, they cannot escape measurement. Consider a year: it consists of four seasons, eight nodes, twenty-four qi, seventy-two pentads, three hundred sixty days, and four thousand three hundred twenty hours. Twelve hours make a day, five days make a pentad, three pentads make a qi, three qi make a node, two nodes make a season, and four seasons make a year.\n\nA year begins with the Winter Solstice node. At this time, yang ascends from within Earth. Each qi lasts fifteen days, rising seven thousand *li*; three qi make a node, forty-five days in total, with yang ascending twenty-one thousand *li*. Two nodes make a season, ninety days in total, with yang ascending forty-two thousand *li*, reaching precisely the center of Heaven and Earth, where yang meets the yin position. At this time, yin contains half yang, its qi is warm, and the season corresponds to the Spring Equinox node.\n\nBeyond this, yang continues to ascend into the yang position, now said to ‘attain qi and rise.’ Similarly, after forty-five days comes the Beginning of Summer. After another forty-five days, the Summer Solstice arrives. At the Summer Solstice node, yang has ascended a total of eighty-four thousand *li* to reach Heaven, where yang contains yang, its qi is hot, and accumulated yang generates yin—one yin arises within two yangs.\n\nBeginning with the Summer Solstice node, yin descends from within Heaven. Each qi lasts fifteen days, descending seven thousand *li*; three qi make a node, forty-five days in total, with yin descending twenty-one thousand *li*. Two nodes make a season, ninety days in total, with yin descending forty-two thousand *li*, reaching the center of Heaven and Earth, where yin meets the yang position. At this time, yang contains half yin, its qi is cool, and the season corresponds to the Autumn Equinox node.\n\nBeyond this, yin continues to descend into the yin position, now said to ‘attain qi and descend.’ Similarly, after forty-five days comes the Beginning of Winter. After another forty-five days, the Winter Solstice arrives. At the Winter Solstice node, yin has descended a total of eighty-four thousand *li* to reach Earth, where yin contains yin, its qi is cold, and accumulated yin generates yang—one yang arises within two yins.\n\nAfter the Winter Solstice, one yang is reborn, and the cycle continues without cease, ever returning to the Dao. At the Winter Solstice, yang is born, ascending to return to Heaven; at the Summer Solstice, yin is born, descending to return to Earth. When yang ascends to Heaven at the Summer Solstice, one yin arrives; when yin descends to Earth at the Winter Solstice, one yang arrives—hence the terms Summer Solstice and Winter Solstice.\n\nYang ascends above, passing the Spring Equinox to enter the yang position, departing from the yin position; yin descends below, passing the Autumn Equinox to enter the yin position, departing from the yang position—hence the terms Spring Equinox and Autumn Equinox.”",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1266,
      "start_sentence": 0,
      "end_sentence": 43,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.556108474731445,
      "metadata": {
        "source_file": "dao\\藏外\\灵宝毕法.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "凡冬至阳升之后，自上而下，非无阴降也，所降之阴乃阳中之馀阴，止于阳位中消散而已，纵使下降得位，与阳升相遇，其气绝矣； 凡夏至阴降之后，自下而上，非无阳升也，所升之阳乃阴中之馀阳，止于阴位中消散而已，纵使上升得位，与阴降相遇，其气绝矣。 阴阳升降，上下不出于八万四千里，往来难逃于三百六十日，即温凉寒热之四气而识阴阳，即阳升阴降之八节而知天地。 以天机测之，庶达天道之绪馀。 若以口耳之学，较量于天地之道，安得筹算而知之乎？ 《比喻》曰：道生万物，天地乃物中之大者，人为物中之灵者。 别求于道，人同天地，以心比天，以肾比地，肝为阳位，肺为阴位。 心肾相去八寸四分，其天地覆载之间比也。 气比阳而液比阴。 子午之时，比夏至、冬至之节； 卯酉之时，比春分、秋分之节。 以一日比一年。 以一日用八卦，时比八节，子时肾中气生，卯时气到肝，肝为阳，其气旺，阳升以入阳位，春分之比也，午时气到心，积气生液，夏至阳升到天而阴生之比也； 午时心中液生，酉时液到肺，肺为阴，其液盛，阴降以入阴位，秋分之比也，子时液到肾，积液生气，冬至阴降到地而阳生之比也。 周而复始，日月循环，无损无亏，自可延年。 《真诀》曰：天地之道一得之，惟人也，受形于父母，形中生形，去道愈远。 自胎元气足之后，六欲七情，耗散元阳，走失真炁，虽有自然之气液相生，亦不得如天地之升降，且一呼元气出，一吸元气入，接天地之气，既入不能留之，随呼而复出，本宫之气，反为天地夺之，是以气散难生液，液少难生气。 当其气旺之时，日用钌卦，而于气也，多入少出，强留在腹，当时自下而升者不出，自外而入者暂住，二气相合，积而生五脏之液，还元愈多，积日累功，见验方止。 《道要》曰：欲见阳公长子，须是多入少出。 从他儿女相争，过时求取真的。 此乃积气生液，积液生气，匹配气液相生之法也。 行持不过一年，夺功以一岁三百日为期。 旬日见验，进得饮食，而疾病消除，头目清利，而心腹空快，多力少倦，腹中时闻风雷之声，馀验不可胜纪。 解曰：阳公长子者，乾索于坤，如气升而上也。 儿日气，自肾中升； 女是液，自心中降。 相争，儿女上下之故。 闭气而生液，积液而生气，匹配两停，过时自得真水也 真解曰：此乃下手之初，于卯卦阳升气旺之时，多吸天地之正气以入，少呼自己之元气以出，使二气相合，气积而生液，液多而生气，乃匹配阴阳，气液相生之法也。 聚散水火第二 《金诰》曰：所谓大道者，高而无上，引而仰观，其上无上，莫见其首； 所谓大道者，卑而无下，俛而俯察，其下无下，莫见其基。 始而无先，莫见其前； 终而无尽，莫见其后。 大道之中而生天地，天地有高下之仪； 天地之中而有阴阳，阴阳有始终之数。 一上一下，仰观俯察，可以测其机； 一始一终，度数推算，可以得其理。 以此推之，大道可知也。 《真源》曰：即天地上下之位，而知天地之高卑； 即阴阳终始之期，而知天道之前后。 天地不离于数，数终于一岁； 阴阳不失其宜，宜分于八节。 科至一阳生，春分阴中阳半，过此纯阳而阴尽，夏至阳太极而一阴生，秋分阳中阴半，过此纯阴而阳尽，冬至阴太极而一阳生，升降如前，上下终始，虽不能全尽大道，而不失大道之本，欲识大道，当取法于天地，而审于阴阳之宜也。",
      "translated_text": "After the Winter Solstice, as yang ascends from above downward, it is not that yin does not descend—what descends is merely the residual yin within yang, dissipating only within the yang position. Even if it descends to its proper place and encounters ascending yang, its qi is already exhausted. After the Summer Solstice, as yin descends from below upward, it is not that yang does not ascend—what ascends is merely the residual yang within yin, dissipating only within the yin position. Even if it ascends to its proper place and encounters descending yin, its qi is already exhausted.\n\nThe ascent and descent of yin and yang, above and below, do not exceed eighty-four thousand *li*, and their comings and goings cannot escape the three hundred and sixty days. Through the four qi of warmth, coolness, cold, and heat, one discerns yin and yang; through the eight nodes of yang ascending and yin descending, one understands Heaven and Earth. Measuring with the mechanism of Heaven, one may grasp the remnants of the Heavenly Dao. If one relies on mere hearsay to weigh the Dao of Heaven and Earth, how can one calculate and comprehend it?\n\nThe *Analogy* states: The Dao gives birth to the myriad things, and among them, Heaven and Earth are the greatest, while humans are the most spiritually endowed. Seeking the Dao separately, humans are akin to Heaven and Earth—compare the heart to Heaven, the kidneys to Earth; the liver is the yang position, the lungs the yin position. The distance between heart and kidneys is eight *cun* and four *fen*, which mirrors the space between Heaven’s covering and Earth’s bearing. Qi corresponds to yang, and fluids correspond to yin. The *zi* and *wu* hours correspond to the Summer Solstice and Winter Solstice; the *mao* and *you* hours correspond to the Spring Equinox and Autumn Equinox. One day is likened to one year. Using the eight trigrams within a day, the hours correspond to the eight nodes. At the *zi* hour, qi is born in the kidneys; at the *mao* hour, qi reaches the liver—the liver is yang, its qi flourishes, and yang ascends to enter the yang position, corresponding to the Spring Equinox. At the *wu* hour, qi reaches the heart, and accumulated qi generates fluids, corresponding to the Summer Solstice when yang ascends to Heaven and yin is born. At the *wu* hour, fluids are born in the heart; at the *you* hour, fluids reach the lungs—the lungs are yin, their fluids abound, and yin descends to enter the yin position, corresponding to the Autumn Equinox. At the *zi* hour, fluids reach the kidneys, and accumulated fluids generate qi, corresponding to the Winter Solstice when yin descends to Earth and yang is born. Revolving and returning, day and night circulate without loss or depletion, naturally prolonging life.\n\nThe *True Formula* states: The Dao of Heaven and Earth is grasped in one attainment, yet humans, shaped by their parents, generate form within form, drifting ever farther from the Dao. After the primordial qi of the embryo is sufficient, the six desires and seven emotions dissipate original yang, scattering true qi. Though natural qi and fluids generate one another, they do not ascend and descend like those of Heaven and Earth. With each exhalation, original qi departs; with each inhalation, original qi enters, connecting with the qi of Heaven and Earth. Yet once entered, it cannot be retained—following the exhalation, it departs again. The qi of one’s own palace is instead seized by Heaven and Earth. Thus, scattered qi struggles to generate fluids, and scant fluids struggle to generate qi. When qi is abundant, employ the *ding* trigram daily: for qi, inhale more and exhale less, forcibly retaining it in the abdomen. At that time, what ascends from below does not depart, and what enters from outside temporarily abides. The two qi converge, accumulating to generate the fluids of the five viscera, replenishing the origin ever more. Through daily accumulation, cease only upon seeing results.\n\nThe *Essentials of the Dao* states: To meet the eldest son of yang, one must inhale more and exhale less. Let the children contend, and after the time has passed, seek the true. This is the method of accumulating qi to generate fluids, accumulating fluids to generate qi, and harmonizing the mutual generation of qi and fluids. Practicing for no more than a year, seize the achievement with three hundred days as the term. Within ten days, one sees results: appetite improves, illnesses vanish, the head and eyes clear, the heart and abdomen feel light and unburdened, strength increases, fatigue lessens, and within the abdomen, the sound of wind and thunder is sometimes heard. Further effects are too numerous to record.\n\nThe *Explanation* states: The eldest son of yang is when *qian* seeks from *kun*, like qi ascending upward. The \"child\" is qi, ascending from the kidneys; the \"daughter\" is fluids, descending from the heart. Their contention arises from the ascent and descent of children. By restraining qi, fluids are generated; by accumulating fluids, qi is generated. Harmonizing the two, after the time has passed, one attains true water.\n\nThe *True Explanation* states: This is the initial step—during the *mao* trigram, when yang ascends and qi flourishes, inhale more of Heaven and Earth’s true qi and exhale less of one’s own original qi, allowing the two qi to converge. Qi accumulates to generate fluids, and abundant fluids generate qi—this is the method of harmonizing yin and yang, the mutual generation of qi and fluids.\n\n**Gathering and Dispersing Water and Fire, Second**\n\nThe *Golden Edict* states: The so-called Great Dao is lofty without superior. Looking up to observe it, above it there is no above—its beginning cannot be seen. The so-called Great Dao is lowly without inferior. Looking down to examine it, below it there is no below—its foundation cannot be seen. It begins without precedence—its front cannot be seen; it ends without exhaustion—its rear cannot be seen. Within the Great Dao, Heaven and Earth are born. Heaven and Earth possess the forms of high and low; within Heaven and Earth, yin and yang exist, and yin and yang possess the numbers of beginning and end. One ascends, one descends—looking up and down, one may gauge its mechanism. One begins, one ends—measuring and calculating, one may grasp its principle. By this, the Great Dao can be known.\n\nThe *True Source* states: From the positions of Heaven and Earth above and below, one knows the height and lowness of Heaven and Earth; from the periods of yin and yang’s beginning and end, one knows the before and after of the Heavenly Dao. Heaven and Earth do not depart from numbers, and numbers conclude in one year. Yin and yang do not lose their proper timing, and their timing divides at the eight nodes. When the first yang is born, at the Spring Equinox, yang is half within yin. Beyond this, pure yang prevails and yin is exhausted. At the Summer Solstice, yang reaches the Supreme Ultimate, and one yin is born. At the Autumn Equinox, yin is half within yang. Beyond this, pure yin prevails and yang is exhausted. At the Winter Solstice, yin reaches the Supreme Ultimate, and one yang is born. Ascending and descending as before, above and below, beginning and end—though one cannot fully exhaust the Great Dao, one does not lose its essence. To understand the Great Dao, one must model it on Heaven and Earth and examine the proper timing of yin and yang.",
      "overlap_context": "in is born, descending to return to Earth. When yang ascends to Heaven at the Summer Solstice, one yin arrives; when yin descends to Earth at the Winter Solstice, one yang arrives—hence the terms Summer Solstice and Winter Solstice.\n\nYang ascends above, passing the Spring Equinox to enter the yang position, departing from the yin position; yin descends below, passing the Autumn Equinox to enter the yin position, departing from the yang position—hence the terms Spring Equinox and Autumn Equinox.”",
      "start_char": 1266,
      "end_char": 2581,
      "start_sentence": 44,
      "end_sentence": 87,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.67062783241272,
      "metadata": {
        "source_file": "dao\\藏外\\灵宝毕法.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "《比喻》曰：以心肾比天地，以气液比阴阳，以一日比一年。 日用艮卦比一年，用立春之节，乾卦比一年，用立冬之节。 天地之中，亲乎下者为阴，自下而上四万二千里，乃曰阴位，冬至阳生而上升，时当立春，阳升于阴位之中二万一千里，是阳难胜于阴也； 天地之中，亲乎上者为阳，自上而下四万二千里，乃曰阳位，夏至阴生而下降，时当立秋，阴降于阳位之中二万一千里，是阴难胜于阳也。 时当立夏，阳升而上，离地六万三千里，去天二万一千里，是阳得位而阴绝也； 时当立冬，阴降而下，离天六万三千里，去地二万一千里，是阴得位而阳绝也。 一年之中，立春比一日之时，艮卦也，肾气下传膀胱，在液中微弱，乃阳气难升之时也； 一年之中，立冬比一日之时，乾卦也，心液下入，将欲还元，复入肾中，乃阴盛阳绝之时也。 人之致病者，惟阴阳不和，阳微阴多，故病多。 《真诀》曰：阳升立春，自下而上，不日而阴中阳半矣； 阴降立冬，自上而下，不日而阳中阴半矣。 天地之道如是，惟人也，当退卦气微，不知养气之端，乾卦气散，不知聚气之理，日夕以六欲七情耗散元阳，使真气不旺，走失真气，使真液不生，所以不得如天地之长久，故古人朝屯幕蒙，日用二卦，乃得长生在世。 朝屯者，盖取一阳在下，屈而未伸之义，其在我者，养而伸之，勿使耗散； 幕蒙者，盖取童蒙求我，以就明弃暗，乃阴间求阳之义，其在我者，昧而明之，勿使走失。 是以日出当用艮卦之时，以养元气，勿以利名动其心，勿以好恶介其意，当披衣静坐，以养其气，绝念忘情，微作导引，手脚递互伸缩三五下，使四体之气齐生，内保元气上升，以朝于心府，或咽津一两口，搓摩头面三二十次，河出终夜壅聚恶浊之气，久而色泽弃美，肌肤光润。 又于日入当用乾卦之时，以聚元气，当入室静坐，咽气搐外肾，咽气者是纳心火于下，搐外肾者是收膀胱之气于内。 使上下相合肾气之火，三火聚而为一，以补暖下田，无液则聚气生液，有液则炬液生气，名曰聚火，又曰太乙含真气也。 早朝咽津摩面，手足递第一线伸缩，名曰散火，又名曰小炼形也。 《道要》曰：花残叶落深秋，玉人懒上危楼。 欲得君民和会，当时宴罢频收。 此纳心气而收膀胱气，不令耗散，而相合肾气，以接坎卦气海中新生之气也。 必以立冬为首，见验方止，行持不过一年，夺功以一岁三百日为期。 旬日见验，容颜光泽，肌肤充悦，下田温暖，小便减省，四体轻健，精神清爽，痼疾宿病，尽皆消除。 如惜岁月，不倦行持，只于匹配阴阳功内，稍似见验，叙入此功，日用添入艮卦，略行此法，乾卦三元用事，应验方止。 解曰：花残叶落深秋者，如人气弱，日幕之光，阳气散而不升，故曰“懒上危楼”。 楼者，十二重楼也。 心为君火，膀胱民火，咽气搐外肾，使心与外肾气聚而为一，故曰“和会”。 宴乃咽也，收乃搐也。 早晨功不绝者，此法为主本也。 真解曰：艮卦阳气微，故微作导引伸缩，咽津摩面，而散火于四体，以养元气。 乾卦阳气散，故咽心气，搐外肾，以合肾气，使三火聚而为一，以聚元气，故曰“聚散水火”，使根厚牢固也。 交媾龙虎第三",
      "translated_text": "The *Simile* states: Compare heart and kidney to Heaven and Earth, qi and fluids to yin and yang, and one day to one year. In daily practice, the *Gen* hexagram corresponds to one year, applied at the *Lichun* (Beginning of Spring) solar term, while the *Qian* hexagram corresponds to one year, applied at the *Lidong* (Beginning of Winter) solar term.\n\nAt the center of Heaven and Earth, that which inclines toward the lower is yin. From below upward, forty-two thousand *li* marks the yin position. At the Winter Solstice, yang is born and ascends; when the time reaches *Lichun*, yang has risen twenty-one thousand *li* within the yin position—this is when yang struggles to overcome yin. At the center of Heaven and Earth, that which inclines toward the upper is yang. From above downward, forty-two thousand *li* marks the yang position. At the Summer Solstice, yin is born and descends; when the time reaches *Liqiu* (Beginning of Autumn), yin has descended twenty-one thousand *li* within the yang position—this is when yin struggles to overcome yang.\n\nWhen the time reaches *Lixia* (Beginning of Summer), yang ascends to its peak, sixty-three thousand *li* from the earth and twenty-one thousand *li* from Heaven—this is when yang attains its proper position and yin is extinguished. When the time reaches *Lidong*, yin descends to its peak, sixty-three thousand *li* from Heaven and twenty-one thousand *li* from the earth—this is when yin attains its proper position and yang is extinguished.\n\nWithin one year, *Lichun* corresponds to a moment in a single day, represented by the *Gen* hexagram. At this time, kidney qi descends to the bladder, weak within the fluids—this is when yang qi struggles to ascend. Within one year, *Lidong* corresponds to a moment in a single day, represented by the *Qian* hexagram. At this time, heart fluids descend and prepare to return to their origin, re-entering the kidneys—this is when yin prevails and yang is extinguished.\n\nThe cause of human illness lies solely in the disharmony of yin and yang, where yang is weak and yin excessive—thus, illness is frequent. The *True Formula* states: At *Lichun*, yang ascends from below upward, and in no time, yang is half within yin. At *Lidong*, yin descends from above downward, and in no time, yin is half within yang. The Dao of Heaven and Earth is thus. Only humans, when the qi of the *Gen* hexagram is faint, fail to recognize the method of nurturing qi; when the qi of the *Qian* hexagram scatters, they do not understand the principle of gathering qi. Day and night, the six desires and seven emotions deplete original yang, causing true qi to wane and scatter, preventing the generation of true fluids. Thus, one cannot attain the longevity of Heaven and Earth. Therefore, the ancients practiced the *Zhun* and *Meng* hexagrams daily, achieving long life in the world.\n\n*Morning Zhun* takes the meaning of one yang lying below, bent and not yet extended. For oneself, one nurtures and extends it, preventing its dissipation. *Evening Meng* takes the meaning of a child seeking enlightenment from me, turning from darkness to light—this is the principle of yin seeking yang. For oneself, one transforms obscurity into clarity, preventing the loss of yang.\n\nThus, at sunrise, when the *Gen* hexagram is in effect, one should nurture original qi. Do not let profit and fame disturb the heart, nor likes and dislikes interfere with the mind. One should don clothes and sit in stillness to cultivate qi, eliminating thoughts and forgetting emotions. Gently perform *daoyin*, alternately stretching and contracting the hands and feet three to five times, so that the qi of the four limbs arises evenly. Internally, preserve original qi as it ascends to the heart palace. Swallow saliva once or twice, and rub the face twenty to thirty times. The *He* (Yellow River) flows all night, damming up turbid and foul qi. Over time, the complexion becomes lustrous, the skin radiant.\n\nAt sunset, when the *Qian* hexagram is in effect, one should gather original qi. Enter a quiet chamber and sit in stillness. Swallow qi and retract the external kidneys. Swallowing qi draws heart fire downward; retracting the external kidneys gathers bladder qi inward. This unites the fire of kidney qi above and below, merging the three fires into one to warm and supplement the lower *dantian*. Without fluids, gather qi to generate fluids; with fluids, burn fluids to generate qi. This is called *gathering fire*, also known as *Taiyi containing true qi*.\n\nIn the early morning, swallowing saliva and rubbing the face, alternately stretching and contracting the hands and feet slightly, is called *dispersing fire*, also known as *minor refinement of form*.\n\nThe *Essentials of the Dao* states:\n*When flowers wither and leaves fall in late autumn,*\n*The jade-like person grows weary of ascending the high tower.*\n*To harmonize ruler and people,*\n*One must frequently swallow after feasting and gather inward.*\n\nThis means drawing heart qi downward and gathering bladder qi to prevent dissipation, uniting them with kidney qi to connect with the newly generated qi in the *Kan* hexagram’s sea of qi. One must begin at *Lidong* and continue until results are verified, practicing for no more than a year, with the goal set at three hundred days. Within ten days, results appear: the complexion becomes lustrous, the skin plump and radiant, the lower *dantian* warm, urination reduced, the four limbs light and strong, the spirit clear and refreshed, chronic and long-standing illnesses all vanish.\n\nIf one cherishes time and practices diligently, even within the *matching yin and yang* practice, slight results may appear. Incorporate this method, adding the *Gen* hexagram to daily practice, and briefly apply this technique. When the three origins of the *Qian* hexagram take effect, cease upon verification.\n\nExplanation: *\"When flowers wither and leaves fall in late autumn\"* describes a person whose qi is weak. At sunset, yang qi scatters and fails to ascend—hence, *\"grows weary of ascending the high tower.\"* The *tower* refers to the twelve-storied tower (the throat). The heart is the ruler fire, the bladder the people’s fire. Swallowing qi and retracting the external kidneys unites heart and external kidney qi into one—hence, *\"harmonize.\"* *Feasting* means swallowing; *gathering* means retracting. The morning practice is the foundation of this method.\n\nTrue Explanation: The *Gen* hexagram’s yang qi is faint, so one gently performs *daoyin*, stretching and contracting, swallowing saliva and rubbing the face to disperse fire throughout the four limbs and nurture original qi. The *Qian* hexagram’s yang qi scatters, so one swallows heart qi and retracts the external kidneys to unite kidney qi, merging the three fires into one to gather original qi. This is called *\"gathering and dispersing water and fire,\"* strengthening the root. *Third: The Union of Dragon and Tiger.*",
      "overlap_context": "yang reaches the Supreme Ultimate, and one yin is born. At the Autumn Equinox, yin is half within yang. Beyond this, pure yin prevails and yang is exhausted. At the Winter Solstice, yin reaches the Supreme Ultimate, and one yang is born. Ascending and descending as before, above and below, beginning and end—though one cannot fully exhaust the Great Dao, one does not lose its essence. To understand the Great Dao, one must model it on Heaven and Earth and examine the proper timing of yin and yang.",
      "start_char": 2583,
      "end_char": 3815,
      "start_sentence": 88,
      "end_sentence": 119,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.9874849319458,
      "metadata": {
        "source_file": "dao\\藏外\\灵宝毕法.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "《金诰》曰：太元初判而有太始，太始之中而有太无，太无之中而有太虚，太虚之中而有太空，太空之中而有太质，太质者，天地清浊之质也。 其质如卵而玄黄之色，乃太空之中一物而已。 阳升到天，太极而生阴，以窈冥抱阳而下降； 阴降到地，太极而生阳，以恍惚负阴而上升。 一程式一降，阴降阳升，天地行道，万物生成。 《真源》曰：天如覆盆，阳到难升； 地如盘石，阴到难入。 冬至而地中阳升，夏至到天，其阳太极而阴生，所以阴生者，以阳自阴中来，而起于地，恍恍惚惚，气中有水，其水无形，夏至到天，积气成水，是曰“阳太极而阴生”也； 夏至而天中阴降，冬至到地，其阴太极而阳生，所以阳生者，以阴自阳中来，而出于天，杳杳冥冥，水中有气，其气无形，冬至到地，积水生气，是曰“阴太极而阳生”也。 《比喻》曰：以身外比太空，以心肾比天地，以气液比阴阳，以子午比冬夏。 子时乃曰坎卦，肾中气生； 午时乃曰离卦，心中液生。 肾气到心，肾气与心气相合，而太极生液，所以生液者，以气自肾中来，气中有真水，其水无形，离卦到心，接着心气，则太极而生液者如此； 心液到肾，心液与肾水相合，而太极复生于气，所以生气者，以液自心中来，液中有真气，其气无形，坎卦到肾，接着肾水，则太极而生气者如此。 可比阳升阴降，至太极而相生，所生之阴阳，阳中藏水、阴中藏气也。 《真诀》曰：肾中生气，气中有真水； 心中生液，液中有真气。 真水真气，乃真龙真虎也。 阳到天而难升，太极生阴； 阴到地而难入，太极生阳：天地之理如此。 人不得比天地者，六欲七情，感物丧志，而耗散元阳，走失真气。 当了卦肾气到心，神识内定，鼻息少入迟出，绵绵若存，而津满口咽下，自然肾气与心气相合，太极生液； 及坎卦心液到肾，接着肾水，自然心液与肾气相合，太极生气。 以真气恋液，真水恋气，本自相合，故液中有真气，气中有真水，互相交合，相恋而下，名曰交媾龙虎。 若火候无差，抽添合宜，三百日养就真胎，而成大药，乃炼质焚身，朝元超脱之本也。 《道要》曰：一气初回元运，真阳欲到离宫，捉取真龙真虎，玉池春水溶溶。 此恐泄元气而走真水于身外也。 气散难生液，液少而无真气，气水不交，安成大药？ 当此年中用月，以冬至为始，日中用时，以离卦为期。 或以晚年奉道，根元不固，自度虚损而气不足之后，十年之损，一年用功补之，名曰采补还丹。 补之过数，止行此法，名曰水火既济可以延年益寿，乃曰人仙，功验不可备纪。 若补数足，而口生甘津，心境自除，情欲不动，百骸无病，而神光暗中自现，双目时若惊电。 以冬至日为始，谨节用法，三百日脱其真胎，名曰胎仙。 解曰：在外午时为离卦，太阳为真阳，在人心为离宫，元阳为真龙也。 真虎乃肾气中之水，真龙乃心液中之气，口为玉池，津为春水。 直解曰：一气初回元运，以冬至为始，即子月也。 真阳欲到离宫，以离卦为期，即午时也。 真龙者，心液中之气； 真虎者，肾气中之水。 气水相合，乃曰龙虎交媾也。 烧炼丹药第四 《金诰》曰：天地者，大道之形； 阴阳者，大道之气。 寒热温凉，形中有气也；",
      "translated_text": "The *Jin Gao* states: At the primal division of the Great Origin, there arose the Supreme Beginning. Within the Supreme Beginning lay the Supreme Nonbeing; within the Supreme Nonbeing lay the Supreme Void; within the Supreme Void lay the Supreme Emptiness; and within the Supreme Emptiness lay the Supreme Substance. This Supreme Substance was the pure and turbid essence of Heaven and Earth. Its form resembled an egg, its color dark and yellow—merely a single entity within the Supreme Emptiness. When yang ascends to Heaven, at the Supreme Ultimate it generates yin, which, in profound obscurity, embraces yang and descends. When yin descends to Earth, at the Supreme Ultimate it generates yang, which, in boundless vagueness, bears yin and ascends. With each cycle of descent and ascent, yin descends and yang ascends; thus Heaven and Earth enact the Dao, and the myriad things are born and completed.\n\nThe *Zhen Yuan* states: Heaven is like an overturned basin, and when yang reaches it, ascent becomes difficult. Earth is like a slab of stone, and when yin reaches it, entry becomes difficult. At the winter solstice, yang within the Earth ascends; when it reaches Heaven at the summer solstice, its yang attains the Supreme Ultimate and yin is born. The reason yin is born is that yang arises from within yin, emerging from the Earth in a state of indistinct vagueness—qi containing water, though this water has no form. When the summer solstice reaches Heaven, accumulated qi transforms into water; this is called *\"yang attains the Supreme Ultimate and yin is born.\"* At the summer solstice, yin within Heaven descends; when it reaches Earth at the winter solstice, its yin attains the Supreme Ultimate and yang is born. The reason yang is born is that yin arises from within yang, issuing from Heaven in profound obscurity—water containing qi, though this qi has no form. When the winter solstice reaches Earth, accumulated water generates qi; this is called *\"yin attains the Supreme Ultimate and yang is born.\"*\n\nThe *Bi Yu* states: Compare the body’s exterior to the Supreme Emptiness, the heart and kidneys to Heaven and Earth, qi and fluids to yin and yang, and the hours of *zi* and *wu* to winter and summer. The *zi* hour corresponds to the *Kan* hexagram, when qi is born within the kidneys; the *wu* hour corresponds to the *Li* hexagram, when fluids are born within the heart. When kidney qi reaches the heart, it unites with heart qi, and at the Supreme Ultimate, fluids are generated. The reason fluids are generated is that qi arises from within the kidneys—qi containing true water, though this water has no form. When the *Li* hexagram reaches the heart and joins with heart qi, the Supreme Ultimate thus generates fluids. When heart fluids reach the kidneys and join with kidney water, the Supreme Ultimate once more generates qi. The reason qi is generated is that fluids arise from within the heart—fluids containing true qi, though this qi has no form. When the *Kan* hexagram reaches the kidneys and joins with kidney water, the Supreme Ultimate thus generates qi. This may be likened to yang ascending and yin descending, reaching the Supreme Ultimate and generating one another. The yin and yang thus born contain water within yang and qi within yin.\n\nThe *Zhen Jue* states: Qi is born within the kidneys, and within this qi lies true water. Fluids are born within the heart, and within these fluids lies true qi. True water and true qi are the true Dragon and true Tiger. When yang reaches Heaven and ascent becomes difficult, the Supreme Ultimate generates yin; when yin reaches Earth and entry becomes difficult, the Supreme Ultimate generates yang—such is the principle of Heaven and Earth. Humans cannot compare to Heaven and Earth because the six desires and seven emotions, stirred by external things, scatter their original yang and dissipate their true qi. When kidney qi reaches the heart at the *Li* hexagram, the spirit and consciousness settle inwardly; the breath enters lightly and exits slowly, continuous as if present. Saliva fills the mouth and is swallowed, naturally uniting kidney qi with heart qi, and at the Supreme Ultimate, fluids are generated. When heart fluids reach the kidneys at the *Kan* hexagram and join with kidney water, heart fluids naturally unite with kidney qi, and at the Supreme Ultimate, qi is generated. As true qi clings to fluids and true water clings to qi, they are inherently united. Thus, fluids contain true qi and qi contains true water. When they mutually unite and descend in mutual embrace, this is called the *Union of Dragon and Tiger*. If the firing times are without error and the withdrawal and addition are appropriate, after three hundred days the true embryo is nurtured, and the Great Medicine is formed—this is the foundation of refining the body, burning the form, ascending to the origin, and transcending.\n\nThe *Dao Yao* states: When the primal qi first returns to the original movement, true yang is about to reach the *Li* Palace. Seize the true Dragon and true Tiger, and the Jade Pool’s spring waters flow abundantly. This is to prevent the leakage of original qi and the loss of true water beyond the body. If qi scatters, fluids are difficult to generate; if fluids are scant, there is no true qi. Without the union of qi and water, how can the Great Medicine be formed? During this year, use the months, beginning with the winter solstice; during the day, use the hours, awaiting the *Li* hexagram. For those who embrace the Dao in later years, whose root and origin are unstable, who assess their depletion and insufficiency of qi, ten years of depletion require one year of practice to replenish—this is called *Gathering and Replenishing the Cinnabar*. If the replenishment exceeds the required measure, cease this method and practice *Water and Fire Mutually Assisting*, which can prolong life and extend years—this is called the *Human Immortal*, and its efficacy cannot be fully recounted. If the replenishment is sufficient, sweet saliva will fill the mouth, the heart’s realm will be naturally cleared, desires and emotions will not stir, the hundred bones will be free of illness, and the spirit’s radiance will spontaneously appear in darkness, the eyes flashing like lightning. Beginning with the winter solstice, carefully regulate the method for three hundred days to release the true embryo—this is called the *Embryo Immortal*.\n\nExplanation: Externally, the *wu* hour corresponds to the *Li* hexagram, the sun to true yang; within the person, the heart is the *Li* Palace, and original yang is the true Dragon. The true Tiger is the water within kidney qi; the true Dragon is the qi within heart fluids. The mouth is the Jade Pool, and saliva is the spring waters.\n\nDirect Explanation: When the primal qi first returns to the original movement, take the winter solstice as the beginning—this is the *zi* month. When true yang is about to reach the *Li* Palace, await the *Li* hexagram—this is the *wu* hour. The true Dragon is the qi within heart fluids; the true Tiger is the water within kidney qi. When qi and water unite, this is called the *Union of Dragon and Tiger*.\n\n*Refining the Cinnabar Medicine, Fourth*\n\nThe *Jin Gao* states: Heaven and Earth are the forms of the Great Dao; yin and yang are the qi of the Great Dao. Cold, heat, warmth, and coolness—within form lies qi...",
      "overlap_context": "Gen* hexagram’s yang qi is faint, so one gently performs *daoyin*, stretching and contracting, swallowing saliva and rubbing the face to disperse fire throughout the four limbs and nurture original qi. The *Qian* hexagram’s yang qi scatters, so one swallows heart qi and retracts the external kidneys to unite kidney qi, merging the three fires into one to gather original qi. This is called *\"gathering and dispersing water and fire,\"* strengthening the root. *Third: The Union of Dragon and Tiger.*",
      "start_char": 3816,
      "end_char": 5063,
      "start_sentence": 120,
      "end_sentence": 163,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.18556070327759,
      "metadata": {
        "source_file": "dao\\藏外\\灵宝毕法.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "云雾雨露，气中有象也。 地气上升，腾而为云，散而为雨； 天气下降，散而为雾，凝而为露。 积阴过则露为雨、为霜、为雪，积阳过则雾为烟、为云、为霞。 阴中伏阳，阳气不升，击搏而生雷霆； 阳中伏阴，阴气不降，凝固而生雹霰。 阴阳不谐合，相对而生闪电； 阴阳不匹配，乱交而生虹霓。 积真阳以成神，而丽乎天者星辰； 积真阴以成形，而壮乎地者土石。 星辰之大者日月，土石之贵者金玉，阴阳见于有形，上之日月、下之金玉也。 《真源》曰：阴不得阳不生，阳不得阴不成。 积阳而神丽乎天，而大者日月也，日月乃真阳，而得真阴以相成也； 积阴而形壮于地，而贵者金玉也，金玉乃真阴，而得真阳以相生也。 《比喻》曰：真阳比心液中真气，真阴比肾气中真水。 真水不得真气不生，真气不得真水不成。 真水真气，比于离卦，和合于心上肺下，如子母之相恋，夫妇之相爱。 自离至兑，兑卦阴旺阳弱之时，比日月之下弦，金玉之在晦，不可用也。 日月以阴成阳，数足生明； 金玉以阳生阴，气足成宝。 金玉成宝者，盖以气足而进之以阳； 日月生明者，盖以数足而受之以魂。 比于乾卦进火，炼阳无衰，火以加数，而阳长生也。 《真诀》曰：离卦龙虎交媾，名曰采药。 时到乾卦，气液将欲还元，而生膀胱之上，脾胃之下，肾之前，脐之后，肝之左，肺之右，小肠之右，大肠之左。 当时脾气旺而肺气盛，心气绝而肝气弱，真气本以阳气相合而来，阳气既弱，而真气无所恋，徒劳用工。 百采合必于此时，神识内守，鼻息绵绵，以肚腹微胁，脐肾觉热太甚，微放轻勒，腹脐未热，紧勒，渐热即守常，任意放志，以满乾坤，乃曰勒阳关而炼丹药。 使气不上行，以固真水，经脾宫，随呼吸而搬运于命府黄庭之中。 气液造化时，变而为精，精变而为珠，珠变而为汞，汞变而为砂，砂变而为金，乃曰金丹，其功不小矣。 《道要》曰：采药须凭玉兔，成亲必藉黄婆。 等到雍州相见，奏传一曲阳歌。 此乃与采药日用对行，凡以晚年补完十损一补之功，此法名曰炼汞补丹田。 补之数足，止于日用离卦采药，乾卦烧炼勒阳关。 春冬多采少炼，乾一而离二，倍用功也； 秋夏少采多炼，离一而乾二，倍用功也。 随年月气旺，采炼之功效在前，可延年住世而为人仙。 若以补数既足，见验进功，亦谨节用功。 采药一百日药力全，二百日圣胎坚，三百日真气生而胎仙完。 凡药力全而后进火加数，乃曰火候； 凡圣胎坚后，火候加至小周天数，乃曰小周天； 凡胎圆真气生，火候加至大周天数，乃曰周天火候。 采药而交媾龙虎，炼药而进火，方为入道，当绝迹幽居，心存内观，内境不出，外境不入，如妇之养孕，龙之养珠，虽饮食寤寐之间，语默如婴儿，举止如室女，犹恐有失有损，心不可暂离于道也。 解曰：药是心中真气，兔是肾中真水，黄婆是脾中真液，和合气水而入黄庭。 雍州，乾卦。 勒阳关，胁腹也。 右小乘法四门，系人仙。 中卷中乘长生不死法三门 肘后飞金晶第五 《金诰》曰：阴阳升降，不出天地之内，日月运转，而在天地之外。 东西出没，以分昼夜； 南北往来，以定寒暑。 昼夜不息，寒暑相推，积日为月，积月为岁。",
      "translated_text": "Clouds, mist, rain, and dew are the images within qi. Earth’s qi ascends, rising to become clouds and dispersing to become rain; heaven’s qi descends, scattering into mist and condensing into dew. When accumulated yin exceeds, dew transforms into rain, frost, or snow; when accumulated yang exceeds, mist turns into haze, clouds, or rosy dawn. When yang lies hidden within yin and yang qi fails to ascend, striking and clashing produce thunder and lightning; when yin lies hidden within yang and yin qi fails to descend, congealing and solidifying produce hail and graupel. When yin and yang fail to harmonize, their opposition generates lightning; when yin and yang are mismatched, their chaotic union produces rainbows and secondary rainbows. Accumulated true yang forms spirits, which adorn the heavens as stars; accumulated true yin forms shapes, which strengthen the earth as soil and stone. The greatest of stars are the sun and moon; the most precious of soil and stone are metals and jades. Yin and yang manifest in form as the sun and moon above and metals and jades below.\n\n*The True Source* states: Yin cannot generate without yang; yang cannot complete without yin. Accumulated yang spirits adorn the heavens, and the greatest among them are the sun and moon—the sun and moon are true yang, yet they require true yin to achieve completion. Accumulated yin shapes strengthen the earth, and the most precious among them are metals and jades—metals and jades are true yin, yet they require true yang to be generated.\n\n*The Analogy* states: True yang is likened to the true qi within heart fluids; true yin is likened to the true water within kidney qi. True water cannot generate without true qi; true qi cannot complete without true water. True water and true qi, akin to the *Li* hexagram, harmonize between the heart above and the lungs below, like a mother’s love for her child or a husband’s affection for his wife. From *Li* to *Dui*, when the *Dui* hexagram’s yin flourishes and yang weakens, it is like the moon’s last quarter or metals and jades hidden in darkness—useless at this time. The sun and moon complete yang with yin, and when their measure is full, brightness is born; metals and jades generate yin with yang, and when their qi is sufficient, they become treasures. Metals and jades become treasures because their qi is sufficient and further refined by yang; the sun and moon generate brightness because their measure is full and they receive the soul. This is likened to the *Qian* hexagram’s advancing fire, refining yang without decline, adding to the fire’s measure so that yang is perpetually born.\n\n*The True Formula* states: When the Dragon and Tiger unite in the *Li* hexagram, it is called *Gathering the Medicine*. When the time arrives at the *Qian* hexagram, qi and fluids are about to return to their origin, emerging above the bladder, below the spleen and stomach, before the kidneys, behind the navel, to the left of the liver, to the right of the lungs, to the right of the small intestine, and to the left of the large intestine. At this time, spleen qi flourishes and lung qi is abundant, while heart qi ceases and liver qi weakens. True qi originally arrives through union with yang qi, but when yang qi weakens, true qi has nothing to cling to, and efforts are in vain. All gatherings must occur at this moment: guard the spirit within, breathe softly through the nose, and gently contract the abdomen. When warmth is felt near the navel and kidneys, slightly relax the contraction; if the abdomen and navel remain cool, tighten it. Once warmth is achieved, maintain consistency, follow your intent, and fill the cosmos—this is called *Restraining the Yang Gate to Refine the Cinnabar Medicine*. Prevent qi from ascending to secure true water, guide it through the spleen palace, and with each breath, transport it to the *Ming* palace and the Yellow Court. As qi and fluids transform, they become essence; essence transforms into pearls, pearls into mercury, mercury into cinnabar, and cinnabar into gold—this is called the *Golden Elixir*, and its merit is no small matter.\n\n*The Essentials of the Dao* states: Gathering the medicine relies on the Jade Hare; achieving union depends on the Yellow Matron. When they meet in Yongzhou, a melody of yang is played. This is the daily practice of gathering medicine, a method to restore the ten losses of later years with one supplement—this technique is called *Refining Mercury to Supplement the Cinnabar Field*. Once the supplement’s measure is full, one should only gather medicine in the *Li* hexagram and refine it in the *Qian* hexagram by restraining the Yang Gate. In spring and winter, gather more and refine less—*Qian* as one and *Li* as two, doubling the effort. In autumn and summer, gather less and refine more—*Li* as one and *Qian* as two, doubling the effort. Follow the seasons and months when qi flourishes, and the efficacy of gathering and refining will precede you, extending years and abiding in the world as a human immortal. If the supplement’s measure is already full and progress is evident, proceed with caution. After one hundred days of gathering medicine, the medicine’s power is complete; after two hundred days, the sacred embryo is firm; after three hundred days, true qi is born, and the embryo immortal is perfected. Only when the medicine’s power is complete should fire be advanced and measures increased—this is called *Fire Timing*. After the sacred embryo is firm, increase the fire timing to the measure of the Small Celestial Cycle—this is called the *Small Celestial Cycle*. Once the embryo is rounded and true qi is born, increase the fire timing to the measure of the Great Celestial Cycle—this is called the *Celestial Fire Timing*. Gathering medicine unites the Dragon and Tiger; refining medicine advances the fire—only then does one enter the Dao. One must retreat to seclusion, focus inwardly, prevent inner visions from leaking out, and block outer distractions from entering. Like a woman nurturing a fetus or a dragon tending its pearl, even in eating, sleeping, speaking, or silence, one should act like an infant or a maiden, ever cautious of loss or harm, with the heart never straying from the Dao for even a moment.\n\n*Explanation*: The medicine is the true qi within the heart; the hare is the true water within the kidneys; the Yellow Matron is the true fluids within the spleen. They harmonize qi and water to enter the Yellow Court. Yongzhou is the *Qian* hexagram. Restraining the Yang Gate refers to the flanks and abdomen.\n\nThe four gates of the lesser vehicle pertain to human immortals.\n\n**Middle Scroll: The Middle Vehicle’s Three Gates of Longevity and Deathlessness**\n*Flying Golden Essence Behind the Elbow, Fifth*\n\n*The Jin Gao* states: The ascent and descent of yin and yang do not exceed the bounds of heaven and earth; the revolutions of the sun and moon occur beyond heaven and earth. Their rising and setting in the east and west divide day and night; their coming and going in the south and north determine cold and heat. Day and night do not cease; cold and heat alternate. Accumulated days form months; accumulated months form years.",
      "overlap_context": "g—this is the *zi* month. When true yang is about to reach the *Li* Palace, await the *Li* hexagram—this is the *wu* hour. The true Dragon is the qi within heart fluids; the true Tiger is the water within kidney qi. When qi and water unite, this is called the *Union of Dragon and Tiger*.\n\n*Refining the Cinnabar Medicine, Fourth*\n\nThe *Jin Gao* states: Heaven and Earth are the forms of the Great Dao; yin and yang are the qi of the Great Dao. Cold, heat, warmth, and coolness—within form lies qi...",
      "start_char": 5063,
      "end_char": 6316,
      "start_sentence": 164,
      "end_sentence": 215,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.406222105026245,
      "metadata": {
        "source_file": "dao\\藏外\\灵宝毕法.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "月之积日者，以其魄中藏魂、魂中藏魄也； 岁之积月者，以其律中起吕、吕中起律也。 日月运行，以合天地之机，不离乾坤之数，万物生成虽在于阴阳，而造化亦资于日用。 《真源》曰：天地之形，其状如卵，六合之内，其圆如球。 日月出没，运行于一天之上，一地之下，上下东西，周行如飞轮。 东生西没，日行阳道，西生东没，月行阴道，一日之间，而分昼夜。 冬至之后，日出自南而北，夏至之后，日出自北而南，冬之夜乃夏之日，夏之夜乃冬之日，一年之间，崦定寒暑。 日月之状，方圆八百四十里，四尺为一步，三百六十步为一里。 凡八刻二十分为一时，十二时为一日，一月三十日，共三百六十时，计三千刻，一十八万分也。 且以阳行乾，其数用九，阴行坤，其数用六。 魄中魂生，本自旦日，盖九不对六，故三日后魄中生魂。 凡一昼夜，一百刻六十分，魂于魄中一进七十里，六昼夜，进四百二十里，而魄中魂半，乃曰上弦。 又六昼夜，进四百二十里，通前共进八百四十里，而魄中魂全，阳满阴位，乃曰月望。 自十六日为始，魂中生魄，凡一昼夜，一百刻六十分，魄于魂中一进七十里，六昼夜，共进四百二十里，而魂中魄半，乃曰下弦。 又六昼夜，进四百二十里，通前共进八百四十里，而魂中魄全，阴满阳位，月中尚有馀光者，盖六不尽九，故三日后月魄满宫，乃曰月晦。 月旦之后，六中起九，月晦之前，九中起六，数有未尽，而生后有期，积日为月，积月为岁。 以月言之。 六律六吕，以六起数，数尽六位，六六三十六，阴之成数也； 以日言之，五日一候，七十二候，八九之数，至重九以九起数，数尽六位，六九五十四，阳之成数也。 一六一九，合而十五，十五，一气之数也，二十四气当八节之用，而见阴阳升降之宜。 一六一九，以四为用，合四时而倍之，一时得九十，四九三百六，变为阳之数二百一十六，阴之数一百四十四，计三百六十数，而足满周天。 《比喻》曰：阴阳升降在天地之内，比心肾气液交合之法也； 日月运转在天地之外，比肘后飞金晶之事也； 日月交合，比进火加减之法也。 阳升阴降，无异于日月之魂魄； 日往月来，无异于心肾之气液。 冬至之后，日出乙位，没庚位，昼四十刻，自南而北，凡九日东生西没，共进六十分，至春分昼夜停停，而夏至为期，昼六十刻； 夏至之后，日出甲位，没辛位，昼六十刻，自北而南，凡九日东生西没，共退六十分，至秋分昼夜停停、而冬至为期，昼四十刻。 昼夜分刻，准前后进退，自南而北，月旦之后，三日魂生于魄，六日两停，又六日魂全，其数用九也； 月望之后，魄生于魂，六日两停，又六日魄全，其数用六也。 岁之夏至，月之十六日，乃日用离卦之法，人之午时也； 岁之冬至，月之旦日，乃日用坎卦之法，人之子时也。 天地阴阳升降之宜，日月魂魄往来之理，尚以数推之，交合有序，运转无差，人之心肾气液、肝肺魂魄，日用虽有节次，年月岂无加减乎？ 《真诀》曰：坎卦阳生，当正子时，非始非终，艮卦肾气交肝气。 未交之前，静室中披衣握因盘膝，蹲下腹肝，须臾升身，前出胸而微偃头于后，后闭夹脊双关，肘后微扇一二，伸腰，自尾癌穴，如火相似，自腰而起，拥在夹脊，慎勿开关，即时甚热气壮，渐次开夹脊关，放气过关，仍仰面脑后紧偃，以闭上关，慎勿开之，即觉热极气壮，渐次开关入顶，以补泥丸髓海，须身耐寒暑，方为长生之基。",
      "translated_text": "The accumulation of days into months arises from the soul residing within the lunar essence and the lunar essence residing within the soul. The accumulation of months into years arises from the *lü* tones emerging within the *lü* and the *lü* tones emerging within the *lü*. The movements of the sun and moon align with the mechanism of heaven and earth, never departing from the numerical principles of *Qian* and *Kun*. Though the generation of the myriad things depends on yin and yang, their transformation also relies on daily celestial motions.\n\n*The True Source* states: The form of heaven and earth resembles an egg, and within the six directions, its roundness is like a sphere. The rising and setting of the sun and moon occur above one heaven and below one earth. Above and below, east and west, they revolve like a flying wheel. The sun rises in the east and sets in the west, traveling the Yang path; the moon rises in the west and sets in the east, traveling the Yin path. Within a single day, they divide day and night. After the winter solstice, the sun emerges from the south and moves northward; after the summer solstice, it emerges from the north and moves southward. The night of winter becomes the day of summer, and the night of summer becomes the day of winter. Within a single year, they determine cold and heat. The sun and moon each span 840 *li* in diameter. Four *chi* make one *bu*, and 360 *bu* make one *li*. Every eight *ke* and twenty *fen* constitute one *shi*, and twelve *shi* constitute one day. One month has thirty days, totaling 360 *shi*, which amounts to 3,000 *ke* and 180,000 *fen*.\n\nNow, the Yang travels through *Qian*, employing the number nine, while the Yin travels through *Kun*, employing the number six. The soul emerges within the lunar essence at dawn, but since nine does not pair with six, the soul begins to grow within the lunar essence only after three days. In one day and night, comprising 100 *ke* and sixty *fen*, the soul advances seventy *li* within the lunar essence. Over six days and nights, it advances 420 *li*, at which point the soul fills half the lunar essence—this is called the first quarter. After another six days and nights, advancing another 420 *li* (totaling 840 *li*), the soul completely fills the lunar essence, and Yang occupies the Yin position—this is called the full moon.\n\nBeginning on the sixteenth day, the lunar essence emerges within the soul. In one day and night, comprising 100 *ke* and sixty *fen*, the lunar essence advances seventy *li* within the soul. Over six days and nights, it advances 420 *li*, at which point the lunar essence fills half the soul—this is called the last quarter. After another six days and nights, advancing another 420 *li* (totaling 840 *li*), the lunar essence completely fills the soul, and Yin occupies the Yang position. Yet the moon still retains some light, for six does not exhaust nine, so three days later, the lunar essence fills the palace—this is called the dark moon.\n\nAfter the first day of the month, six gives rise to nine; before the dark moon, nine gives rise to six. Though the numbers are not yet exhausted, the next cycle begins in due course, accumulating days into months and months into years. In terms of the moon: the six *lü* and six *lü* tones begin with six, and when the numbers fill the six positions, six times six makes thirty-six—the complete number of Yin. In terms of the sun: five days make one *hou*, and seventy-two *hou* comprise the numbers eight and nine. At the double ninth, counting begins with nine, and when the numbers fill the six positions, six times nine makes fifty-four—the complete number of Yang. One six and one nine together make fifteen, and fifteen is the number of one *qi*. The twenty-four *qi* correspond to the eight nodes, revealing the proper ascent and descent of Yin and Yang. One six and one nine, multiplied by four, correspond to the four seasons. Each season yields ninety, and four times ninety makes 360. This transforms into 216 for Yang and 144 for Yin, totaling 360 and completing the celestial revolution.\n\n*The Analogy* states: The ascent and descent of Yin and Yang within heaven and earth resemble the method of harmonizing the qi and fluids of the heart and kidneys. The revolutions of the sun and moon beyond heaven and earth resemble the practice of *Flying Golden Essence Behind the Elbow*. The conjunction of the sun and moon resembles the method of advancing fire and reducing it. The ascent of Yang and descent of Yin are no different from the soul and lunar essence of the sun and moon; the alternation of the sun and moon is no different from the qi and fluids of the heart and kidneys.\n\nAfter the winter solstice, the sun rises at the *yi* position and sets at the *geng* position, with forty *ke* of daylight. Moving from south to north, over nine days it rises in the east and sets in the west, advancing sixty *fen* in total. At the spring equinox, day and night are equal, and by the summer solstice, daylight reaches sixty *ke*. After the summer solstice, the sun rises at the *jia* position and sets at the *xin* position, with sixty *ke* of daylight. Moving from north to south, over nine days it rises in the east and sets in the west, retreating sixty *fen* in total. At the autumn equinox, day and night are equal, and by the winter solstice, daylight returns to forty *ke*. The division of *ke* between day and night follows this pattern of advance and retreat from south to north.\n\nAfter the first day of the month, the soul emerges within the lunar essence over three days. By six days, they are balanced, and by another six days, the soul is complete—this employs the number nine. After the full moon, the lunar essence emerges within the soul. By six days, they are balanced, and by another six days, the lunar essence is complete—this employs the number six. The summer solstice of the year and the sixteenth day of the month correspond to the method of the *Li* hexagram in daily practice, which is the *wu* hour for humans. The winter solstice of the year and the first day of the month correspond to the method of the *Kan* hexagram in daily practice, which is the *zi* hour for humans.\n\nThe proper ascent and descent of Yin and Yang in heaven and earth, the principles governing the alternation of the soul and lunar essence in the sun and moon—these are all deduced through numbers, their conjunctions orderly and their revolutions without error. How could the qi and fluids of the human heart and kidneys, the soul and lunar essence of the liver and lungs, though regulated in daily practice, not require adjustments over months and years?\n\n*The True Formula* states: When Yang is born in the *Kan* hexagram, it corresponds to the true *zi* hour—neither beginning nor end—where the qi of the kidneys merges with the qi of the liver. Before the exchange, sit quietly in a still room, don your robe, assume the *yin* mudra, and sit cross-legged. Press down the liver with the lower abdomen, then rise slightly, thrusting the chest forward while gently tilting the head back. Close the double gates of the spine, slightly flap the elbows one or two times, stretch the waist, and from the *Weilü* point, let the fire-like sensation rise from the waist, gathering at the spine. Take care not to open the gates; soon, the heat will intensify, and the qi will strengthen. Gradually open the gates of the spine, allowing the qi to pass through. Then tilt the head back sharply to close the upper gate, taking care not to open it. The heat will become extreme, and the qi will strengthen further. Gradually open the gate to let the qi enter the crown, replenishing the sea of marrow in the *Niwan* palace. Only when the body can withstand cold and heat is the foundation of longevity established.",
      "overlap_context": "vity and Deathlessness**\n*Flying Golden Essence Behind the Elbow, Fifth*\n\n*The Jin Gao* states: The ascent and descent of yin and yang do not exceed the bounds of heaven and earth; the revolutions of the sun and moon occur beyond heaven and earth. Their rising and setting in the east and west divide day and night; their coming and going in the south and north determine cold and heat. Day and night do not cease; cold and heat alternate. Accumulated days form months; accumulated months form years.",
      "start_char": 6316,
      "end_char": 7634,
      "start_sentence": 216,
      "end_sentence": 250,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.16315031051636,
      "metadata": {
        "source_file": "dao\\藏外\\灵宝毕法.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "次用还丹之法，如前出胸伸腰，闭夹脊，蹲而伸之，腰间火不起，当静坐内观，如法再作，以火起为度，自丑行之，至寅终而可止，乃曰肘后飞金晶，又曰抽铅，使肾中气生肝气也。 且人身脊骨二十四节，自下而上三节，与内肾相对，自上而下三节，名曰天柱，天柱之上，名曰玉京，天柱之下，内肾相对，尾闾穴之上，共十八节，其中曰双关，上九下九，当定一百日，遍通十八节而入泥丸，必于正一阳时，坎卦行持，乃曰肘后飞金晶，离卦采药，乾卦进火烧药，勒阳关，始一百日飞金晶入脑，三关一撞，直入上宫泥丸，自坎卦为始，至艮卦方止。 自离卦采药，使心肾气相合，而肝气自生心气，二气纯阳，二八阴消，熏熏于肺，而得肺液下降，包含真气，日得黍米之大，而入黄庭，方曰内丹之材，即百日无差药力全。 凡离卦采药用法，依时内观，转加精细，若乾卦进火烧药，勒阳关，自兑卦为始，终在乾卦，如此又一百日，肘后飞金晶，自坎卦至震卦方止，离卦采药之时，法如旧以配，自坤至乾卦行持，即二百日无差圣胎坚。 勒阳关法，自坤卦至乾卦方止，如此又一百日足，泥丸充实，返老还童，不类常人，采药就，胎仙完，而真气生，形若弹圆，色同朱橘，永镇丹田，而作陆地神仙。 三百日后行持，至离卦罢采药，坤卦罢勒阳关，即行玉液还丹之道，故自冬至后，方曰行功，三百日胎完气足，而内丹就，真气生。 凡行此法，方为五行颠倒，三田返覆。 未行功以前，先要匹配阴阳，使气液相生，见验方止； 次要聚散水火，使根源牢固，而气行液住，见验方止； 次要交媾龙虎，烧炼丹药，使采补还丹，而煅炼铅汞，见验方止。 十损一补之数足，而气液相生，见验方止。 上项行持，乃小乘之法，自可延年益寿。 若以补完坚固，见验方止，方可年中择月，冬至之节，月中择日，甲子之日，日中择时，坎、离、乾卦三时为始，一百日自坎至艮，自兑至乾，二百日后，自坎至震，自坤至乾。 凡此下功，必于幽室静宅之中，远妇人女子，使鸡犬不闻声，臭秽不入鼻，五味不入口，绝七情六欲，饮食多少，寒热有度，虽寐寐之间，而意恐损失。 行功不勤，难成乎道。 如是三百日，看应验如何。 真解曰：此乃三元用法； 谓坎卦飞金晶； 下田返上田也； 离卦采药，下田返中田也，乾卦勒阳关，中由返下由也。 亦曰三田返覆。 《道要》曰：日月并行复卦，蹲升数日开关。 贪缶扬扬州聚会，六宫火满金田。 解曰：日月并行复卦者，一阳生时； 在日为子时，在年为冬至也，所谓月中择日、日中择时也。 蹲升，说巳在前。 数日，是定一百日。 开关，是先开中关，次开上关。 贪向扬州聚会，扬州者，在人为心，在日为午时，在卦为离。 聚会者，真阴真阳交横，故日采药。 乾为六官，火是气也。 勒阳关而聚气，以肺气为金，而下肾之丹田，故曰“火满金田”，乃行乾卦而勒阳关，聚火下丹田也。 直解曰：日月并行复卦者，冬至甲子时也。 蹲升数日开关者，蹲腹升身以起火，至百日开关也。 此乃自坎至良，飞金晶之法。 扬州聚会者，离卦采药交阴阳也。 六宫火满丹田，则乾卦勒阳关，聚肺气于下田，自兑至乾者也。",
      "translated_text": "Next, employ the method of returning the elixir. As before, thrust the chest forward and stretch the waist, close the double gates of the spine, then crouch and extend. If the fire in the waist does not rise, sit in stillness and inwardly observe. Repeat the method until the fire arises to the required degree. Begin at the *chou* hour and continue until the end of the *yin* hour, at which point one may stop. This is called \"flying golden essence behind the elbows,\" also known as \"drawing lead,\" whereby the qi of the kidneys generates the qi of the liver.\n\nMoreover, the human spine consists of twenty-four vertebrae. From the bottom upward, the first three correspond to the internal kidneys. From the top downward, the first three are called the \"Pillar of Heaven.\" Above the Pillar of Heaven lies the \"Jade Capital.\" Below the Pillar of Heaven, opposite the internal kidneys and above the *Weilü* point, are eighteen vertebrae. Among these, the middle section is called the \"double gates,\" with nine above and nine below. One must stabilize for one hundred days until the qi traverses all eighteen vertebrae and enters the *Niwan* palace. This must be practiced during the first yang hour, under the *Kan* trigram. This is called \"flying golden essence behind the elbows.\" Under the *Li* trigram, one gathers the medicine; under the *Qian* trigram, one advances the fire to refine the medicine and restrains the yang gate. Only then, after one hundred days, does the golden essence fly into the brain. With a single thrust through the three gates, it enters the upper palace of *Niwan*.\n\nBeginning with the *Kan* trigram, the practice continues until the *Gen* trigram. Under the *Li* trigram, one gathers the medicine, uniting the qi of the heart and kidneys, whereby the qi of the liver naturally arises from the qi of the heart. When the two qi become purely yang, the two eights of yin dissolve. Steaming upward into the lungs, the lung fluid descends, enveloping the true qi. Daily, a grain of millet in size enters the Yellow Court—this is called the material of the inner elixir. Only after one hundred days without error is the medicinal power complete.\n\nWhen gathering medicine under the *Li* trigram, observe the timing inwardly with even greater precision. When advancing the fire under the *Qian* trigram to refine the medicine and restrain the yang gate, begin at the *Dui* trigram and conclude at the *Qian* trigram. Thus, for another one hundred days, the golden essence flies behind the elbows, starting at the *Kan* trigram and ending at the *Zhen* trigram. During the time of gathering medicine under the *Li* trigram, follow the previous method, practicing from the *Kun* to the *Qian* trigram. After two hundred days without error, the sacred embryo becomes firm.\n\nThe method of restraining the yang gate concludes at the *Qian* trigram. After another one hundred days, the *Niwan* palace is fully replenished, and one reverts from old age to youth, no longer resembling ordinary people. Once the medicine is gathered and the embryo immortal is complete, true qi arises, its form like a round pellet, its color like a red tangerine. It permanently resides in the cinnabar field, and one becomes an immortal of the earthly realm.\n\nAfter three hundred days of practice, cease gathering medicine under the *Li* trigram and restraining the yang gate under the *Kun* trigram. Then proceed with the method of returning the jade fluid elixir. Thus, only after the winter solstice does one begin the practice. After three hundred days, the embryo is complete, the qi is full, and the inner elixir is achieved, with true qi generated.\n\nThis method is the inversion of the Five Phases and the reversal of the Three Fields. Before practicing, one must first harmonize yin and yang, ensuring the mutual generation of qi and fluid, and continue until verification is achieved. Next, gather and disperse water and fire, solidifying the root source until the qi moves and the fluid stabilizes, and verification is achieved. Then, unite the dragon and tiger, refining the elixir medicine, gathering and replenishing the returning elixir, and forging lead and mercury until verification is achieved. When the count of \"ten depletions and one replenishment\" is fulfilled, and the mutual generation of qi and fluid is verified, one may proceed.\n\nThe above practice is a method of the Lesser Vehicle, sufficient for prolonging life and extending years. Only after replenishment is complete and firmness is verified may one select a month in the year—specifically the winter solstice—and a day in the month—specifically the *jiazi* day—and an hour in the day—specifically the hours of the *Kan*, *Li*, and *Qian* trigrams—to begin. For the first one hundred days, proceed from *Kan* to *Gen* and from *Dui* to *Qian*. After two hundred days, proceed from *Kan* to *Zhen* and from *Kun* to *Qian*.\n\nAll such practice must be conducted in a secluded chamber within a tranquil dwelling, far from women and girls, ensuring that the sounds of chickens and dogs are unheard, foul odors do not enter the nose, the five flavors do not pass the lips, and the seven emotions and six desires are severed. Regulate the quantity of food and drink, and maintain moderation in cold and heat. Even in sleep, one must remain vigilant against loss or damage. Without diligent practice, the Dao is difficult to achieve. After three hundred days, observe the results.\n\nThe true explanation states: This is the method of the Three Origins. Under the *Kan* trigram, the golden essence flies—this is the lower field returning to the upper field. Under the *Li* trigram, the medicine is gathered—this is the lower field returning to the middle field. Under the *Qian* trigram, the yang gate is restrained—this is the middle returning to the lower. This is also called the reversal of the Three Fields.\n\n*The Essentials of the Dao* states: \"The sun and moon move together under the *Fu* trigram; crouch and rise for several days to open the gates. Greedily gather in Yangzhou; the six palaces are filled with fire in the golden field.\"\n\nThe explanation states: \"The sun and moon moving together under the *Fu* trigram\" refers to the time when the first yang arises—at the *zi* hour in the day and the winter solstice in the year. This is what is meant by selecting a day in the month and an hour in the day. \"Crouch and rise\" has been explained previously. \"Several days\" refers to the fixed one hundred days. \"Opening the gates\" means first opening the middle gate, then the upper gate. \"Greedily gathering in Yangzhou\"—Yangzhou corresponds to the heart in the human body, the *wu* hour in the day, and the *Li* trigram. \"Gathering\" refers to the union of true yin and true yang, hence the gathering of medicine. *Qian* represents the six palaces, and fire is qi. By restraining the yang gate and gathering qi, the lung qi is metal, descending to the kidney’s cinnabar field. Thus, \"the six palaces are filled with fire in the golden field\" refers to practicing under the *Qian* trigram to restrain the yang gate, gathering fire in the lower cinnabar field.\n\nThe direct explanation states: \"The sun and moon moving together under the *Fu* trigram\" refers to the hour of *jiazi* at the winter solstice. \"Crouch and rise for several days to open the gates\" means crouching the abdomen and rising the body to kindle the fire, opening the gates after one hundred days. This is the method of flying golden essence from *Kan* to *Gen*. \"Gathering in Yangzhou\" refers to the union of yin and yang under the *Li* trigram to gather medicine. \"The six palaces are filled with fire in the golden field\" refers to restraining the yang gate under the *Qian* trigram, gathering lung qi in the lower field—this is the practice from *Dui* to *Qian*.",
      "overlap_context": "to open the gates; soon, the heat will intensify, and the qi will strengthen. Gradually open the gates of the spine, allowing the qi to pass through. Then tilt the head back sharply to close the upper gate, taking care not to open it. The heat will become extreme, and the qi will strengthen further. Gradually open the gate to let the qi enter the crown, replenishing the sea of marrow in the *Niwan* palace. Only when the body can withstand cold and heat is the foundation of longevity established.",
      "start_char": 7634,
      "end_char": 8852,
      "start_sentence": 251,
      "end_sentence": 287,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.82214903831482,
      "metadata": {
        "source_file": "dao\\藏外\\灵宝毕法.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "终南路上逢山，升身频过三关。 贪向扬州聚会，争如少女烧天。 解曰：终南者，圣人隐意在中男也，中男即坎卦。 良为山，山是势，飞金晶至巽卦方止，第二百日下功之时也。 升身频过三关、贪向扬州聚会，说已在前。 争如少女烧天者，少女是兑卦也，勒阳关至乾卦而方止也。 兖克州行到徐州，起来走损车牛。 为恋九州欢会，西南火入雍州。 解曰：艮州，艮卦； 徐州，巽卦。 自艮卦飞金晶，至巽卦方止也。 起来走损车牛，车为阳，牛为阴，“是夹脊一气飞入泥丸也。 九州，在人为心，在日为午时，与前来药园也。 西南，坤卦也。 雍州，乾卦也。 勒阳关，自坤至乾方止，第三百日下功之时也。 直解曰：此乃第三百日之功，飞金晶之法，起艮而止巽也。 九州欢会，采药如前。 勒阳关； 则自坤至乾酉止也。 此是日用事，乃日三元用法。 飞金晶入脑，下田返上田； 采药，下田返中田； 烧药进火，中田返下田：乃曰三元用事。 中乘之法，已是地仙，见验方止。 始觉梦寐多有惊悸，四肢六腑有疾，不疗自愈，闭目暗室中，圆光如盖，周匝围身，金关玉锁，封固坚牢，绝梦泄遗漏，雷鸣一声，关节气通，梦寐若抱婴儿归，或若飞腾自在，八邪之气不能入，心境自除，以绝情欲，内观则朗而不昧，昼则神采清秀，夜则丹田自暖，上件皆是得药之验。 改既正当，谨节用功，以前法加添三百日胎仙圆，胎圆之后，方用后功。 玉液还丹第六附玉液炼形 《玉书》曰：真阴真阳，相生相成； 见于上者，积阳成神，神中有形而丽乎天者，日月也； 见于下者，积阴成形，形中有形而丽平地者，金玉也。 金玉之质； 隐于山川秀媚之气，浮之于上，与日月交光，草木受之以为祯祥，鸟兽得之以为异类。 《真源》曰：阳升到天，太极生阴，阴不足而阳有徐，所以积阳生神； 阴降到地，太极生阳，阳不足而阴有馀，所以积阴生形。 上之日月，下之金玉，真阳有神，真阴有形，其气相交，而上下相射，光盈天地，则金玉可贵者，良以此也。 是知金玉之气凝于空，则为瑞气祥烟，入于地； 则变醴泉芝草，人民受之而为英杰，鸟兽得之而生奇异。 盖金玉之质，虽产于积阴之形； 而中抱真阳之气，又感积阳成神之日月，真阳之下射而宝凝矣。 《比喻》曰：积阴成形，而内抱真阳，以为金玉，比为金玉，比于积药而抱真气，以为胎仙也。 金玉之气入于地，而为醴泉芝草者，比于玉液还丹田也。 金玉之气凝于空，而为瑞气样烟者，比于气炼形质也。 凡金玉之气冲于天，随阳升而起，凡金玉之气入于地，随阴降而还，既随阴阳升降，自有四时，可以液还丹田，气炼形质，比于四时加减，一日改移也 《真诀》曰：采补见验，年中择月； 月中择日，日中择时，三时用事，一百日药力全，二百日圣胎坚，三百日真气生，胎仙圆。 谨节用功，加添依时，三百日数足之后，方行还丹炼形之法。 凡用艮卦飞金晶入脑，止于巽卦而白，此言飞金晶三百日后也。 离封罢采药，坤卦罢勒阳关，只此兑卦下手，勒阳关，至乾封方止。 既罢离卦，添入咽法炼形。 咽法者，以舌搅上腭两凳之间，先咽了恶浊之津，次退舌尖以满玉池，津生不漱而咽。 凡春三月，肝气旺而脾气弱，咽法日用离卦；",
      "translated_text": "On the road to Zhongnan, mountains are met—\nrising the body to repeatedly pass the Three Passes.\nGreedily seeking union in Yangzhou,\nhow could it compare to the maiden burning heaven?\n\nExplanation states: *Zhongnan* refers to the Sage’s hidden meaning in the *Middle Son*—the *Middle Son* being the *Kan* trigram. *Gen* is mountain, and mountain is power; the flying golden essence halts only upon reaching the *Xun* trigram—this is the time of the second hundred days of practice. \"Rising the body to repeatedly pass the Three Passes\" and \"greedily seeking union in Yangzhou\" have been explained previously. \"How could it compare to the maiden burning heaven?\"—the *maiden* is the *Dui* trigram, and restraining the yang gate halts only upon reaching the *Qian* trigram.\n\nFrom Yanzhou to Xuzhou,\nrising to walk wears out cart and ox.\nFor the sake of delighting in the Nine Provinces’ union,\nfire enters Yongzhou in the southwest.\n\nExplanation states: *Genzhou* is the *Gen* trigram; *Xuzhou* is the *Xun* trigram. Flying golden essence from the *Gen* trigram halts only upon reaching the *Xun* trigram. \"Rising to walk wears out cart and ox\"—the *cart* is yang, the *ox* is yin; this is the qi of the spine flying into the *Mud Pill*. The *Nine Provinces* correspond in man to the heart, and in time to the hour of *wu*—this is the medicine garden previously mentioned. The *southwest* is the *Kun* trigram; *Yongzhou* is the *Qian* trigram. Restraining the yang gate halts only upon reaching *Qian*—this is the time of the third hundred days of practice.\n\nDirect explanation states: This is the method of flying golden essence for the third hundred days, rising from *Gen* and halting at *Xun*. The union of the Nine Provinces is the gathering of medicine as before. Restraining the yang gate halts only upon reaching *you* in *Qian*. This is the daily practice, the method of the Three Primordials. Flying golden essence into the brain returns the lower field to the upper field; gathering medicine returns the lower field to the middle field; burning medicine and advancing fire returns the middle field to the lower field—this is called the practice of the Three Primordials. The method of the Middle Vehicle is already that of an Earth Immortal, and practice ceases only upon verification. One first notices that dreams are often startled and fearful, the four limbs and six viscera afflicted with illness, yet they heal without treatment. In a dark room with eyes closed, a radiant light like a canopy encircles the body; the golden gate and jade lock seal firmly, cutting off dream emissions and leakage. With a thunderous roar, the qi of the joints flows freely, and in dreams one may hold an infant in return or soar freely at will. The eight perverse qi cannot enter, the heart’s illusions vanish, and desires are extinguished. Inward contemplation is bright and unobscured; by day, the spirit’s countenance is clear and refined; by night, the cinnabar field is naturally warm. All these are signs of obtaining the medicine. Once the correction is proper, practice diligently with care, adding three hundred days to the previous method to complete the *Fetal Immortal*. Only after the fetal completion does one proceed to the subsequent practice.\n\n**Sixth: Jade Fluid Returning to the Cinnabar—Appendix on Jade Fluid Refining the Form**\n\n*The Jade Book* states: True yin and true yang mutually generate and complete one another. That which appears above is accumulated yang forming spirit; within spirit there is form, and that which adheres to heaven is the sun and moon. That which appears below is accumulated yin forming shape; within shape there is form, and that which adheres to earth is gold and jade. The essence of gold and jade is concealed within the elegant qi of mountains and rivers, floating above to exchange radiance with the sun and moon. Plants and trees receive it to become auspicious omens, birds and beasts obtain it to become extraordinary species.\n\n*The True Source* states: When yang ascends to heaven, the Supreme Ultimate generates yin; yin is insufficient while yang has surplus, thus accumulated yang generates spirit. When yin descends to earth, the Supreme Ultimate generates yang; yang is insufficient while yin has surplus, thus accumulated yin generates shape. Above, the sun and moon; below, gold and jade—true yang has spirit, true yin has form. Their qi intermingle, and above and below reflect one another; light fills heaven and earth, and thus gold and jade are precious. It is known that when the qi of gold and jade congeals in the void, it becomes auspicious qi and propitious mist; when it enters the earth, it transforms into sweet springs and magic herbs. People receive it to become heroes, birds and beasts obtain it to produce marvels. Though the essence of gold and jade is produced from accumulated yin’s shape, it embraces the qi of true yang and is further moved by the sun and moon formed from accumulated yang’s spirit. True yang’s downward reflection causes treasure to congeal.\n\n*The Analogy* states: Accumulated yin forms shape yet inwardly embraces true yang to become gold and jade—this is analogous to accumulating medicine and embracing true qi to become a *Fetal Immortal*. When the qi of gold and jade enters the earth to become sweet springs and magic herbs, it is analogous to jade fluid returning to the cinnabar field. When the qi of gold and jade congeals in the void to become auspicious qi and propitious mist, it is analogous to qi refining the form. Whenever the qi of gold and jade surges into the heavens, it rises with yang; whenever it enters the earth, it descends with yin. Since it follows the ascent and descent of yin and yang, it naturally has the four seasons. Thus, one may return fluid to the cinnabar field and refine the form with qi, analogous to the four seasons’ waxing and waning and the daily transformations.\n\n*The True Formula* states: For gathering and supplementing, verification is sought within the year; within the month, the day is chosen; within the day, the hour is selected. Practicing the Three Primordials for one hundred days, the medicine’s power is complete; for two hundred days, the sacred fetus is firm; for three hundred days, true qi is born, and the *Fetal Immortal* is complete. Practice diligently with care, adding time as appropriate. Only after the full three hundred days does one proceed to the method of returning the cinnabar and refining the form. Whenever using the *Gen* trigram to fly golden essence into the brain, it halts at the *Xun* trigram and ceases—this refers to flying golden essence after three hundred days. The *Li* trigram ceases gathering medicine; the *Kun* trigram ceases restraining the yang gate. Only the *Dui* trigram is employed, restraining the yang gate until it halts at the *Qian* trigram’s seal. Having ceased the *Li* trigram, the swallowing method for refining the form is added.\n\nThe swallowing method: With the tongue, stir between the upper palate and the two ridges, first swallowing the foul and turbid fluid, then retracting the tongue’s tip to fill the Jade Pool. The fluid is generated, not rinsed, and swallowed. In the three months of spring, when liver qi is flourishing and spleen qi is weak, the swallowing method is practiced daily under the *Li* trigram.",
      "overlap_context": "ys to open the gates\" means crouching the abdomen and rising the body to kindle the fire, opening the gates after one hundred days. This is the method of flying golden essence from *Kan* to *Gen*. \"Gathering in Yangzhou\" refers to the union of yin and yang under the *Li* trigram to gather medicine. \"The six palaces are filled with fire in the golden field\" refers to restraining the yang gate under the *Qian* trigram, gathering lung qi in the lower field—this is the practice from *Dui* to *Qian*.",
      "start_char": 8854,
      "end_char": 10112,
      "start_sentence": 288,
      "end_sentence": 339,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.29952144622803,
      "metadata": {
        "source_file": "dao\\藏外\\灵宝毕法.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "凡耀三月，心气旺而肺气弱，咽法日用巽卦； 凡秋三月，肺气旺而胖气弱； 咽法日用艮卦； 凡冬三月，肾气旺而心气弱。 咽法日用震卦，凡四季之月，脾气旺而肾气弱，人以肾气为根源，四时皆有衷弱，每四时季月之后十八日，咽法日用兑封，仍与前咽法并用之； 独于秋季止用兑卦咽法，而罢艮卦之功。 以上咽法，先依前法而咽之。 如牙齿玉池之间而津不生，但以舌满上下而闭玉池、收两颌，以虚咽而为法，止于咽气，气中自有水也。 咽气如一年，三十六次至四十九次为数； 又次一年，八十一次； 又次一年，一百八十一次为见验：乃主液还丹之法。 行持不过三年； 灌溉丹田，沐浴胎仙，而真气愈盛。 若行此，玉液还丹之法，而于三百日养就内丹，真气才生，艮卦飞金晶，一撞三关，上至泥丸，当行金掖还丹之法自顶中前下金水一注，下还黄庭，变金成丹，名曰金丹。 行金液还丹，当于深密幽房，风日凡人不到之处，烧香，叠掌盘膝坐，以体蹲而后升，才觉火起，正坐绝念，忘情内观，的确艮卦飞金晶入顶，但略昂头偃项，放令颈下如火，方点头向前，低头曲项； 退舌央进后以抵上腭，上有清洽之水，味若甘香，上彻项门，下遗百脉，鼻中自闻一种真香，舌上亦有奇味； 不漱而咽，下还黄庭，名曰金液还丹。 春夏秋冬，不拘时候，但于飞金晶入脑之后，节次行此法，自艮至巽而已； 晚间勒阳关法，自兑至乾而已。 凡行此法，谨节胜前，方可得成，究竟止于炼形住世，长生不死而已，不能超脱也。 《道要》曰：识取五行根蒂，方知春夏冬秋。 时饮琼浆数盏，醉归月殿邀游。 解曰：识取五行根蒂者，为倒五行相生相克，而用卦时不同，以行咽法。 方知春夏冬秋，改移有时候也。 琼浆，玉液也。 月殿，丹田也。 醉归，咽多也。 东望扶桑未晓，后升前咽无休。 骤马邀游宇宙，长男只到扬州。 解曰：东望扶桑未晓者，日未出，艮卦之时也。 后升，飞金晶也。 前咽，玉液还丹也。 骤马，起火，玉液炼形也。 邀游宇宙，遍满四肢也。 长男，震卦也。 只到扬州，离卦也。 玉浓炼形，自震卦为始，至离卦方止也。 直解曰：玉液，肾液也，上升到心，三气相合而过重楼，则津满玉池，谓之玉液。 若咽之，自中田而入下田，则曰还丹：若升之，自中田而入四肢，则日炼形，其实一物而已。 此系来药三百日数足胎圆，而飞金晶减一卦，勒阳关如旧，罢采药，添入咽法，咽法随四时而已。 此系炼形法，用卦后，添入炼形，自震卦为始，离卦为期，不限年月日，见验方止，体色光泽，神气秀媚，渐畏腥秽以冲口腹，凡情凡爱心境自除，真气将足而似常饱，所合不多，饮酒无量，尘骨已更而变神识，步趋走马，其行如飞，目如点漆，体若凝脂，绀发再生，皱脸重舒，老去永驻童颜，仰视百步而见秋毫，身体之间，旧痕残，自然消除，涕泪涎汗，亦不见有，圣丹生味，灵液透香，口鼻之间，常有真香奇味，漱津成酥，可以疗，人疾病，遍体皆成白膏，上件皆玉液还丹炼形之验。 见验即止，当谨节用功，依法随时，而行后事。 金液还丹第七附金液炼形 《金诰》曰：积阳成神，神中有形，形生于日，日生于月； 积阴成形，形中有神，神生于金，金生于玉。",
      "translated_text": "In the three months of summer, when heart qi flourishes and lung qi is weak, the swallowing method is practiced daily under the *Xun* trigram. In the three months of autumn, when lung qi flourishes and spleen qi is weak, the swallowing method is practiced daily under the *Gen* trigram. In the three months of winter, when kidney qi flourishes and heart qi is weak, the swallowing method is practiced daily under the *Zhen* trigram. During the transitional months of the four seasons, when spleen qi flourishes and kidney qi is weak—since kidney qi is the root of human life and weakness occurs in all four seasons—during the last eighteen days of each seasonal transition, the swallowing method is practiced daily under the *Dui* trigram, used concurrently with the previous swallowing method. Only in autumn is the *Dui* trigram’s swallowing method employed exclusively, discontinuing the *Gen* trigram’s practice.\n\nFor the above swallowing methods, first follow the previous method to swallow. If no fluid is generated between the teeth and the Jade Pool, simply fill the mouth with the tongue, close the Jade Pool, draw in the jaws, and swallow emptily as the method—this refers to swallowing qi, within which water naturally arises. The number of qi-swallowings: in the first year, thirty-six to forty-nine times; in the next year, eighty-one times; and in the following year, one hundred eighty-one times, at which point verification appears—this is the method of returning the fluid to the cinnabar. The practice should not exceed three years; it irrigates the cinnabar field, bathes the fetal immortal, and true qi grows ever more abundant.\n\nIf one practices this method of returning the jade fluid to the cinnabar, after three hundred days of nurturing the inner cinnabar and true qi begins to arise, the *Gen* trigram’s flying golden essence will strike the three passes and ascend to the Mud Pill Palace. Then, the method of returning the golden fluid to the cinnabar is performed: from the crown of the head, a stream of golden water descends, flowing back to the Yellow Court, where it transforms into gold and becomes cinnabar—this is called the Golden Cinnabar.\n\nWhen practicing the method of returning the golden fluid, one should be in a secluded chamber where wind, sunlight, and ordinary people do not reach. Burn incense, sit cross-legged with palms stacked, first crouching the body and then rising. As soon as the fire is felt to ignite, sit upright, extinguish all thoughts, forget all emotions, and inwardly observe. Precisely when the *Gen* trigram’s flying golden essence enters the crown, slightly raise the head and tilt the neck back, allowing the fire to fill the area beneath the neck. Then nod the head forward, lower it, and curve the neck. Retract the tongue, pressing it firmly against the upper palate, where clear and refreshing water arises, its taste sweet and fragrant. It ascends to the nape, descends through the hundred vessels, and a true fragrance is naturally detected in the nose, while an extraordinary flavor lingers on the tongue. Without rinsing, swallow it, sending it down to the Yellow Court—this is called the Golden Fluid Returning to the Cinnabar.\n\nIn spring, summer, autumn, and winter, regardless of the time, after the flying golden essence enters the brain, proceed step by step with this method, from *Gen* to *Xun* only. In the evening, the method of restraining the yang gate is practiced from *Dui* to *Qian* only. When practicing this method, one must strictly regulate conduct beyond previous standards to achieve success. Ultimately, it serves only to refine the form and abide in the world, attaining longevity without death, but not transcendence.\n\nThe *Essentials of the Dao* states: \"Recognize the root and stem of the Five Phases, and you will understand spring, summer, autumn, and winter. Drink several cups of nectar, and in drunkenness wander the Moon Palace.\"\n\nExplanation: \"Recognize the root and stem of the Five Phases\" refers to inverting the Five Phases’ mutual generation and restraint, employing different trigrams at different times to practice the swallowing method. \"Understand spring, summer, autumn, and winter\" means adjusting the timing accordingly. \"Nectar\" is the jade fluid. \"Moon Palace\" is the cinnabar field. \"Drunkenness\" refers to frequent swallowing.\n\n\"Gazing eastward at Fusang before dawn, rising behind and swallowing without cease. Galloping like a steed through the cosmos, the eldest son reaches only Yangzhou.\"\n\nExplanation: \"Gazing eastward at Fusang before dawn\" refers to the time before sunrise, the hour of the *Gen* trigram. \"Rising behind\" is the flying golden essence. \"Swallowing ahead\" is the jade fluid returning to the cinnabar. \"Galloping steed\" is the ignition of fire, the jade fluid refining the form. \"Wandering the cosmos\" means filling the four limbs. \"Eldest son\" is the *Zhen* trigram. \"Reaches only Yangzhou\" is the *Li* trigram. Refining the form with jade fluid begins with the *Zhen* trigram and ends with the *Li* trigram.\n\nDirect Explanation: The jade fluid is kidney fluid. When it ascends to the heart, the three qi harmonize and pass the Towering Pavilion, filling the Jade Pool—this is called jade fluid. If swallowed, it enters the lower field from the middle field, called returning cinnabar. If ascended, it enters the four limbs from the middle field, called refining the form—though in truth, it is the same substance.\n\nThis pertains to the completion of the three hundred days of gathering medicine, the perfection of the fetal cinnabar, the reduction of the flying golden essence by one trigram, the continued restraint of the yang gate, the cessation of medicine-gathering, and the addition of the swallowing method, which varies with the four seasons. This is the method of refining the form. After employing the trigrams, refining the form is added, beginning with the *Zhen* trigram and concluding with the *Li* trigram, without limit to years, months, or days—only ceasing upon verification. The body’s complexion becomes radiant, the spirit’s qi refined and elegant. Gradually, one grows averse to foul odors assaulting the mouth and stomach, worldly passions and attachments naturally dissolve, true qi becomes abundant and one feels perpetually sated, requiring little food. One can drink limitless wine, the mortal bones transform into spiritual awareness, movement is swift as a galloping horse, the eyes dark as lacquer, the body smooth as congealed fat. Azure hair regrows, wrinkled faces smooth anew, old age is forever replaced by a youthful countenance. One can see autumn down at a hundred paces. Old scars and blemishes on the body naturally vanish. Tears, saliva, and sweat no longer appear. The sacred cinnabar generates flavor, the numinous fluid exudes fragrance. Between mouth and nose, true fragrance and extraordinary flavors constantly arise. Rinsing the saliva produces a buttery substance that can heal others’ illnesses. The entire body transforms into white cream. All the above are verifications of the jade fluid returning to the cinnabar and refining the form.\n\nUpon verification, cease practice, strictly regulate conduct, follow the method according to the season, and proceed to subsequent matters.\n\n**Golden Fluid Returning to the Cinnabar, Seventh: Appended Method of Refining the Form with Golden Fluid**\n\nThe *Golden Edict* states: \"Accumulated yang forms spirit; within spirit, there is form. Form is born of the sun; the sun is born of the moon. Accumulated yin forms the body; within the body, there is spirit. Spirit is born of metal; metal is born of jade.\"",
      "overlap_context": "e *Qian* trigram’s seal. Having ceased the *Li* trigram, the swallowing method for refining the form is added.\n\nThe swallowing method: With the tongue, stir between the upper palate and the two ridges, first swallowing the foul and turbid fluid, then retracting the tongue’s tip to fill the Jade Pool. The fluid is generated, not rinsed, and swallowed. In the three months of spring, when liver qi is flourishing and spleen qi is weak, the swallowing method is practiced daily under the *Li* trigram.",
      "start_char": 10112,
      "end_char": 11358,
      "start_sentence": 340,
      "end_sentence": 384,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.64673829078674,
      "metadata": {
        "source_file": "dao\\藏外\\灵宝毕法.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "随阴阳而生没者，日月之光也，因数生光，数本于乾坤； 随阴阳而升降者，金玉之气也，因时起气，时本于天地。 《真源》曰：日月之光，旦后用九，晦前用六，六九乾坤之数； 金玉之气，春夏上升，秋冬下降，升降天地之时。 金生于玉，玉生于石，石生于土，见于形而在下者如此； 中金乌，月中玉兔，月待日魂而光，见于神而在上者如此。 《比喻》曰：日月，比气也，肾气比月，而心气比日； 金玉，比液也，肾液比金，而心液比玉。 所谓玉液者，本自肾气上升而到于心，以合心气，二气相交而过重楼，闭口不出而津满玉池，咽之而曰玉液还丹，升之而曰玉液炼形。 是液本自肾中来而生于心，亦比土中生石、石中生玉之说也。 所谓金液者，肾气合心气而不上升，熏蒸于肺，肺为华益，下罩二气，即日而取肺液，在下田自尾闾穴升上，乃曰飞金晶入脑中，以补泥丸之宫，自上复下降而入下田，乃曰金液还丹，既还下田复升，遍满四体，前复上升，乃曰金液炼形，是亦金生于土之说也。 凡欲炼形飞金晶者，当在静室中，切禁风日，遥焚香，密启三清上圣：“臣所愿长生在世，传行大道，演化告人，当先自行炼形之法，欲得不畏寒暑，绝淡谷食，逃于阴阳之外。 ”咒毕，乃咽之。 《真诀》曰：背后尾闻穴曰下关，夹脊曰中关，脑后曰上关。 始飞金晶以通三关，肾比地，心比天，上到顶以比九天。 玉液炼形，自心至顶以通九天。 三百日大药就，胎仙圆，而真气生，前起则行玉液炼形之旧道，后起则行飞金晶之旧道，金晶玉液，行功，见验，自坎卦为始，后起一升入顶，以双手微闭双耳，内观如法，微咽于津，乃以舌抵定牙关，下闭玉池，以待上腭之津下而方咽，咽毕复起，至良封为期。 春冬两起一咽，秋夏五起一咽，凡一咽数，秋夏不过五十数，春冬不过百数。 自后咽罢升身前起，以满头面、四肢、五指，气盛方止，再起再升，至离卦为期。 凡此后起咽津，乃曰金液还丹，还丹之后而复前起，乃曰金液炼形。 自艮卦之后，炼形至离卦方止，兑卦勒阳关，至乾封方止，以后起到顶，自上而下，号曰金液还丹，金丹之气前起，自下而上，号曰金液炼形，形显琪树金花。 若以金液还丹，未到下元而前后俱起，乃曰火起焚身。 此是金液还丹炼形，既前后俱起，兼了焚身。 凡行此等，切须谨节苦志而无懈怠，以见验为度也。 《道要》曰：起后终宵闭耳，随时对饮金液。 宴到青州方住，日西又听阳歌。 解曰：起后终宵闭耳者，为行金液还丹，须是肘后飞金晶，一撞三关，其气才起，急须双手闭耳，耳是肾波之门，恐泄肾气于外，而不入脑中也。 随时对钦金波者，既觉气入脑中，即便依前法，点头曲项，退舌尖近抵上腭，请甘之水，有奇异之验，甘若蜜味之甜也。 当艮卦飞金晶一咽，至震卦方止。 青州，震卦也。 日西，兑卦也。 又听阳歌者，自兑势勒阳关，直到乾卦，不必采药也。 饮罢终宵火起，前升后举焚身。 虽是不拘年月，日中自有乾 解曰：此一诀是金液炼形之法也。 饮罢终宵火起者，依前法金液还丹； ”而艮卦炼形是起火也。 前升后举，飞金晶而起火也。 凡玉液炼形之法，先后起金晶入顶，次还丹而复前升之以炼形，是比金液炼形之法不同也。",
      "translated_text": "That which arises and vanishes with yin and yang is the light of the sun and moon, for light is born of number, and number originates in Qian and Kun. That which ascends and descends with yin and yang is the qi of metal and jade, for qi arises with the seasons, and the seasons originate in Heaven and Earth.\n\n*The True Source* states: \"The light of the sun and moon: after dawn, use nine; before the dark of the moon, use six. Six and nine are the numbers of Qian and Kun. The qi of metal and jade: in spring and summer, it ascends; in autumn and winter, it descends. Ascending and descending are the seasons of Heaven and Earth. Metal is born of jade, jade of stone, stone of earth—thus are those seen in form and below. Within the sun is the Golden Crow; within the moon, the Jade Hare. The moon awaits the sun’s soul to shine—thus are those seen in spirit and above.\"\n\n*The Analogy* states: \"The sun and moon are likened to qi: kidney qi is likened to the moon, and heart qi to the sun. Metal and jade are likened to fluid: kidney fluid is likened to metal, and heart fluid to jade. The so-called *jade fluid* originally ascends from kidney qi to the heart, uniting with heart qi. The two qi merge and pass the *Double Towers*, the mouth is closed so that saliva fills the *Jade Pool*, and when swallowed, it is called *jade fluid returning to the cinnabar*; when ascended, it is called *refining the form with jade fluid*. This fluid, born in the heart yet originating from the kidneys, is analogous to the saying that jade is born of stone, and stone of earth.\n\nThe so-called *golden fluid*: kidney qi unites with heart qi but does not ascend, instead steaming the lungs. The lungs, as the *Flower Canopy*, enshroud the two qi. Drawing lung fluid at midday, it ascends from the *Lower Field* through the *Weilü* cavity, called *flying golden essence into the brain* to replenish the *Mud Pill Palace*. From above, it descends again into the *Lower Field*, called *golden fluid returning to the cinnabar*. Once returned, it ascends again, filling the four limbs, then rises once more—this is called *refining the form with golden fluid*, which is also the saying that metal is born of earth.\n\nFor those who wish to refine the form and fly golden essence, they must remain in a quiet chamber, strictly avoiding wind and sunlight. From afar, they burn incense and secretly invoke the Three Pure Ones and Supreme Sages: *'Your disciple wishes for longevity in this world, to transmit and practice the Great Dao, to teach and transform others. First, I must personally practice the method of refining the form, to become untouched by cold or heat, to transcend grain and fasting, and to escape beyond yin and yang.'* After the incantation, they swallow the fluid.\n\n*The True Formula* states: \"Behind the back, the *Weilü* cavity is called the *Lower Pass*; beside the spine is the *Middle Pass*; behind the brain is the *Upper Pass*. First, fly the golden essence to open the Three Passes. The kidneys are likened to earth, the heart to heaven, and ascending to the crown is likened to the Nine Heavens. Refining the form with jade fluid ascends from the heart to the crown, opening the Nine Heavens.\n\nAfter three hundred days, the great medicine is complete, the fetal immortal is perfected, and true qi is born. When rising from the front, follow the old path of refining the form with jade fluid; when rising from the back, follow the old path of flying golden essence. As golden essence and jade fluid circulate, verification appears, beginning with the *Kan* trigram. After rising once to the crown, gently close both ears with the hands, inwardly observe as prescribed, and subtly swallow the saliva. Press the tongue firmly against the teeth, close the *Jade Pool* below, and wait for the fluid from the upper palate to descend before swallowing. After swallowing, rise again, with *Liangfeng* as the limit. In spring and winter, rise twice and swallow once; in autumn and summer, rise five times and swallow once. In each swallowing count, autumn and summer do not exceed fifty, and spring and winter do not exceed one hundred.\n\nAfter swallowing, rise from the front of the body, filling the head, face, four limbs, and five fingers until the qi is abundant, then stop. Rise and ascend again, with *Li* as the limit. After this, rising from the back to swallow saliva is called *golden fluid returning to the cinnabar*; after returning, rising from the front is called *refining the form with golden fluid*. From the *Gen* trigram onward, refining the form continues until the *Li* trigram, then restrains the *Yang Pass* at *Dui* until *Qian* is sealed. After rising from the back to the crown, descending from above is called *golden fluid returning to the cinnabar*; the qi of the golden elixir rising from the front, ascending from below, is called *refining the form with golden fluid*, manifesting as jade trees and golden flowers.\n\nIf, in *golden fluid returning to the cinnabar*, the ascent has not yet reached the *Lower Origin* but rises from both front and back, it is called *fire rising to burn the body*. This is *golden fluid returning to the cinnabar and refining the form*, where both front and back rise together, completing the burning of the body. In practicing this, one must strictly regulate conduct, endure hardship, and remain unwavering until verification is achieved.\n\n*The Essentials of the Dao* states: \"After rising, close the ears all night and drink golden fluid in due time. The feast reaches Qingzhou before stopping; at sunset, listen again to the yang song.\" The explanation: \"After rising, close the ears all night\" refers to practicing *golden fluid returning to the cinnabar*, where one must fly golden essence from behind the elbow, striking the Three Passes. As soon as the qi rises, quickly close both ears with the hands, for the ears are the gates of kidney qi, preventing its leakage outward so it does not enter the brain. \"Drink golden fluid in due time\" means that once the qi enters the brain, immediately follow the previous method: nod the head, curve the neck, retract the tongue so its tip nearly touches the upper palate, and invite the sweet water, which has an extraordinary effect, as sweet as honey. At the *Gen* trigram, fly golden essence once and swallow until the *Zhen* trigram. Qingzhou is the *Zhen* trigram. Sunset is the *Dui* trigram. \"Listen again to the yang song\" means that from the *Dui* trigram, restrain the *Yang Pass* until the *Qian* trigram, without needing to gather the medicine.\n\nAfter drinking all night, fire rises, ascending from the front and rising from the back to burn the body. Though not bound by years or months, within the day there is naturally *Qian*. The explanation: This formula is the method of *refining the form with golden fluid*. \"After drinking all night, fire rises\" refers to *golden fluid returning to the cinnabar* as before; refining the form at the *Gen* trigram is the rising of fire. Ascending from the front and rising from the back is flying golden essence to ignite the fire. The method of refining the form with jade fluid first rises from the back, flying golden essence into the crown, then returns the elixir and rises again from the front to refine the form—this differs from the method of refining the form with golden fluid.\"",
      "overlap_context": "rification, cease practice, strictly regulate conduct, follow the method according to the season, and proceed to subsequent matters.\n\n**Golden Fluid Returning to the Cinnabar, Seventh: Appended Method of Refining the Form with Golden Fluid**\n\nThe *Golden Edict* states: \"Accumulated yang forms spirit; within spirit, there is form. Form is born of the sun; the sun is born of the moon. Accumulated yin forms the body; within the body, there is spirit. Spirit is born of metal; metal is born of jade.\"",
      "start_char": 11358,
      "end_char": 12610,
      "start_sentence": 385,
      "end_sentence": 423,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.590280055999756,
      "metadata": {
        "source_file": "dao\\藏外\\灵宝毕法.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "当其飞金晶而起火入顶，便前起而炼形，前后俱起，名日焚身，火起而行还丹，须依四时加减之数行之。 此法不拘年月日时，但以谨节专一，幽居绝迹可也。 日中自有乾坤，盖午前烧乾，午后烧坤，以人身前后言之，肚腹为坤，而背后为乾。 午前烧乾者，为肘后飞金晶，前起炼形也； 午后烧坤者，自兑卦勒阳关，至乾却方止也。 直解曰：金液，肺液也。 含龙虎而入下田，则大药将成，谓之金液； 肘后抽之入脑，自上复降下田，则日还丹； 又复前升，遍满四体，自下而上，则日炼形，亦谓之炼形成气。 此须于玉液还丹炼形见验，正当以谨节幽居焚香而行此法。 金液还丹而相次炼形勒阳关，如是一年外，方得焚身，焚身即是坎卦前炼形。 以人身前后言之，肚腹为坤，背后为乾，焚身午前烧乾为金晶，午后烧坤勒阳关。 凡烧乾自下而上，前后俱起，冬夏三日或五日，而行既济之法，以防太过，使金丹之有润，乃焚身起火中咽也，见验方止，内志清高以合太虚，魂神不游以绝梦寐，阳精成体； 神府坚固，四时不畏寒暑，神采变移容仪，常人对面，虽彼富贵之徒，亦闻腥秽，益其几骨俗体也。 功行满足．密授三谙真阳阳变化，人事灾福，神灵皆能预知，触目尘凡，心绝万境，宾气充满，口绝饮仑，异气透出金色，仙肌可比玉蕊，去留之处，当所神抵自来相见，驱用招呼，一如己意，真气纯阳，可干外汞。 上件皆金液还丹之后，金液炼形之验也。 右中乘三门，系地仙。 下卷大乘超凡入圣法三门 朝元炼气第八 《金诰》曰：一气初判，大道有形而列二进制仪，二仪定位，大道有名而分五帝。 五帝异地，各守一方，五方异气，各守一子。 青帝之子，甲乙受之，天真木德之九炁； 赤帝之子，丙丁受之，天真火德之三炁； 白帝之子，庚辛受之，天真金德之七炁； 黑帝之子，壬癸受之，天真水德之五炁； 黄帝之子，戊己受之，天真土德之一炁。 自一炁生真一，真一因土出，故万物生成在土，五行生成在一。 真元之道，皆一炁而生也。 《玉书》曰：一三五七九，道之分而有数； 金木水火土，道之变而有象； 东西南北中，道之列而有位； 青白赤黄黑，道之散而有质。 数归于无数，象反于无象，位至于无位，质还于无质。 欲道之无数，不分之则无数矣欲道之无象，不变之则无象矣； 欲道无无位，不列之则无位矣； 欲道之无质，不散之则无质矣。 无数，道之源也； 无象，道之本也； 无位，道之真也； 无质，道之妙也。 《真源》曰：道源既判，降本流末。 悟其真者，因真修真，内真而外真自应矣； 识其妙者，因妙造妙，内妙而外妙自应矣。 天地得道之真，其真未应，故未免乎有位； 天地得道之妙，其妙未应，故未免乎有质。 有质则有象可求，有位则有数可推。 天地之间，万物之内，最贵惟人，即天地之有象可求，故知其质气与水也，即天地之有数可推，故知其位远与近也，审乎如是，而道亦不远于人也。 《比喻》曰：天地有五帝，比人之有五脏也。 育帝甲乙木，甲为阳，乙为阴，比肝之气与液也； 黑帝壬癸水，壬为阳，癸为阴，比肾之气与液也； 黄帝戊已土，戊为阳，己为阴，比脾之气与液也； 赤帝丙丁火，丙为阳，丁为阴，比心之气与液也；",
      "translated_text": "When golden essence flies and fire rises to enter the crown, then refine the form by rising from the front—both front and back rising together is called *fenshen* (body-burning). As fire rises to circulate the returning elixir, one must follow the seasonal augmentation and reduction cycles. This method is not bound by years, months, days, or hours; it requires only disciplined focus and secluded practice, free from worldly distractions.\n\nWithin the day, there is naturally *Qian* and *Kun*: burning *Qian* before noon and burning *Kun* after noon. In terms of the human body, the abdomen is *Kun*, and the back is *Qian*. Burning *Qian* before noon refers to flying golden essence from behind the elbows to rise and refine the form; burning *Kun* after noon begins at the *Dui* trigram, restraining the *Yang* pass, and continues until reaching *Qian*.\n\nDirect Explanation: *Golden fluid* is the fluid of the lungs. When it contains *Dragon* and *Tiger* and enters the lower *dantian*, the great medicine nears completion—this is called *golden fluid*. Drawing it from behind the elbows into the brain, then descending again to the lower *dantian*, is called *returning the elixir*. Rising once more to fill the entire body from below to above is called *refining the form*, also known as *refining the form into qi*.\n\nThis must be verified through the practice of *jade fluid returning the elixir* and refining the form. One should conduct this method with disciplined seclusion, burning incense. After *golden fluid returns the elixir* and sequentially refines the form by restraining the *Yang* pass, only after a year or more can *fenshen* be achieved. *Fenshen* is refining the form before the *Kan* trigram. In terms of the human body, the abdomen is *Kun*, and the back is *Qian*. Burning *Qian* before noon produces golden essence; burning *Kun* after noon restrains the *Yang* pass.\n\nWhen burning *Qian*, rise from below to above, both front and back igniting together. In winter and summer, practice the *jiji* (Completion) method for three or five days to prevent excess, ensuring the golden elixir remains moist. This is the *fenshen* method of swallowing fire amid the rising flames. Cease only upon verification. The inner will becomes pure and lofty, merging with the Great Void; the hun and shen do not wander, banishing dreams. The yang essence solidifies the body; the spirit’s abode becomes unshakable. One is no longer affected by the cold of winter or the heat of summer. The countenance transforms, and even when facing ordinary people, though they may be wealthy or noble, they seem foul and rank, further revealing the refinement of one’s bones and the transcendence of the mundane form.\n\nWhen merit and practice are complete, one secretly receives the three mysteries of true yang’s transformations. Matters of fortune and misfortune, the movements of spirits—all can be foreseen. The eyes perceive only the dust of the world, yet the mind is cut off from all realms. Vital qi fills the body, and the mouth no longer craves food or drink. A radiant aura emanates, golden in hue; the immortal flesh rivals jade blossoms. Wherever one goes, divine beings naturally appear, responding to commands as if by one’s own will. The true qi is purely yang, capable of refining external mercury.\n\nAll the above are the verifications of *golden fluid returning the elixir* and *golden fluid refining the form*.\n\n---\n\nThe Middle Vehicle’s Three Gates pertain to Earthly Immortals.\n\n**The Great Vehicle’s Three Gates of Transcending the Mundane and Entering Sagehood**\n**Chapter Eight: Refining Qi to Align with the Origin**\n\nThe *Golden Edict* states: When the primordial qi first divided, the Great Dao took form and established the binary patterns of yin and yang. Once yin and yang settled into their positions, the Great Dao acquired names and divided into the Five Emperors. The Five Emperors rule different lands, each guarding one direction; the five directions possess distinct qi, each governed by a child.\n\nThe child of the Green Emperor receives *jia* and *yi*, the nine qi of Heaven’s true Wood virtue.\nThe child of the Red Emperor receives *bing* and *ding*, the three qi of Heaven’s true Fire virtue.\nThe child of the White Emperor receives *geng* and *xin*, the seven qi of Heaven’s true Metal virtue.\nThe child of the Black Emperor receives *ren* and *gui*, the five qi of Heaven’s true Water virtue.\nThe child of the Yellow Emperor receives *wu* and *ji*, the one qi of Heaven’s true Earth virtue.\n\nFrom the one qi, True Unity is born. True Unity emerges through Earth, thus all things are generated in Earth, and the Five Phases are generated in the One. The Dao of the True Origin is born from the one qi.\n\nThe *Jade Book* states: One, three, five, seven, nine—these are the divisions of the Dao into numbers.\nMetal, Wood, Water, Fire, Earth—these are the transformations of the Dao into images.\nEast, West, South, North, Center—these are the arrangements of the Dao into positions.\nGreen, White, Red, Yellow, Black—these are the dispersals of the Dao into substances.\n\nNumbers return to the absence of numbers; images revert to the absence of images; positions dissolve into the absence of positions; substances resolve into the absence of substances.\n\nTo attain the Dao’s absence of numbers, do not divide—then there are no numbers.\nTo attain the Dao’s absence of images, do not transform—then there are no images.\nTo attain the Dao’s absence of positions, do not arrange—then there are no positions.\nTo attain the Dao’s absence of substances, do not disperse—then there are no substances.\n\nThe absence of numbers is the Dao’s source.\nThe absence of images is the Dao’s root.\nThe absence of positions is the Dao’s truth.\nThe absence of substances is the Dao’s subtlety.\n\nThe *True Source* states: Once the Dao’s source divided, it descended from the root and flowed to the branches. Those who awaken to its truth cultivate truth through truth; inner truth naturally manifests externally. Those who recognize its subtlety create subtlety through subtlety; inner subtlety naturally manifests externally.\n\nHeaven and Earth attain the Dao’s truth, yet their truth remains unmanifest—thus they are not free from positions.\nHeaven and Earth attain the Dao’s subtlety, yet their subtlety remains unmanifest—thus they are not free from substances.\nWith substances, there are images to seek; with positions, there are numbers to deduce.\n\nAmong all things between Heaven and Earth, none is more noble than humanity. Just as Heaven and Earth possess images to seek, one knows their substances and qi are like water. Just as Heaven and Earth possess numbers to deduce, one knows their positions are near or far. Examining this closely, the Dao is not distant from humanity.\n\nThe *Analogy* states: Heaven and Earth have the Five Emperors, just as humans have the five viscera.\nThe Green Emperor’s *jia* and *yi* (Wood), *jia* as yang and *yi* as yin, correspond to the liver’s qi and fluids.\nThe Black Emperor’s *ren* and *gui* (Water), *ren* as yang and *gui* as yin, correspond to the kidneys’ qi and fluids.\nThe Yellow Emperor’s *wu* and *ji* (Earth), *wu* as yang and *ji* as yin, correspond to the spleen’s qi and fluids.\nThe Red Emperor’s *bing* and *ding* (Fire), *bing* as yang and *ding* as yin, correspond to the heart’s qi and fluids.",
      "overlap_context": "g all night, fire rises\" refers to *golden fluid returning to the cinnabar* as before; refining the form at the *Gen* trigram is the rising of fire. Ascending from the front and rising from the back is flying golden essence to ignite the fire. The method of refining the form with jade fluid first rises from the back, flying golden essence into the crown, then returns the elixir and rises again from the front to refine the form—this differs from the method of refining the form with golden fluid.\"",
      "start_char": 12610,
      "end_char": 13862,
      "start_sentence": 424,
      "end_sentence": 475,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.919238567352295,
      "metadata": {
        "source_file": "dao\\藏外\\灵宝毕法.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "白帝庚辛金，庚为阳，辛为阴，比肺与液也。 凡春夏秋冬之时不同，而心肺肝肾之旺有月。 《真诀》曰：凡春三月肝气旺，肝旺者，以父母真气，随天度运而在肝，若遇日，甲乙克土，于辰戊丑未之时，依时起火炼脾气，徐日兑卦时，损金以耗肺气，是时不可下功也，坎卦时，依法起火炼肾气，震卦时入室，多入少出，息住为上，久闭次之，数至一千息为度，当时内观如法，一在冥心闭目，青色自见，渐渐升身以入泥丸，自冥至辰，以满震封。 凡夏三月心气旺，心旺者，以父母真气，随天魔运而在心，若遇火日，丙丁克金，于兑封时，依法起火炼肺气，馀日坎封时，损水以耗肾气，是时不可下功也，震卦时，依法起火炼肝气，离封时入室，依前行持，赤色自见，渐渐升身以入泥丸，月巳至未，以满离卦。 凡秋三月肺气旺，肺旺者，以父母真气，随天度运而在肺，若遇金月，庚辛克木，于震卦时，依法起火炼肝气，徐日离卦时，损火以耗心气，是时不可下功也，巽卦时，依法起火炼脾气，兑卦时入室，依前行持，白色自见，渐渐升身以入泥丸，自申至戊，以满兑封。 凡冬三月肾气匪，肾旺者，以父母真气，随天度运而在肾，若遇水日，壬癸克火，于离卦时，依法起火炼心气，馀日辰戍丑未时，损土以耗脾气，是时不可下功也，兑卦时，依法起火炼肺气，坎封时入室，依前行持，黑色自见，渐渐升身以入泥丸，自亥至丑，以满坎封。 解曰：春炼肝千息青气出，春末十八日，不须依前行持，于定息为法，终日静坐，以养脾而炼己之真气，乃可坎卦起火炼肾，恐耗其真气。 夏炼心千息赤气出，夏末十八日，不须依前行持，止于定息为法，终日静坐，养炼如前，乃可震卦时起火如前。 秋炼肺千息白气出，秋末十八日，不须依前行持，止于定息为法，终日静坐，养炼如前，乃可巽卦时起火如前。 冬炼肾千息黑气出，冬末十八日，不须依前行持，止于定息为法，终日静坐，养炼如前，乃可兑卦时起火如前，以至黄气成光，默观万道，周匝围身。 凡定息之法，不在强留而紧闭，但绵绵若存，用之不勤，从有入无，使之自住。 采药之法，食津提固以压心，使真气不散。 凡入室须闭户，孤幽静馆，远鸡犬女子、一切厌触之物，微开小窍，使明能辨物，勿令风日透气，左右有声。 当灰心息虑，事累俱遣，内外凝寂，不以一物介其意。 盖以阳神初聚，真气方凝，看如婴儿，尚未及老，日夕焚香，跪拜稽首，一祝天，二祝天仙，三祝地仙，三礼既毕，静坐忘机，以行此法，仍须前法节节见验。 若以此便为道，但恐徒劳，终不见成，止于阴魄出壳而为鬼仙。 《道要》曰：凡行此法，不限年月日时，一依前法，以至见验方止。 其气自见，须是谨节不倦，弃绝外事，止于室中用意，测其时候。 用二个纯阳小子，或结交门生，交翻往复，供过千日，可了一气。 一以夺十，一百日见功，五百日气全，可行内观，然后聚阳神以入天神，炼神合道，入圣超凡。 炼气之验，但觉身体极畅，常仰升腾，丹光透骨，异香满室，次静中外观，紫霞满目，顶中下视，金光罩体，奇怪证验，不可备纪。 内观交换第九 《金诰》曰：大道本无体，寓于气也，其大无外，无物可容；",
      "translated_text": "The White Emperor’s *geng* and *xin* (Metal), *geng* as yang and *xin* as yin, correspond to the lungs’ qi and fluids.\n\nIn all the seasons of spring, summer, autumn, and winter, the heart, lungs, liver, and kidneys each flourish in their respective months. The *True Formula* states:\n\nIn the three months of spring, the liver’s qi flourishes. When the liver flourishes, the parents’ true qi follows the celestial movements and resides in the liver. If encountering a *jia* or *yi* day, which restrains Earth, during the hours of *chen*, *xu*, *chou*, or *wei*, one should kindle fire to refine the spleen’s qi at the appropriate time. When the *dui* trigram’s time arrives, Metal is diminished to deplete the lung’s qi—this is not the time to engage in practice. During the *kan* trigram’s time, kindle fire according to the method to refine the kidney’s qi. At the *zhen* trigram’s time, enter the chamber, inhaling deeply and exhaling lightly, with breath retention as the highest method, prolonged closure as secondary. Count to one thousand breaths as the measure. At that time, internally observe according to the method: first, empty the mind and close the eyes, and a green light will naturally appear. Gradually ascend the body to enter the *niwan* palace, from darkness to the *chen* hour, filling the *zhen* seal.\n\nIn the three months of summer, the heart’s qi flourishes. When the heart flourishes, the parents’ true qi follows the celestial demonic movements and resides in the heart. If encountering a fire day, *bing* or *ding*, which restrains Metal, during the *dui* seal’s time, kindle fire according to the method to refine the lung’s qi. On other days, during the *kan* seal’s time, Water is diminished to deplete the kidney’s qi—this is not the time to engage in practice. During the *zhen* trigram’s time, kindle fire according to the method to refine the liver’s qi. At the *li* seal’s time, enter the chamber and practice as before. A red light will naturally appear, gradually ascending the body to enter the *niwan* palace, from the *si* hour to the *wei* hour, filling the *li* trigram.\n\nIn the three months of autumn, the lung’s qi flourishes. When the lungs flourish, the parents’ true qi follows the celestial movements and resides in the lungs. If encountering a metal month, *geng* or *xin*, which restrains Wood, during the *zhen* trigram’s time, kindle fire according to the method to refine the liver’s qi. On other days, during the *li* trigram’s time, Fire is diminished to deplete the heart’s qi—this is not the time to engage in practice. During the *xun* trigram’s time, kindle fire according to the method to refine the spleen’s qi. At the *dui* trigram’s time, enter the chamber and practice as before. A white light will naturally appear, gradually ascending the body to enter the *niwan* palace, from the *shen* hour to the *xu* hour, filling the *dui* seal.\n\nIn the three months of winter, the kidney’s qi flourishes. When the kidneys flourish, the parents’ true qi follows the celestial movements and resides in the kidneys. If encountering a water day, *ren* or *gui*, which restrains Fire, during the *li* trigram’s time, kindle fire according to the method to refine the heart’s qi. On other days, during the hours of *chen*, *xu*, *chou*, or *wei*, Earth is diminished to deplete the spleen’s qi—this is not the time to engage in practice. During the *dui* trigram’s time, kindle fire according to the method to refine the lung’s qi. At the *kan* seal’s time, enter the chamber and practice as before. A black light will naturally appear, gradually ascending the body to enter the *niwan* palace, from the *hai* hour to the *chou* hour, filling the *kan* seal.\n\nExplanation: In spring, refine the liver for one thousand breaths until green qi emerges. In the last eighteen days of spring, do not practice as before; instead, use settled breathing as the method. Sit in stillness all day to nourish the spleen and refine one’s true qi. Only then can one kindle fire at the *kan* trigram’s time to refine the kidneys, lest the true qi be depleted.\n\nIn summer, refine the heart for one thousand breaths until red qi emerges. In the last eighteen days of summer, do not practice as before; instead, use settled breathing as the method. Sit in stillness all day, nourishing and refining as before. Only then can one kindle fire at the *zhen* trigram’s time as before.\n\nIn autumn, refine the lungs for one thousand breaths until white qi emerges. In the last eighteen days of autumn, do not practice as before; instead, use settled breathing as the method. Sit in stillness all day, nourishing and refining as before. Only then can one kindle fire at the *xun* trigram’s time as before.\n\nIn winter, refine the kidneys for one thousand breaths until black qi emerges. In the last eighteen days of winter, do not practice as before; instead, use settled breathing as the method. Sit in stillness all day, nourishing and refining as before. Only then can one kindle fire at the *dui* trigram’s time as before, until yellow qi forms a radiance, and one silently observes myriad rays encircling the body.\n\nThe method of settled breathing does not rely on forced retention or tight closure; rather, it should be continuous as if present, applied without strain, moving from existence into non-existence, allowing it to reside naturally.\n\nThe method of gathering the medicine: swallow saliva and secure it to press the heart, preventing the true qi from scattering.\n\nWhen entering the chamber, one must close the door, seclude oneself in a quiet dwelling, far from chickens, dogs, women, and all disturbing influences. Slightly open a small aperture to allow enough light to discern objects, but do not let wind or sunlight penetrate. There should be no sounds nearby.\n\nOne should calm the mind and cease thoughts, casting aside all worldly concerns. Internally and externally, maintain stillness, allowing nothing to disturb the intent.\n\nFor the yang spirit is newly gathered and the true qi is just congealing, it is like an infant, not yet mature. Day and night, burn incense, kneel, and bow in reverence: first, pray to Heaven; second, to the Heavenly Immortals; third, to the Earthly Immortals. After completing the three bows, sit in stillness, forgetting all schemes, and proceed with this method. One must also see verification step by step in the previous methods. If one takes this as the Dao, one may labor in vain and never achieve success, merely becoming a ghostly immortal with the yin soul leaving the body.\n\nThe *Essentials of the Dao* states: In practicing this method, there is no restriction on years, months, days, or hours; one must follow the previous methods until verification is seen before stopping. When the qi naturally appears, one must be diligent and unwavering, abandoning external affairs and focusing solely within the chamber, gauging the appropriate times.\n\nUse two pure yang youths or establish a bond with disciples, alternating their service for over a thousand days to complete one qi cycle. One gains tenfold with each cycle: in one hundred days, results appear; in five hundred days, qi is complete, and one can practice internal observation. Then, gather the yang spirit to merge with celestial spirits, refine the spirit to unite with the Dao, and ascend beyond the ordinary to become a sage.\n\nThe verification of refining qi: one feels the body extremely comfortable, often ascending as if lifted. The elixir light penetrates the bones, and an extraordinary fragrance fills the room. Next, in stillness, one externally observes purple auroras filling the eyes. Looking downward from the crown, a golden light envelops the body. Strange and wondrous signs of verification are too numerous to record.\n\n**Internal Observation and Transformation, Ninth Chapter**\n\nThe *Golden Teachings* states: The great Dao has no form; it resides in qi. Its vastness has no bounds, and nothing can contain it.",
      "overlap_context": "s humans have the five viscera.\nThe Green Emperor’s *jia* and *yi* (Wood), *jia* as yang and *yi* as yin, correspond to the liver’s qi and fluids.\nThe Black Emperor’s *ren* and *gui* (Water), *ren* as yang and *gui* as yin, correspond to the kidneys’ qi and fluids.\nThe Yellow Emperor’s *wu* and *ji* (Earth), *wu* as yang and *ji* as yin, correspond to the spleen’s qi and fluids.\nThe Red Emperor’s *bing* and *ding* (Fire), *bing* as yang and *ding* as yin, correspond to the heart’s qi and fluids.",
      "start_char": 13862,
      "end_char": 15102,
      "start_sentence": 476,
      "end_sentence": 498,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.480340003967285,
      "metadata": {
        "source_file": "dao\\藏外\\灵宝毕法.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "大道本无用，运于物也，其深莫测，无理可究。 以体言道，道始有外内之辨； 以用言道，道始有观见之基。 观乎内而不观乎外，外无不究而内得明矣，观乎神而不观乎形，形无不备而神得见矣。 《真源》曰，以一心观万物，万物不谓之有徐； 以万物挠一气，一气不谓之不足。 一气归一心，心不可为物之所夺； 一心运一气，气不可为法之所役。 心源清彻，照万破，亦不知有物也； 气战刚强，万感一息，亦不知有法也。 物物无物，以还本来之象； 法法无法，乃全自得之真。 《比喻》曰：以象生形，因形立名。 有名则推其数，有数则得其理。 盖高上虚无，无物可喻，所可比者，如人之修炼，节序无差，成就有次，冲和之气，凝而不散，至虚真性，恬淡无为，神合乎道，归于自然。 当此之际，以无心为心，如何谓之应物以无物为物，如何谓之用法？ 真乐熙熙，不知己之有身，渐入无为之道，以入希夷之域，斯为入圣超凡之客。 《真诀》曰：此法合道，有如常说存想之理，又如禅僧入定之时，当择福地置室，跪礼焚香，正坐盘膝，散发披衣，握固存神，冥心闭目，午时前微微升身，起火炼炁，午时后微微敛身，聚火炼丹，不拘昼夜，神清气合，自然喜悦。 坐中或闻声莫听，见境勿认，物境自散，若认物境，转加魔障。 魔障不迟，急急向前，以身微敛，敛而伸腰，后以胸微幅，偃不伸腰，少时前后火起，高升其勿动，名曰焚身，火起魔障自散于躯外，阴邪不入于壳中。 如此三两次已，当想遍天地之间，皆是炎炎之火，火毕清凉，了无一物，但见车马歌舞，轩盖绣罗，富贵繁华，人物欢娱，成队成行，五色云升，如登天界，及到彼中，又见楼台耸翠，院字徘徊，珍珠金玉，满地不收，花果池亭，莫知其数，须臾异香四起，妓乐之音，嘈嘈杂杂，宾朋满坐，水陆陈，且笑且语，共贺太平，珍玩之物，互相献受，当此之际； 虽然不是阴鬼魔军，亦不得认为好事。 益修真之人，弃绝外事，甘受寂寞，或潜迹江湖之地，或遁身隐僻之隅，绝念忘情，举动有戒，久受劬劳，而历潇洒，一旦功成法立，遍见如此繁华； 又不谓是明魔，格谓实到天宫，殊不知脱凡胎，在顶中自己天宫之内； 因而贪恋，认为实境，不用超脱之法，止于身中，阳神不出，而胎仙不化； 乃曰出昏衢之上，为陆地神仙，仅可长生不死而已，不能脱质升仙，而归三岛，以作仙子，到此可惜！ 学人自当虑超脱虽难，不可不行也。 《道要》曰：不无尽法已减省故也。 超脱分形第十 《金诰》曰：道本无也，以有言者，非道也； 道本虚也，以实言者，非道也； 既为无体，则问应俱不能矣； 朗为无象，则视听俱不能矣。 以玄微为道； 玄微亦不离问答之累； 以希夷为道，希宪亦未免视听之累。 希夷玄微尚未为道，则道亦不知其所以然也。 《玉书》曰：其来有始，而不知大道之始，何也其去有尽，而不知大道之终； 何也？ 高高之上虽有上，而不知大道之上无有穷也深深之下虽有下，而不知大道之下无有极也。 杏杏莫测名曰道，随物所得而列等殊，无为之道，莫能穷究也。 《真诀》曰：超者，超出凡躯而入圣品； 脱者，脱去俗胎而为仙子； 是神入气胎，气全真性，须是前功节节见验正当，方居清静之室；",
      "translated_text": "The great Dao has no function; it operates through things. Its depth is unfathomable, and no principle can exhaust it. Speaking of the Dao in terms of its essence, distinctions between external and internal arise; speaking of it in terms of its function, the foundation for observation and perception is established. Observe the internal and not the external, and though nothing external remains unexamined, the internal becomes clear. Observe the spirit and not the form, and though no form is left unprepared, the spirit becomes visible.\n\n*The True Source* states: With one mind, observe the myriad things, and the myriad things cannot be said to be excessive. With the myriad things disturbing the one qi, the one qi cannot be said to be insufficient. When the one qi returns to the one mind, the mind cannot be seized by things. When the one mind moves the one qi, the qi cannot be enslaved by methods. When the source of the mind is pure and clear, it illuminates the ten thousand and shatters them, yet remains unaware of things. When qi wages a fierce struggle, the ten thousand sensations rest in a single breath, yet remain unaware of methods. Things are no-things, returning to the original image; methods are no-methods, thus fulfilling the true self-attainment.\n\n*The Parable* states: From images arise forms, and from forms names are established. With names, one infers their numbers; with numbers, one grasps their principles. Yet the lofty and supreme void is such that nothing can compare to it. What can be likened to it is like a person’s cultivation: the sequence of stages is unerring, and attainment follows order. The harmonious qi congeals without dispersing; the utterly empty true nature is serene and without action. The spirit merges with the Dao and returns to spontaneity. At this moment, with no-mind as mind, how can one speak of responding to things? With no-thing as thing, how can one speak of employing methods? In true joy, radiant and blissful, one forgets the existence of one’s own body. Gradually entering the Dao of non-action, one reaches the realm of the subtle and imperceptible, becoming a guest who has entered sagehood and transcended the ordinary.\n\n*The True Formula* states: This method accords with the Dao, resembling the principle of visualization often discussed, or like the moment when a Chan monk enters samadhi. One should choose an auspicious site and prepare a chamber, kneel in reverence, burn incense, sit upright with legs crossed, let the hair down and the robe loose, clasp the hands to retain spirit, quiet the mind, and close the eyes. Before noon, slightly raise the body to kindle the fire and refine qi; after noon, slightly gather the body to concentrate the fire and refine the elixir. Regardless of day or night, when spirit and qi harmonize, joy arises naturally. During meditation, if sounds are heard, do not listen; if visions appear, do not acknowledge them. External phenomena will disperse on their own; if one acknowledges them, demonic obstacles will only intensify. When demonic obstacles arise without delay, swiftly proceed forward: slightly gather the body, then straighten the waist; afterward, slightly arch the chest, lean back without straightening the waist. After a short while, fire will rise before and behind—do not move when it ascends, for this is called \"firing the body.\" When the fire rises, demonic obstacles will scatter beyond the body, and yin evil will not enter the shell. After two or three repetitions, visualize all between heaven and earth as raging flames. When the fire subsides, all is cool and clear, with nothing remaining—only carriages and horses, singing and dancing, canopies and embroidered silks, wealth and splendor, joyous figures in processions, ascending on five-colored clouds as if entering the celestial realm. Upon arrival, one sees towering pavilions and jade-green terraces, courtyards and corridors, pearls and gold scattered ungathered, gardens and ponds, flowers and fruits beyond count. Suddenly, exotic fragrances arise on all sides, and the sounds of music and revelry fill the air. Guests and friends sit in abundance, with delicacies of land and sea laid out. Laughing and conversing, they celebrate great peace, exchanging rare treasures. At this moment, though these are not the armies of yin ghosts or demons, one must not regard them as auspicious events.\n\nFor those who cultivate the true, who abandon worldly affairs and willingly endure solitude—whether concealing themselves in rivers and lakes or secluding themselves in remote corners, cutting off thoughts and forgetting emotions, every action guarded—after long toil and hardship, once the work is accomplished and the method established, such splendor may appear. Yet if one does not recognize this as a manifestation of demons but instead believes it to be the true celestial palace, unaware that having shed the mortal coil, one’s own celestial palace lies within the crown—if one becomes attached and takes it as reality, failing to employ the method of transcendence, remaining within the body, the yang spirit will not emerge, and the immortal embryo will not transform—then one may claim to have risen above the dark paths, becoming a terrestrial immortal, merely achieving longevity without death. Yet one cannot shed the physical form to ascend as an immortal and return to the Three Isles as a transcendent being. At this point, what a pity! Students must consider that though transcendence is difficult, it cannot be neglected.\n\n*The Essentials of the Dao* states: It is not that the inexhaustible method has diminished.\n\n**Transcendence and Liberation of Form, Tenth Chapter**\n\n*The Golden Teachings* states: The Dao is originally nothing; to speak of it as existing is not the Dao. The Dao is originally empty; to speak of it as substantial is not the Dao. Since it is without form, neither questioning nor response can reach it. Since it is without image, neither sight nor hearing can grasp it. If one takes the mysterious and subtle as the Dao, the mysterious and subtle still cannot escape the burden of question and answer. If one takes the subtle and imperceptible as the Dao, the subtle and imperceptible still cannot avoid the burden of sight and hearing. If even the subtle and imperceptible are not the Dao, then the Dao is also beyond knowing how it is so.\n\n*The Jade Scripture* states: Its coming has a beginning, yet one does not know the beginning of the great Dao. What is this? Its going has an end, yet one does not know the end of the great Dao. What is this? Above the loftiest height, though there is still higher, one does not know that above the great Dao there is no limit. Below the deepest depth, though there is still lower, one does not know that below the great Dao there is no end. Vast and unfathomable, it is called the Dao. It accords with what things attain and arranges them in differing ranks. The Dao of non-action cannot be exhausted.\n\n*The True Formula* states: \"Transcend\" means transcending the mortal frame to enter sagehood; \"liberate\" means shedding the mundane embryo to become an immortal child. It is when the spirit enters the qi embryo, qi is complete, and true nature is realized—only when each stage of prior effort has been verified and is correct—should one reside in a chamber of purity.",
      "overlap_context": "ifted. The elixir light penetrates the bones, and an extraordinary fragrance fills the room. Next, in stillness, one externally observes purple auroras filling the eyes. Looking downward from the crown, a golden light envelops the body. Strange and wondrous signs of verification are too numerous to record.\n\n**Internal Observation and Transformation, Ninth Chapter**\n\nThe *Golden Teachings* states: The great Dao has no form; it resides in qi. Its vastness has no bounds, and nothing can contain it.",
      "start_char": 15102,
      "end_char": 16358,
      "start_sentence": 499,
      "end_sentence": 542,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.032798051834106,
      "metadata": {
        "source_file": "dao\\藏外\\灵宝毕法.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "以入希夷之境，内观认阳神，次起火降魔，焚身聚气，真气升在天宫，壳中清静，了无一物。 当择幽居，一依内观，三礼既毕，平身不须高升，正坐不须敛伸，闭目冥心，静极朝元之后，身躯如在空中，神气飘然，难为制御，默然内观，明朗不昧，山川秀丽，楼阁依稀，紫气红光，纷纭为陈，祥鸾彩凤，音语如簧，异景盟华，可谓壶中真趣，而洞天别景，追逐自在，冥然不知有尘世之累，是真空之际，其气自转，不须用法依时。 若见青气出东方，笙簧嘹亮，旌节车马，左右前后，不知多少，须臾南方赤气出，西方白气出，北方黑气出，中央黄气出，五气结聚而为彩云，乐声嘈杂，喜气熙熙，金童玉女，扶拥自身，或跨火龙，或乘玄鹤，或路彩鸾，或骑猛虎，升腾空中，自上而下。 所过之处，楼台现宇，不能尽陈，神抵官吏，不可备说，又到一处，女乐万行，宫撩班列，如人间帝王之仪，圣贤毕至，当此之时，见之傍若无人，乘驾上升，以至一门，兵卫严肃，而不可犯，左右前后，官僚女乐，留恋不已，终是过门不得，轩盖覆面，自上而下，复入旧居之地，如此上，不厌其数，是调神出壳之法也。 积日纯熟，一升而到天宫，一降而还旧处，上下绝无碍滞，乃自下而上，或如登七级宝塔，或如上三层琼楼，其始也’‘级而复一级，七级上尽，以至顶中，辄不得下视，恐神惊而恋躯不出，既至七级之上，则闭目便跳，如寐如脂，身外有身，形如婴儿，肌肤鲜洁，神采莹然，回视故躯，亦不见有，所见之者，乃如粪堆，又如枯木，憎愧万端，辄不可顿弃而远游。 益其神出未熟，圣气凝结而成，须是再入本躯，往来出入，一任遨游，始乎一步二步，次二里三里，积日纯熟，乃如壮士展臂，可千里万里，而形神壮大，勇气坚固，然后寄凡骸于名山大州之中，从往来应世之外，不与俗类等伦，或行满而受天书，骖鸾乘凤，跨虎骑龙，自东自西，以入紫府，先见太微真君，次居下岛，欲升洞天，当传道积行于人问，受天书而升洞天，以为天仙。 凡行此法，古今少有成者，益以功不备而欲行之速，便为此道； 或功验未证，止事静坐，欲求超脱； 或阴灵不散，出为鬼仙，人不见形，来往去任，终无所归，止于投胎就舍，而夺人躯壳，复得为人； 或出入不熟，往来无法，一去一来，无由再入本躯，神魂不知所在，乃释子之坐化、道流之尸解也。 故行此道，要在前功见验正当仍择地筑室，以远一切腥秽之物、臭恶之气、往来之声、女子之色，不止于触其真气，而神亦厌之。 既出而复入，入而不出，则形神俱妙，与天地齐年，而浩劫不死； 既入而复出，出而不入，如蝉脱蜕，迁神入圣，此乃超凡脱俗，以为真人仙子，而在风尘之外，寄居三岛十洲者也。 《道要》曰：不无尽法已灭息矣。 右大乘三门，系天仙。",
      "translated_text": "Entering the realm of the formless and soundless, one inwardly observes and recognizes the yang spirit. Next, one kindles the fire to subdue demons, burns the body to gather qi, and the true qi ascends to the celestial palace. Within the shell, all is serene—utterly devoid of anything. One must choose a secluded dwelling and rely solely on inward contemplation. After the three bows are completed, sit upright without rising, the body settled without need for stretching or contracting. Close the eyes, still the mind, and after profound tranquility reaches its apex, the body seems suspended in emptiness, the spirit and qi drifting freely, difficult to restrain. Silently turn the gaze inward, and all becomes luminous and unobscured: mountains and rivers appear resplendent, pavilions and terraces faintly discernible. Purple qi and crimson radiance swirl in profusion; auspicious simurghs and rainbow-feathered phoenixes sing with voices like reed pipes. Wondrous visions and resplendent scenes—this is the true delight within the alchemical crucible, the distinct landscape of the grotto-heaven. One roams at will, oblivious to the burdens of the dusty world. At this moment of true emptiness, the qi circulates of itself, without need for method or adherence to time.\n\nIf a green qi emerges from the east, accompanied by the bright strains of reed pipes and drums, with banners, chariots, and attendants—uncountable in number—appearing on all sides, soon a red qi arises from the south, a white qi from the west, a black qi from the north, and a yellow qi from the center. The five qi converge to form iridescent clouds, while music resounds in joyful tumult. Jade maidens and golden youths surround and support one’s body, some riding fiery dragons, some mounting black cranes, some journeying on rainbow phoenixes, some astride fierce tigers. Ascending into the void, they descend from above. Wherever they pass, towers and palaces manifest, too numerous to recount; divine officials and immortals appear, beyond full description. Arriving at another place, ten thousand ranks of female musicians stand in ordered rows, like the courtly procession of an earthly emperor. Sages and worthies gather in full assembly. At this moment, one remains unmoved by all around, ascending in one’s chariot until reaching a gate. The guards stand in solemn array, unapproachable. On all sides, officials, attendants, and musicians linger in reluctance, yet one ultimately passes through the gate without hindrance. The canopy of the chariot veils the face as one descends from above, returning to the former dwelling. Such ascents occur repeatedly, without number—this is the method of refining the spirit to exit the shell.\n\nWith days of accumulation and mastery, one ascends in a single motion to the celestial palace and descends in one motion to the original abode, moving up and down without the slightest obstruction. Then, ascending from below, one may climb a seven-tiered jeweled pagoda or ascend a three-story jade tower. At first, step by step, one climbs the seven tiers to the summit, yet must not look downward, lest the spirit be startled and cling to the body, failing to emerge. Once atop the seventh tier, close the eyes and leap as if in slumber or trance. A body exists outside the body, its form like that of an infant, its skin fresh and radiant, its spirit luminous. Looking back at the former shell, one sees nothing—only what resembles a dung heap or a withered tree. Shame and revulsion arise in full measure, yet one cannot immediately abandon it and wander afar. For the spirit’s exit is not yet perfected, and the sagely qi has congealed into form. One must re-enter the original body, coming and going freely, roaming at will. At first, one step, then two; then two leagues, then three. With days of accumulation and mastery, one moves like a warrior extending an arm—able to traverse a thousand or ten thousand leagues. The form and spirit grow robust, the courage steadfast. Then, one may entrust the mortal frame to a famous mountain or sacred realm, dwelling beyond the world of transient appearances, no longer equated with the vulgar. When merit is complete, one receives the celestial writ, rides simurghs and phoenixes, mounts tigers and dragons, journeying east and west to enter the Purple Palace. First, one meets the True Lord of the Grand Tenuity, then resides on the lower isles. To ascend to the grotto-heaven, one must transmit the Dao and accumulate merit among mortals, receive the celestial writ, and rise to the grotto-heaven as a celestial immortal.\n\nFew in ancient or modern times have succeeded in this practice, for most seek to hasten the process before their merit is complete, or attempt this path prematurely. Some, though their merit remains unverified, merely engage in quiet sitting, hoping for transcendence. Others, with unresolved yin spirits, become ghost immortals—unseen in form, wandering at will, yet ultimately without refuge, forced to seize mortal bodies and be reborn as humans. Some, unskilled in exit and entry, lack the method for return; once departed, they cannot re-enter their original body, and their spirit drifts without destination—this is the \"sitting transformation\" of Buddhist monks or the \"corpse liberation\" of Daoist adepts. Thus, in pursuing this path, one must ensure that prior merit is verified and correct, and choose a site to construct a chamber, far from all foul and putrid substances, noxious vapors, passing sounds, and the allure of women—lest they disturb the true qi and repulse the spirit.\n\nIf one exits and re-enters, enters and does not exit, then form and spirit attain perfection, matching the years of heaven and earth, enduring through eons without death. If one enters and then exits without re-entering, it is like the cicada shedding its husk—shifting the spirit to sagehood. This is transcending the mortal and shedding the mundane, becoming a true person and immortal child, dwelling beyond the dusty world, residing on the Three Isles and Ten Continents.\n\n*The Essentials of the Dao* states: \"The dharma of non-extinction has already ceased.\"\n\nThe above pertains to the three gates of the Great Vehicle, belonging to the celestial immortals.",
      "overlap_context": "called the Dao. It accords with what things attain and arranges them in differing ranks. The Dao of non-action cannot be exhausted.\n\n*The True Formula* states: \"Transcend\" means transcending the mortal frame to enter sagehood; \"liberate\" means shedding the mundane embryo to become an immortal child. It is when the spirit enters the qi embryo, qi is complete, and true nature is realized—only when each stage of prior effort has been verified and is correct—should one reside in a chamber of purity.",
      "start_char": 16358,
      "end_char": 17434,
      "start_sentence": 543,
      "end_sentence": 557,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.200642585754395,
      "metadata": {
        "source_file": "dao\\藏外\\灵宝毕法.txt",
        "category": "藏外"
      }
    }
  ]
}