{
  "source_id": "灵宝众真丹诀",
  "source_file": "chunked_daozang\\灵宝众真丹诀.json",
  "total_chunks": 7,
  "total_original_chars": 6592,
  "total_translated_chars": 33780,
  "total_translation_time": 182.6225781440735,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\玉诀类\\灵宝众真丹诀.txt",
    "category": "玉诀类"
  },
  "full_translation": "**The *Lingbao Zhongzhen Dan Jue* (Spiritual Treasure Methods of the Multitude of Perfected for Elixir Refinement)**\n\n**Title:** *Lingbao Zhongzhen Dan Jue* (Spiritual Treasure Methods of the Multitude of Perfected for Elixir Refinement)\n**Author:** Unknown. The text mentions \"Gua Prefecture yellow alum,\" suggesting a Tang dynasty origin. It records eight methods for refining and ingesting external elixirs, contained in one scroll.\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongxuan* Section, Jade Instructions Category.\n\n---\n\n### **Method for the Elixir of Returned Soul, with Preface**\n\nMan is endowed by the Five Phases and constrained by the Five Constants, thus becoming prey to the Five Flavors and assailed by the Eight Winds. From the moment of suckling milk to the decrepitude of old age, none escape death by wind. Some perish from overindulgence in food, others from hunger; some from excessive drink, others from parched thirst. Some consume salty or sour flavors, others sip pungent or acrid brews. Some, fearing heat, stand in drafts; others, loathing cold, draw near to fire. Some gaze at the moon in the courtyard; others rest beneath trees in the frost. Some suffer cuts to the flesh; others endure bruises to their limbs. Some ingest desiccating medicines; others guzzle cold water. Some abstain too long from the bedchamber; others expend their essence in excess. Thus, wind rushes into the hundred apertures, and poison gathers in the four limbs, causing hands and feet to falter, speech to falter and slur.\n\nSome endure pain that bores into the marrow; others suffer numbness that creeps over the skin. Some itch as if infested by worms; others grow rigid as iron or stone. Some cough up copious phlegm, forget easily, rage often, their blood and vessels stagnant, their flesh withered and dry. Some lie bedridden for years, able to rise only briefly; others swell in the face and head, living yet as if dead. Some feel no illness at all, only to die suddenly and without warning. In men, wind is drawn in by their yang; in women, wind follows their blood. None fail to meet their end through wind.\n\nYet the world cannot cure this wind. They merely attack the interior with medicines—how can decoctions and drafts expel wind lodged in the Five Viscera, Six Bowels, four limbs, and hundred vessels? Even if one seeks treatment and the physician prescribes the wrong remedy—though he be versed in the *Nanjing* and *Suwen*, though he boast three generations of flawless cures—how could he dispel such deep-seated afflictions?\n\nI dwelled long on Mount Taibai, bearing illness for years. A thousand medicines were tried, yet none brought relief. Later, an old man bestowed upon me this elixir. After ingesting but five grains, my ailments gradually faded. I bowed my head to heaven, entreating him for the method. Only after he exacted an oath of secrecy did he deign to transmit it. Thus, I recorded it upon my person and stored it in the sacred chamber. Those who come upon it later must revere it. Do not transmit it lightly, lest you invite calamity upon yourself. Follow the method in refinement, and what fear is there that it will not work wonders?\n\nThe roasted medicine governs the calcined medicine; the calcined medicine governs the boiled medicine; the boiled medicine governs the raw medicine. The raw medicine activates the boiled medicine; the boiled medicine activates the raw medicine. The raw medicine activates the roasted medicine; the roasted medicine activates the calcined medicine. They restrain and activate one another in turn, with ruler and minister complete, father and son firmly established. Thereafter, yin and yang each find their proper course.\n\nYang medicines govern yin to draw forth yin; yin medicines govern yang to draw forth yang. Though this elixir cannot refine one into an immortal, those who obtain it need only ingest a mung bean’s worth to remain free of illness for the span of their allotted years. If one already suffers from wind afflictions or injuries to the limbs and joints—even if movement has been impossible for five or ten years—ingesting a single grain as prescribed will bring effect. For severe cases, no more than ten grains are needed.\n\nIf someone dies suddenly but their heart has not yet grown cold, take one grain of the elixir, mix it with vinegar, and rub it into the navel a thousand times or more. The warmth will gradually spread from the navel in all directions. Once the eyes open, administer another grain dissolved in warm vinegar, and the person will revive. For all wind-related illnesses, regardless of how long they have persisted, the elixir’s divine efficacy is beyond full description.\n\nEach pill is the size of a mustard seed. Dry them in the sun and store them. For the afflicted, regardless of how long the illness has endured, first administer half a tael of *Hongxue* (Red Snow) or *Tongzhong San* tea.\n\nIf the wind-stasis is severe, administer one tael of the elixir, wait a while, then follow with hot tea to induce the patient to purge two or three times. Afterward, prepare ginger and bean broth as prescribed, and administer one grain. Have another person use their warm hands to massage the afflicted area alternately. After a while, the heat will penetrate deeply, and the patient will feel as though a fiery substance moves through the flesh to the painful spot, whereupon the suffering will vanish immediately.\n\nFor those bedridden with wind-illness for a hundred or two hundred days—or even a year—after taking one grain, they will immediately be able to walk as if never afflicted. In the most severe cases, after each purging, administer one grain of the elixir, then wait three to five days before repeating the process: first purging with *Hongxue*, then taking the elixir. No more than ten to twenty grains should be taken daily until full recovery.\n\nFor those suffering from chronic injuries—where pain flares with overcast skies and movement is impossible—the elixir is especially effective, requiring only one or two grains. For those who take this medicine in abundance, after recovery, its power will settle beneath the sole of the foot—left for men, right for women. Whenever distress arises, simply focus the mind on the elixir, and its efficacy will respond at will.\n\nThis medicine’s divine potency defies mortal comprehension. Its method of preparation follows:\n\n- Twenty-four sheets of gold foil\n- One tael and one *fen* of *guangmingsha* (bright cinnabar), ground to a fine powder\n- Three *da fen* of realgar, washed in lye from burnt wheat stalks and boiled for three days, then ground to a fine powder\n- Three *da fen* of *shitingzhi* (stone garden fat), boiled in vinegar for three days, then ground to a fine powder\n- Three *da fen* each of the following, ground to a fine powder and used raw: ox bezoar, musk, *dounaoqi* (navel of a male musk deer), tiger bone, dragon’s teeth\n- Three *da fen* each of: *yangqishi* (actinolite), *cimaoshi* (magnetite), *zishiying* (amethyst), *zirantong* (pyrite), *changlishi* (longitudinal stone)\n- Five *da fen* each of: *yuanzhi* (polygala), *baji* (morinda), *xuanshen* (scrophularia), *wuta* (aconite), *xianlingpi* (epimedium)\n- Six *da fen* each of: *qingmuxiang* (saussurea), *roudoukou* (nutmeg), dried deer antler resembling dried persimmon, *rougui* (cinnamon)\n- Three *da fen* each of: *yanhusuo* (corydalis), *mulu* (chuanxiong)\n\nPlace the following four ingredients together in a jar, covered with gold foil (not sealed): sulfur, realgar, cinnabar, and pyrite. Heat with fire for three days, keeping the flame three inches from the jar to avoid excessive heat.\n\nPlace the following four ingredients together in another jar, also covered with gold foil: actinolite, magnetite, amethyst, and longitudinal stone. Bury half the jar in ash, leaving the mouth unsealed, and heat for three days. On the first day, keep the flame two inches from the jar; on the second, one inch; on the third, cluster the flame around the jar until it glows red-hot by nightfall, eliminating all fire toxicity.\n\nGrind ten taels of *zhongru* (stalactite) with a jade pestle for seven days until it becomes a fine powder. Place it in a silk pouch, tie it securely, and suspend it in a pot with two *dou* of water. Boil until one *dou* remains, then take three *ge* of this *zhongru* water to grind raw rhinoceros horn one thousand times. Set this water aside separately. When adding *zaojiaoren* (gleditsia seeds), grind them together with this water.\n\nBoil the remaining *zhongru* water with the five ingredients—*yuanzhi* and the others—adding five *da fen* of crushed *manjingzi* (vitex). Reduce the liquid to seven *sheng*, then strain and retain the decoction. Use this medicinal liquid to boil the four ingredients—*qingmuxiang* and the others—until four *sheng* remain, then strain. Further reduce this liquid to boil *banxia* (prepared pinellia, washed and crushed) and *danggui* (angelica, finely chopped), each one tael, until three *sheng* remain. Strain and clarify the liquid.\n\nCombine one *sheng* each of rehmannia juice, ash-free wine, and boy’s urine with the three *sheng* of medicinal liquid, totaling six *sheng*. Simmer in a clean vessel over gentle heat until reduced to one *sheng*. Add all the prepared mineral medicines, stirring continuously until the mixture resembles thin congee. Remove from heat and add the five raw medicinal powders—ox bezoar and the others—stirring thoroughly. Then add six *da fen* of *zaojiaoren* (gleditsia seeds, toasted and shelled, ground to powder) and two *fen* of *longnao* (borneol), ground to a fine powder in a mortar. Incorporate the rhinoceros horn juice and grind the entire mixture in a mortar with a strong man for three thousand strokes until extremely thick. Form into pills the size of mustard seeds, ensuring they are not too large.\n\nThis medicine’s transformative efficacy is unparalleled. After preparation, divide it into three equal portions arranged like the character *pin* (品). Each portion is taken as one dose.\n\nAdditionally, refine one tael of *mangxiao* (mirabilite) into *poguan dan* (Breaking-the-Coffin Elixir). Use the finest Sichuan mirabilite, which has sharp, crystalline edges. Heat it in a crucible until all moisture evaporates, then grind to a powder and incorporate into the medicine.\n\nFor sudden death, regardless of the condition, if the limbs have not yet stiffened, break open the coffin, pry open the teeth, and drip one grain dissolved in hot vinegar. If it passes the throat, revival is nearly certain, with eight or nine out of ten saved. The pills should be the size of mung beans; the rest of the medicine follows the verses.\n\n*Sulfur and cinnabar rest atop copper*—the first four mineral medicines are placed in the jar in this order and heated as prescribed.\n*Magnetite, actinolite, longitudinal stone, and amethyst lead the way*—the latter four mineral medicines are placed in the jar in this order and heated as prescribed.\n*Gold above, below, and twice in the center*—when calcining the medicines, use gold foil: three sheets above, three below, and two in the center to separate the minerals.\n*Purple burns, copper roasts, each for a day’s rest*—if using amethyst, heat the jar; if using pyrite, roast the jar, each for one day only.\n*Boil the stalactite with four or five, uniting them as one*—\"boil\" here means decoct. Use stalactite to decoct the previous twenty ingredients in two *dou* of water until one *dou* remains, thus uniting them.\n\nTo refine once more requires eleven transformations.\nTake the one *dou* of stalactite decoction prepared earlier and decoct eleven herbal medicines—hence the term \"eleven transformations.\"\nBoil until reduced to three *sheng*, then remove.\nBlend with rehmannia, boy’s urine, and wine—these three ingredients.\nWhen the fiery stones return to the tranquil chamber, the fire is withdrawn and the mineral medicines added.\nWait until the texture resembles flesh and the five fresh ingredients—ox bezoar and the five flavors—are incorporated.\nStore separately in a vessel holding three *ge* of water, and grind with a rhinoceros horn, turning it a thousand times externally.\n\n**Method for Purple-Gold Cinnabar**\nTake half a *jin* of finest cinnabar (shimmering like dawn silk), three *liang* of azurite, and two *liang* of realgar and orpiment. Using an iron key, crush all into pieces the size of soap beans.\nSelect a jar with a capacity of one *sheng*, place the three ingredients inside, and boil with salt-bitter water for twenty-one days, maintaining a gentle simmer like fish eyes—ensure it does not overflow.\nRemove one grain of cinnabar, wash with water, and examine in the light: if it appears golden, cease boiling. If red or black halos remain, boil for another seven days. Remove, dry, and heat over fire to expel yin-blackness, then store in a cabinet.\nTake two *jin* of mirabilite flowers and one *liang* of nitre. Melt in a jar, pulverize, and melt again, then grind into fine powder. Pack into a cabinet, first layering with realgar and orpiment, then filling with salt powder to within three *fen* of the rim. Seal with cloth, cover with a ground tile, and seal tightly with Six-One Mud, ensuring no gaps.\nFire with four *liang* of heat for seven days.\nFire with six *liang* of heat for twenty-eight days.\nFire with half a *jin* of heat for fourteen days.\nFire with three *jin* of heat to calcine.\nOnce cooled, steep in cow’s milk contained in a bamboo tube, steam with black soybean rice three times, then soak in cold spring water for three days. Remove the rice, steam again to expel yin-blackness.\nGrind finely, mix with paper mulberry juice to form pills the size of millet grains. Take three pills daily with wine to cure thirty-six types of wind-induced paralysis, tendon and bone wind-madness, wind-archer’s wind, kidney viscera wind-heat, poisonous wind, and all cold winds. Prolonged use transforms skin, flesh, and hair, prolongs life, lightens the body—its merits cannot be fully enumerated.\nTake four *liang* and place in the cabinet as before: first layer with realgar and orpiment, then alternate layers of calcined and raw cinnabar until all four *liang* of raw cinnabar are used. Top with calcined cinnabar, then realgar and orpiment, and cover with cabinet powder. Seal as before and nurture with fire for forty-nine days.\nUpon completion, repeat the process layer by layer, always using four *liang* as the base.\n\n**Method for Golden-Green Cinnabar to Transform Gold Millet**\nCures all winds, prolongs life, preserves youth, heals myriad diseases, and transmutes treasures.\nFirst, mold a clay ball using red lead, white clay, tile powder, mirabilite, and vinegar-soaked wax as the core—ensure no cracks. Dry in shade, pierce a hole, remove the wax, and fire.\nTake fine, luminous cinnabar, grind to powder, and pack into a paper tube to fill the ball. Knead earthworm-mixed clay with the ball’s mud until pliable, then seal the hole. Dry, then fit with an iron ring and place in an iron crucible. Pour molten lead into the crucible, leaving two *cun* of space above. Nurture with chaff fire, keeping the lead soft.\nAfter one hundred twenty days, increase the fire, then remove. Quench on the ground, cool, and extract the medicine—it will resemble green-purple snail shells. Discard black residue.\nDivide the medicine in half: store one portion in a green bamboo tube, steam with cow’s milk five times, changing the milk thrice (the milk skin can treat *jianzeng*). Remove, bury in a pit for three nights.\nGrind finely, mix with millet rice to form pills the size of millet grains.\nFor those aged forty: one pill daily.\nFor those aged fifty: two pills daily.\nFor those aged sixty: three pills daily.\nIts potency is unique—do not exceed the dosage.\nGrind the remaining medicine into fine powder. In a crucible, layer with one *liang* of fine yellow vitriol, covering top and bottom with cinnabar powder. Seal the lid, dry, then nurture in ash fire for forty-nine days. Fire intensely until cool, and all will transform into gold millet.\nTake one *shao* of mouse-tail silver (three *liang*), and half a *fen* of true *geng* metal. First melt the silver in a crucible, then add three or four grains of millet—they will transmute into true metal, the true Western essence.\nFor the furnace, use three *da liang* of fire. Place the ball in the lead crucible, adjusting size as needed. Position the ball with its hole facing upward within the lead crucible.\nAll procedures must be timed precisely.\n\n**Method for Feather-Transformation River Chariot**\nTake four *liang* of luminous cinnabar, crush into pieces the size of soap beans.\nTake half a *liang* of Gua Prefecture yellow vitriol.\nMix the above with three-year-old rice vinegar, grinding into a paste. Coat the cinnabar pieces one by one, then dry.\nTake half a *liang* of top-grade Western *geng* metal, hammer into thin sheets, cut into small pieces, and wrap the cinnabar.\nThen take one *liang* each of Wu Du’s finest realgar and azurite, grind finely, and boil with left-flavor decoction until viscous. Shape the realgar-azurite powder into small cakes, wrap the cinnabar, dry, then coat with spirit-vinegar clay. Wrap once more, then set aside to dry.\nUse true lead to make a cabinet, arranging the lead *ba* with method.\nFire three times, each time grinding and sifting as prescribed.\n\nTake six *liang* of lead-silver and hammer into a lidded container. The joint where the lid meets the body must be recessed two *cun* and four *fen* deep, with the upper opening one *cun* and two *fen* in both depth and width. Line the bottom of the container with true lead to a thickness of two *fen*, then arrange the cinnabar grains like lotus seeds. Cover with another layer of true lead, then add more cinnabar, repeating the layers until all is used. Seal the container with true lead, then secure it with a silver clamp. Seal tightly with Six-One Clay and set aside to dry.\n\nTake five *jin* of *guan* salt, refine twice with saltpeter, then grind and sift finely. Select an iron crucible large enough to hold the previous container with some space. Pack the *guan* salt into the crucible, embedding the container within it to serve as the outer cabinet. Fill the gaps with salt, seal the lid, and secure it with iron rods. Set aside to dry.\n\nDig an earthen furnace one *chi* and six *cun* deep, one *chi* and four *cun* wide. Fire with horse dung and chaff for forty-nine days. Open the crucible, remove the inner cabinet with iron rods, and observe: if the silver container has turned golden, cease firing and retrieve it. If not, continue firing for another seven days before opening. Once cool, pry open the container and scrape off the yellow vitriol and azurite, reserving one grain. Grind finely, then take two *liang* of mercury in a pan and gently heat the medicine until it forms pellets the size of half a small bean. Sprinkle these onto the mercury, which will then dry and forge into a treasure. Guard this well and do not use it lightly—this is the First Transformation.\n\nTake twelve *liang* of luminous cinnabar, grind to powder, and mix with the previously refined cinnabar. As before, knead into a paste with fine vinegar and place into the inner cabinet. Grind and sift finely, then pack into the cabinet. Line the bottom with the previously scraped yellow vitriol, ground finely, then place the cinnabar paste inside. Seal the lid, fill the gaps with cabinet powder, and seal as before. Set aside to dry, then place into the crucible. Prepare another clay furnace, add half a *jin* of grass ash, and nurture with fire for one hundred and twenty days. Finally, apply intense fire to refine. Retrieve the medicine, which should now resemble top-grade Western metal—this is the Second Transformation, the Purple Gold River Chariot.\n\nIf intending to ingest it, first detoxify by soaking in cold spring water for a month, then steam with milk and form into pills with paper mulberry juice, each the size of a millet grain. This prolongs life and cures all diseases; take no more than one pill daily. If one consumes a full *liang* with sincere devotion, one’s lifespan will extend five *jiazi* cycles. This method is sacred and must not be disclosed. If recklessly shared with the unworthy, misfortune will befall the transgressor.\n\nTake one *jin* of luminous cinnabar, grind finely, and mix with left-flavor decoction. Select a crucible large enough to hold the medicine, then pack the mixed cinnabar into an outer cabinet. Grind the previously refined cinnabar, mix with vinegar into a clay, and line the inner cabinet. Once dry, add eight *liang* of mercury and two *liang* of fire. Place into the furnace and nurture for one hundred and twenty days to form purple gold. Do not use this yet; first offer it to a sacred mountain, report to the Supreme Mystery, and inscribe your name in the Immortal Register. Store the divine chamber carefully. When needed, place it in ash with six *liang* of mercury and two *liang* of fire. Nurture for one *fu* period, and it will become true top-grade Western metal—this is the Third Transformation, the Divine Chamber River Chariot.\n\n**Method for Golden Flower Yellow Sprouts**\nTake half a *jin* each of raw silver sprouts and raw mercury. Melt the sprouts and merge with the mercury to form a silver paste. If insufficient, add more wet silver to meet the original quantity. Select a high-quality oil bottle from Hunan, capable of holding two *jin*, and large enough to contain the medicine with extra space. Seal the bottle thoroughly, ensuring the top remains flat for easy inversion. Prepare a second, slightly larger bottle to serve as the outer cabinet, leaving it unsealed and temporarily covered.\n\nPlace the bottle on three nails, then construct a furnace with three sections, symbolizing the Three Powers. In the middle layer, install three nails horizontally, and include two doors: a larger front door four *cun* high, and a smaller rear door one and a half *cun* high. The lower fire chamber should be three sections long, each four *cun*, and always covered with ash. When adding fire, place charcoal at the center; charcoal briquettes work best.\n\nBegin firing in the eleventh month, continuing for ten months. For the first sixty days, use martial fire, slightly stronger than usual. Cover the furnace with a basin, leaving a star-shaped opening about one *cun* wide. From midnight, keep the medicine bottle’s top facing upward. At noon, invert it so the top faces downward, then return it to the original position by midnight. Rotate only the inner bottle, leaving the outer one stationary. After each rotation, recover the furnace.\n\nThe upper layer of the furnace should resemble a rice cooker, with the star-shaped opening. From midnight, cover it with a piece of paper, removing it at the appointed time. If the fire timing is precise and unerring, each day and night will form one seal. By the fifth month, weigh the contents: if mercury is lacking, replenish to the required amount. Once the medicine solidifies into a single mass, it has taken form. Break the bottle, retrieve the medicine, grind, wash, and refine until fine. Dry thoroughly in the sun.\n\nAdd new mercury, one-third the amount of the medicine, and press it evenly into the paste. Do not seal; follow the previous fire regimen and nurture for a full month. Retrieve, wash, and dry, then continue nurturing as before. After ten months, the medicine will develop cinnabar spots—this is the essence of the medicine, emerging from the mother’s womb, weighing about half a *jin* and appearing brown. It has now been refined by fire. Store in a separate vessel.\n\nAfter sixty days of martial fire, the medicine will turn a brilliant red. Remove the fire toxin, and it can be ingested to prolong life and enhance vitality—its virtues are beyond description. If the fire is too intense after ten months, the medicine may liquefy. Reduce the fire to restore its original state. Return the medicine’s mother to its former state, add half a *jin* of raw mercury, and nurture for another month. The surface will again turn brown. Continue nurturing for a full year.\n\nGather the aforementioned medicine to create worldly wealth—it has been refined by fire and appears a lustrous white. If one seeks worldly profit, mercury may be added month by month. Should mercury be added nine times, nurturing it to a full *jin*, the medicine becomes wondrous, granting eternal existence in the world while curing all ailments. This is the Nine-Cauldron Elixir, its power perfected for ascension. The *Cantong Qi* calls it \"Golden Flower,\" and some refer to it as the External Elixir. This is a most secret formula, known only to one or two on Mount Su; it must not be lightly disclosed.\n\nMaster Ji’s White Method:\nThe Most High, pitying the struggles of scholars and the unmet aspirations of superior men, set forth this teaching to aid practitioners, thus revealing this formula.\n\n- White Tiger: thirty *liang*\n- Supreme Yin Mysterious Essence: twelve *liang*\n- Alum: twelve *liang*\n- Lead Powder: eight *liang*\n\nGrind the above three ingredients into powder and blend with the left-hand flavor to form a paste. First, mold eight *liang* of wax into the shape of a parrot. Then coat the wax parrot entirely with the medicinal paste. Apply sweet clay over the paste, ensuring full coverage, and make the layer about half a *cun* thick. Open a small hole the size of a bean at the top. Dry it in the sun, then burn away the wax with fire. Place the aforementioned Black Warrior into the hole, sealing it again with the medicinal paste. Proceed with gentle fire and refine for sixty-three days. The Black Warrior will dry completely, its color resembling silver—this is called Silver Essence.\n\nTake one *liang* of this refined essence and add it to one *jin* of wrought copper, which will dissolve entirely into paste—this is the method of subduing. If the medicinal substances are not refined by fire, they will disrupt the order of copper and iron, failing to achieve mastery.\n\nMaster Ba’s name is Ji, and \"White\" is another designation for the Black Warrior. Subdued substances can be incorporated—yet they are unsuitable for ingestion. Why is this?\n\nThis is the method of transformation, not the true gate of profound mystery. The \"Ji White\" refers to mercury and lead. The \"able to whiten\" denotes this transformation and subjugation—hence Master Ba is also called Master Ji White. There is also a method of boiling with oil and vinegar, detailed in another formula.\n\n**Nine-Turn Lead Refinement Method**\nTake ten *jin* of lead and one *jin* of mercury, melt them in a vessel over gentle fire, and skim off the black skin with an iron spoon until exhausted. Each time, pour it onto the ground, then return it to the vessel and melt again—repeat this nine times in total. Then add the mercury and heat vigorously until it turns the color of green sand; if it scatters, sprinkle it with vinegar and bran, and it will transform into green sand. Next, place it in an iron vessel with vinegar, pour the sand into the vinegar, and grind it thoroughly with an iron spoon. Boil it again with vinegar, then collect the lead yellow on a tile, let it dry, and mix it with the juice of yellow cow dung (or finely ground barley) to form balls the size of pigeon eggs or cakes. Dry them in the sun—one version says to dry them in the shade. Arrange them in a bellows furnace and blow to extract the lead essence, called Lead Elixir. Its nature is moist; further heat it in a vessel until fully cooked, its color turning entirely red. Then grind it again in vinegar until smooth, let it settle on a tile to dry, and heat it in a vessel until it turns purple. In another vessel, take one *sheng* of good wine and add two *liang* of red salt, mixing them well. Then add the purple elixir, stirring it into the wine until it crystallizes—this is called Nine-Return Lead. The \"nine\" denotes the elixir’s name: Nine-Turn Purple Lead Elixir.\n\n**Divine Transformation Gold Elixir Method**\n- *Ting* juice: three *liang*\n- Mountain pond rock salt: two *liang* (ground as fine as flour)\n- Fire-subdued northern sulfur: one *jin* (transparent, ground to powder)\n\nMix these three ingredients evenly. Take an iron box, grind fine ink with rice vinegar, and apply a thick coat inside the box three times; let it dry. Place the three ingredients inside, warm the box over gentle fire until the medicine melts into liquid, and the northern *ting* turns dark. Stop the fire and let it congeal. Then take four *liang* of saltpeter, grind it to powder, and press it firmly into the base of the box. Seal the base with dry paper, then secure the lid. Place the box in a crucible and seal it with method paste. The paste is made from crow’s-gate hematite (the color of a rooster’s comb), left-turning oyster shell, and red halloysite—each finely ground to powder—mixed with the juice of fire-subdued northern *ting*. Pound them in a mortar over a thousand times, then use this to seal the joints, ensuring firmness and density. Secure the crucible lid with an iron latch, making it tightly sealed. Let it dry in the shade.\n\nTake three *jin* or more of lead, melt it in a crucible, and use a small iron ladle to coat the base of the box evenly on all sides. Gradually pour more molten lead into the crucible until it reaches two *cun* above the box. Choose an auspicious day and begin firing at midnight during the *zi* hour, starting with six *liang* of fuel and increasing by one *liang* each day until sixty days are complete. Once the crucible cools, chip away the black lead, open the box, and retrieve the medicine—it will be truly golden in color. Grind it finely in a mortar.\n\n- Northern *ting* sand: three *liang* (white and bright)\n- Yellow wax: one and a half *fen* (melted into liquid and mixed evenly with the northern *ting*)\n\nForm this into a ball and wrap it in paper. Take one *dou* of slaked lime and place half in a jar, packing it tightly. Scoop out a hollow, place the northern *ting* inside, then cover it with the remaining slaked lime, packing it as before. Initially use three *jin* of fire to nurture it, gradually increasing to five or seven *jin*. After three *fu* periods, use ten *jin* of fire to heat it until red-hot. Once the fire subsides and it cools, remove it and place it in a raw silk bag. Dig a pit large enough to hold five to seven *sheng*, fill it with water, and place a fine porcelain bowl inside. Suspend the bag of northern *ting* over the bowl with a rod, then cover it with a tile basin, sealing the edges with wet earth to prevent air leaks. After three *fu* periods, it will dissolve into water. Mix this water with the aforementioned two ingredients.\n\n- Refined metal (*geng*): ten *liang*\n- Mercury: fifty *liang*\n\nStore these in a jar and keep them warm over fire. Heat the *geng* until red-hot, then add it to the mercury, stirring with a willow twig until fully dissolved. Add three *jin* of divine flowers and grind them with the gold paste until fine. Place them in a large cauldron, level the mixture, and cover the cauldron with a basin, sealing it with paste to ensure airtightness. Heat gently to allow the mercury to volatilize completely. Then rinse the divine flowers with boiling water until their flavor is gone. Dry the *geng* powder in the sun, grind it finely, and add it to the medicine.\n\n- Realgar: eight *liang* (the color of a rooster’s comb, ground to powder)\n- Orpiment: eight *liang* (transparent leaf-like, ground to powder)\n- Halite: four *liang* (ground to powder)\n- Gold powder: ten *liang*\n\nGrind these five ingredients to powder. Prepare another crucible, following the previous method: grind fine ink with rice vinegar and apply it evenly inside the box three times; let it dry. Place the medicine inside and warm the box over gentle fire until the medicine melts into liquid. Follow the previous method: add four *liang* of saltpeter, ground to powder, press it firmly into the base of the box, seal it with dry paper, then secure the lid and place it in the crucible. Seal the joints with method paste as before, secure the lid with an iron latch, and let it dry in the shade.\n\nFollowing the previous method, first take three *jin* of lead and melt it into liquid in a Yao vessel, then use an iron ladle to scoop and apply it evenly around the base of the box. Melt more lead and gradually fill the crucible until it reaches two *cun* above the box. As before, select an auspicious day and begin the fire at midnight during the *zi* hour. The firing regimen follows the previous method: start with six *liang*, increasing by one *liang* each day, until sixty days are complete.\n\nOnce the crucible and box have cooled, use an iron chisel to remove the black lead and retrieve the box. The medicine inside should have turned the color of purple gold. Grind one *fen* of it finely in a mortar, and it can transmute one *jin* of mercury into refined purple-gold. This is not of the mortal world but a secret transmission from the immortals. For those who seek to aid their Dao, know when to be content.\n\n**Mercury:** one *jin*\n**Medicine:** one *fen*\n\nPlace the medicine atop the mercury in a new iron pan, cover it with a tea bowl, and seal it properly. Set the pan over fire and listen carefully for the sound of dripping inside. Then immediately quench the pan in water. Repeat this process ten or more times until the mercury is subdued, resembling black lead sand. Transfer it to a crucible and melt it into refined purple-gold. The transformations possible with this method are too numerous to record in full.\n\n*The Secret Alchemical Instructions of the Numinous Treasure and the Perfected Ones concludes.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "灵宝众真丹诀 经名：灵宝众真丹诀。 撰人不详。 篇内提及『瓜州黄矾』，当出矜唐代。 内载炼服外丹法诀八种，一卷。 底本出处：《正统道藏》洞玄部玉诀类。 灵宝众真丹诀 还魂丹法并序 夫人生禀於五行，拘於五常，则为五味之所贼，八风之所攻。 爰自饮乳，至於耄年，莫不因风而丧命。 或多食而过饱，或失食而饥，或饮啜大多，或乾渴乏水，或食咸醋，或啜酸辛，或畏热当风，或恶寒亲火，或庭前看月，或树下乘冻，或刺损肌肤，或扑伤支体，或时餐燥药，或时啜水浆，或久绝屏帏，或日多施泄，自此风趋百窍，毒聚四肢，遂使手足不随，言词赛涩。 或痛钻骨髓，或痹袭皮肤，或痒甚虫螟，或顽如铁石，或多痰唾，健忘，好瞋，血脉不行，肉色乾瘦； 或久安床枕，起坐须臾； 或头面虚肿，虽活如死； 或总无疾苦，卒暴而亡。 男即熙引其风，女即 风随其血，未有不因风而丧命者也。 世人不能治其风，但以药攻其内，安有风在五脏六腑之中，四支百脉之问，而汤饮之类，曷能去乎。 假令相疾而医，用药乖误，虽《难经》、《素问》，三世十全，欲去沉绵，其可得也。 余久居太白，抱疾数年，万药皆施，略不能效。 后有一翁，遗余此药，服都五粒，疾乃徐除。 稽颗叩天，求其药法，然肯传授，为誓不轻。 余故录於身右，置诸灵室，后人得之者，宜敬之。 无或轻传，自贻殃咎。 但依法修炼，何虑不神。 夫炙药制烧药，烧药制煮药，煮药制生药，生药使煮药，煮药使生药，生药使炙药，炙药使烧药，递互相制，递互相使，君臣俱具，父子固全。 后遂得阴阳，各有其绪。 阳药制阴，以引其阴。 阴药制阳，而引其阳。 此药但不能制致神仙，得之者但服一豆许，则寿限之内，永无疾矣。 如己患风疾，及扑伤肢节，十年五年，运动不得者，但依法服之一粒，便效。 重者不过十粒。 有人卒亡者，但心头未冷，取药一粒，以醋调一粒，摩脐中一千余下，当从脐四面渐暖，待眼开后，热醋下一粒，入口即活。 但是风疾，不拘年月探远，神验，不能具载其功力。 每丸如芥子大，日曝令乾，收之。 凡疾人，不问年月远近。 先以红雪，或通中散茶，下半两。",
      "translated_text": "**The *Lingbao Zhongzhen Dan Jue* (Spiritual Treasure Methods of the Multitude of Perfected for Elixir Refinement)**\n\n**Title:** *Lingbao Zhongzhen Dan Jue* (Spiritual Treasure Methods of the Multitude of Perfected for Elixir Refinement)\n**Author:** Unknown. The text mentions \"Gua Prefecture yellow alum,\" suggesting a Tang dynasty origin. It records eight methods for refining and ingesting external elixirs, contained in one scroll.\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongxuan* Section, Jade Instructions Category.\n\n---\n\n### **Method for the Elixir of Returned Soul, with Preface**\n\nMan is endowed by the Five Phases and constrained by the Five Constants, thus becoming prey to the Five Flavors and assailed by the Eight Winds. From the moment of suckling milk to the decrepitude of old age, none escape death by wind. Some perish from overindulgence in food, others from hunger; some from excessive drink, others from parched thirst. Some consume salty or sour flavors, others sip pungent or acrid brews. Some, fearing heat, stand in drafts; others, loathing cold, draw near to fire. Some gaze at the moon in the courtyard; others rest beneath trees in the frost. Some suffer cuts to the flesh; others endure bruises to their limbs. Some ingest desiccating medicines; others guzzle cold water. Some abstain too long from the bedchamber; others expend their essence in excess. Thus, wind rushes into the hundred apertures, and poison gathers in the four limbs, causing hands and feet to falter, speech to falter and slur.\n\nSome endure pain that bores into the marrow; others suffer numbness that creeps over the skin. Some itch as if infested by worms; others grow rigid as iron or stone. Some cough up copious phlegm, forget easily, rage often, their blood and vessels stagnant, their flesh withered and dry. Some lie bedridden for years, able to rise only briefly; others swell in the face and head, living yet as if dead. Some feel no illness at all, only to die suddenly and without warning. In men, wind is drawn in by their yang; in women, wind follows their blood. None fail to meet their end through wind.\n\nYet the world cannot cure this wind. They merely attack the interior with medicines—how can decoctions and drafts expel wind lodged in the Five Viscera, Six Bowels, four limbs, and hundred vessels? Even if one seeks treatment and the physician prescribes the wrong remedy—though he be versed in the *Nanjing* and *Suwen*, though he boast three generations of flawless cures—how could he dispel such deep-seated afflictions?\n\nI dwelled long on Mount Taibai, bearing illness for years. A thousand medicines were tried, yet none brought relief. Later, an old man bestowed upon me this elixir. After ingesting but five grains, my ailments gradually faded. I bowed my head to heaven, entreating him for the method. Only after he exacted an oath of secrecy did he deign to transmit it. Thus, I recorded it upon my person and stored it in the sacred chamber. Those who come upon it later must revere it. Do not transmit it lightly, lest you invite calamity upon yourself. Follow the method in refinement, and what fear is there that it will not work wonders?\n\nThe roasted medicine governs the calcined medicine; the calcined medicine governs the boiled medicine; the boiled medicine governs the raw medicine. The raw medicine activates the boiled medicine; the boiled medicine activates the raw medicine. The raw medicine activates the roasted medicine; the roasted medicine activates the calcined medicine. They restrain and activate one another in turn, with ruler and minister complete, father and son firmly established. Thereafter, yin and yang each find their proper course.\n\nYang medicines govern yin to draw forth yin; yin medicines govern yang to draw forth yang. Though this elixir cannot refine one into an immortal, those who obtain it need only ingest a mung bean’s worth to remain free of illness for the span of their allotted years. If one already suffers from wind afflictions or injuries to the limbs and joints—even if movement has been impossible for five or ten years—ingesting a single grain as prescribed will bring effect. For severe cases, no more than ten grains are needed.\n\nIf someone dies suddenly but their heart has not yet grown cold, take one grain of the elixir, mix it with vinegar, and rub it into the navel a thousand times or more. The warmth will gradually spread from the navel in all directions. Once the eyes open, administer another grain dissolved in warm vinegar, and the person will revive. For all wind-related illnesses, regardless of how long they have persisted, the elixir’s divine efficacy is beyond full description.\n\nEach pill is the size of a mustard seed. Dry them in the sun and store them. For the afflicted, regardless of how long the illness has endured, first administer half a tael of *Hongxue* (Red Snow) or *Tongzhong San* tea.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 840,
      "start_sentence": 0,
      "end_sentence": 36,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.792382955551147,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\灵宝众真丹诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "如或风涩甚者，即服一两，良久，以热茶投之，令患病人泻三两行，依法泼姜豆汤，下一粒，当以他人热手，更互摩之患处，良久热彻，即当觉肉有物如火，走至痛处，所苦当时已失矣。 一二百日及一年内，风疾下床不得者，服一粒后，当时便可行步，一如不患人。 至重者，每服泻后，服药一粒，后歇三五日问，依前服红雪，先泻后服丹药，但每日服不过一二十粒，平复如故。 打扑伤损多年者，天阴即疼痛，动不得者，尤验，只可一两粒。 服此药多者，疾愈后，药力当伏脚心下，男左女右。 但有所苦，发心念药，随意则至。 此药神验，功效非智能测，其法如后。 金薄二＋四片　光明砂一两一分，研如面。 以祷麦灰汁煮三日淘取秤雄黄三大分，研如面，醋煮三日，淘取秤　石庭脂三大分，研如面，酒煮三日，淘取秤　牛黄　麝香　脰脑脐　虎骨龙齿已上各四大分，研如面，生用　阳起石　磁毛石　紫石英　自然铜　长理石已上各三大分　远志　巴戟　玄参　乌她　仙灵脾已上各五大分青木香　肉豆葱　鹿茸如乾柿者　肉桂已上各六大分延胡索木律各三大分 右将石流黄、雄黄、朱砂、自然铜四味，同入一瓶子，用金薄覆籍，不固口，以火炙三日，火常去瓶子三寸，不得甚热。 又将阳起石、磁毛石、紫石英、长理石四味，同入一瓶子内，以金薄覆籍，灰埋瓶子一半，歇口烧三日，第一日火去瓶子二寸，第二日火去瓶子一寸，第三日以火簇瓶子，至夜火煅通赤，无火毒。 右将锺乳十两，以玉础研七日，如面即住。 用熟绢袋子贮，系定头边，悬於锅中，煮以水二斗，煎取一斗，内取锺乳水，三合研生犀一千下，将此水别收贮。 候入皂荚仁时，同研用。 又将其余锺乳水，煎前远志等五味，仍加蔓荆子五大分，拍碎同煮，令水至七升，去滓用。 又取此药水，煎青木香等四味，至四升，去滓。 又取药汁煎半夏炙以扬洗了捏破。 当归细到。 二味，各一大两，煎至三升，去滓澄沘净。 又用地黄汁一升，无灰酒一升，童子小便一升，此三味与煎药汁三升，都许六升，於净器中，文武火养成煎，候至一升，即下诸般金石药，搅勿住手，待如稀粥，即去火，下牛黄等五味生药末，熟搅令极匀，即下皂荚仁炒其子，打取仁。 杵为末，秤取六大分。 龙脑二分，於盆内研如面，入药中。 并所研犀角汁，同入於乳钵中，令壮士研三千下，候极稠，丸如芥子大，不得大。 此药功效造化无殊。 又此药就后分为三大分，如品字，取一口即一分也。 又加炼了芒硝一大两，差为破棺丹芒硝，即上好蜀硝，有锋错者即得也。 於跳子内，火上炼令汁尽，取为末，入於药中。 或有暴亡，不问疾状，但肢体未变者，可破棺打齿，热醋滴下一粒。 过得咽喉即活，十救八九。 其丸如蒙豆大，余药并依歌诀。 流黄砂隔铜居上，即前四味石药依此次第入瓶中，依法用火炙。 磁起长排紫作头。 即后四味石药，依此次第入瓶中，依法用火烧。 金上下三中各二，煅前药，用金薄，上下各三片，中心各两片隔定石药。 紫烧铜炙满三休。 用紫石英者，瓶子即烧之。 用自然铜者。 瓶子即炙之。 各一日止。 乳烹四五同归一，烹即煎也。 用锺乳煎前二十味，以二斗水，煎至一斗，是归一也。",
      "translated_text": "If the wind-stasis is severe, administer one tael of the elixir, wait a while, then follow with hot tea to induce the patient to purge two or three times. Afterward, prepare ginger and bean broth as prescribed, and administer one grain. Have another person use their warm hands to massage the afflicted area alternately. After a while, the heat will penetrate deeply, and the patient will feel as though a fiery substance moves through the flesh to the painful spot, whereupon the suffering will vanish immediately.\n\nFor those bedridden with wind-illness for a hundred or two hundred days—or even a year—after taking one grain, they will immediately be able to walk as if never afflicted. In the most severe cases, after each purging, administer one grain of the elixir, then wait three to five days before repeating the process: first purging with *Hongxue*, then taking the elixir. No more than ten to twenty grains should be taken daily until full recovery.\n\nFor those suffering from chronic injuries—where pain flares with overcast skies and movement is impossible—the elixir is especially effective, requiring only one or two grains. For those who take this medicine in abundance, after recovery, its power will settle beneath the sole of the foot—left for men, right for women. Whenever distress arises, simply focus the mind on the elixir, and its efficacy will respond at will.\n\nThis medicine’s divine potency defies mortal comprehension. Its method of preparation follows:\n\n- Twenty-four sheets of gold foil\n- One tael and one *fen* of *guangmingsha* (bright cinnabar), ground to a fine powder\n- Three *da fen* of realgar, washed in lye from burnt wheat stalks and boiled for three days, then ground to a fine powder\n- Three *da fen* of *shitingzhi* (stone garden fat), boiled in vinegar for three days, then ground to a fine powder\n- Three *da fen* each of the following, ground to a fine powder and used raw: ox bezoar, musk, *dounaoqi* (navel of a male musk deer), tiger bone, dragon’s teeth\n- Three *da fen* each of: *yangqishi* (actinolite), *cimaoshi* (magnetite), *zishiying* (amethyst), *zirantong* (pyrite), *changlishi* (longitudinal stone)\n- Five *da fen* each of: *yuanzhi* (polygala), *baji* (morinda), *xuanshen* (scrophularia), *wuta* (aconite), *xianlingpi* (epimedium)\n- Six *da fen* each of: *qingmuxiang* (saussurea), *roudoukou* (nutmeg), dried deer antler resembling dried persimmon, *rougui* (cinnamon)\n- Three *da fen* each of: *yanhusuo* (corydalis), *mulu* (chuanxiong)\n\nPlace the following four ingredients together in a jar, covered with gold foil (not sealed): sulfur, realgar, cinnabar, and pyrite. Heat with fire for three days, keeping the flame three inches from the jar to avoid excessive heat.\n\nPlace the following four ingredients together in another jar, also covered with gold foil: actinolite, magnetite, amethyst, and longitudinal stone. Bury half the jar in ash, leaving the mouth unsealed, and heat for three days. On the first day, keep the flame two inches from the jar; on the second, one inch; on the third, cluster the flame around the jar until it glows red-hot by nightfall, eliminating all fire toxicity.\n\nGrind ten taels of *zhongru* (stalactite) with a jade pestle for seven days until it becomes a fine powder. Place it in a silk pouch, tie it securely, and suspend it in a pot with two *dou* of water. Boil until one *dou* remains, then take three *ge* of this *zhongru* water to grind raw rhinoceros horn one thousand times. Set this water aside separately. When adding *zaojiaoren* (gleditsia seeds), grind them together with this water.\n\nBoil the remaining *zhongru* water with the five ingredients—*yuanzhi* and the others—adding five *da fen* of crushed *manjingzi* (vitex). Reduce the liquid to seven *sheng*, then strain and retain the decoction. Use this medicinal liquid to boil the four ingredients—*qingmuxiang* and the others—until four *sheng* remain, then strain. Further reduce this liquid to boil *banxia* (prepared pinellia, washed and crushed) and *danggui* (angelica, finely chopped), each one tael, until three *sheng* remain. Strain and clarify the liquid.\n\nCombine one *sheng* each of rehmannia juice, ash-free wine, and boy’s urine with the three *sheng* of medicinal liquid, totaling six *sheng*. Simmer in a clean vessel over gentle heat until reduced to one *sheng*. Add all the prepared mineral medicines, stirring continuously until the mixture resembles thin congee. Remove from heat and add the five raw medicinal powders—ox bezoar and the others—stirring thoroughly. Then add six *da fen* of *zaojiaoren* (gleditsia seeds, toasted and shelled, ground to powder) and two *fen* of *longnao* (borneol), ground to a fine powder in a mortar. Incorporate the rhinoceros horn juice and grind the entire mixture in a mortar with a strong man for three thousand strokes until extremely thick. Form into pills the size of mustard seeds, ensuring they are not too large.\n\nThis medicine’s transformative efficacy is unparalleled. After preparation, divide it into three equal portions arranged like the character *pin* (品). Each portion is taken as one dose.\n\nAdditionally, refine one tael of *mangxiao* (mirabilite) into *poguan dan* (Breaking-the-Coffin Elixir). Use the finest Sichuan mirabilite, which has sharp, crystalline edges. Heat it in a crucible until all moisture evaporates, then grind to a powder and incorporate into the medicine.\n\nFor sudden death, regardless of the condition, if the limbs have not yet stiffened, break open the coffin, pry open the teeth, and drip one grain dissolved in hot vinegar. If it passes the throat, revival is nearly certain, with eight or nine out of ten saved. The pills should be the size of mung beans; the rest of the medicine follows the verses.\n\n*Sulfur and cinnabar rest atop copper*—the first four mineral medicines are placed in the jar in this order and heated as prescribed.\n*Magnetite, actinolite, longitudinal stone, and amethyst lead the way*—the latter four mineral medicines are placed in the jar in this order and heated as prescribed.\n*Gold above, below, and twice in the center*—when calcining the medicines, use gold foil: three sheets above, three below, and two in the center to separate the minerals.\n*Purple burns, copper roasts, each for a day’s rest*—if using amethyst, heat the jar; if using pyrite, roast the jar, each for one day only.\n*Boil the stalactite with four or five, uniting them as one*—\"boil\" here means decoct. Use stalactite to decoct the previous twenty ingredients in two *dou* of water until one *dou* remains, thus uniting them.",
      "overlap_context": "ally spread from the navel in all directions. Once the eyes open, administer another grain dissolved in warm vinegar, and the person will revive. For all wind-related illnesses, regardless of how long they have persisted, the elixir’s divine efficacy is beyond full description.\n\nEach pill is the size of a mustard seed. Dry them in the sun and store them. For the afflicted, regardless of how long the illness has endured, first administer half a tael of *Hongxue* (Red Snow) or *Tongzhong San* tea.",
      "start_char": 840,
      "end_char": 2067,
      "start_sentence": 37,
      "end_sentence": 77,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.63139772415161,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\灵宝众真丹诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "取一仍须十一修。 再将前煎者锺乳水一斗，煎草药十一味，故云十一修也。 煎到三时还要出，即煎至三升也。 地和童酒一时句。 地黄、童子小便，酒三味是也。 若火石归安静室，是去火入石药也。 待如肌肉五生稠。 肌肉和入体也，五生即牛黄五味是也。 别盛三合中问水，外边千下转犀牛。 此即用锺乳水磨犀也。 紫金丹砂法 上好辰锦光明砂半斤　曾青三两　叶子雄雌黄二两右已上并用铁钥匙，打如皂荚子大。 取一瓶子可受一升者，以三般物，以盐胆煮之三七日，常如鱼眼沸，不得令溢。 取一颗砂出，以水洗，向明看之，如金色即止。 如有赤黑晕，更煮七日，将出待乾，更於火上，炕出阴黑了，入柜。 盥花二斤　硝石一两 右已上於瓶中烧成汁了，捣碎，更烧了，细为末，筑成柜了，即下曾雌一重了，以盐末填筑平，去口三分已来，封之以布，磨瓦子盖头，用六一泥固济，泯抹令断缝。 讫以四两火，养七日。 六两火，养四七日。 半斤火，养二七日。 三斤火煅。 待玲出，以黄牛乳，於竹筒盛，用黑豆饭蒸三遍，入寒泉三日，更去饭上，蒸出阴黑。 细研，以楮汁为丸，丸如黍米大。 每日三丸，酒下，治三十六种风偏，治筋骨风狂，风角弓风，肾藏风热，毒风，一切冷风并消。 久服肌肤毛发皆变，延年益寿，身轻，其功不能备录。 只可取四两，依前入柜，先布曾雌，即以熟砂、生砂层层铺尽，四两生砂了，以熟砂，次曾雌，即以柜末盖之，依前固济，养火四十九日。 毕，重重依此，长以四两，将为母也。 金碧丹砂变金粟子法 治一切风，延龄驻颜，治万病，兼化宝。 法曰：先将泥球子，泥用黄丹、白土、瓦末、盥、醋没，用蜡为胎，不得令有微隙。 阴乾，傍边安孔，去蜡更烧过。 即取好光明砂，研捣为末，以纸卷灌入了，以一大蚯蚓和球子泥，捣泥令烂，却固济孔子。 待乾，更打一铁环子，安於铁鼎子中安置，镕铅汁入鼎中，其上可二寸已来。 即以糠火养，长令铅软为候。 如此一百二十日，加火，取出。 更於地上，以火断过，候玲出之，其药如青紫螺子，拣取黑末不中。 分药一半，以青内筒贮，用牛乳蒸五遍，三度换乳，乳皮堪疗奸赠。 取出，入地坑子中，三宿。 细研，以粟米饭为丸，丸如粟米大。 年四十，日一丸。 年五十，日二丸。 年六十，日三丸。 其功力更别，不得多服。 治一切风，延龄驻颜，治黑益颜色。 余者细末，於甘锅中，用好黄矾一两，以砂末上下布盖，固济头乾了，灰火中养四十九日。 以大火缎，候玲开，皆成金粟子。 取鼠尾一写，输三两，用半分真庚者，先於甘锅内镕引输，乃下三四粒子粟，便化为真，真西方也。 炉长用火三大两，将此去鼎中盛球子，一切临时，取球子大小，其球孔头向上，安在铅鼎之中。 羽化河车法 光明砂四两，栋取如皂荚子大  瓜州黄矾半两 右已上，取三年米醋拌细，研如泥，将用一一裹其朱砂，待乾。 别取上色西方庚半两，打作薄，剪作小片子，更裹砂了。 然后取武都上色雄黄一两，曾青一两，细研，以左味煎似胶调，将雄青末捻成小饼子，将裹前砂，待乾，捣灵醋为胶泥，更裹一重总了，直放待乾。 用真铅为柜，排铅8lJ 有法。 更烧三遍，三遍须捣筛如法。",
      "translated_text": "To refine once more requires eleven transformations.\nTake the one *dou* of stalactite decoction prepared earlier and decoct eleven herbal medicines—hence the term \"eleven transformations.\"\nBoil until reduced to three *sheng*, then remove.\nBlend with rehmannia, boy’s urine, and wine—these three ingredients.\nWhen the fiery stones return to the tranquil chamber, the fire is withdrawn and the mineral medicines added.\nWait until the texture resembles flesh and the five fresh ingredients—ox bezoar and the five flavors—are incorporated.\nStore separately in a vessel holding three *ge* of water, and grind with a rhinoceros horn, turning it a thousand times externally.\n\n**Method for Purple-Gold Cinnabar**\nTake half a *jin* of finest cinnabar (shimmering like dawn silk), three *liang* of azurite, and two *liang* of realgar and orpiment. Using an iron key, crush all into pieces the size of soap beans.\nSelect a jar with a capacity of one *sheng*, place the three ingredients inside, and boil with salt-bitter water for twenty-one days, maintaining a gentle simmer like fish eyes—ensure it does not overflow.\nRemove one grain of cinnabar, wash with water, and examine in the light: if it appears golden, cease boiling. If red or black halos remain, boil for another seven days. Remove, dry, and heat over fire to expel yin-blackness, then store in a cabinet.\nTake two *jin* of mirabilite flowers and one *liang* of nitre. Melt in a jar, pulverize, and melt again, then grind into fine powder. Pack into a cabinet, first layering with realgar and orpiment, then filling with salt powder to within three *fen* of the rim. Seal with cloth, cover with a ground tile, and seal tightly with Six-One Mud, ensuring no gaps.\nFire with four *liang* of heat for seven days.\nFire with six *liang* of heat for twenty-eight days.\nFire with half a *jin* of heat for fourteen days.\nFire with three *jin* of heat to calcine.\nOnce cooled, steep in cow’s milk contained in a bamboo tube, steam with black soybean rice three times, then soak in cold spring water for three days. Remove the rice, steam again to expel yin-blackness.\nGrind finely, mix with paper mulberry juice to form pills the size of millet grains. Take three pills daily with wine to cure thirty-six types of wind-induced paralysis, tendon and bone wind-madness, wind-archer’s wind, kidney viscera wind-heat, poisonous wind, and all cold winds. Prolonged use transforms skin, flesh, and hair, prolongs life, lightens the body—its merits cannot be fully enumerated.\nTake four *liang* and place in the cabinet as before: first layer with realgar and orpiment, then alternate layers of calcined and raw cinnabar until all four *liang* of raw cinnabar are used. Top with calcined cinnabar, then realgar and orpiment, and cover with cabinet powder. Seal as before and nurture with fire for forty-nine days.\nUpon completion, repeat the process layer by layer, always using four *liang* as the base.\n\n**Method for Golden-Green Cinnabar to Transform Gold Millet**\nCures all winds, prolongs life, preserves youth, heals myriad diseases, and transmutes treasures.\nFirst, mold a clay ball using red lead, white clay, tile powder, mirabilite, and vinegar-soaked wax as the core—ensure no cracks. Dry in shade, pierce a hole, remove the wax, and fire.\nTake fine, luminous cinnabar, grind to powder, and pack into a paper tube to fill the ball. Knead earthworm-mixed clay with the ball’s mud until pliable, then seal the hole. Dry, then fit with an iron ring and place in an iron crucible. Pour molten lead into the crucible, leaving two *cun* of space above. Nurture with chaff fire, keeping the lead soft.\nAfter one hundred twenty days, increase the fire, then remove. Quench on the ground, cool, and extract the medicine—it will resemble green-purple snail shells. Discard black residue.\nDivide the medicine in half: store one portion in a green bamboo tube, steam with cow’s milk five times, changing the milk thrice (the milk skin can treat *jianzeng*). Remove, bury in a pit for three nights.\nGrind finely, mix with millet rice to form pills the size of millet grains.\nFor those aged forty: one pill daily.\nFor those aged fifty: two pills daily.\nFor those aged sixty: three pills daily.\nIts potency is unique—do not exceed the dosage.\nGrind the remaining medicine into fine powder. In a crucible, layer with one *liang* of fine yellow vitriol, covering top and bottom with cinnabar powder. Seal the lid, dry, then nurture in ash fire for forty-nine days. Fire intensely until cool, and all will transform into gold millet.\nTake one *shao* of mouse-tail silver (three *liang*), and half a *fen* of true *geng* metal. First melt the silver in a crucible, then add three or four grains of millet—they will transmute into true metal, the true Western essence.\nFor the furnace, use three *da liang* of fire. Place the ball in the lead crucible, adjusting size as needed. Position the ball with its hole facing upward within the lead crucible.\nAll procedures must be timed precisely.\n\n**Method for Feather-Transformation River Chariot**\nTake four *liang* of luminous cinnabar, crush into pieces the size of soap beans.\nTake half a *liang* of Gua Prefecture yellow vitriol.\nMix the above with three-year-old rice vinegar, grinding into a paste. Coat the cinnabar pieces one by one, then dry.\nTake half a *liang* of top-grade Western *geng* metal, hammer into thin sheets, cut into small pieces, and wrap the cinnabar.\nThen take one *liang* each of Wu Du’s finest realgar and azurite, grind finely, and boil with left-flavor decoction until viscous. Shape the realgar-azurite powder into small cakes, wrap the cinnabar, dry, then coat with spirit-vinegar clay. Wrap once more, then set aside to dry.\nUse true lead to make a cabinet, arranging the lead *ba* with method.\nFire three times, each time grinding and sifting as prescribed.",
      "overlap_context": "nd twice in the center*—when calcining the medicines, use gold foil: three sheets above, three below, and two in the center to separate the minerals.\n*Purple burns, copper roasts, each for a day’s rest*—if using amethyst, heat the jar; if using pyrite, roast the jar, each for one day only.\n*Boil the stalactite with four or five, uniting them as one*—\"boil\" here means decoct. Use stalactite to decoct the previous twenty ingredients in two *dou* of water until one *dou* remains, thus uniting them.",
      "start_char": 2067,
      "end_char": 3306,
      "start_sentence": 78,
      "end_sentence": 132,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.609986543655396,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\灵宝众真丹诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "取铅银六两，打作合子。 其合子须相受处口，拒深下二寸四分，深广上一寸二分，亦然。 即取真铅铺於合底，可二分，即排砂如莲子样，更以真铅盖，更铺砂，重重取尽了，即以真铅盖却取满合，却先打银束子束定，六一泥固济，待乾。 五斤盥，用硝石炼过两度了，细捣罗，取铁鼎可容得，前合稍宽者。 实其盥，捣於陷合处，是为外柜，以盐填持了盖却，铁筋贯定固济，待乾。 掘一地炉，深一尺六寸，阔一尺四寸，以马通火、糠火，烧四十九日。 开鼎，以铁筋拨盛柜，看银合柜变为金色，即去火取出。 如未，更烧七日取出，待玲开合，剥下黄矾及雄青，留着取一粒，细研，水银二两於铛中，微火取药，半小豆大，糁上便乾锻成宝。 且惜莫用，此为第一转。 别取光明砂十二两，研碎，和前伏火砂同研。 依前用好醋煎搜成团，取前内柜。 细捣罗筑为柜。 即取前剥下黄矾，细研铺底了，安砂团，更以盖子上了，便着柜末填满，依前法固济，待乾入鼎，别泥炉，着草灰半斤，火养一百二十日，以大火煅，出炉取药，如前当成上色西方，此名第二转紫金河车。 若要伏食，出毒，入寒泉一月日，却以乳蒸，用楮汁为丸，丸如粟米大，延龄，治万病，每日服只可一丸。 若志心尽一两，寿年五甲子。 神秘不得，偶然轻泄，传无道之人，受其殃。 别取光明砂一斤，细研，以左味拌，取一甍鼎子可贮得药者，将拌砂筑成外柜，将前伏了砂，细研醋调泥柜内，乾了，着汞八两，以二两火，入炉养一百二十日，成紫金。 不宜用，先将投名山，告上玄，书名仙籍也。 其神室收取，要用时坐於灰中，着汞六两，用二两火。 养一伏时，真上色西方也。 此名第三转神室河车。 金华黄芽法 生银芽半斤　生汞半斤 右镕芽与汞相入，状若银膏。 如欠，将湿银添满本数，即取湖南通油瓶子上好者，受得二斤者，令贮得前药，令其裹面宽转，即通身固济之，令头平，使要返覆安之。 更取一瓶大於前者，可贮得上瓶，为外柜，不固济，权着物盖头。 即放三钉上，以诤泥用麻筋作炉，炉须三段作者，象三才。 中层着三钉横安，亦得下开二门，前后着二门，前面大门，高四寸。 后面小门，可一寸半。 其炉下火可三截，长四寸，常着灰盖上。 如进火时，但炭上安中心即得，用炭团更好。 其火还从十一月发火，如此可十月后，一年内须六十日武火，似大些些子。 其上须着一盆覆之，开一星露，可大一寸，从半夜子时，其药瓶顶向上，午后转上却下，至夜半依前转，转内瓶，外者不转。 转了更须覆盖。 炉上一层，其炉似饭形，其上星露，从半夜将片纸掩之，至时除之。 如是火候调顺，不失节度，即是昼夜各一封，至五月足，秤看欠添，汞满应数，成为一块，谓之成形。 即破瓶取之，捣研淘令细，水飞曝尽令乾。 更依前入新汞，可三分之一，按药令平，不用固济，依前火侯，养待一月满，更出淘洗毕，待乾，更养通前。 都满十月，其药上有点化朱砂，此是药精，出母胎上，可半斤，作褐色，已伏火也。 收取别器贮，六十日武火烧毕，出赤色奇绝，出火毒，服食可长年益寿，其药不可具论。 其火得十月足，火似大，便化作液。 更须缓火养，更得依旧，其药本母，依前生汞半斤，养一月，更出母面上，还似褐色，养可一年。",
      "translated_text": "Take six *liang* of lead-silver and hammer into a lidded container. The joint where the lid meets the body must be recessed two *cun* and four *fen* deep, with the upper opening one *cun* and two *fen* in both depth and width. Line the bottom of the container with true lead to a thickness of two *fen*, then arrange the cinnabar grains like lotus seeds. Cover with another layer of true lead, then add more cinnabar, repeating the layers until all is used. Seal the container with true lead, then secure it with a silver clamp. Seal tightly with Six-One Clay and set aside to dry.\n\nTake five *jin* of *guan* salt, refine twice with saltpeter, then grind and sift finely. Select an iron crucible large enough to hold the previous container with some space. Pack the *guan* salt into the crucible, embedding the container within it to serve as the outer cabinet. Fill the gaps with salt, seal the lid, and secure it with iron rods. Set aside to dry.\n\nDig an earthen furnace one *chi* and six *cun* deep, one *chi* and four *cun* wide. Fire with horse dung and chaff for forty-nine days. Open the crucible, remove the inner cabinet with iron rods, and observe: if the silver container has turned golden, cease firing and retrieve it. If not, continue firing for another seven days before opening. Once cool, pry open the container and scrape off the yellow vitriol and azurite, reserving one grain. Grind finely, then take two *liang* of mercury in a pan and gently heat the medicine until it forms pellets the size of half a small bean. Sprinkle these onto the mercury, which will then dry and forge into a treasure. Guard this well and do not use it lightly—this is the First Transformation.\n\nTake twelve *liang* of luminous cinnabar, grind to powder, and mix with the previously refined cinnabar. As before, knead into a paste with fine vinegar and place into the inner cabinet. Grind and sift finely, then pack into the cabinet. Line the bottom with the previously scraped yellow vitriol, ground finely, then place the cinnabar paste inside. Seal the lid, fill the gaps with cabinet powder, and seal as before. Set aside to dry, then place into the crucible. Prepare another clay furnace, add half a *jin* of grass ash, and nurture with fire for one hundred and twenty days. Finally, apply intense fire to refine. Retrieve the medicine, which should now resemble top-grade Western metal—this is the Second Transformation, the Purple Gold River Chariot.\n\nIf intending to ingest it, first detoxify by soaking in cold spring water for a month, then steam with milk and form into pills with paper mulberry juice, each the size of a millet grain. This prolongs life and cures all diseases; take no more than one pill daily. If one consumes a full *liang* with sincere devotion, one’s lifespan will extend five *jiazi* cycles. This method is sacred and must not be disclosed. If recklessly shared with the unworthy, misfortune will befall the transgressor.\n\nTake one *jin* of luminous cinnabar, grind finely, and mix with left-flavor decoction. Select a crucible large enough to hold the medicine, then pack the mixed cinnabar into an outer cabinet. Grind the previously refined cinnabar, mix with vinegar into a clay, and line the inner cabinet. Once dry, add eight *liang* of mercury and two *liang* of fire. Place into the furnace and nurture for one hundred and twenty days to form purple gold. Do not use this yet; first offer it to a sacred mountain, report to the Supreme Mystery, and inscribe your name in the Immortal Register. Store the divine chamber carefully. When needed, place it in ash with six *liang* of mercury and two *liang* of fire. Nurture for one *fu* period, and it will become true top-grade Western metal—this is the Third Transformation, the Divine Chamber River Chariot.\n\n**Method for Golden Flower Yellow Sprouts**\nTake half a *jin* each of raw silver sprouts and raw mercury. Melt the sprouts and merge with the mercury to form a silver paste. If insufficient, add more wet silver to meet the original quantity. Select a high-quality oil bottle from Hunan, capable of holding two *jin*, and large enough to contain the medicine with extra space. Seal the bottle thoroughly, ensuring the top remains flat for easy inversion. Prepare a second, slightly larger bottle to serve as the outer cabinet, leaving it unsealed and temporarily covered.\n\nPlace the bottle on three nails, then construct a furnace with three sections, symbolizing the Three Powers. In the middle layer, install three nails horizontally, and include two doors: a larger front door four *cun* high, and a smaller rear door one and a half *cun* high. The lower fire chamber should be three sections long, each four *cun*, and always covered with ash. When adding fire, place charcoal at the center; charcoal briquettes work best.\n\nBegin firing in the eleventh month, continuing for ten months. For the first sixty days, use martial fire, slightly stronger than usual. Cover the furnace with a basin, leaving a star-shaped opening about one *cun* wide. From midnight, keep the medicine bottle’s top facing upward. At noon, invert it so the top faces downward, then return it to the original position by midnight. Rotate only the inner bottle, leaving the outer one stationary. After each rotation, recover the furnace.\n\nThe upper layer of the furnace should resemble a rice cooker, with the star-shaped opening. From midnight, cover it with a piece of paper, removing it at the appointed time. If the fire timing is precise and unerring, each day and night will form one seal. By the fifth month, weigh the contents: if mercury is lacking, replenish to the required amount. Once the medicine solidifies into a single mass, it has taken form. Break the bottle, retrieve the medicine, grind, wash, and refine until fine. Dry thoroughly in the sun.\n\nAdd new mercury, one-third the amount of the medicine, and press it evenly into the paste. Do not seal; follow the previous fire regimen and nurture for a full month. Retrieve, wash, and dry, then continue nurturing as before. After ten months, the medicine will develop cinnabar spots—this is the essence of the medicine, emerging from the mother’s womb, weighing about half a *jin* and appearing brown. It has now been refined by fire. Store in a separate vessel.\n\nAfter sixty days of martial fire, the medicine will turn a brilliant red. Remove the fire toxin, and it can be ingested to prolong life and enhance vitality—its virtues are beyond description. If the fire is too intense after ten months, the medicine may liquefy. Reduce the fire to restore its original state. Return the medicine’s mother to its former state, add half a *jin* of raw mercury, and nurture for another month. The surface will again turn brown. Continue nurturing for a full year.",
      "overlap_context": " *geng* metal, hammer into thin sheets, cut into small pieces, and wrap the cinnabar.\nThen take one *liang* each of Wu Du’s finest realgar and azurite, grind finely, and boil with left-flavor decoction until viscous. Shape the realgar-azurite powder into small cakes, wrap the cinnabar, dry, then coat with spirit-vinegar clay. Wrap once more, then set aside to dry.\nUse true lead to make a cabinet, arranging the lead *ba* with method.\nFire three times, each time grinding and sifting as prescribed.",
      "start_char": 3306,
      "end_char": 4562,
      "start_sentence": 133,
      "end_sentence": 174,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.796653032302856,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\灵宝众真丹诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "收前件药，便作世利，伏火也，烂白。 如要世利，可月月添之。 若得九度添汞，养之一斤，神妙，与世长存，兼治万病。 云此是九鼎丹，功成上升。 《 参同契》 云是金华，曾云是外丹。 此甚秘诀，苏台一两人得之，不得轻泄耳。 几公白法 太上悯学士之困穷，上士之未遇，述之为号，以助术人，故显此方。 白虎三＋两　太阴玄精十二两　矾石十二两　胡粉八两 右三物捣研成粉，以左味和为泥。 先捏蜡八两，作鹦子形。 即以药泥涂蜡鹦子上，令遍。 以甘土泥药上，令周雨，泥令厚半寸许。 顶上开一小孔子，如豆颗许。 然后曝乾，火烧去蜡，安前 玄武於孔中，还以药泥固鹦子孔中，其还以药泥固，然后缓火，炼七九日，玄武俱乾，其色如银，此名银精。 取此伏精一两，入熟铜一斤，尽化为泥，名制伏之法。 若药物不伏火，入铜铁俱失纪纲，即不成制伏。 八公号几公，白者是玄武之别名。 伏了之物，能入也。 即不任服食者，何也。",
      "translated_text": "Gather the aforementioned medicine to create worldly wealth—it has been refined by fire and appears a lustrous white. If one seeks worldly profit, mercury may be added month by month. Should mercury be added nine times, nurturing it to a full *jin*, the medicine becomes wondrous, granting eternal existence in the world while curing all ailments. This is the Nine-Cauldron Elixir, its power perfected for ascension. The *Cantong Qi* calls it \"Golden Flower,\" and some refer to it as the External Elixir. This is a most secret formula, known only to one or two on Mount Su; it must not be lightly disclosed.\n\nMaster Ji’s White Method:\nThe Most High, pitying the struggles of scholars and the unmet aspirations of superior men, set forth this teaching to aid practitioners, thus revealing this formula.\n\n- White Tiger: thirty *liang*\n- Supreme Yin Mysterious Essence: twelve *liang*\n- Alum: twelve *liang*\n- Lead Powder: eight *liang*\n\nGrind the above three ingredients into powder and blend with the left-hand flavor to form a paste. First, mold eight *liang* of wax into the shape of a parrot. Then coat the wax parrot entirely with the medicinal paste. Apply sweet clay over the paste, ensuring full coverage, and make the layer about half a *cun* thick. Open a small hole the size of a bean at the top. Dry it in the sun, then burn away the wax with fire. Place the aforementioned Black Warrior into the hole, sealing it again with the medicinal paste. Proceed with gentle fire and refine for sixty-three days. The Black Warrior will dry completely, its color resembling silver—this is called Silver Essence.\n\nTake one *liang* of this refined essence and add it to one *jin* of wrought copper, which will dissolve entirely into paste—this is the method of subduing. If the medicinal substances are not refined by fire, they will disrupt the order of copper and iron, failing to achieve mastery.\n\nMaster Ba’s name is Ji, and \"White\" is another designation for the Black Warrior. Subdued substances can be incorporated—yet they are unsuitable for ingestion. Why is this?",
      "overlap_context": "el.\n\nAfter sixty days of martial fire, the medicine will turn a brilliant red. Remove the fire toxin, and it can be ingested to prolong life and enhance vitality—its virtues are beyond description. If the fire is too intense after ten months, the medicine may liquefy. Reduce the fire to restore its original state. Return the medicine’s mother to its former state, add half a *jin* of raw mercury, and nurture for another month. The surface will again turn brown. Continue nurturing for a full year.",
      "start_char": 4562,
      "end_char": 4946,
      "start_sentence": 175,
      "end_sentence": 195,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.68784236907959,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\灵宝众真丹诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "此是变转之法，非真玄妙之门。 几白者，是汞铅。 能白者，此变伏。 故八公号日几公白也。 更有油醋煮之法，具别方。 九转炼铅法 诀用铅十斤，汞一斤，以器微火镕之，用铁匙掠取其黑皮，直令尽。 每一遍倾在地上，复器中镕之，凡如此九遍讫。 即下汞，即用猛火熬作青砂色，如散即糠醋洒之，即变为青砂矣。 更於一铁器中成醋，倾砂醋中讫，用铁匙研令熟。 又醋烹添，取铅黄於瓦上，令乾，取黄牛粪汁，并小大麦缅亦得，和所熬青砂作团，如鹦子大，或作饼，日曝乾。 一本云：阴乾。 於燎炉火上，排鞘袋吹取铅精，名铅丹。 其性濡，更着器熬令至熟，其色尽赤，又出醋中研令至熟，澄着瓦上使乾，於器中熬令熟，紫色。 又别以一器，取好酒一升，下赤盐二两，和投酒中相得，即取紫色丹。 一时写着酒中，待玲出之，此即名九还铅。 九为丹名，日九转紫铅丹也。 神化金丹法 亭汁三两  山池石盐二两，亦研细如缅  伏火北硫黄一斤通明者，研如粉 右三味药，并同相和令匀。 便取铁合，用米醋研上好香墨，浓涂铁合内三遍，候乾。 便入此三味药於合内，以文火逼合令热，候药化为汁，出尽北亭阴黑，住火候凝玲。 便用硝石四两，细研如粉，入於合足内实按，上以枯纸封定，合足，候乾，方入於鼎内，用法泥固济。 其法泥用鸦门代赭，如鹦冠色者，左顾牡蛎、赤石脂等三味，各细捣研如粉，入伏火北亭汁，匀和，入臼内杵一千以来，方用固济相合，并足周回，唯务坚密为妙。 合鼎上用铁关关定，切在紧密。 候阴乾，便取铅三斤以来，於跳子镕化作汁，用小铁杓子抄於合足四面，候匀遍，又更消镕铅汁，渐渐灌於鼎内，直至鼎满合上二寸以来，便选成合日夜半子时起火，初六两，日加一两，至六十日满足。 候药鼎玲定，用小铁凿子凿去黑铅，开合取药，真如金色。 便入於乳钵内，细研如粉。 北亭砂三两白明者　以黄蜡一分半，镕作汁，拌北亭令匀 右作一团子，以纸裹。 炒风化石灰一斗，用一甍罐，先将一半风化入於罐内实筑，内剜一坑子，安北亭於内，上又将一半风化盖，准前实筑。 初用火三斤，以来养，渐渐加火至五七斤，三伏时一弄，十斤火煅通赤。 火尽候玲，取出，用生绢袋子内盛。 又掘一地坑子，可受五七升，满添水，候湿尽水，安一细甍碗於坑子内，上横一杖子，悬钓北亭袋子於碗上，更用一瓦盆子合盖，周回用湿土拥盆子，勿透黑，三伏时并化为水。 取此水，拌调前件二味药。 上好庚一十两　汞五十两 右贮於一罐内，常用火暖，将庚烧令赤，投於汞内，用柳篦搅，化尽为度，用灵花三斤，与金泥同研唯细，便入一大铛内，令匀平，上用勘一盆子盖铛，以泥固济，周回令密，慢慢火，却令汞飞上，以汞尽为度，次用煎汤沃盛花，候盥味尽为度。 其庚粉於盘内，日曝乾，后细研，入在药内。 雄黄八两，如鹦冠色者，研如粉　雌黄八两，通明叶子者，研如粉　戎盥四两，研如粉　金粉十两 右五味药，并细研如粉。 别换鼎，合一依前法，用米醋浓研香墨，匀涂合内三遍，乾后，入药於合内，还用文火逼合，令药作汁。 一依前法，用硝石四两，细研如粉，安在合足内实按，以缅枯纸封定合足，便固济合盖，入於鼎内，准前法泥固济合足，合上用铁关关定，候阴乾。",
      "translated_text": "This is the method of transformation, not the true gate of profound mystery. The \"Ji White\" refers to mercury and lead. The \"able to whiten\" denotes this transformation and subjugation—hence Master Ba is also called Master Ji White. There is also a method of boiling with oil and vinegar, detailed in another formula.\n\n**Nine-Turn Lead Refinement Method**\nTake ten *jin* of lead and one *jin* of mercury, melt them in a vessel over gentle fire, and skim off the black skin with an iron spoon until exhausted. Each time, pour it onto the ground, then return it to the vessel and melt again—repeat this nine times in total. Then add the mercury and heat vigorously until it turns the color of green sand; if it scatters, sprinkle it with vinegar and bran, and it will transform into green sand. Next, place it in an iron vessel with vinegar, pour the sand into the vinegar, and grind it thoroughly with an iron spoon. Boil it again with vinegar, then collect the lead yellow on a tile, let it dry, and mix it with the juice of yellow cow dung (or finely ground barley) to form balls the size of pigeon eggs or cakes. Dry them in the sun—one version says to dry them in the shade. Arrange them in a bellows furnace and blow to extract the lead essence, called Lead Elixir. Its nature is moist; further heat it in a vessel until fully cooked, its color turning entirely red. Then grind it again in vinegar until smooth, let it settle on a tile to dry, and heat it in a vessel until it turns purple. In another vessel, take one *sheng* of good wine and add two *liang* of red salt, mixing them well. Then add the purple elixir, stirring it into the wine until it crystallizes—this is called Nine-Return Lead. The \"nine\" denotes the elixir’s name: Nine-Turn Purple Lead Elixir.\n\n**Divine Transformation Gold Elixir Method**\n- *Ting* juice: three *liang*\n- Mountain pond rock salt: two *liang* (ground as fine as flour)\n- Fire-subdued northern sulfur: one *jin* (transparent, ground to powder)\n\nMix these three ingredients evenly. Take an iron box, grind fine ink with rice vinegar, and apply a thick coat inside the box three times; let it dry. Place the three ingredients inside, warm the box over gentle fire until the medicine melts into liquid, and the northern *ting* turns dark. Stop the fire and let it congeal. Then take four *liang* of saltpeter, grind it to powder, and press it firmly into the base of the box. Seal the base with dry paper, then secure the lid. Place the box in a crucible and seal it with method paste. The paste is made from crow’s-gate hematite (the color of a rooster’s comb), left-turning oyster shell, and red halloysite—each finely ground to powder—mixed with the juice of fire-subdued northern *ting*. Pound them in a mortar over a thousand times, then use this to seal the joints, ensuring firmness and density. Secure the crucible lid with an iron latch, making it tightly sealed. Let it dry in the shade.\n\nTake three *jin* or more of lead, melt it in a crucible, and use a small iron ladle to coat the base of the box evenly on all sides. Gradually pour more molten lead into the crucible until it reaches two *cun* above the box. Choose an auspicious day and begin firing at midnight during the *zi* hour, starting with six *liang* of fuel and increasing by one *liang* each day until sixty days are complete. Once the crucible cools, chip away the black lead, open the box, and retrieve the medicine—it will be truly golden in color. Grind it finely in a mortar.\n\n- Northern *ting* sand: three *liang* (white and bright)\n- Yellow wax: one and a half *fen* (melted into liquid and mixed evenly with the northern *ting*)\n\nForm this into a ball and wrap it in paper. Take one *dou* of slaked lime and place half in a jar, packing it tightly. Scoop out a hollow, place the northern *ting* inside, then cover it with the remaining slaked lime, packing it as before. Initially use three *jin* of fire to nurture it, gradually increasing to five or seven *jin*. After three *fu* periods, use ten *jin* of fire to heat it until red-hot. Once the fire subsides and it cools, remove it and place it in a raw silk bag. Dig a pit large enough to hold five to seven *sheng*, fill it with water, and place a fine porcelain bowl inside. Suspend the bag of northern *ting* over the bowl with a rod, then cover it with a tile basin, sealing the edges with wet earth to prevent air leaks. After three *fu* periods, it will dissolve into water. Mix this water with the aforementioned two ingredients.\n\n- Refined metal (*geng*): ten *liang*\n- Mercury: fifty *liang*\n\nStore these in a jar and keep them warm over fire. Heat the *geng* until red-hot, then add it to the mercury, stirring with a willow twig until fully dissolved. Add three *jin* of divine flowers and grind them with the gold paste until fine. Place them in a large cauldron, level the mixture, and cover the cauldron with a basin, sealing it with paste to ensure airtightness. Heat gently to allow the mercury to volatilize completely. Then rinse the divine flowers with boiling water until their flavor is gone. Dry the *geng* powder in the sun, grind it finely, and add it to the medicine.\n\n- Realgar: eight *liang* (the color of a rooster’s comb, ground to powder)\n- Orpiment: eight *liang* (transparent leaf-like, ground to powder)\n- Halite: four *liang* (ground to powder)\n- Gold powder: ten *liang*\n\nGrind these five ingredients to powder. Prepare another crucible, following the previous method: grind fine ink with rice vinegar and apply it evenly inside the box three times; let it dry. Place the medicine inside and warm the box over gentle fire until the medicine melts into liquid. Follow the previous method: add four *liang* of saltpeter, ground to powder, press it firmly into the base of the box, seal it with dry paper, then secure the lid and place it in the crucible. Seal the joints with method paste as before, secure the lid with an iron latch, and let it dry in the shade.",
      "overlap_context": "ng silver—this is called Silver Essence.\n\nTake one *liang* of this refined essence and add it to one *jin* of wrought copper, which will dissolve entirely into paste—this is the method of subduing. If the medicinal substances are not refined by fire, they will disrupt the order of copper and iron, failing to achieve mastery.\n\nMaster Ba’s name is Ji, and \"White\" is another designation for the Black Warrior. Subdued substances can be incorporated—yet they are unsuitable for ingestion. Why is this?",
      "start_char": 4946,
      "end_char": 6219,
      "start_sentence": 196,
      "end_sentence": 237,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.93826127052307,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\灵宝众真丹诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "一依前法，先取铅三斤，於姚子内镕作汁，以铁杓抄在合足四面相，次更镕铅汁，渐渐满鼎内、至合上二寸以来，一依前法，选成合日夜半子时起火，火候准前，初起六两，日加一两，至六十日满足。 候鼎合玲定，用铁凿去黑铅，取合，其药当作紫金色。 每一分於乳钵内细研，可制汞一斤，立成紫磨黄金。 此非人世所有，是神仙秘授，若於助道，须知足乎。 汞一斤　药一分 右於新铁跳子内，药置汞上，用茶碗子盖，固济如法，安跳子於火上，专听裹面滴滴声，即将跳子於水内淬底。 如此十数度，其汞已伏，炒如黑铅砂子，别入甘锅销轮，当为紫磨金。 其於变化，不可具载。 灵宝众真丹诀竟",
      "translated_text": "Following the previous method, first take three *jin* of lead and melt it into liquid in a Yao vessel, then use an iron ladle to scoop and apply it evenly around the base of the box. Melt more lead and gradually fill the crucible until it reaches two *cun* above the box. As before, select an auspicious day and begin the fire at midnight during the *zi* hour. The firing regimen follows the previous method: start with six *liang*, increasing by one *liang* each day, until sixty days are complete.\n\nOnce the crucible and box have cooled, use an iron chisel to remove the black lead and retrieve the box. The medicine inside should have turned the color of purple gold. Grind one *fen* of it finely in a mortar, and it can transmute one *jin* of mercury into refined purple-gold. This is not of the mortal world but a secret transmission from the immortals. For those who seek to aid their Dao, know when to be content.\n\n**Mercury:** one *jin*\n**Medicine:** one *fen*\n\nPlace the medicine atop the mercury in a new iron pan, cover it with a tea bowl, and seal it properly. Set the pan over fire and listen carefully for the sound of dripping inside. Then immediately quench the pan in water. Repeat this process ten or more times until the mercury is subdued, resembling black lead sand. Transfer it to a crucible and melt it into refined purple-gold. The transformations possible with this method are too numerous to record in full.\n\n*The Secret Alchemical Instructions of the Numinous Treasure and the Perfected Ones concludes.*",
      "overlap_context": "method: grind fine ink with rice vinegar and apply it evenly inside the box three times; let it dry. Place the medicine inside and warm the box over gentle fire until the medicine melts into liquid. Follow the previous method: add four *liang* of saltpeter, ground to powder, press it firmly into the base of the box, seal it with dry paper, then secure the lid and place it in the crucible. Seal the joints with method paste as before, secure the lid with an iron latch, and let it dry in the shade.",
      "start_char": 6219,
      "end_char": 6491,
      "start_sentence": 238,
      "end_sentence": 246,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.166054248809814,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\灵宝众真丹诀.txt",
        "category": "玉诀类"
      }
    }
  ]
}