{
  "source_id": "灵宝净明黄素书释义秘诀",
  "source_file": "chunked_daozang\\灵宝净明黄素书释义秘诀.json",
  "total_chunks": 5,
  "total_original_chars": 4603,
  "total_translated_chars": 26336,
  "total_translation_time": 131.66482734680176,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\方法类\\灵宝净明黄素书释义秘诀.txt",
    "category": "方法类"
  },
  "full_translation": "*The Secret Essentials of the Yellow Plain Scripture of the Numinous Treasure Pure Clarity: An Exegetical Esoteric Method*\n\n**Scripture Title:** *The Secret Essentials of the Yellow Plain Scripture of the Numinous Treasure Pure Clarity: An Exegetical Esoteric Method*. Author unknown. One fascicle. Base text from *The Orthodox Daoist Canon*, *Dongxuan* Section, Methods Category.\n\n---\n\nDisciple Fang Wen, bowing deeply to the Perfected Master, ventures to inquire about several matters in the *Yellow Plain Scripture*, humbly beseeching the Jade Decree to reveal the root and source with luminous instruction.\n\nThe Scripture states: *\"The five qi converge at the Origin; the three yang gather at the crown.\"*\n\nFang Wen observes that the Perfected Immortal Zhongli and the Perfected Immortal Lü, in their *Anthology on the Transmission of the Dao*, speak of refining the Great Elixir of Golden Cinnabar, saying: *\"The five qi converge at the Origin; the three flowers gather at the crown.\"* The five qi are inseparable from the Five Phases—or perhaps the five viscera. Here it is called the \"three yang,\" while there it is called the \"three flowers.\" Yang is also qi. Moreover, at birth, all yang in a person gathers at the head, and the qi of the five viscera naturally ascends to the Mud Pill Palace. Thus, the eyes can see, the ears can hear, the nose can smell, and the tongue can taste. Yet in the refinement of the Golden Elixir, it is said: *\"The five qi converge at the Origin; the three flowers gather at the crown.\"* I fear there may be a distinct transformation at work. I humbly beg for clear instruction.\n\nThe five qi are the qi of the five viscera, which unite and ascend to the Origin Palace. The Origin Palace refers to the Lower Elixir Field. When the Lower Elixir Field is firmly guarded, one may then ascend to the Middle Elixir Field. Having ascended to the Middle Elixir Field, one then converges at the Upper Elixir Field—this is called the \"three yang.\" The \"flower\" is another name for the three yang. This is the movement of the primordial yang, which condenses into five and operates as three. At such a time, the Elixir is already formed. Auspicious clouds arise at the crown gate, and the qi of the crown opens, bright as the sun and moon. The ears hearing and the nose smelling are not mere convergence but true gathering.\n\nThe Scripture states: *\"One should contemplate: from whence does this body arise?\"*\n\nFang Wen reflects: People of this world do not know why they die. The origin of the body lies in the union of the two halves of the one qi of Heaven and Earth, the qi of father and mother—the very beginning of creation. Knowing that we arise from this, we should cultivate from this root, thereby aligning with the investigation of creation’s origin. If one cultivates from solitary yin alone, it does not accord with the intent. I humbly beseech the secret transmission of luminous instruction.\n\nAt the inception of human life, there is fundamentally the One. The One and speech become two—this is the discourse of the One and Two. The One and Two transform each other, giving rise to true Water and true Fire, wherein spirit and essence are complete. Once true Water and true Fire are recognized, one can then know from whence one comes.\n\nThe Scripture states: *\"When the sun and moon are misaligned, success cannot be achieved.\"*\n\nFang Wen carefully examines the *Elixir Scriptures*, which all take the celestial bodies of the sun and moon as their model—this is the true Dharma-image. If one can emulate the sun and moon, one can seize the transformative workings of Heaven and Earth’s yin and yang. Yet why does misalignment prevent success? The *Zhouyi Cantong Qi* states: *\"The sun and moon intermingle, holding the yang’s male banner. Yin bestows yin, and the female transforms into yellow hue.\"* It also says: *\"The slightest deviation brings regret and misfortune, becoming a thief to yin.\"* The *Perfected Lord’s Elixir Scripture* says: *\"There is a time for gathering, a season for harvesting.\"* And the poem by Perfected Master Zhang says: *\"Even a hair’s deviation will fail to produce the Elixir.\"* How, then, does deviation occur? What method ensures no misalignment? This pertains to the fire-phase. I humbly beseech the oral transmission of the esoteric method.\n\nThe images of the sun and moon originate in spirit and essence. The generation of spirit and essence resides in the One and Two. The One and Two are the correct numbers of the fire-phase. Water and Fire have the functions of withdrawal and addition. Thus, one selects the month within the year, the day within the month, and the hour within the day—thereby avoiding misalignment. This principle is recorded in the fire-phase.\n\nThe Scripture states: *\"Discern Water and Fire; unite Dragon and Tiger; clarify the Elixir Medicine; comprehend Lead and Mercury; master withdrawal and addition; revolve the River Chariot.\"*\n\nFang Wen has exhaustively studied the *Elixir Scriptures*, which do not depart from yin and yang yet generate myriad names—dozens of terms such as Water and Fire, Dragon and Tiger, Lead and Mercury, River Chariot, all referring to the same thing. Yet here it says: *\"Discern Water and Fire; unite Dragon and Tiger; clarify the Elixir Medicine; comprehend Lead and Mercury; revolve the River Chariot.\"* Why? If one recognizes Water and Fire, one recognizes Dragon and Tiger. If one recognizes Dragon and Tiger, one recognizes Lead and Mercury—this is the very material of the Elixir Medicine. Why then speak of \"discerning,\" \"uniting,\" \"clarifying,\" \"comprehending,\" and \"revolving\"? As for the numbers of withdrawal and addition, they pertain to the fire-phase. If one does not recognize the medicinal materials, how can one master withdrawal and addition? I humbly beseech instruction on the essentials, that they may not conflict, so as to facilitate ease of understanding for later learners.\n\nWater and Fire refer to nature, hence \"discern.\" This is before their application. Dragon and Tiger refer to emotion, hence \"unite\"—this is their application. Lead and Mercury refer to their form, so one may know them as the material of the Medicine—thus \"comprehend.\" Mastering withdrawal and addition enables one to revolve the River Chariot.\n\nThe Scripture states: *\"By using the hun to control the po, one knows the arising and setting of the sun and moon.\"*\n\nThe arising and setting of the sun and moon are the Dao of Heaven, the ultimate numbers of yin and yang. The hun and po are the spirits of humans, by which one may know these. Yet why must one use the hun to control the po before one can know them? This refers to the two kidneys. The right is the Gate of Life, belonging to yang—this is the hun. Yin is on the right, yang on the left, yet here it is on the right—this is the meaning of controlling the po. The qi of the right kidney ascends to the left eye at midnight. The qi of the left kidney arises in the right eye at noon. Thus one knows the arising and setting of the sun and moon. The hours of *zi* and *wu* are the ultimate numbers of the sun and moon’s generative qi.\n\nThe Scripture states: *\"When the qi of the Heart and Kidneys interact, this is called true Water and true Fire.\"*\n\nThe Heart and Kidneys are Kan and Li, Water and Fire—every person possesses them. Yet the *Elixir Scriptures* speak of gathering at a certain day and harvesting at a certain time, not in the Heart and Kidneys. Zhang Yifu’s *Elixir Scripture* even says: *\"It is delusory to point to the Heart and Kidneys as Kan and Li.\"* Why, then, does this text speak of true Water and true Fire?\n\nWhen the Heart and Kidneys interact, only then can one speak of the true. Without interaction, they cannot become true. For only through interaction can the child be born. The Scripture states: *\"The dragon is the Heart; the tiger is the Kidneys.\"* The qi of the Kidneys is easily depleted, while the fluid of the Heart is difficult to accumulate—this hinges on knowing the time of their union. The method of gathering and harvesting involves generating Water within Fire and Fire within Water, for the art lies in inversion. The tiger and dragon are but alternate names for Water and Fire.\n\nIt is also said: *\"The dragon is Wood; the tiger is Metal.\"* If they belong to Metal and Wood, why then is the Heart called the dragon and the Kidneys the tiger? Why is the qi of the Kidneys easily depleted, while the fluid of the Heart is difficult to accumulate? The time of their union is the moment for inner work—when dragon and tiger unite, the qi of the sun and moon converge. The qi of the Heart and Kidneys naturally interact at specific times. But what does one gather and harvest? From what does one gather? Is the gathered substance visible or invisible? Can it be named or not?\n\nGenerating Water within Fire and Fire within Water is indeed an inversion. Yet how, within the human body, can one readily generate Water within Fire and Fire within Water? I humbly request detailed instruction. These words and the previous explanation are mutually illuminating.\n\nFire is born of Wood, and Metal is born of Water—just as the child follows the father to attain true nature. Yet if Fire and Water remain uncrossed and unchanged, they cannot be of use. This is the supreme art of generating Water within Fire and Fire within Water. When Fire is employed, Water can be generated—this is the oral instruction not to be committed to paper.\n\nThe Scripture states: *\"The inner elixir’s medicinal ingredients arise from the Heart and Kidneys, which all people possess.\"* The numinous embryo is born of true qi, just as dragons have pearls and cattle have *huang*, originating from the yellow sprout to form the inner elixir. Yet according to Fangwen’s examination of the *Elixir Scriptures* and the writings of the perfected in the *Ancient Records of Cultivation*, the medicinal ingredients do not lie between the Heart and Kidneys. If they did, then all people could form the numinous embryo. Solitary yin and orphaned yang cannot complete the work of creation. By what Dao does the dragon possess its pearl? Through what cultivation does the ox acquire its *huang*?\n\nAs for the yellow sprout—what is it? Can it be seen? Why is it called the yellow sprout? The yellow sprout is the great beginning of the elixir. Once obtained, one must then proceed with the fire phases of refinement before the inner elixir can be completed. By what method does the yellow sprout arise? If the medicinal ingredients are not in the Heart and Kidneys, where then do they return? The function of the Heart and Kidneys has its own root.\n\nThe dragon does not listen with its ears but with its mouth, excelling in inner vision. The ox can churn its throat, yet humans cannot. Thus, the medicinal substances of the Heart and Kidneys cannot become true. The Scripture states: *\"Unite dragon and tiger, discern the elixir medicine. Within cinnabar lies mercury; within lead lies silver. When lead and mercury combine, refinement naturally succeeds.\"*\n\nYet before discerning the elixir medicine, how can one unite dragon and tiger? The dragon and tiger *are* the elixir medicine—only by discerning the medicine can one cause the dragon and tiger to unite. *\"Within cinnabar lies mercury; within lead lies silver\"*—this is the elixir medicine, though it is not ordinary mercury. The Scripture says: *\"Ordinary mercury and ordinary lead are not worth the effort.\"* This is precisely the reason.\n\nAs for *\"warm refinement,\"* this refers to the fire phases. Yet how does one apply the fire phases? The texts do not explain—only speaking of refinement, but not how to apply the fire. I earnestly request detailed instruction. This is the matter of the fire phases, as well as the principle of the *hun* controlling the *po*. To know how the *hun* controls the *po* is to perceive the fire phases. The fire phases can be measured in hours instead of months, in moments instead of days, and need not require years of gathering.\n\nThe Scripture states: *\"The method of withdrawing and adding lead and mercury must grasp the mechanism of Heaven and Earth.\"* Generally, withdrawal and addition occur only after the medicine is obtained in the crucible. Withdrawal and addition refer to the fire phases. To grasp the mechanism of Heaven and Earth is to align with the waxing and waning of the sun and moon. The Scripture says: *\"Though a thousand texts and ten thousand discourses expound the truth, none commit the fire phases to writing. To know the oral instructions that penetrate the mysteries, one must discuss them in detail with the immortals.\"*\n\nSince ancient times, the fire phases have not been transmitted in writing. I humbly beseech a dream transmission of the oral instructions or direct instruction from the perfected. Though Fangwen has already gained some understanding, I fear it may not be authentic. When it comes to inner work, discrepancies may arise. How fortunate I am to have encountered this opportunity today—I reverently knock and request correction of my learning. I would be most grateful.\n\nFangwen presents his inquiry: The method of severance includes the fire phases, which should be transmitted face-to-face. Fangwen has observed that the true master, in former days at Yuzhang, composed poems in harmony with the immortals, saying:\n\n*\"At the tip of the blade’s two horns,\nThe flying golden elixir descends.\nWait for the mid-autumn eighth month—\nTake special note, lest you forget.\"*\n\nAnd again:\n\n*\"At the tip of the blade,\nTwo horns give birth to the golden elixir,\nWhich forms at the very top.\"*\n\nThese all refer to the supreme great elixir. Though Fangwen has already gained some understanding, he does not know whether it is correct. I humbly request the true master’s past cultivation practices for instruction.\n\nFangwen has observed the true master’s practice of the *\"three-five flying steps\"*—is this not the hidden script? Does the Supreme Micro Emperor guard the Celestial Flower, presiding over the extended term and storing the primordial auxiliary? Fangwen has witnessed this practice and humbly requests annotation.\n\nFangwen has also observed the true master’s attainment of the *\"divine method of the lower meaning\"*—is this not the oral essentials of Lord Lao, the affairs of the Six Ding Jade Maidens? I respectfully request annotation.\n\nFangwen presents his inquiry: This is the method of severance in elixir refinement. Later generations, relying on their cleverness, have fabricated false and erroneous teachings, misleading later students so that they ultimately fail to succeed. They do not understand that *\"the tip of the blade\"* refers to gold within Water, and *\"the two horns\"* to Wood within Fire. Only by Wood entering Fire can Water boil. *\"The mid-autumn eighth month\"* refers to the number fifteen.\n\nFifteen is the number of the *Hetu*. The eighth month corresponds to Metal. The theory of \"drawing the Spleen\" does not directly refer to the fifteenth day of the eighth month. The \"three-five flying steps\" does not speak of three-six or four-five, but of three-five—the Star of the Perfected. The Star of the Perfected means emptying the self to employ the One, preserving the body as a Perfected One, and guarding the completion of the three-threes. The Star of the Perfected is the third star. Only by preserving the Perfected can one attain transformation—this is not the oral essentials of Lord Lao or the affairs of the Six Ding Jade Maidens.\n\nAs for Ding Yi: This refers to one person. The art of the Golden Elixir is commonly spoken of as not bearing the surname Ding and given name Yi, but rather concealing the name as Ding Yi. Ding is Fire; Yi is also Fire. This is Fire within Fire, uniting true Fire with ordinary fire—this is precisely the method of fire timing. It has never been transmitted to others and should be separately demonstrated.\n\nFangwen has observed the True Master’s revival of the *Lingbao Jingming* teachings. Within the *Scripture of Salvation*, the wondrous Dao of *Lingbao* contains many doctrines. Fangwen has explored one or two of its mysteries and humbly requests that the True Master expound the *Scripture of Salvation* in full, establishing it as the foundation of all teachings. The practice of talismanic methods lies in accumulating merit through repeated effort.\n\nFangwen has also observed that the *Scripture of the Nine Elder Lords on Reviving the Dead* originates from the *Authentic Scripture of Salvation* and belongs to the *Lingbao* tradition. He respectfully beseeches the True Master to bestow the authentic text to instruct those at the altar.\n\nFangwen presents his inquiry: The *Scripture of Salvation* was first transmitted by the Most High to the Lord of the Dao, who then passed it to me. I have not fully grasped its wonders, so the Lord of the Dao directly pointed to the *Jingming* teachings as the throat and collar of salvation. Like the primordial net, it is supremely wondrous—diligent practice, not extensive reading, is key. As the saying goes: \"One strike opens the three gates, straight to the ninefold thoroughfare.\" Do you understand?\n\nIt speaks of the Nine Heavens, the Three Heavens, and the Three-Nines—these are its essential mysteries, which you may not yet know. What is the Three-Nines? It is the number twelve. Setting aside three to make nine yields the Nine Cauldrons; preserving three as three yields the Three Passes. This is the true method of the Three Ones. One generates three, two generates four—this is the function of Metal and Wood.\n\nFormerly, the *Scripture of Reviving the Dead* was a technique of the *Lingbao* teachings for salvation. Now, the authentic text is corrupted beyond recognition. Those who take liberties with it have altered it, so the *Qi Mirror* chapter has misled many. Recently, the *Affair of the Elixir Well* was composed, but its timing remains undetermined. This scripture will require several more days before it can be revealed and ultimately transmitted.\n\nFangwen: *\"The Crimson Golden Elixir forms in a day—*\n*This ancient immortal’s words are worth heeding.*\n*If one speaks of nine years or three,*\n*It is all but procrastination and delay.\"*\n\nIt also says: *\"In but a moment’s effort,*\n*Eternal ease and joy are secured.\"*\nI do not know what method could be so swift. It further states: *\"Mercury cast into lead, lead cast into mercury—*\n*Thus transformation is achieved in but a moment.\"*\nAnd: *\"True lead is the gold within mercury.\"*\nAn ancient immortal’s poem says: *\"The world does not recognize the gold within water.\"*\nIt continues: *\"Those who know are true immortals.\"*\nThus, a single speck of true gold makes one an immortal.\n\nMaster Lü’s poem says: *\"Seize the essence of Metal to establish the foundation of life.\"*\nAnd: *\"You must refine true lead with Jia and Geng,*\n*Fire draws the crimson phoenix marrow from the south,*\n*Water seeks the black turtle essence from the northern sea.\"*\nHere we see that Water and Fire are indeed Water and Fire, and Water and Fire reside in the Heart and Kidneys. True lead is indeed true lead, not the Water and Fire of the Heart and Kidneys. Refining this true lead is the Great Dao.\n\nI hope the True Master, in his compassion, will not conceal it but clearly and secretly reveal it. Fangwen presents his inquiry.\n\nWithin a single day, one may absorb the *qi* of the Yellow Simplicity—eighty-one measures in all. What is the eighty-one? It is the total *qi* of the nine nines of Yellow Simplicity. If you wish to know how to refine the turbid and retain the pure, the work lies in leaving the turbid and keeping the pure. There is no other task—it can be accomplished in an instant.\n\nMercury cast into lead, lead cast into mercury—this is the method of transformation. Heart joins with Kidneys, Kidneys join with Heart, and the two *qi* mutually merge. It does not depart from the One and Two of Metal: the child within lead. Know the mother, and you will recognize the child.\n\nThis is the *qi* of the left Kidney ascending to the Liver, reaching the Lungs, and entering the crown, then returning from the crown to the center. As the saying goes: *\"Above and below, fivefold division—*\n*The total qi ascends to the Mysterious.\"*\nFrom this, we know that the gold of true lead is the meaning of Jia and Geng.\n\nFangwen received the *Five-Thunder Divine Method* from the True Master, who encountered it at Mount Hua in the Jade Grotto from the Perfected Lord Wang Ling’an. Now, only the five talismanic scripts remain; the rest—the ritual methods for the four directions, the *Red Goose* talismans, and related oral instructions—are incomplete and may not be authentic. I further beseech the True Master to specially bestow and reveal them. Fangwen presents his inquiry.\n\nThe present *Orthodox One Five-Thunder Method* is far superior, and the former efforts were in vain. The other day, the True Master supervised the *Five Thunders* transmission—this is its essence.\n\nSince the *guiyou* year, when Fangwen was but twenty, he met a Daoist Li from western Shu who spoke of mercury and sought its method of extraction. In the *gengzi* year, he encountered a Daoist Chen from the Eastern Capital, who transmitted to Fangwen the *Elixir Scripture* on lead and mercury. In the *guimao* year, he met Master Wang from the Hebei region and a Daoist Shu from the capital, and he paid respects to the scholar Wang of his hometown to study the *Can Tong Qi*’s elixir furnace, lead, mercury, and fire timing. Last year, while serving as an official in Chongren, he met a senior disciple of Master Wang of Jiangzhou, who transmitted the method of the Fire Elixir in great detail. He has already reported this to the Most High, formed a bond with fellow elixir companions, and discussed fire timing in meticulous detail. Since fire timing is not established in writing, it is preserved only in oral instructions.\n\nNow, I humbly report to the True Master to discern the right from the wrong, that Fangwen may proceed without doubt. I intend to commence the work in the *gengxu* year to accomplish the Great Medicine, and I earnestly hope the True Master will assist and instruct me.\n\nFangwen now silently inquires about the matter of fire timing and seeks a detailed response.\n\nFangwen respectfully submits:\nWithout entering the gate, one wanders lost among many divergent paths. The matter is not extraordinary, yet I dare not speak of it in full. Take, for instance, the method of extraction—one must ask: what medicine is to be gathered? Is it visible or invisible? Audible or inaudible? Some require neither sight nor sound, while others demand one or the other—all hinges on a single principle or two.\n\nAs for the method of fire timing, it pertains to the fire timing of the celestial cycle. The secret of refining form alone is insufficient to complete the Golden Elixir. To achieve the Elixir, one must distinguish the fire timing within the Elixir itself, and the technique of application also exists. To know the affairs of the heart, one must seek them in the kidneys. Within the kidneys lies true fire, and the lead tripod gives birth to golden liquid.\n\nWhat does it mean for the lead tripod to give birth to golden liquid? Wood gives birth to fire, metal gives birth to water. Water and fire are the functions of husband and wife; metal and wood, the functions of father and son. Only with father and son can there be a household. What is a household? It is the Elixir within the spleen.\n\nYet to seek husband and wife, they must be able to overcome one another. Without overcoming, there can be no governance; without governance, there can be no generation. To know this technique, it rests upon one or two principles. Reflect deeply upon these one or two principles.\n\nFor now, let us discuss this single aspect. If there is anything not yet understood, do not hesitate to clarify.\n\nFangwen respectfully inquires on the following points:\n1. In the sword technique, how does one determine the day when metal and wood overcome one another? Thereafter, should one contemplate it daily—yet at what time? Or is there no fixed occasion?\n\nShould one contemplate only on the days when metal and fire interact—what of the nights? Secondly, on the day when metal and water generate one another, one begins forging. Yet if forging daily, is there a fixed time, or none? And what of the nights? Thirdly, how does one nurture for a full year? Fourthly, how does one grind the sword? Fifthly, on the day when metal and water generate one another through water, what is the method? Lastly, the oral instructions at the end of the technique speak of heart-transmission.\n\nThe overcoming and generation of one another are called the days when stems and branches mutually generate or overcome. Heart-transmission is the hidden technique. Its application follows the master’s guidance—it is a secret art.\n\nFangwen practices the Eight Hidden Arts of the Dao of the Cinnabar Landscape, yet within them, the true names and hidden titles of the Jade Emperor Dao Lord differ, and the celestial script remains unrecognized. The following questions are posed:\n\n1. The true names of the Jade Emperor in the Eight Palaces:\n   - Gen Palace: Great Vessel\n   - Zhen Palace: Dark and Remote (or Dark and Desolate)\n   - Xun Palace: Without Heroism\n   - Li Palace: Earl Shi\n   - Kun Palace: Moving Pearl\n   - Dui Palace: Two Principles (or Two Polarities)\n   - Qian Palace: Primordial Assistant\n   - Kan Palace: Yin Essence\n\n2. The Purple Clarity Emperor Lord:\n   - Pronounced *Ming*\n   - Pronounced *Ting*\n   - Pronounced *Ling*\n\nThough the actual names differ, the Eight Palaces all refer to the hidden titles of the Jade Emperor of the Northern Dipper. Each is employed according to its position, just as metal in stone is ore, yet when smelted, becomes elixir.\n\nFangwen further inquires: Is there a swift method to summon the Jade Maidens? The names of the Six Ding Jade Maidens and their talismans vary greatly—guidance is sought.\n\nThe methods of the Jade Maidens all derive from a single source, yet sincerity makes them easier to invoke. Among the unerring methods of today, none surpass *The White Ape Classic*.\n\nThe secret oral instructions on the esoteric meanings of the *Yellow Register of the Numinous Treasure Pure Clarity* are now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "灵宝浄明黄素书释义秘诀 经名：灵宝浄明黄素书释义秘诀。 撰人不详。 一卷。 底本出处：《正统道藏》洞玄部方法类。 灵宝浄明黄素书释义秘诀 弟子方文，馑稽首真师，敢问黄素书数事，伏望玉旨，真指根源，分明垂教。 书曰：五炁朝元，三阳聚顶。 方文伏睹钟离真仙与吕真仙，作《传道集》，说炼大药金丹事有曰：五炁朝元，三花聚顶。 五炁不离五行，或曰五藏也。 此日三阳，彼日三花。 阳亦炁也，且人之生诸阳聚於首，五藏之炁自是朝於泥丸，故目能明，耳能听，鼻能嗅，舌能味。 而炼金丹曰五炁朝元，三花聚顶。 只恐别有造化。 伏乞分明指示。 五炁，五藏之炁，合而朝於元宫。 元官谓下元。 守下元之既固，然后达於中元。 达於中元，故朝於上元，名曰三阳。 花者； 三阳之异名也。 此元阳之运动，凝结为五，运用为三，如此之时，丹已成矣。 庆云生於顶门，而顶之炁已开，如日月明，耳听鼻嗅，则非正朝而聚也。 书曰：当思一身何所从来。 方文以谓，今世之人不知所以死。 身之从来，乃从天地之一炁，两半相合，父母之炁，造化之本始也。 知从此来，当从此修，即合根究造化之本始。 若从此孤阴而修，未合厥旨。 伏乞密赐垂教。 人之初生，本乎一。 一与言为二，又一二之说。 一二相化，故有真水、真火，而精神具。 既识真水、真火，斯能知所从来。 书曰：日月差互，不能成功。 方文详观《丹经》，全以日月垂象为，则此真法象也。 能法象日月，则能夺天地阴阳造化。 而差互不成功者，《周易·参同契》云：日月相撢，持阳雄旛。 阴施阴，雌变黄色。 又曰：纤芥不正，悔吝为贼阴。 《真君丹经》云：探有日，取有时。 又张真人诗云：毫发差殊不作丹。 所以差殊如何？ 何道得不差互？ 此是火候，愿赐口诀。 日月之象，本乎精神。 精神之生，存於一二。 一二，火候之正数也。 水火有抽添之用。 然於年中选月，月中选日，日中选时，故无差互。 此语载在火候。 书曰：辨水火，交龙虎，明丹药，晓铅汞，会抽添，转河车。 方文穷究丹经，丹经不离阴阳而生异名，凡数十种，如水火、龙虎、铅汞、河车，皆一也。 而此曰辨水火，交龙虎，明丹药，晓铅汞，转河车，何也？ 识水火，即识龙虎。 识龙虎，即识铅汞矣。 此便是丹药之材也。 如何曰辨，曰交，曰明，曰晓，曰转？ 若抽添之数，又自是火候，若不识药材，如何会抽添也？ 望指其要，使不相妨，以图后学易晓。 水火、龙虎，同名也。 水火言性，故曰辨。 未有用也。 龙虎言情，故曰交，已有用也。 铅汞言其形，则知其为药之材，斯可晓。 会抽添，即能转河车。 书曰：以魂制魄，则知日月之生没焉。 日月生没，天之道，阴阳之至数也。 魂魄者，人之神，可以知之。 乃欲以魂制魄，然后可知何也？ 此谓两肾也。 右为命门，属阳，为魂。 阴右，阳左，而乃在右，制魄之义也。 右肾之炁，夜半升於左目。 左肾之炁，日午生於右目。 则知日月之生没也。 子午之时，日月生炁之至数。 书曰：心肾二炁相交，故曰真水、真火。 心肾为坎离，为水为火，人人有之。 然丹经谓探有日，取有时，不在心、肾。 张仪甫丹经乃云：妄指心肾为坎离。 此曰真水、真火何也？",
      "translated_text": "*The Secret Essentials of the Yellow Plain Scripture of the Numinous Treasure Pure Clarity: An Exegetical Esoteric Method*\n\n**Scripture Title:** *The Secret Essentials of the Yellow Plain Scripture of the Numinous Treasure Pure Clarity: An Exegetical Esoteric Method*. Author unknown. One fascicle. Base text from *The Orthodox Daoist Canon*, *Dongxuan* Section, Methods Category.\n\n---\n\nDisciple Fang Wen, bowing deeply to the Perfected Master, ventures to inquire about several matters in the *Yellow Plain Scripture*, humbly beseeching the Jade Decree to reveal the root and source with luminous instruction.\n\nThe Scripture states: *\"The five qi converge at the Origin; the three yang gather at the crown.\"*\n\nFang Wen observes that the Perfected Immortal Zhongli and the Perfected Immortal Lü, in their *Anthology on the Transmission of the Dao*, speak of refining the Great Elixir of Golden Cinnabar, saying: *\"The five qi converge at the Origin; the three flowers gather at the crown.\"* The five qi are inseparable from the Five Phases—or perhaps the five viscera. Here it is called the \"three yang,\" while there it is called the \"three flowers.\" Yang is also qi. Moreover, at birth, all yang in a person gathers at the head, and the qi of the five viscera naturally ascends to the Mud Pill Palace. Thus, the eyes can see, the ears can hear, the nose can smell, and the tongue can taste. Yet in the refinement of the Golden Elixir, it is said: *\"The five qi converge at the Origin; the three flowers gather at the crown.\"* I fear there may be a distinct transformation at work. I humbly beg for clear instruction.\n\nThe five qi are the qi of the five viscera, which unite and ascend to the Origin Palace. The Origin Palace refers to the Lower Elixir Field. When the Lower Elixir Field is firmly guarded, one may then ascend to the Middle Elixir Field. Having ascended to the Middle Elixir Field, one then converges at the Upper Elixir Field—this is called the \"three yang.\" The \"flower\" is another name for the three yang. This is the movement of the primordial yang, which condenses into five and operates as three. At such a time, the Elixir is already formed. Auspicious clouds arise at the crown gate, and the qi of the crown opens, bright as the sun and moon. The ears hearing and the nose smelling are not mere convergence but true gathering.\n\nThe Scripture states: *\"One should contemplate: from whence does this body arise?\"*\n\nFang Wen reflects: People of this world do not know why they die. The origin of the body lies in the union of the two halves of the one qi of Heaven and Earth, the qi of father and mother—the very beginning of creation. Knowing that we arise from this, we should cultivate from this root, thereby aligning with the investigation of creation’s origin. If one cultivates from solitary yin alone, it does not accord with the intent. I humbly beseech the secret transmission of luminous instruction.\n\nAt the inception of human life, there is fundamentally the One. The One and speech become two—this is the discourse of the One and Two. The One and Two transform each other, giving rise to true Water and true Fire, wherein spirit and essence are complete. Once true Water and true Fire are recognized, one can then know from whence one comes.\n\nThe Scripture states: *\"When the sun and moon are misaligned, success cannot be achieved.\"*\n\nFang Wen carefully examines the *Elixir Scriptures*, which all take the celestial bodies of the sun and moon as their model—this is the true Dharma-image. If one can emulate the sun and moon, one can seize the transformative workings of Heaven and Earth’s yin and yang. Yet why does misalignment prevent success? The *Zhouyi Cantong Qi* states: *\"The sun and moon intermingle, holding the yang’s male banner. Yin bestows yin, and the female transforms into yellow hue.\"* It also says: *\"The slightest deviation brings regret and misfortune, becoming a thief to yin.\"* The *Perfected Lord’s Elixir Scripture* says: *\"There is a time for gathering, a season for harvesting.\"* And the poem by Perfected Master Zhang says: *\"Even a hair’s deviation will fail to produce the Elixir.\"* How, then, does deviation occur? What method ensures no misalignment? This pertains to the fire-phase. I humbly beseech the oral transmission of the esoteric method.\n\nThe images of the sun and moon originate in spirit and essence. The generation of spirit and essence resides in the One and Two. The One and Two are the correct numbers of the fire-phase. Water and Fire have the functions of withdrawal and addition. Thus, one selects the month within the year, the day within the month, and the hour within the day—thereby avoiding misalignment. This principle is recorded in the fire-phase.\n\nThe Scripture states: *\"Discern Water and Fire; unite Dragon and Tiger; clarify the Elixir Medicine; comprehend Lead and Mercury; master withdrawal and addition; revolve the River Chariot.\"*\n\nFang Wen has exhaustively studied the *Elixir Scriptures*, which do not depart from yin and yang yet generate myriad names—dozens of terms such as Water and Fire, Dragon and Tiger, Lead and Mercury, River Chariot, all referring to the same thing. Yet here it says: *\"Discern Water and Fire; unite Dragon and Tiger; clarify the Elixir Medicine; comprehend Lead and Mercury; revolve the River Chariot.\"* Why? If one recognizes Water and Fire, one recognizes Dragon and Tiger. If one recognizes Dragon and Tiger, one recognizes Lead and Mercury—this is the very material of the Elixir Medicine. Why then speak of \"discerning,\" \"uniting,\" \"clarifying,\" \"comprehending,\" and \"revolving\"? As for the numbers of withdrawal and addition, they pertain to the fire-phase. If one does not recognize the medicinal materials, how can one master withdrawal and addition? I humbly beseech instruction on the essentials, that they may not conflict, so as to facilitate ease of understanding for later learners.\n\nWater and Fire refer to nature, hence \"discern.\" This is before their application. Dragon and Tiger refer to emotion, hence \"unite\"—this is their application. Lead and Mercury refer to their form, so one may know them as the material of the Medicine—thus \"comprehend.\" Mastering withdrawal and addition enables one to revolve the River Chariot.\n\nThe Scripture states: *\"By using the hun to control the po, one knows the arising and setting of the sun and moon.\"*\n\nThe arising and setting of the sun and moon are the Dao of Heaven, the ultimate numbers of yin and yang. The hun and po are the spirits of humans, by which one may know these. Yet why must one use the hun to control the po before one can know them? This refers to the two kidneys. The right is the Gate of Life, belonging to yang—this is the hun. Yin is on the right, yang on the left, yet here it is on the right—this is the meaning of controlling the po. The qi of the right kidney ascends to the left eye at midnight. The qi of the left kidney arises in the right eye at noon. Thus one knows the arising and setting of the sun and moon. The hours of *zi* and *wu* are the ultimate numbers of the sun and moon’s generative qi.\n\nThe Scripture states: *\"When the qi of the Heart and Kidneys interact, this is called true Water and true Fire.\"*\n\nThe Heart and Kidneys are Kan and Li, Water and Fire—every person possesses them. Yet the *Elixir Scriptures* speak of gathering at a certain day and harvesting at a certain time, not in the Heart and Kidneys. Zhang Yifu’s *Elixir Scripture* even says: *\"It is delusory to point to the Heart and Kidneys as Kan and Li.\"* Why, then, does this text speak of true Water and true Fire?",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1263,
      "start_sentence": 0,
      "end_sentence": 80,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.29062342643738,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\灵宝净明黄素书释义秘诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "心、肾相交，斯可言真。 不交不足以成真。 盖相交乃能有子。 书曰； 龙，心也。 虎，肾也。 肾炁易耗，心液难积，要在知交合之时。 采取之法，有自火中生水，水中生火，颠倒之术在也。 虎龙，即水火之异名也。 又曰：龙，木也。 虎，金也。 既属金、木，何故以心为龙，肾为虎？ 肾炁何以易耗？ 心液何以难积？ 交合之时，是下功时，龙虎交合，日月炁合也。 心、肾炁自交合有时也。 探取者，探取何物？ 从何物探？ 所探之物，可见不可见，？ 可名不可名？ 火中生水，水中生火，固为颠倒。 而人身之中，如何得便火中生水，水中生火？ 一一望为详示。 此语与前说，相互换也。 火生於木，金生於水，即子从於父，得真性矣。 然火水未济，不交变，不能以有用，此火中生水，水中生火之至术也。 火运用，可便生水，此口诀，不可纸笔道。 书曰：内丹者，药材，出於心、肾，是人皆有。 灵胎就真炁生，於如龙有珠、牛有黄，本於黄芽生，内丹成。 方文以《丹经》考之，并自《古修录》高真所着述，所谓药材者，非在心肾之间。 若在心肾之间，即是人皆可以结灵胎也。 孤阴寡阳，不能成造化，龙以何道而有珠？ 牛以何修而有黄？ 黄芽者，不知是何物也，可得见否？ 何故谓之黄芽？ 黄芽，大丹头也。 得黄芽，即又要行火侯修持，然后内丹可成。 以何道而得黄芽生？ 药材不在心肾，复归何处？ 心肾之用，自有根本。 龙不以耳听，而以口听，善於内视。 牛能鼓咽，而人不能。 所以，心肾之药，不能成真。 书曰：交龙虎，辨丹药。 砂中有汞，铅中有银。 铅汞相合，缎炼自成。 交龙虎，辨丹药，且丹药未辨，如何得交龙虎？ 龙虎，便是丹药也，辨得丹药，然后可使龙虎交。 砂中有汞，铅中有银。 此便是丹药，但非是凡汞。 经云：凡汞、凡铅，不劳弄。 正为此也。 暖炼者，此乃火候。 如何下火候，书中都不说，但云缎炼，何以下火？ 愿详指示。 此谓火候，又魂制魄之说。 知魂制魄，即见火候。 火候可以用时易月，以刻易日，不在乎年探也。 书曰：铅汞抽添之法，要达天地之机。 大凡抽添，已是得药在炉。 抽添者，火侯抽添也。 达天地之机者，合日月之进退。 经云：万论千经讲至真，不将火候着於文。 要知口诀通玄处，须共神仙子细论。 自古火侯不传文字，愿赐梦授口诀，或亲蒙圣训。 方文虽已知，恐失真实。 及至下功，却有差互。 可惜今日幸得遭遇，虔切叩请，以考正所学，不胜幸甚。 方文呈覆。 截法中有火候，当以面授。 方文伏见真师，昔日豫章与众仙唱和诗曰：刃锋头两角，飞起金丹便落。 更候八月中秋，专记勿令忘却。 又一刃锋头，两角生金丹，只向上头成。 此皆言上品大丹。 方文虽已得知，未知合与不合？ 真师昔日修行事，乞赐训诲。 方文伏见真师行三五飞步事，莫便是隐书？ 太微帝君镇天英，守延期存元辅事否？ 方文见行之，乞赐批示。 又伏睹真师得下义神方事，莫是老君金口要诀事、六丁玉女事否？ 欲望批示。 方文呈覆。 此乃修丹之截法也。 后人多恃其聪明，伪为谬说，以误后学，终不能成功。 不知一刀锋头者，水中有金也。 两角者，火中有木也。 以木巽火，然后能水沸。 八月中秋者，十五之数也。",
      "translated_text": "When the Heart and Kidneys interact, only then can one speak of the true. Without interaction, they cannot become true. For only through interaction can the child be born. The Scripture states: *\"The dragon is the Heart; the tiger is the Kidneys.\"* The qi of the Kidneys is easily depleted, while the fluid of the Heart is difficult to accumulate—this hinges on knowing the time of their union. The method of gathering and harvesting involves generating Water within Fire and Fire within Water, for the art lies in inversion. The tiger and dragon are but alternate names for Water and Fire.\n\nIt is also said: *\"The dragon is Wood; the tiger is Metal.\"* If they belong to Metal and Wood, why then is the Heart called the dragon and the Kidneys the tiger? Why is the qi of the Kidneys easily depleted, while the fluid of the Heart is difficult to accumulate? The time of their union is the moment for inner work—when dragon and tiger unite, the qi of the sun and moon converge. The qi of the Heart and Kidneys naturally interact at specific times. But what does one gather and harvest? From what does one gather? Is the gathered substance visible or invisible? Can it be named or not?\n\nGenerating Water within Fire and Fire within Water is indeed an inversion. Yet how, within the human body, can one readily generate Water within Fire and Fire within Water? I humbly request detailed instruction. These words and the previous explanation are mutually illuminating.\n\nFire is born of Wood, and Metal is born of Water—just as the child follows the father to attain true nature. Yet if Fire and Water remain uncrossed and unchanged, they cannot be of use. This is the supreme art of generating Water within Fire and Fire within Water. When Fire is employed, Water can be generated—this is the oral instruction not to be committed to paper.\n\nThe Scripture states: *\"The inner elixir’s medicinal ingredients arise from the Heart and Kidneys, which all people possess.\"* The numinous embryo is born of true qi, just as dragons have pearls and cattle have *huang*, originating from the yellow sprout to form the inner elixir. Yet according to Fangwen’s examination of the *Elixir Scriptures* and the writings of the perfected in the *Ancient Records of Cultivation*, the medicinal ingredients do not lie between the Heart and Kidneys. If they did, then all people could form the numinous embryo. Solitary yin and orphaned yang cannot complete the work of creation. By what Dao does the dragon possess its pearl? Through what cultivation does the ox acquire its *huang*?\n\nAs for the yellow sprout—what is it? Can it be seen? Why is it called the yellow sprout? The yellow sprout is the great beginning of the elixir. Once obtained, one must then proceed with the fire phases of refinement before the inner elixir can be completed. By what method does the yellow sprout arise? If the medicinal ingredients are not in the Heart and Kidneys, where then do they return? The function of the Heart and Kidneys has its own root.\n\nThe dragon does not listen with its ears but with its mouth, excelling in inner vision. The ox can churn its throat, yet humans cannot. Thus, the medicinal substances of the Heart and Kidneys cannot become true. The Scripture states: *\"Unite dragon and tiger, discern the elixir medicine. Within cinnabar lies mercury; within lead lies silver. When lead and mercury combine, refinement naturally succeeds.\"*\n\nYet before discerning the elixir medicine, how can one unite dragon and tiger? The dragon and tiger *are* the elixir medicine—only by discerning the medicine can one cause the dragon and tiger to unite. *\"Within cinnabar lies mercury; within lead lies silver\"*—this is the elixir medicine, though it is not ordinary mercury. The Scripture says: *\"Ordinary mercury and ordinary lead are not worth the effort.\"* This is precisely the reason.\n\nAs for *\"warm refinement,\"* this refers to the fire phases. Yet how does one apply the fire phases? The texts do not explain—only speaking of refinement, but not how to apply the fire. I earnestly request detailed instruction. This is the matter of the fire phases, as well as the principle of the *hun* controlling the *po*. To know how the *hun* controls the *po* is to perceive the fire phases. The fire phases can be measured in hours instead of months, in moments instead of days, and need not require years of gathering.\n\nThe Scripture states: *\"The method of withdrawing and adding lead and mercury must grasp the mechanism of Heaven and Earth.\"* Generally, withdrawal and addition occur only after the medicine is obtained in the crucible. Withdrawal and addition refer to the fire phases. To grasp the mechanism of Heaven and Earth is to align with the waxing and waning of the sun and moon. The Scripture says: *\"Though a thousand texts and ten thousand discourses expound the truth, none commit the fire phases to writing. To know the oral instructions that penetrate the mysteries, one must discuss them in detail with the immortals.\"*\n\nSince ancient times, the fire phases have not been transmitted in writing. I humbly beseech a dream transmission of the oral instructions or direct instruction from the perfected. Though Fangwen has already gained some understanding, I fear it may not be authentic. When it comes to inner work, discrepancies may arise. How fortunate I am to have encountered this opportunity today—I reverently knock and request correction of my learning. I would be most grateful.\n\nFangwen presents his inquiry: The method of severance includes the fire phases, which should be transmitted face-to-face. Fangwen has observed that the true master, in former days at Yuzhang, composed poems in harmony with the immortals, saying:\n\n*\"At the tip of the blade’s two horns,\nThe flying golden elixir descends.\nWait for the mid-autumn eighth month—\nTake special note, lest you forget.\"*\n\nAnd again:\n\n*\"At the tip of the blade,\nTwo horns give birth to the golden elixir,\nWhich forms at the very top.\"*\n\nThese all refer to the supreme great elixir. Though Fangwen has already gained some understanding, he does not know whether it is correct. I humbly request the true master’s past cultivation practices for instruction.\n\nFangwen has observed the true master’s practice of the *\"three-five flying steps\"*—is this not the hidden script? Does the Supreme Micro Emperor guard the Celestial Flower, presiding over the extended term and storing the primordial auxiliary? Fangwen has witnessed this practice and humbly requests annotation.\n\nFangwen has also observed the true master’s attainment of the *\"divine method of the lower meaning\"*—is this not the oral essentials of Lord Lao, the affairs of the Six Ding Jade Maidens? I respectfully request annotation.\n\nFangwen presents his inquiry: This is the method of severance in elixir refinement. Later generations, relying on their cleverness, have fabricated false and erroneous teachings, misleading later students so that they ultimately fail to succeed. They do not understand that *\"the tip of the blade\"* refers to gold within Water, and *\"the two horns\"* to Wood within Fire. Only by Wood entering Fire can Water boil. *\"The mid-autumn eighth month\"* refers to the number fifteen.",
      "overlap_context": "i.\n\nThe Scripture states: *\"When the qi of the Heart and Kidneys interact, this is called true Water and true Fire.\"*\n\nThe Heart and Kidneys are Kan and Li, Water and Fire—every person possesses them. Yet the *Elixir Scriptures* speak of gathering at a certain day and harvesting at a certain time, not in the Heart and Kidneys. Zhang Yifu’s *Elixir Scripture* even says: *\"It is delusory to point to the Heart and Kidneys as Kan and Li.\"* Why, then, does this text speak of true Water and true Fire?",
      "start_char": 1264,
      "end_char": 2514,
      "start_sentence": 81,
      "end_sentence": 168,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.59599232673645,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\灵宝净明黄素书释义秘诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "十五，河图之数。 八月者，金也。 引脾之说，非直指八月十五日。 三五飞步，不言三六、四五，而曰三五，真人星也。 真人星者，虚一己，以为用存身为真人，守三三数之成。 真人星，第三星也。 能存真人，然后能变化，此非金口要诀、六丁玉女事。 丁义。 是一人，常言金丹之术，本不姓丁名义，隐其名以丁义。 丁者，火也。 义者，亦火也。 此火中火，以真火合凡火，此正火候之法，亦不曾以授人，当别以相示。 方文伏睹真师兴灵宝浄明教法。 而灵宝妙道，在《度人经》中，教法甚多，方文尝探赜一二，伏望真师大演度人经教，以为教法之祖，又行持符法，在於积行累功。 伏睹九老帝君《回尸起死之经》本出《度人真经》，亦是灵宝法门。 伏乞真师颁示真本，以教在坛之士。 方文呈覆。 《度人经》者，太上始授之於道君，道君授之於我。 我未全其妙，故道君直指浄明之教，以为度人之喉襟。 如彼元纲，亦其至妙，勤而行之，不在多阅。 所谓一撞三关门，直出九衢路。 汝知之乎？ 又曰九天，又曰三天，又曰三九，此其要妙，想所未知。 何谓三九者，十二之数也。 舍三以为九，则九鼎也。 存三以为三，即三关也。 此正三一之法。 一生三，二生四，即金木之用。 昔《回尸起死之经》为度人法教之术，今则真本讹舛，无复可辨。 好事者易之，故《炁镜》之篇，误人多矣。 近作《丹井缘事》乃以时数未定，然此经更数日方可出，终以相授。 方文：赫赤金丹一日成，古仙此语实堪听。 若言九载三年者，总是拖延款日程。 又云：都来片饷工夫，永保无穷逸乐。 不知何道如此之速，又云：以汞投铅，以铅投汞，而造化成，亦片时间尔。 又云：真铅是汞中金。 古仙诗云：世人不识水中金。 又云：识者便是真仙子。 是知一点真金便作仙。 吕公诗云：捉得金精作命基。 又云：须得真铅炼甲庚，火取南方赤凤髓，水求北海黑龟精。 於此见水火自是水火，水火乃在心肾也。 真铅自是真铅，非在心肾之水火。 炼此真铅，乃是大道。 望真师慈悲不隐，的当密示。 方文呈覆。 一日之间，取黄素之炁而吞之，乃八十一文也。 何谓八十一文，九九黄素之总炁。 欲知欲取清和浊，仍留浊去清工夫。 别无事，一刻也能成。 又汞投铅，铅投汞，则造化之法。 心交肾，肾交心，两炁相假合。 不离於一二金，铅中之子也，知其母，识其子矣。 此左肾之炁升於肝，以达於肺，而入於顶，由顶而还中。 所谓上下五分，总炁上玄。 从此可知，真铅之金，甲庚之义也。 方文受太上五雷神法，乃真师遇华岳，向玉洞灵安汪真君所传，今惟有五印真文，其余醮祭四维神法不全，并赤鹅等符文，未见应干诀目，恐未真的。 更乞真师特赐颁示。 方文呈覆。 终不及今之正一五雷法，徒费心力。 前日监度真师五雷，乃其要也。 方文自癸酉年，年始二十，见一西川李道人，说汞事，拜探取之法。 至庚子年，又见东京一陈道士，传方文丹经铅汞事。 至癸卯年，又见河朔一王先生，及京师庶道人，拜乡人王学士，参同丹灶铅汞事及火侯。 去年任官崇仁，遇王绛州先生高弟，传火丹之法甚详，已奏知太上，同结丹友，及讲论火侯子细，缘火侯不立文字，止存口诀。",
      "translated_text": "Fifteen is the number of the *Hetu*. The eighth month corresponds to Metal. The theory of \"drawing the Spleen\" does not directly refer to the fifteenth day of the eighth month. The \"three-five flying steps\" does not speak of three-six or four-five, but of three-five—the Star of the Perfected. The Star of the Perfected means emptying the self to employ the One, preserving the body as a Perfected One, and guarding the completion of the three-threes. The Star of the Perfected is the third star. Only by preserving the Perfected can one attain transformation—this is not the oral essentials of Lord Lao or the affairs of the Six Ding Jade Maidens.\n\nAs for Ding Yi: This refers to one person. The art of the Golden Elixir is commonly spoken of as not bearing the surname Ding and given name Yi, but rather concealing the name as Ding Yi. Ding is Fire; Yi is also Fire. This is Fire within Fire, uniting true Fire with ordinary fire—this is precisely the method of fire timing. It has never been transmitted to others and should be separately demonstrated.\n\nFangwen has observed the True Master’s revival of the *Lingbao Jingming* teachings. Within the *Scripture of Salvation*, the wondrous Dao of *Lingbao* contains many doctrines. Fangwen has explored one or two of its mysteries and humbly requests that the True Master expound the *Scripture of Salvation* in full, establishing it as the foundation of all teachings. The practice of talismanic methods lies in accumulating merit through repeated effort.\n\nFangwen has also observed that the *Scripture of the Nine Elder Lords on Reviving the Dead* originates from the *Authentic Scripture of Salvation* and belongs to the *Lingbao* tradition. He respectfully beseeches the True Master to bestow the authentic text to instruct those at the altar.\n\nFangwen presents his inquiry: The *Scripture of Salvation* was first transmitted by the Most High to the Lord of the Dao, who then passed it to me. I have not fully grasped its wonders, so the Lord of the Dao directly pointed to the *Jingming* teachings as the throat and collar of salvation. Like the primordial net, it is supremely wondrous—diligent practice, not extensive reading, is key. As the saying goes: \"One strike opens the three gates, straight to the ninefold thoroughfare.\" Do you understand?\n\nIt speaks of the Nine Heavens, the Three Heavens, and the Three-Nines—these are its essential mysteries, which you may not yet know. What is the Three-Nines? It is the number twelve. Setting aside three to make nine yields the Nine Cauldrons; preserving three as three yields the Three Passes. This is the true method of the Three Ones. One generates three, two generates four—this is the function of Metal and Wood.\n\nFormerly, the *Scripture of Reviving the Dead* was a technique of the *Lingbao* teachings for salvation. Now, the authentic text is corrupted beyond recognition. Those who take liberties with it have altered it, so the *Qi Mirror* chapter has misled many. Recently, the *Affair of the Elixir Well* was composed, but its timing remains undetermined. This scripture will require several more days before it can be revealed and ultimately transmitted.\n\nFangwen: *\"The Crimson Golden Elixir forms in a day—*\n*This ancient immortal’s words are worth heeding.*\n*If one speaks of nine years or three,*\n*It is all but procrastination and delay.\"*\n\nIt also says: *\"In but a moment’s effort,*\n*Eternal ease and joy are secured.\"*\nI do not know what method could be so swift. It further states: *\"Mercury cast into lead, lead cast into mercury—*\n*Thus transformation is achieved in but a moment.\"*\nAnd: *\"True lead is the gold within mercury.\"*\nAn ancient immortal’s poem says: *\"The world does not recognize the gold within water.\"*\nIt continues: *\"Those who know are true immortals.\"*\nThus, a single speck of true gold makes one an immortal.\n\nMaster Lü’s poem says: *\"Seize the essence of Metal to establish the foundation of life.\"*\nAnd: *\"You must refine true lead with Jia and Geng,*\n*Fire draws the crimson phoenix marrow from the south,*\n*Water seeks the black turtle essence from the northern sea.\"*\nHere we see that Water and Fire are indeed Water and Fire, and Water and Fire reside in the Heart and Kidneys. True lead is indeed true lead, not the Water and Fire of the Heart and Kidneys. Refining this true lead is the Great Dao.\n\nI hope the True Master, in his compassion, will not conceal it but clearly and secretly reveal it. Fangwen presents his inquiry.\n\nWithin a single day, one may absorb the *qi* of the Yellow Simplicity—eighty-one measures in all. What is the eighty-one? It is the total *qi* of the nine nines of Yellow Simplicity. If you wish to know how to refine the turbid and retain the pure, the work lies in leaving the turbid and keeping the pure. There is no other task—it can be accomplished in an instant.\n\nMercury cast into lead, lead cast into mercury—this is the method of transformation. Heart joins with Kidneys, Kidneys join with Heart, and the two *qi* mutually merge. It does not depart from the One and Two of Metal: the child within lead. Know the mother, and you will recognize the child.\n\nThis is the *qi* of the left Kidney ascending to the Liver, reaching the Lungs, and entering the crown, then returning from the crown to the center. As the saying goes: *\"Above and below, fivefold division—*\n*The total qi ascends to the Mysterious.\"*\nFrom this, we know that the gold of true lead is the meaning of Jia and Geng.\n\nFangwen received the *Five-Thunder Divine Method* from the True Master, who encountered it at Mount Hua in the Jade Grotto from the Perfected Lord Wang Ling’an. Now, only the five talismanic scripts remain; the rest—the ritual methods for the four directions, the *Red Goose* talismans, and related oral instructions—are incomplete and may not be authentic. I further beseech the True Master to specially bestow and reveal them. Fangwen presents his inquiry.\n\nThe present *Orthodox One Five-Thunder Method* is far superior, and the former efforts were in vain. The other day, the True Master supervised the *Five Thunders* transmission—this is its essence.\n\nSince the *guiyou* year, when Fangwen was but twenty, he met a Daoist Li from western Shu who spoke of mercury and sought its method of extraction. In the *gengzi* year, he encountered a Daoist Chen from the Eastern Capital, who transmitted to Fangwen the *Elixir Scripture* on lead and mercury. In the *guimao* year, he met Master Wang from the Hebei region and a Daoist Shu from the capital, and he paid respects to the scholar Wang of his hometown to study the *Can Tong Qi*’s elixir furnace, lead, mercury, and fire timing. Last year, while serving as an official in Chongren, he met a senior disciple of Master Wang of Jiangzhou, who transmitted the method of the Fire Elixir in great detail. He has already reported this to the Most High, formed a bond with fellow elixir companions, and discussed fire timing in meticulous detail. Since fire timing is not established in writing, it is preserved only in oral instructions.",
      "overlap_context": "lly request annotation.\n\nFangwen presents his inquiry: This is the method of severance in elixir refinement. Later generations, relying on their cleverness, have fabricated false and erroneous teachings, misleading later students so that they ultimately fail to succeed. They do not understand that *\"the tip of the blade\"* refers to gold within Water, and *\"the two horns\"* to Wood within Fire. Only by Wood entering Fire can Water boil. *\"The mid-autumn eighth month\"* refers to the number fifteen.",
      "start_char": 2514,
      "end_char": 3739,
      "start_sentence": 169,
      "end_sentence": 233,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.76811122894287,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\灵宝净明黄素书释义秘诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "今告真师，次其是非端的。 令方文无疑，欲择庚戌年下功，成就大药，伏望真师辅佐教诲。 方文今默问火侯事乞，报应详示。 方文呈覆。 未得门庭，空多差路。 事非奇异，未欲尽言。 只如采取之法，须问采何药？ 可见不可见？ 可闻不可闻？ 或不见闻，或须见闻，只在一二。 火候之法，周天火候。 炼形之诀，不足以成金丹。 如欲成丹，须辨丹中之火候，下手亦有术。 要知心上事，须向肾中推。 肾中有真火，铅鼎生金液。 何谓铅鼎生金液？ 木生火，金生水。 水火，夫妇之用。 金木，父子之用也。 有父子，然后有家。 何谓有家，脾中之丹也。 然求夫妇，必能相克。 非相克，不能相治。 非相治，不能相生。 欲知其术，只在一二。 一二之说，更细思之。 可且讲此一端，其中未有晓者，无惜以喻。 方文禀问下项： 一、剑诀中如何是金木相克日起乎？ 此后日日存想，不知在甚时？ 或无时候？",
      "translated_text": "Now, I humbly report to the True Master to discern the right from the wrong, that Fangwen may proceed without doubt. I intend to commence the work in the *gengxu* year to accomplish the Great Medicine, and I earnestly hope the True Master will assist and instruct me.\n\nFangwen now silently inquires about the matter of fire timing and seeks a detailed response.\n\nFangwen respectfully submits:\nWithout entering the gate, one wanders lost among many divergent paths. The matter is not extraordinary, yet I dare not speak of it in full. Take, for instance, the method of extraction—one must ask: what medicine is to be gathered? Is it visible or invisible? Audible or inaudible? Some require neither sight nor sound, while others demand one or the other—all hinges on a single principle or two.\n\nAs for the method of fire timing, it pertains to the fire timing of the celestial cycle. The secret of refining form alone is insufficient to complete the Golden Elixir. To achieve the Elixir, one must distinguish the fire timing within the Elixir itself, and the technique of application also exists. To know the affairs of the heart, one must seek them in the kidneys. Within the kidneys lies true fire, and the lead tripod gives birth to golden liquid.\n\nWhat does it mean for the lead tripod to give birth to golden liquid? Wood gives birth to fire, metal gives birth to water. Water and fire are the functions of husband and wife; metal and wood, the functions of father and son. Only with father and son can there be a household. What is a household? It is the Elixir within the spleen.\n\nYet to seek husband and wife, they must be able to overcome one another. Without overcoming, there can be no governance; without governance, there can be no generation. To know this technique, it rests upon one or two principles. Reflect deeply upon these one or two principles.\n\nFor now, let us discuss this single aspect. If there is anything not yet understood, do not hesitate to clarify.\n\nFangwen respectfully inquires on the following points:\n1. In the sword technique, how does one determine the day when metal and wood overcome one another? Thereafter, should one contemplate it daily—yet at what time? Or is there no fixed occasion?",
      "overlap_context": " Wang of his hometown to study the *Can Tong Qi*’s elixir furnace, lead, mercury, and fire timing. Last year, while serving as an official in Chongren, he met a senior disciple of Master Wang of Jiangzhou, who transmitted the method of the Fire Elixir in great detail. He has already reported this to the Most High, formed a bond with fellow elixir companions, and discussed fire timing in meticulous detail. Since fire timing is not established in writing, it is preserved only in oral instructions.",
      "start_char": 3739,
      "end_char": 4094,
      "start_sentence": 234,
      "end_sentence": 264,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.303757905960083,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\灵宝净明黄素书释义秘诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "或只遇金火日存想，夜间如何？ 一、金水相生日起手铸。 惟复日日铸，有无时侯，夜间如何？ 一、如何养一年？ 一、如何磨剑？ 一、金水水相生日，如何是？ 一、诀尾有心授之语。 相克相生，谓之支干相生相克之日。 心授，乃隐诀。 用之，从师所指，秘术也。 方文行丹景道精隐地八术，内玉皇道君正讳、隐名不同，及不识天篆。 欲问下项： 一八宫玉皇正讳。 艮宫曰太器。 震宫曰幽窕。 或曰幽寥。 巽宫曰无英。 离宫曰伯史。 坤宫曰运珠。 兑宫日二仪。 或曰二义。 乾宫曰元辅。 坎宫曰阴精。 一紫清帝君。 音明　 音霆 音灵 实名虽不同，然八宫，皆北斗玉皇君之隐讳，各随其所在而用之，如金在石为矿，在镕为之丹。 方文欲问，召使玉女有何捷法？ 六丁玉女名字，与符多不同，欲乞教诲。 玉女之法，皆出一宗，然诚者易感。 今法之无讹谬者，莫先於《白猿经》。 灵宝浄明黄素书释义秘诀竟",
      "translated_text": "Should one contemplate only on the days when metal and fire interact—what of the nights? Secondly, on the day when metal and water generate one another, one begins forging. Yet if forging daily, is there a fixed time, or none? And what of the nights? Thirdly, how does one nurture for a full year? Fourthly, how does one grind the sword? Fifthly, on the day when metal and water generate one another through water, what is the method? Lastly, the oral instructions at the end of the technique speak of heart-transmission.\n\nThe overcoming and generation of one another are called the days when stems and branches mutually generate or overcome. Heart-transmission is the hidden technique. Its application follows the master’s guidance—it is a secret art.\n\nFangwen practices the Eight Hidden Arts of the Dao of the Cinnabar Landscape, yet within them, the true names and hidden titles of the Jade Emperor Dao Lord differ, and the celestial script remains unrecognized. The following questions are posed:\n\n1. The true names of the Jade Emperor in the Eight Palaces:\n   - Gen Palace: Great Vessel\n   - Zhen Palace: Dark and Remote (or Dark and Desolate)\n   - Xun Palace: Without Heroism\n   - Li Palace: Earl Shi\n   - Kun Palace: Moving Pearl\n   - Dui Palace: Two Principles (or Two Polarities)\n   - Qian Palace: Primordial Assistant\n   - Kan Palace: Yin Essence\n\n2. The Purple Clarity Emperor Lord:\n   - Pronounced *Ming*\n   - Pronounced *Ting*\n   - Pronounced *Ling*\n\nThough the actual names differ, the Eight Palaces all refer to the hidden titles of the Jade Emperor of the Northern Dipper. Each is employed according to its position, just as metal in stone is ore, yet when smelted, becomes elixir.\n\nFangwen further inquires: Is there a swift method to summon the Jade Maidens? The names of the Six Ding Jade Maidens and their talismans vary greatly—guidance is sought.\n\nThe methods of the Jade Maidens all derive from a single source, yet sincerity makes them easier to invoke. Among the unerring methods of today, none surpass *The White Ape Classic*.\n\nThe secret oral instructions on the esoteric meanings of the *Yellow Register of the Numinous Treasure Pure Clarity* are now complete.",
      "overlap_context": "there can be no generation. To know this technique, it rests upon one or two principles. Reflect deeply upon these one or two principles.\n\nFor now, let us discuss this single aspect. If there is anything not yet understood, do not hesitate to clarify.\n\nFangwen respectfully inquires on the following points:\n1. In the sword technique, how does one determine the day when metal and wood overcome one another? Thereafter, should one contemplate it daily—yet at what time? Or is there no fixed occasion?",
      "start_char": 4094,
      "end_char": 4490,
      "start_sentence": 265,
      "end_sentence": 295,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.706342458724976,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\灵宝净明黄素书释义秘诀.txt",
        "category": "方法类"
      }
    }
  ]
}