{
  "source_id": "灵宝半景斋仪",
  "source_file": "chunked_daozang\\灵宝半景斋仪.json",
  "total_chunks": 9,
  "total_original_chars": 6879,
  "total_translated_chars": 45663,
  "total_translation_time": 233.59801411628723,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\灵宝半景斋仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**Lingbao Half-Day Retreat Ritual**\n\n*Scripture Title:* *Lingbao Half-Day Retreat Ritual*. One fascicle.\n*Source Text:* *Zhengtong Daoist Canon*, *Dongxuan Section*, *Weiyi* (Ritual Propriety) category.\n\n**Lingbao Half-Day Retreat Ritual**\nFrom dawn to noon is called the \"half-day.\"\n\n**Dawn, First Audience**\nFirst, open the gates and declare intent.\nNext, recite the *Changdao* and *Huaxia Hymn*, leading to the Earth Gate.\nThen, each pays homage to the master, visualizing the union as prescribed.\nNext, recite the *Guardian Spirit Mantra*.\nThen, strike the ritual drum twenty-four times.\nNext, kindle the incense burner.\n\n*\"Supreme Three Heavens, Mysterious Primordial Three Qi, Most High Lord Lao, summon forth from within the bodies of us, your assembled officials, the Three and Five Merit Officers, Left and Right Envoys, Left and Right Fragrant-Bearing Dragon-Riding Couriers, Golden Lads of Incense, Jade Maidens of Transmission, and the Thirty-Six Fragrant Officials of the Five Thearchs’ Direct Attendants for this day. Dispatch them to report to the local earth deities and true officials of this domain. We now burn incense and humbly serve the Great Dao’s disciple [Name], who establishes this wondrous Lingbao Half-Day Retreat, praying for grace, repenting sins, atoning for transgressions, dispelling calamities, safeguarding peace, and seeking blessings. May the Primordial Qi of the Most High’s Ten Directions and True Perfected Ones descend into our bodies and that of the retreat’s sponsor, so that our petition swiftly ascends before the August Jade Emperor of the Supreme, Boundless, and Utmost Dao.\"*\n\nNext, each declares their ritual rank.\n\n*\"We, your servants [Names], with utmost sincerity, jointly petition: the Heavenly Worthy of the Golden Portal of Emptiness and Spontaneity, the Boundless Great Dao, the Supreme Lord of the Great Dao, the Most High Lord Lao, the August Jade Emperor, the Host of Great Sages who have attained the Dao in the Ten Directions, the Perfected and Numinous Heavenly Worthies of Lingbao, the Thirty-Two Heavenly Thearchs, the Jade Clarity Highest Emperor, the Great Emperor of the Jade Capital, the Eastern Florescence, Southern Culmen, Western Numinosity, Northern Perfection, the Seven Jeweled Mystic Terrace of the Purple Tenuity’s Upper Palace in the Golden Portal of the Jade Metropolis, the Perfected and Illustrious Sovereign of Lingbao, the Great Dharma Master of the Mystic Center, the Northern Culmen Emperor, the Three Officials of Heaven, Earth, and Water, the Nine Heavens’ True Lords of Life Mandate, the Nine Heavens’ Messenger True Lords, and all the numinous officials of the Three Realms.\"*\n\nWe have heard that the Great Dao is nameless, yet we reluctantly invoke its ineffable teachings.\nThe Heavenly Worthy manifested in the world to uniquely open the gate of the Orthodox Dharma.\n\nThus the Jade Measures are proclaimed and the Golden Precepts unfold transformation. Since the path of supplication is established, the mechanism of responsive resonance is thereby revealed. We disciples, having received our learning through our masters, have presumptuously transmitted these rites. For all who turn in faith toward the Dao, it is necessary to display images and manifest dignified presence. To guide sincere devotion, we first present our written petitions. Next, the petitions are read—all as set forth in the memorial, that the sagely Dao may be made known.\n\nWe prostrate ourselves and reverently reflect: the Most High Three Worthies shed their radiant light in witness, O fasting master and disciples. We have heard that the Mysterious Origin established teachings ever skillful in delivering humankind. The true wind of the Most High, vast in compassion, extends to all beings. It delivers those of earnest heart to blessed goodness, and receives those who turn toward adornment and reverence. When we received the Dharma, we were bound by its graded progression. We meditate upon the Jade Thearch in reverent posture, and pray for the true sages to descend and attend. Now, therefore, we burn incense, surrendering body, spirit, and life to the Ten Directions’ Boundless Most High Numinous Treasure Spontaneous Heavenly Worthy, beseeching that the Dao altar be graced with presence and receive these offerings. May You heed our petition and bestow Your luminous grace, that the fasting master and disciple, so-and-so, may attain perfect fruition of blessings and accomplish merit. May past transgressions be repented, and future good fortune be sought. May household and kin enjoy peace, and public and private affairs flourish. May the nine ancestral lines and seven generations partake in the merit and roam freely; may the local earth gods and dragon spirits receive the numinous favor and lend their protection. Now, therefore, we burn incense and take refuge in the Great Sage Assembly, the virtue of the Perfected and True. After attaining the Dao, may we ascend into the formless and unite with the Dao as true reality.\n\nNext, the obeisance to the directions.\nNext, the confession.\n\nWe prostrate ourselves and have heard: the Great Dao is reluctantly named, and the Heavenly Worthy answers to the title. Enthroned above the Golden Portal and Jade Metropolis, You behold the ten directions and the three realms. You illumine all beings with the light of sun and moon, and nourish all creatures with the qi of the four seasons. To all who make supplication, You respond according to their wishes. At this time, the fasting master and disciple, so-and-so, humbly present this vermilion memorial, revealing it to the Mysterious Master. We request the establishment of a Dao altar and the performance of the fasting rites. We pray for the true ones to be invoked and descend to the incense banquet. We bow our heads to the Heavenly Worthy and take refuge in repentance.\n\nWe fear that from beginningless kalpas until now, the disciple, so-and-so, together with parents, ancestors, and all kin, have committed the three karmic offenses of body, speech, and mind, amassing the three thousand transgressions; the six senses have become the six thieves of wrongdoing. In this life and in past existences, sins and faults abound. Today, in establishing this fast and repenting, we reverently worship the Ten Directions’ Boundless Most High Numinous Treasure Heavenly Worthy. May our sins be extinguished and blessings arise; may transgressions vanish and faults cease. May our years return to virtuous longevity, and our lives be prolonged and flourish. May the nine ancestors ascend to heaven, and the entire household enjoy prosperity. May misfortune sink before it appears, and fortune arise anew. We bow our heads and take refuge in the Orthodox Three Treasures.\n\nNext, the Threefold Invocation and Hymn.\nNext, the Threefold Obeisance.\nNext, the Recitation of Names and Titles.\n\nWe, the ritual officers of duly ordained rank, most reverently and solemnly address our supplication to the Supreme Boundless Dao, the Most High Dao Lord; the Most High Lord Lao; the August Jade Emperor on High; the Supreme Mysterious Elder; the Great Sage Hosts of the Ten Directions who have attained the Dao; the Perfected, Numinous Treasure Heavenly Worthy; the Thirty-Six Divisions of Venerable Scriptures; the Great Dharma Masters of the Mysterious Center; the Three Officials of Heaven, Earth, and Water; and all the majestic numina of the Three Realms’ official retinues.\n\nWe, your servants, have received the transmission of scriptures and registers from our masters, donning the robes of our lineage. First, we pledge to establish fasts in the dusty world and perpetually turn the Wheel of the Dharma. Thereafter, we dedicate ourselves to cultivating the Real, preserving the Three and guarding the One. Whenever beings of the human and heavenly realms seek deliverance, we must adhere to the prescribed rituals. We prepare and disclose the altar precincts, adorn and array the sacred images, and fully present the intent of this fast, submitting our petition for celestial audience. The patron’s petition has already been recited aloud. Alongside the ritual offerings, we now unfold our plea in hope of grace.\n\nWe prostrate ourselves in awe of the Supreme Void Emperor, the Self-So Venerable Lord, who gazes upon the azure vault with divine regard and illumines the sincere crimson hearts of those who supplicate. May the merit of this fast be perfectly accomplished in its entirety, and may the fruits of blessings be fully bestowed with manifest clarity. May the radiant grace of boundless kindness dispel ten thousand calamities, and may the descent of numinous beneficence dissolve a thousand disasters and utterly extinguish them.\n\nWe humbly pray that the fast’s patron may enjoy bodily peace and destiny’s prosperity, with fortune and emolument ever increasing in glory. May all family members—women and men alike—be endowed with luminous longevity. May the ninefold ancestors and sevenfold forebears, along with the three generations of household ancestors, receive the fast’s blessings and roam freely, each ascending to heaven in sovereign ease. May the dragon deities of the dwelling, the local earth gods, the city gods, and the numina of temple sanctuaries all partake in the merit of this offering and supplication, and may they each assist in the virtue of good affinities. Thus shall the vast compassion of the Heavenly Worthy on high be made manifest, and the sincerity of our refuge below be duly answered.\n\nRespectfully submitted.\n\nNext, the Ten Recitations.\n\nNext, the Rekindling of the Incense Burner.\nNext, the Hymn to the Young Immortals.\nNext, the Hymn of Dedication concluded, the dispersal follows the usual rite.\n\nAt dawn, the second audience begins.\nFrom the chanting of the *Dao* to the kindling of the incense burner, all proceeds as before, save that the *Incantation for the Guardians of the Sacred* is not recited.\n\nThe Most High Three Heavens, the Primordial Origin of the Three *Qi*, the Supreme Lord Lao, summon forth:\nFrom within the bodies of us, your servants, emerge the Three and Five Merit Officers, the Left and Right Attendant Envoys, the Left and Right Incense-Bearing Courier Dragon Riders, the Golden Lads of Incense, the Jade Maidens of Transmission, and the Five Thearchs’ Direct Attendants and Daily Incense Officers—thirty-six of each.\n\nWe invoke the local earth gods and territorial deities, the true officials and rightful spirits of this place.\nWe now burn incense in offering for the Great Dao’s disciple, so-and-so, who has established this half-day wondrous fast of the Numinous Treasure, beseeching grace, repenting sins, entreating blessings, and dispelling calamities.\nMay the primordial *qi* of the Most High’s Ten Directions and True Beings descend and flow into the bodies of us, your servants, and the fast’s sponsor, the disciple.\nMay our supplication swiftly ascend and reach the presence of the Most High, Boundless, and Great Dao’s Jade August Thearch.\n\nNext, each declares his name and rank.\n\nWe, your servants, so-and-so and company, with reverent sincerity jointly proclaim:\nTo the Void and Spontaneous Golden Portal Heavenly Worthy of the Boundless Great Dao, the Supreme Lord of the Great Dao;\nTo the Supreme Lord Lao;\nTo the August Jade Thearch on High;\nTo the Ten Directions’ Great Holy Assemblies who have attained the Dao;\nTo the Perfected and Numinous Treasure Heavenly Worthies;\nTo the Thirty-Two Heavenly Thearchs;\nTo the Jade Void Supreme Thearch;\nTo the Jade Thearch and Great Thearch;\nTo the Eastern Florescence, Southern Culmen, Western Numinosity, Northern Perfection, and the Purple Tenuity’s Upper Palace of the Seven Jeweled Mystic Terrace in the Jade Capital and Golden Portal;\nTo the Perfected and Numinous Radiant August Lord of the Dao;\nTo the Great Dharma Master of the Mystic Center;\nTo the Northern Culmen Thearch;\nTo the Three Officials of Heaven, Earth, and Water;\nTo the Nine Heavens’ Controller of Destiny Perfected Lords;\nTo the Nine Heavens’ Messenger Perfected Lords;\nTo all the mighty numina of the Three Realms’ palatial retinue.\n\nWe have heard:\nThe Great Net is empty and still, its midst divided into the Nine Voids.\nIt encompasses the myriad heavens, yet alone attains the ultimate of the Dharma King.\nThe Dharma Wheel turns in the heavens above, the true teachings flow among humankind.\nThe Precious Lineage is transmitted in succession, the Mystic Wind spreads far and wide.\nThe Jade Statutes of the Nine Perfected are established, the Golden Precepts of the Seven Sages are cultivated.\nThrough this fast’s petitions, we enter the gate of the Dharma’s rites.\nThus have we, your servants, early received our masters’ teachings, received registers, and transmitted scriptures.\nFirst, we nurture the mind of salvation and deliverance, answering the prayers of humans and gods.\nHaving received the memorial, we now duly present it for your hearing.\n\nNext, the memorial is read.\nAs set forth in the memorial, may the Mystic Insight deign to take note.\nWe prostrate ourselves, trusting that the Three Supreme Worthies’ sagely compassion will illumine and regard our earnest supplication, bestowing undeserved grace.\nWe, your servants, having purified body and mind, reverently perform this invocation.\nMay the true sages descend from the Nine Heavens above, and the Heavenly Worthies be venerated within the Ten Poles.\nThe fast’s sponsor, so-and-so, has prepared incense and flowers, solemnly arraying the offerings.\nNow, as the golden cock crows at dawn and the jade clepsydra nears its end,\nwe unfold this rite’s majesty, conducting the Dao in accordance with the Three Times.\nWe beseech grace with devotion, entreat blessings with diligence.\nHaving presented the first incense, we first offer the longevity of Yao’s virtue.\nAs we kindle this first pinch of incense, we offer it to the Jade Clarity’s Sacred Realm, the Primordial Heavenly Worthy.\nMay this merit be first dedicated to the benefit of His Majesty, the present Emperor.\nWe prostrate ourselves, praying:\nMay his precious throne endure as long as heaven, his august position last as long as earth.\nMay his sagely brilliance equal the sun and moon’s radiance, his imperial transformation parallel that of Tang and Yu.\nMay he share the Northern Asterism’s virtue, his southern-facing rule shine forever.\nMay he ride the luminous destiny for a thousand years, spreading the fragrant breeze across ten thousand lands.\nMay the princes and imperial sons be as steadfast as bedrock.\nMay the generals, ministers, and feudal lords secure and pacify the altars of state.\nMay the times be abundant, customs prosperous, the realm at peace.\nMay no disasters arise, the people be secure, and all things flourish.\n\nNow, therefore, we burn incense, taking refuge in the virtue and power of our revered masters, the great sages and perfected beings, that after attaining the Dao, they may ascend into formlessness and unite with the Dao in truth.\n\nWe are told that the twin offerings of incense and flowers rise and sway before the Three Clarities; that blessings manifest in the present, their fragrance reaching back to purify nine generations of ancestors. The households that accumulate goodness first honor their forebears, and their descendants inherit the overflowing blessings of remembrance.\n\nWe now offer this second pinch of incense, dedicating it to the Most High Perfected Realm of the Numinous Treasure Heavenly Worthy of the Void and Sovereign. May this merit be respectfully presented for the sake of the host of this ritual, their nine generations of ancestors, sevenfold lineage, and three generations of family forebears. We humbly fear that our parents, bound by karmic conditions, have committed manifold transgressions, yet to escape the three evil destinies, the five sufferings, or the sins of sinking into ten thousand kalpas of perdition. We pray that, by virtue of this repentance, all may be cleansed and absolved. May they dwell in realms adorned with crowns and sashes, in heavens of carefree ease. May blessings shade the household, and descendants shine in glory.\n\nNow, therefore, we burn incense, taking refuge in the virtue and power of our revered masters, the great sages and perfected beings, that after attaining the Dao, they may ascend into formlessness and unite with the Dao in truth.\n\nWe are told that the triple offering of finest incense reaches the golden palaces of devout hearts; that its fragrant smoke scatters jade-like blossoms, filling the ten directions in offering. The time for seeking blessings must surely bring response; the fruits of supplication will surely evoke resonance.\n\nWe now offer this third pinch of incense, dedicating it to the Jade Emperor of the Supreme Clarity’s Immortal Realm, the Heavenly Worthy of the Great Ultimate. May this merit be respectfully employed for preservation. For the host of this ritual, we humbly pray that the true numina descend in protection, dispelling the three disasters of the world; that the qi of the Dao guard and sustain, delivering humanity from the nine calamities. May past transgressions be pardoned, future offenses forgiven. May lifespan be extended, years of life prolonged. May fortune and emolument bring joy in all four seasons, and official glory attain the highest ranks. May all kin, male and female, enjoy health and peace. May the land rejoice in the labors of farming and sericulture, and the markets abound with the wealth of a hundred goods. May the earth gods and dragon spirits together lend their hidden support.\n\nNow, therefore, we burn incense, taking refuge in the virtue and power of our revered masters, the great sages and perfected beings, that after attaining the Dao, they may ascend into formlessness and unite with the Dao in truth.\n\nNext, we pay homage to the directions.\nNext, we perform repentance.\n\nI have heard that when the Jade Emperor assumes his august throne, even the most solemn demeanor is but a humble guise. His vast compassion makes heaven and earth perfectly responsive, and his boundless forgiveness grants the gods their expedient means. All sentient beings who commit transgressions may dissolve them through repentance; long-accumulated faults, once confessed, are all wiped clean as snow.\n\nNow, the fasting master and disciple [Name] takes refuge in the Great Dao and reverently observes this pure fast. Bowing his head to the Heavenly Worthy, he surrenders his life in repentance, fearing that the six senses have given rise to offenses and the three karmic actions have become transgressions. He dreads the calamities of this world and fears the nine perils of mortal existence. Moreover, he fears that past-life misdeeds may now bring retribution, that the taking of life and killing of beings may have created karmic creditors and enemies. From countless kalpas past, from parents and kindred, the roots of immeasurable sins are too numerous to fully declare.\n\nToday, in establishing this fast, he repents with utmost sincerity, reverently paying homage to the Heavenly Worthies of the Ten Directions, the Boundless, the Most High, and the Numinous Treasure. He beseeches the forgiveness of a thousand faults and ten thousand sins, of deep-seated offenses and grievous enmities, that the blazing sun of grace and majesty may melt them like frost and snow. May his years be filled with increasing virtue and goodness, and may he daily be spared from misfortune and calamity. May his household enjoy peace and well-being, and may his person be blessed with prosperity. May his departed ancestors attain the good fruit and roam freely; may the earth gods and dragon spirits protect both public and private realms with purity and auspiciousness. May disasters sink into the nine nights, and may blessings arise from the ten directions.\n\nBowing his head, he takes refuge in the Orthodox and True Three Treasures.\n\nNext, the Three Petitions are presented, with the solemn recitation of names and titles as before.\n\nYour humble servants [Names] now reverently submit this petition, addressing the Most High, Boundless, and Perfectly True Jade Emperor of the Great Dao; the Most High Lord Lao; the True Lords and Envoys of the Nine Heavens; the Thirty-Six Divisions of Venerable Scriptures; the Great Dharma Masters of the Mysterious Center; and all the numinous officials of the Three Realms.\n\nI have heard that the majesty of the Dao and its virtue is so towering that its myriad wonders cannot be fathomed, and that the vastness of the Dragon Han kalpa is such that the true cannot be distinguished. When the Heavenly Worthy descended his decree from the Floating Radiance Heaven, the realm of the Dharma Wheel was set in motion. First transmitted in the heavens, it gradually descended to the human world. Master and disciple passed it down, and the Dharma teachings spread ever wider.\n\nHaving received these luminous instructions, I assist in promoting the true wind. First, I aspire to extend compassion to the world; later, I dedicate myself to the path of cultivation. Whenever there are matters of human or heavenly petition, it is necessary to establish an altar. The Most High is invoked within the Dharma assembly, and petitions are composed and presented. The intent of the fast is declared, making it known on high.\n\nThe written petition of the fasting master has already been revealed. We humbly beseech the Jade Emperor, the Great Dao, and the Heavenly Worthy of the Golden Portal to cast their merciful gaze upon this sincere offering and to hear the proclamation of this petition. We earnestly pray that the fasting master [Name] be absolved of the karmic obstacles of this present life and that past transgressions be dissolved. May he be granted the mysterious grace of the Eight Effulgences and inscribed with the virtuous blessings of the Nine Heavens. May his emolument be extended by the Southern Dipper and his lifespan increased by the Eastern Flower. May his household enjoy peace, and may each member’s years be prolonged. May the three calamities be averted in the months and years, and the nine perils dispelled from his fate. Moreover, we pray that the spiritual forms of his seven ancestors and the consciousness of his departed kin, along with all those aided by this retrospective merit, may together receive the benefit of liberation. May each attain freedom and rebirth, dwelling eternally in joyous abodes.\n\nMay the dragon spirits, the prohibitions of the earth, the city gods, the tutelary deities, and the numinous spirits of the temple sanctums all share in the grace of this petition and together exert their protective power. Thus, the vast compassion of the Heavenly Worthies on high will be made manifest, and the sincerity of our surrender below will be duly answered.\n\nRespectfully submitted.\n\nNext, the Twelve Vows are dispersed as in the usual rite.\n\nAt the third morning audience of the Si hour, the recitation proceeds from \"The Dao is sung\" to the \"Incense Offering,\" following the previous method, omitting only the invocation of the Guardian Deities of the Numinous.\n\nTo the Most High Three Heavens, the Primordial Three Qi of the Mysterious Origin, the Supreme Lord Lao:\n\nSummon forth from within the bodies of us, your servants, the Three and Five Merit Officials, the Left and Right Attendants, the Left and Right Fragrance-Bearing Dragon-Riding Couriers, the Golden Lads of Incense, the Jade Maidens of Transmission, and the Fragrance Officials of the Five Thearchs on duty for the day—thirty-six of each—let them emerge.\n\nNotify the local earth deities and the true officials of this domain.\n\nWe now burn incense in this very moment, offering it on behalf of the disciple of the Great Dao, [Name], who is conducting the wondrous half-day fast of the Numinous Treasure, performing the threefold Dao-cultivation to pray for grace, repent sins, seek blessings, and dispel calamities.\n\nMay the Primordial Qi of the Ten Directions’ True and Upright Ones descend and flow into our bodies, that our petition may swiftly ascend and directly reach the presence of the Supreme Jade Thearch, the August Emperor of the Boundless and Utmost Real.\n\nNext, each declares their name and rank.\n\nWith reverent sincerity, we, your servants of the dharma-rank, jointly submit this petition to the Supreme Void Sovereign, the Golden Gate Heavenly Worthy; the Supreme True August Worthy of the Boundless Heaven; the August Jade Thearch of the Supreme Ultimate Heaven; the Supreme Jade Clarity Lord of the Great Dao; the Supreme Mysterious Origin Lord Lao; the Great Sage Hosts of the Ten Directions who have attained the Dao; the Utmost Real Lords and Masters; the Thirty-Three Heavenly Emperors; the Jade Void Highest Thearch; the Great Jade Emperor; the Eastern Florescence, Southern Culmen, Western Numinous, and Northern True Realms; the Seven-Treasured Mystic Terrace of the Jade Capital and Golden Gate; the Purple Tenuity Supreme Palace; the Numinous Treasure Utmost Real Radiant August Lord of the Dao; the Great Dharma Master of the Mysterious Center; the True Lords of the Nine Heavens’ Life Mandate; the True Lords of the Nine Heavens’ Envoys; the Northern Culmen Great Emperor; the Three Officials of Heaven, Earth, and Water; and all the true numina of the Three Realms, the named mountains, and the grotto-heavens.\n\nWe have heard that before the vast emptiness, there was nothing in the void. Yet once the Qi of spontaneity coalesced, it was forcibly named the Great Dao. Thus, the undifferentiated dispersed and the elements separated, giving rise to heaven and earth. The wondrous preceded the manifest, and the numinous brought forth great illumination. Emperors were established, and the Three Dukes appointed; masters and disciples emerged to propagate the teachings. From this, true scriptures descended to the world, and precepts and regulations were proclaimed. Amidst the boundless sea of desire, they became boats and oars; upon the vast river of attachment, they served as bridges. They rescued sentient beings from the gate of the Eight Sufferings and delivered them from the calamities of the Three Disasters. The fasts were widely established to specially aid humans and devas. We, though unworthy, hold office in the mysterious precepts and are charged with spreading these vows. Whatever is requested with sincere faith is presented in full through the written petition.\n\nNext, the petition is read.\n\nAs fully set forth in the petition, the circumstances and reasons are thoroughly stated. The host of sages has already heard; we earnestly beseech with utmost devotion.\n\nWe humbly implore the Great Dao of the Void Sovereign, the Most High Compassionate Worthy, to perceive the minds of the worldly and deign to heed our plea.\n\nWe have heard that the Heavenly Worthy, though quiescent and unmoving, manifests form within the Three Realms; the mysterious virtue, responsive to feelings, answers the prayers of all beings. The disciple [Name], master of the fast, specially employs this ritual to reverently address the true numina. The rising incense wafts like drifting blossoms; the offerings are set forth as fragrant delicacies. We, your servants, reverently perform this petition, hoping it may reach the heavens above. Having received the grace of illumination, protective power will surely descend.\n\nWith the first pinch of incense, we offer it to the Golden Gate Heavenly Worthy of the Vast and Empty Great Dao.\n\nMay this merit be dedicated first to the master of the fast, and secondly to the present Emperor, may he live ten thousand years. We humbly pray that his sacred person may endure for myriad ages, his precious throne for countless springs; that his great brightness may equal the sun and moon, his eternal longevity match heaven and earth. Governing with effortless grace, he may fathom the mysteries of the unseen; ruling with serene dignity, he may harmonize the felicitations of the Hua Hills. May the imperial princes and sons shine like jade trees in the dragon towers; may the civil and military ministers illuminate their meritorious names upon the Unicorn Pavilion. May the balmy breeze spread far, and the pure transformation flow widely. May the realm know peace, the people health, and customs abundance.\n\nNow, therefore, we burn incense and take refuge in the virtue of the Great Sage Hosts, the Utmost Real and True.\n\nAfter attaining the Dao, may we ascend into the formless and unite with the Dao in truth.\n\nWe have heard that the power of the Dao is formless, and merit is but a forced name. Yet the heavy sins of life and death can be dissolved through dedication. It is fitting to hold the second pinch of incense and dispel the sufferings of the Nine Ancestries.\n\nWith the second pinch of incense, we offer it to the Host of Sages of the Boundless Great Dao.\n\nMay this merit be dedicated to the family of the master of the fast, to the departed and transformed ancestors, the seven generations of forebears, the nine lineages of ancestry, the three generations of souls, and all the clan members. We humbly pray that the sufferings of the Three Wretched Paths be absolved, and that they ascend to the halls of the Ten Felicities. May they traverse the Eight Effulgences with ease and attain the Six Penetrations in freedom. May they face the True Emperor and behold the Dharma King. May blessings extend to the living, and felicity flow endlessly.\n\nNow, therefore, we burn incense and take refuge in the virtue of the Great Sage Hosts, the Utmost Real and True.\n\nAfter attaining the Dao, may we ascend into the formless and unite with the Dao in truth.\n\nWe have heard that the wondrous form of the Heavenly Worthy is adorned through the forms of the mundane; the formless Great Dao establishes teachings through the minds of the worldly. To descend the blessings of the Nine Heavens, it is fitting to raise the third pinch of incense.\n\nWith the third pinch of incense, we offer it to the Supreme Heavenly Worthy of the Mysterious Origin Great Dao.\n\nMay this merit be dedicated to protecting and sustaining the master of the fast.\n\nWe humbly pray that the mysterious grace be bestowed, that the Eastern Florescence may enhance the life span in the Palace of Destiny; that the numinous favor may flow down, and the Southern Dipper extend life in the Station of Emolument. May the Mountain of Longevity rise ever higher, and the Sea of Fortune grow ever deeper. In office, may he attain the highest rank among ministers; in glory, may his splendor illuminate the nine clans. In private life, may he enjoy peace in all his movements; throughout the year, may his years and destiny know health and prosperity. May all members of his household, high and low, male and female, each emulate the integrity of pine and bamboo, their countenances as steadfast as metal and stone. May a thousand disasters vanish like clouds with repentance, and ten thousand misfortunes scatter like rain through the fast. May his dwelling be tranquil, his wealth and silk abundant. May silkworms yield eightfold threads, and fields yield ninefold grains. May all endeavors succeed, and markets teem with activity. May even the dark spirits of the Six Paths partake of the remaining blessings.\n\nHere the incense is burned, and I take refuge in the virtue and power of the Most Venerable Masters, the Great Sages, and the Perfected Ones. After attaining the Dao, I ascend into the formless and unite with the Dao in truth.\n\nNext, I bow to the directions.\nNext, I confess my transgressions.\n\nI have heard that among the many faults of life, none is greater than yielding to desire; in the birth of the Dao from tranquility, no blessing accumulates more than good affinity. Thus, the Three Calamities arise from the Three Karmas, and the Nine Tribulations follow the Nine Orifices. Since there is the affliction of the Six Roots, the Four Great Elements coalesce into this body. Amidst the vast expanse of birth and death, within the tumult of love and greed, we rely on the weariness of the gods in saving the world, their teachings spreading through many gates. The fast’s dharma is widely proclaimed, rescuing those sunk in delusion.\n\nThe patron of this fast takes refuge in the Great Dao and establishes the dharma assembly. Bowing to the Heavenly Worthy, I wholeheartedly confess. I fear that in my past and present lives, in my conduct and deeds, I have accumulated transgressions as deep as the sea and as high as the mountains. Today, I set up this fast to offer repentance, reverently bowing to the Heavenly Worthies of the Ten Directions, the Boundless, the Most High, the Numinous Treasure.\n\nI only wish that by the radiant grace of their numinous power, unwarranted disasters and anxieties may be swept away. May my years be enriched with fortune and longevity, renewing my destiny. May I invoke blessings and extend my years. May my seven generations of ancestors, now departed, each attain carefree wandering. May all those present, high and low, enjoy health and peace. May misfortunes dissolve like ice, and blessings flow like rivers. Bowing in refuge, I take the Three Treasures as the true and correct.\n\nNext, the Three Petitions are presented, with the solemn recitation of titles as before.\n\nThe officiant, your humble servant [Name], respectfully presents this petition, addressing all the numinous hosts of the assembly.\n\nWe, your servants, have inherited residual blessings from past lives and planted the seeds of faith through countless kalpas. Emerging from the dust of desire and affliction, we enter the dharma realm of the true masters. Between heaven and earth, we are successively uplifted. Who can discern the false from the true, or fathom the comings and goings of the ordinary and the sacred? The wondrous scriptures of immortals, the teachings, precepts, and rituals—first, they expand the heart of salvation for the world; later, they guide the path of cultivation. Whenever humans and gods seek blessings, it is necessary to report to the dharma assembly. We invoke the August Emperor in the vastness of the void and descend the Most High into the altar.\n\nNow, the patron [Name] has prepared this petition and established this wondrous fast. Having already presented the Three Petitions, we hope to fulfill the complete rites. We offer incense, flowers, lamps, candles, fruits, and delicacies with sincerity. Gazing upon the revered images, we pour out our hearts, exhausting worldly sentiments in devotion.\n\nMay these merits be dedicated to preserving and upholding [the patron]. The patron [Name] humbly prays: may the mountain of longevity grow taller, and the sea of blessings swell with waves. May his official salary and destiny be as enduring as the pine and cypress, and his years and life be preserved like the tortoise and crane. In office, may he ascend to the highest ranks, ever serving as a senior minister; in private life, may his fortunes flow smoothly, with divine spirits aiding and protecting him. May his dwelling overflow with joy and peace, and his household enjoy safety. May the nine generations of ancestors and the seven generations of forebears, the honored souls of past eras, and all sentient beings attain the ultimate transformation.\n\nThen, the luminous virtue of the Heavenly Worthies above and the sincerity of our devotion below will be in perfect accord.\n\nRespectfully presented for your attention.\n\nNext, the Twelve Vows are dispersed as per the usual rites.\nAt noon, the morning audience concludes, the dispersal is announced, and the Three Offerings are read aloud. From the singing of the Dao to the lighting of the incense burner, all follows the usual rites.\n\nNext, the titles are recited.\n\nThe officiants, your humble servants [Names], with united sincerity, respectfully present this petition to the Most High, Boundless Dao of the Great Clarity, the August Jade Emperor of the Central Yellow, the Nine Lands, the Twelve Immortals, the Lords of the Five Lands, the Nine Palaces, the Eight Trigrams, the Sun, Moon, and Stars, the Heavenly Offices, the Earthly Prisons, the Generals of the Year Star, the Earth-Soothing Divine Generals, the Four Directions, and all numinous powers.\n\nI have heard that when the celestial principles are fixed, the virtue of earth holds the honored position. The pure floats while the turbid congeals, and the eight directions await their division. The round heavens follow the path of the west’s return, while the square earth flows eastward. The principles of ghosts and spirits manifest the workings of yin and yang; the Five Phases are even more evident, giving birth to all things. From caves and nests to palaces and towers, from the beams above to the eaves below, the transmission of the sacred work of the ancient sages begins; from doors and windows to the carving of openings, the great models of the primordial emperors commence. The sixty jiazi cycles receive their notes from the Five Phases’ transformations; the twelve hours govern the prohibitions of the two dwellings’ directions.\n\nNow, as water overflows and floods, the dwelling must be rebuilt. With earth moved and construction begun, the old is renewed. Fearing transgressions, we present this offering. Humbly, we beseech your permission and, bowing twice, make our request.\n\nNext, the First Offering: incense, tea, and wine are presented.\n\nYour humble servant respectfully petitions the Heavenly Father, the Solar Emperor; the Earthly Mother, the Lunar Deity; the Northern Culmen, the Purple Tenuity, the Five Numinous Ones, the Great Tenuity Emperor; the Seven Primes of the Northern Dipper, the Three Terraces, the Nine Luminaries, the Twenty-Eight Constellations; the Three Officials of Heaven, Earth, and Water; the Nine Earthly Perfected Sovereigns; the Four Controllers, the Five Emperors; the taboos behind the dwelling; the twelve hours; the three hundred and sixty prohibitions; the one hundred and twenty killings of the xun cycle; the city gods of the directions; the Five Phases of the earthly mansion; and all divine spirits.\n\nI now humbly act on behalf of the disciple, whose dwelling requires repair, and thus commands workers to make additions. With much disruption, digging, and excavation, I fear offending the dragon spirits and disturbing the taboos. I present this offering and repentance, arranging incense and lamps. I pray for blessings from the Perfected Ones above and repent for transgressions against the earth below. My earnest pleas are recorded in this plain petition. The disciple’s words shall be respectfully proclaimed.\n\nNext, the petition is read.\n\nAs stated in the document, may the profound gaze know all.\n\nI have heard that heaven covers and earth bears, the sun and moon flow with radiance. The stars and constellations move in their courses above, while humans and creatures receive their endowment below. The Five Phases transform, and yin and yang alternate. Only the divine and numinous possess prohibitions and taboos.\n\nNow, [Name] has inherited his ancestral estate and continues the legacy of his forebears. Stationed in a strategic prefecture, governing a commandery, he undertakes works in accordance with his duties. In doing so, he must not avoid the labor of moving earth. Whether digging wells below or raising towers above, adorning halls and constructing courtyards, replacing the old and adding the new, he seeks only to enhance their grandeur. Yet, in digging and excavating, he fears harming the dragon generals; in construction, he worries about offending the divine spirits.\n\nThus, with reverence for the Daoist gate, we present the prescribed rites. Solemnly conducting the jiao offering, we prepare incense and lamps. Silk banners mark the directions, and wealth pledges sincerity. Silver coins and galloping steeds are presented at each station. Wine and dried meats are offered in flying cups, as if the gods were present.\n\nWe humbly invoke the Four Administrations, the Five Emperors, and the True Officials of the Earth Bureau. May they turn their imperial carriages within the Nine Palaces and descend upon the jiao altar across the Ten Lands. Receive our sincere offerings and bestow blessings and grace. Let our kin be free from harm’s dread, and our dwellings know perfect felicity. May all undertakings prosper, and all comings and goings be secure. Let the City Gods of the Five Directions rejoice in their fulfillment.\n\nBowing again, we make the second offering: incense, tea, and wine.\n\nYour servant respectfully petitions once more the True Numinous Supreme, the Five Earthly Sovereigns, and the Venerable Gods of the Soil. We recall that at the dawn of creation, yin and yang took form. From the age of cave dwellings and nest-like shelters, humanity progressed to the era of capital cities and palatial halls. Everywhere, earth was molded and metal cast, axes hewed wood. Roofbeams rose above, foundations lay below; walls and dikes were raised. Chi You defied the Yellow Emperor, and weapons have since flowed through the ages. The heavens display their signs, the Five Phases transform through the hundred spirits; the earth divides its forms, the Eight Trigrams govern the myriad changes. The twelve palaces of the celestial stems and the sixty cyclical sounds of the Heavenly Stems and Earthly Branches—from these ancient precedents, prohibitions arose in the upper commanderies, and taboos were established.\n\nFor all household activities, for the people’s every action, one must first select an auspicious day and hour, aligning with propitious directions. How much more so now, when by imperial decree, we newly assume office in this public hall, undertaking renovations and expansions—digging and excavating, making all resplendent and new. The nine portents of ill fortune are hard to fathom, and harm may befall people and things, filling the household with anxiety. Knowing this, the master of the house follows the Daoist rites of atonement. We conduct the jiao offering to the Five Earthly Virtues of the Five Directions.\n\nWe humbly invoke the Five Emperors of the Five Directions, the Twelve Celestial Stems, the Earth Bureau, the City Gods, and the household deities of prohibition. Receive the offerings laid before this dwelling, and accept the sincere prayers of the patron. Bless this home and prosper its lineage. Let silkworms yield their finest threads, and granaries overflow with abundance. May the construction of this dwelling be completed, and all renovations accomplished. May the gods rejoice in their favor and bestow their divine grace.\n\nBowing again, we make the third offering: incense, tea, and wine.\n\nYour servant respectfully petitions once more the Heavenly Father and Earthly Mother, the Five Earthly Sovereigns, the assembled host of sages, and all divine presences. Your servant, as disciple, conducts this jiao offering to the hundred gods. We give thanks to the Five Emperors and beseech their majestic radiance. Hear these entreaties and permit our atonement. Receive the offerings of the jiao rite, and let the sacred herbs shine forth. Assist and protect this household, that its people may flourish and multiply. Let the gates receive fortune and the windows know joy.\n\nFrom this jiao offering onward, may the transformations of the Five Emperors proceed in harmony, and the blessings of the Four Spirits be bestowed in order. May the Eight Trigrams bring well-being to the eight seasons, and the Nine Palaces descend with the felicity of the Nine Heavens. May the Grand Year uphold the constant Dao of generation, and the Grand Yin nourish the emoluments of humanity. May the Generals wield their transformative authority, and the Monthly Officers fulfill their task of bestowing good fortune. Let the Azure Dragon and White Tiger display their martial prowess at the gates; let the Vermilion Bird and Dark Warrior illuminate literary brilliance at the windows. May the Jade Hall and Golden Treasury, the Celestial Virtue and Bright Hall, long attract the noble and wealthy, and forever safeguard the household’s prosperity.\n\nNow, we hang the precious mirror in the four directions and place the star knives in the five. They illuminate the twelve true gods and repel the malevolent spirits of the sixteen directions. Five-colored silks pledge the Five Dragons; five kinds of coins are offered to the Five Emperors. We present this jiao offering to atone before the hundred gods.\n\nWe humbly beseech the assembled divine host to deign to witness and protect. Guard each direction and bestow perpetual good fortune. Let misfortune depart and blessings return; let calamities vanish and goodness gather. Bring well-being to people and prosperity to the household. For those in office, let emoluments and honors ascend; for those in private life, let all desires be fulfilled. May the Star of Fortune shine upon us, and all transgressions be purged. Let the dwelling radiate light, and the household abide in harmony. Through embroidered windows and painted doors, may the joyous qi of the four seasons ever fill; in fragrant halls, may the auspicious sounds of the eight festivals resound.\n\nThen, when we dig and build, may the four directions know no disaster. May the entire household enjoy timely peace and prosperity. Let no pestilence arise, and no fear of wind or fire disturb us. May granaries and storehouses be well-stocked, with no loss or dissipation. We atone before the unseen powers this evening and leave blessings for this moment. The offered coins and paper money are now burned.\n\nYour servant and disciples bow again in farewell.\n\nThe Lingbao Half-Day Purification Rite is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "灵宝半景斋仪 经名：灵宝半景斋仪。 一卷。 底本出处：《正统道藏》洞玄部威仪类。 灵宝半景斋仪 自旦至午，谓之半景 清旦，第一朝 先门启白意 次昌道次华夏赞，引至地户 次各礼师，存合如法 次卫灵神咒 次呜法鼓，二十四通 次发炉 无上三天玄元始三炁太上老君，召出臣众官等身中三五功曹、左右官使者、左右捧香驿龙骑吏、侍香金童、传言玉女、五帝直符直日香官，各三十六人出，关启此问土地里域、真官正神。 臣今正尔烧香，奉为大道弟子某修设灵宝半景妙斋一中，祈恩忏罪，谢过消灾，保护平安，希求福佑，愿得太上十方正真生炁，降流臣及斋主弟子等身中，令臣所启速达，径御太上无极大道至真玉皇尊帝御前。 次各称法位 具法位臣某等谨同诚上启，虚无自然金阙天尊无极大道太上大道君、太上老君、高上玉皇，十方已得道大圣众，至真灵宝天尊、三十二天帝君、玉虚上帝、玉帝大帝、东华南极西灵北真玄都玉京金阙七宝玄台紫微上宫灵宝至真明皇道君、玄中大法师、北极帝君、天地水三官、九天司命真君、九天使者真君、三界官属一切真灵。 臣闻大道无名，强启不言之教； 天尊出世，特开正法之门。",
      "translated_text": "**Lingbao Half-Day Retreat Ritual**\n\n*Scripture Title:* *Lingbao Half-Day Retreat Ritual*. One fascicle.\n*Source Text:* *Zhengtong Daoist Canon*, *Dongxuan Section*, *Weiyi* (Ritual Propriety) category.\n\n**Lingbao Half-Day Retreat Ritual**\nFrom dawn to noon is called the \"half-day.\"\n\n**Dawn, First Audience**\nFirst, open the gates and declare intent.\nNext, recite the *Changdao* and *Huaxia Hymn*, leading to the Earth Gate.\nThen, each pays homage to the master, visualizing the union as prescribed.\nNext, recite the *Guardian Spirit Mantra*.\nThen, strike the ritual drum twenty-four times.\nNext, kindle the incense burner.\n\n*\"Supreme Three Heavens, Mysterious Primordial Three Qi, Most High Lord Lao, summon forth from within the bodies of us, your assembled officials, the Three and Five Merit Officers, Left and Right Envoys, Left and Right Fragrant-Bearing Dragon-Riding Couriers, Golden Lads of Incense, Jade Maidens of Transmission, and the Thirty-Six Fragrant Officials of the Five Thearchs’ Direct Attendants for this day. Dispatch them to report to the local earth deities and true officials of this domain. We now burn incense and humbly serve the Great Dao’s disciple [Name], who establishes this wondrous Lingbao Half-Day Retreat, praying for grace, repenting sins, atoning for transgressions, dispelling calamities, safeguarding peace, and seeking blessings. May the Primordial Qi of the Most High’s Ten Directions and True Perfected Ones descend into our bodies and that of the retreat’s sponsor, so that our petition swiftly ascends before the August Jade Emperor of the Supreme, Boundless, and Utmost Dao.\"*\n\nNext, each declares their ritual rank.\n\n*\"We, your servants [Names], with utmost sincerity, jointly petition: the Heavenly Worthy of the Golden Portal of Emptiness and Spontaneity, the Boundless Great Dao, the Supreme Lord of the Great Dao, the Most High Lord Lao, the August Jade Emperor, the Host of Great Sages who have attained the Dao in the Ten Directions, the Perfected and Numinous Heavenly Worthies of Lingbao, the Thirty-Two Heavenly Thearchs, the Jade Clarity Highest Emperor, the Great Emperor of the Jade Capital, the Eastern Florescence, Southern Culmen, Western Numinosity, Northern Perfection, the Seven Jeweled Mystic Terrace of the Purple Tenuity’s Upper Palace in the Golden Portal of the Jade Metropolis, the Perfected and Illustrious Sovereign of Lingbao, the Great Dharma Master of the Mystic Center, the Northern Culmen Emperor, the Three Officials of Heaven, Earth, and Water, the Nine Heavens’ True Lords of Life Mandate, the Nine Heavens’ Messenger True Lords, and all the numinous officials of the Three Realms.\"*\n\nWe have heard that the Great Dao is nameless, yet we reluctantly invoke its ineffable teachings.\nThe Heavenly Worthy manifested in the world to uniquely open the gate of the Orthodox Dharma.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 489,
      "start_sentence": 0,
      "end_sentence": 18,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.24604892730713,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\灵宝半景斋仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "於是玉律宣行，金科阐化。 既有祈求之路，爰昭应感之机。 臣等学业因师，叨传仪式。 凡有信心归向，须陈像设威容。 欲导精诚，先呈词疏。 次读词 具如词奏，圣道以闻。 伏惟太上三尊，垂光照鉴，斋主弟子。 伏闻玄元设教，常善救人。 太上真风，弘慈被物。 度有心於福善，接回向於装严。 臣等受法之时，约令级引。 存玉皇而俯仰，祈真圣以来临。 今故烧香，归身归神归命，十方无极太上灵宝自然天尊，乞降道场，受斯供养。 听臣关奏，愿赐恩光，使斋主弟子某福果周圆，功德成就。 忏罪愆於已往，希善庆於将来。 家眷平安，公私康泰。 九玄七祖，承功德以逍遥； 土地龙神，奉灵恩而佑助。 今故烧香自归依师尊大圣众，至真之德。 得道之后，升入无形，与道合真。 次礼方 次忏悔 臣等伏闻，大道强名，天尊应号。 御金阙玉京之上，见十方三界之中。 照群生，垂日月之光； 资品物，布四时之炁。 凡有祈告，随愿感通。 今时谨有斋主弟子某投词丹赚，启露玄师。 请立道场，奉修斋法。 祈真启请，愿降香筵。 稽首天尊，归命忏悔。 伏恐弟子某自从旷劫，爰及今时。 父母宗亲，至于眷属。 三业造三千之罪，六根为六贼之愆。 生世生身，有罪有咎。 今日设斋忏悔，敬礼十方无极太上灵宝天尊。 伏愿罪灭福生，愆消过息。 年归善寿，命益延昌。 九祖生天，一门庆泰。 祸沉未兆，福起自新。 稽首归依，正真三宝。 次三启颂 次三礼 次称名位",
      "translated_text": "Thus the Jade Measures are proclaimed and the Golden Precepts unfold transformation. Since the path of supplication is established, the mechanism of responsive resonance is thereby revealed. We disciples, having received our learning through our masters, have presumptuously transmitted these rites. For all who turn in faith toward the Dao, it is necessary to display images and manifest dignified presence. To guide sincere devotion, we first present our written petitions. Next, the petitions are read—all as set forth in the memorial, that the sagely Dao may be made known.\n\nWe prostrate ourselves and reverently reflect: the Most High Three Worthies shed their radiant light in witness, O fasting master and disciples. We have heard that the Mysterious Origin established teachings ever skillful in delivering humankind. The true wind of the Most High, vast in compassion, extends to all beings. It delivers those of earnest heart to blessed goodness, and receives those who turn toward adornment and reverence. When we received the Dharma, we were bound by its graded progression. We meditate upon the Jade Thearch in reverent posture, and pray for the true sages to descend and attend. Now, therefore, we burn incense, surrendering body, spirit, and life to the Ten Directions’ Boundless Most High Numinous Treasure Spontaneous Heavenly Worthy, beseeching that the Dao altar be graced with presence and receive these offerings. May You heed our petition and bestow Your luminous grace, that the fasting master and disciple, so-and-so, may attain perfect fruition of blessings and accomplish merit. May past transgressions be repented, and future good fortune be sought. May household and kin enjoy peace, and public and private affairs flourish. May the nine ancestral lines and seven generations partake in the merit and roam freely; may the local earth gods and dragon spirits receive the numinous favor and lend their protection. Now, therefore, we burn incense and take refuge in the Great Sage Assembly, the virtue of the Perfected and True. After attaining the Dao, may we ascend into the formless and unite with the Dao as true reality.\n\nNext, the obeisance to the directions.\nNext, the confession.\n\nWe prostrate ourselves and have heard: the Great Dao is reluctantly named, and the Heavenly Worthy answers to the title. Enthroned above the Golden Portal and Jade Metropolis, You behold the ten directions and the three realms. You illumine all beings with the light of sun and moon, and nourish all creatures with the qi of the four seasons. To all who make supplication, You respond according to their wishes. At this time, the fasting master and disciple, so-and-so, humbly present this vermilion memorial, revealing it to the Mysterious Master. We request the establishment of a Dao altar and the performance of the fasting rites. We pray for the true ones to be invoked and descend to the incense banquet. We bow our heads to the Heavenly Worthy and take refuge in repentance.\n\nWe fear that from beginningless kalpas until now, the disciple, so-and-so, together with parents, ancestors, and all kin, have committed the three karmic offenses of body, speech, and mind, amassing the three thousand transgressions; the six senses have become the six thieves of wrongdoing. In this life and in past existences, sins and faults abound. Today, in establishing this fast and repenting, we reverently worship the Ten Directions’ Boundless Most High Numinous Treasure Heavenly Worthy. May our sins be extinguished and blessings arise; may transgressions vanish and faults cease. May our years return to virtuous longevity, and our lives be prolonged and flourish. May the nine ancestors ascend to heaven, and the entire household enjoy prosperity. May misfortune sink before it appears, and fortune arise anew. We bow our heads and take refuge in the Orthodox Three Treasures.\n\nNext, the Threefold Invocation and Hymn.\nNext, the Threefold Obeisance.\nNext, the Recitation of Names and Titles.",
      "overlap_context": "fected and Illustrious Sovereign of Lingbao, the Great Dharma Master of the Mystic Center, the Northern Culmen Emperor, the Three Officials of Heaven, Earth, and Water, the Nine Heavens’ True Lords of Life Mandate, the Nine Heavens’ Messenger True Lords, and all the numinous officials of the Three Realms.\"*\n\nWe have heard that the Great Dao is nameless, yet we reluctantly invoke its ineffable teachings.\nThe Heavenly Worthy manifested in the world to uniquely open the gate of the Orthodox Dharma.",
      "start_char": 489,
      "end_char": 1060,
      "start_sentence": 19,
      "end_sentence": 63,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.638664722442627,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\灵宝半景斋仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "具法位臣某等谨重上启，太上无极大道太上道君、太上老君、高上玉皇、无上玄老、十方已得道大圣众，至真灵宝天尊、三十六部尊经、玄中大法师、天地水三官、三界官属一切威灵。 臣等服佩师资，传经受箓。 先约立斋尘世，常转法轮； 后及克意修真，存三守一。 凡有人天请命，当须依按科仪。 布露坛场，装严象设，具其斋意，关奏上闻。 斋主词文，向已宣读。 兼持法信，披诉望恩。 伏惟无上虚皇自然尊帝，眄灵舆於碧落，照虔告之丹心。 斋功克遂於周圆，福果尽蒙於昭着。 洪恩烛佑，使万祸以消除； 灵泽需临，荡千灾而珍灭。 伏愿斋主身安命泰，福禄增荣。 家眷女男，俱资景寿。 九玄七祖、三代家先，受斋福以逍遥，各生天而自在。 住宅龙神，土地城隍，庙貌灵祇，皆承启谢之功，悉助善缘之德。 则上明天尊弘慈之泽，下副臣等归命之诚。 谨启。 次十念",
      "translated_text": "We, the ritual officers of duly ordained rank, most reverently and solemnly address our supplication to the Supreme Boundless Dao, the Most High Dao Lord; the Most High Lord Lao; the August Jade Emperor on High; the Supreme Mysterious Elder; the Great Sage Hosts of the Ten Directions who have attained the Dao; the Perfected, Numinous Treasure Heavenly Worthy; the Thirty-Six Divisions of Venerable Scriptures; the Great Dharma Masters of the Mysterious Center; the Three Officials of Heaven, Earth, and Water; and all the majestic numina of the Three Realms’ official retinues.\n\nWe, your servants, have received the transmission of scriptures and registers from our masters, donning the robes of our lineage. First, we pledge to establish fasts in the dusty world and perpetually turn the Wheel of the Dharma. Thereafter, we dedicate ourselves to cultivating the Real, preserving the Three and guarding the One. Whenever beings of the human and heavenly realms seek deliverance, we must adhere to the prescribed rituals. We prepare and disclose the altar precincts, adorn and array the sacred images, and fully present the intent of this fast, submitting our petition for celestial audience. The patron’s petition has already been recited aloud. Alongside the ritual offerings, we now unfold our plea in hope of grace.\n\nWe prostrate ourselves in awe of the Supreme Void Emperor, the Self-So Venerable Lord, who gazes upon the azure vault with divine regard and illumines the sincere crimson hearts of those who supplicate. May the merit of this fast be perfectly accomplished in its entirety, and may the fruits of blessings be fully bestowed with manifest clarity. May the radiant grace of boundless kindness dispel ten thousand calamities, and may the descent of numinous beneficence dissolve a thousand disasters and utterly extinguish them.\n\nWe humbly pray that the fast’s patron may enjoy bodily peace and destiny’s prosperity, with fortune and emolument ever increasing in glory. May all family members—women and men alike—be endowed with luminous longevity. May the ninefold ancestors and sevenfold forebears, along with the three generations of household ancestors, receive the fast’s blessings and roam freely, each ascending to heaven in sovereign ease. May the dragon deities of the dwelling, the local earth gods, the city gods, and the numina of temple sanctuaries all partake in the merit of this offering and supplication, and may they each assist in the virtue of good affinities. Thus shall the vast compassion of the Heavenly Worthy on high be made manifest, and the sincerity of our refuge below be duly answered.\n\nRespectfully submitted.\n\nNext, the Ten Recitations.",
      "overlap_context": "r sins be extinguished and blessings arise; may transgressions vanish and faults cease. May our years return to virtuous longevity, and our lives be prolonged and flourish. May the nine ancestors ascend to heaven, and the entire household enjoy prosperity. May misfortune sink before it appears, and fortune arise anew. We bow our heads and take refuge in the Orthodox Three Treasures.\n\nNext, the Threefold Invocation and Hymn.\nNext, the Threefold Obeisance.\nNext, the Recitation of Names and Titles.",
      "start_char": 1060,
      "end_char": 1404,
      "start_sentence": 64,
      "end_sentence": 82,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.953831911087036,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\灵宝半景斋仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "次复炉 次小学仙赞 次回向赞毕，散如常仪 平旦，第二朝 自唱道至发炉，并如前法只不宣卫灵神咒 无上三天玄元始三炁太上老君召出，臣众等身中三五功曹、左右官使者、左右捧香驿龙骑吏、侍香金童、传言玉女、五帝直符直日香官，各三十六人出。 关启此间土地里域，真官正神。 臣今正尔烧香，奉为大道弟子某修设灵宝半景妙斋一中，祈恩忏罪，请福消灾。 愿得太上十方正真生炁，降流臣及斋主弟子身中。 令臣所启，速达径御太上无极大道玉皇尊帝御前。 次各称名位 具法位臣某等谨同诚上启，虚无自然金阙天尊无极大道太上大道君、太上老君、高上玉皇、十方已得道大圣众，至真灵宝天尊、三十二天帝君、玉虚上帝、玉帝太帝、东华南极西灵北真玄都玉京金阙七宝玄台紫微上宫灵宝至真明皇道君、玄中大法师、北极帝君、天地水三官、九天司命真君、九天使者真君、三界宫属一切威灵。 臣闻，大罗空寂，中分九虚。 大包亿万之天，独止法王之极。 转法输於天上，流真教於人间。 师宝相承，玄风广扇。 立九真之玉律，修七圣之金科。 祈求之疏，爰申斋法之门。 遂启臣等，早蒙师教，受箓传经。 先弘济度之心，以副人天之请。 既奉词疏，合具奏闻。 次读词 具如词奏，玄鉴以闻。 伏惟太上三尊，圣慈昭览。 陌顾虔祈之恳，赐留不恃之恩。 臣等以涤滤身心，恭行关告。 降真圣於九天之上，礼天尊於十极之中。 斋主某专备香花，严陈供养。 时也金鸡报晓，玉漏将终。 展此席之威仪，按三时而行道。 祈恩有所，请福周勤。 既陈初上之香，先用祝尧之寿。 运兹初捻上香，供养玉清圣境元始天尊。 愿以是功德，先用上资，当今皇帝陛下。 伏愿天长宝位，地久居尊。 圣明齐日月之明，皇化并唐虞之化。 北辰同德，南面永光。 乘景运於千年，扇熏风於万国。 诸王太子，盘石弥坚。 将相诸侯，匡安社稷。 时丰俗阜，天下和平。 灾害不生，民安物泰。",
      "translated_text": "Next, the Rekindling of the Incense Burner.\nNext, the Hymn to the Young Immortals.\nNext, the Hymn of Dedication concluded, the dispersal follows the usual rite.\n\nAt dawn, the second audience begins.\nFrom the chanting of the *Dao* to the kindling of the incense burner, all proceeds as before, save that the *Incantation for the Guardians of the Sacred* is not recited.\n\nThe Most High Three Heavens, the Primordial Origin of the Three *Qi*, the Supreme Lord Lao, summon forth:\nFrom within the bodies of us, your servants, emerge the Three and Five Merit Officers, the Left and Right Attendant Envoys, the Left and Right Incense-Bearing Courier Dragon Riders, the Golden Lads of Incense, the Jade Maidens of Transmission, and the Five Thearchs’ Direct Attendants and Daily Incense Officers—thirty-six of each.\n\nWe invoke the local earth gods and territorial deities, the true officials and rightful spirits of this place.\nWe now burn incense in offering for the Great Dao’s disciple, so-and-so, who has established this half-day wondrous fast of the Numinous Treasure, beseeching grace, repenting sins, entreating blessings, and dispelling calamities.\nMay the primordial *qi* of the Most High’s Ten Directions and True Beings descend and flow into the bodies of us, your servants, and the fast’s sponsor, the disciple.\nMay our supplication swiftly ascend and reach the presence of the Most High, Boundless, and Great Dao’s Jade August Thearch.\n\nNext, each declares his name and rank.\n\nWe, your servants, so-and-so and company, with reverent sincerity jointly proclaim:\nTo the Void and Spontaneous Golden Portal Heavenly Worthy of the Boundless Great Dao, the Supreme Lord of the Great Dao;\nTo the Supreme Lord Lao;\nTo the August Jade Thearch on High;\nTo the Ten Directions’ Great Holy Assemblies who have attained the Dao;\nTo the Perfected and Numinous Treasure Heavenly Worthies;\nTo the Thirty-Two Heavenly Thearchs;\nTo the Jade Void Supreme Thearch;\nTo the Jade Thearch and Great Thearch;\nTo the Eastern Florescence, Southern Culmen, Western Numinosity, Northern Perfection, and the Purple Tenuity’s Upper Palace of the Seven Jeweled Mystic Terrace in the Jade Capital and Golden Portal;\nTo the Perfected and Numinous Radiant August Lord of the Dao;\nTo the Great Dharma Master of the Mystic Center;\nTo the Northern Culmen Thearch;\nTo the Three Officials of Heaven, Earth, and Water;\nTo the Nine Heavens’ Controller of Destiny Perfected Lords;\nTo the Nine Heavens’ Messenger Perfected Lords;\nTo all the mighty numina of the Three Realms’ palatial retinue.\n\nWe have heard:\nThe Great Net is empty and still, its midst divided into the Nine Voids.\nIt encompasses the myriad heavens, yet alone attains the ultimate of the Dharma King.\nThe Dharma Wheel turns in the heavens above, the true teachings flow among humankind.\nThe Precious Lineage is transmitted in succession, the Mystic Wind spreads far and wide.\nThe Jade Statutes of the Nine Perfected are established, the Golden Precepts of the Seven Sages are cultivated.\nThrough this fast’s petitions, we enter the gate of the Dharma’s rites.\nThus have we, your servants, early received our masters’ teachings, received registers, and transmitted scriptures.\nFirst, we nurture the mind of salvation and deliverance, answering the prayers of humans and gods.\nHaving received the memorial, we now duly present it for your hearing.\n\nNext, the memorial is read.\nAs set forth in the memorial, may the Mystic Insight deign to take note.\nWe prostrate ourselves, trusting that the Three Supreme Worthies’ sagely compassion will illumine and regard our earnest supplication, bestowing undeserved grace.\nWe, your servants, having purified body and mind, reverently perform this invocation.\nMay the true sages descend from the Nine Heavens above, and the Heavenly Worthies be venerated within the Ten Poles.\nThe fast’s sponsor, so-and-so, has prepared incense and flowers, solemnly arraying the offerings.\nNow, as the golden cock crows at dawn and the jade clepsydra nears its end,\nwe unfold this rite’s majesty, conducting the Dao in accordance with the Three Times.\nWe beseech grace with devotion, entreat blessings with diligence.\nHaving presented the first incense, we first offer the longevity of Yao’s virtue.\nAs we kindle this first pinch of incense, we offer it to the Jade Clarity’s Sacred Realm, the Primordial Heavenly Worthy.\nMay this merit be first dedicated to the benefit of His Majesty, the present Emperor.\nWe prostrate ourselves, praying:\nMay his precious throne endure as long as heaven, his august position last as long as earth.\nMay his sagely brilliance equal the sun and moon’s radiance, his imperial transformation parallel that of Tang and Yu.\nMay he share the Northern Asterism’s virtue, his southern-facing rule shine forever.\nMay he ride the luminous destiny for a thousand years, spreading the fragrant breeze across ten thousand lands.\nMay the princes and imperial sons be as steadfast as bedrock.\nMay the generals, ministers, and feudal lords secure and pacify the altars of state.\nMay the times be abundant, customs prosperous, the realm at peace.\nMay no disasters arise, the people be secure, and all things flourish.",
      "overlap_context": " fast’s blessings and roam freely, each ascending to heaven in sovereign ease. May the dragon deities of the dwelling, the local earth gods, the city gods, and the numina of temple sanctuaries all partake in the merit of this offering and supplication, and may they each assist in the virtue of good affinities. Thus shall the vast compassion of the Heavenly Worthy on high be made manifest, and the sincerity of our refuge below be duly answered.\n\nRespectfully submitted.\n\nNext, the Ten Recitations.",
      "start_char": 1404,
      "end_char": 2162,
      "start_sentence": 83,
      "end_sentence": 124,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.42172932624817,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\灵宝半景斋仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "今故烧香，自归依师尊大圣众至真之德，得道之后，升入无形，与道合真。 臣闻，香花二奏，腾摇曳於三清； 福报见存，远熏修於九祖。 积善之家先德，有余之庆追思。 运兹二捻上香，供养上清真境虚皇灵宝天尊。 愿以是功德，奉为斋主，九祖七玄、三代家先。 伏恐父母因缘，造诸罪业，未脱三涂五苦、沉沦万劫之愆。 伏愿承此忏悔，俱蒙荡雪。 冠带装严之境，逍遥自在之天。 福荫家门，子孙光显。 今故烧香，自归依师尊大圣众至真之德，得道之后，升入无形，与道合真。 臣闻，名香三上，达金阙之斋心； 烟散玉花，满十方而供养。 请福之期必应，求恩之果感通。 运兹三捻上香，供养太清仙境玉皇太极天尊。 愿以是功德，奉用保持。 斋主某伏愿真灵降佑，消世上之三灾； 道炁护持，度人间之九厄。 赦愆尤於已往，恕过犯於将来。 寿算增延，年命长远。 福禄吋四时之庆，官荣光极品之称。 眷属女男，尽蒙康泰。 境土乐农桑之业，市廛臻百货之财。 土地龙神，共资阴惊。 今故烧香，自归依师尊大圣众至真之德，得道之后，升入无形，与道合真。 次礼方 次忏悔",
      "translated_text": "Now, therefore, we burn incense, taking refuge in the virtue and power of our revered masters, the great sages and perfected beings, that after attaining the Dao, they may ascend into formlessness and unite with the Dao in truth.\n\nWe are told that the twin offerings of incense and flowers rise and sway before the Three Clarities; that blessings manifest in the present, their fragrance reaching back to purify nine generations of ancestors. The households that accumulate goodness first honor their forebears, and their descendants inherit the overflowing blessings of remembrance.\n\nWe now offer this second pinch of incense, dedicating it to the Most High Perfected Realm of the Numinous Treasure Heavenly Worthy of the Void and Sovereign. May this merit be respectfully presented for the sake of the host of this ritual, their nine generations of ancestors, sevenfold lineage, and three generations of family forebears. We humbly fear that our parents, bound by karmic conditions, have committed manifold transgressions, yet to escape the three evil destinies, the five sufferings, or the sins of sinking into ten thousand kalpas of perdition. We pray that, by virtue of this repentance, all may be cleansed and absolved. May they dwell in realms adorned with crowns and sashes, in heavens of carefree ease. May blessings shade the household, and descendants shine in glory.\n\nNow, therefore, we burn incense, taking refuge in the virtue and power of our revered masters, the great sages and perfected beings, that after attaining the Dao, they may ascend into formlessness and unite with the Dao in truth.\n\nWe are told that the triple offering of finest incense reaches the golden palaces of devout hearts; that its fragrant smoke scatters jade-like blossoms, filling the ten directions in offering. The time for seeking blessings must surely bring response; the fruits of supplication will surely evoke resonance.\n\nWe now offer this third pinch of incense, dedicating it to the Jade Emperor of the Supreme Clarity’s Immortal Realm, the Heavenly Worthy of the Great Ultimate. May this merit be respectfully employed for preservation. For the host of this ritual, we humbly pray that the true numina descend in protection, dispelling the three disasters of the world; that the qi of the Dao guard and sustain, delivering humanity from the nine calamities. May past transgressions be pardoned, future offenses forgiven. May lifespan be extended, years of life prolonged. May fortune and emolument bring joy in all four seasons, and official glory attain the highest ranks. May all kin, male and female, enjoy health and peace. May the land rejoice in the labors of farming and sericulture, and the markets abound with the wealth of a hundred goods. May the earth gods and dragon spirits together lend their hidden support.\n\nNow, therefore, we burn incense, taking refuge in the virtue and power of our revered masters, the great sages and perfected beings, that after attaining the Dao, they may ascend into formlessness and unite with the Dao in truth.\n\nNext, we pay homage to the directions.\nNext, we perform repentance.",
      "overlap_context": "at of Tang and Yu.\nMay he share the Northern Asterism’s virtue, his southern-facing rule shine forever.\nMay he ride the luminous destiny for a thousand years, spreading the fragrant breeze across ten thousand lands.\nMay the princes and imperial sons be as steadfast as bedrock.\nMay the generals, ministers, and feudal lords secure and pacify the altars of state.\nMay the times be abundant, customs prosperous, the realm at peace.\nMay no disasters arise, the people be secure, and all things flourish.",
      "start_char": 2162,
      "end_char": 2601,
      "start_sentence": 125,
      "end_sentence": 151,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.33320140838623,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\灵宝半景斋仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "臣闻，玉皇端御，强为之容。 弘慈而天地圆通，恕宥而神明方便。 众生造罪，忏悔能消。 日久过愆，首陈皆雪。 今时，斋主弟子某归依大道，敬念清斋。 稽首天尊，归命忏悔，伏恐弟子六根造罪，三业为愆。 世惧之灾，生虞九厄。 又恐前身过犯，见报愆尤。 害命杀生，冤家债主。 爰从多劫，父母种亲，无量罪源，宣陈难尽。 今日设斋，至心忏悔，敬礼十方无极太上灵宝天尊。 乞赦千愆万罪，过犯深冤。 使赫日恩威，霜消雪释。 年增福善，日免凶灾。 家眷康宁，身躬庆泰。 先亡玄祖，承善果以逍遥； 土地龙神，保公私而清吉。 祸沉九夜，福起十方。 稽首归依，正真三宝。 次三启，至重称名位，并如前法 具法位臣某等谨重上启，太上无极大道至真玉皇上帝、太上老君、九天使者真君、三十六部尊经、玄中大法师，三界官属一切威灵。 臣闻，道德巍巍，难穷众妙。 龙汉荡荡，何能别真。 盖天尊垂旨浮黎之天，遂转法输之境。 初传天上，渐降人间。 师资相传，法教弥广。 臣以禀承明训，裨赞真风。 先弘接世之心，后志修行之道。 凡有人天请命事，须开置坛场。 存太上於法筵，具词章而启奏。 陈其斋意，宣达上闻。 斋主墨词，向已披露。 伏惟玉皇大道金阙天尊，眄视丹诚，听宣词疏。 伏乞斋主某赦见生之罪障，消已往之愆尤。 赐八景之玄恩，注九天之善福。 禄延南斗，命益束华。 家眷平安，各增寿算。 免三灾於岁月，除九厄於年庚。 然愿七祖灵仪，先亡神识。 旁及追修之力，俱承解脱之功。 各遂逍遥受生，常乐住宅。 龙神禁忌，城隍社令，庙貌灵祇。 同资启谢之恩，皆作护持之力。 则上明天尊弘慈之泽，下副臣等归命之诚。 谨启。 次十二愿散如常仪 巳时，第三朝 自唱道至发炉，并如前法只不宣卫灵神咒",
      "translated_text": "I have heard that when the Jade Emperor assumes his august throne, even the most solemn demeanor is but a humble guise. His vast compassion makes heaven and earth perfectly responsive, and his boundless forgiveness grants the gods their expedient means. All sentient beings who commit transgressions may dissolve them through repentance; long-accumulated faults, once confessed, are all wiped clean as snow.\n\nNow, the fasting master and disciple [Name] takes refuge in the Great Dao and reverently observes this pure fast. Bowing his head to the Heavenly Worthy, he surrenders his life in repentance, fearing that the six senses have given rise to offenses and the three karmic actions have become transgressions. He dreads the calamities of this world and fears the nine perils of mortal existence. Moreover, he fears that past-life misdeeds may now bring retribution, that the taking of life and killing of beings may have created karmic creditors and enemies. From countless kalpas past, from parents and kindred, the roots of immeasurable sins are too numerous to fully declare.\n\nToday, in establishing this fast, he repents with utmost sincerity, reverently paying homage to the Heavenly Worthies of the Ten Directions, the Boundless, the Most High, and the Numinous Treasure. He beseeches the forgiveness of a thousand faults and ten thousand sins, of deep-seated offenses and grievous enmities, that the blazing sun of grace and majesty may melt them like frost and snow. May his years be filled with increasing virtue and goodness, and may he daily be spared from misfortune and calamity. May his household enjoy peace and well-being, and may his person be blessed with prosperity. May his departed ancestors attain the good fruit and roam freely; may the earth gods and dragon spirits protect both public and private realms with purity and auspiciousness. May disasters sink into the nine nights, and may blessings arise from the ten directions.\n\nBowing his head, he takes refuge in the Orthodox and True Three Treasures.\n\nNext, the Three Petitions are presented, with the solemn recitation of names and titles as before.\n\nYour humble servants [Names] now reverently submit this petition, addressing the Most High, Boundless, and Perfectly True Jade Emperor of the Great Dao; the Most High Lord Lao; the True Lords and Envoys of the Nine Heavens; the Thirty-Six Divisions of Venerable Scriptures; the Great Dharma Masters of the Mysterious Center; and all the numinous officials of the Three Realms.\n\nI have heard that the majesty of the Dao and its virtue is so towering that its myriad wonders cannot be fathomed, and that the vastness of the Dragon Han kalpa is such that the true cannot be distinguished. When the Heavenly Worthy descended his decree from the Floating Radiance Heaven, the realm of the Dharma Wheel was set in motion. First transmitted in the heavens, it gradually descended to the human world. Master and disciple passed it down, and the Dharma teachings spread ever wider.\n\nHaving received these luminous instructions, I assist in promoting the true wind. First, I aspire to extend compassion to the world; later, I dedicate myself to the path of cultivation. Whenever there are matters of human or heavenly petition, it is necessary to establish an altar. The Most High is invoked within the Dharma assembly, and petitions are composed and presented. The intent of the fast is declared, making it known on high.\n\nThe written petition of the fasting master has already been revealed. We humbly beseech the Jade Emperor, the Great Dao, and the Heavenly Worthy of the Golden Portal to cast their merciful gaze upon this sincere offering and to hear the proclamation of this petition. We earnestly pray that the fasting master [Name] be absolved of the karmic obstacles of this present life and that past transgressions be dissolved. May he be granted the mysterious grace of the Eight Effulgences and inscribed with the virtuous blessings of the Nine Heavens. May his emolument be extended by the Southern Dipper and his lifespan increased by the Eastern Flower. May his household enjoy peace, and may each member’s years be prolonged. May the three calamities be averted in the months and years, and the nine perils dispelled from his fate. Moreover, we pray that the spiritual forms of his seven ancestors and the consciousness of his departed kin, along with all those aided by this retrospective merit, may together receive the benefit of liberation. May each attain freedom and rebirth, dwelling eternally in joyous abodes.\n\nMay the dragon spirits, the prohibitions of the earth, the city gods, the tutelary deities, and the numinous spirits of the temple sanctums all share in the grace of this petition and together exert their protective power. Thus, the vast compassion of the Heavenly Worthies on high will be made manifest, and the sincerity of our surrender below will be duly answered.\n\nRespectfully submitted.\n\nNext, the Twelve Vows are dispersed as in the usual rite.\n\nAt the third morning audience of the Si hour, the recitation proceeds from \"The Dao is sung\" to the \"Incense Offering,\" following the previous method, omitting only the invocation of the Guardian Deities of the Numinous.",
      "overlap_context": "ace. May the land rejoice in the labors of farming and sericulture, and the markets abound with the wealth of a hundred goods. May the earth gods and dragon spirits together lend their hidden support.\n\nNow, therefore, we burn incense, taking refuge in the virtue and power of our revered masters, the great sages and perfected beings, that after attaining the Dao, they may ascend into formlessness and unite with the Dao in truth.\n\nNext, we pay homage to the directions.\nNext, we perform repentance.",
      "start_char": 2601,
      "end_char": 3287,
      "start_sentence": 152,
      "end_sentence": 199,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.795782566070557,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\灵宝半景斋仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "无上三天玄元始三炁太上老君，召出臣众等身中三五功曹、左右官使者、左右捧香驿龙骑吏、侍香金童、传言玉女、五帝直符直日香官，各三十六人出。 关启此间土地里域、真官正神。 臣今正尔烧香，奉为大道弟子某修设灵宝半景妙斋一中，三时行道，祈恩忏罪，请福消灾。 愿得太上十方正真生炁，降流臣等身中，令臣所启速达，径御太上无极至真玉皇尊帝御前。 次各称名位 具法位臣某等谨同诚上启，无上虚皇金阙天尊、太上真皇无极天尊、高上玉皇太极天尊、太上玉宸大道君、太上玄元老君、十方得道大圣众、至真诸君丈人，三十三天帝、玉虚上帝、玉帝大帝、东华南极西灵北真玄都玉京金阙七宝玄台紫微上宫灵宝至真明皇道君、玄中大法师、九天司命真君、九天使者真君、北极大帝、天地水三官，三界官属名山洞府一切真灵。 臣闻空洞之前，虚无何有。 既结自然之炁，强名大道之称。 於是朴散分元，成天立地。 融先发妙，唯神大明。 立天子而置三公，有师资而弘教法。 自此真经降世，科律宣行。 茫茫欲海之中，得为舟檝； 浩浩爱河之上，凭作桥梁。 救群生於八苦之门，度厄祸於三灾之运。 广留斋法，特济人天。 臣等忝职玄科，俾弘誓愿。 凡有信心所请，具有词疏宣呈。 次读词 具如词奏，情理备陈。 众圣已闻，虔祈嫌切。 伏惟虚皇大道，无上慈尊。 鉴照俗心，乞垂听览。 臣闻，天尊寂然不动，见形於三界之中； 玄德感而遂通，应念於群生所告。 斋主弟子某特将斋法，启黩真灵。 荐香腾摇曳之花，供养设芳馐之馔。 臣等恭行关奏，希达上闻。 既蒙昭佑之恩，必降护持之力。 谨以初捻上香，供养虚无大道金关天尊。 愿以是功德，奉为斋主先用，仰祝当今皇帝陛下。 伏愿圣躬万岁，宝位亿春。 齐日月之大明，等乾坤之永寿。 垂衣问道，穷象帝於希夷； 端拱凝旒，协华封之献祝。 诸王太子，光玉树於龙楼； 文武重臣，耀功名於麟阁。 熏风广扇，淳化弘流。 天下清平，民康俗阜。 今故烧香，自归依师尊大圣众至真之德。 得道之后，升入无形，与道合真。 臣闻，道力无形，强名功德。 死生重罪，回向能消。 宜持二上之香，冲雪九玄之苦。 谨以二捻上香，供养无极大道众圣。 愿以是功德，奉为斋主家，先亡后化，七祖九玄、三代魂仪、一门宗属。 伏愿赦三涂之苦怼，升十极之福堂。 步八景以逍逼，证六通而自在。 面朝真帝，亲视法王。 福荫见存，永流余庆。 今故烧香，自归依师尊大圣众至真之德。 得道之后，升入无形，与道合真。 臣闻，天尊妙相，因凡相而装严； 大道无形，假凡心而立教。 欲降九天之福，宜腾三上之香。 谨以三捻上香，供养玄元大道无上天尊。 愿以是功德将用，保持斋主。 伏愿玄恩赐佑，东华益算於命宫； 灵泽降流，南斗延生於禄位。 寿山增峻，福海弥深。 居官宠极於人臣，荣庆显光於九族。 处私保安於动止，年庚康泰於四时。 眷属一门，尊卑男女。 各比松筠之操，尽坚金石之颜。 千灾随忏以云消，万祸因斋而雨散。 住宅宁谧，财帛丰饶。 蚕吐八丝，田登九谷。 经求称意，市井骈阗。 然及六道冥灵，悉沾余福。",
      "translated_text": "To the Most High Three Heavens, the Primordial Three Qi of the Mysterious Origin, the Supreme Lord Lao:\n\nSummon forth from within the bodies of us, your servants, the Three and Five Merit Officials, the Left and Right Attendants, the Left and Right Fragrance-Bearing Dragon-Riding Couriers, the Golden Lads of Incense, the Jade Maidens of Transmission, and the Fragrance Officials of the Five Thearchs on duty for the day—thirty-six of each—let them emerge.\n\nNotify the local earth deities and the true officials of this domain.\n\nWe now burn incense in this very moment, offering it on behalf of the disciple of the Great Dao, [Name], who is conducting the wondrous half-day fast of the Numinous Treasure, performing the threefold Dao-cultivation to pray for grace, repent sins, seek blessings, and dispel calamities.\n\nMay the Primordial Qi of the Ten Directions’ True and Upright Ones descend and flow into our bodies, that our petition may swiftly ascend and directly reach the presence of the Supreme Jade Thearch, the August Emperor of the Boundless and Utmost Real.\n\nNext, each declares their name and rank.\n\nWith reverent sincerity, we, your servants of the dharma-rank, jointly submit this petition to the Supreme Void Sovereign, the Golden Gate Heavenly Worthy; the Supreme True August Worthy of the Boundless Heaven; the August Jade Thearch of the Supreme Ultimate Heaven; the Supreme Jade Clarity Lord of the Great Dao; the Supreme Mysterious Origin Lord Lao; the Great Sage Hosts of the Ten Directions who have attained the Dao; the Utmost Real Lords and Masters; the Thirty-Three Heavenly Emperors; the Jade Void Highest Thearch; the Great Jade Emperor; the Eastern Florescence, Southern Culmen, Western Numinous, and Northern True Realms; the Seven-Treasured Mystic Terrace of the Jade Capital and Golden Gate; the Purple Tenuity Supreme Palace; the Numinous Treasure Utmost Real Radiant August Lord of the Dao; the Great Dharma Master of the Mysterious Center; the True Lords of the Nine Heavens’ Life Mandate; the True Lords of the Nine Heavens’ Envoys; the Northern Culmen Great Emperor; the Three Officials of Heaven, Earth, and Water; and all the true numina of the Three Realms, the named mountains, and the grotto-heavens.\n\nWe have heard that before the vast emptiness, there was nothing in the void. Yet once the Qi of spontaneity coalesced, it was forcibly named the Great Dao. Thus, the undifferentiated dispersed and the elements separated, giving rise to heaven and earth. The wondrous preceded the manifest, and the numinous brought forth great illumination. Emperors were established, and the Three Dukes appointed; masters and disciples emerged to propagate the teachings. From this, true scriptures descended to the world, and precepts and regulations were proclaimed. Amidst the boundless sea of desire, they became boats and oars; upon the vast river of attachment, they served as bridges. They rescued sentient beings from the gate of the Eight Sufferings and delivered them from the calamities of the Three Disasters. The fasts were widely established to specially aid humans and devas. We, though unworthy, hold office in the mysterious precepts and are charged with spreading these vows. Whatever is requested with sincere faith is presented in full through the written petition.\n\nNext, the petition is read.\n\nAs fully set forth in the petition, the circumstances and reasons are thoroughly stated. The host of sages has already heard; we earnestly beseech with utmost devotion.\n\nWe humbly implore the Great Dao of the Void Sovereign, the Most High Compassionate Worthy, to perceive the minds of the worldly and deign to heed our plea.\n\nWe have heard that the Heavenly Worthy, though quiescent and unmoving, manifests form within the Three Realms; the mysterious virtue, responsive to feelings, answers the prayers of all beings. The disciple [Name], master of the fast, specially employs this ritual to reverently address the true numina. The rising incense wafts like drifting blossoms; the offerings are set forth as fragrant delicacies. We, your servants, reverently perform this petition, hoping it may reach the heavens above. Having received the grace of illumination, protective power will surely descend.\n\nWith the first pinch of incense, we offer it to the Golden Gate Heavenly Worthy of the Vast and Empty Great Dao.\n\nMay this merit be dedicated first to the master of the fast, and secondly to the present Emperor, may he live ten thousand years. We humbly pray that his sacred person may endure for myriad ages, his precious throne for countless springs; that his great brightness may equal the sun and moon, his eternal longevity match heaven and earth. Governing with effortless grace, he may fathom the mysteries of the unseen; ruling with serene dignity, he may harmonize the felicitations of the Hua Hills. May the imperial princes and sons shine like jade trees in the dragon towers; may the civil and military ministers illuminate their meritorious names upon the Unicorn Pavilion. May the balmy breeze spread far, and the pure transformation flow widely. May the realm know peace, the people health, and customs abundance.\n\nNow, therefore, we burn incense and take refuge in the virtue of the Great Sage Hosts, the Utmost Real and True.\n\nAfter attaining the Dao, may we ascend into the formless and unite with the Dao in truth.\n\nWe have heard that the power of the Dao is formless, and merit is but a forced name. Yet the heavy sins of life and death can be dissolved through dedication. It is fitting to hold the second pinch of incense and dispel the sufferings of the Nine Ancestries.\n\nWith the second pinch of incense, we offer it to the Host of Sages of the Boundless Great Dao.\n\nMay this merit be dedicated to the family of the master of the fast, to the departed and transformed ancestors, the seven generations of forebears, the nine lineages of ancestry, the three generations of souls, and all the clan members. We humbly pray that the sufferings of the Three Wretched Paths be absolved, and that they ascend to the halls of the Ten Felicities. May they traverse the Eight Effulgences with ease and attain the Six Penetrations in freedom. May they face the True Emperor and behold the Dharma King. May blessings extend to the living, and felicity flow endlessly.\n\nNow, therefore, we burn incense and take refuge in the virtue of the Great Sage Hosts, the Utmost Real and True.\n\nAfter attaining the Dao, may we ascend into the formless and unite with the Dao in truth.\n\nWe have heard that the wondrous form of the Heavenly Worthy is adorned through the forms of the mundane; the formless Great Dao establishes teachings through the minds of the worldly. To descend the blessings of the Nine Heavens, it is fitting to raise the third pinch of incense.\n\nWith the third pinch of incense, we offer it to the Supreme Heavenly Worthy of the Mysterious Origin Great Dao.\n\nMay this merit be dedicated to protecting and sustaining the master of the fast.\n\nWe humbly pray that the mysterious grace be bestowed, that the Eastern Florescence may enhance the life span in the Palace of Destiny; that the numinous favor may flow down, and the Southern Dipper extend life in the Station of Emolument. May the Mountain of Longevity rise ever higher, and the Sea of Fortune grow ever deeper. In office, may he attain the highest rank among ministers; in glory, may his splendor illuminate the nine clans. In private life, may he enjoy peace in all his movements; throughout the year, may his years and destiny know health and prosperity. May all members of his household, high and low, male and female, each emulate the integrity of pine and bamboo, their countenances as steadfast as metal and stone. May a thousand disasters vanish like clouds with repentance, and ten thousand misfortunes scatter like rain through the fast. May his dwelling be tranquil, his wealth and silk abundant. May silkworms yield eightfold threads, and fields yield ninefold grains. May all endeavors succeed, and markets teem with activity. May even the dark spirits of the Six Paths partake of the remaining blessings.",
      "overlap_context": "ition and together exert their protective power. Thus, the vast compassion of the Heavenly Worthies on high will be made manifest, and the sincerity of our surrender below will be duly answered.\n\nRespectfully submitted.\n\nNext, the Twelve Vows are dispersed as in the usual rite.\n\nAt the third morning audience of the Si hour, the recitation proceeds from \"The Dao is sung\" to the \"Incense Offering,\" following the previous method, omitting only the invocation of the Guardian Deities of the Numinous.",
      "start_char": 3287,
      "end_char": 4478,
      "start_sentence": 200,
      "end_sentence": 268,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.246716022491455,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\灵宝半景斋仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "今故烧香，自归依师尊大圣众至真之德，得道之后，升入无形，与道合真。 次礼方 次忏悔 臣闻，多事过生，罪莫大於可欲； 道生安静，福莫积於善缘。 故三灾因三业而行，九厄随九窍而作。 既有六根之患，拘成四大之身。 茫茫生死之中，扰扰爱贪之内。 赖神倦救世，教阐多门。 斋法弘宣，济其沉溺。 斋主归依大道，开置法筵。 稽首天尊，至心忏悔。 伏恐弟子某前生今世，行止施为，迭迭愆尤，海深山积。 今日设斋启谢，敬礼十方无极太上灵宝天尊。 惟愿赫厥灵之恩泽，荡无妄之灾虞。 年资福寿，以增新命。 吁善祥而延益。 先亡七祖，各遂逍遥。 见在尊卑，尽蒙康泰。 祸犹冰释，福若川臻。 稽首归依，正真三宝。 次三启，至重称法位，并如前法。 具法位臣某谨重上启，阖座真灵一切主者。 臣等夙生余庆，浩劫信根。 出烦恼之欲尘，入真师之法宇。 人问天上，相次提擭。 莫知出没伪真，宁测去来凡圣。 神仙妙典，经教科仪。 先弘济俗之心，后诣修行之路。 每遇人天祈福，事须关奏法筵。 存虚皇於寥廓之中，降太上於道场之内。 今有斋主某持设词疏，修此妙斋。 已呈三奏之仪，庶满十全之礼。 备以香花灯烛，果馔献诚。 瞻尊像以倾心，竭尘情而供养。 愿以是功德，并用保持。 斋主某伏愿寿山增峻，福海添波。 资禄算於桩松，保年命於龟鹤。 居官则位崇极品，长作重臣； 处私则身运亨通，神明助佑。 宅多庆泰，人口平安。 九玄七祖，先代尊魂。 一切有情，咸归至化。 则上明天尊至真之德，下副臣等归命之诚。 谨启以闻。 次十二愿散如常仪 午朝罢，散白，读三献文自唱道至发炉，并如常仪 次各称法位 具法位臣某等谨同诚上启，太上无极大道太清玉陛下中黄九土十二仙官、五土神君、九宫八卦日月星宿天曹地府太岁将军、土漂神将、四面方位，一切威灵。 臣闻天元定纪，土德居尊。 清浮浊凝，八方期判。 圆 象复西回之道，方舆飞东注之流。 鬼神之理，既彰阴阳之功； 益着五行，造化万物咸生。 穴处巢居，京观宫殿。 上栋下宇，方传先圣神功； 户牖凿开，始自上皇洪范。 六十甲子，纳音於五行变通； 十二时辰，司禁於二宅方位。 伏以水浆泛溢，住宅重兴。 动土兴工，鼎新换旧。 益虞触犯，是用醮陈。 伏惟许允干祈，再拜奉请。 次第一献，上香、上茶、上酒臣谨上启，天父太阳上帝、地母太阴尊神、北极紫微五灵太微帝君、北斗七元三台九曜二十八宿、天地水三官、九地真皇、四司五帝、宅后禁忌、十二时辰、三百六十禁、旬百二十杀、方位城隍，土府五行，一切至神。 臣今谨为弟子，缘宅宇以阙修，遂命工而添换。 既多损动，掘凿高深。 虑恐触犯龙神，惊摇禁忌。 具陈醮谢，布露香灯。 祈福佑於上真，谢愆尤於下土。 备将丹恳，录在素函。 弟子词文，谨当宣奏。 次读词 具如词状，玄览周知。 臣闻，天覆地载，日月流晖。 星辰运度於上天，人物禀承於下土。 五行运化，阴阳变通。 惟神惟灵，有禁有忌。 今有某夙承祖业，继嗣前风。 节镇藩宣，职临府郡。 准上有功之作，得无动土之劳。 莫不下掘井泉，上崇台榭。 耀华堂宇，构造庭除。 换旧添新，惟加壮丽。 掘凿恐伤於龙将，兴工虑犯於神明。",
      "translated_text": "Here the incense is burned, and I take refuge in the virtue and power of the Most Venerable Masters, the Great Sages, and the Perfected Ones. After attaining the Dao, I ascend into the formless and unite with the Dao in truth.\n\nNext, I bow to the directions.\nNext, I confess my transgressions.\n\nI have heard that among the many faults of life, none is greater than yielding to desire; in the birth of the Dao from tranquility, no blessing accumulates more than good affinity. Thus, the Three Calamities arise from the Three Karmas, and the Nine Tribulations follow the Nine Orifices. Since there is the affliction of the Six Roots, the Four Great Elements coalesce into this body. Amidst the vast expanse of birth and death, within the tumult of love and greed, we rely on the weariness of the gods in saving the world, their teachings spreading through many gates. The fast’s dharma is widely proclaimed, rescuing those sunk in delusion.\n\nThe patron of this fast takes refuge in the Great Dao and establishes the dharma assembly. Bowing to the Heavenly Worthy, I wholeheartedly confess. I fear that in my past and present lives, in my conduct and deeds, I have accumulated transgressions as deep as the sea and as high as the mountains. Today, I set up this fast to offer repentance, reverently bowing to the Heavenly Worthies of the Ten Directions, the Boundless, the Most High, the Numinous Treasure.\n\nI only wish that by the radiant grace of their numinous power, unwarranted disasters and anxieties may be swept away. May my years be enriched with fortune and longevity, renewing my destiny. May I invoke blessings and extend my years. May my seven generations of ancestors, now departed, each attain carefree wandering. May all those present, high and low, enjoy health and peace. May misfortunes dissolve like ice, and blessings flow like rivers. Bowing in refuge, I take the Three Treasures as the true and correct.\n\nNext, the Three Petitions are presented, with the solemn recitation of titles as before.\n\nThe officiant, your humble servant [Name], respectfully presents this petition, addressing all the numinous hosts of the assembly.\n\nWe, your servants, have inherited residual blessings from past lives and planted the seeds of faith through countless kalpas. Emerging from the dust of desire and affliction, we enter the dharma realm of the true masters. Between heaven and earth, we are successively uplifted. Who can discern the false from the true, or fathom the comings and goings of the ordinary and the sacred? The wondrous scriptures of immortals, the teachings, precepts, and rituals—first, they expand the heart of salvation for the world; later, they guide the path of cultivation. Whenever humans and gods seek blessings, it is necessary to report to the dharma assembly. We invoke the August Emperor in the vastness of the void and descend the Most High into the altar.\n\nNow, the patron [Name] has prepared this petition and established this wondrous fast. Having already presented the Three Petitions, we hope to fulfill the complete rites. We offer incense, flowers, lamps, candles, fruits, and delicacies with sincerity. Gazing upon the revered images, we pour out our hearts, exhausting worldly sentiments in devotion.\n\nMay these merits be dedicated to preserving and upholding [the patron]. The patron [Name] humbly prays: may the mountain of longevity grow taller, and the sea of blessings swell with waves. May his official salary and destiny be as enduring as the pine and cypress, and his years and life be preserved like the tortoise and crane. In office, may he ascend to the highest ranks, ever serving as a senior minister; in private life, may his fortunes flow smoothly, with divine spirits aiding and protecting him. May his dwelling overflow with joy and peace, and his household enjoy safety. May the nine generations of ancestors and the seven generations of forebears, the honored souls of past eras, and all sentient beings attain the ultimate transformation.\n\nThen, the luminous virtue of the Heavenly Worthies above and the sincerity of our devotion below will be in perfect accord.\n\nRespectfully presented for your attention.\n\nNext, the Twelve Vows are dispersed as per the usual rites.\nAt noon, the morning audience concludes, the dispersal is announced, and the Three Offerings are read aloud. From the singing of the Dao to the lighting of the incense burner, all follows the usual rites.\n\nNext, the titles are recited.\n\nThe officiants, your humble servants [Names], with united sincerity, respectfully present this petition to the Most High, Boundless Dao of the Great Clarity, the August Jade Emperor of the Central Yellow, the Nine Lands, the Twelve Immortals, the Lords of the Five Lands, the Nine Palaces, the Eight Trigrams, the Sun, Moon, and Stars, the Heavenly Offices, the Earthly Prisons, the Generals of the Year Star, the Earth-Soothing Divine Generals, the Four Directions, and all numinous powers.\n\nI have heard that when the celestial principles are fixed, the virtue of earth holds the honored position. The pure floats while the turbid congeals, and the eight directions await their division. The round heavens follow the path of the west’s return, while the square earth flows eastward. The principles of ghosts and spirits manifest the workings of yin and yang; the Five Phases are even more evident, giving birth to all things. From caves and nests to palaces and towers, from the beams above to the eaves below, the transmission of the sacred work of the ancient sages begins; from doors and windows to the carving of openings, the great models of the primordial emperors commence. The sixty jiazi cycles receive their notes from the Five Phases’ transformations; the twelve hours govern the prohibitions of the two dwellings’ directions.\n\nNow, as water overflows and floods, the dwelling must be rebuilt. With earth moved and construction begun, the old is renewed. Fearing transgressions, we present this offering. Humbly, we beseech your permission and, bowing twice, make our request.\n\nNext, the First Offering: incense, tea, and wine are presented.\n\nYour humble servant respectfully petitions the Heavenly Father, the Solar Emperor; the Earthly Mother, the Lunar Deity; the Northern Culmen, the Purple Tenuity, the Five Numinous Ones, the Great Tenuity Emperor; the Seven Primes of the Northern Dipper, the Three Terraces, the Nine Luminaries, the Twenty-Eight Constellations; the Three Officials of Heaven, Earth, and Water; the Nine Earthly Perfected Sovereigns; the Four Controllers, the Five Emperors; the taboos behind the dwelling; the twelve hours; the three hundred and sixty prohibitions; the one hundred and twenty killings of the xun cycle; the city gods of the directions; the Five Phases of the earthly mansion; and all divine spirits.\n\nI now humbly act on behalf of the disciple, whose dwelling requires repair, and thus commands workers to make additions. With much disruption, digging, and excavation, I fear offending the dragon spirits and disturbing the taboos. I present this offering and repentance, arranging incense and lamps. I pray for blessings from the Perfected Ones above and repent for transgressions against the earth below. My earnest pleas are recorded in this plain petition. The disciple’s words shall be respectfully proclaimed.\n\nNext, the petition is read.\n\nAs stated in the document, may the profound gaze know all.\n\nI have heard that heaven covers and earth bears, the sun and moon flow with radiance. The stars and constellations move in their courses above, while humans and creatures receive their endowment below. The Five Phases transform, and yin and yang alternate. Only the divine and numinous possess prohibitions and taboos.\n\nNow, [Name] has inherited his ancestral estate and continues the legacy of his forebears. Stationed in a strategic prefecture, governing a commandery, he undertakes works in accordance with his duties. In doing so, he must not avoid the labor of moving earth. Whether digging wells below or raising towers above, adorning halls and constructing courtyards, replacing the old and adding the new, he seeks only to enhance their grandeur. Yet, in digging and excavating, he fears harming the dragon generals; in construction, he worries about offending the divine spirits.",
      "overlap_context": "ale, each emulate the integrity of pine and bamboo, their countenances as steadfast as metal and stone. May a thousand disasters vanish like clouds with repentance, and ten thousand misfortunes scatter like rain through the fast. May his dwelling be tranquil, his wealth and silk abundant. May silkworms yield eightfold threads, and fields yield ninefold grains. May all endeavors succeed, and markets teem with activity. May even the dark spirits of the Six Paths partake of the remaining blessings.",
      "start_char": 4478,
      "end_char": 5717,
      "start_sentence": 269,
      "end_sentence": 353,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.52309489250183,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\灵宝半景斋仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "所以虔奉道门，请陈料法。 严施醮礼，供设香灯。 缯彩镇方，命财质信。 银钱驰马，逐位献陈。 酒脯飞觞，祭神如在。 伏惟四司五帝、土府真官。 斡銮驾於九宫，降醮筵於十地。 领纳诚礼，赐福留恩。 使眷属无灾害之虞，宅宇有周圆之庆。 经营叶泰，出入咸安。 五土城隍，欢喜成就。 再拜。 次第二献，上香、上茶、上酒 臣谨重上启，真灵上帝、五土尊神。 臣闻，造化之初，阴阳有物。 变穴处巢居之代，归京城宫殿之朝。 莫不涎坛范金，斧斤斲木。 上栋下宇，城垒堤防。 蚩尤拒敌於轩辕，兵甲遂流於后代。 天文垂象，五行通变於百神； 地理分形，八卦统成於万化。 一十二辰之宫府，六十甲子之纳音。 博古自此，而禁方上郡，因兹而避忌。 举家动用，民庶行藏，先宜拣日拣时，利方而吉，况今国家诏命，使主新临公署，兴修茸之功，使宅动广深之役，莫非掘凿，焕赫重新。 九宜难测於凶方，人物恐生於灾患，举家怀虑。 户主知修，依道门谢过之科。 醮设五方土德。 伏惟五方五帝，十二时辰，土府城隍，宅神禁忌。 纳阖宅之醮席，领斋主之虔祈。 兴佑家宅，克昌盛族。 蛾蚕结秀，仓箱资盈。 宅宇功成，装修事遂。 惟神惧喜，仰荷灵恩。 再拜。 次第三献，上香、上茶、上酒 臣谨重上启，天父地母、五土尊神、阖座众圣，及诸灵位。 臣谨为弟子，醮设百神。 只谢五帝，尽赐威光。 听兹关陈，许从谢过。 领纳醮礼，鉴映苹蘩。 佑助阖家，溢，昌人口。 门庭受福，户牖欢心。 愿从今醮之后，五帝顺行之化，四神和叙之恩。 八卦兴八节之康，九宫降九天之庆。 太岁正常生之道、太阴滋禄绶於人。 将军专镇化之权，月将致福祥之任。 青龙白虎，振威武於宅门； 朱雀北玄，耀文章於户牖。 玉堂金匮，天德明堂。 长招富贵之人，永保门庭之禄。 今则四向悬於宝镜，五方立於星刀，照十二位之正神，辟二八方之凶鬼。 五色缯彩，质命五龙。 五般钱财，献练五帝。 奠斯醮礼，以谢百神。 伏惟阖座尊神，特垂鉴佑。 依方镇守，永致吉祥。 祸去福归，灾消善集。 利康人物，兴盛家门。 在官者，禄受升荣； 在私者，所求皆得。 福星进照，积衅蠲消。 宅舍光明，户庭肃睦。 彩窗绣户，四时之喜气长盈； 香合华堂，八节之嘉声益振。 然后动凿兴工，四向无灾。 眷属一门，以时康泰。 瘟灾不起，风火无虞。 仓库资对，无诸耗散。 谢冥真於今夕，留福祚於此时。 所献钱财，馑具烧化。 臣及弟子，再拜奉送。 灵宝半景斋仪竟",
      "translated_text": "Thus, with reverence for the Daoist gate, we present the prescribed rites. Solemnly conducting the jiao offering, we prepare incense and lamps. Silk banners mark the directions, and wealth pledges sincerity. Silver coins and galloping steeds are presented at each station. Wine and dried meats are offered in flying cups, as if the gods were present.\n\nWe humbly invoke the Four Administrations, the Five Emperors, and the True Officials of the Earth Bureau. May they turn their imperial carriages within the Nine Palaces and descend upon the jiao altar across the Ten Lands. Receive our sincere offerings and bestow blessings and grace. Let our kin be free from harm’s dread, and our dwellings know perfect felicity. May all undertakings prosper, and all comings and goings be secure. Let the City Gods of the Five Directions rejoice in their fulfillment.\n\nBowing again, we make the second offering: incense, tea, and wine.\n\nYour servant respectfully petitions once more the True Numinous Supreme, the Five Earthly Sovereigns, and the Venerable Gods of the Soil. We recall that at the dawn of creation, yin and yang took form. From the age of cave dwellings and nest-like shelters, humanity progressed to the era of capital cities and palatial halls. Everywhere, earth was molded and metal cast, axes hewed wood. Roofbeams rose above, foundations lay below; walls and dikes were raised. Chi You defied the Yellow Emperor, and weapons have since flowed through the ages. The heavens display their signs, the Five Phases transform through the hundred spirits; the earth divides its forms, the Eight Trigrams govern the myriad changes. The twelve palaces of the celestial stems and the sixty cyclical sounds of the Heavenly Stems and Earthly Branches—from these ancient precedents, prohibitions arose in the upper commanderies, and taboos were established.\n\nFor all household activities, for the people’s every action, one must first select an auspicious day and hour, aligning with propitious directions. How much more so now, when by imperial decree, we newly assume office in this public hall, undertaking renovations and expansions—digging and excavating, making all resplendent and new. The nine portents of ill fortune are hard to fathom, and harm may befall people and things, filling the household with anxiety. Knowing this, the master of the house follows the Daoist rites of atonement. We conduct the jiao offering to the Five Earthly Virtues of the Five Directions.\n\nWe humbly invoke the Five Emperors of the Five Directions, the Twelve Celestial Stems, the Earth Bureau, the City Gods, and the household deities of prohibition. Receive the offerings laid before this dwelling, and accept the sincere prayers of the patron. Bless this home and prosper its lineage. Let silkworms yield their finest threads, and granaries overflow with abundance. May the construction of this dwelling be completed, and all renovations accomplished. May the gods rejoice in their favor and bestow their divine grace.\n\nBowing again, we make the third offering: incense, tea, and wine.\n\nYour servant respectfully petitions once more the Heavenly Father and Earthly Mother, the Five Earthly Sovereigns, the assembled host of sages, and all divine presences. Your servant, as disciple, conducts this jiao offering to the hundred gods. We give thanks to the Five Emperors and beseech their majestic radiance. Hear these entreaties and permit our atonement. Receive the offerings of the jiao rite, and let the sacred herbs shine forth. Assist and protect this household, that its people may flourish and multiply. Let the gates receive fortune and the windows know joy.\n\nFrom this jiao offering onward, may the transformations of the Five Emperors proceed in harmony, and the blessings of the Four Spirits be bestowed in order. May the Eight Trigrams bring well-being to the eight seasons, and the Nine Palaces descend with the felicity of the Nine Heavens. May the Grand Year uphold the constant Dao of generation, and the Grand Yin nourish the emoluments of humanity. May the Generals wield their transformative authority, and the Monthly Officers fulfill their task of bestowing good fortune. Let the Azure Dragon and White Tiger display their martial prowess at the gates; let the Vermilion Bird and Dark Warrior illuminate literary brilliance at the windows. May the Jade Hall and Golden Treasury, the Celestial Virtue and Bright Hall, long attract the noble and wealthy, and forever safeguard the household’s prosperity.\n\nNow, we hang the precious mirror in the four directions and place the star knives in the five. They illuminate the twelve true gods and repel the malevolent spirits of the sixteen directions. Five-colored silks pledge the Five Dragons; five kinds of coins are offered to the Five Emperors. We present this jiao offering to atone before the hundred gods.\n\nWe humbly beseech the assembled divine host to deign to witness and protect. Guard each direction and bestow perpetual good fortune. Let misfortune depart and blessings return; let calamities vanish and goodness gather. Bring well-being to people and prosperity to the household. For those in office, let emoluments and honors ascend; for those in private life, let all desires be fulfilled. May the Star of Fortune shine upon us, and all transgressions be purged. Let the dwelling radiate light, and the household abide in harmony. Through embroidered windows and painted doors, may the joyous qi of the four seasons ever fill; in fragrant halls, may the auspicious sounds of the eight festivals resound.\n\nThen, when we dig and build, may the four directions know no disaster. May the entire household enjoy timely peace and prosperity. Let no pestilence arise, and no fear of wind or fire disturb us. May granaries and storehouses be well-stocked, with no loss or dissipation. We atone before the unseen powers this evening and leave blessings for this moment. The offered coins and paper money are now burned.\n\nYour servant and disciples bow again in farewell.\n\nThe Lingbao Half-Day Purification Rite is now complete.",
      "overlap_context": "cy of his forebears. Stationed in a strategic prefecture, governing a commandery, he undertakes works in accordance with his duties. In doing so, he must not avoid the labor of moving earth. Whether digging wells below or raising towers above, adorning halls and constructing courtyards, replacing the old and adding the new, he seeks only to enhance their grandeur. Yet, in digging and excavating, he fears harming the dragon generals; in construction, he worries about offending the divine spirits.",
      "start_char": 5717,
      "end_char": 7258,
      "start_sentence": 354,
      "end_sentence": 425,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.438944339752197,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\灵宝半景斋仪.txt",
        "category": "威仪类"
      }
    }
  ]
}