{
  "source_id": "灵宝净明新修九老神印伏魔秘法",
  "source_file": "chunked_daozang\\灵宝净明新修九老神印伏魔秘法.json",
  "total_chunks": 4,
  "total_original_chars": 3253,
  "total_translated_chars": 19455,
  "total_translation_time": 100.01533007621765,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\方法类\\灵宝净明新修九老神印伏魔秘法.txt",
    "category": "方法类"
  },
  "full_translation": "*The Precious Scripture of the Purified and Luminous Newly Revised Nine Elder Spirit Seals for Subduing Demons*\n\n**Title:** *The Precious Scripture of the Purified and Luminous Newly Revised Nine Elder Spirit Seals for Subduing Demons*\n**Author:** He Shoucheng of the Song Dynasty\n**Volume:** One\n**Source Text:** *Zhengtong Daoist Canon*, Section of Cave Mystery (Dongxuan), Category of Methods\n\n---\n\n*The Precious Scripture of the Purified and Luminous Newly Revised Nine Elder Spirit Seals for Subduing Demons*\nCompiled by He Shoucheng, Assistant Instructor of the Yi Zhen Altar\n\nThe Three Caverns’ true scriptures are treasured by the sagely ranks, concealed within the Upper Palace, bound by precepts and prohibitions. Unless heaven and earth are newly opened, their texts do not emerge. Those who encounter them are always persons of golden names and jade characters, long inscribed in the registers of immortals.\n\nNow, the secret methods of the *Upper Clarity Spirit Seals for Subduing Demons and Refining Form and Spirit* were personally received by the Nine Elder Lords from the Primordial Honored One at the dawn of the Dragon Han kalpa, transmitted to instruct those who study immortality. They constitute the pivotal essence of the *Lingbao* tradition. Since ancient times, those who have succeeded in attaining realization as perfected immortals are too numerous to recount in detail.\n\nFormerly, the Highly Illuminated Great Master Xu, having received the method from the Dao Lord, the Great Immortal Chenmu, served in seclusion during the Eastern Jin, capturing demons and slaying monsters, marking rivers and enchanting waters to alleviate the afflictions and illnesses of the people. Through accumulating merit and virtue, he later ascended his entire family to the celestial realms. Though his disciples followed in succession to become immortals, and those who inherited the method have never been lacking, the texts have been transmitted and practiced for so long that errors have inevitably multiplied, leaving no means of verification.\n\nDuring the revival of the Great Song, in the year *zuo’e*, the Six Perfected descended in spirit upon the Yu River, revealing the *Lingbao Purified and Luminous Secret Methods*. They transformed the people through the teachings of loyalty, filial piety, integrity, and caution, and appointed the Divine Cavern Immortal Minister as the instructor of scholars. Two years later, in the eighth month of autumn, the Highly Illuminated Great Master suddenly manifested at the former site of his traveling tent—now the Jade Dragon Longevity Palace in Jiangxi. Thereupon, he established the immortal altar, naming it *Yi Zhen* (\"Winged Perfection\"), to welcome those of superior knowledge. All doubts and difficulties regarding the scriptures were to be freely inquired. At that time, newly initiated disciples of the Nine Elder Method requested clarification of the text. Through the true compassion of the immortals, the essentials of the Dao were elucidated, expounding the two chapters on the *Qi Mirror* and the *Spirit Seals*, correcting omissions and errors. Subsequently, he entrusted his disciples to revise all talismans, incantations, and methods. Upon completion, the text was presented for the true inspection of the immortals, who granted their approval. He Shoucheng was then commanded to compose a preface, fully expressing the intent behind the revision to ensure its enduring transmission.\n\nShoucheng, ashamed of his coarse nature and limited understanding, can offer little to the sacred teachings. Yet, having been graciously accepted by the true master as a disciple of the Lingbao tradition for three years now, I humbly set forth this account at the beginning of the text.\n\nConsider this: when the sands of the Long River converge, within the Five Tombs, eight hundred earthbound immortals are destined to emerge. The master hailed from Yuzhang, a fact recorded in the local annals. Today, even yellow-haired youths and white-haired elders recite it familiarly—surely this is no falsehood.\n\nAll who enter the gate of the true master and receive this method should cultivate it with diligence.\n\nRespectfully composed on the Double Ninth Festival of the *xinhai* year of the Shaoxing era.\n\n---\n\n*The Precious Scripture of the Purified and Luminous Newly Revised Nine Elder Spirit Seals for Subduing Demons*\n**Collated and Annotated by the Divine Cavern Sect by Imperial Decree**\n**Edited by the Divine Cavern Sect by Imperial Decree**\n**Compiled by the Taiyuan Judiciary by Imperial Decree**\n\n---\n\n**General Discourse on the Nine Elder Lords’ Spirit Seals**\n\nMaster Danyang said: The Dao is fundamentally *qi*. It coalesces *qi* to form its body and disperses *qi* to enact its function. The Great Dao is the profound obscurity of *qi*, born before heaven and earth, diffused beyond existence and non-existence. Characters are structured by *qi*, texts are composed by *qi*, forms are gathered by *qi*, and sounds are harmonized by *qi*. The Dao is fundamentally *qi*.\n\nThe superior adept unites *qi* with the Dao, thus never squandering their *qi*, which abides in oneness. Oneness is the true unity: spirit merges with the heart, the heart interacts with spirit, and spirit is united through *qi*. As the lodestone attracts iron or kingfisher feathers shatter gold, this is the nature of things. When nature unites with the Dao, the Dao is indeed *qi*.\n\nNow, with true essence—essence is oneness, and oneness is the Dao. By virtue of true essence, one summons the correct *qi*; by uniting with the Dao, one becomes a great immortal. The immortal refines essence to unite with *qi*, and *qi* to unite with the Dao. The spirit’s radiance is purified and luminous, unburdened by external things. As the burning mirror faces the sun and fire arises, or the *fangzhu* vessel responds to the moon and water arrives, water is the great *qi* of spontaneity. The Dao unites with spontaneity, attaining the correctness of yin and yang, harmonizing their center. Pure and undispersed, refined and unadulterated, the sun thus possesses radiance, and the moon its brilliance.\n\nHumans, when they embody stillness, attain the fullness of their nature; when they attain clarity, their hearts become penetrating. With nature fulfilled and heart enlightened, they resonate with the palaces of the sun and moon. The Dao is fundamentally round and empty: roundness is the body of *qi*, emptiness is its function. Attaining the Dao of roundness and emptiness is called *purified and luminous*. Purified and luminous, one harmonizes with correctness and attains the center, uniting with the affective.\n\nThe supreme Dao is not sought through affect, yet here affect is spoken of. Truly, affect arises from sincerity, and when affect stirs, the Dao naturally emerges. The Dao is *qi*; uniting the heart with *qi*, when the heart moves, affect arises—affect is fundamentally born within. The superior adept studies the Dao without clinging to any single thing, nor abandoning any thing. To say the Dao can be sought through affect is incorrect; it is merely employed as a provisional means.\n\nThe Dao does not reside in breathing or absorption; breathing and absorption are external, while the Dao is internal. Since the Dao is internal, it can be known through breathing and absorption, yet this knowing is also external. The Dao pervades the great void, encompassing and unifying all. Grasping the intent of the Dao, one understands that what is called affect makes the *Spirit Seals* readily comprehensible.\n\nThe superior adept regards the seal as the Dao, for the Dao is entrusted to the seal to enact it. The seal is like the moxa placed upon the burning mirror. The *Spirit Seals for Subduing Demons*—variant edition of this seal.\n\n**Seal Exegesis**\nThe Nine Elder Lords of *Upper Clarity* reverse corpses, revive the dead, cure illnesses, subdue demons, and expose transgressions.\n\n**Chapter on the Rectification of Ghosts and Spirits Across the Three Realms**\n\nThis talismanic text comprises thirty-five characters, to be carved in standard script upon the reverse side in white relief. The seal may be fashioned from gold, silver, jade, or stone, or from thunder-struck jujube wood or other hardwoods. Its dimensions are as follows: two *cun* and four *fen* in width, corresponding to the twenty-four *qi*; two *cun* and eight *fen* in length, corresponding to the twenty-eight lunar lodges; and one *cun* and two *fen* in thickness, corresponding to the twelve earthly branches. It is to be crafted on the days of the Three Origins and Eight Festivals, or on *jiazi*, *gengshen*, or days governed by the *nayin* of Water or Fire, with the artisan purified and facing east. Upon completion, a petition is submitted to the *Dushi* (Ordination Master) for presentation to the Supreme Mystery Capital. On the night of ordination, the seal is placed upon an altar in the open air, offered with incense, flowers, and consecrated water, and venerated until dawn before being withdrawn. Neither fowl nor dog nor layperson may witness this. After three such nights of veneration, the seal may be employed.\n\n**Method for Receiving and Maintaining the Seal**\nEach day at dawn, burn incense, form the Mudrā of the Day Lord, and gaze upon the seal while reciting:\n*\"Successor of the Dharma, so-and-so, respectfully offers this incense to the divine spirits and guardian officials of the Heavenly Seal, proclaiming: When the Primal Beginning unfolded its chart, it arose from the East. The Nine Qi Sovereign Lords obtained this divine seal. With vermilion script and jade characters, heaven and earth are pacified. Concealed tones and inner names serve as the talismanic signs for ghosts and spirits. I bear this seal and execute the Mandate of Heaven. It guards my person, aids others, subdues demons, and rectifies the perverse. Wherever I go, none may obstruct; all responses follow my invocation.\"*\nThen, facing east, draw in the *qi* of the sun and blow it into the seal before releasing the Mudrā.\n\n**Method for Using the Seal**\nWhen administering aid, first burn incense and, according to the petitioner’s circumstances, invoke the Nine Elder Lords of *Upper Clarity* and all divine spirits of the Dharma, entreating their salvific protection. When imprinting, hold the Mudrā with the left hand, bending the middle finger to press the center of the palm. With the right hand, grasp the seal and visualize it transforming into the bodies of the Nine Elder Lords, clad in the regalia of *Upper Clarity*, flanked by their attending officials. Then, facing east, draw in the true *qi* of the sun and blow it onto the imprinted characters. If the seal is used exclusively for healing, inscribe the characters *\"Seal Arrives—Swift Peace\"* upon it. After affixing the signature, draw in the sun’s true *qi* once more, blow it onto the seal, release the Mudrā, and visualize the divine generals following the seal to its destination.\n\n**Method for Dispatching the Seal**\nTo expel malevolent spirits or suppress demonic influences, imprint the petitioner’s condition in the usual manner and command the local Controller of Destiny and Earth God to execute the decree by burning the document. To dispel malevolent entities, inscribe the matter, imprint it, and affix it to the site for pacification. For injuries or fractures, apply the imprint to the afflicted area. For seasonal epidemics or malarial fevers, affix it to the front and back of the heart. For sores, ulcers, or abscesses, burn the imprint to ash and apply it as a salve or wash. For possession, nightmares, or demonic assaults, wear the imprint or ingest it. For eye ailments, steep the imprint in pure water and use it to wash the eyes. In each case, healing and peace will be attained.\n\n**Seal Design**\n\nThe right seal may be carved from any wood. Once completed, submit it alongside the previous seal. When the master encounters an *shen* day, use this seal on memorials and official documents, both for superior and subordinate communications. When employing the seal, form the Big Dipper mudra.\n\n**Daily Cultivation Method**\n**Upper Prime: Yellow Court True Talisman for Dispelling Impurities**\nInscribe this talisman in cinnabar. Each morning at dawn, face east, form the *wu* mudra, recite the incantation, and swallow one talisman with pure water to dispel impurities, purify the body, and gather vital *qi*.\n\n**Incantation:**\nThe Five Thearchs command the demonic legions,\nIron blades strike front—demon kings submit.\nFour fierce steeds spread forth, safeguarding life and root.\nSwiftly, swiftly, as decreed by the Nine Elder Thearchs of Supreme Purity.\n\n**Daily Cultivation Method**\n**Upper Prime: True Talisman for Guarding the One and Prolonging Life**\nInscribe this talisman in cinnabar. Each day at noon, face east, form the *zi* mudra, recite the incantation, and swallow one talisman with pure water to pacify the spirit, guard the One, protect life, and prolong existence.\n\n**Incantation:**\nProlonging life and augmenting destiny, revered spirits transcend calamity,\nReviving the dead from their skeletal frames, immeasurably delivering beings.\nHolding registers and grasping ledgers, all ascend before the Thearch.\nSwiftly, swiftly, as decreed by the Nine Elder Thearchs of Supreme Purity.\n\n**The Mirror of Pure Bright *Qi***\nMaster Danyang said: *Qi* is emptiness that responds with efficacy; it is the marshal of spirit and the master of the body. Heaven possesses *qi*, thus it arches high and vast, and by its height, it descends to nourish below. Earth possesses *qi*, thus it is thick and expansive, and by its depth, it ascends to interact above. The sun, moon, and stars possess *qi*, thus they are luminous and shine upon the world. Rivers, seas, mountains, and peaks possess *qi*, thus they coalesce and take form. Humans possess *qi*: the head is round, modeling heaven’s *qi*; the feet are square, modeling earth’s *qi*. The eyes and hair emulate the sun, moon, and stars; the pores and hair resemble mountains, rivers, and seas. The circulation of this single *qi*—yin and yang, odd and even—flows in communion with heaven and earth. Heaven and earth endure because their *qi* circulates without obstruction. Yet humans often die prematurely—why? It is merely a matter of whether one can or cannot employ *qi*. Thus, the movement and concealment of *qi* follow a principle, called *pure brightness*. When *qi* is pure and bright, it fills and completes; when filled and complete, it pervades all, reaching the essence of destiny. This is the subtle principle of heaven and earth, the interplay of yin and yang, the timing of ascent and descent, and the generation of beings. Within the human body, one may emulate heaven above and earth below, drawing the upright *qi* of heaven and earth to harmonize with the self. Through this, one may transform essence, alter fate, and traverse life and death, thereby attaining numinous efficacy—this is called *inner refinement*. With inner refinement, the elixir crucible forms, the yellow sprout arises, and auspicious clouds flourish. One may then exhale wind and clouds, sneeze forth thunder, command summer and winter, summon autumn and spring, transform sunlight into rain, and rain into prolonged showers. The upright *qi* of heaven and earth resides within me, not in others. The dead may be revived; the living may be extinguished. When the human Dao is upright, perverse *qi* that invades will be pacified by my *qi*. When the demonic Dao is perverse and oppresses humanity, it will be subdued by the *qi* of my Dao. Those who study the Dao and attain this are said to possess the *qi* mirror’s secret. The method of circulating and nourishing *qi* must grasp its mechanism. To grasp its mechanism, one must understand its discourse.\n\n**Daily *Qi*-Ingestion Method**\nEach morning, face east, burn incense, form the Solar Lord mudra with both hands, and click the teeth nine times. Visualize the Nine Elder Thearchs and the Solar Supreme Thearch within the solar orb. The sun’s hue is purple-red, its nine rays of rosy light illuminating the vast sky like the dawn. Release the mudra, clasp the hands, and bow while reciting the prayer:\n\n*Disciple of the lineage [Name], burns incense and offers it to the Nine Elder Thearchs and the Solar Supreme Thearch. At this dawn hour, I burn incense, purify my heart, and cleanse my intent. I pay homage to the Solar Palace, ingesting and absorbing the upright *qi*. I humbly beseech the Solar Supreme Thearch to bestow radiant light, dispelling all darkness and stagnation, nurturing the upright and true, and sweeping away perverse impurities. May the hundred spirits be pacified, the myriad demons retreat, my ears hear clearly, my eyes see brightly, my heart attain communion, and my nature gain wisdom. May I unite with the Dao and attain longevity and enduring vision.*\n\nClick the teeth three more times, visualize the sun’s purple-red light illuminating your face, then inhale through the nose and swallow, as described below for ingesting the four *qi*, totaling thirty-six breaths.\n\n**First *Qi* Incantation:**\nCentered within the five *qi*, harmonizing the hundred spirits.\nWhen ingesting the first *qi*, let both hands hang naturally, form the mudra for the affliction, and recite the incantation seven times. Release the left-hand mudra, switch to the throat mudra, clasp the waist, inhale one breath, and swallow. With the breath, reform the mudra, recite the incantation seven more times, release the right-hand mudra, switch to the throat mudra, clasp the waist, inhale one breath, and swallow. With the dark *qi*, reform the mudra, then raise both hands, crossing the throat mudras before the mouth—left hand above, right hand below. Recite the incantation seven more times, open the mouth, inhale one breath, and blow onto the mudra before releasing it. This completes one cycle. Perform this three times, ingesting a total of nine breaths of *qi*.\n\n**Second *Qi* Incantation:**\nNoble Lord Yuan Ying, Venerable White Prime,\nGreat One Controller of Destiny, Peach and Plum unite to prolong life.\nWhen ingesting the second *qi*, let both hands hang naturally, form the Northern Asterism mudra, and recite the incantation. Inhale *qi* as in the first *qi* method, only changing the mudra’s name. Perform three cycles, ingesting a total of nine breaths of *qi*.\n\n**Third *Qi* Incantation:**\nEastward, expel demonic essences,\nSever the blades of the six ghosts.\nThe *qi* of all heavens surges—\nMy Dao daily ascends in glory.\nWhen ingesting the third *qi*, let both hands hang naturally, form the Purple Court mudra, and recite the incantation. Inhale *qi* as in the first *qi* method, only changing the mudra’s name. Perform three cycles, ingesting a total of nine breaths of *qi*.\n\n**Fourth *Qi* Incantation:**\nDemons dare not trespass,\nGhosts and malevolent spirits vanish.\nThe Three Officials of Mount Fengdu,\nInspect the demonic encampments.\n\nWhen ingesting the fourth *qi*, let both hands hang naturally, form the Solar Lord mudra, and recite the incantation. Inhale *qi* as in the first *qi* method, only changing the mudra’s name. Perform three cycles, ingesting a total of nine breaths of *qi*.\n\nThe mudra’s name: Palm Circle.\nHere ends the *Lingbao Jingming Xinxiou Jiulao Shenyin Fumo Mifa* (The Numinous Treasure’s *Pure Clarity* Newly Revised Nine Elders’ Divine Seal Secret Method for Subduing Demons).",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "灵宝净明新修九老神印伏魔秘法 经名：灵宝净明新修九老神印伏魔秘法。 宋何守澄撰。 一卷。 底本出处：《正统道藏》洞玄部方法类。 灵宝净明新修九老神印伏魔秘法 翼真坛副演教师何守澄撰 三洞真经，列圣所宝，秘於上宫，约以科禁，自非天地一开，其文不出。 有遇之者，皆金名玉字，夙着仙谱之人也。 粤惟上清伏魔印章受炼形神秘法，乃九老帝君，龙汉劫初，亲得元尊之旨，下教学仙之士，实为灵宝之枢要。 历古以来，成功证为列真者，未易详述。 昔高明大使许君，受法於道君谌姆大仙，吏隐东晋，摄邪诛怪，标江咒水，以极生民之灾病，积功累德，而后举全家於霄汉者。 逮诸弟子继踵仙去，虽嗣法者代不乏人，然文字传习之久，例多谬误，无以取证。 炎宋中兴，岁在作噩，六真降神於渝水，出示灵宝净明秘法，化民以忠孝廉慎之教，乃命洞神仙卿为训导学者师。 越二年，秋八月，高明大使覢欻临于游帷故地，即今之江西玉隆万寿宫也。 於是肇建仙坛，名曰翼真，以延善知识。 凡经典疑难，悉听扣问。 时新学九老法弟子，因以其书请益焉。 果蒙真慈，发明道要，说气镜、神印二篇，证诸阙误。 继委门人，悉以符呎诀法厘正之。 书成，以呈真鉴，赐可。 又命何守澄序，具重修之意，以久其传。 守澄自愧肉质地行，闻见隘塞，有何补於宗教。 然误蒙真师收录，充灵坛下弟子，今已三年矣，谨直序其事於篇首。 顾唯龙沙已合，五陵之内，应地仙者八百人。 而师出於豫章，此言载於方册。 今黄童白叟，皆熟诵之，信不诬也。 凡游於真师之门，得此法者，宜精进焉。 时绍兴辛亥岁重阳日，谨序。 灵宝净明新修九老神印伏魔秘法 洞神抄注奉真旨编修洞神节录奉真旨同修太元判令奉真旨校勘 九老帝君神印总论 丹阳子曰：道本炁也。 合炁以为体，散炁以为用。 大道，炁之瞑漠也，生乎天地之先，散乎有无之表。 字因炁而结，文因炁而成，形因炁而聚，声因炁而合。 道本炁也。 上士以炁合道，故不暴其炁，炁止於一。 一者真一，神合於心，心与神交，神由炁合。 磁石吸铁，翡翠碎金者，性也。 性一合道，道果炁也。 夫以真精，精者一也。 一者道也。 以真精故召正炁，以合道故成大仙。 仙炼精合炁，以炁合道，神景净明，不役外物。 阳燧向日，火随而生。 方诸感月，水旋而至。 水大，自然之炁也。 道合自然，得阴阳之正，适阴阳之中，纯朴不散，精粹无杂，所以日有光明，月有辉耀。 人禀乎静则性达，得乎明则心通。 性达心通，故交感於日月之宫。 道本圆虚。 圆者气之体，虚者气之用。 得圆虚之道，故谓之浄明。 浄明，则适正得中，合於有情。 至道非情求也，而此言情，诚实生情，情起而道自生。 以道者炁也，以心合炁，心动而情遂生，情本生於中也。 上士学道，不执一物，不废一物。 谓道可以情求，则非也，有假以为用也。 道不在呼吸采取也，呼吸采取，外也，而道在内也。 道在内，故可因呼吸采取，而知亦在外。 道弥满太虚，贯该总属，得道之意。 而知所谓情，则神印者，可易晓也。 上士以印为道，道托印以行之尔。 印者，如燧珠之艾炷耳。 伏魔神印 别本此印 印释 上清九老帝君，回尸起死治病，伏魔紏察。",
      "translated_text": "*The Precious Scripture of the Purified and Luminous Newly Revised Nine Elder Spirit Seals for Subduing Demons*\n\n**Title:** *The Precious Scripture of the Purified and Luminous Newly Revised Nine Elder Spirit Seals for Subduing Demons*\n**Author:** He Shoucheng of the Song Dynasty\n**Volume:** One\n**Source Text:** *Zhengtong Daoist Canon*, Section of Cave Mystery (Dongxuan), Category of Methods\n\n---\n\n*The Precious Scripture of the Purified and Luminous Newly Revised Nine Elder Spirit Seals for Subduing Demons*\nCompiled by He Shoucheng, Assistant Instructor of the Yi Zhen Altar\n\nThe Three Caverns’ true scriptures are treasured by the sagely ranks, concealed within the Upper Palace, bound by precepts and prohibitions. Unless heaven and earth are newly opened, their texts do not emerge. Those who encounter them are always persons of golden names and jade characters, long inscribed in the registers of immortals.\n\nNow, the secret methods of the *Upper Clarity Spirit Seals for Subduing Demons and Refining Form and Spirit* were personally received by the Nine Elder Lords from the Primordial Honored One at the dawn of the Dragon Han kalpa, transmitted to instruct those who study immortality. They constitute the pivotal essence of the *Lingbao* tradition. Since ancient times, those who have succeeded in attaining realization as perfected immortals are too numerous to recount in detail.\n\nFormerly, the Highly Illuminated Great Master Xu, having received the method from the Dao Lord, the Great Immortal Chenmu, served in seclusion during the Eastern Jin, capturing demons and slaying monsters, marking rivers and enchanting waters to alleviate the afflictions and illnesses of the people. Through accumulating merit and virtue, he later ascended his entire family to the celestial realms. Though his disciples followed in succession to become immortals, and those who inherited the method have never been lacking, the texts have been transmitted and practiced for so long that errors have inevitably multiplied, leaving no means of verification.\n\nDuring the revival of the Great Song, in the year *zuo’e*, the Six Perfected descended in spirit upon the Yu River, revealing the *Lingbao Purified and Luminous Secret Methods*. They transformed the people through the teachings of loyalty, filial piety, integrity, and caution, and appointed the Divine Cavern Immortal Minister as the instructor of scholars. Two years later, in the eighth month of autumn, the Highly Illuminated Great Master suddenly manifested at the former site of his traveling tent—now the Jade Dragon Longevity Palace in Jiangxi. Thereupon, he established the immortal altar, naming it *Yi Zhen* (\"Winged Perfection\"), to welcome those of superior knowledge. All doubts and difficulties regarding the scriptures were to be freely inquired. At that time, newly initiated disciples of the Nine Elder Method requested clarification of the text. Through the true compassion of the immortals, the essentials of the Dao were elucidated, expounding the two chapters on the *Qi Mirror* and the *Spirit Seals*, correcting omissions and errors. Subsequently, he entrusted his disciples to revise all talismans, incantations, and methods. Upon completion, the text was presented for the true inspection of the immortals, who granted their approval. He Shoucheng was then commanded to compose a preface, fully expressing the intent behind the revision to ensure its enduring transmission.\n\nShoucheng, ashamed of his coarse nature and limited understanding, can offer little to the sacred teachings. Yet, having been graciously accepted by the true master as a disciple of the Lingbao tradition for three years now, I humbly set forth this account at the beginning of the text.\n\nConsider this: when the sands of the Long River converge, within the Five Tombs, eight hundred earthbound immortals are destined to emerge. The master hailed from Yuzhang, a fact recorded in the local annals. Today, even yellow-haired youths and white-haired elders recite it familiarly—surely this is no falsehood.\n\nAll who enter the gate of the true master and receive this method should cultivate it with diligence.\n\nRespectfully composed on the Double Ninth Festival of the *xinhai* year of the Shaoxing era.\n\n---\n\n*The Precious Scripture of the Purified and Luminous Newly Revised Nine Elder Spirit Seals for Subduing Demons*\n**Collated and Annotated by the Divine Cavern Sect by Imperial Decree**\n**Edited by the Divine Cavern Sect by Imperial Decree**\n**Compiled by the Taiyuan Judiciary by Imperial Decree**\n\n---\n\n**General Discourse on the Nine Elder Lords’ Spirit Seals**\n\nMaster Danyang said: The Dao is fundamentally *qi*. It coalesces *qi* to form its body and disperses *qi* to enact its function. The Great Dao is the profound obscurity of *qi*, born before heaven and earth, diffused beyond existence and non-existence. Characters are structured by *qi*, texts are composed by *qi*, forms are gathered by *qi*, and sounds are harmonized by *qi*. The Dao is fundamentally *qi*.\n\nThe superior adept unites *qi* with the Dao, thus never squandering their *qi*, which abides in oneness. Oneness is the true unity: spirit merges with the heart, the heart interacts with spirit, and spirit is united through *qi*. As the lodestone attracts iron or kingfisher feathers shatter gold, this is the nature of things. When nature unites with the Dao, the Dao is indeed *qi*.\n\nNow, with true essence—essence is oneness, and oneness is the Dao. By virtue of true essence, one summons the correct *qi*; by uniting with the Dao, one becomes a great immortal. The immortal refines essence to unite with *qi*, and *qi* to unite with the Dao. The spirit’s radiance is purified and luminous, unburdened by external things. As the burning mirror faces the sun and fire arises, or the *fangzhu* vessel responds to the moon and water arrives, water is the great *qi* of spontaneity. The Dao unites with spontaneity, attaining the correctness of yin and yang, harmonizing their center. Pure and undispersed, refined and unadulterated, the sun thus possesses radiance, and the moon its brilliance.\n\nHumans, when they embody stillness, attain the fullness of their nature; when they attain clarity, their hearts become penetrating. With nature fulfilled and heart enlightened, they resonate with the palaces of the sun and moon. The Dao is fundamentally round and empty: roundness is the body of *qi*, emptiness is its function. Attaining the Dao of roundness and emptiness is called *purified and luminous*. Purified and luminous, one harmonizes with correctness and attains the center, uniting with the affective.\n\nThe supreme Dao is not sought through affect, yet here affect is spoken of. Truly, affect arises from sincerity, and when affect stirs, the Dao naturally emerges. The Dao is *qi*; uniting the heart with *qi*, when the heart moves, affect arises—affect is fundamentally born within. The superior adept studies the Dao without clinging to any single thing, nor abandoning any thing. To say the Dao can be sought through affect is incorrect; it is merely employed as a provisional means.\n\nThe Dao does not reside in breathing or absorption; breathing and absorption are external, while the Dao is internal. Since the Dao is internal, it can be known through breathing and absorption, yet this knowing is also external. The Dao pervades the great void, encompassing and unifying all. Grasping the intent of the Dao, one understands that what is called affect makes the *Spirit Seals* readily comprehensible.\n\nThe superior adept regards the seal as the Dao, for the Dao is entrusted to the seal to enact it. The seal is like the moxa placed upon the burning mirror. The *Spirit Seals for Subduing Demons*—variant edition of this seal.\n\n**Seal Exegesis**\nThe Nine Elder Lords of *Upper Clarity* reverse corpses, revive the dead, cure illnesses, subdue demons, and expose transgressions.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1245,
      "start_sentence": 0,
      "end_sentence": 68,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.2996506690979,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\灵宝净明新修九老神印伏魔秘法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "三界鬼神皈正法事章文 章文三十五字，於背正雕白字，真楷书之。 右印用金银玉石，或雷震枣木，坚硬之木，皆可。 印式，阔二寸四分，以应二十四炁； 长二寸八分，以应二十八宿； 厚一寸二分，以应一十二辰。 以三元八节、甲子庚申，或丁甲纳音水火之日，斋其工匠，面东造之。 印成，请度师保奏，呈泰玄都省。 自授度之夕，於露天置案设印，以香花今水祭其神印，达旦即收入。 勿令鸡犬归人见之。 如是三夜，祭讫，方可用行。 受持印章法 每日清日一烧香，掐日君诀，视印祝曰： 嗣法某，谨以信香，告于天印神灵侍卫官将曰：元始开图，必自乎震。 九炁帝君，获此神印。 赤书玉字，天地安镇。 隐音内名，鬼神符信。 我佩印章，摄行天命。 护身济人，伏魔皈正。 无往不通，有感皆应。 即望东取太阳炁，吹入印中，放诀。 用印诀 凡行救治，先焚香，据来人事意，启白上清九老帝君，法中一切灵神，乞赐救护。 次用印时，左手握诀，屈中指掐掌心中也。 右手持印，存变为九老帝君身，御上清冠服，左右官将侍卫。 方用印，即望东取太阳真炁，吹於所印文字上。 若专给印救治，即就印上，再书印到速安四字。 又押字讫，再取太阳真炁，吹印上，发诀，想神将随印前去也。 发印诀 如驱邪伐祟，依常式印其来状，令烧付本家司命土地行遣。 如辟除妖怪，书事用印，贴本处安镇。 如肢体伤折者，贴印於疼痛处。 时瘟疟疾者，贴於前后心。 疮疡瘫疽者，烧灰，或涂或洗。 鬼忤恶梦者，或佩或吞。 目疾者，浄水浸印，洗之。 各获安愈也。 法印式",
      "translated_text": "**Chapter on the Rectification of Ghosts and Spirits Across the Three Realms**\n\nThis talismanic text comprises thirty-five characters, to be carved in standard script upon the reverse side in white relief. The seal may be fashioned from gold, silver, jade, or stone, or from thunder-struck jujube wood or other hardwoods. Its dimensions are as follows: two *cun* and four *fen* in width, corresponding to the twenty-four *qi*; two *cun* and eight *fen* in length, corresponding to the twenty-eight lunar lodges; and one *cun* and two *fen* in thickness, corresponding to the twelve earthly branches. It is to be crafted on the days of the Three Origins and Eight Festivals, or on *jiazi*, *gengshen*, or days governed by the *nayin* of Water or Fire, with the artisan purified and facing east. Upon completion, a petition is submitted to the *Dushi* (Ordination Master) for presentation to the Supreme Mystery Capital. On the night of ordination, the seal is placed upon an altar in the open air, offered with incense, flowers, and consecrated water, and venerated until dawn before being withdrawn. Neither fowl nor dog nor layperson may witness this. After three such nights of veneration, the seal may be employed.\n\n**Method for Receiving and Maintaining the Seal**\nEach day at dawn, burn incense, form the Mudrā of the Day Lord, and gaze upon the seal while reciting:\n*\"Successor of the Dharma, so-and-so, respectfully offers this incense to the divine spirits and guardian officials of the Heavenly Seal, proclaiming: When the Primal Beginning unfolded its chart, it arose from the East. The Nine Qi Sovereign Lords obtained this divine seal. With vermilion script and jade characters, heaven and earth are pacified. Concealed tones and inner names serve as the talismanic signs for ghosts and spirits. I bear this seal and execute the Mandate of Heaven. It guards my person, aids others, subdues demons, and rectifies the perverse. Wherever I go, none may obstruct; all responses follow my invocation.\"*\nThen, facing east, draw in the *qi* of the sun and blow it into the seal before releasing the Mudrā.\n\n**Method for Using the Seal**\nWhen administering aid, first burn incense and, according to the petitioner’s circumstances, invoke the Nine Elder Lords of *Upper Clarity* and all divine spirits of the Dharma, entreating their salvific protection. When imprinting, hold the Mudrā with the left hand, bending the middle finger to press the center of the palm. With the right hand, grasp the seal and visualize it transforming into the bodies of the Nine Elder Lords, clad in the regalia of *Upper Clarity*, flanked by their attending officials. Then, facing east, draw in the true *qi* of the sun and blow it onto the imprinted characters. If the seal is used exclusively for healing, inscribe the characters *\"Seal Arrives—Swift Peace\"* upon it. After affixing the signature, draw in the sun’s true *qi* once more, blow it onto the seal, release the Mudrā, and visualize the divine generals following the seal to its destination.\n\n**Method for Dispatching the Seal**\nTo expel malevolent spirits or suppress demonic influences, imprint the petitioner’s condition in the usual manner and command the local Controller of Destiny and Earth God to execute the decree by burning the document. To dispel malevolent entities, inscribe the matter, imprint it, and affix it to the site for pacification. For injuries or fractures, apply the imprint to the afflicted area. For seasonal epidemics or malarial fevers, affix it to the front and back of the heart. For sores, ulcers, or abscesses, burn the imprint to ash and apply it as a salve or wash. For possession, nightmares, or demonic assaults, wear the imprint or ingest it. For eye ailments, steep the imprint in pure water and use it to wash the eyes. In each case, healing and peace will be attained.\n\n**Seal Design**",
      "overlap_context": "Grasping the intent of the Dao, one understands that what is called affect makes the *Spirit Seals* readily comprehensible.\n\nThe superior adept regards the seal as the Dao, for the Dao is entrusted to the seal to enact it. The seal is like the moxa placed upon the burning mirror. The *Spirit Seals for Subduing Demons*—variant edition of this seal.\n\n**Seal Exegesis**\nThe Nine Elder Lords of *Upper Clarity* reverse corpses, revive the dead, cure illnesses, subdue demons, and expose transgressions.",
      "start_char": 1246,
      "end_char": 1876,
      "start_sentence": 69,
      "end_sentence": 106,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.29208207130432,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\灵宝净明新修九老神印伏魔秘法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "右印不拘木植，雕造讫，随前印奏呈了。 法师遇申，发奏状行移，上下通用此印。 使印时，掐天罡诀。 每日服炼法 上元解秽黄庭真符 右符朱书。 每日清晨，面东掐午念咒，以浄水吞服一道，解秽诤身，招集生炁。 咒曰： 五帝大魔，总领鬼兵。 金铁前戮，魔王束形。 猛马四张，保命生根。 急急如上清九老帝君律令勑。 每日服炼法 上元延生守一真符 右符朱书。 每日午时，面东抢子念咒，以浄水吞服一道，安神守一，保命延生。 咒曰： 延寿益算，度厄尊神，迥骸起死，无量度人。 执箓把籍，齐到帝前。 急急如上清九老帝君律令勑。 浄明气镜篇 丹阳子曰：炁者，虚而善应也，神之帅也，身之主也。 天以炁，故穹窿而高，高故能下济。 地以炁，故磅砖而厚，厚故能上行。 日月星辰以炁清而照临，江海山岳以炁聚而融结。 人以炁则头圆，法天之炁也； 足方，法地之炁也。 眼发象於日月星辰也，毛窍象於山岳河海也。 一炁之运，阴阳奇偶，与天地流通。 天地所以能长久者，以其运而流通。 而人多夭折，何哉？ 以能用与不能用而已。 是故炁以运动潜伏有道，谓之浄明。 浄明故盈成，盈成则周徧，而达於命之情。 此天地之妙理，阴阳之交变，升降之早晏，生物之谓也。 而人之一身，可以上稽於天，下法於地，取天地之正而参於身，可以移精而变化，出没於死生，故能神神而灵，谓之内营。 内营则丹鼎成，黄芽生，庆云兴。 斯可嘘吸云风而嚏唾雷霆，能役夏冬而使秋春，变旸为雨，以雨为霖，而天地之正炁，在我而不在人。 死者可以生，生者可以死。 人道正，邪炁干者，逢吾之炁而安。 鬼道邪，而凌於人者，逢吾道之炁而摄善。 学道者得之，而为炁镜之诀曰：运行补养，必达其机。 达其机者，必明其说。 每日服气法 每日早晨，面束焚香，两手掐日君诀，叩齿九通，存想九老帝君、太阳上帝在日轮中。 日色紫赤，九芒霞光，晖映太空，如日初出之状。 即放诀收手，心拜祝曰： 嗣法某甲，焚香供养九老帝君、太阳上帝。 以今清旦烧香，斋心涤意。 朝礼日宫，吞纳正炁。 伏愿太阳上帝，降赐光辉，烁兹冥滞，生育正真，荡彼邪秽，百神既宁，万魔自退，耳聪目明，心通性慧，与道合真，长生久视。 又扣齿三通，想见太阳紫赤之光照面，即鼻引而咽纳之，如下文服四炁，共三十六口也。 初之炁咒曰： 中理五炁，混合百神。 凡服初炁，垂两手，掐应病诀，念咒七徧，放左手诀，换掐喉诀。 叉腰取炁一口，咽之。 随炁重掐诀，又念咒七徧，放右手诀，换掐喉诀。 叉腰取炁一口，咽之。 随黑重掐诀，次举两手，喉诀相交对口，左手在上，右手在下。 又念咒七徧，张口取炁一口，吹在诀上，即放诀。 此是一徧。 如此为之三徧，共服九口炁也。 二之炁咒曰： 元英公子，白元尊神，太一司命，桃康合延。 凡服第二炁，垂两手，掐北辰诀念咒。 取炁如服初炁法同，只更诀目。 亦三徧为之，共服九口炁也。 三之炁咒曰： 束送妖魔精，斩诚六鬼锋。 诸天炁荡荡，我道日兴隆。 凡服第三炁，垂两手，掐紫庭诀念咒。 取炁如服初炁法同，只更诀目。 亦三徧为之，共服九口炁也。 四之炁咒曰： 魔无干犯，鬼无妖精。 三官北酆，明检鬼营。",
      "translated_text": "The right seal may be carved from any wood. Once completed, submit it alongside the previous seal. When the master encounters an *shen* day, use this seal on memorials and official documents, both for superior and subordinate communications. When employing the seal, form the Big Dipper mudra.\n\n**Daily Cultivation Method**\n**Upper Prime: Yellow Court True Talisman for Dispelling Impurities**\nInscribe this talisman in cinnabar. Each morning at dawn, face east, form the *wu* mudra, recite the incantation, and swallow one talisman with pure water to dispel impurities, purify the body, and gather vital *qi*.\n\n**Incantation:**\nThe Five Thearchs command the demonic legions,\nIron blades strike front—demon kings submit.\nFour fierce steeds spread forth, safeguarding life and root.\nSwiftly, swiftly, as decreed by the Nine Elder Thearchs of Supreme Purity.\n\n**Daily Cultivation Method**\n**Upper Prime: True Talisman for Guarding the One and Prolonging Life**\nInscribe this talisman in cinnabar. Each day at noon, face east, form the *zi* mudra, recite the incantation, and swallow one talisman with pure water to pacify the spirit, guard the One, protect life, and prolong existence.\n\n**Incantation:**\nProlonging life and augmenting destiny, revered spirits transcend calamity,\nReviving the dead from their skeletal frames, immeasurably delivering beings.\nHolding registers and grasping ledgers, all ascend before the Thearch.\nSwiftly, swiftly, as decreed by the Nine Elder Thearchs of Supreme Purity.\n\n**The Mirror of Pure Bright *Qi***\nMaster Danyang said: *Qi* is emptiness that responds with efficacy; it is the marshal of spirit and the master of the body. Heaven possesses *qi*, thus it arches high and vast, and by its height, it descends to nourish below. Earth possesses *qi*, thus it is thick and expansive, and by its depth, it ascends to interact above. The sun, moon, and stars possess *qi*, thus they are luminous and shine upon the world. Rivers, seas, mountains, and peaks possess *qi*, thus they coalesce and take form. Humans possess *qi*: the head is round, modeling heaven’s *qi*; the feet are square, modeling earth’s *qi*. The eyes and hair emulate the sun, moon, and stars; the pores and hair resemble mountains, rivers, and seas. The circulation of this single *qi*—yin and yang, odd and even—flows in communion with heaven and earth. Heaven and earth endure because their *qi* circulates without obstruction. Yet humans often die prematurely—why? It is merely a matter of whether one can or cannot employ *qi*. Thus, the movement and concealment of *qi* follow a principle, called *pure brightness*. When *qi* is pure and bright, it fills and completes; when filled and complete, it pervades all, reaching the essence of destiny. This is the subtle principle of heaven and earth, the interplay of yin and yang, the timing of ascent and descent, and the generation of beings. Within the human body, one may emulate heaven above and earth below, drawing the upright *qi* of heaven and earth to harmonize with the self. Through this, one may transform essence, alter fate, and traverse life and death, thereby attaining numinous efficacy—this is called *inner refinement*. With inner refinement, the elixir crucible forms, the yellow sprout arises, and auspicious clouds flourish. One may then exhale wind and clouds, sneeze forth thunder, command summer and winter, summon autumn and spring, transform sunlight into rain, and rain into prolonged showers. The upright *qi* of heaven and earth resides within me, not in others. The dead may be revived; the living may be extinguished. When the human Dao is upright, perverse *qi* that invades will be pacified by my *qi*. When the demonic Dao is perverse and oppresses humanity, it will be subdued by the *qi* of my Dao. Those who study the Dao and attain this are said to possess the *qi* mirror’s secret. The method of circulating and nourishing *qi* must grasp its mechanism. To grasp its mechanism, one must understand its discourse.\n\n**Daily *Qi*-Ingestion Method**\nEach morning, face east, burn incense, form the Solar Lord mudra with both hands, and click the teeth nine times. Visualize the Nine Elder Thearchs and the Solar Supreme Thearch within the solar orb. The sun’s hue is purple-red, its nine rays of rosy light illuminating the vast sky like the dawn. Release the mudra, clasp the hands, and bow while reciting the prayer:\n\n*Disciple of the lineage [Name], burns incense and offers it to the Nine Elder Thearchs and the Solar Supreme Thearch. At this dawn hour, I burn incense, purify my heart, and cleanse my intent. I pay homage to the Solar Palace, ingesting and absorbing the upright *qi*. I humbly beseech the Solar Supreme Thearch to bestow radiant light, dispelling all darkness and stagnation, nurturing the upright and true, and sweeping away perverse impurities. May the hundred spirits be pacified, the myriad demons retreat, my ears hear clearly, my eyes see brightly, my heart attain communion, and my nature gain wisdom. May I unite with the Dao and attain longevity and enduring vision.*\n\nClick the teeth three more times, visualize the sun’s purple-red light illuminating your face, then inhale through the nose and swallow, as described below for ingesting the four *qi*, totaling thirty-six breaths.\n\n**First *Qi* Incantation:**\nCentered within the five *qi*, harmonizing the hundred spirits.\nWhen ingesting the first *qi*, let both hands hang naturally, form the mudra for the affliction, and recite the incantation seven times. Release the left-hand mudra, switch to the throat mudra, clasp the waist, inhale one breath, and swallow. With the breath, reform the mudra, recite the incantation seven more times, release the right-hand mudra, switch to the throat mudra, clasp the waist, inhale one breath, and swallow. With the dark *qi*, reform the mudra, then raise both hands, crossing the throat mudras before the mouth—left hand above, right hand below. Recite the incantation seven more times, open the mouth, inhale one breath, and blow onto the mudra before releasing it. This completes one cycle. Perform this three times, ingesting a total of nine breaths of *qi*.\n\n**Second *Qi* Incantation:**\nNoble Lord Yuan Ying, Venerable White Prime,\nGreat One Controller of Destiny, Peach and Plum unite to prolong life.\nWhen ingesting the second *qi*, let both hands hang naturally, form the Northern Asterism mudra, and recite the incantation. Inhale *qi* as in the first *qi* method, only changing the mudra’s name. Perform three cycles, ingesting a total of nine breaths of *qi*.\n\n**Third *Qi* Incantation:**\nEastward, expel demonic essences,\nSever the blades of the six ghosts.\nThe *qi* of all heavens surges—\nMy Dao daily ascends in glory.\nWhen ingesting the third *qi*, let both hands hang naturally, form the Purple Court mudra, and recite the incantation. Inhale *qi* as in the first *qi* method, only changing the mudra’s name. Perform three cycles, ingesting a total of nine breaths of *qi*.\n\n**Fourth *Qi* Incantation:**\nDemons dare not trespass,\nGhosts and malevolent spirits vanish.\nThe Three Officials of Mount Fengdu,\nInspect the demonic encampments.",
      "overlap_context": "o the site for pacification. For injuries or fractures, apply the imprint to the afflicted area. For seasonal epidemics or malarial fevers, affix it to the front and back of the heart. For sores, ulcers, or abscesses, burn the imprint to ash and apply it as a salve or wash. For possession, nightmares, or demonic assaults, wear the imprint or ingest it. For eye ailments, steep the imprint in pure water and use it to wash the eyes. In each case, healing and peace will be attained.\n\n**Seal Design**",
      "start_char": 1876,
      "end_char": 3156,
      "start_sentence": 107,
      "end_sentence": 182,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.23630881309509,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\灵宝净明新修九老神印伏魔秘法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "凡服第四炁，垂两手，掐日君诀念咒。 取炁如服初炁法同，只更诀目。 亦三徧为之，共服九口炁也。 诀目掌圆 灵宝浄明新修九老神印伏魔秘法竟",
      "translated_text": "When ingesting the fourth *qi*, let both hands hang naturally, form the Solar Lord mudra, and recite the incantation. Inhale *qi* as in the first *qi* method, only changing the mudra’s name. Perform three cycles, ingesting a total of nine breaths of *qi*.\n\nThe mudra’s name: Palm Circle.\nHere ends the *Lingbao Jingming Xinxiou Jiulao Shenyin Fumo Mifa* (The Numinous Treasure’s *Pure Clarity* Newly Revised Nine Elders’ Divine Seal Secret Method for Subduing Demons).",
      "overlap_context": " the six ghosts.\nThe *qi* of all heavens surges—\nMy Dao daily ascends in glory.\nWhen ingesting the third *qi*, let both hands hang naturally, form the Purple Court mudra, and recite the incantation. Inhale *qi* as in the first *qi* method, only changing the mudra’s name. Perform three cycles, ingesting a total of nine breaths of *qi*.\n\n**Fourth *Qi* Incantation:**\nDemons dare not trespass,\nGhosts and malevolent spirits vanish.\nThe Three Officials of Mount Fengdu,\nInspect the demonic encampments.",
      "start_char": 3157,
      "end_char": 3229,
      "start_sentence": 183,
      "end_sentence": 187,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 3.187288522720337,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\灵宝净明新修九老神印伏魔秘法.txt",
        "category": "方法类"
      }
    }
  ]
}