{
  "source_id": "玄宝人鸟山经图",
  "source_file": "chunked_daozang\\玄宝人鸟山经图.json",
  "total_chunks": 2,
  "total_original_chars": 2177,
  "total_translated_chars": 13199,
  "total_translation_time": 70.25221562385559,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\灵图类\\玄宝人鸟山经图.txt",
    "category": "灵图类"
  },
  "full_translation": "*The Chart of the Xuanlan Human-Bird Mountain Scripture*\n\n**Scripture Title:** *The Chart of the Xuanlan Human-Bird Mountain Scripture*. Also known as *The Numinous Treasure Five Talismans Human-Bird Scripture*. No original author is recorded. Tao Hongjing’s *True Words*, fascicle twenty, attributes its transmission to Lu Xiujing of the Southern Dynasties. One fascicle. Base text from: *Daoist Canon of the Zhengtong Era*, Dongxuan Section, Numinous Charts Category. See also *Seven Bamboo Tablets of the Cloudy Satchel*, fascicle eighty.\n\n---\n\nThe Most High said: Among the boundless heavens, each realm possesses a Human-Bird Mountain, where human forms and avian shapes converge. Its peaks and cliffs rise in towering majesty, beyond all description. Within its mystic terraces and jeweled palaces dwell the august deities. Forests and streams teem with birds and beasts; trees and stones bear fragrant blossoms. Mushrooms and myriad herbs flourish, yielding the elixir of deathlessness and the fluid of eternal life—yet to enumerate them would profit the seeker nothing. The scholar must delve deeply, for to grasp one is to know ten thousand, and all shall be clearly understood. Since instruction requires guidance, this text offers but a brief outline: the characters formed by numinous qi, inscribed by sacred craft, are transmitted to advanced disciples, never to be revealed to the mediocre.\n\nThe characters of numinous qi are the very visage of the mountain. Their outward signs are extraordinary; their traces, unique in form—all transformations wrought by that same numinous qi. Through profound insight, one may close the eyes and behold them. Having surveyed all in contemplation, one may then practice with certainty of verification. Once the numinous qi descends, the fleshly body may take flight. Through prolonged refinement, the gross flesh departs, and the numinous fills the being. Soaring like a bird, one roams beyond the Three Realms; as a perfected divine person, one enters the feasts of the Three Clarities. This is collectively called the Human-Bird.\n\nThe seeker ascends the mountain, and by the mountain attains the Dao, forever preserving eternal existence. Yet without utmost sincerity, one must not rashly seek this path.\n\nThe Most High said: The form and substance of the Human-Bird Mountain are the root of Heaven, Earth, and Humanity, the origin of primordial qi, and the instrument of wondrous transformation. Sages and perfected beings seek its domain; immortals and spirits revere its divinity. One must honor and serve it, meditate upon and invoke it, receive and perform rites for it, transcribe and wear it, practice it with precision, and harmonize it in secrecy. Without slackening over time, when the Three Qi are balanced and aligned, one’s body and offspring shall become seed-people of the Dao, moving freely in the world to propagate its teachings. Entering the mountains to refine methods, one shall act with autonomy, and no demon shall dare oppose. Thus may one command the Five Peaks at dawn, dispatch the Eight Seas, follow the Lords of the Three Heavens, and gird oneself with the essence of sun and moon. To know it is to be deathless; to practice it is to live forever. To contemplate it is to merge with wisdom; to master it is to unite with the divine.\n\nAt the mountain’s summit dwells the Celestial Venerable of Primordial Beginning; at its base reside the host of sacred perfected immortals. The mountain’s qi generates waters of five colors, called *Returning Soul*, whose flowing essence congeals into fat, known as *Thunder Sandalwood Incense*. When the Queen Mother of the West first sought the Dao, she journeyed to the Celestial Venerable of Primordial Beginning. After three thousand years, her virtue perfected, she was summoned to return to Kunlun Mountain. As she took leave of the Celestial Venerable, together they inscribed a record upon the void of the Human-Bird Mountain, crafting characters a *zhang* in size, suspended in the air to guide later seekers—still extant today.\n\nThe Nine Elder Immortal Lords of the Grotto-Heaven and the Nine Qi Venerable Ones depicted the mountain’s form and wore it upon their arms. The Heavenly Emperor transcribed the celestial script and affixed it to the body of the Human-Bird. Once every hundred years, it is revealed to transmit to the perfected. A Daoist who possesses this mountain’s form and the complete script shall attain transcendence and wander in feast upon Kunlun. One who recites this scripture ten thousand times and practices without betraying its words shall be met by the Heavenly Emperor’s envoys, arriving in cloud chariots with feathered canopies. No need for alchemical elixirs, no labor of guiding and stretching—persist in refinement without cease, and one shall ascend to Heaven of one’s own accord.\n\nThe Most High said: Whoever can purify and fast for three months, practicing in seclusion, shall be visited by immortals, who will personally impart these words. Receive them in secrecy and follow diligently, and swiftly shall you become a true sage. The Daoist who wears this shall command the myriad spirits.\n\nIn the first month, on the day of *jiazi*; in the second, on *renshen*; in the third, on *wuzi*—within a year, select but one day to perform the rite of offering to the mountain’s form upon a golden mirror. Transmit the oral instructions with care, and never recklessly disclose the scripture’s text. If the year lacks these three days, or if they are missed by chance, hasten to use *jiazi* instead, performing three offerings in a year. During the rite, maintain purity, strict discipline, and abstinence.\n\nOn a night of bright moonlight, expose the altar in the central courtyard. No need for elaborate altars or adornments, and let no others know. Secretly sweep clean and lay out a pure mat. Face south to arrange a separate seat, then face north to perform the rites. First, place a nine-inch mirror at the center of the seat, covering it with a purple-veined canopy. Encase the mountain chart in a purple brocade pouch and set it properly upon the mirror. Place three bowls of clear wine before the chart, with fragrant meats, dates, and fruits arranged in a circle around the mirror.\n\nPour half a bowl of wine to rinse the mouth, then take incense and assume position. Close the eyes, click the teeth three times, and visualize as usual. Sound the drum and kindle the incense burner, following the standard method. Take incense three more times, and with eyes closed, behold the Most High Great Dao, the Heavenly Worthies of the Ten Directions, the Celestial Venerable of Primordial Beginning, the Qi-Generated Spirits of the Human-Bird Mountain, and the Heavenly Emperor—cloud chariots arrayed, filling the void, all turning toward the seat. After a long while, their forms become distinct.\n\nThen secretly recite their names and titles, along with your own name, and invoke: *\"I humbly offer fragrant incense and present utmost sincerity, beseeching the descent of the Most High Great Dao, the Heavenly Worthies of the Ten Directions, the Celestial Venerable of Primordial Beginning, the Qi-Generated Spirits of the Human-Bird Mountain, the Heavenly Emperor, and all divine officials, on this auspicious hour and propitious moment.\"* Bow and prostrate yourself, performing three bows. Lie prone with eyes closed, visualizing the deities descending to the seat. After a long while, rise.\n\nTake wine three more times, kneel, and recite your name and title, addressing the Most High Great Dao, the Heavenly Worthies of the Ten Directions, the Celestial Venerable of Primordial Beginning, the Qi-Generated Spirits of the Human-Bird Mountain, the Heavenly Emperor, and all divine beings: *\"By your grace, I have been deemed worthy to behold and attend upon the august deities today. Joy and awe intermingle. I pray for your great compassion, that what is begun may be fulfilled, enabling me to study the Dao and attain the Dao, seek transcendence and attain transcendence, gain spiritual freedom, and forever preserve eternal existence.\"*\n\nThis humble and unworthy servant dares not speak at length, overwhelmed as I am with joy and trepidation. Respectfully bowing and prostrating myself, I perform three bows. Upon completion, I take wine three times, and having done so, I make another address as before. Three times I take wine, three times I address. When finished, I offer incense three times, rise, and stand to send off the deities. Stating my name and title, I address the Most High Great Dao, the Heavenly Worthies of the Ten Directions, the Celestial Venerable of Primordial Beginning, the Qi-Generated Spirits of the Human-Bird Mountain, the Heavenly Emperor, and all divine officials: *\"By your grace, I humbly request that you turn your cloud-borne chariots and return to ascend the Three Clarities. Though I am filled with longing and reverence, I pray for your great compassion to bestow your vast blessings. May I attain the Dao and behold the Celestial Palace. Should I make further entreaties, I humbly beseech your return.\"*\n\nI, your servant, bow and prostrate myself, performing three bows. Upon rising, I restore the incense burner. Once the incense is restored, I hold a bowl of wine and pour it to immerse the four directions. When finished, I gather the offerings in order. Those of like mind shall return to their chambers to partake of the sacrificial meat; it must not be recklessly shared with those who do not follow the Dao. Husbands and wives attending together shall observe the same rites; those who do not shall not engage in union. This prohibition is most solemn—all must take heed.\n\nAfter a thousand days of pure fasting, inscribe the mountain’s form on thin paper, three to five *cun* in size, and swallow it with the waters of the Jade Pool. One dose grants eternal life; two doses allow flight as a transcendent; three doses elevate one to a revered rank, merging with the Dao. After purifying oneself and creating the talisman, wear it for two years, reciting the scripture morning and evening. On auspicious days, perform the rites, maintaining vigilance to the end as at the beginning. When the thousand-day period is complete, you may wander mountains and marshes, commanding the Five Peaks, the Three Rivers, the Four Seas, the Eight Abysses, and the Nine Lands. All spirits shall bow in reverence, and your merit shall spread far. Within five to seven years, no more than nine, you shall ascend beyond the Three Clarities.\n\n*The True Form Chart of the Human-Bird Mountain*\nThe Most High Jade Dawn Lord of the Great Dao states: The Human-Bird Mountain has many names—sometimes called Mount Sumeru, sometimes the Dark Garden Mountain, sometimes the Great Earth Metal-Root Mountain, sometimes the Primordial Wondrous Mystery Mountain, sometimes the Mountain of the Treasure Cavern of Primordial Qi, sometimes the Mountain of the Seven Transformations and Seven Turnings for Observing Heaven. Though it bears seven names, its essence is called the *Xuanlan* (Mystic Contemplation). Free from flaws and impurities, vast and clear, its height is boundless, its majesty equal to the Dao. Though its manifestations have limits, its peaks soar into the mysterious void, its foundations extending three hundred sixty billion myriad *li*. Its surface has two million four hundred thousand gates, and within and without stand palaces of the seven treasures, where divine transcendents wander and perfected beings dwell.\n\nThe Celestial Venerable of Primordial Beginning governs atop the mountain, above which lie the Heavenly Emperor’s Palace and the Supreme Emperor’s Chamber. The Perfected of the Highest Clarity gaze upon one another in endless succession. Within the mountain naturally exists the Golden Elixir of Return, also called the Seven-Named Sacred Incense. This incense does not burn but perpetually emits wondrous fragrance, perceptible against the wind even seven thousand *li* away. The incense of the immortals—whoever obtains it shall not die. There grow sacred trees of *chun* wood, golden and jade trees, their radiance outshining the sun, their essence piercing the void. When they sway, they emit sounds that form the eight tones. Golden-winged phoenixes, roc birds, vermilion sparrows, divine dragons, qilin, lions with bronze heads and iron brows, apotropaic beasts with chisel teeth—great spiritual birds and beasts roam its sacred groves, while giant fish and scaled creatures glide beneath its Jade Pools. Marvels and auspicious omens defy full description; these few words merely outline its grandeur.\n\nWithin the mountain naturally exist eleven characters, their secrets held in the mouth. The text is transmitted through esoteric instruction: the *Gonglong* spirit is invoked to dispel misfortune, and the mountain repels inauspicious forces, rendering the outer world void. The characters number one hundred twenty-four when facing left, one hundred twenty when facing right, totaling two hundred forty-four. They are recited in the heart, their secrets passed by the master’s lips.\n\n*The Scripture and Chart of the Mystic Contemplation of the Human-Bird Mountain* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "玄览人鸟山经图 经名：玄览人鸟山经图。 又名《灵宝五符人鸟经》。 原不题撰人。 陶弘景《真语》卷二十称为南朝陆修静敷述。 一卷。 底本出处：《正统道藏》洞玄部灵图类。 参见《云笈七签》卷八十。 玄览人鸟山经图 太上曰：无数诸天，各有人鸟之山，有人之象，有鸟之形，峰岩峻极，不可胜言。 玄台宝殿，尊神所居，林涧鸟兽，木石香花，芝草众药，不死之津，长生之液，又难具陈，陈之无益於学。 学者自应精寻，得一知万，了然究知。 教须题示，故略标文，妙气结字，圣匠写之，以传上学，不泄中人。 妙气之字，即是山容，其表异相，其迹殊姿，皆是妙气化而成焉。 玄达之思，闭目见之，周览既毕，行之有征。 妙气既降，肉身能飞，久炼得妙，肉去妙充。 其翔似鸟，山游三界之外，其神真人，入宴三清之中。 总号人鸟。 学者由山，缘山至道，永保长存，自非至精，勿妄叩也。 太上曰：人鸟山之形质，是天地人之生根，元气之所因，妙化之所用。 圣真求其域，仙灵仰其神，敬而事之，存而念之，受而醮之，缮而带之，精而行之，和而密之，久无怠懈，三气调均，生身生子，为道种人，在世行化，入山研方，出处自在，魔不敢当。 於是朝致五岳，使役八溟，从三天之君，佩日月之精，知之不死，习之永生，谛之合智，究之同神。 其山之上，元始天王所居，其山之下，众圣真仙所处。 其山之气生五色之水，名反魂，流液成脂，名曰震檀之香。 西王母初学道，诣元始天王，三千年道成德就，应还昆仑之山。 临去辞元始天王，共刻铭人鸟山上虚空之中，制作文字。 字方一丈，悬在空中，以接后学，于今存焉。 九老仙都君、九气丈人，图画山形，佩之於肘。 天帝写空中之书，以附人鸟之体，百年一出，以传真人。 道士有此山形，及书文备者，便得仙度，游宴昆仑。 能读此书万徧，修行不负文言，天帝君即遣使，云车羽盖，来迎之也。 不须服御丹液，无劳导引屈伸，精之不休，自获升天矣。 太上曰：凡能清斋三月，别於静室修行，仙人当降，自以此文字语人，受之密遵，速成真圣。 道士佩之，役使万神。 正月有甲子，二月有壬申，三月有戊子，一年之中，唯取一日，祭醮山形於金镜之上，相传口诀之事，慎勿妄泄书文。 若年中无此三日，或有而邂逅，趣得甲子，一年三醮也。 醮时皆斋，清严禁断。 明月之夜，露出中庭，不须坛纂，不可他知。 密自洒扫浄席，向南兆敷别席，向北施礼。 先以明镜九寸面者，置座中央，紫文复伞，以罩座上，紫锦巾囊覆籍山图，正安镜中。 清酒三碗，置图之前，香脯枣果，圆施镜外。 酌酒半椀嗽口，捻香即位。 闭目叩齿三通，存思依常，鸣鼓发炉，亦如常法。 又三捻香，临目见太上大道、十方天尊、元始真王、人鸟山元气生神、太帝君，云驾罗列，布满空中，同来向座，良久分明。 仍密称名位，臣妾姓名，奉请太上大道、十方天尊、元始真王、人鸟山元气生神、太帝君、一切诸灵官，今日吉时良辰#1，敢荐芬芳，表献至诚，仰希垂降。 臣妾某等稽首礼拜，仍礼三拜，伏地闭目，存神降座，良久乃起。 又三拈酒，长跪称位臣妾姓名，上启太上大道、十方天尊、元始真王、人鸟山元气生神、太帝君，一切神明：臣妾叨恩得见，今日奉对尊神，喜惧交集，惟愿大慈，已生当成，使臣妾学道得道，求仙得仙，神通自在，永保长存。",
      "translated_text": "*The Chart of the Xuanlan Human-Bird Mountain Scripture*\n\n**Scripture Title:** *The Chart of the Xuanlan Human-Bird Mountain Scripture*. Also known as *The Numinous Treasure Five Talismans Human-Bird Scripture*. No original author is recorded. Tao Hongjing’s *True Words*, fascicle twenty, attributes its transmission to Lu Xiujing of the Southern Dynasties. One fascicle. Base text from: *Daoist Canon of the Zhengtong Era*, Dongxuan Section, Numinous Charts Category. See also *Seven Bamboo Tablets of the Cloudy Satchel*, fascicle eighty.\n\n---\n\nThe Most High said: Among the boundless heavens, each realm possesses a Human-Bird Mountain, where human forms and avian shapes converge. Its peaks and cliffs rise in towering majesty, beyond all description. Within its mystic terraces and jeweled palaces dwell the august deities. Forests and streams teem with birds and beasts; trees and stones bear fragrant blossoms. Mushrooms and myriad herbs flourish, yielding the elixir of deathlessness and the fluid of eternal life—yet to enumerate them would profit the seeker nothing. The scholar must delve deeply, for to grasp one is to know ten thousand, and all shall be clearly understood. Since instruction requires guidance, this text offers but a brief outline: the characters formed by numinous qi, inscribed by sacred craft, are transmitted to advanced disciples, never to be revealed to the mediocre.\n\nThe characters of numinous qi are the very visage of the mountain. Their outward signs are extraordinary; their traces, unique in form—all transformations wrought by that same numinous qi. Through profound insight, one may close the eyes and behold them. Having surveyed all in contemplation, one may then practice with certainty of verification. Once the numinous qi descends, the fleshly body may take flight. Through prolonged refinement, the gross flesh departs, and the numinous fills the being. Soaring like a bird, one roams beyond the Three Realms; as a perfected divine person, one enters the feasts of the Three Clarities. This is collectively called the Human-Bird.\n\nThe seeker ascends the mountain, and by the mountain attains the Dao, forever preserving eternal existence. Yet without utmost sincerity, one must not rashly seek this path.\n\nThe Most High said: The form and substance of the Human-Bird Mountain are the root of Heaven, Earth, and Humanity, the origin of primordial qi, and the instrument of wondrous transformation. Sages and perfected beings seek its domain; immortals and spirits revere its divinity. One must honor and serve it, meditate upon and invoke it, receive and perform rites for it, transcribe and wear it, practice it with precision, and harmonize it in secrecy. Without slackening over time, when the Three Qi are balanced and aligned, one’s body and offspring shall become seed-people of the Dao, moving freely in the world to propagate its teachings. Entering the mountains to refine methods, one shall act with autonomy, and no demon shall dare oppose. Thus may one command the Five Peaks at dawn, dispatch the Eight Seas, follow the Lords of the Three Heavens, and gird oneself with the essence of sun and moon. To know it is to be deathless; to practice it is to live forever. To contemplate it is to merge with wisdom; to master it is to unite with the divine.\n\nAt the mountain’s summit dwells the Celestial Venerable of Primordial Beginning; at its base reside the host of sacred perfected immortals. The mountain’s qi generates waters of five colors, called *Returning Soul*, whose flowing essence congeals into fat, known as *Thunder Sandalwood Incense*. When the Queen Mother of the West first sought the Dao, she journeyed to the Celestial Venerable of Primordial Beginning. After three thousand years, her virtue perfected, she was summoned to return to Kunlun Mountain. As she took leave of the Celestial Venerable, together they inscribed a record upon the void of the Human-Bird Mountain, crafting characters a *zhang* in size, suspended in the air to guide later seekers—still extant today.\n\nThe Nine Elder Immortal Lords of the Grotto-Heaven and the Nine Qi Venerable Ones depicted the mountain’s form and wore it upon their arms. The Heavenly Emperor transcribed the celestial script and affixed it to the body of the Human-Bird. Once every hundred years, it is revealed to transmit to the perfected. A Daoist who possesses this mountain’s form and the complete script shall attain transcendence and wander in feast upon Kunlun. One who recites this scripture ten thousand times and practices without betraying its words shall be met by the Heavenly Emperor’s envoys, arriving in cloud chariots with feathered canopies. No need for alchemical elixirs, no labor of guiding and stretching—persist in refinement without cease, and one shall ascend to Heaven of one’s own accord.\n\nThe Most High said: Whoever can purify and fast for three months, practicing in seclusion, shall be visited by immortals, who will personally impart these words. Receive them in secrecy and follow diligently, and swiftly shall you become a true sage. The Daoist who wears this shall command the myriad spirits.\n\nIn the first month, on the day of *jiazi*; in the second, on *renshen*; in the third, on *wuzi*—within a year, select but one day to perform the rite of offering to the mountain’s form upon a golden mirror. Transmit the oral instructions with care, and never recklessly disclose the scripture’s text. If the year lacks these three days, or if they are missed by chance, hasten to use *jiazi* instead, performing three offerings in a year. During the rite, maintain purity, strict discipline, and abstinence.\n\nOn a night of bright moonlight, expose the altar in the central courtyard. No need for elaborate altars or adornments, and let no others know. Secretly sweep clean and lay out a pure mat. Face south to arrange a separate seat, then face north to perform the rites. First, place a nine-inch mirror at the center of the seat, covering it with a purple-veined canopy. Encase the mountain chart in a purple brocade pouch and set it properly upon the mirror. Place three bowls of clear wine before the chart, with fragrant meats, dates, and fruits arranged in a circle around the mirror.\n\nPour half a bowl of wine to rinse the mouth, then take incense and assume position. Close the eyes, click the teeth three times, and visualize as usual. Sound the drum and kindle the incense burner, following the standard method. Take incense three more times, and with eyes closed, behold the Most High Great Dao, the Heavenly Worthies of the Ten Directions, the Celestial Venerable of Primordial Beginning, the Qi-Generated Spirits of the Human-Bird Mountain, and the Heavenly Emperor—cloud chariots arrayed, filling the void, all turning toward the seat. After a long while, their forms become distinct.\n\nThen secretly recite their names and titles, along with your own name, and invoke: *\"I humbly offer fragrant incense and present utmost sincerity, beseeching the descent of the Most High Great Dao, the Heavenly Worthies of the Ten Directions, the Celestial Venerable of Primordial Beginning, the Qi-Generated Spirits of the Human-Bird Mountain, the Heavenly Emperor, and all divine officials, on this auspicious hour and propitious moment.\"* Bow and prostrate yourself, performing three bows. Lie prone with eyes closed, visualizing the deities descending to the seat. After a long while, rise.\n\nTake wine three more times, kneel, and recite your name and title, addressing the Most High Great Dao, the Heavenly Worthies of the Ten Directions, the Celestial Venerable of Primordial Beginning, the Qi-Generated Spirits of the Human-Bird Mountain, the Heavenly Emperor, and all divine beings: *\"By your grace, I have been deemed worthy to behold and attend upon the august deities today. Joy and awe intermingle. I pray for your great compassion, that what is begun may be fulfilled, enabling me to study the Dao and attain the Dao, seek transcendence and attain transcendence, gain spiritual freedom, and forever preserve eternal existence.\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1292,
      "start_sentence": 0,
      "end_sentence": 46,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.989078760147095,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\灵图类\\玄宝人鸟山经图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "小丑贱臣妾，不敢多陈，不胜踊跃屏营。 谨稽首礼拜。 三拜，拜毕，三拈酒，拈毕，又启如此。 三拈三启。 毕，三捻香，起倚送神，称位臣妾姓名，上启太上大道、十方天尊、元始真王、人鸟山元气生神、太帝君，一切灵官，缘恩上请，纡回云仪，神驾已整，还升三清。 臣妾恋慕，俯仰屏营，惟愿大慈，流布洪恩。 臣妾得道，谒见王宫，后宜有请，仰希重降。 臣妾某等稽首礼拜。 三拜毕，起，复炉。 复炉毕，秉一椀酒，泻浸四周。 毕，依次敛之也。 同志者还房进胙，不得妄与非法之人。 夫妻接侍，皆同此法。 不同不得交会。 此禁至重，明各慎之。 清斋千日，丹书山形於薄纸上，方三寸至五寸，玉池之泉，向王吞服。 一服长生不死，二服神仙飞行，三服升登尊位，与道合同。 清斋起图，佩之二年，晨夕诵文，吉日修事，慎终如始。 一千日限足，游行山泽，威制五岳，三河四海，八溟九地，一切神灵，奉迎拜谒，功德流布。 五年七年，不过九年，超登三清矣。 太上人鸟山真形图 太上玉晨大道君曰：人鸟山名甚多，或名须弥山，或名玄圃山，或名大地金根山，或名本无妙玄山，或名元气宝洞山，或名神玄七变七转观天山。 一山七名，总号玄览。 涤除疵漏，集会广澄，其高无极，势与道同。 示应有崖，竦入玄空，流衍基布三百六十亿万里。 面有二百四十万门，内外皆自然七宝宫殿，神仙所游，圣真息处。 元始天王治在山上，上面又有天帝宫，太帝室，上清真人更相盻接，不可胜数。 山中自然有金液还丹，七名灵香，其香不焚，常生妙气，逆风远闻，七千里外。 神仙之香，得者不死。 椿林宝木，金玉之树，光明耀日，精彻虚空，动摇发响，自成八音。 金翅凤凰，鹏鸟朱雀，神龙麒麟，狮子铜头铁额，辟邪凿齿。 大神禽兽，游其宝林之中； 巨馄鳞族，漾其玉池之下。 灵物奇瑞，不可具称。 粗标言之，以举大盘耳。 山内自然之字，一十有一，其诀口中，寄文附出，弓龙行神，出除凶殃，辟非祥山，外空虚之。 字向左百二十四，向右百二十，合二百四十四字。 诵之在心，诀在师口。 玄览人鸟山经图竟 #1「辰」字原缺，据前后文义补。",
      "translated_text": "This humble and unworthy servant dares not speak at length, overwhelmed as I am with joy and trepidation. Respectfully bowing and prostrating myself, I perform three bows. Upon completion, I take wine three times, and having done so, I make another address as before. Three times I take wine, three times I address. When finished, I offer incense three times, rise, and stand to send off the deities. Stating my name and title, I address the Most High Great Dao, the Heavenly Worthies of the Ten Directions, the Celestial Venerable of Primordial Beginning, the Qi-Generated Spirits of the Human-Bird Mountain, the Heavenly Emperor, and all divine officials: *\"By your grace, I humbly request that you turn your cloud-borne chariots and return to ascend the Three Clarities. Though I am filled with longing and reverence, I pray for your great compassion to bestow your vast blessings. May I attain the Dao and behold the Celestial Palace. Should I make further entreaties, I humbly beseech your return.\"*\n\nI, your servant, bow and prostrate myself, performing three bows. Upon rising, I restore the incense burner. Once the incense is restored, I hold a bowl of wine and pour it to immerse the four directions. When finished, I gather the offerings in order. Those of like mind shall return to their chambers to partake of the sacrificial meat; it must not be recklessly shared with those who do not follow the Dao. Husbands and wives attending together shall observe the same rites; those who do not shall not engage in union. This prohibition is most solemn—all must take heed.\n\nAfter a thousand days of pure fasting, inscribe the mountain’s form on thin paper, three to five *cun* in size, and swallow it with the waters of the Jade Pool. One dose grants eternal life; two doses allow flight as a transcendent; three doses elevate one to a revered rank, merging with the Dao. After purifying oneself and creating the talisman, wear it for two years, reciting the scripture morning and evening. On auspicious days, perform the rites, maintaining vigilance to the end as at the beginning. When the thousand-day period is complete, you may wander mountains and marshes, commanding the Five Peaks, the Three Rivers, the Four Seas, the Eight Abysses, and the Nine Lands. All spirits shall bow in reverence, and your merit shall spread far. Within five to seven years, no more than nine, you shall ascend beyond the Three Clarities.\n\n*The True Form Chart of the Human-Bird Mountain*\nThe Most High Jade Dawn Lord of the Great Dao states: The Human-Bird Mountain has many names—sometimes called Mount Sumeru, sometimes the Dark Garden Mountain, sometimes the Great Earth Metal-Root Mountain, sometimes the Primordial Wondrous Mystery Mountain, sometimes the Mountain of the Treasure Cavern of Primordial Qi, sometimes the Mountain of the Seven Transformations and Seven Turnings for Observing Heaven. Though it bears seven names, its essence is called the *Xuanlan* (Mystic Contemplation). Free from flaws and impurities, vast and clear, its height is boundless, its majesty equal to the Dao. Though its manifestations have limits, its peaks soar into the mysterious void, its foundations extending three hundred sixty billion myriad *li*. Its surface has two million four hundred thousand gates, and within and without stand palaces of the seven treasures, where divine transcendents wander and perfected beings dwell.\n\nThe Celestial Venerable of Primordial Beginning governs atop the mountain, above which lie the Heavenly Emperor’s Palace and the Supreme Emperor’s Chamber. The Perfected of the Highest Clarity gaze upon one another in endless succession. Within the mountain naturally exists the Golden Elixir of Return, also called the Seven-Named Sacred Incense. This incense does not burn but perpetually emits wondrous fragrance, perceptible against the wind even seven thousand *li* away. The incense of the immortals—whoever obtains it shall not die. There grow sacred trees of *chun* wood, golden and jade trees, their radiance outshining the sun, their essence piercing the void. When they sway, they emit sounds that form the eight tones. Golden-winged phoenixes, roc birds, vermilion sparrows, divine dragons, qilin, lions with bronze heads and iron brows, apotropaic beasts with chisel teeth—great spiritual birds and beasts roam its sacred groves, while giant fish and scaled creatures glide beneath its Jade Pools. Marvels and auspicious omens defy full description; these few words merely outline its grandeur.\n\nWithin the mountain naturally exist eleven characters, their secrets held in the mouth. The text is transmitted through esoteric instruction: the *Gonglong* spirit is invoked to dispel misfortune, and the mountain repels inauspicious forces, rendering the outer world void. The characters number one hundred twenty-four when facing left, one hundred twenty when facing right, totaling two hundred forty-four. They are recited in the heart, their secrets passed by the master’s lips.\n\n*The Scripture and Chart of the Mystic Contemplation of the Human-Bird Mountain* concludes.",
      "overlap_context": "s, the Celestial Venerable of Primordial Beginning, the Qi-Generated Spirits of the Human-Bird Mountain, the Heavenly Emperor, and all divine beings: *\"By your grace, I have been deemed worthy to behold and attend upon the august deities today. Joy and awe intermingle. I pray for your great compassion, that what is begun may be fulfilled, enabling me to study the Dao and attain the Dao, seek transcendence and attain transcendence, gain spiritual freedom, and forever preserve eternal existence.\"*",
      "start_char": 1292,
      "end_char": 2122,
      "start_sentence": 47,
      "end_sentence": 86,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.263136863708496,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\灵图类\\玄宝人鸟山经图.txt",
        "category": "灵图类"
      }
    }
  ]
}