{
  "source_id": "玄帝灯仪",
  "source_file": "chunked_daozang\\玄帝灯仪.json",
  "total_chunks": 2,
  "total_original_chars": 1738,
  "total_translated_chars": 11510,
  "total_translation_time": 61.79220533370972,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\威仪类\\玄帝灯仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**The Ritual of the Mysterious Emperor’s Lamps**\n\n*Scripture Title:* *The Ritual of the Mysterious Emperor’s Lamps*. One fascicle.\n*Source Text:* *Daoist Canon of the Zhengtong Era*, *Section of Cavernous Truth*, *Category of Dignified Rites*.\n\n**The Ritual of the Mysterious Emperor’s Lamps**\n*Proceed according to the prescribed form.*\n\nYour servant has heard: Responding to transformations without end, You ever dwell in the Golden Towers of the Mysterious Capital; Your original form remains unmoved, yet You were born in the royal palace of Pure Joy. Gathering the myriad things into One Body, dispersing the One Spirit into ten thousand realms. Your numinous power reaches the supremely subtle, Your Dao is complete and resplendent. Above, You open the Mystery of primordial chaos; below, You govern the constellations of Void and Danger. You uphold the earth’s foundations, truly nurturing the origin of heaven. Holding the workings of creation within the four seasons, unifying the web of power in a single qi. You purify the cosmos, pacify heaven and earth. Your virtue equals that of all heavens, Your merit matches the vast kalpas. The ten poles all depend on Your divine transformation; the nine empyreans all rely on Your true majesty. Your beneficence in aiding the multitudes is beyond words; Your merit pervades the ten thousand existences, yet You claim no achievement. Vast is Your sagely virtue, boundless is Your true wind. Having exhausted my mortal talents, I cannot adequately record Your power.\n\nNow, I, [Name], have long revered Your sagely transformation and for ages been enveloped in Your true grace. I array incense and lamps, present wine and fruit, to convey radiance to the ever-luminous realm above the Forbidden Precincts, to extend brightness to the Palace of Heavenly Unity and True Felicity. I offer these precious lamps, beseeching Your great creation. For a moment, descend in Your chariot of flying clouds, and accept this humble libation. Secretly awaiting Your true light, I humbly pray for [missing character] and the southern barbarians. Overwhelmed with awe, I respectfully submit this memorial. Bowing my head in reverence, I sincerely praise and chant.\n\n**Invocation of the Sacred Name**\nWe, Your servants and assembly, with wholehearted devotion, take refuge in the Perfected Warrior of the Northern Culmen, True Martial Sovereign of the Mysterious Heaven, August Emperor, and all divine immortals and spirit officials.\n\nYour servant has heard: When the reckoning of fate is exhausted and the cycle of kalpas begins anew, lingering calamities remain unquelled; the old defilements still persist. Yet men cling to frivolity and fail to return to simplicity. The Six Heavens lie in wait for opportunities, the Nine Fiends seize their chances. First, they seek to harm the wicked; then, they strike the good. Resentment accumulates below, poison ascends above. Were it not for the compassion of the Great Dao, how could the Perfected of the Highest Realms bring deliverance? Moved by the suffering of the multitudes, grieved by the afflictions of all, the Primordial Beginning issued decrees, and the True Honored One received the mandate. This was no matter of a single morning or evening, but required seven days and seven nights of toil. Thus, humans and ghosts were separated, and Chong and Li established the cosmic order. Only Your virtue, O Spirit, endures through eternal kalpas.\n\nNow, I, [Name], extol Your primordial merit and respectfully present pure offerings. I lift my gaze to Your lofty hearing and humbly express my reverent sincerity. With wholehearted devotion, I take refuge in the Perfected Warrior of the Northern Culmen, True Martial Sovereign of the Mysterious Heaven.\n\nMay it please You that the precious torches blaze with radiance, illuminating the region of the Mysterious Void above; may the orchid-oil flames continue, spreading to the Palace of Heavenly Unity. I pray that the immortal retinue will descend from afar, that the cloud chariots will journey below. Grant the petition for a hundred blessings, eradicate a thousand disasters. Inscribe life in the Southern Palace’s register, erase transgressions from the Northern Bureau’s ledger. Those who study the Dao shall awaken to the subtleties of the formless; those who cultivate the Real shall obtain the method of hidden radiance. May calamities not intrude, perverse spirits be scattered. May a hundred spirits guard and protect, ten thousand affairs be foreknown.\n\nBowing my head in reverence, I sincerely praise and chant:\nOnly You, Mysterious Origin, are honored among the multitudes of wonders.\nTeaching without words, none know Your divinity.\nVast through countless kalpas, continuous as if ever-present.\nEmpty the heart, fill the belly; harmonize light and merge with dust.\nYou carved open creation, dispersed the simplicity of the primal chaos.\nSix million years, eighty-two bodies.\nBending to preserve the crooked, straightening the wronged; filling the hollow, covering the new.\nSupporting the declining, delivering from peril, reviving the dead, perfecting the living.\nYour merit is unclaimed, Your virtue is steadfast.\nMay Your commands be manifest again, eternally guarding the northern heavens.\nAbove, punish the rebellious; below, extinguish demonic vapors.\nFlying talismans, traveling registers, roaming through heaven and earth.\nThe generals of Jia and Geng assist and protect Your body.\nEncompassing the six directions, universally shielding the myriad people.\nMay demonic ghosts be forever destroyed, the Dao-qi eternally endure.\n\nWe, Your servants and assembly, with wholehearted devotion, take refuge in the Perfected Warrior of the Northern Culmen, True Martial Sovereign of the Mysterious Heaven, August Emperor, and all divine immortals and spirit officials.\n\nYour servant has heard: All stars encircle the North, revealing the supremacy of the Northern Culmen; all numbers begin with one, showing that the One is foremost. Without complete merit and perfect virtue, how could one be supreme and honored? Reverently regarding the Most True of the Mysterious Warrior, eternally enthroned in the great position of the North, You manifest ten titles. The Venerable Lord originally named You thus; dwelling among the heavens, True Martial subdued the sun in response to transformation. Your divine merit blazes, Your sagely majesty overflows. Desiring to praise the True Honored One, I have exhausted my sincerity.\n\nNow, I, [Name], purify the courtyard and hall, fast and bathe body and mind. Reverently invoking the Mysterious Heaven, I humbly express my cinnabar sincerity. With wholehearted devotion, I take refuge in the Numinously Responsive, Blessing and Sagely True Lord.\n\nMay it please You that flowers bloom with auspicious omens, lamp wicks shed floating calamities. May the winding springs share their light, ending the karmic retributions of the Nine Dark Realms; may the Fengdu caverns be illuminated, absolving the transgressions of seven generations. May the recently departed and ancestors ascend to the Real and escape suffering. May households abound in filial piety and fraternal love, the world be filled with loyalty and goodness. May a thousand disasters disperse, ten thousand blessings converge.\n\nBowing my head in reverence, I sincerely praise and chant:\nNorthern Culmen, Mysterious Heaven, profound and distant Divine Lord.\nMyriad thousands of transformations, Mysterious Warrior, Numinous Perfected.\nSoaring through heaven, overturning earth, driving thunder, chasing clouds.\nA retinue of millions, sweeping away demonic vapors.\nThunder Lords, Lightning Mothers, Jade Maidens, Generals.\nGhosts and spirits submit, dragons and tigers flee in hiding.\nYour majesty guards the Five Peaks, all spirits obey.\nStriking bells, beating drums, roaming through heaven and earth.\nSeizing rebellious ghosts, crushing demonic hordes.\nExpelling the perverse, aiding the upright, may the Dao-qi eternally endure.\n\nWe, Your servants and assembly, with wholehearted devotion, take refuge in the Perfected Warrior of the Northern Culmen, True Martial Sovereign of the Mysterious Heaven, August Emperor, and all divine immortals and spirit officials.\n\nYour servant has heard: Minister of the Jade Void, incarnation of the Golden Towers, You abide in the realm of non-being, roam freely between the sagely and the mundane. Sometimes departing to rule the Ten Heavens, sometimes descending to guide a hundred kings.\n\nThus, eighty times You manifested as the Venerable Lord, and eighty-two titles You bore as the Dark Warrior. Though Your manifestations differ, Your fundamental essence remains unchanged. Embracing yin and nurturing yang, treading upon the tortoise and serpent to perfect wondrous function; presiding over the south while dwelling in the north, revealing the union of *li* and *kan* to manifest the celestial *qi* of *qian*. Your Dao and virtue defy comprehension, Your meritorious deeds elude record. Thus, on earth You govern the realm of Supreme Harmony, where none but the martial may prevail; in heaven You hold dominion over the *ren* and *gui* directions, where none but the Mysterious may be entrusted. Boundless are Your merits and virtues—impossible to extol in full.\n\nNow, this humble one has swept the dusty abode and grandly arrayed the ritual mat, gazing reverently toward the void of *Xu* and *Wei*, and directing sincerity toward the Northern Culmen’s heavens. Humbly beseeching the descent of Your rainbow banner, may Your whirlwind chariot tarry but a moment to receive this offering of orchids and ferns, and witness this devotion of autumn sacrifices. Look down in mercy upon this crimson heart, and extend understanding to this plain petition. With wholehearted devotion, we take refuge in the Numinous and Responsive Protector, the True Lord.\n\nMay auspicious flames ignite the Golden Ram, and propitious radiance illumine the Bronze Duck. Below, may layered darkness be shattered; above, may the boundless be reached. Let the living and the dead alike receive grace, and the young and old be enveloped in favor. May homes shine with brilliance, and gates overflow with joy. Let calamities never arise nor misfortunes take form; may households grow ever richer and enterprises ever more prosperous. Bestow the Five Fortunes upon this body, and dispel the Six Adversities from this family. Such grace flows from the Supreme Sage—all depends on Your true blessing.\n\nWith bowed heads, we take refuge and reverently intone:\nTransformed from the Great Yin, essence of water and fire,\nAligning with *Xu* and *Wei* above, the tortoise and serpent conjoined in form.\nEncompassing the Six Directions, Your might subdues the ten thousand spirits.\nNo hidden realm escapes Your gaze, no wish remains unfulfilled.\nFrom kalpa’s end to kalpa’s dawn, You sever and vanquish demonic forces.\nSafeguarding all beings, bringing peace to households and nations.\nWhen the cycle nears its end and the *jia* of decay is spent, perverse *qi* spreads abroad.\nBy the Emperor’s decree, the Sage firmly descends.\nProclaiming the true teaching, sweeping away evil and averting war.\nTransforming and harmonizing the multitudes, aiding the restoration of the center.\nShould any petty demon dare disturb the living,\nAll shall be annihilated, never to linger.\nBanishing defilement and filth, may the Dao-*qi* endure forever.\n\nRecite the scriptures, transform the offerings, and dedicate the merit.\nThe Lamp Rite of the Dark Emperor is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "玄帝灯仪 经名：玄帝灯仪。 一卷。 底本出处：《正统道藏》洞真部威仪类。 玄帝灯仪 法事如式 臣闻：应化无穷，常处玄都之金阙； 本形不动，己生净乐之王宫。 敛万物而为一身，散一神而为万境。 灵通太妙，道备郁明，上开混沌之玄，下统虚危之宿。 抚成地纪，实育天元，持造化於四时，总权纲於一炁。 肃清宇宙，镇静乾坤，德并诸天，功齐浩劫。 十极悉依於神化，九霄咸赖於真威。 利济群生而利博难言，功加万有而功成不处。 巍巍圣德，荡荡真风，既竭凡才，纪之莫德。 今某人夙钦圣化，久被真恩。 罗列香灯，进陈酒果，通光於禁上常融之境，续明於天一真庆之宫。 献此宝灯，特垂洪造，暂降飞云之辇，纳兹行潦之觞。 密俟真光，俯祈□蛮，不胜战惧，谨以奏闻。 稽首皈依，虔诚赞咏。 举　圣号 臣众等志心归命，北极镇天真武玄天上帝真君，一切神仙诸灵官。 臣闻：数尽历穷，有余殃之未殄； 运推劫始，奈旧染之犹存。 尚执浇漓，不还淳朴，六天伺隙，九丑乘机。 始欲害於恶民，因中伤於善类。 怨积下土，毒冲上天。 自非大道之慈悲，安得上真之济度。 念尔元元之众，伤于总总之妖。 於是元始颁符，真尊受命。 既匪一朝一夕之故，有烦七日七夜之勤。 人鬼乃分，重黎奠位，惟神之德，永劫常存。 今某人称颂元功，敬陈净供，仰渎高高之听，俯伸翼翼之诚，志心归命北极镇天真武玄天上帝。 伏愿宝炬腾辉，上烛玄枵之次； 兰膏续焰，旁通天一之宫。 冀仙仗之遐临，祈云軿之下迈。 求祈百福，殄灭千灾，注生籍於南宫，削罪名於北府。 学道，悟无形之妙； 修真，获隐景之方。 灾障不干，精邪荡散，百神守护，万事先知。 稽首皈依，虔诚赞咏： 惟尔玄元，众妙之尊。 不言而教，莫知其神。 渺渺亿劫，绵绵若存。 虚心实腹，和光同尘。 凿开造化，朴散胚浑。 六百万岁，八十二身。 曲全枉直，洼盈蔽新。 扶衰度厄，起死成人。 其功不恃、其德乃贞。 令宜再显，永镇北旻。 上罚逆象，下灭妖氛。 飞符走箓，游行乾坤。 甲庚之将，赞卫尔身。 周环六合，普护兆民。 魔鬼永灭，道炁长存。 臣众等志心归命，北极镇天真武玄天上帝真君，一切神仙诸灵官。 臣闻：众星拱北，而知北极之尊； 诸数始一，乃见数一为首。 自非全功全德，岂能为首为尊。 仰为玄武之至真，永镇北方之大位，化生十号，老君本自於强名； 托籍诸天，真武伏日於应化。 神功赫赫，圣烈洋洋，欲颂真尊，已殚诚意。 今某人肃清庭宇，斋沐身心，仰叩玄天，辄摅丹悃，志心归命 灵应佑圣真君。 伏愿花开善瑞，烬落浮灾。 泉曲分光，罢九幽之业对； 罗酆洞耀，原七世之愆尤。 近逝先亡，登真离苦，家多孝悌，世足忠良，千灾并散，万福咸臻。 稽首皈依，虔诚赞咏： 北极玄天，杳杳神君。 亿千变化，玄武灵真。 腾天倒地，驱雷奔云。 队仗千万，扫荡妖氛。 雷公电母，玉女将军。 鬼神降伏，龙虎潜奔。 威镇五岳，万灵咸遵。 鸣钟击鼓，游行乾坤。 收捕逆鬼，摧斩魔群。 除邪辅正，道炁长存。 臣众等志心归命，北极镇天真武玄天上帝真君，一切神仙诸灵官。 臣闻：玉虚师相，金阙化身，自在於无有之乡，逍遥於圣凡之境。 或去为十天之主，或来作百王之师。",
      "translated_text": "**The Ritual of the Mysterious Emperor’s Lamps**\n\n*Scripture Title:* *The Ritual of the Mysterious Emperor’s Lamps*. One fascicle.\n*Source Text:* *Daoist Canon of the Zhengtong Era*, *Section of Cavernous Truth*, *Category of Dignified Rites*.\n\n**The Ritual of the Mysterious Emperor’s Lamps**\n*Proceed according to the prescribed form.*\n\nYour servant has heard: Responding to transformations without end, You ever dwell in the Golden Towers of the Mysterious Capital; Your original form remains unmoved, yet You were born in the royal palace of Pure Joy. Gathering the myriad things into One Body, dispersing the One Spirit into ten thousand realms. Your numinous power reaches the supremely subtle, Your Dao is complete and resplendent. Above, You open the Mystery of primordial chaos; below, You govern the constellations of Void and Danger. You uphold the earth’s foundations, truly nurturing the origin of heaven. Holding the workings of creation within the four seasons, unifying the web of power in a single qi. You purify the cosmos, pacify heaven and earth. Your virtue equals that of all heavens, Your merit matches the vast kalpas. The ten poles all depend on Your divine transformation; the nine empyreans all rely on Your true majesty. Your beneficence in aiding the multitudes is beyond words; Your merit pervades the ten thousand existences, yet You claim no achievement. Vast is Your sagely virtue, boundless is Your true wind. Having exhausted my mortal talents, I cannot adequately record Your power.\n\nNow, I, [Name], have long revered Your sagely transformation and for ages been enveloped in Your true grace. I array incense and lamps, present wine and fruit, to convey radiance to the ever-luminous realm above the Forbidden Precincts, to extend brightness to the Palace of Heavenly Unity and True Felicity. I offer these precious lamps, beseeching Your great creation. For a moment, descend in Your chariot of flying clouds, and accept this humble libation. Secretly awaiting Your true light, I humbly pray for [missing character] and the southern barbarians. Overwhelmed with awe, I respectfully submit this memorial. Bowing my head in reverence, I sincerely praise and chant.\n\n**Invocation of the Sacred Name**\nWe, Your servants and assembly, with wholehearted devotion, take refuge in the Perfected Warrior of the Northern Culmen, True Martial Sovereign of the Mysterious Heaven, August Emperor, and all divine immortals and spirit officials.\n\nYour servant has heard: When the reckoning of fate is exhausted and the cycle of kalpas begins anew, lingering calamities remain unquelled; the old defilements still persist. Yet men cling to frivolity and fail to return to simplicity. The Six Heavens lie in wait for opportunities, the Nine Fiends seize their chances. First, they seek to harm the wicked; then, they strike the good. Resentment accumulates below, poison ascends above. Were it not for the compassion of the Great Dao, how could the Perfected of the Highest Realms bring deliverance? Moved by the suffering of the multitudes, grieved by the afflictions of all, the Primordial Beginning issued decrees, and the True Honored One received the mandate. This was no matter of a single morning or evening, but required seven days and seven nights of toil. Thus, humans and ghosts were separated, and Chong and Li established the cosmic order. Only Your virtue, O Spirit, endures through eternal kalpas.\n\nNow, I, [Name], extol Your primordial merit and respectfully present pure offerings. I lift my gaze to Your lofty hearing and humbly express my reverent sincerity. With wholehearted devotion, I take refuge in the Perfected Warrior of the Northern Culmen, True Martial Sovereign of the Mysterious Heaven.\n\nMay it please You that the precious torches blaze with radiance, illuminating the region of the Mysterious Void above; may the orchid-oil flames continue, spreading to the Palace of Heavenly Unity. I pray that the immortal retinue will descend from afar, that the cloud chariots will journey below. Grant the petition for a hundred blessings, eradicate a thousand disasters. Inscribe life in the Southern Palace’s register, erase transgressions from the Northern Bureau’s ledger. Those who study the Dao shall awaken to the subtleties of the formless; those who cultivate the Real shall obtain the method of hidden radiance. May calamities not intrude, perverse spirits be scattered. May a hundred spirits guard and protect, ten thousand affairs be foreknown.\n\nBowing my head in reverence, I sincerely praise and chant:\nOnly You, Mysterious Origin, are honored among the multitudes of wonders.\nTeaching without words, none know Your divinity.\nVast through countless kalpas, continuous as if ever-present.\nEmpty the heart, fill the belly; harmonize light and merge with dust.\nYou carved open creation, dispersed the simplicity of the primal chaos.\nSix million years, eighty-two bodies.\nBending to preserve the crooked, straightening the wronged; filling the hollow, covering the new.\nSupporting the declining, delivering from peril, reviving the dead, perfecting the living.\nYour merit is unclaimed, Your virtue is steadfast.\nMay Your commands be manifest again, eternally guarding the northern heavens.\nAbove, punish the rebellious; below, extinguish demonic vapors.\nFlying talismans, traveling registers, roaming through heaven and earth.\nThe generals of Jia and Geng assist and protect Your body.\nEncompassing the six directions, universally shielding the myriad people.\nMay demonic ghosts be forever destroyed, the Dao-qi eternally endure.\n\nWe, Your servants and assembly, with wholehearted devotion, take refuge in the Perfected Warrior of the Northern Culmen, True Martial Sovereign of the Mysterious Heaven, August Emperor, and all divine immortals and spirit officials.\n\nYour servant has heard: All stars encircle the North, revealing the supremacy of the Northern Culmen; all numbers begin with one, showing that the One is foremost. Without complete merit and perfect virtue, how could one be supreme and honored? Reverently regarding the Most True of the Mysterious Warrior, eternally enthroned in the great position of the North, You manifest ten titles. The Venerable Lord originally named You thus; dwelling among the heavens, True Martial subdued the sun in response to transformation. Your divine merit blazes, Your sagely majesty overflows. Desiring to praise the True Honored One, I have exhausted my sincerity.\n\nNow, I, [Name], purify the courtyard and hall, fast and bathe body and mind. Reverently invoking the Mysterious Heaven, I humbly express my cinnabar sincerity. With wholehearted devotion, I take refuge in the Numinously Responsive, Blessing and Sagely True Lord.\n\nMay it please You that flowers bloom with auspicious omens, lamp wicks shed floating calamities. May the winding springs share their light, ending the karmic retributions of the Nine Dark Realms; may the Fengdu caverns be illuminated, absolving the transgressions of seven generations. May the recently departed and ancestors ascend to the Real and escape suffering. May households abound in filial piety and fraternal love, the world be filled with loyalty and goodness. May a thousand disasters disperse, ten thousand blessings converge.\n\nBowing my head in reverence, I sincerely praise and chant:\nNorthern Culmen, Mysterious Heaven, profound and distant Divine Lord.\nMyriad thousands of transformations, Mysterious Warrior, Numinous Perfected.\nSoaring through heaven, overturning earth, driving thunder, chasing clouds.\nA retinue of millions, sweeping away demonic vapors.\nThunder Lords, Lightning Mothers, Jade Maidens, Generals.\nGhosts and spirits submit, dragons and tigers flee in hiding.\nYour majesty guards the Five Peaks, all spirits obey.\nStriking bells, beating drums, roaming through heaven and earth.\nSeizing rebellious ghosts, crushing demonic hordes.\nExpelling the perverse, aiding the upright, may the Dao-qi eternally endure.\n\nWe, Your servants and assembly, with wholehearted devotion, take refuge in the Perfected Warrior of the Northern Culmen, True Martial Sovereign of the Mysterious Heaven, August Emperor, and all divine immortals and spirit officials.\n\nYour servant has heard: Minister of the Jade Void, incarnation of the Golden Towers, You abide in the realm of non-being, roam freely between the sagely and the mundane. Sometimes departing to rule the Ten Heavens, sometimes descending to guide a hundred kings.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1253,
      "start_sentence": 0,
      "end_sentence": 82,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.52004361152649,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\玄帝灯仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "故八十次显为老君，亦八十二号为玄武。 现相或异，本体无殊。 含阴育阳，蹑龟蛇而成妙用； 司南居北，示离坎而作乾罡。 道德难知，功勋不纪。 故在地有太和之境，为武可当； 在天有壬癸之方，非玄不授。 无涯功德，难尽赞扬。 今某人洒扫尘居，宏陈法席，颙望虚危之次，驰诚北极之天。 俯赐霓旌，少留飙驭，纳此苹蘩之荐，鉴兹豺獭之诚。 下悯丹衷，伸知素幅，志心归命灵应佑圣真君。 伏愿瑞开金羊之焰，祥辉铜鸭之光。 下破重昏，上通无极。 存亡受惠，长幼蒙恩。 宅宇光辉，门阑喜庆。 灾不生而祸不作，家愈富而业愈隆。 锡五福於身宫，除六极於眷属。 恩推上圣，悉赖真休。 稽首皈依，虔诚赞咏： 太阴化生，水火之精。 虚危上应，龟蛇合形。 周环六合，威摄万灵。 无幽不察，无愿不成。 劫终劫始，剪伐妖精。 救护群品，家国咸宁。 数终末甲，妖气流行。 上帝有勑，圣固降临。 阐扬正教，荡邪辟兵。 化洽黎兆，协赞中兴。 敢有小鬼，辄挠生灵。 悉皆消灭，永不留停。 凶秽消荡，道炁长存。 讽经　化财　回向 玄帝灯仪竟",
      "translated_text": "Thus, eighty times You manifested as the Venerable Lord, and eighty-two titles You bore as the Dark Warrior. Though Your manifestations differ, Your fundamental essence remains unchanged. Embracing yin and nurturing yang, treading upon the tortoise and serpent to perfect wondrous function; presiding over the south while dwelling in the north, revealing the union of *li* and *kan* to manifest the celestial *qi* of *qian*. Your Dao and virtue defy comprehension, Your meritorious deeds elude record. Thus, on earth You govern the realm of Supreme Harmony, where none but the martial may prevail; in heaven You hold dominion over the *ren* and *gui* directions, where none but the Mysterious may be entrusted. Boundless are Your merits and virtues—impossible to extol in full.\n\nNow, this humble one has swept the dusty abode and grandly arrayed the ritual mat, gazing reverently toward the void of *Xu* and *Wei*, and directing sincerity toward the Northern Culmen’s heavens. Humbly beseeching the descent of Your rainbow banner, may Your whirlwind chariot tarry but a moment to receive this offering of orchids and ferns, and witness this devotion of autumn sacrifices. Look down in mercy upon this crimson heart, and extend understanding to this plain petition. With wholehearted devotion, we take refuge in the Numinous and Responsive Protector, the True Lord.\n\nMay auspicious flames ignite the Golden Ram, and propitious radiance illumine the Bronze Duck. Below, may layered darkness be shattered; above, may the boundless be reached. Let the living and the dead alike receive grace, and the young and old be enveloped in favor. May homes shine with brilliance, and gates overflow with joy. Let calamities never arise nor misfortunes take form; may households grow ever richer and enterprises ever more prosperous. Bestow the Five Fortunes upon this body, and dispel the Six Adversities from this family. Such grace flows from the Supreme Sage—all depends on Your true blessing.\n\nWith bowed heads, we take refuge and reverently intone:\nTransformed from the Great Yin, essence of water and fire,\nAligning with *Xu* and *Wei* above, the tortoise and serpent conjoined in form.\nEncompassing the Six Directions, Your might subdues the ten thousand spirits.\nNo hidden realm escapes Your gaze, no wish remains unfulfilled.\nFrom kalpa’s end to kalpa’s dawn, You sever and vanquish demonic forces.\nSafeguarding all beings, bringing peace to households and nations.\nWhen the cycle nears its end and the *jia* of decay is spent, perverse *qi* spreads abroad.\nBy the Emperor’s decree, the Sage firmly descends.\nProclaiming the true teaching, sweeping away evil and averting war.\nTransforming and harmonizing the multitudes, aiding the restoration of the center.\nShould any petty demon dare disturb the living,\nAll shall be annihilated, never to linger.\nBanishing defilement and filth, may the Dao-*qi* endure forever.\n\nRecite the scriptures, transform the offerings, and dedicate the merit.\nThe Lamp Rite of the Dark Emperor is now complete.",
      "overlap_context": "re.\n\nWe, Your servants and assembly, with wholehearted devotion, take refuge in the Perfected Warrior of the Northern Culmen, True Martial Sovereign of the Mysterious Heaven, August Emperor, and all divine immortals and spirit officials.\n\nYour servant has heard: Minister of the Jade Void, incarnation of the Golden Towers, You abide in the realm of non-being, roam freely between the sagely and the mundane. Sometimes departing to rule the Ten Heavens, sometimes descending to guide a hundred kings.",
      "start_char": 1253,
      "end_char": 1675,
      "start_sentence": 83,
      "end_sentence": 116,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.272161722183228,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\玄帝灯仪.txt",
        "category": "威仪类"
      }
    }
  ]
}