{
  "source_id": "玄坛刊误论",
  "source_file": "chunked_daozang\\玄坛刊误论.json",
  "total_chunks": 6,
  "total_original_chars": 5950,
  "total_translated_chars": 37170,
  "total_translation_time": 185.92260789871216,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\玄坛刊误论.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Rectification of Errors in the Altar of Mystery**\n\n**Preface to *The Rectification of Errors in the Altar of Mystery***\nTitle: *The Rectification of Errors in the Altar of Mystery*\nOriginally compiled by Zhang Ruohai.\nOne fascicle.\nSource text: *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n**The Rectification of Errors in the Altar of Mystery**\nCompiled by Wuweizi Zhang Ruohai\n\nWuweizi, having long worn the cap and robe of the Dao, devoted himself to the practice of purification and cultivation. The rituals of the Three Caverns were his solemn duty, yet he merely followed convention without deeper inquiry. Where contradictions arose or doubts lingered, he found no master to consult, no authority to correct his uncertainties.\n\nOne day, a figure appeared—clad in rainbow sleeves and cloud-like sashes—claiming to have come from Tiantai and Siming. His bearing was refined and harmonious, his gaze solemn and upright. He gave no name, only the title \"Master Guangyun,\" a man truly free and unfettered beyond the world. Well-versed in both Confucian and Buddhist teachings, he was also deeply learned in the scriptures and rituals of the Three Caverns. Thus, Wuweizi set aside his staff and rested, gaining the opportunity to accompany him. The master spoke of his travels: from the Central Plains to the rivers and lakes, from Ou and Min to Long and Shu, from sacred altars to numinous peaks—he had journeyed everywhere.\n\n\"In every place,\" he said, \"I have witnessed the old rites of purification and offering overturned and misplaced. You have followed these errors in your practice—are you willing to accept reason and correct them?\"\n\nWuweizi replied, \"This humble one is dull-witted, yet I rejoice to hear your wise instruction.\" He bowed deeply in reverence, humbly seeking guidance. \"Whatever faults you deign to point out, I shall inscribe upon my sash. The errors in the Altar of Mystery number twenty categories—matters that past worthies have never examined. Yet these mistakes persist and spread. For those who uphold the laws of the Three Heavens, I have titled this work *The Rectification of Errors in the Altar of Mystery*, that none may cling to delusion and depart from truth.\"\n\n---\n\n**Chapter One: On Entering the Chamber of Stillness**\n\nMaster Guangyun said: \"When preparing for a purification rite, three days prior, the Daoist must enter the Chamber of Stillness within the purification hall. There, he washes his heart and spirit, stills his wayward thoughts, avoids impurity and defilement, refrains from listening to music, and steadfastly focuses his mind solely on the rites. Today, those Daoists who assist in the purification rites of officials may maintain purity and silence, inwardly facing the dawn. When they ascend the altar in haste, they avoid contamination, yet in matters of teaching and law, standards must still be demonstrated. Though inner virtue may be full, outward decorum must also be complete. If not for such discipline, how can one avoid confusion? How can one rise from the dust at dawn and mount the altar by dusk? Let them reflect—can your conscience be at ease?\"\n\n\"If within a temple, three days may not be possible; one or two days will suffice. For rites held in lay households, entering the chamber for a full day and night is also acceptable.\"\n\nWuweizi bowed deeply and said, \"I respectfully receive your instruction.\"\n\n---\n\n**Chapter Two: A Further Discussion on Entering the Chamber of Stillness**\n\nWuweizi addressed the master: \"The matter of entering the Chamber of Stillness has long been neglected. If one’s sincerity is genuine, why insist on prior preparation?\"\n\nMaster Guangyun replied: \"This is the deceit of vulgar Daoists, misleading the equally vulgar—it is no sound argument. Consider this: when the state conducts sacrifices at the suburban altars or ancestral temples, the officials in charge—from the Minister of Rites to the Grand Commandant—observe a dispersed fast for four days and an intensive fast for three. After receiving the precepts, they do not mourn the dead, inquire after the sick, make music, review documents involving punishment or execution, carry out punishments, engage in impure acts, or enter the chambers of wives and concubines. On the night before the sacrifice, they lodge in the Ministry of State Affairs. The next day, the Censorate clears the roads. The paths to the suburban altars and temples are demarcated by the Gold Bird Guard, who forbid monks, mourners, and funeral carts from defiling the officials, lest they offend the august spirits. How much more should this apply to the Most High Three Pure Ones?\"\n\nWuweizi said: \"If this is the rule for official residences, then so be it. But in temples, Daoists each have their own Chamber of Stillness. Must they wait until the time of purification to enter it? Would that not be self-degrading?\"\n\nThe master replied: \"Not so. The Chamber of Stillness where Daoists reside is a place for rest, not for entering stillness to face the True. Now, in temples, there are halls such as the Hall of Refined Thought, the Hall of Concentrated Spirit, the Hall of Subtle Contemplation, and the Hall of Preserving the True—these are the true places for entering stillness. If one were to use one’s living quarters for this purpose, what need would there be for these halls?\"\n\nWuweizi said: \"Truly, your words are correct. Henceforth, I dare not fail to follow them.\"\n\n---\n\n**Chapter Three: On the Recitation of Precepts and the Assignment of Duties**\n\nMaster Guangyun said: \"Before the purification rite, when entering the Chamber of Stillness for three days, the recitation of precepts and the swearing of vows take place on the first day. If entering for only one day, the recitation and vows occur at dawn on that day. The Daoist assembly gathers in the Dharma Hall, where the Master of the Mysteries initiates the *Natural Audience of the Numinous Treasure*. The High Priest then proclaims the precepts and vows, exhorting all to purify their minds and devote themselves to the rites, upholding the essence of the teachings and precepts. Afterward, the six offices are assigned, each to fulfill its duty without omission. Once the recitation of precepts and assignment of duties are complete, the supervisor of the purification rite posts the list of duties in the purification hall.\"\n\n\"Now, I observe that in purification rites, the Daoists gather on the day of the rite and proceed until nightfall. Before the Master of the Mysteries, the sponsor presents the petition, and after the master’s announcement, they ascend the altar to perform the rites. Only after the Great Thanksgiving do they turn to the Cavern Tablet to recite the precepts and assign duties. This is to perform the rites first and assign duties afterward—how grievously inverted!\"\n\nWuweizi carefully examined this ritual and only then realized the errors of past practices. From this time forward, he resolved to adhere to the correct order.\n\n---\n\n**Chapter Four: A Further Discussion on the Recitation of Precepts**\n\nWuweizi, with solemn demeanor, again addressed the master: \"The practice of reciting precepts after the Great Thanksgiving has persisted for a long time. To change it now—is there justification?\"\n\nThe master exclaimed: \"What words are these? What words are these? If a practice is improper, why cling to the old? Sit again, and I will tell you. The rites for facing the True are akin to the state’s sacrifices, though the offerings of incense, vegetables, and sweet wine differ. Seven days before the sacrifice, the Grand Commandant gathers the officials in the Ministry of State Affairs to recite the precepts, declaring: 'On such-and-such a day and month, there will be a sacrifice at such-and-such a temple. Each shall perform his duty. Those who fail to fulfill their roles will face the standard penalties of the state. Should any omission occur, punishments will be meted out after the sacrifice.'\"\n\nThe matter has never been heard of—correcting the officiants only after the sacrifice has concluded. Yet now, after Daoists ascend the altar and perform the Great Thanksgiving, when the day’s ritual is complete, they proceed to recite the precepts anew. To listen to these precepts is no longer in accord with the spirit of the fast. From the moment of first entering the Dao and receiving ordination, the sequence of the precept-text has been disordered, its order inverted. This is surely because past generations failed to revise and correct it, blindly following flawed regulations, thus passing down this erroneous version to later ages. Though it is said that eminent masters of the Dao have once examined and collated it, I do not believe it. It is as if a noble lord or appointed official were to receive his commission only after assuming office. You need only consult sound reasoning, and those who uphold principle will surely roll up their sleeves on my behalf.\n\nUpon hearing this truth, Wéiwēizǐ realized his former error.\n\n---\n\n**On the Rite of Offering Incense (Fā Lú Pǐn) Fifth**\n\nMaster Yúnguāng said: The rite of offering incense is when the High Ritual Master, facing the Three Clarities, holds the censer and declares the purpose of the fast. The invocation reads:\n\n> To the Supreme Mysterious Origin, the Three Qi of the Boundless Dao, the Primordial Celestial Worthy of Original Commencement, the Supreme Lord of the Great Dao, the Supreme Venerable Lord, and the Jade Sovereign of Spontaneous Nature—\n>\n> Your servant now acts on behalf of the disciple of the Great Dao, [Official Title] [Name], who undertakes this [type of] fast for [such-and-such] purpose.\n\nThis is the Ritual Master’s direct address to the Primordial Ancestor of the Original Sovereign. There is none higher than the Three Clarities, and thus no other sages are invoked alongside them.\n\nYet today, when Daoists perform the fast, they invoke the Supreme Three Heavens, the Mysterious Origin, the Three Qi, and the Supreme Venerable Lord, commanding them to summon the Three and Five Merit Officers, the left and right envoys within one’s own body—thereby making the Supreme Venerable Lord call forth the deities within oneself. They further command the local earth deity to swiftly prepare and attend the declaration, stating: “Your servant now undertakes this [type of] fast for [such-and-such] person.”\n\nYet the altar is modeled on the Three Heavens, its tiers constructed accordingly. When the Ritual Master ascends the altar, he stands above the Three Heavens, directly addressing the Celestial Worthy in audience. How can he then summon the deities within his own body or call forth the earth deity to witness the merit? Is the earth deity even permitted to ascend the altar of the Three Clarities? Moreover, the phrase “prepare swiftly” risks exposing what should remain concealed—truly laughable!\n\nFurthermore, when a Daoist receives the registers of the Dao, even the lowest-ranking community earth deity of the Nine Provinces is not permitted to enter the sacred precincts, lest it disturb the harmony between spirits and deities. Now, to summon the earth deity to ascend the altar of the Three Clarities—where is it to be accommodated?\n\nIt is as if, during an imperial audience, a minister were to order his attendants to summon a street constable or market official to stand upon the vermilion steps and witness his achievements. Is this permissible? Or is it not?\n\nWéiwēizǐ bowed deeply in reverent listening, his shame so profound that sweat drenched his robes. He had never before realized the errors of past generations.\n\n---\n\n**On the Rite of Repentance (Fāng Chàn Pǐn) Sixth**\n\nMaster Yun’guang said: When the Dharma Master offers incense to the Ten Directions, he first descends the true *qi* of the Ten Directions, which ascends from below to above before reaching the presence of the Most High of Supreme Clarity. In all petitions addressed to the Three Clarities, one does not concurrently invoke the honorific titles of the myriad Celestial Worthies—this is solely to honor the Three Clarities, for just as a land has no two kings, the exalted admit no dual supremacy.\n\nNow, those who perform purification rites, after reciting the invocation and offering the Three Incenses, proceed to pay homage to the Ten Directions and perform repentance and thanksgiving—this is erroneous and without basis. When entering the oratory, Daoists regard the *Zi Ran Chao* of the Numinous Treasure as the progenitor of all purification rites. Since all such rites derive from the *Dongxuan Lingbao* canon, it is rightly deemed their ancestor. Homage to the Numinous Treasure Celestial Worthies of the Ten Directions, or concurrent repentance and thanksgiving, should take place not upon the altar but within the Dharma hall. The repentance texts, whether inscribed on paper or wooden tablets, are placed before the incense tables of the Ten Directions; they ought not to be recited in sequence during the audience, nor should prayers be directed to the Celestial Worthies of the lower realms.\n\nYet some further bow to the sun, moon, and stellar lodges; the Five Marchmounts and grotto-heavens; the Three Rivers and Four Seas; the Nine Jiang Water Sovereigns; the upper and lower realms; and the scriptural treasures—also accompanied by repentance texts, collectively termed the Twenty Directions. Still others contrive further elaborations: when chanting the litany, they prostrate nine times to the east, three to the south, seven to the west, five to the north, three to each of the four intermediate directions, thirty-two to the upper realm, and twenty-four to the lower—this is an egregious departure from proper order. While the Celestial Worthies of the Ten Directions and the sun, moon, and stars may be accorded some deference in the presence of the Three Clarities, the deities of the Five Marchmounts and water palaces are most unseemly. Moreover, to omit homage to the Five Marchmounts beyond the seas reveals a narrow and partial view.\n\nIt is as if, when a minister addresses the throne to present a matter, or when the matter concerns the chief minister, he must wait until the court has retired, then proceed to the administrative hall or the minister’s residence to make his report—how could he turn his head during the audience to address the chief minister? The Three Clarities are as emperors, the Celestial Worthies of the Ten Directions as ministers; in heaven as on earth, the hierarchy of honor and subordination remains unchanged. To recite repentance texts to the Ten Directions is thus improper in principle.\n\nWéiwēizǐ withdrew to reflect on these words, finding the distinction between high and low most apt, and dared not but heed them.\n\n**On Abandoning the Superfluous and Embracing Simplicity, Seventh**\n\nWéiwēizǐ addressed the Master: Though I have heard the reasoning regarding repentance rites, such practices have long been in use—will others follow if we change them?\n\nThe Master replied: Ritual is founded upon reverence, not upon elaboration. The texts of repentance rites were composed by later generations; though their diction may be ornate and their allusions refined, how can one make the Most High linger, awaiting the recitation of prayers from the lower realms? This is most unseemly. In ancient times, when Ji Wenzi performed sacrifices, he continued them by torchlight; the officiants, leaning on staffs, conducted the rites, and though their hearts were solemn and reverent, they were nonetheless weary. Another day, when Zilu assisted at a sacrifice, he began at first light and retired at dawn. Confucius sighed, saying: “Who would say that You does not know ritual?” This is to value simplicity and reverence.\n\nNow, when a three-day Daoist retreat is held, there are eleven morning audiences in all, yet the repentance rites occupy nine of them. The retreat’s sponsor and officials stand for long periods, leaning against the altar mats—how can they endure it? It would be far better to inscribe the repentance text and read it but once.\n\nWéiwēizǐ again addressed the Master: If, during the nine audiences, the text were read at each, would that be permissible?\n\nThe Master replied: If it cannot be avoided and the text must be recited, then during the three days and nine audiences, after the principal thanksgiving and closing audience, it may be read two or three times—provided the repentance texts are varied and the same text is not repeated over the three days. This neither prolongs the Dharma assembly nor wearies the retreat officials. Proceeding thus, what objection could there be? Ritual does not descend from heaven nor spring from the earth; it is tempered by human sentiment. If elaboration is moderated with restraint, who would say otherwise?\n\nWéiwēizǐ bowed deeply and said: I shall act accordingly.\n\n**On Prostration, Eighth**\n\nMaster Yun’guang said: Silent reverence in prostration requires no further embellishment. In all bending, stretching, kneeling, and rising, let inner devotion match outward form, so that inner and outer accord—this is what is meant by “the five limbs touching the earth.” *Qishou* is a single bow, the forehead touching the ground. *Dunshou* is also a single bow, the head striking the ground. *Zaibai* is two bows. When *qishou*, *dunshou*, and *zaibai* are mentioned together, this signifies four bows. “With utmost trepidation” describes holding the tablet, bowing deeply twice while crouching, then rising to a kneeling position with the tablet held high, and after a moment, bowing deeply twice more before concluding.\n\nNow, those who perform purification rites all say, “With utmost trepidation, *qishou*, *dunshou*, *zaibai*,” yet perform only three bows, merely fulfilling the count. Thus, they lack the reverence of the body fully prostrated upon the earth, and blindly follow one another, greatly diminishing the ritual.\n\nWéiwēizǐ said: From this time forth, I shall observe and practice this.\n\n**On the Recitation of Scriptures, Ninth**\n\nMaster Yun’guang said: The scriptures are the teachings expounded by the Most High, which humans receive and uphold—whether cultivated in the person or in the state—this is the essence of revering the scriptures. In all purification rites involving scripture recitation, the proper setting is within the Dharma hall. The Dharma hall is the main hall of an abbey or temple; behind it lies the hall for expounding the Dharma, where the scriptural treasures are arrayed at the center, the Master of the Mysteries to the left, and the Celestial Master to the right. If the rite is held in a palace or residence, the space is arranged behind the altar, with offerings made to the Three Treasures, thus serving as the Dharma hall, with two lion thrones set to the left and right.\n\nAfter each ascent to the altar and closing audience, the High Merit Dharma Master and the retreat officials proceed to the hall to open the scriptures. Once this is done, the Precentor and Scripture Attendants ascend their seats to expound the scriptural meaning and illuminate what has not been understood.\n\nThus, as stated in *The Simplified Text for Scripture Attendants*: \"To guard the two lion thrones of the Masters\" is precisely its intent. Yet those who conduct present-day retreat rites, after concluding each morning’s memorial audience, proceed to chant the liturgy and recite scriptures upon the altar itself—how meaningless this is! Moreover, before the scriptures are opened, there are incantations to be recited, which are meant for the Dharma Master’s silent contemplation alone. Now, however, the Daoist assembly, without awaiting the Dharma Master’s completion of his meditative recitation, immediately raises their voices in loud chanting—how contrary to proper order!\n\nI, Wuweizi, humbly bear these fine instructions in mind and dare not let them fall into neglect.\n\n**On the Rite of the Consecrated Altar (Chapter Ten)**\nMaster Yun’guang states: The \"consecrated altar\" originally refers to consecrated water—water infused with the true *qi* of the Five Directions and Five Dragons, used to dispel impurity and defilement. In sacred altars of abbeys and temples, or in the blessed lands of immortals, there is no need for such prohibitions and consecrations, for divine officials already stand guard. What impurity or defilement is there to dispel? The concern lies only in the preparation of retreat offerings and the comings and goings of people, which may attract impure *qi*, thus necessitating purification rites. When conducting a retreat in a palace or residence, however, the full rite of purification and prohibition should be performed, invoking only the descent of the true *qi* of the Five Directional Youthful Lords.\n\nYet those who conduct retreats today insist on declaring: \"The Azure Youthful Lord of the East stands nine thousand myriad *zhang* tall, attended by nine thousand myriad officials.\" The Lords of the South, West, and North are likewise described in accordance with their directional *qi*—why then fix their height or restrict their number? They further proclaim: \"Flying immortals, divine immortals, sun, moon, and stars, the Three Rivers and Four Seas, each with armies of a hundred million cavalry\"—how excessive this is! They claim that a single *chi* of cloud can cover three layers of a roof, encircling the altar thrice—yet when the Three Clarities’ numinous altar is already erected, why must divine officials be summoned to cover it? They speak of \"spreading a celestial net above and an earthly net below\"—why then, atop the Three Clarities’ altar, must nets be spread anew? Such vulgar and coarse language—let it be cast aside!\n\nI, Wuweizi, enlightened at once, bow in reverence and receive this teaching.\n\n**On the Offering Altar (Chapter Eleven)**\nMaster Yun’guang states: The term *jiao* is another name for sacrifice. Sacrifices involving meat are called *ji*, while those with vegetarian offerings are called *jiao*. In all retreat rites, offerings are first made to the Three Clarities of the Highest Realm, then to the Ten Poles and all Perfected Ones, and finally to the Five Emperors, the Three Officials, and the ranks of divine immortals and numinous officials. For three days and nights, incense, lamps, banners, and flowers are arrayed, and offerings are made to each station. Why then, on the day of the dispersed retreat, are wine and *jiao* rites offered to the numinous officials? If performed before the retreat’s dispersal, it disrupts the order of precedence; if after, it interferes with the protocol of the divine retinue. Since the Celestial Perfected already partake of the retreat’s offerings, why should the numinous officials require wine and *jiao*? Instead, on the morning following the retreat’s dispersal, offerings of *jiao* delicacies, tea, and broth may be made at the station of the numinous officials—this suffices.\n\nThose of discernment should harbor no doubts on this matter.\n\nWuweizi asks: Since wine has long been used in *jiao* rites, can it be abruptly abolished?\n\nThe Master replies: If a *jiao* feast is set independently, it follows its own liturgical protocols, distinct from retreat rites, and does not require wine or dried meats—what objection could there be? Yet for three days, the numinous officials of the retreat altar receive offerings of fragrant rice. How could they not follow the divine carriage, lingering to break the retreat’s fast? Even among common folk, such conduct would be improper. Ensure all matters are just and fitting; do not heed the vulgar.\n\nI, Wuweizi, receive this teaching and will forever bear it in mind.\n\n**On the Three Days and Four Nights (Chapter Twelve)**\nMaster Yun’guang states: In retreat rites, when it is said that the Dao is practiced in nine periods, this refers to three days and four nights. Including the rites of merit and the presentation of memorials, the total is eleven audiences. The nine audiences consist of: the first night, continuing until the fifth watch and the retreat hour of the following day; the second and third days each constitute three audiences, totaling nine. The audience on the third night is called the \"rite of merit.\" At the fifth watch of the fourth day, the \"rite of presenting memorials and bearing gratitude\" is performed, making eleven audiences in all.\n\nYet those who conduct retreats today perform eleven audiences without distinguishing between the rites of merit and the presentation of memorials. On the fourth day, they further recite the *Supreme Retreat Petition*, announcing the dispersal of the retreat—this makes twelve audiences. Why such excessive repetition?\n\nWuweizi says: Your humble disciple, ignorant and dull, humbly receives this enlightening instruction.\n\n**On Chanting the Dao and Ascending the Altar (Chapter Thirteen)**\nMaster Yun’guang states: In every retreat, before ascending the altar each morning, the Dharma Master and the officials stand before the Master of the Mysteries. After the High Merit Dharma Master makes his announcement, the Precentor chants: \"All in the Dao assembly, each direct your mind, take refuge in the Three Treasures, and praise and practice the Dao.\" The phrase \"each direct your mind\" instructs the Dharma Master and retreat officials to focus their minds on the Mysterious Ultimate, visualizing the august presence of the Celestial Worthy. The intent lies in silent contemplation and inner reflection, not in competing to chant aloud in unison.\n\nYet those who conduct retreats today fail to grasp the Precentor’s meaning, do not follow the rule of visualizing and directing the mind, and instead raise their voices to recite merits and virtues, disregarding the hierarchy of the sagely and divine ranks. Moreover, each time they ascend the numinous altar, they should begin at the Earth Gate, circumambulate upward, and upon concluding the audience, descend from the Heavenly Gate. Yet those conducting retreats today ascend and descend solely through the Earth Gate, never treading the Heavenly Gate. Not only will the numinous officials punish such conduct, but the discerning will also ridicule it.\n\nI, Wuweizi, bow my head in reverence and humbly bear these enlightening words in mind.\n\n**On Recitations Before and After Retreat Meals (Chapter Fourteen)**\nMaster Yun’guang states: Whenever entering the hall to take one’s seat, whether before the retreat meal or the congee, first perform the purification, then offer incense. After unfolding the cloth, present the offerings. When the Precentor strikes the chime three times, the Dharma Master silently recites the *Birth-Incantation*, then the chime is struck twice more—this signals the beginning of the meal. After the meal, the chime is struck three times. The Precentor then leads the hymns of praise and the dedication of merits. Once the hymns conclude, the retreat officials rise.\n\nYet those who conduct retreats today, after the meal or congee, recite merits and virtues, invoking first the Three Clarities of the Highest Realm, then the Five Emperors, the Three Officials, the Perfected Immortals, divine immortals, and numinous officials—this is excessive indeed!\n\nAnd when the retreat officials ascend the altar to present their memorials, none fail to conduct themselves with solemn reverence—robes and caps immaculate, bearing themselves with utmost care before the celestial throne, ever fearful of lapses in decorum. How then can they, in the midst of seated feasting, recite the names of the Most High Sagely Celestials, claiming such recitation as the dedication of merits to bless the retreat’s patrons? Do they not realize that the merits of day-and-night devotions lie precisely in their unceasing observance? Must they wait until sated with food before invoking the sagely and perfected once more? They vie only with the Buddhist clergy, heedless of incurring heavenly censure.\n\nMaster Wuwei, suddenly perceiving his past errors, prostrated himself in repentance.\n\n**Chapter Fifteen: On the Retreat Patron’s Intent and Petitions**\nMaster Yun Guang declared: For a retreat lasting one day and two nights, three days and three nights, or seven days and seven nights, the petitions must be changed daily. Though the intent of the retreat remains constant, the wording of the petitions must vary; the same text cannot be recited repeatedly from beginning to end.\n\nAt the retreat’s commencement, the first petition should outline its general purpose and objectives, without yet making any supplications. The next petition may then reveal the intent of prayer and entreaty. The final petition should begin with an apology for having wearied the sagely ears with importunity, followed by expressions of gratitude for the received blessings.\n\nYet those who conduct retreats today, regardless of duration, cling to a single text, reciting it over and over—does this not weary the listeners? Consider the analogy of an earthly sovereign: if a minister presents a memorial, then submits another, can he simply reuse the same words? Even for a single petitioner, this would be improper; how much more so when addressing the Three Treasures?\n\nMaster Wuwei bowed his head in reverence, vowing to heed this enlightened instruction.\n\n**Chapter Sixteen: On the Standards of Teaching and Transformation**\nMaster Yun Guang declared: The standards of teaching and transformation are the models bequeathed by the sages. *Teaching* means to instruct; *transformation* means to change. It is to broadly propagate the teachings of the Most High and widely transform the natures of humans and gods. Once teaching and transformation are disseminated, standards are established—these are the rules and systems. Once standards are set, regulations follow. Regulations serve to examine conduct; once regulations are established, precepts are set. Precepts serve to examine the mind; once precepts are set, deportment is established. Deportment inspires awe and provides a model. When deportment is fully realized, every movement—whether bowing, advancing, or retreating—every step in measured procession, every preservation of authenticity and contemplation of the Dao, every ascent of the altar to present memorials, every prostration and reverent bow—must be flawless to accord with the standards of teaching and transformation.\n\nMoreover, the profound and wondrous teachings of the Dao align with the principle of emptiness and non-being. How can one disregard the classical precedents and indulge one’s own whims?\n\nMaster Wuwei bowed his head and received the command.\n\n**Chapter Seventeen: On the Use of Music in Retreats**\nMaster Yun Guang declared: When conducting a retreat and performing the Daoist rites, it is called *courtly reverence*. Once the rites are observed, music must also be complete.\n\nWhen music is performed at the Circular Mound, the celestial spirits descend; when performed at the Square Marsh, the earthly deities ascend. The drums harmonize the eight winds, and the melodies regulate the four seasons. The performance of rites and music serves to communicate with heaven and earth and commune with the divine.\n\nAccording to the immortal scriptures, on the Jade Capital Mountain, the assembly of celestial sages and perfected beings performs the grand music of the Celestial Court, striking cloud-chimes, blowing red flutes, accompanied by phoenix dances and crane songs, with rainbow banners and feathered canopies, burning incense and offering flowers, chanting the *Step-Void Hymns* as they circumambulate the Heavenly Worthy—such is the proper observance.\n\nNowadays, the music performed at suburban altars and ancestral temples extols only the virtues of ancestors, with no other lyrics. Even commonplace words are unfit for the royal court; how much more so before the Jade Emperor and Supreme Deity?\n\nMaster Wuwei asked: In today’s temple halls, a profusion of miscellaneous music is presented—songs of Ba and dances of Yu, all intermingled. If even secular verses are not excluded, how can the *Step-Void Hymns* remain unsullied?\n\nThe Master replied: When the emperor feasts his ministers, it is called *displaying benevolence*, and even performances by jesters or vulgar songs of Ba may be presented. But the lyrics for suburban altars and ancestral temples are nothing if not refined and elegant; how could coarse and base words be permitted in the sacred music? How much less before the Celestial Worthies and Perfected Immortals, where only the language of the common world is used—this is utterly improper.\n\nMaster Wuwei, having heard this principle, withdrew.\n\n**Chapter Eighteen: On Open-Air Altars**\nMaster Wuwei addressed the Master: When a roof is constructed over an altar, it is called the *Terrace of Myriad Wonders* or the *Terrace of the Void Sovereign*. Master Du of Guangcheng has discussed this thoroughly. Yet in ancient times, all palaces and temples had open-air altars, and even today, the four suburban altars of the state remain open to the sky. Though practices have changed, they do not fully accord with antiquity. I humbly request your instruction.\n\nThe Master replied: I have no quarrel with Master Du’s discourse. However, the state’s various altars are used for sacrifices at fixed times; if rain soaks the participants and disrupts their composure, the rites must be abandoned. Nowadays, palaces and temples are built for the people, often through great effort. If rain disrupts the retreat, would this not impose an even greater burden on the patron? Yet if sincerity ascends unimpeded, what harm do layered eaves pose? Open-air and covered altars do not hinder one another.\n\nMaster Wuwei, having heard these words, declared: This truly accords with my heart.\n\n**Chapter Nineteen: On the Merits of Sitting and Standing**\nMaster Wuwei addressed the Master: In today’s palaces and temples, the Three Worthies share a single hall, seated together, and even the Three Officials and Five Emperors are all sculpted in seated postures. If they were all made to stand in attendance, would this be proper?\n\nThe Master replied: The distinction between sitting and standing is not difficult to clarify. Within palaces and temples, each deity has its own courtyard. Consider the analogy of an earthly emperor: he has his own private chambers, while the Three Dukes and Four Ministers each have their own halls. As for the myriad officials, they each attend to their duties; when not in court, why must they stand at attention? Yet on the day of the imperial audience, when ranks are arrayed and all hasten to attend, how could the Three Dukes and ministers face one another while seated?\n\nThe so-called distinction between sitting and standing is not difficult to clarify—it lies precisely here. However, within palaces and temples, wooden and clay sculptures cannot be altered for sitting or standing at will. If the images are painted, then in a single altar’s merit-making, all should stand in attendance, for this accords with the rites of hierarchy and human sentiment.\n\nThe Master of Subtle Awakening bows his head in reverence to receive your instruction.\n\n**Chapter Twenty: On the Ranks of Ritual Feasting**\n\nThe Master of Subtle Awakening addresses the Teacher, saying: \"In the feasts of present-day emperors, even the myriad officials are permitted to be seated. How then can it be that at the Three Clarities’ ritual repast, they must stand with hands clasped?\"\n\nThe Teacher replies: \"The rites of attending court in the human realm, where the master of ceremonies distinguishes ranks, are no different from the rites of paying homage to the Three Clarities—this is called *audience*, not *feast*. Once the ritual repast is set forth, one retires from audience to partake in the meal; what hindrance is there in this? Yet before the Three Honored Ones, one must not fail to stand in attendance. When measured against the *Comprehensive Mirror*, these words are surely verified.\"\n\nThe Master of Subtle Awakening withdraws in silent reflection.\n\nSomeone later said to the Master of Subtle Awakening: \"The rituals of fasting and offering have been transmitted for ages, and your present critique, though refined and just, may yet be met with resistance. For there are still shallow-minded men and vulgar sorts who cling to false doctrines, refusing to trust authoritative teachings. Given the weight of custom and the long-entrenched errors of the multitude, how can the principles you have received ever be put into practice?\"\n\nHe answered: \"I received this from the Master of Universal Dao, and have tested it against the judgment of learned gentlemen. Since it is deemed fitting, why should I fear the words of others? If it accords with the Perfected of Heaven above, what concern have I for worldly opinion? I hope only for the discernment of those who fathom the mysteries, and pray it will not incur reproach.\n\nWritten on the Lantern Festival of the eighth year of Tianfu, at the Purple Ultimate Palace in Changsha, to be circulated among fellow Daoists. May it serve to correct errors, spare the learned from censure, and dispel the ignorance of our followers.\"\n\n*On Correcting Errors in the Ritual Altar*—concluded.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "玄坛刊误论 经名：玄坛刊误论。 原题账若海集。 一卷。 底本出处：《正统道藏》正一部。 玄坛刊误论 悟微子张若海集 悟微子世参簪褐，业在焚修，三洞斋科，诚为己任，因循而已。 踳驳有疑，未遇通人，无所质正。 一日，有霓襟云帔者，云自天台四明而来，容止粹和，瞻视端肃，不言姓氏，称云光先生，诚方外逍遥之人也。 儒释该通，仍精三洞科教，由是舍策憩止，获与之游，且曰咸洛江湖、瓯闽陇蜀、仙坛灵岳，皆得徧游。 每见斋醮旧仪，不免倒置，子之习误，能服义而改之乎？ 悟微子曰：小人颛愚，欣闻良训，稽首作礼，幸得抠衣。 凡蒙指疵，书诸绅带，其玄坛谬误，有二十品目，实前贤未曾商榷，辄思流行，奉三天之法者目之曰：《玄坛刊误论》，无或执迷而违义也。 论入靖品第一 云光先生曰：凡修斋，三日前，道士入斋堂靖室，澡雪襟神，止息妄念，不履殗秽，不听笙歌，端然一心，唯在斋法而已。 今之道士预於斋官者，能孤洁无杂，常自默朝，造次升坛，固无触秽，犹於教法，须示规绳，虽云道德内充，亦在威仪外备，而苟非此辈，宁兔混淆，岂可旦在尘埃，暮登陛级，俾其自省，汝意安乎。 若宫观之中，不能三日，或一日、二日亦可也。 俗家修设，一昼夜入精，其义且通。 悟微子稽首曰：敬闻命矣。 重论入靖品第二 悟微子白先生曰：入靖之事，近多因循，苟能至诚，岂在预事。 云光先生曰：此乃庸俗道士欺谩庸俗之夫，非通论也。 假如国家有事郊庙，其斋官太常卿，上至太尉，并散斋四日，致斋三日，受戒誓后，不吊丧问疾，不作乐，不判刑杀文书，不行刑罚，不亲秽事，不入妻妾之房。 祭前一夜，都省铄宿，明日御史清道。 其所往郊庙之路，金吾司勒地界，禁断师僧、孝子、丧车，不许触污斋官，有渎尊神也，况三清上圣乎？ 悟微子曰：若在官宅，即然。 若在宫观，道士各居靖室，岂俟斋时，方更入靖，得无自鄙耶？ 先生曰：不然。 道士所居靖室，是寝止之室，非入靖朝真之室。 今宫观有精思堂、凝神堂、思微堂、存真堂者，即是入靖之所也。 若就所居之室，即精思诸堂复设何用？ 悟微子曰：诚哉斯言，尔后敢不依禀。 论说戒署职品第三 云光先生曰：说戒署职修斋前，若入靖三日，即於初日戒誓。 若入靖一日，即於其日清旦戒誓。 集道众於法堂，玄中法师前启灵宝自然朝，高功法师即宣扬戒誓，各令净心，专於斋事，秉持教戒之旨也。 然后署六职，各供其职，不得有阙。 说戒署职毕，即监斋宣职状后榜白於斋堂中是也。 今睹修斋道士，当日斋集至夜，自玄中法师前，斋主投词，法师关告后，便升坛行事。 至重谢后，却转洞案，说戒署职，此乃先行其事，然后署职，何倒错之甚也。 悟微子载详斯礼，始觉前科之非，而今而后，得以遵行。 重论说戒事品第四 悟微子屏肃，重白先生曰：今之重谢后说戒，其来久矣，一旦改革，岂有说乎？ 先生曰：是何言欤，是何言欤，事之不经，何必袭旧，复坐，吾语汝。 夫朝真之科，与国家禋祀礼同，而香蔬般醴有异。 享前七日，太尉於都省集斋官戒誓，云某月某日有事，于某庙各扬其职，不供其事，国有常刑，苟致阙遗，祭后举罚。",
      "translated_text": "**The Rectification of Errors in the Altar of Mystery**\n\n**Preface to *The Rectification of Errors in the Altar of Mystery***\nTitle: *The Rectification of Errors in the Altar of Mystery*\nOriginally compiled by Zhang Ruohai.\nOne fascicle.\nSource text: *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n**The Rectification of Errors in the Altar of Mystery**\nCompiled by Wuweizi Zhang Ruohai\n\nWuweizi, having long worn the cap and robe of the Dao, devoted himself to the practice of purification and cultivation. The rituals of the Three Caverns were his solemn duty, yet he merely followed convention without deeper inquiry. Where contradictions arose or doubts lingered, he found no master to consult, no authority to correct his uncertainties.\n\nOne day, a figure appeared—clad in rainbow sleeves and cloud-like sashes—claiming to have come from Tiantai and Siming. His bearing was refined and harmonious, his gaze solemn and upright. He gave no name, only the title \"Master Guangyun,\" a man truly free and unfettered beyond the world. Well-versed in both Confucian and Buddhist teachings, he was also deeply learned in the scriptures and rituals of the Three Caverns. Thus, Wuweizi set aside his staff and rested, gaining the opportunity to accompany him. The master spoke of his travels: from the Central Plains to the rivers and lakes, from Ou and Min to Long and Shu, from sacred altars to numinous peaks—he had journeyed everywhere.\n\n\"In every place,\" he said, \"I have witnessed the old rites of purification and offering overturned and misplaced. You have followed these errors in your practice—are you willing to accept reason and correct them?\"\n\nWuweizi replied, \"This humble one is dull-witted, yet I rejoice to hear your wise instruction.\" He bowed deeply in reverence, humbly seeking guidance. \"Whatever faults you deign to point out, I shall inscribe upon my sash. The errors in the Altar of Mystery number twenty categories—matters that past worthies have never examined. Yet these mistakes persist and spread. For those who uphold the laws of the Three Heavens, I have titled this work *The Rectification of Errors in the Altar of Mystery*, that none may cling to delusion and depart from truth.\"\n\n---\n\n**Chapter One: On Entering the Chamber of Stillness**\n\nMaster Guangyun said: \"When preparing for a purification rite, three days prior, the Daoist must enter the Chamber of Stillness within the purification hall. There, he washes his heart and spirit, stills his wayward thoughts, avoids impurity and defilement, refrains from listening to music, and steadfastly focuses his mind solely on the rites. Today, those Daoists who assist in the purification rites of officials may maintain purity and silence, inwardly facing the dawn. When they ascend the altar in haste, they avoid contamination, yet in matters of teaching and law, standards must still be demonstrated. Though inner virtue may be full, outward decorum must also be complete. If not for such discipline, how can one avoid confusion? How can one rise from the dust at dawn and mount the altar by dusk? Let them reflect—can your conscience be at ease?\"\n\n\"If within a temple, three days may not be possible; one or two days will suffice. For rites held in lay households, entering the chamber for a full day and night is also acceptable.\"\n\nWuweizi bowed deeply and said, \"I respectfully receive your instruction.\"\n\n---\n\n**Chapter Two: A Further Discussion on Entering the Chamber of Stillness**\n\nWuweizi addressed the master: \"The matter of entering the Chamber of Stillness has long been neglected. If one’s sincerity is genuine, why insist on prior preparation?\"\n\nMaster Guangyun replied: \"This is the deceit of vulgar Daoists, misleading the equally vulgar—it is no sound argument. Consider this: when the state conducts sacrifices at the suburban altars or ancestral temples, the officials in charge—from the Minister of Rites to the Grand Commandant—observe a dispersed fast for four days and an intensive fast for three. After receiving the precepts, they do not mourn the dead, inquire after the sick, make music, review documents involving punishment or execution, carry out punishments, engage in impure acts, or enter the chambers of wives and concubines. On the night before the sacrifice, they lodge in the Ministry of State Affairs. The next day, the Censorate clears the roads. The paths to the suburban altars and temples are demarcated by the Gold Bird Guard, who forbid monks, mourners, and funeral carts from defiling the officials, lest they offend the august spirits. How much more should this apply to the Most High Three Pure Ones?\"\n\nWuweizi said: \"If this is the rule for official residences, then so be it. But in temples, Daoists each have their own Chamber of Stillness. Must they wait until the time of purification to enter it? Would that not be self-degrading?\"\n\nThe master replied: \"Not so. The Chamber of Stillness where Daoists reside is a place for rest, not for entering stillness to face the True. Now, in temples, there are halls such as the Hall of Refined Thought, the Hall of Concentrated Spirit, the Hall of Subtle Contemplation, and the Hall of Preserving the True—these are the true places for entering stillness. If one were to use one’s living quarters for this purpose, what need would there be for these halls?\"\n\nWuweizi said: \"Truly, your words are correct. Henceforth, I dare not fail to follow them.\"\n\n---\n\n**Chapter Three: On the Recitation of Precepts and the Assignment of Duties**\n\nMaster Guangyun said: \"Before the purification rite, when entering the Chamber of Stillness for three days, the recitation of precepts and the swearing of vows take place on the first day. If entering for only one day, the recitation and vows occur at dawn on that day. The Daoist assembly gathers in the Dharma Hall, where the Master of the Mysteries initiates the *Natural Audience of the Numinous Treasure*. The High Priest then proclaims the precepts and vows, exhorting all to purify their minds and devote themselves to the rites, upholding the essence of the teachings and precepts. Afterward, the six offices are assigned, each to fulfill its duty without omission. Once the recitation of precepts and assignment of duties are complete, the supervisor of the purification rite posts the list of duties in the purification hall.\"\n\n\"Now, I observe that in purification rites, the Daoists gather on the day of the rite and proceed until nightfall. Before the Master of the Mysteries, the sponsor presents the petition, and after the master’s announcement, they ascend the altar to perform the rites. Only after the Great Thanksgiving do they turn to the Cavern Tablet to recite the precepts and assign duties. This is to perform the rites first and assign duties afterward—how grievously inverted!\"\n\nWuweizi carefully examined this ritual and only then realized the errors of past practices. From this time forward, he resolved to adhere to the correct order.\n\n---\n\n**Chapter Four: A Further Discussion on the Recitation of Precepts**\n\nWuweizi, with solemn demeanor, again addressed the master: \"The practice of reciting precepts after the Great Thanksgiving has persisted for a long time. To change it now—is there justification?\"\n\nThe master exclaimed: \"What words are these? What words are these? If a practice is improper, why cling to the old? Sit again, and I will tell you. The rites for facing the True are akin to the state’s sacrifices, though the offerings of incense, vegetables, and sweet wine differ. Seven days before the sacrifice, the Grand Commandant gathers the officials in the Ministry of State Affairs to recite the precepts, declaring: 'On such-and-such a day and month, there will be a sacrifice at such-and-such a temple. Each shall perform his duty. Those who fail to fulfill their roles will face the standard penalties of the state. Should any omission occur, punishments will be meted out after the sacrifice.'\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1239,
      "start_sentence": 0,
      "end_sentence": 46,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.31948924064636,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\玄坛刊误论.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "未闻彻祭之后，方补斋官也。 今道士登坛重谢后，是行一朝法事毕也，特地却重说戒，听其戒词，又非斋意。 自说初入道披度，戒文次第乖违，庠序颠倒，良由昔人不能刊改，按用谬科，致使后来承此误本。 虽云道门高德曾经校勘，吾弗信也。 一如王侯命官，岂可莅事后方受简牒。 子但质於通论，必有尚理者，为吾攘臂也。 悟微子闻义，方悟前非。 论发炉品第五 云光先生曰：发炉者，即高功法师对三清秉炉，关启修斋之旨也。 其词云：无上玄元始三炁、无极大道、元始天尊、太上大道君、太上老君、自然玉陛下，然后云：臣今奉为大道弟子某官姓名，为某事修某斋，此乃法师面觌元皇之祖也，以上更无上於三清也，故不兼称诸圣矣。 今之修斋道士，称无上三天玄元始三炁、太上老君，召出臣身中三五功曹、左右官使者，是令老君召出身中神也。 又云当召此间土地，速出严装关启，臣今所为某人修某斋者，且法象三天，建立坛级，法师升坛，已在三天之上，对御启奏之次，岂合方仗身神，唤召土地，证明功德，大不可也。 未审土地之神，得上三清之坛否？ 兼云严装，犹虑秘露也，真可笑哉。 况道士受法箓者，九州社令一阶尚不许入神庙，恐与鬼神不安。 今召土地之神，登三清之坛，俾其何以安处？ 假如人臣朝对次，或令从者，唤街吏市，胥预丹墀，证明功业，其可耶？ 其不可耶？ 悟微子鞠躬禀听，惭汗沾涣，不知昔人之误也。 论方忏品第六",
      "translated_text": "The matter has never been heard of—correcting the officiants only after the sacrifice has concluded. Yet now, after Daoists ascend the altar and perform the Great Thanksgiving, when the day’s ritual is complete, they proceed to recite the precepts anew. To listen to these precepts is no longer in accord with the spirit of the fast. From the moment of first entering the Dao and receiving ordination, the sequence of the precept-text has been disordered, its order inverted. This is surely because past generations failed to revise and correct it, blindly following flawed regulations, thus passing down this erroneous version to later ages. Though it is said that eminent masters of the Dao have once examined and collated it, I do not believe it. It is as if a noble lord or appointed official were to receive his commission only after assuming office. You need only consult sound reasoning, and those who uphold principle will surely roll up their sleeves on my behalf.\n\nUpon hearing this truth, Wéiwēizǐ realized his former error.\n\n---\n\n**On the Rite of Offering Incense (Fā Lú Pǐn) Fifth**\n\nMaster Yúnguāng said: The rite of offering incense is when the High Ritual Master, facing the Three Clarities, holds the censer and declares the purpose of the fast. The invocation reads:\n\n> To the Supreme Mysterious Origin, the Three Qi of the Boundless Dao, the Primordial Celestial Worthy of Original Commencement, the Supreme Lord of the Great Dao, the Supreme Venerable Lord, and the Jade Sovereign of Spontaneous Nature—\n>\n> Your servant now acts on behalf of the disciple of the Great Dao, [Official Title] [Name], who undertakes this [type of] fast for [such-and-such] purpose.\n\nThis is the Ritual Master’s direct address to the Primordial Ancestor of the Original Sovereign. There is none higher than the Three Clarities, and thus no other sages are invoked alongside them.\n\nYet today, when Daoists perform the fast, they invoke the Supreme Three Heavens, the Mysterious Origin, the Three Qi, and the Supreme Venerable Lord, commanding them to summon the Three and Five Merit Officers, the left and right envoys within one’s own body—thereby making the Supreme Venerable Lord call forth the deities within oneself. They further command the local earth deity to swiftly prepare and attend the declaration, stating: “Your servant now undertakes this [type of] fast for [such-and-such] person.”\n\nYet the altar is modeled on the Three Heavens, its tiers constructed accordingly. When the Ritual Master ascends the altar, he stands above the Three Heavens, directly addressing the Celestial Worthy in audience. How can he then summon the deities within his own body or call forth the earth deity to witness the merit? Is the earth deity even permitted to ascend the altar of the Three Clarities? Moreover, the phrase “prepare swiftly” risks exposing what should remain concealed—truly laughable!\n\nFurthermore, when a Daoist receives the registers of the Dao, even the lowest-ranking community earth deity of the Nine Provinces is not permitted to enter the sacred precincts, lest it disturb the harmony between spirits and deities. Now, to summon the earth deity to ascend the altar of the Three Clarities—where is it to be accommodated?\n\nIt is as if, during an imperial audience, a minister were to order his attendants to summon a street constable or market official to stand upon the vermilion steps and witness his achievements. Is this permissible? Or is it not?\n\nWéiwēizǐ bowed deeply in reverent listening, his shame so profound that sweat drenched his robes. He had never before realized the errors of past generations.\n\n---\n\n**On the Rite of Repentance (Fāng Chàn Pǐn) Sixth**",
      "overlap_context": "fices, though the offerings of incense, vegetables, and sweet wine differ. Seven days before the sacrifice, the Grand Commandant gathers the officials in the Ministry of State Affairs to recite the precepts, declaring: 'On such-and-such a day and month, there will be a sacrifice at such-and-such a temple. Each shall perform his duty. Those who fail to fulfill their roles will face the standard penalties of the state. Should any omission occur, punishments will be meted out after the sacrifice.'\"",
      "start_char": 1239,
      "end_char": 1803,
      "start_sentence": 47,
      "end_sentence": 66,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.177542686462402,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\玄坛刊误论.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "云光先生曰：法师上十方香，是先降十方真炁，自下升上，然后到上清至尊前。 凡对三清启奏，不兼称诸天尊号者，所以尊三清而已，乃是土无二王，尊无二上者也。 今之修斋者，宣词及三上香后，却礼十方，兼之忏谢，此又非也无是。 入靖时，道士以灵宝自然朝为诸斋之祖。 诸斋法出洞玄灵宝部，所以为斋之祖也。 礼十方灵宝天尊，或兼忏谢，不在坛上，而在法堂也。 其忏文，或以纸书，或以板札，安於十方香几前，不宜辄朝次宣读，祷祝下方天尊也。 而又更礼日月星宿、五岳洞府、三河四海、九江水帝，及上方下方，并经宝等，亦有忏文，谓之二十方也。 更向其中穿凿，凡唱礼，礼东方九拜，南方三拜，西方七拜，北方五拜，四维各三拜，上方三十二拜，下方二十四拜，此不轨之甚也。 十方天尊与日月星辰，於三清前，犹可庶几，五岳水府之神，大不稳便也。 五岳又不礼海外五岳，局见之甚也。 假如人臣对君，有事启奏，或有关宰臣者，须候退朝巡厅，诣宅启白，岂可辄於对扬之次，回首启白宰相也。 夫三清即帝也，十方天尊即臣也，天上人间，尊卑无异，宣读方忏，於理未安。 悟微子退思其言，高卑甚当，敢不遵听也。 论去繁就简品第七 悟微子白先生曰：方忏之言，既已闻义，但行之斯久，人其从之乎？ 先生曰：礼主於敬，不尚於繁，方忏之文，后人所述，虽词华典赡，首露周旋，岂令其上圣徘徊，待听下方祈忏，非所宜也。 昔者，季文子祭，继之以烛，有司跛倚以临祭，虽有庄敬之心，亦已怠矣。 他日，子路预祭，始质明而祭，晏朝而退。 孔子叹曰：孰谓由也不知礼乎？ 此即多其简敬也。 今开三日道场，凡有十一朝法事，至於方忏，尚占九朝。 斋主斋官，久立行事，跛倚坛席，其何以堪。 但书忏文，一读而已，不犹愈乎。 悟微子再白先生曰：或於九朝之中，每朝均读可乎？ 先生曰：必不得已，须要宣文，即三日九朝之中，於重谢退朝之后，宣读三两遍亦可，只须更换忏文，不可三日之内，重读旧文也。 既不赊延法席，又不劳怠斋官，推此而行，有何不可？ 且礼非从天降，非从地出，酌人情而已，苟繁略有节，谁谓不然。 悟微子拜手谢曰：从事於斯也。 论礼拜品第八 云光先生曰：恭默心拜，不更烦文，凡屈伸跪起，内以心敬，外以形恭，内外相应，亦谓五体投地也。 稽首者，一拜额至地。 顿首者，亦是一拜，以头顿地也。 再拜者，两拜也。 通云稽首、顿首、再拜者，是四拜也。 诚惶诚恐者，即是握简曲躬，局地两过，捧简长跪。 少顷，又局地两过而止是也。 今之修斋者，皆云诚惶诚恐、稽首、顿首、再拜，却只礼三拜，应数而已。 故无首体投地之敬，递相仿此，於礼甚亏。 悟微子曰：而今而后，奉而行之。 论转经品第九 云光先生曰：夫经者，太上所说，人之所禀持，或修之於身，或修之於国，此乃奉经之旨也。 凡修斋转经，本在法堂内，法堂即官观正殿，后有说法堂，中列经宝，左列玄中法师，右列天师。 若在宫宅，即对坛场后铺设，供养三宝，便为法堂也左右列师子座两所。 每登坛退朝，即高功法师与斋官於堂开启经文毕，即都讲与侍经升座，演畅经义，开示未悟也。",
      "translated_text": "Master Yun’guang said: When the Dharma Master offers incense to the Ten Directions, he first descends the true *qi* of the Ten Directions, which ascends from below to above before reaching the presence of the Most High of Supreme Clarity. In all petitions addressed to the Three Clarities, one does not concurrently invoke the honorific titles of the myriad Celestial Worthies—this is solely to honor the Three Clarities, for just as a land has no two kings, the exalted admit no dual supremacy.\n\nNow, those who perform purification rites, after reciting the invocation and offering the Three Incenses, proceed to pay homage to the Ten Directions and perform repentance and thanksgiving—this is erroneous and without basis. When entering the oratory, Daoists regard the *Zi Ran Chao* of the Numinous Treasure as the progenitor of all purification rites. Since all such rites derive from the *Dongxuan Lingbao* canon, it is rightly deemed their ancestor. Homage to the Numinous Treasure Celestial Worthies of the Ten Directions, or concurrent repentance and thanksgiving, should take place not upon the altar but within the Dharma hall. The repentance texts, whether inscribed on paper or wooden tablets, are placed before the incense tables of the Ten Directions; they ought not to be recited in sequence during the audience, nor should prayers be directed to the Celestial Worthies of the lower realms.\n\nYet some further bow to the sun, moon, and stellar lodges; the Five Marchmounts and grotto-heavens; the Three Rivers and Four Seas; the Nine Jiang Water Sovereigns; the upper and lower realms; and the scriptural treasures—also accompanied by repentance texts, collectively termed the Twenty Directions. Still others contrive further elaborations: when chanting the litany, they prostrate nine times to the east, three to the south, seven to the west, five to the north, three to each of the four intermediate directions, thirty-two to the upper realm, and twenty-four to the lower—this is an egregious departure from proper order. While the Celestial Worthies of the Ten Directions and the sun, moon, and stars may be accorded some deference in the presence of the Three Clarities, the deities of the Five Marchmounts and water palaces are most unseemly. Moreover, to omit homage to the Five Marchmounts beyond the seas reveals a narrow and partial view.\n\nIt is as if, when a minister addresses the throne to present a matter, or when the matter concerns the chief minister, he must wait until the court has retired, then proceed to the administrative hall or the minister’s residence to make his report—how could he turn his head during the audience to address the chief minister? The Three Clarities are as emperors, the Celestial Worthies of the Ten Directions as ministers; in heaven as on earth, the hierarchy of honor and subordination remains unchanged. To recite repentance texts to the Ten Directions is thus improper in principle.\n\nWéiwēizǐ withdrew to reflect on these words, finding the distinction between high and low most apt, and dared not but heed them.\n\n**On Abandoning the Superfluous and Embracing Simplicity, Seventh**\n\nWéiwēizǐ addressed the Master: Though I have heard the reasoning regarding repentance rites, such practices have long been in use—will others follow if we change them?\n\nThe Master replied: Ritual is founded upon reverence, not upon elaboration. The texts of repentance rites were composed by later generations; though their diction may be ornate and their allusions refined, how can one make the Most High linger, awaiting the recitation of prayers from the lower realms? This is most unseemly. In ancient times, when Ji Wenzi performed sacrifices, he continued them by torchlight; the officiants, leaning on staffs, conducted the rites, and though their hearts were solemn and reverent, they were nonetheless weary. Another day, when Zilu assisted at a sacrifice, he began at first light and retired at dawn. Confucius sighed, saying: “Who would say that You does not know ritual?” This is to value simplicity and reverence.\n\nNow, when a three-day Daoist retreat is held, there are eleven morning audiences in all, yet the repentance rites occupy nine of them. The retreat’s sponsor and officials stand for long periods, leaning against the altar mats—how can they endure it? It would be far better to inscribe the repentance text and read it but once.\n\nWéiwēizǐ again addressed the Master: If, during the nine audiences, the text were read at each, would that be permissible?\n\nThe Master replied: If it cannot be avoided and the text must be recited, then during the three days and nine audiences, after the principal thanksgiving and closing audience, it may be read two or three times—provided the repentance texts are varied and the same text is not repeated over the three days. This neither prolongs the Dharma assembly nor wearies the retreat officials. Proceeding thus, what objection could there be? Ritual does not descend from heaven nor spring from the earth; it is tempered by human sentiment. If elaboration is moderated with restraint, who would say otherwise?\n\nWéiwēizǐ bowed deeply and said: I shall act accordingly.\n\n**On Prostration, Eighth**\n\nMaster Yun’guang said: Silent reverence in prostration requires no further embellishment. In all bending, stretching, kneeling, and rising, let inner devotion match outward form, so that inner and outer accord—this is what is meant by “the five limbs touching the earth.” *Qishou* is a single bow, the forehead touching the ground. *Dunshou* is also a single bow, the head striking the ground. *Zaibai* is two bows. When *qishou*, *dunshou*, and *zaibai* are mentioned together, this signifies four bows. “With utmost trepidation” describes holding the tablet, bowing deeply twice while crouching, then rising to a kneeling position with the tablet held high, and after a moment, bowing deeply twice more before concluding.\n\nNow, those who perform purification rites all say, “With utmost trepidation, *qishou*, *dunshou*, *zaibai*,” yet perform only three bows, merely fulfilling the count. Thus, they lack the reverence of the body fully prostrated upon the earth, and blindly follow one another, greatly diminishing the ritual.\n\nWéiwēizǐ said: From this time forth, I shall observe and practice this.\n\n**On the Recitation of Scriptures, Ninth**\n\nMaster Yun’guang said: The scriptures are the teachings expounded by the Most High, which humans receive and uphold—whether cultivated in the person or in the state—this is the essence of revering the scriptures. In all purification rites involving scripture recitation, the proper setting is within the Dharma hall. The Dharma hall is the main hall of an abbey or temple; behind it lies the hall for expounding the Dharma, where the scriptural treasures are arrayed at the center, the Master of the Mysteries to the left, and the Celestial Master to the right. If the rite is held in a palace or residence, the space is arranged behind the altar, with offerings made to the Three Treasures, thus serving as the Dharma hall, with two lion thrones set to the left and right.\n\nAfter each ascent to the altar and closing audience, the High Merit Dharma Master and the retreat officials proceed to the hall to open the scriptures. Once this is done, the Precentor and Scripture Attendants ascend their seats to expound the scriptural meaning and illuminate what has not been understood.",
      "overlap_context": " the Three Clarities—where is it to be accommodated?\n\nIt is as if, during an imperial audience, a minister were to order his attendants to summon a street constable or market official to stand upon the vermilion steps and witness his achievements. Is this permissible? Or is it not?\n\nWéiwēizǐ bowed deeply in reverent listening, his shame so profound that sweat drenched his robes. He had never before realized the errors of past generations.\n\n---\n\n**On the Rite of Repentance (Fāng Chàn Pǐn) Sixth**",
      "start_char": 1803,
      "end_char": 3029,
      "start_sentence": 67,
      "end_sentence": 111,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.513853788375854,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\玄坛刊误论.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "故《侍经简文》云：卫师子之两座，即其旨也。 今之修斋者，每朝奏罢，却於坛上唱礼转经，甚无谓也。 又开经前有咒诵，是法师存思密念而已。 今道众不候法师存念下次，辄便厉声朗诵，不其乖乎。 悟微子谨佩良训，不敢失坠。 论勑坛品第十 云光先生曰：勑坛者，本是勑水也，降五方五龙真气之水，解除殗秽也。 在宫观灵坛、神仙福地，即勿用禁勑，自有灵官护卫，何邪秽之解袚？ 所虑营备斋物，及人物往来，惹诸秽气，或须行解也。 若在宫宅修斋，即宜全行解禁法事，但请降五方五童君真气是也。 今之修斋者，须云东方青童君身长九千万丈，从官九千万人南西北方，皆法方气又何劳定其长短，拘其人数也。 又云飞仙神仙、日月星宿、三河四海，兵马各亿万骑，又何多也。 尺云可盖屋三重，远坛三匝，何三清玄坛，既设临时，方役灵官盖屋也。 又云上张天罗，下布地网，何三清坛上，更张罗网也。 鄙猥之语，尔其去之。 悟微子豁然，拜手禀命也。 论醮坛品第十一 云光先生曰：醮者，祭之别名也。 肉食谓之祭，礿食谓之醮。 凡修斋，上至三清上境，次乃十极诸真，下及五帝三官、神仙灵官之属。 三日三夜，香灯旛花，列位供养，何散斋之日，而又用酒醮灵官也。 若行之於未散之前，且爽尊卑之礼； 行之於既散之后，又妨导从之仪。 天真既预於斋馐，灵官岂须於酒醮，但於散席之旦，就灵官位，供养醮馔茶汤即是也。 通鉴之士，无或致疑。 悟微子曰：以酒为醮，行之既久，顿废可乎？ 先生曰：若单设醮席，自有科仪，与斋法本殊，不用酒脯，又何嫌也。 然斋坛灵官三日，受香饭之供，岂宜不随轩驾，迟留破斋，求之俗人，尚犹不可，所务允当，勿信凡庸。 悟微子受教，永永禀佩。 论三画四夜品第十二 云光先生曰：凡修斋，云九时行道者，三昼四夜也。 兼言功拜表，都十一朝也。 九朝，即第一夜，至明日五更及斋时，第二、第三日，各是三朝，凡九朝也。 至第三夜一朝，号言功法事。 至第四日五更，为拜表荷恩法事，共十一朝也。 今修斋者，行十一朝法事，又都不分别言功、荷恩之礼，至第四日，又读无上斋词，云表白散斋，此乃十二朝也，何重迭之甚乎？ 悟微子曰：小子鄙懵不知，仰荷开示。 论唱道及登坛品第十三 云光先生曰：凡修斋逐朝，登坛之前，法师与官班立於玄中法师前，高功法师启白后，都讲唱：道场众等，人各运心，归命三宝，赞咏行道。 其所唱云人各运心者，即是令法师斋官，运心玄极，注想宸严，旨在默念冥思，且非齐声竞念也。 今之修斋者，不原都讲所唱之理，不依注想运心之规，厉其音声，念其功德，至於圣真品位罔间尊卑。 而又每登灵坛，元自地户升旋，行至上级，朝退即自天门降之。 今之斋者，升自地户，降自地户，了不履於天门，不唯灵官所诛，抑乃识者所诮。 悟微子稽首，谨佩明言。 论斋粥前后诵念品第十四 云光先生曰：凡登堂赴坐，或斋或粥之前，先行净，后行香。 然舒巾毕，供物。 至都讲声磬者三，法师默念出生咒毕，复声磬二次，乃斋也。 斋毕，又声磬三。 都讲昤为诸赞，及回向功德。 赞毕，即斋官起也。 今之修斋者，於斋粥后，又念功德，上至三清上尊，次及五帝、三官、真仙、神仙、灵官之属，抑又过也。",
      "translated_text": "Thus, as stated in *The Simplified Text for Scripture Attendants*: \"To guard the two lion thrones of the Masters\" is precisely its intent. Yet those who conduct present-day retreat rites, after concluding each morning’s memorial audience, proceed to chant the liturgy and recite scriptures upon the altar itself—how meaningless this is! Moreover, before the scriptures are opened, there are incantations to be recited, which are meant for the Dharma Master’s silent contemplation alone. Now, however, the Daoist assembly, without awaiting the Dharma Master’s completion of his meditative recitation, immediately raises their voices in loud chanting—how contrary to proper order!\n\nI, Wuweizi, humbly bear these fine instructions in mind and dare not let them fall into neglect.\n\n**On the Rite of the Consecrated Altar (Chapter Ten)**\nMaster Yun’guang states: The \"consecrated altar\" originally refers to consecrated water—water infused with the true *qi* of the Five Directions and Five Dragons, used to dispel impurity and defilement. In sacred altars of abbeys and temples, or in the blessed lands of immortals, there is no need for such prohibitions and consecrations, for divine officials already stand guard. What impurity or defilement is there to dispel? The concern lies only in the preparation of retreat offerings and the comings and goings of people, which may attract impure *qi*, thus necessitating purification rites. When conducting a retreat in a palace or residence, however, the full rite of purification and prohibition should be performed, invoking only the descent of the true *qi* of the Five Directional Youthful Lords.\n\nYet those who conduct retreats today insist on declaring: \"The Azure Youthful Lord of the East stands nine thousand myriad *zhang* tall, attended by nine thousand myriad officials.\" The Lords of the South, West, and North are likewise described in accordance with their directional *qi*—why then fix their height or restrict their number? They further proclaim: \"Flying immortals, divine immortals, sun, moon, and stars, the Three Rivers and Four Seas, each with armies of a hundred million cavalry\"—how excessive this is! They claim that a single *chi* of cloud can cover three layers of a roof, encircling the altar thrice—yet when the Three Clarities’ numinous altar is already erected, why must divine officials be summoned to cover it? They speak of \"spreading a celestial net above and an earthly net below\"—why then, atop the Three Clarities’ altar, must nets be spread anew? Such vulgar and coarse language—let it be cast aside!\n\nI, Wuweizi, enlightened at once, bow in reverence and receive this teaching.\n\n**On the Offering Altar (Chapter Eleven)**\nMaster Yun’guang states: The term *jiao* is another name for sacrifice. Sacrifices involving meat are called *ji*, while those with vegetarian offerings are called *jiao*. In all retreat rites, offerings are first made to the Three Clarities of the Highest Realm, then to the Ten Poles and all Perfected Ones, and finally to the Five Emperors, the Three Officials, and the ranks of divine immortals and numinous officials. For three days and nights, incense, lamps, banners, and flowers are arrayed, and offerings are made to each station. Why then, on the day of the dispersed retreat, are wine and *jiao* rites offered to the numinous officials? If performed before the retreat’s dispersal, it disrupts the order of precedence; if after, it interferes with the protocol of the divine retinue. Since the Celestial Perfected already partake of the retreat’s offerings, why should the numinous officials require wine and *jiao*? Instead, on the morning following the retreat’s dispersal, offerings of *jiao* delicacies, tea, and broth may be made at the station of the numinous officials—this suffices.\n\nThose of discernment should harbor no doubts on this matter.\n\nWuweizi asks: Since wine has long been used in *jiao* rites, can it be abruptly abolished?\n\nThe Master replies: If a *jiao* feast is set independently, it follows its own liturgical protocols, distinct from retreat rites, and does not require wine or dried meats—what objection could there be? Yet for three days, the numinous officials of the retreat altar receive offerings of fragrant rice. How could they not follow the divine carriage, lingering to break the retreat’s fast? Even among common folk, such conduct would be improper. Ensure all matters are just and fitting; do not heed the vulgar.\n\nI, Wuweizi, receive this teaching and will forever bear it in mind.\n\n**On the Three Days and Four Nights (Chapter Twelve)**\nMaster Yun’guang states: In retreat rites, when it is said that the Dao is practiced in nine periods, this refers to three days and four nights. Including the rites of merit and the presentation of memorials, the total is eleven audiences. The nine audiences consist of: the first night, continuing until the fifth watch and the retreat hour of the following day; the second and third days each constitute three audiences, totaling nine. The audience on the third night is called the \"rite of merit.\" At the fifth watch of the fourth day, the \"rite of presenting memorials and bearing gratitude\" is performed, making eleven audiences in all.\n\nYet those who conduct retreats today perform eleven audiences without distinguishing between the rites of merit and the presentation of memorials. On the fourth day, they further recite the *Supreme Retreat Petition*, announcing the dispersal of the retreat—this makes twelve audiences. Why such excessive repetition?\n\nWuweizi says: Your humble disciple, ignorant and dull, humbly receives this enlightening instruction.\n\n**On Chanting the Dao and Ascending the Altar (Chapter Thirteen)**\nMaster Yun’guang states: In every retreat, before ascending the altar each morning, the Dharma Master and the officials stand before the Master of the Mysteries. After the High Merit Dharma Master makes his announcement, the Precentor chants: \"All in the Dao assembly, each direct your mind, take refuge in the Three Treasures, and praise and practice the Dao.\" The phrase \"each direct your mind\" instructs the Dharma Master and retreat officials to focus their minds on the Mysterious Ultimate, visualizing the august presence of the Celestial Worthy. The intent lies in silent contemplation and inner reflection, not in competing to chant aloud in unison.\n\nYet those who conduct retreats today fail to grasp the Precentor’s meaning, do not follow the rule of visualizing and directing the mind, and instead raise their voices to recite merits and virtues, disregarding the hierarchy of the sagely and divine ranks. Moreover, each time they ascend the numinous altar, they should begin at the Earth Gate, circumambulate upward, and upon concluding the audience, descend from the Heavenly Gate. Yet those conducting retreats today ascend and descend solely through the Earth Gate, never treading the Heavenly Gate. Not only will the numinous officials punish such conduct, but the discerning will also ridicule it.\n\nI, Wuweizi, bow my head in reverence and humbly bear these enlightening words in mind.\n\n**On Recitations Before and After Retreat Meals (Chapter Fourteen)**\nMaster Yun’guang states: Whenever entering the hall to take one’s seat, whether before the retreat meal or the congee, first perform the purification, then offer incense. After unfolding the cloth, present the offerings. When the Precentor strikes the chime three times, the Dharma Master silently recites the *Birth-Incantation*, then the chime is struck twice more—this signals the beginning of the meal. After the meal, the chime is struck three times. The Precentor then leads the hymns of praise and the dedication of merits. Once the hymns conclude, the retreat officials rise.\n\nYet those who conduct retreats today, after the meal or congee, recite merits and virtues, invoking first the Three Clarities of the Highest Realm, then the Five Emperors, the Three Officials, the Perfected Immortals, divine immortals, and numinous officials—this is excessive indeed!",
      "overlap_context": "in a palace or residence, the space is arranged behind the altar, with offerings made to the Three Treasures, thus serving as the Dharma hall, with two lion thrones set to the left and right.\n\nAfter each ascent to the altar and closing audience, the High Merit Dharma Master and the retreat officials proceed to the hall to open the scriptures. Once this is done, the Precentor and Scripture Attendants ascend their seats to expound the scriptural meaning and illuminate what has not been understood.",
      "start_char": 3029,
      "end_char": 4292,
      "start_sentence": 112,
      "end_sentence": 163,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.937751054763794,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\玄坛刊误论.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "且斋官每登坛朝奏，莫不俯仰兢兢，衣冠济济，对宸极，尚虑亏仪，岂可於端坐饱食之间，念上圣天真之号，仍云念斯功德，回福斋家，即不知昼夜朝修，功德何在，须俟饱妖，复念圣真，唯知战彼释徒，罔畏掇其天谴。 悟微子顿觉前误，俯伏谢之。 论斋主心词品第十五 云光先生曰：凡修斋一昼两夜，或三昼三夜，或七昼七夜，并须词文逐日更换，在斋意即不殊，於词言须各别，不可遍遍宣读元上词文也。 初建斋，一词述其大纲，所为意度，未可便有祈祷也； 次一词，方露祷祈意旨； 末一词，首谢浼黩圣听，及荷恩之旨也。 今之修斋者，不计日数，即执一文，重重宣扬，得不挠於听览也。 譬如世之帝王，臣下有事誊奏，或一表再表，只用旧词可乎？ 比之一人，尚犹未可，论及三宝，其何以安？ 悟微子扣头作礼，誓禀明训。 论教化法式品第十六 云光先生曰：教化法式，圣人之垂范者也。 教者，教也； 化者，变也。 谓敷弘太上之教，广变人天之化，教化既布，即有法式。 谓轨则制度也法式既立，即有科律。 律以检行科律既立，即有禁戒。 戒以检心禁戒既立，即有威仪。 有威可畏，有仪可象威仪既备，即俯仰进止，庠序雅步，存真念道，登坛朝奏，礼拜稽首，动无亏阙，方合教化法式也。 且夫弘妙有之教，合虚无之理，岂可不稽典诰，而肆胸襟也哉。 悟微子顿首禀命。 论凡修斋用乐品第十七 云光先生曰：凡修斋行道，谓之朝礼，礼既行矣，乐亦备焉。 夫乐奏之圆丘，天神降奏之，方泽地祇升，鼓之以和八风，播之以正四序。 行礼作乐者，所以通天地而交神明也。 谨按仙书，玉京山诸天仙圣众，奏钧天广乐，鼓云璈，吹赤箫，鸾歌凤舞，霓幢羽葆，燃香捧花，步虚赞咏，旋绕天尊，即其事也。 今之郊庙登歌，皆述祖宗之德，别无他词。 若以寻常之词，不可扬于王庭也，而况玉皇上帝之前乎？ 悟微子曰：今之殿庭，广陈杂乐，巴歌渝舞，悉参其问，即人间小诗，安得不播於步虚哉？ 先生曰：帝王宴旱臣，号曰示慈惠，尚有观优之乐，巴歌下节，悉可敷陈，若郊庙之词，无非典雅，岂容鄙猥，预於登歌，何况上帝天真之前，而用凡俗之语，斯不然也。 悟微子闻义而退。 论露坛品第十八 悟微子白先生曰：坛上施屋，号日众妙台，亦号虚皇台，广成杜先生论之备矣。 然古者宫观，皆是露坛，今之国家四郊，亦是露坛。 虽有改张，曲不合古，请垂开示。 先生曰：杜公之论，吾无间然。 但国家诸坛，祭享有时，雨沾失容，其礼即废。 今之宫观，本为众人或力辨建修，遇雨而废，即於斋主，岂不重劳，但能精诚上通，何患重檐所障。 露之与盖，两不相妨。 悟微子审闻斯言，诚吾心也。 论坐立功德品第十九 悟微子白先生曰：今之宫观，三尊同殿而坐，乃至三官、五帝，悉皆塑坐，若并令侍立，其义可乎？ 先生曰：坐立之仪，不难辩白。 宫观之内，各有院宇。 譬如人世帝王，自有正寝，三公四相，各有厅事。 至於百执事，皆守司存，既非趋朝，何必拱立。 若当临轩之日，列班而趋，岂容宰相、三公，相向而坐。 五n 所谓坐立之仪，不难辨白，正在斯乎。 但以宫观之间，木雕泥塑临时坐立，不可改更，若是绘画，一坛功德，并宜立侍，即尊卑之礼，有吋人情。",
      "translated_text": "And when the retreat officials ascend the altar to present their memorials, none fail to conduct themselves with solemn reverence—robes and caps immaculate, bearing themselves with utmost care before the celestial throne, ever fearful of lapses in decorum. How then can they, in the midst of seated feasting, recite the names of the Most High Sagely Celestials, claiming such recitation as the dedication of merits to bless the retreat’s patrons? Do they not realize that the merits of day-and-night devotions lie precisely in their unceasing observance? Must they wait until sated with food before invoking the sagely and perfected once more? They vie only with the Buddhist clergy, heedless of incurring heavenly censure.\n\nMaster Wuwei, suddenly perceiving his past errors, prostrated himself in repentance.\n\n**Chapter Fifteen: On the Retreat Patron’s Intent and Petitions**\nMaster Yun Guang declared: For a retreat lasting one day and two nights, three days and three nights, or seven days and seven nights, the petitions must be changed daily. Though the intent of the retreat remains constant, the wording of the petitions must vary; the same text cannot be recited repeatedly from beginning to end.\n\nAt the retreat’s commencement, the first petition should outline its general purpose and objectives, without yet making any supplications. The next petition may then reveal the intent of prayer and entreaty. The final petition should begin with an apology for having wearied the sagely ears with importunity, followed by expressions of gratitude for the received blessings.\n\nYet those who conduct retreats today, regardless of duration, cling to a single text, reciting it over and over—does this not weary the listeners? Consider the analogy of an earthly sovereign: if a minister presents a memorial, then submits another, can he simply reuse the same words? Even for a single petitioner, this would be improper; how much more so when addressing the Three Treasures?\n\nMaster Wuwei bowed his head in reverence, vowing to heed this enlightened instruction.\n\n**Chapter Sixteen: On the Standards of Teaching and Transformation**\nMaster Yun Guang declared: The standards of teaching and transformation are the models bequeathed by the sages. *Teaching* means to instruct; *transformation* means to change. It is to broadly propagate the teachings of the Most High and widely transform the natures of humans and gods. Once teaching and transformation are disseminated, standards are established—these are the rules and systems. Once standards are set, regulations follow. Regulations serve to examine conduct; once regulations are established, precepts are set. Precepts serve to examine the mind; once precepts are set, deportment is established. Deportment inspires awe and provides a model. When deportment is fully realized, every movement—whether bowing, advancing, or retreating—every step in measured procession, every preservation of authenticity and contemplation of the Dao, every ascent of the altar to present memorials, every prostration and reverent bow—must be flawless to accord with the standards of teaching and transformation.\n\nMoreover, the profound and wondrous teachings of the Dao align with the principle of emptiness and non-being. How can one disregard the classical precedents and indulge one’s own whims?\n\nMaster Wuwei bowed his head and received the command.\n\n**Chapter Seventeen: On the Use of Music in Retreats**\nMaster Yun Guang declared: When conducting a retreat and performing the Daoist rites, it is called *courtly reverence*. Once the rites are observed, music must also be complete.\n\nWhen music is performed at the Circular Mound, the celestial spirits descend; when performed at the Square Marsh, the earthly deities ascend. The drums harmonize the eight winds, and the melodies regulate the four seasons. The performance of rites and music serves to communicate with heaven and earth and commune with the divine.\n\nAccording to the immortal scriptures, on the Jade Capital Mountain, the assembly of celestial sages and perfected beings performs the grand music of the Celestial Court, striking cloud-chimes, blowing red flutes, accompanied by phoenix dances and crane songs, with rainbow banners and feathered canopies, burning incense and offering flowers, chanting the *Step-Void Hymns* as they circumambulate the Heavenly Worthy—such is the proper observance.\n\nNowadays, the music performed at suburban altars and ancestral temples extols only the virtues of ancestors, with no other lyrics. Even commonplace words are unfit for the royal court; how much more so before the Jade Emperor and Supreme Deity?\n\nMaster Wuwei asked: In today’s temple halls, a profusion of miscellaneous music is presented—songs of Ba and dances of Yu, all intermingled. If even secular verses are not excluded, how can the *Step-Void Hymns* remain unsullied?\n\nThe Master replied: When the emperor feasts his ministers, it is called *displaying benevolence*, and even performances by jesters or vulgar songs of Ba may be presented. But the lyrics for suburban altars and ancestral temples are nothing if not refined and elegant; how could coarse and base words be permitted in the sacred music? How much less before the Celestial Worthies and Perfected Immortals, where only the language of the common world is used—this is utterly improper.\n\nMaster Wuwei, having heard this principle, withdrew.\n\n**Chapter Eighteen: On Open-Air Altars**\nMaster Wuwei addressed the Master: When a roof is constructed over an altar, it is called the *Terrace of Myriad Wonders* or the *Terrace of the Void Sovereign*. Master Du of Guangcheng has discussed this thoroughly. Yet in ancient times, all palaces and temples had open-air altars, and even today, the four suburban altars of the state remain open to the sky. Though practices have changed, they do not fully accord with antiquity. I humbly request your instruction.\n\nThe Master replied: I have no quarrel with Master Du’s discourse. However, the state’s various altars are used for sacrifices at fixed times; if rain soaks the participants and disrupts their composure, the rites must be abandoned. Nowadays, palaces and temples are built for the people, often through great effort. If rain disrupts the retreat, would this not impose an even greater burden on the patron? Yet if sincerity ascends unimpeded, what harm do layered eaves pose? Open-air and covered altars do not hinder one another.\n\nMaster Wuwei, having heard these words, declared: This truly accords with my heart.\n\n**Chapter Nineteen: On the Merits of Sitting and Standing**\nMaster Wuwei addressed the Master: In today’s palaces and temples, the Three Worthies share a single hall, seated together, and even the Three Officials and Five Emperors are all sculpted in seated postures. If they were all made to stand in attendance, would this be proper?\n\nThe Master replied: The distinction between sitting and standing is not difficult to clarify. Within palaces and temples, each deity has its own courtyard. Consider the analogy of an earthly emperor: he has his own private chambers, while the Three Dukes and Four Ministers each have their own halls. As for the myriad officials, they each attend to their duties; when not in court, why must they stand at attention? Yet on the day of the imperial audience, when ranks are arrayed and all hasten to attend, how could the Three Dukes and ministers face one another while seated?\n\nThe so-called distinction between sitting and standing is not difficult to clarify—it lies precisely here. However, within palaces and temples, wooden and clay sculptures cannot be altered for sitting or standing at will. If the images are painted, then in a single altar’s merit-making, all should stand in attendance, for this accords with the rites of hierarchy and human sentiment.",
      "overlap_context": "is signals the beginning of the meal. After the meal, the chime is struck three times. The Precentor then leads the hymns of praise and the dedication of merits. Once the hymns conclude, the retreat officials rise.\n\nYet those who conduct retreats today, after the meal or congee, recite merits and virtues, invoking first the Three Clarities of the Highest Realm, then the Five Emperors, the Three Officials, the Perfected Immortals, divine immortals, and numinous officials—this is excessive indeed!",
      "start_char": 4292,
      "end_char": 5549,
      "start_sentence": 164,
      "end_sentence": 213,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.56214880943298,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\玄坛刊误论.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "悟微子稽首闻命。 论斋宴仪品第二十 悟微子白先生曰：今之帝王宴会，百执事皆得预坐。 安有三清斋席，须令拱立乎？ 先生曰：人世趋朝，司仪辨等，与夫朝拜三清之礼，其事正同，此谓朝也，非谓宴也。 既设斋馔，即退朝就食，又何所妨。 但三尊前，不得不侍立也。 质於通鉴，方谅斯言。 悟微子默然而退。 或谓悟微子曰：斋醮之仪，相传已久，今之驳杂，雅合是非，但虑浮浅之夫、鄙猥之辈，尚执妄说，不信格言，其如众口因循，久安舛误，吾子所禀，殆难行乎？ 答曰：吾得之於通方道人，质之於博学君子，既曰允当，岂恤人言，苟上合於天真，又何忧於俗论，幸希玄鉴，无致诋诃。 时天福八年上元日，於长沙紫极宫写札，传於同道，庶几刊误，免贻议於识者，开吾徒蒙吝也。 玄坛刊误论竟",
      "translated_text": "The Master of Subtle Awakening bows his head in reverence to receive your instruction.\n\n**Chapter Twenty: On the Ranks of Ritual Feasting**\n\nThe Master of Subtle Awakening addresses the Teacher, saying: \"In the feasts of present-day emperors, even the myriad officials are permitted to be seated. How then can it be that at the Three Clarities’ ritual repast, they must stand with hands clasped?\"\n\nThe Teacher replies: \"The rites of attending court in the human realm, where the master of ceremonies distinguishes ranks, are no different from the rites of paying homage to the Three Clarities—this is called *audience*, not *feast*. Once the ritual repast is set forth, one retires from audience to partake in the meal; what hindrance is there in this? Yet before the Three Honored Ones, one must not fail to stand in attendance. When measured against the *Comprehensive Mirror*, these words are surely verified.\"\n\nThe Master of Subtle Awakening withdraws in silent reflection.\n\nSomeone later said to the Master of Subtle Awakening: \"The rituals of fasting and offering have been transmitted for ages, and your present critique, though refined and just, may yet be met with resistance. For there are still shallow-minded men and vulgar sorts who cling to false doctrines, refusing to trust authoritative teachings. Given the weight of custom and the long-entrenched errors of the multitude, how can the principles you have received ever be put into practice?\"\n\nHe answered: \"I received this from the Master of Universal Dao, and have tested it against the judgment of learned gentlemen. Since it is deemed fitting, why should I fear the words of others? If it accords with the Perfected of Heaven above, what concern have I for worldly opinion? I hope only for the discernment of those who fathom the mysteries, and pray it will not incur reproach.\n\nWritten on the Lantern Festival of the eighth year of Tianfu, at the Purple Ultimate Palace in Changsha, to be circulated among fellow Daoists. May it serve to correct errors, spare the learned from censure, and dispel the ignorance of our followers.\"\n\n*On Correcting Errors in the Ritual Altar*—concluded.",
      "overlap_context": "anks are arrayed and all hasten to attend, how could the Three Dukes and ministers face one another while seated?\n\nThe so-called distinction between sitting and standing is not difficult to clarify—it lies precisely here. However, within palaces and temples, wooden and clay sculptures cannot be altered for sitting or standing at will. If the images are painted, then in a single altar’s merit-making, all should stand in attendance, for this accords with the rites of hierarchy and human sentiment.",
      "start_char": 5549,
      "end_char": 5868,
      "start_sentence": 214,
      "end_sentence": 226,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.411822319030762,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\玄坛刊误论.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}