{
  "source_id": "玄天上帝启圣灵异录",
  "source_file": "chunked_daozang\\玄天上帝启圣灵异录.json",
  "total_chunks": 10,
  "total_original_chars": 6915,
  "total_translated_chars": 42914,
  "total_translation_time": 221.6535725593567,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\记传类\\玄天上帝启圣灵异录.txt",
    "category": "记传类"
  },
  "full_translation": "**Record of Divine Marvels Manifested by the Dark Heavenly Emperor**\n\n**Title:** *Record of Divine Marvels Manifested by the Dark Heavenly Emperor*\nCompiled by Xu Shilong et al. of the Yuan dynasty. One fascicle.\nSource text: *Daoist Canon of the Zhengtong Era*, \"Records and Biographies\" section of the *Dongshen* Division.\n\n---\n\n### *Record of Marvels at the Yuan Dynasty’s Founding of the Zhenwu Temple*\nComposed by Xu Shilong, Hanlin Academician and Lecturer, concurrently Vice Minister of the Ministry of Revenue\n\nIn the tenth year of the emperor’s reign, the new great capital was established in Yan, its completion imminent. In the twelfth month of that winter, on the day *gengyin*, a divine serpent appeared in the waters of Gaoliang River west of the city. Its body was azure, its head radiant with golden splendor, astonishing all who beheld it. Incense was burned in offering, and the serpent coiled forward to partake before departing. The following day, *xinmao*, a sacred tortoise emerged, its shell inscribed with golden patterns, its auspicious light resplendent, lingering for a long while. Now, this was the season of winter’s closure and concealment, when tortoises and serpents lie dormant—yet they appeared at this time, clearly manifesting as divine beings.\n\nThereafter, word reached the inner palace of the empress, who dispatched an imperial envoy to inquire among the people. All affirmed that this was the manifestation of the Dark Warrior deity. Thus, an edict was issued to construct a shrine at the site of the apparition in the second month of the following year, on the day *jiaxu*, to honor the deity’s numinous presence.\n\nAccording to the *Wenyao Gou*: \"The Black Emperor of the Northern Palace, whose essence is the Dark Warrior, is the divine sovereign of the northern direction.\" Our dynasty’s foundations were laid in the northern lands, its flourishing virtue aligned with the Water phase. Now, as the Son of Heaven surveys the four quarters and establishes the capital, in this month when the Water phase prevails, the deity has deigned to descend. This portends the extension of our august fortune, the flourishing of our mandate, and the inauguration of a realm of eternal peace. Ah! The temple is newly built, and the deity has graciously accepted our veneration. Henceforth, may wind and rain arrive in due season, may the harvests be bountiful, and may the people ascend to the realm of benevolence and longevity. May our sagacious empress assist the sacred Son of Heaven in revering the divine will.\n\nI, Shilong, unworthy in my literary office, have been privileged to witness this auspicious sign. I dare not conceal the truth and thus record it here.\n*Written on a day in the second month of the seventh year of the Zhiyuan era.*\n\n---\n\n### *Stele Inscription for the Founding of the Zhaoying Palace*\nComposed by Minister of the Ministry of Rites, Xu Shilong, by imperial decree\n\nOur dynasty’s foundations were laid in the northern lands, where the martial might of the gods pacified the realm. The successive sagely emperors extended their dominion, and none beyond our borders dared defy their rule. The present emperor, born to receive Heaven’s mandate, has inherited the great throne. He has examined the classics and canons, embellishing the grand enterprise: establishing ancestral temples, refining rites and music, instituting official systems—all affairs of state have been renewed with splendor.\n\nYet the palaces remained incomplete, and the ministers petitioned to establish the capital in Yan. The emperor approved, and in the third year of the Zhiyuan era, a new capital was founded north of the old city. In the twelfth month of the sixth year, on the day *gengyin*, west of the city, in the waters of Gaoliang River south of Jinshui, a serpent emerged. It measured over a foot in length, its head gleaming with golden radiance, its back adorned with azure markings. Those who saw it marveled, offering incense and bowing in reverence. The serpent, docile and unafraid, approached, craning its neck to gaze at the people before coiling into the incense burner, lingering awhile before departing.\n\nThe next day, a divine tortoise appeared, its shell inscribed with dark patterns upon a verdant ground, swimming along the riverbank as if manifesting its numinous power. The people surmised that the tortoise and serpent were the pivots of Heaven and Earth. In this season of winter’s closure, when scaled and shelled creatures lie concealed, their successive appearances must signify something profound. Yu Diechibuhua, Supervisor of the Imperial Treasury, was overseeing construction in the western suburbs when he witnessed the event. He reported it to the empress, who consulted learned ministers. All affirmed that this was the manifestation of the Dark Warrior deity. Thereupon, funds from the imperial treasury were allocated to construct a shrine at the site of the apparition. Yu Diechibuhua was specially dispatched to oversee the project, with Minister of Works Duan Tianyou assembling artisans and craftsmen. A painted depiction was also presented to the throne.\n\nThe emperor declared: \"If the divine sage can secretly protect our people, how can we fail to offer solemn sacrifices in gratitude for its numinous favor?\" Thus, an edict was issued to expand the shrine’s halls and pavilions.\n\nThe palace completed, it was bestowed the name \"Zhaoying.\" The emperor then commanded his ministers to inscribe words upon stone. Minister Shen Shilong respectfully noted: As Zhang Heng of the Han wrote in his *Fu on Contemplating the Mysteries*, \"The Dark Warrior coils within its shell; the soaring serpent winds aslant.\" For the serpent and dragon are yang in kind, corresponding above to the Heavenly Net. The tortoise is a creature of mystery, yin in nature, aligning below with the Earthly Axis. Only when yin and yang harmonize does the divine response thus arrive.\n\nNow our sovereign’s sagely virtue and numinous power reach both high and low. Discerning the subtle and governing the manifest, he revolves Heaven and turns Earth. In his diligent governance, his synthesis of names and realities, he follows the model of Emperor Xuan of Han. In his creation of institutions and laws, his transformation of customs, he possesses the measure of Emperor Xiaowen of Wei. Moreover, in loving the people as his children, honoring the worthy as guests, setting aside his own will to follow others, and guiding his ministers with gentle countenance and words—he surpasses even Emperor Taizong of Tang. With unceasing reverence and solemn awe for the divine, it is fitting that the Supreme August One should send down his spirit, to make manifest this illustrious virtue and prosper the grand destiny. How magnificent indeed!\n\nMinister Shen Shilong dares to bow a hundred times and kowtow in offering this inscription. The inscription reads:\n\nThe Dark Warrior, star of mystery,\nEssence of the Black Emperor.\nIts advent bears signs,\nIts portents bear fruit.\nIts omen—fragrance of the Dragon’s virtue.\n\nThe Emperor proclaimed: \"Ah! The divine presence is received, the sacred essence is upheld. Without palace nor courtyard, how shall we offer timely sacrifices? Thus, we elevate the beams, raise the pillars, and deepen the tranquility of gates and chambers—where the spirits find repose. Here we enshrine the numen of the Water Virtue: its waters are like metal, its isle like jade. The divine descends to inquire, magnifying the imperial capital. May it eternally bless the Son of Heaven with ten thousand years of felicity.\"\n\nDated the ninth month of the seventh year of Zhiyuan.\n\n*The Stele of the Founding of the Zhao Ying Palace*\nComposed by Minister Wang Mi, Academician of the Hanlin Academy, Drafter of Edicts, and Compiler of the National History, by imperial command.\n\nSince ancient times, those who have ruled all under heaven have invariably established teachings through the divine Dao. The Emperor, ascending the throne with reverence, has honored all spirits in due order. The Empress, the August Mother without peer, personally administered the inner court, her virtue harmonizing with the imperial destiny. All that she undertook to mystically assist the divine and exalt the rituals of sacrifice was executed with diligent thoroughness.\n\nAccording to the records submitted by the relevant offices: In the sixth year of Zhiyuan, as the capital was newly established, the Empress issued a decree to the Directorate of the Imperial Household, instructing them to survey the vacant land by the Gaoliang River in the western suburbs to settle the newly incorporated populace. Once dwellings were built and markets arranged, on the nineteenth day of the twelfth lunar month—the gengyin day—a sacrifice was offered to the spirit of the Golden Waters. It was the height of winter, when insects burrow and creatures huddle, yet suddenly a propitious radiance shone forth, approaching from the west along the water. Gazing upon it, they beheld a serpent, roughly a foot in length, its back adorned with azure markings and its head gleaming gold. The assembled crowd, astonished by its numinous strangeness, gathered in awe. Yudie Chibuhua, Supervisor of the Directorate of the Imperial Household, led his subordinates in burning incense and prostrating in reverence. They presented a tray, upon which the serpent coiled and ascended, stretching its neck to gaze about as if drinking or partaking in the offering, before departing after some time.\n\nThe following day, a divine tortoise emerged upon the waves, its back inscribed with dark patterns interwoven with gold and azure, circling and swimming with its head turned toward the shore for a long while. The onlookers marveled and sighed, deeming it a sight unseen in former times. Yudie Chibuhua reported the matter to the Empress, who then consulted the ministers versed in all things. They replied that the tortoise and serpent were the essence of the Black Emperor, and that the twelfth month, when water reigns, was the very time for such an auspicious sign—surely a manifestation of the numen of the Dark Warrior. The dynasty’s foundations were laid in the northern lands, and now, with the completion of the capital, this felicitous omen had arrived. Though the divine principle speaks not, it responds through images and categories—how luminously clear!\n\nThereupon, the Empress allocated items from the inner palace’s provisions and commanded Yudie Chibuhua of the Directorate of the Imperial Household to construct a temple at the site of the apparition to enshrine the spirit. She further ordered Minister Duan Tianyou of the Ministry of Works to collaborate in planning and providing labor. Upon its completion, she bestowed upon it the name *Zhao Ying Palace*. Its towering gates and spacious halls, its solemn and profound main sanctuary, its soaring eaves and ornate brackets—all aglow with golden splendor—became a magnificent sight in the capital’s environs.\n\nIn ancient times, when the Zhou house was rising, the virtuous consorts Tairen and Taisi fostered a culture of solemn harmony, their influence celebrated in odes and hymns through the auspicious omens of the *zouyu* and *linzhi*. Now, the Empress’s virtue rivals that of Tairen and Taisi, and her transformative influence parallels that of the Western Zhou. Thus, the divine tortoise and sacred serpent have appeared in auspicious manifestation—a sign that, though separated by eras, resonates with the same portent as the *zouyu* and *linzhi*.\n\nAh! The perspicacious perceive the subtle and know the manifest; they behold things and grasp their principles. The Empress, with her profound and sagacious insight, discerns the subtle before it takes form. She has expended gold and silk to build and exalt this palace—not for leisurely repose, nor for the pleasure of sightseeing, but to glorify the divine majesty, perpetuate the grand destiny, and fulfill the sacred intent of the Son of Heaven in establishing teachings through the divine Dao.\n\nHaving recorded these events, your servant bows his head to the ground and offers this inscription. The inscription reads:\n\nVirtue moves the heart,\nThe divine knows no bounds.\nWhat sign does the numen bear?\nIt proclaims the sagely Emperor.\nWhat does it proclaim?\nThe twelfth month of winter.\n\nThe serpent coils and twists,\nThe tortoise rises from its mat.\nThe sage interprets the omen—\nThe essence of the Dark Emperor.\nThe imperial destiny is secure,\nThe realm at peace.\nThe palace stands by the river,\nBy the Empress’s decree.\nFor ten thousand years,\nBlessings upon the Son of Heaven.\nThe Son of Heaven is sagely,\nThe Empress assists him.\nAh, all under heaven,\nBear witness to these words of instruction.\n\n*Dated the ninth month of the seventh year of the Zhiyuan era.*\n\n---\n\n*The Stele of the Great Heavenly One True Celebration Longevity Palace at Mount Wudang, bestowed by the Yuan*\n\nComposed by Minister Cheng Jufu, Academician of the Hanlin Academy, Drafter of Edicts, and Compiler of the National History, by imperial command.\n\nIn the spring of the first year of the Huangqing era, the capital suffered drought. Prayers were offered at all sacred sites, yet no rain came. An edict was issued to Zhang Shouqing, a Daoist of Wudang, who prayed and brought rain. The following spring, drought struck again, and his prayers again summoned rain. In summer, drought returned, and once more, his prayers brought rain. The land was thoroughly drenched, and the autumn harvest was abundant. The palace rejoiced.\n\nIn the region between Jun and Fang, there stands a mountain called Taihe, also known as Xianshi, where the Dark Warrior spirit resides, hence the name Wudang. It spans eight hundred *li*, with seventy-two peaks, the highest being Zixiao Peak. The most sublime of these is Nan Rock. Before it lie two grotto heavens: Tai’an Huangya Heaven and Xianding Ji Feng Heaven. Above, floating clouds drift; below, sheer ravines plunge. Apes cry and crows caw, while jackals and tigers make their dens. Few places allow a foothold, barely a foot’s width.\n\nThe Daoists say that in the Longhan era, the essence of Xu and Wei descended as a man, cultivating the Dao upon this mountain. Upon attaining the Way, he ascended to heaven riding a dragon—this is the Dark Warrior spirit. By the Tang dynasty’s Zhenguan era, his fame grew, and all under heaven revered and worshipped him. During the reign of Emperor Lizong of the Song, an edict commanded the Daoist Master Liu to build a palace at Nan Rock, but the task was not completed.\n\nLater, a reclusive man from the east, Lu Dayou, dwelled here. Clad in coarse garments and subsisting on meager fare, he lived thus for over forty years, rescuing the distressed and warding off calamities. He foresaw fortune and misfortune, and the people revered him as a spirit. When the imperial troops passed through Xiang and Han and crossed the river in search of the Quanzhen Dao, he journeyed west beyond the fertile lands of Long and north to the Yin Mountains. In the twelfth year of the Zhiyuan era, he returned and, with Daoist Wang Zhenchang and others, restored the altars and halls of Wulong and Zixiao. Alone, he built a thatched hut at Nan Rock. When asked to construct a palace, he replied, “This is not within your capacity. The one destined for this task is yet to come.”\n\nIn the autumn of the twenty-first year, in the ninth month, a master arrived from Xia Prefecture. At thirty-one years of age, he wished to become a disciple. Dayou rejoiced, saying, “I have awaited you for a long time.” He immediately transmitted the essentials of the Dao.\n\nIn the first month of the following spring, Dayou ascended as an immortal. The master personally undertook the labor, clearing the mountains and carving valleys, planting millet for sustenance. Leading his disciples, he cut through dense undergrowth, drove away birds and beasts, and opened a path. From the mountain’s base at Jiaokou, a seventy-*li* journey led to Zixiao Palace, and five *li* further to Nan Rock. Descending north from Nan Rock, thirty *li* brought one to Wulong Palace, and another forty *li* to the mountain’s base at Haokou.\n\nOn the third day of the third month, the day when the spirit was said to first descend, tens of thousands of men and women gathered. Offerings of gold and silk poured forth like clouds and rivers. Thus, he constructed grand halls and soaring pavilions, felling trees and bridging valleys. He carved into sheer cliffs, shaping the rock into a palace. Vast halls and grand courtyards rose, with towering halls and flying pavilions. Kitchens, storerooms, and living quarters were solemn and complete. Vermilion and azure gleamed, their radiance intertwining with the Milky Way. The statues were majestic, the bells and drums resonant. Stone paths wound through, shaded by firs and pines. Countless laborers and vast resources were expended, spanning over twenty years before completion. Hundreds of *qing* of land were cultivated to feed tens of thousands.\n\nIn the third year of the Zhida era, the present Emperor, styled \"Instrument of Heaven and Ascendant Sage,\" and the Empress Dowager Ciren Zhaoyi Shouyuan, hearing of the master’s virtuous conduct, dispatched envoys to command the performance of the Golden Register Offering. Summoned to the capital, his prayers for rain were invariably answered. The palace bestowed the name *Heavenly One True Celebration Longevity Palace*. He was appointed to oversee its affairs.\n\nBy imperial decree, the spirit’s father was honored as *Qiyuan Longqing Heavenly Lord Bright True Great Emperor*, and his mother as *Cining Yude Heavenly Empress Jade True Supreme Immortal*. The master was granted the title *Tixuan Miaoying Great Harmony True Man*.\n\nIn the second month of the spring of the first year of the Yanyou era, Minister of Works Luo Yuan, by the Empress Dowager’s decree, rode a four-horse carriage bearing incense and silk to return to the mountain and offer sacrifices. In the tenth month of winter, Grand Academician Chen Hao requested the addition of the character *Great* to the palace’s name, now styled *Great Heavenly One True Celebration Longevity Palace*. The Hanlin Academician-in-Chief, Minister Liu Geng, was commanded to inscribe it. The Hanlin Academician-in-Chief, Minister Jufu, was ordered to compose the stele’s text; Grand Academician Meng Fu to write the inscription; and Participant in the Deliberations of the Secretariat, Minister Shi Yan, to engrave the title.\n\nYour servant Jufu reflects: The sagely Son of Heaven embodies the essence of purity and stillness, governing with effortless virtue. As father to heaven and mother to earth, he embraces all spirits and nurtures all things, cherishing the myriad people. Rising early and retiring late, he toils for governance—this is the utmost virtue. The master, though born of cloud and mist, has revitalized the Dao and purified his virtue. With burning resolve and苦志, he has erected halls and altars to receive heaven’s favor—truly a heroic figure.\n\nThe master is forthright and resolute, dignified and steadfast. Even at grand sacrifices, he does not bathe or change attire, yet his prayers are invariably answered. Though showered with imperial favor, he remains as when he first entered the mountains—such is the mark of one who has attained the Way.\n\nAs for the spirit’s virtue, vast and boundless, its transformations know no limit. To speak of it is to invoke its ancient dwelling, where its power is concentrated. How could this not be so?\n\nYour servant Jufu bows his head to the ground and offers this poem:\n\nIn the lands of Jun and Fang,\nWhite clouds crown towering Mount Wudang.\nIts roots span a thousand *li*, rugged and steep,\nSeventy-two peaks arrayed like misty tresses.\nThe Emperor sent the Dark Warrior to drive away evil,\nHair unbound, long sword in hand, clad in darkness.\nThe towering tortoise and coiling serpent, fierce and mighty,\nRide the clouds to come and the winds to return.\nI gaze afar, yet it remains distant and unattainable—\nThe True Man studies the Dao, carving through hardship.\nSoaring a thousand *ren*, he clears the wilds,\nTurning the celestial pivot, opening heaven’s gate.\n\nAmidst jade towers and pearl palaces, verdant hues entwine,\nAre they girded in golden splendor by rosy clouds and mist?\nThe Emperor’s profound grace, proclaimed in grand decree,\nDraws the gods to dwell here, their pendants chiming softly.\nCold pines sigh, streams murmur,\nFragrance fills the air, rich with orchid and magnolia.\nMay the gods forever pity the people’s plight,\nSweeping away filth and impurity without ailment or affliction.\nMay our Emperor reign ten thousand years over the nine realms,\nHis sagely joy ever brightening his crimson countenance.\n\n*Dated the third month of the second year of Yan You.*\n\n---\n\nBy the grace of Heaven’s mandate, the Emperor’s sacred decree:\nWe have heard that in the south there is a noble deity, known as the Dark Emperor.\nBorn of a great nation’s auspicious omens, he cultivated the Dao upon a famed mountain.\nEnthroned to guard the northern quarter, he inaugurated the imperial house’s bright destiny.\nHis might extended across the land, quelling the demonic vapors of all domains.\nHaving manifested his submission to pure order, he is fittingly honored as the Sagely Father.\nThe primordial vastness encompasses all limits, thus uniting the embryo of primordial *qi*.\nThe flourishing of the true source ensures the perpetuation of ten thousand years of blessings and prosperity.\nWe now bestow a noble title in gratitude for his extraordinary favor.\nThe Sagely Father, Pure Joy Heavenly Lord, Radiant Perfected Great Emperor, shall be further honored as the **Inaugural Origin, Prosperous Celebration Heavenly Lord, Radiant Perfected Great Emperor**.\n\nLet the relevant authorities carry this out.\n\n*Dated the ninth month of the first year of Yan You.*\n\n---\n\nBy the grace of Heaven’s mandate, the Emperor’s sacred decree:\nOf old, a transcendent immortal descended to be born—the Dark Emperor, a single *qi* whose wondrous workings defy description, yet all directions revere his majestic might.\nHis benevolent gaze spans the cosmos, vast and ever-present.\nHis auspicious radiance shines like the sun, resplendent and enduring.\nAs the era of prosperity aligns with the mandate of heaven, his grand title shall be inscribed upon the sacred registers.\nHis mother’s virtue is uniquely exalted, complementing the father’s eternal honor, and the sagely person is thus preserved in wholeness.\nHer compassion and kindness perfectly harmonize with the imperial destiny, ever fostering its flourishing.\nThus, the **Holy Mother, Victorious Goodness Heavenly Queen, Jade Perfected Transcendent** shall be further honored as the **Compassionate Tranquility, Jade Virtue Heavenly Queen, Jade Perfected Transcendent**.\n\nLet the relevant authorities carry this out.\n\n*Dated the ninth month of the first year of Yan You.*\n\nBy the grace of Heaven and the sacred decree of the Emperor: the blessed land of Wudang has long been under the jurisdiction of the imperial domain. The numinous efficacy of the Mysterious Heaven warrants exalted honors. The coiled True Warrior of yore once guarded the former dynasty, establishing his temple among men and steeds, where the auspicious omens of tortoise and serpent were witnessed. Though his manifest responses have been duly revered in solemn sacrifices, the wellspring of his transcendence has yet to be proclaimed with fitting titles.\n\nWe therefore command the Court of Imperial Sacrifices to deliberate and enact rites of ennoblement. As the primordial is the chief of all virtues, his sagely power unites with the One Origin; as the sagely transforms into the numinous, his primordial merit equals that of the Three Sages. He succors and sustains the people with all-encompassing benevolence, sweeping the cosmos clear and securing the age with awe-inspiring might. His majesty resounds like thunder, and his illustrious name, once established, is most worthy. How could the bestowal of radiant favor be deemed unmerited?\n\nThe Dao of Heaven’s governance is called \"Emperor,\" and these four characters shall henceforth hallow the mountains and rivers. The imperial house, entrusted by Heaven’s mandate, shall enjoy ten thousand years of enduring peace for the ancestral altars. May abundant blessings attend, and may the mighty be our protector.\n\nThus, his title shall be augmented as the **Primordial Heaven, Origin Sage, Benevolent Might Highest Emperor**.\n\nLet the relevant authorities carry this out.\n\n*Dated the third month of the eighth year of Da De.*\n\nBy Heaven’s gracious mandate, the Emperor’s sacred decree:\n\nEstablish and employ the August Standard to harmonize rain and sunshine. Revering the luminous spirits to dispel the lament of drought—this is the resonance of the One Principle.\n\nYou, the Water Spirit, originate in the teachings of the Daoist school and bear the illustrious name of the Earth’s Axis. You assist this guardian of the land, grieving for the farmers and mourning the lack of rain, ensuring the harvest’s timely fruition. Your numinous power shines forth—ah!—no spirit remains unsummoned. Following the traces of the former kings and acting in accord with the people, you coil your embrace around the earth below. You shall be enfeoffed as **General of Numinous Aid**.\n\nLet the relevant authorities carry this out.\n\n*Dated the twelfth month of the second year of Tai Ding.*\n\n---\n\nBy Heaven’s gracious mandate, the Emperor’s sacred decree:\n\nThough the rites for all spirits lack written form, they differ not from those for drought and flood. The imperial chariot’s path follows a single rule—this is the one canon.\n\nYou, the Fire Spirit, originate in the teachings of the Daoist school and bear the illustrious name of the Heavenly Pass. You assist this guardian of the land, grieving for the farmers and mourning the lack of rain, ensuring the harvest’s timely fruition. Your numinous power shines forth—ah!—the two qi, by their inherent nature, respond to utmost sincerity. All spirits receive their offices; it is fitting to determine merit and confer rank. You shall be enfeoffed as **General of Numinous Radiance**.\n\nLet the relevant authorities carry this out.\n\n*Dated the twelfth month of the second year of Tai Ding.*\n\n---\n\nBy Heaven’s gracious mandate, the Emperor’s sacred decree:\n\nWe commend the lineage of those who cultivate the true, honoring those who attain the Dao. Body and spirit both wondrous, they dwell in secluded mountains and forests. Their essence and qi pure and complete, they command thunder and rain. Their integrity stands as a lofty model for humanity, a rarity indeed in this age. Desiring to bestow praise, We hereby promote and rename **Master of Mystic Harmony, Preserver of the True, and Guardian of the Elixir**, Zhang Shouqing, superintendent of the Temple of Celestial Unity, True Felicity, and Myriad Longevity on Mount Wudang, who studies the teachings of Laozi and tends the shrine of the Dark Emperor. He has ascended the towering peaks of ten thousand fathoms and constructed a grand edifice of a thousand halls. Though his works are accomplished through the agency of spirits, his conduct and ability suffice to command the people’s reverence. The tortoise and serpent often entwine in manifest form, while wolves and tigers flee at his gallop, their traces vanishing.\n\nThe pure heart being firmly established, the mysterious transformation grows ever more manifest. Those who vie to bow in homage at his lecture seats number nearly four thousand, while those who cannot secure a place within the outer rows have waited for thirty years. Recent ministers have spoken in his praise, and the Empress Dowager has issued summons. During repeated droughts, when the realm feared widespread calamity, he petitioned the Supreme Mystery and brought forth the joy of sweet rains. His merit has already nourished all things, and his person is fittingly adorned with exceptional honors. Let the brilliance of his cap and hairpin be enhanced, and the valleys and ravines rejoice in his steadfast tranquility.\n\nAs the True Felicity Marquis of the sacred precinct, he serves as the numinous shrine of the southern realm. Aiding and sheltering Our house, the Dark Warrior presides over the royal qi of the north. Only by exhausting his heart and thoughts in prayer may he hope to draw forth blessings. Reverence him! At this time, heed Our enlightened decree.\n\nLet **Zhang Shouqing** be granted the title **Perfected of Mystic Harmony and Supreme Response**, and let this be duly enacted.\n\n*First day of the tenth month, first year of the Yanyou era.*\n\n---\n\n**Preface to the *Illustrated Record of Auspicious Felicity***\n\nThe Dark Warrior, by virtue of water, governs the north. Those who rule the state truly rely upon him. Among the regions under his influence, Mount Wudang stands preeminent. His resplendent efficacy in destiny and his virtue in nurturing all things have shone through the ages, far surpassing what earlier *Records of the Divine Manifestation* could enumerate.\n\nWhen the august Yuan dynasty first established its foundation in the northern lands, its virtuous destiny aligned with the heavens, and all under heaven harmonized. Thus, at the very inception of its pacification and the founding of its merit—during the depths of winter’s frozen stillness—the golden and aqueous signs appeared. Auspicious omens unfolded, presaging the nation’s prosperity in ways unheard of before. Yet no record had been transmitted.\n\nZhang Dongyuan, superintendent of the True Felicity Palace on the mountain, taking the recent golden and aqueous events as his starting point, revived the old *Records of the Divine Manifestation* and compiled them into the *Illustrated Record of Auspicious Felicity*. The illustrations are elucidated with text, and the work is carved onto printing blocks to circulate in the world, that it may exalt the grand enterprise and illuminate the divine majesty. Though the illustrations may not exhaust all events, nor the events all traditions, they reveal the celestial mandate’s fulfillment and align the Dark Warrior with the invincible. Thus, the transmission of this record is not merely a blessing for this Dao.\n\n*Summer of the renzi year of the Huangqing era, written by the Fifth Celestial Master Zhang Yucai at the Hall of Venerating the Perfected in Dadu.*\n\n---\n\nThe numinosity of the Dark Warrior is ancient indeed. Mount Wudang, where immortals once cultivated and ascended, has long been resplendent with wondrous manifestations, unmatched by other sacred sites. When the sagely dynasty unified the realm, during the *zhiyuan* era, the tortoise and serpent appeared in winter at the Gaoliang River. Thereupon, the Great Luminous Response Palace was built on that site to mark the marvel. Now, Zhang Dongyuan, tracing the origins of the divine, has composed the *Illustrated Record of Auspicious Felicity* to ensure its transmission to distant posterity.\n\nThe divine and the human depend upon one another. Without the divine, how could humanity revere? Without humanity, how could the divine be exalted and its glory made manifest? To proclaim this to all under heaven—is this record not far from trivial?\n\n*Summer of the first year of the Yanyou era, respectfully inscribed by Wu Jinjie, Hereditary Master of the Five Mysteries Teaching.*\n\n---\n\nThe **Palace of Celestial Unity and True Felicity** and the **Yuanhe Relocation Bureau** both originate from the Qingwei tradition. Huang Jun of Leizhou transmitted it to the Perfected of Hidden Harmony, Nan Jun. Zhang Dongyuan received the Qingwei teachings and thus named his palace accordingly. He further selected dozens of illustrations from the *Records of the Divine Manifestation*, appending the auspicious tortoise-and-serpent omens from the Gaoliang River during the sagely dynasty, and titled the work *Illustrated Record of Auspicious Felicity*. The contemporary Celestial Master and various venerable masters have already expounded upon it in detail—what need is there for my superfluous words?\n\nMoreover, the exalted Perfected in heaven only assist those of virtue. When Emperor Shizu of the present dynasty unified the realm, he governed with benevolence, and the four barbarians and eight wilds all submitted without exception. The myriad people and countless multitudes all rejoiced in harmony. Thus, auspicious signs arrived daily, and numinous portents gathered like clouds. Heaven and humanity converged—truly a once-in-ten-thousand-generations convergence.\n\nDongyuan has elucidated these portents, making them known to all under heaven for eternal transmission. This is indeed worthy of esteem, and thus I write this preface.\n\n*First day of autumn in the first year of the Huangqing era, respectfully inscribed by Zhang Zhongshou, Hanlin Academician, Grand Master for Glorious Happiness, Drafter of Imperial Edicts, and Compiler of the National History.*\n\n---\n\nThe *Book of Changes* states: *\"Heaven’s one generates water; earth’s six completes it.\"* The number one is the beginning of all numbers. Water is the origin of all formed things. The generating numbers are odd; the completing numbers are even. In position, they correspond to the north. \"North\" means \"back,\" and the north symbolizes the human back, hence the North Star emerges as the highest point in the heavens. The character for \"north\" (*bei*) depicts two people back-to-back, turning away from the sun. It reaches its extreme at the winter solstice, then begins anew. In the hexagrams, it is *Kan* (☵), the water trigram. The character for \"water\" (*shui*) graphically resembles the *Kan* hexagram. East and west diverge as the four virtues of *Qian* (☰) and *Kun* (☷): \"firmness\" and \"yielding.\" The doubled *zhen* (貞貞) signifies \"steadfast correctness.\"\n\nThe two celestial principles reside in the Dipper. The seven lunar lodges of the north—Oxherd, Weaver Girl, Emptiness, Rooftop, House, Wall—form the constellation of the Dark Warrior. The Dark Warrior is the tortoise and serpent. The Azure Dragon, White Tiger, and Vermilion Bird are each single creatures, but the Dark Warrior alone comprises two. It is not called \"tortoise and serpent\" but \"Dark Warrior\" because \"dark\" (*xuan*) is the color of red-black, which the tortoise and serpent embody. Their scales and shells symbolize martiality (*wu*), hence the name Dark Warrior.\n\nThe Dark Warrior’s divine descent began during the reign of Emperor Zhenzong of the Song, when shrines were established throughout the realm. The rise of the august Yuan truly began in the north. As the qi of the north was destined to prevail, the north’s deity descended first, foretelling events. Heaven had already proclaimed it.\n\nMount Wudang lies in the southwest, towering and vast. The Dark Warrior’s spirit resides there. Clad in black robes, hair unbound, wielding a sword and treading upon the tortoise and serpent, he is often seen even to this day. Zhang Dongyuan, master of the Palace of Celestial Unity and True Felicity, is steadfast in his devotion to the Dao, resolute and unyielding. The Empress Dowager, having heard of him, summoned him to court.\n\nAt that time, the capital suffered a drought—no rain had fallen from the ninth month of the previous year until the third month. The Son of Heaven was deeply concerned. The Empress Dowager dispatched an emissary bearing incense to accompany Master Zhang in prayer, and rain fell at once.\n\nMaster Zhang selected the day and hour for the ritual, and soon after, rain indeed fell for several days without cease, soaking the land far and near. The Empress Dowager bestowed upon him generous gifts, which he distributed entirely among his followers, keeping not a single coin for himself. Such conduct is truly rare—one might say unparalleled—and it is no wonder the gods favored him.\n\nMaster Zhang presented the engraved *Illustration of Auspicious Felicity* and entreated me to compose a preface. I have recounted what I have heard and recorded it here. Summer, the twenty-second day of the fourth month, the second year of the Huangqing era. Preface by Zhao Mengfu, Grand Master for Palace Attendance and Academician of the Jixian Institute.\n\nThe number one is the pure *qi* of Heaven and the generative number of Water. Laozi said: \"The Dao gives birth to the One.\" The Palace of True Felicity is named *Tianyi* (\"Heavenly One\"), for it is the source from which the Dao’s origin flows. The Purple Empyrean’s Heavenly Pillar stands towering and majestic—who but the Dark Warrior could be its guardian? Master Zhang of Dongyuan, through his vast vow and steadfast power, opened this mountain to the cosmos. His disciples, Tang Zhongyi and Liu Zhonghe, expanded upon his teachings and created the *Illustration of Auspicious Felicity*, depicting the events of his life. The fruits of their antiquarian diligence are gathered in this book, all verifiable and trustworthy. May it circulate throughout the land and endure for a hundred generations, so that those who ascend in the study of the Dao may behold it with their eyes and grasp it in their hearts. Through the manifest, they may awaken to the mystery of the soundless. The unfathomable spirit and boundless transformations, though myriad in number, are but the subtlety of the One within the heart. The *Book of Changes* speaks of the four virtues of the *yuan* (\"origin\"), yet *yuan* is also the One. *Qian* is called *heng* (\"prosperity\"), the convergence of auspiciousness. *Kun* is called *ji* (\"accumulation\"), the celebration of goodness. All people and all things share the One. The Supreme Ultimate receives this pure *qi* and this generative number, embracing and accumulating it to preserve the truth of the Heavenly One. Vast and profound, it encompasses Heaven and Earth. The *Way of Auspicious Felicity* is inexhaustible in power, and its blessings and virtue are likewise boundless—this is why the *Illustration of Auspicious Felicity* was created. Let the viewer remain unwavering in heart, for the boundless abides above, truly witnessing all. Supreme indeed!\n\nOn the *Bailu* (\"White Dew\") solar term of the *xinhai* year, Zhao Zha of Yunxi Naian Daoist Temple respectfully inscribed this.\n\nThe height of Heaven is beyond knowing, yet we may observe the forms of the sun, moon, and stars. The depth of Earth is beyond measure, yet we may examine the shapes of mountains, rivers, and plants. The wonder of the gods is beyond fathoming, yet we may contemplate their near-at-hand responses and transformations. This is the Dao, and Master Zhang of Dongyuan understood it well. His creation of the *Illustration of Auspicious Felicity of the Dark Warrior* attests to this.\n\nHe declared: \"Mount Wudang comprises seventy-two peaks, each wondrous and extraordinary. Among them, Purple Empyrean Peak stands as the central peak of the seventy-two. Thus, its ability to summon clouds and rain and manifest numinous marvels is only fitting. Moreover, its divine ruler is called the Dark Warrior. In Heaven, he is the *Xu* and *Wei* constellations; on Earth, he embodies the spirit of the tortoise and serpent. Among the Five Phases, he is Water; among the Five Colors, he is black; and his number is One. The One as One, though numerically expressed as one, is the origin of creation. When divided, it becomes numbers, yet when spoken of, it remains the One—the source from which ten, a hundred, a thousand, and ten thousand arise. Thus, its dwelling at the center of Earth and its movement through the One of Heaven—is this not what the world calls the most divine?\"\n\nMaster Dongyuan said: \"Beyond this, I cannot express in words. Below this, I may yet speak of it in part.\" Thereupon, with his disciples Tang Zhongyi and Liu Zhonghe, he selected the most wondrous and striking phenomena, illustrated them, and transmitted them, so that all who behold them may be stirred in heart and astonished in sight, thereby awakening reverence, awe, and admiration.\n\nI, as a successor to the Grand Master of the Mysterious Teachings, recognize Master Dongyuan’s contributions to Mount Wudang. He resided on Wudang for over twenty years, enduring hardship and laboring diligently. Scaling perilous heights and bridging treacherous paths, he planned and constructed palaces to enshrine the incense offerings, transforming the desolate mountains and secluded valleys into a splendor rivaling the grandest cities. How could one fathom the depth of Master Dongyuan’s vision and foresight? Those who aided him in this endeavor were fellow scholars of the rocky crags. As I was serving in the capital near Wudang, I was able to learn of these matters in detail.\n\nWritten on the tenth day of the first month of the first year of the Huangqing era by Yu Ji.\n\nThe god of the *Kan* palace is the Dark Warrior, born at the inception of the Supreme Ultimate and corresponding to the number of the Heavenly One. He roams the eight directions, his numinous transformations beyond measure. Through him, the myriad things are benefited, and the common people are blessed—his virtue is all-pervading. Through the ages, he has been revered with utmost devotion. Mount Wudang is the abode of those who dwell in the world to cultivate the truth. Beneath its soaring canopy rise seventy-two peaks, fiercely guarded by spirits and gods, rarely visited by mortals. Among them, the Heavenly Pillar of Purple Empyrean Peak stands most majestic.\n\nMaster Zhang of Dongyuan opened this mountain, constructing halls and pavilions of grand and magnificent scale, unparalleled in ancient times. After twenty-seven years, the work was completed—could any but the most devoted cultivator have achieved this? His eminent disciples, Tang Zhongyi and Liu Zhonghe, carried forward their master’s aspirations. Recognizing that the true records of the Dark Emperor had not been widely disseminated, they created the *Illustration of Auspicious Felicity*, depicting the events and narrating the details from beginning to end with meticulous care. They commissioned artisans to carve the woodblocks and transmit it to the world, so that viewers might grasp the events through the images and perceive the numinous through the events. Thus, all may awaken to sincerity and reverence, strengthening their resolve toward goodness and advancing toward the Dao.\n\nLin Zhongde, Director of the Central Administration, recounted these matters to me and requested a preface. I commend Master Dongyuan’s steadfast devotion to the Dao and the diligent intent of Zhongyi and Zhonghe. Surely, the Mysterious Wind will flourish greatly.\n\nThus, the book is completed.\n\n*Da De* era, first month of winter in the *xinhai* year, auspiciously inscribed by Bao Siyi.\n\nHere ends the *Record of the Divine Marvels of the Mysterious Heavenly Emperor’s Manifestation of Sageliness*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "玄天上帝启圣灵异录 经名：玄天上帝启圣灵异录。 元徐世隆等撰。 一卷。 底本出处：《正统道藏》洞神部记传类。 元创建真武庙灵异记 翰林侍讲学士兼户部侍郎徐世隆撰 皇帝践祚之十年，奠新大邑於燕，落成有日矣。 是岁冬十二月庚寅，有神蛇见於城西高梁河水中，其色青，首耀金彩，观者惊异。 盘香延召，蜿蜓就享而去。 翼日辛卯，复有灵龟出游，背纹金错，祥光绚烂，回旋者久之。 夫隆冬闭藏之候也，龟蛇潜垫之类也，出以是时，其为神物也，昭昭矣。 既而，事传禁掖皇后，遣中使询於众，咸以为玄武神应。 於是，有旨以明年二月甲戌，即所现之地构祠焉，昭灵既也。 谨按文耀钩云：北宫黑帝，其精玄武，皇北方之神也。 我国家肇基朔方，盛德在水，今天子观四方之极，建邦设都，属水行方盛之月，而神适降，所以延洪休昌景命，开万世太平之业者，此其兆欤。 呜呼，庙既新矣，神其礼止。 自兹已往，俾雨旸时若，年谷屡丰，跻民仁寿之域，皇我圣后辅佐圣天子，敬恭神明之意也。 世隆承乏文职，获睹兹瑞，敢迹其实，为之记云。 至元七年二月　　日。 元创建昭应宫碑 史部尚书臣徐世隆奉勑撰 国家肇基朔方，以神武定天下，列圣相承。 际每之外，罔不臣妄。 主上诞膺天命，嗣守大统，稽考典章，用润色鸿业，建宗庙，修礼乐，立官制，文物焕然为之一新。 惟是宫殿未备，群臣请定都於燕。 上可其奏，乃以至元三年，新都于故城之北。 越六年十二月庚寅，城之西，高梁河之南金水中，有蛇出焉，长尺余，首耀金彩，背负青章。 见者异之，咸奉香迎拜，蛇驯而近人，引颈顾陌，蜿蜓入盘嗅香，久之而去。 明日，复有神龟，玄文绿质，游泳岸曲，若出而效灵者。 众以为龟蛇天地之关轴，当隆冬闭藏之候，鳞介所垫，今迭出互见，必有由而然。 太府监玉牒尺不花，被中官命监工役西郊，适睹此事，遂入奏闻皇后，使访问博物大臣，以玄武神见为对。 遂出内帑物，俾即其所见之地构祠焉。 特遣玉牒尺不花尼原缺箴役，以行工部尚书段天佑，鸠工眠师，复绘图以进。 皇帝若曰：神圣能阴庇吾民，可不吉镯祀享，以答灵既乎。 乃诏大其楝宇而为之。",
      "translated_text": "**Record of Divine Marvels Manifested by the Dark Heavenly Emperor**\n\n**Title:** *Record of Divine Marvels Manifested by the Dark Heavenly Emperor*\nCompiled by Xu Shilong et al. of the Yuan dynasty. One fascicle.\nSource text: *Daoist Canon of the Zhengtong Era*, \"Records and Biographies\" section of the *Dongshen* Division.\n\n---\n\n### *Record of Marvels at the Yuan Dynasty’s Founding of the Zhenwu Temple*\nComposed by Xu Shilong, Hanlin Academician and Lecturer, concurrently Vice Minister of the Ministry of Revenue\n\nIn the tenth year of the emperor’s reign, the new great capital was established in Yan, its completion imminent. In the twelfth month of that winter, on the day *gengyin*, a divine serpent appeared in the waters of Gaoliang River west of the city. Its body was azure, its head radiant with golden splendor, astonishing all who beheld it. Incense was burned in offering, and the serpent coiled forward to partake before departing. The following day, *xinmao*, a sacred tortoise emerged, its shell inscribed with golden patterns, its auspicious light resplendent, lingering for a long while. Now, this was the season of winter’s closure and concealment, when tortoises and serpents lie dormant—yet they appeared at this time, clearly manifesting as divine beings.\n\nThereafter, word reached the inner palace of the empress, who dispatched an imperial envoy to inquire among the people. All affirmed that this was the manifestation of the Dark Warrior deity. Thus, an edict was issued to construct a shrine at the site of the apparition in the second month of the following year, on the day *jiaxu*, to honor the deity’s numinous presence.\n\nAccording to the *Wenyao Gou*: \"The Black Emperor of the Northern Palace, whose essence is the Dark Warrior, is the divine sovereign of the northern direction.\" Our dynasty’s foundations were laid in the northern lands, its flourishing virtue aligned with the Water phase. Now, as the Son of Heaven surveys the four quarters and establishes the capital, in this month when the Water phase prevails, the deity has deigned to descend. This portends the extension of our august fortune, the flourishing of our mandate, and the inauguration of a realm of eternal peace. Ah! The temple is newly built, and the deity has graciously accepted our veneration. Henceforth, may wind and rain arrive in due season, may the harvests be bountiful, and may the people ascend to the realm of benevolence and longevity. May our sagacious empress assist the sacred Son of Heaven in revering the divine will.\n\nI, Shilong, unworthy in my literary office, have been privileged to witness this auspicious sign. I dare not conceal the truth and thus record it here.\n*Written on a day in the second month of the seventh year of the Zhiyuan era.*\n\n---\n\n### *Stele Inscription for the Founding of the Zhaoying Palace*\nComposed by Minister of the Ministry of Rites, Xu Shilong, by imperial decree\n\nOur dynasty’s foundations were laid in the northern lands, where the martial might of the gods pacified the realm. The successive sagely emperors extended their dominion, and none beyond our borders dared defy their rule. The present emperor, born to receive Heaven’s mandate, has inherited the great throne. He has examined the classics and canons, embellishing the grand enterprise: establishing ancestral temples, refining rites and music, instituting official systems—all affairs of state have been renewed with splendor.\n\nYet the palaces remained incomplete, and the ministers petitioned to establish the capital in Yan. The emperor approved, and in the third year of the Zhiyuan era, a new capital was founded north of the old city. In the twelfth month of the sixth year, on the day *gengyin*, west of the city, in the waters of Gaoliang River south of Jinshui, a serpent emerged. It measured over a foot in length, its head gleaming with golden radiance, its back adorned with azure markings. Those who saw it marveled, offering incense and bowing in reverence. The serpent, docile and unafraid, approached, craning its neck to gaze at the people before coiling into the incense burner, lingering awhile before departing.\n\nThe next day, a divine tortoise appeared, its shell inscribed with dark patterns upon a verdant ground, swimming along the riverbank as if manifesting its numinous power. The people surmised that the tortoise and serpent were the pivots of Heaven and Earth. In this season of winter’s closure, when scaled and shelled creatures lie concealed, their successive appearances must signify something profound. Yu Diechibuhua, Supervisor of the Imperial Treasury, was overseeing construction in the western suburbs when he witnessed the event. He reported it to the empress, who consulted learned ministers. All affirmed that this was the manifestation of the Dark Warrior deity. Thereupon, funds from the imperial treasury were allocated to construct a shrine at the site of the apparition. Yu Diechibuhua was specially dispatched to oversee the project, with Minister of Works Duan Tianyou assembling artisans and craftsmen. A painted depiction was also presented to the throne.\n\nThe emperor declared: \"If the divine sage can secretly protect our people, how can we fail to offer solemn sacrifices in gratitude for its numinous favor?\" Thus, an edict was issued to expand the shrine’s halls and pavilions.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 848,
      "start_sentence": 0,
      "end_sentence": 35,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.59141445159912,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\玄天上帝启圣灵异录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "宫既成，赐名日昭应。 仍动词臣文于石，臣世隆谨按汉张衡《思玄赋》云：玄武缩于壳中，腾蛇蜿而自斜。 盖蛇龙类阳也，上应乎乾纲。 龟玄物，阴也，下应乎坤轴。 惟阴阳交和，而神应斯至。 今主上圣德，神功格于上下。 沉几开阖，旋乾转坤，其厉精为治，综核名实，有汉宣帝之则焉。 其创制立法，移风易俗，有魏孝文之度焉。 至若爱民如子，礼贤如宾，舍己从人，以辞色假借臣下导之，使言则唐之文皇，不啻过也。 加以敬戴不息，肃恭神明，是宜上帝降灵，以彰明德而昌景运，不其伟欤。 臣世隆敢百拜稽首而献铭，铭曰：玄武维星，黑帝之精。 其来有征，其占有成。 其符，龙德之馨。",
      "translated_text": "The palace completed, it was bestowed the name \"Zhaoying.\" The emperor then commanded his ministers to inscribe words upon stone. Minister Shen Shilong respectfully noted: As Zhang Heng of the Han wrote in his *Fu on Contemplating the Mysteries*, \"The Dark Warrior coils within its shell; the soaring serpent winds aslant.\" For the serpent and dragon are yang in kind, corresponding above to the Heavenly Net. The tortoise is a creature of mystery, yin in nature, aligning below with the Earthly Axis. Only when yin and yang harmonize does the divine response thus arrive.\n\nNow our sovereign’s sagely virtue and numinous power reach both high and low. Discerning the subtle and governing the manifest, he revolves Heaven and turns Earth. In his diligent governance, his synthesis of names and realities, he follows the model of Emperor Xuan of Han. In his creation of institutions and laws, his transformation of customs, he possesses the measure of Emperor Xiaowen of Wei. Moreover, in loving the people as his children, honoring the worthy as guests, setting aside his own will to follow others, and guiding his ministers with gentle countenance and words—he surpasses even Emperor Taizong of Tang. With unceasing reverence and solemn awe for the divine, it is fitting that the Supreme August One should send down his spirit, to make manifest this illustrious virtue and prosper the grand destiny. How magnificent indeed!\n\nMinister Shen Shilong dares to bow a hundred times and kowtow in offering this inscription. The inscription reads:\n\nThe Dark Warrior, star of mystery,\nEssence of the Black Emperor.\nIts advent bears signs,\nIts portents bear fruit.\nIts omen—fragrance of the Dragon’s virtue.",
      "overlap_context": "mperial treasury were allocated to construct a shrine at the site of the apparition. Yu Diechibuhua was specially dispatched to oversee the project, with Minister of Works Duan Tianyou assembling artisans and craftsmen. A painted depiction was also presented to the throne.\n\nThe emperor declared: \"If the divine sage can secretly protect our people, how can we fail to offer solemn sacrifices in gratitude for its numinous favor?\" Thus, an edict was issued to expand the shrine’s halls and pavilions.",
      "start_char": 848,
      "end_char": 1110,
      "start_sentence": 36,
      "end_sentence": 48,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.564209699630737,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\玄天上帝启圣灵异录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "皇帝曰：嘻，神格是饮，神保是承，匪宫匪庭，曷以将时享之。 诚乃隆其楝，乃高其楹，门寝靖深，神之攸宁。 于以奠水德之灵，其水惟金，其岛惟琼，神临其问，壮帝之京。 以永天子，万年之祯。 至元七年九月　　日。 元创建昭应宫碑 翰林学士知制诰兼修国史臣王密奉勑撰 圣人有天下，莫不以神道设教。 皇帝龙飞尊礼，百神咸秩。 无文皇后，躬亲内政，德协宸极。 凡所以幽赞神明，兴崇祀典者，实勤备焉。 谨按有司所具事迹，维至元六年，都邑肇新，中宫谕旨太府，监度西郊高梁河乡隙地，以居新附之民，庐舍既营，市肆亦列。 乃以季冬十有九日庚寅，致祭于金水之神。 时方盛冬，垫虫坏户，动物局踏，俄有祥光照耀，附水西来，迎而视之，有蛇其长尺许，背青章而首金色。 众见其灵异，骇而聚观。 太府监玉牒尺不花，乃率其属，焚香罗拜，承之以盘，蛇蜿蜓来登，延颈四顾，若饮若享，移晷而去。 明日，复有神龟浮于波面，背负玄文，金碧集错，回旋泛泳，引首向岸者久之。 观者咨嗟叹息，以为昔所未见。 玉牒尺不花，以其事奏闻皇后，乃遣问诸博物大臣，其对以为龟蛇黑帝之精，季冬水王之月，以是月而有是祥，其玄武之灵验欤。 国家肇基朔方，奄有四海，今京邑告成，而是瑞来格，神理不言，应以象类，盖昭昭矣。 於是皇后分禁中供用之物，命太府监玉牒尺不花，即於所见之地，兴建庙貌，以奉香火。 仍命行工部尚书段天佑一同商度，给其工役。 落成之日，赐其额日昭应宫。 重门宏敞，阀殿深严，单飞游题，金彩溢日，遂为京畿伟观。 昔周室方兴，大任大姒，以思齐之德，流肃雍之化。 时有驺虞麟趾之瑞，形于篇什，播之咏歌。 今皇后德伴任姒，化并西周，是宜神龟灵虺，见瑞呈祥，与绉虞麟趾之应，盖异世而同符矣。 噫，明者见微而知着，睹物而谕理，皇后懿鉴渊衷，沉几先物，出捐金帛，修崇宫室，非资燕暇之安，非以奉游观之乐，盖将昭扬神麻，绍隆景运，辅成圣天子神道设教之意耳。 臣盘既书其事于后，拜手稽首，击以铭辞，铭曰：德有感，神无方。 灵何符，彰圣皇。 彰维何，冬季月。",
      "translated_text": "The Emperor proclaimed: \"Ah! The divine presence is received, the sacred essence is upheld. Without palace nor courtyard, how shall we offer timely sacrifices? Thus, we elevate the beams, raise the pillars, and deepen the tranquility of gates and chambers—where the spirits find repose. Here we enshrine the numen of the Water Virtue: its waters are like metal, its isle like jade. The divine descends to inquire, magnifying the imperial capital. May it eternally bless the Son of Heaven with ten thousand years of felicity.\"\n\nDated the ninth month of the seventh year of Zhiyuan.\n\n*The Stele of the Founding of the Zhao Ying Palace*\nComposed by Minister Wang Mi, Academician of the Hanlin Academy, Drafter of Edicts, and Compiler of the National History, by imperial command.\n\nSince ancient times, those who have ruled all under heaven have invariably established teachings through the divine Dao. The Emperor, ascending the throne with reverence, has honored all spirits in due order. The Empress, the August Mother without peer, personally administered the inner court, her virtue harmonizing with the imperial destiny. All that she undertook to mystically assist the divine and exalt the rituals of sacrifice was executed with diligent thoroughness.\n\nAccording to the records submitted by the relevant offices: In the sixth year of Zhiyuan, as the capital was newly established, the Empress issued a decree to the Directorate of the Imperial Household, instructing them to survey the vacant land by the Gaoliang River in the western suburbs to settle the newly incorporated populace. Once dwellings were built and markets arranged, on the nineteenth day of the twelfth lunar month—the gengyin day—a sacrifice was offered to the spirit of the Golden Waters. It was the height of winter, when insects burrow and creatures huddle, yet suddenly a propitious radiance shone forth, approaching from the west along the water. Gazing upon it, they beheld a serpent, roughly a foot in length, its back adorned with azure markings and its head gleaming gold. The assembled crowd, astonished by its numinous strangeness, gathered in awe. Yudie Chibuhua, Supervisor of the Directorate of the Imperial Household, led his subordinates in burning incense and prostrating in reverence. They presented a tray, upon which the serpent coiled and ascended, stretching its neck to gaze about as if drinking or partaking in the offering, before departing after some time.\n\nThe following day, a divine tortoise emerged upon the waves, its back inscribed with dark patterns interwoven with gold and azure, circling and swimming with its head turned toward the shore for a long while. The onlookers marveled and sighed, deeming it a sight unseen in former times. Yudie Chibuhua reported the matter to the Empress, who then consulted the ministers versed in all things. They replied that the tortoise and serpent were the essence of the Black Emperor, and that the twelfth month, when water reigns, was the very time for such an auspicious sign—surely a manifestation of the numen of the Dark Warrior. The dynasty’s foundations were laid in the northern lands, and now, with the completion of the capital, this felicitous omen had arrived. Though the divine principle speaks not, it responds through images and categories—how luminously clear!\n\nThereupon, the Empress allocated items from the inner palace’s provisions and commanded Yudie Chibuhua of the Directorate of the Imperial Household to construct a temple at the site of the apparition to enshrine the spirit. She further ordered Minister Duan Tianyou of the Ministry of Works to collaborate in planning and providing labor. Upon its completion, she bestowed upon it the name *Zhao Ying Palace*. Its towering gates and spacious halls, its solemn and profound main sanctuary, its soaring eaves and ornate brackets—all aglow with golden splendor—became a magnificent sight in the capital’s environs.\n\nIn ancient times, when the Zhou house was rising, the virtuous consorts Tairen and Taisi fostered a culture of solemn harmony, their influence celebrated in odes and hymns through the auspicious omens of the *zouyu* and *linzhi*. Now, the Empress’s virtue rivals that of Tairen and Taisi, and her transformative influence parallels that of the Western Zhou. Thus, the divine tortoise and sacred serpent have appeared in auspicious manifestation—a sign that, though separated by eras, resonates with the same portent as the *zouyu* and *linzhi*.\n\nAh! The perspicacious perceive the subtle and know the manifest; they behold things and grasp their principles. The Empress, with her profound and sagacious insight, discerns the subtle before it takes form. She has expended gold and silk to build and exalt this palace—not for leisurely repose, nor for the pleasure of sightseeing, but to glorify the divine majesty, perpetuate the grand destiny, and fulfill the sacred intent of the Son of Heaven in establishing teachings through the divine Dao.\n\nHaving recorded these events, your servant bows his head to the ground and offers this inscription. The inscription reads:\n\nVirtue moves the heart,\nThe divine knows no bounds.\nWhat sign does the numen bear?\nIt proclaims the sagely Emperor.\nWhat does it proclaim?\nThe twelfth month of winter.",
      "overlap_context": "ng. With unceasing reverence and solemn awe for the divine, it is fitting that the Supreme August One should send down his spirit, to make manifest this illustrious virtue and prosper the grand destiny. How magnificent indeed!\n\nMinister Shen Shilong dares to bow a hundred times and kowtow in offering this inscription. The inscription reads:\n\nThe Dark Warrior, star of mystery,\nEssence of the Black Emperor.\nIts advent bears signs,\nIts portents bear fruit.\nIts omen—fragrance of the Dragon’s virtue.",
      "start_char": 1110,
      "end_char": 1931,
      "start_sentence": 49,
      "end_sentence": 79,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.522159337997437,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\玄天上帝启圣灵异录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "蛇蜿蜓，龟奋垫。 哲人占，黑帝精。 皇祚安，天下平。 宫于河，后有旨。 万斯年，福天子。 天子圣，后相之。 嘻万方，征训词。 至元七年九月　　日。 元赐武当山大天一真庆万寿宫碑 翰林学士知制语兼修国史臣程巨夫奉勑撰 皇庆元年春三月，京师不雨，徧走群望不雨，诏武当道士张守清，梼而雨。 明年春不雨，祷而雨。 夏又不雨，又祷又雨。 既沾既渥，仍大有秋雨。 宫大悦。 初均房之问，有山曰太和，又日仙室，以玄武神居之，名武当。 踞地八百里，峰七十有二，最高日紫霄之峰，峰之最胜者，曰南岩。 前有洞天二，日太安皇崖之天，日显定极风之天，上出浮云，下临绝涧，猥啼乌嗥，豺虎所家，人可投足者，仅寻文许。 道家言，龙汉之年，虚危之精降而为人，修道此山，道成，乘龙天飞，是为玄武之神。 至唐贞观益显，天下尊祀。 宋理宗时，诏道士刘真人作宫南岩。 不克，汉束异人鲁大宥隐居是，日草衣菲食，四十余年，救灾捍患，预知祸福，时人神之。 天兵被襄汉去，渡河访道全真，西绝沃陇，北瑜阴山，至元十二年归，与道士汪真常等，修复五龙紫霄坛宇，独结茅南岩，或请作宫庭，曰：非尔所及也，其人将至矣。 二十一年秋九月，师自峡州来，年三十有一，愿为弟子。 大宥欣然日：吾待子久矣。 即授道要。 明年春正月，大宥仙去。 师躬执阱衅，垦山凿谷，种粟为食。 维帅其徒，剪荟翳，驱鸟兽通道，东自山趾绞口，七十里至紫霄宫，五里至南岩。 南岩北下，三十里至五龙宫，又四十里抵山趾蒿口。 岁三月三日，相传神始降之辰，士女会者数万，金帛之施，云委川赴。 乃构虚夷峻，挞木穹谷。 刊在穷压，即岩为宫。 广殿大庭，高堂飞阁。 庖库寮次，既严且备。 炫晃丹碧，缪辐云汉。 像设端伟，钟鼓壮亮。 引以石径，荫以杉松。 积工累资巨万，计历二十余载乃成。 垦田数百顷，养众万指。 至大三年，今上皇帝，仪天兴圣。 慈仁昭懿寿元皇太后，闻师道行，遣使命建金录醮，征至阙，及祷雨辄应。 赐宫额日天一真庆万寿宫。 提点甲乙住持。 制加神父启元隆庆天君明真大帝，神母慈宁玉德天后琼真上仙，赐师号体玄妙应大和真人。 延佑改元春二月，大司徒臣罗源，奉皇太后旨命，乘驷奉香币，还山致祭。 冬十月，集贤大学士臣陈颢，请加赐宫额，日大天一真庆万寿宫。 命翰林学士承旨，臣刘赓书之。 申命翰林承旨，臣巨夫撰碑文，集贤学士臣孟俯书丹，中书省参知政事臣世延篆额。 臣巨夫窃惟圣天子原清静之本，躬垂拱化，父天母地，怀. 柔百神，陶成万类，子育兆姓，宵衣吁食，期属于治，可谓至德也。 已师以云柄霞举之倡，而能振道濯德，焦心苦志，奋树堂坛，以承天休，亦可谓豪杰之士矣。 师阅疏果毅，方严质茂，虽大祠祭，不待沐－浴更衣，所感必应。 虽身被显宠，如始入山，其有道者耶。 若神之德，广大混茫，变化无方，谓则宿所，锺诅不信然．。 臣巨夫谨拜手稽首，而献诗曰： 翼斡之墟均房间，白云峨峨武当山。 根盘千里阻且艰，七十二峰罗烟鬓。 帝遣玄武驱神奸，被发长剑衣黫黫。 穹龟修蛇猛且间，乘云而来御风还。 跋余望之杳莫攀，真人学道镌坚顽。 飞上千仞诛榛菅，斡旋天枢启天关。",
      "translated_text": "The serpent coils and twists,\nThe tortoise rises from its mat.\nThe sage interprets the omen—\nThe essence of the Dark Emperor.\nThe imperial destiny is secure,\nThe realm at peace.\nThe palace stands by the river,\nBy the Empress’s decree.\nFor ten thousand years,\nBlessings upon the Son of Heaven.\nThe Son of Heaven is sagely,\nThe Empress assists him.\nAh, all under heaven,\nBear witness to these words of instruction.\n\n*Dated the ninth month of the seventh year of the Zhiyuan era.*\n\n---\n\n*The Stele of the Great Heavenly One True Celebration Longevity Palace at Mount Wudang, bestowed by the Yuan*\n\nComposed by Minister Cheng Jufu, Academician of the Hanlin Academy, Drafter of Edicts, and Compiler of the National History, by imperial command.\n\nIn the spring of the first year of the Huangqing era, the capital suffered drought. Prayers were offered at all sacred sites, yet no rain came. An edict was issued to Zhang Shouqing, a Daoist of Wudang, who prayed and brought rain. The following spring, drought struck again, and his prayers again summoned rain. In summer, drought returned, and once more, his prayers brought rain. The land was thoroughly drenched, and the autumn harvest was abundant. The palace rejoiced.\n\nIn the region between Jun and Fang, there stands a mountain called Taihe, also known as Xianshi, where the Dark Warrior spirit resides, hence the name Wudang. It spans eight hundred *li*, with seventy-two peaks, the highest being Zixiao Peak. The most sublime of these is Nan Rock. Before it lie two grotto heavens: Tai’an Huangya Heaven and Xianding Ji Feng Heaven. Above, floating clouds drift; below, sheer ravines plunge. Apes cry and crows caw, while jackals and tigers make their dens. Few places allow a foothold, barely a foot’s width.\n\nThe Daoists say that in the Longhan era, the essence of Xu and Wei descended as a man, cultivating the Dao upon this mountain. Upon attaining the Way, he ascended to heaven riding a dragon—this is the Dark Warrior spirit. By the Tang dynasty’s Zhenguan era, his fame grew, and all under heaven revered and worshipped him. During the reign of Emperor Lizong of the Song, an edict commanded the Daoist Master Liu to build a palace at Nan Rock, but the task was not completed.\n\nLater, a reclusive man from the east, Lu Dayou, dwelled here. Clad in coarse garments and subsisting on meager fare, he lived thus for over forty years, rescuing the distressed and warding off calamities. He foresaw fortune and misfortune, and the people revered him as a spirit. When the imperial troops passed through Xiang and Han and crossed the river in search of the Quanzhen Dao, he journeyed west beyond the fertile lands of Long and north to the Yin Mountains. In the twelfth year of the Zhiyuan era, he returned and, with Daoist Wang Zhenchang and others, restored the altars and halls of Wulong and Zixiao. Alone, he built a thatched hut at Nan Rock. When asked to construct a palace, he replied, “This is not within your capacity. The one destined for this task is yet to come.”\n\nIn the autumn of the twenty-first year, in the ninth month, a master arrived from Xia Prefecture. At thirty-one years of age, he wished to become a disciple. Dayou rejoiced, saying, “I have awaited you for a long time.” He immediately transmitted the essentials of the Dao.\n\nIn the first month of the following spring, Dayou ascended as an immortal. The master personally undertook the labor, clearing the mountains and carving valleys, planting millet for sustenance. Leading his disciples, he cut through dense undergrowth, drove away birds and beasts, and opened a path. From the mountain’s base at Jiaokou, a seventy-*li* journey led to Zixiao Palace, and five *li* further to Nan Rock. Descending north from Nan Rock, thirty *li* brought one to Wulong Palace, and another forty *li* to the mountain’s base at Haokou.\n\nOn the third day of the third month, the day when the spirit was said to first descend, tens of thousands of men and women gathered. Offerings of gold and silk poured forth like clouds and rivers. Thus, he constructed grand halls and soaring pavilions, felling trees and bridging valleys. He carved into sheer cliffs, shaping the rock into a palace. Vast halls and grand courtyards rose, with towering halls and flying pavilions. Kitchens, storerooms, and living quarters were solemn and complete. Vermilion and azure gleamed, their radiance intertwining with the Milky Way. The statues were majestic, the bells and drums resonant. Stone paths wound through, shaded by firs and pines. Countless laborers and vast resources were expended, spanning over twenty years before completion. Hundreds of *qing* of land were cultivated to feed tens of thousands.\n\nIn the third year of the Zhida era, the present Emperor, styled \"Instrument of Heaven and Ascendant Sage,\" and the Empress Dowager Ciren Zhaoyi Shouyuan, hearing of the master’s virtuous conduct, dispatched envoys to command the performance of the Golden Register Offering. Summoned to the capital, his prayers for rain were invariably answered. The palace bestowed the name *Heavenly One True Celebration Longevity Palace*. He was appointed to oversee its affairs.\n\nBy imperial decree, the spirit’s father was honored as *Qiyuan Longqing Heavenly Lord Bright True Great Emperor*, and his mother as *Cining Yude Heavenly Empress Jade True Supreme Immortal*. The master was granted the title *Tixuan Miaoying Great Harmony True Man*.\n\nIn the second month of the spring of the first year of the Yanyou era, Minister of Works Luo Yuan, by the Empress Dowager’s decree, rode a four-horse carriage bearing incense and silk to return to the mountain and offer sacrifices. In the tenth month of winter, Grand Academician Chen Hao requested the addition of the character *Great* to the palace’s name, now styled *Great Heavenly One True Celebration Longevity Palace*. The Hanlin Academician-in-Chief, Minister Liu Geng, was commanded to inscribe it. The Hanlin Academician-in-Chief, Minister Jufu, was ordered to compose the stele’s text; Grand Academician Meng Fu to write the inscription; and Participant in the Deliberations of the Secretariat, Minister Shi Yan, to engrave the title.\n\nYour servant Jufu reflects: The sagely Son of Heaven embodies the essence of purity and stillness, governing with effortless virtue. As father to heaven and mother to earth, he embraces all spirits and nurtures all things, cherishing the myriad people. Rising early and retiring late, he toils for governance—this is the utmost virtue. The master, though born of cloud and mist, has revitalized the Dao and purified his virtue. With burning resolve and苦志, he has erected halls and altars to receive heaven’s favor—truly a heroic figure.\n\nThe master is forthright and resolute, dignified and steadfast. Even at grand sacrifices, he does not bathe or change attire, yet his prayers are invariably answered. Though showered with imperial favor, he remains as when he first entered the mountains—such is the mark of one who has attained the Way.\n\nAs for the spirit’s virtue, vast and boundless, its transformations know no limit. To speak of it is to invoke its ancient dwelling, where its power is concentrated. How could this not be so?\n\nYour servant Jufu bows his head to the ground and offers this poem:\n\nIn the lands of Jun and Fang,\nWhite clouds crown towering Mount Wudang.\nIts roots span a thousand *li*, rugged and steep,\nSeventy-two peaks arrayed like misty tresses.\nThe Emperor sent the Dark Warrior to drive away evil,\nHair unbound, long sword in hand, clad in darkness.\nThe towering tortoise and coiling serpent, fierce and mighty,\nRide the clouds to come and the winds to return.\nI gaze afar, yet it remains distant and unattainable—\nThe True Man studies the Dao, carving through hardship.\nSoaring a thousand *ren*, he clears the wilds,\nTurning the celestial pivot, opening heaven’s gate.",
      "overlap_context": "ose, nor for the pleasure of sightseeing, but to glorify the divine majesty, perpetuate the grand destiny, and fulfill the sacred intent of the Son of Heaven in establishing teachings through the divine Dao.\n\nHaving recorded these events, your servant bows his head to the ground and offers this inscription. The inscription reads:\n\nVirtue moves the heart,\nThe divine knows no bounds.\nWhat sign does the numen bear?\nIt proclaims the sagely Emperor.\nWhat does it proclaim?\nThe twelfth month of winter.",
      "start_char": 1931,
      "end_char": 3167,
      "start_sentence": 80,
      "end_sentence": 140,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.159010887145996,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\玄天上帝启圣灵异录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "琼楼珠宫翠回环，霞披雾映黄金镮？ 湛恩大号帝所颁，神来居之佩珊珊。 寒松萧飕水潺湲，飞香满空馥蕙兰。 愿神永永哀民难，汛扫秽浊无恫症。 我皇万岁御九寰，兴圣怡愉长朱颜。 延佑二年三月　　日。 元加封韶 上天眷命，皇帝圣旨：朕闻越有贵神，是为玄帝。 发祥大国，学道名山。 位镇北方，开皇家之景运。 威加海内，殄庶域之妖氛。 既昭服於纯厘，宜推尊於圣父。 元包有极，所以融一炁之胚胎。 庆衍真源，所以绥万年之祉禄。 庸加美号，用答殊休。 圣父净乐天君明真大帝，可加封启元隆庆天君明真大帝。 主者施行。 延佑元年九月　　日。 上天眷命，皇帝圣旨：昔有上仙降生，玄帝一炁，难名其妙用，万方咸仰其英威。 晬宇天临，顾洋洋而如在。 祥光日耀，信赫赫以长存。 昌期既协於剖符，大号宜加於镂牒。 着母仪之特盛，配父道之常尊，圣躬有赖於拥全。 慈仁允洽帝祚，益期於昌炽福禄来。 仍圣母善胜天后琼真上仙，可加封慈宁玉德天后琼真上仙。 主者施行。 延佑元年九月　　日。",
      "translated_text": "Amidst jade towers and pearl palaces, verdant hues entwine,\nAre they girded in golden splendor by rosy clouds and mist?\nThe Emperor’s profound grace, proclaimed in grand decree,\nDraws the gods to dwell here, their pendants chiming softly.\nCold pines sigh, streams murmur,\nFragrance fills the air, rich with orchid and magnolia.\nMay the gods forever pity the people’s plight,\nSweeping away filth and impurity without ailment or affliction.\nMay our Emperor reign ten thousand years over the nine realms,\nHis sagely joy ever brightening his crimson countenance.\n\n*Dated the third month of the second year of Yan You.*\n\n---\n\nBy the grace of Heaven’s mandate, the Emperor’s sacred decree:\nWe have heard that in the south there is a noble deity, known as the Dark Emperor.\nBorn of a great nation’s auspicious omens, he cultivated the Dao upon a famed mountain.\nEnthroned to guard the northern quarter, he inaugurated the imperial house’s bright destiny.\nHis might extended across the land, quelling the demonic vapors of all domains.\nHaving manifested his submission to pure order, he is fittingly honored as the Sagely Father.\nThe primordial vastness encompasses all limits, thus uniting the embryo of primordial *qi*.\nThe flourishing of the true source ensures the perpetuation of ten thousand years of blessings and prosperity.\nWe now bestow a noble title in gratitude for his extraordinary favor.\nThe Sagely Father, Pure Joy Heavenly Lord, Radiant Perfected Great Emperor, shall be further honored as the **Inaugural Origin, Prosperous Celebration Heavenly Lord, Radiant Perfected Great Emperor**.\n\nLet the relevant authorities carry this out.\n\n*Dated the ninth month of the first year of Yan You.*\n\n---\n\nBy the grace of Heaven’s mandate, the Emperor’s sacred decree:\nOf old, a transcendent immortal descended to be born—the Dark Emperor, a single *qi* whose wondrous workings defy description, yet all directions revere his majestic might.\nHis benevolent gaze spans the cosmos, vast and ever-present.\nHis auspicious radiance shines like the sun, resplendent and enduring.\nAs the era of prosperity aligns with the mandate of heaven, his grand title shall be inscribed upon the sacred registers.\nHis mother’s virtue is uniquely exalted, complementing the father’s eternal honor, and the sagely person is thus preserved in wholeness.\nHer compassion and kindness perfectly harmonize with the imperial destiny, ever fostering its flourishing.\nThus, the **Holy Mother, Victorious Goodness Heavenly Queen, Jade Perfected Transcendent** shall be further honored as the **Compassionate Tranquility, Jade Virtue Heavenly Queen, Jade Perfected Transcendent**.\n\nLet the relevant authorities carry this out.\n\n*Dated the ninth month of the first year of Yan You.*",
      "overlap_context": "sand *li*, rugged and steep,\nSeventy-two peaks arrayed like misty tresses.\nThe Emperor sent the Dark Warrior to drive away evil,\nHair unbound, long sword in hand, clad in darkness.\nThe towering tortoise and coiling serpent, fierce and mighty,\nRide the clouds to come and the winds to return.\nI gaze afar, yet it remains distant and unattainable—\nThe True Man studies the Dao, carving through hardship.\nSoaring a thousand *ren*, he clears the wilds,\nTurning the celestial pivot, opening heaven’s gate.",
      "start_char": 3168,
      "end_char": 3591,
      "start_sentence": 141,
      "end_sentence": 167,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.55328631401062,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\玄天上帝启圣灵异录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "上天眷命，皇帝圣旨：武当福地，久属职方。 灵应玄天，宜崇封典。 蜷言真武，昔护先朝。 定都人马之宫，尝见龟蛇之瑞。 虽昭应已修於明杞，而仙源未表於徽称。 爰命奉常议，行褒礼，谓元者善之长。 圣德合於一元，圣则化而神。 元功同於三圣，拯济民生而仁周。 宇宙廓清，世运而威。 畅风霆，订鸿名而既嘉，宣宠光而何忝於戏。 天道主宰谓之帝，四字庸镇於山川。 帝室眷命受於天，万年永安乎宗社。 思皇多祉，佑我无强。 特加号曰玄天元圣仁威上帝。 主者施行。 大德八年三月　　日。",
      "translated_text": "By the grace of Heaven and the sacred decree of the Emperor: the blessed land of Wudang has long been under the jurisdiction of the imperial domain. The numinous efficacy of the Mysterious Heaven warrants exalted honors. The coiled True Warrior of yore once guarded the former dynasty, establishing his temple among men and steeds, where the auspicious omens of tortoise and serpent were witnessed. Though his manifest responses have been duly revered in solemn sacrifices, the wellspring of his transcendence has yet to be proclaimed with fitting titles.\n\nWe therefore command the Court of Imperial Sacrifices to deliberate and enact rites of ennoblement. As the primordial is the chief of all virtues, his sagely power unites with the One Origin; as the sagely transforms into the numinous, his primordial merit equals that of the Three Sages. He succors and sustains the people with all-encompassing benevolence, sweeping the cosmos clear and securing the age with awe-inspiring might. His majesty resounds like thunder, and his illustrious name, once established, is most worthy. How could the bestowal of radiant favor be deemed unmerited?\n\nThe Dao of Heaven’s governance is called \"Emperor,\" and these four characters shall henceforth hallow the mountains and rivers. The imperial house, entrusted by Heaven’s mandate, shall enjoy ten thousand years of enduring peace for the ancestral altars. May abundant blessings attend, and may the mighty be our protector.\n\nThus, his title shall be augmented as the **Primordial Heaven, Origin Sage, Benevolent Might Highest Emperor**.\n\nLet the relevant authorities carry this out.\n\n*Dated the third month of the eighth year of Da De.*",
      "overlap_context": "the father’s eternal honor, and the sagely person is thus preserved in wholeness.\nHer compassion and kindness perfectly harmonize with the imperial destiny, ever fostering its flourishing.\nThus, the **Holy Mother, Victorious Goodness Heavenly Queen, Jade Perfected Transcendent** shall be further honored as the **Compassionate Tranquility, Jade Virtue Heavenly Queen, Jade Perfected Transcendent**.\n\nLet the relevant authorities carry this out.\n\n*Dated the ninth month of the first year of Yan You.*",
      "start_char": 3592,
      "end_char": 3814,
      "start_sentence": 168,
      "end_sentence": 183,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.556355237960815,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\玄天上帝启圣灵异录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "上天眷命，皇帝圣旨：建用皇极，以协雨旸。 敬重明神而消旱叹，感通一理也。 惟尔水神，原於道家之说，於昭地轴之名，克相予守土之臣。 伤农闵雨，使年谷以顺成。 厥灵赫然於戏，靡神不举。 用追迹於先王，依人而行，尚蜷怀於下土。 可封灵济将军。 主者施行。 泰定二年十二月　　日。 上天眷命，皇帝圣旨：咸秩无文，异於灾旱。 寰辙有规，一典也。 惟尔火神，原於道家之说。 式着天关之名，克相予守土之臣。 伤农闵雨，使年谷以顺成。 厥灵赫然於戏，二气良能以至诚而有感。 百神受职，宜定功以行封。 可封灵耀将军。 主者施行。 泰定二年十二月　　日。 上天眷命，皇帝圣旨：朕嘉修真之流，贵得道之士。 形神俱妙，僻处山林。 精气纯全，能兴雷雨。 信若人之高躅，实斯世之罕闻。 欲示褒扬，其颁换汗凝真灵妙保和法师，武当山天一真庆万寿宫住持宫事张守清，为老子学，奉玄帝祠，登万仞之层巅，构千间之大厦。 功用虽成於使鬼，行能自足以服人。 龟蛇常交媾以现形，狼虎随奔腾而敛迹。",
      "translated_text": "By Heaven’s gracious mandate, the Emperor’s sacred decree:\n\nEstablish and employ the August Standard to harmonize rain and sunshine. Revering the luminous spirits to dispel the lament of drought—this is the resonance of the One Principle.\n\nYou, the Water Spirit, originate in the teachings of the Daoist school and bear the illustrious name of the Earth’s Axis. You assist this guardian of the land, grieving for the farmers and mourning the lack of rain, ensuring the harvest’s timely fruition. Your numinous power shines forth—ah!—no spirit remains unsummoned. Following the traces of the former kings and acting in accord with the people, you coil your embrace around the earth below. You shall be enfeoffed as **General of Numinous Aid**.\n\nLet the relevant authorities carry this out.\n\n*Dated the twelfth month of the second year of Tai Ding.*\n\n---\n\nBy Heaven’s gracious mandate, the Emperor’s sacred decree:\n\nThough the rites for all spirits lack written form, they differ not from those for drought and flood. The imperial chariot’s path follows a single rule—this is the one canon.\n\nYou, the Fire Spirit, originate in the teachings of the Daoist school and bear the illustrious name of the Heavenly Pass. You assist this guardian of the land, grieving for the farmers and mourning the lack of rain, ensuring the harvest’s timely fruition. Your numinous power shines forth—ah!—the two qi, by their inherent nature, respond to utmost sincerity. All spirits receive their offices; it is fitting to determine merit and confer rank. You shall be enfeoffed as **General of Numinous Radiance**.\n\nLet the relevant authorities carry this out.\n\n*Dated the twelfth month of the second year of Tai Ding.*\n\n---\n\nBy Heaven’s gracious mandate, the Emperor’s sacred decree:\n\nWe commend the lineage of those who cultivate the true, honoring those who attain the Dao. Body and spirit both wondrous, they dwell in secluded mountains and forests. Their essence and qi pure and complete, they command thunder and rain. Their integrity stands as a lofty model for humanity, a rarity indeed in this age. Desiring to bestow praise, We hereby promote and rename **Master of Mystic Harmony, Preserver of the True, and Guardian of the Elixir**, Zhang Shouqing, superintendent of the Temple of Celestial Unity, True Felicity, and Myriad Longevity on Mount Wudang, who studies the teachings of Laozi and tends the shrine of the Dark Emperor. He has ascended the towering peaks of ten thousand fathoms and constructed a grand edifice of a thousand halls. Though his works are accomplished through the agency of spirits, his conduct and ability suffice to command the people’s reverence. The tortoise and serpent often entwine in manifest form, while wolves and tigers flee at his gallop, their traces vanishing.",
      "overlap_context": "called \"Emperor,\" and these four characters shall henceforth hallow the mountains and rivers. The imperial house, entrusted by Heaven’s mandate, shall enjoy ten thousand years of enduring peace for the ancestral altars. May abundant blessings attend, and may the mighty be our protector.\n\nThus, his title shall be augmented as the **Primordial Heaven, Origin Sage, Benevolent Might Highest Emperor**.\n\nLet the relevant authorities carry this out.\n\n*Dated the third month of the eighth year of Da De.*",
      "start_char": 3815,
      "end_char": 4229,
      "start_sentence": 184,
      "end_sentence": 209,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.605093955993652,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\玄天上帝启圣灵异录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "素心既固，玄化弥彰。 争稽首於讲筵，几四千辈。 不及胁於外席，垂三十年。 近臣有称赞之言，太后有征求之命。 屡逢亢旱，方虞率土之灾。 申祷上玄，并获甘霖之喜。 功已沾於庶物，身宜佩於殊荣。 加贲冠簪增辉，岔壑於戏镇安。 侯服真庆，为南纪之灵祠。 辅翼我家，玄武主北方之王气。 唯竭心思而致梼，庶几福录以来。 崇钦哉，维时服我明训。 可赐体玄妙应太和真人，宜令张守清准此。 延佑元年十月　　日。 启圣嘉庆图序 玄天以水德镇北方，有国家者，实嘉赖之。 而台终所临，武当为最。 显其斓运之功，育物之德，昭乎古今，迨非启圣诸记所能历数也。 逮于皇元，肇基朔方。 德运同符，天人胥契。 故於克定，立功之始穷。 冬冱寒之时，而示现金水。 诞开祯祥，其兆灵邦家，类匪前闻所得同也，而未有以传。 山之真庆宫提点张洞渊，因金水新事，发启圣旧，编集而为嘉庆图。 图释以文，得梓镘以行世，将以上扬鸿业，光昭神麻。 虽图不尽事，事不尽传，而得着夫天运攸归之符，方配玄天於无强，则此图之传，非独为斯道幸也。 时皇庆壬子夏，五嗣天师张与材，书于大都之崇真方丈。 玄武着灵尚矣，武当山乃昔修炼上升之地，故昭灼显异，他杞莫并也。 圣朝混一区宇，至元问，龟蛇冬见於高梁河，遂即其地作大昭应宫，以表其异。 今张洞渊，原神所由，为嘉庆图，以信后传远。 夫神与人相依而行，人非神，何以尊。 神非人，何以发扬显休。 大暴於天下，则是图也，岂徒然哉。 延佑改元夏，五玄教嗣师昊金节顿首书。 天一真庆宫，元和迁校府，此二宫府，本出清微法中，雷困黄君，传之於混隐真人南君，张洞渊於清微法有所受，故取以名其宫。 复取启圣记中数十图，加之圣朝高梁河，示现龟蛇之瑞继其后，因日嘉庆图。 当代天师暨诸公叔之详矣，奚待余言之赘哉。 且高真在天，惟辅有德。 当世祖皇帝混一区，夏以仁守位，四夷八荒，罔不臣服。 生灵兆庶，罔不枢吟。 是以嘉祥日至，灵瑞云集，天人相与，真万世一时之会也。 洞渊发明斯瑞，使天下共知，以传不朽，是可尚也，故为之书。 时皇庆改元立秋日，翰林学士承旨，资善大夫知制诰，兼修国史张仲寿书。 《易》曰：天一生水，地六成之。 夫一者，数之始也。 水者，万物成形之始也。 生数奇，成数偶，於位为北方。 北者，背也。 北方象人背，故北极出天最高。 又北之为文，从人相，背阳，至冬至而止，又自冬至而复生。 於卦为坎，水之为文，象形为坎卦，束西分流於乾坤之四德。 曰贞贞者，正固也。 二义在天斗，牛女虚危，室壁七宿，列於北方，成形为玄武。 玄武者，龟蛇也。 青龙白虎朱雀，皆一物，而玄武独二物。 不谓之龟蛇，而谓之玄武者，玄之为色，赤而黑，龟蛇则然。 有鳞甲，武之象也，玄武之神始降。 宋真宗时，为祠遍天下，皇元之兴，实始於北方。 北方之气将王，故北方之神先降。 事为之兆，天既告之矣，武当山在西南方，巍然高且大，玄武神依焉。 黑衣被发，仗剑践龟蛇，人往往见之，至今常然。 天一真庆宫主张君洞渊，笃於信道，强立不挠。 皇太后闻而召之。 会京师旱，自去年九月不雨，至于三月。 天子以为忧，皇太后使人持香，从张君祷焉，先雨。",
      "translated_text": "The pure heart being firmly established, the mysterious transformation grows ever more manifest. Those who vie to bow in homage at his lecture seats number nearly four thousand, while those who cannot secure a place within the outer rows have waited for thirty years. Recent ministers have spoken in his praise, and the Empress Dowager has issued summons. During repeated droughts, when the realm feared widespread calamity, he petitioned the Supreme Mystery and brought forth the joy of sweet rains. His merit has already nourished all things, and his person is fittingly adorned with exceptional honors. Let the brilliance of his cap and hairpin be enhanced, and the valleys and ravines rejoice in his steadfast tranquility.\n\nAs the True Felicity Marquis of the sacred precinct, he serves as the numinous shrine of the southern realm. Aiding and sheltering Our house, the Dark Warrior presides over the royal qi of the north. Only by exhausting his heart and thoughts in prayer may he hope to draw forth blessings. Reverence him! At this time, heed Our enlightened decree.\n\nLet **Zhang Shouqing** be granted the title **Perfected of Mystic Harmony and Supreme Response**, and let this be duly enacted.\n\n*First day of the tenth month, first year of the Yanyou era.*\n\n---\n\n**Preface to the *Illustrated Record of Auspicious Felicity***\n\nThe Dark Warrior, by virtue of water, governs the north. Those who rule the state truly rely upon him. Among the regions under his influence, Mount Wudang stands preeminent. His resplendent efficacy in destiny and his virtue in nurturing all things have shone through the ages, far surpassing what earlier *Records of the Divine Manifestation* could enumerate.\n\nWhen the august Yuan dynasty first established its foundation in the northern lands, its virtuous destiny aligned with the heavens, and all under heaven harmonized. Thus, at the very inception of its pacification and the founding of its merit—during the depths of winter’s frozen stillness—the golden and aqueous signs appeared. Auspicious omens unfolded, presaging the nation’s prosperity in ways unheard of before. Yet no record had been transmitted.\n\nZhang Dongyuan, superintendent of the True Felicity Palace on the mountain, taking the recent golden and aqueous events as his starting point, revived the old *Records of the Divine Manifestation* and compiled them into the *Illustrated Record of Auspicious Felicity*. The illustrations are elucidated with text, and the work is carved onto printing blocks to circulate in the world, that it may exalt the grand enterprise and illuminate the divine majesty. Though the illustrations may not exhaust all events, nor the events all traditions, they reveal the celestial mandate’s fulfillment and align the Dark Warrior with the invincible. Thus, the transmission of this record is not merely a blessing for this Dao.\n\n*Summer of the renzi year of the Huangqing era, written by the Fifth Celestial Master Zhang Yucai at the Hall of Venerating the Perfected in Dadu.*\n\n---\n\nThe numinosity of the Dark Warrior is ancient indeed. Mount Wudang, where immortals once cultivated and ascended, has long been resplendent with wondrous manifestations, unmatched by other sacred sites. When the sagely dynasty unified the realm, during the *zhiyuan* era, the tortoise and serpent appeared in winter at the Gaoliang River. Thereupon, the Great Luminous Response Palace was built on that site to mark the marvel. Now, Zhang Dongyuan, tracing the origins of the divine, has composed the *Illustrated Record of Auspicious Felicity* to ensure its transmission to distant posterity.\n\nThe divine and the human depend upon one another. Without the divine, how could humanity revere? Without humanity, how could the divine be exalted and its glory made manifest? To proclaim this to all under heaven—is this record not far from trivial?\n\n*Summer of the first year of the Yanyou era, respectfully inscribed by Wu Jinjie, Hereditary Master of the Five Mysteries Teaching.*\n\n---\n\nThe **Palace of Celestial Unity and True Felicity** and the **Yuanhe Relocation Bureau** both originate from the Qingwei tradition. Huang Jun of Leizhou transmitted it to the Perfected of Hidden Harmony, Nan Jun. Zhang Dongyuan received the Qingwei teachings and thus named his palace accordingly. He further selected dozens of illustrations from the *Records of the Divine Manifestation*, appending the auspicious tortoise-and-serpent omens from the Gaoliang River during the sagely dynasty, and titled the work *Illustrated Record of Auspicious Felicity*. The contemporary Celestial Master and various venerable masters have already expounded upon it in detail—what need is there for my superfluous words?\n\nMoreover, the exalted Perfected in heaven only assist those of virtue. When Emperor Shizu of the present dynasty unified the realm, he governed with benevolence, and the four barbarians and eight wilds all submitted without exception. The myriad people and countless multitudes all rejoiced in harmony. Thus, auspicious signs arrived daily, and numinous portents gathered like clouds. Heaven and humanity converged—truly a once-in-ten-thousand-generations convergence.\n\nDongyuan has elucidated these portents, making them known to all under heaven for eternal transmission. This is indeed worthy of esteem, and thus I write this preface.\n\n*First day of autumn in the first year of the Huangqing era, respectfully inscribed by Zhang Zhongshou, Hanlin Academician, Grand Master for Glorious Happiness, Drafter of Imperial Edicts, and Compiler of the National History.*\n\n---\n\nThe *Book of Changes* states: *\"Heaven’s one generates water; earth’s six completes it.\"* The number one is the beginning of all numbers. Water is the origin of all formed things. The generating numbers are odd; the completing numbers are even. In position, they correspond to the north. \"North\" means \"back,\" and the north symbolizes the human back, hence the North Star emerges as the highest point in the heavens. The character for \"north\" (*bei*) depicts two people back-to-back, turning away from the sun. It reaches its extreme at the winter solstice, then begins anew. In the hexagrams, it is *Kan* (☵), the water trigram. The character for \"water\" (*shui*) graphically resembles the *Kan* hexagram. East and west diverge as the four virtues of *Qian* (☰) and *Kun* (☷): \"firmness\" and \"yielding.\" The doubled *zhen* (貞貞) signifies \"steadfast correctness.\"\n\nThe two celestial principles reside in the Dipper. The seven lunar lodges of the north—Oxherd, Weaver Girl, Emptiness, Rooftop, House, Wall—form the constellation of the Dark Warrior. The Dark Warrior is the tortoise and serpent. The Azure Dragon, White Tiger, and Vermilion Bird are each single creatures, but the Dark Warrior alone comprises two. It is not called \"tortoise and serpent\" but \"Dark Warrior\" because \"dark\" (*xuan*) is the color of red-black, which the tortoise and serpent embody. Their scales and shells symbolize martiality (*wu*), hence the name Dark Warrior.\n\nThe Dark Warrior’s divine descent began during the reign of Emperor Zhenzong of the Song, when shrines were established throughout the realm. The rise of the august Yuan truly began in the north. As the qi of the north was destined to prevail, the north’s deity descended first, foretelling events. Heaven had already proclaimed it.\n\nMount Wudang lies in the southwest, towering and vast. The Dark Warrior’s spirit resides there. Clad in black robes, hair unbound, wielding a sword and treading upon the tortoise and serpent, he is often seen even to this day. Zhang Dongyuan, master of the Palace of Celestial Unity and True Felicity, is steadfast in his devotion to the Dao, resolute and unyielding. The Empress Dowager, having heard of him, summoned him to court.\n\nAt that time, the capital suffered a drought—no rain had fallen from the ninth month of the previous year until the third month. The Son of Heaven was deeply concerned. The Empress Dowager dispatched an emissary bearing incense to accompany Master Zhang in prayer, and rain fell at once.",
      "overlap_context": ", True Felicity, and Myriad Longevity on Mount Wudang, who studies the teachings of Laozi and tends the shrine of the Dark Emperor. He has ascended the towering peaks of ten thousand fathoms and constructed a grand edifice of a thousand halls. Though his works are accomplished through the agency of spirits, his conduct and ability suffice to command the people’s reverence. The tortoise and serpent often entwine in manifest form, while wolves and tigers flee at his gallop, their traces vanishing.",
      "start_char": 4229,
      "end_char": 5477,
      "start_sentence": 210,
      "end_sentence": 274,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.63420915603638,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\玄天上帝启圣灵异录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "张君为之日时，已而，果然雨数日乃止，远近皆沾足。 皇太后厚赐之，尽散与其众，不以一钱私己。 其行若是，真所谓绝无而仅有者哉，是宜神之相之也。 张君持所刊嘉庆图，缴余为序，余为诵所闻而书之。 皇庆元年夏四月廿二日，集贤侍讲学士中奉大夫赵孟俯序。 一者，天之清气，水之生数。 老子曰：道生一。 真庆宫以天一名，道原之所自出也。 紫霄天柱，岩岩峻极，非玄武，孰能当之。 洞渊张先生，以弘愿定力，为此山开宇宙，其徒唐中一、刘中和，充拓师说，作启圣嘉庆图，出相叔事，稽古之力，聚在此书，皆信而有征者。 行之四方，传之百世，升学道之人，寓於目而得於心，因有相，以悟无声之妙。 不测之神，无穷之化，虽有百千万亿，而心之精微，惟一而已。 大易以元首四德，元亦一也。 乾日亨，嘉之会。 坤日积，善之庆。 万民万物同一，太极受此清气，得此生数，含弘厚积，以全天一之真。 浩浩渊渊，均囿乾坤。 嘉庆中道，力无尽，福德亦无尽，此嘉庆图之所以作也。 览者无贰尔心，洋洋在上，实鉴临之。 至大。 辛亥白露节，云西耐庵道人赵炸拜手书。 天之高，不可知也。 日月星辰之象，吾得而观焉。 地之厚，不可度也。 山川草木之形，吾得而察焉。 神之妙，不可测也。 变化应感之迩，吾得而拟议焉。 是道也，洞渊张先生其知之。 其作玄武嘉庆图，是已其言曰：武当之为山也，七十有二峰，皆奇伟怪绝。 而所谓紫霄峰者，又七十二峰之中峰也。 然则，其能出云雨，见灵怪也，固宜矣。 又曰：其帝而神之者，曰玄武。 玄武者，在天为虚危之宿，在地托龟蛇之灵，於五行为水，於五色为玄，而其数则一也。 夫一之为一也，虽数而言之则一，固造化之所由。 分即数，而言之则一，固十百千万之所由起也。 然则，其寓夫地之中，而行乎天之一，非天下之所谓至神者欤。 洞渊曰：自是而上，吾不可以言喻也。 自是而下，吾犹得以迩言之。 於是，与其徒唐中一、刘中和，取其瑰异显着者，图而传之，将使天下观者动心骇目，必有以启夫敬畏感慕之意焉。 子从玄教大宗师嗣宗师，知洞渊之有功於武当也。 曰洞渊居武当，攻苦食力，廿有余年。 梯危架险，经营缔构，作宫室以奉香火，几以穷山幽谷，比壮丽於通都大邑，则洞渊规画运量，其可以浅浅窥哉。 其佐而成之者，同栖岩学之士也。 会子弟佐邑，在武当为近，故得详言之。 皇庆元年正月十日，虞集书。 坎宫之神，曰玄武，生太极之初，应天一之数，周流八极，灵变莫测。 其所以利万物，福苍生，德之溥也。 历代崇奉，罔不精虔。 武当乃住世修真之所居。 翼斡之下，耸七十二峰，鬼神守护甚严，人迩罕到，天柱紫霄峰，尤为峻极。 洞渊张先生，开此山，构殿宇，规模宏丽，古昔未有。 凡二十七年而后成，自非精修之至者，能如是乎。 高弟唐中一、刘中和，继承师志，思惟玄帝实录，流布未广，作嘉庆图形，诸有相而叔其事，自初至终，至为周悉。 募工馒梓，以传於世，俾观者因相以明其事、因事以知其灵，则皆起诚敬，而坚向善之心，惭可进於道矣。 中政长史林公仲德，为予道其事，且征为序。 予嘉洞渊信道之笃，中一、中和用意之勤，将见玄风大振也。",
      "translated_text": "Master Zhang selected the day and hour for the ritual, and soon after, rain indeed fell for several days without cease, soaking the land far and near. The Empress Dowager bestowed upon him generous gifts, which he distributed entirely among his followers, keeping not a single coin for himself. Such conduct is truly rare—one might say unparalleled—and it is no wonder the gods favored him.\n\nMaster Zhang presented the engraved *Illustration of Auspicious Felicity* and entreated me to compose a preface. I have recounted what I have heard and recorded it here. Summer, the twenty-second day of the fourth month, the second year of the Huangqing era. Preface by Zhao Mengfu, Grand Master for Palace Attendance and Academician of the Jixian Institute.\n\nThe number one is the pure *qi* of Heaven and the generative number of Water. Laozi said: \"The Dao gives birth to the One.\" The Palace of True Felicity is named *Tianyi* (\"Heavenly One\"), for it is the source from which the Dao’s origin flows. The Purple Empyrean’s Heavenly Pillar stands towering and majestic—who but the Dark Warrior could be its guardian? Master Zhang of Dongyuan, through his vast vow and steadfast power, opened this mountain to the cosmos. His disciples, Tang Zhongyi and Liu Zhonghe, expanded upon his teachings and created the *Illustration of Auspicious Felicity*, depicting the events of his life. The fruits of their antiquarian diligence are gathered in this book, all verifiable and trustworthy. May it circulate throughout the land and endure for a hundred generations, so that those who ascend in the study of the Dao may behold it with their eyes and grasp it in their hearts. Through the manifest, they may awaken to the mystery of the soundless. The unfathomable spirit and boundless transformations, though myriad in number, are but the subtlety of the One within the heart. The *Book of Changes* speaks of the four virtues of the *yuan* (\"origin\"), yet *yuan* is also the One. *Qian* is called *heng* (\"prosperity\"), the convergence of auspiciousness. *Kun* is called *ji* (\"accumulation\"), the celebration of goodness. All people and all things share the One. The Supreme Ultimate receives this pure *qi* and this generative number, embracing and accumulating it to preserve the truth of the Heavenly One. Vast and profound, it encompasses Heaven and Earth. The *Way of Auspicious Felicity* is inexhaustible in power, and its blessings and virtue are likewise boundless—this is why the *Illustration of Auspicious Felicity* was created. Let the viewer remain unwavering in heart, for the boundless abides above, truly witnessing all. Supreme indeed!\n\nOn the *Bailu* (\"White Dew\") solar term of the *xinhai* year, Zhao Zha of Yunxi Naian Daoist Temple respectfully inscribed this.\n\nThe height of Heaven is beyond knowing, yet we may observe the forms of the sun, moon, and stars. The depth of Earth is beyond measure, yet we may examine the shapes of mountains, rivers, and plants. The wonder of the gods is beyond fathoming, yet we may contemplate their near-at-hand responses and transformations. This is the Dao, and Master Zhang of Dongyuan understood it well. His creation of the *Illustration of Auspicious Felicity of the Dark Warrior* attests to this.\n\nHe declared: \"Mount Wudang comprises seventy-two peaks, each wondrous and extraordinary. Among them, Purple Empyrean Peak stands as the central peak of the seventy-two. Thus, its ability to summon clouds and rain and manifest numinous marvels is only fitting. Moreover, its divine ruler is called the Dark Warrior. In Heaven, he is the *Xu* and *Wei* constellations; on Earth, he embodies the spirit of the tortoise and serpent. Among the Five Phases, he is Water; among the Five Colors, he is black; and his number is One. The One as One, though numerically expressed as one, is the origin of creation. When divided, it becomes numbers, yet when spoken of, it remains the One—the source from which ten, a hundred, a thousand, and ten thousand arise. Thus, its dwelling at the center of Earth and its movement through the One of Heaven—is this not what the world calls the most divine?\"\n\nMaster Dongyuan said: \"Beyond this, I cannot express in words. Below this, I may yet speak of it in part.\" Thereupon, with his disciples Tang Zhongyi and Liu Zhonghe, he selected the most wondrous and striking phenomena, illustrated them, and transmitted them, so that all who behold them may be stirred in heart and astonished in sight, thereby awakening reverence, awe, and admiration.\n\nI, as a successor to the Grand Master of the Mysterious Teachings, recognize Master Dongyuan’s contributions to Mount Wudang. He resided on Wudang for over twenty years, enduring hardship and laboring diligently. Scaling perilous heights and bridging treacherous paths, he planned and constructed palaces to enshrine the incense offerings, transforming the desolate mountains and secluded valleys into a splendor rivaling the grandest cities. How could one fathom the depth of Master Dongyuan’s vision and foresight? Those who aided him in this endeavor were fellow scholars of the rocky crags. As I was serving in the capital near Wudang, I was able to learn of these matters in detail.\n\nWritten on the tenth day of the first month of the first year of the Huangqing era by Yu Ji.\n\nThe god of the *Kan* palace is the Dark Warrior, born at the inception of the Supreme Ultimate and corresponding to the number of the Heavenly One. He roams the eight directions, his numinous transformations beyond measure. Through him, the myriad things are benefited, and the common people are blessed—his virtue is all-pervading. Through the ages, he has been revered with utmost devotion. Mount Wudang is the abode of those who dwell in the world to cultivate the truth. Beneath its soaring canopy rise seventy-two peaks, fiercely guarded by spirits and gods, rarely visited by mortals. Among them, the Heavenly Pillar of Purple Empyrean Peak stands most majestic.\n\nMaster Zhang of Dongyuan opened this mountain, constructing halls and pavilions of grand and magnificent scale, unparalleled in ancient times. After twenty-seven years, the work was completed—could any but the most devoted cultivator have achieved this? His eminent disciples, Tang Zhongyi and Liu Zhonghe, carried forward their master’s aspirations. Recognizing that the true records of the Dark Emperor had not been widely disseminated, they created the *Illustration of Auspicious Felicity*, depicting the events and narrating the details from beginning to end with meticulous care. They commissioned artisans to carve the woodblocks and transmit it to the world, so that viewers might grasp the events through the images and perceive the numinous through the events. Thus, all may awaken to sincerity and reverence, strengthening their resolve toward goodness and advancing toward the Dao.\n\nLin Zhongde, Director of the Central Administration, recounted these matters to me and requested a preface. I commend Master Dongyuan’s steadfast devotion to the Dao and the diligent intent of Zhongyi and Zhonghe. Surely, the Mysterious Wind will flourish greatly.",
      "overlap_context": " day. Zhang Dongyuan, master of the Palace of Celestial Unity and True Felicity, is steadfast in his devotion to the Dao, resolute and unyielding. The Empress Dowager, having heard of him, summoned him to court.\n\nAt that time, the capital suffered a drought—no rain had fallen from the ninth month of the previous year until the third month. The Son of Heaven was deeply concerned. The Empress Dowager dispatched an emissary bearing incense to accompany Master Zhang in prayer, and rain fell at once.",
      "start_char": 5477,
      "end_char": 6709,
      "start_sentence": 275,
      "end_sentence": 330,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.436424255371094,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\玄天上帝启圣灵异录.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "於是乎书。 至大。 辛亥孟冬吉旦，鲍思义谨书。 玄天上帝启圣灵异录竟",
      "translated_text": "Thus, the book is completed.\n\n*Da De* era, first month of winter in the *xinhai* year, auspiciously inscribed by Bao Siyi.\n\nHere ends the *Record of the Divine Marvels of the Mysterious Heavenly Emperor’s Manifestation of Sageliness*.",
      "overlap_context": " world, so that viewers might grasp the events through the images and perceive the numinous through the events. Thus, all may awaken to sincerity and reverence, strengthening their resolve toward goodness and advancing toward the Dao.\n\nLin Zhongde, Director of the Central Administration, recounted these matters to me and requested a preface. I commend Master Dongyuan’s steadfast devotion to the Dao and the diligent intent of Zhongyi and Zhonghe. Surely, the Mysterious Wind will flourish greatly.",
      "start_char": 6709,
      "end_char": 6749,
      "start_sentence": 331,
      "end_sentence": 334,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 2.03140926361084,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\记传类\\玄天上帝启圣灵异录.txt",
        "category": "记传类"
      }
    }
  ]
}