{
  "source_id": "玄肤论",
  "source_file": "chunked_daozang\\玄肤论.json",
  "total_chunks": 16,
  "total_original_chars": 9412,
  "total_translated_chars": 50243,
  "total_translation_time": 260.74746561050415,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\玄肤论.txt",
    "category": "藏外"
  },
  "full_translation": "**Preface to *On the Subtle and the Shallow***\n\n*On the Subtle and the Shallow* is a work compiled by Master Lu. Having received the teachings of nature and destiny from his sagely teacher, he experienced a profound resonance within and thus recorded the transmitted doctrines, composing twenty chapters totaling over seven thousand characters, entitled *On the Subtle and the Shallow*.\n\n\"Subtle and shallow\" signifies that the profound principles are but superficially expounded—far from the essence of true attainment. As the age grows ever more distant from the sages, the great Dao has been lost in transmission. Blind and reckless masters peddle their own views, most of whom pilfer superficial resemblances to embellish their cunning deceptions. Thus, there are those who, clad in monastic robes, engage in verbal sparring with their \"chan\" wit; those who monopolize discourse, boasting of alchemical gold and silver; those who, in their pursuit of human vitality, first corrupt it with chamber elixirs; and those who, in their quest for longevity through ingestion, instead ravage their lives with minerals and metals. With the Way obscured, the calamities spread boundlessly—how pitiable this is to the benevolent!\n\nIn my early years, I, the author, devoted myself to the study of the Two Teachings as a scholar of letters, spending nearly twenty years wandering through the thickets of error, entangled in the snares of idle chatter. Though I stumbled repeatedly, I never abandoned my initial sincerity, and thus I was granted this encounter.\n\nNature is realized through self-awakening, but destiny relies on transmission from a teacher. These two statements, however, still leave room for further discussion. Why? Even those of superior capacity and keen insight must attain sudden enlightenment through words; without receiving the esoteric instructions in person, relying solely on one’s own judgment is like a blind man refusing a staff—where can he go? There are three reasons why the Dao remains unheard:\n\nFirst, those who indulge in worldly pleasures, mistaking delusion for the norm, or who cling to emptiness, scorning the practical—these suffer from a heart of disbelief.\n\nSecond, those with some aspiration who admire the Way but remain entangled in the web of convention, delaying liberation while half-heartedly holding on—these suffer from a heart of incomprehension.\n\nThird, those who claim sagely wisdom yet reject good counsel, engaging in lofty discourse that intimidates others into silence—these suffer from a heart of arrogance.\n\nIf any of these three afflictions are present, the sagely teacher will not turn his gaze, nor will the true friend draw near. Habitual negligence accumulates, and one may pass a lifetime in ignorance, meeting death without ever having heard the truth—how lamentable!\n\nFearing this fate, I have been restless day and night, never daring to abandon myself. Thus, I have cast aside delusive thoughts and immersed myself in the profound Dao. In moments of quiet cultivation, reflecting on the teachings of my sagely teacher, I have ventured to record them in these chapters, undeterred by the risk of transgressing taboos. My aim is to reveal the true source, circulate the correct lineage, and guide others toward the Dao.\n\nSome may say that the ancients wrote books only after attaining the Way—is your haste to speak not a sign of impatience? I have heard that the highest path is to establish virtue, and the next is to establish words. When words cannot be withheld, one must speak. I am but one who follows the latter path, for in speaking of the Dao, I advance toward virtue. If one has already advanced in virtue, silence may suffice. Yet I, though aspiring to virtue, have not yet attained it.\n\nWritten on the ninth day of the ninth month in the first year of the Longqing era (1567), the year of *dingmao*.\n\n**On the Three Origins**\n\nI have heard from my teacher: ...\n\n“Elixirs possess three Origins, each capable of consummating destiny.”\n\nThe Three Origins refer to the Celestial Origin, the Terrestrial Origin, and the Human Origin. The Celestial Origin is called the *Spirit Elixir*. The Spirit Elixir is refined within the *spirit chamber* through *upper water* and *lower fire*, transforming the formless into form. After nine cycles, it crystallizes as *white snow*. Refined for three more years, it transmutes into a *spirit talisman*. Ingesting it, one ascends lightly—such is the wondrous efficacy of medicinal transformation, a marvel of sages and spirits. Its method is expounded in the *Dragon and Tiger* of the Yellow Emperor and the *Stone Casket* of Master Jingyang.\n\nThe Terrestrial Origin is called the *Numinous Elixir*. The Numinous Elixir transmutes metals and minerals into supreme treasures. Composed of tangible substances like silver, lead, cinnabar, and mercury, it serves worldly needs but cannot confer bodily transcendence. After nine cycles, its most potent essence is forged into a *spirit chamber* to connect with the Celestial Origin—thus serving as the vessel and provision for Daoist cultivation. The methods of the ancients, revered as sacred arts, are exceedingly simple: gather *precelestial lead*, subdue *postcelestial mercury*, discern *floating and sinking*, and recognize *maturity and tenderness*. Yet today’s blind masters, ignorant of this, fail a thousand times and never succeed. They do not realize that the Terrestrial Origin’s path differs not from the Human Origin. Only those who thoroughly comprehend *yin-yang* and deeply grasp the workings of creation may speak of it.\n\nThe Human Origin is called the *Great Elixir*. The Great Elixir forges the *crucible* externally while refining the medicine internally—this is the method of *taking from Kan to fill Li* and *stealing the mechanism to reverse its course*. All ancient immortals and sages achieved this. Thus, among the arts of consummating destiny, none is more immediate and profound than the Human Origin.\n\nOf the Three Origins: that which depends on heaven, earth, and spirits and cannot be assured is the Celestial Origin; that which, with disciplined practice and dual perfection of fortune and intent, is as effortless to attain as reaching for an object is the Terrestrial Origin; that which grasps the cosmos in hand, animates the myriad transformations within the body, eludes the calculations of ghosts and spirits, and escapes the reckoning of *yin-yang* is the Human Origin.\n\nYet is there a distinction of great and small? My teacher said: “Heaven envelops earth, earth bears humanity—thus the hierarchy of the Three Origins is revealed.”\n\n**On Internal and External Medicines**\nIn the study of the Human Origin, the crucible is forged externally while the medicine is refined internally—hence the division into *internal medicine* and *external medicine*. Yet most discussions of external medicine today miss the essence, leading the blind by the blind—a lamentable state!\n\nThe Dao resides within the body; internal refinement is paramount—why then forge a crucible externally? Forging the crucible is a measure sages adopt out of necessity. The Old Master likened it to deploying troops: “Weapons are inauspicious tools; sages use them only when unavoidable.”\n\nThe three supreme medicines—*spirit*, *qi*, and *essence*—are all possessed in the *precelestial* state, undifferentiated and uncarved. Thus, the unblemished child is already a *sacred embryo*. Yet once the *passion-gate* opens, the undifferentiated body shatters! With its rupture, the innate endowment of the body decays day by day, moment by moment, inevitably falling into the *postcelestial*. Postcelestial substances belong to *yin* and cannot endure; one must borrow *precelestial* counterparts of the same kind to replenish them. The precelestial counterpart is the *yang* of *Qian* metal. Refining *yin* with *yang* ensures the body’s longevity.\n\nThe *Cantong Qi* states: “To become an immortal through ingestion, seek substances of the same kind. A broken fence is mended with bamboo; a brood hen is replaced with an egg.” The analogy is clear. Yet one must also recognize that the *qi* of self and other derive from the same *Taiji*. Within it, the *essences* of *yin* and *yang* mutually reside in each other’s abodes—hence they cannot be cultivated in isolation.\n\nThe *Book of Changes* says: “The Dao consists of one *yin* and one *yang*.” “Like sounds resonate; like *qi* seeks like.” The *Cantong Qi* states: “Marriage unites *qi* as a bond; the first year sprouts growth.” The principle of creation: following the course produces humans; reversing it produces elixirs. The divine mystery is natural and cannot be falsified.\n\nRefining medicine internally while forging the crucible externally—does this merely mend the body’s deficiencies? Far from it.\n\n**On the Mutual Concealment of Yin and Yang**\nThe *Cantong Qi* says: “Heaven and earth take their positions, and the *Changes* operate within them.” The *Changes* refer to *Li* and *Kan*. The poem *Awakening to It* states: “First take *Qian* and *Kun* as the crucible; then gather the *crow* and *hare* to cook the medicine.”\n\n*Qian* and *Kun* are the images of *yin* and *yang*; the *crow* and *hare* are their *essences*. *Li* is the sun, bearing *yang* essence, yet its central line is *yin*—thus *yin* is concealed within *yang*’s abode. *Kan* is the moon, bearing *yin* essence, yet its central line is *yang*—thus *yang* is concealed within *yin*’s abode. The *Cantong Qi* says: “The *Kan* male becomes the sun; the *Li* female becomes the moon.” This is the meaning.\n\nThus, *Qian* and *Kun* are the purity of *yin* and *yang*; *Kan* and *Li* are their intermingling. In humans, before the *passion-gate* is opened, they embody the pure *yin* and pure *yang* of *Qian* and *Kun*. After its opening, the bodies of *yin* and *yang* intermingle, and their mutually concealed *essences* become operative.\n\nThe number of *minor yin* is eight; men attain it, hence their *essence* flows at sixteen. The number of *minor yang* is seven; women attain it, hence their *heavenly water* arrives at fourteen. Is this not evidence that *yang* possesses *yin*’s number and *yin* possesses *yang*’s number, revealing the principle of mutual concealment?\n\nSome may ask: “At sixteen, a boy’s *essence* flows—his unbroken body is ruptured, yet this surely arises from some stimulus. At fourteen, a girl’s *heavenly water* arrives—what stimulus does she respond to?”\n\nIt is said: “Whether or not there is a stimulus need not be debated. Once the *qi* arrives, the primal undifferentiated body is already ruptured. Consider how, beneath the heavy *yin* of earth’s terrain, a single *yang* suddenly returns—this is the hexagram of the eleventh month. At such a time, what does the heart of Heaven and Earth reveal? Yet the Master sighed over it, did he not? Was this not because, though the *qi* of creative interaction had yet to mingle and steam, its mechanism had already stirred?\n\nWhen it moves yet does not move, and does not move yet moves—this is called the *qi* of *True Unity* prior to Heaven, the very root of creation and the pivot of all things. It lies precisely here. Only when signs have coalesced and form and color become manifest does it fall into gross substance and belong to the realm of *after Heaven*.\n\nThus, what I call ‘rupture’ refers to the stirring of the *qi*-mechanism, not to the necessity of awaiting the steaming intermingling of interaction. Moreover, when a boy’s *essence* first flows, it does not initially take gross form. The *qi* must arrive first, then transform into fluid, and only then into *essence*. The *qi* that arrives first is *prior to Heaven*; the *qi* that transforms into fluid is the water born of the *Heavenly One*. Once the body of *prior Heaven* is ruptured, the function of *after Heaven* proceeds; and once the function of *after Heaven* proceeds, the truth of *prior Heaven* recedes ever further.\n\nSuch is the marvel of creation’s unfolding—who would deny it? I invite you to consult your teacher on this matter.”\n\n*On the Prior and Posterior Heaven*\n\n“Why does the truth of *prior Heaven* recede further once the function of *after Heaven* proceeds?”\n\nIt is said: “The truth of *prior Heaven* is invisible. Whatever is visible belongs to *after Heaven*. Now, when we speak of tears, saliva, fluids, *essence*, *qi*, blood, and humors—all these are tangible, gross substances, all belonging to *after Heaven* and thus unusable. Then we turn to *essence*, *qi*, and *spirit* to stand in their place. Yet once the function of *after Heaven* proceeds, *essence*, *qi*, and *spirit* all manifest in accordance with its operation, thereby falling into *after Heaven*. Why? Once the aperture is pierced, whatever is spoken of or employed belongs to *after Heaven*, while the truth of *prior Heaven* sinks into concealment, becoming weak, faint, and ever more attenuated, until it can no longer serve as the master of the body. When old age, sickness, death, and suffering arise, it is because the function of *after Heaven* is exhausted, while *prior Heaven* no longer remains. Thus, if one wishes to preserve the body forever, what recourse is there but *prior Heaven*?”\n\n*On Lead and Mercury*\n\nSomeone asked: “The *qi* of *prior Heaven* is called *true lead*—what is the meaning of this?”\n\nIt is said: “‘True’ is spoken in contrast to the ordinary. The true is formless, while the ordinary has form. If you insist on pursuing this matter, let me speak of its root. When *Qian* and *Kun* unite, the bodies of *Li* and *Kan* are formed. Once *Qian* and *Kun* unite, the undifferentiated body is already ruptured. Thus, in the arrangement of the *after Heaven* hexagrams, *Qian* and *Kun* are relegated to the most exalted yet useless positions, and *Li* and *Kan* take their place. For south and north are the two poles of Heaven and Earth. In the arrangement of the *prior Heaven* hexagrams, *Qian* and *Kun* originally occupied these positions. Now, relegated and unused, with *Li* and *Kan* taking their place, the function of *after Heaven* proceeds. *Li* is the sun, shining in the south; *Kan* is the moon, illuminating the north. Sun and moon exchange their radiance, and the myriad things are born. Though this is called the function of *after Heaven*, in truth it is the body of *prior Heaven* that enables it. Thus, the true *qi* of *Kan* transforms into lead—this is the water born of the *Heavenly One*. The true *essence* of *Li* transforms into mercury—this is the fire born of *Earth Two*. Lead and mercury, water and fire, are all things of the human world with names and forms. To call them *true lead* and *true mercury* is to speak of what cannot be named or perceived. Thus, we are compelled to borrow things with names and forms to approximate them, adding the word *true* to indicate that they are nothing but *yin*-*essence* and *yang*-*qi*. The *Book of Changes* says: ‘*Essence* and *qi* become things; *essence* and *qi* unite.’ When a person first comes into being, it is all the function of *prior Heaven*. Because they intermingle, the male receives *essence* and, employing *essence*, transforms; the female receives *qi* and, employing *qi*, flourishes. Employing *essence* leads to transformation, thus proceeding in accord to form a person; employing *qi* leads to flourishing, thus reversing to form the elixir. That the *qi* of *prior Heaven* is called *true lead* has its profound meaning. When the undisturbed *true lead* of *prior Heaven* governs the long-accumulated *true mercury* of *after Heaven*, they cherish and long for each other like husband and wife, mother and child, unable to bear separation—all occurring naturally. Those who do not understand why this is so, unless they thoroughly comprehend *yin* and *yang* and deeply penetrate the workings of creation, how could they speak of this?”\n\n**On Original Essence, Original Qi, and Original Spirit**\n\n“Original *qi* is lead, original *essence* is mercury—what then is original spirit?”\nIt is said: “Original spirit is *nature*, the master of *essence* and *qi*. As it dwells in duality yet remains unfathomable, spiritually penetrating yet without fixed form, it is called *spirit*. Thus, when spirit abides, *essence* congeals; when *essence* congeals, *qi* returns; when *qi* returns, the elixir coalesces—all being the function of *prior Heaven*.\n\nWhat is called *original essence* is not the *essence* of sexual congress. It is the true fluid stored in *Li*, the true liquid within the heart. What is called *original qi* is not the breath of mouth and nose. It is the true *qi* stored in *Kan*, the true *qi* within the void. What is called *original spirit* is not the spirit of thought and deliberation. It is the spirit that pervades the *Wuji*, the numinous truth before father and mother were born.\n\nMan is a single *Taiji*. *Essence* and *qi* are the *yin* and *yang* of *Taiji*, while *spirit* is the *Wuji* of *Taiji*—these are *original essence*, *original qi*, and *original spirit*.\n\nHow well did Cui Xu express it in his verse:\n*‘This essence is not the dregs of lustful desire,*\n*But the Jade Emperor’s saliva from his mouth.’*\nThe Jade Emperor is the lord of the heart;\nsaliva from his mouth is the numinous liquid within the heart.\n\n*‘This qi is not the breath of inhalation and exhalation,*\n*But rather the mist of primordial simplicity.’*\nThe mist of primordial simplicity is the true *qi* of *prior Heaven*.\n\n*‘This spirit is not the spirit of thought and worry,*\n*But one that stands shoulder to shoulder with the Primordial Sovereign.’*\nThe Primordial Sovereign is the Primordial Beginning.\nThis is the true *Wuji*, pervading heaven and earth, penetrating the cosmos, majestically solitary in its supremacy, transcendent in its solitary movement.”\n\n**On the Governance of Spirit**\n\n“How does one know that spirit governs essence and *qi*?”\n\n“Consider the postnatal aspect of the body. When the spirit is overly startled, essence scatters and palpitations arise; when the spirit is excessively lustful, *qi* dissipates and impotence follows. Thus, when spirit abides in essence, it is called *essence-spirit*; when spirit abides in *qi*, it is called *spirit-qi*. Essence and *qi* attain supremacy through spirit, just as ministers attain honor through their lord. Therefore, those who cultivate the truth must above all nurture the spirit. Spirit is nature; when nature is settled, spirit naturally rests; when spirit rests, essence naturally abides; when essence abides, *qi* naturally arises. Why is this so? When nature is settled, the fire of the heart does not flare upward; when fire does not flare, water does not dry up, and thus the essence within the body abides. The essence of the five viscera and six bowels is all water. When the essence within the body abides, the essence in the kidneys may be known. The kidneys are the storehouse of essence; when essence flourishes in the kidneys, accumulated water generates tides, billowing upward like clouds and mist, steaming the four great elements and irrigating above and below. When I employ primordial spirit to regulate its movement, ascent and descent, advance and retreat become as effortless as turning the palm. This is called the *Intercourse of Water and Fire* to achieve *Completion*, the postnatal *qi* attained in a state akin to intoxication. Yet this speaks only of the postnatal aspect of our body. As for the function of the prior Heaven, its gathering and union, its shedding of the womb and transformation of spirit, are of the primordial One and not the work of spirit. Thus, those who cultivate the truth must above all refine the spirit. Refining the spirit is called *jade liquid refinement of the self*, the means by which the Great Dao achieves both beginning and end.”\n\n**On Golden Liquid and Jade Liquid**\n\n“The alchemical method speaks of *golden liquid refining the form* and *jade liquid refining the self*—what is their purport?”\n\n“Dao is the concurrent cultivation of nature and life, the wondrous union of form and spirit. *Golden liquid refining the form* refers to the completion of life; *jade liquid refining the self* refers to the completion of nature. What is *jade liquid*? Jade is a metaphor for warmth, moistness, integrity, and purity. Gold is a term for firmness, hardness, and indestructibility. Refining nature means diminishing again and again, eradicating self-interest, striving to attain warmth, moistness, integrity, and purity, and emulating jade in virtue—thus the inner refinement matures. Once inner refinement is mature, one may approach the furnace to gather the medicine and perform the work of a moment. When the time arrives and the mechanism stirs, one draws from *kan* to fill *li*, gathers lead to subdue mercury. The single yang line within *kan* is the prior-Heaven *qian* metal, called *golden liquid*. Refining the form with it transforms the body into pure yang, rendering the physical frame eternally firm, like gold—hard and indestructible. Thus it is said: *gold refines jade*. This is the concurrent cultivation of nature and life, the wondrous union of form and spirit. Jade refinement is the way of non-action; gold refinement is the technique of action. Proceeding from non-action to action, and after action returning to non-action, the principle of nature and life is attained, and the work of sagely cultivation is complete.”\n\n**On Nature and Life**\n\n“What is *xing*? What is *ming*?”\nIt is said: “*Xing* is the single source of the myriad things; *ming* is what one establishes for oneself. *Xing* cannot manifest without *ming*, nor can *ming* be efficacious without *xing*. *Xing* governs *ming*, while *ming* carries *xing*. Those who discourse today commonly divide *xing* and *ming* into separate schools, unaware that Dao and vessel ride upon one another, that being and non-being give rise to each other, that the empty and the full engender one another—there is no bifurcation into two. Thus, *xing* is spirit, while *ming* is essence and *qi*; *xing* is the *Wuji*, while *ming* is the *Taiji*. Can they be separated?\n\nSome say the Buddhists comprehend *xing*, while the Daoists comprehend *ming*. This is not a comprehensive view. The Buddha’s teaching of ‘no-self’ shatters the view of clinging and attachment; the Daoist teaching of ‘guarding the mother’ honors the nameless beginning. If one does not know *xing*, how can one know *ming*? Once *ming* is known, can *xing* be abandoned? Thus, to discourse on *xing* without sinking into emptiness is to have *ming* within it; to guard the mother and return to simplicity is to have *xing* within it. This is called ‘comprehending *ming* through the ground of *xing*’—it is the wondrous union of form and spirit, the merging with the true Dao.”\n\nSomeone asked: “Your discourse on *xing* and *ming* is already clear and exhaustive. May I ask: what is *xing* in a person? What is its substance? Can it be seen?”\nIt was said: “*Xing* cannot be seen. What enables seeing is *xing* itself. To seek what enables seeing in what cannot be seen is to distance oneself further from *xing*. Why? *Xing* as a thing can be seen without intent, but cannot be sought with intent. Of old, the Old Sage spoke of the Great Simplicity as nameless; the Yellow Emperor sought the Dark Pearl in the formless. The ancients’ metaphors carried profound meaning.\n\nLet me speak of how a person comes to be! The true *Wuji* and the essence of the Two and Five wondrously unite and congeal. What is called *xing* is the *Wuji*; what is called *ming* is the essence of the Two and Five. When these two wondrously unite, a person begins to live. Before birth, what is called the *Wuji* is a chaos of primordial vastness—what form, what name? What sound, what thread? What scent, what voice?”\n\nWhen the Two and Five have congealed and attained the One to become numinous—what thought, what action? What care, what scheming? This is the original substance of *xing*. Yet once the passions and consciousness arise, the original substance is chiseled away.\n\nMaster Zhang said: “Only after form does there arise the *xing* of *qi* and material disposition. By returning to goodness, the *xing* of Heaven and Earth is preserved.” What he called passions and consciousness is the *xing* of *qi* and material disposition; what he urged us to relinquish is the original substance, which is the *xing* of Heaven and Earth. Laozi said: “Return to the uncarved block, return to the infant, return to the *Wuji*.” This is what it means to return to goodness. Thus the essential task of cultivating the Dao is nothing before refining *xing*. When *xing* is settled and the *qi*-disposition is at peace, it cannot burden one—then the original substance appears.\n\nMy teacher’s poem says:\n*“Not deluded, *xing* abides of itself;\n*xing* abiding, *qi* returns of itself.\n*Qi* returning, the elixir congeals of itself;\nwithin the crucible, Kan and Li unite.”*\n\nThis is the posterior heaven attaining the prior heaven and wondrously employing it. This is what it means to complete *ming* by means of *xing*.\n\n**On the Disposition of *Xing***\n\n“There is only one *xing*—why then the distinction between original *xing* and material *xing*?”\n\nI say: “Original *xing* is spoken of from the prior heaven. It is pure, still, luminous, and complete, perfectly endowed from the beginning. The sage does not add to it; the fool does not diminish it. Material *xing* is spoken of from the posterior heaven. It arises from the self-interest of form and *qi*, and thus begins the distinction between purity and turbidity, thickness and thinness.\n\nMoreover, the transformations and combinations of the Two and Five give rise to the ten thousand differences among beings. Their unevenness and admixture originate in the moment of conception when *qi* is received. Why? From the beginningless beginning until today, we have all used passions and desires to distort the original root of *ming*. Pursuing circumstances, we generate thoughts; encountering things, we produce emotions. This habituation has lasted long. In the meantime, the *qi* received may be pure or mixed, so cravings and desires vary in depth. None fail to borrow the original *xing* to enact their self-interested ends.\n\nMaterial *xing* in a person cannot act on its own. What acts always borrows numinosity from the original *xing*—like a haughty servant or a bastard son borrowing the master’s authority to issue commands. Thus I often use this metaphor: *Xing* is like water. When it falls into the *qi*-disposition, it is like water entering mud and mire. If you channel and direct it, you see only mud and mire, not the water. Can mud and mire move on their own? It is the water that moves them. But the water is mixed with mud and mire and thus unseen. If you settle it long enough, the clear rises to the top and the turbid sinks to the bottom. Channel and direct it again—nothing but water. This is the power of settling and returning to goodness.”**\n\n**On the Chamber of the Spirit**\n\n“Is there a difference between the original *xing* and the original spirit?”\n“Original *xing* is the original spirit—there is no difference. Because it is numinously penetrating and unfathomable, wondrously responsive yet without fixed form, it is called *shen* (spirit). It is called *original* to distinguish it from postnatal thoughts and deliberations.”\n\n“Does the spirit in a person also have a dwelling?”\n“As I learned from Master Ziqing the Immortal: a person has three valleys, which are the hollows of the original spirit and the abode of the numinous *xing*. These hollows are like valleys, hence also called *gu shen* (valley spirit). When the spirit dwells, there is life; when it departs, there is death. By day it engages with things; by night it engages with dreams. The spirit cannot rest in its dwelling.\n\n*The Spiritual Pivot of the Inner Canon* states: ‘The celestial valley holds the original spirit; guard it to preserve your true nature.’ Within the human body, the upper is called the celestial valley—this is the *niwan* (muddy pellet); the middle is called the responsive valley—this is the *jiangong* (crimson palace); the lower is called the numinous valley—this is the *guanyuan* (pass of origin). These three valleys are where the spirit resides, called the three fields.\n\nI have discussed them thus: the *niwan* is the original palace where the spirit abides; the *jiangong* is the bright hall for issuing decrees; the *linggu* (numinous valley) is the secluded chamber for cultivation and refinement. Therefore, when the original spirit resides in the *jiangong*, the ears hear, the eyes see, the five senses perform their duties, and the hundred parts of the body follow its commands. When the original spirit resides in the *linggu*, vision turns inward, hearing withdraws, spirit and *qi* guard each other, and the *ying* and *po* souls embrace unity.\n\nMaster Yangzi said: ‘Conceal the heart in the abyss to beautify its numinous root.’ The abyss is the deep, obscure, unfathomable place—this is the *linggu*, where the spirit is concealed.”\n\n**On the River Chariot**\n\nWhen the spirit is thus concealed, this is called returning to the root. Returning to the root is called quiescence; quiescence is called the restoration of life. Then spirit and *qi* guard each other, embracing unity without separation. When quiescence reaches its utmost and movement arises, this is the spirit. It then rides the mechanism of *qi* and ascends to the *niwan*, at which point the path of the river chariot begins to open.\n\nKnow that the route of the river chariot is none other than the *ren* and *du* meridians before and behind the body. When *qi* first ascends, it arises gently and billows, steaming between the two kidneys, vast like the rising tide, fluid like melting ice. Overflowing above the five *shu* points, it courses like water spilling beyond its channels. I swiftly guide the spirit to turn back to the *weilü*, causing it to ascend along the *weilü*, pass through the *jiaji* double gates, rise to the *fengfu*, and reach the *niwan*. When spirit and *qi* meet here, their free flow and fusion are self-evident. After a moment, descending as fresh and sweet fluid, it travels down from the *chonglou*, through the *jiangong*, enters the *ziting*, and returns to its place of concealment to rest. In this ceaseless circulation and infusion, over time and with mastery, *qi* fills the three fields, and above and below communicate in harmony—this is what is meant by “always let *qi* surge through the joints, and naturally essence will be full and the valley spirit preserved.” At this stage of creation, the signs of internal refinement appear. Yet without profound attainment and true realization, how could one know the savor of my words?\n\n**On Clarifying the Spirit**\n\n“You have spoken of the dwelling where the spirit is concealed, and I have received your instruction. May I ask about the essence of concealing the spirit?”\n\n“To conceal the spirit is to congeal the spirit. The essence of congealing the spirit lies first in clarifying the spirit; the essence of clarifying the spirit lies first in dispelling desires. The *Classic of Purity* says: ‘Dispel desires, and the heart becomes still; clarify the heart, and the spirit becomes clear.’ The *Book of Changes* states: ‘The sage uses this to wash the heart and retreat to conceal it in secrecy.’ This ‘washing the heart’ is precisely what clarifying the spirit means. Master Zhou said: ‘Without desires, there is quiescence.’ This ‘without desires’ is the utmost of dispelling desires.\n\nThe spirit of man delights in clarity, yet the heart disturbs it; the heart of man delights in stillness, yet desires drag it away. What is called the heart has two aspects: the heart that disturbs the spirit is the deluded heart; the heart that delights in stillness is the true heart. If there is a deluded heart, it startles the spirit—how can the spirit remain clear? Once the spirit is startled, it clings to the myriad things; once it clings to the myriad things, craving arises; once craving arises, vexation follows; vexation and delusion bring sorrow and harm to body and mind—how can the heart remain still?\n\nThus, the essence of clarifying the spirit lies first in dispelling desires. To dispel them, inwardly observe the heart—there is no heart, for the three hearts cannot be grasped. Outwardly observe the form—there is no form; observe things from afar—there are no things, for the four marks are all forgotten. Once these three are awakened to, only emptiness is seen, and the person is empty. When emptiness is empty of itself, and what is emptied is also empty, and even emptiness is empty, then there is profound and constant stillness—this is the emptiness of dharmas. Thus, the roots and dust are forever stilled, the six desires do not arise, and the heart is still. When the heart is still, the spirit becomes clear, like water without waves, vast and limpid.\n\nMaster Xujing’s *Song of the Great Dao* says: ‘To keep the spirit within the body from departing, do not let a single thing remain in the numinous terrace. When things abide in the heart, the spirit is not clear, and true essence is wasted, harming sinews and bones.’ The teaching of dispelling desires and clarifying the spirit awaits the sage of a hundred generations—my words will not change.”\n\n**On Nurturing the Spirit**\n\n“Since the spirit is already clarified, what more can be added?”\n\n“Nurture it. To nurture it is to sheathe the spirit’s radiance so that it does not reveal itself. As a thing, the spirit becomes clearer the more it is clarified, and brighter the clearer it is. For stillness can generate wisdom, and thus numinous light shines forth, illuminating all without obstruction. *Zhuangzi* says: ‘In perfect quiescence, there is a heavenly radiance.’ Yet if it is used without cease, it becomes too exposed and harms one’s original nature. *Zhuangzi* also says: ‘Those who cultivated the Dao in ancient times nurtured tranquility with wisdom.’ Wisdom arises, but it is used as if it were tranquility—this is called nurturing wisdom with tranquility.\n\nThe *Pivot of Sitting in Forgetfulness* says: ‘Wisdom unused is true wisdom, like foolishness; it enriches both stillness and wisdom, a double beauty without end.’ The *Dao De Jing* says: ‘Profound, it is like uncarved wood; turbid, it is like muddy water.’ And again: ‘The multitude are bright and clear; I alone am dull. The common folk are sharp and keen; I alone am muddled.’ These are all essential teachings on nurturing the spirit.”\n\n**On Congealing the Spirit**\n\n“Since the spirit is already nurtured, why concern oneself with congealing it?”\n\n“Congealing the spirit refers to the use within non-use, the study of fulfilling life. The *Cantong Qi* says: ‘Manage and nurture the *yinqiao*, congeal the spirit to form the body.’ Moreover, cultivating concentration in the *ligong* is the essence of meditation; seeking the mysterious in the water palace is the aim of alchemy. Clarifying the spirit is essential, but congealing the spirit is urgent.\n\nThe *Cui Xu Yin* says: ‘Long ago, I met my teacher and received the oral transmission: simply congeal the spirit and enter the *qi* cave.’ This *qi* cave is none other than the *yinqiao* within us. In my earlier *Treatise on the Chamber of Spirit*, this was already made clear and exhaustive.\n\nI fear that scholars may know only how to clarify the spirit but not where to congeal it, thus wandering without a destination and unable to meet the origin of returning to the root and restoring life. Or they may know only how to nurture the spirit but not the method of congealing it, thus lacking a starting point and unable to fathom the subtleties of creation’s ebb and flow. Therefore, I set forth what I have heard and compose this treatise.”\n\nThe congealing of spirit is the essential principle of entering the Dao and the foremost tenet of the alchemical tradition. What is meant by \"congealing\" is not stagnation or immobility, but rather the spirit entering the *qi* cave and abiding with it without separation. Laozi said: *\"Bearing *yin* and embracing *yang*, can you keep them from parting?\"* The *qi* cave is that which we receive at the inception of our embryonic *qi*, formed from the essence and *qi* of our parents—it is the Supreme Ultimate inherent in each of us. Its names vary: *qi* sea, Pass of Origin, Spirit Valley, Lower Field, Heavenly Root, Stem of Life, Cavity of Returning to the Root, and Pass of Restoring Life—yet it is one and the same place.\n\nWhen we dwell in the womb, our breath and *qi* commune with our mother. Once the umbilical cord is severed at birth, we establish our own furnace and cauldron, setting apart our own heaven and earth, and with every inhalation and exhalation, *qi* invariably returns to this original cavity. Breath is the foundation of our life: if in a single breath, inhalation and exhalation cease, *qi* is cut off and death ensues. Exhalation is the expansion of *qi*, the unfolding of *yang*; inhalation is the contraction of *qi*, the gathering of *yin*. One exhalation and one inhalation make a single breath. Physicians use this to assess *qi*—and rightly so. Zhuangzi said: *\"The breath of the multitude reaches only to the throat, but the breath of the perfected reaches to the heels.\"* \"Reaching to the heels\" means penetrating deeply into the cavity. The multitude’s breath does not fail to reach the heels, but with the spirit unattended, though *qi* moves in and out, they remain unaware, as if it were merely at the throat. The perfected, however, rest their spirit upon the breath, penetrating deeply into the original cavity, continuously abiding without the slightest interruption. Thus, they concentrate *qi* to attain suppleness, embrace the One without separation, and in utter emptiness and profound stillness, observe the return.\n\nThis \"resting\" is not clinging to the breath but entails a sense of neither forgetting nor forcing. Therefore, when the spirit rests upon the breath, it congeals; when the spirit congeals, *qi* also congeals. When the spirit rests upon the breath, it harmonizes; when the spirit harmonizes, *qi* also harmonizes—this is the principle of mutual dependence. The method of congealing spirit begins with regulating the breath. Regulating the breath means resting upon it.\n\n**Treatise on True Breath**\nBreath is of two kinds: ordinary breath and true breath. Ordinary breath is the *qi* that enters and exits through the mouth and nose; true breath is embryonic breath, circulating within the original cavity. This is what Master Huiweng described as *\"gently exhaling, like a fish in a spring pond.\"* When ordinary breath ceases, true breath stirs of itself. That ordinary breath ceases is not due to deliberate suppression; rather, in utter emptiness and profound stillness, the heart grows ever more refined, and *qi* ever more subtle.\n\nThose who discuss this today know only of regulating the breath but fail to recognize the pitfall of chasing *qi* with the heart. This is because the restless, competitive mind of the ordinary person is untrained in regulation. If one is suddenly made to rest upon the breath, how can the heart willingly comply? Inevitably, it becomes contrived. When contrived, *qi* is not yet settled, but the heart is already stirred—is this not once again using *qi* to enslave the spirit? Thus, I say: *\"Regulating the breath means naturally resting upon it, not chasing after it.\"* Regulating the breath begins with regulating the heart. Regulating the heart means gathering the thoughts to stillness, so that in movement and stillness, waking and sleeping, they always reside within the cavity. With long practice, habit becomes nature, and one is naturally cleansed and softened, harmonizing with the breath. In harmony, there is resting; resting without chasing. Ordinary breath ceases of itself, and true breath stirs of itself. The bellows are set in motion, refining essence into *qi*, which rises and suffuses the Three Palaces. This is the true bellows, the true cauldron and furnace, the true firing times.\n\n**Treatise on the Fire Symbol**\n\n“Is there an explanation for taking true breath as fire?”\n\n“There is. The ancient immortals’ words abound, such as:\n*‘Do not idly watch the medicine furnace for firing times—*\n*Simply settle the spirit and rest in breath as it naturally is.*\n*Cease striving at the elixir hearth and river chariot;*\n*The crane’s embryo and tortoise’s breath will stretch on of themselves.’*\nYet these do not mean taking breath itself as fire.\n\nFire is the fire of spirit; breath is but the bellows of that fire. When spirit and *qi* guard one another, the spirit remains in non-doing, while the mechanism of *qi* cannot but move. Thus, with each closing and opening, it flows in unbroken circulation through the meridians. What perceives this movement? The spirit. As the single *qi* circulates, the primordial spirit alone awakens. When spirit and *qi* merge, tension and ease find balance—this is the evenness of fire’s power, and only then is the elixir completed and the medicine achieved.\n\nI have likened the bellows to true breath, and there is reason in this. Consider the smith who casts metal: he must first work the bellows, and only then does the fire ignite and the metal begin to melt. If one merely blows with a gusting wind, the fire scatters, and the metal will never transform. Why? Because a gusting wind comes and goes without constancy—this is the breath of ordinary men through the throat. The bellows’ wind, however, stretches on unbroken—this is the true person’s breath through the heels. When spirit rests upon breath and they fuse, it is as fire receiving wind; when *qi* is guided by spirit and transforms of itself, it is as metal melting in fire. Such is the clarity of this analogy!”\n\n“Someone asked: ‘The fire-tally advances and retreats, now *tun* at dawn, now *meng* at dusk—are their principles the same or different?’\n\nI replied: ‘In the past, before receiving my teacher’s instruction, I privately considered the fire-regimen difficult to discern. I once tried to measure it by the celestial revolution, to align it with the hexagrams and *qi*, to divide it by watches and clepsydra drops—all to no avail. Only afterward did I suddenly awaken in great clarity. Then I understood that the ten thousand volumes of elixir classics and the six hundred fire-records could all be set aside at a single word. The saying that true fire has no regimen and the great medicine no fixed weight is indeed true—it did not deceive me.\n\nRefining the medicine has inner and outer aspects, and thus the fire-regimen has complexity and simplicity. What is called inner refinement may be summed up in one phrase: “as if preserved in brocade-woven continuity.” The outer medicine here is not the outer medicine discussed earlier; rather, it refers to the celestial and terrestrial origins. The tally is so named because it accords with the Dao of Heaven.\n\nIn elixir methods, the *geng* and *jia* of the moon symbolize the maturity or tenderness of the medicinal material; the *zi* and *wu* of the sun mark the waxing and waning of the fire-regimen. The phrases “*tun* at dawn, *meng* at dusk” merely describe the principle of its advance and retreat—nothing more. Once the meaning is grasped, the image may be forgotten.\n\nThe *Wuzhen pian* says:\n*“The inner medicine is still the outer medicine;\nInner penetration requires outer penetration as well.\nThe elixir-head blends in kindred harmony—\nTwo nurturing functions, one in warmth, one in action.\nWithin, there is the natural true fire,\nThe furnace ever glowing crimson.\nWithout, the furnace’s increase and decrease demand diligent effort—\nNothing surpasses the true seed in wondrous subtlety.”*\n\nThe true seed is the human origin. This is the final verdict on the fire-tally.”\n\n“Are medicine and fire the same or different?”\n\nIt is said: “Medicine and fire may be distinguished, yet they may also unite. When separated, they differ; when joined, they are one. Why? Speaking of them as distinct: medicine is the primordial qi, while fire is the primordial spirit. Speaking of them as united: medicine is fire, and fire is medicine. To know only their union and not their distinction is to fail in the gathering and refinement; to know only their distinction and not their union is to lack method in the nurturing and warming.\n\nWhy? At the time of gathering and refinement, medicine lies without while fire resides within—fire draws forth the medicine, so medicine and fire may be distinguished. In the phase of nurturing and warming, medicine, though initially without, returns within, and with the medicine, fire is activated—thus medicine and fire may unite.\n\nIn essence, fire is the master: if fire is too fierce, the elixir is harmed; if fire is too cool, the elixir scatters. When fire is spoken of without mention of medicine, it refers to the work of the ten months; when medicine is spoken of without mention of fire, it refers to the labor of a brief moment.\n\nAs the Purple Clarity Immortal Master said: ‘Refining medicine with fire to form the elixir’—this is precisely ‘directing qi with spirit to attain the Dao,’ a statement most clear and incisive.”\n\n**On Withdrawal and Addition**\n\nSomeone asked: “May I hear the principle of withdrawing lead and adding mercury?”\n\nIt was said: “I have heard from Master Li Yang that after obtaining the medicine and returning it to the crucible, one nurtures it with the natural true fire, continuous and unceasing as if present. The transformations of withdrawal and addition within arise naturally, allowing no trace of human artifice or force to intervene.”\n\nFor the Dao is non-action, yet spirit and qi naturally act—such is the marvel of creation. The saying \"like cooking rice from grain\" contains profound meaning, not merely an analogy for ease. When lead is added to mercury, it is like water poured into rice. The water must not be excessive, nor the rice too scant, just as the two eights must correspond. When the fire’s strength is evenly regulated, the water gradually dries while the rice swells, and thus rice is made. The gradual drying of water is what is meant by \"withdrawing lead\"; the swelling of rice is what is meant by \"adding mercury.\" Withdrawal is not internal reduction: spirit enters qi as heaven’s qi moves through earth, its hidden mechanism unseen. Addition is not external increase: qi envelops spirit as earth’s qi receives heaven, gradually nurturing growth. Through this, the embryo is perfected and spirit transforms, giving rise to a body beyond the body. The marvel of creation reaches this point—all unfolding naturally, with no knowing how it comes to be. If one seeks to grasp the *how* of withdrawal and addition, one falls into intentionality and ceases to be natural. This \"naturalness\" too holds profound meaning. My master told me: \"Follow the natural, do not merely heed it.\" How profound these words!\n\nOne asked in *Legacy Discourse*: \"The various alchemical scriptures speak of 'cinnabar lead,' 'black mercury,' 'Azure Dragon,' 'White Tiger,' 'White Snow,' 'Yellow Sprout,' 'Wood Duke,' 'Metal Mother,' 'Infant Girl,' and 'Yellow Dame'—so many disparate names and terms that their enumeration would exhaust even a multitude of scribes. Yet in your writings, you set all these aside and say nothing of them. Does this mean you intend to leave some discourse unspoken?\"\n\nI replied: \"No. Listen quietly, and I shall try to explain. In the past, I was a scholar versed in the exegesis of the classics, my learning confined to the outer gardens of the mysterious. I lacked the innate capacity to perceive what lay beyond. By chance, through karmic conditions, I encountered the true teaching and received its transmission, gaining some understanding of its direct and essential path. All the names and terms you mentioned, I once studied thoroughly and pondered deeply. Yet grasping one while losing sight of another only led to obstruction and conflict. Only later did I come to know that the great Dao is not cumbersome—it can be encompassed in a single word.\n\nThe Dao is nothing other than the interplay of yin and yang. Yin is essence, yang is qi, and spirit governs both. Thus, spirit, qi, and essence are the three grades of the supreme elixir. All the various names—Dragon and Tiger, lead and mercury—are established in reference to these. The ancient immortals, in transmitting their teachings, did not wish to reveal them lightly. Thus, they scattered their words through countless apertures, creating a profusion of gates, so that earnest students might arrive at meaning through text and attain simplicity through breadth. When the celestial truth has been cultivated over time and suddenly penetrates through, then the trappings of language fall away, and the root is directly perceived.\"\n\nAnother asked: \"In *Mysteries of the Profound*, you discuss the 'external elixir' at length. Yet regarding the gathering, refinement, and union of the medicines, you say little. How are learners to proceed?\"\n\nI replied: \"The gathering, refinement, and union of the medicines are the most recondite mysteries of the Most High, the essential heart-mind transmitted by a thousand sages. I do not refrain from pointing them out and speaking of them, but my master’s injunctions are strict, and so as I write, I tremble with apprehension. Yet in what I have already discussed, I seem to have already revealed the key—though concealed within subtle words, it may go unnoticed. As the *Canticle* says: ‘After a thousand cycles, brilliance shines forth; after ten thousand repetitions, it may be beheld.’ If earnest students can persist through a thousand cycles and ten thousand repetitions, then through deep inquiry, the wondrous meaning will become apparent.\n\nYet without the frustration of seeking and not yet attaining, who would know the difficulty of encountering the Dao? And without the delight of mutual understanding and the marvel of comprehension, who would find savor in my words? Enough, enough—I shall now hold my tongue.\"",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "玄肤论 自序 《玄肤论》者，陆生所述也。 陆生既闻性命之学于圣师，豁然有契于其衷，乃述所传，为论二十篇，总七干余言，名曰《玄肤》。 玄肤者，言玄理肤浅，非精诣也。 去圣愈远，大道失传，狂瞽之师，各售所见。 类皆窃近似以文神奸，故有口禅之衲，兢斗机锋，垄断之夫，纵谈黄白，人元则以闺丹首乱，服食则以金石戕生，学术不明，流祸无极，仁者悯焉！ 始生以文儒究心二氏，垂二十年，错足无虞之林，置身不理之口，屡踬屡奋，独以初诚不退，获兹遭遇也。 夫性由自悟，命假师传。 兹二语者，尚有遗论。 何则？ 自性自度者．虽上根利器，亦须领悟于言下，藉非密旨亲承，徒师心以自用。 犹之瞽不任杖，伥伥何之乎？ 道之不得闻者，其故有三，朵二朵颐世味，以妄为常，虞有耽空，害有之侮者，名曰不信之心； 少知向慕，（上四中口下月）挂俗网，不即解脱，姑置而少持者，名曰不了之心； 具曰子圣，不售善言，高谈雄论，千人自废者，名曰不虚之心。 三者有一焉，圣师不顾也，良友不亲也。 因循积习，没齿无闻，毙而后已，殊可哀也！ 生为此惧，早夜遑遑，不敢自弃。 是以摒去妄心，沉潜至道也。 静养之暇，仰思圣师诲谕之旨，聊复述之篇章，冒犯忌讳，所不敢辞。 要在开示真宗，流通正脉，使人知乡道而已。 或谓古人着书，多道成之后，子急于有言，无乃躁乎？ 吾闻太上立德，其次立言，言之不可已也。 吾为其次者，夫道则进于德矣。 进于德，不言可也。 夫德窃有志焉，而未之逮也。 隆庆元年岁在丁卯重九日。 三元论 愚闻之师曰；",
      "translated_text": "**Preface to *On the Subtle and the Shallow***\n\n*On the Subtle and the Shallow* is a work compiled by Master Lu. Having received the teachings of nature and destiny from his sagely teacher, he experienced a profound resonance within and thus recorded the transmitted doctrines, composing twenty chapters totaling over seven thousand characters, entitled *On the Subtle and the Shallow*.\n\n\"Subtle and shallow\" signifies that the profound principles are but superficially expounded—far from the essence of true attainment. As the age grows ever more distant from the sages, the great Dao has been lost in transmission. Blind and reckless masters peddle their own views, most of whom pilfer superficial resemblances to embellish their cunning deceptions. Thus, there are those who, clad in monastic robes, engage in verbal sparring with their \"chan\" wit; those who monopolize discourse, boasting of alchemical gold and silver; those who, in their pursuit of human vitality, first corrupt it with chamber elixirs; and those who, in their quest for longevity through ingestion, instead ravage their lives with minerals and metals. With the Way obscured, the calamities spread boundlessly—how pitiable this is to the benevolent!\n\nIn my early years, I, the author, devoted myself to the study of the Two Teachings as a scholar of letters, spending nearly twenty years wandering through the thickets of error, entangled in the snares of idle chatter. Though I stumbled repeatedly, I never abandoned my initial sincerity, and thus I was granted this encounter.\n\nNature is realized through self-awakening, but destiny relies on transmission from a teacher. These two statements, however, still leave room for further discussion. Why? Even those of superior capacity and keen insight must attain sudden enlightenment through words; without receiving the esoteric instructions in person, relying solely on one’s own judgment is like a blind man refusing a staff—where can he go? There are three reasons why the Dao remains unheard:\n\nFirst, those who indulge in worldly pleasures, mistaking delusion for the norm, or who cling to emptiness, scorning the practical—these suffer from a heart of disbelief.\n\nSecond, those with some aspiration who admire the Way but remain entangled in the web of convention, delaying liberation while half-heartedly holding on—these suffer from a heart of incomprehension.\n\nThird, those who claim sagely wisdom yet reject good counsel, engaging in lofty discourse that intimidates others into silence—these suffer from a heart of arrogance.\n\nIf any of these three afflictions are present, the sagely teacher will not turn his gaze, nor will the true friend draw near. Habitual negligence accumulates, and one may pass a lifetime in ignorance, meeting death without ever having heard the truth—how lamentable!\n\nFearing this fate, I have been restless day and night, never daring to abandon myself. Thus, I have cast aside delusive thoughts and immersed myself in the profound Dao. In moments of quiet cultivation, reflecting on the teachings of my sagely teacher, I have ventured to record them in these chapters, undeterred by the risk of transgressing taboos. My aim is to reveal the true source, circulate the correct lineage, and guide others toward the Dao.\n\nSome may say that the ancients wrote books only after attaining the Way—is your haste to speak not a sign of impatience? I have heard that the highest path is to establish virtue, and the next is to establish words. When words cannot be withheld, one must speak. I am but one who follows the latter path, for in speaking of the Dao, I advance toward virtue. If one has already advanced in virtue, silence may suffice. Yet I, though aspiring to virtue, have not yet attained it.\n\nWritten on the ninth day of the ninth month in the first year of the Longqing era (1567), the year of *dingmao*.\n\n**On the Three Origins**\n\nI have heard from my teacher: ...",
      "overlap_context": "",
      "start_char": 1,
      "end_char": 628,
      "start_sentence": 0,
      "end_sentence": 29,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.503380298614502,
      "metadata": {
        "source_file": "dao\\藏外\\玄肤论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "“丹有三元，皆可了命。 ”三元者，天元、地无、人元之谓也。 天元谓之神丹。 神丹者，上水下火，炼于神室之中，无质生质，九转数足，而成白雪。 三年加炼，化为神符。 得而饵之，飘然轻举。 乃药化功灵，圣神之奇事也。 其道则轩辕之龙虎，旌阳之石函，言之备矣。 地元谓之灵丹。 灵丹者，点化金石，而成至宝。 其丹乃银铅砂汞有形之物，但可济世，而不可以轻身。 九转数足，用其药之至灵妙者，铸这神室，而以上接乎天元。 乃修道之舟航，学人之资斧也。 古今上圣高真，名为圣事，其法至易至简，不过采先天之铅，伏后天之汞，识浮沉，知老嫩而已。 今之盲师，率多昧此，故千举万败，迄以无成。 不知地元之道，与人元不殊。 必洞晓阴阳，深达造化者，而后可以语此。 人元者，谓之大丹。 大丹者，创鼎于外，炼药于内，取坎填离，盗机逆用之谓也。 古者高仙上圣，莫不由之。 故了命之学，其切近而精实者，莫要于人元。 故丹有三元，系于天地鬼神而不可以必得者，天元也； 法度修明，福意双美，举之而如取如携者，地元也； 宇宙在手，万化生身，鬼神不能测其机，阴阳不能逃其算者，人元也。 然则亦有大小乎？ 曰：“愚闻之师，天包乎地，地载乎人，大小见矣，是三元之品也。 ” 内外药论 夫人元之学，创鼎于外，而炼药于内，于是始有内药外药之分。 而世之言外药考，率多不得其旨，以盲引盲，殊可悼痛！ 夫道在我身，内炼城是矣，而何以创鼎于外？ 创鼎者，圣人不得已焉而为之之事也。 老圣比之用兵。 其言曰：“夫兵者，不祥之器，圣人不得已而用之。 ”且夫上药三品，神与气、精，凡吾所具于先天者，浑沦未凿，何假修炼？ 故童初之子，皆圣胎也。 自夫情窦一开，而浑沦之体破矣！ 浑伦之体既破，则丹吾身之所有者，日改月化，动皆落于后天。 后天之物皆属于阴，其法不能以久存，不得不假夫同类之先天者以补之。 而同类之先天则太阳乾金也。 以阳炼阴，形乃长存。 《契》有之曰：“欲作服食仙，须求同类者。 篱破竹补，覆鸡用卵。 ”如斯而喻，甚明切也。 然又须知彼我之气，同一太极之所分。 其中阴阳之精，互藏其宅，有不可以独修者。 《易》曰：“一阴一阳之谓道。 ”“同声相应，同气相求，”《契》曰：“冠婚气相纽，元年乃芽滋。 ”造化之理，顺则成人，逆则成丹。 神妙自然，不可诬也。 炼药于内，而创鼎于外，岂直补吾身之缺而已哉？ 阴阳互藏论 “《契》曰：‘天地设位，而易行乎其中矣。 ’《易》谓离坎。 《悟其》之诗曰：‘先把乾坤为鼎器，次搏乌免药来烹。 ’乾坤，则阴阳之象也； 乌兔，则阴阳之精也。 离为日，日秉阳精，而离之中画却是阴，是阴藏于阳之宅也； 坎为月，月秉阴精； 而坎之中画却是阳，是阳藏于阴之宅也。 《契》曰； ‘坎男为日，离女为月。 ’盖言此也。 是知乾坤者，阴阳之纯也； 坎离者，阴阳之交也。 其在人也，情窦未凿之先，一乾坤纯阴纯阳之象也； 既凿之后，阴阳之体交，而互藏之精用矣。 少阴之数八，男子得之，故二八而精通； 少阳之数七，女子得之，故二七而天癸至。 岂非阳得阴数，阴得阳数，而互藏之义，斯以见乎”",
      "translated_text": "“Elixirs possess three Origins, each capable of consummating destiny.”\n\nThe Three Origins refer to the Celestial Origin, the Terrestrial Origin, and the Human Origin. The Celestial Origin is called the *Spirit Elixir*. The Spirit Elixir is refined within the *spirit chamber* through *upper water* and *lower fire*, transforming the formless into form. After nine cycles, it crystallizes as *white snow*. Refined for three more years, it transmutes into a *spirit talisman*. Ingesting it, one ascends lightly—such is the wondrous efficacy of medicinal transformation, a marvel of sages and spirits. Its method is expounded in the *Dragon and Tiger* of the Yellow Emperor and the *Stone Casket* of Master Jingyang.\n\nThe Terrestrial Origin is called the *Numinous Elixir*. The Numinous Elixir transmutes metals and minerals into supreme treasures. Composed of tangible substances like silver, lead, cinnabar, and mercury, it serves worldly needs but cannot confer bodily transcendence. After nine cycles, its most potent essence is forged into a *spirit chamber* to connect with the Celestial Origin—thus serving as the vessel and provision for Daoist cultivation. The methods of the ancients, revered as sacred arts, are exceedingly simple: gather *precelestial lead*, subdue *postcelestial mercury*, discern *floating and sinking*, and recognize *maturity and tenderness*. Yet today’s blind masters, ignorant of this, fail a thousand times and never succeed. They do not realize that the Terrestrial Origin’s path differs not from the Human Origin. Only those who thoroughly comprehend *yin-yang* and deeply grasp the workings of creation may speak of it.\n\nThe Human Origin is called the *Great Elixir*. The Great Elixir forges the *crucible* externally while refining the medicine internally—this is the method of *taking from Kan to fill Li* and *stealing the mechanism to reverse its course*. All ancient immortals and sages achieved this. Thus, among the arts of consummating destiny, none is more immediate and profound than the Human Origin.\n\nOf the Three Origins: that which depends on heaven, earth, and spirits and cannot be assured is the Celestial Origin; that which, with disciplined practice and dual perfection of fortune and intent, is as effortless to attain as reaching for an object is the Terrestrial Origin; that which grasps the cosmos in hand, animates the myriad transformations within the body, eludes the calculations of ghosts and spirits, and escapes the reckoning of *yin-yang* is the Human Origin.\n\nYet is there a distinction of great and small? My teacher said: “Heaven envelops earth, earth bears humanity—thus the hierarchy of the Three Origins is revealed.”\n\n**On Internal and External Medicines**\nIn the study of the Human Origin, the crucible is forged externally while the medicine is refined internally—hence the division into *internal medicine* and *external medicine*. Yet most discussions of external medicine today miss the essence, leading the blind by the blind—a lamentable state!\n\nThe Dao resides within the body; internal refinement is paramount—why then forge a crucible externally? Forging the crucible is a measure sages adopt out of necessity. The Old Master likened it to deploying troops: “Weapons are inauspicious tools; sages use them only when unavoidable.”\n\nThe three supreme medicines—*spirit*, *qi*, and *essence*—are all possessed in the *precelestial* state, undifferentiated and uncarved. Thus, the unblemished child is already a *sacred embryo*. Yet once the *passion-gate* opens, the undifferentiated body shatters! With its rupture, the innate endowment of the body decays day by day, moment by moment, inevitably falling into the *postcelestial*. Postcelestial substances belong to *yin* and cannot endure; one must borrow *precelestial* counterparts of the same kind to replenish them. The precelestial counterpart is the *yang* of *Qian* metal. Refining *yin* with *yang* ensures the body’s longevity.\n\nThe *Cantong Qi* states: “To become an immortal through ingestion, seek substances of the same kind. A broken fence is mended with bamboo; a brood hen is replaced with an egg.” The analogy is clear. Yet one must also recognize that the *qi* of self and other derive from the same *Taiji*. Within it, the *essences* of *yin* and *yang* mutually reside in each other’s abodes—hence they cannot be cultivated in isolation.\n\nThe *Book of Changes* says: “The Dao consists of one *yin* and one *yang*.” “Like sounds resonate; like *qi* seeks like.” The *Cantong Qi* states: “Marriage unites *qi* as a bond; the first year sprouts growth.” The principle of creation: following the course produces humans; reversing it produces elixirs. The divine mystery is natural and cannot be falsified.\n\nRefining medicine internally while forging the crucible externally—does this merely mend the body’s deficiencies? Far from it.\n\n**On the Mutual Concealment of Yin and Yang**\nThe *Cantong Qi* says: “Heaven and earth take their positions, and the *Changes* operate within them.” The *Changes* refer to *Li* and *Kan*. The poem *Awakening to It* states: “First take *Qian* and *Kun* as the crucible; then gather the *crow* and *hare* to cook the medicine.”\n\n*Qian* and *Kun* are the images of *yin* and *yang*; the *crow* and *hare* are their *essences*. *Li* is the sun, bearing *yang* essence, yet its central line is *yin*—thus *yin* is concealed within *yang*’s abode. *Kan* is the moon, bearing *yin* essence, yet its central line is *yang*—thus *yang* is concealed within *yin*’s abode. The *Cantong Qi* says: “The *Kan* male becomes the sun; the *Li* female becomes the moon.” This is the meaning.\n\nThus, *Qian* and *Kun* are the purity of *yin* and *yang*; *Kan* and *Li* are their intermingling. In humans, before the *passion-gate* is opened, they embody the pure *yin* and pure *yang* of *Qian* and *Kun*. After its opening, the bodies of *yin* and *yang* intermingle, and their mutually concealed *essences* become operative.\n\nThe number of *minor yin* is eight; men attain it, hence their *essence* flows at sixteen. The number of *minor yang* is seven; women attain it, hence their *heavenly water* arrives at fourteen. Is this not evidence that *yang* possesses *yin*’s number and *yin* possesses *yang*’s number, revealing the principle of mutual concealment?",
      "overlap_context": "ath is to establish virtue, and the next is to establish words. When words cannot be withheld, one must speak. I am but one who follows the latter path, for in speaking of the Dao, I advance toward virtue. If one has already advanced in virtue, silence may suffice. Yet I, though aspiring to virtue, have not yet attained it.\n\nWritten on the ninth day of the ninth month in the first year of the Longqing era (1567), the year of *dingmao*.\n\n**On the Three Origins**\n\nI have heard from my teacher: ...",
      "start_char": 628,
      "end_char": 1847,
      "start_sentence": 30,
      "end_sentence": 99,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.457634925842285,
      "metadata": {
        "source_file": "dao\\藏外\\玄肤论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "或曰； “男子二八而精通，彼之破体，夫固有所感也。 女子二七而天癸至，何所感耶” 曰； “未论有感无感，但其气既至，则浑沦之体，斯已破矣。 且夫地势重阴之下，而忽有一阳来复，乃十有一月之卦也。 斯时也，天地之心果何所见？ 而夫子叹之，无亦以造化交感之气虽未氤氲，而其机斯已动乎？ 方其不动而动，动而不动之时，是谓先天真乙之气，所以为造化之根底，品汇之枢纽者，实在于是。 迨夫联兆已彰，形色已见，斯则落于滓质，而属之后天。 故吾所谓破者，乃自气机之动者而言之，非谓必待于交感氤氲而后谓之破也。 且男子之精始通也，其始未必先有滓质，必待其气先至，既乃化而为水，又既乃化而为精。 所谓先至之气，即先天也； 气化为水，叩天一所生之水也。 先天之体既破，后天之用遂行； 后天之用既行，先天之真愈隐矣。 造化之妙，发泄至此，谁曰不然，请问之师焉。 ” 先天后天论",
      "translated_text": "Some may ask: “At sixteen, a boy’s *essence* flows—his unbroken body is ruptured, yet this surely arises from some stimulus. At fourteen, a girl’s *heavenly water* arrives—what stimulus does she respond to?”\n\nIt is said: “Whether or not there is a stimulus need not be debated. Once the *qi* arrives, the primal undifferentiated body is already ruptured. Consider how, beneath the heavy *yin* of earth’s terrain, a single *yang* suddenly returns—this is the hexagram of the eleventh month. At such a time, what does the heart of Heaven and Earth reveal? Yet the Master sighed over it, did he not? Was this not because, though the *qi* of creative interaction had yet to mingle and steam, its mechanism had already stirred?\n\nWhen it moves yet does not move, and does not move yet moves—this is called the *qi* of *True Unity* prior to Heaven, the very root of creation and the pivot of all things. It lies precisely here. Only when signs have coalesced and form and color become manifest does it fall into gross substance and belong to the realm of *after Heaven*.\n\nThus, what I call ‘rupture’ refers to the stirring of the *qi*-mechanism, not to the necessity of awaiting the steaming intermingling of interaction. Moreover, when a boy’s *essence* first flows, it does not initially take gross form. The *qi* must arrive first, then transform into fluid, and only then into *essence*. The *qi* that arrives first is *prior to Heaven*; the *qi* that transforms into fluid is the water born of the *Heavenly One*. Once the body of *prior Heaven* is ruptured, the function of *after Heaven* proceeds; and once the function of *after Heaven* proceeds, the truth of *prior Heaven* recedes ever further.\n\nSuch is the marvel of creation’s unfolding—who would deny it? I invite you to consult your teacher on this matter.”\n\n*On the Prior and Posterior Heaven*",
      "overlap_context": "yin* and pure *yang* of *Qian* and *Kun*. After its opening, the bodies of *yin* and *yang* intermingle, and their mutually concealed *essences* become operative.\n\nThe number of *minor yin* is eight; men attain it, hence their *essence* flows at sixteen. The number of *minor yang* is seven; women attain it, hence their *heavenly water* arrives at fourteen. Is this not evidence that *yang* possesses *yin*’s number and *yin* possesses *yang*’s number, revealing the principle of mutual concealment?",
      "start_char": 1848,
      "end_char": 2216,
      "start_sentence": 100,
      "end_sentence": 118,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.671902656555176,
      "metadata": {
        "source_file": "dao\\藏外\\玄肤论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "“何以后天之用行而先天之真愈隐？ “ 曰：“先天之真不可见。 凡可见者，皆后天也。 今之言涕、唾、津、精、气、血、液者，皆有形滓质之物，俱属后天而不可用，则又以精气神当之。 不知后天之用既行，则精、气与神又皆随用显发，而落于后天。 何者？ 已凿之后，说着用着皆落后天，而先天之真，沉潜沦匿，孱弱微细，日就萧索，而不足以为一身之主，至于老病死苦者，后天之用竭，而先天不存也。 然则欲吾形之永固者，舍先天奚以哉” 铅汞论 或问：“先天之气为真铅，其旨安在？ ” 曰：“真者，对凡而言。 真则无形，而凡则有象也。 必欲竞其说，请言其本。 夫自乾坤交而离坎之体成矣。 乾坤交，则浑沦之体己破。 故后天卦位，退乾坤于至尊无用之地，而以离坎代之。 盖南北者，天地之两极也。 先天卦位，本乾坤所居。 今退而不用，以离坎代之，则后天之用行矣。 离为日，照耀于南； 坎为月，照临于北，日月交光，而万物生焉。 虽曰后天之用，其实则先天之体为之。 故坎之真气，化而为铅，即天一所生之水也：离之真精，化而为汞，即地二所生之火也。 铅汞水火，皆人间有名有相之物，谓之真铅真汞，则不可名不可相也。 故不得已而假有名有相之物以拟之，而加之曰真实，则阴精阳气而已。 《易》曰：‘精气为物，精与气合。 ’而人始生，皆先天之用也。 以其互藏也，故男得其精，而用精者化； 女得其气，而用气者昌。 用精者化，故顺而成人：用气者昌，故逆而成丹。 先天之气为真铅，厥有旨也。 以先天未扰之真铅，制后天久积之真汞，则其相爱相恋，如夫妇子母之不忍离，是皆自然而然。 有不知其所以然者，自非洞晓阴阳，深达造化，乌足以语此哉！ ”",
      "translated_text": "“Why does the truth of *prior Heaven* recede further once the function of *after Heaven* proceeds?”\n\nIt is said: “The truth of *prior Heaven* is invisible. Whatever is visible belongs to *after Heaven*. Now, when we speak of tears, saliva, fluids, *essence*, *qi*, blood, and humors—all these are tangible, gross substances, all belonging to *after Heaven* and thus unusable. Then we turn to *essence*, *qi*, and *spirit* to stand in their place. Yet once the function of *after Heaven* proceeds, *essence*, *qi*, and *spirit* all manifest in accordance with its operation, thereby falling into *after Heaven*. Why? Once the aperture is pierced, whatever is spoken of or employed belongs to *after Heaven*, while the truth of *prior Heaven* sinks into concealment, becoming weak, faint, and ever more attenuated, until it can no longer serve as the master of the body. When old age, sickness, death, and suffering arise, it is because the function of *after Heaven* is exhausted, while *prior Heaven* no longer remains. Thus, if one wishes to preserve the body forever, what recourse is there but *prior Heaven*?”\n\n*On Lead and Mercury*\n\nSomeone asked: “The *qi* of *prior Heaven* is called *true lead*—what is the meaning of this?”\n\nIt is said: “‘True’ is spoken in contrast to the ordinary. The true is formless, while the ordinary has form. If you insist on pursuing this matter, let me speak of its root. When *Qian* and *Kun* unite, the bodies of *Li* and *Kan* are formed. Once *Qian* and *Kun* unite, the undifferentiated body is already ruptured. Thus, in the arrangement of the *after Heaven* hexagrams, *Qian* and *Kun* are relegated to the most exalted yet useless positions, and *Li* and *Kan* take their place. For south and north are the two poles of Heaven and Earth. In the arrangement of the *prior Heaven* hexagrams, *Qian* and *Kun* originally occupied these positions. Now, relegated and unused, with *Li* and *Kan* taking their place, the function of *after Heaven* proceeds. *Li* is the sun, shining in the south; *Kan* is the moon, illuminating the north. Sun and moon exchange their radiance, and the myriad things are born. Though this is called the function of *after Heaven*, in truth it is the body of *prior Heaven* that enables it. Thus, the true *qi* of *Kan* transforms into lead—this is the water born of the *Heavenly One*. The true *essence* of *Li* transforms into mercury—this is the fire born of *Earth Two*. Lead and mercury, water and fire, are all things of the human world with names and forms. To call them *true lead* and *true mercury* is to speak of what cannot be named or perceived. Thus, we are compelled to borrow things with names and forms to approximate them, adding the word *true* to indicate that they are nothing but *yin*-*essence* and *yang*-*qi*. The *Book of Changes* says: ‘*Essence* and *qi* become things; *essence* and *qi* unite.’ When a person first comes into being, it is all the function of *prior Heaven*. Because they intermingle, the male receives *essence* and, employing *essence*, transforms; the female receives *qi* and, employing *qi*, flourishes. Employing *essence* leads to transformation, thus proceeding in accord to form a person; employing *qi* leads to flourishing, thus reversing to form the elixir. That the *qi* of *prior Heaven* is called *true lead* has its profound meaning. When the undisturbed *true lead* of *prior Heaven* governs the long-accumulated *true mercury* of *after Heaven*, they cherish and long for each other like husband and wife, mother and child, unable to bear separation—all occurring naturally. Those who do not understand why this is so, unless they thoroughly comprehend *yin* and *yang* and deeply penetrate the workings of creation, how could they speak of this?”",
      "overlap_context": "id, and only then into *essence*. The *qi* that arrives first is *prior to Heaven*; the *qi* that transforms into fluid is the water born of the *Heavenly One*. Once the body of *prior Heaven* is ruptured, the function of *after Heaven* proceeds; and once the function of *after Heaven* proceeds, the truth of *prior Heaven* recedes ever further.\n\nSuch is the marvel of creation’s unfolding—who would deny it? I invite you to consult your teacher on this matter.”\n\n*On the Prior and Posterior Heaven*",
      "start_char": 2217,
      "end_char": 2890,
      "start_sentence": 119,
      "end_sentence": 154,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.633817672729492,
      "metadata": {
        "source_file": "dao\\藏外\\玄肤论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "元精元气元神论 “元气为铅，元精为汞，元神果何物乎？ ” 曰：“元神为性，精气之主也。 以其两在而不测，灵通而无方，故命之曰神。 故神住则精凝，精凝则气归，气归则丹结。 皆先天之用也。 所谓元精，非交感之精之谓也。 精藏于离，心中之真液也。 所谓元气，非口鼻呼吸之谓也。 气藏于坎，虚无中之真气也。 所谓元神，非思虑之神之谓也。 神通于无极，父母末生以前之灵真也。 夫人，一太极也，精气即太极之阴阳也，神即太极之无极也，是谓元精、元气、元神。 善乎，翠虚之吟曰：‘此精不是文感糟，乃是玉皇口中涎。 ’玉皇，心君也。 口中涎，心中之灵液也。 ‘此气不是呼吸气，乃知却是太素烟。 ’太素烟，先天真乙之气也。 ‘此神不是思虑神．可与元皇相比肩。 ’元皇即元始也。 是谓无极之真，通天地，贯宇宙，巍然而独尊，超然而独运者也。 ” 神统论",
      "translated_text": "**On Original Essence, Original Qi, and Original Spirit**\n\n“Original *qi* is lead, original *essence* is mercury—what then is original spirit?”\nIt is said: “Original spirit is *nature*, the master of *essence* and *qi*. As it dwells in duality yet remains unfathomable, spiritually penetrating yet without fixed form, it is called *spirit*. Thus, when spirit abides, *essence* congeals; when *essence* congeals, *qi* returns; when *qi* returns, the elixir coalesces—all being the function of *prior Heaven*.\n\nWhat is called *original essence* is not the *essence* of sexual congress. It is the true fluid stored in *Li*, the true liquid within the heart. What is called *original qi* is not the breath of mouth and nose. It is the true *qi* stored in *Kan*, the true *qi* within the void. What is called *original spirit* is not the spirit of thought and deliberation. It is the spirit that pervades the *Wuji*, the numinous truth before father and mother were born.\n\nMan is a single *Taiji*. *Essence* and *qi* are the *yin* and *yang* of *Taiji*, while *spirit* is the *Wuji* of *Taiji*—these are *original essence*, *original qi*, and *original spirit*.\n\nHow well did Cui Xu express it in his verse:\n*‘This essence is not the dregs of lustful desire,*\n*But the Jade Emperor’s saliva from his mouth.’*\nThe Jade Emperor is the lord of the heart;\nsaliva from his mouth is the numinous liquid within the heart.\n\n*‘This qi is not the breath of inhalation and exhalation,*\n*But rather the mist of primordial simplicity.’*\nThe mist of primordial simplicity is the true *qi* of *prior Heaven*.\n\n*‘This spirit is not the spirit of thought and worry,*\n*But one that stands shoulder to shoulder with the Primordial Sovereign.’*\nThe Primordial Sovereign is the Primordial Beginning.\nThis is the true *Wuji*, pervading heaven and earth, penetrating the cosmos, majestically solitary in its supremacy, transcendent in its solitary movement.”\n\n**On the Governance of Spirit**",
      "overlap_context": "xir. That the *qi* of *prior Heaven* is called *true lead* has its profound meaning. When the undisturbed *true lead* of *prior Heaven* governs the long-accumulated *true mercury* of *after Heaven*, they cherish and long for each other like husband and wife, mother and child, unable to bear separation—all occurring naturally. Those who do not understand why this is so, unless they thoroughly comprehend *yin* and *yang* and deeply penetrate the workings of creation, how could they speak of this?”",
      "start_char": 2891,
      "end_char": 3247,
      "start_sentence": 155,
      "end_sentence": 178,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.820728063583374,
      "metadata": {
        "source_file": "dao\\藏外\\玄肤论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "“何以知神之统精气乎？ ” “即举一身之后天者言之。 神太惊即精散而怔忡，神太淫则气脱而痿缩。 故神藏于精，则谓之曰精神； 神藏于气，则谓之曰神气。 精气之得神而王，犹臣之得君而尊也。 故修真之士，莫要于养神。 神即性也，性定则神自安，神安则精自住，精住则气自生。 何以故？ 性定则心火不至上炎，火不炎则水不干，故身中之精亦住。 凡身中五脏六腑之精皆水也。 身中之精既住，则肾中之精可知。 肾为精府，精盛于肾者，积水生潮，滃然上腾，如云雾然，熏蒸四大，灌注上下。 吾以元神斡运乎其间，则升降进止，如运诸掌，是谓水火交而成既济也，是谓后天之气而得之似醉也。 然此特自吾身之后天者言之耳。 若夫先天之用，其采取交媾，脱胎神化，元一而非神之所为。 故修真之士莫要于炼神。 炼神者，玉液炼已之谓也，大道之所以成始而成终者也。 ” 金液玉液论 “丹法有金液炼形，玉液炼己之说，其旨安在？ ” 曰：“夫道者，性命兼修，形神惧妙者也。 金液炼形者，了命之谓也。 玉液炼己者，了性之谓也。 何谓玉液？ 玉者，温润贞纯之喻。 金者，坚刚不坏之称。 夫炼性者，损之又损，克去己私，务使温润贞纯，与玉比德，则己之内炼熟矣。 内炼既熟．然后可以临炉采药，而行一时半刻之功。 及夫时至机动，则取坎填离，采铅伏汞。 而坎中一画之阳，乃先天乾金也，谓之金液。 以之炼形，则体化纯阳，而形骸为之永固，一如金之坚刚而不坏矣。 故曰金炼玉炼。 性命兼修，而形神俱妙者也。 玉炼，则无为之道也； 金炼，则有为之术也。 自无为而有为，有为之后，而复返于无为，则性命之理得，而圣修之能事毕矣。 ” 性命论",
      "translated_text": "“How does one know that spirit governs essence and *qi*?”\n\n“Consider the postnatal aspect of the body. When the spirit is overly startled, essence scatters and palpitations arise; when the spirit is excessively lustful, *qi* dissipates and impotence follows. Thus, when spirit abides in essence, it is called *essence-spirit*; when spirit abides in *qi*, it is called *spirit-qi*. Essence and *qi* attain supremacy through spirit, just as ministers attain honor through their lord. Therefore, those who cultivate the truth must above all nurture the spirit. Spirit is nature; when nature is settled, spirit naturally rests; when spirit rests, essence naturally abides; when essence abides, *qi* naturally arises. Why is this so? When nature is settled, the fire of the heart does not flare upward; when fire does not flare, water does not dry up, and thus the essence within the body abides. The essence of the five viscera and six bowels is all water. When the essence within the body abides, the essence in the kidneys may be known. The kidneys are the storehouse of essence; when essence flourishes in the kidneys, accumulated water generates tides, billowing upward like clouds and mist, steaming the four great elements and irrigating above and below. When I employ primordial spirit to regulate its movement, ascent and descent, advance and retreat become as effortless as turning the palm. This is called the *Intercourse of Water and Fire* to achieve *Completion*, the postnatal *qi* attained in a state akin to intoxication. Yet this speaks only of the postnatal aspect of our body. As for the function of the prior Heaven, its gathering and union, its shedding of the womb and transformation of spirit, are of the primordial One and not the work of spirit. Thus, those who cultivate the truth must above all refine the spirit. Refining the spirit is called *jade liquid refinement of the self*, the means by which the Great Dao achieves both beginning and end.”\n\n**On Golden Liquid and Jade Liquid**\n\n“The alchemical method speaks of *golden liquid refining the form* and *jade liquid refining the self*—what is their purport?”\n\n“Dao is the concurrent cultivation of nature and life, the wondrous union of form and spirit. *Golden liquid refining the form* refers to the completion of life; *jade liquid refining the self* refers to the completion of nature. What is *jade liquid*? Jade is a metaphor for warmth, moistness, integrity, and purity. Gold is a term for firmness, hardness, and indestructibility. Refining nature means diminishing again and again, eradicating self-interest, striving to attain warmth, moistness, integrity, and purity, and emulating jade in virtue—thus the inner refinement matures. Once inner refinement is mature, one may approach the furnace to gather the medicine and perform the work of a moment. When the time arrives and the mechanism stirs, one draws from *kan* to fill *li*, gathers lead to subdue mercury. The single yang line within *kan* is the prior-Heaven *qian* metal, called *golden liquid*. Refining the form with it transforms the body into pure yang, rendering the physical frame eternally firm, like gold—hard and indestructible. Thus it is said: *gold refines jade*. This is the concurrent cultivation of nature and life, the wondrous union of form and spirit. Jade refinement is the way of non-action; gold refinement is the technique of action. Proceeding from non-action to action, and after action returning to non-action, the principle of nature and life is attained, and the work of sagely cultivation is complete.”\n\n**On Nature and Life**",
      "overlap_context": "tion,*\n*But rather the mist of primordial simplicity.’*\nThe mist of primordial simplicity is the true *qi* of *prior Heaven*.\n\n*‘This spirit is not the spirit of thought and worry,*\n*But one that stands shoulder to shoulder with the Primordial Sovereign.’*\nThe Primordial Sovereign is the Primordial Beginning.\nThis is the true *Wuji*, pervading heaven and earth, penetrating the cosmos, majestically solitary in its supremacy, transcendent in its solitary movement.”\n\n**On the Governance of Spirit**",
      "start_char": 3248,
      "end_char": 3912,
      "start_sentence": 179,
      "end_sentence": 219,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.987173080444336,
      "metadata": {
        "source_file": "dao\\藏外\\玄肤论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "“何谓性？ 何谓命？ ” 曰：“性者，万物一源； 命者，己所自立。 性非命弗彰，命非性弗灵。 性命所主也，命性所乘也。 今之论者，类以性命分宗，而不知道器相乘，有无相因，虚实相生，有不可歧而二者。 故性则神也，命则精与气也； 性则无极也，命则太极也。 可相离乎？ 或言释氏了性，道家了命。 非通论也。 夫佛无我相，破贪着之见也； 道言守母，贵无名之始也。 不知性安知命耶？ 既知命矣，性可遗耶？ 故论性而不沦于空，命在其中矣； 守母而复归于朴，性在其中矣。 是谓了命关于性地，是谓形神俱妙与道合真也”。 或问：“子之论性命则既明且尽矣。 敢问性之在人，果何物也？ 可得而见乎？ ” 曰：“性不可见，所以见则性也，于不可见而欲求其所以见，则性愈远矣。 何耶？ 性之为物也，可以无心见，而不可以有心求。 昔者老圣称太朴以无名，黄帝索玄珠于罔象，古人之喻厥有深旨。 请言人之所以生也！ 无极之真，二五之精，妙合而凝。 所谓性即无极也，所谓命即二五之精也。 二者妙合，而人始生焉。 方其末生之前，则所谓无极者，混沌鸿蒙，何相何名？ 何音何绪？ 何臭何声？",
      "translated_text": "“What is *xing*? What is *ming*?”\nIt is said: “*Xing* is the single source of the myriad things; *ming* is what one establishes for oneself. *Xing* cannot manifest without *ming*, nor can *ming* be efficacious without *xing*. *Xing* governs *ming*, while *ming* carries *xing*. Those who discourse today commonly divide *xing* and *ming* into separate schools, unaware that Dao and vessel ride upon one another, that being and non-being give rise to each other, that the empty and the full engender one another—there is no bifurcation into two. Thus, *xing* is spirit, while *ming* is essence and *qi*; *xing* is the *Wuji*, while *ming* is the *Taiji*. Can they be separated?\n\nSome say the Buddhists comprehend *xing*, while the Daoists comprehend *ming*. This is not a comprehensive view. The Buddha’s teaching of ‘no-self’ shatters the view of clinging and attachment; the Daoist teaching of ‘guarding the mother’ honors the nameless beginning. If one does not know *xing*, how can one know *ming*? Once *ming* is known, can *xing* be abandoned? Thus, to discourse on *xing* without sinking into emptiness is to have *ming* within it; to guard the mother and return to simplicity is to have *xing* within it. This is called ‘comprehending *ming* through the ground of *xing*’—it is the wondrous union of form and spirit, the merging with the true Dao.”\n\nSomeone asked: “Your discourse on *xing* and *ming* is already clear and exhaustive. May I ask: what is *xing* in a person? What is its substance? Can it be seen?”\nIt was said: “*Xing* cannot be seen. What enables seeing is *xing* itself. To seek what enables seeing in what cannot be seen is to distance oneself further from *xing*. Why? *Xing* as a thing can be seen without intent, but cannot be sought with intent. Of old, the Old Sage spoke of the Great Simplicity as nameless; the Yellow Emperor sought the Dark Pearl in the formless. The ancients’ metaphors carried profound meaning.\n\nLet me speak of how a person comes to be! The true *Wuji* and the essence of the Two and Five wondrously unite and congeal. What is called *xing* is the *Wuji*; what is called *ming* is the essence of the Two and Five. When these two wondrously unite, a person begins to live. Before birth, what is called the *Wuji* is a chaos of primordial vastness—what form, what name? What sound, what thread? What scent, what voice?”",
      "overlap_context": "ng, rendering the physical frame eternally firm, like gold—hard and indestructible. Thus it is said: *gold refines jade*. This is the concurrent cultivation of nature and life, the wondrous union of form and spirit. Jade refinement is the way of non-action; gold refinement is the technique of action. Proceeding from non-action to action, and after action returning to non-action, the principle of nature and life is attained, and the work of sagely cultivation is complete.”\n\n**On Nature and Life**",
      "start_char": 3913,
      "end_char": 4366,
      "start_sentence": 220,
      "end_sentence": 254,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.083872079849243,
      "metadata": {
        "source_file": "dao\\藏外\\玄肤论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "及乎二五既凝，得一以灵，何思何为？ 何虑何营？ 是性之本体也，夫自情识开而本体凿矣。 张子曰：‘形而后有气质之性。 善反之则天地之性存焉。 ’所谓情识，即气质之性也。 所捐本体，即天地之性也。 者子曰：‘复归于朴，复归于婴儿，复归于无极。 ’即善反也。 故修道之要，莫先于炼性。 性定而气质安不足以累之，则本体见矣。 吾师之诗曰：‘不迷性自住，性住气自回。 气回丹自结，壶中配坎离。 ’是后天得先天而妙其用也。 是之谓了命关于性也。 ” 质性论 “夫性一而已。 何以有本性质性之异？ ” 曰：“本性者，自先天而言之。 清净圆明，混成具足。 圣不加丰，愚不少啬者也。 质性者，自后天而言之。 生于形气之私，于是始有清浊厚薄之异。 且夫二五变合，生人物之万殊，其问揉杂不齐，本于胎元受气之始。 何者？ 吾自无始以来至于今日，皆以情欲而正命本。 逐境起念，遇物生情，熏习久矣。 中间得气有纯驳，故嗜欲有浅深，莫不各借本然之性，以行其有我之私。 盖质性在人，非能自用。 所以用者，皆借灵于本性。 如豪奴孽子，借主人以号令也。 故常喻之。 性则水也，落于气质，犹水之入于泥淖中也。 决而行之，但见泥淖而不见其水。 泥淖岂能自行？ 水行之也。 但水混于泥淖而不见耳。 澄之之久，则清者在上，浊者在下。 决而行之，无非水矣。 此澄湛之功，善反之力也。 ” 神室论",
      "translated_text": "When the Two and Five have congealed and attained the One to become numinous—what thought, what action? What care, what scheming? This is the original substance of *xing*. Yet once the passions and consciousness arise, the original substance is chiseled away.\n\nMaster Zhang said: “Only after form does there arise the *xing* of *qi* and material disposition. By returning to goodness, the *xing* of Heaven and Earth is preserved.” What he called passions and consciousness is the *xing* of *qi* and material disposition; what he urged us to relinquish is the original substance, which is the *xing* of Heaven and Earth. Laozi said: “Return to the uncarved block, return to the infant, return to the *Wuji*.” This is what it means to return to goodness. Thus the essential task of cultivating the Dao is nothing before refining *xing*. When *xing* is settled and the *qi*-disposition is at peace, it cannot burden one—then the original substance appears.\n\nMy teacher’s poem says:\n*“Not deluded, *xing* abides of itself;\n*xing* abiding, *qi* returns of itself.\n*Qi* returning, the elixir congeals of itself;\nwithin the crucible, Kan and Li unite.”*\n\nThis is the posterior heaven attaining the prior heaven and wondrously employing it. This is what it means to complete *ming* by means of *xing*.\n\n**On the Disposition of *Xing***\n\n“There is only one *xing*—why then the distinction between original *xing* and material *xing*?”\n\nI say: “Original *xing* is spoken of from the prior heaven. It is pure, still, luminous, and complete, perfectly endowed from the beginning. The sage does not add to it; the fool does not diminish it. Material *xing* is spoken of from the posterior heaven. It arises from the self-interest of form and *qi*, and thus begins the distinction between purity and turbidity, thickness and thinness.\n\nMoreover, the transformations and combinations of the Two and Five give rise to the ten thousand differences among beings. Their unevenness and admixture originate in the moment of conception when *qi* is received. Why? From the beginningless beginning until today, we have all used passions and desires to distort the original root of *ming*. Pursuing circumstances, we generate thoughts; encountering things, we produce emotions. This habituation has lasted long. In the meantime, the *qi* received may be pure or mixed, so cravings and desires vary in depth. None fail to borrow the original *xing* to enact their self-interested ends.\n\nMaterial *xing* in a person cannot act on its own. What acts always borrows numinosity from the original *xing*—like a haughty servant or a bastard son borrowing the master’s authority to issue commands. Thus I often use this metaphor: *Xing* is like water. When it falls into the *qi*-disposition, it is like water entering mud and mire. If you channel and direct it, you see only mud and mire, not the water. Can mud and mire move on their own? It is the water that moves them. But the water is mixed with mud and mire and thus unseen. If you settle it long enough, the clear rises to the top and the turbid sinks to the bottom. Channel and direct it again—nothing but water. This is the power of settling and returning to goodness.”**\n\n**On the Chamber of the Spirit**",
      "overlap_context": "ark Pearl in the formless. The ancients’ metaphors carried profound meaning.\n\nLet me speak of how a person comes to be! The true *Wuji* and the essence of the Two and Five wondrously unite and congeal. What is called *xing* is the *Wuji*; what is called *ming* is the essence of the Two and Five. When these two wondrously unite, a person begins to live. Before birth, what is called the *Wuji* is a chaos of primordial vastness—what form, what name? What sound, what thread? What scent, what voice?”",
      "start_char": 4366,
      "end_char": 4914,
      "start_sentence": 255,
      "end_sentence": 298,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.155062198638916,
      "metadata": {
        "source_file": "dao\\藏外\\玄肤论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "“元性元神，有以异乎？ ” 曰：“元性即元神，无以异也。 以其灵通而莫测，妙应而无方，故名之曰神。 谓之元者，所以别于后天之思虑也。 ” “神之在人，亦有宅乎” 曰：“吾闻之紫清仙师，人有三谷，乃元神之空，灵性之所存也。 其空如谷，又名谷神。 神存则生，神去则死。 日则接于物，夜则接于梦。 神不能安其居也。 《灵枢内经》曰：‘天谷元神，守之自真。 ’人身之中，上曰天谷，泥丸是也； 中曰应谷，绛宫是也； 下曰灵谷，关元是也。 此三谷者，神皆居之，谓之三田。 尝为之论，泥丸者，栖神之本宫也； 绛宫者，布政之明堂也； 灵谷者，藏修之密室也。 故夫元神居于绛官，则耳有闻，目有见，五官效职而百体为之从今矣； 元神居于灵谷，则视者返，听者收，神气相守，而营魄为之抱一矣。 杨子有言：‘藏心于渊，美厥灵根。 ’渊者，深昧不测之所，灵谷是也。 是神所藏也。 ”",
      "translated_text": "“Is there a difference between the original *xing* and the original spirit?”\n“Original *xing* is the original spirit—there is no difference. Because it is numinously penetrating and unfathomable, wondrously responsive yet without fixed form, it is called *shen* (spirit). It is called *original* to distinguish it from postnatal thoughts and deliberations.”\n\n“Does the spirit in a person also have a dwelling?”\n“As I learned from Master Ziqing the Immortal: a person has three valleys, which are the hollows of the original spirit and the abode of the numinous *xing*. These hollows are like valleys, hence also called *gu shen* (valley spirit). When the spirit dwells, there is life; when it departs, there is death. By day it engages with things; by night it engages with dreams. The spirit cannot rest in its dwelling.\n\n*The Spiritual Pivot of the Inner Canon* states: ‘The celestial valley holds the original spirit; guard it to preserve your true nature.’ Within the human body, the upper is called the celestial valley—this is the *niwan* (muddy pellet); the middle is called the responsive valley—this is the *jiangong* (crimson palace); the lower is called the numinous valley—this is the *guanyuan* (pass of origin). These three valleys are where the spirit resides, called the three fields.\n\nI have discussed them thus: the *niwan* is the original palace where the spirit abides; the *jiangong* is the bright hall for issuing decrees; the *linggu* (numinous valley) is the secluded chamber for cultivation and refinement. Therefore, when the original spirit resides in the *jiangong*, the ears hear, the eyes see, the five senses perform their duties, and the hundred parts of the body follow its commands. When the original spirit resides in the *linggu*, vision turns inward, hearing withdraws, spirit and *qi* guard each other, and the *ying* and *po* souls embrace unity.\n\nMaster Yangzi said: ‘Conceal the heart in the abyss to beautify its numinous root.’ The abyss is the deep, obscure, unfathomable place—this is the *linggu*, where the spirit is concealed.”",
      "overlap_context": " into the *qi*-disposition, it is like water entering mud and mire. If you channel and direct it, you see only mud and mire, not the water. Can mud and mire move on their own? It is the water that moves them. But the water is mixed with mud and mire and thus unseen. If you settle it long enough, the clear rises to the top and the turbid sinks to the bottom. Channel and direct it again—nothing but water. This is the power of settling and returning to goodness.”**\n\n**On the Chamber of the Spirit**",
      "start_char": 4915,
      "end_char": 5281,
      "start_sentence": 299,
      "end_sentence": 324,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.484519958496094,
      "metadata": {
        "source_file": "dao\\藏外\\玄肤论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "河车论 神既藏矣，是谓归根。 归根曰静，静曰复命。 将见神气相守，抱一无离。 迨夫静极而动，则是神也。 复乘气机而上升于泥九，于是河车之路始通。 要知河车之赂，乃吾身前后任督二脉也。 夫气之始升也，油然滃然，郁蒸于两肾之间，浩浩如潮生，溶溶如水泮，泛溢于五腧之上者，乃水经滥行，不由沟洫也。 吾急以神斡归尾闾，使之循尾闾而上，至于夹脊双关，上风府而直至于泥丸。 神与气交会于此，则其疏畅融液，不言可知。 少焉，降为新美之津，则自重楼而下游绛宫，入紫庭，复归其所藏之处而休焉。 如此循环灌注，久久纯熟，气满三田，上下交泰，所谓“常使气冲关节透，自然精满谷神存”也。 造化至此，内炼之征见矣。 然非深造而实诣，又乌知予言之有味哉！ 澄神论 “吾子所言藏神之宅，则吾既得闻命矣。 敢问藏神之旨。 ” 曰：“藏神者，凝神也。 凝神之要，莫先于澄神； 澄神之要，莫先于遣欲。 《清净经》云； ‘遣其欲而心自静，澄其心而神自清。 ’《易》曰：‘圣人以此洗心，退藏于密。 ’所谓洗心，即澄神之谓也。 周子曰：‘无欲故静。 ’所谓无欲，即遣欲之尽也。 夫人神好清，而心扰之； 人心好静，而欲牵之。 所谓心者有二焉。 扰神之心，乃妄心也； 好静之心，乃真心也。 既有妄心，即惊其神，其神可得清乎？ 既惊其神，即着万物； 既着万物，即生贪求； 既生贪求，即是烦恼； 烦恼妄想，忧苦身心，心可得而静乎？ 故澄神之要，莫先于遣欲。 能遣之者，内观其心，心无其心，知三心之不可得也。 外观其形，形无其形，远观于物，物无其物，知四相之俱忘也，三者既悟，惟见于空，则人空矣。 空无所空，所空既无，无无亦无，无无既无，湛然常寂，则法空矣。 如是则根尘永静，六欲不生，而心静矣。 心静则神自清，如水之无波，而万顷澄澈也。 虚靖天师《大道歌》云：‘欲得身中神不出，莫向灵台留一物。 物在心中神不清，耗散真精损筋骨。 ’遣欲澄神之说，百世以俟圣人，不易吾言矣！ ” 养神论 “神既澄矣，又何以加焉” 曰：“养之。 养之者，所以韬神之光使勿露也。 神之为物也，愈澄则愈清，愈清则愈明。 盖定能生慧，故灵光焕发，旁烛洞达，莫可盖藏。 《庄子》云：‘宁泰定者，发乎天光。 ’若用之不已，则太露而反伤于本性。 《庄子》云：‘古之治道者，以智养恬。 ’智生而以智为也，谓之以恬养知。 《坐忘枢冀论》云：‘慧而不用，实智若愚； 益资定慧，双美无极。 ’《道德经》云：‘敦兮其若朴，浑兮其若浊。 ’又曰：‘众人昭昭，我独若愚。 俗人察察，我独若闷。 ’皆养神之要义也。 ” 凝神论 “神既养矣，安所事凝耶？ ” 曰：“凝神云者。 无用用中之用，了命之学也。 《参同契》曰：‘经营养鄞鄂，凝神以成躯。 ’且夫离宫修定，禅之宗也； 水府求玄，丹之旨也。 澄神要矣，凝神急焉。 《翠虚吟》云：‘昔日逢师传口诀，只要凝神入气穴。 ’所谓气穴，乃吾人之鄞鄂也。 予前所着《神室论》中，则既明且尽矣。 虑夫学者徒知澄神，而不知凝神之处，则漫无归宿，而无以会夫归根复命之原，徒知养神而不知有凝神之方，则茫无下手，而不能侦夫造化消息之妙，故述所闻，复着此论。",
      "translated_text": "**On the River Chariot**\n\nWhen the spirit is thus concealed, this is called returning to the root. Returning to the root is called quiescence; quiescence is called the restoration of life. Then spirit and *qi* guard each other, embracing unity without separation. When quiescence reaches its utmost and movement arises, this is the spirit. It then rides the mechanism of *qi* and ascends to the *niwan*, at which point the path of the river chariot begins to open.\n\nKnow that the route of the river chariot is none other than the *ren* and *du* meridians before and behind the body. When *qi* first ascends, it arises gently and billows, steaming between the two kidneys, vast like the rising tide, fluid like melting ice. Overflowing above the five *shu* points, it courses like water spilling beyond its channels. I swiftly guide the spirit to turn back to the *weilü*, causing it to ascend along the *weilü*, pass through the *jiaji* double gates, rise to the *fengfu*, and reach the *niwan*. When spirit and *qi* meet here, their free flow and fusion are self-evident. After a moment, descending as fresh and sweet fluid, it travels down from the *chonglou*, through the *jiangong*, enters the *ziting*, and returns to its place of concealment to rest. In this ceaseless circulation and infusion, over time and with mastery, *qi* fills the three fields, and above and below communicate in harmony—this is what is meant by “always let *qi* surge through the joints, and naturally essence will be full and the valley spirit preserved.” At this stage of creation, the signs of internal refinement appear. Yet without profound attainment and true realization, how could one know the savor of my words?\n\n**On Clarifying the Spirit**\n\n“You have spoken of the dwelling where the spirit is concealed, and I have received your instruction. May I ask about the essence of concealing the spirit?”\n\n“To conceal the spirit is to congeal the spirit. The essence of congealing the spirit lies first in clarifying the spirit; the essence of clarifying the spirit lies first in dispelling desires. The *Classic of Purity* says: ‘Dispel desires, and the heart becomes still; clarify the heart, and the spirit becomes clear.’ The *Book of Changes* states: ‘The sage uses this to wash the heart and retreat to conceal it in secrecy.’ This ‘washing the heart’ is precisely what clarifying the spirit means. Master Zhou said: ‘Without desires, there is quiescence.’ This ‘without desires’ is the utmost of dispelling desires.\n\nThe spirit of man delights in clarity, yet the heart disturbs it; the heart of man delights in stillness, yet desires drag it away. What is called the heart has two aspects: the heart that disturbs the spirit is the deluded heart; the heart that delights in stillness is the true heart. If there is a deluded heart, it startles the spirit—how can the spirit remain clear? Once the spirit is startled, it clings to the myriad things; once it clings to the myriad things, craving arises; once craving arises, vexation follows; vexation and delusion bring sorrow and harm to body and mind—how can the heart remain still?\n\nThus, the essence of clarifying the spirit lies first in dispelling desires. To dispel them, inwardly observe the heart—there is no heart, for the three hearts cannot be grasped. Outwardly observe the form—there is no form; observe things from afar—there are no things, for the four marks are all forgotten. Once these three are awakened to, only emptiness is seen, and the person is empty. When emptiness is empty of itself, and what is emptied is also empty, and even emptiness is empty, then there is profound and constant stillness—this is the emptiness of dharmas. Thus, the roots and dust are forever stilled, the six desires do not arise, and the heart is still. When the heart is still, the spirit becomes clear, like water without waves, vast and limpid.\n\nMaster Xujing’s *Song of the Great Dao* says: ‘To keep the spirit within the body from departing, do not let a single thing remain in the numinous terrace. When things abide in the heart, the spirit is not clear, and true essence is wasted, harming sinews and bones.’ The teaching of dispelling desires and clarifying the spirit awaits the sage of a hundred generations—my words will not change.”\n\n**On Nurturing the Spirit**\n\n“Since the spirit is already clarified, what more can be added?”\n\n“Nurture it. To nurture it is to sheathe the spirit’s radiance so that it does not reveal itself. As a thing, the spirit becomes clearer the more it is clarified, and brighter the clearer it is. For stillness can generate wisdom, and thus numinous light shines forth, illuminating all without obstruction. *Zhuangzi* says: ‘In perfect quiescence, there is a heavenly radiance.’ Yet if it is used without cease, it becomes too exposed and harms one’s original nature. *Zhuangzi* also says: ‘Those who cultivated the Dao in ancient times nurtured tranquility with wisdom.’ Wisdom arises, but it is used as if it were tranquility—this is called nurturing wisdom with tranquility.\n\nThe *Pivot of Sitting in Forgetfulness* says: ‘Wisdom unused is true wisdom, like foolishness; it enriches both stillness and wisdom, a double beauty without end.’ The *Dao De Jing* says: ‘Profound, it is like uncarved wood; turbid, it is like muddy water.’ And again: ‘The multitude are bright and clear; I alone am dull. The common folk are sharp and keen; I alone am muddled.’ These are all essential teachings on nurturing the spirit.”\n\n**On Congealing the Spirit**\n\n“Since the spirit is already nurtured, why concern oneself with congealing it?”\n\n“Congealing the spirit refers to the use within non-use, the study of fulfilling life. The *Cantong Qi* says: ‘Manage and nurture the *yinqiao*, congeal the spirit to form the body.’ Moreover, cultivating concentration in the *ligong* is the essence of meditation; seeking the mysterious in the water palace is the aim of alchemy. Clarifying the spirit is essential, but congealing the spirit is urgent.\n\nThe *Cui Xu Yin* says: ‘Long ago, I met my teacher and received the oral transmission: simply congeal the spirit and enter the *qi* cave.’ This *qi* cave is none other than the *yinqiao* within us. In my earlier *Treatise on the Chamber of Spirit*, this was already made clear and exhaustive.\n\nI fear that scholars may know only how to clarify the spirit but not where to congeal it, thus wandering without a destination and unable to meet the origin of returning to the root and restoring life. Or they may know only how to nurture the spirit but not the method of congealing it, thus lacking a starting point and unable to fathom the subtleties of creation’s ebb and flow. Therefore, I set forth what I have heard and compose this treatise.”",
      "overlap_context": " in the *jiangong*, the ears hear, the eyes see, the five senses perform their duties, and the hundred parts of the body follow its commands. When the original spirit resides in the *linggu*, vision turns inward, hearing withdraws, spirit and *qi* guard each other, and the *ying* and *po* souls embrace unity.\n\nMaster Yangzi said: ‘Conceal the heart in the abyss to beautify its numinous root.’ The abyss is the deep, obscure, unfathomable place—this is the *linggu*, where the spirit is concealed.”",
      "start_char": 5282,
      "end_char": 6543,
      "start_sentence": 325,
      "end_sentence": 401,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.57119584083557,
      "metadata": {
        "source_file": "dao\\藏外\\玄肤论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "盖凝神者，入玄之要旨，丹家之第一义也。 所谓凝者，非块然不动之谓也。 乃以神入于气穴之中，与之相守而不离也。 老子曰：‘载营魄抱一，能无离乎’夫气穴者，乃吾人胎元受气之初，所禀父母精气而成者，即吾人各具之太极也。 其名不一，曰气海，曰关元，曰灵谷，曰下田，曰天根，曰命蒂，曰归根窍、复命关，即一处也。 方其处胎之时，呼吸之气，与母相通。 及夫子母分胎，剪落脐带，则自安炉鼎，别立乾坤，而一呼—吸，常归于本穴之中。 盖呼吸者，吾人立命之本也。 一息之间，呼吸不至，则气绝而死矣。 呼则气辟，阳之舒也； 吸则气阖，阴之敛也。 一呼一吸，名曰一息。 诊家以之候气，良有旨也。 《庄子》曰：‘众人之息以喉，真人之息以踵。 ’以踵者，谓深入于穴也。 众人之息，非不以踵也，但神有不存，纵其出入焉，而不自觉，若以喉耳。 真人则神依于息，而深入于本穴之中，绵绵若存，无少间断，故得专气致柔，抱—无离，虚极静笃，而能观其复也。 所谓依者，又非逐于息而依之也，有勿忘勿助之义焉。 故神依于息则凝，神凝则气亦凝； 神依于息则和，神和则气亦和，相须之道也。 凝神之法，自调息始。 调息者，依息之谓也。 ” 真息论 所谓息者有二焉，曰凡息，曰真息。 凡息者，口鼻出入之气也； 真息考，胎息也，上下乎本穴之中。 晦翁先生所谓“翕然而嘘，如春沼鱼”者是也。 凡息既停，则真息自动。 而凡息之所以停者，非有心以屏之也。 虚极静笃，故心愈细，而气愈微耳。 今之论者但知调息，而忽不自知其落于以心逐气之病，盖以凡夫躁竞之心，未闲调习，一旦使之依息，心岂肯自依？ 未免着意。 着意则气未平，而心先动矣。 岂非复以气而役神乎？ 予故曰：“调息者，自然依息之谓，非逐于息之谓也。 ”调息又自调心始。 调心者，摄念归静，行住坐卧，常在腔子。 久久纯熟，积习生常，自然澡雪柔埏，与息相和也。 和则相依，依而勿逐。 凡息自停，真息自动。 橐钥一鼓，炼精化气，熏而上腾，灌注三宫。 是谓真橐钥、真鼎炉、真火候也。 ” 火符论",
      "translated_text": "The congealing of spirit is the essential principle of entering the Dao and the foremost tenet of the alchemical tradition. What is meant by \"congealing\" is not stagnation or immobility, but rather the spirit entering the *qi* cave and abiding with it without separation. Laozi said: *\"Bearing *yin* and embracing *yang*, can you keep them from parting?\"* The *qi* cave is that which we receive at the inception of our embryonic *qi*, formed from the essence and *qi* of our parents—it is the Supreme Ultimate inherent in each of us. Its names vary: *qi* sea, Pass of Origin, Spirit Valley, Lower Field, Heavenly Root, Stem of Life, Cavity of Returning to the Root, and Pass of Restoring Life—yet it is one and the same place.\n\nWhen we dwell in the womb, our breath and *qi* commune with our mother. Once the umbilical cord is severed at birth, we establish our own furnace and cauldron, setting apart our own heaven and earth, and with every inhalation and exhalation, *qi* invariably returns to this original cavity. Breath is the foundation of our life: if in a single breath, inhalation and exhalation cease, *qi* is cut off and death ensues. Exhalation is the expansion of *qi*, the unfolding of *yang*; inhalation is the contraction of *qi*, the gathering of *yin*. One exhalation and one inhalation make a single breath. Physicians use this to assess *qi*—and rightly so. Zhuangzi said: *\"The breath of the multitude reaches only to the throat, but the breath of the perfected reaches to the heels.\"* \"Reaching to the heels\" means penetrating deeply into the cavity. The multitude’s breath does not fail to reach the heels, but with the spirit unattended, though *qi* moves in and out, they remain unaware, as if it were merely at the throat. The perfected, however, rest their spirit upon the breath, penetrating deeply into the original cavity, continuously abiding without the slightest interruption. Thus, they concentrate *qi* to attain suppleness, embrace the One without separation, and in utter emptiness and profound stillness, observe the return.\n\nThis \"resting\" is not clinging to the breath but entails a sense of neither forgetting nor forcing. Therefore, when the spirit rests upon the breath, it congeals; when the spirit congeals, *qi* also congeals. When the spirit rests upon the breath, it harmonizes; when the spirit harmonizes, *qi* also harmonizes—this is the principle of mutual dependence. The method of congealing spirit begins with regulating the breath. Regulating the breath means resting upon it.\n\n**Treatise on True Breath**\nBreath is of two kinds: ordinary breath and true breath. Ordinary breath is the *qi* that enters and exits through the mouth and nose; true breath is embryonic breath, circulating within the original cavity. This is what Master Huiweng described as *\"gently exhaling, like a fish in a spring pond.\"* When ordinary breath ceases, true breath stirs of itself. That ordinary breath ceases is not due to deliberate suppression; rather, in utter emptiness and profound stillness, the heart grows ever more refined, and *qi* ever more subtle.\n\nThose who discuss this today know only of regulating the breath but fail to recognize the pitfall of chasing *qi* with the heart. This is because the restless, competitive mind of the ordinary person is untrained in regulation. If one is suddenly made to rest upon the breath, how can the heart willingly comply? Inevitably, it becomes contrived. When contrived, *qi* is not yet settled, but the heart is already stirred—is this not once again using *qi* to enslave the spirit? Thus, I say: *\"Regulating the breath means naturally resting upon it, not chasing after it.\"* Regulating the breath begins with regulating the heart. Regulating the heart means gathering the thoughts to stillness, so that in movement and stillness, waking and sleeping, they always reside within the cavity. With long practice, habit becomes nature, and one is naturally cleansed and softened, harmonizing with the breath. In harmony, there is resting; resting without chasing. Ordinary breath ceases of itself, and true breath stirs of itself. The bellows are set in motion, refining essence into *qi*, which rises and suffuses the Three Palaces. This is the true bellows, the true cauldron and furnace, the true firing times.\n\n**Treatise on the Fire Symbol**",
      "overlap_context": "rit*, this was already made clear and exhaustive.\n\nI fear that scholars may know only how to clarify the spirit but not where to congeal it, thus wandering without a destination and unable to meet the origin of returning to the root and restoring life. Or they may know only how to nurture the spirit but not the method of congealing it, thus lacking a starting point and unable to fathom the subtleties of creation’s ebb and flow. Therefore, I set forth what I have heard and compose this treatise.”",
      "start_char": 6543,
      "end_char": 7350,
      "start_sentence": 402,
      "end_sentence": 446,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.529115676879883,
      "metadata": {
        "source_file": "dao\\藏外\\玄肤论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "“以真息为火，其亦有说乎？ ” 曰：“有之。 ‘谩守药炉看火候，但安神息任天然。 丹灶河车休矻矻，鹤胎龟息自绵绵。 ’古仙之言，不一而足。 然非以息为火也。 火，神火也，息则火之橐钥也。 今夫神气相守之时，神则无为，而气机则不能以不动，故一阖一辟，与经脉上下相为流通。 所以觉其动者，谁也？ 神也。 一气流通，元神独觉，神与气融，宽急相得，是火力调匀，然后丹成而药就也。 予尝以橐钥喻真息，盖亦有理。 今夫冶人之铸金也，必先鼓之以橐钥，然后火发而金始溶。 若徒以浩荡之风吹之，则火气散漫，而金终不可化矣。 何者？ 浩荡之风，往来不常，即众人以喉之息也，橐钥之风，绵绵不绝，即真人以踵之息也。 神依息而互融，即火之得乎风也； 气得神而自化，即金之化于火也。 如斯而喻，昭乎明矣！ ”",
      "translated_text": "“Is there an explanation for taking true breath as fire?”\n\n“There is. The ancient immortals’ words abound, such as:\n*‘Do not idly watch the medicine furnace for firing times—*\n*Simply settle the spirit and rest in breath as it naturally is.*\n*Cease striving at the elixir hearth and river chariot;*\n*The crane’s embryo and tortoise’s breath will stretch on of themselves.’*\nYet these do not mean taking breath itself as fire.\n\nFire is the fire of spirit; breath is but the bellows of that fire. When spirit and *qi* guard one another, the spirit remains in non-doing, while the mechanism of *qi* cannot but move. Thus, with each closing and opening, it flows in unbroken circulation through the meridians. What perceives this movement? The spirit. As the single *qi* circulates, the primordial spirit alone awakens. When spirit and *qi* merge, tension and ease find balance—this is the evenness of fire’s power, and only then is the elixir completed and the medicine achieved.\n\nI have likened the bellows to true breath, and there is reason in this. Consider the smith who casts metal: he must first work the bellows, and only then does the fire ignite and the metal begin to melt. If one merely blows with a gusting wind, the fire scatters, and the metal will never transform. Why? Because a gusting wind comes and goes without constancy—this is the breath of ordinary men through the throat. The bellows’ wind, however, stretches on unbroken—this is the true person’s breath through the heels. When spirit rests upon breath and they fuse, it is as fire receiving wind; when *qi* is guided by spirit and transforms of itself, it is as metal melting in fire. Such is the clarity of this analogy!”",
      "overlap_context": "sleeping, they always reside within the cavity. With long practice, habit becomes nature, and one is naturally cleansed and softened, harmonizing with the breath. In harmony, there is resting; resting without chasing. Ordinary breath ceases of itself, and true breath stirs of itself. The bellows are set in motion, refining essence into *qi*, which rises and suffuses the Three Palaces. This is the true bellows, the true cauldron and furnace, the true firing times.\n\n**Treatise on the Fire Symbol**",
      "start_char": 7351,
      "end_char": 7678,
      "start_sentence": 447,
      "end_sentence": 467,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.271860361099243,
      "metadata": {
        "source_file": "dao\\藏外\\玄肤论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "或问：“火符进退，朝屯暮蒙，其旨同异？ ” 曰：“予昔未得师指，窃以火候难明。 亦尝按之周天，准之卦0气，分更分漏，徒费讲求。 而后乃今，豁然大悟。 乃知丹经万卷，火记六百，皆可言下而废。 所谓真火无候，大药元斤，诚哉是言！ 不我欺也。 夫炼药有内外，故火候有繁简。 所谓内炼，一言以蔽之曰：‘锦绵若存而已矣。 ’外药者，非前所论之外药也，盖指天元地元而言。 符者，谓与天道相符合也。 丹法以月之庚甲，象药材之老嫩； 日之子午，为火候之消息。 所谓朝屯暮蒙，不过言其进退之则，有如是耳。 得其意忘象可也。 《悟真篇》云：‘内药还同外药．内通外亦须通。 丹头和合类相同，温养两般作用。 内有天然真火，炉中赫赫常红。 外炉加减要勤功，绝妙无过真种。 ’真种者，人元也。 是火符之断案也。 ” 药火论",
      "translated_text": "“Someone asked: ‘The fire-tally advances and retreats, now *tun* at dawn, now *meng* at dusk—are their principles the same or different?’\n\nI replied: ‘In the past, before receiving my teacher’s instruction, I privately considered the fire-regimen difficult to discern. I once tried to measure it by the celestial revolution, to align it with the hexagrams and *qi*, to divide it by watches and clepsydra drops—all to no avail. Only afterward did I suddenly awaken in great clarity. Then I understood that the ten thousand volumes of elixir classics and the six hundred fire-records could all be set aside at a single word. The saying that true fire has no regimen and the great medicine no fixed weight is indeed true—it did not deceive me.\n\nRefining the medicine has inner and outer aspects, and thus the fire-regimen has complexity and simplicity. What is called inner refinement may be summed up in one phrase: “as if preserved in brocade-woven continuity.” The outer medicine here is not the outer medicine discussed earlier; rather, it refers to the celestial and terrestrial origins. The tally is so named because it accords with the Dao of Heaven.\n\nIn elixir methods, the *geng* and *jia* of the moon symbolize the maturity or tenderness of the medicinal material; the *zi* and *wu* of the sun mark the waxing and waning of the fire-regimen. The phrases “*tun* at dawn, *meng* at dusk” merely describe the principle of its advance and retreat—nothing more. Once the meaning is grasped, the image may be forgotten.\n\nThe *Wuzhen pian* says:\n*“The inner medicine is still the outer medicine;\nInner penetration requires outer penetration as well.\nThe elixir-head blends in kindred harmony—\nTwo nurturing functions, one in warmth, one in action.\nWithin, there is the natural true fire,\nThe furnace ever glowing crimson.\nWithout, the furnace’s increase and decrease demand diligent effort—\nNothing surpasses the true seed in wondrous subtlety.”*\n\nThe true seed is the human origin. This is the final verdict on the fire-tally.”",
      "overlap_context": "blows with a gusting wind, the fire scatters, and the metal will never transform. Why? Because a gusting wind comes and goes without constancy—this is the breath of ordinary men through the throat. The bellows’ wind, however, stretches on unbroken—this is the true person’s breath through the heels. When spirit rests upon breath and they fuse, it is as fire receiving wind; when *qi* is guided by spirit and transforms of itself, it is as metal melting in fire. Such is the clarity of this analogy!”",
      "start_char": 7679,
      "end_char": 8014,
      "start_sentence": 468,
      "end_sentence": 491,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.221802234649658,
      "metadata": {
        "source_file": "dao\\藏外\\玄肤论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "“药与火同乎？ 异乎？ ” 曰：“药与火，可分也，亦可台也。 分则可异，合则可同。 何者？ 分而言之，则药者，先天之气也； 火者，先天之神也。 合而言之，则药即火也，火即药也。 知合而不知分，则采取不明； 知分而不知合，则温养无法。 何者？ 采取之时，药在外，火在内。 以火而致药，故药火可分； 温养之目，药在外，归于内，得药而行火，故药火可合。 要之，火其主也，故火急则丹伤，火冷则丹散。 几言火而不言药者，十月之事也； 言药而不言火者，一时半刻之功也。 至于紫清仙师之言曰：‘以火炼药而成丹。 ’即以神驭气而成道也，更明切矣”。 抽添论 或问：“抽铅添汞之旨，可得闻欤？ ” 曰：“予闻之立阳先生得药归鼎之后，养以天然真火，绵绵若存。 其中抽添变化，皆出自然。 有不容以丝毫智力与乎其间。",
      "translated_text": "“Are medicine and fire the same or different?”\n\nIt is said: “Medicine and fire may be distinguished, yet they may also unite. When separated, they differ; when joined, they are one. Why? Speaking of them as distinct: medicine is the primordial qi, while fire is the primordial spirit. Speaking of them as united: medicine is fire, and fire is medicine. To know only their union and not their distinction is to fail in the gathering and refinement; to know only their distinction and not their union is to lack method in the nurturing and warming.\n\nWhy? At the time of gathering and refinement, medicine lies without while fire resides within—fire draws forth the medicine, so medicine and fire may be distinguished. In the phase of nurturing and warming, medicine, though initially without, returns within, and with the medicine, fire is activated—thus medicine and fire may unite.\n\nIn essence, fire is the master: if fire is too fierce, the elixir is harmed; if fire is too cool, the elixir scatters. When fire is spoken of without mention of medicine, it refers to the work of the ten months; when medicine is spoken of without mention of fire, it refers to the labor of a brief moment.\n\nAs the Purple Clarity Immortal Master said: ‘Refining medicine with fire to form the elixir’—this is precisely ‘directing qi with spirit to attain the Dao,’ a statement most clear and incisive.”\n\n**On Withdrawal and Addition**\n\nSomeone asked: “May I hear the principle of withdrawing lead and adding mercury?”\n\nIt was said: “I have heard from Master Li Yang that after obtaining the medicine and returning it to the crucible, one nurtures it with the natural true fire, continuous and unceasing as if present. The transformations of withdrawal and addition within arise naturally, allowing no trace of human artifice or force to intervene.”",
      "overlap_context": "uzhen pian* says:\n*“The inner medicine is still the outer medicine;\nInner penetration requires outer penetration as well.\nThe elixir-head blends in kindred harmony—\nTwo nurturing functions, one in warmth, one in action.\nWithin, there is the natural true fire,\nThe furnace ever glowing crimson.\nWithout, the furnace’s increase and decrease demand diligent effort—\nNothing surpasses the true seed in wondrous subtlety.”*\n\nThe true seed is the human origin. This is the final verdict on the fire-tally.”",
      "start_char": 8015,
      "end_char": 8354,
      "start_sentence": 492,
      "end_sentence": 517,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.649510860443115,
      "metadata": {
        "source_file": "dao\\藏外\\玄肤论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "盖道则无为，而神气自然有所为，乃造化之妙也。 所谓如米炊饭，厥有深旨，非止特喻其易易而已。 夫铅之投汞，譬则水之投于米中也。 水不可以过多，米不可以过少，犹之二八相当也。 火力调匀，其水渐干而米渐长，斯成饭矣。 水渐干则抽铅之谓也，米斯长则添汞之谓也。 抽非内减也，神入气中，如天之气行于地，而潜机不露也； 添非外益也，气包神外，如地之气承乎天，而渐以滋长也。 由是而胎圆神化，身外有身。 造化之妙，一至于此。 要皆自然而然，有莫知其所以然者。 若于此而欲求其所以抽所以添，则涉于有心而非自然矣。 所谓自然，亦有深旨。 师语我曰：‘顺自然，非听自然也。 ’旨哉！ 言乎！",
      "translated_text": "For the Dao is non-action, yet spirit and qi naturally act—such is the marvel of creation. The saying \"like cooking rice from grain\" contains profound meaning, not merely an analogy for ease. When lead is added to mercury, it is like water poured into rice. The water must not be excessive, nor the rice too scant, just as the two eights must correspond. When the fire’s strength is evenly regulated, the water gradually dries while the rice swells, and thus rice is made. The gradual drying of water is what is meant by \"withdrawing lead\"; the swelling of rice is what is meant by \"adding mercury.\" Withdrawal is not internal reduction: spirit enters qi as heaven’s qi moves through earth, its hidden mechanism unseen. Addition is not external increase: qi envelops spirit as earth’s qi receives heaven, gradually nurturing growth. Through this, the embryo is perfected and spirit transforms, giving rise to a body beyond the body. The marvel of creation reaches this point—all unfolding naturally, with no knowing how it comes to be. If one seeks to grasp the *how* of withdrawal and addition, one falls into intentionality and ceases to be natural. This \"naturalness\" too holds profound meaning. My master told me: \"Follow the natural, do not merely heed it.\" How profound these words!",
      "overlap_context": "attain the Dao,’ a statement most clear and incisive.”\n\n**On Withdrawal and Addition**\n\nSomeone asked: “May I hear the principle of withdrawing lead and adding mercury?”\n\nIt was said: “I have heard from Master Li Yang that after obtaining the medicine and returning it to the crucible, one nurtures it with the natural true fire, continuous and unceasing as if present. The transformations of withdrawal and addition within arise naturally, allowing no trace of human artifice or force to intervene.”",
      "start_char": 8354,
      "end_char": 8624,
      "start_sentence": 518,
      "end_sentence": 533,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.1084303855896,
      "metadata": {
        "source_file": "dao\\藏外\\玄肤论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "” 遗言论 或问：“诸丹经所言红铅、黑汞、青龙、白虎、白雪、黄芽、木公、金母、婴姹、黄婆，异名殊字，数更仆未易尽也。 今子所着一切置而不言，意者将有遗论乎” 曰：“否。 子静听，吾试语之。 昔者吾以章句儒生，学窥玄圃，索无前识之资。 偶以因缘遭际，得授真宗，颇知径约。 凡前所举名义，昔皆熟读而详味之。 但识此遗彼，适资捍格，而后乃今知大道之不烦，可一言而尽也。 夫道不外乎一阴一阳而已。 阴则为精，阳则为气，而神则统乎二者，故神与气精，乃上药之三品也。 凡言龙虎、铅汞，种种异名，皆依此立。 古仙垂语，不欲轻泄，故乱辞孔窍，纷尔多门，使志学之士，因文以见义，出博以之约。 迨天真积力久，豁然贯通，则刊落言筌，直见根本矣。 ” 或问：“《玄肤》所着，多言外药。 至于采取交媾，略而不言，学人何述焉” 曰：“采取交媾，乃太上閟密之玄机，千圣传心之要旨。 吾非不欲指而言之，但师命甚严，是以临书而惴惴其栗也。 然吾于前所论中，似已诀破，但混于微言而不觉耳。 《契》有之曰：‘千周灿彬彬兮，万遍将可睹。 ’志学之士，苟能千周万遍，则研精而妙义见矣。 然非有求而未得之愤，则孰知期道之难闻？ 非有相悦以解之妙，则孰知予言之有味哉？ 已乎已乎，吾兹将结舌矣。 ”",
      "translated_text": "One asked in *Legacy Discourse*: \"The various alchemical scriptures speak of 'cinnabar lead,' 'black mercury,' 'Azure Dragon,' 'White Tiger,' 'White Snow,' 'Yellow Sprout,' 'Wood Duke,' 'Metal Mother,' 'Infant Girl,' and 'Yellow Dame'—so many disparate names and terms that their enumeration would exhaust even a multitude of scribes. Yet in your writings, you set all these aside and say nothing of them. Does this mean you intend to leave some discourse unspoken?\"\n\nI replied: \"No. Listen quietly, and I shall try to explain. In the past, I was a scholar versed in the exegesis of the classics, my learning confined to the outer gardens of the mysterious. I lacked the innate capacity to perceive what lay beyond. By chance, through karmic conditions, I encountered the true teaching and received its transmission, gaining some understanding of its direct and essential path. All the names and terms you mentioned, I once studied thoroughly and pondered deeply. Yet grasping one while losing sight of another only led to obstruction and conflict. Only later did I come to know that the great Dao is not cumbersome—it can be encompassed in a single word.\n\nThe Dao is nothing other than the interplay of yin and yang. Yin is essence, yang is qi, and spirit governs both. Thus, spirit, qi, and essence are the three grades of the supreme elixir. All the various names—Dragon and Tiger, lead and mercury—are established in reference to these. The ancient immortals, in transmitting their teachings, did not wish to reveal them lightly. Thus, they scattered their words through countless apertures, creating a profusion of gates, so that earnest students might arrive at meaning through text and attain simplicity through breadth. When the celestial truth has been cultivated over time and suddenly penetrates through, then the trappings of language fall away, and the root is directly perceived.\"\n\nAnother asked: \"In *Mysteries of the Profound*, you discuss the 'external elixir' at length. Yet regarding the gathering, refinement, and union of the medicines, you say little. How are learners to proceed?\"\n\nI replied: \"The gathering, refinement, and union of the medicines are the most recondite mysteries of the Most High, the essential heart-mind transmitted by a thousand sages. I do not refrain from pointing them out and speaking of them, but my master’s injunctions are strict, and so as I write, I tremble with apprehension. Yet in what I have already discussed, I seem to have already revealed the key—though concealed within subtle words, it may go unnoticed. As the *Canticle* says: ‘After a thousand cycles, brilliance shines forth; after ten thousand repetitions, it may be beheld.’ If earnest students can persist through a thousand cycles and ten thousand repetitions, then through deep inquiry, the wondrous meaning will become apparent.\n\nYet without the frustration of seeking and not yet attaining, who would know the difficulty of encountering the Dao? And without the delight of mutual understanding and the marvel of comprehension, who would find savor in my words? Enough, enough—I shall now hold my tongue.\"",
      "overlap_context": "receives heaven, gradually nurturing growth. Through this, the embryo is perfected and spirit transforms, giving rise to a body beyond the body. The marvel of creation reaches this point—all unfolding naturally, with no knowing how it comes to be. If one seeks to grasp the *how* of withdrawal and addition, one falls into intentionality and ceases to be natural. This \"naturalness\" too holds profound meaning. My master told me: \"Follow the natural, do not merely heed it.\" How profound these words!",
      "start_char": 8624,
      "end_char": 9145,
      "start_sentence": 534,
      "end_sentence": 560,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.597459316253662,
      "metadata": {
        "source_file": "dao\\藏外\\玄肤论.txt",
        "category": "藏外"
      }
    }
  ]
}