{
  "source_id": "玄门十事威仪",
  "source_file": "chunked_daozang\\玄门十事威仪.json",
  "total_chunks": 7,
  "total_original_chars": 6679,
  "total_translated_chars": 37404,
  "total_translation_time": 195.88606643676758,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\威仪类\\玄门十事威仪.txt",
    "category": "威仪类"
  },
  "full_translation": "At that time, the Most High Lord Lao, having expounded the precepts of ritual vestments to the Perfected of No-Thought and the assembled disciples, further declared the ten matters of decorum, which had not yet been revealed to you. Now I transmit these words, for they are most essential.\n\nJust as one who wishes to walk cannot do so without feet, so one who seeks to enter the wondrous Dao cannot do so without a gate. These ten precepts of decorum are the gate of the Dao. Those who enter my gate aspire to equal the immortals, separating themselves from the profane world.\n\nOrdinary beings who uphold these ten matters are called no longer common. The causes of birth and death, the wheel of transgressions, the defilement of the Dharma-body, the disdain for ritual vestments, the disorderly pursuit of the Dao, the failure to cultivate wholesome karma, the indulgence in self and ego, the absence of shame and remorse—these grave offenses in the Nine Dark Realms grow day and night. Whether walking, standing, sitting, or reclining, whether entering or exiting, there is a proper way.\n\nSuch ordinary beings differ not from the masses of sentient life. True immortals and great sages take no joy in seeing or hearing of them. Heavenly demons, spirits, and ghosts all despise and envy them. Kings and rulers feel no reverence for them. Men and women in the ten directions hold them in contempt. Lacking merit and virtue themselves, they nurture the roots of others’ evil. They cultivate transgressions at both ends—how boundless their suffering retribution!\n\nI behold such beings and grieve with a chill in my heart. Therefore, I earnestly repeat this teaching to you. You should uphold and practice it, clearly instructing those who come to learn. Guide them with care, ensuring they master these matters. When the ten matters are perfected, the gods of the heavens will observe and approve. The people and gods of the ten directions, the heavenly demons, spirits, and ghosts—all will stand in awe and reverence, harboring only goodwill, none daring to transgress. Merit fields will flourish, wholesome fruits will arise universally, and boundless virtue will accrue.\n\nThose who can do thus are my true disciples, worthy to transmit the wondrous Dharma, swiftly drawing near to the Dao. Those who cannot are kin to demons and ghosts, ever drawing closer to them day and night, never to escape.\n\nUpon hearing these profound teachings, the Perfected of No-Thought and the assembly bowed their heads in reverence, their hearts filled with awe and shame. Joy and sorrow mingled as tears streamed down. They vowed to uphold the ten matters of decorum for kalpas without end.\n\nThe Most High said:\nFirst, maintaining the altar;\nSecond, paying respects and making obeisance;\n\nThird, movement in and out;\nFourth, sitting and rising;\nFifth, holding the flask;\nSixth, washing and rinsing;\nSeventh, cloths and vessels;\nEighth, fasting and eating;\nNinth, requesting the Dharma;\nTenth, protection and upholding.\n\nThese ten matters are the affairs within my teaching gate. They shall be entrusted to you all—study and practice them, exhorting both men and women to ascend into the ranks of immortals.\n\nThe Perfected of No-Thought bowed his head to the ground, prostrating himself in long reverence, and knelt in earnest acceptance.\n\n**Chapter One: Holding and Seating the Altar**\n\nNow, as for seating the altar: it separates the mundane and removes defilement, safeguarding purity and self-discipline. One must not treat the Dao’s virtue with negligence, but rather emulate the lofty traces of celestial perfected beings.\n\nFirst, when rising, sitting, going out, or entering, it should never leave one’s person. If, for some matter, it must temporarily be set aside, it must not be placed in any impure or杂乱之处. First, sweep or wipe the area, or place it within a clean vessel.\n\nSecond, whenever carrying it for use, either hang it upon the arm or drape it over the left hand, with the cord’s opening facing outward.\n\nThird, whenever performing obeisance, first lift the corner with the right hand and suspend it, then use the left hand’s three fingers to grasp the edge, laying it flat with both ends even before placing it upon the ground.\n\nFourth, first raise the left sole and place it upon the second ridge to stand, then lift the right foot, half-kneeling to spread it evenly, ensuring it lies level and straight.\n\nFifth, clasp the hands and rise, stepping back so the right foot returns to the second ridge. Stand steadily before performing the three bows.\n\nSixth, then raise the right hand to grasp the corner with two fingers and retrieve it, taking care not to let it touch anything else. Grasping the middle ridge is also permissible.\n\nSeventh, after putting on shoes or sandals, transfer it to the left hand, turning the body to fold it, keeping it away from others’ faces.\n\nEighth, once folded, hang it upon the left hand, covering it with the Daoist robe or cloud-patterned sash before proceeding with greetings.\n\n**Chapter Two: Paying Respects and Making Obeisance**\n\nNow, as for paying respects and making obeisance: it is called humbling oneself, revering oneself, and revering others. While inner reverence is difficult to perceive, outward humility is visible. Thus, one must perform formal rites with diligence to express the heart’s profound esteem.\n\nHumbling oneself to show respect serves twelve purposes: first, shame and remorse; second, repentance and gratitude; third, seeking the Dharma; fourth, eliminating arrogance; fifth, honoring virtue; sixth, consolation and congratulation; seventh, eradicating transgressions; eighth, discipline and admonition; ninth, repaying kindness; tenth, offering objects; eleventh, bringing joy to people in this life; twelfth, earning reverence from all under heaven in the future.\n\nFirst, when paying respects and making obeisance, one must be composed and proper, with a demeanor worthy of admiration.\n\nSecond, hold the tablet centered before the heart, standing upright with a straight body.\n\nThird, prostrate with the five limbs touching the ground, front and back aligned evenly.\n\nFourth, upon seeing revered images, scriptures, or Dharma, or when encountering repentance rituals, one must perform obeisance.\n\nFifth, upon seeing a revered master of noble virtue, one must perform obeisance.\n\nSixth, upon seeing one’s preceptor, one must perform obeisance.\n\nSeventh, upon seeing a virtuous friend superior to oneself, one must perform obeisance.\n\nEighth, upon seeing fellow students from all directions, one must perform obeisance.\n\nNinth, when taking leave of one’s master or returning to one’s chamber for the night, one must first perform obeisance, state the time of return on the following day, and depart with respect. Upon arriving home, one must also perform obeisance before engaging in conversation or inquiring after well-being.\n\nTenth, when departing for distant places or returning after a month or a year, one must first perform three bows, then kneel and prostrate fully to the ground, expressing deep gratitude before rising to exchange greetings. This is the proper etiquette for serving one’s master.\n\nEleventh, if the master resides in a distant province or county, with rare opportunities for meeting over long years, one must still perform obeisance, kneel, and express one’s feelings, prostrating with sorrow and emotion before rising to exchange greetings. If they meet and discuss matters of joy or sorrow, one must offer congratulations or condolences with repeated bows.\n\nTwelfth, in occasions of celebration or mourning, one must first express sorrow or joy through ritual, then deepen the sentiment afterward. One must wait until the elder has finished speaking before performing obeisance again. The same applies when receiving congratulations or condolences.\n\nThirteenth, upon receiving kind instruction or admonishment—even if it involves reproach or punishment—one must perform obeisance, express gratitude in a low voice, and repay the virtue of the teaching.\n\nFourteenth, when receiving obeisance, one must raise one’s fists in a respectful gesture, decline with clasped hands, and defer to the other’s honor.\n\nFifteenth, when performing obeisance to one’s master, one must wait for them to be seated. If a mutual bow is required, one must sit to receive it. If the master returns from afar, one should escort them to their chamber, wait until they are seated, and only then perform obeisance—not hastily at the doorway or corridor.\n\nSixteenth, in halls or temples, before sacred images or in the presence of masters and elders, one must not accept another’s obeisance. If someone unknowingly performs obeisance, one must explain the matter to stop them. If one encounters an elder of noble virtue in a hall, one must also explain that one dares not perform obeisance casually.\n\n**Chapter on Conduct When Coming and Going**\n\nFirst, when walking or standing in difficult or uncertain places, one must always have a companion and not proceed alone, so as to avoid appearing self-assured.\n\nSecond, when coming or going near or far, one must inform one’s disciples or fellow residents. If no one is present, one must tell the young attendants where one is going and when one will return.\n\nThird, when visiting places with men and women of different stations or attending occasions of celebration or mourning, one must temporarily cease personal freedoms, avoid seclusion in hidden or private places, and always come and go with companions, following the group.\n\nFourth, unless for urgent matters, one must not frequently come and go in a manner that draws attention, lest one invite disrespect.\n\nFifth, when coming or going and encountering officials, one must avoid being seen. If no place of concealment is available, one should stand in a secluded spot, in the shadow of a person or tree, maintaining a composed and reverent demeanor.\n\nSixth, when coming or going and suddenly encountering the carriages or palanquins of the noble, one must step aside and lower one’s body in deference.\n\nSeventh, unless for urgent matters, one must not venture out in wind, rain, mud, extreme cold, or heat, lest one’s appearance become disheveled and offensive to others.\n\nEighth, when coming or going through cities, villages, or populated areas, one must maintain a composed and dignified bearing, refraining from loud laughter. If questioned, one must respond with courtesy; unless the matter is urgent, silence is preferable.\n\nNinth, when coming or going and encountering wicked, foolish, or childish people who speak coarsely or mockingly, one must act as if one has not heard, without changing one’s expression.\n\nTenth, when coming or going, regardless of distance, one must carry a sitting cloth and other items such as a handkerchief or flask, as one would when staying in place, adjusting as appropriate.\n\nEleventh, if one encounters disorderly circumstances or must stay overnight at a patron’s home, one should sprinkle water on the bed and wipe it with a cloth—this is called “purifying the bed”—to avoid contamination.\n\nTwelfth, when coming or going through cities or villages and witnessing improper or disorderly conduct or hearing vulgar or mocking words, one must lower one’s head and pass by directly, taking care not to look.\n\nThirteenth, when female Daoists come or go, regardless of distance or suspicion, they must always be accompanied to avoid impropriety.\n\nFourteenth, when coming or going through the gates of sacred images or the residences of elders, one must not pass through the central gate but enter and exit through a side door, turning sideways.\n\n**Chapter on Rising and Sitting**\n\nFirst, the manner of rising and sitting must observe distinctions of rank. Without proper hierarchy, one differs little from those of other stations.\n\nSecond, in Dharma assemblies, a male official should step forward, perform three bows, kneel, and with hands clasped say: “The humble disciple so-and-so requests the assembly to be seated.” The same applies to female Daoists.\n\nThird, in the presence of sacred images, the master should recite the ritual scripture, and the young attendants should do likewise, while laymen should be seated appropriately.\n\nFourth, when in the presence of scriptures, images, or elders, one must compose one’s demeanor, refraining from arrogance, laxity, or improper speech.\n\nFifth, in the presence of scriptures, images, or elders, one must not turn one’s back to the sacred texts, images, or honored masters.\n\nSixth, when attending to one’s revered master or elders, one must stand upright, without leaning against beds, walls, or other objects.\n\nSeventh, when attending to one’s master or elders, one must maintain solemnity and speak only when questioned.\n\nEighth, when attending to one’s master or elders, one must stand upon the ground. Only after being granted permission to sit and receiving repeated instructions may one bow in gratitude and then be seated.\n\nNinth, when attending to one’s master or elders, if another person present is more venerable than one’s own master or elder, one must follow the instructions of the former, first expressing gratitude before sitting.\n\nTenth, in refectories, lecture halls, or places where scriptures are studied or repentance rituals conducted, one must sit and rise according to the proper ranks, without overstepping one’s position, strictly adhering to the prescribed order of precepts and regulations.\n\nEleventh, after scriptures have been expounded in the Dharma hall, should one arrive late, one must discreetly take a seat in an appropriate place. Even if one possesses lofty virtue or status, one must still follow convenience and not proceed forward, causing disturbance or noise.\n\nTwelfth, once seated, unless for urgent matters, one must not frequently rise or move about, disrupting others by entering or exiting.\n\nThirteenth, in all places, whether walking, standing, sitting, or reclining, one must not mingle with those of improper character.\n\nFourteenth, when one’s master, elders, superiors, or others are reading documents or petitions in detail, if the matter does not concern oneself, one must not approach to peer or join in ignorance.\n\n**Chapter Five: On Vessels**\n\nFirst, men must not use pomegranate-shaped vessels.\n\nSecond, women must not use areca nut-shaped vessels.\n\nThird, vessels must be frequently scoured and washed to keep them bright and clean, free from dust, grime, or filth.\n\nFourth, vessels must not retain water overnight.\n\nFifth, in summer, water must be changed daily; failure to do so renders it impure.\n\nSixth, in winter, water may be changed every two days.\n\nSeventh, clay vessels may be changed every three days, but they must not be placed in unclean areas; this is strictly prohibited.\n\nEighth, vessels used for urination or defecation must be kept separate. One must first cleanse the front and rear, then scrub one’s hands with brick or stone, and further purify them with ash or soapberry. Violations bar one from attending morning audiences with the immortals, ascending the hall to pay respects to one’s master, receiving others’ bows, or joining the assembly.\n\nNinth, after use, vessels must be placed in stable locations to prevent tipping; this is greatly prohibited.\n\nTenth, if others wish to examine a vessel, including children carrying it, one must ensure no unclean hands touch its handle, keeping it immaculate.\n\nEleventh, vessels must be safeguarded and kept clean, both inside and out, with the same care as scriptures and sacred images.\n\n**Chapter Six: On Washing and Rinsing**\n\nFirst, there are four occasions for washing and rinsing: morning rinsing, rinsing after reading, rinsing after meals, and rinsing upon rising from bed.\n\nSecond, one must rinse the mouth three times on each occasion.\n\nThird, after meals, one should use a solution of willow twigs, which both cleanses impurities and prevents tooth decay. If willow twigs are unavailable, use fine ash.\n\nFourth, when first using willow twigs, recite the incantation:\n*\"The harmonious qi of the sun,\nUnfurls the spring willow.\nBreak off a twig,\nTo purify body and mouth.\nCultivating the Dao, refining the true,\nMay all three realms be delivered.\nSwiftly, swiftly, as the law commands.\"*\n\nFifth, when using ash, recite the incantation:\n*\"Washing ash removes filth,\nAsh is foremost for cleansing.\nImpurity departs, the true arrives,\nPurifying heart and mouth.\nAttaining the Dao, delivering others,\nAs enduring as heaven and earth.\nSwiftly, swiftly, as the law commands.\"*\n\nSixth, when rinsing or washing, one must turn to the side and face away from others, never performing these acts directly before them.\n\nSeventh, when using water, one must not touch the water in the basin with one’s hands; instead, use a wooden ladle to draw water from the basin, and do not let the ladle touch the basin.\n\nEighth, if one inadvertently touches the water, one must confess and repent, then personally replenish the basin with fresh water to avoid incurring transgression.\n\nNinth, when rinsing the mouth or washing the face, one must not make gurgling sounds or expel bubbles from the nose or mouth, nor strike or tap water vessels to disturb others.\n\nTenth, when using water, one must not waste or trample it carelessly.\n\nEleventh, one must not spit or spray impure water before others or onto clean ground.\n\nTwelfth, when using any item, including water and other objects, one must practice frugality and avoid wasteful or frivolous use.\n\n**Chapter Seven: On Towels and Utensils**\n\nFirst, towels and utensils are used for receiving and partaking in vegetarian meals.\n\nSecond, vegetarian meals, offered to both sacred and ordinary beings, are of the utmost importance.\n\nThird, one’s robes should be clean, and one’s seat immaculate; thus, one must first spread the sitting mat before taking one’s place.\n\nFourth, towels and utensils should be pure; thus, one must first wash one’s hands before handling them.\n\nFifth, one must first present clean water before opening the utensils to receive food. The wise regard food as heaven, while ordinary people regard it as life; thus, it is of the greatest importance.\n\nSixth, towels and utensils serve the same purpose. When not in use, they must be kept together in one place.\n\nSeventh, towels and utensils must be protected and kept clean as one; they are to be used solely for vegetarian meals and nothing else.\n\nEighth, utensils for vegetarian meals must be stored on separate shelves or stands, not mixed with other vessels. The ancients called these \"vegetarian utensils.\"\n\nNinth, vegetarian utensils embody the five phases and serve the fivefold functions, receiving the five flavors of food. They may be made of lacquered wood or bronze, procured according to one’s means.\n\nTenth, vegetarian towels should be made of thick, dense cloth, four feet in length, hemmed and stitched, and kept spotlessly white.\n\n**Chapter Eight: On Vegetarian Meals**\n\nFirst, during meals, one person must be appointed as the hall monitor, also called the meal supervisor. \"Vegetarian\" means \"regulated\"; this person oversees the rhythm of bells and chimes, corrects errors, and is thus called the supervisor of the Dharma master’s meal.\n\nSecond, when ascending to the hall to partake in the meal, one must wear clean and proper attire.\n\nThird, one must first wash one’s hands and handle the utensils, then place them to the left upon entering the hall, covering them with a towel.\n\nFourth, when performing repentance rituals, all should sit evenly according to the number of participants, removing their shoes and placing them beneath their seats, ensuring they do not obstruct those making offerings.\n\nFifth, one must first carry the purifying water, taking care that the vessels do not collide with others.\n\nSixth, after receiving the water, first take the towel, holding its center with the corner facing forward, letting seven inches hang down to spread it. Then, place the vegetarian utensils, and spread a second towel over the knees, ensuring both are laid with palms facing upward.\n\nSeventh, when setting out the meal utensils, arrange them in order from one to five, without skipping or disorder.\n\nEighth, the hall monitor shall stand upright beside the chime in the hall and strike it once to offer prayers for the longevity of the reigning emperor, or to invoke blessings, expiation, or merit-transfer for the ten-directional benefactors, adapting the invocation to the occasion and expressing gratitude for their protection.\n\nNext, a master shall be appointed to lead the prayers, the text of which is recorded in the *Seven Perfected Regulations*.\n\nNinth, when serving congee, recite the incantation:\n*\"This morning’s fragrant congee is offered to the Three Honored Ones.\nMay it benefit the nation and enrich the benefactors.\nMay all sentient beings in the six realms be fully sated.\"*\n\nTenth, when serving the meal, recite the incantation:\n*\"Among all fields of merit,\noffering food is foremost.\nThose present receive joy,\nthe departed are reborn in heaven.\nIn the future, they shall dwell in the Pure Land,\nwhere clothing and sustenance arise naturally.\nThus, we now make this offering,\nuniversally presented to all deities.\"*\n\nEleventh, after the incantations, proceed to serve the meal. The meal supervisor must first instruct the servers to clearly and loudly announce each dish’s name, portioning the food equitably.\n\nTwelfth, when the meal is served, the meal supervisor shall strike the chime once and say: *\"All benefactors of this vegetarian offering shall bow together in reverence, exchanging respectful glances before beginning to eat.\"*\n\nThirteenth, when receiving food, take only three portions, serving oneself sufficiently without leaving excess or disorder, lest it offend others and diminish reverence and faith.\n\nFourteenth, upon hearing the dish’s name announced, one must hold the utensil and receive the food with hands.\n\nFifteenth, if declining, gesture to decline; if the portion is too large, withdraw the hand; if too small, extend it—no verbal complaints are permitted.\n\nSixteenth, during the meal, those seated above and below should observe one another. Those eating slowly should hasten slightly, while those eating quickly should slow down, ensuring uniformity.\n\nSeventeenth, the meal supervisor must oversee the entire meal. If more than half have finished, a second serving may be offered.\n\nEighteenth, one must not indulge their nature to the point of causing resentment among those who eat slowly.\n\nNineteenth, one must eat finely, chewing quickly but swallowing slowly, avoiding slurping or clinking utensils, lest it incur the sin of lacking compassion.\n\nTwentieth, after the meal, unless in cases of military urgency, sudden crises, fire, theft, or death, no speech is permitted to disturb the solemnity of the vegetarian hall.\n\nTwenty-first, any instructions during the meal must be given by hand gestures, speaking only in a low voice.\n\nTwenty-second, after the meal, any remaining fruit or food shall be collected and distributed to those of lower status or the sick and beggars; none may be taken away with the utensils.\n\nTwenty-third, after eating, first fold the towels from the knees, then gather the utensils in order from the fifth to the first, placing them on the towel.\n\nTwenty-fourth, after the meal, purifying water shall be used to wash the utensils. Once the water is collected, the chime shall be struck, and the blessing of the offering shall be recited, followed by the blessing of the remaining merit-transfer, the texts of which are recorded in the *Seven Perfected Precepts*.\n\nTwenty-fifth, if there is no special occasion, the prayer texts may be omitted.\n\nTwenty-sixth, the prayer shall say:\n*\"Though the vegetarian ritual is complete,\nwe fear its merit may yet be imperfect.\nThus, we further offer pure wealth to the Three Treasures,\nthat the benefactors may gain blessings and the merit be perfected.\"*\n\nTwenty-seventh, for the offering of food, the prayer shall say:\n*\"The Dharma meal for the Three Treasures is now fully offered.\nWe transfer it to the attendants,\npraying that the young and lowly alike share in the merit of this meal,\nfree from all obstacles.\"*\n\nTwenty-eighth, after striking the chime and announcing the meal’s conclusion, all shall recite the Dharma meal’s dedication:\n*\"May all fields of merit be universally blessed,\nmay the ten directions be liberated,\nand may the three realms be at peace.\"*\n\nTwenty-ninth, if anyone violates the precepts during the meal, the meal supervisor must announce it and instruct the offender to bow in repentance.\n\nThirtieth, the chime shall be struck again, and the verse of exhortation shall be recited:\n*\"Having heard this Dharma,\nmay our bodies and minds be as pure as lapis lazuli vessels.\nWith joy and reverence, we bow in homage to the Supreme Three Honored Ones.\"*\n\nThirty-first, the *Three Bows* shall be recited. If there is a special occasion, the *Three Vows* may be recited instead; further details are not recorded here.\n\nThirty-second, when the meal is entirely concluded, the chime shall be struck, and the *Random Vows* shall be recited. All shall bow reverently, hold their utensils, and depart.\n\nThirty-third, those leaving shall rise in order, proceed in formation, and return to their quarters without gathering or engaging in loud conversation to disturb the assembly.\n\n**Chapter Nine: On Requesting the Dharma**\n\nThe Dharma is called a treasure; for those who respectfully receive it, it is truly wondrous.\nFirst, it benefits oneself by transmitting the Dharma to others;\nsecond, it benefits others by guiding them to the wondrous fruit.\nThe merit of transmitting the Dharma advances one to the ranks of immortals.\nThus, requesting the Dharma must be done with reverence and sincerity.\n\nFirst, there are two types of Dharma masters to be invited:\n1. Those who expound the Dharma, lecture on sutras, transmit regulations, and confer precepts;\n2. Those temporarily invited to resolve doubts.\nIn both cases, one must bow in reverence, treat them with care and respect, and prostrate with sincerity.\n\nSecond, when lecturing on sutras or expounding the Dharma, one must assess the scale and distance beforehand, submitting a written request in advance. The paper must be of good quality, the script written in standard, neat calligraphy, and the text composed with proper purity and solemnity. Hasty, careless, or disrespectful language is not permitted.\n\nThird, when presenting a written request for minor matters, one must first perform the rites of reverence, completing three bows. Then, holding the document, kneel upright to state its purpose, and with hands clasped, present it to the recipient. Upon receiving the document, perform three bows again, express gratitude, and withdraw.\n\nFourth, for matters of great importance, when presenting a written request, perform the rites while holding the document—either seven or up to nine bows—then kneel upright to state the matter. Afterward, perform three more bows. Upon completing the presentation, kneel upright again and express gratitude, saying: *\"This humble one has been graciously bestowed with compassion, and I am overwhelmed with fortune.\"*\n\nFifth, if the recipient has not yet accepted the document, continue bowing without limit until permission is granted. If permission is still not given, withdraw temporarily and wait for another opportunity, presenting it again with repeated bows. As the *Dingzhi Sutra* states: *\"Even if blood flows in torrents, the heart must not waver. Without wholehearted devotion, one cannot knock upon the gates of the hidden realm, prostrate at the master’s threshold, or bow before the sanctuary of virtue—ultimately, no transmission will be received.\"*\n\nSixth, when temporarily inviting a master to resolve doubts, first perform three bows, then kneel upright with hands clasped to present the matter in question. After the explanation, perform three more bows, rise, and with hands clasped, express gratitude, saying: *\"This foolish disciple, though unworthy, has been graciously favored by the Dharma master, who has deigned to clarify the truth. I am filled with boundless joy.\"* Then perform three bows and withdraw.\n\nSeventh, if a venerable elder of high virtue arrives to present a written request, invite an almsgiving, or expound upon the meaning of sutras, their titles, or discuss their principles, one should receive them at dawn while seated. After bowing to the document, announce with gratitude: *\"This ignorant disciple, untutored in such explanations, is deeply honored by your command and filled with reverence.\"* Then perform three bows in return, honoring their virtue.\n\nEighth, if the recipient is a master or teacher who has previously transmitted the Dharma, and they present a written command, wait until three bows are completed, then prostrate to receive it. Kneel upright and hold the document aloft with both hands over the crown of the head for a long moment before placing it on the table. Perform three bows, kneel upright, and express gratitude, saying: *\"This unworthy disciple, suddenly entrusted with such a solemn command, is filled with awe and trepidation.\"* Alternatively, one may say: *\"I dare not perform three bows before withdrawing.\"*\n\nNinth, the phrase *\"I dare not\"* carries two meanings: when receiving, one dares not refuse; when refusing, one dares not receive.\n\n**Chapter Ten: On Upholding and Safeguarding**\n\nUpholding and safeguarding comprises seven aspects: 1) safeguarding the Dharma robes, 2) safeguarding the Dharma, 3) safeguarding the sutras, 4) safeguarding the master, 5) safeguarding one’s own body, 6) safeguarding donors from the ten directions, and 7) safeguarding all sentient beings.\n\nFirst, sutras and images are of one essence and must be treated without distinction. As the regulations state: *\"Wherever sutras and images reside, they must be kept pure and protected, enclosed by bamboo frames. When temporarily leaving, cover them with a clean cloth. When reading, do not unfold more than three lines at once, and if interrupted, roll them up immediately. Do not pause mid-scroll; if urgent matters arise before completion, begin anew from the start when resuming recitations or repentance rituals.\"*\n\nSecond, do not allow impure persons, nor those with impure bodies, speech, or foul breath, to touch them.\n\nThird, when handling sutras or images, purify both hands and mind, and do not hold other objects. If placing them above other items, or moving objects aside, seek assistance. If no one is available, shift items slightly, then wash hands before touching the sutra stand—this applies to both upper and lower surfaces. If other objects are touched, wash hands again.\n\nFourth, sutras and images must not share a room. If they are stored in black-lacquered cases alongside other items, or within a cabinet, temporary residence may be permitted. However, if stored in plain cases or bundles, even within a cabinet, this is not permissible.\n\nFifth, when in a grand hall or assembly space, whether by day or night, if fatigue from Dharma affairs arises, one may rest briefly but must do so with the body curled to the side, never sprawling carelessly with limbs outstretched or snoring through the nose and mouth. If others are present, remind them; if they remain silent upon hearing, their negligence is as grave as disrespecting the Dharma.\n\nSixth, among the four assemblies, when sitting, standing, or walking, do not engage in idle chatter or laughter with outsiders.\n\nSeventh, diligent study is not as crucial as choosing a master wisely. If a master’s virtue is lacking, do not seek their instruction. Once a true master is found, serve them as one would a treasure, exerting every effort in devotion until the Dao is attained, never parting from their guidance.\n\nEighth, if a master errs or makes a mistake, do not slander them. Instead, discreetly and respectfully kneel to inquire repeatedly, adhering to the Dharma regulations. If others speak of the master’s virtues or faults, clarify the matter. If unable to do so, leave immediately—this is the mark of one who safeguards their master.\n\nNinth, the master’s bed, desk, walking staff, clothing, ink, and all other belongings must be upheld and protected, never defiled or mishandled.\n\nTenth, if in an assembly one violates the sutra regulations and is admonished by the community, accepting the due penalty with eagerness, joy, humility, and gratitude—this is the sign of a true practitioner. Such a person swiftly eradicates immeasurable transgressions, swiftly attains the supreme fruit of the Way, and embodies the great upholding of the Dharma.\n\nEleventh, in safeguarding donors from the ten directions—whether known or unknown, high or low, male or female, noble or humble, near or far—all must be treated with reverence. Their lodging, comings and goings, seating, tasks, comforts, hunger and satiety, likes and dislikes, adversities and fortunes, health and illness must all be managed with fairness and balance, offering respectful consolation, appropriate rewards, and measured reproach.\n\nTwelfth, all sentient beings, even the smallest creatures, if found in peril—fallen into water or fire, or any life-threatening situation—must be rescued within one’s capacity, ensuring their safety and peace.\n\nThirteenth, in all movements—whether walking, standing, entering, or exiting—resting or passing by, in matters of regional governance, fame, or profit, in dealings with relatives or strangers, men or women, one must refrain from frivolous or deceitful speech that might arouse doubt among sentient beings. This is called safeguarding the virtuous fruit of all beings.\n\nFourteenth, if any repeatedly violate the precepts, disturb the pure assembly, resist admonishment, or conceal their faults, they must be reported to the assembly and removed from the fasting ranks, as detailed in the *Treatise on the Dignified Observances of Fasting Precepts*.\n\nFifteenth, for Daoist robes and ritual garments, when removing or donning them, one must carefully fold and arrange them, either placing them in a cloth wrapper or in a quiet place. Only after completing the bow of reverence may one remove or put them on.\n\nSixteenth, if any, when handling Dharma matters, display arrogance, belligerence, or a propensity for conflict, one must report their conduct—whether auspicious or inauspicious—to superiors and avoid association with them. This is called \"concealed expulsion,\" ensuring they do not follow the assembly.\n\nSeventeenth, when receiving food or alms, one should defer to others and take modestly, practicing frugality and restraint, so as not to arouse suspicion, disdain, or contempt among sentient beings, thereby harming life and virtue. This is the profound safeguarding of the Way.\n\nThe Most High said: The dignified observances comprise ten major principles, along with various precepts, totaling over one hundred and forty items. If one can study and recite them diligently, and practice them earnestly, they will have already embodied the previous ten principles and all related regulations—this is called \"safeguarding the body,\" ensuring one does not transgress. Furthermore, teaching others these virtuous fruits is boundless; all sages rejoice, and the gods feel shame.\n\nSuch a person, in this very life, will attain ten kinds of blessings and reverence. As the *Scripture of Ascending the Mystery* states, and as the regulations on ritual attire affirm, one of this kind is called a \"Greatly Compliant Perfected Person,\" who, without leaving this lifetime, enters the ranks of the sages.\n\nIf, however, there are those who, without sincere devotion to the Dao, cling to the periphery of the Dharma gate, seeking profit, defiling the Daoist robes, disgracing the flow of the Dharma, associating with evil companions, envying others’ virtuous conduct, violating the precepts themselves, and discouraging others from cultivation—who disregard their teachers’ instructions, grow more defiant upon hearing the teachings, feel no shame, and bear no gratitude—such people are called \"transgressors, rebels, and ferocious beasts.\" Though they have barely entered the human realm, they have not yet attained a human heart; though they have momentarily joined human society, they defile the sacred Dharma. Their aspirations and conduct resemble those of prisoners in the dark or beasts in bondage. Even when separated from other beings, they remain unawakened, clinging to their habitual tendencies, longing to return to their original nature—how deeply painful! How pitiful!\n\nIn this life, such a person loses ten kinds of merit, ten kinds of reverence, incurs ten kinds of contempt, and distances themselves from ten kinds of sages. The five sufferings and eight adversities manifest in their body. Upon the end of this life, they will enter the long night of the Nine Dark Hells, enduring every form of agony, ceaselessly revolving through the three evil destinies, with no hope of liberation.\n\nUpon hearing these essential words from the Most High, the Perfected of No-Thought and others wept tears of joy, leaping with exultation. They bowed in reverence, expressed their gratitude, and vowed to receive and uphold the teachings.\n\nHere ends the *Ten Dignified Observances of the Mystery Gate*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "玄门十事威仪 经名：玄门十事威仪。 一卷。 底本出处：《正统道藏》洞神部威仪类。 玄门十事威仪 尔时，太上老君告无想真人等众法服科戒已，又说威仪十事，未与子宣，今授此言，最为切要。 如人欲行，非足不步； 欲进妙道，非门不入。 十事科戒，为道之门。 入吾门者，欲与仙齐，隔离外俗。 凡夫之人，若持十事者，名为不凡。 夫生死因缘，罪恶轮转，毁辱法身，轻慢法服，进道无序，善业不生，人我自恣，无惭愧之心，九幽大罪，日夜增长，行住坐卧，出入有法。 如是凡夫，众生不异，真仙大圣，不喜见闻，天魔神鬼，皆所恶嫉，人王君长，不生恭敬，十方男女，无不轻薄，自无功德，长他恶根，两头营罪，苦报何极。 吾见此辈，痛哉寒心。 今故殷勤，重告於子，宜遵奉行，晓示来学，提携指掌，必令调熟，十事成就，诸天鉴观，十方人天，天魔神鬼，悉皆畏敬，咸生善意，无敢违犯，增长福田，善果普生，功德无量。 能如是者，是我弟子，堪传妙法，道宜速近。 不如是者，魔鬼眷属，日夕亲近，不得远离。 无想等闻，是妙旨稽首，心惊惭愧，悲喜交集，涕泪俱下，愿闻十事威仪，弥劫奉行。 太上曰： 一者执坛，二者礼谒，",
      "translated_text": "At that time, the Most High Lord Lao, having expounded the precepts of ritual vestments to the Perfected of No-Thought and the assembled disciples, further declared the ten matters of decorum, which had not yet been revealed to you. Now I transmit these words, for they are most essential.\n\nJust as one who wishes to walk cannot do so without feet, so one who seeks to enter the wondrous Dao cannot do so without a gate. These ten precepts of decorum are the gate of the Dao. Those who enter my gate aspire to equal the immortals, separating themselves from the profane world.\n\nOrdinary beings who uphold these ten matters are called no longer common. The causes of birth and death, the wheel of transgressions, the defilement of the Dharma-body, the disdain for ritual vestments, the disorderly pursuit of the Dao, the failure to cultivate wholesome karma, the indulgence in self and ego, the absence of shame and remorse—these grave offenses in the Nine Dark Realms grow day and night. Whether walking, standing, sitting, or reclining, whether entering or exiting, there is a proper way.\n\nSuch ordinary beings differ not from the masses of sentient life. True immortals and great sages take no joy in seeing or hearing of them. Heavenly demons, spirits, and ghosts all despise and envy them. Kings and rulers feel no reverence for them. Men and women in the ten directions hold them in contempt. Lacking merit and virtue themselves, they nurture the roots of others’ evil. They cultivate transgressions at both ends—how boundless their suffering retribution!\n\nI behold such beings and grieve with a chill in my heart. Therefore, I earnestly repeat this teaching to you. You should uphold and practice it, clearly instructing those who come to learn. Guide them with care, ensuring they master these matters. When the ten matters are perfected, the gods of the heavens will observe and approve. The people and gods of the ten directions, the heavenly demons, spirits, and ghosts—all will stand in awe and reverence, harboring only goodwill, none daring to transgress. Merit fields will flourish, wholesome fruits will arise universally, and boundless virtue will accrue.\n\nThose who can do thus are my true disciples, worthy to transmit the wondrous Dharma, swiftly drawing near to the Dao. Those who cannot are kin to demons and ghosts, ever drawing closer to them day and night, never to escape.\n\nUpon hearing these profound teachings, the Perfected of No-Thought and the assembly bowed their heads in reverence, their hearts filled with awe and shame. Joy and sorrow mingled as tears streamed down. They vowed to uphold the ten matters of decorum for kalpas without end.\n\nThe Most High said:\nFirst, maintaining the altar;\nSecond, paying respects and making obeisance;",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 473,
      "start_sentence": 0,
      "end_sentence": 19,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.429953813552856,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\玄门十事威仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "三者出入，四者坐起， 五者执瓶，六者洗漱， 七者巾器，八者斋食， 九者请法，十者护持。 此之十事，是吾教门中事也，当付汝等，习而行之，劝教男女，升入仙品。 无想稽首，扣头着地，长跪信受。 执坐坛品第一 夫坐坛者，隔凡去秽，护净自持，擅道德之不草，慕天真之高迹。 第一，起坐出入，常不离身。 若因事暂放，不得辄安杂秽之所，先以具拂拭其所，或以净物盛之。 第二，每将行用，或挂膊上，或搭左手，以缘口向外。 第三，每欲作拜礼，先将右手提角悬起，便将左手以三指挟极，两头平放，下面着地。 第四，先举左足心，安第二棱上立，次举右足，向上半跪而铺，务在平正。 第五，拱手起退，右足归第二棱上，立平稳乃礼，三拜讫。 第六，便起仰右手，就角二指取收，勿令触他，或取中棱亦得。 第七，着鞋履讫，便过入左手，侧身而折，勿近人面。 第八，折讫，挂於左手，以道衣霞帔覆之，向前起居。 礼谒品第二 夫礼谒者：一名屈己，二名敬己，三名敬他。 心敬难识，形屈可见，故须形礼殷勤，以表内心珍重。 屈己致敬，为有所求事，有一十二种：一惭愧，二悔谢，三求法，四除傲慢，五尊德，六慰贺，七灭罪，八惩戒，九报恩，十物奉，十一现世人欢喜，十二未来天下恭敬。 第一，礼谒安详得所，容止可观。 第二，秉简当心，端身平立。",
      "translated_text": "Third, movement in and out;\nFourth, sitting and rising;\nFifth, holding the flask;\nSixth, washing and rinsing;\nSeventh, cloths and vessels;\nEighth, fasting and eating;\nNinth, requesting the Dharma;\nTenth, protection and upholding.\n\nThese ten matters are the affairs within my teaching gate. They shall be entrusted to you all—study and practice them, exhorting both men and women to ascend into the ranks of immortals.\n\nThe Perfected of No-Thought bowed his head to the ground, prostrating himself in long reverence, and knelt in earnest acceptance.\n\n**Chapter One: Holding and Seating the Altar**\n\nNow, as for seating the altar: it separates the mundane and removes defilement, safeguarding purity and self-discipline. One must not treat the Dao’s virtue with negligence, but rather emulate the lofty traces of celestial perfected beings.\n\nFirst, when rising, sitting, going out, or entering, it should never leave one’s person. If, for some matter, it must temporarily be set aside, it must not be placed in any impure or杂乱之处. First, sweep or wipe the area, or place it within a clean vessel.\n\nSecond, whenever carrying it for use, either hang it upon the arm or drape it over the left hand, with the cord’s opening facing outward.\n\nThird, whenever performing obeisance, first lift the corner with the right hand and suspend it, then use the left hand’s three fingers to grasp the edge, laying it flat with both ends even before placing it upon the ground.\n\nFourth, first raise the left sole and place it upon the second ridge to stand, then lift the right foot, half-kneeling to spread it evenly, ensuring it lies level and straight.\n\nFifth, clasp the hands and rise, stepping back so the right foot returns to the second ridge. Stand steadily before performing the three bows.\n\nSixth, then raise the right hand to grasp the corner with two fingers and retrieve it, taking care not to let it touch anything else. Grasping the middle ridge is also permissible.\n\nSeventh, after putting on shoes or sandals, transfer it to the left hand, turning the body to fold it, keeping it away from others’ faces.\n\nEighth, once folded, hang it upon the left hand, covering it with the Daoist robe or cloud-patterned sash before proceeding with greetings.\n\n**Chapter Two: Paying Respects and Making Obeisance**\n\nNow, as for paying respects and making obeisance: it is called humbling oneself, revering oneself, and revering others. While inner reverence is difficult to perceive, outward humility is visible. Thus, one must perform formal rites with diligence to express the heart’s profound esteem.\n\nHumbling oneself to show respect serves twelve purposes: first, shame and remorse; second, repentance and gratitude; third, seeking the Dharma; fourth, eliminating arrogance; fifth, honoring virtue; sixth, consolation and congratulation; seventh, eradicating transgressions; eighth, discipline and admonition; ninth, repaying kindness; tenth, offering objects; eleventh, bringing joy to people in this life; twelfth, earning reverence from all under heaven in the future.\n\nFirst, when paying respects and making obeisance, one must be composed and proper, with a demeanor worthy of admiration.\n\nSecond, hold the tablet centered before the heart, standing upright with a straight body.",
      "overlap_context": "ing near to the Dao. Those who cannot are kin to demons and ghosts, ever drawing closer to them day and night, never to escape.\n\nUpon hearing these profound teachings, the Perfected of No-Thought and the assembly bowed their heads in reverence, their hearts filled with awe and shame. Joy and sorrow mingled as tears streamed down. They vowed to uphold the ten matters of decorum for kalpas without end.\n\nThe Most High said:\nFirst, maintaining the altar;\nSecond, paying respects and making obeisance;",
      "start_char": 473,
      "end_char": 1020,
      "start_sentence": 20,
      "end_sentence": 42,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.433043718338013,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\玄门十事威仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "第三； 五体投地，前后平齐。 第四，见尊像经法，或值礼忏法事，必须作礼。 第五，见尊师名德，必须作礼。 第六，见受业师作礼。 第七，见胜己善友作礼。 第八，见四海同学作礼。 第九，事师辞去，及归室宿，已上皆先作礼，言限来日，珍重而去，到家亦须作礼，然后起居问评安否。 第十，辞出外境及归，或经月，或经年，且须先礼三拜，然后长跪伏地，重感拜讫，乃通寒温起居，此为事师之礼。 第十一，或师主隔绝他州别县，相去稀疏，久经岁月，皆须作礼长跪，言其情状，伏地悲感，再拜起居。 若彼此会，有吉凶言及，皆须称贺，吊慰再拜。 第十二，吉凶庆吊则悲。 礼毕，然后重悲。 待长者语毕，又须作礼。 若自受庆吊亦然。 第十三，若得长者善言教示，或责辱训罚，皆须作礼，言谢低声，以酬德教。 第十四，凡受礼拜，皆须擎拳，拱手辞谢，推高托尊。 第十五，凡礼拜师，皆须待坐。 合拜，须坐而受。 若师自外远还，送至方丈，待师坐定，然后作礼，不得於门下、廊下，忽忽即事。 第十六，凡在殿堂，对圣像，及师长大德，皆不得受人礼拜。 若他人不知，忽然作礼，须言其事止之。 忽於殿堂见年尊有德者，亦须言其事，云未敢就便作礼。 出入品第三 第一，凡行住，有难处、置疑处，皆须要伴，不得独行，以自明白故。 第二，远近出入，皆须辞徒弟众，或同院窗。 无人，须向童行说去甚处，某时即归。 第三，若往男女非类之处，或因吉凶斋会，暂时停止，解脱出入，群徒共住一处，不得独因亲故，港隐幽僻之处，来须逐伴，去则随众。 第四，若非急难事，有所需求，不须频频出入，数令人见，自致轻薄。 第五，出入若逢官长，预须隐避，勿令露现。 苟无隐处，宜向僻处，或人影树影中立，仍须敛容恭敬。 第六，出入忽逢尊贵车马辈舆，并须避道，低身偎形。 第七，若无急事，不须冒涉风雨泥涂，隆寒大热，披褐狼籍，人所恶见。 第八，出入城邑聚落、人物之处，行立须是敛容正色，不得高声大笑。 若有咨问，皆须以礼言对，非急事，不语为上。 第九，凡出入遇恶人、愚人、童稚，邪言秽语，相轻调讳，犹若不闻，勿变颜色。 第十，出入不计远近，皆须坐坛相随，仍用手巾瓶等，与住时相似，并适其宜。 第十一，若值杂状，或施主家事须寝宿，即觅水洒床席，以巾拭之，名曰静床，用之无触。 第十二，出入城市、村曲，见人行非礼不轨之事，或闻不善调谑之词，即低头直过，慎勿顾之。 第十三，女冠出入，无论远近，疑与不疑，必须逐伴相随，以避嫌疑。 第十四，凡经像及大人门户出入，勿向中门，必从边小门侧身进退。 坐起品第四 第一，凡起坐法，有尊有卑。 若无上下禀承，此与异类无别。 第二，法会之所，男官一人向前三礼，长跪拱手云：已下法小师某甲请坐。 第三，女冠二人，亦如前请坐。 若有像处，大师念礼经像，童子亦然，善男安置得所。 第四，凡对经像、长者行处，须整敛容貌，不得倨傲放诞，言辞非法。 第五，凡对经像、长者，不得背经法尊像、大人师长。 第六，侍从尊师，及长者所在，皆须正立，不得倚托床壁，及诸等物。 第七，侍从师长，但须整肃，非顾问勿语。",
      "translated_text": "Third, prostrate with the five limbs touching the ground, front and back aligned evenly.\n\nFourth, upon seeing revered images, scriptures, or Dharma, or when encountering repentance rituals, one must perform obeisance.\n\nFifth, upon seeing a revered master of noble virtue, one must perform obeisance.\n\nSixth, upon seeing one’s preceptor, one must perform obeisance.\n\nSeventh, upon seeing a virtuous friend superior to oneself, one must perform obeisance.\n\nEighth, upon seeing fellow students from all directions, one must perform obeisance.\n\nNinth, when taking leave of one’s master or returning to one’s chamber for the night, one must first perform obeisance, state the time of return on the following day, and depart with respect. Upon arriving home, one must also perform obeisance before engaging in conversation or inquiring after well-being.\n\nTenth, when departing for distant places or returning after a month or a year, one must first perform three bows, then kneel and prostrate fully to the ground, expressing deep gratitude before rising to exchange greetings. This is the proper etiquette for serving one’s master.\n\nEleventh, if the master resides in a distant province or county, with rare opportunities for meeting over long years, one must still perform obeisance, kneel, and express one’s feelings, prostrating with sorrow and emotion before rising to exchange greetings. If they meet and discuss matters of joy or sorrow, one must offer congratulations or condolences with repeated bows.\n\nTwelfth, in occasions of celebration or mourning, one must first express sorrow or joy through ritual, then deepen the sentiment afterward. One must wait until the elder has finished speaking before performing obeisance again. The same applies when receiving congratulations or condolences.\n\nThirteenth, upon receiving kind instruction or admonishment—even if it involves reproach or punishment—one must perform obeisance, express gratitude in a low voice, and repay the virtue of the teaching.\n\nFourteenth, when receiving obeisance, one must raise one’s fists in a respectful gesture, decline with clasped hands, and defer to the other’s honor.\n\nFifteenth, when performing obeisance to one’s master, one must wait for them to be seated. If a mutual bow is required, one must sit to receive it. If the master returns from afar, one should escort them to their chamber, wait until they are seated, and only then perform obeisance—not hastily at the doorway or corridor.\n\nSixteenth, in halls or temples, before sacred images or in the presence of masters and elders, one must not accept another’s obeisance. If someone unknowingly performs obeisance, one must explain the matter to stop them. If one encounters an elder of noble virtue in a hall, one must also explain that one dares not perform obeisance casually.\n\n**Chapter on Conduct When Coming and Going**\n\nFirst, when walking or standing in difficult or uncertain places, one must always have a companion and not proceed alone, so as to avoid appearing self-assured.\n\nSecond, when coming or going near or far, one must inform one’s disciples or fellow residents. If no one is present, one must tell the young attendants where one is going and when one will return.\n\nThird, when visiting places with men and women of different stations or attending occasions of celebration or mourning, one must temporarily cease personal freedoms, avoid seclusion in hidden or private places, and always come and go with companions, following the group.\n\nFourth, unless for urgent matters, one must not frequently come and go in a manner that draws attention, lest one invite disrespect.\n\nFifth, when coming or going and encountering officials, one must avoid being seen. If no place of concealment is available, one should stand in a secluded spot, in the shadow of a person or tree, maintaining a composed and reverent demeanor.\n\nSixth, when coming or going and suddenly encountering the carriages or palanquins of the noble, one must step aside and lower one’s body in deference.\n\nSeventh, unless for urgent matters, one must not venture out in wind, rain, mud, extreme cold, or heat, lest one’s appearance become disheveled and offensive to others.\n\nEighth, when coming or going through cities, villages, or populated areas, one must maintain a composed and dignified bearing, refraining from loud laughter. If questioned, one must respond with courtesy; unless the matter is urgent, silence is preferable.\n\nNinth, when coming or going and encountering wicked, foolish, or childish people who speak coarsely or mockingly, one must act as if one has not heard, without changing one’s expression.\n\nTenth, when coming or going, regardless of distance, one must carry a sitting cloth and other items such as a handkerchief or flask, as one would when staying in place, adjusting as appropriate.\n\nEleventh, if one encounters disorderly circumstances or must stay overnight at a patron’s home, one should sprinkle water on the bed and wipe it with a cloth—this is called “purifying the bed”—to avoid contamination.\n\nTwelfth, when coming or going through cities or villages and witnessing improper or disorderly conduct or hearing vulgar or mocking words, one must lower one’s head and pass by directly, taking care not to look.\n\nThirteenth, when female Daoists come or go, regardless of distance or suspicion, they must always be accompanied to avoid impropriety.\n\nFourteenth, when coming or going through the gates of sacred images or the residences of elders, one must not pass through the central gate but enter and exit through a side door, turning sideways.\n\n**Chapter on Rising and Sitting**\n\nFirst, the manner of rising and sitting must observe distinctions of rank. Without proper hierarchy, one differs little from those of other stations.\n\nSecond, in Dharma assemblies, a male official should step forward, perform three bows, kneel, and with hands clasped say: “The humble disciple so-and-so requests the assembly to be seated.” The same applies to female Daoists.\n\nThird, in the presence of sacred images, the master should recite the ritual scripture, and the young attendants should do likewise, while laymen should be seated appropriately.\n\nFourth, when in the presence of scriptures, images, or elders, one must compose one’s demeanor, refraining from arrogance, laxity, or improper speech.\n\nFifth, in the presence of scriptures, images, or elders, one must not turn one’s back to the sacred texts, images, or honored masters.\n\nSixth, when attending to one’s revered master or elders, one must stand upright, without leaning against beds, walls, or other objects.\n\nSeventh, when attending to one’s master or elders, one must maintain solemnity and speak only when questioned.",
      "overlap_context": "noring virtue; sixth, consolation and congratulation; seventh, eradicating transgressions; eighth, discipline and admonition; ninth, repaying kindness; tenth, offering objects; eleventh, bringing joy to people in this life; twelfth, earning reverence from all under heaven in the future.\n\nFirst, when paying respects and making obeisance, one must be composed and proper, with a demeanor worthy of admiration.\n\nSecond, hold the tablet centered before the heart, standing upright with a straight body.",
      "start_char": 1020,
      "end_char": 2239,
      "start_sentence": 43,
      "end_sentence": 93,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.800315380096436,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\玄门十事威仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "第八，凡侍从师长所在，且须立地。 待命与坐，再三指挥，然后稽首致谢而坐。 第九，凡侍从师长之所，人或更尊於师长，即从前人所命，仍须谢於前人而坐。 第十，凡斋堂，讲习经典、礼忏法事之所，坐起须依法位，不得越坐，一如科戒定式所排。 第十一，凡法堂宣经之后、忽若后来，须方便随处而坐。 纵恃尊德？ 亦须随便，不得向前，起动喧挠。 第十二，凡一坐而后，若非急事，不得数有起动，出入乱人。 第十三，凡所在之处，行住坐卧，不得与非类之人混同一处。 第十四，凡师长尊上、及他人，看读书疏委曲，不干己事者，不得向前窥视、同为无识。 执瓶品第五 第一，男不得将石榴瓶。 第二，女不得将槟榔瓶。 第三，须频换水磨洗，常令光净，不令尘垢秽污。 第四，瓶不得宿水在内。 第五，夏月每日易之，一日不易，名为秽水。 第六，冬月许两日一易。 第七，瓦瓶可三日一易，不得安置秽处，切宜忌之。 第八，凡大小便处，须别用瓶。 先净於前后，净於前后，然后以砖石磨手，仍以灰皂角净之。 如违，不得朝真，升殿礼师，亦不得受人礼拜，及随大众。 第九，凡瓶用了，须要置稳处，勿令触倒，於此大忌。 第十，凡瓶，有人欲看，并童稚提擎，勿使秽手触把，须令洁净。 第十一，护瓶内外，甚於余物，与经像洁净一般。 洗漱品第六 第一，凡洗漱，有四种：一平旦漱，二读书漱，三食后漱，四卧起漱。 第二，凡漱口，并须三过。 第三，若食后，须用杨柳枝汤水，一能洗秽，二除齿风。 若无柳枝，即用诤灰。 第四，凡初用杨柳，咒曰：太阳和气，开春发柳。 折取一枝，能净身口。 学道修真，愿度三有。 急急如律令。 第五，凡用灰，咒曰：洗灰除垢，用灰为首。 秽去真来，净心净口。 成道度人，天长地久。 急急如律令。 第六，漱盥，皆偏侧，并背人，不得当人为之。 第七，凡用水，不得以手触盆中水，当以木杓於盆中取，又不得着杓於盆中触。 第八，既有犯触，当须自首忏悔，仍自役力，换水置中，即不结罪。 第九，漱口洗面，不得漱缩作声，鼻口泡出，又不得扣打水器惊众。 第十，凡用水，不得狼籍括踏。 第十一，口中秽水，不得噀喷於众人前，及浄地上。 第十二，凡用物，不独在水，诸件等物，皆须俭约而已，不得等闲费用。 巾器品第七 第一，巾器者，受用斋食。 第二，斋食，献施圣凡，最为重事。 第三，衣宜净，床宜端洁，故先铺坐坛，而后坐。 第四，巾器宜诤，故先洗手，而后执器。 第五，先行浄水，然后开器受食。 贤智以食为天，凡夫以食为命，故为最重。 第六，凡巾、器二物，其用一也。 若但安闲，必同一处也。 第七，巾、器二事，护净如一，但除斋食，不得别用。 第八，凡斋器，别立龛架安置，不得与诸器杂安，古人号之日斋器。 第九，斋器有五事之体，法有五行之用，受五味之食，铜漆制之，随力而办。 第十，凡斋巾二首，厚密布为之，长四尺，编褫缝之，桓令洁白。 斋食品第八 第一，凡斋时，先立一人为监堂，亦名监斋。 斋者，齐也，专知钟磬节奏，检校得失，所以名监斋法师。 第二，凡登斋就食，必须洁诤衣冠。 第三，先须诤手执器，上堂安置於左，以巾盛之。",
      "translated_text": "Eighth, when attending to one’s master or elders, one must stand upon the ground. Only after being granted permission to sit and receiving repeated instructions may one bow in gratitude and then be seated.\n\nNinth, when attending to one’s master or elders, if another person present is more venerable than one’s own master or elder, one must follow the instructions of the former, first expressing gratitude before sitting.\n\nTenth, in refectories, lecture halls, or places where scriptures are studied or repentance rituals conducted, one must sit and rise according to the proper ranks, without overstepping one’s position, strictly adhering to the prescribed order of precepts and regulations.\n\nEleventh, after scriptures have been expounded in the Dharma hall, should one arrive late, one must discreetly take a seat in an appropriate place. Even if one possesses lofty virtue or status, one must still follow convenience and not proceed forward, causing disturbance or noise.\n\nTwelfth, once seated, unless for urgent matters, one must not frequently rise or move about, disrupting others by entering or exiting.\n\nThirteenth, in all places, whether walking, standing, sitting, or reclining, one must not mingle with those of improper character.\n\nFourteenth, when one’s master, elders, superiors, or others are reading documents or petitions in detail, if the matter does not concern oneself, one must not approach to peer or join in ignorance.\n\n**Chapter Five: On Vessels**\n\nFirst, men must not use pomegranate-shaped vessels.\n\nSecond, women must not use areca nut-shaped vessels.\n\nThird, vessels must be frequently scoured and washed to keep them bright and clean, free from dust, grime, or filth.\n\nFourth, vessels must not retain water overnight.\n\nFifth, in summer, water must be changed daily; failure to do so renders it impure.\n\nSixth, in winter, water may be changed every two days.\n\nSeventh, clay vessels may be changed every three days, but they must not be placed in unclean areas; this is strictly prohibited.\n\nEighth, vessels used for urination or defecation must be kept separate. One must first cleanse the front and rear, then scrub one’s hands with brick or stone, and further purify them with ash or soapberry. Violations bar one from attending morning audiences with the immortals, ascending the hall to pay respects to one’s master, receiving others’ bows, or joining the assembly.\n\nNinth, after use, vessels must be placed in stable locations to prevent tipping; this is greatly prohibited.\n\nTenth, if others wish to examine a vessel, including children carrying it, one must ensure no unclean hands touch its handle, keeping it immaculate.\n\nEleventh, vessels must be safeguarded and kept clean, both inside and out, with the same care as scriptures and sacred images.\n\n**Chapter Six: On Washing and Rinsing**\n\nFirst, there are four occasions for washing and rinsing: morning rinsing, rinsing after reading, rinsing after meals, and rinsing upon rising from bed.\n\nSecond, one must rinse the mouth three times on each occasion.\n\nThird, after meals, one should use a solution of willow twigs, which both cleanses impurities and prevents tooth decay. If willow twigs are unavailable, use fine ash.\n\nFourth, when first using willow twigs, recite the incantation:\n*\"The harmonious qi of the sun,\nUnfurls the spring willow.\nBreak off a twig,\nTo purify body and mouth.\nCultivating the Dao, refining the true,\nMay all three realms be delivered.\nSwiftly, swiftly, as the law commands.\"*\n\nFifth, when using ash, recite the incantation:\n*\"Washing ash removes filth,\nAsh is foremost for cleansing.\nImpurity departs, the true arrives,\nPurifying heart and mouth.\nAttaining the Dao, delivering others,\nAs enduring as heaven and earth.\nSwiftly, swiftly, as the law commands.\"*\n\nSixth, when rinsing or washing, one must turn to the side and face away from others, never performing these acts directly before them.\n\nSeventh, when using water, one must not touch the water in the basin with one’s hands; instead, use a wooden ladle to draw water from the basin, and do not let the ladle touch the basin.\n\nEighth, if one inadvertently touches the water, one must confess and repent, then personally replenish the basin with fresh water to avoid incurring transgression.\n\nNinth, when rinsing the mouth or washing the face, one must not make gurgling sounds or expel bubbles from the nose or mouth, nor strike or tap water vessels to disturb others.\n\nTenth, when using water, one must not waste or trample it carelessly.\n\nEleventh, one must not spit or spray impure water before others or onto clean ground.\n\nTwelfth, when using any item, including water and other objects, one must practice frugality and avoid wasteful or frivolous use.\n\n**Chapter Seven: On Towels and Utensils**\n\nFirst, towels and utensils are used for receiving and partaking in vegetarian meals.\n\nSecond, vegetarian meals, offered to both sacred and ordinary beings, are of the utmost importance.\n\nThird, one’s robes should be clean, and one’s seat immaculate; thus, one must first spread the sitting mat before taking one’s place.\n\nFourth, towels and utensils should be pure; thus, one must first wash one’s hands before handling them.\n\nFifth, one must first present clean water before opening the utensils to receive food. The wise regard food as heaven, while ordinary people regard it as life; thus, it is of the greatest importance.\n\nSixth, towels and utensils serve the same purpose. When not in use, they must be kept together in one place.\n\nSeventh, towels and utensils must be protected and kept clean as one; they are to be used solely for vegetarian meals and nothing else.\n\nEighth, utensils for vegetarian meals must be stored on separate shelves or stands, not mixed with other vessels. The ancients called these \"vegetarian utensils.\"\n\nNinth, vegetarian utensils embody the five phases and serve the fivefold functions, receiving the five flavors of food. They may be made of lacquered wood or bronze, procured according to one’s means.\n\nTenth, vegetarian towels should be made of thick, dense cloth, four feet in length, hemmed and stitched, and kept spotlessly white.\n\n**Chapter Eight: On Vegetarian Meals**\n\nFirst, during meals, one person must be appointed as the hall monitor, also called the meal supervisor. \"Vegetarian\" means \"regulated\"; this person oversees the rhythm of bells and chimes, corrects errors, and is thus called the supervisor of the Dharma master’s meal.\n\nSecond, when ascending to the hall to partake in the meal, one must wear clean and proper attire.\n\nThird, one must first wash one’s hands and handle the utensils, then place them to the left upon entering the hall, covering them with a towel.",
      "overlap_context": "iptures, images, or elders, one must compose one’s demeanor, refraining from arrogance, laxity, or improper speech.\n\nFifth, in the presence of scriptures, images, or elders, one must not turn one’s back to the sacred texts, images, or honored masters.\n\nSixth, when attending to one’s revered master or elders, one must stand upright, without leaning against beds, walls, or other objects.\n\nSeventh, when attending to one’s master or elders, one must maintain solemnity and speak only when questioned.",
      "start_char": 2239,
      "end_char": 3468,
      "start_sentence": 94,
      "end_sentence": 155,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.782949209213257,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\玄门十事威仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "第四，凡礼忏，随众多少，一时平坐，脱履坐底，勿碍祇供人。 第五．’先须行净水、勿令器冲撞着人。 第六，受水讫，先取巾，把中央角向前，垂将七寸铺之，次安斋器了，又铺第二巾於膝上，并须仰手铺之。 第七，出斋器，从一至五，次第出之，不得越乱。 第八，监堂一人，於堂上磬子处正立，呜磬一下，奉为当今皇帝祝延圣寿，或应十方施主，祈禳荐拔，随事举扬诸施等事，保护答报。 次师一人，即令祝愿，其文出在七真科中。 第九，施粥，咒曰：今晨香粥，上献三尊。 利益家国，饶益施主。 六道含灵，普同饱满。 第十，施食，咒曰：一切福田中，施食最为先。 见存受快乐，过去得生天。 当来居净土，衣食常自然。 是故今供养，普献於诸天。 第十一，凡咒讫，次行食。 监斋须先约语行食人，必须教其食名，分明高唱，料量多少，务在均平。 第十二，行食讫，监斋呜磬一下云：等供养斋官，须一时稽首，相顾恭敬，然后方可就食。 第十三，凡受食三遍，自料取足，勿令余剩狼籍，人所恶见，不生敬信。 第十四，凡闻唱食名，须把器就手而受。 第十五，不要者，指点令去，嫌多即退手，嫌少即进手，不得言喧。 第十六，凡斋，上下相顾、望食迟者，稍须急食。 食急者，即须迟食，务令齐整。 第十七，凡斋食时，监斋须都看之，若过半食，尽可再行。 第十八，不得纵其本性，令迟者嫌。 第十九，凡食须细，口急意徐，勿令啜呷作声，触击匙筋，负慈悲罪。 第二十，凡斋坐食之后，除非军机、急速、水火、盗贼、死亡之事，不得辄有言语，喧括斋 堂。 第二十一，其斋，须有教示处分，必须自手指挥，唯在低声。 第二十二，凡斋讫，有余果食等物，收取与诸在下、及乞病人等，不得随器将去。 第二十三，食讫，先折膝上下巾，次收斋器，自第五至第一，皆安巾上。 第二十四，凡食讫，当行净水洗器，收水讫，呜磬，唱布施祝愿讫，唱余回施祝愿，其文具载七真科戒中。 第二十五，若非别缘贴会，则不用祝文。 第二十六，祝曰：修斋已毕，尚恐功德未圆，更舍净财回施三宝，施者获福，功德圆满。 第二十七，施食，祝曰：三宝法食，供养已周，转施童役之人，当愿童稚，同沾斋功，无诸障碍。 第二十八，呜磬唱食讫，普诵法食已毕，普被福田，十方解脱，三界安闲。 第二十九，凡在斋中，忽有犯戒者，监斋须告白，随令犯者礼拜。 第三十，又鸣磬，唱劝善偈祝曰：我众等闻是法已，身心清静，如瑠璃瓶，欢喜顶戴，稽首敬礼无上三尊。 第三十一，须唱三礼。 若有别缘，唱三愿，更不具载。 第三十二，斋事总毕，鸣磬，唱随意，并须稽首恭敬，持器而去。 第三十三，先后下起，行列而行，各归房院，不得群集喧话，挠乱清众。 请法品第九 夫法者，名之为宝，人能敬受，实为妙也。 一则利己，传法教人； 二能益他，同登妙果。 传法之功，进入仙阶，故曰：请法必在珍重虔诚。 第一，请法师有二种：一者请法师，演法讲经，传科传戒； 二者权时请授，决其所疑，并须礼拜，殷勤珍重，虔诚稽首。 第二，讲经演法，须量大小远近，预前陈疏其书，皆须好纸真楷，如法净洁，不得造次粗弱，言语轻怠。",
      "translated_text": "Fourth, when performing repentance rituals, all should sit evenly according to the number of participants, removing their shoes and placing them beneath their seats, ensuring they do not obstruct those making offerings.\n\nFifth, one must first carry the purifying water, taking care that the vessels do not collide with others.\n\nSixth, after receiving the water, first take the towel, holding its center with the corner facing forward, letting seven inches hang down to spread it. Then, place the vegetarian utensils, and spread a second towel over the knees, ensuring both are laid with palms facing upward.\n\nSeventh, when setting out the meal utensils, arrange them in order from one to five, without skipping or disorder.\n\nEighth, the hall monitor shall stand upright beside the chime in the hall and strike it once to offer prayers for the longevity of the reigning emperor, or to invoke blessings, expiation, or merit-transfer for the ten-directional benefactors, adapting the invocation to the occasion and expressing gratitude for their protection.\n\nNext, a master shall be appointed to lead the prayers, the text of which is recorded in the *Seven Perfected Regulations*.\n\nNinth, when serving congee, recite the incantation:\n*\"This morning’s fragrant congee is offered to the Three Honored Ones.\nMay it benefit the nation and enrich the benefactors.\nMay all sentient beings in the six realms be fully sated.\"*\n\nTenth, when serving the meal, recite the incantation:\n*\"Among all fields of merit,\noffering food is foremost.\nThose present receive joy,\nthe departed are reborn in heaven.\nIn the future, they shall dwell in the Pure Land,\nwhere clothing and sustenance arise naturally.\nThus, we now make this offering,\nuniversally presented to all deities.\"*\n\nEleventh, after the incantations, proceed to serve the meal. The meal supervisor must first instruct the servers to clearly and loudly announce each dish’s name, portioning the food equitably.\n\nTwelfth, when the meal is served, the meal supervisor shall strike the chime once and say: *\"All benefactors of this vegetarian offering shall bow together in reverence, exchanging respectful glances before beginning to eat.\"*\n\nThirteenth, when receiving food, take only three portions, serving oneself sufficiently without leaving excess or disorder, lest it offend others and diminish reverence and faith.\n\nFourteenth, upon hearing the dish’s name announced, one must hold the utensil and receive the food with hands.\n\nFifteenth, if declining, gesture to decline; if the portion is too large, withdraw the hand; if too small, extend it—no verbal complaints are permitted.\n\nSixteenth, during the meal, those seated above and below should observe one another. Those eating slowly should hasten slightly, while those eating quickly should slow down, ensuring uniformity.\n\nSeventeenth, the meal supervisor must oversee the entire meal. If more than half have finished, a second serving may be offered.\n\nEighteenth, one must not indulge their nature to the point of causing resentment among those who eat slowly.\n\nNineteenth, one must eat finely, chewing quickly but swallowing slowly, avoiding slurping or clinking utensils, lest it incur the sin of lacking compassion.\n\nTwentieth, after the meal, unless in cases of military urgency, sudden crises, fire, theft, or death, no speech is permitted to disturb the solemnity of the vegetarian hall.\n\nTwenty-first, any instructions during the meal must be given by hand gestures, speaking only in a low voice.\n\nTwenty-second, after the meal, any remaining fruit or food shall be collected and distributed to those of lower status or the sick and beggars; none may be taken away with the utensils.\n\nTwenty-third, after eating, first fold the towels from the knees, then gather the utensils in order from the fifth to the first, placing them on the towel.\n\nTwenty-fourth, after the meal, purifying water shall be used to wash the utensils. Once the water is collected, the chime shall be struck, and the blessing of the offering shall be recited, followed by the blessing of the remaining merit-transfer, the texts of which are recorded in the *Seven Perfected Precepts*.\n\nTwenty-fifth, if there is no special occasion, the prayer texts may be omitted.\n\nTwenty-sixth, the prayer shall say:\n*\"Though the vegetarian ritual is complete,\nwe fear its merit may yet be imperfect.\nThus, we further offer pure wealth to the Three Treasures,\nthat the benefactors may gain blessings and the merit be perfected.\"*\n\nTwenty-seventh, for the offering of food, the prayer shall say:\n*\"The Dharma meal for the Three Treasures is now fully offered.\nWe transfer it to the attendants,\npraying that the young and lowly alike share in the merit of this meal,\nfree from all obstacles.\"*\n\nTwenty-eighth, after striking the chime and announcing the meal’s conclusion, all shall recite the Dharma meal’s dedication:\n*\"May all fields of merit be universally blessed,\nmay the ten directions be liberated,\nand may the three realms be at peace.\"*\n\nTwenty-ninth, if anyone violates the precepts during the meal, the meal supervisor must announce it and instruct the offender to bow in repentance.\n\nThirtieth, the chime shall be struck again, and the verse of exhortation shall be recited:\n*\"Having heard this Dharma,\nmay our bodies and minds be as pure as lapis lazuli vessels.\nWith joy and reverence, we bow in homage to the Supreme Three Honored Ones.\"*\n\nThirty-first, the *Three Bows* shall be recited. If there is a special occasion, the *Three Vows* may be recited instead; further details are not recorded here.\n\nThirty-second, when the meal is entirely concluded, the chime shall be struck, and the *Random Vows* shall be recited. All shall bow reverently, hold their utensils, and depart.\n\nThirty-third, those leaving shall rise in order, proceed in formation, and return to their quarters without gathering or engaging in loud conversation to disturb the assembly.\n\n**Chapter Nine: On Requesting the Dharma**\n\nThe Dharma is called a treasure; for those who respectfully receive it, it is truly wondrous.\nFirst, it benefits oneself by transmitting the Dharma to others;\nsecond, it benefits others by guiding them to the wondrous fruit.\nThe merit of transmitting the Dharma advances one to the ranks of immortals.\nThus, requesting the Dharma must be done with reverence and sincerity.\n\nFirst, there are two types of Dharma masters to be invited:\n1. Those who expound the Dharma, lecture on sutras, transmit regulations, and confer precepts;\n2. Those temporarily invited to resolve doubts.\nIn both cases, one must bow in reverence, treat them with care and respect, and prostrate with sincerity.\n\nSecond, when lecturing on sutras or expounding the Dharma, one must assess the scale and distance beforehand, submitting a written request in advance. The paper must be of good quality, the script written in standard, neat calligraphy, and the text composed with proper purity and solemnity. Hasty, careless, or disrespectful language is not permitted.",
      "overlap_context": "g meals, one person must be appointed as the hall monitor, also called the meal supervisor. \"Vegetarian\" means \"regulated\"; this person oversees the rhythm of bells and chimes, corrects errors, and is thus called the supervisor of the Dharma master’s meal.\n\nSecond, when ascending to the hall to partake in the meal, one must wear clean and proper attire.\n\nThird, one must first wash one’s hands and handle the utensils, then place them to the left upon entering the hall, covering them with a towel.",
      "start_char": 3468,
      "end_char": 4685,
      "start_sentence": 156,
      "end_sentence": 203,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.46801781654358,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\玄门十事威仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "第三，凡授疏者，若小事，先须礼，三拜讫，须执疏长跪，陈其意旨，即拱手而授疏於前人。 受疏讫，即礼三拜，言谢而退。 第四，凡大段事授疏，以执疏作礼，或七拜、至九拜，然后长跪，面陈其事讫，又三拜。 拜讫，长跪授疏。 授疏竟，即礼拜长跪言谢云：小人蒙赐慈悲，不胜多幸。 第五，若前人未受疏，唯知礼拜，不限徧数，以许为度。 如复未许，即须宜且退，更待后时，再三稽首而授。 《定志经》云：血出数斛，心亦莫止，自非志心，扣幽灵囿，肘皈师门，顿首德宇，终不造受也。 第六，凡权请决疑，先须三礼，长跪拱手，陈所疑事，更三礼解说，竟起拱手言谢云：小子愚昧，伏蒙法师不弃凡愚，解说真理，不胜喜跃。 三礼而退。 第七，或灼然年高德重，来授疏请斋，或解说经义经题、讲论其理等，宜平旦坐受，拜疏讫，言告谢云：小子愚懵，不闻解说，伏蒙见命，不胜悚惕。 仍三礼答之，敬其德也。 第八，若是师长，曾经受法业者，或有授疏命及者，待礼三拜，即伏地而受，乃长跪，即两手横捧於顶，良久乃放案上。 三礼长跪谢云：死罪小子，忽奉严命，不胜惶悚。 又云：不敢三礼而退。 第九，凡言，不敢有二种义，受不敢辞，辞则不敢受。 护持品第十 夫护持者，凡有七种：一护法服，二护法，三护经，四护师，五护身，六护十方施主，七护一切众生。 第一，凡经像，一种无别，且如奉道。 科云：凡经像所在，皆须护净，竹架围隔。 暂离，即须净巾盖之。 凡有看读，开展不得过三行，有事即随手卷之。 卷轴未终，不得暂停。 如急事，此卷不了，然后从首，再行宣忏。 第二，不得令不净人，并不净身口秽气触动。 第三，拟执经像，须净手意，不得把他物。 应上将，或推却诸物，凭傍人为之。 忽若无人，自须小小推拨，即洗手经床，上下亦然。 若把他物，即须重洗手。 第四，经像不得同房，若黑漆等函着经像者，又在橱内，得权居卧息，若素函及蕴，虽在橱内，亦为不可。 第五，若在大堂之内，宿集之所，经日积夜，或倦於法事，疲怠之极，止可暂时歇息，仍须屈伏侧身，不得顿尔肆布脚手，鼻口哮齁。 若有傍人，须语之。 若闻不语，与慢法同罪。 第六，凡在四众，坐起行立，不得招外人共语，多有言笑。 第七，凡勤学，不如择师。 师若德薄，慎勿投刺。 既能修学，必在明师，似得於宝，即尽力奉承，极至道成，不相离舍。 第八，师若错有过误，慎勿谤论，宜隐然方便，言拜咨陈再三已，依奉道科。 若别人言及其师善恶，须分解。 力所不及，拂起而去，是名护师之相也。 第九，凡师床案、几杖、衣服、朱墨，一事已上，皆须护持，不得触污。 第十，凡在众会，忽有违犯经科，为众所弹，事应合罚，即须踊跃欢喜，愧耻言笑，美乐受之，此名为能人，灭无量罪。 此人学道，速成无上善果，是名大护持。 第十一，凡护持十方施主，或相识、不相识者，上下男女、大小贵贱、内外远近，凡见皆敬奉。 居止来去、安置坐起、校诸驱使、苦乐饥饱、恶好逆顺、有无健病、恭敬慰喻、赏罚辱责，皆须得所，务在均平。 第十二，凡含灵蠢动，有命之物堕水落火，但是危命之处，是力所及，皆须救护，使得安宁。",
      "translated_text": "Third, when presenting a written request for minor matters, one must first perform the rites of reverence, completing three bows. Then, holding the document, kneel upright to state its purpose, and with hands clasped, present it to the recipient. Upon receiving the document, perform three bows again, express gratitude, and withdraw.\n\nFourth, for matters of great importance, when presenting a written request, perform the rites while holding the document—either seven or up to nine bows—then kneel upright to state the matter. Afterward, perform three more bows. Upon completing the presentation, kneel upright again and express gratitude, saying: *\"This humble one has been graciously bestowed with compassion, and I am overwhelmed with fortune.\"*\n\nFifth, if the recipient has not yet accepted the document, continue bowing without limit until permission is granted. If permission is still not given, withdraw temporarily and wait for another opportunity, presenting it again with repeated bows. As the *Dingzhi Sutra* states: *\"Even if blood flows in torrents, the heart must not waver. Without wholehearted devotion, one cannot knock upon the gates of the hidden realm, prostrate at the master’s threshold, or bow before the sanctuary of virtue—ultimately, no transmission will be received.\"*\n\nSixth, when temporarily inviting a master to resolve doubts, first perform three bows, then kneel upright with hands clasped to present the matter in question. After the explanation, perform three more bows, rise, and with hands clasped, express gratitude, saying: *\"This foolish disciple, though unworthy, has been graciously favored by the Dharma master, who has deigned to clarify the truth. I am filled with boundless joy.\"* Then perform three bows and withdraw.\n\nSeventh, if a venerable elder of high virtue arrives to present a written request, invite an almsgiving, or expound upon the meaning of sutras, their titles, or discuss their principles, one should receive them at dawn while seated. After bowing to the document, announce with gratitude: *\"This ignorant disciple, untutored in such explanations, is deeply honored by your command and filled with reverence.\"* Then perform three bows in return, honoring their virtue.\n\nEighth, if the recipient is a master or teacher who has previously transmitted the Dharma, and they present a written command, wait until three bows are completed, then prostrate to receive it. Kneel upright and hold the document aloft with both hands over the crown of the head for a long moment before placing it on the table. Perform three bows, kneel upright, and express gratitude, saying: *\"This unworthy disciple, suddenly entrusted with such a solemn command, is filled with awe and trepidation.\"* Alternatively, one may say: *\"I dare not perform three bows before withdrawing.\"*\n\nNinth, the phrase *\"I dare not\"* carries two meanings: when receiving, one dares not refuse; when refusing, one dares not receive.\n\n**Chapter Ten: On Upholding and Safeguarding**\n\nUpholding and safeguarding comprises seven aspects: 1) safeguarding the Dharma robes, 2) safeguarding the Dharma, 3) safeguarding the sutras, 4) safeguarding the master, 5) safeguarding one’s own body, 6) safeguarding donors from the ten directions, and 7) safeguarding all sentient beings.\n\nFirst, sutras and images are of one essence and must be treated without distinction. As the regulations state: *\"Wherever sutras and images reside, they must be kept pure and protected, enclosed by bamboo frames. When temporarily leaving, cover them with a clean cloth. When reading, do not unfold more than three lines at once, and if interrupted, roll them up immediately. Do not pause mid-scroll; if urgent matters arise before completion, begin anew from the start when resuming recitations or repentance rituals.\"*\n\nSecond, do not allow impure persons, nor those with impure bodies, speech, or foul breath, to touch them.\n\nThird, when handling sutras or images, purify both hands and mind, and do not hold other objects. If placing them above other items, or moving objects aside, seek assistance. If no one is available, shift items slightly, then wash hands before touching the sutra stand—this applies to both upper and lower surfaces. If other objects are touched, wash hands again.\n\nFourth, sutras and images must not share a room. If they are stored in black-lacquered cases alongside other items, or within a cabinet, temporary residence may be permitted. However, if stored in plain cases or bundles, even within a cabinet, this is not permissible.\n\nFifth, when in a grand hall or assembly space, whether by day or night, if fatigue from Dharma affairs arises, one may rest briefly but must do so with the body curled to the side, never sprawling carelessly with limbs outstretched or snoring through the nose and mouth. If others are present, remind them; if they remain silent upon hearing, their negligence is as grave as disrespecting the Dharma.\n\nSixth, among the four assemblies, when sitting, standing, or walking, do not engage in idle chatter or laughter with outsiders.\n\nSeventh, diligent study is not as crucial as choosing a master wisely. If a master’s virtue is lacking, do not seek their instruction. Once a true master is found, serve them as one would a treasure, exerting every effort in devotion until the Dao is attained, never parting from their guidance.\n\nEighth, if a master errs or makes a mistake, do not slander them. Instead, discreetly and respectfully kneel to inquire repeatedly, adhering to the Dharma regulations. If others speak of the master’s virtues or faults, clarify the matter. If unable to do so, leave immediately—this is the mark of one who safeguards their master.\n\nNinth, the master’s bed, desk, walking staff, clothing, ink, and all other belongings must be upheld and protected, never defiled or mishandled.\n\nTenth, if in an assembly one violates the sutra regulations and is admonished by the community, accepting the due penalty with eagerness, joy, humility, and gratitude—this is the sign of a true practitioner. Such a person swiftly eradicates immeasurable transgressions, swiftly attains the supreme fruit of the Way, and embodies the great upholding of the Dharma.\n\nEleventh, in safeguarding donors from the ten directions—whether known or unknown, high or low, male or female, noble or humble, near or far—all must be treated with reverence. Their lodging, comings and goings, seating, tasks, comforts, hunger and satiety, likes and dislikes, adversities and fortunes, health and illness must all be managed with fairness and balance, offering respectful consolation, appropriate rewards, and measured reproach.\n\nTwelfth, all sentient beings, even the smallest creatures, if found in peril—fallen into water or fire, or any life-threatening situation—must be rescued within one’s capacity, ensuring their safety and peace.",
      "overlap_context": "e temporarily invited to resolve doubts.\nIn both cases, one must bow in reverence, treat them with care and respect, and prostrate with sincerity.\n\nSecond, when lecturing on sutras or expounding the Dharma, one must assess the scale and distance beforehand, submitting a written request in advance. The paper must be of good quality, the script written in standard, neat calligraphy, and the text composed with proper purity and solemnity. Hasty, careless, or disrespectful language is not permitted.",
      "start_char": 4685,
      "end_char": 5907,
      "start_sentence": 204,
      "end_sentence": 249,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.419691801071167,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\玄门十事威仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "第十三，凡行住出入，宿息过逢，州县名利，亲疏男女，戏弄邪言，预是众生所疑，更不须行，是名护持一切众生善果。 第十四，若有再三违犯、乱挠清众、弹紏不伏、拒谏饰非者，须告白众人，退出斋次，具如斋戒威仪论。 第十五，道衣法服，凡脱着，切须折打整齐，或安袱帕，或安静处。 稽首毕，方可脱着。 第十六，若是於法请事，往往傲戾好斗争者，则须上下举告凶吉等事，勿与往还，名曰幽殡，莫令随众。 第十七，凡受食受财，皆让少取，为俭唯省，勿令众生有嫌疑薄贱，损命损德，深得护持。 太上曰：威仪说十事，及诸律名，总系一百四十余条。 若能习而诵之，勤而行之，已具前十事，及诸科令，总名护身，己所不犯。 又复教人此之善果，计不能尽，众圣欢仰，诸天惭愧。 若此之人，见世获十种福德恭敬。 且如《升玄经》云：亦如法服科说，如是之人，名曰大顺真士，不出一生，入次圣品。 若复有人，无心奉道，倚傍法门，窥求利润，污道法服，辱道法流，及构恶徒，嫉他行善，自违科戒，劝人莫修，不奉师训，闻教愈甚，不生惭愧，不生恩念，如是等人，名曰罪逆恶兽，近入人道，未得人心，乍入人伦，污闻圣法，所为趣向，尚似阴囚畜兽，脱离众生，犹未觉悟，忆彼类习，欲还本身，深所痛哉，甚可悲悯。 若人见在，失十种功德，失十种恭敬，得十种轻贱，离十种圣贤，五苦八难，备具形体，才灭此生，当入长夜，九幽地狱，一切苦痛，悉皆备受，轮转三恶，无解脱时。 无想真人等闻太上说此要言，悉皆垂泪，欢喜踊跃，稽首礼谢，信受奉行。 玄门十事威仪竟",
      "translated_text": "Thirteenth, in all movements—whether walking, standing, entering, or exiting—resting or passing by, in matters of regional governance, fame, or profit, in dealings with relatives or strangers, men or women, one must refrain from frivolous or deceitful speech that might arouse doubt among sentient beings. This is called safeguarding the virtuous fruit of all beings.\n\nFourteenth, if any repeatedly violate the precepts, disturb the pure assembly, resist admonishment, or conceal their faults, they must be reported to the assembly and removed from the fasting ranks, as detailed in the *Treatise on the Dignified Observances of Fasting Precepts*.\n\nFifteenth, for Daoist robes and ritual garments, when removing or donning them, one must carefully fold and arrange them, either placing them in a cloth wrapper or in a quiet place. Only after completing the bow of reverence may one remove or put them on.\n\nSixteenth, if any, when handling Dharma matters, display arrogance, belligerence, or a propensity for conflict, one must report their conduct—whether auspicious or inauspicious—to superiors and avoid association with them. This is called \"concealed expulsion,\" ensuring they do not follow the assembly.\n\nSeventeenth, when receiving food or alms, one should defer to others and take modestly, practicing frugality and restraint, so as not to arouse suspicion, disdain, or contempt among sentient beings, thereby harming life and virtue. This is the profound safeguarding of the Way.\n\nThe Most High said: The dignified observances comprise ten major principles, along with various precepts, totaling over one hundred and forty items. If one can study and recite them diligently, and practice them earnestly, they will have already embodied the previous ten principles and all related regulations—this is called \"safeguarding the body,\" ensuring one does not transgress. Furthermore, teaching others these virtuous fruits is boundless; all sages rejoice, and the gods feel shame.\n\nSuch a person, in this very life, will attain ten kinds of blessings and reverence. As the *Scripture of Ascending the Mystery* states, and as the regulations on ritual attire affirm, one of this kind is called a \"Greatly Compliant Perfected Person,\" who, without leaving this lifetime, enters the ranks of the sages.\n\nIf, however, there are those who, without sincere devotion to the Dao, cling to the periphery of the Dharma gate, seeking profit, defiling the Daoist robes, disgracing the flow of the Dharma, associating with evil companions, envying others’ virtuous conduct, violating the precepts themselves, and discouraging others from cultivation—who disregard their teachers’ instructions, grow more defiant upon hearing the teachings, feel no shame, and bear no gratitude—such people are called \"transgressors, rebels, and ferocious beasts.\" Though they have barely entered the human realm, they have not yet attained a human heart; though they have momentarily joined human society, they defile the sacred Dharma. Their aspirations and conduct resemble those of prisoners in the dark or beasts in bondage. Even when separated from other beings, they remain unawakened, clinging to their habitual tendencies, longing to return to their original nature—how deeply painful! How pitiful!\n\nIn this life, such a person loses ten kinds of merit, ten kinds of reverence, incurs ten kinds of contempt, and distances themselves from ten kinds of sages. The five sufferings and eight adversities manifest in their body. Upon the end of this life, they will enter the long night of the Nine Dark Hells, enduring every form of agony, ceaselessly revolving through the three evil destinies, with no hope of liberation.\n\nUpon hearing these essential words from the Most High, the Perfected of No-Thought and others wept tears of joy, leaping with exultation. They bowed in reverence, expressed their gratitude, and vowed to receive and uphold the teachings.\n\nHere ends the *Ten Dignified Observances of the Mystery Gate*.",
      "overlap_context": "ted with reverence. Their lodging, comings and goings, seating, tasks, comforts, hunger and satiety, likes and dislikes, adversities and fortunes, health and illness must all be managed with fairness and balance, offering respectful consolation, appropriate rewards, and measured reproach.\n\nTwelfth, all sentient beings, even the smallest creatures, if found in peril—fallen into water or fire, or any life-threatening situation—must be rescued within one’s capacity, ensuring their safety and peace.",
      "start_char": 5907,
      "end_char": 6530,
      "start_sentence": 250,
      "end_sentence": 264,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.55209469795227,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\玄门十事威仪.txt",
        "category": "威仪类"
      }
    }
  ]
}