{
  "source_id": "玄都律文",
  "source_file": "chunked_daozang\\玄都律文.json",
  "total_chunks": 8,
  "total_original_chars": 8671,
  "total_translated_chars": 54993,
  "total_translation_time": 247.4798686504364,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\戒律类\\玄都律文.txt",
    "category": "戒律类"
  },
  "full_translation": "**Xuandu Precepts Text**\n\n**Scripture Title:** *Xuandu Precepts Text*. The compiler is unknown, likely composed toward the end of the Northern and Southern Dynasties. According to references in works such as the *Three Caverns Pearl Niche*, the original text should have contained over twenty chapters. The *Tongzhi: Arts and Literature Catalogue* records it as comprising twenty-five scrolls. Only one scroll now remains.\n\n**Source of the Base Text:** *Daoist Canon of the Zhengtong Era*, *Cavern of Perfection* section, Precepts and Disciplines category.\n\n---\n\n### **Xuandu Precepts Text**\n#### **The Precepts of Void and Non-Differentiation Between Good and Evil**\n\n1. Abandoning form and forgetting the body, as if dead—this is called *void*.\n2. Diminishing the mind and discarding intentions, casting off falsity and forsaking desires—this is called *non-being*.\n3. Concentrating spirit and accumulating essence, not allowing things to gather—this is called *purity*.\n4. Returning spirit and ingesting *qi*, settled and unmoving—this is called *stillness*.\n5. Dwelling in seclusion, one’s merits and name unseen—this is called *subtlety*.\n6. Forsaking wife and children, wandering alone with the Dao—this is called *solitude*.\n7. Breathing in harmony, smooth and fine—this is called *gentleness*.\n8. Relaxing the body and freeing the form, attending to all matters—this is called *weakness*.\n9. Despising honor and embracing disgrace, content in poverty and humiliation—this is called *lowliness*.\n10. Shunning excess and fleeing fullness, clothing and food coarse and simple—this is called *reduction*.\n11. Contending with *yin* and *yang*, responding to changes and repelling evil—this is called *timeliness*.\n12. Neither hungry nor thirsty, neither cold nor hot, neither joyful nor angry, neither sorrowful nor delighted, neither slow nor hasty—this is called *harmony*.\n13. Loving sight and hearing, loving speech and thought, without expending spirit, blending light and conforming to the world—this is called *thrift*.\n\n**The Precept states:** These thirteen principles merge into the primordial chaos of *void* and *non-being*. Those who practice the Dao and guard the True must revere the teachings of their masters, follow the celestial decrees, and exhaust the Dao of *non-action*—*void, non-being, purity, stillness, subtlety, solitude, gentleness, weakness, lowliness, reduction, timeliness, harmony, thrift*.\n\nFor those who cultivate the Dao, refining *qi* and transforming form, the people will be harmonious, the state peaceful, families auspicious, disasters will not arise, lifespans will extend, and households and nations will flourish.\n\nThose who violate the precepts will be punished by Heaven.\n\n**The Precept states:** If one does not contemplate good deeds but only commits evil acts—being unfilial to parents, disloyal to masters and lords, unfaithful to rulers—those who do good will be blessed by Heaven, while those who do evil will be cursed by Heaven.\n\n- One who performs **one good deed** will have a settled mind and a peaceful body.\n- One who performs **ten good deeds** will have strong *qi* and vitality.\n- One who performs **twenty good deeds** will be free from illness.\n- One who performs **thirty good deeds** will obtain what they seek.\n- One who performs **forty good deeds** will enjoy prosperity and wealth.\n- One who performs **fifty good deeds** will have flourishing descendants.\n- One who performs **sixty good deeds** will escape calamities.\n- One who performs **seventy good deeds** will be protected by divine spirits.\n- One who performs **eighty good deeds** will gain the benefits of the earth.\n- One who performs **ninety good deeds** will attain honor and glory.\n- One who performs **a hundred good deeds** will receive Heaven’s virtue and precious treasures.\n- One who performs **two hundred good deeds** will have their name renowned in later generations.\n- One who performs **three hundred good deeds** will bring great wealth to their descendants.\n- One who performs **four hundred good deeds** will produce noble and wealthy descendants.\n- One who performs **five hundred good deeds** will extend the lifespan of their descendants.\n- One who performs **six hundred good deeds** will produce loyal and filial descendants.\n- One who performs **seven hundred good deeds** will produce wise descendants.\n- One who performs **eight hundred good deeds** will produce descendants of virtue.\n- One who performs **nine hundred good deeds** will produce sagely and worthy descendants.\n- One who performs **a thousand good deeds** will produce immortals and perfected beings.\n\nThose who perform good deeds will receive blessings and protection from Heaven.\n\n- One who commits **one evil act** will have a troubled mind and a weary body.\n- One who commits **ten evil acts** will have depleted blood and *qi*.\n- One who commits **twenty evil acts** will suffer many illnesses.\n- One who commits **thirty evil acts** will fail in their pursuits.\n- One who commits **forty evil acts** will experience misfortune and decline.\n- One who commits **fifty evil acts** will have no descendants.\n- One who commits **sixty evil acts** will frequently encounter disasters.\n- One who commits **seventy evil acts** will be harmed by malevolent spirits.\n- One who commits **eighty evil acts** will be harmed by water and fire.\n- One who commits **ninety evil acts** will suffer extreme poverty and hardship.\n- One who commits **a hundred evil acts** will be physically punished by Heaven and Earth.\n- One who commits **a hundred and fifty evil acts** will be harmed by bandits.\n- One who commits **two hundred evil acts** will have no lineage in later generations.\n- One who commits **three hundred evil acts** will suffer poverty in later generations.\n- One who commits **four hundred evil acts** will descend into servitude in later generations.\n\n---\n\n### **Precepts and Verses of Prohibitions**\n\n1. **Do not deceive ghosts or cheat spirits**, nor trifle with the celestial Dao.\n2. **Do not take the false as true**, nor the true as false.\n3. **Do not take good as evil**, nor evil as good.\n4. **Do not take the crooked as straight**, nor the straight as crooked.\n5. **Do not take the turbid as clear**, nor the clear as turbid.\n6. **Do not take the perverse as upright**, nor the upright as perverse.\n7. **Do not take the ugly as beautiful**, nor the beautiful as ugly.\n8. **Do not take the empty as solid**, nor the solid as empty.\n9. **Do not take the contrary as compliant**, nor the compliant as contrary.\n10. **Do not take the wrong as right**, nor the right as wrong.\n11. **Do not take the close as distant**, nor the distant as close.\n12. **Do not take east as west**, nor west as east.\n\n**The Precept states:** These thirteen prohibitions are the ways of those who are deluded and confused. Their bodies will suffer harm, and they will not preserve their lives. Disasters will flow into five generations, and descendants who violate them will have their lifespans shortened and their allotted years seized. Those who preside over such violations will be demoted according to the severity of the offense.\n\n**The Precept states:** Always respect and follow the master’s teachings, adhering strictly to their methods. Do not act lightly, deceive, or falsify. Violators will be penalized with a reduction of four hundred days in their allotted lifespan, and those responsible will be demoted.\n\n**The Precept states:** Regularly at dawn, noon, and dusk, visualize the *qi* of the five directions:\n- The **eastern blue *qi*** transforms into the Azure Dragon,\n- The **western white *qi*** transforms into the White Tiger,\n- The **southern red *qi*** transforms into the Vermilion Bird,\n- The **northern black *qi*** transforms into the Dark Warrior,\n- The **central yellow *qi*** transforms into one’s own body.\n\nThus, harmonizing the five directions, one chants and recites their names.\n\n**Violators of this precept will be penalized with a reduction of three hundred days in their allotted lifespan, and those responsible will be demoted.**\n\n**The Precept states:** At dawn, recite the following:\n*\"Subtle and vast, you are the essence and radiance of primal *qi*.\nMajestic and joyous, you soar as my soul and spirit.\nDwelling within my breast, you expand in emptiness and boundlessness.\nPure as the bright moon, you penetrate the ten directions.\nHow flourishing the sacred herbs—no fear of lacking sustenance.\nInhaling the new, exhaling the old, you thereby commune with the divine.\"*\n\n**The Precept states:** At dusk, recite the following:\n*\"Vast and awe-inspiring, in reverence for the divine,\nClad in essence, nourished by the mysterious,\nThe Dipper’s handle as steed, its stars as spokes,\nBoundless above and below, timeless in coming and going.\nA hundred ailments healed, the spirit and *qi* sustained,\nThe Controller of Fate records it in jade tablets and cinnabar script,\nBound with golden threads, wrapped in white silk,\nCountless eons assured—no further doubt.\nThe Great One protects me, the divine uphold me.\nIn purity, free from thoughts, face the prosperous earth.\nRecite this, wear the talisman, and the officer pledges with Heaven and Earth.\nThose who cultivate the Dao and delight in the Dharma shall recite it.\nFailure to comply incurs a penalty of five years’ reduction in lifespan, and those responsible will be demoted.\"*\n\n**The Precept states:** On *wuchen* and *wuxu* days, recitation is forbidden. Instead, maintain a single-minded focus on the Dao, with eyes free from reckless gazing, mouth free from reckless speech, mind free from reckless thoughts, and ears free from reckless hearing. Violators will be penalized with a reduction of fifty days in their allotted lifespan.\n\nCalm the spirit and settle the will, honor virtue and power, and revere teachers and elders. Failure to comply—showing disdain for virtue and power, or disrespecting teachers and friends—brings misfortune to the household and ruin to the state, with a penalty of two twelve-year cycles in lifespan reduction, and those responsible demoted for a thousand days.\n\nThis refers to treating teachers, friends, and those of virtue and power with the reverence due to them.\n\n**The Precept states:** Be magnanimous, loyal, filial, reverent in morning practice, detached, compassionate, and benevolent. Cultivate filial piety and sincerity, and act with righteousness. Failure to comply incurs a penalty of seven twelve-year cycles.\n\nDo not invoke spirits under false pretenses, assume official titles without authority, slander teachers or defame the Dao, engage in licentious sacrifices to myriad ghosts, subvert truth, or create unauthorized rituals contrary to the master’s teachings. Violators will suffer harm to themselves, and those responsible will be penalized for five years.\n\n**The Precept states:** Do not eat food at dusk, nor consume offerings to spirits. Violators will be penalized with a reduction of a thousand days in their allotted lifespan.\n\nThis means one should not eat even at dusk, and consuming food offered to ghosts or spirits incurs guilt.\n\n**The Precepts on Medicinal Virtue**\n\n**The Precept states:** Virtue dispels calamity, and medicine cures illness. Those who disregard these precepts will, as rulers, forfeit their reign; as households, lose their descendants; as individuals, invite chaos and misfortune, with vital *qi* dispersed and lifespans diminished. Thus, governing without the Dao or speaking without the Dharma results in the loss of lifespan and cycles, the Recording Deity reports the transgression, and the Controller of Fate strikes one’s name from the register.\n\n**The Precept states:** Virtue is the physician, and conduct is the medicine. Those who neglect virtue and conduct while seeking medicine or amassing petitions, yet fail to reform their actions, incur even greater transgressions.\n\n**The Precept states:** Gentleness, humility, and the abandonment of desire are the repository of medicinal virtue. Violators will be penalized with a reduction of five years in their allotted lifespan, and those responsible will be held accountable.\n\nHonoring Heaven and revering Earth is one medicine.\nRevering the Three Luminaries is one medicine.\nSerenity and freedom from desire is one medicine.\nBenevolence, forbearance, and humility is one medicine.\nCherishing life and detesting killing is one medicine.\nNot hoarding wealth is one medicine.\nNot violating prohibitions is one medicine.\nIntegrity, chastity, and trustworthiness is one medicine.\nNot burning mountains and forests is one medicine.\nAssisting with an empty cart is one medicine.\nA gentle will and a soft nature is one medicine.\nNot exalting oneself is one medicine.\nA magnanimous demeanor and a harmonious heart is one medicine.\nNot indulging in secrecy is one medicine.\nConducting oneself with propriety in movement and stillness is one medicine.\nCultivating hidden virtue and establishing merit is one medicine.\nRegulating daily life with moderation is one medicine.\nNot litigating against others is one medicine.\nDrawing near to virtue and distancing oneself from lust is one medicine.\nNot burdening others in times of illness or misfortune is one medicine.\nGiving without expecting reward is one medicine.\nAspiring to emulate others is one medicine.\nExtending kindness and yielding to righteousness is one medicine.\nCompassion and tender love is one medicine.\nPraising others is one medicine.\nA tranquil heart and a settled mind is one medicine.\nWishing blessings upon others is one medicine.\nCorrecting the perverse and assisting the upright is one medicine.\nNot interfering in others’ affairs is one medicine.\nEnlightening the ignorant is one medicine.\nInstructing and admonishing the young is one medicine.\nDispelling anxious thoughts is one medicine.\nBestowing kindness when in a position of power is one medicine.\nCultivating filial piety and fraternal duty is one medicine.\nCreating benefits for others is one medicine.\nConcealing others’ faults and extolling their virtues is one medicine.\nAssisting others with one’s strength is one medicine.\nSharing food and drink with others is one medicine.\nPitying the poor and aiding the distressed is one medicine.\nRescuing the sun and moon during eclipses is one medicine.\nSpeaking with humility is one medicine.\nSerenity and magnanimity is one medicine.\nNot defaulting on debts is one medicine.\nContemplating the divine and meditating on the Dao is one medicine.\nUpright and straightforward conduct is one medicine.\nEstablishing merit without weariness is one medicine.\nNot contending over right and wrong is one medicine.\nEliminating emotions and abandoning desires is one medicine.\nEnduring humiliation without resentment is one medicine.\nNot taking illicit wealth is one medicine.\nYielding beauty to embrace ugliness is one medicine.\nBearing misfortune oneself is one medicine.\nExtolling the worthy and good is one medicine.\nRecommending and employing others is one medicine.\nNot flaunting one’s own merits is one medicine.\nRescuing from disaster and aiding the distressed is one medicine.\nNot boasting of one’s own goodness is one medicine.\nAdmonishing and correcting the perverse is one medicine.\nEnduring hardship without resentment is one medicine.\nGuiding the lost and misguided is one medicine.\nConcealing others’ transgressions is one medicine.\nBestowing alms when wealthy is one medicine.\nPromoting those superior to oneself is one medicine.\nSupporting the elderly and weak is one medicine.\nBestowing kindness upon the destitute is one medicine.\nVowing never to curse or revile is one medicine.\nMaintaining strict purity for others is one medicine.\nUnwavering in wisdom and virtue is one medicine.\nHonoring scholars when in high position is one medicine.\nSpeaking kind and virtuous words is one medicine.\nReverence and humility is one medicine.\nDiligence without slackness is one medicine.\nUtmost sincerity and unwavering faith is one medicine.\nNot cursing animals is one medicine.\nUpholding the upright and guiding the crooked is one medicine.\nA balanced heart and an equanimous mind is one medicine.\nJudging right and wrong with propriety is one medicine.\nNot dwelling on past grievances is one medicine.\nPromoting good and concealing evil is one medicine.\nHeeding admonitions and accepting transformation is one medicine.\nTaking more for oneself and giving less to others is one medicine.\nRestraining anger and mastering oneself is one medicine.\nReflecting on oneself upon seeing the worthy is one medicine.\nMaintaining reverence behind closed doors is one medicine.\nAttributing merit and relieving suffering is one medicine.\nHonoring the elderly and venerable is one medicine.\nAcknowledging others’ merits is one medicine.\nPurity, integrity, and adherence to one’s duty is one medicine.\nListening to scriptures and putting them into practice is one medicine.\nAssisting others with one’s strength is one medicine.\nCompassion for the wealthy toward the poor is one medicine.\nAvoiding suspicion and distancing oneself from doubt is one medicine.\nEnduring poverty without resentment is one medicine.\nRevering sacred texts is one medicine.\nDelighting in meritorious deeds is one medicine.\nPropagating sacred teachings is one medicine.\nReflecting on gains and losses is one medicine.\nEncouraging others to study the Dao is one medicine.\nAspiring to venerate the Three Treasures is one medicine.\nUsing words for good is one medicine.\n\nThe Precepts state: When a person suffers from illness, it is due to transgressions and misdeeds, hidden in the unseen, thus manifesting as sickness. These afflictions do not arise from diet, wind, cold, warmth, or qi, but because the individual has violated the law and broken the precepts. Their spirit and soul are constrained and punished, not residing in their physical form. Their pores become lax, their organs depleted, and their essence and qi unguarded, daring to pursue profit. Though they may dwell in honor and fine attire, they dare not commit wrongdoing. They measure their body to make clothing and gauge their stomach to take food. Though rich and noble, they dare not indulge in desire. Though poor and humble, they do not transgress the precepts. Thus, naturally, there is no cruelty without and no illness within.\n\n**The Hundred Precepts on Illness**\nThe Precepts state: Seeking to avert disaster and eliminate hardship is not as easy as preventing them. Treating illness and curing disease is not as auspicious as cultivating oneself. If one serves parents and teachers with filial piety, serves one’s lord with loyalty and reverence, and treats friends with sincerity and trust, those who violate the precepts will be penalized by a twelve-year reduction in their lifespan, and the responsible officials will bear the affliction upon themselves.\n\nThe Precepts state: Those with lords cannot protect their states; those with ministers cannot preserve their lives. The sage seeks blessings before omens appear and severs misfortune before it arises. For disasters grow from the slightest beginnings, and illness arises from the most subtle origins. Small virtues, if not accumulated, will not bring great fortune. Those who do evil, though they may wish to rely on fragile vows, wear talismans, and protect themselves, if they refuse to change their hearts and minds, their sins will not be erased. They will also be penalized by a reduction in lifespan, and the five diseases will enter their bodies.\n\nThe Precepts state: One should constantly reflect on the sins and transgressions that bring illness. The Deities of Transgression, the Deities of Absolution, the Lord of Transgression, and the Lord of Absolution will absolve all sins, all worldly misdeeds one has committed, and thus the illness will be dispelled.\n\nUnregulated joy and anger is one illness.\nDisrespecting the elderly is one illness.\nLust without virtue is one illness.\nPerverse self-will is one illness.\nHatred to the point of wishing death is one illness.\nFollowing greed and corruption is one illness.\nArbitrary self-justification is one illness.\nGhostly flattery and deceit is one illness.\nReveling in misfortune and wrongdoing is one illness.\nDouble-tongued deceit is one illness.\nAbusing power and acting recklessly is one illness.\nCursing wind and rain is one illness.\nDisrespecting the orphaned and widowed is one illness.\nTeaching others to induce miscarriage is one illness.\nCoercion through power and force is one illness.\nPeering into others’ orifices is one illness.\nBorrowing without intending to return is one illness.\nTurning away from the Dao/Way is one illness.\nDistorting others to appear upright is one illness.\nMocking differences is one illness.\nTaking pleasure in evil people is one illness.\nPlundering nests and breaking eggs is one illness.\nFools who consider themselves wise is one illness.\nDestroying others with water or fire is one illness.\nClaiming credit for others’ achievements is one illness.\nEncouraging others to abandon their wives is one illness.\nResenting one’s own toil is one illness.\nUniting misfortune and discord is one illness.\nDelighting in others’ faults is one illness.\nInciting calamity and slander is one illness.\nUsing nobility to belittle others is one illness.\nCoveting what one sees is one illness.\nShaming the noble due to one’s baseness is one illness.\nSeeking profit without righteousness is one illness.\nParading one’s virtue is one illness.\nFixating on personal gain is one illness.\nDisrupting the public with the private is one illness.\nUndermining others to elevate oneself is one illness.\nSecret malice harming oneself is one illness.\nFrivolous speech and idle chatter is one illness.\nEngaging in slander and criticism is one illness.\nRejecting others to assert oneself is one illness.\nExposing others’ flaws to justify oneself is one illness.\nOverpowering others with force is one illness.\nWithholding aid from the worthy is one illness.\nSeeking to outtalk others is one illness.\nResentment and self-blame is one illness.\nFailing to reward kindness is one illness.\nUsing sorcery to harm others is one illness.\nHarming others with anger is one illness.\nResenting those who surpass oneself is one illness.\nBoasting of one’s joy and anger is one illness.\nAn unbalanced heart is one illness.\nClaiming truth through self-righteousness is one illness.\nRefusing admonishment is one illness.\nSlandering the meritorious is one illness.\nTreating talismans lightly is one illness.\nArrogance due to wealth is one illness.\nInsisting on one’s own correctness is one illness.\nEnvying the rich due to poverty is one illness.\nSquatting without propriety is one illness.\nSlandering others to seek a wife is one illness.\nDisrespecting the elderly and young is one illness.\nMocking others’ abilities is one illness.\nSabotaging others’ success is one illness.\nTaking pleasure in restraining the virtuous is one illness.\nDelighting in blocking others’ paths is one illness.\nRefusing to correct evil speech is one illness.\nConcealing and mocking others is one illness.\nEndangering others for self-preservation is one illness.\nInciting rebellion and defiance is one illness.\nExcessive hatred and little love is one illness.\nShifting blame onto others is one illness.\nCraving gain with deceit is one illness.\nExploiting others’ faults is one illness.\nRecklessness under the influence of alcohol is one illness.\nRegretting favors given to others is one illness.\nMeddling in others’ affairs is one illness.\nBestowing favors with expectation of return is one illness.\nTaking pleasure in killing is one illness.\nCursing insects and livestock is one illness.\nStealing and evading debt is one illness.\nDisparaging the great and noble is one illness.\nDelighting in rudeness and offense is one illness.\nPoisoning and tainting food is one illness.\nIntentionally harming others is one illness.\nDisloyal speech is one illness.\nDesiring to gossip about others’ faults is one illness.\nDwelling on past grievances is one illness.\nCutting open wombs and bodies is one illness.\nOutward affection with inward estrangement is one illness.\nMocking the blind, deaf, and mute is one illness.\nMocking the foolish and deluded is one illness.\nTeaching others to strike and beat is one illness.\nStriking without reason is one illness.\nTeaching others to do evil is one illness.\nExcessive suspicion and little trust is one illness.\nMocking the insane is one illness.\nVile speech and foul language is one illness.\nForcibly seizing others’ possessions is one illness.\n\nThe Precepts state: If one can eliminate these one hundred and one illnesses, there will be no disasters or misfortunes. One will attain longevity and transcend the world, and one’s descendants will receive blessings.\n\nThe Precepts state: Among the myriad people under heaven, those who are taught about sin and fortune yet violate the laws will have illness enter their bodies, their lives forfeited in the registers of punishment. Their names will be erased from the records of the living, and their bodies will perish.\n\nWhen one commits a transgression, one should reform one’s heart and change one’s conduct, upholding the Dao and its laws, and dare not again act in ways that incur the punishment of gods and spirits—thus half their offenses may be absolved. If one does not violate the laws, all transgressions may be overcome, and one shall attain longevity.\n\n**Statutes and Precepts**\nThe Precepts state: For Daoist priests, female officials, Daoist followers, register initiates, and commoners who pledge allegiance to a master, when the father passes, the son shall succeed; when the elder brother dies, the younger brother shall continue. Only the rightful heir may inherit; no other may do so. If the child is young and weak, an adult shall act as steward until the child comes of age and resumes governance as before. If there is no one to inherit, one must trace back to the original lineage and may not transfer allegiance to another. Violators shall be penalized with a twelve-year reduction in lifespan.\n\nThe Precepts state: After the passing of the original master of Daoist priests, female officials, register initiates, or Daoist followers, if their descendants are unfit to inherit or the lineage is lost due to chaos, the original master’s lineage shall be traced to its source. If no connection is found, they may seek a new master to whom they shall pledge allegiance, adhering to the teachings and laws, for this concerns the master of their very lives. To disrespect or neglect one’s master is to defy the gods; in governing a state, this brings chaos; in managing a household, it leads to ruin. Such misfortune extends to one’s ancestors and descendants.\n\nThe Precepts state: For male and female officials, register initiates, and Daoist followers, the Heavenly Tribute Rice is the most precious treasure of Heaven, the great token of the Registers of Life. It must not be treated lightly, for fortune and misfortune arise from it. The seventh day of the seventh month is the time for superior merit, the eighth month for middling merit, and the ninth month for lesser merit. Those who submit on the fifth day of the tenth month shall neither gain merit nor incur fault; all offerings must be delivered to their respective oratories. Violators shall have their names stricken from the Registers of Life, with no celestial officials to guard them. This penalty extends to seven generations of ancestors and descends to all descendants. The head of the household shall be penalized with a two-hundred-day reduction in lifespan, and each member of the household shall suffer a twenty-four-year reduction.\n\nThe Precepts state: Male and female officials and oratory heads shall oversee households and oratories, each ranked according to grade and title. For a first-rank oratory, the tribute rice from its people shall be one hundred *hu*: seventy *hu* shall be used for the oratory’s needs, and thirty *hu* shall be forwarded to the Celestial Master’s oratory. For two hundred *hu*, all shall be presented at the original oratory. If the distance exceeds three hundred *li*, offerings may be prepared at home. Failure to comply shall incur a thirty-six-year reduction in lifespan.\n\nThe Precepts state: For the birth of a son, an upper offering shall be made; for a daughter, a middle offering. This increases the household’s prosperity, seeks official protection, and ensures the family’s safety for the year. The upper offering is for seeking deliverance from calamity, safe travel, or promotion in office. The middle offering is for healing illness, resolving official disputes, or securing release from imprisonment. The lower offering shall be omitted here. Such are the graded statutes and laws. Violators shall be penalized with a twelve-year reduction in lifespan.\n\nThe Precepts state: Male and female officials, oratory heads, and register initiates shall report the number of their household’s vows at the year’s beginning. If fewer than ten people complete the vows by year’s end, a feast for twenty shall be prepared. For thirty or more, a feast for twenty-four shall be held. Even for households of a hundred, a thousand, or ten thousand, the feast shall not exceed twenty-four people. One person may be feasted per vow, up to a maximum of twenty-four. Violators shall be penalized with a twelve-year reduction in lifespan.\n\nThe Precepts state: Male and female officials, oratory heads, and register initiates shall follow the graded statutes for vows. For fewer than ten people, twenty *chi* of silk shall be offered; for twenty or more, forty *chi*. These shall be submitted upon receiving favor. Failure to comply shall incur a twelve-year reduction in lifespan.\n\nThe Precepts state: On the three assembly days, male and female officials and oratory heads shall provide feasts, distribute cloth, and allocate tribute rice. Recently, however, officials have compelled commoners to supply these assemblies, which contravenes the statutes. Violators shall be penalized with a twelve-year reduction in lifespan.\n\nThe Precepts state: For the birth of a son, a feast for ten shall be held, along with one hundred sheets of fine paper, a pair of brushes, a cake of ink, and a writing knife. For a daughter, a feast for five shall be held, along with a mat, a dustpan, and a broom. These shall be submitted by the end of the month. Failure to comply shall result in the parents losing twenty-four years of lifespan, and the child shall also be penalized. The Celestial Master’s oratory shall not take more than its due, nor may offerings be diverted for private use. Such offenses are grave, leading to the destruction of one’s person.\n\nThe Precepts state: Male and female officials and oratory heads shall ensure that those who follow the Dao retain their original lineage. Recently, however, officials have recklessly accepted households from others, a fault of the oratory heads who fail to instruct according to the statutes and hastily take charge. The ignorant commoners, believing it permissible, act as they please, disregarding the old traditions. The oratory heads shall bear the penalty of usurpation, while the people shall suffer the guilt of rebellion. The master shall report the matter, and the Heavenly Bureau shall surely intervene. Violators shall each be penalized with a twelve-year reduction in lifespan.\n\nThe Precepts state: When male and female officials, register initiates, and Daoist followers prepare offerings, the head of the household shall fast and invite guests the night before, examining the status of those invited. All shall be solemn and orderly, avoiding impurity. They shall bathe, change into clean robes, headscarves, coarse garments, trousers, and unlined jackets, and may not wear skirts or expose their clothing, lest they show disrespect to the Perfected. This is because these precepts carry the authority of the Heavenly Officials, and immortals descend to witness them—is this a trifling matter? All shall compose their minds and focus their thoughts, refraining from idle chatter or mundane matters. They shall follow the order of their registers and methods. If their ranks are equal, precedence shall be given to those initiated earlier. If they received their registers and oratory positions on the same day, the elder shall take precedence. Even if one holds an external office of higher rank, it shall not supersede an internal oratory position. If precedence is not observed, a separate order shall be established. Violators shall be penalized with a twelve-year reduction in lifespan.\n\nThe Precepts state: For male and female officials and oratory heads, the upper offering shall include five *sheng* of wine and three hundred coins per person. The middle offering shall include four *sheng* of wine and two hundred fifty coins per person. The lower offering shall include three *sheng* of wine and one hundred coins per person.\n\nGovernor A shall collect one hundred *hu* of civilian grain tax, of which eighty *hu* shall be delivered to the administration of B and C, and twenty *hu* transmitted to the Celestial Master’s administration. Governor A shall also collect one hundred *hu* of civilian grain tax in rice, of which eighty *hu* shall be delivered to the administration of D and E, and twenty *hu* transmitted to the Celestial Master’s administration. For all public oath offerings, the measurements shall be calculated as above and transmitted to the myriad people under heaven. For every *hu* of rice, two *dou* shall be allocated for messengers to deliver to the Celestial Master’s administration. If the rice fails to arrive, the Celestial Master’s administrators shall bear the penalty of reduction. Only paper, brushes, and ink shall be supplied for administrative use and need not be transmitted upward. Each shall strictly adhere to their duties; violators shall be penalized with a thirty-six-year reduction in lifespan.\n\nThe Precepts state: Should male officials, female officials, administrators, or commoners fall ill or encounter misfortune, those who urgently report it must be attended to with utmost haste; none shall use such occasions to advance private matters, fabricate calamities or malevolent influences, curry favor, or accept bribes—all such acts shall be calculated as offenses warranting reduction. Violators shall be penalized with a twelve-year reduction in lifespan.\n\nThe Precepts state: At the beginning of the year, male officials, female officials, administrators, and Daoist households shall register their dependents, including any illnesses or hardships, and make sincere vows, all of which shall be recorded in sworn statements. Administrators shall submit these reports as received, and upon the expiration of the grace period, the offerings shall be rendered, after which merits and labors shall be reported. None shall renege on their vows or breach their agreements, for such offenses are not minor. If no blessings are received, the vows shall be annulled, and no unwarranted claims shall be made. Even if deaths or reductions in household numbers occur during the year, the tax shall not be adjusted and shall be remitted as usual. All shall reverently comply. Violators shall be penalized with a twelve-year reduction in lifespan.\n\nThe Statutes state: Male officials, female officials, and administrators shall carefully select means to deliver the people and must not act perfunctorily or defile themselves with worldly filth. In transforming the people through purity and emptiness, all shall examine their written pledges, verify their circumstances, and ensure harmony among all household members, great and small, before disseminating the teachings and delivering them in accordance with the regulations. Violators shall be penalized with a two-year reduction in lifespan.\n\nThe Statutes state: Daoists, female officials, and administrators shall punish deceit and falsehood, pacify the Four Seas, receive the people with propriety, and nurture all living beings. On the three auspicious assembly days, they shall present themselves before the Heavenly Officials, instruct the ignorant masses, and disseminate merit and virtue, ensuring harmony between humans and spirits. Yet of late, many officials have slaughtered livestock to supply their kitchens and feasts, which contravenes the hidden laws. Seeking life through killing distances one from life itself. Offenders shall bring calamity upon future generations, and administrators shall be penalized with a twelve-year reduction in lifespan.\n\nThe Statutes state: Male officials, female officials, administrators, and register disciples who pacify through the virtue of Heaven shall establish altars on *jia-yi-bing-ding* lands, graded by rank. A household altar shall measure eight *chi* in width and one *zhang* in length. A medium altar shall measure one *zhang* two *chi* in width and one *zhang* four *chi* in length. A large altar shall measure one *zhang* six *chi* in width and one *zhang* eight *chi* in length. Its entrance shall face east, and the furnace shall be positioned at its center. Violations of these altar regulations shall be penalized with a twelve-year reduction in lifespan, adjudicated in accordance with the *Mengwei* statutes.\n\nThe Statutes state: Male officials, female officials, and administrators who receive titles of register and office are akin to royal appointments, and all selections and appointments shall proceed from the Heavenly Terrace. Yet of late, many officials have presumptuously conferred ranks upon one another in private, bestowing greater registers upon those who received lesser ones or transmitting the methods they themselves bear. Such acts contravene the hidden canons. Those deemed capable shall submit petitions for approval. Violators shall each be penalized with a twenty-four-year reduction in lifespan.\n\nThe Statutes state: Male officials, female officials, and administrators of the Yangping, Lutang, and Heming altars may appoint four *zheng* and itinerant altars. Those of the Lutang and Heming altars may appoint three *zheng* and itinerant altars. All others shall be subordinate to the Celestial Master’s altar. In receiving methods, one shall assume duties according to the weight of their merit and rank, without acting carelessly or seeking greater altars indiscriminately. Violators shall be penalized with a twenty-four-year reduction in lifespan.\n\nThe Statutes state: Daoists, female officials, administrators, and register disciples shall perform morning and evening audiences on the first and fifteenth days of each lunar month. They shall rise at cock’s crow, compose their countenances with reverence, don their caps and sashes, and, clad in robes, headbands, and seated mats, enter the altar in accordance with their ranks, hold their *hu* tablets, and perform the audience rites. Upon completion, they shall review the registers as per the old statutes. When departing to pay respects to their masters, they shall bow five times, inquire after their well-being, and then withdraw. On *wu-chen* and *wu-xu* days, no audience shall be held. Violators shall be penalized with a twelve-year reduction in lifespan.\n\nThe Statutes state: Male officials, female officials, administrators, and register disciples who forget or neglect the audience on *ji-wu* days shall be demoted one rank and penalized with a three-year reduction in lifespan. Those who fail to attend shall be demoted three ranks and penalized with a seven-year reduction. Failure to attend the audience with one’s master shall incur examination and punishment, for willful absence is a grave offense against Heaven and Earth.\n\nThe Statutes state: Male officials, female officials, register disciples, and Daoist households with defilements in their homes shall not enter the altar beyond the last day of the lunar month. Those in mourning shall refrain for three days. Those in three-year mourning that has not yet concluded shall not enter the altar, perform rites, or submit memorials or documents for one hundred days. Violators shall be examined and penalized with a twelve-year reduction in lifespan.\n\nThe Statutes state: Those who pledge themselves to the Dao shall vow to follow it until death, without wavering or hesitation, betraying the Dao and its virtue, or renouncing the Dao to return to secular life. Such offenses are not minor, and calamity shall befall their entire households. They shall also refrain from licentious sacrifices to evil spirits. Offenders shall submit written confessions to the Grand Altar, sincerely repent, and thereby avoid misfortune. Those who knowingly violate these precepts shall be penalized with a twelve-year reduction in lifespan.\n\nThe Statutes state: Daoists, female officials, and administrators, from the day they receive the Dao, shall cultivate themselves inwardly and ward off disasters outwardly. They shall not act recklessly, harm the common people, engage in hunting or fishing, or compete with one another, suppressing those more accomplished than themselves. Such conduct befits the deaf and blind, not the true essence of the Dao and its methods. Offenders shall be punished with eighty lashes, and administrators shall impose the penalty. To redeem such offenses, four *liang* of jade shall be offered as restitution.\n\nThe Statutes state: Daoists, female officials, and register disciples who have reached the age of eighteen may receive the Great Method. For external methods, from the Register of the One Hundred Fifty Generals upward, they may don yellow ritual robes and caps. For internal methods, from the *Zixuan Zhenwen* upward and below the *Shangqing Dadong*, they shall wear purple ritual robes, brown garments, *hu* tablets, shoes, trousers, and seated mats. The *hu* tablet shall be held by those who have received the Ten Precepts and above. For morning audiences, rituals, assemblies, and memorials, they shall be fully attired in ritual garments, caps, brown robes, *hu* tablets, and shoes. Violators shall forfeit eight *liang* of jade, and the penalty shall extend to three generations, including themselves, as adjudicated by the Water and Fire Officials in accordance with the jade statutes. Before the Three Sovereigns, the people were simple and unadorned, and rituals were rudimentary, hence the *ban* tablet, flat at both ends. After the Human Sovereign, it was called the *hu* tablet, symbolizing Heaven’s roundness and Earth’s squareness. All officials hold it, ever mindful of Heaven and Earth, embodying the Dao, and revering it as the law prescribes.\n\nThe Statutes state: Daoists, female officials, libationers, and register disciples who hold office in the methods and vows, upon death, must lie in state within the oratory or altar and shall not be kept in secular residences. This means that funeral rites and burials shall not take place among the laity. If their souls reside in defiled ground, the Three Officials of Heaven, Earth, and Water shall not permit their corpses to be examined or tormented, and they shall be sentenced to three years of labor in the Yellow River.\n\nThe Statutes state: The Yangping, Lutang, Heming, and other altars, along with their male officials, female officials, administrators, and register disciples, shall teach and transcribe the regulations as set forth above. Yet of late, many officials, commoners, and Daoist households—some without masters, establishing their own methods; others far removed from their original altars, scattered across the countryside—have privately conferred titles, led households, and wielded authority at will...\n\nSome, though not far removed from their altars, have become isolated and cut off, leading to the seizure of commoners’ property and fragile goods, which have lain abandoned for years. These they privately appropriate for themselves, failing to report or submit them, creating their own laws without proper transmission or authority. They violate the unseen statutes in countless ways, their transgressions manifold.\n\nAs a result, the true Dao is obscured, truth and falsehood indistinguishable. The rhythms of qi are disrupted, and malevolent forces proliferate. Those who suffer calamities and endure punishments—how grievous it is! All this stems from the repeated failures of those in charge, who have not promoted the sagely transformation, leaving the ignorant in fear and confusion. They assume such transgressions are trivial, unaware of the statutes, ordinances, and regulations, each with its distinct purpose. All must be made known, proclaimed, and disseminated. Reward the virtuous and punish the wicked, spurring one another to vigilance. Examine matters with precision, ensuring that diligence is met with its due virtue. Those who violate these precepts shall be recorded by the Earth Official, their names linked and reported upward for investigation and punishment according to the law. If the responsible officials fail to expose such offenses, they shall share the same guilt.\n\nProclamations must be issued, and all shall comply with the statutes and ordinances of the Mystic Capital as follows.\n\n---\n\n**Statutes on Memorials and Petitions**\n\nThe Statutes state: Those who suffer misfortune—declining fortunes, repeated disasters, the loss of descendants, illness and debility, unfulfilled desires, imprisonment, depletion of qi and blood, extreme poverty and hardship, premature death, madness, deafness, or muteness—those who give rise to treacherous ministers or rebellious children, whose families are ruined by madness or possession, who are executed in the marketplace, whose remains are lost, who perish by water, fire, blade, or banditry, whose fields and silkworms fail, whose clothing and food are insufficient, whose official careers stall—all these stem from their sins. The Offices of Fault and Judgment, the masters of their households, and the officials within their altars have harmed them, examining the transgressions of their past lives, bringing down the consequences of their misdeeds.\n\nAll such cases must be documented with details: the prefecture, county, village, age, gender, household size, residence, and the name of their master. The facts must be verified, the ancient principles followed, and the circumstances clearly stated. These memorials shall be presented to the Libationers of the altars under the Celestial Master, to the Devout Masters who oversee the households. Petitions shall be submitted in accordance with the seasons—spring, autumn, winter, and summer—with bows and reverent gestures, continuing until the cheeks are flushed with sincerity.\n\nSuch memorials and petitions are offered to the heavenly courts to absolve sins, dispel calamities, and invoke blessings.\n\nThe Statutes state: In Luoyang’s Pure Abode, the Celestial Master, following the immortals, migrated west to the Red City of Shu. The world was turbid and impure, the age chaotic and unjust. Thus, he grasped the Pillar of Heaven, stood at the Gate of Heaven, and revealed the new Dao of Orthodox Unity and Alliance of Powers, seeking to purify the relationship between heaven and humanity, punish the guilty and unjust, and nurture all living beings. He established the Twenty-Four Altars, appointing twenty-four male and female officials, and through the grace of the Primordial Mystery, enlightened future generations. All who repented their transgressions were granted the rank of Perfected.\n\nEach month, three memorials may be submitted to repent of sins, sever karmic ties, and eliminate disasters and illnesses. In times of dire urgency, three memorials may be submitted in a single month.\n\nThe Statutes state: When entering an altar to submit a memorial, one must attire oneself in proper robes and cap, sit upright, and visualize the generative qi of the Five Directions and the functionaries and soldiers within one’s own body, aligning them according to their positions. One must act as though the deities are present, standing to the left and right, before and behind.\n\nThis means that when entering an altar to submit a memorial, one must clear the mind and focus the intent, fully invoking the presence of the divine.\n\nThe Statutes state: When entering an altar to submit a memorial, avoid the days of *wu-chen* and *wu-xu*. Do not submit memorials during periods of defilement, nor on the last or first day of the lunar month. The people of the world must not approach altars or meet their masters while in a state of defilement. Violations shall be punished by the deduction of years from one’s lifespan, and the transgressor shall incur the very sins they sought to avoid. All such offenses shall be prosecuted by the Offices of Fault and Judgment.\n\nThe Statutes state: When entering an altar to submit a memorial, one must proceed with dignity, following the proper order to the left and right with solemn reverence. Men and women must not intermingle, nor may one gaze about, speak irreverently, or move too hastily or slowly. If the responsible officials or functionaries fail to enforce this, they shall be demoted one rank. If they do not demote themselves, they shall be fined three *liang* of jade and penalized by the deduction of twenty-four years from their lifespan.\n\nThe Statutes state: Daoists must not recklessly submit memorials on behalf of men or women guilty of evil and rebellion. Such offenses include licentiousness, theft, violence, treachery, disobedience to parents or masters, disloyalty to rulers or elders, disrespect for the Dao and its power, irreverence toward spirits, harming others, deceit, slander, betraying parents, rebelling against masters, and all manner of unfilial or unvirtuous conduct. None guilty of such acts may submit memorials.\n\nIf they do so within a year, five years shall be deducted from their lifespan, and upon death, they shall be handed over to the River Earl for penal servitude. They shall also be fined eight *liang* of jade and demoted two ranks.\n\nThe Statutes state: Memorials must be plain and unadorned, unskilled yet not cunning, simple yet not ornate, truthful yet not false, direct yet not convoluted, clear yet not verbose, modest yet not vulgar, pure yet not turbid, forthright yet measured, concise yet sincere. Such memorials move heaven and earth, stir the spirits, ascend to the heavenly courts, and receive swift response. Violations shall be prosecuted by the Offices of Fault and Judgment, and the responsible officials shall be held accountable.\n\nThe Statutes state: To alleviate illness, face the Ghost Gate. To dispel disaster, face the Earth Portal. To seek longevity, face the Heavenly Gate. To attain wealth and honor, face the Earth Portal. To counter slander and curses, face the Human Gate. To suppress tigers, face *yin*. To suppress snakes, face *si*. Aligning with the Celestial Stem brings great fortune.\n\nThe Statutes state: To seek wealth and honor, submit memorials on the day of *wu-zi*, the Day of the Heavenly Granary. To seek official rank, submit on the Day of the Heavenly Treasury, avoiding days of self-punishment. The days of *wu*, *you*, *hai*, and *chen* are days of self-punishment. *Yin* punishes *si*, *xu* punishes *wei*, *zi* punishes *mao*, *shen* punishes *yin*, *mao* punishes *zi*, and *si* punishes *shen*. Violations shall result in punishment by flogging and fifty days of illness.\n\nThe Statutes state: Memorials and petitions to absolve the sins and sufferings of deceased ancestors, as well as to address one’s own illnesses, disasters, fortunes, and misfortunes, shall be submitted through one’s original altar. If one’s master is too distant, one may approach another of the same tradition.\n\nShould one who is neither a lineage ancestor-master nor a *jia*-rank Libationer overseeing households and governing altars submit a memorial, it shall not reach the Celestial Bureaus. From *jia*, *yi*, *bing*, *ding* and below, all are considered as submitting in response. Those who oversee three hundred households or more serve as Healing Officers; those who oversee three households or more serve as Office Stewards—all are considered as principals.\n\nThe Statutes state: To cultivate blessings and prolong life, to dispel disasters and harm, and to treat the hundred illnesses caused by malevolent influences, submit memorials facing east. To absolve ancestral tombs of debts, to open the heart and sharpen the mind, and to pass through calamities and crises, submit memorials facing west.\n\nThe Statutes state: In times of dire calamity and mortal peril, to seek life from the midst of death, to subdue evil and suppress demonic forces, submit memorials facing north.\n\nThe Statutes state: To cultivate the body and nurture the nature, to attain warmth, prosperity, and the fulfillment of ten thousand wishes, submit memorials facing south.\n\nThe Statutes state: All memorials shall be presented with sincerity, standing upright in trustworthiness, to verify the resolve of the heart. They shall be pledged with the officers and soldiers of the Dao, and the statutes must not be violated.\n\nThe Statutes state: When Heaven removes one destined for death, Heaven reduces the sentence. In such cases, it benefits the many—do not imitate others. For later generations and descendants, this is the blessing of the aged.\n\nAll ordained Daoist officials, female officers, and both common and newly initiated lay followers shall not share food or drink with households engaged in reckless and defiled sacrifices. Those of such households invite one another, drinking wine and eating meat, men and women gathering together, young and old speaking and laughing as they please—this is what I forbid. Do not be misled by the desires of the mouth and stomach, causing the ceaseless coming and going of demonic qi, thereby inviting disaster. One ought to regulate the officers and soldiers within the body, for all shall bear the name of impurity and prepare in advance. If afflicted by harm, do not complain or resent.\n\nThe Statutes state: All ordained Daoist officials and female officers shall not frequently send lay followers to perform purifications or exorcisms, for these are rife with taboos, fostering deceit and falsehood, acting on private whims and suspicions, and harboring impure intentions—ultimately, they shall not receive the grace of the Dao. Deceit and falsity will bring their own suffering, and prolonged indulgence shall yield no benefit to the body. This is forbidden by the statutes and may incur resentment toward Heaven.\n\nThe Statutes state: Daoist officials and female officers shall not permit lay followers to privately worship spirits or ghosts, to slaughter pigs and sheep, or to spread heretical and bewildering speech. Such false practices are all forbidden by the Dao. If any such conduct appears, it must be severed entirely. Violations of these statutes breach the prohibitions of the Registers and shall incur a penalty of one *ji*.\n\nThe Statutes of the Mystery Capital conclude.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "玄都律文 经名：玄都律文。 撰人不详，约出铃南北朝末。 据《三洞珠囊》等书引述，原本应有二十品以上。 《通志· 艺文略》着录作二十五卷。 现仅残存一卷。 底本出处：《正统道藏》洞真部戒律类。 玄都律文 虚无善恶律 一者遗形忘体，怕然若死，谓之虚。 二者损心弃意，废伪去欲，谓之无。 三者专精积神，不为物集，谓之清。 四者反神服气，安而不动，谓之静。 五者深居宴处，功名不显，谓之微。 六者去妻离子，独与道游，谓之寡。 七者呼吸冲和，滑泽细微，谓之柔。 八者缓形纵体，以奉百事，谓之弱。 九者僧恶尊荣，安贫乐辱，谓之卑。 十者遁赢逃满，衣食粗疏，谓之损。 十一者争作阴阳，应变却邪，谓之时。 十二者不饥不渴，不寒不暑，不喜不怒，不哀不乐，不迟不疾，谓之和。 十三者爱视爱听，爱言爱虑，不费精神，和光顺世，谓之啬。 律曰：凡此十三者，混沌为虚无，行道守真者，敬奉师法，顺天教令，穷极无为之道，虚、无、清、静、微、寡、柔、弱、卑、损、时、和、啬。 夫为道者，气炼形易，民和国宁家吉，灾不起，寿命延，家国昌。 违律者为天所刑。 律曰：人不念作善，但行恶事，父母不孝，事师主不义，事君不忠，为善者自天佑之，为恶者天必殃之。 人有一善，心定体安。 人有十善，气力强壮。 人有二十善，身无疾病。 人有三十善，所求者得。 人有四十善，昌炽富贵。 人有五十善，子孙富盛。 人有六十善，遭厄得脱。 人有七十善，神明护之。 人有八十善，得地之利。 人有九十善，尊贵显荣。 人有百善，天德降之珍宝。 人有二百善，后世扬名。 夫下人有三百善，后世大富。 人有四百善，后世出富贵人。 人有五百善，后世延寿。 人有六百善，后世出忠孝。 人有七百善，后世智慧。 人有八百善，后世道德。 人有九百善，后世出贤圣人。 人有千善，后世出神仙真人。 右人有为善者，得福自天佑之。 人有一恶，心劳体烦。 人有十恶，血气虚羸。 人有二十恶，身多疾病。 人有三十恶，所求不谐。 人有四十恶，轗轲衰耗。 人有五十恶，绝无子孙。 人有六十恶，数得非祸。 人有七十恶，贼鬼害之。 人有八十恶，水火害之。 人有九十恶，贫贱困极。 人有百恶，天地残罚其形。 人有百五十恶，寇贼害之。 人有二百恶，后世无姓族。 人有三百恶，后世受贫困。 人有四百恶，后世没为奴婢。 戒颂律 第一勿诈鬼欺神，轻罔天道。 第二勿以伪为真，以真为伪。 第三勿以善为恶，以恶为善。 第四勿以曲为直，以直为曲。 第五勿以浊为清，以清为浊。 第六勿以邪为正，以正为邪。 第七勿以丑为好，以好为丑。 第八勿以虚为实，以实为虚。 第九勿以逆为顺，以顺为逆。 第十勿以非为是，以是为非。 第十一勿以亲为疏，以疏为亲。 第十二勿以东为西，以西为东。 律曰：十三条名曰妖惑之人耳，身受其害，舍命不得全生，灾殃流及五世，子孙犯者，害命夺算，犯主吏坐谪，依罪轻重论也。 律曰：常敬从师教，令一如师法，不得轻冒，诈伪欺罔，违律罚算四百日，主吏坐谪。 律曰：常以平日一、日中、日入后存想五方五气。 东方青气化为青龙，西方白气化为白虎，南方赤气化为朱雀，北方黑气化为玄武，中央黄气化为己身，则调和五方，音而颂之。",
      "translated_text": "**Xuandu Precepts Text**\n\n**Scripture Title:** *Xuandu Precepts Text*. The compiler is unknown, likely composed toward the end of the Northern and Southern Dynasties. According to references in works such as the *Three Caverns Pearl Niche*, the original text should have contained over twenty chapters. The *Tongzhi: Arts and Literature Catalogue* records it as comprising twenty-five scrolls. Only one scroll now remains.\n\n**Source of the Base Text:** *Daoist Canon of the Zhengtong Era*, *Cavern of Perfection* section, Precepts and Disciplines category.\n\n---\n\n### **Xuandu Precepts Text**\n#### **The Precepts of Void and Non-Differentiation Between Good and Evil**\n\n1. Abandoning form and forgetting the body, as if dead—this is called *void*.\n2. Diminishing the mind and discarding intentions, casting off falsity and forsaking desires—this is called *non-being*.\n3. Concentrating spirit and accumulating essence, not allowing things to gather—this is called *purity*.\n4. Returning spirit and ingesting *qi*, settled and unmoving—this is called *stillness*.\n5. Dwelling in seclusion, one’s merits and name unseen—this is called *subtlety*.\n6. Forsaking wife and children, wandering alone with the Dao—this is called *solitude*.\n7. Breathing in harmony, smooth and fine—this is called *gentleness*.\n8. Relaxing the body and freeing the form, attending to all matters—this is called *weakness*.\n9. Despising honor and embracing disgrace, content in poverty and humiliation—this is called *lowliness*.\n10. Shunning excess and fleeing fullness, clothing and food coarse and simple—this is called *reduction*.\n11. Contending with *yin* and *yang*, responding to changes and repelling evil—this is called *timeliness*.\n12. Neither hungry nor thirsty, neither cold nor hot, neither joyful nor angry, neither sorrowful nor delighted, neither slow nor hasty—this is called *harmony*.\n13. Loving sight and hearing, loving speech and thought, without expending spirit, blending light and conforming to the world—this is called *thrift*.\n\n**The Precept states:** These thirteen principles merge into the primordial chaos of *void* and *non-being*. Those who practice the Dao and guard the True must revere the teachings of their masters, follow the celestial decrees, and exhaust the Dao of *non-action*—*void, non-being, purity, stillness, subtlety, solitude, gentleness, weakness, lowliness, reduction, timeliness, harmony, thrift*.\n\nFor those who cultivate the Dao, refining *qi* and transforming form, the people will be harmonious, the state peaceful, families auspicious, disasters will not arise, lifespans will extend, and households and nations will flourish.\n\nThose who violate the precepts will be punished by Heaven.\n\n**The Precept states:** If one does not contemplate good deeds but only commits evil acts—being unfilial to parents, disloyal to masters and lords, unfaithful to rulers—those who do good will be blessed by Heaven, while those who do evil will be cursed by Heaven.\n\n- One who performs **one good deed** will have a settled mind and a peaceful body.\n- One who performs **ten good deeds** will have strong *qi* and vitality.\n- One who performs **twenty good deeds** will be free from illness.\n- One who performs **thirty good deeds** will obtain what they seek.\n- One who performs **forty good deeds** will enjoy prosperity and wealth.\n- One who performs **fifty good deeds** will have flourishing descendants.\n- One who performs **sixty good deeds** will escape calamities.\n- One who performs **seventy good deeds** will be protected by divine spirits.\n- One who performs **eighty good deeds** will gain the benefits of the earth.\n- One who performs **ninety good deeds** will attain honor and glory.\n- One who performs **a hundred good deeds** will receive Heaven’s virtue and precious treasures.\n- One who performs **two hundred good deeds** will have their name renowned in later generations.\n- One who performs **three hundred good deeds** will bring great wealth to their descendants.\n- One who performs **four hundred good deeds** will produce noble and wealthy descendants.\n- One who performs **five hundred good deeds** will extend the lifespan of their descendants.\n- One who performs **six hundred good deeds** will produce loyal and filial descendants.\n- One who performs **seven hundred good deeds** will produce wise descendants.\n- One who performs **eight hundred good deeds** will produce descendants of virtue.\n- One who performs **nine hundred good deeds** will produce sagely and worthy descendants.\n- One who performs **a thousand good deeds** will produce immortals and perfected beings.\n\nThose who perform good deeds will receive blessings and protection from Heaven.\n\n- One who commits **one evil act** will have a troubled mind and a weary body.\n- One who commits **ten evil acts** will have depleted blood and *qi*.\n- One who commits **twenty evil acts** will suffer many illnesses.\n- One who commits **thirty evil acts** will fail in their pursuits.\n- One who commits **forty evil acts** will experience misfortune and decline.\n- One who commits **fifty evil acts** will have no descendants.\n- One who commits **sixty evil acts** will frequently encounter disasters.\n- One who commits **seventy evil acts** will be harmed by malevolent spirits.\n- One who commits **eighty evil acts** will be harmed by water and fire.\n- One who commits **ninety evil acts** will suffer extreme poverty and hardship.\n- One who commits **a hundred evil acts** will be physically punished by Heaven and Earth.\n- One who commits **a hundred and fifty evil acts** will be harmed by bandits.\n- One who commits **two hundred evil acts** will have no lineage in later generations.\n- One who commits **three hundred evil acts** will suffer poverty in later generations.\n- One who commits **four hundred evil acts** will descend into servitude in later generations.\n\n---\n\n### **Precepts and Verses of Prohibitions**\n\n1. **Do not deceive ghosts or cheat spirits**, nor trifle with the celestial Dao.\n2. **Do not take the false as true**, nor the true as false.\n3. **Do not take good as evil**, nor evil as good.\n4. **Do not take the crooked as straight**, nor the straight as crooked.\n5. **Do not take the turbid as clear**, nor the clear as turbid.\n6. **Do not take the perverse as upright**, nor the upright as perverse.\n7. **Do not take the ugly as beautiful**, nor the beautiful as ugly.\n8. **Do not take the empty as solid**, nor the solid as empty.\n9. **Do not take the contrary as compliant**, nor the compliant as contrary.\n10. **Do not take the wrong as right**, nor the right as wrong.\n11. **Do not take the close as distant**, nor the distant as close.\n12. **Do not take east as west**, nor west as east.\n\n**The Precept states:** These thirteen prohibitions are the ways of those who are deluded and confused. Their bodies will suffer harm, and they will not preserve their lives. Disasters will flow into five generations, and descendants who violate them will have their lifespans shortened and their allotted years seized. Those who preside over such violations will be demoted according to the severity of the offense.\n\n**The Precept states:** Always respect and follow the master’s teachings, adhering strictly to their methods. Do not act lightly, deceive, or falsify. Violators will be penalized with a reduction of four hundred days in their allotted lifespan, and those responsible will be demoted.\n\n**The Precept states:** Regularly at dawn, noon, and dusk, visualize the *qi* of the five directions:\n- The **eastern blue *qi*** transforms into the Azure Dragon,\n- The **western white *qi*** transforms into the White Tiger,\n- The **southern red *qi*** transforms into the Vermilion Bird,\n- The **northern black *qi*** transforms into the Dark Warrior,\n- The **central yellow *qi*** transforms into one’s own body.\n\nThus, harmonizing the five directions, one chants and recites their names.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1261,
      "start_sentence": 0,
      "end_sentence": 78,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.4770770072937,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\玄都律文.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "违律者罚算三百日，主吏坐谪。 律曰：平旦颂曰：微妙而博大，子元气之精光。 巨丽而可乐，子魂神之翱翔。 藏我胸臆中，子廓然虚而张。 洁白如明月，子通洞乎十方。 芝草何        英英，子不忧无食粮。 呼吸新与故，子因以通神明。 律曰：暮颂曰：旷旷怖怖，与神元惧，被服精华，饮食玄武。 招摇为马，玉衡为辐，上下无限，出入无时。 百病除愈，神气独持，司命着籍，玉简丹书。 编以金缕，缠以素丝，千亿巨万，无所复疑。 太一佑我，神明扶持，清静绝念，向王相地。 颂之佩箓，吏与天地作约，以身修道乐法者，皆颂之。 不如法，罚算五年，主吏坐谪。 律曰： 戊辰、戊戌日不得颂，正心守一念道，眼无妄视，口无妄言，心无妄念，耳无妄听，违律夺算五十。 安神定志，尊道德，敬师长。 不如律，轻慢道德，不敬师友，为家则祸灾，为国则乱亡，罚算二纪，主吏谪千日。 谓道德之人师朋友，当如礼敬事之。 律曰：宽和忠孝，恭敬朝修，淡泊慈仁，畜孝笃信，思义所行。 不如律，罚算七纪。 不得因鬼称神，托名官号，诽师谤道，淫祀百鬼，反真乱正，自作法度，不如师法。 违律者罪及害身，主吏罚五年也。 律曰：不得食日暮之食，不得食祭神之食。 违律罚算千日也。 谓日之暮亦不须食也。 遇祭鬼神之食，食之者皆坐罪也。 百药律 律曰：夫德以除灾，药以愈病。 不知律者，为国则无延祚之期，为家则无子孙，为身则刑兆虚乱，正气不居，年命为衰。 故非道而治，非法而言，亡算夺纪，司过言罪，司命削籍。 律曰：德为医也，行为药也。 人不修其德行而广求医药，藏罪而多求章表，上而所行不改，其罪更凶。 律曰：柔弱去欲，宽和恭逊，药之道德府。 违律者罚算五年，主吏坐之。 尊天敬地为一药，钦奉三光为一药，恬淡无欲为一药，仁恕谦让为一药，好生恶杀为一药，不多聚财为一药，不犯禁忌为一药，廉洁贞信为一药，不烧山林为一药，空车助载为一药，志弱性柔为一药，不自尊大为一药，行宽心和为一药，不好阴私为一药，动静有礼为一药，阴德树功为一药，起居有节为一药，不论诉人为一药，近德远色为一药，灾病不干为一药，施不望报为一药，为人慕愿为一药，推恩义让为一药，慈愍怜爱为一药，好称誉人为一药，心静意定为一药，为人愿福为一药，被邪弼正为一药，不干豫人为一药，教化愚暗为一药，戒勑童蒙为一药，解散思虑为一药，因贵为惠为一药，内修孝悌为一药，为人起利为一药，蔽恶扬善为一药，以力助人为一药，好饮食赐人为一药，怜贫伤危为一药，救日月蚀为一药，言语谦逊为一药，恬淡宽舒为一药，不负宿债为一药，思神念道为一药，质径端正为一药，立功不倦为一药，不争是非为一药，除情去欲为一药，受辱不怨为一药，不取非财为一药，推好取丑为一药，虽灾自受为一药，称扬贤良为一药，好相引用为一药，不自彰显为一药，救祸济难为一药，不自伐善为一药，谏正邪乱为一药，劳苦不恨为一药，开导迷误为一药，覆蔽人过为一药，因富布施为一药，进胜己者为一药，扶接老弱为一药，惠与穷乏为一药，誓不骂詈为一药，为人严净为一药，智德不退为一药，位高接士为一药，好言善语为一药，恭敬卑微为一药，生无懈怠为一药，至诚笃信为一药，不骂畜生为一药，推直引曲为一药，心平意等为一药，进退可否为一药，不念旧恶为一药，推善掩恶为一药，听谏受化为一药，推多取少为一药，忿怒自制为一药，见贤自省为一药，闭门恭肃为一药，推功救苦为一药，尊奉耆老为一药，好人有功为一药，清廉贞分为一药，听经实行为一药，助人执力为一药，富有愍无为一药，远嫌避疑为一药，安贫不怨为一药，尊奉圣文为一药，好成功德为一药，宣扬圣化为一药，得失自观为一药，劝人学道为一药，愿礼拜三宝为一药，以言为善为一药。",
      "translated_text": "**Violators of this precept will be penalized with a reduction of three hundred days in their allotted lifespan, and those responsible will be demoted.**\n\n**The Precept states:** At dawn, recite the following:\n*\"Subtle and vast, you are the essence and radiance of primal *qi*.\nMajestic and joyous, you soar as my soul and spirit.\nDwelling within my breast, you expand in emptiness and boundlessness.\nPure as the bright moon, you penetrate the ten directions.\nHow flourishing the sacred herbs—no fear of lacking sustenance.\nInhaling the new, exhaling the old, you thereby commune with the divine.\"*\n\n**The Precept states:** At dusk, recite the following:\n*\"Vast and awe-inspiring, in reverence for the divine,\nClad in essence, nourished by the mysterious,\nThe Dipper’s handle as steed, its stars as spokes,\nBoundless above and below, timeless in coming and going.\nA hundred ailments healed, the spirit and *qi* sustained,\nThe Controller of Fate records it in jade tablets and cinnabar script,\nBound with golden threads, wrapped in white silk,\nCountless eons assured—no further doubt.\nThe Great One protects me, the divine uphold me.\nIn purity, free from thoughts, face the prosperous earth.\nRecite this, wear the talisman, and the officer pledges with Heaven and Earth.\nThose who cultivate the Dao and delight in the Dharma shall recite it.\nFailure to comply incurs a penalty of five years’ reduction in lifespan, and those responsible will be demoted.\"*\n\n**The Precept states:** On *wuchen* and *wuxu* days, recitation is forbidden. Instead, maintain a single-minded focus on the Dao, with eyes free from reckless gazing, mouth free from reckless speech, mind free from reckless thoughts, and ears free from reckless hearing. Violators will be penalized with a reduction of fifty days in their allotted lifespan.\n\nCalm the spirit and settle the will, honor virtue and power, and revere teachers and elders. Failure to comply—showing disdain for virtue and power, or disrespecting teachers and friends—brings misfortune to the household and ruin to the state, with a penalty of two twelve-year cycles in lifespan reduction, and those responsible demoted for a thousand days.\n\nThis refers to treating teachers, friends, and those of virtue and power with the reverence due to them.\n\n**The Precept states:** Be magnanimous, loyal, filial, reverent in morning practice, detached, compassionate, and benevolent. Cultivate filial piety and sincerity, and act with righteousness. Failure to comply incurs a penalty of seven twelve-year cycles.\n\nDo not invoke spirits under false pretenses, assume official titles without authority, slander teachers or defame the Dao, engage in licentious sacrifices to myriad ghosts, subvert truth, or create unauthorized rituals contrary to the master’s teachings. Violators will suffer harm to themselves, and those responsible will be penalized for five years.\n\n**The Precept states:** Do not eat food at dusk, nor consume offerings to spirits. Violators will be penalized with a reduction of a thousand days in their allotted lifespan.\n\nThis means one should not eat even at dusk, and consuming food offered to ghosts or spirits incurs guilt.\n\n**The Precepts on Medicinal Virtue**\n\n**The Precept states:** Virtue dispels calamity, and medicine cures illness. Those who disregard these precepts will, as rulers, forfeit their reign; as households, lose their descendants; as individuals, invite chaos and misfortune, with vital *qi* dispersed and lifespans diminished. Thus, governing without the Dao or speaking without the Dharma results in the loss of lifespan and cycles, the Recording Deity reports the transgression, and the Controller of Fate strikes one’s name from the register.\n\n**The Precept states:** Virtue is the physician, and conduct is the medicine. Those who neglect virtue and conduct while seeking medicine or amassing petitions, yet fail to reform their actions, incur even greater transgressions.\n\n**The Precept states:** Gentleness, humility, and the abandonment of desire are the repository of medicinal virtue. Violators will be penalized with a reduction of five years in their allotted lifespan, and those responsible will be held accountable.\n\nHonoring Heaven and revering Earth is one medicine.\nRevering the Three Luminaries is one medicine.\nSerenity and freedom from desire is one medicine.\nBenevolence, forbearance, and humility is one medicine.\nCherishing life and detesting killing is one medicine.\nNot hoarding wealth is one medicine.\nNot violating prohibitions is one medicine.\nIntegrity, chastity, and trustworthiness is one medicine.\nNot burning mountains and forests is one medicine.\nAssisting with an empty cart is one medicine.\nA gentle will and a soft nature is one medicine.\nNot exalting oneself is one medicine.\nA magnanimous demeanor and a harmonious heart is one medicine.\nNot indulging in secrecy is one medicine.\nConducting oneself with propriety in movement and stillness is one medicine.\nCultivating hidden virtue and establishing merit is one medicine.\nRegulating daily life with moderation is one medicine.\nNot litigating against others is one medicine.\nDrawing near to virtue and distancing oneself from lust is one medicine.\nNot burdening others in times of illness or misfortune is one medicine.\nGiving without expecting reward is one medicine.\nAspiring to emulate others is one medicine.\nExtending kindness and yielding to righteousness is one medicine.\nCompassion and tender love is one medicine.\nPraising others is one medicine.\nA tranquil heart and a settled mind is one medicine.\nWishing blessings upon others is one medicine.\nCorrecting the perverse and assisting the upright is one medicine.\nNot interfering in others’ affairs is one medicine.\nEnlightening the ignorant is one medicine.\nInstructing and admonishing the young is one medicine.\nDispelling anxious thoughts is one medicine.\nBestowing kindness when in a position of power is one medicine.\nCultivating filial piety and fraternal duty is one medicine.\nCreating benefits for others is one medicine.\nConcealing others’ faults and extolling their virtues is one medicine.\nAssisting others with one’s strength is one medicine.\nSharing food and drink with others is one medicine.\nPitying the poor and aiding the distressed is one medicine.\nRescuing the sun and moon during eclipses is one medicine.\nSpeaking with humility is one medicine.\nSerenity and magnanimity is one medicine.\nNot defaulting on debts is one medicine.\nContemplating the divine and meditating on the Dao is one medicine.\nUpright and straightforward conduct is one medicine.\nEstablishing merit without weariness is one medicine.\nNot contending over right and wrong is one medicine.\nEliminating emotions and abandoning desires is one medicine.\nEnduring humiliation without resentment is one medicine.\nNot taking illicit wealth is one medicine.\nYielding beauty to embrace ugliness is one medicine.\nBearing misfortune oneself is one medicine.\nExtolling the worthy and good is one medicine.\nRecommending and employing others is one medicine.\nNot flaunting one’s own merits is one medicine.\nRescuing from disaster and aiding the distressed is one medicine.\nNot boasting of one’s own goodness is one medicine.\nAdmonishing and correcting the perverse is one medicine.\nEnduring hardship without resentment is one medicine.\nGuiding the lost and misguided is one medicine.\nConcealing others’ transgressions is one medicine.\nBestowing alms when wealthy is one medicine.\nPromoting those superior to oneself is one medicine.\nSupporting the elderly and weak is one medicine.\nBestowing kindness upon the destitute is one medicine.\nVowing never to curse or revile is one medicine.\nMaintaining strict purity for others is one medicine.\nUnwavering in wisdom and virtue is one medicine.\nHonoring scholars when in high position is one medicine.\nSpeaking kind and virtuous words is one medicine.\nReverence and humility is one medicine.\nDiligence without slackness is one medicine.\nUtmost sincerity and unwavering faith is one medicine.\nNot cursing animals is one medicine.\nUpholding the upright and guiding the crooked is one medicine.\nA balanced heart and an equanimous mind is one medicine.\nJudging right and wrong with propriety is one medicine.\nNot dwelling on past grievances is one medicine.\nPromoting good and concealing evil is one medicine.\nHeeding admonitions and accepting transformation is one medicine.\nTaking more for oneself and giving less to others is one medicine.\nRestraining anger and mastering oneself is one medicine.\nReflecting on oneself upon seeing the worthy is one medicine.\nMaintaining reverence behind closed doors is one medicine.\nAttributing merit and relieving suffering is one medicine.\nHonoring the elderly and venerable is one medicine.\nAcknowledging others’ merits is one medicine.\nPurity, integrity, and adherence to one’s duty is one medicine.\nListening to scriptures and putting them into practice is one medicine.\nAssisting others with one’s strength is one medicine.\nCompassion for the wealthy toward the poor is one medicine.\nAvoiding suspicion and distancing oneself from doubt is one medicine.\nEnduring poverty without resentment is one medicine.\nRevering sacred texts is one medicine.\nDelighting in meritorious deeds is one medicine.\nPropagating sacred teachings is one medicine.\nReflecting on gains and losses is one medicine.\nEncouraging others to study the Dao is one medicine.\nAspiring to venerate the Three Treasures is one medicine.\nUsing words for good is one medicine.",
      "overlap_context": "emoted.\n\n**The Precept states:** Regularly at dawn, noon, and dusk, visualize the *qi* of the five directions:\n- The **eastern blue *qi*** transforms into the Azure Dragon,\n- The **western white *qi*** transforms into the White Tiger,\n- The **southern red *qi*** transforms into the Vermilion Bird,\n- The **northern black *qi*** transforms into the Dark Warrior,\n- The **central yellow *qi*** transforms into one’s own body.\n\nThus, harmonizing the five directions, one chants and recites their names.",
      "start_char": 1261,
      "end_char": 2757,
      "start_sentence": 79,
      "end_sentence": 113,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.31852960586548,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\玄都律文.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "律曰：夫人有疾病者，坐於过恶，阴掩不见，故应以病。 因绿非饮食风寒温气而起也，由其人犯法违戒，神魂拘谪，不在形质，肌疏藏虚，精气不守，敢为利焉。 虽居荣服，不敢为非。 度形而为衣，量腹而为食。 虽富且贵，不敢恣欲。 虽贫自贱，不犯戒律。 是故自然外无残暴，内无疾病也。 百病律 律曰：求灾除难，不如防之易。 治病疗疾，不如修之吉。 若事父母师长以孝道，事君以忠敬，朋友以笃信。 违律者罚算一纪，主吏坐其病到身。 律曰：有君不能保社稷，有臣不能全寿命。 圣人求福於未兆，绝祸於未有，盖灾生於稍稍，病起於细微，小善不积，大福不成。 为恶者虽欲以章脆愿，服符箓以自防救，不肯改更心腹，必为罪不除，亦罚算，五病则入身。 律曰：常思病来之罪所犯过恶，司过神、解过神、司过君、解过君当解除之一切罪过、世间所犯诸恶，则病消除。 喜怒无常是一病，不好耆老是一病，好色无德是一病，舛戾自用是一病，憎之欲死是一病，从贪弊恶是一病，擅变自可是一病，鬼点谀谄是一病，快祸遂非是一病，两舌无信是一病，乘权纵横是一病，骂詈风雨是一病，侮易孤寡是一病，教人堕胎是一病，威势逼勒是一病，孔内窥人是一病，借不念还是一病，背向异端是一病，曲人自直是一病，调戏异同是一病，恶人自喜是一病，探巢破卵是一病，愚人自贤是一病，水火败人是一病，以功自与是一病，教人去妇是一病，以劳自怨是一病，合祸睽爱是一病，喜说人过是一病，唱祸导诽是一病，以贵轻人是一病，见物欲得是一病，以贱耻贵是一病，亡义取利是一病，以德自显是一病，专心系受是一病，以私乱公是一病，败人自举是一病，阴恶自害是一病，轻口喜语是一病，论评诽议是一病，非人自是是一病，瑕人自誓是一病，以力胜人是一病，无施真人是一病，语欲胜人是一病，怒自怨评是一病，货不念赏是一病，蛊道厌人是一病，以嗔伤人是一病，憎人胜己是一病，怒喜自伐是一病，心不平等是一病，以贤自真是一病，不受谏诤是一病，谤有功人是一病，烦符轻疏是一病，以富骄人是一病，好自作正是一病，以贫妬富是一病，蹲踞无礼是一病，谗人求妇是一病，轻易老小是一病，恶能丑对是一病，败人成功是一病，喜禁善人是一病，乐塞人路是一病，恶言不改是一病，好掩戏人是一病，危人自安是一病，激厉谤悖是一病，多憎少爱是一病，推负着人是一病，嗜得怀诈是一病，持人长短是一病，乘酒险横是一病，与人追悔是一病，干务人事是一病，施人望报是一病，恶生好杀是一病，骂詈虫畜是一病，负债盗窃是一病，呰毁高大是一病，喜短唐突是一病，毒药丑饵是一病，故患误人是一病，言语不忠是一病，欲谈人短是一病，追念旧恶是一病，刀胎剖形是一病，内疏外亲是一病，笑盲聋暗是一病，谈愚痴人是一病，教人挝捶是一病，挝捶无理是一病，教人作恶是一病，多疑少信是一病，笑颠狂人是一病，丑言恶语是一病，强夺人物是一病 律曰：人能除此百一病，无灾无患，长生度世，子孙蒙祚矣。 律曰：天下万民，教化罪福，违法令病入身，夺命刑籍，灾死名灭，则其身已。",
      "translated_text": "The Precepts state: When a person suffers from illness, it is due to transgressions and misdeeds, hidden in the unseen, thus manifesting as sickness. These afflictions do not arise from diet, wind, cold, warmth, or qi, but because the individual has violated the law and broken the precepts. Their spirit and soul are constrained and punished, not residing in their physical form. Their pores become lax, their organs depleted, and their essence and qi unguarded, daring to pursue profit. Though they may dwell in honor and fine attire, they dare not commit wrongdoing. They measure their body to make clothing and gauge their stomach to take food. Though rich and noble, they dare not indulge in desire. Though poor and humble, they do not transgress the precepts. Thus, naturally, there is no cruelty without and no illness within.\n\n**The Hundred Precepts on Illness**\nThe Precepts state: Seeking to avert disaster and eliminate hardship is not as easy as preventing them. Treating illness and curing disease is not as auspicious as cultivating oneself. If one serves parents and teachers with filial piety, serves one’s lord with loyalty and reverence, and treats friends with sincerity and trust, those who violate the precepts will be penalized by a twelve-year reduction in their lifespan, and the responsible officials will bear the affliction upon themselves.\n\nThe Precepts state: Those with lords cannot protect their states; those with ministers cannot preserve their lives. The sage seeks blessings before omens appear and severs misfortune before it arises. For disasters grow from the slightest beginnings, and illness arises from the most subtle origins. Small virtues, if not accumulated, will not bring great fortune. Those who do evil, though they may wish to rely on fragile vows, wear talismans, and protect themselves, if they refuse to change their hearts and minds, their sins will not be erased. They will also be penalized by a reduction in lifespan, and the five diseases will enter their bodies.\n\nThe Precepts state: One should constantly reflect on the sins and transgressions that bring illness. The Deities of Transgression, the Deities of Absolution, the Lord of Transgression, and the Lord of Absolution will absolve all sins, all worldly misdeeds one has committed, and thus the illness will be dispelled.\n\nUnregulated joy and anger is one illness.\nDisrespecting the elderly is one illness.\nLust without virtue is one illness.\nPerverse self-will is one illness.\nHatred to the point of wishing death is one illness.\nFollowing greed and corruption is one illness.\nArbitrary self-justification is one illness.\nGhostly flattery and deceit is one illness.\nReveling in misfortune and wrongdoing is one illness.\nDouble-tongued deceit is one illness.\nAbusing power and acting recklessly is one illness.\nCursing wind and rain is one illness.\nDisrespecting the orphaned and widowed is one illness.\nTeaching others to induce miscarriage is one illness.\nCoercion through power and force is one illness.\nPeering into others’ orifices is one illness.\nBorrowing without intending to return is one illness.\nTurning away from the Dao/Way is one illness.\nDistorting others to appear upright is one illness.\nMocking differences is one illness.\nTaking pleasure in evil people is one illness.\nPlundering nests and breaking eggs is one illness.\nFools who consider themselves wise is one illness.\nDestroying others with water or fire is one illness.\nClaiming credit for others’ achievements is one illness.\nEncouraging others to abandon their wives is one illness.\nResenting one’s own toil is one illness.\nUniting misfortune and discord is one illness.\nDelighting in others’ faults is one illness.\nInciting calamity and slander is one illness.\nUsing nobility to belittle others is one illness.\nCoveting what one sees is one illness.\nShaming the noble due to one’s baseness is one illness.\nSeeking profit without righteousness is one illness.\nParading one’s virtue is one illness.\nFixating on personal gain is one illness.\nDisrupting the public with the private is one illness.\nUndermining others to elevate oneself is one illness.\nSecret malice harming oneself is one illness.\nFrivolous speech and idle chatter is one illness.\nEngaging in slander and criticism is one illness.\nRejecting others to assert oneself is one illness.\nExposing others’ flaws to justify oneself is one illness.\nOverpowering others with force is one illness.\nWithholding aid from the worthy is one illness.\nSeeking to outtalk others is one illness.\nResentment and self-blame is one illness.\nFailing to reward kindness is one illness.\nUsing sorcery to harm others is one illness.\nHarming others with anger is one illness.\nResenting those who surpass oneself is one illness.\nBoasting of one’s joy and anger is one illness.\nAn unbalanced heart is one illness.\nClaiming truth through self-righteousness is one illness.\nRefusing admonishment is one illness.\nSlandering the meritorious is one illness.\nTreating talismans lightly is one illness.\nArrogance due to wealth is one illness.\nInsisting on one’s own correctness is one illness.\nEnvying the rich due to poverty is one illness.\nSquatting without propriety is one illness.\nSlandering others to seek a wife is one illness.\nDisrespecting the elderly and young is one illness.\nMocking others’ abilities is one illness.\nSabotaging others’ success is one illness.\nTaking pleasure in restraining the virtuous is one illness.\nDelighting in blocking others’ paths is one illness.\nRefusing to correct evil speech is one illness.\nConcealing and mocking others is one illness.\nEndangering others for self-preservation is one illness.\nInciting rebellion and defiance is one illness.\nExcessive hatred and little love is one illness.\nShifting blame onto others is one illness.\nCraving gain with deceit is one illness.\nExploiting others’ faults is one illness.\nRecklessness under the influence of alcohol is one illness.\nRegretting favors given to others is one illness.\nMeddling in others’ affairs is one illness.\nBestowing favors with expectation of return is one illness.\nTaking pleasure in killing is one illness.\nCursing insects and livestock is one illness.\nStealing and evading debt is one illness.\nDisparaging the great and noble is one illness.\nDelighting in rudeness and offense is one illness.\nPoisoning and tainting food is one illness.\nIntentionally harming others is one illness.\nDisloyal speech is one illness.\nDesiring to gossip about others’ faults is one illness.\nDwelling on past grievances is one illness.\nCutting open wombs and bodies is one illness.\nOutward affection with inward estrangement is one illness.\nMocking the blind, deaf, and mute is one illness.\nMocking the foolish and deluded is one illness.\nTeaching others to strike and beat is one illness.\nStriking without reason is one illness.\nTeaching others to do evil is one illness.\nExcessive suspicion and little trust is one illness.\nMocking the insane is one illness.\nVile speech and foul language is one illness.\nForcibly seizing others’ possessions is one illness.\n\nThe Precepts state: If one can eliminate these one hundred and one illnesses, there will be no disasters or misfortunes. One will attain longevity and transcend the world, and one’s descendants will receive blessings.\n\nThe Precepts state: Among the myriad people under heaven, those who are taught about sin and fortune yet violate the laws will have illness enter their bodies, their lives forfeited in the registers of punishment. Their names will be erased from the records of the living, and their bodies will perish.",
      "overlap_context": "r the wealthy toward the poor is one medicine.\nAvoiding suspicion and distancing oneself from doubt is one medicine.\nEnduring poverty without resentment is one medicine.\nRevering sacred texts is one medicine.\nDelighting in meritorious deeds is one medicine.\nPropagating sacred teachings is one medicine.\nReflecting on gains and losses is one medicine.\nEncouraging others to study the Dao is one medicine.\nAspiring to venerate the Three Treasures is one medicine.\nUsing words for good is one medicine.",
      "start_char": 2758,
      "end_char": 3983,
      "start_sentence": 114,
      "end_sentence": 132,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.130006551742554,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\玄都律文.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "言人犯罪当改心易行，奉承道法，不敢＃１行人鬼加罪，半原。 非违法事，则一切过得度，长生也。 制度律 律曰：制道士、女官、道民、箓生、百姓所奉属师者，父亡子继，兄没弟绍，非嫡不得继。 或儿息小弱，当大人摄治，儿长则立治依旧。 若无人承领，则寻根本上属，不得他人属。 违律罚算一纪。 律曰：道士、女官、箓生、道民，本师亡没之后，子孙不令其堪承袭，或遭乱失，本属师推寻原末，不相知识，皆听上属事师，皆当遵奉法教，此性命之主也。 不敬事师，冒慢神明，治国则乱，治家则亡，殃考延及后世也。 律曰：制，男官、女官、箓生、道民，天租米是天之重宝，命籍之大信，不可轻脱，祸福所因，皆由此也。 七月七日为上功，八月为中功，九月为下功，十月五日输者无功无过，皆输送本治。 违法则命籍不上吏守人，上延七祖，下流后代，家长罚算二百日，户口皆各罚二纪。 律曰：制男官、女官、主者领户治位，皆有科次品号。 若是甲治，受所领民租米百斛，七十斛纳治中用，折三十斛传天师治。 若二百斛，皆当诣本治施设。 若去本治三百里以外，听於家设。 不如法，罚算三纪。 律曰：生男上厨，生女中厨，增口益财，求官保护，延口岁中无他。 上厨之例，求度厄难，远行，求迁官。 厨中之例，求治疾病，消县官口舌牢狱系闭。 下厨之例，故略。 条品法律，科格如此。 违律罚算一纪。 律曰：男官、女官、主者、箓生，年初愿口数，竟岁无十人，设厨二十人。 若三十口已上，设二十四人厨。 若百千万口，不过二十四人厨。 一口设一人厨，至二十四人止也。 违律罚算一纪。 律曰：男官、女官、主者、箓生，条愿品格，十人以下，绢二十尺，二十人已上，绢四十尺，蒙恩则输送。 不如法，则罚算一纪。 律曰：男官、女官、主者，三会之日，所以供厨、使布、散租米，而比者众官令使百姓以供会，此皆不合科典，违律罚算一纪。 律曰：生男儿，设厨食十人，中章纸百张，笔一双，墨一丸，书刀一口。 生女子，厨食五人，席一领，粪箕一枚，扫篇一枚。 月满则输。 不如律法，父母夺算二纪，儿子夺算。 天师治不得长取，亦得奢结，鬼气不去，及还中伤，不得隐匿他用，以营家私，此罪不轻，灭身。 律曰：男官、女官、主者，寻奉道之民，各有根本，而比者众官互受他户，寔由主者之过，不能以科法化喻，辄便领受。 愚民无知，谓可轻尔，致使去就任意，不遵旧典，主者受夺略之罪，民受叛违之愆，师则以状言奏，天曹必至。 违律者各罚算一纪。 律曰：男官、女官、箓生、道民，至於解厨，家主斋戒，宿请客言，刺被请之身，皆严整，勿履秽污，悉沐浴，换易衣裙、帻、褐、袴、褶，不得着裙履露衣，轻冒至真。 所以尔者，此律是天官之威，神仙临降，非小故耶。 皆正心存想，不得乱语说流俗不急之事，悉依法箓大小为次第。 若所受同，以前后为次。 若所受法箓治职同日，当以年长为次。 若受外官，次虽大，悉不得加上内治。 次若不用，别为次第也。 违律罚算一纪。 律曰：男官、女官、主者，上厨，人酒五升，钱三百。 中厨，人酒四升，钱二百五十文。 下厨，人酒三升，钱一百文。",
      "translated_text": "When one commits a transgression, one should reform one’s heart and change one’s conduct, upholding the Dao and its laws, and dare not again act in ways that incur the punishment of gods and spirits—thus half their offenses may be absolved. If one does not violate the laws, all transgressions may be overcome, and one shall attain longevity.\n\n**Statutes and Precepts**\nThe Precepts state: For Daoist priests, female officials, Daoist followers, register initiates, and commoners who pledge allegiance to a master, when the father passes, the son shall succeed; when the elder brother dies, the younger brother shall continue. Only the rightful heir may inherit; no other may do so. If the child is young and weak, an adult shall act as steward until the child comes of age and resumes governance as before. If there is no one to inherit, one must trace back to the original lineage and may not transfer allegiance to another. Violators shall be penalized with a twelve-year reduction in lifespan.\n\nThe Precepts state: After the passing of the original master of Daoist priests, female officials, register initiates, or Daoist followers, if their descendants are unfit to inherit or the lineage is lost due to chaos, the original master’s lineage shall be traced to its source. If no connection is found, they may seek a new master to whom they shall pledge allegiance, adhering to the teachings and laws, for this concerns the master of their very lives. To disrespect or neglect one’s master is to defy the gods; in governing a state, this brings chaos; in managing a household, it leads to ruin. Such misfortune extends to one’s ancestors and descendants.\n\nThe Precepts state: For male and female officials, register initiates, and Daoist followers, the Heavenly Tribute Rice is the most precious treasure of Heaven, the great token of the Registers of Life. It must not be treated lightly, for fortune and misfortune arise from it. The seventh day of the seventh month is the time for superior merit, the eighth month for middling merit, and the ninth month for lesser merit. Those who submit on the fifth day of the tenth month shall neither gain merit nor incur fault; all offerings must be delivered to their respective oratories. Violators shall have their names stricken from the Registers of Life, with no celestial officials to guard them. This penalty extends to seven generations of ancestors and descends to all descendants. The head of the household shall be penalized with a two-hundred-day reduction in lifespan, and each member of the household shall suffer a twenty-four-year reduction.\n\nThe Precepts state: Male and female officials and oratory heads shall oversee households and oratories, each ranked according to grade and title. For a first-rank oratory, the tribute rice from its people shall be one hundred *hu*: seventy *hu* shall be used for the oratory’s needs, and thirty *hu* shall be forwarded to the Celestial Master’s oratory. For two hundred *hu*, all shall be presented at the original oratory. If the distance exceeds three hundred *li*, offerings may be prepared at home. Failure to comply shall incur a thirty-six-year reduction in lifespan.\n\nThe Precepts state: For the birth of a son, an upper offering shall be made; for a daughter, a middle offering. This increases the household’s prosperity, seeks official protection, and ensures the family’s safety for the year. The upper offering is for seeking deliverance from calamity, safe travel, or promotion in office. The middle offering is for healing illness, resolving official disputes, or securing release from imprisonment. The lower offering shall be omitted here. Such are the graded statutes and laws. Violators shall be penalized with a twelve-year reduction in lifespan.\n\nThe Precepts state: Male and female officials, oratory heads, and register initiates shall report the number of their household’s vows at the year’s beginning. If fewer than ten people complete the vows by year’s end, a feast for twenty shall be prepared. For thirty or more, a feast for twenty-four shall be held. Even for households of a hundred, a thousand, or ten thousand, the feast shall not exceed twenty-four people. One person may be feasted per vow, up to a maximum of twenty-four. Violators shall be penalized with a twelve-year reduction in lifespan.\n\nThe Precepts state: Male and female officials, oratory heads, and register initiates shall follow the graded statutes for vows. For fewer than ten people, twenty *chi* of silk shall be offered; for twenty or more, forty *chi*. These shall be submitted upon receiving favor. Failure to comply shall incur a twelve-year reduction in lifespan.\n\nThe Precepts state: On the three assembly days, male and female officials and oratory heads shall provide feasts, distribute cloth, and allocate tribute rice. Recently, however, officials have compelled commoners to supply these assemblies, which contravenes the statutes. Violators shall be penalized with a twelve-year reduction in lifespan.\n\nThe Precepts state: For the birth of a son, a feast for ten shall be held, along with one hundred sheets of fine paper, a pair of brushes, a cake of ink, and a writing knife. For a daughter, a feast for five shall be held, along with a mat, a dustpan, and a broom. These shall be submitted by the end of the month. Failure to comply shall result in the parents losing twenty-four years of lifespan, and the child shall also be penalized. The Celestial Master’s oratory shall not take more than its due, nor may offerings be diverted for private use. Such offenses are grave, leading to the destruction of one’s person.\n\nThe Precepts state: Male and female officials and oratory heads shall ensure that those who follow the Dao retain their original lineage. Recently, however, officials have recklessly accepted households from others, a fault of the oratory heads who fail to instruct according to the statutes and hastily take charge. The ignorant commoners, believing it permissible, act as they please, disregarding the old traditions. The oratory heads shall bear the penalty of usurpation, while the people shall suffer the guilt of rebellion. The master shall report the matter, and the Heavenly Bureau shall surely intervene. Violators shall each be penalized with a twelve-year reduction in lifespan.\n\nThe Precepts state: When male and female officials, register initiates, and Daoist followers prepare offerings, the head of the household shall fast and invite guests the night before, examining the status of those invited. All shall be solemn and orderly, avoiding impurity. They shall bathe, change into clean robes, headscarves, coarse garments, trousers, and unlined jackets, and may not wear skirts or expose their clothing, lest they show disrespect to the Perfected. This is because these precepts carry the authority of the Heavenly Officials, and immortals descend to witness them—is this a trifling matter? All shall compose their minds and focus their thoughts, refraining from idle chatter or mundane matters. They shall follow the order of their registers and methods. If their ranks are equal, precedence shall be given to those initiated earlier. If they received their registers and oratory positions on the same day, the elder shall take precedence. Even if one holds an external office of higher rank, it shall not supersede an internal oratory position. If precedence is not observed, a separate order shall be established. Violators shall be penalized with a twelve-year reduction in lifespan.\n\nThe Precepts state: For male and female officials and oratory heads, the upper offering shall include five *sheng* of wine and three hundred coins per person. The middle offering shall include four *sheng* of wine and two hundred fifty coins per person. The lower offering shall include three *sheng* of wine and one hundred coins per person.",
      "overlap_context": "f one can eliminate these one hundred and one illnesses, there will be no disasters or misfortunes. One will attain longevity and transcend the world, and one’s descendants will receive blessings.\n\nThe Precepts state: Among the myriad people under heaven, those who are taught about sin and fortune yet violate the laws will have illness enter their bodies, their lives forfeited in the registers of punishment. Their names will be erased from the records of the living, and their bodies will perish.",
      "start_char": 3983,
      "end_char": 5230,
      "start_sentence": 133,
      "end_sentence": 182,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.52576422691345,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\玄都律文.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "某甲治受领民租百斛，折八十斛入甲乙治，以二十斛传天师治。 又某甲治受所领民租米百斛，折八十斛入丙丁治，以二十斛传天师治。 及公誓物，一如上治计丈尺，以传天下万民。 米一斛，具使令二斗达天师治。 其米不至，天师主者受割截之罪。 唯纸笔墨给治用，不烦传上。 明各依承，违律罚算三纪。 律曰：男官、女官、主者、百姓，有疾病厄，急归告之者，当匍匐救之，不得以私事托设，妄说祸祟，求人意气，受取皆计减为罪。 违律罚算一纪。 律曰：男官、女官、主者、道民，年初保家口，或病痛百事，至心立愿，皆质其辞誓，主者依承状申述，蒙恩限满则输，即为言功报劳。 不得违言负约，此罪不轻。 若不蒙恩福便为言除，不可横受。 其岁中虽有死亡减口，租不例，依常输上。 宜各尊奉。 违律者，罚算一纪。",
      "translated_text": "Governor A shall collect one hundred *hu* of civilian grain tax, of which eighty *hu* shall be delivered to the administration of B and C, and twenty *hu* transmitted to the Celestial Master’s administration. Governor A shall also collect one hundred *hu* of civilian grain tax in rice, of which eighty *hu* shall be delivered to the administration of D and E, and twenty *hu* transmitted to the Celestial Master’s administration. For all public oath offerings, the measurements shall be calculated as above and transmitted to the myriad people under heaven. For every *hu* of rice, two *dou* shall be allocated for messengers to deliver to the Celestial Master’s administration. If the rice fails to arrive, the Celestial Master’s administrators shall bear the penalty of reduction. Only paper, brushes, and ink shall be supplied for administrative use and need not be transmitted upward. Each shall strictly adhere to their duties; violators shall be penalized with a thirty-six-year reduction in lifespan.\n\nThe Precepts state: Should male officials, female officials, administrators, or commoners fall ill or encounter misfortune, those who urgently report it must be attended to with utmost haste; none shall use such occasions to advance private matters, fabricate calamities or malevolent influences, curry favor, or accept bribes—all such acts shall be calculated as offenses warranting reduction. Violators shall be penalized with a twelve-year reduction in lifespan.\n\nThe Precepts state: At the beginning of the year, male officials, female officials, administrators, and Daoist households shall register their dependents, including any illnesses or hardships, and make sincere vows, all of which shall be recorded in sworn statements. Administrators shall submit these reports as received, and upon the expiration of the grace period, the offerings shall be rendered, after which merits and labors shall be reported. None shall renege on their vows or breach their agreements, for such offenses are not minor. If no blessings are received, the vows shall be annulled, and no unwarranted claims shall be made. Even if deaths or reductions in household numbers occur during the year, the tax shall not be adjusted and shall be remitted as usual. All shall reverently comply. Violators shall be penalized with a twelve-year reduction in lifespan.",
      "overlap_context": "atory position. If precedence is not observed, a separate order shall be established. Violators shall be penalized with a twelve-year reduction in lifespan.\n\nThe Precepts state: For male and female officials and oratory heads, the upper offering shall include five *sheng* of wine and three hundred coins per person. The middle offering shall include four *sheng* of wine and two hundred fifty coins per person. The lower offering shall include three *sheng* of wine and one hundred coins per person.",
      "start_char": 5230,
      "end_char": 5556,
      "start_sentence": 183,
      "end_sentence": 197,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.393488883972168,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\玄都律文.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "律曰：男官、女官、主者，当详择救民，不得苟且尘秽。 清虚化民，皆检其墨辞，质却情状，令家内大小和同，然后宣化，依科救之。 违律者，夺算二年。 律曰：道士、女官、主者，诛罚邪伪，清宁四海，受民以礼，养育群生，三会吉日，质对天官，教化愚俗，布散功德，使人鬼相应。 而比者众官烹杀畜生，以供厨会，不合冥法。 杀生求生，去生远矣。 犯者殃及后世，主者罚算一纪。 律曰：男官、女官、主者、箓生，安靖於天德者，甲乙丙丁地，治有品第。 民家靖广八尺，长一丈。 中治广一丈二尺，长一丈四尺。 大治广一丈六尺，长一丈八尺。 面户向东，炉按中央。 违治则罚算一纪，按如盟威律论法也。 律曰：男官、女官、主者，受法箓治职之号，譬如王位，至於选补，皆由天台。 而顷者众官辄便私相拜署，或所受治小而加人大治，或以身所佩法以授人，此皆不合冥典。 若堪任者，当表言上。 违律者，各罚算二纪。 律曰：男官、女官、主者，制阳平治得署四正游治，鹿堂治、鹤呜治得署三正游治，自此以下，一归天师治。 凡受法，当随功轻重，依品受任，不得苟且，互求大治。 违律者，罚算二纪。 律曰：道士、女官、主者、箓生，朔望皆朝拜，鸡呜皆起，严敬整容，冠带朝拜，衣帻椅褶，入治依位号执笏朝拜，讫，便简阅如旧法。 出朝於师，皆五拜，问讯起居安否而退。 其戊辰、戊戌不朝，违律罚算一纪。 律曰：男官、女官、主者、箓生，己午忘失朝，退位一等，夺算三年。 不朝，退位三等，夺算七年。 不朝於师，皆有考坐，谓故不朝，轻罔天地也。 律曰：男官、女官、箓生、道民，家有秽污，不过晦朔，不得入治。 哭亦三日。 秽＃２三年之丧未满，百日不得入治拜礼、奏表章书。 违律者，考坐，罚算一纪。 律曰：奉道之民，誓心至死归道，不得两心犹豫，违背道德，悔道还俗。 此罪不轻，祸至灭门。 亦不得淫祀邪鬼。 若有犯者，牒状归首太治，专心悔过，得免殃咎。 而知者故违，罚等一纪。 律日：道士、女官、主者，受道之日，内以修身，外以禳灾，不得妄同，中伤百姓，及渔猎万端，或更相评论，拓忌胜己。 此是聋盲所行，非道法真正之体。 犯者罪考八十，主者科之。 如谓状罚之人也。 赎玉四两准罪。 律曰：道士、女官、箓生，身年十八已上，得受大法。 若外法，自受百五十将军箓已上，堪着黄色法服、衣冠。 内法，自然升玄真文已上，上清大洞已下，须用紫色法服、衣褐，笏履袴褶，其笏但十戒已上，则执之。 若朝朝礼谒集及章表，而须法具衣冠帻褐笏履。 违律罚玉八两，考及三世，自身水火官事所考，如玉法。 言三皇以前，人民淳朴，礼制盖微，谓之板，二头俱平。 自人皇以后，谓之为笏者，言之似天地方员，众官所执，常存天地，与道同体，敬之如法也。 律曰：道士、女官、祭酒、箓生，身任法诚，若死，要在靖宇观治，不得在俗人舍宅。 言死时丧礼，送葬不合在俗也。 其魂神所居秽地，天地水三官不许尸被考掠，作河三年徒役。 律曰：阳平、鹿堂、鹤呜诸治，男官、女官、主者、箓生等，教写科制如右。 窃寻比顷以来众官百姓道民，或有无师而自立法； 或去本治辽远，布於四野，私相号授，领民化户，威福自由；",
      "translated_text": "The Statutes state: Male officials, female officials, and administrators shall carefully select means to deliver the people and must not act perfunctorily or defile themselves with worldly filth. In transforming the people through purity and emptiness, all shall examine their written pledges, verify their circumstances, and ensure harmony among all household members, great and small, before disseminating the teachings and delivering them in accordance with the regulations. Violators shall be penalized with a two-year reduction in lifespan.\n\nThe Statutes state: Daoists, female officials, and administrators shall punish deceit and falsehood, pacify the Four Seas, receive the people with propriety, and nurture all living beings. On the three auspicious assembly days, they shall present themselves before the Heavenly Officials, instruct the ignorant masses, and disseminate merit and virtue, ensuring harmony between humans and spirits. Yet of late, many officials have slaughtered livestock to supply their kitchens and feasts, which contravenes the hidden laws. Seeking life through killing distances one from life itself. Offenders shall bring calamity upon future generations, and administrators shall be penalized with a twelve-year reduction in lifespan.\n\nThe Statutes state: Male officials, female officials, administrators, and register disciples who pacify through the virtue of Heaven shall establish altars on *jia-yi-bing-ding* lands, graded by rank. A household altar shall measure eight *chi* in width and one *zhang* in length. A medium altar shall measure one *zhang* two *chi* in width and one *zhang* four *chi* in length. A large altar shall measure one *zhang* six *chi* in width and one *zhang* eight *chi* in length. Its entrance shall face east, and the furnace shall be positioned at its center. Violations of these altar regulations shall be penalized with a twelve-year reduction in lifespan, adjudicated in accordance with the *Mengwei* statutes.\n\nThe Statutes state: Male officials, female officials, and administrators who receive titles of register and office are akin to royal appointments, and all selections and appointments shall proceed from the Heavenly Terrace. Yet of late, many officials have presumptuously conferred ranks upon one another in private, bestowing greater registers upon those who received lesser ones or transmitting the methods they themselves bear. Such acts contravene the hidden canons. Those deemed capable shall submit petitions for approval. Violators shall each be penalized with a twenty-four-year reduction in lifespan.\n\nThe Statutes state: Male officials, female officials, and administrators of the Yangping, Lutang, and Heming altars may appoint four *zheng* and itinerant altars. Those of the Lutang and Heming altars may appoint three *zheng* and itinerant altars. All others shall be subordinate to the Celestial Master’s altar. In receiving methods, one shall assume duties according to the weight of their merit and rank, without acting carelessly or seeking greater altars indiscriminately. Violators shall be penalized with a twenty-four-year reduction in lifespan.\n\nThe Statutes state: Daoists, female officials, administrators, and register disciples shall perform morning and evening audiences on the first and fifteenth days of each lunar month. They shall rise at cock’s crow, compose their countenances with reverence, don their caps and sashes, and, clad in robes, headbands, and seated mats, enter the altar in accordance with their ranks, hold their *hu* tablets, and perform the audience rites. Upon completion, they shall review the registers as per the old statutes. When departing to pay respects to their masters, they shall bow five times, inquire after their well-being, and then withdraw. On *wu-chen* and *wu-xu* days, no audience shall be held. Violators shall be penalized with a twelve-year reduction in lifespan.\n\nThe Statutes state: Male officials, female officials, administrators, and register disciples who forget or neglect the audience on *ji-wu* days shall be demoted one rank and penalized with a three-year reduction in lifespan. Those who fail to attend shall be demoted three ranks and penalized with a seven-year reduction. Failure to attend the audience with one’s master shall incur examination and punishment, for willful absence is a grave offense against Heaven and Earth.\n\nThe Statutes state: Male officials, female officials, register disciples, and Daoist households with defilements in their homes shall not enter the altar beyond the last day of the lunar month. Those in mourning shall refrain for three days. Those in three-year mourning that has not yet concluded shall not enter the altar, perform rites, or submit memorials or documents for one hundred days. Violators shall be examined and penalized with a twelve-year reduction in lifespan.\n\nThe Statutes state: Those who pledge themselves to the Dao shall vow to follow it until death, without wavering or hesitation, betraying the Dao and its virtue, or renouncing the Dao to return to secular life. Such offenses are not minor, and calamity shall befall their entire households. They shall also refrain from licentious sacrifices to evil spirits. Offenders shall submit written confessions to the Grand Altar, sincerely repent, and thereby avoid misfortune. Those who knowingly violate these precepts shall be penalized with a twelve-year reduction in lifespan.\n\nThe Statutes state: Daoists, female officials, and administrators, from the day they receive the Dao, shall cultivate themselves inwardly and ward off disasters outwardly. They shall not act recklessly, harm the common people, engage in hunting or fishing, or compete with one another, suppressing those more accomplished than themselves. Such conduct befits the deaf and blind, not the true essence of the Dao and its methods. Offenders shall be punished with eighty lashes, and administrators shall impose the penalty. To redeem such offenses, four *liang* of jade shall be offered as restitution.\n\nThe Statutes state: Daoists, female officials, and register disciples who have reached the age of eighteen may receive the Great Method. For external methods, from the Register of the One Hundred Fifty Generals upward, they may don yellow ritual robes and caps. For internal methods, from the *Zixuan Zhenwen* upward and below the *Shangqing Dadong*, they shall wear purple ritual robes, brown garments, *hu* tablets, shoes, trousers, and seated mats. The *hu* tablet shall be held by those who have received the Ten Precepts and above. For morning audiences, rituals, assemblies, and memorials, they shall be fully attired in ritual garments, caps, brown robes, *hu* tablets, and shoes. Violators shall forfeit eight *liang* of jade, and the penalty shall extend to three generations, including themselves, as adjudicated by the Water and Fire Officials in accordance with the jade statutes. Before the Three Sovereigns, the people were simple and unadorned, and rituals were rudimentary, hence the *ban* tablet, flat at both ends. After the Human Sovereign, it was called the *hu* tablet, symbolizing Heaven’s roundness and Earth’s squareness. All officials hold it, ever mindful of Heaven and Earth, embodying the Dao, and revering it as the law prescribes.\n\nThe Statutes state: Daoists, female officials, libationers, and register disciples who hold office in the methods and vows, upon death, must lie in state within the oratory or altar and shall not be kept in secular residences. This means that funeral rites and burials shall not take place among the laity. If their souls reside in defiled ground, the Three Officials of Heaven, Earth, and Water shall not permit their corpses to be examined or tormented, and they shall be sentenced to three years of labor in the Yellow River.\n\nThe Statutes state: The Yangping, Lutang, Heming, and other altars, along with their male officials, female officials, administrators, and register disciples, shall teach and transcribe the regulations as set forth above. Yet of late, many officials, commoners, and Daoist households—some without masters, establishing their own methods; others far removed from their original altars, scattered across the countryside—have privately conferred titles, led households, and wielded authority at will...",
      "overlap_context": "rings shall be rendered, after which merits and labors shall be reported. None shall renege on their vows or breach their agreements, for such offenses are not minor. If no blessings are received, the vows shall be annulled, and no unwarranted claims shall be made. Even if deaths or reductions in household numbers occur during the year, the tax shall not be adjusted and shall be remitted as usual. All shall reverently comply. Violators shall be penalized with a twelve-year reduction in lifespan.",
      "start_char": 5557,
      "end_char": 6819,
      "start_sentence": 198,
      "end_sentence": 250,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.21307921409607,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\玄都律文.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "或有去治不远而致隔绝，至於租民脆物，通废积年，私自没入己，不传奏上，自作一法，无所禀承，背违冥科，前后非一，其事万端。 致使正法不明，真伪无别，气候错乱，妖恶滋生，罹灾被考，岂不痛哉。 斯皆主者之迭，不能赞扬圣化，令愚人惶怖，谓轻惑有心，而不见科律仪令事件，别各标所用。 咸使闻知，宣扬布化，赏善罚恶，相与揭厉，精加检察，使功勤必获其德。 犯违之者，地官牒名连引上，依法检治，若不纠问，主者与同罪。 明须告示，各遵承一如玄都科令律也。 章表律 律曰：轗轲衰耗，数得飞祸，绝无子孙，疾病痿厄，所求不谐，牢狱闭系，血气虚赢，贫贱困极，残年夭死，痴狂聋僻，或出妖臣逆子，破家癫厉，刑人市死，荡失骸骨，水火刀兵，寇贼所害，田蚕耗漏，衣食不充，仕官不达，皆由罪恶。 司过司考，师家治中，将吏所害，考罪先世，殃咎所逮也。 皆参词条，某州县乡里，年纪，男女，大小户口，居止，所属师主，实效审古旨列事状，诣天师下治官祭酒、精进主领民户者，奏词皆依春秋冬夏，顿首俯仰，自传颊满数则止。 谓奏词请章，贡上天曹，解过除罪，禳灾降福。 律曰：於洛阳靖，天师随神仙西迁蜀郡赤城，人浊不清，世浑不平，於是攀天柱，据天门，新出正一盟威之道，欲更清明天人，诛罪不义，养育群生。 立二十四治，署男职女职二十四职，乘玄元之施，开化后代，皆悔过，及得列为真人。 一月听三贡上章表，自改悔罪过，断绝复连，消除灾害、疾病。 危急，一月听三上章也。 律曰：入治上章，皆自严装衣冠，正法服，平坐，存五方生气及身中功曹吏兵，按分位，恭如相临对倚，侍左右前后也。 谓入治奏章之时，绝念定意，悉忆想神明也。 律曰：入治上章，避戊辰、戊戌不上章。 秽污法，不过晦朔，亦不得上章。 天下百姓不得触秽诣治见师主者。 违律罚算减年，返获其罪也。 依律皆为司过司考所劾其罪。 律曰：入治上章，皆正身趋步，科次左右肃恭致，不得男女杂错，望视谬语，前却迟速。 主者职吏降一阶，不降，罚玉三两，又罚算二纪。 律曰：道士不得妄为恶逆男女上章。 轻慢淫盗取，凶逆无道，不孝父母师主，不义君长姑姨，不敬奉道德，轻慢鬼神，贼害冒奸，毁辱贤善，谗诽谤，背父母，叛师主，不顺不善，皆为恶逆男女也。 此皆不得为上章。 不满一年，被夺寿五年，死付河伯谪作，又罚玉八两，退位二等也。 律曰：章词质而不文，拙而不巧，朴而不华，实而不伪，直而不曲，辩而不烦，弱而不秽，清而不浊，直而节，简要而输诚，则感於天地，动於鬼神，御上天曹，报应立至也。 违律司非执法，治官吏坐。 律曰：章消疾病，向鬼门。 消灾，向地户。 求长生，向天门。 求富贵财利，向地户。 消口舌咒诅，向人门。 厌虎，向寅。 厌蛇，向巳。 与天罡并力大吉也。 律曰：上章求财富贵，用天仓日戊子是。 求爵位，用天府日上，不用自刑日。 午酉亥辰，皆自刑。 寅刑巳，戌刑未，子刑卯，申刑寅，卯刑子，巳刑申。 违律被罚考，病五十日也。 律曰：请求章奏，解先亡冥考殃罪，及身中所犯坐疾病灾祸吉凶，由本治。 若去师辽远，听诣同法。",
      "translated_text": "Some, though not far removed from their altars, have become isolated and cut off, leading to the seizure of commoners’ property and fragile goods, which have lain abandoned for years. These they privately appropriate for themselves, failing to report or submit them, creating their own laws without proper transmission or authority. They violate the unseen statutes in countless ways, their transgressions manifold.\n\nAs a result, the true Dao is obscured, truth and falsehood indistinguishable. The rhythms of qi are disrupted, and malevolent forces proliferate. Those who suffer calamities and endure punishments—how grievous it is! All this stems from the repeated failures of those in charge, who have not promoted the sagely transformation, leaving the ignorant in fear and confusion. They assume such transgressions are trivial, unaware of the statutes, ordinances, and regulations, each with its distinct purpose. All must be made known, proclaimed, and disseminated. Reward the virtuous and punish the wicked, spurring one another to vigilance. Examine matters with precision, ensuring that diligence is met with its due virtue. Those who violate these precepts shall be recorded by the Earth Official, their names linked and reported upward for investigation and punishment according to the law. If the responsible officials fail to expose such offenses, they shall share the same guilt.\n\nProclamations must be issued, and all shall comply with the statutes and ordinances of the Mystic Capital as follows.\n\n---\n\n**Statutes on Memorials and Petitions**\n\nThe Statutes state: Those who suffer misfortune—declining fortunes, repeated disasters, the loss of descendants, illness and debility, unfulfilled desires, imprisonment, depletion of qi and blood, extreme poverty and hardship, premature death, madness, deafness, or muteness—those who give rise to treacherous ministers or rebellious children, whose families are ruined by madness or possession, who are executed in the marketplace, whose remains are lost, who perish by water, fire, blade, or banditry, whose fields and silkworms fail, whose clothing and food are insufficient, whose official careers stall—all these stem from their sins. The Offices of Fault and Judgment, the masters of their households, and the officials within their altars have harmed them, examining the transgressions of their past lives, bringing down the consequences of their misdeeds.\n\nAll such cases must be documented with details: the prefecture, county, village, age, gender, household size, residence, and the name of their master. The facts must be verified, the ancient principles followed, and the circumstances clearly stated. These memorials shall be presented to the Libationers of the altars under the Celestial Master, to the Devout Masters who oversee the households. Petitions shall be submitted in accordance with the seasons—spring, autumn, winter, and summer—with bows and reverent gestures, continuing until the cheeks are flushed with sincerity.\n\nSuch memorials and petitions are offered to the heavenly courts to absolve sins, dispel calamities, and invoke blessings.\n\nThe Statutes state: In Luoyang’s Pure Abode, the Celestial Master, following the immortals, migrated west to the Red City of Shu. The world was turbid and impure, the age chaotic and unjust. Thus, he grasped the Pillar of Heaven, stood at the Gate of Heaven, and revealed the new Dao of Orthodox Unity and Alliance of Powers, seeking to purify the relationship between heaven and humanity, punish the guilty and unjust, and nurture all living beings. He established the Twenty-Four Altars, appointing twenty-four male and female officials, and through the grace of the Primordial Mystery, enlightened future generations. All who repented their transgressions were granted the rank of Perfected.\n\nEach month, three memorials may be submitted to repent of sins, sever karmic ties, and eliminate disasters and illnesses. In times of dire urgency, three memorials may be submitted in a single month.\n\nThe Statutes state: When entering an altar to submit a memorial, one must attire oneself in proper robes and cap, sit upright, and visualize the generative qi of the Five Directions and the functionaries and soldiers within one’s own body, aligning them according to their positions. One must act as though the deities are present, standing to the left and right, before and behind.\n\nThis means that when entering an altar to submit a memorial, one must clear the mind and focus the intent, fully invoking the presence of the divine.\n\nThe Statutes state: When entering an altar to submit a memorial, avoid the days of *wu-chen* and *wu-xu*. Do not submit memorials during periods of defilement, nor on the last or first day of the lunar month. The people of the world must not approach altars or meet their masters while in a state of defilement. Violations shall be punished by the deduction of years from one’s lifespan, and the transgressor shall incur the very sins they sought to avoid. All such offenses shall be prosecuted by the Offices of Fault and Judgment.\n\nThe Statutes state: When entering an altar to submit a memorial, one must proceed with dignity, following the proper order to the left and right with solemn reverence. Men and women must not intermingle, nor may one gaze about, speak irreverently, or move too hastily or slowly. If the responsible officials or functionaries fail to enforce this, they shall be demoted one rank. If they do not demote themselves, they shall be fined three *liang* of jade and penalized by the deduction of twenty-four years from their lifespan.\n\nThe Statutes state: Daoists must not recklessly submit memorials on behalf of men or women guilty of evil and rebellion. Such offenses include licentiousness, theft, violence, treachery, disobedience to parents or masters, disloyalty to rulers or elders, disrespect for the Dao and its power, irreverence toward spirits, harming others, deceit, slander, betraying parents, rebelling against masters, and all manner of unfilial or unvirtuous conduct. None guilty of such acts may submit memorials.\n\nIf they do so within a year, five years shall be deducted from their lifespan, and upon death, they shall be handed over to the River Earl for penal servitude. They shall also be fined eight *liang* of jade and demoted two ranks.\n\nThe Statutes state: Memorials must be plain and unadorned, unskilled yet not cunning, simple yet not ornate, truthful yet not false, direct yet not convoluted, clear yet not verbose, modest yet not vulgar, pure yet not turbid, forthright yet measured, concise yet sincere. Such memorials move heaven and earth, stir the spirits, ascend to the heavenly courts, and receive swift response. Violations shall be prosecuted by the Offices of Fault and Judgment, and the responsible officials shall be held accountable.\n\nThe Statutes state: To alleviate illness, face the Ghost Gate. To dispel disaster, face the Earth Portal. To seek longevity, face the Heavenly Gate. To attain wealth and honor, face the Earth Portal. To counter slander and curses, face the Human Gate. To suppress tigers, face *yin*. To suppress snakes, face *si*. Aligning with the Celestial Stem brings great fortune.\n\nThe Statutes state: To seek wealth and honor, submit memorials on the day of *wu-zi*, the Day of the Heavenly Granary. To seek official rank, submit on the Day of the Heavenly Treasury, avoiding days of self-punishment. The days of *wu*, *you*, *hai*, and *chen* are days of self-punishment. *Yin* punishes *si*, *xu* punishes *wei*, *zi* punishes *mao*, *shen* punishes *yin*, *mao* punishes *zi*, and *si* punishes *shen*. Violations shall result in punishment by flogging and fifty days of illness.\n\nThe Statutes state: Memorials and petitions to absolve the sins and sufferings of deceased ancestors, as well as to address one’s own illnesses, disasters, fortunes, and misfortunes, shall be submitted through one’s original altar. If one’s master is too distant, one may approach another of the same tradition.",
      "overlap_context": "\nThe Statutes state: The Yangping, Lutang, Heming, and other altars, along with their male officials, female officials, administrators, and register disciples, shall teach and transcribe the regulations as set forth above. Yet of late, many officials, commoners, and Daoist households—some without masters, establishing their own methods; others far removed from their original altars, scattered across the countryside—have privately conferred titles, led households, and wielded authority at will...",
      "start_char": 6819,
      "end_char": 8054,
      "start_sentence": 251,
      "end_sentence": 295,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.500598430633545,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\玄都律文.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "自非宗祖师，又非甲祭酒领户治官之者，上章不达天曹，甲乙丙丁以下，皆为奏上对。 夫领户三百以上，为治疾官，三户以上，为职署，皆为主者也。 律曰：修福延年，消灾害，治厌百病，皆东向上章。 解墓除责，开心聪明，过灾厄，皆向西上章也。 律曰：灾难厄急，从死中求生，消恶伏邪，皆北向上章也。 律曰：修身养性，温润富贵万愿，皆南向上章。 律曰：上章皆质立信，以验心志。 与吏兵要誓，不得违律也。 律曰：天为除之应死者，天为减罪。 如此者，众身有益，勿效他人。 后世子孙，皆老人福是为耳。 诸职治道士女官，及散民新民，皆不得与狼戾祭祀家饮食。 狼戾之家更相请呼，饮酒食肉，男女合会，小大语笑，从心快意，吾之所禁。 勿为口腹所误，令人故气来往不绝，以致灾祸。 宜当节度身中吏兵，皆受不清之名，豫为作备。 若见中伤，勿得咎怨也。 律曰：诸职道士女官，皆不得使民数行问解净污，多有忌讳，绿真作伪，私行意气狐疑，为意不正，终不得道恩。 邪伪自至，徒自苦耳。 久於身无益，科律所禁，可得怨天也。 律曰：道士女官，皆不得使民私祠祀鬼神，杀猪羊，妖言惑语。 此伪事，皆道之所禁。 若有此色，皆须断除。 违律者犯箓上禁，罚算一纪也。 玄都律文竟 ＃１［敢］字当为［改］字之误 ＃２［秽］字疑衍",
      "translated_text": "Should one who is neither a lineage ancestor-master nor a *jia*-rank Libationer overseeing households and governing altars submit a memorial, it shall not reach the Celestial Bureaus. From *jia*, *yi*, *bing*, *ding* and below, all are considered as submitting in response. Those who oversee three hundred households or more serve as Healing Officers; those who oversee three households or more serve as Office Stewards—all are considered as principals.\n\nThe Statutes state: To cultivate blessings and prolong life, to dispel disasters and harm, and to treat the hundred illnesses caused by malevolent influences, submit memorials facing east. To absolve ancestral tombs of debts, to open the heart and sharpen the mind, and to pass through calamities and crises, submit memorials facing west.\n\nThe Statutes state: In times of dire calamity and mortal peril, to seek life from the midst of death, to subdue evil and suppress demonic forces, submit memorials facing north.\n\nThe Statutes state: To cultivate the body and nurture the nature, to attain warmth, prosperity, and the fulfillment of ten thousand wishes, submit memorials facing south.\n\nThe Statutes state: All memorials shall be presented with sincerity, standing upright in trustworthiness, to verify the resolve of the heart. They shall be pledged with the officers and soldiers of the Dao, and the statutes must not be violated.\n\nThe Statutes state: When Heaven removes one destined for death, Heaven reduces the sentence. In such cases, it benefits the many—do not imitate others. For later generations and descendants, this is the blessing of the aged.\n\nAll ordained Daoist officials, female officers, and both common and newly initiated lay followers shall not share food or drink with households engaged in reckless and defiled sacrifices. Those of such households invite one another, drinking wine and eating meat, men and women gathering together, young and old speaking and laughing as they please—this is what I forbid. Do not be misled by the desires of the mouth and stomach, causing the ceaseless coming and going of demonic qi, thereby inviting disaster. One ought to regulate the officers and soldiers within the body, for all shall bear the name of impurity and prepare in advance. If afflicted by harm, do not complain or resent.\n\nThe Statutes state: All ordained Daoist officials and female officers shall not frequently send lay followers to perform purifications or exorcisms, for these are rife with taboos, fostering deceit and falsehood, acting on private whims and suspicions, and harboring impure intentions—ultimately, they shall not receive the grace of the Dao. Deceit and falsity will bring their own suffering, and prolonged indulgence shall yield no benefit to the body. This is forbidden by the statutes and may incur resentment toward Heaven.\n\nThe Statutes state: Daoist officials and female officers shall not permit lay followers to privately worship spirits or ghosts, to slaughter pigs and sheep, or to spread heretical and bewildering speech. Such false practices are all forbidden by the Dao. If any such conduct appears, it must be severed entirely. Violations of these statutes breach the prohibitions of the Registers and shall incur a penalty of one *ji*.\n\nThe Statutes of the Mystery Capital conclude.",
      "overlap_context": "xu* punishes *wei*, *zi* punishes *mao*, *shen* punishes *yin*, *mao* punishes *zi*, and *si* punishes *shen*. Violations shall result in punishment by flogging and fifty days of illness.\n\nThe Statutes state: Memorials and petitions to absolve the sins and sufferings of deceased ancestors, as well as to address one’s own illnesses, disasters, fortunes, and misfortunes, shall be submitted through one’s original altar. If one’s master is too distant, one may approach another of the same tradition.",
      "start_char": 8054,
      "end_char": 8592,
      "start_sentence": 296,
      "end_sentence": 321,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.921324729919434,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\戒律类\\玄都律文.txt",
        "category": "戒律类"
      }
    }
  ]
}