{
  "source_id": "玄风庆会录",
  "source_file": "chunked_daozang\\玄风庆会录.json",
  "total_chunks": 3,
  "total_original_chars": 3729,
  "total_translated_chars": 22718,
  "total_translation_time": 111.89251041412354,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\谱箓类\\玄风庆会录.txt",
    "category": "谱箓类"
  },
  "full_translation": "**Record of the Auspicious Gathering of the Mysterious Wind**\n\n**Title:** *Record of the Auspicious Gathering of the Mysterious Wind*. One scroll. Compiled by Yuan dynasty scholar Yilie Chucai (also known as Yelü Chucai).\n\n**Source:** *Zhengtong Daoist Canon*, *Dongzhen* Section, Registers and Records Category.\n\n---\n\n### **Preface to the *Record of the Auspicious Gathering of the Mysterious Wind***\n\nIn former times, the National Preceptor, Perfected One of Eternal Spring, received the imperial summons and, though reluctant, arose in response. He then departed the Central Lands, crossed the Flowing Sands, expounded the Dao and virtue to enlighten the ruler, and halted warfare to succor all beings. Having accomplished his work, he withdrew from the world and ascended to heaven.\n\nSince the Supreme Lord of the Mysterious Origin journeyed west, a thousand years have passed in solitude, and only the Perfected One alone has achieved such a feat. The details of his journey are recorded in *The Record of the Western Journey*, yet I alone received his transmission of the profound and arcane teachings of the Dao. The emperor commanded his attendants to record and keep them secret. After the lapse of years, these teachings were transmitted beyond the court and are now to be published for the world, that all may know of this wondrous gathering of the mysterious wind.\n\nWritten on the Winter Solstice of the *renchen* year.\n\n---\n\n### **Record of the Auspicious Gathering of the Mysterious Wind**\n\nCompiled by Imperial Attendant, Illustrious Martial General, and Vice Minister of the Ministry of Rites, Yilie Chucai, by imperial decree.\n\nBy sacred imperial decree, the emperor summoned the eminent Daoist, Perfected One of Eternal Spring. In the year *jimao*, on the second day of the first month of the new era, the emperor issued an edict, and the official Liu Zhonglu, bearing the imperial mandate, sought him out. The search led to Donglai, where, by fortunate coincidence, the Perfected One was found and respectfully welcomed in accordance with the emperor’s will. He did not refuse, though the journey was long.\n\nIn the winter of the *renwu* year, on the night of the full moon of the tenth month, the emperor was hunting on the southern slopes of the Snow Mountains in the Western Regions. That evening, at the imperial encampment, torches were lit in the courtyard, and the emperor, setting aside his throne, invited the Perfected One of Eternal Spring to inquire about the Way of long life. The Perfected One said:\n\n“The Dao gives birth to heaven and nurtures earth; the sun, moon, stars, ghosts, spirits, and all beings arise from the Dao. People know only that heaven is vast, yet they do not know the vastness of the Dao.\n\nAll my life, I have abandoned my family and left the household to study only this. The Dao gives birth to heaven and earth, and through their unfolding, humanity comes into being. At the beginning of human life, the spirit’s radiance illuminates all, and one’s steps are as swift as flight. The earth produces mushrooms, which have their own savor, requiring no cooking, and people ate them. At that time, fire was not yet used for food, and all mushrooms were fragrant. The nose savored their scent, the mouth craved their taste, and gradually, the body grew heavy, the spirit’s light faded, and this was due to the depth of love and desire.\n\nThose who study the Dao, for this reason, do not love what the world loves, nor dwell where the world dwells. They abandon sensory pleasures to find joy in clarity and stillness, and forsake rich flavors to delight in simplicity and tranquility. Any attachment obscures the understanding of the Dao and virtue.\n\nThe eye sees form, the ear hears sound, the mouth craves taste, and the nature follows emotion—thus scattering one’s *qi*. It is like a ball of *qi*: when full, it is strong; when scattered, it is not. *Qi* is the master of the human being. Pursuing things and stirring thoughts scatters the primordial *qi*, just as the *qi* of a ball disperses.\n\nHeaven produces two kinds of beings: the moving and the stationary. Grasses and trees belong to the stationary; though they lack consciousness, they flourish with the dew’s moisture. Humans and animals belong to the moving; though they have emotions, without clothing or food, how can they survive the year? They must engage in labor, rising and resting, their bodies and mouths becoming burdens.\n\nThe male is yang and pertains to fire; the female is yin and pertains to water. Only yin can diminish yang, and water can overcome fire. Thus, those who study the Dao first guard against sensual desire.\n\nLaboring for clothing and food wearies the mind and scatters *qi*, though the scattering is slight. Greed and lust for sensual pleasure deplete the spirit and scatter *qi* greatly.\n\nThe Dao produces the Two Modes: the light and pure become heaven, which is yang and pertains to fire; the heavy and turbid become earth, which is yin and pertains to water. Humans dwell between them, embracing yang while carrying yin. Thus, those who study the Dao know the arts of cultivation: they abandon extravagance, restrain desire, secure their essence, and guard their spirit. They refine only the yang, causing yin to diminish and yang to be preserved. Then they ascend to heaven and become immortals, like fire rising upward. The foolish and deluded, however, take wine as their drink and falsehood as their norm. They indulge their emotions, pursue their desires, deplete their essence, and harm their spirit. Thus, yang declines and yin prevails, and they sink into the earth to become ghosts, like water flowing downward.\n\nThose who cultivate the true Way are like rolling a stone up a high mountain: the higher they go, the harder it becomes. A single misstep, and all previous efforts are lost—because it is difficult, the world does not pursue it. Those who turn from the Dao and chase desire are like hurling a stone down a steep slope: the lower it goes, the easier it becomes. In an instant, it falls and does not return—because it is easy, the world follows it, and none awaken to the truth.\n\nWhat I have spoken of regarding the arts of cultivation are the affairs of ordinary people. The teachings for the Son of Heaven differ from these.\n\nYour Majesty is a heavenly being. The August Heaven has entrusted our house with the mandate to eliminate the cruel and remove the violent, to serve as parents to the people, and to carry out Heaven’s punishment. Like a great craftsman wielding the axe, you have overcome hardship and difficulty. When your work is complete and your term ends, you will ascend to heaven and return to your celestial position. During your time in the world, you must strictly avoid sensual pleasures, reduce excessive desires, and ensure the well-being of your sacred body, that your wisdom may extend far and wide.\n\nEven an ordinary man with a single wife harms his body; how much more so the Son of Heaven, who keeps many concubines? Your palace is filled with consorts, and I have heard that Liu Zhonglu and others in the capital have been selecting maidens to prepare for the harem. I have heard the Daoist scriptures say: *Do not see what can be desired, lest the mind be disturbed.* Once seen, restraint becomes difficult. I humbly urge you to take heed.\n\nPeople mistake the body for the self, but this is merely a borrowed vessel, received from one’s parents. The spirit is the true self, received from the Dao. It is that which thinks and reflects, waking and sleeping. Those who do good and advance in the Dao ascend to heaven and become immortals; those who do evil and turn from the Dao descend into the earth and become ghosts.”\n\nThe Dao gives birth to all beings, as gold is wrought into many vessels—melt down the form, and it returns to gold; let a person practice goodness, and they return to the Dao. The sounds, sights, clothing, and food of the human world—people see these as pleasures, but they are not true joy, for they are fundamentally suffering. Worldly people mistake the illusory for the real, take suffering for joy—is this not lamentable? They do not know that the supreme joy of heaven is true joy.\n\nFor the sake of studying the Dao, I abandoned my parents and dwelt in mountain caves. At the time, four of us studied the Dao together: Qiu, Liu, Tan, and Ma. Those three completed their merit and attained the Dao, and now they have ascended and transformed. My allotted span of toil is not yet over; I eat but one meal a day, one flavor in one bowl, content and at ease, awaiting my time. Those who are rich or noble, who aid the people and save the world, accumulating deeds and piling up merit—this is yet another path. But if one can accumulate goodness and practice the Dao, how can one fail to become an immortal?\n\nChina has known long peace, and heaven has repeatedly sent down scriptures and teachings to exhort people to do good. North of the Yellow River, in the Western Lands and the lands east of the Yangtze, these teachings abound. In the Later Han, Yu Ji received the *Scripture of Great Peace* in one hundred and fifty scrolls—all methods for cultivating truth and governing the state. If the Daoist people of China recite and practice them, they may gain blessings and attain the Dao. Again, in the first year of Emperor Heng’s Yongshou reign, on the seventh day of the first month, the Most High descended to Shu and knocked at the gate, bestowing upon Celestial Master Zhang Daoling the *Scriptures of the Southern and Northern Dippers*, the *Twenty-Four Stages of the Dharma Record*, and over a thousand other scriptures. In the Jin, Wang Zuan encountered the Most High Lord of the Dao, who arrived in a chariot riding the void and bestowed upon him dozens of scriptures. In the Northern Wei, Celestial Master Kou Qianzhi dwelt on Mount Song, where he received from the Most High and others over sixty scrolls of Daoist scriptures—all methods for cultivating the mind and the Dao, praying for blessings, averting disasters, sweeping away demons, and rescuing people from epidemics. The remaining scriptures and teachings are too numerous to recount. The purpose of sending down these scriptures is to urge emperors, ministers, and common people of past and present to all practice goodness. The essentials of the scriptures are vast, but let me present their gist.\n\nHeaven and earth hold human life as most precious; thus, the human body is as rare as the horn of a qilin, while the myriad things teem like the hairs of an ox. Having obtained this rare body, one should hasten to the path of cultivating truth, do good, and accumulate blessings, gradually approaching the wondrous Dao. This applies from the emperor down to the common people. Though their ranks differ, their nature and life are the same. Emperors are all heaven-sent beings temporarily descending to the human world. If they practice goodness and accumulate blessings, when they ascend to heaven, their positions will surpass their former ranks; if they do not practice goodness and accumulate blessings, the opposite will occur. Heavenly beings with minor merits or meager deeds are sent down to the world again, and only by accumulating blessings and aiding the people do they attain high positions.\n\nIn ancient times, the Yellow Emperor was sent down by heaven’s mandate. In his first life, he was a commoner; in his second, a minister; and in his third, a ruler. He saved the world and pacified the people, piling up merit and accumulating virtue, and when his allotted span was complete, he ascended to heaven, where his position surpassed his former one. The method for Your Majesty’s cultivation is no other: outwardly, cultivate hidden virtue; inwardly, secure the spirit. Relieving the people and protecting the masses, so that all under heaven feel secure—this is outward practice. Reducing desires and preserving the spirit—this is inward practice.\n\nFor humans, food and drink are fundamental. The pure part becomes essence and qi; the turbid part becomes urine and excrement. Indulgence in desires and lusts depletes essence and exhausts qi, leading to decline and exhaustion. Your Majesty should treasure and conserve them. Even a single night’s indulgence causes deep harm—how much more so for those who give free rein to their desires? Though complete abstinence may not be possible, merely moderating desire brings one close to the Dao.\n\nThe spirit is the child; qi is the mother. Qi flows through the eyes as tears, through the nose as mucus, through the tongue as saliva, through the exterior as sweat, through the interior as blood, through the bones as marrow, and through the kidneys as essence. When qi is whole, one lives; when qi is lost, one dies. When qi is abundant, one is strong; when qi is weak, one ages. If qi is constantly kept from scattering, it is like a child having its mother; if qi scatters, it is like a child losing its parents—what then can one rely upon?\n\nSpirit and qi share the same body; essence and marrow share the same source. If Your Majesty were to sleep in stillness for a month, you would surely feel your spirit clear and refreshed, your sinews and bones strong and healthy. The ancients said: *Taking medicine for a thousand mornings is not as good as sleeping alone for a single night.* Medicine is but grass; essence is marrow. To cast aside marrow and add grass—what benefit is there? It is like a bag filled with gold, gradually removing the gold and adding iron. Over time, the gold is exhausted, and though the bag is full, it contains only iron. What difference is there in the principle of taking medicine?\n\nThe ancients married and established families for the sake of descendants. The former sages—Duke of Zhou, Confucius, and Mencius—each had children. Confucius was forty and no longer confused; Mencius was forty and his mind no longer wavered. After forty, a person’s qi and blood begin to decline, and thus the warning against lust. Your Majesty’s sagely sons and divine grandsons branch out widely—you should preserve and nurture yourself, abstain from desire, and consider your own well-being.\n\nIn former times, the Song Emperor Huizong was originally a heavenly being. There was a divine immortal named Lin Lingsu who led him on a spiritual journey to heaven, entering the palace where he dwelt. On its lintel was written *Divine Empyrean*; there was no hunger or thirst, no cold or heat, only carefree ease and boundless joy. He wished to dwell there forever, with no desire to return to the human world. Lin Lingsu urged him, saying: *Your Majesty was sent to the human world by heaven’s mandate to be the Son of Heaven; your allotted work is not yet complete—how can you remain here?* Thus, he descended to the human world. Later, the Jin state rose, and Emperor Taizu’s general Wanyan Loushi captured Huizong and took him north, where he grew old and eventually died in the northern capital. From this, we know that the joy of heaven surpasses that of the human world a myriadfold, and we also know that if one’s allotted cause is not yet complete, how can one suddenly return?\n\nIn my early years, I left home, and four of us studied the Dao together. Those three have already ascended and transformed like cicadas shedding their shells, casting off these mortal bones to depart. They can transform their bodies into hundreds or thousands, with no limit. I have endured countless hardships and have not yet been able to leave this world—this, too, is due to my allotted cause.\n\nWhen a person has yet to be born, they abide within the Dao—neither cold nor hot, neither hungry nor thirsty, the mind free of thought—truly a state of bliss. Once born and given form, the eyes perceive colors, the ears hear sounds, the tongue savors tastes, and the mind contemplates affairs—thus a myriad concerns arise. The ancients, recognizing that the heart and intent cannot be mastered, likened the heart to a monkey and the intent to a horse, for their unruliness is plain to see. As the ancients said: *\"It is easier to tame a fierce beast than to subdue the heart of an inch.\"* This is the swiftest path to attaining the Dao and ascending to heaven.\n\nThe Daoist cultivates truth and refines the heart, thinking of nothing, like the vast emptiness or still water. When the wind over water subsides, it becomes clear and tranquil, reflecting all things in brilliance. When the wind stirs, the water roils and muddies—how then can it mirror the myriad forms? The original true nature is as still as unmoving water. Yet when the eyes see colors, the ears delight in sounds, the tongue craves flavors, and the mind clings to affairs, these senses arise in ceaseless succession, like whirlwinds churning the waves.\n\nAt first, taming the heart is exceedingly difficult. With years of practice and deepening effort, one reduces and refines until reaching non-action. Even for a single Daoist, mastering the heart is hard—how much more so for the Son of Heaven, who rules the Four Seas and daily attends to ten thousand affairs? Yet if one can moderate desires, restrain thoughts, and preserve the precepts, one may still gain heaven’s protection and preserve life.\n\nIn ancient times, the Yellow Emperor crafted bows and arrows and forged weapons to awe the world. When his work was complete, he sought the immortal Guangchengzi to inquire about the Way of nurturing life. Guangchengzi replied: *\"Do not let your thoughts run wild—this single word suffices.\"* I say that the Way of cultivating the self lies in harmony. Excessive anger harms the body, excessive joy harms the spirit, and excessive thought harms the qi—these three greatly damage the Dao and should be avoided.\n\nYour Majesty already knows that the spirit is the true self, while the body is but an illusory vessel. When seeing forms and stirring desire, one should reflect that the body is transient while the spirit is real—thus the mind can be stilled. Human life is rare and precious. Consider the birds and beasts, which bear young every year, yet most perish in infancy; few reach adulthood or old age, and the same is true for humans. Thus, twenty or thirty years is a short lifespan, forty or fifty a moderate one, and sixty or seventy a long one. Your Majesty has now entered the age of long life—you should cultivate virtue and preserve your health to attain longevity.\n\nThose who leave the household to study the Dao wear coarse clothes and eat simple food, avoiding the accumulation of wealth, for they fear it will harm the body and diminish blessings. Even those who cultivate the Dao while remaining in the world should moderate their diet, dwelling, treasures, and possessions, keeping within proper bounds and avoiding excess.\n\nBeyond the Four Seas, across the vast earth, there are countless lands—myriad in number—where rare treasures and strange jewels abound. Yet none compare to the Central Plains, where heaven has bestowed scriptures and teachings, where the arts of governing the state and cultivating the self are most complete, and where extraordinary individuals have attained the Dao and ascended to heaven.\n\nShandong and Hebei are the finest lands under heaven, yielding fine grains, vegetables, fish, salt, silk, and hemp to supply the needs of all. Since ancient times, those who have possessed these lands have become great states. Thus, successive dynasties have contended for them. Now, these regions have suffered war and fire, their people scattered and unsettled. It would be wise to appoint capable officials well-versed in local affairs to oversee their governance, granting a three-year tax exemption. This would ensure ample silk and cloth for the state and military, while allowing the common people to recover and find peace—a single measure yielding two benefits, and a means of pacifying the people and seeking blessings. Heaven will surely favor this, and all shall prosper.\n\nThough I dwell ten thousand *li* away, I did not hesitate to answer your summons. I have already spoken of the methods for cultivating the self and nurturing life—how could I withhold the Way of governing the state and protecting the people? Regarding the restoration of Shandong and Hebei, if capable officials are dispatched to implement the above measures, it will surely align with heaven’s will. But if unworthy men are appointed, it will not only be of no benefit but may even cause harm.\n\nWhen the Jin first gained the realm, they rose from the eastern lands, and the customs of the Central Plains were not yet familiar to them. They enfeoffed Liu Yu in Dongping, governing for eight years before reclaiming it—this was a sound strategy for establishing their rule. I hope Your Majesty will give this careful consideration.\n\nThe essential Way of cultivating the self and nurturing life has now been fully transmitted. As for the arts of governing the state and protecting the people, I have briefly outlined their key points. Whether to employ them or not rests with Your Majesty’s judgment.\n\nIn the tenth year of Emperor Shizong of Jin’s reign, his excessive indulgence in sensual pleasures left him weak and enfeebled. At court assemblies, two attendants had to support him as he walked. Thereafter, he sought out eminent Daoists and inquired about methods of preservation. He once summoned me to ask about the Way of cultivating truth, and I spoke to him as I have to you. Afterward, his body grew strong again, and he walked as before. He reigned for thirty years before ascending in transcendence.\n\nThroughout my life, I have studied the Dao with a heart free of thought and worry. In a dream, heaven’s intent seemed to say: *\"Your merit and conduct are not yet complete—you must await the proper time to ascend and transform.\"* This illusory body is but a borrowed vessel, like an inn where one briefly lodges—what is there to cling to? The true body can soar and ascend, transforming into hundreds or thousands, with no limit to its manifestations. In heaven, one may dwell for a thousand years or ten thousand myriad—yet when affairs arise, one receives heaven’s mandate to descend to the world, entering a womb and taking form.\n\nAfter transmitting the Way, I addressed His Majesty, saying: *\"I have earnestly imparted these teachings, and you have respectfully received them. These are difficult matters to practice—yet how dare I not follow the immortal’s command and diligently apply them?\"* The transmission of the Way was then recorded by close ministers in a book, which His Majesty will personally review. Should any profound meaning remain unclear, he may seek further instruction.\n\n*The Record of the Auspicious Assembly of the Mysterious Wind* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "玄风庆会录 经名：玄风庆会录。 一卷。 元移剌楚才（即耶律楚才）撰。 底本出处：《正统道藏》洞真部谱录类。 玄风庆会录序 国师长春真人昔承宣召，不得已而后起，遂别中土，过流沙，陈道德以致君，止干戈而救物，功成身退，厌世登天。 自太上玄元西去之后，寥寥千百载，唯真人一人而已。 其往回事迹载於《西游记》中详矣，唯余对上传道玄言奥旨，上令近侍录而秘之。 岁乃瑜旬，传之及外，将以刊行於世，愿与天下共知玄风庆会一段奇事云。 壬辰长至日序。 玄风庆会录 元侍臣昭武大将军尚书礼部侍郎移剌楚才奉勑编录 钦奉皇帝圣议，宣请高道长春真人。 岁在己卯正元后一日，敕朝，官刘仲禄资韶寻访，直至东莱，适符圣意礼迎仙驭，不辞远远而来。 逮乎壬午之冬十月既望，皇帝畋于西域雪山之阳，是夕御行在设庭燎，虚前席延长春真人以问长生之道，真人曰：夫道生天育地，日月星辰、鬼神人物皆从道生，人止知天大，不知道之大也。 余生平弃亲出家，唯学此耳。 道生天地，开辟而生人焉。 人之始生也，神光自照，行步如飞。 地生菌，自有滋味，不假炊爨，人皆食之。 此时尚未火食，其菌皆香，且鼻嗅其香，口嗜其味，渐致身重，神光寻灭，以爱欲之深故也。 学道之人以此之故，世人爱处不爱，世人住处不住，去声色以清静为娱，屏滋味以恬淡为美，但有执着，不明道德也。 眼见乎色，耳听乎声，口嗜乎味，性逐乎情，则散其气，譬如气鞠气实则健，气散则否。 人以气为主，逐物动念则元气散，若气鞠之气散耳。 天生二物曰动植，草木之类为植，植而无识，两露沾濡，因得生荣。 人物之属为动，动而有情，无衣无食，何以卒岁，必当经营耳，旦夕云为，身口为累故也。 夫男阳也，属火，女阴也，属水。 唯阴能消阳，水能克火，故学道之人首戒乎色。 夫经营衣食则劳乎思虑，虽散其气而散少，贪婪色欲则耗乎精神，亦散其气而散之多。 道产二仪，轻清者为天，天阳也，属火。 重烛者为地，地阴也，属水。 人居其中，负阴而抱阳，故学道之人知修炼之术，去奢屏欲，固精守神，唯炼乎阳，是致阴消而阳全，则升乎天而为仙，如火之炎上也。 其愚迷之徒以酒为浆，以妄为常，恣其情，逐其欲，耗其精，损其神，是致阳衰而阴盛，则沉於地为鬼，如水之流下也。 夫学修真者如转石上乎高山，愈高愈难，畦步颠沛，前功俱废以其难为也，举世莫之为也。 背道逐欲者如掷石下乎峻坡，愈卑而愈易，斯须陨坠，一去无回。 以其易为也，故举世从之，莫或悟也。 余前所谓修炼之道，皆常人之事耳，天子之说又异於是。 陛下本天人耳，皇天眷命，假手我家，除残去暴，为元元父母，恭行天罚，如代大匠断，克艰克难，功成限毕，即升天复位。 在世之问，切宜臧声色，省耆欲，得圣体康宁，睿等遐远耳。 庶人一妻尚且损身，况乎天子多畜嫔御，宁不深损。 陛下宫姬满座，前闻刘仲禄中都等拣选处女以备后宫。 窃闻道经云：不见可欲，使心不乱。 既见之，戒之则难，愿留意焉。 人认身为己，此乃假物，从父母而得之者，神为真己，从道中而得之者，能思虑寤寐者是也。 行善进道则升天为之仙，作恶背道则入地为之鬼。",
      "translated_text": "**Record of the Auspicious Gathering of the Mysterious Wind**\n\n**Title:** *Record of the Auspicious Gathering of the Mysterious Wind*. One scroll. Compiled by Yuan dynasty scholar Yilie Chucai (also known as Yelü Chucai).\n\n**Source:** *Zhengtong Daoist Canon*, *Dongzhen* Section, Registers and Records Category.\n\n---\n\n### **Preface to the *Record of the Auspicious Gathering of the Mysterious Wind***\n\nIn former times, the National Preceptor, Perfected One of Eternal Spring, received the imperial summons and, though reluctant, arose in response. He then departed the Central Lands, crossed the Flowing Sands, expounded the Dao and virtue to enlighten the ruler, and halted warfare to succor all beings. Having accomplished his work, he withdrew from the world and ascended to heaven.\n\nSince the Supreme Lord of the Mysterious Origin journeyed west, a thousand years have passed in solitude, and only the Perfected One alone has achieved such a feat. The details of his journey are recorded in *The Record of the Western Journey*, yet I alone received his transmission of the profound and arcane teachings of the Dao. The emperor commanded his attendants to record and keep them secret. After the lapse of years, these teachings were transmitted beyond the court and are now to be published for the world, that all may know of this wondrous gathering of the mysterious wind.\n\nWritten on the Winter Solstice of the *renchen* year.\n\n---\n\n### **Record of the Auspicious Gathering of the Mysterious Wind**\n\nCompiled by Imperial Attendant, Illustrious Martial General, and Vice Minister of the Ministry of Rites, Yilie Chucai, by imperial decree.\n\nBy sacred imperial decree, the emperor summoned the eminent Daoist, Perfected One of Eternal Spring. In the year *jimao*, on the second day of the first month of the new era, the emperor issued an edict, and the official Liu Zhonglu, bearing the imperial mandate, sought him out. The search led to Donglai, where, by fortunate coincidence, the Perfected One was found and respectfully welcomed in accordance with the emperor’s will. He did not refuse, though the journey was long.\n\nIn the winter of the *renwu* year, on the night of the full moon of the tenth month, the emperor was hunting on the southern slopes of the Snow Mountains in the Western Regions. That evening, at the imperial encampment, torches were lit in the courtyard, and the emperor, setting aside his throne, invited the Perfected One of Eternal Spring to inquire about the Way of long life. The Perfected One said:\n\n“The Dao gives birth to heaven and nurtures earth; the sun, moon, stars, ghosts, spirits, and all beings arise from the Dao. People know only that heaven is vast, yet they do not know the vastness of the Dao.\n\nAll my life, I have abandoned my family and left the household to study only this. The Dao gives birth to heaven and earth, and through their unfolding, humanity comes into being. At the beginning of human life, the spirit’s radiance illuminates all, and one’s steps are as swift as flight. The earth produces mushrooms, which have their own savor, requiring no cooking, and people ate them. At that time, fire was not yet used for food, and all mushrooms were fragrant. The nose savored their scent, the mouth craved their taste, and gradually, the body grew heavy, the spirit’s light faded, and this was due to the depth of love and desire.\n\nThose who study the Dao, for this reason, do not love what the world loves, nor dwell where the world dwells. They abandon sensory pleasures to find joy in clarity and stillness, and forsake rich flavors to delight in simplicity and tranquility. Any attachment obscures the understanding of the Dao and virtue.\n\nThe eye sees form, the ear hears sound, the mouth craves taste, and the nature follows emotion—thus scattering one’s *qi*. It is like a ball of *qi*: when full, it is strong; when scattered, it is not. *Qi* is the master of the human being. Pursuing things and stirring thoughts scatters the primordial *qi*, just as the *qi* of a ball disperses.\n\nHeaven produces two kinds of beings: the moving and the stationary. Grasses and trees belong to the stationary; though they lack consciousness, they flourish with the dew’s moisture. Humans and animals belong to the moving; though they have emotions, without clothing or food, how can they survive the year? They must engage in labor, rising and resting, their bodies and mouths becoming burdens.\n\nThe male is yang and pertains to fire; the female is yin and pertains to water. Only yin can diminish yang, and water can overcome fire. Thus, those who study the Dao first guard against sensual desire.\n\nLaboring for clothing and food wearies the mind and scatters *qi*, though the scattering is slight. Greed and lust for sensual pleasure deplete the spirit and scatter *qi* greatly.\n\nThe Dao produces the Two Modes: the light and pure become heaven, which is yang and pertains to fire; the heavy and turbid become earth, which is yin and pertains to water. Humans dwell between them, embracing yang while carrying yin. Thus, those who study the Dao know the arts of cultivation: they abandon extravagance, restrain desire, secure their essence, and guard their spirit. They refine only the yang, causing yin to diminish and yang to be preserved. Then they ascend to heaven and become immortals, like fire rising upward. The foolish and deluded, however, take wine as their drink and falsehood as their norm. They indulge their emotions, pursue their desires, deplete their essence, and harm their spirit. Thus, yang declines and yin prevails, and they sink into the earth to become ghosts, like water flowing downward.\n\nThose who cultivate the true Way are like rolling a stone up a high mountain: the higher they go, the harder it becomes. A single misstep, and all previous efforts are lost—because it is difficult, the world does not pursue it. Those who turn from the Dao and chase desire are like hurling a stone down a steep slope: the lower it goes, the easier it becomes. In an instant, it falls and does not return—because it is easy, the world follows it, and none awaken to the truth.\n\nWhat I have spoken of regarding the arts of cultivation are the affairs of ordinary people. The teachings for the Son of Heaven differ from these.\n\nYour Majesty is a heavenly being. The August Heaven has entrusted our house with the mandate to eliminate the cruel and remove the violent, to serve as parents to the people, and to carry out Heaven’s punishment. Like a great craftsman wielding the axe, you have overcome hardship and difficulty. When your work is complete and your term ends, you will ascend to heaven and return to your celestial position. During your time in the world, you must strictly avoid sensual pleasures, reduce excessive desires, and ensure the well-being of your sacred body, that your wisdom may extend far and wide.\n\nEven an ordinary man with a single wife harms his body; how much more so the Son of Heaven, who keeps many concubines? Your palace is filled with consorts, and I have heard that Liu Zhonglu and others in the capital have been selecting maidens to prepare for the harem. I have heard the Daoist scriptures say: *Do not see what can be desired, lest the mind be disturbed.* Once seen, restraint becomes difficult. I humbly urge you to take heed.\n\nPeople mistake the body for the self, but this is merely a borrowed vessel, received from one’s parents. The spirit is the true self, received from the Dao. It is that which thinks and reflects, waking and sleeping. Those who do good and advance in the Dao ascend to heaven and become immortals; those who do evil and turn from the Dao descend into the earth and become ghosts.”",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1230,
      "start_sentence": 0,
      "end_sentence": 44,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.974933385849,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\玄风庆会录.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "夫道产众生，如金为众器，销其像则返成乎金，人行乎善则返乎道。 人间声色衣食，人见以为娱乐，此非真乐，本为苦耳。 世人以妄为真，以苦为乐，不亦悲哉，殊不知上天至乐乃真乐耳。 余侪以学道之故，弃父母而栖岩穴，同时学道四人，日丘，曰刘，日谭，日马，彼三人功满道成，今已升化。 余辛苦之限未终，日一食一味一盂，恬然自适，以待乎时。 其富者贵者济民拯世，积行累功，更为异耳。 但能积善行道，胡患不能为仙乎。 中国承平日久，上天屡降经教，劝人为善。 大河之北，西川、江左悉有之。 束汉时于吉受《太平经》一百五十卷，皆修真治国之方，中国道人诵之行之，可获福成道。 又恒帝永寿元年正月七日，太上降蜀临叩，授天师张道陵《南斗北斗经》及《二十四阶法录》诸经籍千余卷。 晋王纂遇太上道君法驾乘空，赐经数十卷。 元魏时天师寇谦之居嵩山，於太上等处受道经六十余卷。 皆治心修道，祈福禳灾，扫除魑魅，拯疾疫之术。 其余经教，不可尽言。 降经之意，欲使古今帝王臣民皆令行善。 经旨太多，请举其要。 天地之生人为贵，是故人身难得如麟之角，万物纷然如牛之毛。 既获难得之身，宜趣修真之路，作善修福，渐臻妙道。 上至帝王降及民庶。 尊卑虽异，性命各同耳。 帝王悉天人谪降人问，若行善修福，则升天之时位瑜前职，不行善修福则反是，天人有功微行薄者，再令下世，修福济民方得高位。 昔轩辕氏天命降世，一世为民，再世为臣，三世为君。 济世安民，累功积德，数尽升天而位尊於昔。 陛下修行之法无他，当外修阴德，内固精神耳。 恤民保众，使天下怀安则为外行，省欲保神为乎内行。 人以饮食为本，其清者为之精气，浊者为之便溺。 贪欲好色则丧精耗气，乃成衰惫。 陛下宜加珍啬，一宵一为已为深损，而况恣欲者乎。 虽不能全戒，但能节欲则几於道矣。 夫神为子，气为母，气经月为汨，经鼻为脓，经舌为津，经外为汗，经内为血，经骨为髓，经肾为精。 气全则生，气亡财死，气盛则壮，气衰则老。 常使气不散，则如子之有母，气散则如子丧父母，何恃何估。 夫神气同体，精髓一源，陛下试一月静寝，必觉精神清爽，筋骨强健。 古人云：服药千朝，不如独卧一宵。 药为草，精为髓，去髓添草，有何益哉。 譬如囊中贮之金，旋去金而添铁，久之金尽，囊虽满，空遗铁耳。 服药之理，夫何异乎。 古人以继嗣之故，娶妇而立家。 先圣周公、孔子、孟子各有子，孔子四十而不惑，孟子四十不动心。 人生四十已上，气血已衰，故戒之在色也。 陛下圣子神孙枝蔓多广，宜保养戒欲，为自计耳。 昔宋上皇本天人也，有神仙林灵素者，挈之神游上天，入所居宫，题其额日神霄，不饥不渴，不寒不暑，逍遥无事，快乐自在，欲久居之，无复往人问之意，林灵素劝之曰：陛下天命人世有天子，功限未毕，岂得居此。 遂下人问。 自后女真国兴，太祖皇帝之将娄失虏上皇北归，久而老终于上京。 由是知上天之乐何啻万倍人问，又知因绿未终，岂能遽然而归也。 余昔年出家，同道四人，彼三子先已升化如蝉蜕，然委此凡骨而去，能化身千百，无不可者。 余辛苦万端，未能去世，亦因绿之故也。",
      "translated_text": "The Dao gives birth to all beings, as gold is wrought into many vessels—melt down the form, and it returns to gold; let a person practice goodness, and they return to the Dao. The sounds, sights, clothing, and food of the human world—people see these as pleasures, but they are not true joy, for they are fundamentally suffering. Worldly people mistake the illusory for the real, take suffering for joy—is this not lamentable? They do not know that the supreme joy of heaven is true joy.\n\nFor the sake of studying the Dao, I abandoned my parents and dwelt in mountain caves. At the time, four of us studied the Dao together: Qiu, Liu, Tan, and Ma. Those three completed their merit and attained the Dao, and now they have ascended and transformed. My allotted span of toil is not yet over; I eat but one meal a day, one flavor in one bowl, content and at ease, awaiting my time. Those who are rich or noble, who aid the people and save the world, accumulating deeds and piling up merit—this is yet another path. But if one can accumulate goodness and practice the Dao, how can one fail to become an immortal?\n\nChina has known long peace, and heaven has repeatedly sent down scriptures and teachings to exhort people to do good. North of the Yellow River, in the Western Lands and the lands east of the Yangtze, these teachings abound. In the Later Han, Yu Ji received the *Scripture of Great Peace* in one hundred and fifty scrolls—all methods for cultivating truth and governing the state. If the Daoist people of China recite and practice them, they may gain blessings and attain the Dao. Again, in the first year of Emperor Heng’s Yongshou reign, on the seventh day of the first month, the Most High descended to Shu and knocked at the gate, bestowing upon Celestial Master Zhang Daoling the *Scriptures of the Southern and Northern Dippers*, the *Twenty-Four Stages of the Dharma Record*, and over a thousand other scriptures. In the Jin, Wang Zuan encountered the Most High Lord of the Dao, who arrived in a chariot riding the void and bestowed upon him dozens of scriptures. In the Northern Wei, Celestial Master Kou Qianzhi dwelt on Mount Song, where he received from the Most High and others over sixty scrolls of Daoist scriptures—all methods for cultivating the mind and the Dao, praying for blessings, averting disasters, sweeping away demons, and rescuing people from epidemics. The remaining scriptures and teachings are too numerous to recount. The purpose of sending down these scriptures is to urge emperors, ministers, and common people of past and present to all practice goodness. The essentials of the scriptures are vast, but let me present their gist.\n\nHeaven and earth hold human life as most precious; thus, the human body is as rare as the horn of a qilin, while the myriad things teem like the hairs of an ox. Having obtained this rare body, one should hasten to the path of cultivating truth, do good, and accumulate blessings, gradually approaching the wondrous Dao. This applies from the emperor down to the common people. Though their ranks differ, their nature and life are the same. Emperors are all heaven-sent beings temporarily descending to the human world. If they practice goodness and accumulate blessings, when they ascend to heaven, their positions will surpass their former ranks; if they do not practice goodness and accumulate blessings, the opposite will occur. Heavenly beings with minor merits or meager deeds are sent down to the world again, and only by accumulating blessings and aiding the people do they attain high positions.\n\nIn ancient times, the Yellow Emperor was sent down by heaven’s mandate. In his first life, he was a commoner; in his second, a minister; and in his third, a ruler. He saved the world and pacified the people, piling up merit and accumulating virtue, and when his allotted span was complete, he ascended to heaven, where his position surpassed his former one. The method for Your Majesty’s cultivation is no other: outwardly, cultivate hidden virtue; inwardly, secure the spirit. Relieving the people and protecting the masses, so that all under heaven feel secure—this is outward practice. Reducing desires and preserving the spirit—this is inward practice.\n\nFor humans, food and drink are fundamental. The pure part becomes essence and qi; the turbid part becomes urine and excrement. Indulgence in desires and lusts depletes essence and exhausts qi, leading to decline and exhaustion. Your Majesty should treasure and conserve them. Even a single night’s indulgence causes deep harm—how much more so for those who give free rein to their desires? Though complete abstinence may not be possible, merely moderating desire brings one close to the Dao.\n\nThe spirit is the child; qi is the mother. Qi flows through the eyes as tears, through the nose as mucus, through the tongue as saliva, through the exterior as sweat, through the interior as blood, through the bones as marrow, and through the kidneys as essence. When qi is whole, one lives; when qi is lost, one dies. When qi is abundant, one is strong; when qi is weak, one ages. If qi is constantly kept from scattering, it is like a child having its mother; if qi scatters, it is like a child losing its parents—what then can one rely upon?\n\nSpirit and qi share the same body; essence and marrow share the same source. If Your Majesty were to sleep in stillness for a month, you would surely feel your spirit clear and refreshed, your sinews and bones strong and healthy. The ancients said: *Taking medicine for a thousand mornings is not as good as sleeping alone for a single night.* Medicine is but grass; essence is marrow. To cast aside marrow and add grass—what benefit is there? It is like a bag filled with gold, gradually removing the gold and adding iron. Over time, the gold is exhausted, and though the bag is full, it contains only iron. What difference is there in the principle of taking medicine?\n\nThe ancients married and established families for the sake of descendants. The former sages—Duke of Zhou, Confucius, and Mencius—each had children. Confucius was forty and no longer confused; Mencius was forty and his mind no longer wavered. After forty, a person’s qi and blood begin to decline, and thus the warning against lust. Your Majesty’s sagely sons and divine grandsons branch out widely—you should preserve and nurture yourself, abstain from desire, and consider your own well-being.\n\nIn former times, the Song Emperor Huizong was originally a heavenly being. There was a divine immortal named Lin Lingsu who led him on a spiritual journey to heaven, entering the palace where he dwelt. On its lintel was written *Divine Empyrean*; there was no hunger or thirst, no cold or heat, only carefree ease and boundless joy. He wished to dwell there forever, with no desire to return to the human world. Lin Lingsu urged him, saying: *Your Majesty was sent to the human world by heaven’s mandate to be the Son of Heaven; your allotted work is not yet complete—how can you remain here?* Thus, he descended to the human world. Later, the Jin state rose, and Emperor Taizu’s general Wanyan Loushi captured Huizong and took him north, where he grew old and eventually died in the northern capital. From this, we know that the joy of heaven surpasses that of the human world a myriadfold, and we also know that if one’s allotted cause is not yet complete, how can one suddenly return?\n\nIn my early years, I left home, and four of us studied the Dao together. Those three have already ascended and transformed like cicadas shedding their shells, casting off these mortal bones to depart. They can transform their bodies into hundreds or thousands, with no limit. I have endured countless hardships and have not yet been able to leave this world—this, too, is due to my allotted cause.",
      "overlap_context": "hat can be desired, lest the mind be disturbed.* Once seen, restraint becomes difficult. I humbly urge you to take heed.\n\nPeople mistake the body for the self, but this is merely a borrowed vessel, received from one’s parents. The spirit is the true self, received from the Dao. It is that which thinks and reflects, waking and sleeping. Those who do good and advance in the Dao ascend to heaven and become immortals; those who do evil and turn from the Dao descend into the earth and become ghosts.”",
      "start_char": 1230,
      "end_char": 2441,
      "start_sentence": 45,
      "end_sentence": 92,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.33582377433777,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\玄风庆会录.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "夫人之未生，在乎道中，不寒不暑，不饥不渴，心无所思，真为快乐。 既生而受形，眼观乎色，耳听乎声，舌了乎味，意虑乎事，万事生矣。 古人以心意莫能御也，故喻心为猿，意为马，其难制可知也。 古人有言曰：易伏猛兽，难降寸心。 乃成道升天之捷径耳。 道人修真炼心，一物不思量，如太虚止水。 水之风息也静而清，万物照之灿然悉见。 水之风来也动而浊，曷能鉴万物哉。 本来真性静如止水，眼见乎色，耳悦乎声，舌嗜乎味，意着乎事，此数者续续而迭举，若飘风之鼓浪也。 道人治心之初甚难，岁久功深，损之又损，至於无为。 道人一身耳，治心犹难，蚓夫天子富有四海，日揽万机，治心岂易哉。 但能节色欲，臧思虑，亦获天佑，死全戒者邪。 昔轩辕皇帝造弧矢、创兵革以威天下，功成之际，请教于仙人广成子，以问治身之道，广成子曰：汝无使思虑营营，一言足矣。 余谓修身之道，贵乎中和，太怒则伤乎身，太喜则伤乎神，太思虑则伤乎气，此三者於道甚损，宜戒之也。 陛下既知神为真己，身是幻躯，凡见色起心，当自思身假神真，自能止念也。 人生寿命难得，且如乌兽岁岁产子，旋踵夭亡，壮老者鲜，婴童亦如之。 是故二十三十为之下寿，四十五十为之中寿，六十七十为之上寿。 陛下春秋已入上寿之期，宜修德保身，以介眉寿。 出家学道人恶衣恶食，不积财，恐害身损福故也。 在家修道之人，饮食居处，珍玩货财亦当依分，不宜过差也。 四海之外，普天之下，所有国土不啻亿兆，奇珍异宝比比出之，皆不如中原天垂经教，治国治身之术为之大备，屡有奇人成道升天耳。 山束、河北天下美地，多出良禾美蔬、鱼盐丝玺以给四方之用，自古得之者为大国。 所以历代有国家者，唯争此地耳。 今已为民有兵火相继，流散未集，宜差知彼中子细事务者能干官，规措勾当，与免三年税赋，使军国足丝帛之用，黔黎获苏息之安，一举而两得之，兹亦安民祈福之一端耳，自天佑之，吉无不利也。 余万里之外，一召不远而来，修身养命之方既已先言，治国保民之术何为惜口。 余前所谓安集山束、河北之事，如差清干官前去，依上措画，必当天心。 苟授以非才，不徒无益，反为害也。 初，金国之得天下，以创起束土，中原人情尚未谙悉，封刘豫於束平，经略八年，然后取之，此亦开创良策也，愿加意焉。 修身养命要妙之道传之尽矣，其治国保民之术微陈梗盘，其用之舍之，在宸衷之断耳。 昔金国世宗皇帝即位之十年，色欲过节，不胜衰惫，每朝会二人掖行之，自是博访高道，求保养之方，亦尝请余问修真之道，余如前说，自后身体康强，行步如故，凡在位三十年升遐。 余生平学道心以无思无虑，梦中天意若曰：功行未满，当待时升化耳。 幻身假物，若逆旅蜕居耳，何足恋也。 真身飞升，可化千百，无施不可。 上天千岁或万万，遇有事，奉天命降世，投胎就舍而已。 传道毕，上谕之曰：谆谆道诲，敬闻命矣。 斯皆难行之事，然则敢不遵依仙命勤而行之。 传道之语已命近臣录之简册，朕将亲览，其有玄旨未明者，继当请益焉。 玄风庆会录竟",
      "translated_text": "When a person has yet to be born, they abide within the Dao—neither cold nor hot, neither hungry nor thirsty, the mind free of thought—truly a state of bliss. Once born and given form, the eyes perceive colors, the ears hear sounds, the tongue savors tastes, and the mind contemplates affairs—thus a myriad concerns arise. The ancients, recognizing that the heart and intent cannot be mastered, likened the heart to a monkey and the intent to a horse, for their unruliness is plain to see. As the ancients said: *\"It is easier to tame a fierce beast than to subdue the heart of an inch.\"* This is the swiftest path to attaining the Dao and ascending to heaven.\n\nThe Daoist cultivates truth and refines the heart, thinking of nothing, like the vast emptiness or still water. When the wind over water subsides, it becomes clear and tranquil, reflecting all things in brilliance. When the wind stirs, the water roils and muddies—how then can it mirror the myriad forms? The original true nature is as still as unmoving water. Yet when the eyes see colors, the ears delight in sounds, the tongue craves flavors, and the mind clings to affairs, these senses arise in ceaseless succession, like whirlwinds churning the waves.\n\nAt first, taming the heart is exceedingly difficult. With years of practice and deepening effort, one reduces and refines until reaching non-action. Even for a single Daoist, mastering the heart is hard—how much more so for the Son of Heaven, who rules the Four Seas and daily attends to ten thousand affairs? Yet if one can moderate desires, restrain thoughts, and preserve the precepts, one may still gain heaven’s protection and preserve life.\n\nIn ancient times, the Yellow Emperor crafted bows and arrows and forged weapons to awe the world. When his work was complete, he sought the immortal Guangchengzi to inquire about the Way of nurturing life. Guangchengzi replied: *\"Do not let your thoughts run wild—this single word suffices.\"* I say that the Way of cultivating the self lies in harmony. Excessive anger harms the body, excessive joy harms the spirit, and excessive thought harms the qi—these three greatly damage the Dao and should be avoided.\n\nYour Majesty already knows that the spirit is the true self, while the body is but an illusory vessel. When seeing forms and stirring desire, one should reflect that the body is transient while the spirit is real—thus the mind can be stilled. Human life is rare and precious. Consider the birds and beasts, which bear young every year, yet most perish in infancy; few reach adulthood or old age, and the same is true for humans. Thus, twenty or thirty years is a short lifespan, forty or fifty a moderate one, and sixty or seventy a long one. Your Majesty has now entered the age of long life—you should cultivate virtue and preserve your health to attain longevity.\n\nThose who leave the household to study the Dao wear coarse clothes and eat simple food, avoiding the accumulation of wealth, for they fear it will harm the body and diminish blessings. Even those who cultivate the Dao while remaining in the world should moderate their diet, dwelling, treasures, and possessions, keeping within proper bounds and avoiding excess.\n\nBeyond the Four Seas, across the vast earth, there are countless lands—myriad in number—where rare treasures and strange jewels abound. Yet none compare to the Central Plains, where heaven has bestowed scriptures and teachings, where the arts of governing the state and cultivating the self are most complete, and where extraordinary individuals have attained the Dao and ascended to heaven.\n\nShandong and Hebei are the finest lands under heaven, yielding fine grains, vegetables, fish, salt, silk, and hemp to supply the needs of all. Since ancient times, those who have possessed these lands have become great states. Thus, successive dynasties have contended for them. Now, these regions have suffered war and fire, their people scattered and unsettled. It would be wise to appoint capable officials well-versed in local affairs to oversee their governance, granting a three-year tax exemption. This would ensure ample silk and cloth for the state and military, while allowing the common people to recover and find peace—a single measure yielding two benefits, and a means of pacifying the people and seeking blessings. Heaven will surely favor this, and all shall prosper.\n\nThough I dwell ten thousand *li* away, I did not hesitate to answer your summons. I have already spoken of the methods for cultivating the self and nurturing life—how could I withhold the Way of governing the state and protecting the people? Regarding the restoration of Shandong and Hebei, if capable officials are dispatched to implement the above measures, it will surely align with heaven’s will. But if unworthy men are appointed, it will not only be of no benefit but may even cause harm.\n\nWhen the Jin first gained the realm, they rose from the eastern lands, and the customs of the Central Plains were not yet familiar to them. They enfeoffed Liu Yu in Dongping, governing for eight years before reclaiming it—this was a sound strategy for establishing their rule. I hope Your Majesty will give this careful consideration.\n\nThe essential Way of cultivating the self and nurturing life has now been fully transmitted. As for the arts of governing the state and protecting the people, I have briefly outlined their key points. Whether to employ them or not rests with Your Majesty’s judgment.\n\nIn the tenth year of Emperor Shizong of Jin’s reign, his excessive indulgence in sensual pleasures left him weak and enfeebled. At court assemblies, two attendants had to support him as he walked. Thereafter, he sought out eminent Daoists and inquired about methods of preservation. He once summoned me to ask about the Way of cultivating truth, and I spoke to him as I have to you. Afterward, his body grew strong again, and he walked as before. He reigned for thirty years before ascending in transcendence.\n\nThroughout my life, I have studied the Dao with a heart free of thought and worry. In a dream, heaven’s intent seemed to say: *\"Your merit and conduct are not yet complete—you must await the proper time to ascend and transform.\"* This illusory body is but a borrowed vessel, like an inn where one briefly lodges—what is there to cling to? The true body can soar and ascend, transforming into hundreds or thousands, with no limit to its manifestations. In heaven, one may dwell for a thousand years or ten thousand myriad—yet when affairs arise, one receives heaven’s mandate to descend to the world, entering a womb and taking form.\n\nAfter transmitting the Way, I addressed His Majesty, saying: *\"I have earnestly imparted these teachings, and you have respectfully received them. These are difficult matters to practice—yet how dare I not follow the immortal’s command and diligently apply them?\"* The transmission of the Way was then recorded by close ministers in a book, which His Majesty will personally review. Should any profound meaning remain unclear, he may seek further instruction.\n\n*The Record of the Auspicious Assembly of the Mysterious Wind* concludes.",
      "overlap_context": "fold, and we also know that if one’s allotted cause is not yet complete, how can one suddenly return?\n\nIn my early years, I left home, and four of us studied the Dao together. Those three have already ascended and transformed like cicadas shedding their shells, casting off these mortal bones to depart. They can transform their bodies into hundreds or thousands, with no limit. I have endured countless hardships and have not yet been able to leave this world—this, too, is due to my allotted cause.",
      "start_char": 2441,
      "end_char": 3623,
      "start_sentence": 93,
      "end_sentence": 130,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.58175325393677,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\玄风庆会录.txt",
        "category": "谱箓类"
      }
    }
  ]
}