{
  "source_id": "玉清金笥青华秘文金宝内炼丹诀",
  "source_file": "chunked_daozang\\玉清金笥青华秘文金宝内炼丹诀.json",
  "total_chunks": 22,
  "total_original_chars": 16326,
  "total_translated_chars": 83127,
  "total_translation_time": 433.3104314804077,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\方法类\\玉清金笥青华秘文金宝内炼丹诀.txt",
    "category": "方法类"
  },
  "full_translation": "*The Jade Purity Golden Casket Azure Florescence Esoteric Writ of the Golden Treasure Inner Alchemy Formula*\n\n**Title:** *The Jade Purity Golden Casket Azure Florescence Esoteric Writ of the Golden Treasure Inner Alchemy Formula* (abbreviated as *The Esoteric Writ of Golden Florescence*). Originally attributed to the Perfected Purple Yang, Zhang Pingshu, though likely a later disciple’s forgery. This text is divided into three scrolls.\n\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Section of Cavernous Truth*.\n\n---\n\n**The Jade Purity Golden Casket Azure Florescence Esoteric Writ of the Golden Treasure Inner Alchemy Formula, Scroll the First**\nBy the Perfected Purple Yang, Zhang Pingshu\n\n**Memorial to the Throne**\n\nUnmindful of the axe’s doom, I dare to voice these humble and irreverent thoughts. In this world, I have known much turmoil, yet achieved nothing—surely ruin awaits. Now past thirty years, I have found solace only in the Great Dao.\n\nReflecting upon the vault of heaven, I see that what once hindered my success now aids its fulfillment. The debt of gratitude is profound; I inscribe it upon my heart and bear it with reverence.\n\nNow, I witness with sorrow: among the people below, who lacks the vessel for the Dao? They rush and toil in the dust of the world, ravaging their true essence. The more they descend, the further they stray—abandoning humanity for things, and in seeking humanity through things, they can no longer return.\n\nIf things cannot be cultivated, one ultimately becomes a stranger to one’s kind. Alas! Though I myself have not yet transcended, I pity them all the more—no different from a frog in the mud mocking the chicken on the fence.\n\nOnly yesterday did I receive the transmission of *The Jade-Clear Golden Casket Longevity and World-Transcendence Inner Alchemy Scripture of the Azure Radiance Perfected*, a text at once concise and easily practiced, detailed yet uncluttered. Within the body, it divides the lord of yin and yang; within the crucible, it establishes the pivot of the Four Symbols. The Three Centers are constantly guarded as the mechanism; the One Fixation never departs as the function. In function, there is non-function; in stillness, it endures forever.\n\nFor the wise and the refined, a single glance suffices—creation lies within the palm of one’s hand! Now, I wish to purify myself, fast, and concentrate my thoughts to render it into diagrams and discourse, leaving no detail concealed, directly revealing the profound essence of the utmost truth. I shall select what may be transmitted and transmit it, that the lamp of the heart may be passed on, flowing through ten thousand generations—what a splendid endeavor!\n\nYet at the moment of first transmission, the oath was most solemn, and my master’s charge most grave: to lightly disclose it invites punishment. Many times have I wished to proceed, only to hesitate, unable to recall how often! Prostrating myself in the dust, I turn my mind toward the upper realms, reverently considering that the Most High cherishes life and values the salvation of others above all. Thus, I bow low in humility, beseeching the Heavenly Compassion to perceive my intent. If my plea is not granted and the mysterious censure is made manifest, so be it; but if, perchance, it is deemed acceptable, may I be granted peace to fulfill this vow.\n\nAgain, I lay this before the Heavenly Threshold. I, your servant, am utterly overwhelmed with awe and trepidation, bowing my head a hundred times in deepest gratitude. Of late, I have submitted memorials...\n\nThe Heavenly Court wishes to have *The Supreme Lord of Azure Radiance’s Jade-Pure Golden Casket: Secret Essentials of Internal Alchemy for Longevity and Salvation* illustrated with diagrams and expounded in discourse, that it may be transmitted to worthy scholars. Prostrating myself in my thatched hut, I awaited the Heavenly Punishment for over thirty days. When no censure came, I dared at last to purify myself with ablutions, burn incense, and compose this work in concentrated thought over three days. I have sealed it within a bamboo\n\nMoreover, to summarize in a single word: stillness. The principle underlying stillness may likewise be understood. Like a boat sailing downstream, swift and surging, bound for some island sea—no toil is spoken of in the journey. Yet once homeward thoughts arise, longing for the peace of one’s native place, one hastens to hoist the sail, seeking a contrary wind to return. Such is the Dao of stillness. But if one has long been estranged before seeking to return, or long lost before attempting to find the way, how can stillness be attained in a single day? First, one must reflect on the cause of returning to stillness, and only then can stillness be achieved. Having awakened to past errors, one must seek present rectitude—yet where does this rectitude reside, if not in constancy?\n\nThe poem says:\nFrom the golden ladder, one falls to the azure cliff,\nRecalling the blossoms of Penglai, how many have bloomed?\nWhere now lies the great Dao of old?\nOnly wild grasses remain, a thicket of thorns.\n\n**Oral Instruction:**\nWhen a single deluded thought arises, reflect on how the mind has failed to attain stillness in ordinary times—this is the obstruction. Abandon it swiftly. With long practice, will it not become effortless?\n\nFor essence depends on qi to arise, and essence resides in the Kidney Palace, where qi blends with it. Thus, when it ascends with qi as yang-lead, this is the process. If essence is substantial yet primordial qi does not arise, and primordial yang does not manifest, what benefit is there to me? Only when primordial spirit appears does primordial qi arise, and when primordial qi arises, primordial essence is produced.\n\n**The Role of Intention as the Matchmaker:**\nIntention is not merely a matchmaker. In the Dao of the Golden Elixir, from beginning to end, its function cannot be set aside. Intention arises from the heart, yet the heart must not be carried away by intention—if the heart is led astray by intention, all is lost!\n\n**On Kan and Li:**\nKan is the Kidney Palace; Li is the Heart Field. Kan in stillness pertains to water, yet [when dynamic, it pertains to fire]; Li in motion pertains to fire, yet [when still, it pertains to water]. At the moment of their union, when the Heart Field is still and the Kidney Palace is dynamic, is this not true yang below and true yin above? Moreover, intention arises from the heart and descends directly to the Kidney Palace, while yang arises from the kidneys and ascends directly to the Yellow Court. Thus it is said: Kan and Li are inverted. If they are not inverted but proceed in sequence, the heart-fire will not be still—then the meaning of the \"fire pit of the great earth\" becomes clear.\n\nI have illustrated this in the *Diagram of Union*.\n**Commencing the Practice**\n\n**On Holding the Heart and Commencing Practice**\n\nHaving expounded the discourse on the heart, we now proceed to the method of practice, for the heart, though desiring stillness, is yet troubled by unceasing desires. These desires arise from the temperament and nature, where this nature enslaves the true nature, ever assailing the eyes and ears. For the cultivator of the elixir, once the heart is free of affairs, the temperament has no means to enslave it. Yet what enslaves the spirit is nothing but the allure of external things.\n\nDuring seated meditation, first practice the method of restraining the breath. To restrain the breath: when one breath has not yet ended and another follows, now, as the first breath arises, suppress the subsequent breath, so that it follows slowly. With time, the breath settles. Though the breath is restrained a thousand or ten thousand times, the heart must not be stirred. If the heart stirs, it will chase after the breath, and before the breath stills, the heart has already moved.\n\nBefore the words were finished, someone nearby laughed and said: \"How impractical! This man teaches a method without principle—restraining the breath yet keeping the heart unmoved. Is this not like burdening a man with a thousand *jun* and forbidding him to exert himself? Is it possible?\"\n\nThe master replied: \"Listen to me. Though you restrain the breath, if you also preserve the heart, then the heart will not move, and the breath will naturally still. Yet even if the breath is restrained, how can you ensure that desires will not arise?\"\n\nHe continued: \"When desires arise, it is because the senses are stirred by external things. In deep stillness, if the eyes perceive something, the spirit is enslaved by the eyes—hasten to withdraw and return it inward. If the ears hear something, the spirit is enslaved by the ears—hasten to withdraw and listen inwardly. The same applies to all senses.\"\n\nThe questioner said: \"I hear one and understand two. Now I grasp this principle! Though I withdraw the spirit and preserve the heart, the spirit is gathered, and the heart is fundamentally still.\"\n\nThe master replied: \"To preserve the heart is to nurture the nature. At the beginning of nurturing the nature, if you do not preserve it, there is nothing to nurture, and in the end, nothing will be perceived. Preserving the heart truly begins with gathering the heart. What is called gathering the spirit is but an auxiliary use of gathering the heart. With long practice, seeing becomes as not seeing, hearing as not hearing; form and heart forget each other, merging with the supreme Dao. Then the original nature is revealed, and the original *qi* is born.\n\n**On Spirit**\nSpirit is the original nature. In my previous discourse on spirit as the master, I have already exhausted the subject. Yet considering those who cultivate the elixir, the method of concentrating the spirit is neither hasty nor superficial. Thus, I expound further and later illustrate the spirit-chamber.\n\nTo concentrate is to unite the spirit within essence and *qi*. Essence and *qi* are inherently interdependent, and the spirit naturally clings to them. Why, then, emphasize the spirit alone? The spirit is the master of essence and *qi*. In the alchemical work of union and gathering, and in the firing process, all is done through the spirit’s use of *qi* and essence. If one first concentrates the spirit within the *qi*, the *qi* cannot settle, nor will the spirit willingly cling to it, and the medicinal substances will be harmed.\n\nMoreover, the spirit is the original nature. When the nature is first glimpsed, it is not yet stable—floating and drifting, advancing and retreating, appearing and vanishing. If you force it to concentrate, how can the nature concentrate itself? What concentrates it is the temperament’s nature. Initially, one relies on the temperament to seek the original nature—can the temperament’s nature truly pursue the original nature? Now, scholars are misled by the method of concentrating the spirit. Why? Some immortals speak of first concentrating the spirit, and thus blindly lead the masses astray. Do they not know that what they call concentrating the spirit is merely stilling thoughts and returning the spirit to the heart?\n\nIn the Dao of the heart, when the spirit returns to the heart, the complete body of the nature is revealed. Once the complete body is revealed and put to use, all is the spirit’s function. Thought after thought, it does not depart from the golden elixir. Thus, when the elixir is formed, the spirit naturally returns to it—what concentration is there? Therefore, to concentrate the spirit is to merge the spirit with essence and *qi*. When essence, *qi*, and spirit unite as one, the yang spirit is born. At this moment, this body becomes a useless thing. Who would deny it? I have heard this from my teacher, who heard it from his distant teacher, who heard it from heaven.\n\n**On the Illusory Elixir**\nThere is an illusory elixir, for those who study the Dao, ignorant of the correct principles, rashly engage in gathering and union, and thus produce an illusory elixir. The illusory elixir arises when the Heart Field is not yet stilled, and one hastily gathers the solitary yang. At this time, the solitary yang is not true yang but merely the *qi* of breath; the essence is not original essence but the turbid essence of lust; the spirit is not original spirit but the thoughts of desire.\n\nOne who has just begun to study the Dao yet desires to become an immortal—is this not desire? To unite and arouse yang through desire is the origin of the illusory elixir. The essence resides in the Kidney Palace, and if one gathers it and ascends to above the navel, yet has no place to settle it, it follows the *qi* and rests to the right of the *qi* cavity. The navel is connected to the kidneys by a thread, and when it joins with the *qi* and stops, it is called an elixir. Though it is called an elixir, when spirit and essence are employed, it is merely a postnatal substance. Where, then, is the prenatal substance? What is called the Yellow Court, the inner furnace, the outer furnace, the Mud Pill Palace, and other cavities—these only appear after the establishment of the prenatal. Where were they at that time? They did not yet exist.\n\nLike wind stirring shadows, seeking the toad in the sea, waiting by the tree for a hare, or fishing in a tree—day by day, the deception is exposed. The essence scatters and flees, and the prenatal has no master. Alas! This is not the elixir of long life but a method that shortens it. There are also those who gather *qi* and ascend to encounter the heart’s blood and *qi*; when the blood congeals into a thing, it is also called an illusory elixir. Such cases are many, and thus I cite them to dispel confusion.\n\n**The Method of Grasping the Elixir**\nThough the golden elixir resides within, can it also be lost?\"\n\nThere are such cases. Is there a method to grasp it?\nThere is.\nYet this is not the elixir’s escape.\nThe gates and doors were not secure, allowing it to depart—illusory elixirs may be lost, but how could the golden elixir suffer such a fate?\nHow does one know when the golden elixir has departed?\nWhen the elixir resides in the crucible, it is replete with the true *qi* of the Five Phases. The *qi* of the Five Phases within my body presses upon the furnace, and they resonate and stir. Should one day perceive the *qi* ascending outward while the inner resonance ceases, the elixir is no longer present.\nSwiftly, one must lay everything aside in profound stillness, relinquishing even the furnace and crucible, whether the elixir remains or not, to the realm of nothingness. After a day or a night, one may then sense its whereabouts—whether in the heart, the liver, the spleen, or the kidneys, for the elixir may lodge in any of the hundred cavities of the body.\nOnce its location is known, one must subtly and continuously preserve it, guarding it to prevent its departure. After another day, one may then gather it with intent, guiding it directly to descend into the Yang Palace. From the Yang Palace, employing the same intent as when gathering it, one follows the old path to ascend it directly into the crucible.\nSuch are the mysteries of creation—who could deny it? If there be one who speaks thus, they are my teacher.\n\nThe Discourse on Divine Water and the Flowery Pond\n\nDivine Water refers to the liquid of Wood; the Flowery Pond is the cavity beneath the qi point of the navel, between the two kidneys—a passage most resembling the Yellow Court, where the grain qi transforms into essence, known in medicine as the Essence Cavity. In the young and robust, whose yang abounds and qi flows freely, the Divine Water and Flowery Pond serve merely to irrigate the furnace and crucible, cleanse the spleen and stomach, and circulate moisture through the qi cavities. Yet for those whose primordial qi has waned and essence is exhausted, these become the very foundation of the elixir.\n\nWhen primordial qi declines, it is not the primordial qi itself that fails, but rather the qi of the material form that has been severed and lost to excess. The nature of wayward desires arises ceaselessly, the prior heaven remains unseen, and the posterior heaven proves insufficient for its purpose—thus begins the root of emaciation and infirmity. The Flowery Pond is the passage through which essence is generated and descends to the external kidneys. When qi is vigorous, essence is abundant; when essence is abundant, the Flowery Pond flourishes, and its use leaves one with surplus. But in those whose qi has withered, essence is desiccated, and the grain qi that arrives produces only a kind of sighing water, which flows back to the kidney palace.\n\nYet once I have stilled myself! Primordial qi inherently neither increases nor decreases, but the Flowery Pond is no more. The great medicine lacks one of its three ingredients, so when yang stirs but before the moment of direct gathering, intent is employed to guide it back to the Weilu, ascending straight through the Jiaji to the Mud Pill Palace. Thus, essence is drawn from the Essence Cavity, naturally rising with the qi to the Noon Palace, where it encounters the fusion of all yang—only then may essence be employed. It then descends to the heart, where mercury is gathered, and from the heart it returns downward through the Yellow Court, settling within. A single intent is then used to seal and secure it, preserving it with unbroken continuity to nurture it. The two substances within naturally consume and merge with one another, and the elixir begins to form.\n\nRecently, a school from western Zhejiang has applied this method even to the young and vigorous to congeal the elixir—yet the Dao lies near, and they seek it afar. Still, each clings to their own truth.\n\nThe Discourse on the Hundred Cavities\n\nWithin the human body, there are eighty-four thousand hair-follicle cavities and three hundred eighty-four qi palaces. The hair-follicle cavities disperse, belonging to the qi palace of the navel’s qi cavern, which also serves as the governing descent of the three hundred eighty-four palaces—while the yang palaces all become essence. The heart is the Middle Field, the crown the Upper Field; beneath the tongue lies the Mysterious Throat, within the eyes the Silver Sea; at the center of the forehead, between the brows, the balance of mouth and nose, the sides of ears and eyes, the flanks of the throat, the space within the waist and ribs—all are cavities. As for what I call the emergence of the elixir, it may be concealed in any of these cavities. How could it be said that the human body possesses only one or two cavities? These one or two cavities are the pivot of the multitude—how could they be limited to this alone? This describes the body; its application will be discussed separately in what follows.\n\n*End of Upper Scroll of The Jade Clarity Golden Casket: Secret Writ of Azure Radiance, Golden Treasure Inner Refinement Elixir Formulae*\n*Middle Scroll of The Jade Clarity Golden Casket: Secret Writ of Azure Radiance, Golden Treasure Inner Refinement Elixir Formulae*\n*Illustrated Discourse on Gathering and Refining*\n*Composed by Perfected Master Purple Yang, Zhang Pingshu*\n\nGathering involves drawing true yang from the Kidney Palace, while taking involves extracting true mercury from the Heart Field. When gathering is possible, gather—gathering must yield its use. If gathered at the wrong time, the dragon will not descend, the tiger will not ascend; though one may see blood and qi surging, rushing to and fro, the deluded will mistake this for union! Yet they know not that *li* and *kan* remain *li* and *kan*—true yang within yin and true yin within yang stand apart, unmoved. When the qi and vessels are arrested by a single thought, qi swiftly enters the meridians, and within *li* and *kan*, harm befalls lead and mercury instead. Though called \"nurturing qi,\" it is in truth the depletion of original qi at the center. Original qi in man appears only in perfect stillness—this is the qi of prior heaven. The qi of posterior heaven circulates ceaselessly, yet men, drowned in desire, fail to examine it closely. At the moment of slight composure, when the heart is free of other uses, one may then perceive the qi’s ascent and descent—yet mistakenly gather it as prior-heaven qi, thereby inviting harm. Thus do modern scholars often suffer strange ailments, all for this reason.\n\nMan’s illnesses arise solely from obstructions in qi and vessels. Qi naturally regulates itself, yet if one forces it to ascend, the spleen, stomach, lungs, liver, ears, eyes, mouth, and nose are injured; if forced to descend, it is like water breaching a long dike, rushing downward with irresistible force. How could the true substance endure? Pitying those who speak of the elixir yet harm their own lives, I place the *Illustrated Discourse on Gathering* first, though it reveals celestial secrets outright. Yet if those with aspirations for the golden elixir instead destroy their lives, I offer this correction through right principle. The Most High cherishes life and will not fault me. Thus in this scroll, I depict with the knife and spoon of mystery and yellow, the infant boy and maiden girl—all metaphors—sweeping aside delusions to retreat three leagues, so that the wise may see and grasp the *Can Tong Qi*, while the foolish, upon seeing, may dissolve their confusion like melting ice, each detail clear and bright as a mirror revealing every hair.\n\nThose who seek the golden elixir must first cultivate hidden virtue to fulfill human affairs, then hold to the previous discourse on the heart—only then will the great medicine be born and the illustrated forms appear.\n\nThe method of gathering arises from the heart, for the heart is the pivot and axis of all transformations. One must forget it to seek it: forgetting is the ordinary heart, seeking is the true heart. Yet within forgetting, a single intent to seek arises—that is the true heart. In the midst of vagueness and indistinctness, the true heart first appears. Once the true heart is seen, from this true heart generate a true intent, and with reversed light turn inward to illuminate. Then the hundred apertures will all unfold, and original essence will blossom forth! The key lies in generating being from non-being, and non-being from being. When this state is reached, even the true heart is forgotten and discarded. With nothing left to depend on, true breathing becomes continuous. When true breathing is continuous, the qi of posterior heaven settles, and as posterior heaven recedes, the qi of prior heaven appears—thus yang is born!\n\nWhen yang is born, the qi of prior heaven flows from the qi cavity into the kidneys, like bubbles welling up. Between the two kidneys runs a thread that pierces the qi cavity—this is the meridian formed at the moment of conception by one’s parents. When the qi of prior heaven courses through it, one feels this sensation, and the hundred vessels of the body all become like spring’s vitality, gradually growing in warmth. At this time, the qi of prior heaven is first established, and as prior heaven stands firm, posterior heaven retreats further. Only then may one subtly arouse the intent to gather.\n\nThis intent is born of the eyes gazing downward upon the heart, yet the heart is released and sent down into the Yang Palace. Gently gather, then release—thus yang rises. *(See \"Discourse on the First Yang.\")*\n\nThe intent to gather arises from the heart, and the heart arises from the eyes. Thus Laozi said: \"I have long observed the heart to attain the Dao\"—it is most numinous. When true breathing is settled, the inner light is the spirit-light; this heart is the true heart. The true heart generates intent, and the spirit-light illumines the heart. Hence the constant teaching: the eyes gaze upon the heart, the heart generates intent, and intent gathers lead.\n\nIf yang has not yet flourished and one hastily gathers it, the moment the intent to gather arises, posterior heaven revives. Thus the cultivation of life is fundamentally tied to the ground of nature. Nature is such that all appearances are illusory and false. Once attachment to appearances is gone, falsehood vanishes and true principle is revealed. Yet when true principle is just made clear, if a single thought arises, does this not return to the illusion of appearances? Therefore, wait until yang has grown before gathering—then it will surge upward vigorously. When the qi of prior heaven is abundant, posterior heaven has no chance to resist.\n\nThe ascent of gathering is truly extraordinary! It rises in a warm, intoxicating manner, reaching the navel before pausing briefly. When it rests just above the navel, it settles—only then is it called lead-gold. Gold generates water, thus mercury is born in the heart. The principle that clouds follow the dragon and wind follows the tiger is now manifest. When the wind is calm, rain descends, and naturally lead and mercury unite, swallowing and devouring each other. Gold generates water, water generates wood, wood in turn generates fire. Wood loves gold, yet gold despises wood—this is the way of their union. Though metal overcomes wood, how can there be love and hatred? It is simply the inherent nature of metal and wood. I employ the inherent nature of heaven, thus I use the inherent nature of the five phases—though this is but a metaphor. For where do the five phases exist in prior heaven? Yet without such analogies, the principle cannot be conveyed.\n\nOnce the method of gathering is clear and the principle of union is revealed, there remains one further admonition: gathering must not be too slow. If too slow, it will age and become unusable, and the qi of posterior heaven will mix in. Let the adept study the *Illustrated Discourse on Union*—then more than half the meaning will be understood.\n\nA poem says:\nIntoxicating harmonious qi brews the spring wind,\nA single yang is born in the midst of vagueness and indistinctness...\n\nWhere nothing gives birth to being, and form emerges from emptiness only to return to it,\nLead’s essence rises above the navel, while Mercury’s nature flows from the heart’s source.\nWithin stillness, truth appears—within truth, stillness abides.\nWhen Kan and Li unite, a misty rain descends.\n\nA poem says:\nWood becomes the Dragon, Metal the Tiger;\nKan’s gate births the boy, drawing Li’s maiden.\nTo know the workings of creation’s root,\nLook not beyond the true fire born at midnight.\n\n*Discourse on the Diagram of Union*\nVague and indistinct, yet within it lies form;\nDim and obscure, yet within it lies substance.\nThe ancient sages often used this to warn disciples—\nfor only in the state of indistinct stillness can the elixir be refined.\nWithout stillness, yang does not arise;\nafter yang arises, without stillness, the elixir does not coalesce.\nThus, when the mind first gathers lead, it must not linger—\nstillness has its time, ascent its moment.\nFor what first emerges is nothing more than a single breath.\nWhen it rises to the navel, it becomes lead—\nthen the heart’s intent must cease, for it is no longer needed.\nLead naturally draws mercury, mercury naturally seeks lead;\nwithin the vague and dim, the principle of union is complete.\n\nI have received my teacher’s oral instructions and now reveal them.\nGuard them well! Guard them well!\nRead in silence, utter no sound.\nIf one who understands the Dao—one with karmic roots—\nencounters this profound and precious teaching,\nlet them commit the oral instructions to memory but not to writing,\nor if written, let them not be shown.\nThen I shall truly be indebted to their virtue.\n\nI studied under my teacher for ten years,\nand all that I received, I now lay bare,\nwishing to share it with those of like aspiration.\nThis is the *Supreme Inner Refinement Elixir of Golden Essence and Jade Purity*,\nthe *Upper-Grade Method for Transcending the World and Attaining Immortality*.\nThe celestial laws are most strict—\nunmindful of consequences, I have composed this text.\nAfter submitting a memorial to the heavenly court for thirty days,\nI received a response before daring to set it down in writing.\nAs I wrote, my heart trembled, sweat fell upon the page,\nand tears mingled with my brushstrokes.\nMay those of true aspiration obtain this,\nand may they not implicate me—\ntogether, may we achieve the supreme fruit and ascend the immortal ranks.\n\nAlas!\nThose who know me call me anxious of heart;\nthose who do not ask what I seek.\nMay our hearts illuminate one another—\nI can do no more than earnestly implore.\nMay the immortals deign to witness this!\n\n*Oral Instructions on Gathering and Union*\nSeek within forgetting, forget within seeking;\nwithin forgetting, see—within seeing, forget:\nthen yang is born.\nForget within gathering, gather within forgetting;\nwithin forgetting, rise—within rising, see;\nwithin seeing, transform:\nthen lead is formed.\nArise within stillness, ascend within intent;\nact within forgetting:\nthen lead draws mercury.\nLead and mercury unite within,\nessence and spirit converge without:\nunion is achieved.\nLead, mercury, essence, and spirit merge as one—\nthen direct a single thought to descend to the Yellow Court,\nreturning to the crucible.\n\n*The Innermost Oral Instruction*\nTo fuse lead and mercury, use a single intent.\nTo gather the first yang, stillness must give birth to stillness.\nNo wonder Lü [Dongbin] often spoke in riddles—\nyet still, disciples remain lost and deluded.\nSo much said—yet this is all.\n\nHark! Flowers scatter like stars across the sky,\nbefore the gate, the stream’s murmur fades—\nthe green boat bears the green maiden away,\nand in an instant, the green boat returns alone.\n\nThe green maiden dwells within me—\nclouds rise o’er Wu Gorge’s twelve peaks,\nin the deserted palace, flutes fall silent,\nthe star bridge lies beyond the blue mountains,\nand if you seek reunion, you shall never meet.\nThis is both nature and destiny.\n\nSomeone asks: What is *jiaogou*?\nThe Master replies: The aperture beneath the heart in the *Caiqu Tu* is the place of union. It cannot be sought through form, nor grasped through formlessness. Only when lead ascends does yang qi rise above.\n\nFrom the qi cave, it descends to the Palace of First Yang—\nI gather it with intent.\nAs mercury descends, they meet,\nqi sinking into [the aperture].\nFor when mercury and lead are born,\nlead ascends above the navel,\nillumined by the radiance of essence—\nthus it is called *lead*.\nLead is like the body, mercury like the shadow;\nwhen the body moves, the shadow follows—\nso mercury descends in response.\n\nThe ascent of yang lead cannot be called pure yang,\nfor it contains the radiance of essence—thus it is also yin.\nThe descent of yin mercury cannot be called pure yin,\nfor the heart generates mercury, and the heart is spirit.\nWhen mercury encounters the radiance of spirit, it becomes usable—\nthus it is also yang.\nWithin yang there is yin, within yin there is yang.\nThe two qi intermingle, congeal, and coalesce,\nforming the Mysterious Pearl, like a grain of millet.\n\nSomeone asks: Lead is the first yang—\nthe first yang is nothing but primordial qi.\nThen what is mercury?\nThe Master replies: Both lead and mercury are primordial things.\nLead is primordial qi, mercury is primordial numen.\nThis qi is the mother of destiny,\nthis numen is the child of nature.\nOne may call them lead and mercury,\nor nature and destiny—\nwhich of the accomplished patriarchs would reveal this so plainly?\n\nAnother asks: What is this aperture beneath the heart?\nThe Master replies: It is the *Hundun* Spirit Chamber,\nformed by the qi of essence-light and eye-light—\nessence-light surging upward as [yang],\neye-light descending as [yin].\nThough essence is primordial essence,\nwithout the essence of daily use, primordial essence cannot appear.\nIf you doubt this, consider:\nwhere there is water, mist rises as white qi—\nhave you ever seen white qi rise from dry earth?\nWater is essence, white qi is its radiance.\n\nThough spirit is primordial spirit,\nonly when the spirit of daily use is not enslaved does primordial spirit manifest.\nLike the bright moon in the sky—\nonly when clouds disperse does its light shine down.\nPurity is the absence of clouds,\nriding the light is its illumination.\nThough essence belongs to yin, its radiance belongs to yang;\nthough eye-light belongs to yang, when it shines inward, it too belongs to yin.\nWhen radiance and light meet, they form an aperture—\nqi responds to qi, drawing the two substances to converge within.\nAll things come into being through essence and qi,\nthrough primordial qi.\nWhen the work is complete and the effort full,\none becomes a True Person.\nFor the intent of ceaseless generation resides here—\nthis is why it is numinous and divine.\n\nShould one ask: Once the union is achieved, how does this pearl descend into the Yellow Court and return to the crucible within?\n\nIt is said: When the two substances gather, emotion and nature unite, and the Five Phases are complete—like the tiger returning to the mountain, the dragon to the abyss. The eye’s light turns inward, and essence-qi is restored here, descending into the Yellow Court, returning to the crucible within. At the moment of convergence, there is a pivot, a hinge—vague yet luminous, as ten thousand pores burst into spring. Secret, secret, secret.\n\nThese words are not found in the original classics; they are what the adept has realized.\n\nShould one ask: Yang arises above—if one abruptly halts its ascent, how can one ensure it will not descend again?\n\nIt is said: A profound question! Below the Yellow Court lies the gate of the Cinnabar Chamber. When intent arises, yang ascends; when intent ceases, it unifies—thus yang cannot descend. The furnace and crucible reside within this unity, belonging to Earth, and thus embody the upright qi of the Five Phases, completing the full form of Heaven and Earth.\n\nShould one ask of the method of furnace and crucible:\n\nIt is said: The Yellow Court within the human body is thus—when the first yang ascends, and the moment this pearl descends into it arrives, *this* is the furnace and crucible. The Yellow Court is inherently Earth. As for the center within the center, it is Earth within Earth. Thus, when the pearl descends into it, it forms the crucible vessel. The Five Phases each strengthen their foundation—what does \"strengthen their foundation\" mean? The mother seeks the child, the child clings to the mother—this is the method of the Elixir. All rely on their inherent nature. Once returned to the crucible, each qi follows its course, like the child clinging to the mother. In quiet sitting, when the spirit’s light descends, it returns to the crucible; when essence’s radiance ascends, it does the same. In walking, standing, sitting, or lying down—like the dragon nurturing its pearl, like the hen brooding her egg—each qi returns to it. All the meridians of the body become thus. The key lies in neither forgetting nor forcing growth.\n\nO students of the Dao—is it so? Or is it not?\n\nIn my method of the Elixir, it is thus and no more.\n\nA poem says:\nWhy trouble with the Maiden and the Infant?\nI speak to you with utter clarity:\nWhere Heaven and Earth reverse within the body,\nThe sun and moon revolve within the flask.\n\nKnow that the One is the function of yang—\nyou must recognize the One as the pivot of qi.\nHeaven bade Purple Yang to reveal it all—\nwhy seek another master thereafter?\n\n*The True Diagram of Heaven’s Mechanism Leaked*\n\nHaving reached this state, having grasped this principle—do not rejoice too soon.\n\nHmph! You still do not know how to contemplate it.\n\nA treasured sword lies buried by an ancient prison’s side.\nNightly, rainbow light surges upward to the sky.\nTiger and dragon battle—once the Three Fields grow still,\nWhere then to seek your mercury and lead?\n\nHa-ha-ha! Hee-hee-hee!\nBeware mistaking deer for horse—\na single Mysterious Pearl lies deep in mud.\nBy Oxherd and Weaver’s bridge, the path is blocked;\nthe River Chariot’s passage leaves no trace behind.\nWho dares inquire of the true message?\nOnly the Wind of Xun, blowing through the layered passes, suffices.\n\n*Discourse on the True Diagram of Heaven’s Mechanism Leaked*\n\nOnce the diagram of the Golden Elixir is complete, lest the celestial mechanism remain too deeply hidden, let us discuss the inversion of the Five Phases, describe the flow of water and fire, clarify the advance and retreat of medicinal materials, and embody the cyclical movement of sun and moon.\n\nAll that needed saying in my three previous essays has been said.\nYet fearing that students may still not grasp it, I have written this book.\nThis book lays bare the celestial mechanism, revealing even the finest detail—\ntransforming stubborn stone into gold, transmuting shards into jade—\nno exaggeration here.\n\nThe two eyes are the dwelling where spirit is enslaved;\nwherever one gazes or looks, spirit cannot depart.\nThe two ears are the place where spirit is sent forth—\nsounds from a hundred leagues away enter the ear, and spirit follows, then leaves.\nThe two nostrils are the station where spirit is wearied—\nwho but spirit discerns and distinguishes with each breath?\n\nIf only the eyes, ears, mouth, and nose were like the brows,\nwould not spirit then rest and remain whole?\nThus, one would no longer be bound by the postnatal,\nnor need to labor in cultivation.\n\nIn general:\nForget the eyes, and spirit returns to the crucible, illuminating within—\nfor in the state of continuous, subtle presence, the eyes lower and gaze downward.\nForget the ears, and spirit returns to the crucible, hearing within—\nfor in the state of continuous, subtle presence, the ears listen inwardly below.\nForget the nose, and spirit returns to the crucible, drawing breath within—\nfor when true breathing is settled, qi returns to the Ocean of Origin.\n\nSpeaking as one, when all are forgotten, all return to the crucible and unite within.\nIs there yet another oral instruction?\nThe oral instruction—\n\nThe hen can brood her eggs with her mind ever attuned.\nSomeone asked: \"In the Dao of the Golden Elixir, the ears, eyes, mouth, and nose have already been discussed, and the heart’s role is self-evident. But what of the liver, gallbladder, spleen, stomach, and lungs—are these truly useless organs? Or do they, too, hold use within their seeming uselessness?\"\n\nI answered: \"This principle is only understood upon reaching that stage. Yet I have vowed to conceal nothing—what could I possibly hide? When I first sought my teacher, I too asked this. My teacher bestowed upon me a poem, saying:\n\n*At first, I did not grasp this truth,\nBut once I reached this field,\nI knew my teacher had not deceived me.*\n\nNow, I shall reveal what my teacher left unsaid. The functions of the Five Phases cannot lack even one. Thus, in the state of continuous, subtle presence, the spleen’s *qi* and the stomach’s *qi* intertwine and return to the heart’s thread; the liver’s *qi* and the gallbladder’s *qi* intertwine, then the large and small intestines connect to the kidney’s thread; the lung’s *qi* submits to the heart’s *qi* and communicates with the nose. This *qi*, in the stillness after settling, is the primordial *qi* circulating—from east to west, from south to north.\n\nThe southwest is the meeting place of *qi*. When *qi* converges here, it then passes straight through the spine to the upper and middle *dantian*, descending to the kidney palace. Between the two kidneys lies a strip called the *Bridge of Life Governance*. As Cold Mountain said: *'Above is the cave where spirits gather; horizontally lies the Bridge of Life Governance.'* When *qi* descends here, yang *qi* and essence *qi* surge upward, merging with this *qi* as one. Then, they encircle the crucible’s exterior, and with daily use, they daily increase. Through the power of cultivation, the *yin* and *yang* banks take form here.\n\nSuddenly, something transcends and emerges—neither inside nor outside. The matter of the Golden Elixir is self-evident without words. Half is the profound within the profound; what is the other half? It is this: when a cultivator of the Golden Elixir reaches this point, they have attained half. That which transcends and emerges is the *Mysterious Pass*, the single aperture. Vast without exterior, minute without interior—within the formed, within the formless. First, seek the formless within the formed: this is seeing *nature* through *life*. Then, seek the formed within the formless: this is seeing *life* through *nature*. To begin with *nature* is difficult; to begin with *life* offers a starting point. Though ten thousand miles may seem distant, there is a path. To begin with *nature* is like grasping the moon in water. Yet in the end, success is the same. Those who begin with *nature* may even surpass! They use *nature* to govern *life*, while I use *life* to govern *nature*—thus, it is not for me to lightly judge. Those who fail to reach this through effort understand only the surface. Without seeing, one need not cling to existence, lest they fall into attachment.\"\n\nSomeone else asked: \"In your diagrams, there are many apertures—why?\" I answered: \"These apertures are not those in the *Gathering and Union* diagrams. For the Dao is the interplay of *yin* and *yang*, boundless in its coming and going. When employed, it fills the entire body. When unused, it retreats to the side of the heart-field, leaving no form or image. What is it, then? It is the master of returning intention. Left belongs to *yang*, right to *yin*—secret, secret, secret, secret—only here is the return to the Great Ultimate.\n\nTo return to the *Great Simplicity* is from the Great Ultimate; to return to the Great Ultimate is from the *Great Harmony*; to achieve the *Great Harmony* begins with *yin* and *yang*. Thus it is said: *'When yin and yang harmonize, wind and rain come in season, and fine grain grows.'* This is the analogy.\n\nThe *Great Expansion* is fifty. Heaven’s number is one, earth’s is two; heaven three, earth four; heaven five, earth six; heaven seven, earth eight; heaven nine, earth ten. *Yang* is odd, *yin* is even. Heaven’s numbers total twenty-five, earth’s thirty, together making fifty-five. The number of the *Great Expansion* is fifty, minus five to represent the Five Phases—this corresponds to the crucible’s interior and exterior. Then, subtract one more to symbolize the unmoving Great Ultimate, leaving forty-nine in use. Subtract one more to form the *yin* and *yang* banks, leaving forty-eight in use.\n\nThe practitioner’s method of the furnace, crucible, and firing employs the four trigrams as the foundation and the sixty-four hexagrams as application, focusing on *Qian*, *Kun*, *Kan*, and *Li*. Using the *Great Expansion* diagram to seek its imagery, the principle of circulation becomes clear, and the method of the *Celestial Cycle* is revealed. If still unclear, consult the *Discourse on the Furnace and Crucible*.\n\n*A speck of toad-light illumines the great void,\nThe golden toad in water inhales and exhales.\nHigh and low remain but pure yin’s body—\nWhy does generating yang require surplus?*\n\n**Discourse:**\nThe great void is vast and boundless; the bright moon shines alone. Snow-like waves surge, and the golden toad radiates. People see the moon’s brightness and call it *metal essence*—when essence flourishes, the moon shines. But who knows that the Golden Elixir’s generation arises from *nature*? Water symbolizes the *Kan* palace; the golden toad symbolizes the single aperture of true *yang*; primordial *nature* symbolizes the moon’s function. When *nature* first appears, it is star-like, round and luminous. Yet this is not yet the full manifestation of *nature*—only when the *qi*-based *nature* briefly stills does primordial *nature* slightly emerge. Like the moon appearing when clouds part, or vanishing when they close, if not constantly preserved, it may disappear, no different from when it was unseen.\n\nThus, when a cultivator of the Golden Elixir clearly sees this thing, primordial *qi* is born! They must then employ it—like spotting a thief and seizing them, lest they escape again. Yet when gathered into the crucible, this speck of true primordial *qi* can never depart. Take the *dantian* as the sun and the heart’s primordial *nature* as the moon. The sun’s light naturally reflects upon the moon. After union, the precious body gives birth to metal.\"\n\nThe moon receives the sun’s *qi*, thus on the third day a single yang arises. Once the elixir resides in the crucible, one feels a speck of numinous light constantly illuminating the heart, without distinction of day or night. On the eighth day of the moon, a single yang is born, and the second yang emerges. The second yang signifies the elixir’s *metal-qi* growing slightly stronger, while primordial *nature* becomes slightly manifest. From the second yang’s birth at the moon’s fullness, the third yang becomes pure. The third yang pure means primordial *nature* is fully revealed—precisely what was earlier called \"within the formless.\"\n\nWhen the first yang arises purely, one merely senses something within the body, now luminous, now hidden. When the second yang is born, the entire body radiates light. When the third yang arises, the light is neither within nor without; one feels this body as if suspended in emptiness—no body, no emptiness, no sun, no moon. To abide thus constantly is *dhyāna-samādhi*. Yet if the elixir cultivator clings to existence and fails to gather true emptiness, they cannot employ the *wu* (non-being).\n\nHaving reached this stage, the Golden Elixir is half-complete. Why? Because primordial spirit is now visible, yet it has not returned to the elixir, merging essence and *qi* into one—hence it remains half. Let us now speak of the latter half’s principle: once the moon is full, on the sixteenth day a single yin arises. The first yin marks the beginning of *nature* returning to *ming* (destiny/life). From the first yin’s birth to the twenty-third day of the moon, the second yin emerges. The second yin signifies *nature* returning to *ming* by two-thirds. From the third yin’s birth on the thirtieth day, the three yins are complete. The third yin means *nature* has fully returned to *ming*. When *nature*’s entire body is revealed, its continuous, subtle presence constantly reverts within *ming*.\n\nInitially, *ming* seizes *nature*’s wholeness; then *nature* settles *ming*—this is the celestial mechanism of *nature* and *ming*, the very meaning of \"dual cultivation.\" The celestial mechanism is most profound; I have fully disclosed it. At this point, the Golden Elixir is complete.\n\nBeginning with the fire-phase, each day’s work nourishes it day by day. With a hundred days’ effort, the *spiritual infant* is born. Thus I use the moon as a metaphor, drawing on its principle of mutual illumination and union. The moon’s brightness truly originates from metal; metal’s *nature* truly arises from the moon. Refined a hundred times, it grows ever firmer, indestructible through ten thousand kalpas. For metal is the sun’s color, the moon’s *nature*; fire is the *qi*. When metal enters fire, it returns to primordial *nature*’s truth, enabling refinement into the supreme treasure, called *Golden Liquid Returned Elixir*.\n\nThus, those who refine the elixir first gather metal, for metal generates water. The principle of union is manifest, relying on earth to complete it. The city walls’ foundations and embankments all depend on the true golden medicine to firmly secure the dike. Refined into pure gold, it is called the *Golden Elixir*.\n\n**Diagram of the Crucible and Furnace**\nThe crucible and furnace’s form is thus distinct:\nThe eight trigrams crisscross, their use intimate.\nRefining the Five Phases all relies on earth,\nTransforming true earth into true gold.\n\n**Discourse on the Crucible and Furnace**\nThe crucible is neither gold nor iron;\nThe furnace is neither jade nor stone.\nThe *Yellow Court* is the crucible,\nThe *qi*-cavity is the furnace.\nThe *Yellow Court* lies directly above the *qi*-cavity,\nInterwoven with channels—this is the crucible and furnace.\nYin and yang are the charcoal,\nFor steaming and refining.\n\nWithin the human body, the *Yellow Court* is where, at the moment of union, primordial *qi* arises. At this instant, the gate opens and the elixir descends within, whereupon it is secured. This is like mercury filling a gourd, its mouth sealed and placed in deep water. Mercury is lead and mercury; the gourd is the *Yellow Court*; the deep water is *qi*. Sealing the *Yellow Court* conceals the elixir’s mother, placing it in the *qi*-convergence site. Those who understand will examine this and grasp its essence.\n\nWhen the tiger roars, wind arises; when the dragon intones, clouds gather. The cricket sings in autumn; the clam and oyster reveal yin. Myriad *qi* return to the crucible, sealing it ever more tightly, refining it ever more firmly—this is why the crucible and furnace exist.\n\nThe essentials of ten thousand elixir scriptures, with diagrams and images, are meant to enable one to grasp the image and forget the words. Later scholars, clinging to images in search of truth, each seek abstruse theories, unaware that the supreme Dao is not complex—its pivot is merely yin and yang. Whether speaking of \"Heaven’s one generating water\" or other numerological principles, it merely clarifies the circulation of water and fire. Whether referring to the four seasons and eight solar terms, it merely illustrates the waxing and waning of heaven and earth’s yin and yang. Concealing the mother while speaking of the child, few truly understand. Thus, in writing this book, I discard branches and leaves to speak of the root. With the root present, branches and leaves naturally flourish. The ancients did not wish to speak, yet I have spoken. Daoist adepts should grasp this intent and not regard it as a minor teaching. Following this, one may ascend to immortality in an instant.\n\nSomeone asked: The crucible and furnace’s form is clear—may we also hear of their function?\n\nBetween heaven and earth, the myriad grasses and trees, all things differ, yet after the winter solstice, when yang stirs below, withered trees flourish anew, grasses sprout, hibernating creatures stir, and all things rejoice. Does creation have a mind to generate the myriad things? Do the myriad things have a mind to await creation? It is merely the movement of a single *qi*, to which the myriad things respond. Heaven—what mind has it? Things—what mind have they?\n\nWhen the hundred grasses bloom and bear fruit, it is precisely the time when medicinal substances circulate; when leaves fall and fragrance fades, it is precisely the time when medicinal substances return to the root and restore life. This may illustrate how the ancients likened the production and descent of medicinal substances to the formation of the elixir—nothing surpasses this. Yet one must not cling to the notion of \"no-mind,\" allowing them to float and sink of themselves, nor must one cling to the notion of \"mind,\" driving and chasing the fire.\n\nAbide continuously as if present—know its absence, guard its presence; know its darkness, guard its brightness. Within stillness, enact the fire-times; within stability, congeal the returning elixir. Bestow it with the center.\n\n**Diagram of the Spirit Chamber**\nHaving expended all effort to congeal and complete it,\nTurn the light inward to illuminate the scene clearly.\nBefore the master arrives, who can conceal it?\nHearing the Dao, the numinous light rides the Crimson City.\n\n**Discourse on the Spirit Chamber**\nThe Spirit Chamber is the chamber where the original spirit resides—this is the *yin’e*. People know the creative transformation of establishing the *yin’e*, which is manifest and revealed. Yet they do not know that a chamber without a master is of what use as a chamber? Though the master is absent, the embryo of the master already lies within this chamber. It is like pregnancy: over ten months, when the mother breathes, so too does the child; when the mother inhales, so too does the child—only the *qi* is not yet sufficient. When the *qi* is full and the form complete, a single spark of numinous light enters within, and suddenly there is birth and crying, wholly and purely human. This is the time when the *yin’e* is formed and the spirit returns to the chamber.\n\nWhen the spirit returns to its chamber, it is said: \"Obtain the One, and all affairs are complete.\" After intercourse, the spirit’s light rides and illumines the mysterious pearl; essence and brilliance ascend and are produced from the mysterious pearl. True lead is the original *qi*; essence, *qi*, and spirit already have an embryo within. When the fire is sufficient and the *qi* abundant, the original essence, original *qi*, and original spirit all merge into one—thus the infant is born. But is the infant born at once? Only when the fire has smelted away the yin of the grasses does the embryo begin to detach. At this point, the infant is truly born.\n\nI have often said that the diagrams of elixir-refinement drawn by the ancients are indeed the *yin’e*—this single point is to be settled within it. Later scholars, seeing the *yin’e* and knowing the point is to be settled within, yet remain ignorant of the way to settle this point within. Temporarily congealed, it ultimately disperses; fierce fire burns in vain, and the *li* and *kan* escape.\n\nThis point, produced externally and following the posterior heaven, becomes one generating two, two generating three, three generating the myriad things—all proceed from this. Ordinary people act upon it with intent, yet reverse the process. Produced internally, the Way of long life and enduring vision is preserved—is this not returning to the root and restoring life? The reason life is restored and the root returned lies in deep roots and firm stems.\n\nThe Way of deep roots and firm stems begins with settling the mind and dispelling desires. The principle of settling the mind lies in withdrawing from sight and sound. Confucius said: \"Look not at what is contrary to propriety; listen not to what is contrary to propriety; speak not what is contrary to propriety; make no movement that is contrary to propriety.\" This is the true principle. Yet Confucianism seeks to act in the world and serve the times, thus using propriety as its boundary.\n\nThe so-called deluded mind consists of joy, anger, sorrow, and pleasure. Loyalty, forgiveness, compassion, deference, sympathy, reverence, respect, and caution constitute the true mind. For those who refine the elixir, the true mind and deluded mind are merged, returning to the origin and tracing back to the beginning. From within the absence of deluded mind, a single true thought arises—striving through the heavens and earth with effort, ultimately reaching effortlessness.\n\nAs for the \"true mind\" of the Buddhists, it differs again: letting go of the six emotions, utterly without a single thought, the nature-ground is vast and empty, and the true origin appears of itself. In the instant of its appearance, there is free coming and going. At the extreme of stillness, reaching the utmost extreme, one sees the Great Ultimate. It requires but a word or half a phrase—like dying once and being reborn—before one can grasp the supreme mechanism of creation and become the root of neither birth nor death. How easily can one glimpse its gate?\n\n**The Jade Purity, Golden Coffer, Azure Florescence Secret Writings of the Golden Treasure Inner Refinement Elixir, Concluding Scroll**\n\nThe first quarter [of the moon] must be short, the latter quarter long;\nWithin water, the lamp’s flame shines of itself.\nDay and night, the *xun* wind blows without extinguishing it—\nStir the heart to move it, and it grows yet more radiant.\n\n**Discourse on the Fire-Times Diagram**\nThe *Book of Changes* contains three hundred and eighty-four lines; the number of the fire is three hundred and eighty-four *zhu*. Thus, abandoning *qian* and *kun* as the crucible and furnace, *kan* and *li* as the external medicinal substances, the first day uses *zhun* and *meng*, the second *xu* and *song*, the third *shi* and *bi*, the fourth *xiaoxu* and *lü*, the fifth *tai* and *pi*, the sixth *tongren* and *dayou*, the seventh *qian* and *yu*, the eighth *sui* and *gu*—and the metal weighs half a *jin*. The ninth day uses *lin* and *guan*, the tenth *shike* and *ben*, the eleventh *bo* and *fu*, the twelfth *wuwang* and *daxu*, the thirteenth *yi* and *daguo*, the fourteenth *xian* and *dan*, the fifteenth *feng* and *dazhuang*, the sixteenth *jin* and *mingyi*, the seventeenth *jiaren* and *kui*, the eighteenth *jian* and *jie*, the nineteenth *sun* and *yi*, the twentieth *guai* and *shen*, the twenty-first *cui* and *sheng*, the twenty-second *kun* and *jing*, the twenty-third *ge* and *ding*—and the water weighs half a *jin*. The twenty-fourth day uses *zhen* and *gen*, the twenty-fifth *jian* and *guimei*, the twenty-sixth *feng* and *lü*, the twenty-seventh *xun* and *dui*, the twenty-eighth *huan* and *jie*, the twenty-ninth *zhongfu* and *xiaoguo*, the thirtieth *jiji* and *weiji*.\n\nIn an instant, it completes a cycle, cycling without end. From the movement of the sun and moon, the alternation of cold and heat, the blending of heaven and earth, the transformation of the myriad things into harmony—reversing creation, overturning *qian* and *kun*, stealing from the cosmos, robbing yin and yang—only those who comprehend the world’s utmost subtleties may speak of this.\n\nSome may ask: \"The forms of *Qian*, *Kun*, *Kan*, and *Li*—these are the timings of the celestial cycle of fire and *qi*. When *Kan* and *Li* unite, *Qian* and *Kun* converge! The Dao of Heaven descends, the Dao of Earth ascends—this is the function of *Qian* and *Kun*. *Kan* is *Qian* uniting with *Kun*, and *Li* is *Kun* uniting with *Qian*. The other hexagrams merely establish form; one must not rigidly seek the lines and images, for only then does the method of fire and *qi* become apparent.\"\n\nAnother says: \"By your words, it seems no more than encompassing Heaven and Earth, circulating the sun and moon. Yet the *Furnace and Cauldron Diagram* arranges the eight trigrams within the cauldron, and the *Fire and Qi Diagram* elevates the *wu* position to the *Niwan* palace, laying a level bridge between *mao* and *you*. Why is this?\"\n\nI reply: \"The celestial mechanism was never meant to be revealed, but since words have come to this, why conceal it further? The River issued the Diagram, the Luo issued the Book—Heaven itself disclosed these, let alone man!\"\n\nThe guest says: \"Enough.\"\n\nI have heard that revealing celestial secrets brings calamity upon nine generations, yet have I not also heard that saving one person brings blessing upon nine generations? With my method of the Elixir, I conceal nothing and transmit it fully to those of karmic affinity. If even one faithful practitioner attains immortality, how could I have no merit?\"\n\nThe guest says: \"Your intent is beyond what I can fathom.\"\n\nI say: \"This furnace, this cauldron—these are but the principles of advancing fire and water. Water and fire are nothing more than *qi*. When *qi* ascends, I meet it with the mind—this is fire. When *qi* descends, I sustain it with stillness—this is water. In this state of unbroken continuity, the work of advancing at *zi* and *wu* is applied. At this moment, the time of the crescent-moon furnace arrives.\n\nWhen innate nature appears, *qi* is born; when *qi* is born, metal is born; when metal is born, *qi* multiplies; when *qi* multiplies, metal flourishes ever more. These two interact in mutual function. When metal flourishes within, it pierces the floating clouds, revealing a sliver of true nature—bright as the moon: this is the crescent-moon furnace. With prolonged nurturing, metal and *qi* grow abundant and complete, illuminating a full orb of bright moon—this is the fullness of nature. Once the full nature is seen and metal-nature is returned, my body is wholly governed by true nature and life. This is the time to apply fire.\n\nFor before these two merge as one, fire is used to refine them, forging pure gold. Encompassing nature and life, the entire body becomes yang, floating and sinking at will, cherishing the sun and moon, delighting in roaming the crown gate. When the time comes, the Dao is accomplished—with a sudden burst, a thunderclap resounds, and the body is no longer one’s own.\n\nAlas! Every person could succeed thus, yet those who abandon themselves—how pitiful they are!\"\n\nWhen I survey the entire work, once the nine cycles are complete, the bathing finished, and the fire’s power exhausted, not a single star is extinguished—then a single breeze stirs to fan it. This *xun*-wind is but a slender thread beneath the crucible. When closed, it is *qian*; when opened, it is *xun*. Closed, it exhales; opened, it inhales. How does it open and close? Nothing but the mind’s intent makes it so.\n\nSome may ask: *Xun* is the position of the west—yet by your account, *xun* resides in the central palace. Have you not reversed them?\nI say: The west is *xun* in function; the central palace is *xun* in essence. When an intent arises from my heart and descends to the *xun* position, its image begins to open—thus my words truly encompass both essence and function.\n\nNext comes *qian*. *Qian* is metal, and fire is the essence of metal; when they meet, blazing fire spreads. It must be tempered by *kan*, yet if *kan* cannot restrain it, the fire may turn and attack below. Thus it is halted by *gen* and exhaled by *xun*. The upper line of *xun* belongs to yang; without yang, fire cannot be stilled. When it encounters *zhen*, the flame flickers; when it meets *li*, it blazes anew. It is then halted by *kun*. *Kun* is water, and fire arises from water—if it encounters *dui*, it ceases of its own accord. *Kun* is not a primary trigram, so it gradually returns to *dui*, which is also the trigram of the west. Thus, from the *weilü*, it slowly ascends to the *niwan* peak, the Gate of Heaven, the place of true noon. Noon belongs to fire, and the fire grows ever brighter. Then it is met by the heart—fire of the heart, the meeting being spirit, thus spirit-fire—brightening further still.\n\nIf at *mao* and *you* it were to descend directly, punishment and virtue would stand at the gate—how perilous! Therefore, one path divides into two. Today’s *mao* and *you* are yesterday’s *kun* and *gen*. Fire is *qi*, and the principle of *qi* is to descend and then ascend. Thus it returns to the kidney palace, transforming into true water, and is put to use.\n\nGentle fire is yielding in nature and difficult to transform; when it encounters *mao*-wood, wood must overcome earth, so fire is used to overcome wood, and earth is no longer subdued. Fierce fire is strong and easily transformed; descending from *you*, *you* belongs to metal, and metal generates water, so water returns to the crucible.\n\nOne asks: What is gentle fire? What is fierce fire?\nI say: Gentle fire rises from the Three Passes to the heavens. Fierce fire is the fire of the noon palace and the heart.\n\nIn all the firing process, this is the moment of greatest danger. The alchemist must prevail in a single battle, and the world will be settled. The daily cycle of celestial firing must not be taken as a fixed rule—yet neither should this be clung to, nor that. Rejoice, rejoice!\n\nAs auspicious clouds part, the primordial vastness appears;\nDimly in the void, ancestors seem to appear.\nWhen the wind stills, the Seven Stars remain in the water;\nFaintly, lingering echoes drift through the sky.\n\n*Yin Exhausted Diagram*\n*Discourse on the Yin Exhausted Diagram*\n\nOne day, Master Zhang sat in a secluded chamber, his form forgotten and his qi transformed. Suddenly, a wind arose in both ears, and he first became aware of the autumn cicadas’ cries. Across the river, the verdant willows seemed to carry the lingering echoes of celestial flute music from the nine heavens. In a daze, he perceived a figure standing beside him—its ears, eyes, mouth, and nose identical to his own. Pointing at Zhang, it cursed: \"Since the primordial chaos of *Taiyi*, I have served you without a moment’s respite. What crime have I committed against you?\"\n\nMaster Zhang could not help but laugh soundlessly and said to it in silence: \"Come, let me speak with you. What you say is true, but tell me—have you suffered for me, or have I suffered for you? Sit for a while, old friend.\" The figure replied: \"From the beginning, I had no cares. After dwelling with you, waking or sleeping, I have been bound to you. Through countless kalpas, I have lost my freedom. You placed me in the deserts of wind and frost, then bade me return east, then west—endlessly tormenting me. Only recently have I been sheltered in a chamber of wisdom, nurtured by regulated breathing. It is good, yet too late.\"\n\nZhang said: \"This is not my fault, but the doing of the six thieves of desire. You are subtle and hidden, while they are manifest and conspicuous. I knew of them but not of you—like a blind man in a boat, aware only that it travels a thousand *li* each day, yet unaware of the labor of the one who poles it. If the boat were not set in motion, the poler would be at ease!\"\n\nThe figure resembling Zhang rejoiced: \"I nearly lost you! I possess a blade tempered a hundred times—together, we can exterminate these thieves and root them out.\" Later, when they entered the alchemical crucible, they would ascend alone to the Golden Gates. Zhang replied: \"Indeed, indeed.\"\n\nThen, yellow light burst forth in all directions, and the five colors shone brilliantly. Those who witnessed it heard these words: \"The way to expel the thieves must not be rushed. Haste invites counterattack. If your strength is insufficient, disaster is certain. Let the remaining thoughts roam freely, but guard them with constant care. Though they may assume cunning forms, regard them as nothing. One battle settles the Three Pure Ones, and all demons are cast aside.\"\n\nAlas!\nIn those days, the winds of the world raged in vain,\nNow waves are stilled, the sea is calm, and peace presages ascent.\nPitiful are those who fail to grasp the cycles of fortune,\nStill brandishing their weapons, watching over my city.\n\nAlas!\nThe flames of ignorance burn without smoke,\nYet warmth arises from the true solar essence, piercing the heavens.\nWith a thunderous crack, the perfect elixir is born,\nSoaring through the skies to pay threefold homage before the Jade Emperor.\n\n*Yang Pure Diagram Discourse*\n(No further text—what is there to see?)\n\n*On the Essentials of the Golden Elixir*\nMan’s body, vast yet ungraspable as heaven and earth, encompasses the ten thousand things, its transformations unfathomable, its numinous subtlety profound. Yet the common people use it daily without awareness—thus the Way of the Golden Elixir is rare indeed!\n\nThe Way of the Golden Elixir values the medicinal substances, which reside in essence, qi, and spirit. Spirit begins with the radiance of spirit-light; essence begins with the essence of vitality; qi is the primordial qi. Essence is not full without qi; spirit is not replete without qi. Essence fuses through qi; qi functions through essence. Qi manifests through spirit; spirit operates through qi.\n\nLet us speak of the body’s heaven and earth: After the Great Ultimate divides, the Two Modes are distinguished. The Two Modes generate the Four Images, the Four Images generate the Eight Trigrams, and with the Eight Trigrams established, the Way of heaven, earth, and man is complete. Heaven takes movement as its essence; earth takes stillness as its essence. The qi of heaven and earth ceaselessly intermingles, with the sun and moon traversing between them.\n\nAfter our parents shaped and nurtured us, the meridians first formed. Once the body was complete, the finer channels emerged, reverting to the emptiness of original nature. The pathways of the valleys and sinews resemble the lush growth of grasses and reeds. This is the primordial qi, the Way of the primordial—these are the most precious words of the golden treasure. One must guard it with the center, that the pathways may be unimpeded.\n\nMan receives the central harmony of heaven and earth at birth—this is called *ming*. Born of the central qi of heaven and earth, one becomes human. Taking the body as heaven and earth, one must also hold to the center as the pivot of creation. The center has three centers: the heart’s center of intent, the navel’s crucible, and the kidneys’ furnace. Of these three, the heart’s center of intent is most crucial, the navel’s crucible next, and the kidneys’ furnace last. From the beginning to the end of the Golden Elixir, these three must never be separated for even a moment.\n\nIn the Way of the Golden Elixir, scholars often seek the branches of the Five Phases. They should know that at the moment of union, in the realm of indistinct obscurity, the pores are nurtured—this is the root of metal. In ease and harmony, the limbs are supple—this is the root of wood. Lead is fundamentally fire in nature yet metallic in disposition; mercury is fundamentally water in nature yet wooden in disposition. There is no other reason: water and fire are the bodies of lead and mercury; metal and wood are their functions. When lead and mercury congeal, their radiance unites—this is intent, which belongs to earth. Once the Five Phases are complete within the crucible, like attracts like, and the Five Phases encircle it without. Through inner and outer resonance, the elixir begins to take form, resembling a grain of millet—neither green nor yellow, neither black nor white, beyond description.\n\nAt this stage, one must preserve it with unbroken continuity, in purity and non-action. Naturally, a hundred wondrous phenomena appear. The kidney water merges with the essence-water, flowing down from the mysterious throat—this is called the divine water of the Flowery Pond. Within the void, white snow arises and the yellow sprout grows. In the moment of unbroken continuity, all swiftly returns to the crucible. Thus, the great medicine never departs from essence, qi, and spirit—one must first recognize the medicinal materials.\n\nYet the medicinal substances arise from essence, qi, and spirit—they are not essence, qi, and spirit themselves. Nowadays, some follow heterodox paths, self-righteous in their practices, exhausting essence, qi, and spirit in servitude. How can they produce the medicine?\n\nOf essence, qi, and spirit—which is most vital? The answer: spirit is most vital. The Dao of the Golden Elixir begins with spirit and employs essence and qi, hence spirit is most vital. Spirit is another name for nature; in the utmost stillness, when primordial qi is about to arise, spirit also seeks to emerge. One must swiftly stabilize it with concentration and await its return—otherwise, it becomes a formless form, scattered and without substance. If one boasts of its comings and goings, claiming mastery of the great Dao, who then could not achieve it? Spirit moves not swiftly yet arrives instantly, travels not yet reaches everywhere. As the master’s teaching says: the wondrous function of spirit is boundless yet constrained. If one grasps the Dao, one may guide its entry and exit, but it must never be recklessly ventured. For while gathering it within is permissible, how could one dare to release it without?\n\nWhen spirit departs and takes form by clinging to trees and plants, yin has not yet been exhausted. As it prepares to emerge, many strange phenomena appear: moonlight shines brilliantly, issuing from the eyes; breath is drawn in through the nose, issuing from the nose; pure sounds are heard in the ears, issuing from the ears. Why then can it not enter and exit through the mouth? The mouth is the gathering place of the five viscera’s qi, and spirit, abandoning essence and qi, steals away to avoid this realm of abundant qi. Spirit, qi, and essence are ever intertwined in longing; once spirit departs, the other two have nothing to rely upon. Thus, the departure of spirit brings harm and no benefit. Day by day and month by month, it illumines the earth below. The alchemist reverses its course for inner work, while following its flow becomes fire.\n\nThis fire circulates in cycles—nine revolutions within nine revolutions. At the first revolution, it flourishes, then waits for yin qi to dissipate before advancing to the second, and so on, until the nine revolutions are complete and it presses upon the crucible. Thus, the work of advancing the fire is called \"true yang battling the grassy yin.\" Let me clarify: the human body is entirely yin, possessing but a single point of yang. I take this single point of yang, moving it from afar to near, revolving it again and again, battling and retreating the grassy yin. Thereby, the yang path daily grows while the yin path daily wanes. As the *Book of Changes* says: \"The dragon battles in the wilds; its blood is dark and yellow.\" When yin is exhausted and yang is pure, the elixir may ascend to the Mud Pill Palace. Suddenly, with fierce determination, the true person first appears. Such is the Dao of the Golden Elixir—there is more that words cannot exhaust.\n\nWhen the elixir first forms, during its union, it inevitably relies on the convergence of yin and yang qi. Later, it is gradually refined with yang fire into a body of pure yang. Thus, it ceaselessly strengthens—this is the Qian Dao. The elixir is complete, and so one condenses spirit to form the body, achieving the initial stage of the immortal elixir. Initially, it employs the five phases to fulfill its function, but later, it is nourished with true gold to become a body of pure gold. Hence, its entire being radiates golden light. Gold transforms into the color of the sun, thus it shines; gold embodies the nature of the sun, thus it is firm. It is called the Golden Elixir, or Golden Immortal.\n\nThough the illusory body is a temporary construct, the alchemist must rely on it to cultivate the foundation of the elixir—like the earth, when the city walls are secure, external evils cannot enter. In the moment of unbroken continuity, the spleen and stomach merge into one channel, encircling the left side of the elixir chamber, while the lungs and liver merge into another, encircling the right. When true qi thoroughly penetrates, it circulates within the meridians. Thus, by drawing near the elixir, qi may be obtained to transform into the supreme treasure. Understanding one aspect reveals the other, yet this too arises naturally from non-action. I have raised this example to make it clear.\n\nNon-action is not inaction. The single qi within a person moves through intention—like clenching a fist: the intention to open causes the five fingers to extend, yet nothing is outwardly manifest. When the adept comprehends this, at the moment of gathering the primordial unity of qi, they maintain a single true intention, drawing in a single true qi. Following the diagram and observing the image, it settles in the Yellow Court—this principle is one and the same.\n\nIn the depths of winter’s desolation, only after the union of yin and yang does the myriad phenomena arise. When the adept understands this, they know that after the union, without expecting the birth of the elixir, it will naturally be born. Gold in water dazzles the eyes; gold in earth is concealed by it. For it is born in seclusion, hiding its brilliance. The elixir within the crucible is like a ruler on the throne: when the hundred officials fulfill their duties, the nation is naturally at peace, and the people are at ease. When fire timing and medicinal substances are each in their proper place, the myriad transformations are accomplished.\n\nWhat does \"each in their proper place\" mean? In the first revolution, the medicine is produced in the east and descends in the west. The heart serves as the handle of the Dipper, turning the mechanism. Thus, moving twenty degrees fills the po, and turning another twenty degrees fills the hun. Thereby, the fire’s hun and the water’s po stand firm, and the spirit’s function is greatly enhanced. The other revolutions follow likewise. To illustrate the essentials: it is said, \"The Dipper’s handle establishes the four seasons; the eight nodes all follow its course. The Dipper’s pivot stands firm, while the handle and scoop move behind it. One need only keep the two eyes bright, their upper and lower functions in harmony. Proceed in stillness, do not rush heedlessly. If you seek a formless diagram to guide you: a single qi circulates and returns to its original abode—what else is needed for the Golden Elixir to succeed? The supreme Dao is not complex; it is ordinary people who complicate it. I received this from my teacher’s transmission, thrice admonished to explore its secrets. Why then draw diagrams and compose treatises, expounding every minute detail to astonish gods and ghosts? Hmph! Were it not for those who transmit the Dao, the scriptures would remain, and the three masters would pass away.\"\n\n**Secret Instructions in Sequence:**\nSit in stillness, dispelling idle thoughts. Face upward, regulate the breath, and guard the moment of one’s own birth. When the command is heard, qi harmonizes and rises. Wait until qi stirs before proceeding downward, storing it within, then direct it upward to the two orifices, surging straight into the five stars. Await the radiant stillness, then observe the heart releasing a segment downward. Await another radiance, and the true qi of the first yang is born. Maintain unbroken continuity—just eighty percent.\n\nWhen the faint light emerges, employ the mechanism of entry and exit—once the Dao is opened, then proceed with the *zi-wu* cycle. When the great light emerges, employ the mechanism of entry and exit to break through the crown once. This is the method of ascending posteriorly and descending anteriorly. Thereafter, all pertains to the *weilü* and the Five Stars, and within thirty days, the mechanism of entry and exit will be observed. At the first quarter, fifty days suffice, and the mechanism is seen thrice in all around the full moon. On the left and right, the mechanism appears; when the days of the last quarter are complete, the lower luminous cauldron darkens. Employ the mechanism, then face the celestial path directly. With *Taihe*, return to the *Taiji*; with *Taihe*, return to the *Wuji*.\n\nThe mechanism of movement and stillness: when qi is abundant, restrain it with stillness; when qi is weak, assist it with intention.\n\n**Secret Instructions on Fire Times:**\nThe elixir resides within the cauldron—above is water, below is fire. The heart’s movement pertains to fire; stillness pertains to water—this is the water cauldron. The base’s stillness pertains to water; movement pertains to fire—this is the fire cauldron. When yang is beneath the cauldron, it is called water; when fire ascends above the cauldron, it is called water-fire. Yang fire is the external furnace; the external furnace and fire abide within the *qi* cavity. The *Huangting* is situated above the *qi* cavity, and the *qi* cavity is the internal furnace. The internal furnace stores fire, constantly refining near the cauldron—this is \"maintaining unbroken continuity.\"\n\nWhen fire grows and advances below, one must not remain seated, except during the *zi* and *wu* hours. At *wu*, advance fire; at *zi*, advance water. When yang arises, do not disturb it with the heart; receive it with intention, guiding it to the right, then rotating and descending to the left, storing it within. The reverse is advancing fire.\n\nSomeone asked: \"May I inquire about the nine revolutions?\"\nThe master replied: \"Three months of fire times constitute the nine revolutions.\n**First Revolution:** Begin at the flanks, left and right, storing the path of fire. Starting from the yang palace, ascend from the right side to the shoulder, traverse the center, and condense, sending it downward from the left. Then maintain unbroken continuity—stillness is preferable to movement, slowness to haste. Movement is called 'fanning the fire'; haste is called 'injuring the elixir.' This is the daily practice at the *zi* hour.\n**Second Revolution:** Advance one *cun* and two *fen* from the flank, employing the previous method. This is the practice at the *chou* hour.\n**Third Revolution:** Advance five *fen* from the flank, employing the previous method. This is the practice at the *yin* hour.\n\n**Bathing:** At the *mao* hour, when fire arises to retrieve the elixir, measure four *cun*—two threads form the path of fire. The pulse penetrates the cauldron, so when fire arises, do not use the eyes or heart; guide it with intention. Rotate right to align horizontally with the cauldron—this is the true thread of earth. Then enter profound stillness, and fire transforms into water, returning to the elixir within the cauldron. Thus bathe, maintaining unbroken continuity.\n\nHeavenly mechanism! Heavenly mechanism!\"\n\n**Guard this well! Guard this well!**\n\n**Fourth Revolution:** Advance one *cun*, employing the previous method. This is the practice at the *chen* hour.\n**Fifth Revolution:** Advance five *fen*, employing the previous method. This is the practice at the *si* hour.\n**Sixth Revolution—Withdrawal and Addition:** Advance five *fen*. Fire arises from below, and at the *wu* hour, the heart-fire and crown-fire blaze together; thus, yang’s initial flourishing is slightly restrained in withdrawal. When it revives, the fire is already faint! Ascend directly to the left, then traverse horizontally—just as it reaches the heart, encountering heart-fire, the flames flare fiercely! This is withdrawal and addition.\n\n**Seventh Revolution:** Advance five *fen*, employing the previous method. This is the practice at the *wei* hour.\n**Eighth Revolution—Bathing:** Proceed leftward in descent, rightward in ascent, retrieving the elixir precisely one *cun*. The fire-path of the *wei* hour is entirely the path of utmost yin. When fire’s power wanes, it meets the *shen* path—also a yin path. There is no other way: above the heart lies the yang path; below the heart, the yin path. The fires of both hours pass through the yin path, and only at *you* does metal begin to flourish; thus, await it in stillness. Fire transforms into golden liquid and returns to the elixir within the cauldron. Thus bathe: the *mao*-hour bathing augments mercury, while the *you*-hour bathing augments lead.\n\n**Ninth Revolution:** Retrieve the elixir, merely five *fen*, applying it in an instant before settling to await.\n**Tenth Revolution—Hai Hour:** Employ the *xun* wind to kindle fire, performing the method of revolving fire. Consult the *Fire-Timing Diagram*.\n\n**Fire Qi**\n*Recognize it well!*\n\n**Diagram of Gathering and Refining**\nHeaven divides creation at its center;\nMan initiates his great work from the heart.\n\n*Secret Writ of Jade Purity, Golden Casket, and Azure Splendor*\n*Concluding the Inner Alchemy Formulae of the Golden Treasure*\n*End of Scroll Three*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "玉清金笥青华秘文金宝内炼丹诀 经名：玉清金笥青华秘文金宝内炼丹诀。 简称《金华秘文》，原题紫阳真人张平叔撰，应系徒人伪托。 此书分上、中、下三卷。 底本出处：《正统道藏》洞真部。 玉清金笥青华秘文金宝内炼丹诀卷上 紫阳真人张平叔撰 表奏 不避雷钺之诛，辄伸卑渎之念，臣处世多虞，无有所为，为必颠踬，年迈三旬，独於大道有绿焉。 回思穹苍，昔日使我无成者，正佑今日之有成也。 感恩至重，铭心戴德，今者切见。 嘉尔下民，孰无道器，奔劳尘境，戕伐真元，俞降愈下，弃人就物，就物思人，则不可得而返之矣！ 物不能修，终乎异类，哀哉！ 臣之身自弗能度，反怜及此，固无异泥中蛙而哂篱上鸡也。",
      "translated_text": "*The Jade Purity Golden Casket Azure Florescence Esoteric Writ of the Golden Treasure Inner Alchemy Formula*\n\n**Title:** *The Jade Purity Golden Casket Azure Florescence Esoteric Writ of the Golden Treasure Inner Alchemy Formula* (abbreviated as *The Esoteric Writ of Golden Florescence*). Originally attributed to the Perfected Purple Yang, Zhang Pingshu, though likely a later disciple’s forgery. This text is divided into three scrolls.\n\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Section of Cavernous Truth*.\n\n---\n\n**The Jade Purity Golden Casket Azure Florescence Esoteric Writ of the Golden Treasure Inner Alchemy Formula, Scroll the First**\nBy the Perfected Purple Yang, Zhang Pingshu\n\n**Memorial to the Throne**\n\nUnmindful of the axe’s doom, I dare to voice these humble and irreverent thoughts. In this world, I have known much turmoil, yet achieved nothing—surely ruin awaits. Now past thirty years, I have found solace only in the Great Dao.\n\nReflecting upon the vault of heaven, I see that what once hindered my success now aids its fulfillment. The debt of gratitude is profound; I inscribe it upon my heart and bear it with reverence.\n\nNow, I witness with sorrow: among the people below, who lacks the vessel for the Dao? They rush and toil in the dust of the world, ravaging their true essence. The more they descend, the further they stray—abandoning humanity for things, and in seeking humanity through things, they can no longer return.\n\nIf things cannot be cultivated, one ultimately becomes a stranger to one’s kind. Alas! Though I myself have not yet transcended, I pity them all the more—no different from a frog in the mud mocking the chicken on the fence.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 289,
      "start_sentence": 0,
      "end_sentence": 13,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.764587163925171,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\玉清金笥青华秘文金宝内炼丹诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "唯某昨传受《青华真人玉清金笥长生度世金宝内炼丹诀》，简而易行，详而不杂，身裹分阴阳之主，壶中立四象之枢，三中常守以为机，一定不离而作用，用中无用，静裹长存。 哲人秀士，一览无遗，造化在掌中矣！ 今欲斋沐精思，着为图论，毫发无隐，直泄至真之奥旨。 择其可传者而传之，得接续心灯，流传万世，顾美事也。 然始传之际，誓语至严，蒙师至嘱，轻泄犯刑，数欲作而踟局，勿记其几矣！ 伏惟 太上好生，度人为重，是用俯伏尘埃，冥心上界。 欲望 天慈鉴臣之意，若不允而立彰玄谴，如或谅容，俾臣安静，庶几敢践斯言。 复陈 天陛，臣无任诚惶诚恐，顿首百拜，怀恩之至。 臣迩者表奏",
      "translated_text": "Only yesterday did I receive the transmission of *The Jade-Clear Golden Casket Longevity and World-Transcendence Inner Alchemy Scripture of the Azure Radiance Perfected*, a text at once concise and easily practiced, detailed yet uncluttered. Within the body, it divides the lord of yin and yang; within the crucible, it establishes the pivot of the Four Symbols. The Three Centers are constantly guarded as the mechanism; the One Fixation never departs as the function. In function, there is non-function; in stillness, it endures forever.\n\nFor the wise and the refined, a single glance suffices—creation lies within the palm of one’s hand! Now, I wish to purify myself, fast, and concentrate my thoughts to render it into diagrams and discourse, leaving no detail concealed, directly revealing the profound essence of the utmost truth. I shall select what may be transmitted and transmit it, that the lamp of the heart may be passed on, flowing through ten thousand generations—what a splendid endeavor!\n\nYet at the moment of first transmission, the oath was most solemn, and my master’s charge most grave: to lightly disclose it invites punishment. Many times have I wished to proceed, only to hesitate, unable to recall how often! Prostrating myself in the dust, I turn my mind toward the upper realms, reverently considering that the Most High cherishes life and values the salvation of others above all. Thus, I bow low in humility, beseeching the Heavenly Compassion to perceive my intent. If my plea is not granted and the mysterious censure is made manifest, so be it; but if, perchance, it is deemed acceptable, may I be granted peace to fulfill this vow.\n\nAgain, I lay this before the Heavenly Threshold. I, your servant, am utterly overwhelmed with awe and trepidation, bowing my head a hundred times in deepest gratitude. Of late, I have submitted memorials...",
      "overlap_context": "mong the people below, who lacks the vessel for the Dao? They rush and toil in the dust of the world, ravaging their true essence. The more they descend, the further they stray—abandoning humanity for things, and in seeking humanity through things, they can no longer return.\n\nIf things cannot be cultivated, one ultimately becomes a stranger to one’s kind. Alas! Though I myself have not yet transcended, I pity them all the more—no different from a frog in the mud mocking the chicken on the fence.",
      "start_char": 289,
      "end_char": 565,
      "start_sentence": 14,
      "end_sentence": 25,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.151564598083496,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\玉清金笥青华秘文金宝内炼丹诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "天廷欲将《青华真人玉清金笥长生度世金宝内炼丹秘旨》，画图立论，传诸绿士。 俯伏茅庐，恭伺天罚，逾三旬焉！ 今不至，始敢斋沐焚香，精思着述，三日而成，秘诸法笋，以待贤者。 谨录上奏，伏望天慈俯垂赦宥，伏冀人人依此炼成金宝，超出尘埃，世世相传，无有泄慢。 臣无任诚惶诚恐，顿首百拜以闻。 金丹图论序 吾自识金丹秘诀之后，累获罪於天，而不自俊，又为玄书，并《悟真篇》等，行於世。 自心为至矣！ 忽有客至访余，怪其状貌非凡，敬肃待之。 或问曰：子於金丹之道，训人亦至矣！ 但首尾未明，机关尚隐，后学何以为识？ 余自此亦不得已也。 天机至重，玄律至严，子固美言，某敢不奉。 曰：子但着为一书，尽底泄漏，苟有谴焉，某当其责。 余再拜敬服，遂失所在，余思此语，故着此书，天机泄则泄矣！ 传之者当以至宝拜受，有玄律焉！ 泄慢堕地狱，祸及七祖翁。 心为君论 心者，神之舍也，心者众妙之理，而宰万物也。 性在乎是，命在乎是。 若夫学道之士，先须了得这一个字，其余皆后段事矣！ 故为之传。 张子野人，身披百袖，自成都归于故山，筑室於山青水绿之中，万物罄然，而怡怡然，若有所得。 客傅於市曰：遭贬张平叔，归于山矣！ 从淤之士，丛然而至，立于庭，且泣且拜曰：先生固无恙乎！ 且夫奔涉山川，逾越险阻者，于兹十年，而貌不少衰，形不少疲者，其有术乎？ 张子曰：吁！ 吾与汝言：人之所以憔悴枯槁者，谁使之然？ 心也，百事集之，一念未已，一念续之，尽日之中，全无顷暇。 宵之寐也，则亦若无心焉，但神不存矣！ 吾本无他术，为能定心，故夫鬼神之所以测度者，吾心之有念耳。 心无念，则神之灵不可得而施也。 岂神不知吾心，吾亦自不知其为心，乃定之根本也。 弟子曰：然则金丹之士，其静心乎？ 勿静心乎？ 曰：静之一字，能静则金丹可坐而致也，但难耳。 曰：夫子之言，其误后学多矣！ 张子丰然而请其旨曰：夫子与人言金丹之道，常使人心中生意，以意为造化之主，心其能静乎？ 曰：子见偏耳，非吾言之所误也。 君寻其平日用心，为何而动？ 寂然不动，感而遂通，乃吾心之用也。 奔役天涯，子无居止，子用心也。 夫斗极之北辰，固末始动，其所以为动者，拱之星耳。 然拱辰之星，固不能动者，斗极为之枢，而运之尔。 性其不动之中，而有所谓动者，丹士之用心也，唯其动之中而存不动者。 仁者之用心也，於不动之中，终於不动者，土木之类也。 心居於中而两目属之，两肾属之，三窍属之，皆未可尽其妙用，其所以为妙用者，但神服其令，气服其窍，精从其召，神服其令者。 心勿驰於外，则神反藏於内，气服其窍者，心和则气和，气和则形和，形和则天地之和应矣！ 故盛喜怒而气逆者，喜怒生乎心也，精从其召者，如男女构形而精荡，亦心使之然。 心清即念清，念清则精止。 吁！ 心惟静则不外驰，心惟静则和，心惟静则清，一言以蔽之曰静，精气神始得而用矣！ 精气神之所以为用者，心静极则生动也，非平昔之所谓动也，用精气神於内之动也。 精固精气固气，神亦可谓性之基也。 性则性而基言之，何也？ 盖心静则神全，神全则性现。",
      "translated_text": "The Heavenly Court wishes to have *The Supreme Lord of Azure Radiance’s Jade-Pure Golden Casket: Secret Essentials of Internal Alchemy for Longevity and Salvation* illustrated with diagrams and expounded in discourse, that it may be transmitted to worthy scholars. Prostrating myself in my thatched hut, I awaited the Heavenly Punishment for over thirty days. When no censure came, I dared at last to purify myself with ablutions, burn incense, and compose this work in concentrated thought over three days. I have sealed it within a bamboo",
      "overlap_context": "s the salvation of others above all. Thus, I bow low in humility, beseeching the Heavenly Compassion to perceive my intent. If my plea is not granted and the mysterious censure is made manifest, so be it; but if, perchance, it is deemed acceptable, may I be granted peace to fulfill this vow.\n\nAgain, I lay this before the Heavenly Threshold. I, your servant, am utterly overwhelmed with awe and trepidation, bowing my head a hundred times in deepest gratitude. Of late, I have submitted memorials...",
      "start_char": 565,
      "end_char": 1785,
      "start_sentence": 26,
      "end_sentence": 81,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 3.2713189125061035,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\玉清金笥青华秘文金宝内炼丹诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "又一言以蔽之曰静，其所以为静者，盖亦有理。 顺水行舟，滔滔腾拔，欲往海岛，不曰劳形，一旦回家，思乡安静，急驾归帆，求风逆返、还家，固静之道。 但久违而始复，久失而始寻，一日一欲静，其可得乎？ 当思归静之由，然后能静，既悟昨非，当求今是，非固常为，是在何处？ 诗曰： 自下金梯堕碧崖，回思阆苑几花开，向来大道今何在？ 野草不除荆棘堆。 口诀 但於一念妄生之际，思平日心不得静者，此为梗耳，急舍之，久久纯熟乎？ 盖精依气生，精实肾宫而气融之，故随气而升阳为铅者，此也。 精实而元气不生，元阳不见，何益於我哉？ 元神见而元气生，元气生则元精产。 意为媒说 意者，岂特为媒而已，金丹之道，自始至终，作用不可离也。 意生於心，然心勿驰於意则可，心驰於意末矣！ 坎离说 坎者肾宫也，离者心田也，坎静属水，乃 ，属火也； 动属火，乃一也。 离动为火，乃 ，属火也； 静属水，乃一也。 交会之际，心田静而肾府动，得非真阳在下，而真阴在上乎？ 况意生乎心，而直下肾府乎？ 阳生於肾，而直升於黄庭乎？ 故曰坎离颠倒，若不颠倒而顺行，则心火而不静，则大地火坑之义，明矣！ 余见交会图 下手工夫",
      "translated_text": "Moreover, to summarize in a single word: stillness. The principle underlying stillness may likewise be understood. Like a boat sailing downstream, swift and surging, bound for some island sea—no toil is spoken of in the journey. Yet once homeward thoughts arise, longing for the peace of one’s native place, one hastens to hoist the sail, seeking a contrary wind to return. Such is the Dao of stillness. But if one has long been estranged before seeking to return, or long lost before attempting to find the way, how can stillness be attained in a single day? First, one must reflect on the cause of returning to stillness, and only then can stillness be achieved. Having awakened to past errors, one must seek present rectitude—yet where does this rectitude reside, if not in constancy?\n\nThe poem says:\nFrom the golden ladder, one falls to the azure cliff,\nRecalling the blossoms of Penglai, how many have bloomed?\nWhere now lies the great Dao of old?\nOnly wild grasses remain, a thicket of thorns.\n\n**Oral Instruction:**\nWhen a single deluded thought arises, reflect on how the mind has failed to attain stillness in ordinary times—this is the obstruction. Abandon it swiftly. With long practice, will it not become effortless?\n\nFor essence depends on qi to arise, and essence resides in the Kidney Palace, where qi blends with it. Thus, when it ascends with qi as yang-lead, this is the process. If essence is substantial yet primordial qi does not arise, and primordial yang does not manifest, what benefit is there to me? Only when primordial spirit appears does primordial qi arise, and when primordial qi arises, primordial essence is produced.\n\n**The Role of Intention as the Matchmaker:**\nIntention is not merely a matchmaker. In the Dao of the Golden Elixir, from beginning to end, its function cannot be set aside. Intention arises from the heart, yet the heart must not be carried away by intention—if the heart is led astray by intention, all is lost!\n\n**On Kan and Li:**\nKan is the Kidney Palace; Li is the Heart Field. Kan in stillness pertains to water, yet [when dynamic, it pertains to fire]; Li in motion pertains to fire, yet [when still, it pertains to water]. At the moment of their union, when the Heart Field is still and the Kidney Palace is dynamic, is this not true yang below and true yin above? Moreover, intention arises from the heart and descends directly to the Kidney Palace, while yang arises from the kidneys and ascends directly to the Yellow Court. Thus it is said: Kan and Li are inverted. If they are not inverted but proceed in sequence, the heart-fire will not be still—then the meaning of the \"fire pit of the great earth\" becomes clear.\n\nI have illustrated this in the *Diagram of Union*.\n**Commencing the Practice**",
      "overlap_context": "upreme Lord of Azure Radiance’s Jade-Pure Golden Casket: Secret Essentials of Internal Alchemy for Longevity and Salvation* illustrated with diagrams and expounded in discourse, that it may be transmitted to worthy scholars. Prostrating myself in my thatched hut, I awaited the Heavenly Punishment for over thirty days. When no censure came, I dared at last to purify myself with ablutions, burn incense, and compose this work in concentrated thought over three days. I have sealed it within a bamboo",
      "start_char": 1785,
      "end_char": 2271,
      "start_sentence": 82,
      "end_sentence": 107,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.779436111450195,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\玉清金笥青华秘文金宝内炼丹诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "持心论於前，然后参下手工夫於后，盖心始欲静而欲念未息。 欲念者，气质性之所为也。 此性役真性，常切於目耳次之。 修丹之士，心既无事，则彼固无由而役之矣！ 其所以役神者，以外物诱之耳。 静坐之际，先行闭息之道，闭息者，夫人之一息，一息未际而一息续之，今则一息既生，而抑后息后息受抑，故续之缓缓焉！ 久而息定。 抑息千万，不可动心，动心则逐於息，息未止而心已动矣！ 言未既，有笑于傍者曰：迂哉！ 此子教人无法，抑息而又不动心，得非以千钧之物责负於人，使之不用力，可乎？ 曰：子且听吾，虽闭息而又存心，则心不动而息亦息矣！ 又此固闭息之道，安保欲念不生乎？ 曰：至于生则末矣！ 念之生也，感物而动尔，定中觉目有所睹，则神役於目矣！ 急收而返於内。 耳有所听，神役於耳矣，急收内听，其他皆然。 问者曰：闻一知二，吾再知此理矣！ 吾虽收神而又存心，则神收而心本静矣！ 日：存心者，养性也，养性之始，见不存则无所养，无所养则终乎不见矣！ 存心实自收心始，所谓收神者，盖收心之余用耳。 行之至久，见如不见，闻如不闻，形心相忘，合乎至道，则元性彰露，而元气生矣！ 精神论 神者，元性也。 余前所说神为主论，盖亦尽之矣！ 今念夫修丹者，凝神之法，凝神之法不在乎前，不在乎速，故又为之论，而后画神室并论于后。 凝者以神於精气之内，精气本相依，而神亦恋之。 今独重於神，何也？ 神者，精气之主，丹士交会采取，至于行火，无非以神而用气精。 苟先以神凝于气之中，则气未可安，神亦未肯恋气，而反害药物矣！ 且神元性也，性方寻见，尚未定，摇摇扬扬，进退存亡，而子使凝之，性岂能自凝？ 其所以凝之者，亦质之性而凝之也。 初云质而寻本性，是可以质性而逐本性，可乎哉？ 今为学者，盖为凝神所误，何耶？ 盖神仙有下手先凝神之说，故妄引以盲众，岂知其所谓凝神者，盖息念．而返神於心。 於心之道，神归于心，则性之全体见，全体见而用之，无非神用，念念不离金丹，故丹成而神自归之，何凝之有？ 故曰凝神者，神融於精气也，精气神合而为一，而阳神产矣！ 则此际此身，乃始为无用之物也。 谁曰不然？ 吾闻於度师，度师闻於远师，远师闻於天。 幻丹说 丹有幻丹者，盖学道之士，不知正理，而妄为采取交会，故成幻丹。 幻丹者，未静心田，遽采一阳，故斯时也，一阳实非真阳也，乃呼吸之气也； 精亦非元精，乃淫泱之精也； 神亦非元神，乃情欲之念也。 夫人方学道，便欲为仙，得非欲念乎？ 以欲念而交会阳生，此幻丹之所以有也。 精在肾府，而若采之升至于脐上，又无安顿处，故逐气而息於气穴之右，脐生於肾之缕，与气交结而止，即自日丹。 既自曰丹矣，而精神而用着，便是后天底物。 先天之物果安在哉？ 谓之黄庭，内炉、外炉、泥丸等窍，皆先天立之后始见，当此时在何处？ 实未之有也。 傍风起影，入海寻蟾，守株待兔，缘木求鱼，一日一败露，精荡然而去，先天又无主。 呜呼！ 非长生之丹，乃促命之法也。 又有采气而上遇心血气，血凝而为物，亦曰幻丹，若此者众，故举以辨惑。 捉丹法 金丹居内，亦有走失者乎？",
      "translated_text": "**On Holding the Heart and Commencing Practice**\n\nHaving expounded the discourse on the heart, we now proceed to the method of practice, for the heart, though desiring stillness, is yet troubled by unceasing desires. These desires arise from the temperament and nature, where this nature enslaves the true nature, ever assailing the eyes and ears. For the cultivator of the elixir, once the heart is free of affairs, the temperament has no means to enslave it. Yet what enslaves the spirit is nothing but the allure of external things.\n\nDuring seated meditation, first practice the method of restraining the breath. To restrain the breath: when one breath has not yet ended and another follows, now, as the first breath arises, suppress the subsequent breath, so that it follows slowly. With time, the breath settles. Though the breath is restrained a thousand or ten thousand times, the heart must not be stirred. If the heart stirs, it will chase after the breath, and before the breath stills, the heart has already moved.\n\nBefore the words were finished, someone nearby laughed and said: \"How impractical! This man teaches a method without principle—restraining the breath yet keeping the heart unmoved. Is this not like burdening a man with a thousand *jun* and forbidding him to exert himself? Is it possible?\"\n\nThe master replied: \"Listen to me. Though you restrain the breath, if you also preserve the heart, then the heart will not move, and the breath will naturally still. Yet even if the breath is restrained, how can you ensure that desires will not arise?\"\n\nHe continued: \"When desires arise, it is because the senses are stirred by external things. In deep stillness, if the eyes perceive something, the spirit is enslaved by the eyes—hasten to withdraw and return it inward. If the ears hear something, the spirit is enslaved by the ears—hasten to withdraw and listen inwardly. The same applies to all senses.\"\n\nThe questioner said: \"I hear one and understand two. Now I grasp this principle! Though I withdraw the spirit and preserve the heart, the spirit is gathered, and the heart is fundamentally still.\"\n\nThe master replied: \"To preserve the heart is to nurture the nature. At the beginning of nurturing the nature, if you do not preserve it, there is nothing to nurture, and in the end, nothing will be perceived. Preserving the heart truly begins with gathering the heart. What is called gathering the spirit is but an auxiliary use of gathering the heart. With long practice, seeing becomes as not seeing, hearing as not hearing; form and heart forget each other, merging with the supreme Dao. Then the original nature is revealed, and the original *qi* is born.\n\n**On Spirit**\nSpirit is the original nature. In my previous discourse on spirit as the master, I have already exhausted the subject. Yet considering those who cultivate the elixir, the method of concentrating the spirit is neither hasty nor superficial. Thus, I expound further and later illustrate the spirit-chamber.\n\nTo concentrate is to unite the spirit within essence and *qi*. Essence and *qi* are inherently interdependent, and the spirit naturally clings to them. Why, then, emphasize the spirit alone? The spirit is the master of essence and *qi*. In the alchemical work of union and gathering, and in the firing process, all is done through the spirit’s use of *qi* and essence. If one first concentrates the spirit within the *qi*, the *qi* cannot settle, nor will the spirit willingly cling to it, and the medicinal substances will be harmed.\n\nMoreover, the spirit is the original nature. When the nature is first glimpsed, it is not yet stable—floating and drifting, advancing and retreating, appearing and vanishing. If you force it to concentrate, how can the nature concentrate itself? What concentrates it is the temperament’s nature. Initially, one relies on the temperament to seek the original nature—can the temperament’s nature truly pursue the original nature? Now, scholars are misled by the method of concentrating the spirit. Why? Some immortals speak of first concentrating the spirit, and thus blindly lead the masses astray. Do they not know that what they call concentrating the spirit is merely stilling thoughts and returning the spirit to the heart?\n\nIn the Dao of the heart, when the spirit returns to the heart, the complete body of the nature is revealed. Once the complete body is revealed and put to use, all is the spirit’s function. Thought after thought, it does not depart from the golden elixir. Thus, when the elixir is formed, the spirit naturally returns to it—what concentration is there? Therefore, to concentrate the spirit is to merge the spirit with essence and *qi*. When essence, *qi*, and spirit unite as one, the yang spirit is born. At this moment, this body becomes a useless thing. Who would deny it? I have heard this from my teacher, who heard it from his distant teacher, who heard it from heaven.\n\n**On the Illusory Elixir**\nThere is an illusory elixir, for those who study the Dao, ignorant of the correct principles, rashly engage in gathering and union, and thus produce an illusory elixir. The illusory elixir arises when the Heart Field is not yet stilled, and one hastily gathers the solitary yang. At this time, the solitary yang is not true yang but merely the *qi* of breath; the essence is not original essence but the turbid essence of lust; the spirit is not original spirit but the thoughts of desire.\n\nOne who has just begun to study the Dao yet desires to become an immortal—is this not desire? To unite and arouse yang through desire is the origin of the illusory elixir. The essence resides in the Kidney Palace, and if one gathers it and ascends to above the navel, yet has no place to settle it, it follows the *qi* and rests to the right of the *qi* cavity. The navel is connected to the kidneys by a thread, and when it joins with the *qi* and stops, it is called an elixir. Though it is called an elixir, when spirit and essence are employed, it is merely a postnatal substance. Where, then, is the prenatal substance? What is called the Yellow Court, the inner furnace, the outer furnace, the Mud Pill Palace, and other cavities—these only appear after the establishment of the prenatal. Where were they at that time? They did not yet exist.\n\nLike wind stirring shadows, seeking the toad in the sea, waiting by the tree for a hare, or fishing in a tree—day by day, the deception is exposed. The essence scatters and flees, and the prenatal has no master. Alas! This is not the elixir of long life but a method that shortens it. There are also those who gather *qi* and ascend to encounter the heart’s blood and *qi*; when the blood congeals into a thing, it is also called an illusory elixir. Such cases are many, and thus I cite them to dispel confusion.\n\n**The Method of Grasping the Elixir**\nThough the golden elixir resides within, can it also be lost?\"",
      "overlap_context": "ace is dynamic, is this not true yang below and true yin above? Moreover, intention arises from the heart and descends directly to the Kidney Palace, while yang arises from the kidneys and ascends directly to the Yellow Court. Thus it is said: Kan and Li are inverted. If they are not inverted but proceed in sequence, the heart-fire will not be still—then the meaning of the \"fire pit of the great earth\" becomes clear.\n\nI have illustrated this in the *Diagram of Union*.\n**Commencing the Practice**",
      "start_char": 2271,
      "end_char": 3493,
      "start_sentence": 108,
      "end_sentence": 164,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.416094064712524,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\玉清金笥青华秘文金宝内炼丹诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "曰：有。 有可捉之道乎？ 曰：有。 然非丹之走失也。 曰：门户不坚而被其出也，幻丹则有走失，金丹安有此患。 曰：金丹之出，何以知之？ 曰：丹在鼎中，备五行之正气，吾身五行之气迫炉，则相感而动，一旦觉气升外，而内描无相感，乃丹不存也。 急须放下一场大静，并所谓炉鼎，丹之在不在，俱付之无何有。 或一日或一夜，始觉其在何处。 或在心，或在肝，或在脾与肾，身中百窍，皆可藏之。 知其在彼处，遂绵绵若存，守之勿使之。 再去他处，又一日之久，始以意采取之，则直降於阳宫。 又就阳宫，如采取之时用意，遂从旧径直升阳於鼎矣！ 造化玄微，至此谁曰不然。 苟有云云者，吾之师也。",
      "translated_text": "There are such cases. Is there a method to grasp it?\nThere is.\nYet this is not the elixir’s escape.\nThe gates and doors were not secure, allowing it to depart—illusory elixirs may be lost, but how could the golden elixir suffer such a fate?\nHow does one know when the golden elixir has departed?\nWhen the elixir resides in the crucible, it is replete with the true *qi* of the Five Phases. The *qi* of the Five Phases within my body presses upon the furnace, and they resonate and stir. Should one day perceive the *qi* ascending outward while the inner resonance ceases, the elixir is no longer present.\nSwiftly, one must lay everything aside in profound stillness, relinquishing even the furnace and crucible, whether the elixir remains or not, to the realm of nothingness. After a day or a night, one may then sense its whereabouts—whether in the heart, the liver, the spleen, or the kidneys, for the elixir may lodge in any of the hundred cavities of the body.\nOnce its location is known, one must subtly and continuously preserve it, guarding it to prevent its departure. After another day, one may then gather it with intent, guiding it directly to descend into the Yang Palace. From the Yang Palace, employing the same intent as when gathering it, one follows the old path to ascend it directly into the crucible.\nSuch are the mysteries of creation—who could deny it? If there be one who speaks thus, they are my teacher.",
      "overlap_context": "by day, the deception is exposed. The essence scatters and flees, and the prenatal has no master. Alas! This is not the elixir of long life but a method that shortens it. There are also those who gather *qi* and ascend to encounter the heart’s blood and *qi*; when the blood congeals into a thing, it is also called an illusory elixir. Such cases are many, and thus I cite them to dispel confusion.\n\n**The Method of Grasping the Elixir**\nThough the golden elixir resides within, can it also be lost?\"",
      "start_char": 3493,
      "end_char": 3759,
      "start_sentence": 165,
      "end_sentence": 179,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.628764629364014,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\玉清金笥青华秘文金宝内炼丹诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "神水华池说 神水者，即木液之谓也； 华池者，脐中气穴之下，两肾中间一窍，绝肖黄庭，谷气就此而生精，医家所谓精穴者是也。 斯窍也，少壮之士，阳盛气融，则神水华池，不过浇灌炉鼎，洗涤脾胃，周流润气穴而已。 元气衰微，精元枯竭者，皆藉此以为丹本。 元气既衰，非元气之衰也，乃气质之气断丧已甚，邪欲之性，念念不已，先天又不得见，后天亦不足为用，赢尪之根，殆起于此。 华池之窍，乃生精而降於外肾者也。 气壮则精多，精多则华盛，用之如有余。 气凋之士，精元槁矣，谷气所临，不过产一等欷欷之水，流归肾府耳。 然我既静矣！ 元气本无增减，但华池无矣，大药三品而欠其一，故阳生之际，未直采之时，以意斡归尾闾，自夹脊直透至泥丸，故就精穴用精，自然随气而升，至午宫，遇众阳融之，则精始可用，然后降至於心，就心取汞，依然下自黄庭，即落乎其中，却用一意封固，即绵绵若存，以养之。 二者就其中自相吞啖，而丹始成。 近有浙西一派，虽少壮之士，亦用此法。 而结丹，但道在迩求诸远耳。 然各执其是而已。 百窍说",
      "translated_text": "The Discourse on Divine Water and the Flowery Pond\n\nDivine Water refers to the liquid of Wood; the Flowery Pond is the cavity beneath the qi point of the navel, between the two kidneys—a passage most resembling the Yellow Court, where the grain qi transforms into essence, known in medicine as the Essence Cavity. In the young and robust, whose yang abounds and qi flows freely, the Divine Water and Flowery Pond serve merely to irrigate the furnace and crucible, cleanse the spleen and stomach, and circulate moisture through the qi cavities. Yet for those whose primordial qi has waned and essence is exhausted, these become the very foundation of the elixir.\n\nWhen primordial qi declines, it is not the primordial qi itself that fails, but rather the qi of the material form that has been severed and lost to excess. The nature of wayward desires arises ceaselessly, the prior heaven remains unseen, and the posterior heaven proves insufficient for its purpose—thus begins the root of emaciation and infirmity. The Flowery Pond is the passage through which essence is generated and descends to the external kidneys. When qi is vigorous, essence is abundant; when essence is abundant, the Flowery Pond flourishes, and its use leaves one with surplus. But in those whose qi has withered, essence is desiccated, and the grain qi that arrives produces only a kind of sighing water, which flows back to the kidney palace.\n\nYet once I have stilled myself! Primordial qi inherently neither increases nor decreases, but the Flowery Pond is no more. The great medicine lacks one of its three ingredients, so when yang stirs but before the moment of direct gathering, intent is employed to guide it back to the Weilu, ascending straight through the Jiaji to the Mud Pill Palace. Thus, essence is drawn from the Essence Cavity, naturally rising with the qi to the Noon Palace, where it encounters the fusion of all yang—only then may essence be employed. It then descends to the heart, where mercury is gathered, and from the heart it returns downward through the Yellow Court, settling within. A single intent is then used to seal and secure it, preserving it with unbroken continuity to nurture it. The two substances within naturally consume and merge with one another, and the elixir begins to form.\n\nRecently, a school from western Zhejiang has applied this method even to the young and vigorous to congeal the elixir—yet the Dao lies near, and they seek it afar. Still, each clings to their own truth.\n\nThe Discourse on the Hundred Cavities",
      "overlap_context": "of the hundred cavities of the body.\nOnce its location is known, one must subtly and continuously preserve it, guarding it to prevent its departure. After another day, one may then gather it with intent, guiding it directly to descend into the Yang Palace. From the Yang Palace, employing the same intent as when gathering it, one follows the old path to ascend it directly into the crucible.\nSuch are the mysteries of creation—who could deny it? If there be one who speaks thus, they are my teacher.",
      "start_char": 3760,
      "end_char": 4192,
      "start_sentence": 180,
      "end_sentence": 195,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.982467889785767,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\玉清金笥青华秘文金宝内炼丹诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "人之一身，毛窍八万四千，气宫三百八十四。 毛窍散，属气宫脐中气穴，又为三百八十四宫之主降，而阳宫皆而为精。 心为中田，顶为上田，舌下玄膺，目中有银海，额之中，眉之间，口鼻之衡，耳目之畔，咽喉之侧，腰胁之中，皆窍也。 余所谓丹之出者，若此窍皆可藏也。 岂曰人身止有一二窍也！ 此一二窍者，众之枢纽，岂曰止乎斯而已矣！ 此其体也，用别着说于后。 玉清金笥青华秘文金宝内炼丹诀卷上竟 玉清金笥青华秘文金宝内炼丹诀卷中 紫阳真人张平叔撰 采取图论",
      "translated_text": "Within the human body, there are eighty-four thousand hair-follicle cavities and three hundred eighty-four qi palaces. The hair-follicle cavities disperse, belonging to the qi palace of the navel’s qi cavern, which also serves as the governing descent of the three hundred eighty-four palaces—while the yang palaces all become essence. The heart is the Middle Field, the crown the Upper Field; beneath the tongue lies the Mysterious Throat, within the eyes the Silver Sea; at the center of the forehead, between the brows, the balance of mouth and nose, the sides of ears and eyes, the flanks of the throat, the space within the waist and ribs—all are cavities. As for what I call the emergence of the elixir, it may be concealed in any of these cavities. How could it be said that the human body possesses only one or two cavities? These one or two cavities are the pivot of the multitude—how could they be limited to this alone? This describes the body; its application will be discussed separately in what follows.\n\n*End of Upper Scroll of The Jade Clarity Golden Casket: Secret Writ of Azure Radiance, Golden Treasure Inner Refinement Elixir Formulae*\n*Middle Scroll of The Jade Clarity Golden Casket: Secret Writ of Azure Radiance, Golden Treasure Inner Refinement Elixir Formulae*\n*Illustrated Discourse on Gathering and Refining*\n*Composed by Perfected Master Purple Yang, Zhang Pingshu*",
      "overlap_context": "nward through the Yellow Court, settling within. A single intent is then used to seal and secure it, preserving it with unbroken continuity to nurture it. The two substances within naturally consume and merge with one another, and the elixir begins to form.\n\nRecently, a school from western Zhejiang has applied this method even to the young and vigorous to congeal the elixir—yet the Dao lies near, and they seek it afar. Still, each clings to their own truth.\n\nThe Discourse on the Hundred Cavities",
      "start_char": 4192,
      "end_char": 4416,
      "start_sentence": 196,
      "end_sentence": 206,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.249692440032959,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\玉清金笥青华秘文金宝内炼丹诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "采者采真阳於肾府，取者取真汞於心田。 可以采则采，采之必得其用，非其时而采之，则龙不降，虎不升，虽见血气奔驰，冲冲来往，迷者以为交姤矣！ 抑不知离坎自离坎，阴中之真阳，阳中之真阴，自兀然耳。 至於气脉为一念所止，则气疾入脉络之中，离坎之内，反有伤於铅汞。 虽曰养气，要於中实所以丧元气也。 夫元气之在人，至静始见，是先天之气也。 后天之气，时刻循环，但人汨於欲而不知详审耳。 至於略定之际，心无他用，则方知其气之上下，遂错采以为先天，致返加害。 所以近世之学者，常有奇疾，盖为此也。 夫人之疾病，但气脉为梗耳，气本自调而若役之，使之升则伤脾胃肺肝、耳目口鼻，降则如次水於长堤，锐然而下趁，沛乎其不可御也。 至真之物，其能存乎！ 余悯此等言丹之士，故画采取图为於第一，虽直泄天机，但人有志於金丹，而反戕其性命，余救之以正理。 太上好生，必不我罪，故此篇画以刀圭玄黄、婴兄姹女，诸般譬设，尽扫而退三舍，使贤者见之而参同，愚者见之，浮然冰释，分分朗朗，如宝鉴之察形，洞见毫发矣！ 金丹之士，先修阴德以尽人事，然后持前心论，则大药产而图形见矣！ 采取之法生于心，心者万化纲维枢纽，必须忘之而始觅之，忘者忘心也，觅者真心也，但於忘中生一觅意，即真心也。 恍惚之中，始见真心，真心既见，就此真心生一真意，加以反光内照，庶百窍备陈，元精吐华矣！ 要在乎无中生有，有中生无，到这境界，并真心俱忘而弃之也。 我以无待己，则真息绵绵，真息绵绵之时，后天之气以定，后天隐则先天之气见，故阳生焉！ ．阳生者，先天之气自气穴流出，则至于肾中， 如喷泡然。 盖两肾中间有一缕，透气穴，乃父母交娠之后，始生脉络也。 故先天之气游之，既觉如斯，则一身百脉，尽若春生。 春融融而渐长，此时先天之气始立，先天立而后天愈退藏矣！ 然后可以微动采取之意。 意者以目垂观於心，却以心放下，送入阳宫，徐收而又纵，则阳起矣！ 余见一阳论 采之意生于心，心生于目，故老子曰：吾尝观心得道，亦至灵，夫真息既定，内光乃神光，此心乃真心，真心生意，神光烛心，故常为之说曰，目视心，心生意，意采铅。 若阳生未融盛，而遽采之，则一念采意既萌，后天复起，故日了命，实关于性地。 性者，凡所有相，皆是虚妄，既无着相，则虚妄除而真理显矣！ 真理方明，而一念生，岂非复其虚妄之相乎！ 故伺阳长而始采，则勃然而升，先天气盛，而后天伏不暇矣！ 采之升也，实有异焉！ 醺然而上，至于脐而稍止，徐止脐之上，则息，方名曰铅金也。 金生水，故汞产于心，云从龙，风从虎之理兆矣，风平而雨降，自然铅汞相投，相吞相啖，金生水，水生木，木又生火，木爱金，而金恶木，乃交会之道也。 夫金克木，反有爱恶之意焉！ 盖金木之本性耳。 吾以本然之天，故能用五行本然之性，亦不过譬喻耳。 乃先天也，五行在何处，但不如是，则不能达其理。 采取之道既明，交会之理复露，再有叮嘱，采取不可太缓，太缓则老而不可用，而后天之气杂矣！ 学人以《交会图》参看，则思过半矣！ 诗曰 醺醺和气酿春风，一点阳生恍惚中，",
      "translated_text": "Gathering involves drawing true yang from the Kidney Palace, while taking involves extracting true mercury from the Heart Field. When gathering is possible, gather—gathering must yield its use. If gathered at the wrong time, the dragon will not descend, the tiger will not ascend; though one may see blood and qi surging, rushing to and fro, the deluded will mistake this for union! Yet they know not that *li* and *kan* remain *li* and *kan*—true yang within yin and true yin within yang stand apart, unmoved. When the qi and vessels are arrested by a single thought, qi swiftly enters the meridians, and within *li* and *kan*, harm befalls lead and mercury instead. Though called \"nurturing qi,\" it is in truth the depletion of original qi at the center. Original qi in man appears only in perfect stillness—this is the qi of prior heaven. The qi of posterior heaven circulates ceaselessly, yet men, drowned in desire, fail to examine it closely. At the moment of slight composure, when the heart is free of other uses, one may then perceive the qi’s ascent and descent—yet mistakenly gather it as prior-heaven qi, thereby inviting harm. Thus do modern scholars often suffer strange ailments, all for this reason.\n\nMan’s illnesses arise solely from obstructions in qi and vessels. Qi naturally regulates itself, yet if one forces it to ascend, the spleen, stomach, lungs, liver, ears, eyes, mouth, and nose are injured; if forced to descend, it is like water breaching a long dike, rushing downward with irresistible force. How could the true substance endure? Pitying those who speak of the elixir yet harm their own lives, I place the *Illustrated Discourse on Gathering* first, though it reveals celestial secrets outright. Yet if those with aspirations for the golden elixir instead destroy their lives, I offer this correction through right principle. The Most High cherishes life and will not fault me. Thus in this scroll, I depict with the knife and spoon of mystery and yellow, the infant boy and maiden girl—all metaphors—sweeping aside delusions to retreat three leagues, so that the wise may see and grasp the *Can Tong Qi*, while the foolish, upon seeing, may dissolve their confusion like melting ice, each detail clear and bright as a mirror revealing every hair.\n\nThose who seek the golden elixir must first cultivate hidden virtue to fulfill human affairs, then hold to the previous discourse on the heart—only then will the great medicine be born and the illustrated forms appear.\n\nThe method of gathering arises from the heart, for the heart is the pivot and axis of all transformations. One must forget it to seek it: forgetting is the ordinary heart, seeking is the true heart. Yet within forgetting, a single intent to seek arises—that is the true heart. In the midst of vagueness and indistinctness, the true heart first appears. Once the true heart is seen, from this true heart generate a true intent, and with reversed light turn inward to illuminate. Then the hundred apertures will all unfold, and original essence will blossom forth! The key lies in generating being from non-being, and non-being from being. When this state is reached, even the true heart is forgotten and discarded. With nothing left to depend on, true breathing becomes continuous. When true breathing is continuous, the qi of posterior heaven settles, and as posterior heaven recedes, the qi of prior heaven appears—thus yang is born!\n\nWhen yang is born, the qi of prior heaven flows from the qi cavity into the kidneys, like bubbles welling up. Between the two kidneys runs a thread that pierces the qi cavity—this is the meridian formed at the moment of conception by one’s parents. When the qi of prior heaven courses through it, one feels this sensation, and the hundred vessels of the body all become like spring’s vitality, gradually growing in warmth. At this time, the qi of prior heaven is first established, and as prior heaven stands firm, posterior heaven retreats further. Only then may one subtly arouse the intent to gather.\n\nThis intent is born of the eyes gazing downward upon the heart, yet the heart is released and sent down into the Yang Palace. Gently gather, then release—thus yang rises. *(See \"Discourse on the First Yang.\")*\n\nThe intent to gather arises from the heart, and the heart arises from the eyes. Thus Laozi said: \"I have long observed the heart to attain the Dao\"—it is most numinous. When true breathing is settled, the inner light is the spirit-light; this heart is the true heart. The true heart generates intent, and the spirit-light illumines the heart. Hence the constant teaching: the eyes gaze upon the heart, the heart generates intent, and intent gathers lead.\n\nIf yang has not yet flourished and one hastily gathers it, the moment the intent to gather arises, posterior heaven revives. Thus the cultivation of life is fundamentally tied to the ground of nature. Nature is such that all appearances are illusory and false. Once attachment to appearances is gone, falsehood vanishes and true principle is revealed. Yet when true principle is just made clear, if a single thought arises, does this not return to the illusion of appearances? Therefore, wait until yang has grown before gathering—then it will surge upward vigorously. When the qi of prior heaven is abundant, posterior heaven has no chance to resist.\n\nThe ascent of gathering is truly extraordinary! It rises in a warm, intoxicating manner, reaching the navel before pausing briefly. When it rests just above the navel, it settles—only then is it called lead-gold. Gold generates water, thus mercury is born in the heart. The principle that clouds follow the dragon and wind follows the tiger is now manifest. When the wind is calm, rain descends, and naturally lead and mercury unite, swallowing and devouring each other. Gold generates water, water generates wood, wood in turn generates fire. Wood loves gold, yet gold despises wood—this is the way of their union. Though metal overcomes wood, how can there be love and hatred? It is simply the inherent nature of metal and wood. I employ the inherent nature of heaven, thus I use the inherent nature of the five phases—though this is but a metaphor. For where do the five phases exist in prior heaven? Yet without such analogies, the principle cannot be conveyed.\n\nOnce the method of gathering is clear and the principle of union is revealed, there remains one further admonition: gathering must not be too slow. If too slow, it will age and become unusable, and the qi of posterior heaven will mix in. Let the adept study the *Illustrated Discourse on Union*—then more than half the meaning will be understood.\n\nA poem says:\nIntoxicating harmonious qi brews the spring wind,\nA single yang is born in the midst of vagueness and indistinctness...",
      "overlap_context": "could they be limited to this alone? This describes the body; its application will be discussed separately in what follows.\n\n*End of Upper Scroll of The Jade Clarity Golden Casket: Secret Writ of Azure Radiance, Golden Treasure Inner Refinement Elixir Formulae*\n*Middle Scroll of The Jade Clarity Golden Casket: Secret Writ of Azure Radiance, Golden Treasure Inner Refinement Elixir Formulae*\n*Illustrated Discourse on Gathering and Refining*\n*Composed by Perfected Master Purple Yang, Zhang Pingshu*",
      "start_char": 4416,
      "end_char": 5637,
      "start_sentence": 207,
      "end_sentence": 246,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.97889852523804,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\玉清金笥青华秘文金宝内炼丹诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "无自有生无胜有，色从空裹色还空。 升於脐上铅情见，产自心源汞性通， 定裹见真真裹定，坎离交会雨蒙蒙。 诗曰 木为龙兮金为虎，坎户生男引离女， 要知造化有根源，不离真火生於子。 交会图论 恍兮惚兮中有象，杳兮冥兮中有物。 古先哲常持此以警学者，盖恍惚冥定之象也，惟定可以炼丹，不定而阳不生，阳生之后不定而丹不结。 故才以意采铅而遽止其意，止有时而升有刻，盖始生无过一气耳。 升于脐则为铅，故心斯意而无用矣！ 铅自能引汞，汞自能寻铅，恍惚杳冥之中，交姤之理毕矣！ 我得师之口诀，并泄之。 宜秘！ 宜秘！ 默而视之，念勿出声。 若有知道之士，宿有善绿，逢此玄机至宝之道，凡遇口诀，记而勿书，书而勿见，则某实戴其德。 余从师一十年，凡有所得，尽底陈露，愿与同志之士共宝之。 此乃玉清金笋束极青华长生度世上品内炼金丹宝诀。 玄律至严，某不识避就，撰为此书。 亦前三旬表奏天廷，继得报应，始敢吐露下笔。 下笔之时，心蠢蠢然而汗落于纸，涕泣交零，但愿志士得之，幸勿相累，同成胜果，共证仙阶。 吁！ 知我者谓我心忧，不知我者谓我何求。 幸心心相照，某不胜梼告之至，诸仙幸鉴！ 采取交会口诀 忘裹觅，觅裹忘，忘中见，见中忘，阳生矣！ 忘中采，采中忘，忘裹升，升裹见，见裹变，铅成矣！ 定中起，意中升，忘中用，铅引汞矣！ 铅合汞於内，精会神於外，交会矣！ 铅汞精神，合而为一，却将一念，使之落黄庭，归鼎矣！ 口诀中口诀 打合铅汞，须用一意，动采一阳，须用以静而生定。 莫怪平叔多兜揽，却绿学者尽痴迷咦！ 说尽来。",
      "translated_text": "Where nothing gives birth to being, and form emerges from emptiness only to return to it,\nLead’s essence rises above the navel, while Mercury’s nature flows from the heart’s source.\nWithin stillness, truth appears—within truth, stillness abides.\nWhen Kan and Li unite, a misty rain descends.\n\nA poem says:\nWood becomes the Dragon, Metal the Tiger;\nKan’s gate births the boy, drawing Li’s maiden.\nTo know the workings of creation’s root,\nLook not beyond the true fire born at midnight.\n\n*Discourse on the Diagram of Union*\nVague and indistinct, yet within it lies form;\nDim and obscure, yet within it lies substance.\nThe ancient sages often used this to warn disciples—\nfor only in the state of indistinct stillness can the elixir be refined.\nWithout stillness, yang does not arise;\nafter yang arises, without stillness, the elixir does not coalesce.\nThus, when the mind first gathers lead, it must not linger—\nstillness has its time, ascent its moment.\nFor what first emerges is nothing more than a single breath.\nWhen it rises to the navel, it becomes lead—\nthen the heart’s intent must cease, for it is no longer needed.\nLead naturally draws mercury, mercury naturally seeks lead;\nwithin the vague and dim, the principle of union is complete.\n\nI have received my teacher’s oral instructions and now reveal them.\nGuard them well! Guard them well!\nRead in silence, utter no sound.\nIf one who understands the Dao—one with karmic roots—\nencounters this profound and precious teaching,\nlet them commit the oral instructions to memory but not to writing,\nor if written, let them not be shown.\nThen I shall truly be indebted to their virtue.\n\nI studied under my teacher for ten years,\nand all that I received, I now lay bare,\nwishing to share it with those of like aspiration.\nThis is the *Supreme Inner Refinement Elixir of Golden Essence and Jade Purity*,\nthe *Upper-Grade Method for Transcending the World and Attaining Immortality*.\nThe celestial laws are most strict—\nunmindful of consequences, I have composed this text.\nAfter submitting a memorial to the heavenly court for thirty days,\nI received a response before daring to set it down in writing.\nAs I wrote, my heart trembled, sweat fell upon the page,\nand tears mingled with my brushstrokes.\nMay those of true aspiration obtain this,\nand may they not implicate me—\ntogether, may we achieve the supreme fruit and ascend the immortal ranks.\n\nAlas!\nThose who know me call me anxious of heart;\nthose who do not ask what I seek.\nMay our hearts illuminate one another—\nI can do no more than earnestly implore.\nMay the immortals deign to witness this!\n\n*Oral Instructions on Gathering and Union*\nSeek within forgetting, forget within seeking;\nwithin forgetting, see—within seeing, forget:\nthen yang is born.\nForget within gathering, gather within forgetting;\nwithin forgetting, rise—within rising, see;\nwithin seeing, transform:\nthen lead is formed.\nArise within stillness, ascend within intent;\nact within forgetting:\nthen lead draws mercury.\nLead and mercury unite within,\nessence and spirit converge without:\nunion is achieved.\nLead, mercury, essence, and spirit merge as one—\nthen direct a single thought to descend to the Yellow Court,\nreturning to the crucible.\n\n*The Innermost Oral Instruction*\nTo fuse lead and mercury, use a single intent.\nTo gather the first yang, stillness must give birth to stillness.\nNo wonder Lü [Dongbin] often spoke in riddles—\nyet still, disciples remain lost and deluded.\nSo much said—yet this is all.",
      "overlap_context": "annot be conveyed.\n\nOnce the method of gathering is clear and the principle of union is revealed, there remains one further admonition: gathering must not be too slow. If too slow, it will age and become unusable, and the qi of posterior heaven will mix in. Let the adept study the *Illustrated Discourse on Union*—then more than half the meaning will be understood.\n\nA poem says:\nIntoxicating harmonious qi brews the spring wind,\nA single yang is born in the midst of vagueness and indistinctness...",
      "start_char": 5637,
      "end_char": 6290,
      "start_sentence": 247,
      "end_sentence": 281,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.644126892089844,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\玉清金笥青华秘文金宝内炼丹诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "咄！ 满眼天花散乱飞，门前流水浪声微，青聪载取青娥去，顷刻青聪独自归。 青娥在我 巫峡云生十二峰，故宫箫管寂寥中，星桥路隔青山外，若要相逢永不逢。 是性又是命。 或问：孰为交姤？ 日：《采取图》心下一窍，乃交会之地，不可以有形求，不可以无形取，但铅升之际，阳气上 。 夫自气穴降为一阳宫， 我采以意， 汞降之际会，气降为 ，盖汞铅生，铅升於脐上， 为精光所烛，故曰铅。 铅犹表也，汞犹影也，表动影随，故汞降以如之。 阳铅之升，不可谓之纯阳，中含精光为铅，盖亦属阴； 阴汞之降，不可谓之纯阴，心生汞，心为神，含汞遇神光，而后可用。 盖亦属阳，阳中有阴，阴中有阳，二气交感，凝结不散，遂成玄珠，如黍米。 或问：铅乃一阳，一阳乃先天一气耳。 汞何物为之？ 曰：铅与汞，皆先天之物； 铅乃先天气，汞乃先天灵，此气乃命之母，此灵乃性之子。 可以曰铅汞，可以日性命，诸得道之宗师，谁肯直泄至此？ 又问曰：心下一窍，何窍耳？ 曰：混沌神房者，此也，乃精光目光之气，幻而为之，精光华腾为 ，目光垂为 。 精虽元精，然无日用之精，则元精不见。 又如不信，譬如有水则潮兴白气，未闻白气兴於地也。 水乃精也，白气乃华也，神虽元神，然日用之神而不役，然后元神见。 譬之皓月当天，云收而光始下烛，清诤即无云也，乘光即照临也。 精虽属阴而精华属阳，目光属阳而照於内，则亦属阴，光华相遇而成一窍，以气感气，使二物会于其中。 物之成也，有精气焉，有元气焉，工夫周足，遂为真人。 盖生生之意，寓于此矣！ 所以能灵而神者，此也。",
      "translated_text": "Hark! Flowers scatter like stars across the sky,\nbefore the gate, the stream’s murmur fades—\nthe green boat bears the green maiden away,\nand in an instant, the green boat returns alone.\n\nThe green maiden dwells within me—\nclouds rise o’er Wu Gorge’s twelve peaks,\nin the deserted palace, flutes fall silent,\nthe star bridge lies beyond the blue mountains,\nand if you seek reunion, you shall never meet.\nThis is both nature and destiny.\n\nSomeone asks: What is *jiaogou*?\nThe Master replies: The aperture beneath the heart in the *Caiqu Tu* is the place of union. It cannot be sought through form, nor grasped through formlessness. Only when lead ascends does yang qi rise above.\n\nFrom the qi cave, it descends to the Palace of First Yang—\nI gather it with intent.\nAs mercury descends, they meet,\nqi sinking into [the aperture].\nFor when mercury and lead are born,\nlead ascends above the navel,\nillumined by the radiance of essence—\nthus it is called *lead*.\nLead is like the body, mercury like the shadow;\nwhen the body moves, the shadow follows—\nso mercury descends in response.\n\nThe ascent of yang lead cannot be called pure yang,\nfor it contains the radiance of essence—thus it is also yin.\nThe descent of yin mercury cannot be called pure yin,\nfor the heart generates mercury, and the heart is spirit.\nWhen mercury encounters the radiance of spirit, it becomes usable—\nthus it is also yang.\nWithin yang there is yin, within yin there is yang.\nThe two qi intermingle, congeal, and coalesce,\nforming the Mysterious Pearl, like a grain of millet.\n\nSomeone asks: Lead is the first yang—\nthe first yang is nothing but primordial qi.\nThen what is mercury?\nThe Master replies: Both lead and mercury are primordial things.\nLead is primordial qi, mercury is primordial numen.\nThis qi is the mother of destiny,\nthis numen is the child of nature.\nOne may call them lead and mercury,\nor nature and destiny—\nwhich of the accomplished patriarchs would reveal this so plainly?\n\nAnother asks: What is this aperture beneath the heart?\nThe Master replies: It is the *Hundun* Spirit Chamber,\nformed by the qi of essence-light and eye-light—\nessence-light surging upward as [yang],\neye-light descending as [yin].\nThough essence is primordial essence,\nwithout the essence of daily use, primordial essence cannot appear.\nIf you doubt this, consider:\nwhere there is water, mist rises as white qi—\nhave you ever seen white qi rise from dry earth?\nWater is essence, white qi is its radiance.\n\nThough spirit is primordial spirit,\nonly when the spirit of daily use is not enslaved does primordial spirit manifest.\nLike the bright moon in the sky—\nonly when clouds disperse does its light shine down.\nPurity is the absence of clouds,\nriding the light is its illumination.\nThough essence belongs to yin, its radiance belongs to yang;\nthough eye-light belongs to yang, when it shines inward, it too belongs to yin.\nWhen radiance and light meet, they form an aperture—\nqi responds to qi, drawing the two substances to converge within.\nAll things come into being through essence and qi,\nthrough primordial qi.\nWhen the work is complete and the effort full,\none becomes a True Person.\nFor the intent of ceaseless generation resides here—\nthis is why it is numinous and divine.",
      "overlap_context": "rcury.\nLead and mercury unite within,\nessence and spirit converge without:\nunion is achieved.\nLead, mercury, essence, and spirit merge as one—\nthen direct a single thought to descend to the Yellow Court,\nreturning to the crucible.\n\n*The Innermost Oral Instruction*\nTo fuse lead and mercury, use a single intent.\nTo gather the first yang, stillness must give birth to stillness.\nNo wonder Lü [Dongbin] often spoke in riddles—\nyet still, disciples remain lost and deluded.\nSo much said—yet this is all.",
      "start_char": 6290,
      "end_char": 6920,
      "start_sentence": 282,
      "end_sentence": 308,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.836968898773193,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\玉清金笥青华秘文金宝内炼丹诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "或曰：然则交会之后，安得此珠落于黄庭，归于鼎内？ 曰：二物聚时情性合，五行全矣，虎归于山，龙归于渊。 目光还而精气复此， 落于黄庭，归于鼎内。 会有关捩子么缠恍恍惚惚，万孔生春， 秘秘秘。 此数言非正经原有，乃学者有所得之谓也。 或问：阳生于上，遽止其意，安保不复降？ 曰：大哉！ 问黄庭之下，有一丹室之门户也，意生则上，故阳升意止则一，故阳则不可得而降矣！ 炉鼎则在乎一之内，正属土，故 备五行之正气，成天地之全形也。 或问炉鼎之法。 曰：黄庭之在人身如此，至一阳上升，如此珠落于其中之候， 如此即炉鼎也， 黄庭固属土也。 至于中之中，盖属土中之土也。 故落于其中，而成鼎器，五行各厚其基，何谓厚其基？ 夫母求子，子恋母，丹之法也，皆取其本然之性，既归于鼎而气各趁之，如子之恋母，故静坐之中，神光下垂，则归于鼎，精华上升亦如之。 至於行住坐外，如龙养珠，如鸡抱卵，而气各归之，一身之脉络皆为之，务在乎勿忘而勿助长耳。 学道之士然乎！ 其不然乎！ 在某之丹法若是而已矣。 诗曰 何劳姹女与婴儿，透彻分明说与伊， 身里乾坤颠倒处，壶中日月运行时。 要知一者为阳用，须识一中作气机， 天使紫阳来说尽，后来何必更寻师。 真泄天机图 到这田地，知这道理，且莫欢喜。 咄！ 未知如何想。",
      "translated_text": "Should one ask: Once the union is achieved, how does this pearl descend into the Yellow Court and return to the crucible within?\n\nIt is said: When the two substances gather, emotion and nature unite, and the Five Phases are complete—like the tiger returning to the mountain, the dragon to the abyss. The eye’s light turns inward, and essence-qi is restored here, descending into the Yellow Court, returning to the crucible within. At the moment of convergence, there is a pivot, a hinge—vague yet luminous, as ten thousand pores burst into spring. Secret, secret, secret.\n\nThese words are not found in the original classics; they are what the adept has realized.\n\nShould one ask: Yang arises above—if one abruptly halts its ascent, how can one ensure it will not descend again?\n\nIt is said: A profound question! Below the Yellow Court lies the gate of the Cinnabar Chamber. When intent arises, yang ascends; when intent ceases, it unifies—thus yang cannot descend. The furnace and crucible reside within this unity, belonging to Earth, and thus embody the upright qi of the Five Phases, completing the full form of Heaven and Earth.\n\nShould one ask of the method of furnace and crucible:\n\nIt is said: The Yellow Court within the human body is thus—when the first yang ascends, and the moment this pearl descends into it arrives, *this* is the furnace and crucible. The Yellow Court is inherently Earth. As for the center within the center, it is Earth within Earth. Thus, when the pearl descends into it, it forms the crucible vessel. The Five Phases each strengthen their foundation—what does \"strengthen their foundation\" mean? The mother seeks the child, the child clings to the mother—this is the method of the Elixir. All rely on their inherent nature. Once returned to the crucible, each qi follows its course, like the child clinging to the mother. In quiet sitting, when the spirit’s light descends, it returns to the crucible; when essence’s radiance ascends, it does the same. In walking, standing, sitting, or lying down—like the dragon nurturing its pearl, like the hen brooding her egg—each qi returns to it. All the meridians of the body become thus. The key lies in neither forgetting nor forcing growth.\n\nO students of the Dao—is it so? Or is it not?\n\nIn my method of the Elixir, it is thus and no more.\n\nA poem says:\nWhy trouble with the Maiden and the Infant?\nI speak to you with utter clarity:\nWhere Heaven and Earth reverse within the body,\nThe sun and moon revolve within the flask.\n\nKnow that the One is the function of yang—\nyou must recognize the One as the pivot of qi.\nHeaven bade Purple Yang to reveal it all—\nwhy seek another master thereafter?\n\n*The True Diagram of Heaven’s Mechanism Leaked*\n\nHaving reached this state, having grasped this principle—do not rejoice too soon.\n\nHmph! You still do not know how to contemplate it.",
      "overlap_context": "\nThough essence belongs to yin, its radiance belongs to yang;\nthough eye-light belongs to yang, when it shines inward, it too belongs to yin.\nWhen radiance and light meet, they form an aperture—\nqi responds to qi, drawing the two substances to converge within.\nAll things come into being through essence and qi,\nthrough primordial qi.\nWhen the work is complete and the effort full,\none becomes a True Person.\nFor the intent of ceaseless generation resides here—\nthis is why it is numinous and divine.",
      "start_char": 6920,
      "end_char": 7454,
      "start_sentence": 309,
      "end_sentence": 335,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.97561526298523,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\玉清金笥青华秘文金宝内炼丹诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "宝剑沉埋古狱边。 虹光夜夜上冲天，虎龙战罢三田静，何处求他汞与铅。 嘎嘎嘎，嘻嘻嘻，且休认鹿为马，一个玄珠在泥底。 牛女桥边路不通，河车运去杳无踪，凭谁问得真消息，吹彻重关藉巽风。 真泄天机图论 金丹之图既成，虑天机之尤秘，且论五行之颠倒，述水火之流行，明药材之进退，体日月之循环。 余前所着三篇之文尽矣！ 今虑夫学者未明，故为此书。 此书也，直泄天机，洞见毫发，化顽石而成金，点瓦砾而成玉，不啻过也。 夫两目为役神之舍，顾赡视瞩，神常不得离之。 两耳为送神之地，盖百里之音，闻于耳而神随之而又去。 两鼻为劳神之位，随机而辨之者，谁神也？ 使耳目口鼻皆如眉，则神岂不安而全之！ 夫如是则不为后天也，亦不劳修炼也。 大抵忘於目则神归于鼎，而烛於内，盖绵绵若存之时，目垂而下顾也； 忘於耳则神归于鼎，而闻於内，盖绵绵若存之时，耳内听於下也； 忘於鼻则神归于鼎，而吸於内，盖真息既定之时，气归元海之理，合而言之，俱忘而俱归于鼎，而合於内矣！ 还更有口诀么？ 口诀",
      "translated_text": "A treasured sword lies buried by an ancient prison’s side.\nNightly, rainbow light surges upward to the sky.\nTiger and dragon battle—once the Three Fields grow still,\nWhere then to seek your mercury and lead?\n\nHa-ha-ha! Hee-hee-hee!\nBeware mistaking deer for horse—\na single Mysterious Pearl lies deep in mud.\nBy Oxherd and Weaver’s bridge, the path is blocked;\nthe River Chariot’s passage leaves no trace behind.\nWho dares inquire of the true message?\nOnly the Wind of Xun, blowing through the layered passes, suffices.\n\n*Discourse on the True Diagram of Heaven’s Mechanism Leaked*\n\nOnce the diagram of the Golden Elixir is complete, lest the celestial mechanism remain too deeply hidden, let us discuss the inversion of the Five Phases, describe the flow of water and fire, clarify the advance and retreat of medicinal materials, and embody the cyclical movement of sun and moon.\n\nAll that needed saying in my three previous essays has been said.\nYet fearing that students may still not grasp it, I have written this book.\nThis book lays bare the celestial mechanism, revealing even the finest detail—\ntransforming stubborn stone into gold, transmuting shards into jade—\nno exaggeration here.\n\nThe two eyes are the dwelling where spirit is enslaved;\nwherever one gazes or looks, spirit cannot depart.\nThe two ears are the place where spirit is sent forth—\nsounds from a hundred leagues away enter the ear, and spirit follows, then leaves.\nThe two nostrils are the station where spirit is wearied—\nwho but spirit discerns and distinguishes with each breath?\n\nIf only the eyes, ears, mouth, and nose were like the brows,\nwould not spirit then rest and remain whole?\nThus, one would no longer be bound by the postnatal,\nnor need to labor in cultivation.\n\nIn general:\nForget the eyes, and spirit returns to the crucible, illuminating within—\nfor in the state of continuous, subtle presence, the eyes lower and gaze downward.\nForget the ears, and spirit returns to the crucible, hearing within—\nfor in the state of continuous, subtle presence, the ears listen inwardly below.\nForget the nose, and spirit returns to the crucible, drawing breath within—\nfor when true breathing is settled, qi returns to the Ocean of Origin.\n\nSpeaking as one, when all are forgotten, all return to the crucible and unite within.\nIs there yet another oral instruction?\nThe oral instruction—",
      "overlap_context": "aiden and the Infant?\nI speak to you with utter clarity:\nWhere Heaven and Earth reverse within the body,\nThe sun and moon revolve within the flask.\n\nKnow that the One is the function of yang—\nyou must recognize the One as the pivot of qi.\nHeaven bade Purple Yang to reveal it all—\nwhy seek another master thereafter?\n\n*The True Diagram of Heaven’s Mechanism Leaked*\n\nHaving reached this state, having grasped this principle—do not rejoice too soon.\n\nHmph! You still do not know how to contemplate it.",
      "start_char": 7455,
      "end_char": 7880,
      "start_sentence": 336,
      "end_sentence": 354,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.002681255340576,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\玉清金笥青华秘文金宝内炼丹诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "鸡能抱卵心常听。 或问：金丹之道，耳目口鼻，固亦得闻之矣，心固不言可知也，肝胆脾胃肺无用之物也，还亦无用之中而有用者也？ 余答之曰：此固已到而后知其理，但余誓以无隐，夫何隐之有？ 吾初从师亦叩矣！ 师赠我以诗曰： 余初未达此理，后到此田地，始信师言之不我欺也。 今以师不言之者，并言之。 夫五行之用，不可缺一，故绵绵若存之顷，脾气与胃气相接而归於心缕； 肝气与胆气相接，后大小肠接於肾缕； 肺气伏心气而通於鼻。 是气也，皆静定之余，元气周流，自东而西，自南而北之气也。 西南乃气之会也，气合而归于此，却自夹脊直透上中丹田，而降於肾腑。 两肾中间，有治命桥一带，故寒山子日上有接神窟，横安治命桥者，此也，气降至于此，阳气与精气盛而上冲，与此气相接於一，则固围於鼎器之外，日用之则日增。 经营之力，故鄞鄂之成肇，於此也。 忽然有一物，超然而出，不内不外，金丹之事，不言可知矣！ 一半玄之又玄，一半者何也？ 日：金丹之士，到此则一半矣。 超然而出者，乃玄关一窍也。 其大无外，其小无内， 有形之中也， 无形之中也，先就有形之中寻无形之中，乃因命而见性也； 就无形之中寻有形之中，乃因性而见命也。 先性固难，先命则有下手处，譬之万里虽远有路耳。 先性则如水中捉月，然及其成功一也。 先性者或又有胜焉！ 彼以性制命，我以命制性，故也未容轻议，用力不得到者，知其然也。 未见不必存之以有，恐至着相。 或又曰：子画图中多有窍，何也？ 日：斯窍也，非采取交会图中之窍也。 盖一阴一阳之谓道，往来不可穷，用之则充塞于一身之中。 此物之作用，不用则归藏於心田之侧，了无形像，然则何物耳？ 回意之主耳，左属阳，右属阴， 秘秘秘秘，到这裹方是返太极处。 日返太易者自太极，返太极者自太和，致太和者自阴阳始，故曰阴阳和而风雨时，嘉禾生者，譬之若此。 大衍五十，天数一，地数二，天三地四，天五地六，天七地八，天九地十，阳奇阴耦。 天数二十五，地数三十，合而为五十有五。 大衍之数，五十去五，以象五行者，后之鼎内外 是也。 又就其中克一，象太极之不动，其用四十有九。 又就其中克一，以为鄞鄂，其用四十有八。 学人行炉鼎用火之法，以四卦为主，以六十卦为用，存乾坤坎离也。 又以大衍图求其象，则循环之理明矣！ 周天之法泄矣！ 如或未明，更请看炉鼎图论云。 一点蟾光照太虚，金蟆水裹吸还嘘，高低犹是纯阴体，何事生阳用有余。 论 太虚寥廓，皓月集然，雪浪翻腾，金蟆吐耀。 人见月之所以明，而曰金精，精盛则月明焉！ 孰知金丹之所以生者，性也。 水者喻坎宫也，金蟆者，喻一点真阳之窍也，元性喻月性之用也，性之初见，如星大，圆陀陀，光烁烁，未足以见性，但气质之性稍息，而元性略见，如云开则月见，顷合则亦然耳。 至於不时时存之，则可没，与见未见时无以异也。 故金丹之士，才见此物分明，便是元气产矣！ 遂以而用之。 譬之见贼便捉，毋使再逸。 然以之收於鼎器之中，而一点元气之真，终乎不可得出矣！ 以丹田为日，以心中元性为月，日光自返照月。 盖交会之后，宝体乃生金也。",
      "translated_text": "The hen can brood her eggs with her mind ever attuned.\nSomeone asked: \"In the Dao of the Golden Elixir, the ears, eyes, mouth, and nose have already been discussed, and the heart’s role is self-evident. But what of the liver, gallbladder, spleen, stomach, and lungs—are these truly useless organs? Or do they, too, hold use within their seeming uselessness?\"\n\nI answered: \"This principle is only understood upon reaching that stage. Yet I have vowed to conceal nothing—what could I possibly hide? When I first sought my teacher, I too asked this. My teacher bestowed upon me a poem, saying:\n\n*At first, I did not grasp this truth,\nBut once I reached this field,\nI knew my teacher had not deceived me.*\n\nNow, I shall reveal what my teacher left unsaid. The functions of the Five Phases cannot lack even one. Thus, in the state of continuous, subtle presence, the spleen’s *qi* and the stomach’s *qi* intertwine and return to the heart’s thread; the liver’s *qi* and the gallbladder’s *qi* intertwine, then the large and small intestines connect to the kidney’s thread; the lung’s *qi* submits to the heart’s *qi* and communicates with the nose. This *qi*, in the stillness after settling, is the primordial *qi* circulating—from east to west, from south to north.\n\nThe southwest is the meeting place of *qi*. When *qi* converges here, it then passes straight through the spine to the upper and middle *dantian*, descending to the kidney palace. Between the two kidneys lies a strip called the *Bridge of Life Governance*. As Cold Mountain said: *'Above is the cave where spirits gather; horizontally lies the Bridge of Life Governance.'* When *qi* descends here, yang *qi* and essence *qi* surge upward, merging with this *qi* as one. Then, they encircle the crucible’s exterior, and with daily use, they daily increase. Through the power of cultivation, the *yin* and *yang* banks take form here.\n\nSuddenly, something transcends and emerges—neither inside nor outside. The matter of the Golden Elixir is self-evident without words. Half is the profound within the profound; what is the other half? It is this: when a cultivator of the Golden Elixir reaches this point, they have attained half. That which transcends and emerges is the *Mysterious Pass*, the single aperture. Vast without exterior, minute without interior—within the formed, within the formless. First, seek the formless within the formed: this is seeing *nature* through *life*. Then, seek the formed within the formless: this is seeing *life* through *nature*. To begin with *nature* is difficult; to begin with *life* offers a starting point. Though ten thousand miles may seem distant, there is a path. To begin with *nature* is like grasping the moon in water. Yet in the end, success is the same. Those who begin with *nature* may even surpass! They use *nature* to govern *life*, while I use *life* to govern *nature*—thus, it is not for me to lightly judge. Those who fail to reach this through effort understand only the surface. Without seeing, one need not cling to existence, lest they fall into attachment.\"\n\nSomeone else asked: \"In your diagrams, there are many apertures—why?\" I answered: \"These apertures are not those in the *Gathering and Union* diagrams. For the Dao is the interplay of *yin* and *yang*, boundless in its coming and going. When employed, it fills the entire body. When unused, it retreats to the side of the heart-field, leaving no form or image. What is it, then? It is the master of returning intention. Left belongs to *yang*, right to *yin*—secret, secret, secret, secret—only here is the return to the Great Ultimate.\n\nTo return to the *Great Simplicity* is from the Great Ultimate; to return to the Great Ultimate is from the *Great Harmony*; to achieve the *Great Harmony* begins with *yin* and *yang*. Thus it is said: *'When yin and yang harmonize, wind and rain come in season, and fine grain grows.'* This is the analogy.\n\nThe *Great Expansion* is fifty. Heaven’s number is one, earth’s is two; heaven three, earth four; heaven five, earth six; heaven seven, earth eight; heaven nine, earth ten. *Yang* is odd, *yin* is even. Heaven’s numbers total twenty-five, earth’s thirty, together making fifty-five. The number of the *Great Expansion* is fifty, minus five to represent the Five Phases—this corresponds to the crucible’s interior and exterior. Then, subtract one more to symbolize the unmoving Great Ultimate, leaving forty-nine in use. Subtract one more to form the *yin* and *yang* banks, leaving forty-eight in use.\n\nThe practitioner’s method of the furnace, crucible, and firing employs the four trigrams as the foundation and the sixty-four hexagrams as application, focusing on *Qian*, *Kun*, *Kan*, and *Li*. Using the *Great Expansion* diagram to seek its imagery, the principle of circulation becomes clear, and the method of the *Celestial Cycle* is revealed. If still unclear, consult the *Discourse on the Furnace and Crucible*.\n\n*A speck of toad-light illumines the great void,\nThe golden toad in water inhales and exhales.\nHigh and low remain but pure yin’s body—\nWhy does generating yang require surplus?*\n\n**Discourse:**\nThe great void is vast and boundless; the bright moon shines alone. Snow-like waves surge, and the golden toad radiates. People see the moon’s brightness and call it *metal essence*—when essence flourishes, the moon shines. But who knows that the Golden Elixir’s generation arises from *nature*? Water symbolizes the *Kan* palace; the golden toad symbolizes the single aperture of true *yang*; primordial *nature* symbolizes the moon’s function. When *nature* first appears, it is star-like, round and luminous. Yet this is not yet the full manifestation of *nature*—only when the *qi*-based *nature* briefly stills does primordial *nature* slightly emerge. Like the moon appearing when clouds part, or vanishing when they close, if not constantly preserved, it may disappear, no different from when it was unseen.\n\nThus, when a cultivator of the Golden Elixir clearly sees this thing, primordial *qi* is born! They must then employ it—like spotting a thief and seizing them, lest they escape again. Yet when gathered into the crucible, this speck of true primordial *qi* can never depart. Take the *dantian* as the sun and the heart’s primordial *nature* as the moon. The sun’s light naturally reflects upon the moon. After union, the precious body gives birth to metal.\"",
      "overlap_context": "ous, subtle presence, the eyes lower and gaze downward.\nForget the ears, and spirit returns to the crucible, hearing within—\nfor in the state of continuous, subtle presence, the ears listen inwardly below.\nForget the nose, and spirit returns to the crucible, drawing breath within—\nfor when true breathing is settled, qi returns to the Ocean of Origin.\n\nSpeaking as one, when all are forgotten, all return to the crucible and unite within.\nIs there yet another oral instruction?\nThe oral instruction—",
      "start_char": 7880,
      "end_char": 9106,
      "start_sentence": 355,
      "end_sentence": 407,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.00754141807556,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\玉清金笥青华秘文金宝内炼丹诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "月受日气，故初三生一阳者，丹既居鼎，觉一点灵光自心常照，而无昼夜，一阳生于月之八日，而二阳产矣t二阳者，丹之金炁少旺，而元性又少现，自二阳生于月之望，而三阳纯矣！ 三阳纯者，是所谓元性尽现，即前谓无形之中也。 一阳纯生时，但觉吾身有一物，或明或隐，二阳生时则遍体生明矣！ 三阳生者，则光不在内，不在外，但觉此身，如在虚空，亦无身，亦无虚空，亦无日，亦无月，常能如此，则禅定也。 但丹士若生於有，而不能采真空，而以无为用也。 既至于此，而金丹且半，何也？ 且元神见矣！ 而未归于丹，混精气而为一，所以为半矣！ 更说他后一半底道理，月既望矣！ 十六而一阴生，一阴者性归于命之始也。 自一阴生，至于月之二十三，而二阴产矣！ 二阴者，乃性归于命，三之二也，自三阴生于月之三十日，而三阴全矣！ 三阴者，乃性尽归于命也。 性之全体见，绵绵若存之性，时时反乎命内矣！ 方其始也，以命而取性之全矣！ 又以性安命，此是性命天机括处，双修者，此之谓也。 天机至密，吾尽泄矣！ 到此际则金丹全也。 始於火候，凡一日用度，则一日养之，百日之功，而婴儿产矣！ 故吾以月为之喻，取其交会相照之理也。 月明实本於金，金之性实出於月，百炼愈坚，万劫不坏。 盖金日色月性也，火日气，金入火而复于元性之真，可以炼成至宝，号为金液还丹。 故修丹者，始则取金，为金生水，交合之理，显而藉土以成之，故城郭基址，无非托真金药物而固济堤防之，炼成纯金，故曰金丹。 炉鼎图 鼎炉形象恁分明，八卦纵横用则亲，炼就五行全藉土，又令真土变真金。 炉鼎图论 鼎之为器，匪金匪铁，炉之为具，匪玉匪石。 黄庭为鼎，气穴为炉，黄庭正在气穴之上，缕络相连，是为炉鼎。 阴阳为炭，以烹以炼。 夫黄庭之在人身上，交会之顷，乃元气立之际，此时正开而丹落于其中，遂固之。 所谓水银实满葫芦裹，闭塞其口置深水者也。 水银，铅汞也； 葫芦，黄庭也； 探水者，水犹气也。 闭塞黄庭，隐藏丹母，而置于气会之地，达者审之，得其趣也。 虎啸风生，龙吟云起，蟋蟀吟秋，蚌蚶显阴，万气归鼎而封固愈密，烹炼愈坚，此炉鼎之所以有也。 万卷丹经要旨，画图立象，本使人得象忘言。 后之学者，皆泥象寻真，各求诡论，岂知夫至道不繁，枢纽阴阳而已矣！ 如以天一生水云云之数而言此，亦不过明水火之流行耳。 如以四时八节而言者，此亦不过喻天地阴阳消长耳。 秘其母而言其子，故知之者鲜矣！ 用成今所以着为此书者，皆弃枝叶而言本根，本根有而枝叶自芳。 盖古人不欲言而余言之，道中君子，宜体此意，母以小道观焉！ 依此而行神仙，可立跻也。 或问：炉鼎之体明矣！ 炉鼎之用亦愿闻焉！ 天地间百卉草木，万类不殊，冬至之后，阳动於下，则枯木重荣，百草萌芽，垫虫奋发，万类熙怡。 造化岂有心而生万物，万物亦何心而望造化，盖一气之动，万类感而然耳。 天何心哉！ 物何心哉！",
      "translated_text": "The moon receives the sun’s *qi*, thus on the third day a single yang arises. Once the elixir resides in the crucible, one feels a speck of numinous light constantly illuminating the heart, without distinction of day or night. On the eighth day of the moon, a single yang is born, and the second yang emerges. The second yang signifies the elixir’s *metal-qi* growing slightly stronger, while primordial *nature* becomes slightly manifest. From the second yang’s birth at the moon’s fullness, the third yang becomes pure. The third yang pure means primordial *nature* is fully revealed—precisely what was earlier called \"within the formless.\"\n\nWhen the first yang arises purely, one merely senses something within the body, now luminous, now hidden. When the second yang is born, the entire body radiates light. When the third yang arises, the light is neither within nor without; one feels this body as if suspended in emptiness—no body, no emptiness, no sun, no moon. To abide thus constantly is *dhyāna-samādhi*. Yet if the elixir cultivator clings to existence and fails to gather true emptiness, they cannot employ the *wu* (non-being).\n\nHaving reached this stage, the Golden Elixir is half-complete. Why? Because primordial spirit is now visible, yet it has not returned to the elixir, merging essence and *qi* into one—hence it remains half. Let us now speak of the latter half’s principle: once the moon is full, on the sixteenth day a single yin arises. The first yin marks the beginning of *nature* returning to *ming* (destiny/life). From the first yin’s birth to the twenty-third day of the moon, the second yin emerges. The second yin signifies *nature* returning to *ming* by two-thirds. From the third yin’s birth on the thirtieth day, the three yins are complete. The third yin means *nature* has fully returned to *ming*. When *nature*’s entire body is revealed, its continuous, subtle presence constantly reverts within *ming*.\n\nInitially, *ming* seizes *nature*’s wholeness; then *nature* settles *ming*—this is the celestial mechanism of *nature* and *ming*, the very meaning of \"dual cultivation.\" The celestial mechanism is most profound; I have fully disclosed it. At this point, the Golden Elixir is complete.\n\nBeginning with the fire-phase, each day’s work nourishes it day by day. With a hundred days’ effort, the *spiritual infant* is born. Thus I use the moon as a metaphor, drawing on its principle of mutual illumination and union. The moon’s brightness truly originates from metal; metal’s *nature* truly arises from the moon. Refined a hundred times, it grows ever firmer, indestructible through ten thousand kalpas. For metal is the sun’s color, the moon’s *nature*; fire is the *qi*. When metal enters fire, it returns to primordial *nature*’s truth, enabling refinement into the supreme treasure, called *Golden Liquid Returned Elixir*.\n\nThus, those who refine the elixir first gather metal, for metal generates water. The principle of union is manifest, relying on earth to complete it. The city walls’ foundations and embankments all depend on the true golden medicine to firmly secure the dike. Refined into pure gold, it is called the *Golden Elixir*.\n\n**Diagram of the Crucible and Furnace**\nThe crucible and furnace’s form is thus distinct:\nThe eight trigrams crisscross, their use intimate.\nRefining the Five Phases all relies on earth,\nTransforming true earth into true gold.\n\n**Discourse on the Crucible and Furnace**\nThe crucible is neither gold nor iron;\nThe furnace is neither jade nor stone.\nThe *Yellow Court* is the crucible,\nThe *qi*-cavity is the furnace.\nThe *Yellow Court* lies directly above the *qi*-cavity,\nInterwoven with channels—this is the crucible and furnace.\nYin and yang are the charcoal,\nFor steaming and refining.\n\nWithin the human body, the *Yellow Court* is where, at the moment of union, primordial *qi* arises. At this instant, the gate opens and the elixir descends within, whereupon it is secured. This is like mercury filling a gourd, its mouth sealed and placed in deep water. Mercury is lead and mercury; the gourd is the *Yellow Court*; the deep water is *qi*. Sealing the *Yellow Court* conceals the elixir’s mother, placing it in the *qi*-convergence site. Those who understand will examine this and grasp its essence.\n\nWhen the tiger roars, wind arises; when the dragon intones, clouds gather. The cricket sings in autumn; the clam and oyster reveal yin. Myriad *qi* return to the crucible, sealing it ever more tightly, refining it ever more firmly—this is why the crucible and furnace exist.\n\nThe essentials of ten thousand elixir scriptures, with diagrams and images, are meant to enable one to grasp the image and forget the words. Later scholars, clinging to images in search of truth, each seek abstruse theories, unaware that the supreme Dao is not complex—its pivot is merely yin and yang. Whether speaking of \"Heaven’s one generating water\" or other numerological principles, it merely clarifies the circulation of water and fire. Whether referring to the four seasons and eight solar terms, it merely illustrates the waxing and waning of heaven and earth’s yin and yang. Concealing the mother while speaking of the child, few truly understand. Thus, in writing this book, I discard branches and leaves to speak of the root. With the root present, branches and leaves naturally flourish. The ancients did not wish to speak, yet I have spoken. Daoist adepts should grasp this intent and not regard it as a minor teaching. Following this, one may ascend to immortality in an instant.\n\nSomeone asked: The crucible and furnace’s form is clear—may we also hear of their function?\n\nBetween heaven and earth, the myriad grasses and trees, all things differ, yet after the winter solstice, when yang stirs below, withered trees flourish anew, grasses sprout, hibernating creatures stir, and all things rejoice. Does creation have a mind to generate the myriad things? Do the myriad things have a mind to await creation? It is merely the movement of a single *qi*, to which the myriad things respond. Heaven—what mind has it? Things—what mind have they?",
      "overlap_context": "ear, no different from when it was unseen.\n\nThus, when a cultivator of the Golden Elixir clearly sees this thing, primordial *qi* is born! They must then employ it—like spotting a thief and seizing them, lest they escape again. Yet when gathered into the crucible, this speck of true primordial *qi* can never depart. Take the *dantian* as the sun and the heart’s primordial *nature* as the moon. The sun’s light naturally reflects upon the moon. After union, the precious body gives birth to metal.\"",
      "start_char": 9106,
      "end_char": 10243,
      "start_sentence": 408,
      "end_sentence": 457,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.43516969680786,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\玉清金笥青华秘文金宝内炼丹诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "至于百卉开花结实之际，正药物循环之时，落叶凋芳之际，正药物归根复命之时，可喻古人譬药物产降而成丹，莫有出於此者，但不可泥於无心，使其自浮自沉，亦不可泥於有心，而驱驰逐火。 绵绵若存，知其无, , 守其有，知其黑，守其白，静中行火候，定里结还丹，赠之以中。 神室图 费尽工夫结得成，返光内照景分明，主人未至谁藏得，闻道灵光驾赤城。 神室图论 神室者，元神所居之室，鄞鄂是也。 人知立鄞鄂之造化，显然彰露矣！ 抑不知有室而无主人，何取其为室哉！ 然主人虽无，而主人之胎，亦在乎一室之中矣！ 如怀孕然，十月之间，母呼亦呼，母吸亦吸，但气未足耳，气足而形完，一点灵光入于其中，则倏然而生啼哭，枪然纯乎其人矣！ 此乃鄞鄂成，而神归于室之时也。 神归其室，则所谓得其一，万事毕矣！ 盖交媾之后，神光乘而烛乎玄珠矣！ 精华升而产于玄珠矣！ 真铅则元气矣！ 精气神亦先有胚胎在其中矣！ 火足气充，则元精元气元神尽合而为一，故婴儿产矣！ 婴儿岂即产焉？ 火烁尽草阴，而胎始脱，到此方是产婴儿。 吾尝谓古人画炼丹之图象， 固鄞鄂也， 此一点便以安乎其中矣！ 后之学者，皆谓鄞鄂有而一点安，遂不知安一点於中之道，暂结终散，猛火空烧，而离坎逸矣！ 夫此一点产于外，而顺于后天者，一生二，二生三，三生万物，皆从此。 常人为之志，反逆焉！ 而产於内，则长生久视之道存矣，岂非归根复命乎？ 命复根归之由深根固蒂也。 深根固蒂之道，自澄心遣欲，澄心之理，屏视去听，始孔子曰非礼勿视，非礼勿听，非礼勿言，非礼勿动，此便是真实道理。 但儒教欲行於世，用於时，故以礼为之防。 所谓妄心者，喜怒哀乐各等耳。 忠恕慈顺恤恭敬谨，则为真心。 吾修丹之士，则以真心并为妄心，混然返其初而原其始，却就无妄心中生一真念奋天地有为而终则至於无为也。 若释氏之所谓真心，则又异焉，放下六情，了无一念，性地廓然，真元自见。 一见之顷，往来自在，盖静之极，至于极之极，故见太极则须用一言半句之间，如死一场再生相似，然后可以造化至机，而为不生不死之根本。 岂易窥其门户耶！ 玉清金笥青华秘文金宝内炼丹诀卷中竟 玉清金笥青华秘文金宝内炼丹诀卷下 紫阳真人张平叔撰 前弦须短后弦长，水裹藏灯焰自光， 日夜巽风吹不灭，将心挑动更荧煌。 火候图论 易之为书，三百八十四爻，火之为数，三百八十四铢。 故舍乾坤以为鼎器，坎离为药物之外，初一用屯蒙，初二用需讼，初三用师比，初四用小畜履，初五用泰否，初六用同人大有，初七用谦豫，初八用随蛊而金计半斤； 初九用临观，初十用噬嗑贲，十一用剥复，十二用无妄大畜，十三用颐大过，十四用咸怛，十五用返大壮，十六用晋明夷，十七用家人睽，十八用赛解，十九用损益，二十用央娠，二十一用萃升，二十二用困井，二十三用革鼎而水半斤。 二十四用震艮，二十五甩渐归妹，二十六用丰旅，二十七用巽兑，二十八用涣节，二十九用中孚小过，三十用既济未济。 顷刻而周，周而复始。 自日月运行，一寒一暑，天地氤氲，万物化醇，倒造化，翻乾坤，窃宇宙，盗阴阳，天下之至通，始可与言此也。",
      "translated_text": "When the hundred grasses bloom and bear fruit, it is precisely the time when medicinal substances circulate; when leaves fall and fragrance fades, it is precisely the time when medicinal substances return to the root and restore life. This may illustrate how the ancients likened the production and descent of medicinal substances to the formation of the elixir—nothing surpasses this. Yet one must not cling to the notion of \"no-mind,\" allowing them to float and sink of themselves, nor must one cling to the notion of \"mind,\" driving and chasing the fire.\n\nAbide continuously as if present—know its absence, guard its presence; know its darkness, guard its brightness. Within stillness, enact the fire-times; within stability, congeal the returning elixir. Bestow it with the center.\n\n**Diagram of the Spirit Chamber**\nHaving expended all effort to congeal and complete it,\nTurn the light inward to illuminate the scene clearly.\nBefore the master arrives, who can conceal it?\nHearing the Dao, the numinous light rides the Crimson City.\n\n**Discourse on the Spirit Chamber**\nThe Spirit Chamber is the chamber where the original spirit resides—this is the *yin’e*. People know the creative transformation of establishing the *yin’e*, which is manifest and revealed. Yet they do not know that a chamber without a master is of what use as a chamber? Though the master is absent, the embryo of the master already lies within this chamber. It is like pregnancy: over ten months, when the mother breathes, so too does the child; when the mother inhales, so too does the child—only the *qi* is not yet sufficient. When the *qi* is full and the form complete, a single spark of numinous light enters within, and suddenly there is birth and crying, wholly and purely human. This is the time when the *yin’e* is formed and the spirit returns to the chamber.\n\nWhen the spirit returns to its chamber, it is said: \"Obtain the One, and all affairs are complete.\" After intercourse, the spirit’s light rides and illumines the mysterious pearl; essence and brilliance ascend and are produced from the mysterious pearl. True lead is the original *qi*; essence, *qi*, and spirit already have an embryo within. When the fire is sufficient and the *qi* abundant, the original essence, original *qi*, and original spirit all merge into one—thus the infant is born. But is the infant born at once? Only when the fire has smelted away the yin of the grasses does the embryo begin to detach. At this point, the infant is truly born.\n\nI have often said that the diagrams of elixir-refinement drawn by the ancients are indeed the *yin’e*—this single point is to be settled within it. Later scholars, seeing the *yin’e* and knowing the point is to be settled within, yet remain ignorant of the way to settle this point within. Temporarily congealed, it ultimately disperses; fierce fire burns in vain, and the *li* and *kan* escape.\n\nThis point, produced externally and following the posterior heaven, becomes one generating two, two generating three, three generating the myriad things—all proceed from this. Ordinary people act upon it with intent, yet reverse the process. Produced internally, the Way of long life and enduring vision is preserved—is this not returning to the root and restoring life? The reason life is restored and the root returned lies in deep roots and firm stems.\n\nThe Way of deep roots and firm stems begins with settling the mind and dispelling desires. The principle of settling the mind lies in withdrawing from sight and sound. Confucius said: \"Look not at what is contrary to propriety; listen not to what is contrary to propriety; speak not what is contrary to propriety; make no movement that is contrary to propriety.\" This is the true principle. Yet Confucianism seeks to act in the world and serve the times, thus using propriety as its boundary.\n\nThe so-called deluded mind consists of joy, anger, sorrow, and pleasure. Loyalty, forgiveness, compassion, deference, sympathy, reverence, respect, and caution constitute the true mind. For those who refine the elixir, the true mind and deluded mind are merged, returning to the origin and tracing back to the beginning. From within the absence of deluded mind, a single true thought arises—striving through the heavens and earth with effort, ultimately reaching effortlessness.\n\nAs for the \"true mind\" of the Buddhists, it differs again: letting go of the six emotions, utterly without a single thought, the nature-ground is vast and empty, and the true origin appears of itself. In the instant of its appearance, there is free coming and going. At the extreme of stillness, reaching the utmost extreme, one sees the Great Ultimate. It requires but a word or half a phrase—like dying once and being reborn—before one can grasp the supreme mechanism of creation and become the root of neither birth nor death. How easily can one glimpse its gate?\n\n**The Jade Purity, Golden Coffer, Azure Florescence Secret Writings of the Golden Treasure Inner Refinement Elixir, Concluding Scroll**\n\nThe first quarter [of the moon] must be short, the latter quarter long;\nWithin water, the lamp’s flame shines of itself.\nDay and night, the *xun* wind blows without extinguishing it—\nStir the heart to move it, and it grows yet more radiant.\n\n**Discourse on the Fire-Times Diagram**\nThe *Book of Changes* contains three hundred and eighty-four lines; the number of the fire is three hundred and eighty-four *zhu*. Thus, abandoning *qian* and *kun* as the crucible and furnace, *kan* and *li* as the external medicinal substances, the first day uses *zhun* and *meng*, the second *xu* and *song*, the third *shi* and *bi*, the fourth *xiaoxu* and *lü*, the fifth *tai* and *pi*, the sixth *tongren* and *dayou*, the seventh *qian* and *yu*, the eighth *sui* and *gu*—and the metal weighs half a *jin*. The ninth day uses *lin* and *guan*, the tenth *shike* and *ben*, the eleventh *bo* and *fu*, the twelfth *wuwang* and *daxu*, the thirteenth *yi* and *daguo*, the fourteenth *xian* and *dan*, the fifteenth *feng* and *dazhuang*, the sixteenth *jin* and *mingyi*, the seventeenth *jiaren* and *kui*, the eighteenth *jian* and *jie*, the nineteenth *sun* and *yi*, the twentieth *guai* and *shen*, the twenty-first *cui* and *sheng*, the twenty-second *kun* and *jing*, the twenty-third *ge* and *ding*—and the water weighs half a *jin*. The twenty-fourth day uses *zhen* and *gen*, the twenty-fifth *jian* and *guimei*, the twenty-sixth *feng* and *lü*, the twenty-seventh *xun* and *dui*, the twenty-eighth *huan* and *jie*, the twenty-ninth *zhongfu* and *xiaoguo*, the thirtieth *jiji* and *weiji*.\n\nIn an instant, it completes a cycle, cycling without end. From the movement of the sun and moon, the alternation of cold and heat, the blending of heaven and earth, the transformation of the myriad things into harmony—reversing creation, overturning *qian* and *kun*, stealing from the cosmos, robbing yin and yang—only those who comprehend the world’s utmost subtleties may speak of this.",
      "overlap_context": "e also hear of their function?\n\nBetween heaven and earth, the myriad grasses and trees, all things differ, yet after the winter solstice, when yang stirs below, withered trees flourish anew, grasses sprout, hibernating creatures stir, and all things rejoice. Does creation have a mind to generate the myriad things? Do the myriad things have a mind to await creation? It is merely the movement of a single *qi*, to which the myriad things respond. Heaven—what mind has it? Things—what mind have they?",
      "start_char": 10243,
      "end_char": 11491,
      "start_sentence": 458,
      "end_sentence": 502,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.36086297035217,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\玉清金笥青华秘文金宝内炼丹诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "或曰：乾坤坎离之体，曰周天火候之时，坎离交矣，坎离交则乾坤会矣！ 夫天道下降，地道上升，乃乾坤之用也。 坎者乾交坤也，离者坤交乾也，其他卦象，不过设体耳，亦不可泥象寻爻，而火候之法始见。 又曰：似子言之，不过范围天地，运行日月而已，而《炉鼎图》又列八卦於鼎中，《火候图》又升午位於泥丸，布平桥於卯酉，何也？ 曰天机固不容泄，言既至此，隐之何为？ 且河出图，洛出书，天尚自泄，况於人乎？ 客曰：止。 余．闻泄天机而殃及九祖，独不闻度一人而福及九祖乎！ 吾以吾之丹法，尽底无隐而传於有绿之士，苟有信士一人为仙，某岂无功乎？ 客曰：子之用心，非某能知及之。 曰：是炉也，是鼎也，乃进火进水之理耳。 水火无过一气耳，气之升也，吾以心接之，即火也； 气之降也，吾以静持之，即水也，此绵绵若存之时，子午进用之功也。 斯时也，方是偃月炉具之时。 夫性见则气生，气生则金生，金生则气多，气多则金愈旺，此二者交相为用也。 金旺於中，烛破浮云，露出一钩真性，如月之明，乃偃月炉也。 存养之久，则金气盛而全尽，烛见一输明月，乃全性也。 既见全性，又返金性，则吾身皆真性命为之主，此用火之时也。 盖二者未融为一，而用火炼之，炼作纯金也。 包含性命，通体皆阳，浮沉自在，爱日恋月，好游顶门，时至道成，奋厉而脱，霹雳一声，身非我有。 吁嘻！ 人人可以如此而成功，人而自弃之，若是可哀也哉！",
      "translated_text": "Some may ask: \"The forms of *Qian*, *Kun*, *Kan*, and *Li*—these are the timings of the celestial cycle of fire and *qi*. When *Kan* and *Li* unite, *Qian* and *Kun* converge! The Dao of Heaven descends, the Dao of Earth ascends—this is the function of *Qian* and *Kun*. *Kan* is *Qian* uniting with *Kun*, and *Li* is *Kun* uniting with *Qian*. The other hexagrams merely establish form; one must not rigidly seek the lines and images, for only then does the method of fire and *qi* become apparent.\"\n\nAnother says: \"By your words, it seems no more than encompassing Heaven and Earth, circulating the sun and moon. Yet the *Furnace and Cauldron Diagram* arranges the eight trigrams within the cauldron, and the *Fire and Qi Diagram* elevates the *wu* position to the *Niwan* palace, laying a level bridge between *mao* and *you*. Why is this?\"\n\nI reply: \"The celestial mechanism was never meant to be revealed, but since words have come to this, why conceal it further? The River issued the Diagram, the Luo issued the Book—Heaven itself disclosed these, let alone man!\"\n\nThe guest says: \"Enough.\"\n\nI have heard that revealing celestial secrets brings calamity upon nine generations, yet have I not also heard that saving one person brings blessing upon nine generations? With my method of the Elixir, I conceal nothing and transmit it fully to those of karmic affinity. If even one faithful practitioner attains immortality, how could I have no merit?\"\n\nThe guest says: \"Your intent is beyond what I can fathom.\"\n\nI say: \"This furnace, this cauldron—these are but the principles of advancing fire and water. Water and fire are nothing more than *qi*. When *qi* ascends, I meet it with the mind—this is fire. When *qi* descends, I sustain it with stillness—this is water. In this state of unbroken continuity, the work of advancing at *zi* and *wu* is applied. At this moment, the time of the crescent-moon furnace arrives.\n\nWhen innate nature appears, *qi* is born; when *qi* is born, metal is born; when metal is born, *qi* multiplies; when *qi* multiplies, metal flourishes ever more. These two interact in mutual function. When metal flourishes within, it pierces the floating clouds, revealing a sliver of true nature—bright as the moon: this is the crescent-moon furnace. With prolonged nurturing, metal and *qi* grow abundant and complete, illuminating a full orb of bright moon—this is the fullness of nature. Once the full nature is seen and metal-nature is returned, my body is wholly governed by true nature and life. This is the time to apply fire.\n\nFor before these two merge as one, fire is used to refine them, forging pure gold. Encompassing nature and life, the entire body becomes yang, floating and sinking at will, cherishing the sun and moon, delighting in roaming the crown gate. When the time comes, the Dao is accomplished—with a sudden burst, a thunderclap resounds, and the body is no longer one’s own.\n\nAlas! Every person could succeed thus, yet those who abandon themselves—how pitiful they are!\"",
      "overlap_context": "e twenty-eighth *huan* and *jie*, the twenty-ninth *zhongfu* and *xiaoguo*, the thirtieth *jiji* and *weiji*.\n\nIn an instant, it completes a cycle, cycling without end. From the movement of the sun and moon, the alternation of cold and heat, the blending of heaven and earth, the transformation of the myriad things into harmony—reversing creation, overturning *qian* and *kun*, stealing from the cosmos, robbing yin and yang—only those who comprehend the world’s utmost subtleties may speak of this.",
      "start_char": 11491,
      "end_char": 12050,
      "start_sentence": 503,
      "end_sentence": 524,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.055889129638672,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\玉清金笥青华秘文金宝内炼丹诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "余见总篇，方其九转既周，沐浴已竟，火力终焉，一星不灭，故动 一风，以吹之巽风者，鼎下之片缕耳。 阖则为乾，辟则为巽，阖则为嘘，辟则为吸，何以能开辟，亦无非意使之然。 或曰：巽西方之位，以子所言，巽乃中宫，母乃反乎？ 曰：西方者，巽之用也，中宫者，巽之体也。 吾自心生一意，而降於巽位，其象始辟，则吾言实兼体用而训也。 继之以乾，乾金而火乃金精，故遇而炎火张设，须坎以抑之，抑之而不能止，则有反攻于下之患，故止以艮而又嘘以巽，巽上一画属阳，止火非阳不行，故遇震而稍焰，遇离而复炎。 又止以坤，坤水也，火从水起，如遇其兑，故不止而自止。 坤非正卦，故徐归于兑，兑又西方之卦也，故自尾闾徐徐升上，而至泥丸顶，为天门，为正午之地。 午属火，火遂加煌，又接之以心，心火也，接者神也，乃神火也，又加煌至，卯酉若直下，则刑德临门，危其殆哉！ 故一立而各为二道，今日之卯酉，昔日之坤艮也。 火气也气，降而复升之理，故归肾府，化为真水，而用之。 盖文火性柔而难化，遇卯木，木必克土，遂以火克木，则土不受克矣！ 武火性强而易化，降自酉，酉属金，金生水，遂为水归於鼎。 曰：何谓文？ 何谓武？ 曰：文火自三关，上至于天矣！ 武火是午宫与心火也。 大凡火候只此一场大有危险，丹士宜一战而胜，则天下定矣！ 平日周天火候，切不可以为则，然此亦不可执着，彼亦不可执着，且喜且喜。 庆云开尽现洪蒙，彷佛空中见祖宗， 风定七星还在水，依稀残韵尚飘空。 阴尽图 阴尽图论",
      "translated_text": "When I survey the entire work, once the nine cycles are complete, the bathing finished, and the fire’s power exhausted, not a single star is extinguished—then a single breeze stirs to fan it. This *xun*-wind is but a slender thread beneath the crucible. When closed, it is *qian*; when opened, it is *xun*. Closed, it exhales; opened, it inhales. How does it open and close? Nothing but the mind’s intent makes it so.\n\nSome may ask: *Xun* is the position of the west—yet by your account, *xun* resides in the central palace. Have you not reversed them?\nI say: The west is *xun* in function; the central palace is *xun* in essence. When an intent arises from my heart and descends to the *xun* position, its image begins to open—thus my words truly encompass both essence and function.\n\nNext comes *qian*. *Qian* is metal, and fire is the essence of metal; when they meet, blazing fire spreads. It must be tempered by *kan*, yet if *kan* cannot restrain it, the fire may turn and attack below. Thus it is halted by *gen* and exhaled by *xun*. The upper line of *xun* belongs to yang; without yang, fire cannot be stilled. When it encounters *zhen*, the flame flickers; when it meets *li*, it blazes anew. It is then halted by *kun*. *Kun* is water, and fire arises from water—if it encounters *dui*, it ceases of its own accord. *Kun* is not a primary trigram, so it gradually returns to *dui*, which is also the trigram of the west. Thus, from the *weilü*, it slowly ascends to the *niwan* peak, the Gate of Heaven, the place of true noon. Noon belongs to fire, and the fire grows ever brighter. Then it is met by the heart—fire of the heart, the meeting being spirit, thus spirit-fire—brightening further still.\n\nIf at *mao* and *you* it were to descend directly, punishment and virtue would stand at the gate—how perilous! Therefore, one path divides into two. Today’s *mao* and *you* are yesterday’s *kun* and *gen*. Fire is *qi*, and the principle of *qi* is to descend and then ascend. Thus it returns to the kidney palace, transforming into true water, and is put to use.\n\nGentle fire is yielding in nature and difficult to transform; when it encounters *mao*-wood, wood must overcome earth, so fire is used to overcome wood, and earth is no longer subdued. Fierce fire is strong and easily transformed; descending from *you*, *you* belongs to metal, and metal generates water, so water returns to the crucible.\n\nOne asks: What is gentle fire? What is fierce fire?\nI say: Gentle fire rises from the Three Passes to the heavens. Fierce fire is the fire of the noon palace and the heart.\n\nIn all the firing process, this is the moment of greatest danger. The alchemist must prevail in a single battle, and the world will be settled. The daily cycle of celestial firing must not be taken as a fixed rule—yet neither should this be clung to, nor that. Rejoice, rejoice!\n\nAs auspicious clouds part, the primordial vastness appears;\nDimly in the void, ancestors seem to appear.\nWhen the wind stills, the Seven Stars remain in the water;\nFaintly, lingering echoes drift through the sky.\n\n*Yin Exhausted Diagram*\n*Discourse on the Yin Exhausted Diagram*",
      "overlap_context": "ife. This is the time to apply fire.\n\nFor before these two merge as one, fire is used to refine them, forging pure gold. Encompassing nature and life, the entire body becomes yang, floating and sinking at will, cherishing the sun and moon, delighting in roaming the crown gate. When the time comes, the Dao is accomplished—with a sudden burst, a thunderclap resounds, and the body is no longer one’s own.\n\nAlas! Every person could succeed thus, yet those who abandon themselves—how pitiful they are!\"",
      "start_char": 12050,
      "end_char": 12658,
      "start_sentence": 525,
      "end_sentence": 547,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.45540452003479,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\玉清金笥青华秘文金宝内炼丹诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "张子一日坐于幽室，形忘气化，倏然两耳风生，始知秋蝉呜。 隔岸之翠柳，终焉若闻九天之箫韵。 恍然有一人立于旁，耳目口鼻与张无异，指张而骂曰：吾自太易以来，为子所役略不瞬，宁何罪於汝？ 张子不觉失笑而无声，默谓之曰：来，吾与尔言。 汝言固是，但尔为我苦耶？ 我为尔若耶？ 姑坐以叔。 曰：我先以来本无事，与子同居之后，寤寐亦相持，移像累劫，而不自如，置我沙漠风霜之地，既令我归东，又令我归西，种种相魔，自顷以来，始蒙慧以室庐养，以调息，美则美矣，但晚也。 张曰：匪吾之过也，乃六欲之贼，使之然也。 子微而隐，彼显而彰，吾知有彼而不知有此，譬之瞽者坐舟，但知舟之日去千里，而不知撑者实劳也。 使不欲舟行，则撑者暇矣！ 似张者欣然曰：几失君！ 吾有百炼之坚刀，可同剿此贼，而去其根。 后同入规中时，然后行独步金阙。 张曰：唯唯。 见黄光四迸，五色焕然，观者听其言曰：去贼之道，不宜急，急则反受其敌。 始然力不胜，其祸乃可必，纵放任余心，守之常将息。 或作狡诈形，视之常无尔，一战定三清，万魔俱屏迩。 噫 当日风尘枉自横，波平海晏兆升平， 堪怜不达穷通者，犹弄干戈观我城。 噫 无明焰子又无烟，暖出真金曜彻天， 霹雳一声圆活子，腾空三觐玉皇前。 阳纯图论 又无文，看甚？ 窈窕仙童捧诏来，妙哉！ 总论金丹之要 夫人一身，大而不可以取象天地，包容万汇，变化莫测，灵通玄妙，百姓日用而不知，故金丹之道鲜矣！ 夫金丹之道，贵乎药物，药物在乎精气神，神始用神光，精始用精华，气即用元气。 精非气不盈，神非气不充，精因气融，气凭精用，气因神见，神凭气用。 且以吾身之天地言之，自太极既分，两仪判矣！ 两仪生四象，四象生八卦，八卦立而天地、人之道备矣！ 天以动为体，地以静为体，天地之气，往来不息，而日月行乎其中。 盖父母构形育我之后，始生脉络也，自形完之后，始生缕络，反若元性之虚无，谷道筋条，殆似草茅之育茂。 此乃先天之炁，为先天之道，此金宝之至言也。 宜守之以中，则庶乎道路通畅。 盖人受天地之中以生，所谓命也，得天地之中气以生，遂可为人。 我以身为天地，亦宜执其中，而为造化之枢纽。 中者有三中，心中意，脐中鼎，肾中炉，三中之至切者，心中意，脐中鼎次之，肾中炉又次之。 此三者自金丹之始，至终不可须臾离也。 大凡金丹之道，学者寻五行其末矣！ 当知夫交会之际，恍惚杳冥，养生毛窍，金之本 也； 逸豫和畅，肢体柔顺，木之本 也。 铅本火体而金情，汞本水体而木性，无他，水火者，铅汞之体也，金木者，铅汞之用也。 铅汞凝结，光华会合者，意也，意属土，五行既全於鼎器之中，物以类聚，五行又环列於鼎器之外，内外相感，而丹始成形，状如黍米，非青非黄，非黑非白，不可得而名状也。 到此际，又绵绵若存，清净无为，自然现出百般妙用景象，肾水合精水，自玄膺流下，谓之华池神水。 虚无之中，白雪生而黄芽长，只绵绵若存之顷，亦率归于鼎器之内，是大药不离精气神，要认始用药材。 又精气神之所产也，非便用精气神也，今有一等旁门，自作自是，而精气神受役之不暇，奚能产药也？",
      "translated_text": "One day, Master Zhang sat in a secluded chamber, his form forgotten and his qi transformed. Suddenly, a wind arose in both ears, and he first became aware of the autumn cicadas’ cries. Across the river, the verdant willows seemed to carry the lingering echoes of celestial flute music from the nine heavens. In a daze, he perceived a figure standing beside him—its ears, eyes, mouth, and nose identical to his own. Pointing at Zhang, it cursed: \"Since the primordial chaos of *Taiyi*, I have served you without a moment’s respite. What crime have I committed against you?\"\n\nMaster Zhang could not help but laugh soundlessly and said to it in silence: \"Come, let me speak with you. What you say is true, but tell me—have you suffered for me, or have I suffered for you? Sit for a while, old friend.\" The figure replied: \"From the beginning, I had no cares. After dwelling with you, waking or sleeping, I have been bound to you. Through countless kalpas, I have lost my freedom. You placed me in the deserts of wind and frost, then bade me return east, then west—endlessly tormenting me. Only recently have I been sheltered in a chamber of wisdom, nurtured by regulated breathing. It is good, yet too late.\"\n\nZhang said: \"This is not my fault, but the doing of the six thieves of desire. You are subtle and hidden, while they are manifest and conspicuous. I knew of them but not of you—like a blind man in a boat, aware only that it travels a thousand *li* each day, yet unaware of the labor of the one who poles it. If the boat were not set in motion, the poler would be at ease!\"\n\nThe figure resembling Zhang rejoiced: \"I nearly lost you! I possess a blade tempered a hundred times—together, we can exterminate these thieves and root them out.\" Later, when they entered the alchemical crucible, they would ascend alone to the Golden Gates. Zhang replied: \"Indeed, indeed.\"\n\nThen, yellow light burst forth in all directions, and the five colors shone brilliantly. Those who witnessed it heard these words: \"The way to expel the thieves must not be rushed. Haste invites counterattack. If your strength is insufficient, disaster is certain. Let the remaining thoughts roam freely, but guard them with constant care. Though they may assume cunning forms, regard them as nothing. One battle settles the Three Pure Ones, and all demons are cast aside.\"\n\nAlas!\nIn those days, the winds of the world raged in vain,\nNow waves are stilled, the sea is calm, and peace presages ascent.\nPitiful are those who fail to grasp the cycles of fortune,\nStill brandishing their weapons, watching over my city.\n\nAlas!\nThe flames of ignorance burn without smoke,\nYet warmth arises from the true solar essence, piercing the heavens.\nWith a thunderous crack, the perfect elixir is born,\nSoaring through the skies to pay threefold homage before the Jade Emperor.\n\n*Yang Pure Diagram Discourse*\n(No further text—what is there to see?)\n\n*On the Essentials of the Golden Elixir*\nMan’s body, vast yet ungraspable as heaven and earth, encompasses the ten thousand things, its transformations unfathomable, its numinous subtlety profound. Yet the common people use it daily without awareness—thus the Way of the Golden Elixir is rare indeed!\n\nThe Way of the Golden Elixir values the medicinal substances, which reside in essence, qi, and spirit. Spirit begins with the radiance of spirit-light; essence begins with the essence of vitality; qi is the primordial qi. Essence is not full without qi; spirit is not replete without qi. Essence fuses through qi; qi functions through essence. Qi manifests through spirit; spirit operates through qi.\n\nLet us speak of the body’s heaven and earth: After the Great Ultimate divides, the Two Modes are distinguished. The Two Modes generate the Four Images, the Four Images generate the Eight Trigrams, and with the Eight Trigrams established, the Way of heaven, earth, and man is complete. Heaven takes movement as its essence; earth takes stillness as its essence. The qi of heaven and earth ceaselessly intermingles, with the sun and moon traversing between them.\n\nAfter our parents shaped and nurtured us, the meridians first formed. Once the body was complete, the finer channels emerged, reverting to the emptiness of original nature. The pathways of the valleys and sinews resemble the lush growth of grasses and reeds. This is the primordial qi, the Way of the primordial—these are the most precious words of the golden treasure. One must guard it with the center, that the pathways may be unimpeded.\n\nMan receives the central harmony of heaven and earth at birth—this is called *ming*. Born of the central qi of heaven and earth, one becomes human. Taking the body as heaven and earth, one must also hold to the center as the pivot of creation. The center has three centers: the heart’s center of intent, the navel’s crucible, and the kidneys’ furnace. Of these three, the heart’s center of intent is most crucial, the navel’s crucible next, and the kidneys’ furnace last. From the beginning to the end of the Golden Elixir, these three must never be separated for even a moment.\n\nIn the Way of the Golden Elixir, scholars often seek the branches of the Five Phases. They should know that at the moment of union, in the realm of indistinct obscurity, the pores are nurtured—this is the root of metal. In ease and harmony, the limbs are supple—this is the root of wood. Lead is fundamentally fire in nature yet metallic in disposition; mercury is fundamentally water in nature yet wooden in disposition. There is no other reason: water and fire are the bodies of lead and mercury; metal and wood are their functions. When lead and mercury congeal, their radiance unites—this is intent, which belongs to earth. Once the Five Phases are complete within the crucible, like attracts like, and the Five Phases encircle it without. Through inner and outer resonance, the elixir begins to take form, resembling a grain of millet—neither green nor yellow, neither black nor white, beyond description.\n\nAt this stage, one must preserve it with unbroken continuity, in purity and non-action. Naturally, a hundred wondrous phenomena appear. The kidney water merges with the essence-water, flowing down from the mysterious throat—this is called the divine water of the Flowery Pond. Within the void, white snow arises and the yellow sprout grows. In the moment of unbroken continuity, all swiftly returns to the crucible. Thus, the great medicine never departs from essence, qi, and spirit—one must first recognize the medicinal materials.\n\nYet the medicinal substances arise from essence, qi, and spirit—they are not essence, qi, and spirit themselves. Nowadays, some follow heterodox paths, self-righteous in their practices, exhausting essence, qi, and spirit in servitude. How can they produce the medicine?",
      "overlap_context": "danger. The alchemist must prevail in a single battle, and the world will be settled. The daily cycle of celestial firing must not be taken as a fixed rule—yet neither should this be clung to, nor that. Rejoice, rejoice!\n\nAs auspicious clouds part, the primordial vastness appears;\nDimly in the void, ancestors seem to appear.\nWhen the wind stills, the Seven Stars remain in the water;\nFaintly, lingering echoes drift through the sky.\n\n*Yin Exhausted Diagram*\n*Discourse on the Yin Exhausted Diagram*",
      "start_char": 12658,
      "end_char": 13905,
      "start_sentence": 548,
      "end_sentence": 596,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.84970712661743,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\玉清金笥青华秘文金宝内炼丹诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "精气神三者，孰为重？ 曰神为重。 金丹之道，始然以神而用精气也，故曰神为重。 神者，性之别名也，至静之余，元气方产之际，神亦欲出，急庸定以待之，不然是散而无体之体也。 苟夸出入，必为大道，则谁不可为？ 夫神不疾而速，不行而至，师言曰：神之妙用，无方而有限，若得其道，可以出入，切不可纵为良探。 盖收於内则可，岂宜纵於外也！ 夫神出而依林木以成形，阴未尽也，将出之际，多异景。 月光灿然，从目出也； 鼻气或吸，从鼻出也； 耳闻清音，从耳出也。 独不可从口出入者，何也？ 夫口，五脏之气所会也，神弃精气而窃出，避气盛之地也。 神气精常想恋，神一出二者无依焉。 故神之出也，有害无益，日居月诸，照临下土，丹士逆之为用，顺而为火。 夫火循环， 九转中九转。 九转初生，旺於第一转，伺阴气尽，又远第二转，余亦如之，至于九转周足，遂迫於鼎。 故用前进火工夫，谓之真阳而战草阴。 请明言之：人一身皆属阴，惟有一点阳耳。 我以一点之阳，自远之近，转之又转，战退草阴，则阳道日长，阴道日消，故《易》曰：龙战于野，其血玄黄，至于阴尽阳纯，而丹始能升於泥丸。 决然奋厉，真人於斯而始见矣！ 金丹之道如此而已，更有言不尽底。 丹之初成也，交合之际，未免藉阴阳二炁以成之，后则渐以阳火，炼成纯阳之体，故自强不息，乾道也，丹成矣，故凝神以成躯，而成仙丹之初成也。 藉五行以成其用，后则渐以真金养成纯金之体，故通体之光，金色也。 金变日色，故光，金象日性故刚，曰金丹，又曰金仙。 幻体虽假合之物，修丹之士须藉以养丹基，譬之地也，城池固则外邪不能入。 故绵绵若存之顷，脾胃合为一脉，而围丹穴之左，肺肝合为一脉； 围丹穴之右，真气彻至则环於脉络之中。 故近丹而气可得之，以化至宝。 举其一可知二，然亦无为自然，始举是以明矣！ 夫无为无有为也，夫人之一气在身，由念而动，譬之握拳，念欲开而五指伸，了无呈得。 学人达此，於采先天一气之时，行一真念，采一真气按图观象，落在黄庭，其理一也。 穷冬凋剥，必得阴阳交泰之后，乃至万象。 学人达此，当知交会之后，不期产物之产，而自产矣！ 金之在水，其耀夺目，金之在土，土能藏之。 盖产於幽处，而隐其明处也。 丹之居鼎，犹人君之在位，百官称职，其国自安，而民自安。 火候药物，各得其宜，则万化成。 何谓各得其宜？ 第一转产药於束而降於西，以心为斗柄 ，斡旋其机，故行二十度而魄满，又斡之二十度而魂满，则火之魂而水之魄立，而神用大矣。 他转如之，举其要而明者，言曰： 斗极建四时，八节无不顺，斗极实兀然，魁杓自后动。 只要两眼皎，上下交相用，须向静中行，莫就忙裹送。 要无形图与你看，一气周流归故宅，金丹何事却成功。 至道本不繁，庸人自生事。 我本遇师传，三嘱令探秘，何故画图并立论，毫厘说尽鬼神惊。 咄！ 地狱不因传道者，教存经籍度三师。 次第秘诀 坐静打顽空，仰息，守己生时。 闻命炁冲和，待气动方可如下行，存归 ，然后就上二窍，直冲五星，候见明放静，又观心放下了一段，候再见明，一阳真炁产矣！ 绵绵若存　　只八分",
      "translated_text": "Of essence, qi, and spirit—which is most vital? The answer: spirit is most vital. The Dao of the Golden Elixir begins with spirit and employs essence and qi, hence spirit is most vital. Spirit is another name for nature; in the utmost stillness, when primordial qi is about to arise, spirit also seeks to emerge. One must swiftly stabilize it with concentration and await its return—otherwise, it becomes a formless form, scattered and without substance. If one boasts of its comings and goings, claiming mastery of the great Dao, who then could not achieve it? Spirit moves not swiftly yet arrives instantly, travels not yet reaches everywhere. As the master’s teaching says: the wondrous function of spirit is boundless yet constrained. If one grasps the Dao, one may guide its entry and exit, but it must never be recklessly ventured. For while gathering it within is permissible, how could one dare to release it without?\n\nWhen spirit departs and takes form by clinging to trees and plants, yin has not yet been exhausted. As it prepares to emerge, many strange phenomena appear: moonlight shines brilliantly, issuing from the eyes; breath is drawn in through the nose, issuing from the nose; pure sounds are heard in the ears, issuing from the ears. Why then can it not enter and exit through the mouth? The mouth is the gathering place of the five viscera’s qi, and spirit, abandoning essence and qi, steals away to avoid this realm of abundant qi. Spirit, qi, and essence are ever intertwined in longing; once spirit departs, the other two have nothing to rely upon. Thus, the departure of spirit brings harm and no benefit. Day by day and month by month, it illumines the earth below. The alchemist reverses its course for inner work, while following its flow becomes fire.\n\nThis fire circulates in cycles—nine revolutions within nine revolutions. At the first revolution, it flourishes, then waits for yin qi to dissipate before advancing to the second, and so on, until the nine revolutions are complete and it presses upon the crucible. Thus, the work of advancing the fire is called \"true yang battling the grassy yin.\" Let me clarify: the human body is entirely yin, possessing but a single point of yang. I take this single point of yang, moving it from afar to near, revolving it again and again, battling and retreating the grassy yin. Thereby, the yang path daily grows while the yin path daily wanes. As the *Book of Changes* says: \"The dragon battles in the wilds; its blood is dark and yellow.\" When yin is exhausted and yang is pure, the elixir may ascend to the Mud Pill Palace. Suddenly, with fierce determination, the true person first appears. Such is the Dao of the Golden Elixir—there is more that words cannot exhaust.\n\nWhen the elixir first forms, during its union, it inevitably relies on the convergence of yin and yang qi. Later, it is gradually refined with yang fire into a body of pure yang. Thus, it ceaselessly strengthens—this is the Qian Dao. The elixir is complete, and so one condenses spirit to form the body, achieving the initial stage of the immortal elixir. Initially, it employs the five phases to fulfill its function, but later, it is nourished with true gold to become a body of pure gold. Hence, its entire being radiates golden light. Gold transforms into the color of the sun, thus it shines; gold embodies the nature of the sun, thus it is firm. It is called the Golden Elixir, or Golden Immortal.\n\nThough the illusory body is a temporary construct, the alchemist must rely on it to cultivate the foundation of the elixir—like the earth, when the city walls are secure, external evils cannot enter. In the moment of unbroken continuity, the spleen and stomach merge into one channel, encircling the left side of the elixir chamber, while the lungs and liver merge into another, encircling the right. When true qi thoroughly penetrates, it circulates within the meridians. Thus, by drawing near the elixir, qi may be obtained to transform into the supreme treasure. Understanding one aspect reveals the other, yet this too arises naturally from non-action. I have raised this example to make it clear.\n\nNon-action is not inaction. The single qi within a person moves through intention—like clenching a fist: the intention to open causes the five fingers to extend, yet nothing is outwardly manifest. When the adept comprehends this, at the moment of gathering the primordial unity of qi, they maintain a single true intention, drawing in a single true qi. Following the diagram and observing the image, it settles in the Yellow Court—this principle is one and the same.\n\nIn the depths of winter’s desolation, only after the union of yin and yang does the myriad phenomena arise. When the adept understands this, they know that after the union, without expecting the birth of the elixir, it will naturally be born. Gold in water dazzles the eyes; gold in earth is concealed by it. For it is born in seclusion, hiding its brilliance. The elixir within the crucible is like a ruler on the throne: when the hundred officials fulfill their duties, the nation is naturally at peace, and the people are at ease. When fire timing and medicinal substances are each in their proper place, the myriad transformations are accomplished.\n\nWhat does \"each in their proper place\" mean? In the first revolution, the medicine is produced in the east and descends in the west. The heart serves as the handle of the Dipper, turning the mechanism. Thus, moving twenty degrees fills the po, and turning another twenty degrees fills the hun. Thereby, the fire’s hun and the water’s po stand firm, and the spirit’s function is greatly enhanced. The other revolutions follow likewise. To illustrate the essentials: it is said, \"The Dipper’s handle establishes the four seasons; the eight nodes all follow its course. The Dipper’s pivot stands firm, while the handle and scoop move behind it. One need only keep the two eyes bright, their upper and lower functions in harmony. Proceed in stillness, do not rush heedlessly. If you seek a formless diagram to guide you: a single qi circulates and returns to its original abode—what else is needed for the Golden Elixir to succeed? The supreme Dao is not complex; it is ordinary people who complicate it. I received this from my teacher’s transmission, thrice admonished to explore its secrets. Why then draw diagrams and compose treatises, expounding every minute detail to astonish gods and ghosts? Hmph! Were it not for those who transmit the Dao, the scriptures would remain, and the three masters would pass away.\"\n\n**Secret Instructions in Sequence:**\nSit in stillness, dispelling idle thoughts. Face upward, regulate the breath, and guard the moment of one’s own birth. When the command is heard, qi harmonizes and rises. Wait until qi stirs before proceeding downward, storing it within, then direct it upward to the two orifices, surging straight into the five stars. Await the radiant stillness, then observe the heart releasing a segment downward. Await another radiance, and the true qi of the first yang is born. Maintain unbroken continuity—just eighty percent.",
      "overlap_context": "arises and the yellow sprout grows. In the moment of unbroken continuity, all swiftly returns to the crucible. Thus, the great medicine never departs from essence, qi, and spirit—one must first recognize the medicinal materials.\n\nYet the medicinal substances arise from essence, qi, and spirit—they are not essence, qi, and spirit themselves. Nowadays, some follow heterodox paths, self-righteous in their practices, exhausting essence, qi, and spirit in servitude. How can they produce the medicine?",
      "start_char": 13905,
      "end_char": 15134,
      "start_sentence": 597,
      "end_sentence": 648,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.42790913581848,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\玉清金笥青华秘文金宝内炼丹诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 20,
      "original_text": "小光透用机出入， 开道一回，然后方行子午。 大光透用机出入， 破顶一回。 此是后上前下，此后并系尾闾五星，於三十日见用机出入。 上弦五十日足，见机大凡三遭望，左右见机，下弦日数足，下明鼎内晦，用机，再朝天径。 以太和返太极，以太和返无极。 动静之机，气盛则抑之以静，气弱则助之以意。 火候秘诀 丹居鼎内，上水下火，心动属火，静属水，乃水鼎也。 底静属水，动属火，乃火鼎也。 阳在鼎下曰水，火升於鼎上则水火也，阳火是外炉，外炉与火存於气穴，黄庭正在气穴之上，气穴乃内炉也，内炉存火，近鼎常烹，此绵绵若存也。 火长进於下，则不可坐，至於子午二时。 午进火，子进水，阳生不以心扰，接之意斡归於右，转降于左，存入 ，反是则进火。 或曰：敢问九转之功？ 曰：三月火候乃九转。 第一转：初自协边左右，存为火道，自阳宫起自右边到肩，横过正中，凝自左边送下，遂绵绵若存，宜静不宜动，宜徐不宜急，动曰扇火，急曰伤丹。 此每日子时之功也。 第二转：自胁边进一寸二分，用如前法，此丑时之用功也。 第三转：自协边进五分，用法如前，此寅时之用功也。 沐浴：卯时火起取丹，计四寸，有缕二条，正为火道。 脉透鼎中，故火起不用目，不用心，以意斡之。 右转取横与鼎齐，正缕地也，遂大静，火遂为水而归于鼎丹。 遂沐浴，绵绵若存。 天机！ 天机！",
      "translated_text": "When the faint light emerges, employ the mechanism of entry and exit—once the Dao is opened, then proceed with the *zi-wu* cycle. When the great light emerges, employ the mechanism of entry and exit to break through the crown once. This is the method of ascending posteriorly and descending anteriorly. Thereafter, all pertains to the *weilü* and the Five Stars, and within thirty days, the mechanism of entry and exit will be observed. At the first quarter, fifty days suffice, and the mechanism is seen thrice in all around the full moon. On the left and right, the mechanism appears; when the days of the last quarter are complete, the lower luminous cauldron darkens. Employ the mechanism, then face the celestial path directly. With *Taihe*, return to the *Taiji*; with *Taihe*, return to the *Wuji*.\n\nThe mechanism of movement and stillness: when qi is abundant, restrain it with stillness; when qi is weak, assist it with intention.\n\n**Secret Instructions on Fire Times:**\nThe elixir resides within the cauldron—above is water, below is fire. The heart’s movement pertains to fire; stillness pertains to water—this is the water cauldron. The base’s stillness pertains to water; movement pertains to fire—this is the fire cauldron. When yang is beneath the cauldron, it is called water; when fire ascends above the cauldron, it is called water-fire. Yang fire is the external furnace; the external furnace and fire abide within the *qi* cavity. The *Huangting* is situated above the *qi* cavity, and the *qi* cavity is the internal furnace. The internal furnace stores fire, constantly refining near the cauldron—this is \"maintaining unbroken continuity.\"\n\nWhen fire grows and advances below, one must not remain seated, except during the *zi* and *wu* hours. At *wu*, advance fire; at *zi*, advance water. When yang arises, do not disturb it with the heart; receive it with intention, guiding it to the right, then rotating and descending to the left, storing it within. The reverse is advancing fire.\n\nSomeone asked: \"May I inquire about the nine revolutions?\"\nThe master replied: \"Three months of fire times constitute the nine revolutions.\n**First Revolution:** Begin at the flanks, left and right, storing the path of fire. Starting from the yang palace, ascend from the right side to the shoulder, traverse the center, and condense, sending it downward from the left. Then maintain unbroken continuity—stillness is preferable to movement, slowness to haste. Movement is called 'fanning the fire'; haste is called 'injuring the elixir.' This is the daily practice at the *zi* hour.\n**Second Revolution:** Advance one *cun* and two *fen* from the flank, employing the previous method. This is the practice at the *chou* hour.\n**Third Revolution:** Advance five *fen* from the flank, employing the previous method. This is the practice at the *yin* hour.\n\n**Bathing:** At the *mao* hour, when fire arises to retrieve the elixir, measure four *cun*—two threads form the path of fire. The pulse penetrates the cauldron, so when fire arises, do not use the eyes or heart; guide it with intention. Rotate right to align horizontally with the cauldron—this is the true thread of earth. Then enter profound stillness, and fire transforms into water, returning to the elixir within the cauldron. Thus bathe, maintaining unbroken continuity.\n\nHeavenly mechanism! Heavenly mechanism!\"",
      "overlap_context": " dispelling idle thoughts. Face upward, regulate the breath, and guard the moment of one’s own birth. When the command is heard, qi harmonizes and rises. Wait until qi stirs before proceeding downward, storing it within, then direct it upward to the two orifices, surging straight into the five stars. Await the radiant stillness, then observe the heart releasing a segment downward. Await another radiance, and the true qi of the first yang is born. Maintain unbroken continuity—just eighty percent.",
      "start_char": 15134,
      "end_char": 15713,
      "start_sentence": 649,
      "end_sentence": 672,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.76006770133972,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\玉清金笥青华秘文金宝内炼丹诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 21,
      "original_text": "宜秘！ 宜秘！ . 第四转：进一寸，用法如前，此辰时之用功也。 第五转：进五分，用法如前，此已时之用功也。 第六转抽添：进五分，火自下，与午时心火顶火俱旺，故阳生小抑之抽也，再生则火微矣！ 直上于左而横过，恰值心遂，逢心火，火其炎矣！ 此抽添也。 第七转：进五分，用如前法，此未时之用功也。 第八转沐浴：行左降右，取丹方一寸，未时之火道，皆至阴之道也。 火力过而衰，值申道，亦阴道，无他，心上道，阳道也，心下道，阴道也。 二时火皆从阴道过，至酉而始金旺，故静以待之。 火为金液而归于鼎丹，遂沐浴，卯沐浴乃益汞，酉沐浴是益铅。 第九转：取丹，五分而已，顷刻用而即定以待。 第十转亥：用巽风起火，行运火之法，见火候之图。 火气　　　　认着 采取图 天向一中分造化 人从心上起经纶 玉清金笥青华秘文金宝内炼丹诀卷下竟",
      "translated_text": "**Guard this well! Guard this well!**\n\n**Fourth Revolution:** Advance one *cun*, employing the previous method. This is the practice at the *chen* hour.\n**Fifth Revolution:** Advance five *fen*, employing the previous method. This is the practice at the *si* hour.\n**Sixth Revolution—Withdrawal and Addition:** Advance five *fen*. Fire arises from below, and at the *wu* hour, the heart-fire and crown-fire blaze together; thus, yang’s initial flourishing is slightly restrained in withdrawal. When it revives, the fire is already faint! Ascend directly to the left, then traverse horizontally—just as it reaches the heart, encountering heart-fire, the flames flare fiercely! This is withdrawal and addition.\n\n**Seventh Revolution:** Advance five *fen*, employing the previous method. This is the practice at the *wei* hour.\n**Eighth Revolution—Bathing:** Proceed leftward in descent, rightward in ascent, retrieving the elixir precisely one *cun*. The fire-path of the *wei* hour is entirely the path of utmost yin. When fire’s power wanes, it meets the *shen* path—also a yin path. There is no other way: above the heart lies the yang path; below the heart, the yin path. The fires of both hours pass through the yin path, and only at *you* does metal begin to flourish; thus, await it in stillness. Fire transforms into golden liquid and returns to the elixir within the cauldron. Thus bathe: the *mao*-hour bathing augments mercury, while the *you*-hour bathing augments lead.\n\n**Ninth Revolution:** Retrieve the elixir, merely five *fen*, applying it in an instant before settling to await.\n**Tenth Revolution—Hai Hour:** Employ the *xun* wind to kindle fire, performing the method of revolving fire. Consult the *Fire-Timing Diagram*.\n\n**Fire Qi**\n*Recognize it well!*\n\n**Diagram of Gathering and Refining**\nHeaven divides creation at its center;\nMan initiates his great work from the heart.\n\n*Secret Writ of Jade Purity, Golden Casket, and Azure Splendor*\n*Concluding the Inner Alchemy Formulae of the Golden Treasure*\n*End of Scroll Three*",
      "overlap_context": " *mao* hour, when fire arises to retrieve the elixir, measure four *cun*—two threads form the path of fire. The pulse penetrates the cauldron, so when fire arises, do not use the eyes or heart; guide it with intention. Rotate right to align horizontally with the cauldron—this is the true thread of earth. Then enter profound stillness, and fire transforms into water, returning to the elixir within the cauldron. Thus bathe, maintaining unbroken continuity.\n\nHeavenly mechanism! Heavenly mechanism!\"",
      "start_char": 15713,
      "end_char": 16087,
      "start_sentence": 673,
      "end_sentence": 692,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.275663137435913,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\玉清金笥青华秘文金宝内炼丹诀.txt",
        "category": "方法类"
      }
    }
  ]
}