{
  "source_id": "玉清上宫科太真文",
  "source_file": "chunked_daozang\\玉清上宫科太真文.json",
  "total_chunks": 8,
  "total_original_chars": 3841,
  "total_translated_chars": 25411,
  "total_translation_time": 115.16456985473633,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\玉清上宫科太真文.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**Jade Purity Supreme Palace Regulations of the Grand Perfection Text**\n\n*Scripture Title:* *Jade Purity Supreme Palace Regulations of the Grand Perfection Text*. Author unknown, approximately composed during the Northern and Southern Dynasties. Contains the regulations and precepts of the Grand Perfection, along with the names, taboos, and images of the various Heavenly Lords. One scroll.\n\n*Source:* *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n---\n\n**Jade Purity Supreme Palace Regulations of the Grand Perfection Text**\n\nTo betray the master and neglect the Dao,\nTo assail the master and attack the Dao,\nTo envy the master and obstruct the Dao,\nTo deceive the master and mislead the Dao—\n\nOne ought to cherish the master and honor the Dao,\nOught to revere the master and esteem the Dao,\nOught to uphold the master and trust the Dao,\nOught to delight in the master and return to the Dao,\nOught to serve the master and inquire of the Dao,\nOught to exalt the master and treasure the Dao,\nOught to remember the master and preserve the Dao,\nOught to follow the master and turn toward the Dao.\n\n**First Article, First Chapter**, under the jurisdiction of the Upper Prime Luminous Brahma, Supreme Luminous Ministry, governed by the True Inspector of Immortals, with twenty-four myriad officials presiding.\n\nTo disdain the scriptures and despise the Dao,\nTo defame the scriptures and disregard the Dao,\nTo doubt the scriptures and slander the Dao,\nTo damage the scriptures and ruin the Dao—\n\nRevealing scriptures and exposing the Dao,\nTransmitting scriptures and demeaning the Dao,\nStealing scriptures and thieving the Dao,\nDefying scriptures and betraying the Dao.\nOne ought to exalt the scriptures and honor the Dharma,\nOught to revere the scriptures and esteem the Dharma,\nOught to trust the scriptures and turn toward the Dharma,\nOught to cherish the scriptures and treasure the Dharma,\nOught to conceal the scriptures and safeguard the Dharma,\nOught to transmit the scriptures and heed the Dharma,\nOught to pledge to the scriptures and follow the master’s Dharma,\nOught to follow the scriptures and seek the Dharma.\n\n**Second Article, Second Chapter**, under the jurisdiction of the Middle Prime Solar Ministry, governed by the Inspector of Immortals, with twenty-four myriad officials presiding.\n\nDrinking wine and scattering the spirit,\nIndulging in wine and losing one’s way,\nRaging with wine and losing one’s nature,\nProvoked by wine to reckless anger,\nLusting after wine and harming one’s qi,\nDisordering with wine and drifting astray,\nCreating wine and wailing in sorrow,\nBewildered by wine and lost in confusion.\nOne ought to moderate wine to nurture one’s nature,\nOught to abandon wine and swallow one’s saliva,\nOught to cut off wine and settle the spirit,\nOught to restrain wine to maintain constancy,\nOught to be cautious with wine to discipline the self,\nOught to distance oneself from wine and contemplate the True,\nOught to extinguish wine to uphold reverence,\nOught to renounce wine to pacify the heart.\n\n**Third Article, Third Chapter**, under the jurisdiction of the Lower Prime Dharma Decree Orthodox Immortal Ministry, governed by the Inspector of Immortals, with twenty-four myriad officials presiding.\n\nLustful desires defile and pollute,\nConsorting with kin in fleshly union,\nCoveting other men’s wives,\nLustful desires exceeding all bounds,\n\nWasting essence and losing qi,\nGreedy and filthy, arrogant and haughty,\nIndulging in rich flavors and glory,\nViolating Heaven’s prohibitions and taboos.\nOne ought to diligently purify the heart and cleanse the self,\nOught to harmonize the six relations,\nOught to guard the True and discipline conduct,\nOught to keep the eyes free from perversion,\nOught to cherish essence and nurture the spirit,\nOught to cultivate reverence and restrain the self,\nOught to calm the heart and follow nature,\nOught to maintain purity and act with awe and caution.\n\n**Fourth Article, Fourth Chapter**, under the jurisdiction of the Left Office Yang Brightness Orthodox Qi Ministry, governed by the Inspector of Immortals, with twenty-four myriad officials presiding.\n\nVicious speech and cruel tongues,\nSlandering the Dao and its teachers in litigation,\nMalicious attacks without cause,\nGossiping of others’ gains and losses,\nEnvying others while praising oneself,\nInciting strife among heaven and humanity,\nStirring up right and wrong,\nDamaging and depleting spirit and qi.\nOne ought to speak with kindness toward all beings,\nOught to cherish words and惜 speech,\nOught to discipline the mouth and guard against faults,\nOught to utter words that invoke goodness,\nOught to seal the mouth in yielding to righteousness,\nOught to speak with harmony and goodwill,\nOught to let the mouth always speak goodness,\nOught to treasure the mouth and nurture the spirit.\n\n**Fifth Article, Fifth Chapter**, under the jurisdiction of the Right Office Yin Origin Inspector of Immortals Ministry, with twenty-four myriad officials presiding.\n\nTaking lives and harming beings,\nMutilating fetuses and harming the pregnant,\nShooting flying birds,\nSlaughtering and harming the six livestock,\n\nHunting with hawks and coursing with hounds,\nWishing others’ ruin and downfall,\nMaiming and harming creatures that stir and move,\nCutting short the blossoms and fruits of life.\nOne ought to ponder human life,\nOught to ponder growth and flourishing,\nOught to ponder flight and soaring,\nOught to ponder the brevity of their lives,\nOught to ponder their lack of understanding,\nOught to wish others’ success and fulfillment,\nOught to ponder great compassion,\nOught to ponder lush abundance.\n\n**Fifth Article, Sixth Chapter**, under the jurisdiction of the Central Office Grand Rectifier of the Immortals Ministry, with twenty-four myriad officials presiding.\n\nSeizing what others cherish,\nConcealing and severing treasures,\nStealing the myriad things,\nDamaging and taking by force,\nPlotting treason and defying the Dao,\nScheming against ruler and father,\nGathering wicked factions,\nPlundering without restraint.\nOne ought to distance oneself from toil and abandon desire,\nOught to purify the heart and keep it unsullied,\nOught to uphold integrity and act with caution,\nOught to avoid suspicion and shun doubt,\nOught to ponder loyalty and diligence,\nOught to fulfill one’s duty to the utmost,\nOught to embrace emptiness and tranquility,\nOught to refrain from harming the myriad beings.\n\n**Fifth Article, Seventh Chapter**, under the jurisdiction of the Primordial Qi First Illumination Office Rectifier of the Immortals Ministry, with twenty-four myriad officials presiding.\n\nConcealing harm against the loyal and good,\nWishing others injury and ruin,\nExposing others’ hidden faults,\nHolding others’ strengths and weaknesses.\n\nDeceiving with outward compliance while harboring inner deceit,\nSpeaking fair words while concealing wickedness,\nEmploying cunning and deceit,\nUttering flowery speech devoid of substance.\nOne ought to refrain from harming the myriad beings,\nOught to contemplate peace throughout the world,\nOught not to expose others’ hidden affairs,\nOught not to exploit others’ weaknesses,\nOught to align heart with countenance,\nOught to harmonize inner and outer,\nOught to ponder loyalty and uprightness,\nOught to be steadfast without while sincere within.\n\n**Fifth Article, Eighth Chapter**, under the jurisdiction of the Primordial Qi Yellow Numinosity Office Rectifier of the Immortals Ministry, with twenty-four myriad officials presiding.\n\nDefiling and disdaining the Three Luminaries,\nShowing disrespect to gods and spirits,\nBaring oneself before the Five Peaks,\nRelieving oneself in rivers and seas,\nDestroying and abandoning serene shrines,\nBurning and ruining sacred texts,\nSlaying and assaulting divine spirits,\nMocking and ridiculing perfected immortals.\nOne ought to wear proper attire when going out and coming in,\nOught to revere and honor the Void and Nonexistent,\nOught to respect and serve the famous mountains,\nOught to maintain purity in clear streams,\nOught to wish for the Dao’s eternal presence,\nOught to esteem the celestial sages’ teachings,\nOught to ensure ghosts and spirits bear no grievance,\nOught to rejoice in and aspire to the immortal Dao.\n\nThe Ninth Section of the First Scroll, presided over by the Twenty-Four Myriad Officials of the Primordial Qi Cavern-Luminous Ministry of Grand Immortals.\n\nThe Nine Articles of the Grand Perfected Writ serve to examine the conduct of superior perfected ones in their immortal practice. Minor trials span three years, confronting myriad hardships; intermediate trials entail the loss of bodily form and immortal rank; major trials extend nine years, where after the wind-blade tribulation, one forfeits the human Dao.\n\nMinor merit manifests as radiant light in the world, with the Three Realms offering protection, averting untimely and unjust calamities. Intermediate merit commands the service of ten thousand spirits, naturally summoning the Five Emperors, and befriending perfected immortals. Great merit culminates in Dao attainment, ascending to heaven in broad daylight, ascending to the celestial palaces, and roaming freely in the Upper Clarity. The merits and transgressions are categorized according to the Grand Perfected Writ. All talismans within the scroll are inscribed in vermilion.\n\nThe Celestial Sovereign of the Supreme August Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Supreme Jade Perfection Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Clear Brightness and Harmonious Youth Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Mysterious Womb Nurturing Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Primordial Brightness and Literary Elevation Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Supreme Brightness and Seven Luminaries Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Void Transcending Balance Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Supreme Ultimate Veiled Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Vermilion Brightness and Harmonious Yang Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Mysterious Brightness and Reverent Splendor Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Radiant Brightness and Ancestral Drifting Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Bamboo Grove August Gourd Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Void Brightness and Hall Luminance Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Observant Brightness and Upright Serenity Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Mysterious Brightness and Reverent Celebration Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Supreme Resplendence and Jade Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Primordial Capacity and Aperture Ascent Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Supreme Peace and August Cliff Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Manifest Determination and Ultimate Wind Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Primordial Yellow and Filial Awn Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Supreme Yellow and Venerable Weight Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Thoughtless River and Origin Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Supreme Divination and Joyous Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Limitless Vow Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Luminous Court and Cloudy Ascent Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Abyssal Penetration and Primordial Cavern Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Grand Literary Grace Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Supreme Simplicity and Forbidden Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Supreme Void and Constant Fusion Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Supreme Release and Ascendant Victory Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Dragon Transformation and Brahman Ascent Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Supreme Ultimate and Flourishing Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\n\nThe Primordial Origin arose before the formless heavens, within the mysterious qi, chaotic and without shape, transforming nine times in a single day. Upon reaching the Upper Mystery, the Azure Qi gave birth to the Sovereign, styled the \"Eternally Abiding Without Form.\" Born within the Azure Qi, he was named the \"Eternally Abiding Without Form,\" with the cognomen Wheel Heaven Lad, who, after one kalpa within the qi, gave birth to the Mysterious Qi of the Mysterious.\n\nAfter the Mysterious Qi was established, by the Middle Origin, the Yellow Qi first divided. The Wheel Heaven Lad uttered this writ upon the Azure Yang, named the \"Writ of the Opening Venerable Master,\" with thirty-six direct talisman officials. By the time the Three Origins were established, this writ became luminous in the Lunar Palace. The Wheel Heaven Lad transformed and was born within the Middle Origin Yellow Qi, styled the \"Nameless Sovereign,\" with the cognomen Avalokiteśvara, who, after two kalpas within the Yellow Qi, gave birth to the Lower Origin White Qi.\n\nAfter the Middle Origin Prosperity was established, by the Middle Origin Qi, Avalokiteśvara uttered this writ upon the Yellow Essence, named the \"Writ of Pervasive Scenery and Salvific Measure,\" with thirty-six direct talisman officials. By the time the Celestial Origin clouds divided and judged, it was to examine the Most High Venerable. Avalokiteśvara transformed and was born within the Lower Origin White Qi, styled the \"Primordial Venerable,\" with the cognomen Opening Supreme Clarity. Within the White Qi, this one spirit transformed into three appellations, abiding within the three qi of the chaotic kalpas for three kalpas, giving birth to the Clear and Subtle Heaven.\n\nAfter Avalokiteśvara, by the Clear and Subtle Heaven, Opening Supreme Clarity uttered this writ within the White Qi, named the \"Writ of Numinous Flight and Transcending Tribulation,\" with thirty-six direct talisman officials. Upon the Clear and Subtle Heaven, it was to examine the Most High Great Dao Sovereign. The Celestial Emperor of the Clear and Subtle Heaven established the Clear and Subtle Heaven, styled the \"Primordial Celestial King,\" with the cognomen Chaotic Spirit Supreme Essence, which was the cognomen of the Primordial Venerable. Within the Clear and Subtle Heaven, he governed the Upper Palace of Jade Clarity for one kalpa, giving birth to the Yu-Yu Heaven.\n\nThe Yu-Yu Heaven gave birth to the Huang-Zeng Heaven, also named the Mi-Fan-Luo-Tai-Xiao-Jue-Fei Heaven, the cloud-root capital of the Jade Clarity’s Upper Writ, where the essence opened the True Cavern’s Luminous Jade Treasure, with thirty-six direct talisman officials. The Celestial Emperor of the Yu-Yu Heaven established the Yu-Yu Heaven, styled the \"High Sage Jade Dawn Supreme Great Dao,\" with the cognomen Yan-Chun. Within the Yu-Yu Heaven, at the Great Mystery Capital, he governed for two kalpas, giving birth to the Great Red Heaven.\n\nThe Yu-Yu Heaven gave birth to the Tai-Ming-Yu-Wan Heaven, also named the Yu-Yue-Na-Lin-Chang-Yu-Tai Heaven. Upon its establishment, the celestial essence gave birth to the Nine Radiance Great Dawn Cavern-True Entering-Nothing Flying Scenery Jade Talisman, with thirty-six direct talisman officials.\n\nThe Celestial Emperor of the Great Red Heaven first established it, styled the \"Three Heavens Jade Youth,\" with the cognomen Yuan-Zheng-Xian. Within the Great Red Heaven, he governed for three kalpas, giving birth to the Yu-Shan-Immeasurable Heaven.\n\nThe Great Red Heaven gave birth to the Qing-Ming-He-Tong Heaven, also named the Gao-Tao-Chong-Long-Luo Heaven. Upon its establishment, the celestial essence gave birth to the Observing Numinous Primordial Spirit Flying Heaven Birth-Immortal Jade Talisman, with thirty-six direct talisman officials.\n\nThe Celestial Emperor of the Yu-Shan-Immeasurable Heaven first established it, styled the \"Nine Heavens Venerable,\" with the cognomen Kai-Yuan. Within the Immeasurable Heaven, by one qi, he ascended to abdicate to the Uppermost Good Immeasurable Longevity Heaven.\n\nThe Yu-Shan-Immeasurable Heaven first established, gave birth to the Xuan-Tai-Ping-Yu Heaven, also named the Bi-Luo-Kong-Ge-Yu-Li Heaven. Upon its establishment, the celestial essence gave birth to the General Dawn Non-Ultimate Flying Immortal Salvation-World Talisman, with thirty-six direct talisman officials.\n\nThe Celestial King of the Uppermost Good Immeasurable Longevity Heaven first established it, styled the \"Nine Heavens True King,\" with the cognomen Shang-Ming. Within the Immeasurable Longevity Heaven, by two qi, he gave birth to the Upper Supervisory Heaven.\n\nThe Uppermost Good Immeasurable Heaven gave birth to the Yuan-Ming-Wen-Ju Heaven, also named the Jia-Mo-Tan-Lou-Yu-Yi Heaven. Upon its establishment, the celestial essence gave birth to the Convergent Radiance Resisting-Root Flying Birth Salvation-World Divine Immortal Jade Talisman, with thirty-six direct talisman officials.\n\nThe Celestial King of the Upper Supervisory Heaven first established it, styled the \"Nine Empyrean Supreme True Venerable,\" with the cognomen Ning. Within the Upper Supervisory Heaven, by three qi, he gave birth to the Dou-Shu Heaven.\n\nThe Upper Supervisory Heaven gave birth to the Shang-Ming-Qi-Yao Heaven, also named the Fu-Dao-Gai-Hua-Fu-Luo Heaven. Upon its establishment, the celestial essence gave birth to the Flying Primordial Mysterious Scenery Dawn Level Salvation-World Divine Immortal Jade Talisman, with thirty-six direct talisman officials.\n\nThe Celestial King of the Dou-Shu Heaven first established it, styled the \"Nine Empyrean Great True King,\" with the cognomen Ming-Chuan. Within the Dou-Shu Heaven, by four qi, he gave birth to the No-Pride Joy Heaven.\n\nThe Dou-Shu Heaven gave birth to the Xu-Wu-Yue-Heng Heaven, also named the Wei-Ye-Qu-Chu-Mo Heaven. Upon its establishment, the celestial essence gave birth to the Conjoined Radiance Dawn Life Responding Numinous Immortal Jade Talisman, with thirty-six direct talisman officials.\n\nThe Celestial King of the No-Pride Joy Heaven established it, styled the \"Myriad Beginnings Master Cavern-Rippling Waves,\" governing within the No-Pride Joy Heaven by five qi, giving birth to the Responsive Sound Heaven.\n\nThe No-Pride Joy Heaven gave birth to the Tai-Ji-Meng-Yi Heaven, also named the Chong-Rong-Yu-Yu-Gu-Sha Heaven. Upon its establishment, the Upper Clarity gave birth to the Cavern-Subtle Equal-True Radiance Dawn Mysterious Scenery Jade Talisman, with thirty-six direct talisman officials.\n\nThe Celestial King of the Responsive Sound Heaven, styled the \"Scenery Dao August Uppermost Master,\" with the cognomen Yue, governed within the Responsive Sound Heaven by six qi, giving birth to the Brahma Treasure Heaven.\n\nThe Responsive Sound Heaven gave birth to the Chi-Ming-He-Yang Heaven, also named the Shan-Yuan-Cha-Bao-Lun-Fa Heaven. Upon its establishment, the celestial essence gave birth to the Jade Canopy Salvation-Immortal Seven Dragons Marriage-Concealment Talisman, with thirty-six direct talisman officials.\n\nThe Celestial Emperor of the Brahma Treasure Heaven, styled the \"Eight Observations High Primordial Purple Scenery Lord,\" with the cognomen Dao-Jing, governed within the Brahma Treasure Heaven by seven qi, giving birth to the Brahma-Makaya Heaven.\n\nThe Brahma Treasure Heaven gave birth to the Xuan-Ming-Gong-Hua Heaven, also named the Fan-Yuan-Water-Path Heaven. Upon its establishment, the celestial essence gave birth to the Great Salvation-World Flying Immortal Entering-Primordial Jade Talisman, with thirty-six direct talisman officials.\n\nThe Celestial Emperor of the Brahma-Makaya Heaven, styled the \"Nine Augusts Purple Heaven Elder,\" with the cognomen Zhi-Shu, governed within the Brahma-Makaya Heaven by eight qi, giving birth to the Pari-Da-He Heaven.\n\nThe Brahma-Makaya Heaven gave birth to the Yao-Ming-Zong-Piao Heaven, also named the Fan-Qi-Small-Micro Heaven. Upon its establishment, the celestial essence gave birth to the Divine Immortal Nine Preservations Primordial Jade Talisman, with thirty-six direct talisman officials.\n\nThe Celestial Emperor of the Pari-Da-He Heaven first gave birth to the Red Essence Supreme True Chaotic Primordial. Within the Pari-Da-He Heaven, by one kalpa, he gave birth to the Mo-Ke-Ru-Ming Heaven.\n\nThe Pari-Da-He Heaven gave birth to the Zhu-Luo-Huang-Jia Heaven, also named the Brahma-Conduct Heaven. Upon its establishment, the celestial essence gave birth to the Divine Immortal Flying Conduct Cavern-Primordial Jade Talisman, with thirty-six direct talisman officials.\n\nThe Celestial Lord and King of the Mo-Ke-Ru-Ming Heaven, styled the \"Jade Clarity High Supreme Primordial Sovereign,\" with the cognomen Kai-Zao, governed within the Mo-Ke-Ru-Ming Heaven by one kalpa, giving birth to the A-Po-Luo-Mo-Ru-He Heaven.\n\nThe Mo-Ke-Ru-Ming Heaven gave birth to the Xu-Ming-Tang-Yao Heaven, also named the Brahma Heaven. Upon its establishment, the celestial essence gave birth to the Divine Immortal Salvation-World Life-Connecting Jade Talisman, with thirty-six direct talisman officials.\n\nThe Celestial King of the A-Po-Luo-Mo-Ru-He Heaven, styled the \"Jade Clarity Purple Void High Supreme Primordial August,\" with the cognomen Ji, governed within the A-Po-Luo-Mo-Ru-He Heaven by one kalpa, giving birth to the A-Wei-Yi-Luo Heaven.\n\nThe A-Po-Luo-Mo-Ru-Qi Heaven gave birth to the Guan-Ming-Duan-Jing Heaven, also named the Great Radiance Heaven. Upon its establishment, the celestial essence gave birth to the Divine Immortal Salvation-World Flying Spirit Jade Talisman, with thirty-six direct talisman officials.\n\nThe Celestial King of the A-Wei-Yi-Luo Heaven, styled the \"Jade Clarity Upper August Jade Void Lord,\" with the cognomen Ming-Lan, governed within the A-Wei-Yi-Luo Heaven by one kalpa, giving birth to the Tai-Xuan-Na-Shou Heaven.\n\nThe A-Wei-Yi-Luo Heaven gave birth to the Xuan-Ming-Gong-Qing Heaven, also named the Water-Sound Mysterious Sand Heaven. Upon its establishment, the celestial essence gave birth to the Divine Immortal Salvation-World Flying Birth Jade Talisman, with thirty-six direct talisman officials.\n\nThe Concluding Section of the Jade Clarity Upper Palace Regulations on the Great Perfection Scriptures\n\n[Note 1: The character \"又\" is suspected to be a miswriting of \"分\".]\n[Note 2: The phrase \"天天\" is suspected to be a miswriting of \"天立\".]\n[Note 3: The character \"元\" is suspected to be a miswriting of \"字\".]\n[Note 4: The two characters \"直符\" were originally missing and have been supplemented based on the context.]\n[Note 5: The two characters \"玉符\" were originally missing and have been supplemented based on the context.]",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "玉清上宫科太真文 经名：玉清上宫秤太真文。 撰人不详，约出於南北期。 内载太真科律及诸天帝君名讳图像。 一卷。 底本出处：《正统道藏》正一部。 玉清上宫科太真文 违师忽道，　　攻师伐道， 嫉师拓道，　　惘师欺道。 当爱师重道，　当敬师尊道， 当承师信道，　当乐师归道， 当奉师参道，　当崇师贵道， 当念师存道，　当从师向道。 一条第一品，属上元明梵太明曹领真监仙考官，二十四万人主之。 慢经贱道，　　毁经忽道， 疑经谤道，　　破经坏道，",
      "translated_text": "**Jade Purity Supreme Palace Regulations of the Grand Perfection Text**\n\n*Scripture Title:* *Jade Purity Supreme Palace Regulations of the Grand Perfection Text*. Author unknown, approximately composed during the Northern and Southern Dynasties. Contains the regulations and precepts of the Grand Perfection, along with the names, taboos, and images of the various Heavenly Lords. One scroll.\n\n*Source:* *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n---\n\n**Jade Purity Supreme Palace Regulations of the Grand Perfection Text**\n\nTo betray the master and neglect the Dao,\nTo assail the master and attack the Dao,\nTo envy the master and obstruct the Dao,\nTo deceive the master and mislead the Dao—\n\nOne ought to cherish the master and honor the Dao,\nOught to revere the master and esteem the Dao,\nOught to uphold the master and trust the Dao,\nOught to delight in the master and return to the Dao,\nOught to serve the master and inquire of the Dao,\nOught to exalt the master and treasure the Dao,\nOught to remember the master and preserve the Dao,\nOught to follow the master and turn toward the Dao.\n\n**First Article, First Chapter**, under the jurisdiction of the Upper Prime Luminous Brahma, Supreme Luminous Ministry, governed by the True Inspector of Immortals, with twenty-four myriad officials presiding.\n\nTo disdain the scriptures and despise the Dao,\nTo defame the scriptures and disregard the Dao,\nTo doubt the scriptures and slander the Dao,\nTo damage the scriptures and ruin the Dao—",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 237,
      "start_sentence": 0,
      "end_sentence": 15,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.436654806137085,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\玉清上宫科太真文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "泄经露道，　　传经贱道， 窃经盗道，　　违经负道。 当崇经重法，　当尊经贵法， 当信经向法，　当爱经惜法， 当秘经宝法，　当传经昕法， 当盟经师法，　当从经求法。 一条第二品，属中元太阳曹监仙考官，二十四万人主之。 饮酒丧神，　　耽酒迷荒， 狂酒失性，　　因酒慎怒， 淫酒伤气，　　乱酒流荡， 作酒啼昤，　　迷酒恍惚。 当节酒养性，　当弃酒咽液， 当绝酒定神，　当制酒使常， 当慎酒检身，　当远酒念真， 当灭酒恭礼，　当写酒安心。 一条第三品，下元法令正仙曹考官，二十四万人主之。 淫色秽浊，　　骨肉交通， 爱他妇女，　　淫色过荡，",
      "translated_text": "Revealing scriptures and exposing the Dao,\nTransmitting scriptures and demeaning the Dao,\nStealing scriptures and thieving the Dao,\nDefying scriptures and betraying the Dao.\nOne ought to exalt the scriptures and honor the Dharma,\nOught to revere the scriptures and esteem the Dharma,\nOught to trust the scriptures and turn toward the Dharma,\nOught to cherish the scriptures and treasure the Dharma,\nOught to conceal the scriptures and safeguard the Dharma,\nOught to transmit the scriptures and heed the Dharma,\nOught to pledge to the scriptures and follow the master’s Dharma,\nOught to follow the scriptures and seek the Dharma.\n\n**Second Article, Second Chapter**, under the jurisdiction of the Middle Prime Solar Ministry, governed by the Inspector of Immortals, with twenty-four myriad officials presiding.\n\nDrinking wine and scattering the spirit,\nIndulging in wine and losing one’s way,\nRaging with wine and losing one’s nature,\nProvoked by wine to reckless anger,\nLusting after wine and harming one’s qi,\nDisordering with wine and drifting astray,\nCreating wine and wailing in sorrow,\nBewildered by wine and lost in confusion.\nOne ought to moderate wine to nurture one’s nature,\nOught to abandon wine and swallow one’s saliva,\nOught to cut off wine and settle the spirit,\nOught to restrain wine to maintain constancy,\nOught to be cautious with wine to discipline the self,\nOught to distance oneself from wine and contemplate the True,\nOught to extinguish wine to uphold reverence,\nOught to renounce wine to pacify the heart.\n\n**Third Article, Third Chapter**, under the jurisdiction of the Lower Prime Dharma Decree Orthodox Immortal Ministry, governed by the Inspector of Immortals, with twenty-four myriad officials presiding.\n\nLustful desires defile and pollute,\nConsorting with kin in fleshly union,\nCoveting other men’s wives,\nLustful desires exceeding all bounds,",
      "overlap_context": "o,\nOught to remember the master and preserve the Dao,\nOught to follow the master and turn toward the Dao.\n\n**First Article, First Chapter**, under the jurisdiction of the Upper Prime Luminous Brahma, Supreme Luminous Ministry, governed by the True Inspector of Immortals, with twenty-four myriad officials presiding.\n\nTo disdain the scriptures and despise the Dao,\nTo defame the scriptures and disregard the Dao,\nTo doubt the scriptures and slander the Dao,\nTo damage the scriptures and ruin the Dao—",
      "start_char": 237,
      "end_char": 540,
      "start_sentence": 16,
      "end_sentence": 33,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.17996621131897,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\玉清上宫科太真文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "亡精丧气，　　贪浊矫慢， 耽味荣华，　　犯天禁忌。 当勤心洁己，　当六亲和睦， 当守真检行，　当自无邪视， 当爱精养神，　当恭心自敛， 当夷心自然，　当清白畏慎。 一条第四品，左官阳明正气曹考仙官，二十四万人主之。 恶口赤舌，　　诉论师道， 谗击无端，　　说人得失， 嫉人称己，　　斗乱天人， 走作是非，　　伤损神气。 当念口慈物，　当爱口惜言， 当检口慎过，　当发口念善， 当结口让义，　当善口和睦， 当吐口常善，　当宝口养神。 一条第五品，右官阴元考仙曹考仙官，二十四万人主之。 伤煞人命，　　残胎害孕， 弹射飞乌，　　煞害六畜，",
      "translated_text": "Wasting essence and losing qi,\nGreedy and filthy, arrogant and haughty,\nIndulging in rich flavors and glory,\nViolating Heaven’s prohibitions and taboos.\nOne ought to diligently purify the heart and cleanse the self,\nOught to harmonize the six relations,\nOught to guard the True and discipline conduct,\nOught to keep the eyes free from perversion,\nOught to cherish essence and nurture the spirit,\nOught to cultivate reverence and restrain the self,\nOught to calm the heart and follow nature,\nOught to maintain purity and act with awe and caution.\n\n**Fourth Article, Fourth Chapter**, under the jurisdiction of the Left Office Yang Brightness Orthodox Qi Ministry, governed by the Inspector of Immortals, with twenty-four myriad officials presiding.\n\nVicious speech and cruel tongues,\nSlandering the Dao and its teachers in litigation,\nMalicious attacks without cause,\nGossiping of others’ gains and losses,\nEnvying others while praising oneself,\nInciting strife among heaven and humanity,\nStirring up right and wrong,\nDamaging and depleting spirit and qi.\nOne ought to speak with kindness toward all beings,\nOught to cherish words and惜 speech,\nOught to discipline the mouth and guard against faults,\nOught to utter words that invoke goodness,\nOught to seal the mouth in yielding to righteousness,\nOught to speak with harmony and goodwill,\nOught to let the mouth always speak goodness,\nOught to treasure the mouth and nurture the spirit.\n\n**Fifth Article, Fifth Chapter**, under the jurisdiction of the Right Office Yin Origin Inspector of Immortals Ministry, with twenty-four myriad officials presiding.\n\nTaking lives and harming beings,\nMutilating fetuses and harming the pregnant,\nShooting flying birds,\nSlaughtering and harming the six livestock,",
      "overlap_context": "lf,\nOught to distance oneself from wine and contemplate the True,\nOught to extinguish wine to uphold reverence,\nOught to renounce wine to pacify the heart.\n\n**Third Article, Third Chapter**, under the jurisdiction of the Lower Prime Dharma Decree Orthodox Immortal Ministry, governed by the Inspector of Immortals, with twenty-four myriad officials presiding.\n\nLustful desires defile and pollute,\nConsorting with kin in fleshly union,\nCoveting other men’s wives,\nLustful desires exceeding all bounds,",
      "start_char": 540,
      "end_char": 844,
      "start_sentence": 34,
      "end_sentence": 51,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.22647738456726,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\玉清上宫科太真文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "飞鹰走犬，　　愿人死败， 残贼蠢动，　　夭伤华实。 当念人命，　　当念成长， 当念飞翔，　　当念其命促， 当念其无知，　当愿人成就， 当念大慈，　　当念繁茂。 一条第六品，中宫大正曹总仙考官，二十四万人主之。 夺人所爱，　　匿割珍宝， 偷盗万物，　　损割取与， 谋逆无道，　　规图君父， 招合凶党，　　掠夺无度。 当远劳去欲，　当洁心清白， 当守廉慎行，　当避嫌远疑， 当念忠谨，　　当尽节所奉， 当空寂安笃，　当无犯万物。 一条第七品，玄气始明曹正仙考官，二十四万人主之。 韬害忠良，　　愿人伤败， 发人阴私，　　持人长短，",
      "translated_text": "Hunting with hawks and coursing with hounds,\nWishing others’ ruin and downfall,\nMaiming and harming creatures that stir and move,\nCutting short the blossoms and fruits of life.\nOne ought to ponder human life,\nOught to ponder growth and flourishing,\nOught to ponder flight and soaring,\nOught to ponder the brevity of their lives,\nOught to ponder their lack of understanding,\nOught to wish others’ success and fulfillment,\nOught to ponder great compassion,\nOught to ponder lush abundance.\n\n**Fifth Article, Sixth Chapter**, under the jurisdiction of the Central Office Grand Rectifier of the Immortals Ministry, with twenty-four myriad officials presiding.\n\nSeizing what others cherish,\nConcealing and severing treasures,\nStealing the myriad things,\nDamaging and taking by force,\nPlotting treason and defying the Dao,\nScheming against ruler and father,\nGathering wicked factions,\nPlundering without restraint.\nOne ought to distance oneself from toil and abandon desire,\nOught to purify the heart and keep it unsullied,\nOught to uphold integrity and act with caution,\nOught to avoid suspicion and shun doubt,\nOught to ponder loyalty and diligence,\nOught to fulfill one’s duty to the utmost,\nOught to embrace emptiness and tranquility,\nOught to refrain from harming the myriad beings.\n\n**Fifth Article, Seventh Chapter**, under the jurisdiction of the Primordial Qi First Illumination Office Rectifier of the Immortals Ministry, with twenty-four myriad officials presiding.\n\nConcealing harm against the loyal and good,\nWishing others injury and ruin,\nExposing others’ hidden faults,\nHolding others’ strengths and weaknesses.",
      "overlap_context": "to seal the mouth in yielding to righteousness,\nOught to speak with harmony and goodwill,\nOught to let the mouth always speak goodness,\nOught to treasure the mouth and nurture the spirit.\n\n**Fifth Article, Fifth Chapter**, under the jurisdiction of the Right Office Yin Origin Inspector of Immortals Ministry, with twenty-four myriad officials presiding.\n\nTaking lives and harming beings,\nMutilating fetuses and harming the pregnant,\nShooting flying birds,\nSlaughtering and harming the six livestock,",
      "start_char": 844,
      "end_char": 1144,
      "start_sentence": 52,
      "end_sentence": 69,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.6262311935424805,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\玉清上宫科太真文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "面是心非，　　口美内恶， 欺诈巧便，　　华言无实。 当无伤万物，　当念天下平， 勿伤人阴事，　勿乘人之短， 当心面相应，　当内外和睦， 当念忠直，　　当外坚内实。 一条第八品，元气黄灵曹部仙考官，二十四万人主之。 秽慢三光，　　不敬神祇， 裸露五岳，　　便曲江海， 毁废靖祠，　　烧败圣文， 诛伐神灵，　　哂笑真仙。 当冠带出入，　当崇仰虚无， 当敬奉名山，　当精洁清流， 当愿道常存，　当贵天圣音， 当鬼神无怨，　当欣愿仙道。",
      "translated_text": "Deceiving with outward compliance while harboring inner deceit,\nSpeaking fair words while concealing wickedness,\nEmploying cunning and deceit,\nUttering flowery speech devoid of substance.\nOne ought to refrain from harming the myriad beings,\nOught to contemplate peace throughout the world,\nOught not to expose others’ hidden affairs,\nOught not to exploit others’ weaknesses,\nOught to align heart with countenance,\nOught to harmonize inner and outer,\nOught to ponder loyalty and uprightness,\nOught to be steadfast without while sincere within.\n\n**Fifth Article, Eighth Chapter**, under the jurisdiction of the Primordial Qi Yellow Numinosity Office Rectifier of the Immortals Ministry, with twenty-four myriad officials presiding.\n\nDefiling and disdaining the Three Luminaries,\nShowing disrespect to gods and spirits,\nBaring oneself before the Five Peaks,\nRelieving oneself in rivers and seas,\nDestroying and abandoning serene shrines,\nBurning and ruining sacred texts,\nSlaying and assaulting divine spirits,\nMocking and ridiculing perfected immortals.\nOne ought to wear proper attire when going out and coming in,\nOught to revere and honor the Void and Nonexistent,\nOught to respect and serve the famous mountains,\nOught to maintain purity in clear streams,\nOught to wish for the Dao’s eternal presence,\nOught to esteem the celestial sages’ teachings,\nOught to ensure ghosts and spirits bear no grievance,\nOught to rejoice in and aspire to the immortal Dao.",
      "overlap_context": "r loyalty and diligence,\nOught to fulfill one’s duty to the utmost,\nOught to embrace emptiness and tranquility,\nOught to refrain from harming the myriad beings.\n\n**Fifth Article, Seventh Chapter**, under the jurisdiction of the Primordial Qi First Illumination Office Rectifier of the Immortals Ministry, with twenty-four myriad officials presiding.\n\nConcealing harm against the loyal and good,\nWishing others injury and ruin,\nExposing others’ hidden faults,\nHolding others’ strengths and weaknesses.",
      "start_char": 1144,
      "end_char": 1388,
      "start_sentence": 70,
      "end_sentence": 84,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.671573877334595,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\玉清上宫科太真文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "一条第九品，始气洞明曹太仙考官，二十四万人主之。 太真文九条科，以检上真持仙行。 小考三年生对万苦，中考灭身失仙品，大考九年风刀劫后失人道。 小功见世光明，三界侍护，不枉遭夭横； 中功万灵奉给，役召自然五帝，交友真人； 大功道成，白日升天，上登天阙，逍遥上清。 功过品目，如太真科文。 卷内符并朱书。 元始洞空自然高上王炁金阙上圣太皇皇曾天帝君。 元始洞空自然高上王炁金阙上圣太明玉完天帝君。 元始洞空自然高上王炁金阙上圣清明何童天帝君。 元始洞空自然高上王炁金阙上圣玄胎平育天帝君。 元始洞空自然高上王炁金阙上圣元明文举天帝君。 元始洞空自然高上王炁金阙上圣上明七耀天帝君。 元始洞空自然高上王炁金阙上圣虚无越衡天帝君。 元始洞空自然高上王炁金阙上圣太极蒙翳天帝君。 元始洞空自然高上王炁金阙上圣赤明和阳天帝君。 元始洞空自然高上王炁金阙上圣玄明恭华天帝君。 元始洞空自然高上王炁金阙上圣耀明宗飘天帝君。 元始洞空自然高上王炁金阙上圣竺落皇茄天帝君。 元始洞空自然高上王炁金阙上圣虚明堂曜天帝君。 元始洞空自然高上王炁金阙上圣观明端靖天帝君。 元始洞空自然高上王炁金阙上圣玄明恭庆天帝君。 元始洞空自然高上王炁金阙上圣太焕极瑶天帝君。 元始洞空自然高上王炁金阙上圣元载孔升天帝君。 元始洞空自然高上王炁金阙上圣太安皇崖天帝君。 元始洞空自然高上王炁金阙上圣显定极风天帝君。 元始洞空自然高上王炁金阙上圣始黄孝芒天帝君。 元始洞空自然高上王炁金阙上圣太黄翁重天帝君。 元始洞空自然高上王炁金阙上圣无思江由天帝君。 元始洞空自然高上王炁金阙上圣上揲阮乐天帝君。 元始洞空自然高上王炁金阙上圣无极昙誓天帝君。 元始洞空自然高上王炁金阙上圣皓庭霄度天帝君。 元始洞空自然高上王炁金阙上圣渊通元洞天帝君。 元始洞空自然高上王炁金阙上圣大文翰宠天帝君。 元始洞空自然高上王炁金阙上圣太素禁上天帝君。 元始洞空自然高上王炁金阙上圣太虚常融天帝君。 元始洞空自然高上王炁金阙上圣太释腾胜天帝君。 元始洞空自然高上王炁金阙上圣龙变梵度天帝君。 元始洞空自然高上王炁金阙上圣太极贾奕天帝君。 元始生於未天之先，於玄炁之中，混沌无形，一日九变。 逮至上玄青炁生君，号为无形常存。 君生青炁之中，号曰无形常存，字轮天童子，在炁中一劫，生玄玄炁。 玄炁立后，至中元黄炁始分，轮天童子口吐此文於青阳之上，名开先生真文，直符吏三十六人。 至三元立后，此文明於月宫。 轮天童子化生中元黄炁中，号曰无名之君，字观世音，在黄炁二劫，化生下始白炁。 中元熙立后，至中始炁又#1，观世音口吐此文於黄精之上，名通景度灵文，直符吏三十六人。 至天元云分判，以校太上丈人。 观世音化生下始白炁中，号曰元始丈人，字开上明，在白炁中，此一神化为三号，在三炁混沌之中三劫，生清微天。 观世音后，至清微天天#2，开上明口吐此文於白炁之中，名灵飞通仙度劫文，直符吏三十六人。 於清微天上，以校太上大道君。 清微天帝王清微天立，号曰元始天王，字混灵上精，则元始丈人之字，在清微天中，治玉清上宫一劫，化生禹余天。",
      "translated_text": "The Ninth Section of the First Scroll, presided over by the Twenty-Four Myriad Officials of the Primordial Qi Cavern-Luminous Ministry of Grand Immortals.\n\nThe Nine Articles of the Grand Perfected Writ serve to examine the conduct of superior perfected ones in their immortal practice. Minor trials span three years, confronting myriad hardships; intermediate trials entail the loss of bodily form and immortal rank; major trials extend nine years, where after the wind-blade tribulation, one forfeits the human Dao.\n\nMinor merit manifests as radiant light in the world, with the Three Realms offering protection, averting untimely and unjust calamities. Intermediate merit commands the service of ten thousand spirits, naturally summoning the Five Emperors, and befriending perfected immortals. Great merit culminates in Dao attainment, ascending to heaven in broad daylight, ascending to the celestial palaces, and roaming freely in the Upper Clarity. The merits and transgressions are categorized according to the Grand Perfected Writ. All talismans within the scroll are inscribed in vermilion.\n\nThe Celestial Sovereign of the Supreme August Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Supreme Jade Perfection Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Clear Brightness and Harmonious Youth Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Mysterious Womb Nurturing Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Primordial Brightness and Literary Elevation Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Supreme Brightness and Seven Luminaries Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Void Transcending Balance Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Supreme Ultimate Veiled Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Vermilion Brightness and Harmonious Yang Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Mysterious Brightness and Reverent Splendor Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Radiant Brightness and Ancestral Drifting Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Bamboo Grove August Gourd Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Void Brightness and Hall Luminance Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Observant Brightness and Upright Serenity Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Mysterious Brightness and Reverent Celebration Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Supreme Resplendence and Jade Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Primordial Capacity and Aperture Ascent Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Supreme Peace and August Cliff Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Manifest Determination and Ultimate Wind Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Primordial Yellow and Filial Awn Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Supreme Yellow and Venerable Weight Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Thoughtless River and Origin Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Supreme Divination and Joyous Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Limitless Vow Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Luminous Court and Cloudy Ascent Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Abyssal Penetration and Primordial Cavern Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Grand Literary Grace Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Supreme Simplicity and Forbidden Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Supreme Void and Constant Fusion Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Supreme Release and Ascendant Victory Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Dragon Transformation and Brahman Ascent Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\nThe Celestial Sovereign of the Supreme Ultimate and Flourishing Heaven of the Primordial Cavern-Void, Natural Highest King Qi, Golden Palace, Most Sagely Great Emperor.\n\nThe Primordial Origin arose before the formless heavens, within the mysterious qi, chaotic and without shape, transforming nine times in a single day. Upon reaching the Upper Mystery, the Azure Qi gave birth to the Sovereign, styled the \"Eternally Abiding Without Form.\" Born within the Azure Qi, he was named the \"Eternally Abiding Without Form,\" with the cognomen Wheel Heaven Lad, who, after one kalpa within the qi, gave birth to the Mysterious Qi of the Mysterious.\n\nAfter the Mysterious Qi was established, by the Middle Origin, the Yellow Qi first divided. The Wheel Heaven Lad uttered this writ upon the Azure Yang, named the \"Writ of the Opening Venerable Master,\" with thirty-six direct talisman officials. By the time the Three Origins were established, this writ became luminous in the Lunar Palace. The Wheel Heaven Lad transformed and was born within the Middle Origin Yellow Qi, styled the \"Nameless Sovereign,\" with the cognomen Avalokiteśvara, who, after two kalpas within the Yellow Qi, gave birth to the Lower Origin White Qi.\n\nAfter the Middle Origin Prosperity was established, by the Middle Origin Qi, Avalokiteśvara uttered this writ upon the Yellow Essence, named the \"Writ of Pervasive Scenery and Salvific Measure,\" with thirty-six direct talisman officials. By the time the Celestial Origin clouds divided and judged, it was to examine the Most High Venerable. Avalokiteśvara transformed and was born within the Lower Origin White Qi, styled the \"Primordial Venerable,\" with the cognomen Opening Supreme Clarity. Within the White Qi, this one spirit transformed into three appellations, abiding within the three qi of the chaotic kalpas for three kalpas, giving birth to the Clear and Subtle Heaven.\n\nAfter Avalokiteśvara, by the Clear and Subtle Heaven, Opening Supreme Clarity uttered this writ within the White Qi, named the \"Writ of Numinous Flight and Transcending Tribulation,\" with thirty-six direct talisman officials. Upon the Clear and Subtle Heaven, it was to examine the Most High Great Dao Sovereign. The Celestial Emperor of the Clear and Subtle Heaven established the Clear and Subtle Heaven, styled the \"Primordial Celestial King,\" with the cognomen Chaotic Spirit Supreme Essence, which was the cognomen of the Primordial Venerable. Within the Clear and Subtle Heaven, he governed the Upper Palace of Jade Clarity for one kalpa, giving birth to the Yu-Yu Heaven.",
      "overlap_context": "cred texts,\nSlaying and assaulting divine spirits,\nMocking and ridiculing perfected immortals.\nOne ought to wear proper attire when going out and coming in,\nOught to revere and honor the Void and Nonexistent,\nOught to respect and serve the famous mountains,\nOught to maintain purity in clear streams,\nOught to wish for the Dao’s eternal presence,\nOught to esteem the celestial sages’ teachings,\nOught to ensure ghosts and spirits bear no grievance,\nOught to rejoice in and aspire to the immortal Dao.",
      "start_char": 1389,
      "end_char": 2775,
      "start_sentence": 85,
      "end_sentence": 136,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.04565095901489,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\玉清上宫科太真文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "清微天化生皇曾天，一名弥梵罗台霄绝飞天，云根之都玉清上文，精开真洞明玉宝，直符三十六人。 禹余天帝王禹余天立，号高圣玉晨太上大道，字巘椿，在禹余天中太玄都二劫，化生大赤天。 禹余天化生太明玉完天，一名郁悦那林昌玉台天，天立上精，化生九晖太晨洞真入无飞景玉符，直符三十六人。 大赤天帝王大赤天始立，号曰三天玉童子，元#3正贤，於大赤天中三劫，化生郁单无量天。 大赤天化生清明何童天，一名高桃冲龙罗天，天立上精，化生观灵元神飞天生仙玉符，〔直符〕吏三十六人#4。 郁单无量天帝王始立，号九天丈人，字开元，於无量天中一炁，上禅善无量寿天。 郁单无量天始立，化生玄胎平育天，一名碧落空歌余黎天，天立上精，化生总晨无极飞仙度世符，直符吏三十六人。 上上禅善无量寿天王始立，号九天真王，字上明，於无量寿天中二炁，化生上监天。 上上禅善无量天化生元明文举天，一名加摩坦娄于翳天，天立上精，化生沓曜抗根飞生度世神仙玉符，直符吏三十六人。 上监天王始立，号九霄太真丈人，字凝，於上监天中三炁，化生兜术天。 上监天化生上明七耀天，一名扶刀盖华浮罗天，天立上精，化生飞元玄景晨平度世神仙玉符，直符吏三十六人。 兜术天王始立，号九霄大真王，字明喘，於兜术天中四炁，化生不骄乐天。 兜术天化生虚无越衡天，一名渭耶渠初默天，天立上精，化生合晖晨命应灵仙玉符，直符吏三十六人。 不骄乐天王立，号万始先生洞浪澜，於不骄乐天中五炁，化生应声天。 不骄乐天化生太极蒙翳天，一名冲容育郁谷沙天，天立上清，化生洞微齐真晖晨玄景玉符，直符吏三十六人。 化应声天王，号景道皇上先生，字越，於化应声天中六炁，化生梵宝天。 化应声天化生赤明和阳天，一号单缘察宝轮法天，天立上精，化生玉盖度仙七龙姻隐符，直符吏三十六人。 梵宝天帝王，号八观高元虚皇紫景君，字导精，於梵宝天中七炁，化生梵摩迦夷天。 梵宝天化生玄明恭华天，一名梵元水行天，天立上精，化生太度世飞仙入元〔玉符〕#5，直符吏三十六人。 梵摩迦夷天帝王，号九皇紫天老，字置戍，於梵摩迦夷天中八炁，化生波梨答和天。 梵摩迦夷天化生耀明宗飘天，一名梵炁小微天，天立上精，化生神仙九保元玉符，直符吏三十六人。 波梨答和天帝王，始生赤精太真混元，於波梨答和天中一元，化生摩苛褥明天。 波梨答和天化生竺落皇笳天，一名梵行天，天立上精，化生神仙飞行洞元玉符，直符吏三十六人。 摩苛褥明天帝君王，号玉清高上虚皇，字开造，於摩苛褥明天中一元，化生阿波罗摩褥和天。 摩苛褥明，化生虚明堂曜天，一名梵天，天立上精，化生神仙度世通命玉符，直符吏三十六人。 阿波罗摩褥和天帝王，号玉清紫虚高上元皇，字基，於阿波罗摩褥和天中一元，化生阿卫亿罗天。 阿波罗摩褥憩天化生观明端靖天，一名太皓天，天立上精，化生神仙度世飞神玉符，直符吏三十六人。 阿卫亿罗天帝王，号玉清上皇玉虚之君，字明兰，於阿卫亿罗天中一元，化生太玄那首天。 阿卫亿罗天化生玄明恭庆天，一名水音玄沙天，天立上精，化生神仙度世飞生玉符，直符吏三十六人。",
      "translated_text": "The Yu-Yu Heaven gave birth to the Huang-Zeng Heaven, also named the Mi-Fan-Luo-Tai-Xiao-Jue-Fei Heaven, the cloud-root capital of the Jade Clarity’s Upper Writ, where the essence opened the True Cavern’s Luminous Jade Treasure, with thirty-six direct talisman officials. The Celestial Emperor of the Yu-Yu Heaven established the Yu-Yu Heaven, styled the \"High Sage Jade Dawn Supreme Great Dao,\" with the cognomen Yan-Chun. Within the Yu-Yu Heaven, at the Great Mystery Capital, he governed for two kalpas, giving birth to the Great Red Heaven.\n\nThe Yu-Yu Heaven gave birth to the Tai-Ming-Yu-Wan Heaven, also named the Yu-Yue-Na-Lin-Chang-Yu-Tai Heaven. Upon its establishment, the celestial essence gave birth to the Nine Radiance Great Dawn Cavern-True Entering-Nothing Flying Scenery Jade Talisman, with thirty-six direct talisman officials.\n\nThe Celestial Emperor of the Great Red Heaven first established it, styled the \"Three Heavens Jade Youth,\" with the cognomen Yuan-Zheng-Xian. Within the Great Red Heaven, he governed for three kalpas, giving birth to the Yu-Shan-Immeasurable Heaven.\n\nThe Great Red Heaven gave birth to the Qing-Ming-He-Tong Heaven, also named the Gao-Tao-Chong-Long-Luo Heaven. Upon its establishment, the celestial essence gave birth to the Observing Numinous Primordial Spirit Flying Heaven Birth-Immortal Jade Talisman, with thirty-six direct talisman officials.\n\nThe Celestial Emperor of the Yu-Shan-Immeasurable Heaven first established it, styled the \"Nine Heavens Venerable,\" with the cognomen Kai-Yuan. Within the Immeasurable Heaven, by one qi, he ascended to abdicate to the Uppermost Good Immeasurable Longevity Heaven.\n\nThe Yu-Shan-Immeasurable Heaven first established, gave birth to the Xuan-Tai-Ping-Yu Heaven, also named the Bi-Luo-Kong-Ge-Yu-Li Heaven. Upon its establishment, the celestial essence gave birth to the General Dawn Non-Ultimate Flying Immortal Salvation-World Talisman, with thirty-six direct talisman officials.\n\nThe Celestial King of the Uppermost Good Immeasurable Longevity Heaven first established it, styled the \"Nine Heavens True King,\" with the cognomen Shang-Ming. Within the Immeasurable Longevity Heaven, by two qi, he gave birth to the Upper Supervisory Heaven.\n\nThe Uppermost Good Immeasurable Heaven gave birth to the Yuan-Ming-Wen-Ju Heaven, also named the Jia-Mo-Tan-Lou-Yu-Yi Heaven. Upon its establishment, the celestial essence gave birth to the Convergent Radiance Resisting-Root Flying Birth Salvation-World Divine Immortal Jade Talisman, with thirty-six direct talisman officials.\n\nThe Celestial King of the Upper Supervisory Heaven first established it, styled the \"Nine Empyrean Supreme True Venerable,\" with the cognomen Ning. Within the Upper Supervisory Heaven, by three qi, he gave birth to the Dou-Shu Heaven.\n\nThe Upper Supervisory Heaven gave birth to the Shang-Ming-Qi-Yao Heaven, also named the Fu-Dao-Gai-Hua-Fu-Luo Heaven. Upon its establishment, the celestial essence gave birth to the Flying Primordial Mysterious Scenery Dawn Level Salvation-World Divine Immortal Jade Talisman, with thirty-six direct talisman officials.\n\nThe Celestial King of the Dou-Shu Heaven first established it, styled the \"Nine Empyrean Great True King,\" with the cognomen Ming-Chuan. Within the Dou-Shu Heaven, by four qi, he gave birth to the No-Pride Joy Heaven.\n\nThe Dou-Shu Heaven gave birth to the Xu-Wu-Yue-Heng Heaven, also named the Wei-Ye-Qu-Chu-Mo Heaven. Upon its establishment, the celestial essence gave birth to the Conjoined Radiance Dawn Life Responding Numinous Immortal Jade Talisman, with thirty-six direct talisman officials.\n\nThe Celestial King of the No-Pride Joy Heaven established it, styled the \"Myriad Beginnings Master Cavern-Rippling Waves,\" governing within the No-Pride Joy Heaven by five qi, giving birth to the Responsive Sound Heaven.\n\nThe No-Pride Joy Heaven gave birth to the Tai-Ji-Meng-Yi Heaven, also named the Chong-Rong-Yu-Yu-Gu-Sha Heaven. Upon its establishment, the Upper Clarity gave birth to the Cavern-Subtle Equal-True Radiance Dawn Mysterious Scenery Jade Talisman, with thirty-six direct talisman officials.\n\nThe Celestial King of the Responsive Sound Heaven, styled the \"Scenery Dao August Uppermost Master,\" with the cognomen Yue, governed within the Responsive Sound Heaven by six qi, giving birth to the Brahma Treasure Heaven.\n\nThe Responsive Sound Heaven gave birth to the Chi-Ming-He-Yang Heaven, also named the Shan-Yuan-Cha-Bao-Lun-Fa Heaven. Upon its establishment, the celestial essence gave birth to the Jade Canopy Salvation-Immortal Seven Dragons Marriage-Concealment Talisman, with thirty-six direct talisman officials.\n\nThe Celestial Emperor of the Brahma Treasure Heaven, styled the \"Eight Observations High Primordial Purple Scenery Lord,\" with the cognomen Dao-Jing, governed within the Brahma Treasure Heaven by seven qi, giving birth to the Brahma-Makaya Heaven.\n\nThe Brahma Treasure Heaven gave birth to the Xuan-Ming-Gong-Hua Heaven, also named the Fan-Yuan-Water-Path Heaven. Upon its establishment, the celestial essence gave birth to the Great Salvation-World Flying Immortal Entering-Primordial Jade Talisman, with thirty-six direct talisman officials.\n\nThe Celestial Emperor of the Brahma-Makaya Heaven, styled the \"Nine Augusts Purple Heaven Elder,\" with the cognomen Zhi-Shu, governed within the Brahma-Makaya Heaven by eight qi, giving birth to the Pari-Da-He Heaven.\n\nThe Brahma-Makaya Heaven gave birth to the Yao-Ming-Zong-Piao Heaven, also named the Fan-Qi-Small-Micro Heaven. Upon its establishment, the celestial essence gave birth to the Divine Immortal Nine Preservations Primordial Jade Talisman, with thirty-six direct talisman officials.\n\nThe Celestial Emperor of the Pari-Da-He Heaven first gave birth to the Red Essence Supreme True Chaotic Primordial. Within the Pari-Da-He Heaven, by one kalpa, he gave birth to the Mo-Ke-Ru-Ming Heaven.\n\nThe Pari-Da-He Heaven gave birth to the Zhu-Luo-Huang-Jia Heaven, also named the Brahma-Conduct Heaven. Upon its establishment, the celestial essence gave birth to the Divine Immortal Flying Conduct Cavern-Primordial Jade Talisman, with thirty-six direct talisman officials.\n\nThe Celestial Lord and King of the Mo-Ke-Ru-Ming Heaven, styled the \"Jade Clarity High Supreme Primordial Sovereign,\" with the cognomen Kai-Zao, governed within the Mo-Ke-Ru-Ming Heaven by one kalpa, giving birth to the A-Po-Luo-Mo-Ru-He Heaven.\n\nThe Mo-Ke-Ru-Ming Heaven gave birth to the Xu-Ming-Tang-Yao Heaven, also named the Brahma Heaven. Upon its establishment, the celestial essence gave birth to the Divine Immortal Salvation-World Life-Connecting Jade Talisman, with thirty-six direct talisman officials.\n\nThe Celestial King of the A-Po-Luo-Mo-Ru-He Heaven, styled the \"Jade Clarity Purple Void High Supreme Primordial August,\" with the cognomen Ji, governed within the A-Po-Luo-Mo-Ru-He Heaven by one kalpa, giving birth to the A-Wei-Yi-Luo Heaven.\n\nThe A-Po-Luo-Mo-Ru-Qi Heaven gave birth to the Guan-Ming-Duan-Jing Heaven, also named the Great Radiance Heaven. Upon its establishment, the celestial essence gave birth to the Divine Immortal Salvation-World Flying Spirit Jade Talisman, with thirty-six direct talisman officials.\n\nThe Celestial King of the A-Wei-Yi-Luo Heaven, styled the \"Jade Clarity Upper August Jade Void Lord,\" with the cognomen Ming-Lan, governed within the A-Wei-Yi-Luo Heaven by one kalpa, giving birth to the Tai-Xuan-Na-Shou Heaven.\n\nThe A-Wei-Yi-Luo Heaven gave birth to the Xuan-Ming-Gong-Qing Heaven, also named the Water-Sound Mysterious Sand Heaven. Upon its establishment, the celestial essence gave birth to the Divine Immortal Salvation-World Flying Birth Jade Talisman, with thirty-six direct talisman officials.",
      "overlap_context": "on,\" with thirty-six direct talisman officials. Upon the Clear and Subtle Heaven, it was to examine the Most High Great Dao Sovereign. The Celestial Emperor of the Clear and Subtle Heaven established the Clear and Subtle Heaven, styled the \"Primordial Celestial King,\" with the cognomen Chaotic Spirit Supreme Essence, which was the cognomen of the Primordial Venerable. Within the Clear and Subtle Heaven, he governed the Upper Palace of Jade Clarity for one kalpa, giving birth to the Yu-Yu Heaven.",
      "start_char": 2776,
      "end_char": 4081,
      "start_sentence": 137,
      "end_sentence": 165,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.059366941452026,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\玉清上宫科太真文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "玉清上宫科太真文竟 #1『又』字疑当作『分』。 #2『天天』，疑当作『天立』。 #3『元』字疑当作『字』。 #4『直符』二字原缺，据上下文补。 #5『玉符』二字原缺，据上下文补。",
      "translated_text": "The Concluding Section of the Jade Clarity Upper Palace Regulations on the Great Perfection Scriptures\n\n[Note 1: The character \"又\" is suspected to be a miswriting of \"分\".]\n[Note 2: The phrase \"天天\" is suspected to be a miswriting of \"天立\".]\n[Note 3: The character \"元\" is suspected to be a miswriting of \"字\".]\n[Note 4: The two characters \"直符\" were originally missing and have been supplemented based on the context.]\n[Note 5: The two characters \"玉符\" were originally missing and have been supplemented based on the context.]",
      "overlap_context": "g of the A-Wei-Yi-Luo Heaven, styled the \"Jade Clarity Upper August Jade Void Lord,\" with the cognomen Ming-Lan, governed within the A-Wei-Yi-Luo Heaven by one kalpa, giving birth to the Tai-Xuan-Na-Shou Heaven.\n\nThe A-Wei-Yi-Luo Heaven gave birth to the Xuan-Ming-Gong-Qing Heaven, also named the Water-Sound Mysterious Sand Heaven. Upon its establishment, the celestial essence gave birth to the Divine Immortal Salvation-World Flying Birth Jade Talisman, with thirty-six direct talisman officials.",
      "start_char": 4082,
      "end_char": 4183,
      "start_sentence": 166,
      "end_sentence": 171,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 2.9186484813690186,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\玉清上宫科太真文.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}