{
  "source_id": "玉清内书",
  "source_file": "chunked_daozang\\玉清内书.json",
  "total_chunks": 8,
  "total_original_chars": 8299,
  "total_translated_chars": 47426,
  "total_translation_time": 222.8819122314453,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\众术类\\玉清内书.txt",
    "category": "众术类"
  },
  "full_translation": "**Jade Purity Inner Scripture**\n\n*Title:* *Jade Purity Inner Scripture*. The author is unknown, originating in the Tang dynasty. Its content is similar to works such as the *Tongyou Jue*, *Hongju Rubi Jue*, and *Huandan Zhoutu Jue*. The *Tongzhi: Yiwen Lue* records this text in two volumes, though only one remains extant. Source of the base text: *Zhengtong Daoist Canon*, *Dongshen* section, *Zhongshu* category.\n\n*(Previous section missing)*\n\nThe Perfected Lord’s Instructions state: The \"Yellow Sprout\" refers to the Five Phases and the *jiazi* cycle. *Jia* belongs to Wood, which is the father and mother of yang. The mother pertains to the qi of the north; after the winter solstice, the first yang arises in opposition, hence the saying \"the first yang arises.\" The sprout receives qi from its mother, thus named *jia*. *Jia* relies on Earth, and Earth emits *jia* to generate the sprout. The sprout depends on its mother, and the mother is *kun*, which is the Yellow Sprout of *gui*. In the position of the six *jia*, it is imprisoned, dies, rests, and declines, yet shares the same *jia*, perishing in *gui* at the position of extinction.\n\nThe Five Grains, Five Fruits, grasses, trees, flowers, and herbs—all things nurtured, whether born from wombs, eggs, medicines, or humans—arise from the Yellow Sprout. Yang qi moves in misty abundance; Earth is the womb, breath is qi. All things in spring and summer release and flourish as the Yellow Sprout, while in autumn and winter, they contract and mature. Each returns to its color, reverts to its original flavor, and does not alter its former appearance—this is the meaning of \"returning cinnabar,\" a return to the origin.\n\nIf a person alters their constant nature, they die; if a thing changes its color, it decays. Thus, when a thing undergoes the movement of fire, yang qi bears and transforms it without altering its former appearance, aligning with heaven and earth in creation. The returning cinnabar receives qi and reverts to the origin. Yang qi shines and congeals by the natural Dao, hence called the Yellow Sprout.\n\nOrdinary people do not know that the Three Luminaries of heaven and earth, the initial separation of purity and turbidity, and the myriad beings all grow from the Yellow Sprout, arising without transcending the Five Phases. The Yellow Sprout is the initial bending and stretching of the sprout. It forms through yang and is born through yin; when yin and yang unite at the moment of receiving qi, it is first chaos. After purity and turbidity separate, the Yellow Sprout emerges.\n\nIn *jia*, it is called \"yellow\"; in the crescent, it is called \"sprout\"; in extension, it is called \"shoot.\" Thus, it is named the Yellow Sprout, the primordial harmonious qi, inseparable from the Five Phases. The Five Phases are Water, Fire, Metal, Wood, and Earth. Water moistens and descends; Fire flames upward; Metal follows transformation; Wood bends and straightens; Earth bears crops.\n\nThe instructions say: The great Dao of heaven and earth endures forever; none among the long-lived surpass the sun, moon, and stars. The Five Phases of yin and yang, day and night, arise from Earth and ultimately return to Earth, changing with the four seasons—yet this, too, has its limit. Such is the natural Dao.\n\nFor example, pine resin receives the qi of the great yang; after a thousand years, it transforms into *fuling*; after another thousand years of illumination, it becomes a *fuling* spirit; after yet another thousand years, it becomes amber; and after another thousand years, it becomes crystal. All are the essence of the sun and moon’s radiant qi, refined into essence through illumination.\n\nAnother example: toads playing in the moonlight, clams and oysters bearing pearls—all gather and receive the radiant qi of the sun and moon, forming pearls in the womb. These are congealed by the yin essence of the moon. Both substances are suitable for consumption, particularly for treating lung qi, fright and evil, and forgetfulness. Form them into pills with honey and hemp seeds, the size of sesame, and swallow three with saliva after meals. Clams and oysters can also restrain mercury.\n\nWhen a person cultivates inner virtue and power, the primordial harmonious qi flows freely. Through cultivation aligned with the Dao, essence congeals into a pearl, naturally attaining longevity. The pearl resides within the Red Waters—Red Waters being blood.\n\nFor instance, birds, beasts, insects, and ants that hibernate and conceal themselves all receive the primordial harmonious qi, sustaining life not through the teachings of parents but by their own nature. Awaken, rejoice! Secure your will. Sounds harmonize, beings resonate, presence and absence interpenetrate, yin and yang embrace to fulfill the Dao. The two qi harmonize; presence and absence restrain and complete each other, thus perfecting the Dao.\n\nThe River Chariot is the master of the Five Metals and also the position of the north. Water can ferry the chariot, bearing and transporting all things in ceaseless revolution. This is yang residing in the yin position, yin containing yang essence, Metal and mercury uniting—hence called the River Chariot. It is the ancestor of primordial harmony, establishing heaven and earth, regulating yin and yang. The four seasons proceed, and the myriad things are born. Receiving qi is called destiny; the most numinous is humanity.\n\nNo blessing surpasses life; no misfortune surpasses death. Since one detests death and desires life, this is embodying the great Dao. Moreover, what I have annotated differs from other schools but aligns with the orthodox classics, its principles returning to the great Dao.\n\nIn discussing hexagrams, fire timing comes first; in explaining medicinal substances, yin and yang are fundamental. *Can* means \"to blend\"; Water, Earth, and Metal are three things united as one family, like tally and contract, their principles in accord—hence called *Cantong* (\"Triple Concordance\").\n\nThe instructions say: The myriad things do not arise without the sun and moon; Metal and Water do not form without Fire and Earth. Metal and Water are the origin of transformation; Fire and Earth are the Dao of yin and yang. When heaven and earth were in chaos, though silent and not yet transformed, they were ultimately the root of the myriad things. The white of Metal and the qi of Water meet within qi, resembling a chicken’s egg.\n\nThe yang burning-mirror takes fire; without the sun, it does not emit light. The Dog Rong use a fire-mirror to ignite mugwort, instantly producing flame—symbolizing the yin and yang of returning cinnabar. This occurs frequently within the Great Tang realm. Words cannot exhaust speech; speech cannot exhaust meaning.\n\nYet the intent of the sages—can it not be seen? Those who use common mercury to make elixirs are deluded. Those who claim cinnabar cannot preserve appearance without proper principles do not understand the Dao. They have strayed far from the truth.\n\nSome say: Using common lead to make mercury is the origin of the numinous.\n\nFor they do not comprehend the true essence of mercury and true lead, only praising the efficacy of common lead while neglecting the subtlety of mercury—insisting that both must be combined. How can they not consider both and extol them? If common lead is used as the medicine, one strays far from the Dao. If mercury is falsely taken for the golden elixir, it is not the true method. To grasp the correct method, one must understand that water-lead and fire-lead are the foundation. Only by obtaining the original qi of lead and encountering the Five Agents can the elixir form, without losing its root.\n\nIf one awakens to the primordial transformation and its singular application, the marvelous function reaches its utmost. If external things are taken as emotion, then nature cannot unite. If mercury is substituted for quicksilver, then lead cannot be embraced; emotion and nature cannot rely on each other, and how can the Three Palaces be stabilized? If lead cannot be embraced, how can the Eight Stones achieve their marvel? Gold retains its original weight; gold does not lose its heaviness. The sun and moon maintain their usual forms; mercury does not lose its measure. Thus, the sun and gold share the same original weight.\n\nMy life resides in lead, not in heaven. When the returning elixir is perfected, gold endures for myriad years. Lead and mercury are originally one body, not two. Therefore, it is said: \"Heavenly lead, do not destroy my lead, so that my life may be preserved. Do not break my chariot, that it may carry me home.\" Lead is that which naturally arises within cinnabar. The chariot is the liquid drawn forth from cinnabar.\n\nWhen gold is moved by fire, it is called the returning elixir. The essence of gold, the yellow sprout, restrains water so it does not overflow. The power of the essence of gold is the mysterious water. The essence of gold and the yellow sprout are of the same name—naturally arising lead. Water is the liquid drawn forth from cinnabar.\n\nTo use lead or not to use lead—without it, one cannot attain longevity. Those who use lead rely on the lead naturally contained within cinnabar. Those who do not use lead refer to the mother of common silver—common lead. If the lead is not true, its mercury is difficult to embrace. If the lead is true, it does not lose its household minister. If the lead is not true, it is common lead. If the lead is true, it is cinnabar-lead.\n\nBetter to refine the gold within lead—this is the gold that naturally arises within cinnabar. Do not refine the treasure within gold—this is mercury. The sages provide clear analogies to instruct later learners.\n\nWhat is the crucible? It is the cinnabar itself, used as the vessel. What is the medicine? It is the mercury that naturally flows from cinnabar.\n\nDistinguishing male and female, the Three-in-One, the discourse on black and white—these parallel the *Great Change* and the *Uniting Them*. Fire-lead is cinnabar, moved by the sun and moon, naturally producing mercury—this is fire-lead. Water-silver is another name for mercury, the yang qi of cinnabar not yet fully realized, drawn out as water-silver. Within cinnabar, when the essence of the husk is sufficient, it spontaneously generates and is called male. Male and female unite, yin and yang naturally harmonize, their bond transcending difference.\n\nThe golden elixir originates from one thing yet is not two things. When yang qi enters and moves, it is called the Way of the Three-in-One. White is the essence of gold; black is the foundation of water. They return to one yet are not two. The sages borrowed the hexagrams of the *Zhou Changes* as metaphors, moving them to form the elixir. Subduing and mastering all arise from the parents; movement does not transcend the Five Agents. Following yin and yang, one does not lose the proper time. If used in reverse, the hun and po perish, like the sun and moon eclipsing and losing their positions, failing to submit to each other.\n\nThe sages guarded their secrets, unable to speak plainly, often resorting to veiled language. From these cryptic instructions, many errors arise, leading to failure. The secrets of the golden crucible must be guarded with care. Foreign medicines and mixtures are certainly not the way.\n\nThe Dao of heaven is difficult to reveal. Some conceal it in profound images, others attach it to yin and yang, subtly explaining it among people, speaking of its wondrous principles—yet the multitude remains confused and lost. Since the time of Fuxi, those who sought the Dao and long life have been many, but those who encountered and attained it are few. They cling to their own conjectures without discernment.\n\nWithout seeking oral instructions from a master, relying only on ancient texts and analogies, one vainly toils in famous mountains, deep valleys, and secluded streams. Decayed and deluded scholars, from ancient times to the present, have never been seen to achieve immortality. Consuming the Five Grains, indulging the Six Desires, humans live in yang while ghosts dwell in yin. Yang shines while yin conceals, each obscuring the other. Unable to command ghosts and spirits or direct yin and yang, they fail to obtain the methods of transcending the world—all perish and sink into the mundane.\n\nIn cold, one dons padded robes for inner warmth; in heat, one wears light garments and drinks water. Born at the boundary of yin and yang, governed by the Five Agents, consuming things born of earth, one returns to earth at death—this is returning to the root. Without encountering the radiant qi of the sun and moon, circulating the essence and fluids, refining the Three-in-One returning elixir, how can one transcend the walking corpse and the teeming masses?\n\nLike a stone cast into a river, unable to return, sinking and transforming—how lamentable! But if one encounters the inner and outer golden elixirs, consumes them, and circulates them through the body, preserving an extraordinary appearance, one may transcend the boundary of yin and yang, escape the governance of the Five Agents, evade the ledgers of death, and command the service of ghosts and spirits.\n\nThe instructions say: The Dao has immortal transmissions, secret records, and elixir classics such as the *Dragon and Tiger*, the *Supreme Clarity*, the *Five Metals in Mutual Resemblance*, and the *Uniting Them in the Zhou Changes* in song and verse. The intent of the ancients—from the former sages to the later sages—all attained this Dao.\n\nYet people of the present age, deluded and foolish, fail to awaken. Those who practice cultivation and attain the Dao do not reveal their names when encountered; those who obtain it conceal it without exception. The oral instructions passed down from master to disciple, the secret methods and hidden records, the songs, verses, and hexagrams—all reveal only branches and leaves, never fully disclosing the direct path.\n\nFrom ancient times to the present, those who encounter it must receive oral instructions from a master; only then do they have a share in it—otherwise, it is not true learning. Those who transmit the *Prescriptions Behind the Elbow* keep it secret in their hearts. The Dao of heaven must not be carelessly revealed; to do so is to nourish a tiger that will bite you. If entrusted to an unworthy person, calamity befalls seven generations, and one is demoted to a lowly ghost.\n\nFew in the world possess this knowledge by fate; those who encounter and transmit it without destined affinity must seek its traces through investigation. Only those of unwavering inner conduct and destined affinity may earnestly pledge vows, invoke the hundred spirits, and face the sun, moon, and stars to receive the talismanic contract before transmission is permitted.\n\nThe practice must be unwavering, the supreme medicine singular and primordial; heaven and humanity unite with the Dao, their principles harmonizing with nature. It cannot be hastily seized or hunted down. Those who meet a master and awaken to the truth learn that the great medicine has but one gate, yet comprises three substances—water, earth, and metal—not the common water, earth, and metal of the mundane world. When obtained, it reunites the hun and po; with an unwavering heart, the Dao master naturally attains the golden elixir of inner and outer alchemy. Ingesting it confers immortality, equaling heaven and earth in longevity. The *Prescriptions Behind the Elbow* for Longevity are revealed here for later students who fail to comprehend.\n\n---\n\n**On constructing the crucible and infusing metal, and the direct talismanic use of hexagrams and clepsydra, no further details are recorded here.**\n\n**Oral instructions for transmuting the Five Metals and refining mercury:**\nThe Golden Elixir, when guarded and circulated for fifteen days, kills the nature of metal; one *liang* of medicine transmutes one *jin* of mercury into white Dao.\nWhen guarded for thirty days, it may be ingested in doses of two *liang*.\nWhen guarded for forty-five days, or ninety days, or a full four seasons, half a *liang* transmutes one *jin* of mercury into white Dao, and may be ingested in doses of one and a half *liang*.\nWhen guarded for two years, one *fen* transmutes one *jin* of mercury into white Dao, and may be ingested in doses of three *fen*.\nWhen guarded for three years, the primordial qi is fully realized; a *daogui* measure transmutes one *jin* of mercury into white Dao, and may be ingested in doses of one *fen*.\nWhen guarded for five years, a *daogui* measure transmutes one *jin* each of iron, mercury, the Five Metals, and various minerals into their respective treasures. Ingesting one *zhū* confers eternal life and abiding in the world. Not only humans, but chickens, dogs, birds, and livestock may ingest it without dying.\n\nTwenty-four *zhū* make one *liang*; one *daogui* equals one *fen*.\n\n**Oral instructions:**\nAccording to the duration of guarding and circulating—days, months, or years—the quantity of medicine varies. Transmute mercury into gold and silver by weight, then further refine copper and arsenolite into \"great silver.\"\nFor each *jin* of mercury, use two *liang* of medicinal silver.\nWhen mercury is guarded for one year, use three *liang* to transmute one *jin* of mercury into white Dao.\nWhen guarded for two years, use two *liang* to transmute one *jin*.\nWhen guarded for three years, use one *liang* to transmute one *jin* into white Dao.\nFurther guard and circulate for one, two, or three years, adjusting the weight of medicine to transmute mercury into white Dao as above.\nContinue guarding and circulating, using the head of the medicine to refine its kind, perpetuating the lineage without end.\nThis is the primordial transformation of the Golden Elixir, its wondrous application as mother and child reaching the ultimate.\n\nTo attain spiritual penetration and transformation, one must use native soil for the crucible, adhere to the fire phases, and follow the cycles of concealment and renewal. Thus may it become a worldly treasure and immortal emolument.\n\n**Oral instructions:**\nTake native celestial lead and common mercury in equal weights, combining them to make one *jin*.\nPlace them in the sealed vessel, using native soil for the outer crucible, and seal it properly. Construct a furnace, encircle it with ash, and bury the crucible within, leaving five *cun* of ash above. Apply fire to the upper portion.\nBegin with five *liang*; after one *fu* period, increase to half a *jin*; after another *fu*, increase to thirteen *liang*; after another *fu*, increase to one *jin*.\nMaintain this weight day and night for thirty days, then take two *liang* of medicine to transmute one *jin* of mercury into white Dao.\nUse two *liang* of this silver to further transmute one *jin* of copper into \"great silver.\"\n\n**Oral instructions:**\nReturn the mercury to the sealed vessel for guarding and circulating.\nFollow the protective instructions for fire weight and duration, then transmute mercury again. Mother and child follow in succession, perpetually without end.\n\n**Oral instructions:**\nWhen transmuting iron, the Five Metals, and various minerals, all may be refined into treasures.\nWhy? Because this is using the head to refine the head—it is not the medicine that originally received primordial qi.\nMoreover, lacking the original father and mother, its spiritual efficacy differs, only transforming lower arts into white Dao.\nIngestion is not subject to dosage limits, for it contains toxicity.\n\n**Method for constructing the outer crucible to refine mercury:**\n**Oral instructions:**\nFor urgent use of the medicine, take native soil and mold it into an inner crucible and outer crucible, sealing them properly.\nMaintain the same depth as before, place the golden crucible within, and seal it. Bury it in ash, leaving the top exposed for fire.\nBegin with five *liang*; after one *fu* period, increase to seven *liang*; after another *fu*, increase to twelve *liang*; after another *fu*, increase to one *jin*, then maintain for eight *fu* periods.\nApply martial fire to all four sides of the crucible until it glows red, then open it after half a day. One *liang* of medicine transmutes one *jin* of mercury.\nReplace the crucible and apply one *jin* of fire day and night for one year; then half a *liang* transmutes one *jin* of mercury into white Dao.\n**Oral instructions:**\nReplace the crucible again, apply one *jin* of fire, and guard for two years; one and a half *fen* transmute one *jin* of mercury into white Dao.\nReplace the crucible and guard for three years; one *fen* transmutes one *jin*.\nThe crucible should be replaced yearly; the transmutation follows the same method as above, adjusting the medicine’s weight according to the duration to refine all into treasures.\nHowever, ingestion is not recommended, for it lacks primordial qi, being merely a talismanic or clepsydra-based guarding and circulating.\n\n**Oral instructions for refining mercury with medicine:**\nWhen refining mercury, take mercury and medicine, grind them together, and place them in a pot.\nCover with a small amount of medicine, then seal the top with a lid, wrapping the sides with damp paper. Place it in fine ash.\nApply about half a *jin* of fire from a distance for the duration of cooking one meal, then gradually increase the fire. After half a day, burn until red-hot.\nShortly, it will harden into a mass; cease the fire, then pound it to begin melting it into a substance, thus forming a treasure.\n\n**Oral instructions:**\nWhen the Great Elixir has been guarded for three years and its qi is full, take it and form pills with wood honey the size of hemp seeds. Ingest according to the prescribed weight each year.\n\nTake the freshly prepared elixir medicine, kneel and sit facing the sun, and recite: \"Heavenly Perfected Ones, partake of this.\" Fasten one *liang* of the elixir to your left arm; thereafter, when you go out or come in, present memorials and petitions, ascend altars, and pay homage—all people will revere and look up to you. Should any harbor unintended ill intentions toward you, they will disperse of their own accord. When entering mountains or open wilderness, whether by day or night, you will encounter no harm from ferocious beasts, ghosts, demons, or evil men, for they will all prostrate themselves and hide, daring not to cause injury. Fasten it where battles rage, and five hundred attendants will encircle and protect you, shielding you from arrows, blades, or any weapon’s harm. Wherever you travel, the local spirits and deities will serve as your guards. If you possess elixir texts, talismans, or scriptures, and perform the method of liberation through the simulated corpse, you may summon the Celestial Immortals of the Five Peaks, dragon spirits, and the myriad numina, who will instantly arrive to be commanded at will. Should the people of the world suffer from illness, inscribe characters with the elixir and swallow them—they will be cured immediately.\n\n**Inscription on the Golden Crucible:**\nThe Golden Crucible of the Earth Deity,\nSeven *cun* in length for life and death.\nThe divine chamber, three *cun* bright,\nFive *cun* round, two *cun* deep.\nRevolving in primordial chaos,\nLike the four stars of heaven and earth.\nYin and yang at two ends,\nResembling a hen’s egg in form.\nLet its shape and appearance be without flaw,\nWith yellow and white within.\nThickness and thinness must be even,\nSealed firmly with the Six-and-One.\nGuard well the Gate of Noon,\nAnd the *Triple Concordance* will naturally align.\n\n**Method for Crafting the Crucible and Infusing the Gold:**\n\nThe method states: For crafting the crucible and infusing the gold, take the earth beneath naturally occurring cinnabar—whether it resembles yellow wax in texture or appears dark greenish-black—and gather one or two *he* of it. Grind and sift it; if it contains grains of stone or cinnabar, varying in size like sesame seeds, or if it is yellowish-black but yields cinnabar when crushed, this earth is of great potency. After sifting, knead it into clay, ensuring it is well-worked for optimal use. Then fashion the crucible in the shape of a hen’s egg: seven *cun* in length, five *cun* in circumference. While still moist, cut it into two halves to form the upper and lower sections. Dry them in the sun. The central chamber should be three *cun* wide, tapering gradually to a depth of two *cun* at the base. Both the inner chamber and the outer shell should resemble the shape of a hen’s egg. The rims of the two halves should be crafted as male and female joints, perfectly aligned without irregularity.\n\nPlace the golden water within the vessel, dividing it evenly by proportion rather than by fixed weight. Seal it according to the method, then set it in a clay furnace as needed. Use a straight talisman, positioned one *cun* above the base of the crucible. Cover and activate it. Always bury it firmly beneath a layer of grass ash. The talisman’s operation follows the six seasonal markers.\n\n**Method for Advancing and Retreating the Fire According to the Six Seasonal Markers:**\n- **First day of the first month, initial marker:** Ignite one *liang* of fire for thirty hours.\n- **By the second day and a half:** Increase to two *liang* for sixty hours.\n- **Sixth day, second marker:** Begin with three *liang* for thirty hours, increasing to four *liang* for sixty hours.\n- **Eleventh day, third marker:** Begin with five *liang* for thirty hours, increasing to six *liang* for sixty hours.\n- **Sixteenth day, fourth marker:** Begin again with six *liang* for thirty hours, retreating to five *liang* for sixty hours.\n- **Twenty-first day, fifth marker:** Retreat to four *liang* for thirty hours, then to three *liang* for sixty hours.\n- **Twenty-sixth day, sixth marker:** Retreat to two *liang* for thirty hours, then to one *liang* for sixty hours.\n\nThis six-marker talisman, with its advancing and retreating *yao* symbols, follows the monthly cycle, repeating endlessly.\n\n- **Second month, initial marker:** Begin with two *liang* for thirty hours, increasing to three *liang*.\n- For each subsequent month, when replacing the crucible at the month’s start, begin with one *liang* and proceed accordingly.\n- By the ninth month’s initial marker, use nine *liang*.\n- From one to nine, the Metal Tiger exhales its essence: thirty hours at nine *liang*, increasing to ten *liang* for sixty hours.\n- The talisman’s advance and retreat must align with the method, clearly following the water clock’s divisions.\n\nWhen the fire is at its peak—symbolizing the fourth month, the height of yang—its advance and retreat must be precise, for yin and yang contend in their measures. When replacing the crucible, it is the Earth’s reign in the Metal’s domain, where the three substances all perish, for the Metal and Earth’s fundamental *qi* resonate with one another.\n\nWhen the talisman retreats—symbolizing the fifth month, when yin *qi* begins to act—one yin arises at the ninth position, and the \"exalted dragon meets with regret.\" The talisman’s movement continues until the ninth crucible.\n\n- **After the ninth month, initial marker:** Use nine *liang* for thirty hours, increasing by one *liang* for sixty hours.\n- By the end of the third marker, use fourteen *liang*—the peak of yang.\n- At the fifth marker, yin arises, retreating to twelve *liang* for thirty hours, then to eleven *liang*.\n- By the sixth marker, retreat to ten *liang* for thirty hours, then to nine *liang* for sixty hours.\n\nAfter the tenth month, regardless of the year or month, always follow the ninth month’s initial marker: begin with nine *liang* for thirty hours, increasing by one *liang* for sixty hours. By the third marker, use fourteen *liang*, then retreat to nine *liang* by the sixth marker for sixty hours. Proceed in sequence with the talisman’s advance and retreat, clearly following the water clock’s divisions. Repeat day and night, completing the method after nine cycles.\n\n**Method:**\nFrom the first month’s initial marker, ignite twenty-four *zhu* of fire to generate one *yao*, symbolizing the twenty-four solar terms. Maintain this until the second day and a half, then add one *yao*, completing one marker by the fifth day. Continue increasing the fire by *yao* each month, with six markers per month. Always note that the period from the end of the third marker’s sixty hours to the beginning of the fourth marker’s thirty hours is the phase for martial fire. The fire’s weight in *liang* advances and retreats day and night, requiring the addition of well-charred coals. Keep the fire’s surface exposed to gauge the correct weight. After completing the nine-and-a-half-month cycle of the talisman, always follow the ninth month’s fire-marker *yao* method for advancing and retreating *liang*, regardless of the year or month.\n\n**Further Method:**\nThe fire markers are the most difficult. Traveling through famous mountains to seek the highest teachings, one may find shared discussions and insights. Yet only Earth and Fire remain untransmitted in the world. This, recorded at my side, is the true method’s source.\n\n**Diagram of the Talisman’s Advance and Retreat According to the Water Clock:**\nThe method states: When the talisman advances or retreats, one must precisely follow the water clock’s divisions, using it according to the method. The water clock’s advance and retreat are fixed by time, with a direct path for measuring expansion and contraction. Simply observe the length of day and night, dividing the twelve double-hours: *zi, chou, yin, mao, chen, si, wu, wei, shen, you, xu, hai*.\n\n- From the initial *zi* hour, observe the water’s flow until the *chou* hour to determine the required volume.\n- Craft a barrel three *chi* tall, one *chi* in inner diameter. Near the base’s edge, drill a small hole and tightly insert a tube made of black feather quills, sealing the gaps with wax. Fill it with water and let it drip freely. When empty, refill it and continue dripping. Observe how many barrels correspond to one double-hour, thereby determining the water volume for each hour.\n- Divide the day and night into twelve double-hours, estimating the barrel count for each. This method differs from the standard water clock’s weight measurement. If the water flow varies, adjust for the length of day and night. With careful attention, it will be infallible.\n\n**Regulating Fire with the Direct Correspondence Fire Record and the Correct Calendar**\n\n**Fire Regimen for the First Month (Six Six-Hour Periods Equaling Five Days)**\n- **First Initial Phase:** One *yao* for thirty hours, increasing to two *yao* for sixty hours.\n- **Second Initial Phase:** Three *yao* for thirty hours, increasing to four *yao* for sixty hours.\n- **Third Initial Phase:** Five *yao* for thirty hours, increasing to six *yao* for sixty hours.\n- **Fourth Initial Phase:** Still using six *yao* for thirty hours, then reducing to five *yao* for sixty hours.\n- **Fifth Initial Phase:** Reducing to four *yao* for thirty hours, then further to two *yao* for sixty hours.\n- **Sixth Initial Phase:** Reducing to two *yao* for thirty hours, then further to one *yao* for sixty hours.\n\n**Fire Regimen for the Second Month**\n- **First Initial Phase:** Two *yao* for thirty hours, increasing to three *yao* for sixty hours.\n- **Second Initial Phase:** Four *yao* for thirty hours, increasing to five *yao* for sixty hours.\n- **Third Initial Phase:** Six *yao* for thirty hours, increasing to seven *yao* for sixty hours.\n- **Fourth Initial Phase:** Still using seven *yao* for thirty hours, then reducing to six *yao* for sixty hours.\n- **Fifth Initial Phase:** Reducing to five *yao* for thirty hours, then further to four *yao* for sixty hours.\n- **Sixth Initial Phase:** Reducing to three *yao* for thirty hours, then further to two *yao* for sixty hours.\n\n**Fire Regimen for the Third Month**\n- **First Initial Phase:** Three *yao* for thirty hours, increasing to four *yao* for sixty hours.\n- **Second Initial Phase:** Five *yao* for thirty hours, increasing to six *yao* for sixty hours.\n- **Third Initial Phase:** Seven *yao* for thirty hours, increasing to eight *yao* for sixty hours.\n- **Fourth Initial Phase:** Still using eight *yao* for thirty hours, then reducing to seven *yao* for sixty hours.\n- **Fifth Initial Phase:** Reducing to six *yao* for thirty hours, then further to five *yao* for sixty hours.\n- **Sixth Initial Phase:** Reducing to four *yao* for thirty hours, then further to three *yao* for sixty hours.\n\n**Fire Regimen for the Fourth Month**\n- **First Initial Phase:** Four *yao* for thirty hours, increasing to five *yao* for sixty hours.\n- **Second Initial Phase:** Six *yao* for thirty hours, increasing to seven *yao* for sixty hours.\n- **Third Initial Phase:** Eight *yao* for thirty hours, increasing to nine *yao* for sixty hours.\n- **Fourth Initial Phase:** Still using nine *yao* for thirty hours, then reducing to eight *yao* for sixty hours.\n- **Fifth Initial Phase:** Reducing to seven *yao* for thirty hours, then further to six *yao* for sixty hours.\n- **Sixth Initial Phase:** Reducing to five *yao* for thirty hours, then further to four *yao* for sixty hours.\n\n**Fire Regimen for the Fifth Month**\n- **First Initial Phase:** Five *yao* for thirty hours, increasing to six *yao* for sixty hours.\n- **Second Initial Phase:** Seven *yao* for thirty hours, increasing to eight *yao* for sixty hours.\n- **Third Initial Phase:** Nine *yao* for thirty hours, increasing to ten *yao* for sixty hours.\n- **Fourth Initial Phase:** Still using ten *yao* for thirty hours, then reducing to nine *yao* for sixty hours.\n- **Fifth Initial Phase:** Reducing to eight *yao* for thirty hours, then further to seven *yao* for sixty hours.\n- **Sixth Initial Phase:** Reducing to six *yao* for thirty hours, then further to five *yao* for sixty hours.\n\n**Fire Regimen for the Sixth Month**\n- **First Initial Phase:** Six *yao* for thirty hours, increasing to seven *yao* for sixty hours.\n- **Second Initial Phase:** Eight *yao* for thirty hours, increasing to nine *yao* for sixty hours.\n- **Third Initial Phase:** Ten *yao* for thirty hours, increasing to eleven *yao* for sixty hours.\n- **Fourth Initial Phase:** Still using eleven *yao* for thirty hours, then reducing to ten *yao* for sixty hours.\n- **Fifth Initial Phase:** Reducing to nine *yao* for thirty hours, then further to eight *yao* for sixty hours.\n- **Sixth Initial Phase:** Reducing to seven *yao* for thirty hours, then further to six *yao* for sixty hours.\n\n**Fire Regimen for the Seventh Month**\n- **First Initial Phase:** Seven *yao* for thirty hours, increasing to eight *yao* for sixty hours.\n- **Second Initial Phase:** Nine *yao* for thirty hours, increasing to ten *yao* for sixty hours.\n- **Third Initial Phase:** Eleven *yao* for thirty hours, increasing to twelve *yao* for sixty hours.\n- **Fourth Initial Phase:** Still using twelve *yao* for thirty hours, then reducing to eleven *yao* for sixty hours.\n- **Fifth Initial Phase:** Reducing to ten *yao* for thirty hours, then further to nine *yao* for sixty hours.\n- **Sixth Initial Phase:** Reducing to eight *yao* for thirty hours, then further to seven *yao* for sixty hours.\n\n**Fire Regimen for the Eighth Month**\n- **First Initial Phase:** Eight *yao* for thirty hours, increasing to nine *yao* for sixty hours.\n- **Second Initial Phase:** Ten *yao* for thirty hours, increasing to eleven *yao* for sixty hours.\n- **Third Initial Phase:** Twelve *yao* for thirty hours, increasing to thirteen *yao* for sixty hours.\n- **Fourth Initial Phase:** Still using thirteen *yao* for thirty hours, then reducing to twelve *yao* for sixty hours.\n- **Fifth Initial Phase:** Reducing to eleven *yao* for thirty hours, then further to ten *yao* for sixty hours.\n- **Sixth Initial Phase:** Reducing to nine *yao* for thirty hours, then further to eight *yao* for sixty hours.\n\n**Fire Regimen for the Ninth Month**\n- **First Initial Phase:** Nine *yao* for thirty hours, increasing to ten *yao* for sixty hours.\n- **Second Initial Phase:** Eleven *yao* for thirty hours, increasing to twelve *yao* for sixty hours.\n- **Third Initial Phase:** Thirteen *yao* for thirty hours, increasing to fourteen *yao* for sixty hours.\n- **Fourth Initial Phase:** Still using fourteen *yao* for thirty hours, then reducing to thirteen *yao* for sixty hours.\n- **Fifth Initial Phase:** Reducing to twelve *yao* for thirty hours, then further to eleven *yao* for sixty hours.\n- **Sixth Initial Phase:** Reducing to ten *yao* for thirty hours, then further to nine *yao* for sixty hours.\n\n**Secret Method of the Hidden Workings from the Hand Mirror of the Primordial Sovereign**\nThe method states: The two *qi* of Heaven and Earth interact, the sun and moon alternately illuminate, forming the natural cyclical elixir.\n\n**Celestial Immortals of the Upper Realm** guard and gather the harvest. This is not something mundane scholars may encounter—only immortals then take it as their own. The Three Sovereigns revered the supreme Dao to cultivate life, employing the *Straight Talisman* to move the *qi* for three years, mirroring the natural circulation of *qi*. The fire phases follow the seasonal nodes, aligning with Qian, Kun, Kan, and Li. The movement of fire phases and their weights must be received through the true scripture and oral transmission from a master. What is spoken is not recorded; without receiving instruction from a master, the ingredients will be disordered and mixed, and one will never grasp the principle.\n\nThe sages observed the gate of celestial talismans and guarded the One. By obtaining the mutual restraint of the original father and mother, the Great Elixir is surely achieved. Thus, the Dao of yin-yang transformation grants spiritual freedom and self-mastery, returning to its original color.\n\nThe method states: The *Straight Talisman* serves as an analogy. For example, take ten: in the first month, *Jianzi*, yang *qi* begins to arise, modeled after the summer solstice. On the day before the solstice, at the hour of the cock’s crow, the first yin is born, and yin *qi* takes charge. This is the advance and retreat of Heaven and Earth’s yin and yang, governing the twelve months of the year’s generation and completion. Thus, the moon has six *zhi-fu* phases, with generation, completion, concealment, and the waxing and waning of the Five Agents. Their interactions and temporal forms are all contained within the *nei-shen*.\n\nTherefore, it is said: In the fifteen days before the fire and wood phases, the white moon’s three phases see extreme yang in charge. After this, yang retreats and yin arises—this is the nine-six yin water. In the fifteen days after, the black moon’s three phases see extreme yin in charge. The cycle repeats endlessly. Thus, the seven, eight, nine, and six paths naturally align, and the thirty-day cycle concludes with metal and water.\n\nThis analogy establishes the moon’s phases for day and night, using fire to conceal and activate, mirroring the yin-yang seasonal nodes of a year. The *zhi-fu* governs day and night—this is the pivot of Heaven and Earth held in the hand, called the \"method of world-transcendence.\" Spiritual transformations are profound beyond profundity.\n\nWhen the fire is first applied, it corresponds to the eleventh month, when yang begins its charge. The method states: In the first crucible’s first initial phase, the first *yao* of fire arises. The *zhi-fu* symbolizes the eleventh month, *Jianzi*, when yang *qi* takes charge. *Chujiu*: \"The hidden dragon does not act.\" The first *yao* governs day and night for two and a half days—thirty hours. Increasing to two *yao*, it reaches five days—one phase of sixty hours—completing eleven days, one celestial stem. *Zi, Chou, Yin, Mao, Chen, Si, Wu, Wei, Shen, You, Xu, Hai*: five cycles of sixty hours each constitute one phase. In the first phase of five days, *Jingzhen* (thunder) arrives to receive the talisman. By the eighth day, the upper quarter, the metal nature wavers between low and high, half-dead. Guarding until the fifteenth day completes one *qi*, and the metal nature is wholly extinguished. On the twentieth day, what sprouts does not grow; yang extends while yin recedes. Water does not move, and hardness and softness interact—this is the natural elixir.\n\nOn the twenty-first day, *Xun* (wind) arrives to receive the talisman. The natures of metal and water have already perished and exhausted. The two essences breathe and swallow in unison, dying together. The two woods, *Zhen* and *Xun*, gradually harmonize. Though mercury obtains Qian, it is not yet the Great Elixir. On the thirtieth day, the Dao is exhausted and returns to Kun’s origin. Receiving the talisman, the elixir forms, and the three substances vanish together into earth. Forty-five days constitute one node, and the nodes mutually resonate and circulate. At sixty days, *Mao* aligns with *Jiazhong*. When *Jia* reaches the *Mao* gate, the elm pods fall, returning to their root.\n\nIn the second month, the elm dies, and *Kui* and *Gang* contend with *Mao*. Punishment and virtue oppose each other, and day and night begin to divide. Thus, it is called the \"elm-pod elixir.\" The method states: The sun has three illuminations, and the moon has three shifts. The union of sun and moon’s *qi* causes all things to undergo three transformations and reach their extreme, following the natural Dao of the four seasons.\n\nThe moon has 360 hours, each hour corresponding to one year’s twelve months, totaling 4,320 hours. One hour represents one year, amounting to 4,320 years—mirroring the natural cyclical elixir, where yin and yang unite and the alternation of cold and heat forms images.\n\nThe method states: Concealment and activation, yang extending and yin receding—all else follows the seasonal nodes and hexagram images of the *zhi-fu* and *qi* phases. The method is that of the Nine Crucibles. Nine crucibles span nine months. The method states: Each of the Nine Crucibles requires three divisions. Each crucible is guarded for thirty days, receiving *qi* for a full 270 days. When yin and yang are both abundant, in the tenth month, earth reigns and gives birth. Thus, it is called \"mother and child shedding the womb\"—a truth unknown to the world.\n\nWater and fire overcome each other, mutually restraining and submitting, becoming father and mother anew. They do not exceed the Five Agents, concealing and forming shape. Guarding and circulating for 1,000 days, the great primordial *qi* is fulfilled. The nature returns to the north, to *Gui* water, black in color. Only then is it named the Great Cyclical Elixir.\n\nThe method states: Take the primordial *qi* of metal and water, balancing their weights to harmonize their fundamental bodies. Establish the analogy of the upper and lower quarters, with the number two-eight (sixteen) corresponding to yin and yang’s two metals. Originating from one thing, they generate the two images of *qi* phases—yellow and white, male and female—naturally dependent in nature. Yin and yang unite into one primordial two: two is fire, one is water. Excluding water and fire as medicines, there is no separate division. If there are heterogenous elements, the elixir will never form. Success does not lie in the weight or number.\n\nThe method states: Simply place metal and water into the crucible, sealing it properly according to the method. Apply the four destructive punishments and restraints. On a yang day at a yang hour, ignite the fire. Set the water clock clearly, knowing the additions and reductions without losing the metal and water within the crucible. Before separation, in primordial chaos, the *zhi-fu* moves them. Yin and yang intermingle, swallowing and transforming. The primordial *qi* clarifies and muddies, ascending and descending in mysterious yellow. Metal and water take form, resembling a chicken’s egg. The primordial *qi* is within the shell, receiving yang *qi*, containing its truth and embracing the One.\n\nThe method states: Cinnabar and golden sand, golden liquid inverted to grow sand, yellow sprouts and celestial lead, sand-mercury and lead-mercury, true yin and true yang, metal, earth, water, and fire, Qian, Kun, Kan, and Li—transforming and giving birth to the dragon and tiger, the black tiger, the Western Numinous Golden Elixir, the Jade Liquid of Nine Cycles, the Great Return—all are alternate names for the cyclical elixir. These are the hidden secrets of the ancients, not to be grasped by the unenlightened.\n\nShould one encounter the *Zhouhou Jue* or the *Cantong Qi*, their principles converge in the One and the Two—hence the name \"Returning Elixir.\" The Returning Elixir has its reversals, and one must shun the \"blood of the overturned basin.\" The \"blood of the overturned basin\" refers to inauspicious persons. Take care not to share the same mind with them, lest the celestial Dao be divulged.\n\nWhen conjoining metal and placing it into the crucible, the *zhifu* governs the process. The site of elixir refinement must be guarded with vigilance, kept pure and undefiled—far from places of birth and death, wailing and weeping, desecrated temples, or unholy grounds. One must select an auspicious location, blessed with propitious terrain, to establish the altar. There, burn incense, devote oneself in reverence, and offer sacrifices to the local earth spirits, water and land deities, and all such numina. Only then may the crucible be installed, so that the hundred spirits may lend their aid, the celestial Dao harmonize, and the various immortals come to safeguard the work. Yet the heart must remain unwavering in its singular intent.\n\nIf practicing in an ordinary place, one must still be cautious of defilement and avoid carelessness in the arrangement of the furnace or the designation of the medicinal ingredients. Diagrams of their positions and the rites of offering are recorded in separate instructions.\n\n**Fire Vessel *Zhifu* Fixed-Node Timing Formula**\nSuppose the first cycle begins on the seventeenth day of the fifth month at the *zi* hour, continuing until the *si* hour of the twentieth day. **First Five.**\nFrom the *wu* hour of the twentieth day to the *hai* hour of the twenty-second day. **Second Five.**\nFrom the *zi* hour of the twenty-second day to the *si* hour of the twenty-fifth day. **Third Five.**\nFrom the *wu* hour of the twenty-fifth day to the *hai* hour of the twenty-seventh day. **Fourth Five.**\nFrom the *zi* hour of the twenty-seventh day to the *si* hour of the thirtieth day. **Fifth Five.**\nFrom the *wu* hour of the thirtieth day to the *hai* hour of the second day of the sixth month. **Sixth Five.**\nFrom the *zi* hour of the second day of the sixth month to the *si* hour of the fifth day. **Retreat Sixth Five.**\nFrom the *wu* hour of the fifth day to the *hai* hour of the seventh day. **Retreat Fifth Five.**\nFrom the *zi* hour of the seventh day to the *si* hour of the tenth day. **Retreat Fourth Five.**\nFrom the *wu* hour of the tenth day to the *hai* hour of the twelfth day. **Retreat Third Five.**\nFrom the *zi* hour of the twelfth day to the *si* hour of the fifteenth day. **Retreat Second Five.**\nFrom the *wu* hour of the fifteenth day to the *hai* hour of the seventeenth day. **Retreat First Five.**\n\nHere ends the *Yuqing Neishu*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "玉清内书 经名：玉清内书。 撰人不详，出於唐代。 内容与《通幽诀》、《红锯入黑锯诀》、《还丹肘徒诀》等书类同。 《通志·艺文略》着录此书二卷，今残存一卷。 底本出处：《正统道藏》洞神部众术类。 玉清内书 （前阙） 元君诀曰：黄芽者，五行甲子是也。 甲属木，木是阳之父母。 母属北方之气，冬至后一阳生冲，其曰一阳生，萌芽受气於母，故名甲。 甲依於土，吐甲以生芽。 芽依於母，母曰坤，即是癸之黄芽，六甲之位，囚死休废，同其一甲，在癸而绝位。 立五谷五果草木花卉，长养万类，胎卵药物人民，皆从黄芽所生，阳气氤氲运动，地为胎，息为气，万物以春夏发泄为黄芽，秋冬收敛同成熟。 各归其色，反本味，不改旧容尽，名曰还丹之义，反本也。 夫人改常即死，物改色即坏。 乃知一物经火运动，阳气般载，不改旧容，与天地同造化，还丹受气反本也。 阳气照耀，凝结自然之道，故曰黄芽。 世人莫知天地三光，清浊初分，人民万物，皆从黄芽所长，不越五行而生。 黄芽者，萌芽伸屈始初也。 因阳而结，因阴而生，阴阳交接，当受气之时，初为混沌，清浊分后，始有黄芽。 在甲曰黄，在句曰萌，在伸曰芽，名曰黄芽，乃元和之气，不离五行。 五行，水火金木土。 水润下，火炎上，金从革，木曲直，土稼穑。 诀曰：天地大道，万物久长，元和之气，长生者莫过於日月星辰。 阴阳五行，昼夜依土而生，终归於土，随四时更变，然有限期。 亦是自然之道。 假今松脂含受太阳气，一千年化狭苓，照耀复一千年为狭神，更一千年为琥珀，更一千年为水晶，皆是日月之华气，照耀成精。 假令蟾蜍弄月，蚌蛤有珠，并是采弄含受太阳月华之气，成胎为珠。 是月之阴魄所结，二味并堪服食，偏治肺气、惊邪、健忘。 以木蜜为丸，麻子大，食后津液下三丸。 蚌蛤亦能制汞。 夫人内修道德，元和之气冲融，修养合道，结精为珠，自然长生。 珠居於赤水之中，赤水者血也。 假令禽兽蝼蚁，解蛰伏藏者，皆得元和之气，所托存生，非关父母教令而得之。 悟怡悟怡，自固其志，音声相和，物类相感，有无相贯，阴阳相抱而全其道，二气和合，有无相制，无有相成，成其道也。 河车者，五金之主，亦是北方之位。 水能渡车，般载万物，输环不住，是阳居阴位，阴含阳精，金汞相得，故曰河车。 是元和之祖，立天地，调阴阳，四时行焉，万物生焉，受气曰命，最灵曰人。 福莫大於生，祸莫大於死。 既恶其死，复欲其生，是体大道也。 且余所注，类异诸家，义合正经，理归大道。 论卦象则火候为先，释药物则阴阳为正。 参者杂也，水土金三物同为一家，如符若契，契其一理，故曰参同。 诀曰：万物非日月不生，金水非火土不成。 金水即变化之元，火土乃阴阳之道。 天地混沌之时，天地默默，虽未变化之初，终为万物之根。 金白水炁，相会气中，状如鸡子。 阳燧以取火，非日不生光，犬戎以火镜乘艾化之，须臾即生，象还丹阴阳。 今大唐国内时时有之，书不尽言，言不尽意。 然则圣人之意，其不可见乎。 若用凡水银为丹者，妄人也。 言朱砂未得理能驻貌者，不知道也。 即去真日远矣。 或曰：用凡铅为水银者，而为之元灵。",
      "translated_text": "**Jade Purity Inner Scripture**\n\n*Title:* *Jade Purity Inner Scripture*. The author is unknown, originating in the Tang dynasty. Its content is similar to works such as the *Tongyou Jue*, *Hongju Rubi Jue*, and *Huandan Zhoutu Jue*. The *Tongzhi: Yiwen Lue* records this text in two volumes, though only one remains extant. Source of the base text: *Zhengtong Daoist Canon*, *Dongshen* section, *Zhongshu* category.\n\n*(Previous section missing)*\n\nThe Perfected Lord’s Instructions state: The \"Yellow Sprout\" refers to the Five Phases and the *jiazi* cycle. *Jia* belongs to Wood, which is the father and mother of yang. The mother pertains to the qi of the north; after the winter solstice, the first yang arises in opposition, hence the saying \"the first yang arises.\" The sprout receives qi from its mother, thus named *jia*. *Jia* relies on Earth, and Earth emits *jia* to generate the sprout. The sprout depends on its mother, and the mother is *kun*, which is the Yellow Sprout of *gui*. In the position of the six *jia*, it is imprisoned, dies, rests, and declines, yet shares the same *jia*, perishing in *gui* at the position of extinction.\n\nThe Five Grains, Five Fruits, grasses, trees, flowers, and herbs—all things nurtured, whether born from wombs, eggs, medicines, or humans—arise from the Yellow Sprout. Yang qi moves in misty abundance; Earth is the womb, breath is qi. All things in spring and summer release and flourish as the Yellow Sprout, while in autumn and winter, they contract and mature. Each returns to its color, reverts to its original flavor, and does not alter its former appearance—this is the meaning of \"returning cinnabar,\" a return to the origin.\n\nIf a person alters their constant nature, they die; if a thing changes its color, it decays. Thus, when a thing undergoes the movement of fire, yang qi bears and transforms it without altering its former appearance, aligning with heaven and earth in creation. The returning cinnabar receives qi and reverts to the origin. Yang qi shines and congeals by the natural Dao, hence called the Yellow Sprout.\n\nOrdinary people do not know that the Three Luminaries of heaven and earth, the initial separation of purity and turbidity, and the myriad beings all grow from the Yellow Sprout, arising without transcending the Five Phases. The Yellow Sprout is the initial bending and stretching of the sprout. It forms through yang and is born through yin; when yin and yang unite at the moment of receiving qi, it is first chaos. After purity and turbidity separate, the Yellow Sprout emerges.\n\nIn *jia*, it is called \"yellow\"; in the crescent, it is called \"sprout\"; in extension, it is called \"shoot.\" Thus, it is named the Yellow Sprout, the primordial harmonious qi, inseparable from the Five Phases. The Five Phases are Water, Fire, Metal, Wood, and Earth. Water moistens and descends; Fire flames upward; Metal follows transformation; Wood bends and straightens; Earth bears crops.\n\nThe instructions say: The great Dao of heaven and earth endures forever; none among the long-lived surpass the sun, moon, and stars. The Five Phases of yin and yang, day and night, arise from Earth and ultimately return to Earth, changing with the four seasons—yet this, too, has its limit. Such is the natural Dao.\n\nFor example, pine resin receives the qi of the great yang; after a thousand years, it transforms into *fuling*; after another thousand years of illumination, it becomes a *fuling* spirit; after yet another thousand years, it becomes amber; and after another thousand years, it becomes crystal. All are the essence of the sun and moon’s radiant qi, refined into essence through illumination.\n\nAnother example: toads playing in the moonlight, clams and oysters bearing pearls—all gather and receive the radiant qi of the sun and moon, forming pearls in the womb. These are congealed by the yin essence of the moon. Both substances are suitable for consumption, particularly for treating lung qi, fright and evil, and forgetfulness. Form them into pills with honey and hemp seeds, the size of sesame, and swallow three with saliva after meals. Clams and oysters can also restrain mercury.\n\nWhen a person cultivates inner virtue and power, the primordial harmonious qi flows freely. Through cultivation aligned with the Dao, essence congeals into a pearl, naturally attaining longevity. The pearl resides within the Red Waters—Red Waters being blood.\n\nFor instance, birds, beasts, insects, and ants that hibernate and conceal themselves all receive the primordial harmonious qi, sustaining life not through the teachings of parents but by their own nature. Awaken, rejoice! Secure your will. Sounds harmonize, beings resonate, presence and absence interpenetrate, yin and yang embrace to fulfill the Dao. The two qi harmonize; presence and absence restrain and complete each other, thus perfecting the Dao.\n\nThe River Chariot is the master of the Five Metals and also the position of the north. Water can ferry the chariot, bearing and transporting all things in ceaseless revolution. This is yang residing in the yin position, yin containing yang essence, Metal and mercury uniting—hence called the River Chariot. It is the ancestor of primordial harmony, establishing heaven and earth, regulating yin and yang. The four seasons proceed, and the myriad things are born. Receiving qi is called destiny; the most numinous is humanity.\n\nNo blessing surpasses life; no misfortune surpasses death. Since one detests death and desires life, this is embodying the great Dao. Moreover, what I have annotated differs from other schools but aligns with the orthodox classics, its principles returning to the great Dao.\n\nIn discussing hexagrams, fire timing comes first; in explaining medicinal substances, yin and yang are fundamental. *Can* means \"to blend\"; Water, Earth, and Metal are three things united as one family, like tally and contract, their principles in accord—hence called *Cantong* (\"Triple Concordance\").\n\nThe instructions say: The myriad things do not arise without the sun and moon; Metal and Water do not form without Fire and Earth. Metal and Water are the origin of transformation; Fire and Earth are the Dao of yin and yang. When heaven and earth were in chaos, though silent and not yet transformed, they were ultimately the root of the myriad things. The white of Metal and the qi of Water meet within qi, resembling a chicken’s egg.\n\nThe yang burning-mirror takes fire; without the sun, it does not emit light. The Dog Rong use a fire-mirror to ignite mugwort, instantly producing flame—symbolizing the yin and yang of returning cinnabar. This occurs frequently within the Great Tang realm. Words cannot exhaust speech; speech cannot exhaust meaning.\n\nYet the intent of the sages—can it not be seen? Those who use common mercury to make elixirs are deluded. Those who claim cinnabar cannot preserve appearance without proper principles do not understand the Dao. They have strayed far from the truth.\n\nSome say: Using common lead to make mercury is the origin of the numinous.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1228,
      "start_sentence": 0,
      "end_sentence": 54,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.59532904624939,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\玉清内书.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "盖不悟水银真铅之正体，唯赞凡铅之功效，不说水银之精妙，必以二事而成。 何得不兼，而美之乎。 若用凡铅为药，即去道乖远。 若安水银为金丹，即不是真法。 若悟正法，须悟水铅火铅为主。 但得铅本气，遇五而成丹，不遗本也。 若悟元化一施，妙用元极。 若以外物为情，则性不可合。 以水银代汞，则铅不可亲，情性不可依，三宫其何固乎。 铅不可亲，八石岂能妙矣。 金重如本初，金不失其重，日月形如常，汞不失斤两，是日与金本重。 我命在铅不在天，还丹成金亿万年。 铅汞本一体，元二也。 故曰天铅莫坏我铅，令我命全。 莫破我车，载我还家。 铅者，砂中自生曰铅。 车者，砂中抽出之液曰车。 金得火运动曰还丹，金精黄牙制水不流溢。 金精之力，玄水也。 金精黄牙，同名自生铅也。 水者，是砂中抽出之液也。 用铅不用铅，不用得长年。 用铅者，朱砂自有铅相制。 不用铅者，世银之母凡铅也。 铅若不真，其汞难亲。 铅若是真，不失家臣。 铅若不真，凡铅也。 铅若是真，朱铅也。 宁修铅中金，是丹砂中自生者曰金。 不修金中宝，是水银也。 圣人明喻，以示后学。 鼎鼎是何鼎，用丹砂本土为鼎也。 药药是何药，用丹砂中自然流出汞是药也。 辩男女三一说黑白大易参同 火铅是丹砂，被日月运动，自生出汞，为火铅也。 水银，汞之异名，是丹砂阳气未足，抽出为水银。 水银在丹砂中，舍甲精气足，回然自生曰男。 男女相配，阴阳自然，其情更元异类。 金丹本乎一物，而元二物。 入阳气运动，故名三一之道。 白者金精，黑者水基，归一元二。 圣人托喻於《周易》爻象，运动成丹。 制伏皆由父母，运动岂越五行。 顺其阴阳，不失其时。 逆而用之，即魂魄丧亡，如日月交蚀失位，不相宾伏。 圣人秘惜，不能正论，多有隐秘之言。 从此经诀差互，多作不成。 金鼎之诀，宜慎守之。 胡药合和，固不然矣。 天道难泄，或隐玄象，或托附阴阳，潜说人问，言微妙理，群惑自迷。 暨乎羲皇已来，好道求长生者甚众，遇而得之者寡矣，担率留臆而不鉴乎。 不求师授口诀，只按古文立喻，求出世之方，虚自勤劳名山五岳，深谷幽溪，朽败腐儒，自古迄今，不死者未见得之。 食五谷，纵六情，生人在阳，而鬼在阴。 阳耀阴藏，更相朦昧。 复不能驱使鬼神，策役阴阳，未得出世之方例，皆而死归汨没於世。 寒举绵裘而内暖，热即单衣而饮水。 生於阴阳之界，五行所管，况食土所生之物，死归於土，返本也。 若不遇日月之华气，运转精液，三一还丹，焉能度行尸比肩。 若坠石投川，而不能返，沦段而化，亦可嗟乎。 若遇内外金丹，饵之，运形躯，驻貌异常，然可出阴阳之界，五行不管，死籍不录，鬼神侍卫。 诀曰：道有仙传秘录丹经《龙虎》、《上清》、《五金相类》、《周易参同契》歌诀。 古人之意，至於前圣后圣，并得此道。 今之世人，迷愚不‘悟，为是修行得道之人，次遇之不显名，得者隐之不一。 先后指诀，密术秘录，歌诀爻象，皆露枝条苗裔，不肯具载而指径门。 自古迄今，遇者皆烦师受口诀，而身之有分，即非学矣。 传得肘后方者，密心自秘，天道不可转露，泄之养虎自啮。 付不道之人，殃罚七代，谪身为下鬼。",
      "translated_text": "For they do not comprehend the true essence of mercury and true lead, only praising the efficacy of common lead while neglecting the subtlety of mercury—insisting that both must be combined. How can they not consider both and extol them? If common lead is used as the medicine, one strays far from the Dao. If mercury is falsely taken for the golden elixir, it is not the true method. To grasp the correct method, one must understand that water-lead and fire-lead are the foundation. Only by obtaining the original qi of lead and encountering the Five Agents can the elixir form, without losing its root.\n\nIf one awakens to the primordial transformation and its singular application, the marvelous function reaches its utmost. If external things are taken as emotion, then nature cannot unite. If mercury is substituted for quicksilver, then lead cannot be embraced; emotion and nature cannot rely on each other, and how can the Three Palaces be stabilized? If lead cannot be embraced, how can the Eight Stones achieve their marvel? Gold retains its original weight; gold does not lose its heaviness. The sun and moon maintain their usual forms; mercury does not lose its measure. Thus, the sun and gold share the same original weight.\n\nMy life resides in lead, not in heaven. When the returning elixir is perfected, gold endures for myriad years. Lead and mercury are originally one body, not two. Therefore, it is said: \"Heavenly lead, do not destroy my lead, so that my life may be preserved. Do not break my chariot, that it may carry me home.\" Lead is that which naturally arises within cinnabar. The chariot is the liquid drawn forth from cinnabar.\n\nWhen gold is moved by fire, it is called the returning elixir. The essence of gold, the yellow sprout, restrains water so it does not overflow. The power of the essence of gold is the mysterious water. The essence of gold and the yellow sprout are of the same name—naturally arising lead. Water is the liquid drawn forth from cinnabar.\n\nTo use lead or not to use lead—without it, one cannot attain longevity. Those who use lead rely on the lead naturally contained within cinnabar. Those who do not use lead refer to the mother of common silver—common lead. If the lead is not true, its mercury is difficult to embrace. If the lead is true, it does not lose its household minister. If the lead is not true, it is common lead. If the lead is true, it is cinnabar-lead.\n\nBetter to refine the gold within lead—this is the gold that naturally arises within cinnabar. Do not refine the treasure within gold—this is mercury. The sages provide clear analogies to instruct later learners.\n\nWhat is the crucible? It is the cinnabar itself, used as the vessel. What is the medicine? It is the mercury that naturally flows from cinnabar.\n\nDistinguishing male and female, the Three-in-One, the discourse on black and white—these parallel the *Great Change* and the *Uniting Them*. Fire-lead is cinnabar, moved by the sun and moon, naturally producing mercury—this is fire-lead. Water-silver is another name for mercury, the yang qi of cinnabar not yet fully realized, drawn out as water-silver. Within cinnabar, when the essence of the husk is sufficient, it spontaneously generates and is called male. Male and female unite, yin and yang naturally harmonize, their bond transcending difference.\n\nThe golden elixir originates from one thing yet is not two things. When yang qi enters and moves, it is called the Way of the Three-in-One. White is the essence of gold; black is the foundation of water. They return to one yet are not two. The sages borrowed the hexagrams of the *Zhou Changes* as metaphors, moving them to form the elixir. Subduing and mastering all arise from the parents; movement does not transcend the Five Agents. Following yin and yang, one does not lose the proper time. If used in reverse, the hun and po perish, like the sun and moon eclipsing and losing their positions, failing to submit to each other.\n\nThe sages guarded their secrets, unable to speak plainly, often resorting to veiled language. From these cryptic instructions, many errors arise, leading to failure. The secrets of the golden crucible must be guarded with care. Foreign medicines and mixtures are certainly not the way.\n\nThe Dao of heaven is difficult to reveal. Some conceal it in profound images, others attach it to yin and yang, subtly explaining it among people, speaking of its wondrous principles—yet the multitude remains confused and lost. Since the time of Fuxi, those who sought the Dao and long life have been many, but those who encountered and attained it are few. They cling to their own conjectures without discernment.\n\nWithout seeking oral instructions from a master, relying only on ancient texts and analogies, one vainly toils in famous mountains, deep valleys, and secluded streams. Decayed and deluded scholars, from ancient times to the present, have never been seen to achieve immortality. Consuming the Five Grains, indulging the Six Desires, humans live in yang while ghosts dwell in yin. Yang shines while yin conceals, each obscuring the other. Unable to command ghosts and spirits or direct yin and yang, they fail to obtain the methods of transcending the world—all perish and sink into the mundane.\n\nIn cold, one dons padded robes for inner warmth; in heat, one wears light garments and drinks water. Born at the boundary of yin and yang, governed by the Five Agents, consuming things born of earth, one returns to earth at death—this is returning to the root. Without encountering the radiant qi of the sun and moon, circulating the essence and fluids, refining the Three-in-One returning elixir, how can one transcend the walking corpse and the teeming masses?\n\nLike a stone cast into a river, unable to return, sinking and transforming—how lamentable! But if one encounters the inner and outer golden elixirs, consumes them, and circulates them through the body, preserving an extraordinary appearance, one may transcend the boundary of yin and yang, escape the governance of the Five Agents, evade the ledgers of death, and command the service of ghosts and spirits.\n\nThe instructions say: The Dao has immortal transmissions, secret records, and elixir classics such as the *Dragon and Tiger*, the *Supreme Clarity*, the *Five Metals in Mutual Resemblance*, and the *Uniting Them in the Zhou Changes* in song and verse. The intent of the ancients—from the former sages to the later sages—all attained this Dao.\n\nYet people of the present age, deluded and foolish, fail to awaken. Those who practice cultivation and attain the Dao do not reveal their names when encountered; those who obtain it conceal it without exception. The oral instructions passed down from master to disciple, the secret methods and hidden records, the songs, verses, and hexagrams—all reveal only branches and leaves, never fully disclosing the direct path.\n\nFrom ancient times to the present, those who encounter it must receive oral instructions from a master; only then do they have a share in it—otherwise, it is not true learning. Those who transmit the *Prescriptions Behind the Elbow* keep it secret in their hearts. The Dao of heaven must not be carelessly revealed; to do so is to nourish a tiger that will bite you. If entrusted to an unworthy person, calamity befalls seven generations, and one is demoted to a lowly ghost.",
      "overlap_context": "cing flame—symbolizing the yin and yang of returning cinnabar. This occurs frequently within the Great Tang realm. Words cannot exhaust speech; speech cannot exhaust meaning.\n\nYet the intent of the sages—can it not be seen? Those who use common mercury to make elixirs are deluded. Those who claim cinnabar cannot preserve appearance without proper principles do not understand the Dao. They have strayed far from the truth.\n\nSome say: Using common lead to make mercury is the origin of the numinous.",
      "start_char": 1228,
      "end_char": 2446,
      "start_sentence": 55,
      "end_sentence": 121,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.52961230278015,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\玉清内书.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "世人知之有数，非有分而遇之传授，并须探迹。 内行不二有分者，乃可虔志誓言，启百灵，对日月星辰，分符受券，方可传之。 修行不二，至药元双，天人合道，理契自然，不可仓卒，渔猎而得之。 遇师悟者，一言大药只有一门，而有三物，水土金，非世闲水土金凡物也。 得之魂魄所归，但行不二之心，道师必当自至金砂内外丹得门，饵之不死，与天地齐毕，叔长生肘后方，以示后学不悟者矣。 右造鼎入金，及直符用卦刻漏，不载於此o 金丹服食变化五金制汞 诀曰：金丹守运十五日，金性死，一两点汞一斤，成白道。 守运三十日，堪服，可二两。 守运四十五日，或九十日，或经四时足，半两点汞一斤，为白道，服食可一两半。 守运二年，一分点汞一斤，为白道，服食可三分。 守运三年，大元之气足，刀圭制汞一斤，为白道，服食可一分。 守运五年，刀圭点铁及汞五金诸色瓦砾等各一斤，并随本色各成宝，服食可一铢，长生住世。 非止於人，鸡犬禽畜与服不死。 金重二十四铢为一两，刀圭一分也。 诀曰：随其守运上下，日月年岁，用药多少，制汞斤两为金银，复将转点铜输石为大银。 每斤用药银二两。 其汞银但守运一年，用三两制汞一斤，为白道。 还将守运至二年，用二两制汞一斤。 守运三年，用一两制汞一斤，为白道。 还将守运至一年、二年、三年，依法分两制汞为白道。 还将守运，转为药将头制头，种类不绝。 是金丹元化一施，子母妙用元极。 欲得神通变化，须用本土为鼎，及火候并依潜伏，周而复始，可为世珍仙禄也。 诀曰：但取本色天铅，与世水银，分两停止，可配合至一斤。 入匮讫，用本色为外鼎，固济，作炉圈埋灰中，向上，灰可厚五寸，长上头运用火。 初五两，一伏时加至半斤，一伏时加至十三两，一伏时又加至一斤。 只依此斤两，昼夜都至三十日，取二两，点汞一斤为白道。 其银二两，还将转点铜一斤，为大银。 诀曰：其汞还将入匮守运。 但作卫诀，用火斤两，昼夜日数，还将制汞，子母相随，永元断绝。 诀曰：若将点铁五金诸石了者，并用得成珍。 何也，绿是将头制头，不是本受元气之药。 况不得本父母，为气神通有异，只化得下术为白道。 服即不在议限，绿有毒也。 作外鼎制汞法 诀曰：若急速用药，取本土捻为鼎子外鼎，固济如法。 深浅还依前法，入金鼎固济讫。 还埋灰中，上头用火。 初五两，一伏时加七两，一伏时加十二两，一伏时加至一斤，复八伏时。 即於鼎四面，用武火逼通赤，半日许，开取之，一两点汞一斤。 其药换鼎子，还用火一斤，昼夜至一年，即半两点汞一斤，为白道。 诀曰：复换鼎，用火一斤，守二年，一分半点汞一斤，为白道。 复换鼎，守至三年，一分点汞一斤。 其鼎得逐年换，制化与上同，依年月用药，分两点化，并成珍。 服食即不可，为不得元气，直符刻漏守运也。 诀曰：制汞用药之时，但取汞，用药和研，便投於锅子中。 还以些些药盖之，上以甍器盖，四面湿纸缠，却坐於虚灰中。 以火约半斤，遥逼一盘饭久，渐加火，半日已来，烧通赤。 须臾结硬作团，伏火，取鼓之始，镕成质为宝。 诀曰：大丹守运三年，气足取之，以木蜜为丸，麻子大，依分两逐年服食。",
      "translated_text": "Few in the world possess this knowledge by fate; those who encounter and transmit it without destined affinity must seek its traces through investigation. Only those of unwavering inner conduct and destined affinity may earnestly pledge vows, invoke the hundred spirits, and face the sun, moon, and stars to receive the talismanic contract before transmission is permitted.\n\nThe practice must be unwavering, the supreme medicine singular and primordial; heaven and humanity unite with the Dao, their principles harmonizing with nature. It cannot be hastily seized or hunted down. Those who meet a master and awaken to the truth learn that the great medicine has but one gate, yet comprises three substances—water, earth, and metal—not the common water, earth, and metal of the mundane world. When obtained, it reunites the hun and po; with an unwavering heart, the Dao master naturally attains the golden elixir of inner and outer alchemy. Ingesting it confers immortality, equaling heaven and earth in longevity. The *Prescriptions Behind the Elbow* for Longevity are revealed here for later students who fail to comprehend.\n\n---\n\n**On constructing the crucible and infusing metal, and the direct talismanic use of hexagrams and clepsydra, no further details are recorded here.**\n\n**Oral instructions for transmuting the Five Metals and refining mercury:**\nThe Golden Elixir, when guarded and circulated for fifteen days, kills the nature of metal; one *liang* of medicine transmutes one *jin* of mercury into white Dao.\nWhen guarded for thirty days, it may be ingested in doses of two *liang*.\nWhen guarded for forty-five days, or ninety days, or a full four seasons, half a *liang* transmutes one *jin* of mercury into white Dao, and may be ingested in doses of one and a half *liang*.\nWhen guarded for two years, one *fen* transmutes one *jin* of mercury into white Dao, and may be ingested in doses of three *fen*.\nWhen guarded for three years, the primordial qi is fully realized; a *daogui* measure transmutes one *jin* of mercury into white Dao, and may be ingested in doses of one *fen*.\nWhen guarded for five years, a *daogui* measure transmutes one *jin* each of iron, mercury, the Five Metals, and various minerals into their respective treasures. Ingesting one *zhū* confers eternal life and abiding in the world. Not only humans, but chickens, dogs, birds, and livestock may ingest it without dying.\n\nTwenty-four *zhū* make one *liang*; one *daogui* equals one *fen*.\n\n**Oral instructions:**\nAccording to the duration of guarding and circulating—days, months, or years—the quantity of medicine varies. Transmute mercury into gold and silver by weight, then further refine copper and arsenolite into \"great silver.\"\nFor each *jin* of mercury, use two *liang* of medicinal silver.\nWhen mercury is guarded for one year, use three *liang* to transmute one *jin* of mercury into white Dao.\nWhen guarded for two years, use two *liang* to transmute one *jin*.\nWhen guarded for three years, use one *liang* to transmute one *jin* into white Dao.\nFurther guard and circulate for one, two, or three years, adjusting the weight of medicine to transmute mercury into white Dao as above.\nContinue guarding and circulating, using the head of the medicine to refine its kind, perpetuating the lineage without end.\nThis is the primordial transformation of the Golden Elixir, its wondrous application as mother and child reaching the ultimate.\n\nTo attain spiritual penetration and transformation, one must use native soil for the crucible, adhere to the fire phases, and follow the cycles of concealment and renewal. Thus may it become a worldly treasure and immortal emolument.\n\n**Oral instructions:**\nTake native celestial lead and common mercury in equal weights, combining them to make one *jin*.\nPlace them in the sealed vessel, using native soil for the outer crucible, and seal it properly. Construct a furnace, encircle it with ash, and bury the crucible within, leaving five *cun* of ash above. Apply fire to the upper portion.\nBegin with five *liang*; after one *fu* period, increase to half a *jin*; after another *fu*, increase to thirteen *liang*; after another *fu*, increase to one *jin*.\nMaintain this weight day and night for thirty days, then take two *liang* of medicine to transmute one *jin* of mercury into white Dao.\nUse two *liang* of this silver to further transmute one *jin* of copper into \"great silver.\"\n\n**Oral instructions:**\nReturn the mercury to the sealed vessel for guarding and circulating.\nFollow the protective instructions for fire weight and duration, then transmute mercury again. Mother and child follow in succession, perpetually without end.\n\n**Oral instructions:**\nWhen transmuting iron, the Five Metals, and various minerals, all may be refined into treasures.\nWhy? Because this is using the head to refine the head—it is not the medicine that originally received primordial qi.\nMoreover, lacking the original father and mother, its spiritual efficacy differs, only transforming lower arts into white Dao.\nIngestion is not subject to dosage limits, for it contains toxicity.\n\n**Method for constructing the outer crucible to refine mercury:**\n**Oral instructions:**\nFor urgent use of the medicine, take native soil and mold it into an inner crucible and outer crucible, sealing them properly.\nMaintain the same depth as before, place the golden crucible within, and seal it. Bury it in ash, leaving the top exposed for fire.\nBegin with five *liang*; after one *fu* period, increase to seven *liang*; after another *fu*, increase to twelve *liang*; after another *fu*, increase to one *jin*, then maintain for eight *fu* periods.\nApply martial fire to all four sides of the crucible until it glows red, then open it after half a day. One *liang* of medicine transmutes one *jin* of mercury.\nReplace the crucible and apply one *jin* of fire day and night for one year; then half a *liang* transmutes one *jin* of mercury into white Dao.\n**Oral instructions:**\nReplace the crucible again, apply one *jin* of fire, and guard for two years; one and a half *fen* transmute one *jin* of mercury into white Dao.\nReplace the crucible and guard for three years; one *fen* transmutes one *jin*.\nThe crucible should be replaced yearly; the transmutation follows the same method as above, adjusting the medicine’s weight according to the duration to refine all into treasures.\nHowever, ingestion is not recommended, for it lacks primordial qi, being merely a talismanic or clepsydra-based guarding and circulating.\n\n**Oral instructions for refining mercury with medicine:**\nWhen refining mercury, take mercury and medicine, grind them together, and place them in a pot.\nCover with a small amount of medicine, then seal the top with a lid, wrapping the sides with damp paper. Place it in fine ash.\nApply about half a *jin* of fire from a distance for the duration of cooking one meal, then gradually increase the fire. After half a day, burn until red-hot.\nShortly, it will harden into a mass; cease the fire, then pound it to begin melting it into a substance, thus forming a treasure.\n\n**Oral instructions:**\nWhen the Great Elixir has been guarded for three years and its qi is full, take it and form pills with wood honey the size of hemp seeds. Ingest according to the prescribed weight each year.",
      "overlap_context": "losing the direct path.\n\nFrom ancient times to the present, those who encounter it must receive oral instructions from a master; only then do they have a share in it—otherwise, it is not true learning. Those who transmit the *Prescriptions Behind the Elbow* keep it secret in their hearts. The Dao of heaven must not be carelessly revealed; to do so is to nourish a tiger that will bite you. If entrusted to an unworthy person, calamity befalls seven generations, and one is demoted to a lowly ghost.",
      "start_char": 2446,
      "end_char": 3697,
      "start_sentence": 122,
      "end_sentence": 172,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.1402370929718,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\玉清内书.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "取生成捧药，跪坐，向日念：天真饵之。 其丹系一两於左臂，后出入往来，奏表上书，登· 坛拜谒，人皆钦仰。 或有不意之心，向人者自散。 入山及旷野，昼夜逢恶兽鬼魅恶人，皆自伏藏，不敢为害。 系於战敌之处，周匝侍护五百人，不遭箭矢锋刃所伤。 若所行之处，土地灵祇侍卫。 若有药书符录，作法尸解，召集五岳天仙，龙神万灵，立至驱策自由。 世人有疾病，将丹书字，吞之立愈。 金鼎铭 后土金鼎，生死长七。 神室明三，圆五深二。 混沌徘徊，天地四星。 阴阳两头，象如鸡子。 形容莫差，黄白在裹。 厚薄须匀，六一固济。 好守午门，参同自契。",
      "translated_text": "Take the freshly prepared elixir medicine, kneel and sit facing the sun, and recite: \"Heavenly Perfected Ones, partake of this.\" Fasten one *liang* of the elixir to your left arm; thereafter, when you go out or come in, present memorials and petitions, ascend altars, and pay homage—all people will revere and look up to you. Should any harbor unintended ill intentions toward you, they will disperse of their own accord. When entering mountains or open wilderness, whether by day or night, you will encounter no harm from ferocious beasts, ghosts, demons, or evil men, for they will all prostrate themselves and hide, daring not to cause injury. Fasten it where battles rage, and five hundred attendants will encircle and protect you, shielding you from arrows, blades, or any weapon’s harm. Wherever you travel, the local spirits and deities will serve as your guards. If you possess elixir texts, talismans, or scriptures, and perform the method of liberation through the simulated corpse, you may summon the Celestial Immortals of the Five Peaks, dragon spirits, and the myriad numina, who will instantly arrive to be commanded at will. Should the people of the world suffer from illness, inscribe characters with the elixir and swallow them—they will be cured immediately.\n\n**Inscription on the Golden Crucible:**\nThe Golden Crucible of the Earth Deity,\nSeven *cun* in length for life and death.\nThe divine chamber, three *cun* bright,\nFive *cun* round, two *cun* deep.\nRevolving in primordial chaos,\nLike the four stars of heaven and earth.\nYin and yang at two ends,\nResembling a hen’s egg in form.\nLet its shape and appearance be without flaw,\nWith yellow and white within.\nThickness and thinness must be even,\nSealed firmly with the Six-and-One.\nGuard well the Gate of Noon,\nAnd the *Triple Concordance* will naturally align.",
      "overlap_context": "ly about half a *jin* of fire from a distance for the duration of cooking one meal, then gradually increase the fire. After half a day, burn until red-hot.\nShortly, it will harden into a mass; cease the fire, then pound it to begin melting it into a substance, thus forming a treasure.\n\n**Oral instructions:**\nWhen the Great Elixir has been guarded for three years and its qi is full, take it and form pills with wood honey the size of hemp seeds. Ingest according to the prescribed weight each year.",
      "start_char": 3697,
      "end_char": 3949,
      "start_sentence": 173,
      "end_sentence": 188,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.640062808990479,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\玉清内书.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "诀曰：造鼎及入金诀，但取所生朱砂下土，或如黄蜡腻，或青黑色，取一二合研淘，有石砂子，或如油麻粒大小不等，或黄黑色者，研破有朱砂者，此土力大。 梼筛讫，但以和作泥，熟为妙，便固作鼎，形如鸡子，长七寸，圆五寸，趁润截两断，造丸所曝乾，镞中心各阔三寸，渐渐底尖，各深二寸。 神室明裹与外，并如鸡子形。 两扇唇口，并圾作雌雄，不得参差，将金水安在器中，但分两停，不勒斤两数入。 讫如法固济，任意临时泥炉安置，用直符，长去鼎子底一寸。 盖覆运动。 常以草灰掩蔽坚埋，直符用事，并依六候历。 用火直符六候进退诀 第一月一日初候，发火一两，三十时。 至二日半，加二两，至六十时。 第六日第二候，初三两，三十时。 加至四两，满六十时。 第十一日第三候，初五两，三十时。 加至六两，六十时。 第十六日第四候。 初还用六两，三十时。 退至五两，六十时。 第二十一日第五候，退用四两，三十时。 复退至三两，六十时。 第二十六日第六候，退用二两，三十时。 复退一两，六十时。 右六候直符爻象生进退一月法例，周而复始。 第二月初候，二两，三十时。 加至三两。 以次每遇换鼎入月头初候，加至一两用事。 至九个月初候，用九两。 是从一至九，金虎吐精，三十时。 加至十两，六十时。 以次直符合进合退，但依法刻漏，分明用火。 火盛之时，象四月大王，极阳用事，进退港伏，阴阳刑刻，过换鼎，即土王金乡，三物俱丧，是金土本气相感也。 直符合退之时，象五月阴气用事，一阴生上九，亢龙有悔，直符运动，至九鼎。 是第九月后初候，常九两，三十时。 加一两，六十时。 至第三候终，用十四两，阳极。 第五候阴生，却退十二两，三十时。 复退至十一两。 至第六候退守十两，三十时。 复退至九两，六十时足。 第十月后，不论年月，常如取九月初候，还甩九两，三十时。 加一两，六十时。 至第三候，用十四两，退至六候九两，六十时足。 以次序直符加喊，刻漏分明，周而复始，昼夜运动，九杷而毕法。 诀曰：从第一月初候发火，用二十四铢火，为一爻生也。 象计二十四气。 守至二日半，加一爻，至五日为一候也。 以次用火加爻，每月有六候。 常至第三候六十时下，与第四候三十时上，并用武火处也。 其火斤两进退昼夜，即须别添熟炭。 常应露火面，则候为本斤两数也。 其直符九个月半，毕后即须常取第九月火候爻象法则，进退斤两为定，不论年月也。 复诀曰：惟火候最难，巡历名山，上格有共论之，皆有所悟。 惟土惟火，世之不传。 余之肘后，真诀其源。 直符更漏进退图 诀曰：直符合加喊时节，须取刻漏，分明合进退，依法用之，更漏合加喊定时，候盈缩有径门而已。 但取昼夜长短，刻十二辰子丑寅卯辰巳午未申酉戍亥等。 从子时初，於水滴看日，照至丑时，合用多少水。 但作桶子，高三尺，内圆阔一尺，近底棱边钻一小孔子，内乌翅翎管紧安其中，蜡塞四面，即盛水令满、任於滴下，尽即却投在内，任滴，看至一辰位，合用水几桶子，即知诸时用水桶数。 昼夜分十二辰位，约定桶子多少，与秤之更漏元别。 如滴水有多有少，即昼夜长短，但用意消息，万不失一。",
      "translated_text": "**Method for Crafting the Crucible and Infusing the Gold:**\n\nThe method states: For crafting the crucible and infusing the gold, take the earth beneath naturally occurring cinnabar—whether it resembles yellow wax in texture or appears dark greenish-black—and gather one or two *he* of it. Grind and sift it; if it contains grains of stone or cinnabar, varying in size like sesame seeds, or if it is yellowish-black but yields cinnabar when crushed, this earth is of great potency. After sifting, knead it into clay, ensuring it is well-worked for optimal use. Then fashion the crucible in the shape of a hen’s egg: seven *cun* in length, five *cun* in circumference. While still moist, cut it into two halves to form the upper and lower sections. Dry them in the sun. The central chamber should be three *cun* wide, tapering gradually to a depth of two *cun* at the base. Both the inner chamber and the outer shell should resemble the shape of a hen’s egg. The rims of the two halves should be crafted as male and female joints, perfectly aligned without irregularity.\n\nPlace the golden water within the vessel, dividing it evenly by proportion rather than by fixed weight. Seal it according to the method, then set it in a clay furnace as needed. Use a straight talisman, positioned one *cun* above the base of the crucible. Cover and activate it. Always bury it firmly beneath a layer of grass ash. The talisman’s operation follows the six seasonal markers.\n\n**Method for Advancing and Retreating the Fire According to the Six Seasonal Markers:**\n- **First day of the first month, initial marker:** Ignite one *liang* of fire for thirty hours.\n- **By the second day and a half:** Increase to two *liang* for sixty hours.\n- **Sixth day, second marker:** Begin with three *liang* for thirty hours, increasing to four *liang* for sixty hours.\n- **Eleventh day, third marker:** Begin with five *liang* for thirty hours, increasing to six *liang* for sixty hours.\n- **Sixteenth day, fourth marker:** Begin again with six *liang* for thirty hours, retreating to five *liang* for sixty hours.\n- **Twenty-first day, fifth marker:** Retreat to four *liang* for thirty hours, then to three *liang* for sixty hours.\n- **Twenty-sixth day, sixth marker:** Retreat to two *liang* for thirty hours, then to one *liang* for sixty hours.\n\nThis six-marker talisman, with its advancing and retreating *yao* symbols, follows the monthly cycle, repeating endlessly.\n\n- **Second month, initial marker:** Begin with two *liang* for thirty hours, increasing to three *liang*.\n- For each subsequent month, when replacing the crucible at the month’s start, begin with one *liang* and proceed accordingly.\n- By the ninth month’s initial marker, use nine *liang*.\n- From one to nine, the Metal Tiger exhales its essence: thirty hours at nine *liang*, increasing to ten *liang* for sixty hours.\n- The talisman’s advance and retreat must align with the method, clearly following the water clock’s divisions.\n\nWhen the fire is at its peak—symbolizing the fourth month, the height of yang—its advance and retreat must be precise, for yin and yang contend in their measures. When replacing the crucible, it is the Earth’s reign in the Metal’s domain, where the three substances all perish, for the Metal and Earth’s fundamental *qi* resonate with one another.\n\nWhen the talisman retreats—symbolizing the fifth month, when yin *qi* begins to act—one yin arises at the ninth position, and the \"exalted dragon meets with regret.\" The talisman’s movement continues until the ninth crucible.\n\n- **After the ninth month, initial marker:** Use nine *liang* for thirty hours, increasing by one *liang* for sixty hours.\n- By the end of the third marker, use fourteen *liang*—the peak of yang.\n- At the fifth marker, yin arises, retreating to twelve *liang* for thirty hours, then to eleven *liang*.\n- By the sixth marker, retreat to ten *liang* for thirty hours, then to nine *liang* for sixty hours.\n\nAfter the tenth month, regardless of the year or month, always follow the ninth month’s initial marker: begin with nine *liang* for thirty hours, increasing by one *liang* for sixty hours. By the third marker, use fourteen *liang*, then retreat to nine *liang* by the sixth marker for sixty hours. Proceed in sequence with the talisman’s advance and retreat, clearly following the water clock’s divisions. Repeat day and night, completing the method after nine cycles.\n\n**Method:**\nFrom the first month’s initial marker, ignite twenty-four *zhu* of fire to generate one *yao*, symbolizing the twenty-four solar terms. Maintain this until the second day and a half, then add one *yao*, completing one marker by the fifth day. Continue increasing the fire by *yao* each month, with six markers per month. Always note that the period from the end of the third marker’s sixty hours to the beginning of the fourth marker’s thirty hours is the phase for martial fire. The fire’s weight in *liang* advances and retreats day and night, requiring the addition of well-charred coals. Keep the fire’s surface exposed to gauge the correct weight. After completing the nine-and-a-half-month cycle of the talisman, always follow the ninth month’s fire-marker *yao* method for advancing and retreating *liang*, regardless of the year or month.\n\n**Further Method:**\nThe fire markers are the most difficult. Traveling through famous mountains to seek the highest teachings, one may find shared discussions and insights. Yet only Earth and Fire remain untransmitted in the world. This, recorded at my side, is the true method’s source.\n\n**Diagram of the Talisman’s Advance and Retreat According to the Water Clock:**\nThe method states: When the talisman advances or retreats, one must precisely follow the water clock’s divisions, using it according to the method. The water clock’s advance and retreat are fixed by time, with a direct path for measuring expansion and contraction. Simply observe the length of day and night, dividing the twelve double-hours: *zi, chou, yin, mao, chen, si, wu, wei, shen, you, xu, hai*.\n\n- From the initial *zi* hour, observe the water’s flow until the *chou* hour to determine the required volume.\n- Craft a barrel three *chi* tall, one *chi* in inner diameter. Near the base’s edge, drill a small hole and tightly insert a tube made of black feather quills, sealing the gaps with wax. Fill it with water and let it drip freely. When empty, refill it and continue dripping. Observe how many barrels correspond to one double-hour, thereby determining the water volume for each hour.\n- Divide the day and night into twelve double-hours, estimating the barrel count for each. This method differs from the standard water clock’s weight measurement. If the water flow varies, adjust for the length of day and night. With careful attention, it will be infallible.",
      "overlap_context": "cible of the Earth Deity,\nSeven *cun* in length for life and death.\nThe divine chamber, three *cun* bright,\nFive *cun* round, two *cun* deep.\nRevolving in primordial chaos,\nLike the four stars of heaven and earth.\nYin and yang at two ends,\nResembling a hen’s egg in form.\nLet its shape and appearance be without flaw,\nWith yellow and white within.\nThickness and thinness must be even,\nSealed firmly with the Six-and-One.\nGuard well the Gate of Noon,\nAnd the *Triple Concordance* will naturally align.",
      "start_char": 3950,
      "end_char": 5182,
      "start_sentence": 189,
      "end_sentence": 248,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.745266675949097,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\玉清内书.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "用火进退直符火记正历 一月火候诀六＋时是五日也 第一初候，一爻三十时，加至二爻六十时。 第二初候，三爻三十时，加至四爻六十时。 第三初候，五爻三十时，加至六爻六十时。 第四初候，还用六爻三十时，退用五爻六十时。 第五初候，退用四爻三十时，复退至二爻六十时。 第六初候，退用二爻三十时，复退至一爻六十时。 二月火候诀 第一初候，二爻三十时，加至三爻六十时。 第二初候，四爻三十时，加至五爻六十时。 第三初候，六爻三十时，加至七爻六十时。 第四初候，还用七爻三十时，退至六爻六十时。 第五初候，退用五爻三十时，退至四爻六十时。 第六初候，退用三爻三十时，复退至二爻六十时。 三月火候诀 第一初候，三爻三十时，加至四爻六十时。 第二初候，五爻三十时，加至六爻六十时。 第三初候，七爻三十时，加至八爻六十时。 第四初候，还用八爻三十时，退至七爻六十时。 第五初候，退至六爻三十时，复退至五爻六十时。 第六初候，退用四爻三十时，复退至三爻六十时。 四月火候诀 第一初候，四爻三十时，加至五爻六十时。 第二初候，六爻三十时，加至七爻六十时。 第三初候，八爻三十时，加至九爻六十时。 第四初候，还用九爻三十时，退用八爻六十时。 第五初候，退用七爻三十时，复退至六爻六十时。 第六初候，退用五爻三十时，复退至四爻六十时。 五月火候诀 第一初候，五爻三十时，加至六爻六十时。 第二初候，七爻三十时，加至八爻六十时。 第三初候，九爻三十时，加至十爻六十时。 第四初候，还用十爻三十时，退用九爻六十时。 第五初候，退用八爻三十时。 复退至七爻六十时。 第六初候。 退用六爻三十时，复退至五爻六十时。 六月火候诀 第一初候，六爻三十时，加至七爻六十时。 第二初候，八爻三十时。 加至九爻六十时。 第三初候，十爻三十时，加至十一爻六十时。 第四初候，还用十一爻三十时，退至十爻六十时。 第五初候，退用九爻三十时，复退至八爻六十时。 第六初候，退用七爻三十时，复退至六爻六十时。 七月火候诀 第一初候，七爻三十时，加至八爻六十时。 第二初候，九爻三十时，加至十爻六十时。 第三初候，十一爻三十时，加至十二爻六十时。 第四初候，还用十二爻三十时，退至十一爻六十时。 第五初候，退用十爻三十时，复退至九爻六十时。 第六初候，退用八爻三十时。 复退至七爻六十时。 八月火候诀 第一初候，八爻三十时，加至九爻六十时。 第二初候，十爻三十时，加至十一爻六十时。 第三初候，十二爻三十时，加至十三爻六十时。 第四初候，还用十三爻三十时，退至十二爻六十时。 第五初候，退用十一爻三十时。 复退至十爻六十时。 第六初候，退用九爻三十时，复退至八爻六十时。 九月火候诀 第一初候，九爻三十时，加至十爻六十时。 第二初候，十一爻三十时，加至十二爻六十时。 第三初候，十三爻三十时，加至十四爻六十时。 第四初候，还用十四爻三十时，退至十三爻六十时。 第五初候，退用十二爻三十时，复退至十一爻六十时。 第六初候，十爻三十时，复退至九爻六十时。 元君潜运手镜诀 诀曰：天地二气相感，日月迭照，成自然还丹。",
      "translated_text": "**Regulating Fire with the Direct Correspondence Fire Record and the Correct Calendar**\n\n**Fire Regimen for the First Month (Six Six-Hour Periods Equaling Five Days)**\n- **First Initial Phase:** One *yao* for thirty hours, increasing to two *yao* for sixty hours.\n- **Second Initial Phase:** Three *yao* for thirty hours, increasing to four *yao* for sixty hours.\n- **Third Initial Phase:** Five *yao* for thirty hours, increasing to six *yao* for sixty hours.\n- **Fourth Initial Phase:** Still using six *yao* for thirty hours, then reducing to five *yao* for sixty hours.\n- **Fifth Initial Phase:** Reducing to four *yao* for thirty hours, then further to two *yao* for sixty hours.\n- **Sixth Initial Phase:** Reducing to two *yao* for thirty hours, then further to one *yao* for sixty hours.\n\n**Fire Regimen for the Second Month**\n- **First Initial Phase:** Two *yao* for thirty hours, increasing to three *yao* for sixty hours.\n- **Second Initial Phase:** Four *yao* for thirty hours, increasing to five *yao* for sixty hours.\n- **Third Initial Phase:** Six *yao* for thirty hours, increasing to seven *yao* for sixty hours.\n- **Fourth Initial Phase:** Still using seven *yao* for thirty hours, then reducing to six *yao* for sixty hours.\n- **Fifth Initial Phase:** Reducing to five *yao* for thirty hours, then further to four *yao* for sixty hours.\n- **Sixth Initial Phase:** Reducing to three *yao* for thirty hours, then further to two *yao* for sixty hours.\n\n**Fire Regimen for the Third Month**\n- **First Initial Phase:** Three *yao* for thirty hours, increasing to four *yao* for sixty hours.\n- **Second Initial Phase:** Five *yao* for thirty hours, increasing to six *yao* for sixty hours.\n- **Third Initial Phase:** Seven *yao* for thirty hours, increasing to eight *yao* for sixty hours.\n- **Fourth Initial Phase:** Still using eight *yao* for thirty hours, then reducing to seven *yao* for sixty hours.\n- **Fifth Initial Phase:** Reducing to six *yao* for thirty hours, then further to five *yao* for sixty hours.\n- **Sixth Initial Phase:** Reducing to four *yao* for thirty hours, then further to three *yao* for sixty hours.\n\n**Fire Regimen for the Fourth Month**\n- **First Initial Phase:** Four *yao* for thirty hours, increasing to five *yao* for sixty hours.\n- **Second Initial Phase:** Six *yao* for thirty hours, increasing to seven *yao* for sixty hours.\n- **Third Initial Phase:** Eight *yao* for thirty hours, increasing to nine *yao* for sixty hours.\n- **Fourth Initial Phase:** Still using nine *yao* for thirty hours, then reducing to eight *yao* for sixty hours.\n- **Fifth Initial Phase:** Reducing to seven *yao* for thirty hours, then further to six *yao* for sixty hours.\n- **Sixth Initial Phase:** Reducing to five *yao* for thirty hours, then further to four *yao* for sixty hours.\n\n**Fire Regimen for the Fifth Month**\n- **First Initial Phase:** Five *yao* for thirty hours, increasing to six *yao* for sixty hours.\n- **Second Initial Phase:** Seven *yao* for thirty hours, increasing to eight *yao* for sixty hours.\n- **Third Initial Phase:** Nine *yao* for thirty hours, increasing to ten *yao* for sixty hours.\n- **Fourth Initial Phase:** Still using ten *yao* for thirty hours, then reducing to nine *yao* for sixty hours.\n- **Fifth Initial Phase:** Reducing to eight *yao* for thirty hours, then further to seven *yao* for sixty hours.\n- **Sixth Initial Phase:** Reducing to six *yao* for thirty hours, then further to five *yao* for sixty hours.\n\n**Fire Regimen for the Sixth Month**\n- **First Initial Phase:** Six *yao* for thirty hours, increasing to seven *yao* for sixty hours.\n- **Second Initial Phase:** Eight *yao* for thirty hours, increasing to nine *yao* for sixty hours.\n- **Third Initial Phase:** Ten *yao* for thirty hours, increasing to eleven *yao* for sixty hours.\n- **Fourth Initial Phase:** Still using eleven *yao* for thirty hours, then reducing to ten *yao* for sixty hours.\n- **Fifth Initial Phase:** Reducing to nine *yao* for thirty hours, then further to eight *yao* for sixty hours.\n- **Sixth Initial Phase:** Reducing to seven *yao* for thirty hours, then further to six *yao* for sixty hours.\n\n**Fire Regimen for the Seventh Month**\n- **First Initial Phase:** Seven *yao* for thirty hours, increasing to eight *yao* for sixty hours.\n- **Second Initial Phase:** Nine *yao* for thirty hours, increasing to ten *yao* for sixty hours.\n- **Third Initial Phase:** Eleven *yao* for thirty hours, increasing to twelve *yao* for sixty hours.\n- **Fourth Initial Phase:** Still using twelve *yao* for thirty hours, then reducing to eleven *yao* for sixty hours.\n- **Fifth Initial Phase:** Reducing to ten *yao* for thirty hours, then further to nine *yao* for sixty hours.\n- **Sixth Initial Phase:** Reducing to eight *yao* for thirty hours, then further to seven *yao* for sixty hours.\n\n**Fire Regimen for the Eighth Month**\n- **First Initial Phase:** Eight *yao* for thirty hours, increasing to nine *yao* for sixty hours.\n- **Second Initial Phase:** Ten *yao* for thirty hours, increasing to eleven *yao* for sixty hours.\n- **Third Initial Phase:** Twelve *yao* for thirty hours, increasing to thirteen *yao* for sixty hours.\n- **Fourth Initial Phase:** Still using thirteen *yao* for thirty hours, then reducing to twelve *yao* for sixty hours.\n- **Fifth Initial Phase:** Reducing to eleven *yao* for thirty hours, then further to ten *yao* for sixty hours.\n- **Sixth Initial Phase:** Reducing to nine *yao* for thirty hours, then further to eight *yao* for sixty hours.\n\n**Fire Regimen for the Ninth Month**\n- **First Initial Phase:** Nine *yao* for thirty hours, increasing to ten *yao* for sixty hours.\n- **Second Initial Phase:** Eleven *yao* for thirty hours, increasing to twelve *yao* for sixty hours.\n- **Third Initial Phase:** Thirteen *yao* for thirty hours, increasing to fourteen *yao* for sixty hours.\n- **Fourth Initial Phase:** Still using fourteen *yao* for thirty hours, then reducing to thirteen *yao* for sixty hours.\n- **Fifth Initial Phase:** Reducing to twelve *yao* for thirty hours, then further to eleven *yao* for sixty hours.\n- **Sixth Initial Phase:** Reducing to ten *yao* for thirty hours, then further to nine *yao* for sixty hours.\n\n**Secret Method of the Hidden Workings from the Hand Mirror of the Primordial Sovereign**\nThe method states: The two *qi* of Heaven and Earth interact, the sun and moon alternately illuminate, forming the natural cyclical elixir.",
      "overlap_context": ", sealing the gaps with wax. Fill it with water and let it drip freely. When empty, refill it and continue dripping. Observe how many barrels correspond to one double-hour, thereby determining the water volume for each hour.\n- Divide the day and night into twelve double-hours, estimating the barrel count for each. This method differs from the standard water clock’s weight measurement. If the water flow varies, adjust for the length of day and night. With careful attention, it will be infallible.",
      "start_char": 5183,
      "end_char": 6450,
      "start_sentence": 249,
      "end_sentence": 319,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.843597173690796,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\玉清内书.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "上界仙官，守护收采。 非俗士之所遇，皆仙人则而取之。 三皇以敬至道修生，以直符运动三年，象自然之气运，火候依节，符乾坤坎离，运动火候斤两，须得真经师受口诀。 凡言不载，若不从师受参差，药物交杂，终元得理。 圣人观天符之门守一，但得本父母相制，必成大丹。 则阴阳变化之道，神通自在，返归其色。 诀曰：直符法喻，假令十，一月建子，阳气始生法象，夏至前一日夜鸡呜时一阴生，阴气用事，是天地阴阳进退，一年十二月，生成用事也。 故月有六候直符，生成潜伏，五行出没，交会形刻，并在内申。 故云火木前十五日，白月三候，极阳用事。 证后阳退阴生，九六阴水也，后十五日，黑月三候，极阴用事。 周而复始，故七八九六道自合，三十终金水。 本喻立月候昼夜，用火港伏，象一年阴阳节候，用直符昼夜，此是天地枢机在乎手，名曰出世之方，神通变化，玄之又玄。 但发火之时，便是十一月，受阳用事也。 诀曰：第一鼎第一月初候，火一爻生，直符象十一月建子，阳气用事。 初九，潜龙勿用。 一爻生昼夜，二日半三十时。 加至二爻，至五日一候六十时，巡十一日一辰。 子丑寅卯辰巳午未申酉戌亥，五周各六十时，为一候。 初候五日，惊垫震来受符，运至上弦八日，金性低昂半受死，守至十五日为一气，金性全灭。 二十日，萌者不生，阳伸阴屈，水不动，刚柔相使，自然丹耳。 二十一日，巽来受符，金水性己灭竭亡，二精呼吸，吞饮同死。 震巽二木渐顺，汞虽得乾，未是大丹。 三十日，道穷返归乎坤元，受符成丹，三物同没於土。 四十五日，为一节，一节相呕相通运至。 六十日，卯当夹锺，夹到卯门，榆荚坠落，还归其根。 二月，榆死魁刚卯，刑德相负，昼夜始分，故云榆荚丹。 诀曰：日有三照，月有三移。 日月合气，故万物三变而至极，经四时自然之道。 月有三百六十时，时计象一年十二月，得四千三百二十时，一时当一年，计四千三百二十年，象自然之还丹，阴阳交媾，寒暑而成象。 诀曰：港伏阳伸阴屈，余并依节候卦象，直符气候，法是九鼎。 九鼎九个月。 诀曰：九鼎各须三分者，每鼎各守三十日，受气二百七十日足，阴阳俱盛，十月土王而生，故云子母脱胎，世人莫知之矣。 水火相克。 互相制伏，更为父母，不越五行，藏伏成形，守运一千日，大元气足，性归北方癸水，黑色，始得名曰大还丹也。 诀曰：取元气金水，但分两停相和，合其体本，立喻上下弦数二八斤之数，应阴阳二金，本乎一物，而生二象气候，雌雄黄白，自然情性相依，阴阳合为一体元二。 二曰火，一曰水，除水火为药，元别入分。 若有异类，终不成丹。 得之不在斤两数耳。 诀曰：但将金水入鼎，如法固济，取四杀刑克。 阳日阳时发火，自置更漏，节候分明，知加臧不失金水，在於鼎中，混沌未分，被直符运动，阴阳交腾，吞饮变化，元气清浊，上下玄黄，金水成形，象鸡子，元气在壳中，受阳气，含其真而抱一也。 诀曰：丹砂金砂，金液倒长砂，黄牙天铅，砂汞铅汞，真阴真阳，金土水火，乾坤坎离，化生龙虎黑虎，西灵金丹，玉液九转，还返大还，尽是还丹之异名。 皆是古人藏机之隐秘，不一悟者。",
      "translated_text": "**Celestial Immortals of the Upper Realm** guard and gather the harvest. This is not something mundane scholars may encounter—only immortals then take it as their own. The Three Sovereigns revered the supreme Dao to cultivate life, employing the *Straight Talisman* to move the *qi* for three years, mirroring the natural circulation of *qi*. The fire phases follow the seasonal nodes, aligning with Qian, Kun, Kan, and Li. The movement of fire phases and their weights must be received through the true scripture and oral transmission from a master. What is spoken is not recorded; without receiving instruction from a master, the ingredients will be disordered and mixed, and one will never grasp the principle.\n\nThe sages observed the gate of celestial talismans and guarded the One. By obtaining the mutual restraint of the original father and mother, the Great Elixir is surely achieved. Thus, the Dao of yin-yang transformation grants spiritual freedom and self-mastery, returning to its original color.\n\nThe method states: The *Straight Talisman* serves as an analogy. For example, take ten: in the first month, *Jianzi*, yang *qi* begins to arise, modeled after the summer solstice. On the day before the solstice, at the hour of the cock’s crow, the first yin is born, and yin *qi* takes charge. This is the advance and retreat of Heaven and Earth’s yin and yang, governing the twelve months of the year’s generation and completion. Thus, the moon has six *zhi-fu* phases, with generation, completion, concealment, and the waxing and waning of the Five Agents. Their interactions and temporal forms are all contained within the *nei-shen*.\n\nTherefore, it is said: In the fifteen days before the fire and wood phases, the white moon’s three phases see extreme yang in charge. After this, yang retreats and yin arises—this is the nine-six yin water. In the fifteen days after, the black moon’s three phases see extreme yin in charge. The cycle repeats endlessly. Thus, the seven, eight, nine, and six paths naturally align, and the thirty-day cycle concludes with metal and water.\n\nThis analogy establishes the moon’s phases for day and night, using fire to conceal and activate, mirroring the yin-yang seasonal nodes of a year. The *zhi-fu* governs day and night—this is the pivot of Heaven and Earth held in the hand, called the \"method of world-transcendence.\" Spiritual transformations are profound beyond profundity.\n\nWhen the fire is first applied, it corresponds to the eleventh month, when yang begins its charge. The method states: In the first crucible’s first initial phase, the first *yao* of fire arises. The *zhi-fu* symbolizes the eleventh month, *Jianzi*, when yang *qi* takes charge. *Chujiu*: \"The hidden dragon does not act.\" The first *yao* governs day and night for two and a half days—thirty hours. Increasing to two *yao*, it reaches five days—one phase of sixty hours—completing eleven days, one celestial stem. *Zi, Chou, Yin, Mao, Chen, Si, Wu, Wei, Shen, You, Xu, Hai*: five cycles of sixty hours each constitute one phase. In the first phase of five days, *Jingzhen* (thunder) arrives to receive the talisman. By the eighth day, the upper quarter, the metal nature wavers between low and high, half-dead. Guarding until the fifteenth day completes one *qi*, and the metal nature is wholly extinguished. On the twentieth day, what sprouts does not grow; yang extends while yin recedes. Water does not move, and hardness and softness interact—this is the natural elixir.\n\nOn the twenty-first day, *Xun* (wind) arrives to receive the talisman. The natures of metal and water have already perished and exhausted. The two essences breathe and swallow in unison, dying together. The two woods, *Zhen* and *Xun*, gradually harmonize. Though mercury obtains Qian, it is not yet the Great Elixir. On the thirtieth day, the Dao is exhausted and returns to Kun’s origin. Receiving the talisman, the elixir forms, and the three substances vanish together into earth. Forty-five days constitute one node, and the nodes mutually resonate and circulate. At sixty days, *Mao* aligns with *Jiazhong*. When *Jia* reaches the *Mao* gate, the elm pods fall, returning to their root.\n\nIn the second month, the elm dies, and *Kui* and *Gang* contend with *Mao*. Punishment and virtue oppose each other, and day and night begin to divide. Thus, it is called the \"elm-pod elixir.\" The method states: The sun has three illuminations, and the moon has three shifts. The union of sun and moon’s *qi* causes all things to undergo three transformations and reach their extreme, following the natural Dao of the four seasons.\n\nThe moon has 360 hours, each hour corresponding to one year’s twelve months, totaling 4,320 hours. One hour represents one year, amounting to 4,320 years—mirroring the natural cyclical elixir, where yin and yang unite and the alternation of cold and heat forms images.\n\nThe method states: Concealment and activation, yang extending and yin receding—all else follows the seasonal nodes and hexagram images of the *zhi-fu* and *qi* phases. The method is that of the Nine Crucibles. Nine crucibles span nine months. The method states: Each of the Nine Crucibles requires three divisions. Each crucible is guarded for thirty days, receiving *qi* for a full 270 days. When yin and yang are both abundant, in the tenth month, earth reigns and gives birth. Thus, it is called \"mother and child shedding the womb\"—a truth unknown to the world.\n\nWater and fire overcome each other, mutually restraining and submitting, becoming father and mother anew. They do not exceed the Five Agents, concealing and forming shape. Guarding and circulating for 1,000 days, the great primordial *qi* is fulfilled. The nature returns to the north, to *Gui* water, black in color. Only then is it named the Great Cyclical Elixir.\n\nThe method states: Take the primordial *qi* of metal and water, balancing their weights to harmonize their fundamental bodies. Establish the analogy of the upper and lower quarters, with the number two-eight (sixteen) corresponding to yin and yang’s two metals. Originating from one thing, they generate the two images of *qi* phases—yellow and white, male and female—naturally dependent in nature. Yin and yang unite into one primordial two: two is fire, one is water. Excluding water and fire as medicines, there is no separate division. If there are heterogenous elements, the elixir will never form. Success does not lie in the weight or number.\n\nThe method states: Simply place metal and water into the crucible, sealing it properly according to the method. Apply the four destructive punishments and restraints. On a yang day at a yang hour, ignite the fire. Set the water clock clearly, knowing the additions and reductions without losing the metal and water within the crucible. Before separation, in primordial chaos, the *zhi-fu* moves them. Yin and yang intermingle, swallowing and transforming. The primordial *qi* clarifies and muddies, ascending and descending in mysterious yellow. Metal and water take form, resembling a chicken’s egg. The primordial *qi* is within the shell, receiving yang *qi*, containing its truth and embracing the One.\n\nThe method states: Cinnabar and golden sand, golden liquid inverted to grow sand, yellow sprouts and celestial lead, sand-mercury and lead-mercury, true yin and true yang, metal, earth, water, and fire, Qian, Kun, Kan, and Li—transforming and giving birth to the dragon and tiger, the black tiger, the Western Numinous Golden Elixir, the Jade Liquid of Nine Cycles, the Great Return—all are alternate names for the cyclical elixir. These are the hidden secrets of the ancients, not to be grasped by the unenlightened.",
      "overlap_context": "educing to thirteen *yao* for sixty hours.\n- **Fifth Initial Phase:** Reducing to twelve *yao* for thirty hours, then further to eleven *yao* for sixty hours.\n- **Sixth Initial Phase:** Reducing to ten *yao* for thirty hours, then further to nine *yao* for sixty hours.\n\n**Secret Method of the Hidden Workings from the Hand Mirror of the Primordial Sovereign**\nThe method states: The two *qi* of Heaven and Earth interact, the sun and moon alternately illuminate, forming the natural cyclical elixir.",
      "start_char": 6450,
      "end_char": 7685,
      "start_sentence": 320,
      "end_sentence": 361,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.06216549873352,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\玉清内书.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "若遇《肘后诀》、《参同契》，其理归一元二，故曰还丹。 还丹有返，忌覆盆血。 覆盆血者，不吉之人。 慎勿与同心泄天道也。 及合金入鼎，直符用事，炼丹之所，守慎清净不秽，元生死哭泣安尸灵屋宇不道之地。 须择福德形胜安争之处，方可结坛，焚香，虔志祭祀土地灵祇，水陆等，方可安即，百灵助佑，天道和合，诸仙来护，但心行不二，若於常常之处修炼，亦须谨诤触秽，不可容易炉样，及指药所在图本，祭醮法则并在别诀中。 火瓶直符定节刻诀 假令五月十七日子时起，至二十日巳时过。 一五。 二十日午起，至二十二日亥过。 二五。 二十二日子起，至二十五日巳过。 三五。 二十五日午起，至二十七日亥过。 四五。 二十七日子起，至三十日巳过。 五五。 三十日午起，至六月二日亥过。 六五。 六月二日子起，至五日巳过。 退六五。 五日午起，至七亥过。 退五五。 七日子起，至十日巳过。 退四五。 十日午起，至十二日亥过。 退三五。 十二日子起，至十五日巳过。 退二五。 十五日午起，至十七日亥过。 退一五。 玉清内书竟",
      "translated_text": "Should one encounter the *Zhouhou Jue* or the *Cantong Qi*, their principles converge in the One and the Two—hence the name \"Returning Elixir.\" The Returning Elixir has its reversals, and one must shun the \"blood of the overturned basin.\" The \"blood of the overturned basin\" refers to inauspicious persons. Take care not to share the same mind with them, lest the celestial Dao be divulged.\n\nWhen conjoining metal and placing it into the crucible, the *zhifu* governs the process. The site of elixir refinement must be guarded with vigilance, kept pure and undefiled—far from places of birth and death, wailing and weeping, desecrated temples, or unholy grounds. One must select an auspicious location, blessed with propitious terrain, to establish the altar. There, burn incense, devote oneself in reverence, and offer sacrifices to the local earth spirits, water and land deities, and all such numina. Only then may the crucible be installed, so that the hundred spirits may lend their aid, the celestial Dao harmonize, and the various immortals come to safeguard the work. Yet the heart must remain unwavering in its singular intent.\n\nIf practicing in an ordinary place, one must still be cautious of defilement and avoid carelessness in the arrangement of the furnace or the designation of the medicinal ingredients. Diagrams of their positions and the rites of offering are recorded in separate instructions.\n\n**Fire Vessel *Zhifu* Fixed-Node Timing Formula**\nSuppose the first cycle begins on the seventeenth day of the fifth month at the *zi* hour, continuing until the *si* hour of the twentieth day. **First Five.**\nFrom the *wu* hour of the twentieth day to the *hai* hour of the twenty-second day. **Second Five.**\nFrom the *zi* hour of the twenty-second day to the *si* hour of the twenty-fifth day. **Third Five.**\nFrom the *wu* hour of the twenty-fifth day to the *hai* hour of the twenty-seventh day. **Fourth Five.**\nFrom the *zi* hour of the twenty-seventh day to the *si* hour of the thirtieth day. **Fifth Five.**\nFrom the *wu* hour of the thirtieth day to the *hai* hour of the second day of the sixth month. **Sixth Five.**\nFrom the *zi* hour of the second day of the sixth month to the *si* hour of the fifth day. **Retreat Sixth Five.**\nFrom the *wu* hour of the fifth day to the *hai* hour of the seventh day. **Retreat Fifth Five.**\nFrom the *zi* hour of the seventh day to the *si* hour of the tenth day. **Retreat Fourth Five.**\nFrom the *wu* hour of the tenth day to the *hai* hour of the twelfth day. **Retreat Third Five.**\nFrom the *zi* hour of the twelfth day to the *si* hour of the fifteenth day. **Retreat Second Five.**\nFrom the *wu* hour of the fifteenth day to the *hai* hour of the seventeenth day. **Retreat First Five.**\n\nHere ends the *Yuqing Neishu*.",
      "overlap_context": ": Cinnabar and golden sand, golden liquid inverted to grow sand, yellow sprouts and celestial lead, sand-mercury and lead-mercury, true yin and true yang, metal, earth, water, and fire, Qian, Kun, Kan, and Li—transforming and giving birth to the dragon and tiger, the black tiger, the Western Numinous Golden Elixir, the Jade Liquid of Nine Cycles, the Great Return—all are alternate names for the cyclical elixir. These are the hidden secrets of the ancients, not to be grasped by the unenlightened.",
      "start_char": 7685,
      "end_char": 8139,
      "start_sentence": 362,
      "end_sentence": 393,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.325641632080078,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\玉清内书.txt",
        "category": "众术类"
      }
    }
  ]
}