{
  "source_id": "玉箓资度解坛仪",
  "source_file": "chunked_daozang\\玉箓资度解坛仪.json",
  "total_chunks": 6,
  "total_original_chars": 2357,
  "total_translated_chars": 16593,
  "total_translation_time": 94.98663806915283,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓资度解坛仪.txt",
    "category": "威仪类"
  },
  "full_translation": "*The Jade Register Ritual for Deliverance and Dismantling the Altar*\n\n**Scripture Title:** *Jade Register Ritual for Deliverance and Dismantling the Altar*\nOne fascicle.\nSource text: *Daoist Canon of the Zhengtong Era*, Dongxuan Section, Category of Dignified Rituals.\n\n---\n\n**Jade Register Ritual for Deliverance and Dismantling the Altar**\nThe ritual proceeds according to form.\nAll bow to the master, contemplating as prescribed.\n\n**Invocation of the Divine Incantation:**\nThe Five Numinous Ones array their positions, resplendent in guarding the five directions.\nThe First Sovereign shields the soul; the Cinnabar Elder protects the form.\nThe Radiant Spirit attends the po; the Dark Emperor sustains life.\nThe Yellow Emperor of the Center governs the myriad perfected.\nThe Primordial August One issues the decree, illuminating the dark night with light.\nSins dissolve in the Northern Bureau; names are inscribed in the Southern Prosperity.\nThe Golden Register fixes the ledger; the Jade Script dispels calamity.\nThe Scarlet Mound refines the substance; the spirit soars to the Great Granary.\nThe Three Officials and Nine Bureaus, the boundless divine realm—\nAll universally receive deliverance, ascending to the celestial halls.\nHarmony unites with the Dao, merging with the true.\n\n**Strike the ritual drum twenty-four times.**\n\nO Most High Three Heavens, Mysterious Primordial Three *Qi* of the Supreme Dao Lord,\nO Most High Lord Lao, summon forth from within this servant’s body:\nThe Three and Five Merit Officers,\nThe Left and Right Attendant Messengers,\nThe Left and Right Fragrant-Bearing Dragon-Riding Couriers,\nThe Golden Lads Attending Incense,\nThe Jade Maidens Scattering Flowers,\nThe Five Thearchs’ Direct Talismans and Daily Incense Officials—\nthirty-six each.\nLet them emerge, adorned in solemn vestments, crowned and sashed with hanging tassels.\nSummon the local earth deities and territorial spirits of the numinous altar.\nThis servant now dismantles the altar and declares the merit, burning incense and offering repentance.\nReverently, I submit this petition for the intentions of the present retreat, already recorded and reported.\nMay the luminous *qi* of the Most High Perfected Dao and the radiant light of the Numinous Treasure descend,\nflowing into the bodies of this servant and all present,\nso that the sincerity of this servant’s invocation swiftly reaches the presence of the Perfected, Boundless, and Supreme Dao—\nthe Three Clarities, the August Heavenly Golden Portal Jade Emperor,\nand the Eastern Ultimate Compassionate Honored One, the Azure Mystery Emperor—\nbefore the Dao.\n\n**Recite the dharma titles:**\nThis humble servant, [Name] and company, now burn incense,\ndevoting body, spirit, and life to the Most High Compassionate Honored One, Savior of the Ten Directions.\n\nThis servant has heard:\nThe Three Registers transmit the statutes; the Five Chapters establish the model.\nThe majestic Dao’s intent is magnified; the profound wind is grandly propagated.\nModeling heaven and earth, the altar rites were first established;\nsummoning yin and calling yang, cloud-script is stabilized and pacified.\nA thousand perfected descend in chariots; ten thousand sages attend the audience hall.\nThe retreat’s vows ascend to the layered heavens; the true chariots descend to the dharma seat.\nTo aid [Name]’s spirit, ascend to the celestial palace, and verify rank upon the immortal steps.\nNow, as the vows are fulfilled and the morning rites conclude,\nthe altar is dismantled, the assembly dispersed.\nFirst, faults are confessed, merits declared,\nofferings made in hope of vast grace,\nand reverence paid to the ancestral altars.\nGolden dragons rise in script; the jiao rites’ blessings reach perfection.\nJade wefts stream with light, bestowing boundless blessings upon the glorious fortune.\nMay the numinous response of this invocation swiftly ascend to the presence of the Perfected, Boundless, and Supreme Dao.\n\n**At the sound of the chime, rise and offer reverent praise.**\n\n**Chant the Ten Directions’ Titles.**\nBow, touch the ground, and kneel in prolonged reverence, repenting with utmost sincerity.\n\nThis assembly of ritualists, with devoted hearts,\ndevotes body, spirit, and life to the Compassionate Honored One, Savior of the Ten Directions.\nReverently, we gaze upon your vast compassion,\nhoping for the outpouring of great blessings and the universal bestowal of boundless grace.\nNow, as the altar is dismantled and the assembly dispersed,\nwe burn incense and offer repentance.\n\nThis servant has heard:\nThe Three Heavens spread their blessings, the numinous light extending the kindness of nurturing transformation;\nthe Nine Lands receive grace, the ancestral *qi* conveying the power of spiritual transmigration.\nBearing the imperial favor’s radiant reflection,\nwe are fortunate that the retreat’s dharma has come full circle.\nHumbly, we exhaust our sincere hearts, looking up to the vast creation.\n\nYet again, we reflect:\nOur spirits are entangled in the mundane; our bearing gathers dust.\nThe jade laws revolve in splendor, sternly recording the Three Primes’ judgments;\nthe golden statutes are intricate, rigorously enforcing the Four Poles’ regulations.\nWe can only hope for your magnanimous forbearance, your reverent bestowal of nurturing care.\nMay the numinous light be cultivated across the nine paths, vowing to propagate the profound tradition;\nmay the dharma rain flow through the three destinies, wishing to exalt the sagely creation.\n\nThis assembly, with devoted hearts, bows and prostrates,\noffering thanks to the Most High Perfected Three Treasures.\n\n**Three invocations.**\n**Three bows.**\n\nAgain invoking the dharma-ranks, we, your humble servants—[Name] and the assembled ritualists at the altar—with unified sincerity, reverently address and supplicate:\n\nThe Primordial Celestial Worthy of Numinous Treasure of the Void and Spontaneous Origin, the Most High Dao Lord, the Most High Lord Lao, the Jade Emperor of August Heaven, the Great Emperor of the Purple Tenuity, the Great Emperor of the Northern Culmen of the Purple Tenuity, the August Earth Spirit of the Rear Soil, the Elder Lord of the Eastern Culmen of the Azure Mystery, the August Thearch Who Circulates Brightness and Preserves the Origin, the Celestial Worthy of Great Compassion Who Saves from Suffering, the Celestial Worthy Who Delivers from the Nine Hells of Sin, the Manifested and Transformed Celestial Worthies of the Ten Directions Who Save from Suffering, the Most Compassionate and Greatly Merciful Perfected of Salvation, the Perfected of Great Kindness, the Perfected Who Registers Births, the Perfected of the Fragrant Grove Assembly Who Releases from Dharma-Bonds, the Tenfold Radiant Perfected, the Universally Saving Perfected, the Thirty-Six Divisions of Venerable Scriptures, the Great Dharma-Masters of the Mysterious Center, the Great Dharma-Masters of the Three Heavens, and all numinous powers responsive to the ritual altar’s descent—\n\nWe, mere motes of dust and humble mayflies, bear the blessings bestowed by the Nine Celestial Thrones and stand at the radiant unfolding of the Three Caverns.\n\nClad in golden talismans, our names inscribed in jade registers.\nClouds and mist gather the radiance—how could we not lift our aspirations to the pure and void?\nSun and moon course as one, yet we dwell amid the dust of the world.\nA hundred transgressions remain unwashed, ten thousand karmic bonds still fetter us.\nRecalling the cinnabar sincerity of our Dao-reception, we ever renew our primal vow to succor the age.\nMay we thus aid in transformation and nurturance, not betraying the gift of life and growth.\n\nHaving received the sacred writ, how dare we forget to present our petition?\nFrom this day of the present month, we reverently heed the imperial edict, solemnly conducting the Jade Register Salvation Grand Fast for several days and nights.\nWe transcribe our words to convey our earnest devotion, invoking the descent of perfected ones and summoning numinous powers.\nWe unfurl the tenfold resplendent banners of transcendence and kindle the nine-cup ritual torches.\nWe dissolve obstructions and stagnations, dispelling and extinguishing karmic transgressions.\nWe deliver and uplift all bearing form, raising them to the luminous realms.\nLike sunflowers, our sincerity is laid bare in petition; we bask in the radiance of the Three Realms.\nLike wind-borne sacred seals, we open the Nine Hells and command the qi.\n\nOur gratitude is boundless, etched into bone beyond measure.\nNow, with the rites completed and felicitous affairs concluded, the fast’s merit is fulfilled.\nHeaven and humanity rejoice as one; the hidden and manifest realms exult together.\nFeathered canopies flutter as the jade chariot’s retinue prepares to depart;\nTiger banners wreathe in mist as the ranks of the guarded paths are withdrawn.\nWe humbly submit our merits in accord with the ritual protocols, petitioning for the conferral of rewards as pledged.\n\nWe implore the Mysterious Vault’s Most Sagely, the August Ultimate’s Primordial Venerable:\nDeign to look upon our earnest supplications and graciously bestow your discerning regard.\n\nOn the day of establishing the fast, we invoke the officials of the Three Caverns and the perfected numina of the Nine Heavens to oversee the fast, guard the true, attend the scriptures, and protect the Dao. The void-spanning overseers and the local deities of the earth—all arrayed in vigilant service—secure the merit of the fast with solemn toil and achievement. Thus, before the Mysterious Altar, we present our offerings, aspiring to requite boundless grace with commensurate devotion.\n\nYet we, in our mindfulness, remain imperfect; our reverence, though earnest, is incomplete. We fear the scrutiny of the Five Emperors and Four Bureaus, lest our myriad transgressions and innumerable faults be fully recorded. We can only hope for the vastness of your compassion, that we may universally receive your forbearance and pardon.\n\nWith utmost trepidation and awe, we prostrate ourselves, bowing our heads to the ground, and humbly submit this petition for your attention.\n\nWe declare the merit manifest,\noffer incense to the memorial,\nignite the ritual pyre,\nannounce the petition’s passage,\ndispatch the returning missives,\nand send forth the officials as prescribed.\n\nWe solemnly dispatch the Five Visceral Perfected Officials within our body, one minor scribe, and twelve recording assistants, along with the urgently commissioned Merit-Envoys and Flying Dragon Couriers. Adorned in formal vestments, their caps and pendants in perfect array, they grind ink, ready their brushes, gird their swords, and order the registers. They shall, on our behalf, bear this memorial in timely fashion to the courts of the Three Heavens, where they will present and respond to each matter as it arises.\n\nShould there be errors in the text, omissions in the words, or disarray in the sequence, we request that the transmitting scribes, the practiced minor officials, wielding dragon-headed writing knives and long, sharp brushes, correct and amend the faults on the spot. Let no supervising officer find cause for reproach, that the memorial may proceed directly to the presence of the Most High before the Boundless Dao of the Three Heavens, without delay or obstruction.\n\nThe left scribes shall pass through the gates in order; the right scribes shall present the petitions in sequence. Thus, may all we have requested descend, all we have summoned arrive, all we have aided be delivered, all we have proclaimed be made known, all we have promoted be advanced, all we have wished be fulfilled, and all we have sought be obtained.\n\nIf any subordinate official, through obstructive qi, should intercept or block our memorial from reaching the heavens, let them be seized and delivered to the nearest prison, there to be punished according to the celestial statutes, that the authority of heaven be made manifest.\n\nWe now withdraw and prostrate ourselves before the desk, awaiting the response.\n\nThe officials are received back as prescribed.\n\nWith the rites of sincere devotion now concluded, and from the very inception of the fast, all the Merit-Envoys, Perfected Officials, Immortal Lords, and celestial soldiers dispatched from within our body shall return to us, entering through the Gates of Myriad Mysteries. Those who departed from the left shall return to the left; those from the right, to the right. The Day-Officer of Merit shall resume command and oversight, returning to their original station. Let no confusion arise, that when summoned again, they may arrive as before, in accordance with established precedent.\n\nWe offer thanks and repay virtue to the Heavenly Worthy.\nWe circumambulate once in reverence.\n\nThe Master stands in the east, facing west; the assembly stands in the west, facing east, all kneeling.\nThe precepts are expounded, then received in long kneeling, and the return of the precepts is conducted as prescribed.\n\nWe, Your servants, have not yet mastered the Daoist arts—our bearing and movements fail to meet the standards, our advances and retreats violate the regulations, and our conduct does not accord with ritual form. We fear being cited by the Four Administrators, seized by the Five Emperors, and burdened with a thousand transgressions and ten thousand faults. We humbly beg Your mercy and forgiveness. Though our origins remain unenlightened, may we not incur punishment.\n\nAt the inception of this fast, we reverently invoked the Ten Precepts of Supreme Wisdom, ascending the fast’s prohibitions to discipline body and mind. Now that the ritual is concluded, we take leave and return them to the Heavenly Palace.\n\nWe respectfully submit this report for Your hearing, prostrating ourselves in hope of Your gracious pardon.\n\nWith utmost reverence and awe, we bow our heads to the ground, kowtowing twice in submission.\n\nThe Return-of-Precepts Hymn is recited; all return to their positions and bow once.\nThe Three Tablets are proclaimed; the tablets are cast.\nAt the sounding of the qing-bell, the Five Dragons rise to guard the Heavenly Worthy.\n\nRising to guard,\nwe make our vows.\nWe visualize the deities and offer incense.\n\nMay the Incense-Official Envoys, the Lords of the Left and Right Dragon-Tiger, and all the spirit-officials attendant upon the incense ensure that where we have dissolved the altar and dispersed the sacred seat, golden liquid, cinnabar, and azure mushrooms naturally arise. May the hundred numinous Perfected and assembled spirits gather here before the incense burner.\n\nMay our virtuous merit be universally abundant, and the blessings of this fast fully realized. May the jade maidens and immortal youths of the ten directions attend the orchid-scented smoke, conveying the sincerity of our supplications swiftly to the Most Perfect and Boundless Dao of the Three Clarities, the Supreme Sages, the Jade Emperor of the Golden Portal of the Vast Heaven, and the Merciful Lord of the Eastern Ultimate and the Azure Mystery before the Dao.\n\nThe Dissolution-of-Altar Hymn is recited.\nDescending from the altar, we take leave of the Three Treasures.\n\nThe light of time swiftly passes, the sun’s shadow gradually shifts.\nIncense scatters like jade blossoms, the Dao returns to the Golden Portal.\nMay the imperial realm endure as earth, the sage’s lifespan stretch as heaven.\nWith harmonious reverence, we bow and take leave of the Treasures of the Dao in the ten directions.\nGolden youths present our merits, jade maidens record our deeds.\nNames inscribed on golden tablets, sutras stored in jeweled repositories.\nSpirits ascend and attain liberation, households and nations receive grace.\nThe Sage enters emptiness and non-being, merit suffuses the hidden and manifest.\nWith harmonious reverence, we bow and take leave of the Treasured Scriptures in the ten directions.\nJade bells cease their chime, jasper chimes fall silent.\nThe master returns to the Great Clarity, his name inscribed in the Purple Court.\nThe three paths of suffering end their reckoning, the five torments halt their turning.\nWith harmonious reverence, we bow and take leave of the Treasured Masters in the ten directions.\nMay all sentient beings refrain from all evil and practice all virtues.\nMay they not fall into karmic entanglements but ever dwell in prosperous ages.\nMay all beings with consciousness together realize non-action.\nWith harmonious reverence, we bow and take leave of the Sages in the ten directions.\nThe *Jade Register* Rite for Liberation and Dissolution of the Altar is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "玉箓资度解坛仪 经名：玉箓资度解坛仪。 一卷。 底本出处：《正统道藏》洞玄部威仪类。 玉箓资度解坛仪 法事如式 各礼师，存念如法 请宣神咒 五灵列位，焕镇五方。 始皇护魂，丹老卫形。 皓灵侍魄，黑帝摄生。 中央黄帝，统御万真。 元皇诰下，幽夜开光。 罪消北府，名列南昌。 金箓定籍，玉字除殃。 朱陵炼质，飞神太仓。 三官九府，无极神乡。 普受开度，上生天堂。 和与道合真。 鸣法鼓二十四通 无上三天玄元始三炁太上道君、太上老君，召出臣身中三五功曹、左右官使者、左右捧香驿龙骑吏、侍香金童、传言散花玉女、五帝直符直日香官，各三十六人出。 出者，严装显服，冠带垂缨。 关启玄坛土地，方域神真。 臣今解坛言功，焚香礼忏，谨奏为入意其诸斋悃，已录告闻。 愿得太上至真道炁灵宝慧光下降，流入臣等身中，令臣所启之诚，速达径御至真无极大道三清上圣昊天金阙玉皇上帝、东极慈尊青玄上帝道前。 请称法位 具位臣姓某等今故烧香，皈身皈神皈命，太上十方救苦无上慈尊。 臣闻三箓垂科，五篇着范。 茂弘道旨，丕阐玄风。 法天像地而肇建坛仪，呼阴召阳而镇安云篆。 千真降驾，万圣临轩。 斋盟上格於层霄，真驭下临於法席。 用资某灵，升真天府，证品仙阶。 今则启愿告成，朝修事竟，解坛散席，首过言功，荐冀洪恩，尊安宗社。 金龙起篆，庆圆满於醮功； 玉纬流光，降洪厖於景福。 所启玄感，上彻径御至真无极道前。 知磬举，起敬赞 十方号 礼足，各长跪，虔诚忏悔 臣法众等志心皈身皈神皈命，十方救苦无上慈尊。 恭望洪慈，洞垂巨泽，普降洪恩。 以今解坛散席，焚香礼忏。 臣闻，三天播泽，灵光舒化育之仁； 九地承恩，祖炁运迁神之德。 荷宸恩之鉴映，幸斋法之周圆。 庸罄丹忱，仰干洪造。 重念臣等精神混俗，容止生尘。 玉律昭回，凛三元之校录； 金科错落，严四极之条章。 直冀隆宽，恪垂涵育。 陶灵光於九轨，誓畅玄宗； 流法雨於三途，愿隆圣造。 臣等志心稽首，礼谢无上至真三宝。 三启 三礼",
      "translated_text": "*The Jade Register Ritual for Deliverance and Dismantling the Altar*\n\n**Scripture Title:** *Jade Register Ritual for Deliverance and Dismantling the Altar*\nOne fascicle.\nSource text: *Daoist Canon of the Zhengtong Era*, Dongxuan Section, Category of Dignified Rituals.\n\n---\n\n**Jade Register Ritual for Deliverance and Dismantling the Altar**\nThe ritual proceeds according to form.\nAll bow to the master, contemplating as prescribed.\n\n**Invocation of the Divine Incantation:**\nThe Five Numinous Ones array their positions, resplendent in guarding the five directions.\nThe First Sovereign shields the soul; the Cinnabar Elder protects the form.\nThe Radiant Spirit attends the po; the Dark Emperor sustains life.\nThe Yellow Emperor of the Center governs the myriad perfected.\nThe Primordial August One issues the decree, illuminating the dark night with light.\nSins dissolve in the Northern Bureau; names are inscribed in the Southern Prosperity.\nThe Golden Register fixes the ledger; the Jade Script dispels calamity.\nThe Scarlet Mound refines the substance; the spirit soars to the Great Granary.\nThe Three Officials and Nine Bureaus, the boundless divine realm—\nAll universally receive deliverance, ascending to the celestial halls.\nHarmony unites with the Dao, merging with the true.\n\n**Strike the ritual drum twenty-four times.**\n\nO Most High Three Heavens, Mysterious Primordial Three *Qi* of the Supreme Dao Lord,\nO Most High Lord Lao, summon forth from within this servant’s body:\nThe Three and Five Merit Officers,\nThe Left and Right Attendant Messengers,\nThe Left and Right Fragrant-Bearing Dragon-Riding Couriers,\nThe Golden Lads Attending Incense,\nThe Jade Maidens Scattering Flowers,\nThe Five Thearchs’ Direct Talismans and Daily Incense Officials—\nthirty-six each.\nLet them emerge, adorned in solemn vestments, crowned and sashed with hanging tassels.\nSummon the local earth deities and territorial spirits of the numinous altar.\nThis servant now dismantles the altar and declares the merit, burning incense and offering repentance.\nReverently, I submit this petition for the intentions of the present retreat, already recorded and reported.\nMay the luminous *qi* of the Most High Perfected Dao and the radiant light of the Numinous Treasure descend,\nflowing into the bodies of this servant and all present,\nso that the sincerity of this servant’s invocation swiftly reaches the presence of the Perfected, Boundless, and Supreme Dao—\nthe Three Clarities, the August Heavenly Golden Portal Jade Emperor,\nand the Eastern Ultimate Compassionate Honored One, the Azure Mystery Emperor—\nbefore the Dao.\n\n**Recite the dharma titles:**\nThis humble servant, [Name] and company, now burn incense,\ndevoting body, spirit, and life to the Most High Compassionate Honored One, Savior of the Ten Directions.\n\nThis servant has heard:\nThe Three Registers transmit the statutes; the Five Chapters establish the model.\nThe majestic Dao’s intent is magnified; the profound wind is grandly propagated.\nModeling heaven and earth, the altar rites were first established;\nsummoning yin and calling yang, cloud-script is stabilized and pacified.\nA thousand perfected descend in chariots; ten thousand sages attend the audience hall.\nThe retreat’s vows ascend to the layered heavens; the true chariots descend to the dharma seat.\nTo aid [Name]’s spirit, ascend to the celestial palace, and verify rank upon the immortal steps.\nNow, as the vows are fulfilled and the morning rites conclude,\nthe altar is dismantled, the assembly dispersed.\nFirst, faults are confessed, merits declared,\nofferings made in hope of vast grace,\nand reverence paid to the ancestral altars.\nGolden dragons rise in script; the jiao rites’ blessings reach perfection.\nJade wefts stream with light, bestowing boundless blessings upon the glorious fortune.\nMay the numinous response of this invocation swiftly ascend to the presence of the Perfected, Boundless, and Supreme Dao.\n\n**At the sound of the chime, rise and offer reverent praise.**\n\n**Chant the Ten Directions’ Titles.**\nBow, touch the ground, and kneel in prolonged reverence, repenting with utmost sincerity.\n\nThis assembly of ritualists, with devoted hearts,\ndevotes body, spirit, and life to the Compassionate Honored One, Savior of the Ten Directions.\nReverently, we gaze upon your vast compassion,\nhoping for the outpouring of great blessings and the universal bestowal of boundless grace.\nNow, as the altar is dismantled and the assembly dispersed,\nwe burn incense and offer repentance.\n\nThis servant has heard:\nThe Three Heavens spread their blessings, the numinous light extending the kindness of nurturing transformation;\nthe Nine Lands receive grace, the ancestral *qi* conveying the power of spiritual transmigration.\nBearing the imperial favor’s radiant reflection,\nwe are fortunate that the retreat’s dharma has come full circle.\nHumbly, we exhaust our sincere hearts, looking up to the vast creation.\n\nYet again, we reflect:\nOur spirits are entangled in the mundane; our bearing gathers dust.\nThe jade laws revolve in splendor, sternly recording the Three Primes’ judgments;\nthe golden statutes are intricate, rigorously enforcing the Four Poles’ regulations.\nWe can only hope for your magnanimous forbearance, your reverent bestowal of nurturing care.\nMay the numinous light be cultivated across the nine paths, vowing to propagate the profound tradition;\nmay the dharma rain flow through the three destinies, wishing to exalt the sagely creation.\n\nThis assembly, with devoted hearts, bows and prostrates,\noffering thanks to the Most High Perfected Three Treasures.\n\n**Three invocations.**\n**Three bows.**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 814,
      "start_sentence": 0,
      "end_sentence": 55,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.46407222747803,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓资度解坛仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "重称法位 具位臣姓某与临坛法众等，谨同诚上启青玄祖炁虚无自然元始天尊，太上道君，太上老君，昊天玉皇上帝，紫微天皇大帝，紫微北极大帝，后土皇地祇，东极青玄老君，运明保元上帝，太乙救苦天尊，九幽拔罪天尊，十方分身应化救苦天尊，大慈大悲救苦真人、大惠真人、注生真人、香林会中法解真人、十华真人、普救真人，三十六部尊经，玄中大法师，三天大法师、三界应感，醮筵降格，一切威灵。 臣等野马微生，酰鸡陋质。 荷九宸之锡庆，际三洞之开光。",
      "translated_text": "Again invoking the dharma-ranks, we, your humble servants—[Name] and the assembled ritualists at the altar—with unified sincerity, reverently address and supplicate:\n\nThe Primordial Celestial Worthy of Numinous Treasure of the Void and Spontaneous Origin, the Most High Dao Lord, the Most High Lord Lao, the Jade Emperor of August Heaven, the Great Emperor of the Purple Tenuity, the Great Emperor of the Northern Culmen of the Purple Tenuity, the August Earth Spirit of the Rear Soil, the Elder Lord of the Eastern Culmen of the Azure Mystery, the August Thearch Who Circulates Brightness and Preserves the Origin, the Celestial Worthy of Great Compassion Who Saves from Suffering, the Celestial Worthy Who Delivers from the Nine Hells of Sin, the Manifested and Transformed Celestial Worthies of the Ten Directions Who Save from Suffering, the Most Compassionate and Greatly Merciful Perfected of Salvation, the Perfected of Great Kindness, the Perfected Who Registers Births, the Perfected of the Fragrant Grove Assembly Who Releases from Dharma-Bonds, the Tenfold Radiant Perfected, the Universally Saving Perfected, the Thirty-Six Divisions of Venerable Scriptures, the Great Dharma-Masters of the Mysterious Center, the Great Dharma-Masters of the Three Heavens, and all numinous powers responsive to the ritual altar’s descent—\n\nWe, mere motes of dust and humble mayflies, bear the blessings bestowed by the Nine Celestial Thrones and stand at the radiant unfolding of the Three Caverns.",
      "overlap_context": "te, rigorously enforcing the Four Poles’ regulations.\nWe can only hope for your magnanimous forbearance, your reverent bestowal of nurturing care.\nMay the numinous light be cultivated across the nine paths, vowing to propagate the profound tradition;\nmay the dharma rain flow through the three destinies, wishing to exalt the sagely creation.\n\nThis assembly, with devoted hearts, bows and prostrates,\noffering thanks to the Most High Perfected Three Treasures.\n\n**Three invocations.**\n**Three bows.**",
      "start_char": 814,
      "end_char": 1027,
      "start_sentence": 56,
      "end_sentence": 59,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.925220489501953,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓资度解坛仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "身绾金符，名联玉籍。 烟霞摄景，盍抗志於清虚； 日月同流，乃栖身於埃。 百非未涤，万业犹羁。 缅惟受道之丹忱，常励济时之素誓。 庶俾化育，不负生成。 既奉词文，敢忘关奏。 臣自今月某日为始，钦奉纶音，崇修玉箓资度大斋几昼夜。 誊词达悃，降真召灵。 扬十绝之华旛，然九卮之法炬。 解消结滞，落灭冤愆。 拯度容仪，超升阳境。 葵忱露奏，荷三境以流辉； 芝检风驰，开九幽而御炁。 铭心罔极，刻骨奚殚。 以今厘事庆成，斋功告备。 天人同庆，幽显相欢。 羽葆翩翻，将返琼舆之仗； 虎旌晻蔼，行收禁路之班。 盍依格以奏功，为关盟而迁赏。 恩惟玄穹至圣，皇极元尊。 俯览恳祈，曲垂采鉴。",
      "translated_text": "Clad in golden talismans, our names inscribed in jade registers.\nClouds and mist gather the radiance—how could we not lift our aspirations to the pure and void?\nSun and moon course as one, yet we dwell amid the dust of the world.\nA hundred transgressions remain unwashed, ten thousand karmic bonds still fetter us.\nRecalling the cinnabar sincerity of our Dao-reception, we ever renew our primal vow to succor the age.\nMay we thus aid in transformation and nurturance, not betraying the gift of life and growth.\n\nHaving received the sacred writ, how dare we forget to present our petition?\nFrom this day of the present month, we reverently heed the imperial edict, solemnly conducting the Jade Register Salvation Grand Fast for several days and nights.\nWe transcribe our words to convey our earnest devotion, invoking the descent of perfected ones and summoning numinous powers.\nWe unfurl the tenfold resplendent banners of transcendence and kindle the nine-cup ritual torches.\nWe dissolve obstructions and stagnations, dispelling and extinguishing karmic transgressions.\nWe deliver and uplift all bearing form, raising them to the luminous realms.\nLike sunflowers, our sincerity is laid bare in petition; we bask in the radiance of the Three Realms.\nLike wind-borne sacred seals, we open the Nine Hells and command the qi.\n\nOur gratitude is boundless, etched into bone beyond measure.\nNow, with the rites completed and felicitous affairs concluded, the fast’s merit is fulfilled.\nHeaven and humanity rejoice as one; the hidden and manifest realms exult together.\nFeathered canopies flutter as the jade chariot’s retinue prepares to depart;\nTiger banners wreathe in mist as the ranks of the guarded paths are withdrawn.\nWe humbly submit our merits in accord with the ritual protocols, petitioning for the conferral of rewards as pledged.\n\nWe implore the Mysterious Vault’s Most Sagely, the August Ultimate’s Primordial Venerable:\nDeign to look upon our earnest supplications and graciously bestow your discerning regard.",
      "overlap_context": "f the Fragrant Grove Assembly Who Releases from Dharma-Bonds, the Tenfold Radiant Perfected, the Universally Saving Perfected, the Thirty-Six Divisions of Venerable Scriptures, the Great Dharma-Masters of the Mysterious Center, the Great Dharma-Masters of the Three Heavens, and all numinous powers responsive to the ritual altar’s descent—\n\nWe, mere motes of dust and humble mayflies, bear the blessings bestowed by the Nine Celestial Thrones and stand at the radiant unfolding of the Three Caverns.",
      "start_char": 1027,
      "end_char": 1293,
      "start_sentence": 60,
      "end_sentence": 81,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.93692421913147,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓资度解坛仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "其有建斋之日，上请三洞官属、九天真灵，监斋卫真，侍经护道，虚空监察，土地神祇，营卫斋功，具严劳绩。 即玄坛而相表，希洪造以酬恩。 臣等存念不周，俯仰未备。 有五帝四司之校录，虑千愆万过之充周。 等冀隆慈，普蒙矜宥。 臣诚惶诚恐，稽首顿首，谨启以闻 宣言功表 熏表 焚燎 宣关 宣回将牒 遣官如法 谨遣臣等身中五体真官、官一小吏、十二书佐，重敕功曹使者、飞龙驿吏，严装显服，冠带垂缨，磨砚点笔，簪剑理箓，为臣及时操持表文，上诣三天曹治，随事奏对。 若有谬误文字，脱落言辞，倒错不相次比者，请传言书佐，习事小吏，操龙头书刀，长毫利笔，随误正定。 毋令上官典者有所遣郄，径达三天无极大道太上御前，慎勿稽停。 左吏历关，右吏历启，以次分别，当令臣所请者下，所召者到，所济者度，所宣者通，所迁者达，所愿者应，所求者得。 若有下官故炁，遏截臣表文不使上达者，收付所在近狱，依律治罪，以明天宪。 臣退伏案前，伏待报应。 纳官如法 臣通诚事竟，及建斋之始，所出身中功曹使者、一切真官、仙君吏兵，并还臣身中，从众妙门而入，在左还左，在右还右。 直日功曹，主领检押，还复本位。 毋令差互，须召又到，一如故事。 还功报德天尊 旋绕一匝",
      "translated_text": "On the day of establishing the fast, we invoke the officials of the Three Caverns and the perfected numina of the Nine Heavens to oversee the fast, guard the true, attend the scriptures, and protect the Dao. The void-spanning overseers and the local deities of the earth—all arrayed in vigilant service—secure the merit of the fast with solemn toil and achievement. Thus, before the Mysterious Altar, we present our offerings, aspiring to requite boundless grace with commensurate devotion.\n\nYet we, in our mindfulness, remain imperfect; our reverence, though earnest, is incomplete. We fear the scrutiny of the Five Emperors and Four Bureaus, lest our myriad transgressions and innumerable faults be fully recorded. We can only hope for the vastness of your compassion, that we may universally receive your forbearance and pardon.\n\nWith utmost trepidation and awe, we prostrate ourselves, bowing our heads to the ground, and humbly submit this petition for your attention.\n\nWe declare the merit manifest,\noffer incense to the memorial,\nignite the ritual pyre,\nannounce the petition’s passage,\ndispatch the returning missives,\nand send forth the officials as prescribed.\n\nWe solemnly dispatch the Five Visceral Perfected Officials within our body, one minor scribe, and twelve recording assistants, along with the urgently commissioned Merit-Envoys and Flying Dragon Couriers. Adorned in formal vestments, their caps and pendants in perfect array, they grind ink, ready their brushes, gird their swords, and order the registers. They shall, on our behalf, bear this memorial in timely fashion to the courts of the Three Heavens, where they will present and respond to each matter as it arises.\n\nShould there be errors in the text, omissions in the words, or disarray in the sequence, we request that the transmitting scribes, the practiced minor officials, wielding dragon-headed writing knives and long, sharp brushes, correct and amend the faults on the spot. Let no supervising officer find cause for reproach, that the memorial may proceed directly to the presence of the Most High before the Boundless Dao of the Three Heavens, without delay or obstruction.\n\nThe left scribes shall pass through the gates in order; the right scribes shall present the petitions in sequence. Thus, may all we have requested descend, all we have summoned arrive, all we have aided be delivered, all we have proclaimed be made known, all we have promoted be advanced, all we have wished be fulfilled, and all we have sought be obtained.\n\nIf any subordinate official, through obstructive qi, should intercept or block our memorial from reaching the heavens, let them be seized and delivered to the nearest prison, there to be punished according to the celestial statutes, that the authority of heaven be made manifest.\n\nWe now withdraw and prostrate ourselves before the desk, awaiting the response.\n\nThe officials are received back as prescribed.\n\nWith the rites of sincere devotion now concluded, and from the very inception of the fast, all the Merit-Envoys, Perfected Officials, Immortal Lords, and celestial soldiers dispatched from within our body shall return to us, entering through the Gates of Myriad Mysteries. Those who departed from the left shall return to the left; those from the right, to the right. The Day-Officer of Merit shall resume command and oversight, returning to their original station. Let no confusion arise, that when summoned again, they may arrive as before, in accordance with established precedent.\n\nWe offer thanks and repay virtue to the Heavenly Worthy.\nWe circumambulate once in reverence.",
      "overlap_context": " hidden and manifest realms exult together.\nFeathered canopies flutter as the jade chariot’s retinue prepares to depart;\nTiger banners wreathe in mist as the ranks of the guarded paths are withdrawn.\nWe humbly submit our merits in accord with the ritual protocols, petitioning for the conferral of rewards as pledged.\n\nWe implore the Mysterious Vault’s Most Sagely, the August Ultimate’s Primordial Venerable:\nDeign to look upon our earnest supplications and graciously bestow your discerning regard.",
      "start_char": 1293,
      "end_char": 1810,
      "start_sentence": 82,
      "end_sentence": 105,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.054868936538696,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓资度解坛仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "师立东，面西 众立西，面东，皆跪 讲举，长跪，还戒如法 臣等学法未备，俯仰失格，进止犯科，不合仪式。 恐为四司所纠，五帝所执，千愆万过，乞垂赦宥。 哀原未悟，不见罪罚。 臣等建斋之初，奉请智慧上品十戒，登斋禁戒，以检身心。 法事既竟，谒还天宫。 谨上启以闻，伏希昭宥。 臣等诚惶诚恐，稽首顿首，再拜谨言。 举还戒颂，归位一拜 宣三简 投简毕 知磬举，五龙起镇天尊 起镇 发愿 存神烧香 香官使者、左右龙虎君、侍香诸灵官，当令臣向来解坛散席芝所，自然生金液丹碧芝英。 百灵众真，交会在此，香火炉前。 当愿善功普博，斋福周隆。 十方仙童玉女，接侍兰烟，传臣向来所启之诚，速达径御至真无极大道三清上圣、昊天金阙玉皇上帝、东极慈尊青玄上帝道前。 解坛颂 下坛，辞三宝",
      "translated_text": "The Master stands in the east, facing west; the assembly stands in the west, facing east, all kneeling.\nThe precepts are expounded, then received in long kneeling, and the return of the precepts is conducted as prescribed.\n\nWe, Your servants, have not yet mastered the Daoist arts—our bearing and movements fail to meet the standards, our advances and retreats violate the regulations, and our conduct does not accord with ritual form. We fear being cited by the Four Administrators, seized by the Five Emperors, and burdened with a thousand transgressions and ten thousand faults. We humbly beg Your mercy and forgiveness. Though our origins remain unenlightened, may we not incur punishment.\n\nAt the inception of this fast, we reverently invoked the Ten Precepts of Supreme Wisdom, ascending the fast’s prohibitions to discipline body and mind. Now that the ritual is concluded, we take leave and return them to the Heavenly Palace.\n\nWe respectfully submit this report for Your hearing, prostrating ourselves in hope of Your gracious pardon.\n\nWith utmost reverence and awe, we bow our heads to the ground, kowtowing twice in submission.\n\nThe Return-of-Precepts Hymn is recited; all return to their positions and bow once.\nThe Three Tablets are proclaimed; the tablets are cast.\nAt the sounding of the qing-bell, the Five Dragons rise to guard the Heavenly Worthy.\n\nRising to guard,\nwe make our vows.\nWe visualize the deities and offer incense.\n\nMay the Incense-Official Envoys, the Lords of the Left and Right Dragon-Tiger, and all the spirit-officials attendant upon the incense ensure that where we have dissolved the altar and dispersed the sacred seat, golden liquid, cinnabar, and azure mushrooms naturally arise. May the hundred numinous Perfected and assembled spirits gather here before the incense burner.\n\nMay our virtuous merit be universally abundant, and the blessings of this fast fully realized. May the jade maidens and immortal youths of the ten directions attend the orchid-scented smoke, conveying the sincerity of our supplications swiftly to the Most Perfect and Boundless Dao of the Three Clarities, the Supreme Sages, the Jade Emperor of the Golden Portal of the Vast Heaven, and the Merciful Lord of the Eastern Ultimate and the Azure Mystery before the Dao.\n\nThe Dissolution-of-Altar Hymn is recited.\nDescending from the altar, we take leave of the Three Treasures.",
      "overlap_context": "ched from within our body shall return to us, entering through the Gates of Myriad Mysteries. Those who departed from the left shall return to the left; those from the right, to the right. The Day-Officer of Merit shall resume command and oversight, returning to their original station. Let no confusion arise, that when summoned again, they may arrive as before, in accordance with established precedent.\n\nWe offer thanks and repay virtue to the Heavenly Worthy.\nWe circumambulate once in reverence.",
      "start_char": 1810,
      "end_char": 2159,
      "start_sentence": 106,
      "end_sentence": 128,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.816620349884033,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓资度解坛仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "时光迅速，日影渐移。 香散玉华，道还金阙。 皇图地久，圣寿天长。 和稽首拜辞，十方道宝。 金童进善，玉女奏功。 名挂金牌，经藏宝辍。 神灵升度，家国蒙恩。 圣入虚无，功沾幽显。 和稽首拜辞，十方经宝。 琼钟息响，璧磬收声。 师返太清，名标紫府。 三途罢对，五苦停轮。 和稽首拜辞，十方师宝。 愿诸众生，诸恶莫作，众善奉行。 不堕劫缘，常居盛世。 有情含识，同证无为。 和稽首拜辞，十方众圣。 玉箓资度解坛仪竟",
      "translated_text": "The light of time swiftly passes, the sun’s shadow gradually shifts.\nIncense scatters like jade blossoms, the Dao returns to the Golden Portal.\nMay the imperial realm endure as earth, the sage’s lifespan stretch as heaven.\nWith harmonious reverence, we bow and take leave of the Treasures of the Dao in the ten directions.\nGolden youths present our merits, jade maidens record our deeds.\nNames inscribed on golden tablets, sutras stored in jeweled repositories.\nSpirits ascend and attain liberation, households and nations receive grace.\nThe Sage enters emptiness and non-being, merit suffuses the hidden and manifest.\nWith harmonious reverence, we bow and take leave of the Treasured Scriptures in the ten directions.\nJade bells cease their chime, jasper chimes fall silent.\nThe master returns to the Great Clarity, his name inscribed in the Purple Court.\nThe three paths of suffering end their reckoning, the five torments halt their turning.\nWith harmonious reverence, we bow and take leave of the Treasured Masters in the ten directions.\nMay all sentient beings refrain from all evil and practice all virtues.\nMay they not fall into karmic entanglements but ever dwell in prosperous ages.\nMay all beings with consciousness together realize non-action.\nWith harmonious reverence, we bow and take leave of the Sages in the ten directions.\nThe *Jade Register* Rite for Liberation and Dissolution of the Altar is now complete.",
      "overlap_context": "fast fully realized. May the jade maidens and immortal youths of the ten directions attend the orchid-scented smoke, conveying the sincerity of our supplications swiftly to the Most Perfect and Boundless Dao of the Three Clarities, the Supreme Sages, the Jade Emperor of the Golden Portal of the Vast Heaven, and the Merciful Lord of the Eastern Ultimate and the Azure Mystery before the Dao.\n\nThe Dissolution-of-Altar Hymn is recited.\nDescending from the altar, we take leave of the Three Treasures.",
      "start_char": 2159,
      "end_char": 2361,
      "start_sentence": 129,
      "end_sentence": 146,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.788931846618652,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓资度解坛仪.txt",
        "category": "威仪类"
      }
    }
  ]
}