{
  "source_id": "玉箓大斋三日九朝仪",
  "source_file": "chunked_daozang\\玉箓大斋三日九朝仪.json",
  "total_chunks": 22,
  "total_original_chars": 14928,
  "total_translated_chars": 94060,
  "total_translation_time": 510.51431918144226,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓大斋三日九朝仪.txt",
    "category": "威仪类"
  },
  "full_translation": "The *Jade Register Three-Day Nine-Morning Ritual*\nText Title: *Jade Register Three-Day Nine-Morning Ritual*\nThree fascicles.\nSource text: *Zhengtong Daoist Canon*, Dongxuan Section, Wei Yi (Ritual Propriety) Category.\n\n**First Day Early Morning Ritual of the Jade Register Grand Fast**\n\nAll pay homage to the master and maintain mindfulness as prescribed:\n\nGolden Perfection and Verdant Radiance illumine the Three Heavens,\nCrimson clouds soar through the Cinnabar Empyrean—all heavens guide their chariots.\nMorning brilliance unfolds the dawn, dispelling yin’s shadows entirely.\nThe Nine Subtleties shake the void; the Five Stars revolve.\nMyriad heavens respond in resonance, naturally wondrous and profound.\nIn the distant dark, the body disperses, dividing into a hundred thousand forms.\nThe Mystic Pearl shines resplendent; auspicious *qi* fills the altar’s firmament.\nThe hidden and manifest receive grace, refined by the Golden Spring’s flow.\nDemon kings tremble in fear; the Three Fields merge in radiant harmony.\n\n**Kindling the Incense Burner**\nStrike the ritual drum twenty-four times.\n\nO Most High Three Heavens, Mysterious Primordial Three *Qi*, Supreme Venerable Lord Lao, summon forth from within my body the Three and Five Merit Officers, the Left and Right Attendant Messengers, the Left and Right Incense-Bearing Golden Lads, the Jade Maidens who convey words and scatter flowers, and the Five Thearchs’ Direct Talismans and Daily Incense Officials—thirty-six of each.\nLet them emerge, adorned in solemn attire, crowned and sashed with hanging tassels.\nNotify the Land Spirit of the Mystic Altar and the local deities and perfected ones.\nThis morning, I ascend the altar to perform the Dao, offering audience to the Imperial Perfected.\nWith reverence, I present my sincerest intentions, all recorded in sealed writ.\nMay the Supreme Perfected’s *Dao-qi*, the Numinous Treasure’s auspicious radiance descend,\nflowing into our bodies, that the sincerity of my petition swiftly reach\nthe presence of the Most High and Boundless Dao’s Three Pure Ones and August Saints,\nbefore the Golden Portal Jade Emperor, Supreme Lord of the Vast Heaven.\n\n**Proclaiming the Dharma Titles**\nAll present officials and altar assembly, with unified sincerity, reverently address:\n\nThe Primordial Heavenly Worthy of the Void and Spontaneous,\nThe Boundless Great Dao’s Supreme Lord of the Dao,\nThe Supreme Venerable Lord Lao,\nThe August Jade Emperor,\nThe Great Sage Perfected Ones of the Ten Directions who have attained the Dao,\nThe Lords and Masters of the Thirty-Two Heavens,\nThe Jade Clarity Emperor,\nThe Great Emperor of the Jade Thearch,\nThe Eastern Florescence, Southern Culmen, Western Numinous, Northern Perfected,\nThe Golden Portal of the Mystic Capital, the Seven-Treasure Jeweled Terrace of the Purple Tenuity Upper Palace,\nThe Numinous Treasure’s Supreme Clarity Radiant August Lord of the Dao,\nThe Thirty-Six Divisions of Venerable Scriptures,\nThe Great Dharma Masters of the Mystic Center,\nThe Supreme Ministers, Supreme Chancellors, Supreme Protectors, Supreme Tutors,\nThe Twenty-Four Perfected of the Great Peace’s Lesser Teaching,\nThe Lord King of Total Perfection of the Western City,\nThe Perfected of the Great One,\nThe Supreme Minister of the Eastern Marchmount,\nThe Lord Mao of Life Mandates,\nThe Two Perfected of Determined Records and Life Preservation,\nThe Divine Immortals who have attained the Dao in the sacred mountains and grotto-heavens,\nThe officials of the Three Realms,\nand all true numina.\n\nWe have heard:\nOne *qi* subtly congeals, merging at the inception of the empty and profound;\nThe Three Effulgences flourish luxuriantly, gestating at the dawn of the primordial vastness.\n\nThe sublime surpasses all speech, yet within it lies form.\nAbove, there is no further ancestry—only the Dao is its body.\nIt enfolds the Two Images to store the spirit,\nand gathers the Nine Heavens to govern all transformations.\nIt first gave rise to the *qi* of the Most High Jade Emperor,\nthe Great Brahmā of the Vast Net;\nFrom the primordial chaos of the Supreme Void,\nthe Red Script unfolded the expanse.\nIt unfolds and magnifies the most wondrous,\nparting and merging in spontaneity.\n\nWe, your servants, have long encountered the true wind\nand fortunately met with flourishing fortune.\nRiding the fair dawn to awakening and communion,\nwe humbly attend the divine scriptures;\nExposing our hearts to the radiant gaze,\nwe attain to the supreme model.\n\nIn all that we initiate,\nwe dare not fail to make known.\nWith sincere intent in our blue-green memorial,\nwe reverently present our petition.\nAs stated in the words of the memorial,\nwe do not deviate from our earnest plea.\n\nMay the Most High, in mercy, discern and heed our prayer.\n\nWe have heard:\nThe Most Venerable abides in profound stillness,\nwielding the unfathomable mechanism of yin and yang;\nThe wondrous realm floats in emptiness,\nstructuring the chamber where sun and moon swiftly course.\nCinnabar spirits dance,\nwhite cranes wheel in flight.\n\nWe, your servants, rise before dawn to greet the origin,\ndiligently seeking the mandate.\nThe Red Youth shines with radiance,\nguiding the flowing dawn of the Valley of Bestowal;\nThe Azure Elder scatters brilliance,\njoining the *qi* of life from the Wooden Palace.\nThree hues mingle in obscurity within the chamber,\na hundred spirits gather before the incense burner.\n\nWith reverence, we transmit the fragrance,\noffering the rites of the fast.\nOn this first day, at the clear dawn of the Dao-procession,\nwe, the assembly of the Dharma, invoke the first pinch of incense.\nMay this fragrant smoke ascend to the heavens,\ndirectly offering to the Primal Heavenly Worthy of the Void and Most True, the Natural and Great Dao.\n\nBy the merit of this pinch of incense,\nwe pray for the present emperor,\nwhose sacred longevity knows no bounds.\nMay his singular virtue reach heaven,\nand his mandate endure for ten thousand years.\nMay he receive the chart and grasp the tally,\nhis wise years equaling the brilliance of the Dipper and Weaver;\nMay he be granted felicity and welcome auspiciousness,\nhis blessed fortune as steadfast as the hills and mountains.\nMay his years extend beyond heaven’s reckoning,\nfar surpassing the vast kalpas.\nMay the Nine Provinces and Eight Wastes\nall attain benevolence and longevity.\nFor a thousand autumns and ten thousand generations,\nmay he long uphold prosperity and peace.\n\nThus, we now burn incense,\nand from this moment, take refuge in the Dao, the Venerable, the Great Sage Assembly,\nand the virtue of the Most True.\nAfter attaining the Dao,\nmay we preserve heaven and endure forever.\n\nWe have heard:\nPurple silk shines with splendor,\nas the Great Sage celebrates the assembly in the Forest of Auspiciousness;\nAuspicious light bears form,\nas the Jade Emperor illumines the orchid chamber’s glory.\nDispelling the dense shadows,\nit merges and harmonizes the ten thousand kinds.\n\nOn this first day, at the clear dawn of the Dao-procession,\nwe, the assembly of the Dharma, invoke the second pinch of incense.\nMay this fragrant smoke ascend to the heavens,\ndirectly offering to the Jade Dawn, the Most Sacred, the Natural and Numinous Treasure of the Great Dao, the Heavenly Worthy.\n\nBy the merit of this pinch of incense,\nwe pray for the ancestral shrines, the divine presences,\nand the true wanderings of the altars of soil and grain.\nMay they refine their essences on the cinnabar terrace,\nand delight their spirits in the Purple Ultimate.\nAt ease and free,\nmay they gaze upon the ancestral temples to store their essence;\nAttaining sageliness and achieving perfection,\nmay they ascend to the imperial homeland and enter the wondrous.\nMay blessings overflow the household and state,\nand grace extend throughout the realm.\n\nThus, we now burn incense,\nand from this moment, take refuge in the Scriptures, the Venerable, the Great Sage Assembly,\nand the virtue of the Most True.\nAfter attaining the Dao,\nmay we ascend into the formless.\n\nWe have heard:\nThe Mysterious Father and Mysterious Mother\ntransform the Three Fields of the Palace of Zi and Wu;\nThe True Radiance and True Essence\nreceive the *qi* of the Nine Heavens’ east and west movements.\nJade nectar flows and moistens,\nthe cinnabar chamber abides forever.\n\nOn this first day, at the clear dawn of the Dao-procession,\nwe, the assembly of the Dharma, invoke the third pinch of incense.\nMay this fragrant smoke ascend to the heavens,\ndirectly offering to the Primal Vast Great Sage, the Natural Lord of Transformation, the Heavenly Worthy of the Dao and Its Virtue.\n\nBy the merit of this pinch of incense,\nwe pray for the divine forms of those being offered.\nMay their Dao accord with non-action,\nand their hearts wander in the Supreme Simplicity.\nIn the Purple Tenuity’s true realm,\nmay they attend the supreme sages in the Nine [Heavens];\nIn the Azure Vault’s jade palace,\nmay they accompany the lofty immortals in the Three Realms.\nMay they feast on the terrace’s sounds in the empty [void],\nand [absorb] the *qi* of the Mysterious Origin.\nMay they bestow abundance upon later descendants,\nand root friendship for a hundred generations.\nMay they transmit blessings within the central禁,\nand their descendants flourish for a hundred million years.\n\nThus, we now burn incense,\nand from this moment, take refuge in the Masters, the Venerable, the Great Sage Assembly,\nand the virtue of the Most True.\nAfter attaining the Dao,\nmay we ascend into the formless.\n\nHarmonizing with the Dao, we unite with the true.\nThe rites are complete.\n\nConfession\n\nThrice we invoke, thrice we bow, and once more we intone the sacred titles. All those in attendance—officiants, altar officials, and the assembled—humbly and with one heart supplicate the Three Purities Most Revered, the Ten Directions’ Lofty Sages, the Heavenly Perfected of the Jade Capital and Golden Towers, the Celestial Emperors and Heavenly Immortals, the Ten Directions’ Masters and Sacred Assemblies, the officials of the Three Realms, and all majestic spirits.\n\nWe have heard that when the Azure Vault received the scriptures, all heavens resounded with praise; when the White Chariot opened the path, it traversed the Three Realms, and all listened. We, unworthy though we are of mortal endowment, have presumptuously aided the transformation of the Mysterious. We ought to nest our spirits in the realm of the Dao, to refine our truth by partaking of the empty azure, to sever ties with the dusty world, and to ascend lightly upon thoughts of the Cinnabar Splendor.\n\nAt the outset of this covenant, merit-making takes precedence. Thus, we expound the Dharma to deliver beings, vowing to assist Heaven and propagate its teachings. Moreover, in reverent compliance with the celestial mandate, we dutifully perform this rite. In honor of [the departed] since their passing, we recall their toil and boundless devotion, which Heaven itself cannot repay. Yearning for their true visage, we now offer this requiem.\n\nWe have specially summoned the feathered and flowing assembly to reverently conduct the Jade Register Retreat, opening the way for the divine presence to ascend to the Heavenly Palace. May their spirit transcend the Azure Vault and their essence be refined in the Cinnabar Court. May they wander the realm of purity, awaken to the boundless emptiness of the Dao, their names inscribed on the Jade Tablets, their rank established in the Jasper Palace.\n\nNext, we pray that the imperial Dao flourish afar, that the royal heir’s foundation endure. May sagely virtue equal that of Yao and Shun, and may the assisting ministers be as steadfast as Gao and Kui. May the sovereign’s longevity extend, and the frontiers remain tranquil. May all under Heaven share in the vast and boundless grace; may the Ten Lands and Nine Netherworlds alike partake in the joy of life and growth. Thus shall the radiance of the Heavenly Worthy’s great compassion be manifest above, and our devotion in taking refuge be fulfilled below.\n\nWe humbly present this supplication.\n\nTwelve Vows\nFirst, may the Three Honored Ones deign to witness.\nSecond, may the Five Elders bestow their radiance.\nThird, may the divine light shine resplendently.\nFourth, may the Nine Qi confer auspiciousness.\nFifth, may the Five Phases align with their course.\nSixth, may the sacred talismans take flight.\nSeventh, may Kan and Li conjoin their destiny.\nEighth, may the Nine Nights unfold their brilliance.\nNinth, may the Mysterious Altar respond with numinosity.\nTenth, may [the departed’s] name be inscribed in the Upper Firmament.\nEleventh, may the divine presence receive deliverance.\nTwelfth, may the nation’s destiny be prolonged.\n\nReplenishing the Censer\nConcentrating the spirit, we burn incense.\n\nIncense Official Messengers, Left and Right Dragon-Tiger Lords, and all Attendant Incense Spirits—may this place where we have this morning ascended the altar to perform the Dao now spontaneously generate golden liquid, cinnabar, and azure mushroom blossoms. May the hundred numinous perfected beings gather here before the incense burner. We pray that the jade maidens and immortal youths of the ten directions receive the orchid-scented smoke and swiftly convey the sincerity of our supplications directly to the Most Real and Boundless Dao, the Three Clarities, the August Supreme Sages, and the Jade Emperor of the Golden Gates and Jade Palace in the Lofty Heaven.\n\nThe First Day’s Morning Rites of the Jade Register Grand Fast are now concluded.\nThe First Day’s Noon Rites of the Jade Register Grand Fast\n\nAll pay homage to the masters and concentrate the spirit as prescribed.\nChanting the *Empty Cavern* hymns, the Celestial Lord guards the altar.\nThe Five Emperors review the records, receiving talismans from the Three Officials.\nThe four gates are secured, binding demons and expelling evil.\nFiery bells are cast, burning away yin impurities.\nThe body bears the golden script, refining the elixir and rejuvenating the countenance.\nMysterious and pure unite, the heart stirring the Three Passes.\nRiding lions and mounting cranes, controlling dragons and mounting simurghs.\nA myriad stars guard the abode, a thousand demons dare not intrude.\nThe Dao’s qi endures forever, all immortals are at peace.\n\nThe censer is kindled as before.\nThe dharma ranks are invoked.\n\nWe, the assembled officiants and altar attendants, with one heart humbly present this supplication to the Void and Spontaneous Primordial Heavenly Worthy of the Boundless Dao, the Supreme Lord of the Dao, the Most High Lord Lao, the August Jade Emperor, the perfected and sagely hosts of the ten directions who have attained the Dao, the Lords of the Thirty-Two Heavens, the Jade Void Emperor, the Great Emperor of the Jade Capital, the Eastern Flowery, Southern Culmen, Western Numinous, and Northern Perfected Lords of the Mysterious Capital, the Golden Gates, the Seven-Treasure Jeweled Terrace, and the Purple Tenuity Upper Palace, the Radiant Sovereign of the Numinous Treasure, the thirty-six divisions of revered scriptures, the Great Dharma Masters of the Mysterious Center, the Supreme Ministers, Supreme Stewards, Supreme Protectors, Supreme Transmitters, the Twenty-Four Perfected of the Great Peace’s Lesser Teaching, the King of Total Perfection of the Western City, the Perfected of the Great One, the Supreme Minister of the Eastern Peak, the Lord of Life, Lord Mao, the Two Perfected of Determined Record and Life Preservation, the divine immortals who have attained the Dao in the grotto-heavens and famous mountains, the officials of the Three Realms, and all true numina.\n\nWe have heard that the two luminaries contain the void, concealing numinous splendor before any sign appears; the nine heavens gather the Sanskrit, uniting wondrous qi with spontaneity. Before images and emperors, it stood solitary and silent. Above the Great Beginning, it was indistinct and nameless. Blending the three colors into profound communion, it coagulated the one spirit to generate transformation. Dividing the supreme qi of the Jade Void, it thickened into the *Dongzhang* scriptures; originating the primordial crimson chaos of the Great Nothing, it revolved through the Sanskrit practices. No scripture remains untransmitted, yet the ultimate is difficult to surpass. We, relying on fortunate causes, have glimpsed the mysterious and wondrous. Unfolding the secret depths of the ninefold radiance, we have glimpsed the numinous scriptures; proclaiming the luminous regulations of the Three Caverns, we follow the teachings and canons. In all that we present, we dare not fail to report above.\n\nThe intentions of the fast and the blue-green memorial are now respectfully proclaimed. As stated in the memorial’s words, we do not deviate from our earnest pleas. We beseech the Great Dao to distinguish and grant our prayers.\n\nWe have heard that in the empty azure, the cloud-script of the Mysterious Mound appears; in the flowing radiance of the Great Desert, the Sanskrit reveals the celestial perfected’s intent. A single qi of whirling ascent nurtures the Nine Clarities. We, observing the sun’s shadow and refining our spirits, do not falter past noon. The fragrant radiance of the returning wind shines upon the towering gates; the rushing solar essence of the red sun shines directly upon the cinnabar heaven. Feathered canopies stream essence along the Yellow Path, jade flowers scatter light upon the Mysterious Altar. Reverently relying on incense to convey our message, we perform the fast’s rites.\n\nToday, at the midpoint of the first day’s Dao performance, we, the dharma assembly, now offer the first pinch of incense. May this incense smoke ascend to the heavens, directly offering reverence to the Void, Most Real, and Spontaneous Great Dao, the Primordial Heavenly Worthy. May the merit of this pinch of incense extend upward to bless the present emperor, that his reign endure boundlessly. We humbly pray that his rule may span a thousand ages, his Dao equaling the Two Emperors. May his grand enterprise be as firm as heaven, his foundation enduring for a hundred million myriad generations; may his imperial destiny flourish daily, surpassing the eight-hundred-year oracle. Grasping the true talisman to govern the realm, may he bear the mandate in his person. May his reign be long and his achievements radiant, his merits surpassing those of his ancestors. May all auspicious signs arrive, great blessings come abundantly.\n\nNow, therefore, we burn incense, taking refuge from the Dao, the revered, the sagely hosts, and the perfected powers. After attaining the Dao, may he preserve heaven and endure forever.\n\nWe have heard that the purple essence shines brightly, the three huts generating the spirit of emptiness and silence; the jeweled chamber radiates light, the ten unions turning the golden bridge’s sages. The wondrous mechanism inverts shadows, the great chaos flies into the mysterious.\n\nToday, at the midpoint of the first day’s Dao performance, we, the dharma assembly, now offer the second pinch of incense. May this incense smoke ascend to the heavens, directly offering reverence to the Jade Dawn, Most Sagely, Spontaneous, Numinous Treasure Great Dao Heavenly Worthy. May the merit of this pinch of incense extend upward to bless the empress, the imperial mother’s numinous form. We humbly pray that she refine her essence in the Eastern Flowery and mold her soul in the Southern Culmen. May she ascend to the Golden Gates, directly joining the ranks of the Most High; may she wander and feast in the Jade Capital, her position aligned with the throne of the Primordial Perfected. May she bestow auspiciousness upon the imperial destiny, extending the prosperity of the imperial enterprise. May the golden branches and jade leaves flourish ever more, the purple phoenix and green simurgh offering auspicious signs. May the nine provinces be at peace, the four seas tranquil.\n\nNow, therefore, we burn incense, taking refuge from the scriptures, the revered, the sagely hosts, and the perfected powers. After attaining the Dao, may she ascend into the formless.\n\nWe have heard that when the primordial chaos was split open, the round and clear were divided from the square and turbid; when the ranks of high and low were established, there arose the distinctions between the human world and the celestial passes.\n\nAt Purple Void’s lush radiance, Jade Essence’s flowing light—\ntoday, on the first day at the hour of noon, as we perform the Dao-circuits,\nthe assembly of dharma-adepts here present kindle these three pinches of incense.\nMay this fragrant smoke ascend through the heavens,\ndirectly offering reverence to the Primordial Great Sage, the Heavenly Worthy of Natural Dao and Power.\n\nMay the merit of this incense-offering ascend to honor the numinous presence of the ancestral shrines and the former sages.\nWe humbly pray that heaven and earth illumine with splendor, the Great Void resonate in harmony.\nMay they nurture purity in tranquility, resting in the Yellow Chamber;\nmay they refine the azure emptiness to true essence, ascending directly to the Purple Ultimate.\nBestow auspiciousness upon the ancestral temples, extend blessings to the heir’s palace.\n\nNow, therefore, we burn incense, taking refuge from the master, the revered, the sagely hosts, and the perfected powers.\nAfter attaining the Dao, may they ascend into the formless.\n\nIn repentance, circumambulation, subduing demons, pacing the void,\nbowing to the scriptures, thrice invoking, and solemnly reciting the dharma-ranks—\nwe, the assembled officials and altar-attending hosts, with utmost sincerity,\njointly supplicate the Three Clarities’ August Worthies,\nthe Ten Directions’ Supreme Saints,\nthe Heavenly Emperors and Perfected of Jade Capital and Golden Towers,\nthe Ten Directions’ Master Worthies and Sagely Hosts,\nthe officials of the Three Realms, and all mighty numina.\n\nWe have heard that when the Cavernous Mystery revealed its scriptures,\nheaven and earth bowed in reverence;\nwhen the Divine Empyrean bestowed its registers,\nthe netherworld opened its passes to clear the Way.\nWe, who have long been counted among the true companions,\nhave presumptuously received the shade of the Dao.\nThus, we ought to guard the Yellow Court and repose within,\ninwardly nurturing spirit and form;\nto feast on the pure fluid and immerse in study,\noutwardly eliminating desires and cravings.\nReverently bearing the imperial mandate, we scrupulously perform our rites.\n\nWe humbly beseech that the Dao’s intent shine forth,\nthe imperial heart deign to regard us.\nBestow the Jade Clarity’s precious registers, refining the body with golden fluid;\nconfer the Golden Tower’s jade texts, recording names on the Cinnabar Terrace.\nAbove, we pray for the Earthly Palace;\nbelow, for the imperial presence.\nMay she grasp the dragon-script, ascend the phoenix-chariot,\nenter directly the realm of pure emptiness,\nsoar to the Great Desert’s expanse.\nMay she be ranked among the Perfected Immortals,\nher name inscribed in the Purple Registers.\nFeasting by the Jasper Pool, drifting in radiance,\ndwelling in the Flowery Tower, delighting in spirit—\nmay she realize the Dao in nonaction,\ntranscend existence to attain the highest.\nAbove, may the Heavenly Worthy’s great compassion manifest;\nbelow, may our supplications’ sincerity be fulfilled.\n\nRespectfully submitted for your august attention.\n\nTwelve Vows:\nFirst, may celestial grace descend universally;\nsecond, may the talismanic mandate spread afar;\nthird, may the numinous altar be solemn and vigilant;\nfourth, may the myriad saints attend the throne;\nfifth, may the thousand Perfected pay homage;\nsixth, may the ten thousand qi unite in transcendence;\nseventh, may the dead rise from their corpses;\neighth, may beings be delivered to the Southern Palace;\nninth, may heaven be clear and qi bright;\ntenth, may rivers and seas be tranquil;\neleventh, may the turning wheel attain the Dao;\ntwelfth, may all ascend to the Upper Clarity.\n\nThe incense-brazier is sealed as before.\nExiting the hall.\n\nThe Rite of Noon Audience on the First Day of the Jade Register Grand Fast is concluded. The Rite of Evening Audience on the First Day of the Jade Register Grand Fast begins. Each pays homage to the masters, contemplating as prescribed. Divine radiance shines brightly; auspicious qi swirls in abundance. The Winnowing Basket and Dipper gleam in splendor; the hall of mushrooms stands serene. Jade eyes hold truth; the sacred altar is pure and undefiled. Night is transformed into day; the hour returns to noon. The Great Flower scatters pearls; the cinnabar phoenix soars in mystery. Demons are stilled and treachery extinguished; one strides high through auspicious mist. Heavenly Perfected gather universally, all arriving before the Emperor.\n\nThe incense-brazier is sealed as before.\nInvoking the Dharma Titles.\n\nWe, the assembled officials and altar-attending multitude, with utmost sincerity jointly address the Primordial Heavenly Worthy of the Void and Spontaneous, the Limitless Great Dao, the Most High Lord of the Dao, the Most High Lord Lao, the August Jade Emperor, the perfected and sagely hosts of the ten directions who have attained the Dao, the Lords of the Thirty-Two Heavens, the Jade Void Emperor, the Great Emperor of Jade, the Eastern Flower, Southern Culmen, Western Numinous, Northern Perfected, and the Golden Towers of the Seven Treasures in the Purple Tenuity’s Upper Palace of the Jade Capital, the Sovereign of the Numinous Treasure and Perfected Radiant August Dao, the thirty-six divisions of revered scriptures, the Great Dharma Master of the Mysterious Center, the High Ministers, High Stewards, High Protectors, High Tutors, the Twenty-Four Perfected of the Great Peace’s Lower Teaching, the Lord King of Total Perfection of the Western City, the Perfected of the Great One, the High Minister of Life of the Eastern Marchmount, the Two Perfected Lords Mao who determine records and protect life, the divine immortals who have attained the Dao in the sacred mountains and grotto-heavens, the officials of the Three Realms, and all true numina.\n\nWe have heard that the threefold treasury of radiance establishes the root of heaven in primordial chaos; the one spirit conceals its subtlety, spanning countless kalpas in the vast expanse. The Dao reaches the profound mystery; its principle is subtle in the great desert. Without form or trace, it seems to exist yet not exist. It embraces the myriad images to congeal essence, suffuses the nine suns to inaugurate kalpas. Dispersing the qi of dark tranquility and mystery, it crowns the cinnabar clouds; initiating the sound of flourishing emptiness, it inaugurates the jade calendar. What it naturally transforms is without pattern yet luminous.\n\nWe, by karmic affinity of former lives, have presumptuously received the numinous assembly. Secretly revering the divine chapters, we leap with joy, gazing afar to contemplate the Perfected. By the great Brahma’s generation and transformation, we diligently cultivate and expound the teachings. In all that we address, we dare not fail to make known.\n\nThe intent of the fast and the blue-green memorial shall now be solemnly proclaimed.\n\nProclamation:\nAs the words declare, without transgressing sincerity. We beseech the Great Dao to distinguish and grant our prayers.\n\nWe have heard that the Dao opened the five kalpas, floating radiance in the empty vastness; the Dharma emerged from the three vehicles, manifesting deliverance within the dark and hidden. Constantly pure, constantly still, it is called sagely, called divine.\n\nWe reverently undertake the pure fast, first entering the tranquil night. The divine wind is hushed; the river’s source irrigates the blossoms of the Eastern Well. The jade firmament revolves in splendor; the stone’s shadow emits the essence of the dark yin. Welcoming the host of immortals to extend their shade, gathering the nine qi to contain mist.\n\nRespectfully transmitting incense, we undertake the fast’s vigil. On this evening as we perform the Dao, we, the Dharma assembly, now offer the first pinch of incense. May this incense smoke ascend to space, directly offering to the Void, Perfected, Spontaneous, and Primordial Heavenly Worthy of the Great Dao.\n\nMay the merit of this pinch of incense extend above to bless the present emperor, bestowing boundless fortune. We humbly pray that the Dao harmonize the three subtleties, that he personally receive a hundred blessings. May he abundantly and grandly receive the emperor’s grace without end; majestically and augustly, may he bear the celestial favor ever increasing. May he firmly receive the protection of a hundred million years, eternally bearing the title of the Nine-Five fortune. May the four seas be united, the eight directions settled in submission.\n\nNow we burn incense, from revering the Dao, the honored and sagely hosts, the Perfected’s virtue, to attaining the Dao thereafter, preserving heaven’s long endurance.\n\nWe have heard that in the distant and formless, the spirit returns to the court of wondrous existence; in the sudden forgetting of form, the Dao abides in the realm of perfect emptiness. Having earnestly contemplated in silence, our sincere hearts are truly aligned.\n\nOn this evening as we perform the Dao, we, the Dharma assembly, now offer the second pinch of incense. May this incense smoke ascend to space, directly offering to the Jade Dawn, Perfected, Spontaneous, Numinous Treasure Heavenly Worthy of the Great Dao.\n\nMay the merit of this pinch of incense extend above to aid the invoked divine forms. We humbly pray that they refine their substance in the void, congeal their spirits in primordial simplicity. On the cinnabar terrace, the registers are examined, loftily inscribing the record of accumulated goodness; in the purple palace, merits are declared, ascending to the ranks of the highest immortals. May abundant great fortune flourish, protecting the state and the household. May blessings descend upon the heir’s palace, securing peace throughout the realm. May the hundred officials be pure and bright, enabling the six domains to prosper. May the imperial enterprise be eternally assisted, its favored emoluments ever increasing.\n\nNow, therefore, we burn incense, taking refuge from the scriptural Honored Ones, the Great Sage Assembly, and the virtue of the Perfected, who, having attained the Dao, ascended into formlessness.\n\nWe have heard that accumulating merit across vast kalpas arises from broadly delivering humans and devas; advancing through the immortal ranks lies in universally aiding the hidden and the manifest. Thus do we magnify the true teachings and unfold the mysterious power.\n\nAt this hour of dusk, as we perform the Dao, we, the Dharma assembly, offer this third pinch of incense. May its fragrant smoke ascend directly to reverently present itself before the Primordial Great Sage, Spontaneous Transforming Lord, Heavenly Worthy of Dao and Virtue.\n\nMay the merit of this pinch of incense extend above to aid our ancestral sages and the august spirits of the altars and soil. We humbly pray that they ascend to the Jade Capital, their forms soaring amid emerald radiance. Returning to the origin and restoring the root, may they achieve immortality through the ninefold refinement; uniting with the wondrous and attaining the real, may they join the Dao amid the eight celestial stems, feast upon celestial tones within the numinous palace, and spread the imperial mat upon the mud-pill palace.\n\nMay the Great Monad assist their essence, and may the Lord Emperor confer their immortal ranks. Thus do we earnestly wish that they bear the precious registers and ascend into the Golden Gates; that they repose in the jade chariot and ascend directly to the Jasper Terrace. May fortune flow through the state’s destiny, and may grace extend throughout the realm.\n\nNow, therefore, we burn incense, taking refuge in our teacher, the Honored Ones, the Great Sage Assembly, and the virtue of the Perfected, who, having attained the Dao, ascended into formlessness.\n\nWe repent. Thrice we invoke.\n\nThrice we bow. Once more we proclaim the dharma-ranks. All present—those who stand before the altar and the assembled officials—earnestly join in reverence to address the Three Clarities Most Revered, the Ten Directions’ August Sages, the Heavenly Perfected of Jade Capital and Golden Gates, the Celestial Emperors, the Ten Directions’ Honored Teachers and Sacred Assemblies, the officials of the Three Realms, and all numinous powers.\n\nWe have heard that in the Ritual Chamber of the Three Realms, one offers pure vows to atone for three transgressions; that with the ninefold yang’s talismanic script, one bridges the dark vastness of the Nine Netherworlds. We, who have long planted the roots of blessedness and early became heirs of the Mysterious, ought to let all dust-born defilements cease, serenely observing the thousand-day fast; to cultivate practice ten thousand times over, enduring the numinous gaze of the Nine Heavens.\n\nHaving pledged the oath of cinnabar-drinking, how dare we forget the covenant of the inscribed registers? We rescue beings and ferry souls, accumulating merit and amassing deeds. Now, in accordance with the edict received, we call to mind the divine spirits. We humbly beseech the Celestial Emperor to bestow compassion, the Lofty Perfected to peer with penetrating insight. May grace flow from the Southern Culmen, refining our forms with golden elixir; may commands issue from the Eastern Florescence, allowing us to be reviewed in the jade registers of the Perfected.\n\nMay we ascend to the Wandering Park of the Gods, repose in the Flowering Chambers, wander at ease in the realm of purity and stillness, and roam and feast in the boundless expanse of emptiness. Thus shall the great transformation of the Most High Heavenly Worthy be made manifest above, and the sincerity of our refuge and devotion be fulfilled below. We respectfully submit this entreaty for your hearing.\n\nMay the first vow bring forth universal radiance of compassionate light,\nMay the second vow cause the sun of wisdom to cast its beams,\nMay the third vow extend Heaven’s grace to all beings,\nMay the fourth vow lead to awakening in the Dao of non-action,\nMay the fifth vow grant the mandate of the Azure Flower,\nMay the sixth vow allow feasting upon the Cinnabar Terrace,\nMay the seventh vow elevate the spirit to the Purple Culmen,\nMay the eighth vow let the phoenix chariot hover and linger,\nMay the ninth vow prolong the nation’s fortune and reign,\nMay the tenth vow enable ascent to the summit of Penglai,\nMay the eleventh vow summon the myriad Perfected to descend and witness,\nMay the twelfth vow permit advancement upon the jasper steps.\n\nThe furnace rites proceed as before.\nThanksgiving to the Master.\nReturn to the curtained enclosure.\n\nThe first evening rites of the Jade Register Grand Fast conclude.\nThe second morning audience rites of the Jade Register Grand Fast begin.\n\nAll pay homage to the Master, contemplating as prescribed:\n\nThe five stars cast their numinous radiance,\nilluminating the cinnabar court with resplendent light.\nEncompassing all without exception,\nthey unite the qi of the host of spirits.\nConcealing form in profound silence,\nthey traverse the Five Classics.\nDisplaying might to outshine the sun,\nthey command the officers of the celestial stems and branches.\nThey repel calamities and dispel misfortune,\ncleansing filth and dissolving baleful influences.\nThe myriad demons tremble in terror,\ndragons and tigers take flight in haste.\nPurple clouds interlace and enfold,\nas the ten thousand qi converge as one.\n\nThe Dharma Drum is sounded twenty-four times.\n\nO Most High Three Heavens, Mysterious Primordial Three Qi, Supreme Lord Lao:\nSummon forth the Three and Five Merit Officers within my body,\nthe Attendant Messengers of the Left and Right,\nthe Golden Lads bearing incense on the left and right,\nthe Jade Maidens scattering flowers to convey words,\nthe Thirty-Six Fragrance Officers of the Five Thearchs’ Direct Talismans and Direct Days.\n\nLet them emerge—\nadorned in solemn attire, resplendent in vestments,\ncrowns and sashes with pendent cords.\n\nSummon the Land Spirits of the Mysterious Altar,\nthe Divine Perfected of the directional domains.\n\nThis morning, as I ascend the altar to perform the Dao,\nto pay audience to the Imperial Perfected,\nI humbly present my sincerest intentions,\nall duly recorded in sealed documents.\n\nMay the numinous radiance of the Supreme Perfected Dao,\nthe luminous treasure of the Lingbao,\ndescend and flow into our bodies.\nMay the sincerity of our entreaty swiftly ascend,\nreaching the presence of the Most High,\nthe Boundless Dao of the Three Clarities,\nthe August Celestial Worthy,\nthe Jade Emperor of the Golden Gates of the Heavenly Palace.\n\nInvoking the Dharma ranks:\n\nTogether with the assembled officials and altar participants,\nwe reverently and with one heart address our entreaty to:\nthe Primordial Celestial Worthy of the Void and Spontaneous,\nthe Boundless Dao, the Supreme Lord of the Dao,\nLord Lao the Supreme,\nthe August Jade Emperor,\nthe host of Great Sages who have attained the Dao in the Ten Directions,\nthe Perfected Lords and Venerable Masters,\nthe Lords of the Thirty-Two Heavens,\nthe Jade Void Emperor,\nthe Jade Emperor and Great Emperor,\nthe Eastern Florescence, Southern Culmen, Western Numinosity, Northern Perfection,\nthe Golden Gates of the Jasper Capital, the Seven-Treasure Jeweled Terrace of the Purple Tenuity Upper Palace,\nthe Numinous Treasure Supreme Illustrious Sovereign of the Dao,\nthe Thirty-Six Divisions of the Venerable Scriptures,\nthe Great Dharma Masters of the Mysterious Center,\nthe Supreme Ministers, Supreme Chancellors,\nSupreme Protectors, Supreme Preceptors,\nthe Twenty-Four Perfected of the Great Peace Lower Teaching,\nthe King of the Total Perfected of the Western Citadel,\nthe Perfected of the Great One,\nthe Supreme Minister of the Eastern Marchmount, Controller of Destinies,\nthe Two Perfected Lords Mao, Regulators of Records and Protectors of Life,\nthe Divine Immortals who have attained the Dao in the sacred mountains and grotto-heavens,\nand all the Perfected Spirits of the Three Realms and their official retinues.\n\nI have heard that the Four Symbols sigh in vastness, concealing the Great Void within the Primordial Grotto; the Nine Suns scatter their radiance, suffusing wondrous qi amidst the blossoms of Brahmā. Azure mists spread in array, while dark essences stretch into the distant. The Three Luminaries interpenetrate, nurturing the myriad beings. At the dawn of the Dragon-Han, the Celestial Charts were unfurled; from the transformations of the Primordial Azure, all things arose. The Heavenly Treasures emerged as scriptures to transmit through the world, their divine chapters forming like blossoms; the Jade Clarity responded to its title, delivering humankind, its sacred scripts shimmering with numinous light. The true mechanism was revealed, and the Orthodox Dao flowed forth.\n\nWe, your servants, have fortuitously aligned with the Mysterious Chart and gained participation in the lofty model. Relying on the jadelike countenance to inspire wondrous resonance, we turn to attend the morning audience; contemplating the pearl-like utterance to concentrate the spirit, we reverently proclaim the Dharma rites. Whatever we venture to present, we dare not withhold. The intent of the purification rite and the blue-green memorial shall be respectfully declared.\n\n**Proclamation of the Memorial**\nAs stated in the memorial, without deviation from its earnest sincerity.\n\nWe humbly beseech the Most High to distinguish and heed our supplications.\n\nI have heard that formless and shadowless, the divine wind is still and silent, yet illumines the vast firmament; as if present, as if absent, the Four Qi shine brightly, equalizing all in distant harmony. The host of demons bow their heads, and the myriad sages attend the audience.\n\nWe, your servants, discerning the signs and refining our thoughts, face the dawn in reverent audience. As the pure wind arises at daybreak, we gaze upon the numinous radiance just ascending; as the Yellow Path begins to shine, we witness the full subjugation of the yin hosts. Precious qi floats in the void above the dark throne; auspicious mists rise high amidst the Great Veil.\n\nReverently transmitting the incense, we undertake the purification vigil. On this second day at dawn, as we perform the Dao-circulation, we invite the Dharma assembly to offer the first pinch of incense. May this incense smoke ascend directly to offer homage to the Primordial Heavenly Worthy of the Dao, the Natural and Most Real, the Great Dao of the Void.\n\nMay the merit of this pinch of incense extend upward to bless the present emperor, that his august mandate endure without end. We humbly pray that through ten thousand years, his virtue may illumine the four quarters. May the Red Crow stream through the palace, continuing the flourishing of the Fire Mandate; may the divine horse emerge from the river, truly manifesting the auspiciousness of the Heavenly Scriptures. May he be born in harmony with the numinous and grasp the sacred, eternally receiving the registers and charts. May the imperial destiny prosper and flourish, favored by the August Heaven. May propitious omens converge and auspicious blessings all arrive.\n\nThus we now burn incense, from our refuge in the Dao-Worthy, the Great Sage Assembly, and the virtue of the Perfected, that after attaining the Dao, we may pray for the eternal endurance of Heaven.\n\nI have heard that the Perfect Dao bestows its precepts, and the phoenix scripts descend upon the realm of Pure Subtlety; the Primordial August One promulgates his teachings, and the dragon charts float in the azure vastness of the Empyrean. Universally aiding the hidden and manifest, all equally receive blessings and protection.\n\nOn this second day at dawn, as we perform the Dao-circulation, we invite the Dharma assembly to offer the second pinch of incense. May this incense smoke ascend directly to offer homage to the Heavenly Worthy of the Numinous Treasure, the Most Sagely and Natural, the Great Dao of Jade Clarity.\n\nMay the merit of this pinch of incense extend upward to benefit the spirits we commend. We humbly pray that they may feast in the Jade Capital, advancing through the ranks of the sacred canon. Facing the August Void to receive the Dao, may they ascend the jade steps to attain Perfection. May they dwell forever in carefree ease, abiding eternally in supreme bliss. May they draw from the immortal streams of the Silver River and pluck the celestial blossoms of the Jasper Garden. May their influence moisten the nine provinces and their fragrance transmit through ten thousand generations.\n\nThus we now burn incense, from our refuge in the Scripture-Worthy, the Great Sage Assembly, and the virtue of the Perfected, that after attaining the Dao, they may ascend into the formless.\n\nI have heard that ever-responsive and ever-quiescent, the numinous light pervades all, and the ten thousand practices are all enacted; perfectly quiescent and perfectly penetrating, the nectar of wisdom universally moistens, and the nine springs are equally succored. The Dao’s compassion is vast, and its supreme virtue all-embracing.\n\nOn this second day at dawn, as we perform the Dao-circulation, we invite the Dharma assembly to offer the third pinch of incense. May this incense smoke ascend directly to offer homage to the Heavenly Worthy of the Dao and Virtue, the Natural Transformer, the Great Sage of the Primordial Chaos.\n\nMay the merit of this pinch of incense extend upward to benefit the spirits we commend. We humbly pray that they may soar high in the Great Veil and mystically commune with the formless. Drifting in ethereal purity, may they refine their true selves in the courtyard of flowing fire; luxuriant as jade blossoms, may they bear fruit in the halls of the Azure Empyrean. Responding to the numinous charts and riding the currents, may they merge with the empty and cavernous to generate the divine. May the Perfected of the Upper Realms turn their light, and the divine lords gather their radiance. May they transcend to realize the true and constant, and equal the years of Heaven and Earth.\n\nThus we now burn incense, from our refuge in the Preceptor-Worthy, the Great Sage Assembly, and the virtue of the Perfected, that after attaining the Dao, they may ascend into the formless.\n\n**Confession**\nThreefold invocation.\n\n**Threefold Prostration**\n\nRepeatedly invoking the sacred ranks, we, the assembled officiants and attending officials, with utmost sincerity jointly address the Three Clarities Most High, the Perfected of the Ten Directions, the Celestial Worthies of the Jade Capital and Golden Gates, the Venerable Masters and Sacred Assemblies of the Ten Directions, the divine ministers of the Three Realms, and all numinous powers.\n\nWe have heard that tenfold circumambulation summons the Perfected from the Azure Vault, and the opening of the Nine Dark Realms delivers consciousness to ascend as immortals. We, undeservingly bathed in the mystic stream and privy to this auspicious gathering, ought to cast off form and renounce cunning, awakening to the mutual forgetting of self and principle; abide in stillness to attain emptiness, and refine body and spirit to soar aloft. Early did we receive the central covenant and bear its registers, vowing to propagate the Great Dharma and deliver beings. Though our merits are meager, they slightly aid the mysterious transformation. Moreover, we humbly undertake this rite in reverent observance.\n\nYet we fear our precepts are lax and virtue shallow, our learning slight and talents feeble. We have presumptuously violated the statutes—we can only hope for leniency. May you, in your compassion, heed our entreaties and grant your scrutiny. Bestow the talismanic mandates of the Azure Palace, open the way for the divine forms of those we commend, and guide them directly into the Grand Clarity to attain perfection and realize the Dao. Thus shall the luminous transformation of the Heavenly Worthy’s great compassion be manifest above, and our devotion in taking refuge be fulfilled below.\n\nWe respectfully submit this petition.\n\nFirst, may numinous radiance descend to illumine;\nSecond, may the moon of the Dao shine forth in splendor;\nThird, may grace extend through the Nine Lands;\nFourth, may sincerity reach the Nine Heavens;\nFifth, may all true spirits convene;\nSixth, may the Dao-qi pervade all;\nSeventh, may the heavens open wide;\nEighth, may hells be shattered and overthrown;\nNinth, may mysterious merit spread universally;\nTenth, may they ride the light and soar through emptiness;\nEleventh, may all under heaven embrace virtue;\nTwelfth, may the Dao unite with non-action.\n\nReplenishing the censer, we visualize the spirits and burn incense.\n\nIncense Official Messengers, Left and Right Dragon-Tiger Lords, and all Attending Incense Spirits—may this place where we have this morning ascended the altar to perform the Dao now naturally generate golden liquid, cinnabar, azure mushrooms, and divine herbs. May the hundred spirits and host of perfected beings convene here before the incense burner.\n\nWe pray that the jade maidens and immortal youths of the ten directions receive this orchid-scented smoke and swiftly transmit the sincerity of our petition directly upward to the Most Perfect and Boundless Dao, the Three Clarities’ August Saints, and the Supreme August Jade Emperor of the Golden Portal before the Celestial Throne.\n\nThe second day’s early rite of the Jade Register Grand Retreat now concludes.\nThe second day’s noon audience rite begins.\n\nAll ritual masters, maintain visualization as prescribed:\nWithin the Yellow Center, summon qi to sever demonic traces and extinguish their trails.\nSuppress the sources of evil;\ncut off the lineages of demons.\nBy the Talismanic Mandate of the Most High, summon and command the divine lords.\nMay all spirits heed this call, averting misfortune and dispelling calamity.\nFive qi and three wheels penetrate the true wind;\nthe Purple Portal unites with jade, and the Six Perfections know no end.\nTo the left, command the Azure Waist;\nto the right, summon the Mushroom Youths.\nWandering freely, riding the radiant light, they govern the Nine Empyreans.\nThe Mysterious Altar responds to the moment, riding the qi in empty ascension.\nMay the myriad perfected descend universally, delivering and saving without end.\n\nIgnite the censer as in the morning audience.\nInvite the recitation of the dharma ranks.\n\nWe, the assembled officiants and altar-attending officials, together with utmost sincerity, reverently address and invoke:\nThe Primordial Heavenly Worthy of the Void and Spontaneous,\nThe Boundless Dao’s Most High Dao Lord,\nThe Most High Lord Lao,\nThe August Jade Emperor on High,\nThe host of great sage perfected beings of the ten directions who have attained the Dao,\nThe Lords and Venerables of the Thirty-Two Heavens,\nThe Jade Void Emperor,\nThe Great Emperor of the Jade Emperor,\nThe Eastern Flower, Southern Culmen, Western Numinous, and Northern Perfected,\nThe Golden Portal and Seven-Jewel Jeweled Terrace of the Purple Tenuity’s Upper Palace,\nThe Numinous Treasure Perfected Illustrious Sovereign of the Dao,\nThe thirty-six divisions of revered scriptures,\nThe Great Dharma Masters of the Mysterious Center,\nThe Supreme Ministers, Supreme Chancellors, Supreme Protectors, and Supreme Tutors,\nThe Twenty-Four Perfected of the Great Peace’s Lesser Teaching,\nThe King of Total Perfection of the Western City,\nThe Perfected of the Great One,\nThe Supreme Minister of the Eastern Marchmount and Controller of Destiny,\nThe Two Perfected Lords Mao, Regulators of Records and Protectors of Life,\nThe divine immortals who have attained the Dao in the grotto-heavens and named mountains,\nThe officials and attendants of the Three Realms,\nand all true spirits.\n\nWe have heard that when the Five Perfections congeal essence, they foreshadow the ancestral radiance of cinnabar;\nwhen the Three Yangs conceal their subtlety, they elude the bounds of kalpas past.\nVast and formless, secluded and imageless,\nthey coalesce the primordial qi of the numinous Brahman and initiate divine movement in the Crimson Clarity.\nUnfolding the Five Chapters, they pervade the ten thousand models.\nThe Numinous Treasure emerges from the mysteries of the golden script, its phoenix chronicle circulating;\nthe Cavernous Mystery suspends the brilliance of jade graphs, its dragon script securely established.\nDelivering boundless beings, preserving heaven’s enduring existence.\n\nWe, unworthy heirs of the immortal lineage, have presumptuously received the Orthodox Unity.\nFloating on vermilion blossoms, we inherit blessings, chanting and intoning the jade sounds;\ntransmitting talismans and registers among the named mountains, we observe and cultivate the precious models.\nIn all matters we address, how dare we not report them above?\n\nThe blue-green memorial of the retreat’s intent shall now be solemnly proclaimed.\nProclaim the memorial.\n\nAs stated in the memorial’s words, without deviation from its earnest entreaties.\nWe beseech the Great Dao to distinguish and heed our piteous prayers.\n\nWe have heard that the Golden Writ of the Supreme Ultimate soars as the treasure of the Twofold Mystery’s perfected essence;\nthe Purple Radiance and Jade Splendor flow as the light of the Nine Empyreans’ divine realm.\nDragons crouch and tigers leap; phoenixes soar and simurghs dance.\n\nWe, by day, receive the true spirits; at noon, we approach the altar’s precincts.\nThe yang essence shines in its correctness, measuring the gnomon’s shadow to align with the center;\nthe radiant brilliance unfurls its light, gazing upon the cinnabar orb before its decline.\n\nWe draw forth the saints of the Dharma Realm’s emptiness and gather the fragrant smoke of the numinous wind’s exuberance.\nRespectfully relying on the transmission of incense, we undertake the retreat’s observances.\n\nAt this midday performance of the Dao, we, the assembled dharma hosts, now offer the first pinch of incense.\nMay this incense smoke ascend to the heavens, directly offering reverence to the Primordial Heavenly Worthy of the Void, the Most Perfect and Spontaneous Great Dao.\n\nMay the merit of this pinch of incense ascend to bless the present emperor, that his sagely longevity know no bounds.\nWe humbly pray that he eternally govern the Nine Palaces, fully receiving the Five Fortunes.\nClothed in dignity, he brings order, long presiding over the southern-facing court;\nabiding in correctness, embodying the origin, he steadfastly guards the northern star’s domain.\nTreading the supreme position with enduring vision, he preserves the glory of the imperial line without end.\nThe imperial mandate daily renews; the divine foundation towers in heaven.\nPacifying the Four Seas, he grandly extends the myriad years.\n\nNow, as we burn this incense, from our taking refuge in the Dao’s august sagely host of perfected beings and their virtue, to their attainment of the Dao, we pray for heaven’s enduring existence.\n\nWe have heard that the Golden Portal and Jade Chamber store the secret of the precious coffer’s jade tablets;\nthe Jasper Terrace and Vermilion Gardens reveal the auspiciousness of cloud scripts and rosy seal-characters.\nTheir light illumines the Nine Heavens; their brilliance hangs from the eight corners.\n\nAt this midday performance of the Dao, we, the assembled dharma hosts, now offer the second pinch of incense.\nMay this incense smoke ascend to the heavens, directly offering reverence to the Most Sagely and Spontaneous Numinous Treasure Great Dao Heavenly Worthy.\n\nMay the merit of this pinch of incense ascend to benefit the imperial lineage and ancestral branches.\nWe humbly pray that the Four Frontiers turn toward the wind, and all vassals admire righteousness.\nClimbing mountains and sailing seas, all become tributary ministers;\nfrom the tattooed tribes of Jiaozhi to the distant lands, all fulfill their duties of audience.\nExhausting heaven and earth’s covering and supporting, and the sun and moon’s illumination,\nthe myriad barbarians in caps and sashes, and the unified standards of cart and script,\nall attain peace and tranquility, each realizing their life’s fulfillment.\n\nNow, therefore, we burn incense, taking refuge from the scriptural venerables and the great sagely hosts, whose perfect virtue\n\nThree Bows. Once more proclaiming the sacred ranks, we, the assembled officiants and all present before the altar, with utmost\n\nWe, the officiants of this rite and all assembled before the altar, with reverent unity do hereby address and invoke:\n\nThe Boundless and Self-So Primordial Heavenly Worthy of the Void and the Natural,\nThe Supreme Dao Lord of the Limitless Great Dao,\nThe Most High Lord Lao,\nThe August Jade Emperor,\nThe perfected and holy sages of the ten directions who have attained the Dao,\nThe True Lords and Venerable Ones,\nThe thirty-two Heavenly Emperors,\nThe Jade Purity Highest Emperor,\nThe Great Emperor of the Jade Capital,\nThe Eastern Flower, Southern Culmen, Western Numinous, and Northern True Realms,\nThe Seven-Treasured Jeweled Terrace of the Purple Tenuity Upper Palace,\nThe Numinous Treasure Perfected Radiant August Dao Lord of the Jade Metropolis Golden Portal,\nThe thirty-six sacred scriptures of the supreme canons,\nThe Great Dharma Masters of the Mysterious Center,\nThe High Ministers, High Stewards, High Protectors, and High Tutors,\nThe twenty-four Perfected of the Great Peace’s lower teachings,\nThe Sovereign Perfected King of the Western Citadel,\nThe Perfected of the Great One,\nThe High Minister of Life of the Eastern Marchmount,\nThe Two Perfected Lords Mao—Keepers of the Register and Guardians of Destiny,\nThe divine immortals who have attained the Dao in the sacred mountains and grotto-heavens,\nThe officials and attendants of the Three Realms,\nAnd all true numina.\n\nWe have heard that the Six Harmonies conceal their forms, concealing the primordial qi of the hidden and blended numinous ancestor; the Five Yangs weave the warp of the cosmos, unfolding the luminous heaven of Brahma’s treasures. Radiance illumines the distant and obscure; brilliance soars in dazzling splendor. Far-reaching, it embraces the Nine Poles; in totality, it governs the Three Luminaries. It inaugurated the kalpic destiny of the Highest Antiquity and responded to the numinous chart of the Great Ultimate. It divided the immortal realms of the cavernous divine and inspired the texts of transformation and life; it produced the sacred talismans of the divine treasures, floating in the void and forming their sigils. It propelled the tally of the celestial reckoning and thereby delivered the people of heaven.\n\nWe, unworthy as we are to stand upon the ranks of the perfected, have presumptuously wandered within the arcane teachings. We have drifted upon the wondrous scene of the Yellow Flower and concentrated our gaze upon the sacred texts; we have unfurled the purple bamboo slips of the profound and obscure and followed the regulations and precepts. In all that we now present, we dare not withhold it from the hearing of the Most High. The intent of this fast is expressed in the blue-green memorial, which we now humbly proclaim.\n\nProclamation of the Memorial\nAs the words of the memorial declare, without deviation from our earnest supplication:\n\nWe implore the Great Dao to distinguish and heed our sorrowful entreaty.\n\nWe have heard that the Mysterious Portal of the Jade Purity nurtures the essence of the three luminaries’ souls and spirits; the Golden Realm of the Purple Clarity floats the purest qi of the ninefold yin and yang. It communicates with the divine and enters quiescence, summoning the true and drawing forth the numinous.\n\nWe, with reverent devotion, have diligently cultivated the wondrous teachings on this propitious night. Concealing the clouds and veiling the obscurities, we have spread the four seasons to illumine the clarity; revolving the Dipper and traversing the Winnowing Basket, we have received the three luminaries in resplendent brilliance. The precious canopy commands the chariots of the host of perfected; the jade censer emits the nine-colored smoke.\n\nWith respectful reliance upon the transmission of incense, we undertake the fast and vigil. At this hour of the setting sun and the performance of the Dao, we, the assembled officiants of the Dharma, now offer the first pinch of incense.\n\nMay this incense smoke ascend directly into the void to offer reverent devotion to the Boundless and Self-So True and Natural Great Dao, the Primordial Heavenly Worthy.\n\nMay the merit of this pinch of incense extend upward to bless the present emperor, that his sagely longevity be without end. We humbly pray that the five phases maintain their order, the six pitch-pipes harmonize their qi. May the sun and rain be timely, aligning the seven regulators’ jade pivots; may there be neither scorching heat nor freezing cold, harmonizing the four seasons’ jade candles. May yin and yang unite in virtue, matching the sun and moon in shared radiance. May the world’s paths be greatly pacified, the years yield abundant harvests. May he share the heavens’ eternity, his mandate flourishing and renewed.\n\nFor this purpose, we now burn incense, from our reverent devotion to the Dao, the honored and sagely host, the virtue of the perfected and true, that after attaining the Dao, we may pray for the heavens’ enduring presence.\n\nWe have heard that the texts of planting completion in heaven and earth bring protection to the family and peace to the state; the transformation and nurturing of yin and yang establish the models for delivering the dead and saving the living. The record-keepers of the heavens and the myriad sages attend the imperial throne.\n\nAt this hour of the setting sun and the performance of the Dao, we, the assembled officiants of the Dharma, now offer the second pinch of incense.\n\nMay this incense smoke ascend directly into the void to offer reverent devotion to the Jade Dawn Perfected and Sagely Natural Numinous Treasure Great Dao Heavenly Worthy.\n\nMay the merit of this pinch of incense flow to the Three Wretched Paths, the Nine Nights, the Six Destinies, and the Four Modes of Birth. May all evil roots be extinguished, and all beings depart from suffering and distress. May they congeal the embryo and return the qi, together ascending to the Azure Empyrean; may they change their substance and shed their forms, all ascending to the Crimson Mound’s precincts. May the dead souls receive refinement and attain immortal transformation to become human. May retribution cease and enmity be resolved. May they transcend the Three Realms and roam freely in the Nine Clarities.\n\nFor this purpose, we now burn incense, from our reverent devotion to the scriptures, the honored and sagely host, the virtue of the perfected and true, that after attaining the Dao, we may ascend into the formless.\n\nWe have heard that the Great Dao unfolds in silence, thus revealing its scriptures of compassion; the True Origin emerges from the realm of form, thereby bestowing its methods of salvation and deliverance. Through past and present, humans and gods alike have relied upon and revered it.\n\nAt this hour of the setting sun and the performance of the Dao, we, the assembled officiants of the Dharma, now offer the third pinch of incense.\n\nMay this incense smoke ascend directly into the void to offer reverent devotion to the Primordial Great Sage, the Natural Transformer and Lord of the Dao and its Virtue, the Heavenly Worthy.\n\nMay the merit of this pinch of incense extend upward to aid the spirits for whom this rite is offered. We humbly pray that they may forever depart from the clamor of the dust and eternally leave the realm of form. May they congeal the embryo and sever stagnation, containing the harmonious fusion of the primordial qi; may they blend transformation and engender the divine, nurturing the celestial perfected within the mysterious clarity. May they return to their original essence and refine their essence, awakening to the forgetting of both principle and self. May they drift upon the scene of the cavernous void, dispersing their thoughts in the radiance of the clouds. May they roam freely in their numinous chariots, feasting and wandering in the Upper Capital.\n\nFor this purpose, we now burn incense, from our reverent devotion to the masters, the honored and sagely host, the virtue of the perfected and true, that after attaining the Dao, we may ascend into the formless.\n\nRepentance\nThreefold Invocation.\n\n**Threefold Prostration**\n\nReverently invoking the sacred ranks, we, the assembled officiants and all present at this altar, with unified sincerity, now supplicate the Three Clarities Most Exalted, the August Jade Capital and Golden Portals of the Heavenly Emperors and Perfected Ones of the Ten Directions, the Venerable Hosts of Masters from all quarters, the divine officials of the Three Realms, and all majestic numina.\n\nWe have heard that the Six Transgressions subdue demons, receiving the mandate to escort and welcome; the Three Primes’ precepts of discipline prescribe the rites of purificatory bathing and bodily refinement. We, undeserving, have bathed in the mystic stream and been graced with the company of the numinous. Thus, we ought to wear the Central Yellow within to nurture and irrigate the Cinnabar Field; to congeal the Primal Simplicity in lofty contemplation and imbibe the Jade Fluid. Early we don the register of ascension to the Perfected, and transmit the scriptures for dispelling defilement. Vowing to deliver the sunken and obscured, we pledge to magnify purity and stillness. Moreover, in reverent compliance with the written command, we now conduct this rite.\n\nToday, we humbly offer this supplication on behalf of the wandering souls and stagnant spirits who, from past lives to this present existence, have erred in thought and deed. Moved by emotion, they transgressed, failing to cultivate sincere kindness and compliance, or to steadfastly uphold gentleness. Unmindful of the Three Precepts’ appointed times, they indulged in quarrels; heedless of a moment’s wrath, they forgot themselves. Yielding to fury, they bullied others; relying on brute strength, they oppressed the weak. Their hearts harbored wrathful natures, their mouths spewed vicious words. Accumulating transgressions and nurturing wrongs, they neglected to cultivate the Real and uphold the precepts. Fearful of karmic retribution, uncertain of their ascent or descent, we now beseech deliverance, relying upon this solemn rite. Without washing away the old to renew, how may they ascend the void and enter the wondrous?\n\nWe implore the gracious descent of beneficent radiance, the secret infusion of merciful waves. We command the Generals of the Nine Phoenixes, the Lads of the Five Numinosities, the Officers of Summoning Souls, the Lords of Dispelling Defilement, the Lady of Ablution, the Jade Maidens of Yellow Splendor—pray take the Divine Water of the Great Mystery, refine the corpse’s plain broth, the Golden Fluid of Sweet Dew, the Cloud Fat of Jade Nectar. Blend and harmonize the true qi, that it may flow into the fragrant bath; wash away the toil of dust and wholly dissolve the yin shadows. May their ethereal souls be clarified and rectified, their natures and perceptions perfectly luminous. Bathe the Five Sprouts, align the Eight Effulgences. Adorn them with caps, sashes, hairpins, and pendants; clothe them in the regalia of feathered splendor. Let them tread the Nine Numinosities, escape the Five Turbidities. Extinguish the Three Wretched Paths and cleanse their sins; proclaim the Six Bowels and generate their fluids. Sever the root of earthly attachment, purge the corpse’s defilements. Forever dispel burning afflictions, universally attain cool purity. Renew the old and transform it, wash away flaws and polish grime. Ascend in substance to the realm of lofty brilliance, delight the spirit in the capital of mysterious clarity. Forever depart the dusty world, together ascend the shore of the Dao. Thus shall the transforming grace of the Most High Heavenly Worthy be manifest above, and the sincerity of our devotion be fulfilled below.\n\nTen Invocations:\nFirst invocation: One Real arrays the scene;\nSecond invocation: Two Images return and incline;\nThird invocation: Three Exalted Ones reflect and illumine;\nFourth invocation: Four qi harmonize and level;\nFifth invocation: Five Scriptures blaze resplendent;\nSixth invocation: Six Graces shine in unison;\nSeventh invocation: Seven Luminaries converge in auspiciousness;\nEighth invocation: Eight Trigrams thrive in uprightness;\nNinth invocation: Nine Lights revolve and encircle;\nTenth invocation: Souls and spirits ascend in flight.\n\n**Replenishing the Censer, Together with the Early Audience**\n\nThe second evening audience of the *Jade Register Grand Fast* concludes.\n\n---\n\n**Jade Register Grand Fast: Third Day Early Audience Rite**\n\nEach pays homage to the masters, contemplating as prescribed.\n\nThe Heavenly Writs remit sins, descending from the Great Tenuity. The Primal Transformation engenders and completes, the numinous smoke coils ninefold. Eight Effulgences and Six Circuits, the sacred course upheld—on the left, the Red Quarter receives guests; on the right, the Imperial Portal opens. The Eastern Flower and Southern Mansion refine and dispel wrong. The Wheel turns with the sun’s radiance, the gaze shifts with the moon’s splendor. Today is a great celebration, myriad paths converge as one. The true qi of the Mystic Altar preserves Heaven’s undiminished majesty. Universally proclaimed to the Three Realms, swift as dragons and winds.\n\n**Strike the Dharma Drum Twenty-Four Times**\n\nO Most High Three Heavens, Primal Origin, Three Qi, Most High Lord Lao: summon forth from within our bodies the Three and Five Merit Officers, the Left and Right Attendants, the Left and Right Golden Lads bearing incense, the Jade Maidens scattering flowers, the Five Thearchs’ Direct Messengers, the Incense Officials of the Day—thirty-six each, let them emerge. Emerging, let them be arrayed in solemn attire, caps and sashes with pendent cords. We now invoke the local deities and territorial Perfected of the Mystic Altar. Today, at this early audience, we ascend the altar to perform the Dao, to pay homage to the Imperial Perfected. Humbly we present our intentions and sincerities, all inscribed in sealed documents. May the numinous radiance of the Most High Perfected, the true qi of the Numinous Treasure, descend and flow into our bodies, that our supplications may swiftly reach the presence of the Most High, Boundless, Great Dao’s Three Clarities and August Saints, the Most Exalted Jade Emperor of the Golden Portals of the August Heaven.\n\n**Invoking the Sacred Ranks**\n\nWe, the assembled officiants and all present at this altar, with unified sincerity, now supplicate the Heavenly Worthy of the Void and Spontaneity, the Primordial Origin; the Most High Lord of the Dao, the Boundless Great Dao; the Most High Lord Lao; the August Jade Emperor; the Great Sage Hosts of the Ten Directions who have attained the Dao; the Perfected Lords and Masters; the Thirty-Two Heavenly Emperors; the Jade Tenuity Most High; the Great Emperor of the Jade Capital; the Eastern Flower, Southern Culmen, Western Numinosity, Northern Perfection, and the Golden Portals of the Seven Treasures’ Jeweled Terrace of the Purple Tenuity’s Upper Palace; the Numinous Treasure Most High, Illustrious Sovereign of the Dao; the Thirty-Six Divisions of Venerable Scriptures; the Great Dharma Masters of the Mystic Center; the Supreme Ministers, Prime Ministers, Supreme Protectors, and Supreme Tutors; the Twenty-Four Perfected of the Great Peace’s Lesser Teaching; the King of Total Perfection of the Western City; the Perfected of the Great Unity; the Supreme Minister of the Eastern Marchmount and Controller of Destinies; the Two Perfected Lords Mao, Regulators of Records and Protectors of Life; the divine immortals who have attained the Dao in the named mountains and grotto-heavens; the divine officials of the Three Realms; and all true numina.\n\nWe have heard that the Seven Simplicities revolve, presaging the division of the Seven Yangs; the Five Primes unite, illuminating the Five Wefts to ride the heavens.\n\nThe Essence stores the subtle and profound, floating high in the pure void. It gathers the qi of the divine blossoms, initiating the radiance of the luminous light. Accumulated titles extend prosperity, unfolding through countless kalpas. It records the jade calendar of the Primordial Numen, congealing into scripture; it unfolds the treasure chapters of the Yellow and Lao, with talismanic seals of emptiness and effulgence. The Eight Potencies settle in tranquility, and the myriad treasures come into being.\n\nWe, who hold humble positions in the Mystic Gate and are listed in the Purple Registers, partake in the natural Dao of the Golden Towers, meditating in stillness upon the Perfected; we receive the texts of the Great Existence from brocade pouches, reverently adhering to their precepts. In all matters of memorials and petitions, how dare we not make them known? With sincere intent in our blue-green memorials, we dutifully proclaim and present them.\n\n**Proclamation of the Memorial:**\nAs stated in the memorial’s intent, we do not deviate from its earnest supplication. We beseech the Great Dao to discern our humble prayers.\n\nWe have heard that the Profoundly Quiescent Primordial Honored One governs the Clear and Subtle without dominion; soothing and pacifying the Nine Domains, treading the mysterious workings with impartiality. It broadly bestows the causes of the wondrous Dao, and the hardships of the Supreme Ultimate’s hidden paths.\n\nWe, awaiting the dawn, preserve the spirits; at daybreak, we practice the Dao. Purple auroras illuminate the sun as the Azure Dragon first ascends Fusang; crimson radiance streams across the sky as the Solar Chariot journeys through the Eastern Land. The whirlwind returns the wheel to the true realm, and clouds gather like canopies in the Great Void. Reverently transmitting incense, we undertake the fast with devotion.\n\nOn this third day at dawn, as we practice the Dao, we invite the assembly of the Dharma to offer the first pinch of incense. May the smoke of this incense ascend directly to offer reverence to the Primordial Honored One of the Void and Perfected, the Natural Great Dao, the Celestial Worthy of Original Beginning.\n\nMay the merit of this pinch of incense extend upward to bless the present Emperor, that his august mandate endure without end. We humbly pray that he receive a hundred auspices and align with the Seven Governors. May auspicious grain and vermilion herbs repeatedly bring harmony to the earth’s treasures; may sweet dew and propitious stars manifest the heavens’ blessings. May dragon-horses come from the Western Limits, and phoenixes gather in the Purple Court. May all blessings be fully bestowed, and the Four Spirits assemble. May precious talismans arrive in abundance, and harmonious qi flow everywhere.\n\nThus, we now burn incense, from our devotion to the Dao, the Venerable, the Great Sage Assembly, and the Perfected’s virtue. After attaining the Dao, we pray for the heavens’ eternal preservation.\n\nWe have heard that the Jade Slips bestow texts, serving as the model for humans and devas; the Golden Perfected expound the teachings, becoming the bridge across birth and death. The merit of the wondrous existence is vast, and the transformations beyond naming are profound.\n\nOn this third day at dawn, as we practice the Dao, we invite the assembly of the Dharma to offer the second pinch of incense. May the smoke of this incense ascend directly to offer reverence to the Celestial Worthy of the Jade Dawn, the Perfected and Natural Numinous Treasure, the Great Dao, the Celestial Worthy.\n\nMay the merit of this pinch of incense extend upward to aid the spirit of [Name]. We humbly pray that the Nine Mysteries and Seven Ancestors, and the karmic kin of countless kalpas, may together ride the vast auroras and soar through the empty caverns. May they ascend to Perfection and awaken to the Dao, accompanying the Nine Elders in roaming; may they refine the mysterious and temper the true, joining the Ten Flowers in chanting and singing. May they sever the summons of the demon officials and cross over to the Upper Southern Palace; may they endure through kalpas, long preserved, and attain deliverance in body. May blessings flow to descendants and felicity extend to clan and kin.\n\nNow, therefore, we kindle incense and take refuge in the scriptures, the Venerable, the Great Sage Hosts, and the virtue of the Perfected, who, having attained the Dao, ascend into formlessness.\n\nWe have heard that the sagely virtue, all-embracing, inscribes the Jade Register of Prolonged Life; the Dao’s compassion, boundless in love, unfolds the Mystic Writ of Fallen Death. It revolves yin and yang, presiding over the workings of creation.\n\nOn this third day at dawn’s rite of the Dao, we invite the Dharma assembly to offer this third pinch of incense. May its fragrant smoke ascend through the void to directly present offerings to the Primordial Great Sage, the Natural Sovereign of Transformations, the Celestial Worthy of Dao and Virtue.\n\nMay the merit of this pinch of incense extend upward to aid the spirit thus invoked. We humbly pray that the ranks of Perfected Immortals may gather, their qi returning to the Brahmā’s retinue. May they delight in distant contemplation, veiled by the verdant radiance of luxuriant leaves; may they raise their sleeves in lofty ascent, listening to the wondrous strains of the jade chambers. May they rest in the shade of limpid, cool isles, and ride the wheel upon the profound and boundless thoroughfare. May they gird themselves with renewed openness, partaking in the numinous transformations. May their luminous souls follow their original nature, their mysterious union without limit.\n\nNow, therefore, we kindle incense and take refuge in the Preceptor, the Venerable, the Great Sage Hosts, and the virtue of the Perfected, who, having attained the Dao, ascend into formlessness.\n\nRepentance—thrice invoked.\n\nThrice we bow in reverence. Again invoking the sacred ranks, we, the assembled officiants and all present before the altar, with one heart and sincere devotion, reverently address the Three Purest Venerables, the Ten Directions’ Most Sagely Ones, the Heavenly Emperors and Perfected of the Jade Capital and Golden Towers, the Master Hosts of the Ten Directions, the divine assemblies of the Three Realms, and all numinous powers.\n\nWe have heard that when the Seven Gates of transgression are opened, the stellar lodges shine bright and still the shadows; when the Nine Yangs conjoin their qi, form and spirit are refined and ascend at dawn. We, from early days, have admired the path of pure cultivation and gained access to its profound mysteries. Thus should we nurture the embryonic infant in simplicity, sitting in attainment of the natural; merge the qi of all life into the body, personally practicing inner refinement. Yet, not having reached the realm of spirit-transformation, we must apply diligent effort. We vow to guide and receive all beings, pledging to propagate the great teaching. Moreover, in accordance with the sacred command, we reverently perform this ritual.\n\nNow, on behalf of [Name of the Deceased], from past lives to the present incarnation, in thought and deed, by intention or error, we acknowledge faults and transgressions. Unable to maintain unwavering sincerity or steadfastly uphold gentleness and goodness, lacking the sincerity of self-reflection and failing to observe the precepts of Perfected attainment, we fear returning to the human realm, long submerged in worldly toil. Unable to preserve life and cherish the spirit, we reach death’s dissolution without regard. Enmeshed in sound and form, we depart from our original true nature, causing the qi of life to lose its flow and the roots of death to bind and stagnate.\n\nWe beseech refinement and deliverance, that all may universally attain ascension. May the Three Purest Venerables look upon living beings with compassion and broadly bestow their mysterious grace. We invoke the Lads of the Nine Lights and entreat the Divine Lords of the Five Ancients. We spread the five-colored essence as nectar and pour forth the qi of the Nine Yangs. Flames of flowing fire bathe us, and we are cleansed in the yellow blossoms. We further invoke the Hundred-Tempered Vajras and the Thousand-Harmonized Jade Liquor. The Primordial Sovereign scatters wondrous essence, and the Great White streams forth radiance. We proclaim the opening of the womb’s source, dissolving knots and obstructions, blending spirit and substance, refining body and mind. May the viscera be cooled and cleansed, the hun and shen settled and pacified. May the bones return from death, the yin transform into yang. We again command the celestial physicians’ messengers to scatter the divine medicines of the Great Purity. Thus may the soul receive refinement and the immortal transformation be renewed. Riding the Nine Qi to form the body, receiving nurture from the Three Origins, the Three Passes and Five Viscera, the Six Palaces and Nine Palaces, the original gods of life and the roots of destiny are restored. United with the numinous and relinquishing breath, all in the womb attain birth and completion; withered bones and dry skeletons exchange their substance and are universally delivered.\n\nMay this manifest the great compassion of the Heavenly Worthy above and fulfill our devotion in taking refuge below.\n\nRespectfully we make this entreaty known.\n\nFirst, may the heavens be clear and the qi bright;\nSecond, may the sun shine and the moon attend;\nThird, may auspicious stars appear;\nFourth, may the Dharma-rain fall abundantly;\nFifth, may karmic grievances cease their opposition;\nSixth, may suffering and lamentation be stilled;\nSeventh, may dragon-script dance in flight;\nEighth, may phoenix-seals flow like molten gold;\nNinth, may the Perfected and Numinous descend and gather;\nTenth, may blessings extend to the hidden and the departed;\nEleventh, may all souls be universally delivered;\nTwelfth, may all ascend with ease.\n\nThe incense is renewed. With focused spirit, we burn the incense.\n\nFragrant Bureau Envoys, Left and Right Dragon-Tiger Lords, and all Attending Fragrant Spirit-Officials—may this place where we have this morning ascended the altar to perform the Dao now spontaneously generate golden liquid, cinnabar, azure mushrooms, and divine herbs. May the hundred numinous Perfected gather here before the incense burner.\n\nWe pray that the jade maidens and immortal youths of the ten directions receive the orchid-scented smoke and swiftly convey the sincerity of our supplications directly to the presence of the Most Real and Boundless Dao’s Three Clarities, the August Celestial Venerables, and the Jade Emperor of the Golden Gates of the Supreme Heavenly Honored One.\n\nThe third-day morning audience of the Great Register Purification Rite is now concluded.\n\nAll pay homage to the masters and maintain contemplation according to the method.\n\nThe Primordial Sovereign of the Void, gathering qi, abides at the center.\nThe three realms stretch into profound obscurity, giving rise to the vault of heaven.\nSeven revolutions and nine numina merge and return with the wind.\nTransforming into myriad spirits, heaven and earth open and connect.\nOn this auspicious day, the rite is performed—ten thousand demons submit in reverence.\nMorning radiance shines brightly as the primordial work is silently enacted.\nHolding the tally and raising the banner, flowers scatter across the great void.\nThe ten directions are universally delivered; kalpas endure without end.\n\nThe incense is kindled, as in the morning audience.\n\nWe now declare the dharma-positions.\n\nWe, the assembled officiants and altar-attending assembly, respectfully unite in sincerity above.\n\nWe now invoke the Primordial Heavenly Worthy of the Void and Spontaneous Dao, the Boundless Great Dao and Supreme Lord of the Dao, the Supreme Lord Lao, the August Jade Emperor, the perfected and sagely hosts of the ten directions who have attained the Dao, the perfected lords and venerable masters, the thirty-two Heavenly Lords, the Jade Sovereign of the Void, the Great Jade Emperor, the Eastern Florescence and Southern Culmen, the Western Numinous and Northern Perfected, the Mystic Capital and Golden Portals of the Seven-Jewel Jeweled Terrace, the Purple Tenuity and Upper Palace, the Numinous Treasure and Perfected Radiant Sovereign of the Dao, the thirty-six revered scriptures, the Great Dharma Masters of the Mystic Center, the High Ministers and High Chancellors, the High Protectors and High Tutors, the twenty-four perfected of the Great Peace’s lower teachings, the King of Total Perfection of the Western City, the Perfected of the Great One, the High Minister of the Eastern Peak and Controller of Destiny, the Two Perfected Lords Mao of the Register of Life, the divine immortals who have attained the Dao in the grotto-heavens and sacred mountains, the officials of the three realms, and all true numina.\n\nWe have heard that the eight luminous scenes conceal their radiance, merging the Great Obscurity with the colorless; the single yang accumulates qi, congealing the Brahma-chaos in the primordial origin. The first sprouting of the light of the upper scene thus responds to the title of the Kaihuang era. Mystic essence emits its brilliance, forming images and flowing into shapes. When the five kalpas had run their course, the nine heavens and eight transformations saw the Primordial Beginning first enfeoffed in the Purple Canon; the celestial patterns were displayed, and the august person inscribed the statutes in jade tablets. Holding fast to the kalpas’ turning, all demons submit in reverence, and the myriad states enjoy peace.\n\nWe, unworthy though we are to stand among the perfected, have long received the shelter of their wondrous grace. Bearing the nine-colored round image, we swallow the fluids and hold the visualization; chanting the numinous chapters of the Three Unions, we follow the regulations and uphold them. In all that we now declare, how dare we not make it known? The green-worded memorial of our fast’s intent shall now be respectfully proclaimed.\n\nProclamation:\nAs the words declare, without deviation from our earnest supplication, we humbly beseech the Great Dao to distinguish and heed our prayers.\n\nWe have heard that the solitary revelation of the original true nature saves all sentient beings across ten thousand kalpas; the vast proclamation of wondrous transformation delivers the nine dark realms of suffering without bound. Hidden and manifest alike flourish, and humans and heavens alike depend upon it.\n\nWe, reverently adhering to the fast’s rites, have not paused even to eat. The yang-crystal turns the candle as we approach the first moment of midday; the brilliance of the day’s light ascends, and all gaze upon the illumination of the zenith. The green chariot tilts its light and returns; purple smoke forms talismanic script and floats in the void. With reverence we borrow the transmission of incense to perform the fast’s duties.\n\nOn this third day, at the midpoint of the circuit, we invite the dharma assembly to offer the first pinch of incense. May this incense smoke ascend directly to offer homage to the Primordial Heavenly Worthy of the Void, the Spontaneous, and the True Great Dao.\n\nBy the merit of this pinch of incense, we pray for the long and boundless mandate of the present emperor. May his transformation reach the eight borders and his teachings extend to the six directions. May golden harvests correspond to the signs, and the threefold abundance be recorded as a year of great plenty; may the royal way be rightly illuminated, and a thousand years enjoy the fortune of great peace. May the sun’s image shine with doubled radiance, and the stars manifest their orderly auspices. May the seas be calm and the rivers clear, clouds move and rain fall. May the ten thousand regions rejoice, and the four seas know no peril.\n\nFor this purpose we now burn incense, from our refuge in the virtue of the Dao, the venerable sagely hosts, and the perfected, that after attaining the Dao, they may long endure in heaven.\n\nWe have heard that the Yuluo Xiaotai is the transformed realm of the Three Clarities; the scriptures of the Mystic Teachings emerged from the five kalpas. Thus the true is eternally preserved, and heaven’s protection knows no limit.\n\nOn this third day, at the midpoint of the circuit, we invite the dharma assembly to offer the second pinch of incense. May this incense smoke ascend directly to offer homage to the Jade Dawn, the Most Sagely, the Spontaneous, and the Numinous Treasure Great Dao Heavenly Worthy.\n\nBy the merit of this pinch of incense, we pray for the imperial line and the ancestral branches. May names be inscribed on the azure tablets and recorded in the cinnabar registers. May numinous radiance shine forth in the realm of longevity, adding distant years; may the foundation of fortune be as firm as the kalpa-stone, eternally securing favor and emolument. May the union of great harmony endure, and the preservation of true qi long sustain. May descendants flourish and multiply, and affinal kin live in harmony.\n\nFor this purpose we now burn incense, from our refuge in the virtue of the scriptures, the venerable sagely hosts, and the perfected, that after attaining the Dao, they may ascend into the formless.\n\nWe have heard that the Beginning Azure inaugurated the turning, the Three Perfected all appeared, and the Dao and virtue were perfectly communicated; the Numinous Treasure delivers living beings, and the ten thousand qi long endure, while souls and spirits become clear and upright. The work is subtle and wondrous, and forms respond in an instant.\n\nOn this third day, at the midpoint of the circuit, we invite the dharma assembly to offer the third pinch of incense. May this incense smoke ascend directly to offer homage to the Primordial Great Sage, the Spontaneous Transformer, and the Heavenly Worthy of the Dao and its Power.\n\nBy the merit of this pinch of incense, we pray for the spirits being offered to. May they rest in clarity and ease, moving with leisure in the empty and wondrous. May the cloud thoroughfares shine with radiance, transcending the four great elements in the divine realm; may the empty void flow with sound, departing the nine mysteries of the dark borders. May their hearts scatter above the layered heavens, and their qi congeal within the flowery palaces. May they unfasten their robes and loosen their sashes, free in coming and going. May they fly and wander at will, responding to stimuli without limit.\n\nFor this purpose we now burn incense, from our refuge in the virtue of the masters, the venerable sagely hosts, and the perfected, that after attaining the Dao, they may ascend into the formless.\n\nRepentance:\nWe now make the Threefold Invocation.\n\nThe Threefold Prostration. Again invoking the sacred ranks, we, the assembled officiants and altar attendants, with utmost sincerity jointly address the Three Pure Ones Most High, the Ten Directions’ Sagely Hosts, the Heavenly Perfected of Jade Capital and Golden Towers, the Ten Directions’ Venerable Masters and Holy Assemblies, the officials and spirits of the Three Realms, and all majestic numina.\n\nWe have heard that when the dark night parts to reveal light, eight transgressions are purified through earnest recitation; when the dead souls undergo refinement, the Nine Mysteries ascend and transform to be reborn. We have been fortunate to encounter the true canon and early receive the secret registers. Thus we ought to bathe in the mystic waves of the immortal well, cleansing thoughts and clarifying the mind; to shelter beneath the sacred boughs of the numinous tree, returning to the root and restoring life’s mandate. Though still bound by worldly affairs, how dare we slight the heart of the Dao?\n\nHaving received the masters’ covenant, we bear the duty of spreading the teachings. Moreover, entrusted with these sacred words, we reverently perform this ritual. Now we turn our thoughts to the wandering souls and lingering spirits, from past lives to the present incarnation. In every intention and emotion, they have erred and transgressed. Unable to cultivate warmth and reverence for the Dao, or humility in self-cultivation, they may have served the true and authentic yet harbored arrogance and neglect; or occupied high positions yet indulged in pride and excess. Some have bullied others with contempt, some boasted and relied on their own strength. Clinging to vicious traits and indulging haughty hearts, they have greatly deviated from the virtue of yielding and modesty, shaming the precepts of attaining the true.\n\nWe fear that upon their passing, their ascent or descent remains uncertain. We worry that through countless kalpas of rebirth, they drift from life to life, their souls adrift like waves, unable to return to their original root; their nature and consciousness benighted, still bound to perverse factions. Mired in the realms of suffering, they have not escaped the heavy yin. We beseech the grace of pardon, that they may soon fulfill their wish for rebirth.\n\nMay the supreme transformation of great compassion deliver the souls lost in the long night. May evil roots be dissolved, and transient spirits return to their origins. As they receive deliverance, may all ascend as immortals. We entreat the Five Venerable Lords of the Numinous, and command the Nine Heavens’ Emperors. We invoke the Three Luminaries and Nine Venerables, the Most High Elder, the Twelve Hundred Official Lords, the myriad layers of Dao-qi, the Benevolent Lord Han of the Southern Palace of the Vermilion Mound Fire Treasury, the Jade Casket Receiver of Deliverance Envoy Sima Yuanyang, the Life-Prolonging and Fate-Improving Deliverer from Tribulation, the Registrar Perfected, the Life-Monitoring Holy Mother, the Lord of Non-Duality, the White Prime Spirit.\n\nTogether with the Life-Extending and Health-Uniting Great Unity Lord of Destiny, we supplicate the divine presence. May the Nine Mysteries and Seven Ancestors respond with harmony and compliance. May they be escorted and welcomed, receive form through returning qi, and have their names inscribed and lifespans determined. May auspicious smoke block the gates of death and propitious clouds open the doors of life. May the roots of the numinous be gathered, and good fruits be perfected. Thus shall the transformation of the Most High Heavenly Worthy’s great compassion be made manifest above, and our devotion in taking refuge be answered below.\n\nWe reverently announce:\n\nFirst, may the dragon-script shine resplendently;\nSecond, may the phoenix-tallies present auspicious signs;\nThird, may the heavens’ registrars record all;\nFourth, may the immortal music resound;\nFifth, may the Three Officials inscribe good deeds;\nSixth, may the Nine Nights be suffused with light;\nSeventh, may grievances be harmonized and debts closed;\nEighth, may knots be untied and calamities removed;\nNinth, may demons be subdued and merits secured;\nTenth, may souls be delivered to the immortal realms;\nEleventh, may the grace of enlightenment spread universally;\nTwelfth, may the merit and power be immeasurable.\n\nThe incense is replenished, and the morning audience concludes.\nThe third-day noon audience of the Jade Register Grand Retreat is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "玉箓三日九朝仪 经名：玉箓三日九朝仪。 三卷。 底本出处：《正统道藏》洞玄部威仪类。 玉箓大斋第一日早朝仪 各礼师，存念如法 金真绿霞，焕映三天。 飞云丹霄，诸天控軿。 晨晖启旦，阴翳俱捐。 九微震空，五星回旋。 万天感应，自然妙玄。 杳冥散体，分形百千。 玄珠光耀，瑞炁坛乾。 幽明蒙惠，灌炼金泉。 魔王恐惧，合景三田。 发炉 鸣法鼓二十四通 无上三天玄元始三炁太上老君，召出臣身中三五功曹、左右官使者、左右捧香金童、传言散花玉女、五帝直符直日香官，各三十六人出。 出者，严装显服，冠带垂缨。 关启玄坛土地，方域神真。 臣今早朝，升坛行道，朝谒帝真。 敬奉入意其诸诚意，具载缄誊。 愿得太上至真道炁灵宝瑞光下降，流入臣等身中，令臣所启之诚，速达径诣至真无极大道三清上圣、昊天至尊金阙玉皇上帝御前。 请称法位 具位与临坛官众等，谨同诚上启虚无自然元始天尊，无极大道太上道君，太上老君，高上玉皇，十方已得道大圣众至真诸君丈人，三十二天帝君，玉虚上帝，玉帝大帝，东华南极西灵北真玄都玉京金阙七宝琼台紫微上宫灵宝至真明皇道君，三十六部尊经，玄中大法师，上相上宰、上保上傅、太平下教二十四真人，西城总真王君，太乙真人，东岳上卿，司命茅君，定录保命二真人，名山洞府得道神仙，三界官属，一切真灵。 臣闻，一炁潜凝，混合空玄之始； 三华郁秀，胚胎溟涬之初。",
      "translated_text": "The *Jade Register Three-Day Nine-Morning Ritual*\nText Title: *Jade Register Three-Day Nine-Morning Ritual*\nThree fascicles.\nSource text: *Zhengtong Daoist Canon*, Dongxuan Section, Wei Yi (Ritual Propriety) Category.\n\n**First Day Early Morning Ritual of the Jade Register Grand Fast**\n\nAll pay homage to the master and maintain mindfulness as prescribed:\n\nGolden Perfection and Verdant Radiance illumine the Three Heavens,\nCrimson clouds soar through the Cinnabar Empyrean—all heavens guide their chariots.\nMorning brilliance unfolds the dawn, dispelling yin’s shadows entirely.\nThe Nine Subtleties shake the void; the Five Stars revolve.\nMyriad heavens respond in resonance, naturally wondrous and profound.\nIn the distant dark, the body disperses, dividing into a hundred thousand forms.\nThe Mystic Pearl shines resplendent; auspicious *qi* fills the altar’s firmament.\nThe hidden and manifest receive grace, refined by the Golden Spring’s flow.\nDemon kings tremble in fear; the Three Fields merge in radiant harmony.\n\n**Kindling the Incense Burner**\nStrike the ritual drum twenty-four times.\n\nO Most High Three Heavens, Mysterious Primordial Three *Qi*, Supreme Venerable Lord Lao, summon forth from within my body the Three and Five Merit Officers, the Left and Right Attendant Messengers, the Left and Right Incense-Bearing Golden Lads, the Jade Maidens who convey words and scatter flowers, and the Five Thearchs’ Direct Talismans and Daily Incense Officials—thirty-six of each.\nLet them emerge, adorned in solemn attire, crowned and sashed with hanging tassels.\nNotify the Land Spirit of the Mystic Altar and the local deities and perfected ones.\nThis morning, I ascend the altar to perform the Dao, offering audience to the Imperial Perfected.\nWith reverence, I present my sincerest intentions, all recorded in sealed writ.\nMay the Supreme Perfected’s *Dao-qi*, the Numinous Treasure’s auspicious radiance descend,\nflowing into our bodies, that the sincerity of my petition swiftly reach\nthe presence of the Most High and Boundless Dao’s Three Pure Ones and August Saints,\nbefore the Golden Portal Jade Emperor, Supreme Lord of the Vast Heaven.\n\n**Proclaiming the Dharma Titles**\nAll present officials and altar assembly, with unified sincerity, reverently address:\n\nThe Primordial Heavenly Worthy of the Void and Spontaneous,\nThe Boundless Great Dao’s Supreme Lord of the Dao,\nThe Supreme Venerable Lord Lao,\nThe August Jade Emperor,\nThe Great Sage Perfected Ones of the Ten Directions who have attained the Dao,\nThe Lords and Masters of the Thirty-Two Heavens,\nThe Jade Clarity Emperor,\nThe Great Emperor of the Jade Thearch,\nThe Eastern Florescence, Southern Culmen, Western Numinous, Northern Perfected,\nThe Golden Portal of the Mystic Capital, the Seven-Treasure Jeweled Terrace of the Purple Tenuity Upper Palace,\nThe Numinous Treasure’s Supreme Clarity Radiant August Lord of the Dao,\nThe Thirty-Six Divisions of Venerable Scriptures,\nThe Great Dharma Masters of the Mystic Center,\nThe Supreme Ministers, Supreme Chancellors, Supreme Protectors, Supreme Tutors,\nThe Twenty-Four Perfected of the Great Peace’s Lesser Teaching,\nThe Lord King of Total Perfection of the Western City,\nThe Perfected of the Great One,\nThe Supreme Minister of the Eastern Marchmount,\nThe Lord Mao of Life Mandates,\nThe Two Perfected of Determined Records and Life Preservation,\nThe Divine Immortals who have attained the Dao in the sacred mountains and grotto-heavens,\nThe officials of the Three Realms,\nand all true numina.\n\nWe have heard:\nOne *qi* subtly congeals, merging at the inception of the empty and profound;\nThe Three Effulgences flourish luxuriantly, gestating at the dawn of the primordial vastness.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 575,
      "start_sentence": 0,
      "end_sentence": 26,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.30557131767273,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓大斋三日九朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "妙极难言，其中有象。 上无复祖，惟道为身。 蕴二象以储神，摄九霄而揔化。 肇高上玉皇之炁，大梵弥罗； 自太无混洞之元，赤文开廓。 敷弘至妙，离合自然。 臣等夙遇真风，幸逢昌运。 乘良晨而悟会，窃侍神章； 冒灵盻以披心，获参上范。 凡有所启，敢不以闻。 斋意青词，谨当宣奏。 具如词言，不违恳款。 恩惟太上，分别哀祈。 臣闻，至尊湛寂，运阴阳不测之机； 妙境空浮，结日月飞奔之室。 丹灵鼓舞，白鹤翩翻。 臣等昧爽朝元，夙兴请命。 赤童耀景，引赐谷之流晨； 青老散辉，接木宫之生炁。 三色蓊冥於室内，百灵交会於炉前。 恭假香传，奉修斋直。 以今第一日清旦行道，请法众等，运兹初捻上香。 愿此香烟腾空，径上供养虚无至真自然大道元始天尊。 愿以是捻香功德，上祝当今皇帝，圣寿无疆。 伏愿一德格天，万年永命。 膺图握契，睿龄齐箕翼之光，锡嘏迎祥，景福等冈陵之固，丕衍后天之算，远超浩劫之年。 九有八荒，咸归仁寿。 千秋亿载，长抚隆平。 今故烧香，自归依道尊大圣众，至真之德，得道之后，保天长存。 臣闻，紫素生辉，大圣庆骞林之会； 祥光含象，玉皇映兰室之华。 披朗重阴，混融万类。 以今第一日清旦行道，请法众等，运兹二捻上香。 愿此香烟腾空，径上供养玉晨至圣自然灵宝大道天尊。 以是捻香功德，上资宗祧神御，社稷真游。 伏愿炼质丹台，怡神紫极。 逍遥自在，盻宗庙以储精； 证圣成真，升帝乡而入妙。 福覃家国，泽及寰区。 今故烧香，自皈依经尊大圣众，至真之德，得道之后，升入无形。 臣闻，玄父玄母，化三田子午之宫； 真景真晶，受九炁东西之运。 琼津流润，丹室常存。 以今第一日清旦行道，请法众等，运兹三捻上香。 愿此香烟腾空，径上供养混元大圣自然化主道德天尊。 愿以是捻香功德，上资所荐神仪。 伏愿道契无为，心游太素。 紫微真境，参上圣於九囗； 碧落琼宫，陪高仙於三境。 餐台音於空囗，囗囗炁於玄元。 垂裕后昆，本友百世。 传休中禁，子孙亿年。 今故烧香，自皈依师尊大圣众，至真之德，得道之后，升入无形。 和与道合真。 礼方",
      "translated_text": "The sublime surpasses all speech, yet within it lies form.\nAbove, there is no further ancestry—only the Dao is its body.\nIt enfolds the Two Images to store the spirit,\nand gathers the Nine Heavens to govern all transformations.\nIt first gave rise to the *qi* of the Most High Jade Emperor,\nthe Great Brahmā of the Vast Net;\nFrom the primordial chaos of the Supreme Void,\nthe Red Script unfolded the expanse.\nIt unfolds and magnifies the most wondrous,\nparting and merging in spontaneity.\n\nWe, your servants, have long encountered the true wind\nand fortunately met with flourishing fortune.\nRiding the fair dawn to awakening and communion,\nwe humbly attend the divine scriptures;\nExposing our hearts to the radiant gaze,\nwe attain to the supreme model.\n\nIn all that we initiate,\nwe dare not fail to make known.\nWith sincere intent in our blue-green memorial,\nwe reverently present our petition.\nAs stated in the words of the memorial,\nwe do not deviate from our earnest plea.\n\nMay the Most High, in mercy, discern and heed our prayer.\n\nWe have heard:\nThe Most Venerable abides in profound stillness,\nwielding the unfathomable mechanism of yin and yang;\nThe wondrous realm floats in emptiness,\nstructuring the chamber where sun and moon swiftly course.\nCinnabar spirits dance,\nwhite cranes wheel in flight.\n\nWe, your servants, rise before dawn to greet the origin,\ndiligently seeking the mandate.\nThe Red Youth shines with radiance,\nguiding the flowing dawn of the Valley of Bestowal;\nThe Azure Elder scatters brilliance,\njoining the *qi* of life from the Wooden Palace.\nThree hues mingle in obscurity within the chamber,\na hundred spirits gather before the incense burner.\n\nWith reverence, we transmit the fragrance,\noffering the rites of the fast.\nOn this first day, at the clear dawn of the Dao-procession,\nwe, the assembly of the Dharma, invoke the first pinch of incense.\nMay this fragrant smoke ascend to the heavens,\ndirectly offering to the Primal Heavenly Worthy of the Void and Most True, the Natural and Great Dao.\n\nBy the merit of this pinch of incense,\nwe pray for the present emperor,\nwhose sacred longevity knows no bounds.\nMay his singular virtue reach heaven,\nand his mandate endure for ten thousand years.\nMay he receive the chart and grasp the tally,\nhis wise years equaling the brilliance of the Dipper and Weaver;\nMay he be granted felicity and welcome auspiciousness,\nhis blessed fortune as steadfast as the hills and mountains.\nMay his years extend beyond heaven’s reckoning,\nfar surpassing the vast kalpas.\nMay the Nine Provinces and Eight Wastes\nall attain benevolence and longevity.\nFor a thousand autumns and ten thousand generations,\nmay he long uphold prosperity and peace.\n\nThus, we now burn incense,\nand from this moment, take refuge in the Dao, the Venerable, the Great Sage Assembly,\nand the virtue of the Most True.\nAfter attaining the Dao,\nmay we preserve heaven and endure forever.\n\nWe have heard:\nPurple silk shines with splendor,\nas the Great Sage celebrates the assembly in the Forest of Auspiciousness;\nAuspicious light bears form,\nas the Jade Emperor illumines the orchid chamber’s glory.\nDispelling the dense shadows,\nit merges and harmonizes the ten thousand kinds.\n\nOn this first day, at the clear dawn of the Dao-procession,\nwe, the assembly of the Dharma, invoke the second pinch of incense.\nMay this fragrant smoke ascend to the heavens,\ndirectly offering to the Jade Dawn, the Most Sacred, the Natural and Numinous Treasure of the Great Dao, the Heavenly Worthy.\n\nBy the merit of this pinch of incense,\nwe pray for the ancestral shrines, the divine presences,\nand the true wanderings of the altars of soil and grain.\nMay they refine their essences on the cinnabar terrace,\nand delight their spirits in the Purple Ultimate.\nAt ease and free,\nmay they gaze upon the ancestral temples to store their essence;\nAttaining sageliness and achieving perfection,\nmay they ascend to the imperial homeland and enter the wondrous.\nMay blessings overflow the household and state,\nand grace extend throughout the realm.\n\nThus, we now burn incense,\nand from this moment, take refuge in the Scriptures, the Venerable, the Great Sage Assembly,\nand the virtue of the Most True.\nAfter attaining the Dao,\nmay we ascend into the formless.\n\nWe have heard:\nThe Mysterious Father and Mysterious Mother\ntransform the Three Fields of the Palace of Zi and Wu;\nThe True Radiance and True Essence\nreceive the *qi* of the Nine Heavens’ east and west movements.\nJade nectar flows and moistens,\nthe cinnabar chamber abides forever.\n\nOn this first day, at the clear dawn of the Dao-procession,\nwe, the assembly of the Dharma, invoke the third pinch of incense.\nMay this fragrant smoke ascend to the heavens,\ndirectly offering to the Primal Vast Great Sage, the Natural Lord of Transformation, the Heavenly Worthy of the Dao and Its Virtue.\n\nBy the merit of this pinch of incense,\nwe pray for the divine forms of those being offered.\nMay their Dao accord with non-action,\nand their hearts wander in the Supreme Simplicity.\nIn the Purple Tenuity’s true realm,\nmay they attend the supreme sages in the Nine [Heavens];\nIn the Azure Vault’s jade palace,\nmay they accompany the lofty immortals in the Three Realms.\nMay they feast on the terrace’s sounds in the empty [void],\nand [absorb] the *qi* of the Mysterious Origin.\nMay they bestow abundance upon later descendants,\nand root friendship for a hundred generations.\nMay they transmit blessings within the central禁,\nand their descendants flourish for a hundred million years.\n\nThus, we now burn incense,\nand from this moment, take refuge in the Masters, the Venerable, the Great Sage Assembly,\nand the virtue of the Most True.\nAfter attaining the Dao,\nmay we ascend into the formless.\n\nHarmonizing with the Dao, we unite with the true.\nThe rites are complete.",
      "overlap_context": "ected of the Great One,\nThe Supreme Minister of the Eastern Marchmount,\nThe Lord Mao of Life Mandates,\nThe Two Perfected of Determined Records and Life Preservation,\nThe Divine Immortals who have attained the Dao in the sacred mountains and grotto-heavens,\nThe officials of the Three Realms,\nand all true numina.\n\nWe have heard:\nOne *qi* subtly congeals, merging at the inception of the empty and profound;\nThe Three Effulgences flourish luxuriantly, gestating at the dawn of the primordial vastness.",
      "start_char": 575,
      "end_char": 1391,
      "start_sentence": 27,
      "end_sentence": 81,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.670387744903564,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓大斋三日九朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "忏悔 三启 三礼 重称法位 具位与临坛官众等，谨同诚上启三清至尊，十方上圣，玉京金阙天帝天真，十方师尊圣众，三界官属，一切威灵。 臣闻碧落受经，一遍诸天而称善； 素车开导，历关三界以咸听。 臣等猥以凡资，叨裨玄化。 所宜栖神道域，咀空碧以炼真，绝迹尘寰，想丹华而轻举。 告盟之始，立功为先。 故演法以度人，誓赞天而敷教。 况承上命，恭为典行。 敬为某灵崩逝以来，追念劬劳，昊天罔极。 思慕真容，特伸报荐。 特命羽流之众，敬修玉箓之斋。 开度神仪，上登天府。 伏愿神超碧落，质炼丹庭。 游神清净之乡，悟道虚无之境。 名高玉简，位列琼宫。 次冀帝道遐昌，王储衍固。 圣德有同於尧舜，辅臣允赖於皋夔。 睿算延洪，边陲宁谧。 普天率土，均承浩荡之恩； 十地九幽，咸遂生成之乐。 则上明天尊大慈之泽，下副臣等皈命之诚。 谨启以闻。 十二愿 一愿三尊降鉴，二愿五老倾光， 三愿神光洞焕，四愿九炁垂祥， 五愿五行应运，六愿灵篆飞翔， 七愿坎离结运，八愿九夜舒芒， 九愿玄坛灵应，十愿名列上苍， 十一愿神仪受度， 十二愿国祚延长。 复炉 存神烧香",
      "translated_text": "Confession\n\nThrice we invoke, thrice we bow, and once more we intone the sacred titles. All those in attendance—officiants, altar officials, and the assembled—humbly and with one heart supplicate the Three Purities Most Revered, the Ten Directions’ Lofty Sages, the Heavenly Perfected of the Jade Capital and Golden Towers, the Celestial Emperors and Heavenly Immortals, the Ten Directions’ Masters and Sacred Assemblies, the officials of the Three Realms, and all majestic spirits.\n\nWe have heard that when the Azure Vault received the scriptures, all heavens resounded with praise; when the White Chariot opened the path, it traversed the Three Realms, and all listened. We, unworthy though we are of mortal endowment, have presumptuously aided the transformation of the Mysterious. We ought to nest our spirits in the realm of the Dao, to refine our truth by partaking of the empty azure, to sever ties with the dusty world, and to ascend lightly upon thoughts of the Cinnabar Splendor.\n\nAt the outset of this covenant, merit-making takes precedence. Thus, we expound the Dharma to deliver beings, vowing to assist Heaven and propagate its teachings. Moreover, in reverent compliance with the celestial mandate, we dutifully perform this rite. In honor of [the departed] since their passing, we recall their toil and boundless devotion, which Heaven itself cannot repay. Yearning for their true visage, we now offer this requiem.\n\nWe have specially summoned the feathered and flowing assembly to reverently conduct the Jade Register Retreat, opening the way for the divine presence to ascend to the Heavenly Palace. May their spirit transcend the Azure Vault and their essence be refined in the Cinnabar Court. May they wander the realm of purity, awaken to the boundless emptiness of the Dao, their names inscribed on the Jade Tablets, their rank established in the Jasper Palace.\n\nNext, we pray that the imperial Dao flourish afar, that the royal heir’s foundation endure. May sagely virtue equal that of Yao and Shun, and may the assisting ministers be as steadfast as Gao and Kui. May the sovereign’s longevity extend, and the frontiers remain tranquil. May all under Heaven share in the vast and boundless grace; may the Ten Lands and Nine Netherworlds alike partake in the joy of life and growth. Thus shall the radiance of the Heavenly Worthy’s great compassion be manifest above, and our devotion in taking refuge be fulfilled below.\n\nWe humbly present this supplication.\n\nTwelve Vows\nFirst, may the Three Honored Ones deign to witness.\nSecond, may the Five Elders bestow their radiance.\nThird, may the divine light shine resplendently.\nFourth, may the Nine Qi confer auspiciousness.\nFifth, may the Five Phases align with their course.\nSixth, may the sacred talismans take flight.\nSeventh, may Kan and Li conjoin their destiny.\nEighth, may the Nine Nights unfold their brilliance.\nNinth, may the Mysterious Altar respond with numinosity.\nTenth, may [the departed’s] name be inscribed in the Upper Firmament.\nEleventh, may the divine presence receive deliverance.\nTwelfth, may the nation’s destiny be prolonged.\n\nReplenishing the Censer\nConcentrating the spirit, we burn incense.",
      "overlap_context": "us Origin.\nMay they bestow abundance upon later descendants,\nand root friendship for a hundred generations.\nMay they transmit blessings within the central禁,\nand their descendants flourish for a hundred million years.\n\nThus, we now burn incense,\nand from this moment, take refuge in the Masters, the Venerable, the Great Sage Assembly,\nand the virtue of the Most True.\nAfter attaining the Dao,\nmay we ascend into the formless.\n\nHarmonizing with the Dao, we unite with the true.\nThe rites are complete.",
      "start_char": 1391,
      "end_char": 1866,
      "start_sentence": 82,
      "end_sentence": 117,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.967907667160034,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓大斋三日九朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "香官使者、左右龙虎君、侍香诸灵官，当令臣向来早朝升坛行道之所，自然生金液丹碧芝英。 百灵众真，交会在此，香火炉前。 当愿十方仙童玉女，接侍兰烟，传臣向来所奏之诚，速达径上至真无极大道三清上圣、昊天至尊金阙玉皇上帝御前。 玉箓大斋第一日早朝仪竟 玉箓大斋第一日午朝仪 各礼师，存念如法 谣歌空洞，帝君守坛。 五帝校录，受符三官。 备卫四门，束魔去奸。 流铃掷火，阴秽焚残。 身佩金书，炼液芝颜。 玄灵素合，心动三关。 骑狮跨鹤，控龙乘鸾。 万星守舍，千魔不干。 道炁长存，万仙悉安。 发炉如前 请称法位 具位与临坛官众等，谨同诚上启虚无自然元始天尊，无极大道太上道君，太上老君，高上玉皇，十方已得道大圣众至真诸君丈人，三十二天帝君，玉虚上帝，玉帝大帝，东华南极西灵北真玄都玉京金阙七宝琼台紫微上宫灵宝至真明皇道君，三十六部尊经，玄中大法师，上相上宰、上保上传、太平下教二十四真人，西城总真王君，太乙真人，东岳上卿、司命茅君、定录保命二真人，名山洞府得道神仙，三界官属，一切真灵。 臣闻，二景含虚，隐华灵於未兆； 九霄总梵，合妙炁於自然。 象帝之先，寂寥独立。 太初而上，恍惚无名。 混三色以玄通，凝一神而生化。 分无上玉虚之炁，郁结洞章； 肇太无赤混之元，周回梵行。 无文不度，至极难超。 臣等凭籍福因，参闻玄妙。 披九光之秘蕴，窥盻灵章； 宣三洞之明科，遵行教典。 凡有所启，敢不上闻。 斋意青词，谨当宣奏。 具如词言，不违恳款。 恩惟大道，分别请祈。 臣闻，虚无空碧，玄丘显云篆之文； 太漠流辉，梵行露天真之旨。 扶摇一炁，腾育九清。 臣等视晷精修，过中不昧。 回风芳耀，冲峰阙以扬辉； 奔日赤精，当丹天而正照。 羽盖流精於黄道，玉华散景於玄坛。 恭假香传，奉修斋直。 以今第一日中分行道，请法众等，运兹初捻上香。 愿此香烟腾空，径上供养虚无至真自然大道元始天尊。 愿以是捻香功德，上祝当今皇帝，嗣历无疆。 伏愿统接千龄，道侔二帝。 鸿图天固，永垂亿万世之基； 龟鼎日隆，远迈八百年之卜。 握真符而御极，膺历数以在躬。 运抚灵长，功光祖述。 休祥毕至，瑞庆大来。 今故烧香，自皈依道尊大圣众，至真之德，得道之后，保天长存。 臣闻，紫精朗郁，三庐生空寂之神； 琼室流辉，十合转金桥之圣。 妙机倒影，大混飞玄。 以今第一日中分行道，请法众等，运兹二捻上香。 愿此香烟腾空，径上供养玉晨至圣自然灵宝大道天尊。 愿以是捻香功德，上资国母皇后神仪。 伏愿炼质东华，陶魂南极。 飞升金阙，径陪高上之班； 游宴玉京，位正元真之陛。 流祥帝祚，延裕皇图。 金枝玉叶以弥芳，紫凤青鸾而荐瑞。 九州清泰，四海晏安。 今故烧香，自皈依经尊大圣众，至真之德，得道之后，升入无形。 臣闻，凿开混沌，分圆清方浊之殊； 位定高卑，有人世天关之别。",
      "translated_text": "Incense Official Messengers, Left and Right Dragon-Tiger Lords, and all Attendant Incense Spirits—may this place where we have this morning ascended the altar to perform the Dao now spontaneously generate golden liquid, cinnabar, and azure mushroom blossoms. May the hundred numinous perfected beings gather here before the incense burner. We pray that the jade maidens and immortal youths of the ten directions receive the orchid-scented smoke and swiftly convey the sincerity of our supplications directly to the Most Real and Boundless Dao, the Three Clarities, the August Supreme Sages, and the Jade Emperor of the Golden Gates and Jade Palace in the Lofty Heaven.\n\nThe First Day’s Morning Rites of the Jade Register Grand Fast are now concluded.\nThe First Day’s Noon Rites of the Jade Register Grand Fast\n\nAll pay homage to the masters and concentrate the spirit as prescribed.\nChanting the *Empty Cavern* hymns, the Celestial Lord guards the altar.\nThe Five Emperors review the records, receiving talismans from the Three Officials.\nThe four gates are secured, binding demons and expelling evil.\nFiery bells are cast, burning away yin impurities.\nThe body bears the golden script, refining the elixir and rejuvenating the countenance.\nMysterious and pure unite, the heart stirring the Three Passes.\nRiding lions and mounting cranes, controlling dragons and mounting simurghs.\nA myriad stars guard the abode, a thousand demons dare not intrude.\nThe Dao’s qi endures forever, all immortals are at peace.\n\nThe censer is kindled as before.\nThe dharma ranks are invoked.\n\nWe, the assembled officiants and altar attendants, with one heart humbly present this supplication to the Void and Spontaneous Primordial Heavenly Worthy of the Boundless Dao, the Supreme Lord of the Dao, the Most High Lord Lao, the August Jade Emperor, the perfected and sagely hosts of the ten directions who have attained the Dao, the Lords of the Thirty-Two Heavens, the Jade Void Emperor, the Great Emperor of the Jade Capital, the Eastern Flowery, Southern Culmen, Western Numinous, and Northern Perfected Lords of the Mysterious Capital, the Golden Gates, the Seven-Treasure Jeweled Terrace, and the Purple Tenuity Upper Palace, the Radiant Sovereign of the Numinous Treasure, the thirty-six divisions of revered scriptures, the Great Dharma Masters of the Mysterious Center, the Supreme Ministers, Supreme Stewards, Supreme Protectors, Supreme Transmitters, the Twenty-Four Perfected of the Great Peace’s Lesser Teaching, the King of Total Perfection of the Western City, the Perfected of the Great One, the Supreme Minister of the Eastern Peak, the Lord of Life, Lord Mao, the Two Perfected of Determined Record and Life Preservation, the divine immortals who have attained the Dao in the grotto-heavens and famous mountains, the officials of the Three Realms, and all true numina.\n\nWe have heard that the two luminaries contain the void, concealing numinous splendor before any sign appears; the nine heavens gather the Sanskrit, uniting wondrous qi with spontaneity. Before images and emperors, it stood solitary and silent. Above the Great Beginning, it was indistinct and nameless. Blending the three colors into profound communion, it coagulated the one spirit to generate transformation. Dividing the supreme qi of the Jade Void, it thickened into the *Dongzhang* scriptures; originating the primordial crimson chaos of the Great Nothing, it revolved through the Sanskrit practices. No scripture remains untransmitted, yet the ultimate is difficult to surpass. We, relying on fortunate causes, have glimpsed the mysterious and wondrous. Unfolding the secret depths of the ninefold radiance, we have glimpsed the numinous scriptures; proclaiming the luminous regulations of the Three Caverns, we follow the teachings and canons. In all that we present, we dare not fail to report above.\n\nThe intentions of the fast and the blue-green memorial are now respectfully proclaimed. As stated in the memorial’s words, we do not deviate from our earnest pleas. We beseech the Great Dao to distinguish and grant our prayers.\n\nWe have heard that in the empty azure, the cloud-script of the Mysterious Mound appears; in the flowing radiance of the Great Desert, the Sanskrit reveals the celestial perfected’s intent. A single qi of whirling ascent nurtures the Nine Clarities. We, observing the sun’s shadow and refining our spirits, do not falter past noon. The fragrant radiance of the returning wind shines upon the towering gates; the rushing solar essence of the red sun shines directly upon the cinnabar heaven. Feathered canopies stream essence along the Yellow Path, jade flowers scatter light upon the Mysterious Altar. Reverently relying on incense to convey our message, we perform the fast’s rites.\n\nToday, at the midpoint of the first day’s Dao performance, we, the dharma assembly, now offer the first pinch of incense. May this incense smoke ascend to the heavens, directly offering reverence to the Void, Most Real, and Spontaneous Great Dao, the Primordial Heavenly Worthy. May the merit of this pinch of incense extend upward to bless the present emperor, that his reign endure boundlessly. We humbly pray that his rule may span a thousand ages, his Dao equaling the Two Emperors. May his grand enterprise be as firm as heaven, his foundation enduring for a hundred million myriad generations; may his imperial destiny flourish daily, surpassing the eight-hundred-year oracle. Grasping the true talisman to govern the realm, may he bear the mandate in his person. May his reign be long and his achievements radiant, his merits surpassing those of his ancestors. May all auspicious signs arrive, great blessings come abundantly.\n\nNow, therefore, we burn incense, taking refuge from the Dao, the revered, the sagely hosts, and the perfected powers. After attaining the Dao, may he preserve heaven and endure forever.\n\nWe have heard that the purple essence shines brightly, the three huts generating the spirit of emptiness and silence; the jeweled chamber radiates light, the ten unions turning the golden bridge’s sages. The wondrous mechanism inverts shadows, the great chaos flies into the mysterious.\n\nToday, at the midpoint of the first day’s Dao performance, we, the dharma assembly, now offer the second pinch of incense. May this incense smoke ascend to the heavens, directly offering reverence to the Jade Dawn, Most Sagely, Spontaneous, Numinous Treasure Great Dao Heavenly Worthy. May the merit of this pinch of incense extend upward to bless the empress, the imperial mother’s numinous form. We humbly pray that she refine her essence in the Eastern Flowery and mold her soul in the Southern Culmen. May she ascend to the Golden Gates, directly joining the ranks of the Most High; may she wander and feast in the Jade Capital, her position aligned with the throne of the Primordial Perfected. May she bestow auspiciousness upon the imperial destiny, extending the prosperity of the imperial enterprise. May the golden branches and jade leaves flourish ever more, the purple phoenix and green simurgh offering auspicious signs. May the nine provinces be at peace, the four seas tranquil.\n\nNow, therefore, we burn incense, taking refuge from the scriptures, the revered, the sagely hosts, and the perfected powers. After attaining the Dao, may she ascend into the formless.\n\nWe have heard that when the primordial chaos was split open, the round and clear were divided from the square and turbid; when the ranks of high and low were established, there arose the distinctions between the human world and the celestial passes.",
      "overlap_context": "ness.\nFifth, may the Five Phases align with their course.\nSixth, may the sacred talismans take flight.\nSeventh, may Kan and Li conjoin their destiny.\nEighth, may the Nine Nights unfold their brilliance.\nNinth, may the Mysterious Altar respond with numinosity.\nTenth, may [the departed’s] name be inscribed in the Upper Firmament.\nEleventh, may the divine presence receive deliverance.\nTwelfth, may the nation’s destiny be prolonged.\n\nReplenishing the Censer\nConcentrating the spirit, we burn incense.",
      "start_char": 1866,
      "end_char": 2995,
      "start_sentence": 118,
      "end_sentence": 183,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.06166100502014,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓大斋三日九朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "紫虚郁秀，玉精流光。 以今第一日临午行道，请法众等，运兹三捻上香。 愿此香烟腾空，径上供养混元大圣自然道德天尊。 愿以是捻香功德，上资宗祧先圣所荐神仪。 伏愿天地开光，太虚感会。 熙夷养素，宴息处於黄房； 空碧练真，径跻登於紫极。 垂祥宗庙，延福储宫。 今故烧香，自皈依师尊大圣众，至真之德，得道之后，升入无形。 忏悔 旋绕 命魔 步虚 礼经 三启 重称法位 具位与临坛官众等，谨同诚上启三清至尊，十方上圣，玉京金阙天帝天真，十方师尊圣众，三界官属，一切威灵。 臣闻，洞玄出经，天地设恭而稽首； 神霄告箓，幽冥开道以通关。 臣等夙预真俦，叨承道荫。 所宜守黄庭而偃息，内养神形； 餐素液以耽研，外除嗜欲。 恭承上命，恪为典行。 伏望道意昭融，宸衷鉴念。 颁玉清之宝箓，金液炼形； 授金阙之琼篇，丹台校录。 上祝坤宫，殿下神仪。 执握龙章，御登凤辇。 径入清虚之境，飞升太漠之乡。 位列真仙，名刊紫册。 宴瑶池而泛景，居蕊阙以怡神。 证道无为，超登有在。 上明天尊大慈之化，下副臣等请命之诚。 谨启以闻。 十二愿 一愿天恩普降，二愿符命遐宣， 三愿玄坛警肃，四愿万圣临轩， 五愿千真朝仰，六愿万炁齐仙， 七愿回尸起死，八愿度品南宫， 九愿天清气朗，十愿河海晏然， 十一愿轮转得道， 十二愿飞升上清。 复炉同前 出堂",
      "translated_text": "At Purple Void’s lush radiance, Jade Essence’s flowing light—\ntoday, on the first day at the hour of noon, as we perform the Dao-circuits,\nthe assembly of dharma-adepts here present kindle these three pinches of incense.\nMay this fragrant smoke ascend through the heavens,\ndirectly offering reverence to the Primordial Great Sage, the Heavenly Worthy of Natural Dao and Power.\n\nMay the merit of this incense-offering ascend to honor the numinous presence of the ancestral shrines and the former sages.\nWe humbly pray that heaven and earth illumine with splendor, the Great Void resonate in harmony.\nMay they nurture purity in tranquility, resting in the Yellow Chamber;\nmay they refine the azure emptiness to true essence, ascending directly to the Purple Ultimate.\nBestow auspiciousness upon the ancestral temples, extend blessings to the heir’s palace.\n\nNow, therefore, we burn incense, taking refuge from the master, the revered, the sagely hosts, and the perfected powers.\nAfter attaining the Dao, may they ascend into the formless.\n\nIn repentance, circumambulation, subduing demons, pacing the void,\nbowing to the scriptures, thrice invoking, and solemnly reciting the dharma-ranks—\nwe, the assembled officials and altar-attending hosts, with utmost sincerity,\njointly supplicate the Three Clarities’ August Worthies,\nthe Ten Directions’ Supreme Saints,\nthe Heavenly Emperors and Perfected of Jade Capital and Golden Towers,\nthe Ten Directions’ Master Worthies and Sagely Hosts,\nthe officials of the Three Realms, and all mighty numina.\n\nWe have heard that when the Cavernous Mystery revealed its scriptures,\nheaven and earth bowed in reverence;\nwhen the Divine Empyrean bestowed its registers,\nthe netherworld opened its passes to clear the Way.\nWe, who have long been counted among the true companions,\nhave presumptuously received the shade of the Dao.\nThus, we ought to guard the Yellow Court and repose within,\ninwardly nurturing spirit and form;\nto feast on the pure fluid and immerse in study,\noutwardly eliminating desires and cravings.\nReverently bearing the imperial mandate, we scrupulously perform our rites.\n\nWe humbly beseech that the Dao’s intent shine forth,\nthe imperial heart deign to regard us.\nBestow the Jade Clarity’s precious registers, refining the body with golden fluid;\nconfer the Golden Tower’s jade texts, recording names on the Cinnabar Terrace.\nAbove, we pray for the Earthly Palace;\nbelow, for the imperial presence.\nMay she grasp the dragon-script, ascend the phoenix-chariot,\nenter directly the realm of pure emptiness,\nsoar to the Great Desert’s expanse.\nMay she be ranked among the Perfected Immortals,\nher name inscribed in the Purple Registers.\nFeasting by the Jasper Pool, drifting in radiance,\ndwelling in the Flowery Tower, delighting in spirit—\nmay she realize the Dao in nonaction,\ntranscend existence to attain the highest.\nAbove, may the Heavenly Worthy’s great compassion manifest;\nbelow, may our supplications’ sincerity be fulfilled.\n\nRespectfully submitted for your august attention.\n\nTwelve Vows:\nFirst, may celestial grace descend universally;\nsecond, may the talismanic mandate spread afar;\nthird, may the numinous altar be solemn and vigilant;\nfourth, may the myriad saints attend the throne;\nfifth, may the thousand Perfected pay homage;\nsixth, may the ten thousand qi unite in transcendence;\nseventh, may the dead rise from their corpses;\neighth, may beings be delivered to the Southern Palace;\nninth, may heaven be clear and qi bright;\ntenth, may rivers and seas be tranquil;\neleventh, may the turning wheel attain the Dao;\ntwelfth, may all ascend to the Upper Clarity.\n\nThe incense-brazier is sealed as before.\nExiting the hall.",
      "overlap_context": "gns. May the nine provinces be at peace, the four seas tranquil.\n\nNow, therefore, we burn incense, taking refuge from the scriptures, the revered, the sagely hosts, and the perfected powers. After attaining the Dao, may she ascend into the formless.\n\nWe have heard that when the primordial chaos was split open, the round and clear were divided from the square and turbid; when the ranks of high and low were established, there arose the distinctions between the human world and the celestial passes.",
      "start_char": 2995,
      "end_char": 3563,
      "start_sentence": 184,
      "end_sentence": 227,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.588080406188965,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓大斋三日九朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "谢师 回幕 玉箓大斋第一日午朝仪竟 玉箓大斋第一日晚朝仪 各礼师，存念如法 神光朗耀，瑞炁匝旋。 箕斗映辉，芝宇晏然。 玉眸含真，宝坛纯乾。 变夜作昼，回子午前。 太华流珠，丹凤飞玄。 息魔灭奸，高步祥烟。 天真普集，齐到帝前。 发炉同前 请称法位 具位与临坛官众等，谨同诚上启虚无自然元始天尊，无极大道太上道君、太上老君，高上玉皇，十方已得道大圣众至真诸君丈人，三十二天帝君，玉虚上帝，玉帝大帝，东华南极西灵北真玄都玉京金阙七宝琼台紫微上宫灵宝至真明皇道君，三十六部尊经，玄中大法师，上相上宰、上保上傅、太平下教二十四真人，西城总真王君，太乙真人，东岳上卿司命，茅君定录保命二真人，名山洞府得道神仙，三界官属，一切真灵。 臣闻，三色藏辉，立天根於混沌； 一神隐妙，眇亿劫於鸿蒙。 道达重玄，理微太漠。 无形无绪，若存若亡。 涵万象以凝精，泛九阳而开劫。 散冥寂玄通之炁，上冠丹霄； 启芒虚郁秀之音，肇开玉历。 自然所化，无文不明。 臣等宿契仙储，叨承灵会。 窃神章而踊跃，遐想思真； 蒙大梵以生成，精修演教。 凡有所启，敢不以闻。 斋意青词，谨当宣奏。 宣词 具如诃言，不违恳款。 恩惟大道，分别请祈。 臣闻，道开五劫，浮光明於空洞之中； 法出三乘，显济度於幽冥之内。 常清常静，曰圣曰神。 臣等肃奉清斋，初临静夜。 神风静默，河源灌东井之华； 璇汉昭回，石景吐玄阴之魄。 接群仙而垂荫，聚九炁以含烟。 恭假香传，奉修斋直。 以今晚景行道，请法众等，运兹初捻上香。 愿此香烟腾空，径上供养虚无至真自然大道元始天尊。 愿以是捻香功德，上祝当今皇帝，介福无疆。 伏愿道合三微，躬膺百禄。 穰穰简简，受帝祉以无疆； 穆穆皇皇，荷天休而滋至。 以笃亿万年之佑，永膺九五福之名。 四海攸同，八方奠服。 今故烧香，自皈依道尊大圣众，至真之德，得道之后，保天长存。 臣闻杳然无象，神归妙有之庭，倏尔忘形，道在至虚之境。 既推默念，允格丹衷。 以今落景行道，请法众等，运兹二捻上香。 愿此香烟腾空，径上供养玉晨至圣自然灵宝大道天尊。 愿以是捻香功德，上资所荐神仪。 伏愿炼质虚无，凝神太素。 丹台校箓，高标积善之文； 紫府言功，进陟上仙之品。 茂延洪福，裕护邦家。 垂佑储宫，保宁寰海。 冀百官而精白，俾六服以蕃昌。 永辅皇图，益绥宠禄。",
      "translated_text": "The Rite of Noon Audience on the First Day of the Jade Register Grand Fast is concluded. The Rite of Evening Audience on the First Day of the Jade Register Grand Fast begins. Each pays homage to the masters, contemplating as prescribed. Divine radiance shines brightly; auspicious qi swirls in abundance. The Winnowing Basket and Dipper gleam in splendor; the hall of mushrooms stands serene. Jade eyes hold truth; the sacred altar is pure and undefiled. Night is transformed into day; the hour returns to noon. The Great Flower scatters pearls; the cinnabar phoenix soars in mystery. Demons are stilled and treachery extinguished; one strides high through auspicious mist. Heavenly Perfected gather universally, all arriving before the Emperor.\n\nThe incense-brazier is sealed as before.\nInvoking the Dharma Titles.\n\nWe, the assembled officials and altar-attending multitude, with utmost sincerity jointly address the Primordial Heavenly Worthy of the Void and Spontaneous, the Limitless Great Dao, the Most High Lord of the Dao, the Most High Lord Lao, the August Jade Emperor, the perfected and sagely hosts of the ten directions who have attained the Dao, the Lords of the Thirty-Two Heavens, the Jade Void Emperor, the Great Emperor of Jade, the Eastern Flower, Southern Culmen, Western Numinous, Northern Perfected, and the Golden Towers of the Seven Treasures in the Purple Tenuity’s Upper Palace of the Jade Capital, the Sovereign of the Numinous Treasure and Perfected Radiant August Dao, the thirty-six divisions of revered scriptures, the Great Dharma Master of the Mysterious Center, the High Ministers, High Stewards, High Protectors, High Tutors, the Twenty-Four Perfected of the Great Peace’s Lower Teaching, the Lord King of Total Perfection of the Western City, the Perfected of the Great One, the High Minister of Life of the Eastern Marchmount, the Two Perfected Lords Mao who determine records and protect life, the divine immortals who have attained the Dao in the sacred mountains and grotto-heavens, the officials of the Three Realms, and all true numina.\n\nWe have heard that the threefold treasury of radiance establishes the root of heaven in primordial chaos; the one spirit conceals its subtlety, spanning countless kalpas in the vast expanse. The Dao reaches the profound mystery; its principle is subtle in the great desert. Without form or trace, it seems to exist yet not exist. It embraces the myriad images to congeal essence, suffuses the nine suns to inaugurate kalpas. Dispersing the qi of dark tranquility and mystery, it crowns the cinnabar clouds; initiating the sound of flourishing emptiness, it inaugurates the jade calendar. What it naturally transforms is without pattern yet luminous.\n\nWe, by karmic affinity of former lives, have presumptuously received the numinous assembly. Secretly revering the divine chapters, we leap with joy, gazing afar to contemplate the Perfected. By the great Brahma’s generation and transformation, we diligently cultivate and expound the teachings. In all that we address, we dare not fail to make known.\n\nThe intent of the fast and the blue-green memorial shall now be solemnly proclaimed.\n\nProclamation:\nAs the words declare, without transgressing sincerity. We beseech the Great Dao to distinguish and grant our prayers.\n\nWe have heard that the Dao opened the five kalpas, floating radiance in the empty vastness; the Dharma emerged from the three vehicles, manifesting deliverance within the dark and hidden. Constantly pure, constantly still, it is called sagely, called divine.\n\nWe reverently undertake the pure fast, first entering the tranquil night. The divine wind is hushed; the river’s source irrigates the blossoms of the Eastern Well. The jade firmament revolves in splendor; the stone’s shadow emits the essence of the dark yin. Welcoming the host of immortals to extend their shade, gathering the nine qi to contain mist.\n\nRespectfully transmitting incense, we undertake the fast’s vigil. On this evening as we perform the Dao, we, the Dharma assembly, now offer the first pinch of incense. May this incense smoke ascend to space, directly offering to the Void, Perfected, Spontaneous, and Primordial Heavenly Worthy of the Great Dao.\n\nMay the merit of this pinch of incense extend above to bless the present emperor, bestowing boundless fortune. We humbly pray that the Dao harmonize the three subtleties, that he personally receive a hundred blessings. May he abundantly and grandly receive the emperor’s grace without end; majestically and augustly, may he bear the celestial favor ever increasing. May he firmly receive the protection of a hundred million years, eternally bearing the title of the Nine-Five fortune. May the four seas be united, the eight directions settled in submission.\n\nNow we burn incense, from revering the Dao, the honored and sagely hosts, the Perfected’s virtue, to attaining the Dao thereafter, preserving heaven’s long endurance.\n\nWe have heard that in the distant and formless, the spirit returns to the court of wondrous existence; in the sudden forgetting of form, the Dao abides in the realm of perfect emptiness. Having earnestly contemplated in silence, our sincere hearts are truly aligned.\n\nOn this evening as we perform the Dao, we, the Dharma assembly, now offer the second pinch of incense. May this incense smoke ascend to space, directly offering to the Jade Dawn, Perfected, Spontaneous, Numinous Treasure Heavenly Worthy of the Great Dao.\n\nMay the merit of this pinch of incense extend above to aid the invoked divine forms. We humbly pray that they refine their substance in the void, congeal their spirits in primordial simplicity. On the cinnabar terrace, the registers are examined, loftily inscribing the record of accumulated goodness; in the purple palace, merits are declared, ascending to the ranks of the highest immortals. May abundant great fortune flourish, protecting the state and the household. May blessings descend upon the heir’s palace, securing peace throughout the realm. May the hundred officials be pure and bright, enabling the six domains to prosper. May the imperial enterprise be eternally assisted, its favored emoluments ever increasing.",
      "overlap_context": "d vigilant;\nfourth, may the myriad saints attend the throne;\nfifth, may the thousand Perfected pay homage;\nsixth, may the ten thousand qi unite in transcendence;\nseventh, may the dead rise from their corpses;\neighth, may beings be delivered to the Southern Palace;\nninth, may heaven be clear and qi bright;\ntenth, may rivers and seas be tranquil;\neleventh, may the turning wheel attain the Dao;\ntwelfth, may all ascend to the Upper Clarity.\n\nThe incense-brazier is sealed as before.\nExiting the hall.",
      "start_char": 3563,
      "end_char": 4504,
      "start_sentence": 228,
      "end_sentence": 287,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.686705589294434,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓大斋三日九朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "今故烧香，自皈依经尊大圣众，至真之德，得道之后，升入无形。 臣闻积功旷劫，由广度於人天； 进品仙阶，在普济於幽显。 用弘真教，以阐玄功。 以今落景行道，请法众等，运兹三捻上香。 愿此香烟腾空，径上供养混元大圣自然化主道德天尊。 愿以是捻香功德，上资宗祧先圣，社稷尊灵。 伏愿进品玉京，飞形翠景。 还元复本，自九转以成仙； 合妙登真，参八辰而会道，餐天音於灵府，敷帝席於泥丸。 太乙辅精，帝君品命。 然愿佩持宝箓，飞升金阙之中； 偃息琼车，径上瑶台之上。 福流国祚，惠及寰区。 今故烧香，自饭依师尊大圣众，至真之德，得道之后，升入无形。 忏悔 三启",
      "translated_text": "Now, therefore, we burn incense, taking refuge from the scriptural Honored Ones, the Great Sage Assembly, and the virtue of the Perfected, who, having attained the Dao, ascended into formlessness.\n\nWe have heard that accumulating merit across vast kalpas arises from broadly delivering humans and devas; advancing through the immortal ranks lies in universally aiding the hidden and the manifest. Thus do we magnify the true teachings and unfold the mysterious power.\n\nAt this hour of dusk, as we perform the Dao, we, the Dharma assembly, offer this third pinch of incense. May its fragrant smoke ascend directly to reverently present itself before the Primordial Great Sage, Spontaneous Transforming Lord, Heavenly Worthy of Dao and Virtue.\n\nMay the merit of this pinch of incense extend above to aid our ancestral sages and the august spirits of the altars and soil. We humbly pray that they ascend to the Jade Capital, their forms soaring amid emerald radiance. Returning to the origin and restoring the root, may they achieve immortality through the ninefold refinement; uniting with the wondrous and attaining the real, may they join the Dao amid the eight celestial stems, feast upon celestial tones within the numinous palace, and spread the imperial mat upon the mud-pill palace.\n\nMay the Great Monad assist their essence, and may the Lord Emperor confer their immortal ranks. Thus do we earnestly wish that they bear the precious registers and ascend into the Golden Gates; that they repose in the jade chariot and ascend directly to the Jasper Terrace. May fortune flow through the state’s destiny, and may grace extend throughout the realm.\n\nNow, therefore, we burn incense, taking refuge in our teacher, the Honored Ones, the Great Sage Assembly, and the virtue of the Perfected, who, having attained the Dao, ascended into formlessness.\n\nWe repent. Thrice we invoke.",
      "overlap_context": "sters are examined, loftily inscribing the record of accumulated goodness; in the purple palace, merits are declared, ascending to the ranks of the highest immortals. May abundant great fortune flourish, protecting the state and the household. May blessings descend upon the heir’s palace, securing peace throughout the realm. May the hundred officials be pure and bright, enabling the six domains to prosper. May the imperial enterprise be eternally assisted, its favored emoluments ever increasing.",
      "start_char": 4504,
      "end_char": 4771,
      "start_sentence": 288,
      "end_sentence": 304,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.917793989181519,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓大斋三日九朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "三礼 重称法位 具位与临坛官众等，谨同诚上启三清至尊，十方上圣，玉京金阙天帝天真，十方师尊圣众，三界官属，一切威灵。 臣闻，三界礼房，奉斋盟於三过； 九阳结篆，通冥漠於九幽。 臣等宿植庆根，蚤为玄裔。 所宜诸尘漏尽，从容千日之长斋； 万徧修行，披冒九天之灵盻。 既奉饮丹之誓，敢忘列券之盟。 济物度人，积功累行。 今奉来旨，追念神灵。 伏望上帝垂慈，高真洞鉴。 恩颁南极，俾金液以炼形； 命布东华，冀玉真而校录。 迁神阆苑，偃息华房，逍遥清净之乡，游宴虚无之境。 则上明天尊大慈之化，下副臣等皈命之诚。 谨启以闻。",
      "translated_text": "Thrice we bow. Once more we proclaim the dharma-ranks. All present—those who stand before the altar and the assembled officials—earnestly join in reverence to address the Three Clarities Most Revered, the Ten Directions’ August Sages, the Heavenly Perfected of Jade Capital and Golden Gates, the Celestial Emperors, the Ten Directions’ Honored Teachers and Sacred Assemblies, the officials of the Three Realms, and all numinous powers.\n\nWe have heard that in the Ritual Chamber of the Three Realms, one offers pure vows to atone for three transgressions; that with the ninefold yang’s talismanic script, one bridges the dark vastness of the Nine Netherworlds. We, who have long planted the roots of blessedness and early became heirs of the Mysterious, ought to let all dust-born defilements cease, serenely observing the thousand-day fast; to cultivate practice ten thousand times over, enduring the numinous gaze of the Nine Heavens.\n\nHaving pledged the oath of cinnabar-drinking, how dare we forget the covenant of the inscribed registers? We rescue beings and ferry souls, accumulating merit and amassing deeds. Now, in accordance with the edict received, we call to mind the divine spirits. We humbly beseech the Celestial Emperor to bestow compassion, the Lofty Perfected to peer with penetrating insight. May grace flow from the Southern Culmen, refining our forms with golden elixir; may commands issue from the Eastern Florescence, allowing us to be reviewed in the jade registers of the Perfected.\n\nMay we ascend to the Wandering Park of the Gods, repose in the Flowering Chambers, wander at ease in the realm of purity and stillness, and roam and feast in the boundless expanse of emptiness. Thus shall the great transformation of the Most High Heavenly Worthy be made manifest above, and the sincerity of our refuge and devotion be fulfilled below. We respectfully submit this entreaty for your hearing.",
      "overlap_context": "anks. Thus do we earnestly wish that they bear the precious registers and ascend into the Golden Gates; that they repose in the jade chariot and ascend directly to the Jasper Terrace. May fortune flow through the state’s destiny, and may grace extend throughout the realm.\n\nNow, therefore, we burn incense, taking refuge in our teacher, the Honored Ones, the Great Sage Assembly, and the virtue of the Perfected, who, having attained the Dao, ascended into formlessness.\n\nWe repent. Thrice we invoke.",
      "start_char": 4771,
      "end_char": 5020,
      "start_sentence": 305,
      "end_sentence": 321,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.439758777618408,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓大斋三日九朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "一愿慈辉普映，二愿慧日光垂， 三愿天恩普度，四愿悟道无为， 五愿青华锡命，六愿游宴丹台， 七愿神升紫极，八愿凤驭徘徊， 九愿福延国祚，十愿登上蓬莱， 十一愿万真降鉴， 十二愿升进瑶阶。 复炉同前 谢师 回幕 玉箓大斋第一日晚期仪竟 玉箓大斋第二日早朝仪 各礼师，存念如法 五星灵映，焕景丹庭。 包罗无外，合炁群灵。 潜形杳默，周游五经。 扬威耀日，役使甲丁。 却灾除祸，涤秽消氛。 万魔恐怖，龙虎飞奔。 紫云交覆，万炁齐并。 鸣法鼓二十四通 无上三天玄元始三炁太上老君，召出臣身中三五功曹，左右官使者，左右捧香金童，传言散花玉女，五帝直符直日香官，各三十六人出。 出者，严装显服，冠带垂缨。 关启玄坛土地，方域神真。 臣今早朝，升坛行道，朝谒帝真。 谨奏为入意其诸诚意，具载缄誊。 愿得太上至真道炁灵宝瑞光下降，流入臣等身中； 令臣所启之诚，速违径御至真无极大道三清上圣、昊天至尊金阙玉皇上帝御前。 请称法位 具位与临坛官众等，谨同诚上启虚无自然元始天尊，无极大道太上道君，太上老君，高上玉皇，十方已得道大圣众至真诸君丈人，三十二天帝君，玉虚上帝，玉帝太帝，东华南极西灵北真玄都玉京金阙七宝琼台紫微上宫灵宝至真明皇道君，三十六部尊经，玄中大法师，上相上宰、上保上傅，太平下教二十四真人，西城揔真王君，太乙真人，东岳上卿司命，茅君定录保命二真人。 名山洞府，得道神仙。 三界官属，一切真灵。",
      "translated_text": "May the first vow bring forth universal radiance of compassionate light,\nMay the second vow cause the sun of wisdom to cast its beams,\nMay the third vow extend Heaven’s grace to all beings,\nMay the fourth vow lead to awakening in the Dao of non-action,\nMay the fifth vow grant the mandate of the Azure Flower,\nMay the sixth vow allow feasting upon the Cinnabar Terrace,\nMay the seventh vow elevate the spirit to the Purple Culmen,\nMay the eighth vow let the phoenix chariot hover and linger,\nMay the ninth vow prolong the nation’s fortune and reign,\nMay the tenth vow enable ascent to the summit of Penglai,\nMay the eleventh vow summon the myriad Perfected to descend and witness,\nMay the twelfth vow permit advancement upon the jasper steps.\n\nThe furnace rites proceed as before.\nThanksgiving to the Master.\nReturn to the curtained enclosure.\n\nThe first evening rites of the Jade Register Grand Fast conclude.\nThe second morning audience rites of the Jade Register Grand Fast begin.\n\nAll pay homage to the Master, contemplating as prescribed:\n\nThe five stars cast their numinous radiance,\nilluminating the cinnabar court with resplendent light.\nEncompassing all without exception,\nthey unite the qi of the host of spirits.\nConcealing form in profound silence,\nthey traverse the Five Classics.\nDisplaying might to outshine the sun,\nthey command the officers of the celestial stems and branches.\nThey repel calamities and dispel misfortune,\ncleansing filth and dissolving baleful influences.\nThe myriad demons tremble in terror,\ndragons and tigers take flight in haste.\nPurple clouds interlace and enfold,\nas the ten thousand qi converge as one.\n\nThe Dharma Drum is sounded twenty-four times.\n\nO Most High Three Heavens, Mysterious Primordial Three Qi, Supreme Lord Lao:\nSummon forth the Three and Five Merit Officers within my body,\nthe Attendant Messengers of the Left and Right,\nthe Golden Lads bearing incense on the left and right,\nthe Jade Maidens scattering flowers to convey words,\nthe Thirty-Six Fragrance Officers of the Five Thearchs’ Direct Talismans and Direct Days.\n\nLet them emerge—\nadorned in solemn attire, resplendent in vestments,\ncrowns and sashes with pendent cords.\n\nSummon the Land Spirits of the Mysterious Altar,\nthe Divine Perfected of the directional domains.\n\nThis morning, as I ascend the altar to perform the Dao,\nto pay audience to the Imperial Perfected,\nI humbly present my sincerest intentions,\nall duly recorded in sealed documents.\n\nMay the numinous radiance of the Supreme Perfected Dao,\nthe luminous treasure of the Lingbao,\ndescend and flow into our bodies.\nMay the sincerity of our entreaty swiftly ascend,\nreaching the presence of the Most High,\nthe Boundless Dao of the Three Clarities,\nthe August Celestial Worthy,\nthe Jade Emperor of the Golden Gates of the Heavenly Palace.\n\nInvoking the Dharma ranks:\n\nTogether with the assembled officials and altar participants,\nwe reverently and with one heart address our entreaty to:\nthe Primordial Celestial Worthy of the Void and Spontaneous,\nthe Boundless Dao, the Supreme Lord of the Dao,\nLord Lao the Supreme,\nthe August Jade Emperor,\nthe host of Great Sages who have attained the Dao in the Ten Directions,\nthe Perfected Lords and Venerable Masters,\nthe Lords of the Thirty-Two Heavens,\nthe Jade Void Emperor,\nthe Jade Emperor and Great Emperor,\nthe Eastern Florescence, Southern Culmen, Western Numinosity, Northern Perfection,\nthe Golden Gates of the Jasper Capital, the Seven-Treasure Jeweled Terrace of the Purple Tenuity Upper Palace,\nthe Numinous Treasure Supreme Illustrious Sovereign of the Dao,\nthe Thirty-Six Divisions of the Venerable Scriptures,\nthe Great Dharma Masters of the Mysterious Center,\nthe Supreme Ministers, Supreme Chancellors,\nSupreme Protectors, Supreme Preceptors,\nthe Twenty-Four Perfected of the Great Peace Lower Teaching,\nthe King of the Total Perfected of the Western Citadel,\nthe Perfected of the Great One,\nthe Supreme Minister of the Eastern Marchmount, Controller of Destinies,\nthe Two Perfected Lords Mao, Regulators of Records and Protectors of Life,\nthe Divine Immortals who have attained the Dao in the sacred mountains and grotto-heavens,\nand all the Perfected Spirits of the Three Realms and their official retinues.",
      "overlap_context": " the Eastern Florescence, allowing us to be reviewed in the jade registers of the Perfected.\n\nMay we ascend to the Wandering Park of the Gods, repose in the Flowering Chambers, wander at ease in the realm of purity and stillness, and roam and feast in the boundless expanse of emptiness. Thus shall the great transformation of the Most High Heavenly Worthy be made manifest above, and the sincerity of our refuge and devotion be fulfilled below. We respectfully submit this entreaty for your hearing.",
      "start_char": 5021,
      "end_char": 5637,
      "start_sentence": 322,
      "end_sentence": 353,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.363598108291626,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓大斋三日九朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "臣闻，四象吁员，隐太虚於元洞； 九阳焕散，泛妙炁於梵华。 碧霭森罗，玄精杳邈。 通明三景，滋育万生。 肇龙汉之开图，发始青之变化。 天宝出书而传世，秀结神章； 玉清应号以度人，光浮灵篆。 真机敷露，正道流行。 臣等谬合玄图，获参上范。 凭琼颜而妙感，回侍晨轩； 想珠口以凝神，奉宣法事。 凡有所启，敢不以闻。 斋意青词，谨当宣奏。 宣词 具如词言，不违恳款。 恩惟太上，分别哀祈。 臣闻，无形无影，神风静默而洞焕太空； 若存若亡，四炁朗清而缅平一等。 群妖束首，万圣临轩。 臣等辨色精思，凌晨对越。 清风发旦，瞻灵曜之方升； 黄道启明，正群阴之尽伏。 宝炁空浮於玄座，祥烟高霭於大罗。 恭假香传，奉修斋直，以今第二日清旦行道，请法众等，运兹初捻上香。 愿此香烟腾空，径上供养虚无至真自然大道元始天尊。 愿以是捻香功德，上祝当今皇帝，景命无疆。 伏愿历过万年，德光四表。 赤乌流屋，绍开火运之隆； 神马出河，允恪天书之瑞。 诞协灵而握梵，永膺箓以受图。 帝祚昌隆，皇天眷佑。 嘉祥交应，景贶咸臻。 今故烧香，自皈依道尊大圣众，至真之德，得道之后，祈天长存。 臣闻，至道垂科，凤篆降清微之境； 元皇敷教，龙章浮碧落之空。 普济幽明，同沾福佑。 以今第二日清旦行道，请法众等，运兹二捻上香。 愿此香烟腾空，径上供养玉晨至圣自然灵宝大道天尊。 愿以是捻香功德，上资所荐神灵。 伏愿宴景玉京，进阶宝典。 面虚皇而受道，升瑶陛以登真。 永处逍遥，长居极乐。 注银河之仙泒，撷琼圃之天芳。 润浃九围，香传万叶。 今故烧香，自皈依经尊大圣众，至真之德，得道之后，升入无形。 臣闻，常应常静，灵光洞烛而万行皆施； 圆寂圆通，惠醴遍沾而九泉均济。 道慈广大，至德涵容。 以今第二日清旦行道，请法众等，运兹三捻上香。 愿此香烟腾空，径上供养混元大圣自然化主道德天尊。 愿以是捻香功德，上资所荐神灵。 伏愿高抗大罗，冥通无色。 飘飘素质，练真於流火之庭； 郁郁玉葩，秀实於琅霄之馆。 应灵图而乘运，合空洞以生神。 上圣回光，神公摄景。 超证真常，齐年天地。 今故烧香，自皈依师尊大圣众，至真之德，得道之后，升入无形。 忏悔 三启",
      "translated_text": "I have heard that the Four Symbols sigh in vastness, concealing the Great Void within the Primordial Grotto; the Nine Suns scatter their radiance, suffusing wondrous qi amidst the blossoms of Brahmā. Azure mists spread in array, while dark essences stretch into the distant. The Three Luminaries interpenetrate, nurturing the myriad beings. At the dawn of the Dragon-Han, the Celestial Charts were unfurled; from the transformations of the Primordial Azure, all things arose. The Heavenly Treasures emerged as scriptures to transmit through the world, their divine chapters forming like blossoms; the Jade Clarity responded to its title, delivering humankind, its sacred scripts shimmering with numinous light. The true mechanism was revealed, and the Orthodox Dao flowed forth.\n\nWe, your servants, have fortuitously aligned with the Mysterious Chart and gained participation in the lofty model. Relying on the jadelike countenance to inspire wondrous resonance, we turn to attend the morning audience; contemplating the pearl-like utterance to concentrate the spirit, we reverently proclaim the Dharma rites. Whatever we venture to present, we dare not withhold. The intent of the purification rite and the blue-green memorial shall be respectfully declared.\n\n**Proclamation of the Memorial**\nAs stated in the memorial, without deviation from its earnest sincerity.\n\nWe humbly beseech the Most High to distinguish and heed our supplications.\n\nI have heard that formless and shadowless, the divine wind is still and silent, yet illumines the vast firmament; as if present, as if absent, the Four Qi shine brightly, equalizing all in distant harmony. The host of demons bow their heads, and the myriad sages attend the audience.\n\nWe, your servants, discerning the signs and refining our thoughts, face the dawn in reverent audience. As the pure wind arises at daybreak, we gaze upon the numinous radiance just ascending; as the Yellow Path begins to shine, we witness the full subjugation of the yin hosts. Precious qi floats in the void above the dark throne; auspicious mists rise high amidst the Great Veil.\n\nReverently transmitting the incense, we undertake the purification vigil. On this second day at dawn, as we perform the Dao-circulation, we invite the Dharma assembly to offer the first pinch of incense. May this incense smoke ascend directly to offer homage to the Primordial Heavenly Worthy of the Dao, the Natural and Most Real, the Great Dao of the Void.\n\nMay the merit of this pinch of incense extend upward to bless the present emperor, that his august mandate endure without end. We humbly pray that through ten thousand years, his virtue may illumine the four quarters. May the Red Crow stream through the palace, continuing the flourishing of the Fire Mandate; may the divine horse emerge from the river, truly manifesting the auspiciousness of the Heavenly Scriptures. May he be born in harmony with the numinous and grasp the sacred, eternally receiving the registers and charts. May the imperial destiny prosper and flourish, favored by the August Heaven. May propitious omens converge and auspicious blessings all arrive.\n\nThus we now burn incense, from our refuge in the Dao-Worthy, the Great Sage Assembly, and the virtue of the Perfected, that after attaining the Dao, we may pray for the eternal endurance of Heaven.\n\nI have heard that the Perfect Dao bestows its precepts, and the phoenix scripts descend upon the realm of Pure Subtlety; the Primordial August One promulgates his teachings, and the dragon charts float in the azure vastness of the Empyrean. Universally aiding the hidden and manifest, all equally receive blessings and protection.\n\nOn this second day at dawn, as we perform the Dao-circulation, we invite the Dharma assembly to offer the second pinch of incense. May this incense smoke ascend directly to offer homage to the Heavenly Worthy of the Numinous Treasure, the Most Sagely and Natural, the Great Dao of Jade Clarity.\n\nMay the merit of this pinch of incense extend upward to benefit the spirits we commend. We humbly pray that they may feast in the Jade Capital, advancing through the ranks of the sacred canon. Facing the August Void to receive the Dao, may they ascend the jade steps to attain Perfection. May they dwell forever in carefree ease, abiding eternally in supreme bliss. May they draw from the immortal streams of the Silver River and pluck the celestial blossoms of the Jasper Garden. May their influence moisten the nine provinces and their fragrance transmit through ten thousand generations.\n\nThus we now burn incense, from our refuge in the Scripture-Worthy, the Great Sage Assembly, and the virtue of the Perfected, that after attaining the Dao, they may ascend into the formless.\n\nI have heard that ever-responsive and ever-quiescent, the numinous light pervades all, and the ten thousand practices are all enacted; perfectly quiescent and perfectly penetrating, the nectar of wisdom universally moistens, and the nine springs are equally succored. The Dao’s compassion is vast, and its supreme virtue all-embracing.\n\nOn this second day at dawn, as we perform the Dao-circulation, we invite the Dharma assembly to offer the third pinch of incense. May this incense smoke ascend directly to offer homage to the Heavenly Worthy of the Dao and Virtue, the Natural Transformer, the Great Sage of the Primordial Chaos.\n\nMay the merit of this pinch of incense extend upward to benefit the spirits we commend. We humbly pray that they may soar high in the Great Veil and mystically commune with the formless. Drifting in ethereal purity, may they refine their true selves in the courtyard of flowing fire; luxuriant as jade blossoms, may they bear fruit in the halls of the Azure Empyrean. Responding to the numinous charts and riding the currents, may they merge with the empty and cavernous to generate the divine. May the Perfected of the Upper Realms turn their light, and the divine lords gather their radiance. May they transcend to realize the true and constant, and equal the years of Heaven and Earth.\n\nThus we now burn incense, from our refuge in the Preceptor-Worthy, the Great Sage Assembly, and the virtue of the Perfected, that after attaining the Dao, they may ascend into the formless.\n\n**Confession**\nThreefold invocation.",
      "overlap_context": "e Protectors, Supreme Preceptors,\nthe Twenty-Four Perfected of the Great Peace Lower Teaching,\nthe King of the Total Perfected of the Western Citadel,\nthe Perfected of the Great One,\nthe Supreme Minister of the Eastern Marchmount, Controller of Destinies,\nthe Two Perfected Lords Mao, Regulators of Records and Protectors of Life,\nthe Divine Immortals who have attained the Dao in the sacred mountains and grotto-heavens,\nand all the Perfected Spirits of the Three Realms and their official retinues.",
      "start_char": 5637,
      "end_char": 6502,
      "start_sentence": 354,
      "end_sentence": 413,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.174896001815796,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓大斋三日九朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "三礼 重称法位 具位与临坛官众等，谨同诚上启三清至尊，十方上圣，玉京金阙天帝天真，十方师尊圣众，三界官属，一切威灵。 臣闻，十遍周回，召至真於碧落； 九幽开泰，度神识以升仙。 臣等叨濯玄津，窃乘良会。 所宜离形黜智，悟我理之兼忘； 守静致虚，炼形神而高举。 蚤奉中盟而佩箓，誓弘大法以度人。 粗积微功，少裨玄化。 况承词剡，恭为典行。 伏虑臣等戒疏德薄，学浅才微。 冒犯条章，惟希宽宥。 伏愿分别哀祈，洞垂省览。 颁布青宫之符命，开度所荐之神仪，径入太清，登真成道。 则上明天尊大慈之化，下副臣等皈命之诚。 谨启以闻。 一愿灵光下烛，二愿道月扬辉， 三愿恩宣九地，四愿诚达九天， 五愿真灵俱会，六愿道炁周围， 七愿天堂开敞，八愿地狱隳摧， 九愿玄功普被，十愿驾景空飞， 十一愿普天怀德， 十二愿道合无为。 复炉 存神烧香",
      "translated_text": "**Threefold Prostration**\n\nRepeatedly invoking the sacred ranks, we, the assembled officiants and attending officials, with utmost sincerity jointly address the Three Clarities Most High, the Perfected of the Ten Directions, the Celestial Worthies of the Jade Capital and Golden Gates, the Venerable Masters and Sacred Assemblies of the Ten Directions, the divine ministers of the Three Realms, and all numinous powers.\n\nWe have heard that tenfold circumambulation summons the Perfected from the Azure Vault, and the opening of the Nine Dark Realms delivers consciousness to ascend as immortals. We, undeservingly bathed in the mystic stream and privy to this auspicious gathering, ought to cast off form and renounce cunning, awakening to the mutual forgetting of self and principle; abide in stillness to attain emptiness, and refine body and spirit to soar aloft. Early did we receive the central covenant and bear its registers, vowing to propagate the Great Dharma and deliver beings. Though our merits are meager, they slightly aid the mysterious transformation. Moreover, we humbly undertake this rite in reverent observance.\n\nYet we fear our precepts are lax and virtue shallow, our learning slight and talents feeble. We have presumptuously violated the statutes—we can only hope for leniency. May you, in your compassion, heed our entreaties and grant your scrutiny. Bestow the talismanic mandates of the Azure Palace, open the way for the divine forms of those we commend, and guide them directly into the Grand Clarity to attain perfection and realize the Dao. Thus shall the luminous transformation of the Heavenly Worthy’s great compassion be manifest above, and our devotion in taking refuge be fulfilled below.\n\nWe respectfully submit this petition.\n\nFirst, may numinous radiance descend to illumine;\nSecond, may the moon of the Dao shine forth in splendor;\nThird, may grace extend through the Nine Lands;\nFourth, may sincerity reach the Nine Heavens;\nFifth, may all true spirits convene;\nSixth, may the Dao-qi pervade all;\nSeventh, may the heavens open wide;\nEighth, may hells be shattered and overthrown;\nNinth, may mysterious merit spread universally;\nTenth, may they ride the light and soar through emptiness;\nEleventh, may all under heaven embrace virtue;\nTwelfth, may the Dao unite with non-action.\n\nReplenishing the censer, we visualize the spirits and burn incense.",
      "overlap_context": "currents, may they merge with the empty and cavernous to generate the divine. May the Perfected of the Upper Realms turn their light, and the divine lords gather their radiance. May they transcend to realize the true and constant, and equal the years of Heaven and Earth.\n\nThus we now burn incense, from our refuge in the Preceptor-Worthy, the Great Sage Assembly, and the virtue of the Perfected, that after attaining the Dao, they may ascend into the formless.\n\n**Confession**\nThreefold invocation.",
      "start_char": 6502,
      "end_char": 6873,
      "start_sentence": 414,
      "end_sentence": 439,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.826159954071045,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓大斋三日九朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "香官使者、左右龙虎君、侍香诸灵官，当令臣向来早朝陛坛行道之所，自然生金液丹碧芝英。 百灵众真，交会在此，香火炉前。 当愿十方仙童玉女，接侍兰烟，传臣向来所奏之诚，速达径上至真无极大道三清上圣、昊天至尊金阙玉皇上帝御前。 玉箓大斋第二日早期仪竟 玉箓大斋第二日午朝仪 各礼师，存念如法 黄中策炁，斩妖灭踪。 制遏邪源； 断截魔宗。 太上符命，召制神公。 万神斯格，却祸除凶。 五炁三轮，洞达真风，紫户合琼，六度无终。 左命青腰，右摄芝童。 逍遥飘景，总御九空。 玄坛应机，乘炁虚冲。 万真普降，济度无穷。 发炉同早朝 请称法位 具位与临坛官众等，谨同诚上启虚无自然元始天尊，无极大道太上道君，太上老君，高上玉皇，十方已得道大圣众至真诸君丈人，三十二天帝君，玉虚上帝，玉帝大帝，东华南极西灵北真玄都玉京金阙七宝琼台紫微上宫灵宝至真明皇道君，三十六部尊经，玄中大法师，上相上宰、上保上傅，大平下教二十四真人，西城揔真王君，太乙真人，东岳上卿司命，茅君定录保命二真人，名山洞府得道神仙，三界官属，一切真灵。 臣闻五度凝精，已兆丹光之祖； 三阳隐妙，难穷浩劫之先。 虚廓无形，幽寥罔象。 结梵灵之元炁，开神运於赤明。 敷落五篇，弥罗万范。 灵宝出金书之奥，凤历流通； 洞玄垂玉字之芒，龙文安镇。 度人无量，保天长存。 臣等忝绍仙宗，叨承正一。 泛朱英而袭庆，诵咏琼音； 传符箓於名山，遵修宝范。 凡有所启，敢不上闻。 斋意青词，谨当宣奏。 宣词 具如词言，不违恳款。 恩惟大道，分别哀祈。 臣闻太极金书，飞二景玄真之宝； 紫霞玉彩，流九霄神境之光。 龙跃虎蹲，凤翔鸾舞。 臣等昼接真灵，午临坛墠。 阳晶丽正，测圭景以方中； 华曜舒光，瞻丹轮而未昃。 引法界虚无之圣，聚灵风郁勃之烟。 恭假香传，奉修斋直。 以今中分行道，请法众等，运兹初捻上香。 愿此香烟腾空，径上供养虚无至真自然大道元始天尊。 愿以是捻香功德，上祝当今皇帝，圣寿无疆。 伏愿永御九重，备膺五福。 垂衣致治，长临南面之朝； 居正体元，端拱北辰之所。 履至尊而久视，保荣祚以无疆。 帝命日新，神基天峻。 克绥四海，丕演万年。 今故烧香，自皈依道尊大圣众，至真之德，得道之后，祈天长存。 臣闻，金阙玉房，储宝笈琅函之秘； 瑶台朱圃，显云章霞篆之祥。 光焕九天，芒垂八角。 以今中分行道，请法众等，运兹二捻上香。 愿此香烟腾空，径上供养玉晨至圣自然灵宝大道天尊。 愿以是捻香功德，上资国祚宗枝。 伏愿四塞向风，诸藩慕义。 梯山航海，皆为入贡之臣； 交趾雕题，尽效来朝之职。 极乾坤之覆载，穷日月之照临。 冠带百蛮，车书一轨。 咸臻安静，各遂生成。",
      "translated_text": "Incense Official Messengers, Left and Right Dragon-Tiger Lords, and all Attending Incense Spirits—may this place where we have this morning ascended the altar to perform the Dao now naturally generate golden liquid, cinnabar, azure mushrooms, and divine herbs. May the hundred spirits and host of perfected beings convene here before the incense burner.\n\nWe pray that the jade maidens and immortal youths of the ten directions receive this orchid-scented smoke and swiftly transmit the sincerity of our petition directly upward to the Most Perfect and Boundless Dao, the Three Clarities’ August Saints, and the Supreme August Jade Emperor of the Golden Portal before the Celestial Throne.\n\nThe second day’s early rite of the Jade Register Grand Retreat now concludes.\nThe second day’s noon audience rite begins.\n\nAll ritual masters, maintain visualization as prescribed:\nWithin the Yellow Center, summon qi to sever demonic traces and extinguish their trails.\nSuppress the sources of evil;\ncut off the lineages of demons.\nBy the Talismanic Mandate of the Most High, summon and command the divine lords.\nMay all spirits heed this call, averting misfortune and dispelling calamity.\nFive qi and three wheels penetrate the true wind;\nthe Purple Portal unites with jade, and the Six Perfections know no end.\nTo the left, command the Azure Waist;\nto the right, summon the Mushroom Youths.\nWandering freely, riding the radiant light, they govern the Nine Empyreans.\nThe Mysterious Altar responds to the moment, riding the qi in empty ascension.\nMay the myriad perfected descend universally, delivering and saving without end.\n\nIgnite the censer as in the morning audience.\nInvite the recitation of the dharma ranks.\n\nWe, the assembled officiants and altar-attending officials, together with utmost sincerity, reverently address and invoke:\nThe Primordial Heavenly Worthy of the Void and Spontaneous,\nThe Boundless Dao’s Most High Dao Lord,\nThe Most High Lord Lao,\nThe August Jade Emperor on High,\nThe host of great sage perfected beings of the ten directions who have attained the Dao,\nThe Lords and Venerables of the Thirty-Two Heavens,\nThe Jade Void Emperor,\nThe Great Emperor of the Jade Emperor,\nThe Eastern Flower, Southern Culmen, Western Numinous, and Northern Perfected,\nThe Golden Portal and Seven-Jewel Jeweled Terrace of the Purple Tenuity’s Upper Palace,\nThe Numinous Treasure Perfected Illustrious Sovereign of the Dao,\nThe thirty-six divisions of revered scriptures,\nThe Great Dharma Masters of the Mysterious Center,\nThe Supreme Ministers, Supreme Chancellors, Supreme Protectors, and Supreme Tutors,\nThe Twenty-Four Perfected of the Great Peace’s Lesser Teaching,\nThe King of Total Perfection of the Western City,\nThe Perfected of the Great One,\nThe Supreme Minister of the Eastern Marchmount and Controller of Destiny,\nThe Two Perfected Lords Mao, Regulators of Records and Protectors of Life,\nThe divine immortals who have attained the Dao in the grotto-heavens and named mountains,\nThe officials and attendants of the Three Realms,\nand all true spirits.\n\nWe have heard that when the Five Perfections congeal essence, they foreshadow the ancestral radiance of cinnabar;\nwhen the Three Yangs conceal their subtlety, they elude the bounds of kalpas past.\nVast and formless, secluded and imageless,\nthey coalesce the primordial qi of the numinous Brahman and initiate divine movement in the Crimson Clarity.\nUnfolding the Five Chapters, they pervade the ten thousand models.\nThe Numinous Treasure emerges from the mysteries of the golden script, its phoenix chronicle circulating;\nthe Cavernous Mystery suspends the brilliance of jade graphs, its dragon script securely established.\nDelivering boundless beings, preserving heaven’s enduring existence.\n\nWe, unworthy heirs of the immortal lineage, have presumptuously received the Orthodox Unity.\nFloating on vermilion blossoms, we inherit blessings, chanting and intoning the jade sounds;\ntransmitting talismans and registers among the named mountains, we observe and cultivate the precious models.\nIn all matters we address, how dare we not report them above?\n\nThe blue-green memorial of the retreat’s intent shall now be solemnly proclaimed.\nProclaim the memorial.\n\nAs stated in the memorial’s words, without deviation from its earnest entreaties.\nWe beseech the Great Dao to distinguish and heed our piteous prayers.\n\nWe have heard that the Golden Writ of the Supreme Ultimate soars as the treasure of the Twofold Mystery’s perfected essence;\nthe Purple Radiance and Jade Splendor flow as the light of the Nine Empyreans’ divine realm.\nDragons crouch and tigers leap; phoenixes soar and simurghs dance.\n\nWe, by day, receive the true spirits; at noon, we approach the altar’s precincts.\nThe yang essence shines in its correctness, measuring the gnomon’s shadow to align with the center;\nthe radiant brilliance unfurls its light, gazing upon the cinnabar orb before its decline.\n\nWe draw forth the saints of the Dharma Realm’s emptiness and gather the fragrant smoke of the numinous wind’s exuberance.\nRespectfully relying on the transmission of incense, we undertake the retreat’s observances.\n\nAt this midday performance of the Dao, we, the assembled dharma hosts, now offer the first pinch of incense.\nMay this incense smoke ascend to the heavens, directly offering reverence to the Primordial Heavenly Worthy of the Void, the Most Perfect and Spontaneous Great Dao.\n\nMay the merit of this pinch of incense ascend to bless the present emperor, that his sagely longevity know no bounds.\nWe humbly pray that he eternally govern the Nine Palaces, fully receiving the Five Fortunes.\nClothed in dignity, he brings order, long presiding over the southern-facing court;\nabiding in correctness, embodying the origin, he steadfastly guards the northern star’s domain.\nTreading the supreme position with enduring vision, he preserves the glory of the imperial line without end.\nThe imperial mandate daily renews; the divine foundation towers in heaven.\nPacifying the Four Seas, he grandly extends the myriad years.\n\nNow, as we burn this incense, from our taking refuge in the Dao’s august sagely host of perfected beings and their virtue, to their attainment of the Dao, we pray for heaven’s enduring existence.\n\nWe have heard that the Golden Portal and Jade Chamber store the secret of the precious coffer’s jade tablets;\nthe Jasper Terrace and Vermilion Gardens reveal the auspiciousness of cloud scripts and rosy seal-characters.\nTheir light illumines the Nine Heavens; their brilliance hangs from the eight corners.\n\nAt this midday performance of the Dao, we, the assembled dharma hosts, now offer the second pinch of incense.\nMay this incense smoke ascend to the heavens, directly offering reverence to the Most Sagely and Spontaneous Numinous Treasure Great Dao Heavenly Worthy.\n\nMay the merit of this pinch of incense ascend to benefit the imperial lineage and ancestral branches.\nWe humbly pray that the Four Frontiers turn toward the wind, and all vassals admire righteousness.\nClimbing mountains and sailing seas, all become tributary ministers;\nfrom the tattooed tribes of Jiaozhi to the distant lands, all fulfill their duties of audience.\nExhausting heaven and earth’s covering and supporting, and the sun and moon’s illumination,\nthe myriad barbarians in caps and sashes, and the unified standards of cart and script,\nall attain peace and tranquility, each realizing their life’s fulfillment.",
      "overlap_context": "e extend through the Nine Lands;\nFourth, may sincerity reach the Nine Heavens;\nFifth, may all true spirits convene;\nSixth, may the Dao-qi pervade all;\nSeventh, may the heavens open wide;\nEighth, may hells be shattered and overthrown;\nNinth, may mysterious merit spread universally;\nTenth, may they ride the light and soar through emptiness;\nEleventh, may all under heaven embrace virtue;\nTwelfth, may the Dao unite with non-action.\n\nReplenishing the censer, we visualize the spirits and burn incense.",
      "start_char": 6873,
      "end_char": 7942,
      "start_sentence": 440,
      "end_sentence": 504,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.66987228393555,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓大斋三日九朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "今故烧香，自皈依经尊大圣众，至真之德，得道之后，升入无形。 臣闻，元始开图，妙剖判阴阳之本； 元纲流演，明生成造化之源。 难终难穷，莫名莫测。 以今中分行道，请法众等，运兹三捻上香。 愿此香烟腾空，径上供养混元大圣自然化主道德天尊。 愿以是捻香功德，上资所荐神灵。 伏愿炼炁无英，回灵骄乐。 黄华荡质，俾脏腑之清凉； 紫户生仙，总形神而整具。 参帝真而结命，庆玉女以灌香。 探入飞空，起离旧爽。 摄召长夜，开度受生。 今故烧香自皈依师尊大圣众，至真之德，得道之后，升入无形。 忏悔 三启",
      "translated_text": "Now, therefore, we burn incense, taking refuge from the scriptural venerables and the great sagely hosts, whose perfect virtue",
      "overlap_context": "t the Four Frontiers turn toward the wind, and all vassals admire righteousness.\nClimbing mountains and sailing seas, all become tributary ministers;\nfrom the tattooed tribes of Jiaozhi to the distant lands, all fulfill their duties of audience.\nExhausting heaven and earth’s covering and supporting, and the sun and moon’s illumination,\nthe myriad barbarians in caps and sashes, and the unified standards of cart and script,\nall attain peace and tranquility, each realizing their life’s fulfillment.",
      "start_char": 7942,
      "end_char": 8180,
      "start_sentence": 505,
      "end_sentence": 520,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 1.3968892097473145,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓大斋三日九朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "三礼 重称法位 具位与临坛官众等，谨同诚上启三清至尊，十方上圣，玉京金阙天帝天真，十方师尊圣众，三界官属，一切威灵。 臣闻五帝朝真，罄精修於五体； 十天降命，咸普度於十回。 臣等宿应玄图，忝承真诰。 所宜步太霞而泛景，啸朗九霄； 御白日以登晨，飞形三景。 自受丹书之启誓，获传黄素之成章。 不负初心，仰弘大教，钦承词旨，谨为典行。 伏虑孤魂滞魄，自从宿世，以及今身，举意故为，动情悮犯，未能持身，不益损己为先。 嗜利无厌，弗守固穷之志； 临财苟取，不萌见得之思。 或闭吝於己资，或侵攘於他物。 自求丰殖，罔恤困穷。 既乖推义之心，实负保真之戒。 恐成愆对，未卜升沉。 又虑恣迷贪累以苦形，展转尘劳而忘本。 祸招亿劫，罪积万端。 或沉沦於泉曲河源，未出离於寒庭阴境。 祈哀大道，请命至真。 冀超黑壤之拘囚，是仗玄都之开宥。 伏愿恩覃十极，泽被万方。 赤龙飞负於宝章，丹凤驿传於青箓。 命魔三界，宣敕九门。 金简玉符，普开明於长夜； 朱书紫策，下超度於重阴。 又乞三天师恩，玄中教主。 召灵官於三洞，勑掾吏於九泉。 及召四始三元，二十八治，符章曹局，监察官君，五岳神司，九州社令，捧持符赦，告下冥曹。 摄召亡魂，齐到帝所。 宣九过，庆东向以受生，普度十回，升南宫而炼质。 彻天响地，御炁生神。 普令有识之含灵，咸得往生而随愿。 则上明天尊大慈之化，下副臣等皈命之诚。 谨启以闻。 一愿恩覃宇宙，二愿泽被幽明， 三愿青华度命，四愿玉简开扃， 五愿神真降盻，六愿坛陛通灵， 七愿亡魂返妙，八愿滞魄超升， 九愿四司禀敕，十愿五帝监生， 十一愿灵光下烛， 十二愿功果咸成。 复炉同早朝 玉箓大斋第二日午朝仪竟 玉箓大斋第二日晚朝仪 各礼师，存念如法 金真空降，神虎检营。 玉帝披霞，诸天命灵。 九晨回驾，万魔束形。 九微迅烟，神威摄精。 流金掷火，百恶消并。 神耀辉夜，洞杳长春。 圣道荡荡，十方肃清。 保制劫运，元亨利贞。 发炉同早朝 请称法位",
      "translated_text": "Three Bows. Once more proclaiming the sacred ranks, we, the assembled officiants and all present before the altar, with utmost",
      "overlap_context": "Now, therefore, we burn incense, taking refuge from the scriptural venerables and the great sagely hosts, whose perfect virtue",
      "start_char": 8180,
      "end_char": 8993,
      "start_sentence": 521,
      "end_sentence": 577,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 1.4148883819580078,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓大斋三日九朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "具位，与临坛官众等，谨同诚上启虚无自然元始天尊，无极大道太上道君，太上老君，高上玉皇，十方已得道大圣众至真诸君丈人，三十二天帝君，玉虚上帝，玉帝大帝，东华南极西灵北真玄都玉京金阙七宝琼台紫微上宫灵宝至真明皇道君，三十六部尊经，玄中大法师，上相上宰、上保上傅，太#1平下教二十四真人，西城总真王君，太乙真人，东岳上卿司命，茅君定录保命二真人，名山洞府得道神仙，三界官属，一切真灵。 臣闻，六合隐形，潜混中灵之祖炁； 五阳周纬，开明梵宝之天元。 光耀杳冥，芒飞炜烨。 遐该九极，总统三辰。 启劫运於上皇，应灵图於太极。 分洞神之仙境，感化生文； 出神宝之禁书，浮空结篆。 推符历数，载度天民。 臣等滥缀真阶，叨游秘范。 泛黄华之妙景，凝盻篇章； 披紫笈之重玄，遵依科品。 凡有所启，敢不上闻。 斋意青词，谨当宣奏。 宣词 具如词言，不违恳款。 恩惟大道，分别哀祈。 臣闻玉虚玄阙，育三光魂魄之精； 金境紫清，浮九炁阴阳之粹。 通神入寂，招真致灵。 臣等恭款良宵，精修妙范。 藏云屏翳，泛四景以朗清； 旋斗历箕，接三光而焕烂。 宝盖命群真之驾，玉炉腾九色之烟。 恭假香传，奉修斋直。 以今落景行道，请法众等，运兹初捻上香。 愿此香烟腾空，径上供养虚无至真自然大道元始天尊。 愿以是捻香功德，上祝当今皇帝，圣寿无疆。 伏愿伦序五行，气调六律。 曰旸曰雨，齐七政之璇玑； 不暑不冰，和四时之玉烛。 顺阴阳而合德，侔日月以并明。 世路丕平，年登上熟。 与天同久，申命用休。 今故烧香，自皈依道尊大圣众，至真之德，得道之后，祈天长存。 臣闻，栽成天地，出保家宁国之文； 化育阴阳，立度死济生之式。 诸天校录，万圣临轩。 以今落景行道，请法众等，运兹二捻上香。 愿此香烟腾空，径上供养玉晨至圣自然灵宝大道天尊。 愿以是捻香功德，归流三涂九夜，六道四生； 并愿落灭恶根，出离苦趣。 结胎返炁，俱升碧落之乡； 易质蜕形，尽陟朱陵之界。 俾死魂而受炼，获仙化以成人。 报对停休，冤仇和释。 超凌三界，逍遥九清。 今故烧香，自皈依经尊大圣众，至真之德，得道之后，升入无形。 臣闻，大道阐於不言，故示慈悲之典； 真元出於有象，乃垂济度之方。 今古攸遵，人天仰赖。 以今落景行道，请法众等，运兹三捻上香。 愿此香烟腾空，径上供养混元大圣自然化主道德天尊。 愿以是捻香功德，上资所荐神灵。 伏愿长谢嚣尘，永辞色界。 结胎斩滞，含元炁之冲融； 混化生神，畜天真於玄爽。 返本初而精练，悟我理之兼忘。 泛景洞空，散思霄映。 逍遥灵驾，游宴上京。 今故烧香，自皈依师尊大圣众，至真之德，得道之后，升入无形。 忏悔 三启",
      "translated_text": "We, the officiants of this rite and all assembled before the altar, with reverent unity do hereby address and invoke:\n\nThe Boundless and Self-So Primordial Heavenly Worthy of the Void and the Natural,\nThe Supreme Dao Lord of the Limitless Great Dao,\nThe Most High Lord Lao,\nThe August Jade Emperor,\nThe perfected and holy sages of the ten directions who have attained the Dao,\nThe True Lords and Venerable Ones,\nThe thirty-two Heavenly Emperors,\nThe Jade Purity Highest Emperor,\nThe Great Emperor of the Jade Capital,\nThe Eastern Flower, Southern Culmen, Western Numinous, and Northern True Realms,\nThe Seven-Treasured Jeweled Terrace of the Purple Tenuity Upper Palace,\nThe Numinous Treasure Perfected Radiant August Dao Lord of the Jade Metropolis Golden Portal,\nThe thirty-six sacred scriptures of the supreme canons,\nThe Great Dharma Masters of the Mysterious Center,\nThe High Ministers, High Stewards, High Protectors, and High Tutors,\nThe twenty-four Perfected of the Great Peace’s lower teachings,\nThe Sovereign Perfected King of the Western Citadel,\nThe Perfected of the Great One,\nThe High Minister of Life of the Eastern Marchmount,\nThe Two Perfected Lords Mao—Keepers of the Register and Guardians of Destiny,\nThe divine immortals who have attained the Dao in the sacred mountains and grotto-heavens,\nThe officials and attendants of the Three Realms,\nAnd all true numina.\n\nWe have heard that the Six Harmonies conceal their forms, concealing the primordial qi of the hidden and blended numinous ancestor; the Five Yangs weave the warp of the cosmos, unfolding the luminous heaven of Brahma’s treasures. Radiance illumines the distant and obscure; brilliance soars in dazzling splendor. Far-reaching, it embraces the Nine Poles; in totality, it governs the Three Luminaries. It inaugurated the kalpic destiny of the Highest Antiquity and responded to the numinous chart of the Great Ultimate. It divided the immortal realms of the cavernous divine and inspired the texts of transformation and life; it produced the sacred talismans of the divine treasures, floating in the void and forming their sigils. It propelled the tally of the celestial reckoning and thereby delivered the people of heaven.\n\nWe, unworthy as we are to stand upon the ranks of the perfected, have presumptuously wandered within the arcane teachings. We have drifted upon the wondrous scene of the Yellow Flower and concentrated our gaze upon the sacred texts; we have unfurled the purple bamboo slips of the profound and obscure and followed the regulations and precepts. In all that we now present, we dare not withhold it from the hearing of the Most High. The intent of this fast is expressed in the blue-green memorial, which we now humbly proclaim.\n\nProclamation of the Memorial\nAs the words of the memorial declare, without deviation from our earnest supplication:\n\nWe implore the Great Dao to distinguish and heed our sorrowful entreaty.\n\nWe have heard that the Mysterious Portal of the Jade Purity nurtures the essence of the three luminaries’ souls and spirits; the Golden Realm of the Purple Clarity floats the purest qi of the ninefold yin and yang. It communicates with the divine and enters quiescence, summoning the true and drawing forth the numinous.\n\nWe, with reverent devotion, have diligently cultivated the wondrous teachings on this propitious night. Concealing the clouds and veiling the obscurities, we have spread the four seasons to illumine the clarity; revolving the Dipper and traversing the Winnowing Basket, we have received the three luminaries in resplendent brilliance. The precious canopy commands the chariots of the host of perfected; the jade censer emits the nine-colored smoke.\n\nWith respectful reliance upon the transmission of incense, we undertake the fast and vigil. At this hour of the setting sun and the performance of the Dao, we, the assembled officiants of the Dharma, now offer the first pinch of incense.\n\nMay this incense smoke ascend directly into the void to offer reverent devotion to the Boundless and Self-So True and Natural Great Dao, the Primordial Heavenly Worthy.\n\nMay the merit of this pinch of incense extend upward to bless the present emperor, that his sagely longevity be without end. We humbly pray that the five phases maintain their order, the six pitch-pipes harmonize their qi. May the sun and rain be timely, aligning the seven regulators’ jade pivots; may there be neither scorching heat nor freezing cold, harmonizing the four seasons’ jade candles. May yin and yang unite in virtue, matching the sun and moon in shared radiance. May the world’s paths be greatly pacified, the years yield abundant harvests. May he share the heavens’ eternity, his mandate flourishing and renewed.\n\nFor this purpose, we now burn incense, from our reverent devotion to the Dao, the honored and sagely host, the virtue of the perfected and true, that after attaining the Dao, we may pray for the heavens’ enduring presence.\n\nWe have heard that the texts of planting completion in heaven and earth bring protection to the family and peace to the state; the transformation and nurturing of yin and yang establish the models for delivering the dead and saving the living. The record-keepers of the heavens and the myriad sages attend the imperial throne.\n\nAt this hour of the setting sun and the performance of the Dao, we, the assembled officiants of the Dharma, now offer the second pinch of incense.\n\nMay this incense smoke ascend directly into the void to offer reverent devotion to the Jade Dawn Perfected and Sagely Natural Numinous Treasure Great Dao Heavenly Worthy.\n\nMay the merit of this pinch of incense flow to the Three Wretched Paths, the Nine Nights, the Six Destinies, and the Four Modes of Birth. May all evil roots be extinguished, and all beings depart from suffering and distress. May they congeal the embryo and return the qi, together ascending to the Azure Empyrean; may they change their substance and shed their forms, all ascending to the Crimson Mound’s precincts. May the dead souls receive refinement and attain immortal transformation to become human. May retribution cease and enmity be resolved. May they transcend the Three Realms and roam freely in the Nine Clarities.\n\nFor this purpose, we now burn incense, from our reverent devotion to the scriptures, the honored and sagely host, the virtue of the perfected and true, that after attaining the Dao, we may ascend into the formless.\n\nWe have heard that the Great Dao unfolds in silence, thus revealing its scriptures of compassion; the True Origin emerges from the realm of form, thereby bestowing its methods of salvation and deliverance. Through past and present, humans and gods alike have relied upon and revered it.\n\nAt this hour of the setting sun and the performance of the Dao, we, the assembled officiants of the Dharma, now offer the third pinch of incense.\n\nMay this incense smoke ascend directly into the void to offer reverent devotion to the Primordial Great Sage, the Natural Transformer and Lord of the Dao and its Virtue, the Heavenly Worthy.\n\nMay the merit of this pinch of incense extend upward to aid the spirits for whom this rite is offered. We humbly pray that they may forever depart from the clamor of the dust and eternally leave the realm of form. May they congeal the embryo and sever stagnation, containing the harmonious fusion of the primordial qi; may they blend transformation and engender the divine, nurturing the celestial perfected within the mysterious clarity. May they return to their original essence and refine their essence, awakening to the forgetting of both principle and self. May they drift upon the scene of the cavernous void, dispersing their thoughts in the radiance of the clouds. May they roam freely in their numinous chariots, feasting and wandering in the Upper Capital.\n\nFor this purpose, we now burn incense, from our reverent devotion to the masters, the honored and sagely host, the virtue of the perfected and true, that after attaining the Dao, we may ascend into the formless.\n\nRepentance\nThreefold Invocation.",
      "overlap_context": "Three Bows. Once more proclaiming the sacred ranks, we, the assembled officiants and all present before the altar, with utmost",
      "start_char": 8993,
      "end_char": 10046,
      "start_sentence": 578,
      "end_sentence": 640,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.43346905708313,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓大斋三日九朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "三礼 重称法位 具位与临坛官众等，谨同诚上启三清至尊，十方上圣玉京金阙天帝天真，十方师尊圣众，三界官属，一切威灵。 臣闻，六过制魔，受伏诺送迎之命； 三元品戒，示荡形沐浴之科。 臣等叨濯玄津，获俦灵运。 所宜服中黄而内养，灌溉丹田； 凝太素以高观，咀飧玉液。 蚤佩升真之箓，启传破秽之文。 普度幽沉，誓弘清静。 况承词剡，恭为典行。 今奉某伏为孤魂滞魄，自从宿生今世，举意误为。 动情故犯，未能推诚慈顺，笃志温良。 不思三戒之时，或专斗气； 不顾一朝之忿，或致忘身。 恣凶怒以凌人，恃强梁而兼弱。 心怀嗔性，口肆恶声。 惟积过以稔非，罔修真而奉戒。 恐因报对，未卜升沉。 仰祈超济，恭仗修崇。 非涤故以洗新，曷升虚而入妙。 仰垂惠泽，密注恩波。 勑九凤之将军，命五灵之童子，招魂将吏，解秽官君，浣濯夫人，黄华玉女，请取太玄神水，炼尸素浆，甘露金液，云腴玉醴。 合和真炁，使流注於香汤； 沐浴尘劳，悉荡除於阴翳。 魂神澄正，性识圆明。 灌澡五芽，整齐八景。 冠带簪绂，佩服羽仪。 飞步九灵，出离五浊。 灭三涂而涤罪，宣六腑以生津。 断绝地根，荡除尸秽。 永蠲热恼，普获清凉。 易旧更新，洗瑕磨垢。 登质於高明之境，怡神於玄爽之都。 永谢尘寰，俱跻道岸。 则上明天尊大慈之化，下副臣等皈命之诚。 谨启以闻。 十念 一念一真布景，二念二象回倾， 三念三尊鉴映，四念四炁调平， 五念五文焕烂，六念六惠齐明， 七念七辰合瑞，八念八卦利贞， 九念九光旋匝，十念魂魄飞升。 复炉同早朝 玉箓大斋第二日晚朝仪竟 #1『太』原作『大』，误，据上下文义改。 玉箓大斋第三日早朝仪 各礼师，存念如法 天书赦罪，下颁太微。 元化生成，灵烟九回。 八景六周，圣运所持，左宾赤方，右启帝扉。 东华南府，灌炼辟非。 回轮日耀，转盻月辉。 今日大庆，万道同归。 玄坛正炁，保天无衰。 普告三界，驿龙风驰。 鸣法鼓二十四通 无上三天玄元始三炁太上老君，召出臣身中三五功曹、左右官使者，左右捧香金童、传言散花王女、五帝直符直日香官，各三十六人出。 出者，严装显服，冠带垂缨。 关启玄坛土地，方域神真。 臣今早朝，升坛行道，朝谒帝真。 谨奏为入意其诸诚意，具载缄誊。 愿得太上至真道炁灵宝瑞光下降，流入臣等身中，令臣所启之诚，速达径御至真无极大道三清上圣、昊天至尊金阙玉皇上帝御前。 请称法位 具位与临坛官众等，谨同诚上启虚无自然元始天尊，无极大道太上道君，太上老君，高上玉皇，十方已得道大圣众至真诸君丈人，三十二天帝君，玉虚上帝，玉帝大帝，东华南极西灵北真玄都玉京金阙七宝琼台紫微上宫灵宝至真明皇道君，三十六部尊经，玄中大法师，上相上宰、上保上傅，太平下教二十四真人，西城揔真王君，太乙真人，东岳上卿司命，茅君定录保命二真人，名山洞府得道神仙，三界官属，一切真灵。 臣闻七素徘徊，兆七阳而分化； 五元因合，焕五纬以乘天。",
      "translated_text": "**Threefold Prostration**\n\nReverently invoking the sacred ranks, we, the assembled officiants and all present at this altar, with unified sincerity, now supplicate the Three Clarities Most Exalted, the August Jade Capital and Golden Portals of the Heavenly Emperors and Perfected Ones of the Ten Directions, the Venerable Hosts of Masters from all quarters, the divine officials of the Three Realms, and all majestic numina.\n\nWe have heard that the Six Transgressions subdue demons, receiving the mandate to escort and welcome; the Three Primes’ precepts of discipline prescribe the rites of purificatory bathing and bodily refinement. We, undeserving, have bathed in the mystic stream and been graced with the company of the numinous. Thus, we ought to wear the Central Yellow within to nurture and irrigate the Cinnabar Field; to congeal the Primal Simplicity in lofty contemplation and imbibe the Jade Fluid. Early we don the register of ascension to the Perfected, and transmit the scriptures for dispelling defilement. Vowing to deliver the sunken and obscured, we pledge to magnify purity and stillness. Moreover, in reverent compliance with the written command, we now conduct this rite.\n\nToday, we humbly offer this supplication on behalf of the wandering souls and stagnant spirits who, from past lives to this present existence, have erred in thought and deed. Moved by emotion, they transgressed, failing to cultivate sincere kindness and compliance, or to steadfastly uphold gentleness. Unmindful of the Three Precepts’ appointed times, they indulged in quarrels; heedless of a moment’s wrath, they forgot themselves. Yielding to fury, they bullied others; relying on brute strength, they oppressed the weak. Their hearts harbored wrathful natures, their mouths spewed vicious words. Accumulating transgressions and nurturing wrongs, they neglected to cultivate the Real and uphold the precepts. Fearful of karmic retribution, uncertain of their ascent or descent, we now beseech deliverance, relying upon this solemn rite. Without washing away the old to renew, how may they ascend the void and enter the wondrous?\n\nWe implore the gracious descent of beneficent radiance, the secret infusion of merciful waves. We command the Generals of the Nine Phoenixes, the Lads of the Five Numinosities, the Officers of Summoning Souls, the Lords of Dispelling Defilement, the Lady of Ablution, the Jade Maidens of Yellow Splendor—pray take the Divine Water of the Great Mystery, refine the corpse’s plain broth, the Golden Fluid of Sweet Dew, the Cloud Fat of Jade Nectar. Blend and harmonize the true qi, that it may flow into the fragrant bath; wash away the toil of dust and wholly dissolve the yin shadows. May their ethereal souls be clarified and rectified, their natures and perceptions perfectly luminous. Bathe the Five Sprouts, align the Eight Effulgences. Adorn them with caps, sashes, hairpins, and pendants; clothe them in the regalia of feathered splendor. Let them tread the Nine Numinosities, escape the Five Turbidities. Extinguish the Three Wretched Paths and cleanse their sins; proclaim the Six Bowels and generate their fluids. Sever the root of earthly attachment, purge the corpse’s defilements. Forever dispel burning afflictions, universally attain cool purity. Renew the old and transform it, wash away flaws and polish grime. Ascend in substance to the realm of lofty brilliance, delight the spirit in the capital of mysterious clarity. Forever depart the dusty world, together ascend the shore of the Dao. Thus shall the transforming grace of the Most High Heavenly Worthy be manifest above, and the sincerity of our devotion be fulfilled below.\n\nTen Invocations:\nFirst invocation: One Real arrays the scene;\nSecond invocation: Two Images return and incline;\nThird invocation: Three Exalted Ones reflect and illumine;\nFourth invocation: Four qi harmonize and level;\nFifth invocation: Five Scriptures blaze resplendent;\nSixth invocation: Six Graces shine in unison;\nSeventh invocation: Seven Luminaries converge in auspiciousness;\nEighth invocation: Eight Trigrams thrive in uprightness;\nNinth invocation: Nine Lights revolve and encircle;\nTenth invocation: Souls and spirits ascend in flight.\n\n**Replenishing the Censer, Together with the Early Audience**\n\nThe second evening audience of the *Jade Register Grand Fast* concludes.\n\n---\n\n**Jade Register Grand Fast: Third Day Early Audience Rite**\n\nEach pays homage to the masters, contemplating as prescribed.\n\nThe Heavenly Writs remit sins, descending from the Great Tenuity. The Primal Transformation engenders and completes, the numinous smoke coils ninefold. Eight Effulgences and Six Circuits, the sacred course upheld—on the left, the Red Quarter receives guests; on the right, the Imperial Portal opens. The Eastern Flower and Southern Mansion refine and dispel wrong. The Wheel turns with the sun’s radiance, the gaze shifts with the moon’s splendor. Today is a great celebration, myriad paths converge as one. The true qi of the Mystic Altar preserves Heaven’s undiminished majesty. Universally proclaimed to the Three Realms, swift as dragons and winds.\n\n**Strike the Dharma Drum Twenty-Four Times**\n\nO Most High Three Heavens, Primal Origin, Three Qi, Most High Lord Lao: summon forth from within our bodies the Three and Five Merit Officers, the Left and Right Attendants, the Left and Right Golden Lads bearing incense, the Jade Maidens scattering flowers, the Five Thearchs’ Direct Messengers, the Incense Officials of the Day—thirty-six each, let them emerge. Emerging, let them be arrayed in solemn attire, caps and sashes with pendent cords. We now invoke the local deities and territorial Perfected of the Mystic Altar. Today, at this early audience, we ascend the altar to perform the Dao, to pay homage to the Imperial Perfected. Humbly we present our intentions and sincerities, all inscribed in sealed documents. May the numinous radiance of the Most High Perfected, the true qi of the Numinous Treasure, descend and flow into our bodies, that our supplications may swiftly reach the presence of the Most High, Boundless, Great Dao’s Three Clarities and August Saints, the Most Exalted Jade Emperor of the Golden Portals of the August Heaven.\n\n**Invoking the Sacred Ranks**\n\nWe, the assembled officiants and all present at this altar, with unified sincerity, now supplicate the Heavenly Worthy of the Void and Spontaneity, the Primordial Origin; the Most High Lord of the Dao, the Boundless Great Dao; the Most High Lord Lao; the August Jade Emperor; the Great Sage Hosts of the Ten Directions who have attained the Dao; the Perfected Lords and Masters; the Thirty-Two Heavenly Emperors; the Jade Tenuity Most High; the Great Emperor of the Jade Capital; the Eastern Flower, Southern Culmen, Western Numinosity, Northern Perfection, and the Golden Portals of the Seven Treasures’ Jeweled Terrace of the Purple Tenuity’s Upper Palace; the Numinous Treasure Most High, Illustrious Sovereign of the Dao; the Thirty-Six Divisions of Venerable Scriptures; the Great Dharma Masters of the Mystic Center; the Supreme Ministers, Prime Ministers, Supreme Protectors, and Supreme Tutors; the Twenty-Four Perfected of the Great Peace’s Lesser Teaching; the King of Total Perfection of the Western City; the Perfected of the Great Unity; the Supreme Minister of the Eastern Marchmount and Controller of Destinies; the Two Perfected Lords Mao, Regulators of Records and Protectors of Life; the divine immortals who have attained the Dao in the named mountains and grotto-heavens; the divine officials of the Three Realms; and all true numina.\n\nWe have heard that the Seven Simplicities revolve, presaging the division of the Seven Yangs; the Five Primes unite, illuminating the Five Wefts to ride the heavens.",
      "overlap_context": "ing to the forgetting of both principle and self. May they drift upon the scene of the cavernous void, dispersing their thoughts in the radiance of the clouds. May they roam freely in their numinous chariots, feasting and wandering in the Upper Capital.\n\nFor this purpose, we now burn incense, from our reverent devotion to the masters, the honored and sagely host, the virtue of the perfected and true, that after attaining the Dao, we may ascend into the formless.\n\nRepentance\nThreefold Invocation.",
      "start_char": 10046,
      "end_char": 11228,
      "start_sentence": 641,
      "end_sentence": 707,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.48948287963867,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓大斋三日九朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "储粹幽微，浮空高爽。 总摄梵英之炁，肇萌皓景之光。 积号延康，开明亿劫。 纪素灵之玉历，凝结成书，阐黄老之宝章，芒虚符篆。 八威安镇，万宝生成。 臣等叨位玄门，列名紫格。 参金阙自然之道，静念至真； 受锦囊大有之文，恭依具与。 凡有奏启，敢不以闻。 斋意青词，谨当宣奏。 宣词 具如词旨，不违款恳。 恩惟大道，分别哀祈。 臣闻湛寂元尊，御清微而不宰； 抚绥九有，履玄运以无私。 弘敷妙道之因，太极幽途之苦。 臣等待旦存神、诘朝行道。 紫霞耀日，苍龙初上於扶桑； 赤景流空，羲驭已行於东陆。 返飙飙轮於真境，霭云盖於太虚。 恭假香传，奉修斋直。 以今第三日清旦行道，请法众等，运兹初捻上香。 愿此香烟腾空，径上供养虚无至真自然大道元始天尊。 愿以是捻香功德，上祝当今皇帝，景命无疆。 伏愿翕受百祥，顺齐七政。 嘉禾朱草，屡臻地宝之和； 甘露景星，并见天休之应。 龙马徕从於西极，凤凰翔集於紫庭。 诸福备膺，四灵毕集。 珍符沓至，叶炁旁流。 今故烧香，自皈依道尊大圣众，至真之德，得道之后，祈天长存。 臣闻，玉笈垂文，作人天之轨范； 金真演教，为生死津梁。 困乎妙有之功，大矣难名之化。 以今第三日清旦行道，请法众等，运兹二捻上香。 愿此香烟腾空，径上供养玉晨至圣自然灵宝大道天尊。 愿以是捻香功德，上资某灵。 伏愿九玄七祖，亿劫种亲。 并愿泛景太霞，飞神空洞。 登真悟道，陪九老以遨游； 凝玄炼真，参十华而啸咏。 断鬼官之逮役，度上南宫； 臻随劫以长存，生身受度。 福流裔嗣，庆及宗亲。",
      "translated_text": "The Essence stores the subtle and profound, floating high in the pure void. It gathers the qi of the divine blossoms, initiating the radiance of the luminous light. Accumulated titles extend prosperity, unfolding through countless kalpas. It records the jade calendar of the Primordial Numen, congealing into scripture; it unfolds the treasure chapters of the Yellow and Lao, with talismanic seals of emptiness and effulgence. The Eight Potencies settle in tranquility, and the myriad treasures come into being.\n\nWe, who hold humble positions in the Mystic Gate and are listed in the Purple Registers, partake in the natural Dao of the Golden Towers, meditating in stillness upon the Perfected; we receive the texts of the Great Existence from brocade pouches, reverently adhering to their precepts. In all matters of memorials and petitions, how dare we not make them known? With sincere intent in our blue-green memorials, we dutifully proclaim and present them.\n\n**Proclamation of the Memorial:**\nAs stated in the memorial’s intent, we do not deviate from its earnest supplication. We beseech the Great Dao to discern our humble prayers.\n\nWe have heard that the Profoundly Quiescent Primordial Honored One governs the Clear and Subtle without dominion; soothing and pacifying the Nine Domains, treading the mysterious workings with impartiality. It broadly bestows the causes of the wondrous Dao, and the hardships of the Supreme Ultimate’s hidden paths.\n\nWe, awaiting the dawn, preserve the spirits; at daybreak, we practice the Dao. Purple auroras illuminate the sun as the Azure Dragon first ascends Fusang; crimson radiance streams across the sky as the Solar Chariot journeys through the Eastern Land. The whirlwind returns the wheel to the true realm, and clouds gather like canopies in the Great Void. Reverently transmitting incense, we undertake the fast with devotion.\n\nOn this third day at dawn, as we practice the Dao, we invite the assembly of the Dharma to offer the first pinch of incense. May the smoke of this incense ascend directly to offer reverence to the Primordial Honored One of the Void and Perfected, the Natural Great Dao, the Celestial Worthy of Original Beginning.\n\nMay the merit of this pinch of incense extend upward to bless the present Emperor, that his august mandate endure without end. We humbly pray that he receive a hundred auspices and align with the Seven Governors. May auspicious grain and vermilion herbs repeatedly bring harmony to the earth’s treasures; may sweet dew and propitious stars manifest the heavens’ blessings. May dragon-horses come from the Western Limits, and phoenixes gather in the Purple Court. May all blessings be fully bestowed, and the Four Spirits assemble. May precious talismans arrive in abundance, and harmonious qi flow everywhere.\n\nThus, we now burn incense, from our devotion to the Dao, the Venerable, the Great Sage Assembly, and the Perfected’s virtue. After attaining the Dao, we pray for the heavens’ eternal preservation.\n\nWe have heard that the Jade Slips bestow texts, serving as the model for humans and devas; the Golden Perfected expound the teachings, becoming the bridge across birth and death. The merit of the wondrous existence is vast, and the transformations beyond naming are profound.\n\nOn this third day at dawn, as we practice the Dao, we invite the assembly of the Dharma to offer the second pinch of incense. May the smoke of this incense ascend directly to offer reverence to the Celestial Worthy of the Jade Dawn, the Perfected and Natural Numinous Treasure, the Great Dao, the Celestial Worthy.\n\nMay the merit of this pinch of incense extend upward to aid the spirit of [Name]. We humbly pray that the Nine Mysteries and Seven Ancestors, and the karmic kin of countless kalpas, may together ride the vast auroras and soar through the empty caverns. May they ascend to Perfection and awaken to the Dao, accompanying the Nine Elders in roaming; may they refine the mysterious and temper the true, joining the Ten Flowers in chanting and singing. May they sever the summons of the demon officials and cross over to the Upper Southern Palace; may they endure through kalpas, long preserved, and attain deliverance in body. May blessings flow to descendants and felicity extend to clan and kin.",
      "overlap_context": "Perfected of the Great Unity; the Supreme Minister of the Eastern Marchmount and Controller of Destinies; the Two Perfected Lords Mao, Regulators of Records and Protectors of Life; the divine immortals who have attained the Dao in the named mountains and grotto-heavens; the divine officials of the Three Realms; and all true numina.\n\nWe have heard that the Seven Simplicities revolve, presaging the division of the Seven Yangs; the Five Primes unite, illuminating the Five Wefts to ride the heavens.",
      "start_char": 11228,
      "end_char": 11836,
      "start_sentence": 708,
      "end_sentence": 751,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.022473335266113,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓大斋三日九朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "今故烧香，自皈依经尊大圣众，至真之德，得道之后，升入无形。 臣闻，圣德涵容，着延生之玉历； 道慈博爱，启落死之玄文。 斡运阴阳，主张造化。 以今第三日清旦行道，请法众等，运兹三捻上香。 愿此香烟腾空，径上供养混元大圣自然化主道德天尊。 愿以是捻香功德，上资所荐神灵。 伏愿序列真仙，炁归梵辅。 怡神遐想，翳秀叶之翠霞； 振袂高登，听琼房之妙韵。 停荫清冷之渚，乘轮深邈之衢。 带豁重开，运参灵化。 爽魄随本，玄会无涯。 今故烧香，自皈依师尊大圣众，至真之德，得道之后，升入无形。 忏悔 三启",
      "translated_text": "Now, therefore, we kindle incense and take refuge in the scriptures, the Venerable, the Great Sage Hosts, and the virtue of the Perfected, who, having attained the Dao, ascend into formlessness.\n\nWe have heard that the sagely virtue, all-embracing, inscribes the Jade Register of Prolonged Life; the Dao’s compassion, boundless in love, unfolds the Mystic Writ of Fallen Death. It revolves yin and yang, presiding over the workings of creation.\n\nOn this third day at dawn’s rite of the Dao, we invite the Dharma assembly to offer this third pinch of incense. May its fragrant smoke ascend through the void to directly present offerings to the Primordial Great Sage, the Natural Sovereign of Transformations, the Celestial Worthy of Dao and Virtue.\n\nMay the merit of this pinch of incense extend upward to aid the spirit thus invoked. We humbly pray that the ranks of Perfected Immortals may gather, their qi returning to the Brahmā’s retinue. May they delight in distant contemplation, veiled by the verdant radiance of luxuriant leaves; may they raise their sleeves in lofty ascent, listening to the wondrous strains of the jade chambers. May they rest in the shade of limpid, cool isles, and ride the wheel upon the profound and boundless thoroughfare. May they gird themselves with renewed openness, partaking in the numinous transformations. May their luminous souls follow their original nature, their mysterious union without limit.\n\nNow, therefore, we kindle incense and take refuge in the Preceptor, the Venerable, the Great Sage Hosts, and the virtue of the Perfected, who, having attained the Dao, ascend into formlessness.\n\nRepentance—thrice invoked.",
      "overlap_context": "r ride the vast auroras and soar through the empty caverns. May they ascend to Perfection and awaken to the Dao, accompanying the Nine Elders in roaming; may they refine the mysterious and temper the true, joining the Ten Flowers in chanting and singing. May they sever the summons of the demon officials and cross over to the Upper Southern Palace; may they endure through kalpas, long preserved, and attain deliverance in body. May blessings flow to descendants and felicity extend to clan and kin.",
      "start_char": 11836,
      "end_char": 12076,
      "start_sentence": 752,
      "end_sentence": 767,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.941872119903564,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓大斋三日九朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "三礼 重称法位 具位与临坛官众等，谨同诚上启三清至尊，十方上圣，玉京金阙天帝天真，十方师尊圣众，三界官属，一切威灵。 臣闻七过开关，星宿朗明而停景； 九阳结炁，形神炼度以登晨。 臣等早慕精修，获参奥旨。 所宜结胎婴而养素，坐致自然； 混生炁以归身，躬行内炼。 未臻神化，须有功勤。 期引接於群生，誓流行於大教。 况承词旨，恭为典行。 今奉某灵，自从宿世，以及今身。 举意故为，动情误犯。 未能坚持纯实，恪守温良。 曾无反已之诚，靡奉成真之戒，尤恐还生人道，久汩尘劳。 不能保命以爱神，至于死坏而不顾。 沉声滞色，离其本真。 致生炁之无津，固死根而结滞。 仰祈炼度，普获飞升。 伏愿垂悯苍生，广施玄泽。 敕九光之童子，请五老之灵君。 铺饴以五色之晶，灌注以九阳之炁。 涎容流火，沐浴黄华。 又请百炼金刚，千和玉液。 元皇散妙，太白流光。 宣通胞源，解开结节。 混合神质，灌炼身心。 俾脏腑以清凉，使魂神而安镇。 回骸起死，返阴成阳。 重敕天医之功曹，散布太清之神药。 即使魂仪受炼，仙化更生。 乘九炁以结形，蒙三元而育质。 三关五脏，六府九宫。 本始生神，根源复命。 合灵捐息，怀胎皆得以生成； 朽骨枯骸，易质咸承於超度。 则上明天尊大慈之化，下副臣等皈命之诚。 谨启以闻。 一愿天澄炁朗，二愿日照月临， 三愿景星出现，四愿法雨霖淫， 五愿冤愆罢对，六愿苦楚停吟， 七愿龙章飞舞，八愿凤篆流金， 九愿真灵集降，十愿福被幽阴， 十一愿灵魂普度， 十二愿平步超升。 复炉 存神烧香",
      "translated_text": "Thrice we bow in reverence. Again invoking the sacred ranks, we, the assembled officiants and all present before the altar, with one heart and sincere devotion, reverently address the Three Purest Venerables, the Ten Directions’ Most Sagely Ones, the Heavenly Emperors and Perfected of the Jade Capital and Golden Towers, the Master Hosts of the Ten Directions, the divine assemblies of the Three Realms, and all numinous powers.\n\nWe have heard that when the Seven Gates of transgression are opened, the stellar lodges shine bright and still the shadows; when the Nine Yangs conjoin their qi, form and spirit are refined and ascend at dawn. We, from early days, have admired the path of pure cultivation and gained access to its profound mysteries. Thus should we nurture the embryonic infant in simplicity, sitting in attainment of the natural; merge the qi of all life into the body, personally practicing inner refinement. Yet, not having reached the realm of spirit-transformation, we must apply diligent effort. We vow to guide and receive all beings, pledging to propagate the great teaching. Moreover, in accordance with the sacred command, we reverently perform this ritual.\n\nNow, on behalf of [Name of the Deceased], from past lives to the present incarnation, in thought and deed, by intention or error, we acknowledge faults and transgressions. Unable to maintain unwavering sincerity or steadfastly uphold gentleness and goodness, lacking the sincerity of self-reflection and failing to observe the precepts of Perfected attainment, we fear returning to the human realm, long submerged in worldly toil. Unable to preserve life and cherish the spirit, we reach death’s dissolution without regard. Enmeshed in sound and form, we depart from our original true nature, causing the qi of life to lose its flow and the roots of death to bind and stagnate.\n\nWe beseech refinement and deliverance, that all may universally attain ascension. May the Three Purest Venerables look upon living beings with compassion and broadly bestow their mysterious grace. We invoke the Lads of the Nine Lights and entreat the Divine Lords of the Five Ancients. We spread the five-colored essence as nectar and pour forth the qi of the Nine Yangs. Flames of flowing fire bathe us, and we are cleansed in the yellow blossoms. We further invoke the Hundred-Tempered Vajras and the Thousand-Harmonized Jade Liquor. The Primordial Sovereign scatters wondrous essence, and the Great White streams forth radiance. We proclaim the opening of the womb’s source, dissolving knots and obstructions, blending spirit and substance, refining body and mind. May the viscera be cooled and cleansed, the hun and shen settled and pacified. May the bones return from death, the yin transform into yang. We again command the celestial physicians’ messengers to scatter the divine medicines of the Great Purity. Thus may the soul receive refinement and the immortal transformation be renewed. Riding the Nine Qi to form the body, receiving nurture from the Three Origins, the Three Passes and Five Viscera, the Six Palaces and Nine Palaces, the original gods of life and the roots of destiny are restored. United with the numinous and relinquishing breath, all in the womb attain birth and completion; withered bones and dry skeletons exchange their substance and are universally delivered.\n\nMay this manifest the great compassion of the Heavenly Worthy above and fulfill our devotion in taking refuge below.\n\nRespectfully we make this entreaty known.\n\nFirst, may the heavens be clear and the qi bright;\nSecond, may the sun shine and the moon attend;\nThird, may auspicious stars appear;\nFourth, may the Dharma-rain fall abundantly;\nFifth, may karmic grievances cease their opposition;\nSixth, may suffering and lamentation be stilled;\nSeventh, may dragon-script dance in flight;\nEighth, may phoenix-seals flow like molten gold;\nNinth, may the Perfected and Numinous descend and gather;\nTenth, may blessings extend to the hidden and the departed;\nEleventh, may all souls be universally delivered;\nTwelfth, may all ascend with ease.\n\nThe incense is renewed. With focused spirit, we burn the incense.",
      "overlap_context": "shade of limpid, cool isles, and ride the wheel upon the profound and boundless thoroughfare. May they gird themselves with renewed openness, partaking in the numinous transformations. May their luminous souls follow their original nature, their mysterious union without limit.\n\nNow, therefore, we kindle incense and take refuge in the Preceptor, the Venerable, the Great Sage Hosts, and the virtue of the Perfected, who, having attained the Dao, ascend into formlessness.\n\nRepentance—thrice invoked.",
      "start_char": 12076,
      "end_char": 12703,
      "start_sentence": 768,
      "end_sentence": 814,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.399798154830933,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓大斋三日九朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "香官使者、左右龙虎君、侍香诸灵官，当令臣向来早朝升坛行道之所，自然生金液丹碧芝英。 百灵众真，交会在此，香火炉前。 当愿十方仙童玉女，接侍兰烟，传臣向来所奏之诚，速达径上至真无极大道三清上圣、昊天至尊金阙玉皇上帝御前。 玉箓大斋第三日早朝仪竟 各礼师，存念如法 元始虚皇，集炁居中。 三境洞杳，肇生穹窿。 七转九灵，混合回风。 变化万神，天地开通。 吉日行事，万魔敬从。 晨辉朗照，默运元功。 执节建麾，散花太空。 十方普度，劫运无终。 发炉同早朝 请称法位 具位与临坛官众等，谨同诚上",
      "translated_text": "Fragrant Bureau Envoys, Left and Right Dragon-Tiger Lords, and all Attending Fragrant Spirit-Officials—may this place where we have this morning ascended the altar to perform the Dao now spontaneously generate golden liquid, cinnabar, azure mushrooms, and divine herbs. May the hundred numinous Perfected gather here before the incense burner.\n\nWe pray that the jade maidens and immortal youths of the ten directions receive the orchid-scented smoke and swiftly convey the sincerity of our supplications directly to the presence of the Most Real and Boundless Dao’s Three Clarities, the August Celestial Venerables, and the Jade Emperor of the Golden Gates of the Supreme Heavenly Honored One.\n\nThe third-day morning audience of the Great Register Purification Rite is now concluded.\n\nAll pay homage to the masters and maintain contemplation according to the method.\n\nThe Primordial Sovereign of the Void, gathering qi, abides at the center.\nThe three realms stretch into profound obscurity, giving rise to the vault of heaven.\nSeven revolutions and nine numina merge and return with the wind.\nTransforming into myriad spirits, heaven and earth open and connect.\nOn this auspicious day, the rite is performed—ten thousand demons submit in reverence.\nMorning radiance shines brightly as the primordial work is silently enacted.\nHolding the tally and raising the banner, flowers scatter across the great void.\nThe ten directions are universally delivered; kalpas endure without end.\n\nThe incense is kindled, as in the morning audience.\n\nWe now declare the dharma-positions.\n\nWe, the assembled officiants and altar-attending assembly, respectfully unite in sincerity above.",
      "overlap_context": "ay the Dharma-rain fall abundantly;\nFifth, may karmic grievances cease their opposition;\nSixth, may suffering and lamentation be stilled;\nSeventh, may dragon-script dance in flight;\nEighth, may phoenix-seals flow like molten gold;\nNinth, may the Perfected and Numinous descend and gather;\nTenth, may blessings extend to the hidden and the departed;\nEleventh, may all souls be universally delivered;\nTwelfth, may all ascend with ease.\n\nThe incense is renewed. With focused spirit, we burn the incense.",
      "start_char": 12703,
      "end_char": 12952,
      "start_sentence": 815,
      "end_sentence": 830,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.872922897338867,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓大斋三日九朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 20,
      "original_text": "启虚无自然元始天尊，无极大道太上道君，太上老君，高上玉皇，十方已得道大圣众至真诸君丈人，三十二天帝君，玉虚上帝，玉帝大帝，东华南极西灵北真玄都玉京金阙七宝琼台紫微上宫灵宝至真明皇道君，三十六部尊经，玄中大法师，上相上宰、上保上傅，太平下教二十四真人，西城揔真王君，太乙真人，东岳上卿司命，茅君定录保命二真人，名山洞府得道神仙，三界官属，一切真灵。 臣闻八景潜辉，合太冥於无色； 一阳积气，结梵混於初元。 肇萌上景之光，乃应开皇之号。 玄精发耀，成象流形。 五劫既周，九霄八化，元始肇封於紫典； 敷炳天文，皇人纪律於玉章。 总持劫运，群魔钦顺，万国安宁。 臣等忝与真俦，夙承妙荫。 负九色之圆象，咽液存思； 咏三合之灵章，依科遵奉。 凡有所启，敢不以闻。 斋意青词，谨当宣奏。 宣词 具如词言，不违恳款，恩惟大道，分别哀祈。 臣闻，独露本真，救万劫含灵而咸度； 广宣妙化，济九幽苦趣以无边。 隐显同休，人天仰赖。 臣等恭按斋仪，不遑暇食。 阳晶转烛，方临停午之初； 昼景腾辉，共仰中天之照。 绿辇倾光而回驾，紫烟结篆以浮空。 恭假香传，奉修斋直。 以今第三日中分行道，请法众等，运兹初捻上香。 愿此香烟腾空，径上供养虚无至真自然大道元始天尊。 愿以是捻香功德，上祝当今皇帝，景命无疆。 伏愿化洽八埏，教行六服。 金穰叶应，三登书大有之年； 王道正明，千载享太平之运。 日表重光之象，星昭循度之祥。 海晏河清，云行雨施。 万方有庆，四海无虞。 今故烧香，自皈依道尊大圣众，至真之德，得道之后，祈天长存。 臣闻郁罗萧台，乃三清之化境； 洞玄教典，由五劫之出书。 固真长存，保天无极。 以今第三日中分行道，请法众等，运兹二捻上香。 愿此香烟腾空，径上供养玉晨至圣自然灵宝大道天尊。 愿以是捻香功德，上资国祚宗枝。 伏愿碧简题名，丹台纪籍。 发灵光於寿域，益注遐龄； 固劫石於福基，永绥宠禄。 合太和而久视，保真炁以长扶。 嗣续繁昌，姻亲和睦。 今故烧香，自皈依经尊大圣众，至真之德，得道之后，升入无形。 臣闻，始青肇运，三真俱现而道德圆通； 灵宝度生，万炁长存而魂神澄正。 功惟微妙，形应斯须。 以今第三日中分行道，请法众等，运兹三捻上香。 愿此香烟腾空，径上供养混元大圣自然化主道德天尊。 愿以是捻香功德，上资所荐神灵。 伏愿偃息清明，从容虚妙。 云衢曜景，超四大於神方； 空洞流音，离九玄於幽裔。 心散重霄之上，炁凝华府之中。 焕落开襟，去留解带。 飞游自在，应感无方。 今故烧香，自皈依师尊大圣众，至真之德，得道之后，升入无形。 忏悔 三启",
      "translated_text": "We now invoke the Primordial Heavenly Worthy of the Void and Spontaneous Dao, the Boundless Great Dao and Supreme Lord of the Dao, the Supreme Lord Lao, the August Jade Emperor, the perfected and sagely hosts of the ten directions who have attained the Dao, the perfected lords and venerable masters, the thirty-two Heavenly Lords, the Jade Sovereign of the Void, the Great Jade Emperor, the Eastern Florescence and Southern Culmen, the Western Numinous and Northern Perfected, the Mystic Capital and Golden Portals of the Seven-Jewel Jeweled Terrace, the Purple Tenuity and Upper Palace, the Numinous Treasure and Perfected Radiant Sovereign of the Dao, the thirty-six revered scriptures, the Great Dharma Masters of the Mystic Center, the High Ministers and High Chancellors, the High Protectors and High Tutors, the twenty-four perfected of the Great Peace’s lower teachings, the King of Total Perfection of the Western City, the Perfected of the Great One, the High Minister of the Eastern Peak and Controller of Destiny, the Two Perfected Lords Mao of the Register of Life, the divine immortals who have attained the Dao in the grotto-heavens and sacred mountains, the officials of the three realms, and all true numina.\n\nWe have heard that the eight luminous scenes conceal their radiance, merging the Great Obscurity with the colorless; the single yang accumulates qi, congealing the Brahma-chaos in the primordial origin. The first sprouting of the light of the upper scene thus responds to the title of the Kaihuang era. Mystic essence emits its brilliance, forming images and flowing into shapes. When the five kalpas had run their course, the nine heavens and eight transformations saw the Primordial Beginning first enfeoffed in the Purple Canon; the celestial patterns were displayed, and the august person inscribed the statutes in jade tablets. Holding fast to the kalpas’ turning, all demons submit in reverence, and the myriad states enjoy peace.\n\nWe, unworthy though we are to stand among the perfected, have long received the shelter of their wondrous grace. Bearing the nine-colored round image, we swallow the fluids and hold the visualization; chanting the numinous chapters of the Three Unions, we follow the regulations and uphold them. In all that we now declare, how dare we not make it known? The green-worded memorial of our fast’s intent shall now be respectfully proclaimed.\n\nProclamation:\nAs the words declare, without deviation from our earnest supplication, we humbly beseech the Great Dao to distinguish and heed our prayers.\n\nWe have heard that the solitary revelation of the original true nature saves all sentient beings across ten thousand kalpas; the vast proclamation of wondrous transformation delivers the nine dark realms of suffering without bound. Hidden and manifest alike flourish, and humans and heavens alike depend upon it.\n\nWe, reverently adhering to the fast’s rites, have not paused even to eat. The yang-crystal turns the candle as we approach the first moment of midday; the brilliance of the day’s light ascends, and all gaze upon the illumination of the zenith. The green chariot tilts its light and returns; purple smoke forms talismanic script and floats in the void. With reverence we borrow the transmission of incense to perform the fast’s duties.\n\nOn this third day, at the midpoint of the circuit, we invite the dharma assembly to offer the first pinch of incense. May this incense smoke ascend directly to offer homage to the Primordial Heavenly Worthy of the Void, the Spontaneous, and the True Great Dao.\n\nBy the merit of this pinch of incense, we pray for the long and boundless mandate of the present emperor. May his transformation reach the eight borders and his teachings extend to the six directions. May golden harvests correspond to the signs, and the threefold abundance be recorded as a year of great plenty; may the royal way be rightly illuminated, and a thousand years enjoy the fortune of great peace. May the sun’s image shine with doubled radiance, and the stars manifest their orderly auspices. May the seas be calm and the rivers clear, clouds move and rain fall. May the ten thousand regions rejoice, and the four seas know no peril.\n\nFor this purpose we now burn incense, from our refuge in the virtue of the Dao, the venerable sagely hosts, and the perfected, that after attaining the Dao, they may long endure in heaven.\n\nWe have heard that the Yuluo Xiaotai is the transformed realm of the Three Clarities; the scriptures of the Mystic Teachings emerged from the five kalpas. Thus the true is eternally preserved, and heaven’s protection knows no limit.\n\nOn this third day, at the midpoint of the circuit, we invite the dharma assembly to offer the second pinch of incense. May this incense smoke ascend directly to offer homage to the Jade Dawn, the Most Sagely, the Spontaneous, and the Numinous Treasure Great Dao Heavenly Worthy.\n\nBy the merit of this pinch of incense, we pray for the imperial line and the ancestral branches. May names be inscribed on the azure tablets and recorded in the cinnabar registers. May numinous radiance shine forth in the realm of longevity, adding distant years; may the foundation of fortune be as firm as the kalpa-stone, eternally securing favor and emolument. May the union of great harmony endure, and the preservation of true qi long sustain. May descendants flourish and multiply, and affinal kin live in harmony.\n\nFor this purpose we now burn incense, from our refuge in the virtue of the scriptures, the venerable sagely hosts, and the perfected, that after attaining the Dao, they may ascend into the formless.\n\nWe have heard that the Beginning Azure inaugurated the turning, the Three Perfected all appeared, and the Dao and virtue were perfectly communicated; the Numinous Treasure delivers living beings, and the ten thousand qi long endure, while souls and spirits become clear and upright. The work is subtle and wondrous, and forms respond in an instant.\n\nOn this third day, at the midpoint of the circuit, we invite the dharma assembly to offer the third pinch of incense. May this incense smoke ascend directly to offer homage to the Primordial Great Sage, the Spontaneous Transformer, and the Heavenly Worthy of the Dao and its Power.\n\nBy the merit of this pinch of incense, we pray for the spirits being offered to. May they rest in clarity and ease, moving with leisure in the empty and wondrous. May the cloud thoroughfares shine with radiance, transcending the four great elements in the divine realm; may the empty void flow with sound, departing the nine mysteries of the dark borders. May their hearts scatter above the layered heavens, and their qi congeal within the flowery palaces. May they unfasten their robes and loosen their sashes, free in coming and going. May they fly and wander at will, responding to stimuli without limit.\n\nFor this purpose we now burn incense, from our refuge in the virtue of the masters, the venerable sagely hosts, and the perfected, that after attaining the Dao, they may ascend into the formless.\n\nRepentance:\nWe now make the Threefold Invocation.",
      "overlap_context": " auspicious day, the rite is performed—ten thousand demons submit in reverence.\nMorning radiance shines brightly as the primordial work is silently enacted.\nHolding the tally and raising the banner, flowers scatter across the great void.\nThe ten directions are universally delivered; kalpas endure without end.\n\nThe incense is kindled, as in the morning audience.\n\nWe now declare the dharma-positions.\n\nWe, the assembled officiants and altar-attending assembly, respectfully unite in sincerity above.",
      "start_char": 12952,
      "end_char": 13983,
      "start_sentence": 831,
      "end_sentence": 890,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.89379572868347,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓大斋三日九朝仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 21,
      "original_text": "三礼 重称法位 具位与临坛官众等，谨同诚上启三清至尊，十方上圣，玉京金阙天帝天真，十方师尊圣众，三界官属，一切威灵。 臣闻，幽夜开光，八过精思而研诵； 死魂受炼，九玄升化以更生。 臣等获际真诠，早传秘箓。 所宜沐玄波於仙井，涤虑澄心； 庇道荫於灵柯，归根复命。 虽尚关於人事，敢轻负於道心。 伏受师盟，担敷教化。 况承词剡，恭为典行。 今念及孤魂滞魄，自从宿世，乃至今身。 举意动情，故为误犯。 未能温恭思道，谦牧修身。 或奉正真，每兴怀於傲忽； 或居高位，常肆志於满盈。 或慢侮以凌人，或矜夸而恃己。 执迷凶德，恣纵骄心。 大乖推逊之风，有愧得真之戒。 恐从倾逝，未卜升沉。 又虑亿劫轮回，夙生流荡。 魂灵飘浪，未返故根。 性识昏迷，尚拘邪党。 念沉沦於苦趣，未脱离於重阴。 仰祈开宥之恩，早遂更生之愿。 伏愿造大慈之至化，济长夜之幽魂。 恶根应消，浮爽缘故。 随所受度，咸得升仙。 乞召五老之灵君，仍命九天之上帝。 及启三光九老，太上丈人、一千二百官君、百千万重道炁、朱陵火府南昌上宫好生韩君、度世司马元阳玉匮受度使者、延寿益算度厄尊神、校录真人、监生圣母、无英公子、白元尊神。 桃康合延太乙司命，上祈神仪，九玄七祖，恭诺和顺。 侍卫送迎，反炁受形，勒籍定算。 布祥烟而塞死户，流庆云以开生门。 经集灵根，圆成善果。 则上明天尊大慈之化，下副臣等皈命之诚。 谨启以闻。 一愿龙篇高映，二愿凤检呈祥， 三愿诸天校录，四愿仙乐铿锵， 五愿三官注善，六愿九夜披光， 七愿和冤闭债，八愿解结除殃， 九愿制魔保举，十愿魂度仙乡， 十一愿恩光普被， 十二愿功德难量。 复炉同早朝 玉箓大斋第三日午朝仪竟",
      "translated_text": "The Threefold Prostration. Again invoking the sacred ranks, we, the assembled officiants and altar attendants, with utmost sincerity jointly address the Three Pure Ones Most High, the Ten Directions’ Sagely Hosts, the Heavenly Perfected of Jade Capital and Golden Towers, the Ten Directions’ Venerable Masters and Holy Assemblies, the officials and spirits of the Three Realms, and all majestic numina.\n\nWe have heard that when the dark night parts to reveal light, eight transgressions are purified through earnest recitation; when the dead souls undergo refinement, the Nine Mysteries ascend and transform to be reborn. We have been fortunate to encounter the true canon and early receive the secret registers. Thus we ought to bathe in the mystic waves of the immortal well, cleansing thoughts and clarifying the mind; to shelter beneath the sacred boughs of the numinous tree, returning to the root and restoring life’s mandate. Though still bound by worldly affairs, how dare we slight the heart of the Dao?\n\nHaving received the masters’ covenant, we bear the duty of spreading the teachings. Moreover, entrusted with these sacred words, we reverently perform this ritual. Now we turn our thoughts to the wandering souls and lingering spirits, from past lives to the present incarnation. In every intention and emotion, they have erred and transgressed. Unable to cultivate warmth and reverence for the Dao, or humility in self-cultivation, they may have served the true and authentic yet harbored arrogance and neglect; or occupied high positions yet indulged in pride and excess. Some have bullied others with contempt, some boasted and relied on their own strength. Clinging to vicious traits and indulging haughty hearts, they have greatly deviated from the virtue of yielding and modesty, shaming the precepts of attaining the true.\n\nWe fear that upon their passing, their ascent or descent remains uncertain. We worry that through countless kalpas of rebirth, they drift from life to life, their souls adrift like waves, unable to return to their original root; their nature and consciousness benighted, still bound to perverse factions. Mired in the realms of suffering, they have not escaped the heavy yin. We beseech the grace of pardon, that they may soon fulfill their wish for rebirth.\n\nMay the supreme transformation of great compassion deliver the souls lost in the long night. May evil roots be dissolved, and transient spirits return to their origins. As they receive deliverance, may all ascend as immortals. We entreat the Five Venerable Lords of the Numinous, and command the Nine Heavens’ Emperors. We invoke the Three Luminaries and Nine Venerables, the Most High Elder, the Twelve Hundred Official Lords, the myriad layers of Dao-qi, the Benevolent Lord Han of the Southern Palace of the Vermilion Mound Fire Treasury, the Jade Casket Receiver of Deliverance Envoy Sima Yuanyang, the Life-Prolonging and Fate-Improving Deliverer from Tribulation, the Registrar Perfected, the Life-Monitoring Holy Mother, the Lord of Non-Duality, the White Prime Spirit.\n\nTogether with the Life-Extending and Health-Uniting Great Unity Lord of Destiny, we supplicate the divine presence. May the Nine Mysteries and Seven Ancestors respond with harmony and compliance. May they be escorted and welcomed, receive form through returning qi, and have their names inscribed and lifespans determined. May auspicious smoke block the gates of death and propitious clouds open the doors of life. May the roots of the numinous be gathered, and good fruits be perfected. Thus shall the transformation of the Most High Heavenly Worthy’s great compassion be made manifest above, and our devotion in taking refuge be answered below.\n\nWe reverently announce:\n\nFirst, may the dragon-script shine resplendently;\nSecond, may the phoenix-tallies present auspicious signs;\nThird, may the heavens’ registrars record all;\nFourth, may the immortal music resound;\nFifth, may the Three Officials inscribe good deeds;\nSixth, may the Nine Nights be suffused with light;\nSeventh, may grievances be harmonized and debts closed;\nEighth, may knots be untied and calamities removed;\nNinth, may demons be subdued and merits secured;\nTenth, may souls be delivered to the immortal realms;\nEleventh, may the grace of enlightenment spread universally;\nTwelfth, may the merit and power be immeasurable.\n\nThe incense is replenished, and the morning audience concludes.\nThe third-day noon audience of the Jade Register Grand Retreat is now complete.",
      "overlap_context": " May their hearts scatter above the layered heavens, and their qi congeal within the flowery palaces. May they unfasten their robes and loosen their sashes, free in coming and going. May they fly and wander at will, responding to stimuli without limit.\n\nFor this purpose we now burn incense, from our refuge in the virtue of the masters, the venerable sagely hosts, and the perfected, that after attaining the Dao, they may ascend into the formless.\n\nRepentance:\nWe now make the Threefold Invocation.",
      "start_char": 13983,
      "end_char": 14672,
      "start_sentence": 891,
      "end_sentence": 935,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.97633457183838,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓大斋三日九朝仪.txt",
        "category": "威仪类"
      }
    }
  ]
}