{
  "source_id": "玉箓济幽判斛仪",
  "source_file": "chunked_daozang\\玉箓济幽判斛仪.json",
  "total_chunks": 4,
  "total_original_chars": 3168,
  "total_translated_chars": 19447,
  "total_translation_time": 103.34157061576843,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓济幽判斛仪.txt",
    "category": "威仪类"
  },
  "full_translation": "*The Jade Register Rite for Delivering the Suffering and Judging the Obscure*\n\n**Sutra Title:** *Jade Register Rite for Delivering the Suffering and Judging the Obscure*. One fascicle. Source text from the *Zhengtong Daoist Canon*, Dongxuan Section, Wei Yi Category.\n\n**Ritual of the Jade Register for Delivering the Suffering and Judging the Obscure**\n\n**Invocation of the Deities**\nWe, your humble servants in office, together with utmost sincerity, reverently invoke and supplicate the Three Pure Ones of the Three Realms, the Ten Loftiest and Ten Radiant Supreme Saints, the Most Compassionate Great Unity Savior of Suffering Heavenly Worthy of the Eastern Ultimate Palace, the Azure Sovereign of the Blue Empyrean, the Heavenly Worthies of all Heavens, the Heavenly Emperors of all Heavens, the Supreme Perfected Immortals of the Great Luo Dharma Realm, and all true lords of the Three Realms and the myriad spirits.\n\nMay your celestial compassion turn and illumine us with your luminous gaze.\n\n**Declaration of Intent**\nWe humbly submit: the waxing and waning of the primordial qi gives rise to the emergence and submergence of the myriad forms. Death returns to life, and life returns to death; humans become ghosts, and ghosts become humans. The wheel turns endlessly, and retribution ceases not. There is no sorrow greater than that of the Six Paths, no suffering more bitter than that of the Four Births. Those who accumulate goodness ascend directly the steps of virtue; those who accumulate evil ultimately return to the evil destinies.\n\nBy the grace of our Dao Ancestor, the Most High Compassionate Venerable, vast ritual ordinances have been established, and universal deliverance has been widely bestowed. Great assemblies for transcendence and ascent have been inaugurated, and special salvific scriptures have been revealed. At the juncture when yin is grim and yang expansive, when spirits commune and ghosts gather, the stirring of ethereal qi gives rise to mournful winds, and the issuing of numinous sounds causes the affairs of the netherworld to mist over. At the first resonant intonation, the dark earth afar hears it.\n\nWe look up to the Purple Ultimate Mystic Venerable and the Azure Radiance Patriarch. They designate the Bright Star as the torch of wisdom, widely extending its illumination; they condense the qi of Brahman into a dharma bridge, greatly bestowing deliverance. The messengers who pursue souls proclaim the summons to the ten directions. The local earth deities are charged with hastening and urging them forth.\n\nMay the paths of the Heavenly Immortals, the Divine Spirits, the Human Relations, the Hell Dwellers, the Hungry Ghosts, and the Animal Beings, along with all living creatures—fish, turtles, insects, and crawling things—be universally informed in the blink of an eye, their high and deep realms pervaded, their distant and near reaches encompassed in an instant. Thus, all come to know, their minds naturally moved; their sincerity and reverence stirred, their shadows follow and their echoes respond. Calling the many and leading the masses, voices resonate and qi seeks its kind. Emerging from death and entering life, the blind see and the lame walk. Unobstructed and unimpeded, they come forth in an unbroken stream; some lagging, some leading, they arrive in measured pace. The messengers exert their power of summoning, and the souls, in turn, receive the merit of the call.\n\nAll the pure incantations of Fengdu, the Path of Karmic Deeds, and the Departure from the Cold Court shall be reverently chanted.\n\nThose who study the Dao and cultivate perfection take compassion for all beings as their heart; those who accumulate merit and amass virtuous deeds take benefiting and delivering the myriad beings as their foundation. They often perform scriptural rites for salvation and constantly engage in recitation and devotion to cultivate reverence. Through the grace of the dharma, they necessarily hope for the response of the sages.\n\nOn this day of fasting and purification, we have summoned companions of refined cultivation to establish this wondrous assembly of merit and offer fragrant viands in worship. We humbly act on behalf of the obscured souls yet to receive extraordinary grace, still entangled in the obstacles of sin, and unable to escape the wheel of suffering. Mindful of their embodied existence, we set forth this offering of food.\n\nWe look up to the Earth Deities of the Nine Provinces and the Divine Officials of the Five Peaks, beseeching them to deign to bear witness and extend their compassionate pity.\n\nWe reverently pray that, gazing afar toward the immortal palaces, we may supplicate the August Emperor of the Void Heavens, that he may greatly extend celestial grace and bend to bestow compassionate regard. Throughout the expanse within heaven and earth, we broadly invite those from ancient times to the present. By the power of your majestic radiance, we specially present this petition for summoning and reception.\n\n**Summoning the Lonely and Receiving the Lost**\n\n**Purifying Forms, Sprinkling Purity, Taking the Three Refuges**\n\nThus do the hungry ghosts of the dark paths and the sunken souls of the eternal night fill the empty void, wandering through the realms of the earth. Ever they sigh in the crooked ways, their faces forever gaunt with hunger. There are also those long-dead corpses buried for kalpas, their lingering spirits bound for years—now dim, now bright between dawn and dusk, their forms ever defiled and foul. They have not yet transcended the gate of liberation, still entangled in the mire of suffering. Some were torn from parents in swaddling clothes, others parted forever from children in old age; some perished in the throes of illness, others met their end as travelers in distant lands; some bore the weight of crimes and fell to royal law, others were suddenly claimed by impermanence; some succumbed to pestilence, others were struck down by thunder; some were murdered, others hanged themselves; some were mauled by tigers in the mountains, others devoured by fish and dragons in the rivers; some died in childbirth, others from snakebite or poison; some languish in the dark paths with long-held grievances, others, wrongfully slain, have not escaped the ghostly realm.\n\nThough they yearn for libations, they never meet with food or drink. Smoke rises from their bellies, fire blazes in their throats. Forever they endure the torment of hunger and want, never finding satiety. In vain they grieve as hares run and crows fly, as time passes and years turn in darkness. Separated from their homes and towns, they long for kin yet cannot find them; cut off by mist and waves, they sigh for loved ones beyond reach. All belong to the jurisdiction of their native lands, yet have no graves to call their own. The bright moon stretches endlessly, sorrowful clouds spread boundlessly.\n\nAll lonely souls, all bound spirits—none have found the path to ascension, their hearts still entangled in affliction. They lament the wheel of the six destinies, mourn the flight and scurry of the four births. All day their bodies are trapped in snares, all morning their gall trembles at the net. Some fold their wings and tuck their feathers in forest nests; some, with fangs and fur, dwell in earthen dens; some, with horns and hooves, roam the marshes; others, with scales and armor, lurk in pools and deeps. Facing cauldrons, how can they escape the boil? Confronting blades, how can they flee the torment?\n\nAll this is the result of past misdeeds, the consequence of accumulated evil. There are one hundred and twenty underworld courts, eighty-four thousand hells, the prisons of the Three Officials, the grievance-cells of the Five Peaks. The Northern Capital’s eternal-night court, the Eastern Peak’s dark-locked palace. The Upper Corpse, Middle Corpse, and Lower Corpse—realms of the Three Paths; the paths of death, evil, and crookedness—gates of the Five Sufferings. Then there are the hells of iron houses and iron mountains, iron oxen and iron horses, two stones crushing the body, the Eight Cold Hells of the Eight Extremes, the hells of severance and separation, of scorching and flaying. In such great hells as these, for kalpas upon kalpas, life after life, there is no door to escape death, no path to seek rebirth. The knife-mountains loom perilously, the sword-trees stand in dense array. They eat fire and swallow smoke, never free from searing torment day or night; flying spears and drifting halberds rend their flesh, how can they bear such agony? They have not yet left the path of carrying stones, yet deeply suffer the toil of bearing mountains. Upon the vast river of love, black waves engulf them; in the deep sea of suffering, silver waves fill their eyes. In vain they yearn for the flourishing world, how pitiable their solitude in the Yellow Springs.\n\nAll this stems from the reckless hearts of past lives, bringing such retribution upon their present forms. We now convene this assembly of incense and cultivation, offering this rite of reverence. We humbly pray that the Supreme Dao extend its compassion, that the exalted immortals open the way to deliverance. May even the prison cells and river sources be reached, all attaining spiritual resonance and looking up to salvation. By the sacred names inscribed in jade caskets, the august titles proclaimed from divine scrolls—those who have never heard the Heavenly Worthy may now hear; those who have never encountered the sacred name of the Heavenly Worthy may now encounter it. By this merit, they may transcend the ghostly path, and through these offerings, ascend the immortal ranks.\n\nLet all now take refuge and listen attentively:\n\n**Great Compassion, Boundless Heavenly Worthy,**\n**Sacred Power, Limitless Heavenly Worthy,**\n**Dispeller of Evil Realms, Heavenly Worthy,**\n**Attainer of Mystic Merit, Heavenly Worthy,**\n**Refining the Dead, Heavenly Worthy,**\n**Secretly Communing with the Immortal Dao, Heavenly Worthy,**\n**Dissolving Sins in the Northern Palace, Heavenly Worthy,**\n**Inscribing Names in the Southern Palace, Heavenly Worthy,**\n**Radiant Mystic Dao, Heavenly Worthy,**\n**Ascending the Great Void, Heavenly Worthy.**\n\nWe reverently invoke your sacred power, your vast compassion that delivers all. Thus may the river of love and sea of suffering transform into a lotus pond; may sword-trees and knife-mountains become flower gardens. The icy pools, once bitterly cold, swiftly melt away; the boiling cauldrons, once seething, are instantly extinguished. We rely on the wondrous creation of the Primordial Mystery, the good affinity of virtue and power.\n\nNow the lamps and candles are lit, their brilliance illuminating the underworld; sandalwood and aloes are kindled, their fragrant smoke rising and spreading through the ten directions. To emerge from the depths, they must rely on great creation. We offer them food and drink, present them with money and treasures. We beseech the Four Departments and Six Palaces to record good deeds and erase evil; the Three Origins and Nine Courts, the yin officials and yang administrators, to look upon sentient beings with compassion and broadly bestow salvation. Above, we pray for sagely grace; below, we spread numinous mercy. May a single taste become a hundred delicacies, a single coin become a thousand carts of treasure. May it reach all infinite worlds, showering boundless ghosts and spirits.\n\nWe humbly hope you will descend in bodily form and partake of these offerings. Thus may their hollow bellies be filled, their starving stomachs satisfied. Let each turn their body and mind, swiftly directing their merit. By past affinities and former kalpas, they receive the aid of the true wind; on this night, at this hour, they savor the sweet dew of fragrant offerings. Secretly we sprinkle the rain of compassion, washing away stains; broadly we blow the wind of liberation, sweeping away transgressions. May all rejoice, receiving blessings in the human and heavenly realms. Having attained spiritual resonance, may they proceed to their proper destinies.\n\nWe now recite the **Spiritual Incantation for Transforming Food**.\n\n**Burn the talisman. Transform the food.**\n\n**Incantation for Food, Empowerment, and Invocation of Names**\n\nThe Dao declares: \"Precepts\" mean cessation—ceasing the mind’s transgressions to return to true stillness. Thus precepts give rise to samādhi. The Confucians also say, \"Knowing cessation, one attains stillness.\" Yet the Three Caverns’ scriptures and the Four Auxiliary secret canons expound precepts in myriad forms. Among them, the **Supreme Cavernous Mystery Numinous Treasure Ninefold Wondrous Precepts** stand as the foremost of all precepts. Revered by heaven and humankind, observed by both the hidden and manifest realms, they are the supreme above the supreme, the cavernous within the cavernous, the numinous of myriad spirits, the treasure of primordial qi. Wondrously pervading the Three Realms, they restrain the six emotions. Their number fixed by yang, they are divided into nine. Cultivated without falsity, they are called \"true.\" Heaven and humankind look to them as ramparts; the hidden and manifest rely on them as ladders and boats. Today, the departed souls receive them as the flower of the Dharma.\n\nThe method of receiving precepts begins with stillness and silence; the method of upholding them prizes diligent observance. With the assembly united in sincerity, we now transmit the Nine Precepts.\n\n**Recite the Wisdom Hymn**\n\nThe **First Precept** is reverence and deference, filial piety and care for parents—this is the **Initial Truth Precept**. After receiving and upholding it, one attains the fruit of uprightness and longevity. Hold fast to the mind without negligence.\n\nThe **Second Precept** is diligence and devotion, loyalty to one’s lord—this is the **Mindful Truth Precept**. After receiving and upholding it, one attains the fruit of wisdom and sagacity. Hold fast to the mind without negligence.\n\nThe **Third Precept** is not killing, compassionate rescue of all beings—this is the **Upholding Truth Precept**. After receiving and upholding it, one attains the fruit of wealth, nobility, and excellence. Hold fast to the mind without negligence.\n\nThe **Fourth Precept** is not engaging in licentiousness, rectifying the body amid all things—this is the **Guarding Truth Precept**. After receiving and upholding it, one attains the fruit of auspiciousness and peace. Hold fast to the mind without negligence.\n\nThe **Fifth Precept** is not stealing, extending righteousness at one’s own expense—this is the **Preserving Truth Precept**. After receiving and upholding it, one attains the fruit of purity and good nature. Hold fast to the mind without negligence.\n\nThe **Sixth Precept** is not harboring wrath, refraining from cruelty and aggression—this is the **Cultivating Truth Precept**. After receiving and upholding it, one attains the fruit of illustrious rank and clarity. Hold fast to the mind without negligence.\n\nThe **Seventh Precept** is not being arrogant, avoiding disdain for the utmost truth—this is the **Attaining Truth Precept**. After receiving and upholding it, one attains the fruit of perfecting the ten virtues. Hold fast to the mind without negligence.\n\nThe **Eighth Precept** is not being deceitful, refraining from flattery, treachery, and harming the good—this is the **Perfecting Truth Precept**. After receiving and upholding it, one attains the fruit of the Great Dao’s true Dharma. Hold fast to the mind without negligence.\n\nThe **Ninth Precept** is not being dual-minded, upholding the precepts with single-minded devotion—this is the **Ascending Truth Precept**. After receiving and upholding it, one attains the fruit of realizing the Great Dharma King. Hold fast to the mind without negligence.\n\n**Recite the Precept-Receiving Hymn**\n\nThe wondrous precept scripture, inscribed on yellow registers and white tablets, having fully proclaimed its profound essence, is now reverently received in its numinous text. The mind is hard to restrain; restrained by the Nine Precepts, it may return to the Great Void. The form has not yet transcended; transcended by the Two Talismans, it may refine itself in the upper realms. You, the lonely souls, must in every life remember the precept words, in every kalpa uphold the talismanic covenant. Clarify the spirit beyond the material world, severing worldly ties across many lives. Receiving form in the yang realm, good fruits will naturally accrue in perpetuity. Grace lingers in families and nations, blessings extending without end.\n\nAll **Registers of Longevity** and **Merit Memorials** shall now be solemnly proclaimed.\n\n**Concluding Offerings and Refinement**\n\nAs our prayers draw to a close and offerings are complete, we linger in concern, for the realms of darkness and light remain divided. Now the silver river of dim clouds stirs, the bronze clepsydra’s *ding-ding* nears its end. The sky’s gate at Ox and Dipper darkens beneath gloomy clouds; the moon’s palace is locked in deep mist. Rainclouds stand silent as the *gong*-tuned simurgh dances; stone swallows soar in the murk. Snow adorns the jade trees with a hushed rustle; silently, jade-like petals drift onto the steps. Each prepares their cloud chariot, ascending together to the celestial river.\n\nThe Way of Heaven returns to the Way of Heaven; the spirits each resume their divine offices. Humans dwell within the Three Realms; ghosts govern the Nine Dark Prisons. May all hungry souls, starving ghosts, and denizens of hellish dungeons ascend and be delivered, sharing in these benefits. Transform the celestial kitchens’ refined offerings, convert the worldly wealth. All is for beseeching grace, none fails to bring blessing.\n\nHaving led this fragrant fast and received these presented rites, they came in due order and now depart in spiraling flight. Having gained form in the immortal courts, they shall surely tread upon auspicious clouds, hastening to the **Palace of Numinous Response**, swiftly arriving at the **Realm of Carefree Wandering**. Above, they traverse the clouds’ wings; below, they reach the abyss’s scales. Having received good causes, they hear wondrous music. Universally aided by this offering, they together achieve transcendence.\n\nBeyond the remnants of food and offerings, may the flocks of wild birds in the open fields have their hunger sated; may the herds of beasts in the deep plains fill their bellies. Should they encounter the twang of bowstrings or the flight of arrows, may they forever escape harm. If they meet nets or spears, may they suffer no injury. May they swiftly cast off evil destinies and swiftly realize good affinities.\n\nWe humbly extend this merit to all beings, slightly exhausting the weight of our faithful hearts. Bowing our heads to the starry river, prostrating before the celestial steps, the assembly of ritual officers now respectfully sends them forth.\n\nJade tones and immortal music chime; cranes dance and phoenixes soar past the Nine Gates. Holding registers and grasping talismans, they transcend the Dharma realms, attending court at the Golden Palace to behold the Heavenly Countenance.\n\n**Recite the Hymn of Utmost Bliss to Send Forth**\n\nThus concludes the rite.\n\nThe Rite of Fumigation and Offering, with Jade Registers to Deliver the Hidden and Judge the Measured, is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "玉箓济幽判斛仪 经名：玉箓济幽判斛仪。 一卷。 底本出处：《正统道藏》洞玄部威仪类。 玉箓济幽判斛仪 法事 具位臣某等，谨同诚上启三清三境天尊，十极十华上圣，东极宫中慈悲太乙救苦天尊、青玄上帝，诸天天尊，诸天天帝，大罗法界无上真仙，三界万灵一切真宰。 恭望天慈，洞回昭鉴。 通意 伏以一炁盈虚，万形出没。 死复生而生复死，人为鬼而鬼为人。 轮转无穷，报偿不息。 悲莫悲於六道，苦犹苦於四生。 盖积善者，径陟善阶； 积恶者，终归恶道。 赖我道祖，太上慈尊。 广立斋科，普敷济拔。 大启超升之会，特垂拯救之文。 当阴惨阳舒之际，乃神交鬼聚之时。 魂气动而悲风生，灵响发而阴务霭。 洪音一举，黑壤遥闻。 仰惟紫极玄尊、青华教父。 指明星为慧炬，广运照临； 凝梵炁作法桥，大垂拯济。 追魂使者，告召十方。 所属地祇，招延催促。 当愿天仙道、神祇道、人伦道、地狱道，饿鬼道、畜生道，孳生物命。 鱼鳖昆虫，不瞬息间，遍高深而普告，由斯须顷周遐。 迩以咸知，自然意感； 诚服翕尔，影随响答。 呼群率众，声相应，气相求； 出死入生，眇能视，跛能履。 无遮无碍，源源而来； 或后或先，徐徐而至。 使者运招徕之力，魂兮承摄召之功。 所有净酆都、开业道、离寒庭神咒，谨当吟咏。 夫学道修真之士，以慈悲一切而为心； 积功累行之流，以利济万汇而为本。 每演经科而救度，常行运念以修崇。 用假法恩，必希圣感。 谨当斋戒之辰，爰命精修之侣。 建资崇之妙会，设供养之香馐。 伏为所荐幽魂，未沾殊胜。 尚萦罪障，难出苦轮。 念其受身，为兹设食。 仰惟九州社令、五岳灵官，俯赐证明，曲垂慈愍。 恭愿遥瞻仙府，上启虚皇上帝，大轸天恩，曲垂悯念。 当启乾坤之内，广邀今古以来。 是仗威光，特伸关请。 召孤 接引",
      "translated_text": "*The Jade Register Rite for Delivering the Suffering and Judging the Obscure*\n\n**Sutra Title:** *Jade Register Rite for Delivering the Suffering and Judging the Obscure*. One fascicle. Source text from the *Zhengtong Daoist Canon*, Dongxuan Section, Wei Yi Category.\n\n**Ritual of the Jade Register for Delivering the Suffering and Judging the Obscure**\n\n**Invocation of the Deities**\nWe, your humble servants in office, together with utmost sincerity, reverently invoke and supplicate the Three Pure Ones of the Three Realms, the Ten Loftiest and Ten Radiant Supreme Saints, the Most Compassionate Great Unity Savior of Suffering Heavenly Worthy of the Eastern Ultimate Palace, the Azure Sovereign of the Blue Empyrean, the Heavenly Worthies of all Heavens, the Heavenly Emperors of all Heavens, the Supreme Perfected Immortals of the Great Luo Dharma Realm, and all true lords of the Three Realms and the myriad spirits.\n\nMay your celestial compassion turn and illumine us with your luminous gaze.\n\n**Declaration of Intent**\nWe humbly submit: the waxing and waning of the primordial qi gives rise to the emergence and submergence of the myriad forms. Death returns to life, and life returns to death; humans become ghosts, and ghosts become humans. The wheel turns endlessly, and retribution ceases not. There is no sorrow greater than that of the Six Paths, no suffering more bitter than that of the Four Births. Those who accumulate goodness ascend directly the steps of virtue; those who accumulate evil ultimately return to the evil destinies.\n\nBy the grace of our Dao Ancestor, the Most High Compassionate Venerable, vast ritual ordinances have been established, and universal deliverance has been widely bestowed. Great assemblies for transcendence and ascent have been inaugurated, and special salvific scriptures have been revealed. At the juncture when yin is grim and yang expansive, when spirits commune and ghosts gather, the stirring of ethereal qi gives rise to mournful winds, and the issuing of numinous sounds causes the affairs of the netherworld to mist over. At the first resonant intonation, the dark earth afar hears it.\n\nWe look up to the Purple Ultimate Mystic Venerable and the Azure Radiance Patriarch. They designate the Bright Star as the torch of wisdom, widely extending its illumination; they condense the qi of Brahman into a dharma bridge, greatly bestowing deliverance. The messengers who pursue souls proclaim the summons to the ten directions. The local earth deities are charged with hastening and urging them forth.\n\nMay the paths of the Heavenly Immortals, the Divine Spirits, the Human Relations, the Hell Dwellers, the Hungry Ghosts, and the Animal Beings, along with all living creatures—fish, turtles, insects, and crawling things—be universally informed in the blink of an eye, their high and deep realms pervaded, their distant and near reaches encompassed in an instant. Thus, all come to know, their minds naturally moved; their sincerity and reverence stirred, their shadows follow and their echoes respond. Calling the many and leading the masses, voices resonate and qi seeks its kind. Emerging from death and entering life, the blind see and the lame walk. Unobstructed and unimpeded, they come forth in an unbroken stream; some lagging, some leading, they arrive in measured pace. The messengers exert their power of summoning, and the souls, in turn, receive the merit of the call.\n\nAll the pure incantations of Fengdu, the Path of Karmic Deeds, and the Departure from the Cold Court shall be reverently chanted.\n\nThose who study the Dao and cultivate perfection take compassion for all beings as their heart; those who accumulate merit and amass virtuous deeds take benefiting and delivering the myriad beings as their foundation. They often perform scriptural rites for salvation and constantly engage in recitation and devotion to cultivate reverence. Through the grace of the dharma, they necessarily hope for the response of the sages.\n\nOn this day of fasting and purification, we have summoned companions of refined cultivation to establish this wondrous assembly of merit and offer fragrant viands in worship. We humbly act on behalf of the obscured souls yet to receive extraordinary grace, still entangled in the obstacles of sin, and unable to escape the wheel of suffering. Mindful of their embodied existence, we set forth this offering of food.\n\nWe look up to the Earth Deities of the Nine Provinces and the Divine Officials of the Five Peaks, beseeching them to deign to bear witness and extend their compassionate pity.\n\nWe reverently pray that, gazing afar toward the immortal palaces, we may supplicate the August Emperor of the Void Heavens, that he may greatly extend celestial grace and bend to bestow compassionate regard. Throughout the expanse within heaven and earth, we broadly invite those from ancient times to the present. By the power of your majestic radiance, we specially present this petition for summoning and reception.\n\n**Summoning the Lonely and Receiving the Lost**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 710,
      "start_sentence": 0,
      "end_sentence": 50,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.774086475372314,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓济幽判斛仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "荡形 洒净 三皈 切以幽途饿鬼，长夜沉魂。 遍满虚空，游行境土。 但吁嗟於邪道，常憔悴於歉容。 复有积劫伏尸，累年滞爽。 既昏明於旦暮，常秽浊於形骸。 未超解脱之门，尚绊湮沉之类。 或襁褓相离父母，或老耄永别子孙，或居民在此膏肓，或征客至兹沦丧，或负罪有遭王法，或无常遽奄天年，或萦缠疫疠而倾亡，或凌犯雷霆而震怒，或损害相谋性命，或刎缢自丧平生，或山林虎狼伤残，或江海鱼龙吞噬，或男敌女娠而至死，或蛇伤饮毒而陨亡，或衔冤久处於冥途，或枉死未离於鬼趣。 虽思奠酹，莫遇肴羞。 心腹烟生，喉咙火发。 永抱饥穷之苦，不逢饱饫之充。 空悲兔走乌飞，暗历时迁岁改。 睽离井邑，想骨肉以难寻； 隔越烟波，叹胸襟而莫及。 皆属里域所摄，更无坟冢堪依。 明月茫茫，愁云漠漠。 一切孤魂，无极滞魄。 未遂冲升之路，犹萦烦恼之心。 念六趣之轮回，悲四生之飞走。 永日而身遭笼挚，终朝而胆慑网罗。 或戢翎敛翅於林巢，或含齿披毛於土窟，或带角跨蹄於草泽，或张鳞披甲於波潭。 顾鼎镬则焉免其烹，临锋铓则岂逃斯惨。 悉是余殃致此，盖由积恶使然。 当有一百二十冥曹、八万四千地府，三官狱讼。 五岳冤牢。 北都长夜之庭，东岳幽扃之府。 上尸、中尸、下尸，三涂之界； 死道、恶道、邪道，五苦之门。 次有铁屋铁山地狱、铁牛铁马地狱、两石压身地狱、八极八寒地狱、断绝分离地狱、燋然脱落地狱，如是诸大地狱等，当来世世，劫劫生生。 出死无门，求生无路，刀山险峻，剑树森罗。 食火吞烟，不舍焦熬於晓夕； 飞戈飘戟，那堪痛楚於肌肤。 未离摙石之涂，深苦负山之役。 荡荡爱河之上，黑浪迷身； 沉沉苦海之中，银波溢目。 空感茫茫於丰蔀，可悲寂寂於泉台。 尽从过去狂心，以致此来报体。 特启熏修之会，爰伸供养之仪。 伏愿至道垂慈，高真开度。 俾令狸犴，旁及河源。 咸获感通，仰承拯拔。 仗琅函之圣号，宣琼藏之睿名。 未曾闻天尊者，今皆得闻； 未遇天尊圣号者，今皆得遇。 功力能超於鬼道，荐修可陟於仙阶。 各发皈依，众当谛听。 大慈至广天尊， 圣力无边天尊， 能消恶趣天尊， 得契玄功天尊， 死魂受炼天尊， 仙道潜通天尊， 罪消北府天尊， 名上南宫天尊， 昭彰妙道天尊， 飞升太空天尊， 恭惟圣力昭彰，洪慈轸度。 遂使爱河苦海，化作莲池，能令剑树刀山，翻成花圃。 冰池凛冽，俄自消洋。 沸镬烹煎，遽皆扑灭。 赖玄元之殊造，繄道德之良缘。 於是灯烛将然，灿烂而照开地府； 沉檀乍爇，氤氲而腾布十方。 欲出重泉，须凭大造。 馈其饮食，献以钱财。 伏觊四司六宫，善簿恶籍； 三元九府，阴宰阳官。 俯念有情，广施济物。 上祈睿泽，下布灵慈。 变一味为百品之珍，化一财为千车之宝。 普及无穷之世界，散沾无极之鬼魂。 仰希齐降形仪，当歆祭享。 遂使虚肠顿实，能令馁腹皆充。 各运身心，速伸回向。 夙缘曩劫，承资荐於真风； 是夜今时，味馨香於甘露。 密洒慈悲之雨，洗涤瑕疵； 广吹解脱之风，扫除罪累。 普生欢悦，受福人天。 克遂感通，仍归迁适。 变食灵章，谨当吟咏。 焚符 变食",
      "translated_text": "**Purifying Forms, Sprinkling Purity, Taking the Three Refuges**\n\nThus do the hungry ghosts of the dark paths and the sunken souls of the eternal night fill the empty void, wandering through the realms of the earth. Ever they sigh in the crooked ways, their faces forever gaunt with hunger. There are also those long-dead corpses buried for kalpas, their lingering spirits bound for years—now dim, now bright between dawn and dusk, their forms ever defiled and foul. They have not yet transcended the gate of liberation, still entangled in the mire of suffering. Some were torn from parents in swaddling clothes, others parted forever from children in old age; some perished in the throes of illness, others met their end as travelers in distant lands; some bore the weight of crimes and fell to royal law, others were suddenly claimed by impermanence; some succumbed to pestilence, others were struck down by thunder; some were murdered, others hanged themselves; some were mauled by tigers in the mountains, others devoured by fish and dragons in the rivers; some died in childbirth, others from snakebite or poison; some languish in the dark paths with long-held grievances, others, wrongfully slain, have not escaped the ghostly realm.\n\nThough they yearn for libations, they never meet with food or drink. Smoke rises from their bellies, fire blazes in their throats. Forever they endure the torment of hunger and want, never finding satiety. In vain they grieve as hares run and crows fly, as time passes and years turn in darkness. Separated from their homes and towns, they long for kin yet cannot find them; cut off by mist and waves, they sigh for loved ones beyond reach. All belong to the jurisdiction of their native lands, yet have no graves to call their own. The bright moon stretches endlessly, sorrowful clouds spread boundlessly.\n\nAll lonely souls, all bound spirits—none have found the path to ascension, their hearts still entangled in affliction. They lament the wheel of the six destinies, mourn the flight and scurry of the four births. All day their bodies are trapped in snares, all morning their gall trembles at the net. Some fold their wings and tuck their feathers in forest nests; some, with fangs and fur, dwell in earthen dens; some, with horns and hooves, roam the marshes; others, with scales and armor, lurk in pools and deeps. Facing cauldrons, how can they escape the boil? Confronting blades, how can they flee the torment?\n\nAll this is the result of past misdeeds, the consequence of accumulated evil. There are one hundred and twenty underworld courts, eighty-four thousand hells, the prisons of the Three Officials, the grievance-cells of the Five Peaks. The Northern Capital’s eternal-night court, the Eastern Peak’s dark-locked palace. The Upper Corpse, Middle Corpse, and Lower Corpse—realms of the Three Paths; the paths of death, evil, and crookedness—gates of the Five Sufferings. Then there are the hells of iron houses and iron mountains, iron oxen and iron horses, two stones crushing the body, the Eight Cold Hells of the Eight Extremes, the hells of severance and separation, of scorching and flaying. In such great hells as these, for kalpas upon kalpas, life after life, there is no door to escape death, no path to seek rebirth. The knife-mountains loom perilously, the sword-trees stand in dense array. They eat fire and swallow smoke, never free from searing torment day or night; flying spears and drifting halberds rend their flesh, how can they bear such agony? They have not yet left the path of carrying stones, yet deeply suffer the toil of bearing mountains. Upon the vast river of love, black waves engulf them; in the deep sea of suffering, silver waves fill their eyes. In vain they yearn for the flourishing world, how pitiable their solitude in the Yellow Springs.\n\nAll this stems from the reckless hearts of past lives, bringing such retribution upon their present forms. We now convene this assembly of incense and cultivation, offering this rite of reverence. We humbly pray that the Supreme Dao extend its compassion, that the exalted immortals open the way to deliverance. May even the prison cells and river sources be reached, all attaining spiritual resonance and looking up to salvation. By the sacred names inscribed in jade caskets, the august titles proclaimed from divine scrolls—those who have never heard the Heavenly Worthy may now hear; those who have never encountered the sacred name of the Heavenly Worthy may now encounter it. By this merit, they may transcend the ghostly path, and through these offerings, ascend the immortal ranks.\n\nLet all now take refuge and listen attentively:\n\n**Great Compassion, Boundless Heavenly Worthy,**\n**Sacred Power, Limitless Heavenly Worthy,**\n**Dispeller of Evil Realms, Heavenly Worthy,**\n**Attainer of Mystic Merit, Heavenly Worthy,**\n**Refining the Dead, Heavenly Worthy,**\n**Secretly Communing with the Immortal Dao, Heavenly Worthy,**\n**Dissolving Sins in the Northern Palace, Heavenly Worthy,**\n**Inscribing Names in the Southern Palace, Heavenly Worthy,**\n**Radiant Mystic Dao, Heavenly Worthy,**\n**Ascending the Great Void, Heavenly Worthy.**\n\nWe reverently invoke your sacred power, your vast compassion that delivers all. Thus may the river of love and sea of suffering transform into a lotus pond; may sword-trees and knife-mountains become flower gardens. The icy pools, once bitterly cold, swiftly melt away; the boiling cauldrons, once seething, are instantly extinguished. We rely on the wondrous creation of the Primordial Mystery, the good affinity of virtue and power.\n\nNow the lamps and candles are lit, their brilliance illuminating the underworld; sandalwood and aloes are kindled, their fragrant smoke rising and spreading through the ten directions. To emerge from the depths, they must rely on great creation. We offer them food and drink, present them with money and treasures. We beseech the Four Departments and Six Palaces to record good deeds and erase evil; the Three Origins and Nine Courts, the yin officials and yang administrators, to look upon sentient beings with compassion and broadly bestow salvation. Above, we pray for sagely grace; below, we spread numinous mercy. May a single taste become a hundred delicacies, a single coin become a thousand carts of treasure. May it reach all infinite worlds, showering boundless ghosts and spirits.\n\nWe humbly hope you will descend in bodily form and partake of these offerings. Thus may their hollow bellies be filled, their starving stomachs satisfied. Let each turn their body and mind, swiftly directing their merit. By past affinities and former kalpas, they receive the aid of the true wind; on this night, at this hour, they savor the sweet dew of fragrant offerings. Secretly we sprinkle the rain of compassion, washing away stains; broadly we blow the wind of liberation, sweeping away transgressions. May all rejoice, receiving blessings in the human and heavenly realms. Having attained spiritual resonance, may they proceed to their proper destinies.\n\nWe now recite the **Spiritual Incantation for Transforming Food**.\n\n**Burn the talisman. Transform the food.**",
      "overlap_context": "xtend their compassionate pity.\n\nWe reverently pray that, gazing afar toward the immortal palaces, we may supplicate the August Emperor of the Void Heavens, that he may greatly extend celestial grace and bend to bestow compassionate regard. Throughout the expanse within heaven and earth, we broadly invite those from ancient times to the present. By the power of your majestic radiance, we specially present this petition for summoning and reception.\n\n**Summoning the Lonely and Receiving the Lost**",
      "start_char": 710,
      "end_char": 1932,
      "start_sentence": 51,
      "end_sentence": 135,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.49750089645386,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓济幽判斛仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "咒食 加持 称号 道言，戒者止也，所以止人非心，归於正定。 故戒生定。 儒者亦谓，知止而后有定。 但三洞众经，四辅秘典，演说戒法，种种不同。 惟无上洞玄灵宝九真妙戒者，诸戒之首。 天人共仰，幽显同遵。 无上之上，洞玄中玄，万神之灵，一炁之宝。 妙贯三才，戒制六情。 数定於阳，故分为九。 修而不伪，故名为真。 天人仰之，以为城郭。 幽显资之，以为梯航。 今日亡魂受之，可以为之法蕊。 然受戒之法，静默为先。 持戒之法，勤奉为上。 法众同诚，当传九戒。 举智慧颂 第一戒者敬让，孝养父母，是名初真戒。 受持之后，当获端正长寿果，持心勿怠。 第二戒者克勤，忠於君主，是名念真戒。 受持之后，当获聪明智慧果，持心勿怠。 第三戒者不杀； 慈救众生，是名持真戒。 受持之后，当获富贵豪胜果，持心勿怠。 第四戒者不淫，正身处物．是名守真戒。 受持之后，当获吉庆安乐果，持心勿怠。 第五戒者不盗，推义损己，是名保真戒。 受持之后，当获清净善性果，持心勿怠。 第六戒者不嗔，凶怒凌人，是名修真戒。 受持之后，当获禄位清显果，持心勿怠。 第七戒者不骄，傲忽至真，是名得真戒。 受持之后，当获具足十相果，持心勿怠。 第八戒者不诈，谄贼害善，是名成真戒。 受持之后，当获大道正法果，持心勿怠。 第九戒者不二，奉戒专一，是名登真戒。 受持之后，当获证大法王果，持心勿怠。 举奉戒颂 妙戒灵文，黄箓白简。 既备宣於奥旨，当敬受於灵文。 夫心焉难制，制以九戒，则可归心於太虚； 形也未超，超以二符，自可炼形於上境。 汝等孤魂，直须生生勿忘於戒言，劫劫常持於符券。 澄神物外，尘缘永断於多生； 受质阳间，善果自臻於有永。 恩留家国，庆及无穷。 所有长生宝箓，功德疏文，谨当宣告。 祭炼 切以启祈将竟，供养已周。 延驻虑烦，冥阳有隔。 今则暗云沥沥之银河欲转，丁丁之铜漏将残。 阴云黯黯之天扃牛斗，沉沉之雾锁蟾宫。 雨云寂寂工之商羊鼓舞，冥冥之石燕交飞。 雪百浙淅之暗妆玉树，纷纷之静坠瑶阶。 各整云軿，齐登霄汉。 天道即还天道，神明各复神司。 人居三界之中，鬼治九幽之府。 穷魂饿鬼，地狱幽牢，普愿升迁，俱承利益。 变天厨之品炼，化尘世之钱财。 悉为祈恩，无非致福。 领此香斋之会，纳兹表献之仪。 适皆次第而来，今已盘旋而去。 既得托形仙府，必当高步祥云。 径朝灵应之宫，遽诣逍遥之境。 上穷云翼，下极渊鳞。 获奉善因，仍闻妙乐。 溥承资荐，共遂超升。 然冀饮食之余，供养之外。 旷野飞禽之类，悉可充肠； 深原走兽之徒，尽皆饱腹。 傥值抨弦击矢，永脱侵伤。 若逢设网持戈，更难损害。 早抛恶趣，速证善缘。 略伸及物之功，稍罄信心之重。 叩头星汉，拜手天阶。 法众斋官，谨伸奉送。 玉音仙乐响珊珊，鹤舞鸾飞度九关。 执箓把符超法界，参朝金阙觐天颜。 举极乐颂送 向来",
      "translated_text": "**Incantation for Food, Empowerment, and Invocation of Names**\n\nThe Dao declares: \"Precepts\" mean cessation—ceasing the mind’s transgressions to return to true stillness. Thus precepts give rise to samādhi. The Confucians also say, \"Knowing cessation, one attains stillness.\" Yet the Three Caverns’ scriptures and the Four Auxiliary secret canons expound precepts in myriad forms. Among them, the **Supreme Cavernous Mystery Numinous Treasure Ninefold Wondrous Precepts** stand as the foremost of all precepts. Revered by heaven and humankind, observed by both the hidden and manifest realms, they are the supreme above the supreme, the cavernous within the cavernous, the numinous of myriad spirits, the treasure of primordial qi. Wondrously pervading the Three Realms, they restrain the six emotions. Their number fixed by yang, they are divided into nine. Cultivated without falsity, they are called \"true.\" Heaven and humankind look to them as ramparts; the hidden and manifest rely on them as ladders and boats. Today, the departed souls receive them as the flower of the Dharma.\n\nThe method of receiving precepts begins with stillness and silence; the method of upholding them prizes diligent observance. With the assembly united in sincerity, we now transmit the Nine Precepts.\n\n**Recite the Wisdom Hymn**\n\nThe **First Precept** is reverence and deference, filial piety and care for parents—this is the **Initial Truth Precept**. After receiving and upholding it, one attains the fruit of uprightness and longevity. Hold fast to the mind without negligence.\n\nThe **Second Precept** is diligence and devotion, loyalty to one’s lord—this is the **Mindful Truth Precept**. After receiving and upholding it, one attains the fruit of wisdom and sagacity. Hold fast to the mind without negligence.\n\nThe **Third Precept** is not killing, compassionate rescue of all beings—this is the **Upholding Truth Precept**. After receiving and upholding it, one attains the fruit of wealth, nobility, and excellence. Hold fast to the mind without negligence.\n\nThe **Fourth Precept** is not engaging in licentiousness, rectifying the body amid all things—this is the **Guarding Truth Precept**. After receiving and upholding it, one attains the fruit of auspiciousness and peace. Hold fast to the mind without negligence.\n\nThe **Fifth Precept** is not stealing, extending righteousness at one’s own expense—this is the **Preserving Truth Precept**. After receiving and upholding it, one attains the fruit of purity and good nature. Hold fast to the mind without negligence.\n\nThe **Sixth Precept** is not harboring wrath, refraining from cruelty and aggression—this is the **Cultivating Truth Precept**. After receiving and upholding it, one attains the fruit of illustrious rank and clarity. Hold fast to the mind without negligence.\n\nThe **Seventh Precept** is not being arrogant, avoiding disdain for the utmost truth—this is the **Attaining Truth Precept**. After receiving and upholding it, one attains the fruit of perfecting the ten virtues. Hold fast to the mind without negligence.\n\nThe **Eighth Precept** is not being deceitful, refraining from flattery, treachery, and harming the good—this is the **Perfecting Truth Precept**. After receiving and upholding it, one attains the fruit of the Great Dao’s true Dharma. Hold fast to the mind without negligence.\n\nThe **Ninth Precept** is not being dual-minded, upholding the precepts with single-minded devotion—this is the **Ascending Truth Precept**. After receiving and upholding it, one attains the fruit of realizing the Great Dharma King. Hold fast to the mind without negligence.\n\n**Recite the Precept-Receiving Hymn**\n\nThe wondrous precept scripture, inscribed on yellow registers and white tablets, having fully proclaimed its profound essence, is now reverently received in its numinous text. The mind is hard to restrain; restrained by the Nine Precepts, it may return to the Great Void. The form has not yet transcended; transcended by the Two Talismans, it may refine itself in the upper realms. You, the lonely souls, must in every life remember the precept words, in every kalpa uphold the talismanic covenant. Clarify the spirit beyond the material world, severing worldly ties across many lives. Receiving form in the yang realm, good fruits will naturally accrue in perpetuity. Grace lingers in families and nations, blessings extending without end.\n\nAll **Registers of Longevity** and **Merit Memorials** shall now be solemnly proclaimed.\n\n**Concluding Offerings and Refinement**\n\nAs our prayers draw to a close and offerings are complete, we linger in concern, for the realms of darkness and light remain divided. Now the silver river of dim clouds stirs, the bronze clepsydra’s *ding-ding* nears its end. The sky’s gate at Ox and Dipper darkens beneath gloomy clouds; the moon’s palace is locked in deep mist. Rainclouds stand silent as the *gong*-tuned simurgh dances; stone swallows soar in the murk. Snow adorns the jade trees with a hushed rustle; silently, jade-like petals drift onto the steps. Each prepares their cloud chariot, ascending together to the celestial river.\n\nThe Way of Heaven returns to the Way of Heaven; the spirits each resume their divine offices. Humans dwell within the Three Realms; ghosts govern the Nine Dark Prisons. May all hungry souls, starving ghosts, and denizens of hellish dungeons ascend and be delivered, sharing in these benefits. Transform the celestial kitchens’ refined offerings, convert the worldly wealth. All is for beseeching grace, none fails to bring blessing.\n\nHaving led this fragrant fast and received these presented rites, they came in due order and now depart in spiraling flight. Having gained form in the immortal courts, they shall surely tread upon auspicious clouds, hastening to the **Palace of Numinous Response**, swiftly arriving at the **Realm of Carefree Wandering**. Above, they traverse the clouds’ wings; below, they reach the abyss’s scales. Having received good causes, they hear wondrous music. Universally aided by this offering, they together achieve transcendence.\n\nBeyond the remnants of food and offerings, may the flocks of wild birds in the open fields have their hunger sated; may the herds of beasts in the deep plains fill their bellies. Should they encounter the twang of bowstrings or the flight of arrows, may they forever escape harm. If they meet nets or spears, may they suffer no injury. May they swiftly cast off evil destinies and swiftly realize good affinities.\n\nWe humbly extend this merit to all beings, slightly exhausting the weight of our faithful hearts. Bowing our heads to the starry river, prostrating before the celestial steps, the assembly of ritual officers now respectfully sends them forth.\n\nJade tones and immortal music chime; cranes dance and phoenixes soar past the Nine Gates. Holding registers and grasping talismans, they transcend the Dharma realms, attending court at the Golden Palace to behold the Heavenly Countenance.\n\n**Recite the Hymn of Utmost Bliss to Send Forth**\n\nThus concludes the rite.",
      "overlap_context": "e aid of the true wind; on this night, at this hour, they savor the sweet dew of fragrant offerings. Secretly we sprinkle the rain of compassion, washing away stains; broadly we blow the wind of liberation, sweeping away transgressions. May all rejoice, receiving blessings in the human and heavenly realms. Having attained spiritual resonance, may they proceed to their proper destinies.\n\nWe now recite the **Spiritual Incantation for Transforming Food**.\n\n**Burn the talisman. Transform the food.**",
      "start_char": 1932,
      "end_char": 3084,
      "start_sentence": 136,
      "end_sentence": 217,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.691840410232544,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓济幽判斛仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "焚燎 玉箓济幽判斛仪竟",
      "translated_text": "The Rite of Fumigation and Offering, with Jade Registers to Deliver the Hidden and Judge the Measured, is now complete.",
      "overlap_context": "ing the weight of our faithful hearts. Bowing our heads to the starry river, prostrating before the celestial steps, the assembly of ritual officers now respectfully sends them forth.\n\nJade tones and immortal music chime; cranes dance and phoenixes soar past the Nine Gates. Holding registers and grasping talismans, they transcend the Dharma realms, attending court at the Golden Palace to behold the Heavenly Countenance.\n\n**Recite the Hymn of Utmost Bliss to Send Forth**\n\nThus concludes the rite.",
      "start_char": 3084,
      "end_char": 3100,
      "start_sentence": 218,
      "end_sentence": 219,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 1.3781428337097168,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓济幽判斛仪.txt",
        "category": "威仪类"
      }
    }
  ]
}