{
  "source_id": "玉箓资度宿启仪",
  "source_file": "chunked_daozang\\玉箓资度宿启仪.json",
  "total_chunks": 5,
  "total_original_chars": 2118,
  "total_translated_chars": 13945,
  "total_translation_time": 79.65816521644592,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓资度宿启仪.txt",
    "category": "威仪类"
  },
  "full_translation": "*The Jade Register Rite for Seeking Deliverance and Invoking the Night Vigil*\n\n**Scripture Title:** *Jade Register Rite for Seeking Deliverance and Invoking the Night Vigil*\nOne fascicle. Source text: *Daoist Canon of the Zhengtong Era*, *Dongxuan* Section, *Weiyi* Category.\n\n---\n\n**Jade Register Rite for Seeking Deliverance and Invoking the Night Vigil**\nThe ritual proceeds according to form. All pay homage to the master and cultivate mindfulness as prescribed.\n\n**Invocation of the Divine Incantations**\n\n**East**\nNinefold *qi* of the Azure Heavens, Radiant Star, Great Spirit.\nShining upon the East, illuminating the Nine Gates.\nTurning the candle’s yang light, sweeping away defilement and baleful *qi*.\nThe Luminous Youth, styled Mysterious Minister,\nGuards my chamber, ascending to face the Imperial Lord.\nBinding demons and restraining specters, hunting down malevolent hordes.\nUpholding the true Dao, the Red Script and Jade Texts.\nNine Heavens’ talismanic command, dispatched by dragon couriers.\nAll under Heaven is pacified; I attain transcendence and flight.\n\n**South**\nThreefold *qi* of the Vermilion Heavens, resplendent with streaming light.\nThe Glowing Star turns the candle, penetrating the Great Yang.\nAbove abides the Crimson Essence, in harmony with the Primal Sovereign.\nThe Luminous Divine Youth, styled Radiant Chamber,\nCommands the hosts of fire, guarding the Jade Hall.\nBeheading deviance and restraining specters, severing demon kings.\nOrdained by the Northern Emperor, none dare withstand wind and flame.\nInterlocking bells gleam, protecting the altar precincts.\nThe true Dao flows forth—who dares act recklessly?\nI receive supreme merit, seated in the turning of the *kuigang*.\nThrough kalpas unending, I safeguard Heaven without bound.\n\n**West**\nSevenfold *qi* of the Pale Heavens, the Great White streaming with essence.\nLight illumines the Golden Gate, penetrating the Great Darkness.\nWithin abides the Pale Sovereign, styled Imperial Spirit,\nPreserving the divine and pacifying my form.\nSevering the roots of deviance, the kingly Dao shines clearly.\nPalaces are ordered, the Three Luminaries aligned.\nThe Dao accords with spontaneity; I ascend to the Purple Court.\nThe talismanic command of the Numinous Treasure universally benefits all beings.\nThe Primal Sovereign’s true *qi* comes to merge with my body.\nMerit extends to all; Heaven and Earth are at peace.\n\n**North**\nFivefold *qi* of the Mysterious Heavens, the Primordial Beginning lingers.\nThe Chronogram Star blazes, its light suffusing the Supreme Subtlety.\nThe Black Numinous Honored Spirit, styled Layered Might,\nCommands the flying immortals of Heaven, clad in feathered skirts and divine robes.\nGuarding the Five Gates, inspecting essences and capturing transgressors.\nWho dares test me? The *huoluo* blades strike and destroy.\nThe Jade Talisman’s decree summons the Eight Mightful Divine Beings.\nThe gates of deviance are sealed; the true Dao shines forth.\nIlluminating my body, the Three Luminaries share their radiance.\nI spur the void and ride the floating clouds, my form ascending in immortal flight.\n\n**Center**\nThe single *qi* of the Yellow Heavens regulates Qian and Kun.\nForging and refining yin and yang, governing the Mysterious True.\nThe Quelling Star emits its splendor, streaming through the Nine Heavens.\nThe Radiant Youth, styled Celestial Brilliance,\nPrimal *qi* and yang essence, flames rise as crimson smoke.\nPenetrating all under Heaven, and the bodies of us, your servants.\nA hundred deviants are cast down; ten thousand ghosts slain.\nThe Central Mountain’s divine incantation universally prevails.\nThe Five Spirits are pacified; my body ascends as an immortal.\n\n**Twenty-four strikes of the ritual drum**\n\nO Most High Three Heavens, Mysterious Primordial, Threefold *Qi*, Supreme Lord of the Dao,\nSummon forth from within my body the Three and Five Merit Officers,\nLeft and Right Attendant Envoys,\nLeft and Right Incense-Bearing Dragon Courier Scribes,\nIncense-Holding Golden Youths,\nMessage-Transmitting, Flower-Scattering Jade Maidens,\nand the Five Thearchs’ Direct Talisman and Daily Incense Officers—\nthirty-six of each—emerge.\nEmerging, they are clad in solemn attire, their robes and sashes adorned with hanging tassels.\nReport to the deities of the sacred altar’s land and the spirits of the directional domains.\n\nNow, having fasted and made solemn petition, I establish the altar and complete the rites. With reverence, I present this offering to convey the sincerity of my heart’s intent, which has been recorded and made known. May the supreme, perfected *qi* of the Dao, the radiant luminosity of the *Lingbao*, descend and flow into our bodies, that the devotion of my petition may swiftly ascend and be received before the Most High, Boundless, and Perfect Dao—the Three Clarities, the August Heavenly Golden Gate Jade Emperor, and the Eastern Ultimate Compassionate Lord, the Azure Mystery Emperor.\n\nInvoking the sacred ranks,\nI, your humble servant [Name], now kindle this incense, dedicating its merit and virtue. May [Name of the deceased] ascend on phoenix-drawn chariots, soar through the clouds, and ride the luminous carriage of the immortals, attaining joy in the divine realms and realizing the fruit of freedom. Universally, for the Emperor, His Majesty; the Crown Prince, His Highness; the princes and marquises who shield the realm; the officials who govern the land; our Three Masters and Five Companions; past generations of Dao seekers; those who dwell in valleys and mountains; the Libationers of our gates; all soldiers and common folk; every being under heaven—whether moving or still, flying or hidden—may all return body, spirit, and life to the Supreme, Ten Directions, *Lingbao*, Natural, Perfect, and Boundless Dao.\n\nI humbly beseech the absolution of my three karmic actions and six sensory roots, and the forgiveness of boundless transgressions, that I may escape the Three Calamities, Five Sufferings, Eight Difficulties, and Nine Perils. May my body attain the true Dao, and may I sing of great peace. Together, may we ascend to benevolence and longevity, roaming in effortless freedom, forever united with the Dao. May this petition, born of profound resonance, be heard and received before the Perfect and Boundless Dao.\n\nAt the sounding of the chime, rise in reverence and praise.\nChant the *Ten Directions*.\nBow to the ground, then kneel in prostration, returning life and spirit in repentance.\n\nWe, the assembled ritualists, wholeheartedly return body, spirit, and life to the Ten Directions’ Boundless Dao, the Supreme *Lingbao* Heavenly Worthy. We reverently gaze upon your vast compassion, beseeching your boundless grace and universal mercy.\n\nWe have heard that the primordial ancestral *qi* ever abides in purity as its essence; the jade registers of ritual scripture cannot be approached without fasting and covenant. To move the Perfected Ones above, we must first purge even the slightest impurity. Thus, we offer our utmost sincerity to cultivate hidden blessings. Yet we fear that our wisdom has drowned in illusion, our discernment entangled in distractions. The true unity of essence, *qi*, and spirit remains obscured by the unbroken mountain of karma; the delusions of body, mind, and speech churn the still waters of concentration into waves. Our accumulated transgressions are measureless.\n\nWe implore your compassion and beseech your forgiveness, that our petitions may be free of demonic obstruction, our meditations aligned with the Dao. May we gather the myriad Perfected at the imperial court and assemble a hundred blessings at the ritual altar. May [Name of the deceased] realize the fruit of immortality, their spirit serene in the realm of fortune. May the nation and household receive your protection, preserving the jade plan of destiny forever.\n\nWe, the assembled ritualists, bow our heads in devotion, offering thanks to the Supreme and Perfect Three Treasures.\n\nAt the sounding of the chime, chant the *Three Invocations* and perform the *Three Bows*.\nOnce more, invoke the sacred ranks.\n\nThe humble servant of such-and-such rank and surname, with utmost sincerity, jointly invokes and reverently addresses:\n\nThe Supreme and Boundless Dao, the Primordial Heavenly Venerable of the Origin;\nThe Most High Dao Lord;\nThe Most High Lord Lao;\nThe Jade Emperor of the August Heaven;\nThe Great Emperor of the Purple Tenuity at the Northern Culmen;\nThe Heavenly Emperor of the Purple Tenuity;\nThe August Thearch of Earth, Lord of the Soil;\nThe Great Emperor of Azure Radiance at the Eastern Culmen;\nThe Great Emperor of Longevity at the Southern Culmen;\nThe Supreme Jade Emperor;\nThe Jade Sovereign of the Void;\nThe Venerable Lord of the Dao, Radiant and August, of the Seven-Treasured Jeweled Terrace and Golden Watchtower in the Jade Capital of the Mysterious Metropolis;\nThe hosts of Great Sages who have attained the Dao in the ten directions;\nThe Perfected Lords and Venerable Masters;\nThe True Persons of Great Compassion and Great Mercy, Savior from Suffering;\nThe True Persons of Salvation and Deliverance;\nThe True Persons of Great Benevolence;\nThe True Persons of Life-Inscription;\nThe True Persons of Universal Salvation;\nThe True Persons of Dharma Liberation in the Fragrant Grove Assembly;\nThe thirty-six divisions of revered scriptures;\nThe Great Dharma Masters of the Mysterious Center;\nThe Great Dharma Masters of the Three Heavens;\nThe True Lords of the Three Masters of the Lingbao Scriptures and Registers;\nThe True Ladies of the Orthodox Unity lineage, the Three Female Masters;\nThe officials and attendants of the Three Realms;\nand all true numina.\n\nWe, your servants, are but scattered rubble and broken tiles, frail as the wellside parasol tree. Though we have personally received the transmission of the Dao’s discipline, we lament the long and distant path of chambered cultivation.\n\nSwiftly beholding the Mysterious Pivot, yet this towering wall looms dense before us.\nWe have not tended the mist and clouds in the Vale of Fleeting Time, but idly admired the sun and moon at the Cock’s Window.\nThe teachings emerged from the Azure Prime, yet we grasp only the urgency of proclaiming the talismans;\nThe rites honor the Great Simplicity, and we dread incurring the severity of its promulgated statutes.\nHad we not sworn this ground to establish merit, how could we presume to inherit Heaven’s mandate and redress our faults?\n\nWe, your servants, reverently receive the imperial edict, diligently cultivating the Jade Registers,\nto aid in the deliverance of such-and-such a spirit and augment the blessings of Heaven.\nIn accordance with the stated intent, we exert the utmost sincerity,\ntempering our cinnabar hearts and refining our plain sincerity.\nWe follow the secrets of the Golden Casket of Purple Yang,\nand adhere to the mysteries of the Jade Registers of the Azure Ultimate.\nGates arrayed with the Ten Flowers, the altar encircled by the Four Quarters.\nModeling Heaven and emulating Earth, the Three Vehicles array the ranks of mandarin ducks and egrets;\nSummoning yin and invoking yang, the Nine Suites descend the chariots of dragons and simurghs.\nMist ascends from the orchid tripod, colored clouds surge from the mushroom censer.\nBanners and pennants flutter, streamers and blossoms sway.\n\nBeginning on such-and-such a day, we reverently establish the Mysterious Altar in accordance with the ritual canons.\nMay the Three Treasures and Dao Masters, the Lords of the Nine Dark Realms, deign to bestow their compassionate gaze,\nand peruse what we have set forth.\nWe command the immortals of the Three Caverns, the officials of the Lingbao,\nthe attendants of the Azure Mystery, the ranks of the Yellow Registers,\nthe overseers of the fast, the attendants of the scriptures,\nthe guardians of the altar and protectors of the Dao,\nthe community spirits and earth deities—\nto unite in purpose and strength, sweeping away malevolent vapors within and without;\nto convey sincerity and transmit faith, harmonizing the resonance between Heaven and humanity.\n\nMay we, your servants, attain clarity in every limb and harmony in the Three Passes.\nConcentrating the true and calming the breath, we fuse the wondrous qi within the cinnabar hut;\nGathering the Dao and moving the spirit, we embrace the numinous radiance at the Mysterious Seat.\nWe spread forth vast blessings to deliver the divine spirit.\nMay the fast’s blessings be complete and perfect, and the Dharma Wheel turn ever onward.\n\nAt dawn tomorrow, we shall proceed with the Dao-circumambulation and continue our supplications.\nWhen the sounding stone is struck, the Wisdom Hymn recited,\nthe talismans announced, and the incense offered with concentrated spirit.\n\nMay the Incense Officials and Envoys, the Lords of the Left and Right Dragon-Tiger, and all the spirit-officials attendant upon the incense ensure that the site where we, your servants, have established the altar overnight naturally brings forth golden liquid, cinnabar, and azure mushroom blossoms. May the hundred numinous perfected beings gather here before the incense burner. We humbly pray that Heaven witness our sincerity, and that the winds purify the earth below. May the jade chimes harmonize with the golden tones in perfect order, and may the jasper wheels and feathered canopies descend to this hall. May our morning devotions be accomplished, and may blessings flow abundantly to the unseen realms.\n\nMay the jade maidens and immortal youths of the ten directions attend the orchid-scented smoke, conveying the sincerity of our supplications swiftly to the Most Perfect and Boundless Dao of the Three Clarities and Supreme Saints, to the Jade Emperor of the Golden Portal of the Vast Heaven, and to the Merciful August One of the Eastern Ultimate and the Azure Mystery Emperor before the Dao.\n\n*Exiting the Hall Hymn*\nThe *Jade Register Rite for Deliverance and Overnight Petitions* is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "玉箓资度宿启仪 经名：玉箓资度宿启仪。 一卷。 底本出处：《正统道藏》洞玄部威仪类。 玉箓资度宿启仪 法事如式 各礼师，存念如法 请宣神咒 东方 九炁青天，明星大神。 焕照东方，洞映九门。 转烛阳光，扫秽除氛。 开明童子，号曰玄卿。 备卫我轩，上对帝君。 收魔束妖，讨捕凶群。 奉承正道，赤书玉文。 九天符命，摄龙驿传。 普天安镇，我得飞仙。 南方 三炁丹天，焕景流光。 荧星转烛，洞照太阳。 上有赤精，合契虚皇。 开明灵童，号曰华房。 总统火兵，备守玉堂。 斩邪束妖，翦截魔王。 北帝所承，风火莫当。 流铃交焕，翊卫坛场。 正道流行，敢有巴狂。 我享上功，坐运魁罡。 亿劫长存，保天无疆。 西方 七炁素天，太白流精。 光耀金门，洞照太冥。 中有素皇，号曰帝灵。 保神安镇，卫我身形。 断截邪源，王道正明。 宫殿整肃，三景齐并。 道合自然，飞升紫庭。 灵宝符命，普惠万生。 元皇正炁，来合我身。 功加一切，天地咸宁。 北方 五炁玄天，元始徘徊。 辰星焕烂，光曜太微。 黑灵尊神，号曰层威。 统冠飞天，仙裙羽衣。 备卫五门，检精捕非。 敢有干试，豁落斩摧。 玉符所告，神真八威。 邪门闭塞，正道明开。 映照我身，三光同辉。 策空驾浮，举形仙飞。 中央 一炁黄天，调理乾坤。 陶镕阴阳，总统玄真。 镇星吐辉，流焕九天。 开光童子，号曰天璘。 元炁阳精，焰上朱烟。 洞照天下，及臣等身。 百邪摧落，杀鬼万千。 中山神咒，普天使然。 五灵安镇，身飞上仙。 鸣法鼓二十四通 无上三天玄元始三炁太上道君，召出臣身中三五功曹、左右官使者、左右捧香驿龙骑吏、侍香金童、传言散花玉女、五帝直符直日香官，各三十六人出。 出者，严装显服，冠带垂缨。 关启玄坛土地，方域神真。",
      "translated_text": "*The Jade Register Rite for Seeking Deliverance and Invoking the Night Vigil*\n\n**Scripture Title:** *Jade Register Rite for Seeking Deliverance and Invoking the Night Vigil*\nOne fascicle. Source text: *Daoist Canon of the Zhengtong Era*, *Dongxuan* Section, *Weiyi* Category.\n\n---\n\n**Jade Register Rite for Seeking Deliverance and Invoking the Night Vigil**\nThe ritual proceeds according to form. All pay homage to the master and cultivate mindfulness as prescribed.\n\n**Invocation of the Divine Incantations**\n\n**East**\nNinefold *qi* of the Azure Heavens, Radiant Star, Great Spirit.\nShining upon the East, illuminating the Nine Gates.\nTurning the candle’s yang light, sweeping away defilement and baleful *qi*.\nThe Luminous Youth, styled Mysterious Minister,\nGuards my chamber, ascending to face the Imperial Lord.\nBinding demons and restraining specters, hunting down malevolent hordes.\nUpholding the true Dao, the Red Script and Jade Texts.\nNine Heavens’ talismanic command, dispatched by dragon couriers.\nAll under Heaven is pacified; I attain transcendence and flight.\n\n**South**\nThreefold *qi* of the Vermilion Heavens, resplendent with streaming light.\nThe Glowing Star turns the candle, penetrating the Great Yang.\nAbove abides the Crimson Essence, in harmony with the Primal Sovereign.\nThe Luminous Divine Youth, styled Radiant Chamber,\nCommands the hosts of fire, guarding the Jade Hall.\nBeheading deviance and restraining specters, severing demon kings.\nOrdained by the Northern Emperor, none dare withstand wind and flame.\nInterlocking bells gleam, protecting the altar precincts.\nThe true Dao flows forth—who dares act recklessly?\nI receive supreme merit, seated in the turning of the *kuigang*.\nThrough kalpas unending, I safeguard Heaven without bound.\n\n**West**\nSevenfold *qi* of the Pale Heavens, the Great White streaming with essence.\nLight illumines the Golden Gate, penetrating the Great Darkness.\nWithin abides the Pale Sovereign, styled Imperial Spirit,\nPreserving the divine and pacifying my form.\nSevering the roots of deviance, the kingly Dao shines clearly.\nPalaces are ordered, the Three Luminaries aligned.\nThe Dao accords with spontaneity; I ascend to the Purple Court.\nThe talismanic command of the Numinous Treasure universally benefits all beings.\nThe Primal Sovereign’s true *qi* comes to merge with my body.\nMerit extends to all; Heaven and Earth are at peace.\n\n**North**\nFivefold *qi* of the Mysterious Heavens, the Primordial Beginning lingers.\nThe Chronogram Star blazes, its light suffusing the Supreme Subtlety.\nThe Black Numinous Honored Spirit, styled Layered Might,\nCommands the flying immortals of Heaven, clad in feathered skirts and divine robes.\nGuarding the Five Gates, inspecting essences and capturing transgressors.\nWho dares test me? The *huoluo* blades strike and destroy.\nThe Jade Talisman’s decree summons the Eight Mightful Divine Beings.\nThe gates of deviance are sealed; the true Dao shines forth.\nIlluminating my body, the Three Luminaries share their radiance.\nI spur the void and ride the floating clouds, my form ascending in immortal flight.\n\n**Center**\nThe single *qi* of the Yellow Heavens regulates Qian and Kun.\nForging and refining yin and yang, governing the Mysterious True.\nThe Quelling Star emits its splendor, streaming through the Nine Heavens.\nThe Radiant Youth, styled Celestial Brilliance,\nPrimal *qi* and yang essence, flames rise as crimson smoke.\nPenetrating all under Heaven, and the bodies of us, your servants.\nA hundred deviants are cast down; ten thousand ghosts slain.\nThe Central Mountain’s divine incantation universally prevails.\nThe Five Spirits are pacified; my body ascends as an immortal.\n\n**Twenty-four strikes of the ritual drum**\n\nO Most High Three Heavens, Mysterious Primordial, Threefold *Qi*, Supreme Lord of the Dao,\nSummon forth from within my body the Three and Five Merit Officers,\nLeft and Right Attendant Envoys,\nLeft and Right Incense-Bearing Dragon Courier Scribes,\nIncense-Holding Golden Youths,\nMessage-Transmitting, Flower-Scattering Jade Maidens,\nand the Five Thearchs’ Direct Talisman and Daily Incense Officers—\nthirty-six of each—emerge.\nEmerging, they are clad in solemn attire, their robes and sashes adorned with hanging tassels.\nReport to the deities of the sacred altar’s land and the spirits of the directional domains.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 712,
      "start_sentence": 0,
      "end_sentence": 65,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.143202543258667,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓资度宿启仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "臣今宿启告斋，建坛蒇事。 谨奏为入意其诸情悃，已录告闻。 愿得太上至真道炁灵宝慧光下降，流入臣等身中，令臣所启之诚，速达径御至真无极大道三清上圣昊天金阙玉皇上帝，东极慈尊青玄上帝道前。 请称法位 具位臣姓某等今故烧香，愿以是香功德，上愿某灵凤驭凌霄，鸾軿泛景，登神快乐，证果逍遥。 普为皇帝陛下，皇太子殿下，藩屏王侯，土地官长。 臣等三师五友、异代学真、谷隐岩栖、门徒祭酒，以至三军万姓，天下人民，动植飞潜，无边含识，皈身皈神皈命，太上十方灵宝自然至真无极大道。 特乞赦原臣等三业六根、无边罪犯，得离三灾五苦、八难九厄之中，身得道真，歌咏太平。 同跻仁寿，逍遥无为，永与道合。 所启玄感，应声上御至真无极道前。 知磬举，起敬赞 唱十方 礼足，各长跪，皈命忏悔 臣法众等志心皈身皈神皈命，十方无极大道太上灵宝天尊，恭望洪慈，洞垂巨泽，普降洪恩。 臣闻，混元祖炁，常清静以为宗； 玉箓仪文，匪斋盟而莫格。 将感通於上圣，先荡涤於纤瑕。 庶竭忱诚，以资冥福。 犹虑臣等智沦象罔，识染纷葩。 精气神混合之真，业山未破； 身心口流吹之妄，定水俄波。 动积过尤，无边无量。 仰祈矜悯，俯赐赦原。 使臣等奏对无魔，存思合道。 会万真於帝所，集百福於斋坛。 某灵证果登，福境以澄神； 家国承庥，保瑶图而永固。 臣法众等，志心稽首，礼谢无上至真三宝。 知磬举，三启颂 三礼 重称法位",
      "translated_text": "Now, having fasted and made solemn petition, I establish the altar and complete the rites. With reverence, I present this offering to convey the sincerity of my heart’s intent, which has been recorded and made known. May the supreme, perfected *qi* of the Dao, the radiant luminosity of the *Lingbao*, descend and flow into our bodies, that the devotion of my petition may swiftly ascend and be received before the Most High, Boundless, and Perfect Dao—the Three Clarities, the August Heavenly Golden Gate Jade Emperor, and the Eastern Ultimate Compassionate Lord, the Azure Mystery Emperor.\n\nInvoking the sacred ranks,\nI, your humble servant [Name], now kindle this incense, dedicating its merit and virtue. May [Name of the deceased] ascend on phoenix-drawn chariots, soar through the clouds, and ride the luminous carriage of the immortals, attaining joy in the divine realms and realizing the fruit of freedom. Universally, for the Emperor, His Majesty; the Crown Prince, His Highness; the princes and marquises who shield the realm; the officials who govern the land; our Three Masters and Five Companions; past generations of Dao seekers; those who dwell in valleys and mountains; the Libationers of our gates; all soldiers and common folk; every being under heaven—whether moving or still, flying or hidden—may all return body, spirit, and life to the Supreme, Ten Directions, *Lingbao*, Natural, Perfect, and Boundless Dao.\n\nI humbly beseech the absolution of my three karmic actions and six sensory roots, and the forgiveness of boundless transgressions, that I may escape the Three Calamities, Five Sufferings, Eight Difficulties, and Nine Perils. May my body attain the true Dao, and may I sing of great peace. Together, may we ascend to benevolence and longevity, roaming in effortless freedom, forever united with the Dao. May this petition, born of profound resonance, be heard and received before the Perfect and Boundless Dao.\n\nAt the sounding of the chime, rise in reverence and praise.\nChant the *Ten Directions*.\nBow to the ground, then kneel in prostration, returning life and spirit in repentance.\n\nWe, the assembled ritualists, wholeheartedly return body, spirit, and life to the Ten Directions’ Boundless Dao, the Supreme *Lingbao* Heavenly Worthy. We reverently gaze upon your vast compassion, beseeching your boundless grace and universal mercy.\n\nWe have heard that the primordial ancestral *qi* ever abides in purity as its essence; the jade registers of ritual scripture cannot be approached without fasting and covenant. To move the Perfected Ones above, we must first purge even the slightest impurity. Thus, we offer our utmost sincerity to cultivate hidden blessings. Yet we fear that our wisdom has drowned in illusion, our discernment entangled in distractions. The true unity of essence, *qi*, and spirit remains obscured by the unbroken mountain of karma; the delusions of body, mind, and speech churn the still waters of concentration into waves. Our accumulated transgressions are measureless.\n\nWe implore your compassion and beseech your forgiveness, that our petitions may be free of demonic obstruction, our meditations aligned with the Dao. May we gather the myriad Perfected at the imperial court and assemble a hundred blessings at the ritual altar. May [Name of the deceased] realize the fruit of immortality, their spirit serene in the realm of fortune. May the nation and household receive your protection, preserving the jade plan of destiny forever.\n\nWe, the assembled ritualists, bow our heads in devotion, offering thanks to the Supreme and Perfect Three Treasures.\n\nAt the sounding of the chime, chant the *Three Invocations* and perform the *Three Bows*.\nOnce more, invoke the sacred ranks.",
      "overlap_context": "in my body the Three and Five Merit Officers,\nLeft and Right Attendant Envoys,\nLeft and Right Incense-Bearing Dragon Courier Scribes,\nIncense-Holding Golden Youths,\nMessage-Transmitting, Flower-Scattering Jade Maidens,\nand the Five Thearchs’ Direct Talisman and Daily Incense Officers—\nthirty-six of each—emerge.\nEmerging, they are clad in solemn attire, their robes and sashes adorned with hanging tassels.\nReport to the deities of the sacred altar’s land and the spirits of the directional domains.",
      "start_char": 712,
      "end_char": 1292,
      "start_sentence": 66,
      "end_sentence": 96,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.21228861808777,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓资度宿启仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "具位臣姓某谨同诚上启太上无极大道元始天尊，太上道君，大上老君，昊天玉皇上帝，紫微北极大帝，紫微天皇大帝，后土皇地祇，东极青华大帝，南极长生大帝，无上玉帝，玉虚上帝，东华南极西灵北真玄都玉京金阙七宝琼台紫微上宫灵宝至真明皇道君，十方已得道大圣众、至真诸君丈人，大慈大悲救苦真人、救度真人、大惠真人、注生真人、普救真人，香林会中法解真人，三十六部尊经，玄中大法师，三天大法师，灵宝经籍度三师真君，正一嗣系女三师真君，三界官属，一切真灵。 臣等社砾散材，井梧弱质。 亲承道纪，慨入室之悠悠；",
      "translated_text": "The humble servant of such-and-such rank and surname, with utmost sincerity, jointly invokes and reverently addresses:\n\nThe Supreme and Boundless Dao, the Primordial Heavenly Venerable of the Origin;\nThe Most High Dao Lord;\nThe Most High Lord Lao;\nThe Jade Emperor of the August Heaven;\nThe Great Emperor of the Purple Tenuity at the Northern Culmen;\nThe Heavenly Emperor of the Purple Tenuity;\nThe August Thearch of Earth, Lord of the Soil;\nThe Great Emperor of Azure Radiance at the Eastern Culmen;\nThe Great Emperor of Longevity at the Southern Culmen;\nThe Supreme Jade Emperor;\nThe Jade Sovereign of the Void;\nThe Venerable Lord of the Dao, Radiant and August, of the Seven-Treasured Jeweled Terrace and Golden Watchtower in the Jade Capital of the Mysterious Metropolis;\nThe hosts of Great Sages who have attained the Dao in the ten directions;\nThe Perfected Lords and Venerable Masters;\nThe True Persons of Great Compassion and Great Mercy, Savior from Suffering;\nThe True Persons of Salvation and Deliverance;\nThe True Persons of Great Benevolence;\nThe True Persons of Life-Inscription;\nThe True Persons of Universal Salvation;\nThe True Persons of Dharma Liberation in the Fragrant Grove Assembly;\nThe thirty-six divisions of revered scriptures;\nThe Great Dharma Masters of the Mysterious Center;\nThe Great Dharma Masters of the Three Heavens;\nThe True Lords of the Three Masters of the Lingbao Scriptures and Registers;\nThe True Ladies of the Orthodox Unity lineage, the Three Female Masters;\nThe officials and attendants of the Three Realms;\nand all true numina.\n\nWe, your servants, are but scattered rubble and broken tiles, frail as the wellside parasol tree. Though we have personally received the transmission of the Dao’s discipline, we lament the long and distant path of chambered cultivation.",
      "overlap_context": " assemble a hundred blessings at the ritual altar. May [Name of the deceased] realize the fruit of immortality, their spirit serene in the realm of fortune. May the nation and household receive your protection, preserving the jade plan of destiny forever.\n\nWe, the assembled ritualists, bow our heads in devotion, offering thanks to the Supreme and Perfect Three Treasures.\n\nAt the sounding of the chime, chant the *Three Invocations* and perform the *Three Bows*.\nOnce more, invoke the sacred ranks.",
      "start_char": 1292,
      "end_char": 1534,
      "start_sentence": 97,
      "end_sentence": 99,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.512788534164429,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓资度宿启仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "快睹玄枢，斯面墙之郁郁。 莫抚烟霞於驹谷，徒玩日月於鸡窗。 教出始青，惟抱宣符之切； 科尊太素，惧贻布宪之严。 倘非誓地以立功，曷克承天而补过。 臣钦奉纶音，崇修玉箓，资荐某灵，增崇天福。 按如词旨，备极精诚。 淬砺丹衷，磨聋素悃。 遵紫阳金匮之秘，依苍极玉箓之玄。 门列十华，坛周四界。 法天象地，三乘罗鹓鹭之班； 呼阴召阳，九奏降龙鸾之御。 蔼飞烟於兰鼎，腾彩雾於芝篝。 旌葆翩翻，旛花摇曳。 自某日为始，谨依科范，启建玄坛。 恩惟三宝道师、九幽教主，垂慈鉴映，省览所陈。 敕勒三洞仙灵、灵宝官属、青玄僚佐、黄箓录班联、监斋侍经、卫坛护道、社令土地、应感灵祇。 协力同心，扫妖氛於内外； 通诚达信，契影响於天人。 令臣等百体清明，三关调泰。 凝真端息，融妙炁於丹庐； 会道运神，抱灵光於玄座。 罗敷洪泽，资荐神灵。 庶斋福以周圆，俾法轮而兴转。 明晨行道，续更启闻。 知磬举，智慧颂 告符简 存神烧香",
      "translated_text": "Swiftly beholding the Mysterious Pivot, yet this towering wall looms dense before us.\nWe have not tended the mist and clouds in the Vale of Fleeting Time, but idly admired the sun and moon at the Cock’s Window.\nThe teachings emerged from the Azure Prime, yet we grasp only the urgency of proclaiming the talismans;\nThe rites honor the Great Simplicity, and we dread incurring the severity of its promulgated statutes.\nHad we not sworn this ground to establish merit, how could we presume to inherit Heaven’s mandate and redress our faults?\n\nWe, your servants, reverently receive the imperial edict, diligently cultivating the Jade Registers,\nto aid in the deliverance of such-and-such a spirit and augment the blessings of Heaven.\nIn accordance with the stated intent, we exert the utmost sincerity,\ntempering our cinnabar hearts and refining our plain sincerity.\nWe follow the secrets of the Golden Casket of Purple Yang,\nand adhere to the mysteries of the Jade Registers of the Azure Ultimate.\nGates arrayed with the Ten Flowers, the altar encircled by the Four Quarters.\nModeling Heaven and emulating Earth, the Three Vehicles array the ranks of mandarin ducks and egrets;\nSummoning yin and invoking yang, the Nine Suites descend the chariots of dragons and simurghs.\nMist ascends from the orchid tripod, colored clouds surge from the mushroom censer.\nBanners and pennants flutter, streamers and blossoms sway.\n\nBeginning on such-and-such a day, we reverently establish the Mysterious Altar in accordance with the ritual canons.\nMay the Three Treasures and Dao Masters, the Lords of the Nine Dark Realms, deign to bestow their compassionate gaze,\nand peruse what we have set forth.\nWe command the immortals of the Three Caverns, the officials of the Lingbao,\nthe attendants of the Azure Mystery, the ranks of the Yellow Registers,\nthe overseers of the fast, the attendants of the scriptures,\nthe guardians of the altar and protectors of the Dao,\nthe community spirits and earth deities—\nto unite in purpose and strength, sweeping away malevolent vapors within and without;\nto convey sincerity and transmit faith, harmonizing the resonance between Heaven and humanity.\n\nMay we, your servants, attain clarity in every limb and harmony in the Three Passes.\nConcentrating the true and calming the breath, we fuse the wondrous qi within the cinnabar hut;\nGathering the Dao and moving the spirit, we embrace the numinous radiance at the Mysterious Seat.\nWe spread forth vast blessings to deliver the divine spirit.\nMay the fast’s blessings be complete and perfect, and the Dharma Wheel turn ever onward.\n\nAt dawn tomorrow, we shall proceed with the Dao-circumambulation and continue our supplications.\nWhen the sounding stone is struck, the Wisdom Hymn recited,\nthe talismans announced, and the incense offered with concentrated spirit.",
      "overlap_context": "reat Dharma Masters of the Three Heavens;\nThe True Lords of the Three Masters of the Lingbao Scriptures and Registers;\nThe True Ladies of the Orthodox Unity lineage, the Three Female Masters;\nThe officials and attendants of the Three Realms;\nand all true numina.\n\nWe, your servants, are but scattered rubble and broken tiles, frail as the wellside parasol tree. Though we have personally received the transmission of the Dao’s discipline, we lament the long and distant path of chambered cultivation.",
      "start_char": 1534,
      "end_char": 1919,
      "start_sentence": 100,
      "end_sentence": 127,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.987262964248657,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓资度宿启仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "香官使者、左右龙虎君、侍香诸灵官，当令臣向来宿启建坛之所，自然生金液丹碧芝英。 百灵众真，交会在此，香火炉前。 上愿天鉴中心，风清下土。 玉振金声之合序，琼轮羽盖之临轩。 成就朝修，旁流冥福。 十方仙童玉女，接侍兰烟，传臣向来所启之诚，速达径御至真无极大道三清上圣、昊天金阙玉皇上帝、东极慈尊青玄上帝道前。 出堂颂 玉箓资度宿启仪竟",
      "translated_text": "May the Incense Officials and Envoys, the Lords of the Left and Right Dragon-Tiger, and all the spirit-officials attendant upon the incense ensure that the site where we, your servants, have established the altar overnight naturally brings forth golden liquid, cinnabar, and azure mushroom blossoms. May the hundred numinous perfected beings gather here before the incense burner. We humbly pray that Heaven witness our sincerity, and that the winds purify the earth below. May the jade chimes harmonize with the golden tones in perfect order, and may the jasper wheels and feathered canopies descend to this hall. May our morning devotions be accomplished, and may blessings flow abundantly to the unseen realms.\n\nMay the jade maidens and immortal youths of the ten directions attend the orchid-scented smoke, conveying the sincerity of our supplications swiftly to the Most Perfect and Boundless Dao of the Three Clarities and Supreme Saints, to the Jade Emperor of the Golden Portal of the Vast Heaven, and to the Merciful August One of the Eastern Ultimate and the Azure Mystery Emperor before the Dao.\n\n*Exiting the Hall Hymn*\nThe *Jade Register Rite for Deliverance and Overnight Petitions* is now complete.",
      "overlap_context": "n the cinnabar hut;\nGathering the Dao and moving the spirit, we embrace the numinous radiance at the Mysterious Seat.\nWe spread forth vast blessings to deliver the divine spirit.\nMay the fast’s blessings be complete and perfect, and the Dharma Wheel turn ever onward.\n\nAt dawn tomorrow, we shall proceed with the Dao-circumambulation and continue our supplications.\nWhen the sounding stone is struck, the Wisdom Hymn recited,\nthe talismans announced, and the incense offered with concentrated spirit.",
      "start_char": 1919,
      "end_char": 2087,
      "start_sentence": 128,
      "end_sentence": 135,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.802622556686401,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\玉箓资度宿启仪.txt",
        "category": "威仪类"
      }
    }
  ]
}