{
  "source_id": "玉音法事",
  "source_file": "chunked_daozang\\玉音法事.json",
  "total_chunks": 19,
  "total_original_chars": 14141,
  "total_translated_chars": 91943,
  "total_translation_time": 504.96110558509827,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\赞颂类\\玉音法事.txt",
    "category": "赞颂类"
  },
  "full_translation": "**Yuyin Ritual Matters**\n*Category: Hymns and Eulogies, Dongxuan Section*\n\n**Text Title:** *Yuyin Ritual Matters* (Three Scrolls)\n*Source:* *Zhengtong Daoist Canon*, Dongxuan Section, Hymns and Eulogies\n\n---\n\n**Scroll One of *Yuyin Ritual Matters***\n\n*Stepping in Void (First)* – 70 characters\n*Stepping in Void (Third)*\n*Stepping in Void (Fifth)* – 50 characters\n*Golden Portal Stepping in Void* – 50 characters\n\n*Empty Void* – In the altar ritual, do not separate the initial and combined characters; begin directly from the original character.\n\n*Upholding the Precepts*\n*Three Invocations (First)*\n*Three Invocations (Second)*\n*Three Invocations (Third)*\n*Hymn for Opening the Hall*\n*Hymn for Arranging the Fast* (also called *Hymn for Exiting the Hall*)\n*Greater Immortal*\n*Lesser Immortal*\n*Incense Offering Prayer*\n*Mountain Petition, Water Petition* (same as *Earth Petition*)\n*Water Petition* – 40 characters\n*White Crane*\n\nEnd of Scroll One of *Yuyin Ritual Matters*\n\n---\n\n**Scroll Two of *Yuyin Ritual Matters***\n\n*Prelude to Jade Clarity Music*\n*Jade Clarity Music*\n*Prelude to Highest Clarity Music*\n*Highest Clarity Music*\n*Prelude to Supreme Clarity Music*\n*Supreme Clarity Music*\n\n*Prelude to Scattering Flowers* – Small annotation beneath \"scatter\" reads \"Yin,\" referring to the *Wuxian* merit\n*Five-Character Hymn for Scattering Flowers*\n*Seven-Character Hymn for Scattering Flowers*\n*Hymn for Rising in Reverence*\n*Three Refuges*\n\n*Devotedly take refuge in the scriptural treasures of the ten directions—may all beings, the departed spirits, awaken to understanding, receive, uphold, and recite them.*\n\n*Devotedly take refuge in the masterly treasures of the ten directions—may all beings, the departed spirits, ascend the Dharma bridge universally, without obstruction.*\n\n*Hymn for Spreading the Seat*\n*Opening the Scripture*\n*Hymn of Past Lives*\n*Three Hearings of the Scripture*\n\n*After hearing the scripture, may all beings, the departed spirits, have their myriad transgressions universally dissolved and their virtuous sprouts grow.*\n\n*After hearing the scripture, may all beings, the departed spirits, forever sever delusion and constantly return to the true Dao.*\n\n*Hymn for Rising from the Seat*\n\n*For all future rebirths, may good karmic conditions be made—if enlightenment is granted, we reverently bear the profound grace.*\n\n*Whenever the fast concludes, the Dao is intoned—*\n*Chanting the Hymn of the Dao*\n\n*As recorded in the* Jiaoyi Scroll *of the* Canon*: whenever the Dao is chanted, the handbell is struck. At the final phrase, the Daoists silently invoke the Heavenly Worthy three times, or five, or seven, or nine—during yang rites, \"Heavenly Worthy of Longevity and Life-Preservation\" or \"Heavenly Worthy of Boundless Blessings\"; during yin rites, \"Heavenly Worthy of Great Unity and Salvation from Suffering.\"*\n\n*The* Huaxia Hymn *is also called* Four-Voice Huaxia*. According to the* Jade Chapters*, the annotation for* hua *reads* Huaxia*, spanning three thousand five hundred li, signifying its vast and distant meaning. Today, the* Huaxia *begins with the raising of the* Sizhen Hall*, slowly chanted as one passes through the corridor and hall, ascending the altar platform to completion—seemingly evoking its distant resonance.*\n\n*Rotating-Voice Huaxia Hymn*\n*Invite the Five Masters to raise it again.*\n\n**Cloud Chariot Hymn**\nTo send off the Five Masters as they raise it again.\nThe purification rite now complete, we lift our hearts in reverence,\nbowing our heads in devotion to escort the Mystic Master,\nthe Heavenly Master, and the Master of Scriptures and Ordination.\n\n*Cloud Chariot Hymn*\nThe cloud chariot does not stay,\nthe crane-drawn carriage cannot be detained.\nWhen next we hold a purification rite,\nwe shall once more extend our invitation.\n\n**Invoking the Talisman Envoys**\nThe direct envoys of the Three Realms,\nthe Four Duty Officers of the Merit Registers,\nthe divine officials who ascend with petitions,\nthe spirit generals, functionaries, and soldiers,\nthe local earth deities.\n\n**Steps of Void Hymn**\n**Three Paths Hymn**\n**Final Phrase of the Dipper Scripture**\n**Homage to the Ten Directions**\n**Homage to the Eleven Luminaries**\n**Raising the Faith-Offering Chant**\n**Thirteen Invocations in Unison**\n**Closing the Lamps and Raising the Dipper Position**\n**Three Offerings of Incense**\n**Three Offerings of Incense for the Name Change**\n\nWith devotion, first,\nsecond,\nthird,\nthe incense ascends to the Primordial,\nthe Cavern-Heaven,\nthe Abyssal Spring Palace,\npervading the Three Realms of the Primordial,\nthe Cavern-Heaven Immortal Courts,\nthe Abyssal Spring Water Palaces—\nforming a radiant canopy of fragrant clouds.\n\nThe Venerables of the Three Realms of the Primordial,\nthe Lords of the Cavern-Heaven Immortal Courts,\nthe Lords of the Abyssal Spring Water Palaces.\n\n*End of the Central Scroll of the Jade Sound Ritual*\n\n**Opening the Scripture**\nThe Daoist assembly sits in even rows,\nraising the hymn of reverence.\nNext, the Three Refuges,\nthen the Seated Hymn of Exposition.\nRecitation proceeds according to ritual,\nthe petitioner announces the opening of the scripture.\n\n*Cloud Script of the Great Void,*\nat the dawn of kalpas,\nnow distant, now near,\nnow submerged, now afloat,\nwandering the Five Directions,\nover a zhang and more.\n\nThe Heavenly Perfected Sovereign took up his brush and inscribed,\nexpounding the Cavern Chapters,\nthen writing the numinous talismans.\nThe Primordial descended,\nthe true writ unfolded,\nluminous in its presence,\nobscure in its absence.\nSinking illness may heal itself,\nworldly toil and drowning may be uplifted.\nThe hidden and the manifest, the living and the dead—\nthus may one ascend to the Immortal Capital.\n\nThose who utter this supreme vow:\ntoday, as we ascend the scripture dais,\nwe reverently dedicate this to [Name],\nto augment and extend their years,\nto bring peace and vigor to their person.\nThrough all the hours to come,\nmay good fortune and harmony prevail.\n\nWe pray that the Eastern Flower bestow longevity,\nthat the Southern Culmen extend life.\nMay blessings be as deep as the sea,\nmay lifespan be as enduring as the mountains.\nFor this cause, we invoke:\nthe Heavenly Worthy of Boundless Blessings,\nthe Heavenly Worthy of Extended Longevity,\nthe Heavenly Worthy of Longevity and Life-Preservation—\nimmeasurable, inconceivable merit and virtue.\n\n*Opening the Ritual for the Scripture*\n*Upon completing the recitation of the precious scripture...*\n\nNext, we raise the hastened chant of \"Stepping Through the Void,\"\nthe intonation of scripture-praise.\n\nConsider well: the Three Caverns’ precious scriptures are the sacred models of the myriad heavens.\nThey weave the wondrous *qi* into soaring flight,\nand form the dragon-script of the Great Brahmā.\nTheir meaning spans the floating lives of mortals,\ntheir text endures through eternal kalpas.\nThus, heaven and earth, receiving them, divide and take their places;\nsun and moon, by them, revolve and move.\nGhosts and spirits, revering them, transform and adapt;\nhumans, upholding them, attain flourishing peace.\n\nTherefore, those who chant them ascend in form to the crimson empyrean;\nthose who hear them rise in body to the azure firmament.\nNone fail to look up to them in awe—human and celestial alike—\nor to rely upon them for life and transformation.\nThey are the bridge and beam for all beings,\nthe door and window for the host of perfected ones.\nWhat cannot be spoken of in words—\nis this not the treasury of the Great Vehicle’s scriptures?\n\nHitherto, we have offered this for the patron of today’s fast, [Name],\nreciting the scriptures of the Most High.\nIn this recitation, none fail to open the case and expound the profound,\ntheir resonance piercing the Three Heavens;\nto grasp the scroll and chant aloud,\ntheir voices heard in the Nine Realms below.\n\nWe pray that the golden lads attending incense\nweave fragrant characters in the midst of heaven;\nthat the jade youths in charge of scriptures\npresent the sacred texts upon the tablets.\nThus may past transgressions from former kalpas be dissolved,\nand blessings descend upon this day.\nMay the living and the dead alike receive the grace of flourishing peace,\nand all creatures, moving and still, feel the power of life and growth.\nRiding this wave of good fortune,\nmay all be adorned with splendor.\nMay the Three Paths cease their torments of bitterness,\nand the Nine Nights end their pangs of sorrow.\nEven unto the most distant and humble,\nand all the teeming multitudes of beings—\nmay all board the vessel of the Six Perfections,\nand together ascend the shore of the Three Clarities.\n\nThe assembly, in reverent devotion,\nhears the scriptures and joins in praise.\n\n*Next, upon hearing the scriptures, gather them by hand and conclude the sitting in praise.*\n*Next, recapitulate the preceding.*\n\nThe merits of the scripture recitation just completed,\noffered up to the perfected sages,\npray for protection and peace,\nshared in the power of good deeds,\nto realize the supreme Dao—\nall bow in faith and reverence.\n\n*Next, the turning toward.*\n\nHeaven’s clouds swirl in the Milky Way,\nweaving true *qi* into scripture;\nearth’s jade cases open,\nrevealing numinous texts to the world.\nTheir merit matches the workings of creation,\ntheir benefits extend to humans and celestials alike.\nThe recitation of the Most High’s true scriptures,\nthe invocation of the Heavenly Worthies’ sacred names,\nthe vocal praise of the ritual’s merits—\nboundless are the excellent causes thus planted.\nWe dedicate this for [Name]’s intention,\nhumbly praying as follows:\n\n*The Yellow Register’s Opening Scripture Text*\nThe Daoist assembly sits in peace.\n*Raise the Hymn of Reverence*\n*Next, the Three Refuges*\n*Next, the Seated Praise*\n*Recite and intone as prescribed*\n*The Intendant announces the opening of the scriptures.*\n\nTowers of kalpas’ height,\nfragrant clouds and plain canopies.\nWondrous is the Primordial Beginning,\nwhose all-penetrating vision knows no bounds.\nAll the great sages of the heavens\ngather as one.\nThe Numinous Treasure unfolds its chart,\nthe Fengdu courts adjourn their trials.\nThe golden register and white tablets,\nthe Nine Perfected’s wondrous precepts—\nthese are the bridge and beam\nto transcend the Three Realms.\n\nToday, ascending the scripture dais,\nwe turn and recite the immortal scriptures.\nWe now make this vow:\nfor the patron of this Yellow Register fast, [Name],\nwe pray for the deliverance of the departed soul of [Name],\nto ascend to the immortal realms.\nHumbly we pray:\nmay the Vermilion Mound redeem their life,\nmay the Golden Gates transform their form.\nRoaming freely in bliss, unbound,\nfollowing their wishes to be reborn in ease.\n\nWe invite the assembly, with one voice and heart,\nfor this cause to invoke:\nthe Heavenly Worthy of Great Unity Who Saves from Suffering,\nthe Heavenly Worthy Who Delivers from the Nine Hells,\nthe Heavenly Worthy of the Great Bridge of Deliverance,\nthe Heavenly Worthy Who Transcends the Three Realms,\nthe Heavenly Worthy of Free and Joyous Roaming—\nimmeasurable, inconceivable merit and virtue.\n\n*Opening the Ritual for the Scripture*\n*The August Void Emperor’s name is intoned; the precious scriptures are recited in turn, awaiting their completion.*\n\nWith hastened steps and celestial hymns, we raise the *Biaobai* of the *Bu Xu* and intone the *Lingbao Sutra* in praise.\n\nWe reverently recall: since the Primordial Beginning of the ancestral kalpas, the myriad heavens were brought forth, unfolding the empty songs of the Azure Vault and illuminating the lush radiance of the Purple Void. The Three Luminaries were revealed to universally nurture the divine spirits; the Five Chapters were spread to safeguard and govern the kalpic destinies. Some sit upon lion thrones, others enter the heart of jeweled pearls—ten thousand sages descend in state, hosts of perfected ones attend in assembly. These are the hidden melodies of the heavens, not the common words of the mortal world. Naturally sacred verses, thus called profound and mysterious: recited once, they resonate in unison; praised tenfold, they revive the withered bones. Their blessings are boundless, delivering countless souls.\n\nToday, the departed [Name], whose fate aligns with the time of extinction, has traversed the Palace of Grand Yin. Though their immortal rank remains unfulfilled, who would say their spirit is but momentarily extinguished? They face the retribution of the Five Sufferings and Eight Difficulties, yet lack the thousand harmonies and myriad unions to attain perfection. We now rely on the burning of incense and the recitation of scriptures, still hoping to restore their form and raise them from death.\n\nWe humbly pray: may the Mandate of the Primordial Beginning and the hymns of the Demon Kings ascend to the heavens, universally proclaimed across the Three Realms. Let them soar through the Five Portals, merging with the hundred spirits. May evil roots be eradicated, sin records swiftly expunged. Rescue those on the brink of death, snatching them from annihilation to be reborn; may their souls ascend in due time, their spirits purified and rectified. Grasping the talismans and holding the registers, may they preserve their lives and regenerate their roots. Through tenfold revolutions of the Wheel of Return, may the deceased souls undergo refinement, all attaining deliverance to become immortals, transformed into perfected beings. May this extend to the countless kalpas of kindred, and below, to the suffering souls of the netherworld—all ascending to immortal ranks, forever freed from servitude to the ghostly officials.\n\nMay the Three Paths, Five Sufferings, and Eight Difficulties be eternally transcended, rising above the Three Realms to roam freely in the Highest Clarity.\n\nNext, we pray for the sponsor of this fast, [Name], and their household: may they encounter the Dharma, become noble persons, their bodies radiant with light, untouched by demonic interference. May the myriad spirits pay homage, their names inscribed in the Upper Clarity. May the assembly, with utmost devotion, hear the scriptures and join in praise.\n\n**Recitation of the *Scripture of Salvation* and Dedication of Merit**\nThe sacred writ of the Primordial Beginning, the hidden melodies of the heavens—\nwith one voice we chant and recite:\na single word dissolves the transgressions of ten thousand kalpas;\nwith diverse voices in unison, ten recitations deliver the Nine Hells from suffering.\n\nThe recitation of the *Wondrous Scripture of the Limitless Salvation, Upper Chapter* now concluded, we invoke the sacred names of the Heavenly Worthies and extol the merit of this ritual. Boundless auspicious causes are dedicated to the sponsor of this Yellow Register Fast, [Name].\n\nWe humbly pray: may their six senses be purified, attaining rebirth in the Land of Ripened Grain. Through hearing the scriptures, may their single nature become perfectly luminous, entering the Jeweled Pearl to realize fruition.\n\n**Recitation and Contemplation of the *Scripture of Salvation* with Dedication of Merit**\nThe middle chapters of the sacred writ can rescue those from the Three Paths of suffering;\nthe upper chapters of this scripture can elevate the souls of the Nine Nights.\n\nThe recitation of the *Wondrous Scripture of the Limitless Salvation, Upper Chapter* now concluded, we invoke the sacred names of the Heavenly Worthies and extol the merit of this ritual. Boundless auspicious causes are dedicated to the sponsor of this fast, [Name].\n\nWe humbly pray: may they ascend to the Vermilion Palace, relying on the hidden melodies of the hundred demons; may they be nobly reborn in the immortal Dao, rising together with their seven ancestors.\n\nWe humbly pray: bearing the true talismans of the Primordial Beginning, may the deceased souls undergo refinement; hearing the hidden words of the Great Brahma, may they be transformed into immortals.\n\nWe humbly pray: may the hosts of perfected ones witness this deliverance, may the ranks of sages bestow compassion—may the deceased souls be refined to be reborn, may alien bones become kin and attain transcendence.\n\nWe humbly pray: may those already delivered be refined and transformed into immortals; may those yet unborn be reborn, escaping the evil destinies.\n\n**Invocation of the Heavenly Worthies of the Twenty Directions**\nEast: Heavenly Worthy of Numinous Treasure, Heavenly Worthy of the Limitless Supreme Numinous Treasure of the East.\nSouth: Heavenly Worthy of Numinous Treasure, Heavenly Worthy of the Limitless Supreme Numinous Treasure of the South.\nWest: Heavenly Worthy of Numinous Treasure, Heavenly Worthy of the Limitless Supreme Numinous Treasure of the West.\nNorth: Heavenly Worthy of Numinous Treasure, Heavenly Worthy of the Limitless Supreme Numinous Treasure of the North.\nNortheast: Heavenly Worthy of Numinous Treasure, Heavenly Worthy of the Limitless Supreme Numinous Treasure of the Northeast.\nSoutheast: Heavenly Worthy of Numinous Treasure, Heavenly Worthy of the Limitless Supreme Numinous Treasure of the Southeast.\nSouthwest: Heavenly Worthy of Numinous Treasure, Heavenly Worthy of the Limitless Supreme Numinous Treasure of the Southwest.\nNorthwest: Heavenly Worthy of Numinous Treasure, Heavenly Worthy of the Limitless Supreme Numinous Treasure of the Northwest.\nAbove: Heavenly Worthy of Numinous Treasure, Heavenly Worthy of the Limitless Supreme Numinous Treasure of the Above.\nBelow: Heavenly Worthy of Numinous Treasure, Heavenly Worthy of the Limitless Supreme Numinous Treasure of the Below.\n\n**Invocation of the Five Stars and Repentance**\nHeavenly Worthy of True Light Universal Illumination, August Perfected Great Sage of the Solar Palace, the Solar Sovereign.\nHeavenly Worthy of Wisdom Light Radiant Illumination, August Perfected Great Sage of the Lunar Palace, the Lunar Sovereign.\nHeavenly Worthy of Flowing Light Splendid Illumination, the True Lords of the Southern Asterism, Northern Dipper, Jade Armillary, and all the Luminaries.\nHeavenly Worthy of the Abyssal Samādhi, the Great Emperor of the Vermilion Grove and Cinnabar Forest of the Water Palace.\nHeavenly Worthy of the Sacred Scriptures of the Ten Directions, the Most True and Supreme Thirty-Six Divisions of the Venerable Scriptures.\n\n**Invocation of the Five Peaks and Repentance**\nHeavenly Worthy of the Eastern Flowery Upper Minister, True Lord of the Azure Emperor of Mount Tai, the Eastern Peak.\nHeavenly Worthy of the Southern Palace Refinement, True Lord of the Vermilion Emperor of Mount Heng, the Southern Peak.\nHeavenly Worthy of the Western Numinous Treasure Virtue, True Lord of the White Emperor of Mount Hua, the Western Peak.\nHeavenly Worthy of the Northern Primordial General Examination, True Lord of the Black Emperor of Mount Heng, the Northern Peak.\nHeavenly Worthy of the Central Yellow Emperor and the Two Heavens, True Lord of the Yellow Emperor of Mount Song, the Central Peak.\n\n**Order of Day and Night Invocations**\nDaytime invocations begin in the East, followed in this order:\nEast, South, West, North, Northeast,\nSoutheast, Southwest, Northwest, Above, Below.\n\nNighttime invocations begin in the North, followed in this order:\nNorth, Northeast, East, Southeast, South,\nSouthwest, West, Northwest, Above, Below.\n\n**Concluding Invocation of the Pure Offering**\nWe, the assembly, with sincere hearts, take refuge in the Azure East, the White West, the Vermilion South, the Dark North, the four cardinal directions, above and below, the Limitless Dao of the Ten Directions, the Heavenly Worthy of Numinous Treasure, the Heavenly Lords of Brahma-qi, and the divine officials of the Ten Lands.\n\nHaving completed the rites, we humbly confess our transgressions.\n\n**General Invocation of the Yellow Register**\nWe, the assembly, with sincere hearts, take refuge in the Azure East, the White West, the Vermilion South, the Dark North, the four cardinal directions, above and below, the Limitless Dao of the Ten Directions, the Heavenly Worthy of Numinous Treasure, the Boundless Realm of Dongyin-Shuo-Dan-Yu-Jue, the Supreme Dark Emperor of the Northern Frontier of Void and Nothingness, the Lords of the Five Qi, the Great Emperor of Fengdu, the Ten True Lords of the Earthly Courts, the Sovereigns of the Nether Passes, and all divine officials and immortals.\n\nHaving completed the rites, we humbly confess our transgressions.\n\n**Invocation of the Ten Directions**\n**East:** The Limitless Heavenly Worthy of Numinous Treasure, the Lords of the Nine Qi, and all divine officials and immortals of the Eastern Land.\n*Nine bows.*\n\n**South:** The Limitless Heavenly Worthy of Numinous Treasure, the Lords of the Three Qi, and all divine officials and immortals of the Southern Land.\n*Three bows.*\n\n**West:** The Limitless Heavenly Worthy of Numinous Treasure, the Lords of the Seven Qi, and all divine officials and immortals of the Western Land.\n*Seven bows.*\n\n**North:** The Limitless Heavenly Worthy of Numinous Treasure, the Lords of the Five Qi, and all divine officials and immortals of the Northern Land.\n*Five bows.*\n\n**Northeast:** The Limitless Heavenly Worthy of Numinous Treasure, the Lords of Brahma-qi, and all divine officials and immortals of the Northeastern Land.\n*Two bows.*\n\n**Southeast:** The Limitless Heavenly Worthy of Numinous Treasure, the Lords of Brahma-qi, and all divine officials and immortals of the Southeastern Land.\n*Two bows.*\n\n**Southwest:** The Limitless Heavenly Worthy of Numinous Treasure, the Lords of Brahma-qi, and all divine officials and immortals of the Southwestern Land.\n*Two bows.*\n\n**Northwest:** The Limitless Heavenly Worthy of Numinous Treasure, the Lords of Brahma-qi, and all divine officials and immortals of the Northwestern Land.\n*Three bows.*\n\n**Above:** The Limitless Heavenly Worthy of Numinous Treasure, the Thirty-Two Heavenly Emperors, the Lords of the Twelve Qi of the Three Clarities and Three Realms of the Jade Capital of Mystery Metropolis and the Golden Towers of Purple Tenuity, and all divine officials and immortals of the Upper Land.\n*Twelve bows.*\n\n**Below:** The Limitless Heavenly Worthy of Numinous Treasure, the Ninefold Earthly Sovereigns, the Four Directors and Five Emperors, the Twelve Immortal Ministers, the Perfected of the Nine Palaces, the Immortals and Jade Maidens of the Boundless World, and all divine officials and immortals of the Lower Land.\n*Twelve bows.*\n\n**General Invocation of the Five Stars**\nWe, the assembly, with sincere hearts, take refuge in the Palace of the Sun and the Mansion of the Moon, the Celestial Mechanism and all luminaries, the True Stars of the Zodiacal Paths, the Great Emperor of the Waters and Fusang, the Divine King of Yang Valley, the True Sovereigns of the Water Realms, the Treasured Scriptures of the Utmost Perfected, and all divine officials and immortals.\n\nHaving completed the rites, we humbly confess our transgressions.\n\n**Invocation of the Five Stars**\n**Palace of the Sun:** The Utmost Perfected Great Sage of the Solar Palace, the Radiant August Perfected of the Sun’s Center, the Youth of Great Light, the Jade Maiden of Cinnabar Clouds, and all divine officials and immortals of the Solar Palace.\n*Three bows.*\n\n**Mansion of the Moon:** The Utmost Perfected Great Sage of the Lunar Palace, the August Sovereign of the Moon’s Center, the Lady of Plain Splendor, the Youth of Rounded Light, the Jade Maiden of Scattered Radiance, and all divine officials and immortals of the Lunar Palace.\n*Seven bows.*\n\n**Celestial Mechanism:** The Southern Asterism and Northern Culmen, the Celestial Mechanism and all luminaries, the Three Terraces and Seven Stars, the Twenty-Eight Constellations, the Great Spirits of the 365 Zodiacal Paths, and all divine officials and immortals of the Stellar Palaces.\n*Nine bows.*\n\n**Waters and Fusang:** The Great Emperor of the Waters and Fusang, the Divine King of Yang Valley, the Water Emperors of the Three Rivers, Four Seas, and Nine Streams, the Water Sovereigns of the Twelve Sources, and all divine officials and immortals of the Water Realms.\n*Twelve bows.*\n\n**Sacred Scriptures:** The Utmost Perfected and Supreme Thirty-Six Divisions of Venerable Scriptures, the Jeweled Treasuries of the Heavens, the Orthodox Dharma of the Ten Directions, the Guardians of the Canon, and all divine officials of the numinous administrations.\n\n*Three bows.*\n\n**Five Peaks:** We, the assembled, wholeheartedly devote ourselves to the Five Peaks and Five Mountains, the True Lords of the Five Emperors, the Flying Immortals and Perfected Ones, and all divine officials and immortals of the sacred mountains and grotto-heavens who have attained the Dao.\n*Bows completed, reverently repent.*\n\n**Invocation of the Five Peaks:**\n**East Peak, Mount Tai:** The Azure Emperor True Lord, Flying Immortals and Perfected Ones, and all divine officials and immortals of the sacred mountains and grotto-heavens who have attained the Dao.\n*Nine bows.*\n\n**South Peak, Mount Heng:** The Vermilion Emperor True Lord, Flying Immortals and Perfected Ones, and all divine officials and immortals of the sacred mountains and grotto-heavens who have attained the Dao.\n*Three bows.*\n\n**West Peak, Mount Hua:** The White Emperor True Lord, Flying Immortals and Perfected Ones, and all divine officials and immortals of the sacred mountains and grotto-heavens who have attained the Dao.\n*Seven bows.*\n\n**North Peak, Mount Chang:** The Black Emperor True Lord, Flying Immortals and Perfected Ones, and all divine officials and immortals of the sacred mountains and grotto-heavens who have attained the Dao.\n*Five bows.*\n\n**Central Peak, Mount Song:** The Yellow Emperor True Lord, Flying Immortals and Perfected Ones, and all divine officials and immortals of the sacred mountains and grotto-heavens who have attained the Dao.\n*Twelve bows.*\n\n**Bowing to the Ten Directions:** Wholeheartedly devote ourselves and bow to the East, the Boundless and Utmost Venerable Numinous Treasure Heavenly Worthy.\nWholeheartedly devote ourselves and bow to the South, the Boundless and Utmost Venerable Numinous Treasure Heavenly Worthy.\nWholeheartedly devote ourselves and bow to the West, the Boundless and Utmost Venerable Numinous Treasure Heavenly Worthy.\nWholeheartedly devote ourselves and bow to the North, the Boundless and Utmost Venerable Numinous Treasure Heavenly Worthy.\nWholeheartedly devote ourselves and bow to the Northeast, the Boundless and Utmost Venerable Numinous Treasure Heavenly Worthy.\nWholeheartedly devote ourselves and bow to the Southeast, the Boundless and Utmost Venerable Numinous Treasure Heavenly Worthy.\nWholeheartedly devote ourselves and bow to the Southwest, the Boundless and Utmost Venerable Numinous Treasure Heavenly Worthy.\nWholeheartedly devote ourselves and bow to the Northwest, the Boundless and Utmost Venerable Numinous Treasure Heavenly Worthy.\nWholeheartedly devote ourselves and bow to the Above, the Boundless and Utmost Venerable Numinous Treasure Heavenly Worthy.\nWholeheartedly devote ourselves and bow to the Below, the Boundless and Utmost Venerable Numinous Treasure Heavenly Worthy.\n\n*Bell sounded, bows completed, all kneel in reverence to repent.*\n\nWe, the ritual assembly, wholeheartedly devote our bodies, spirits, and lives to the Boundless Dao of the Ten Directions and the Utmost Venerable Numinous Treasure Heavenly Worthy.\nWe have heard that the Primordial One established the teachings, ever-pure and tranquil as their foundation;\nThe vast heavens receive sincerity, for without purification and covenant, they do not respond.\nTo move the sagely ones above, we first purge even the slightest blemish.\nFollowing the sacred rites, we are permitted to repent.\n\nAt this moment, as incense is offered and the perfected are revered, we bow to the sages and repent.\nToday, the host of this rite, [Name], together with all family members, young and old, from past lives to this present existence—\nwhether through the three karmas of body, speech, and mind, or the six senses—\nhave committed manifold transgressions, boundless and immeasurable.\nWe beseech their dissolution and humbly pray for universal pardon.\n\nMay the sagely ones of the Ten Directions bestow their illuminating grace;\nMay the immortals of the Three Caverns grant the blessing of long life.\nLet misfortunes sink into the Nine Earths, and blessings arise from the Ten Directions.\nWe, the assembly, wholeheartedly prostrate ourselves, bowing in gratitude to the Utmost, Orthodox, and True Three Treasures.\n\n**Eleven Luminaries:** Wholeheartedly devote ourselves and bow in faith to the Solar Emperor Lord of the Sun Palace.\nWholeheartedly devote ourselves and bow in faith to the Lunar Sovereign Lady of the Moon Palace.\nWholeheartedly devote ourselves and bow in faith to the Wood Virtue Star Lord of the East.\nWholeheartedly devote ourselves and bow in faith to the Fire Virtue Star Lord of the South.\nWholeheartedly devote ourselves and bow in faith to the Metal Virtue Star Lord of the West.\nWholeheartedly devote ourselves and bow in faith to the Water Virtue Star Lord of the North.\nWholeheartedly devote ourselves and bow in faith to the Earth Virtue Star Lord of the Center.\nWholeheartedly devote ourselves and bow in faith to the Intersection-Initiating Rāhu Star Lord.\nWholeheartedly devote ourselves and bow in faith to the Intersection-Concluding Ketu Star Lord.\nWholeheartedly devote ourselves and bow in faith to the Celestial Unity Purple Qi Star Lord.\nWholeheartedly devote ourselves and bow in faith to the Grand Unity Moon Comet Star Lord.\n\n*Bell sounded, bows completed, all reverently devote themselves and repent.*\n\nWe, the ritual assembly, wholeheartedly devote our bodies, spirits, and lives to the Eleven Luminaries, the August Star Lords of the Empyrean.\nThey grasp the pivot of the Dao, wielding the authority of flourishing transformation.\nThey govern the changes of yin and yang, and turn the power of nurturing creation.\nResponsive to all entreaties, no hidden matter escapes their illumination.\n\nAt this moment, as incense is offered and the perfected are revered, we bow to the sages and repent.\nToday, the host of this rite, [Name], together with all family members, young and old, from past lives to this present existence—\nfearing the accumulation of transgressions and the entanglement of calamities—\nwhether through the three karmas of body, speech, and mind, or the six senses—\nhave committed manifold transgressions, boundless and immeasurable.\nWe beseech their dissolution and humbly pray for universal pardon.\n\nMay the Solar Emperor bestow grace, the Lunar Sovereign confer blessings;\nMay the Wood Virtue and Metal Brilliance grant protection, the radiant Fire and luminous Water flow with auspiciousness;\nMay the Earth Virtue shield and secure, Rāhu and Ketu dispel misfortune and bring fortune.\nMay the Celestial Unity Purple Qi augment our years, and the Moon Comet Star Lord not descend upon our destinies.\nLet misfortunes sink into the Nine Earths, and blessings arise from the Ten Directions.\nWe, the assembly, wholeheartedly prostrate ourselves, bowing in gratitude to the Utmost, Orthodox, and True Three Treasures.\n\n**Thirteen Invocations:** Bow in faith to the Utmost Great Luo Heaven, the Jade Clarity Sacred Realm, the Primordial Heavenly Worthy.\nBow in faith to the Utmost Great Luo Heaven, the Highest Clarity True Realm, the Utmost Jade Dawn Great Dao Lord.\nBow in faith to the Utmost Great Luo Heaven, the Grand Clarity Immortal Realm, the Primordial Lord of the Mixed Teaching.\nBow in faith to the Highest Nine Qi Heaven, the Eastern Utmost Venerable Numinous Treasure Heavenly Worthy.\nBow in faith to the Highest Three Qi Heaven, the Southern Utmost Venerable Numinous Treasure Heavenly Worthy.\nBow in faith to the Highest Seven Qi Heaven, the Western Utmost Venerable Numinous Treasure Heavenly Worthy.\nBow in faith to the Highest Five Qi Heaven, the Northern Utmost Venerable Numinous Treasure Heavenly Worthy.\nBow in faith to the Highest Fiery Qi Heaven, the Northeastern Utmost Venerable Numinous Treasure Heavenly Worthy.\nBow in faith to the Highest Fiery Qi Heaven, the Southeastern Utmost Venerable Numinous Treasure Heavenly Worthy.\nBow in faith to the Highest Fiery Qi Heaven, the Southwestern Utmost Venerable Numinous Treasure Heavenly Worthy.\n\nBow in faith to the Highest Fiery Qi Heaven, the Northwestern Utmost Venerable Numinous Treasure Heavenly Worthy.\nBow in faith to the Highest One Qi Heaven, the Upper Utmost Venerable Numinous Treasure Heavenly Worthy.\nBow in faith to the Ninefold Dark Abyss, the Lower Utmost Venerable Numinous Treasure Heavenly Worthy.\n\nNext, with the sounding of the chime, bow and touch the ground, each with utmost sincerity, reverently repenting and submitting:\nWe, the assembled disciples, wholeheartedly offer our bodies, spirits, and lives in devotion.\nTo the Three Purities and Three Realms, the Venerable Ones of golden countenance and jade visage;\nTo the Ten Poles and Ten Floral Splendors, the Sages of bud-palace and gemmed-pavilion sanctuaries.\n\nWe have heard that when the turning of the kalpa began and the imperial order arose, the ritual emerged from the Great Ultimate.\nBefore Heaven and before Earth, it nurtured the human order;\nWithout form and without appearance, it is forcibly named the Great Dao.\nWe humbly beseech Your boundless compassion to deeply bestow Your grace upon us and universally descend Your vast benevolence.\n\nTonight, at midnight, we burn incense to pay homage to the Perfected, bow to the Sages, and repent.\nOn this occasion, the master of the rite, so-and-so, together with all family members, young and old,\nfrom past lives to the present existence, fearing the accumulation of transgressions and the entanglement of karmic retribution,\nwhether through the three karmas of body, speech, and mind, or the six senses, have committed manifold errors and offenses, boundless and immeasurable.\nWe beseech that all be dissolved and forgiven.\n\nWe pray that the Three Pure Highest Sages bestow flourishing auspiciousness;\nThat the Ten Poles’ exalted Perfected Ones grant abundant blessings of great felicity.\nMay calamities sink into the Nine Earths, and blessings arise from the Ten Directions.\nWith devoted hearts, we bow our heads and prostrate, giving thanks to the Supreme Right and True Three Treasures.\n\nFourfold Vows:\nMay the Great Dao flourish and spread, the scriptures and teachings flow abundantly—with devoted hearts, we bow to the Right and True Three Treasures.\nMay the world enjoy great peace, yin and yang harmonize in order—with devoted hearts, we bow to the Right and True Three Treasures.\nMay the present emperor’s sagely longevity be boundless, his wisdom equal to the twin luminaries—with devoted hearts, we bow to the Right and True Three Treasures.\nMay the master of this rite today purify the six senses and attain the five blessings—with devoted hearts, we bow to the Right and True Three Treasures.\n\nFor the deliverance of the departed to be reborn in Heaven, and for the living to receive blessings:\nMay all sentient beings be freed from suffering and together attain the formless—with devoted hearts, we bow to the Perfected Saints of the Ten Directions who have attained the Dao.\nMay the assembly in this pure lecture hall awaken understanding and enlightenment, their Dao-power strengthened—with devoted hearts, we bow to the Perfected Saints of the Ten Directions who have attained the Dao.\n\nTaking Leave of the Three Treasures:\nThe time has passed, the night qi is serene.\nIncense fills the void, the great bell’s sound fades.\nThe Dao returns to the Golden Gates, the scriptures repose in the Jade Casket.\nWe bow our heads and take leave of the Supreme Dao-Treasure.\nIncense disperses with the wind, ascending to the Great Clarity.\nNames are inscribed on golden tablets, recorded on jade slips.\nGolden Lads attend above, Jade Maidens present the petition.\nWe bow our heads and take leave of the Supreme Scripture-Treasure.\nThe Dao-altar is complete, the ritual affairs concluded.\nMay all sentient beings together ascend the shore of the Dao.\nWe bow our heads and take leave of the Supreme Master-Treasure.\n\nMay you, all sentient beings:\nRefrain from all evil, accept and uphold these teachings.\nDwell always in the Central Land, not falling into the border realms.\nReceive the grace of the Dao, and let the trials of Fengdu cease.\nWith devoted hearts, we bow and give thanks to the Perfected Saints of the Ten Directions who have attained the Dao.\n\nThe Dharma Master returns to concentrated contemplation, silently following the Dao.\nReturning to the Right Dao, we bow to the True Master, employing all adornments to bestow blessings upon the master of the rite.\nMay he attain longevity.\n(For a rite for the departed, say: May blessings aid the deceased, and may they attain transcendence.)\n\nWith harmonious voices, each reverently intones.\n\nWith devoted hearts, we bow our heads to the Supreme and Boundless Dao—whenever a vegetarian feast is held.\nWith devoted hearts, we bow our heads to the Supreme and Boundless Dao—whenever a three-day ritual feast is convened.\nWith devoted hearts, we bow to the True and Perfect Three Treasures, offering incense, chanting praises, proclaiming the memorial, and reciting the dhāraṇī for the blessed meal.\nWith devoted hearts, we take refuge in the Dao-Treasures of the Ten Directions, may all sentient beings and the departed spirits turn their minds toward this offering and pay reverence.\nWith devoted hearts, we take refuge and pay reverence to the Solar Emperor of the Palace of the Sun, invoking the Eleven Luminaries.\nWith devoted hearts, we take refuge and pay reverence, kindling the ritual lamps.\nWith devoted hearts, we first offer a pinch of incense, then three pinches of incense.\nWith devoted hearts, we bow in homage to the Supreme Numinous Treasure Heavenly Worthy of the East, invoking the directions.\nWith devoted hearts, we bow in homage to the Five Venerable Ones, invoking their presence.\nWith devoted hearts, we bow our heads and invoke the Divine Lads of the Five Directions.\nWith devoted hearts, we pay reverence to the Heavenly Lords of the Nine Qi of the East, reciting the Ten Invocations.\nWith devoted hearts, we perform the rites of repentance and reverence.\nWith devoted hearts, we invoke the departed on behalf of the master of the rite.\n\n**Daoist Hymns Composed by the Sage Emperor of Song**\n\n*Jade Clarity Melody (Ten Poems)*\nEarth dwells below, heaven above—all space is filled,\nMyriad forms and shadows spread through the eight directions.\nWho governs their function, unknown to all?\nCrimson clouds and cinnabar mists veil the Pure Capital.\n\nThe azure vault resounds with songs of millet-like pearls,\nThe ten directions surge into boundless emptiness.\nThe joy of hearing the scriptures defies description—\nNine-hued dragons soar, bearing the eight-litters of light.\n\nFeathered youths breathe forth mist not of this world,\nVerdant vapors linger before the emerald chamber.\nCreation is not gained from without—\nFrom one’s own root and origin arise the Three Heavens.\n\nImperial radiance ascends to the Jade Continent,\nLuminous truth gleams in layered towers amid floating purple clouds.\nThe triple-eight golden locks are undone—\nThe Boundless Void Sovereign reigns above.\n\nWhite jade talismans descend from the Purple Court,\nThree flourishes of the flowered banners summon the host of spirits.\nPlucking and chewing the azure stamens of emptiness,\nTheir five bodies radiate golden light like sun and stars.\n\nBeneath the Lianchang Terrace, the sea stirs its waves—\nOnly the lofty immortals who have attained the Dao may pass.\nLesser immortals strive in vain to follow,\nHearing from afar the harmonious songs of eight simurghs.\n\nFive-colored clouds gather in dense array,\nThe triple-three grotto gates open wide their jade doors.\nWhich Daoist master submits the vermilion memorial?\nJade maidens fly with the missive to the Supreme One.\n\nThe Three Primes of the Upper Realm, wondrous essences of subtle hue,\nIn the Crimson Palace, their immortal names have long been inscribed.\nFurther abiding in the Great Chaos, preserving the Feminine One,\nTheir cloud chariots, ethereal and feathered, bear them aloft.\n\nWithin the Palace of True Yang, qi lingers and drifts,\nAscending and descending the Three Palaces in secret passage.\nUnconcerned with the affairs of the floating world,\nThey ascend with the Five Venerable Ones to the Golden Terrace.\n\nThe Three Flowers and Great Simplicity arise of themselves,\nAmidst emptiness, the lotus blossoms glow resplendent.\nThe Crimson Chamber and Golden House hold vacant thrones,\nThe Lads of the Grand Tenuity descend to welcome them.\n\n*Upper Clarity Melody (Ten Poems)*\nIn the Purple Clarity Heaven, the Flowery Grove is nurtured,\nCrimson fruits on vermilion branches, leaves of deepest green.\nChewing the abundant blossoms, their bodies never age,\nGazing below, they watch the crow and hare exchange their light.\n\nThe Primordial Lord of the Eight Qi is named Azure Spirit,\nAdorned in brocade robes and crimson skirts, dwelling in the Jade City.\nHolding the imperial talismans, he oversees the registers of the Dao,\nDispelling worldly burdens to deliver all beings.\n\nThe August Person of the Highest Realm feasts in the Purple Empyrean,\nPlucking fragrant blooms, ever leading the eight soaring boughs.\nWithin and without, their bodies are as translucent as lapis,\nIlluminating the Three Paths, dissolving ten thousand sorrows.\n\nIn the Nine-Day Palace, the Four Venerable True Ones,\nOn the Broad Radiance Mountain, they banquet with immortal guests.\nStriking bells and plucking zithers, they partake of divine wine—\nThe azure vault, suffused with warmth, holds a spring apart.\n\nFloating beyond the mountains, linked to the White Jade Capital,\nThe Golden Flower Tower gleams with the brilliance of the sun.\nThe Five Perfected gather the qi of the perfect pearl—\nTheir bones like jade, their forms like infants.\n\nBeneath the Peak of Resplendent Flowers lies the Fivefold Numinous Capital,\nThe Primordial Radiance Divine Lord wields the pivot of transformation.\nTrue fire, through its efficacy, creates and transforms,\nDissolving the five poisons, guiding them from the dark paths.\n\nResplendent and luminous, the nine wheels of the sun,\nIn the Six Abysses Palace, the Purple Primordial Lord.\nAdorned in rosy crowns and brocade robes, she sits in tranquil ease,\nDraped in auspicious mists, clad in scriptures of red.\n\nAuspicious qi, verdant and lush, veils the purple void,\nAzure essence feathered chariots bear the Primordial Lads.\nAgainst the wind, vast and mighty, for three thousand leagues,\nThe sevenfold returning incense wafts everywhere.\n\nIn the flowing and gurgling pool blooms the Great Treasure Lotus,\nIts ten-zhang blossoms reflecting in the spring.\nDrinking its fragrance and sipping its waters, free from hunger and thirst,\nGraceful and radiant, they are the immortals upon golden petals.\n\nThe towering rosy mountain stands in the Jade Void,\nThe Four Officiants, with crowns and swords, guard the Numinous Capital.\nThe host of perfected ones bow in homage, bearing celestial music,\nAt their waists, the jade tablets of the Immortal Emperor and the registers of ease.\n\n*Grand Clarity Melody (Ten Poems)*\nThe Great One Primordial Lord presides over the ranks of immortals,\nCrimson splendor and vermilion hues shine upon the magic fields.\nWhen merits are complete and encounters fulfilled, names are inscribed in the registers—\nHow could it be only Hong Ya who laughs and claps his shoulders?\n\nFive-jointed pure incense burns at midnight,\nHeavenly beings and jade maidens hear it from afar.\nIts savor blends with qi, resonating from afar,\nCrimson standards and rainbow banners descend upon five-colored clouds.\n\nThe Great Ultimate Primordial Lord rides a chariot of kingfisher plumes,\nTen thousand demons hasten to obey her divine talismans.\nNine dragons pace forth, all raising their heads,\nAt times, fire pearls are seen spitting in the void.\n\nWithin the Jeweled Blossom Palace, the seven-word verses are composed,\nEach of the Twelve True Lords bears a name.\nClouds escort the azure dragons back to the Fire Mansion,\nWind follows the white tigers forth from the azure sea.\n\nThe Golden Portal Bright Radiance Posterior Sage Lord,\nFlowing essence shines, forming cinnabar clouds.\nHad the Supreme One not transmitted it,\nHow could the mortal world possess the jade scriptures?\n\nPeaks of Primordial Radiance soar into the vast sky,\nLofty and transcendent, the immortal chambers rest amid the clouds.\nNinefold clouds transform, swiftly parting and merging,\nFeathered chariots drift and glide, boundless and unfathomable.\n\nThe Eastern Well cradles the essence of the luminous moon,\nA host of dragons stir, wielding golden jars.\nWhen did the immortals bathe and cleanse?\nOnly the crystal clarity shining through their bones is seen.\n\nVast and distant, the Three Fordings stretch to the Imperial River,\nRiver linked to crimson mist, mist merging with the heavens.\nThe Jade Spirit Immortal Mother roams and rests,\nHer attendants arrayed like the sun and moon’s chariots.\n\nThe Ninefold Numinous Jade Palace adjoins Kunlun,\nMountains divide the flowing nets, making kinship impossible.\nShe entrusts the purple orchids to convey her message—\nWhy exhaust your spirit in the red dust?\n\nLeft and right, the numinous consorts wield the cyclical signs,\nIn the Eight Scenic Palaces of the Jade Grove, they refine the essence of flowers.\nWhen the feast in the Perpetual Sun is concluded, where do they return?\nCasting fire and flowing gold, their tasks are accomplished.\n\n*Ten Poems on the White Crane*\nSpiritual birds born of transformation cry in the nine heavens,\nSnow-white plumage and cinnabar crowns, both resplendent.\nLet no one mistake them for those returning to the flowery pillars—\nThey come as auspicious omens of peace for a hundred million years.\n\nUpon the Jasper Terrace, winds hush as night begins its parting,\nCraning upward, their startled cries pierce the dew-drenched qi anew.\nBy Taiye’s pool they linger, unable to return—\nIn ages past, they were the qilin’s kin.\n\nGraceful, the numinous cranes descend to the Great Purity,\nJade towers and golden halls where dawn’s breeze lightly stirs.\nProud, they spurn the parrot’s company,\nNow and again uttering transcendent cries that soar beyond the world.\n\nTo the Three Mountains and azure seas, the path is not far—\nThey come as auspicious omens from the Purple Empyrean to the Celestial Capital.\nFrost and snow adorn their plumage, their nature like ice and jade,\nIn the depths of the Jasper Pool, they peck at numinous sprouts.\n\nPure essence of gold and fire manifests in their bearing,\nEver following the Queen Mother to feast at the Jasper Pool.\nBy night, at the jade altar’s rites, immortals descend—\nThey fly past Mount Gou, unseen by mortal eyes.\n\nThrough palaces of five-hued clouds, the *bu xu* chant lingers long,\nAs the Dipper turns in the jade firmament, night yet unending.\nWhite cranes arrive bearing tidings of fortune,\nTheir clear cries in unison trailing the fragrance of returning winds.\n\nA single clarion call echoes through the Nine Marshes,\nTheir bones refined, their spirits lightened through the depths of years.\nAcross the Liao Sea, common folk fail to recognize them—\nYet in the Great Brahma Heaven, they find kindred souls.\n\nWhite plumage gleams, immaculate against the frost’s splendor,\nCinnabar crowns distinct, outshining crimson cinnabar.\nFor sixteen hundred years, their divine qi has flourished,\nEver soaring and crying beside the jade immortals’ abode.\n\nWhen the Penglai assembly disperses and the immortals depart,\nFeathered chariots drift away as white cranes take flight.\nIn the Ming era, their auspicious presence became a familiar sight—\nWhy then invoke the *Yuefu* to sing of golden robes?\n\nJade palaces, profound, part the auspicious mists,\nFragrant winds yet unceasing, the cranes linger in flight.\nTheir wondrous forms stand apart from the Qingtian breed—\nSurely these are immortals arriving in succession.\n\n*Ten Poems on Scattering Flowers*\nScarlet staffs sway, guiding the way,\nHeavenly blossoms scatter and drift.\nLofty perfected ones remain unstained—\nPetal by petal, they cling not to robes.\n\nEightfold stairs spiral with jasper steps,\nA thousand flowers unfurl brocade’s glory.\nVerdant *ting* and purple *nai* bloom,\nResplendent, their names unknown.\n\nDelicate golden calyces,\nEven white jade petals.\nHeavenly winds follow the feathered chariots,\nBlowing through the ninefold city.\n\nGraceful, they coil through empty space,\nProfuse, they alight in the hall’s corners.\nEternal is their radiant splendor—\nWhere to seek the immortals’ realm?\n\nPure companions chant celestial hymns,\nEach praising the good.\nMyriad flowers arise in offering,\nDancing as they descend from heaven.\n\nJeweled leaves open in the *qipu* gardens,\nPrecious branches thrive in the Purple Tenuity.\nNo butterflies are permitted to pluck them—\nEver they soar with the colored *luan*.\n\nFor three thousand years in the sacred realm,\nThe immortal blossoms but once unfurl.\nHow then at the Golden Register’s convocation\nDo they all attend alongside the perfected?\n\nSeats extend for the wind-borne chariots,\nFragrant lamps illuminate the precious altar.\nWith hearts of cinnabar, what can we offer?\nShattered brocade scattered amid the clouds.\n\nEmerald and green in layered gradation,\nCrimson and yellow in shifting depths.\nThe Craftsman of Transformations must surely be lost—\nCarved and wrought, yet without intent.\n\nFrom the grotto’s censer, incense smoke rises,\nThe fragrance of the Dao and virtue, effortless.\nOf the same root, without differing qi,\nIts scent wafts more sweetly still.\n\n*Ten Chants of the Bu Xu*\nThe Great Ultimate divides high and profound,\nThe light and pure ascend to heaven’s domain.\nShould one cultivate the utmost Dao,\nThe body becomes a true immortal.\n\nTheir ranks number three thousand,\nTheir time spans forty thousand years.\nUpon the cinnabar terrace, the precious canon unfolds,\nFrom golden mouths, its transmission flows.\n\nThe Great Brahma, lord of the Three Heavens,\nThe Five Venerable Ones of the Void Emperor—\nEven they scarcely glimpse its subtleties,\nHow then could it be captured in mere words?\n\nUpon jeweled thrones within the golden hall,\nRadiant coronets illuminate the jade portals.\nMyriad perfected ones pay homage to the Emperor’s abode,\nFlying birds tread the roots of heaven.\n\nMisty as fine haze,\nGently trailing robes of gossamer,\nThey ascend with the auspicious smoke,\nLightly following the colored *fenghuang*.\n\nHaving attended the feast in the jasper chamber,\nSuddenly they point toward the grotto-heaven’s return.\nStanding by the Fusang’s shore,\nThey hasten toward the Sun God’s radiance.\n\nPacing the cloud-nets above,\nHeavenly winds suddenly blow.\nDrifting hems brush the Dipper’s handle,\nHolding fly-whisks, they bow to the banner of Shen.\n\nLions bear cinnabar tassels,\nQilin lead jade-green chariots.\nIn flight, they traverse the eight poles—\nHow often have they witnessed spring’s awakening?\n\nGreen locks beneath scarlet headbands,\nAzure auroras entwine their feathered robes.\nAt dawn, they hasten to the Yang Virtue’s hall,\nBy night, they arrive at the Moon’s Splendor gate.\n\nThey toy with the fires of the celestial sphere,\nConcealing and emerging like Lu Ji.\nThe jade chambers cannot detain them—\nThey soar once more toward the ninefold heavens.\n\nLong ago in the Hall of Extended Grace,\nAt midnight, the Nine August Ones descended.\nSix perfected ones divided left and right,\nYellow mists coiled around the eaves and corridors.\n\nWithin the vast palace, the divine lords were revered,\nImmortal soldiers guarded the Daoist sanctuary.\nNow the filial grandson inherits their resolve,\nInches away, he faces the numinous radiance.\n\nFollowing the precious canon’s true model,\nWith cinnabar sincerity, he petitions the heavens above.\nBefore the ice-like abyss, he stands among the multitudes,\nBy day and night, he brings forth peace and prosperity.\n\nAll things dispel their afflictions,\nFor three mornings, auspicious signs appear.\nThe *bu xu* chant now resounds,\nAs they intone the *Dongxuan* chapters.\n\nUpon the sacred land of the winding isles,\nThe majestic altar of myriad wonders stands.\nCrane-robed feathered guests arrive,\nDuck-slippered immortals descend.\n\nJade ( ) pours the primordial liquor,\nJade cases unveil the great elixir.\nWith utmost sincerity, how shall we pray?\nMay the four seas forever remain serene.\n\nWater is sprinkled to subdue demonic palaces,\nLamps illuminate the night’s treasury.\nThe winds of the nine heavens fall silent,\nThe qi of the four poles clears.\n\nWhistling, they chant the *Zhuling* melodies,\nSoaring through the White Jade Capital.\nWith utmost sincerity, how shall we pray?\nMay the nation’s fortune endure in eternal peace.\n\nAcross the Central Land, hymns resound afar,\nHuman voices naturally rise and fall.\nEmbracing emptiness, they return to the Dao and virtue,\nTheir cadences harmonizing with the palace’s tones.\n\nIncense smoke lingers in the halls,\nMoonlit dew chills the towers.\nWith utmost sincerity, how shall we pray?\nMay the harvests forever flourish and banish misfortune.\n\n*Xuanhe Continuation*\nLong chanting the jade tones of the *Jinque Bu Xu*,\nAt the dawn of blue-black primeval chaos,\nGolden incense weaves crimson smoke.\nAt dawn’s flight, all raise their reins,\nBowing before the Jade Emperor.\n\nThe Emperor’s heart, vast and at ease,\nBestows upon us the *Tai Ling* canon.\nThis is the indestructible Dao,\nBy which the myriad heavens uphold our authority.\n\nWe traverse the empty and cavernous,\nWhile lesser immortals grope in its depths.\n\n*Two Chants of the Bu Xu*\nThe latter composed upon expounding the *Imperially Annotated Daode Jing*, as immortal cranes gathered in flight.\n\nFrom the primordial of the one qi,\nVast, it preceded the Two Modes.\nPrecious chariots race like golden steeds,\nTrue incense sprays from jade lotuses.\n\nThrough the void, they rein in dragon steeds,\nBrahma tones guide the *zhipeng* chariots.\nEternally spanning the long spring kalpa,\nThey soar through the formless heavens.\n\nTo the initial perfected, it is hard to explain—\nThus we admonish the immortals of the middle ranks.\n\nLofty perfected ones elucidate the Dao and virtue,\nBequeathing to the world five thousand words.\nIn explanation, we humbly acknowledge our shallowness,\nYet with utmost sincerity, we fathom the wondrous origin.\n\n**Ten \"Pacing the Void\" Hymns of Jade Capital**\n\nNuminous banners array the sacred canons,\nFeathered hymns pierce the cloud-borne chariots.\nAuspicious cranes soar through the firmament,\nPropitious winds dispel summer’s vexing heat.\nThe vaulted heavens resound in echo,\nMay the jeweled throne endure for myriad years.\n\n---\n\n**I**\nBowing in reverence to the Most High,\nWe burn incense and return to emptiness.\nLuminous radiance follows our return,\nThe Dharma-wheel completes its triple revolution.\nThe Mysterious Origin flourishes in fourfold majesty,\nBlessings extend to kings and lords.\nSeven generations ascend to celestial halls,\nResplendent, their glory unfurls in brilliance.\n\n**II**\nWhistling songs crown the vast desert,\nHeavenly music delights our joy.\nEqual fragrance exalts supreme virtue,\nLesser immortals cannot compare.\nWondrous thoughts illumine profound awakening,\nIn throngs they ride the void in flight.\nChanting reaches \"blessings extend to kings and lords\"—\nthe character *hou* now concealed.\n\n**III**\nTurning, we tread the cloud-bound net,\nRiding the void, we pace the Mysterious Record.\nWe chant in praise of the Emperor Unity,\nA hundred meridians harmonize of themselves.\nBelow, we command the Eight Seas’ youths;\nAbove, we escort the lofty immortals.\nAll heavens scatter fragrant blossoms,\nA serene numinous wind arises.\nLong-held vows root destiny’s core,\nThus we attain the highest eminence.\nRejoicing before the Most High,\nEven ten thousand kalpas are but a beginning.\n\n**IV**\nTowering, the Mysterious Capital’s mountain,\nThe ten directions revere the August One.\nLofty, the Heavenly Treasure Terrace,\nIts radiance outshines the flowing sun.\nResplendent, the jade grove’s blossoms,\nVermilion fruits gleam in dazzling splendor.\nEver mindful to feast on primordial essence,\nRefining the elixir to solidify form and substance.\nGolden light scatters through the Purple Tenuity,\nProfound and serene, the Great Vehicle’s ease.\n\n**V**\nThe preceding hymn’s rhymes all in *zhen* tone,\nNo concealed characters.\nThus, when presented at court, it was chanted as one,\nThe full verse intoned in unbroken song.\n\n**VI**\nLooking up and down, we revere the Most High,\nResplendent scenes adorn the cinnabar field.\nGazing left, we grasp the Dark Standard;\nTurning right, we hold the Linked Florescence.\nSix Perfections crown the Brahma-conduct,\nVirtue and power renew with the sun.\nAccumulated blessings from past lives respond,\nHearing the scriptures as if meeting kin.\nHeaven-endowed with transcendent talent,\nWe delight in reciting the subtle and wondrous text.\nIn the void, the Supreme Harmony’s *qi*,\nExhaling and inhaling the radiant mist’s essence.\nEmbryonic breathing stills a hundred meridians,\nIn solitude, we fathom the Three Conveniences.\nThe Mud-Pill Palace gleams with luminous scenes,\nThus we become Golden Flower Immortals.\nDemon kings respectfully receive our charge,\nEnabling us to ascend all heavens.\nAll begins with fasting and precepts,\nLayered merits bind past-life verdure.\nSoaring through the Great Void,\nWe uplift the exalted ones.\nGuiding the reins to the ten directions,\nWe circle and rest on the Mysterious Radiance’s slope.\nGazing up at the Kalpa Terrace,\nLooking down upon the Purple Cloud Net.\nCarefree in the Most High’s capital,\nTogether we sit upon lotus blossoms.\n\n**VII**\nThrough accumulated study, we become Perfected,\nTranquil, our *ying* and *wei* harmonize.\nEternally enjoying boundless longevity,\nWhat are ten thousand kalpas but a trifle?\n\n**VIII**\nThe Great Dao’s master is profound stillness,\nAscending as immortals with the Peerless Hero.\nThe Noble Scion bestows the numinous talisman,\nThe Great One bears the Cavernous Scripture.\nRelics gleam with golden splendor,\nDragon-drawn chariots swiftly arrive to welcome.\nThe Heavenly Worthy gazes upon the cloud-borne carriage,\nFloating, floating, we ride the void in flight.\nFragrant blossoms fall like flying snow,\nMists and vapors enrich the Mysterious Beam.\nBowing our heads before the Golden Portal,\nWe lift our gaze to roam Jade Capital.\nThe Kāśa Tree graces the Round Radiance Garden,\nResplendent, the Seven Treasures’ grove.\nThree hundred celestial beasts in name,\nLions vast as ten thousand *xun*.\nFlying dragons pace and chant,\nDivine phoenixes sing in rhythmic harmony.\nNuminous winds fan wondrous blossoms,\nPure fragrance scatters upon our robes.\nWithout transcendent immortal talent,\nHow could one indulge such aspirations?\n\n**IX**\nWe array our nine-dragon carriage,\nRiding the void in carefree ease.\nThe Eight Heavens lie within our grasp,\nThe Six Directions—how could they be distant?\nAll Perfected chant the Cavernous Mystery,\nThe Most High sings a pure melody.\nFragrant blossoms scatter with the wind,\nJade tones form the Purple Empyrean.\nThe Five Sufferings burst forth at once,\nThe Eight Difficulties follow the scriptures’ emptiness.\nWondrous indeed, the Numinous Treasure’s preserve,\nRaising this great Dharma-bridge.\n\n**X**\nThe Celestial Emperor Unity’s palace,\nLush and radiant, crowns numinous glory.\nFlowing brilliance follows the Dharma-wheel’s net,\nTurning through the void into formlessness.\nThe Void Sovereign plucks the cloud-lute,\nAll Perfected recite the Cavernous Scripture.\nLofty immortals, solemn in hand-clasped praise,\nThrough endless kalpas, they preserve integrity.\nThe Utmost Perfected await nothing,\nAt times they rein in flying dragons.\nLong fasts convene in the Mysterious Capital,\nJade chimes resound, striking crystal bells.\nThe Ten Blossoms’ immortals gather,\nPurple mists coalesce into a palace.\nJeweled canopies array the Most High,\nPerfected Ones hold lotus blossoms.\nScattering flowers, we declare our vows,\nGrasping the tally, we subdue demon kings.\nDharma-drums assemble the host of immortals,\nNuminous chants—none differ.\nNeither this nor that—no fixed form,\nOur thoughts commune with the subtle and wondrous.\n\n---\n\n**Right: Ten \"Pacing the Void\" Hymns of Jade Capital**\n\nAccording to the *Scripture of Pacing the Void on Jade Capital Mountain of the Most High*: The Left Immortal Elder Ge Xuan of the Great Ultimate transmitted it to his disciple Zheng Siyuan on Mount Tiantai. Siyuan, in turn, passed it to the Elder’s grandnephew Ge Hong, known as the Master Who Embraces Simplicity. Master Zheng recounted that when the Immortal Elder passed away, he told Siyuan: \"The *Supreme Clarity Great Cavern Dao Scripture* you have received shall be entrusted to our family’s disciples, to be transcribed and transmitted through generations. Perfected Ones do not conceal the Heavenly Dao. Truly, the precious jade-casket secret canon’s value lies in its circulation.\" Moreover, the scripture’s preface records that all the great sagely Heavenly Worthies, emperors, lofty immortals, and Perfected Ones each observed fasts, upheld the Dharma, revered the title of the Void Sovereign Most High, burned incense, scattered flowers, and circumambulated the Seven Treasures’ Mysterious Terrace three times. Reciting and chanting the great hymn chapters of the Empty Cavern, when the Most High praised them, they sang and paced the void—its meritorious virtues profound and wondrous beyond exhaustive description.\n\nRespectfully following the fasting methods in the canon: for three days and nine dawns, within each dawn, ten hymns are sung to complete the cycle. During each dawn’s circumambulation, before the altar assembly proceeds, they first perform the bow of reverence to the Most High, chanting to the final line, then together intone the sound of praise, each bowing once. Next, they begin the circumambulation, treading the cloud-bound net, chanting in harmony. Then the altar assembly, stepping the *ding*-pattern, proceeds slowly. Upon reaching the final line, they together intone the sound of praise, each bowing once. After each hymn, they again intone the sound of praise, each bowing once. Alternatively, for a single day’s three dawns, the ten hymns may be completed within them. The first circumambulation begins with the bow of reverence to the Most High, chanting to the final line, then together intoning the sound of praise, each bowing once. The second circumambulation begins with treading the cloud-bound net, continuing through \"Towering, the Mysterious Capital’s mountain\" as one hymn, chanting to the final line, then together intoning the sound of praise, each bowing once.\n\nThese two hymns, both in oblique tones, are thus chanted together as one. The third circumambulation begins with bowing low and reverently contemplating the Most High, chanting to the final line, then together intoning the sound of praise, each bowing once—this completes the dawn audience. The remaining six hymns are distributed within the noon and evening audiences, one hymn chanted per circumambulation. Thus, the ten hymns are fully completed within the three audiences, conforming to the proper rite for the full recitation of the *Yujing Shan* during the court audience.\n\nWhen chanting the *Step-Void Hymns*, should even one hymn be omitted, at the moment of ascending the altar to present the court audience and offer prayers, the sincerity of the heart may falter, making it difficult to be witnessed by the august and lofty perfected ones. In all ritual feasts, when ascending the altar to perform the Dao, it is only during the circumambulation and court audience of *Yujing Shan* that one must visualize the golden towers and jade palaces, beholding the sacred countenance of the deities. Only then may one pray for blessings and grace, dispel death and deliver life.\n\nWhat we now observe in the transmission of the immortal elders is the very voice of Master Zheng. It is meant to be passed down to later generations, that they may follow the prescribed form. Having beheld what is recorded in the scriptures, how could one keep it sealed away? With reverence, it is carved into printing blocks to be shared with all. One must cultivate utmost devotion, casting aside all doubt, that one may receive the protection of the sages and together partake in blessings and fortune.\n\n**Radiant and Luminous**\nRadiant and luminous, soaring high,\nThe ancestral breeze traverses the mysterious.\nThe Primal Beginning unfolds the circle,\nDispersing the five chapters.\nThe vermilion script of the sacred register,\nEnwrapped by yellow clouds on four sides.\nThe eight mights stand guard,\nSpirit beasts attend the perfected.\nResplendent light adorns the hair,\nReflected incense brushes away dust.\nThe embroidered confluence stretches long,\nCircumambulating past the ten heavens.\nChanting aloud the *Kongdong*,\nTreading the *zheng*-step into the profound.\nWithered souls ascend to yang,\nAshen bones return to humanity.\nThe spirit sovereign delivers destiny,\nRiding the void, mounting the mist.\nIn reverent recitation of the *Dong* chapters,\nOne’s years equal the kalpas.\n\nAbove: *Radiant and Luminous* and *Ancestral Office*—the *Dao Sutra of the Heavenly Thearch* from the *Kongdong* sacred hymns. Each of the thirty-two heavens has its own hymn, some in four-character lines, others in five. See the *Kongdong* sacred hymns in the *Dongyuan* section of the *Lingbao* canon.\n\n**Hymn of Upholding the Precepts**\nThe Dao is the heartless origin,\nAll things become fields of merit.\nEstablishing merit has no fixed lord,\nEach vow arises from the person.\nEmptying the self to respond to sentient beings,\nAn open heart leaves none unequal.\nThe great sages exalt the supreme teaching,\nJust as rain falls from the heavens.\nLofty peaks embrace all without exception,\nYet the humble become profound.\nThe sea is king of a hundred rivers,\nFor it can forsake dragons and scales.\nThrough ten thousand kalpas, wisdom is preserved—\nHow could it be limited to one’s own years?\n\n**Hymn of Upholding the Precepts (continued)**\nTo uphold the precepts without momentary lapse,\nLife after life, good affinities are formed.\nWith focused thought, one contemplates the Great Vehicle—\nIn time, the truth of the Dao shall be embodied.\n\n**Three Invocations, Three Praises**\nDelight in the Dharma as one’s spouse,\nCherish the scriptures as pearls and jade.\nUphold the precepts to restrain the six senses,\nContemplate the Dao to dispel desires.\nIn tranquility, the upright qi abides;\nIn serenity, the spirit is still and silent.\nHeavenly demons all revere and protect,\nLife after life, great blessings are received.\nFlourishing are the household and kingdom,\nProspering are the scriptures and the Dao.\nHeavenly beings share this vow,\nIn subtle realms, one enters the Great Vehicle.\nFrom the heart, fields of merit are established,\nAs the Dharma wheel ascends in boundless ascent.\nSeven generations ascend to the heavens,\nWhile this body soars in broad daylight.\nThe great Dao abides in the profound void—\nWith thought, none fails to align.\nRefining the form to join the immortals,\nOne attains the adamantine body.\nTranscending the three realms’ trials,\nThe five sufferings of hell are dissolved.\nAll return to the Supreme Scriptures,\nIn silent contemplation, bowing in reverence.\n\n**Invocation for the Hall**\nTo cultivate the Dao, one must be steadfast and resolute,\nGathering faith to refine sincerity.\nBurning incense, one turns to the Supreme,\nTrue qi mingles with fragrant smoke.\nMay the great abundance be revealed,\nThat seven generations depart the dark underworld.\n\n**Hymn of the Ritual Fast**\nThe Dao takes fasting as its foremost practice,\nThrough diligent observance, one ascends the golden portals.\n\nThus is the great Dharma Bridge established,\nTo universally ferry all beings and creatures.\nRepaying the kindness and virtue of past lives,\nThe Dao-heart arises in transcendent clarity.\nThe body soars to the Mystic Capital,\nAnd the seven ancestors all attain liberation.\n\n**Hymn of Great Learning for Immortality**\nTo learn immortality, sever all ornate thoughts,\nEach念 intertwines and accumulates.\nComing and going disturb my spirit,\nWith restless agitation, nothing remains unscathed.\nDiminish thoughts, still the void and leisure,\nIn desolate emptiness, enter profound silence.\nSeek the scriptures as if parched with thirst,\nHold resolve firm as metal and stone.\nPreserve the child to traverse the Mystic Path,\nThe Five Spirits bestow the registers of passage.\n\n**Hymn of Lesser Learning for Immortality**\nTo learn immortality, action is urgent,\nUphold the precepts to restrain the heart’s passions.\nIn emptiness and equanimity, the true qi resides,\nWhere immortals and sages naturally converge.\nIf one does not trust the Dharma’s words,\nWhy dwell in the mountains and forests?\n\n**Hymn of the Burning Petition**\nThe worlds of humans and gods abound in obstacles,\nYet the great Dao truly pities and cherishes.\nSalvation and deliverance extend through teachings and disciplines,\nAll are enabled to repent their karmic entanglements.\nTransgressions fill the earthly courts,\nOffenses have reached the heavens.\nRevealing all, one prays for the true ones’ protection,\nWith a serene heart, one moves the sages and worthies.\nReverently bowing to the Three Treasures,\nMay one attain longevity and long years.\nThe burning petition ascends to the upper realms,\nNames are presented before the Jade Emperor.\n\n**Mountain Petition**\nPraying to the true ones, one ascends the Purple Peak,\nPresenting one’s mandate at the sacred mountain.\nJade maidens sway with the sound of Sanskrit,\nGolden lads offer fragrant incense.\nNames are inscribed to penetrate the nine earths,\nCharacters are arrayed to ascend the three heavens.\nMay one eternally enjoy boundless life,\nAnd accomplish the loftiest immortality.\n\n**Water Petition**\nThe Heavenly Worthy left the precepts,\nThe Most High expounded the true scriptures.\nTo uphold the Dharma, one must be diligent in resolve,\nMerit and virtue treasure the spirit’s essence.\nWith reverent heart, invoke the Three Treasures,\nBurn incense to announce to the hundred spirits.\nInscribe names and cast them into the water府,\nMeritorious deeds reach the Supreme Clarity.\nThe Heavenly Worthy left the great Dharma,\nTo broadly deliver those in the dark underworld.\nWhen the merit of the fast is complete,\nThe Dragon Petition announces to the spring courts.\nThe seven ancestors all attain liberation,\nMyriad blessings naturally converge.\nInscribe names and cast them into the water府,\nMeritorious deeds reach the Supreme Clarity.\n\n**Earth Petition**\nThe merit of the fast is accomplished,\nThe talismanic mandate announces at the sacred altar.\nJade tablets inscribe sincere devotion,\nGolden dragons swiftly transmit the pledge.\nWith reverent heart, one gazes toward the Central府,\nReturning life to the Yellow Circle.\nIn life and death, all find joy,\nAnd shall meet to bow before the celestial countenance.\nThe Crimson Radiance unfolds the Primordial Chart,\nHarmonious yang communicates with the upper spirits.\nJade mounds adorn the jasper palaces,\nMyriad traversals, the Dao naturally dwells.\nWithout the Yellow Register Petition,\nHow could the roots of suffering be eradicated?\nCircumambulating, recite the Cavern Chapters,\nThe Five Clouds naturally support one another.\nAligning and controlling, one opens the Mystic Ultimate,\nRiding the current to enter the Central Heaven.\nUnveiling the void, one offers the treasure of the heart,\nSubtly cultivating the field of the body.\nFrom the Solar Palace, harmonious qi disperses,\nIn the vast courtyard, the smoke of vows ascends.\nThe Earth Petition is beyond comprehension,\nBestowing blessings and grace without limit.\nThe Primordial Beginning transmitted the disciplinary teachings,\nThe lofty perfected expounded the Cavern Spirits.\nCinnabar writings radiate resplendent light,\nJade characters inscribe the spirit’s essence.\nWith reverent heart, invoke the Nine Heavens,\nThrough the fast, reach the myriad spirits.\nInscribe names and cast them into the earth府,\nThe body ascends to pay homage in the Jade Clarity.\n\n**Hymn of Wisdom**\nWisdom arises from the primordial beginning,\nBright and luminous, it transcends the ten directions.\nWeaving the void, it stands in the Mystic Empyrean,\nAll heavens draw from its flowing fragrance.\nIts wonders are beyond comprehension,\nThrough emptiness, true and real communicate.\nBeing is ultimately non-being,\nNon-being is not without non-being.\nWisdom constantly observes the body,\nIt is the foremost in learning the Dao.\nIn subtle subtlety, it roams the Mystic Expanse,\nNaturally recording my spirit.\nThe Heavenly Worthy ever protects and shelters,\nThe demon kings pledge their guardianship.\nResplendent is the adamantine body,\nTranscending all before the Most High.\nWisdom engenders the root of precepts,\nThe true Dao takes precepts as its master.\nThe Three Treasures arise from this,\nBestowed by the lofty immortals.\nBoarding this deathless vessel,\nSwiftly cross the great abundance.\nAt this moment of expounding the precepts,\nAll heavens bow in reverence.\n\n**Hymn of Bathing in the Eastern Well**\nThe Celestial River pours into the Eastern Well,\nStone radiance and the Water Mother’s essence.\nCircular light brushes the numinous brilliance,\nMystic reflections gleam with lofty clarity.\nThe Primordial Beginning parts the heavy night,\nHeavenly beings follow the moon’s birth.\nBathing atop the Orchid Pond,\nDragons bear the long-handled vase.\nGolden lads sprinkle fragrant water,\nJade maidens stream the Five Stars.\nCrowns and sashes gleam with jade essence,\nRefining and delivering the Five Immortals’ forms.\nThe body fragrant, myriad spirits descend,\nGrasping the radiance, one ascends to lofty clarity.\n\n**Incantation of the Pure Water for Delivering Souls**\nMajestic is the Dao and its virtue,\nMeritorious deeds have reached completion.\nDescending to receive and guide,\nThe Precious Master naturally accompanies.\nCompassionate and merciful, bestow the Dharma water,\nTo wash away delusion and ignorance.\nEternally deliver to the Three Clarities’ shores,\nForever departing the Five Turbidities’ mire.\n\n**Hymn of the Six Heavenly Penetrations**\nThe six penetrations of the heavenly perfected,\nThose who cultivate goodness.\nFor all these sentient beings,\nExpound the teachings without shame.\nThe Heavenly Worthy’s secret words,\nAt this time are heard and expounded.\nFaithfully accepting, each returns to refuge,\nBowing to the Supreme Worthy.\n\n**Hymn of Rebirth for Refining and Deliverance**\nThe vicissitudes turn like a wheel,\nThe camphor tree’s branches remain unchanged.\nWith a tranquil heart, contemplate the utmost truth,\nFollow the current, comply with separation and union.\nConstantly recite the jade chapters,\nMystic sounds pierce the clouds and rosy dawn.\nEternally enjoy boundless time,\nHow could one know the multitude of kalpas?\n\n**Hymn of Metal and Wood**\nFusang initiates the numinous movement,\nMetal and wood sprout verdant buds.\nWondrously, the Golden Mother flows,\nHarmonizing the natural blossoms.\nSpiritual qi congeals in the Primordial Palace,\nNuminous beings radiate crimson rosy clouds.\nNaturally attaining the human Dao,\nNames are recorded in the immortals’ lineage.\n\n**Three Verses of the Vermilion Mound, Yellow Flower, and Great Unity**\nTo the south, the Vermilion Mound府,\nIn the Cinnabar Heaven, flames flow through the courtyard.\nJade eyes refine the bodily form,\nInstantly returning to life.\nGreat Sage, Jade-Eyed Refiner of Forms, Heavenly Worthy.\n\nIn the Eastern Well’s Yellow Flower Pool,\nStone radiance and the Water Mother’s essence.\nYellow flowers sway the soul and form,\nInstantly renewing life.\nGreat Sage, Yellow Flower Swaying Forms, Heavenly Worthy.\n\nIn the Eastern Ultimate’s Realm of Eternal Joy,\nThe Azure Flower is called the Court of Blessings.\nFollowing the sound, deliver the suffering souls,\nInstantly departing to be reborn.\nGreat Sage, Great Unity Deliverer of Suffering, Heavenly Worthy.\n\n**Seven-Character Ancient Verse for Scattering Flowers**\nThe Southern Dipper glistens, the Northern Dipper shifts,\nAll stars shine brilliantly, the moon’s radiance gleams.\nThe Primordial Beginning transmitted words, all receive the registers,\nThe Dao Lord opened the teachings, all return to refuge.\nIn the Lesser Existence Grotto, the thousand-year herbs,\nOn the Jade Capital Mountain, the ten-thousand-year peaches.\nAt the Nine Dragons’ Gate, the perfected saints gather,\nBy the Eight Immortals’ Terrace, the void-traversing hymns resound.\nThree Perfected Jade Maidens hold the flower scepters,\nA pair of lads bear the golden censers.\nMoon mantles with pearls strung through nine-colored cords,\nCloud robes fragrant, permeating the six-pound hems.\n\n**Five-Character Verse for Scattering Flowers**\n\nLight reins ascend the Purple Clarity,\nPrimal steed outpaces racing lightning.\nFrom the three heavens of Langfeng,\nGazing down—still visible below.\n\nJade gates gleam in boundless radiance,\nJasper groves flourish in lush verdure.\nWithout tempered bones of gold,\nHow could one fulfill long-cherished vows?\n\nTrue brightness, how vast and deep,\nMerged with light, we roam and feast.\nThis rare gathering forgets time’s passage,\nA thousand years but a single glance.\n\nThe Three Palaces emit bright effulgence,\nShining as one with the luminous canopy.\nSwiftly the whirlwind carries us,\nUpward to pluck the void’s pure blossoms.\n\nGranting me a golden-hued cavern,\nBeyond heaven, my jade form gleams.\nMy heart aligns with the Great Void’s stillness,\nIn boundless emptiness—what thoughts remain?\n\nWithin the mysterious lies supreme joy,\nIn tranquil non-action, perfect ease.\nOnly with the truly orthodox as friends,\nWe drift and soar in carefree play.\n\nReceiving transformation, we condense pure qi,\nRefining form to become true immortals.\nWith wholehearted devotion, we align with the Primal Source,\nReturning to the root, harmonizing with nature.\n\nThe Supreme Unity gathers in the Final Palace,\nStreaming light from the Cinnabar Mystery.\nYuan Ying and Peach Lord,\nRecite the Ode of Eternal Life.\n\nA hundred passages wreathed in purple mist,\nThe whirlwind chariot traverses the vast expanse.\nGently the Eight Radiant Realms unfold,\nUnnoticed, the cloud-path stretches far—\nIn an instant, we wander the Four Heavens.\n\nFusang births the first light,\nFeathered canopies greet the dawn’s glow.\nIn a flash, we arrive in the Western Realm,\nFrolicking in the Golden Mother’s abode.\n\nAzure streams brim with boundless source,\nGlowing, they unfold the lotus blooms.\nResplendent the Azure Jasper Palace,\nDazzling, the arrayed jade blossoms.\n\nTrue qi overflows the Crimson Palace,\nNaturally, thoughts remain free of wrong.\nLooking down in pity upon mortals,\nHow turbid the world—truly lamentable!\n\nThe Jasper Terrace stands a kalpa’s height,\nSolitary, it gleams beyond the Great Veil.\nEver present, the Three Pure Clouds,\nTheir congealed light soars freely.\n\nFeathered youths drift on bright mist,\nAscending and descending—how ethereal!\nPhoenixes and simurghs sound refined melodies,\nPerching and soaring in the crimson forest’s peaks.\n\nThe Jade Void knows no day or night,\nHow radiant the numinous light!\nOne thread leads to the Supreme Capital,\nOnly then do all heavens seem small.\n\nGlowing, the Azure Flower Grove,\nDivine winds stir the jasper branches.\nThe Three Luminaries know no winter or spring,\nOne qi—verdant and harmonious.\n\nTurning back, the near ones form a radiant cluster,\nGazing afar, we draw close to the shining web.\nVast and unbounded, we govern the Six Heavens,\nStreaming bells subdue the hundred demons.\n\nEndless, the blessings flow unceasing,\nWho says the cedar’s age is long?\nLofty sentiments shun excess,\nEncountering all things, they birth radiant splendor.\n\nSupreme joy needs no flute or song,\nGold and jade resound in melodious tones.\nNow ascending the Terrace of Bright Perfection,\nWe feast in the Hall of Feathered Splendor.\n\nMisty vapors weave jade clouds,\nSubtle fragrance scatters, divine incense wafts.\nHeavenly beings, truly distant and vast,\nTheir joy and peace beyond measure.\n\nFrom the Supreme Tenuity above,\nWe hasten to behold the Venerable Sovereign of the Void.\nLifting my Eight Radiant Chariot,\nMajestically we enter the Heavenly Gate.\n\nHaving ascended the Jade Dawn Court,\nReverently we gaze upon the Purple Portal.\nDare I ask of the Dragon Han’s end,\nHow was the cosmos opened?\n\nJoyfully setting aside cloud-borne pride,\nHe reveals to me the words of Yu Yi:\n“Fortunate to hear the essence of the utmost truth,\nOnly now do I see the source of creation.\n\nThe Two Qi propagate the ten thousand beings,\nThe mechanism of transformation knows no rest.\nYet I grasp its beginning,\nThus able to transcend the potter’s wheel.\n\nIn the vast desert of emptiness,\nAll I encounter are the pure and true.\nLimpid and lustrous, containing primordial harmony,\nQi naturally draws together in kinship.\n\nCrimson trees bear cinnabar fruit,\nPurple mists flow through azure streams.\nWith this, we preserve the Divine Infant,\nForever transcending form and spirit.”\n\n---\n\n**Ten Scattering Flowers Verses Composed by Emperor Zhenzong of Song for the Jade Clarity Radiant Response Palace**\n\nWhere does one scatter flowers most abundantly?\nIn heaven above, the Highest Heaven of Great Veil.\nFlowers here grow from a different root,\nBathed in auspicious dew and harmonious clouds.\n\nAtop the Kunlun’s peak stands the Tortoise Terrace,\nWhere wondrous flowers bloom through all four seasons.\nWere it not for the assembled immortals paying homage to the Jade Emperor,\nHow could they reach the mortal world?\n\nHeavenly flowers bloom day and night,\nUnlike the world below, awaiting spring’s return.\nEach time heavenly beings pluck them,\nHow often are they offered to the Tiered City?\n\nThe Jasper Terrace glows in night’s dewy splendor,\nAs moon-mantled immortals pay homage at dawn.\nAt times, celestial flowers descend from the void,\nBlown into jade halls, presenting golden forms.\n\nFive-colored blossoms descend upon the Grotto-Heaven,\nGazing upward, their flight through the void is graceful.\nSay not that immortal mirrors are ever-present,\nFor in the mortal realm, they appear but once in myriad ages.\n\nPlucked from the immortal palace,\nScattered upon the jeweled terrace in dawn’s light.\nThe Jade Tower knows eternal spring,\nThe Celestial Chart receives boundless fortune.\n\nFeathered adepts ride simurghs in mid-heaven,\nLooking down upon the true abodes with earnest hearts.\nFrom Penglai, countless flowers are gathered,\nScattered before the embroidered thrones of the sacred precincts.\n\nThe flowers of the Supreme Grove bloom before spring,\nThe orioles of secluded valleys remain unaware.\nNot permitting ordinary folk to pluck them,\nAll are offered to the blessed lands to honor the true rites.\n\nWithin the grotto, thirty-six heavens know spring,\nImmortal realms differ from the world of men.\nWhere do the gathered blossoms go?\nBrought to the palaces to honor the exalted perfected.\n\nImmortal officials and true singers come and go frequently,\nGazing upon Penglai and Lang Garden’s spring.\nEach time they pluck fragrant flowers to offer the Emperor,\nMay the blessed lands’ fortune extend to all living beings.\n\n---\n\n**Eight Hymns of Praise for the Three Paths and Five Sufferings by the Perfected of the Supreme Ultimate and Great Void**\n\nThe Three Powers and the ten thousand things,\nInterdependent, each has its span.\nBeginning and end await the kalpa’s reckoning,\nWhen fortune is exhausted, heaven and earth collapse.\n\nTraversing the Five Paths,\nHow bitter—repeated death and rebirth!\nTurning through the Three Realms,\nComing and going with calamity.\n\nThe great wise heed this warning,\nEnduring nature, contemplating the severance of desire.\nFoolish men do not believe the Dharma,\nTheir sins and pains ever cling to them.\n\nI grieve that the world’s suffering knows no end,\nThus I earnestly proclaim this truth anew:\nIf you wish to escape this calamity,\nTake refuge in the Supreme Scriptures.\n\nSin and fortune arise not from elsewhere,\nThey surely spring from your own being.\nThe great wise thus seal their lips,\nSeeking to extinguish all evil roots.\n\nExtinguishing thoughts, uniting will,\nInterdependence awaits ultimate dissolution.\nExpounding the Dao to pacify the world,\nIn the end, one shall perceive its truth.\n\nEnvy and jealousy are the root of calamity,\nThe greatest peril to one’s existence.\nKnowing and nurturing such types,\nI fear they will surely meet early ruin.\n\nRecognizing evil yet not reforming,\nHow can this bring peace to the Dao?\nHarboring poison while feigning uprightness,\nIt makes me sigh deeply.\n\nThe certainty of past lives is undeniable,\nYet the weak and lost call it nonexistent.\nAll desire to see it before their eyes,\nBut once past, they dismiss it as distant.\n\nThe great wise illuminate the Dao’s teachings,\nGrieving with sorrow for the stubborn and foolish.\nTenderly they ponder the suffering of such beings,\nDiligently they cause me deep concern.\n\nHuman life wears away to nothing,\nLike a flame consuming lamp oil.\nThe Four Elements briefly converge,\nThe Five Aggregates provisionally lend form.\n\nIn the prime of youth, one ought to study diligently,\nStriving to preserve one’s self and soul.\nWhen fortune is exhausted, body and spirit scatter,\nPlunging into the dark depths of hell.\n\nThe supreme sages, fearing this fate,\nSeek the Dao to escape such calamity.\nThe pursuit of immortality is urgent,\nObserving precepts to master the heart’s passions.\n\nWhere emptiness and equanimity dwell,\nThe primal qi abides in rectitude,\nAnd immortals and sages naturally gather.\n\nIf you do not trust these sacred words,\nWhy not retreat to the mountains and forests?\nThe great wise delight in scriptures and precepts,\nReceiving them as treasures for the body.\n\nTo embark on study is ever deemed too late,\nTo cultivate the self is ever rued as too tardy.\nBy the time one unravels profound mysteries,\nIn a fleeting instant, the years have aged them.\nClutching the scroll, they sigh in utmost despair,\nSoon to face the agony of death’s torment.\n\nThus, in my youthful years,\nI abandoned the world to study the Dao.\n\n**Morning Congee Offering**\n\nAt dawn, fragrant congee is offered,\nWashing away the dust of the mundane.\nMay all who partake\nContemplate the Dao and ponder the True.\n\nThe boundless meritorious causes of this morning’s congee,\nReverently dedicated to praying for the emperor’s infinite longevity,\nAnd the everlasting stability of the imperial reign.\n\nFor the supreme karmic conditions, we invoke:\nThe Great Sage and Primordial Heavenly Worthy,\nThe Most High and Great Dao Lord,\nThe Most High and Lord Lao,\nAnd the immeasurable, inconceivable merits.\n\n**Invoking the Three Treasures**\nLet each person reverently bow,\nWith devoted hearts, to the Most High Boundless Dao.\nWith devoted hearts, to the thirty-six revered scriptures.\nWith devoted hearts, to the Great Dharma Master of the Mystic Realm.\n\n**Seated in Proper Form**\n**Offering Text**\nExquisite offerings from the incense kitchen,\nPresented above to the Heavenly Worthies,\nIn the middle to the Perfected Sages,\nAnd below to all the Immortals,\nUniversally shared in offering.\n\n**Upon Completion of the Ritual Meal**\nRecite: *\"Fortune arises, boundless Heavenly Worthy.\"*\n*\"Fortune arises, boundless Heavenly Worthy. Fortune arises, boundless Heavenly Worthy.\"*\n*\"Fortune arises, boundless Heavenly Worthy. Fortune arises, boundless Heavenly Worthy.\"*\n\n**Incantation for Almsgiving**\nDiligently cultivate the great Daoist dharma,\nWith pure hearts, move the Supreme Mystery.\nThe true descends, demonic illusions scatter,\nAll malevolent spirits vanish without form.\nSeven generations ascend to heavenly realms,\nAll disciples soar to the Upper Clarity.\nFortune pervades without exception,\nThis food is bestowed upon all beings.\n\n**Raising the Cup, Seated in Praise**\nThe boundless meritorious causes of this ritual meal,\nReverently dedicated to praying for the emperor’s infinite longevity,\nAnd the everlasting stability of the imperial reign,\nFor the supreme karmic conditions, we invoke as before.\n\n**The Patron’s Ritual Meal**\nInvoking the Three Treasures as above.\n\n**Offering Text**\n\nAll fields of merit begin with the offering of food.\nThose present enjoy bliss, those departed ascend to heaven.\nIn the Pure Land to come, clothing and sustenance arise naturally.\nThus, we make offerings universally to all the heavens.\nFrom the fragrant kitchen, exquisite offerings are made:\nAbove, to the Heavenly Worthies;\nIn the middle, to the Perfected Sages;\nBelow, to all sentient beings—\nAll are universally revered.\nBlessings flow to the patron of this ritual feast,\nLike rivers returning to the sea.\n\nUpon the conclusion of the feast, intone the Heavenly Worthy’s name as before.\nRecite the Incantation for Almsgiving, then rise and proclaim:\n\nThe sea of inconceivable meritorious power,\nVast and boundless, Supreme Honored One.\nResponding to the resonance, hastening to the ritual site at the sound’s call,\nYou witness this feast of boundless goodness.\n\nThe immeasurable meritorious causes of this ritual feast,\nNow dedicated in prayer for the patron, [Name],\nMay your body enjoy health and peace,\nYour rank ascend in glory,\nAnd through all time,\nMay fortune and felicity attend you.\n\nWe humbly pray that the merits of this feast be recorded,\nAnd the fruits of the Dao sustain your being.\nMay you attain the longevity of the tortoise and crane,\nAnd be blessed with the vast fortune of the great Peng.\nFor these supreme karmic conditions,\nWe invoke the boundless Heavenly Worthy of Salvation for All,\nWhose inconceivable merit knows no bounds.\n\n**Hymn for Escorting the Sages**\nThe five-cloud chariot turns back,\nSoaring through the nine heavens in song.\nIn an instant, it ascends far into the sky,\nWhile the ritual altar brims with fragrant qi.\nMysterious grace pervades the cosmos,\nBlessings and fortune fill the mountains and rivers.\nGazing afar at the path of immortals,\nFreely they roam atop the Great Loftiness.\n\n**Hymn of Robing and Adornment**\nCloud-sandals.\n\n**Cloud-Sandals (continued)**\nSwift as the flying teal, they tread upon cloud-shoes.\nAscending, they step upon the Ninefold Mystery Altar.\nWith intent, they wander the Three Realms,\nRiding the winds between the Five Han.\nMay this single footprint now\nSoar and tread to meet the Golden Countenance.\n\n**Star Crown**\nResplendent, the Seven-Star Crown gleams,\nDrifting down from Heaven.\nBestowed by sacred decree,\nDestined for immortals by past lives.\nMay this single donning now\nForever preserve the great camphorwood years.\n\n**Daoist Skirt**\nSix panels of wondrous skirts,\nAdorning the celestial beings’ feathered robes.\nFlying skirts grace the jeweled hall,\nGentle sashes step upon golden courts.\nMay this single girding now\nEthereally ascend to the Jasper Pool.\n\n**Cloud Sleeves**\nRadiant, the pure cloud sleeves,\nEncompassing the upper and lower robes.\nWoven from Fusang silkworms,\nStill bearing the fragrance of the Moon Palace.\nMay this single donning now\nAdorn the body for feasts in jade chambers.\n\n**Feathered Robes**\nThe raiment of divine immortals above,\nThe celestial guests’ natural garments.\nLight as the six-zhu wonder,\nAdorned to match the Three Luminaries.\nMay this single donning now\nFreely roam the land of undying.\n\n**Bowing at the Altar**\nThree tiers rise upon jasper steps,\nEight trigrams arrayed at each corner.\nSkirt and mantle dispel defilement,\nHems guard the Dharma from dust.\nMay this single ascent now\nAttend the morning rites at the Lord-on-High’s abode.\n\n**Morning Tablet**\nFlawless jade from the Western Terrace,\nPolished to serve the Three August Ones.\nIts upright form dispels wayward thoughts,\nHolding the heart to invoke the Supreme.\nMay this single grasp now\nAscend the jasper stairs to worship the Void Sovereign.\n\n**The Rites of Jade Sound conclude the lower scroll.**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞玄部赞颂类 玉音法事 经名：玉音法事。 三卷。 底本出处：《正统道藏》洞玄部赞颂类。 玉音法事卷上 步虚第一七十字 步虚第三 步虚第五五十字 金阙步虚五十字 空洞 醮筵中，不分举合字，径从元字举起。 奉戒 三启第－ 三启第二 三启第三 启堂颂 敷斋颂亦名出堂颂 大学仙 小学仙 焚词 山简水简、土简同 水简四十字 白鹤 玉音法事卷上竟 玉音法事卷中 玉清乐引 玉清乐 上清乐引 上清乐 太清乐引 太清乐 散花引散字下小注殷字，系鸟闲功 五言散花 七言散花 起敬赞 三归依",
      "translated_text": "**Yuyin Ritual Matters**\n*Category: Hymns and Eulogies, Dongxuan Section*\n\n**Text Title:** *Yuyin Ritual Matters* (Three Scrolls)\n*Source:* *Zhengtong Daoist Canon*, Dongxuan Section, Hymns and Eulogies\n\n---\n\n**Scroll One of *Yuyin Ritual Matters***\n\n*Stepping in Void (First)* – 70 characters\n*Stepping in Void (Third)*\n*Stepping in Void (Fifth)* – 50 characters\n*Golden Portal Stepping in Void* – 50 characters\n\n*Empty Void* – In the altar ritual, do not separate the initial and combined characters; begin directly from the original character.\n\n*Upholding the Precepts*\n*Three Invocations (First)*\n*Three Invocations (Second)*\n*Three Invocations (Third)*\n*Hymn for Opening the Hall*\n*Hymn for Arranging the Fast* (also called *Hymn for Exiting the Hall*)\n*Greater Immortal*\n*Lesser Immortal*\n*Incense Offering Prayer*\n*Mountain Petition, Water Petition* (same as *Earth Petition*)\n*Water Petition* – 40 characters\n*White Crane*\n\nEnd of Scroll One of *Yuyin Ritual Matters*\n\n---\n\n**Scroll Two of *Yuyin Ritual Matters***\n\n*Prelude to Jade Clarity Music*\n*Jade Clarity Music*\n*Prelude to Highest Clarity Music*\n*Highest Clarity Music*\n*Prelude to Supreme Clarity Music*\n*Supreme Clarity Music*\n\n*Prelude to Scattering Flowers* – Small annotation beneath \"scatter\" reads \"Yin,\" referring to the *Wuxian* merit\n*Five-Character Hymn for Scattering Flowers*\n*Seven-Character Hymn for Scattering Flowers*\n*Hymn for Rising in Reverence*\n*Three Refuges*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 304,
      "start_sentence": 0,
      "end_sentence": 36,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.83326244354248,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\玉音法事.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "志心皈依十方经宝，当愿众生　亡灵心开悟解，受持转诵。 志心皈依十方师宝，当愿众生　亡灵普上法桥，无有障碍。 敷坐赞 开经 宿命赞 三闻经 闻经已后，唯愿众生　亡灵万罪普消，善芽增长。 闻经已后，唯愿众生　亡灵永断执迷，常归正道。 解坐赞 为诸来生，作善因缘，如蒙开悟，仰荷玄恩。 每遇斋毕道 唱道赞 按《藏经·醮仪卷》所载，每遇唱道时，知磬举。 至末句，道众默念天尊三声，或五，或七，或九声，如阳醮念长生保命天尊、福生无量天尊，阴醮念太一救苦天尊。 华夏赞又曰四声华夏 按《玉篇》华字注华夏，三千五百里为华夏，言其迢远之意。 今华夏，用思真堂举起，徐徐吟咏，过廊厅，登殿坛而毕，似取其迢远之意也。 转声华夏赞 请五师再举",
      "translated_text": "*Devotedly take refuge in the scriptural treasures of the ten directions—may all beings, the departed spirits, awaken to understanding, receive, uphold, and recite them.*\n\n*Devotedly take refuge in the masterly treasures of the ten directions—may all beings, the departed spirits, ascend the Dharma bridge universally, without obstruction.*\n\n*Hymn for Spreading the Seat*\n*Opening the Scripture*\n*Hymn of Past Lives*\n*Three Hearings of the Scripture*\n\n*After hearing the scripture, may all beings, the departed spirits, have their myriad transgressions universally dissolved and their virtuous sprouts grow.*\n\n*After hearing the scripture, may all beings, the departed spirits, forever sever delusion and constantly return to the true Dao.*\n\n*Hymn for Rising from the Seat*\n\n*For all future rebirths, may good karmic conditions be made—if enlightenment is granted, we reverently bear the profound grace.*\n\n*Whenever the fast concludes, the Dao is intoned—*\n*Chanting the Hymn of the Dao*\n\n*As recorded in the* Jiaoyi Scroll *of the* Canon*: whenever the Dao is chanted, the handbell is struck. At the final phrase, the Daoists silently invoke the Heavenly Worthy three times, or five, or seven, or nine—during yang rites, \"Heavenly Worthy of Longevity and Life-Preservation\" or \"Heavenly Worthy of Boundless Blessings\"; during yin rites, \"Heavenly Worthy of Great Unity and Salvation from Suffering.\"*\n\n*The* Huaxia Hymn *is also called* Four-Voice Huaxia*. According to the* Jade Chapters*, the annotation for* hua *reads* Huaxia*, spanning three thousand five hundred li, signifying its vast and distant meaning. Today, the* Huaxia *begins with the raising of the* Sizhen Hall*, slowly chanted as one passes through the corridor and hall, ascending the altar platform to completion—seemingly evoking its distant resonance.*\n\n*Rotating-Voice Huaxia Hymn*\n*Invite the Five Masters to raise it again.*",
      "overlap_context": "ne of *Yuyin Ritual Matters*\n\n---\n\n**Scroll Two of *Yuyin Ritual Matters***\n\n*Prelude to Jade Clarity Music*\n*Jade Clarity Music*\n*Prelude to Highest Clarity Music*\n*Highest Clarity Music*\n*Prelude to Supreme Clarity Music*\n*Supreme Clarity Music*\n\n*Prelude to Scattering Flowers* – Small annotation beneath \"scatter\" reads \"Yin,\" referring to the *Wuxian* merit\n*Five-Character Hymn for Scattering Flowers*\n*Seven-Character Hymn for Scattering Flowers*\n*Hymn for Rising in Reverence*\n*Three Refuges*",
      "start_char": 304,
      "end_char": 648,
      "start_sentence": 37,
      "end_sentence": 55,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.696812629699707,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\玉音法事.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "云舆颂 送五师再举 修斋已毕，仰荷玄恩，志心稽首，奉送玄师、天师、经籍度师。 云舆颂 云舆不住，鹤驾难留，后有修斋，还当奉请。 请符使 三界直符，四直功曹，上奏灵官，神将吏兵，土地正神。 步虚词 三涂颂 斗经末句 礼十方 礼十－曜 举信礼声范 十三号同 关灯举斗位 三捻上香 易名三上香 志心初  二  三捻上香，香至混元  洞　天　渊泉宫，遍混元三境　洞天仙府　渊泉水府成华　宝　云盖供养。 混元三境尊 洞天仙府君 渊泉水府君 玉音法事卷中竟 启经文 道众平坐　举起敬赞　次三皈依 次敷坐赞　诵念如法　表白启经 云篆太虚，浩劫之初，乍遐乍迩，或沉或浮，五方徘徊，一丈之余。 天真皇人，按笔乃书，以演洞章，次书灵符。 元始下降，真文诞敷，昭昭其有，冥冥其无。 沉痾能自痊，尘劳溺可扶，幽明将存殁，由是升仙都。 发如是上愿者，以今升入经座，谨奉为某增延寿算，康泰身躬。 凡历时中，吉祥如意。 伏愿东华注算，南极延生。 福与海以同深，寿比山而永固。 为此因缘念福生无量天尊、延奉益算天尊、长生保命天尊，无量不可思议功德。 开经法事 看诵宝经经毕",
      "translated_text": "**Cloud Chariot Hymn**\nTo send off the Five Masters as they raise it again.\nThe purification rite now complete, we lift our hearts in reverence,\nbowing our heads in devotion to escort the Mystic Master,\nthe Heavenly Master, and the Master of Scriptures and Ordination.\n\n*Cloud Chariot Hymn*\nThe cloud chariot does not stay,\nthe crane-drawn carriage cannot be detained.\nWhen next we hold a purification rite,\nwe shall once more extend our invitation.\n\n**Invoking the Talisman Envoys**\nThe direct envoys of the Three Realms,\nthe Four Duty Officers of the Merit Registers,\nthe divine officials who ascend with petitions,\nthe spirit generals, functionaries, and soldiers,\nthe local earth deities.\n\n**Steps of Void Hymn**\n**Three Paths Hymn**\n**Final Phrase of the Dipper Scripture**\n**Homage to the Ten Directions**\n**Homage to the Eleven Luminaries**\n**Raising the Faith-Offering Chant**\n**Thirteen Invocations in Unison**\n**Closing the Lamps and Raising the Dipper Position**\n**Three Offerings of Incense**\n**Three Offerings of Incense for the Name Change**\n\nWith devotion, first,\nsecond,\nthird,\nthe incense ascends to the Primordial,\nthe Cavern-Heaven,\nthe Abyssal Spring Palace,\npervading the Three Realms of the Primordial,\nthe Cavern-Heaven Immortal Courts,\nthe Abyssal Spring Water Palaces—\nforming a radiant canopy of fragrant clouds.\n\nThe Venerables of the Three Realms of the Primordial,\nthe Lords of the Cavern-Heaven Immortal Courts,\nthe Lords of the Abyssal Spring Water Palaces.\n\n*End of the Central Scroll of the Jade Sound Ritual*\n\n**Opening the Scripture**\nThe Daoist assembly sits in even rows,\nraising the hymn of reverence.\nNext, the Three Refuges,\nthen the Seated Hymn of Exposition.\nRecitation proceeds according to ritual,\nthe petitioner announces the opening of the scripture.\n\n*Cloud Script of the Great Void,*\nat the dawn of kalpas,\nnow distant, now near,\nnow submerged, now afloat,\nwandering the Five Directions,\nover a zhang and more.\n\nThe Heavenly Perfected Sovereign took up his brush and inscribed,\nexpounding the Cavern Chapters,\nthen writing the numinous talismans.\nThe Primordial descended,\nthe true writ unfolded,\nluminous in its presence,\nobscure in its absence.\nSinking illness may heal itself,\nworldly toil and drowning may be uplifted.\nThe hidden and the manifest, the living and the dead—\nthus may one ascend to the Immortal Capital.\n\nThose who utter this supreme vow:\ntoday, as we ascend the scripture dais,\nwe reverently dedicate this to [Name],\nto augment and extend their years,\nto bring peace and vigor to their person.\nThrough all the hours to come,\nmay good fortune and harmony prevail.\n\nWe pray that the Eastern Flower bestow longevity,\nthat the Southern Culmen extend life.\nMay blessings be as deep as the sea,\nmay lifespan be as enduring as the mountains.\nFor this cause, we invoke:\nthe Heavenly Worthy of Boundless Blessings,\nthe Heavenly Worthy of Extended Longevity,\nthe Heavenly Worthy of Longevity and Life-Preservation—\nimmeasurable, inconceivable merit and virtue.\n\n*Opening the Ritual for the Scripture*\n*Upon completing the recitation of the precious scripture...*",
      "overlap_context": "*\n\n*The* Huaxia Hymn *is also called* Four-Voice Huaxia*. According to the* Jade Chapters*, the annotation for* hua *reads* Huaxia*, spanning three thousand five hundred li, signifying its vast and distant meaning. Today, the* Huaxia *begins with the raising of the* Sizhen Hall*, slowly chanted as one passes through the corridor and hall, ascending the altar platform to completion—seemingly evoking its distant resonance.*\n\n*Rotating-Voice Huaxia Hymn*\n*Invite the Five Masters to raise it again.*",
      "start_char": 648,
      "end_char": 1167,
      "start_sentence": 56,
      "end_sentence": 91,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.79928970336914,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\玉音法事.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "次举促吟步虚 表白叹经 详夫三洞宝经乃万天圣范。 结飞玄之妙炁，成大梵之龙章。 义贯浮生，文垂永劫。 故天地得之而分判，日月因之以运行，鬼神敬之则变通，人能奉之乃开泰。 是以咏之者，形陟绛霄； 闻之者，身腾碧落。 莫不人天仰赖，生化依凭。 为群品之津梁，作众真之户牖。 不可得而言之者，其为大乘经蕴乎。 向来奉为今辰斋主某，讽诵太上真经。 其经也，莫不开函演奥，响彻三天，执卷吟哦，声闻九地。 当愿侍香金童，结香字於天中； 典经玉郎，进经文於简上。 即使愆消昔劫，福降今辰。 存亡希开泰之恩，动植感生成之德。 乘兹善利，遍悉庄严。 三涂罢楚毒之劳，九夜绝辛酸之苦。 泊手悠悠，庶品蠢蠢，含生俱登六度之舟，并上三清之岸。 法众虔诚，闻经赞咏。 次举闻经就手收经次解坐赞 次举向来 向来诵经功德，上祈真圣，保佑平安，同赖善功，证无上道一切信礼。 次回向 天回云汉，结真炁以成文； 地发琅函，显灵章而出世。 功参造化，利益人天。 向来讽诵太上真经，称念天尊圣号，声赞法事功德，无限胜因。 奉为某入意，伏愿云云 黄箓启经文 道众平坐 举起敬赞 次三皈依 次敷坐赞 诵念如法 表白启经 劫仞宝台，香云素盖。 妙哉元始，洞观无碍。 诸天大圣，一时同会。 灵宝开图，酆都罢对。 金箓白简，九真妙戒，是谓津梁，超度三界。 以今升入经座，转诵仙经。 当发如是愿，今辰奉为黄箓斋主某资荐亡过某神魂，超升仙界。 伏愿朱陵度命，金阙化身。 逍遥快乐以无为，随愿往生而自在。 请法众等异口同音，为此因缘念太一救苦天尊、九幽拔罪天尊、法桥大度天尊、超凌三界天尊、逍遥快乐天尊，不可思议功德。 开经法事 虚皇号转诵宝经俟经毕",
      "translated_text": "Next, we raise the hastened chant of \"Stepping Through the Void,\"\nthe intonation of scripture-praise.\n\nConsider well: the Three Caverns’ precious scriptures are the sacred models of the myriad heavens.\nThey weave the wondrous *qi* into soaring flight,\nand form the dragon-script of the Great Brahmā.\nTheir meaning spans the floating lives of mortals,\ntheir text endures through eternal kalpas.\nThus, heaven and earth, receiving them, divide and take their places;\nsun and moon, by them, revolve and move.\nGhosts and spirits, revering them, transform and adapt;\nhumans, upholding them, attain flourishing peace.\n\nTherefore, those who chant them ascend in form to the crimson empyrean;\nthose who hear them rise in body to the azure firmament.\nNone fail to look up to them in awe—human and celestial alike—\nor to rely upon them for life and transformation.\nThey are the bridge and beam for all beings,\nthe door and window for the host of perfected ones.\nWhat cannot be spoken of in words—\nis this not the treasury of the Great Vehicle’s scriptures?\n\nHitherto, we have offered this for the patron of today’s fast, [Name],\nreciting the scriptures of the Most High.\nIn this recitation, none fail to open the case and expound the profound,\ntheir resonance piercing the Three Heavens;\nto grasp the scroll and chant aloud,\ntheir voices heard in the Nine Realms below.\n\nWe pray that the golden lads attending incense\nweave fragrant characters in the midst of heaven;\nthat the jade youths in charge of scriptures\npresent the sacred texts upon the tablets.\nThus may past transgressions from former kalpas be dissolved,\nand blessings descend upon this day.\nMay the living and the dead alike receive the grace of flourishing peace,\nand all creatures, moving and still, feel the power of life and growth.\nRiding this wave of good fortune,\nmay all be adorned with splendor.\nMay the Three Paths cease their torments of bitterness,\nand the Nine Nights end their pangs of sorrow.\nEven unto the most distant and humble,\nand all the teeming multitudes of beings—\nmay all board the vessel of the Six Perfections,\nand together ascend the shore of the Three Clarities.\n\nThe assembly, in reverent devotion,\nhears the scriptures and joins in praise.\n\n*Next, upon hearing the scriptures, gather them by hand and conclude the sitting in praise.*\n*Next, recapitulate the preceding.*\n\nThe merits of the scripture recitation just completed,\noffered up to the perfected sages,\npray for protection and peace,\nshared in the power of good deeds,\nto realize the supreme Dao—\nall bow in faith and reverence.\n\n*Next, the turning toward.*\n\nHeaven’s clouds swirl in the Milky Way,\nweaving true *qi* into scripture;\nearth’s jade cases open,\nrevealing numinous texts to the world.\nTheir merit matches the workings of creation,\ntheir benefits extend to humans and celestials alike.\nThe recitation of the Most High’s true scriptures,\nthe invocation of the Heavenly Worthies’ sacred names,\nthe vocal praise of the ritual’s merits—\nboundless are the excellent causes thus planted.\nWe dedicate this for [Name]’s intention,\nhumbly praying as follows:\n\n*The Yellow Register’s Opening Scripture Text*\nThe Daoist assembly sits in peace.\n*Raise the Hymn of Reverence*\n*Next, the Three Refuges*\n*Next, the Seated Praise*\n*Recite and intone as prescribed*\n*The Intendant announces the opening of the scriptures.*\n\nTowers of kalpas’ height,\nfragrant clouds and plain canopies.\nWondrous is the Primordial Beginning,\nwhose all-penetrating vision knows no bounds.\nAll the great sages of the heavens\ngather as one.\nThe Numinous Treasure unfolds its chart,\nthe Fengdu courts adjourn their trials.\nThe golden register and white tablets,\nthe Nine Perfected’s wondrous precepts—\nthese are the bridge and beam\nto transcend the Three Realms.\n\nToday, ascending the scripture dais,\nwe turn and recite the immortal scriptures.\nWe now make this vow:\nfor the patron of this Yellow Register fast, [Name],\nwe pray for the deliverance of the departed soul of [Name],\nto ascend to the immortal realms.\nHumbly we pray:\nmay the Vermilion Mound redeem their life,\nmay the Golden Gates transform their form.\nRoaming freely in bliss, unbound,\nfollowing their wishes to be reborn in ease.\n\nWe invite the assembly, with one voice and heart,\nfor this cause to invoke:\nthe Heavenly Worthy of Great Unity Who Saves from Suffering,\nthe Heavenly Worthy Who Delivers from the Nine Hells,\nthe Heavenly Worthy of the Great Bridge of Deliverance,\nthe Heavenly Worthy Who Transcends the Three Realms,\nthe Heavenly Worthy of Free and Joyous Roaming—\nimmeasurable, inconceivable merit and virtue.\n\n*Opening the Ritual for the Scripture*\n*The August Void Emperor’s name is intoned; the precious scriptures are recited in turn, awaiting their completion.*",
      "overlap_context": "y prevail.\n\nWe pray that the Eastern Flower bestow longevity,\nthat the Southern Culmen extend life.\nMay blessings be as deep as the sea,\nmay lifespan be as enduring as the mountains.\nFor this cause, we invoke:\nthe Heavenly Worthy of Boundless Blessings,\nthe Heavenly Worthy of Extended Longevity,\nthe Heavenly Worthy of Longevity and Life-Preservation—\nimmeasurable, inconceivable merit and virtue.\n\n*Opening the Ritual for the Scripture*\n*Upon completing the recitation of the precious scripture...*",
      "start_char": 1167,
      "end_char": 1865,
      "start_sentence": 92,
      "end_sentence": 136,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.578202962875366,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\玉音法事.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "举促吟步虚表白叹经 灵宝叹经 伏以元始祖劫，化生诸天，演碧落之空歌，映紫虚之郁秀。 开明三景，用普植於神灵； 敷落五篇，以保制於劫运。 或坐狮子之上，或入宝珠之中，万圣临轩，众真侍座。 是诸天之隐韵，非世上之常辞。 自然灵章，故谓玄奥一徧而同时，称善十过而枯骨更生。 其福难胜，度人无量。 以今亡过某运应灭度，身经太阴，谅其仙品之未充，孰谓神魂之暂灭。 有五苦八难之报对，无千和万合之成真。 当凭行香而诵经，尚冀回骸而起死。 伏冀元始符命，魔王歌章，上闻诸天，普告三界。 致飞度於五户，使混合於百神。 落灭恶根，疾除罪簿。 济度垂死，绝而得生，时刻升迁，魂神澄正。 俓执符而把箓，得保命以生根。 十转回灵，证死魂而受炼，皆得度世应仙，化以成人。 旁资亿劫种亲，下及幽魂苦爽，皆上升於仙品，兔长役於鬼官。 永度三涂五苦八难，超凌三界，逍遥上清。 次愿今辰斋官某与家眷等，遇值经法，得为贵人，身有光明，魔无干犯。 万神朝礼，名书上清。 法众虔诚，闻经赞咏。 讽《度人经》回向 元始灵书，诸天隐韵。 齐声讽诵，一言消万劫之愆； 异口同音，十过度九幽之苦。 向来讽诵《无量度人上品妙经》，称念天尊圣号，声赞法事功德。 无限胜因，奉为黄箓斋主某入意。 伏愿六根清净，获登黎土，以闻经一性圆明，同入宝珠而证果。 讽并看《度人经》回向 灵书中篇，可救三涂之苦； 本章上品，能迁九夜之魂。 向来讽诵《无量度人上品妙经》，称念天尊圣号，称赞法事功德。 无限胜因，奉为斋主某入意。 伏愿上升朱宫，凭百魔之隐韵； 贵生仙道，同七祖以超迁。 伏愿承元始之真符，死魂受炼； 听大梵之隐语，仙化成人。 伏愿众真鉴度，列圣垂慈，死魂受炼以更生，异骨成亲而超度。 伏愿已度者，度承炼受而仙化成人； 未生者，生获更生而超离恶趣。 举忏二十方天尊号 东方灵宝天尊，东方无极太上灵宝天尊。 南方灵宝天尊，南方无极太上灵宝天尊。 西方灵宝天尊，西方无极太上灵宝天尊。 北方灵宝天尊，北方无极太上灵宝天尊。 东北方灵宝天尊，东北方无极太上灵宝天尊。 东南方灵宝天尊，束南方无极太上灵宝天尊。 西南方灵宝天尊，西南方无极太上灵宝天尊。 西北方灵宝天尊，西北方无极太上灵宝天尊。 上方灵宝天尊，上方无极太上灵宝天尊。 下方灵宝天尊，下方无极太上灵宝天尊。 五星天尊号忏五星 真光普照天尊，日宫至真大圣日中皇君。 慧光朗照天尊，月宫至真大圣月中皇君。 流光辉照天尊，南辰北斗璇玑众曜一切真宰。 洞渊三昧天尊，水府扶桑丹林大帝。 十方经宝天尊，至真无上三十六部尊经。 五岳天尊号忏五岳 东华上相天尊，东岳泰山青帝真君。 南宫冶炼天尊，南岳衡山赤帝真君。 西灵宝德天尊，西岳华山白帝真君。 北元总校天尊，北岳恒山黑帝真君。 中黄帝二天尊，中岳嵩山黄帝真君。 日夜礼方次序 日举唱礼，始於东方，次如下式： 东方，南方，西方，北方，东北， 东南，西南，西北，上方，下方。 夜举唱礼，始於北方，次如下式： 北方，东北，东方，东南，南方， 西南，西方，西北，上方，下方。 清醮都唱 臣众等志心归命东青、西素、南丹、北冥，四维上下，十方无极大道，太上灵宝天尊，梵炁天君，十乡神仙诸灵官。",
      "translated_text": "With hastened steps and celestial hymns, we raise the *Biaobai* of the *Bu Xu* and intone the *Lingbao Sutra* in praise.\n\nWe reverently recall: since the Primordial Beginning of the ancestral kalpas, the myriad heavens were brought forth, unfolding the empty songs of the Azure Vault and illuminating the lush radiance of the Purple Void. The Three Luminaries were revealed to universally nurture the divine spirits; the Five Chapters were spread to safeguard and govern the kalpic destinies. Some sit upon lion thrones, others enter the heart of jeweled pearls—ten thousand sages descend in state, hosts of perfected ones attend in assembly. These are the hidden melodies of the heavens, not the common words of the mortal world. Naturally sacred verses, thus called profound and mysterious: recited once, they resonate in unison; praised tenfold, they revive the withered bones. Their blessings are boundless, delivering countless souls.\n\nToday, the departed [Name], whose fate aligns with the time of extinction, has traversed the Palace of Grand Yin. Though their immortal rank remains unfulfilled, who would say their spirit is but momentarily extinguished? They face the retribution of the Five Sufferings and Eight Difficulties, yet lack the thousand harmonies and myriad unions to attain perfection. We now rely on the burning of incense and the recitation of scriptures, still hoping to restore their form and raise them from death.\n\nWe humbly pray: may the Mandate of the Primordial Beginning and the hymns of the Demon Kings ascend to the heavens, universally proclaimed across the Three Realms. Let them soar through the Five Portals, merging with the hundred spirits. May evil roots be eradicated, sin records swiftly expunged. Rescue those on the brink of death, snatching them from annihilation to be reborn; may their souls ascend in due time, their spirits purified and rectified. Grasping the talismans and holding the registers, may they preserve their lives and regenerate their roots. Through tenfold revolutions of the Wheel of Return, may the deceased souls undergo refinement, all attaining deliverance to become immortals, transformed into perfected beings. May this extend to the countless kalpas of kindred, and below, to the suffering souls of the netherworld—all ascending to immortal ranks, forever freed from servitude to the ghostly officials.\n\nMay the Three Paths, Five Sufferings, and Eight Difficulties be eternally transcended, rising above the Three Realms to roam freely in the Highest Clarity.\n\nNext, we pray for the sponsor of this fast, [Name], and their household: may they encounter the Dharma, become noble persons, their bodies radiant with light, untouched by demonic interference. May the myriad spirits pay homage, their names inscribed in the Upper Clarity. May the assembly, with utmost devotion, hear the scriptures and join in praise.\n\n**Recitation of the *Scripture of Salvation* and Dedication of Merit**\nThe sacred writ of the Primordial Beginning, the hidden melodies of the heavens—\nwith one voice we chant and recite:\na single word dissolves the transgressions of ten thousand kalpas;\nwith diverse voices in unison, ten recitations deliver the Nine Hells from suffering.\n\nThe recitation of the *Wondrous Scripture of the Limitless Salvation, Upper Chapter* now concluded, we invoke the sacred names of the Heavenly Worthies and extol the merit of this ritual. Boundless auspicious causes are dedicated to the sponsor of this Yellow Register Fast, [Name].\n\nWe humbly pray: may their six senses be purified, attaining rebirth in the Land of Ripened Grain. Through hearing the scriptures, may their single nature become perfectly luminous, entering the Jeweled Pearl to realize fruition.\n\n**Recitation and Contemplation of the *Scripture of Salvation* with Dedication of Merit**\nThe middle chapters of the sacred writ can rescue those from the Three Paths of suffering;\nthe upper chapters of this scripture can elevate the souls of the Nine Nights.\n\nThe recitation of the *Wondrous Scripture of the Limitless Salvation, Upper Chapter* now concluded, we invoke the sacred names of the Heavenly Worthies and extol the merit of this ritual. Boundless auspicious causes are dedicated to the sponsor of this fast, [Name].\n\nWe humbly pray: may they ascend to the Vermilion Palace, relying on the hidden melodies of the hundred demons; may they be nobly reborn in the immortal Dao, rising together with their seven ancestors.\n\nWe humbly pray: bearing the true talismans of the Primordial Beginning, may the deceased souls undergo refinement; hearing the hidden words of the Great Brahma, may they be transformed into immortals.\n\nWe humbly pray: may the hosts of perfected ones witness this deliverance, may the ranks of sages bestow compassion—may the deceased souls be refined to be reborn, may alien bones become kin and attain transcendence.\n\nWe humbly pray: may those already delivered be refined and transformed into immortals; may those yet unborn be reborn, escaping the evil destinies.\n\n**Invocation of the Heavenly Worthies of the Twenty Directions**\nEast: Heavenly Worthy of Numinous Treasure, Heavenly Worthy of the Limitless Supreme Numinous Treasure of the East.\nSouth: Heavenly Worthy of Numinous Treasure, Heavenly Worthy of the Limitless Supreme Numinous Treasure of the South.\nWest: Heavenly Worthy of Numinous Treasure, Heavenly Worthy of the Limitless Supreme Numinous Treasure of the West.\nNorth: Heavenly Worthy of Numinous Treasure, Heavenly Worthy of the Limitless Supreme Numinous Treasure of the North.\nNortheast: Heavenly Worthy of Numinous Treasure, Heavenly Worthy of the Limitless Supreme Numinous Treasure of the Northeast.\nSoutheast: Heavenly Worthy of Numinous Treasure, Heavenly Worthy of the Limitless Supreme Numinous Treasure of the Southeast.\nSouthwest: Heavenly Worthy of Numinous Treasure, Heavenly Worthy of the Limitless Supreme Numinous Treasure of the Southwest.\nNorthwest: Heavenly Worthy of Numinous Treasure, Heavenly Worthy of the Limitless Supreme Numinous Treasure of the Northwest.\nAbove: Heavenly Worthy of Numinous Treasure, Heavenly Worthy of the Limitless Supreme Numinous Treasure of the Above.\nBelow: Heavenly Worthy of Numinous Treasure, Heavenly Worthy of the Limitless Supreme Numinous Treasure of the Below.\n\n**Invocation of the Five Stars and Repentance**\nHeavenly Worthy of True Light Universal Illumination, August Perfected Great Sage of the Solar Palace, the Solar Sovereign.\nHeavenly Worthy of Wisdom Light Radiant Illumination, August Perfected Great Sage of the Lunar Palace, the Lunar Sovereign.\nHeavenly Worthy of Flowing Light Splendid Illumination, the True Lords of the Southern Asterism, Northern Dipper, Jade Armillary, and all the Luminaries.\nHeavenly Worthy of the Abyssal Samādhi, the Great Emperor of the Vermilion Grove and Cinnabar Forest of the Water Palace.\nHeavenly Worthy of the Sacred Scriptures of the Ten Directions, the Most True and Supreme Thirty-Six Divisions of the Venerable Scriptures.\n\n**Invocation of the Five Peaks and Repentance**\nHeavenly Worthy of the Eastern Flowery Upper Minister, True Lord of the Azure Emperor of Mount Tai, the Eastern Peak.\nHeavenly Worthy of the Southern Palace Refinement, True Lord of the Vermilion Emperor of Mount Heng, the Southern Peak.\nHeavenly Worthy of the Western Numinous Treasure Virtue, True Lord of the White Emperor of Mount Hua, the Western Peak.\nHeavenly Worthy of the Northern Primordial General Examination, True Lord of the Black Emperor of Mount Heng, the Northern Peak.\nHeavenly Worthy of the Central Yellow Emperor and the Two Heavens, True Lord of the Yellow Emperor of Mount Song, the Central Peak.\n\n**Order of Day and Night Invocations**\nDaytime invocations begin in the East, followed in this order:\nEast, South, West, North, Northeast,\nSoutheast, Southwest, Northwest, Above, Below.\n\nNighttime invocations begin in the North, followed in this order:\nNorth, Northeast, East, Southeast, South,\nSouthwest, West, Northwest, Above, Below.\n\n**Concluding Invocation of the Pure Offering**\nWe, the assembly, with sincere hearts, take refuge in the Azure East, the White West, the Vermilion South, the Dark North, the four cardinal directions, above and below, the Limitless Dao of the Ten Directions, the Heavenly Worthy of Numinous Treasure, the Heavenly Lords of Brahma-qi, and the divine officials of the Ten Lands.",
      "overlap_context": "for this cause to invoke:\nthe Heavenly Worthy of Great Unity Who Saves from Suffering,\nthe Heavenly Worthy Who Delivers from the Nine Hells,\nthe Heavenly Worthy of the Great Bridge of Deliverance,\nthe Heavenly Worthy Who Transcends the Three Realms,\nthe Heavenly Worthy of Free and Joyous Roaming—\nimmeasurable, inconceivable merit and virtue.\n\n*Opening the Ritual for the Scripture*\n*The August Void Emperor’s name is intoned; the precious scriptures are recited in turn, awaiting their completion.*",
      "start_char": 1865,
      "end_char": 3235,
      "start_sentence": 137,
      "end_sentence": 210,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.54062509536743,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\玉音法事.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "礼足，虔诚忏悔。 黄箓都唱 臣众等志心归命东青、西素、南丹、北冥，四维上下，十方无极大道，太上灵宝天尊，洞阴朔单郁绝之境、虚无北界太阴黑帝，五炁灵君，酆都大帝，地府十王真君，冥关主宰一切神仙诸灵官。 礼足，虔诚忏悔。 举唱十方 东方，无极太上灵宝天尊九炁天君，东乡神仙诸灵官。 九礼 南方，无极太上灵宝天尊三炁天君，南乡神仙诸灵官。 三礼 西方，无极太上灵宝天尊七炁天君，西乡神仙诸灵官。 七礼 北方，无极太上灵宝天尊五炁天君，北乡神仙诸灵官。 五礼 东北方，无极太上灵宝天尊梵炁天君，东北乡神仙诸灵官。 二礼 东南方，无极太上灵宝天尊梵炁天君，束南乡神仙诸灵官。 二礼 西南方，无极太上灵宝天尊梵炁天君，西南乡神仙诸灵官。 二礼 西北方，无极太上灵宝天尊梵炁天君，西北乡神仙诸灵官。 三礼 上方，无极太上灵宝天尊、三十二天帝君、玄都玉京紫微金阙三清三境一十二炁天君，上乡神仙诸灵官。 十二礼 下方，无极太上灵宝天尊、九垒土皇、四司五帝、十二仙卿、九宫真人、神仙玉女无极世界，下乡神仙诸灵官。 十二礼 五星都唱 臣众等志心归命日宫月府，璇玑众曜，躔度星真，水府扶桑大帝，旸谷神王，水府真宰、至真经宝、一切神仙诸灵官。 礼足，虔诚忏悔。 举唱五星 日宫至真大圣，日中星君明皇真人，太光童子、丹霞玉女、日宫神仙诸灵官。 三礼 月宫至真大圣，月中皇君素华夫人，圆光童子、散辉玉女、月宫神仙诸灵官。 七礼 南辰北极璇玑众曜，三台七星、二十八宿、周天三百六十五躔度星中大神、星宫神仙诸灵官。 九礼 水府扶桑大帝，旸谷神王，三河四海九江水帝、十二河源水府神仙诸灵官。 十二礼 至真无上三十六部尊经，诸天宝藏十方正法侍卫经典一切灵司诸灵官。",
      "translated_text": "Having completed the rites, we humbly confess our transgressions.\n\n**General Invocation of the Yellow Register**\nWe, the assembly, with sincere hearts, take refuge in the Azure East, the White West, the Vermilion South, the Dark North, the four cardinal directions, above and below, the Limitless Dao of the Ten Directions, the Heavenly Worthy of Numinous Treasure, the Boundless Realm of Dongyin-Shuo-Dan-Yu-Jue, the Supreme Dark Emperor of the Northern Frontier of Void and Nothingness, the Lords of the Five Qi, the Great Emperor of Fengdu, the Ten True Lords of the Earthly Courts, the Sovereigns of the Nether Passes, and all divine officials and immortals.\n\nHaving completed the rites, we humbly confess our transgressions.\n\n**Invocation of the Ten Directions**\n**East:** The Limitless Heavenly Worthy of Numinous Treasure, the Lords of the Nine Qi, and all divine officials and immortals of the Eastern Land.\n*Nine bows.*\n\n**South:** The Limitless Heavenly Worthy of Numinous Treasure, the Lords of the Three Qi, and all divine officials and immortals of the Southern Land.\n*Three bows.*\n\n**West:** The Limitless Heavenly Worthy of Numinous Treasure, the Lords of the Seven Qi, and all divine officials and immortals of the Western Land.\n*Seven bows.*\n\n**North:** The Limitless Heavenly Worthy of Numinous Treasure, the Lords of the Five Qi, and all divine officials and immortals of the Northern Land.\n*Five bows.*\n\n**Northeast:** The Limitless Heavenly Worthy of Numinous Treasure, the Lords of Brahma-qi, and all divine officials and immortals of the Northeastern Land.\n*Two bows.*\n\n**Southeast:** The Limitless Heavenly Worthy of Numinous Treasure, the Lords of Brahma-qi, and all divine officials and immortals of the Southeastern Land.\n*Two bows.*\n\n**Southwest:** The Limitless Heavenly Worthy of Numinous Treasure, the Lords of Brahma-qi, and all divine officials and immortals of the Southwestern Land.\n*Two bows.*\n\n**Northwest:** The Limitless Heavenly Worthy of Numinous Treasure, the Lords of Brahma-qi, and all divine officials and immortals of the Northwestern Land.\n*Three bows.*\n\n**Above:** The Limitless Heavenly Worthy of Numinous Treasure, the Thirty-Two Heavenly Emperors, the Lords of the Twelve Qi of the Three Clarities and Three Realms of the Jade Capital of Mystery Metropolis and the Golden Towers of Purple Tenuity, and all divine officials and immortals of the Upper Land.\n*Twelve bows.*\n\n**Below:** The Limitless Heavenly Worthy of Numinous Treasure, the Ninefold Earthly Sovereigns, the Four Directors and Five Emperors, the Twelve Immortal Ministers, the Perfected of the Nine Palaces, the Immortals and Jade Maidens of the Boundless World, and all divine officials and immortals of the Lower Land.\n*Twelve bows.*\n\n**General Invocation of the Five Stars**\nWe, the assembly, with sincere hearts, take refuge in the Palace of the Sun and the Mansion of the Moon, the Celestial Mechanism and all luminaries, the True Stars of the Zodiacal Paths, the Great Emperor of the Waters and Fusang, the Divine King of Yang Valley, the True Sovereigns of the Water Realms, the Treasured Scriptures of the Utmost Perfected, and all divine officials and immortals.\n\nHaving completed the rites, we humbly confess our transgressions.\n\n**Invocation of the Five Stars**\n**Palace of the Sun:** The Utmost Perfected Great Sage of the Solar Palace, the Radiant August Perfected of the Sun’s Center, the Youth of Great Light, the Jade Maiden of Cinnabar Clouds, and all divine officials and immortals of the Solar Palace.\n*Three bows.*\n\n**Mansion of the Moon:** The Utmost Perfected Great Sage of the Lunar Palace, the August Sovereign of the Moon’s Center, the Lady of Plain Splendor, the Youth of Rounded Light, the Jade Maiden of Scattered Radiance, and all divine officials and immortals of the Lunar Palace.\n*Seven bows.*\n\n**Celestial Mechanism:** The Southern Asterism and Northern Culmen, the Celestial Mechanism and all luminaries, the Three Terraces and Seven Stars, the Twenty-Eight Constellations, the Great Spirits of the 365 Zodiacal Paths, and all divine officials and immortals of the Stellar Palaces.\n*Nine bows.*\n\n**Waters and Fusang:** The Great Emperor of the Waters and Fusang, the Divine King of Yang Valley, the Water Emperors of the Three Rivers, Four Seas, and Nine Streams, the Water Sovereigns of the Twelve Sources, and all divine officials and immortals of the Water Realms.\n*Twelve bows.*\n\n**Sacred Scriptures:** The Utmost Perfected and Supreme Thirty-Six Divisions of Venerable Scriptures, the Jeweled Treasuries of the Heavens, the Orthodox Dharma of the Ten Directions, the Guardians of the Canon, and all divine officials of the numinous administrations.",
      "overlap_context": "n in the North, followed in this order:\nNorth, Northeast, East, Southeast, South,\nSouthwest, West, Northwest, Above, Below.\n\n**Concluding Invocation of the Pure Offering**\nWe, the assembly, with sincere hearts, take refuge in the Azure East, the White West, the Vermilion South, the Dark North, the four cardinal directions, above and below, the Limitless Dao of the Ten Directions, the Heavenly Worthy of Numinous Treasure, the Heavenly Lords of Brahma-qi, and the divine officials of the Ten Lands.",
      "start_char": 3235,
      "end_char": 3994,
      "start_sentence": 211,
      "end_sentence": 248,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.172973155975342,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\玉音法事.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "三礼 五岳都唱 臣众等志心归命五岳五山，五帝真君飞仙真人、名山洞府得道神仙诸灵官。 礼足，虔诚忏悔。 举唱五岳 东岳泰山青帝真君飞仙真人，名山洞府得道神仙诸灵官。 九礼 南岳衡山赤帝真君飞仙真人，名山洞府得道神仙诸灵官。 三礼 西岳华山白帝真君飞仙真人，名山洞府得道神仙诸灵官。 七礼 北岳常山黑帝真君飞仙真人，名山洞府得道神仙诸灵官。 五礼 中岳嵩山黄帝真君飞仙真人，名山洞府得道神仙诸灵官。 十二礼 礼十方 志心归命礼东方，和无极太上灵宝天尊。 志心归命礼南方，无极太上灵宝天尊。 志心归命礼西方，无极太上灵宝天尊。 志心归命礼北方，无极太上灵宝天尊。 志心归命礼东北方，无极太上灵宝天尊。 志心归命礼束南方，无极太上灵宝天尊。 志心归命礼西南方，无极太上灵宝天尊。 志心归命礼西北方，无极太上灵宝天尊。 志心归命礼上方，无极太上灵宝天尊。 志心归命礼下方，无极太上灵宝天尊。 次知磬举　礼足　各长跪归命忏悔 臣法众等志心归身，归神归命，十方无极大道太上灵宝天尊。 臣闻，混元设教，常清净以为宗； 穹极享诚，匪斋盟而不格。 将感通於上圣，先荡涤於纤瑕。 遵奉典彝，许容忏悔。 以今某时焚香朝真，礼圣忏悔。 今辰醮主某自身与合家长幼等，自从前世乃至今生，或身心口三业六根，多诸误犯，无边无量，并乞消除，咸蒙赦宥。 伏愿十方上圣，同垂照鉴之功； 三洞神仙，共赐长生之寿。 祸沉九地，福起十方。 臣等志心稽首，礼谢无上正真三宝。 礼十一曜 志心归依信礼，和 日宫太阳帝君。 志心归依信礼，　月宫太阴皇君。 志心归依信礼，　东方木德星君。 志心归依信礼，　南方火德星君。 志心归依信礼，　西方金德星君。 志心归依信礼，　北方水德星君。 志心归依信礼，　中央土德星君。 志心归依信礼，　交初罗星君。 志心归依信礼，　交终计都星君。 志心归依信礼，　天一紫炁星君。 志心归依信礼，　太一月孛星君。 次知磬举礼足各虔诚归命忏悔 臣法众等志心归身，归神归命，纵霄上圣十一曜星皇君。 掌握道枢，挟隆化主。 运彼阴阳之变，斡兹化育之权。 有感必通，无幽不烛。 以今某时焚香朝真，礼圣忏悔。 今辰醮主某自身与合家长幼等，自从前世，乃至今生，恐积过尤，所萦殃咎，或身心口三业六根，多诸误犯，无量无边，并乞消除，咸蒙赦宥。 伏愿日帝敷恩，月皇介祉，木德金辉而锡佑，荧芒水耀以流祥，土德庇卫以无虞，罗计除灾而有庆。 天一紫炁，增益寿龄。 月孛星君，不临身位。 祸沉九地，福起十方。 臣等志心稽首，礼谢无上正真三宝。 礼十三号 信礼无上大罗天，和　　　　　玉清圣境元始天尊。 信礼无上大罗天，　上清真境太上玉晨大道君。 信礼无上大罗天，　　太清仙境太上混元教主。 信礼高上九炁天中，　　　东方太上灵宝天尊。 信礼高上三炁天中，　　　南方太上灵宝天尊。 信礼高上七炁天中，　　　西方太上灵宝天尊。 信礼高上五炁天中，　　　北方太上灵宝天尊。 信礼高上焚炁天中，　　东北方太上灵宝天尊。 信礼高上焚炁天中，　　东南方太上灵宝天尊。 信礼高上焚炁天中，　　西南方太上灵宝天尊。",
      "translated_text": "*Three bows.*\n\n**Five Peaks:** We, the assembled, wholeheartedly devote ourselves to the Five Peaks and Five Mountains, the True Lords of the Five Emperors, the Flying Immortals and Perfected Ones, and all divine officials and immortals of the sacred mountains and grotto-heavens who have attained the Dao.\n*Bows completed, reverently repent.*\n\n**Invocation of the Five Peaks:**\n**East Peak, Mount Tai:** The Azure Emperor True Lord, Flying Immortals and Perfected Ones, and all divine officials and immortals of the sacred mountains and grotto-heavens who have attained the Dao.\n*Nine bows.*\n\n**South Peak, Mount Heng:** The Vermilion Emperor True Lord, Flying Immortals and Perfected Ones, and all divine officials and immortals of the sacred mountains and grotto-heavens who have attained the Dao.\n*Three bows.*\n\n**West Peak, Mount Hua:** The White Emperor True Lord, Flying Immortals and Perfected Ones, and all divine officials and immortals of the sacred mountains and grotto-heavens who have attained the Dao.\n*Seven bows.*\n\n**North Peak, Mount Chang:** The Black Emperor True Lord, Flying Immortals and Perfected Ones, and all divine officials and immortals of the sacred mountains and grotto-heavens who have attained the Dao.\n*Five bows.*\n\n**Central Peak, Mount Song:** The Yellow Emperor True Lord, Flying Immortals and Perfected Ones, and all divine officials and immortals of the sacred mountains and grotto-heavens who have attained the Dao.\n*Twelve bows.*\n\n**Bowing to the Ten Directions:** Wholeheartedly devote ourselves and bow to the East, the Boundless and Utmost Venerable Numinous Treasure Heavenly Worthy.\nWholeheartedly devote ourselves and bow to the South, the Boundless and Utmost Venerable Numinous Treasure Heavenly Worthy.\nWholeheartedly devote ourselves and bow to the West, the Boundless and Utmost Venerable Numinous Treasure Heavenly Worthy.\nWholeheartedly devote ourselves and bow to the North, the Boundless and Utmost Venerable Numinous Treasure Heavenly Worthy.\nWholeheartedly devote ourselves and bow to the Northeast, the Boundless and Utmost Venerable Numinous Treasure Heavenly Worthy.\nWholeheartedly devote ourselves and bow to the Southeast, the Boundless and Utmost Venerable Numinous Treasure Heavenly Worthy.\nWholeheartedly devote ourselves and bow to the Southwest, the Boundless and Utmost Venerable Numinous Treasure Heavenly Worthy.\nWholeheartedly devote ourselves and bow to the Northwest, the Boundless and Utmost Venerable Numinous Treasure Heavenly Worthy.\nWholeheartedly devote ourselves and bow to the Above, the Boundless and Utmost Venerable Numinous Treasure Heavenly Worthy.\nWholeheartedly devote ourselves and bow to the Below, the Boundless and Utmost Venerable Numinous Treasure Heavenly Worthy.\n\n*Bell sounded, bows completed, all kneel in reverence to repent.*\n\nWe, the ritual assembly, wholeheartedly devote our bodies, spirits, and lives to the Boundless Dao of the Ten Directions and the Utmost Venerable Numinous Treasure Heavenly Worthy.\nWe have heard that the Primordial One established the teachings, ever-pure and tranquil as their foundation;\nThe vast heavens receive sincerity, for without purification and covenant, they do not respond.\nTo move the sagely ones above, we first purge even the slightest blemish.\nFollowing the sacred rites, we are permitted to repent.\n\nAt this moment, as incense is offered and the perfected are revered, we bow to the sages and repent.\nToday, the host of this rite, [Name], together with all family members, young and old, from past lives to this present existence—\nwhether through the three karmas of body, speech, and mind, or the six senses—\nhave committed manifold transgressions, boundless and immeasurable.\nWe beseech their dissolution and humbly pray for universal pardon.\n\nMay the sagely ones of the Ten Directions bestow their illuminating grace;\nMay the immortals of the Three Caverns grant the blessing of long life.\nLet misfortunes sink into the Nine Earths, and blessings arise from the Ten Directions.\nWe, the assembly, wholeheartedly prostrate ourselves, bowing in gratitude to the Utmost, Orthodox, and True Three Treasures.\n\n**Eleven Luminaries:** Wholeheartedly devote ourselves and bow in faith to the Solar Emperor Lord of the Sun Palace.\nWholeheartedly devote ourselves and bow in faith to the Lunar Sovereign Lady of the Moon Palace.\nWholeheartedly devote ourselves and bow in faith to the Wood Virtue Star Lord of the East.\nWholeheartedly devote ourselves and bow in faith to the Fire Virtue Star Lord of the South.\nWholeheartedly devote ourselves and bow in faith to the Metal Virtue Star Lord of the West.\nWholeheartedly devote ourselves and bow in faith to the Water Virtue Star Lord of the North.\nWholeheartedly devote ourselves and bow in faith to the Earth Virtue Star Lord of the Center.\nWholeheartedly devote ourselves and bow in faith to the Intersection-Initiating Rāhu Star Lord.\nWholeheartedly devote ourselves and bow in faith to the Intersection-Concluding Ketu Star Lord.\nWholeheartedly devote ourselves and bow in faith to the Celestial Unity Purple Qi Star Lord.\nWholeheartedly devote ourselves and bow in faith to the Grand Unity Moon Comet Star Lord.\n\n*Bell sounded, bows completed, all reverently devote themselves and repent.*\n\nWe, the ritual assembly, wholeheartedly devote our bodies, spirits, and lives to the Eleven Luminaries, the August Star Lords of the Empyrean.\nThey grasp the pivot of the Dao, wielding the authority of flourishing transformation.\nThey govern the changes of yin and yang, and turn the power of nurturing creation.\nResponsive to all entreaties, no hidden matter escapes their illumination.\n\nAt this moment, as incense is offered and the perfected are revered, we bow to the sages and repent.\nToday, the host of this rite, [Name], together with all family members, young and old, from past lives to this present existence—\nfearing the accumulation of transgressions and the entanglement of calamities—\nwhether through the three karmas of body, speech, and mind, or the six senses—\nhave committed manifold transgressions, boundless and immeasurable.\nWe beseech their dissolution and humbly pray for universal pardon.\n\nMay the Solar Emperor bestow grace, the Lunar Sovereign confer blessings;\nMay the Wood Virtue and Metal Brilliance grant protection, the radiant Fire and luminous Water flow with auspiciousness;\nMay the Earth Virtue shield and secure, Rāhu and Ketu dispel misfortune and bring fortune.\nMay the Celestial Unity Purple Qi augment our years, and the Moon Comet Star Lord not descend upon our destinies.\nLet misfortunes sink into the Nine Earths, and blessings arise from the Ten Directions.\nWe, the assembly, wholeheartedly prostrate ourselves, bowing in gratitude to the Utmost, Orthodox, and True Three Treasures.\n\n**Thirteen Invocations:** Bow in faith to the Utmost Great Luo Heaven, the Jade Clarity Sacred Realm, the Primordial Heavenly Worthy.\nBow in faith to the Utmost Great Luo Heaven, the Highest Clarity True Realm, the Utmost Jade Dawn Great Dao Lord.\nBow in faith to the Utmost Great Luo Heaven, the Grand Clarity Immortal Realm, the Primordial Lord of the Mixed Teaching.\nBow in faith to the Highest Nine Qi Heaven, the Eastern Utmost Venerable Numinous Treasure Heavenly Worthy.\nBow in faith to the Highest Three Qi Heaven, the Southern Utmost Venerable Numinous Treasure Heavenly Worthy.\nBow in faith to the Highest Seven Qi Heaven, the Western Utmost Venerable Numinous Treasure Heavenly Worthy.\nBow in faith to the Highest Five Qi Heaven, the Northern Utmost Venerable Numinous Treasure Heavenly Worthy.\nBow in faith to the Highest Fiery Qi Heaven, the Northeastern Utmost Venerable Numinous Treasure Heavenly Worthy.\nBow in faith to the Highest Fiery Qi Heaven, the Southeastern Utmost Venerable Numinous Treasure Heavenly Worthy.\nBow in faith to the Highest Fiery Qi Heaven, the Southwestern Utmost Venerable Numinous Treasure Heavenly Worthy.",
      "overlap_context": "d Fusang, the Divine King of Yang Valley, the Water Emperors of the Three Rivers, Four Seas, and Nine Streams, the Water Sovereigns of the Twelve Sources, and all divine officials and immortals of the Water Realms.\n*Twelve bows.*\n\n**Sacred Scriptures:** The Utmost Perfected and Supreme Thirty-Six Divisions of Venerable Scriptures, the Jeweled Treasuries of the Heavens, the Orthodox Dharma of the Ten Directions, the Guardians of the Canon, and all divine officials of the numinous administrations.",
      "start_char": 3994,
      "end_char": 5338,
      "start_sentence": 249,
      "end_sentence": 321,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.61905312538147,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\玉音法事.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "信礼高上焚炁天中，　　西北方太上灵宝天尊。 信礼高上一炁天中，　　　上方太上灵宝天尊。 信礼九垒重阴，　　　　　下方太上灵宝天尊。 次知磬举　礼足　各虔诚归命忏悔 臣法众等志心归身，归神归命； 三清三境，金容玉相之尊，十极十华，蕊阙琳宫之圣。 臣闻，运启开皇，仪生太极。 先天先地，化育於人伦； 无相无形，强名曰大道。 恭望大慈，洞垂臣泽，普降鸿恩。 以今中夜，焚香朝真，礼圣忏悔。 今辰醮主某自身与合家长幼等，自从前世，乃至今生，恐积过尤，所萦殃咎，或身心口三业六根，多诸误犯，无量无边，并乞消除，咸蒙赦宥。 伏愿三清上圣，锡蕃衍之祺祥； 十极高真，介庞禧之景贶。 祸沉九地，福起十方。 臣等志心稽首，礼谢无上正真三宝。 四结愿 愿大道兴行，经法流衍，志心稽首正真三宝。 愿天下太平，阴阳顺序，志心稽首正真三宝。 愿当今皇帝，圣寿无疆，明齐二景，志心稽首正真三宝。 愿今辰斋主，六根清今，五福咸臻，志心稽首正真三宝。 资荐亡者生天　见存获庆 愿一切含生，免离诸苦，同会无为，志心稽首十方得道圣众。 愿讲筵清众，心开悟解，道力资扶，志心稽首十方得道圣众。 辞三宝 时流已过，夜炁澄清。 香遍虚无，洪锺息响。 道还金阙，经归玉函。 稽首拜辞，无上道宝。 香随风散，升上太清。 名挂金牌，题书玉简。 金童上侍，玉女进闻。 稽首拜辞，无上经宝。 道场圆满，法事告周。 一切有情，同登道岸。 稽首拜辞，无上师宝。 愿汝诸众生，诸恶莫作，信受奉行。 常居中土，不堕边方。 方道蒙恩，酆都罢对。 志心稽首，礼谢十方得道圣众。 法师回精思暗道 归依正道，回拜真师，用悉庄严，福流斋主。 和愿得长生。 如幽醮则云：福资亡者，愿得超升。 志心声调 人各恭敬：",
      "translated_text": "Bow in faith to the Highest Fiery Qi Heaven, the Northwestern Utmost Venerable Numinous Treasure Heavenly Worthy.\nBow in faith to the Highest One Qi Heaven, the Upper Utmost Venerable Numinous Treasure Heavenly Worthy.\nBow in faith to the Ninefold Dark Abyss, the Lower Utmost Venerable Numinous Treasure Heavenly Worthy.\n\nNext, with the sounding of the chime, bow and touch the ground, each with utmost sincerity, reverently repenting and submitting:\nWe, the assembled disciples, wholeheartedly offer our bodies, spirits, and lives in devotion.\nTo the Three Purities and Three Realms, the Venerable Ones of golden countenance and jade visage;\nTo the Ten Poles and Ten Floral Splendors, the Sages of bud-palace and gemmed-pavilion sanctuaries.\n\nWe have heard that when the turning of the kalpa began and the imperial order arose, the ritual emerged from the Great Ultimate.\nBefore Heaven and before Earth, it nurtured the human order;\nWithout form and without appearance, it is forcibly named the Great Dao.\nWe humbly beseech Your boundless compassion to deeply bestow Your grace upon us and universally descend Your vast benevolence.\n\nTonight, at midnight, we burn incense to pay homage to the Perfected, bow to the Sages, and repent.\nOn this occasion, the master of the rite, so-and-so, together with all family members, young and old,\nfrom past lives to the present existence, fearing the accumulation of transgressions and the entanglement of karmic retribution,\nwhether through the three karmas of body, speech, and mind, or the six senses, have committed manifold errors and offenses, boundless and immeasurable.\nWe beseech that all be dissolved and forgiven.\n\nWe pray that the Three Pure Highest Sages bestow flourishing auspiciousness;\nThat the Ten Poles’ exalted Perfected Ones grant abundant blessings of great felicity.\nMay calamities sink into the Nine Earths, and blessings arise from the Ten Directions.\nWith devoted hearts, we bow our heads and prostrate, giving thanks to the Supreme Right and True Three Treasures.\n\nFourfold Vows:\nMay the Great Dao flourish and spread, the scriptures and teachings flow abundantly—with devoted hearts, we bow to the Right and True Three Treasures.\nMay the world enjoy great peace, yin and yang harmonize in order—with devoted hearts, we bow to the Right and True Three Treasures.\nMay the present emperor’s sagely longevity be boundless, his wisdom equal to the twin luminaries—with devoted hearts, we bow to the Right and True Three Treasures.\nMay the master of this rite today purify the six senses and attain the five blessings—with devoted hearts, we bow to the Right and True Three Treasures.\n\nFor the deliverance of the departed to be reborn in Heaven, and for the living to receive blessings:\nMay all sentient beings be freed from suffering and together attain the formless—with devoted hearts, we bow to the Perfected Saints of the Ten Directions who have attained the Dao.\nMay the assembly in this pure lecture hall awaken understanding and enlightenment, their Dao-power strengthened—with devoted hearts, we bow to the Perfected Saints of the Ten Directions who have attained the Dao.\n\nTaking Leave of the Three Treasures:\nThe time has passed, the night qi is serene.\nIncense fills the void, the great bell’s sound fades.\nThe Dao returns to the Golden Gates, the scriptures repose in the Jade Casket.\nWe bow our heads and take leave of the Supreme Dao-Treasure.\nIncense disperses with the wind, ascending to the Great Clarity.\nNames are inscribed on golden tablets, recorded on jade slips.\nGolden Lads attend above, Jade Maidens present the petition.\nWe bow our heads and take leave of the Supreme Scripture-Treasure.\nThe Dao-altar is complete, the ritual affairs concluded.\nMay all sentient beings together ascend the shore of the Dao.\nWe bow our heads and take leave of the Supreme Master-Treasure.\n\nMay you, all sentient beings:\nRefrain from all evil, accept and uphold these teachings.\nDwell always in the Central Land, not falling into the border realms.\nReceive the grace of the Dao, and let the trials of Fengdu cease.\nWith devoted hearts, we bow and give thanks to the Perfected Saints of the Ten Directions who have attained the Dao.\n\nThe Dharma Master returns to concentrated contemplation, silently following the Dao.\nReturning to the Right Dao, we bow to the True Master, employing all adornments to bestow blessings upon the master of the rite.\nMay he attain longevity.\n(For a rite for the departed, say: May blessings aid the deceased, and may they attain transcendence.)\n\nWith harmonious voices, each reverently intones.",
      "overlap_context": "most Venerable Numinous Treasure Heavenly Worthy.\nBow in faith to the Highest Five Qi Heaven, the Northern Utmost Venerable Numinous Treasure Heavenly Worthy.\nBow in faith to the Highest Fiery Qi Heaven, the Northeastern Utmost Venerable Numinous Treasure Heavenly Worthy.\nBow in faith to the Highest Fiery Qi Heaven, the Southeastern Utmost Venerable Numinous Treasure Heavenly Worthy.\nBow in faith to the Highest Fiery Qi Heaven, the Southwestern Utmost Venerable Numinous Treasure Heavenly Worthy.",
      "start_char": 5339,
      "end_char": 6080,
      "start_sentence": 322,
      "end_sentence": 367,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.754454612731934,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\玉音法事.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "志心稽首太上无极大道每遇斋筵道 志心稽首礼太上无极大道每遇醮筵三朝道 志心稽首正真三宝，焚香表叹宣疏咒食功德 志心归依十方道宝，当愿众生　亡灵起心回向一切信礼 志心归依信礼日宫太阳帝君礼十一曜举 志心归依信礼关灯举 志心初捻上香三捻上香举 志心归命礼东方无极太上灵宝天尊礼方举 志心归命礼五老礼举 志心稽首奉请五方童子举 志心信礼东方九炁天君十念仪举 志心朝礼礼忏举 志心奉为斋主召亡举 宋道君圣制道词 玉清乐十首 地居天上接空居，万象森罗遍八区。 功用不知谁主宰，绛霞丹雾閟清都。 碧落空歌黍米珠，十方勃勃入无余。 闻经喜庆难言说，九色龙腾八景舆。 羽童呼吸辟非烟，烟气徘徊绿室前。 造化不从身外得，自根自本即三天。 帝景相将会玉洲，明真层观紫云浮。 制开三八黄金锁，无极虚皇在上头。 白玉飞符下紫庭，华旛三举召群灵。 攀条咀嚼空青蕊，五体金光射日星。 连昌台下海扬波，得道高仙始得过。 下格小仙追莫及，邕邕遥听八鸾和。 五色云营叆叆屯，三三洞户敞琼门。 何方道士通朱表，玉女飞函达至尊。 上景三元妙色精，绛宫久已列仙名。 更从太混存雌一，缥缈云车驾羽明。 真阳馆裹炁徘徊，升降三宫密往来。 生死不干浮世事，相将五老上金台。 三华太素自然生，空裹芙蓉灼灼明。 绛室金房虚宝座，太微童子下相迎。 上清乐十首 紫清天上育华林，绛实朱柯绿叶深。 咀嚼繁英身不老，下观乌兔换光阴。 元君八炁号青灵，锦帔绯裙住玉城。 把握帝符司道箓，祓除尘累济群生。 高上皇人宴紫霄，撷芳常引八骞条。 肌肤表裹琉璃彻，映照三涂万苦消。 九日宫中四老真，广霞山上宴仙宾。 鸣锺鼓瑟行灵醑，碧落融融别有春。 浮绝山连白玉京，金华楼共日华明。 五真结就圆珠炁，骨似骨琼貌似婴。 秀华峰下五灵都，元景神君握化枢。 真火有功能造化，销镕五毒出阴途。 赫赫瞳瞳日九轮，六渊宫殿紫元君。 霞冠锦帔端居暇，披拂祥烟着赤文。 佳炁青葱覆紫空，青精羽驾命元童。 逆风浩荡三千里，七返香烟处处通。 流汨池中大宝莲，开华十丈映池泉。 嗅香饮水无饥渴，绰约金华叶上仙。 万仞霞山峙玉虚，四司冠剑护灵都。 众真稽首持天乐，腰佩仙皇逸箓符。 太清乐十首 太一元君掌列仙，彤辉绛彩射芝田。 功圆会遇刊名籍，可但洪崖笑拍肩。 五节清香半夜焚，天人玉女尽遥闻。 味同炁合遥相应，绛节霓旌下五云。 太极元君翠翮车，万魔奔走听神符。 九龙纵步齐酿首，时见空中吐火珠。 蕊珠宫裹七言成，十二真君一一名。 云拥苍虬归火府，风随素虎出沧瀛。 金阙明光后圣君，流精焕彩结丹云。 不因太上相传授，安得人间有玉文。 元景岩峦耸太空，超超仙室在霞中。 九云变化俄离合，羽驾飘讽不可穷。 东井中涵皓月精，群龙奋扩运金罂。 仙人灌沐知何代，唯见玻璃透骨明。 渺渺三津远帝川，川连红雾雾连天。 玉灵仙母时游息，侍卫森罗日月軿。 九灵玉馆接昆仑，山隔流纲不可亲。 嘱付紫兰令说与，红尘何苦弊精神。 左右灵妃运甲庚，琳宫八景炼华精。 常阳宴罢归何处，掷火流金事克成。 白鹤词十首 胎化灵禽唳九天，雪毛丹顶两相鲜。 世人莫认归华表，来瑞升平亿万年。",
      "translated_text": "With devoted hearts, we bow our heads to the Supreme and Boundless Dao—whenever a vegetarian feast is held.\nWith devoted hearts, we bow our heads to the Supreme and Boundless Dao—whenever a three-day ritual feast is convened.\nWith devoted hearts, we bow to the True and Perfect Three Treasures, offering incense, chanting praises, proclaiming the memorial, and reciting the dhāraṇī for the blessed meal.\nWith devoted hearts, we take refuge in the Dao-Treasures of the Ten Directions, may all sentient beings and the departed spirits turn their minds toward this offering and pay reverence.\nWith devoted hearts, we take refuge and pay reverence to the Solar Emperor of the Palace of the Sun, invoking the Eleven Luminaries.\nWith devoted hearts, we take refuge and pay reverence, kindling the ritual lamps.\nWith devoted hearts, we first offer a pinch of incense, then three pinches of incense.\nWith devoted hearts, we bow in homage to the Supreme Numinous Treasure Heavenly Worthy of the East, invoking the directions.\nWith devoted hearts, we bow in homage to the Five Venerable Ones, invoking their presence.\nWith devoted hearts, we bow our heads and invoke the Divine Lads of the Five Directions.\nWith devoted hearts, we pay reverence to the Heavenly Lords of the Nine Qi of the East, reciting the Ten Invocations.\nWith devoted hearts, we perform the rites of repentance and reverence.\nWith devoted hearts, we invoke the departed on behalf of the master of the rite.\n\n**Daoist Hymns Composed by the Sage Emperor of Song**\n\n*Jade Clarity Melody (Ten Poems)*\nEarth dwells below, heaven above—all space is filled,\nMyriad forms and shadows spread through the eight directions.\nWho governs their function, unknown to all?\nCrimson clouds and cinnabar mists veil the Pure Capital.\n\nThe azure vault resounds with songs of millet-like pearls,\nThe ten directions surge into boundless emptiness.\nThe joy of hearing the scriptures defies description—\nNine-hued dragons soar, bearing the eight-litters of light.\n\nFeathered youths breathe forth mist not of this world,\nVerdant vapors linger before the emerald chamber.\nCreation is not gained from without—\nFrom one’s own root and origin arise the Three Heavens.\n\nImperial radiance ascends to the Jade Continent,\nLuminous truth gleams in layered towers amid floating purple clouds.\nThe triple-eight golden locks are undone—\nThe Boundless Void Sovereign reigns above.\n\nWhite jade talismans descend from the Purple Court,\nThree flourishes of the flowered banners summon the host of spirits.\nPlucking and chewing the azure stamens of emptiness,\nTheir five bodies radiate golden light like sun and stars.\n\nBeneath the Lianchang Terrace, the sea stirs its waves—\nOnly the lofty immortals who have attained the Dao may pass.\nLesser immortals strive in vain to follow,\nHearing from afar the harmonious songs of eight simurghs.\n\nFive-colored clouds gather in dense array,\nThe triple-three grotto gates open wide their jade doors.\nWhich Daoist master submits the vermilion memorial?\nJade maidens fly with the missive to the Supreme One.\n\nThe Three Primes of the Upper Realm, wondrous essences of subtle hue,\nIn the Crimson Palace, their immortal names have long been inscribed.\nFurther abiding in the Great Chaos, preserving the Feminine One,\nTheir cloud chariots, ethereal and feathered, bear them aloft.\n\nWithin the Palace of True Yang, qi lingers and drifts,\nAscending and descending the Three Palaces in secret passage.\nUnconcerned with the affairs of the floating world,\nThey ascend with the Five Venerable Ones to the Golden Terrace.\n\nThe Three Flowers and Great Simplicity arise of themselves,\nAmidst emptiness, the lotus blossoms glow resplendent.\nThe Crimson Chamber and Golden House hold vacant thrones,\nThe Lads of the Grand Tenuity descend to welcome them.\n\n*Upper Clarity Melody (Ten Poems)*\nIn the Purple Clarity Heaven, the Flowery Grove is nurtured,\nCrimson fruits on vermilion branches, leaves of deepest green.\nChewing the abundant blossoms, their bodies never age,\nGazing below, they watch the crow and hare exchange their light.\n\nThe Primordial Lord of the Eight Qi is named Azure Spirit,\nAdorned in brocade robes and crimson skirts, dwelling in the Jade City.\nHolding the imperial talismans, he oversees the registers of the Dao,\nDispelling worldly burdens to deliver all beings.\n\nThe August Person of the Highest Realm feasts in the Purple Empyrean,\nPlucking fragrant blooms, ever leading the eight soaring boughs.\nWithin and without, their bodies are as translucent as lapis,\nIlluminating the Three Paths, dissolving ten thousand sorrows.\n\nIn the Nine-Day Palace, the Four Venerable True Ones,\nOn the Broad Radiance Mountain, they banquet with immortal guests.\nStriking bells and plucking zithers, they partake of divine wine—\nThe azure vault, suffused with warmth, holds a spring apart.\n\nFloating beyond the mountains, linked to the White Jade Capital,\nThe Golden Flower Tower gleams with the brilliance of the sun.\nThe Five Perfected gather the qi of the perfect pearl—\nTheir bones like jade, their forms like infants.\n\nBeneath the Peak of Resplendent Flowers lies the Fivefold Numinous Capital,\nThe Primordial Radiance Divine Lord wields the pivot of transformation.\nTrue fire, through its efficacy, creates and transforms,\nDissolving the five poisons, guiding them from the dark paths.\n\nResplendent and luminous, the nine wheels of the sun,\nIn the Six Abysses Palace, the Purple Primordial Lord.\nAdorned in rosy crowns and brocade robes, she sits in tranquil ease,\nDraped in auspicious mists, clad in scriptures of red.\n\nAuspicious qi, verdant and lush, veils the purple void,\nAzure essence feathered chariots bear the Primordial Lads.\nAgainst the wind, vast and mighty, for three thousand leagues,\nThe sevenfold returning incense wafts everywhere.\n\nIn the flowing and gurgling pool blooms the Great Treasure Lotus,\nIts ten-zhang blossoms reflecting in the spring.\nDrinking its fragrance and sipping its waters, free from hunger and thirst,\nGraceful and radiant, they are the immortals upon golden petals.\n\nThe towering rosy mountain stands in the Jade Void,\nThe Four Officiants, with crowns and swords, guard the Numinous Capital.\nThe host of perfected ones bow in homage, bearing celestial music,\nAt their waists, the jade tablets of the Immortal Emperor and the registers of ease.\n\n*Grand Clarity Melody (Ten Poems)*\nThe Great One Primordial Lord presides over the ranks of immortals,\nCrimson splendor and vermilion hues shine upon the magic fields.\nWhen merits are complete and encounters fulfilled, names are inscribed in the registers—\nHow could it be only Hong Ya who laughs and claps his shoulders?\n\nFive-jointed pure incense burns at midnight,\nHeavenly beings and jade maidens hear it from afar.\nIts savor blends with qi, resonating from afar,\nCrimson standards and rainbow banners descend upon five-colored clouds.\n\nThe Great Ultimate Primordial Lord rides a chariot of kingfisher plumes,\nTen thousand demons hasten to obey her divine talismans.\nNine dragons pace forth, all raising their heads,\nAt times, fire pearls are seen spitting in the void.\n\nWithin the Jeweled Blossom Palace, the seven-word verses are composed,\nEach of the Twelve True Lords bears a name.\nClouds escort the azure dragons back to the Fire Mansion,\nWind follows the white tigers forth from the azure sea.\n\nThe Golden Portal Bright Radiance Posterior Sage Lord,\nFlowing essence shines, forming cinnabar clouds.\nHad the Supreme One not transmitted it,\nHow could the mortal world possess the jade scriptures?\n\nPeaks of Primordial Radiance soar into the vast sky,\nLofty and transcendent, the immortal chambers rest amid the clouds.\nNinefold clouds transform, swiftly parting and merging,\nFeathered chariots drift and glide, boundless and unfathomable.\n\nThe Eastern Well cradles the essence of the luminous moon,\nA host of dragons stir, wielding golden jars.\nWhen did the immortals bathe and cleanse?\nOnly the crystal clarity shining through their bones is seen.\n\nVast and distant, the Three Fordings stretch to the Imperial River,\nRiver linked to crimson mist, mist merging with the heavens.\nThe Jade Spirit Immortal Mother roams and rests,\nHer attendants arrayed like the sun and moon’s chariots.\n\nThe Ninefold Numinous Jade Palace adjoins Kunlun,\nMountains divide the flowing nets, making kinship impossible.\nShe entrusts the purple orchids to convey her message—\nWhy exhaust your spirit in the red dust?\n\nLeft and right, the numinous consorts wield the cyclical signs,\nIn the Eight Scenic Palaces of the Jade Grove, they refine the essence of flowers.\nWhen the feast in the Perpetual Sun is concluded, where do they return?\nCasting fire and flowing gold, their tasks are accomplished.\n\n*Ten Poems on the White Crane*\nSpiritual birds born of transformation cry in the nine heavens,\nSnow-white plumage and cinnabar crowns, both resplendent.\nLet no one mistake them for those returning to the flowery pillars—\nThey come as auspicious omens of peace for a hundred million years.",
      "overlap_context": "ted hearts, we bow and give thanks to the Perfected Saints of the Ten Directions who have attained the Dao.\n\nThe Dharma Master returns to concentrated contemplation, silently following the Dao.\nReturning to the Right Dao, we bow to the True Master, employing all adornments to bestow blessings upon the master of the rite.\nMay he attain longevity.\n(For a rite for the departed, say: May blessings aid the deceased, and may they attain transcendence.)\n\nWith harmonious voices, each reverently intones.",
      "start_char": 6080,
      "end_char": 7519,
      "start_sentence": 368,
      "end_sentence": 447,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.47075939178467,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\玉音法事.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "瑶台风静夜初分，仰啄惊鸣露炁新。 太液徘徊归未得，曾於往劫作麒麟。 灵鹤翩翩下太清，玉楼金殿晓风轻。 昂昂不与鹦为侣，时作冲天物外声。 三山碧海路非遥，来瑞清都下紫霄。 霜雪羽毛冰玉性，瑶池深处啄灵苗。 金火纯精见羽仪，长随王母宴瑶池。 玉坛夜醮神仙降，飞过缑山人不知。 五云宫殿步虚长，斗转璇霄夜未央。 白鹤飞来通吉信，清音齐逐返风香。 一声嘹唳九皋禽，换骨轻清岁月深。 辽海等闲人不识，大罗天上有知音。 白毛鲜洁映霜华，丹顶分明夺绛砂。 千六百年神气就，飞鸣长伴玉仙家。 蓬莱会散列仙归，羽驾飘然白鹤飞。 明代为祥人惯见，何须乐府咏金衣。 玉宇沉沉瑞雾开，香风未断鹤徘徊。 奇姿迥与青田别，定是仙人次第来。 散花词十首 绛节徘徊引，天花散漫飞。 高真无染着，片片不沾衣。 八陛旋瑶级，千花扬锦英。 绿渟并紫柰，焕丽不知名。 浅浅黄金萼，匀匀白玉英。 天风随羽驾，吹满九重城。 绰约萦空际，缤纷落坐隅。 韶华长不老，何处觅仙都。 净侣吟仙曲，人人赞善哉。 万花兴供养，飞舞自天来。 宝叶开琪圃，珍柯在紫微。 不教蝴蝶采，长共彩鸾飞。 圣境三千岁，仙花始一开。 如何金箓会，并奉列仙来。 几席延飙驭，香灯建宝坛。 丹心无可献，碎锦洒云端。 碧绿相差次，红黄迭浅深。 化工应自失，雕琢本无心。 洞案炉烟起，无为道德香。 同根无异炁，喷鼻更芬芳。 步虚词十首 太极分高厚，轻清上属天。 人能修至道，身乃作真仙。 行溢三千数，时丁四万年。 丹台开宝笈，金口为流传。 大梵三天主，虚皇五老尊。 尚难窥徼妙，岂复入名言。 宝座临金殿，霞冠照玉轩。 万真朝帝所，飞乌蹑天根。 蒙蒙如细雾，冉冉曳铢衣。 妙逐祥烟上，轻随彩凤飞。 几陪瑶室宴，忽指洞天归。 伫立扶桑岸，高奔日帝晖。 旋步云纲上，天风飒尔吹。 飘裾凌斗柄，秉拂揖参旗。 狮子衔丹绶，麒麟导翠辎。 飞行周八极，几见发春枝。 绿鬓巍丹帻，青霞络羽衣。 晨趋阳德馆，夜造月华扉。 搏弄周天火，韬潜起陆机。 玉房留不住，却向九霄飞。 昔在延恩殿，中宵降九皇，六真分左右，黄雾绕轩廊。 广内尊神御，仙兵护道场。 孝孙今继志，咫尺对灵光。 宝箓修真范，丹诚奏上苍。 冰渊临兆庶，宵旰致平康。 万物消疵疠，三晨效吉祥。 步虚声已彻，更咏洞玄章。 宛宛神洲地，巍巍众妙坛。 鹤袍来羽客，凫舄下仙官。 玉（ ）斟元醴，琅函启大丹。 至诚何以祝，四海永澄澜。 水噀魔宫慑，灯开夜府明。 九天风静默，四极气澄清。 啸咏朱陵曲，翱翔白玉京。 至诚何以祝，国祚永安荣。 华夏吟哦远，人声自抑扬。 冲虚归道德，曲折合宫商。 殿阁沉檀散，楼台月露凉。 至诚何以祝，多稼永丰禳。 宣和续降 长吟玉音金阙步虚 始青黎元盖，金香结朱烟。 飞晨总翘辔，稽首玉帝前。 帝心浩以舒，锡吾太灵篇。 是谓不灭道，万天秉吾权。 吾行空洞中，下仙昧其渊。 步虚词二首 后一首，因讲《 御注道德经》，仙鹤翔集而作。 一炁化之元，邈在两仪先。 宝垺驰金马，真香喷玉莲。 飞空按龙辔，梵响导芝軿。 绵永长春劫，翱翔无色天。 初真难晓谕，以此戒中仙。 高真明道德，垂世五千言。 解释惭凉薄，殚诚测妙元。",
      "translated_text": "Upon the Jasper Terrace, winds hush as night begins its parting,\nCraning upward, their startled cries pierce the dew-drenched qi anew.\nBy Taiye’s pool they linger, unable to return—\nIn ages past, they were the qilin’s kin.\n\nGraceful, the numinous cranes descend to the Great Purity,\nJade towers and golden halls where dawn’s breeze lightly stirs.\nProud, they spurn the parrot’s company,\nNow and again uttering transcendent cries that soar beyond the world.\n\nTo the Three Mountains and azure seas, the path is not far—\nThey come as auspicious omens from the Purple Empyrean to the Celestial Capital.\nFrost and snow adorn their plumage, their nature like ice and jade,\nIn the depths of the Jasper Pool, they peck at numinous sprouts.\n\nPure essence of gold and fire manifests in their bearing,\nEver following the Queen Mother to feast at the Jasper Pool.\nBy night, at the jade altar’s rites, immortals descend—\nThey fly past Mount Gou, unseen by mortal eyes.\n\nThrough palaces of five-hued clouds, the *bu xu* chant lingers long,\nAs the Dipper turns in the jade firmament, night yet unending.\nWhite cranes arrive bearing tidings of fortune,\nTheir clear cries in unison trailing the fragrance of returning winds.\n\nA single clarion call echoes through the Nine Marshes,\nTheir bones refined, their spirits lightened through the depths of years.\nAcross the Liao Sea, common folk fail to recognize them—\nYet in the Great Brahma Heaven, they find kindred souls.\n\nWhite plumage gleams, immaculate against the frost’s splendor,\nCinnabar crowns distinct, outshining crimson cinnabar.\nFor sixteen hundred years, their divine qi has flourished,\nEver soaring and crying beside the jade immortals’ abode.\n\nWhen the Penglai assembly disperses and the immortals depart,\nFeathered chariots drift away as white cranes take flight.\nIn the Ming era, their auspicious presence became a familiar sight—\nWhy then invoke the *Yuefu* to sing of golden robes?\n\nJade palaces, profound, part the auspicious mists,\nFragrant winds yet unceasing, the cranes linger in flight.\nTheir wondrous forms stand apart from the Qingtian breed—\nSurely these are immortals arriving in succession.\n\n*Ten Poems on Scattering Flowers*\nScarlet staffs sway, guiding the way,\nHeavenly blossoms scatter and drift.\nLofty perfected ones remain unstained—\nPetal by petal, they cling not to robes.\n\nEightfold stairs spiral with jasper steps,\nA thousand flowers unfurl brocade’s glory.\nVerdant *ting* and purple *nai* bloom,\nResplendent, their names unknown.\n\nDelicate golden calyces,\nEven white jade petals.\nHeavenly winds follow the feathered chariots,\nBlowing through the ninefold city.\n\nGraceful, they coil through empty space,\nProfuse, they alight in the hall’s corners.\nEternal is their radiant splendor—\nWhere to seek the immortals’ realm?\n\nPure companions chant celestial hymns,\nEach praising the good.\nMyriad flowers arise in offering,\nDancing as they descend from heaven.\n\nJeweled leaves open in the *qipu* gardens,\nPrecious branches thrive in the Purple Tenuity.\nNo butterflies are permitted to pluck them—\nEver they soar with the colored *luan*.\n\nFor three thousand years in the sacred realm,\nThe immortal blossoms but once unfurl.\nHow then at the Golden Register’s convocation\nDo they all attend alongside the perfected?\n\nSeats extend for the wind-borne chariots,\nFragrant lamps illuminate the precious altar.\nWith hearts of cinnabar, what can we offer?\nShattered brocade scattered amid the clouds.\n\nEmerald and green in layered gradation,\nCrimson and yellow in shifting depths.\nThe Craftsman of Transformations must surely be lost—\nCarved and wrought, yet without intent.\n\nFrom the grotto’s censer, incense smoke rises,\nThe fragrance of the Dao and virtue, effortless.\nOf the same root, without differing qi,\nIts scent wafts more sweetly still.\n\n*Ten Chants of the Bu Xu*\nThe Great Ultimate divides high and profound,\nThe light and pure ascend to heaven’s domain.\nShould one cultivate the utmost Dao,\nThe body becomes a true immortal.\n\nTheir ranks number three thousand,\nTheir time spans forty thousand years.\nUpon the cinnabar terrace, the precious canon unfolds,\nFrom golden mouths, its transmission flows.\n\nThe Great Brahma, lord of the Three Heavens,\nThe Five Venerable Ones of the Void Emperor—\nEven they scarcely glimpse its subtleties,\nHow then could it be captured in mere words?\n\nUpon jeweled thrones within the golden hall,\nRadiant coronets illuminate the jade portals.\nMyriad perfected ones pay homage to the Emperor’s abode,\nFlying birds tread the roots of heaven.\n\nMisty as fine haze,\nGently trailing robes of gossamer,\nThey ascend with the auspicious smoke,\nLightly following the colored *fenghuang*.\n\nHaving attended the feast in the jasper chamber,\nSuddenly they point toward the grotto-heaven’s return.\nStanding by the Fusang’s shore,\nThey hasten toward the Sun God’s radiance.\n\nPacing the cloud-nets above,\nHeavenly winds suddenly blow.\nDrifting hems brush the Dipper’s handle,\nHolding fly-whisks, they bow to the banner of Shen.\n\nLions bear cinnabar tassels,\nQilin lead jade-green chariots.\nIn flight, they traverse the eight poles—\nHow often have they witnessed spring’s awakening?\n\nGreen locks beneath scarlet headbands,\nAzure auroras entwine their feathered robes.\nAt dawn, they hasten to the Yang Virtue’s hall,\nBy night, they arrive at the Moon’s Splendor gate.\n\nThey toy with the fires of the celestial sphere,\nConcealing and emerging like Lu Ji.\nThe jade chambers cannot detain them—\nThey soar once more toward the ninefold heavens.\n\nLong ago in the Hall of Extended Grace,\nAt midnight, the Nine August Ones descended.\nSix perfected ones divided left and right,\nYellow mists coiled around the eaves and corridors.\n\nWithin the vast palace, the divine lords were revered,\nImmortal soldiers guarded the Daoist sanctuary.\nNow the filial grandson inherits their resolve,\nInches away, he faces the numinous radiance.\n\nFollowing the precious canon’s true model,\nWith cinnabar sincerity, he petitions the heavens above.\nBefore the ice-like abyss, he stands among the multitudes,\nBy day and night, he brings forth peace and prosperity.\n\nAll things dispel their afflictions,\nFor three mornings, auspicious signs appear.\nThe *bu xu* chant now resounds,\nAs they intone the *Dongxuan* chapters.\n\nUpon the sacred land of the winding isles,\nThe majestic altar of myriad wonders stands.\nCrane-robed feathered guests arrive,\nDuck-slippered immortals descend.\n\nJade ( ) pours the primordial liquor,\nJade cases unveil the great elixir.\nWith utmost sincerity, how shall we pray?\nMay the four seas forever remain serene.\n\nWater is sprinkled to subdue demonic palaces,\nLamps illuminate the night’s treasury.\nThe winds of the nine heavens fall silent,\nThe qi of the four poles clears.\n\nWhistling, they chant the *Zhuling* melodies,\nSoaring through the White Jade Capital.\nWith utmost sincerity, how shall we pray?\nMay the nation’s fortune endure in eternal peace.\n\nAcross the Central Land, hymns resound afar,\nHuman voices naturally rise and fall.\nEmbracing emptiness, they return to the Dao and virtue,\nTheir cadences harmonizing with the palace’s tones.\n\nIncense smoke lingers in the halls,\nMoonlit dew chills the towers.\nWith utmost sincerity, how shall we pray?\nMay the harvests forever flourish and banish misfortune.\n\n*Xuanhe Continuation*\nLong chanting the jade tones of the *Jinque Bu Xu*,\nAt the dawn of blue-black primeval chaos,\nGolden incense weaves crimson smoke.\nAt dawn’s flight, all raise their reins,\nBowing before the Jade Emperor.\n\nThe Emperor’s heart, vast and at ease,\nBestows upon us the *Tai Ling* canon.\nThis is the indestructible Dao,\nBy which the myriad heavens uphold our authority.\n\nWe traverse the empty and cavernous,\nWhile lesser immortals grope in its depths.\n\n*Two Chants of the Bu Xu*\nThe latter composed upon expounding the *Imperially Annotated Daode Jing*, as immortal cranes gathered in flight.\n\nFrom the primordial of the one qi,\nVast, it preceded the Two Modes.\nPrecious chariots race like golden steeds,\nTrue incense sprays from jade lotuses.\n\nThrough the void, they rein in dragon steeds,\nBrahma tones guide the *zhipeng* chariots.\nEternally spanning the long spring kalpa,\nThey soar through the formless heavens.\n\nTo the initial perfected, it is hard to explain—\nThus we admonish the immortals of the middle ranks.\n\nLofty perfected ones elucidate the Dao and virtue,\nBequeathing to the world five thousand words.\nIn explanation, we humbly acknowledge our shallowness,\nYet with utmost sincerity, we fathom the wondrous origin.",
      "overlap_context": "e Eight Scenic Palaces of the Jade Grove, they refine the essence of flowers.\nWhen the feast in the Perpetual Sun is concluded, where do they return?\nCasting fire and flowing gold, their tasks are accomplished.\n\n*Ten Poems on the White Crane*\nSpiritual birds born of transformation cry in the nine heavens,\nSnow-white plumage and cinnabar crowns, both resplendent.\nLet no one mistake them for those returning to the flowery pillars—\nThey come as auspicious omens of peace for a hundred million years.",
      "start_char": 7520,
      "end_char": 8863,
      "start_sentence": 448,
      "end_sentence": 542,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 53.026426553726196,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\玉音法事.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "霓旌严教典，羽唱彻云軿。 瑞鹤仪空际，祥风拂暑烦。 穹窿兹响应，宝祚亿斯年。 玉京步虚词十首 稽首礼太上，烧香归虚无。 流明随我回，法轮亦三周。 玄元四大兴，灵庆及王侯。 七祖生天堂，煌煌耀景敷。 啸歌冠太漠，天乐适我娱。 齐馨无上德，下仙不与俦。 妙想朗玄觉，诜诜乘虚游。 吟至灵庆及王侯方隐侯字。 旋行蹑云纲，乘虚步玄纪。 吟咏帝一尊，百关自调理。 俯命八海童，仰携高仙子。 诸天散香华，萧然灵风起。 宿愿定命根，故致标高拟。 欢乐太上前，万劫犹未始。 嵯峨玄都山，十方宗皇一。 岧岧天宝台，光明曜流日。 炜烨玉林华，蒨璨耀朱实。 常念餐元精，炼液固形质。 金光散紫微，窈窕大乘逸。 上一首韵脚皆真声，无隐字。 故朝奏时，通作一首，全句吟咏。 俯仰存太上，华景秀丹田。 左顾提郁仪，右盼携结璘。 六度冠梵行，道德随日新。 宿命积福应，闻经若至亲。 天挺超世才，乐诵希微篇。 冲虚太和炁，吐纳流霞精。 胎息静百关，寥寥究三便。 泥丸洞明景，遂成金华仙。 魔王敬受事，故能朝诸天。 皆从斋戒起，累功结宿绿。 飞行凌太虚，提携高上人。 控辔适十方，旋憩玄景阿。 仰观劫仞台，俯盼紫云罗。 逍遥太上京，相与坐莲华。 积学为真人，恬然荣卫和。 永享无期寿，万桩奚足多。 大道师玄寂，升仙有无英。 公子度灵符，太一捧洞章。 舍利耀金姿，龙驾倏来迎。 天尊盼云舆，飘飘乘虚翔。 香花若飞雪，氛霭茂玄梁。 头脑礼金阙，携首遨玉京。 骞树圆景园，焕烂七宝林。 天兽三百名，狮子巨万寻。 飞龙踯躅吟，神凤应节呜。 灵风扇奇华，清香散人襟。 自无高仙才，焉能耽此心。 严我九龙驾，乘虚以逍遥。 八天如指掌，六合何足辽。 众真诵洞玄，太上唱清谣。 香华随风散，玉音成紫霄。 五苦一时迸，八难顺经寥。 妙哉灵宝囿，兴此大法桥。 天真帝一宫，蔼蔼冠耀灵。 流焕法轮纲，旋空入无形。 虚皇抚云璈，众真诵洞经。 高仙凛手赞，弥劫保利贞。 至真无所待，时或辔飞龙。 长斋会玄都，呜玉叩琼锺。 十华诸仙集，紫烟结成宫。 宝盖罗太上，真人把芙蓉。 散花陈我愿，握节征魔王。 法鼓会群仙，灵唱靡不同。 无可无不可，思与希微通。 右《 玉京步虚十首》。 按《 太上玉京山步虚经》云：太极左仙翁葛玄於天台山传授弟子郑思远，思远复传仙翁从孙葛洪，号抱朴子者是也。 郑君说仙翁去世时告思远曰：所受《上清大洞道经》，付吾家门子弟，世世录传。 至人勿闭天道，信知琅函秘典贵在流通，兼经首所载诸大圣天尊、帝王高仙真人，各各持斋奉法，宗太上虚皇号，烧香散花，旋达七宝玄台三周匝。 诵披空洞大歌章，太上称善，则歌咏步虚，其功德深妙不可得而殚说也。 谨按藏经中斋法云：三日九朝，在每一朝之内各歌咏十首，令其周足。 每朝至旋绕之时，坛众未行，先举稽首礼太上，吟咏至末句，同唱善声，各一拜。 次举旋行蹑云罡，咏和。 次坛众，丁罡步徐行。 至末句同唱善声，各一拜。 次后每一首毕，同唱善声，皆各一拜。 又谓，如寻常一日三朝，可在三朝之内共周足其十首。 第一匝举稽首礼太上，吟咏至末句，同唱善声，各一拜。 第二匝举旋行蹑云纲，连过嵯峨玄都山通作一首，吟咏至末句，同唱善声，各一拜。",
      "translated_text": "**Ten \"Pacing the Void\" Hymns of Jade Capital**\n\nNuminous banners array the sacred canons,\nFeathered hymns pierce the cloud-borne chariots.\nAuspicious cranes soar through the firmament,\nPropitious winds dispel summer’s vexing heat.\nThe vaulted heavens resound in echo,\nMay the jeweled throne endure for myriad years.\n\n---\n\n**I**\nBowing in reverence to the Most High,\nWe burn incense and return to emptiness.\nLuminous radiance follows our return,\nThe Dharma-wheel completes its triple revolution.\nThe Mysterious Origin flourishes in fourfold majesty,\nBlessings extend to kings and lords.\nSeven generations ascend to celestial halls,\nResplendent, their glory unfurls in brilliance.\n\n**II**\nWhistling songs crown the vast desert,\nHeavenly music delights our joy.\nEqual fragrance exalts supreme virtue,\nLesser immortals cannot compare.\nWondrous thoughts illumine profound awakening,\nIn throngs they ride the void in flight.\nChanting reaches \"blessings extend to kings and lords\"—\nthe character *hou* now concealed.\n\n**III**\nTurning, we tread the cloud-bound net,\nRiding the void, we pace the Mysterious Record.\nWe chant in praise of the Emperor Unity,\nA hundred meridians harmonize of themselves.\nBelow, we command the Eight Seas’ youths;\nAbove, we escort the lofty immortals.\nAll heavens scatter fragrant blossoms,\nA serene numinous wind arises.\nLong-held vows root destiny’s core,\nThus we attain the highest eminence.\nRejoicing before the Most High,\nEven ten thousand kalpas are but a beginning.\n\n**IV**\nTowering, the Mysterious Capital’s mountain,\nThe ten directions revere the August One.\nLofty, the Heavenly Treasure Terrace,\nIts radiance outshines the flowing sun.\nResplendent, the jade grove’s blossoms,\nVermilion fruits gleam in dazzling splendor.\nEver mindful to feast on primordial essence,\nRefining the elixir to solidify form and substance.\nGolden light scatters through the Purple Tenuity,\nProfound and serene, the Great Vehicle’s ease.\n\n**V**\nThe preceding hymn’s rhymes all in *zhen* tone,\nNo concealed characters.\nThus, when presented at court, it was chanted as one,\nThe full verse intoned in unbroken song.\n\n**VI**\nLooking up and down, we revere the Most High,\nResplendent scenes adorn the cinnabar field.\nGazing left, we grasp the Dark Standard;\nTurning right, we hold the Linked Florescence.\nSix Perfections crown the Brahma-conduct,\nVirtue and power renew with the sun.\nAccumulated blessings from past lives respond,\nHearing the scriptures as if meeting kin.\nHeaven-endowed with transcendent talent,\nWe delight in reciting the subtle and wondrous text.\nIn the void, the Supreme Harmony’s *qi*,\nExhaling and inhaling the radiant mist’s essence.\nEmbryonic breathing stills a hundred meridians,\nIn solitude, we fathom the Three Conveniences.\nThe Mud-Pill Palace gleams with luminous scenes,\nThus we become Golden Flower Immortals.\nDemon kings respectfully receive our charge,\nEnabling us to ascend all heavens.\nAll begins with fasting and precepts,\nLayered merits bind past-life verdure.\nSoaring through the Great Void,\nWe uplift the exalted ones.\nGuiding the reins to the ten directions,\nWe circle and rest on the Mysterious Radiance’s slope.\nGazing up at the Kalpa Terrace,\nLooking down upon the Purple Cloud Net.\nCarefree in the Most High’s capital,\nTogether we sit upon lotus blossoms.\n\n**VII**\nThrough accumulated study, we become Perfected,\nTranquil, our *ying* and *wei* harmonize.\nEternally enjoying boundless longevity,\nWhat are ten thousand kalpas but a trifle?\n\n**VIII**\nThe Great Dao’s master is profound stillness,\nAscending as immortals with the Peerless Hero.\nThe Noble Scion bestows the numinous talisman,\nThe Great One bears the Cavernous Scripture.\nRelics gleam with golden splendor,\nDragon-drawn chariots swiftly arrive to welcome.\nThe Heavenly Worthy gazes upon the cloud-borne carriage,\nFloating, floating, we ride the void in flight.\nFragrant blossoms fall like flying snow,\nMists and vapors enrich the Mysterious Beam.\nBowing our heads before the Golden Portal,\nWe lift our gaze to roam Jade Capital.\nThe Kāśa Tree graces the Round Radiance Garden,\nResplendent, the Seven Treasures’ grove.\nThree hundred celestial beasts in name,\nLions vast as ten thousand *xun*.\nFlying dragons pace and chant,\nDivine phoenixes sing in rhythmic harmony.\nNuminous winds fan wondrous blossoms,\nPure fragrance scatters upon our robes.\nWithout transcendent immortal talent,\nHow could one indulge such aspirations?\n\n**IX**\nWe array our nine-dragon carriage,\nRiding the void in carefree ease.\nThe Eight Heavens lie within our grasp,\nThe Six Directions—how could they be distant?\nAll Perfected chant the Cavernous Mystery,\nThe Most High sings a pure melody.\nFragrant blossoms scatter with the wind,\nJade tones form the Purple Empyrean.\nThe Five Sufferings burst forth at once,\nThe Eight Difficulties follow the scriptures’ emptiness.\nWondrous indeed, the Numinous Treasure’s preserve,\nRaising this great Dharma-bridge.\n\n**X**\nThe Celestial Emperor Unity’s palace,\nLush and radiant, crowns numinous glory.\nFlowing brilliance follows the Dharma-wheel’s net,\nTurning through the void into formlessness.\nThe Void Sovereign plucks the cloud-lute,\nAll Perfected recite the Cavernous Scripture.\nLofty immortals, solemn in hand-clasped praise,\nThrough endless kalpas, they preserve integrity.\nThe Utmost Perfected await nothing,\nAt times they rein in flying dragons.\nLong fasts convene in the Mysterious Capital,\nJade chimes resound, striking crystal bells.\nThe Ten Blossoms’ immortals gather,\nPurple mists coalesce into a palace.\nJeweled canopies array the Most High,\nPerfected Ones hold lotus blossoms.\nScattering flowers, we declare our vows,\nGrasping the tally, we subdue demon kings.\nDharma-drums assemble the host of immortals,\nNuminous chants—none differ.\nNeither this nor that—no fixed form,\nOur thoughts commune with the subtle and wondrous.\n\n---\n\n**Right: Ten \"Pacing the Void\" Hymns of Jade Capital**\n\nAccording to the *Scripture of Pacing the Void on Jade Capital Mountain of the Most High*: The Left Immortal Elder Ge Xuan of the Great Ultimate transmitted it to his disciple Zheng Siyuan on Mount Tiantai. Siyuan, in turn, passed it to the Elder’s grandnephew Ge Hong, known as the Master Who Embraces Simplicity. Master Zheng recounted that when the Immortal Elder passed away, he told Siyuan: \"The *Supreme Clarity Great Cavern Dao Scripture* you have received shall be entrusted to our family’s disciples, to be transcribed and transmitted through generations. Perfected Ones do not conceal the Heavenly Dao. Truly, the precious jade-casket secret canon’s value lies in its circulation.\" Moreover, the scripture’s preface records that all the great sagely Heavenly Worthies, emperors, lofty immortals, and Perfected Ones each observed fasts, upheld the Dharma, revered the title of the Void Sovereign Most High, burned incense, scattered flowers, and circumambulated the Seven Treasures’ Mysterious Terrace three times. Reciting and chanting the great hymn chapters of the Empty Cavern, when the Most High praised them, they sang and paced the void—its meritorious virtues profound and wondrous beyond exhaustive description.\n\nRespectfully following the fasting methods in the canon: for three days and nine dawns, within each dawn, ten hymns are sung to complete the cycle. During each dawn’s circumambulation, before the altar assembly proceeds, they first perform the bow of reverence to the Most High, chanting to the final line, then together intone the sound of praise, each bowing once. Next, they begin the circumambulation, treading the cloud-bound net, chanting in harmony. Then the altar assembly, stepping the *ding*-pattern, proceeds slowly. Upon reaching the final line, they together intone the sound of praise, each bowing once. After each hymn, they again intone the sound of praise, each bowing once. Alternatively, for a single day’s three dawns, the ten hymns may be completed within them. The first circumambulation begins with the bow of reverence to the Most High, chanting to the final line, then together intoning the sound of praise, each bowing once. The second circumambulation begins with treading the cloud-bound net, continuing through \"Towering, the Mysterious Capital’s mountain\" as one hymn, chanting to the final line, then together intoning the sound of praise, each bowing once.",
      "overlap_context": "m jade lotuses.\n\nThrough the void, they rein in dragon steeds,\nBrahma tones guide the *zhipeng* chariots.\nEternally spanning the long spring kalpa,\nThey soar through the formless heavens.\n\nTo the initial perfected, it is hard to explain—\nThus we admonish the immortals of the middle ranks.\n\nLofty perfected ones elucidate the Dao and virtue,\nBequeathing to the world five thousand words.\nIn explanation, we humbly acknowledge our shallowness,\nYet with utmost sincerity, we fathom the wondrous origin.",
      "start_char": 8863,
      "end_char": 10122,
      "start_sentence": 543,
      "end_sentence": 625,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.579094648361206,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\玉音法事.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "绿此二首，悉皆仄声，所以共作一次吟咏也。 第三匝举俯仰存太上，吟咏至末句，同唱善声，各一拜，正合早朝也。 余有六首，分在午朝、晚朝之内，每一匝吟咏一首。 如此则三朝之内十首亦周足矣。 乃合朝奏玉京山全咏之式也。 如吟咏步虚，若阙一首，恐在登坛朝奏祈祷之时，诚心不专，难以鉴格上圣高真。 大凡醮筵，登坛行道，惟在旋绕朝奏玉京山之时，存想金阙琼宫、晬容圣质尔。 然后可以祈恩请福，祓死度生。 今观仙翁所传，乃是郑君声说。 盖欲流传后人，使之依式而行。 既览经典所载，岂容缄藏，敬刻诸梓，与众共之。 切在精虔，勿生疑虑，庶几得获圣佑，同沾福利。 空洞灵章 曜明高映，宗飘通玄。 元始开圆，敷落五篇。 赤书宝箓，黄云四缠。 八威备卫，灵兽侍真。 华光饰发，反香拂尘。 绮合长阜，旋过十天。 高唱空洞，症步入玄。 枯魂升阳，灰骸还人。 神王度命，乘虚驾烟。 礼诵洞章，与劫齐年。 右曜明、宗职，天帝君道经空洞灵章也。 三十二天各有一篇，或四言，或五言。 见洞元部灵宝空洞灵章。 奉戒颂 道为无心宗。 一切作福田。 立功无定王，本愿各由人。 虚己应众生，空心莫不均。 大圣崇至教，亦由雨降天。 高陵靡不周，常卑故成渊。 海为百川王，是能舍龙麟。 万劫保智用。 岂但在厥年。",
      "translated_text": "These two hymns, both in oblique tones, are thus chanted together as one. The third circumambulation begins with bowing low and reverently contemplating the Most High, chanting to the final line, then together intoning the sound of praise, each bowing once—this completes the dawn audience. The remaining six hymns are distributed within the noon and evening audiences, one hymn chanted per circumambulation. Thus, the ten hymns are fully completed within the three audiences, conforming to the proper rite for the full recitation of the *Yujing Shan* during the court audience.\n\nWhen chanting the *Step-Void Hymns*, should even one hymn be omitted, at the moment of ascending the altar to present the court audience and offer prayers, the sincerity of the heart may falter, making it difficult to be witnessed by the august and lofty perfected ones. In all ritual feasts, when ascending the altar to perform the Dao, it is only during the circumambulation and court audience of *Yujing Shan* that one must visualize the golden towers and jade palaces, beholding the sacred countenance of the deities. Only then may one pray for blessings and grace, dispel death and deliver life.\n\nWhat we now observe in the transmission of the immortal elders is the very voice of Master Zheng. It is meant to be passed down to later generations, that they may follow the prescribed form. Having beheld what is recorded in the scriptures, how could one keep it sealed away? With reverence, it is carved into printing blocks to be shared with all. One must cultivate utmost devotion, casting aside all doubt, that one may receive the protection of the sages and together partake in blessings and fortune.\n\n**Radiant and Luminous**\nRadiant and luminous, soaring high,\nThe ancestral breeze traverses the mysterious.\nThe Primal Beginning unfolds the circle,\nDispersing the five chapters.\nThe vermilion script of the sacred register,\nEnwrapped by yellow clouds on four sides.\nThe eight mights stand guard,\nSpirit beasts attend the perfected.\nResplendent light adorns the hair,\nReflected incense brushes away dust.\nThe embroidered confluence stretches long,\nCircumambulating past the ten heavens.\nChanting aloud the *Kongdong*,\nTreading the *zheng*-step into the profound.\nWithered souls ascend to yang,\nAshen bones return to humanity.\nThe spirit sovereign delivers destiny,\nRiding the void, mounting the mist.\nIn reverent recitation of the *Dong* chapters,\nOne’s years equal the kalpas.\n\nAbove: *Radiant and Luminous* and *Ancestral Office*—the *Dao Sutra of the Heavenly Thearch* from the *Kongdong* sacred hymns. Each of the thirty-two heavens has its own hymn, some in four-character lines, others in five. See the *Kongdong* sacred hymns in the *Dongyuan* section of the *Lingbao* canon.\n\n**Hymn of Upholding the Precepts**\nThe Dao is the heartless origin,\nAll things become fields of merit.\nEstablishing merit has no fixed lord,\nEach vow arises from the person.\nEmptying the self to respond to sentient beings,\nAn open heart leaves none unequal.\nThe great sages exalt the supreme teaching,\nJust as rain falls from the heavens.\nLofty peaks embrace all without exception,\nYet the humble become profound.\nThe sea is king of a hundred rivers,\nFor it can forsake dragons and scales.\nThrough ten thousand kalpas, wisdom is preserved—\nHow could it be limited to one’s own years?",
      "overlap_context": "ce. Alternatively, for a single day’s three dawns, the ten hymns may be completed within them. The first circumambulation begins with the bow of reverence to the Most High, chanting to the final line, then together intoning the sound of praise, each bowing once. The second circumambulation begins with treading the cloud-bound net, continuing through \"Towering, the Mysterious Capital’s mountain\" as one hymn, chanting to the final line, then together intoning the sound of praise, each bowing once.",
      "start_char": 10122,
      "end_char": 10638,
      "start_sentence": 626,
      "end_sentence": 661,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.58603596687317,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\玉音法事.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "奉戒不暂亏，世世善结缘。 精思念大乘。 会当体道真。 三启三首 乐法以为妻，爱经如珠玉。 持戒制六情，念道遣所欲。 澹泊正气停，萧然神静默。 天魔并敬护，世世受大福。 郁郁家国盛，济济经道兴。 天人同其愿，缥缈入大乘。 因心立福田，靡靡法轮升。 七祖生天堂，我身白日腾。 大这洞玄虚，有念无不契。 炼质入仙真，遂成金刚体。 超度三界难，地狱五苦解。 悉归太上经，静念稽首礼。 启堂颂 学道当劲苦，敛信运丹诚。 烧香归太上。 真炁杂烟馨。 惟希开大有。 七祖离幽冥。 敷斋颂 道以斋为先，勤行登金阙。",
      "translated_text": "**Hymn of Upholding the Precepts (continued)**\nTo uphold the precepts without momentary lapse,\nLife after life, good affinities are formed.\nWith focused thought, one contemplates the Great Vehicle—\nIn time, the truth of the Dao shall be embodied.\n\n**Three Invocations, Three Praises**\nDelight in the Dharma as one’s spouse,\nCherish the scriptures as pearls and jade.\nUphold the precepts to restrain the six senses,\nContemplate the Dao to dispel desires.\nIn tranquility, the upright qi abides;\nIn serenity, the spirit is still and silent.\nHeavenly demons all revere and protect,\nLife after life, great blessings are received.\nFlourishing are the household and kingdom,\nProspering are the scriptures and the Dao.\nHeavenly beings share this vow,\nIn subtle realms, one enters the Great Vehicle.\nFrom the heart, fields of merit are established,\nAs the Dharma wheel ascends in boundless ascent.\nSeven generations ascend to the heavens,\nWhile this body soars in broad daylight.\nThe great Dao abides in the profound void—\nWith thought, none fails to align.\nRefining the form to join the immortals,\nOne attains the adamantine body.\nTranscending the three realms’ trials,\nThe five sufferings of hell are dissolved.\nAll return to the Supreme Scriptures,\nIn silent contemplation, bowing in reverence.\n\n**Invocation for the Hall**\nTo cultivate the Dao, one must be steadfast and resolute,\nGathering faith to refine sincerity.\nBurning incense, one turns to the Supreme,\nTrue qi mingles with fragrant smoke.\nMay the great abundance be revealed,\nThat seven generations depart the dark underworld.\n\n**Hymn of the Ritual Fast**\nThe Dao takes fasting as its foremost practice,\nThrough diligent observance, one ascends the golden portals.",
      "overlap_context": "me fields of merit.\nEstablishing merit has no fixed lord,\nEach vow arises from the person.\nEmptying the self to respond to sentient beings,\nAn open heart leaves none unequal.\nThe great sages exalt the supreme teaching,\nJust as rain falls from the heavens.\nLofty peaks embrace all without exception,\nYet the humble become profound.\nThe sea is king of a hundred rivers,\nFor it can forsake dragons and scales.\nThrough ten thousand kalpas, wisdom is preserved—\nHow could it be limited to one’s own years?",
      "start_char": 10638,
      "end_char": 10888,
      "start_sentence": 662,
      "end_sentence": 685,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.283039569854736,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\玉音法事.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "故设大法桥，溥度诸人物。 宿世恩德报。 道心超然发。 身飞升玄都，七祖咸解脱。 大学仙颂 学仙绝华念，念念相因积。 去来乱我神，神躁靡不历。 减念停虚闲，萧萧入空寂。 请经若饥渴，持志如金石。 保子飞玄路，五灵度符籍。 小学仙颂 学仙行为急，奉戒制情心。 虚夷正炁居，仙圣自相寻。 若不信法言，胡为栖山林。 焚词颂 人天多障累，大道实矜怜。 救度垂科教，咸令忏罪缘。 愆辜遍地府，衅结已闻天。 发露祈真佑，冥心感圣贤。 虔恭礼三宝，愿得寿长年。 焚词归上界，奏名玉帝前。 山简 祈真登紫岳，告命诣灵山。 玉女摇梵响，金童奏香烟。 书名通九地，列字上三天。 永享无期寿，克成高上仙。 水简 天尊留戒律，太上演真经。 奉法须勤志，功德贵精神。 虔心启三宝，焚香告百灵。 书名投水府，功勋达上清。 天尊留大法，广救度幽冥。 斋福行当息，龙简告泉庭。 七祖咸解脱，万福自来并。 书名投水府，功勋达上清。 土简 斋功已成就，符命告灵坛。 玉璧书诚悃，金龙信驿传。 虔心仰中府，归命拱黄圆。 生死皆快乐，会当礼天颜。 赤明开元图，和阳通上灵。 玉阜秀琼宫，万遍道自居。 自无黄箓简，苦根焉得除。 旋行诵洞章，五云自相扶。 整控启玄极，乘运入中天。 披空献心宝，妙学其身田。 日宫散和炁，寥庭腾愿烟。 土简难思议，降福惠无边。 元始流科训，高真演洞神。 丹书华晃耀，玉字勒精神。 虔心启九天，修斋达万灵。 书名投土府，身飞朝玉清。 智惠颂 智惠起本初，朗朗超十方。 结空峙玄霄，诸天挹流芳。 其妙难思议，虚感真实通。 有有竟不有，无无无不无。 智惠常观身，学道之所先。 缈缈任玄肆，自然录我神。 天尊常拥护，魔王为保言。 晃晃金刚体，超超太上前。 智惠生戒根，真道戒为主。 三宝由是兴，高仙所崇授。 泛此不死舟，倏欻济大有。 当此说戒时，诸天皆稽首。 沐浴东井颂 天河灌东井，石景水母精。 圆光拂灵曜，玄映莹高明。 元始披重夜，天人逐月生。 沐浴兰池上，龙负长绠瓶。 金童洒香水，玉女流五星。 冠带耀玉精，炼度五仙形。 体香万神降，秉景登高明。 清水度魂咒 巍巍道德尊，功行已周齐。 降身来接引，师宝自相携。 慈悲惠法水，以用洗迷愚。 永度三清岸，常辞五浊泥。 天真六通颂 天真六通神，人造善绿者。 为彼诸众生，说诸不惭愧。 天尊秘密语，此时闻演说。 信受各归依，稽首无上尊。 返生颂炼度用 代谢若旋环，椿木不改柯。 静心念至真，随运顺离罗。 常能诵玉章，玄音彻霄霞。 永享无终纪，岂知年劫多。 金木颂 扶桑启灵运，金木吐青芽。 妙用流金母，和合自然葩。 神炁凝元宫，灵物耀绛霞。 自得生人道，名籍继仙家。 朱陵黄华太一三偈 南上朱陵府，丹天流火庭。 玉眸炼形质，即返生。 大圣玉眸炼质天尊。 东井黄华沼，石景水母精。 黄华荡形魂，即更生。 大圣黄华荡形天尊。 东极长乐界，青华号福庭。 寻声救苦魂，即往生。 大圣太乙救苦天尊。 七言古散花 南斗斓珊北斗移，众星情璨月华辉。 元始传言齐授箓，道君开教尽归依。 小有洞中千秋草，玉京山上万年桃。 九龙阙上集真圣，八仙台畔步虚谣。 三真玉女持花节，一双童子捧金炉。 月帔珠穿九彩绶，云衣香透六铢裾。",
      "translated_text": "Thus is the great Dharma Bridge established,\nTo universally ferry all beings and creatures.\nRepaying the kindness and virtue of past lives,\nThe Dao-heart arises in transcendent clarity.\nThe body soars to the Mystic Capital,\nAnd the seven ancestors all attain liberation.\n\n**Hymn of Great Learning for Immortality**\nTo learn immortality, sever all ornate thoughts,\nEach念 intertwines and accumulates.\nComing and going disturb my spirit,\nWith restless agitation, nothing remains unscathed.\nDiminish thoughts, still the void and leisure,\nIn desolate emptiness, enter profound silence.\nSeek the scriptures as if parched with thirst,\nHold resolve firm as metal and stone.\nPreserve the child to traverse the Mystic Path,\nThe Five Spirits bestow the registers of passage.\n\n**Hymn of Lesser Learning for Immortality**\nTo learn immortality, action is urgent,\nUphold the precepts to restrain the heart’s passions.\nIn emptiness and equanimity, the true qi resides,\nWhere immortals and sages naturally converge.\nIf one does not trust the Dharma’s words,\nWhy dwell in the mountains and forests?\n\n**Hymn of the Burning Petition**\nThe worlds of humans and gods abound in obstacles,\nYet the great Dao truly pities and cherishes.\nSalvation and deliverance extend through teachings and disciplines,\nAll are enabled to repent their karmic entanglements.\nTransgressions fill the earthly courts,\nOffenses have reached the heavens.\nRevealing all, one prays for the true ones’ protection,\nWith a serene heart, one moves the sages and worthies.\nReverently bowing to the Three Treasures,\nMay one attain longevity and long years.\nThe burning petition ascends to the upper realms,\nNames are presented before the Jade Emperor.\n\n**Mountain Petition**\nPraying to the true ones, one ascends the Purple Peak,\nPresenting one’s mandate at the sacred mountain.\nJade maidens sway with the sound of Sanskrit,\nGolden lads offer fragrant incense.\nNames are inscribed to penetrate the nine earths,\nCharacters are arrayed to ascend the three heavens.\nMay one eternally enjoy boundless life,\nAnd accomplish the loftiest immortality.\n\n**Water Petition**\nThe Heavenly Worthy left the precepts,\nThe Most High expounded the true scriptures.\nTo uphold the Dharma, one must be diligent in resolve,\nMerit and virtue treasure the spirit’s essence.\nWith reverent heart, invoke the Three Treasures,\nBurn incense to announce to the hundred spirits.\nInscribe names and cast them into the water府,\nMeritorious deeds reach the Supreme Clarity.\nThe Heavenly Worthy left the great Dharma,\nTo broadly deliver those in the dark underworld.\nWhen the merit of the fast is complete,\nThe Dragon Petition announces to the spring courts.\nThe seven ancestors all attain liberation,\nMyriad blessings naturally converge.\nInscribe names and cast them into the water府,\nMeritorious deeds reach the Supreme Clarity.\n\n**Earth Petition**\nThe merit of the fast is accomplished,\nThe talismanic mandate announces at the sacred altar.\nJade tablets inscribe sincere devotion,\nGolden dragons swiftly transmit the pledge.\nWith reverent heart, one gazes toward the Central府,\nReturning life to the Yellow Circle.\nIn life and death, all find joy,\nAnd shall meet to bow before the celestial countenance.\nThe Crimson Radiance unfolds the Primordial Chart,\nHarmonious yang communicates with the upper spirits.\nJade mounds adorn the jasper palaces,\nMyriad traversals, the Dao naturally dwells.\nWithout the Yellow Register Petition,\nHow could the roots of suffering be eradicated?\nCircumambulating, recite the Cavern Chapters,\nThe Five Clouds naturally support one another.\nAligning and controlling, one opens the Mystic Ultimate,\nRiding the current to enter the Central Heaven.\nUnveiling the void, one offers the treasure of the heart,\nSubtly cultivating the field of the body.\nFrom the Solar Palace, harmonious qi disperses,\nIn the vast courtyard, the smoke of vows ascends.\nThe Earth Petition is beyond comprehension,\nBestowing blessings and grace without limit.\nThe Primordial Beginning transmitted the disciplinary teachings,\nThe lofty perfected expounded the Cavern Spirits.\nCinnabar writings radiate resplendent light,\nJade characters inscribe the spirit’s essence.\nWith reverent heart, invoke the Nine Heavens,\nThrough the fast, reach the myriad spirits.\nInscribe names and cast them into the earth府,\nThe body ascends to pay homage in the Jade Clarity.\n\n**Hymn of Wisdom**\nWisdom arises from the primordial beginning,\nBright and luminous, it transcends the ten directions.\nWeaving the void, it stands in the Mystic Empyrean,\nAll heavens draw from its flowing fragrance.\nIts wonders are beyond comprehension,\nThrough emptiness, true and real communicate.\nBeing is ultimately non-being,\nNon-being is not without non-being.\nWisdom constantly observes the body,\nIt is the foremost in learning the Dao.\nIn subtle subtlety, it roams the Mystic Expanse,\nNaturally recording my spirit.\nThe Heavenly Worthy ever protects and shelters,\nThe demon kings pledge their guardianship.\nResplendent is the adamantine body,\nTranscending all before the Most High.\nWisdom engenders the root of precepts,\nThe true Dao takes precepts as its master.\nThe Three Treasures arise from this,\nBestowed by the lofty immortals.\nBoarding this deathless vessel,\nSwiftly cross the great abundance.\nAt this moment of expounding the precepts,\nAll heavens bow in reverence.\n\n**Hymn of Bathing in the Eastern Well**\nThe Celestial River pours into the Eastern Well,\nStone radiance and the Water Mother’s essence.\nCircular light brushes the numinous brilliance,\nMystic reflections gleam with lofty clarity.\nThe Primordial Beginning parts the heavy night,\nHeavenly beings follow the moon’s birth.\nBathing atop the Orchid Pond,\nDragons bear the long-handled vase.\nGolden lads sprinkle fragrant water,\nJade maidens stream the Five Stars.\nCrowns and sashes gleam with jade essence,\nRefining and delivering the Five Immortals’ forms.\nThe body fragrant, myriad spirits descend,\nGrasping the radiance, one ascends to lofty clarity.\n\n**Incantation of the Pure Water for Delivering Souls**\nMajestic is the Dao and its virtue,\nMeritorious deeds have reached completion.\nDescending to receive and guide,\nThe Precious Master naturally accompanies.\nCompassionate and merciful, bestow the Dharma water,\nTo wash away delusion and ignorance.\nEternally deliver to the Three Clarities’ shores,\nForever departing the Five Turbidities’ mire.\n\n**Hymn of the Six Heavenly Penetrations**\nThe six penetrations of the heavenly perfected,\nThose who cultivate goodness.\nFor all these sentient beings,\nExpound the teachings without shame.\nThe Heavenly Worthy’s secret words,\nAt this time are heard and expounded.\nFaithfully accepting, each returns to refuge,\nBowing to the Supreme Worthy.\n\n**Hymn of Rebirth for Refining and Deliverance**\nThe vicissitudes turn like a wheel,\nThe camphor tree’s branches remain unchanged.\nWith a tranquil heart, contemplate the utmost truth,\nFollow the current, comply with separation and union.\nConstantly recite the jade chapters,\nMystic sounds pierce the clouds and rosy dawn.\nEternally enjoy boundless time,\nHow could one know the multitude of kalpas?\n\n**Hymn of Metal and Wood**\nFusang initiates the numinous movement,\nMetal and wood sprout verdant buds.\nWondrously, the Golden Mother flows,\nHarmonizing the natural blossoms.\nSpiritual qi congeals in the Primordial Palace,\nNuminous beings radiate crimson rosy clouds.\nNaturally attaining the human Dao,\nNames are recorded in the immortals’ lineage.\n\n**Three Verses of the Vermilion Mound, Yellow Flower, and Great Unity**\nTo the south, the Vermilion Mound府,\nIn the Cinnabar Heaven, flames flow through the courtyard.\nJade eyes refine the bodily form,\nInstantly returning to life.\nGreat Sage, Jade-Eyed Refiner of Forms, Heavenly Worthy.\n\nIn the Eastern Well’s Yellow Flower Pool,\nStone radiance and the Water Mother’s essence.\nYellow flowers sway the soul and form,\nInstantly renewing life.\nGreat Sage, Yellow Flower Swaying Forms, Heavenly Worthy.\n\nIn the Eastern Ultimate’s Realm of Eternal Joy,\nThe Azure Flower is called the Court of Blessings.\nFollowing the sound, deliver the suffering souls,\nInstantly departing to be reborn.\nGreat Sage, Great Unity Deliverer of Suffering, Heavenly Worthy.\n\n**Seven-Character Ancient Verse for Scattering Flowers**\nThe Southern Dipper glistens, the Northern Dipper shifts,\nAll stars shine brilliantly, the moon’s radiance gleams.\nThe Primordial Beginning transmitted words, all receive the registers,\nThe Dao Lord opened the teachings, all return to refuge.\nIn the Lesser Existence Grotto, the thousand-year herbs,\nOn the Jade Capital Mountain, the ten-thousand-year peaches.\nAt the Nine Dragons’ Gate, the perfected saints gather,\nBy the Eight Immortals’ Terrace, the void-traversing hymns resound.\nThree Perfected Jade Maidens hold the flower scepters,\nA pair of lads bear the golden censers.\nMoon mantles with pearls strung through nine-colored cords,\nCloud robes fragrant, permeating the six-pound hems.",
      "overlap_context": " the Supreme Scriptures,\nIn silent contemplation, bowing in reverence.\n\n**Invocation for the Hall**\nTo cultivate the Dao, one must be steadfast and resolute,\nGathering faith to refine sincerity.\nBurning incense, one turns to the Supreme,\nTrue qi mingles with fragrant smoke.\nMay the great abundance be revealed,\nThat seven generations depart the dark underworld.\n\n**Hymn of the Ritual Fast**\nThe Dao takes fasting as its foremost practice,\nThrough diligent observance, one ascends the golden portals.",
      "start_char": 10888,
      "end_char": 12208,
      "start_sentence": 686,
      "end_sentence": 795,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 48.326865911483765,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\玉音法事.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "五言散花 逸辔登紫清，元乘迈奔电。 阆风三天，俯视犹可见。 玉闼摽敞朗，琼林郁葱蒨。 自非挺金骨，焉得谐夙愿。 真明何森森，合景恣游宴。 良会忘淹留，千龄才一盻。 三宫发明景，朗照同郁仪。 纷然驰飙欻，上采空清蕤。 令我洞金色，后天耀琼姿。 心协太虚静，寥寥竟何思。 玄中有至乐，淡泊终无为。 但与正真友，飘飖散遨嬉。 禀化凝正炁，炼形为真仙。 志心符元宗，返本叶自然。 帝一集终宫，流光出丹玄。 元英与桃君，朗咏长生篇。 百关罗紫烟，飙车涉寥廓。 靡靡八景迂，不觉云路远，斯须游方天。 扶桑诞初景，羽盖凌晨霞。 倏欻造西域，嬉游金母家。 碧津湛洪源，灼烁敷荷花。 煌煌青琳宫，灿灿列玉华。 真炁溢绛府，自然思无邪。 俯矜区中士，天浊良可嗟。 琼台劫为仞，孤映大罗表。 常有三素云，凝光自飞达。 羽童泛明霞，升降何缥缈。 鸾凤吹雅音，栖翔绛林标。 玉虚无昼夜，灵景何皎皎。 一绪太上京，方知众天小。 灼灼青华林，灵风振琼柯。 三光无冬春，一炁青且和。 回首迩结璘，倾眸亲曜罗。 豁落制六天，流铃威百魔。 绵绵庆不极，谁谓椿龄多。 高情无侈靡，遇物生华光。 至乐无箫歌，金玉音琅琅。 或登明真台，宴此羽景堂。 杳霭结玉云，霏微散灵香。 天人诚遐旷，欢泰不可量。 爰从太微上，肆觐虚皇尊。 腾我八景舆，威迟入天门。 既登玉晨庭，肃肃仰紫轩。 敢问龙汉末，如何辟乾坤。 怡然辍云傲，告我布夷言。 幸闻至精理，方见造化源。 二炁播万有，化机无停轮。 而我操其端，乃能出陶钧。 寥寥大漠上，所遇皆清真。 澄莹含元和，炁同自相亲。 绛树结丹实，紫霞流碧津。 以兹保童婴，永用超形神。 宋真宗制玉清昭应宫散花词十首 散花何处最花多，天上高天有大罗。 花在此中生本异，况将瑞露庆云和。 昆丘绝顶有龟台，台上奇花四序开。 不是群仙朝玉帝，何由得到世间来。 天上天花旦夕开，不同人世待春来。 天花每有天人折，将献层城日几回。 瑶台光夜露华滋，月帔朝真在此时。 时有仙花空裹降，吹来玉宇奉金姿。 五色华花降洞天，仰观空裹势翩翩。 莫言仙镜常时有，动是人寰亿万年。 仙花折得自仙宫，散在珍台晓景中。 玉阙有春春不老，璇图受福福无穷。 羽客骖鸾在半天，下瞻真馆意乾乾。 蓬莱折得花无数，散在殊庭黼座前。 上林花卉先春发，幽谷莺声尚未知。 不遣常人攀折得，尽将福地奉真期。 洞中三十六天春，仙境由来异世人。 采得名花何处去，将来宫殿奉高真。 仙官真倡往还频，互看蓬莱阆苑春。 每采芳花朝上帝，愿均福地及生民。 太极太虚真人歌三涂五苦颂八首 三才及万物，倚伏各有龄。 终始待劫数，福尽天地倾。 往返於五道，苦哉更死生。 展转三途中，去来与祸并。 大贤慎兹戒，忍性念割情。 愚夫不信法，罪痛常自婴。 吾念世无已，今故重告明。 若欲度斯祸，归命太上经。 罪福不由它，谅自发尔身。 大贤故闭口，欲绝诸恶绿。 灭念归兼志，倚伏待长泯。 弘道以安世，终当见其真。 媱嫉为祸首，灭身之至患。 含养知此辈，恐必致夭残。 知恶而不革，岂是道所安。 怀毒日斋直，令我发长叹。 宿命有信然，弱丧谓之无。 皆欲眼前见。 过目则言悠。",
      "translated_text": "**Five-Character Verse for Scattering Flowers**\n\nLight reins ascend the Purple Clarity,\nPrimal steed outpaces racing lightning.\nFrom the three heavens of Langfeng,\nGazing down—still visible below.\n\nJade gates gleam in boundless radiance,\nJasper groves flourish in lush verdure.\nWithout tempered bones of gold,\nHow could one fulfill long-cherished vows?\n\nTrue brightness, how vast and deep,\nMerged with light, we roam and feast.\nThis rare gathering forgets time’s passage,\nA thousand years but a single glance.\n\nThe Three Palaces emit bright effulgence,\nShining as one with the luminous canopy.\nSwiftly the whirlwind carries us,\nUpward to pluck the void’s pure blossoms.\n\nGranting me a golden-hued cavern,\nBeyond heaven, my jade form gleams.\nMy heart aligns with the Great Void’s stillness,\nIn boundless emptiness—what thoughts remain?\n\nWithin the mysterious lies supreme joy,\nIn tranquil non-action, perfect ease.\nOnly with the truly orthodox as friends,\nWe drift and soar in carefree play.\n\nReceiving transformation, we condense pure qi,\nRefining form to become true immortals.\nWith wholehearted devotion, we align with the Primal Source,\nReturning to the root, harmonizing with nature.\n\nThe Supreme Unity gathers in the Final Palace,\nStreaming light from the Cinnabar Mystery.\nYuan Ying and Peach Lord,\nRecite the Ode of Eternal Life.\n\nA hundred passages wreathed in purple mist,\nThe whirlwind chariot traverses the vast expanse.\nGently the Eight Radiant Realms unfold,\nUnnoticed, the cloud-path stretches far—\nIn an instant, we wander the Four Heavens.\n\nFusang births the first light,\nFeathered canopies greet the dawn’s glow.\nIn a flash, we arrive in the Western Realm,\nFrolicking in the Golden Mother’s abode.\n\nAzure streams brim with boundless source,\nGlowing, they unfold the lotus blooms.\nResplendent the Azure Jasper Palace,\nDazzling, the arrayed jade blossoms.\n\nTrue qi overflows the Crimson Palace,\nNaturally, thoughts remain free of wrong.\nLooking down in pity upon mortals,\nHow turbid the world—truly lamentable!\n\nThe Jasper Terrace stands a kalpa’s height,\nSolitary, it gleams beyond the Great Veil.\nEver present, the Three Pure Clouds,\nTheir congealed light soars freely.\n\nFeathered youths drift on bright mist,\nAscending and descending—how ethereal!\nPhoenixes and simurghs sound refined melodies,\nPerching and soaring in the crimson forest’s peaks.\n\nThe Jade Void knows no day or night,\nHow radiant the numinous light!\nOne thread leads to the Supreme Capital,\nOnly then do all heavens seem small.\n\nGlowing, the Azure Flower Grove,\nDivine winds stir the jasper branches.\nThe Three Luminaries know no winter or spring,\nOne qi—verdant and harmonious.\n\nTurning back, the near ones form a radiant cluster,\nGazing afar, we draw close to the shining web.\nVast and unbounded, we govern the Six Heavens,\nStreaming bells subdue the hundred demons.\n\nEndless, the blessings flow unceasing,\nWho says the cedar’s age is long?\nLofty sentiments shun excess,\nEncountering all things, they birth radiant splendor.\n\nSupreme joy needs no flute or song,\nGold and jade resound in melodious tones.\nNow ascending the Terrace of Bright Perfection,\nWe feast in the Hall of Feathered Splendor.\n\nMisty vapors weave jade clouds,\nSubtle fragrance scatters, divine incense wafts.\nHeavenly beings, truly distant and vast,\nTheir joy and peace beyond measure.\n\nFrom the Supreme Tenuity above,\nWe hasten to behold the Venerable Sovereign of the Void.\nLifting my Eight Radiant Chariot,\nMajestically we enter the Heavenly Gate.\n\nHaving ascended the Jade Dawn Court,\nReverently we gaze upon the Purple Portal.\nDare I ask of the Dragon Han’s end,\nHow was the cosmos opened?\n\nJoyfully setting aside cloud-borne pride,\nHe reveals to me the words of Yu Yi:\n“Fortunate to hear the essence of the utmost truth,\nOnly now do I see the source of creation.\n\nThe Two Qi propagate the ten thousand beings,\nThe mechanism of transformation knows no rest.\nYet I grasp its beginning,\nThus able to transcend the potter’s wheel.\n\nIn the vast desert of emptiness,\nAll I encounter are the pure and true.\nLimpid and lustrous, containing primordial harmony,\nQi naturally draws together in kinship.\n\nCrimson trees bear cinnabar fruit,\nPurple mists flow through azure streams.\nWith this, we preserve the Divine Infant,\nForever transcending form and spirit.”\n\n---\n\n**Ten Scattering Flowers Verses Composed by Emperor Zhenzong of Song for the Jade Clarity Radiant Response Palace**\n\nWhere does one scatter flowers most abundantly?\nIn heaven above, the Highest Heaven of Great Veil.\nFlowers here grow from a different root,\nBathed in auspicious dew and harmonious clouds.\n\nAtop the Kunlun’s peak stands the Tortoise Terrace,\nWhere wondrous flowers bloom through all four seasons.\nWere it not for the assembled immortals paying homage to the Jade Emperor,\nHow could they reach the mortal world?\n\nHeavenly flowers bloom day and night,\nUnlike the world below, awaiting spring’s return.\nEach time heavenly beings pluck them,\nHow often are they offered to the Tiered City?\n\nThe Jasper Terrace glows in night’s dewy splendor,\nAs moon-mantled immortals pay homage at dawn.\nAt times, celestial flowers descend from the void,\nBlown into jade halls, presenting golden forms.\n\nFive-colored blossoms descend upon the Grotto-Heaven,\nGazing upward, their flight through the void is graceful.\nSay not that immortal mirrors are ever-present,\nFor in the mortal realm, they appear but once in myriad ages.\n\nPlucked from the immortal palace,\nScattered upon the jeweled terrace in dawn’s light.\nThe Jade Tower knows eternal spring,\nThe Celestial Chart receives boundless fortune.\n\nFeathered adepts ride simurghs in mid-heaven,\nLooking down upon the true abodes with earnest hearts.\nFrom Penglai, countless flowers are gathered,\nScattered before the embroidered thrones of the sacred precincts.\n\nThe flowers of the Supreme Grove bloom before spring,\nThe orioles of secluded valleys remain unaware.\nNot permitting ordinary folk to pluck them,\nAll are offered to the blessed lands to honor the true rites.\n\nWithin the grotto, thirty-six heavens know spring,\nImmortal realms differ from the world of men.\nWhere do the gathered blossoms go?\nBrought to the palaces to honor the exalted perfected.\n\nImmortal officials and true singers come and go frequently,\nGazing upon Penglai and Lang Garden’s spring.\nEach time they pluck fragrant flowers to offer the Emperor,\nMay the blessed lands’ fortune extend to all living beings.\n\n---\n\n**Eight Hymns of Praise for the Three Paths and Five Sufferings by the Perfected of the Supreme Ultimate and Great Void**\n\nThe Three Powers and the ten thousand things,\nInterdependent, each has its span.\nBeginning and end await the kalpa’s reckoning,\nWhen fortune is exhausted, heaven and earth collapse.\n\nTraversing the Five Paths,\nHow bitter—repeated death and rebirth!\nTurning through the Three Realms,\nComing and going with calamity.\n\nThe great wise heed this warning,\nEnduring nature, contemplating the severance of desire.\nFoolish men do not believe the Dharma,\nTheir sins and pains ever cling to them.\n\nI grieve that the world’s suffering knows no end,\nThus I earnestly proclaim this truth anew:\nIf you wish to escape this calamity,\nTake refuge in the Supreme Scriptures.\n\nSin and fortune arise not from elsewhere,\nThey surely spring from your own being.\nThe great wise thus seal their lips,\nSeeking to extinguish all evil roots.\n\nExtinguishing thoughts, uniting will,\nInterdependence awaits ultimate dissolution.\nExpounding the Dao to pacify the world,\nIn the end, one shall perceive its truth.\n\nEnvy and jealousy are the root of calamity,\nThe greatest peril to one’s existence.\nKnowing and nurturing such types,\nI fear they will surely meet early ruin.\n\nRecognizing evil yet not reforming,\nHow can this bring peace to the Dao?\nHarboring poison while feigning uprightness,\nIt makes me sigh deeply.\n\nThe certainty of past lives is undeniable,\nYet the weak and lost call it nonexistent.\nAll desire to see it before their eyes,\nBut once past, they dismiss it as distant.",
      "overlap_context": "o Lord opened the teachings, all return to refuge.\nIn the Lesser Existence Grotto, the thousand-year herbs,\nOn the Jade Capital Mountain, the ten-thousand-year peaches.\nAt the Nine Dragons’ Gate, the perfected saints gather,\nBy the Eight Immortals’ Terrace, the void-traversing hymns resound.\nThree Perfected Jade Maidens hold the flower scepters,\nA pair of lads bear the golden censers.\nMoon mantles with pearls strung through nine-colored cords,\nCloud robes fragrant, permeating the six-pound hems.",
      "start_char": 12209,
      "end_char": 13471,
      "start_sentence": 796,
      "end_sentence": 889,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 50.27373290061951,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\玉音法事.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "大贤明道教，惨戚悯顽夫。 依依念子苦，勤勤令我忧。 人命以销尽，亦犹膏中火。 四大暂相遇，五物权时假。 盛年当勤学，趋求存吾我。 福尽身神散，冥冥地狱下。 上圣畏是故，寻道度斯祸。 学仙行为急，奉戒制情心。 虚夷正气居，仙圣自相寻。 若不信法言，胡不栖山林。 大贤乐经戒，受之为身宝。 就学恒苦晚，治身恨不早。 比当披幽赜，倏忽年已老。 执卷叹尔极，将更死痛恼。 吾故及弱龄，弃世以学道。 出《 智惠本愿大戒经》 宫观祝圣仪堂献供文",
      "translated_text": "The great wise illuminate the Dao’s teachings,\nGrieving with sorrow for the stubborn and foolish.\nTenderly they ponder the suffering of such beings,\nDiligently they cause me deep concern.\n\nHuman life wears away to nothing,\nLike a flame consuming lamp oil.\nThe Four Elements briefly converge,\nThe Five Aggregates provisionally lend form.\n\nIn the prime of youth, one ought to study diligently,\nStriving to preserve one’s self and soul.\nWhen fortune is exhausted, body and spirit scatter,\nPlunging into the dark depths of hell.\n\nThe supreme sages, fearing this fate,\nSeek the Dao to escape such calamity.\nThe pursuit of immortality is urgent,\nObserving precepts to master the heart’s passions.\n\nWhere emptiness and equanimity dwell,\nThe primal qi abides in rectitude,\nAnd immortals and sages naturally gather.\n\nIf you do not trust these sacred words,\nWhy not retreat to the mountains and forests?\nThe great wise delight in scriptures and precepts,\nReceiving them as treasures for the body.\n\nTo embark on study is ever deemed too late,\nTo cultivate the self is ever rued as too tardy.\nBy the time one unravels profound mysteries,\nIn a fleeting instant, the years have aged them.\nClutching the scroll, they sigh in utmost despair,\nSoon to face the agony of death’s torment.\n\nThus, in my youthful years,\nI abandoned the world to study the Dao.",
      "overlap_context": "e shall perceive its truth.\n\nEnvy and jealousy are the root of calamity,\nThe greatest peril to one’s existence.\nKnowing and nurturing such types,\nI fear they will surely meet early ruin.\n\nRecognizing evil yet not reforming,\nHow can this bring peace to the Dao?\nHarboring poison while feigning uprightness,\nIt makes me sigh deeply.\n\nThe certainty of past lives is undeniable,\nYet the weak and lost call it nonexistent.\nAll desire to see it before their eyes,\nBut once past, they dismiss it as distant.",
      "start_char": 13471,
      "end_char": 13682,
      "start_sentence": 890,
      "end_sentence": 906,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.75522780418396,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\玉音法事.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "献粥 晨朝香粥，涤去凡尘。 当令受者，念道思真。 向来晨粥功德，无限胜因，恭为祝延皇帝圣寿无疆，龙图巩固。 为上因绿念 大圣和元始天尊，太上和大道君，　　太上和老君，无量和不可思议功德。 登斋举唱三宝　人各恭敬 志心稽首太上无极大道， 志心稽首三十六部尊经， 志心稽首玄中大法师。 平坐如法 献供文 香厨妙供，上献天尊，中献真圣，下及一切先生，普同供养。 斋毕　　念福生无量天尊 和福生无量天尊福生无量天尊 福生无量天尊福生无量天尊 施出生咒 勤修大道法，精心感太冥。 真降魔魅散，众妖皆灭形。 七祖生天堂，兆臣飞上清。 福既无不遍，此食施众生。 举解坐赞次念 向来修斋功德，无限胜因，恭为祝延皇帝圣寿无疆，龙图巩固，为上因绿念云云 施主设斋　举唱三宝同前 献供文",
      "translated_text": "**Morning Congee Offering**\n\nAt dawn, fragrant congee is offered,\nWashing away the dust of the mundane.\nMay all who partake\nContemplate the Dao and ponder the True.\n\nThe boundless meritorious causes of this morning’s congee,\nReverently dedicated to praying for the emperor’s infinite longevity,\nAnd the everlasting stability of the imperial reign.\n\nFor the supreme karmic conditions, we invoke:\nThe Great Sage and Primordial Heavenly Worthy,\nThe Most High and Great Dao Lord,\nThe Most High and Lord Lao,\nAnd the immeasurable, inconceivable merits.\n\n**Invoking the Three Treasures**\nLet each person reverently bow,\nWith devoted hearts, to the Most High Boundless Dao.\nWith devoted hearts, to the thirty-six revered scriptures.\nWith devoted hearts, to the Great Dharma Master of the Mystic Realm.\n\n**Seated in Proper Form**\n**Offering Text**\nExquisite offerings from the incense kitchen,\nPresented above to the Heavenly Worthies,\nIn the middle to the Perfected Sages,\nAnd below to all the Immortals,\nUniversally shared in offering.\n\n**Upon Completion of the Ritual Meal**\nRecite: *\"Fortune arises, boundless Heavenly Worthy.\"*\n*\"Fortune arises, boundless Heavenly Worthy. Fortune arises, boundless Heavenly Worthy.\"*\n*\"Fortune arises, boundless Heavenly Worthy. Fortune arises, boundless Heavenly Worthy.\"*\n\n**Incantation for Almsgiving**\nDiligently cultivate the great Daoist dharma,\nWith pure hearts, move the Supreme Mystery.\nThe true descends, demonic illusions scatter,\nAll malevolent spirits vanish without form.\nSeven generations ascend to heavenly realms,\nAll disciples soar to the Upper Clarity.\nFortune pervades without exception,\nThis food is bestowed upon all beings.\n\n**Raising the Cup, Seated in Praise**\nThe boundless meritorious causes of this ritual meal,\nReverently dedicated to praying for the emperor’s infinite longevity,\nAnd the everlasting stability of the imperial reign,\nFor the supreme karmic conditions, we invoke as before.\n\n**The Patron’s Ritual Meal**\nInvoking the Three Treasures as above.\n\n**Offering Text**",
      "overlap_context": "red words,\nWhy not retreat to the mountains and forests?\nThe great wise delight in scriptures and precepts,\nReceiving them as treasures for the body.\n\nTo embark on study is ever deemed too late,\nTo cultivate the self is ever rued as too tardy.\nBy the time one unravels profound mysteries,\nIn a fleeting instant, the years have aged them.\nClutching the scroll, they sigh in utmost despair,\nSoon to face the agony of death’s torment.\n\nThus, in my youthful years,\nI abandoned the world to study the Dao.",
      "start_char": 13682,
      "end_char": 14050,
      "start_sentence": 907,
      "end_sentence": 931,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.811735391616821,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\玉音法事.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "一切福田，施食为先。 见存快乐，已往生天。 当来净土，衣食自然。 是故供养，普献诸天。 香厨妙供，上献天尊，中献真圣，下及一切群生，普同供养。 福流斋主，如水归海。 斋毕　　举天尊号同前 施出生咒　　解坐说 不可思议功德海，浩浩无边太上尊。 肸响寻声赴道场，鉴此修斋无量善。 向来设斋功德，无限胜因，回福祝延，今辰斋主某身躬康秦，绿位增崇，凡历时中，吉祥如意。 伏愿斋功纪籍，道果资身。 齐龟鹤之修龄，介厖鸿之景福。 为上因缘，念度人无量天尊，不可思议功德。 送圣颂 回軿五云舆，腾驾九霄歌。 倏忽冲天远，醮坛香炁多。 玄恩覃宇宙，福禄遍山河。 缅想神仙路，逍遥上大罗。 披戴颂 云履",
      "translated_text": "All fields of merit begin with the offering of food.\nThose present enjoy bliss, those departed ascend to heaven.\nIn the Pure Land to come, clothing and sustenance arise naturally.\nThus, we make offerings universally to all the heavens.\nFrom the fragrant kitchen, exquisite offerings are made:\nAbove, to the Heavenly Worthies;\nIn the middle, to the Perfected Sages;\nBelow, to all sentient beings—\nAll are universally revered.\nBlessings flow to the patron of this ritual feast,\nLike rivers returning to the sea.\n\nUpon the conclusion of the feast, intone the Heavenly Worthy’s name as before.\nRecite the Incantation for Almsgiving, then rise and proclaim:\n\nThe sea of inconceivable meritorious power,\nVast and boundless, Supreme Honored One.\nResponding to the resonance, hastening to the ritual site at the sound’s call,\nYou witness this feast of boundless goodness.\n\nThe immeasurable meritorious causes of this ritual feast,\nNow dedicated in prayer for the patron, [Name],\nMay your body enjoy health and peace,\nYour rank ascend in glory,\nAnd through all time,\nMay fortune and felicity attend you.\n\nWe humbly pray that the merits of this feast be recorded,\nAnd the fruits of the Dao sustain your being.\nMay you attain the longevity of the tortoise and crane,\nAnd be blessed with the vast fortune of the great Peng.\nFor these supreme karmic conditions,\nWe invoke the boundless Heavenly Worthy of Salvation for All,\nWhose inconceivable merit knows no bounds.\n\n**Hymn for Escorting the Sages**\nThe five-cloud chariot turns back,\nSoaring through the nine heavens in song.\nIn an instant, it ascends far into the sky,\nWhile the ritual altar brims with fragrant qi.\nMysterious grace pervades the cosmos,\nBlessings and fortune fill the mountains and rivers.\nGazing afar at the path of immortals,\nFreely they roam atop the Great Loftiness.\n\n**Hymn of Robing and Adornment**\nCloud-sandals.",
      "overlap_context": "cend to heavenly realms,\nAll disciples soar to the Upper Clarity.\nFortune pervades without exception,\nThis food is bestowed upon all beings.\n\n**Raising the Cup, Seated in Praise**\nThe boundless meritorious causes of this ritual meal,\nReverently dedicated to praying for the emperor’s infinite longevity,\nAnd the everlasting stability of the imperial reign,\nFor the supreme karmic conditions, we invoke as before.\n\n**The Patron’s Ritual Meal**\nInvoking the Three Treasures as above.\n\n**Offering Text**",
      "start_char": 14050,
      "end_char": 14349,
      "start_sentence": 932,
      "end_sentence": 952,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.997649669647217,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\玉音法事.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "飞凫步云舄。 登蹑九玄坛。 举意游三界，乘风五汉间。 愿今一履迹。 腾踏谒金颜。 星冠 焕烂七星冠，飘飖降自天。 受之有科简，宿命应神仙。 愿今一顶戴。 永保大椿年。 道裙 六幅华裙异，天人副羽衣。 飞裙凌宝殿，缓带步金墀。 愿今一击佩，缥缈赴瑶池。 云袖 蒨璨素云袖，上下统裙裳。 织自扶桑茧，犹闻月殿香。 愿今一被体，游宴玉琼房。 羽服 上界神仙服。 天宾自然裳。 轻盈六铢妙，佩服应三光。 愿今一披奉，逍遥不死乡。 拜坛 三级依瑶砌，八卦列方隅。 隔秽敷裙帔，除尘护法裾。 愿今一升蹑，朝修上帝居。 朝简 西台无疵玉，磨琢侍三皇。 正体除邪虑，持心启上苍。 愿今一秉执，瑶阶礼虚皇。 玉音法事卷下竟",
      "translated_text": "**Cloud-Sandals (continued)**\nSwift as the flying teal, they tread upon cloud-shoes.\nAscending, they step upon the Ninefold Mystery Altar.\nWith intent, they wander the Three Realms,\nRiding the winds between the Five Han.\nMay this single footprint now\nSoar and tread to meet the Golden Countenance.\n\n**Star Crown**\nResplendent, the Seven-Star Crown gleams,\nDrifting down from Heaven.\nBestowed by sacred decree,\nDestined for immortals by past lives.\nMay this single donning now\nForever preserve the great camphorwood years.\n\n**Daoist Skirt**\nSix panels of wondrous skirts,\nAdorning the celestial beings’ feathered robes.\nFlying skirts grace the jeweled hall,\nGentle sashes step upon golden courts.\nMay this single girding now\nEthereally ascend to the Jasper Pool.\n\n**Cloud Sleeves**\nRadiant, the pure cloud sleeves,\nEncompassing the upper and lower robes.\nWoven from Fusang silkworms,\nStill bearing the fragrance of the Moon Palace.\nMay this single donning now\nAdorn the body for feasts in jade chambers.\n\n**Feathered Robes**\nThe raiment of divine immortals above,\nThe celestial guests’ natural garments.\nLight as the six-zhu wonder,\nAdorned to match the Three Luminaries.\nMay this single donning now\nFreely roam the land of undying.\n\n**Bowing at the Altar**\nThree tiers rise upon jasper steps,\nEight trigrams arrayed at each corner.\nSkirt and mantle dispel defilement,\nHems guard the Dharma from dust.\nMay this single ascent now\nAttend the morning rites at the Lord-on-High’s abode.\n\n**Morning Tablet**\nFlawless jade from the Western Terrace,\nPolished to serve the Three August Ones.\nIts upright form dispels wayward thoughts,\nHolding the heart to invoke the Supreme.\nMay this single grasp now\nAscend the jasper stairs to worship the Void Sovereign.\n\n**The Rites of Jade Sound conclude the lower scroll.**",
      "overlap_context": "venly Worthy of Salvation for All,\nWhose inconceivable merit knows no bounds.\n\n**Hymn for Escorting the Sages**\nThe five-cloud chariot turns back,\nSoaring through the nine heavens in song.\nIn an instant, it ascends far into the sky,\nWhile the ritual altar brims with fragrant qi.\nMysterious grace pervades the cosmos,\nBlessings and fortune fill the mountains and rivers.\nGazing afar at the path of immortals,\nFreely they roam atop the Great Loftiness.\n\n**Hymn of Robing and Adornment**\nCloud-sandals.",
      "start_char": 14349,
      "end_char": 14662,
      "start_sentence": 953,
      "end_sentence": 984,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.85586404800415,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\赞颂类\\玉音法事.txt",
        "category": "赞颂类"
      }
    }
  ]
}