{
  "source_id": "真仙秘传火候法",
  "source_file": "chunked_daozang\\真仙秘传火候法.json",
  "total_chunks": 3,
  "total_original_chars": 3236,
  "total_translated_chars": 19852,
  "total_translation_time": 100.10654926300049,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\众术类\\真仙秘传火候法.txt",
    "category": "众术类"
  },
  "full_translation": "**The Esoteric Fire Timing Method Transmitted by True Immortals**\n*Scripture Title:* *The Esoteric Fire Timing Method Transmitted by True Immortals*\nOne fascicle, unattributed; suspected to originate from the Southern Song. Source text: *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Zhongjie* Category.\n\n---\n\nThe method of fire timing is neither the insubstantial *qi* of mental visualization nor the true *qi* of breath held above the waist. Its transmission comprises three aspects:\nThe heart governs the sovereign fire, called the *Upper Darkness*.\nThe kidneys govern the ministerial fire, called the *Middle Darkness*.\nThe bladder governs the popular fire, called the *Lower Darkness*.\nWhen the three *qi* converge, they form fire; when dispersed, they become *qi*. Thus, it is called the *True Fire of the Three Darknesses*.\nIts ascent and descent circulate like the Dao of Heaven: fifteen taels and three hundred sixty *zhu* constitute the measure of the *Cinnabar Heaven*, for the celestial *qi* advances every five days in its cyclical timing.\n\nIn human cultivation, the fire advances and retreats with every fivefold progression.\nMaster Lü said: \"First transmit the fire to internally nourish the Yellow Dame.\"\nMaster Haichan said: \"When refining the elixir, do not let the Fire Dragon take flight. Begin at the hours of *xu* and *hai*, and cease at the hour of *zi*.\"\n\nSecluded in a quiet chamber, sit in stillness, repeatedly dispelling thoughts. Gently rest the hands upon the table, lightly pressing the face and abdomen. Let the breath flow softly through the nose, employing it without strain. Silently visualize the *dantian* as an unceasingly turning wheel of fire. The flanks remain unmoving, as if fatigued; when briefly resting, gather again at the flanks. Through the alternation of gathering and dispersing, direct the fire to subdue the lower heart.\n\nWhen the fire-*qi* enters the *Yellow Court Palace*, first a faint ache in the abdomen is felt, followed by a gradual warmth. If one ceases at this method alone, it naturally replenishes deficiency and augments *qi*, ensuring stability, peace, and longevity.\n\nWhen combined with the copulation of Dragon and Tiger and practiced for a hundred days, apply five taels of fire from *xu* to *zi*, refining the essence into *quicksilver*, leaving residual potency in the medicine.\nAfter two hundred days, apply ten taels of fire from *you* to *zi*, refining cinnabar into *golden cinnabar*, and the *Sacred Embryo* becomes complete.\nAfter three hundred days, apply fifteen taels of fire from *shen* to *zi*, refining cinnabar into gold, and the pure yang *qi* is born.\nCounting three hundred days and thirty taels of fire, this is called *three thousand days of fulfilled merit*.\n\nWith one jin and eight liang of golden cinnabar, regulate the breath and count the cycles.\nTwo feet make one *zhu*; twenty-four *zhu* make one tael.\nEmploy the *Elbow-Behind Flying Gold Essence*—this refers to the fire phase of the *Elbow-Behind Gold Essence*.\n\n---\n\n**Jade Capital Mountain**\nIt is said: When refining the Golden Elixir and kindling the fire, begin on the *jiazi* day of the eleventh month, as the *First Yang* contends with the *Five Yins*—this is the hexagram *Earth Thunder Fu* (*Return*).\nWhy? *Kun* (Earth) is the mother of *Zhen* (Thunder). When one line of *Kun* transforms, it becomes *Zhen*, wherein wood generates yang. *Kun* is the palace of yin; the five earths can nurture the one yang. The one yang is mercury, akin to lead containing silver.\nThus, the *Cantong Qi* establishes its foundation by transforming from *Kun* into yang. Therefore, the *Fu* hexagram—*Kun* above and *Zhen* below—illuminates the initial nurturing of the *Yellow Sprout* in its nascent state, the gradual process of transformation.\n\nAfter the initial day, from the *zi* hour to the fifth day (sixty hours) constitutes one *hou* (phase). Three *hou* make one *qi* cycle for firing. When firing, one must inhale through the nose, hold the breath, sit upright, and direct the heart-fire upward. The fire ascends to the crown and descends to the *dantian*, circulating eight hundred ten *zhang* day and night.\nThus, a *chi* is divided into *cun*. If one knows the *cun*, then guards the *fen* and *liang*, harmonizing the hundred *ke*. Hence, observing the Dao of Heaven lies within the palm.\n\nFor all people, each breath moves the pulse six *cun*; four breaths make two *chi* and four *cun* (one *dao*); twenty-four *chi* make one *gui*; two hundred forty *chi* make one *zhu*; two thousand four hundred *chi* make one tael.\nMoreover, one *jin* is sixteen taels, totaling three hundred eighty-four *zhu*—how does this differ from the tight reckoning of yin and yang, corresponding to the three hundred sixty days and twenty-four *qi* of a year?\nThus, the half in the *Yi* aligns with the counting of stalks, while in humans, it aligns with the counting of breaths.\n\nWhen refining the medicine, change the crucible at each stage, gradually increasing the fire to nine stages—no further addition is needed. Gradually, with the fire, add the *qi* of the *Yellow Sprout* and *White Snow*, rotating them into the crucible to refine the Golden Elixir.\nWhen the elixir is refined for nine months, the crucible is changed—this is called the *Nine-Turn Golden Elixir*.\n\n**Martial Fire for Sixty-Four Hours, Middle Fire Timing**\nThough lead and mercury may congeal, they cannot yet be subdued. One must rely on the power of fire to refine and guard the original essence, establishing the foundation of life.\nIn the *Xishan Huizhen Ji*, the method of firing between the hours of *zi* and *wu* causes the kidney-*qi* to ascend and the heart-fluid to descend. On the day of ingesting the elixir, the fire should be applied during the hours of *zi*, *wu*, *yin*, and *shen*.\nAt *zi*, apply the martial fire with one hundred sixty-one cycles of withdrawal and addition.\nAt *yin*, apply the civil fire with one hundred eight breaths.\nAt *wu* and *ji*, apply the fire for sixty-four cycles.\nAt *jia* and *bing*, apply the fire for seventy-two cycles.\nFor the intermediate hours of *mao* and *you*, use the *yin* and *shen* methods.\nMen are born in *bingyin*; women in *renshen*. When ingesting the elixir, perform the *ji* fire. Visualize the spirit while sitting upright, embracing the external kidneys, and eliminating all thoughts. Embrace the origin and guard the One.\nThen, regulate the breath to seventy-two counts. From this point, one must not indulge in joy, anger, or impatience, lest the elixir flee—this is no small matter.\n\n**Practice of Water**\n\nHold the crucible within the embrace, yet the spirit does not commune with it—close the breath for seventy-two counts. When passions surge and thoughts scatter, grasp firmly and never falter. Carefully gather martial might, arrayed yet not engaged in battle. At the time of refinement and union, one must practice the *zi* and *wu* methods.\n\nThe Nine Crucibles and Five-Word Formula: *Store, Contract, Inhale, Close, Exhale*—also called the Five Seals Method.\n\n**The Revealed Fire Mechanism of the Accommodating Perfected One**\n\nWhen I first entered the Dao, I heard the immortal formula: *\"The secret of immortality is easy to conceal but hard to reveal; the sages transmit the medicine but not the fire.\"* The medicine may be known, but the fire cannot be heard.\n\nThereafter, seeking teachers and visiting friends, I came to recognize the South *Li* and North *Kan*, the East Wood and West Metal, the ascent and descent of Dragon and Tiger, the *hun* and *po* of Sun and Moon. As for the crucible, the medicine, the unimpeded Three Passes, and the principle of *\"following death and reversing life,\"* only the fire timing remained unclear, and the elixir could not form. Having perused thousands of classics and myriad treatises, I probed their depths, yet wisdom could not fathom them—nothing but self-realization would suffice.\n\nMoreover, when true immortals speak of fire timing at its subtlest, they all say it must be transmitted orally by a perfected one. No student of the Dao has not, for this reason, faltered and abandoned the path midway—their number is as countless as ox hairs.\n\nReflecting on my good fortune to have encountered this supreme opportunity, I realized that without the fire timing formula, I too would have joined their ranks. Thus, day and night, I forgot meals and sleep, exhaustively studying all the immortal classics and secret texts I had acquired. Though I felt I had gained some insight, doubt still lingered.\n\nAfter several years of diligent effort, I suddenly met a perfected one who transmitted this wondrous formula. Upon hearing my teacher’s words, I understood: *\"After receiving my master’s instructions, I studied the immortal classics and found not a single discrepancy. Only then did I grasp the meaning of the saying: 'Seeking the text will never hit the mark; the meaning emerges from within the text. Without a true teacher, the classics become empty words.' Was this not spoken in earnest?\"*\n\nHaving received my teacher’s instructions, I immediately set to practice. When the *yang* nine cycles completed the celestial revolution, the Great Elixir was achieved—how marvelous!\n\nThe immortal classics’ saying—*\"The secret is easy to conceal but hard to reveal; the medicine is transmitted, but not the fire\"*—exists precisely because if the ignorant or base were to easily learn it, they might trifle with the celestial mechanism and grow careless. It also prevents those devoted to the Dao from fixating on the elixir classics, for without encountering a perfected one, the fire timing remains obscure. Thus, the sages had no choice but to employ the imagery of the *Yi*, likening it to the waxing and waning of the Sun and Moon, the ascent and descent of *yin* and *yang*, using these as the framework for withdrawal and addition.\n\nThe essentials of elixir refinement lie in true Lead and true Mercury as the foundation, with fire timing as the root. At the outset of Daoist practice, essence, *qi*, and spirit are the foundation, while fire timing is secondary.\n\nThe classics say: *\"Heaven attains the One and becomes clear; Earth attains the One and becomes tranquil; Man attains the One and becomes numinous.\"* Of man’s numinosity, nothing is more numinous than the spirit; of his treasures, nothing is more precious than *qi*; of his affections, nothing is more cherished than essence.\n\nMan’s eyes and ears reside below the Kunlun, serving as the gates of the spirit; the mouth and nose are the portals of *qi*; the *weilu* is the path of essence. Speaking of the spirit, it possesses *yin* and *yang*; discussing *qi*, it has purity and turbidity; examining essence, it flows both reversely and sequentially. The wondrous workings of the celestial mechanism are all concealed herein. Thus, the sage must first enter stillness, empty the spirit, refine the *qi*, reverse the essence, and congeal them within the Yellow Chamber. Unlock the Golden Lock, penetrate the Jade Gate, turn the celestial pivot—then silver waves surge to the heavens, and golden essence flies to the crown.\n\nThereafter, one must move the celestial tally, emulate the Sun and Moon’s cycles, align with the shifting of the five phases’ mutual generation and conquest, and never err in withdrawal and addition—then the hexagrams become mere tools.\n\nRegarding fire: the body has the *zhou tian* fire, the boundless fire, the *fanshen samadhi* fire, and the *kalpa*-destroying fire that vanquishes the *yin* spirit-turtle. In the alchemical process of forging the tally and moving the fire, there are civil and martial fires, *yin* and *yang* fires. The tallies include celestial, terrestrial, solar, lunar, *yang*, and *yin* tallies. The civil and martial tally-fires are the fires of reversing the Three Passes, advancing and retreating, withdrawing and adding to congeal the elixir.\n\nThe *kalpa*-destroying fire that vanquishes the *yin* spirit-turtle is the fire of *yin-yang* intercourse, penetrating the Three Passes. If it flows downward through the *weilu*, it gives birth to a human. The classics say: *\"Following the flow creates man; reversing it achieves ascension.\"*\n\nNurture the *yin* turtle with civil fire; tightly guard the Mysterious Pass with martial fire. Harmonize with the celestial tally’s movement of Sun and Moon. When male and female spirits unite, the *kalpa* fire erupts. Whoever comprehends this formula has more than enough mastery of fire timing.\n\nIn detail, the essentials of tally and fire: day and night, two hexagrams are practiced, mutually employing *Qian* and *Kun*’s upper and lower exchanges—this is the language of tally usage. Fire is born of *Zhen* and *Xun*, the parents of the returned elixir. Advancing is the *po* giving birth to the *hun*, with fire and wood in action; retreating is the *hun* giving birth to the *po*, with metal and water in command.\n\nAhead lies the white Sun’s *yang* tally; behind, the black Moon’s *yin* image. Shelter the body, connect the *qi*, employ the Three Origins’ reverse and forward withdrawal and addition. The four seasons reside in the day and night’s two hexagrams; the twelve lines correspond to the *zhou tian*’s numbers, compressing the three hundred sixty days of creation. How could the ignorant and benighted dare to idly speculate?\n\nThe true immortals say: *\"The year is an image, the month is an image, the day and hour are real.\"* The formula states: *\"Use the hexagrams without using them; one must act within the hexagrams. If fixated on using them, their use becomes incorrect.\"*\n\nExamining this formula, do the true immortals truly conceal anything? Having thus illuminated the celestial mechanism, I wished to transmit it to later students and respectfully presented this celestial secret to my teacher. My teacher nodded in approval, saying, *\"You have indeed attained this accommodation.\"* Thus, it was titled *The Revealed Fire Mechanism of the Accommodating Perfected One*.\n\n**Eulogy:**\nSix hundred chapters on fire,\nHidden depths, principles hard to discern.\nFrom former sages to later sages,\nWho would dare speak plainly of the truth?\n\nThe Perfected One’s great expedient method\nHas expounded the true message in full.\nThis alone is the supreme mechanism—\nWhy trouble oneself with further seeking?\n\nThe Fire Timing Formula states: A year has twelve months. Excluding the two months of the third and eighth, and the two months of the fourth and tenth (when fire is not applied), there remain ten months. Each day, two hexagrams are practiced, so one month practices sixty hexagrams. Over ten months, six hundred cycles are completed, and the fire is applied six hundred times. The fire congeals and nurtures the returning elixir, then one circulates the fire within one’s own breath.\n\nThere is also the fire of the nine transformations of elixir refinement, which requires the union of true yin and true yang for the firing process. For the congealing, nurturing, and returning of the elixir, and the cessation of fire, each day between the hour of *zi* (after midnight) and before the hour of *wu* (noon), one practices the hexagrams *Fu* (Return) and *Gou* (Encounter), circulating the fire within one’s own breath. After obtaining the seed, though the elixir has not yet formed, one may proceed with the cessation of fire to allow the elixir to congeal. If the seed has not been obtained, efforts are in vain.\n\nFor the movement of talismans and the application of fire: after *zi* and before *wu*, from the first quarter of *zi* to the fourth quarter of *zi*, and from the first quarter of *wu* to the fourth quarter of *wu*. One sits upright, concentrating the spirit, each hand forming the *zi* mudra. Thoughts are stilled, the primordial is embraced, and the One is guarded. The breath is held, the external kidneys are gathered, and the perineum is contracted. The breath is counted to seventy-two, then the back is arched and the neck extended, awaiting the qi to rise naturally from the *weilu* (coccyx) to the *jiaji* (between the shoulder blades), and to the point below the *Caoxi* (the third vertebra from the bottom). The head is turned to the left, and the shoulders are gently shaken. Next, the right hand’s middle finger, without releasing the mudra, presses the right nostril. One inhales a breath of qi, then immediately uses the middle fingers of both hands to seal the ears, again without releasing the mudra, and tightly closes the \"marketplace\" (mouth). If the qi surges past the *Caoxi* and rises to the brain, turning to the forehead, then descends from between the eyebrows, a slight sweat appears at the midpoint, and the breath responds. When the mouth tastes sweet, the tongue tip presses the upper palate, awaiting the fullness of saliva, which is then slowly swallowed. One visualizes it descending from the lungs into the elixir field. After a brief pause to steady the qi, the method is repeated. If the breath cannot be held, one inhales through the nose, and all is naturally settled.\n\nAfter *zi*, one practices for half an hour—when yin is at its extreme and yang begins to arise. Before *wu*, one practices for half an hour—when yang is at its extreme and yin begins to arise. The immortal classics say: *\"Once* Fu *and* Gou *are mastered in application, who can say the golden elixir will not succeed?\"* After *zi* is the hexagram *Fu* (Return), and after *wu* is the hexagram *Gou* (Encounter). This is also the method of returning essence to replenish the brain, striking through the three barriers, and constantly causing the qi to surge. When the joints are naturally unobstructed, essence is full, and the valley spirit is preserved.\n\nFor the fire of the nine transformations of elixir refinement, true yin and true yang generate the spirit’s creative transformation. Aligned with the great yin, the fire circulates once a month. Every five days, metal is born within water—first sinking and turbid, then after three days, floating and clear. One may proceed at the hours of *xu* and *hai*, with the crucible held in the embrace. The spirit does not engage in intercourse. One sits in perfect stillness, embracing the primordial and guarding the One. The back is arched, the neck extended, the ten fingers hooked, forming the two *zi* mudras. The external kidneys are gathered, the breath is held in a pattern of nine shallow and one deep, the perineum is contracted, and the count proceeds to seventy-two. After a brief pause, the method is repeated, without fixed repetitions—sometimes three, five, or seven cycles, each cycle counting seventy-two. One also directs the qi to surge from the *jiaji* upward through the three barriers to the crown, then downward. When the great yin’s passion is aroused and the tongue turns cold, one ceases. After a month, within three days, one practices at the hours of *xu* and *hai*. All depends on precise control—no missteps are allowed. One cautiously accumulates power: every three cycles constitute the lesser yang civil fire, while seven cycles constitute the martial fire for refinement.\n\nThe hexagrams *Qian* (Heaven) and *Kun* (Earth) converge between *xu* and *hai*. The sun and moon unite in conjunction, yin and yang intertwine in encounter. Thus, all things perceive qi at *hai*, making it the proper time for practice. Refining the elixir for nine months, practicing nine times, constitutes the nine transformations. Hence it is said: *\"When the golden elixir is refined through nine transformations, it becomes as large as a gold pellet, its color like a red tangerine, enduring as long as heaven and earth.\"* Once the elixir is matured, fire need not be applied further. Thus it is said: *\"The fire timing of a full year has been completed.\"*\n\nHere ends the Perfected One’s secret transmission of the fire timing method.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "真仙秘传火候法 经名：真仙秘传火候法。 一卷，不着撰人，疑出於南宋。 底本出处：《正统道藏》洞真部众街类。 真仙秘传火候法 夫火候之法，非意中存想之虚炁，亦非呼吸腰上之真炁。 其传之有三：心为之君火，而曰上昧。 肾为之臣火，而曰中昧。 膀胱为之民火，而日下昧。 三炁聚而为火，散而为炁，故曰三昧真火也。 升降循环，如天之道，一十五两三百六十铢，而有丹天之度，天炁五日一加系候也。 人之修炼五数一进退火。 吕公曰：一输火内养黄婆。 海蟾曰：烧丹无使火龙飞，戌亥时下手子时止。 幽室静坐，频去思虑，微微托几，轻轻脸腹，鼻息绵绵，用之不勤。 默想丹田如火轮转不倦，胁下不动如困，暂歇再胁者聚，聚散之黑想火输以制下心。 火炁入黄庭宫，始觉腹微痛，次觉渐热，若止行此法，自可补虚益炁，稳而安乐延年。 以前龙虎交媾并行百日，下火五两，自戌至子，炼成津汞，而药力余。 二百日下火十两，自酉至子，炼砂成金砂，而圣胎圆。 三百日下火十五两，自申至子，炼砂成金，纯阳炁生。 计日三百，计火三十两，故号日功满三千是也。 以金砂一斤八，凝息计数。 二足方号铢，二十四为之一两。 用肘后飞金晶像肘后金晶火象也。 玉京山 论曰：凡炼金丹起火，十一月甲子日起，一阳生战五阴，谓之地雷复卦。 何者？ 坤为震母，坤一爻变，成震，是木木为阳。 坤为阴宫，五土能养一阳，一阳水银也，象铅之有银。 故《参同契》之因立基兆者，从坤而变成阳。 故起复卦者，上坤下震，此明黄芽初养蒙之义，变化之渐也。 起为日后一月子时至五日六十时为一候，三候一炁运火，若运火时，须鼻引闭炁，端坐运心火上行，须发顶火下至丹田，昼夜行八百一十丈。 故尺分为寸，若人知寸后守分两合百刻，故观天之道在乎掌。 凡人呼吸，脉行六寸一息，四至二尺四寸为一刀，二丈四尺为圭，二百四十尺为铢，二千四百尺为两。 且一斤十六两，都总三百八十四铢，何异阴阳紧数，以应一年三百六十日二十四炁矣。 又半故在易合策数，在人合息数。 如修药逐节换鼎，便火加至九节，即不加也。 渐渐随火添黄芽白雪之炁，旋入鼎中炼为金丹。 其丹炼至九个月换鼎，谓之九转金丹也。 行武火六十四时中火候 铅汞虽得凝结，未能便伏，须凭火力炼元自守，立作命基也。 《西山会真记》中子后午前行火法，令肾炁上升，心液下降，服丹之日便当火在子午寅申之时，子武火一百六十一参抽添，寅文火一百八息，戊己火六十四，甲丙火七十二，平偷卯酉用在寅申，男生於丙寅，女生於壬申，饵丹罗行己火，存神端坐，正抱外肾澄绝思虑，抱元守一。 然后定息七十二数，自此不得喜怒急躁，恐或奔逸不为小事。 行水",
      "translated_text": "**The Esoteric Fire Timing Method Transmitted by True Immortals**\n*Scripture Title:* *The Esoteric Fire Timing Method Transmitted by True Immortals*\nOne fascicle, unattributed; suspected to originate from the Southern Song. Source text: *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Zhongjie* Category.\n\n---\n\nThe method of fire timing is neither the insubstantial *qi* of mental visualization nor the true *qi* of breath held above the waist. Its transmission comprises three aspects:\nThe heart governs the sovereign fire, called the *Upper Darkness*.\nThe kidneys govern the ministerial fire, called the *Middle Darkness*.\nThe bladder governs the popular fire, called the *Lower Darkness*.\nWhen the three *qi* converge, they form fire; when dispersed, they become *qi*. Thus, it is called the *True Fire of the Three Darknesses*.\nIts ascent and descent circulate like the Dao of Heaven: fifteen taels and three hundred sixty *zhu* constitute the measure of the *Cinnabar Heaven*, for the celestial *qi* advances every five days in its cyclical timing.\n\nIn human cultivation, the fire advances and retreats with every fivefold progression.\nMaster Lü said: \"First transmit the fire to internally nourish the Yellow Dame.\"\nMaster Haichan said: \"When refining the elixir, do not let the Fire Dragon take flight. Begin at the hours of *xu* and *hai*, and cease at the hour of *zi*.\"\n\nSecluded in a quiet chamber, sit in stillness, repeatedly dispelling thoughts. Gently rest the hands upon the table, lightly pressing the face and abdomen. Let the breath flow softly through the nose, employing it without strain. Silently visualize the *dantian* as an unceasingly turning wheel of fire. The flanks remain unmoving, as if fatigued; when briefly resting, gather again at the flanks. Through the alternation of gathering and dispersing, direct the fire to subdue the lower heart.\n\nWhen the fire-*qi* enters the *Yellow Court Palace*, first a faint ache in the abdomen is felt, followed by a gradual warmth. If one ceases at this method alone, it naturally replenishes deficiency and augments *qi*, ensuring stability, peace, and longevity.\n\nWhen combined with the copulation of Dragon and Tiger and practiced for a hundred days, apply five taels of fire from *xu* to *zi*, refining the essence into *quicksilver*, leaving residual potency in the medicine.\nAfter two hundred days, apply ten taels of fire from *you* to *zi*, refining cinnabar into *golden cinnabar*, and the *Sacred Embryo* becomes complete.\nAfter three hundred days, apply fifteen taels of fire from *shen* to *zi*, refining cinnabar into gold, and the pure yang *qi* is born.\nCounting three hundred days and thirty taels of fire, this is called *three thousand days of fulfilled merit*.\n\nWith one jin and eight liang of golden cinnabar, regulate the breath and count the cycles.\nTwo feet make one *zhu*; twenty-four *zhu* make one tael.\nEmploy the *Elbow-Behind Flying Gold Essence*—this refers to the fire phase of the *Elbow-Behind Gold Essence*.\n\n---\n\n**Jade Capital Mountain**\nIt is said: When refining the Golden Elixir and kindling the fire, begin on the *jiazi* day of the eleventh month, as the *First Yang* contends with the *Five Yins*—this is the hexagram *Earth Thunder Fu* (*Return*).\nWhy? *Kun* (Earth) is the mother of *Zhen* (Thunder). When one line of *Kun* transforms, it becomes *Zhen*, wherein wood generates yang. *Kun* is the palace of yin; the five earths can nurture the one yang. The one yang is mercury, akin to lead containing silver.\nThus, the *Cantong Qi* establishes its foundation by transforming from *Kun* into yang. Therefore, the *Fu* hexagram—*Kun* above and *Zhen* below—illuminates the initial nurturing of the *Yellow Sprout* in its nascent state, the gradual process of transformation.\n\nAfter the initial day, from the *zi* hour to the fifth day (sixty hours) constitutes one *hou* (phase). Three *hou* make one *qi* cycle for firing. When firing, one must inhale through the nose, hold the breath, sit upright, and direct the heart-fire upward. The fire ascends to the crown and descends to the *dantian*, circulating eight hundred ten *zhang* day and night.\nThus, a *chi* is divided into *cun*. If one knows the *cun*, then guards the *fen* and *liang*, harmonizing the hundred *ke*. Hence, observing the Dao of Heaven lies within the palm.\n\nFor all people, each breath moves the pulse six *cun*; four breaths make two *chi* and four *cun* (one *dao*); twenty-four *chi* make one *gui*; two hundred forty *chi* make one *zhu*; two thousand four hundred *chi* make one tael.\nMoreover, one *jin* is sixteen taels, totaling three hundred eighty-four *zhu*—how does this differ from the tight reckoning of yin and yang, corresponding to the three hundred sixty days and twenty-four *qi* of a year?\nThus, the half in the *Yi* aligns with the counting of stalks, while in humans, it aligns with the counting of breaths.\n\nWhen refining the medicine, change the crucible at each stage, gradually increasing the fire to nine stages—no further addition is needed. Gradually, with the fire, add the *qi* of the *Yellow Sprout* and *White Snow*, rotating them into the crucible to refine the Golden Elixir.\nWhen the elixir is refined for nine months, the crucible is changed—this is called the *Nine-Turn Golden Elixir*.\n\n**Martial Fire for Sixty-Four Hours, Middle Fire Timing**\nThough lead and mercury may congeal, they cannot yet be subdued. One must rely on the power of fire to refine and guard the original essence, establishing the foundation of life.\nIn the *Xishan Huizhen Ji*, the method of firing between the hours of *zi* and *wu* causes the kidney-*qi* to ascend and the heart-fluid to descend. On the day of ingesting the elixir, the fire should be applied during the hours of *zi*, *wu*, *yin*, and *shen*.\nAt *zi*, apply the martial fire with one hundred sixty-one cycles of withdrawal and addition.\nAt *yin*, apply the civil fire with one hundred eight breaths.\nAt *wu* and *ji*, apply the fire for sixty-four cycles.\nAt *jia* and *bing*, apply the fire for seventy-two cycles.\nFor the intermediate hours of *mao* and *you*, use the *yin* and *shen* methods.\nMen are born in *bingyin*; women in *renshen*. When ingesting the elixir, perform the *ji* fire. Visualize the spirit while sitting upright, embracing the external kidneys, and eliminating all thoughts. Embrace the origin and guard the One.\nThen, regulate the breath to seventy-two counts. From this point, one must not indulge in joy, anger, or impatience, lest the elixir flee—this is no small matter.\n\n**Practice of Water**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1057,
      "start_sentence": 0,
      "end_sentence": 43,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.46347951889038,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\真仙秘传火候法.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "用鼎在怀，神不与交，闭息七十二数。 情狂兴落，切在把捉，无令失措。 谨蓄兵威，阵而不战，炼合之时，须行子午。 九鼎五字诀，存缩吸闭呵，又名五固法。 方便真人露火机 吾於入道之初，便闻仙诀云：神仙秘易不秘难，圣人传药不传火之语。 药可知而火不可得而闻也。 自后求师访友，识得南离北坎，东木西金、龙虎升降、日月魂魄，至於鼎器药物、三关无碍、顺死逆生之理，唯火候未明，丹莫能结。 阅尽千经万论，究其渊源则智莫能测，无非自悟。 况真仙火候说到妙处，皆云须遇至人口传心授，学道之人无不因此以至息堕，中道而废者，可谓若牛毛之多也。 自念幸逢无上之机，若不遇火候之诀，亦堕於牛毛之数矣。 於是朝夕忘餐弃寝，尽将平日所得仙经秘典，苦志研穷，虽自觉有所悟，犹疑未然。 如是荏苒数载，忽遇至人传斯妙诀。 及闻师言曰：吾得师旨之后，於仙经参究，丝毫无差，方悟仙经所谓：寻文终不的，义向文中出，若不遇真师，典籍成虚述。 岂空言哉？ 予既得师旨，即便下功，阳九之数方周天，大丹已就，妙哉。 仙经所谓：秘易不秘难，传药不传火者，正恐凡愚下士容易得知，窃弄天机，必生轻慢。 又恐志道之士留神丹经，至人未遇火候难明，故不得已而托之易象，喻之爻辞以类日月之盈亏、阴阳之升降，仿此以为抽添之纪纲也。 切原炼丹之要，当以真铅真汞，为基，火候为本。 学道之初当以精炁神为本，火候为末。 经所谓天得一以清，地得一以宁，人得一以灵。 夫人之灵莫灵於神，宝莫宝於炁，爱莫爱於精。 人之眼目居於昆仑之下，为神之门，口鼻为炁之户，尾闾为精之路。 言其神则有阴有阳，论其炁则有清有浊，究其精则有逆有顺。 天机妙用悉隐於斯，是以圣人必先静定，虚其神，炼其炁，逆其精，凝结於黄房之内。 开金锁，彻玉关，斡运璇玑，则银浪滔天，金精飞顶。 於是则运天符拟日月度数，准更漏迁移五行生克，不失抽添，则卦象乃筌蹄耳。 论其火，则身有周天火，漫天漫地火，焚身三昧火，劫坏敌阴灵龟火。 其於造化丹运符行火，则有文武火，阴阳火。 其符则有天符、地符、日符、月符、阳符、阴符。 其文武之符火，是逆度三关进退抽添结丹之火。 其劫坏敌阴灵龟火者，乃阴阳交娠之火，通彻三关，若顺流尾闻，则生人矣。 经云：顺则成人，逆则飞升。 提畜阴龟文火生，紧守玄关武火烹，契合日月天符行，男女神交劫火崩。 人能悟此诀者，火候得之已有余矣。 细论符火之要，昼夜行两卦，互用乾坤上下交移，用符之言也。 火乃震巽所生，是还丹之父母也。 进乃魄中生魂，火木用事，，退则魂中生魄，金水当权。 前有白日阳符，后有黑月阴象，栖其身，接其气，三元用逆顺抽添，四季在昼夜两卦，十二爻以应周天之数，蹙三百六十日造化。 岂愚暗之徒妄意揣度哉？ 真仙所谓年是象，月是象，日时是真。 诀曰：用卦不用卦，须向卦中为，执着用卦时，用卦却成非。 详斯旨诀，真仙岂隐秘哉？ 以是明尽天机，予欲传示后学，书此天机敬呈我师。 师曰：首肯云，汝能如是方便。 即书云方便真人露火机。 颂曰：火记六百篇，隐奥理难识。 前圣与后圣，谁肯言端的。",
      "translated_text": "Hold the crucible within the embrace, yet the spirit does not commune with it—close the breath for seventy-two counts. When passions surge and thoughts scatter, grasp firmly and never falter. Carefully gather martial might, arrayed yet not engaged in battle. At the time of refinement and union, one must practice the *zi* and *wu* methods.\n\nThe Nine Crucibles and Five-Word Formula: *Store, Contract, Inhale, Close, Exhale*—also called the Five Seals Method.\n\n**The Revealed Fire Mechanism of the Accommodating Perfected One**\n\nWhen I first entered the Dao, I heard the immortal formula: *\"The secret of immortality is easy to conceal but hard to reveal; the sages transmit the medicine but not the fire.\"* The medicine may be known, but the fire cannot be heard.\n\nThereafter, seeking teachers and visiting friends, I came to recognize the South *Li* and North *Kan*, the East Wood and West Metal, the ascent and descent of Dragon and Tiger, the *hun* and *po* of Sun and Moon. As for the crucible, the medicine, the unimpeded Three Passes, and the principle of *\"following death and reversing life,\"* only the fire timing remained unclear, and the elixir could not form. Having perused thousands of classics and myriad treatises, I probed their depths, yet wisdom could not fathom them—nothing but self-realization would suffice.\n\nMoreover, when true immortals speak of fire timing at its subtlest, they all say it must be transmitted orally by a perfected one. No student of the Dao has not, for this reason, faltered and abandoned the path midway—their number is as countless as ox hairs.\n\nReflecting on my good fortune to have encountered this supreme opportunity, I realized that without the fire timing formula, I too would have joined their ranks. Thus, day and night, I forgot meals and sleep, exhaustively studying all the immortal classics and secret texts I had acquired. Though I felt I had gained some insight, doubt still lingered.\n\nAfter several years of diligent effort, I suddenly met a perfected one who transmitted this wondrous formula. Upon hearing my teacher’s words, I understood: *\"After receiving my master’s instructions, I studied the immortal classics and found not a single discrepancy. Only then did I grasp the meaning of the saying: 'Seeking the text will never hit the mark; the meaning emerges from within the text. Without a true teacher, the classics become empty words.' Was this not spoken in earnest?\"*\n\nHaving received my teacher’s instructions, I immediately set to practice. When the *yang* nine cycles completed the celestial revolution, the Great Elixir was achieved—how marvelous!\n\nThe immortal classics’ saying—*\"The secret is easy to conceal but hard to reveal; the medicine is transmitted, but not the fire\"*—exists precisely because if the ignorant or base were to easily learn it, they might trifle with the celestial mechanism and grow careless. It also prevents those devoted to the Dao from fixating on the elixir classics, for without encountering a perfected one, the fire timing remains obscure. Thus, the sages had no choice but to employ the imagery of the *Yi*, likening it to the waxing and waning of the Sun and Moon, the ascent and descent of *yin* and *yang*, using these as the framework for withdrawal and addition.\n\nThe essentials of elixir refinement lie in true Lead and true Mercury as the foundation, with fire timing as the root. At the outset of Daoist practice, essence, *qi*, and spirit are the foundation, while fire timing is secondary.\n\nThe classics say: *\"Heaven attains the One and becomes clear; Earth attains the One and becomes tranquil; Man attains the One and becomes numinous.\"* Of man’s numinosity, nothing is more numinous than the spirit; of his treasures, nothing is more precious than *qi*; of his affections, nothing is more cherished than essence.\n\nMan’s eyes and ears reside below the Kunlun, serving as the gates of the spirit; the mouth and nose are the portals of *qi*; the *weilu* is the path of essence. Speaking of the spirit, it possesses *yin* and *yang*; discussing *qi*, it has purity and turbidity; examining essence, it flows both reversely and sequentially. The wondrous workings of the celestial mechanism are all concealed herein. Thus, the sage must first enter stillness, empty the spirit, refine the *qi*, reverse the essence, and congeal them within the Yellow Chamber. Unlock the Golden Lock, penetrate the Jade Gate, turn the celestial pivot—then silver waves surge to the heavens, and golden essence flies to the crown.\n\nThereafter, one must move the celestial tally, emulate the Sun and Moon’s cycles, align with the shifting of the five phases’ mutual generation and conquest, and never err in withdrawal and addition—then the hexagrams become mere tools.\n\nRegarding fire: the body has the *zhou tian* fire, the boundless fire, the *fanshen samadhi* fire, and the *kalpa*-destroying fire that vanquishes the *yin* spirit-turtle. In the alchemical process of forging the tally and moving the fire, there are civil and martial fires, *yin* and *yang* fires. The tallies include celestial, terrestrial, solar, lunar, *yang*, and *yin* tallies. The civil and martial tally-fires are the fires of reversing the Three Passes, advancing and retreating, withdrawing and adding to congeal the elixir.\n\nThe *kalpa*-destroying fire that vanquishes the *yin* spirit-turtle is the fire of *yin-yang* intercourse, penetrating the Three Passes. If it flows downward through the *weilu*, it gives birth to a human. The classics say: *\"Following the flow creates man; reversing it achieves ascension.\"*\n\nNurture the *yin* turtle with civil fire; tightly guard the Mysterious Pass with martial fire. Harmonize with the celestial tally’s movement of Sun and Moon. When male and female spirits unite, the *kalpa* fire erupts. Whoever comprehends this formula has more than enough mastery of fire timing.\n\nIn detail, the essentials of tally and fire: day and night, two hexagrams are practiced, mutually employing *Qian* and *Kun*’s upper and lower exchanges—this is the language of tally usage. Fire is born of *Zhen* and *Xun*, the parents of the returned elixir. Advancing is the *po* giving birth to the *hun*, with fire and wood in action; retreating is the *hun* giving birth to the *po*, with metal and water in command.\n\nAhead lies the white Sun’s *yang* tally; behind, the black Moon’s *yin* image. Shelter the body, connect the *qi*, employ the Three Origins’ reverse and forward withdrawal and addition. The four seasons reside in the day and night’s two hexagrams; the twelve lines correspond to the *zhou tian*’s numbers, compressing the three hundred sixty days of creation. How could the ignorant and benighted dare to idly speculate?\n\nThe true immortals say: *\"The year is an image, the month is an image, the day and hour are real.\"* The formula states: *\"Use the hexagrams without using them; one must act within the hexagrams. If fixated on using them, their use becomes incorrect.\"*\n\nExamining this formula, do the true immortals truly conceal anything? Having thus illuminated the celestial mechanism, I wished to transmit it to later students and respectfully presented this celestial secret to my teacher. My teacher nodded in approval, saying, *\"You have indeed attained this accommodation.\"* Thus, it was titled *The Revealed Fire Mechanism of the Accommodating Perfected One*.\n\n**Eulogy:**\nSix hundred chapters on fire,\nHidden depths, principles hard to discern.\nFrom former sages to later sages,\nWho would dare speak plainly of the truth?",
      "overlap_context": " intermediate hours of *mao* and *you*, use the *yin* and *shen* methods.\nMen are born in *bingyin*; women in *renshen*. When ingesting the elixir, perform the *ji* fire. Visualize the spirit while sitting upright, embracing the external kidneys, and eliminating all thoughts. Embrace the origin and guard the One.\nThen, regulate the breath to seventy-two counts. From this point, one must not indulge in joy, anger, or impatience, lest the elixir flee—this is no small matter.\n\n**Practice of Water**",
      "start_char": 1057,
      "end_char": 2270,
      "start_sentence": 44,
      "end_sentence": 91,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.58706068992615,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\真仙秘传火候法.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "真人大方便，说尽真消息。 祗此无上机，何劳更寻觅。 火候诀者，一年有十二个月，内除卯酉二月八月两个月不行火外，十个月，每日行两卦，一月行六十卦也。 十个月六百次，行火六百徧，火结养还丹，行自己息火。 又有炼丹九转之火，须真阴真阳交合烹炼也。 结养还丹息火，每日於子时后午时前，乃复姤二卦，行自身中之息火。 得种子之后未能成丹。 方可行息火，令丹结就。 若未得种子，虚劳功力。 夫运符行火，於子后午前子正一刻止正四刻，午初一刻止初四刻。 存神端坐，两手各掐子文，澄绝思虑，抱元守一，闭息畜两外肾缩谷道，定息七十二数，然后弯背凌颈，候气自尾闾上到夹脊，至曹溪之下，乃三椎骨下是也。 用头左转播动两肩，次以右手中指不放诀。 捺定右鼻孔，吸炁一口，又随用两手中指塞入两耳内，亦不放诀。 乃紧闭闹市。 假令气冲过曹溪、上至脑转额前，自眉间下，两眉中间有微汗出息应。 至口甘甜，即用舌尖拄定上腭，候津液满口，徐徐咽下。 想自肺而下，入至丹田讫。 少时气定，又依法而行之，如忍气不住，却用鼻吸气，自然安也。 子后行功半个时辰，阴极阳生之时； 午前行功半个时辰，乃阳极阴生之时。 仙经云：复姤自兹能运用，金丹谁道不成功。 子后乃复卦￥ 后乃姤卦。 又是运系还精补脑，一撞三关，常使炁冲，关节透自然精满谷神存。 自己一身行之。 炼丹九转之火，须真阴真阳生神造化，与太阴同经一月一周火。 凡五日，水中生金，先沉而浊，三日之后即浮而清。 可於戌亥时用事，鼎在怀中，神不与交。 正定抱元守一，弯背凑颈，十指如钩，掐两子文，畜外两肾，闭息九浅一深，时缩谷道，进七十二数毕，少定，又行之，不拘次数。 或行三数，或五数，或七数，每数七十二，亦运令炁自夹脊冲上三关，至顶而下，候太阴情狂兴发舌冷即止。 一月候至，则於三日之内戌亥时行功。 一切在把捉，无令失措，谨蓄兵威，每行三数，乃小阳文火也。 若行七数，乃武火烹也。 乾坤之卦，会於戌亥之间，日月合朔，阴阳交姤，故万物察气於亥，宜行功。 炼丹九个月，行功九次，乃九转也。 故云：炼得金丹成九转，大如金弹，色同朱橘，与天地同长久。 到此丹熟，不须行火也。 故云：一年火候都经过是也。 真仙秘传火候法竟",
      "translated_text": "The Perfected One’s great expedient method\nHas expounded the true message in full.\nThis alone is the supreme mechanism—\nWhy trouble oneself with further seeking?\n\nThe Fire Timing Formula states: A year has twelve months. Excluding the two months of the third and eighth, and the two months of the fourth and tenth (when fire is not applied), there remain ten months. Each day, two hexagrams are practiced, so one month practices sixty hexagrams. Over ten months, six hundred cycles are completed, and the fire is applied six hundred times. The fire congeals and nurtures the returning elixir, then one circulates the fire within one’s own breath.\n\nThere is also the fire of the nine transformations of elixir refinement, which requires the union of true yin and true yang for the firing process. For the congealing, nurturing, and returning of the elixir, and the cessation of fire, each day between the hour of *zi* (after midnight) and before the hour of *wu* (noon), one practices the hexagrams *Fu* (Return) and *Gou* (Encounter), circulating the fire within one’s own breath. After obtaining the seed, though the elixir has not yet formed, one may proceed with the cessation of fire to allow the elixir to congeal. If the seed has not been obtained, efforts are in vain.\n\nFor the movement of talismans and the application of fire: after *zi* and before *wu*, from the first quarter of *zi* to the fourth quarter of *zi*, and from the first quarter of *wu* to the fourth quarter of *wu*. One sits upright, concentrating the spirit, each hand forming the *zi* mudra. Thoughts are stilled, the primordial is embraced, and the One is guarded. The breath is held, the external kidneys are gathered, and the perineum is contracted. The breath is counted to seventy-two, then the back is arched and the neck extended, awaiting the qi to rise naturally from the *weilu* (coccyx) to the *jiaji* (between the shoulder blades), and to the point below the *Caoxi* (the third vertebra from the bottom). The head is turned to the left, and the shoulders are gently shaken. Next, the right hand’s middle finger, without releasing the mudra, presses the right nostril. One inhales a breath of qi, then immediately uses the middle fingers of both hands to seal the ears, again without releasing the mudra, and tightly closes the \"marketplace\" (mouth). If the qi surges past the *Caoxi* and rises to the brain, turning to the forehead, then descends from between the eyebrows, a slight sweat appears at the midpoint, and the breath responds. When the mouth tastes sweet, the tongue tip presses the upper palate, awaiting the fullness of saliva, which is then slowly swallowed. One visualizes it descending from the lungs into the elixir field. After a brief pause to steady the qi, the method is repeated. If the breath cannot be held, one inhales through the nose, and all is naturally settled.\n\nAfter *zi*, one practices for half an hour—when yin is at its extreme and yang begins to arise. Before *wu*, one practices for half an hour—when yang is at its extreme and yin begins to arise. The immortal classics say: *\"Once* Fu *and* Gou *are mastered in application, who can say the golden elixir will not succeed?\"* After *zi* is the hexagram *Fu* (Return), and after *wu* is the hexagram *Gou* (Encounter). This is also the method of returning essence to replenish the brain, striking through the three barriers, and constantly causing the qi to surge. When the joints are naturally unobstructed, essence is full, and the valley spirit is preserved.\n\nFor the fire of the nine transformations of elixir refinement, true yin and true yang generate the spirit’s creative transformation. Aligned with the great yin, the fire circulates once a month. Every five days, metal is born within water—first sinking and turbid, then after three days, floating and clear. One may proceed at the hours of *xu* and *hai*, with the crucible held in the embrace. The spirit does not engage in intercourse. One sits in perfect stillness, embracing the primordial and guarding the One. The back is arched, the neck extended, the ten fingers hooked, forming the two *zi* mudras. The external kidneys are gathered, the breath is held in a pattern of nine shallow and one deep, the perineum is contracted, and the count proceeds to seventy-two. After a brief pause, the method is repeated, without fixed repetitions—sometimes three, five, or seven cycles, each cycle counting seventy-two. One also directs the qi to surge from the *jiaji* upward through the three barriers to the crown, then downward. When the great yin’s passion is aroused and the tongue turns cold, one ceases. After a month, within three days, one practices at the hours of *xu* and *hai*. All depends on precise control—no missteps are allowed. One cautiously accumulates power: every three cycles constitute the lesser yang civil fire, while seven cycles constitute the martial fire for refinement.\n\nThe hexagrams *Qian* (Heaven) and *Kun* (Earth) converge between *xu* and *hai*. The sun and moon unite in conjunction, yin and yang intertwine in encounter. Thus, all things perceive qi at *hai*, making it the proper time for practice. Refining the elixir for nine months, practicing nine times, constitutes the nine transformations. Hence it is said: *\"When the golden elixir is refined through nine transformations, it becomes as large as a gold pellet, its color like a red tangerine, enduring as long as heaven and earth.\"* Once the elixir is matured, fire need not be applied further. Thus it is said: *\"The fire timing of a full year has been completed.\"*\n\nHere ends the Perfected One’s secret transmission of the fire timing method.",
      "overlap_context": "nything? Having thus illuminated the celestial mechanism, I wished to transmit it to later students and respectfully presented this celestial secret to my teacher. My teacher nodded in approval, saying, *\"You have indeed attained this accommodation.\"* Thus, it was titled *The Revealed Fire Mechanism of the Accommodating Perfected One*.\n\n**Eulogy:**\nSix hundred chapters on fire,\nHidden depths, principles hard to discern.\nFrom former sages to later sages,\nWho would dare speak plainly of the truth?",
      "start_char": 2270,
      "end_char": 3150,
      "start_sentence": 92,
      "end_sentence": 129,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.05600905418396,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\真仙秘传火候法.txt",
        "category": "众术类"
      }
    }
  ]
}