{
  "source_id": "真人高象先生金丹歌",
  "source_file": "chunked_daozang\\真人高象先生金丹歌.json",
  "total_chunks": 3,
  "total_original_chars": 2649,
  "total_translated_chars": 15912,
  "total_translation_time": 94.13709664344788,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\真人高象先生金丹歌.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "**The Song of the Golden Elixir by Perfected One Gao Xiangxian**\n\n*Scripture Title:* *The Song of the Golden Elixir by Perfected One Gao Xiangxian*\nOne chapter, composed by Gao Xiangxian, originating from the Northern Song period.\nSource text: *Daoist Canon of the Zhengtong Era*, *Tai Xuan* Section.\n\n---\n\nGao Xian, styled Xiangxian, was a native of Quyang. I had never met him before, but in the sixth year of Xiangfu, through the divine monk Yu Chang of Siming, I first encountered him in the capital. I admired his talent and learning, yet he scorned fame and glory in his prime, delighting in wine with carefree abandon. Observing the radiance in his eyes, I sighed, \"Truly, he is an enlightened man!\" Thus, we formed a bond, though I could not fathom his deeper mysteries.\n\nBy the autumn of the seventh year, I read his *Song in Drunken Response to the Lofty and Proud Beyond the Palaces*, nearly two thousand words in length. Though it spoke of ascending to the Celestial Court and inquiring of the Western Flower, it was all veiled in allegory. Its rejection of the false and correction toward the true—this was the Dao of the One Reality.\n\nI, unworthy as I am, have reached sixty-four years of age and pursued the Dao for forty, learning from a hundred masters and a thousand friends, through ten thousand words and myriad techniques. Yet all was taught in obscurity, guided by confusion. Never before had I encountered such clarity and lucidity as in Xiangxian’s song. Fearing that readers might dismiss it as mad or strange, failing to grasp the supreme truth of the Dao, I have provided annotations to enlighten future generations.\n\n---\n\n**The Song:**\n\nFrom the Eastern Sea, Gao Xian stirs wonders,\nA single mind, vast beyond compare.\nShattering the crucible of Heaven and Earth,\nLeaping beyond the sea of yin and yang, life and death.\n\nMighty! He grasps the mechanism of Heaven and Earth,\nYet the Azure Above forbids his own marvel.\nIdle talk of kings and hegemons—how trifling!\nHis edge concealed, who could know his might?\n\nI recall my youth at fourteen or fifteen,\nEager to serve a wise lord through classical learning.\nMy bold heart refused mediocrity,\nSo I wielded my brush in the art of poetry.\n\nYet my verses, though polished, I came to despise,\nCarving seals and crafting trivialities—what worth?\nSoon I took up the grand brush of imperial decrees,\nDrafting edicts for the Son of Heaven’s reign.\n\nThe year before last, I rolled up my sleeves and came to the capital,\nLike Manqian, I sent forth my writings to recommend myself.\nDrunk, I gazed into the mirror at my traveler’s face,\nStartled to see my temples streaked with Pan An’s frost.\n\nI cast aside the mirror, struck my chest, and sighed,\nHow fleeting is glory—why yearn for it?\nI abandoned the imperial examinations,\nAnd sought instead the divine summons of the Jade Capital.\n\nWhat is the path of divine transcendence?\nTen thousand scrolls, yet no master to reveal the profound.\nNo different from sailing a ship in the Tailao Sea,\nEast and west, north and south—boundless and indistinct.\n\nOn the fifteenth of the eighth month, the sky clear and bright,\nI shut my door to contemplate the Dao, my heart in profound stillness.\nSuddenly, the four great elements dissolved into emptiness,\nAnd unawares, my spirit ascended to the Great Clarity.\n\nGazing around the Great Clarity—how vast and boundless!\nPalaces of crystal, carved from ice,\nTowering twin gates piercing the clouds,\nJade tablets and golden inscriptions marking the Broad Cold.\n\nWithin the Broad Cold Palace lies the Level Way,\nWhere the inverted landscape has not yet risen, and dawn has not broken.\nCrimson phoenixes and purple simurghs perch in emerald groves,\nWhite deer and yellow apes slumber on jade-like grass.\n\nI knocked upon the gate, and before the sound faded,\nAn attendant opened it to inquire of my purpose.\nI announced, \"Gao Xian, styled Xiangxian,\nSeeking truth, my soul has flown here unawares.\"\n\nThe immortal official received the decree and bade me enter.\nAfter a moment, two youths emerged to greet me.\nThe Jade Emperor had summoned me,\nAnd clad in rosy clouds, I hastened on my jade-like path.\n\nThe two youths led me along golden steps,\nBanners of rainbow hues and feathered guards arrayed in splendor.\nTwin fans parted to reveal a visage of purity,\nAs I bowed and awaited the celestial will.\n\nThe Jade Emperor spoke to me, a mortal:\n\"Alas! You have pursued the true with such devotion.\nI shall consult the immortal register for your name.\"\nThe immortal official replied, \"He is already recorded.\"\n\n\"Who in the world knows of the River Chariot?\nYou must journey west to seek the Western Flower.\nThe Lady of the Western Flower holds the pivot,\nShe will point you to the true cinnabar.\"\n\nHe then commanded the two youths to guide me,\nAs we soared through misty clouds and flying rosy hues.\nA million miles—yet how near!\nIn an instant, I reached the golden edge of Heaven.\n\nThe vermilion sun half-risen in the east of Fusang,\nLight clouds veiling its radiant banner.\nA hundred flowers stretched like a rainbow,\nPillars and railings—all were dragons of rainbow hue.\n\nJewelled trees, how lush and verdant!\nThe celestial wind brushed them, their chimes ringing clear.\nAmidst the forest of pearls and jade stood a palace,\nThe two youths pointed: \"The Palace of the Western Flower.\"\n\nWithin the palace, the procession shone with brilliance.\nA maiden of seventeen or eighteen,\nHer tresses like twilight clouds cascading,\nHer fair countenance as delicate as spring snow.\n\nThe two youths announced the Jade Emperor’s decree,\nDelivering Xiangxian, the recluse Gao.\n\"His name is already inscribed in the immortal register,\nThe Lady shall instruct him in the principles of longevity.\"\n\nThe Lady received the decree, and the youths departed.\nShe bowed and seated me, speaking leisurely of immortality:\n\"Ten thousand scrolls of immortal scriptures circulate in the world,\nYet without encountering a true person, how can one awaken?\"\n\nThe Lady prepared a feast for me,\nCoral and tortoiseshell gleaming in the cold.\nFeathered carriages soared through the clouds,\nAs she summoned the two youths and invited the colored simurghs.\n\nThe immortals gathered, auspicious clouds converging,\nHeavenly music resounded in all directions.\nGolden nectar dripped like dew,\nAs phoenixes danced in the clouds with graceful steps.\n\nHer fair countenance flushed with rosy hue,\nToasts exchanged in joy unbounded.\n\nThe Lady turned to me and sang a short song:\n\"None among sages and worthies surpass Qiu and Ke.\nYet where are Qiu and Ke now?\nOnly their tombs remain, towering and desolate.\n\nHeroes of past and present follow the same rut,\nDrowning in the waves of fame and profit.\nContent to vanish like a spark or a lamp’s flicker,\nNone grasp the heart to pursue the Great Veil.\n\nIn this red dust, how rare are those like you,\nWho cast off fleeting glory like discarded sandals.\nHaving reverently heeded the Jade Emperor’s words,\nI shall explain to you the principles of longevity.\n\nHave you not seen the ancient sovereigns seeking the Dao in Kongtong’s chambers?\nThough they grasped the grand outlines, they did not fully comprehend.\nTurning back, they sought in Shu’s Emei,\nThe Heavenly Perfected and the True One.\n\nWhat is the Dao of the True One?\nFirst, you must knock upon the gate of Wu and Ji.\nWithin the gate of Wu and Ji lies the Golden Child,\nAnd the Golden Child is the root of the Yellow Sprout.\"\n\nThe Yellow Sprout is the mother of all things,\nWhen mother attains the child, it becomes the crucible and cauldron.\nWhen the sun’s essence and moon’s radiance intertwine in resonance,\nOne floats, one sinks—pearls take flight of their own accord.\nThe luminous pearl soars to Kunlun’s summit,\nIf you seek it, rely on the formless image.\nOnce attained, return to the Crimson Palace,\nWhere the Crimson Palace steams, suffusing the skin with crimson.\nSkin crimson, temples black,\nThe Northern Dipper henceforth strikes your name from death’s ledger.\nGreat indeed! Ninety days to achieve success,\nOn Qiao Mountain’s peaks, traces remain.\nHave you not heard?\nShu Tong served under Wei Boyang,\nTogether they laughed and entered the Realm of Nothingness.\nFollowing Mount Kun’s model, they composed the *Cantong Qi*,\nLeaving it as the eternal sovereign of all elixirs.\n\nIts opening declares: Qian and Kun are the gates of the *Yi*,\nQian’s way is male, Kun’s way is female.\nYet the world knows not true yin and yang,\nVainly scouring the earth for dragon and tiger.\nThe sun is Li, the moon is Kan,\nSun and moon as the *Yi* devour one another.\nThe golden crow dies, the jade hare is born,\nAll things arise from heaven and earth’s resonance.\nHeaven and earth in misty union conceive,\nThe four images and five phases rely on their convergence.\nDay and night’s cyclical movement follows nature’s law—\nWhy toil over fire-tending with such diligence?\n\nThere is a time for gathering, a day for harvesting,\nGather and harvest—yet be ever cautious, ever discreet.\nLest you rouse the black dragon from slumber,\nLosing the Heavenly Perfected and forfeiting the luminous pearl.\nShould you fix your heart upon the *Shangqing* scriptures,\nWithout the Dao, how could you ascend the *Shangqing*?\nA path lies before your eyes, yet you know not where—\nStriving in vain, you perish in darkness.\n\nReturn essence, gaze inward to form a sphere of emptiness,\nBelow the navel, they forcibly name it the Palace of the Great One.\nFirst envision the divine furnace standing within,\nThen store true fire to blaze at its core.\nAlways rise at midnight’s hour of Zi,\nGather the sun and moon’s essence to cast into the crucible.\nFalsely calling saliva \"golden essence,\"\nSwallowing it into the cinnabar field to make \"spirit water.\"\nClaiming it aligns with the wondrous tally of the recondite,\nAfter ten months of gestation, a spiritual infant is born.\nHow lamentable—exhausting spirit and wearying thought,\nOften leaving one’s complexion prematurely aged.\n\nSome boil minerals for the ninefold return,\nExtracting mercury from cinnabar, lead from elixirs,\nKneading them into a catty to place in an earthen crucible,\nFiercely firing them with common flame.\nThough their hues may briefly unify,\nAnd something resembling the Yellow Sprout appears,\nIt is but a semblance—bewildering and deadly,\nOften driving those who consume it to madness.\n\nNow abstaining from salt, now from grain,\nSome yang, solitary and unbalanced; some yin, bereft and forsaken.\nSome sit in corners, forgetting all but their inner light,\nSome flee to explore the depths of mountains and valleys.\nSome refine urine for the ninefold return,\nSome calcine mulberry ash for the great elixir.\nSome yin gathers to restore yang,\nDrawing essence and qi to surge through the mud-pill palace.\nWhy so many paths, a thousand branches and ten thousand roads,\nBurying the true teaching where none may find it?\n\nThe herb-gathering immortal claps hands and laughs as he departs,\nThe four great elements of the human realm suddenly understood.\nAwakened, silently one knows in the heart,\nVast and untrammeled, devoid of all contrivance.\nTruly! Seated upon the coiled stone,\nOne first marvels, then wonders.\nI have heard the ancients’ words:\n\"Exploring mountains is not the place to cultivate truth.\"\n\nXu Cuo spent years seeking the crescent moon furnace,\nTraversing grand capitals and bustling prefectures.\nFor two years, he moved between the capital and the provinces,\nSeeking a kindred spirit—yet found none.\nHe met the talented and the brilliant,\nNever once lapsing in discourse on true quiescence.\n\nA traveler on the thoroughfare, his mood suddenly stirred,\nEyes flashing like startled magpies.\nAmid the bustling crowd, he asked a humble question,\nFrom the flock, a lone crane stood tall.\nStealthily following, stealthily observing,\nThough his spirit and bones were extraordinary, his countenance was wan.\nThis must be a man of great talent in a lowly position.\nI bowed, invited him to sit, and courteously inquired his name and lineage.\nHe replied: \"I am a descendant of the Wangs of Jiangling,\nMy ancestors were lords of Jingnan.\nThen the true sovereign of Jianlong arose,\nAnd we quietly surrendered our seal, becoming vassals.\n\nIn my youth, my heart and gall were bold,\nIn the literary arena, I once triumphed over the imperial examiners.\nWho could have foreseen a single misstep would dash my hopes?\nI was recommended to the Alarming Palace of Wuling.\nMy path henceforth sank into the ranks of petty officials,\nA ninth-rank robe in the desolate hinterlands.\nBending at the waist, I hastened to pay homage to the governor,\nA single bow at the steps—better death than this humiliation.\nEarly on, I knew my drifting was in vain,\nYet how could I bear the false accusations that followed?\nThanks to Han Shao’s intercession, like Huo Guang of old,\nI preserved my head and returned to Nanyang.\n\nSoon after, the Celestial King bestowed his grace,\nSummoning me to serve as a minor magistrate in Luoyang.\nI sighed at my ill fate, no nobleman’s destiny,\nAnd retired to the southern seas to nurture my Heavenly Perfected nature.\nI possess several hundred *qing* of fertile fields near the city walls,\nRippling millet and sorghum bowing like clouds.\nBeyond the royal taxes, there is surplus,\nEnough to indulge my indolent, Ji Kang-like nature.\n\nLast year, I was shocked to hear of Imperial Censor Wang,\nWho presented his writings to the Son of Heaven.\nI had long since abandoned the heart of a deer in the reeds,\nUnconcerned with the imperial silk once more reaching me.\nThe external dragon and Zhuge Liang—talent in vain,\nWhat use have they in this age of peace?\nI brushed my sleeves, wishing to meet an immortal,\nTo ascend the nine heavens, using clouds as a ladder.\n\nPacing alone on the long steps, just then at ease,\nI was honored by your inquiry into my dusty traces.\nWe clasped hands and ascended the wine tower,\nWhere, drunk, we sang loudly to bare our hearts.\nA hundred rows of vast goblets from Wuyang,\nWe drank in rapid succession, never pausing,\nEnough to pour upon the Scorched Mountain,\nDrying the great rivers and emptying the seas.\n\nAmidst the revelry, you wrote a thousand words for me,\nLike the surging Longmen, pouring forth a torrent of eloquence.\nIts force could dam Kunlun and block the Bohai,\nIts sound shook the heavenly gates and rattled the earth.\nSeveral hundred words—how bold and untrammeled!\nLike a dragon breaking its golden chains.\nA single thunderclap by the Jing River’s banks,\nHailstones the size of horse heads hurled from the clouds.\n\nSeveral hundred words—how lofty and wondrous!\nA frigid zither’s notes born from jade tree branches.\nWho wields Song Yu’s sword that leans against the sky,\nSevering twin rainbows in the autumn void?\n\nSeveral hundred words—how bleak and bitter!\nLike gibbons howling at the moon at high noon.\nThe withered willows of Baling, shrinking from autumn’s wind,\nThe fading blossoms of Golden Vale, grieving in the evening rain.\n\nSeveral hundred words—how all-embracing!\nThe myriad phenomena, named but once, fall silent.\nGreat is true awakening! The awakened heart,\nAll sages and worthies—brushed aside like lightning.\n\nMighty the unhewn brush in your song!\nI treasure it, yet dare not present it to our circle.\"\n\nJust as scholars clamor for the block and mallet,\nFearing the price of paper will soar by morning’s light—\n\nMarvel at the banished immortal’s brush in your hand,\nMarvel at the banished immortal’s bones within your frame.\nHow could our sovereign’s lavish titles ever touch you?\nDragons are not creatures meant for mere ponds.\n\nI hold the celestial formula of the Crimson Dragon,\nYet when asked, I have never spoken a word.\nMarvel at your divine talent, borne of heaven’s own,\nUnstinting in revealing heaven’s secrets for your sake.\n\nLet no mediocre soul mock your wild abandon—\nFor you, a single leap into the moon of Great Purity.\nThe Perfected One’s lofty image concludes *The Song of Primordial Golden Elixir*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "真人高象先金丹歌 经名：真人高象先金丹歌。 一篇，高象先撰，出於北宋时期。 底本出处：《正统道藏》太玄部。 真人高象先金丹歌 高先，字象先，朐阳人也。 余素昧平生，祥符六年，因四明传神僧禹昌，始得识公面於京师。 佳其负才学而轻名壮，陶陶然以酒自娱； 又视其眼光溢脸，叹日：真明了人也，始与定交，然莫测有他卫。 洎七年秋，观公《承醉答诸宫高负外歌》一首，几二千言，虽朝上帝问道西华，率皆寓言。 其排邪斥伪、娇正归真，真一之道也。 余不佞春秋六十四矣，学道四十年问，百师千友，万言亿术，皆蒙蒙相授，迷迷相指，其皎然明白若象先是歌者，未之前闻。 余惧览者目为狂怪之词，不悟至真之道，遂为注解，以示将来。 歌曰 东海高先真作怪，一个了心无比大，塞破乾坤造化炉，跳出阴阳生死海。 雄哉权握天地机，上苍不许自身奇，闲谈王霸浑多事，锋错不露将谁知。 忆昔余年十四五，明经早欲干明主，壮心不伏低时才，遂弄栈毫业词赋。 赋成龌龊翻自鄙，篆刻雕虫安足贵，旋操洪笔落宏词，将应大中天子制。 前年攘臂来京辈，曼倩飞书方自荐，酒酣览镜照客容，遽骇潘安鬓华变。 舍鉴抚膺吁自语，倏忽浮荣宁足慕，金阙遂抛方正科，玉京上应神仙举。 神仙举业竟何以，万卷无师问深旨，何殊乘舰泛尾间，南北东西渺无际。 八月十五天清明，闭关思道心冥冥，兀然四大生虚白，不觉一灵升太清。 太清四顾何漫漫，水晶宫殿冰相钻，巍巍双阙横云端，玉牌金篆题广寒。 广寒宫中有平道，倒景未升天未晓，绛凤紫鸾柄碧林，白鹿黄猿睡瑶草。 以指叩关声未已，有吏开关问行止，遽报高先字象先，思真不觉飞魂至。 仙官得旨听然入，有顷双童出相揖，玉宸有命召先生，霞披飘飘玉趾急。 双童引去黄金砌，绛节霓旌森羽卫，雉扇双开见粹容，再拜鞠躬俟天意。 玉宸谓我凡问子，矣矣修真肯如此，急征仙籍问仙名，仙官答云有名字。 举世何人识河车，子当西去求西华，西华夫人掌枢纽，使当指与真丹砂。 仍命双童为前导，缥缥渺渺凌飞霞，百万里兮何咫尺，倏然已抵金天涯。 朱曦半出扶桑东，轻云夹之光幢蒙，百花摘引如长虹，抓楹攫槛皆虹龙。 琳琅琪树何青葱，天风四触声玲珑，珠玑宝殿森其中，双童指曰西华官。 宫中彩仗何昭晰，有女方年十七八，鬓发缤纷垂暮云，素容轻淡凝春雪。 双童前宣玉宸旨，送到象先高处士，已题仙籍有仙名，夫人为指长生理。 夫人受命双童去，揖坐从容与仙语，万卷仙经传世问，不遇真人安得悟。 夫人为我张华筵，珊瑚玳瑁寒相鲜，纷羽驾兮飞云耕，召双童兮邀彩鸾。 群仙集兮祥云聚，天乐铿鍧声四举，滴沥金浆带露倾，婆娑丹凤和云舞。 素容潜溢兮朱颜酡，献酬交错兮欢何多。 夫人顾我兮歌短歌，圣贤莫若邱与轲。 借问邱轲今何在，空留冢墓高嗟峨。 前豪后杰循一辙，溺名涛兮沈利波。 甘随石火风灯去，莫有柄心追大罗。 红尘此日佳吾子，摆落浮荣如脱屐。 向来虔奉玉宸言，为君析理长生事。 君不见古皇问道崆峒室，虽得宏纲未全悉， 回头蜀国访峨眉，天真皇人与真一。 真一之道何所云，莫若先敲戊己门。 戊己门中有金子，金子便是黄芽根。",
      "translated_text": "**The Song of the Golden Elixir by Perfected One Gao Xiangxian**\n\n*Scripture Title:* *The Song of the Golden Elixir by Perfected One Gao Xiangxian*\nOne chapter, composed by Gao Xiangxian, originating from the Northern Song period.\nSource text: *Daoist Canon of the Zhengtong Era*, *Tai Xuan* Section.\n\n---\n\nGao Xian, styled Xiangxian, was a native of Quyang. I had never met him before, but in the sixth year of Xiangfu, through the divine monk Yu Chang of Siming, I first encountered him in the capital. I admired his talent and learning, yet he scorned fame and glory in his prime, delighting in wine with carefree abandon. Observing the radiance in his eyes, I sighed, \"Truly, he is an enlightened man!\" Thus, we formed a bond, though I could not fathom his deeper mysteries.\n\nBy the autumn of the seventh year, I read his *Song in Drunken Response to the Lofty and Proud Beyond the Palaces*, nearly two thousand words in length. Though it spoke of ascending to the Celestial Court and inquiring of the Western Flower, it was all veiled in allegory. Its rejection of the false and correction toward the true—this was the Dao of the One Reality.\n\nI, unworthy as I am, have reached sixty-four years of age and pursued the Dao for forty, learning from a hundred masters and a thousand friends, through ten thousand words and myriad techniques. Yet all was taught in obscurity, guided by confusion. Never before had I encountered such clarity and lucidity as in Xiangxian’s song. Fearing that readers might dismiss it as mad or strange, failing to grasp the supreme truth of the Dao, I have provided annotations to enlighten future generations.\n\n---\n\n**The Song:**\n\nFrom the Eastern Sea, Gao Xian stirs wonders,\nA single mind, vast beyond compare.\nShattering the crucible of Heaven and Earth,\nLeaping beyond the sea of yin and yang, life and death.\n\nMighty! He grasps the mechanism of Heaven and Earth,\nYet the Azure Above forbids his own marvel.\nIdle talk of kings and hegemons—how trifling!\nHis edge concealed, who could know his might?\n\nI recall my youth at fourteen or fifteen,\nEager to serve a wise lord through classical learning.\nMy bold heart refused mediocrity,\nSo I wielded my brush in the art of poetry.\n\nYet my verses, though polished, I came to despise,\nCarving seals and crafting trivialities—what worth?\nSoon I took up the grand brush of imperial decrees,\nDrafting edicts for the Son of Heaven’s reign.\n\nThe year before last, I rolled up my sleeves and came to the capital,\nLike Manqian, I sent forth my writings to recommend myself.\nDrunk, I gazed into the mirror at my traveler’s face,\nStartled to see my temples streaked with Pan An’s frost.\n\nI cast aside the mirror, struck my chest, and sighed,\nHow fleeting is glory—why yearn for it?\nI abandoned the imperial examinations,\nAnd sought instead the divine summons of the Jade Capital.\n\nWhat is the path of divine transcendence?\nTen thousand scrolls, yet no master to reveal the profound.\nNo different from sailing a ship in the Tailao Sea,\nEast and west, north and south—boundless and indistinct.\n\nOn the fifteenth of the eighth month, the sky clear and bright,\nI shut my door to contemplate the Dao, my heart in profound stillness.\nSuddenly, the four great elements dissolved into emptiness,\nAnd unawares, my spirit ascended to the Great Clarity.\n\nGazing around the Great Clarity—how vast and boundless!\nPalaces of crystal, carved from ice,\nTowering twin gates piercing the clouds,\nJade tablets and golden inscriptions marking the Broad Cold.\n\nWithin the Broad Cold Palace lies the Level Way,\nWhere the inverted landscape has not yet risen, and dawn has not broken.\nCrimson phoenixes and purple simurghs perch in emerald groves,\nWhite deer and yellow apes slumber on jade-like grass.\n\nI knocked upon the gate, and before the sound faded,\nAn attendant opened it to inquire of my purpose.\nI announced, \"Gao Xian, styled Xiangxian,\nSeeking truth, my soul has flown here unawares.\"\n\nThe immortal official received the decree and bade me enter.\nAfter a moment, two youths emerged to greet me.\nThe Jade Emperor had summoned me,\nAnd clad in rosy clouds, I hastened on my jade-like path.\n\nThe two youths led me along golden steps,\nBanners of rainbow hues and feathered guards arrayed in splendor.\nTwin fans parted to reveal a visage of purity,\nAs I bowed and awaited the celestial will.\n\nThe Jade Emperor spoke to me, a mortal:\n\"Alas! You have pursued the true with such devotion.\nI shall consult the immortal register for your name.\"\nThe immortal official replied, \"He is already recorded.\"\n\n\"Who in the world knows of the River Chariot?\nYou must journey west to seek the Western Flower.\nThe Lady of the Western Flower holds the pivot,\nShe will point you to the true cinnabar.\"\n\nHe then commanded the two youths to guide me,\nAs we soared through misty clouds and flying rosy hues.\nA million miles—yet how near!\nIn an instant, I reached the golden edge of Heaven.\n\nThe vermilion sun half-risen in the east of Fusang,\nLight clouds veiling its radiant banner.\nA hundred flowers stretched like a rainbow,\nPillars and railings—all were dragons of rainbow hue.\n\nJewelled trees, how lush and verdant!\nThe celestial wind brushed them, their chimes ringing clear.\nAmidst the forest of pearls and jade stood a palace,\nThe two youths pointed: \"The Palace of the Western Flower.\"\n\nWithin the palace, the procession shone with brilliance.\nA maiden of seventeen or eighteen,\nHer tresses like twilight clouds cascading,\nHer fair countenance as delicate as spring snow.\n\nThe two youths announced the Jade Emperor’s decree,\nDelivering Xiangxian, the recluse Gao.\n\"His name is already inscribed in the immortal register,\nThe Lady shall instruct him in the principles of longevity.\"\n\nThe Lady received the decree, and the youths departed.\nShe bowed and seated me, speaking leisurely of immortality:\n\"Ten thousand scrolls of immortal scriptures circulate in the world,\nYet without encountering a true person, how can one awaken?\"\n\nThe Lady prepared a feast for me,\nCoral and tortoiseshell gleaming in the cold.\nFeathered carriages soared through the clouds,\nAs she summoned the two youths and invited the colored simurghs.\n\nThe immortals gathered, auspicious clouds converging,\nHeavenly music resounded in all directions.\nGolden nectar dripped like dew,\nAs phoenixes danced in the clouds with graceful steps.\n\nHer fair countenance flushed with rosy hue,\nToasts exchanged in joy unbounded.\n\nThe Lady turned to me and sang a short song:\n\"None among sages and worthies surpass Qiu and Ke.\nYet where are Qiu and Ke now?\nOnly their tombs remain, towering and desolate.\n\nHeroes of past and present follow the same rut,\nDrowning in the waves of fame and profit.\nContent to vanish like a spark or a lamp’s flicker,\nNone grasp the heart to pursue the Great Veil.\n\nIn this red dust, how rare are those like you,\nWho cast off fleeting glory like discarded sandals.\nHaving reverently heeded the Jade Emperor’s words,\nI shall explain to you the principles of longevity.\n\nHave you not seen the ancient sovereigns seeking the Dao in Kongtong’s chambers?\nThough they grasped the grand outlines, they did not fully comprehend.\nTurning back, they sought in Shu’s Emei,\nThe Heavenly Perfected and the True One.\n\nWhat is the Dao of the True One?\nFirst, you must knock upon the gate of Wu and Ji.\nWithin the gate of Wu and Ji lies the Golden Child,\nAnd the Golden Child is the root of the Yellow Sprout.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1305,
      "start_sentence": 0,
      "end_sentence": 47,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.006497383117676,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\真人高象先生金丹歌.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "黄芽根为万物母，母得子兮为鼎釜。 日月魂华交感时，一浮一沈珠自飞。 明珠飞到昆仑上，子若求之凭罔象。 得之归来归绛宫，绛宫蒸入肌肤红。 肌肤红，鬓发黑，北斗由兹落死籍。 大哉九十日成功，髻霏乔山有遗迹。 又不闻，叔通从事魏伯阳，相将笑入无何乡。 准连山作《参同契》，留为万古丹中王。 首日乾坤易门户，乾道男兮坤道女。 世人不识真阴阳，茫茫天下寻龙虎。 日为离，月为坎，日月为易相吞啖。 金乌死，玉鬼生，万物生因天地感。 天地氤氲男女娠，四象五行凭辐辏。 昼夜屯蒙法自然，焉用孜孜看火候。 采有时，取有日，采兮取兮须慎密。 勿使骊龙惊觉来，天真丧去明珠失。 万一留心契上清，上清非道胡能升。 眼前有路不知处，造空伏死徒冥冥。 返精内视为团空，脐下强名太一宫。 先想神炉峙乎内，次存真火炎其中。 常当半夜子时起，采日月华投鼎裹。 妄将津液号金精，漱下丹田作神水。 自云冲妙符希夷，脱胎十月生婴儿。 劳神疲思良可叹，往往容色先人衰。 有烹金石为九还，砂中抽汞丹取铅， 团作一斤安土釜，炎炎凡火相烹煎。 其中方色各归一，依稀亦有黄芽出， 似是而非迷杀人，往往饵之成疯疾。 忽断盐，忽断谷，或阳兮孤柄，或阴兮寡宿， 或向隅而坐忘遗照，或遁迹兮探山穷谷，或饵便溺为九还，或炼桑灰为大丹， 或阴采兮复阳，采沂精气兮冲泥丸。 何事千岐并万路，埋没真诠无觅处。 草仙拍手笑方归，人间四大飒然悟。 悟来嘿嘿心自知，腾腾兀兀都无机。 信哉，端坐盘陀石，始觉奇之，又怪之。 尝闻古仙有遗语，探山不是修真所。 许错长寻偃月炉，游遍雄都并会府，二年出处当京国，求个同人求不得。 遍历英才与隽才，未尝失口谈真寂。 有客通衢情忽忽，双睛激电如惊鹊， 浑浑行当草小问，鹦中一鹤孤突兀。 迤逦潜随复潜视，神骨虽奇容色悴。 此必高才下位人，揖坐从容询姓氏，答我江陵王者孙，祖先世列荆南君， 旋属建隆真主出，听然纳玺称蕃臣。 我昔少年心胆雄，文场一战魁草公， 岂思一射失前望，武陵曾荐阿房宫。 踪迹因兹沈下吏，九品公裳青宁地， 折腰趋入谒刺史，阶下一拜不如死。 早是徒劳顾飘荡，那堪枉被相诬罔， 由赖汉绍明霍光，得全首领归南阳。 旋辱天王需恩渥，一命遗催尉西洛， 自嗟薄命非贵人，退归南海怡天真。 负郭良田几百顷，禾黍离离堕云颖， 王租输外有余储，足养嵇康懒惰性。 去岁惊闻王御史，尝把文章奏天子， 向来已庾麋鹿心，不顾丝纶重及此。 外龙诸葛徒权奇，今日升平何所施， 拂衣安得修仙子，九天高约云为梯。 独步长阶方自适，喜辱先生问尘迹， 各当拥手登酒楼，酒酣高歌豁胸臆。 武阳鸿锺百余列，速饮连倾不得歇， 直宜泼向沃焦山，大江须枯海须竭。 坐中笔我一千言，龙门浩浩倾词源， 势央昆仑塞渤淤，声撼天关摇地合。 数百言兮何磊落，囚龙掣断黄金索。 霹雳一声泾水湄，云中推下马头雹。 数百言兮何高奇，虚籁寒生琼树枝。 谁将宋玉倚天剑，秋空截断双虹蚬。 数百言兮何清苦，霜猿斗月月当午。 霸陵衰柳怯秋风，金谷残花愁暮雨。 数百言兮何达观，万象强名声一断。 大哉真觉觉来心，一切圣贤拂如电。 雄哉朴凸歌中毫，宝之未敢呈吾曹。",
      "translated_text": "The Yellow Sprout is the mother of all things,\nWhen mother attains the child, it becomes the crucible and cauldron.\nWhen the sun’s essence and moon’s radiance intertwine in resonance,\nOne floats, one sinks—pearls take flight of their own accord.\nThe luminous pearl soars to Kunlun’s summit,\nIf you seek it, rely on the formless image.\nOnce attained, return to the Crimson Palace,\nWhere the Crimson Palace steams, suffusing the skin with crimson.\nSkin crimson, temples black,\nThe Northern Dipper henceforth strikes your name from death’s ledger.\nGreat indeed! Ninety days to achieve success,\nOn Qiao Mountain’s peaks, traces remain.\nHave you not heard?\nShu Tong served under Wei Boyang,\nTogether they laughed and entered the Realm of Nothingness.\nFollowing Mount Kun’s model, they composed the *Cantong Qi*,\nLeaving it as the eternal sovereign of all elixirs.\n\nIts opening declares: Qian and Kun are the gates of the *Yi*,\nQian’s way is male, Kun’s way is female.\nYet the world knows not true yin and yang,\nVainly scouring the earth for dragon and tiger.\nThe sun is Li, the moon is Kan,\nSun and moon as the *Yi* devour one another.\nThe golden crow dies, the jade hare is born,\nAll things arise from heaven and earth’s resonance.\nHeaven and earth in misty union conceive,\nThe four images and five phases rely on their convergence.\nDay and night’s cyclical movement follows nature’s law—\nWhy toil over fire-tending with such diligence?\n\nThere is a time for gathering, a day for harvesting,\nGather and harvest—yet be ever cautious, ever discreet.\nLest you rouse the black dragon from slumber,\nLosing the Heavenly Perfected and forfeiting the luminous pearl.\nShould you fix your heart upon the *Shangqing* scriptures,\nWithout the Dao, how could you ascend the *Shangqing*?\nA path lies before your eyes, yet you know not where—\nStriving in vain, you perish in darkness.\n\nReturn essence, gaze inward to form a sphere of emptiness,\nBelow the navel, they forcibly name it the Palace of the Great One.\nFirst envision the divine furnace standing within,\nThen store true fire to blaze at its core.\nAlways rise at midnight’s hour of Zi,\nGather the sun and moon’s essence to cast into the crucible.\nFalsely calling saliva \"golden essence,\"\nSwallowing it into the cinnabar field to make \"spirit water.\"\nClaiming it aligns with the wondrous tally of the recondite,\nAfter ten months of gestation, a spiritual infant is born.\nHow lamentable—exhausting spirit and wearying thought,\nOften leaving one’s complexion prematurely aged.\n\nSome boil minerals for the ninefold return,\nExtracting mercury from cinnabar, lead from elixirs,\nKneading them into a catty to place in an earthen crucible,\nFiercely firing them with common flame.\nThough their hues may briefly unify,\nAnd something resembling the Yellow Sprout appears,\nIt is but a semblance—bewildering and deadly,\nOften driving those who consume it to madness.\n\nNow abstaining from salt, now from grain,\nSome yang, solitary and unbalanced; some yin, bereft and forsaken.\nSome sit in corners, forgetting all but their inner light,\nSome flee to explore the depths of mountains and valleys.\nSome refine urine for the ninefold return,\nSome calcine mulberry ash for the great elixir.\nSome yin gathers to restore yang,\nDrawing essence and qi to surge through the mud-pill palace.\nWhy so many paths, a thousand branches and ten thousand roads,\nBurying the true teaching where none may find it?\n\nThe herb-gathering immortal claps hands and laughs as he departs,\nThe four great elements of the human realm suddenly understood.\nAwakened, silently one knows in the heart,\nVast and untrammeled, devoid of all contrivance.\nTruly! Seated upon the coiled stone,\nOne first marvels, then wonders.\nI have heard the ancients’ words:\n\"Exploring mountains is not the place to cultivate truth.\"\n\nXu Cuo spent years seeking the crescent moon furnace,\nTraversing grand capitals and bustling prefectures.\nFor two years, he moved between the capital and the provinces,\nSeeking a kindred spirit—yet found none.\nHe met the talented and the brilliant,\nNever once lapsing in discourse on true quiescence.\n\nA traveler on the thoroughfare, his mood suddenly stirred,\nEyes flashing like startled magpies.\nAmid the bustling crowd, he asked a humble question,\nFrom the flock, a lone crane stood tall.\nStealthily following, stealthily observing,\nThough his spirit and bones were extraordinary, his countenance was wan.\nThis must be a man of great talent in a lowly position.\nI bowed, invited him to sit, and courteously inquired his name and lineage.\nHe replied: \"I am a descendant of the Wangs of Jiangling,\nMy ancestors were lords of Jingnan.\nThen the true sovereign of Jianlong arose,\nAnd we quietly surrendered our seal, becoming vassals.\n\nIn my youth, my heart and gall were bold,\nIn the literary arena, I once triumphed over the imperial examiners.\nWho could have foreseen a single misstep would dash my hopes?\nI was recommended to the Alarming Palace of Wuling.\nMy path henceforth sank into the ranks of petty officials,\nA ninth-rank robe in the desolate hinterlands.\nBending at the waist, I hastened to pay homage to the governor,\nA single bow at the steps—better death than this humiliation.\nEarly on, I knew my drifting was in vain,\nYet how could I bear the false accusations that followed?\nThanks to Han Shao’s intercession, like Huo Guang of old,\nI preserved my head and returned to Nanyang.\n\nSoon after, the Celestial King bestowed his grace,\nSummoning me to serve as a minor magistrate in Luoyang.\nI sighed at my ill fate, no nobleman’s destiny,\nAnd retired to the southern seas to nurture my Heavenly Perfected nature.\nI possess several hundred *qing* of fertile fields near the city walls,\nRippling millet and sorghum bowing like clouds.\nBeyond the royal taxes, there is surplus,\nEnough to indulge my indolent, Ji Kang-like nature.\n\nLast year, I was shocked to hear of Imperial Censor Wang,\nWho presented his writings to the Son of Heaven.\nI had long since abandoned the heart of a deer in the reeds,\nUnconcerned with the imperial silk once more reaching me.\nThe external dragon and Zhuge Liang—talent in vain,\nWhat use have they in this age of peace?\nI brushed my sleeves, wishing to meet an immortal,\nTo ascend the nine heavens, using clouds as a ladder.\n\nPacing alone on the long steps, just then at ease,\nI was honored by your inquiry into my dusty traces.\nWe clasped hands and ascended the wine tower,\nWhere, drunk, we sang loudly to bare our hearts.\nA hundred rows of vast goblets from Wuyang,\nWe drank in rapid succession, never pausing,\nEnough to pour upon the Scorched Mountain,\nDrying the great rivers and emptying the seas.\n\nAmidst the revelry, you wrote a thousand words for me,\nLike the surging Longmen, pouring forth a torrent of eloquence.\nIts force could dam Kunlun and block the Bohai,\nIts sound shook the heavenly gates and rattled the earth.\nSeveral hundred words—how bold and untrammeled!\nLike a dragon breaking its golden chains.\nA single thunderclap by the Jing River’s banks,\nHailstones the size of horse heads hurled from the clouds.\n\nSeveral hundred words—how lofty and wondrous!\nA frigid zither’s notes born from jade tree branches.\nWho wields Song Yu’s sword that leans against the sky,\nSevering twin rainbows in the autumn void?\n\nSeveral hundred words—how bleak and bitter!\nLike gibbons howling at the moon at high noon.\nThe withered willows of Baling, shrinking from autumn’s wind,\nThe fading blossoms of Golden Vale, grieving in the evening rain.\n\nSeveral hundred words—how all-embracing!\nThe myriad phenomena, named but once, fall silent.\nGreat is true awakening! The awakened heart,\nAll sages and worthies—brushed aside like lightning.\n\nMighty the unhewn brush in your song!\nI treasure it, yet dare not present it to our circle.\"",
      "overlap_context": "Jade Emperor’s words,\nI shall explain to you the principles of longevity.\n\nHave you not seen the ancient sovereigns seeking the Dao in Kongtong’s chambers?\nThough they grasped the grand outlines, they did not fully comprehend.\nTurning back, they sought in Shu’s Emei,\nThe Heavenly Perfected and the True One.\n\nWhat is the Dao of the True One?\nFirst, you must knock upon the gate of Wu and Ji.\nWithin the gate of Wu and Ji lies the Golden Child,\nAnd the Golden Child is the root of the Yellow Sprout.\"",
      "start_char": 1305,
      "end_char": 2630,
      "start_sentence": 48,
      "end_sentence": 119,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.33703112602234,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\真人高象先生金丹歌.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "正当覃士急栈锤，纸价恐增朝夕高。 奇君手有谪仙笔，奇君身有谪仙骨。 吾皇丰爵安得摩，蛟龙不是池中物。 我有赤龙天上诀，有口人问未曾说。 奇君雄负天仙才，不惜天机为君泄。 庸儿莫笑作虚狂，为君一跃大罗月。 真人高象先金丹歌竟",
      "translated_text": "Just as scholars clamor for the block and mallet,\nFearing the price of paper will soar by morning’s light—\n\nMarvel at the banished immortal’s brush in your hand,\nMarvel at the banished immortal’s bones within your frame.\nHow could our sovereign’s lavish titles ever touch you?\nDragons are not creatures meant for mere ponds.\n\nI hold the celestial formula of the Crimson Dragon,\nYet when asked, I have never spoken a word.\nMarvel at your divine talent, borne of heaven’s own,\nUnstinting in revealing heaven’s secrets for your sake.\n\nLet no mediocre soul mock your wild abandon—\nFor you, a single leap into the moon of Great Purity.\nThe Perfected One’s lofty image concludes *The Song of Primordial Golden Elixir*.",
      "overlap_context": "eral hundred words—how bleak and bitter!\nLike gibbons howling at the moon at high noon.\nThe withered willows of Baling, shrinking from autumn’s wind,\nThe fading blossoms of Golden Vale, grieving in the evening rain.\n\nSeveral hundred words—how all-embracing!\nThe myriad phenomena, named but once, fall silent.\nGreat is true awakening! The awakened heart,\nAll sages and worthies—brushed aside like lightning.\n\nMighty the unhewn brush in your song!\nI treasure it, yet dare not present it to our circle.\"",
      "start_char": 2631,
      "end_char": 2748,
      "start_sentence": 120,
      "end_sentence": 126,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 4.793568134307861,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\真人高象先生金丹歌.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}