{
  "source_id": "真气还元铬",
  "source_file": "chunked_daozang\\真气还元铬.json",
  "total_chunks": 5,
  "total_original_chars": 4961,
  "total_translated_chars": 26580,
  "total_translation_time": 134.38528895378113,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\方法类\\真气还元铬.txt",
    "category": "方法类"
  },
  "full_translation": "**Inscription on Returning the True Qi to the Origin**\n*Sutra Title:* *Inscription on Returning the True Qi to the Origin*\n*Annotated by Qiangmingzi. Based on the preface, composed by a Liang-dynasty figure of the Five Dynasties period. One fascicle.*\n*Source of Base Text:* *Daoist Canon of the Zhengtong Era, Dongzhen Section, Methods Category.*\n\n**Preface to the Inscription on Returning the True Qi to the Origin**\n\nFrom youth, I revered the classics and, in maturity, longed for the misty peaks. Though I leapt through the Dragon Gate and sought to pluck the cinnamon of the moon, I donned brocade robes in the world, rode prancing steeds among men, set snares and traps, and forced open the workings of creation—bringing glory to father and son, extending blessings to descendants. I embodied benevolence and righteousness as a model for the age, wielded propriety and wisdom as a rule for posterity. Yet my dreams did not align with Fu Yue’s, nor did my fishing meet with Jiang Ziya’s; thus, I despaired and turned my heart toward the pursuit of the Dao of immortality. Poetry and books were abruptly set aside, brush and ink abruptly cast away.\n\nI saw the myriad conflicts of the world, beheld the endless gains and losses of court and market. Glory flashed like a spark from stone, nobility drifted like floating duckweed—no distinction of high or low, only fleeting gatherings and dispersals. Corpse-like steps and ghostly strides: none but the sagely could discern them. Moving flesh and living dust: none but the worthy could distinguish them.\n\nThereafter, I sought secluded grottoes and traversed famed mountains, braving peril and scaling heights for twenty years. From the *Zhenming* year of the Liang, while wandering beneath the towering pines of Mount Tai’s summit, I suddenly beheld a man—his form and countenance unlike the common, his speech extraordinary—who called himself the Teacher of Ten Thousand Generations, the sole master of the Nine Heavens’ Dao. I then bowed my head and knelt in reverence.\n\nHe said to me: “You bear the marks of an immortal; only thus have you encountered me.”\n\nHe bestowed upon you the gateway to immortal learning—are you able to receive it?\nI again prostrated myself in long obeisance, my form and words filled with gratitude.\n\nHe then said: “I ask you to shear your hair and smear your blood to swear an oath, that I may transmit to you the arts of bending and stretching, exhaling and inhaling, and refining the body.”\nHe further said: “Within two cycles of twelve years, you must not transmit these to others. Should you pass them to the unworthy, they shall incur punishment.”\nI again prostrated myself in long obeisance, and suddenly he vanished.\n\nThereafter, I consistently followed the prescribed order, never slackening in my efforts. Every subtle word proved divinely efficacious. Having received my teacher’s command, I was bound to conceal these celestial mysteries. As the two cycles neared their end, I was permitted to transmit them to the world. Thus, I meticulously revised the ancient precepts, recast them into a new scripture, inscribed them in the marketplace, and concealed them among mountain stones. May later scholars who obtain them be fortunate!\n\n*Inscription on Returning Primordial Qi to Its Source*\n*Commentary by Qiangmingzi*\n\nBefore the One divided, the One was where the Dao was established. Qi was born of the One, yet undivided—this was the primordial chaos. Though this qi derived its name from the Great Dao, it remained the undifferentiated chaos, unseparated into purity and turbidity. Thus, the nameless gave rise to the named, and the named gave rise to the myriad things.\n\nThe *Daoist Scripture* states: “The nameless is the beginning of heaven and earth; the named is the mother of the myriad things.” The nameless refers to the Dao; the named refers to qi. The Dao is the father of the One qi, and the One qi is the mother of the myriad things. All that possesses form and appearance arises from the One qi.\n\nTherefore, in cultivating life, one values the Dao; in cultivating the Dao, one esteems qi. Qi is the root of spirit, the source of nature and life, the master of divine illumination. Should one cultivate it according to the proper method, one may attain the rank of immortal.\n\nThus, the *Yellow Court Scripture* says: “Exhaling the pure and inhaling the mysterious, the two qi shine—should you encounter them, you shall ascend to the Milky Way.” It further states: “Why not consume the qi of Great Harmony? Then you shall not enter death but dwell in Yellow Tranquility.” The meaning is clear.\n\nThe Three Powers share a single source. The Three Powers are heaven, earth, and humanity. “Share a single source” means they all reside in the primordial chaos. Once purity and turbidity diverged—purity ascending to become heaven, turbidity descending to become earth—humanity came to dwell between them, and thus distinctions arose. Yet the primordial essence of each remains.\n\nHeaven models itself after me; I model myself after heaven. Though the primordial essence persists, heaven’s modeling and humanity’s form are without duality. Humanity takes heaven as its model to complete its form.\n\nSomeone asked: “Earlier, you said heaven models itself after me, and I model myself after heaven. Why does the Way of Heaven never collapse, while the Way of Humanity knows life and death?”\nI replied: “Though heaven possesses its pivot and mechanism, it is empty and without intent. Being empty and without intent, the primordial qi moves of itself. With the primordial qi moving of itself, the Five Phases encounter no obstruction. Without obstruction among the Five Phases, there is no mutual conquest. Without mutual conquest, there is only the Great Void. Being the Great Void, it merges with the Dao and thus does not collapse.”\n\nI further replied: “Humanity’s life and death do not differ from the Way of Heaven but arise from humanity’s own doing. From the moment of conception through the union of parents’ essence and qi, to the formation of the body and birth, one is beset by sorrow, weeping, joy, anger, grief, and delight. Gradually, the mouth craves the five flavors, the ears heed the five sounds, the eyes behold the five colors, and the heart indulges in the five desires. Endlessly entangled in the ten thousand mechanisms, nothing is left ungrasped.\n\nThese four matters all stem from the movements of the intentful heart. Once intent arises, emptiness and purity are lost. Having lost emptiness and purity, humanity strays from the Dao and becomes as the myriad creatures, equal in their lot. They drift with the cycles of life and death, following the withering and decay of the green and the rot. Like the spark from struck stone or the floating duckweed, they form momentarily and perish in an instant. This is humanity’s own doing, not the work of the Great Dao.\n\nShould one’s heart be without heart, one’s color without color, one’s taste without taste, one’s gaze without gaze, one’s desires without desire, one’s hearing without hearing, one’s mechanisms without mechanism—harmonizing light and merging with dust, abiding in serene constancy—then one merges with the Dao. How then could one not attain longevity like heaven?\n\nMy life rests with me. Human nature and life, life and death, are determined by oneself. Should one comprehend the natural Dao, move the qi of Primordial Harmony, externally absorb the Two Radiant Essences, internally ingest the Five Sprouts, dynamically govern the hundred spirits, and tranquilly stabilize the Five Viscera, then cold and heat, hunger and thirst cannot invade; the five weapons and blades cannot approach. Life and death lie in one’s hands, transformations follow one’s heart. Earth cannot bury, heaven cannot slay—this is what is meant by ‘my life rests with me.’\n\nIt does not lie with heaven. Human nature and life, life and death, do not depend on heaven. Those who misuse it perish prematurely; those who use it well extend their years. Qi harmonizes and the body becomes quiescent. Qi is the primordial qi; the body is the physical form. When the primordial qi is pure and harmonious, the physical form naturally becomes quiescent. Once the physical form is quiescent, the qi naturally harmonizes.\n\nGuard the One, and the spirit becomes at ease. The One is the One qi; the spirit is the spirit and form. Should one but guard the One qi, the spirit and form naturally become at ease. The spirit is the child of qi; qi is the mother of the spirit. Know only to guard the mother, and the child will not stray. Know to guard the sovereign, and the spirit will not scatter.”\n\nThese all accord with the Dao of nature—like water moistening downward, fire flaming upward, clouds following the dragon, and wind following the tiger. The numinous fungus dwells within the body: the numinous fungus is the *zhi* herb, \"within the body\" means within the human body, referring to the primordial qi. It does not reside in famous mountains. It does not depend on gathering from renowned peaks.\n\nReturn to the One and guard harmony: the One is the singular spirit, harmony is harmonious qi. Earlier it spoke of guarding the One to still the spirit; here it speaks of returning to the One to guard harmonious qi. This is the mutual abiding of spirit and qi, an unbroken continuity of thought after thought, an unceasing flow.\n\nThe principle accords with the Profound Mystery: the principle is the Dao’s principle. The Profound Mystery is the Mystery upon Mystery—when one knows to return to the One and yet guard harmonious qi, this is called the Mystery upon Mystery. When essence reaches its utmost, clarity arises: essence is essential qi, clarity is spiritual illumination. This means that when one attains the method of embracing the primordial and guarding the One, essential qi becomes full, and one thereby connects with spiritual illumination. When spirit reaches its utmost, numinosity arises: spirit is the singular spirit, numinosity is the human capacity for spiritual communion. This means that when one masters the Dao of embracing the primordial and guarding the One, the thirty-six thousand spirits never leave the person, and one naturally attains spiritual communion. When qi reaches its utmost, purity arises: clear qi is spirit, turbid qi is form. Qi is primordial qi, purity is pure emptiness. This means that when primordial qi reaches its utmost, turbid qi naturally disperses, and the person becomes purely empty.\n\nDecline follows qi: this means that when qi declines, the body declines. Flourishing follows qi: when qi is abundant, the body flourishes. Dissolution follows qi: when qi is exhausted, the body perishes. Life follows qi: all people arise from the intermingling of primordial qi to form the body.\n\nJoy and anger disorder qi: when people experience joy or anger, they disorder the correct qi. Emotions and nature contend: when joy and anger arise, emotions and nature contend with one another. Obstruction and blockage give rise to illness: earlier it spoke of emotions and nature contending, which obstructs and blocks primordial qi. Once qi is obstructed and blocked, illness arises. How can spirit and form be at peace? Spirit refers to the myriad spirits, form to the physical body—how can the physical body find tranquility?\n\nRefining yang dissolves yin: refining is like smelting, yang is yang qi, dissolving is like melting away, yin is yin qi. Earlier it spoke of spirit and form being unable to find peace; here it speaks of refining yang to dissolve yin—this is the gateway of restraint and the method of regulation. In general, those who seek immortality and study the Dao must know how to cultivate and nurture properly: one must refine yang qi to dissolve yin evil, and only then can one attain longevity.\n\nMoreover, all human illnesses arise because the five flavors give rise to the body, yet also cause the body’s demise. When first practicing qi absorption, one should first accumulate heart-fire to burn throughout the body. Once the burning is complete, follow the method to absorb qi, and there will be no illness that is not cured. Guangchengzi said: \"Accumulate fire to burn the five poisons.\" The five poisons are the five flavors. When the five poisons are exhausted, one can attain longevity.\n\nQi moves of itself, spirit becomes numinous of itself: this means that after yin qi disperses, yang qi moves naturally. Dispel the evil with the correct: the correct is correct qi, the evil is evil qi. This means using correct qi to expel evil qi. Illnesses naturally subside: \"subside\" means returning to a state of no illness. Earlier it spoke of using correct qi to expel evil qi—like hot water melting snow, like fire dissolving ice, one naturally returns to the original state.\n\nHeaven and earth become clear and still: the following explains the sequence of qi-absorption methods. Heaven is *qian*, earth is *kun*—this refers to when heaven and earth are clear, without wind, clouds, mist, rain, or snow.\n\nAfter midnight and before noon: *zi* is the midnight hour, *wu* is the noon hour. In general, for exhaling and inhaling to regulate and absorb primordial qi, one should take the time from midnight until before noon—this is called the qi of the six yang hours. From noon until midnight is called the qi of the six yin hours; one must not exhale, inhale, regulate, or absorb internal qi, as there is nothing that will not be harmed.\n\nClose the eyes and sit upright: when the Dao of heaven is clear and still, after midnight and before noon, it is time for exhaling, inhaling, regulating, and absorbing. One must face the royal direction, close the eyes, sit upright, and regulate the breath—this is the ordinary method.\n\nGrasp firmly and close the eyes in stillness: after closing the eyes and sitting upright, one must grasp firmly. \"Grasp firmly\" means to clasp the thumbs. \"Close the eyes in stillness\" means to close the eyes as if closed yet not closed.\n\nDraw breath into the central chamber: the central chamber is the nose. Then draw external breath into the nose, gently guiding it in until the sea of qi is full. After a long while, this is excellent—it is called \"absorbing the new.\"\n\nExhale through the celestial gate: exhaling is expelling breath, the celestial gate is the mouth. After guiding external qi into the sea of qi for a long while, one must then exhale—this is called \"expelling the old.\"\n\nInhalation should be subtle: subtle means that when drawing external qi through the nose, one should guide it in gently, so that the ears do not hear. Subtle is the gateway of life, excessive is the path of death—thus, guiding and absorbing should be subtle.\n\nExhalation should be unbroken: use intention to guide qi. This refers to when drawing external qi through the nose—one must use intention to guide external qi directly into the sea of qi.\n\nThe organs and viscera revolve: this means that when using intention to guide external qi into the sea of qi until it is full, the qi of the five viscera and six bowels naturally revolves, gently moving and making a gurgling sound. Then exhale: exhaling is done through the mouth. Earlier it spoke of the organs and viscera revolving; when qi reaches its utmost, one must exhale and not forcibly hold it in.\n\nNutritive and defensive qi circulate freely: this means that after practicing the principles of exhalation and inhalation, nutritive and defensive qi flow without obstruction. If there is disharmony: when a person is unwell, the five viscera and six bowels are disharmonious. Dispel it before the heels...\n\nDispelling it before the heels—this was stated above; to properly dispel the pathogenic is before the heels. The *Nanhua Sutra* says: \"The breath of the multitude reaches the throat; the breath of the perfected reaches the heels.\" The heel is like the sole. The *Scripture of Embryonic Breathing* also says: \"The breathing of ordinary people differs from that of the perfected. Ordinary people’s breath enters and exits through the throat; the perfected’s breath resides in the sea of qi, which is the root of qi.\" I note that when it speaks of \"exiting before the heels,\" the foot is the heel, and the heel is the sole of the foot. Here, \"heel\" refers to the root of qi. \"Heel\" (*gen*) is akin to \"root\" (*gen*), meaning the sea of qi is the root of human life. Thus, when there is disharmony, one must expel pathogenic qi, practicing embryonic breathing as previously described.\n\nExhale five or six times: \"Exhale\" refers to the six qi. Generally, the qi of the five viscera and six bowels all belong to the heart, and the heart belongs to exhalation. Thus, using exhalation for inhalation and exhalation is the superior method. After completing inhalation and exhalation, proceed to ingest and circulate qi according to the method. There is no illness that will not be dispelled. This means that by practicing exhalation and inhalation, no illness will remain unremoved.\n\nWhenever one wishes to practice embryonic breathing—qi congeals as the embryo, and breath is called \"breathing,\" so the embryo congeals within qi, and qi breathes within the embryo, hence the term \"embryonic breathing\"—one must begin with daoyin. After midnight and before noon, sit upright with eyes closed, hands clenched, and gaze fixed forward. The meridians will not be obstructed: this means that by first practicing daoyin, the qi of the meridians will flow without obstruction. The joints will not be troubled: this means that by moving the joints through daoyin, original qi circulates freely without obstruction, so the joints will not be afflicted.\n\nSome movements resemble shooting a hawk: the following describes daoyin methods. This refers to the posture of turning the body like one shooting a hawk. Lean to the side and curve the body: this single phrase describes the \"shooting hawk\" posture. Some raise the waist and back: this is another method, where one lies supine, presses the backs of the hands to the ground, lifts the waist, and draws in the legs until the head touches the ground. Like a half-round toad: this describes the \"raising waist\" method. Interlace the fingers behind the head: this is a separate method, where the ten fingers are interlaced behind the head, grasping the \"Jade Pillow.\" Rotate left and right: after interlacing the fingers behind the head, one must turn the head and back, rotating either left or right. Strengthen the hands and feet with qi: during daoyin, when the hands and feet are tensed, one senses the original qi. It emerges from the fingertips: after tensing the hands and feet, the original qi naturally flows from the tips of the ten fingers. Swing the four limbs: this means that during daoyin, one swings and moves the hands and feet, hence the term \"four limbs.\" Grasp and gather the three passes: during daoyin, one may hold the breath or clench the fists, extending this to the ten toes—this is called \"grasping the three passes.\" The three passes are the mouth, hands, and feet. Thoroughly rub the \"foot-length dwelling\": this means rubbing the face with both hands. The sea of qi is the same: one should also rub it with both hands. Knock the teeth to gather the spirit: in all cases of ingesting qi and practicing daoyin, one must first knock the teeth thirty-six times to gather the spirits of the five viscera. The teeth refer to the upper and lower teeth, called the \"Heavenly Drum\"; when the spirits hear the drumming, they gather. Close the eyes and secure the passes: the eyes are the \"pupils,\" and the passes are the mouth, hands, and feet. When the three passes are closed, no pathogenic influences can enter. Calm the mind and relax the body: free the mind from all thoughts and relax the body. The body is the physical form. This means to quiet the mind, free it from all thoughts, and relax the body as if it were empty space. Allow qi to come and go: close the mouth and let qi circulate within the \"spirit hut.\" Sense the qi becoming harmonious: feel the qi returning through the nose, becoming balanced. Obstruct the throat pass: when the throat qi is harmonious, during exhalation, hold the breath so that nothing enters from outside nor exits from within—this is obstructing the throat pass. When obstructed, swallow: after obstructing the throat, the original qi remains there; with nothing entering from outside nor exiting from within, one swallows it. Three swallows in succession: this describes the standard method of swallowing qi. Three swallows in succession form one breath-holding; swallow three times in a row without allowing saliva and qi to be swallowed together. Turn the tongue and rinse inward: while holding the breath, slightly exhale so that qi fills the mouth, then use the tongue to gently stir it before rinsing it inward. Swallow it down to the cinnabar field: this means to swallow the original qi directly into the cinnabar field. The lower cinnabar field is the sea of qi, three inches below the navel. Guide the qi with intention: after swallowing the qi, use intention to guide it into the cinnabar field. Let it make a gurgling sound: when swallowing the qi, it should produce a gurgling sound, like water trickling into a pit, clearly audible. One swallow to three swallows: when swallowing qi, one swallow to three swallows constitutes one breath-holding, with three consecutive swallows. Swallow again as before: after completing three swallows, let the qi circulate within the \"spirit hut,\" and when the qi is harmonious, swallow three times in succession again as before. Thirty-six swallows: after each set of three consecutive swallows, wait for the qi to harmonize, then swallow three times in succession again, up to thirty-six swallows—this is the standard practice for qi. The *Scripture of the Yellow Court* says: \"Thirty-six swallows in the Jade Pool.\" This is what it refers to.\n\nIf one has not yet ceased taking grains, one must eat sparingly, ensuring the abdomen remains empty, cool, and free of discomfort. When sitting, if the abdomen is empty, swallow the qi. From dawn to dusk, one may do this ten times, naturally reaching one hundred and sixty swallows. With prolonged practice, one may reach three hundred and sixty swallows at once, which is called \"intermediate attainment.\" One thousand two hundred swallows is called \"great attainment,\" also known as \"grand breathing.\" For minor embryonic breathing, simply hold the breath and count to one thousand or one hundred breaths—this is also called \"great attainment.\"\n\nYet if one cannot refine the form and transform the essence, even if one gains longevity, it is but a withered tree devoid of vital radiance.\n\nShould one’s nurturing and care deviate from proper method and suddenly fall ill, one must swiftly follow the qi-swallowing practice to cure it. When swallowing qi, one need not always complete thirty-six swallows. From thirty swallows upward—fifty, sixty, seventy, eighty, ninety, to one hundred—once the qi within the abdomen stirs and the qi in the four limbs flows freely, one should then cease, relax the hands, close the mouth, and allow the qi to come and go through the spirit’s chamber, letting it be faint, ever so faint. Hold the breath long, exhale little—this is the method by which true embryonic breathing is achieved. Thus is embryonic breathing perfected.\n\nEmbryonic breathing is accomplished by three consecutive swallows, completing thirty-six swallows in total. The Great Dao is non-action; the Great Dao, likened to the human body, is non-action—it is without deliberate effort. When practicing embryonic breathing, whether sitting or lying, walking or standing, let the qi follow the embryonic breath, and release the body as vast emptiness. Only then does one attain non-action, which is to be without a body. Having no body, one has no chaotic thoughts; having no chaotic thoughts, primordial qi arrives unbidden, comes unsummoned. And there is nothing it does not accomplish. This speaks to dispelling the misconception of the Great Dao’s non-action, lest practitioners cling to non-action—hence it is said, \"there is nothing it does not accomplish.\"\n\nIf one can be without action—\n*(As the preceding note states: releasing the body as that vast emptiness is the way.)*\nthis is called \"without thought.\"\n*(As the preceding note states: being as vast emptiness, empty of self, is called \"without thought.\")*\nIf one can be without thought—\n*(As the preceding note states: if one can be empty of emptiness, without mind, then naturally there is no thought.)*\nthe myriad things return of themselves.\n*(The myriad things are the myriad people. The myriad people point to the primordial return. \"Return of themselves\" means they return naturally. It is said that if one can be without thought, primordial qi naturally returns to the body.)*\nTo seek primordial qi through deliberate effort is like climbing a tree to catch a fish. The method and image are not two—\n*(This speaks of the Dao of returning primordial qi to its origin, which is the same in ancient and modern times.)*\nit requires no forced action.\n*(This speaks of naturalness; deliberate effort is not the way.)*\nNeither cold nor hot—\n*(This describes the efficacy of returning primordial qi to its origin.)*\nwith prolonged practice, one becomes neither cold nor hot.\nNeither thirsty nor hungry—\n*(This line speaks of the efficacy of primordial qi. With diligent practice, one reaches the state of neither thirst nor hunger.)*\nWondrous within the wondrous, subtle within the subtle.\n*(These two lines praise the inconceivable nature of returning primordial qi to its origin.)*\nSeen yet unseen, heard yet unheard, grasped yet unattained—it is one with the subtle and the imperceptible.\n\nSerene and desireless—\n*(Serenity is the flavor of no-flavor, ever constant. This speaks of the Dao as serene and constant, without desire.)*\none delights in the Dao.\n*(Delight is joy. This speaks of attaining the Dao of returning primordial qi to its origin—my life is in my hands, not in Heaven’s. After fulfilling the practice, one ascends to Heaven in broad daylight, dies seated or standing, receives the homage of the ten thousand spirits, remains unmoved when mountains topple, and endures unharmed when the world crumbles. Thus one delights in the Dao.)*\n\nScholars of the Dao—\n*(This refers to those who study the Dao.)*\nengrave this and wear it close.\n*(This instructs seekers of immortality to revere this text, inscribing it on stone or wearing it upon the body.)*\n\nHere ends the *Inscription on Returning Primordial Qi*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "真气还元铭 经名：真气还元铭。 题强名子注。 据书序当为五代粱人所撰。 一卷。 底本出处：《正统道藏》洞真部方法类。 真气还元铭序 余幼亲坟典，长慕烟霞，比跳龙门，欲攀蟾桂。 着锦衣於世上，骑跃马於人问，置立机关，开张造化，荣沾父子，福及子孙。 体仁义为当代之楷模，用礼智作将来之规矩。 梦未同於傅说，钓不遇於姜牙，而遂灰心志求仙道，诗书陡罢，笔砚顿抛。 见寰区之多少是非，睹朝市之无限得失，荣如石火，贵似浮枢，不假高低，瞥然聚散。 尸行鬼步，非圣哲莫可知之； 动肉活尘，非贤良莫能分别。 迩后专寻幽洞，遍访名山，历险登危，二十年矣。 自梁贞明岁，游於泰山顶高松之下，忽见一人，形容异俗，言语非常，唯称万代之师，柢道九天之主。 余遂稽首长跪。 为余曰：汝有仙相，方得遇吾。",
      "translated_text": "**Inscription on Returning the True Qi to the Origin**\n*Sutra Title:* *Inscription on Returning the True Qi to the Origin*\n*Annotated by Qiangmingzi. Based on the preface, composed by a Liang-dynasty figure of the Five Dynasties period. One fascicle.*\n*Source of Base Text:* *Daoist Canon of the Zhengtong Era, Dongzhen Section, Methods Category.*\n\n**Preface to the Inscription on Returning the True Qi to the Origin**\n\nFrom youth, I revered the classics and, in maturity, longed for the misty peaks. Though I leapt through the Dragon Gate and sought to pluck the cinnamon of the moon, I donned brocade robes in the world, rode prancing steeds among men, set snares and traps, and forced open the workings of creation—bringing glory to father and son, extending blessings to descendants. I embodied benevolence and righteousness as a model for the age, wielded propriety and wisdom as a rule for posterity. Yet my dreams did not align with Fu Yue’s, nor did my fishing meet with Jiang Ziya’s; thus, I despaired and turned my heart toward the pursuit of the Dao of immortality. Poetry and books were abruptly set aside, brush and ink abruptly cast away.\n\nI saw the myriad conflicts of the world, beheld the endless gains and losses of court and market. Glory flashed like a spark from stone, nobility drifted like floating duckweed—no distinction of high or low, only fleeting gatherings and dispersals. Corpse-like steps and ghostly strides: none but the sagely could discern them. Moving flesh and living dust: none but the worthy could distinguish them.\n\nThereafter, I sought secluded grottoes and traversed famed mountains, braving peril and scaling heights for twenty years. From the *Zhenming* year of the Liang, while wandering beneath the towering pines of Mount Tai’s summit, I suddenly beheld a man—his form and countenance unlike the common, his speech extraordinary—who called himself the Teacher of Ten Thousand Generations, the sole master of the Nine Heavens’ Dao. I then bowed my head and knelt in reverence.\n\nHe said to me: “You bear the marks of an immortal; only thus have you encountered me.”",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 328,
      "start_sentence": 0,
      "end_sentence": 17,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.56008768081665,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\真气还元铬.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "付汝学仙之门，汝能受否？ 余又长跪，感谢形言。 又曰：吾请汝剪发敌血为盟，与汝屈伸吐纳炼形之术。 又曰：两纪之内，辄莫传人，传之非人，彼受谴责。 余又长跪，忽然不见。 余自后常依次第，不报功夫，但是微言，无不神验。 余既承师命，合秘天机。 两纪将终，许传人世。 而乃重修旧则，翻作新经，写之市朝，藏诸山石。 后来学者得之幸哉！ 真气还元铭_强名子注解 一气未分， 一者，道之所立。 气者，一之所生，未分为混沌未分也。 此言一气，虽从大道以成名，而且混沌之气，未分清浊也。 此则是无名生有名，有名生万物。 《道经》云：无名，天地之始。 有名，万物之母。 无名言道也，有名言气也。 言道者，是一气之父，言一气者，万物之母，有相有形，未有不因一气而生者也。 是故修生则贵道，修道则重气，言气是精神之本，性命之源，神明之主。 人若得法修之，克为神仙矣。 故《黄庭经》云：出清入玄二气焕，子若遇之升天汉。 又云：何不食气太和精，故不入死居黄宁。 其义明矣。 三才同源。 三才者，天地人为三才也。 同源，是三才同居混沌之源也。 清浊既异， 清者，天也？ 浊者，地也。 既已也，异别也。 此言混沌之气分别也，则清气腾而为天，浊气降而为地，人在其中，是已有分别也。 元精各存。 元者，元气也。 精者，元气之精也。 言天地人元气之精各存也。 天法象我， 此言元精虽存，而天法象与人无二也。 我法象天。 言人法象天以成形也。 或问曰：前言天法象我，我法象天，天道因甚无倾覆，人道何故有死生？ 余答曰：天道虽有枢机，而清虚无心，清虚而无其心，则元气自运。 既元气自运，则五行无妨，五行无妨，则无刑克，既无刑克，则是大空，既是大空，则与道合同，是以不倾也。 余又答曰：人有生死者，非与天道不同也，乃人之自致也。 自致者，从父母媾结精气，至成形降生，便有悲啼喜怒哀乐，渐渐口责五味，耳听五声，眼观五色，心耽五欲，一向万机，无所不有。 此已上四事，皆因有心之变动也，既有其心，是无清虚也，既无清虚，是人失道也，既人失道，则与万类同矣，众物齐焉。 任运死生，随绿枯朽。 或如石火，或似浮涯，成时暂成，灭时便灭。 此盖人之自为，非大道之所致也。 人若心能无心，色能无色，味能无味，观能无观，欲能无欲，听能无听，机能无机，和光同尘，湛然常存，则与道同矣。 又何不得长生如天之乎？ 我命在我， 言人性命生死，由人自己。 人若能知自然之道，运动元和之气，外吞二景，内服五芽，动制百灵，静安五藏，则寒温饥渴不能侵，五兵白刃不能近，死生在手，变化由心，地不能埋，天不能煞，此之为我命在我也。 不在於天。 言人性命死生不由天也。 昧用者夭， 言昧用元气之人，反致夭寿，此则须事明师传受，方可得为之。 不然则又致夭寿也。 善用者延。 言达元气道理之人，则寿命延长。 气和体寂， 气，元气也。 体，形体也。 言元气淳和而形体自寂，形体既寂，而气自和。 守一神闲。 一者，一气也。 神者，神形也。 此言人但能守一气，则神形自然闲矣。 夫神者是气之子，气者神之母。 但知守其母，则子不远，知守其君，则神不散。",
      "translated_text": "He bestowed upon you the gateway to immortal learning—are you able to receive it?\nI again prostrated myself in long obeisance, my form and words filled with gratitude.\n\nHe then said: “I ask you to shear your hair and smear your blood to swear an oath, that I may transmit to you the arts of bending and stretching, exhaling and inhaling, and refining the body.”\nHe further said: “Within two cycles of twelve years, you must not transmit these to others. Should you pass them to the unworthy, they shall incur punishment.”\nI again prostrated myself in long obeisance, and suddenly he vanished.\n\nThereafter, I consistently followed the prescribed order, never slackening in my efforts. Every subtle word proved divinely efficacious. Having received my teacher’s command, I was bound to conceal these celestial mysteries. As the two cycles neared their end, I was permitted to transmit them to the world. Thus, I meticulously revised the ancient precepts, recast them into a new scripture, inscribed them in the marketplace, and concealed them among mountain stones. May later scholars who obtain them be fortunate!\n\n*Inscription on Returning Primordial Qi to Its Source*\n*Commentary by Qiangmingzi*\n\nBefore the One divided, the One was where the Dao was established. Qi was born of the One, yet undivided—this was the primordial chaos. Though this qi derived its name from the Great Dao, it remained the undifferentiated chaos, unseparated into purity and turbidity. Thus, the nameless gave rise to the named, and the named gave rise to the myriad things.\n\nThe *Daoist Scripture* states: “The nameless is the beginning of heaven and earth; the named is the mother of the myriad things.” The nameless refers to the Dao; the named refers to qi. The Dao is the father of the One qi, and the One qi is the mother of the myriad things. All that possesses form and appearance arises from the One qi.\n\nTherefore, in cultivating life, one values the Dao; in cultivating the Dao, one esteems qi. Qi is the root of spirit, the source of nature and life, the master of divine illumination. Should one cultivate it according to the proper method, one may attain the rank of immortal.\n\nThus, the *Yellow Court Scripture* says: “Exhaling the pure and inhaling the mysterious, the two qi shine—should you encounter them, you shall ascend to the Milky Way.” It further states: “Why not consume the qi of Great Harmony? Then you shall not enter death but dwell in Yellow Tranquility.” The meaning is clear.\n\nThe Three Powers share a single source. The Three Powers are heaven, earth, and humanity. “Share a single source” means they all reside in the primordial chaos. Once purity and turbidity diverged—purity ascending to become heaven, turbidity descending to become earth—humanity came to dwell between them, and thus distinctions arose. Yet the primordial essence of each remains.\n\nHeaven models itself after me; I model myself after heaven. Though the primordial essence persists, heaven’s modeling and humanity’s form are without duality. Humanity takes heaven as its model to complete its form.\n\nSomeone asked: “Earlier, you said heaven models itself after me, and I model myself after heaven. Why does the Way of Heaven never collapse, while the Way of Humanity knows life and death?”\nI replied: “Though heaven possesses its pivot and mechanism, it is empty and without intent. Being empty and without intent, the primordial qi moves of itself. With the primordial qi moving of itself, the Five Phases encounter no obstruction. Without obstruction among the Five Phases, there is no mutual conquest. Without mutual conquest, there is only the Great Void. Being the Great Void, it merges with the Dao and thus does not collapse.”\n\nI further replied: “Humanity’s life and death do not differ from the Way of Heaven but arise from humanity’s own doing. From the moment of conception through the union of parents’ essence and qi, to the formation of the body and birth, one is beset by sorrow, weeping, joy, anger, grief, and delight. Gradually, the mouth craves the five flavors, the ears heed the five sounds, the eyes behold the five colors, and the heart indulges in the five desires. Endlessly entangled in the ten thousand mechanisms, nothing is left ungrasped.\n\nThese four matters all stem from the movements of the intentful heart. Once intent arises, emptiness and purity are lost. Having lost emptiness and purity, humanity strays from the Dao and becomes as the myriad creatures, equal in their lot. They drift with the cycles of life and death, following the withering and decay of the green and the rot. Like the spark from struck stone or the floating duckweed, they form momentarily and perish in an instant. This is humanity’s own doing, not the work of the Great Dao.\n\nShould one’s heart be without heart, one’s color without color, one’s taste without taste, one’s gaze without gaze, one’s desires without desire, one’s hearing without hearing, one’s mechanisms without mechanism—harmonizing light and merging with dust, abiding in serene constancy—then one merges with the Dao. How then could one not attain longevity like heaven?\n\nMy life rests with me. Human nature and life, life and death, are determined by oneself. Should one comprehend the natural Dao, move the qi of Primordial Harmony, externally absorb the Two Radiant Essences, internally ingest the Five Sprouts, dynamically govern the hundred spirits, and tranquilly stabilize the Five Viscera, then cold and heat, hunger and thirst cannot invade; the five weapons and blades cannot approach. Life and death lie in one’s hands, transformations follow one’s heart. Earth cannot bury, heaven cannot slay—this is what is meant by ‘my life rests with me.’\n\nIt does not lie with heaven. Human nature and life, life and death, do not depend on heaven. Those who misuse it perish prematurely; those who use it well extend their years. Qi harmonizes and the body becomes quiescent. Qi is the primordial qi; the body is the physical form. When the primordial qi is pure and harmonious, the physical form naturally becomes quiescent. Once the physical form is quiescent, the qi naturally harmonizes.\n\nGuard the One, and the spirit becomes at ease. The One is the One qi; the spirit is the spirit and form. Should one but guard the One qi, the spirit and form naturally become at ease. The spirit is the child of qi; qi is the mother of the spirit. Know only to guard the mother, and the child will not stray. Know to guard the sovereign, and the spirit will not scatter.”",
      "overlap_context": "amed mountains, braving peril and scaling heights for twenty years. From the *Zhenming* year of the Liang, while wandering beneath the towering pines of Mount Tai’s summit, I suddenly beheld a man—his form and countenance unlike the common, his speech extraordinary—who called himself the Teacher of Ten Thousand Generations, the sole master of the Nine Heavens’ Dao. I then bowed my head and knelt in reverence.\n\nHe said to me: “You bear the marks of an immortal; only thus have you encountered me.”",
      "start_char": 328,
      "end_char": 1610,
      "start_sentence": 18,
      "end_sentence": 89,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.18362879753113,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\真气还元铬.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "此皆合自然之道，譬如水润下，火炎上，云从龙，风从虎之类是也。 灵芝在身， 灵芝，芝草也。 在身，在人身中也。 指元气是也。 不在名山。 不在名山所探也。 反一守和， 一是一神也，和是和气也。 前言守一神闲，此言反一神守和气，是为神气相守者，为念念相续，绵绵不断是也。 理合重玄。 理，道理也。 重玄，又玄也，言人能知反一神却守和气，此名玄之又玄也。 精极乃明， 精为精气也，明为神明也。 此言人得抱元守一之法，则精气充满，乃通於神明矣。 神极乃灵。 神是一神也，灵是人通灵也。 此言人达抱元守一之道者，则三万六千神常不离人，则自然通灵也。 气极乃清。 清气为神，浊气为形。 气为元气也，清为清虚也。 此言元气既极，则浊气自散，人乃清虚也。 因气而衰， 此言人皆因气衰，则形衰也。 因气而荣。 人气王，则身荣也。 因气而灭， 人气竭，则身灭也。 因气而生。 人皆因元气交结，以生身也。 喜怒乱气， 言人或喜或怒，皆乱正气也。 情性交争， 言人既有喜怒，财情性交争也。 拥隔成病， 前言情性交争，则元气拥隔也，气既拥隔，则成病矣。 神形岂宁！ 神为万神，形为形体，岂宁为形体不得安宁也。 炼阳销阴， 炼如烧炼也，阳是阳气也，销如销铄也，阴是阴气也。 上言神形不得安宁，此言炼阳销阴，此是擒制之门，调治之法。 大凡求仙学道，摄养乖宜，则须知烧练阳气而销铄阴邪，则可以长生矣。 且凡人病息，皆因五味以生身，却因五味以丧身。 初服气时，但先积心火以通身烧之，烧讫则依法服之，无不愈者，广成子曰：积火以烧五毒。 五毒者，五味也。 五毒尽，可以长生矣。 其气自行，其神自灵。 此言阴气消散之后，阳气自行。 以正遣邪， 正为正气，邪为邪气也。 言用正气而发遣邪气也。 其患自平， 平如不息时也。 上言以正气遣邪气，则如汤沃雪，以火销冰，自然平复如故矣。 乾坤澄静。 此已下说服气法次序也。 乾天也，坤地也，言为天地澄清，无风云雾雨雪时也。 子后午前， 子为夜半时也，午为日午时也。 大凡吐纳调服元气，皆取夜半子时，直至日午已前，并可调服，号曰六阳之气也。 午后至夜半子时，号日六阴之气也，不许吐纳调服内气，则百无所妨。 闭目平坐， 此为天道澄清，子后午前，吐纳调服时也。 则须闭目向王方，平坐调服，是平常之法也。 握固瞑然， 闭目平坐，便须握固。 握固，握大拇指也。 暝然，暝目也，似闭不闭是也。 纳息庐中， 庐，鼻也。 后便纳外息於鼻中，微微引入，令满气海，已久为妙，号日纳新是也。 吐息天关。 吐息，吐气也。 天关，口也。 前既引纳外气入气海中，既良久，又须吐之，则号日吐故是也。 入息微微， 微微，为鼻引外气时，微微引入，不令耳闻。 小则生之门，大则死之路，故引纳宜微微然。 出息绵绵，以意引气， 此为鼻引外气时也，须以意引外气，直入气海中也。 腑脏回旋。 此言以意引外气入气海，满则五脏六腑之气自然回旋，小转动，作声汨汨然。 然后呵之， 呵为口呵吐之。 上言腑脏回旋，气极又须呵吐之，不得强闭也。 荣卫通宣。 此言既行吐纳之理，则荣卫无拥滞也。 但有不和， 为人非时，五脏六腑不和也。 遣之踵前，",
      "translated_text": "These all accord with the Dao of nature—like water moistening downward, fire flaming upward, clouds following the dragon, and wind following the tiger. The numinous fungus dwells within the body: the numinous fungus is the *zhi* herb, \"within the body\" means within the human body, referring to the primordial qi. It does not reside in famous mountains. It does not depend on gathering from renowned peaks.\n\nReturn to the One and guard harmony: the One is the singular spirit, harmony is harmonious qi. Earlier it spoke of guarding the One to still the spirit; here it speaks of returning to the One to guard harmonious qi. This is the mutual abiding of spirit and qi, an unbroken continuity of thought after thought, an unceasing flow.\n\nThe principle accords with the Profound Mystery: the principle is the Dao’s principle. The Profound Mystery is the Mystery upon Mystery—when one knows to return to the One and yet guard harmonious qi, this is called the Mystery upon Mystery. When essence reaches its utmost, clarity arises: essence is essential qi, clarity is spiritual illumination. This means that when one attains the method of embracing the primordial and guarding the One, essential qi becomes full, and one thereby connects with spiritual illumination. When spirit reaches its utmost, numinosity arises: spirit is the singular spirit, numinosity is the human capacity for spiritual communion. This means that when one masters the Dao of embracing the primordial and guarding the One, the thirty-six thousand spirits never leave the person, and one naturally attains spiritual communion. When qi reaches its utmost, purity arises: clear qi is spirit, turbid qi is form. Qi is primordial qi, purity is pure emptiness. This means that when primordial qi reaches its utmost, turbid qi naturally disperses, and the person becomes purely empty.\n\nDecline follows qi: this means that when qi declines, the body declines. Flourishing follows qi: when qi is abundant, the body flourishes. Dissolution follows qi: when qi is exhausted, the body perishes. Life follows qi: all people arise from the intermingling of primordial qi to form the body.\n\nJoy and anger disorder qi: when people experience joy or anger, they disorder the correct qi. Emotions and nature contend: when joy and anger arise, emotions and nature contend with one another. Obstruction and blockage give rise to illness: earlier it spoke of emotions and nature contending, which obstructs and blocks primordial qi. Once qi is obstructed and blocked, illness arises. How can spirit and form be at peace? Spirit refers to the myriad spirits, form to the physical body—how can the physical body find tranquility?\n\nRefining yang dissolves yin: refining is like smelting, yang is yang qi, dissolving is like melting away, yin is yin qi. Earlier it spoke of spirit and form being unable to find peace; here it speaks of refining yang to dissolve yin—this is the gateway of restraint and the method of regulation. In general, those who seek immortality and study the Dao must know how to cultivate and nurture properly: one must refine yang qi to dissolve yin evil, and only then can one attain longevity.\n\nMoreover, all human illnesses arise because the five flavors give rise to the body, yet also cause the body’s demise. When first practicing qi absorption, one should first accumulate heart-fire to burn throughout the body. Once the burning is complete, follow the method to absorb qi, and there will be no illness that is not cured. Guangchengzi said: \"Accumulate fire to burn the five poisons.\" The five poisons are the five flavors. When the five poisons are exhausted, one can attain longevity.\n\nQi moves of itself, spirit becomes numinous of itself: this means that after yin qi disperses, yang qi moves naturally. Dispel the evil with the correct: the correct is correct qi, the evil is evil qi. This means using correct qi to expel evil qi. Illnesses naturally subside: \"subside\" means returning to a state of no illness. Earlier it spoke of using correct qi to expel evil qi—like hot water melting snow, like fire dissolving ice, one naturally returns to the original state.\n\nHeaven and earth become clear and still: the following explains the sequence of qi-absorption methods. Heaven is *qian*, earth is *kun*—this refers to when heaven and earth are clear, without wind, clouds, mist, rain, or snow.\n\nAfter midnight and before noon: *zi* is the midnight hour, *wu* is the noon hour. In general, for exhaling and inhaling to regulate and absorb primordial qi, one should take the time from midnight until before noon—this is called the qi of the six yang hours. From noon until midnight is called the qi of the six yin hours; one must not exhale, inhale, regulate, or absorb internal qi, as there is nothing that will not be harmed.\n\nClose the eyes and sit upright: when the Dao of heaven is clear and still, after midnight and before noon, it is time for exhaling, inhaling, regulating, and absorbing. One must face the royal direction, close the eyes, sit upright, and regulate the breath—this is the ordinary method.\n\nGrasp firmly and close the eyes in stillness: after closing the eyes and sitting upright, one must grasp firmly. \"Grasp firmly\" means to clasp the thumbs. \"Close the eyes in stillness\" means to close the eyes as if closed yet not closed.\n\nDraw breath into the central chamber: the central chamber is the nose. Then draw external breath into the nose, gently guiding it in until the sea of qi is full. After a long while, this is excellent—it is called \"absorbing the new.\"\n\nExhale through the celestial gate: exhaling is expelling breath, the celestial gate is the mouth. After guiding external qi into the sea of qi for a long while, one must then exhale—this is called \"expelling the old.\"\n\nInhalation should be subtle: subtle means that when drawing external qi through the nose, one should guide it in gently, so that the ears do not hear. Subtle is the gateway of life, excessive is the path of death—thus, guiding and absorbing should be subtle.\n\nExhalation should be unbroken: use intention to guide qi. This refers to when drawing external qi through the nose—one must use intention to guide external qi directly into the sea of qi.\n\nThe organs and viscera revolve: this means that when using intention to guide external qi into the sea of qi until it is full, the qi of the five viscera and six bowels naturally revolves, gently moving and making a gurgling sound. Then exhale: exhaling is done through the mouth. Earlier it spoke of the organs and viscera revolving; when qi reaches its utmost, one must exhale and not forcibly hold it in.\n\nNutritive and defensive qi circulate freely: this means that after practicing the principles of exhalation and inhalation, nutritive and defensive qi flow without obstruction. If there is disharmony: when a person is unwell, the five viscera and six bowels are disharmonious. Dispel it before the heels...",
      "overlap_context": "and harmonious, the physical form naturally becomes quiescent. Once the physical form is quiescent, the qi naturally harmonizes.\n\nGuard the One, and the spirit becomes at ease. The One is the One qi; the spirit is the spirit and form. Should one but guard the One qi, the spirit and form naturally become at ease. The spirit is the child of qi; qi is the mother of the spirit. Know only to guard the mother, and the child will not stray. Know to guard the sovereign, and the spirit will not scatter.”",
      "start_char": 1610,
      "end_char": 3004,
      "start_sentence": 90,
      "end_sentence": 180,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.653109312057495,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\真气还元铬.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "遣之上文云已，正遣邪是踵前。 《南华经》云：众人之息以喉，真人之息以踵。 踵犹跟也。 又《胎息经》云：凡人呼吸与真人呼吸有殊，凡人息气，出入於咽喉，真人息气於气海，是气之根本之处。 余按外出云踵，足为踵，踵为脚跟也。 此言踵，踵为气根也。 跟之言根也，言气海是人生根本之处，故但有不和，则令发遣邪气，胎息如前法是也。 呵五六度， 呵为六气也，言大凡五脏六腑之气，皆属心，心属呵，但以呵吐纳之，为上法也。 吐纳毕，则依·法服气行气。 无疾不镯。 言依呵吐纳之，无疾病不镯除也。 凡欲胎息， 气凝日胎，呼吸日息，则胎向气中凝，气向胎中息，故曰胎息也。 导引为先。 为子后午前，未闭目平坐，握固暝然前也。 经脉不拥， 言先导引，则经豚气不拥滞也。 关节不烦， 言为导引摆掣动关节，元气流行，无所拥滞，故言关节不烦问也。 或如射雕， 此已下是导引法也，此言如人翻身射雕之势也。 侧身弯环。 一句便是射雕势也。 或举腰背， 此又是一法，仰外以两手背托地，便举腰收脚，令头着地是也。 如蟾半圆， 此是举腰法。 交指脑后，此别是一法，以两手十指相叉，交於脑后，抱着玉枕是也。 左旋右旋。 上言交指脑后，次便须回头背，或左旋转，或右旋转是也。 劲手足气， 言导引时，劲挺两手，便感元气是也。 出於指端。 上言既劲挺手足，元气自然出於十指之端也。 摆掣四肢， 此言为导引时，摆掣动手足，故云四肢也。 捉摄三关。 此言为导引时，或闭气，或握固，直至脚十趾皆捉扩之是也。 三关，口手脚也。 熟摩尺宅， 以两手摩面上是也。 气海亦然。 为亦使两手摩之。 叩齿集神， 大凡服气导引，须先叩齿三十六通，以集五脏之神。 齿为上下齿，号曰天鼓，神闻鼓声则集矣。 合眸固关。 眸为眼目也，关为口手足也。 言三关闭，则万邪不入。 冥心放骸， 万虑不入，放纵也。 骸，形骸也。 此言灰心，万虑不入，放纵形骸，如太空是也。 任气往还。 闭江任气神庐中往还也。 觉气调匀， 觉鼻中生还之气，调匀也。 拥塞喉关。 喉气和取，出息时便闭气，令外不入，内不出，是拥塞喉关也。 拥塞则咽， 此为前拥塞得元气在喉问，既外不入，内不出，则咽之。 三咽相连。 又说咽气之常法也。 三咽相连，为一闭气，三连咽之，不许津与气同咽也。 转舌漱入， 为闭气时，却微吐出，气在口中，含之以舌，小转动，便漱入也。 咽下丹田。 此言漱咽下元气，直入丹田，下丹田，脐下三寸气海是也。 以意引气， 既咽下气，则以意引气，令入丹田。 令声汨然。 咽气下时，有声汨汨然，如水沥坎，闻之分明。 一咽三咽， 此言咽气时，一咽至三咽，则一闭气，三连．咽是也。 再咽如前， 此言三咽既毕，任气从神庐中往来，候气调则如前三连咽之，是再咽如前也。 三十六咽， 是每三连咽毕，候气调则如前三连咽之，直至三十六咽，气之常宜也。 《黄庭经》云：三十六咽玉池裹。 此之谓也。 若未绝粒，即须少食，务令腹中旷然，虚冷无问，坐外但腹空则咽之，一日通夕至十度，自然百六十咽矣。 若久服通，顿至三百六十咽，亦谓之中成。 一千二百咽，谓之大成，是为太息也。 如小胎息，但闭气数至一千或一百息，亦谓之大成。",
      "translated_text": "Dispelling it before the heels—this was stated above; to properly dispel the pathogenic is before the heels. The *Nanhua Sutra* says: \"The breath of the multitude reaches the throat; the breath of the perfected reaches the heels.\" The heel is like the sole. The *Scripture of Embryonic Breathing* also says: \"The breathing of ordinary people differs from that of the perfected. Ordinary people’s breath enters and exits through the throat; the perfected’s breath resides in the sea of qi, which is the root of qi.\" I note that when it speaks of \"exiting before the heels,\" the foot is the heel, and the heel is the sole of the foot. Here, \"heel\" refers to the root of qi. \"Heel\" (*gen*) is akin to \"root\" (*gen*), meaning the sea of qi is the root of human life. Thus, when there is disharmony, one must expel pathogenic qi, practicing embryonic breathing as previously described.\n\nExhale five or six times: \"Exhale\" refers to the six qi. Generally, the qi of the five viscera and six bowels all belong to the heart, and the heart belongs to exhalation. Thus, using exhalation for inhalation and exhalation is the superior method. After completing inhalation and exhalation, proceed to ingest and circulate qi according to the method. There is no illness that will not be dispelled. This means that by practicing exhalation and inhalation, no illness will remain unremoved.\n\nWhenever one wishes to practice embryonic breathing—qi congeals as the embryo, and breath is called \"breathing,\" so the embryo congeals within qi, and qi breathes within the embryo, hence the term \"embryonic breathing\"—one must begin with daoyin. After midnight and before noon, sit upright with eyes closed, hands clenched, and gaze fixed forward. The meridians will not be obstructed: this means that by first practicing daoyin, the qi of the meridians will flow without obstruction. The joints will not be troubled: this means that by moving the joints through daoyin, original qi circulates freely without obstruction, so the joints will not be afflicted.\n\nSome movements resemble shooting a hawk: the following describes daoyin methods. This refers to the posture of turning the body like one shooting a hawk. Lean to the side and curve the body: this single phrase describes the \"shooting hawk\" posture. Some raise the waist and back: this is another method, where one lies supine, presses the backs of the hands to the ground, lifts the waist, and draws in the legs until the head touches the ground. Like a half-round toad: this describes the \"raising waist\" method. Interlace the fingers behind the head: this is a separate method, where the ten fingers are interlaced behind the head, grasping the \"Jade Pillow.\" Rotate left and right: after interlacing the fingers behind the head, one must turn the head and back, rotating either left or right. Strengthen the hands and feet with qi: during daoyin, when the hands and feet are tensed, one senses the original qi. It emerges from the fingertips: after tensing the hands and feet, the original qi naturally flows from the tips of the ten fingers. Swing the four limbs: this means that during daoyin, one swings and moves the hands and feet, hence the term \"four limbs.\" Grasp and gather the three passes: during daoyin, one may hold the breath or clench the fists, extending this to the ten toes—this is called \"grasping the three passes.\" The three passes are the mouth, hands, and feet. Thoroughly rub the \"foot-length dwelling\": this means rubbing the face with both hands. The sea of qi is the same: one should also rub it with both hands. Knock the teeth to gather the spirit: in all cases of ingesting qi and practicing daoyin, one must first knock the teeth thirty-six times to gather the spirits of the five viscera. The teeth refer to the upper and lower teeth, called the \"Heavenly Drum\"; when the spirits hear the drumming, they gather. Close the eyes and secure the passes: the eyes are the \"pupils,\" and the passes are the mouth, hands, and feet. When the three passes are closed, no pathogenic influences can enter. Calm the mind and relax the body: free the mind from all thoughts and relax the body. The body is the physical form. This means to quiet the mind, free it from all thoughts, and relax the body as if it were empty space. Allow qi to come and go: close the mouth and let qi circulate within the \"spirit hut.\" Sense the qi becoming harmonious: feel the qi returning through the nose, becoming balanced. Obstruct the throat pass: when the throat qi is harmonious, during exhalation, hold the breath so that nothing enters from outside nor exits from within—this is obstructing the throat pass. When obstructed, swallow: after obstructing the throat, the original qi remains there; with nothing entering from outside nor exiting from within, one swallows it. Three swallows in succession: this describes the standard method of swallowing qi. Three swallows in succession form one breath-holding; swallow three times in a row without allowing saliva and qi to be swallowed together. Turn the tongue and rinse inward: while holding the breath, slightly exhale so that qi fills the mouth, then use the tongue to gently stir it before rinsing it inward. Swallow it down to the cinnabar field: this means to swallow the original qi directly into the cinnabar field. The lower cinnabar field is the sea of qi, three inches below the navel. Guide the qi with intention: after swallowing the qi, use intention to guide it into the cinnabar field. Let it make a gurgling sound: when swallowing the qi, it should produce a gurgling sound, like water trickling into a pit, clearly audible. One swallow to three swallows: when swallowing qi, one swallow to three swallows constitutes one breath-holding, with three consecutive swallows. Swallow again as before: after completing three swallows, let the qi circulate within the \"spirit hut,\" and when the qi is harmonious, swallow three times in succession again as before. Thirty-six swallows: after each set of three consecutive swallows, wait for the qi to harmonize, then swallow three times in succession again, up to thirty-six swallows—this is the standard practice for qi. The *Scripture of the Yellow Court* says: \"Thirty-six swallows in the Jade Pool.\" This is what it refers to.\n\nIf one has not yet ceased taking grains, one must eat sparingly, ensuring the abdomen remains empty, cool, and free of discomfort. When sitting, if the abdomen is empty, swallow the qi. From dawn to dusk, one may do this ten times, naturally reaching one hundred and sixty swallows. With prolonged practice, one may reach three hundred and sixty swallows at once, which is called \"intermediate attainment.\" One thousand two hundred swallows is called \"great attainment,\" also known as \"grand breathing.\" For minor embryonic breathing, simply hold the breath and count to one thousand or one hundred breaths—this is also called \"great attainment.\"",
      "overlap_context": "a gurgling sound. Then exhale: exhaling is done through the mouth. Earlier it spoke of the organs and viscera revolving; when qi reaches its utmost, one must exhale and not forcibly hold it in.\n\nNutritive and defensive qi circulate freely: this means that after practicing the principles of exhalation and inhalation, nutritive and defensive qi flow without obstruction. If there is disharmony: when a person is unwell, the five viscera and six bowels are disharmonious. Dispel it before the heels...",
      "start_char": 3004,
      "end_char": 4412,
      "start_sentence": 181,
      "end_sentence": 265,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.3140549659729,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\真气还元铬.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "然不能炼形易质，纵得丧生，如同桔木无精光也。 几啃摄养乖宜，卒生疾，但依服气法，急治之，取差。 咽气时一不铃三十六咽也。 上至三十咽，五十、六十、七十、八十、九十、一百咽，并得腹内气转，四肢气通，则须且外，放散手，闭口任气从神庐中往来，令微微然，但微之又微，闭气多，出少，是法此可为真胎矣。 胎息成焉。 胎息气但三连咽，咽至三十六咽为成。 大道无为， 大道，喻人身无为，是无所施为也。 但习胎息时，或坐或外，或行或立，任气胎息，纵身如大空，始至无为，是人无身也。 既至无身，则是无乱想，既无乱想，则元气不求而自－至，不召而自来。 而无不为。 此言却破大道无为，恐学人执着无为，故云无不为也。 若能无为， 前注云：纵身如彼大空是也。 是名无思； 前注云：既如大空所空，无心是名无思。 若能无思， 前注云：若能空空无心，则自然所无思也。 万物自归。 万物，万姓也。 万姓，指元归也。 自归者，则自然归也。 言能无思，则元气自然归身也。 若作用而求元气者，如缘木求鱼也。 法象无二， 言习真气还元之道，古今如一。 不假施为。 言自然也，如作用而强施为者非。 不寒不热， 此说是真气还元返本之功效也。 久而行之，则不寒不热。 不渴不饥。 此一句真气功效也，勤而行之，乃至不渴不饥也。 妙中之妙，微中之微。 此上二句，是赞此真气还元之不可思议。 视之而不见，听之而闻，搏之而不得，与希夷微同矣。 恬然无欲， 恬为无味之味，然常也。 言此道恬常而无所欲。 以道自怡。 怡，悦也。 言人得真气还元之道，且我命在我不在於天，功满之后，白日升天，坐在立亡，万神朝拜，山岳倾而我不倾，世界壤而我不坏，故自怡然矣。 怀道君子， 此一句指学道之人也。 铭之佩之。 此一句令求学仙道之人敬重此文，可以镌之於石，佩带於身矣。 真气还元铭竟",
      "translated_text": "Yet if one cannot refine the form and transform the essence, even if one gains longevity, it is but a withered tree devoid of vital radiance.\n\nShould one’s nurturing and care deviate from proper method and suddenly fall ill, one must swiftly follow the qi-swallowing practice to cure it. When swallowing qi, one need not always complete thirty-six swallows. From thirty swallows upward—fifty, sixty, seventy, eighty, ninety, to one hundred—once the qi within the abdomen stirs and the qi in the four limbs flows freely, one should then cease, relax the hands, close the mouth, and allow the qi to come and go through the spirit’s chamber, letting it be faint, ever so faint. Hold the breath long, exhale little—this is the method by which true embryonic breathing is achieved. Thus is embryonic breathing perfected.\n\nEmbryonic breathing is accomplished by three consecutive swallows, completing thirty-six swallows in total. The Great Dao is non-action; the Great Dao, likened to the human body, is non-action—it is without deliberate effort. When practicing embryonic breathing, whether sitting or lying, walking or standing, let the qi follow the embryonic breath, and release the body as vast emptiness. Only then does one attain non-action, which is to be without a body. Having no body, one has no chaotic thoughts; having no chaotic thoughts, primordial qi arrives unbidden, comes unsummoned. And there is nothing it does not accomplish. This speaks to dispelling the misconception of the Great Dao’s non-action, lest practitioners cling to non-action—hence it is said, \"there is nothing it does not accomplish.\"\n\nIf one can be without action—\n*(As the preceding note states: releasing the body as that vast emptiness is the way.)*\nthis is called \"without thought.\"\n*(As the preceding note states: being as vast emptiness, empty of self, is called \"without thought.\")*\nIf one can be without thought—\n*(As the preceding note states: if one can be empty of emptiness, without mind, then naturally there is no thought.)*\nthe myriad things return of themselves.\n*(The myriad things are the myriad people. The myriad people point to the primordial return. \"Return of themselves\" means they return naturally. It is said that if one can be without thought, primordial qi naturally returns to the body.)*\nTo seek primordial qi through deliberate effort is like climbing a tree to catch a fish. The method and image are not two—\n*(This speaks of the Dao of returning primordial qi to its origin, which is the same in ancient and modern times.)*\nit requires no forced action.\n*(This speaks of naturalness; deliberate effort is not the way.)*\nNeither cold nor hot—\n*(This describes the efficacy of returning primordial qi to its origin.)*\nwith prolonged practice, one becomes neither cold nor hot.\nNeither thirsty nor hungry—\n*(This line speaks of the efficacy of primordial qi. With diligent practice, one reaches the state of neither thirst nor hunger.)*\nWondrous within the wondrous, subtle within the subtle.\n*(These two lines praise the inconceivable nature of returning primordial qi to its origin.)*\nSeen yet unseen, heard yet unheard, grasped yet unattained—it is one with the subtle and the imperceptible.\n\nSerene and desireless—\n*(Serenity is the flavor of no-flavor, ever constant. This speaks of the Dao as serene and constant, without desire.)*\none delights in the Dao.\n*(Delight is joy. This speaks of attaining the Dao of returning primordial qi to its origin—my life is in my hands, not in Heaven’s. After fulfilling the practice, one ascends to Heaven in broad daylight, dies seated or standing, receives the homage of the ten thousand spirits, remains unmoved when mountains topple, and endures unharmed when the world crumbles. Thus one delights in the Dao.)*\n\nScholars of the Dao—\n*(This refers to those who study the Dao.)*\nengrave this and wear it close.\n*(This instructs seekers of immortality to revere this text, inscribing it on stone or wearing it upon the body.)*\n\nHere ends the *Inscription on Returning Primordial Qi*.",
      "overlap_context": "f the abdomen is empty, swallow the qi. From dawn to dusk, one may do this ten times, naturally reaching one hundred and sixty swallows. With prolonged practice, one may reach three hundred and sixty swallows at once, which is called \"intermediate attainment.\" One thousand two hundred swallows is called \"great attainment,\" also known as \"grand breathing.\" For minor embryonic breathing, simply hold the breath and count to one thousand or one hundred breaths—this is also called \"great attainment.\"",
      "start_char": 4412,
      "end_char": 5221,
      "start_sentence": 266,
      "end_sentence": 312,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.674408197402954,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\真气还元铬.txt",
        "category": "方法类"
      }
    }
  ]
}