{
  "source_id": "真藏经要诀",
  "source_file": "chunked_daozang\\真藏经要诀.json",
  "total_chunks": 4,
  "total_original_chars": 2336,
  "total_translated_chars": 13761,
  "total_translation_time": 69.19070219993591,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\玉诀类\\真藏经要诀.txt",
    "category": "玉诀类"
  },
  "full_translation": "**Essential Secrets of the *True Treasury Sutra***\n\n*Title:* *Essential Secrets of the True Treasury Sutra*. Author unknown, approximately dated to the Tang dynasty. Compiled as excerpts from the *True Treasury Sutra*. One fascicle.\n\n*Source:* *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Jade Instructions* Category.\n\n---\n\n**Essential Secrets of the *True Treasury Sutra***\n\nLong ago, there were five destitute scholars who harbored arrogance and disdained the sutras and teachings. They closed the gates of the Three Treasures, disbelieving that:\n- sentient beings possess the true nature of the Dao,\n- sentient beings possess the wondrous Dharma of the sutras,\n- sentient beings attain the extinction of the self in quiescence,\n- sentient beings are equal in the Great Vehicle,\n- sentient beings are neither born nor perish,\n- the minds of sentient beings are like the great ocean,\n- sentient beings walk the path of the Heavenly Worthy,\n- sentient beings constitute the great assembly of emptiness.\n\nThrough such disbelief, they fell gravely ill. In life, they entered the dark prison; in death, they entered the dark prison; in walking, they entered the dark prison; in standing, they entered the dark prison; in sitting, they entered the dark prison; in lying down, they entered the dark prison; in eating, they entered the dark prison; in resting, they entered the dark prison.\n\nAll good men and women, each must reflect deeply and never harbor disbelief. If one fails to comprehend, one may still cultivate a sincere heart, refrain from slander, and thereby accumulate vast and boundless merit.\n\nWhy is this so? Because the Dharma has no form, the Dharma has no fixed nature, the Dharma is liberation itself. Know that the sincere heart is itself the Dao-field—free from clinging to all dharmas, one enters wondrous quiescence; free from clinging to birth and death, one enters the jeweled marks; free from clinging to grasping and rejecting, one enters all wisdom; free from clinging to anger and delusion, one enters all liberation; free from clinging to greed and desire, one enters all Dharma-treasures; free from clinging to right and wrong, one enters all true paths; free from clinging to sound and form, one enters all fields of merit; free from clinging to the six senses, one enters all that is untainted; free from clinging to the five aggregates, one enters great wisdom; free from clinging to the four elements, one enters all divine powers.\n\nThis Dharma is subtle and wondrous—even after kalpas of explanation, it cannot be exhausted. Yet if there be those of quick understanding, a mere half-word suffices to truly realize the Great Vehicle and comprehend the supreme Way. If one can believe with the heart, receive and uphold it, skillfully forget the spirit, and wash away the filth of the mind, the merit will be vast and boundless, beyond all conception.\n\nThe Heavenly Worthy said: Without departing from body and mind, one attains liberation. Those who attain liberation dwell in the quiescent Dao-field, enter the seal of the true Dharma, realize the causes of the three times, and accomplish the supreme fruit. All sentient beings—mind-nature is liberated, bodily form is liberated. The mind becomes verbal teaching, the body becomes written scripture. To follow the words and pursue the characters is to forget the traces of the teaching. Awakening to these words, one enters the gate of liberation and realizes the supreme Way.\n\nThe Youth of Auspicious Sound addressed the Heavenly Worthy: \"I do not yet understand—how is the mind of sentient beings verbal teaching, and the body written scripture? The mind of sentient beings is a deluded mind, the body is a net of darkness. How can sentient beings study this deluded mind and seek this net of darkness to attain the Way? The deluded mind of sentient beings does not know what to study to attain the Way, and those who do not study cannot attain the Way. If one studies the deluded mind, one still cannot attain the Way. Why is this? To study delusion with delusion, the nature of delusion does not arise—how can one attain the Way? The deluded mind of sentient beings, deluded, does not know what to study, and studying, cannot attain the Way. It is like fire within wood—fire does not arise by itself but must be kindled by another before it can be obtained. The deluded mind of sentient beings must rely on a guiding teacher to attain awakening and understanding. I pray you explain this.\"\n\nThe Heavenly Worthy said: \"All dharmas are pure, neither born nor extinguished. How then can there be sentient beings who attain the Way? How can there be sentient beings who lose the Way? How can there be sentient beings enmeshed in the net of delusion who study and attain the Way? How can there be a deluded mind that, without study, attains the Way? Dharmas have no inherent nature, ultimately no self. Why do you raise such distinctions among sentient beings? The scriptures I speak are apart from nature—this is not nature’s liberation. It is a skillful means to guide and enable recognition of the scriptures. Apart from nature—this is the liberation of Dharma-nature. It is a skillful means to guide and enable recognition of the true sound. Those who realize the Dharma-sound realize that there is no Dharma to realize, no Dharma to cultivate, no Dharma to study, no Dharma to attain, no Dharma to receive—ultimately pure, merged into oneness, not one.\n\nWhen the beings of the Two Vehicles hear these words, they are startled, alarmed, and terrified, with no place to stand. Then the assembly of the Dharma-sound suddenly awakens, comprehends the Great Vehicle’s teaching, and realizes equality without duality. Bowing in reverence, they forget their forms and depart.\n\nAll sentient beings cling to conditioned existence, delighting in life and fearing death. Though they seek life, they create the karma of death and do not uphold the precepts. Though they may live long, they are like old trees—what difference is there? Those who uphold the precepts, at death, ascend to the heavenly offices and become immortals, free and at ease. Though one may hold the position of emperor or the three highest ministers, if one upholds the precepts, at death one ascends as an immortal, free and joyful. Of all things under heaven, none are everlasting—only the Dao and virtue are neither born nor extinguished.\n\nAll sentient beings arise from the Dao and perish in the Dao; all karmic conditions are threaded through a single gate. It is like a mother giving birth to a child—though the child harbors ingratitude, abandons its mother, and commits sins in all directions, ensnared in nets, the mother’s thoughts of longing tear at her bowels, yet the child remains unaware, suffering pain and agony. Sentient beings, inverted and deluded, have lost their root—it is just like this.\n\nThe profound teaching of the Great Vehicle bestows virtue according to roots, though one may not be aware of it. Though unaware, one is delivered according to roots—all sentient beings receive its moisture, emerging from suffering into joy, never departing the true treasury. Sentient beings, deluded, conceive of existence through false thoughts and never awaken within the true treasury. Why is this? Because the true nature of Dharma-nature is real—within the true, one receives existence, and existence is a mass of suffering, which is suffering and affliction. I observe all things as great wisdom—neither born nor extinguished, without suffering or affliction, equal in coming and going, equal in entering and exiting.\n\nBestowing according to lower roots is equality; upholding precepts without precepts according to middle roots is equality; wisdom without wisdom or self according to higher roots is equality. Sentient beings receive joy—joy without reception is equality. The karmic retribution of sentient beings—retribution without karma is equality. All dharmas are equal without anything to equal—because there is nothing to equal, it is called the Great Way.\n\nDiligently study the Great Vehicle and skillfully practice the three wisdoms: first, skillfully accumulate expedient means to extinguish external dust; second, sever all karmic outflows and not emerge in others’ realms; third, seek the true mark until reaching the Dao-field. Having realized and returned to the root, the two views are ever luminous, the three karmas revolve, the four elements are ever pervading, the five aggregates open and clear, the six senses are unstained, the seventh consciousness abides of itself, the eightfold path is without self, and the nine virtues flow unceasingly. Former worthies and later sages all attained the Way by this means. Know that the true treasury is foremost.\n\nAll sentient beings—body and nature are pure, the celestial true Way is hidden within, called the true treasury.\"\n\nShould one expound the *True Treasury Sutra*, the merit of such a person is inconceivable—they shall behold my true form and attain the supreme Dao. If one holds faith and relinquishes all distracting thoughts, they shall gain the Dao-eye, illuminating the causes of the three times with boundless equanimity.\n\nSome may cast away their bodies, shattering them to pieces; some may throw themselves to hungry tigers; some may burn their bodies and lives in fire; some may, bound by karmic cause and effect, relinquish and offer in pursuit of blessings. Yet such merits are meager, and the power of the Dharma remains unfulfilled. Why? Because they lack the power of wisdom and fail to penetrate the truth.\n\nSelf-realization is self-seeking; self-attainment is self-possession. Yet in this way, one binds oneself, falls into the obscuration of ignorance, and remains entangled in karma, karma begetting karma—how then can liberation be found?\n\nThis contemplation is foremost. First, one counts the mind, yet the mind does not abide in dharmas; because dharmas do not abide, there is no fixed dharma. Because there is no fixed dharma, the wisdom of seeing the Dao arises. One who sees the wisdom of the Dao is none other than one’s original self—unborn and undying.\n\nNot recognizing one’s original self is like a traveler who, upon finding an abandoned casket on the road, opens it to see a mirror. Beholding their own reflection, they mistake it for the casket’s owner, their mind seized with terror. Bowing in apology, they cast it aside and flee. Sentient beings, deluded, forsake the true and grasp the false, abandon the root and chase the branches—just so.\n\nThe Heavenly Worthy said: All sentient beings—bodies without limit—are called the Dharma of sutras, also named the assembly of dharmas. Why? Because names arise from the resolution of delusion. Yet if one does not comprehend the essence, they are called sentient beings, also named birth-and-death, also named the mass of suffering, also named inversion, also named external seeking. Why? Because sentient beings do not understand—this is called delusion. For this reason, they fail to recognize their own selves. Within their very selves lie boundless dharmas, fully possessing the Three Clarities’ realm.\n\nYet sentient beings, deluded, turn outward in search, distrusting the true Dharma and not seeking good spiritual friends—they are called sentient beings. Thus they sink the Dharma into the world, from kalpa to kalpa, never awakening. If they encounter a good spiritual friend, this is called a karmic affinity from past lives, planting the seeds of merit. Why? Because past causes yield present fruits, and through meeting the Heavenly Worthy, the supreme, secret, and profoundly mysterious true treasury is revealed. Understanding past causes, they realize the present fruit.\n\nYou who seek must first seek within, perceiving the secret Dharma and widely unfolding the true treasury. Through this treasury of Dharma, all dharmas are gathered and encompassed without limit.\n\nThe Wisdom-Power Youth said: Though I have heard the sagely teaching, I cannot comprehend it. What is the Dao? What is the Dharma?\n\nWhat is a teacher? What is an assembly? Since you do not know, I shall explain for you.\n\nThe Heavenly Worthy replied: What you ask pertains to seeking the true treasury and perceiving the secret Dharma. Now still your spirit and abide in quietude, and I shall expound it widely.\n\nAll sentient beings possess a nature of purity within their bodies—the true and correct Dao of Heavenly Truth lies concealed therein, called the true treasury.\n\nThe Heavenly Worthy further said: To disbelieve that the Three Treasures reside within the root, to disbelieve that sentient beings share the same nature as the Heavenly Worthy, to disbelieve that all dharmas are quiescent and without form, to disbelieve that sentient beings, since time immemorial, have manifested in myriad forms yet remain unborn and undying—such disbelief is called slandering the Dharma, destroying the Dharma, annihilating the Dharma. Having annihilated the Dharma, one revolves in the cycle of birth and death and must inevitably fall into hell, with no chance of escape.\n\nBeware of seeking externally. Without clinging to the form of the body, one pervades all realms; without clinging to the form of the body, one is neither born nor destroyed. The marks of excellence do not arise apart from sentient beings, nor does one fill the void apart from sentient beings, nor does the true treasury exist apart from sentient beings.\n\nAll good men, do not give rise to disbelief. What issues from the Golden Mouth is without the slightest error.\n\nThe Youth of Auspicious Sound bowed his head, prostrated himself again, and received the teaching with faith, vowing to put it into practice.\n\nHere ends the Essential Instructions on the *True Treasury Sutra*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "真藏经要诀 经名：真藏经要诀。 撰人不祥，约出於唐代。 系摘录《真藏经》而成。 一卷。 底本出处：《正统道藏》洞真部玉诀类。 真藏经要诀 昔有五贫士常怀我慢，不信经法，灭三宝门； 不信众生有真道性，不信众生有经妙法，不信众生无我寂灭，不信众生等大乘法，不信众生不生不灭，不信众生心如大海，不信众生等天尊行，不信众生为大空聚。 如是不信，即得重病，生入暗狱，死入暗狱，行入暗狱，住入暗狱，坐入暗狱，卧入暗狱，食入暗狱，息入暗狱。 诸善男女，各自思惟，勿生不信。 若不达解，能行直心，不生毁谤，功德广远。",
      "translated_text": "**Essential Secrets of the *True Treasury Sutra***\n\n*Title:* *Essential Secrets of the True Treasury Sutra*. Author unknown, approximately dated to the Tang dynasty. Compiled as excerpts from the *True Treasury Sutra*. One fascicle.\n\n*Source:* *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Jade Instructions* Category.\n\n---\n\n**Essential Secrets of the *True Treasury Sutra***\n\nLong ago, there were five destitute scholars who harbored arrogance and disdained the sutras and teachings. They closed the gates of the Three Treasures, disbelieving that:\n- sentient beings possess the true nature of the Dao,\n- sentient beings possess the wondrous Dharma of the sutras,\n- sentient beings attain the extinction of the self in quiescence,\n- sentient beings are equal in the Great Vehicle,\n- sentient beings are neither born nor perish,\n- the minds of sentient beings are like the great ocean,\n- sentient beings walk the path of the Heavenly Worthy,\n- sentient beings constitute the great assembly of emptiness.\n\nThrough such disbelief, they fell gravely ill. In life, they entered the dark prison; in death, they entered the dark prison; in walking, they entered the dark prison; in standing, they entered the dark prison; in sitting, they entered the dark prison; in lying down, they entered the dark prison; in eating, they entered the dark prison; in resting, they entered the dark prison.\n\nAll good men and women, each must reflect deeply and never harbor disbelief. If one fails to comprehend, one may still cultivate a sincere heart, refrain from slander, and thereby accumulate vast and boundless merit.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 248,
      "start_sentence": 0,
      "end_sentence": 11,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.836501121520996,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\真藏经要诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "何以故？ 法无相故，法无定故，法解脱故。 当知直心即是道场，不怀诸法，入诸妙寂； 不怀生死，入诸宝相； 不怀取舍，入诸智慧； 不怀嗔痴，入诸解脱； 不怀贪欲，入诸法宝； 不怀是非，入诸正道； 不怀声色，入诸福田； 不怀六情，入诸无漏； 不怀五荫，入诸大慧； 不怀四大，入诸神通。 此法微妙，终劫说之，亦不能尽。 若有生知易悟，略说半字，真证大乘，解无上道。 若能信心受持，善解忘神，洗除心垢，功德广远，不可思议。 天尊言：不离身心而得解脱，得解脱者，寂灭道场，入正法印，证三世因，成无上果。 一切众生，心性解脱，身相解脱。 心为言教，身为文字，寻文逐字，教迹斯忘。 悟此文字，入解脱门，证无上道。 善音童子白天尊言：不审众生心为言教，身为文字。 众生心是痴心，身是暗网，云何令众生学其痴心而求暗网，而得成道？ 众生痴心，不复知学应得成道，不知学者而不成道。 若学痴心，亦不成道。 何以故？ 以痴学痴，痴性不发，云何成道？ 众生痴心，痴不知学，学不成道。 譬如木中有火，火不自生，必假人攻，方得其火。 众生痴心，必假导师而得悟解。 愿为说之。 天尊曰：诸法清浄，无生无灭。 云何有众生得道？ 云何有众生失道？ 云何有众生痴网而学成道？ ，云何有痴心，不学而得成道？ 法无自性，毕竟无我。 云啊众生差别，而作此难？ 我说文字，性离则是，非性解脱，方便引诱，令识文字； 性离则是，法性解脱，方便引诱，令识正音。 证法音者，无法可证，无法可修，无法可学，无法可得，无法可受，究竟清浄，混成非一。 二乘众生，闻此语者，惊忙震惧，立身无所。 是时法音等众豁然意解，悟大乘宗，平等无二，归命忘形，稽首而去。 一切众生贪着有为，欣生恶死，意虽求生，由造死业，不持戒行； 虽得长寿，由如老树，有何殊别？ 若持戒者，死补天官，升仙自在。 虽有帝王、三公之位，能持戒行，死则升仙，自在快乐。 天下万物，无有长存； 唯有道德，不生不灭。 一切众生，从道而生，从道而灭，业缘悉被，同贯一门。 譬如母之生子，子怀不孝，弃掷其母，四向造罪，被击罗网。 母思忆之，枯肠寸断，子终不觉，身自受苦，痛楚难当。 众生颠倒，迷失其本，亦复如是。 大乘玄教，随根布德，了不自知。 虽不觉知，随根度脱，一切众生悉皆受润，出苦入乐，不离真藏。 众生迷惑，妄想为有，於真藏中，终不觉悟。 何以故？ 法性真故，於真受有，有是苦聚，即是苦恼。 我观一切，悉是大惠，无生无灭，无苦无恼，去来平等，出入平等。 下根布施，即是平等； 中根诫行无戒，即是平等； 上根智慧，无智无我，即是平等。 众生受乐，乐受无受，即是平等。 众生业报，报业无业，即是平等。 一切诸法，等无所等，无所等故，名为大道。 勤学大乘，善行三慧：一者，巧积方便，善灭外尘； 二者，断诸行漏，不出他境； 三者，寻求实相，直至道场。 既证反本，二见常明，三业轮转，四大恒通，五荫开朗，六情不染，七识自存，八正无我，九德绵绵。 先贤后圣，莫不由此而得成道。 当知真藏，最为第一。 一切众生，身性清浄，天真正道，隐在其中，名为真藏。",
      "translated_text": "Why is this so? Because the Dharma has no form, the Dharma has no fixed nature, the Dharma is liberation itself. Know that the sincere heart is itself the Dao-field—free from clinging to all dharmas, one enters wondrous quiescence; free from clinging to birth and death, one enters the jeweled marks; free from clinging to grasping and rejecting, one enters all wisdom; free from clinging to anger and delusion, one enters all liberation; free from clinging to greed and desire, one enters all Dharma-treasures; free from clinging to right and wrong, one enters all true paths; free from clinging to sound and form, one enters all fields of merit; free from clinging to the six senses, one enters all that is untainted; free from clinging to the five aggregates, one enters great wisdom; free from clinging to the four elements, one enters all divine powers.\n\nThis Dharma is subtle and wondrous—even after kalpas of explanation, it cannot be exhausted. Yet if there be those of quick understanding, a mere half-word suffices to truly realize the Great Vehicle and comprehend the supreme Way. If one can believe with the heart, receive and uphold it, skillfully forget the spirit, and wash away the filth of the mind, the merit will be vast and boundless, beyond all conception.\n\nThe Heavenly Worthy said: Without departing from body and mind, one attains liberation. Those who attain liberation dwell in the quiescent Dao-field, enter the seal of the true Dharma, realize the causes of the three times, and accomplish the supreme fruit. All sentient beings—mind-nature is liberated, bodily form is liberated. The mind becomes verbal teaching, the body becomes written scripture. To follow the words and pursue the characters is to forget the traces of the teaching. Awakening to these words, one enters the gate of liberation and realizes the supreme Way.\n\nThe Youth of Auspicious Sound addressed the Heavenly Worthy: \"I do not yet understand—how is the mind of sentient beings verbal teaching, and the body written scripture? The mind of sentient beings is a deluded mind, the body is a net of darkness. How can sentient beings study this deluded mind and seek this net of darkness to attain the Way? The deluded mind of sentient beings does not know what to study to attain the Way, and those who do not study cannot attain the Way. If one studies the deluded mind, one still cannot attain the Way. Why is this? To study delusion with delusion, the nature of delusion does not arise—how can one attain the Way? The deluded mind of sentient beings, deluded, does not know what to study, and studying, cannot attain the Way. It is like fire within wood—fire does not arise by itself but must be kindled by another before it can be obtained. The deluded mind of sentient beings must rely on a guiding teacher to attain awakening and understanding. I pray you explain this.\"\n\nThe Heavenly Worthy said: \"All dharmas are pure, neither born nor extinguished. How then can there be sentient beings who attain the Way? How can there be sentient beings who lose the Way? How can there be sentient beings enmeshed in the net of delusion who study and attain the Way? How can there be a deluded mind that, without study, attains the Way? Dharmas have no inherent nature, ultimately no self. Why do you raise such distinctions among sentient beings? The scriptures I speak are apart from nature—this is not nature’s liberation. It is a skillful means to guide and enable recognition of the scriptures. Apart from nature—this is the liberation of Dharma-nature. It is a skillful means to guide and enable recognition of the true sound. Those who realize the Dharma-sound realize that there is no Dharma to realize, no Dharma to cultivate, no Dharma to study, no Dharma to attain, no Dharma to receive—ultimately pure, merged into oneness, not one.\n\nWhen the beings of the Two Vehicles hear these words, they are startled, alarmed, and terrified, with no place to stand. Then the assembly of the Dharma-sound suddenly awakens, comprehends the Great Vehicle’s teaching, and realizes equality without duality. Bowing in reverence, they forget their forms and depart.\n\nAll sentient beings cling to conditioned existence, delighting in life and fearing death. Though they seek life, they create the karma of death and do not uphold the precepts. Though they may live long, they are like old trees—what difference is there? Those who uphold the precepts, at death, ascend to the heavenly offices and become immortals, free and at ease. Though one may hold the position of emperor or the three highest ministers, if one upholds the precepts, at death one ascends as an immortal, free and joyful. Of all things under heaven, none are everlasting—only the Dao and virtue are neither born nor extinguished.\n\nAll sentient beings arise from the Dao and perish in the Dao; all karmic conditions are threaded through a single gate. It is like a mother giving birth to a child—though the child harbors ingratitude, abandons its mother, and commits sins in all directions, ensnared in nets, the mother’s thoughts of longing tear at her bowels, yet the child remains unaware, suffering pain and agony. Sentient beings, inverted and deluded, have lost their root—it is just like this.\n\nThe profound teaching of the Great Vehicle bestows virtue according to roots, though one may not be aware of it. Though unaware, one is delivered according to roots—all sentient beings receive its moisture, emerging from suffering into joy, never departing the true treasury. Sentient beings, deluded, conceive of existence through false thoughts and never awaken within the true treasury. Why is this? Because the true nature of Dharma-nature is real—within the true, one receives existence, and existence is a mass of suffering, which is suffering and affliction. I observe all things as great wisdom—neither born nor extinguished, without suffering or affliction, equal in coming and going, equal in entering and exiting.\n\nBestowing according to lower roots is equality; upholding precepts without precepts according to middle roots is equality; wisdom without wisdom or self according to higher roots is equality. Sentient beings receive joy—joy without reception is equality. The karmic retribution of sentient beings—retribution without karma is equality. All dharmas are equal without anything to equal—because there is nothing to equal, it is called the Great Way.\n\nDiligently study the Great Vehicle and skillfully practice the three wisdoms: first, skillfully accumulate expedient means to extinguish external dust; second, sever all karmic outflows and not emerge in others’ realms; third, seek the true mark until reaching the Dao-field. Having realized and returned to the root, the two views are ever luminous, the three karmas revolve, the four elements are ever pervading, the five aggregates open and clear, the six senses are unstained, the seventh consciousness abides of itself, the eightfold path is without self, and the nine virtues flow unceasingly. Former worthies and later sages all attained the Way by this means. Know that the true treasury is foremost.\n\nAll sentient beings—body and nature are pure, the celestial true Way is hidden within, called the true treasury.\"",
      "overlap_context": "ey entered the dark prison; in walking, they entered the dark prison; in standing, they entered the dark prison; in sitting, they entered the dark prison; in lying down, they entered the dark prison; in eating, they entered the dark prison; in resting, they entered the dark prison.\n\nAll good men and women, each must reflect deeply and never harbor disbelief. If one fails to comprehend, one may still cultivate a sincere heart, refrain from slander, and thereby accumulate vast and boundless merit.",
      "start_char": 248,
      "end_char": 1460,
      "start_sentence": 12,
      "end_sentence": 81,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.82428455352783,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\真藏经要诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "若有说《真藏经》者，此人功德不可思议，则见我身，成无上道。 若有信心，舍诸他念，即得道眼，照三世因，平等无碍。 或舍身毁碎，或投身饿虎，或火焚身命，或系业因果，舍施求福，如此功德甚薄，法力不成。 何以故？ 无慧力故，无通达故。 自证自求，自得自我，如是自缚，堕无明障，系业不除，业业相牵，云何解脱？ 此观第一，初从数心，心法不住，法不住故，则无定法。 无定法故，则见道慧，见道慧者，即是本身，不生不灭。 不识本身，如有入行路，拾得遗箧，开箧视镜，自见其形，谓是箧主，心地惶怖，稽首而谢，弃之而去。 众生迷惑，舍真取伪，弃本寻末，亦复如是。 天尊曰：一切众生，身无边相，名为经法，亦名法聚。 何以故？ 解惑立名，不同体解，名为众生，亦名生死，亦名苦聚，亦名颠倒，亦名外求。 何以故？ 众生不解，名之为惑。 以是缘由，不识自身，自身之中，有无量法，聚具三清境。 众生迷惑，遂使外求，不信正法，不求善友，名为众生。 将法迷没世间，从劫至劫，终无晓了。 若遇善知识，名为宿因，种其福德。 何以故？ 昔因今果，得遇天尊，显无上真藏秘密重玄，了达昔因，证今生果。 汝等若求，先当自求，秘密法见，广开真藏。 以此法藏，统收诸法，尽无边底。 慧力童子曰：虽闻圣说，不能解了。 不知何者为道？ 何者为法？",
      "translated_text": "Should one expound the *True Treasury Sutra*, the merit of such a person is inconceivable—they shall behold my true form and attain the supreme Dao. If one holds faith and relinquishes all distracting thoughts, they shall gain the Dao-eye, illuminating the causes of the three times with boundless equanimity.\n\nSome may cast away their bodies, shattering them to pieces; some may throw themselves to hungry tigers; some may burn their bodies and lives in fire; some may, bound by karmic cause and effect, relinquish and offer in pursuit of blessings. Yet such merits are meager, and the power of the Dharma remains unfulfilled. Why? Because they lack the power of wisdom and fail to penetrate the truth.\n\nSelf-realization is self-seeking; self-attainment is self-possession. Yet in this way, one binds oneself, falls into the obscuration of ignorance, and remains entangled in karma, karma begetting karma—how then can liberation be found?\n\nThis contemplation is foremost. First, one counts the mind, yet the mind does not abide in dharmas; because dharmas do not abide, there is no fixed dharma. Because there is no fixed dharma, the wisdom of seeing the Dao arises. One who sees the wisdom of the Dao is none other than one’s original self—unborn and undying.\n\nNot recognizing one’s original self is like a traveler who, upon finding an abandoned casket on the road, opens it to see a mirror. Beholding their own reflection, they mistake it for the casket’s owner, their mind seized with terror. Bowing in apology, they cast it aside and flee. Sentient beings, deluded, forsake the true and grasp the false, abandon the root and chase the branches—just so.\n\nThe Heavenly Worthy said: All sentient beings—bodies without limit—are called the Dharma of sutras, also named the assembly of dharmas. Why? Because names arise from the resolution of delusion. Yet if one does not comprehend the essence, they are called sentient beings, also named birth-and-death, also named the mass of suffering, also named inversion, also named external seeking. Why? Because sentient beings do not understand—this is called delusion. For this reason, they fail to recognize their own selves. Within their very selves lie boundless dharmas, fully possessing the Three Clarities’ realm.\n\nYet sentient beings, deluded, turn outward in search, distrusting the true Dharma and not seeking good spiritual friends—they are called sentient beings. Thus they sink the Dharma into the world, from kalpa to kalpa, never awakening. If they encounter a good spiritual friend, this is called a karmic affinity from past lives, planting the seeds of merit. Why? Because past causes yield present fruits, and through meeting the Heavenly Worthy, the supreme, secret, and profoundly mysterious true treasury is revealed. Understanding past causes, they realize the present fruit.\n\nYou who seek must first seek within, perceiving the secret Dharma and widely unfolding the true treasury. Through this treasury of Dharma, all dharmas are gathered and encompassed without limit.\n\nThe Wisdom-Power Youth said: Though I have heard the sagely teaching, I cannot comprehend it. What is the Dao? What is the Dharma?",
      "overlap_context": "wo views are ever luminous, the three karmas revolve, the four elements are ever pervading, the five aggregates open and clear, the six senses are unstained, the seventh consciousness abides of itself, the eightfold path is without self, and the nine virtues flow unceasingly. Former worthies and later sages all attained the Way by this means. Know that the true treasury is foremost.\n\nAll sentient beings—body and nature are pure, the celestial true Way is hidden within, called the true treasury.\"",
      "start_char": 1460,
      "end_char": 1984,
      "start_sentence": 82,
      "end_sentence": 107,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.26808738708496,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\真藏经要诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "何者为师？ 何者为聚？ 以不知故，愿为说之。 天尊答曰：汝所问者，问於自求真藏法见，汝今澄神静处，广为说之。 一切众生，身性清浄，天真正道，隐在其中，名为真藏。 天尊又曰：不信根中而有三宝，不信众生等天尊性，不信诸法寂灭无相，不信众生从无量劫来，种种示形，而无生灭。 如是不信，名为谤法，是名毁法，是名灭法。 既名灭法，生死轮转，必堕地狱，无缘得出。 慎勿外求，不怀身相，遍满诸国； 不怀身相，不生不灭； 非离众生而出相好，非离众生而满虚空，非离众生有真藏宝。 诸善男子，勿生不信。 金口所说，更无差谬。 善音童子稽首再拜，信受奉行。 真藏经要诀竟",
      "translated_text": "What is a teacher? What is an assembly? Since you do not know, I shall explain for you.\n\nThe Heavenly Worthy replied: What you ask pertains to seeking the true treasury and perceiving the secret Dharma. Now still your spirit and abide in quietude, and I shall expound it widely.\n\nAll sentient beings possess a nature of purity within their bodies—the true and correct Dao of Heavenly Truth lies concealed therein, called the true treasury.\n\nThe Heavenly Worthy further said: To disbelieve that the Three Treasures reside within the root, to disbelieve that sentient beings share the same nature as the Heavenly Worthy, to disbelieve that all dharmas are quiescent and without form, to disbelieve that sentient beings, since time immemorial, have manifested in myriad forms yet remain unborn and undying—such disbelief is called slandering the Dharma, destroying the Dharma, annihilating the Dharma. Having annihilated the Dharma, one revolves in the cycle of birth and death and must inevitably fall into hell, with no chance of escape.\n\nBeware of seeking externally. Without clinging to the form of the body, one pervades all realms; without clinging to the form of the body, one is neither born nor destroyed. The marks of excellence do not arise apart from sentient beings, nor does one fill the void apart from sentient beings, nor does the true treasury exist apart from sentient beings.\n\nAll good men, do not give rise to disbelief. What issues from the Golden Mouth is without the slightest error.\n\nThe Youth of Auspicious Sound bowed his head, prostrated himself again, and received the teaching with faith, vowing to put it into practice.\n\nHere ends the Essential Instructions on the *True Treasury Sutra*.",
      "overlap_context": "nd through meeting the Heavenly Worthy, the supreme, secret, and profoundly mysterious true treasury is revealed. Understanding past causes, they realize the present fruit.\n\nYou who seek must first seek within, perceiving the secret Dharma and widely unfolding the true treasury. Through this treasury of Dharma, all dharmas are gathered and encompassed without limit.\n\nThe Wisdom-Power Youth said: Though I have heard the sagely teaching, I cannot comprehend it. What is the Dao? What is the Dharma?",
      "start_char": 1984,
      "end_char": 2254,
      "start_sentence": 108,
      "end_sentence": 122,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.261829137802124,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\真藏经要诀.txt",
        "category": "玉诀类"
      }
    }
  ]
}