{
  "source_id": "破迷正道歌",
  "source_file": "chunked_daozang\\破迷正道歌.json",
  "total_chunks": 3,
  "total_original_chars": 2160,
  "total_translated_chars": 12488,
  "total_translation_time": 71.609130859375,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\方法类\\破迷正道歌.txt",
    "category": "方法类"
  },
  "full_translation": "**Breaking Delusion and Rectifying the Dao: A Song**\n\n*Scripture Title:* *Breaking Delusion and Rectifying the Dao: A Song*\nOne scroll, originally attributed to the Perfected One of True Yang, Zhongli Quan. Likely composed between the late Tang and Five Dynasties periods.\n*Source Text:* *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, Methods Category.\n\n**Breaking Delusion and Rectifying the Dao: A Song**\n\nWere it not for celestial matters sealed by talismans,\nI would reveal the Heavenly Mechanism’s secret to you.\nA few words, half a phrase—no excess characters,\nYet a single utterance unites ten thousand scrolls of immortal scriptures.\nOne secret alone reveals affairs beyond the heavens,\nSweeping away all heterodox paths without a trace.\nShould you call this principle the Dao of immortals,\nHeaven and earth are void, above and below are empty.\nThe revelation shatters the barrier between wood and metal,\nFor true lead and true mercury possess no form.\nWho comprehends this celestial mechanism’s principle?\nOnce grasped, the sun and moon ascend in lofty flight.\nNo Kan and Li, no dragon and tiger,\nNo crow and hare, each to west and east.\nNeither liver nor lung, neither heart nor kidney,\nUnrelated to spleen, stomach, gall, or essence.\nNo thought, no contemplation, no action,\nBeyond the three fields—upper, lower, and middle.\nHow could it concern the spine’s path to Kunlun?\nIt is not essence, saliva, dark blood, or fluid.\nNot the spirits of the bladder or the five viscera,\nYet this thing emerges within the human body.\nThrough the four seasons—spring, summer, autumn, winter—\nWho recognizes the precelestial and pre-earthly?\nTwo substances harmonize, weighing one catty,\nWaxing and waning, new and full moons align with their original number.\nCircling day and night without cease,\nTimely harvesting discerns their age.\nIn a fleeting moment, between *jia* and *geng*,\nIt arises in the southwest, at its native position.\nGently harmonize and enter the *Gen* Palace,\nTest the Heavenly Mechanism with a light touch.\nTrue *qi* gathers in the great void at all times,\nForcing heaven and earth to serve as the crucible.\nInverting the cosmos at will, traversing freely,\nThe southern star shifts to the northern star’s place.\nThe golden crow flies into the jade toad’s palace,\nThe sun’s surface conceals the jade hare.\nThe great yin waxes and wanes, naturally harmonizing.\nAfter the first quarter, seek the medicine;\nBefore the last quarter, refine the *qi* evenly.\nBetween the two quarters lies the moment of harvest.\nFirst and last, preserve the ancestor and lineage—\nIt is the host of the hour, while I am the guest.\nWhen I rise, you sink;\nAdjust until rising and sinking unite in one place.\nBathing and concealment are all emptiness.\n*Li* and *Kan* originally have no south or north.\n*Zhen* and *Dui*—how could they be fixed in west or east?\nIf you encounter an immortal who imparts the secret,\nSeize the Northern Dipper’s wheel of the celestial cycle,\nGather yin and yang into your palm.\nIn an instant, the myriad things are born.\nThese are the secrets of golden liquid and returned elixir—\nWithout an immortal teacher, do not forcefully pursue them.\nIf you truly harvest the precelestial *qi*,\nThe sun and moon are captured in your hands,\nDay and night clashing, merging into one.\nNaturally, the dragon’s roar and tiger’s laughter resound.\nAt first, wind howls above and below,\nGradually congealing, purple clouds arise,\nFilling the mountains, veiling the sun and moon.\nAt this moment, a haze descends like twilight.\nSilently, the clouds and mist stir,\nAnd within stillness, thunderclaps are heard.\nPurple phoenix and dark crow, hare and toad intertwine,\nGolden crow and jade hare contend of their own accord,\nTiger coils and dragon entwines, seeking the supreme treasure.\n\nThe Golden Lord and the Jade Maiden wed in marriage,\nThis union of mother and child within.\nThe sacred *qi* returns to its root, merging with true essence,\nA single spark—the primal seed of origin.\nEntering the cinnabar field, eternal spring arises,\nThe precelestial and pre-earth converge as one.\nBefore the chaos divided, how could there be trace?\nGeneration unfolds, naturally aligned with sacred principle.\nVerdant shoots and crimson blossoms renew as one hue,\nAbove and below, water and fire irrigate themselves.\nThe two *qi* intertwine, birthing the fetal infant,\nNaturally, the white sun gives rise to divine form.\nBeyond the mortal, transcending life and death,\nIndeed, a hundred days guard against peril.\nBlood transforms to cream, the body like silver,\nTruly, a hundred days without loss.\nJade cream flows, suffusing radiant light,\nTrue *qi* steams, banishing cold and heat.\nOne may become the supreme Daoist adept,\nBlazing refinement through three hundred days.\nSudden storms and howling winds fill the vast sky,\nLightning flashes, countless and dazzling.\nThunder shakes the celestial gate, startling gods and ghosts,\nThe cosmos upends, white snow flying.\nInverting heaven and earth, an endless spring,\nExchanging bones, returning yang—body undying.\nNine returns, seven reversals refine true form,\nTen months of toil, all in all.\nWithin and without, emptiness and clarity,\nGathered, it takes shape; scattered, it is *qi*.\nReturning to the origin, merging with the great void,\nTransforming and journeying—none can fathom.\nAncestors transmit this from ancient times to now,\nA single principle aligning with heaven and earth.\nThe immortals’ oral secrets are not false,\nIf preserved for one or two more years,\nThrough a hundred thousand myriad kalpas without end,\nMastering the method of golden liquid and shaped elixir.\nRiding phoenixes and cranes, soaring freely,\nExiting existence, entering non-existence without hindrance.\nRoaming the three isles of Penglai at will,\nEven after ten thousand years and a hundred thousand kalpas,\nSeas turn to mulberry fields, yet the visage remains unchanged.\nAlas for the countless aspiring immortals—\nAll follow paths unlike the celestial Dao,\nDeluded by the drool of wild foxes,\nHow can one heed demonic words and bewitching speech?\nWandering the four seas to seek mysteries,\nAll are but heterodox arts and minor practices,\nThe foolish and obstinate, difficult to enlighten,\nEver the blind leading the blind.\nLike consuming pine needles and swallowing elixirs,\nHow can one escape the root of life and death?\nLike forgetting form to cultivate breath-holding,\nHow can the hundred meridians all return to their source?\nLike focusing breath to visualize the cinnabar field,\nYet failing to complete the fetal immortal’s training.\nLike deeming breath as the precelestial,\nAging without achievement, all in vain.\nLike taking mouth and nose as the mysterious female,\nLike casting a net to catch the wind.\nLike fixing the mind as the square inch,\nHow can one return to the origin and meet the ancestral master?\nSome accumulate essence as lead and mercury,\nYet this differs from the golden elixir’s work.\nSome grasp *qi* and spirit as mother and child,\nStill a myriad miles from the celestial immortal’s path.\nSome open the crown for refinement,\nWasting effort, wearily straining the spirit.\nSome retract the turtle and refine the breasts,\nThese are but heterodox arts and minor practices.\nSome circulate *qi* as the fire-timing,\nNine years, three years—waiting for enlightenment.\nClosing the nose to absorb primordial *qi*,\nDrawing in perverse winds that rumble in the belly.\nEven if one recognizes the mind and sees nature,\nIn the end, one becomes but a yin spirit.\nWho knows how many idle gates there are?\nFutile labor, moving the skeleton’s form.\nHalting thoughts, calming the mind for purity,\nYet the outcome remains but stubborn emptiness.\nDay and night, practicing the midnight-noon method,\nDoes heaven and earth have inauspicious hours?\nSolitary cultivation, breath-holding, and visualization,\nFixing the tongue as the crimson dragon.\nSome circulate *qi* through the trigrams,\nSome plant the crown to create the yellow court,\nSome point to the kidneys as creation’s source,\nFixing the tailbone as the life root.\nSome return to the origin by ingesting water and fire,\nSome practice absorption, drawing in lewd essence,\nSome face the sky to inhale sun and moon,\nClaiming earthly *po* as heavenly *hun*.\nSome sip saliva as creation’s work,\nAbandoning the five flavors as true cultivation.\nDay and night, one meal for daily use,\nThe body emaciated, ghostly in form.\nCurving the body, lying prostrate, knocking the jade door,\nEmbracing the origin, guarding the one, moving both eyes,\nHunching shoulders, retracting the neck, contemplating the spine,\nCirculating the flowing pearl, visualizing the great yin.\nSome inscribe talismans and chant incantations,\nBreaking contracts, parting rings to learn invisibility,\nMassaging and exhaling the six-word formula,\nGazing at stars, worshipping the Dipper with toil.\nExpelling the turbid, inhaling the pure as the elixir’s root,\nTightly restraining the yang pass, fire soaring,\nBlazing heat suffusing the body,\nCalling this the root of the celestial true Dao.\nReading, reciting, praising, upholding rituals and registers,\nSetting up altars, performing rites, hoping for ascension.\nThree thousand six hundred heterodox methods—\nNone recognize the form that moves day and night.\nIf by fate one encounters a luminous teacher’s guidance,\nIn an instant, creation arises,\nA single *qi* circulating without obstruction.\nScattered in the myriad things and the human body,\nThe enlightened one gathers the precelestial *qi*.\nOne night, thunder ceaselessly roars,\nLightning flashes, countless and dazzling.\nThe two *qi* intertwine—how could there be form?\nShattering the celestial gate, beyond compare.\nThunder, lightning, wind, and rain arise together,\nInverting and reversing, exchanging positions.\nBoundless fiery *qi* rages tumultuously,\nTigers coil around the medicine furnace, contending for creation,\nDragons entwine the golden tripod, seeking to soar.\nThe four images and five phases return to *wu-ji*,\nRefining the golden liquid into primordial crystal.\nTen thousand purple clouds shroud the northern sea,\nA thousand meridians surge against Kunlun.\nTrue *qi* gleams, outshining the stars,\nCrimson light blazes, dimming the sun.\nIncrease and decrease naturally distinguish advance and retreat,\nThe waxing and waning crescents determine the true.\nThe elixir’s head—old or tender—must also be discerned,\nWithdrawing and adding, applied in an instant.\nThe fire-timing for gestation has its moments,\nTrue fire blazes, scorching the cosmos,\nHeaven and earth above and below glow crimson.\nOne water, one fire divide the hexagrams,\nOne ascent, one descent, floating and sinking.\nOne coming, one going distinguish host and guest,\nOne before, one after, lord and minister.\nOne yin, one yang form heaven and earth,\nOne firm, one yielding, naturally balanced.\nWinter and summer solstices mark the seasons,\nSpring and autumn equinoxes determine cold and warmth.\nComing and going, rising and falling—no form,\nCirculating day and night, following the hours.\n\nWithout the earth-ancestor’s transmitted secret,\nHow could one know the Dao’s momentary work?\nDriving back the Dipper’s handle governs the Mysterious Pass,\nTurning the Celestial Pivot unites the ten thousand images.\nIn a fleeting instant, dragon and tiger wage ceaseless battle,\nThe two substances unite in a single breath.\nSeizing the gibbons, all is chaos and confusion,\nVague and indistinct, not yet clarified.\nHere lies the method of wood and metal’s union,\nTrue lead, true mercury—crystalline as heaven and earth.\nThis alone is the fire-timing’s golden elixir secret,\nWholly dependent on their conjoining within the Yellow Court.\nThe Primal One’s single breath—an elixir of a thousand years,\nEternally enduring through ten thousand kalpas, an endless spring.\nWithin three thousand moments appears the infant-brother image,\nA hundred days’ work refines the numinous transformation.\nAfter ten months, the pure yang body is forged,\nNaturally immune to cold and heat’s intrusion.\nAuspicious qi and colored clouds veil the fivefold form,\nPhoenixes and cranes dance in welcome before one’s face.\nJade maidens, in pairs, bear the purple decree,\nProclaiming the name and title of the perfected one.\nGolden light envelops the body, unseen by mortal eyes,\nWith regulated dignity and majesty, one moves to left and right.\nCranes escort the ascent toward the origin,\nIn broad daylight, one soars to the celestial capital.\n*The Song of the True Dao to Dispel Delusion* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "破迷正道歌 经名：破迷正道歌。 一卷，原题正阳真人锺离权迷，当出於唐后期至五代时期。 底本出处：《正统道藏》洞真部方法类。 破迷正道歌 若非符契天绿事，故把天机诀与君。 片言半句无多字，万卷仙经一语通。 一诀便知天外事，扫尽旁门不见踪。 若言此理神仙道，天地虚无上下空。 说破木金无间隔，真铅真汞岂有形。 谁知这个天机理，便会日月得高奔。 也无坎离并龙虎，也无乌兔各西束。 非肝非肺非心肾，不干脾胃胆和精。 非思非想非为作，不在三田上下中。 岂干夹脊至昆仑，不是精津黑血液。 不是膀胱五脏神，此物在人身中出。 四时春夏及秋冬，先天先地谁人识。 二物相和重一斤，弦望晦朔合本数。 循环昼夜不曾空，依时采取知老嫩。 片饷之间并甲庚，只在西南产本位。 慢慢调和入艮宫，试把天机轻拨动。 真时时聚太空，谋得乾坤为鼎器。 颠倒宇宙任纵横，南辰移入北辰位。 金乌飞入玉蟾宫，太阳裹面藏玉兔。 太阴加减自和同，前弦之后寻药物。 后弦之前停匀，两弦之间为采取。 先后存定祖和宗，他是主时宾是我。 我若浮时你却沉，调得浮沉归一处。 沐浴潜藏总是空。 离坎本来无南北。 震兑岂则在西束。 若遇神仙亲指诀。 捉住北斗周天轮，撮得阴阳归掌内。 顷刻之问万物生。 这些金液还丹诀。 不遇仙师莫强攻。 果然采得先天。 日月擒来两手中，昼夜打交成一块。 自有龙吟虎笑声。 初时上下风声吼。 渐凝渐结紫云生，云满山中遮日月。 此时一阵似朦胧。 默默自然云雾动。 定裹时闻霹雳声，紫凤乌兔交一处。 金乌玉兔自相争，虎绕龙蟠寻至宝。",
      "translated_text": "**Breaking Delusion and Rectifying the Dao: A Song**\n\n*Scripture Title:* *Breaking Delusion and Rectifying the Dao: A Song*\nOne scroll, originally attributed to the Perfected One of True Yang, Zhongli Quan. Likely composed between the late Tang and Five Dynasties periods.\n*Source Text:* *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, Methods Category.\n\n**Breaking Delusion and Rectifying the Dao: A Song**\n\nWere it not for celestial matters sealed by talismans,\nI would reveal the Heavenly Mechanism’s secret to you.\nA few words, half a phrase—no excess characters,\nYet a single utterance unites ten thousand scrolls of immortal scriptures.\nOne secret alone reveals affairs beyond the heavens,\nSweeping away all heterodox paths without a trace.\nShould you call this principle the Dao of immortals,\nHeaven and earth are void, above and below are empty.\nThe revelation shatters the barrier between wood and metal,\nFor true lead and true mercury possess no form.\nWho comprehends this celestial mechanism’s principle?\nOnce grasped, the sun and moon ascend in lofty flight.\nNo Kan and Li, no dragon and tiger,\nNo crow and hare, each to west and east.\nNeither liver nor lung, neither heart nor kidney,\nUnrelated to spleen, stomach, gall, or essence.\nNo thought, no contemplation, no action,\nBeyond the three fields—upper, lower, and middle.\nHow could it concern the spine’s path to Kunlun?\nIt is not essence, saliva, dark blood, or fluid.\nNot the spirits of the bladder or the five viscera,\nYet this thing emerges within the human body.\nThrough the four seasons—spring, summer, autumn, winter—\nWho recognizes the precelestial and pre-earthly?\nTwo substances harmonize, weighing one catty,\nWaxing and waning, new and full moons align with their original number.\nCircling day and night without cease,\nTimely harvesting discerns their age.\nIn a fleeting moment, between *jia* and *geng*,\nIt arises in the southwest, at its native position.\nGently harmonize and enter the *Gen* Palace,\nTest the Heavenly Mechanism with a light touch.\nTrue *qi* gathers in the great void at all times,\nForcing heaven and earth to serve as the crucible.\nInverting the cosmos at will, traversing freely,\nThe southern star shifts to the northern star’s place.\nThe golden crow flies into the jade toad’s palace,\nThe sun’s surface conceals the jade hare.\nThe great yin waxes and wanes, naturally harmonizing.\nAfter the first quarter, seek the medicine;\nBefore the last quarter, refine the *qi* evenly.\nBetween the two quarters lies the moment of harvest.\nFirst and last, preserve the ancestor and lineage—\nIt is the host of the hour, while I am the guest.\nWhen I rise, you sink;\nAdjust until rising and sinking unite in one place.\nBathing and concealment are all emptiness.\n*Li* and *Kan* originally have no south or north.\n*Zhen* and *Dui*—how could they be fixed in west or east?\nIf you encounter an immortal who imparts the secret,\nSeize the Northern Dipper’s wheel of the celestial cycle,\nGather yin and yang into your palm.\nIn an instant, the myriad things are born.\nThese are the secrets of golden liquid and returned elixir—\nWithout an immortal teacher, do not forcefully pursue them.\nIf you truly harvest the precelestial *qi*,\nThe sun and moon are captured in your hands,\nDay and night clashing, merging into one.\nNaturally, the dragon’s roar and tiger’s laughter resound.\nAt first, wind howls above and below,\nGradually congealing, purple clouds arise,\nFilling the mountains, veiling the sun and moon.\nAt this moment, a haze descends like twilight.\nSilently, the clouds and mist stir,\nAnd within stillness, thunderclaps are heard.\nPurple phoenix and dark crow, hare and toad intertwine,\nGolden crow and jade hare contend of their own accord,\nTiger coils and dragon entwines, seeking the supreme treasure.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 664,
      "start_sentence": 0,
      "end_sentence": 44,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.80150318145752,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\破迷正道歌.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "金公女结婚姻，这番子母里相会。 神归根合本真，一点最初真种子。 入得丹田万古春，先天先地归一处。 混沌未分岂有痕，生发自然合圣理。 绿来红花一色新，上下水火自浇灌。 二交结产胎婴，自然白日生神象。 自有超凡出死生，果然百日防危险。 血化为膏体似银，果然百日无亏失。 玉膏流润生光明，真熏蒸无寒暑。 可为无上道高人，炎炎锻炼三百日。 骤雨颠风满太空，电光晃耀无穷数。 雷震天关鬼神惊，掀翻宇宙飞白雪。 倒捉乾坤不夜春，换骨回阳身不朽。 九还七返化真形，辛苦都来十个月。 内外虚明表里真，聚则成形散则。 返本还元太虚同，变化往来人莫测。 祖祖相传古到今，一理便合天地理。 神仙口诀不为虚，更若保守一二载。 百千万亿劫无穷，会得金液种形法。 乘鸾跨鹤自飞腾，出有入无无阻碍。 蓬莱三岛任纵横，若更万年百千劫。 海变桑田貌亦同，堪嗟无限学仙者。 总是天仙道不同，俱被野狐涎昧定。 鬼言妖语怎生听。 云游四海参玄妙。 尽是邪门小法功，愚迷执强难教化。 依然一盲引众盲。 有如餐松并服饵。 如何脱免死生根，有如忘形习定息。 如何百脉尽归宗，有如呼吸想丹田。 到底胎仙学未成，有如息气为先天。 至老无成也是空，有如口鼻为玄牝。 恰似满网去包风，有如思心为方寸。 怎得归元见祖宗，更有积精为铅汞。 转与金丹事不同，有执气神为子母。 亦隔天仙万里程，有如开顶为炼养。 枉施功力馒劳神，更有缩龟并炼乳。 正是邪门小法功，更有行为火候。 九载三年侯了人，鼻头闭息服元。 引得邪风肚裹呜，假若识心并见性。 到头终久做阴灵，知他多少闲门户。 劳漉空动骷髅形，止念降心为清净。 下梢终久是顽空，昼夜专行子午法。 天地岂有恶时辰，孤修闭息行存想。 执定舌根做赤龙，更有周天行卦象。 更有种顶作黄庭，更有指肾为造化。 执定尾闾为命根，更有还元服水火。 更有采补吸淫精，更有仰天吸日月。 便道地魄是天魂，更有咂津为造化。 断除五味是修真，昼夜一餐为日用。 身体尪赢似鬼形，曲身偃仰叩玉户。 抱元守一运双睛，竦肩缩项思脊骨。 搬运流珠想太阴，更有书符并念咒。 破券分环学隐形，按摩吁呵六字诀。 瞻星礼斗受辛勤，入清吐浊为丹本。 阳关紧勒火飞腾，炎炎遍身通透热。 呼作天真大道根，看读念赞持科箓。 设坛拜醮望飞腾。 三千六百傍门法。 不识随形昼夜人。 有缘遭遇明师指。 顷刻之问造化生，一循环无阻碍。 散在万物与人身。 达人采得先天。 一夜雷声不暂停，电光焖焖无穷数。 二相交岂有形。 摧塌天关无可比。 雷电风雨一齐生，颠倒颠时交换位。 无量火乱峥嵘，虎绕药炉争造化。 龙蟠金鼎要飞腾，四象五行归戊己。 烹炼金液混元晶，万朵紫云笼北海。 千条百脉撞昆仑，真辉辉星斗暗。 红光赫赫太阳昏，加减自然分进退。 前弦后弦定其真。 丹头老嫩须亦认。 抽添运用片时中。 结胎火候有时刻。 真火炎炎烧宇宙，乾坤上下尽通红。 一水一火分爻象，一升一降自浮沉。 一来一去分宾主，一前一后有君臣。 一阴一阳为天地，一刚一柔自均匀。 冬夏二至为节候，春秋二分定寒温。 往来上下无形象，循环昼夜有时辰。",
      "translated_text": "The Golden Lord and the Jade Maiden wed in marriage,\nThis union of mother and child within.\nThe sacred *qi* returns to its root, merging with true essence,\nA single spark—the primal seed of origin.\nEntering the cinnabar field, eternal spring arises,\nThe precelestial and pre-earth converge as one.\nBefore the chaos divided, how could there be trace?\nGeneration unfolds, naturally aligned with sacred principle.\nVerdant shoots and crimson blossoms renew as one hue,\nAbove and below, water and fire irrigate themselves.\nThe two *qi* intertwine, birthing the fetal infant,\nNaturally, the white sun gives rise to divine form.\nBeyond the mortal, transcending life and death,\nIndeed, a hundred days guard against peril.\nBlood transforms to cream, the body like silver,\nTruly, a hundred days without loss.\nJade cream flows, suffusing radiant light,\nTrue *qi* steams, banishing cold and heat.\nOne may become the supreme Daoist adept,\nBlazing refinement through three hundred days.\nSudden storms and howling winds fill the vast sky,\nLightning flashes, countless and dazzling.\nThunder shakes the celestial gate, startling gods and ghosts,\nThe cosmos upends, white snow flying.\nInverting heaven and earth, an endless spring,\nExchanging bones, returning yang—body undying.\nNine returns, seven reversals refine true form,\nTen months of toil, all in all.\nWithin and without, emptiness and clarity,\nGathered, it takes shape; scattered, it is *qi*.\nReturning to the origin, merging with the great void,\nTransforming and journeying—none can fathom.\nAncestors transmit this from ancient times to now,\nA single principle aligning with heaven and earth.\nThe immortals’ oral secrets are not false,\nIf preserved for one or two more years,\nThrough a hundred thousand myriad kalpas without end,\nMastering the method of golden liquid and shaped elixir.\nRiding phoenixes and cranes, soaring freely,\nExiting existence, entering non-existence without hindrance.\nRoaming the three isles of Penglai at will,\nEven after ten thousand years and a hundred thousand kalpas,\nSeas turn to mulberry fields, yet the visage remains unchanged.\nAlas for the countless aspiring immortals—\nAll follow paths unlike the celestial Dao,\nDeluded by the drool of wild foxes,\nHow can one heed demonic words and bewitching speech?\nWandering the four seas to seek mysteries,\nAll are but heterodox arts and minor practices,\nThe foolish and obstinate, difficult to enlighten,\nEver the blind leading the blind.\nLike consuming pine needles and swallowing elixirs,\nHow can one escape the root of life and death?\nLike forgetting form to cultivate breath-holding,\nHow can the hundred meridians all return to their source?\nLike focusing breath to visualize the cinnabar field,\nYet failing to complete the fetal immortal’s training.\nLike deeming breath as the precelestial,\nAging without achievement, all in vain.\nLike taking mouth and nose as the mysterious female,\nLike casting a net to catch the wind.\nLike fixing the mind as the square inch,\nHow can one return to the origin and meet the ancestral master?\nSome accumulate essence as lead and mercury,\nYet this differs from the golden elixir’s work.\nSome grasp *qi* and spirit as mother and child,\nStill a myriad miles from the celestial immortal’s path.\nSome open the crown for refinement,\nWasting effort, wearily straining the spirit.\nSome retract the turtle and refine the breasts,\nThese are but heterodox arts and minor practices.\nSome circulate *qi* as the fire-timing,\nNine years, three years—waiting for enlightenment.\nClosing the nose to absorb primordial *qi*,\nDrawing in perverse winds that rumble in the belly.\nEven if one recognizes the mind and sees nature,\nIn the end, one becomes but a yin spirit.\nWho knows how many idle gates there are?\nFutile labor, moving the skeleton’s form.\nHalting thoughts, calming the mind for purity,\nYet the outcome remains but stubborn emptiness.\nDay and night, practicing the midnight-noon method,\nDoes heaven and earth have inauspicious hours?\nSolitary cultivation, breath-holding, and visualization,\nFixing the tongue as the crimson dragon.\nSome circulate *qi* through the trigrams,\nSome plant the crown to create the yellow court,\nSome point to the kidneys as creation’s source,\nFixing the tailbone as the life root.\nSome return to the origin by ingesting water and fire,\nSome practice absorption, drawing in lewd essence,\nSome face the sky to inhale sun and moon,\nClaiming earthly *po* as heavenly *hun*.\nSome sip saliva as creation’s work,\nAbandoning the five flavors as true cultivation.\nDay and night, one meal for daily use,\nThe body emaciated, ghostly in form.\nCurving the body, lying prostrate, knocking the jade door,\nEmbracing the origin, guarding the one, moving both eyes,\nHunching shoulders, retracting the neck, contemplating the spine,\nCirculating the flowing pearl, visualizing the great yin.\nSome inscribe talismans and chant incantations,\nBreaking contracts, parting rings to learn invisibility,\nMassaging and exhaling the six-word formula,\nGazing at stars, worshipping the Dipper with toil.\nExpelling the turbid, inhaling the pure as the elixir’s root,\nTightly restraining the yang pass, fire soaring,\nBlazing heat suffusing the body,\nCalling this the root of the celestial true Dao.\nReading, reciting, praising, upholding rituals and registers,\nSetting up altars, performing rites, hoping for ascension.\nThree thousand six hundred heterodox methods—\nNone recognize the form that moves day and night.\nIf by fate one encounters a luminous teacher’s guidance,\nIn an instant, creation arises,\nA single *qi* circulating without obstruction.\nScattered in the myriad things and the human body,\nThe enlightened one gathers the precelestial *qi*.\nOne night, thunder ceaselessly roars,\nLightning flashes, countless and dazzling.\nThe two *qi* intertwine—how could there be form?\nShattering the celestial gate, beyond compare.\nThunder, lightning, wind, and rain arise together,\nInverting and reversing, exchanging positions.\nBoundless fiery *qi* rages tumultuously,\nTigers coil around the medicine furnace, contending for creation,\nDragons entwine the golden tripod, seeking to soar.\nThe four images and five phases return to *wu-ji*,\nRefining the golden liquid into primordial crystal.\nTen thousand purple clouds shroud the northern sea,\nA thousand meridians surge against Kunlun.\nTrue *qi* gleams, outshining the stars,\nCrimson light blazes, dimming the sun.\nIncrease and decrease naturally distinguish advance and retreat,\nThe waxing and waning crescents determine the true.\nThe elixir’s head—old or tender—must also be discerned,\nWithdrawing and adding, applied in an instant.\nThe fire-timing for gestation has its moments,\nTrue fire blazes, scorching the cosmos,\nHeaven and earth above and below glow crimson.\nOne water, one fire divide the hexagrams,\nOne ascent, one descent, floating and sinking.\nOne coming, one going distinguish host and guest,\nOne before, one after, lord and minister.\nOne yin, one yang form heaven and earth,\nOne firm, one yielding, naturally balanced.\nWinter and summer solstices mark the seasons,\nSpring and autumn equinoxes determine cold and warmth.\nComing and going, rising and falling—no form,\nCirculating day and night, following the hours.",
      "overlap_context": "nto one.\nNaturally, the dragon’s roar and tiger’s laughter resound.\nAt first, wind howls above and below,\nGradually congealing, purple clouds arise,\nFilling the mountains, veiling the sun and moon.\nAt this moment, a haze descends like twilight.\nSilently, the clouds and mist stir,\nAnd within stillness, thunderclaps are heard.\nPurple phoenix and dark crow, hare and toad intertwine,\nGolden crow and jade hare contend of their own accord,\nTiger coils and dragon entwines, seeking the supreme treasure.",
      "start_char": 665,
      "end_char": 1978,
      "start_sentence": 45,
      "end_sentence": 127,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.11201190948486,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\破迷正道歌.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "若非土祖相传诀，岂知大道片时功。 驱回斗柄玄关理，斡转天关万象通。 片饷龙虎频频斗，二物交合顷刻中。 擒得猩猩俱鹊突，混混沌沌未分明。 此时木金交并法，真铅真汞天地晶。 只此火候金丹诀，全凭交结在黄庭。 混元一千年药，万劫常存不夜春。 三千刻内婴兄象，百日功夫造化灵。 十月炼成纯阳体，自然寒暑不来侵。 瑞气彩云遮五体，鸾鹤对舞面前迎。 玉女双双持紫诏，名曰方号唤真人。 金光罩体人难视，节制仪威左右行。 仙鹤接引朝元去，白日飞升谒上京。 破迷正道歌竟",
      "translated_text": "Without the earth-ancestor’s transmitted secret,\nHow could one know the Dao’s momentary work?\nDriving back the Dipper’s handle governs the Mysterious Pass,\nTurning the Celestial Pivot unites the ten thousand images.\nIn a fleeting instant, dragon and tiger wage ceaseless battle,\nThe two substances unite in a single breath.\nSeizing the gibbons, all is chaos and confusion,\nVague and indistinct, not yet clarified.\nHere lies the method of wood and metal’s union,\nTrue lead, true mercury—crystalline as heaven and earth.\nThis alone is the fire-timing’s golden elixir secret,\nWholly dependent on their conjoining within the Yellow Court.\nThe Primal One’s single breath—an elixir of a thousand years,\nEternally enduring through ten thousand kalpas, an endless spring.\nWithin three thousand moments appears the infant-brother image,\nA hundred days’ work refines the numinous transformation.\nAfter ten months, the pure yang body is forged,\nNaturally immune to cold and heat’s intrusion.\nAuspicious qi and colored clouds veil the fivefold form,\nPhoenixes and cranes dance in welcome before one’s face.\nJade maidens, in pairs, bear the purple decree,\nProclaiming the name and title of the perfected one.\nGolden light envelops the body, unseen by mortal eyes,\nWith regulated dignity and majesty, one moves to left and right.\nCranes escort the ascent toward the origin,\nIn broad daylight, one soars to the celestial capital.\n*The Song of the True Dao to Dispel Delusion* concludes.",
      "overlap_context": "and earth above and below glow crimson.\nOne water, one fire divide the hexagrams,\nOne ascent, one descent, floating and sinking.\nOne coming, one going distinguish host and guest,\nOne before, one after, lord and minister.\nOne yin, one yang form heaven and earth,\nOne firm, one yielding, naturally balanced.\nWinter and summer solstices mark the seasons,\nSpring and autumn equinoxes determine cold and warmth.\nComing and going, rising and falling—no form,\nCirculating day and night, following the hours.",
      "start_char": 1978,
      "end_char": 2214,
      "start_sentence": 128,
      "end_sentence": 141,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.695615768432617,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\破迷正道歌.txt",
        "category": "方法类"
      }
    }
  ]
}