{
  "source_id": "碧虚子亲传直指",
  "source_file": "chunked_daozang\\碧虚子亲传直指.json",
  "total_chunks": 4,
  "total_original_chars": 4119,
  "total_translated_chars": 22597,
  "total_translation_time": 115.24919080734253,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\方法类\\碧虚子亲传直指.txt",
    "category": "方法类"
  },
  "full_translation": "**The Direct Pointers Personally Transmitted by Master Bixu**\n\n*Title:* *The Direct Pointers Personally Transmitted by Master Bixu*. Originating in the Southern Song dynasty, this work comprises one scroll. The base text is derived from the *Zhengtong Daoist Canon*, under the \"Methods\" category of the *Dongzhen* section.\n\n**The Direct Pointers Personally Transmitted by Master Bixu**\n\nFrom my youth, I studied the Dao. In early manhood, I left home, wandering rivers and lakes to seek the essence of virtue and the Dao. I recited and deeply pondered the alchemical classics, verses, and records of past masters since Ancestor Zhang Ziyang, exploring their words for meaning. I also sought out those who had attained the Dao, exhaustively investigating its essentials. Later, I traveled through famous mountains and great rivers, sacred grottoes and blessed lands, praying before stone inscriptions and steles. In my later years, I met Master Haiqiong, who imparted the essentials of the Great Dao. I also encountered the Recluse Anran at the Red Mound Grotto-Heaven, who composed various chapters to bestow upon me, through which I finally grasped the profound teachings of Master Haiqiong.\n\nOnly then did I realize that in my youthful studies, all I sought, heard, and saw were but \"building a house beneath a house\" and \"grafting branches upon branches\"—never understanding that a house is simply a house, and a branch merely a branch. This matter lies right before our eyes; why seek it afar? Now, I transmit it to you. You must interpret the words to grasp their meaning, awaken sharply, and apply effort—no need for doubt, for the Dao resides within!\n\nThe Supreme Dao cannot be named in words; the Supreme Spirit cannot be grasped by thought. What can be named is not the Dao; what can be imagined is not the Spirit. The Spirit is endowed by the Dao, harmonizes with nature, roots in yang, is empty and numinous without trace, manifests without fixed form. It transcends beyond heaven and earth, which cannot confine it; it emerges beyond the reckoning of past and present, which cannot exhaust it. Truly, it is real and most real, mysterious and profoundly mysterious.\n\nIn man’s four great constituents and one body, all belong to yin—only the primordial qi is yang. This qi is not the breath of exhalation and inhalation, nor does it have visible form or shadow. As the ancients said: \"When seen, it cannot be used; when used, it cannot be seen.\" Before this qi received form, while still in the womb, one first received it, then the two kidneys and two eyes were born, from which the heart, liver, spleen, and lungs arose, followed by the nine orifices and four limbs, forming the complete human image.\n\nThis qi resides precisely in the emptiness between, called the Gate of the Mysterious Female. The details can be found in the *Song of the Mysterious Female* by the former masters. Nowadays, people slaughter sheep and observe the space between the two kidneys, where the lumbar region has an empty membrane. Within it, qi breathes and pulses, extending to the flesh before ceasing. When this qi is alive, blood and qi flourish, hun and po unite, inwardly containing the five colors, with warmth like boiling water. When a person dies, blood and qi scatter, and this aperture becomes depleted. This qi is the great elixir of golden cinnabar.\n\nThus, the masters say: To regard the heart, liver, spleen, lungs, kidneys, intestines, gallbladder, essence, fluids, snivel, saliva, qi, blood, and humor as the Dao is incorrect. To consider spirit, essence, hun, po, and intent as the Dao seems plausible but is not so in reality.\n\nIn the human body, the left foot corresponds to greater yang, the right foot to greater yin. The soles of both feet are the Bubbling Spring, emitting the two qi of water and fire. These ascend from the feet to the Tail Gate, merging at the two kidneys. The left is the Kidney Hall, the right the Essence Palace—one water, one fire, one tortoise, one snake, mutually interlocking. Between the two kidneys lies an empty aperture, called the Mysterious Female. The qi of the two kidneys passes through the Mysterious Female, from which the qi issues forth via the yellow and red pathways. It ascends along the double passes of the spine, traversing the twenty-four vertebrae, penetrating the heart and abdomen, entering the Gao-Huang, converging at the Wind Mansion, and ascending to the Mud Pill Palace. From the Mud Pill Palace, it descends to the Bright Hall, dispersing to irrigate the Five Palaces, then flows down the Heavy Tower, returning to its original palace. Day and night, it circulates endlessly, all naturally so—it is not something achieved by manual effort.\n\nYet today, people stray into side paths, unaware of the principle of emptiness and naturalness, the silent operation of the Dao. Instead, they recklessly engage in bending, stretching, exhaling, rubbing, guiding, and visualizing, giving rise to deluded thoughts and actions, thereby inviting illness. Like the White Lotus Daoists, each grows sallow and emaciated; like the Qi-Cultivating Daoists, all suffer from parasitic diseases. These are the proofs.\n\nThe qi within the human body is the same for all, neither more nor less. Those who cultivate it succeed; those who do not, fail. Its circulation, coming and going, has a fixed rhythm, like the tides, which respond unfailingly to the waxing and waning of the moon. The Dipper’s handle in the heavens shifts naturally from midnight to noon. Like a woman’s menstruation or a patient’s malarial fever, it arrives punctually without fail.\n\nThis qi, when encountering yang, becomes yang fire; when encountering yin, becomes yin water. Fire is the fluid of wood; water is the essence of metal. The left kidney is Kan (Water), containing Wu (Yang Earth); the right kidney is Li (Fire), containing Ji (Yin Earth). Wu and Ji, the two earths, combine to form the solar jade. It is also called \"metal within water.\" Metal is the \"blade,\" hence it is named the \"blade jade.\" Fire is wood; water is metal—metal and wood are inseparable, water and fire share the same realm. This metal, wood, water, and fire are all one earth, and this one earth governs the five phases.\n\nThe masters say: \"The five viscera lack qi; the six bowels lack essence\"—this is precisely what they mean. This qi revolves ceaselessly, naturally, without need for human effort. When speaking of the \"three chariots of rolling and turning,\" the \"Yellow River,\" and \"Cao Creek,\" these are metaphors—such things cannot be achieved by human force.\n\nIt always arrives at midnight as yang fire, at noon as yin tally, at dawn as the fluid of wood, and at dusk as the essence of metal. Within dawn lies Jia (Yang Wood), within dusk lies Geng (Yang Metal)—thus, one must gather and employ Jia and Geng. Within midnight lies Wu (Yang Earth), within noon lies Ji (Yin Earth)—thus, one takes the true earth from midnight and noon. In truth, it is one and the same.\n\nTo gather and employ, one uses Jia and Geng; to circulate fire, one is not bound by Zi and Wu. Without a natural and thorough understanding of the ascent and descent of Qian and Kun, the waxing and waning of yin and yang, the maturity of medicinal materials, and the subtle movements of water and fire, one is not fit to discuss these matters.\n\nYet masters have explained this in great detail, and later generations remain confused; they have spoken concisely, and later generations grow doubtful—why is this? It is because they cling to emptiness and do not know where to begin their practice, resulting in failed fetal breathing and a lapse into mere vacuity. Or they neglect naturalness and become mired in forced delusion, wasting their spirit and mind, even inviting illness.\n\n\"Emptiness\" refers to what cannot be seen or heard; \"naturalness\" refers to what can be met and gathered. Now, the methods of gathering, employing, and firing are transmitted step by step with utmost precision—simply adhere to them faithfully, and verification will follow.\n\nThe oral instruction states: Before entering stillness, one must first arrange and prepare the gathering of medicinal materials. Day and night, practice seated meditation. Once settled, the bones and joints open, the meridians unblock, and from the bladder to the spine, movement arises like a turning wheel. The primordial qi naturally ascends through the three passes to the Niwan Palace, descends the *Chonglou*, and enters the *Jianggong*. Yet its arrival has its time, and gathering too has its time. One must wait for the flourishing hours of Mao and You, sitting in silent composure without forceful stirring. Soon, warmth rises to the crown, and sweet dew flows in the throat, dripping ceaselessly. Then, with the eyes turned inward and the mind guiding it, direct it straight into the *Jianggong* to rest.\n\nWithin a single day, Jia corresponds to the waxing moon. From Zi to Mao is the waxing half, yielding half a catty of mercury; from Wu to You is the waning half, yielding half a catty of lead. Gather half a catty each of Jia-mercury and Geng-lead—this is the natural measure. As the saying goes, \"When lead meets Gui, it begins to grow—gather swiftly.\" During the Jia and Geng hours, wood-mercury and metal-lead are born; one must gather them at these times—this is what is meant by \"gathering.\"\n\nYet in gathering, one does not count years or months. Only after long accumulation does the crucible and cauldron form. The body itself is the furnace; the spleen is the Yellow Court, and the Niwan Palace atop the head is the cauldron. Once the crucible and cauldron are complete, one may plant the medicine.\n\nWhen the medicinal material first arises, gather and refine it simultaneously. Gathering and planting it makes it medicine; refining and completing it makes it fire. Gathering yields a *zhu* each day; refining yields a catty each day. When gathering medicine, one must select the flourishing qi of Jia and Geng. The method of firing, however, avoids the *muyu* (bathing) phase. These differences exist, yet the method of gathering is like setting the cauldron—one merely follows what comes naturally, meeting it with intention and guiding it with the eyes. Thus, the alchemical classics speak of the \"Yellow Matron and the Blue Robe.\" The Yellow Matron is intention; the Blue Robe is the eyes. Meeting with intention is called \"the Yellow Matron’s matchmaking\"; guiding with the eyes is called \"the Blue Robe’s transmission.\"\n\nThe qi of the human body moves when intention moves and stops when intention stops—unobstructed and unceasing. This is called \"planting the medicine,\" which enters the cauldron, after which the firing process begins.\n\nThe ancients said, \"The sage transmits the medicine but not the fire.\" This is not to say the fire is not transmitted, but that fire and medicine share the same source yet follow different paths, share the same nature yet serve different functions. Thus, Zi is the first yang, and from Zi to Si, fire completes six numbers, forming Qian. From Zi to Si, one guides it with intention—this is called \"advancing the fire\" or \"adding.\"\n\nWu is the first yin, and from Wu to Hai, water completes six numbers, forming Kun. From Wu to Hai, one need not meet it—this is called \"retreating the fire\" or \"withdrawing.\" Fire is spoken of, not water, because advancing is fire, and retreating is water. This occurs naturally, without human effort, so water is not mentioned.\n\nWhen the alchemical classics refer to the numbers of the *Hetu* and *Luoshu*, they speak of the firing process naturally aligning with the generative numbers of the hexagrams—not that one must forcibly apply these numbers. When they speak of \"morning *tun*, evening *meng*, day *shen*, night *fu*,\" it is to say these moments silently align with the hexagrams, not that one must strive to match them through effort.\n\nAs for the circulation of qi, it flows and irrigates the five viscera and hundred meridians. Hai and Zi flourish the kidneys; Yin and Mao flourish the liver; Si and Wu flourish the heart; Shen and You flourish the lungs; Chen, Xu, Chou, and Wei flourish the spleen. Naturally, this qi circulates, emerging from the flourishing palace—one need not deludedly imagine that at this time, this viscus has this qi, moving in and out.\n\nYet in the initial stages of gathering and forging the cauldron, there are no prohibitions—act when the time comes, and rest when done. But when entering the medicine and circulating fire, one must choose an auspicious day to enter the chamber, avoiding all mundane affairs. Let the ears, eyes, mouth, and nose forget the four images; let day and night become one, without the slightest gap. The chest should be vast and empty, the inner chamber bright.\n\nIf one clings to anything, the hexagram’s structure weakens, and the medicine leaks away. Once in the chamber, one must not seek sleep but remain awake throughout. Wakefulness is yang; sleep is yin. One must always remain alert, constantly vigilant, restraining joy and anger. Anger scatters yang; joy invites yin to overpower. Even the slightest trace of yin will disrupt the yang spirit; even a *zizhu* of yin is a ghost.\n\nEat until half-full, avoiding rich and fatty foods. Let the five flavors be mild and bland; warm and well-cooked is best. One must follow one’s nature, harmonize with the seasons, and unite with qi. Take emptiness as the city, tranquility as the domain, great harmony as the chamber, stillness as the sun and moon. Abandon the false mind, preserve the true mind. When the medicine appears, gather it; when the fire arises, circulate it.\n\nWithin a year, one must refrain from circulating the fire during the second and eighth months (卯 and 酉), for in the second month wood flourishes and fire blazes, while in the eighth month metal prevails and water surges. Apart from these two months, one need not circulate the fire; doing so would only cause harm. Of the twelve months in a year, excluding the second and eighth as periods of \"bathing,\" ten months remain—hence the saying that the embryo is formed. Once pure yang is fully attained, one must no longer circulate the fire, for doing so would damage the elixir. Instead, the work should be transferred to the *Niwan* (Mud Pill Palace), known as \"tending the cauldron.\" At this stage, the fetal immortal has taken form, like a child already born, requiring only nourishment. From this point onward, one need only nurture and warm it, without further need for fire circulation or bathing. After three years and nine months of such practice, the Celestial Gate will open of itself, and the infant spirit will come and go freely, ascending to the heavens. Thus, \"tending the cauldron\" is but the act of nourishing. This entire process of cultivation, from beginning to end, unfolds naturally, without reliance on forced effort or deluded thoughts—one need only meet the moment with intent.\n\nIt is through the accumulation of days and months, the forging of the cauldron and the establishment of the furnace, and the ten months of gestation with fire circulation that the embryo is formed. Yet the master speaks of \"a single grain of golden elixir, radiant as the sun\"—why? Because a moment’s effort at the right time can seize a year and a half of natural transformation. When the medicine arises and the fire arrives, one need only greet it in an instant—hence the saying that it is accomplished in a moment. Yet the golden elixir is not something that can be forged through days and nights of strained effort and deluded striving.\n\nThe terms—medicine and furnace, fire circulation and bathing, fetal breathing and infant spirit, the operations of withdrawal and addition, guest and host, punishment and virtue, floating and sinking, rising and descending, lead and mercury, water and fire, true earth and the *daogui* (knife-spoon), golden essence and wooden fluid—are all but different names for the same thing. Though the interlocking cycles of the scriptures may be familiar and their words easy to speak, putting them into practice is difficult, and maintaining them is most difficult of all.\n\nGenerally, minor methods of side paths yield no karmic response, but the golden elixir alone brings verification. When one gathers the medicine, the young must practice for half a year, those in middle age for a full year, and the elderly for three years—utterly forsaking desire, forgetting thoughts, and sitting in silent stillness. After gathering, when the season arrives, the ears and eyes grow sharp, the hands and feet light and strong, and all illnesses vanish. Naturally, the qi of the two kidneys arises, pressing against the spine like a turning wheel; the *Niwan* feels as if bathed in boiling water; the mouth constantly fills with sweet dew, drop by drop. The spirit remains wakeful, all stray thoughts extinguished. Within a little over two months, the sun and moon generate spiritual light, and the heart becomes clear—yet one must not mistake this for the ultimate Dao, lest wild thoughts arise and madness take hold.\n\nAfter three months of fire circulation, if the work is unceasing and precise, the seven orifices become luminous, and the golden wheel shines within and without, reaching even to spirits afar. At this time, the infant spirit takes form, but one must not yet allow it free movement in and out; rather, one must guard it closely and firmly, lest the fire leak and the elixir fail. When the ten months of fire are complete and the qi is fully received, the process unfolds as naturally as a melon ripening and its stem loosening. Then the infant may come and go, moving a yard or so from the body—but it must not wander far. Upon exiting, it must be drawn back at once, lest it stray and become lost, leading to rebirth in another’s body without return.\n\nOnly after three years and nine months, when the time is fulfilled and the bones have aged like those of a child of several years, will the infant understand the weight and depth of worldly affairs and may be allowed to come and go freely. At this stage, one achieves transformation and flight, attaining the rank of a true immortal. Yet even then, demonic obstacles may arise. When one truly enters the chamber and sits in forgetfulness, strange phenomena will manifest—all manner of marvels and wonders in the world may appear before one, as if seen for the first time with the eye of wisdom, or as if divine spirits have drawn near. At this, one must neither rejoice nor be startled, for these are but demonic illusions and not the essence of the Dao. One must grasp the mechanism, still the thoughts, and concentrate on unity, guarding the true form. One must not mistake the false for the real or indulge the passions as nature. By thus holding to the One, the demons will vanish of themselves, and the Dao will be accomplished.\n\nMany, lacking steadfastness and insight at this stage, are seized by external evils, unable to proceed, and instead fall into madness, folly, or even calamity. Thus do later generations dismiss the path of immortality as empty and elusive—what a pity! Once the ten-month embryo is formed and the cauldron is transferred for warming, one must seek the next step upward. This matter is addressed in the *Wuzhen Pian*’s lower scroll on the method of advancing in cultivation, where rare encounters naturally arise. This does not depend on transmitted oral secrets.\n\nAs for flying ascension or liberation from the corpse, these occur after the elixir is formed, when one further cultivates great merit according to the depth of one’s practice—this is not a matter of transmitted oral instructions. Those who wish to cultivate this elixir method must proceed step by step. If one acts recklessly out of order, the body will lack the embryo, the infant spirit will not form, and one’s vain pursuit of Chan learning will be like water without a source or wood without roots—leading to a stubborn emptiness that yields no achievement even in old age, ultimately returning to the cycle of rebirth.\n\nAfter sixty days in the chamber, signs will appear. One must follow the instructions precisely and never interrupt the practice. As the Dipper turns and time shifts, the qi settles and the realm grows still. The mechanism is engaged, the work continuous and unbroken. If weary, one may ascend to the celestial pool to irrigate, allowing the natural ebb and flow. Clouds and mist arise without confusion or delusion, and the numinous light manifests—neither rejoicing nor startling, but simply rolling up the beaded curtain with both hands.\n\nMaintain perfect discipline over all worldly concerns—joy and anger, thought and sorrow, hunger and thirst, cold and heat. Let neither drowsiness nor torpor enter sleep, and keep the mind-king ever luminous. When thirsty, sip lightly the *Decoction of Four Gentlemen* or *White Wood Decoction*. As soon as one sleeps, qi transforms into blood and cannot ascend. Remaining wakeful and alert allows yang qi to rise!\n\nThe eyes of ordinary people are nourished by the liver, for the heart governs spirit. This is why the eyes of immortals are jade-green, their hue dazzling. Those who cultivate the Dao must not sleep deeply, for sleep strengthens yin qi, turning it into blood that enters the liver and fails to ascend and nourish the eyes—thus they cannot attain natural numinosity.\n\nI grieve that among those who discuss the Dao, only one or two truly grasp it. I have long wished to transmit it, yet none were aligned in affinity. Now, by chance, I meet you, and our inclinations harmonize. Had you not carried some seed from a past life, how could you comprehend even a fraction? Today, I impart all I have received, recording each step with meticulous care. You must ponder deeply in stillness, seek meaning within the text, and await the proper time to begin practice—then, without fail, you will achieve success.\n\nWe shall meet again in four cycles at the appointed place; do not lightly disclose this. Strive diligently! My spoken instructions must remain in your heart, never forgotten. The words I set down in writing should be recited often. Each time you open this scroll, imagine your teachers standing above you—do not treat it lightly.\n\nIf you have not yet begun practice, first calm the mind and hold fast to the mechanism below. Never recklessly transmit this to the unworthy. If someone is fit to receive it, you may reveal a rough outline, but do not withhold it from the deserving. To violate this is to invite great misfortune!\n\n*Direct Pointers Personally Transmitted by Master Bixu*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "碧虚子亲传直指 经名：碧虚子亲传直指。 出於南宋时期。 一卷。 底本出处：《正统道藏》洞真部方法类。 碧虚子亲传直指 仆自幼学道，弱冠弃家，遍历江湖，求参道德。 诵祖师张紫阳以来，诸先生丹经、词曲、传记，熟研精思，寻文求义。 又遍参道契高士，穷历大道之要，后游诸名山大川，洞府福地，祷求石壁碑记，晚遇海琼先生授以大道之要，又遇安然居士於朱陵洞天，作诸章以相贻，始得海琼之妙旨也。 乃知少年之学，所求、所闻、所见，俱为屋下架屋，枝上接枝，殊不知屋便是屋，枝便是枝。 此事只在眼前，何必远求？ 今授于子，子可因文解意，猛省用功，不必狐疑，道在其中矣！ 夫至道不可以名言，至神不可以想得，可名非道，可想非神。 夫神禀乎道，合乎性，根於阳，虚灵而无迹，变现而无方； 超乎天地之外，天地不可得而囿； 出乎古今之数，古今不可得而穷，可谓真而至真，玄之又玄。 凡男子四大一身，皆属阴，惟先天一气是阳。 此气非呼吸吹嘘之气，亦无形影可见。 古云见之不可用，用之不可见。 此气未受形之先，在胎中先受此气，后生两肾两目，由此生心肝脾肺，九窍四肢，次第而成，人象具足。 此气正在空虚之问，名玄牝之门，先师《玄牝歌》自可详见。 今世人宰猜羊，见两肾之间，腰膂去处，有一空膜，之中有气呼吸彭亨，直至肉玲方息者是也。 此气生则气血全盛，魂魄相为，内含五彩，暖气如汤。 如人死，气血一散，而此窍馁矣！ 此气便是金丹大药。 故师云：以心肝脾肺肾肠胆，精津涕唾气血液为非道可，以精神魂魄意似是而实非者也。 人之一身，左足太阳，右足太阴，两足底为涌泉，发水火二气，自两足入尾闲，上合於两肾，左为肾堂，右为精府，一水一火，一龟一蛇，互相蠹钥。 两肾之间，空虚一窍，名日玄牝。 二肾之气，贯通玄牝，气之由此发黄赤二道，上夹脊双关，贯二十四椎，中通心腹，入膏肓，会乎风府，上朝泥丸。 由泥丸而下明堂，散灌五宫，下重楼，复流入于本宫。 日夜循环，周流不息，皆是自然而然，即不是动手脚做来底。 然而今人皆流入旁门者，不知虚无自然，默默运用之理，却妄行屈伸呵嘘，摩擦引导，存思注想，遂生妄想妄作，反致成疾。 如白莲道人，个个黄瘦，运气道人，人人蛊疾。 此皆验也。 夫气在人身，人人一般而无多少，有涵养底做得成，无涵养底做不成，其流行往来，出入自有定数，有如潮候，弦朔必应； 天上斗杓，子午自移。 又如女子月经，人病疟疾，应时而至，确然无差。 此气遇阳时为阳火，遇阴时为阴水，火即木液，水即金精。 左肾为坎，坎中有戊； 右肾为离，离中有己，戊己二土，合成日圭。 又名水中金，金者曰刀，故号刀圭也。 火即木，水即金，为金木无间，水火同乡，其金木水火，即是一土，而一土总其五行。 师云：五脏无气，六腑无精，正谓此耳。 此气时时运转，自然不假人为。 凡言辗辑三车，黄河曹溪者，取象如此，非以人力能为。 常以子时而至，为阳火； 午时而至，为阴符； 以卯时而至，为木液； 以酉时而至，为金精。 卯中有甲，酉中有庚，故须采取用甲庚； 子中有戊，午中有己，故取真土用子午，其实一物。",
      "translated_text": "**The Direct Pointers Personally Transmitted by Master Bixu**\n\n*Title:* *The Direct Pointers Personally Transmitted by Master Bixu*. Originating in the Southern Song dynasty, this work comprises one scroll. The base text is derived from the *Zhengtong Daoist Canon*, under the \"Methods\" category of the *Dongzhen* section.\n\n**The Direct Pointers Personally Transmitted by Master Bixu**\n\nFrom my youth, I studied the Dao. In early manhood, I left home, wandering rivers and lakes to seek the essence of virtue and the Dao. I recited and deeply pondered the alchemical classics, verses, and records of past masters since Ancestor Zhang Ziyang, exploring their words for meaning. I also sought out those who had attained the Dao, exhaustively investigating its essentials. Later, I traveled through famous mountains and great rivers, sacred grottoes and blessed lands, praying before stone inscriptions and steles. In my later years, I met Master Haiqiong, who imparted the essentials of the Great Dao. I also encountered the Recluse Anran at the Red Mound Grotto-Heaven, who composed various chapters to bestow upon me, through which I finally grasped the profound teachings of Master Haiqiong.\n\nOnly then did I realize that in my youthful studies, all I sought, heard, and saw were but \"building a house beneath a house\" and \"grafting branches upon branches\"—never understanding that a house is simply a house, and a branch merely a branch. This matter lies right before our eyes; why seek it afar? Now, I transmit it to you. You must interpret the words to grasp their meaning, awaken sharply, and apply effort—no need for doubt, for the Dao resides within!\n\nThe Supreme Dao cannot be named in words; the Supreme Spirit cannot be grasped by thought. What can be named is not the Dao; what can be imagined is not the Spirit. The Spirit is endowed by the Dao, harmonizes with nature, roots in yang, is empty and numinous without trace, manifests without fixed form. It transcends beyond heaven and earth, which cannot confine it; it emerges beyond the reckoning of past and present, which cannot exhaust it. Truly, it is real and most real, mysterious and profoundly mysterious.\n\nIn man’s four great constituents and one body, all belong to yin—only the primordial qi is yang. This qi is not the breath of exhalation and inhalation, nor does it have visible form or shadow. As the ancients said: \"When seen, it cannot be used; when used, it cannot be seen.\" Before this qi received form, while still in the womb, one first received it, then the two kidneys and two eyes were born, from which the heart, liver, spleen, and lungs arose, followed by the nine orifices and four limbs, forming the complete human image.\n\nThis qi resides precisely in the emptiness between, called the Gate of the Mysterious Female. The details can be found in the *Song of the Mysterious Female* by the former masters. Nowadays, people slaughter sheep and observe the space between the two kidneys, where the lumbar region has an empty membrane. Within it, qi breathes and pulses, extending to the flesh before ceasing. When this qi is alive, blood and qi flourish, hun and po unite, inwardly containing the five colors, with warmth like boiling water. When a person dies, blood and qi scatter, and this aperture becomes depleted. This qi is the great elixir of golden cinnabar.\n\nThus, the masters say: To regard the heart, liver, spleen, lungs, kidneys, intestines, gallbladder, essence, fluids, snivel, saliva, qi, blood, and humor as the Dao is incorrect. To consider spirit, essence, hun, po, and intent as the Dao seems plausible but is not so in reality.\n\nIn the human body, the left foot corresponds to greater yang, the right foot to greater yin. The soles of both feet are the Bubbling Spring, emitting the two qi of water and fire. These ascend from the feet to the Tail Gate, merging at the two kidneys. The left is the Kidney Hall, the right the Essence Palace—one water, one fire, one tortoise, one snake, mutually interlocking. Between the two kidneys lies an empty aperture, called the Mysterious Female. The qi of the two kidneys passes through the Mysterious Female, from which the qi issues forth via the yellow and red pathways. It ascends along the double passes of the spine, traversing the twenty-four vertebrae, penetrating the heart and abdomen, entering the Gao-Huang, converging at the Wind Mansion, and ascending to the Mud Pill Palace. From the Mud Pill Palace, it descends to the Bright Hall, dispersing to irrigate the Five Palaces, then flows down the Heavy Tower, returning to its original palace. Day and night, it circulates endlessly, all naturally so—it is not something achieved by manual effort.\n\nYet today, people stray into side paths, unaware of the principle of emptiness and naturalness, the silent operation of the Dao. Instead, they recklessly engage in bending, stretching, exhaling, rubbing, guiding, and visualizing, giving rise to deluded thoughts and actions, thereby inviting illness. Like the White Lotus Daoists, each grows sallow and emaciated; like the Qi-Cultivating Daoists, all suffer from parasitic diseases. These are the proofs.\n\nThe qi within the human body is the same for all, neither more nor less. Those who cultivate it succeed; those who do not, fail. Its circulation, coming and going, has a fixed rhythm, like the tides, which respond unfailingly to the waxing and waning of the moon. The Dipper’s handle in the heavens shifts naturally from midnight to noon. Like a woman’s menstruation or a patient’s malarial fever, it arrives punctually without fail.\n\nThis qi, when encountering yang, becomes yang fire; when encountering yin, becomes yin water. Fire is the fluid of wood; water is the essence of metal. The left kidney is Kan (Water), containing Wu (Yang Earth); the right kidney is Li (Fire), containing Ji (Yin Earth). Wu and Ji, the two earths, combine to form the solar jade. It is also called \"metal within water.\" Metal is the \"blade,\" hence it is named the \"blade jade.\" Fire is wood; water is metal—metal and wood are inseparable, water and fire share the same realm. This metal, wood, water, and fire are all one earth, and this one earth governs the five phases.\n\nThe masters say: \"The five viscera lack qi; the six bowels lack essence\"—this is precisely what they mean. This qi revolves ceaselessly, naturally, without need for human effort. When speaking of the \"three chariots of rolling and turning,\" the \"Yellow River,\" and \"Cao Creek,\" these are metaphors—such things cannot be achieved by human force.\n\nIt always arrives at midnight as yang fire, at noon as yin tally, at dawn as the fluid of wood, and at dusk as the essence of metal. Within dawn lies Jia (Yang Wood), within dusk lies Geng (Yang Metal)—thus, one must gather and employ Jia and Geng. Within midnight lies Wu (Yang Earth), within noon lies Ji (Yin Earth)—thus, one takes the true earth from midnight and noon. In truth, it is one and the same.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1221,
      "start_sentence": 0,
      "end_sentence": 50,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.26255488395691,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\碧虚子亲传直指.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "取采则用甲庚，行火则不拘子午，非自然洞晓乾坤升降，阴阳盛衰，药材老嫩，水火潜飞之理者，不足以语此。 然而师传言之甚详，而后人自惑； 言之甚简，而后人自疑，何也？ 皆缘泥於虚无，则不知下手用功，是胎息不成而归於顽空，忽於自然则泥於妄想强作，是以心神枉费而反以致疾。 夫虚无者，言其不可见闻，自然者，言其可以迎取。 今以采取火候等法，逐节紧切相传，但谨守奉行自验。 诀曰：凡人未入定已前，且理会安排，采取药材，每日每夜，且习打坐，一定自然，骨节开，关脉通，自膀胱至夹脊，便如车轮动。 先天一气，自然由三关朝泥丸，下重楼，入绛宫。 然其来有时，采亦有时，须得卯酉一旺时，默默端坐，不须用力摩动，须臾觉顶热，喉中有甘露，时时滴下，便以目内视，以意内送，直纳之绛宫而止。 凡一日内，以甲应上弦。 自子至卯为上弦，得汞半斤； 自午至酉为下弦，得铅半斤。 采甲汞庚铅各半斤，自然定数，所谓铅见癸生须急采者，甲庚二时，木汞金铅方生，须是此时时采取也，如此谓之采取。 然於采取之时，不记年月，久久积之，方成炉鼎。 夫一身炉也，今人以脾为黄庭，顶中泥丸为鼎也。 炉鼎既成，然后种药。 夫药物一生，且采且炼，采而种之为药，炼而成之为火，采之则一日有一铢之得，炼之则一日有一斤之数。 采药、之时，须拣甲庚旺气，行火之法，则忌沐浴，有此不同，采之法亦如安鼎，不过因自然而来，而迎之以意，送之以目，故丹经云黄婆青衣。 黄婆者，意也，青衣者，目也，以意逢迎，谓之黄婆媒合； 以目内送，谓之青衣女传。 言人身之气，意行则行，意止则止，不复不流，谓之种药，即入鼎中，然后有火候。 古人云：圣人传药不传火。 非不传也，以火与药同归而殊途，同情而异功，故子为一阳，至巳为六阳，言自子至巳，火归六数，而六成乾。 当自子至巳，以意送之，谓之进火，又谓之曰添。 午为阴至亥为六阴，自午至亥，水归六数，而六成坤。 当自午至亥，不必迎之，谓之退火，又谓之曰抽。 而言火不言水者，盖添进则为火，抽退则为水。 此自然而然，不假人为，故不言之水也。 丹经言《河图》、《洛书》之数者，言其火候自然与此卦生成之数合耳，非必求用力以此数。 言朝屯暮蒙，昼娠夜复，一言与此卦默合，非以用力求合於卦也。 如运之说，则言此气运行，流灌五脏百脉，如亥子旺肾，寅卯旺肝，巳午旺心，申酉旺肺，辰戌丑未旺脾，自然而此气运行，由旺宫而出，初不必妄想此时此脏有此气，出入流运。 然采取造鼎之初，则无禁忌，时为即为，即了即休。 至如入药行火，则须择日入室，一毫俗事不可妄干，使耳目口鼻，四象相忘，昼夜如一，毫发无间，胸中廓然，虚室生白。 一有所着，便是卦图不牢，药物走漏。 既在室中，不可求睡，当始终不寐。 盖不寐为阳，合寐为阴，并每要惺惺然，常提着，损去喜怒。 盖怒则阳散，喜则阴乘，若有毫发之阴，而阳神间，锱铢之阴而皆鬼也。 食须半饥半饱。 勿茹荤肥，五味但和淡，温熟者为佳。 必须率性，依时合气，当以玄虚为城，恬淡为域，太和为室，寂然为日月，去其妄心，存其真心，见药即采，遇火即行。",
      "translated_text": "To gather and employ, one uses Jia and Geng; to circulate fire, one is not bound by Zi and Wu. Without a natural and thorough understanding of the ascent and descent of Qian and Kun, the waxing and waning of yin and yang, the maturity of medicinal materials, and the subtle movements of water and fire, one is not fit to discuss these matters.\n\nYet masters have explained this in great detail, and later generations remain confused; they have spoken concisely, and later generations grow doubtful—why is this? It is because they cling to emptiness and do not know where to begin their practice, resulting in failed fetal breathing and a lapse into mere vacuity. Or they neglect naturalness and become mired in forced delusion, wasting their spirit and mind, even inviting illness.\n\n\"Emptiness\" refers to what cannot be seen or heard; \"naturalness\" refers to what can be met and gathered. Now, the methods of gathering, employing, and firing are transmitted step by step with utmost precision—simply adhere to them faithfully, and verification will follow.\n\nThe oral instruction states: Before entering stillness, one must first arrange and prepare the gathering of medicinal materials. Day and night, practice seated meditation. Once settled, the bones and joints open, the meridians unblock, and from the bladder to the spine, movement arises like a turning wheel. The primordial qi naturally ascends through the three passes to the Niwan Palace, descends the *Chonglou*, and enters the *Jianggong*. Yet its arrival has its time, and gathering too has its time. One must wait for the flourishing hours of Mao and You, sitting in silent composure without forceful stirring. Soon, warmth rises to the crown, and sweet dew flows in the throat, dripping ceaselessly. Then, with the eyes turned inward and the mind guiding it, direct it straight into the *Jianggong* to rest.\n\nWithin a single day, Jia corresponds to the waxing moon. From Zi to Mao is the waxing half, yielding half a catty of mercury; from Wu to You is the waning half, yielding half a catty of lead. Gather half a catty each of Jia-mercury and Geng-lead—this is the natural measure. As the saying goes, \"When lead meets Gui, it begins to grow—gather swiftly.\" During the Jia and Geng hours, wood-mercury and metal-lead are born; one must gather them at these times—this is what is meant by \"gathering.\"\n\nYet in gathering, one does not count years or months. Only after long accumulation does the crucible and cauldron form. The body itself is the furnace; the spleen is the Yellow Court, and the Niwan Palace atop the head is the cauldron. Once the crucible and cauldron are complete, one may plant the medicine.\n\nWhen the medicinal material first arises, gather and refine it simultaneously. Gathering and planting it makes it medicine; refining and completing it makes it fire. Gathering yields a *zhu* each day; refining yields a catty each day. When gathering medicine, one must select the flourishing qi of Jia and Geng. The method of firing, however, avoids the *muyu* (bathing) phase. These differences exist, yet the method of gathering is like setting the cauldron—one merely follows what comes naturally, meeting it with intention and guiding it with the eyes. Thus, the alchemical classics speak of the \"Yellow Matron and the Blue Robe.\" The Yellow Matron is intention; the Blue Robe is the eyes. Meeting with intention is called \"the Yellow Matron’s matchmaking\"; guiding with the eyes is called \"the Blue Robe’s transmission.\"\n\nThe qi of the human body moves when intention moves and stops when intention stops—unobstructed and unceasing. This is called \"planting the medicine,\" which enters the cauldron, after which the firing process begins.\n\nThe ancients said, \"The sage transmits the medicine but not the fire.\" This is not to say the fire is not transmitted, but that fire and medicine share the same source yet follow different paths, share the same nature yet serve different functions. Thus, Zi is the first yang, and from Zi to Si, fire completes six numbers, forming Qian. From Zi to Si, one guides it with intention—this is called \"advancing the fire\" or \"adding.\"\n\nWu is the first yin, and from Wu to Hai, water completes six numbers, forming Kun. From Wu to Hai, one need not meet it—this is called \"retreating the fire\" or \"withdrawing.\" Fire is spoken of, not water, because advancing is fire, and retreating is water. This occurs naturally, without human effort, so water is not mentioned.\n\nWhen the alchemical classics refer to the numbers of the *Hetu* and *Luoshu*, they speak of the firing process naturally aligning with the generative numbers of the hexagrams—not that one must forcibly apply these numbers. When they speak of \"morning *tun*, evening *meng*, day *shen*, night *fu*,\" it is to say these moments silently align with the hexagrams, not that one must strive to match them through effort.\n\nAs for the circulation of qi, it flows and irrigates the five viscera and hundred meridians. Hai and Zi flourish the kidneys; Yin and Mao flourish the liver; Si and Wu flourish the heart; Shen and You flourish the lungs; Chen, Xu, Chou, and Wei flourish the spleen. Naturally, this qi circulates, emerging from the flourishing palace—one need not deludedly imagine that at this time, this viscus has this qi, moving in and out.\n\nYet in the initial stages of gathering and forging the cauldron, there are no prohibitions—act when the time comes, and rest when done. But when entering the medicine and circulating fire, one must choose an auspicious day to enter the chamber, avoiding all mundane affairs. Let the ears, eyes, mouth, and nose forget the four images; let day and night become one, without the slightest gap. The chest should be vast and empty, the inner chamber bright.\n\nIf one clings to anything, the hexagram’s structure weakens, and the medicine leaks away. Once in the chamber, one must not seek sleep but remain awake throughout. Wakefulness is yang; sleep is yin. One must always remain alert, constantly vigilant, restraining joy and anger. Anger scatters yang; joy invites yin to overpower. Even the slightest trace of yin will disrupt the yang spirit; even a *zizhu* of yin is a ghost.\n\nEat until half-full, avoiding rich and fatty foods. Let the five flavors be mild and bland; warm and well-cooked is best. One must follow one’s nature, harmonize with the seasons, and unite with qi. Take emptiness as the city, tranquility as the domain, great harmony as the chamber, stillness as the sun and moon. Abandon the false mind, preserve the true mind. When the medicine appears, gather it; when the fire arises, circulate it.",
      "overlap_context": "River,\" and \"Cao Creek,\" these are metaphors—such things cannot be achieved by human force.\n\nIt always arrives at midnight as yang fire, at noon as yin tally, at dawn as the fluid of wood, and at dusk as the essence of metal. Within dawn lies Jia (Yang Wood), within dusk lies Geng (Yang Metal)—thus, one must gather and employ Jia and Geng. Within midnight lies Wu (Yang Earth), within noon lies Ji (Yin Earth)—thus, one takes the true earth from midnight and noon. In truth, it is one and the same.",
      "start_char": 1221,
      "end_char": 2436,
      "start_sentence": 51,
      "end_sentence": 90,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.74201250076294,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\碧虚子亲传直指.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "一年之内，止除卯酉两月不可行火候，以卯木旺则火炎，金旺则水盛故耳。 除此两月，不须行火候，行则反伤。 一年十二月，去其卯酉为沐浴，止存十个月，故日胎成。 则纯阳俱备，不须行火候，行则伤丹。 当移入泥丸，谓之抚鼎。 此时胎仙已成，如人已生，但须乳哺也。 工夫至此，只须温养，不必再行火候沐浴。 如此三年九载，则天门自开，婴儿出入，往来无碍，位登天矣！ 故抚鼎者，即乳哺也。 此首尾用工之说，皆是自然而然者，不假人力强为妄想，不过及时以意逢迎而已。 须是积日累月，造鼎安炉，一年十月，结胎行火。 而师云一粒金丹赫日红，何也？ 言一时半日之功夫，可夺一年半纪之造化也。 当其药生火到之时，不过顷刻逢迎，故谓顷刻而成。 然金丹即非终日终夜劳神苦志，强为妄想可成者。 夫药物炉鼎，火候沐浴，胎息婴儿，运用抽添，宾主刑德，浮沉升降，铅汞水火，真土刀圭，金精木液，一应名号，都是改名换字，其物即一也。 钩锁连环，经自可熟读，言之非难，行之为难，守之最难。 大抵旁门小法，俱无报应，唯有金丹一件，便有应验。 凡人采药，少年须行半年功夫，中年须行一年功夫，老年须行三年功夫，绝欲忘念，静坐默然。 采取之后，时节至来，耳目聪明，手足清健，百病俱无。 自然两肾气来，夹脊如车轮，泥丸如汤注，口常有甘露，滴滴而来，神若不寐，百念俱绝，不过两月余，日月生神光，此心明了，不可便为至道，否则狂念妄生，遂成痴风。 至於三月行火之余，时时刻刻，工夫不差，则七窍光明，所有金轮，内外洞明，远接鬼神。 当此之时，婴儿遂生形像，不可便纵其运动出入，须要着紧守护牢固，否则火漏丹败。 十月火满，受气足备，自然如此瓜熟蒂悬而出。 然后出入往来，可以离身丈尺，亦不可远去，一出便须收回，否则一去而迷，遂至投胎夺舍，不复回顾。 直须三年九载，日子满足，骨骼老，如人数岁，方知人事轻重浅深，方可纵其自然出入往来。 至此时则飞升变化，真仙之位矣！ 然犹有魔障，当真入室坐忘之时，神异自出，凡天下万品，奇怪之事，俱集于前，真如慧眼初见，犹如神明依附，到此勿喜勿惊，此皆魔障所至，不可便以为道要。 在把捉摄机静念，凝一守持，所谓太玄之一，守其真形，切不可以妄为真，纵情为性，如此守一，其魔自消，方能道成。 今人多到此时，无定力定见，故为外邪所摄，则不能来，反有风狂痴颠，非横之祸，遂使后人反以神仙之道虚无渺荡惜哉！ 若十月胎成，移鼎温养之后，又当求向上一着，此事在《悟真篇》下卷求精进法，自然有希有之遇。 此不待传授之诀。 若飞升尸解，乃是丹成之后，又下功夫立大功德，随修行深浅之果证，即非传授口诀。 凡欲修此丹法，必须次第而行，倘或不依次第，妄作僭行，则身中无胎，婴儿不生，妄参禅学，如水之无源，木之无根，意成顽空，到老无成，终归输回之趣。 入室六十日之后，便见验也。 须是依诀行之，切不可间断。 子转斗移，气澄境静，摄机作用，绵绵不绝； 或倦则上池回溉，一任消息往来，云雾遍兴，无迷无妄，灵光发现，勿喜勿惊，但两手卷珠帘而已。",
      "translated_text": "Within a year, one must refrain from circulating the fire during the second and eighth months (卯 and 酉), for in the second month wood flourishes and fire blazes, while in the eighth month metal prevails and water surges. Apart from these two months, one need not circulate the fire; doing so would only cause harm. Of the twelve months in a year, excluding the second and eighth as periods of \"bathing,\" ten months remain—hence the saying that the embryo is formed. Once pure yang is fully attained, one must no longer circulate the fire, for doing so would damage the elixir. Instead, the work should be transferred to the *Niwan* (Mud Pill Palace), known as \"tending the cauldron.\" At this stage, the fetal immortal has taken form, like a child already born, requiring only nourishment. From this point onward, one need only nurture and warm it, without further need for fire circulation or bathing. After three years and nine months of such practice, the Celestial Gate will open of itself, and the infant spirit will come and go freely, ascending to the heavens. Thus, \"tending the cauldron\" is but the act of nourishing. This entire process of cultivation, from beginning to end, unfolds naturally, without reliance on forced effort or deluded thoughts—one need only meet the moment with intent.\n\nIt is through the accumulation of days and months, the forging of the cauldron and the establishment of the furnace, and the ten months of gestation with fire circulation that the embryo is formed. Yet the master speaks of \"a single grain of golden elixir, radiant as the sun\"—why? Because a moment’s effort at the right time can seize a year and a half of natural transformation. When the medicine arises and the fire arrives, one need only greet it in an instant—hence the saying that it is accomplished in a moment. Yet the golden elixir is not something that can be forged through days and nights of strained effort and deluded striving.\n\nThe terms—medicine and furnace, fire circulation and bathing, fetal breathing and infant spirit, the operations of withdrawal and addition, guest and host, punishment and virtue, floating and sinking, rising and descending, lead and mercury, water and fire, true earth and the *daogui* (knife-spoon), golden essence and wooden fluid—are all but different names for the same thing. Though the interlocking cycles of the scriptures may be familiar and their words easy to speak, putting them into practice is difficult, and maintaining them is most difficult of all.\n\nGenerally, minor methods of side paths yield no karmic response, but the golden elixir alone brings verification. When one gathers the medicine, the young must practice for half a year, those in middle age for a full year, and the elderly for three years—utterly forsaking desire, forgetting thoughts, and sitting in silent stillness. After gathering, when the season arrives, the ears and eyes grow sharp, the hands and feet light and strong, and all illnesses vanish. Naturally, the qi of the two kidneys arises, pressing against the spine like a turning wheel; the *Niwan* feels as if bathed in boiling water; the mouth constantly fills with sweet dew, drop by drop. The spirit remains wakeful, all stray thoughts extinguished. Within a little over two months, the sun and moon generate spiritual light, and the heart becomes clear—yet one must not mistake this for the ultimate Dao, lest wild thoughts arise and madness take hold.\n\nAfter three months of fire circulation, if the work is unceasing and precise, the seven orifices become luminous, and the golden wheel shines within and without, reaching even to spirits afar. At this time, the infant spirit takes form, but one must not yet allow it free movement in and out; rather, one must guard it closely and firmly, lest the fire leak and the elixir fail. When the ten months of fire are complete and the qi is fully received, the process unfolds as naturally as a melon ripening and its stem loosening. Then the infant may come and go, moving a yard or so from the body—but it must not wander far. Upon exiting, it must be drawn back at once, lest it stray and become lost, leading to rebirth in another’s body without return.\n\nOnly after three years and nine months, when the time is fulfilled and the bones have aged like those of a child of several years, will the infant understand the weight and depth of worldly affairs and may be allowed to come and go freely. At this stage, one achieves transformation and flight, attaining the rank of a true immortal. Yet even then, demonic obstacles may arise. When one truly enters the chamber and sits in forgetfulness, strange phenomena will manifest—all manner of marvels and wonders in the world may appear before one, as if seen for the first time with the eye of wisdom, or as if divine spirits have drawn near. At this, one must neither rejoice nor be startled, for these are but demonic illusions and not the essence of the Dao. One must grasp the mechanism, still the thoughts, and concentrate on unity, guarding the true form. One must not mistake the false for the real or indulge the passions as nature. By thus holding to the One, the demons will vanish of themselves, and the Dao will be accomplished.\n\nMany, lacking steadfastness and insight at this stage, are seized by external evils, unable to proceed, and instead fall into madness, folly, or even calamity. Thus do later generations dismiss the path of immortality as empty and elusive—what a pity! Once the ten-month embryo is formed and the cauldron is transferred for warming, one must seek the next step upward. This matter is addressed in the *Wuzhen Pian*’s lower scroll on the method of advancing in cultivation, where rare encounters naturally arise. This does not depend on transmitted oral secrets.\n\nAs for flying ascension or liberation from the corpse, these occur after the elixir is formed, when one further cultivates great merit according to the depth of one’s practice—this is not a matter of transmitted oral instructions. Those who wish to cultivate this elixir method must proceed step by step. If one acts recklessly out of order, the body will lack the embryo, the infant spirit will not form, and one’s vain pursuit of Chan learning will be like water without a source or wood without roots—leading to a stubborn emptiness that yields no achievement even in old age, ultimately returning to the cycle of rebirth.\n\nAfter sixty days in the chamber, signs will appear. One must follow the instructions precisely and never interrupt the practice. As the Dipper turns and time shifts, the qi settles and the realm grows still. The mechanism is engaged, the work continuous and unbroken. If weary, one may ascend to the celestial pool to irrigate, allowing the natural ebb and flow. Clouds and mist arise without confusion or delusion, and the numinous light manifests—neither rejoicing nor startling, but simply rolling up the beaded curtain with both hands.",
      "overlap_context": "ill disrupt the yang spirit; even a *zizhu* of yin is a ghost.\n\nEat until half-full, avoiding rich and fatty foods. Let the five flavors be mild and bland; warm and well-cooked is best. One must follow one’s nature, harmonize with the seasons, and unite with qi. Take emptiness as the city, tranquility as the domain, great harmony as the chamber, stillness as the sun and moon. Abandon the false mind, preserve the true mind. When the medicine appears, gather it; when the fire arises, circulate it.",
      "start_char": 2436,
      "end_char": 3637,
      "start_sentence": 91,
      "end_sentence": 128,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.53014588356018,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\碧虚子亲传直指.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "须要专戒万缘，喜怒思忧，饥渴寒燠，寝寐无入昏沉，心王常明，渴则少饮四君子汤、白木汤。 才睡，气便化血，不能上腾。 不寐惺惺，则阳气上腾矣！ 凡世人两目系肝来养者，盖心司神也，所以神仙眼碧，色夺目也。 凡人修道者，不可熟睡，睡则阴气盛，化血入肝，不能上滋两目，自然通灵。 仆痛念世人谈道者一二，几欲付人，奈针芥不相投，未容分付，今偶与子会，意味稍合，若非前生有些种子，岂能知其一二？ 仆今尽其所授，逐节切紧，一一录付。 子可熟玩静思，寻文求义，候其时来，用工下手，断断成就。 仆与子四纪复有会期之所，未可轻泄了，宜勉之！ 仆口嘱之言，在心勿失，笔录之语，常可熟诵。 每开卷时，如见诸师君在上，不可忽之。 如身未行，且当澄心静念，守其机绿下乎。 切不可妄授非徒，倘可言者，粗发明其一二无妨，得人则不可秘。 违此则戾祸大焉！ 碧虚子亲传直指竟",
      "translated_text": "Maintain perfect discipline over all worldly concerns—joy and anger, thought and sorrow, hunger and thirst, cold and heat. Let neither drowsiness nor torpor enter sleep, and keep the mind-king ever luminous. When thirsty, sip lightly the *Decoction of Four Gentlemen* or *White Wood Decoction*. As soon as one sleeps, qi transforms into blood and cannot ascend. Remaining wakeful and alert allows yang qi to rise!\n\nThe eyes of ordinary people are nourished by the liver, for the heart governs spirit. This is why the eyes of immortals are jade-green, their hue dazzling. Those who cultivate the Dao must not sleep deeply, for sleep strengthens yin qi, turning it into blood that enters the liver and fails to ascend and nourish the eyes—thus they cannot attain natural numinosity.\n\nI grieve that among those who discuss the Dao, only one or two truly grasp it. I have long wished to transmit it, yet none were aligned in affinity. Now, by chance, I meet you, and our inclinations harmonize. Had you not carried some seed from a past life, how could you comprehend even a fraction? Today, I impart all I have received, recording each step with meticulous care. You must ponder deeply in stillness, seek meaning within the text, and await the proper time to begin practice—then, without fail, you will achieve success.\n\nWe shall meet again in four cycles at the appointed place; do not lightly disclose this. Strive diligently! My spoken instructions must remain in your heart, never forgotten. The words I set down in writing should be recited often. Each time you open this scroll, imagine your teachers standing above you—do not treat it lightly.\n\nIf you have not yet begun practice, first calm the mind and hold fast to the mechanism below. Never recklessly transmit this to the unworthy. If someone is fit to receive it, you may reveal a rough outline, but do not withhold it from the deserving. To violate this is to invite great misfortune!\n\n*Direct Pointers Personally Transmitted by Master Bixu*",
      "overlap_context": "will appear. One must follow the instructions precisely and never interrupt the practice. As the Dipper turns and time shifts, the qi settles and the realm grows still. The mechanism is engaged, the work continuous and unbroken. If weary, one may ascend to the celestial pool to irrigate, allowing the natural ebb and flow. Clouds and mist arise without confusion or delusion, and the numinous light manifests—neither rejoicing nor startling, but simply rolling up the beaded curtain with both hands.",
      "start_char": 3637,
      "end_char": 3995,
      "start_sentence": 129,
      "end_sentence": 143,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.7144775390625,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\碧虚子亲传直指.txt",
        "category": "方法类"
      }
    }
  ]
}