{
  "source_id": "神仙服食灵草菖蒲丸方传",
  "source_file": "chunked_daozang\\神仙服食灵草菖蒲丸方传.json",
  "total_chunks": 3,
  "total_original_chars": 1975,
  "total_translated_chars": 10730,
  "total_translation_time": 56.939393520355225,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\方法类\\神仙服食灵草菖蒲丸方传.txt",
    "category": "方法类"
  },
  "full_translation": "*The Divine Immortals’ Formula for Consuming the Sacred Herb Acorus Pill*\n*Text Title:* *Transmission of the Divine Immortals’ Formula for Consuming the Sacred Herb Acorus Pill*\n*Author:* Unknown\n*Dated:* References to the fourteenth year of the Dali reign (779 CE) suggest a Tang dynasty composition.\n*Volume:* One fascicle\n*Source Text:* *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, Methods Category\n\n---\n\nThe herb *changpu* (acorus) is the essence of water, the sacred herb of divine immortals, and a treasured formula of the great sages. Recluses wandering the mountains and those who withdraw from the world in seclusion all consume it.\n\nEmperor Wu of Liang, devoted to the classics and aspiring to immortality, sought wise scholars and virtuous men. During the Jinglong era, Lü Louyun submitted a memorial stating: \"In the past, Dongfang Shuo, the immortal of Emperor Wu of Han’s court, revered and consumed *changpu*. I humbly beseech Your Majesty to follow his example.\"\n\nThe Liang sovereign emulated this practice, and after taking it, all illnesses vanished, his mind sharpened, and his spirit grew clear. The emperor sighed: \"The numinous of heaven and the essence of earth take the divine as their master. Immortals revere the Dao as supreme, receiving the pure harmony of *qi*, with herbs as their foundation. *Chang* means ‘flourishing,’ *pu* means ‘universal,’ and *jing* means ‘numinous.’ This herb broadly cures all ailments, extends years, strengthens the will, and preserves youthful complexion—is it not truly the herb of immortals? How wondrous is *changpu*! I have secretly followed this method, consuming it morning and night according to the formula, and found it profoundly effective. Not only do men and women, young and old, benefit from it, but its advantages are even greater. Those who take it are protected by spirits and gods, though the world cannot fathom its reason. There are no taboos against its use. If one experiences heat in the body, boil one *qian* of *qinjiao* (gentian) in a cup of water, let it cool, and drink it to settle the condition, for it serves as an assistant to *changpu*.\"\n\nRecorded in the fourteenth year of the Dali reign.\n\n---\n\nYuanming notes: On the ninth day of the ninth month, gather *changpu*, dry it in the sun, pound it into powder, mix it with glutinous rice paste, and form it into pills.\n\nAnother method, from the *Taiqing Scripture*: The divine immortals’ sacred herb *changpu* should be gathered on the third day of the third month, the fourth day of the fourth month, the fifth day of the fifth month, the sixth day of the sixth month, the seventh day of the seventh month, the eighth day of the eighth month, the ninth day of the ninth month, or the tenth day of the tenth month. When collecting it, choose only those growing in clear, still waters upon rocks, preferably in south-flowing streams—those from north-flowing waters are unsuitable. Alternatively, select plants growing in pure soil, harvest them on the same day, remove the root hairs on the spot, clean them thoroughly, place them in a vessel, and rinse them in water to remove impurities. Cut the firm parts into thin slices, dry them in good sunlight, pound them through a sieve, and on a propitious day, prepare a paste. Use aged glutinous rice, soak it overnight, rinse it to remove impurities, grind it finely in a stone mortar, strain the dregs, and cook it until thick. Mix the powdered *changpu* into the paste until fully incorporated, then have several people roll it into pills the size of *wutong* seeds. Dry them in the sun, store them in a container, and begin by taking ten pills. Chew a mouthful of rice, swallow the pills with it, then wash them down with wine. Eating a light meal afterward is especially beneficial. There are no taboos against its use.\n\nAfter taking it for ten months, it aids digestion. After two months, it dispels cold ailments. After three months, all illnesses are cured. By the fourth year, one’s spirit becomes abundant. By the fifth year, the marrow is fully replenished. By the sixth year, the complexion glows like a child’s. By the seventh year, white hair turns black again. By the eighth year, fallen teeth regrow. By the ninth year, the skin becomes smooth and supple. By the tenth year, the face blooms like a peach blossom. By the eleventh year, the bones grow light. By the twelfth year, one becomes a true immortal, attaining eternal life and transcending the world, with a visage like the hibiscus, commanding the myriad spirits, untouched by malevolent forces, and forever free from misfortune. This elixir allows great immortals to ascend; yet the world remains unaware. I chanced upon these effects recorded in the *Shangqing Sutra*. This must not be recklessly transmitted to the unworthy, lest they treat it with negligence. Those who obtain it will calm the mind, replenish qi, strengthen resolve, invigorate the spirit, fill the marrow, restore essence, and turn even the beard black. If one takes it with devotion, eternal life is assured. Another method states that even at three hundred and thirty years, its benefits persist, granting transcendence and immortality—such is the unmatched power of *changpu*. Yet if one lacks resolve, the fault lies not in the remedy itself.\n\nIt may be gathered on any of the five days, the outer skin scraped away, thinly sliced, and dried in the sun. Proceed as before: pound it through a sieve, mix the powder with finely ground non-glutinous rice paste, and knead into a dough. Then place it in an iron mortar and pound three thousand times to form pills.\n\nLiu Gen said: \"Those who take *changpu* will read widely without fatigue, remain wakeful day and night, and have all spirits attend them.\" Bian Que said: \"*Changpu* cures long-standing wind illnesses, widely benefiting the world. Men and women with ailments should all take it.\" Once, Tao Qian gathered it on the fifth day of the fifth month and made honeyed pills, which proved effective without taboos. If made into rice-based pills, the results are sublime. The old and young may take it without harm, and there are no restrictions.\n\nTake twenty-five pills at dawn, twenty-five at noon, and thirty in the evening, without missing any dose. After a year, the Three Corpses and Nine Worms will be expelled, and no further disturbances will arise. In Henan County, a Daoist named Ye Jingyuan’s mother, aged thirty-five, fell ill with wind-stroke, her limbs paralyzed, her body emaciated and feeble, her appearance ghostly. She sought every remedy in the medical texts, but none worked. Then a transcendent from Shaoshi Mountain instructed her to take this elixir. After a year, all her ailments vanished, her body became robust and radiant, her skin fair and rosy, her steps light and swift, her hearing and vision sharp.\n\nAfter five years, one’s appearance grows ever more youthful, its efficacy beyond measure.\n\nIt further cures all wind-induced ailments of the waist and legs, hemiplegia, numbness and paralysis of the hands and feet, partial paralysis, the Five Labors and Seven Injuries, hemorrhoids and fistulas with unbearable pain that pierces the heart, sweat soaking through garments as in consumptive illness, dry eyes and aching feet, visceral disharmony with alternating diarrhea and dysentery—all such chronic, wasting afflictions vanish upon taking this elixir, their roots eradicated.\n\nFor epidemic heat diseases, miasmic vapors, seasonal pestilences, and consumptive contagions that claim nine out of ten lives, this remedy alone brings timely recovery.\n\nIt also treats women suffering from postpartum blood dizziness, rushing upward to the heart, or unremitting red-and-white vaginal discharge threatening life. Simply combine the *changpu* pills with a small amount of *danggui*, decoct in a bowl, and take hot—relief is immediate.\n\nFor men burdened by heavy legs, splitting headaches, leaden limbs, and enfeebled pulses, barely able to walk without stumbling or sit without support, this elixir swiftly restores health.\n\nAll ailments of men and women alike fall within its dominion.\n\nThe elixir possesses Five Virtues, corresponding to the Five Phases:\n- The green *qi* enters the herb as the East,\n- The white *qi* enters the stem as the West,\n- The red *qi* enters the flower as the South,\n- The yellow *qi* enters the heart as the Center,\n- The black *qi* enters the root as the North.\n\nIt further strengthens bones and marrow, replenishes vital fluids, fills the blood and nourishes the brain, moistens the Five Viscera, benefits the Six Bowels, stimulates the appetite, relieves dryness of the skin, fortifies teeth and gums, stabilizes the hun and po souls, augments vitality, dispels chills and fevers, harmonizes the hundred pulses, and ensures the well-being of the four limbs.\n\nFor the superior practitioner, it guarantees eternal life.\nFor the middling practitioner, it extends years and preserves youth.\nFor the inferior practitioner, it wards off all illness.\n\nIt dissolves every malady. For those of pure intent who cultivate the Dao, its consumption grants divine powers as recorded.\n\nThose who attained transcendence through *changpu* are named below:\n- Master Kou, who achieved immortality by consuming *changpu*—to this day, *changpu* grows before his temple.\n- Zheng Yu, who attained immortality after twenty years;\n- Gai Chuo, after ten years;\n- Daoist Guan He, after ten years;\n- Zhou Lu, after ten years;\n- Mother and son of the Zihong family;\n- Wang Liang, at eighty-two, after ten years;\n- Lu Yuan of the Shaoshi Immortals, after ten years;\n- Xiao Guang, after ten years;\n- Mother and son Yan Cunzhen of Shaoshi Mountain, after ten years;\n- Wang Xing of Henan, after ten years;\n- Zhang Shiheng of Heyang;\n- Zhou Zhongdao, magistrate of Wangwu County (initially, a commoner named Rong Hong from the same county also achieved transcendence);\n- Li Liang of Haiyi;\n- Wang Pei of Chuzhou, who ascended to heaven in broad daylight after eighty years of consumption.\n\nThe *Immortals’ Records* state: *The Twelve Scrolls of the Changpu Transmission* are kept in the highest sanctum. This is fully documented in the *Shangqing Scripture*; here, only the essentials are excerpted for those who seek the Dao.\n\nIts efficacy is no deception. Those who single-mindedly gather the herb and consume it according to the method will surely prolong their years. Yet if petty men who scorn the Dao forcefully slander and fabricate falsehoods, they invite early demise.\n\nThough this formula is authentic, it should be transmitted only to worthy gentlemen and Daoist practitioners. It must not be lightly disclosed—guard it well.\n\nHere ends the transmission of the divine *changpu* nine-pill recipe.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "神仙服食灵草菖蒲丸方传 经名：神仙服食灵草菖蒲九方传。 撰人不详。 文中提及『大历十四年』，应为唐代着作。 一卷。 底本出处：《正统道藏》洞神部方法类。 神仙服食灵草菖蒲丸方传 夫菖蒲者，水之精，神仙之灵草，大圣之珍方，游山隐士，遁世潜人，皆服之。 梁武帝志骯经典，心在仙方，搜求智士，访觅贤人。 时景龙中，吕娄云进表曰：昔中散大夫东方朔，汉武帝时仙人也。 惟敬尚服菖蒲，伏愿陛下依之。 梁主效而服之，百病消除，聪明爽利。 帝乃叹曰：天灵地精，以神为主。 仙人以道为尊，禀淳和，以药为本。 菖者盛也，蒲者普也，精者灵也。 能广救诸病，延年益寿强志，童颜日驻，岂不是仙草者也。 菖蒲奇哉，兼窃效之，朝夕依法服之，甚有验矣，不唯男女老少服之，尤有增益。 每为鬼神之所保护，世人莫测其由，服之百无所忌。 若体热，即以秦胶一两钱，一盏水煎，待冷饮之即定，盖与菖蒲为使也。 时大历十四年。 按渊明日：但以九月九日，采取菖蒲，炎日乾之，杵为散，以糯米糊，合之成丸。 又一法，《太清经》说神仙灵草菖蒲采取法，以三月三日，四月四日，五月五日，六月六日，七月七日，八月八日，九月九日，十月十日，采之时，须是清静石上水中生者，仍须南流水者，北流水者不堪。 又一法，拣挣地生处采之，当日收采，於当处去根上毛，令诤，以物盛之，水中争洗，去浊汁，坚头薄切，以好日色曝乾，杵罗，好日合之作糊，法用陈糯米，经宿浸淘，去坩汁，砂盆中细研，澄滓煮熟，以散搅和熟没，众人为丸，如梧桐子大，曝乾，合中贮之，初服十丸，嚼一口饭，和丸一时咽下，后即酒下。 便吃点心饭，尤佳。 百无所忌。",
      "translated_text": "*The Divine Immortals’ Formula for Consuming the Sacred Herb Acorus Pill*\n*Text Title:* *Transmission of the Divine Immortals’ Formula for Consuming the Sacred Herb Acorus Pill*\n*Author:* Unknown\n*Dated:* References to the fourteenth year of the Dali reign (779 CE) suggest a Tang dynasty composition.\n*Volume:* One fascicle\n*Source Text:* *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, Methods Category\n\n---\n\nThe herb *changpu* (acorus) is the essence of water, the sacred herb of divine immortals, and a treasured formula of the great sages. Recluses wandering the mountains and those who withdraw from the world in seclusion all consume it.\n\nEmperor Wu of Liang, devoted to the classics and aspiring to immortality, sought wise scholars and virtuous men. During the Jinglong era, Lü Louyun submitted a memorial stating: \"In the past, Dongfang Shuo, the immortal of Emperor Wu of Han’s court, revered and consumed *changpu*. I humbly beseech Your Majesty to follow his example.\"\n\nThe Liang sovereign emulated this practice, and after taking it, all illnesses vanished, his mind sharpened, and his spirit grew clear. The emperor sighed: \"The numinous of heaven and the essence of earth take the divine as their master. Immortals revere the Dao as supreme, receiving the pure harmony of *qi*, with herbs as their foundation. *Chang* means ‘flourishing,’ *pu* means ‘universal,’ and *jing* means ‘numinous.’ This herb broadly cures all ailments, extends years, strengthens the will, and preserves youthful complexion—is it not truly the herb of immortals? How wondrous is *changpu*! I have secretly followed this method, consuming it morning and night according to the formula, and found it profoundly effective. Not only do men and women, young and old, benefit from it, but its advantages are even greater. Those who take it are protected by spirits and gods, though the world cannot fathom its reason. There are no taboos against its use. If one experiences heat in the body, boil one *qian* of *qinjiao* (gentian) in a cup of water, let it cool, and drink it to settle the condition, for it serves as an assistant to *changpu*.\"\n\nRecorded in the fourteenth year of the Dali reign.\n\n---\n\nYuanming notes: On the ninth day of the ninth month, gather *changpu*, dry it in the sun, pound it into powder, mix it with glutinous rice paste, and form it into pills.\n\nAnother method, from the *Taiqing Scripture*: The divine immortals’ sacred herb *changpu* should be gathered on the third day of the third month, the fourth day of the fourth month, the fifth day of the fifth month, the sixth day of the sixth month, the seventh day of the seventh month, the eighth day of the eighth month, the ninth day of the ninth month, or the tenth day of the tenth month. When collecting it, choose only those growing in clear, still waters upon rocks, preferably in south-flowing streams—those from north-flowing waters are unsuitable. Alternatively, select plants growing in pure soil, harvest them on the same day, remove the root hairs on the spot, clean them thoroughly, place them in a vessel, and rinse them in water to remove impurities. Cut the firm parts into thin slices, dry them in good sunlight, pound them through a sieve, and on a propitious day, prepare a paste. Use aged glutinous rice, soak it overnight, rinse it to remove impurities, grind it finely in a stone mortar, strain the dregs, and cook it until thick. Mix the powdered *changpu* into the paste until fully incorporated, then have several people roll it into pills the size of *wutong* seeds. Dry them in the sun, store them in a container, and begin by taking ten pills. Chew a mouthful of rice, swallow the pills with it, then wash them down with wine. Eating a light meal afterward is especially beneficial. There are no taboos against its use.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 667,
      "start_sentence": 0,
      "end_sentence": 24,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.393544673919678,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\神仙服食灵草菖蒲丸方传.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "服经十月，能消食。 两月，除冷疾。 三月，百病痊。 而至四年，精神有余。 五年，骨髓充满。 六年，颜色光泽，状如童子。 七年，发白再黑。 八年，齿落重生。 九年，皮肤滑腻。 十年，面如桃花。 十一年，骨轻。 十二年，永是真人，长生度世，颜如芙蓉，役使万灵，精邪不近，祸患永消。 此药大仙服之上升，世人莫知。 仆因见《上清经》文中，具载功效。 凡世之人不合妄传，恐其怠慢也。 其得之者，镇心益气，强志壮神，填髓补精，发髭皆黑。 若能志服，永保长生也。 又法，三百三十岁亦有加者，长生度世，其菖蒲功不可当也。 人自不志，其药固不谬矣。 五日采之俱佳，刮去赢皮，薄切曝乾，一如前法，杵罗，研粳米糊和药末，得所成团，然后入铁臼中，重梼三千下为丸。 刘根曰：服菖蒲者，博览群书，日夕无倦，昼夜不寐，百神皆为侍奉。 扁鹊曰； ．菖蒲能治积年风疾，广济世人，男女有疾，悉宜服之。 昔陶潜五月五日采之，以蜜为丸，有功无忌。 若饭丸，绝妙，老幼服之，永无患害，百无所忌。 每日早辰二十五丸，日午二十五丸，晚后三十丸，不得阙废时日，一年已后，出三尸九虫，无复搔扰。 河内县道者叶敬原母，年三十五，因疾中风，四肢不举，手足瘫痪，赢瘦弱损，一似鬼形，应是方书，寻览皆遍，千药无效。 时有少室仙人，令服此药。 一年已后，百病并除，四体充悦，肌肤红白，步轻行速，耳目聪明。",
      "translated_text": "After taking it for ten months, it aids digestion. After two months, it dispels cold ailments. After three months, all illnesses are cured. By the fourth year, one’s spirit becomes abundant. By the fifth year, the marrow is fully replenished. By the sixth year, the complexion glows like a child’s. By the seventh year, white hair turns black again. By the eighth year, fallen teeth regrow. By the ninth year, the skin becomes smooth and supple. By the tenth year, the face blooms like a peach blossom. By the eleventh year, the bones grow light. By the twelfth year, one becomes a true immortal, attaining eternal life and transcending the world, with a visage like the hibiscus, commanding the myriad spirits, untouched by malevolent forces, and forever free from misfortune. This elixir allows great immortals to ascend; yet the world remains unaware. I chanced upon these effects recorded in the *Shangqing Sutra*. This must not be recklessly transmitted to the unworthy, lest they treat it with negligence. Those who obtain it will calm the mind, replenish qi, strengthen resolve, invigorate the spirit, fill the marrow, restore essence, and turn even the beard black. If one takes it with devotion, eternal life is assured. Another method states that even at three hundred and thirty years, its benefits persist, granting transcendence and immortality—such is the unmatched power of *changpu*. Yet if one lacks resolve, the fault lies not in the remedy itself.\n\nIt may be gathered on any of the five days, the outer skin scraped away, thinly sliced, and dried in the sun. Proceed as before: pound it through a sieve, mix the powder with finely ground non-glutinous rice paste, and knead into a dough. Then place it in an iron mortar and pound three thousand times to form pills.\n\nLiu Gen said: \"Those who take *changpu* will read widely without fatigue, remain wakeful day and night, and have all spirits attend them.\" Bian Que said: \"*Changpu* cures long-standing wind illnesses, widely benefiting the world. Men and women with ailments should all take it.\" Once, Tao Qian gathered it on the fifth day of the fifth month and made honeyed pills, which proved effective without taboos. If made into rice-based pills, the results are sublime. The old and young may take it without harm, and there are no restrictions.\n\nTake twenty-five pills at dawn, twenty-five at noon, and thirty in the evening, without missing any dose. After a year, the Three Corpses and Nine Worms will be expelled, and no further disturbances will arise. In Henan County, a Daoist named Ye Jingyuan’s mother, aged thirty-five, fell ill with wind-stroke, her limbs paralyzed, her body emaciated and feeble, her appearance ghostly. She sought every remedy in the medical texts, but none worked. Then a transcendent from Shaoshi Mountain instructed her to take this elixir. After a year, all her ailments vanished, her body became robust and radiant, her skin fair and rosy, her steps light and swift, her hearing and vision sharp.",
      "overlap_context": "se it to remove impurities, grind it finely in a stone mortar, strain the dregs, and cook it until thick. Mix the powdered *changpu* into the paste until fully incorporated, then have several people roll it into pills the size of *wutong* seeds. Dry them in the sun, store them in a container, and begin by taking ten pills. Chew a mouthful of rice, swallow the pills with it, then wash them down with wine. Eating a light meal afterward is especially beneficial. There are no taboos against its use.",
      "start_char": 667,
      "end_char": 1223,
      "start_sentence": 25,
      "end_sentence": 53,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.674614191055298,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\神仙服食灵草菖蒲丸方传.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "至五年，形容转少，其功莫能测度也。 又治诸风腰脚，半身不遂，手足疗痹，瘫痪偏风，五劳七伤，痔漏发来，痛不可忍，痛切连心，汗湿衣服，常如瘦病，眼涩脚疼，腹藏不调，或泻或痢，如此疾状羸啜不差，服之永除根本。 天行热病，瘴气时疫，传尸相染，十不存一，但服此药，获时痊平。 又治女人产后血晕，冲心，赤白带下，相连命绝。 但以菖蒲丸，和少当归，煎一碗，热服之，立可痊差。 又治丈夫脚重头痛，四肢沈重，百脉无力，行则欲倒，坐、则人扶，但服此药，不久而痊。 但是男女诸疾，悉主之。 其药有五德，以配五行。 青气入药，而属东方。 白气入节，而属西方。 赤气入华，而属南方。 黄气入心，而属中央。 黑气入根，而属北方。 又能坚骨髓灵液，填血补脑，润五藏，益六府，开胃口，去皮肤中乾燥，益口齿，摄魂魄，长精神，去寒热，百脉和畅，四体安康。 其药上士服之，永保长生。 中士服之，延年驻颜。 下士服之，百病不侵。 能消诸病。 若清诤学道之人，服之神通具录。 所服菖蒲得道姓名如后： 寇天师，每服菖蒲得仙，至今庙前生菖蒲。 郑鱼服二十年得仙，盖绰十年得仙，道士官和十年得仙，周鹿十年得仙，紫弘原母子得仙。 王良年八十二，十年得仙。 少室仙人鲁原十年得仙，萧光十年得仙，少室山严存真母子十年得仙，河内王兴十年得仙，河阳张士衡得仙，王屋县令周忠道得仙，初县有百姓容弘得仙，海沂人李亮得仙。 处州王陪服此药八十年，白日升天。 神仙云：《菖蒲传》十二卷，秘在上官。 此是《上清经》中具载，聊录要节，以示学道之人。 其卫固非诡妄，如能一志采取，依法服之，必可以延年。 如是不好道小人，强生诽谤，妄说是非，即致短折。 此方虽是，好诸君子，即可传之道人。 不许轻泄也，秘之。 神仙服食灵草菖蒲九方传竟",
      "translated_text": "After five years, one’s appearance grows ever more youthful, its efficacy beyond measure.\n\nIt further cures all wind-induced ailments of the waist and legs, hemiplegia, numbness and paralysis of the hands and feet, partial paralysis, the Five Labors and Seven Injuries, hemorrhoids and fistulas with unbearable pain that pierces the heart, sweat soaking through garments as in consumptive illness, dry eyes and aching feet, visceral disharmony with alternating diarrhea and dysentery—all such chronic, wasting afflictions vanish upon taking this elixir, their roots eradicated.\n\nFor epidemic heat diseases, miasmic vapors, seasonal pestilences, and consumptive contagions that claim nine out of ten lives, this remedy alone brings timely recovery.\n\nIt also treats women suffering from postpartum blood dizziness, rushing upward to the heart, or unremitting red-and-white vaginal discharge threatening life. Simply combine the *changpu* pills with a small amount of *danggui*, decoct in a bowl, and take hot—relief is immediate.\n\nFor men burdened by heavy legs, splitting headaches, leaden limbs, and enfeebled pulses, barely able to walk without stumbling or sit without support, this elixir swiftly restores health.\n\nAll ailments of men and women alike fall within its dominion.\n\nThe elixir possesses Five Virtues, corresponding to the Five Phases:\n- The green *qi* enters the herb as the East,\n- The white *qi* enters the stem as the West,\n- The red *qi* enters the flower as the South,\n- The yellow *qi* enters the heart as the Center,\n- The black *qi* enters the root as the North.\n\nIt further strengthens bones and marrow, replenishes vital fluids, fills the blood and nourishes the brain, moistens the Five Viscera, benefits the Six Bowels, stimulates the appetite, relieves dryness of the skin, fortifies teeth and gums, stabilizes the hun and po souls, augments vitality, dispels chills and fevers, harmonizes the hundred pulses, and ensures the well-being of the four limbs.\n\nFor the superior practitioner, it guarantees eternal life.\nFor the middling practitioner, it extends years and preserves youth.\nFor the inferior practitioner, it wards off all illness.\n\nIt dissolves every malady. For those of pure intent who cultivate the Dao, its consumption grants divine powers as recorded.\n\nThose who attained transcendence through *changpu* are named below:\n- Master Kou, who achieved immortality by consuming *changpu*—to this day, *changpu* grows before his temple.\n- Zheng Yu, who attained immortality after twenty years;\n- Gai Chuo, after ten years;\n- Daoist Guan He, after ten years;\n- Zhou Lu, after ten years;\n- Mother and son of the Zihong family;\n- Wang Liang, at eighty-two, after ten years;\n- Lu Yuan of the Shaoshi Immortals, after ten years;\n- Xiao Guang, after ten years;\n- Mother and son Yan Cunzhen of Shaoshi Mountain, after ten years;\n- Wang Xing of Henan, after ten years;\n- Zhang Shiheng of Heyang;\n- Zhou Zhongdao, magistrate of Wangwu County (initially, a commoner named Rong Hong from the same county also achieved transcendence);\n- Li Liang of Haiyi;\n- Wang Pei of Chuzhou, who ascended to heaven in broad daylight after eighty years of consumption.\n\nThe *Immortals’ Records* state: *The Twelve Scrolls of the Changpu Transmission* are kept in the highest sanctum. This is fully documented in the *Shangqing Scripture*; here, only the essentials are excerpted for those who seek the Dao.\n\nIts efficacy is no deception. Those who single-mindedly gather the herb and consume it according to the method will surely prolong their years. Yet if petty men who scorn the Dao forcefully slander and fabricate falsehoods, they invite early demise.\n\nThough this formula is authentic, it should be transmitted only to worthy gentlemen and Daoist practitioners. It must not be lightly disclosed—guard it well.\n\nHere ends the transmission of the divine *changpu* nine-pill recipe.",
      "overlap_context": "r disturbances will arise. In Henan County, a Daoist named Ye Jingyuan’s mother, aged thirty-five, fell ill with wind-stroke, her limbs paralyzed, her body emaciated and feeble, her appearance ghostly. She sought every remedy in the medical texts, but none worked. Then a transcendent from Shaoshi Mountain instructed her to take this elixir. After a year, all her ailments vanished, her body became robust and radiant, her skin fair and rosy, her steps light and swift, her hearing and vision sharp.",
      "start_char": 1223,
      "end_char": 1935,
      "start_sentence": 54,
      "end_sentence": 85,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.87123465538025,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\神仙服食灵草菖蒲丸方传.txt",
        "category": "方法类"
      }
    }
  ]
}