{
  "source_id": "神仙服饵丹石行药法",
  "source_file": "chunked_daozang\\神仙服饵丹石行药法.json",
  "total_chunks": 11,
  "total_original_chars": 10223,
  "total_translated_chars": 54982,
  "total_translation_time": 290.5175805091858,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\玉诀类\\神仙服饵丹石行药法.txt",
    "category": "玉诀类"
  },
  "full_translation": "**The Divine Immortals’ Methods for Ingesting Elixirs, Minerals, and Medicinal Substances**\n\n*Scripture Title:* *The Divine Immortals’ Methods for Ingesting Elixirs, Minerals, and Medicinal Substances*\n*Attributed to:* Master Jingli, likely composed during the Tang dynasty.\n*Contents:* Thirty-eight methods for refining and ingesting immortal elixirs and mineral medicines.\n*Volume:* One.\n*Source Text:* *Daoist Canon of the Zhengtong Era*, *Dongxuan Section*, *Jade Instructions Category*.\n\n---\n\n**The Divine Immortals’ Methods for Ingesting Elixirs, Minerals, and Medicinal Substances**\n*By Master Jingli*\n\n### **The Yellow Emperor’s Method for Ingesting Single-Substance Elixirs**\nTake one *jin* of fine cinnabar. For a single-substance elixir, first purify yourself for seven days in a clean and secluded place. On a high mountain, avoid the shady side, and gather cinnabar according to the following method. Pound it thoroughly, then place it in a copper tray. Add nine *sheng* of pure, aged wine, mixing the cinnabar within. Do not let others witness this, lest the spirits fail to enter.\n\nEnter the altar beginning from the eastern gate, then the southern gate, then the western gate, and finally the northern gate. Present the medicine at the center. Stir it for three days, then again from three to five, and once more on the seventh day. From seven to nine, return to stirring from three, then to five as before.\n\nAfter twenty days, when the medicine is dry enough to form pills, roll it into pellets. If not yet dry, repeat the previous method. In case of overcast or rainy weather, keep the copper tray covered until the pills are properly formed. Shape them like small beans, and swallow three daily. After fifty days, your wisdom and perception will sharpen. After nine years of continuous ingestion, you will commune with Heaven and Earth. After three thousand four hundred and twenty-four days, the Dao will be perfected, and all your desires will be fulfilled.\n\nThis *Zhuguang Divine Elixir* is the essence of cinnabar. Avoid moxibustion, acupuncture, and passing by households with newborns, lest its spiritual efficacy be lost.\n\n### **The Divine Immortals’ Method for Ingesting Cinnabar**\nTake high-quality, unyielding cinnabar and grain kernels—just these two substances. The amount of cinnabar may vary; pound it thoroughly. Extract juice from the grain, mix it with the cinnabar to form a paste, and place it in a copper cylinder, sealing it tightly. Invert a ceramic bowl over it and set it in a steamer. Pack dry silkworm droppings around the cylinder within the steamer, pressing firmly to a depth of no more than four *cun*. Cover the top with dry earth until full. Place the steamer over a cauldron, seal the joints with white clay, and steam over a fierce fire for three days and nights. Remove the medicine when it becomes viscous.\n\nBreak it into pieces the size of large beans. Place one in your mouth, and it will dissolve instantly. Take three doses daily. After one year, your body will become light, your vision clear, and all illnesses will vanish. After two years, ghosts and spirits will pay homage. After three years, you will commune with the essence of the sun and moon.\n\nOne who regularly consumes this will hear parrots singing in the clouds and dogs barking in the heavens. The grain kernels must be purely red and white.\n\n**Three-Ingredient Elixir of Cinnabar for Lightening the Body and Augmenting Qi**\nOne *jin* of cinnabar the size of sesame seeds, one *dou* of fine large jujubes, and one *dou* of pure clear wine. For these three ingredients, grind the cinnabar to a fine powder, sift it through silk, and place the wine in a copper vessel. Add the cinnabar and stir until well blended. Position it over charcoal, keeping it three to four *cun* from the fire, and bring to a boil, stirring frequently to prevent settling. Take the jujubes, boil them in two *dou* of water, then strain to remove skins and pits, retaining only the juice. Gradually add this to the cinnabar mixture, ensuring the liquid never runs dry, until it thickens like malt sugar. Remove and store in a jar. Each evening, swallow a pill the size of a jujube. After twenty days, one will perceive the effects. After thirty days, illnesses will be cured, the body will feel light, the hair will darken, lost teeth will regrow, and black hair will flourish with vitality.\n\n**Three-Ingredient Elixir of the Immortals**\nThree *jin* of cinnabar, three *jin* of lead, and nine *sheng* of grain juice. For these three ingredients, divide the grain juice, using six *sheng* to grind the cinnabar until exhausted. Then add the lead and grind until the lead is no longer visible. Mix with the remaining three *sheng* of grain juice, place in a copper vessel, cover with a ceramic bowl, and set in a steamer. Steam over mulberry firewood for three days and nights. The lead will revert to cinnabar, drawn forth by the elixir. Roll into pills the size of small beans. Take three pills daily. After twenty days, effects will manifest. After three years, one will ascend to heaven. When grinding cinnabar and lead, place them over a bright fire in sunlight to ensure proper refinement.\n\n**Four-Ingredient Elixir of the Immortals**\nFive *jin* of cinnabar, three *sheng* of fine honey, purely red paper mulberry fruit, and clear wine. Grind the four ingredients, extract juice from the paper mulberry fruit, and soak the cinnabar in it. Dry in the sun, then soak again, repeating until fully saturated. Place in a large bamboo cylinder and steam beneath the cinnabar for three days and nights. Remove and transfer to a copper cylinder, simmer in hot water, then soak in pure clear wine until saturated. Add honey and simmer for three days and nights until it resembles malt sugar and does not soil the hands. Consume pills the size of jujubes, taking two daily. After one hundred days, immortals will come to greet you. After one year, jade maidens will welcome you, and you will become a Perfected One.\n\n**Refined Elixir of Cinnabar for the Perfected One**\nGrind one *jin* of cinnabar into fine powder, sift through double-layered silk until impalpably fine. Moisten with pure wine containing no water, stirring until it resembles sealing clay. Place in a copper tray, set in a high location, and ensure no woman sees it. Expose to sunlight, stirring occasionally to prevent drying, and remoisten as needed to maintain a clay-like consistency. If rain or strong winds arise, cover and conceal it in a secluded place; when the weather clears, resume sun-drying. Repeat until three *dou* of wine are exhausted, then sun-dry for thirty days until it turns purple. When it can be grasped without soiling the hands and stretches like malt sugar, it is ready. If it sticks to the hands, further refinement is needed. Typically, three *jin* of cinnabar are refined to last three years. For three *jin* of cinnabar, use nine *dou* of wine and dry in a large tray.\n\nBefore refining, bathe with orchid and angelica, observe a seven-day fast, and ensure no women approach the medicine. Before consumption, fast for five days, bathe, and then take the elixir. The pills should be the size of sesame seeds. Swallow three at dawn daily. After one day, the Three Worms will emerge. After five or six days, all illnesses of the heart and abdomen will manifest and depart. After one year, white eyebrows will turn black. Increase the dosage by one pill each year, up to nine pills. After three years, divine beings will arrive. A woman clad in purple silk, bearing a tray of food, will appear—accept and eat it without fear. All things will come to serve you, and spirits will obey your commands. This is called \"Supreme,\" also known as \"Possible,\" or \"Necessary.\" These three names empower all things, and all things may be summoned. One may enter metal, wood, water, fire, and earth, and these five phases will assume their forms as needed, like left and right hands. There is nothing it cannot accomplish.\n\nTo summon spirits, abstain from the five pungent vegetables, raw greens, raw fish, and dog meat. Avoid sexual intimacy and stay clear of sunrise and midday sun. After one year of this regimen, divine clarity will reveal all within a thousand *li*. After three years, you will perceive beyond three thousand *li*, your lifespan will extend, and you will see from without to within, from the eastern wall to the western. Then you shall become a *zhenren*.\n\nThis method was transmitted by Yongren’s Wang Ji, who received it from Shu’s Ma Mingsheng. Ma Mingsheng received it from Wang Ziqiao, who received it from Chisongzi, who received it from Xianmen Zigao, who received it from Ma Zuoshi. This method is secret and must not be carelessly transmitted. Qin Zixu practiced it and found it effective. Orchid and angelica are used for their fragrance.\n\nThe so-called \"metal, wood, water, fire, and earth\" mean that when placed upon wood, it becomes wood; when placed upon metal, it becomes metal.\n\n**Another Elixir: Cinnabar**\nTake one *jin* of cinnabar. Pound it thoroughly, then mix with three *sheng* of pure bitter wine and two *sheng* of refined lacquer. Simmer over a gentle flame until it can be formed into pills the size of sesame seeds. Take two pills twice daily. After forty days, all ailments of the abdomen will be cured, and the Three Corpses will depart. After one hundred days, the body will grow firm and strong. After one thousand days, the Controller of Destinies will erase your name from the register of death, and you will be preserved as heaven is preserved, gazing upon the sun and moon. Your form will transform, your appearance will shift, and you will change without constancy, casting no shadow at noon.\n\n**Another Elixir: True Cinnabar**\nTake one *jin* of true cinnabar and six *liang* of rhubarb. Steam the rhubarb in a cauldron until it has undergone two cycles, then grind it finely. Combine with the cinnabar, seal in a bamboo tube, and thin the tube’s walls. Use two cauldrons to steam it through two more cycles until the medicine is complete. Remove and place in a mortar, pounding it a thousand times. Take half a *qian* three times daily, always before meals. It is highly effective for treating *zheng* diseases, dispelling malign black fluids, and curing all ailments of the heart and abdomen. It also remedies consumptive exhaustion. Pounding it two thousand times is even better. For illnesses of three years’ duration, a full dose will bring cure. Adjust the dosage according to the severity of the illness.\n\nThe use of two cauldrons ensures the decoction remains clear. Bamboo, whether fresh or dried, may be used.\n\n**Han Zhong’s Elixir**\nTake ten *jin* of cinnabar and refine it. Extract juice from fully ripe paper mulberry fruit and knead it into the cinnabar—more juice yields better results. Place in a bamboo tube and steam the cinnabar beneath it for three days and nights. Remove and place in a bronze vessel, simmering in broth until the fat and essence are clear, with just enough wine. Add three *sheng* of honey and simmer for three days and nights until it resembles malt sugar, leaving no residue on the hands. Consume portions the size of a jujube pit twice daily. After one year, a jade maiden will come to welcome you, and you shall become a *zhenren*. When the *zhenren* and immortals consume this elixir to completion, and their merit is fulfilled after nine years, the time will come for them to ascend. Their spiritual powers will be complete, and they shall ascend to the Golden Gates and Jade Capital.\n\n**Nine Radiant Knife-Points of Divine Elixir**\nTake ten *liang* of divine cinnabar refined into true vermilion and ten *liang* of mercury, placing both in a bronze vessel. In a larger bronze vessel, melt one *jin* each of lead and tin. Place the vessel containing the cinnabar and mercury over the molten lead and tin, applying gentle heat above and stronger heat below. When the tin and lead have melted and blended with the mercury, the cinnabar will transform into the elixir. Take the prepared elixir at dawn, facing the sun, and consume one knife-point with well-water once daily. You may then ascend in flight or descend into the earth. After one thousand days of this regimen, a jade maiden will arrive, and a cloud chariot will come to welcome you. The Grand Unity will converse with you.\n\nBeware of women—do not engage in intimacy. Avoid defilement by the impure, such as those in mourning, women who have given birth, or those who have died. Do not even touch them with your hands, for contact defiles the spirit. Defilement of the spirit prevents longevity, and the Dao of immortality will be lost.\n\n**Flowing Elixir**\nThe flowing elixir is cinnabar. Grind it in a bronze mortar until thoroughly refined. Use three *jin* per dose. After one hundred days, the effects will be excellent.\n\nFive *dou* of clear wine are used to steep one *sheng* each of large and small peppercorns; strain immediately and discard the dregs. Mix the liquid with flowing pearls until it resembles hot water. Store in a bronze vessel, place over a fire, and stir frequently until the liquid evaporates. Add more wine and elixir pearls, and the substance may extend several *chi*, resembling silk threads—thus the medicine is complete. At dawn, face the sun and consume a pill the size of a small red bean, three times daily. Take before meals; after one hundred days, all illnesses will vanish, and your lifespan will equal that of heaven and earth. The \"large peppercorn\" refers to Sichuan pepper, while the \"small peppercorn\" is Qin pepper. This remedy is also highly effective for treating severe wind disorders.\n\n**Consuming Yue Elixir**\nGrind one *jin* of true Yue elixir with pure clear wine until thoroughly blended, then simmer over boiling water for three days and nights, stirring without pause until it can be drawn into strands. Form into pills the size of soybeans. Take one pill twice daily to eliminate all diseases, pacify the spirit within the abdomen, and prolong life with long-term use.\n\n**Another Yue Elixir Method**\nGrind one *jin* of Yue elixir finely and place it in a bronze vessel with three *dou* of pure clear wine. Continuously pour and stir the wine while simmering over boiling water, always stirring counterclockwise. After three days and nights, when it can be drawn into strands, form into pills the size of soybeans. Take one pill twice daily to restore jade-like luster to the skin, turn white hair black, regrow fallen teeth, and smooth facial wrinkles.\n\n**Consuming Sun-Exposed Elixir**\nUse refined cinnabar in any quantity, grind it finely, and place it in a bronze vessel. Mix with white honey to form a paste, seal the vessel tightly, and lacquer the seams to ensure airtightness. Unseal it on the same day the following year, expose the contents to the sun to dry, then mix with honey and form into pills the size of soybeans. Take one pill twice daily to cure all diseases. Long-term use grants longevity and immortality.\n\n**Consuming Waist-and-Abdomen Elixir**\nGrind three *jin* of cinnabar into fine powder, place it in a double-layered silk pouch, and insert it into the abdomen of a pig. Sew the abdomen closed, steam it over glutinous millet, and cook with mulberry firewood for three days and nights. Remove the elixir, form into pills with white honey the size of soybeans, and take two pills three times daily to eliminate all illnesses and attain immortality with extended use.\n\n**Parrot Elixir**\nSelect pure white male and female parrots, raise them separately, and obtain their eggs. Remove the yolk and white, mix with finely ground cinnabar, and return the mixture to the eggshell. Seal the opening tightly with wax and let the white parrot incubate the egg. When the chick hatches, the medicine is complete. Mix with honey and form into pills the size of soybeans. Take two pills three times daily; long-term use grants longevity and immortality.\n\n**Divine Immortal’s Refined Consumable Returned Elixir**\nTake one *liang* of cinnabar and one *jin* of Qin silver. Place the Qin silver in a bronze tray and expose it to the sun during the fifth or sixth month. Sprinkle the finely ground cinnabar over the silver and stir continuously with a large knife from breakfast until dusk, until the silver transforms entirely into elixir. Place the elixir in a Danyang bronze vessel, cover it, and coat the vessel with dog-hair clay to a thickness of two *cun*. Dry it in the sun, then heat it with horse-dung fire for nine days and nights. Remove the elixir, store it in a white silk pouch, and place it inside a crow’s abdomen. Sew the crow shut, boil it until cooked, then remove the elixir and form it into pills the size of sesame seeds. At dawn, face the sun and swallow one pill with well-water, three times daily. After one hundred days, divine spirits will appear in your hair. After two hundred days, your body will become light, and all ailments will be cured.\n\nAfter three hundred days, you will be able to ascend above the clouds—this is called the *Jiuliu Pearl*.\n\n**Divine Immortal’s Elixir of Rhubarb**\nTake twelve *liang* of rhubarb elixir and two *jin* four *liang* of mercury. Mix these two ingredients with pure wine until thoroughly saturated, then stir them well. On a summer day at the *si* hour, place them in a bronze vessel and expose them to the sun. When the sunlight fills the chamber, stir until the mixture resembles two *dou* of cooked rice, and it will soon transform into elixir. Soak it in pure wine, blend it evenly, and stir again—it will revert to silver. Expose it to the sun until it resembles two *dou* of cooked rice, and it will soon transform back into elixir. Mix it with wine and expose it as before, and it will turn to silver again. Repeat the process until, after three transformations into silver and four into elixir, it becomes divine elixir. Always prepare it on a *wangxiang* day at the quiet hour when the sun is directly overhead, facing south while stirring. Thus it is said: \"The mother gives birth to yang; stand in the noon direction.\" It is called *Chuhuang*, also known as the essence of *liuzhu*, or *liuhuang*. When transformed into divine elixir, it is also called *red salt*. This is the essence of all things, granting immortality. After one year of ingestion, the body will be full within and radiant without, the face and eyes will glow, white hair will turn black, and fallen teeth will regrow. After two years, you will enter the celestial gates and glimpse divine beings. After three years, you will ride clouds and mount dragons, becoming a *zhenren*.\n\n**Divine Immortal’s Elixir of Ba**\nTake one *jin* of *Ba* elixir and six *liang* of *rong* salt, grind them together, and place them in a bronze vessel. Cover it for three days, then soak in half a *dou* of pure wine for one night. Decant the clear liquid, and if the saltiness remains, soak again in half a *dou* of wine for another night until the salt is fully dissolved. Mix with white honey and steam with three *dou* of polished rice, cooking it in the center for three days and nights until the medicine is ready. Ingest a pill the size of a small bean, facing the sun, and swallow it with well-water. You will remain youthful for years without aging.\n\n**Mountain Recluse’s Elixir**\nFirst, dig a pit three *chi* deep and line it with yellow clay, plastering the exterior to a thickness of three *cun*, ensuring it is firm and dry without cracks. Place a one-*dan* iron cauldron inside and plaster it as well. Pour six or seven *dou* of water into the cauldron, then place a three-*dou* earthenware pot atop it to hold one *jin* of refined elixir. Mix the elixir with five *sheng* of mulberry root juice until well combined, then cover it with another earthenware pot. Seal the edges of both pots and the iron cauldron with yellow clay, ensuring no qi escapes. Heat with mulberry firewood, regulating the flame to prevent boiling over, and replenish the water in the cauldron to prevent the juice from drying out. Once done, coat it with honey and repeat the process for three days and nights. Then, open the upper pot, pour five *sheng* of clear wine into the medicine, and stir well. Seal it again and repeat for another three days and nights. Remove the elixir, place it in a bronze vessel, add five *sheng* of white honey, and stir until well mixed. Float the bronze vessel in the cauldron’s hot water and simmer over a low flame for three days and nights, stirring until it can be formed into pills. After nine days and nights, the medicine is complete. Take two pills the size of sesame seeds, twice daily. Increase by one pill each day until reaching ten, then return to two pills as before. After thirty days, the body will feel light; after sixty days, hearing and vision will sharpen; after a hundred days, all illnesses will be cured; after two hundred days, the mind will long to fly. After three years, you will become immortal, enduring as long as heaven and earth.\n\n**Divine Immortal’s Elixir for Curing Illness, Prolonging Life, and Reversing Aging**\nTake one *jin* of cinnabar, finely ground and refined. Add two *sheng* of pure lacquer, one *sheng* of white honey, and three *sheng* of good bitter wine. Combine these four ingredients in a bronze vessel and simmer over a low flame, stirring frequently until fragrant and pliable enough to form pills. Ingest one pill the size of a sesame seed—after forty days, the body will become strong, and all illnesses will vanish. After a hundred days, the *sanshi* parasites will depart. After a thousand days, no evil will assail you, and you will gain the power of flight and transformation, moving effortlessly wherever you go. You will alter your appearance at will, passing unseen, and at noon, cast no shadow. This is the most secret elixir of the immortals, not to be transmitted lightly. Avoid consuming pork, raw fish, and all sour or pungent foods while taking this medicine. To prepare it, seek solitude and quiet, and do not let more than two people witness the process, lest the medicine fail.\n\n**Divine Immortal’s Elixir of Realgar**\nThe treasure of heaven and earth, hidden in the central pole, is called *cihuang*. After a thousand years, *cihuang* transforms into realgar; after another thousand years, realgar becomes gold. Ingesting gold makes one a *zhenren*. Yet the method for consuming gold is subtle and difficult to perfect. Nothing surpasses realgar for lightening the body and replenishing qi. To prepare realgar, take one *jin* of the finest quality, grind it to powder, and mix it with three *sheng* of pure wine in a bronze vessel. Simmer over white charcoal on a low flame, keeping it slightly boiling without overcooking, until it resembles glue. Add two *sheng* of good lacquer, strain out the dregs, and stir into the mixture until well combined. Form into pills the size of soybeans. Before meals, soak one pill and swallow its juice, three times daily. After ten days, all illnesses will be cured. After twenty days, the skin will darken from head to toe, and you will walk as a *zhenren*, warm in cold and cool in heat. After a hundred days, the intestines will grow thick, the skin firm, the sinews strong, the bones resilient, and the ears and eyes sharp. All afflictions will vanish. After three hundred days, take pills the size of millet, three times daily, as a regular practice. The best realgar comes from Wudu, selected for its yang color—bright and pure. Take one *jin* and grind it to an extremely fine powder. Add half a *jin* of mercury and six *liang* of mica, both ground to a fine powder.\n\nCombine three *sheng* of white honey with the mixture and store in a bamboo tube, thinning its walls by shaving. Seal the mouth with a wooden plug, then place it beneath millet grains. After five days and nights, remove and immerse in water, drawing it out like silk—thus it will not soil the hands nor cling to grass or earth. Swallow one pill the size of a soybean daily as a regular practice, and you will be preserved with Heaven and Earth; do not recklessly transmit this.\n\nFor true yang realgar, select the brightest and purest red. Use as much as desired, place in a cauldron, and cover with another cauldron, sealing the edges to prevent leakage. First, use dog’s hair as a substitute, then mix with talc and red halloysite, applying a water-based coating three *fen* thick. Once dry, the upper cauldron need not be sealed. Fashion an iron fork to suspend the cauldron five *cun* above the ground, and heat with reed firewood. Shape three clay pellets and place them atop the cauldron; dry them, then add another pellet, repeating until all three are used. When cold, brush the substance with a parrot feather. Insert the medicine into the fatty intestines of a pig, tie both ends, place in a bronze vessel, cover, and nestle in a jar filled with yellow earth. Steam for one day and night, then add another intestine; after three days and nights, using three intestines in total, it may be drawn out. Form into pills the size of a crossbow pellet, and swallowing one will allow you to drink the Jade Nectar.\n\nAnother method for consuming realgar as an immortal’s elixir:\nThe *zhenren*’s realgar elixir is worth a thousand gold; consuming it grants boundless union with Heaven and Earth. It may be drawn out to a length of three *chi*. The method: take one *jin* of fine realgar, place in a bamboo tube, and cover with a larger tube. Add six *liang* of white honey, five *liang* of mica powder, and eight and a half *liang* of mercury. Seal tightly to prevent leakage, place amid millet grains, and steam for five days and nights. Remove and rinse in water until it resembles silk—thus the elixir is complete. Consume one pill the size of a crossbow pellet daily.\n\nAnother method for consuming realgar to cure illness, repel toxins, and prolong life:\nTake one *jin* of realgar, grind to a powder with two and a half *sheng* of rice, and add six *liang* of mica, also ground. Mix with three *sheng* of white honey, store in a bamboo tube, thin its walls by shaving, and seal the mouth with a wooden plug. Steam amid millet grains for five days and nights, then immerse in water, drawing it out like silk—thus it will not soil the hands nor cling to grass or earth. Consume one pill the size of a soybean daily as a regular practice, and you will endure with Heaven and Earth, attain immortality, transcend the world, commune with the divine, ascend as an emissary of the Great One, and subdue all spirits at will.\n\nThe Great One’s elixir of two substances—mercury and realgar:\nTake one *jin* each of realgar and mercury. First, refine the realgar and steam it in rice for three days and nights. Then combine with mercury, grinding until thoroughly mixed, and place in a bronze vessel. Set within rice, covering with five *dou* of millet, and heat with mulberry firewood until the vapor ceases. Repeat the process fifteen times, after which it will liquefy. Remove and melt over charcoal until it becomes water, then place on warm earth. Return to the charcoal fire; the medicine will turn purple. Take one *daogui* of powder and mix with one *jin* of lead—thus the substance is obtained. To consume, blend with white honey into pills the size of millet grains, swallowing one daily.\n\nAfter ten days of consumption, damp earth will no longer harm you, and no ghost will dare approach. After twenty days, you will commune with the divine, and the Dao will be fulfilled. After a hundred days, you will become an emissary of the Great One. After three years, you will achieve boundless union with Heaven and Earth, command ghosts and spirits, ascend the clouds with lightness, traverse the vast and limitless, leap through the skies, and ascend to pay homage to the Heavenly Sovereign, joining the ranks of immortals. This is transmitted among *zhenren*; fools are deluded by it.\n\nDongfang Shuo’s method for consuming realgar.\n\nHow much to use is at your discretion. Mince finely, remove the entrails from a plump duck, and place realgar inside its belly. Steam for three days and three nights, then bury it in sand. Consume pieces the size of a jujube pit, twice daily—this is especially effective.\n\n**Immortals’ Method for Consuming Realgar with Parrot Eggs**\nTake one *jin* of realgar and grind it to powder. Mix with the yolk and white of fresh parrot eggs, place in a copper vessel, and cover with another vessel, sealing the edges. Warm over a gentle fire, just enough to touch without burning, and heat continuously for three days and nights without letting the fire go out. Once cooled, open it and skim off the dross; the clear substance below will surge like mercury, hardening when cold and softening when exposed to human *qi*. From one *jin*, you will obtain ten *liang*. Store in a bamboo tube, shielding it from wind. Consume pieces the size of sesame seeds to make the skin lustrous as jade, warm in winter, cool in summer, and ward off all cold *qi*.\n\n**Immortals’ Single-Ingredient Realgar Elixir for Longevity**\nTake three *jin* of realgar. Prepare a single-ingredient elixir by placing it in a cauldron, sealing the lid with dog hair and mud to prevent leaks, ensuring an even thickness of half a *cun* and letting it dry. Place it among millet grains and steam with reed firewood. Form a mud pellet and place it on top as an indicator; when the pellet dries, the elixir is ready. Sweep off the residue from the top. Fill a pig’s large intestine with the elixir, tie both ends, and place it among the steaming millet for one day. Coat another intestine with fine lard, wrap it around the elixir, and repeat for three days and three nights, using three intestines in total. The elixir will turn white. To consume, stretch it into strands and form pills the size of a bullet; swallowing one will grant ageless longevity.\n\n**Immortals’ Realgar Elixir to Summon Jade Maidens**\nSelect realgar the color of a parrot’s crest, pound it finely, and mix with refined pine resin. Consume one pill the size of a bullet daily. After ten days, the three corpse-worms in your abdomen will be expelled, and your complexion will clear. After twenty days, all illnesses will vanish, and your hearing and vision will sharpen. Store the elixir and consume two small bean-sized pills daily. After a hundred days, the Everlasting Yang Maiden will appear. After two hundred days, the Azure-Waisted Jade Maiden, her form like jade, will come adorned with yellow ornaments the size of large millet grains on her nose or philtrum—this is the true Jade Maiden. If you wish to take her as a wife, do not marry another. She will say, \"I see you consume the divine elixir, your essence and *qi* ascending to penetrate the Cavern-Heavens. Heaven has sent me to be your bride.\" You may ask her, \"I have heard of the celestial Flower Pool wine and Orchid Spring nectar—might I taste them?\" The Jade Maiden will fetch them for you to drink, and you may then take her as your wife. From then on, you will forever accompany her, riding a feathered chariot through the Nine Heavens and roaming the Six Directions. Continue the elixir without cease to preserve yourself alongside Heaven and Earth. Beware: do not lend your clothing or sandals to others, for the elixir’s essence is volatile. Prepare this elixir in seclusion for a hundred days.\n\n**Immortals’ Wine-Refined Realgar**\nTake one *jin* of realgar and pound it finely. Soak in five *sheng* of clear wine in a vessel, then face east and arrange the setup. Place the vessel in a cauldron, seal it lightly, and set a copper tray on top with water three to four *cun* deep. Seal the edges with red clay to prevent leaks. Steam with mulberry firewood, replenishing the water as it evaporates. When the elixir’s liquid is exhausted, add five *sheng* of wine five times, totaling two *dou* and five *sheng*. Adjust the fire until the elixir can be formed into pills, then stop. Do not use too fierce a fire, or the realgar will scatter and the elixir will fail. Before compounding, observe a seven-day fast in a clean, secluded place, allowing no one to witness the process. Once complete, consume two pills the size of small beans daily, washing them down with water. After a hundred days, the elixir will enter your marrow, expelling the three corpse-worms, sharpening your mind and vision, and granting you martial presence. It will repel dragons and serpents in water, tigers and wolves in the mountains, and all weapons in battle. Those who consume realgar will be invincible.\n\n**Immortals’ Refined White Realgar Elixir**\nFirst construct a double-layered earthen furnace, five *cun* wide and one *chi* long, with a chimney. Fill the center with charcoal, place the realgar at the opening (five to six *jin* as needed), and position a wooden basin filled with Dark Dragon Juice beneath to catch the elixir. Seal the setup with mud to a height of one *chi* and five to six *cun*. Heat with a fierce fire, adding charcoal as needed. Soon, the realgar will melt and drip into the trough, turning pure white like rice grains. Over time, it will harden completely and can be processed. Form into honeyed pills the size of small beans, and swallow one daily while facing the sun to repel all malevolent spirits and misfortunes. This elixir offers tenfold benefits, enhancing spiritual clarity.\n\n**Immortals’ Longevity Elixir: Refined White Realgar to Preserve Spirit, Control the Hun and Po, and Ward Off All Illnesses**\nTake fifty *jin* of realgar and place it in an iron cylinder two *chi* and two *cun* long, four *cun* in diameter at the center, three and a half *cun* wide at the base, and five *fen* thick. Mix saltpeter with water and coat the inside of the cylinder to a thickness of three *fen*, then let it dry. Crush the realgar and place it inside. Fashion an iron sieve with over a hundred holes, like a fumigation strainer, to cover the cylinder’s opening. Fill an iron tray with sesame oil and bury it halfway in the ground, leaving a small hole in the center. Place the tray’s lid over the hole, invert the cylinder onto it, and seal the edges with Six-One Mud to ensure stability. Heat with charcoal in a small, round furnace, positioning the charcoal seven to eight *cun* from the cylinder. When the cylinder glows purple-yellow, the realgar will melt and drip into the oil, forming strands one *chi* long or shorter, around seven to eight *cun*. Collect and process them as before.\n\nFor every fifty cycles above and below, when the substance turns a pure red-white like jade, dry it, grind it to powder, and store it in a cylinder. Remove the oil and replace it with clear wine, then alternate as in the method above. Repeat fifty cycles above and below, then grind it to powder again. Combine with one *dou* of *Taiyi* yuliang, mixing thoroughly, and alternate as before. Remove the wine and replace it with rendered honey, alternating as before. After thirty cycles above and below with honey, the medicine will become pure white, firm as a cake. Take daily a dose the size of a parasol-seed, five pellets. After ten days of consumption, the Three Worms will dissolve. After a month of scattered doses, the hun and po will be inwardly secured. After a hundred days, all illnesses will vanish, and the body will feel light and agile. After a year, the skin will shed like a snake’s, cold and heat will be unable to harm you, and malevolent spirits will bring no misfortune. With prolonged use, the dose may gradually be reduced, eventually to a single pellet.\n\nThe former master said: To prepare this medicine, first purify yourself through fasting and abstinence, ensuring no woman sees it, for fear of menstrual pollution, which would violate the taboo. This prohibition is most urgent and must not be neglected.\n\nThe *Divine Immortals’ Methods of Ingesting and Consuming Stones*, transmitted by Master White Stone from the Eastern Flower Realized One’s technique of boiling stones, enables one to attain immortality and transform the body in myriad ways. Those who consume stones find all illnesses cured, scars and blemishes erased, the intestines thickened and fragrant, the six viscera harmonized, the bones strengthened and qi rectified, the complexion lustrous as jade, the hun and po refined, and the Three Corpses obliterated. Stones are, after all, the parents of gold and jade. They serve to stabilize the marrow and consolidate the blood vessels, and they are also of the same kind as *qiongyao*. They can strengthen the teeth, brighten the eyes, and reverse white hair to black. The essence of gold, jade, and stone is like sesame oil, or the fat of *jusheng*. *Qiongyao* is the congealed sap of gold and jade, just as peach resin is the flowing liquid of the peach tree.\n\nThe ancients consumed *jusheng* and swiftly attained longevity. Drinking sesame oil is no less effective than taking *jusheng* powder. Peach bark yields resin, which the immortals refined, though its effects are slower than powdered forms. All things possess inherent efficacy and subtlety, though their wonders are difficult to grasp. Is the method of boiling stones for jade consumption not akin to this?\n\nFew who practice the Way of consuming stones fail to achieve success. The Way of consuming jade is esteemed yet difficult to perfect. The reason is this: rare medicines are hard to obtain, and what is hard to obtain cannot be used consistently. Inconsistency leads to brevity, and rarity leads to lack of focus. Success or failure often hinges on this. How can it compare to consuming stones, which are found everywhere upon the earth? Or to using medicines, when even the great marshes teem with common herbs?\n\nThus, the method of consuming stones is straightforward and easily pursued, while the formula for *shuiyu* is rare and difficult to procure. Few in the East attain cinnabar immortality—why? The cinnabar method requires *rongguan* and *zengxian*, two substances not native to the eastern lands. Without them, the method is incomplete, the medicine unmade, and thus no cinnabar immortals arise. It is not that there are no cinnabar immortals at all, but those who benefit from cinnabar are few.\n\nFew in the North attain stone immortality—why? The method of boiling stones requires *diyu* and *wuqie*, two substances not native to the northern lands. Their absence makes them difficult to obtain, and without them, stones cannot be consumed, hence the scarcity of stone immortals in the North.\n\nThus, when Yin Gongdu heard Meng Chuozi and Dong Shizhou conversing, he heard them say: \"Better a handful of *wuqie* than a cartload of gold and jade. Better a *jin* of *diyu* than luminous moon pearls.\" These two had attained immortality through consuming stones and constantly lamented the unavailability of these two substances, hence their dismissal of gold, jade, and pearls.\n\nGongdu, hearing their words, secretly pondered their meaning and inquired persistently about the use of these substances. After much time, they finally revealed the method of boiling stones to him. It is also called *Dingtanzi*. They said: \"If you wish not to die, consume *Dingtanzi*. If you wish to be free of cares, wear *diyu* ash.\" Gongdu then resolutely gathered his fellow students and disciples—dozens of people in his household—to diligently seek and purchase these medicines, boiling and consuming the stones together. All attained the immortal Way.\n\nLater, they entered the Taihe Mountains of Nanyang together, for the region abounded in fine stones. Thus, Gongdu composed a prophecy: \"Gold salt and jade札, cinnabar swallowed—thousands of autumns, ten thousand years as a celestial immortal. Why sit idly and turn to dust? The cinnabar swallowed is *Dingtanzi*.\" This saying alludes to hidden meanings.\n\n*Wuqie* is also called the mother of gold salt. *Diyu* is also called the father of jade札. The Qiang people of the North call *chi* \"札,\" so it should be called jade *chi*. Only gold salt and jade *chi* can be used to boil *Dingtanzi*.\n\nThus, when Emperor Shun ascended Mount Cangwu, he said: \"Those fragrant herbs of gold and jade—I use them to rest and uphold the true Way.\" These were *wuqie* and *diyu*.\n\nThe Perfected One of Western City, Wang Chang of Mount Wangwu, said: \"How to sustain longevity? Why not consume stones and store the mother of gold salt? How to attain long life? Why not consume stones and use the father of jade *chi*?\" This, too, is a method of boiling stones.\n\nNow, *wuqie* is the essence of the star of the Five Chariots of Heaven. It corresponds to gold in the Five Lakes, to the Five Virtues in humans, to the Five Directions in position, and to the Five Affairs in things. Thus, when blue essence enters the stem, it yields the liquid of the eastern direction. When white qi enters the node, it yields the sap of the western direction. When red qi enters the flower, it yields the radiance of the southern direction. When dark essence enters the root, it yields the dregs of the northern direction. When yellow mist enters the bark, it yields the numen of *wuji*. The Five Spirits govern life, nurturing and completing it. Those who use it become true immortals; those who consume it revert to infancy.\n\nRu Dinggong’s mother, Lady Shan, consumed *wuqie* wine and thereby attained immortality.\n\nWhen the hermit feigned death to depart from the world of yang, none of his contemporaries understood. Zhang Zisheng, styled Zhongyang, and Wang Shucai, styled Shiyan, of Jianshi, consumed the wine and maintained their chambers, living three hundred years and fathering twenty sons. Generations of those who took the powdered *wuqie* wine to extend their years and escape death were too numerous to count—how much more so if combined with the consumption of stones.\n\nIn the north, the two elixirs are absent, and mountains rich in stones are few. Only Lühun, Baodu, Qingtian, and Beimu possess white stone, while the rest are vast slabs of rock, towering peaks piled high, impossible to swiftly break apart. Their taste is unpalatable, like eating earth—these are what are called \"earth-stones.\" Consuming them only wards off hunger, with no further benefit. Generally, when consuming stones, one should seek those with fine, dense veins, naturally whole and without cracks or flaws. The five-colored stone pellets are exquisite, sweet as meat. Purple-green stones resemble dried venison; white stones taste like rice; yellow stones like taro; azure stones are slightly pungent; green stones like pickled vegetables. True persons prize them, using them for feasts and storing them as provisions. Each of the five colors has its own unique flavor—truly marvelous.\n\n*Diyu* (burnet) possesses the virtue of minor yin within and receives the qi of grand yang without. Below, it is governed by the spirit of *wuji*; above, it absorbs the essence of Mars. Its fruit is black as fermented beans, embodying the image of yin. Its leaves are red as banners, akin to yang. Though mist and dew settle upon it, its fruit remains dry, for the qi of grand yang is abundant. It thrives in level marshes and blooms in clusters, nourished by moisture. Within and without, it nurtures the two qi of yin and yang, enveloping the supreme virtues of water and fire. Thus, it can melt jade and crumble stone, overcoming hardness and surmounting difficulty. The people of Yue sometimes call it \"fermented-bean mother.\" They roast its black seeds in stone to season food, imparting fragrance. Its roots may also be boiled into a drink, similar to tea. The juice from its roots, when brewed into wine, effectively treats the eight winds and damp impediment. Slicing the stems of *wuqie*, boiling them to extract the juice, and mixing it with glutinous rice to ferment into wine yields a fine brew. Regular consumption cures all diseases, prevents aging, keeps hair from whitening, and strengthens the center. Selecting its roots for brewing is also possible, differing little from the stems—though the roots may be superior.\n\nThe roots and bark of *wuqie* can also be powdered to dispel illness and halt aging, though the afflicted often cannot sustain long-term consumption. For *wuqie* roots, ten *jin* should be harvested on the seventh day of the seventh month, or alternatively the ninth day. Days such as *gengwu*, *renwu*, the seventeenth, nineteenth, *jiaxu*, or *jiashen* are also suitable. Digging toward the sun to obtain southward-growing roots or those extending straight downward yields the best results. The digger should fast for a day and night beforehand, bathe, burn incense, and avoid speaking to others about digging the medicine or stepping on any filth. Once collected, dry the roots in the shade for a hundred days, then store them in a cloth bag. Wash them clean before placing them in the bag to dry again. Keep them away from women, birds, and dogs—do not let these see them.\n\nFor *diyu* roots, ten *jin* should be harvested on the seventh or ninth day of the seventh month. Days such as *dingmao*, *guimao*, *jimao*, or the ninth day are also favorable. Dig away from sunlight to obtain southward-growing or straight-downward roots. The digger should observe the same fasting and purification as for *wuqie*. Dry the roots in the shade for a hundred days, avoiding all filth.\n\nThese two substances may also be placed separately in earthen cauldrons and burned to ash. When needed, take a square-inch spoonful of each. If these two are unavailable, use abundant *su* (perilla) and fragrant leaves, or southward-growing roots, to boil stones. The two medicines need only be of equal proportion, filling the earthen cauldron sufficiently—ten *jin* of roots are not necessary. Dry them in the shade for a hundred days; after two hundred days, they are no longer usable.\n\nUse two earthen cauldrons, lining them with *puli* (a type of rush) and *mao* (hair or fiber), mixed with white clay. Sift the white clay to ensure fineness, then blend it with bitter wine to form a paste. Coat the inside and outside of the cauldrons with this paste multiple times: the outer layer should be one *cun* and three *fen* thick, the inner layer seven *fen* thick. Seal any cracks tightly. Cut the *wuqie* and *diyu* roots into pieces roughly four to five *fen* in size, as thick as bamboo slips. Mix them in equal proportions, then cover the cauldrons and seal the seams with mud. Dry them in the shade for nine days, then reseal any cracks with mud.\n\nPlace the cauldrons on a stand and burn firewood beneath them for seven days and nights, requiring three hundred bundles of kindling. The wood must be dry and clean—do not use old firewood. After seven days, let them cool for three days before opening to inspect. If the ash has turned purple-green, the medicine is ready. If not, continue firing for another seven days, day and night. After the second seven days, cool them for three more days—failure is impossible. The fire should surround the cauldrons on all sides. Begin with a gentle flame; if the seven days are not yet complete and the firewood is exhausted, add more. If the seven days conclude and firewood remains, burn it all. Each bundle should be half the circumference of a man’s embrace and five *chi* long, measured by the standard of *yinshang*. The firing may also be done indoors.\n\nUnless they share the same aspiration, do not let others witness the process or learn the name of this numinous medicine.\n\nThe ash is named \"purple ash.\" The medicine, when properly refined, is pure white; pound it ten thousand times and store it in a separate vessel. If the color is red, it cannot be used. For *pin gui* that proves effective upon testing, pound it while observing for fine cracks, then seal the cracks with mud to prevent further splitting. Burn it with firewood for seven days and nights; if upon inspection the color is entirely green, it is ready. If not yet green, reseal it with mud and burn for another seven days, then cool for one day. If upon inspection it remains ungreen, repeat the burning as before, taking the green color as the sign of success. Store each in separate vessels.\n\nTake fine, pure-white *ming yao*, in whatever quantity desired, pound it a thousand times, and soak it in mica-infused water until it becomes muddy. Mix these three substances evenly, and store each in separate vessels. When ready to use, take white pebbles from flowing water, the size of peaches or plums, and strike them to break into very fine pieces. For one *dou* of pebbles, place them in a cooking vessel and cover with water, leaving three to four *cun* of water above. Take one *fangcun bi* of each of the three medicines, add them to the vessel, and stir. Boil vigorously, frequently piercing with an implement to check the pebbles; when the water is nearly gone, replenish it. When fully cooked, the pebbles will be easily pierced, resembling boiled taro. Eat to satiety as a substitute for grain. Onions, salted beans, or meat may be added as desired for enhanced flavor.\n\nMaster Zhang Taixuan, with over twenty disciples, consumed this in the Luhun Mountains for more than thirty years, all growing robust. They emerged only when the world was at peace. If no red-clay cauldrons are available, red-glazed jars or red bottles may be used. All must first purify themselves for twenty-one days, kindle the fire in a secluded place, and avoid defilement only during the cooking process.\n\nAnother method: simply take the roots of *wu qie di yu*, dry them in the shade, and burn them in a cauldron as described above. Once the ash is ready, use three *fangcun bi* to cook one *dou* of pebbles until done—no *ming yao* or mica-infused water is needed.\n\nFor cooking stones: on the seventh day of the seventh month, gather *di yu* roots in any quantity, dry them in the shade for a hundred days, and burn them to ash. Then take fresh roots, pound them together with the ash—three parts ash to one part fresh root—and combine. To prepare two or three *dou* of stones, soak them in water with three *cun* of water above, stir in the medicinal powder, and boil until bubbling. When tender like rice cakes, they may be eaten to satiety. They may also be cooked with onions and salted beans like meat—this is the \"immortal’s stone-taro stew.\"\n\nFor the Realized One’s method of consuming stones: take stones the size of pigeon eggs, fine and lustrous like jade, ten in number, place them in a bronze vessel, and soak in one *dou* of juice. Add *di yu* ash the size of pigeon eggs, and cook with one *shi* of rice until done. Pound *mu yu* the size of goose eggs, then boil again. Cook with one *shi* of rice until done, piercing with chopsticks; when tender like taro, they may be eaten. The *di yu* roots and leaves are burned to ash for use with *mu yu*, which is cinnamon—or some call it *tong mu gui*.\n\nTo enter the mountains and consume stones while fasting: take three types of stones, round and the size of sparrow eggs, twenty-one in total. When ready to consume, first warm the body. At dawn, swallow seven green stones; at midday, seven red stones; at dusk, seven white stones. After ten days of fasting, prepare mallow-seed broth, strain out the dregs, and drink half a *sheng* of the liquid. Soon the stones will descend. Wash the stones, and consume them again the next day. First prepare a thin rice porridge and drink the clear liquid for two days before eating. Wash the used stones and consume them again, then fast for fifteen days. Prepare mallow broth to induce their descent as before, then drink the porridge’s clear liquid for five days. Wash the used stones and consume them again, fasting for a hundred days. Prepare mallow broth once more to induce their descent, then drink the porridge’s clear liquid for ten days. Consume the used stones again, and one may fast for a year. After a year, one may extend this to ten thousand days. Continuously wash and consume the used stones, quenching thirst with water and eating nothing else. After two years of consuming stones, one may walk six hundred *li* in a day, one’s complexion will improve, and one will commune with the divine.\n\nTo ascend as an immortal: place stone powder in cold water; after a short while, the water will grow hot as broth and may be drunk. Like drinking jade powder, regular consumption enables one to become weightless, traverse water and mountains, and depart. Where stone powder resides, its *qi* rises uniquely. When the sky rains, the area above remains dry; when the sky is arid, the area above remains warm—this is the celestial counterpart of worldly immortality.\n\nThe *Classic* states: \"Stones with jade-like whiteness, found in the *qi* of mountains, marshes, or earth, must have a source of fine springs. Drinking this spring water all connects one to the divine.\"\n\nFor consuming stalactites: stalactites are sweet in flavor, non-toxic, and warming. Also called *kong gong ru*, they brighten the eyes, descend *qi*, and replenish essence. To consume, pound them, sift, and take freely, washing them down with wine or water if no wine is available. After a hundred days, one will commune with the divine. With prolonged consumption, all illnesses are dispelled, and one becomes resistant to cold and hunger. When consuming stalactites, one should obtain those with stalactite tips two *cun* in height; those less than one *cun* that break upon touch are superior. Their chambers are called *kong gong nie*, but these are inferior to the stalactite tips.\n\nFor consuming red halloysite: red halloysite is sour in flavor and non-toxic. White halloysite is sweet, non-toxic, and neutral. Black halloysite is salty, non-toxic, and neutral. Yellow halloysite is bitter, non-toxic, and neutral. Green halloysite is sour, non-toxic, and neutral. All are medicines for nourishing life and prolonging years.\n\nTo refine the five halloysites: pound them into powder, place in water, and grind until fine like sand, with the sediment settling below. Collect the upper portion. Repeat this process fifteen times, then dry.\n\nDaily consumption of three *ge* will eliminate the need for grains, stave off hunger, lighten the body, augment *qi*, and fortify against wind and cold. When taking this medicine, one must fast with utmost sincerity and purity; without such fasting, it must not be taken lightly. If the medicine does not dissolve, it will harm the person. To resolve this, boil hemp seeds to obtain five *sheng* of their juice, which will facilitate its descent. If hemp seeds are unavailable, simmer one *jin* of rich mutton fat and consume it—this is also effective. The five minerals are difficult to obtain; one must handle them with great care.\n\n**Immortals’ Consumption of Purple Fluorite**\nPurple fluorite is pungent in flavor, warm, and non-toxic. Consuming purple fluorite bestows a lifespan of three hundred years, and holding it in the mouth prevents hunger and thirst.\n\n**Conclusion of the Immortals’ Methods for Consuming Cinnabar and Minerals as Medicines**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "神仙服饵丹石行药法 经名：神仙服饵丹石行药法。 原题京里先生撰，约出於唐代。 内载三十八种炼制、服饵仙丹石药之法。 一卷。 底本出处：《正统道藏》洞玄部玉诀类。 神仙服饵丹石行药法 京里先生撰 黄帝－物饵丹法 善丹一斤，凡一物作药，於洁诤处，先斋七日，於高山避阴头，按后法取丹砂，熟梼篷之，置铜盘中，醇酒上清九升，合丹砂於盘中，搅之，勿令人见，神不相入。 入坛始从束门入，复南门入，复西门入，复北门入。 奉药中央，满三日搅之，从三至五，复搅之，至七复搅之，从七至九，复还从三搅之，至五如前法。 二十日药乾可丸，丸之未乾，复如前法。 即阴雨常以铜盘覆之，可丸为度。 丸如小豆大，日吞三丸，五十日智意精明。 服积九岁，与天地通。 三千四百二十四日，道毕成，所求尽得。 朱光神丹，砂物精也。 禁灸刺、过生乳家，令不复神。 神仙饵丹 好定牢丹砂、谷实，凡二物，丹砂多少自在，熟梼令下槌梼。 谷实绞取汁，以和丹，令如泥，纳铜筒中盛之，固以乾，瓦反单置饭中，立筒单中，乾蚕沙着饭中，坚按之，不满四寸。 所以乾土覆其上令满，饭置釜上，白垩泥其会，猛火炊之，三日三夜，可出药，当胶。 捩破如大豆者，一纳口中即消，日三服之，一年身轻目明，众病除去。 服之二年，鬼神自朝。 服之三年，与日月通精。",
      "translated_text": "**The Divine Immortals’ Methods for Ingesting Elixirs, Minerals, and Medicinal Substances**\n\n*Scripture Title:* *The Divine Immortals’ Methods for Ingesting Elixirs, Minerals, and Medicinal Substances*\n*Attributed to:* Master Jingli, likely composed during the Tang dynasty.\n*Contents:* Thirty-eight methods for refining and ingesting immortal elixirs and mineral medicines.\n*Volume:* One.\n*Source Text:* *Daoist Canon of the Zhengtong Era*, *Dongxuan Section*, *Jade Instructions Category*.\n\n---\n\n**The Divine Immortals’ Methods for Ingesting Elixirs, Minerals, and Medicinal Substances**\n*By Master Jingli*\n\n### **The Yellow Emperor’s Method for Ingesting Single-Substance Elixirs**\nTake one *jin* of fine cinnabar. For a single-substance elixir, first purify yourself for seven days in a clean and secluded place. On a high mountain, avoid the shady side, and gather cinnabar according to the following method. Pound it thoroughly, then place it in a copper tray. Add nine *sheng* of pure, aged wine, mixing the cinnabar within. Do not let others witness this, lest the spirits fail to enter.\n\nEnter the altar beginning from the eastern gate, then the southern gate, then the western gate, and finally the northern gate. Present the medicine at the center. Stir it for three days, then again from three to five, and once more on the seventh day. From seven to nine, return to stirring from three, then to five as before.\n\nAfter twenty days, when the medicine is dry enough to form pills, roll it into pellets. If not yet dry, repeat the previous method. In case of overcast or rainy weather, keep the copper tray covered until the pills are properly formed. Shape them like small beans, and swallow three daily. After fifty days, your wisdom and perception will sharpen. After nine years of continuous ingestion, you will commune with Heaven and Earth. After three thousand four hundred and twenty-four days, the Dao will be perfected, and all your desires will be fulfilled.\n\nThis *Zhuguang Divine Elixir* is the essence of cinnabar. Avoid moxibustion, acupuncture, and passing by households with newborns, lest its spiritual efficacy be lost.\n\n### **The Divine Immortals’ Method for Ingesting Cinnabar**\nTake high-quality, unyielding cinnabar and grain kernels—just these two substances. The amount of cinnabar may vary; pound it thoroughly. Extract juice from the grain, mix it with the cinnabar to form a paste, and place it in a copper cylinder, sealing it tightly. Invert a ceramic bowl over it and set it in a steamer. Pack dry silkworm droppings around the cylinder within the steamer, pressing firmly to a depth of no more than four *cun*. Cover the top with dry earth until full. Place the steamer over a cauldron, seal the joints with white clay, and steam over a fierce fire for three days and nights. Remove the medicine when it becomes viscous.\n\nBreak it into pieces the size of large beans. Place one in your mouth, and it will dissolve instantly. Take three doses daily. After one year, your body will become light, your vision clear, and all illnesses will vanish. After two years, ghosts and spirits will pay homage. After three years, you will commune with the essence of the sun and moon.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 534,
      "start_sentence": 0,
      "end_sentence": 25,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.04393768310547,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\神仙服饵丹石行药法.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "能常服之，鹦呜云中，狗吠天上，谷实欲得正赤白者。 轻身益气三物饵丹砂 丹砂如麻者一斤，好大枣一斗，醇清酒一斗。 凡三物，丹砂梼下，绢捷，取酒盛铜物中，丹纳其中，搅令相得，居炭，去火三四寸，沸数搅之，无令着底。 取大枣，以水二斗煮之，绞去皮核，但取其汁。 稍稍纳丹中，无令绝汁，尽成如饴。 出之，盛瓶中，日一暮吞如枣一丸，服之二十日，自知。 三十日，病愈轻身，益黑，齿落更生，黑发生神矣。 神仙三物饵丹 丹砂三斤，铅三斤，谷汁九升。 凡三物，谷汁分取六升，用梼丹砂，尽六升止。 乃纳铅合梼之，令铅不见。 复以三升谷汁，瘦之合和，盛铜器中，覆以瓦器纳饭中，蒸之三日三夜，当炊桑薪。 此铅皆还，为丹引之从，手丸之，大如小豆。 三丸，服之二十日，有效。 服之三年，升天，梼砂铅，当耿火置日下，令炽为法。 神仙四物饵丹 丹砂五斤，好蜜三升，楮实正赤者，清酒。 凡四物梼，楮实绞取汁，以没丹砂，曝令乾，复没之，能满搜益善。 纳大竹筒中，蒸之砂下，三日三夜，可出。 纳铜筒中，汤煎之，纳醇清酒渍足，纳蜜煎之三日三夜，如饴不污手，可矣。 服之如枣，日再服之，百日，仙人相候。 服之一年，玉女迎之，上为真人矣。 真人炼饵丹砂 丹砂一斤治末，重绢篷之令靡靡，以醇酒不见水者，沃丹砂，搅之令如封泥状，盛以铜盘中，置高上处，勿令妇人见之，曝之，身自起居数耗燥，复沃之，常当令如泥。 若阴雨疾风，覆藏之无人处，天晏出曝之。 如是尽酒三斗而成，长曝之三十日，当紫色，握之，不污手，引之如饴。 若令着手，未可丸也。 法常炼三斤，可支三年。 若用三斤丹者，用酒九斗，曝之大盘中。 欲炼时，当先沐兰芷，斋戒七日，无妇女过近药旁也。 将欲服时，复斋戒五日，沐浴，乃服之。 药丸大如麻子。 常以平旦吞三丸，服之一日，三虫出。 服之五日，六日，心腹诸病皆有征出。 一年，皓眉更黑。 岁加一丸，至九丸止。 服之三年，神人至焉。 当有妇人衣紫罗衣，持案食来，受而食之，勿畏恶人也。 万物皆来，给使其神。 名为上，一名可，一名须。 此三物能使万物，万物可致也。 可以入金木水火土，金木水火土当为其状。 如左右须。 无所不施。",
      "translated_text": "One who regularly consumes this will hear parrots singing in the clouds and dogs barking in the heavens. The grain kernels must be purely red and white.\n\n**Three-Ingredient Elixir of Cinnabar for Lightening the Body and Augmenting Qi**\nOne *jin* of cinnabar the size of sesame seeds, one *dou* of fine large jujubes, and one *dou* of pure clear wine. For these three ingredients, grind the cinnabar to a fine powder, sift it through silk, and place the wine in a copper vessel. Add the cinnabar and stir until well blended. Position it over charcoal, keeping it three to four *cun* from the fire, and bring to a boil, stirring frequently to prevent settling. Take the jujubes, boil them in two *dou* of water, then strain to remove skins and pits, retaining only the juice. Gradually add this to the cinnabar mixture, ensuring the liquid never runs dry, until it thickens like malt sugar. Remove and store in a jar. Each evening, swallow a pill the size of a jujube. After twenty days, one will perceive the effects. After thirty days, illnesses will be cured, the body will feel light, the hair will darken, lost teeth will regrow, and black hair will flourish with vitality.\n\n**Three-Ingredient Elixir of the Immortals**\nThree *jin* of cinnabar, three *jin* of lead, and nine *sheng* of grain juice. For these three ingredients, divide the grain juice, using six *sheng* to grind the cinnabar until exhausted. Then add the lead and grind until the lead is no longer visible. Mix with the remaining three *sheng* of grain juice, place in a copper vessel, cover with a ceramic bowl, and set in a steamer. Steam over mulberry firewood for three days and nights. The lead will revert to cinnabar, drawn forth by the elixir. Roll into pills the size of small beans. Take three pills daily. After twenty days, effects will manifest. After three years, one will ascend to heaven. When grinding cinnabar and lead, place them over a bright fire in sunlight to ensure proper refinement.\n\n**Four-Ingredient Elixir of the Immortals**\nFive *jin* of cinnabar, three *sheng* of fine honey, purely red paper mulberry fruit, and clear wine. Grind the four ingredients, extract juice from the paper mulberry fruit, and soak the cinnabar in it. Dry in the sun, then soak again, repeating until fully saturated. Place in a large bamboo cylinder and steam beneath the cinnabar for three days and nights. Remove and transfer to a copper cylinder, simmer in hot water, then soak in pure clear wine until saturated. Add honey and simmer for three days and nights until it resembles malt sugar and does not soil the hands. Consume pills the size of jujubes, taking two daily. After one hundred days, immortals will come to greet you. After one year, jade maidens will welcome you, and you will become a Perfected One.\n\n**Refined Elixir of Cinnabar for the Perfected One**\nGrind one *jin* of cinnabar into fine powder, sift through double-layered silk until impalpably fine. Moisten with pure wine containing no water, stirring until it resembles sealing clay. Place in a copper tray, set in a high location, and ensure no woman sees it. Expose to sunlight, stirring occasionally to prevent drying, and remoisten as needed to maintain a clay-like consistency. If rain or strong winds arise, cover and conceal it in a secluded place; when the weather clears, resume sun-drying. Repeat until three *dou* of wine are exhausted, then sun-dry for thirty days until it turns purple. When it can be grasped without soiling the hands and stretches like malt sugar, it is ready. If it sticks to the hands, further refinement is needed. Typically, three *jin* of cinnabar are refined to last three years. For three *jin* of cinnabar, use nine *dou* of wine and dry in a large tray.\n\nBefore refining, bathe with orchid and angelica, observe a seven-day fast, and ensure no women approach the medicine. Before consumption, fast for five days, bathe, and then take the elixir. The pills should be the size of sesame seeds. Swallow three at dawn daily. After one day, the Three Worms will emerge. After five or six days, all illnesses of the heart and abdomen will manifest and depart. After one year, white eyebrows will turn black. Increase the dosage by one pill each year, up to nine pills. After three years, divine beings will arrive. A woman clad in purple silk, bearing a tray of food, will appear—accept and eat it without fear. All things will come to serve you, and spirits will obey your commands. This is called \"Supreme,\" also known as \"Possible,\" or \"Necessary.\" These three names empower all things, and all things may be summoned. One may enter metal, wood, water, fire, and earth, and these five phases will assume their forms as needed, like left and right hands. There is nothing it cannot accomplish.",
      "overlap_context": "over a cauldron, seal the joints with white clay, and steam over a fierce fire for three days and nights. Remove the medicine when it becomes viscous.\n\nBreak it into pieces the size of large beans. Place one in your mouth, and it will dissolve instantly. Take three doses daily. After one year, your body will become light, your vision clear, and all illnesses will vanish. After two years, ghosts and spirits will pay homage. After three years, you will commune with the essence of the sun and moon.",
      "start_char": 534,
      "end_char": 1403,
      "start_sentence": 26,
      "end_sentence": 70,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.16346549987793,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\神仙服饵丹石行药法.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "欲致神，禁食五辛、生菜生鱼、堵狗肉，无近房室，避日出日中。 服之一年，神明见千里内。 服之三年，见三千里外，寿日延，从外见内，从垣东见垣西，为真人矣。 此方雍人王基，受之蜀马明生。 马明生受王子乔，王子乔受赤松子，赤松子受羡门子高，羡门子高受马左师。 此法秘不妄传也。 秦子虚服之，以有验矣，兰芷取其香也。 所谓金木水火土者，着木为木也，着金为金也。 又饵丹 丹砂一斤。 熟梼下徒。 醇苦酒三升，淳漆二升，合令相得，於微火上煎之，令可丸，如麻子。 服二丸，日再，四十日腹中百病尽愈，三尸皆去。 服之百日，肌体坚强，服之千日，司命削死籍，与天相保，日月相望，改形易状，变化无常，日中无影。 又饵丹 真丹一斤，大黄六两。 釜蒸大黄，令再期乃治之，下细提。 并丹合和，封筒中，削筒令其薄，用以两釜，更煮之再期，药乃成。 出着臼中，俦千杵。 一服半钱，日三，常先食服之，神良。 主症病，除恶黑饮水，心腹有病皆愈，又治虚劳。 二千杵，大善。 得病三年，满剂乃愈。 随病远近，以此为法。 所以两釜者，恐沾汤令清耳。 又竹生槁，无在为可用耳。 韩众饵丹 丹十斤，治之。 楮实正赤者，绞取汁搜之，能百没益善。 盛竹筒中，蒸砂下，三日三夜出，置铜器中，汤煎之，脂华清酒才足。 食蜜三升，煎之三日三夜，状如饴，不污手，食如枣核。 日再服，一岁，玉女来迎，为真人矣。 神仙真人服食皆足，功满九年，时将以至，神通具足，应得上登金阙玉京耳。 神丹刀圭九光相生 用神丹砂为真朱者十两，水银十两，皆着铜器中，以一大铜器，盛铅锡各一斤，以朱银器着铅钖，上微火者，下稍猛其火，令锡等皆镕和银，便化为丹朱，乃成药。 取所饵丹，清旦向日，井华水服一刀圭，日一，可以飞升，可以陆沉。 食此千日，玉女自至，云车来　　迎，太一．对言。 慎避女人，不得交情，并污秽辱死丧、产乳之妇，及亦不得交手犯触，触则辱神，辱神则不得延年，仙道乖矣。 饵流丹 流丹即丹砂也。 以铜臼梼之研之，熟为度。 三斤为剂，百日美。",
      "translated_text": "To summon spirits, abstain from the five pungent vegetables, raw greens, raw fish, and dog meat. Avoid sexual intimacy and stay clear of sunrise and midday sun. After one year of this regimen, divine clarity will reveal all within a thousand *li*. After three years, you will perceive beyond three thousand *li*, your lifespan will extend, and you will see from without to within, from the eastern wall to the western. Then you shall become a *zhenren*.\n\nThis method was transmitted by Yongren’s Wang Ji, who received it from Shu’s Ma Mingsheng. Ma Mingsheng received it from Wang Ziqiao, who received it from Chisongzi, who received it from Xianmen Zigao, who received it from Ma Zuoshi. This method is secret and must not be carelessly transmitted. Qin Zixu practiced it and found it effective. Orchid and angelica are used for their fragrance.\n\nThe so-called \"metal, wood, water, fire, and earth\" mean that when placed upon wood, it becomes wood; when placed upon metal, it becomes metal.\n\n**Another Elixir: Cinnabar**\nTake one *jin* of cinnabar. Pound it thoroughly, then mix with three *sheng* of pure bitter wine and two *sheng* of refined lacquer. Simmer over a gentle flame until it can be formed into pills the size of sesame seeds. Take two pills twice daily. After forty days, all ailments of the abdomen will be cured, and the Three Corpses will depart. After one hundred days, the body will grow firm and strong. After one thousand days, the Controller of Destinies will erase your name from the register of death, and you will be preserved as heaven is preserved, gazing upon the sun and moon. Your form will transform, your appearance will shift, and you will change without constancy, casting no shadow at noon.\n\n**Another Elixir: True Cinnabar**\nTake one *jin* of true cinnabar and six *liang* of rhubarb. Steam the rhubarb in a cauldron until it has undergone two cycles, then grind it finely. Combine with the cinnabar, seal in a bamboo tube, and thin the tube’s walls. Use two cauldrons to steam it through two more cycles until the medicine is complete. Remove and place in a mortar, pounding it a thousand times. Take half a *qian* three times daily, always before meals. It is highly effective for treating *zheng* diseases, dispelling malign black fluids, and curing all ailments of the heart and abdomen. It also remedies consumptive exhaustion. Pounding it two thousand times is even better. For illnesses of three years’ duration, a full dose will bring cure. Adjust the dosage according to the severity of the illness.\n\nThe use of two cauldrons ensures the decoction remains clear. Bamboo, whether fresh or dried, may be used.\n\n**Han Zhong’s Elixir**\nTake ten *jin* of cinnabar and refine it. Extract juice from fully ripe paper mulberry fruit and knead it into the cinnabar—more juice yields better results. Place in a bamboo tube and steam the cinnabar beneath it for three days and nights. Remove and place in a bronze vessel, simmering in broth until the fat and essence are clear, with just enough wine. Add three *sheng* of honey and simmer for three days and nights until it resembles malt sugar, leaving no residue on the hands. Consume portions the size of a jujube pit twice daily. After one year, a jade maiden will come to welcome you, and you shall become a *zhenren*. When the *zhenren* and immortals consume this elixir to completion, and their merit is fulfilled after nine years, the time will come for them to ascend. Their spiritual powers will be complete, and they shall ascend to the Golden Gates and Jade Capital.\n\n**Nine Radiant Knife-Points of Divine Elixir**\nTake ten *liang* of divine cinnabar refined into true vermilion and ten *liang* of mercury, placing both in a bronze vessel. In a larger bronze vessel, melt one *jin* each of lead and tin. Place the vessel containing the cinnabar and mercury over the molten lead and tin, applying gentle heat above and stronger heat below. When the tin and lead have melted and blended with the mercury, the cinnabar will transform into the elixir. Take the prepared elixir at dawn, facing the sun, and consume one knife-point with well-water once daily. You may then ascend in flight or descend into the earth. After one thousand days of this regimen, a jade maiden will arrive, and a cloud chariot will come to welcome you. The Grand Unity will converse with you.\n\nBeware of women—do not engage in intimacy. Avoid defilement by the impure, such as those in mourning, women who have given birth, or those who have died. Do not even touch them with your hands, for contact defiles the spirit. Defilement of the spirit prevents longevity, and the Dao of immortality will be lost.\n\n**Flowing Elixir**\nThe flowing elixir is cinnabar. Grind it in a bronze mortar until thoroughly refined. Use three *jin* per dose. After one hundred days, the effects will be excellent.",
      "overlap_context": "beings will arrive. A woman clad in purple silk, bearing a tray of food, will appear—accept and eat it without fear. All things will come to serve you, and spirits will obey your commands. This is called \"Supreme,\" also known as \"Possible,\" or \"Necessary.\" These three names empower all things, and all things may be summoned. One may enter metal, wood, water, fire, and earth, and these five phases will assume their forms as needed, like left and right hands. There is nothing it cannot accomplish.",
      "start_char": 1403,
      "end_char": 2222,
      "start_sentence": 71,
      "end_sentence": 112,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.489033699035645,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\神仙服饵丹石行药法.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "清酒五斗，以五斗酒，渍大小椒各一升，卒时去滓，以汁和流珠，令如汤状。 盛以铜器。 加火上，数搅之，令汁尽，益酒药流珠，可以长数尺，如丝状，可药成。 常平旦向日，服如赤小豆大，一丸，日三。 先食，服之百日，病尽去，寿与天地齐。 所谓大椒者，蜀椒也。 小椒，秦椒也。 又治大风，甚良。 饵越丹 真越丹一斤，醇清酒合研令相得，於汤上煎之，三日三夜，搅之手不得息，令可引，乃丸如大豆，服一丸，日再，除百病，腹中安神，久服延年。 又饵越丹 越丹一斤，醇清酒三斗，细磨丹，盛铜瓷中，以醇清酒灌搅之，置沸汤上煎，常左转搅，满三日三夜，可引，乃丸之如大豆。 服一丸，日再，令人玉泽，白发更黑，齿落更生，并除面皱。 饵日曝丹 丹砂精者，多少自在，治下细槌，纳铜器中，以白蜜和泥，密盖其口坚完，漆其际，务使密内。 明年此日出成，曝令乾，和以蜜丸，如大豆，服一丸，日再服之，除百病。 长服，延年神仙。 饵腰腹丹 丹砂三斤，治下篷，盛以重练囊，纳疡腹中，缝腹令合，蒸黍米下，炊以桑薪，三日三夜出之，丸以白蜜，服如大豆，二丸，日三，除万病，神仙延年。 鹦子丹 取鹦雌雄纯白者，别养得其卵，叩出黄白，取丹砂下细徒和，以此卵中，蜡密封其口，还令白鹦合子伏之，鹤出药成，和以蜜，服如大豆，二丸，日三，久服长生延年。 神仙炼饵还丹 丹砂一两，秦银一斤。 凡二物，取秦银置铜盘中，用五六月曝之，梼大丹砂末之，置银中，以大刀环搅之，从食至哺时，尽为丹矣。 取丹置丹阳铜筒中，盖覆之，以狗毛泥涂筒上．，厚二寸，曝乾之。 以马通火炊之，九日九夜出。 盛以白素囊，置鸦腹中，缝之。 煮鸦，鸦熟出之，丸如麻子，平旦向日。 吞一丸，以井华水饮之，日三，服之百日，髻鬃见神。 二百日。 身轻，所苦悉愈。",
      "translated_text": "Five *dou* of clear wine are used to steep one *sheng* each of large and small peppercorns; strain immediately and discard the dregs. Mix the liquid with flowing pearls until it resembles hot water. Store in a bronze vessel, place over a fire, and stir frequently until the liquid evaporates. Add more wine and elixir pearls, and the substance may extend several *chi*, resembling silk threads—thus the medicine is complete. At dawn, face the sun and consume a pill the size of a small red bean, three times daily. Take before meals; after one hundred days, all illnesses will vanish, and your lifespan will equal that of heaven and earth. The \"large peppercorn\" refers to Sichuan pepper, while the \"small peppercorn\" is Qin pepper. This remedy is also highly effective for treating severe wind disorders.\n\n**Consuming Yue Elixir**\nGrind one *jin* of true Yue elixir with pure clear wine until thoroughly blended, then simmer over boiling water for three days and nights, stirring without pause until it can be drawn into strands. Form into pills the size of soybeans. Take one pill twice daily to eliminate all diseases, pacify the spirit within the abdomen, and prolong life with long-term use.\n\n**Another Yue Elixir Method**\nGrind one *jin* of Yue elixir finely and place it in a bronze vessel with three *dou* of pure clear wine. Continuously pour and stir the wine while simmering over boiling water, always stirring counterclockwise. After three days and nights, when it can be drawn into strands, form into pills the size of soybeans. Take one pill twice daily to restore jade-like luster to the skin, turn white hair black, regrow fallen teeth, and smooth facial wrinkles.\n\n**Consuming Sun-Exposed Elixir**\nUse refined cinnabar in any quantity, grind it finely, and place it in a bronze vessel. Mix with white honey to form a paste, seal the vessel tightly, and lacquer the seams to ensure airtightness. Unseal it on the same day the following year, expose the contents to the sun to dry, then mix with honey and form into pills the size of soybeans. Take one pill twice daily to cure all diseases. Long-term use grants longevity and immortality.\n\n**Consuming Waist-and-Abdomen Elixir**\nGrind three *jin* of cinnabar into fine powder, place it in a double-layered silk pouch, and insert it into the abdomen of a pig. Sew the abdomen closed, steam it over glutinous millet, and cook with mulberry firewood for three days and nights. Remove the elixir, form into pills with white honey the size of soybeans, and take two pills three times daily to eliminate all illnesses and attain immortality with extended use.\n\n**Parrot Elixir**\nSelect pure white male and female parrots, raise them separately, and obtain their eggs. Remove the yolk and white, mix with finely ground cinnabar, and return the mixture to the eggshell. Seal the opening tightly with wax and let the white parrot incubate the egg. When the chick hatches, the medicine is complete. Mix with honey and form into pills the size of soybeans. Take two pills three times daily; long-term use grants longevity and immortality.\n\n**Divine Immortal’s Refined Consumable Returned Elixir**\nTake one *liang* of cinnabar and one *jin* of Qin silver. Place the Qin silver in a bronze tray and expose it to the sun during the fifth or sixth month. Sprinkle the finely ground cinnabar over the silver and stir continuously with a large knife from breakfast until dusk, until the silver transforms entirely into elixir. Place the elixir in a Danyang bronze vessel, cover it, and coat the vessel with dog-hair clay to a thickness of two *cun*. Dry it in the sun, then heat it with horse-dung fire for nine days and nights. Remove the elixir, store it in a white silk pouch, and place it inside a crow’s abdomen. Sew the crow shut, boil it until cooked, then remove the elixir and form it into pills the size of sesame seeds. At dawn, face the sun and swallow one pill with well-water, three times daily. After one hundred days, divine spirits will appear in your hair. After two hundred days, your body will become light, and all ailments will be cured.",
      "overlap_context": "\n\nBeware of women—do not engage in intimacy. Avoid defilement by the impure, such as those in mourning, women who have given birth, or those who have died. Do not even touch them with your hands, for contact defiles the spirit. Defilement of the spirit prevents longevity, and the Dao of immortality will be lost.\n\n**Flowing Elixir**\nThe flowing elixir is cinnabar. Grind it in a bronze mortar until thoroughly refined. Use three *jin* per dose. After one hundred days, the effects will be excellent.",
      "start_char": 2222,
      "end_char": 2954,
      "start_sentence": 113,
      "end_sentence": 143,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.60831570625305,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\神仙服饵丹石行药法.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "三百日，举能凌云，此名拘流珠。 神仙饵大黄丹 大黄丹十二两，水银二斤四两。 凡二物，以醇酒搜令淹淹，熟搅之。 盛夏日加巳时，纳铜销中，曝之。 日照明堂，搅之，如熟二斗米，顷变为丹。 以醇酒渍和之，合浥以搅，复化为银。 曝之，如熟二斗米，顷化为丹。 以酒和，如前法曝之，化为银。 曝之，如熟二斗米，顷酒和，如前曝之，化为丹。 夏日加巳，为之如前法。 凡三为银，四为丹，是乃为神丹。 常以王相日晏静时，以日正上南向日，搅治之，故曰：母生阳，立午乡。 号曰楚皇，名日流珠之英，一名流黄。 变为神丹，一名赤盐。 此万物之精也，令人神仙。 服之一年，中充外泽，面目有光，白发日黑，齿堕复生。 服之二年，出入天门，旁见神人。 服之三年，乘云驾龙，为真人矣。 神仙饵巴丹 取巴丹一斤，戎盐六两，治合置铜器中，瓯覆之三日，以醇酒半斗，渍一宿，澄去上清。 尝咸未尽，复以酒半斗，渍之一宿，咸尽用之。 白蜜和，蒸之三斗粳米，中央炊之，三日三夜，药熟。 如饵服如小豆一丸，向日，以井华水服之，住年不老。 真人山子饵丹 先凿地入三尺为宠，以黄土作泥，表裹涂之，厚三寸，极令坚燥，勿使有坼。 以安一石铁釜，复泥治之。 以水六七斗着釜中，更取三斗土釜，着铁釜上，以盛炼丹一斤，纳土釜中，取桑根汁五升和丹，令相得，复以一土釜覆其上，以黄土泥，泥土釜际，及铁釜际，皆令坚密，勿使气泄。 炊以桑薪、调适其火，勿令大佛，稍稍发溢釜中水，勿令汁尽。 讫辄蜜涂之，三日三夜，发上土釜，以清酒五升沃药中，搅令相得，密涂之，如前复三日三夜出，着铜器中，纳白蜜五升，搅令相得。 以铜器浮着釜汤上，微火煎之，三日三夜，搅令可丸便止。 凡九日九夜药成，服如麻子，二丸，日再。 日加一丸，满十日，复从二丸如初，以为常服之。 三十日身轻，六十日耳目聪明，百日百病愈，二百日意常欲飞，三年令人不死，与天地相毕。 神仙治病延年返老丹 丹砂一斤，熟梼下细提精。 淳漆二升，白蜜一升，好苦酒三升。 凡四物合着铜器中，微火上煎之，数搅之，香熟可丸，服如麻子一丸，肌体坚强，四十日病除。 服之百日，三尸自去。 服之千日，众邪不干，飞行变化，所至不难，改易形容，出入无问，立日中无影，神仙最秘不传。 服药禁食猜肉生鱼，及诸酸辛。 作此药法，欲得清静独处，莫过二人共合见者，令药不成。 神仙饵雄黄 天地之宝，藏於中极，命日雌黄。 雌黄千岁，化为雄黄。 雄黄千岁，化为黄金。 服食黄金，命曰真人。 饵金之卫，微妙难成。 轻身益气，莫过雄黄。 饵雄黄法，用好者一斤，治之如粉，以醇酒三升，和之铜器中，白炭上煎之，微火令小沸，勿使大熟，其状如胶。 以好漆二升，熟绞去滓，投着其中，搅令和合药成，丸如大豆，常先食渍一丸，咽其汁，日三服，十日即知病悉愈。 二十日身皮肤至足，药黑市行，命日真人，时寒则温，时热则冻。 服之百日，肠中肥厚，皮肤坚筋，骨强，耳目聪明，无众患，三百日以后，吞如黍粟大，日三丸，以为常也。 雄黄当得武都者，取其阳色。 阳色者，正鲜好者，一斤，治令极靡。 水银半斤，云母六两，治之皆令靡。",
      "translated_text": "After three hundred days, you will be able to ascend above the clouds—this is called the *Jiuliu Pearl*.\n\n**Divine Immortal’s Elixir of Rhubarb**\nTake twelve *liang* of rhubarb elixir and two *jin* four *liang* of mercury. Mix these two ingredients with pure wine until thoroughly saturated, then stir them well. On a summer day at the *si* hour, place them in a bronze vessel and expose them to the sun. When the sunlight fills the chamber, stir until the mixture resembles two *dou* of cooked rice, and it will soon transform into elixir. Soak it in pure wine, blend it evenly, and stir again—it will revert to silver. Expose it to the sun until it resembles two *dou* of cooked rice, and it will soon transform back into elixir. Mix it with wine and expose it as before, and it will turn to silver again. Repeat the process until, after three transformations into silver and four into elixir, it becomes divine elixir. Always prepare it on a *wangxiang* day at the quiet hour when the sun is directly overhead, facing south while stirring. Thus it is said: \"The mother gives birth to yang; stand in the noon direction.\" It is called *Chuhuang*, also known as the essence of *liuzhu*, or *liuhuang*. When transformed into divine elixir, it is also called *red salt*. This is the essence of all things, granting immortality. After one year of ingestion, the body will be full within and radiant without, the face and eyes will glow, white hair will turn black, and fallen teeth will regrow. After two years, you will enter the celestial gates and glimpse divine beings. After three years, you will ride clouds and mount dragons, becoming a *zhenren*.\n\n**Divine Immortal’s Elixir of Ba**\nTake one *jin* of *Ba* elixir and six *liang* of *rong* salt, grind them together, and place them in a bronze vessel. Cover it for three days, then soak in half a *dou* of pure wine for one night. Decant the clear liquid, and if the saltiness remains, soak again in half a *dou* of wine for another night until the salt is fully dissolved. Mix with white honey and steam with three *dou* of polished rice, cooking it in the center for three days and nights until the medicine is ready. Ingest a pill the size of a small bean, facing the sun, and swallow it with well-water. You will remain youthful for years without aging.\n\n**Mountain Recluse’s Elixir**\nFirst, dig a pit three *chi* deep and line it with yellow clay, plastering the exterior to a thickness of three *cun*, ensuring it is firm and dry without cracks. Place a one-*dan* iron cauldron inside and plaster it as well. Pour six or seven *dou* of water into the cauldron, then place a three-*dou* earthenware pot atop it to hold one *jin* of refined elixir. Mix the elixir with five *sheng* of mulberry root juice until well combined, then cover it with another earthenware pot. Seal the edges of both pots and the iron cauldron with yellow clay, ensuring no qi escapes. Heat with mulberry firewood, regulating the flame to prevent boiling over, and replenish the water in the cauldron to prevent the juice from drying out. Once done, coat it with honey and repeat the process for three days and nights. Then, open the upper pot, pour five *sheng* of clear wine into the medicine, and stir well. Seal it again and repeat for another three days and nights. Remove the elixir, place it in a bronze vessel, add five *sheng* of white honey, and stir until well mixed. Float the bronze vessel in the cauldron’s hot water and simmer over a low flame for three days and nights, stirring until it can be formed into pills. After nine days and nights, the medicine is complete. Take two pills the size of sesame seeds, twice daily. Increase by one pill each day until reaching ten, then return to two pills as before. After thirty days, the body will feel light; after sixty days, hearing and vision will sharpen; after a hundred days, all illnesses will be cured; after two hundred days, the mind will long to fly. After three years, you will become immortal, enduring as long as heaven and earth.\n\n**Divine Immortal’s Elixir for Curing Illness, Prolonging Life, and Reversing Aging**\nTake one *jin* of cinnabar, finely ground and refined. Add two *sheng* of pure lacquer, one *sheng* of white honey, and three *sheng* of good bitter wine. Combine these four ingredients in a bronze vessel and simmer over a low flame, stirring frequently until fragrant and pliable enough to form pills. Ingest one pill the size of a sesame seed—after forty days, the body will become strong, and all illnesses will vanish. After a hundred days, the *sanshi* parasites will depart. After a thousand days, no evil will assail you, and you will gain the power of flight and transformation, moving effortlessly wherever you go. You will alter your appearance at will, passing unseen, and at noon, cast no shadow. This is the most secret elixir of the immortals, not to be transmitted lightly. Avoid consuming pork, raw fish, and all sour or pungent foods while taking this medicine. To prepare it, seek solitude and quiet, and do not let more than two people witness the process, lest the medicine fail.\n\n**Divine Immortal’s Elixir of Realgar**\nThe treasure of heaven and earth, hidden in the central pole, is called *cihuang*. After a thousand years, *cihuang* transforms into realgar; after another thousand years, realgar becomes gold. Ingesting gold makes one a *zhenren*. Yet the method for consuming gold is subtle and difficult to perfect. Nothing surpasses realgar for lightening the body and replenishing qi. To prepare realgar, take one *jin* of the finest quality, grind it to powder, and mix it with three *sheng* of pure wine in a bronze vessel. Simmer over white charcoal on a low flame, keeping it slightly boiling without overcooking, until it resembles glue. Add two *sheng* of good lacquer, strain out the dregs, and stir into the mixture until well combined. Form into pills the size of soybeans. Before meals, soak one pill and swallow its juice, three times daily. After ten days, all illnesses will be cured. After twenty days, the skin will darken from head to toe, and you will walk as a *zhenren*, warm in cold and cool in heat. After a hundred days, the intestines will grow thick, the skin firm, the sinews strong, the bones resilient, and the ears and eyes sharp. All afflictions will vanish. After three hundred days, take pills the size of millet, three times daily, as a regular practice. The best realgar comes from Wudu, selected for its yang color—bright and pure. Take one *jin* and grind it to an extremely fine powder. Add half a *jin* of mercury and six *liang* of mica, both ground to a fine powder.",
      "overlap_context": " the sun, then heat it with horse-dung fire for nine days and nights. Remove the elixir, store it in a white silk pouch, and place it inside a crow’s abdomen. Sew the crow shut, boil it until cooked, then remove the elixir and form it into pills the size of sesame seeds. At dawn, face the sun and swallow one pill with well-water, three times daily. After one hundred days, divine spirits will appear in your hair. After two hundred days, your body will become light, and all ailments will be cured.",
      "start_char": 2954,
      "end_char": 4197,
      "start_sentence": 144,
      "end_sentence": 199,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.62160563468933,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\神仙服饵丹石行药法.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "白蜜三升合和：盛以的筒：薄削之．＇盖其口约以臬，黍米下计，五日五夜即卉以置水中，演之如绵，即不污人手，在地草土不着。 日吞如大豆一丸，常服之，与天地相保，勿妄传也。 雄黄正阳赤好鲜者，多少自在，置釜中，以一釜覆之，涂其际，无令泄。 先以犬毛为替，乃用滑石，赤石脂合和，以水涂厚三分，乾，用上釜不须涂也。 为铁叉，令釜居上，去地五寸，炊以苇薪，以土为三丸，以置釜上，乾之，复置一丸着其上，如是尽三丸止。 寒可发，以鹦羽拂取，以肥猜胴肠入药，结两头，置铜器中，复盖之，加瓯中，装黄土其上，蒸之一日一夜，复加一胴，三日三夜尽三胴，可引，丸大如弹丸，服一丸，乃可饮玉浆。 又神仙饵雄黄 真人饵雄黄，价直千金，服之与天地无极。 可引，长三尺。 治之法，好雄黄一斤，盛以竹筒，复以大筒重合，以白蜜六两，云母粉五两，水银八两半，合置筒中，善封涂，无令泄。 置黍米中央，蒸之五日五夜，出置水中，濯之如巾，即成饵矣。 服如弹丸，日一。 又饵雄黄治病辟毒延年 用雄黄一斤，梼合如粉二倾半斤，云母六两，梼合，令和白蜜三升，皆合和，盛以竹筒，薄削之，约以臬，盖其口，蒸之黍米中，五日五夜，即成。 以置水中，引之如绵，即不污人手，在地草土不着，成也。 服如大豆者一枚，常服之，与天地相毕，神仙度世，与神明通，上为太一使，下伏百鬼，任使之。 太－仙二物饵水银雄黄 雄黄一斤，水银一斤，凡二物，先取雄黄治，纳饭中，蒸之三日三夜。 乃与水银，令梼合相得，纳铜物中，置饭中，装黍米五斗，其上炊以桑薪，气出止。 须臾复上，如前十五上，当为水，乃出。 加炭上消为水，出置温土上，复加炭上，如前药当紫色。 取一刀圭粉，一斤铅，即得物矣。 欲服之，和以白蜜，大如黍粟，日一吞一丸。 服之一十日，外湿地不能伤，百鬼不敢当。 服之二十日，与神明通，道毕矣。 服之百日，为太一使。 服之三年，与天地无极，役使鬼神，凌云轻举，忽荒无垠，腾跃云问，上谒天皇，列为仙人。 真人相传，愚者惑焉。 东方朔饵雄黄",
      "translated_text": "Combine three *sheng* of white honey with the mixture and store in a bamboo tube, thinning its walls by shaving. Seal the mouth with a wooden plug, then place it beneath millet grains. After five days and nights, remove and immerse in water, drawing it out like silk—thus it will not soil the hands nor cling to grass or earth. Swallow one pill the size of a soybean daily as a regular practice, and you will be preserved with Heaven and Earth; do not recklessly transmit this.\n\nFor true yang realgar, select the brightest and purest red. Use as much as desired, place in a cauldron, and cover with another cauldron, sealing the edges to prevent leakage. First, use dog’s hair as a substitute, then mix with talc and red halloysite, applying a water-based coating three *fen* thick. Once dry, the upper cauldron need not be sealed. Fashion an iron fork to suspend the cauldron five *cun* above the ground, and heat with reed firewood. Shape three clay pellets and place them atop the cauldron; dry them, then add another pellet, repeating until all three are used. When cold, brush the substance with a parrot feather. Insert the medicine into the fatty intestines of a pig, tie both ends, place in a bronze vessel, cover, and nestle in a jar filled with yellow earth. Steam for one day and night, then add another intestine; after three days and nights, using three intestines in total, it may be drawn out. Form into pills the size of a crossbow pellet, and swallowing one will allow you to drink the Jade Nectar.\n\nAnother method for consuming realgar as an immortal’s elixir:\nThe *zhenren*’s realgar elixir is worth a thousand gold; consuming it grants boundless union with Heaven and Earth. It may be drawn out to a length of three *chi*. The method: take one *jin* of fine realgar, place in a bamboo tube, and cover with a larger tube. Add six *liang* of white honey, five *liang* of mica powder, and eight and a half *liang* of mercury. Seal tightly to prevent leakage, place amid millet grains, and steam for five days and nights. Remove and rinse in water until it resembles silk—thus the elixir is complete. Consume one pill the size of a crossbow pellet daily.\n\nAnother method for consuming realgar to cure illness, repel toxins, and prolong life:\nTake one *jin* of realgar, grind to a powder with two and a half *sheng* of rice, and add six *liang* of mica, also ground. Mix with three *sheng* of white honey, store in a bamboo tube, thin its walls by shaving, and seal the mouth with a wooden plug. Steam amid millet grains for five days and nights, then immerse in water, drawing it out like silk—thus it will not soil the hands nor cling to grass or earth. Consume one pill the size of a soybean daily as a regular practice, and you will endure with Heaven and Earth, attain immortality, transcend the world, commune with the divine, ascend as an emissary of the Great One, and subdue all spirits at will.\n\nThe Great One’s elixir of two substances—mercury and realgar:\nTake one *jin* each of realgar and mercury. First, refine the realgar and steam it in rice for three days and nights. Then combine with mercury, grinding until thoroughly mixed, and place in a bronze vessel. Set within rice, covering with five *dou* of millet, and heat with mulberry firewood until the vapor ceases. Repeat the process fifteen times, after which it will liquefy. Remove and melt over charcoal until it becomes water, then place on warm earth. Return to the charcoal fire; the medicine will turn purple. Take one *daogui* of powder and mix with one *jin* of lead—thus the substance is obtained. To consume, blend with white honey into pills the size of millet grains, swallowing one daily.\n\nAfter ten days of consumption, damp earth will no longer harm you, and no ghost will dare approach. After twenty days, you will commune with the divine, and the Dao will be fulfilled. After a hundred days, you will become an emissary of the Great One. After three years, you will achieve boundless union with Heaven and Earth, command ghosts and spirits, ascend the clouds with lightness, traverse the vast and limitless, leap through the skies, and ascend to pay homage to the Heavenly Sovereign, joining the ranks of immortals. This is transmitted among *zhenren*; fools are deluded by it.\n\nDongfang Shuo’s method for consuming realgar.",
      "overlap_context": "d cool in heat. After a hundred days, the intestines will grow thick, the skin firm, the sinews strong, the bones resilient, and the ears and eyes sharp. All afflictions will vanish. After three hundred days, take pills the size of millet, three times daily, as a regular practice. The best realgar comes from Wudu, selected for its yang color—bright and pure. Take one *jin* and grind it to an extremely fine powder. Add half a *jin* of mercury and six *liang* of mica, both ground to a fine powder.",
      "start_char": 4197,
      "end_char": 5020,
      "start_sentence": 200,
      "end_sentence": 228,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.024773597717285,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\神仙服饵丹石行药法.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "多少自在，细治，肥鸭去肠脏，纳雄黄腹中，蒸三日三夜，装沙其上，服如枣核，日再，尤妙。 神仙饵鹦子雄黄 雄黄一斤，治之令如粉。 取生新鹦子黄白和之，置铜姚中，以一姚覆上，封涂其际，微火令手可扪，烧然尽三日夜，勿令火绝。 寒乃发之，掠去上滓，清者在下，当涌涌如水银，寒则坚，得人气复软。 录一斤，得十两，盛以竹筒，勿使见风。 服如麻子，使人玉泽润色，冬则能温，夏则能冻，辟除诸寒气 延年神仙一物饵雄黄 雄黄三斤。 凡一物，治置去釜中，会涂以狗毛，泥涂其会，无令泄，均厚半寸，今乾。 置黍米中，炊以苇薪。 丸一丸泥，置其上，以为候。 丸燥可下，扫取上着。 取肥猪胴肠盛药，约其两端，置炊黍中，蒸之一日。 以好膏涂一胴肠，裹加药上，一日复重肠，凡三日三夜，用肠三枚，药成白。 如饵可引，丸如弹丸，吞之即延年不老矣。 神仙饵雄黄致玉女 但取雄黄鹦冠色者，熟梼下细徒，和以成炼松脂，日一服一枚，如弹丸。 至十日，腹中伏尸三虫下，面野皆除。 服之二十日，百病除，耳目聪明。 臧药，日一服如小豆二枚，百日，束常阳女来。 二百日，青腰素女形如玉来，以黄为饰，如大黍米，在鼻上，或在人中，是真玉女也。 欲为人妇，且勿妻也。 自称肉人腥躁不洁诤，何宜当来乎。 玉女曰：吾见子服神药，精气上通洞天，天故使我来为子妇。 因谓玉女曰：吾闻天上有华池酒兰汤，宁可得尝之乎。 玉女为人取持来，得而饮之，乃用为妇。 自是之后，长与玉女，载华羽之车，徘徊九天之上，展转六合之中。 服之勿止，与天地相保，戒勿以衣服及屐履借人，药精常欲飞扬，作此药斋百日o 神仙酒炼雄黄 雄黄一斤，熟梼下细筏。 清酒五升渍之，置器中，卒时作束向鳌，安釜已毕，薄涂之，以铜盘加釜上，令水不及三四寸，以赤土涂其际，勿令泄。 炊之以桑薪，釜中水尽，辄复益之。 药汁尽，以酒五升当五益之。 合为二斗五升，调适其火，炊之可丸乃止。 雄黄莫过大猛火，猛火飞去，药不成也。 合药时当先斋戒七日，清净处，勿令人见之。 药成，食如小豆者，二枚，常送药，以水服之，百日入髓，腹中三虫伏尸皆去，心开目明，使人有威武，入水辟蛟，龙，入山辟虎狼，入军辟五兵。 服雄黄者，人不敢当之。 神仙炼饵白雄黄 先为土重炉，广五寸，长尺为铃，中问装炭，其中取雄黄，则置其门，五六斤多少自在。 以木饭盛玄龙汁，承其下，并涂之，高尺五六寸，猛火炊之，火稍益炭，卒时雄黄皆下，洒於槽拘中，正白如米，久久坚绝，可治也。 以蜜丸大如小豆，日一向日，吞一丸，即辟百邪诸凶之属，能十反互之益良，令人通神明。 神仙延年不老保精神制魂魄却百病炼饵白雄黄方 以雄黄五十斤，当盛以铁筒，筒长二尺二寸，中径四寸，底广三寸半，厚五分。 以盥和朴硝，泥直筒中，厚三分，乾之。 吹咀雄黄，纳其中，以铁为箄，穿之百余孔，如熏筛状，覆箄筒口，以铁跳盛以麻油，埋地中通半，取大绳击穿其中央，以盖跳上。 取雄黄倒覆空上，以六一泥涂其会，令坚不动。 径以炭火烧之，作小偶图形，炭炉去筒七八寸，然其中筒赤紫色黄，即消下入油中，长尺余，短者七八寸，复取装之如前法。",
      "translated_text": "How much to use is at your discretion. Mince finely, remove the entrails from a plump duck, and place realgar inside its belly. Steam for three days and three nights, then bury it in sand. Consume pieces the size of a jujube pit, twice daily—this is especially effective.\n\n**Immortals’ Method for Consuming Realgar with Parrot Eggs**\nTake one *jin* of realgar and grind it to powder. Mix with the yolk and white of fresh parrot eggs, place in a copper vessel, and cover with another vessel, sealing the edges. Warm over a gentle fire, just enough to touch without burning, and heat continuously for three days and nights without letting the fire go out. Once cooled, open it and skim off the dross; the clear substance below will surge like mercury, hardening when cold and softening when exposed to human *qi*. From one *jin*, you will obtain ten *liang*. Store in a bamboo tube, shielding it from wind. Consume pieces the size of sesame seeds to make the skin lustrous as jade, warm in winter, cool in summer, and ward off all cold *qi*.\n\n**Immortals’ Single-Ingredient Realgar Elixir for Longevity**\nTake three *jin* of realgar. Prepare a single-ingredient elixir by placing it in a cauldron, sealing the lid with dog hair and mud to prevent leaks, ensuring an even thickness of half a *cun* and letting it dry. Place it among millet grains and steam with reed firewood. Form a mud pellet and place it on top as an indicator; when the pellet dries, the elixir is ready. Sweep off the residue from the top. Fill a pig’s large intestine with the elixir, tie both ends, and place it among the steaming millet for one day. Coat another intestine with fine lard, wrap it around the elixir, and repeat for three days and three nights, using three intestines in total. The elixir will turn white. To consume, stretch it into strands and form pills the size of a bullet; swallowing one will grant ageless longevity.\n\n**Immortals’ Realgar Elixir to Summon Jade Maidens**\nSelect realgar the color of a parrot’s crest, pound it finely, and mix with refined pine resin. Consume one pill the size of a bullet daily. After ten days, the three corpse-worms in your abdomen will be expelled, and your complexion will clear. After twenty days, all illnesses will vanish, and your hearing and vision will sharpen. Store the elixir and consume two small bean-sized pills daily. After a hundred days, the Everlasting Yang Maiden will appear. After two hundred days, the Azure-Waisted Jade Maiden, her form like jade, will come adorned with yellow ornaments the size of large millet grains on her nose or philtrum—this is the true Jade Maiden. If you wish to take her as a wife, do not marry another. She will say, \"I see you consume the divine elixir, your essence and *qi* ascending to penetrate the Cavern-Heavens. Heaven has sent me to be your bride.\" You may ask her, \"I have heard of the celestial Flower Pool wine and Orchid Spring nectar—might I taste them?\" The Jade Maiden will fetch them for you to drink, and you may then take her as your wife. From then on, you will forever accompany her, riding a feathered chariot through the Nine Heavens and roaming the Six Directions. Continue the elixir without cease to preserve yourself alongside Heaven and Earth. Beware: do not lend your clothing or sandals to others, for the elixir’s essence is volatile. Prepare this elixir in seclusion for a hundred days.\n\n**Immortals’ Wine-Refined Realgar**\nTake one *jin* of realgar and pound it finely. Soak in five *sheng* of clear wine in a vessel, then face east and arrange the setup. Place the vessel in a cauldron, seal it lightly, and set a copper tray on top with water three to four *cun* deep. Seal the edges with red clay to prevent leaks. Steam with mulberry firewood, replenishing the water as it evaporates. When the elixir’s liquid is exhausted, add five *sheng* of wine five times, totaling two *dou* and five *sheng*. Adjust the fire until the elixir can be formed into pills, then stop. Do not use too fierce a fire, or the realgar will scatter and the elixir will fail. Before compounding, observe a seven-day fast in a clean, secluded place, allowing no one to witness the process. Once complete, consume two pills the size of small beans daily, washing them down with water. After a hundred days, the elixir will enter your marrow, expelling the three corpse-worms, sharpening your mind and vision, and granting you martial presence. It will repel dragons and serpents in water, tigers and wolves in the mountains, and all weapons in battle. Those who consume realgar will be invincible.\n\n**Immortals’ Refined White Realgar Elixir**\nFirst construct a double-layered earthen furnace, five *cun* wide and one *chi* long, with a chimney. Fill the center with charcoal, place the realgar at the opening (five to six *jin* as needed), and position a wooden basin filled with Dark Dragon Juice beneath to catch the elixir. Seal the setup with mud to a height of one *chi* and five to six *cun*. Heat with a fierce fire, adding charcoal as needed. Soon, the realgar will melt and drip into the trough, turning pure white like rice grains. Over time, it will harden completely and can be processed. Form into honeyed pills the size of small beans, and swallow one daily while facing the sun to repel all malevolent spirits and misfortunes. This elixir offers tenfold benefits, enhancing spiritual clarity.\n\n**Immortals’ Longevity Elixir: Refined White Realgar to Preserve Spirit, Control the Hun and Po, and Ward Off All Illnesses**\nTake fifty *jin* of realgar and place it in an iron cylinder two *chi* and two *cun* long, four *cun* in diameter at the center, three and a half *cun* wide at the base, and five *fen* thick. Mix saltpeter with water and coat the inside of the cylinder to a thickness of three *fen*, then let it dry. Crush the realgar and place it inside. Fashion an iron sieve with over a hundred holes, like a fumigation strainer, to cover the cylinder’s opening. Fill an iron tray with sesame oil and bury it halfway in the ground, leaving a small hole in the center. Place the tray’s lid over the hole, invert the cylinder onto it, and seal the edges with Six-One Mud to ensure stability. Heat with charcoal in a small, round furnace, positioning the charcoal seven to eight *cun* from the cylinder. When the cylinder glows purple-yellow, the realgar will melt and drip into the oil, forming strands one *chi* long or shorter, around seven to eight *cun*. Collect and process them as before.",
      "overlap_context": "th the divine, and the Dao will be fulfilled. After a hundred days, you will become an emissary of the Great One. After three years, you will achieve boundless union with Heaven and Earth, command ghosts and spirits, ascend the clouds with lightness, traverse the vast and limitless, leap through the skies, and ascend to pay homage to the Heavenly Sovereign, joining the ranks of immortals. This is transmitted among *zhenren*; fools are deluded by it.\n\nDongfang Shuo’s method for consuming realgar.",
      "start_char": 5020,
      "end_char": 6274,
      "start_sentence": 229,
      "end_sentence": 277,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.62028765678406,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\神仙服饵丹石行药法.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "凡五十上下，色正赤白如玉，乾折吹咀，盛以筒中，去油，代以白酒，亦互之如上法。 复五十上下，复吹咀之，合太一余粮一斗，并合和令相得，互之如前法。 去酒，代以肪蜜，互之如前法。 入蜜三十上下，可药成正白，臬如饵。 常日饮如梧实，五丸。 服之一旬，三虫皆消。 靡散服一月，魂魄内守。 服之百日，百病皆除，身体轻便。 服之一年，皮肤蛇蜕，寒温不能伤，贼鬼不能殃。 久服之，稍稍自少，后服一丸耳。 先师言欲养此药，先斋戒洁挣，无令妇人见之．也，恐有月经往来，触禁。 禁此最急，不可不慎。 神仙服食饵石 白石先生所受东华真人煮石之法，以致神仙，变形万化。 食石者，使，人百病除愈，痕瘢皆灭，肠厚藏香，六腑调适，骨坚气正，面体玉泽，魂魄柔炼，三尸消灭。 夫石者，盖金玉之父母也。 将以镇固骨液，凝和血脉，又亦是琼瑶之类也。 将能坚齿明目，发白反黑矣。 金玉石之精焉，犹麻油也，亦巨胜之膏也。 琼瑶乃金玉之凝津焉，犹桃胶亦桃树之流液也。 古人有服巨胜者，而速验於延年。 饮麻油，乃不必愈於巨胜散矣。 桃皮有胶，成於神仙，饵桃档更迟后於散屑也。 物有厅而必治，妙而难会，煮石之於服玉，其如是耶。 简夫食石之道，鲜有不合。 食玉之道，贵而观全。 所以然者，药难得则难恒也。 难恒则不久，难得则不专。 成败之者，恒由於此耳。 岂若食石者，触地而必晓哉。 岂若用药者，大泽之中皆凡草乎。 由是能石之卫径而可寻，水玉之方希而叵具也。 东方人得丹仙者少，何故耶。 丹法用戎盥、曾咸二物，非东地所生，故法不具，不具则药不成。 不成则无丹仙矣。 非都无丹仙者，得丹益者鲜也。 北方得石仙者少，何故耶。 煮石者用地榆、五茄二物，北方所不生也。 不生则难得，难得则石不可食，是故北方少石仙也。 故尹公度闻孟绰子、董士周，共相与言日：宁得一把五茄，不用金玉一车。 宁得一斤地榆，不用明月宝珠。 按此二人是服石得仙也。 常患二物不可得，故言不用金玉与明珠矣。 公度闻其语，意中密悟，乃请问用此物之故。 首问不已，久许时乃告之煮石方也。 一名丁叹子。 子欲得不死，当食丁叹子。 子欲无忧怀，当带地榆灰。 公度乃慨然，与同学者，及弟子家中数十人，专索市此药，并煮石而食之，皆得仙道。 晚共相将入南阳太和山中，多好石子故也。 是以公度作．谶日：金盐玉札子丹吞，千秋万岁为天仙。 何为急坐成泥尘，子丹吞者丁叹子也。 究言及语回隐之耳。 五茄一名金盐母。 地榆一名玉札父。 北羌人呼豉为札，当言玉豉也。 唯有金盐玉豉，可用煮丁叹子耳。 故帝舜登苍梧山曰：厥金玉之香草，朕用偃息正道，此五茄、地榆耳。 是以西城真人王屋山王常言：何以支长久，何不食石，畜金盥母。 何以得长寿，何不食石，用玉豉父。 此亦道煮石之卫耳。 盖五茄者，天五车之星精也，金应五湖，人应五德，位应五方，物应五事。 故青精入茎，则有东方之液。 白气入节，则有西方之津。 赤气入华，则有南方之光。 玄精入根，则有北方之粕。 黄烟入皮，则有戊己之灵。 五神镇生，相辅育成，用之者真仙，服之者反婴焉。 鲁定公母单服五茄酒，以致不死。",
      "translated_text": "For every fifty cycles above and below, when the substance turns a pure red-white like jade, dry it, grind it to powder, and store it in a cylinder. Remove the oil and replace it with clear wine, then alternate as in the method above. Repeat fifty cycles above and below, then grind it to powder again. Combine with one *dou* of *Taiyi* yuliang, mixing thoroughly, and alternate as before. Remove the wine and replace it with rendered honey, alternating as before. After thirty cycles above and below with honey, the medicine will become pure white, firm as a cake. Take daily a dose the size of a parasol-seed, five pellets. After ten days of consumption, the Three Worms will dissolve. After a month of scattered doses, the hun and po will be inwardly secured. After a hundred days, all illnesses will vanish, and the body will feel light and agile. After a year, the skin will shed like a snake’s, cold and heat will be unable to harm you, and malevolent spirits will bring no misfortune. With prolonged use, the dose may gradually be reduced, eventually to a single pellet.\n\nThe former master said: To prepare this medicine, first purify yourself through fasting and abstinence, ensuring no woman sees it, for fear of menstrual pollution, which would violate the taboo. This prohibition is most urgent and must not be neglected.\n\nThe *Divine Immortals’ Methods of Ingesting and Consuming Stones*, transmitted by Master White Stone from the Eastern Flower Realized One’s technique of boiling stones, enables one to attain immortality and transform the body in myriad ways. Those who consume stones find all illnesses cured, scars and blemishes erased, the intestines thickened and fragrant, the six viscera harmonized, the bones strengthened and qi rectified, the complexion lustrous as jade, the hun and po refined, and the Three Corpses obliterated. Stones are, after all, the parents of gold and jade. They serve to stabilize the marrow and consolidate the blood vessels, and they are also of the same kind as *qiongyao*. They can strengthen the teeth, brighten the eyes, and reverse white hair to black. The essence of gold, jade, and stone is like sesame oil, or the fat of *jusheng*. *Qiongyao* is the congealed sap of gold and jade, just as peach resin is the flowing liquid of the peach tree.\n\nThe ancients consumed *jusheng* and swiftly attained longevity. Drinking sesame oil is no less effective than taking *jusheng* powder. Peach bark yields resin, which the immortals refined, though its effects are slower than powdered forms. All things possess inherent efficacy and subtlety, though their wonders are difficult to grasp. Is the method of boiling stones for jade consumption not akin to this?\n\nFew who practice the Way of consuming stones fail to achieve success. The Way of consuming jade is esteemed yet difficult to perfect. The reason is this: rare medicines are hard to obtain, and what is hard to obtain cannot be used consistently. Inconsistency leads to brevity, and rarity leads to lack of focus. Success or failure often hinges on this. How can it compare to consuming stones, which are found everywhere upon the earth? Or to using medicines, when even the great marshes teem with common herbs?\n\nThus, the method of consuming stones is straightforward and easily pursued, while the formula for *shuiyu* is rare and difficult to procure. Few in the East attain cinnabar immortality—why? The cinnabar method requires *rongguan* and *zengxian*, two substances not native to the eastern lands. Without them, the method is incomplete, the medicine unmade, and thus no cinnabar immortals arise. It is not that there are no cinnabar immortals at all, but those who benefit from cinnabar are few.\n\nFew in the North attain stone immortality—why? The method of boiling stones requires *diyu* and *wuqie*, two substances not native to the northern lands. Their absence makes them difficult to obtain, and without them, stones cannot be consumed, hence the scarcity of stone immortals in the North.\n\nThus, when Yin Gongdu heard Meng Chuozi and Dong Shizhou conversing, he heard them say: \"Better a handful of *wuqie* than a cartload of gold and jade. Better a *jin* of *diyu* than luminous moon pearls.\" These two had attained immortality through consuming stones and constantly lamented the unavailability of these two substances, hence their dismissal of gold, jade, and pearls.\n\nGongdu, hearing their words, secretly pondered their meaning and inquired persistently about the use of these substances. After much time, they finally revealed the method of boiling stones to him. It is also called *Dingtanzi*. They said: \"If you wish not to die, consume *Dingtanzi*. If you wish to be free of cares, wear *diyu* ash.\" Gongdu then resolutely gathered his fellow students and disciples—dozens of people in his household—to diligently seek and purchase these medicines, boiling and consuming the stones together. All attained the immortal Way.\n\nLater, they entered the Taihe Mountains of Nanyang together, for the region abounded in fine stones. Thus, Gongdu composed a prophecy: \"Gold salt and jade札, cinnabar swallowed—thousands of autumns, ten thousand years as a celestial immortal. Why sit idly and turn to dust? The cinnabar swallowed is *Dingtanzi*.\" This saying alludes to hidden meanings.\n\n*Wuqie* is also called the mother of gold salt. *Diyu* is also called the father of jade札. The Qiang people of the North call *chi* \"札,\" so it should be called jade *chi*. Only gold salt and jade *chi* can be used to boil *Dingtanzi*.\n\nThus, when Emperor Shun ascended Mount Cangwu, he said: \"Those fragrant herbs of gold and jade—I use them to rest and uphold the true Way.\" These were *wuqie* and *diyu*.\n\nThe Perfected One of Western City, Wang Chang of Mount Wangwu, said: \"How to sustain longevity? Why not consume stones and store the mother of gold salt? How to attain long life? Why not consume stones and use the father of jade *chi*?\" This, too, is a method of boiling stones.\n\nNow, *wuqie* is the essence of the star of the Five Chariots of Heaven. It corresponds to gold in the Five Lakes, to the Five Virtues in humans, to the Five Directions in position, and to the Five Affairs in things. Thus, when blue essence enters the stem, it yields the liquid of the eastern direction. When white qi enters the node, it yields the sap of the western direction. When red qi enters the flower, it yields the radiance of the southern direction. When dark essence enters the root, it yields the dregs of the northern direction. When yellow mist enters the bark, it yields the numen of *wuji*. The Five Spirits govern life, nurturing and completing it. Those who use it become true immortals; those who consume it revert to infancy.\n\nRu Dinggong’s mother, Lady Shan, consumed *wuqie* wine and thereby attained immortality.",
      "overlap_context": " oil and bury it halfway in the ground, leaving a small hole in the center. Place the tray’s lid over the hole, invert the cylinder onto it, and seal the edges with Six-One Mud to ensure stability. Heat with charcoal in a small, round furnace, positioning the charcoal seven to eight *cun* from the cylinder. When the cylinder glows purple-yellow, the realgar will melt and drip into the oil, forming strands one *chi* long or shorter, around seven to eight *cun*. Collect and process them as before.",
      "start_char": 6274,
      "end_char": 7483,
      "start_sentence": 278,
      "end_sentence": 346,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.591012954711914,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\神仙服饵丹石行药法.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "临隐去阳，故托死，时人自莫之悟耳。 张子声仲阳、建始王叔才子世彦等，服酒而房室，得寿三百年，有子二十人。 世世有得服五茄酒散，而获延年不死者，不可胜数矣，而况兼之以食石乎。 北方既无二药，而好石之山亦少，唯陆浑、抱犊、青天、贝母数山，为有白石者耳，其余皆厅大盘石，巨峰累固，皆不可卒破坏，味又不美，如食土状，谓此厅理石为土石者也。 服之亦辟饥而已，无所延益矣。 夫凡食石，欲得细理缅缅，专是自然，无有破缺之形者也。 五色石子绝美，如肉同甘。 紫青石子，有如档脯，白石子如饭味，黄石子如芋味，碧石子小辛，绿石如捺味，真人多贵，以游宴五色石，亦以贮棵。 凡五色各一种味，真为奇矣。 地榆者，内有少阴之德，外禀太阳之气，下属戊已之神，上受荧惑之精，其实正黑如豉，阴之象也。 其叶赤如旗，阳之类也。 雾露而实不濡，太阳之气盛也。 类生平泽而结葩，凭之润也。 内外育阴阳之二气，表襄包水火之至德，所以铄玉烂石，摧坚伐难矣。 越人或呼为豉母，有以火炙其黑子，着石中，以调食令香也。 又煮其根，以作饮，亦如茗气。 煮其根取汁，以酿酒，治八风湿痹之病，有效。 判五茄茎，煮之取．汁，以纳够米，合酿之成酒，既美，常服之，治百病，令人耐老，发不白，强中。 选其根，亦可酿，与茎不异，但当有胜耳。 五茄根及茎皮，亦可散，服辟疾病，住老，患人自不能久服耳。 五茄根十斤，以七月七日采取，亦可用七月九日，诸以庚午、壬午日，皆可采。 亦可用十七日、十九日、甲戌甲申日，向日掘之，得南行根及直下根，益佳。 掘药人先斋】日一夕，沐浴烧香，其时又不得语他人云，掘药及履诸掩秽也。 取讫阴乾百日，以布囊盛之，佳好，诤洗，纳囊中，乃阴乾。 忌女人鹦犬，慎勿令见之。 地榆根十斤，以七月七日采，亦可九日采，用丁卯、癸卯、己卯及九日，皆好，背日光掘之，得南行及直下根佳。 掘者斋戒，一如掘五茄法。 阴乾百日，亦是忌掩秽。 亦可以此二物，各着一土釜中，烧之成灰。 临用时，各投一方寸匕。 无此二物，多用苏及香叶，南行根，皆可以煮石。 此二药唯令分等，令土釜足相容受而已，不必根十斤也。 阴乾出百日，乃佳。 过二百日不复中用。 当用两土釜，以蒲梨及毛和白土，白土当筛择令细，苦酒和为泥，两土釜内外数过上泥，令外厚一寸三分，内厚七分，坼又塞之，取令蜜细。 切五茄、地榆根，方四五分许，如竹答厚薄也。 令和调分等，乃盖上土釜，密泥两际会，阴乾九日，坼复泥之。 毕以安着臂上，乃以薪火烧之，七日七夕，计当用三百束樵。 樵皆令燥净，无用故薪。 七日限讫，寒之三日，乃发视之，灰正当作紫青色，药成也。 若故不作紫青色者，更火之七日，不以夜也。 七日讫，复寒之三日，无不成者。 皆当四面发火，以烧釜。 初先微火，若七日未竟，而樵尽，增樵也。 增七日已竟，而樵剩者尽樵也。 樵束大围半长五尺，计隐商为率。 亦可於屋下发火。 自非同志，勿令临见，及知其灵药之名。",
      "translated_text": "When the hermit feigned death to depart from the world of yang, none of his contemporaries understood. Zhang Zisheng, styled Zhongyang, and Wang Shucai, styled Shiyan, of Jianshi, consumed the wine and maintained their chambers, living three hundred years and fathering twenty sons. Generations of those who took the powdered *wuqie* wine to extend their years and escape death were too numerous to count—how much more so if combined with the consumption of stones.\n\nIn the north, the two elixirs are absent, and mountains rich in stones are few. Only Lühun, Baodu, Qingtian, and Beimu possess white stone, while the rest are vast slabs of rock, towering peaks piled high, impossible to swiftly break apart. Their taste is unpalatable, like eating earth—these are what are called \"earth-stones.\" Consuming them only wards off hunger, with no further benefit. Generally, when consuming stones, one should seek those with fine, dense veins, naturally whole and without cracks or flaws. The five-colored stone pellets are exquisite, sweet as meat. Purple-green stones resemble dried venison; white stones taste like rice; yellow stones like taro; azure stones are slightly pungent; green stones like pickled vegetables. True persons prize them, using them for feasts and storing them as provisions. Each of the five colors has its own unique flavor—truly marvelous.\n\n*Diyu* (burnet) possesses the virtue of minor yin within and receives the qi of grand yang without. Below, it is governed by the spirit of *wuji*; above, it absorbs the essence of Mars. Its fruit is black as fermented beans, embodying the image of yin. Its leaves are red as banners, akin to yang. Though mist and dew settle upon it, its fruit remains dry, for the qi of grand yang is abundant. It thrives in level marshes and blooms in clusters, nourished by moisture. Within and without, it nurtures the two qi of yin and yang, enveloping the supreme virtues of water and fire. Thus, it can melt jade and crumble stone, overcoming hardness and surmounting difficulty. The people of Yue sometimes call it \"fermented-bean mother.\" They roast its black seeds in stone to season food, imparting fragrance. Its roots may also be boiled into a drink, similar to tea. The juice from its roots, when brewed into wine, effectively treats the eight winds and damp impediment. Slicing the stems of *wuqie*, boiling them to extract the juice, and mixing it with glutinous rice to ferment into wine yields a fine brew. Regular consumption cures all diseases, prevents aging, keeps hair from whitening, and strengthens the center. Selecting its roots for brewing is also possible, differing little from the stems—though the roots may be superior.\n\nThe roots and bark of *wuqie* can also be powdered to dispel illness and halt aging, though the afflicted often cannot sustain long-term consumption. For *wuqie* roots, ten *jin* should be harvested on the seventh day of the seventh month, or alternatively the ninth day. Days such as *gengwu*, *renwu*, the seventeenth, nineteenth, *jiaxu*, or *jiashen* are also suitable. Digging toward the sun to obtain southward-growing roots or those extending straight downward yields the best results. The digger should fast for a day and night beforehand, bathe, burn incense, and avoid speaking to others about digging the medicine or stepping on any filth. Once collected, dry the roots in the shade for a hundred days, then store them in a cloth bag. Wash them clean before placing them in the bag to dry again. Keep them away from women, birds, and dogs—do not let these see them.\n\nFor *diyu* roots, ten *jin* should be harvested on the seventh or ninth day of the seventh month. Days such as *dingmao*, *guimao*, *jimao*, or the ninth day are also favorable. Dig away from sunlight to obtain southward-growing or straight-downward roots. The digger should observe the same fasting and purification as for *wuqie*. Dry the roots in the shade for a hundred days, avoiding all filth.\n\nThese two substances may also be placed separately in earthen cauldrons and burned to ash. When needed, take a square-inch spoonful of each. If these two are unavailable, use abundant *su* (perilla) and fragrant leaves, or southward-growing roots, to boil stones. The two medicines need only be of equal proportion, filling the earthen cauldron sufficiently—ten *jin* of roots are not necessary. Dry them in the shade for a hundred days; after two hundred days, they are no longer usable.\n\nUse two earthen cauldrons, lining them with *puli* (a type of rush) and *mao* (hair or fiber), mixed with white clay. Sift the white clay to ensure fineness, then blend it with bitter wine to form a paste. Coat the inside and outside of the cauldrons with this paste multiple times: the outer layer should be one *cun* and three *fen* thick, the inner layer seven *fen* thick. Seal any cracks tightly. Cut the *wuqie* and *diyu* roots into pieces roughly four to five *fen* in size, as thick as bamboo slips. Mix them in equal proportions, then cover the cauldrons and seal the seams with mud. Dry them in the shade for nine days, then reseal any cracks with mud.\n\nPlace the cauldrons on a stand and burn firewood beneath them for seven days and nights, requiring three hundred bundles of kindling. The wood must be dry and clean—do not use old firewood. After seven days, let them cool for three days before opening to inspect. If the ash has turned purple-green, the medicine is ready. If not, continue firing for another seven days, day and night. After the second seven days, cool them for three more days—failure is impossible. The fire should surround the cauldrons on all sides. Begin with a gentle flame; if the seven days are not yet complete and the firewood is exhausted, add more. If the seven days conclude and firewood remains, burn it all. Each bundle should be half the circumference of a man’s embrace and five *chi* long, measured by the standard of *yinshang*. The firing may also be done indoors.\n\nUnless they share the same aspiration, do not let others witness the process or learn the name of this numinous medicine.",
      "overlap_context": "it yields the sap of the western direction. When red qi enters the flower, it yields the radiance of the southern direction. When dark essence enters the root, it yields the dregs of the northern direction. When yellow mist enters the bark, it yields the numen of *wuji*. The Five Spirits govern life, nurturing and completing it. Those who use it become true immortals; those who consume it revert to infancy.\n\nRu Dinggong’s mother, Lady Shan, consumed *wuqie* wine and thereby attained immortality.",
      "start_char": 7483,
      "end_char": 8645,
      "start_sentence": 347,
      "end_sentence": 394,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.10108256340027,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\神仙服饵丹石行药法.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "名其灰为紫灰也。 名药正白，梼万杵，别器盛之。 色赤者不可用。 牝桂卒验者，梼 目视之有细坼，随复泥其坼，勿复坼也。 烧之以薪火，昼夜七日，发视色皆青者，可也。 未青者，复泥烧之七日，复寒之一日，发视未青，复烧如前，以色青为效也。 各异器盛之。 又取好名药纯白者，多少在意，梼之千杵，以云母水淹之令泥，泥尔正三物，各异器藏之。 欲用时，取流水中白石子，大如桃李者，打令中破甚细者，良。 用之一斗石子，以着煮器中，水淹之，令上有三四寸水。 取三药各重一方寸匕，投中搅之，猛火煮之，以物数数刺，视石子水尽，复益，熟则刺之入也，状如煮芋，可饱食取足，以当谷。 有葱盥豉及肉者，在意所加，益美耳。 张太玄将弟子二十余人，於陆浑山中，食此三十余年，皆肥丁。 天下太平，乃出。 无赤土釜者，赤缅赤瓶皆可用。 皆先斋戒二十一日，於密处起火，唯煮时不复污秽耳。 又法 直取五茄地榆根，阴乾，上釜中灰之如上法。 灰成，以三方寸匕，煮一斗石便熟，不须名药云母水也。 又煮石 常以七月七日，取地榆根，多少自在，阴乾百日，烧之为灰。 复取生者，与灰合梼万下，灰三分，梼生者末一分，合之。 欲为石二斗，若三斗渍石，水出石三寸，所用药粉水中搅之，然火煮之数沸，而烂如饵，可食取饱。 亦可与葱及盥豉煮如肉，所谓仙人石芋羹也。 真人服食饵石 取石大如鹦子，青白细泽如脂者，十枚，纳铜器中，渍汁一斗，纳地榆灰，大如鹦子者，炊一石米，顷成。 梼木玉大如鹅子，复煮之。 炊一石米，顷以箸刺之，熟如芋可食。 地榆根叶并烧作灰，用之木玉者，桂也。 或云筒母桂。 入山服石绝粮 取三色石，大如雀卵圆兜者，三七二十一枚。 欲服石时，先怀温，清旦吞青石七枚，日中吞赤石七枚，日暮吞白石七枚。 绝谷满十日，作葵子汤，姜去滓，服汁半升，须臾石即下矣。 挣洗石，后日复服。 先作碎米粥，清饮之二日，可食。 复洗故石服之，复绝食十五日，复作葵汤下之，如前复食粥清，可五日，复洗故石服之，可绝食百日。 复作葵汤下之，又服粥清，可食十日，复服故石，可绝一年。 一年之后，可至万日。 常洗故石服之，渴饮水，不食余物。 服石二年，日能行六百里，颜色转好，与神明通。 神仙举形 取石粉置寒水中，少顷水热如汤，可饮之。 如饮玉粉。 常服之可以轻举，涉水导山，可以去矣。 石粉所居者，气独上出。 ，天雨上乾，天燥上温，太一副世仙。 经日：石有玉白，或在山泽地气，必有美泉之源。 饮此泉水，皆通於神明。 神仙服食石锺乳 石锺乳，味甘，无毒，温。 一名孔公乳，主明目，下气益精。 故服食石锺乳，梼下筛，服之，恣口酒送，无酒水送之。 服百日，通神明。 久服，除百病，堪寒不饥。 服锺乳，当得其乳头，高二 寸，已下一寸，才触便折，为好。 其房曰：孔公孽，不如乳头也。 神仙服食饵赤石脂 赤石脂，味酸，无毒。 白石脂，味甘，无毒，平。 黑石脂，味咸，无毒，平。 黄石脂，味苦，无毒，平。 青石脂，味酸，无毒，平。 皆养性长年药也。 炼五石脂 梼末纳水中，研之令靡微净沙状，其泥石在下。 取其上者。 如此十五过，乾之。",
      "translated_text": "The ash is named \"purple ash.\" The medicine, when properly refined, is pure white; pound it ten thousand times and store it in a separate vessel. If the color is red, it cannot be used. For *pin gui* that proves effective upon testing, pound it while observing for fine cracks, then seal the cracks with mud to prevent further splitting. Burn it with firewood for seven days and nights; if upon inspection the color is entirely green, it is ready. If not yet green, reseal it with mud and burn for another seven days, then cool for one day. If upon inspection it remains ungreen, repeat the burning as before, taking the green color as the sign of success. Store each in separate vessels.\n\nTake fine, pure-white *ming yao*, in whatever quantity desired, pound it a thousand times, and soak it in mica-infused water until it becomes muddy. Mix these three substances evenly, and store each in separate vessels. When ready to use, take white pebbles from flowing water, the size of peaches or plums, and strike them to break into very fine pieces. For one *dou* of pebbles, place them in a cooking vessel and cover with water, leaving three to four *cun* of water above. Take one *fangcun bi* of each of the three medicines, add them to the vessel, and stir. Boil vigorously, frequently piercing with an implement to check the pebbles; when the water is nearly gone, replenish it. When fully cooked, the pebbles will be easily pierced, resembling boiled taro. Eat to satiety as a substitute for grain. Onions, salted beans, or meat may be added as desired for enhanced flavor.\n\nMaster Zhang Taixuan, with over twenty disciples, consumed this in the Luhun Mountains for more than thirty years, all growing robust. They emerged only when the world was at peace. If no red-clay cauldrons are available, red-glazed jars or red bottles may be used. All must first purify themselves for twenty-one days, kindle the fire in a secluded place, and avoid defilement only during the cooking process.\n\nAnother method: simply take the roots of *wu qie di yu*, dry them in the shade, and burn them in a cauldron as described above. Once the ash is ready, use three *fangcun bi* to cook one *dou* of pebbles until done—no *ming yao* or mica-infused water is needed.\n\nFor cooking stones: on the seventh day of the seventh month, gather *di yu* roots in any quantity, dry them in the shade for a hundred days, and burn them to ash. Then take fresh roots, pound them together with the ash—three parts ash to one part fresh root—and combine. To prepare two or three *dou* of stones, soak them in water with three *cun* of water above, stir in the medicinal powder, and boil until bubbling. When tender like rice cakes, they may be eaten to satiety. They may also be cooked with onions and salted beans like meat—this is the \"immortal’s stone-taro stew.\"\n\nFor the Realized One’s method of consuming stones: take stones the size of pigeon eggs, fine and lustrous like jade, ten in number, place them in a bronze vessel, and soak in one *dou* of juice. Add *di yu* ash the size of pigeon eggs, and cook with one *shi* of rice until done. Pound *mu yu* the size of goose eggs, then boil again. Cook with one *shi* of rice until done, piercing with chopsticks; when tender like taro, they may be eaten. The *di yu* roots and leaves are burned to ash for use with *mu yu*, which is cinnamon—or some call it *tong mu gui*.\n\nTo enter the mountains and consume stones while fasting: take three types of stones, round and the size of sparrow eggs, twenty-one in total. When ready to consume, first warm the body. At dawn, swallow seven green stones; at midday, seven red stones; at dusk, seven white stones. After ten days of fasting, prepare mallow-seed broth, strain out the dregs, and drink half a *sheng* of the liquid. Soon the stones will descend. Wash the stones, and consume them again the next day. First prepare a thin rice porridge and drink the clear liquid for two days before eating. Wash the used stones and consume them again, then fast for fifteen days. Prepare mallow broth to induce their descent as before, then drink the porridge’s clear liquid for five days. Wash the used stones and consume them again, fasting for a hundred days. Prepare mallow broth once more to induce their descent, then drink the porridge’s clear liquid for ten days. Consume the used stones again, and one may fast for a year. After a year, one may extend this to ten thousand days. Continuously wash and consume the used stones, quenching thirst with water and eating nothing else. After two years of consuming stones, one may walk six hundred *li* in a day, one’s complexion will improve, and one will commune with the divine.\n\nTo ascend as an immortal: place stone powder in cold water; after a short while, the water will grow hot as broth and may be drunk. Like drinking jade powder, regular consumption enables one to become weightless, traverse water and mountains, and depart. Where stone powder resides, its *qi* rises uniquely. When the sky rains, the area above remains dry; when the sky is arid, the area above remains warm—this is the celestial counterpart of worldly immortality.\n\nThe *Classic* states: \"Stones with jade-like whiteness, found in the *qi* of mountains, marshes, or earth, must have a source of fine springs. Drinking this spring water all connects one to the divine.\"\n\nFor consuming stalactites: stalactites are sweet in flavor, non-toxic, and warming. Also called *kong gong ru*, they brighten the eyes, descend *qi*, and replenish essence. To consume, pound them, sift, and take freely, washing them down with wine or water if no wine is available. After a hundred days, one will commune with the divine. With prolonged consumption, all illnesses are dispelled, and one becomes resistant to cold and hunger. When consuming stalactites, one should obtain those with stalactite tips two *cun* in height; those less than one *cun* that break upon touch are superior. Their chambers are called *kong gong nie*, but these are inferior to the stalactite tips.\n\nFor consuming red halloysite: red halloysite is sour in flavor and non-toxic. White halloysite is sweet, non-toxic, and neutral. Black halloysite is salty, non-toxic, and neutral. Yellow halloysite is bitter, non-toxic, and neutral. Green halloysite is sour, non-toxic, and neutral. All are medicines for nourishing life and prolonging years.\n\nTo refine the five halloysites: pound them into powder, place in water, and grind until fine like sand, with the sediment settling below. Collect the upper portion. Repeat this process fifteen times, then dry.",
      "overlap_context": "re should surround the cauldrons on all sides. Begin with a gentle flame; if the seven days are not yet complete and the firewood is exhausted, add more. If the seven days conclude and firewood remains, burn it all. Each bundle should be half the circumference of a man’s embrace and five *chi* long, measured by the standard of *yinshang*. The firing may also be done indoors.\n\nUnless they share the same aspiration, do not let others witness the process or learn the name of this numinous medicine.",
      "start_char": 8645,
      "end_char": 9901,
      "start_sentence": 395,
      "end_sentence": 464,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.4546959400177,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\神仙服饵丹石行药法.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "日服三合，绝谷不饥，身轻益气，耐风寒。 服之当精意斋戒，不能斋戒，不可轻服。 此药不化，害人。 药不化，煮大麻子，得其汁令熟五升则下矣。 若无麻子服，煎肥羊脂一斤，饮之亦善。 五石难得，当谨慎之。 神仙服食紫石英 紫石英，味辛温，无毒。 服食紫石英，寿三百岁，含之不饥渴。 神仙服饵丹石行药法竟",
      "translated_text": "Daily consumption of three *ge* will eliminate the need for grains, stave off hunger, lighten the body, augment *qi*, and fortify against wind and cold. When taking this medicine, one must fast with utmost sincerity and purity; without such fasting, it must not be taken lightly. If the medicine does not dissolve, it will harm the person. To resolve this, boil hemp seeds to obtain five *sheng* of their juice, which will facilitate its descent. If hemp seeds are unavailable, simmer one *jin* of rich mutton fat and consume it—this is also effective. The five minerals are difficult to obtain; one must handle them with great care.\n\n**Immortals’ Consumption of Purple Fluorite**\nPurple fluorite is pungent in flavor, warm, and non-toxic. Consuming purple fluorite bestows a lifespan of three hundred years, and holding it in the mouth prevents hunger and thirst.\n\n**Conclusion of the Immortals’ Methods for Consuming Cinnabar and Minerals as Medicines**",
      "overlap_context": "in flavor and non-toxic. White halloysite is sweet, non-toxic, and neutral. Black halloysite is salty, non-toxic, and neutral. Yellow halloysite is bitter, non-toxic, and neutral. Green halloysite is sour, non-toxic, and neutral. All are medicines for nourishing life and prolonging years.\n\nTo refine the five halloysites: pound them into powder, place in water, and grind until fine like sand, with the sediment settling below. Collect the upper portion. Repeat this process fifteen times, then dry.",
      "start_char": 9901,
      "end_char": 10049,
      "start_sentence": 465,
      "end_sentence": 474,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 5.79936957359314,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\神仙服饵丹石行药法.txt",
        "category": "玉诀类"
      }
    }
  ]
}