{
  "source_id": "种芝草法",
  "source_file": "chunked_daozang\\种芝草法.json",
  "total_chunks": 2,
  "total_original_chars": 1757,
  "total_translated_chars": 10270,
  "total_translation_time": 52.92756223678589,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\众术类\\种芝草法.txt",
    "category": "众术类"
  },
  "full_translation": "**Method for Cultivating Zhi Herbs**\n\n*Scripture Title:* *Method for Cultivating Zhi Herbs*\n*Author:* Unknown, likely composed during the Northern and Southern Dynasties or the Sui-Tang period. One scroll.\n*Source:* *Daoist Canon of the Zhengtong Era*, *Dongshen Section*, *Category of Miscellaneous Arts*.\n\n**Method for Cultivating Zhi Herbs**\n\nThe Yellow Emperor inquired: \"May I dare ask about the method for cultivating zhi herbs as recorded in the stone chamber texts?\"\n\nThe reply came: \"Within the *Seventh Scripture on Cultivating Zhi*, Laozi states: 'Alas, you who are not yet transcendent! All know that life is joy and death is suffering, yet none understand how life arises of itself. Though a thousand guards and ten thousand medicines enter the body, they may only grant long life—extending to a thousand years, or several hundred at best—yet they cannot enable one to soar and ascend as an immortal, to pay homage to the Heavenly Sovereign.\n\nAmong tree medicines, pine resin is the finest. This tree produces *fuling* (poria) because of its rich sap, and its hanging fruits may be consumed. Among long grasses, the finest are *huangjing* (polygonatum), *tianmendong* (asparagus root), and *shanji* (thistle). These should be taken daily without fail, restoring one’s original vitality in a hundred days, yet they still cannot match the span of heaven and earth. Later generations of alchemists have embellished these teachings, leading scholars astray—I deeply lament this.\n\nThe eight minerals and nine elixirs, mica and jade nectar—though one abstains from sexual relations and meat, they cannot make the body light enough to ascend or ride the clouds. I have heard that immortals consume *ziying* (purple essence)—how could this be mere empty talk?\n\nOn the northern slopes of famous mountains, above springs of yang essence and beneath trees and stones, zhi also grows. It is said that what it receives are the essences of mountains, waters, trees, and earth. Zhi also grows upon cinnabar, gold, malachite, and realgar. Yet these zhi herbs are not encountered by those without utmost virtue to move the spirits; even if seen, they cannot be obtained and consumed.\n\nThe reason these zhi can make one an immortal on the spot is that they absorb the purest essences of these four substances, containing the harmonious qi of heaven and earth’s yin and yang. Their medicinal vapors and fluids coalesce to form life, and their flavor surpasses the original nature of these four substances. Now, if one merely refines these four substances and consumes them, the effect is minimal. But if one cuts them with ritual intent, places them in a crucible, and allows their essence to ascend, sweeping and consuming it, then the efficacy of a hundred herbs is not merely equaled.\n\nThe key is to obtain the pure qi of heaven and earth. Without drawing forth the refined fluids of these four substances and allowing them to ascend and transform into living matter, their potency remains a hundredfold weaker. If one places them in an upper crucible, I shall depart. Reflecting on the countless multitudes who will turn to ash and dust—how lamentable!\n\nNow, I record the *Celestial Zhi Scripture*. Those with destined lifespans may receive this text. If one’s ancestors bore sins, one may not attain longevity, nor obtain this scripture. Hide it within a famous mountain, beneath nine layers of stone caskets. Do not transmit it recklessly—beware, beware!\n\nOn the day of *Lichun* (Beginning of Spring), dig a pit in the *yinshi* (northeast) sector of a tomb or dwelling, ensuring no structures stand inside or out. Seek good soil, not ash-like earth. Dig a pit three *chi* deep and three *chi* square. Take one *jin* of malachite, grind it to powder, wrap it in sheep’s wool, and pour one *sheng* of *qingxiangzi* (celosia seeds) over it. Then cover it with soil and tamp it down. After seven days, a blue-green cloud should appear. After a hundred days, zhi will sprout above, resembling seedlings.\n\nOn a *yin* or *mao* day (Tiger or Rabbit), approach from below. Hold a three-*chi* length of blue-green silk, grasp a bone knife, perform the *Yu step*, and pluck the zhi without looking back. Return and dry it in the shade for a hundred days, then grind it to powder. Consume one *daogui* (a small measure) with *jinghua* water (dew collected at dawn). Take three doses daily. By day, one will become light enough to ascend. Spirits will come to welcome you, and after a hundred days, you will ascend to heaven. The method is as enduring as heaven and earth.\n\nOn the day of *Lixia* (Beginning of Summer), on the southern slope of a mountain, dig a pit eight *chi* deep and eight *chi* square. Take two *jin* of cinnabar, grind it to powder, wrap it in realgar of a red hue, crush it to remove impurities, and place the cinnabar powder within. Pour two *sheng* of *xuanshen* (figwort root) over it, cover with soil, and tamp it flat. After sixteen days, a red cloud should cover it. After eighty days, a red vapor like smoke will rise and connect with the red cloud. After a hundred days, red zhi will sprout above, resembling seedlings.\n\nOn a *si* or *wu* day (Snake or Horse), at the time of *si* or *wu*, approach from the direction of the sun. Perform the *Yu step* with an eight-*chi* length of crimson silk, and use a wooden knife to harvest it. Bow twice and depart without looking back. Dry it in the shade for a hundred days, then prepare a *fangcun* (square-inch) measure. Take one dose daily at dawn, when the sun has risen less than one *chi* above the horizon, washing it down with *jinghua* water. By midday, the *sanshi* (three corpses), *jiuchong* (nine worms), seven illnesses, wild pulmonary disorders, abscesses, accumulations, and the hundred diseases will all transform into turbid blood and exit through the nose and mouth. Wash with *jinghua* water, and you will be able to walk upon water, untouched by flames, and cease eating and drinking, transcending the mortal world. Do not enter houses or consume meat, and a dragon chariot with a host of immortals will come to welcome you. If you wish to remain among the people, do not cultivate this zhi.\n\nOn the day of *Liqiu* (Beginning of Autumn), on the northern slope of a western mountain, dig a pit six *chi* deep and six *chi* square. Take one *jin* of gold, refine it with fire, and place it in the pit. Pour one *jin* of *xushan hexi* (spreading hempvine), one *hu* of clear wine, and one *hu* of duckweed over it. Cover with soil and tamp it down. After six days, a white cloud will come to cover it. After sixty days, a yellow vapor like steam will rise, connecting with the white cloud. After a hundred days, yellow zhi will sprout above, resembling seedlings.\n\nOn a *shen* or *you* day (Monkey or Rooster), at the time of *shen* or *you*, approach from the direction of the sun. Perform the *Yu step* with a six-*chi* length of white silk, and use a gold knife to harvest it. Bow twice and depart without looking back. Dry it in the shade for a hundred days, then consume three pinches of the zhi. The old will become young again, the young will bloom with radiance, white hair will turn black, and fallen teeth will regrow. Leaping and bounding upon the earth, you will be able to fly into the heavens at will, accompanied by immortal attendants and jade maidens, who will inquire about your journey and destination.\"\n\nOn a day in the final month of winter, at the northern slope of a mountain, dig a pit five *chi* deep and bury three *jin* of realgar within. Refine it and place it in a vessel of wrought copper, then pour two *jin* of hemp oil over it. Cover it with one *jin* of realgar powder, tamp the earth above, and after five days, a black cloud will descend to cover it. After fifty days, a purple vapor will rise, connecting with the black cloud. After a hundred days, purple zhi will sprout above, resembling seedlings. On those nights, its light will illuminate a *li* in all directions, and on overcast days, its radiance will be visible even in fine detail.\n\nOn a *ren* or *gui* day (Water days), approach from the direction of the sun. Use a horn knife, and on a *bing* or *xin* day (Fire days), employ a five-*chi* length of black silk to harvest it. Bow twice and depart without looking back.\n\nDry it in the shade for a hundred days, then on a *zi* or *hai* day (Rat or Pig), grind it into powder. Consume one-fifth of it at midnight on a *zi* day, facing north. When the zhi is exhausted, the old will transform into children, and women may also consume this zhi. The Celestial Overseer of Destiny and the Great Unity will dispatch immortal officials to welcome them. Their lifespan will equal that of heaven and earth, and they will be untouched by blades, unburned by fire, undrowned by water, and free from the five poisons. They will know neither hunger nor thirst.\n\nThose who consume this and the four zhi will attain eternal life and immortality. Wherever they reside, celestial officials will provide traveling kitchens, and they may even cease eating. Conceal it in mountains and marshes. It will summon the mounts of dragons and tigers, and spirits and gods will come to pay homage, awaiting commands. Guard this secret closely.\n\nThe commentator says: From this, we see that the numbers of heaven and earth, yin and yang, can transform and give life to the myriad things—how can one say they do not exist? It is like using a yang burning-mirror to capture fire or a yin burning-mirror to gather water. Even bamboo hidden within can generate flame—how can one say there is no resonance? With a cinnabar crucible, mercury too can be stirred into essence. What thing cannot be transformed? What thing cannot be accomplished? By borrowing the transformations of things, one may produce the hidden gold casket.\n\nGuard this secret carefully. Only those with destined bones will encounter your form. Diligently cultivate your joy and authority, and the Celestial Overseer of Destiny will erase your name from the register of death. You will ascend with heaven and earth, roaming above the Nine Heavens and traversing the Six Directions. Your spiritual powers will penetrate all, and your blessings will be boundless.\n\nHere ends the method for cultivating zhi herbs.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "种芝草法 经名：种芝草法。 未着撰人，约出矜南北朝或隋唐。 一卷。 底本出处：《正统道藏》洞神部众街类。 种芝草法 黄帝问日：敢问石室之文种芝法，可得闻乎。 曰：种芝第七经内，有老子曰：咨尔非人，皆知生之为乐，死之为恶，而莫知其所以自生也。 千卫万药入兆身，止可得老寿，千年已还，数百年已上，终不能使飞行登仙，上朝天皇也。 木药之善者，松脂也。 此木生狭苓，有脂肥故也，其垂实可服。 长草之善者，荣华黄精、天门冬、山蓟也。 止宜日每服，不得一日有废也。 可得百日还元，其不能与天地相毕。 后世方士增加其说，以误学者，吾深闵之。 八石九丹，云母玉浆，服之当断房室、血食，不能使兆轻举，飞行乘云也。 闻仙人服紫英不耶，岂空言也。 夫名山之阴，阳精泉水之上，木石之下，亦生芝，日：其所禀皆山水木土之精。 丹砂之上，黄金之上，曾青之上，雄黄之上，皆生芝。 此芝非至德感神者，逢而不见，见而不得食也。 此芝之所以能使人立仙者，受此四物之至精，含天地阴阳之和气，药熏蒸之津液，以符生成，其味乃神於此四物之本体也。 今但取此四物梼治，服之为最薄者、切之以感应会，内之於炉釜之中，其精上飞，扫而服之。 则百部於．草药，不徒於服也。 要得天地之淳气，不接引此四物之精液，而令其上，更成生物，不亦当复百部，於其上着上釜者，即余将去矣。 顾念兆兆将成灰土，衰哉。 今撰天文芝，其有骨命者，当得吾此文。 其先人有罪，其身不得应长生，亦不得吾书。 藏之名山，石函九重之下，无妄传，慎之慎之。 当以立春之日，掘冢束寅地宅，内外无有也。 要欲得善土，非灰壤者，掘为坑，深三尺，方三尺，以曾青一斤，治为屑，裹以羊负，来沃以青箱子一升，复以土筑其上，七日当有青云也。 百日上生芝，其状如苗。 以寅卯之日，从其下，以青缯三尺，执骨刀，禹步，而颊取之，慎无以顾。 归乾百日，治以屑，服一刀圭，以井花水，日服三芝，昼则能轻举，当有神来迎之，百日升天，法与天地无穷矣。 当以立夏之日，於南山之阳，掘地为坑，深八尺，方八尺，以丹砂二斤，治为屑，裹以雄黄赤色者，碎碾，去其颊石，以丹屑纳其中，沃以玄参二升，覆土於上，筑其平，二八日当有赤云覆之，八十日上生赤气如烟，与赤相接，百日上生赤芝，如苗状。 以巳午之日。 从日下禹步，以绛缯八尺，以木刀采之，再拜而去，勿复顾也。 还阴乾百日，治方寸七，日一服，皆以清旦日始出未一尺时，以井花水送下，昼时三尸九虫，七疾野肺，痕积聚百病，皆化为浊血，从鼻口中出。 以井花水洗之，即能步行水上，焰火不灼，绝饮不食，去世矣。 勿令入房屋，绝血食，即有龙车众仙来迎之。 欲止民问，慎勿种此芝。 当以立秋之日，於西山之阴，掘地为坑，深六尺，方六尺，以黄金一斤，火洋之，投於坑中，灌以虚山鹤膝草一斤，清酒一斛，浮萍一斛，覆其上，土筑之，六日有白云来覆之，六十日上生黄气如蒸，上连白云，百日上生黄芝，如苗状。 以申酉日申酉时，欲取日下，以白素六尺，禹步，以金刀采之，再拜而去，无复顾还。 阴乾百日，治服三指撮芝尽，老者更少，少者华色生，头白者皆黑，齿落复生，奋乎瑜地，即能飞入天中，任意取之，亦当有神仙玉女侍从，问以去止投之事也。",
      "translated_text": "**Method for Cultivating Zhi Herbs**\n\n*Scripture Title:* *Method for Cultivating Zhi Herbs*\n*Author:* Unknown, likely composed during the Northern and Southern Dynasties or the Sui-Tang period. One scroll.\n*Source:* *Daoist Canon of the Zhengtong Era*, *Dongshen Section*, *Category of Miscellaneous Arts*.\n\n**Method for Cultivating Zhi Herbs**\n\nThe Yellow Emperor inquired: \"May I dare ask about the method for cultivating zhi herbs as recorded in the stone chamber texts?\"\n\nThe reply came: \"Within the *Seventh Scripture on Cultivating Zhi*, Laozi states: 'Alas, you who are not yet transcendent! All know that life is joy and death is suffering, yet none understand how life arises of itself. Though a thousand guards and ten thousand medicines enter the body, they may only grant long life—extending to a thousand years, or several hundred at best—yet they cannot enable one to soar and ascend as an immortal, to pay homage to the Heavenly Sovereign.\n\nAmong tree medicines, pine resin is the finest. This tree produces *fuling* (poria) because of its rich sap, and its hanging fruits may be consumed. Among long grasses, the finest are *huangjing* (polygonatum), *tianmendong* (asparagus root), and *shanji* (thistle). These should be taken daily without fail, restoring one’s original vitality in a hundred days, yet they still cannot match the span of heaven and earth. Later generations of alchemists have embellished these teachings, leading scholars astray—I deeply lament this.\n\nThe eight minerals and nine elixirs, mica and jade nectar—though one abstains from sexual relations and meat, they cannot make the body light enough to ascend or ride the clouds. I have heard that immortals consume *ziying* (purple essence)—how could this be mere empty talk?\n\nOn the northern slopes of famous mountains, above springs of yang essence and beneath trees and stones, zhi also grows. It is said that what it receives are the essences of mountains, waters, trees, and earth. Zhi also grows upon cinnabar, gold, malachite, and realgar. Yet these zhi herbs are not encountered by those without utmost virtue to move the spirits; even if seen, they cannot be obtained and consumed.\n\nThe reason these zhi can make one an immortal on the spot is that they absorb the purest essences of these four substances, containing the harmonious qi of heaven and earth’s yin and yang. Their medicinal vapors and fluids coalesce to form life, and their flavor surpasses the original nature of these four substances. Now, if one merely refines these four substances and consumes them, the effect is minimal. But if one cuts them with ritual intent, places them in a crucible, and allows their essence to ascend, sweeping and consuming it, then the efficacy of a hundred herbs is not merely equaled.\n\nThe key is to obtain the pure qi of heaven and earth. Without drawing forth the refined fluids of these four substances and allowing them to ascend and transform into living matter, their potency remains a hundredfold weaker. If one places them in an upper crucible, I shall depart. Reflecting on the countless multitudes who will turn to ash and dust—how lamentable!\n\nNow, I record the *Celestial Zhi Scripture*. Those with destined lifespans may receive this text. If one’s ancestors bore sins, one may not attain longevity, nor obtain this scripture. Hide it within a famous mountain, beneath nine layers of stone caskets. Do not transmit it recklessly—beware, beware!\n\nOn the day of *Lichun* (Beginning of Spring), dig a pit in the *yinshi* (northeast) sector of a tomb or dwelling, ensuring no structures stand inside or out. Seek good soil, not ash-like earth. Dig a pit three *chi* deep and three *chi* square. Take one *jin* of malachite, grind it to powder, wrap it in sheep’s wool, and pour one *sheng* of *qingxiangzi* (celosia seeds) over it. Then cover it with soil and tamp it down. After seven days, a blue-green cloud should appear. After a hundred days, zhi will sprout above, resembling seedlings.\n\nOn a *yin* or *mao* day (Tiger or Rabbit), approach from below. Hold a three-*chi* length of blue-green silk, grasp a bone knife, perform the *Yu step*, and pluck the zhi without looking back. Return and dry it in the shade for a hundred days, then grind it to powder. Consume one *daogui* (a small measure) with *jinghua* water (dew collected at dawn). Take three doses daily. By day, one will become light enough to ascend. Spirits will come to welcome you, and after a hundred days, you will ascend to heaven. The method is as enduring as heaven and earth.\n\nOn the day of *Lixia* (Beginning of Summer), on the southern slope of a mountain, dig a pit eight *chi* deep and eight *chi* square. Take two *jin* of cinnabar, grind it to powder, wrap it in realgar of a red hue, crush it to remove impurities, and place the cinnabar powder within. Pour two *sheng* of *xuanshen* (figwort root) over it, cover with soil, and tamp it flat. After sixteen days, a red cloud should cover it. After eighty days, a red vapor like smoke will rise and connect with the red cloud. After a hundred days, red zhi will sprout above, resembling seedlings.\n\nOn a *si* or *wu* day (Snake or Horse), at the time of *si* or *wu*, approach from the direction of the sun. Perform the *Yu step* with an eight-*chi* length of crimson silk, and use a wooden knife to harvest it. Bow twice and depart without looking back. Dry it in the shade for a hundred days, then prepare a *fangcun* (square-inch) measure. Take one dose daily at dawn, when the sun has risen less than one *chi* above the horizon, washing it down with *jinghua* water. By midday, the *sanshi* (three corpses), *jiuchong* (nine worms), seven illnesses, wild pulmonary disorders, abscesses, accumulations, and the hundred diseases will all transform into turbid blood and exit through the nose and mouth. Wash with *jinghua* water, and you will be able to walk upon water, untouched by flames, and cease eating and drinking, transcending the mortal world. Do not enter houses or consume meat, and a dragon chariot with a host of immortals will come to welcome you. If you wish to remain among the people, do not cultivate this zhi.\n\nOn the day of *Liqiu* (Beginning of Autumn), on the northern slope of a western mountain, dig a pit six *chi* deep and six *chi* square. Take one *jin* of gold, refine it with fire, and place it in the pit. Pour one *jin* of *xushan hexi* (spreading hempvine), one *hu* of clear wine, and one *hu* of duckweed over it. Cover with soil and tamp it down. After six days, a white cloud will come to cover it. After sixty days, a yellow vapor like steam will rise, connecting with the white cloud. After a hundred days, yellow zhi will sprout above, resembling seedlings.\n\nOn a *shen* or *you* day (Monkey or Rooster), at the time of *shen* or *you*, approach from the direction of the sun. Perform the *Yu step* with a six-*chi* length of white silk, and use a gold knife to harvest it. Bow twice and depart without looking back. Dry it in the shade for a hundred days, then consume three pinches of the zhi. The old will become young again, the young will bloom with radiance, white hair will turn black, and fallen teeth will regrow. Leaping and bounding upon the earth, you will be able to fly into the heavens at will, accompanied by immortal attendants and jade maidens, who will inquire about your journey and destination.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1286,
      "start_sentence": 0,
      "end_sentence": 42,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.19409108161926,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\种芝草法.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "当以季冬之日，於北山之阴，掘地为坑，深五尺，埋雄黄三斤，治之，以熟铜器盛之，灌以麻油二斤，覆以雄黄粉一斤，覆上筑之，五日上有黑云来覆其上，五十日上生紫气，与黑气相连，百日上生紫芝，如苗状，其夜则光照一里之内，天阴见毫光也。 以壬癸日，从日下，以角刀，丙辛日，以黑缯五尺，采之，再拜而去，勿复顾也。 阴乾百日，以子亥日治末，服之五分，七日以夜半子时，北向服之也。 芝尽则老化为童子，女人亦可服此芝者，司命太乙遣仙官迎之，寿与天地同绿刻不入，火烧不灼，水溺不湿，五毒远之，不知饥渴。 服此、四芝，皆长生不死，期所在，致天官行厨，亦可不食。 藏所在山泽。 供给龙虎之乘，鬼神来拜，受使秘之。 论者曰：以此言之，天地阴阳之数，能变生万物，不可云无。 譬如阳燧取火，阴燧取水，内藏竹生火，何谓之不感乎。 其有丹砂之釜，亦成水银感动之精，何物不可化，何物不可成。 假托物类变化，而生藏之金柜。 慎勿泄漏，有骨命者，乃逢汝形，勤加权喜，司命除其死籍，天地俱并，游於九天之上，展转六合之中，神通洞达，祚享无穷。 种芝草法竟",
      "translated_text": "On a day in the final month of winter, at the northern slope of a mountain, dig a pit five *chi* deep and bury three *jin* of realgar within. Refine it and place it in a vessel of wrought copper, then pour two *jin* of hemp oil over it. Cover it with one *jin* of realgar powder, tamp the earth above, and after five days, a black cloud will descend to cover it. After fifty days, a purple vapor will rise, connecting with the black cloud. After a hundred days, purple zhi will sprout above, resembling seedlings. On those nights, its light will illuminate a *li* in all directions, and on overcast days, its radiance will be visible even in fine detail.\n\nOn a *ren* or *gui* day (Water days), approach from the direction of the sun. Use a horn knife, and on a *bing* or *xin* day (Fire days), employ a five-*chi* length of black silk to harvest it. Bow twice and depart without looking back.\n\nDry it in the shade for a hundred days, then on a *zi* or *hai* day (Rat or Pig), grind it into powder. Consume one-fifth of it at midnight on a *zi* day, facing north. When the zhi is exhausted, the old will transform into children, and women may also consume this zhi. The Celestial Overseer of Destiny and the Great Unity will dispatch immortal officials to welcome them. Their lifespan will equal that of heaven and earth, and they will be untouched by blades, unburned by fire, undrowned by water, and free from the five poisons. They will know neither hunger nor thirst.\n\nThose who consume this and the four zhi will attain eternal life and immortality. Wherever they reside, celestial officials will provide traveling kitchens, and they may even cease eating. Conceal it in mountains and marshes. It will summon the mounts of dragons and tigers, and spirits and gods will come to pay homage, awaiting commands. Guard this secret closely.\n\nThe commentator says: From this, we see that the numbers of heaven and earth, yin and yang, can transform and give life to the myriad things—how can one say they do not exist? It is like using a yang burning-mirror to capture fire or a yin burning-mirror to gather water. Even bamboo hidden within can generate flame—how can one say there is no resonance? With a cinnabar crucible, mercury too can be stirred into essence. What thing cannot be transformed? What thing cannot be accomplished? By borrowing the transformations of things, one may produce the hidden gold casket.\n\nGuard this secret carefully. Only those with destined bones will encounter your form. Diligently cultivate your joy and authority, and the Celestial Overseer of Destiny will erase your name from the register of death. You will ascend with heaven and earth, roaming above the Nine Heavens and traversing the Six Directions. Your spiritual powers will penetrate all, and your blessings will be boundless.\n\nHere ends the method for cultivating zhi herbs.",
      "overlap_context": "length of white silk, and use a gold knife to harvest it. Bow twice and depart without looking back. Dry it in the shade for a hundred days, then consume three pinches of the zhi. The old will become young again, the young will bloom with radiance, white hair will turn black, and fallen teeth will regrow. Leaping and bounding upon the earth, you will be able to fly into the heavens at will, accompanied by immortal attendants and jade maidens, who will inquire about your journey and destination.\"",
      "start_char": 1287,
      "end_char": 1738,
      "start_sentence": 43,
      "end_sentence": 55,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.733471155166626,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\种芝草法.txt",
        "category": "众术类"
      }
    }
  ]
}