{
  "source_id": "秘传正阳真人灵宝毕法",
  "source_file": "chunked_daozang\\秘传正阳真人灵宝毕法.json",
  "total_chunks": 16,
  "total_original_chars": 17294,
  "total_translated_chars": 99586,
  "total_translation_time": 474.78640604019165,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太清部\\秘传正阳真人灵宝毕法.txt",
    "category": "正统道藏太清部"
  },
  "full_translation": "**The Esoteric Transmission of the True Man of Orthodox Yang’s Complete Methods of the Numinous Treasure**\n\n**Scripture Title:** *The Esoteric Transmission of the True Man of Orthodox Yang’s Complete Methods of the Numinous Treasure* (abbreviated as *Complete Methods of the Numinous Treasure*), three scrolls. Originally attributed to Zhongli Quan, transmitted by Lü Yan, dating from the Tang interregnum to the Five Dynasties period. Base text from the *Daoist Canon of the Orthodox Tradition*, *Great Clarity* section.\n\n---\n\n**Preface to the *Complete Methods of the Numinous Treasure***\n\nThe Dao cannot be transmitted through words, nor can it be recorded by name. Since ancient times, those who ascended as immortals and attained the Dao have been many.\n\nI, in my aspiration, have long admired the sages of old and cherished the Great Dao in my heart. Yet, as the times turned to the chaos of war and the world fell into peril, I first sought refuge, wandering among rivers, lakes, and mountain valleys. In retreat, I came to know my nature and turned my mind toward purity, stillness, and the subtle.\n\nHaving perused the alchemical classics and repeatedly consulted with fellow Daoists, I found that they spoke only of minor arts for nourishing life, never of the great Dao of true immortality. Then, within the stone cliffs of Mount Zhongnan, I obtained the *Scripture of the Numinous Treasure* in thirty scrolls:\n- The *Upper Section: Golden Proclamations*, composed by the Primordial Beginning;\n- The *Middle Section: Jade Records*, expounded by the Primordial Sovereign;\n- The *Lower Section: True Source of Reality*, transmitted by the Most High.\n\nTogether, they comprise several thousand words. Through nights of vigil and days of diligent study, deep reflection led me to awaken to the truth: within yin there is yang, and within yang there is yin—this is the principle of heaven and earth’s ascent and descent, the pattern of the sun and moon’s union. Qi generates water, and water generates qi—this is also the principle of the heart and kidneys’ communion.\n\nBy comparing the images of things, the Dao is not distant from humanity. Matching *jia* and *geng* confirms the precision of the golden elixir. Extracting and augmenting *mao* and *you* naturally ensures the accuracy of the fire times. Red lead and black lead, when thoroughly refined, do not form the great medicine. Golden liquor and jade liquor, only at the culmination, become the returned elixir.\n\nFrom non-being into being, one must ever hold the mind of martial endeavor. From below ascending to the heights, one gradually enters the realm of the subtle and formless. Drawing out lead and adding mercury dissolves the yin of the two eights. Exchanging bones and refining form causes the yang of the nine threes to grow. The clarity or turbidity of the water’s source is discerned at the moment of *ji ji* (completion). The inner vision of true emptiness is recognized on the day of *zuo wang* (sitting in forgetfulness).\n\nThe profound subtleties of the mysterious mechanism cannot be fully expressed in written methods. The wondrous principles of the Numinous Treasure may be employed to transcend the mundane and enter sagehood. Thus, they are synthesized into the three vehicles’ methods, titled *Complete Methods of the Numinous Treasure*.\n\nThe sacred words of the Great Dao dare not be kept for private use. I transmit them to Dongbin, and when the Dao is achieved, do not conceal them—pass them on to those who come after.\n\n—Preface by the True Man of Orthodox Yang, Zhongli Quan\n\n---\n\n**Scroll One of *The Esoteric Transmission of the True Man of Orthodox Yang’s Complete Methods of the Numinous Treasure***\n\nComposed by the True Man of Orthodox Yang, Zhongli Quan\nTransmitted by the True Man of Pure Yang, Lü Yan (Dongbin)\n\n**Four Gates of the Lesser Vehicle’s Method for Peace and Longevity**\n**First Gate: Harmonizing Yin and Yang**\n\nThe *Jade Scripture* states: The Great Dao has no form, and cannot be perceived by sight or hearing. The Great Dao has no name, and cannot be measured by calculations or reckoning. It gives rise to form through the Dao, and names are established based on form. The greatest of names are Heaven and Earth. Heaven attains the Qian Dao and accumulates qi, covering all below. Earth attains the Kun Dao and supports substance, bearing all above. Between the covering and bearing, above and below are separated by eighty-four thousand li, and their qi and substance cannot interact. Heaven seeks Qian within Kun and returns to the center of Earth, its yang carrying yin upward. Earth seeks Kun within Qian and returns to the center of Heaven, its yin embracing yang downward. With each ascent and descent, they move through the Dao, and thus Heaven and Earth endure forever.\n\nThe *True Origin* states: Between Heaven and Earth, that which is close to above is yang; from above downward forty-two thousand li is called the yang position. That which is close to below is yin; from below upward forty-two thousand li is called the yin position. Once forms and names exist, they cannot escape measurement. Consider one year: four seasons, eight nodes, twenty-four qi, seventy-two hou, three hundred sixty days, and four thousand three hundred twenty periods. Twelve periods make one day, five days make one hou, three hou make one qi, two qi make one node, two nodes make one season, and four seasons make one year. The year begins with the Winter Solstice node, at which time yang ascends from within Earth. Each qi lasts fifteen days, ascending seven thousand li. Three qi make one node, one node forty-five days, with yang ascending a total of twenty-one thousand li. Two nodes make one season, one season ninety days, with yang ascending a total of forty-two thousand li, reaching precisely the center of Heaven and Earth, where yang meets the yin position. At this point, yang is half within yin, its qi becoming warm, corresponding to the Spring Equinox node. Beyond this, yang ascends into the yang position, now truly gaining qi and ascending, just as after forty-five days comes the Beginning of Summer. After the Beginning of Summer, forty-five days bring the Summer Solstice. At the Summer Solstice node, yang has ascended a total of eighty-four thousand li to reach Heaven, where yang is within yang, its qi hot. Accumulated yang generates yin, and one yin arises within two yang. Beginning with the Summer Solstice node, yin descends from within Heaven. Each qi lasts fifteen days, descending seven thousand li. Three qi make one node, one node forty-five days, with yin descending a total of twenty-one thousand li. Two nodes make one season, one season ninety days, with yin descending a total of forty-two thousand li to reach the center of Heaven and Earth, where yin meets the yang position. At this time, yin is half within yang, its qi becoming cool, corresponding to the Autumn Equinox node. Beyond this, yin descends into the yin position, now truly gaining qi and descending, just as after forty-five days comes the Beginning of Winter. After the Beginning of Winter, forty-five days bring the Winter Solstice. At the Winter Solstice node, yin has descended a total of eighty-four thousand li to reach Earth, where yin is within yin, its qi cold. Accumulated yin generates yang, and one yang arises within two yin. After the Winter Solstice, one yang ascends again, circulating endlessly as before, never deviating from the Dao.\n\nAt the Winter Solstice, yang is born, ascending to return to Heaven. At the Summer Solstice, yin is born, descending to return to Earth. When yang ascends to Heaven at the Summer Solstice, one yin arrives; when yin descends to Earth at the Winter Solstice, one yang arrives—hence the term \"Winter Solstice.\" After yang ascends above, it passes the Spring Equinox to enter the yang position, departing from the yin position; yin descends below, passing the Autumn Equinox to enter the yin position, departing from the yang position—hence the terms \"Spring Equinox\" and \"Autumn Equinox.\" After yang ascends at the Winter Solstice, from above downward, yin does not cease descending; the descending yin is merely the residual yin within yang, dissipating within the yang position. Even if it descends to its proper position and encounters ascending yang, its qi is exhausted. After yin descends at the Summer Solstice, from below upward, yang does not cease ascending; the ascending yang is merely the residual yang within yin, dissipating within the yin position. Even if it ascends to its proper position and encounters descending yin, its qi is exhausted. The ascent and descent of yin and yang, above and below, do not exceed eighty-four thousand li, and their coming and going cannot escape three hundred sixty days. Through the four qi of warmth, coolness, cold, and heat, one recognizes yin and yang; through the eight nodes of yang ascending and yin descending, one understands Heaven and Earth. Measuring this with the celestial mechanism, one may grasp the remnants of the Great Dao’s thread. If one relies on superficial learning to weigh the Dao of Heaven and Earth, how can calculations ever comprehend it?\n\nFor example: The Dao gives birth to the myriad things, and Heaven and Earth are the greatest among them. Humans are the most spiritually endowed among things, and when seeking the Dao separately, humans are akin to Heaven and Earth. The heart is likened to Heaven, the kidneys to Earth; the liver is the yang position, the lungs the yin position. The distance between heart and kidneys is eight cun and four fen, comparable to the space between Heaven’s covering and Earth’s bearing. Qi is likened to yang, and fluids to yin. The hours of *zi* and *wu* correspond to the Summer and Winter Solstice nodes; the hours of *mao* and *you* correspond to the Spring and Autumn Equinox nodes. One day is likened to one year, and the eight trigrams’ hours of the day correspond to the eight nodes. At the *zi* hour, qi is born within the kidneys; at the *mao* hour, qi reaches the liver. The liver is yang, and its qi flourishes as yang ascends into the yang position—this is the analogy of the Spring Equinox. At the *wu* hour, qi reaches the heart, and accumulated qi generates fluids—this is the analogy of yang ascending to Heaven at the Summer Solstice, where yin is born. At the *wu* hour, fluids are born within the heart; at the *you* hour, fluids reach the lungs.\n\nThe lungs are yin, and their fluids flourish as yin descends into the yin position—this is the analogy of the Autumn Equinox. At the *zi* hour, fluids reach the kidneys, and accumulated fluids generate qi—this is the analogy of yin descending to Earth at the Winter Solstice, where yang is born. Circulating endlessly, like the cycles of the sun and moon, without loss or deficiency, one may thereby prolong life.\n\nThe *True Formula* states: Heaven and Earth attain unity through the Dao, yet upon entering, one receives form from father and mother. Within form, form is born, and one drifts ever farther from the Dao. After the fetus is complete and qi is full, the six desires and seven emotions dissipate primordial yang, causing true qi to scatter and flee. Though qi and fluids naturally generate one another, they no longer follow Heaven and Earth’s ascent and descent. With each exhalation, primordial qi departs; with each inhalation, primordial qi enters, connecting with Heaven and Earth’s qi. Yet once drawn in, it cannot be retained—following the breath, it departs again. The qi of one’s own palace is instead seized by Heaven and Earth. Thus, scattered qi struggles to generate fluids, and scant fluids struggle to generate qi.\n\nWhen qi is at its peak, employ the *mao* trigram in daily practice: inhale more and exhale less, forcibly retaining it in the abdomen. That which naturally ascends from below does not exit; that which enters from without temporarily abides. The two qi converge, accumulating to generate the fluids of the five viscera. The more one returns to the origin, the greater the accumulation. With daily cultivation and persistent effort, results will appear in due course.\n\nThe *Essentials of the Dao* states: To meet the eldest son of yang, one must inhale more and exhale less. Let the children contend with one another, and in time, seek the true. This is the method of accumulating qi to generate fluids, and accumulating fluids to generate qi—matching and pairing qi and fluids to engender one another. In practice, no more than a year is needed; with concentrated effort, one achieves threefold progress in one. A hundred days as a term, and signs appear within ten. One gains appetite and dispels illness, clarity in head and eyes, lightness in heart and abdomen, strength with little fatigue. At times, the sound of wind and thunder arises within the abdomen—countless other signs cannot all be recorded.\n\nExplanation: The \"eldest son of yang\" refers to *qian* seeking *xu* from *kun*, like qi ascending upward. The \"son\" is qi, rising from the kidneys. The \"daughter\" is fluid, descending from the heart. Their contention causes ascent and descent. By restraining qi, fluids are generated; when matched in balance, true water is naturally obtained after a time.\n\n**Gathering and Dispersing Water and Fire, Second Scroll**\n\nThe *Golden Teachings* state: The Great Dao is lofty yet without superior—look up, and its summit cannot be seen. The Great Dao is lowly yet without inferior—look down, and its base cannot be seen. It has no beginning, so its origin cannot be perceived; it has no end, so its conclusion cannot be seen. Within the Great Dao, Heaven and Earth are born. Heaven and Earth possess the measures of high and low. Within Heaven and Earth, yin and yang exist, with their cycles of beginning and end. Observing upward and downward, one may fathom their mechanism. Contemplating beginning and end, calculating their measures, one may grasp their principles. From this, the Great Dao may be known.\n\nThe *True Origin* states: From the positions of Heaven and Earth above and below, one knows their height and depth. From the cycles of yin and yang’s beginning and end, one knows the sequence of Heaven’s Dao. Heaven and Earth do not depart from their measures, which conclude in one year. Yin and yang do not lose their proper order, dividing into the eight nodes. At the Winter Solstice, one yang is born; at the Spring Equinox, yang is half within yin. Beyond this, pure yang prevails, and yin is exhausted. At the Summer Solstice, yang reaches its extreme, and one yin is born—its ascent and descent follow as before. Though the cycles of above and below, beginning and end, do not fully encompass the Great Dao, they do not depart from its essence. To comprehend the Great Dao, one must model it upon Heaven and Earth and examine the proper order of yin and yang.\n\nAnalogy: The heart and kidneys are likened to Heaven and Earth; qi and fluids to yin and yang; one day to one year. The daily use of the *gen* trigram corresponds to the *Lichun* (Beginning of Spring) node in a year; the *qian* trigram to the *Lidong* (Beginning of Winter) node. Within Heaven and Earth, that which is closer to below is yin. From below upward, forty-two thousand *li* is called the yin position. At the Winter Solstice, yang is born and ascends; at the time of *Lichun*, yang rises within the yin position to twenty-one thousand *li*—this is yang’s struggle to overcome yin. Within Heaven and Earth, that which is closer to above is yang. From above downward, forty-two thousand *li* is called the yang position. At the Summer Solstice, yin is born and descends; at the time of *Lidong*, yin descends, departing sixty-three thousand *li* from Heaven and twenty-one thousand *li* from Earth—this is yin attaining its position and yang being cut off.\n\nWithin a year, *Lichun* corresponds to the *gen* trigram in a day’s hours. Kidney qi transmits downward to the bladder, weak and struggling to ascend within fluids. Within a year, *Lidong* corresponds to the *qian* trigram in a day’s hours. Heart fluids descend, about to return to the origin and re-enter the kidneys—this is the time of yin’s flourishing and yang’s severance.\n\nThe cause of human illness lies in the disharmony of yin and yang, with yang weak and yin excessive—thus, illness is common. The *True Formula* states: At *Lichun*, yang ascends from below; before long, yang is half within yin. At the *gen* trigram, qi is faint in the *chou* and *yin* hours. At *Lidong*, yin descends from above; before long, yin is half within yang. At the *qian* trigram, qi scatters in the *xu* and *hai* hours. Such is the Dao of Heaven and Earth. Yet humans, when qi is faint at the *gen* trigram, do not know the means to nurture qi; when qi scatters at the *qian* trigram, do not understand the principle of gathering qi. Day and night, the six desires and seven emotions dissipate primordial yang, causing true qi to weaken and scatter, true fluids to fail to generate. Thus, one cannot attain the longevity of Heaven and Earth—this is the reason.\n\nTherefore, the ancients practiced *zhun* in the morning and *meng* in the evening, employing two trigrams daily to achieve long life in the world. *Zhun* in the morning takes the meaning of one yang coiled and unextended. For oneself, one nurtures and extends it, preventing dissipation.\n\nAt dusk, *meng* takes the meaning of an unenlightened child seeking me to attain brightness and abandon darkness—this is the principle of yin seeking yang. For oneself, one obscures and then illuminates it, preventing its dissipation.\n\nThus, at sunrise, when the *gen* trigram governs, one nurtures primordial qi. Do not let profit or fame stir the heart, nor let likes and dislikes disturb the mind. Instead, don a robe and sit in stillness to cultivate qi. Banish thoughts and forget emotions, gently performing *daoyin*. Alternately stretch and contract the hands and feet three to five times, so that the qi of the four limbs arises evenly, inwardly preserving primordial qi to ascend and gather at the heart’s palace. One may swallow saliva once or twice and rub the head and face twenty to thirty times, exhaling the foul, stagnant qi accumulated through the night. With time, one’s complexion will glow with radiance, and the skin will become lustrous.\n\nThe *gen* trigram nurtures primordial qi. Furthermore, at sunset, when the *qian* trigram governs, one gathers primordial qi. Enter a chamber and sit in stillness, swallowing qi and contracting the external kidneys. Swallowing qi draws the heart’s fire downward. Contracting the external kidneys gathers the bladder’s qi inward. The *qian* trigram gathers primordial qi. When the upper and lower kidney fires unite, the three fires merge into one, warming and replenishing the lower elixir field. Without fluids, one gathers qi to generate fluids; with fluids, one refines them to produce qi. This is called \"gathering fire\" or \"the Supreme Unity containing true qi.\"\n\nIn the early morning, swallowing saliva, rubbing the face, and alternately stretching the hands and feet is called \"dispersing fire\" or \"minor refinement of form.\" As the *Daoist Essentials* states:\n\n> When blossoms wither and leaves fall in late autumn,\n> The consort grows weary of ascending the high tower.\n> To harmonize ruler and people,\n> One must frequently gather after the feast.\n\nThis means drawing in the heart’s qi and gathering the bladder’s qi, preventing dissipation so they may unite with kidney qi to receive the qi of the *kan* trigram—the newly arisen qi from the sea. One must begin at the Winter Commencement solar term and continue until results appear. The practice should not exceed a year; the work of one merges into three, with a hundred days as the period and verification appearing in ten. The complexion will grow luminous, the skin full and joyful, the lower elixir field warm, urination reduced, the four limbs light and strong, the spirit clear and refreshed, and chronic illnesses entirely dissolved.\n\nIf one cherishes time and practices without weariness, even within the work of harmonizing yin and yang, slight results may appear. This method is then incorporated into daily practice, with the *gen* trigram added. When the three *yuan* of the *qian* trigram take effect, one ceases upon verification. The three *yuan* are *qian*, *gen*, and *zhen*.\n\nA Commentary states: When flowers wither and leaves fall in late autumn, it is like the time when a person’s qi weakens at dusk—yang qi scatters and fails to ascend, hence the saying, “Too weary to climb the high tower.” The tower refers to the *chonglou* (double-storied structure). The heart is the sovereign fire, the bladder the ministerial fire; swallowing qi and drawing in the external kidneys cause the heart and external kidneys to unite their qi as one—this is called *hehui* (harmonious union). *Yan* means swallowing, and *shou* means drawing in.\n\nIf the morning practice is unbroken, this method becomes the foundation. **The Third: The Union of Dragon and Tiger**\n\nThe *Jingao* says: When the Great Primal first divided, there was the Great Beginning; within the Great Beginning was the Great Non-Being; within the Great Non-Being was the Great Void; within the Great Void was the Great Emptiness; and within the Great Emptiness was the Great Substance. The Great Substance is Heaven and Earth. Heaven and Earth, clear and turbid, take the form of an egg with a dark and yellow hue—merely one thing within the Great Emptiness. When yang ascends to the Heavenly Supreme Ultimate, it generates yin, which in profound obscurity embraces yang and descends. When yin descends to the Earthly Supreme Ultimate, it generates yang, which in a state of indistinctness bears yin and ascends. With one ascent and one descent—yin descending and yang ascending—Heaven and Earth follow the Dao, and the myriad things are born and formed.\n\nThe *Zhenyuan* says: Heaven is like an overturned basin, making it difficult for yang to ascend when it reaches its limit. Earth is like a stone slab, making it difficult for yin to penetrate when it reaches its limit. At the Winter Solstice, yang within the earth ascends; at the Summer Solstice, when it reaches Heaven, yang attains the Supreme Ultimate and generates yin. The reason yin is generated is that yang arises from within yin, emerging from the earth in a state of indistinctness—within qi there is water, though this water has no form. When the Summer Solstice reaches Heaven, it transforms into water; this is yang attaining the Supreme Ultimate and generating yin. At the Summer Solstice, yin within Heaven descends; at the Winter Solstice, when it reaches Earth, yin attains the Supreme Ultimate and generates yang. The reason yang is generated is that yin emerges from within yang, issuing from Heaven in a state of profound obscurity—within water there is qi, though this qi has no form. When the Winter Solstice reaches Earth, accumulated water generates qi; this is yin attaining the Supreme Ultimate and generating yang.\n\nAs an analogy: Compare the body’s exterior to the Great Emptiness, the heart and kidneys to Heaven and Earth, qi and fluids to yin and yang, and the hours of *zi* and *wu* to winter and summer. The *zi* hour corresponds to the *kan* trigram, when qi is born in the kidneys. The *wu* hour corresponds to the *li* trigram, when qi reaches the heart. When kidney qi and heart qi unite, the Supreme Ultimate generates fluid. The reason fluid is generated is that qi arises from within the kidneys—within qi there is true water, though this water has no form. When the *li* trigram reaches the heart and meets heart qi, the Supreme Ultimate generates fluid in this manner. When fluid is born in the heart (*li* trigram) and reaches the kidneys (*kan* trigram), the fluid unites with kidney water, and the Supreme Ultimate regenerates qi. The reason qi is generated is that fluid arises from within the heart—within fluid there is true qi, though this qi has no form. When the *kan* trigram reaches the kidneys and meets kidney water, the Supreme Ultimate generates qi in this manner. This can be likened to yang ascending and yin descending, reaching the Supreme Ultimate and generating one another. The yin and yang thus generated contain water within yang and qi within yin.\n\nThe *Zhenjue* says: Qi is born in the kidneys, and within qi there is true water. Fluid is born in the heart, and within fluid there is true qi. True water and true qi are the true Dragon and true Tiger. When yang reaches Heaven and struggles to ascend, the Supreme Ultimate generates yin. When yin reaches Earth and struggles to penetrate, the Supreme Ultimate generates yang. Such is the principle of Heaven and Earth. Only humans cannot compare to Heaven and Earth because the six desires and seven emotions, stirred by external things, scatter their original yang and dissipate their true qi. When kidney qi (*li* trigram) reaches the heart, the spirit and consciousness settle inwardly; the breath enters slowly through the nose and exits gently, continuous yet subtle. Saliva fills the mouth—do not spit or swallow it. Naturally, kidney qi and heart qi unite, and the Supreme Ultimate generates fluid. When fluid unites with true water, true qi clings to fluid, and true water clings to qi. Though they are not inherently united, within fluid there is true qi, and within qi there is true water. They intermingle, cling to one another, and descend—this is called the *jiaogou* (union) of Dragon and Tiger. If the firing times are without error and the withdrawal and addition are appropriate, after three hundred days of nurturing, the true embryo forms into the great medicine. This is the foundation of refining the body, burning away the physical form, attaining the origin, and transcending the mundane.\n\nThe *Daoyao* says: When the primal qi first returns to its original movement, true yang is about to reach the *li* palace. Seize the true Dragon and true Tiger—within the Jade Pool, spring waters flow gently. This is to prevent the leakage of original qi and the loss of true water beyond the body. If qi scatters, fluid is difficult to generate; if fluid is scant, there is no true qi. If qi and water do not unite, how can the great medicine be formed? During this year, take the Winter Solstice as the beginning; within the day, take the *li* trigram as the period. For those who embrace the Dao in later years, whose roots are unstable, and who suffer from depletion and insufficiency of qi, ten years of depletion require one year of practice to restore—this is called *caibu huandan* (gathering and replenishing the elixir). If the replenishment exceeds the required measure, cease this method and practice *shuihuo jiji* (the harmony of water and fire). This can prolong life and extend years—it is called the *renxian* (human immortal). The effects of the practice cannot be fully recorded. If the replenishment is sufficient, sweet saliva will arise in the mouth, the mind’s afflictions will vanish, desires will not stir, the hundred bones will be free of illness, and within the darkness, the radiance of the spirit will appear before the eyes like lightning. Taking the Winter Solstice as the starting point and practicing the method for three hundred days, the embryonic immortal is complete.\n\nA Commentary states: Externally, the *wu* hour is the *li* palace, and the great yang is the true yang. Within the person, the heart is the *li* palace, and original yang is the true Dragon; the true Tiger is the water within the kidneys. The true Dragon is the qi within heart fluid; the mouth is the Jade Pool, and saliva is the spring water.\n\n**The Fourth: Refining the Elixir**\n\nThe *Jingao* says: Heaven and Earth are the forms of the great Dao. Yin and yang are the Dao of Heaven and Earth. Cold, heat, warmth, and coolness—within form there is qi.\n\nClouds, mist, rain, and dew—within qi there are images. Earth’s qi ascends, rising to become clouds and dispersing to become rain. Heaven’s qi descends, scattering into mist and condensing into dew. When accumulated yin exceeds, dew transforms into frost and then snow. When accumulated yang exceeds, mist becomes smoke, clouds, and rosy dawn. Within yin, yang lies concealed; if yang qi does not descend, it strikes and collides to generate thunder and lightning. Within yang, yin lies concealed; if yin qi does not congeal, it hardens to produce hail and graupel. When yin and yang fail to unite, they oppose each other to generate lightning. When yin and yang are mismatched, their chaotic union produces rainbows. Accumulated true yang forms spirits, which adorn the heavens as stars. Accumulated true yin forms shapes, which strengthen the earth as soil and stone. The greatest of stars are the sun and moon; the most precious of soil and stone are gold and jade. Yin and yang manifest in the visible forms of the sun and moon above, and gold and jade below.\n\n*The True Origin* states: Yin cannot generate without yang; yang cannot complete without yin. Accumulated yang becomes spirit, adorning the heavens in grandeur—such are the sun and moon. The sun and moon are true yang that achieves completion through true yin. Accumulated yin forms shapes, strengthening the earth in preciousness—such are gold and jade. Gold and jade are true yin that attains generation through true yang.\n\nPractice during the *xu* and *hai* hours: in the *Li* trigram, gather the medicine; in the *Qian* trigram, advance the fire. As an analogy: true yang corresponds to the true qi within heart fluid; true yin corresponds to the true water within kidney qi. True water cannot generate without true qi; true qi cannot complete without true water. When true water and true qi harmonize in the *Li* trigram—above the heart and below the lungs—they cling to each other like mother and child, or husband and wife in mutual affection.\n\nFrom *Li* to *Dui*, when the *Dui* trigram’s yin flourishes and yang weakens, it resembles the moon’s waning crescent or gold and jade hidden in darkness, awaiting the dawn when their measure is fulfilled to shine anew. Gold and jade, refined by yang to generate yin, become treasures when qi is sufficient—this is achieved by advancing yang to fullness. The sun and moon renew their brightness when their measure is fulfilled and they receive the soul. This is analogous to advancing the fire in the *Qian* trigram, refining yang without declining flame, so that yang perpetually regenerates through incremental addition.\n\n*The True Formula* states: When the Dragon and Tiger unite in the *Li* trigram, it is called \"gathering the medicine.\" When the time arrives at the *Qian* trigram, qi and fluid prepare to return to their origin, generating above the bladder, below the spleen and stomach, before the kidneys, behind the navel, to the left of the liver, to the right of the lungs, to the right of the small intestine, and to the left of the large intestine. At this moment, spleen qi flourishes and lung qi thrives, while heart qi ceases and liver qi weakens. True qi, originally united with yang qi, now finds yang qi diminished and has nothing to cling to—practice at this time is laborious, yet the gathering and union must occur precisely then.\n\nWith spirit and awareness inwardly guarded, the breath flows gently through the nose. The abdomen subtly presses against the navel and kidneys; when the heat becomes too intense, slightly relax the pressure, gently restraining the navel. Before heat arises, tighten the restraint; as warmth grows, maintain steady pressure, allowing the mind to roam freely until it fills the cosmos—this is called \"restraining the Yang Gate to refine the elixir.\" Thus, qi does not ascend but unites with true water, passing through the spleen palace and, with each breath, circulating into the life palace of the Yellow Court. As qi and fluid transform, they first become essence, then pearl, then mercury, then cinnabar, and finally gold—this is called the Golden Elixir. Its achievement is no small matter.\n\n*The Essentials of the Dao* states: Gathering the medicine relies on the Jade Hare—heart qi is the medicine, and kidney water is the Jade Hare. Union must be facilitated by the Yellow Matron. When they meet in Yongzhou, the *Qian* trigram, perform a melody of the Yang Song. This practice aligns with daily cultivation for gathering the medicine.\n\nFor those seeking to restore vitality in later years, apply the method of \"one supplement for every ten depletions\"—this is called \"refining mercury to supplement the cinnabar field.\" Once the supplement’s measure is fulfilled, cease daily practice.\n\nGather the medicine in the *Li* trigram and refine it in the *Qian* trigram, restraining the Yang Gate. In spring and winter, gather more and refine less—*Qian* requires one part effort, while *Li* demands twice as much. In autumn and summer, gather less and refine more—*Li* requires one part effort, while *Qian* demands twice as much. Adjust gathering and refining according to the seasonal flourishing of qi. With practice, results will manifest, extending years and abiding in the world as a Human Immortal.\n\nIf, after fulfilling the supplement’s measure, results are evident, advance with care and discipline. After one hundred days of gathering the medicine, its potency is complete. After two hundred days, the sacred embryo solidifies. After three hundred days, true qi is born, and the embryonic immortal is perfected.\n\nOnce the medicine’s potency is complete, advance the fire by increasing the measure—this is called \"fire timing.\" After the sacred embryo solidifies, increase the fire timing to the measure of the Small Celestial Cycle. When the embryo is rounded and true qi is born, advance the fire timing—this is called the \"Celestial Cycle fire timing.\"\n\nOnly by gathering the medicine through the union of Dragon and Tiger, and refining it by advancing the fire, does one enter the Dao. One must retreat to seclusion, focusing the mind on inner observation, so that inner visions do not leak out and outer distractions do not intrude—like a woman nurturing a fetus or a dragon tending its pearl. Even in eating, sleeping, speaking, or silence, one must move like an infant or a maiden in her chamber, ever cautious of loss or harm, never allowing the heart to stray from the Dao for even a moment.\n\nA Commentary states: The medicine is the true qi within the heart; the hare is the true water within the kidneys; the Yellow Matron is the fluid within the spleen. They harmonize qi and water, entering the Yellow Court. Yongzhou is the *Qian* trigram, where one restrains the flanks and abdomen—also called restraining the Yang Gate.\n\nHere concludes the four gates of the lesser vehicle, leading to Human Immortality. *Secret Transmission of the Orthodox Yang Immortal’s Numinous Treasure Complete Methods*, Volume One.\n\n**Secret Transmission of the Orthodox Yang Immortal’s Numinous Treasure Complete Methods, Volume Two**\n\n**Zhongli Quan of the Orthodox Yang Immortal** states; **Lü Yan, the Pure Yang Immortal of the Grotto Guest**, transmits:\n\n**Three Gates of the Middle Vehicle for Long Life and Deathlessness**\n\n**Fifth: Flying Gold Essence Behind the Elbow**\n\nThe *Golden Proclamation* states: Yin and Yang ascend and descend, never beyond the bounds of Heaven and Earth. The sun and moon revolve, yet move outside Heaven and Earth. Their rising and setting in the east and west divide day and night; their coming and going in the south and north determine cold and heat. Unceasing day and night accumulate into months—this is the lunar phase. The accumulation of months into a year follows the principle of *lü* arising from *lü* and *lü* arising from *lü*. The sun and moon’s movements align with the mechanism of Heaven and Earth, never departing from the numbers of *Qian* and *Kun*. Though the generation of the myriad things depends on Yin and Yang, their transformation also relies on the sun and moon.\n\nThe *True Origin* states: The form of Heaven and Earth resembles an egg. The Six Harmonies within are round as a sphere. The sun and moon rise and set, revolving above one Heaven and below one Earth. Above and below, east and west, they circle like a flying wheel. The sun rises in the east and sets in the west, traveling the Yang path; the moon rises in the west and sets in the east, traveling the Yin path. Within a single day, they divide day and night. After the winter solstice, the sun rises from the south and moves north. After the summer solstice, the sun rises from the north and moves south. Winter’s night is summer’s day; summer’s night is winter’s day. Within a year, they determine cold and heat. The sun and moon each measure eight hundred and forty *li* in circumference. Four *chi* make one *bu*, and three hundred and sixty *bu* make one *li*. Eight *ke* and twenty *fen* make one *shi*, and twelve *shi* make one day. One month consists of thirty days, totaling three hundred and sixty *shi*, amounting to three thousand *ke* and one hundred and eighty thousand *fen*.\n\nNow, Yang moves through *Qian*, its number being nine. Yin moves through *Kun*, its number being six. The spirit (*hun*) is born within the lunar phase (*po*), originating from the dawn sun. Since nine does not pair with six, three days later, the lunar phase gives birth to the spirit. In one day and night—one hundred *ke* and six thousand *fen*—the spirit advances seventy *li* within the lunar phase. Over six days and nights, it advances four hundred and twenty *li*, reaching half within the lunar phase—this is called the first quarter. After another six days and nights, advancing another four hundred and twenty *li*, totaling eight hundred and forty *li*, the spirit fully occupies the lunar phase, and Yang fills the Yin position—this is called the full moon.\n\nBeginning on the sixteenth day, the spirit generates the lunar phase. Over six days and nights, advancing four hundred and twenty *li*, the lunar phase reaches half within the spirit—this is called the last quarter. After another six days and nights, advancing another four hundred and twenty *li*, totaling eight hundred and forty *li*, the lunar phase fully occupies the spirit. The remaining light in the moon exists because six does not exhaust nine; thus, three days later, the lunar phase fills the palace—this is called the dark moon.\n\nAfter the new moon, nine arises from six. Before the dark moon, six arises from nine. Though the numbers are not yet exhausted, the next cycle begins in due course. Days accumulate into months, and months into years. Speaking of a year in terms of months, the six *lü* and six *lü* begin with six, exhausting the six positions. Six sixes make thirty-six—the completion number of Yin. Speaking of a year in terms of days, five days make one *hou*, and seventy-two *hou* make the number eight nines. Reaching the double nine, the number begins with nine, exhausting the six positions. Six nines make fifty-four—the completion number of Yang. One six and one nine together make fifteen. Fifteen is the number of *qi*. The twenty-four *qi* correspond to the eight nodes, revealing the proper ascent and descent of Yin and Yang. One six and one nine, when applied fourfold, transform into the Yang number two hundred and sixteen and the Yin number one hundred and forty-four, totaling three hundred and sixty to complete the celestial cycle.\n\nBy analogy: The ascent and descent of Yin and Yang within Heaven and Earth resemble the method of harmonizing the heart and kidneys, *qi* and fluids. The revolution of the sun and moon outside Heaven and Earth resembles the practice of flying gold essence behind the elbow. The union of the sun and moon resembles the method of advancing and reducing fire. The ascent of Yang and descent of Yin are no different from the spirit and lunar phase of the sun and moon. The sun’s departure and moon’s arrival are no different from the *qi* and fluids of the heart and kidneys.\n\nAfter the winter solstice, the sun rises in the *yi* position and sets in the *geng* position, with forty *ke* of daylight, moving from south to north. After the winter solstice, over nine days, the sun rises in the east and sets in the west, advancing sixty *fen* to the spring equinox. Day and night balance, with the summer solstice as the term, when daylight reaches sixty *ke*, the sun rises in the *jia* position and sets in the *xin* position. After the summer solstice, over nine days, the sun moves from north to south, rising in the east and setting in the west, retreating sixty *fen* to the autumn equinox. Day and night balance, with the winter solstice as the term, when daylight returns to forty *ke*. Following the previous pattern, advancing from south to north, the number uses nine.\n\nAfter the new moon, on the third day, the spirit is born, arising from the lunar phase. On the sixth day, they balance; after another six days, the spirit is complete—the number uses six. At the summer solstice of the year and the sixteenth day of the month, one employs the method of the *Li* trigram—this is the *wu* hour for humans. At the winter solstice of the year and the new moon, one employs the method of the *Kan* trigram—this is the *zi* hour for humans. Though the proper ascent and descent of Yin and Yang in Heaven and Earth and the principles of the sun and moon’s spirit and lunar phase follow numerical order, their union is sequential and their revolution without error. How could the *qi* and fluids of the human heart and kidneys, the spirit and lunar phase of the liver and lungs, though following a daily rhythm, not require adjustment over months and years?\n\nThe *True Formula* states: When Yang is born in the *Kan* trigram, it corresponds to the true *zi* hour—neither beginning nor end. The *Gen* trigram governs the *qi* of the kidneys harmonizing with the *qi* of the liver. Before the union, in a quiet chamber, don robe and clasp hands, sit upright with crossed legs, tuck in the abdomen, and after a moment, raise the body forward, chest out, and slightly tilt the head back.\n\nThen close the double gates of the *Jiaji* behind the spine, gently fan the elbows backward once or twice, and stretch the waist. From the *Weilü* point, a fire-like sensation arises, ascending from the waist to gather at the *Jiaji*. Take care not to open the gates—immediately, the heat intensifies and the *qi* swells. Gradually open the *Jiaji* gates to release the *qi* past the barrier.\n\nStill facing upward, tilt the head firmly back to close the upper gate. Guard against opening it, and soon the heat peaks and the *qi* surges, ascending into the crown to replenish the *Niwan* and the Sea of Marrow. Only when the body withstands cold and heat is this the foundation of longevity.\n\nNext, employ the method of *Huandan*: proceed as before—extend the chest, stretch the waist, close the *Jiaji*, and crouch to raise the *qi* through the waist. If the fire does not rise, sit in stillness and inwardly observe; repeat the method until the fire ignites. Begin at the *chou* hour and continue until the end of *yin*. This is called *\"Flying Golden Essence behind the Elbow\"* or *\"Drawing Lead\"*, whereby kidney *qi* generates liver *qi*.\n\nMoreover, the human spine has twenty-four vertebrae. The three lowest, from the bottom upward, correspond to the inner kidneys. The three highest, from the top downward, are called the *Heavenly Pillar*. Above the *Heavenly Pillar* lies the *Jade Capital*. Below the *Jade Capital* and above the *Weilü* point, where the inner kidneys align, are eighteen vertebrae—nine above and nine below—collectively called the *Double Gates*. After one hundred days of practice, the *qi* traverses all eighteen and enters the *Niwan*.\n\nThis must be performed during the *Kan* trigram’s true Yang hour. This is *\"Flying Golden Essence behind the Elbow\"*. The *Li* trigram governs the gathering of the elixir, the *Qian* trigram the stoking of the fire to refine it. After restraining the *Yang* gate for one hundred days, the *Golden Essence* flies into the brain. At one hundred days, the elixir’s power is complete. With a single thrust through the three gates, it ascends directly into the upper palace of *Niwan*.\n\nBegin with the *Kan* trigram and conclude with the *Gen* trigram. When gathering the elixir under the *Li* trigram, no kidney *qi* unites with it; instead, liver *qi* naturally generates heart *qi*. The two *qi* become purely Yang, dissolving the eight Yin. Steaming the lungs, the lung fluid descends, enveloping the true *qi*. Daily, a grain of millet’s worth enters the *Yellow Court*—only then is it the material for the inner elixir. After one hundred days without error, the elixir’s power is complete.\n\nWhen gathering the elixir under the *Li* trigram, follow the method precisely, inwardly observing with ever-greater refinement. For stoking the fire and restraining the *Yang* gate under the *Qian* trigram, begin with the *Dui* trigram and conclude with the *Qian* trigram. After another hundred days, *\"Flying Golden Essence behind the Elbow\"* proceeds from the *Kan* trigram to the *Zhen* trigram. When gathering the elixir under the *Li* trigram, the method remains unchanged, aligning with practice from the *Kun* to the *Qian* trigram. After three hundred days without error, the sacred embryo naturally solidifies. At three hundred days, the sacred embryo is firm.\n\nThe method of restraining the *Yang* gate begins with the *Kun* trigram and concludes with the *Qian* trigram. After another hundred days, the *Niwan* is fully replenished, and one reverts from old age to youth, no longer resembling ordinary people. The elixir is gathered, the embryo perfected, and true *qi* is born—round as a pellet, red as a tangerine—permanently settled in the *Dantian*, making one an immortal upon the earth.\n\nAfter three hundred days, cease gathering the elixir under the *Li* trigram and restraining the *Yang* gate under the *Kun* trigram, then practice the *Jade Fluid Returning Elixir* method. Thus, only after the winter solstice does one begin the practice. After three hundred days, the embryo is complete, the *qi* is full, the inner elixir is achieved, and true *qi* is born. Only then is this the reversal of the Five Phases and the inversion of the Three Fields.\n\nBefore beginning the practice, first harmonize Yin and Yang to ensure *qi* and fluids generate one another, ceasing only when verification appears. Next, gather and disperse water and fire to solidify the root and ensure *qi* flows and fluids infuse, ceasing only when verification appears. Then unite the *Gou* Dragon and Tiger to refine the elixir, gathering and supplementing the returning elixir while forging lead and mercury, ceasing only when verification appears. When the count of *\"Ten Losses and One Gain\"* is complete and *qi* and fluids generate one another, cease only when verification appears.\n\nThe above practice is a lesser vehicle method, sufficient for prolonging life and extending years. Only after supplementation is complete and firmness verified may one select a month—specifically the winter solstice—and within that month, a day—specifically the *jiazi* day—and within that day, an hour—specifically the hours of the *Kan*, *Li*, and *Qian* trigrams—to begin.\n\nFor the first hundred days, proceed from *Kan* to *Gen* and from *Dui* to *Qian*. After two hundred days, proceed from *Kan* to *Zhen* and from *Kun* to *Qian*. For all such practice, one must be in a secluded chamber within a tranquil dwelling, far from women and girls, ensuring no sound of chickens or dogs reaches the ears, no foul odors enter the nose, no flavors pass the lips, and the seven emotions and six desires are extinguished. Regulate the quantity of food and drink, and maintain moderation in cold and heat. Even in waking and sleeping, guard against loss or damage. If practice is not diligent, the Dao will be difficult to achieve. After three hundred days, observe the results.\n\nThe *Dao Essentials* states: *\"Sun and moon move together in the *Fu* trigram; at the *zi* hour, crouch and ascend for several days to open the gates. Greedily hasten to Yangzhou for the gathering; under the *Li* trigram, unite the *Gou*, and the six palaces’ fire fills the Golden Field of *Qian*.*\nExplanation: *\"Sun and moon move together in the *Fu* trigram\"* refers to the time when a single Yang is born—in the day, the *zi* hour; in the year, the winter solstice. This is the selection of month, day, and hour. *\"Crouch and ascend\"* was described in the previous method. *\"Several days\"* means a fixed hundred days. *\"Opening the gates\"* means first opening the middle gate, then the upper gate. *\"Greedily hasten to Yangzhou for the gathering\"*—in the body, this is the heart; in the day, the *wu* hour; in the trigram, *Li*. *\"Gathering\"* means the union of true Yin and true Yang, hence *\"gathering the elixir\"*. *Qian* is the six palaces; *\"fire\"* is *qi*. Restraining the *Yang* gate gathers the *qi*, and as the lungs are metal, the *qi* descends to the lower field below the buttocks—thus *\"fire fills the Golden Field\"*, meaning the *Qian* trigram’s restraint of the *Yang* gate gathers fire in the lower field.\n\n*\"On the road to Zhongnan, mountains are encountered; frequently ascend past the three gates, greedily hastening to Yangzhou for the gathering—how could it compare to the maiden burning the heavens?\"*\nExplanation: *\"Zhongnan\"* implies the sage’s hidden meaning in the *Middle Son*—the *Middle Son* is the *Kan* trigram.\n\n*Gen* is the mountain; the mountain is the *Gen* trigram’s flying golden essence, which enters the *Xun* trigram only after two hundred days. When practicing the downward work, frequently ascend past the three gates. The greed for gathering in Yangzhou has already been discussed. How could it compare to the maiden burning the heavens? The maiden is the *Dui* trigram. Restraining the *Yang* gate continues until the *Qian* trigram, where it finally ceases.\n\nFrom Yanzhou to Xuzhou, rising to walk harms the cart and ox—yet for the sake of the Nine Provinces’ joyous gathering, fire from the southwest enters Yongzhou.\n\n**Explanation:** Yanzhou is the *Gen* trigram; Xuzhou is the *Xun* trigram. The flying golden essence departs from *Gen* and only ceases at *Xun*. \"Rising to walk harms the cart and ox\"—the cart is *Yang*, the ox is *Yin*, signifying the single *qi* of the spine’s *Jiaji* flying into the *Niwan* palace. The Nine Provinces in the body are the heart; in the day, the *wu* hour—identical to the earlier gathering of the elixir. The southwest is the *Kun* trigram; Yongzhou is the *Qian* trigram. Restraining *Yang* from *Kun* to *Qian* ceases only after three hundred days of practice. This is the daily work, called the \"Three Primes’ application.\"\n\nThe flying golden essence enters the brain, returning the lower field to the upper field. Gathering the elixir in the lower field returns it to the middle field to refine the medicine; advancing the fire from the middle field returns it to the lower field—this is called the \"Three Primes’ work.\" The method of the Middle Vehicle is already that of an earthly immortal, and one ceases only upon seeing verification. At first, one may notice frequent startling dreams and palpitations, while the four limbs and six viscera’s ailments heal without treatment. In a dark room with eyes closed, a radiant light like a canopy encircles the body. The Golden Gate and Jade Lock seal firmly, preventing dream emissions or leaks. With a thunderous roar, the joints’ *qi* flows freely. In dreams, one may embrace an infant and return, or soar freely at will. The eight perverse *qi* cannot enter; the heart’s realm is naturally cleansed of desire. Inward contemplation is bright and unobscured; by day, the spirit’s countenance is clear and refined; by night, the cinnabar field is naturally warm. All these are verifications of obtaining the elixir. Once verified as correct, one must diligently regulate practice, augmenting with the previous method. After three hundred days, the fetal immortal’s gestation is complete. Only after its completion does one proceed to the subsequent work.\n\n**The Sixth: Jade Fluid Returning Elixir**\n*The Jade Book* states: True Yin and true Yang mutually engender and complete one another. That which appears above is accumulated *Yang* forming spirit. Within spirit lies form, clinging to heaven—these are the sun and moon. That which appears below is accumulated *Yin* forming shape. Within shape lies spirit, clinging to earth—these are gold and jade. The essence of gold and jade hides within mountains and rivers; their refined and radiant *qi* floats above, where the sun and moon exchange light. Plants and trees receive it, becoming auspicious omens; birds and beasts obtain it, becoming extraordinary species.\n\n*The True Origin* states: When *Yang* ascends to heaven, the Supreme Ultimate generates *Yin*; *Yin* is insufficient while *Yang* is surplus, hence accumulated *Yang* generates spirit. When *Yin* descends to earth, the Supreme Ultimate generates *Yang*; *Yang* is insufficient while *Yin* is surplus, hence accumulated *Yin* generates shape. Above, the sun and moon; below, gold and jade—true *Yang* possesses spirit, true *Yin* possesses shape. Their *qi* intermingles, shooting upward and downward, filling heaven and earth with light. Thus, gold and jade are precious—truly for this reason. Know then that when the *qi* of gold and jade congeals in the void, it becomes auspicious mist and propitious vapor. When it enters the earth, it transforms into sweet springs and lingzhi mushrooms. People who receive it become heroes; birds and beasts who obtain it generate marvels. Though the essence of gold and jade is born from accumulated *Yin*’s shape, it embraces the *qi* of true *Yang*, further influenced by the sun and moon formed from accumulated *Yang* becoming spirit. The downward projection of true *Yin* and true *Yang* causes treasure to congeal.\n\n**Analogy:** Accumulated *Yin* forms shape yet internally embraces true *Yang* to become gold and jade—comparable to accumulating the elixir and embracing true *qi* to become a fetal immortal. The *qi* of gold and jade entering the earth to become sweet springs and lingzhi mushrooms is like the jade fluid returning to the cinnabar field. The *qi* of gold and jade congealing in the void to become auspicious mist and propitious vapor is like refining form with *qi*. Whenever the *qi* of gold and jade surges into heaven, it rises with *Yang*. Whenever it enters the earth, it descends with *Yin*. Since it follows *Yin* and *Yang* in ascent and descent, there are four seasons in which the fluid can return to the cinnabar field. Refining form with *qi* adjusts by adding or subtracting a day according to the four seasons.\n\n*The True Formula* states: Upon verifying the effects of gathering and supplementing, choose the month within the year, the day within the month, and the hour within the day. Apply the Three Primes’ work: after one hundred days, the elixir’s power is complete; after two hundred days, the sacred fetus is firm; after three hundred days, true *qi* is born, and the fetal immortal is perfected. Diligently regulate practice, augmenting in accordance with the seasons. Only after completing the three hundred days does one proceed with the method of returning the elixir and refining form.\n\nThe method of flying golden essence from the *Gen* trigram into the brain ceases at the *Xun* trigram—this refers to the completion of the golden essence after three hundred days. *Li* ceases gathering. The *Li* trigram stops gathering the elixir; the *Kun* trigram stops restraining the *Yang* gate. Only the *Dui* trigram begins restraining the *Yang* gate, continuing until *Qian*. Having ceased the *Li* trigram, add the swallowing method to refine form.\n\nThe swallowing method: stir the tongue between the upper palate and cheeks, first swallowing the foul and turbid saliva, then retracting the tongue’s tip to fill the Jade Pool. Saliva is generated without rinsing and is swallowed. In the three months of spring, when liver *qi* is flourishing and spleen *qi* is weak, apply the swallowing method daily using the *Li* trigram. In the three months of summer, when heart *qi* is flourishing and lung *qi* is weak, apply the swallowing method daily using the *Xun* trigram, filling the upper and lower tongue to the Jade Pool, swallowing the emptiness of both cheeks as the method. In the three months of autumn, when lung *qi* is flourishing and liver *qi* is weak, apply the swallowing method daily using the *Gen* trigram. In the three months of winter, when kidney *qi* is flourishing and heart *qi* is weak, apply the swallowing method daily using the *Zhen* trigram. The method of flying golden essence does not hinder swallowing.\n\nIn the months of the four seasons, when spleen *qi* is flourishing and kidney *qi* is weak, as people regard kidney *qi* as their root, it is weak in all four seasons.\n\nIn the eighteen days following each seasonal transition month, apply the swallowing method daily using the *Dui* trigram, continuing alongside the previous swallowing methods. Only during autumn, cease the *Gen* trigram’s practice and exclusively use the *Dui* trigram’s swallowing method.\n\nFor all swallowing methods, first follow the preceding method. If saliva does not arise between the teeth and the Jade Pool, simply fill the upper and lower tongue, close the Jade Pool, gather both cheeks, and swallow the emptiness as the method—only the *qi* is swallowed, for within *qi* there is naturally water. The swallowing of *qi* should number thirty-six to forty-nine times in one year, then eighty-one times in the next year, and one hundred eighty-one times thereafter. This is the method for verifying the return of Jade Liquid Elixir. Practicing this for no more than three years will irrigate the Cinnabar Field, bathe the Embryonic Immortal, and cause true *qi* to flourish ever more.\n\nIf one does not practice this Jade Liquid Return Elixir method but instead nurtures the Internal Elixir for three hundred days, true *qi* will only just begin to arise. Then, using the *Gen* trigram’s Flying Golden Essence, strike through the Three Passes to ascend to the Mud Pill Palace. At that point, one must practice the Golden Liquid Return Elixir method: from the crown’s center, let the golden water descend in a single stream to return to the Yellow Court, where it transforms into gold and congeals into the Elixir, called the Golden Elixir.\n\nWhen practicing the Golden Liquid Return Elixir, choose a secluded chamber where wind, sunlight, and ordinary people cannot reach. Burn incense, clasp the hands, sit cross-legged, and after settling the body, rise. As soon as the fire is felt, sit upright, extinguish all thoughts and emotions, and inwardly observe the *Gen* trigram’s Flying Golden Essence entering the crown. Slightly raise the head and tilt the neck back, allowing the fire to fill the throat. Then nod forward, lower the head, and curve the neck, retracting the tongue’s tip to press against the upper palate. There, cool and refreshing water will appear, its taste sweet and fragrant, ascending to the crown’s gate and circulating through the hundred meridians. A true fragrance will naturally arise in the nose, and an extraordinary flavor will linger on the tongue. Without rinsing, swallow it down to return to the Yellow Court—this is the Golden Liquid Return Elixir.\n\nRegardless of spring, summer, autumn, or winter, after the Flying Golden Essence enters the brain following the *hou* method, proceed step by step with this practice, moving from *Gen* to *Xun*. At night, apply the Yang Barrier Restraining method, progressing from *Dui* to *Qian*. If one meticulously follows this method, it surpasses the previous techniques, enabling the fulfillment of one’s will. However, this only refines the form to abide in the world and attain longevity without death—it does not achieve liberation.\n\nThe *Essentials of the Dao* states: \"Recognize the root and foundation of the Five Phases, and you will understand the seasons of spring, summer, autumn, and winter. Drink several cups of nectar, then wander drunkenly to the Moon Palace.\"\n\nThe explanation: \"Recognize the root and foundation of the Five Phases\" refers to understanding the mutual generation and restriction of the Five Phases, which necessitates different trigram applications for swallowing methods, thereby knowing the seasonal shifts of spring, summer, autumn, and winter. \"Nectar\" is Jade Liquid. \"Moon Palace\" is the Cinnabar Field. \"Drunk\" means swallowing abundantly.\n\n\"Gazing eastward at Fusang before dawn, rising behind and reclining ahead without rest, a galloping steed roams the cosmos, while the eldest son only reaches Yangzhou.\"\n\nThe explanation: \"Gazing eastward at Fusang before dawn\" refers to the time before sunrise, when the *Gen* trigram’s Flying Golden Essence rises. \"Reclining ahead\" is the Jade Liquid Return Elixir. \"Galloping steed\" is the firing of Jade Liquid to refine the form. \"Roaming the cosmos\" means filling the four limbs. \"Eldest son\" is the *Zhen* trigram. \"Only reaches Yangzhou\" is the *Li* trigram. Refining the form with Jade Liquid begins with the *Zhen* trigram and ends with the *Li* trigram.\n\nAfter gathering the medicine for three hundred days, the embryo is complete, and the Flying Golden Essence reduces by one trigram, while the Yang Barrier Restraining remains unchanged. Cease gathering the medicine and incorporate the swallowing method, which follows the four seasons. This pertains to the method of refining the form. When adding the trigram timing to refine the form, begin with the *Zhen* trigram and conclude with the *Li* trigram, without limiting the years, months, or days—only stopping upon verification.\n\nThe body will become radiant, the spirit refined and graceful, and one will gradually develop an aversion to foul odors that offend the abdomen. Worldly emotions and attachments will naturally dissolve, true *qi* will become abundant and constantly satiating, food intake will lessen while wine capacity increases, the mortal frame will transform into spiritual awareness, and movement will be as swift as a galloping horse. The eyes will be as dark as lacquer, the body as smooth as congealed fat, white hair will turn black again, wrinkled skin will smooth out, and old age will permanently retain a youthful appearance. One will see autumn down at a hundred paces, old scars and blemishes will naturally fade, and tears, saliva, and filth will no longer appear. The Sacred Elixir will generate flavor, the numinous liquid will exude fragrance, and true fragrance and extraordinary taste will constantly linger in the mouth and nose. The saliva will congeal into refined butter, capable of curing illnesses, and the entire body will become white cream. All these are verifications of refining the form with the Jade Liquid Return Elixir.\n\nOnce verification is confirmed, one must diligently follow the method and proceed with subsequent practices according to the season.\n\n**Golden Liquid Return Elixir, Seventh**\n\nThe *Golden Edict* states: \"Accumulated yang forms spirit, and within spirit there is form—once born from the sun, the sun is born from the moon. Accumulated yin forms the body, and within the body there is spirit—once born from metal, metal is born from jade. That which follows yin and yang in arising and vanishing is the light of the sun and moon, for light arises from number, and number originates from *Qian* and *Kun*. That which follows yin and yang in ascending and descending is the *qi* of metal and jade, for *qi* arises from time, and time originates from heaven and earth.\"\n\nThe *True Origin* states: \"The numbers of the sun and moon employ six and nine. The numbers of *Qian* and *Kun*, the *qi* of metal and jade, ascend in spring and summer and descend in autumn and winter. Ascending and descending are the seasons of heaven and earth. Metal is born from earth, earth from stone, stone from jade—this is how form manifests below. The golden crow in the sun, the jade hare in the moon, the sun awaits the moon’s essence to shine—this is how spirit manifests above.\"\n\nThe analogy: \"The sun and moon correspond to *qi*; kidney *qi* corresponds to the moon, and heart *qi* corresponds to the sun.\"\n\nMetal and jade correspond to the *essences*; kidney essence corresponds to metal, and heart essence to jade. The so-called *jade essence* originates from kidney *qi*, ascending to the heart to merge with heart *qi*. When the two *qi* intersect and pass the *Double Towers*, the mouth is sealed, and the *saliva* fills the *Jade Pool*. Swallowing it is called *jade essence returning cinnabar*; refining it upward is called *jade essence refining form*. This essence arises from the kidneys yet is born in the heart—analogous to stone emerging from earth and jade from stone.\n\nThe so-called *golden essence* occurs when kidney *qi* merges with heart *qi* without ascending, instead steaming the lungs. The lungs, as the *flowery canopy*, enshroud the two *qi*. Drawing lung essence at dawn, one guides it from the *Lower Field* upward through the *Weilü* cavity, calling it *flying golden radiance into the brain* to replenish the *Mud Pill Palace*. Once replenished, it descends from above back to the *Lower Field*, called *golden essence returning cinnabar*. After returning to the *Lower Field*, it ascends again, suffusing the four limbs and rising front and back—this is *golden essence refining form*, also illustrating how metal is born from earth.\n\nFor those refining form and flying golden radiance, one must be in a pure chamber, strictly avoiding wind and sunlight. From afar, burn incense and silently invoke: *\"Three Pure Ones and Supreme Sages, may your servant dwell long in the world, transmit the Great Dao, and teach others. First, I shall practice the method of refining form, to transcend cold and heat, abstain from grain, and escape beyond yin and yang.\"* After the incantation, swallow.\n\n*The True Formula* states: *\"The cavity behind the tailbone is the Lower Pass; the spine’s sides are the Middle Pass; below the brain is the Upper Pass.\"* Begin by flying golden radiance to open the *Three Passes*. The kidneys correspond to earth, the heart to heaven, ascending to the crown to mirror the *Nine Heavens*. Jade essence refining form rises from the heart to the crown, connecting the *Nine Heavens*. After three hundred days of swallowing, the great elixir is complete, the *embryonic immortal* perfected, and true *qi* is born. Rising forward follows the old path of jade essence refining form; rising backward follows the old path of flying golden radiance. As golden radiance and jade essence circulate, verification begins with the *Kan* trigram. Afterward, rise once to the crown, lightly cover the ears with both hands, and inwardly observe. As prescribed, gently swallow the saliva. Press the tongue against the teeth, seal the *Jade Pool*, and await the essence from the upper palate before swallowing. After swallowing, rise again, concluding at the *Gen* trigram. In spring and winter, swallow once per two risings; in autumn and summer, swallow once per five risings. Each swallow’s count should not exceed fifty in autumn and summer, nor one hundred in spring and winter. After swallowing, rise forward to suffuse the head, face, limbs, and fingers until the *qi* is abundant. Rise again, concluding at the *Li* trigram. Thereafter, rising backward to swallow saliva is called *golden essence returning cinnabar*. After returning cinnabar, rise forward again—this is *golden essence refining form*. From the *Gen* trigram onward, refine form until the *Li* trigram. At the *Dui* trigram, restrain the *Yang Pass* until the *Qian* trigram. Rising backward to the crown, then descending, is called *golden essence returning cinnabar*. The *qi* of the golden elixir rising forward from below is *golden essence refining form*. When golden blossoms appear like jade trees, if the golden essence returning cinnabar has not yet reached the *Lower Origin* but rises both forward and backward, it is called *fire rising to incinerate the body*—this occurs when golden essence returning cinnabar and refining form rise simultaneously. In such practices, one must be meticulous, resolute, and unwavering, proceeding only until verification is achieved.\n\n*The Dao Essentials* states: *\"After rising, close the ears all night, drink the golden waves in due time, and feast until reaching Qingzhou before stopping. At sunset, listen again to the yang song.\"* The explanation: *\"After rising, close the ears all night\"* refers to the practice of golden essence returning cinnabar, where one must fly golden radiance from behind the elbow, striking the *Three Passes*. As the *qi* rises, swiftly cover the ears with both hands. The ears are the gates of kidney *qi*; one must prevent its leakage outward, ensuring it enters the brain. *\"Drink the golden waves in due time\"* means that upon sensing the *qi* enter the brain, immediately follow the previous method: nod the head, curve the neck, retract the tongue, and press it against the upper palate. The clear, sweet water that emerges is the sign—sweet as honey. At the *Gen* trigram, fly golden radiance and swallow once, concluding at the *Zhen* trigram. *Qingzhou* corresponds to the *Zhen* trigram; *sunset* to the *Dui* trigram. *\"Listen again to the yang song\"* refers to restraining the *Yang Pass* from the *Dui* trigram to the *Qian* trigram, using the *Li* trigram daily without gathering medicine.\n\nAfter drinking all night, fire rises, ascending forward and lifting backward to incinerate the body. Though unbound by years or months, within each day lies heaven and earth. The explanation: This is the method of golden essence refining form. *\"After drinking all night, fire rises\"* follows the previous method of golden essence returning cinnabar, where refining form at the *Gen* trigram ignites the fire. *\"Ascending forward and lifting backward\"* refers to flying golden radiance to ignite the fire. During jade essence refining form, first rise backward to guide golden radiance into the crown, then return cinnabar and rise forward to refine form—this distinguishes the method of golden essence refining form. When flying golden radiance ignites fire into the crown, rise forward to refine form. Rising both forward and backward is called *incinerating the body*. When refining cinnabar with fire, adjust the count according to the four seasons. This practice is not bound by years, months, days, or hours; one must be meticulous, single-minded, secluded, and withdrawn. *\"Within each day lies heaven and earth\"* means that before noon, one refines *Qian*; after noon, one refines *Kun*. From the body’s front and back: the abdomen is *Kun*, the back is *Qian*. *\"Refining Qian before noon\"* refers to flying golden radiance from behind the elbow and rising forward to refine form. *\"Refining Kun after noon\"* refers to restraining the *Yang Pass* from the *Dui* trigram to the *Qian* trigram. This method should only be practiced after verifying jade essence returning cinnabar and refining form, with meticulous seclusion, burning incense, and strict adherence.\n\nWhen refining the Golden Liquor Returned Elixir and subsequently tempering the form by restraining the *Yang Pass*, only after a full year may one proceed to *fenshen* (incineration of the body). *Fenshen* is the refinement of form preceding the *Kan* trigram. Regarding the body’s front and back: the abdomen is *Kun*, the back is *Qian*. For *fenshen*, refine *Qian* before noon and refine *Kun* after noon while restraining the *Yang Pass*. In refining *Qian*, the fire rises from below to above, activating both front and back. In winter and summer, completion occurs in three days; after five days, the method of *jiji* (Completion) is applied to prevent excess, ensuring the Golden Elixir remains supple. This is the ignition of *fenshen* fire within the central throat. Cease only upon verification.\n\nThe inner will becomes pure and lofty, merging with the Great Void; the hun and shen spirits do not wander, banishing dreams and sleep. The *Yang* essence solidifies the body, fortifying the spirit’s abode. One becomes impervious to the cold and heat of the four seasons, and one’s countenance naturally transforms. Even when facing ordinary people—though they may be wealthy or noble—one perceives only foul odors, for they remain of mortal bone and vulgar form. When merit and practice are fulfilled, the Three Clarities’ true registers are secretly conferred. The transformations of yin and yang, the fortunes and misfortunes of human affairs, and the movements of spirits—all may be foreknown. The eyes meet only dust and clutter, yet the mind severs all mundane realms. True *qi* fills the body, eliminating the need for food and drink. Extraordinary *qi* emanates a golden hue, and the immortal flesh rivals jade blossoms. Wherever one goes or stays, divine beings appear of their own accord, obeying commands as if by one’s own will.\n\nWhen true *qi* becomes purely *Yang*, it can dry external water. The above describes the verification of refining form with the Golden Liquor after the Returned Elixir. All that precedes is the secret to longevity and immortality.\n\n**Middle Vehicle’s Three Gates for Earthly Immortals**\n\n*Secret Transmission of the Orthodox Yang Perfected One’s* **Numinous Treasure Complete Methods** *(Middle Scroll Concludes)*\n\n*Secret Transmission of the Orthodox Yang Perfected One’s* **Numinous Treasure Complete Methods** *(Lower Scroll)*\n\nComposed by Orthodox Yang Perfected One Zhongli Quan (Yunfang)\nTransmitted by Pure Yang Perfected One Lü Yan (Dongbin)\n\n**Three Gates of the Great Vehicle for Transcending the Mundane and Entering Sagehood**\n**Morning Audience (Eighth)**\n\n**The Golden Proclamation** states:\nAt the primal division of the singular *qi*, the Great Dao took form and arrayed the Two Modes. Once the Two Modes settled into their positions, the Great Dao acquired names and divided into the Five Emperors. The Five Emperors, each dwelling in distinct lands, guarded their respective directions; the five directions, each governed by distinct *qi*, each guarded one celestial stem. The Azure Emperor’s stems *jia* and *yi* received the nine *qi* of Heaven’s true Wood virtue. The Vermilion Emperor’s stems *bing* and *ding* received the three *qi* of Heaven’s true Fire virtue. The White Emperor’s stems *geng* and *xin* received the seven *qi* of Heaven’s true Metal virtue. The Black Emperor’s stems *ren* and *gui* received the five *qi* of Heaven’s true Water virtue. The Yellow Emperor’s stems *wu* and *ji* received the singular *qi* of Heaven’s true Earth virtue. From the One arises the True One; the True One emerges through Earth, thus all things are born and completed in Earth. The Five Phases are generated and completed in the One. The Dao of the true origin is entirely born of the singular *qi*.\n\n**The Jade Book of Registers** states:\nOne, three, five, seven, nine—these are the Dao’s divisions manifesting as numbers. Metal, Wood, Water, Fire, Earth—these are the Dao’s transformations manifesting as images. East, West, South, North, Center—these are the Dao’s arrangements manifesting as positions. Azure, white, vermilion, yellow, black—these are the Dao’s dispersals manifesting as substances. When numbers return to the unnumbered, images revert to the imageless, positions reach the positionless, and substances return to the unsubstantial—then to attain the Dao’s unnumbered state, one must not divide it; to attain the Dao’s imageless state, one must not transform it; to attain the Dao’s positionless state, one must not arrange it; to attain the Dao’s unsubstantial state, one must not solidify it. The unnumbered is the Dao’s source; the imageless is the Dao’s root; the positionless is the Dao’s truth; the unsubstantial is the Dao’s subtlety.\n\n**The True Origin** states:\nOnce the Dao’s origin divided, it descended from root to branch. Those who awaken to its truth cultivate truth through truth, and when truth is internal, external truth naturally responds. Those who recognize its subtlety attain subtlety through subtlety, and when subtlety is internal, external subtlety naturally responds. Heaven and Earth grasp the Dao’s truth, yet their truth remains unmanifest, thus they have not escaped position. Heaven and Earth grasp the Dao’s subtlety, yet their subtlety remains unmanifest, thus they have not escaped substance. With substance, images may be sought; with position, numbers may be deduced. Within the realm of Heaven and Earth, amid the ten thousand things, none is more noble than humanity. Since Heaven and Earth possess images to be sought, we know their substance, *qi*, and water. Since Heaven and Earth possess numbers to be deduced, we know their positions, far and near. By examining this, we see that the Dao is not distant from humanity.\n\nFor analogy: Heaven and Earth have the Five Emperors, just as humans have the five viscera. The Azure Emperor, *jia-yi* Wood—*jia* as Yang, *yi* as Yin—corresponds to the liver’s *qi* and fluids. The Black Emperor, *ren-gui* Water—*ren* as Yang, *gui* as Yin—corresponds to the kidneys’ *qi* and fluids. The Yellow Emperor, *wu-ji* Earth—*wu* as Yang, *ji* as Yin—corresponds to the spleen’s *qi* and fluids. The Vermilion Emperor, *bing-ding* Fire—*bing* as Yang, *ding* as Yin—corresponds to the heart’s *qi* and fluids. The White Emperor, *geng-xin* Metal—*geng* as Yang, *xin* as Yin—corresponds to the lungs’ *qi* and fluids. Though the seasons of spring, summer, autumn, and winter differ, the flourishing of the heart, lungs, liver, and kidneys occurs in specific months.\n\n**The True Formula** states:\nDuring the three months of spring, the liver’s *qi* flourishes. When the liver flourishes, the parents’ true *qi*, following the celestial movements, resides in the liver. On Wood days (*jia-yi*), rescue Earth at the hours of *chen*, *xu*, *chou*, and *wei* by kindling the fire to refine the spleen’s *qi*. On other days, during the *dui* trigram hours, diminish Metal to deplete the lungs’ *qi*—at this time, one must not engage in practice. During the *kan* trigram hours, kindle the fire according to method to refine the kidneys’ *qi*. During the *zhen* trigram hours, enter the chamber, emphasizing inhalation over exhalation as optimal; prolonged breath retention is secondary. Count to one thousand breaths as the measure. At that time, internally visualize according to method, concentrating the mind with closed eyes. Azure light will naturally appear, gradually ascending the body to enter the *niwan* palace. From *yin* to *chen*, fill the *zhen* trigram. Exceeding one thousand breaths is especially excellent. If the breath becomes urgent, gradually reduce it, exhaling and then pausing—do not force continuity.\n\nDuring the three months of summer, the heart’s *qi* flourishes. When the heart flourishes, the parents’ true *qi*, following the celestial movements, resides in the heart. On Fire days (*bing-ding*), rescue Metal during the *dui* trigram hours by kindling the fire to refine the lungs’ *qi*. On other days, during the *kan* trigram hours, diminish Water to deplete the kidneys’ *qi*—at this time, one must not engage in practice. During the *zhen* trigram hours, kindle the fire according to method to refine the liver’s *qi*. During the *li* trigram hours, enter the chamber and practice breath regulation as before. Vermilion light will naturally appear, gradually ascending the body to enter the *niwan* palace. From *si* to *wei*, fill the *li* trigram. Exceeding one thousand breaths is especially excellent; the method is as described above.\n\nDuring the three months of autumn, the lungs’ *qi* flourishes. When the lungs flourish, the parents’ true *qi*, following the celestial movements, resides in the lungs. On Metal days (*geng-xin*), rescue Wood during the *zhen* trigram hours by kindling the fire to refine the liver’s *qi*. On other days, during the *li* trigram hours, diminish Fire to deplete the heart’s *qi*—at this time, one must not engage in practice. During the *xun* trigram hours, kindle the fire according to method to refine the spleen’s *qi*. During the *dui* trigram hours, enter the chamber and practice as before. White light will naturally appear, gradually ascending the body to enter the *niwan* palace. From *shen* to *xu*, fill the *dui* trigram.\n\nDuring the three months of winter, the kidneys’ *qi* flourishes. When the kidneys flourish, the parents’ true *qi*, following the celestial movements, resides in the kidneys. On Water days (*ren-gui*), rescue Fire during the *li* trigram hours by kindling the fire to refine the heart’s *qi*. On other days, during the hours of *chen*, *xu*, *chou*, and *wei*, diminish Earth to deplete the spleen’s *qi*—at this time, one must not engage in practice. During the *dui* trigram hours, kindle the fire according to method to refine the lungs’ *qi*. During the *kan* trigram hours, enter the chamber and practice as before. Black light will naturally appear, gradually ascending the body to enter the *niwan* palace. From *hai* to *chou*, fill the *kan* trigram.\n\nExplanation states: In spring, refine the liver for a thousand breaths, and green *qi* emerges. During the final eighteen days of spring, one need not practice as before; instead, adopt the method of settled breathing and sit in stillness throughout the day to nourish the spleen and refine one’s true *qi*. Only then may one kindle the fire during the *kan* trigram hours to refine the kidneys, lest their true *qi* be depleted.\n\nIn summer, refine the heart for a thousand breaths, and red *qi* emerges. During the final eighteen days of summer, one need not practice as before; instead, adopt the method of settled breathing and sit in stillness throughout the day, nurturing and refining as before. Only then may one kindle the fire during the *kan* trigram hours as previously described.\n\nIn autumn, refine the lungs for a thousand breaths, and white *qi* emerges. During the final eighteen days of autumn, one need not practice as before; instead, adopt the method of settled breathing and sit in stillness throughout the day, nurturing and refining as before. Only then may one kindle the fire during the *kan* trigram hours as previously described.\n\nIn winter, refine the kidneys for a thousand breaths, and black *qi* emerges. During the final eighteen days of winter, one need not practice as before; instead, adopt the method of settled breathing and sit in stillness throughout the day, nurturing and refining as before. Only then may one kindle the fire during the *kan* trigram hours as previously described.\n\nWhen yellow *qi* forms into light, silently observe myriad rays encircling the body.\n\nThe method of settled breathing does not lie in forcefully restraining or tightly closing the breath. Rather, it should be continuous as if present, applied without strain, moving from non-being into being, allowing it to reside naturally.\n\nThe method of gathering the elixir involves holding the saliva and clasping the hands firmly to prevent the heart’s true *qi* from scattering.\n\nWhen entering the chamber, one must close the door in a secluded and quiet dwelling, far from chickens, dogs, women, and all disturbing influences. Slightly open a small aperture to discern objects, but ensure neither wind nor sunlight enters, nor any sounds from the left or right.\n\nOne should settle the mind and still all thoughts, casting aside worldly concerns. Internally and externally, all must be serene, with nothing to disturb the intent. For the yang spirit is newly gathered and the true *qi* just congealing, one must tend to it as a newborn infant.\n\nBefore half the work is complete, burn incense and silently pray to Heaven day and night. Those who conceal themselves in the mountains and forests, with half their merit accomplished, become earthly immortals.\n\nKneeling and bowing with reverence, silently pray to Heaven, dwelling in remote caves or secluded grottoes. Establish great merit for the world, and remove great harm for the people. Those who remain hidden become heavenly immortals. After three bows are completed, sit in stillness, forgetting all schemes, and proceed with this method.\n\nOne must still follow the preceding methods step by step to witness verification. If one merely engages in this practice casually, one may labor in vain and see no fruition, ending only as a ghostly immortal whose yin spirit departs the body.\n\n*The Essential Dao* states: In practicing this method, there is no fixed duration of years, months, or days. Follow the preceding method each month until verification is achieved, and the *qi* will naturally manifest. One must be diligent and unwavering, abandoning all external affairs and focusing the will within the chamber. Discern the proper times and employ two pure yang youths. Alternatively, take on disciples, but beware of betrayal or reversal. After serving for a thousand days, one may complete a single cycle of *qi*. One can overcome ten with one, and in a hundred days, signs of progress will appear. In five hundred days, the *qi* will be complete, allowing one to practice inner observation of *qi* afterward. Gather the yang spirit to merge with celestial spirits, refining it to unite with the Dao, entering sagehood and transcending the mundane.\n\nThe verification of refining *qi* lies in feeling the body exceedingly harmonious, often ascending as if in flight, with the elixir’s light penetrating the bones and extraordinary fragrance filling the chamber. Next, in stillness, observe outwardly—purple radiance fills the eyes. Looking downward from the crown, golden light envelops the body. Strange signs and verifications are too numerous to record in full.\n\nThis is the ninth method of inner observation.\n\nThe *Golden Proclamation* states: The Great Dao is fundamentally formless, residing within *qi*. Its vastness knows no bounds, and no thing can contain it. The Great Dao is fundamentally functionless, yet operates through things. Its depth is unfathomable, and no principle can exhaust it. Speaking of the Dao in terms of its body, it then begins to have distinctions of inner and outer. Speaking of the Dao in terms of its function, it then begins to have a basis for observation and perception. Observe inwardly and not outwardly, and though nothing external remains unexamined, clarity is attained within. Observe the spirit and not the form, and though no form is left unprepared, the spirit becomes visible.\n\nThe *True Origin* states: With one mind observe the myriad things, and the myriad things are not said to be in excess. With the myriad things disturbing the one *qi*, the one *qi* is not said to be insufficient. When the one *qi* returns to the mind, the mind cannot be seized by things. When the one mind moves the one *qi*, the *qi* cannot be enslaved by methods. When the source of the mind is clear and penetrating, one illumination shatters ten thousand delusions, and one is unaware of the existence of things. When *qi* wages a fierce struggle, ten thousand sensations are stilled in a single breath, and one is unaware of the existence of methods. Things are no-things, returning to the original image. Methods are no-methods, thereby fulfilling the true nature of self-attainment.\n\nFor analogy: form arises from image, and names are established from form. With names, one infers their numbers; with numbers, one grasps their principles. Such is the discourse of analogy. Yet the supreme and void Dao transcends all things, and nothing can serve as a comparison. What can be likened is this: as in human cultivation, the seasons and sequences are without error, and accomplishments follow in order. The harmonious *qi* congeals without dispersing; the true nature, utterly serene, is without action. The spirit merges with the Dao and returns to spontaneity. At this juncture, take non-mind as mind. How then is one to respond to things? Take non-things as things. How then is one to employ methods? In true joy, one is blissfully unaware of having a body. Gradually entering the Dao of non-action, one reaches the realm of the subtle and imperceptible, becoming a guest who has entered sagehood and transcended the mundane.\n\nThe *True Formula* states: This method accords with the Dao, resembling the principle of visualization often discussed, or like the moment when Chan monks enter samadhi. Choose an auspicious site to establish a chamber. Kneel, pay respects, burn incense, sit upright with legs crossed, let the hair down, loosen the robes, clench the fists to retain spirit, empty the mind, and close the eyes. Before noon, slightly raise the body to kindle the fire and refine *qi*. After noon, slightly gather the body to concentrate the fire and burn the elixir. Regardless of day or night, when the spirit is clear and *qi* harmonious, one naturally delights in sitting. During sitting, if sounds are heard, do not listen; if visions appear, do not acknowledge them, and the illusory realms will disperse of themselves. If one acknowledges the illusory realms, demonic forces will intensify and not retreat. Immediately, slightly gather the body, then stretch the waist; afterward, slightly recline the chest without stretching the waist. Wait briefly until the fire rises before and behind, then raise the body without moving—this is called \"firing the body.\" When the fire rises, demonic forces scatter beyond the body, and yin evil does not enter the shell. Repeat this two or three times. Then visualize all between heaven and earth as a raging fire, entirely cool and devoid of things. Only then may one see carriages, horses, singing, dancing, canopies, silks, wealth, splendor, and joyous multitudes—processions in rows, five-colored clouds ascending, as if ascending to the celestial realms. Upon arriving there, one sees towering pavilions of jade green, courtyards stretching endlessly, pearls, jewels, gold, and jade scattered ungathered upon the ground, flowers, fruits, ponds, and pavilions beyond count. Suddenly, exotic fragrances arise on all sides, and the sounds of music and revelry fill the air. Guests and friends sit in full assembly, with delicacies of land and sea laid out. Laughter and conversation abound, celebrating great peace, and precious objects are exchanged as gifts. At this moment, though these are not yin ghosts or demonic forces, one must not regard them as auspicious. The true cultivator renounces external affairs, willingly endures solitude, conceals traces in rivers and lakes, or withdraws to secluded corners, cutting off thoughts and forgetting emotions, ever vigilant in conduct, enduring hardship and enjoying freedom. Once the work is accomplished and the method established, one may suddenly witness such splendor. Though not considering it a demonic illusion, one might mistake it for a true arrival in the celestial palace. Little does one know that the transcending of the mortal womb occurs within one’s own celestial palace atop the head. If one becomes attached and takes it for reality, failing to employ the method of transcendence, the yang spirit will remain within the body, and the embryonic immortal will not transform. One may then claim to have emerged above the dark paths, becoming an earthbound immortal, achieving longevity without death—but one cannot shed the mortal form to ascend as an immortal and return to the Three Isles as a celestial being. This is truly lamentable. Disciples must consider that though transcendence is difficult, it cannot be neglected.\n\nThe *Essentials of the Dao* states: The inexhaustible Dharma has already extinguished past faults.\n\n**Transcendence: Tenth Method**\n\nThe *Golden Proclamation* states: The Dao is fundamentally non-being; to speak of it as being is not the Dao. The Dao is fundamentally void; to speak of it as substantial is not the Dao. Being formless, even questions and responses cannot apply to it. Being imageless, even seeing and hearing cannot apply to it. Taking the mysterious and subtle as the Dao, the mysterious and subtle still cannot escape the burdens of inquiry and perception. Taking the subtle and imperceptible as the Dao, one still cannot avoid the burdens of seeing and hearing. If even the subtle and imperceptible are not the Dao, then the Dao is also beyond knowing how it is so.\n\nThe *Jade Scripture* states: Its coming has a beginning, yet one does not know the beginning of the Great Dao. What is this? Its going has an end, yet one does not know the end of the Great Dao. What is this? Above the loftiest heights, though there is an \"above,\" one does not know that above the Great Dao there is no limit. Below the deepest depths, though there is a \"below,\" one does not know that below the Great Dao there is no end. Profound and unfathomable, it is called the Dao. It accords with what beings attain and arranges distinctions. The Dao of non-action cannot be exhausted.\n\nThe *True Formula* states: \"Transcend\" means transcending the mortal body to enter the ranks of sages. \"Liberate\" means shedding the mundane womb to become an immortal child.\n\nWhen the spirit enters the qi-womb, the qi is complete in the true formula. Only when prior merits manifest verification at every stage may one dwell in a chamber of purity to enter the realm of the subtle and formless. There, one inwardly observes and recognizes the yang-spirit, then kindles the fire to subdue demons, burning the body to gather qi. The true qi ascends to the celestial palace, and within the shell, all is emptiness—nothing remains. Where to choose a secluded abode? Simply follow the practice of inward contemplation.\n\nAfter the three bows are completed, sit upright without rising or adjusting posture, close the eyes, and still the mind. When stillness reaches its utmost and the primordial is invoked, the body seems suspended in space, the spirit and qi drifting freely, difficult to restrain. In silent inward contemplation, clarity shines unobscured: mountains and rivers appear resplendent, pavilions and towers faintly discernible. Purple qi and crimson light swirl in formation, auspicious simurghs and rainbow-feathered phoenixes sing with flute-like voices. Amidst such wondrous splendor—truly the delight of the alchemical crucible, a separate realm within the grotto-heaven—one roams carefree, oblivious to the burdens of the dusty world.\n\nAt this moment of true emptiness, the qi turns of itself, without need for method or adherence to time. If a blue-green qi emerges from the east, accompanied by the resonant strains of reed pipes and the procession of banners, chariots, and attendants—uncountable in number—before long, a crimson qi appears from the south, a white qi from the west, a black qi from the north, and a yellow qi from the center. The five qi converge to form radiant clouds, the air filled with joyous music and exuberant harmony. Golden lads and jade maidens escort one’s form, now riding a fiery dragon, now mounting a dark crane, now astride a rainbow phoenix, now bestriding a fierce tiger. Ascending into the void, rising from below, one traverses realms where towers and temples defy description, and divine officials and spirits surpass enumeration.\n\nArriving at another place, ten thousand rows of female musicians stand in array, officials ranked in order, like the court of an earthly emperor, with sages and worthies all in attendance. At this time, one remains unmoved by all around, ascending further until reaching a gate where guards stand solemn and inviolable. The officials and musicians linger behind, unable to follow, and as one passes through, a canopy veils the face. Descending once more, one returns to the former dwelling. Such ascent and descent occur countless times—this is the method of adjusting the spirit’s emergence from the shell.\n\nWith days of accumulated practice, one ascends directly to the celestial palace and descends back to the original place, moving freely without obstruction. The ascent begins from below, like climbing a seven-tiered pagoda or ascending a three-story crimson tower. At first, one ascends step by step, and upon reaching the seventh level, one must not look down, for the spirit, startled, clings to the body and refuses to depart. Only after reaching the summit may one leap with eyes closed, as if in dream or waking. A body exists outside the body, its form like an infant’s, skin fresh and radiant, spirit luminous. Looking back at the former shell, one sees nothing—only a heap of filth, a withered tree—shame and remorse arise, yet it cannot be abandoned at once for distant wandering.\n\nFor the spirit’s emergence is not yet perfected, and the sagely qi has not fully coalesced. One must re-enter the original body, mastering the art of coming and going until effortless. At first, one may wander but a step or two, then two or three *li*, and with accumulated practice, like a stalwart warrior, one may stretch an arm to traverse a thousand or ten thousand *li*. The spirit grows mighty, the form robust, and courage unshakable. Then one may entrust the mortal frame to the mountains and rivers, dwelling beyond the world’s responses, no longer mingling with the vulgar.\n\nThus, when merits are fulfilled, one receives the celestial writ, riding simurghs and phoenixes, straddling tigers and dragons, journeying east and west to enter the Purple Court. First, one meets the True Lord of the Grand Tenuity, then resides on the lower isles. To ascend to the grotto-heaven, one must transmit the Dao and accumulate merit among mortals. Receiving the celestial writ, one ascends to the grotto-heaven as a celestial immortal.\n\nFew in ancient or modern times have succeeded in this practice, for many seek swift progress before merits are complete, or attempt transcendence through mere quiet sitting before verification is attained. Some, with lingering yin-spirits, emerge as ghost-immortals, unseen in form, wandering without destination, only to seize mortal shells and become human immortals. Others, unskilled in coming and going, lose the way back to their original body, their spirit adrift—this is the \"sitting transformation\" of Buddhist monks or the \"corpse-liberation\" of Daoist adepts.\n\nTherefore, this practice demands that prior merits be verified at every stage. One must choose a site and construct a chamber, far from all foul odors, putrid vapors, worldly noises, and the allure of women, lest they disturb the true qi or repulse the spirit. If one emerges and re-enters, enters and does not emerge, then form and spirit attain perfection, enduring as long as heaven and earth, undying through eons. If one emerges and does not re-enter, like a cicada shedding its husk, the spirit ascends to sageliness—transcending the mortal and shedding the vulgar to become a true immortal, dwelling beyond the dusty world on the isles of the Three Mountains.\n\nThe above is the secret of transcending the mortal to enter sageliness.\nThe Great Vehicle’s Three Gates pertain to celestial immortals.\nHere ends the *Secret Methods of the True Yang Immortal, Treasured Rites of the Numinous Treasure*, Scroll the Lower.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "秘传正阳真人灵宝毕法 经名：秘传正阳真人灵宝毕法。 简称《灵宝毕法》，三卷，原题锺离权着，吕岩传，出於唐徒期至五代时期。 底本出处：《正统道藏》太清部。 灵宝毕法序 道不可以言传，不可以名纪。 历古以来，升仙达道者，不为少矣。 仆志慕前贤，心怀大道，不意运起刀兵，时危世乱，始以逃生，寄迹江湖岩谷，退而识性留心，唯在清净希夷。 历看丹经，累参道友，止言养命之小端，不说真仙之大道。 因於终南山石壁间，获收《灵宝经》 三十卷。 上部《金诰书》，元始所着。 中部《玉录》，元皇所述。 下部《真源义》，太上所传。 共数千言。 予宵衣旰食，远虑深省，乃悟阴中有阳，阳中有阴，本天地升降之宜，日月交合之理。 气中生水，水中生气，亦心肾交合之理。 比物之象，道不远人。 配合甲庚，方验金丹之有准。 抽添卯酉，自然火候之无差。 红铅黑铅，彻底不成大药。 金液玉液，到头方是还丹。 从无入有，常怀征战之心。 自下升高，渐入希夷之域。 抽铅添汞，致二八之阴消。 换骨炼形，使九三之阳长。 水源清浊，辨於既济之时。 内景真虚，识於坐忘之日。 玄机奥旨，难以尽形方册。 灵宝妙理，可用入圣超凡。 总而为三乘之法，名《灵宝毕法》。 大道圣言，不敢私入一己用，传洞宾足下，道成勿秘，当请后来之士。 正阳真人锺离权云买房序。 秘传正阳真人灵宝毕法卷上 正阳真人锺离权云房着纯阳真人吕岩洞宾传 小乘安乐延年法四门 匹配阴阳第一",
      "translated_text": "**The Esoteric Transmission of the True Man of Orthodox Yang’s Complete Methods of the Numinous Treasure**\n\n**Scripture Title:** *The Esoteric Transmission of the True Man of Orthodox Yang’s Complete Methods of the Numinous Treasure* (abbreviated as *Complete Methods of the Numinous Treasure*), three scrolls. Originally attributed to Zhongli Quan, transmitted by Lü Yan, dating from the Tang interregnum to the Five Dynasties period. Base text from the *Daoist Canon of the Orthodox Tradition*, *Great Clarity* section.\n\n---\n\n**Preface to the *Complete Methods of the Numinous Treasure***\n\nThe Dao cannot be transmitted through words, nor can it be recorded by name. Since ancient times, those who ascended as immortals and attained the Dao have been many.\n\nI, in my aspiration, have long admired the sages of old and cherished the Great Dao in my heart. Yet, as the times turned to the chaos of war and the world fell into peril, I first sought refuge, wandering among rivers, lakes, and mountain valleys. In retreat, I came to know my nature and turned my mind toward purity, stillness, and the subtle.\n\nHaving perused the alchemical classics and repeatedly consulted with fellow Daoists, I found that they spoke only of minor arts for nourishing life, never of the great Dao of true immortality. Then, within the stone cliffs of Mount Zhongnan, I obtained the *Scripture of the Numinous Treasure* in thirty scrolls:\n- The *Upper Section: Golden Proclamations*, composed by the Primordial Beginning;\n- The *Middle Section: Jade Records*, expounded by the Primordial Sovereign;\n- The *Lower Section: True Source of Reality*, transmitted by the Most High.\n\nTogether, they comprise several thousand words. Through nights of vigil and days of diligent study, deep reflection led me to awaken to the truth: within yin there is yang, and within yang there is yin—this is the principle of heaven and earth’s ascent and descent, the pattern of the sun and moon’s union. Qi generates water, and water generates qi—this is also the principle of the heart and kidneys’ communion.\n\nBy comparing the images of things, the Dao is not distant from humanity. Matching *jia* and *geng* confirms the precision of the golden elixir. Extracting and augmenting *mao* and *you* naturally ensures the accuracy of the fire times. Red lead and black lead, when thoroughly refined, do not form the great medicine. Golden liquor and jade liquor, only at the culmination, become the returned elixir.\n\nFrom non-being into being, one must ever hold the mind of martial endeavor. From below ascending to the heights, one gradually enters the realm of the subtle and formless. Drawing out lead and adding mercury dissolves the yin of the two eights. Exchanging bones and refining form causes the yang of the nine threes to grow. The clarity or turbidity of the water’s source is discerned at the moment of *ji ji* (completion). The inner vision of true emptiness is recognized on the day of *zuo wang* (sitting in forgetfulness).\n\nThe profound subtleties of the mysterious mechanism cannot be fully expressed in written methods. The wondrous principles of the Numinous Treasure may be employed to transcend the mundane and enter sagehood. Thus, they are synthesized into the three vehicles’ methods, titled *Complete Methods of the Numinous Treasure*.\n\nThe sacred words of the Great Dao dare not be kept for private use. I transmit them to Dongbin, and when the Dao is achieved, do not conceal them—pass them on to those who come after.\n\n—Preface by the True Man of Orthodox Yang, Zhongli Quan\n\n---\n\n**Scroll One of *The Esoteric Transmission of the True Man of Orthodox Yang’s Complete Methods of the Numinous Treasure***\n\nComposed by the True Man of Orthodox Yang, Zhongli Quan\nTransmitted by the True Man of Pure Yang, Lü Yan (Dongbin)\n\n**Four Gates of the Lesser Vehicle’s Method for Peace and Longevity**\n**First Gate: Harmonizing Yin and Yang**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 585,
      "start_sentence": 0,
      "end_sentence": 35,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.722084045410156,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\秘传正阳真人灵宝毕法.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "《玉书》曰：大道无形，视听不可以见闻。 大道无名，度数不可以筹算。 资道生形，因形立名。 名之大者，天地也。 天得乾道而积气，以覆於下。 地得坤道而托质，以载於上。 覆载之间，上下相去八万四千里，气质不能相交。 天以乾索於坤而还於地中，其阳负阴而上升。 地以坤索於乾而还於天中，其阴抱阳而下降。 一升一降运於道，所以天地长久。 《真原》曰：天地之间，亲乎上者为阳，自上而下四万二千里，乃曰阳位。 亲乎下者为阴，自下而上四万二千里，乃曰阴位。 既有形名，难逃度数。 且一岁者，四时、八节、二十四气、七十二候、三百六十日、四千三百二十辰。 十二辰为一日，五日为一候，三候为一气－，二气为一节，二节为一时，四时为一岁。 一岁以冬至节为始，是时也，地中阳升。 凡一气十五日，上升七千里。 三气为一节，一节四十五日，阳升共二万一千里。 二节为一时，一时九十日，阳升共四万二千里，正到天地之中，而阳合阴位，阴中阳半，其气为温，而时当春分之节也。 过此阳升而入阳位，方曰得气而升，亦如前四十五日立夏。 立夏之后，四十五日夏至。 夏至之节，阳升通前计八万四千里以到天，乃阳中有阳，其气热，积阳生阴，一阴生於二阳之中，自夏至之节为始，是时天中阴降。 凡一气十五日，下降七千里。 三气为一节，一节四十五日，阴降共二万一千里。 二节为一时，一时九十日，阴降共四万二千里，以到天地之中，而阴交阳位。 是时阳中阴半，其气为凉，而时当秋分之节也。 过此阴降而入阴位，方曰得气，而降亦如前四十五日立冬。 立冬之后，四十五日冬至。 冬至之节，阴降通前计八万四千里以到地，乃阴中有阴，其气寒。 积阴生阳，一阳生於二阴之中。 自冬至之后，一阳复升，如前运行不已，周而复始，不失於道。 冬至阳生，上升而还天。 夏至阴生，下降而还地。 夏至阳升到天而一阴来至，冬至阴降到地，而一阳来至，故曰：冬至。 阳升於上，过春分而入阳位以离阴位，阴降於下。 过秋分而入阴位，以离阳位。 故曰春分、秋分。 凡冬至阳升之后，自上而下，非无阴降也，所降之阴乃阳中之余阴，止於阳位中消散而已，纵使下降得位，与阳升相遇，其气绝矣。 凡夏至阴降之后，自下而上，非无阳升也，所升之阳乃阴中之余阳，止於阴位中消散而已，纵使上升得位，与阴降相遇，其气绝矣。 阴阳升降，上下不出於八万四千里，往来难逃於三百六十日，即温、凉、寒、热之四气而识阴阳，即阳升阴降之八节而知天地。 以天机测之，庶达大道之绪余。 若以口耳之学，较量於天地之道，安得筹算而知之乎。 比喻曰：道生万物，天地乃物中之大者，人为物中之灵者，别求於道，人同天地。 以心比天，以肾比地，肝为阳位，肺为阴位。 心肾相去八寸四分，其天地覆载之间，比也。 气比阳，而液比阴。 子午之时，比夏至、冬至之节。 卯酉之时，比春分、秋分之节。 以一日比一年，以日用八卦时比八节。 子时肾中气生，卯时气到肝。 肝为阳，其气旺阳升，以入阳位，其春分之比也。 午时气到心，积气生液，夏至阳升到天，而阴生之比也。 午时心中液生，酉时液到肺。",
      "translated_text": "The *Jade Scripture* states: The Great Dao has no form, and cannot be perceived by sight or hearing. The Great Dao has no name, and cannot be measured by calculations or reckoning. It gives rise to form through the Dao, and names are established based on form. The greatest of names are Heaven and Earth. Heaven attains the Qian Dao and accumulates qi, covering all below. Earth attains the Kun Dao and supports substance, bearing all above. Between the covering and bearing, above and below are separated by eighty-four thousand li, and their qi and substance cannot interact. Heaven seeks Qian within Kun and returns to the center of Earth, its yang carrying yin upward. Earth seeks Kun within Qian and returns to the center of Heaven, its yin embracing yang downward. With each ascent and descent, they move through the Dao, and thus Heaven and Earth endure forever.\n\nThe *True Origin* states: Between Heaven and Earth, that which is close to above is yang; from above downward forty-two thousand li is called the yang position. That which is close to below is yin; from below upward forty-two thousand li is called the yin position. Once forms and names exist, they cannot escape measurement. Consider one year: four seasons, eight nodes, twenty-four qi, seventy-two hou, three hundred sixty days, and four thousand three hundred twenty periods. Twelve periods make one day, five days make one hou, three hou make one qi, two qi make one node, two nodes make one season, and four seasons make one year. The year begins with the Winter Solstice node, at which time yang ascends from within Earth. Each qi lasts fifteen days, ascending seven thousand li. Three qi make one node, one node forty-five days, with yang ascending a total of twenty-one thousand li. Two nodes make one season, one season ninety days, with yang ascending a total of forty-two thousand li, reaching precisely the center of Heaven and Earth, where yang meets the yin position. At this point, yang is half within yin, its qi becoming warm, corresponding to the Spring Equinox node. Beyond this, yang ascends into the yang position, now truly gaining qi and ascending, just as after forty-five days comes the Beginning of Summer. After the Beginning of Summer, forty-five days bring the Summer Solstice. At the Summer Solstice node, yang has ascended a total of eighty-four thousand li to reach Heaven, where yang is within yang, its qi hot. Accumulated yang generates yin, and one yin arises within two yang. Beginning with the Summer Solstice node, yin descends from within Heaven. Each qi lasts fifteen days, descending seven thousand li. Three qi make one node, one node forty-five days, with yin descending a total of twenty-one thousand li. Two nodes make one season, one season ninety days, with yin descending a total of forty-two thousand li to reach the center of Heaven and Earth, where yin meets the yang position. At this time, yin is half within yang, its qi becoming cool, corresponding to the Autumn Equinox node. Beyond this, yin descends into the yin position, now truly gaining qi and descending, just as after forty-five days comes the Beginning of Winter. After the Beginning of Winter, forty-five days bring the Winter Solstice. At the Winter Solstice node, yin has descended a total of eighty-four thousand li to reach Earth, where yin is within yin, its qi cold. Accumulated yin generates yang, and one yang arises within two yin. After the Winter Solstice, one yang ascends again, circulating endlessly as before, never deviating from the Dao.\n\nAt the Winter Solstice, yang is born, ascending to return to Heaven. At the Summer Solstice, yin is born, descending to return to Earth. When yang ascends to Heaven at the Summer Solstice, one yin arrives; when yin descends to Earth at the Winter Solstice, one yang arrives—hence the term \"Winter Solstice.\" After yang ascends above, it passes the Spring Equinox to enter the yang position, departing from the yin position; yin descends below, passing the Autumn Equinox to enter the yin position, departing from the yang position—hence the terms \"Spring Equinox\" and \"Autumn Equinox.\" After yang ascends at the Winter Solstice, from above downward, yin does not cease descending; the descending yin is merely the residual yin within yang, dissipating within the yang position. Even if it descends to its proper position and encounters ascending yang, its qi is exhausted. After yin descends at the Summer Solstice, from below upward, yang does not cease ascending; the ascending yang is merely the residual yang within yin, dissipating within the yin position. Even if it ascends to its proper position and encounters descending yin, its qi is exhausted. The ascent and descent of yin and yang, above and below, do not exceed eighty-four thousand li, and their coming and going cannot escape three hundred sixty days. Through the four qi of warmth, coolness, cold, and heat, one recognizes yin and yang; through the eight nodes of yang ascending and yin descending, one understands Heaven and Earth. Measuring this with the celestial mechanism, one may grasp the remnants of the Great Dao’s thread. If one relies on superficial learning to weigh the Dao of Heaven and Earth, how can calculations ever comprehend it?\n\nFor example: The Dao gives birth to the myriad things, and Heaven and Earth are the greatest among them. Humans are the most spiritually endowed among things, and when seeking the Dao separately, humans are akin to Heaven and Earth. The heart is likened to Heaven, the kidneys to Earth; the liver is the yang position, the lungs the yin position. The distance between heart and kidneys is eight cun and four fen, comparable to the space between Heaven’s covering and Earth’s bearing. Qi is likened to yang, and fluids to yin. The hours of *zi* and *wu* correspond to the Summer and Winter Solstice nodes; the hours of *mao* and *you* correspond to the Spring and Autumn Equinox nodes. One day is likened to one year, and the eight trigrams’ hours of the day correspond to the eight nodes. At the *zi* hour, qi is born within the kidneys; at the *mao* hour, qi reaches the liver. The liver is yang, and its qi flourishes as yang ascends into the yang position—this is the analogy of the Spring Equinox. At the *wu* hour, qi reaches the heart, and accumulated qi generates fluids—this is the analogy of yang ascending to Heaven at the Summer Solstice, where yin is born. At the *wu* hour, fluids are born within the heart; at the *you* hour, fluids reach the lungs.",
      "overlap_context": "nd when the Dao is achieved, do not conceal them—pass them on to those who come after.\n\n—Preface by the True Man of Orthodox Yang, Zhongli Quan\n\n---\n\n**Scroll One of *The Esoteric Transmission of the True Man of Orthodox Yang’s Complete Methods of the Numinous Treasure***\n\nComposed by the True Man of Orthodox Yang, Zhongli Quan\nTransmitted by the True Man of Pure Yang, Lü Yan (Dongbin)\n\n**Four Gates of the Lesser Vehicle’s Method for Peace and Longevity**\n**First Gate: Harmonizing Yin and Yang**",
      "start_char": 585,
      "end_char": 1795,
      "start_sentence": 36,
      "end_sentence": 88,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.513545513153076,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\秘传正阳真人灵宝毕法.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "肺为阴，其液盛阴降，以入阴位，其秋分之比也。 子时液到肾，积液生气，冬至阴降到地，而阳生之比也。 周而复始，日月循环，无损无亏，自可延年。 《真诀》 曰：天地於道一得之，惟入也，受形於父母，形中生形，去道愈远。 自胎完气足之后，六欲七情耗散元阳，走失真气，虽有自然之气液相生，亦不得天地之升降。 且一呼元气出，一吸元气入，接天地之气，既入不能留之，随呼而复出，本宫之气反而为天地夺之，是以气散难生液，液之少难生气。 当其气旺之时，日用卯卦，而於气也多入少出，强留在腹，当时自下而升者，不出自外而入者，暂住二气相合，积而生五脏之液，还元愈多，积日累功，见验方止。 《道要》曰：欲见阳公长子，须是多入少出。 从他儿女相争，过时求取真的。 乃积气生液，积液生气，匹配气、液相生之法也。 行持不过一年，夺功以一并三。 百日为期，旬日之见验。 进得饮食而疾病消除，头目清利而心腹空快，多力少倦，腹中时闻风雷之声，余验不可胜纪。 解曰：阳公长子者，乾索须坤，如气升而上也。 儿是气，自肾中升。 女是液，自心中降。 相争而上下之故，闭气而生液，匹配两停，过时自得真水也。 聚散水火第二 《金诰》曰：所谓大道者，高而无上，引而仰观其上无上，莫见其首。 所谓大道者，卑而无下，俛而俯察其下无下，莫见其基。 始而无先，莫见其前。 终而无尽，莫见其后。 大道之中而生天地，天地有高下之仪。 天地之中而有阴阳，阴阳有始终之数。 一上一下，仰观俯察，可以赜其机。 一始一终，度数筹算，可以得其理。 以此推之，大道可知矣。 《真原》曰：即天地上下之位，而知天地之高卑。 即阴阳终始之期，而知天道之前后。 天地不离於数，数终於一岁。 阴阳不失其宜，分於八节。 冬至一阳生，春分阴中阳半，过此纯阳而阴尽。 夏至阳太极而一阴生，升降如前。 上下终始，虽不能全尽大道，而不失大道之体。 欲识大道，当取法於天地，而审於阴阳之宜也。 比喻曰：以心、肾比天地，以气、液比阴阳，以一日比一年。 日用艮卦比一年用立春之节，乾卦比一年用立冬之节。 天地之中，亲乎下者为阴，自下而上四万二千里，乃曰阴位。 冬至阳生而上升，时当立春阳，升於阴位中二万一千里，是阳难胜於阴也。 天地之中，亲乎上者为阳，自上而下四万二千里，乃曰阳位。 夏至阴生而下降，时当立冬，阴降而下离天六万三千里，去地二万一千里，是阴得位而阳绝也。 一年之中立春比一日之时，艮卦也，肾气下传膀胱，在液中微弱难升也。 一年之中立冬比一日之时，乾卦也，乾卦心液下入，将欲还元，复入肾中，乃阴盛阳绝之时也。 人之致病者，阴阳不和，阳微阴多，故病多。 《真诀》曰：阳升立春，自下而上，不日而阴中阳半矣。 艮卦气微丑寅阴降立冬，自上而下，不日而阳中阴半矣。 乾卦气散戌亥。 天地之道如是。 惟人也，当艮卦气微，不知养气之端。 乾卦气散，不知聚气之理。 日夕以六欲七情耗散元阳，使真气不旺，走失真气，使真液不生，所以不得如天地之长久者，盖以此矣。 故古人朝屯暮蒙，日用二卦，乃得长生在世。 朝屯者，盖取一阳为屈而未伸之义，其在我者，养而伸之，勿以耗散。",
      "translated_text": "The lungs are yin, and their fluids flourish as yin descends into the yin position—this is the analogy of the Autumn Equinox. At the *zi* hour, fluids reach the kidneys, and accumulated fluids generate qi—this is the analogy of yin descending to Earth at the Winter Solstice, where yang is born. Circulating endlessly, like the cycles of the sun and moon, without loss or deficiency, one may thereby prolong life.\n\nThe *True Formula* states: Heaven and Earth attain unity through the Dao, yet upon entering, one receives form from father and mother. Within form, form is born, and one drifts ever farther from the Dao. After the fetus is complete and qi is full, the six desires and seven emotions dissipate primordial yang, causing true qi to scatter and flee. Though qi and fluids naturally generate one another, they no longer follow Heaven and Earth’s ascent and descent. With each exhalation, primordial qi departs; with each inhalation, primordial qi enters, connecting with Heaven and Earth’s qi. Yet once drawn in, it cannot be retained—following the breath, it departs again. The qi of one’s own palace is instead seized by Heaven and Earth. Thus, scattered qi struggles to generate fluids, and scant fluids struggle to generate qi.\n\nWhen qi is at its peak, employ the *mao* trigram in daily practice: inhale more and exhale less, forcibly retaining it in the abdomen. That which naturally ascends from below does not exit; that which enters from without temporarily abides. The two qi converge, accumulating to generate the fluids of the five viscera. The more one returns to the origin, the greater the accumulation. With daily cultivation and persistent effort, results will appear in due course.\n\nThe *Essentials of the Dao* states: To meet the eldest son of yang, one must inhale more and exhale less. Let the children contend with one another, and in time, seek the true. This is the method of accumulating qi to generate fluids, and accumulating fluids to generate qi—matching and pairing qi and fluids to engender one another. In practice, no more than a year is needed; with concentrated effort, one achieves threefold progress in one. A hundred days as a term, and signs appear within ten. One gains appetite and dispels illness, clarity in head and eyes, lightness in heart and abdomen, strength with little fatigue. At times, the sound of wind and thunder arises within the abdomen—countless other signs cannot all be recorded.\n\nExplanation: The \"eldest son of yang\" refers to *qian* seeking *xu* from *kun*, like qi ascending upward. The \"son\" is qi, rising from the kidneys. The \"daughter\" is fluid, descending from the heart. Their contention causes ascent and descent. By restraining qi, fluids are generated; when matched in balance, true water is naturally obtained after a time.\n\n**Gathering and Dispersing Water and Fire, Second Scroll**\n\nThe *Golden Teachings* state: The Great Dao is lofty yet without superior—look up, and its summit cannot be seen. The Great Dao is lowly yet without inferior—look down, and its base cannot be seen. It has no beginning, so its origin cannot be perceived; it has no end, so its conclusion cannot be seen. Within the Great Dao, Heaven and Earth are born. Heaven and Earth possess the measures of high and low. Within Heaven and Earth, yin and yang exist, with their cycles of beginning and end. Observing upward and downward, one may fathom their mechanism. Contemplating beginning and end, calculating their measures, one may grasp their principles. From this, the Great Dao may be known.\n\nThe *True Origin* states: From the positions of Heaven and Earth above and below, one knows their height and depth. From the cycles of yin and yang’s beginning and end, one knows the sequence of Heaven’s Dao. Heaven and Earth do not depart from their measures, which conclude in one year. Yin and yang do not lose their proper order, dividing into the eight nodes. At the Winter Solstice, one yang is born; at the Spring Equinox, yang is half within yin. Beyond this, pure yang prevails, and yin is exhausted. At the Summer Solstice, yang reaches its extreme, and one yin is born—its ascent and descent follow as before. Though the cycles of above and below, beginning and end, do not fully encompass the Great Dao, they do not depart from its essence. To comprehend the Great Dao, one must model it upon Heaven and Earth and examine the proper order of yin and yang.\n\nAnalogy: The heart and kidneys are likened to Heaven and Earth; qi and fluids to yin and yang; one day to one year. The daily use of the *gen* trigram corresponds to the *Lichun* (Beginning of Spring) node in a year; the *qian* trigram to the *Lidong* (Beginning of Winter) node. Within Heaven and Earth, that which is closer to below is yin. From below upward, forty-two thousand *li* is called the yin position. At the Winter Solstice, yang is born and ascends; at the time of *Lichun*, yang rises within the yin position to twenty-one thousand *li*—this is yang’s struggle to overcome yin. Within Heaven and Earth, that which is closer to above is yang. From above downward, forty-two thousand *li* is called the yang position. At the Summer Solstice, yin is born and descends; at the time of *Lidong*, yin descends, departing sixty-three thousand *li* from Heaven and twenty-one thousand *li* from Earth—this is yin attaining its position and yang being cut off.\n\nWithin a year, *Lichun* corresponds to the *gen* trigram in a day’s hours. Kidney qi transmits downward to the bladder, weak and struggling to ascend within fluids. Within a year, *Lidong* corresponds to the *qian* trigram in a day’s hours. Heart fluids descend, about to return to the origin and re-enter the kidneys—this is the time of yin’s flourishing and yang’s severance.\n\nThe cause of human illness lies in the disharmony of yin and yang, with yang weak and yin excessive—thus, illness is common. The *True Formula* states: At *Lichun*, yang ascends from below; before long, yang is half within yin. At the *gen* trigram, qi is faint in the *chou* and *yin* hours. At *Lidong*, yin descends from above; before long, yin is half within yang. At the *qian* trigram, qi scatters in the *xu* and *hai* hours. Such is the Dao of Heaven and Earth. Yet humans, when qi is faint at the *gen* trigram, do not know the means to nurture qi; when qi scatters at the *qian* trigram, do not understand the principle of gathering qi. Day and night, the six desires and seven emotions dissipate primordial yang, causing true qi to weaken and scatter, true fluids to fail to generate. Thus, one cannot attain the longevity of Heaven and Earth—this is the reason.\n\nTherefore, the ancients practiced *zhun* in the morning and *meng* in the evening, employing two trigrams daily to achieve long life in the world. *Zhun* in the morning takes the meaning of one yang coiled and unextended. For oneself, one nurtures and extends it, preventing dissipation.",
      "overlap_context": "spond to the eight nodes. At the *zi* hour, qi is born within the kidneys; at the *mao* hour, qi reaches the liver. The liver is yang, and its qi flourishes as yang ascends into the yang position—this is the analogy of the Spring Equinox. At the *wu* hour, qi reaches the heart, and accumulated qi generates fluids—this is the analogy of yang ascending to Heaven at the Summer Solstice, where yin is born. At the *wu* hour, fluids are born within the heart; at the *you* hour, fluids reach the lungs.",
      "start_char": 1795,
      "end_char": 3045,
      "start_sentence": 89,
      "end_sentence": 141,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.901362657547,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\秘传正阳真人灵宝毕法.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "暮蒙者，盖取童蒙求我以就明弃暗，乃阴间求阳之义，其在我者，昧而明之，勿以走失。 是以日出当用艮卦之时，以养元气，勿以利名动其心，勿以好恶介其意。 当披衣静坐，以养其气。 绝念忘情，微作导引。 手脚递互伸缩三五下，使四体之气齐生，内保元气上升以朝於心府。 或咽津一两口，搓摩头面三、二十次，呵出终夜壅聚恶浊之气。 久而色泽充美，肌肤光润。 艮卦养元气。 又於日入用乾卦之时，以聚元气。 当入室静坐咽气，搐外肾。 咽气者，是纳心火於下。 搐外肾者，是收膀胱之气於内。 乾卦聚元气。 上下相合肾气之火，三火聚而为一，以补暖下田。 无液则聚气生液，有液则炼液生气，名曰聚火，又曰太一含真气也。 早朝咽津摩面，手足递互伸缩，名曰散火，又名曰小炼形也。 《道要》曰：花残叶落深秋，杨妃懒上危楼。 欲得君民和会，当时宴罢频收。 此纳心气而收膀胱气，不令耗散而相合肾气，以接坎卦气，海中新生之气也。 必以交立冬为首，见验方止。 行持不过一年，夺功以一并三，百日为期，旬日见验。 容颜光泽而肌肤充悦，下田温暖，小便减省，四体轻健而精神清爽，痼疾宿病尽皆消除。 如惜岁月，不倦行持，只於匹配阴阳功内稍似见验，叙入此功，日用添入艮卦，略行此法。 乾卦三元用事，应验方止。 三元乾、艮、震也。",
      "translated_text": "At dusk, *meng* takes the meaning of an unenlightened child seeking me to attain brightness and abandon darkness—this is the principle of yin seeking yang. For oneself, one obscures and then illuminates it, preventing its dissipation.\n\nThus, at sunrise, when the *gen* trigram governs, one nurtures primordial qi. Do not let profit or fame stir the heart, nor let likes and dislikes disturb the mind. Instead, don a robe and sit in stillness to cultivate qi. Banish thoughts and forget emotions, gently performing *daoyin*. Alternately stretch and contract the hands and feet three to five times, so that the qi of the four limbs arises evenly, inwardly preserving primordial qi to ascend and gather at the heart’s palace. One may swallow saliva once or twice and rub the head and face twenty to thirty times, exhaling the foul, stagnant qi accumulated through the night. With time, one’s complexion will glow with radiance, and the skin will become lustrous.\n\nThe *gen* trigram nurtures primordial qi. Furthermore, at sunset, when the *qian* trigram governs, one gathers primordial qi. Enter a chamber and sit in stillness, swallowing qi and contracting the external kidneys. Swallowing qi draws the heart’s fire downward. Contracting the external kidneys gathers the bladder’s qi inward. The *qian* trigram gathers primordial qi. When the upper and lower kidney fires unite, the three fires merge into one, warming and replenishing the lower elixir field. Without fluids, one gathers qi to generate fluids; with fluids, one refines them to produce qi. This is called \"gathering fire\" or \"the Supreme Unity containing true qi.\"\n\nIn the early morning, swallowing saliva, rubbing the face, and alternately stretching the hands and feet is called \"dispersing fire\" or \"minor refinement of form.\" As the *Daoist Essentials* states:\n\n> When blossoms wither and leaves fall in late autumn,\n> The consort grows weary of ascending the high tower.\n> To harmonize ruler and people,\n> One must frequently gather after the feast.\n\nThis means drawing in the heart’s qi and gathering the bladder’s qi, preventing dissipation so they may unite with kidney qi to receive the qi of the *kan* trigram—the newly arisen qi from the sea. One must begin at the Winter Commencement solar term and continue until results appear. The practice should not exceed a year; the work of one merges into three, with a hundred days as the period and verification appearing in ten. The complexion will grow luminous, the skin full and joyful, the lower elixir field warm, urination reduced, the four limbs light and strong, the spirit clear and refreshed, and chronic illnesses entirely dissolved.\n\nIf one cherishes time and practices without weariness, even within the work of harmonizing yin and yang, slight results may appear. This method is then incorporated into daily practice, with the *gen* trigram added. When the three *yuan* of the *qian* trigram take effect, one ceases upon verification. The three *yuan* are *qian*, *gen*, and *zhen*.",
      "overlap_context": "the six desires and seven emotions dissipate primordial yang, causing true qi to weaken and scatter, true fluids to fail to generate. Thus, one cannot attain the longevity of Heaven and Earth—this is the reason.\n\nTherefore, the ancients practiced *zhun* in the morning and *meng* in the evening, employing two trigrams daily to achieve long life in the world. *Zhun* in the morning takes the meaning of one yang coiled and unextended. For oneself, one nurtures and extends it, preventing dissipation.",
      "start_char": 3045,
      "end_char": 3558,
      "start_sentence": 142,
      "end_sentence": 166,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.525493860244751,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\秘传正阳真人灵宝毕法.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "解曰：花残叶落深秋者，如人气弱日暮之时，阳气散而不升，故曰懒上危楼。 楼者，重楼也。 心为君火，膀胱民火，咽气搐外肾，故心与外肾气聚而为一，故曰和会。 宴乃咽也，收乃搐也。 早辰功不绝者，此法为主本也。 交媾龙虎第三 《金诰》曰：太元初判而有太始，太始之中而有太无，太无之中而有太虚，太虚之中而有太空，太空之中而有太质。 太质者，天地也。 天地清浊，其质如卵而玄黄之色，乃太空之中一物而已。 阳升到天太极而生阴，以窈冥抱阳而下降。 阴降到地太极而生阳，以恍惚负阴而上升。 一升一降，阴降阳升，与天地行道而万物生成也。 《真原》曰：天如覆盆，阳到难升。 地如盘石，阴到难入。 冬至而地中阳升，夏至到天，其阳太极而生阴。 所以阴生者，以阳自阴中来而起於地，恍恍惚惚，气中有水，其水无形，夏至到天成水，是曰阳太极而阴生也。 夏至而天中阴降，冬至到地，其阴太极而阳生。 所以阳生者，以阴自阳中来而出於天，杳杳冥冥，水中有气，其气无形，冬至到地，积水生气，是曰阴太极而阳生也。 比喻曰：以身外比太空，以心肾比天地，以气液比阴阳，以子午比冬夏。 子时乃曰坎卦，肾中气生。 午时乃曰离卦，气到心。 肾气与心气相合而太极生液，所以生液者，以气自肾中来，气中有真水，其水无形。 离卦到心，接着心气，则太极而生液者如此。 离卦心中液生、坎卦液到肾，液与肾水相合而太极，复生於气。 所以生气者，以液自心中来，掖中有真气，其气无形。 坎卦到肾，接着肾水，则太极而生气者如此。 可以比阳升阴降，至太极而相生。 所生之阴阳，阳中藏水，阴中藏气也。 《真诀》曰：肾中生气，气中有真水。 心中生液，液中有真气。 真水、真气乃真龙、真虎也。 阳到天而难升，太极生阴。 阴到地而难入，太极生阳。 天地之理如此。 惟人也，不得比天地者，六欲、七情感物丧志，而耗散元阳，走失真气。 当离卦肾气到心，神识内定，鼻息少入迟出，绵绵若存，而津满口勿吐勿咽，自然肾气与心气相合，太极生液。 以液与真水相合，真气恋液，真水恋气。 本不相合，盖液中有真气，气中有真水，互相交合相恋而下，名曰交姤龙虎。 若以火候无差，而抽添合宜，三百日养就真胎而成大药，炼质焚身，朝元超脱之本也。 《道要》曰：一气初回元运，真阳欲到离宫，捉取真龙真虎，玉池春水溶溶。 此恐泄元气而走真水於身外也。 气散难生液，液少而无真气。 气、水不交，安成大药。 当此年中用月，以冬至为始，日中用时，以离卦为期。 或以晚年奉道，根源不固，自度虚损而气不足之后，十年之损，一年用功补之，名曰采补还丹。 补之过数，止行此法，名曰水火既济。 可以延年益寿，乃曰人仙。 功验不可备纪。 若补数足而口生甘津，心境自除，情欲不动，百骸无病，而神光暗中自见双目，时若惊电。 以冬至日为始节，用法三百日胎仙具。 解曰：在外午时为离宫，太阳为真阳。 在人心为离宫，元阳为真龙也，真虎乃肾中之水也。 真龙心液中之气，口为玉池，津为春水。 烧炼丹药第四 《金诰》曰：天地者，大道之形。 阴阳者，天地之道。 寒、热、温、凉，形中有气也。",
      "translated_text": "A Commentary states: When flowers wither and leaves fall in late autumn, it is like the time when a person’s qi weakens at dusk—yang qi scatters and fails to ascend, hence the saying, “Too weary to climb the high tower.” The tower refers to the *chonglou* (double-storied structure). The heart is the sovereign fire, the bladder the ministerial fire; swallowing qi and drawing in the external kidneys cause the heart and external kidneys to unite their qi as one—this is called *hehui* (harmonious union). *Yan* means swallowing, and *shou* means drawing in.\n\nIf the morning practice is unbroken, this method becomes the foundation. **The Third: The Union of Dragon and Tiger**\n\nThe *Jingao* says: When the Great Primal first divided, there was the Great Beginning; within the Great Beginning was the Great Non-Being; within the Great Non-Being was the Great Void; within the Great Void was the Great Emptiness; and within the Great Emptiness was the Great Substance. The Great Substance is Heaven and Earth. Heaven and Earth, clear and turbid, take the form of an egg with a dark and yellow hue—merely one thing within the Great Emptiness. When yang ascends to the Heavenly Supreme Ultimate, it generates yin, which in profound obscurity embraces yang and descends. When yin descends to the Earthly Supreme Ultimate, it generates yang, which in a state of indistinctness bears yin and ascends. With one ascent and one descent—yin descending and yang ascending—Heaven and Earth follow the Dao, and the myriad things are born and formed.\n\nThe *Zhenyuan* says: Heaven is like an overturned basin, making it difficult for yang to ascend when it reaches its limit. Earth is like a stone slab, making it difficult for yin to penetrate when it reaches its limit. At the Winter Solstice, yang within the earth ascends; at the Summer Solstice, when it reaches Heaven, yang attains the Supreme Ultimate and generates yin. The reason yin is generated is that yang arises from within yin, emerging from the earth in a state of indistinctness—within qi there is water, though this water has no form. When the Summer Solstice reaches Heaven, it transforms into water; this is yang attaining the Supreme Ultimate and generating yin. At the Summer Solstice, yin within Heaven descends; at the Winter Solstice, when it reaches Earth, yin attains the Supreme Ultimate and generates yang. The reason yang is generated is that yin emerges from within yang, issuing from Heaven in a state of profound obscurity—within water there is qi, though this qi has no form. When the Winter Solstice reaches Earth, accumulated water generates qi; this is yin attaining the Supreme Ultimate and generating yang.\n\nAs an analogy: Compare the body’s exterior to the Great Emptiness, the heart and kidneys to Heaven and Earth, qi and fluids to yin and yang, and the hours of *zi* and *wu* to winter and summer. The *zi* hour corresponds to the *kan* trigram, when qi is born in the kidneys. The *wu* hour corresponds to the *li* trigram, when qi reaches the heart. When kidney qi and heart qi unite, the Supreme Ultimate generates fluid. The reason fluid is generated is that qi arises from within the kidneys—within qi there is true water, though this water has no form. When the *li* trigram reaches the heart and meets heart qi, the Supreme Ultimate generates fluid in this manner. When fluid is born in the heart (*li* trigram) and reaches the kidneys (*kan* trigram), the fluid unites with kidney water, and the Supreme Ultimate regenerates qi. The reason qi is generated is that fluid arises from within the heart—within fluid there is true qi, though this qi has no form. When the *kan* trigram reaches the kidneys and meets kidney water, the Supreme Ultimate generates qi in this manner. This can be likened to yang ascending and yin descending, reaching the Supreme Ultimate and generating one another. The yin and yang thus generated contain water within yang and qi within yin.\n\nThe *Zhenjue* says: Qi is born in the kidneys, and within qi there is true water. Fluid is born in the heart, and within fluid there is true qi. True water and true qi are the true Dragon and true Tiger. When yang reaches Heaven and struggles to ascend, the Supreme Ultimate generates yin. When yin reaches Earth and struggles to penetrate, the Supreme Ultimate generates yang. Such is the principle of Heaven and Earth. Only humans cannot compare to Heaven and Earth because the six desires and seven emotions, stirred by external things, scatter their original yang and dissipate their true qi. When kidney qi (*li* trigram) reaches the heart, the spirit and consciousness settle inwardly; the breath enters slowly through the nose and exits gently, continuous yet subtle. Saliva fills the mouth—do not spit or swallow it. Naturally, kidney qi and heart qi unite, and the Supreme Ultimate generates fluid. When fluid unites with true water, true qi clings to fluid, and true water clings to qi. Though they are not inherently united, within fluid there is true qi, and within qi there is true water. They intermingle, cling to one another, and descend—this is called the *jiaogou* (union) of Dragon and Tiger. If the firing times are without error and the withdrawal and addition are appropriate, after three hundred days of nurturing, the true embryo forms into the great medicine. This is the foundation of refining the body, burning away the physical form, attaining the origin, and transcending the mundane.\n\nThe *Daoyao* says: When the primal qi first returns to its original movement, true yang is about to reach the *li* palace. Seize the true Dragon and true Tiger—within the Jade Pool, spring waters flow gently. This is to prevent the leakage of original qi and the loss of true water beyond the body. If qi scatters, fluid is difficult to generate; if fluid is scant, there is no true qi. If qi and water do not unite, how can the great medicine be formed? During this year, take the Winter Solstice as the beginning; within the day, take the *li* trigram as the period. For those who embrace the Dao in later years, whose roots are unstable, and who suffer from depletion and insufficiency of qi, ten years of depletion require one year of practice to restore—this is called *caibu huandan* (gathering and replenishing the elixir). If the replenishment exceeds the required measure, cease this method and practice *shuihuo jiji* (the harmony of water and fire). This can prolong life and extend years—it is called the *renxian* (human immortal). The effects of the practice cannot be fully recorded. If the replenishment is sufficient, sweet saliva will arise in the mouth, the mind’s afflictions will vanish, desires will not stir, the hundred bones will be free of illness, and within the darkness, the radiance of the spirit will appear before the eyes like lightning. Taking the Winter Solstice as the starting point and practicing the method for three hundred days, the embryonic immortal is complete.\n\nA Commentary states: Externally, the *wu* hour is the *li* palace, and the great yang is the true yang. Within the person, the heart is the *li* palace, and original yang is the true Dragon; the true Tiger is the water within the kidneys. The true Dragon is the qi within heart fluid; the mouth is the Jade Pool, and saliva is the spring water.\n\n**The Fourth: Refining the Elixir**\n\nThe *Jingao* says: Heaven and Earth are the forms of the great Dao. Yin and yang are the Dao of Heaven and Earth. Cold, heat, warmth, and coolness—within form there is qi.",
      "overlap_context": "wer elixir field warm, urination reduced, the four limbs light and strong, the spirit clear and refreshed, and chronic illnesses entirely dissolved.\n\nIf one cherishes time and practices without weariness, even within the work of harmonizing yin and yang, slight results may appear. This method is then incorporated into daily practice, with the *gen* trigram added. When the three *yuan* of the *qian* trigram take effect, one ceases upon verification. The three *yuan* are *qian*, *gen*, and *zhen*.",
      "start_char": 3559,
      "end_char": 4796,
      "start_sentence": 167,
      "end_sentence": 223,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.62771201133728,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\秘传正阳真人灵宝毕法.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "云、雾、雨、露，气中有象也。 地气上升，腾而为云，散而为雨。 天气下降，散而为雾，凝而为露。 积阴过，则露为霜而为雪。 积阳过，则雾为烟、为云、为霞。 阴中伏阳，阳气不降，击搏而生雷霆。 阳中伏阴，阴气不凝，坚固而生雹霰。 阴阳不合，相对而生闪电。 阴阳不匹配，乱交而生虹蜺。 积真阳以成神，而丽乎天者星辰。 积真阴以成形，而壮乎地者土石。 星辰之大者日月，土石之贵者金玉。 阴阳见於有形上之日月，下之金玉也。 《真原》曰：阴不得阳不生，阳不得阴不成。 积阳而神、丽乎天而大者，日月也，日月乃真阳而得真阴相成也。 积阴而形壮於地而贵者，金玉也，金玉乃真阴而得真阳以相生也。 戌亥行持，离卦采药，乾卦进火。 比喻曰：真阳比心液中真气，真阴比肾气中真水。 真水不得真气不生，真气不得真水不成。 真水、真气既於离卦和合於心上肺下，如子母之相恋，夫妇之相爱。 自离至兑，兑卦阴旺阳弱之时，比日月之下弦，金玉之在晦，至旦数足生明。 金玉以阳生阴，气足生宝，金玉成宝者，盖以气足而进之以阳。 日月生明者，盖以数足而受之以魂。 比於乾卦进火，炼阳无衰火，以加数而阳长生也。 《真诀》曰：离卦龙虎交姤，名曰采药。 时到乾卦，气液将欲还元，而生膀胱之上、脾胃之下、肾之前、脐之后、肝之左、肺之右、小肠之右、大肠之左，当时脾气旺而肺气盛，心气绝而肝气弱。 真气本以阳气相合而来，既以阳气弱而真气无所恋，徒劳用工，而采合必於此时。 神识内守，鼻息绵绵，以肚腹微胁脐肾，觉热太甚，微放轻，勒腹脐。 未热紧勒，渐热即守常，任意放志，以满乾坤，乃曰勒阳关而炼丹药。 使气不上行，以同真水经脾宫，随呼吸而搬运於命府黄庭之中。 气液造化，时变而为精，精变而为珠，珠变而为汞，汞变而为砂，砂变而为金，乃曰金丹。 其功不小矣。 《道要》曰：采药须凭玉兔，采药心气，玉兔肾水。 成亲必藉黄婆，等到雍州相见，雍州乾卦。 奏传一曲阳歌。 此乃与采药日用对行。 凡以晚年补完，十损一补之，此法名曰炼汞补丹田。 补之数足，止於日用。 离卦采药，乾卦烧炼，勒阳关。 春冬多采少炼，乾一而离二倍用功也。 秋夏少采多炼，离一而乾二倍用功也。 随年月气旺采炼之，功验在前，可延年住世而为人仙。 若以补数既足见验，进功谨节。 用功采药一百日，药力全。 二百日，圣胎坚。 三百日，真气生而胎仙完。 凡药力全而后进火加数，乃曰火候。 凡圣胎坚后，火候加至小周天数。 凡胎圆真气生，火候加至，乃曰周天火候。 是采药而交姤龙虎，炼药而进火，方为入道。 当绝迹幽居，心在内观，内境不出而外境不入，如妇养孕，龙之养珠。 虽饮食寤寐之间，语默如婴儿，举止如室女，犹恐有失有损，心不可暂离於道也。 解曰：药是心中真气，兔是肾中真水，黄婆是脾中液，和合气水而入黄庭。 雍州，乾卦，勒阳胁腹也，又曰勒阳关也。 右小乘法四门系人仙。 秘传正阳真人灵宝毕法卷上竟",
      "translated_text": "Clouds, mist, rain, and dew—within qi there are images. Earth’s qi ascends, rising to become clouds and dispersing to become rain. Heaven’s qi descends, scattering into mist and condensing into dew. When accumulated yin exceeds, dew transforms into frost and then snow. When accumulated yang exceeds, mist becomes smoke, clouds, and rosy dawn. Within yin, yang lies concealed; if yang qi does not descend, it strikes and collides to generate thunder and lightning. Within yang, yin lies concealed; if yin qi does not congeal, it hardens to produce hail and graupel. When yin and yang fail to unite, they oppose each other to generate lightning. When yin and yang are mismatched, their chaotic union produces rainbows. Accumulated true yang forms spirits, which adorn the heavens as stars. Accumulated true yin forms shapes, which strengthen the earth as soil and stone. The greatest of stars are the sun and moon; the most precious of soil and stone are gold and jade. Yin and yang manifest in the visible forms of the sun and moon above, and gold and jade below.\n\n*The True Origin* states: Yin cannot generate without yang; yang cannot complete without yin. Accumulated yang becomes spirit, adorning the heavens in grandeur—such are the sun and moon. The sun and moon are true yang that achieves completion through true yin. Accumulated yin forms shapes, strengthening the earth in preciousness—such are gold and jade. Gold and jade are true yin that attains generation through true yang.\n\nPractice during the *xu* and *hai* hours: in the *Li* trigram, gather the medicine; in the *Qian* trigram, advance the fire. As an analogy: true yang corresponds to the true qi within heart fluid; true yin corresponds to the true water within kidney qi. True water cannot generate without true qi; true qi cannot complete without true water. When true water and true qi harmonize in the *Li* trigram—above the heart and below the lungs—they cling to each other like mother and child, or husband and wife in mutual affection.\n\nFrom *Li* to *Dui*, when the *Dui* trigram’s yin flourishes and yang weakens, it resembles the moon’s waning crescent or gold and jade hidden in darkness, awaiting the dawn when their measure is fulfilled to shine anew. Gold and jade, refined by yang to generate yin, become treasures when qi is sufficient—this is achieved by advancing yang to fullness. The sun and moon renew their brightness when their measure is fulfilled and they receive the soul. This is analogous to advancing the fire in the *Qian* trigram, refining yang without declining flame, so that yang perpetually regenerates through incremental addition.\n\n*The True Formula* states: When the Dragon and Tiger unite in the *Li* trigram, it is called \"gathering the medicine.\" When the time arrives at the *Qian* trigram, qi and fluid prepare to return to their origin, generating above the bladder, below the spleen and stomach, before the kidneys, behind the navel, to the left of the liver, to the right of the lungs, to the right of the small intestine, and to the left of the large intestine. At this moment, spleen qi flourishes and lung qi thrives, while heart qi ceases and liver qi weakens. True qi, originally united with yang qi, now finds yang qi diminished and has nothing to cling to—practice at this time is laborious, yet the gathering and union must occur precisely then.\n\nWith spirit and awareness inwardly guarded, the breath flows gently through the nose. The abdomen subtly presses against the navel and kidneys; when the heat becomes too intense, slightly relax the pressure, gently restraining the navel. Before heat arises, tighten the restraint; as warmth grows, maintain steady pressure, allowing the mind to roam freely until it fills the cosmos—this is called \"restraining the Yang Gate to refine the elixir.\" Thus, qi does not ascend but unites with true water, passing through the spleen palace and, with each breath, circulating into the life palace of the Yellow Court. As qi and fluid transform, they first become essence, then pearl, then mercury, then cinnabar, and finally gold—this is called the Golden Elixir. Its achievement is no small matter.\n\n*The Essentials of the Dao* states: Gathering the medicine relies on the Jade Hare—heart qi is the medicine, and kidney water is the Jade Hare. Union must be facilitated by the Yellow Matron. When they meet in Yongzhou, the *Qian* trigram, perform a melody of the Yang Song. This practice aligns with daily cultivation for gathering the medicine.\n\nFor those seeking to restore vitality in later years, apply the method of \"one supplement for every ten depletions\"—this is called \"refining mercury to supplement the cinnabar field.\" Once the supplement’s measure is fulfilled, cease daily practice.\n\nGather the medicine in the *Li* trigram and refine it in the *Qian* trigram, restraining the Yang Gate. In spring and winter, gather more and refine less—*Qian* requires one part effort, while *Li* demands twice as much. In autumn and summer, gather less and refine more—*Li* requires one part effort, while *Qian* demands twice as much. Adjust gathering and refining according to the seasonal flourishing of qi. With practice, results will manifest, extending years and abiding in the world as a Human Immortal.\n\nIf, after fulfilling the supplement’s measure, results are evident, advance with care and discipline. After one hundred days of gathering the medicine, its potency is complete. After two hundred days, the sacred embryo solidifies. After three hundred days, true qi is born, and the embryonic immortal is perfected.\n\nOnce the medicine’s potency is complete, advance the fire by increasing the measure—this is called \"fire timing.\" After the sacred embryo solidifies, increase the fire timing to the measure of the Small Celestial Cycle. When the embryo is rounded and true qi is born, advance the fire timing—this is called the \"Celestial Cycle fire timing.\"\n\nOnly by gathering the medicine through the union of Dragon and Tiger, and refining it by advancing the fire, does one enter the Dao. One must retreat to seclusion, focusing the mind on inner observation, so that inner visions do not leak out and outer distractions do not intrude—like a woman nurturing a fetus or a dragon tending its pearl. Even in eating, sleeping, speaking, or silence, one must move like an infant or a maiden in her chamber, ever cautious of loss or harm, never allowing the heart to stray from the Dao for even a moment.\n\nA Commentary states: The medicine is the true qi within the heart; the hare is the true water within the kidneys; the Yellow Matron is the fluid within the spleen. They harmonize qi and water, entering the Yellow Court. Yongzhou is the *Qian* trigram, where one restrains the flanks and abdomen—also called restraining the Yang Gate.\n\nHere concludes the four gates of the lesser vehicle, leading to Human Immortality. *Secret Transmission of the Orthodox Yang Immortal’s Numinous Treasure Complete Methods*, Volume One.",
      "overlap_context": "*li* palace, and the great yang is the true yang. Within the person, the heart is the *li* palace, and original yang is the true Dragon; the true Tiger is the water within the kidneys. The true Dragon is the qi within heart fluid; the mouth is the Jade Pool, and saliva is the spring water.\n\n**The Fourth: Refining the Elixir**\n\nThe *Jingao* says: Heaven and Earth are the forms of the great Dao. Yin and yang are the Dao of Heaven and Earth. Cold, heat, warmth, and coolness—within form there is qi.",
      "start_char": 4796,
      "end_char": 5954,
      "start_sentence": 224,
      "end_sentence": 279,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.078938007354736,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\秘传正阳真人灵宝毕法.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "秘传正阳真人灵宝毕法卷中 正阳真人锺离权云房着纯阳真人吕岩洞宾传 中乘长生不死法三门 肘后飞金晶第五 《金诰》曰：阴阳升降，不出天地之内。 日月运转，而在天地之外。 东西出没，以分昼夜。 南北往来，以定寒暑。 昼夜不息，积日为月，魄也。 岁之积月者，以其律中起吕，吕中起律也。 日月运行，以合天地之机，不离乾坤之数。 万物生成虽在於阴阳，而造化亦资於日月。 《真原》曰：天地之形，其状如卵。 六合於中，其圆如球。 日月出没，运行一天之上，一地之下。 上下东西，周行如飞轮。 东生西没，日行阳道。 西生东没，月行阴道。 一日之间而分昼夜。 冬至之后，日出自南而北。 夏至之后，日出自北而南。 冬之夜乃夏之日，夏之夜乃冬之日。 一年之间而定寒暑。 日月之状，方圆八百四十里。 四尺为一步，三百六十步为一里。 凡八刻二十分为一时，十二时为一日。 一月者，三十日，共三百六十时，计三千刻、一十八万分也。 且以阳行乾，其数用九。 阴行坤，其数用六。 魄中魂生，本自旦日。 盖其九不对六，故三日后月魄生魂。 凡一昼夜、一百刻、六千分，魂於魄中一进七十里。 六昼夜共进四百二十里，魄中魂半，乃曰上弦。 又六昼夜进四百二十里，通前共八百四十里，魄中魂全而阳满阴位，乃曰月望。 自十六日为始，魂中生魄，凡六昼夜共进四百二十里，而魂中魄半，乃曰下弦。 又六昼夜进四百二十里，通前共进八百四十里，而魂中魄全。 月中尚有余光者，盖六不尽九，故三日后月魄满宫，乃曰月晦。 月旦之后，六中起九。 月晦之前，九中起六。 数有未尽，而生后有期。 积日为月，积月为岁。 一岁以月言之，六律、六吕，以六起数，数尽六位。 六六三十六，阴之成数也，以日言之，五日一候，七十二候，八九之数。 至重九，以九起数，数尽六位。 六九五十四者，阳之成数也。 一六，一九，合而十五。 十五，气之数。 二十四气当八节之用，而见阴阳升降之宜。 一六、一九，以四为用，变为阳数二百一十六，阴之数一百四十四，计三百六十之数而足满周天。 比喻曰：阴阳升降在天地之内，比心肾、气液交合之法。 日月运转在天地之外，比肘后飞金精之事也。 日月交，比进火之法加减。 阳升阴降，无异於日月之魂魄。 日往月来，无异於心肾之气液。 冬至之后，日出乙位，日没庚位，昼四十刻，自南而北。 冬至之后，凡九日，东生西没，共进六十分至春分。 昼夜停停，而夏至为期，昼六十刻，日出甲位，日没辛位。 夏至之后，凡九日，自北而南，东生西没，共退六十分至秋分。 昼夜停停，而冬至为期，昼四十刻。 准前后，进自南而北，其数用九也。 月旦之后，三日魂生，魂生於魄。 六日两停，又六日魂全，其数用六也。 岁之夏至，月之十六日，乃日用离卦之法，乃人之午时也。 岁之冬至，月之旦，乃日用坎卦之法，乃人之子时也。 天地阴阳升降之宜、日月魂魄往来之理，尚以数推之，交合有序，运转无差，人之心肾气液、肝肺魂魄，日用虽有节次，年月岂无加减乎。 《真诀》曰：坎卦阳生，当正子时，非始非终，艮卦肾气交肝气。 未交之前，静室中披衣握固，正坐盘膝，蹲下腹肚，须臾升身前出胸，而微偃头於后。",
      "translated_text": "**Secret Transmission of the Orthodox Yang Immortal’s Numinous Treasure Complete Methods, Volume Two**\n\n**Zhongli Quan of the Orthodox Yang Immortal** states; **Lü Yan, the Pure Yang Immortal of the Grotto Guest**, transmits:\n\n**Three Gates of the Middle Vehicle for Long Life and Deathlessness**\n\n**Fifth: Flying Gold Essence Behind the Elbow**\n\nThe *Golden Proclamation* states: Yin and Yang ascend and descend, never beyond the bounds of Heaven and Earth. The sun and moon revolve, yet move outside Heaven and Earth. Their rising and setting in the east and west divide day and night; their coming and going in the south and north determine cold and heat. Unceasing day and night accumulate into months—this is the lunar phase. The accumulation of months into a year follows the principle of *lü* arising from *lü* and *lü* arising from *lü*. The sun and moon’s movements align with the mechanism of Heaven and Earth, never departing from the numbers of *Qian* and *Kun*. Though the generation of the myriad things depends on Yin and Yang, their transformation also relies on the sun and moon.\n\nThe *True Origin* states: The form of Heaven and Earth resembles an egg. The Six Harmonies within are round as a sphere. The sun and moon rise and set, revolving above one Heaven and below one Earth. Above and below, east and west, they circle like a flying wheel. The sun rises in the east and sets in the west, traveling the Yang path; the moon rises in the west and sets in the east, traveling the Yin path. Within a single day, they divide day and night. After the winter solstice, the sun rises from the south and moves north. After the summer solstice, the sun rises from the north and moves south. Winter’s night is summer’s day; summer’s night is winter’s day. Within a year, they determine cold and heat. The sun and moon each measure eight hundred and forty *li* in circumference. Four *chi* make one *bu*, and three hundred and sixty *bu* make one *li*. Eight *ke* and twenty *fen* make one *shi*, and twelve *shi* make one day. One month consists of thirty days, totaling three hundred and sixty *shi*, amounting to three thousand *ke* and one hundred and eighty thousand *fen*.\n\nNow, Yang moves through *Qian*, its number being nine. Yin moves through *Kun*, its number being six. The spirit (*hun*) is born within the lunar phase (*po*), originating from the dawn sun. Since nine does not pair with six, three days later, the lunar phase gives birth to the spirit. In one day and night—one hundred *ke* and six thousand *fen*—the spirit advances seventy *li* within the lunar phase. Over six days and nights, it advances four hundred and twenty *li*, reaching half within the lunar phase—this is called the first quarter. After another six days and nights, advancing another four hundred and twenty *li*, totaling eight hundred and forty *li*, the spirit fully occupies the lunar phase, and Yang fills the Yin position—this is called the full moon.\n\nBeginning on the sixteenth day, the spirit generates the lunar phase. Over six days and nights, advancing four hundred and twenty *li*, the lunar phase reaches half within the spirit—this is called the last quarter. After another six days and nights, advancing another four hundred and twenty *li*, totaling eight hundred and forty *li*, the lunar phase fully occupies the spirit. The remaining light in the moon exists because six does not exhaust nine; thus, three days later, the lunar phase fills the palace—this is called the dark moon.\n\nAfter the new moon, nine arises from six. Before the dark moon, six arises from nine. Though the numbers are not yet exhausted, the next cycle begins in due course. Days accumulate into months, and months into years. Speaking of a year in terms of months, the six *lü* and six *lü* begin with six, exhausting the six positions. Six sixes make thirty-six—the completion number of Yin. Speaking of a year in terms of days, five days make one *hou*, and seventy-two *hou* make the number eight nines. Reaching the double nine, the number begins with nine, exhausting the six positions. Six nines make fifty-four—the completion number of Yang. One six and one nine together make fifteen. Fifteen is the number of *qi*. The twenty-four *qi* correspond to the eight nodes, revealing the proper ascent and descent of Yin and Yang. One six and one nine, when applied fourfold, transform into the Yang number two hundred and sixteen and the Yin number one hundred and forty-four, totaling three hundred and sixty to complete the celestial cycle.\n\nBy analogy: The ascent and descent of Yin and Yang within Heaven and Earth resemble the method of harmonizing the heart and kidneys, *qi* and fluids. The revolution of the sun and moon outside Heaven and Earth resembles the practice of flying gold essence behind the elbow. The union of the sun and moon resembles the method of advancing and reducing fire. The ascent of Yang and descent of Yin are no different from the spirit and lunar phase of the sun and moon. The sun’s departure and moon’s arrival are no different from the *qi* and fluids of the heart and kidneys.\n\nAfter the winter solstice, the sun rises in the *yi* position and sets in the *geng* position, with forty *ke* of daylight, moving from south to north. After the winter solstice, over nine days, the sun rises in the east and sets in the west, advancing sixty *fen* to the spring equinox. Day and night balance, with the summer solstice as the term, when daylight reaches sixty *ke*, the sun rises in the *jia* position and sets in the *xin* position. After the summer solstice, over nine days, the sun moves from north to south, rising in the east and setting in the west, retreating sixty *fen* to the autumn equinox. Day and night balance, with the winter solstice as the term, when daylight returns to forty *ke*. Following the previous pattern, advancing from south to north, the number uses nine.\n\nAfter the new moon, on the third day, the spirit is born, arising from the lunar phase. On the sixth day, they balance; after another six days, the spirit is complete—the number uses six. At the summer solstice of the year and the sixteenth day of the month, one employs the method of the *Li* trigram—this is the *wu* hour for humans. At the winter solstice of the year and the new moon, one employs the method of the *Kan* trigram—this is the *zi* hour for humans. Though the proper ascent and descent of Yin and Yang in Heaven and Earth and the principles of the sun and moon’s spirit and lunar phase follow numerical order, their union is sequential and their revolution without error. How could the *qi* and fluids of the human heart and kidneys, the spirit and lunar phase of the liver and lungs, though following a daily rhythm, not require adjustment over months and years?\n\nThe *True Formula* states: When Yang is born in the *Kan* trigram, it corresponds to the true *zi* hour—neither beginning nor end. The *Gen* trigram governs the *qi* of the kidneys harmonizing with the *qi* of the liver. Before the union, in a quiet chamber, don robe and clasp hands, sit upright with crossed legs, tuck in the abdomen, and after a moment, raise the body forward, chest out, and slightly tilt the head back.",
      "overlap_context": ": The medicine is the true qi within the heart; the hare is the true water within the kidneys; the Yellow Matron is the fluid within the spleen. They harmonize qi and water, entering the Yellow Court. Yongzhou is the *Qian* trigram, where one restrains the flanks and abdomen—also called restraining the Yang Gate.\n\nHere concludes the four gates of the lesser vehicle, leading to Human Immortality. *Secret Transmission of the Orthodox Yang Immortal’s Numinous Treasure Complete Methods*, Volume One.",
      "start_char": 5954,
      "end_char": 7195,
      "start_sentence": 280,
      "end_sentence": 346,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.37963676452637,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\秘传正阳真人灵宝毕法.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "后闭夹脊双关，肘后微扇一二伸腰，自尾闾穴如火相似，自腰而起，拥在夹脊，慎勿开关，即时甚热气壮，渐次开夹脊关，而放气过关。 仍仰面，脑后紧偃，以闭上关，慎勿开之，即觉热极气壮，渐次入顶，以补泥丸髓海。 须身耐寒暑，方为长生之基。 次用还丹之法如是前件，出胸伸腰，闭夹脊，蹲而升之腰间。 火不起，当静坐内观，如法再作，以至火起为度。 自丑行之，至寅终而可止。 乃曰肘后飞金晶，又曰抽铅，使肾气生肝气也。 且人身脊骨二十四节，自下而上三节，为内肾相对。 自上而下三节，名曰天柱。 天柱之上名曰玉京，玉京之下，内肾相对尾闾穴之上，共十八节，其中曰双关，上九、下九。 当定一百日，遍通十八节而入泥丸。 必於正一阳时坎卦行持，乃曰肘后飞金晶。 离卦采药，乾卦进火烧药，勒阳关始一百日，飞金晶入脑。 一百日药力全。 三关一撞，直入上宫泥丸。 自坎卦为始，至艮卦方止。 自离卦采药，更无肾气相合，而肝气自生心气，二气纯阳，二八阴消，熏蒸於肺，而得肺液下降，包含真气，日得黍米之大而入黄庭，方曰内丹之材。 百日无差药力全。 凡离卦采药，用法依时，内观转加精细。 若乾卦进火、勒阳关，自兑卦为始，终在乾卦。 如此又一百日之后，肘后飞金晶，自坎坐至震卦方止。 离卦采药之时，法如旧，以配自坤至乾卦行持，即是三百日无差，圣胎自坚。 三百日圣胎自坚。 勒阳关法自坤卦为始，而坐至乾卦方止。 如此又一百日足，泥丸充实，返老还童，不类常人。 采药就胎仙完而真气生，形若弹圆，色同朱橘，永镇丹田，而作陆地神仙。 三百日后，行持至离卦罢采药，坤卦罢勒阳关，即行玉液还丹之道。 故自冬至后方曰行功，三百日胎完气足，而内丹就、真气生。 凡行此法，方为五行颠倒，三田返覆。 未行功以前，先要匹配阴阳，使气液相生，见验方止。 次要聚散水火，使根源牢固而气行液注，见验方止。 次交姤龙虎烧炼丹药，使采补还丹而煅炼铅汞，见验方止。 十损一补之数足，而气液相生，见验方止。 上项行持乃小乘之法，自可延年益寿。 若以补完坚固，见验方止，方可年中择月，冬至之节。 月中择日，甲子之日。 日中择时，坎、离、乾卦三时为始。 一百日自坎至艮，自兑至乾。 二百日后，自坎至震，自坤至乾。 凡此下功，必於幽室静宅之中，以远妇人女子，使鸡犬不闻声，臭秽不入鼻，五味不入口，以绝七情六欲。 饮食多少，寒热有度。 虽寤寐之间，而意恐损失。 行功不勤，难成於道。 如是三百日，看应验如何。 《道要》曰：日月并行复卦，子时蹲升数日开关，贪向杨州聚会，离卦交姤六宫火满金田。 乾宫。 解曰：日月并行复卦者，一阳生时，在日为子时，在年为冬至也。 所谓择月择日时也。 蹲升已在前法。 说数日，是定一百日。 开关是先开中关，次开上关。 贪向杨州聚会者，在人为心，在日为午时，在卦为离。 聚会者，真阴、真阳交姤，故曰采药。 乾为六宫，火是气也。 勒阳关而众气，以肺为金而下臀之下田，故曰火满金田，乃乾卦行勒阳关，聚火下田矣。 终南路上逢山，升身频过三关，贪向杨州聚会，争如少女烧天。 解曰：终南者，圣人隐意在中男也，中男即坎卦。",
      "translated_text": "Then close the double gates of the *Jiaji* behind the spine, gently fan the elbows backward once or twice, and stretch the waist. From the *Weilü* point, a fire-like sensation arises, ascending from the waist to gather at the *Jiaji*. Take care not to open the gates—immediately, the heat intensifies and the *qi* swells. Gradually open the *Jiaji* gates to release the *qi* past the barrier.\n\nStill facing upward, tilt the head firmly back to close the upper gate. Guard against opening it, and soon the heat peaks and the *qi* surges, ascending into the crown to replenish the *Niwan* and the Sea of Marrow. Only when the body withstands cold and heat is this the foundation of longevity.\n\nNext, employ the method of *Huandan*: proceed as before—extend the chest, stretch the waist, close the *Jiaji*, and crouch to raise the *qi* through the waist. If the fire does not rise, sit in stillness and inwardly observe; repeat the method until the fire ignites. Begin at the *chou* hour and continue until the end of *yin*. This is called *\"Flying Golden Essence behind the Elbow\"* or *\"Drawing Lead\"*, whereby kidney *qi* generates liver *qi*.\n\nMoreover, the human spine has twenty-four vertebrae. The three lowest, from the bottom upward, correspond to the inner kidneys. The three highest, from the top downward, are called the *Heavenly Pillar*. Above the *Heavenly Pillar* lies the *Jade Capital*. Below the *Jade Capital* and above the *Weilü* point, where the inner kidneys align, are eighteen vertebrae—nine above and nine below—collectively called the *Double Gates*. After one hundred days of practice, the *qi* traverses all eighteen and enters the *Niwan*.\n\nThis must be performed during the *Kan* trigram’s true Yang hour. This is *\"Flying Golden Essence behind the Elbow\"*. The *Li* trigram governs the gathering of the elixir, the *Qian* trigram the stoking of the fire to refine it. After restraining the *Yang* gate for one hundred days, the *Golden Essence* flies into the brain. At one hundred days, the elixir’s power is complete. With a single thrust through the three gates, it ascends directly into the upper palace of *Niwan*.\n\nBegin with the *Kan* trigram and conclude with the *Gen* trigram. When gathering the elixir under the *Li* trigram, no kidney *qi* unites with it; instead, liver *qi* naturally generates heart *qi*. The two *qi* become purely Yang, dissolving the eight Yin. Steaming the lungs, the lung fluid descends, enveloping the true *qi*. Daily, a grain of millet’s worth enters the *Yellow Court*—only then is it the material for the inner elixir. After one hundred days without error, the elixir’s power is complete.\n\nWhen gathering the elixir under the *Li* trigram, follow the method precisely, inwardly observing with ever-greater refinement. For stoking the fire and restraining the *Yang* gate under the *Qian* trigram, begin with the *Dui* trigram and conclude with the *Qian* trigram. After another hundred days, *\"Flying Golden Essence behind the Elbow\"* proceeds from the *Kan* trigram to the *Zhen* trigram. When gathering the elixir under the *Li* trigram, the method remains unchanged, aligning with practice from the *Kun* to the *Qian* trigram. After three hundred days without error, the sacred embryo naturally solidifies. At three hundred days, the sacred embryo is firm.\n\nThe method of restraining the *Yang* gate begins with the *Kun* trigram and concludes with the *Qian* trigram. After another hundred days, the *Niwan* is fully replenished, and one reverts from old age to youth, no longer resembling ordinary people. The elixir is gathered, the embryo perfected, and true *qi* is born—round as a pellet, red as a tangerine—permanently settled in the *Dantian*, making one an immortal upon the earth.\n\nAfter three hundred days, cease gathering the elixir under the *Li* trigram and restraining the *Yang* gate under the *Kun* trigram, then practice the *Jade Fluid Returning Elixir* method. Thus, only after the winter solstice does one begin the practice. After three hundred days, the embryo is complete, the *qi* is full, the inner elixir is achieved, and true *qi* is born. Only then is this the reversal of the Five Phases and the inversion of the Three Fields.\n\nBefore beginning the practice, first harmonize Yin and Yang to ensure *qi* and fluids generate one another, ceasing only when verification appears. Next, gather and disperse water and fire to solidify the root and ensure *qi* flows and fluids infuse, ceasing only when verification appears. Then unite the *Gou* Dragon and Tiger to refine the elixir, gathering and supplementing the returning elixir while forging lead and mercury, ceasing only when verification appears. When the count of *\"Ten Losses and One Gain\"* is complete and *qi* and fluids generate one another, cease only when verification appears.\n\nThe above practice is a lesser vehicle method, sufficient for prolonging life and extending years. Only after supplementation is complete and firmness verified may one select a month—specifically the winter solstice—and within that month, a day—specifically the *jiazi* day—and within that day, an hour—specifically the hours of the *Kan*, *Li*, and *Qian* trigrams—to begin.\n\nFor the first hundred days, proceed from *Kan* to *Gen* and from *Dui* to *Qian*. After two hundred days, proceed from *Kan* to *Zhen* and from *Kun* to *Qian*. For all such practice, one must be in a secluded chamber within a tranquil dwelling, far from women and girls, ensuring no sound of chickens or dogs reaches the ears, no foul odors enter the nose, no flavors pass the lips, and the seven emotions and six desires are extinguished. Regulate the quantity of food and drink, and maintain moderation in cold and heat. Even in waking and sleeping, guard against loss or damage. If practice is not diligent, the Dao will be difficult to achieve. After three hundred days, observe the results.\n\nThe *Dao Essentials* states: *\"Sun and moon move together in the *Fu* trigram; at the *zi* hour, crouch and ascend for several days to open the gates. Greedily hasten to Yangzhou for the gathering; under the *Li* trigram, unite the *Gou*, and the six palaces’ fire fills the Golden Field of *Qian*.*\nExplanation: *\"Sun and moon move together in the *Fu* trigram\"* refers to the time when a single Yang is born—in the day, the *zi* hour; in the year, the winter solstice. This is the selection of month, day, and hour. *\"Crouch and ascend\"* was described in the previous method. *\"Several days\"* means a fixed hundred days. *\"Opening the gates\"* means first opening the middle gate, then the upper gate. *\"Greedily hasten to Yangzhou for the gathering\"*—in the body, this is the heart; in the day, the *wu* hour; in the trigram, *Li*. *\"Gathering\"* means the union of true Yin and true Yang, hence *\"gathering the elixir\"*. *Qian* is the six palaces; *\"fire\"* is *qi*. Restraining the *Yang* gate gathers the *qi*, and as the lungs are metal, the *qi* descends to the lower field below the buttocks—thus *\"fire fills the Golden Field\"*, meaning the *Qian* trigram’s restraint of the *Yang* gate gathers fire in the lower field.\n\n*\"On the road to Zhongnan, mountains are encountered; frequently ascend past the three gates, greedily hastening to Yangzhou for the gathering—how could it compare to the maiden burning the heavens?\"*\nExplanation: *\"Zhongnan\"* implies the sage’s hidden meaning in the *Middle Son*—the *Middle Son* is the *Kan* trigram.",
      "overlap_context": "gh following a daily rhythm, not require adjustment over months and years?\n\nThe *True Formula* states: When Yang is born in the *Kan* trigram, it corresponds to the true *zi* hour—neither beginning nor end. The *Gen* trigram governs the *qi* of the kidneys harmonizing with the *qi* of the liver. Before the union, in a quiet chamber, don robe and clasp hands, sit upright with crossed legs, tuck in the abdomen, and after a moment, raise the body forward, chest out, and slightly tilt the head back.",
      "start_char": 7195,
      "end_char": 8424,
      "start_sentence": 347,
      "end_sentence": 403,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.73190093040466,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\秘传正阳真人灵宝毕法.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "艮为山，山是艮卦飞金晶，至巽卦方入第二百日。 下功之时，升身频过三关。 贪向杨州聚会，说已在前。 争如少女烧天者，少女是兑卦也。 勒阳关至乾卦而方止也。 兖州行到徐州，起来走损车牛，为恋九州欢会，西南火入雍州。 解曰：兖州，艮卦。 徐州，巽卦。 自艮卦飞金晶，至巽卦方止也。 起来走损车牛，车为阳，牛为阴，是夹脊一气飞入泥九也。 九州在人为心，在日为午时，与前采药同也。 西南，坤卦也。 雍州，乾卦也。 勒阳自坤至乾方止，第三百日下功之时也。 此是日用事，乃曰三元用法。 飞金晶入脑，下田返上田。 采药下田，返中田烧药，进火中田返下田，乃曰三元用事。 中乘之法，已是地仙，见验方止。 始觉梦寐多有惊悸，四肢六腑有疾不疗自愈。 闭目暗室中，圆光如盖，周匝围身。 金关玉锁封固坚牢，绝梦泄遗漏。 雷鸣一声，关节气通。 梦寐若抱婴儿归，或若飞腾自在。 八邪之气不能入，心境自除以绝欲，内观则朗而不昧，昼则神采清秀，夜则丹田自暖。 上件皆是得药之验，验既正，当谨节用功，以前法加添，三百日胎仙圆胎。 圆之后，方用后功。 玉液还丹第六 《玉书》曰：真阴、真阳，相生相成。 见於上者，积阳成神。 神中有形，而丽乎天者，日月也。 见於下者，积阴成形。 形中有神，而丽乎地者，金玉也。 金玉之质，隐於山川，秀媚之气浮於上，而日月交光。 草木受之，以为祯祥。 鸟兽得之，以为异类耳。 《真原》曰：阳升到天，太极生阴，阴不足而阳有余，所以积阳生神。 阴降到地，太极生阳，阳不足而阴有余，所以积阴生形。 上之日月，下之金玉，真阳有神，真阴有形。 其气相交而上下相射，光盈天地，则金玉可贵者，良以此也。 是知金玉之气凝於空，则为瑞气祥烟。 入於地则变醴泉、芝草。 人民受之而为英杰，鸟兽得之而生奇异。 盖金玉之质虽产於积阴之形，而中抱真阳之气，又感积阳成神之日月，真阴、真阳之下射而宝凝矣。 比喻曰：积阴成形而内抱真阳以为金玉，比於积药而抱真气以为胎仙也。 金玉之气入於地而为醴泉、芝草者，比於玉液还丹田也。 金玉之气凝於空而为瑞气、祥烟者，比於气炼形也。 凡金玉之气冲於天，随阳升而起。 凡金玉之气入於地，随阴降而还。 既随阴阳升降，自有四时可以液还丹田。 气炼形质，而於四时加减一日改移也。 《真诀》曰：采补见验，年中择月，月中择日，日中择时。 三时用事，一百日药力全，二百日圣胎坚，三百日真气生，胎仙圆。 谨节用功，加添依时，三百日数足之后，方行还丹炼形之法。 凡用艮卦飞金晶入脑，止於巽卦而已，此言毕金晶三百日后也。 离罢采。 离卦罢采药，坤卦罢勒阳关。 只此兑卦下手勒阳关，至乾方止。 既罢离卦，添入咽法炼形。 咽法者，以舌搅上腭两颊之间，先咽了恶浊之津，次退舌尖，以满玉池，津生不漱而咽。 凡春三月，肝气旺而脾气弱，咽法日用离卦。 凡夏三月，心气旺而肺气弱，咽法日用巽卦。 以舌满上下，而玉池双收两颊虚咽为法。 凡秋三月，肺气旺而肝气弱，咽法日用艮卦。 凡冬三月，肾气旺而心气弱，咽法日用震卦。 飞金晶法，咽亦不妨。 凡四季之月，脾气旺而肾气弱，人以肾气为根源，四时皆有衰弱。",
      "translated_text": "*Gen* is the mountain; the mountain is the *Gen* trigram’s flying golden essence, which enters the *Xun* trigram only after two hundred days. When practicing the downward work, frequently ascend past the three gates. The greed for gathering in Yangzhou has already been discussed. How could it compare to the maiden burning the heavens? The maiden is the *Dui* trigram. Restraining the *Yang* gate continues until the *Qian* trigram, where it finally ceases.\n\nFrom Yanzhou to Xuzhou, rising to walk harms the cart and ox—yet for the sake of the Nine Provinces’ joyous gathering, fire from the southwest enters Yongzhou.\n\n**Explanation:** Yanzhou is the *Gen* trigram; Xuzhou is the *Xun* trigram. The flying golden essence departs from *Gen* and only ceases at *Xun*. \"Rising to walk harms the cart and ox\"—the cart is *Yang*, the ox is *Yin*, signifying the single *qi* of the spine’s *Jiaji* flying into the *Niwan* palace. The Nine Provinces in the body are the heart; in the day, the *wu* hour—identical to the earlier gathering of the elixir. The southwest is the *Kun* trigram; Yongzhou is the *Qian* trigram. Restraining *Yang* from *Kun* to *Qian* ceases only after three hundred days of practice. This is the daily work, called the \"Three Primes’ application.\"\n\nThe flying golden essence enters the brain, returning the lower field to the upper field. Gathering the elixir in the lower field returns it to the middle field to refine the medicine; advancing the fire from the middle field returns it to the lower field—this is called the \"Three Primes’ work.\" The method of the Middle Vehicle is already that of an earthly immortal, and one ceases only upon seeing verification. At first, one may notice frequent startling dreams and palpitations, while the four limbs and six viscera’s ailments heal without treatment. In a dark room with eyes closed, a radiant light like a canopy encircles the body. The Golden Gate and Jade Lock seal firmly, preventing dream emissions or leaks. With a thunderous roar, the joints’ *qi* flows freely. In dreams, one may embrace an infant and return, or soar freely at will. The eight perverse *qi* cannot enter; the heart’s realm is naturally cleansed of desire. Inward contemplation is bright and unobscured; by day, the spirit’s countenance is clear and refined; by night, the cinnabar field is naturally warm. All these are verifications of obtaining the elixir. Once verified as correct, one must diligently regulate practice, augmenting with the previous method. After three hundred days, the fetal immortal’s gestation is complete. Only after its completion does one proceed to the subsequent work.\n\n**The Sixth: Jade Fluid Returning Elixir**\n*The Jade Book* states: True Yin and true Yang mutually engender and complete one another. That which appears above is accumulated *Yang* forming spirit. Within spirit lies form, clinging to heaven—these are the sun and moon. That which appears below is accumulated *Yin* forming shape. Within shape lies spirit, clinging to earth—these are gold and jade. The essence of gold and jade hides within mountains and rivers; their refined and radiant *qi* floats above, where the sun and moon exchange light. Plants and trees receive it, becoming auspicious omens; birds and beasts obtain it, becoming extraordinary species.\n\n*The True Origin* states: When *Yang* ascends to heaven, the Supreme Ultimate generates *Yin*; *Yin* is insufficient while *Yang* is surplus, hence accumulated *Yang* generates spirit. When *Yin* descends to earth, the Supreme Ultimate generates *Yang*; *Yang* is insufficient while *Yin* is surplus, hence accumulated *Yin* generates shape. Above, the sun and moon; below, gold and jade—true *Yang* possesses spirit, true *Yin* possesses shape. Their *qi* intermingles, shooting upward and downward, filling heaven and earth with light. Thus, gold and jade are precious—truly for this reason. Know then that when the *qi* of gold and jade congeals in the void, it becomes auspicious mist and propitious vapor. When it enters the earth, it transforms into sweet springs and lingzhi mushrooms. People who receive it become heroes; birds and beasts who obtain it generate marvels. Though the essence of gold and jade is born from accumulated *Yin*’s shape, it embraces the *qi* of true *Yang*, further influenced by the sun and moon formed from accumulated *Yang* becoming spirit. The downward projection of true *Yin* and true *Yang* causes treasure to congeal.\n\n**Analogy:** Accumulated *Yin* forms shape yet internally embraces true *Yang* to become gold and jade—comparable to accumulating the elixir and embracing true *qi* to become a fetal immortal. The *qi* of gold and jade entering the earth to become sweet springs and lingzhi mushrooms is like the jade fluid returning to the cinnabar field. The *qi* of gold and jade congealing in the void to become auspicious mist and propitious vapor is like refining form with *qi*. Whenever the *qi* of gold and jade surges into heaven, it rises with *Yang*. Whenever it enters the earth, it descends with *Yin*. Since it follows *Yin* and *Yang* in ascent and descent, there are four seasons in which the fluid can return to the cinnabar field. Refining form with *qi* adjusts by adding or subtracting a day according to the four seasons.\n\n*The True Formula* states: Upon verifying the effects of gathering and supplementing, choose the month within the year, the day within the month, and the hour within the day. Apply the Three Primes’ work: after one hundred days, the elixir’s power is complete; after two hundred days, the sacred fetus is firm; after three hundred days, true *qi* is born, and the fetal immortal is perfected. Diligently regulate practice, augmenting in accordance with the seasons. Only after completing the three hundred days does one proceed with the method of returning the elixir and refining form.\n\nThe method of flying golden essence from the *Gen* trigram into the brain ceases at the *Xun* trigram—this refers to the completion of the golden essence after three hundred days. *Li* ceases gathering. The *Li* trigram stops gathering the elixir; the *Kun* trigram stops restraining the *Yang* gate. Only the *Dui* trigram begins restraining the *Yang* gate, continuing until *Qian*. Having ceased the *Li* trigram, add the swallowing method to refine form.\n\nThe swallowing method: stir the tongue between the upper palate and cheeks, first swallowing the foul and turbid saliva, then retracting the tongue’s tip to fill the Jade Pool. Saliva is generated without rinsing and is swallowed. In the three months of spring, when liver *qi* is flourishing and spleen *qi* is weak, apply the swallowing method daily using the *Li* trigram. In the three months of summer, when heart *qi* is flourishing and lung *qi* is weak, apply the swallowing method daily using the *Xun* trigram, filling the upper and lower tongue to the Jade Pool, swallowing the emptiness of both cheeks as the method. In the three months of autumn, when lung *qi* is flourishing and liver *qi* is weak, apply the swallowing method daily using the *Gen* trigram. In the three months of winter, when kidney *qi* is flourishing and heart *qi* is weak, apply the swallowing method daily using the *Zhen* trigram. The method of flying golden essence does not hinder swallowing.\n\nIn the months of the four seasons, when spleen *qi* is flourishing and kidney *qi* is weak, as people regard kidney *qi* as their root, it is weak in all four seasons.",
      "overlap_context": "qi* descends to the lower field below the buttocks—thus *\"fire fills the Golden Field\"*, meaning the *Qian* trigram’s restraint of the *Yang* gate gathers fire in the lower field.\n\n*\"On the road to Zhongnan, mountains are encountered; frequently ascend past the three gates, greedily hastening to Yangzhou for the gathering—how could it compare to the maiden burning the heavens?\"*\nExplanation: *\"Zhongnan\"* implies the sage’s hidden meaning in the *Middle Son*—the *Middle Son* is the *Kan* trigram.",
      "start_char": 8424,
      "end_char": 9665,
      "start_sentence": 404,
      "end_sentence": 469,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.113234519958496,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\秘传正阳真人灵宝毕法.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "每四时季月之后十八日，咽法日用兑卦，仍与前咽法者并用之。 独於秋季，止用兑卦咽法，而罢艮卦之功。 凡以咽法，先依前法而咽之。 如牙齿玉池之间而津不生，但以舌满上下而闭玉池收两颊，以虚咽而为法止咽气，气中自有水也。 咽气如一年三十六次至四十九次。 为数，又次一年八十一次又一百八十一次。 为见验，乃玉液还丹之法。 行持不过三年，灌溉丹田，沐浴胎仙，而真气愈盛。 若不行此玉液还丹之法，而於三百日养就内丹，真气才生，艮卦飞金晶，一撞三关，上至泥丸，当行金液还丹之法。 自顶中前下金水一注，下还黄庭，变金成丹，名曰金丹。 行金液还丹，当於深密幽房，风、日凡人不到之处，烧香迭掌，盘膝坐，以体蹲而后升，才觉火起，正坐绝念忘情，内观的确艮卦飞金晶入顶，但略昂头偃项，放令颈下如火，方点头向前，低头曲项，退舌尖进后，以抵上腭，上有清冷之水，味若甘香，上彻顶门，下通百脉。 鼻中自闻一种真香，舌上亦有奇味，不漱而咽下，还黄庭，名曰金液还丹。 春、夏、秋、冬不拘时候，但於肘后飞金晶入脑之后，节次行此法，自艮至巽而已。 晚间勒阳关法，自兑至乾而已。 尺行此法谨节，胜及前方，可得成志意，止於炼形住世、长生不死而已，不能超脱也。 《道要》曰：识取五行根蒂，方知春夏秋冬，时饮琼浆数盏，醉归月殿遨游。 解曰：识取五行根蒂者，为到五行相生相克而用卦时不同，以行咽法，方知春夏秋冬改移有时侯也。 琼浆，玉液也。 月殿，是丹田。 醉，则咽多也。 东望扶桑未晓，后升前偃无休，骤马数游宇宙，长男只到杨州。 解曰：东望扶桑未晓者，日未出艮卦之时，后升飞金晶也。 前偃，玉液还丹。 骤马，起火玉液炼形也。 遨游宇宙，遍满四肢也。 长男，震卦。 只到杨州，离卦也。 玉液炼形，自震卦为始，至离卦方止也。 此采药三百日，数足胎圆，而飞金晶减一卦，勒阳关如旧。 罢采药，添入咽法。 咽法随四时而已，此系炼形法。 用卦候添入炼形，自震卦为始，离卦为期，不限年月日，见验方止。 身体光泽，神气秀媚，渐畏腥秽以冲己腹。 凡情、凡爱心境自除，真气将足而以常饱，所食不多而饮酒无量，尘骨巳更而变神识，步趋走马而行如飞，目如点漆，体若凝脂，绀发再生，皱脸重舒，老去永驻童颜，仰视百步而见秋毫，身体之间旧痕残靥自然消除，涕泪、涎、污亦不见有也。 圣丹生味，灵液透香，口鼻之间常有真香奇味，漱成凝酥，可以疗人疾病，遍体皆成白膏。 上件皆玉液还丹炼形之验也。 验既正，当谨节用功，依法随时而行后事。 金液还丹第七 《金诰》曰：积阳成神，神中有形，一生於日，日生於月。 积阴成形，形中有神，一生於金，金生於玉。 随阴阳而生没者，日月之光也。 因数生光，数本於乾坤。 随阴阳而升降者，金玉之气也。 因时起气，时本於天地。 《真原》曰：数行日月，数用六、九。 乾坤之数、金玉之气春夏上升，秋冬下降。 升降，天地之时。 金生於土，土生於石，石生於玉，见於成形而在下者如此。 日中金鸟，月中玉兔，日待月魄而光，见於成神而在上者如此。 比喻曰：日月比气也，肾气比月，而心气比日。",
      "translated_text": "In the eighteen days following each seasonal transition month, apply the swallowing method daily using the *Dui* trigram, continuing alongside the previous swallowing methods. Only during autumn, cease the *Gen* trigram’s practice and exclusively use the *Dui* trigram’s swallowing method.\n\nFor all swallowing methods, first follow the preceding method. If saliva does not arise between the teeth and the Jade Pool, simply fill the upper and lower tongue, close the Jade Pool, gather both cheeks, and swallow the emptiness as the method—only the *qi* is swallowed, for within *qi* there is naturally water. The swallowing of *qi* should number thirty-six to forty-nine times in one year, then eighty-one times in the next year, and one hundred eighty-one times thereafter. This is the method for verifying the return of Jade Liquid Elixir. Practicing this for no more than three years will irrigate the Cinnabar Field, bathe the Embryonic Immortal, and cause true *qi* to flourish ever more.\n\nIf one does not practice this Jade Liquid Return Elixir method but instead nurtures the Internal Elixir for three hundred days, true *qi* will only just begin to arise. Then, using the *Gen* trigram’s Flying Golden Essence, strike through the Three Passes to ascend to the Mud Pill Palace. At that point, one must practice the Golden Liquid Return Elixir method: from the crown’s center, let the golden water descend in a single stream to return to the Yellow Court, where it transforms into gold and congeals into the Elixir, called the Golden Elixir.\n\nWhen practicing the Golden Liquid Return Elixir, choose a secluded chamber where wind, sunlight, and ordinary people cannot reach. Burn incense, clasp the hands, sit cross-legged, and after settling the body, rise. As soon as the fire is felt, sit upright, extinguish all thoughts and emotions, and inwardly observe the *Gen* trigram’s Flying Golden Essence entering the crown. Slightly raise the head and tilt the neck back, allowing the fire to fill the throat. Then nod forward, lower the head, and curve the neck, retracting the tongue’s tip to press against the upper palate. There, cool and refreshing water will appear, its taste sweet and fragrant, ascending to the crown’s gate and circulating through the hundred meridians. A true fragrance will naturally arise in the nose, and an extraordinary flavor will linger on the tongue. Without rinsing, swallow it down to return to the Yellow Court—this is the Golden Liquid Return Elixir.\n\nRegardless of spring, summer, autumn, or winter, after the Flying Golden Essence enters the brain following the *hou* method, proceed step by step with this practice, moving from *Gen* to *Xun*. At night, apply the Yang Barrier Restraining method, progressing from *Dui* to *Qian*. If one meticulously follows this method, it surpasses the previous techniques, enabling the fulfillment of one’s will. However, this only refines the form to abide in the world and attain longevity without death—it does not achieve liberation.\n\nThe *Essentials of the Dao* states: \"Recognize the root and foundation of the Five Phases, and you will understand the seasons of spring, summer, autumn, and winter. Drink several cups of nectar, then wander drunkenly to the Moon Palace.\"\n\nThe explanation: \"Recognize the root and foundation of the Five Phases\" refers to understanding the mutual generation and restriction of the Five Phases, which necessitates different trigram applications for swallowing methods, thereby knowing the seasonal shifts of spring, summer, autumn, and winter. \"Nectar\" is Jade Liquid. \"Moon Palace\" is the Cinnabar Field. \"Drunk\" means swallowing abundantly.\n\n\"Gazing eastward at Fusang before dawn, rising behind and reclining ahead without rest, a galloping steed roams the cosmos, while the eldest son only reaches Yangzhou.\"\n\nThe explanation: \"Gazing eastward at Fusang before dawn\" refers to the time before sunrise, when the *Gen* trigram’s Flying Golden Essence rises. \"Reclining ahead\" is the Jade Liquid Return Elixir. \"Galloping steed\" is the firing of Jade Liquid to refine the form. \"Roaming the cosmos\" means filling the four limbs. \"Eldest son\" is the *Zhen* trigram. \"Only reaches Yangzhou\" is the *Li* trigram. Refining the form with Jade Liquid begins with the *Zhen* trigram and ends with the *Li* trigram.\n\nAfter gathering the medicine for three hundred days, the embryo is complete, and the Flying Golden Essence reduces by one trigram, while the Yang Barrier Restraining remains unchanged. Cease gathering the medicine and incorporate the swallowing method, which follows the four seasons. This pertains to the method of refining the form. When adding the trigram timing to refine the form, begin with the *Zhen* trigram and conclude with the *Li* trigram, without limiting the years, months, or days—only stopping upon verification.\n\nThe body will become radiant, the spirit refined and graceful, and one will gradually develop an aversion to foul odors that offend the abdomen. Worldly emotions and attachments will naturally dissolve, true *qi* will become abundant and constantly satiating, food intake will lessen while wine capacity increases, the mortal frame will transform into spiritual awareness, and movement will be as swift as a galloping horse. The eyes will be as dark as lacquer, the body as smooth as congealed fat, white hair will turn black again, wrinkled skin will smooth out, and old age will permanently retain a youthful appearance. One will see autumn down at a hundred paces, old scars and blemishes will naturally fade, and tears, saliva, and filth will no longer appear. The Sacred Elixir will generate flavor, the numinous liquid will exude fragrance, and true fragrance and extraordinary taste will constantly linger in the mouth and nose. The saliva will congeal into refined butter, capable of curing illnesses, and the entire body will become white cream. All these are verifications of refining the form with the Jade Liquid Return Elixir.\n\nOnce verification is confirmed, one must diligently follow the method and proceed with subsequent practices according to the season.\n\n**Golden Liquid Return Elixir, Seventh**\n\nThe *Golden Edict* states: \"Accumulated yang forms spirit, and within spirit there is form—once born from the sun, the sun is born from the moon. Accumulated yin forms the body, and within the body there is spirit—once born from metal, metal is born from jade. That which follows yin and yang in arising and vanishing is the light of the sun and moon, for light arises from number, and number originates from *Qian* and *Kun*. That which follows yin and yang in ascending and descending is the *qi* of metal and jade, for *qi* arises from time, and time originates from heaven and earth.\"\n\nThe *True Origin* states: \"The numbers of the sun and moon employ six and nine. The numbers of *Qian* and *Kun*, the *qi* of metal and jade, ascend in spring and summer and descend in autumn and winter. Ascending and descending are the seasons of heaven and earth. Metal is born from earth, earth from stone, stone from jade—this is how form manifests below. The golden crow in the sun, the jade hare in the moon, the sun awaits the moon’s essence to shine—this is how spirit manifests above.\"\n\nThe analogy: \"The sun and moon correspond to *qi*; kidney *qi* corresponds to the moon, and heart *qi* corresponds to the sun.\"",
      "overlap_context": "autumn, when lung *qi* is flourishing and liver *qi* is weak, apply the swallowing method daily using the *Gen* trigram. In the three months of winter, when kidney *qi* is flourishing and heart *qi* is weak, apply the swallowing method daily using the *Zhen* trigram. The method of flying golden essence does not hinder swallowing.\n\nIn the months of the four seasons, when spleen *qi* is flourishing and kidney *qi* is weak, as people regard kidney *qi* as their root, it is weak in all four seasons.",
      "start_char": 9665,
      "end_char": 10898,
      "start_sentence": 470,
      "end_sentence": 519,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.37719249725342,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\秘传正阳真人灵宝毕法.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "金玉比液也，肾液比金，而心液比玉。 所谓玉液者，本自肾气上升而到於心，以合心气，二气相交而过重楼，闭口不出而津满玉池，咽之而曰玉液还丹，升之而曰玉液炼形。 是液本自肾中来，而生於心。 亦比土中生石，石中生玉之说也。 所谓金液者，肾气合心气而不上升，熏蒸於肺，肺为华盖，下罩二气，即日而取肺液，在下田自尾闾穴升之，乃曰飞金晶入脑中，以补泥丸。 补足自上复下降，而入下田，乃曰金液还丹。 既还下田，复升遍满四体前后上升，乃曰金液炼形。 是亦金生於土之说也。 凡欲炼形飞金晶者，当在净室中，切禁风、日，遥焚香密启： 三清上圣，臣所愿长生在世，传行大道，演化告人，当先自行炼形之法，欲得不畏寒暑，绝啖谷食，逃於阴阳之外。 咒毕乃咽之。 《真诀》曰：背后尾闾穴曰下关，夹脊曰中关，脑下曰上关。 始飞金晶以通三关，肾比地，心比天，上到顶以比九天。 玉液炼形，自心至顶，以通九天。 三百日咽，大药就，胎仙圆，而真气生。 前起则行玉液炼形之旧道，后起则行飞金晶之旧道。 金晶玉液，行功见验，自坎卦为始，后起一升入顶，以双手微闭双耳内观，如法微咽於津。 乃以舌抵定牙关，下闭玉池，以待上腭之津，下而方咽，咽毕复起，至艮卦为期。 春冬两起一咽，秋夏五起一咽。 凡一咽数，秋夏不过五十数，春冬不过百数。 自后咽罢升身前起，以满头面、四肢、手指气盛方止。 再起再升，至离卦为期。 凡此后起咽津，乃曰金液还丹。 还丹之后而复前起，乃曰金液炼形。 自艮卦之后炼形，至离卦方止。 兑卦勒阳关，至乾卦方止。 以后起到顶，自上而下，号曰金液还丹。 金丹之气，前起自下而上，曰金液炼形形。 显琪树金花，若以金液还丹未到下元，而前后俱起，乃曰火起焚身，此是金液还丹炼形既，前后俱起，兼了焚身。 凡行此等，切须谨节苦志而无懈怠，以见验为度也。 《道要》曰：起后终宵闭耳，随时对饮金波，宴到青州方住，日西又听阳歌。 解曰：起后终宵闭耳者，为行金液还丹须是肘后飞金晶，一撞三关，其气才起，急须双手闭耳。 耳是肾波之门，恐泄肾气於外而不入脑中也。 随时对饮金波者，既觉气入脑中。 即便依前法点头曲项，退舌尖，近拄上腭，清甘之水有奇异是验，甘若蜜也。 当艮卦飞金晶一咽，至震卦方止。 青州，乃震卦也。 日西，兑卦也。 又听阳歌者，自兑卦勒阳关，直至乾卦，日用离卦，不必采药也。 饮罢终宵火起，前升后举焚身，虽是不拘年月，日中自有乾坤。 解曰：此一诀是金液炼形之法也。 饮罢终宵火起者，是依前法金液还丹，而艮卦炼形是起火也。 前升后举，飞金晶起火也。 凡玉液炼形之时，先后起金晶入顶，次还丹而复前升之以炼形，是金液炼形之法不同也。 当其飞金晶而起火入顶，便前起而炼形。 前后俱起名曰焚身。 火而行还丹，须依四时加减之数。 所行此法，不拘年月日时，但以谨节专一，幽居绝迹可也。 日中自有乾坤，盖午前烧乾，午后烧坤。 人以前后言之，肚腹为坤，而背后为乾。 午前烧乾者，为肘后飞金晶，前起炼形也。 午后烧坤者，自兑卦勒阳关，至乾卦方止故也。 此须於玉液还丹炼形见验正当，方以谨节幽居，焚香而行此法。",
      "translated_text": "Metal and jade correspond to the *essences*; kidney essence corresponds to metal, and heart essence to jade. The so-called *jade essence* originates from kidney *qi*, ascending to the heart to merge with heart *qi*. When the two *qi* intersect and pass the *Double Towers*, the mouth is sealed, and the *saliva* fills the *Jade Pool*. Swallowing it is called *jade essence returning cinnabar*; refining it upward is called *jade essence refining form*. This essence arises from the kidneys yet is born in the heart—analogous to stone emerging from earth and jade from stone.\n\nThe so-called *golden essence* occurs when kidney *qi* merges with heart *qi* without ascending, instead steaming the lungs. The lungs, as the *flowery canopy*, enshroud the two *qi*. Drawing lung essence at dawn, one guides it from the *Lower Field* upward through the *Weilü* cavity, calling it *flying golden radiance into the brain* to replenish the *Mud Pill Palace*. Once replenished, it descends from above back to the *Lower Field*, called *golden essence returning cinnabar*. After returning to the *Lower Field*, it ascends again, suffusing the four limbs and rising front and back—this is *golden essence refining form*, also illustrating how metal is born from earth.\n\nFor those refining form and flying golden radiance, one must be in a pure chamber, strictly avoiding wind and sunlight. From afar, burn incense and silently invoke: *\"Three Pure Ones and Supreme Sages, may your servant dwell long in the world, transmit the Great Dao, and teach others. First, I shall practice the method of refining form, to transcend cold and heat, abstain from grain, and escape beyond yin and yang.\"* After the incantation, swallow.\n\n*The True Formula* states: *\"The cavity behind the tailbone is the Lower Pass; the spine’s sides are the Middle Pass; below the brain is the Upper Pass.\"* Begin by flying golden radiance to open the *Three Passes*. The kidneys correspond to earth, the heart to heaven, ascending to the crown to mirror the *Nine Heavens*. Jade essence refining form rises from the heart to the crown, connecting the *Nine Heavens*. After three hundred days of swallowing, the great elixir is complete, the *embryonic immortal* perfected, and true *qi* is born. Rising forward follows the old path of jade essence refining form; rising backward follows the old path of flying golden radiance. As golden radiance and jade essence circulate, verification begins with the *Kan* trigram. Afterward, rise once to the crown, lightly cover the ears with both hands, and inwardly observe. As prescribed, gently swallow the saliva. Press the tongue against the teeth, seal the *Jade Pool*, and await the essence from the upper palate before swallowing. After swallowing, rise again, concluding at the *Gen* trigram. In spring and winter, swallow once per two risings; in autumn and summer, swallow once per five risings. Each swallow’s count should not exceed fifty in autumn and summer, nor one hundred in spring and winter. After swallowing, rise forward to suffuse the head, face, limbs, and fingers until the *qi* is abundant. Rise again, concluding at the *Li* trigram. Thereafter, rising backward to swallow saliva is called *golden essence returning cinnabar*. After returning cinnabar, rise forward again—this is *golden essence refining form*. From the *Gen* trigram onward, refine form until the *Li* trigram. At the *Dui* trigram, restrain the *Yang Pass* until the *Qian* trigram. Rising backward to the crown, then descending, is called *golden essence returning cinnabar*. The *qi* of the golden elixir rising forward from below is *golden essence refining form*. When golden blossoms appear like jade trees, if the golden essence returning cinnabar has not yet reached the *Lower Origin* but rises both forward and backward, it is called *fire rising to incinerate the body*—this occurs when golden essence returning cinnabar and refining form rise simultaneously. In such practices, one must be meticulous, resolute, and unwavering, proceeding only until verification is achieved.\n\n*The Dao Essentials* states: *\"After rising, close the ears all night, drink the golden waves in due time, and feast until reaching Qingzhou before stopping. At sunset, listen again to the yang song.\"* The explanation: *\"After rising, close the ears all night\"* refers to the practice of golden essence returning cinnabar, where one must fly golden radiance from behind the elbow, striking the *Three Passes*. As the *qi* rises, swiftly cover the ears with both hands. The ears are the gates of kidney *qi*; one must prevent its leakage outward, ensuring it enters the brain. *\"Drink the golden waves in due time\"* means that upon sensing the *qi* enter the brain, immediately follow the previous method: nod the head, curve the neck, retract the tongue, and press it against the upper palate. The clear, sweet water that emerges is the sign—sweet as honey. At the *Gen* trigram, fly golden radiance and swallow once, concluding at the *Zhen* trigram. *Qingzhou* corresponds to the *Zhen* trigram; *sunset* to the *Dui* trigram. *\"Listen again to the yang song\"* refers to restraining the *Yang Pass* from the *Dui* trigram to the *Qian* trigram, using the *Li* trigram daily without gathering medicine.\n\nAfter drinking all night, fire rises, ascending forward and lifting backward to incinerate the body. Though unbound by years or months, within each day lies heaven and earth. The explanation: This is the method of golden essence refining form. *\"After drinking all night, fire rises\"* follows the previous method of golden essence returning cinnabar, where refining form at the *Gen* trigram ignites the fire. *\"Ascending forward and lifting backward\"* refers to flying golden radiance to ignite the fire. During jade essence refining form, first rise backward to guide golden radiance into the crown, then return cinnabar and rise forward to refine form—this distinguishes the method of golden essence refining form. When flying golden radiance ignites fire into the crown, rise forward to refine form. Rising both forward and backward is called *incinerating the body*. When refining cinnabar with fire, adjust the count according to the four seasons. This practice is not bound by years, months, days, or hours; one must be meticulous, single-minded, secluded, and withdrawn. *\"Within each day lies heaven and earth\"* means that before noon, one refines *Qian*; after noon, one refines *Kun*. From the body’s front and back: the abdomen is *Kun*, the back is *Qian*. *\"Refining Qian before noon\"* refers to flying golden radiance from behind the elbow and rising forward to refine form. *\"Refining Kun after noon\"* refers to restraining the *Yang Pass* from the *Dui* trigram to the *Qian* trigram. This method should only be practiced after verifying jade essence returning cinnabar and refining form, with meticulous seclusion, burning incense, and strict adherence.",
      "overlap_context": "of metal and jade, ascend in spring and summer and descend in autumn and winter. Ascending and descending are the seasons of heaven and earth. Metal is born from earth, earth from stone, stone from jade—this is how form manifests below. The golden crow in the sun, the jade hare in the moon, the sun awaits the moon’s essence to shine—this is how spirit manifests above.\"\n\nThe analogy: \"The sun and moon correspond to *qi*; kidney *qi* corresponds to the moon, and heart *qi* corresponds to the sun.\"",
      "start_char": 10898,
      "end_char": 12138,
      "start_sentence": 520,
      "end_sentence": 572,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.52084755897522,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\秘传正阳真人灵宝毕法.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "金液还丹，而相次炼形勒阳关，如是一年外，方得焚身。 焚身，即是坎卦前炼形，以人身前后言之，肚腹为坤，背后为乾。 焚身午前烧乾，午后烧坤勒阳关。 凡烧乾自下而上，前后俱起。 冬夏三日成，五日而行既济之法，以防太过，而使金丹之有润，乃焚身火起中咽也，见验方止。 内志清高以合太虚，魂神不游以绝梦寐。 阳精成体，神府坚固，四时不畏寒暑，神采自可变移容仪。 常人对面虽彼富贵之徒，亦闻腥秽，盖其凡骨俗体也。 功行满足，密授 三清真箓，阴阳变化，人事灾福，神灵而皆能预知。 触目尘冗，心绝万境。 真气充满，以绝饮食。 异气透出金色，仙肌可比玉蕊。 去留之处，当所神只自来相见，驱用招呼一如己意。 真气纯阳，可乾外水。 上件金液还丹，还丹之后，金液炼形之验也。 已上乃长生不死之诀。 右中乘三门系地仙。 秘传正阳真人灵宝毕法卷中竟 秘传正阳真人灵宝毕法卷下 正阳真人锺离权云房着纯阳真人吕岩洞宾传 大乘超凡人圣法三门 朝元第八",
      "translated_text": "When refining the Golden Liquor Returned Elixir and subsequently tempering the form by restraining the *Yang Pass*, only after a full year may one proceed to *fenshen* (incineration of the body). *Fenshen* is the refinement of form preceding the *Kan* trigram. Regarding the body’s front and back: the abdomen is *Kun*, the back is *Qian*. For *fenshen*, refine *Qian* before noon and refine *Kun* after noon while restraining the *Yang Pass*. In refining *Qian*, the fire rises from below to above, activating both front and back. In winter and summer, completion occurs in three days; after five days, the method of *jiji* (Completion) is applied to prevent excess, ensuring the Golden Elixir remains supple. This is the ignition of *fenshen* fire within the central throat. Cease only upon verification.\n\nThe inner will becomes pure and lofty, merging with the Great Void; the hun and shen spirits do not wander, banishing dreams and sleep. The *Yang* essence solidifies the body, fortifying the spirit’s abode. One becomes impervious to the cold and heat of the four seasons, and one’s countenance naturally transforms. Even when facing ordinary people—though they may be wealthy or noble—one perceives only foul odors, for they remain of mortal bone and vulgar form. When merit and practice are fulfilled, the Three Clarities’ true registers are secretly conferred. The transformations of yin and yang, the fortunes and misfortunes of human affairs, and the movements of spirits—all may be foreknown. The eyes meet only dust and clutter, yet the mind severs all mundane realms. True *qi* fills the body, eliminating the need for food and drink. Extraordinary *qi* emanates a golden hue, and the immortal flesh rivals jade blossoms. Wherever one goes or stays, divine beings appear of their own accord, obeying commands as if by one’s own will.\n\nWhen true *qi* becomes purely *Yang*, it can dry external water. The above describes the verification of refining form with the Golden Liquor after the Returned Elixir. All that precedes is the secret to longevity and immortality.\n\n**Middle Vehicle’s Three Gates for Earthly Immortals**\n\n*Secret Transmission of the Orthodox Yang Perfected One’s* **Numinous Treasure Complete Methods** *(Middle Scroll Concludes)*\n\n*Secret Transmission of the Orthodox Yang Perfected One’s* **Numinous Treasure Complete Methods** *(Lower Scroll)*\n\nComposed by Orthodox Yang Perfected One Zhongli Quan (Yunfang)\nTransmitted by Pure Yang Perfected One Lü Yan (Dongbin)\n\n**Three Gates of the Great Vehicle for Transcending the Mundane and Entering Sagehood**\n**Morning Audience (Eighth)**",
      "overlap_context": "noon, one refines *Kun*. From the body’s front and back: the abdomen is *Kun*, the back is *Qian*. *\"Refining Qian before noon\"* refers to flying golden radiance from behind the elbow and rising forward to refine form. *\"Refining Kun after noon\"* refers to restraining the *Yang Pass* from the *Dui* trigram to the *Qian* trigram. This method should only be practiced after verifying jade essence returning cinnabar and refining form, with meticulous seclusion, burning incense, and strict adherence.",
      "start_char": 12138,
      "end_char": 12548,
      "start_sentence": 573,
      "end_sentence": 595,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.180781126022339,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\秘传正阳真人灵宝毕法.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "《金诰》曰：一气初判，大道有形而列二仪。 二仪定位，大道有名而分五帝。 五帝异地而各守一方，五方异气而各守一子。 青帝之子甲乙受之天真木德之九气。 赤帝之子丙丁，受之天真火德之三气。 白帝之子庚辛，受之天真金德之七气。 黑帝之子壬癸，受之天真水德之五气。 黄帝之子戊己，受之天真土德之一气。 自一生真一，真一因土出，故万物生成在土，五行生成在一，真元之道，皆一气生也。 《玉书箓》曰：一、三、五、七、九，道之分而有数。 金、木、水、火、土，道之变而有象。 东、西、南、北、中，道之列而有位。 青、白、赤、黄、黑，道之散而有质。 数归於无数，象反於无象，位至於无位，质还於无质。 欲道之无数，不分之则无数矣。 欲道之无象，不变之则无象矣。 欲道之无位，不列之则无位矣。 欲道之无质，不能之则无质矣。 无数则道之源也，无象则道之本也，无位则道之真也，无质则道之妙也。 《真原》曰：道原既判，降本流末，悟其真者，因真修真，内真而外真自应矣。 识其妙者，因妙得妙，内妙而外妙自应矣。 天地得道之真，其真未应，故未兔乎有位。 天地得道之妙，其妙未应，故未兔乎有质。 有质则有象可求，有位则有数可推。 天地之间、万物之内，最贵惟人。 即天地之有象可求，故知其质气与水也。 即天地之有数可推，故知其位远与近也。 审乎如是，而道亦不远於人也。 比喻曰：天地有五帝，而比人之有五脏也。 青帝甲乙木，甲为阳，乙为阴，比肝之气与液也。 黑帝壬癸水，壬为阳，癸为阴，比肾之气与液也。 黄帝戊己土，戊为阳，己为阴，比脾之气与液也。 赤帝丙丁火，丙为阳，丁为阴，比心之气与液也。 白帝庚辛金，庚为阳，辛为阴。 比肺之气与液也。 凡春夏秋冬之时不同，而心肺肝肾之旺有月。 《真诀》曰：凡春三月，肝气旺。 肝旺者，父母真气随天度运而在肝。 若遇木日，甲乙救土於辰戌丑未之时，依时起火炼脾气。 余日兑卦时损金以耗肺气，是时不可下功也。 坎卦时依法起火炼肾气。 震卦时入室多入少出息住为上，久闭次之数至一千息为度，当时内观如法，一意冥心闭目，青色自见，渐渐升身，以入泥丸，自寅至辰，以满震卦。 一千息以上尤佳，如息急渐微，出息而息住，不须连成。 凡夏三月，心气旺。 心旺者，以父母之真气随天度运而在心。 若遇火日，丙丁救金，於兑卦时依法起火炼肺气，余日坎卦时损水以耗肾气，是时不可下功也。 震卦时依法起火炼肝气。 离卦时入室依前行持定息，赤色自见，渐渐升身，以入泥丸，自巳至未，以满离卦。 一千息以上尤佳，其说如前。 凡秋三月，肺气旺。 肺旺者，以父母真气随天度运而在肺。 若遇金日，庚辛救木，於震卦时依法起火炼肝气。 余日离卦损火以耗心气，是时不可下功也。 巽卦时依法起火炼脾气。 兑卦时入室依前行持，白色自见，渐渐升身，以入泥丸，自申至戌以满兑卦。 凡冬三月，肾气旺。 肾旺者，父母之真气随天度运而在肾。 若遇水日，壬癸救火，於离卦时依法起火炼心气。 余日辰、戌、丑、未时损土以耗脾气，是时不可下功也。 兑卦时依法起火炼肺气。 坎卦时入室依前行持，黑色自见，渐渐升身，以入泥丸，自亥至丑以满坎圭",
      "translated_text": "**The Golden Proclamation** states:\nAt the primal division of the singular *qi*, the Great Dao took form and arrayed the Two Modes. Once the Two Modes settled into their positions, the Great Dao acquired names and divided into the Five Emperors. The Five Emperors, each dwelling in distinct lands, guarded their respective directions; the five directions, each governed by distinct *qi*, each guarded one celestial stem. The Azure Emperor’s stems *jia* and *yi* received the nine *qi* of Heaven’s true Wood virtue. The Vermilion Emperor’s stems *bing* and *ding* received the three *qi* of Heaven’s true Fire virtue. The White Emperor’s stems *geng* and *xin* received the seven *qi* of Heaven’s true Metal virtue. The Black Emperor’s stems *ren* and *gui* received the five *qi* of Heaven’s true Water virtue. The Yellow Emperor’s stems *wu* and *ji* received the singular *qi* of Heaven’s true Earth virtue. From the One arises the True One; the True One emerges through Earth, thus all things are born and completed in Earth. The Five Phases are generated and completed in the One. The Dao of the true origin is entirely born of the singular *qi*.\n\n**The Jade Book of Registers** states:\nOne, three, five, seven, nine—these are the Dao’s divisions manifesting as numbers. Metal, Wood, Water, Fire, Earth—these are the Dao’s transformations manifesting as images. East, West, South, North, Center—these are the Dao’s arrangements manifesting as positions. Azure, white, vermilion, yellow, black—these are the Dao’s dispersals manifesting as substances. When numbers return to the unnumbered, images revert to the imageless, positions reach the positionless, and substances return to the unsubstantial—then to attain the Dao’s unnumbered state, one must not divide it; to attain the Dao’s imageless state, one must not transform it; to attain the Dao’s positionless state, one must not arrange it; to attain the Dao’s unsubstantial state, one must not solidify it. The unnumbered is the Dao’s source; the imageless is the Dao’s root; the positionless is the Dao’s truth; the unsubstantial is the Dao’s subtlety.\n\n**The True Origin** states:\nOnce the Dao’s origin divided, it descended from root to branch. Those who awaken to its truth cultivate truth through truth, and when truth is internal, external truth naturally responds. Those who recognize its subtlety attain subtlety through subtlety, and when subtlety is internal, external subtlety naturally responds. Heaven and Earth grasp the Dao’s truth, yet their truth remains unmanifest, thus they have not escaped position. Heaven and Earth grasp the Dao’s subtlety, yet their subtlety remains unmanifest, thus they have not escaped substance. With substance, images may be sought; with position, numbers may be deduced. Within the realm of Heaven and Earth, amid the ten thousand things, none is more noble than humanity. Since Heaven and Earth possess images to be sought, we know their substance, *qi*, and water. Since Heaven and Earth possess numbers to be deduced, we know their positions, far and near. By examining this, we see that the Dao is not distant from humanity.\n\nFor analogy: Heaven and Earth have the Five Emperors, just as humans have the five viscera. The Azure Emperor, *jia-yi* Wood—*jia* as Yang, *yi* as Yin—corresponds to the liver’s *qi* and fluids. The Black Emperor, *ren-gui* Water—*ren* as Yang, *gui* as Yin—corresponds to the kidneys’ *qi* and fluids. The Yellow Emperor, *wu-ji* Earth—*wu* as Yang, *ji* as Yin—corresponds to the spleen’s *qi* and fluids. The Vermilion Emperor, *bing-ding* Fire—*bing* as Yang, *ding* as Yin—corresponds to the heart’s *qi* and fluids. The White Emperor, *geng-xin* Metal—*geng* as Yang, *xin* as Yin—corresponds to the lungs’ *qi* and fluids. Though the seasons of spring, summer, autumn, and winter differ, the flourishing of the heart, lungs, liver, and kidneys occurs in specific months.\n\n**The True Formula** states:\nDuring the three months of spring, the liver’s *qi* flourishes. When the liver flourishes, the parents’ true *qi*, following the celestial movements, resides in the liver. On Wood days (*jia-yi*), rescue Earth at the hours of *chen*, *xu*, *chou*, and *wei* by kindling the fire to refine the spleen’s *qi*. On other days, during the *dui* trigram hours, diminish Metal to deplete the lungs’ *qi*—at this time, one must not engage in practice. During the *kan* trigram hours, kindle the fire according to method to refine the kidneys’ *qi*. During the *zhen* trigram hours, enter the chamber, emphasizing inhalation over exhalation as optimal; prolonged breath retention is secondary. Count to one thousand breaths as the measure. At that time, internally visualize according to method, concentrating the mind with closed eyes. Azure light will naturally appear, gradually ascending the body to enter the *niwan* palace. From *yin* to *chen*, fill the *zhen* trigram. Exceeding one thousand breaths is especially excellent. If the breath becomes urgent, gradually reduce it, exhaling and then pausing—do not force continuity.\n\nDuring the three months of summer, the heart’s *qi* flourishes. When the heart flourishes, the parents’ true *qi*, following the celestial movements, resides in the heart. On Fire days (*bing-ding*), rescue Metal during the *dui* trigram hours by kindling the fire to refine the lungs’ *qi*. On other days, during the *kan* trigram hours, diminish Water to deplete the kidneys’ *qi*—at this time, one must not engage in practice. During the *zhen* trigram hours, kindle the fire according to method to refine the liver’s *qi*. During the *li* trigram hours, enter the chamber and practice breath regulation as before. Vermilion light will naturally appear, gradually ascending the body to enter the *niwan* palace. From *si* to *wei*, fill the *li* trigram. Exceeding one thousand breaths is especially excellent; the method is as described above.\n\nDuring the three months of autumn, the lungs’ *qi* flourishes. When the lungs flourish, the parents’ true *qi*, following the celestial movements, resides in the lungs. On Metal days (*geng-xin*), rescue Wood during the *zhen* trigram hours by kindling the fire to refine the liver’s *qi*. On other days, during the *li* trigram hours, diminish Fire to deplete the heart’s *qi*—at this time, one must not engage in practice. During the *xun* trigram hours, kindle the fire according to method to refine the spleen’s *qi*. During the *dui* trigram hours, enter the chamber and practice as before. White light will naturally appear, gradually ascending the body to enter the *niwan* palace. From *shen* to *xu*, fill the *dui* trigram.\n\nDuring the three months of winter, the kidneys’ *qi* flourishes. When the kidneys flourish, the parents’ true *qi*, following the celestial movements, resides in the kidneys. On Water days (*ren-gui*), rescue Fire during the *li* trigram hours by kindling the fire to refine the heart’s *qi*. On other days, during the hours of *chen*, *xu*, *chou*, and *wei*, diminish Earth to deplete the spleen’s *qi*—at this time, one must not engage in practice. During the *dui* trigram hours, kindle the fire according to method to refine the lungs’ *qi*. During the *kan* trigram hours, enter the chamber and practice as before. Black light will naturally appear, gradually ascending the body to enter the *niwan* palace. From *hai* to *chou*, fill the *kan* trigram.",
      "overlap_context": "arthly Immortals**\n\n*Secret Transmission of the Orthodox Yang Perfected One’s* **Numinous Treasure Complete Methods** *(Middle Scroll Concludes)*\n\n*Secret Transmission of the Orthodox Yang Perfected One’s* **Numinous Treasure Complete Methods** *(Lower Scroll)*\n\nComposed by Orthodox Yang Perfected One Zhongli Quan (Yunfang)\nTransmitted by Pure Yang Perfected One Lü Yan (Dongbin)\n\n**Three Gates of the Great Vehicle for Transcending the Mundane and Entering Sagehood**\n**Morning Audience (Eighth)**",
      "start_char": 12548,
      "end_char": 13795,
      "start_sentence": 596,
      "end_sentence": 656,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.80103635787964,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\秘传正阳真人灵宝毕法.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "解曰：春炼肝千息，青气出。 春末十八日不须依前行持，止於定息为法，而终日静坐，以养脾而炼己之真气，乃可坎卦起火炼肾，恐耗其真也。 夏炼心千息，赤气出。 夏末十八日不须依前行持，止於定息为法，而终日静坐，养炼如前，乃可坎卦时起火如前。 秋炼肺千息，白气出。 秋末十八日不须依前行持，止於定息为法，而终日静坐，养炼如前，乃可坎卦时起火如前。 冬炼肾千息，黑气出。 冬末十八日不须依前行持，止於定息为法，而终日静坐，养炼如前，乃可坎卦时起火如前。 以至黄气成光，默观万道周匝围身。 凡定息之法，不在强留而紧闭，使绵绵若存，用之不勤，从无入有，使之自住。 采药法，含津握固，以压心之真气不散也。 凡入室须闭户孤幽静馆，以远鸡犬、女子一切厌触之物。 微开小窍使明辨物，勿令风日透气、左右有声。 当潜心息，虑事累俱遣，内外凝寂，不以一物介其意。 盖以阳神初聚，真气方凝，看待如婴儿。 尚未及半，日夕焚香默祝天。 隐於山林，功行将半者地仙。 跪拜稽首默祝天，寄於海隅洞府，与天下立大功，与黎首除大害。 潜迹者天仙，跪拜稽首，三礼既毕，静坐忘机，以行此法。 仍须前法节节见验，若以便为此道，但恐徒劳终不见成，止於阴魄出壳而为鬼仙。 《道要》曰：凡行此法，不限年月日。 随月一依前法，以至见验方止，其气自见。 须是谨节不倦，弃绝外事，止於室中用志。 测其时候，用二个纯阳小子。 或结交门生，交翻反覆。 供过千日，可了一气。 一以夺十，一百日可见功。 五百日气全，可行内观炁后，聚阳神以入天神，炼之而合道，入圣超凡。 炼气之验，但觉身体极畅，常仰升腾，丹光透骨，异香满室。 次以静中外观，紫霞满目。 顶中下视，金光罩体。 之可怪证验不可备纪。 内观第九",
      "translated_text": "Explanation states: In spring, refine the liver for a thousand breaths, and green *qi* emerges. During the final eighteen days of spring, one need not practice as before; instead, adopt the method of settled breathing and sit in stillness throughout the day to nourish the spleen and refine one’s true *qi*. Only then may one kindle the fire during the *kan* trigram hours to refine the kidneys, lest their true *qi* be depleted.\n\nIn summer, refine the heart for a thousand breaths, and red *qi* emerges. During the final eighteen days of summer, one need not practice as before; instead, adopt the method of settled breathing and sit in stillness throughout the day, nurturing and refining as before. Only then may one kindle the fire during the *kan* trigram hours as previously described.\n\nIn autumn, refine the lungs for a thousand breaths, and white *qi* emerges. During the final eighteen days of autumn, one need not practice as before; instead, adopt the method of settled breathing and sit in stillness throughout the day, nurturing and refining as before. Only then may one kindle the fire during the *kan* trigram hours as previously described.\n\nIn winter, refine the kidneys for a thousand breaths, and black *qi* emerges. During the final eighteen days of winter, one need not practice as before; instead, adopt the method of settled breathing and sit in stillness throughout the day, nurturing and refining as before. Only then may one kindle the fire during the *kan* trigram hours as previously described.\n\nWhen yellow *qi* forms into light, silently observe myriad rays encircling the body.\n\nThe method of settled breathing does not lie in forcefully restraining or tightly closing the breath. Rather, it should be continuous as if present, applied without strain, moving from non-being into being, allowing it to reside naturally.\n\nThe method of gathering the elixir involves holding the saliva and clasping the hands firmly to prevent the heart’s true *qi* from scattering.\n\nWhen entering the chamber, one must close the door in a secluded and quiet dwelling, far from chickens, dogs, women, and all disturbing influences. Slightly open a small aperture to discern objects, but ensure neither wind nor sunlight enters, nor any sounds from the left or right.\n\nOne should settle the mind and still all thoughts, casting aside worldly concerns. Internally and externally, all must be serene, with nothing to disturb the intent. For the yang spirit is newly gathered and the true *qi* just congealing, one must tend to it as a newborn infant.\n\nBefore half the work is complete, burn incense and silently pray to Heaven day and night. Those who conceal themselves in the mountains and forests, with half their merit accomplished, become earthly immortals.\n\nKneeling and bowing with reverence, silently pray to Heaven, dwelling in remote caves or secluded grottoes. Establish great merit for the world, and remove great harm for the people. Those who remain hidden become heavenly immortals. After three bows are completed, sit in stillness, forgetting all schemes, and proceed with this method.\n\nOne must still follow the preceding methods step by step to witness verification. If one merely engages in this practice casually, one may labor in vain and see no fruition, ending only as a ghostly immortal whose yin spirit departs the body.\n\n*The Essential Dao* states: In practicing this method, there is no fixed duration of years, months, or days. Follow the preceding method each month until verification is achieved, and the *qi* will naturally manifest. One must be diligent and unwavering, abandoning all external affairs and focusing the will within the chamber. Discern the proper times and employ two pure yang youths. Alternatively, take on disciples, but beware of betrayal or reversal. After serving for a thousand days, one may complete a single cycle of *qi*. One can overcome ten with one, and in a hundred days, signs of progress will appear. In five hundred days, the *qi* will be complete, allowing one to practice inner observation of *qi* afterward. Gather the yang spirit to merge with celestial spirits, refining it to unite with the Dao, entering sagehood and transcending the mundane.\n\nThe verification of refining *qi* lies in feeling the body exceedingly harmonious, often ascending as if in flight, with the elixir’s light penetrating the bones and extraordinary fragrance filling the chamber. Next, in stillness, observe outwardly—purple radiance fills the eyes. Looking downward from the crown, golden light envelops the body. Strange signs and verifications are too numerous to record in full.\n\nThis is the ninth method of inner observation.",
      "overlap_context": " fire to refine the heart’s *qi*. On other days, during the hours of *chen*, *xu*, *chou*, and *wei*, diminish Earth to deplete the spleen’s *qi*—at this time, one must not engage in practice. During the *dui* trigram hours, kindle the fire according to method to refine the lungs’ *qi*. During the *kan* trigram hours, enter the chamber and practice as before. Black light will naturally appear, gradually ascending the body to enter the *niwan* palace. From *hai* to *chou*, fill the *kan* trigram.",
      "start_char": 13795,
      "end_char": 14500,
      "start_sentence": 657,
      "end_sentence": 689,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.99548602104187,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\秘传正阳真人灵宝毕法.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "《金诰》曰：大道本乎无体，寓於气也。 其大无外，无物可容。 大道本乎无用，运於物也。 其深莫测，无理可究。 以体言道，道之始有内外之辨。 以用言道，道之始有观见之基。 观乎内而不观乎外，外无不究而内得明。 观乎神而不观乎形，形无不备而神得见矣。 《真原》曰：以一心观万物，万物不谓之有余。 以万物挠一气，一气不谓之不足。 一气归诸心，心不可为物之所夺。 一心运一气，气不可为法之所役。 心源清彻，一照万破，亦不知有物也。 气战刚强，万感一息，亦不知有法也。 物物无物，以还本来之象。 法法无法，乃全自得之真矣。 比喻曰：以象生形，以形立名。 有名则推其数，有数则得其理。 比者之论。 盖高上虚无，无物可喻。 所可比者，如人之修炼，节序无差，成就有次。 冲和之气凝而不散，至虚真性恬淡无为，神合乎道，归於自然。 当此之际，以无心为心。 如何谓之应物，以无物为物。 如何谓之用法，真乐熙熙不知己之有身。 渐入无为之道，以入希夷之域，斯为入圣超凡之客。 《真诀》曰：此法合道，有如常说存想之理，又如禅僧入定之时。 当择福地置室，跪礼焚香，正坐盘膝，散发披衣，握固存神，冥心闭目。 午时前微以升身起火炼气，午后微以敛身聚火烧丹。 不拘昼夜，神清气和，自然喜坐。 坐中或闻声莫听，见境勿认，物境自散。 若认物境，转加魔军不退，急急前以身微敛，敛而伸腰，后以胸微偃，偃不伸腰，少待前后火起，高升其身勿动，名曰焚身。 火起魔军自散於躯外，阴邪不入於壳中，如此三两次已。 当想遍天地之间皆是炎炎之火，毕清凉，了无一物。 但见车马歌舞轩盖绮罗、富贵繁华、人物欢娱，成队成行，五色云升，如登天界。 及到彼中，又见楼台耸翠，院宇徘徊，珠珍金玉满地不收，花果池亭莫知其数。 须臾异香四起，妓乐之音嘈嘈杂杂，宾朋满坐，水陆俱陈，且笑且语，共贺太平，珍玩之物互相献受。 当此之际，虽然不是阴鬼魔军，亦不得认为好事。 盖修真之人弃绝外事，甘受寂寞，或潜迹江湖之地，或遁身隐僻之隅，绝念忘情，举动自戒，久受劬劳而历潇洒。 一旦功成法立，遍见如此繁华，又不谓是阴魔，将谓实到天宫。 殊不知脱凡胎在顶中自己天宫之内，因而贪恋，认为实境，不用超脱之法，止於身中阳神不出，而胎仙不化，乃曰出昏衢之上，为陆地神仙而可，长生不死而已，不能脱质升仙而归三岛以作人仙子也。 当此可惜，学人自当虑超脱虽难，不可不行也。 《道要》曰：不无尽法，已灭省故也。 超脱第十 《金诰》曰：道本无也，以言有者，非道也。 道本虚也，以言实者，非道也。 既为无体，则问应俱不能矣。 既为无相，则视听俱不能矣。 以玄微为道，玄微亦不离问苔之累。 以希夷为道，亦未免为视听之累。 希夷玄微尚未为道，则道亦不知其所以然也。 《玉书》曰：其来有始而不知大道之始，何也。 其去有尽而不知大道之终，何也。 高高之上虽有上，不知大道之上无有穷也。 深深之下虽有下，不知大道之下无有极也。 杳冥莫测名曰道，随物所得而列等殊。 无为之道，莫能穷究也。 《真诀》曰：超者，是超出凡躯而入圣品。 脱者，是脱去俗胎而为仙子。",
      "translated_text": "The *Golden Proclamation* states: The Great Dao is fundamentally formless, residing within *qi*. Its vastness knows no bounds, and no thing can contain it. The Great Dao is fundamentally functionless, yet operates through things. Its depth is unfathomable, and no principle can exhaust it. Speaking of the Dao in terms of its body, it then begins to have distinctions of inner and outer. Speaking of the Dao in terms of its function, it then begins to have a basis for observation and perception. Observe inwardly and not outwardly, and though nothing external remains unexamined, clarity is attained within. Observe the spirit and not the form, and though no form is left unprepared, the spirit becomes visible.\n\nThe *True Origin* states: With one mind observe the myriad things, and the myriad things are not said to be in excess. With the myriad things disturbing the one *qi*, the one *qi* is not said to be insufficient. When the one *qi* returns to the mind, the mind cannot be seized by things. When the one mind moves the one *qi*, the *qi* cannot be enslaved by methods. When the source of the mind is clear and penetrating, one illumination shatters ten thousand delusions, and one is unaware of the existence of things. When *qi* wages a fierce struggle, ten thousand sensations are stilled in a single breath, and one is unaware of the existence of methods. Things are no-things, returning to the original image. Methods are no-methods, thereby fulfilling the true nature of self-attainment.\n\nFor analogy: form arises from image, and names are established from form. With names, one infers their numbers; with numbers, one grasps their principles. Such is the discourse of analogy. Yet the supreme and void Dao transcends all things, and nothing can serve as a comparison. What can be likened is this: as in human cultivation, the seasons and sequences are without error, and accomplishments follow in order. The harmonious *qi* congeals without dispersing; the true nature, utterly serene, is without action. The spirit merges with the Dao and returns to spontaneity. At this juncture, take non-mind as mind. How then is one to respond to things? Take non-things as things. How then is one to employ methods? In true joy, one is blissfully unaware of having a body. Gradually entering the Dao of non-action, one reaches the realm of the subtle and imperceptible, becoming a guest who has entered sagehood and transcended the mundane.\n\nThe *True Formula* states: This method accords with the Dao, resembling the principle of visualization often discussed, or like the moment when Chan monks enter samadhi. Choose an auspicious site to establish a chamber. Kneel, pay respects, burn incense, sit upright with legs crossed, let the hair down, loosen the robes, clench the fists to retain spirit, empty the mind, and close the eyes. Before noon, slightly raise the body to kindle the fire and refine *qi*. After noon, slightly gather the body to concentrate the fire and burn the elixir. Regardless of day or night, when the spirit is clear and *qi* harmonious, one naturally delights in sitting. During sitting, if sounds are heard, do not listen; if visions appear, do not acknowledge them, and the illusory realms will disperse of themselves. If one acknowledges the illusory realms, demonic forces will intensify and not retreat. Immediately, slightly gather the body, then stretch the waist; afterward, slightly recline the chest without stretching the waist. Wait briefly until the fire rises before and behind, then raise the body without moving—this is called \"firing the body.\" When the fire rises, demonic forces scatter beyond the body, and yin evil does not enter the shell. Repeat this two or three times. Then visualize all between heaven and earth as a raging fire, entirely cool and devoid of things. Only then may one see carriages, horses, singing, dancing, canopies, silks, wealth, splendor, and joyous multitudes—processions in rows, five-colored clouds ascending, as if ascending to the celestial realms. Upon arriving there, one sees towering pavilions of jade green, courtyards stretching endlessly, pearls, jewels, gold, and jade scattered ungathered upon the ground, flowers, fruits, ponds, and pavilions beyond count. Suddenly, exotic fragrances arise on all sides, and the sounds of music and revelry fill the air. Guests and friends sit in full assembly, with delicacies of land and sea laid out. Laughter and conversation abound, celebrating great peace, and precious objects are exchanged as gifts. At this moment, though these are not yin ghosts or demonic forces, one must not regard them as auspicious. The true cultivator renounces external affairs, willingly endures solitude, conceals traces in rivers and lakes, or withdraws to secluded corners, cutting off thoughts and forgetting emotions, ever vigilant in conduct, enduring hardship and enjoying freedom. Once the work is accomplished and the method established, one may suddenly witness such splendor. Though not considering it a demonic illusion, one might mistake it for a true arrival in the celestial palace. Little does one know that the transcending of the mortal womb occurs within one’s own celestial palace atop the head. If one becomes attached and takes it for reality, failing to employ the method of transcendence, the yang spirit will remain within the body, and the embryonic immortal will not transform. One may then claim to have emerged above the dark paths, becoming an earthbound immortal, achieving longevity without death—but one cannot shed the mortal form to ascend as an immortal and return to the Three Isles as a celestial being. This is truly lamentable. Disciples must consider that though transcendence is difficult, it cannot be neglected.\n\nThe *Essentials of the Dao* states: The inexhaustible Dharma has already extinguished past faults.\n\n**Transcendence: Tenth Method**\n\nThe *Golden Proclamation* states: The Dao is fundamentally non-being; to speak of it as being is not the Dao. The Dao is fundamentally void; to speak of it as substantial is not the Dao. Being formless, even questions and responses cannot apply to it. Being imageless, even seeing and hearing cannot apply to it. Taking the mysterious and subtle as the Dao, the mysterious and subtle still cannot escape the burdens of inquiry and perception. Taking the subtle and imperceptible as the Dao, one still cannot avoid the burdens of seeing and hearing. If even the subtle and imperceptible are not the Dao, then the Dao is also beyond knowing how it is so.\n\nThe *Jade Scripture* states: Its coming has a beginning, yet one does not know the beginning of the Great Dao. What is this? Its going has an end, yet one does not know the end of the Great Dao. What is this? Above the loftiest heights, though there is an \"above,\" one does not know that above the Great Dao there is no limit. Below the deepest depths, though there is a \"below,\" one does not know that below the Great Dao there is no end. Profound and unfathomable, it is called the Dao. It accords with what beings attain and arranges distinctions. The Dao of non-action cannot be exhausted.\n\nThe *True Formula* states: \"Transcend\" means transcending the mortal body to enter the ranks of sages. \"Liberate\" means shedding the mundane womb to become an immortal child.",
      "overlap_context": "agehood and transcending the mundane.\n\nThe verification of refining *qi* lies in feeling the body exceedingly harmonious, often ascending as if in flight, with the elixir’s light penetrating the bones and extraordinary fragrance filling the chamber. Next, in stillness, observe outwardly—purple radiance fills the eyes. Looking downward from the crown, golden light envelops the body. Strange signs and verifications are too numerous to record in full.\n\nThis is the ninth method of inner observation.",
      "start_char": 14500,
      "end_char": 15732,
      "start_sentence": 690,
      "end_sentence": 748,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.48845434188843,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\秘传正阳真人灵宝毕法.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "是其神入气胎，气全真诀。 须是前功节节见验正当，方居清静之室，以入希夷之境，内观认阳神，次起火降魔，焚身聚气。 真气升在天官，壳中清净，了无一物，当择幽居？ 一依内观。 三礼既毕，平身不须高升正坐，不须敛伸，闭目冥心。 静极朝元之后，身躯如在空中，神气飘然，难为制御，默然内观，明朗不昧，山川秀丽，楼阁依稀，紫气红光纷纭为阵，祥鸾彩凤音语如簧。 异景繁华，可谓壶中真趣，而洞天别景，逍遥自在，冥然不知有尘世之累。 是真空之际，其气自转，不须用法依时。 若见青气出东方，笙簧嘹喨，旌节车马，左右前后不知多少。 须臾南方赤气出，西方白气出，北方黑气出，中央黄气出。 五气结聚而为彩云，乐声嘈杂，喜气熙熙，金童玉女扶拥自身，或跨火龙，或乘玄鹤，或跨彩鸾，或骑猛虎。 升腾空中，自下而上，所遇之处，楼台观宇不能尽陈，神祇官吏不可备说。 又到一处，女乐万行，官僚班列，如人间帝王之仪，圣贤毕至。 当此之时，见之傍若无人，乘驾上升，以至一门，兵卫严肃而不可犯，左右前后官僚、女乐留恋不已，终是过门不得轩盖覆面，自上而下，复入旧居之地。 如此上下不厌其数，是调出壳之法也。 积日纯熟，一升而到天宫，一降而还旧处，上下绝无碍滞。 乃自下而上，如登七级宝塔，或如上三层红楼。 始也一级而一级，七级上尽，以至顶中，辄不得下视，神惊而恋躯不出。 既至七级之上，则闭目便好跳，如寐如寤，身外有身，形若婴儿，肌肤鲜洁，神采莹然，回观故躯，亦不见有所见之者，乃如粪堆。 又如枯木，憎愧万端，辄不可顿弃而远游。 盖其神出未熟，圣气结而未成，须是再入本躯，往来出入纯熟，一任遨游，始乎一步、二步，次二里、三里，积日纯熟，乃如壮士，展臂可千里、万里，而形神壮大，勇气坚固，然后寄凡骸於名山大川之中，从往来应世之外，不与俗类寺伦。 是此而或行满而受天书，骖鸾乘凤，跨虎骑龙，自东自西，以入紫府。 先见太微真君，次居下岛。 欲要升洞天，当传道、积行於人间。 受天书而升洞天，以为天仙。 凡行此法，古今少有成者。 盖以功不备而欲行之速、便为此道。 或乃功验未证，止事静坐，欲求超脱。 或乃阴灵不散，出而为鬼仙，人不见形，往来去住，终无所归，止於投胎就舍，而夺人躯壳，复得为人仙。 或出入不熟，往来无法，一去一来，无由再入本躯，神魂不知所在，乃释子坐化，道流之尸解也。 故行此道，乃在前功见验正当，仍是择地筑室，以远一切腥秽之物、臭恶之气、往来之声、女子之色，不止於触其真气，而神亦厌之。 既出而复入，入而不出，则形神俱妙，与天地齐年而浩劫不死。 既入而复出，出而不入，如蝉脱蜕，迁神入圣。 是以超凡脱俗，以为真人仙子，而在风尘之外、寄居三岛之洲者也。 已上超凡入圣之诀。 右大乘三门系天仙。 秘传正阳真人灵宝毕法卷下竟",
      "translated_text": "When the spirit enters the qi-womb, the qi is complete in the true formula. Only when prior merits manifest verification at every stage may one dwell in a chamber of purity to enter the realm of the subtle and formless. There, one inwardly observes and recognizes the yang-spirit, then kindles the fire to subdue demons, burning the body to gather qi. The true qi ascends to the celestial palace, and within the shell, all is emptiness—nothing remains. Where to choose a secluded abode? Simply follow the practice of inward contemplation.\n\nAfter the three bows are completed, sit upright without rising or adjusting posture, close the eyes, and still the mind. When stillness reaches its utmost and the primordial is invoked, the body seems suspended in space, the spirit and qi drifting freely, difficult to restrain. In silent inward contemplation, clarity shines unobscured: mountains and rivers appear resplendent, pavilions and towers faintly discernible. Purple qi and crimson light swirl in formation, auspicious simurghs and rainbow-feathered phoenixes sing with flute-like voices. Amidst such wondrous splendor—truly the delight of the alchemical crucible, a separate realm within the grotto-heaven—one roams carefree, oblivious to the burdens of the dusty world.\n\nAt this moment of true emptiness, the qi turns of itself, without need for method or adherence to time. If a blue-green qi emerges from the east, accompanied by the resonant strains of reed pipes and the procession of banners, chariots, and attendants—uncountable in number—before long, a crimson qi appears from the south, a white qi from the west, a black qi from the north, and a yellow qi from the center. The five qi converge to form radiant clouds, the air filled with joyous music and exuberant harmony. Golden lads and jade maidens escort one’s form, now riding a fiery dragon, now mounting a dark crane, now astride a rainbow phoenix, now bestriding a fierce tiger. Ascending into the void, rising from below, one traverses realms where towers and temples defy description, and divine officials and spirits surpass enumeration.\n\nArriving at another place, ten thousand rows of female musicians stand in array, officials ranked in order, like the court of an earthly emperor, with sages and worthies all in attendance. At this time, one remains unmoved by all around, ascending further until reaching a gate where guards stand solemn and inviolable. The officials and musicians linger behind, unable to follow, and as one passes through, a canopy veils the face. Descending once more, one returns to the former dwelling. Such ascent and descent occur countless times—this is the method of adjusting the spirit’s emergence from the shell.\n\nWith days of accumulated practice, one ascends directly to the celestial palace and descends back to the original place, moving freely without obstruction. The ascent begins from below, like climbing a seven-tiered pagoda or ascending a three-story crimson tower. At first, one ascends step by step, and upon reaching the seventh level, one must not look down, for the spirit, startled, clings to the body and refuses to depart. Only after reaching the summit may one leap with eyes closed, as if in dream or waking. A body exists outside the body, its form like an infant’s, skin fresh and radiant, spirit luminous. Looking back at the former shell, one sees nothing—only a heap of filth, a withered tree—shame and remorse arise, yet it cannot be abandoned at once for distant wandering.\n\nFor the spirit’s emergence is not yet perfected, and the sagely qi has not fully coalesced. One must re-enter the original body, mastering the art of coming and going until effortless. At first, one may wander but a step or two, then two or three *li*, and with accumulated practice, like a stalwart warrior, one may stretch an arm to traverse a thousand or ten thousand *li*. The spirit grows mighty, the form robust, and courage unshakable. Then one may entrust the mortal frame to the mountains and rivers, dwelling beyond the world’s responses, no longer mingling with the vulgar.\n\nThus, when merits are fulfilled, one receives the celestial writ, riding simurghs and phoenixes, straddling tigers and dragons, journeying east and west to enter the Purple Court. First, one meets the True Lord of the Grand Tenuity, then resides on the lower isles. To ascend to the grotto-heaven, one must transmit the Dao and accumulate merit among mortals. Receiving the celestial writ, one ascends to the grotto-heaven as a celestial immortal.\n\nFew in ancient or modern times have succeeded in this practice, for many seek swift progress before merits are complete, or attempt transcendence through mere quiet sitting before verification is attained. Some, with lingering yin-spirits, emerge as ghost-immortals, unseen in form, wandering without destination, only to seize mortal shells and become human immortals. Others, unskilled in coming and going, lose the way back to their original body, their spirit adrift—this is the \"sitting transformation\" of Buddhist monks or the \"corpse-liberation\" of Daoist adepts.\n\nTherefore, this practice demands that prior merits be verified at every stage. One must choose a site and construct a chamber, far from all foul odors, putrid vapors, worldly noises, and the allure of women, lest they disturb the true qi or repulse the spirit. If one emerges and re-enters, enters and does not emerge, then form and spirit attain perfection, enduring as long as heaven and earth, undying through eons. If one emerges and does not re-enter, like a cicada shedding its husk, the spirit ascends to sageliness—transcending the mortal and shedding the vulgar to become a true immortal, dwelling beyond the dusty world on the isles of the Three Mountains.\n\nThe above is the secret of transcending the mortal to enter sageliness.\nThe Great Vehicle’s Three Gates pertain to celestial immortals.\nHere ends the *Secret Methods of the True Yang Immortal, Treasured Rites of the Numinous Treasure*, Scroll the Lower.",
      "overlap_context": "does not know that above the Great Dao there is no limit. Below the deepest depths, though there is a \"below,\" one does not know that below the Great Dao there is no end. Profound and unfathomable, it is called the Dao. It accords with what beings attain and arranges distinctions. The Dao of non-action cannot be exhausted.\n\nThe *True Formula* states: \"Transcend\" means transcending the mortal body to enter the ranks of sages. \"Liberate\" means shedding the mundane womb to become an immortal child.",
      "start_char": 15732,
      "end_char": 16845,
      "start_sentence": 749,
      "end_sentence": 785,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.828699827194214,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\秘传正阳真人灵宝毕法.txt",
        "category": "正统道藏太清部"
      }
    }
  ]
}