{
  "source_id": "秘本种子金丹",
  "source_file": "chunked_daozang\\秘本种子金丹.json",
  "total_chunks": 12,
  "total_original_chars": 11753,
  "total_translated_chars": 66825,
  "total_translation_time": 372.78054785728455,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\秘本种子金丹.txt",
    "category": "藏外"
  },
  "full_translation": "**The Secret Manual of the Golden Elixir for Progeny**\n*By Ye Tianshi of the Qing Dynasty*\n\n**Volume One**\n\n**General Discourse on Progeny**\nThe Dao of human life begins with the pursuit of offspring. The method of seeking progeny does not extend beyond two key principles: men cultivating essence and women nourishing blood. When yang essence overflows without exhaustion and yin blood descends in due time without fault, yin and yang harmonize, essence and blood coalesce, and the embryo forms, giving rise to life. If yang is deficient and cannot descend to meet yin, or yin is depleted and cannot ascend to receive yang, yin and yang oppose each other, essence and blood diverge, and thus there is no child.\n\nThe method of treatment: men should replenish their essence and moderate their desires to maintain the vigor of the yang path; women should nourish their blood and balance their qi to ensure menstruation occurs in its proper time. Through mutual cultivation, the Dao of having children is achieved.\n\nYet people fail to examine this, instead attributing success or failure to the five phases, seeking supplementation through food and medicine. They allow the artificial to overcome the natural, human effort to usurp heaven’s work—thus, though conception may occur, many children do not survive, or if they do, do not live long.\n\n**Pulse Diagnosis for Progeny**\nIn seeking progeny, the pulse is chiefly assessed at the *chi* position. If the right *chi* is overly strong, fire stirs and lust prevails; if the left *chi* is overly strong, yin is deficient and misfortune follows. Only a deep, slippery, and even pulse is conducive to conception. A faint and rough pulse indicates thin essence; if accompanied by slowness, it signifies extreme cold. If the pulse is weak and timid, one lacks strength for intercourse. In women who struggle to conceive, the *chi* pulse is also rough.\n\n**Methods for Selecting a Woman**\nThose who seek progeny must first choose a woman, just as planting requires selecting the right soil. For how can one expect a bountiful harvest from rocky ground? And how can one hope for noble offspring from a woman of meager fortune? Thus, for the sake of descendants, one cannot neglect selection.\n\nGenerally, a woman’s constitution values stillness over restlessness, heaviness over lightness, thickness over thinness, and maturity over youthfulness. Therefore:\n- Those with short lips and small mouths are unfit—this pertains to the region of progeny;\n- Those with small, thin ears are unfit—this is an external sign of kidney qi;\n- Those with weak, faint voices are unfit—this reflects the foundation of *dantian* qi;\n- Those with frail bodies are unfit—this indicates a weak palace of storage;\n- Those with delicate appetites are unfit—this suggests a deficient source of the blood sea and granary;\n- Those with brittle hair and missing teeth are unfit—this signifies liver blood and kidney essence depletion;\n- Those with protruding eyes and narrow hips are unfit—their organs fail to store, and they will have no descendants;\n- Those with greenish hues at the bridge of the nose or around the mouth are unfit—yang cannot overcome yin, leading to stagnation and counterflow in the liver and spleen;\n- Those with tight, rapid, wiry, or rough pulses are unfit—their true yin is weak, their menstrual cycles irregular, and their vital generative qi lacking.\n\nOther considerations:\n- Girls who have not yet reached maturity lack fully developed yin qi;\n- Women with excessive desires tend to bear more daughters;\n- Those with gentle temperaments find menstrual regulation easier;\n- Those with jealous natures have irregular menses;\n- Those with harsh appearances are heavy in form;\n- Those with beautiful faces often have thin fortune;\n- Those with flesh that overwhelms their bones have fat-clogged wombs;\n- Those as thin as firewood have bloodless wombs.\n\nFurthermore, women with tiger-like heads, bear-like necks, wasp-like eyes, jackal-like voices, or crosswise faces and vertical brows are prone to harming their children. Those who are fierce, treacherous, or cruel are equally unfavorable for progeny. Those seeking descendants must urgently attend to these matters.\n\n**The Sole Responsibility of Men for Progeny**\nThe responsibility for having or lacking offspring lies entirely with men; yet世俗俗见 often place the burden solely on women—this is an ignorant view.\n\nThe *Book of Changes* states: *\"The way of Kun is to follow heaven and act in its time.\"* The generation of life by Kun is nothing more than following heaven; thus, a mother’s bearing of children is merely following the father. How can women be considered the primary factor?\n\nIf women were the primary factor, consider the households of the wealthy, where concubines abound—among them, are there not those whose menses arrive on time and who are free of illness? Some take women who have borne children frequently with previous husbands, hoping for ease, yet they still fail to conceive. But when these same women are given to others, they promptly bear children. How can they fail to conceive with one man yet succeed with another? Thus, the presence or absence of offspring rests solely with men.\n\nRegardless of age or strength, men must have abundant spirit, which depends entirely on moderating desire. By moderating desire, they avoid reckless intercourse, accumulate qi, store essence, and act at the proper time—thus, conception is achieved in one attempt.\n\nYet世俗俗见 attribute miscarriages solely to the mother, childlessness to the child, and longevity or early death to fate—is this not absurd?\n\nGenerally, children born to young men are often weak due to frequent desire and thin essence; children born to older men are often robust because their desires are few and their essence complete.\n\nDuring intercourse, one must not engage in vigorous thrusting; gentle, subtle movements suffice. If one thrusts vigorously, the fetus will inevitably suffer from wind. Thus, children born to older men are often free of wind because they cannot engage in vigorous thrusting.\n\nAfter conception, one must absolutely avoid further intercourse—first, to prevent hidden miscarriage, and second, to avoid the child being afflicted by fetal toxins.\n\nThus, men must first cultivate themselves before attending to women—only then can success be achieved.\n\n**Cultivating Essence as the Foundation of Progeny**\nThe method of seeking progeny requires men to first cultivate essence and women to first nourish blood. Yet those who lack children often indulge excessively in lust. How can they not know that unrestrained ejaculation thins yang essence, and indulging desire injures true qi? How can they hope for conception through reckless desire?\n\nMen govern emission, women govern reception; through one emission and one reception, conception is achieved. Yet what is emitted today is not the thick, primordial qi of the pre-heaven, but merely the dregs of the post-heaven. Even if yin can transform what is received, it lacks the function of yang’s emission.\n\nThus, those seeking progeny must not harm themselves through excessive thought, nor deplete their heart and spirit. They must not let their intent wander outward, leaving the interior hollow, nor let their will be damaged within, rendering the exterior weak. They must not use wine as an aphrodisiac, nor rely on drugs to stoke the fire. By calming the heart and reducing desire, settling the spirit and treasuring essence, and cultivating stillness over time, qi becomes abundant and spirit complete. Acting in accord with the proper time, that single drop of pre-heaven’s true essence—vital qi—will surge forth with the flaccidity of yang, and success will be certain in every attempt.\n\nThe *Inner Canon* states: \"When yin is balanced and yang is secure, spirit and essence are well-ordered; when yin and yang part and separate, essence and qi are cut off.\" Laozi said: \"Be clear, be still, and do not disturb your essence.\" The *Mirror of Man* says: \"When essence and qi are abundant, two sons are born.\" These all refer to this principle.\n\n**Nurturing Essence Requires Reducing Desire**\nThe methods of seeking progeny have been discussed extensively by the ancients. The *Broad Principles of Progeny* advises that when the menstrual period has just ceased and the womb is open, one should timely sow the seed. The *Daoist Canon* holds that after the cessation of menstruation, conception on odd days pertains to yang and results in a male, while on even days it pertains to yin and results in a female. Li Dongyuan believed that conception one or two days after menstruation results in a male, while four or five days after results in a female. Zhu Danxi taught that receiving qi in the left womb produces a male, while in the right womb produces a female. The *Sacred Aid Canon* states that movement on the left results in a male, while on the right results in a female. The *Master Chu’s Posthumous Writings* asserts that blood enveloping essence forms a male, while essence enveloping blood forms a female. Though these theories abound and each has its merits, none achieves perfect efficacy. The method that yields complete success is none other than reducing desire. With reduced desire, one does not engage in reckless union but gathers essence and spirit, acting in accord with the proper time—what could one not attain?\n\nYet reducing desire must begin with calming the heart. The heart governs blood and stores spirit; when the heart is stirred, the spirit scatters outward. Though no emission occurs externally, essence has already departed its palace, and kidney qi follows, becoming internally disordered. In mild cases, this leads to nocturnal emissions or turbid urine; in severe cases, it results in syphilis or toxic swellings. Even if one is fortunate enough to avoid these, during intercourse there will be no true qi of stillness and unity, and what is emitted will be nothing but putrid filth—how can it transform and nurture a fetus?\n\nThe heart is the master of the body. If one can sweep away wayward thoughts and cultivate stillness, preventing the fire from stirring, then when yang essence is full and the time is right, conception will be achieved in a single act. Thus, reducing desire preserves the spirit, and not only does it lead to many children, but also to longevity.\n\n**Nurturing Essence Requires Moderating Labor**\nEssence is formed from blood, and it is not only sexual labor that depletes one’s essence—many daily activities also cause harm. When the eyes are strained by sight, blood is consumed by seeing; when the ears are strained by hearing, blood is consumed by listening; when the heart is strained by thought, blood is consumed by thinking. If one moderates these at all times, blood will be nourished and accumulate day by day.\n\n**Nurturing Essence Requires Curbing Anger**\nThe kidneys govern storage, and the liver governs dispersion; both organs contain ministerial fire, and their systems are connected above to the heart. The heart is the sovereign fire. Anger injures the liver and stirs the ministerial fire, causing the dispersing function to dominate while the storing function fails in its duty. Even without intercourse, essence is silently and subtly depleted.\n\n**Nurturing Essence Requires Abstaining from Alcohol**\nAmong foods and drinks, each has its suitability for the organs, and one need not be overly restrictive—except in the case of alcohol. The qi of pre-heaven that forms the fetal seed must be utterly clear and fully substantial, yet the nature of alcohol is lewd and heating. It not only disturbs the mind but also disrupts essence. When essence is disturbed by alcohol, half becomes damp-heat, and only half remains true essence. If essence is not substantial, the fetal origin is unstable; if essence is laden with damp-heat, future ailments such as pox, convulsions, or spleen failure will likely have their roots here. Thus, those seeking progeny must strictly abstain from alcohol. If one must drink, better to drink less than more; and better still not to drink at all—this is the great mechanism of the fetal origin. If one enters the bedchamber while drunk, essence will be agitated and thin.\n\n**Nurturing Essence Requires Care in Diet**\nThe *Inner Canon* states: \"When essence is insufficient, supplement it with flavor.\" Yet rich and heavy flavors cannot generate essence; only bland and light flavors can truly nourish it. All things possess their true flavor, but excessive seasoning obscures it. Whether meat or vegetables, when prepared properly, they naturally possess a harmonious and tranquil qi, and consuming them will naturally nurture essence. Among foods, the five grains alone embody the proper balance of the five flavors. Thus, when congee or rice is fully cooked, the thick liquid that forms on the surface is the concentrated essence of the grain. Consuming it quickly replenishes essence—this has been proven effective.\n\nThose who practice these several methods will find them not only an excellent way to seek progeny but also a wondrous art for preserving life.\n\n**The Method of Refining Essence**\nRefining essence begins with the kidneys. The inner kidney has an aperture called the *Guanyuan*, and the outer kidney has an aperture called the *Pinhu*. Before true essence is emitted and the qian body is broken, the yang qi of the outer kidney rises at the *zi* hour. The qi of the human body corresponds to the qi of heaven and earth. Once essence is emitted and the body is broken, the onset of yang in the body gradually delays—sometimes to the *chou* hour, sometimes to the *yin*, or even to the *mao* hour before it arises. In some cases, it never arises at all, and thus the body no longer corresponds to heaven and earth.\n\nThe secret to refining essence lies in rising at midnight during the *zi* hour, donning clothes, and sitting upright. Rub both hands until extremely hot, then use one hand to cup the outer kidney while the other presses the navel, focusing the spirit on the inner kidney. Practicing this over time will cause essence to flourish.\n\n**The Sovereign and Ministerial Fires Must Be Understood**\n\nThe hundred fires reside in the heart, and the heart is their sovereign; the ministerial fire resides in the kidney, and the kidney is their root. Yet the two fires are mutually dependent, responding without sound. Thus, the heart should be still—if not, fire stirs from desire and moves from the heart to provoke the kidney. Those who prioritize the heart over the kidney scorch yin with yang through force, and force causes qi to descend, losing hold of the cinnabar field and forfeiting the great foundation of primordial yang. The kidney should be replete, for when the kidney is full, yang rises from the earth and ascends from kidney to heart. Those who prioritize the kidney before the heart nurture fire with fire in accordance with nature, and nature allows qi to rise so that the hundred vessels arrive in unison—this is the true mechanism of transformation and nurturance. Thus, frivolous men often resort to force and frequently suffer depletion and taxation, harming their descendants; steadfast and sincere gentlemen naturally follow the Way, so all things flourish—why worry for their posterity? Those seeking offspring must also grasp the true mechanism of the yang path.\n\n**The Arising of Passion Between Man and Woman**\nWhen man and woman are harmonious and joyful, and passion arises in both before union, yang bestows and yin receives, forming an embryo and thus bearing a child. If the man’s passion has arisen but the woman’s heart remains unmoved, their jade bodies may join, yet the jade nectar flows prematurely—yang essence is bestowed, but yin does not receive it. If the woman’s passion has arisen but the man’s intent wavers, the peach waves surge in vain, and the jade dew does not drip—yin blood opens, but yang has nothing to enter. When yin and yang are discordant, they become the *pi* of heaven and earth not joining; how then can the ten thousand things be born?\n\n**On the Timing of Conception**\nHeaven and earth generate beings only at a certain time; the ten thousand things transform and give life only at a season of nurturance. Even the lowly cat and dog, when about to conceive, will have the female run and leap wildly, for the qi of nurturance stirs them so they cannot restrain themselves. This is the seasonal node of heaven and earth, the true mechanism of transformation and life. After a woman’s menstruation ends, there will be a day when a lotus pistil emerges from within the palace of the child, steam rising and heat surging, spirit clouded and stifled, with an irresistible urge for union—this is the moment for receiving essence and forming an embryo. If one acts against it, elixir is formed; if one follows it, an embryo is conceived. Yet women often conceal this out of shame, so the man must inform her in advance and have her speak of it herself—then one attempt will succeed.\n\n**The Wondrous Secret of Advancing Fire**\nThe jade lake should be lightly traversed—shallow crossing delights the woman, while heavy burden brings her harm. Yin blood gathers first, and yang essence flows afterward. When the red flower embraces the jade dew, one strides to the immortal isles. *(When blood envelops essence, a son is born; ascending directly forms an embryo.)*\n\n**The Three Arrivals of the Man**\n\nBefore union, a man exhibits three arrivals: when the yang path is vigorous and erect, this is the arrival of liver qi; when it is robust and hot, this is the arrival of heart qi; when it is firm, strong, and enduring, this is the arrival of kidney qi. When all three arrivals are complete, they delight the woman’s heart. If it is flaccid and fails to rise, liver qi has not arrived—forced union at this time injures the sinews, and his essence will drip without ejaculation. If it is robust but not hot, heart qi has not arrived—forced union injures the blood, and his essence will be thin and cold. If it is firm but not enduring, kidney qi has not arrived—forced union injures the bones, and his essence will not emerge, or if it does, will be scant. Those seeking offspring must value moderation of desire and clarity of mind to nurture the qi of liver, heart, and kidney.\n\nBefore union, a woman exhibits five arrivals: when her face flushes red and her brows crease, this is the arrival of heart qi; when her eyes grow moist and she casts sidelong glances, this is the arrival of liver qi; when she lowers her head in silence and her nose runs, this is the arrival of lung qi; when she nestles close and her body stirs of its own accord, this is the arrival of spleen qi; when the jade gate opens and jade nectar flows, this is the arrival of kidney qi. When all five qi arrive, the man may then unite with her, employing the method of nine shallow and one deep thrusts—thus their passion harmonizes, their intent is fulfilled, and conception is assured.\n\nDuring union, a woman suffers five injuries: first, if the yin gate remains closed and unopened, it must not be forcibly pierced—forced piercing injures the liver; second, if the woman’s arousal has stirred but the man does not comply, and union occurs only after her ardor has passed, this injures the heart and disrupts menstruation; third, if a young yin encounters an aged yang, and the jade stem is not firm but easily softens, the woman’s desire will not flow freely—this injures the liver and may lead to blindness; fourth, if menstrual blood has not fully ceased and the man forces union, this injures the kidneys; fifth, if the man, drunk, engages in battle with a jade stem hard and unyielding, thrusting relentlessly even after the woman’s passion has waned and his yang ardor persists, this injures the spleen. With these five injuries, how can there be a child?\n\nFive Signs in Women\n\nSoft moans and whispered words—this is the heart; closed eyes that do not open—this is the liver; parched throat and labored breath—this is the lungs; legs now bent, now stretched, lying supine as if a corpse—this is the spleen; cold breath from mouth and nose, with slippery fluid seeping from the jade gate—this is the kidneys. When these five signs reach the height of bliss, if the man recognizes her state and gathers her essence, not only will there be a child, but also the benefit of mutual nourishment.\n\n**Differing Paces in Yin and Yang**\nThe nature of yin and yang, their essence and disposition, are not uniform: those whose essence is firm tend to be slow, while those whose essence is unsteady tend to be swift. The slow, if hurried, are like the hungry awaiting food, yet unable to swallow when it arrives; the swift, if delayed, are like the drunk offered another cup, longing to vomit but unable. When swift and slow do not match, how can conception occur? Thus, when slow meets swift, one should take an unexpected path, avoiding a premature display; when swift meets slow, one should remain composed, provoking before engaging—then the encounter will be perfectly timed.\n\n**Disparities in Strength**\nWhen yang is strong and yin weak, she may fear it like a wasp’s sting or avoid it like a spear’s thrust; when yang is weak and yin strong, she may yield at the mere rustle of wind or flee at the sight of dust. If strength and weakness clash without balance, how can conception take place? Yet to support the weak, one must act with benevolence and righteousness, ensuring her heart is won. To overcome the strong is difficult—without gathering essence and spirit, how can one seize her soul? Truly, with this method, the strong need not be feared, nor the weak a concern.\n\n**Childlessness in the Young**\nA bud just opening, its vital qi not yet unfurled; a girl just reaching maidenhood, her heavenly water not yet abundant. Have you ever seen an unripe grain become seed, or an undersized silkworm spin a cocoon? To force the matter is to waste effort—even if one persists for now, can the aged wait? This is merely squandering the proper time.\n\n**Avoidances in Union**\nIn the union of man and woman, ancient methods dictate avoiding the days of bing and ding, the crescent and waning moons, and the new and full moons. Yet for those struggling to conceive, such restrictions may be overlooked. However, during great winds, heavy rains, thunderstorms, dense fogs, bitter cold, scorching heat, or when heaven and earth are dark and murky—during eclipses, rainbows, or earthquakes—these are times of heaven and earth’s wrath, when the qi of the four seasons is unbalanced. To couple then harms the man a hundredfold, sickens the woman, and even if a child is conceived, it will surely be afflicted with epilepsy, stupidity, muteness, deafness, paralysis, blindness, chronic illness, short life, or a lack of filial piety and benevolence. This is the first set of avoidances.\n\nMoreover, one must not couple beneath the light of the sun, moon, or stars; within temples or Buddhist monasteries; beside wells, stoves, latrines, or privies; near tombs, doorways, or thresholds; or in dark, perilous places. This is the second set of avoidances. If one knows to avoid these times and places, then spirits of fortune, virtue, great wisdom, and goodness will descend to dwell in the womb, bestowing a child of harmonious nature, whose family will prosper daily. Not only will they be free of illness, but they will also be intelligent, handsome, and long-lived. If one does not avoid these taboos, then foolish, deceitful, and wicked spirits will enter the womb, resulting in a child of violent and treacherous nature, whose family will decline daily. Not only will they suffer disabilities, but they will also face sudden calamities. The correspondence of fortune and misfortune from heaven is as swift as an echo—how can one not be cautious?\n\n**Guarding Against Silent Miscarriage**\nWhen the embryo first forms, its shape is like a dewdrop—its vessel unsupported, its root without ground. If steadied, it will take hold; if disturbed, it will flow away. Thus, after conception, one must strictly moderate desire to prevent overflow. Yet the young, indulging their passions without restraint or fear, often rely on their strength and do not falter—or, having faltered, resume the battle. At such times, the host (the woman) seeks stillness, but the guest (the man) refuses to cease. What can be done with such a reckless intruder, pounding at the door? With her watery nature and ardent disposition, how can she not open the gate and follow the current away? At that moment, fallen blossoms fly with butterflies, fire-dates and intertwined pears scatter together—mingling in filth and flowing away. Unaware, yesterday’s conception becomes today’s miscarriage, the new moon’s conception becomes the full moon’s loss. Conceived and lost in secret, with no trace left behind.\n\nFor a visible miscarriage, the fetus has already taken shape, and the loss is felt; but a silent miscarriage is like water slipping away—how can one know? Thus, many households have no full-term births because of frequent silent miscarriages. Those who marry courtesans often have no children, for their wombs are slippery and accustomed to such losses.\n\nI have often seen those who struggle to conceive: when asked about their yang affairs, they say they are accustomed to battle; when asked about their skill, they claim mastery; when asked about their situation, they sigh and lament, *\"Everyone has children—why do I alone have none?\"* How would they know that others have visible births while theirs are silent losses?\n\nAdditionally, some women miscarry at three, five, or seven months—though this is more common among the weak, it is often caused by unrestrained desire, injuring the mother’s qi and leading to miscarriage. Thus, those who rely on brute strength often have no children, for strength and weakness destroy each other; those who indulge without restraint often fail to bear offspring, for they plunder the embryo’s vital qi. How can this all be blamed on the woman? Those seeking descendants should anticipate these dangers and guard against them—then, perhaps, success may follow.\n\n**The Method of Keeping Concubines**\nTo take a concubine without cause is far from virtuous—all manner of ruin stems from this. Yet if one is aged, the wife is barren, and there is no heir, then circumstances may leave no choice. However, acquiring a concubine is easy; keeping her is difficult—and keeping her requires proper method.\n\nFirst, one must not be overly strict. When the wife sees the concubine, she is hardly pleased. Thus, she may often scold, curse, or find fault with her conduct, or use harsh words and stern expressions—these are the inevitable reactions of human nature.\n\nYet they fail to understand that childbirth depends on qi and blood, and qi and blood depend on the state of the mind. When the mind is not at ease, the Chong and Ren meridians are injured; when the Chong and Ren meridians are injured, the womb cannot conceive. Thus, one must not be overly strict in keeping a concubine.\n\nSecond, the concubine’s quarters should be quiet, secluded, and removed from frequent observation. For in the moment of private union, the man should be vigorous, and the woman receptive—both vigor and receptivity arise from qi. At such a time, if the mind is focused, qi gathers and advances directly, thus favoring conception. If timid, qi falters and fails to be retained—how then can a fetus form? Yet the root of courage or timidity lies in the heart; where the heart goes, qi follows. If the heart harbors doubt or fear, it does not fully engage, and qi does not arrive. Should one be startled by some sound at the critical moment, qi lingers in the ears and does not reach the generative organs; if distracted by some sight, qi remains in the eyes and does not reach them. Or if anger or dread arises, qi becomes knotted in the heart and fails to arrive. When qi does not arrive, it is like casting a stone into water—the water remains unmoved.\n\nMoreover, when two forces engage in battle, nothing is more harmful than spies lurking to observe; with a single, undivided mind, how can one endure slander and estrangement? This is why the concubine’s quarters must be quiet and secluded.\n\nYet these two methods are but makeshift measures for those with no better recourse. If one is blessed with a wise and virtuous wife who thinks only of continuing the ancestral line, harboring no jealousy and even showing compassion, then the closer the concubine, the greater the comfort—and how can seclusion be humane? If not, then though one may keep a concubine in name, in truth one does not, and what benefit is there in having her?\n\n**Caution in Medicines and Diet for Progeny**\nThere is no fixed formula for begetting offspring, for remedies must be tailored to the individual. The cold-natured require warming, the hot-natured cooling; the slippery require astringency, the deficient require tonification. Correcting imbalances harmonizes yin and yang, and life flourishes—this is the wondrous method of begetting children. Yet people today, ignorant of this principle, merely pass down formulas, assuming what suits one will suit all. Or seeing one person succeed by chance, they blindly follow, heedless of their own needs, and recklessly prepare and consume such medicines—as if a hat made for Zhang could fit Li.\n\nMoreover, most formulas for begetting offspring rely heavily on substances that invigorate yang and generate heat, even to the point of refining minerals and metals or concocting toxic, foul, or harsh ingredients. These are flaunted as marvels, enhancing bedroom pleasure while disregarding the harm to the body—those seeking descendants should beware.\n\n**Causes of Male Infertility**\nThe illnesses that hinder conception relate to essence in men and blood in women, both stemming from insufficiency. In men, insufficiency manifests as seminal weakness: essence may be slippery, thin, or cold; one may lack firmness at the crucial moment, or ejaculate without force; one may suffer from frequent nocturnal emissions, turbid urine, or painful strangury. Or one may indulge excessively in women, leading to yin deficiency, which causes lumbar and renal pain and fatigue. Or one may indulge in male-male relations, leading to extreme yang, which exhausts yin. Or one may be overly forceful, disrupting harmony in the act. Or one may suffer from chronic genital swelling, which disrupts the liver and kidneys. Additionally, some men are afflicted with yang deficiency, which causes coldness, or yin deficiency, which causes heat. These are all male disorders and cannot be blamed entirely on women. If the root cause is identified and treated, success will follow.\n\n**Causes of Female Infertility**\nFor women, blood is paramount, for blood unites with essence to form a fetus. To diagnose infertility, observe the condition after menstruation; to treat it, regulate the yin aspect. Menstruation is blood, and blood is yin, which corresponds to the moon—thus, monthly cycles are normal. When illness arises, however, menstruation may come early or late, twice in a month, or once every two months; it may cease entirely or flow incessantly. There may be pain before or after bleeding; the color may be pale, purple, or black; the flow may be clotted and formless, or scanty due to insufficient essence and blood, turning into leukorrhea. There may be collapse of original qi, leading to flooding and spotting; or deficiency-cold in the uterus, preventing yang qi from generating life; or hidden heat in the blood, preventing yin qi from congealing. There may be blood stasis or qi masses, uterine prolapse, or amenorrhea—all are disorders of true yin.\n\nThe methods of treatment are detailed in the two volumes on regulating menstruation. When true yin is diseased, insufficient yin blood cannot nurture a fetus, and insufficient yin qi cannot retain it. The power of retention and nurturance lies in the Gate of Life, for it is the sea of blood for the Chong and Ren meridians, and the fetus is governed by blood. Yet blood does not generate itself but depends on qi—thus, true yin is paramount. Therefore, tonifying the Gate of Life, whether with qi or blood, can be called tonifying yin. The method of tonifying yin is the way of strengthening the root and securing the foundation.\n\nFrom youth to old age, this is indispensable for all, and all the more so as the foundation of both prenatal and postnatal life—without it, one cannot exert one’s strength. Thus, the methods of regulating menstruation and begetting offspring focus on replenishing the Gate of Life and preserving yang qi.\n\nYet the storehouse of essence and blood lies in the Gate of Life, while their source resides between the two yang organs, the heart and spleen. The heart governs blood—nourishing the heart nourishes blood; the spleen and stomach govern food and drink—fortifying them ensures the distribution of qi. When both are harmonized, qi flows and blood circulates. Thus, regulating emotions and diet should precede the regulation of menstruation—all are means of replenishing the source of yin.\n\nShould one proceed with treatment without understanding the root and branch, the sequence of priority, how could one speak of methods for regulating menstruation and begetting offspring?\n\n**Discerning Misguided Treatment in Begetting Offspring**\nWhen yang essence is emitted, yin blood can secure it; essence forms the child, blood forms the womb, and thus conception is achieved. Now, when women are childless, it is invariably due to insufficient blood failing to secure essence. Blood deficiency arises from many causes, yet only by regulating and supplementing yin blood to ensure no depletion can conception occur. Common physicians, failing to examine closely, uniformly attribute it to deficiency-cold in the uterus, administering acrid and hot medicinals that sear the viscera, causing blood and qi to surge and boil. Menstruation then turns dark purple or black, gradually diminishing in volume. Initially, appetite may surge, but over time, the mouth becomes bitter and dry, and a host of disorders arises—how then can conception occur? Even if a child is born, it is seldom long-lived.\n\n**Male Yin Deficiency and Difficulty in Begetting Offspring**\nWhen a man’s true yin is insufficient, it cannot nourish the constructive and defensive qi, gradually giving rise to debility. This may manifest as intermittent fevers, spontaneous sweating, or night sweats; as the spirit failing to guard its abode and blood failing to return to its origin; as depletion damaging yin; as seminal loss or dribbling urinary incontinence; as qi deficiency leading to dizziness; as blurred vision or deafness; as dry mouth and parched tongue; or as aching lumbus and weak legs. For all conditions involving internal depletion of essence and marrow or desiccation of fluids, one must swiftly supplement the true yin of the left kidney. The *Zuogui Pill* is indicated:\n\n**Zuogui Pill**\n*Shudihuang* (prepared rehmannia root), 8 *liang*, pounded into paste\n*Shanyao* (Chinese yam), stir-fried with ginger juice\n*Gouqizi* (goji berry)\n*Shanzhuyu* (cornelian cherry), kernels removed\n*Lujiao jiao* (deerhorn glue), stir-fried to pearls\n*Guijiao* (tortoise plastron glue), stir-fried to pearls\n*Tusizi* (Chinese dodder seeds), prepared, each 4 *liang*\n*Chuan niuxi* (Sichuan achyranthes root), wine-steamed, 3 *liang*\n\nGrind the above into powder, form into honey pills the size of *tongzi* seeds, and take one hundred pills before meals with a mild salt solution.\n\nIf true yin is unsecured and deficiency fire flames upward, use purely yin and supremely tranquil ingredients: remove *gouqizi* and *lujiao jiao*, and add *nüzhenzi* (glossy privet fruit) and *maidong* (dwarf lilyturf root), each 3 *liang*. If fire scorches the Metal phase (lung) causing dryness and frequent coughing, add *baihe* (lily bulb), 3 *liang*. For night fevers and steaming bones, add *digupi* (Chinese wolfberry root bark), 3 *liang*. For inhibited or turbid urination, add *fuling* (poria), 3 *liang*. For dry and bound stool, remove *tusizi* and add *roucongrong* (desert cistanche), 3 *liang*. For qi deficiency, add *renshen* (ginseng), 4 *liang*. For mild blood deficiency with stagnation, add *danggui* (Chinese angelica root), 4 *liang*. For aching lumbus and knees, add *duzhong* (eucommia bark), salt-water stir-fried, 3 *liang*. If the viscera are harmonious without fire but qi is not full, remove *guijiao* and add *poguzhi* (psoralea fruit), 3 *liang*, *lianrou* (lotus seed), kernels removed, and *hutaorou* (walnut kernel), each 4 *liang*.\n\n**Male Essence Deficiency and Difficulty in Begetting Offspring**\nWhen essence is scant, though it may be emitted, it is invariably weak and thin.\n\nFor the cervix of the womb is widely open, and the scant essence that enters—how could it suffice to fill it? Of necessity, it must enter and exit in the same instant. The **Firming the Root Pill** is indicated.\n\n**Firming the Root Pill**\n*Tusizi* (dodder seed), wine-prepared – 4 *liang*\n*Shudihuang* (prepared rehmannia), wine-steamed and mashed – 4 *liang*\n*Gandihuang* (dried rehmannia), wine-soaked and mashed – 4 *liang*\n*Tianmendong* (asparagus root), heart removed, wine-soaked – 4 *liang*\n*Maimendong* (ophiopogon root), heart removed, wine-soaked – 4 *liang*\n*Wuweizi* (schisandra fruit) – 4 *liang*\n*Fushen* (poria with hostwood) – 4 *liang*\n*Huaishanyao* (Chinese yam), lightly stir-fried – 3 *liang*\n*Lianrou* (lotus seed), skin and heart removed – 2 *liang*\n*Renshen* (ginseng), rootlets removed – 2 *liang*\n*Gouqizi* (goji berry) – 2 *liang*\nGrind into powder, form into honey pills the size of *wuzi* seeds. Take eighty to ninety pills per dose, with bland salt water.\n\nFor all types of deficiency and depletion in men, emaciation, deafness, and dim vision, the **Incomparable Chinese Yam Pill** is indicated.\n\n**Incomparable Chinese Yam Pill**\n*Shanyao* (Chinese yam) – 2 *liang*\n*Tusizi* (dodder seed) – 3 *liang*\n*Wuweizi* (schisandra fruit), processed – 6 *liang*\n*Roucongrong* (desert cistanche), wine-soaked – 4 *liang*\n*Duzhong* (eucommia bark), wine-stir-fried – 3 *liang*\n*Niuqi* (achyranthes root), wine-soaked and steamed – 1 *liang*\n*Shudihuang* (prepared rehmannia) – 1 *liang*\n*Zexie* (alisma rhizome) – 1 *liang*\n*Shanzhuyu* (cornus fruit) – 1 *liang*\n*Fuling* (poria) – 1 *liang*\n*Bajitou* (morinda root) – 1 *liang*\n*Chishizi* (red halloysite) – 1 *liang*\nGrind into powder, form into honey pills. Take fifty pills per dose before meals, with rice water.\n\n**Thin Essence and Difficulty in Begetting Offspring**\nWhen a man’s indulgence in desire is unrestrained and his emissions are excessive, kidney deficiency and thin essence result, preventing the essence from directly entering the womb. The **Dreaming of Bears Pill** is indicated.\n\n**Dreaming of Bears Pill**\n*Huangqi* (astragalus), honey-prepared – 4 *liang*\n*Huangyubiaojiao* (yellow croaker swim bladder glue), stir-fried with clamshell powder until pearl-like – 1 piece\n*Shayuanjili* (tribulus fruit), steamed with mare’s milk and sun-dried – 8 *liang*\nGrind into powder, form into honey pills. Take eighty pills per dose on an empty stomach, with warm wine.\n\n**Slippery Essence and Difficulty in Begetting Offspring**\nWhen a man’s essence and qi are unconsolidated, with frequent nocturnal emissions or turbid urine dripping incessantly, or excessive seminal leakage, he will be unable to father children. The **Progeny Elixir** is indicated.\n\n**Progeny Elixir**\n*Lianxu* (lotus stamen), select golden-colored – 4 *liang*\n*Shanzhuyu* (cornus fruit), pits removed – 3 *liang*\n*Fupenzi* (raspberry), stems removed – 2 *liang*\n*Longgu* (dragon bone), calcined and water-ground – 5 *qian*\n*Qianshimi* (euryale seed) – 4 *liang*\n*Shayuanjili* (tribulus fruit), sifted to obtain fine powder – 4 *liang*; resift to obtain 2 *liang* of the finest powder for the formula, while the coarser powder is decocted into a paste\nGrind into powder, mix with 4 *liang* of prepared honey and the *jili* paste to form pills. Take on an empty stomach with bland salt water.\n\n**Clear Essence and Difficulty in Begetting Offspring**\nWhen a man’s essence and qi are clear and cold, or when excessive bedroom exertion injures him, kidney water becomes insufficient and cannot directly enter the womb. The **Firming the Root and Strengthening Yang Elixir** is indicated.\n\n**Firming the Root and Strengthening Yang Elixir**\n*Shudihuang* (prepared rehmannia) – 3 *liang*\n*Shanzhuyu* (cornus fruit) – 3 *liang*\n*Bajitou* (morinda root) – 2 *liang*\n*Tusizi* (dodder seed), cleaned – 1.5 *liang*\n*Chuanxuduan* (dipsacus root), wine-soaked – 1.5 *liang*\n*Yuanzhirou* (polygala root), processed – 1.5 *liang*\n*Shechuangzi* (cnidium seed), stir-fried – 1.5 *liang*\n*Fushen* (poria with hostwood) – 1 *liang*\n*Shanyao* (Chinese yam), wine-steamed – 1 *liang*\n*Niuqi* (achyranthes root), wine-washed – 1 *liang*\n*Duzhong* (eucommia bark), wine-washed until fibers break – 1 *liang*\n*Danggui* (Chinese angelica root), wine-washed – 1 *liang*\n*Roucongrong* (desert cistanche), wine-soaked – 1 *liang*\n*Wuweizi* (schisandra fruit) – 1 *liang*\n*Yizhiren* (alpinia fruit), salt-water stir-fried – 1 *liang*\n*Lurong* (deer velvet), lard-fried – 1 *liang*\n*Gouqizi* (goji berry) – 3 *liang*\n*Renshen* (ginseng) – 2 *liang*\nGrind into powder, form into honey pills the size of *wuzi* seeds. Take on an empty stomach with salt water; take again before bed.\n\n**Cold Essence and Difficulty in Begetting Offspring**\nWhen a man’s yang is vigorous, he can directly ejaculate into the womb. If yang is impotent and essence is cold, the **Dodder Seed Pill** is indicated. If kidney qi cannot flow smoothly, the **Five-Seed Progeny Pill** is indicated.\n\n**Dodder Seed Pill**\n*Tusizi* (dodder seed), wine-soaked, steamed, and ground into powder, then formed into pills with sparrow egg white, the size of *wuzi* seeds. Take seventy pills per dose on an empty stomach, with warm wine.\nFor those over fifty with yang impotence, add 4 *liang* of *tianxiong* (aconite), wrapped in dough and baked until cooked; remove the skin and navel, process with boy’s urine, grind into powder, and form pills with the *tusizi* powder. This is especially effective.\n\n**Five-Seed Progeny Pill**\n*Gouqizi* (goji berry) – 8 *liang*\n*Tusizi* (dodder seed), wine-cooked – 8 *liang*\n*Wuweizi* (schisandra fruit) – 1 *liang*\n*Fupenzi* (raspberry), stems removed – 4 *liang*\n*Cheqianzi* (plantain seed), stir-fried – 2 *liang*\nGrind into powder, form into honey pills. Take ninety pills per dose on an empty stomach, with plain boiled water.\n\n**Cold Essence and Difficulty in Begetting Offspring**\nWhen a man’s essence is cold, the essence within the kidneys is cold. Though it may enter the womb, if original yang is insufficient, yin cannot be transformed, resulting in infertility or a predominance of daughters. The **Fostering Unicorns Pearl** is indicated.\n\n**Fostering Unicorns Pearl**\n*Shudihuang* (prepared rehmannia) – 4 *liang*\n*Danggui* (Chinese angelica root) – 4 *liang*\n*Tusizi* (dodder seed), prepared – 4 *liang*\n*Huaishanyao* (Chinese yam), ginger juice-prepared – 2 *liang*\n*Gouqizi* (goji berry) – 2 *liang*\n*Hutaorou* (walnut kernel) – 2 *liang*\n*Bajitou* (morinda root) – 2 *liang*\n*Lujiaojiao* (deer antler glue) – 2 *liang*\n*Lujiaoshuang* (deer antler frost) – 2 *liang*\n*Duzhong* (eucommia bark), wine-stir-fried – 2 *liang*\n*Shanzhuyu* (cornus fruit), pits removed – 2 *liang*\n*Chuanjiao* (Sichuan pepper), eyes removed – 2 *liang*\n*Renshen* (ginseng) – 2 *liang*\n*Baizhu* (white atractylodes) – 2 *liang*\n*Fuling* (poria) – 2 *liang*\n*Baishao* (white peony root), wine-stir-fried – 2 *liang*\n*Chuanxiong* (ligusticum root) – 1 *liang*\n*Zhigancao* (honey-fried licorice) – 1 *liang*\nGrind into powder, form into honey pills the size of *wuzi* seeds. Take seventy to eighty pills per dose on an empty stomach, with plain boiled water.\n\n**Deficiency-Cold and Difficulty in Begetting Offspring**\nFor men with spleen-kidney deficiency-cold, poor appetite, fever, night sweats, seminal emission, white turbidity, depletion of true qi, and emaciation, the **Returning to Youth Elixir** is indicated.\n\n**Returning to Youth Elixir**\n*Shudihuang* (prepared rehmannia) – 4 *liang*\n*Shanyao* (Chinese yam) – 2 *liang*\n*Shanzhuyu* (cornus fruit) – 2 *liang*\n*Duzhong* (eucommia bark), ginger juice-prepared – 2 *liang*\n*Gouqizi* (goji berry) – 2 *liang*\n*Niuqi* (achyranthes root), wine-soaked – 1 *liang*\n*Yuanzhi* (polygala root), ginger juice-soaked and stir-fried – 1 *liang*\n*Roucongrong* (desert cistanche), wine-soaked – 1 *liang*\n*Beiwuwei* (northern schisandra fruit) – 1 *liang*\n*Chuanxuduan* (dipsacus root) – 1 *liang*\n*Chushizi* (paper mulberry fruit) – 1 *liang*\n*Bohuixiang* (fennel) – 1 *liang*\n*Tusizi* (dodder seed), prepared – 1 *liang*\n*Bajitou* (morinda root) – 1 *liang*\nGrind into powder, form into honey pills. Take fifty pills per dose on an empty stomach, with bland salt water.\n\n**Yang Impotence and Difficulty in Begetting Offspring**\nWhen an older man lacks offspring due to yang impotence and essence depletion, unable to engage in vigorous intercourse to arouse the woman’s passion—whether his ardor wanes at the crucial moment or his weapon falters mid-battle—the woman’s spring heart burns bright, while the man’s sighs arise in vain. How then can jade seeds be sown in the blue fields?\n\n**Zan Yu Elixir Recommended.**\n**Zan Yu Elixir:**\nPrepared *rehmannia* (steamed and mashed) – 8 *liang*\nHoney-fried *bai zhu* (white atractylodes) – 8 *liang*\n*Danggui* (Chinese angelica) – 6 *liang*\n*Gouqizi* (goji berry) – 6 *liang*\n*Du zhong* (eucommia bark), wine-fried – 4 *liang*\n*Xianmao* (curculigo), wine-steamed for one day – 4 *liang*\n*Bajitou* (morinda root), licorice decoction-fried – 4 *liang*\n*Shanzhuyu* (cornelian cherry), pitted – 4 *liang*\n*Yinyanghuo* (epimedium), mixed with sheep fat and fried – 4 *liang*\n*Roucongrong* (cistanche), wine-washed to remove skin – 4 *liang*\n*Jiǔzǐ* (Chinese leek seed), fried yellow – 4 *liang*\n*Shechuangzi* (cnidium seed), lightly fried – 2 *liang*\nProcessed *fuzi* (aconite) – 2 *liang*\n*Rougui* (cinnamon bark) – 2 *liang*\nGrind into powder, form into honey pills. Alternatively, add *renshen* (ginseng) and *lurong* (deer velvet) for enhanced efficacy.\n\n**Yang Deficiency and Difficulty in Begetting Offspring**\nWhen a man’s primordial yang is insufficient—whether due to congenital weakness or excessive taxation—this leads to debilitation of the *mingmen* fire, which fails to generate earth, resulting in spleen-stomach vacuity cold. Manifestations may include:\nreduced food intake, or nausea, distension, and vomiting;\nregurgitation or dysphagia;\naversion to cold or abdominal pain;\nloose stools or frequent diarrhea;\ninvoluntary urination, vacuity strangury, or cold mounting;\ncold invading the channels, causing limb and joint impediment pain;\nor cold in the lower burner, leading to water qi and edema.\nIn sum, those with true yang insufficiency invariably exhibit:\nspiritual fatigue and qi timidity;\npalpitations or restlessness;\nflaccid limbs;\nhallucinations of malevolent spirits;\nor yang debility and childlessness.\nIn such cases, hasten to fortify the primordial yang of the right kidney. **Right-Restoring Pill** is indicated.\n\n**Right-Restoring Pill:**\nPrepared *rehmannia* (mashed into paste) – 8 *liang*\n*Shanyao* (Chinese yam), ginger juice-fried – 4 *liang*\n*Gouqizi* (goji berry), lightly fried – 4 *liang*\n*Lujiaojiao* (deer antler glue), fried into pearls – 4 *liang*\nPrepared *tusizi* (dodder seed) – 4 *liang*\n*Du zhong* (eucommia bark), ginger juice-fried – 4 *liang*\n*Danggui* (Chinese angelica) – 3 *liang*\n*Shanyurou* (cornelian cherry flesh) – 3 *liang*\n*Rougui* (cinnamon bark) – 3 *liang*\nProcessed *fuzi* (aconite) – 3 *liang*\nGrind into powder, form into honey pills the size of bullets. Chew two pills each morning, taken with bland hot water.\nFor yang debility with qi vacuity, add 5–6 *liang* of *renshen* (ginseng).\nFor seminal efflux or turbid discharge, or loose stools, remove *danggui* and add fried *buguzhi* (psoralea).\nFor unremitting *sun xie* (daybreak diarrhea), add 3 *liang* each of *beiwuwei* (northern schisandra) flesh and *doukou* (cardamom), stir-fried and defatted.\nFor reduced food intake, indigestion, nausea, or acid regurgitation—all signs of spleen-stomach vacuity cold—add 3 *liang* of dry ginger, fried yellow.\nFor unremitting abdominal pain, add 2 *liang* of *wuzhuyu* (evodia), soaked in decoction and fried.\nFor aching lumbus and knees, add 4 *liang* of *hutao* (walnut) meat with skin.\nFor yin vacuity with yang impotence, add 4 *liang* of *bajitou* (morinda root) and 3 *liang* of *roucongrong* (cistanche), wine-soaked. Alternatively, add one pair of yellow dog’s external kidneys, stewed in wine until soft and mashed in.\n\n**Fire Exuberance and Difficulty in Begetting Offspring**\nIn cases of fire exuberance, ministerial fire is excessively effulgent.\n\nExcessive prolonged intercourse results in the woman’s passion having passed while the man’s essence has yet to be released; by the time the man’s essence is released, the woman’s arousal has already waned—how then can conception occur? The *Buyin Pill* is indicated.\n\n**Buyin Pill**\n*Huangbai* (phellodendron), stir-fried with salted wine; *zhimu* (anemarrhena), stir-fried with salted wine—4 *liang* each\n*Shudihuang* (steamed rehmannia), pounded; *guiban* (tortoise plastron), stir-fried with suet—6 *liang* each\nGrind into powder, mix with steamed pig spinal marrow, and form into honeyed pills the size of *wuzi* seeds. Take 50–60 pills on an empty stomach with bland salt water.\n\n**Male Fire Exuberance and Difficulty in Begetting Offspring**\nWhen ministerial fire in men blazes excessively, it scorches true yin, leading to extreme yang; extreme yang then becomes hyperactive. Alternatively, if one is overly forceful in intercourse, such forcefulness disrupts harmony between dominance and submission, thus preventing conception. The *Yannian Yisi Dan* is indicated.\n\n**Yannian Yisi Dan**\n*Renshen* (ginseng)—3 *liang*\n*Tiandong* (asparagus root), wine-soaked and heart removed—3 *liang*\n*Maidong* (ophiopogon), wine-soaked and heart removed—3 *liang*\n*Shudihuang* (steamed rehmannia), pounded; *shengdihuang* (raw rehmannia)—2 *liang* each\n*Fuling* (poria), wine-soaked and sun-dried—5 *liang*\n*Digupi* (lycium bark), wine-soaked—5 *liang*\nAdd *heshouwu* (fleeceflower root), half a *jin*: soak thoroughly in rice wine, pare off the skin with a bamboo knife, slice, and place in a wok. Add a slice of black sheep meat and 3 *ge* of black soybeans, with enough water to cover. Line a steamer with a bamboo mat, arrange the *heshouwu* on top, seal tightly to prevent steam from escaping, and steam for one to two hours until the meat is tender. Remove, sun-dry, grind into powder, and form into honeyed pills the size of *wuzi* seeds. Take 70–80 pills on an empty stomach with warm wine.\n\n**Male \"Chicken Essence\" and Difficulty in Begetting Offspring**\nIn some men, the foreskin of the jade stem is so tender that the slightest touch induces unbearable itching. Thus, with each act of intercourse, yang essence is already discharged before yin essence flows—this is called \"chicken essence.\" The *Zhuangyang Decoction* is indicated.\n\n**Zhuangyang Decoction**\n*Shechuangzi* (cnidium seed) and *digupi* (lycium bark) in equal parts\nDecoct and use the liquid to steam and wash the affected area, rubbing gently with the hands. During washing, ensure the jade stem is erect for optimal effect. If the skin is rubbed raw, do not be alarmed—it will recover in a day or two. Steam and wash several times daily. The aim is to toughen the skin for greater endurance.\n\n**Female Vacuity Weakness and Infertility**\nWhen a woman’s qi and blood are both vacuous, her menstrual flow is irregular—sometimes ceasing, sometimes accompanied by vaginal discharge, abdominal pain, lumbar soreness, poor appetite, emaciation, and infertility. The *Yulinzhu* is indicated; taking one or two doses may enable conception. Among all formulas for promoting fertility, none surpass this.\n\n**Yulinzhu**\n*Renshen* (ginseng); *baizhu* (atractylodes), honey-fried; *baishao* (peony), wine-fried—2 *liang* each\n*Chuanxiong* (ligusticum); *zhigancao* (honey-fried licorice)—1 *liang* each\n*Danggui* (tangkuei); *shudihuang* (steamed rehmannia)—4 *liang* each\n*Tusizi* (cuscuta), prepared—4 *liang*\n*Duzhong* (eucommia), wine-fried; *lujiaoshuang* (deer antler gelatin); *chuanjiao* (zanthoxylum), with seeds removed—2 *liang* each\nGrind into powder and form into honeyed pills the size of bullets. Chew and take 1–2 pills on an empty stomach with plain boiled water, or form into smaller pills for swallowing.\n- For delayed menstruation with abdominal pain, add *buguzhi* (psoralea), wine-fried, and *rougui* (cinnamon)—1 *liang* each; in severe cases, add *wuzhuyu* (evodia), soaked and fried—5 *qian*.\n- For profuse vaginal discharge with abdominal pain, add *buguzhi* (psoralea), wine-fried—1 *liang*, and *beiwuwei* (schisandra)—5 *qian*; or add *longgu* (dragon bone), calcined with vinegar—1 *liang*.\n- For severe cold in the uterus with diarrhea or pain, add *fuzi* (aconite), prepared, and *ganjiang* (dried ginger), blast-fried—several *qian* each.\n- For depression, qi stagnation causing distension or fullness, add *xiangfu* (cyperus), wine-prepared—2 *liang*; in severe cases, add *chenxiang* (aloeswood)—5 *qian*.\n- For blood heat with excessive fire, early menstruation, or internal heat, add *chuanxuduan* (dipsacus) and *digupi* (lycium bark)—2 *qian* each; or temporarily clear fire with a decoction before taking this formula, or use the decoction as a guiding agent.\n\n**Female Viscus Cold and Infertility**\nWhen a woman’s five viscera are vacuous and debilitated, the uterus becomes cold and enervated, leading to red and white vaginal discharge, night sweats, shortness of breath, aversion to cold, and cold intolerance. The *Xusici Jiangsheng Dan* is indicated. This formula contains no bizarre or harsh ingredients; it is both warming and astringent. For those with vacuity cold in the blood sea, it is highly effective. However, its warming power is ample while its supplementing power is insufficient. If augmented with *renshen* (ginseng), *baizhu* (atractylodes), *shudihuang* (steamed rehmannia), *chuanxiong* (ligusticum), and *zhigancao* (honey-fried licorice)—1 *liang* each—its warming and supplementing effects in promoting fertility would be greatly enhanced. Thus, it is named the *Jiawei Xusici Jiangsheng Dan*.\n\n**Xusici Jiangsheng Dan**\n*Danggui* (tangkuei), wine-washed; *duzhong* (eucommia), wine-washed; *fushen* (poria spirit); *yizhiren* (alpinia); *longgu* (dragon bone), calcined; *guixin* (cinnamon bark); *wuzhuyu* (evodia), soaked in decoction; *ganjiang* (dried ginger), half raw and half cooked; *chuanjiao* (zanthoxylum), with seeds removed; *wuyao* (lindera), fried—1 *liang* each\n*Baishao* (peony), wine-fried; *chuanniuxi* (cyathula), wine-soaked; *zhibanxia* (processed pinellia); *fangfeng* (saposhnikovia); *qinjiao* (gentiana); *shichangpu* (acorus), with hairs removed; *beixixin* (asarum); *jiegeng* (platycodon)—5 *qian* each\n*Cinnabar*—1 *qian*: take one large *fuzi* (aconite), hollow out the base, fill with cinnabar, wrap and bake until cooked. Remove the cinnabar, discard the *fuzi*, grind the cinnabar into fine powder, and refine with water.\n*Muli* (oyster shell)—select large pieces, soak in boy’s urine for 49 days, changing the urine every 5 days. Remove, coat thoroughly with 1 *liang* of *liuhuang* (sulfur) powder mixed with wine, wrap tightly with paper, moisten with rice vinegar, and seal with salt clay. Dry, then calcine with 5 *jin* of charcoal. Use 2 *liang* per dose; the remainder may be stored for future use.\nGrind all ingredients into powder, form into pills with glutinous rice paste cooked in wine, the size of *wuzi* seeds, and coat with cinnabar. Take 30 pills, gradually increasing to 80–90 pills, on an empty stomach with plain boiled water.\n\n**Female Obesity and Infertility**\nThose with exuberant phlegm-qi tend to be obese; obesity causes the lower body to become overly plump, drawing the uterus inward and making conception difficult. Even if the man’s jade stem is long and vigorous, thrusting forcefully with essence shooting straight in, dampness from the bladder may cause overflow and flooding.\n\nFor cases of obesity with exuberant phlegm-qi, administer **Ditan Decoction** to accompany **Ditan Pills**.\n\n**Ditan Decoction**\n*Danggui* (washed in wine), *Baizhu* (honey-fried), *Baishao*, *Banxia* (processed), *Xiangfu* (rice-prepared), *Chenpi*, and *Gancao* – 2 *liang* each; *Fuling* – 4 *liang*; *Chuanxiong* – 7 *qian* and 5 *fen*.\nDivide into ten doses. Decoct with three slices of ginger and use to swallow **Ditan Pills**.\n\n**Ditan Pills**\n*Baizhu* (honey-fried) – 2 *liang*; *Banxia* (fermented), *Chuanxiong*, *Xiangfu* (rice-prepared) – 1 *liang* each; *Shenqu* (stir-fried) and *Fuling* – 5 *qian* each; *Juhong* – 4 *qian*; *Gancao* – 2 *qian*.\nGrind into powder, form into pills with rice porridge, and take 80 pills per dose.\nFor heat, add *Huanglian* and *Zhishi* (wheat-fried) – 1 *liang* each.\n\n**Female Emaciation and Infertility**\nWomen who are emaciated and weak often suffer from blood deficiency and thus cannot conceive. They should regularly take **Dabu Pills**.\n\n**Dabu Pills**\n*Tiandong* (heart removed), *Maidong* (heart removed), *Shichangpu*, *Fuling*, *Renshen*, *Yizhiren*, *Gouqizi*, *Digupi*, and *Yuanzhi* (flesh) – equal parts.\nGrind into powder, form into pills with honey the size of *tongzi* seeds, and take 30 pills on an empty stomach with wine.\n\n**Chronic Weakness and Infertility**\nFor a woman to conceive, her qi must be sufficient and her blood abundant to nourish the fetus. If qi is deficient, yang declines; if blood is deficient, yin declines. When both qi and blood are deficient, the uterine chamber sags and cannot ascend, making miscarriage inevitable. **Bazhen Yimu Pills** are indicated.\n\n**Bazhen Yimu Pills**\n*Renshen*, *Baizhu* (honey-fried), *Fuling*, and *Chuanxiong* – 1 *liang* each; *Danggui* and *Shudihuang* – 2 *liang* each; *Gancao* (honey-fried) – 5 *qian*; *Baishao* (vinegar-fried) – 1 *liang*; *Yimucao* – 4 *liang* (harvested in the fifth or sixth month, using only the upper half; discard those with leaves; dry in the sun and pound with an iron pestle).\nGrind into powder, form into pills with honey the size of *danzi* seeds, and take one pill on an empty stomach with plain boiled water. Smaller pills may also be used.\nFor those with spleen-stomach deficiency-cold and stagnation, add *Sharen* (stir-fried with ginger juice) – 1 *liang*; for abdominal distension and oppression, add *Shanzha* (steamed with rice) – 1 *liang*; for excessive depression, add *Xiangfu* (wine-processed) – 1 *liang*.\n\n**Exuberant Ministerial Fire in Women**\nWhen ministerial fire is excessive, it scorches the earth like parched soil, making it difficult for plants to grow. Moreover, if fire is exuberant, the man’s essence may ejaculate prematurely while the woman’s desire is not yet aroused—how can conception occur? **Yiyin Decoction** is indicated.\n\n**Yiyin Decoction**\n*Gandihuang* and *Shudihuang* – 3 *qian* each; *Baishao*, *Maidong* (heart removed), and *Danshen* – 2 *qian* each; *Niuxi* – 1 *qian* and 5 *fen*; *Gancao* – 1 *qian*.\nDecoct in two cups of water until seven-tenths remain.\nFor exuberant fire with vexation and agitation, add *Guijiao* – 2 *qian*; for qi deficiency, add *Renshen* – 1–2 *qian*; for heart deficiency with insomnia, add *Suanzaoren* and *Danggui* – 1–2 *qian* each.\n\n**Spleen-Stomach Cold in Women**\nWhen the spleen and stomach are deficient and cold, the belt vessel loses its strength, and essence may be discharged directly—how can the uterus bear it? **Buzhong Pills** are indicated.\n\n**Buzhong Pills**\n*Chuanxiong*, *Danggui*, *Huangqi* (honey-fried), *Baizhu* (honey-fried), *Renshen*, *Baishao*, *Duzhong* (salt-water fried), *Chuanxuduan*, *Ejiao* (pearl-fried), and *Wuweizi* (stir-fried) – 1 *liang* each; *Gancao* (honey-fried) – 5 *qian*.\nGrind into powder, form into pills with honey, and take with plain boiled water.\n\n**Qi Stagnation and Infertility in Women**\nWhen a woman’s excessive brooding and depression injure the heart, spleen, and the source of the thoroughfare and conception vessels, her blood and qi gradually wither, leading to menstrual irregularities—how can conception occur? **Hehuan Pills** are indicated.\n\n**Hehuan Pills**\n*Danggui* and *Shudihuang* – 3 *liang* each; *Fushen* and *Baishao* – 1.5 *liang* each; *Suanzaoren* (stir-fried) and *Yuanzhi* (processed) – 1 *liang* each; *Xiangfu* (wine-fried) and *Gancao* (honey-fried) – 8 *fen* each.\nGrind into powder, form into pills with honey, and take with plain boiled water.\nFor qi deficiency, add *Renshen* – 1 *liang*.\n\n**Blood Stagnation and Infertility in Women**\nWhen a woman’s blood is deficient and her menses stagnate, accumulating without movement, causing lower abdominal pain and long-term infertility, **Wuwu Decoction** is indicated.\n\n**Wuwu Decoction**\n*Danggui* and *Shudihuang* – 3 *qian* each; *Baishao* (wine-fried) – 2 *qian*; *Chuanxiong* and *Rougui* – 1 *qian* each.\nDecoct in water and take.\nFor qi stagnation, add *Xiangfu* (processed) – 1 *qian*; for yang deficiency with mounting pain, add *Xiaohuixiang* – 1 *qian*; for inhibited water pathways, add *Zexie* – 1 *qian*; for nausea and vomiting, add *Ganjiang* – 1 *qian*.\n\n**Menstrual Irregularity and Infertility in Women**\nWhen a woman’s menstrual flow is irregular and her qi and blood are disharmonious, she cannot conceive.\n\nOr, after giving birth to one child, there may be a prolonged interval of many years. **Seed-Jade Wine** is indicated; taken for one hundred days, it can enable conception. If qi and blood are insufficient, with menstrual stagnation and phlegm congealment, take it for half a year, and efficacy will naturally appear.\n\n**Seed-Jade Wine**\n*Danggui* (whole) – 5 *liang*, sliced. This moves and nourishes the blood.\n*Yuanzhi* – 5 *liang*, washed in licorice decoction. This resolves stagnation within the blood, moves qi, and dissolves phlegm.\n\nPlace the above two ingredients in a loose summer cloth bag, steep in 10 *jin* of sweet wine, and seal tightly. After seven days of steeping, take warm before bed, drinking as much as desired. Do not interrupt the course; when finished, prepare another batch. Additionally, after the menstrual flow ceases, each day take one green-shelled duck egg, pierce seven holes in it, and steam it with 5 *fen* of *Qiai* in a bowl of water. Eat one daily; in a month, consume no more than five or six, or as few as two or three.\n\n**Menstrual Irregularity in Women**\nIn women, the menstrual flow is the appointed time for bearing descendants. If the menstrual flow is irregular, it is not an omen of conception. Even if conception occurs, it will not be fully sound. **Great Life Pills** are indicated; this is a general formula for regulating menstruation.\n\nFor red and white vaginal discharge with long-term infertility, **Menstruation-Regulating Seed-Jade Pills** are indicated.\nFor yin deficiency infertility, **Augmented Rehmannia Pills** are indicated.\nFor menstrual abdominal pain, **Kunhou Zisheng Pills** are indicated.\n\n**Great Life Pills**\n*Shudihuang* (wine-steamed) and *Danggui* (body) – 4 *liang* each; *Xuduan* (salt-water fried), *Ejiao* (stir-fried with *Puhuang* powder until pearled), *Duzhong* (salt-water fried), and *Danshen* (fried) – 2 *qian* each; *Huangqi* (honey-fried), *Baishao* (wine-fried), *Yanhusuo*, and *Chuanxiong* – 1.5 *liang* each; *Guangchenpi* – 5 *qian*; *Xiangfu* (fourfold-processed) – 1 *liang*.\n\nGrind into powder and form into honey pills. Take 3 *qian* each time on an empty stomach with plain hot water. During menstruation, increase the dose by 2 *qian*. If the menses arrive early and are dark purple, switch to a decoction: reduce the honey to 1 *qian* (from 1 *liang*), add 8 *fen* of *Huangqin*, and 3 slices of ginger. Decoct in water and take on an empty stomach, with a second dose before bed. If the menses arrive late and are pale, add 5 *fen* each of *Rougui*, *Shu’ai*, and *Ganjiang*, and 3 slices of fresh ginger; decoct and take. If the menses have not arrived but there is abdominal pain, take 1 *liang* of *Danshen* powder with 2 *qian* of yellow wine, continuing until the menstrual flow ceases. Then resume taking the previous pills as usual.\n\n**Menstruation-Regulating Seed-Jade Pills**\n*Xiangfu* (fourfold-processed) and *Duzhong* (fried with ginger juice) – 8 *liang* each; *Chuanxiong*, *Baishao*, *Danggui* (body), *Gandihuang*, *Chenpi*, *Xiaohuixiang* (wine-fried), *Xuanhusuo* (lightly fried), *Roucongrong* (wine-fried), *Qingpi* (stir-fried with bran), *Wuyao* (fried), *Kuhuangqin* (wine-fried), and *Wuzeigu* (baked with lard) – 4 *liang* each.\n\nGrind into powder, mix with vinegar and flour paste, and form into pills. Take 100 pills each time on an empty stomach with good wine. One variant omits *Dihuang* and *Chenpi*, adding *Renshen* and *Huangqi*.\n\n**Augmented Rehmannia Pills**\n*Shudihuang* – 4 *liang*; *Shanyurou* and *Shanyao* – 2 *liang* each; *Mudanpi* and *Fuling* – 1.5 *liang* each; *Zexie* and *Xiangfu* (processed with boy’s urine) – 1 *liang* each; *Qiai* (veins removed, vinegar-fried) – 5 *qian*.\n\nGrind into powder and form into honey pills. Take 70 pills each time with plain hot water.\n\n**Kunhou Zisheng Pills**\n*Shudihuang* and *Danggui* (wine-steamed) – 4 *liang* each; *Baishao* (wine-fried) – 3 *liang*; *Chuanxiong* (wine-steamed) – 1.5 *liang*; *Danshen* (wine-steamed) – 3 *liang*; *Chongweizi* (wine-steamed) – 4 *liang*; *Xiangfu* (fourfold-processed: soaked in vinegar, ginger juice, and salt water, then stir-fried) – 1 *liang*; *Baizhu* (4 *liang*, honey-water fried until yellow).\n\nGrind into powder. Boil 8 *liang* of *Yimucao* in equal parts wine and water to make a thick paste, mix with honey, and form into pills. Take 4 *qian* each time on an empty stomach with plain hot water.\n\nIf the menses arrive early with a rapid pulse, indicating heat, add *Shengdihuang* and *Mudanpi*. If the menses arrive late with cold limbs and a slow pulse, indicating cold, add *Rougui*. If there is abdominal pain before the menses, indicating qi stagnation, add *Wuyao* and *Muxiang*. If there is poor appetite, qi deficiency, a pale complexion, and weakness in the limbs, indicating dual deficiency of qi and blood, reduce *Xiangfu* in the formula by half and add *Renshen*, *Huangqi*, *Fushen*, *Yuanzhirou*, and *Suanzaoren*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "《秘本种子金丹》[清]叶天士　着 秘本种子金丹卷上 种子总论 生人之道，始于求子。 而求子之法，不越乎男养精、女养血两大关键。 盖阳精溢泻而不竭，阴血时下而无愆，阴阳交畅，精血合凝，胚胎结而生育滋矣。 若阳虚不能下施于阴，阴亏不能上承夫阳，阴阳抵牾，精血乖离，是以无子。 主治之法，男当益其精而节其欲，使阳道之常健； 女当养其血而平其气，使月事以时下。 交相培养，有子之道也。 世人不察，方且推生克于五行，蕲补食于药尔。 以伪胜真，以人夺天，虽孕而不育，育而不寿者多矣。 种子脉诀 求子之脉，专责于尺。 右尺偏旺，火动好色； 左尺偏旺，阴虚非福。 惟沉滑匀易为生息。 微涩精清，兼迟冷极； 若见微懦，入房无力； 女不好生，亦尺脉涩。 相女有法 求子者必先择女，犹种植必先择地。 盖砂砾之场，难期稻黍； 而薄福之妇，安望熊罴？ 故为后嗣计，不可不选择也。 大都妇人之质，贵静而贱动，贵重而贱轻，贵厚而贱薄，贵苍而贱嫩。 故唇短嘴小者不堪，此子嗣之部位也； 耳小轮薄者不堪，此肾气之外候也； 声细而不振者不堪，此丹田之气本也； 形体薄弱者不堪，此藏蓄之宫城也； 饮食纤细者不堪，此仓禀血海之源也； 发焦齿豁者不堪，肝亏血而肾亏精也； 睛露臀削者不堪，藏不藏而后无后也； 山根、唇口多青气者不堪，阳不胜阴，必多肝脾之滞逆也； 脉见紧数弦涩者不堪，必真阴亏弱，经候不调而乏生生之气也。 他如未笄之女，阴气未完； 欲盛之妇，所生多女。 性情和者，调经自易； 性情妒者，月水不匀。 相貌恶者形重； 容颜美者福薄。 肉肥胜骨者，脂满子宫； 骨瘦如柴者，子宫无血。 又有虎头熊颈、蜂目豺声、横面竖眉者，必多刑克。 发悍奸险、阴恶刻薄者，均不利于子嗣。 求嗣者不可不急讲也。 子嗣专责男子 子嗣有无之责，全归男子； 而世俗专主妇人，此不通之论也。 《易》曰：坤道其顺乎承天而时行。 夫坤之生物，不过顺承乎天，则母之生子，亦不过顺承乎父而已，安可以妇人为主耶？ 若以妇人为主，试观富贵之家，侍妾已多，其中岂无经水当期而无病者乎？ 有已经前夫频频生育，而娶以图其易者，顾亦不能得胎； 更遣与他人，转盼生子者，岂不能受孕于此，而能受孕于彼乎？ 是以子嗣之有无，责专男子。 无论老少强弱，俱要神足，神足全凭寡欲，寡欲则不妄交合，积气储精，待时而动，一举而成。 世人不察，以小产专责之母，不育专付之儿，寿天专诿之数，不亦谬乎？ 盖少年生子多有羸弱者，欲勤而精薄也； 老年生子反多强壮者，欲少而精全也。 又交接时，不可大肆出入，密密揉之可也。 若大肆出入，胎风自不能免矣。 故年老人得子，多不受风者，为不能大肆出入故也。 又受胎后切不可再与之交，一恐伤胎暗产，一恐生子胎毒为患也。 是男子必先自治，而后及妇人则几矣。 种子必先养精 种子之法，男子必先养精，女子必先养血。 今人之无子者，往往勤于色欲。 岂知施泄无度，阳精必薄； 纵欲适情，真气乃伤。 妄欲得子，其能孕乎？ 夫男主乎施，女主乎受，一施一受，胎孕乃成。 今所施者，全非先天浓郁之气，不过后天渣滓之物，纵使阴受可化，而实乏阳施之用矣。",
      "translated_text": "**The Secret Manual of the Golden Elixir for Progeny**\n*By Ye Tianshi of the Qing Dynasty*\n\n**Volume One**\n\n**General Discourse on Progeny**\nThe Dao of human life begins with the pursuit of offspring. The method of seeking progeny does not extend beyond two key principles: men cultivating essence and women nourishing blood. When yang essence overflows without exhaustion and yin blood descends in due time without fault, yin and yang harmonize, essence and blood coalesce, and the embryo forms, giving rise to life. If yang is deficient and cannot descend to meet yin, or yin is depleted and cannot ascend to receive yang, yin and yang oppose each other, essence and blood diverge, and thus there is no child.\n\nThe method of treatment: men should replenish their essence and moderate their desires to maintain the vigor of the yang path; women should nourish their blood and balance their qi to ensure menstruation occurs in its proper time. Through mutual cultivation, the Dao of having children is achieved.\n\nYet people fail to examine this, instead attributing success or failure to the five phases, seeking supplementation through food and medicine. They allow the artificial to overcome the natural, human effort to usurp heaven’s work—thus, though conception may occur, many children do not survive, or if they do, do not live long.\n\n**Pulse Diagnosis for Progeny**\nIn seeking progeny, the pulse is chiefly assessed at the *chi* position. If the right *chi* is overly strong, fire stirs and lust prevails; if the left *chi* is overly strong, yin is deficient and misfortune follows. Only a deep, slippery, and even pulse is conducive to conception. A faint and rough pulse indicates thin essence; if accompanied by slowness, it signifies extreme cold. If the pulse is weak and timid, one lacks strength for intercourse. In women who struggle to conceive, the *chi* pulse is also rough.\n\n**Methods for Selecting a Woman**\nThose who seek progeny must first choose a woman, just as planting requires selecting the right soil. For how can one expect a bountiful harvest from rocky ground? And how can one hope for noble offspring from a woman of meager fortune? Thus, for the sake of descendants, one cannot neglect selection.\n\nGenerally, a woman’s constitution values stillness over restlessness, heaviness over lightness, thickness over thinness, and maturity over youthfulness. Therefore:\n- Those with short lips and small mouths are unfit—this pertains to the region of progeny;\n- Those with small, thin ears are unfit—this is an external sign of kidney qi;\n- Those with weak, faint voices are unfit—this reflects the foundation of *dantian* qi;\n- Those with frail bodies are unfit—this indicates a weak palace of storage;\n- Those with delicate appetites are unfit—this suggests a deficient source of the blood sea and granary;\n- Those with brittle hair and missing teeth are unfit—this signifies liver blood and kidney essence depletion;\n- Those with protruding eyes and narrow hips are unfit—their organs fail to store, and they will have no descendants;\n- Those with greenish hues at the bridge of the nose or around the mouth are unfit—yang cannot overcome yin, leading to stagnation and counterflow in the liver and spleen;\n- Those with tight, rapid, wiry, or rough pulses are unfit—their true yin is weak, their menstrual cycles irregular, and their vital generative qi lacking.\n\nOther considerations:\n- Girls who have not yet reached maturity lack fully developed yin qi;\n- Women with excessive desires tend to bear more daughters;\n- Those with gentle temperaments find menstrual regulation easier;\n- Those with jealous natures have irregular menses;\n- Those with harsh appearances are heavy in form;\n- Those with beautiful faces often have thin fortune;\n- Those with flesh that overwhelms their bones have fat-clogged wombs;\n- Those as thin as firewood have bloodless wombs.\n\nFurthermore, women with tiger-like heads, bear-like necks, wasp-like eyes, jackal-like voices, or crosswise faces and vertical brows are prone to harming their children. Those who are fierce, treacherous, or cruel are equally unfavorable for progeny. Those seeking descendants must urgently attend to these matters.\n\n**The Sole Responsibility of Men for Progeny**\nThe responsibility for having or lacking offspring lies entirely with men; yet世俗俗见 often place the burden solely on women—this is an ignorant view.\n\nThe *Book of Changes* states: *\"The way of Kun is to follow heaven and act in its time.\"* The generation of life by Kun is nothing more than following heaven; thus, a mother’s bearing of children is merely following the father. How can women be considered the primary factor?\n\nIf women were the primary factor, consider the households of the wealthy, where concubines abound—among them, are there not those whose menses arrive on time and who are free of illness? Some take women who have borne children frequently with previous husbands, hoping for ease, yet they still fail to conceive. But when these same women are given to others, they promptly bear children. How can they fail to conceive with one man yet succeed with another? Thus, the presence or absence of offspring rests solely with men.\n\nRegardless of age or strength, men must have abundant spirit, which depends entirely on moderating desire. By moderating desire, they avoid reckless intercourse, accumulate qi, store essence, and act at the proper time—thus, conception is achieved in one attempt.\n\nYet世俗俗见 attribute miscarriages solely to the mother, childlessness to the child, and longevity or early death to fate—is this not absurd?\n\nGenerally, children born to young men are often weak due to frequent desire and thin essence; children born to older men are often robust because their desires are few and their essence complete.\n\nDuring intercourse, one must not engage in vigorous thrusting; gentle, subtle movements suffice. If one thrusts vigorously, the fetus will inevitably suffer from wind. Thus, children born to older men are often free of wind because they cannot engage in vigorous thrusting.\n\nAfter conception, one must absolutely avoid further intercourse—first, to prevent hidden miscarriage, and second, to avoid the child being afflicted by fetal toxins.\n\nThus, men must first cultivate themselves before attending to women—only then can success be achieved.\n\n**Cultivating Essence as the Foundation of Progeny**\nThe method of seeking progeny requires men to first cultivate essence and women to first nourish blood. Yet those who lack children often indulge excessively in lust. How can they not know that unrestrained ejaculation thins yang essence, and indulging desire injures true qi? How can they hope for conception through reckless desire?\n\nMen govern emission, women govern reception; through one emission and one reception, conception is achieved. Yet what is emitted today is not the thick, primordial qi of the pre-heaven, but merely the dregs of the post-heaven. Even if yin can transform what is received, it lacks the function of yang’s emission.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1255,
      "start_sentence": 0,
      "end_sentence": 71,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.67213416099548,
      "metadata": {
        "source_file": "dao\\藏外\\秘本种子金丹.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "故求嗣者，毋伤于思虑，毋耗其心神，毋意驰于外而内虚，毋志伤于内而外驳，毋以酒为色媒，毋以药而助火。 清心寡欲，安神惜精，静气日久，气足神完，依时而动，其一点先天之真精生气，勃然随阳之痿而溢出，自万举而万当矣。 《内经》云：阴平阳秘，精神乃治； 阴阳离决，精气乃绝。 老子曰：必清必静，毋摇尔精。 《人镜经》曰：精气盛则生二男。 盖谓此也。 养精须寡欲 种子之法，古人言之不少，如《广嗣诀》以经期方止，子宫正开，宜及时布种； 《道藏经》以月信止后，单日属阳成男，偶日属阴成女； 李东垣以经断一二日感者成男，四五日感者成女； 朱丹溪以受气于左子宫为男，受气于右子宫为女； 《圣济经》以左动成男，右动成女； 《褚氏遗书》以血裹精成男，精裹血成女。 诸说纷纷，各成其是，而终无十全之效。 所谓效获十全者，寡欲是也。 寡欲则不妄交合，聚精会神，待时而动，亦何求而不得欤？ 然寡欲必先清心，心主血而藏神，心有所动，神即外驰，外虽未泄，精已离宫，即肾气亦随之而内乱，轻则梦遗、淋浊，重则杨梅、结毒。 即幸而获免，其于交会之际，毫无静一清宁之真气，所泄之物，尽是腐浊而已，安能化育成胎哉？ 心为一身之主，诚能扫尽邪思，兼用静工存养，无令火动，俟阳精充实，依时而合，一举而成。 是以寡欲则神完，不惟多子，抑亦多寿。 养精须节劳 夫精成于血，不独房劳损吾之精，凡日用事物之间，其伤吾精者甚多：如目劳于视，则血以视耗； 耳劳于听，则血以听耗； 心劳于思，则血以思耗。 吾随时而节之，而血得其养而与日俱积矣。 养精须息怒 肾主闭藏，肝主疏泄，二脏皆有相火，而其系上属于心。 心，君火也。 怒则伤肝而相火动，动则疏泄者用事，而闭藏者不得其职，虽不交合，亦暗流而潜耗矣。 养精须戒酒 饮食之类，人之脏腑，各有所宜，似不必过为拘执，惟酒为不宜。 盖胎种先天之气，极宜清楚，极宜充实，而酒性淫热，非惟乱性，亦且乱精。 精为酒乱，则湿热其半、真精其半耳。 精不充实，胎元不固； 精多湿热，则他日痘疹、惊风、脾败之患，率已基于此矣。 故求嗣者必严戒之，与其多饮，不如少饮； 与其少饮，犹不如不饮，此胎元之大机也。 若醉后入房，精荡而随薄矣。 养精须慎味 经曰：精不足者，补之以味。 然肥浓之味，不能生精； 惟淡薄之味，乃能补精耳。 夫万物皆有真味，调和胜则真味失，不论荤素，蒸煮得法，自有一种冲和恬淡之气，食之自能养精。 盖食物甚多，惟五谷为得五味之正。 故煮粥饭熟后，上面有厚汁融成一团者，皆米之精液所聚也，食之骤能生精，试之有效。 人能行是数者，非特为求嗣之良方，亦可为摄生之妙术矣。 炼精之法 炼精全在肾家下手。 内肾一窍名关元，外肾一窍名牝户。 真精未泄，乾体未破，则外肾阳气至子时而兴。 人身之气与天地之气相应，精泄体破，而人身阳生之后渐迟，有迟至丑、迟至寅，且有迟至卯而始生者，更有终不生者，始与天地不应矣。 炼之之诀，须于夜半子时披衣起坐，两手搓极热，一手将外肾兜住，一手按脐心，而凝神于内肾，久久行之，而精旺矣。 君相二火须知",
      "translated_text": "Thus, those seeking progeny must not harm themselves through excessive thought, nor deplete their heart and spirit. They must not let their intent wander outward, leaving the interior hollow, nor let their will be damaged within, rendering the exterior weak. They must not use wine as an aphrodisiac, nor rely on drugs to stoke the fire. By calming the heart and reducing desire, settling the spirit and treasuring essence, and cultivating stillness over time, qi becomes abundant and spirit complete. Acting in accord with the proper time, that single drop of pre-heaven’s true essence—vital qi—will surge forth with the flaccidity of yang, and success will be certain in every attempt.\n\nThe *Inner Canon* states: \"When yin is balanced and yang is secure, spirit and essence are well-ordered; when yin and yang part and separate, essence and qi are cut off.\" Laozi said: \"Be clear, be still, and do not disturb your essence.\" The *Mirror of Man* says: \"When essence and qi are abundant, two sons are born.\" These all refer to this principle.\n\n**Nurturing Essence Requires Reducing Desire**\nThe methods of seeking progeny have been discussed extensively by the ancients. The *Broad Principles of Progeny* advises that when the menstrual period has just ceased and the womb is open, one should timely sow the seed. The *Daoist Canon* holds that after the cessation of menstruation, conception on odd days pertains to yang and results in a male, while on even days it pertains to yin and results in a female. Li Dongyuan believed that conception one or two days after menstruation results in a male, while four or five days after results in a female. Zhu Danxi taught that receiving qi in the left womb produces a male, while in the right womb produces a female. The *Sacred Aid Canon* states that movement on the left results in a male, while on the right results in a female. The *Master Chu’s Posthumous Writings* asserts that blood enveloping essence forms a male, while essence enveloping blood forms a female. Though these theories abound and each has its merits, none achieves perfect efficacy. The method that yields complete success is none other than reducing desire. With reduced desire, one does not engage in reckless union but gathers essence and spirit, acting in accord with the proper time—what could one not attain?\n\nYet reducing desire must begin with calming the heart. The heart governs blood and stores spirit; when the heart is stirred, the spirit scatters outward. Though no emission occurs externally, essence has already departed its palace, and kidney qi follows, becoming internally disordered. In mild cases, this leads to nocturnal emissions or turbid urine; in severe cases, it results in syphilis or toxic swellings. Even if one is fortunate enough to avoid these, during intercourse there will be no true qi of stillness and unity, and what is emitted will be nothing but putrid filth—how can it transform and nurture a fetus?\n\nThe heart is the master of the body. If one can sweep away wayward thoughts and cultivate stillness, preventing the fire from stirring, then when yang essence is full and the time is right, conception will be achieved in a single act. Thus, reducing desire preserves the spirit, and not only does it lead to many children, but also to longevity.\n\n**Nurturing Essence Requires Moderating Labor**\nEssence is formed from blood, and it is not only sexual labor that depletes one’s essence—many daily activities also cause harm. When the eyes are strained by sight, blood is consumed by seeing; when the ears are strained by hearing, blood is consumed by listening; when the heart is strained by thought, blood is consumed by thinking. If one moderates these at all times, blood will be nourished and accumulate day by day.\n\n**Nurturing Essence Requires Curbing Anger**\nThe kidneys govern storage, and the liver governs dispersion; both organs contain ministerial fire, and their systems are connected above to the heart. The heart is the sovereign fire. Anger injures the liver and stirs the ministerial fire, causing the dispersing function to dominate while the storing function fails in its duty. Even without intercourse, essence is silently and subtly depleted.\n\n**Nurturing Essence Requires Abstaining from Alcohol**\nAmong foods and drinks, each has its suitability for the organs, and one need not be overly restrictive—except in the case of alcohol. The qi of pre-heaven that forms the fetal seed must be utterly clear and fully substantial, yet the nature of alcohol is lewd and heating. It not only disturbs the mind but also disrupts essence. When essence is disturbed by alcohol, half becomes damp-heat, and only half remains true essence. If essence is not substantial, the fetal origin is unstable; if essence is laden with damp-heat, future ailments such as pox, convulsions, or spleen failure will likely have their roots here. Thus, those seeking progeny must strictly abstain from alcohol. If one must drink, better to drink less than more; and better still not to drink at all—this is the great mechanism of the fetal origin. If one enters the bedchamber while drunk, essence will be agitated and thin.\n\n**Nurturing Essence Requires Care in Diet**\nThe *Inner Canon* states: \"When essence is insufficient, supplement it with flavor.\" Yet rich and heavy flavors cannot generate essence; only bland and light flavors can truly nourish it. All things possess their true flavor, but excessive seasoning obscures it. Whether meat or vegetables, when prepared properly, they naturally possess a harmonious and tranquil qi, and consuming them will naturally nurture essence. Among foods, the five grains alone embody the proper balance of the five flavors. Thus, when congee or rice is fully cooked, the thick liquid that forms on the surface is the concentrated essence of the grain. Consuming it quickly replenishes essence—this has been proven effective.\n\nThose who practice these several methods will find them not only an excellent way to seek progeny but also a wondrous art for preserving life.\n\n**The Method of Refining Essence**\nRefining essence begins with the kidneys. The inner kidney has an aperture called the *Guanyuan*, and the outer kidney has an aperture called the *Pinhu*. Before true essence is emitted and the qian body is broken, the yang qi of the outer kidney rises at the *zi* hour. The qi of the human body corresponds to the qi of heaven and earth. Once essence is emitted and the body is broken, the onset of yang in the body gradually delays—sometimes to the *chou* hour, sometimes to the *yin*, or even to the *mao* hour before it arises. In some cases, it never arises at all, and thus the body no longer corresponds to heaven and earth.\n\nThe secret to refining essence lies in rising at midnight during the *zi* hour, donning clothes, and sitting upright. Rub both hands until extremely hot, then use one hand to cup the outer kidney while the other presses the navel, focusing the spirit on the inner kidney. Practicing this over time will cause essence to flourish.\n\n**The Sovereign and Ministerial Fires Must Be Understood**",
      "overlap_context": "cessively in lust. How can they not know that unrestrained ejaculation thins yang essence, and indulging desire injures true qi? How can they hope for conception through reckless desire?\n\nMen govern emission, women govern reception; through one emission and one reception, conception is achieved. Yet what is emitted today is not the thick, primordial qi of the pre-heaven, but merely the dregs of the post-heaven. Even if yin can transform what is received, it lacks the function of yang’s emission.",
      "start_char": 1255,
      "end_char": 2508,
      "start_sentence": 72,
      "end_sentence": 125,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.98185634613037,
      "metadata": {
        "source_file": "dao\\藏外\\秘本种子金丹.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "百火在心，心，其君主也； 相火在肾，肾，其根本也。 然二火相因，无声不应。 故心宜静，不静则火由欲动而自心挑肾。 先心后肾者，以阳烁阴，出乎勉强，勉强则气降而丹田失守，已失元阳之大本。 肾宜足，肾足则阳从地起而由肾及心。 先肾后心者，以火济火，本乎自然，自然则气升而百脉齐到，斯诚化育之真机。 故轻薄之夫，每从勉强，故多犯虚劳，不利子嗣； 忠厚之士，常有自然，故品物咸亨，何虑后人？ 求嗣者，亦务阳道之真机则得矣。 男女情兴 男女和悦，彼此情动而后行之，则阳施阴受而胚胎成，是以有子。 若男情已至，而女心未动，则玉体才交，琼浆先吐，阳精虽施而阴不受矣； 若女情已至，而男志或异，则桃浪徒翻，玉露未滴，阴血虽开而阳无入矣。 阴阳乖离，成天地不交之否，如之，何能生万物哉？ 论种子时候 天地生物，必有＃之时； 万物化生，必有乐育之候。 猫犬至微，将受孕也，其雌必狂乎而奔跳，以＃乐育之气，触之而不能自止耳。 此天地之节候，化生之真机也。 妇人于经尽之后，必有一日子宫内挺出莲花蕊子，气蒸而热，神昏而闷，有欲交接不可忍之状，此受精结胎之候也。 于此时逆而取之则成丹，顺而取之则成胎。 但妇人每含羞不肯言耳，男子须预告之，令其自言，则一举即中矣。 进火妙诀 玉湖须浅泛【浅则女美】，重载却成忧【深则女伤】，阴血先参聚【女血先来】，阳精向后流【男精后至】，红花含玉露【血裹精则生男】，平步到瀛洲【直上成胎】。 （整理者注：【　】内原文为小字） 男有三至",
      "translated_text": "The hundred fires reside in the heart, and the heart is their sovereign; the ministerial fire resides in the kidney, and the kidney is their root. Yet the two fires are mutually dependent, responding without sound. Thus, the heart should be still—if not, fire stirs from desire and moves from the heart to provoke the kidney. Those who prioritize the heart over the kidney scorch yin with yang through force, and force causes qi to descend, losing hold of the cinnabar field and forfeiting the great foundation of primordial yang. The kidney should be replete, for when the kidney is full, yang rises from the earth and ascends from kidney to heart. Those who prioritize the kidney before the heart nurture fire with fire in accordance with nature, and nature allows qi to rise so that the hundred vessels arrive in unison—this is the true mechanism of transformation and nurturance. Thus, frivolous men often resort to force and frequently suffer depletion and taxation, harming their descendants; steadfast and sincere gentlemen naturally follow the Way, so all things flourish—why worry for their posterity? Those seeking offspring must also grasp the true mechanism of the yang path.\n\n**The Arising of Passion Between Man and Woman**\nWhen man and woman are harmonious and joyful, and passion arises in both before union, yang bestows and yin receives, forming an embryo and thus bearing a child. If the man’s passion has arisen but the woman’s heart remains unmoved, their jade bodies may join, yet the jade nectar flows prematurely—yang essence is bestowed, but yin does not receive it. If the woman’s passion has arisen but the man’s intent wavers, the peach waves surge in vain, and the jade dew does not drip—yin blood opens, but yang has nothing to enter. When yin and yang are discordant, they become the *pi* of heaven and earth not joining; how then can the ten thousand things be born?\n\n**On the Timing of Conception**\nHeaven and earth generate beings only at a certain time; the ten thousand things transform and give life only at a season of nurturance. Even the lowly cat and dog, when about to conceive, will have the female run and leap wildly, for the qi of nurturance stirs them so they cannot restrain themselves. This is the seasonal node of heaven and earth, the true mechanism of transformation and life. After a woman’s menstruation ends, there will be a day when a lotus pistil emerges from within the palace of the child, steam rising and heat surging, spirit clouded and stifled, with an irresistible urge for union—this is the moment for receiving essence and forming an embryo. If one acts against it, elixir is formed; if one follows it, an embryo is conceived. Yet women often conceal this out of shame, so the man must inform her in advance and have her speak of it herself—then one attempt will succeed.\n\n**The Wondrous Secret of Advancing Fire**\nThe jade lake should be lightly traversed—shallow crossing delights the woman, while heavy burden brings her harm. Yin blood gathers first, and yang essence flows afterward. When the red flower embraces the jade dew, one strides to the immortal isles. *(When blood envelops essence, a son is born; ascending directly forms an embryo.)*\n\n**The Three Arrivals of the Man**",
      "overlap_context": "t arises. In some cases, it never arises at all, and thus the body no longer corresponds to heaven and earth.\n\nThe secret to refining essence lies in rising at midnight during the *zi* hour, donning clothes, and sitting upright. Rub both hands until extremely hot, then use one hand to cup the outer kidney while the other presses the navel, focusing the spirit on the inner kidney. Practicing this over time will cause essence to flourish.\n\n**The Sovereign and Ministerial Fires Must Be Understood**",
      "start_char": 2509,
      "end_char": 3138,
      "start_sentence": 126,
      "end_sentence": 152,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.067036151885986,
      "metadata": {
        "source_file": "dao\\藏外\\秘本种子金丹.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "男女未交之时，男有三至者，谓：阳道奋昂而振者，肝气至也； 壮大而热者，心气至也； 坚劲而久者，肾气至也。 三至俱足，女心之所悦也。 若痿而不举，肝气未至也，肝气未至而强合，则伤其筋，其精流滴而不射矣； 壮而不热者，心气未至也，心气未至而强合，则伤其血，其精清冷而不暖矣； 坚而不久者，肾气未至也，肾气未至而强合，则伤其骨，其精不出，虽出亦少矣。 求嗣者，所贵寡欲清心，以养肝心肾之气也。 女有五至 男妇未交之时，女有五至者：面上赤起，眉靥乍生，心气至也； 眼光涎涩，送情斜视，肝气至也； 低头不语，鼻中涕出，肺气至也； 交颈相偎，其身自动，脾气至也； 玉户开张，琼浆浸润，肾气至也。 五气俱至，男子方与之合，而行九浅一深之法，则情洽意美，无不成胎矣。 女有五伤 交合之时，女有五伤：一、阴户尚闭不开，不可强刺，强刺则伤肝； 二、女兴已动，男或不从，兴过始交则伤心，致经不调； 三、以少阴而遇老阳，玉茎不坚而易软，女情不畅则伤肝，必至盲目； 四、经水未尽，男强逼合则伤肾； 五、男子酒醉交战，茎物坚硬，久刺不止，女情已过，阳兴不休则伤脾。 五伤之候，安得有子？ 女有五候",
      "translated_text": "Before union, a man exhibits three arrivals: when the yang path is vigorous and erect, this is the arrival of liver qi; when it is robust and hot, this is the arrival of heart qi; when it is firm, strong, and enduring, this is the arrival of kidney qi. When all three arrivals are complete, they delight the woman’s heart. If it is flaccid and fails to rise, liver qi has not arrived—forced union at this time injures the sinews, and his essence will drip without ejaculation. If it is robust but not hot, heart qi has not arrived—forced union injures the blood, and his essence will be thin and cold. If it is firm but not enduring, kidney qi has not arrived—forced union injures the bones, and his essence will not emerge, or if it does, will be scant. Those seeking offspring must value moderation of desire and clarity of mind to nurture the qi of liver, heart, and kidney.\n\nBefore union, a woman exhibits five arrivals: when her face flushes red and her brows crease, this is the arrival of heart qi; when her eyes grow moist and she casts sidelong glances, this is the arrival of liver qi; when she lowers her head in silence and her nose runs, this is the arrival of lung qi; when she nestles close and her body stirs of its own accord, this is the arrival of spleen qi; when the jade gate opens and jade nectar flows, this is the arrival of kidney qi. When all five qi arrive, the man may then unite with her, employing the method of nine shallow and one deep thrusts—thus their passion harmonizes, their intent is fulfilled, and conception is assured.\n\nDuring union, a woman suffers five injuries: first, if the yin gate remains closed and unopened, it must not be forcibly pierced—forced piercing injures the liver; second, if the woman’s arousal has stirred but the man does not comply, and union occurs only after her ardor has passed, this injures the heart and disrupts menstruation; third, if a young yin encounters an aged yang, and the jade stem is not firm but easily softens, the woman’s desire will not flow freely—this injures the liver and may lead to blindness; fourth, if menstrual blood has not fully ceased and the man forces union, this injures the kidneys; fifth, if the man, drunk, engages in battle with a jade stem hard and unyielding, thrusting relentlessly even after the woman’s passion has waned and his yang ardor persists, this injures the spleen. With these five injuries, how can there be a child?\n\nFive Signs in Women",
      "overlap_context": " inform her in advance and have her speak of it herself—then one attempt will succeed.\n\n**The Wondrous Secret of Advancing Fire**\nThe jade lake should be lightly traversed—shallow crossing delights the woman, while heavy burden brings her harm. Yin blood gathers first, and yang essence flows afterward. When the red flower embraces the jade dew, one strides to the immortal isles. *(When blood envelops essence, a son is born; ascending directly forms an embryo.)*\n\n**The Three Arrivals of the Man**",
      "start_char": 3139,
      "end_char": 3624,
      "start_sentence": 153,
      "end_sentence": 175,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.120002508163452,
      "metadata": {
        "source_file": "dao\\藏外\\秘本种子金丹.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "娇吟低语，心也； 合目不开，肝也； 咽干气喘，肺也； 两足或屈或伸，仰卧如尸，脾也； 口鼻气冷，阴户沥出沾滞，肾也。 五者快美之极，男子识其情而采之，不独有子，且有补助之益。 迟速异势 阴阳情质，禀有不齐，精固者常迟，精不固者常速。 迟者嫌速，则犹饥待食，及咽不能； 速者畏迟，则犹醉添杯，欲吐不得。 迟速不侔，何以成胎？ 故以迟遇速，宜出奇由径，勿逞先声； 以速遇迟，宜静以自恃，挑而后战，则适逢其会矣。 强弱殊情 阳强阴弱，则畏如蜂虿，避如戈矛； 阳弱阴强，则闻风而靡，望尘而北； 强弱相凌，而势不能敌，何以受孕？ 然扶弱有道，必居仁由义，务得其心。 克强固难，非聚精会神，安夺其魄？ 诚得此法以治之，则强不足畏、弱不足虑矣。 童稚不孕 方苞方萼，生气未舒； 甫童甫笄，天癸未裕。 曾见有未实之粒可为种，未足之蚕可为茧乎？ 强费心力，即曰姑矣。 异日其年衰者，其能待乎？ 是坐失其时而已矣。 交合避忌 男女交合，古法当避丙丁日及弦晦日、朔望日。 然为艰嗣者计，似可不拘，若大风、大雨、大雷、大雾、严寒、酷暑以及天地晦冥、日月薄蚀、虹霓地震之际，此天地之震怒，四时不正之气，犯则损男百倍，令女多病，纵然有子，亦必癫痴、顽愚、喑哑、聋聩、挛跛、盲眇、多病症、短寿、不孝不仁，此其宜避忌者一也。 又日月星光之下，庙宇佛寺之中，井灶圊厕之侧，冢墓户枢之傍，以及沉阴危险之地，皆不可犯，此其宜避忌者二也。 夫交合知避，则有福德大智善神降宅胎中，乃令性行和顺，家道日隆，非惟少疾，亦必聪明俊秀而多寿； 若不避忌，则愚痴奸诡恶人来宅胎中，乃令性行凶险，家道日消，非惟残疾，亦必飞灾横祸。 而天枉祸福之应，验如影响，可不慎欤？ 暗产须防 胎元初成，形如珠露，此其橐无依，根无地，巩之则固，决之则流。 故凡受胎之后，极宜节欲，以防泛溢。 而少年纵情，罔知忌惮，往往恃强而不败，或既败而复战。 当此之时，主方欲静，客不肯休，无奈狂徒，敲门撞户，顾彼水性热肠，有不启扉而从随流而逝者乎？ 斯时也，落花与粉蝶齐飞，火枣共交梨并逸，合污同流，已莫知昨日孕而今日堕矣，朔日孕而望日堕矣。 随孕随堕，本无形迹。 盖明产胎已成形，小产必觉； 而暗产胎仍似水直溜，何知？ 故家多无大产，以小产之多也； 娶娼妓者多无子，悉以其子宫滑而惯于小产也。 余尝见世之艰嗣者，问其阳事，则曰惯战； 问其功夫，则曰尽通； 问其意况，则怨叹曰：人皆有子，我独无夫？ 岂知人之明产而己之暗产耶？ 此外如受胎三五七月而每有堕者，虽衰弱之妇多有之，然必由纵欲不节，致伤母气而堕者为尤多也。 故凡恃强过勇者多无子，以强弱之自相残也； 纵肆不节者多不育，以盗伤胎元之气也，岂悉由妇人之罪哉？ 求嗣者思患而预防之，则庶乎其可矣。 畜妾之法 无故置妾，大非美事，凡诸败坏，无不由之。 若年老妻衰，无后为大，则势有不得不置者。 然置之易，而畜之难，则畜贵得其法也。 一则不可过严。 盖主母见妾，大都非所乐从，是以或多嗔怒，或多骂詈，或因事责其起居，或假借加以声色，是皆常情之所必至者。",
      "translated_text": "Soft moans and whispered words—this is the heart; closed eyes that do not open—this is the liver; parched throat and labored breath—this is the lungs; legs now bent, now stretched, lying supine as if a corpse—this is the spleen; cold breath from mouth and nose, with slippery fluid seeping from the jade gate—this is the kidneys. When these five signs reach the height of bliss, if the man recognizes her state and gathers her essence, not only will there be a child, but also the benefit of mutual nourishment.\n\n**Differing Paces in Yin and Yang**\nThe nature of yin and yang, their essence and disposition, are not uniform: those whose essence is firm tend to be slow, while those whose essence is unsteady tend to be swift. The slow, if hurried, are like the hungry awaiting food, yet unable to swallow when it arrives; the swift, if delayed, are like the drunk offered another cup, longing to vomit but unable. When swift and slow do not match, how can conception occur? Thus, when slow meets swift, one should take an unexpected path, avoiding a premature display; when swift meets slow, one should remain composed, provoking before engaging—then the encounter will be perfectly timed.\n\n**Disparities in Strength**\nWhen yang is strong and yin weak, she may fear it like a wasp’s sting or avoid it like a spear’s thrust; when yang is weak and yin strong, she may yield at the mere rustle of wind or flee at the sight of dust. If strength and weakness clash without balance, how can conception take place? Yet to support the weak, one must act with benevolence and righteousness, ensuring her heart is won. To overcome the strong is difficult—without gathering essence and spirit, how can one seize her soul? Truly, with this method, the strong need not be feared, nor the weak a concern.\n\n**Childlessness in the Young**\nA bud just opening, its vital qi not yet unfurled; a girl just reaching maidenhood, her heavenly water not yet abundant. Have you ever seen an unripe grain become seed, or an undersized silkworm spin a cocoon? To force the matter is to waste effort—even if one persists for now, can the aged wait? This is merely squandering the proper time.\n\n**Avoidances in Union**\nIn the union of man and woman, ancient methods dictate avoiding the days of bing and ding, the crescent and waning moons, and the new and full moons. Yet for those struggling to conceive, such restrictions may be overlooked. However, during great winds, heavy rains, thunderstorms, dense fogs, bitter cold, scorching heat, or when heaven and earth are dark and murky—during eclipses, rainbows, or earthquakes—these are times of heaven and earth’s wrath, when the qi of the four seasons is unbalanced. To couple then harms the man a hundredfold, sickens the woman, and even if a child is conceived, it will surely be afflicted with epilepsy, stupidity, muteness, deafness, paralysis, blindness, chronic illness, short life, or a lack of filial piety and benevolence. This is the first set of avoidances.\n\nMoreover, one must not couple beneath the light of the sun, moon, or stars; within temples or Buddhist monasteries; beside wells, stoves, latrines, or privies; near tombs, doorways, or thresholds; or in dark, perilous places. This is the second set of avoidances. If one knows to avoid these times and places, then spirits of fortune, virtue, great wisdom, and goodness will descend to dwell in the womb, bestowing a child of harmonious nature, whose family will prosper daily. Not only will they be free of illness, but they will also be intelligent, handsome, and long-lived. If one does not avoid these taboos, then foolish, deceitful, and wicked spirits will enter the womb, resulting in a child of violent and treacherous nature, whose family will decline daily. Not only will they suffer disabilities, but they will also face sudden calamities. The correspondence of fortune and misfortune from heaven is as swift as an echo—how can one not be cautious?\n\n**Guarding Against Silent Miscarriage**\nWhen the embryo first forms, its shape is like a dewdrop—its vessel unsupported, its root without ground. If steadied, it will take hold; if disturbed, it will flow away. Thus, after conception, one must strictly moderate desire to prevent overflow. Yet the young, indulging their passions without restraint or fear, often rely on their strength and do not falter—or, having faltered, resume the battle. At such times, the host (the woman) seeks stillness, but the guest (the man) refuses to cease. What can be done with such a reckless intruder, pounding at the door? With her watery nature and ardent disposition, how can she not open the gate and follow the current away? At that moment, fallen blossoms fly with butterflies, fire-dates and intertwined pears scatter together—mingling in filth and flowing away. Unaware, yesterday’s conception becomes today’s miscarriage, the new moon’s conception becomes the full moon’s loss. Conceived and lost in secret, with no trace left behind.\n\nFor a visible miscarriage, the fetus has already taken shape, and the loss is felt; but a silent miscarriage is like water slipping away—how can one know? Thus, many households have no full-term births because of frequent silent miscarriages. Those who marry courtesans often have no children, for their wombs are slippery and accustomed to such losses.\n\nI have often seen those who struggle to conceive: when asked about their yang affairs, they say they are accustomed to battle; when asked about their skill, they claim mastery; when asked about their situation, they sigh and lament, *\"Everyone has children—why do I alone have none?\"* How would they know that others have visible births while theirs are silent losses?\n\nAdditionally, some women miscarry at three, five, or seven months—though this is more common among the weak, it is often caused by unrestrained desire, injuring the mother’s qi and leading to miscarriage. Thus, those who rely on brute strength often have no children, for strength and weakness destroy each other; those who indulge without restraint often fail to bear offspring, for they plunder the embryo’s vital qi. How can this all be blamed on the woman? Those seeking descendants should anticipate these dangers and guard against them—then, perhaps, success may follow.\n\n**The Method of Keeping Concubines**\nTo take a concubine without cause is far from virtuous—all manner of ruin stems from this. Yet if one is aged, the wife is barren, and there is no heir, then circumstances may leave no choice. However, acquiring a concubine is easy; keeping her is difficult—and keeping her requires proper method.\n\nFirst, one must not be overly strict. When the wife sees the concubine, she is hardly pleased. Thus, she may often scold, curse, or find fault with her conduct, or use harsh words and stern expressions—these are the inevitable reactions of human nature.",
      "overlap_context": " stem is not firm but easily softens, the woman’s desire will not flow freely—this injures the liver and may lead to blindness; fourth, if menstrual blood has not fully ceased and the man forces union, this injures the kidneys; fifth, if the man, drunk, engages in battle with a jade stem hard and unyielding, thrusting relentlessly even after the woman’s passion has waned and his yang ardor persists, this injures the spleen. With these five injuries, how can there be a child?\n\nFive Signs in Women",
      "start_char": 3625,
      "end_char": 4878,
      "start_sentence": 176,
      "end_sentence": 234,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.10539269447327,
      "metadata": {
        "source_file": "dao\\藏外\\秘本种子金丹.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "而不知产育由于气血，气血由于情怀，情怀不畅则冲任受伤，冲任受伤则胎孕不受，故畜之不可过严也。 一则妾室宜静、宜远、宜少近耳目者为妙。 盖私媾之顷，男子宜锐，女子宜受，一锐一受皆由于气。 当此之时，专则气聚而直前，是以宜子； 怯则气馁而则不摄，何以成胎？ 然勇怯之由，其惧在心，心之所至，气亦至焉。 心有疑惧则心不至，即气不至矣。 倘临期惊有所闻，则气在耳而不及器矣； 疑有所见，则气在目而不及器矣； 或愤或畏，则气结在心而不至器矣。 气有不至，则如石授水，而水则无知也。 且两阵交锋，最嫌奸细之侦伺，一心无二，何堪谗间以相离？ 此妾室所以贵乎静且远也。 然此二法，亦不过为锦囊无奈者设耳，倘有高明贤淑，惟宗祧是虑，不惟不妒而且相怜，则愈近愈慰，而远之之说，岂近人情？ 苟其不然，则虽有畜之之名，而终无畜之之实，虽置妾何益哉？ 种子药食宜慎 种子之方，本无定轨，因人而药，各有所宜。 寒者宜温，热者宜凉，滑者宜涩，虚者宜补，去其所偏，则阴阳和而生化着，是即种子之奇方也。 今人不知此理而但只传方，岂宜于彼者亦宜于此也？ 且或见一人偶中，而不论己之宜否，而偏听如神，竟相制服，一若张冠李可戴也？ 况所传种子之方，大抵兴阳壮热之品居多，甚至锻炼金石，及制取毒秽悍劣诸物，炫诡矜奇，但助房中之乐，不顾伤身之祸，求嗣者所宜慎也。 男子艰嗣病源疾病之关于胎孕者，男子则在精，女子则在血，无非不足而然。 男子之不足，则有精滑、精清、精冷，或临事不坚，或流而不射，或梦遗频数，或便浊淋涩。 或好女色以致阴虚，阴虚则腰肾痛惫； 或好男风以致阳极，阳极则亢而亡阴； 或过于强固，强固则胜败不洽； 或素患阴疝，阴疝则肝肾乖离。 此外，或以阳衰，阳衰则多寒； 或以阴虚，阴虚则多热。 是皆男子之病，不得尽诿之妇人也。 倘得其源而医治之，则事无不济矣。 妇人不孕病源 妇人所重在血，血能媾精，胎孕乃成。 欲察其病，惟于经后见之； 欲治其病，惟于阴分调之。 盖经即血也，血即阴也，阴以应月，故月月如期，此其常也。 及其为病，则有或先或后者，有一月两至者，有两月一至者，有枯绝不通者，有频来不止者，有先痛而后行者，有先行而后痛者，有淡色、紫色、黑色者，有瘀而无条为片者，有精血不充而化作白带者，有元气下陷而变为崩漏者，有子宫虚冷而阳气不能生化者，有血中伏热而阴气不能凝成者，有血气瘕、子脏不收、月水不通者，皆真阴之病也主治之法，详载调经上下二卷。 夫真阴既病，则阴血不足者，不能育胎，阴气不足者，不能摄胎。 摄育之权总在命门，以命门为冲任之血海，而胎以血为主，血不自生，而又以气为主，是皆真阴为谓也。 故凡补命门，或气或血，皆可谓之补阴。 而补阴之法，即培根固本之道也。 凡自壮自老，乃人人之不可缺也，而况为先天、后天之肇基，舍是无以用其力矣。 是以调经种子之法，亦惟以填补命门、顾惜阳气为主。 然精血之都在命门，而精血之源又在二阳心脾之间。 盖心主血，养心则养血，脾胃主饮食，健脾胃则气布，二者胥和，则气畅血行。 此情志、饮食又当先经血而为之计者，无非补阴之源也。",
      "translated_text": "Yet they fail to understand that childbirth depends on qi and blood, and qi and blood depend on the state of the mind. When the mind is not at ease, the Chong and Ren meridians are injured; when the Chong and Ren meridians are injured, the womb cannot conceive. Thus, one must not be overly strict in keeping a concubine.\n\nSecond, the concubine’s quarters should be quiet, secluded, and removed from frequent observation. For in the moment of private union, the man should be vigorous, and the woman receptive—both vigor and receptivity arise from qi. At such a time, if the mind is focused, qi gathers and advances directly, thus favoring conception. If timid, qi falters and fails to be retained—how then can a fetus form? Yet the root of courage or timidity lies in the heart; where the heart goes, qi follows. If the heart harbors doubt or fear, it does not fully engage, and qi does not arrive. Should one be startled by some sound at the critical moment, qi lingers in the ears and does not reach the generative organs; if distracted by some sight, qi remains in the eyes and does not reach them. Or if anger or dread arises, qi becomes knotted in the heart and fails to arrive. When qi does not arrive, it is like casting a stone into water—the water remains unmoved.\n\nMoreover, when two forces engage in battle, nothing is more harmful than spies lurking to observe; with a single, undivided mind, how can one endure slander and estrangement? This is why the concubine’s quarters must be quiet and secluded.\n\nYet these two methods are but makeshift measures for those with no better recourse. If one is blessed with a wise and virtuous wife who thinks only of continuing the ancestral line, harboring no jealousy and even showing compassion, then the closer the concubine, the greater the comfort—and how can seclusion be humane? If not, then though one may keep a concubine in name, in truth one does not, and what benefit is there in having her?\n\n**Caution in Medicines and Diet for Progeny**\nThere is no fixed formula for begetting offspring, for remedies must be tailored to the individual. The cold-natured require warming, the hot-natured cooling; the slippery require astringency, the deficient require tonification. Correcting imbalances harmonizes yin and yang, and life flourishes—this is the wondrous method of begetting children. Yet people today, ignorant of this principle, merely pass down formulas, assuming what suits one will suit all. Or seeing one person succeed by chance, they blindly follow, heedless of their own needs, and recklessly prepare and consume such medicines—as if a hat made for Zhang could fit Li.\n\nMoreover, most formulas for begetting offspring rely heavily on substances that invigorate yang and generate heat, even to the point of refining minerals and metals or concocting toxic, foul, or harsh ingredients. These are flaunted as marvels, enhancing bedroom pleasure while disregarding the harm to the body—those seeking descendants should beware.\n\n**Causes of Male Infertility**\nThe illnesses that hinder conception relate to essence in men and blood in women, both stemming from insufficiency. In men, insufficiency manifests as seminal weakness: essence may be slippery, thin, or cold; one may lack firmness at the crucial moment, or ejaculate without force; one may suffer from frequent nocturnal emissions, turbid urine, or painful strangury. Or one may indulge excessively in women, leading to yin deficiency, which causes lumbar and renal pain and fatigue. Or one may indulge in male-male relations, leading to extreme yang, which exhausts yin. Or one may be overly forceful, disrupting harmony in the act. Or one may suffer from chronic genital swelling, which disrupts the liver and kidneys. Additionally, some men are afflicted with yang deficiency, which causes coldness, or yin deficiency, which causes heat. These are all male disorders and cannot be blamed entirely on women. If the root cause is identified and treated, success will follow.\n\n**Causes of Female Infertility**\nFor women, blood is paramount, for blood unites with essence to form a fetus. To diagnose infertility, observe the condition after menstruation; to treat it, regulate the yin aspect. Menstruation is blood, and blood is yin, which corresponds to the moon—thus, monthly cycles are normal. When illness arises, however, menstruation may come early or late, twice in a month, or once every two months; it may cease entirely or flow incessantly. There may be pain before or after bleeding; the color may be pale, purple, or black; the flow may be clotted and formless, or scanty due to insufficient essence and blood, turning into leukorrhea. There may be collapse of original qi, leading to flooding and spotting; or deficiency-cold in the uterus, preventing yang qi from generating life; or hidden heat in the blood, preventing yin qi from congealing. There may be blood stasis or qi masses, uterine prolapse, or amenorrhea—all are disorders of true yin.\n\nThe methods of treatment are detailed in the two volumes on regulating menstruation. When true yin is diseased, insufficient yin blood cannot nurture a fetus, and insufficient yin qi cannot retain it. The power of retention and nurturance lies in the Gate of Life, for it is the sea of blood for the Chong and Ren meridians, and the fetus is governed by blood. Yet blood does not generate itself but depends on qi—thus, true yin is paramount. Therefore, tonifying the Gate of Life, whether with qi or blood, can be called tonifying yin. The method of tonifying yin is the way of strengthening the root and securing the foundation.\n\nFrom youth to old age, this is indispensable for all, and all the more so as the foundation of both prenatal and postnatal life—without it, one cannot exert one’s strength. Thus, the methods of regulating menstruation and begetting offspring focus on replenishing the Gate of Life and preserving yang qi.\n\nYet the storehouse of essence and blood lies in the Gate of Life, while their source resides between the two yang organs, the heart and spleen. The heart governs blood—nourishing the heart nourishes blood; the spleen and stomach govern food and drink—fortifying them ensures the distribution of qi. When both are harmonized, qi flows and blood circulates. Thus, regulating emotions and diet should precede the regulation of menstruation—all are means of replenishing the source of yin.",
      "overlap_context": "us—all manner of ruin stems from this. Yet if one is aged, the wife is barren, and there is no heir, then circumstances may leave no choice. However, acquiring a concubine is easy; keeping her is difficult—and keeping her requires proper method.\n\nFirst, one must not be overly strict. When the wife sees the concubine, she is hardly pleased. Thus, she may often scold, curse, or find fault with her conduct, or use harsh words and stern expressions—these are the inevitable reactions of human nature.",
      "start_char": 4878,
      "end_char": 6118,
      "start_sentence": 235,
      "end_sentence": 280,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.66343402862549,
      "metadata": {
        "source_file": "dao\\藏外\\秘本种子金丹.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "使不知本末先后而妄为之治，则乌足以言调经种子之法。 种子误治辨明 阳精之施，阴血能摄，精成其子，血成其胞，胎孕乃成。 今妇人无子，皆由血少不能摄精。 血少固非一端，然必调补阴血，使无亏欠，乃可成胎。 俗医不察，悉谓子宫虚冷，投以辛热之药，煎熬脏腑，血气沸腾，经来必转紫黑，渐成衰少，始则饮食骤进，久则口苦而干，诸证蜂起，焉能成胎？ 纵然有子，亦多不寿。 男子阴虚艰嗣男子真阴不足，不能滋养营卫，渐生衰弱，或虚势往来、自汗盗汗，或神不守舍、血不归原，或虚损伤阴，或遗淋不禁，或气虚昏晕，或眼花耳聋，或口燥舌干，或腰酸腿软。 凡精髓内亏、津液枯涸等证，均宜速补左肾之真阴，宜左归丸。 左归丸熟地黄八两，捣膏　山药姜汁炒　枸杞子　山茱萸去核　鹿胶炒珠　龟胶炒珠　菟丝子制，各四两　川牛膝酒蒸，三两上为末，蜜丸桐子大，食前淡盐汤送下百丸。 若真阴失守、虚火炎上者，宜用纯阴至静之品，去枸杞、鹿胶，加女贞子、麦冬各三两； 火烁肺金，干枯多嗽者，加百合三两； 夜热骨蒸，加地骨皮三两； 小水不利、不清，加茯苓三两； 大便燥结，去菟丝子，加肉苁蓉三两； 气虚，加人参四两； 血虚微滞，加当归四两； 腰膝酸痛，加杜仲盐水炒三两； 脏平无火而气不充者，去龟胶，加破故纸三两，莲肉去心、胡桃肉各四两。 男子精少艰嗣 精少者，虽能射入而精必衰薄。",
      "translated_text": "Should one proceed with treatment without understanding the root and branch, the sequence of priority, how could one speak of methods for regulating menstruation and begetting offspring?\n\n**Discerning Misguided Treatment in Begetting Offspring**\nWhen yang essence is emitted, yin blood can secure it; essence forms the child, blood forms the womb, and thus conception is achieved. Now, when women are childless, it is invariably due to insufficient blood failing to secure essence. Blood deficiency arises from many causes, yet only by regulating and supplementing yin blood to ensure no depletion can conception occur. Common physicians, failing to examine closely, uniformly attribute it to deficiency-cold in the uterus, administering acrid and hot medicinals that sear the viscera, causing blood and qi to surge and boil. Menstruation then turns dark purple or black, gradually diminishing in volume. Initially, appetite may surge, but over time, the mouth becomes bitter and dry, and a host of disorders arises—how then can conception occur? Even if a child is born, it is seldom long-lived.\n\n**Male Yin Deficiency and Difficulty in Begetting Offspring**\nWhen a man’s true yin is insufficient, it cannot nourish the constructive and defensive qi, gradually giving rise to debility. This may manifest as intermittent fevers, spontaneous sweating, or night sweats; as the spirit failing to guard its abode and blood failing to return to its origin; as depletion damaging yin; as seminal loss or dribbling urinary incontinence; as qi deficiency leading to dizziness; as blurred vision or deafness; as dry mouth and parched tongue; or as aching lumbus and weak legs. For all conditions involving internal depletion of essence and marrow or desiccation of fluids, one must swiftly supplement the true yin of the left kidney. The *Zuogui Pill* is indicated:\n\n**Zuogui Pill**\n*Shudihuang* (prepared rehmannia root), 8 *liang*, pounded into paste\n*Shanyao* (Chinese yam), stir-fried with ginger juice\n*Gouqizi* (goji berry)\n*Shanzhuyu* (cornelian cherry), kernels removed\n*Lujiao jiao* (deerhorn glue), stir-fried to pearls\n*Guijiao* (tortoise plastron glue), stir-fried to pearls\n*Tusizi* (Chinese dodder seeds), prepared, each 4 *liang*\n*Chuan niuxi* (Sichuan achyranthes root), wine-steamed, 3 *liang*\n\nGrind the above into powder, form into honey pills the size of *tongzi* seeds, and take one hundred pills before meals with a mild salt solution.\n\nIf true yin is unsecured and deficiency fire flames upward, use purely yin and supremely tranquil ingredients: remove *gouqizi* and *lujiao jiao*, and add *nüzhenzi* (glossy privet fruit) and *maidong* (dwarf lilyturf root), each 3 *liang*. If fire scorches the Metal phase (lung) causing dryness and frequent coughing, add *baihe* (lily bulb), 3 *liang*. For night fevers and steaming bones, add *digupi* (Chinese wolfberry root bark), 3 *liang*. For inhibited or turbid urination, add *fuling* (poria), 3 *liang*. For dry and bound stool, remove *tusizi* and add *roucongrong* (desert cistanche), 3 *liang*. For qi deficiency, add *renshen* (ginseng), 4 *liang*. For mild blood deficiency with stagnation, add *danggui* (Chinese angelica root), 4 *liang*. For aching lumbus and knees, add *duzhong* (eucommia bark), salt-water stir-fried, 3 *liang*. If the viscera are harmonious without fire but qi is not full, remove *guijiao* and add *poguzhi* (psoralea fruit), 3 *liang*, *lianrou* (lotus seed), kernels removed, and *hutaorou* (walnut kernel), each 4 *liang*.\n\n**Male Essence Deficiency and Difficulty in Begetting Offspring**\nWhen essence is scant, though it may be emitted, it is invariably weak and thin.",
      "overlap_context": "ving yang qi.\n\nYet the storehouse of essence and blood lies in the Gate of Life, while their source resides between the two yang organs, the heart and spleen. The heart governs blood—nourishing the heart nourishes blood; the spleen and stomach govern food and drink—fortifying them ensures the distribution of qi. When both are harmonized, qi flows and blood circulates. Thus, regulating emotions and diet should precede the regulation of menstruation—all are means of replenishing the source of yin.",
      "start_char": 6118,
      "end_char": 6676,
      "start_sentence": 281,
      "end_sentence": 301,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.718721389770508,
      "metadata": {
        "source_file": "dao\\藏外\\秘本种子金丹.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "盖胞胎之口大张，而些少之入，何能餍足？ 势必随入随出矣。 宜固本丸。 固本丸　菟丝子酒制　熟地黄酒蒸捣　干地黄酒浸捣　天门冬去心，酒浸　麦门冬去心酒浸　五味子　茯神各四两　淮山药微炒，三两　莲肉去皮心　人参去芦　枸杞子各二两 上为末，蜜丸梧子大，每服八九十丸，淡盐汤下。 男子诸虚百损，肌肉消瘦，耳聋目暗，宜无比山药丸。 无比山药丸　山药二两　菟丝子三两　五味炼，六两　肉苁蓉四两，酒浸　杜仲酒炒，三两　牛膝酒浸，蒸　熟地黄　泽泻　山茱萸　茯苓　巴戟肉　赤石子各一两 上为末，蜜丸，每服五十丸，食前米饮下。 男子精薄艰嗣 男子嗜欲不节，施泄太多，以致肾虚精薄，不能直射子宫，宜梦熊丸。 梦熊丸　　黄芪蜜炙，四两　黄鱼鳔胶蛤粉炒珠，一片　沙苑蒺藜马乳浸蒸、熟焙八两 上为末，蜜丸，每服八十丸，空心温酒下。 男子精滑艰嗣 男子精气不固，或梦遗频数，或便浊淋漓、遗泄太多，是以无子。 宜种子丹。 种子丹　　莲须拣金色者，四两　山茱萸去核，三两　覆盆子二两，去蒂　龙骨煅，水飞，五钱　芡实米四两　沙苑蒺藜取净末，四两，再筛极细末二两入药，仍有粗末用水熬膏 上为末，熟蜜四两，和蒺藜膏为丸，空心淡盐汤下。 男子精清艰嗣 男子精气清冷，或房劳过伤，以致肾水欠旺，不能直射子宫，宜固本健阳丹。 固本健阳丹　　熟地黄　山茱萸各三两　巴戟肉二两　菟丝子拣净　川续断酒浸　远志肉制　蛇床子炒，各两半　茯神　山药酒蒸　牛膝酒洗　杜仲酒洗，断丝　当归身酒洗　肉苁蓉酒浸　五味子　益智仁盐水炒　鹿茸酥炙，各一两　枸杞子三两　人参二两 上为末，蜜丸梧子大，空心盐汤下，卧再服。 男子精冷艰嗣 男子阳旺则能直射子宫。 若阳痿精冷，宜菟丝丸； 若肾气不能通利，宜五子衍宗丸。 菟丝丸　　菟丝子酒浸、蒸 研末，雀卵清为丸，梧子大，每服七十丸，空心温酒下。 若年至五十而阳痿者，菟丝子一片，加天雄四两，面裹煨熟，去皮脐，童便制为末，同丸服之尤效。 五子衍宗丸　　枸杞子八两　菟丝子酒煮，八两　五味子一两　覆盆子去蒂，四两　车前子炒，二两 为末，蜜丸，空心白汤下九十丸。 男子精寒艰嗣 男子精寒，肾中之精寒也。 精虽射入子宫，而元阳不足，则阴无以化，是以不孕，孕而多女也。 宜毓麟珠。 毓麟珠　　熟地黄　当归　菟丝子制，各四两　淮山药姜汁制　枸杞子　胡桃肉　巴戟肉　鹿角胶　鹿角霜　杜仲酒炒　山茱萸去核　川椒去目　人参　白术　茯苓　白芍酒炒，各二两　川芎　炙甘草各一两 上为末，蜜丸梧子大，空心白汤下，每服七八十丸。 男子虚寒艰嗣 男子脾肾虚寒，饮食少思，发热盗汗，遗精白浊，真气亏损，肌体瘦弱等证，宜还少丹。 还少丹　熟地黄四两　山药　山茱萸　杜仲姜汁制　枸杞子各二两　牛膝酒浸　远志姜汁浸，炒　肉苁蓉酒浸　北五味　川续断　楮实子　舶茴香　菟丝子制　巴戟肉各一两 上为末，蜜丸，每服五十丸，空心淡盐汤下。 男子阳痿艰嗣 男子年迈乏嗣，阳痿精衰，不能酣战，以动女之欢心，或临炉而兴已阑，或对垒而戈忽倒。 女子之春心正浓，而男子之浩叹顿起，何以玉种蓝田耶？",
      "translated_text": "For the cervix of the womb is widely open, and the scant essence that enters—how could it suffice to fill it? Of necessity, it must enter and exit in the same instant. The **Firming the Root Pill** is indicated.\n\n**Firming the Root Pill**\n*Tusizi* (dodder seed), wine-prepared – 4 *liang*\n*Shudihuang* (prepared rehmannia), wine-steamed and mashed – 4 *liang*\n*Gandihuang* (dried rehmannia), wine-soaked and mashed – 4 *liang*\n*Tianmendong* (asparagus root), heart removed, wine-soaked – 4 *liang*\n*Maimendong* (ophiopogon root), heart removed, wine-soaked – 4 *liang*\n*Wuweizi* (schisandra fruit) – 4 *liang*\n*Fushen* (poria with hostwood) – 4 *liang*\n*Huaishanyao* (Chinese yam), lightly stir-fried – 3 *liang*\n*Lianrou* (lotus seed), skin and heart removed – 2 *liang*\n*Renshen* (ginseng), rootlets removed – 2 *liang*\n*Gouqizi* (goji berry) – 2 *liang*\nGrind into powder, form into honey pills the size of *wuzi* seeds. Take eighty to ninety pills per dose, with bland salt water.\n\nFor all types of deficiency and depletion in men, emaciation, deafness, and dim vision, the **Incomparable Chinese Yam Pill** is indicated.\n\n**Incomparable Chinese Yam Pill**\n*Shanyao* (Chinese yam) – 2 *liang*\n*Tusizi* (dodder seed) – 3 *liang*\n*Wuweizi* (schisandra fruit), processed – 6 *liang*\n*Roucongrong* (desert cistanche), wine-soaked – 4 *liang*\n*Duzhong* (eucommia bark), wine-stir-fried – 3 *liang*\n*Niuqi* (achyranthes root), wine-soaked and steamed – 1 *liang*\n*Shudihuang* (prepared rehmannia) – 1 *liang*\n*Zexie* (alisma rhizome) – 1 *liang*\n*Shanzhuyu* (cornus fruit) – 1 *liang*\n*Fuling* (poria) – 1 *liang*\n*Bajitou* (morinda root) – 1 *liang*\n*Chishizi* (red halloysite) – 1 *liang*\nGrind into powder, form into honey pills. Take fifty pills per dose before meals, with rice water.\n\n**Thin Essence and Difficulty in Begetting Offspring**\nWhen a man’s indulgence in desire is unrestrained and his emissions are excessive, kidney deficiency and thin essence result, preventing the essence from directly entering the womb. The **Dreaming of Bears Pill** is indicated.\n\n**Dreaming of Bears Pill**\n*Huangqi* (astragalus), honey-prepared – 4 *liang*\n*Huangyubiaojiao* (yellow croaker swim bladder glue), stir-fried with clamshell powder until pearl-like – 1 piece\n*Shayuanjili* (tribulus fruit), steamed with mare’s milk and sun-dried – 8 *liang*\nGrind into powder, form into honey pills. Take eighty pills per dose on an empty stomach, with warm wine.\n\n**Slippery Essence and Difficulty in Begetting Offspring**\nWhen a man’s essence and qi are unconsolidated, with frequent nocturnal emissions or turbid urine dripping incessantly, or excessive seminal leakage, he will be unable to father children. The **Progeny Elixir** is indicated.\n\n**Progeny Elixir**\n*Lianxu* (lotus stamen), select golden-colored – 4 *liang*\n*Shanzhuyu* (cornus fruit), pits removed – 3 *liang*\n*Fupenzi* (raspberry), stems removed – 2 *liang*\n*Longgu* (dragon bone), calcined and water-ground – 5 *qian*\n*Qianshimi* (euryale seed) – 4 *liang*\n*Shayuanjili* (tribulus fruit), sifted to obtain fine powder – 4 *liang*; resift to obtain 2 *liang* of the finest powder for the formula, while the coarser powder is decocted into a paste\nGrind into powder, mix with 4 *liang* of prepared honey and the *jili* paste to form pills. Take on an empty stomach with bland salt water.\n\n**Clear Essence and Difficulty in Begetting Offspring**\nWhen a man’s essence and qi are clear and cold, or when excessive bedroom exertion injures him, kidney water becomes insufficient and cannot directly enter the womb. The **Firming the Root and Strengthening Yang Elixir** is indicated.\n\n**Firming the Root and Strengthening Yang Elixir**\n*Shudihuang* (prepared rehmannia) – 3 *liang*\n*Shanzhuyu* (cornus fruit) – 3 *liang*\n*Bajitou* (morinda root) – 2 *liang*\n*Tusizi* (dodder seed), cleaned – 1.5 *liang*\n*Chuanxuduan* (dipsacus root), wine-soaked – 1.5 *liang*\n*Yuanzhirou* (polygala root), processed – 1.5 *liang*\n*Shechuangzi* (cnidium seed), stir-fried – 1.5 *liang*\n*Fushen* (poria with hostwood) – 1 *liang*\n*Shanyao* (Chinese yam), wine-steamed – 1 *liang*\n*Niuqi* (achyranthes root), wine-washed – 1 *liang*\n*Duzhong* (eucommia bark), wine-washed until fibers break – 1 *liang*\n*Danggui* (Chinese angelica root), wine-washed – 1 *liang*\n*Roucongrong* (desert cistanche), wine-soaked – 1 *liang*\n*Wuweizi* (schisandra fruit) – 1 *liang*\n*Yizhiren* (alpinia fruit), salt-water stir-fried – 1 *liang*\n*Lurong* (deer velvet), lard-fried – 1 *liang*\n*Gouqizi* (goji berry) – 3 *liang*\n*Renshen* (ginseng) – 2 *liang*\nGrind into powder, form into honey pills the size of *wuzi* seeds. Take on an empty stomach with salt water; take again before bed.\n\n**Cold Essence and Difficulty in Begetting Offspring**\nWhen a man’s yang is vigorous, he can directly ejaculate into the womb. If yang is impotent and essence is cold, the **Dodder Seed Pill** is indicated. If kidney qi cannot flow smoothly, the **Five-Seed Progeny Pill** is indicated.\n\n**Dodder Seed Pill**\n*Tusizi* (dodder seed), wine-soaked, steamed, and ground into powder, then formed into pills with sparrow egg white, the size of *wuzi* seeds. Take seventy pills per dose on an empty stomach, with warm wine.\nFor those over fifty with yang impotence, add 4 *liang* of *tianxiong* (aconite), wrapped in dough and baked until cooked; remove the skin and navel, process with boy’s urine, grind into powder, and form pills with the *tusizi* powder. This is especially effective.\n\n**Five-Seed Progeny Pill**\n*Gouqizi* (goji berry) – 8 *liang*\n*Tusizi* (dodder seed), wine-cooked – 8 *liang*\n*Wuweizi* (schisandra fruit) – 1 *liang*\n*Fupenzi* (raspberry), stems removed – 4 *liang*\n*Cheqianzi* (plantain seed), stir-fried – 2 *liang*\nGrind into powder, form into honey pills. Take ninety pills per dose on an empty stomach, with plain boiled water.\n\n**Cold Essence and Difficulty in Begetting Offspring**\nWhen a man’s essence is cold, the essence within the kidneys is cold. Though it may enter the womb, if original yang is insufficient, yin cannot be transformed, resulting in infertility or a predominance of daughters. The **Fostering Unicorns Pearl** is indicated.\n\n**Fostering Unicorns Pearl**\n*Shudihuang* (prepared rehmannia) – 4 *liang*\n*Danggui* (Chinese angelica root) – 4 *liang*\n*Tusizi* (dodder seed), prepared – 4 *liang*\n*Huaishanyao* (Chinese yam), ginger juice-prepared – 2 *liang*\n*Gouqizi* (goji berry) – 2 *liang*\n*Hutaorou* (walnut kernel) – 2 *liang*\n*Bajitou* (morinda root) – 2 *liang*\n*Lujiaojiao* (deer antler glue) – 2 *liang*\n*Lujiaoshuang* (deer antler frost) – 2 *liang*\n*Duzhong* (eucommia bark), wine-stir-fried – 2 *liang*\n*Shanzhuyu* (cornus fruit), pits removed – 2 *liang*\n*Chuanjiao* (Sichuan pepper), eyes removed – 2 *liang*\n*Renshen* (ginseng) – 2 *liang*\n*Baizhu* (white atractylodes) – 2 *liang*\n*Fuling* (poria) – 2 *liang*\n*Baishao* (white peony root), wine-stir-fried – 2 *liang*\n*Chuanxiong* (ligusticum root) – 1 *liang*\n*Zhigancao* (honey-fried licorice) – 1 *liang*\nGrind into powder, form into honey pills the size of *wuzi* seeds. Take seventy to eighty pills per dose on an empty stomach, with plain boiled water.\n\n**Deficiency-Cold and Difficulty in Begetting Offspring**\nFor men with spleen-kidney deficiency-cold, poor appetite, fever, night sweats, seminal emission, white turbidity, depletion of true qi, and emaciation, the **Returning to Youth Elixir** is indicated.\n\n**Returning to Youth Elixir**\n*Shudihuang* (prepared rehmannia) – 4 *liang*\n*Shanyao* (Chinese yam) – 2 *liang*\n*Shanzhuyu* (cornus fruit) – 2 *liang*\n*Duzhong* (eucommia bark), ginger juice-prepared – 2 *liang*\n*Gouqizi* (goji berry) – 2 *liang*\n*Niuqi* (achyranthes root), wine-soaked – 1 *liang*\n*Yuanzhi* (polygala root), ginger juice-soaked and stir-fried – 1 *liang*\n*Roucongrong* (desert cistanche), wine-soaked – 1 *liang*\n*Beiwuwei* (northern schisandra fruit) – 1 *liang*\n*Chuanxuduan* (dipsacus root) – 1 *liang*\n*Chushizi* (paper mulberry fruit) – 1 *liang*\n*Bohuixiang* (fennel) – 1 *liang*\n*Tusizi* (dodder seed), prepared – 1 *liang*\n*Bajitou* (morinda root) – 1 *liang*\nGrind into powder, form into honey pills. Take fifty pills per dose on an empty stomach, with bland salt water.\n\n**Yang Impotence and Difficulty in Begetting Offspring**\nWhen an older man lacks offspring due to yang impotence and essence depletion, unable to engage in vigorous intercourse to arouse the woman’s passion—whether his ardor wanes at the crucial moment or his weapon falters mid-battle—the woman’s spring heart burns bright, while the man’s sighs arise in vain. How then can jade seeds be sown in the blue fields?",
      "overlap_context": "nggui* (Chinese angelica root), 4 *liang*. For aching lumbus and knees, add *duzhong* (eucommia bark), salt-water stir-fried, 3 *liang*. If the viscera are harmonious without fire but qi is not full, remove *guijiao* and add *poguzhi* (psoralea fruit), 3 *liang*, *lianrou* (lotus seed), kernels removed, and *hutaorou* (walnut kernel), each 4 *liang*.\n\n**Male Essence Deficiency and Difficulty in Begetting Offspring**\nWhen essence is scant, though it may be emitted, it is invariably weak and thin.",
      "start_char": 6676,
      "end_char": 8013,
      "start_sentence": 302,
      "end_sentence": 344,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 50.72895431518555,
      "metadata": {
        "source_file": "dao\\藏外\\秘本种子金丹.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "宜赞育丹。 赞育丹　熟地黄八两，蒸捣　白术蜜炙，八两　当归　枸杞子各六两　杜仲酒炒　仙茅酒蒸，一日　巴戟肉甘草汤炒　山茱萸去核　淫羊霍羊脂拌炒　肉苁蓉酒洗去甲　韭子炒黄，各四两　蛇床子微炒　附子制熟　肉桂各二两 上为末，蜜丸服，或加人参、鹿茸更妙。 男子阳虚艰嗣 男子元阳不足，或先天禀衰，或劳伤过度，以致命门火衰，不能生土，而为脾胃虚寒。 饮食少进，或呕恶膨胀，或反胃噎膈，或怯畏寒冷，或脐腹疼痛，或大便不实、泻利频作，或小水自遗、虚淋、寒疝，或寒侵谷而肢节痹痛，或寒在下焦而水邪浮肿。 总之，真阳不足者，必神疲气怯，或心跳不宁，或四体不收，或眼见邪祟，或阳衰无子，皆宜速培右肾之元阳，宜右归丸。 右归丸　熟地黄八两，捣膏　山药姜汁炒　枸杞子微炒　鹿角胶炒珠　菟丝子制　杜仲姜汁炒，四两　当归　山萸肉各三两　肉桂　附子制熟，各三两 上为末，蜜丸弹子大，每早嚼服二丸，白汤下。 如阳衰气虚，加人参五、六两。 阳虚精滑或带浊、便溏，去当归，加补骨脂炒； 飧泄不止，加北五味肉、豆蔻面炒去油各三两； 饮食减少，或不易消化，呕恶吞酸，皆脾胃虚寒之证，加干姜炒黄三两； 腹痛不止，加吴茱萸汤泡、炒二两； 腰膝酸痛，加胡桃肉连皮四两； 阴虚阳痿，加巴戟肉四两，肉苁蓉酒浸三两，或加黄狗外肾一副，酒煮烂捣入。 男子火盛艰嗣 火盛者，相火太盛。",
      "translated_text": "**Zan Yu Elixir Recommended.**\n**Zan Yu Elixir:**\nPrepared *rehmannia* (steamed and mashed) – 8 *liang*\nHoney-fried *bai zhu* (white atractylodes) – 8 *liang*\n*Danggui* (Chinese angelica) – 6 *liang*\n*Gouqizi* (goji berry) – 6 *liang*\n*Du zhong* (eucommia bark), wine-fried – 4 *liang*\n*Xianmao* (curculigo), wine-steamed for one day – 4 *liang*\n*Bajitou* (morinda root), licorice decoction-fried – 4 *liang*\n*Shanzhuyu* (cornelian cherry), pitted – 4 *liang*\n*Yinyanghuo* (epimedium), mixed with sheep fat and fried – 4 *liang*\n*Roucongrong* (cistanche), wine-washed to remove skin – 4 *liang*\n*Jiǔzǐ* (Chinese leek seed), fried yellow – 4 *liang*\n*Shechuangzi* (cnidium seed), lightly fried – 2 *liang*\nProcessed *fuzi* (aconite) – 2 *liang*\n*Rougui* (cinnamon bark) – 2 *liang*\nGrind into powder, form into honey pills. Alternatively, add *renshen* (ginseng) and *lurong* (deer velvet) for enhanced efficacy.\n\n**Yang Deficiency and Difficulty in Begetting Offspring**\nWhen a man’s primordial yang is insufficient—whether due to congenital weakness or excessive taxation—this leads to debilitation of the *mingmen* fire, which fails to generate earth, resulting in spleen-stomach vacuity cold. Manifestations may include:\nreduced food intake, or nausea, distension, and vomiting;\nregurgitation or dysphagia;\naversion to cold or abdominal pain;\nloose stools or frequent diarrhea;\ninvoluntary urination, vacuity strangury, or cold mounting;\ncold invading the channels, causing limb and joint impediment pain;\nor cold in the lower burner, leading to water qi and edema.\nIn sum, those with true yang insufficiency invariably exhibit:\nspiritual fatigue and qi timidity;\npalpitations or restlessness;\nflaccid limbs;\nhallucinations of malevolent spirits;\nor yang debility and childlessness.\nIn such cases, hasten to fortify the primordial yang of the right kidney. **Right-Restoring Pill** is indicated.\n\n**Right-Restoring Pill:**\nPrepared *rehmannia* (mashed into paste) – 8 *liang*\n*Shanyao* (Chinese yam), ginger juice-fried – 4 *liang*\n*Gouqizi* (goji berry), lightly fried – 4 *liang*\n*Lujiaojiao* (deer antler glue), fried into pearls – 4 *liang*\nPrepared *tusizi* (dodder seed) – 4 *liang*\n*Du zhong* (eucommia bark), ginger juice-fried – 4 *liang*\n*Danggui* (Chinese angelica) – 3 *liang*\n*Shanyurou* (cornelian cherry flesh) – 3 *liang*\n*Rougui* (cinnamon bark) – 3 *liang*\nProcessed *fuzi* (aconite) – 3 *liang*\nGrind into powder, form into honey pills the size of bullets. Chew two pills each morning, taken with bland hot water.\nFor yang debility with qi vacuity, add 5–6 *liang* of *renshen* (ginseng).\nFor seminal efflux or turbid discharge, or loose stools, remove *danggui* and add fried *buguzhi* (psoralea).\nFor unremitting *sun xie* (daybreak diarrhea), add 3 *liang* each of *beiwuwei* (northern schisandra) flesh and *doukou* (cardamom), stir-fried and defatted.\nFor reduced food intake, indigestion, nausea, or acid regurgitation—all signs of spleen-stomach vacuity cold—add 3 *liang* of dry ginger, fried yellow.\nFor unremitting abdominal pain, add 2 *liang* of *wuzhuyu* (evodia), soaked in decoction and fried.\nFor aching lumbus and knees, add 4 *liang* of *hutao* (walnut) meat with skin.\nFor yin vacuity with yang impotence, add 4 *liang* of *bajitou* (morinda root) and 3 *liang* of *roucongrong* (cistanche), wine-soaked. Alternatively, add one pair of yellow dog’s external kidneys, stewed in wine until soft and mashed in.\n\n**Fire Exuberance and Difficulty in Begetting Offspring**\nIn cases of fire exuberance, ministerial fire is excessively effulgent.",
      "overlap_context": "to honey pills. Take fifty pills per dose on an empty stomach, with bland salt water.\n\n**Yang Impotence and Difficulty in Begetting Offspring**\nWhen an older man lacks offspring due to yang impotence and essence depletion, unable to engage in vigorous intercourse to arouse the woman’s passion—whether his ardor wanes at the crucial moment or his weapon falters mid-battle—the woman’s spring heart burns bright, while the man’s sighs arise in vain. How then can jade seeds be sown in the blue fields?",
      "start_char": 8013,
      "end_char": 8591,
      "start_sentence": 345,
      "end_sentence": 362,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.699598789215088,
      "metadata": {
        "source_file": "dao\\藏外\\秘本种子金丹.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "过于久战，则女情已过，男精未施； 及男精施，女兴已败，而安能生育耶？ 宜补阴丸。 补阴丸　　黄柏盐酒炒　知母盐酒炒，各四两　熟地黄酒蒸捣　龟板酥炙，各六两 上为末，用猪脊髓蒸熟，和蜜丸如梧子大，每服五六十丸，空心淡盐汤下。 男子阳极艰嗣 男子相火炽盛，烁伤真阴，以致阳极，阳极则亢； 或者过于强固，强固则胜败不洽，是以无子。 宜延年益嗣丹。 延年益嗣丹　人参三两　天冬酒浸去心，三两　麦冬酒浸去心，三两　熟地黄酒蒸捣　生地黄各二两　茯苓酒浸、晒干，五两　地骨皮酒浸，五两 上加何首乌半斤，米酒浸透，竹刀削去皮，切片置炒锅内，入黑羊肉一片，黑豆三合，量着水上，用甑箅，箅上铺放何首乌，密盖勿令泄气，蒸一二时以肉烂为度，取出晒干，为末，蜜丸梧子大，空心温酒下七八十丸。 男子鸡精艰嗣 男子玉茎包皮柔嫩，少一挨，痒不可当，故每次交合，阳精已泄，阴精未流，名曰鸡精。 宜壮阳汤。 壮阳汤　　蛇床子　地骨皮各等分 煎汤熏洗，并用手擦，但洗时必令其举方妙，若手重擦破，不必惊骇，过一二日即可复旧，一日熏洗数次。 盖取其皮老耐久耳。 妇人虚弱不孕 妇人气血俱虚，经脉不调，或断续，或带浊，或腹痛，或腰酸，或饮食不甘，瘦弱不孕。 宜服毓鳞珠，一二片即可受胎。 凡种子诸方，无以加此。 毓麟珠　人参　白术蜜炙　白芍酒炒，二两　川芎　炙甘草各一两　当归　熟地黄各四两　菟丝子制四两　杜仲酒炒　鹿角霜　川椒去目，各二两 上为末，蜜丸弹子大，空心嚼服一二丸，白汤下。 或作小丸吞服。 如经迟腹痛加破故纸酒炒、肉桂各一两，甚则再加吴茱萸泡炒五钱； 如带多腹痛，加破故纸酒炒一两，北五味五钱，或加龙骨醋煅一两； 如子宫寒甚，或泄或痛，加附子制熟、干姜炮各数钱； 如郁怒，气不顺而为胀、为满者，加香附酒制二两，甚则再加沉香五钱； 如血热多火，经早、内热者，加川续断、地骨皮各二钱，或另以汤剂暂清其火，而后服此； 或以汤引酌，宜送下。 妇人脏寒不孕 妇人五脏虚损，子宫冷惫，赤白带下，盗汗短气，畏寒恶冷，宜续嗣降生丹。 此方无怪诞克伐之品，且温且固，凡血海虚寒者，服之必佳。 但温力有余，补力不足，倘益以人参、白术、熟地黄、川芎、炙甘草各一两，则温补赞育之功非浅鲜也，因名曰加味续嗣降生丹。 续嗣降生丹　当归酒洗　杜仲酒洗　茯神　益智仁　龙骨煅　桂心　吴茱萸汤泡　干姜半生半熟　川椒去目　乌药炒，各一两　白芍酒炒　川牛膝酒浸　制半夏　防风　秦艽　石菖蒲去毛　北细辛　桔梗各五钱　朱砂一钱，用大附子一枚，脐下作窍入朱砂，放内面裹煨熟，取出朱砂为末，去附子，不用研细，水飞，须以此而制之　牡蛎大片者童便浸四十九日，每五日一换，取出，用硫黄一两为末，酒和涂遍，用皮纸糊实，米醋浸湿，外以盐泥固之。 候干用炭五斤，煅为末，每料止用二两，余可收储，留下再用 上为末，酒煮糯米糊丸，梧子大，朱砂为衣，每服三十丸，渐加至八九十丸，空心白汤下。 妇人形肥不孕 痰气盛者体必肥，肥则下体过胖，子宫缩入，难以受精。 即或男茎长健，鼓勇而战，精直而入，而湿由膀胱，必有泛滥之患。",
      "translated_text": "Excessive prolonged intercourse results in the woman’s passion having passed while the man’s essence has yet to be released; by the time the man’s essence is released, the woman’s arousal has already waned—how then can conception occur? The *Buyin Pill* is indicated.\n\n**Buyin Pill**\n*Huangbai* (phellodendron), stir-fried with salted wine; *zhimu* (anemarrhena), stir-fried with salted wine—4 *liang* each\n*Shudihuang* (steamed rehmannia), pounded; *guiban* (tortoise plastron), stir-fried with suet—6 *liang* each\nGrind into powder, mix with steamed pig spinal marrow, and form into honeyed pills the size of *wuzi* seeds. Take 50–60 pills on an empty stomach with bland salt water.\n\n**Male Fire Exuberance and Difficulty in Begetting Offspring**\nWhen ministerial fire in men blazes excessively, it scorches true yin, leading to extreme yang; extreme yang then becomes hyperactive. Alternatively, if one is overly forceful in intercourse, such forcefulness disrupts harmony between dominance and submission, thus preventing conception. The *Yannian Yisi Dan* is indicated.\n\n**Yannian Yisi Dan**\n*Renshen* (ginseng)—3 *liang*\n*Tiandong* (asparagus root), wine-soaked and heart removed—3 *liang*\n*Maidong* (ophiopogon), wine-soaked and heart removed—3 *liang*\n*Shudihuang* (steamed rehmannia), pounded; *shengdihuang* (raw rehmannia)—2 *liang* each\n*Fuling* (poria), wine-soaked and sun-dried—5 *liang*\n*Digupi* (lycium bark), wine-soaked—5 *liang*\nAdd *heshouwu* (fleeceflower root), half a *jin*: soak thoroughly in rice wine, pare off the skin with a bamboo knife, slice, and place in a wok. Add a slice of black sheep meat and 3 *ge* of black soybeans, with enough water to cover. Line a steamer with a bamboo mat, arrange the *heshouwu* on top, seal tightly to prevent steam from escaping, and steam for one to two hours until the meat is tender. Remove, sun-dry, grind into powder, and form into honeyed pills the size of *wuzi* seeds. Take 70–80 pills on an empty stomach with warm wine.\n\n**Male \"Chicken Essence\" and Difficulty in Begetting Offspring**\nIn some men, the foreskin of the jade stem is so tender that the slightest touch induces unbearable itching. Thus, with each act of intercourse, yang essence is already discharged before yin essence flows—this is called \"chicken essence.\" The *Zhuangyang Decoction* is indicated.\n\n**Zhuangyang Decoction**\n*Shechuangzi* (cnidium seed) and *digupi* (lycium bark) in equal parts\nDecoct and use the liquid to steam and wash the affected area, rubbing gently with the hands. During washing, ensure the jade stem is erect for optimal effect. If the skin is rubbed raw, do not be alarmed—it will recover in a day or two. Steam and wash several times daily. The aim is to toughen the skin for greater endurance.\n\n**Female Vacuity Weakness and Infertility**\nWhen a woman’s qi and blood are both vacuous, her menstrual flow is irregular—sometimes ceasing, sometimes accompanied by vaginal discharge, abdominal pain, lumbar soreness, poor appetite, emaciation, and infertility. The *Yulinzhu* is indicated; taking one or two doses may enable conception. Among all formulas for promoting fertility, none surpass this.\n\n**Yulinzhu**\n*Renshen* (ginseng); *baizhu* (atractylodes), honey-fried; *baishao* (peony), wine-fried—2 *liang* each\n*Chuanxiong* (ligusticum); *zhigancao* (honey-fried licorice)—1 *liang* each\n*Danggui* (tangkuei); *shudihuang* (steamed rehmannia)—4 *liang* each\n*Tusizi* (cuscuta), prepared—4 *liang*\n*Duzhong* (eucommia), wine-fried; *lujiaoshuang* (deer antler gelatin); *chuanjiao* (zanthoxylum), with seeds removed—2 *liang* each\nGrind into powder and form into honeyed pills the size of bullets. Chew and take 1–2 pills on an empty stomach with plain boiled water, or form into smaller pills for swallowing.\n- For delayed menstruation with abdominal pain, add *buguzhi* (psoralea), wine-fried, and *rougui* (cinnamon)—1 *liang* each; in severe cases, add *wuzhuyu* (evodia), soaked and fried—5 *qian*.\n- For profuse vaginal discharge with abdominal pain, add *buguzhi* (psoralea), wine-fried—1 *liang*, and *beiwuwei* (schisandra)—5 *qian*; or add *longgu* (dragon bone), calcined with vinegar—1 *liang*.\n- For severe cold in the uterus with diarrhea or pain, add *fuzi* (aconite), prepared, and *ganjiang* (dried ginger), blast-fried—several *qian* each.\n- For depression, qi stagnation causing distension or fullness, add *xiangfu* (cyperus), wine-prepared—2 *liang*; in severe cases, add *chenxiang* (aloeswood)—5 *qian*.\n- For blood heat with excessive fire, early menstruation, or internal heat, add *chuanxuduan* (dipsacus) and *digupi* (lycium bark)—2 *qian* each; or temporarily clear fire with a decoction before taking this formula, or use the decoction as a guiding agent.\n\n**Female Viscus Cold and Infertility**\nWhen a woman’s five viscera are vacuous and debilitated, the uterus becomes cold and enervated, leading to red and white vaginal discharge, night sweats, shortness of breath, aversion to cold, and cold intolerance. The *Xusici Jiangsheng Dan* is indicated. This formula contains no bizarre or harsh ingredients; it is both warming and astringent. For those with vacuity cold in the blood sea, it is highly effective. However, its warming power is ample while its supplementing power is insufficient. If augmented with *renshen* (ginseng), *baizhu* (atractylodes), *shudihuang* (steamed rehmannia), *chuanxiong* (ligusticum), and *zhigancao* (honey-fried licorice)—1 *liang* each—its warming and supplementing effects in promoting fertility would be greatly enhanced. Thus, it is named the *Jiawei Xusici Jiangsheng Dan*.\n\n**Xusici Jiangsheng Dan**\n*Danggui* (tangkuei), wine-washed; *duzhong* (eucommia), wine-washed; *fushen* (poria spirit); *yizhiren* (alpinia); *longgu* (dragon bone), calcined; *guixin* (cinnamon bark); *wuzhuyu* (evodia), soaked in decoction; *ganjiang* (dried ginger), half raw and half cooked; *chuanjiao* (zanthoxylum), with seeds removed; *wuyao* (lindera), fried—1 *liang* each\n*Baishao* (peony), wine-fried; *chuanniuxi* (cyathula), wine-soaked; *zhibanxia* (processed pinellia); *fangfeng* (saposhnikovia); *qinjiao* (gentiana); *shichangpu* (acorus), with hairs removed; *beixixin* (asarum); *jiegeng* (platycodon)—5 *qian* each\n*Cinnabar*—1 *qian*: take one large *fuzi* (aconite), hollow out the base, fill with cinnabar, wrap and bake until cooked. Remove the cinnabar, discard the *fuzi*, grind the cinnabar into fine powder, and refine with water.\n*Muli* (oyster shell)—select large pieces, soak in boy’s urine for 49 days, changing the urine every 5 days. Remove, coat thoroughly with 1 *liang* of *liuhuang* (sulfur) powder mixed with wine, wrap tightly with paper, moisten with rice vinegar, and seal with salt clay. Dry, then calcine with 5 *jin* of charcoal. Use 2 *liang* per dose; the remainder may be stored for future use.\nGrind all ingredients into powder, form into pills with glutinous rice paste cooked in wine, the size of *wuzi* seeds, and coat with cinnabar. Take 30 pills, gradually increasing to 80–90 pills, on an empty stomach with plain boiled water.\n\n**Female Obesity and Infertility**\nThose with exuberant phlegm-qi tend to be obese; obesity causes the lower body to become overly plump, drawing the uterus inward and making conception difficult. Even if the man’s jade stem is long and vigorous, thrusting forcefully with essence shooting straight in, dampness from the bladder may cause overflow and flooding.",
      "overlap_context": " *wuzhuyu* (evodia), soaked in decoction and fried.\nFor aching lumbus and knees, add 4 *liang* of *hutao* (walnut) meat with skin.\nFor yin vacuity with yang impotence, add 4 *liang* of *bajitou* (morinda root) and 3 *liang* of *roucongrong* (cistanche), wine-soaked. Alternatively, add one pair of yellow dog’s external kidneys, stewed in wine until soft and mashed in.\n\n**Fire Exuberance and Difficulty in Begetting Offspring**\nIn cases of fire exuberance, ministerial fire is excessively effulgent.",
      "start_char": 8591,
      "end_char": 9889,
      "start_sentence": 363,
      "end_sentence": 402,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.06539440155029,
      "metadata": {
        "source_file": "dao\\藏外\\秘本种子金丹.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "宜涤痰汤送服涤痰丸。 涤痰汤　　当归酒洗　白术蜜炙　白芍　半夏制　香附米　陈皮　甘草各二两　茯苓四两　川芎七钱五分 分作十剂，姜三片，水煎吞服涤痰丸。 涤痰丸　白术二两，蜜炙　半夏曲　川芎　香附米各一两　神曲炒　茯苓各五钱　橘红四钱　甘草二钱 上为末，粥丸，每服八十丸。 热加黄连、枳实面炒，各一两。 妇人瘦弱不孕 妇人瘦弱，多由血少不能受孕，宜常服大补丸。 大补丸　　天冬去心　麦冬去心　石菖蒲　茯苓　人参　益智仁　枸杞子　地骨皮　远志肉各等分 为末，蜜丸桐子大，空心酒下三十丸。 妇人素弱不孕 妇人受胎，必气足血充而后能养。 倘气虚则阳衰，血虚则阴衰。 气血两虚，则胞胎下坠而不能升举，小产之不免也。 宜八珍益母丸。 八珍益母丸　　人参　白术蜜炙　茯苓　川芎各一两　当归　熟地黄各二两　甘草蜜炙，五钱　白芍醋炒，一两　益母草四两，五、六月采取，止用上半截，带叶者不用，铁器晒，杵为末 上为末，蜜丸弹子大，空心白汤下一丸。 或作小丸亦可。 脾胃虚寒多滞者，加砂仁姜汁妙一两； 腹中胀闷，加山楂肉米饭上蒸熟一两； 多郁者，加香附酒制一两。 妇人相火盛 相火旺者，过于焚烧枯燥之土，犹若草木难生。 况火盛耐战，男精早泄而女兴未浓，何以成胎？ 宜一阴煎。 一阴煎　　干地黄　熟地黄各三钱　白芍　麦冬去心　丹参各二钱　牛膝一钱五分　甘草一钱 水二盅，煎七分服。 火盛烦躁者加龟胶二钱； 气虚加人参一二钱； 心虚不眠加酸枣仁、当归各一二钱。 妇人脾胃寒 脾胃虚寒，则带脉必然无力，精即直射，子宫又安能胜任耶？ 宜补中丸。 补中丸　　川芎　当归　黄芪蜜炙　白术蜜炙　人参　白芍　杜仲盐水炒　川续断　阿胶炒珠　五味子炒，各一两　甘草蜜炙，五钱 上为末，蜜丸白汤下。 妇人气郁不孕 妇人思郁过度，致伤心脾、冲任之源，血气日枯，渐至经脉不调，何以成胎？ 宜合欢丸。 合欢丸　当归　熟地黄各三两　茯神　白芍各一两半　酸枣仁炒　远志肉制，各一两　香附酒炒　炙甘草各八分 上为末，蜜丸白汤下。 气虚加人参一两。 妇人血滞不孕 妇人血虚经滞，蓄积不行，小腹疼痛，久不成胎，宜五物煎。 五物煎　　当归　熟地黄各三钱　白芍酒炒，二钱　川芎　肉桂各一钱 水煎服。 气滞加香附制一钱； 阳虚疝痛加小茴香一钱； 水道不利加泽泻一钱； 呕恶加乾姜一钱。 妇人经乱不孕 妇人经水不调，气血乖和，不能受孕；",
      "translated_text": "For cases of obesity with exuberant phlegm-qi, administer **Ditan Decoction** to accompany **Ditan Pills**.\n\n**Ditan Decoction**\n*Danggui* (washed in wine), *Baizhu* (honey-fried), *Baishao*, *Banxia* (processed), *Xiangfu* (rice-prepared), *Chenpi*, and *Gancao* – 2 *liang* each; *Fuling* – 4 *liang*; *Chuanxiong* – 7 *qian* and 5 *fen*.\nDivide into ten doses. Decoct with three slices of ginger and use to swallow **Ditan Pills**.\n\n**Ditan Pills**\n*Baizhu* (honey-fried) – 2 *liang*; *Banxia* (fermented), *Chuanxiong*, *Xiangfu* (rice-prepared) – 1 *liang* each; *Shenqu* (stir-fried) and *Fuling* – 5 *qian* each; *Juhong* – 4 *qian*; *Gancao* – 2 *qian*.\nGrind into powder, form into pills with rice porridge, and take 80 pills per dose.\nFor heat, add *Huanglian* and *Zhishi* (wheat-fried) – 1 *liang* each.\n\n**Female Emaciation and Infertility**\nWomen who are emaciated and weak often suffer from blood deficiency and thus cannot conceive. They should regularly take **Dabu Pills**.\n\n**Dabu Pills**\n*Tiandong* (heart removed), *Maidong* (heart removed), *Shichangpu*, *Fuling*, *Renshen*, *Yizhiren*, *Gouqizi*, *Digupi*, and *Yuanzhi* (flesh) – equal parts.\nGrind into powder, form into pills with honey the size of *tongzi* seeds, and take 30 pills on an empty stomach with wine.\n\n**Chronic Weakness and Infertility**\nFor a woman to conceive, her qi must be sufficient and her blood abundant to nourish the fetus. If qi is deficient, yang declines; if blood is deficient, yin declines. When both qi and blood are deficient, the uterine chamber sags and cannot ascend, making miscarriage inevitable. **Bazhen Yimu Pills** are indicated.\n\n**Bazhen Yimu Pills**\n*Renshen*, *Baizhu* (honey-fried), *Fuling*, and *Chuanxiong* – 1 *liang* each; *Danggui* and *Shudihuang* – 2 *liang* each; *Gancao* (honey-fried) – 5 *qian*; *Baishao* (vinegar-fried) – 1 *liang*; *Yimucao* – 4 *liang* (harvested in the fifth or sixth month, using only the upper half; discard those with leaves; dry in the sun and pound with an iron pestle).\nGrind into powder, form into pills with honey the size of *danzi* seeds, and take one pill on an empty stomach with plain boiled water. Smaller pills may also be used.\nFor those with spleen-stomach deficiency-cold and stagnation, add *Sharen* (stir-fried with ginger juice) – 1 *liang*; for abdominal distension and oppression, add *Shanzha* (steamed with rice) – 1 *liang*; for excessive depression, add *Xiangfu* (wine-processed) – 1 *liang*.\n\n**Exuberant Ministerial Fire in Women**\nWhen ministerial fire is excessive, it scorches the earth like parched soil, making it difficult for plants to grow. Moreover, if fire is exuberant, the man’s essence may ejaculate prematurely while the woman’s desire is not yet aroused—how can conception occur? **Yiyin Decoction** is indicated.\n\n**Yiyin Decoction**\n*Gandihuang* and *Shudihuang* – 3 *qian* each; *Baishao*, *Maidong* (heart removed), and *Danshen* – 2 *qian* each; *Niuxi* – 1 *qian* and 5 *fen*; *Gancao* – 1 *qian*.\nDecoct in two cups of water until seven-tenths remain.\nFor exuberant fire with vexation and agitation, add *Guijiao* – 2 *qian*; for qi deficiency, add *Renshen* – 1–2 *qian*; for heart deficiency with insomnia, add *Suanzaoren* and *Danggui* – 1–2 *qian* each.\n\n**Spleen-Stomach Cold in Women**\nWhen the spleen and stomach are deficient and cold, the belt vessel loses its strength, and essence may be discharged directly—how can the uterus bear it? **Buzhong Pills** are indicated.\n\n**Buzhong Pills**\n*Chuanxiong*, *Danggui*, *Huangqi* (honey-fried), *Baizhu* (honey-fried), *Renshen*, *Baishao*, *Duzhong* (salt-water fried), *Chuanxuduan*, *Ejiao* (pearl-fried), and *Wuweizi* (stir-fried) – 1 *liang* each; *Gancao* (honey-fried) – 5 *qian*.\nGrind into powder, form into pills with honey, and take with plain boiled water.\n\n**Qi Stagnation and Infertility in Women**\nWhen a woman’s excessive brooding and depression injure the heart, spleen, and the source of the thoroughfare and conception vessels, her blood and qi gradually wither, leading to menstrual irregularities—how can conception occur? **Hehuan Pills** are indicated.\n\n**Hehuan Pills**\n*Danggui* and *Shudihuang* – 3 *liang* each; *Fushen* and *Baishao* – 1.5 *liang* each; *Suanzaoren* (stir-fried) and *Yuanzhi* (processed) – 1 *liang* each; *Xiangfu* (wine-fried) and *Gancao* (honey-fried) – 8 *fen* each.\nGrind into powder, form into pills with honey, and take with plain boiled water.\nFor qi deficiency, add *Renshen* – 1 *liang*.\n\n**Blood Stagnation and Infertility in Women**\nWhen a woman’s blood is deficient and her menses stagnate, accumulating without movement, causing lower abdominal pain and long-term infertility, **Wuwu Decoction** is indicated.\n\n**Wuwu Decoction**\n*Danggui* and *Shudihuang* – 3 *qian* each; *Baishao* (wine-fried) – 2 *qian*; *Chuanxiong* and *Rougui* – 1 *qian* each.\nDecoct in water and take.\nFor qi stagnation, add *Xiangfu* (processed) – 1 *qian*; for yang deficiency with mounting pain, add *Xiaohuixiang* – 1 *qian*; for inhibited water pathways, add *Zexie* – 1 *qian*; for nausea and vomiting, add *Ganjiang* – 1 *qian*.\n\n**Menstrual Irregularity and Infertility in Women**\nWhen a woman’s menstrual flow is irregular and her qi and blood are disharmonious, she cannot conceive.",
      "overlap_context": "of *wuzi* seeds, and coat with cinnabar. Take 30 pills, gradually increasing to 80–90 pills, on an empty stomach with plain boiled water.\n\n**Female Obesity and Infertility**\nThose with exuberant phlegm-qi tend to be obese; obesity causes the lower body to become overly plump, drawing the uterus inward and making conception difficult. Even if the man’s jade stem is long and vigorous, thrusting forcefully with essence shooting straight in, dampness from the bladder may cause overflow and flooding.",
      "start_char": 9889,
      "end_char": 10934,
      "start_sentence": 403,
      "end_sentence": 453,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.431706428527832,
      "metadata": {
        "source_file": "dao\\藏外\\秘本种子金丹.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "或生过一胎之后，停隔多年。 宜种玉酒，服至百日，即能受孕； 如气血不足、经滞痰凝者，服至半年，自能见效。 种玉酒　　全当归五两，切片。 此能行血养血　远志五两，甘草汤洗。 此能血中之滞，行气消痰 上二味，用稀夏布袋盛之，甜酒十斤，安药浸之，密封口。 浸过七日后，临卧温服，随量饮之，切勿间断，服完再制。 又经净后，每日用青壳鸭蛋一个，针刺七孔，蕲艾五分，水一碗，将蛋安艾水碗，内饭上蒸熟食之，每月多则吃五六个，少则吃二三个亦可。 妇人经水不调 妇人惟经水为育嗣之期。 经水不调，即非受孕之兆。 纵使受之，亦不全美。 宜大生丸，此通治调经之剂也。 若赤白带下，久不受孕，宜调经种玉丸。 若阴虚不孕，宜加味地黄丸。 若经行腹痛，宜坤厚资生丸。 大生丸　　熟地黄酒蒸　当归身各四两　续断盐水炒　阿胶蒲黄末炒珠　杜仲盐水炒　丹参炒，各二钱　黄芪蜜炙　白芍酒炒　延胡索　川芎各一两五钱　广皮五钱　香附四制，各一两 上为末，蜜丸，每服三钱，空心白汤下。 行经时加二钱； 若先期色紫，改为煎，蜜一两改作一钱，加黄芩八分，姜三片，水煎空心服，临卧再服； 若后期色淡加肉桂、熟艾、干姜各五分，生姜三片水煎服； 若经未至而腹痛，则用丹参一两为末，黄酒下二钱，俱以经尽为止。 仍常服前丸。 调经种玉丸　　香附四制　杜仲姜汁炒，各八两　川芎　白芍　当归身　乾地黄　陈皮　小茴香酒炒　玄胡索微炒　肉苁蓉酒炒　青皮陈者麸炒　乌药炒　枯黄芩酒炒　乌贼骨酥炙，各四两 共为末，醋和面糊为丸，每服百丸，空身好酒下。 一方无地黄、陈皮，有人参、黄芪。 加味地黄丸　　熟地黄四两　山萸肉　山药各二两　牡丹皮　茯苓各一两半　泽泻　香附童便制，各一两　蕲艾去筋，醋炙，五钱 为末蜜丸，每服七十丸，白汤下。 坤厚资生丸　熟地黄　当归酒蒸，各四两　白芍酒炒，三两　川芎酒蒸，一两五钱　丹参酒蒸，三两　茺蔚子酒蒸，四两　香附四制，醋浸、姜汁、盐水各浸各炒，各一两　白术四两，蜜水炙黄 为末，以益母草八两，酒水各半熬膏和蜜为丸，每服四钱，空心白汤下。 月经先期，脉数，属热，加生地黄、牡丹皮； 后期，厥冷，脉迟，属寒，加肉桂； 将行腹痛，是气滞也，加乌药、木香； 食少气虚，面色白，四肢无力，是气血两亏也，方内香附减半，加人参、黄芪、茯神、远志肉、酸枣仁。",
      "translated_text": "Or, after giving birth to one child, there may be a prolonged interval of many years. **Seed-Jade Wine** is indicated; taken for one hundred days, it can enable conception. If qi and blood are insufficient, with menstrual stagnation and phlegm congealment, take it for half a year, and efficacy will naturally appear.\n\n**Seed-Jade Wine**\n*Danggui* (whole) – 5 *liang*, sliced. This moves and nourishes the blood.\n*Yuanzhi* – 5 *liang*, washed in licorice decoction. This resolves stagnation within the blood, moves qi, and dissolves phlegm.\n\nPlace the above two ingredients in a loose summer cloth bag, steep in 10 *jin* of sweet wine, and seal tightly. After seven days of steeping, take warm before bed, drinking as much as desired. Do not interrupt the course; when finished, prepare another batch. Additionally, after the menstrual flow ceases, each day take one green-shelled duck egg, pierce seven holes in it, and steam it with 5 *fen* of *Qiai* in a bowl of water. Eat one daily; in a month, consume no more than five or six, or as few as two or three.\n\n**Menstrual Irregularity in Women**\nIn women, the menstrual flow is the appointed time for bearing descendants. If the menstrual flow is irregular, it is not an omen of conception. Even if conception occurs, it will not be fully sound. **Great Life Pills** are indicated; this is a general formula for regulating menstruation.\n\nFor red and white vaginal discharge with long-term infertility, **Menstruation-Regulating Seed-Jade Pills** are indicated.\nFor yin deficiency infertility, **Augmented Rehmannia Pills** are indicated.\nFor menstrual abdominal pain, **Kunhou Zisheng Pills** are indicated.\n\n**Great Life Pills**\n*Shudihuang* (wine-steamed) and *Danggui* (body) – 4 *liang* each; *Xuduan* (salt-water fried), *Ejiao* (stir-fried with *Puhuang* powder until pearled), *Duzhong* (salt-water fried), and *Danshen* (fried) – 2 *qian* each; *Huangqi* (honey-fried), *Baishao* (wine-fried), *Yanhusuo*, and *Chuanxiong* – 1.5 *liang* each; *Guangchenpi* – 5 *qian*; *Xiangfu* (fourfold-processed) – 1 *liang*.\n\nGrind into powder and form into honey pills. Take 3 *qian* each time on an empty stomach with plain hot water. During menstruation, increase the dose by 2 *qian*. If the menses arrive early and are dark purple, switch to a decoction: reduce the honey to 1 *qian* (from 1 *liang*), add 8 *fen* of *Huangqin*, and 3 slices of ginger. Decoct in water and take on an empty stomach, with a second dose before bed. If the menses arrive late and are pale, add 5 *fen* each of *Rougui*, *Shu’ai*, and *Ganjiang*, and 3 slices of fresh ginger; decoct and take. If the menses have not arrived but there is abdominal pain, take 1 *liang* of *Danshen* powder with 2 *qian* of yellow wine, continuing until the menstrual flow ceases. Then resume taking the previous pills as usual.\n\n**Menstruation-Regulating Seed-Jade Pills**\n*Xiangfu* (fourfold-processed) and *Duzhong* (fried with ginger juice) – 8 *liang* each; *Chuanxiong*, *Baishao*, *Danggui* (body), *Gandihuang*, *Chenpi*, *Xiaohuixiang* (wine-fried), *Xuanhusuo* (lightly fried), *Roucongrong* (wine-fried), *Qingpi* (stir-fried with bran), *Wuyao* (fried), *Kuhuangqin* (wine-fried), and *Wuzeigu* (baked with lard) – 4 *liang* each.\n\nGrind into powder, mix with vinegar and flour paste, and form into pills. Take 100 pills each time on an empty stomach with good wine. One variant omits *Dihuang* and *Chenpi*, adding *Renshen* and *Huangqi*.\n\n**Augmented Rehmannia Pills**\n*Shudihuang* – 4 *liang*; *Shanyurou* and *Shanyao* – 2 *liang* each; *Mudanpi* and *Fuling* – 1.5 *liang* each; *Zexie* and *Xiangfu* (processed with boy’s urine) – 1 *liang* each; *Qiai* (veins removed, vinegar-fried) – 5 *qian*.\n\nGrind into powder and form into honey pills. Take 70 pills each time with plain hot water.\n\n**Kunhou Zisheng Pills**\n*Shudihuang* and *Danggui* (wine-steamed) – 4 *liang* each; *Baishao* (wine-fried) – 3 *liang*; *Chuanxiong* (wine-steamed) – 1.5 *liang*; *Danshen* (wine-steamed) – 3 *liang*; *Chongweizi* (wine-steamed) – 4 *liang*; *Xiangfu* (fourfold-processed: soaked in vinegar, ginger juice, and salt water, then stir-fried) – 1 *liang*; *Baizhu* (4 *liang*, honey-water fried until yellow).\n\nGrind into powder. Boil 8 *liang* of *Yimucao* in equal parts wine and water to make a thick paste, mix with honey, and form into pills. Take 4 *qian* each time on an empty stomach with plain hot water.\n\nIf the menses arrive early with a rapid pulse, indicating heat, add *Shengdihuang* and *Mudanpi*. If the menses arrive late with cold limbs and a slow pulse, indicating cold, add *Rougui*. If there is abdominal pain before the menses, indicating qi stagnation, add *Wuyao* and *Muxiang*. If there is poor appetite, qi deficiency, a pale complexion, and weakness in the limbs, indicating dual deficiency of qi and blood, reduce *Xiangfu* in the formula by half and add *Renshen*, *Huangqi*, *Fushen*, *Yuanzhirou*, and *Suanzaoren*.",
      "overlap_context": "each; *Baishao* (wine-fried) – 2 *qian*; *Chuanxiong* and *Rougui* – 1 *qian* each.\nDecoct in water and take.\nFor qi stagnation, add *Xiangfu* (processed) – 1 *qian*; for yang deficiency with mounting pain, add *Xiaohuixiang* – 1 *qian*; for inhibited water pathways, add *Zexie* – 1 *qian*; for nausea and vomiting, add *Ganjiang* – 1 *qian*.\n\n**Menstrual Irregularity and Infertility in Women**\nWhen a woman’s menstrual flow is irregular and her qi and blood are disharmonious, she cannot conceive.",
      "start_char": 10934,
      "end_char": 11896,
      "start_sentence": 454,
      "end_sentence": 488,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.52631664276123,
      "metadata": {
        "source_file": "dao\\藏外\\秘本种子金丹.txt",
        "category": "藏外"
      }
    }
  ]
}