{
  "source_id": "秘藏通玄变化六阴洞微遁甲真经",
  "source_file": "chunked_daozang\\秘藏通玄变化六阴洞微遁甲真经.json",
  "total_chunks": 20,
  "total_original_chars": 16462,
  "total_translated_chars": 95309,
  "total_translation_time": 491.8145387172699,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\方法类\\秘藏通玄变化六阴洞微遁甲真经.txt",
    "category": "方法类"
  },
  "full_translation": "*The Esoteric Canon of the Six Yin Caverns of the Mysterious Transformations of the Hidden Dao: The Authentic Classic of Dunjia*\n\n**Title:** *The Esoteric Canon of the Six Yin Caverns of the Mysterious Transformations of the Hidden Dao: The Authentic Classic of Dunjia*\n*Author unknown; transmitted by Liu Han.*\n*Three scrolls.*\n*Source text: Zhengtong Daoist Canon, Cavern Spirit Division, Methods Category.*\n\n---\n\n**The Esoteric Canon of the Six Yin Caverns of the Mysterious Transformations of the Hidden Dao: The Authentic Classic of Dunjia, Scroll One**\n\nThe Most High said:\nThose who seek transmission must first bathe and purify the body, solemnly light incense before the stove, gaze upon the Northern Asterism, and with reverent heart offer prayers to the fragrant smoke. They shall invoke the August Jade Emperor of the Vast Heaven, the Most High Mysterious Maiden of the Nine Heavens, and the Sacred Master, the Mysterious Heavenly Emperor, saying:\n\n*\"I, a disciple of the Most High, having received the* **Scripture of the Six Yin Caverns of the Mysterious Jade Maiden of the Most High***, have taken refuge in its precepts and wear its teachings close to my person, practicing in accordance with its methods. I humbly pray that Heaven may bestow blessings and protection, that Earth may grant auspicious omens, that the Great Dao may swiftly be accomplished, and that my heart’s vows may soon be fulfilled.*\n\n*After receiving this canon, I shall forever uphold its practice, never speaking lightly or deceitfully, never recklessly disclosing it to unworthy persons, never employing it for perverse ends, nor seeking杂慕. From the moment I obtain this method, I vow to seek longevity, to benefit the common people, to aid the nation and succor the people, to retreat into solitude and purity, and to dispel demons and slay evil. May the Three Heavens deign to witness this, and may all phenomena come to know it. Grant me communion with the numinous, that my aspirations may be realized. Should I ever act recklessly or practice sorcery, I willingly submit to Heaven’s punishment, and the Sacred Perfected shall withhold their protection.\"*\n\n*Swiftly, swiftly, in accordance with the statutes and ordinances, let it be done.*\n\nAfter transmission, on an auspicious day, prepare seven oil-and-flour cakes, seven *huanxi* sweet dumplings, seven strips of pure cloth, and seven cups of jujube broth. At the second watch, when the stars and moon shine brightly, arrange seven offerings beneath the Northern Dipper, burning abundant incense in a blazing fire. Holding this canon, bow one hundred times and proclaim:\n\n*\"I pour forth my heart and devote my will, gathering qi and uniting with the spirit. I bow twice and offer incense, pledging my sincerity in this oath. I am a child of the Most High, having long practiced purity and stillness, earnestly discerning the heart of Heaven. I wish to depart the mundane world and return to Penglai. With utmost reverence, I make this supplication, humbly beseeching the True Compassion to look down with mercy and witness my vow.*\n\n*On this day of such-and-such month and year, I have received the* **Scripture of the Six Yin Caverns of the Mysterious Jade Maiden of the Most High***. I now wish to practice its teachings and pray for the witness of this covenant. Having received this method, I dare not treat it lightly. Unless in dire need to save others, I swear never to misuse it.\"*\n\nI now reverently face Your august presence and solemnly pledge these words. Should I fail to uphold them, I willingly accept punishment. In all matters of urgency or delay, I pray for Your protection and aid. I advance to offer incense and bow twice, then softly invoke:\n\n*\"I beseech the two or three Jade Maidens to serve as my envoys—ascending to the celestial court, descending to traverse the world, dispatching flying talismans and swift seals, expelling evil and slaying demons, fulfilling all tasks I command. Humbly I implore Your august compassion to look down with favor and witness my plea.\"*\n\nAgain I offer incense and bow twice, then invoke:\n\n*\"The matters I have declared are now laid before Your presence. Humbly I pray for Your mighty power to grant constant protection and blessing.\"*\n\nAfter bowing, I withdraw the incense altar. On a chosen auspicious day, I prepare a portion of tea, a cup of wine, and a plate of fruit. At the second watch, unseen by others, I face the Northern Asterism beneath the eaves, set up the incense altar, offer incense, and bow twice, then reverently invoke:\n\n*\"True Martial Spirit of the North, Perfected Sovereign of Numinous Response, this night and hour, I beseech You to descend in majesty. I have a humble matter to present before Your presence with a hundred bows. I uphold the mandate of the Most High, practicing the registers of the Dao. I slay ghosts and dispel evil, aid the state and pacify households, seek immortality and study the Dao, succoring the orphaned and impoverished. I wish to practice the* **Scripture of the Six Yin Caverns of the Mysterious Jade Maiden**, *commanding two or three Jade Maidens to harmonize Heaven and Earth and subdue demonic forces. By principle and reason, I seek to fulfill this vow. Humbly I pray that the August Sovereign witness my sincerity and lend Your mighty power. Daring to rely on the exalted Perfected, may I forever abide in the true position. Where my seal is placed, let it be the Daoist sanctuary. Humbly I beseech Your sagely compassion to extend Your sacred virtue.\"*\n\nThen I form the mudra with both thumbs and invoke:\n\n*\"Heaven is serene, Earth is tranquil; yin is turbid, yang is clear.\nEyes blazing, hair unbound, the Tortoise and Serpent unite in form.\nWielding the sacred sword, I sever demonic essences.\nCome and dwell in my chamber, presiding over the Six Yin’s majesty.\nHear my invocation, follow my decree.\nEternally guard the central position, protecting until immortality is achieved.\"*\n\n*Swift as the statutes command!* (Recited seven times.)\n\nAgain I offer incense and invoke:\n\n*\"I wish the two or three Jade Maidens to serve as my envoys for all exorcistic tasks. May the August Sovereign grant protection, aiding the divine hemp, for which I am deeply fortunate.\"*\n\nI bow twice, then withdraw the altar and take my leave.\n\n**Grand Ritual of Offering**\nOn a *guihai* day, first write the petition and talismans to summon the deities. Keep outsiders beyond the precincts. The night before, prepare offerings and offer incense. Face north before the altar, visualize the deities, and knock the teeth together before invoking:\n\n*\"I, a disciple of the register of [such-and-such] prefecture, most reverently bow and invoke:\nAncestral Master, True Martial of the North, Perfected Sovereign Who Upholds Sageliness, may Your sagely presence descend to witness the great covenant of the ritual.\"*\n\nI offer incense and pour wine, then invoke before the Perfected Sovereign of *Dingmao*:\n\n*\"I humbly summon the Jade Maiden of* Dingmao*, ‘Foot Day,’ named* Baozhong*, the Perfected Sovereign of Boundless Benevolence and Blessing, to descend to this altar upon smelling my incense.\"*\n\nI burn incense, burn the *Hetong* talisman, recite my personal incantation, and draw the qi of the proper direction to blow upon it. Next, I invoke:\n\n*\"I humbly summon the Jade Maiden of* Dingchou*,* Hei Wushang*, named* Taihe*, the Perfected Sovereign of Horizontal Heaven and Benevolent Actuality, to descend to this altar upon smelling my incense.\nI humbly summon the Jade Maiden of* Dinghai*,* Lu Mingji*, named* Guangyang*, the Perfected Sovereign of the Capital Prefecture and Benevolent Origin, to descend to this altar upon smelling my incense.\nI humbly summon the Jade Maiden of* Dingyou*,* Jiu Qinling*, named* Zhengyi Yafu Renxiu*, the Perfected Sovereign of Rectitude and Rest, to descend to this altar upon smelling my incense.\nI humbly summon the Jade Maiden of* Dingwei*,* Cheng Suling*, named* Xuanying Wubi Renzhi*, the Peerless Perfected Sovereign of Mysterious Radiance, to descend to this altar upon smelling my incense.\nI humbly summon the Jade Maiden of* Dingsi*,* Zhu Fucheng*, named* Wenguang Gaoshang Rende*, the Exalted Perfected Sovereign of Cultivated Virtue, to descend to this altar upon smelling my incense.\"*\n\n*\"Now that I have reverently summoned the two or three Jade Maidens, may they deign to descend in majesty. Humbly I beseech Your true numina to condescend to this great transformation, descending in ritual splendor to receive my earnest prayers.\"*\n\nWith the left middle finger and the right *Dasha* mudra, I knock my teeth thirty-six times and recite the *Hidden Words of the Six Yin and Six Ding Jade Maidens and Eight Pure Ones*:\n\n*\"Nine qi of the radiant dragon follow the Five Peaks.\nThe Four Saints of Heavenly Obscurity and the Ten Origins of the Eight Poles.\nThe hundred spirits of the Dipper and the twelve daily asterisms.\nThe Six Ding Jade Maidens, may You bestow true radiance to aid the ritual’s commands and restraints.\nI invoke the* **Most High Lord Lao** *to thoroughly enforce the statutes and save!\"*\n\n(Recited three times in succession.)\n\nI summon each of the Six Ding Jade Maidens by their names and mudras. Then I perform the *Dang* step:\n\n*\"Concealing form, hiding traces, I tread my* Dang *and* Kui*.*\n*I see them, yet they know not me.\nMoving and planting as I will, demons follow at my rebuke.\nSwift as water and fire, dancing like wind and thunder.\nTransforming marshes into mountains, overturning earth and sky.\nMy body is firm, tranquil and silent.\nFor ten thousand ages, I attain long life and merge with the Dao to become immortal.\"*\n\n*Swift as the statutes of the Dark Maiden of the Nine Heavens command!*\n\nI draw the qi of each direction and blow it into the altar. I invite the Jade Maidens to take their seats according to their positions, burn six talismans of their respective forms in the altar, knock my teeth, close my eyes, and visualize the six Jade Maidens descending to the altar. I bow twice and offer incense, then invoke:\n\n*\"After reverently summoning the True Martial Sovereign, I now burn incense to invite the two or three Jade Maidens. Having visualized their descent and seating, I, disciple [Name], bow twice in reverence.\nI am a disciple of the* **Most High Lord Lao**, *having long upheld the sagely Dao, desiring eternal life.\nI tread the pure and contend with the rules, practicing profound and wondrous deeds.\nEver devoted to the supreme Dao, I receive the mandate to cultivate.\nAbove, I offer prayers for the souls of my ancestors; below, I relieve the calamities and epidemics of the myriad people.\nI uphold the registers of the Dao and practice its restraints.\nNow I wish to establish an altar, adorn a purified chamber, and prepare offerings according to the ritual statutes to feast the Perfected Sovereign.\nRelying on Your majestic radiance, I humbly beseech Your thorough witness.\nI seek to master the principles of immortality, pacify the state and people, enchant water and dispatch talismans to expel evil and govern ghosts.\nAbove, to aid the state’s needs; below, to support my own destiny.\"*\n\nFor all matters great or small, every act of movement relies on the majestic immortals to serve as messengers. Assist me in my practice and heed my instructions. From east to west, south to north, all shall comply and obey. Call their names and inscribe their seals—upon hearing the invocation, they shall arrive at once. Record their words and never break faith.\n\nLight incense and bow twice, then draw near softly and whisper:\n\"I bear the command of the Most High and the decree of the Jade Emperor to harmonize the cosmos, pacify and aid the state, raise armies and act, dispatch ghosts and expel evil. Today, I feast the immortal spirits, that they may forever serve as my protective envoys. You must adapt to my strategies and follow my actions. Should any disobey, they shall face the command of the Most High and the decree of the Jade Emperor—severing the spirit’s body and extinguishing the spirit’s virtue.\"\n\nMay the numinous ones, in their wisdom, deign to listen below.\nBow twice more, light incense, and raise the wine.\n\nNext, kneel and prostrate, knocking teeth together, and pray:\n\"Disciple [Name] humbly encounters this grand assembly’s night and reverently offers sacrifice before the two or three Jade Maidens. I reflect that my nature is innate, my heart bears heaven’s decree, and my original master holds a covenant, a transmission from the Most High. Now, on this grand occasion, I modestly present this cup.\n\nThe Wind Earl sweeps clean, the Rain Master purifies the altar. I, your devotee, cherish auspicious omens. Having declared my name and lineage, I wish to receive your true radiance, serve you all my life, and never forget you. Today’s offering includes fine meats, dried delicacies, and fragrant incense—jujubes from Anyi, with small pits and tender flesh; pure, clear wine, its floating froth poured in streams; seasonal fruits; and white rice, the finest grain. Partake of my feast, drink and eat your fill. When sated with wine and food, follow my every move. Whatever I pray for, respond in kind. Ever attend me, ever guard my side. May my wishes prosper and flourish. Wherever I go, may the Perfected accompany me. In concealment or openness, in all journeys, may all be peaceful. Swiftly achieve the great Dao and soon reach the immortal realm. When I suffer, may the Perfected bring auspicious tidings. When I desire, may the Perfected follow and fulfill. Entering enemy lands to protect the state, may all be well. Safeguard my body, and with heaven and earth, endure.\n\nPour the libation, offer the drunkenness—may it be received with favor.\nHastily, as by the statutes and decrees of the Most High.\"\n\nBow twice more and light incense, then recite the personal incantation of your own body. Draw in a breath of qi and blow it upon the seat, secretly saying:\n\"Jade Maiden of Dingmao, you possess the *Six Yin Classic* and the *True Writ of the Subtle Cavern* of the Most High. You know the names of spirits and the titles of immortals. With the proper method, you summon immortals; with the proper method, you command spirits. Traversing the Three Realms, emerging from darkness into light, in movement and stillness, sitting and lying down, all rely on the immortal Perfected. Summoned, you arrive at once; invoked, you descend immediately. All affairs of the human world, let me hear them clearly. I vow to repay your favor—do not defy me.\nHastily, as by the statutes and decrees.\"\n\nRecite three times. Draw qi from the Dingmao direction and blow it forth. Then do the same from Dingchou, and likewise for the other directions.\n\nLight incense devoutly and recite the incantation:\n\"Command the Six Yin, emerge from darkness into light. Fearless and unafraid, unshaken by anything. Follow the turning of my talismans, follow the movement of my seals. Dispel ten thousand calamities, gather blessings upon myself. Active by day, concealed by night—do not disobey my command.\nHastily, as by the statutes and decrees.\"\n\nAfter completing this cycle six times, align all to their proper positions. Light incense and bow twice, then take a talisman, roll it into a ball, and consume it with the wine from each position. Bow in gratitude, completing this for all six positions in their proper alignment.\n\nLight incense and recite:\n\"Now I uphold the method, I am the master, and the Perfected are my disciples. What I dispatch, the spirits shall follow. From this moment onward, never leave my side. Golden coins and cloud steeds shall aid the Perfected’s journey. In all undertakings, do not break faith.\"\n\nBurn the paper money, then close the altar.\n\n**Memorial Submitting the Classics by Minister Zhao Pu, Right Vice Director of the Chancellery of the Song Dynasty**\n\nYour servant has heard that if heaven’s measure is vast, its covering of all things must be broad; if a person possesses extraordinary talent, establishing merit is not difficult. When the time is ripe with heaven’s favor, it must coincide with a gathering of wind and cloud. Your servant first followed Your Majesty in reclaiming the various states, and though I never matched Xiao He of Han in securing maps and documents for the secret archives, my aspirations were no different.\n\nMoreover, the books stored in the various secret halls may indeed be called arcane. Such works as the *Tai Bai Yin Jing*, *Thirty-Six Ministries of Thunder-Driving Soldiers*, *Qi Circulation Diagrams*, *Twelve Precepts for Summoning Wind and Cloud*, *Tortoise Classic of Water Shrinking*, and *Divine Classic of Uprooting Trees*—these and other secret texts are beyond counting. Yet when one examines them closely, are they not also difficult? Their meanings are abstruse, their words sprawling.\n\nShould some, after receiving the precepts, abstain from drink for life, or others, upon mastering the method, forswear meat for their entire clan—once such vows are taken, no other observances may be followed. Should one’s practice deviate or reverse, dire calamity will strike, beyond swift remedy. In my humble view, this is not yet perfection.\n\nOne day, the recluse Liu Han of Mount Luofu sought audience. I said to him: “There exist ancient texts of profound secrecy—have you obtained them?” He replied: “I have.” Liu Han, however, deemed this insufficient and produced a purple satchel from his desk. After burning incense and bowing in reverence, he opened the satchel, drew forth a book, and presented it to me, saying: “The Yellow Emperor, having defeated and slain Chiyou on the wilds of Banquan, concealed this in the celestial treasury. Thereafter, it was transmitted to Yao, Shun, Yu, Tang, Wen, and Wu. In the Warring States, it was lost. The First Emperor of Qin alone recovered it, enlisting the aid of spirits in secret, and with their support, unified the realm—only to lose it again through his own impiety. Through the Qin and Han dynasties, it passed into the hands of various lords, scattering far and wide.\n\nAlas! Some obtained it but failed to uphold it; others practiced it without reverence—none succeeded. Only five men—Chen Ping of the Former Han, Deng Yu of the Later Han, Zhuge Liang of Shu, Guo Ziyi and Li Jing of Tang—truly grasped it. With utmost care and devotion, they wielded it to devise stratagems beyond mortal comprehension. In every campaign, sally, raid, or ambush, thunder, wind, lightning, and rain would arrive precisely as summoned. Since their time, this method has vanished from the world.\n\nI, your humble servant, have lived in seclusion on Mount Luofu for many years. My late master treasured this text for generations, once admonishing me: ‘Should a sagely and true sovereign arise, and a true adept assist him, you must present this.’ If you, my lord, can practice it with reverence and unwavering faith, your achievements will rival those of the Five Masters.’\n\nI served him for nearly half a year, during which I sometimes heard voices at my ear speaking of matters critical to the state and military. Yet when I turned, no one was there. My doubts dissolved as understanding dawned. The voice declared: ‘I am a spirit of the Six Jia. Do not doubt.’ From then on, my reverence deepened, and the whispers at my ear—reports of daily events—became too numerous to recount.\n\nWhen I later attended Your Majesty in reclaiming the rebel lands, our advance was as effortless as splitting bamboo. This was not due to my own cunning or foresight, but to the power of the Six Spirits. On campaign, Wang Quanfu, Cui Yandi, Liu Guangyi, Cao Bin, and others knew only that I served these spirits. I would tell them: ‘On such-and-such a day, rain; on another, wind; on yet another, fire will consume the enemy camp.’ Not once did I err. This method is a swift and wondrous shortcut to the mysterious—how could Liu Han have been an ordinary man? Later, he vanished without trace, as if spirited away. Could it be that Heaven itself bestowed this upon our Song?\n\nThis text distills the secrets of all schools, a truly esoteric and untransmitted work. I have recorded its contents faithfully and now humbly submit it for Your Majesty’s perusal. From beginning to end, its incantations and talismans number little more than a thousand characters. I beseech Your Majesty to store it in the Jade Coffer, that it may perpetually safeguard the dynasty for ten thousand years, by the grace of the divine.\n\nOn the first day of the seventh month of the fourth year of the *Kaibao* era, by imperial decree, it was sealed in the Jade Coffer and placed in the Secret Archives.\n\n*Preface to the Origin of the* Divine Classic of the Six Jia\n\nIn ancient times, Chiyou rebelled, and the Yellow Emperor fought him repeatedly without success. The Emperor said: “I have heard that in the age of Fuxi, the world knew no war...”\n\nNow, Chiyou was but a commoner who had spawned malevolent qi, and though I attacked him repeatedly, I could not prevail—this was my failure. Suddenly, before my eyes, a five-colored cloud descended from the sky. From within the cloud emerged six jade maidens bearing a book, and two youths who declared: “By the sacred command of the Nine Heavens’ Mysterious Maiden, we present the *Three Scrolls of the Classic of the Six Jia Talismans*, that your wish to subdue him may be fulfilled.” This text reveals the fortunes and misfortunes of Heaven and Earth, the auspices and omens of the Eight Trigrams. It discerns the shifts of wind and cloud, recognizes the success or failure of qi and seasons, observes the waxing and waning of sun and moon, expounds the sequence and inversion of yin and yang, comprehends the good and ill of stars, and knows the victory or defeat of human affairs. This art is the method of ten thousand transformations.\n\nThe Emperor knelt in reverence to receive it, whereupon the two youths and the jade maidens ascended upon the cloud and departed. The Emperor then opened the case and obtained the *Three Scrolls of the Classic of the Yin Talismans*. The upper scroll expounds the arts of immortals refining the elixir and embracing the One, teaching the methods of longevity. The middle scroll sets forth the ways to pacify the realm, stabilize the state, and comfort the people. The lower scroll discusses matters of warfare and conquest, for the Six Jia is the method of the Mysterious Maiden.\n\nHaving received it, the Emperor established an altar, forged seals and swords, and, following its precepts, battled Chiyou on the fields of Zhuolu. Thereafter, he achieved victory and concealed the text within the Golden Hall. Later, during great upheaval, it was retrieved by Chaohuang Yang and transmitted to the mortal world. Those who obtain it are blessed by karmic fortune; those who encounter it prevail as if by divine power. It must be guarded with care and never passed to the unworthy.\n\nThe Six Ding spirits are the true deities of the world, unlike ordinary beings. The Azure Dragon, Hall of Light, and Sun spirits, ever attendant upon the jade maidens, are summoned to serve within Heaven and Earth. To conceal one’s form and vanish, hold a blade in the left hand, hold the breath, and with the right hand trace a circle. If the evil one is within, draw a six-foot enclosure outside; if the evil one is without, draw it inside. In the wilds, construct the enclosure there and transform the spirits. Use six rods, each one foot and two inches long. Arrange them in sequence according to the Azure Dragon of each ten-day period, placing the counting rods directly before the Jade Maiden’s gate. With the left hand, draw the rods across to seal the gate, then depart through the Heavenly Gate and Earthly Portal. Once the gate is sealed, the body’s form is concealed.\n\nFor each rod, envision a person in the position of the *zi* hour. When the Jade Maiden reaches the Greater Yin, dwell upon the thought that outsiders cannot see you. First recite the incantation to purify mouth and body, form the seal with the left hand, grasp the sword in the right, step the Seven Stars of the Northern Dipper, loosen the hair, and brandish the sword. After reciting the purification incantations, close the eyes, silently intone the names of the Seven Stars once, and sever the connection with the local earth deity. When reciting the incantation, draw qi from the direction and blow it forth; advance and retreat while pinching fire. This method is employed in military maneuvers—whether facing inauspicious spirits or malevolent forces, one may vanish into the earth to evade them. Outnumbered or surrounded by ten thousand soldiers, gaze toward the Celestial Stem, draw qi from the indicated direction, and depart; a thousand troops will not perceive you, nor ten thousand see you. This esoteric oral transmission is priceless, its secrets not to be divulged for any treasure. It is the nation’s safeguard, never to be revealed to others.\n\n*End of the First Scroll of the* True Classic of the Six Yin Cavern’s Subtle Transformations of the Hidden Dao\n*Second Scroll of the* True Classic of the Six Yin Cavern’s Subtle Transformations of the Penetrating Dao\n\n*The Upper Transmission of the* Mysterious Cavern Classic of the Six Exclusions and Jade Maiden\n\nThe Most High Lord Lao said: To enter the Dao, one must first delve into its profundities. The subtle and abstruse principles—mobilizing troops, setting forth, guarding the Dao and concealing the form, dispelling evil and expelling wickedness, preserving and protecting the original true—are the most essential of my gates, the means to ascend to the ranks of immortals. Moreover, this method opens the profound path of the pure Heaven and penetrates the abstruse depths of the turbid Earth. Its principles illuminate past and present, its Dao crowns all arts.\n\nFor the self, it brings benefit: one may approach officials and superiors, gain audience with kings and nobles, expel ghosts and avert calamities, attract blessings and summon fortune, dispatch flying talismans and moving seals, subdue raging demons, seek the Dao and attain immortality, and act as one desires. For the state, it brings benefit: one may mobilize troops, establish order and discipline, mitigate floods and droughts, eradicate famine and suffering, inspire dreams in kings and lords, harmonize the hearts of all beings, traverse waters and scale mountains, and traverse perilous paths in seclusion. Without this method, how could one ascend to the profound principles so effortlessly?\n\nThe Most High Lord Lao said: I transmit this classic and its methods to circulate among humankind, to serve the needs of the virtuous. Those who are not its proper recipients must not privately peruse it. It may be shared with one’s disciples at the cost of a thousand gold, but the *Six Yin Classic* must never be revealed. From ancient times to the present, there has never been one who did not employ this method to attain the Dao. Should it be misused by guards, soldiers, or officials, retribution will swiftly follow—misfortune, stagnation, calamity, and adversity will arise. If one who is not of the Dao, though sincere and offering worldly wealth, transmits it carelessly, the punishment shall be doubled.\n\nThe Most High Lord Lao said: Those who wish to transmit this method must first bathe and purify themselves, approaching with solemnity. Light incense at the stove, gaze toward the Northern Asterism, and direct the heart in prayer. The disciple of the Most High declares: On such-and-such a year, month, and day, I received the *Mysterious Cavern Classic of the Six Exclusions and Jade Maiden*. I humbly pray that Heaven bestow blessings and protection, that Earth grant auspicious fortune, that the Great Dao be swiftly accomplished, and that my wishes be soon fulfilled.\n\nAfter receiving this classic and its methods, the disciple vows to practice it perpetually, never to speak lightly or deceitfully, never to recklessly reveal it to the unworthy, never to employ it for perverse ends, and never to seek杂慕. Having obtained this method, the disciple aspires to seek longevity, benefit the people, aid the state, retreat from the turbid and enter the pure, and eradicate demons and slay evil.\n\nMay the Three Heavens bear witness in their great clarity, and may all things under heaven come to know. Bestow upon this disciple the power of spiritual communion, that my intentions may be fulfilled. Should I ever recklessly engage in demonic or perverse acts, I willingly accept the punishment of Heaven, and the sagely immortals shall withhold their protection. Hasten now, as the law commands!\n\n**The Essential Secrets of the Six Yin**\nThe Six Yin correspond to the yin aspects of the Six Jia. The yin of Jiazi is Dingmao; the yin of Jiaxu is Dingchou; the yin of Jiashen is Dinghai; the yin of Jiawu is Dingyou; the yin of Jiachen is Dingwei; and the yin of Jialin is Dingsi. The Six Ding constitute the Six Yin, just as the Six Jia serve as the yang generals, while the Six Ding are the yin spirits. The reason for employing the Six Ding rather than the Six Yang is that yin represents *wu* (non-being). *Wu* possesses the power of transformation—it can be both existent and non-existent, moving between life and death, and encompassing both concealment and revelation. Like the use of military strategy in war, the Six Yin are formless, yet their application yields immediate response.\n\nThose who walk the Dao employ yin, while those without the Dao employ yang. Yang can be measured, but yin remains unfathomable. The preceding scroll exclusively describes the rites for invoking the Six Ding.\n\nSome may ask: Since the Six Ding are formless, why perform rites for them? The answer lies in the union of form and formlessness—by offering sacrifices to the formless spirits, the tangible and intangible merge. Thus, one visualizes the spirits, clacks the teeth, silently recites the invocation, and verbally petitions them, aided by fragrant wine and fine offerings. Following the prescribed method ensures spiritual resonance.\n\nIn ancient times, when the Yellow Emperor waged seventy-two battles against Chiyou, he fell into a deep slumber during the day and dreamed of a divine being who taught him a secret method. Upon awakening, he found the method within a sealed pouch, titled *The Six Yin Cavern Secrets*—the esoteric art of the Six Ding, a system of the Six Jia’s flying palaces and transformative techniques. By adhering to this method, he ultimately vanquished Chiyou. This is the orthodox and mysterious art of the Supreme Unity and Primordial Perfection, not a demonic or perverse practice.\n\nThose who receive its transmission must submit a memorial to the Celestial Bureau, presenting it to the Supreme Emperor, and swear an oath never to recklessly invoke demonic or perverse acts. Should one act deceitfully or improperly, the Six Ding spirits will hold them accountable, and they shall incur the severe punishment of Heaven. Only with a rectified heart and conduct can one employ this method effectively.\n\nThe Most High Lord Lao said: In the era of Great Peace, this method was bestowed by the Nine Heavens’ Mysterious Maiden upon the Youxiong clan. The Youxiong clan passed it to Feng Hou, who transmitted it to the Great Mystery Master Yellowstone Elder, who in turn bestowed it upon Zhang Zifang. Since its dissemination among humanity, it has been transmitted to those deemed worthy.\n\n**Names, Attires, and Colors of the Six Ding Jade Maidens**\nThe Dingmao Jade Maiden is named *Zu Ri Zhi*, also called *Ding Wenming*, styled *Baozhong* or *Rengao*, and titled *Wuji Renfu Zhenjun* (Perfected Lord of Limitless Benevolence and Blessing). Her appearance: clad in a green court robe, wearing a rabbit-headed crown, a yellow skirt, with knitted brows. In her left hand, she holds a wish-fulfilling pearl, and in her right, a sword. She descends on Zichou days to serve in the eastern halls of households.\n\nThe Dingchou Jade Maiden is named *Hei Wushang*, also called *Ding Wengong*, styled *Taihe* or *Rengui*, and titled *Hengtian Renshi Zhenjun* (Perfected Lord of Heaven-Spanning Benevolence and Fruitfulness). Her appearance: dressed in a blue-green court robe, wearing a cow-headed crown and a pale yellow skirt, holding a halberd or smiling gently. She descends on Yinmao days to serve in the northeastern cattle pens or the abodes of the Controller of Fate.\n\nThe Dinghai Jade Maiden is named *Lu Mingji*, also called *Ding Wentong*, styled *Guangyang* or *Renhe*, and titled *Dufu Renyuan Zhenjun* (Perfected Lord of the Capital’s Benevolent Origin). Her appearance: clad in a black court robe, wearing a pig-headed crown and a pale yellow skirt, holding immortal fruits and a sword. She descends on Chensi days to serve in the northern corners of households, near kitchens or latrines.\n\nThe Dingyou Jade Maiden is named *Jiu Qinling*, also called *Ding Wenqing*, styled *Zhengyi* or *Renxiu*, and titled *Yafu Renxiu Zhenjun* (Perfected Lord of Subordinate Benevolence and Rest). Her appearance: radiant in complexion, wearing a chicken-headed crown, a white silk court robe, and a pale yellow skirt, with knitted brows, holding two crossbow bolts. She descends on Xuhai days to serve in the western halls of households.\n\nThe Dingwei Jade Maiden is named *Cheng Suling*, also called *Ding Jitong*, styled *Xuanying* or *Rengong*, and titled *Wubi Renzhi Zhenjun* (Perfected Lord of Incomparable Benevolence and Arrival). Her appearance: radiant in complexion, wearing a sheep-headed crown, a pink court robe, and a yellow skirt, smiling gently, holding a pair of halberds or a sword. She descends on Wuwei days to serve in the southern halls of households.\n\nThe Dingsi Jade Maiden is named *Zhu Fucheng*, also called *Ding Tingqing*, styled *Wenguang* or *Renjing*, and titled *Gaoshang Rende Zhenjun* (Perfected Lord of Lofty Benevolence and Virtue). Her appearance: dressed in a green court robe and a red skirt, wearing a snake-tailed crown, holding a long spear, and laughing heartily. She descends on Shenyou days to serve in the southeastern gardens and pavilions of households.\n\nThe Six Ding Yin Spirits, the Jade Maidens, each govern their respective domains. They wear crowns and tassels, green robes, white garments, and vermilion shoes, wielding swords, bows, and arrows. Should they manifest in the homes of their devotees on the days of the Six Ding, men and women who witness them must not be alarmed or shout in fear, lest they offend the spirits.\n\n**Duties of the Six Ding Jade Maidens**\nThe Dingmao Jade Maiden governs plants and trees. She can summon winds, rains, mists, and fogs to obscure paths, dispel droughts and plagues, and nurture crops. In heaven, she presides over the green qi of wood and the vitality of spring, guarding the human liver and ethereal soul, corresponding to azure stone.\n\nThe Dingchou Jade Maiden governs insects and beasts. She can mobilize treasures and reveal hidden stores, as well as enhance the growth of medicinal herbs to heal human ailments. In heaven, she presides over the central qi of the five grains and the four seasons, guarding the human *niwan* (mud-pill palace), corresponding to jasper.\n\nThe Dinghai Jade Maiden governs mountains and rivers. She can move Mount Tai, reduce it to a small hill, block roads, or dredge rivers and canals.\n\nThe Dinghai Jade Maiden can also split metals and stones and cleave the earth to open paths. In heaven, she presides over the black qi of water and the storage of winter, guarding the essence and kidneys, corresponding to dark stone.\n\nThe Dingyou Jade Maiden governs rivers and seas. She can stir winds and waves, scour sands to breach banks, and turn back tides to engulf the sun. She can also blow a single leaf into a boat of olive wood to ferry people across. In heaven, she presides over the white qi of metal and the harvest of autumn, guarding the lungs and corporeal soul, corresponding to white stone.\n\nThe Dingwei Jade Maiden governs mountains and waterways. She can transform yin soldiers to aid in battles and rescue those in peril—whether from childbirth, water, fire, or weapons. In heaven, she presides over the yellow qi of earth’s virtue, the surplus of the four seasons, guarding the spleen and stomach, corresponding to yellow stone.\n\nThe Dingsi Jade Maiden governs cities and altars. She can arrange formations to break sieges and capture cities or fortresses. She can also exhale to cure untimely chills and fevers. In heaven, she presides over the red qi of fire and the growth of summer, guarding the human heart and spirit, corresponding to red stone.\n\n**Method for Constructing the Altar**\nUse eighteen bamboo stakes: six measuring two feet and five inches, six measuring five feet, and six measuring four feet, arranged in three layers and nailed together. First, nail the five-foot stakes in the center, positioning six of them to form six sides. Place the True Martial Seal and a mirror (approximately two feet in diameter) atop this layer. Next, nail the four-foot stakes around them to mark the positions of the Six Ding Jade Maidens. On the central and second layers, hang twelve five-colored banners, tying them to the bamboo stakes according to their directional correspondences: black for the north-northwest (the *hai-zi* direction), green for the northeast (*yin-mao*), red for the southeast (*si-wu*), and white for the southwest (*shen-you*). Four additional banners are placed at the sides of the *chou* (north), *chen* (east), *wei* (west), and *xu* (north) directions, each four feet square and yellow in color. Finally, nail the remaining six stakes, each two feet and five inches long, and drape them with six strips of clean cloth.\n\nOnce the altar is laid out, use crimson thread to connect the three layers, forming six gates. Erect Six Ding banners at each gate, matching their colors to their directional positions. Inscribe each position with its respective talisman, ensuring all six face outward from the altar while their backs point inward. Prepare six wooden swords, six wooden knives, six small crossbows (each with two arrows), three halberds, and three spears, to be used by the Six Ding as needed.\n\nAt the central position, honor the True Martial’s station with offerings of wine, dishes, cakes, and three incense burners. On the third layer, present offerings of the five grains, mixed millet, vegetables, fruits, fresh fish, and dried venison (made from camphor and willow wood), along with six cups of wine and seven *huanxi* (joyous) balls.\n\nOn the grand assembly day, at the *jiazi* hour of the second watch of the night, face north and burn incense in a blazing fire. Gaze upon the North Star, earnestly pray as before, hold this scripture, and bow deeply to offer incense again. With a heart poured forth and spirit gathered, I prostrate and offer incense once more, pledging my sincerity.\n\nI, a disciple of the Most High Lord Lao, have long cultivated purity, reverently guarding the celestial mysteries and shunning the mundane to devote myself to the Great Dao. With utmost reverence, I humbly submit this petition, beseeching the true numina to look upon me with compassion. I have received the *Scripture of the Six Yin Jade Maidens of the Most High Lord Lao’s Cavern Mystery*, and wish to practice its methods—may the profound powers witness my resolve.\n\nAfter receiving this teaching, I dare not treat it lightly. Unless in dire emergencies to aid the state or save the people, I swear never to misuse it. Before the sacred presence, I solemnly vow these words.\n\nShould I fail to uphold these vows, I willingly accept punishment for my transgressions. In all matters of urgency or delay, in times of salvation and response, may the numinous powers grant their resonant protection.\n\nI prostrate and offer incense, advancing to silently intone: I now beseech two or three Jade Maidens to serve as my envoys, ascending to the celestial court and descending to traverse the world, wielding talismans and flying seals to dispel evil and subdue demons. May all their movements be at my command. I humbly pray that the sagely wisdom may deign to witness this.\n\nAgain I prostrate and offer incense, praying: Having presented my petition before the sacred presence, I now implore the host of Perfected Ones to ever grant their protection and safeguarding.\n\nAfter the rites conclude and the altar is withdrawn, on the night of *guihai*, I shall first draft a petition and talisman to summon the Six Ding Jade Maidens. Below is the prescribed format for the petition.\n\n**Petition Format for the Grand Assembly**\n\n[State] one’s native place, dharma rank, and name.\n\nTo the right, I, [Name], humbly reveal my sincere heart, venturing to address the True Origin. The purpose of this petition is as follows:\n\nNow, regarding [specific matter], I have heard of the True Writ of the Great Dao, the esoteric scriptures of the Cavern Mystery, the Six Yin Jade Maidens, and the Six Ding Great Spirits—whose benevolence pervades the Three Realms and extends universally to the Four Directions, aiding the state, delivering the people, pacifying humanity, and benefiting all beings.\n\nDeeply mindful that I, [Name], dwell in the mundane world, my body bound to the dusty realm, I aspire to practice these methods but have yet to receive their profound mysteries. First, I received from the lineage of [Master’s Name] the ancient methods of the *Yellow Emperor’s Cavern Mystery Scripture*, including the secret talismans, seals, incantations, and oral instructions of the Six Yin Jade Maidens and the Six Ding Great Spirits.\n\nI take refuge in and revere these teachings, aiding the true Dao, shielding my family, preserving my life, and assisting the state in saving the people.\n\nNow, on this [specific month and day] of the *jiazi* cycle, I humbly prepare these offerings and present my heartfelt sincerity. On the day of *guihai*, I shall formally submit this petition to invoke the descent of the true numina, praying for their gracious witness.\n\nThe essential petition is as follows:\n\nTo the right, I reverently beseech:\n- The True Lord of Infinite Benevolence and Blessing, the *Dingmao* Jade Maiden;\n- The True Lord of Vast Heaven and True Reality, the *Dingchou* Jade Maiden;\n- The True Lord of the Capital Prefecture and Primordial Benevolence, the *Dinghai* Jade Maiden;\n- The True Lord of Subduing Warriors and Benevolent Repose, the *Dingyou* Jade Maiden;\n- The True Lord of Unmatched Benevolence and Ultimate Perfection, the *Dingwei* Jade Maiden;\n- The True Lord of Lofty Excellence and Virtuous Power, the *Dingsi* Jade Maiden.\n\nI humbly await their true compassion to grant my request. May they deign to focus their attention and look upon my private intentions with favor.\n\nOn that day, may they specially descend in cloud chariots to alight upon the altar, secretly manifesting their responses and awaiting the resonance of their numinous power. I venture to offend the true majesty.\n\nMy heartfelt devotion is beyond measure; my urgency knows no bounds. I respectfully submit this petition for your consideration.\n\nRespectfully submitted.\nYear ___ Month ___ Day\n[Dharma Rank] Disciple [Name] petitions.\n\nFor external use, securely seal with a circular cover. Include six portions each of gold coins and cloud-horses, affixed with the six talismans of the petitioner’s own body, along with the seal impression and the dispatch talisman for the divine messengers. Burn the gold coins and send them forth, entrusting them to be delivered. Arrange an incense altar according to rank, bow twice toward the petitioning seat, and present the matters stated within.\n\nAdditionally, submit a separate sealed petition to the Perfected Warrior, True Lord.\n\n**Petition Formula for the Perfected Warrior**\n\nI humbly await the Perfected Warrior, True Lord, to descend to the altar site on the appointed day and witness the covenant in practice.\n\nOn the *Jiazi* day, the officiant must refrain from careless killing of living beings, maintaining a compassionate and harmonious disposition. Set up the altar station and proceed according to the prescribed rites. No unauthorized persons may enter the altar space; all tasks must be performed outside. Keep monks, nuns, women, elder brothers’ sons, and all poultry, dogs, and livestock from violating the precincts.\n\nThe offering of incense and the pouring of wine must be performed by the officiant alone, approaching the altar directly.\n\nFirst, present the invocation before the True Lord of the *Dingmao* day, then burn incense along with one talisman—this is the matching talisman. Recite the petitioner’s own incantation and draw the qi of the corresponding direction to blow upon it.\n\nNext, proceed in order to the True Lords of *Dingchou*, *Dinghai*, *Dingyou*, *Dingwei*, and *Dingsi*, invoking each in turn, burning their respective talismans, and drawing the qi of each direction to blow upon the altar.\n\nI humbly beseech the true numen to deign in great creation, descending in the ritual chariot upon my earnest supplication. Once all have been invoked in sequence:\n\nWith the left hand’s middle finger and the right hand’s *Great Execution Seal*, strike the teeth thirty-six times and recite the *Hidden Words of the Six Yin and Six Ding Jade Maidens and Eight Transcendent Essences*:\n\n**Incantation:**\n*\"The radiance of the Nine Qi of the Dragon,\nThe Five Peaks follow in its train.\nThe Four Saints of Heavenly Obscurity,\nThe Ten Origins and Eight Poles.\nThe Dipper Star of the Northern Numen,\nThe Twelve Daily Officers.\nThe Six Ding Jade Maidens,\nMay they bestow their true light.\nAssist the dharma’s command and restraint—\nI invoke the Mandate of the Supreme Venerable Lord of the Cavernous Subtleties.\"*\n\nRecite this three times. Then, in sequence, employ the hand seals of the Six Ding’s own body and summon the Jade Maidens by name, drawing the qi of each direction to blow into the altar.\n\nBurn the six talismans of the petitioner’s own body within the altar, strike the teeth, close the eyes, and visualize the six Jade Maidens descending to the altar site.\n\nFirst, invite the Perfected Warrior, True Lord, to descend to the altar. Bow twice, offer incense, and pray:\n\n*\"I now invoke the Perfected Warrior, True Lord. Next, I burn incense to summon the Second and Third Jade Maidens, who are already descending to their seats. I bow my head and prostrate myself again.*\n\n*I am a disciple of the Supreme Venerable Lord, long devoted to the sagely Dao, desiring eternal life, treading the path of purity, practicing profound and wondrous deeds, ever drawing near to the supreme Dao, and cultivating the sagely path. Above, I offer advancement to the Nine Mysteries and Seven Ancestors; below, I relieve the calamities of the myriad people. I uphold the dharma registers and act in accordance with the Daoist canons.*\n\n*Now, I wish to establish an altar and adorn a purified chamber. Following the canons, I prepare offerings to honor the True Lord. I rely upon your majestic radiance and humbly beseech your penetrating insight.*\n\n*Today, I seek the wondrous principles to pacify the nation and secure the people, to deploy water talismans, to inspect and govern demons. Above, to assist the state’s needs; below, to sustain human lives. To seek immortality and study the Dao, to benefit and succor the living.*\n\n*In all matters great or small, I depend upon the divine might of the immortals to act as my envoys, to aid my practice, to heed my commands, and to comply in all directions—east, west, south, and north. When named and their seals are drawn, may they arrive instantly. In every summons, may they respond with utmost urgency. Whatever I consult, let there be no breach of faith. May their words be remembered and engraved upon my heart and bones.\"*\n\nOnce more I offer incense and bow twice, then softly approach and humbly petition:\n\n“I receive the command of the Most High and the decree of the Jade Emperor to harmonize the cosmos, pacify and assist the state, dispatch troops and mobilize forces, expel demons and dispel evil. Today, I honor the immortal spirits, that they may serve as my eternal aides. You must adapt to my strategies and follow my works. Should any disobey, I shall enforce the command of the Most High and the decree of the Jade Emperor to sever your form and extinguish your being. I humbly beseech your numinous efficacy—may you incline your divine hearing.”\n\nAgain I bow, offering incense to the True Martial Lord. Thrice I lift the wine, then kneel and prostrate, knocking my teeth together, and pray:\n\n“On this day, month, and hour, your disciple [Name] reverently observes the night of the Grand Assembly, offering solemn sacrifice before the two or three Jade Maidens. I reflect that my nature is spontaneous, my heart receives the celestial script, my original master has made covenant, and the Most High has transmitted the details. Now, at this Grand Assembly, I modestly present this libation. The Wind Earl sweeps clean, the Rain Master purifies the altar. Your devoted disciple, with a heart fond of true auspices, declares his name and surname, wishing to receive your radiant presence. I vow lifelong devotion, never to forget. Today’s offering includes fine meats, dried delicacies, and fragrant incense; large jujubes from Anyi, small and plump; pure wine with floating froth, fresh seasonal vegetables, and white rice—excellent grain. May you drink to intoxication and eat to satiety, then follow my movements. Whatever prayers I utter, may each be fulfilled. Ever attend me, ever protect my side. My wishes shall prosper as I desire. Wherever I go, may you accompany the true ones. In concealment or manifestation, through all journeys, may you ensure eternal peace. Swiftly attain the great Dao, soon reach the immortal realm. In all my sufferings, may the true bring auspiciousness. In all my desires, may the true follow and fulfill. Defending the nation against foes, may all affairs be favorable. Guard and shield my body, concealed with heaven and earth.”\n\nI pour the libation, humbly invoking your partaking.\n\n*Swiftly, swiftly, in accordance with the statutes and decrees of the Most High.*\n\nAgain I bow and offer incense, reciting my personal mantra one by one, then draw in a breath of qi and blow it upon the altar. Secretly, I pray:\n\n“O Ding-Mao Jade Maiden, I have obtained the *True Writ of the Six Yin Essences from the Cavern of Mysteries* of the Most High. I know the names of the spirits, the names of the immortals. With this method, I summon immortals; with this method, I command spirits. They traverse the Three Realms, emerging from darkness into light. In movement, stillness, sitting, or standing, all depend on the immortal true ones. Summoned, they arrive instantly; invoked, they descend at once. All affairs of the human world shall be made known to me. May my gratitude be manifest—do not defy me.”\n\n*Swiftly, swiftly, in accordance with the statutes and decrees.*\n\nI draw qi from the Ding-Mao direction and blow it forth, then likewise from Ding-Chou and the remaining directions. Once more, I devoutly offer incense and bow.\n\nRising, I step toward Ding-Si, circling the altar to the left, beginning my pace eastward. I recite the incantation:\n\n“Empowering the Six Yin, emerging from darkness into light,\nFearless and undaunted, without alarm.\nFollow the turning of my talismans, pursue the path of my seals.\nDispel ten thousand calamities, gather blessings upon this body.\nActive by day, concealed by night—do not disobey my command.”\n\n*Swiftly, swiftly, in accordance with the statutes and decrees.*\n\nThus I circle the altar thrice, then return to my position, offer incense, and bow again. Taking one talisman, I roll it into a pellet and swallow it with the wine from the corresponding position. I bow in gratitude, then move to the next position, bow, and consume another talisman. In this manner, I complete the six positions, ingesting six talismans.\n\nStanding upright before the altar, I offer incense and bow once more. Silently, I recite:\n\n“I uphold this method, and thus I am the lord; the spirits are my ministers. Whatever I desire, the spirits shall follow my will. From this moment onward, never leave my side. Six portions of golden coin assist the true journey. In all undertakings, do not breach our covenant.”\n\nAfter burning the paper money, I clear the altar and consume the offerings myself. If not eaten, they are buried. The altar is then dismissed.\n\nThis is the ritual arrangement for the Grand Assembly; lesser gatherings differ. On the day of the dispersing *jia* within each ten-day period, when the corresponding Jade Maiden is honored, prepare a portion of paper money and horses for the offering. The sacrificial items include a portion of food, with the rest being incense, tea, and wine.\n\nThe Yellow Emperor said: Those who serve the Six Ding, desiring longevity, must observe the Six Ding days without engaging in lust or taking life. Further, they should cultivate inner and outer essence, abiding in centered rectitude—then they will not exceed six assemblies. The Six Ding will present you with the returning elixir, and through your affairs, you may attain the body of the Dao and become an earthbound immortal, thus achieving longevity.\n\nIf one seeks to pacify the nation and secure the state, to lead armies and campaign beyond the borders, achieving victory in every battle—those who serve the Six Ding, when the spirit manifests at the six assemblies, will clearly perceive its form. Do not harbor impure thoughts; be reverent and sincere, without wayward imaginings. Those who offend with perverse intent will be slain instantly.\n\nThe Six Ding can advance or retreat, defend cities, engage enemies, and deploy the eight extraordinary formations. They can also penetrate the secrets of enemy states, discern the hearts of adversaries, and comprehend all strategies and plans. In all practices, establishing merit and founding enterprises, commencing construction, marriages, gambling, competitions, praying for rain or wind, subduing bandits, destroying temples, dispelling poisons, slaying monsters, beheading dragons, or driving away tigers—there is nothing they do not verify.\n\nFor healing illnesses and eliminating harm, this method contains its own regulations. Those who serve but do not seek longevity, desiring wealth and honor instead, may have the Six Ding drive forth treasures and manage the workings of creation.\n\nIf one serving wishes to know whether their parents are alive or deceased, upon invocation, the answer will come at once. If one desires to know their own future affairs—length of life or brevity—invoking the Six Ding will reveal the truth. In all undertakings, there will be corresponding responses.\n\nAt the first Grand Assembly on the *jiazi* day, consume the talisman; at the second assembly, it is unnecessary. If beginning with the first assembly, consume six talismans in one ten-day period, totaling thirty-six talismans over six assemblies.\n\nIf at the first Grand Assembly one consumes thirty-six talismans, there is no need to consume them at the second. Perform the rites according to the prescribed form. Should one fail to complete the six Grand Assemblies within a year, fulfilling them over two years will suffice, including the minor assemblies without omission.\n\nFor all assemblies, when inscribing the Six Ding talismans and other talismans, use cinnabar on yellow paper, and impress them with the True Warrior seal. *Secret Repository of the Mysterious Transformations: The Six Yin Cavern Essentials of the Hidden Dao of the Eighteen Cyclical Branches, Scroll the Middle* concludes here.\n\n*Secret Repository of the Mysterious Transformations: The Six Yin Cavern Essentials of the Hidden Dao of the Eighteen Cyclical Branches, Scroll the Lower*\n**Method for Erecting the Altar**\n**Diagram of the Altar’s Form**\n\nFor the altar’s construction, prepare eighteen poles: six measuring four feet in length, six measuring two feet and five inches, and six measuring five feet and five inches. First, take the five-foot-five-inch poles and drive them into the center, arranging them into six sides. Cover the top with clean cloth, forming a square or circle approximately two feet across. Next, affix the four-foot poles, followed by the two-foot-five-inch poles. Once secured, encircle them with crimson thread to delineate six sides, forming a square or circle approximately six feet across. The second tier should measure four feet, and the third two feet.\n\nOn the second tier, place twelve millstones, one for each branch from *zi* to *hai*, painted in their corresponding colors. For instance, *hai* and *zi* belong to Water and should be black; arrange them in order. Beneath each tier, place clean cloth or small tables on all six sides, each bearing a wooden sword, standing at the altar’s base.\n\nAt the center of the first tier, place the True Warrior seal alongside a round mirror. Affix the Six Ding banners to the poles: *ding-chou* in yellow, *ding-mao* in blue-green, *ding-si* in red, *ding-wei* in yellow, *ding-you* in white, and *ding-hai* in black.\n\nOn the second tier, arrange the Six Ding positions. At the *ding-you* position, place a small crossbow with two arrows. At the *ding-si* position, place a small halberd. At the *ding-hai* position, place a sword. At the *ding-mao* position, place another sword. The remaining two positions remain unoccupied.\n\nPrepare six jujube-wood tablets, painting the true forms of the Jade Maidens upon them. Beneath each image, inscribe the talisman in cinnabar, placing each at its respective position. Arrange them according to the method, each side facing outward, backs toward one another.\n\nWhen initiating rites, perform them before the deity corresponding to the occasion. For regular worship, set the offering mat before the *ding-hai* side, facing north toward the True Warrior.\n\n**Offerings within the Altar**\nSix portions of mixed grains from the Five Grains.\n\nSix censers. Six cups of tea. Six strips of pure cloth. Six fresh fish. Six plates of dried venison. Six cups of wine. These are the rites for the grand assembly. For minor assemblies, perform the offerings to the deity of the respective ten-day period, burning six portions of spirit money. During rites, never utter the term \"Six Ding,\" for the Jade Maidens hold this character taboo. Refer only to the \"Second and Third Jade Maidens\"; in the grand assembly of the *wu* noon, there are but six. The *jia-zi* day marks the grand assembly. For other rites, observe only the Six Ding days, offering at each respective position. For instance, on the *ding-chou* day, use the prescribed items only for the *ding-chou* deity, while the remaining five positions receive only incense and tea. On the *jia-zi* grand assembly day, perform the rites as before, offering to all.\n\nWhen not in use, dismantle the altar. However, after the sixth assembly, leave it intact for further rites. Generally, when the six rituals reach completion, a devout practitioner may perform the annual rites—this is most auspicious. Upon completing the six rites, retain the altar within the chamber, entering and exiting alone each day, strictly forbidding others from seeing it. For within a year, there are six grand assemblies and thirty-six minor ones. If affairs are numerous and the year’s rites insufficient, perform one grand assembly. Never neglect a minor assembly, lest it invite misfortune.\n\nIn all invocations and supplications, the drawing of talismans upon the altar, the method of depicting divine images, and the inscription of names must adhere strictly to the prescribed forms.\n\n*Ding-mao* Talisman\n*Ding-chou* Talisman\n\n*Ding-hai* Talisman\n*Ding-you* Talisman\n*Ding-wei* Talisman\n*Ding-si* Talisman\nSix Yin Talismans\n\nThese talismans are inscribed on jujube wood tablets, each one *cun* and five *fen* in size. One side bears the talisman, while the reverse is carved with the name of the Jade Maiden. They are worn within the hair and must not be removed except when combing.\n\nThe Jade Maiden of *Ding-mao* is named *Zubao Zhong*, with the title *Wuji Zhenjun* (True Lord of the Ultimateless). This talisman is written on yellow paper and placed at the station of the *Ding-mao* Jade Maiden, with an additional inscription affixed to the front of the memorial. The incantation reads:\n\n*\"O True One of the Ultimateless, embodied in the Day of the Foot.\nBe summoned by me, act as I command.\nSwiftly, swiftly, as decreed by statute and ordinance!\"*\n\nUpon completion, recite the incantation three times. Draw the *qi* of the eastern direction and blow it onto the talisman. With both hands, form the *Dashai* mudra, and tread the *Ding* step upon the solar path. Conceal the form, and so forth.\n\n*Ding-mao* Union Talisman\nThis talisman, inscribed at the *Ding-mao* station in red on yellow paper, is made in sets of nine following the previous method and consumed with wine.\n\nThe Jade Maiden of *Ding-chou* is named *Qi Wushang*, with the title *Hengtian Zhenjun* (True Lord Traversing Heaven). This talisman is placed beneath the station of the *Ding-chou* Jade Maiden, with an additional inscription affixed to the front of the memorial for general use. The incantation reads:\n\n*\"O Most Sagely of Great Harmony, True One Traversing Heaven.\nBe directed by me, follow my decree.\nSwiftly, swiftly, as decreed by statute and ordinance!\"*\n\nUpon completion, draw the *qi* of the northern direction and blow it onto the talisman, reciting the mantra three times.\n\n*Ding-chou* Union Talisman\nThis talisman, following the same incantation, mudra, and *qi* as before, is made in sets of nine and consumed with wine from its respective station.\n\nThe Jade Maiden of *Ding-hai* is named *Luming Ji*, with the title *Dufu Zhenjun* (True Lord of the Capital Prefecture). This talisman is inscribed in red on yellow paper and placed beneath the station of the *Ding-hai* Jade Maiden, with an additional inscription affixed to the front of the memorial. The incantation reads:\n\n*\"O True Lord of Broad Yang, named Luming.\nBe directed by me, assist my actions.\nSwiftly, swiftly, as decreed by statute and ordinance!\"*\n\nRecite the incantation three times and draw the *qi* of the northern direction into the talisman.\n\n*Ding-hai* Union Talisman\nThis talisman, following the same method of inscription, incantation, mudra, and *qi* as before, is made in sets of nine and consumed with wine from its respective station.\n\nThe Jade Maiden of *Ding-you* is named *Jiuqin Ling*, with the title *Yafu Zhenjun* (True Lord Subordinate). This talisman is inscribed in red on yellow paper and placed at the *Ding-you* station, with an additional inscription affixed to the front of the memorial. Draw the *qi* of the western direction and blow it onto the talisman. The incantation reads:\n\n*\"O Spirit of Salvation and Reverence, Great True One Subordinate.\nBe directed by me, aid my actions.\nSwiftly, swiftly, as decreed by statute and ordinance!\"*\n\n*Ding-you* Union Talisman\nThis talisman, following the same method of inscription, incantation, mudra, and *qi* as before, is made in sets of nine and consumed with wine from its respective station.\n\nThe Jade Maiden of *Ding-wei* is named *Cheng Suling*, with the title *Wubi Zhenjun* (Incomparable True Lord). This talisman is inscribed in red on yellow paper and placed before the *Ding-wei* station, with an additional inscription affixed to the front of the memorial. The incantation reads:\n\n*\"Incomparable True Lord, named Suling.\nBe directed by me, heed my words.\nSwiftly, swiftly, as decreed by statute and ordinance!\"*\n\nRecite the incantation three times and draw the *qi* of the southern direction into the talisman.\n\n*Ding-wei* Union Talisman\nThis talisman, following the same method of inscription, incantation, mudra, and *qi* as before, is made in sets of nine and consumed with wine from its respective station.\n\nThe Jade Maiden of *Ding-si* is named *Zhu Fucheng*, with the title *Gaoshang Zhenjun* (Supreme True Lord). This talisman is inscribed in red on yellow paper and placed at the *Ding-si* station, with an additional inscription affixed to the front of the memorial. The incantation reads:\n\n*\"Supreme True One, named Fucheng.\nBe directed by me, attend my words.\nSwiftly, swiftly, as decreed by statute and ordinance!\"*\n\nDraw the *qi* of the southern direction and blow it onto the talisman.\n\n*Ding-si* Union Talisman\nFollowing the same incantation, *qi*, and method as before, form into pellets and consume with wine from its respective station.\n\nFor all Jade Maiden talismans, when summoning for use, inscribe the invocation phrase by phrase. This may be done on the memorial or on its reverse, detailing the matter at hand. Seal with the *Zhenwu* seal on the front and the *Liuding* seal on the reverse. Invoke using the Jade Maiden spirit incantation, *qi*, and mudra as before—great spiritual efficacy will be attained.\n\nAnother method: Use a talisman two *cun* in size. Inscribe the talisman on one side and engrave the name on the reverse, writing in red on jujube wood. Recite the incantation three times and place it upon the altar.\n\nDays for the Descent of the *Liuding* Talismans and Names:\n*Ding-mao* Jade Maiden: *Song Juanwenbo* – descends on *zi-chou* days\n*Ding-chou* Jade Maiden: *Liang Qiyuangong* – descends on *yin-mao* days\n*Ding-hai* Jade Maiden: *Yao Maowendao* – descends on *si-wu* days\n*Ding-you* Jade Maiden: *Shen Qiaowenqing* – descends on *xu-hai* days\n*Ding-wei* Jade Maiden: *Zhu Diaoshengtong* – descends on *shen-you* days\n*Ding-si* Jade Maiden: *Chen Juntinqing* – descends on *chen-si* days\n\nThe True Warrior Seal measures two *cun* and four *fen* in width and three *cun* and two *fen* in length. There are two forms: the Yang Seal and the Yin Seal. For these two seals, select *geng-shen*, *yi-si*, *jia-yin*, or *ji-hai* days to carve the Yin and Yang seals from jujube wood, then wear them on the arms—hang the Yang Seal on the left arm and the Yin Seal on the right. When using the seal at midday, employ the Yang Seal to invoke dreams from lords and nobles. For all matters imitating Heaven and governed by Yang—such as praying for rain, sunshine, or snow—use this seal. It is the seal of the three Jade Maidens: *Ding-mao*, *Ding-chou*, and *Ding-hai*, and thus belongs to Yang. The intentions of these Jade Maidens shift in accordance with this seal, and all matters are governed by the Yang Seal. For the Yin Seal, hang it on the right arm and use it at night. For all matters imitating Earth and governed by Yin—such as seeking wealth, commanding ghosts, dispelling demons, nocturnal prayers, subterranean actions, entering water, or venturing into darkness—imprint with this Yin Seal. It is the seal of the three Jade Maidens: *Ding-si*, *Ding-wei*, and *Ding-you*, and thus belongs to Yin. These three Jade Maidens act in accordance with the seal’s use, and all matters are governed by the Yin Seal.\n\n**Ritual for Consecrating the Seals**\nAfter carving the two seals, perform the grand assembly on a *jia-zi* day. Set up a mat beneath the Northern Asterism and invoke: *\"I respectfully invite □□□□□□□ True Lord to descend. Your servant, following the methods of the Most High, has carved the Yin and Yang Six Yin Cavern-Subtle Seals to command the Jade Maidens. May your mighty power be manifest.\"* First, awaken the seal’s true efficacy and confirm the covenant, then offer incense. Hold the seals in both hands, gaze at the Northern Dipper, and draw in the true *qi* of the Northern Dipper. Progressing in order to □, inhale *qi* once and blow it onto the seal. Repeat this three times for each seal. Fasten the seals with five-colored threads and wear them on the left and right arms. Wear them during consecration, use, and all movements when entering or exiting. When not in use at home, do not wear them; instead, place them on the altar for veneration. During leisure or when not in use, offer a cup of pure water in the morning as veneration—do not perform ordinary rituals. On the day of the grand assembly, strictly avoid sexual activity, impurity, or the proximity of meat and fish. Frequently swallow saliva to cleanse the five viscera. This scripture is as profound as the hidden arts of immortals, the foremost rule of all techniques, rooted in Heaven and Earth, enduring through ancient and modern times. If later generations encounter it, they are destined for immortality, blessed by past lives—this is no trivial matter. Even if unused, storing and revering it at home ensures no misfortune dares enter. Sincerity is paramount; do not treat it like other texts. Store it in a vessel of purity and tranquility, free from defilement or idle words. Do not casually handle it at inappropriate times, nor harbor impure intentions. Though intended to aid the living and the dead, misuse may bring calamity and retribution. Practitioners must uphold integrity and exercise deep caution. Utmost reverence! The adaptable methods of this Dharma gate are detailed in the following scroll.\n\n**Methods for Using the Six Ding Jade Maidens’ Seals**\nThe seals’ specifications: two *cun* and four *fen* in width, three *cun* and two *fen* in length. Choose a day corresponding to the wood’s birth, harvest jujube wood, and carve the seals on a *jia-zi* or *geng-shen* day, imprinting them with talismanic scripts. Consecrate them according to the previous method; do not use them indiscriminately. In times of urgent peril, hang them and cover them with clothing to avert disaster. Store them in a pouch of crimson silk; do not let others see them, lest their efficacy wane.\n\n**Methods of Practice**\nFirst perform the consecration, then proceed with adaptable techniques. Consecration precedes adaptation. For all actions—invoking dreams, seeking objects, hunting, commanding troops, dispatching spirits, praying for drought or flood, ascending mountains, entering water, capturing thieves, subduing demons, seeking office, pursuing immortality, acquiring servants, welcoming or concealing gentlemen, expelling petty men, or myriad other purposes—each has its own talismanic method. Be utterly sincere and solemn; do not treat this lightly. Whether facing earth or heaven, employ them correctly. Not only do they secure the state and aid the nation, but they also protect the Dao and nurture the body. Any deviation into wickedness will bring guilt upon nine generations. Sincerity lies in venerating the two or three Jade Maidens on the crown of the head. On *geng-shen*, *yi-si*, *jia-yin*, or *ji-hai* days, take the heartwood of jujube, carve the names and talismans of the two or three Jade Maidens on each of its four sides, and place it in a pouch of five-colored silk to wear on the crown of the head. Do not remove it except when combing hair.\n\n**Talismanic Scripts**\nFor all talismanic commands, use cinnabar; if unavailable, ink may suffice. For each action, face the three positions of the current ten-day period, bow, and proceed—other spirits will assist. Write the names of the three divinatory spirits of the ten-day period (the Jade Maidens) beside the talisman. Imprint it with the True Warrior Seal using cinnabar, applying both Yin and Yang seals in sequence. For Yang matters, use the Yang Seal on the left arm; for Yin matters, use the Yin Seal on the right. For ordinary talisman ingestion or use, follow this method precisely. Be meticulous and do not treat it casually.\n\n**Responsive Talismans for Invoking Dreams (Six Methods)**\n**First Method: Talisman for Invoking the Emperor’s Dream**\nThis talisman invokes dreams from the supreme ruler. After performing the sixfold consecration, the Jade Maidens will naturally appear. Do not burn the talisman; the Jade Maidens will take it themselves. When using this talisman, dispatch the Jade Maiden of the current ten-day period, with other spirits assisting. Write this talisman in cinnabar at dawn, then inscribe the name of the Jade Maiden True Lord of the current ten-day period beside it.\n\nFirst, affix the True Martial Seal, then lightly impress with the Yang Seal once, and next inscribe the Talisman for Opening the Forbidden Gate.\n\n**Second: Talisman for Opening the Forbidden Gate**\nThis is the Talisman for Opening the Forbidden Gate. Inscribe it following the previous method, including the spirit’s name, and impress it with the True Martial Seal and the Yin-Yang Seals.\n\nHold these two talismans together before the Jade Maiden of the Three Divinations of the current ten-day period and pray: \"I now seek such-and-such a matter—state your intent as you wish. Dispatch the spirits to bear these two talismans directly before the Emperor, to open the forbidden gates of the imperial court. In the dream, present this to the Emperor: ‘So-and-so of such-and-such prefecture and county, of such-and-such name and age, has practiced the Great Teaching to bring peace to the realm for the Emperor. May the Emperor protect him well and not allow harm to befall him.’ Whether seeking office or other matters, state your request as you wish.\"\n\nAfter thus making your petition, offer a portion of clear wine and gold coins, along with the talismans, incense, tea, lamps, and vegetables, before the True Lord Jade Maiden of the current ten-day period. At the second watch of the night, recite the incantation of the Three Divinations of the current ten-day period three times. Take the paper from beneath the name of the spirit present, burn it all at once, and say: \"Go swiftly, respond swiftly—do not delay.\" Then blow out the lamp, clear the tea, and sit again until the end of the third watch before sleeping. Within ten days, there will surely be a response. The August Lord will certainly accept the matters entrusted by the spirits; there will be no failure. This applies equally to seeking office or any other purpose.\n\nFor the method of summoning dreams through the Five Tones, follow the previous instructions for preparation and dispatch, except that the talisman for opening the forbidden door is not used. This is essential. Officials, monks, and Daoists should each apply the method according to their corresponding tone.\n\n**Five Talismans for Summoning Dreams Through the Five Tones**\n- **Gong Tone**\n- **Shang Tone**\n- **Jue Tone**\n- **Zhi Tone**\n- **Yu Tone**\n\nThese talismans summon dreams from individuals whose surnames correspond to the Five Tones. Write them using the previous method. Do not use the talisman for opening the forbidden door, and do not let commoners see it. It is essential and may be used by officials, scholars, commoners, monks, nuns, and Daoists alike—each according to their tone and surname—with unfailing efficacy.\n\n---\n\n**Method for Praying for Rain or Clear Skies**\nTo pray for rain, clear skies, or snow, each season has its presiding deities:\n- **Spring:** True Lord Taihe, True Lord Taixuan, True Lord Taimin\n- **Summer:** True Lord Shaoyi, True Lord Shaowei, True Lord Shaoming\n- **Autumn:** True Lord Taiwu, True Lord Taiquan, True Lord Taigong\n- **Winter:** True Lord Shaogu, True Lord Shao□, True Lord Shaoling\n\nIn spring, make offerings in the Qian-Hai direction (the direction of flourishing qi).\nIn summer, make offerings in the Gen-Yin location.\nIn autumn, make offerings in the Xun-Si direction.\nIn winter, make offerings in the Kun-Shen location.\nThese are the directions of longevity for each season.\n\n**Three Talismans for Summoning the Seasonal True Lords**\nWrite these three talismans, replacing the names of the True Lords according to the season. Before the Jade Maiden of the current ten-day period, pray: *\"I see that the people suffer from a lack of rain, and the common folk are without livelihood. I now dispatch spirits to deliver this to the three True Lords. Tomorrow, they shall arrive at the altar in the designated direction to receive my petition.\"*\n\nFor spring, summer, autumn, and winter, change the offering to one portion of green coins to send them on their journey. Swiftly, swiftly—burn the paper and talisman in the Qian-Hai direction (the location for spring offerings to the True Lords Taihe, Taixuan, and Taimin). For summer, autumn, and winter, summon the respective True Lords in their designated directions. Set up the altar, and offer incense, lamps, wine, and fruit.\n\nLight the incense, bow twice, and knock your teeth while sincerely praying: *\"I have heard that the azure heavens are vast and the mysterious true ones boundless. Though I am foolish, my nature aligns with the Upper Clarity. Now the people suffer without livelihood, and I seek rain. I long for nourishing rains, or clear skies. I humbly perform this ritual, beseeching the mysterious true ones. Accept my modest offering, and may you see my heart. Take this talisman of mine and present it on my behalf. May the August Heaven look upon me with favor and grant sweet rains or clear skies. I present this earnest plea with secret talismanic script. I implore your true compassion to incline your ears and listen. Three portions of green coins are offered to send you on your journey. I await your response, which shall come without delay.\"*\n\nBurn the paper along with the talisman and close the ritual.\n\n**Talisman for Praying for Rain**\n**Talisman for Praying for Clear Skies**\nThese talismans must be folded five times at the corners and sealed with an imprint. Use them as described above; they are talismans for petitioning the August Lord of Heaven and must not be used lightly.\n\n**Talisman for Seeking Snow**\nFollow the same method of prayer as above.\n\n**Talisman for Summoning Wind**\nIf you wish to summon wind or clouds, each season has its direction:\n- Spring: East\n- Summer: South\n- Autumn: West\n- Winter: North\n\nNotify the Jade Maiden and burn the talisman. A great call brings a great wind; a small call brings a small wind.\n\n---\n\n**Talisman for Communicating with Immortals**\nWhen performing this method to reach a certain place, write one talisman in cinnabar, notify the Jade Maiden, and place it in the hand of the Daoist. Close your eyes and conceal your gaze—you will arrive instantly.\n\n**Talisman for Extending Life**\nThis talisman grants long life and causes others to hold you in affection and respect.\n\n**Talisman for Fulfilling Wishes**\nFor whatever you desire, imprint it with the seal of Zhenwu and place it in the appropriate location. Notify the Jade Maiden, and the object will come to you as you wish.\n\n**Talisman for the Pillow**\nWrite this talisman in cinnabar and place it inside your pillow. Evil spirits will dissipate, petty people will stay away, and noble ones will draw near. If immortals wish to visit, you will receive dream omens in advance.\n\n**Talisman for Making Someone Turn Toward You**\nTo make someone turn toward you, write three talismans in cinnabar. Notify the Jade Maiden with one, tie one to your arm, and hold one in your mouth. The person will then turn toward you in devotion.\n\n**Talisman for Making Someone Hold You in Affection**\nWrite in cinnabar, notify the Jade Maiden, and inscribe the person’s name, age, and corresponding star beneath the talisman. The person will naturally hold you in affection.\n\n**Talisman for Obtaining Wine**\n**Talisman for Obtaining Food**\nTo obtain wine or food, write three talismans before the Jade Maiden of the current ten-day period and burn them before the deity. Wine and food will be sent to you.\n\n**Talisman for Obtaining Servants (written in cinnabar on yellow paper)**\nTo seek male or female servants, write the talisman in advance and burn it before the Jade Maiden of the current ten-day period. Servants will come of their own accord, with extraordinary efficacy.\n\n**Talisman for Obtaining Female Servants**\n**Talisman for Summoning Acquaintances**\nTo summon an acquaintance, first write the talisman, then write the person’s name on it. Pray to the Jade Maiden of the current ten-day period: *\"I wish to see this person come.\"* The person will arrive.\n\n**Talisman for Prosperity and Profit**\nWrite in cinnabar, notify the Jade Maiden, and carry it with you—your prosperity and profit will increase a hundredfold. If someone wishes to accumulate wealth, write in cinnabar on a peachwood board and hang it beneath the door. Merchants will come of their own accord, and wealth and profit will flourish.\n\n**Talisman for Entering Water**\nBefore using this talisman, notify the Jade Maiden. Write two talismans in cinnabar, imprint them with the seal, and affix them to the soles of your left and right feet. You will walk upon water as if on level ground.\n\n**Talisman for Entering the Sea**\nNotify the Jade Maiden first, then cast this talisman into the sea. Dragon spirits will protect you, and the waves will calm. If you wish the ship to stop, it will stop; if you wish it to sail, it will sail—all will respond immediately.\n\n**Three Talismans for Military Campaigns**\nThese three talismans are used in military operations. Write them sincerely in cinnabar. First, dispatch the Jade Maiden to deliver these three talismans to the guardian spirits of the enemy. Then, inscribe three more talismans and bury them in the battlefield. It is even better to have the commanding officer carry all three talismans.\n\n**Talisman for Concealment and Invisibility Within Enemy Encampments**\nIf you wish to enter an enemy camp to carry out a mission, write this talisman six times and notify the Jade Maiden. Swallow three, place one on your head, and hold one in each hand. Perform the Yu Step and enter the encampment—you will walk through the enemy ranks unseen.\n\n**Three Talismans for Commanding Ghosts and Spirits**\n\n**First Talisman**\nWhenever you wish to command ghostly soldiers, first inscribe this talisman before the Jade Maiden of the current旬 and recite the following invocation: *\"For such-and-such matter in such-and-such place, I now intend to take action—let the ritual proceed as I will. May the gods I summon transmit this talisman swiftly to the Generals of the Five Roads. By such-and-such day, dispatch a set number of halberds, spears, staves, bows, and crossbows, all fully prepared, to my side. Follow my commands without delay, and the task shall be swiftly completed. Should you disobey my orders, I shall slay ghosts and execute spirits—let none say they were not warned.\"* Burn the talisman at once and depart.\n\n**Second Talisman**\nInscribe this talisman with the same sincerity in cinnabar as before. Perform the Yu Step to the gate and address the Generals of the Five Roads: *\"You and two or three Jade Maidens, along with the ghostly officers and soldiers, shall immediately proceed to such-and-such place to complete such-and-such task. It must be accomplished without delay—no procrastination shall be tolerated. Should you falter, I shall strike off your heads.\"* After the labor is done, each shall receive money and wine in gratitude for their toil.\n\n**Urgent, urgent—by the statutes and commands!** Burn the talisman and proceed.\n\n**Third Talisman**\nShould you wish to perform this method, first announce it to the Jade Maidens and have someone inscribe the talisman to carry to the work site. Alternatively, drive it in before or after, or use a seal. Once the task is complete, burn paper money in gratitude. The divine response is unfathomable—wondrous beyond wonder.\n\n**Talisman for Summoning Spirits**\nFor this method, use the True Warrior’s seal to imprint and address the Jade Maidens. Burn one talisman to the local earth deity of the new boundary and inquire: *\"What strange occurrences are here?\"*\n\n**Talisman for Pursuing Souls**\nThis method is used to suppress enemies or for official matters. First, write the target’s name, birth year, month, day, and hour, along with the intent, beneath the talisman. Take one chicken egg, a tangle of hair, and the talisman, then crush the egg and mix it with the talisman in a container. Perform the ritual and bury it at the Ghost Gate—unceasing until the target grows dazed and stuporous as if drunk.\n*Secret, secret, secret, secret, secret—do not misuse.*\n\n**Talisman for Capturing Bandits**\nTo apprehend thieves, first notify the Jade Maidens. Burn incense, inscribe five talismans, and bury one at each of the Five Roads—the bandits will be seized.\n\n**Taming Tiger Talisman (also called Slaying Tiger Talisman)**\nIf dwelling in the mountains, inscribe this talisman in cinnabar, address the Jade Maidens, and affix it to the mountain—the tiger will come of its own accord and submit beneath the talisman. Alternatively, cast it where the tiger dwells, and it will arrive to receive its execution.\n\n**Subduing Dragon Talisman (also called Slaying Dragon Talisman)**\nFor this method, cast it into the source of a flood, and the dragon will die, rising to the water’s surface.\n\n**Hunting Talisman**\nFor hunting, as before, inscribe the talisman and address the local deities. Carry it with you after inscribing it—success will come naturally.\n\n**Talisman for Gathering Strange Beings**\nTo summon snakes, lure spirits, gather crows, or draw fish, use two talismans of this kind. Address the Jade Maidens and burn one, while holding the other in hand. Place one in your mouth, call softly, and whatever you desire will arrive. To dismiss them, burn the talisman in hand outside the gate.\n\n**Talisman for Borrowing Ghost Soldiers While Traveling**\nWhen journeying and wishing to borrow ghost soldiers for protection along the way, inscribe one talisman. Specify how many ghost officers you require for assistance, and upon reaching your destination, send them back immediately.\n\n**Talisman for Filling Breaches**\nFor broken or eroded ravines, address the Jade Maidens. Inscribe two talismans in cinnabar—one to notify the Jade Maidens, the other to bury at the site. The breach will naturally fill and restore itself; retrieve and burn the talisman afterward.\n\n**Talisman for Childbirth**\nTo aid delivery, inscribe four talismans. Present one to the Jade Maidens and burn three, giving them to the person requesting the talisman. Have them mix the ashes with clean water for the mother to swallow. If the child is male, have him hold the talisman in his left hand as he emerges; if female, in her right. For a stillborn, place the talisman on its crown to draw it out. For a transverse birth, the bones will soften, and delivery will follow.\n\n**Talisman for Wrongful Death**\nFor those who die unjustly—by drowning, hanging, well-jumping, or sudden demise—quickly inscribe this talisman on their left or right side. Write the name of the Jade Maiden of the current ten-day period and address her: *\"Here lies one who has perished suddenly from such-and-such cause. I use this talisman to save them.\"* Command the spirits to act swiftly, rescue and restore the soul to the afflicted’s body, and revive them at once. Place the talisman in their mouth and apply three moxa cauteries to the crown—they will revive immediately.\n\n**Talisman for Capturing Ghosts**\nInscribe in cinnabar to summon the Jade Maidens, then bury, drive in, or affix it—the ghost will perish.\n\n**Three Talismans for Curing All Illnesses**\nTo employ these talismans for healing, use the three on the right to treat all ailments. Burn incense and address the Jade Maidens of the current two ten-day periods: *\"I now treat so-and-so’s illness. Spirits, lend your power—follow the talisman to heal, expel ghosts, and banish evil. Upon its arrival, act without delay.\"* Write the Jade Maidens’ names on the talisman, burn it with true incense, and have the patient swallow it—they will recover.\n\n**Talisman for the Plague Deity**\nInscribe this talisman on yellow paper in cinnabar. The day before use, inscribe one and perform the method before the Jade Maiden of the current ten-day period: *\"Carry this talisman for me to such-and-such place, to the home of so-and-so. Deities of fate, prohibitions, and their retinues—I come tomorrow to cure plague and slay ghosts. Swiftly summon the local temple spirits to await my commands. Go swiftly, go swiftly!\"* Then burn it.\n\n**Talisman for Plague Demons**\nUse a sheet of paper five *cun* wide and seven *cun* long. Have the patient sign it, then inscribe the talisman over their mark. This talisman commands the Six Spirits and Deities of Fate.\n\n**Another Talisman for Plague**\nHave the person write a decorative character, then inscribe the talisman on their back to treat plague demons.\n\n**Talisman for Ingesting to Cure Plague**\nAdminister this talisman with a decoction of *jiangxiang*. First, write: *\"White Jade Maiden, cure the plague, seize the source of illness, and safeguard peace.\"* The patient will recover.\n\n**Talisman for Verifying Illness Regardless of Distance**\nTo treat a patient, inscribe one talisman in cinnabar on yellow paper and stamp it with the True Warrior’s seal. First, notify the Jade Maiden of the current ten-day period, then burn and observe—whatever ailment afflicts the patient will be cured. If the patient is three to five *li* away, visualize their location, address the Jade Maiden, inscribe the talisman, stamp it, burn it, and blow the ashes toward their direction. Even if they are a thousand *li* away, invoke their location—the results will be certain.\n\n**Method for Treating Illness**\nReverently invoke:\n- The *Dingmao* spirit of the *Jiazi* ten-day period,\n- The *Dingchou* spirit of the *Jiaxu* ten-day period,\n- The *Dinghai* spirit of the *Jiashen* ten-day period,\n- The *Dingyou* spirit of the *Jiawu* ten-day period,\n- The *Dingwei* spirit of the *Jiachen* ten-day period,\n- The *Dingsi* spirit of the *Jiayin* ten-day period.\n\n*\"Proceed to heal the illness of so-and-so, who suffers from such-and-such ailment. I beseech you to resolve their misfortune, dispel calamity, and swiftly restore their soul. The moment the talisman arrives, act without delay!\"*\n**Urgent, urgent—by the statutes and commands of the Highest Clarity!**\nOnce the command is given, proceed at once to heal—the cure will be immediate.\n\n**Six Talismans for Healing**\nOn each talisman, depict the true form of the Jade Maiden standing upright. When treating illness, do not use the seal at the head.\n\n**Talisman Incantation**\nBy the decree of the Nine Heavens, the talisman of the sun, moon, and stars descends. To the left, command the Azure Dragon; to the right, command the White Tiger; ahead, command the Vermilion Bird; behind, command the Dark Warrior. Four hundred thousand spirits—ward off all inauspicious omens. Wherever the talisman arrives, perpetual harmony and uprightness prevail, and all malevolent spirits vanish into the earth. **Urgent, urgent—by the statutes and commands!**\n\n**Method for Casting Talismans at the Spirit’s Seat**\nIf a person of meager fortune fails to summon the spirits, or if the response is sluggish, proceed thus: inscribe the talisman of the current ten-day period, recite the incantation, and cast it before the spirit’s seat—the spirit will arrive swiftly.\nFor example, in the *Jiazi* ten-day period, inscribe the *Mao* talisman; follow this pattern for others.\n**Incantation:** *\"Reverently invoke the *Zi* and *Mao* spirits of the *Jiazi* ten-day period. Proceed to such-and-such place to attend to matters and save the afflicted. Act with haste—do not disobey.\"*\nAfter reciting the incantation, cast the talisman before the seat of the *Dingmao* spirit and halt. Even across a thousand *li*, the response will be immediate. Inquire about matters of fortune or misfortune, and the spirits will reveal them.\nTo bind ghosts and spirits, simply press the \"ghost’s eye\" between your fingers—the ghost will perish at once. If a malevolent person approaches, write their name, swallow it, and press the \"eye\"—they will come of their own accord.\n\n**Talisman for Casting the Six Ding Spirits at Their Seats**\nWhen inscribing talismans, visualize the Jade Maiden as you begin. To sever copper or steel, first mark twenty-eight points, symbolizing the twenty-eight constellations. Recite the star incantation four times, symbolizing the four seasons, and eight times, symbolizing the eight solar terms. Each point must be made in a single stroke—do not retrace.\nWhoever obtains this talisman will command the generals of the Three and Five, the *Liushi* divine generals, and the celestial enforcers. They will refuse even a thousand gold pieces, for it is a treasure beyond price. **Guard it well—it is the most potent of all methods.**\n\n**Talisman for Delivering the Departed from the Underworld**\nThis talisman guides the nine generations of ancestors and the seven generations of forebears into the netherworld, as well as all departed souls. First, inscribe three talismanic strokes, then address the Jade Maiden: *\"I have lost my ninefold ancestors and sevenfold forebears—where have they gone? Or: I have lost so-and-so—since their passing, I know not where they dwell.\"*\nThe spirit bearing this talisman will descend to the depths of hell and the dark peaks, summoning the officials to inquire. *\"Release my departed so-and-so at once.\"* **Swiftly, swiftly!**\nUpon speaking, burn the talisman—the departed will manifest.\n\nFor all the above talismans, inscribe them in red. If cinnabar is unavailable, use standard ink, then seal them with the appropriate stamp. For any undertaking, inscribe a talisman, write the name of the Jade Maiden of the current ten-day period on either side, and sincerely petition the matter at hand. After a grand ritual offering, there is no need to erect an altar each time—simply present incense, tea, wine, and fruit, burn incense, and make your plea with utmost devotion. The Jade Maiden will naturally appear in her true form. The talisman need not be burned—it will depart of its own accord. Its numinous power is boundless. Whoever obtains this method must treasure it as their greatest possession.\n\nRevere it, and your nine clans will receive blessings—fortune, emolument, and glory will flourish, and you may ascend to immortality and attain the Dao. Disdain it, and your six relations will suffer calamity—disaster will strike, and you may sink into the dark realms as a ghost. **How can one not be cautious?** Focus your mind unwaveringly, and banish all distractions. If in dreams your form travels afar, or if a woman appears seated beside you, it is the Jade Maiden descending. From then on, your methods will gradually align with your will. If the six spirits frequent your presence over time, manifesting as shadows or forms, or communicating through whispers or visions, it is a sign that your karmic affinity with this method has ripened. There is no need for elaborate practice—simply petition with sincerity, and the response will be immediate.\n\nWhoever attains this method has, in truth, borne the name of an immortal in past lives, and thus has come to possess this Way in the present. From the celestial palaces of the Jade Emperor above to the netherworld courts below, all undertakings will be met with resonance. **This is not to be transmitted for ten thousand gold pieces.** As the ancients said: *\"Better to give a thousand gold than to reveal the secrets of the Six Jia’s yin methods.\"*\n\n**The True Scripture of the Six Yin Caverns of the Mysterious and Transformative Hidden Jia, Volume the Lower—Concluded.**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "秘藏通玄变化六阴洞微遁甲真经 经名：秘藏通玄变化六阴洞微遁甲真经。 不着撰人，传出於刘罕。 三卷。 底本出处：《正统道藏》洞神部方法类。 秘藏通玄变化六阴洞微遁甲真经卷上 太上曰：夫欲传授之士，须当澡沐洁身，郑重先灶名香，仰视北辰，虔心祝香，仰启昊天玉皇上帝、太上九天玄女元君、圣师玄天上帝：臣乃太上弟子，昨受《太上玉女六阴洞微经法》，皈身佩奉，依法行持。 伏愿天垂福佑，地赐休祥，大道速成，愿心早毕。 臣拜授此经已后，永为行持，无轻语诳妄，无易泄非人，无横用邪为，无往求杂慕。 臣从得此法，愿求长生。 次利百姓，济民助国，退独入清，荡妖杀邪。 惟希三天大鉴，万象咸知。 赐臣通灵，使臣遂愿。 如或妄行妖邪，臣甘犯天诛，圣真勿佑。 急急如律令施行。 传后涓吉日，置油面饼七个，欢喜团七个，净布七条，枣汤七盏。 於二更时，星月郎明，向北斗下，置七位供养，烈火丰香。 手执此经，稽首百拜。 告云： 臣倾心沥志，集气会神，再拜上香，以虔盟誓。 臣乃太上之子，久行清静，诚测天心，欲离尘凡，愿归蓬岛。 臣虔诚拜告，有事上闻，伏愿真慈俯垂悯鉴。 臣以今於某月日，承受太上玉女六阴洞微经。 臣欲行持，愿垂盟鉴。 臣受此法，不敢轻为，非急难救人，誓无谬用。",
      "translated_text": "*The Esoteric Canon of the Six Yin Caverns of the Mysterious Transformations of the Hidden Dao: The Authentic Classic of Dunjia*\n\n**Title:** *The Esoteric Canon of the Six Yin Caverns of the Mysterious Transformations of the Hidden Dao: The Authentic Classic of Dunjia*\n*Author unknown; transmitted by Liu Han.*\n*Three scrolls.*\n*Source text: Zhengtong Daoist Canon, Cavern Spirit Division, Methods Category.*\n\n---\n\n**The Esoteric Canon of the Six Yin Caverns of the Mysterious Transformations of the Hidden Dao: The Authentic Classic of Dunjia, Scroll One**\n\nThe Most High said:\nThose who seek transmission must first bathe and purify the body, solemnly light incense before the stove, gaze upon the Northern Asterism, and with reverent heart offer prayers to the fragrant smoke. They shall invoke the August Jade Emperor of the Vast Heaven, the Most High Mysterious Maiden of the Nine Heavens, and the Sacred Master, the Mysterious Heavenly Emperor, saying:\n\n*\"I, a disciple of the Most High, having received the* **Scripture of the Six Yin Caverns of the Mysterious Jade Maiden of the Most High***, have taken refuge in its precepts and wear its teachings close to my person, practicing in accordance with its methods. I humbly pray that Heaven may bestow blessings and protection, that Earth may grant auspicious omens, that the Great Dao may swiftly be accomplished, and that my heart’s vows may soon be fulfilled.*\n\n*After receiving this canon, I shall forever uphold its practice, never speaking lightly or deceitfully, never recklessly disclosing it to unworthy persons, never employing it for perverse ends, nor seeking杂慕. From the moment I obtain this method, I vow to seek longevity, to benefit the common people, to aid the nation and succor the people, to retreat into solitude and purity, and to dispel demons and slay evil. May the Three Heavens deign to witness this, and may all phenomena come to know it. Grant me communion with the numinous, that my aspirations may be realized. Should I ever act recklessly or practice sorcery, I willingly submit to Heaven’s punishment, and the Sacred Perfected shall withhold their protection.\"*\n\n*Swiftly, swiftly, in accordance with the statutes and ordinances, let it be done.*\n\nAfter transmission, on an auspicious day, prepare seven oil-and-flour cakes, seven *huanxi* sweet dumplings, seven strips of pure cloth, and seven cups of jujube broth. At the second watch, when the stars and moon shine brightly, arrange seven offerings beneath the Northern Dipper, burning abundant incense in a blazing fire. Holding this canon, bow one hundred times and proclaim:\n\n*\"I pour forth my heart and devote my will, gathering qi and uniting with the spirit. I bow twice and offer incense, pledging my sincerity in this oath. I am a child of the Most High, having long practiced purity and stillness, earnestly discerning the heart of Heaven. I wish to depart the mundane world and return to Penglai. With utmost reverence, I make this supplication, humbly beseeching the True Compassion to look down with mercy and witness my vow.*\n\n*On this day of such-and-such month and year, I have received the* **Scripture of the Six Yin Caverns of the Mysterious Jade Maiden of the Most High***. I now wish to practice its teachings and pray for the witness of this covenant. Having received this method, I dare not treat it lightly. Unless in dire need to save others, I swear never to misuse it.\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 512,
      "start_sentence": 0,
      "end_sentence": 24,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.219264268875122,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\秘藏通玄变化六阴洞微遁甲真经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "臣今虔诚恭对尊仪，诚誓此言。 或不遵依，甘当罪罚。 凡有急缓救应，愿垂加护。 即前进上香，再拜。 低声祝曰：臣欲二三玉女，为臣之使。 上达天廷，下巡世界。 飞符走印，松邪斩妖，一切应用，臣欲驱使。 伏希尊慈，俯垂降鉴。 复上香再拜。 祝曰： 臣所言事，已告御前，伏冀威灵，时加护佑。 再拜讫，收香座。 再选吉日，备茶一分，酒一盏，果子一盘。 二更时不令人见，向北辰下，檐底设香座，上香再拜，虔诚启请： 北极镇天真武灵应真君，今夜今时，愿垂降驾。 臣有小事，百拜上奏御前。 臣奉太上之劫，法箓行持。 斩鬼祛邪，助国安家，求仙学道，给济孤贫。 欲以《六阴洞微经》行持，驱使二三玉女，和平天地，制御邪魔。 於理所为，欲从其愿。 伏愿帝君衷鉴，加助威灵。 敢仗高真，永居正位。 安印之所，即是道场。 伏望圣慈，下恢圣德，即以两大指作诀。 祝曰： 天清地宁，阴浊阳清。 瞪目散发，龟蛇合形。 手执宝剑，斩伐邪精。 来居吾室，主六阴尊。 听吾告启，从吾所陈。 永镇中位，护至仙成。 急急如律令。 七遍。 再上香祝曰： 臣欲以二三玉女，为使一切，所作祛使。 愿帝君加护，同佐神麻，不胜大幸。 再拜。 收座辞退。 大会祭仪 癸亥日，先写状并符请圣。 闲人在外，先一夜备供养上香。 设拜面北，坛前存神，叩齿乃祝曰：某郡佩某箓弟子，谨谨先伸拜请。 祖师北极，镇天真武，佑圣真君，愿垂圣驾，证盟大法。 上香，酌酒。 丁卯真君前启请 奉请丁卯玉女足日之，字保中，无极仁福真君，闻臣之香，降临坛所。 焚香，焚合同符，诵本身咒，取本方气吹之。 次启。 奉请丁丑玉女黑无上，字太和，横天仁实真君，闻臣之香，降临坛所。 奉请丁亥玉女陆明集，字广阳，都府仁元真君，闻臣之香，降临坛所。 奉请丁酉玉女救钦灵，字正一亚夫仁休真君，闻臣之香，降临坛所。 奉请丁未玉女乘素灵，字玄英无比仁至真君，闻臣之香，降临坛所。 奉请丁巳玉女朱福称，字文广高上仁德真君，闻臣之香，降临坛所。 右臣今奉请二三玉女，已幸降临。 伏乞真灵，俯垂大造，随请下降法驾，受臣恳祷。 左手中指，右手大煞文，叩齿三十六通，念六阴六丁玉女八素隐言。 咒曰： 龙曜九炁，五岳从之。 天蓬四圣，十元八极。 斗星百灵，十二日直。 玉女六丁，愿垂真光，助法敕摄。 吾奉太上老君洞彻律令救。 连念三遍。 逐一摄六丁本身诀玉女名召之。 罡步 藏形隐迹，步我罡魁。 我见其人，人无我知。 动植如意，叱声鬼随。 疾如水火，鼓舞风雷。 变泽成山，翻地覆天。 我身坚固，安然默然。 万载长生与道合仙。 急急如九天玄女律令敕。 取逐方炁吹坛中，奉请玉女依位而坐，烧本身符六道於坛中，叩齿瞑目，存想玉女六位降临坛中，再拜上香。 祝曰： 臣今奉请真武真君外，次焚香请召二三玉女，想已降临坐次，弟子某稽首再拜。 某是太上老君弟子，久持圣道，欲愿长生。 履清争规，行奥妙事。 长亲至道，禀命修行。 上荐祖先魂神，下济万民灾疫。 臣奉持法箓，依道摄行。 今欲置坛，装严净室，依科营办，享祭真君。 仰赖威光，俯垂洞鉴。 某欲克仙理，为国安民，咒水行符，祛邪治鬼。 上助国家之用，下扶身命之为。",
      "translated_text": "I now reverently face Your august presence and solemnly pledge these words. Should I fail to uphold them, I willingly accept punishment. In all matters of urgency or delay, I pray for Your protection and aid. I advance to offer incense and bow twice, then softly invoke:\n\n*\"I beseech the two or three Jade Maidens to serve as my envoys—ascending to the celestial court, descending to traverse the world, dispatching flying talismans and swift seals, expelling evil and slaying demons, fulfilling all tasks I command. Humbly I implore Your august compassion to look down with favor and witness my plea.\"*\n\nAgain I offer incense and bow twice, then invoke:\n\n*\"The matters I have declared are now laid before Your presence. Humbly I pray for Your mighty power to grant constant protection and blessing.\"*\n\nAfter bowing, I withdraw the incense altar. On a chosen auspicious day, I prepare a portion of tea, a cup of wine, and a plate of fruit. At the second watch, unseen by others, I face the Northern Asterism beneath the eaves, set up the incense altar, offer incense, and bow twice, then reverently invoke:\n\n*\"True Martial Spirit of the North, Perfected Sovereign of Numinous Response, this night and hour, I beseech You to descend in majesty. I have a humble matter to present before Your presence with a hundred bows. I uphold the mandate of the Most High, practicing the registers of the Dao. I slay ghosts and dispel evil, aid the state and pacify households, seek immortality and study the Dao, succoring the orphaned and impoverished. I wish to practice the* **Scripture of the Six Yin Caverns of the Mysterious Jade Maiden**, *commanding two or three Jade Maidens to harmonize Heaven and Earth and subdue demonic forces. By principle and reason, I seek to fulfill this vow. Humbly I pray that the August Sovereign witness my sincerity and lend Your mighty power. Daring to rely on the exalted Perfected, may I forever abide in the true position. Where my seal is placed, let it be the Daoist sanctuary. Humbly I beseech Your sagely compassion to extend Your sacred virtue.\"*\n\nThen I form the mudra with both thumbs and invoke:\n\n*\"Heaven is serene, Earth is tranquil; yin is turbid, yang is clear.\nEyes blazing, hair unbound, the Tortoise and Serpent unite in form.\nWielding the sacred sword, I sever demonic essences.\nCome and dwell in my chamber, presiding over the Six Yin’s majesty.\nHear my invocation, follow my decree.\nEternally guard the central position, protecting until immortality is achieved.\"*\n\n*Swift as the statutes command!* (Recited seven times.)\n\nAgain I offer incense and invoke:\n\n*\"I wish the two or three Jade Maidens to serve as my envoys for all exorcistic tasks. May the August Sovereign grant protection, aiding the divine hemp, for which I am deeply fortunate.\"*\n\nI bow twice, then withdraw the altar and take my leave.\n\n**Grand Ritual of Offering**\nOn a *guihai* day, first write the petition and talismans to summon the deities. Keep outsiders beyond the precincts. The night before, prepare offerings and offer incense. Face north before the altar, visualize the deities, and knock the teeth together before invoking:\n\n*\"I, a disciple of the register of [such-and-such] prefecture, most reverently bow and invoke:\nAncestral Master, True Martial of the North, Perfected Sovereign Who Upholds Sageliness, may Your sagely presence descend to witness the great covenant of the ritual.\"*\n\nI offer incense and pour wine, then invoke before the Perfected Sovereign of *Dingmao*:\n\n*\"I humbly summon the Jade Maiden of* Dingmao*, ‘Foot Day,’ named* Baozhong*, the Perfected Sovereign of Boundless Benevolence and Blessing, to descend to this altar upon smelling my incense.\"*\n\nI burn incense, burn the *Hetong* talisman, recite my personal incantation, and draw the qi of the proper direction to blow upon it. Next, I invoke:\n\n*\"I humbly summon the Jade Maiden of* Dingchou*,* Hei Wushang*, named* Taihe*, the Perfected Sovereign of Horizontal Heaven and Benevolent Actuality, to descend to this altar upon smelling my incense.\nI humbly summon the Jade Maiden of* Dinghai*,* Lu Mingji*, named* Guangyang*, the Perfected Sovereign of the Capital Prefecture and Benevolent Origin, to descend to this altar upon smelling my incense.\nI humbly summon the Jade Maiden of* Dingyou*,* Jiu Qinling*, named* Zhengyi Yafu Renxiu*, the Perfected Sovereign of Rectitude and Rest, to descend to this altar upon smelling my incense.\nI humbly summon the Jade Maiden of* Dingwei*,* Cheng Suling*, named* Xuanying Wubi Renzhi*, the Peerless Perfected Sovereign of Mysterious Radiance, to descend to this altar upon smelling my incense.\nI humbly summon the Jade Maiden of* Dingsi*,* Zhu Fucheng*, named* Wenguang Gaoshang Rende*, the Exalted Perfected Sovereign of Cultivated Virtue, to descend to this altar upon smelling my incense.\"*\n\n*\"Now that I have reverently summoned the two or three Jade Maidens, may they deign to descend in majesty. Humbly I beseech Your true numina to condescend to this great transformation, descending in ritual splendor to receive my earnest prayers.\"*\n\nWith the left middle finger and the right *Dasha* mudra, I knock my teeth thirty-six times and recite the *Hidden Words of the Six Yin and Six Ding Jade Maidens and Eight Pure Ones*:\n\n*\"Nine qi of the radiant dragon follow the Five Peaks.\nThe Four Saints of Heavenly Obscurity and the Ten Origins of the Eight Poles.\nThe hundred spirits of the Dipper and the twelve daily asterisms.\nThe Six Ding Jade Maidens, may You bestow true radiance to aid the ritual’s commands and restraints.\nI invoke the* **Most High Lord Lao** *to thoroughly enforce the statutes and save!\"*\n\n(Recited three times in succession.)\n\nI summon each of the Six Ding Jade Maidens by their names and mudras. Then I perform the *Dang* step:\n\n*\"Concealing form, hiding traces, I tread my* Dang *and* Kui*.*\n*I see them, yet they know not me.\nMoving and planting as I will, demons follow at my rebuke.\nSwift as water and fire, dancing like wind and thunder.\nTransforming marshes into mountains, overturning earth and sky.\nMy body is firm, tranquil and silent.\nFor ten thousand ages, I attain long life and merge with the Dao to become immortal.\"*\n\n*Swift as the statutes of the Dark Maiden of the Nine Heavens command!*\n\nI draw the qi of each direction and blow it into the altar. I invite the Jade Maidens to take their seats according to their positions, burn six talismans of their respective forms in the altar, knock my teeth, close my eyes, and visualize the six Jade Maidens descending to the altar. I bow twice and offer incense, then invoke:\n\n*\"After reverently summoning the True Martial Sovereign, I now burn incense to invite the two or three Jade Maidens. Having visualized their descent and seating, I, disciple [Name], bow twice in reverence.\nI am a disciple of the* **Most High Lord Lao**, *having long upheld the sagely Dao, desiring eternal life.\nI tread the pure and contend with the rules, practicing profound and wondrous deeds.\nEver devoted to the supreme Dao, I receive the mandate to cultivate.\nAbove, I offer prayers for the souls of my ancestors; below, I relieve the calamities and epidemics of the myriad people.\nI uphold the registers of the Dao and practice its restraints.\nNow I wish to establish an altar, adorn a purified chamber, and prepare offerings according to the ritual statutes to feast the Perfected Sovereign.\nRelying on Your majestic radiance, I humbly beseech Your thorough witness.\nI seek to master the principles of immortality, pacify the state and people, enchant water and dispatch talismans to expel evil and govern ghosts.\nAbove, to aid the state’s needs; below, to support my own destiny.\"*",
      "overlap_context": "o Penglai. With utmost reverence, I make this supplication, humbly beseeching the True Compassion to look down with mercy and witness my vow.*\n\n*On this day of such-and-such month and year, I have received the* **Scripture of the Six Yin Caverns of the Mysterious Jade Maiden of the Most High***. I now wish to practice its teachings and pray for the witness of this covenant. Having received this method, I dare not treat it lightly. Unless in dire need to save others, I swear never to misuse it.\"*",
      "start_char": 512,
      "end_char": 1790,
      "start_sentence": 25,
      "end_sentence": 109,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.111223459243774,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\秘藏通玄变化六阴洞微遁甲真经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "不论巨细，一切运动之事，皆赖威仙当作使者。 助某行持，听某指陈。 东西南北，悉皆从顺。 称名画印，如闻启请，即时来临。 记其所言，不可失信。 上香再拜，轻轻近前，低语云： 吾领太上之令、玉皇之勑，平调宇宙，安辅国家，兴兵发为，使鬼祛邪。 今祭仙灵，永为佑使。 须当随吾机变，依吾所为。 欲有不从，当行太上之令、玉皇之敕。 斩神之身，灭神之德。 伏惟灵通，下垂聪听。 再拜，上香举酒。 次设拜跪滕，叩齿。 祝云： 弟子姓某，谨遇大会之夜，敬祭于二三玉女之前。 切念某惟性自然，心受天章，本师有约，太上之传。 今遇大会，聊献于觞。 风伯洒扫，雨师净坛。 奉祀某，心好祯祥，陈名通姓，愿奉真光，终身奉祀，永不相忘。 今日拜祭，美食脯香。 安邑大枣，细核小穰。 百清香酒，浮蚁倾浆。 时新五果，白米嘉粮。 饮受我祭，恣意斟尝。 酒醉食饱，随我行藏。 凡有梼语，一一相当。 常随我所，常佑我傍。 我之所愿，遂意吉昌。 我所到处，与真偕行。 隐显往返，万事安康。 速成大道，早达仙乡。 我有诸苦，真与告祥。 我有所欲，真当随长。 入敌保国，万事为良。 扶卫我身，与天地藏。 倾灌奠醉，伏惟尚飨。 急急如太上律令勑。 又再拜上香，逐一诵本身咒。 取气一口，吹座上。 密云： 丁卯玉女，得太上《六阴经》、《洞微真文》。 知神之姓，知仙之名。 有法召仙，有法使神。 往来三界，出幽入冥。 行住坐卧，皆赖仙真。 召之立至，召之立临。 人间万事，令我通闻。 愿以昭报，幸勿违戾。 急急如律令勑。 念三遍。 从丁卯方取气吹之。 次丁丑吹之，别方同。 再虔上香，咒曰： 能役六阴，出幽入冥。 无畏无怖，亦无所惊。 随吾符转，随吾印行。 祛除万祸，集福一身。 日动夜藏，不得违令。 急急如律令勑。 如是这匝毕，如此六处，一同正位。 上香再拜讫，收符一道，捻成圆子，用各位酒服。 拜谢毕，如此六处，一同正位。 上香，念此语云： 吾今奉法，吾乃为师，以真为弟。 吾欲所遣，神可随吾。 自此已往，不离吾身。 金钱云马，助真之程。 凡有施为，不可失信。 烧化钱纸毕，收座。 宋尚书右仆射赵普进经表 臣闻天之可度则覆物必广，人之有奇则建功不难。 设当时天运之亨，必际风云之会。 臣某始随陛下，收复诸国，未尝不失图书於秘府，功须不及汉之萧相，其志则无异也。 且诸秘阁所藏之书，可谓秘矣。 如《太白阴经》、《驱雷兵三十六府》、《气运图》、《起风云十二戒法》、《缩水龟典》、《拔木神经》，若此秘文，不可胜数。 然究其实，不亦难乎？ 其义渺茫，其辞枝蔓。",
      "translated_text": "For all matters great or small, every act of movement relies on the majestic immortals to serve as messengers. Assist me in my practice and heed my instructions. From east to west, south to north, all shall comply and obey. Call their names and inscribe their seals—upon hearing the invocation, they shall arrive at once. Record their words and never break faith.\n\nLight incense and bow twice, then draw near softly and whisper:\n\"I bear the command of the Most High and the decree of the Jade Emperor to harmonize the cosmos, pacify and aid the state, raise armies and act, dispatch ghosts and expel evil. Today, I feast the immortal spirits, that they may forever serve as my protective envoys. You must adapt to my strategies and follow my actions. Should any disobey, they shall face the command of the Most High and the decree of the Jade Emperor—severing the spirit’s body and extinguishing the spirit’s virtue.\"\n\nMay the numinous ones, in their wisdom, deign to listen below.\nBow twice more, light incense, and raise the wine.\n\nNext, kneel and prostrate, knocking teeth together, and pray:\n\"Disciple [Name] humbly encounters this grand assembly’s night and reverently offers sacrifice before the two or three Jade Maidens. I reflect that my nature is innate, my heart bears heaven’s decree, and my original master holds a covenant, a transmission from the Most High. Now, on this grand occasion, I modestly present this cup.\n\nThe Wind Earl sweeps clean, the Rain Master purifies the altar. I, your devotee, cherish auspicious omens. Having declared my name and lineage, I wish to receive your true radiance, serve you all my life, and never forget you. Today’s offering includes fine meats, dried delicacies, and fragrant incense—jujubes from Anyi, with small pits and tender flesh; pure, clear wine, its floating froth poured in streams; seasonal fruits; and white rice, the finest grain. Partake of my feast, drink and eat your fill. When sated with wine and food, follow my every move. Whatever I pray for, respond in kind. Ever attend me, ever guard my side. May my wishes prosper and flourish. Wherever I go, may the Perfected accompany me. In concealment or openness, in all journeys, may all be peaceful. Swiftly achieve the great Dao and soon reach the immortal realm. When I suffer, may the Perfected bring auspicious tidings. When I desire, may the Perfected follow and fulfill. Entering enemy lands to protect the state, may all be well. Safeguard my body, and with heaven and earth, endure.\n\nPour the libation, offer the drunkenness—may it be received with favor.\nHastily, as by the statutes and decrees of the Most High.\"\n\nBow twice more and light incense, then recite the personal incantation of your own body. Draw in a breath of qi and blow it upon the seat, secretly saying:\n\"Jade Maiden of Dingmao, you possess the *Six Yin Classic* and the *True Writ of the Subtle Cavern* of the Most High. You know the names of spirits and the titles of immortals. With the proper method, you summon immortals; with the proper method, you command spirits. Traversing the Three Realms, emerging from darkness into light, in movement and stillness, sitting and lying down, all rely on the immortal Perfected. Summoned, you arrive at once; invoked, you descend immediately. All affairs of the human world, let me hear them clearly. I vow to repay your favor—do not defy me.\nHastily, as by the statutes and decrees.\"\n\nRecite three times. Draw qi from the Dingmao direction and blow it forth. Then do the same from Dingchou, and likewise for the other directions.\n\nLight incense devoutly and recite the incantation:\n\"Command the Six Yin, emerge from darkness into light. Fearless and unafraid, unshaken by anything. Follow the turning of my talismans, follow the movement of my seals. Dispel ten thousand calamities, gather blessings upon myself. Active by day, concealed by night—do not disobey my command.\nHastily, as by the statutes and decrees.\"\n\nAfter completing this cycle six times, align all to their proper positions. Light incense and bow twice, then take a talisman, roll it into a ball, and consume it with the wine from each position. Bow in gratitude, completing this for all six positions in their proper alignment.\n\nLight incense and recite:\n\"Now I uphold the method, I am the master, and the Perfected are my disciples. What I dispatch, the spirits shall follow. From this moment onward, never leave my side. Golden coins and cloud steeds shall aid the Perfected’s journey. In all undertakings, do not break faith.\"\n\nBurn the paper money, then close the altar.\n\n**Memorial Submitting the Classics by Minister Zhao Pu, Right Vice Director of the Chancellery of the Song Dynasty**\n\nYour servant has heard that if heaven’s measure is vast, its covering of all things must be broad; if a person possesses extraordinary talent, establishing merit is not difficult. When the time is ripe with heaven’s favor, it must coincide with a gathering of wind and cloud. Your servant first followed Your Majesty in reclaiming the various states, and though I never matched Xiao He of Han in securing maps and documents for the secret archives, my aspirations were no different.\n\nMoreover, the books stored in the various secret halls may indeed be called arcane. Such works as the *Tai Bai Yin Jing*, *Thirty-Six Ministries of Thunder-Driving Soldiers*, *Qi Circulation Diagrams*, *Twelve Precepts for Summoning Wind and Cloud*, *Tortoise Classic of Water Shrinking*, and *Divine Classic of Uprooting Trees*—these and other secret texts are beyond counting. Yet when one examines them closely, are they not also difficult? Their meanings are abstruse, their words sprawling.",
      "overlap_context": "uphold the registers of the Dao and practice its restraints.\nNow I wish to establish an altar, adorn a purified chamber, and prepare offerings according to the ritual statutes to feast the Perfected Sovereign.\nRelying on Your majestic radiance, I humbly beseech Your thorough witness.\nI seek to master the principles of immortality, pacify the state and people, enchant water and dispatch talismans to expel evil and govern ghosts.\nAbove, to aid the state’s needs; below, to support my own destiny.\"*",
      "start_char": 1790,
      "end_char": 2804,
      "start_sentence": 110,
      "end_sentence": 187,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.126261949539185,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\秘藏通玄变化六阴洞微遁甲真经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "或受戒之后，终身不饮。 有法之后，举族不荤。 既奉此，遂不复奉彼。 修设或有反，必有巨灾，不可急救。 臣愚观之，未得尽善。 一日有罗浮山隐士刘罕谒，臣曰：古有玄秘之文，必得之矣。 臣曰：诺。 刘罕以为未也，因出紫囊於案。 乃焚香设拜，启囊取书，授臣曰：黄帝得，伐杀蚩尤於阪泉之野，藏之天府，厥后授之尧舜禹汤文武，战国失之。 秦皇独得焉，驱神阴助，既统海内，复以无道失之。 迨秦历汉，或诸侯得之，散落四海者多矣。 呜呼，有得而不能奉持者，有行而不能恭敬者，皆不能成功。 惟前汉陈平，后汉邓禹，蜀诸葛亮，唐郭子仪、李靖，五子得之，恭谨而行，每运用奇计，人不可测。 凡行师、出军、偷营、劫寨，雷风电雨，随时而至。 自五子已往，此法不闻於世矣。 臣某佣懒，隐于罗浮山，积有岁矣。 先师珍藏是文，积有年代，曾戒臣曰：若逢圣明真主启运，当有真人助之，汝当持此以献。 倘公能恭，谨信而行之，则功不在五子之下。 臣敬事之约半岁，或闻有人耳畔言军国利害。 臣顾室内，绝无人迹，疑惑心开。 或言日吾乃六甲天神，慎勿猜忌。 臣自此转加敬惧，厥后耳畔报应，日逐事件，不可褊举。 至於亲侍陛下，收复诸寇，势如破竹，非臣之谋长策远，实六神之力也。 且若行师之日，王全赋、崔彦迪、刘光义、曹彬等，惟知臣事此神。 臣谓之曰：某日雨，某日风，某日火烧营寨，万不失一。 其法可谓通玄捷径，刘罕岂凡人哉。 其人厥后隐遁寂，不知其所以，莫非天授我宋耶？ 实囊括诸家之秘，诚玄妙不传之文。 直书其事，谨录上进。 较其始终，符咒止千余字。 乞藏玉匮，亦永保国祚万年，以赖神天之感。 开宝四年七月初一日，奉圣旨玉匮藏之，安秘书阁。 遁甲神经出处序 昔蚩尤作乱，黄帝频战不克。 帝曰：闻伏羲治，天下无兵。",
      "translated_text": "Should some, after receiving the precepts, abstain from drink for life, or others, upon mastering the method, forswear meat for their entire clan—once such vows are taken, no other observances may be followed. Should one’s practice deviate or reverse, dire calamity will strike, beyond swift remedy. In my humble view, this is not yet perfection.\n\nOne day, the recluse Liu Han of Mount Luofu sought audience. I said to him: “There exist ancient texts of profound secrecy—have you obtained them?” He replied: “I have.” Liu Han, however, deemed this insufficient and produced a purple satchel from his desk. After burning incense and bowing in reverence, he opened the satchel, drew forth a book, and presented it to me, saying: “The Yellow Emperor, having defeated and slain Chiyou on the wilds of Banquan, concealed this in the celestial treasury. Thereafter, it was transmitted to Yao, Shun, Yu, Tang, Wen, and Wu. In the Warring States, it was lost. The First Emperor of Qin alone recovered it, enlisting the aid of spirits in secret, and with their support, unified the realm—only to lose it again through his own impiety. Through the Qin and Han dynasties, it passed into the hands of various lords, scattering far and wide.\n\nAlas! Some obtained it but failed to uphold it; others practiced it without reverence—none succeeded. Only five men—Chen Ping of the Former Han, Deng Yu of the Later Han, Zhuge Liang of Shu, Guo Ziyi and Li Jing of Tang—truly grasped it. With utmost care and devotion, they wielded it to devise stratagems beyond mortal comprehension. In every campaign, sally, raid, or ambush, thunder, wind, lightning, and rain would arrive precisely as summoned. Since their time, this method has vanished from the world.\n\nI, your humble servant, have lived in seclusion on Mount Luofu for many years. My late master treasured this text for generations, once admonishing me: ‘Should a sagely and true sovereign arise, and a true adept assist him, you must present this.’ If you, my lord, can practice it with reverence and unwavering faith, your achievements will rival those of the Five Masters.’\n\nI served him for nearly half a year, during which I sometimes heard voices at my ear speaking of matters critical to the state and military. Yet when I turned, no one was there. My doubts dissolved as understanding dawned. The voice declared: ‘I am a spirit of the Six Jia. Do not doubt.’ From then on, my reverence deepened, and the whispers at my ear—reports of daily events—became too numerous to recount.\n\nWhen I later attended Your Majesty in reclaiming the rebel lands, our advance was as effortless as splitting bamboo. This was not due to my own cunning or foresight, but to the power of the Six Spirits. On campaign, Wang Quanfu, Cui Yandi, Liu Guangyi, Cao Bin, and others knew only that I served these spirits. I would tell them: ‘On such-and-such a day, rain; on another, wind; on yet another, fire will consume the enemy camp.’ Not once did I err. This method is a swift and wondrous shortcut to the mysterious—how could Liu Han have been an ordinary man? Later, he vanished without trace, as if spirited away. Could it be that Heaven itself bestowed this upon our Song?\n\nThis text distills the secrets of all schools, a truly esoteric and untransmitted work. I have recorded its contents faithfully and now humbly submit it for Your Majesty’s perusal. From beginning to end, its incantations and talismans number little more than a thousand characters. I beseech Your Majesty to store it in the Jade Coffer, that it may perpetually safeguard the dynasty for ten thousand years, by the grace of the divine.\n\nOn the first day of the seventh month of the fourth year of the *Kaibao* era, by imperial decree, it was sealed in the Jade Coffer and placed in the Secret Archives.\n\n*Preface to the Origin of the* Divine Classic of the Six Jia\n\nIn ancient times, Chiyou rebelled, and the Yellow Emperor fought him repeatedly without success. The Emperor said: “I have heard that in the age of Fuxi, the world knew no war...”",
      "overlap_context": "nt.\n\nMoreover, the books stored in the various secret halls may indeed be called arcane. Such works as the *Tai Bai Yin Jing*, *Thirty-Six Ministries of Thunder-Driving Soldiers*, *Qi Circulation Diagrams*, *Twelve Precepts for Summoning Wind and Cloud*, *Tortoise Classic of Water Shrinking*, and *Divine Classic of Uprooting Trees*—these and other secret texts are beyond counting. Yet when one examines them closely, are they not also difficult? Their meanings are abstruse, their words sprawling.",
      "start_char": 2804,
      "end_char": 3504,
      "start_sentence": 188,
      "end_sentence": 222,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.704026222229004,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\秘藏通玄变化六阴洞微遁甲真经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "今蚩尤一庶人生妖气，伐而无功，战而不克，吾之过矣。 忽目前五色云从空而下，云中有六玉女持书，出二童曰：奉九天玄女圣命，送《遁甲符经》三卷，告与伐之愿。 传此文乃天地祸福，是八卦之吉凶。 辩风云之变动，识气候之成败，观日月之盈亏，论阴阳之顺逆，晓星辰之休咎，知人情之胜负，此术乃万变万化之法也。 帝乃长跪而受之，二童子并玉女乘云而去。 帝遂开函，得《阴符经》三卷。 上卷乃神仙炼丹抱一之术，说长生之法。 中卷安邦定国，抚安王民之法。 下卷论战伐之事，遁甲者乃玄女之法。 帝得之而设坛，造印剑令，依此战蚩尤於涿鹿之野。 尔后厥胜，藏之金殿。 后大乱，巢黄杨出得之，传於凡世。 得之者夙缘庆幸，遇之者决胜如仙。 可宜慎之，勿传下等。 凡夫六丁者，天下之正神，不同寻常。 青龙、明堂、太阳等神，长随玉女，受之使唤，在天地之内。 如隐身遁形，以左手持刀，闭气一口，右转画一圆圈。 闻恶人在内，便於外作局子六尺。 如恶人在外，便於内作局子六尺。 如在野外，仍於野外作局子变神。 用等六条，各长一尺二寸。 逐旬青龙，依次排之，而直放算子到玉女门上。 以左手牵之算，横着闭门，却从天门地户而去。 闭门了，身形遁已。 每一算，子存为一人也。 玉女到太阴，住想外人不见我也。 仍先念净口身神咒，左手结印，右手执剑，踏北斗丁罡七步，披头仗剑。 念了净口净身神咒，闭目藏睛，默念七星名字一遍，断诀关土地。 念咒须向方取气吹之，前却便捏火。 行此法出入行军用焉，不问凶神恶煞，入地回避，不敢当途。 他众我寡，或万军围掩，但望天罡，取气所指之方去，千军不觉，万军不见。 此玄妙口诀，千金不传，万金不度，勿泄天机。 乃护国之宝，不为人见矣。 秘藏神玄变化六阴洞微遁甲真经卷上竟 秘藏通玄变化六阴洞微遁甲真经卷中履二 太上老君六除玉女洞微经法上传授感应式 太上曰：夫欲入道，必先探赜。 玄微奥旨，兴兵发马，守道港形，祛邪逐恶，保佑元真，此乃吾之至要之门，进登仙品，莫非是事。 况此法也，通天清之奥路，达地浊之渊微。 理烛古今，道冠万术。 於身益者，上谒官长，利见王公，逐鬼退殃，迎祥致福，飞符走印，制伏狂妖，求道欲仙，恣情任意。 於国益者，兴兵发马，立纪陈纲，治水潦之灾，灭饥馑之苦，乃感王侯之梦，合诸人物之心，入水登山，行幽坐险。 若非此法，安可如然而登玄理。 太上曰：吾传此经法，流布人间，以济仁人者之用事。 非是其徒，切莫私味之。 可与子之千金，不可泄吾《六甲阴经》者。 自古至今，未尝有不从此用事而得成道者也。 则在处禁卫吏兵，即时为罚报，殃滞灾咎横生。 或非道之士，恪以诚心，资以世贿，为意而等闲传授，罚加倍焉。 太上曰：夫欲传授之士，须当澡沐，洁身郑重。 先灶名香，仰视北辰，运心所梼。 臣乃太上弟子，昨於某年月日，拜受《太上玉女六阴洞微经法》。 伏愿天垂福佑，地赐休祥，大道速成，愿心早毕。 臣受此经法以后，永为行持，无轻诳语，无易泄非人，无横用邪为，无柱求杂慕。 臣得此法，愿求长生。 次利百姓，济民助国，退浊入清，荡妖杀邪。",
      "translated_text": "Now, Chiyou was but a commoner who had spawned malevolent qi, and though I attacked him repeatedly, I could not prevail—this was my failure. Suddenly, before my eyes, a five-colored cloud descended from the sky. From within the cloud emerged six jade maidens bearing a book, and two youths who declared: “By the sacred command of the Nine Heavens’ Mysterious Maiden, we present the *Three Scrolls of the Classic of the Six Jia Talismans*, that your wish to subdue him may be fulfilled.” This text reveals the fortunes and misfortunes of Heaven and Earth, the auspices and omens of the Eight Trigrams. It discerns the shifts of wind and cloud, recognizes the success or failure of qi and seasons, observes the waxing and waning of sun and moon, expounds the sequence and inversion of yin and yang, comprehends the good and ill of stars, and knows the victory or defeat of human affairs. This art is the method of ten thousand transformations.\n\nThe Emperor knelt in reverence to receive it, whereupon the two youths and the jade maidens ascended upon the cloud and departed. The Emperor then opened the case and obtained the *Three Scrolls of the Classic of the Yin Talismans*. The upper scroll expounds the arts of immortals refining the elixir and embracing the One, teaching the methods of longevity. The middle scroll sets forth the ways to pacify the realm, stabilize the state, and comfort the people. The lower scroll discusses matters of warfare and conquest, for the Six Jia is the method of the Mysterious Maiden.\n\nHaving received it, the Emperor established an altar, forged seals and swords, and, following its precepts, battled Chiyou on the fields of Zhuolu. Thereafter, he achieved victory and concealed the text within the Golden Hall. Later, during great upheaval, it was retrieved by Chaohuang Yang and transmitted to the mortal world. Those who obtain it are blessed by karmic fortune; those who encounter it prevail as if by divine power. It must be guarded with care and never passed to the unworthy.\n\nThe Six Ding spirits are the true deities of the world, unlike ordinary beings. The Azure Dragon, Hall of Light, and Sun spirits, ever attendant upon the jade maidens, are summoned to serve within Heaven and Earth. To conceal one’s form and vanish, hold a blade in the left hand, hold the breath, and with the right hand trace a circle. If the evil one is within, draw a six-foot enclosure outside; if the evil one is without, draw it inside. In the wilds, construct the enclosure there and transform the spirits. Use six rods, each one foot and two inches long. Arrange them in sequence according to the Azure Dragon of each ten-day period, placing the counting rods directly before the Jade Maiden’s gate. With the left hand, draw the rods across to seal the gate, then depart through the Heavenly Gate and Earthly Portal. Once the gate is sealed, the body’s form is concealed.\n\nFor each rod, envision a person in the position of the *zi* hour. When the Jade Maiden reaches the Greater Yin, dwell upon the thought that outsiders cannot see you. First recite the incantation to purify mouth and body, form the seal with the left hand, grasp the sword in the right, step the Seven Stars of the Northern Dipper, loosen the hair, and brandish the sword. After reciting the purification incantations, close the eyes, silently intone the names of the Seven Stars once, and sever the connection with the local earth deity. When reciting the incantation, draw qi from the direction and blow it forth; advance and retreat while pinching fire. This method is employed in military maneuvers—whether facing inauspicious spirits or malevolent forces, one may vanish into the earth to evade them. Outnumbered or surrounded by ten thousand soldiers, gaze toward the Celestial Stem, draw qi from the indicated direction, and depart; a thousand troops will not perceive you, nor ten thousand see you. This esoteric oral transmission is priceless, its secrets not to be divulged for any treasure. It is the nation’s safeguard, never to be revealed to others.\n\n*End of the First Scroll of the* True Classic of the Six Yin Cavern’s Subtle Transformations of the Hidden Dao\n*Second Scroll of the* True Classic of the Six Yin Cavern’s Subtle Transformations of the Penetrating Dao\n\n*The Upper Transmission of the* Mysterious Cavern Classic of the Six Exclusions and Jade Maiden\n\nThe Most High Lord Lao said: To enter the Dao, one must first delve into its profundities. The subtle and abstruse principles—mobilizing troops, setting forth, guarding the Dao and concealing the form, dispelling evil and expelling wickedness, preserving and protecting the original true—are the most essential of my gates, the means to ascend to the ranks of immortals. Moreover, this method opens the profound path of the pure Heaven and penetrates the abstruse depths of the turbid Earth. Its principles illuminate past and present, its Dao crowns all arts.\n\nFor the self, it brings benefit: one may approach officials and superiors, gain audience with kings and nobles, expel ghosts and avert calamities, attract blessings and summon fortune, dispatch flying talismans and moving seals, subdue raging demons, seek the Dao and attain immortality, and act as one desires. For the state, it brings benefit: one may mobilize troops, establish order and discipline, mitigate floods and droughts, eradicate famine and suffering, inspire dreams in kings and lords, harmonize the hearts of all beings, traverse waters and scale mountains, and traverse perilous paths in seclusion. Without this method, how could one ascend to the profound principles so effortlessly?\n\nThe Most High Lord Lao said: I transmit this classic and its methods to circulate among humankind, to serve the needs of the virtuous. Those who are not its proper recipients must not privately peruse it. It may be shared with one’s disciples at the cost of a thousand gold, but the *Six Yin Classic* must never be revealed. From ancient times to the present, there has never been one who did not employ this method to attain the Dao. Should it be misused by guards, soldiers, or officials, retribution will swiftly follow—misfortune, stagnation, calamity, and adversity will arise. If one who is not of the Dao, though sincere and offering worldly wealth, transmits it carelessly, the punishment shall be doubled.\n\nThe Most High Lord Lao said: Those who wish to transmit this method must first bathe and purify themselves, approaching with solemnity. Light incense at the stove, gaze toward the Northern Asterism, and direct the heart in prayer. The disciple of the Most High declares: On such-and-such a year, month, and day, I received the *Mysterious Cavern Classic of the Six Exclusions and Jade Maiden*. I humbly pray that Heaven bestow blessings and protection, that Earth grant auspicious fortune, that the Great Dao be swiftly accomplished, and that my wishes be soon fulfilled.\n\nAfter receiving this classic and its methods, the disciple vows to practice it perpetually, never to speak lightly or deceitfully, never to recklessly reveal it to the unworthy, never to employ it for perverse ends, and never to seek杂慕. Having obtained this method, the disciple aspires to seek longevity, benefit the people, aid the state, retreat from the turbid and enter the pure, and eradicate demons and slay evil.",
      "overlap_context": " may perpetually safeguard the dynasty for ten thousand years, by the grace of the divine.\n\nOn the first day of the seventh month of the fourth year of the *Kaibao* era, by imperial decree, it was sealed in the Jade Coffer and placed in the Secret Archives.\n\n*Preface to the Origin of the* Divine Classic of the Six Jia\n\nIn ancient times, Chiyou rebelled, and the Yellow Emperor fought him repeatedly without success. The Emperor said: “I have heard that in the age of Fuxi, the world knew no war...”",
      "start_char": 3504,
      "end_char": 4716,
      "start_sentence": 223,
      "end_sentence": 278,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.33871102333069,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\秘藏通玄变化六阴洞微遁甲真经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "惟希三天大鉴，万象咸知。 赐臣通灵，使臣遂意。 如或妄行妖邪，臣甘犯天诛，圣真勿佑。 急急如律令施行。 六阴隐秘要 六阴者，六甲之阴也。 甲子之阴，乃是丁卯，甲戌之阴丁丑，甲申之阴丁亥，甲午之阴丁酉，甲辰之阴丁未，甲寅之阴丁巳。 六丁乃六阴也，则六甲之为阳将，六丁为阴神。 用六丁而不用六阳者，阴为无也。 无则能变化，能有能无，出生入死，包容隐显也。 如临军之用兵法也，六阴无形，用之则应。 凡有道之士用阴，无道之士用阳。 阳则可测，阴则不可穷也。 上卷独言祭六丁法。 或曰：六本无形，何必祭之？ 曰：以有形无，祭祷之无形之神，有无相合也。 故存神叩齿，心念口告，助以香醪，荐以美食，祝而祈之。 依法用事，无不感通也。 昔黄帝征蚩尤七十二阵，昼而方寐，梦一神人教以秘法。 既寝觉，於盛囊中得法，曰《六阴洞微》，乃六丁秘法，六甲飞宫而变通也。 因此而依式行持，遂灭蚩尤也。 此法乃太上正一玄真之法，非妖邪之法也。 得传授者，具表申闻天合，奏於上帝，盟立誓言，不得妄意兴妖邪行。 非佞不然，则反被六丁神为责，大犯天诛也。 可当正心正行，用之应矣。 太上老君曰：昔以此法於太平年，使九天玄女授有熊氏，有熊氏授风后，风后授太玄先生黄石公，黄石公授张子房。 此法行之於人问时，有得而传之矣。 六丁玉女名仪服色 丁卯玉女，名足日之，又名丁文明，字保中，又字仁高，号无极仁福真君。 玉女状貌，青朝服，戴兔头冠，黄裙，敛愁眉，左手执如意珠，右手仗剑。 子丑日，下降奉事，在人家东厅阁。 丁丑玉女，名黑无上，又名丁文公，字太和，又字仁贵，号横天仁实真君。 玉女状貌，青碧朝服，戴牛头冠，淡黄裙，手执戟，或袂含笑。 寅卯日，下降奉祀人家东北牛栏或司命之所。 丁亥玉女，名陆明集，又名丁文通，字广阳，又字仁和，号都府仁元真君。 玉女状貌，黑朝服，头戴猪头冠，淡黄裙，手执仙果，仗剑。 辰巳日，下降奉祀人家北角厨、厕左右。 丁酉玉女，名救钦灵，又名丁文卿，字正一，又字仁修，号亚夫仁休真君。 玉女貌莹色，鸡头冠，白素朝服，淡黄裙，蹙敛黛眉，手执弩箭二枝。 戌亥日，下降奉祀人家西厅殿阁。 丁未玉女，名乘素灵，又名丁寂通，字玄英，又字仁恭，号无比仁至真君。 玉女状貌莹色，戴羊头冠，红粉朝服，黄裙，含笑，手执双戟或剑。 午未日，下降奉事人家南厅阁。 丁巳玉女，名朱福称，又名丁廷卿，字文广，又字仁敬，号高上仁德真君。 玉女状貌，绿色朝－服，红裙，顶蛇尾冠，手执长矛，大笑。 申酉日，下降奉事人家东南林池馆所。 右阴神六丁玉女，亦各有所掌，各戴冠缨，青裳素服朱履，执刀剑弓矢。 或於六丁日现於奉事之家，男女倘见其形，勿令惊怖，仍不得叱啧叫唤，恐有所触犯矣。 六丁玉女所掌事宜 丁卯玉女掌草木，能呼啸风雨岚雾，障蔽道途。 又能驱旱疠，救苗稼。 在天主木青气春生，镇人肝魂，应苍石。 丁丑玉女掌虫兽，能推运宝货，发泄伏藏。 又能增长百药，疗人疾苦。 在天主五谷四时之中气，镇人泥丸，应碧石。 丁亥玉女掌山河，能运泰岳，掇为小山，填塞道路，疏决河渠。",
      "translated_text": "May the Three Heavens bear witness in their great clarity, and may all things under heaven come to know. Bestow upon this disciple the power of spiritual communion, that my intentions may be fulfilled. Should I ever recklessly engage in demonic or perverse acts, I willingly accept the punishment of Heaven, and the sagely immortals shall withhold their protection. Hasten now, as the law commands!\n\n**The Essential Secrets of the Six Yin**\nThe Six Yin correspond to the yin aspects of the Six Jia. The yin of Jiazi is Dingmao; the yin of Jiaxu is Dingchou; the yin of Jiashen is Dinghai; the yin of Jiawu is Dingyou; the yin of Jiachen is Dingwei; and the yin of Jialin is Dingsi. The Six Ding constitute the Six Yin, just as the Six Jia serve as the yang generals, while the Six Ding are the yin spirits. The reason for employing the Six Ding rather than the Six Yang is that yin represents *wu* (non-being). *Wu* possesses the power of transformation—it can be both existent and non-existent, moving between life and death, and encompassing both concealment and revelation. Like the use of military strategy in war, the Six Yin are formless, yet their application yields immediate response.\n\nThose who walk the Dao employ yin, while those without the Dao employ yang. Yang can be measured, but yin remains unfathomable. The preceding scroll exclusively describes the rites for invoking the Six Ding.\n\nSome may ask: Since the Six Ding are formless, why perform rites for them? The answer lies in the union of form and formlessness—by offering sacrifices to the formless spirits, the tangible and intangible merge. Thus, one visualizes the spirits, clacks the teeth, silently recites the invocation, and verbally petitions them, aided by fragrant wine and fine offerings. Following the prescribed method ensures spiritual resonance.\n\nIn ancient times, when the Yellow Emperor waged seventy-two battles against Chiyou, he fell into a deep slumber during the day and dreamed of a divine being who taught him a secret method. Upon awakening, he found the method within a sealed pouch, titled *The Six Yin Cavern Secrets*—the esoteric art of the Six Ding, a system of the Six Jia’s flying palaces and transformative techniques. By adhering to this method, he ultimately vanquished Chiyou. This is the orthodox and mysterious art of the Supreme Unity and Primordial Perfection, not a demonic or perverse practice.\n\nThose who receive its transmission must submit a memorial to the Celestial Bureau, presenting it to the Supreme Emperor, and swear an oath never to recklessly invoke demonic or perverse acts. Should one act deceitfully or improperly, the Six Ding spirits will hold them accountable, and they shall incur the severe punishment of Heaven. Only with a rectified heart and conduct can one employ this method effectively.\n\nThe Most High Lord Lao said: In the era of Great Peace, this method was bestowed by the Nine Heavens’ Mysterious Maiden upon the Youxiong clan. The Youxiong clan passed it to Feng Hou, who transmitted it to the Great Mystery Master Yellowstone Elder, who in turn bestowed it upon Zhang Zifang. Since its dissemination among humanity, it has been transmitted to those deemed worthy.\n\n**Names, Attires, and Colors of the Six Ding Jade Maidens**\nThe Dingmao Jade Maiden is named *Zu Ri Zhi*, also called *Ding Wenming*, styled *Baozhong* or *Rengao*, and titled *Wuji Renfu Zhenjun* (Perfected Lord of Limitless Benevolence and Blessing). Her appearance: clad in a green court robe, wearing a rabbit-headed crown, a yellow skirt, with knitted brows. In her left hand, she holds a wish-fulfilling pearl, and in her right, a sword. She descends on Zichou days to serve in the eastern halls of households.\n\nThe Dingchou Jade Maiden is named *Hei Wushang*, also called *Ding Wengong*, styled *Taihe* or *Rengui*, and titled *Hengtian Renshi Zhenjun* (Perfected Lord of Heaven-Spanning Benevolence and Fruitfulness). Her appearance: dressed in a blue-green court robe, wearing a cow-headed crown and a pale yellow skirt, holding a halberd or smiling gently. She descends on Yinmao days to serve in the northeastern cattle pens or the abodes of the Controller of Fate.\n\nThe Dinghai Jade Maiden is named *Lu Mingji*, also called *Ding Wentong*, styled *Guangyang* or *Renhe*, and titled *Dufu Renyuan Zhenjun* (Perfected Lord of the Capital’s Benevolent Origin). Her appearance: clad in a black court robe, wearing a pig-headed crown and a pale yellow skirt, holding immortal fruits and a sword. She descends on Chensi days to serve in the northern corners of households, near kitchens or latrines.\n\nThe Dingyou Jade Maiden is named *Jiu Qinling*, also called *Ding Wenqing*, styled *Zhengyi* or *Renxiu*, and titled *Yafu Renxiu Zhenjun* (Perfected Lord of Subordinate Benevolence and Rest). Her appearance: radiant in complexion, wearing a chicken-headed crown, a white silk court robe, and a pale yellow skirt, with knitted brows, holding two crossbow bolts. She descends on Xuhai days to serve in the western halls of households.\n\nThe Dingwei Jade Maiden is named *Cheng Suling*, also called *Ding Jitong*, styled *Xuanying* or *Rengong*, and titled *Wubi Renzhi Zhenjun* (Perfected Lord of Incomparable Benevolence and Arrival). Her appearance: radiant in complexion, wearing a sheep-headed crown, a pink court robe, and a yellow skirt, smiling gently, holding a pair of halberds or a sword. She descends on Wuwei days to serve in the southern halls of households.\n\nThe Dingsi Jade Maiden is named *Zhu Fucheng*, also called *Ding Tingqing*, styled *Wenguang* or *Renjing*, and titled *Gaoshang Rende Zhenjun* (Perfected Lord of Lofty Benevolence and Virtue). Her appearance: dressed in a green court robe and a red skirt, wearing a snake-tailed crown, holding a long spear, and laughing heartily. She descends on Shenyou days to serve in the southeastern gardens and pavilions of households.\n\nThe Six Ding Yin Spirits, the Jade Maidens, each govern their respective domains. They wear crowns and tassels, green robes, white garments, and vermilion shoes, wielding swords, bows, and arrows. Should they manifest in the homes of their devotees on the days of the Six Ding, men and women who witness them must not be alarmed or shout in fear, lest they offend the spirits.\n\n**Duties of the Six Ding Jade Maidens**\nThe Dingmao Jade Maiden governs plants and trees. She can summon winds, rains, mists, and fogs to obscure paths, dispel droughts and plagues, and nurture crops. In heaven, she presides over the green qi of wood and the vitality of spring, guarding the human liver and ethereal soul, corresponding to azure stone.\n\nThe Dingchou Jade Maiden governs insects and beasts. She can mobilize treasures and reveal hidden stores, as well as enhance the growth of medicinal herbs to heal human ailments. In heaven, she presides over the central qi of the five grains and the four seasons, guarding the human *niwan* (mud-pill palace), corresponding to jasper.\n\nThe Dinghai Jade Maiden governs mountains and rivers. She can move Mount Tai, reduce it to a small hill, block roads, or dredge rivers and canals.",
      "overlap_context": "t the Great Dao be swiftly accomplished, and that my wishes be soon fulfilled.\n\nAfter receiving this classic and its methods, the disciple vows to practice it perpetually, never to speak lightly or deceitfully, never to recklessly reveal it to the unworthy, never to employ it for perverse ends, and never to seek杂慕. Having obtained this method, the disciple aspires to seek longevity, benefit the people, aid the state, retreat from the turbid and enter the pure, and eradicate demons and slay evil.",
      "start_char": 4716,
      "end_char": 5979,
      "start_sentence": 279,
      "end_sentence": 334,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.77447247505188,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\秘藏通玄变化六阴洞微遁甲真经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "又能使金石，裂地道。 在天主水黑气冬藏，镇精肾，应玄石。 丁酉玉女掌江海，能鼓风涛，淘沙拆岸，回潮卷日。 又能吹一叶成舟橄，浮度载人。 在天主金白气秋收、镇肺主魄，应白石。 丁未玉女掌岳渎，能化阴兵，助征战。 又能救生产、水火刀兵诸厄。 在天主土德四时余气黄色，镇脾胃，命应黄石。 丁巳玉女掌城社，能次阵解围，取城破寨。 又能呵气，决诸寒热不时之病。 在天主火赤气夏长，镇人心神，应赤石。 造坛之法 用竹纂子共十八个，六个长二尺五寸，六个长五尺，六个长四尺，作三层钉之。 中央先钉五尺者，六个分作六面，上安真武印、镜子一面，可方圆二尺许。 次外钉四尺者，六个安六丁玉女之位，二层各安五色旛子十二个於中央，并二层竹纂之上，依方所属系之。 亥子方用皂，乃西北方上。 如寅卯东北方用青，巳午东南方用赤，申酉西南方用白。 旛四首，安於丑北方侧，辰东方侧，未西方侧，戌北方侧。 四旛用黄各布之，方围四尺。 又次钉纂子六个，各长二尺五寸者，安净布六条之。 铺坛毕，却用绯线穿牵，远三层作六门，各立六丁旗，依方色相安六丁位，每位上各书本身符一道，六位面各照坛外，背向内。 木剑六口，木刀六口，小弩子六张，每箭二枝，戟三条，戈三条，随六丁所用之。 又供养中央一位，是真武之位，用酒菜饼食，香三炉。 第三层供养五谷杂粱，菜果鲜鱼鹿脯，乃是樟柳造成脯也。 酒六盏，欢喜团七个。 於大会日甲子夜二更后，向北方烈火焚香，仰视北辰，依前恳祷，手执此经，稽首再上香。 臣倾心沥志，集气会神，再拜上香，以虔盟誓。 臣乃太上老君弟子，以久清净，诚诚天机，不欲尘凡，饭依大道。 臣谨谨拜恳，专奏上闻，伏愿真灵，俯垂悯念。 臣拜授《太上老君玉女六阴洞微经法》，臣欲行持，愿垂洞鉴。 受法之后，不敢轻易，非急难助国救民，誓无谬用。 臣对圣前，诚誓此言。",
      "translated_text": "The Dinghai Jade Maiden can also split metals and stones and cleave the earth to open paths. In heaven, she presides over the black qi of water and the storage of winter, guarding the essence and kidneys, corresponding to dark stone.\n\nThe Dingyou Jade Maiden governs rivers and seas. She can stir winds and waves, scour sands to breach banks, and turn back tides to engulf the sun. She can also blow a single leaf into a boat of olive wood to ferry people across. In heaven, she presides over the white qi of metal and the harvest of autumn, guarding the lungs and corporeal soul, corresponding to white stone.\n\nThe Dingwei Jade Maiden governs mountains and waterways. She can transform yin soldiers to aid in battles and rescue those in peril—whether from childbirth, water, fire, or weapons. In heaven, she presides over the yellow qi of earth’s virtue, the surplus of the four seasons, guarding the spleen and stomach, corresponding to yellow stone.\n\nThe Dingsi Jade Maiden governs cities and altars. She can arrange formations to break sieges and capture cities or fortresses. She can also exhale to cure untimely chills and fevers. In heaven, she presides over the red qi of fire and the growth of summer, guarding the human heart and spirit, corresponding to red stone.\n\n**Method for Constructing the Altar**\nUse eighteen bamboo stakes: six measuring two feet and five inches, six measuring five feet, and six measuring four feet, arranged in three layers and nailed together. First, nail the five-foot stakes in the center, positioning six of them to form six sides. Place the True Martial Seal and a mirror (approximately two feet in diameter) atop this layer. Next, nail the four-foot stakes around them to mark the positions of the Six Ding Jade Maidens. On the central and second layers, hang twelve five-colored banners, tying them to the bamboo stakes according to their directional correspondences: black for the north-northwest (the *hai-zi* direction), green for the northeast (*yin-mao*), red for the southeast (*si-wu*), and white for the southwest (*shen-you*). Four additional banners are placed at the sides of the *chou* (north), *chen* (east), *wei* (west), and *xu* (north) directions, each four feet square and yellow in color. Finally, nail the remaining six stakes, each two feet and five inches long, and drape them with six strips of clean cloth.\n\nOnce the altar is laid out, use crimson thread to connect the three layers, forming six gates. Erect Six Ding banners at each gate, matching their colors to their directional positions. Inscribe each position with its respective talisman, ensuring all six face outward from the altar while their backs point inward. Prepare six wooden swords, six wooden knives, six small crossbows (each with two arrows), three halberds, and three spears, to be used by the Six Ding as needed.\n\nAt the central position, honor the True Martial’s station with offerings of wine, dishes, cakes, and three incense burners. On the third layer, present offerings of the five grains, mixed millet, vegetables, fruits, fresh fish, and dried venison (made from camphor and willow wood), along with six cups of wine and seven *huanxi* (joyous) balls.\n\nOn the grand assembly day, at the *jiazi* hour of the second watch of the night, face north and burn incense in a blazing fire. Gaze upon the North Star, earnestly pray as before, hold this scripture, and bow deeply to offer incense again. With a heart poured forth and spirit gathered, I prostrate and offer incense once more, pledging my sincerity.\n\nI, a disciple of the Most High Lord Lao, have long cultivated purity, reverently guarding the celestial mysteries and shunning the mundane to devote myself to the Great Dao. With utmost reverence, I humbly submit this petition, beseeching the true numina to look upon me with compassion. I have received the *Scripture of the Six Yin Jade Maidens of the Most High Lord Lao’s Cavern Mystery*, and wish to practice its methods—may the profound powers witness my resolve.\n\nAfter receiving this teaching, I dare not treat it lightly. Unless in dire emergencies to aid the state or save the people, I swear never to misuse it. Before the sacred presence, I solemnly vow these words.",
      "overlap_context": " to azure stone.\n\nThe Dingchou Jade Maiden governs insects and beasts. She can mobilize treasures and reveal hidden stores, as well as enhance the growth of medicinal herbs to heal human ailments. In heaven, she presides over the central qi of the five grains and the four seasons, guarding the human *niwan* (mud-pill palace), corresponding to jasper.\n\nThe Dinghai Jade Maiden governs mountains and rivers. She can move Mount Tai, reduce it to a small hill, block roads, or dredge rivers and canals.",
      "start_char": 5979,
      "end_char": 6721,
      "start_sentence": 335,
      "end_sentence": 366,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.360939025878906,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\秘藏通玄变化六阴洞微遁甲真经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "或不遵依，甘当罪罚。 凡有急缓救应，愿垂感通加护。 臣拜上香，进前默云：臣今欲请二三玉女，为臣之使，上达天庭，下巡世界，行符飞印，祛邪治妖，一切运行，从臣所使。 伏愿圣聪，亲垂洞鉴。 再拜上香，祝曰：臣所启事毕，已告御前，更冀众真，时行护佑。 拜毕收座，预先於癸亥夜，先写一状并符，请六丁玉女，今列状式于后。 大会伸意状式 具乡贯、法位、姓名。 右某辄露丹衷，上干 真造，所伸意者。 今据某事，切闻大道真文、洞微秘典、六阴玉女、六丁大神，仁通三界，普往四方，助国济民，安人利物。 切念某叨居人世，身处尘寰，欲以行持，未受玄奥，先於某君门下传受古法黄帝洞微经六阴玉女六丁大神秘诀符印咒文一宗。 皈身崇奉，助其正道，庇家保命，助国救民。 今者伏遇某月某日甲子之辰，谨备凡仪，辄陈衷悃。 愿於癸亥之日，谨具状申请降真灵，愿垂降鉴。 须至申者，右谨伏请 丁卯玉女无极仁福真君， 丁丑玉女横天仁实真君， 丁亥玉女都府仁元真君， 丁酉玉女亚夫仁休真君， 丁未玉女无比仁至真君， 丁巳玉女高上仁德真君，恭望 真慈，允臣所请。 愿垂专念，俯察私心。 至日特降云耕，下临坛席，密行昭报，专俟感通，冒犯真威。 某下情无任，激切之至，谨具状以闻。 谨状。 年　月　日，具　法　位　臣某状。",
      "translated_text": "Should I fail to uphold these vows, I willingly accept punishment for my transgressions. In all matters of urgency or delay, in times of salvation and response, may the numinous powers grant their resonant protection.\n\nI prostrate and offer incense, advancing to silently intone: I now beseech two or three Jade Maidens to serve as my envoys, ascending to the celestial court and descending to traverse the world, wielding talismans and flying seals to dispel evil and subdue demons. May all their movements be at my command. I humbly pray that the sagely wisdom may deign to witness this.\n\nAgain I prostrate and offer incense, praying: Having presented my petition before the sacred presence, I now implore the host of Perfected Ones to ever grant their protection and safeguarding.\n\nAfter the rites conclude and the altar is withdrawn, on the night of *guihai*, I shall first draft a petition and talisman to summon the Six Ding Jade Maidens. Below is the prescribed format for the petition.\n\n**Petition Format for the Grand Assembly**\n\n[State] one’s native place, dharma rank, and name.\n\nTo the right, I, [Name], humbly reveal my sincere heart, venturing to address the True Origin. The purpose of this petition is as follows:\n\nNow, regarding [specific matter], I have heard of the True Writ of the Great Dao, the esoteric scriptures of the Cavern Mystery, the Six Yin Jade Maidens, and the Six Ding Great Spirits—whose benevolence pervades the Three Realms and extends universally to the Four Directions, aiding the state, delivering the people, pacifying humanity, and benefiting all beings.\n\nDeeply mindful that I, [Name], dwell in the mundane world, my body bound to the dusty realm, I aspire to practice these methods but have yet to receive their profound mysteries. First, I received from the lineage of [Master’s Name] the ancient methods of the *Yellow Emperor’s Cavern Mystery Scripture*, including the secret talismans, seals, incantations, and oral instructions of the Six Yin Jade Maidens and the Six Ding Great Spirits.\n\nI take refuge in and revere these teachings, aiding the true Dao, shielding my family, preserving my life, and assisting the state in saving the people.\n\nNow, on this [specific month and day] of the *jiazi* cycle, I humbly prepare these offerings and present my heartfelt sincerity. On the day of *guihai*, I shall formally submit this petition to invoke the descent of the true numina, praying for their gracious witness.\n\nThe essential petition is as follows:\n\nTo the right, I reverently beseech:\n- The True Lord of Infinite Benevolence and Blessing, the *Dingmao* Jade Maiden;\n- The True Lord of Vast Heaven and True Reality, the *Dingchou* Jade Maiden;\n- The True Lord of the Capital Prefecture and Primordial Benevolence, the *Dinghai* Jade Maiden;\n- The True Lord of Subduing Warriors and Benevolent Repose, the *Dingyou* Jade Maiden;\n- The True Lord of Unmatched Benevolence and Ultimate Perfection, the *Dingwei* Jade Maiden;\n- The True Lord of Lofty Excellence and Virtuous Power, the *Dingsi* Jade Maiden.\n\nI humbly await their true compassion to grant my request. May they deign to focus their attention and look upon my private intentions with favor.\n\nOn that day, may they specially descend in cloud chariots to alight upon the altar, secretly manifesting their responses and awaiting the resonance of their numinous power. I venture to offend the true majesty.\n\nMy heartfelt devotion is beyond measure; my urgency knows no bounds. I respectfully submit this petition for your consideration.\n\nRespectfully submitted.\nYear ___ Month ___ Day\n[Dharma Rank] Disciple [Name] petitions.",
      "overlap_context": "h utmost reverence, I humbly submit this petition, beseeching the true numina to look upon me with compassion. I have received the *Scripture of the Six Yin Jade Maidens of the Most High Lord Lao’s Cavern Mystery*, and wish to practice its methods—may the profound powers witness my resolve.\n\nAfter receiving this teaching, I dare not treat it lightly. Unless in dire emergencies to aid the state or save the people, I swear never to misuse it. Before the sacred presence, I solemnly vow these words.",
      "start_char": 6721,
      "end_char": 7263,
      "start_sentence": 367,
      "end_sentence": 394,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.73487091064453,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\秘藏通玄变化六阴洞微遁甲真经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "外用实封圆皮，金钱云马各六分，粘连本身六符、并印样、并差将吏直符。 用金钱焚、之，责持前去投达，随分香案供养，向来请席，再拜，呈状内事意。 另外一封申请真武真君。 请真武状式 伏望真武真君，至日下降坛所，证盟行持。 甲子日奉事人，勿行轻杀生灵，慈和心情，於坛中设位，依式行持。 闲人不得入坛，只可於坛外干事。 勿使僧尼、女人、兄子视之，并忌鸡犬六畜为犯。 上香酌酒，皆奉事人自行近前奠。 先於丁卯真君前启请，又焚香，并符一道，乃合同符也。 诵本身呎，取本方炁吹之。 次丁丑、丁亥、丁酉、丁未、丁巳，依次启请，焚符逐一，取气吹坛上。 伏乞真灵，俯垂大造，随请下降法驾，受臣恳祷。 逐一请毕。 左手中指，右手大煞文，叩齿三十六通，念六阴六丁玉女八素隐言。 咒曰： 龙曜九炁，五岳从之。 天蓬四圣，十元八极。 斗星北灵，十二日直。 玉女六丁，愿垂真光。 助法勑摄，吾奉太上老君洞微律令勑。 右念三遍。 逐一摄六丁本身诀、玉女名召之，取逐方气，吹入坛中。 请坐烧本身符六道於坛中，叩齿，暝目存想玉女六位降临坛所。 先请 真武真君降坛中，再拜上香，祝曰：臣今请真武真君，外次焚香请召二三玉女，想已降临坐次。 某稽首再拜。 某是太上老君弟子，久持圣道，欲愿长生，履清净规，行奥妙事，长亲至道，禀圣修行。 上荐九玄七祖，下济万民灾殃。 某奉持法箓，依道科行。 今欲置坛，装严净室。 依科营办，享祭真君。 仰赖威光，俯垂洞鉴。 今臣欲求妙理，为国安民，行水运符，检邪治鬼。 上助国家之用，下扶人命之为。 求仙学道，利济生民。 不论巨细一切运动之事，皆赖威仙当作使者，助某行持，听某指挥，东西南北悉皆从顺，称名画印，即时来临。 凡有呼召，火急报应。 臣意所咨，不可失信。 记其所言，刻骨铭心。",
      "translated_text": "For external use, securely seal with a circular cover. Include six portions each of gold coins and cloud-horses, affixed with the six talismans of the petitioner’s own body, along with the seal impression and the dispatch talisman for the divine messengers. Burn the gold coins and send them forth, entrusting them to be delivered. Arrange an incense altar according to rank, bow twice toward the petitioning seat, and present the matters stated within.\n\nAdditionally, submit a separate sealed petition to the Perfected Warrior, True Lord.\n\n**Petition Formula for the Perfected Warrior**\n\nI humbly await the Perfected Warrior, True Lord, to descend to the altar site on the appointed day and witness the covenant in practice.\n\nOn the *Jiazi* day, the officiant must refrain from careless killing of living beings, maintaining a compassionate and harmonious disposition. Set up the altar station and proceed according to the prescribed rites. No unauthorized persons may enter the altar space; all tasks must be performed outside. Keep monks, nuns, women, elder brothers’ sons, and all poultry, dogs, and livestock from violating the precincts.\n\nThe offering of incense and the pouring of wine must be performed by the officiant alone, approaching the altar directly.\n\nFirst, present the invocation before the True Lord of the *Dingmao* day, then burn incense along with one talisman—this is the matching talisman. Recite the petitioner’s own incantation and draw the qi of the corresponding direction to blow upon it.\n\nNext, proceed in order to the True Lords of *Dingchou*, *Dinghai*, *Dingyou*, *Dingwei*, and *Dingsi*, invoking each in turn, burning their respective talismans, and drawing the qi of each direction to blow upon the altar.\n\nI humbly beseech the true numen to deign in great creation, descending in the ritual chariot upon my earnest supplication. Once all have been invoked in sequence:\n\nWith the left hand’s middle finger and the right hand’s *Great Execution Seal*, strike the teeth thirty-six times and recite the *Hidden Words of the Six Yin and Six Ding Jade Maidens and Eight Transcendent Essences*:\n\n**Incantation:**\n*\"The radiance of the Nine Qi of the Dragon,\nThe Five Peaks follow in its train.\nThe Four Saints of Heavenly Obscurity,\nThe Ten Origins and Eight Poles.\nThe Dipper Star of the Northern Numen,\nThe Twelve Daily Officers.\nThe Six Ding Jade Maidens,\nMay they bestow their true light.\nAssist the dharma’s command and restraint—\nI invoke the Mandate of the Supreme Venerable Lord of the Cavernous Subtleties.\"*\n\nRecite this three times. Then, in sequence, employ the hand seals of the Six Ding’s own body and summon the Jade Maidens by name, drawing the qi of each direction to blow into the altar.\n\nBurn the six talismans of the petitioner’s own body within the altar, strike the teeth, close the eyes, and visualize the six Jade Maidens descending to the altar site.\n\nFirst, invite the Perfected Warrior, True Lord, to descend to the altar. Bow twice, offer incense, and pray:\n\n*\"I now invoke the Perfected Warrior, True Lord. Next, I burn incense to summon the Second and Third Jade Maidens, who are already descending to their seats. I bow my head and prostrate myself again.*\n\n*I am a disciple of the Supreme Venerable Lord, long devoted to the sagely Dao, desiring eternal life, treading the path of purity, practicing profound and wondrous deeds, ever drawing near to the supreme Dao, and cultivating the sagely path. Above, I offer advancement to the Nine Mysteries and Seven Ancestors; below, I relieve the calamities of the myriad people. I uphold the dharma registers and act in accordance with the Daoist canons.*\n\n*Now, I wish to establish an altar and adorn a purified chamber. Following the canons, I prepare offerings to honor the True Lord. I rely upon your majestic radiance and humbly beseech your penetrating insight.*\n\n*Today, I seek the wondrous principles to pacify the nation and secure the people, to deploy water talismans, to inspect and govern demons. Above, to assist the state’s needs; below, to sustain human lives. To seek immortality and study the Dao, to benefit and succor the living.*\n\n*In all matters great or small, I depend upon the divine might of the immortals to act as my envoys, to aid my practice, to heed my commands, and to comply in all directions—east, west, south, and north. When named and their seals are drawn, may they arrive instantly. In every summons, may they respond with utmost urgency. Whatever I consult, let there be no breach of faith. May their words be remembered and engraved upon my heart and bones.\"*",
      "overlap_context": "focus their attention and look upon my private intentions with favor.\n\nOn that day, may they specially descend in cloud chariots to alight upon the altar, secretly manifesting their responses and awaiting the resonance of their numinous power. I venture to offend the true majesty.\n\nMy heartfelt devotion is beyond measure; my urgency knows no bounds. I respectfully submit this petition for your consideration.\n\nRespectfully submitted.\nYear ___ Month ___ Day\n[Dharma Rank] Disciple [Name] petitions.",
      "start_char": 7264,
      "end_char": 7982,
      "start_sentence": 395,
      "end_sentence": 434,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.574009895324707,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\秘藏通玄变化六阴洞微遁甲真经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "复上香再拜，轻轻近前，低告曰：吾领太上之令、玉皇之敕，平调宇宙，安辅国家，兴兵发马，使鬼祛邪。 今祭仙灵，永为佐使。 须当随吾机变，依吾工所为。 若有不从，吾当行太上之令、玉皇之敕，斩汝之身，灭汝之形。 伏愿灵通，下垂聪听。 再拜，上香真武真君。 举酒三次，设拜跪二膝叩齿，祝云：维某年月日时，弟子某谨遇大会之夜，敬祭于二三玉女之前。 切念某惟性自然，心受天章，本师有约，太上传详。 今当大会，聊献于觞。 风伯洒扫，雨师净坛。 奉事弟子，心好真祥。 陈名通姓，愿奉真光。 终身奉祀，永不相忘。 今日拜祭，美食脯香，安邑大枣，细核小秾，百清香酒，浮蚁倾浆，时新五菜，白米嘉粮。 酒醉食饱，随我行藏。 凡有祷语，一一相当。 常随我所，常佑我傍。 我之所愿，随意吉昌。 我所到处，与真偕行。 隐显往返，万世安康。 速成大道，早达仙乡。 我有诸苦，真为吉祥。 我有所欲，真当随长。 入敌保国，万事为良。 扶卫我身，与天地藏。 倾灌奠酹，伏惟尚飨。 急急如太上律令敕。 又再拜上香，逐一诵本身呢，取气一口吹座上。 密祝公： 丁卯玉女，吾得《太上六阴经洞微真文》。 知神之姓，知仙之名。 有法召仙，有法使神。 往来三界，出幽入冥。 行住坐外，皆赖仙真。 召之立至，召之立临。 人间万事，令我通闻。 愿以昭报，幸勿违戾。 急急如律令敕。 从丁卯方取气吹之，次又取丁丑方气吹之，其余仿此吹之。 再虔上香再拜。 起立，步丁巳，逵坛左，东发步。 咒曰： 能使六阴，出幽入冥。 无畏无怖，亦无所惊。 随吾符转，逐吾印行。 祛除万祸，集福一身。 日动夜藏，不得违令。 急急如律令敕。 如是逵坛三匝毕，就位上香再拜讫。 取符一道，拥成丸子，用当位上酒服之。 再拜谢毕，又转一位拜，毕取符服之。 如此六处，六道符服已毕。 在坛正立，上香再拜。 默念此语云： 吾奉此法，吾乃为君，以神为臣。 吾所欲为，神当随情。 自此已往，不离吾身。 金钱六分，助真云程。 凡所施为，不得失盟。 烧化钱纸毕，即收座席。 收座上供献物自吃。 若不吃，埋之。 散坛而退。 此是大会祭式施设，如小会则不然。 凡遇散甲之日当旬玉女，即备一分钱马祭之。 祭物一分，余皆香茶酒而已。 黄帝曰：奉事六丁人，欲得长生者，皆当六丁之日，不得淫欲杀生，更能存守中正。 精气内外，即不过六会。 六丁献汝还丹，常因事而成道身，为地仙乃得长生。 如欲要安邦安国，行师闯外，百战百克。 奉事六丁人，若至六会神出现，其分明见其形像，勿起私心，即当虔诚恭敬，不得妄想。 邪心犯之者，立杀其身。 六丁能乎进退，以致守城战敌，出奇八阵之法。 兼能攻敌国之密，事及知敌人之心。 举措之谋，无所不通。 凡有行持，建业立功，以至起工，婚嫁赌赛，祈雨求风，伐贼破庙，去毒杀怪，屠龙驱虎，无所不验。 治病除害，此法其中，自有条格。 奉事人不愿长生，欲求富贵者，即六丁驱运财宝，理会造化。 如奉杞人欲知父母存亡，叩而立至，可知存亡。 如要自知前程之事，与夫长短，叩之六丁，能报至实。 凡有举为，自有报应。 遇大会甲子第一会服符，第二会不必服。 如第一会起首服符，但一旬服六道，六会服三十六道。",
      "translated_text": "Once more I offer incense and bow twice, then softly approach and humbly petition:\n\n“I receive the command of the Most High and the decree of the Jade Emperor to harmonize the cosmos, pacify and assist the state, dispatch troops and mobilize forces, expel demons and dispel evil. Today, I honor the immortal spirits, that they may serve as my eternal aides. You must adapt to my strategies and follow my works. Should any disobey, I shall enforce the command of the Most High and the decree of the Jade Emperor to sever your form and extinguish your being. I humbly beseech your numinous efficacy—may you incline your divine hearing.”\n\nAgain I bow, offering incense to the True Martial Lord. Thrice I lift the wine, then kneel and prostrate, knocking my teeth together, and pray:\n\n“On this day, month, and hour, your disciple [Name] reverently observes the night of the Grand Assembly, offering solemn sacrifice before the two or three Jade Maidens. I reflect that my nature is spontaneous, my heart receives the celestial script, my original master has made covenant, and the Most High has transmitted the details. Now, at this Grand Assembly, I modestly present this libation. The Wind Earl sweeps clean, the Rain Master purifies the altar. Your devoted disciple, with a heart fond of true auspices, declares his name and surname, wishing to receive your radiant presence. I vow lifelong devotion, never to forget. Today’s offering includes fine meats, dried delicacies, and fragrant incense; large jujubes from Anyi, small and plump; pure wine with floating froth, fresh seasonal vegetables, and white rice—excellent grain. May you drink to intoxication and eat to satiety, then follow my movements. Whatever prayers I utter, may each be fulfilled. Ever attend me, ever protect my side. My wishes shall prosper as I desire. Wherever I go, may you accompany the true ones. In concealment or manifestation, through all journeys, may you ensure eternal peace. Swiftly attain the great Dao, soon reach the immortal realm. In all my sufferings, may the true bring auspiciousness. In all my desires, may the true follow and fulfill. Defending the nation against foes, may all affairs be favorable. Guard and shield my body, concealed with heaven and earth.”\n\nI pour the libation, humbly invoking your partaking.\n\n*Swiftly, swiftly, in accordance with the statutes and decrees of the Most High.*\n\nAgain I bow and offer incense, reciting my personal mantra one by one, then draw in a breath of qi and blow it upon the altar. Secretly, I pray:\n\n“O Ding-Mao Jade Maiden, I have obtained the *True Writ of the Six Yin Essences from the Cavern of Mysteries* of the Most High. I know the names of the spirits, the names of the immortals. With this method, I summon immortals; with this method, I command spirits. They traverse the Three Realms, emerging from darkness into light. In movement, stillness, sitting, or standing, all depend on the immortal true ones. Summoned, they arrive instantly; invoked, they descend at once. All affairs of the human world shall be made known to me. May my gratitude be manifest—do not defy me.”\n\n*Swiftly, swiftly, in accordance with the statutes and decrees.*\n\nI draw qi from the Ding-Mao direction and blow it forth, then likewise from Ding-Chou and the remaining directions. Once more, I devoutly offer incense and bow.\n\nRising, I step toward Ding-Si, circling the altar to the left, beginning my pace eastward. I recite the incantation:\n\n“Empowering the Six Yin, emerging from darkness into light,\nFearless and undaunted, without alarm.\nFollow the turning of my talismans, pursue the path of my seals.\nDispel ten thousand calamities, gather blessings upon this body.\nActive by day, concealed by night—do not disobey my command.”\n\n*Swiftly, swiftly, in accordance with the statutes and decrees.*\n\nThus I circle the altar thrice, then return to my position, offer incense, and bow again. Taking one talisman, I roll it into a pellet and swallow it with the wine from the corresponding position. I bow in gratitude, then move to the next position, bow, and consume another talisman. In this manner, I complete the six positions, ingesting six talismans.\n\nStanding upright before the altar, I offer incense and bow once more. Silently, I recite:\n\n“I uphold this method, and thus I am the lord; the spirits are my ministers. Whatever I desire, the spirits shall follow my will. From this moment onward, never leave my side. Six portions of golden coin assist the true journey. In all undertakings, do not breach our covenant.”\n\nAfter burning the paper money, I clear the altar and consume the offerings myself. If not eaten, they are buried. The altar is then dismissed.\n\nThis is the ritual arrangement for the Grand Assembly; lesser gatherings differ. On the day of the dispersing *jia* within each ten-day period, when the corresponding Jade Maiden is honored, prepare a portion of paper money and horses for the offering. The sacrificial items include a portion of food, with the rest being incense, tea, and wine.\n\nThe Yellow Emperor said: Those who serve the Six Ding, desiring longevity, must observe the Six Ding days without engaging in lust or taking life. Further, they should cultivate inner and outer essence, abiding in centered rectitude—then they will not exceed six assemblies. The Six Ding will present you with the returning elixir, and through your affairs, you may attain the body of the Dao and become an earthbound immortal, thus achieving longevity.\n\nIf one seeks to pacify the nation and secure the state, to lead armies and campaign beyond the borders, achieving victory in every battle—those who serve the Six Ding, when the spirit manifests at the six assemblies, will clearly perceive its form. Do not harbor impure thoughts; be reverent and sincere, without wayward imaginings. Those who offend with perverse intent will be slain instantly.\n\nThe Six Ding can advance or retreat, defend cities, engage enemies, and deploy the eight extraordinary formations. They can also penetrate the secrets of enemy states, discern the hearts of adversaries, and comprehend all strategies and plans. In all practices, establishing merit and founding enterprises, commencing construction, marriages, gambling, competitions, praying for rain or wind, subduing bandits, destroying temples, dispelling poisons, slaying monsters, beheading dragons, or driving away tigers—there is nothing they do not verify.\n\nFor healing illnesses and eliminating harm, this method contains its own regulations. Those who serve but do not seek longevity, desiring wealth and honor instead, may have the Six Ding drive forth treasures and manage the workings of creation.\n\nIf one serving wishes to know whether their parents are alive or deceased, upon invocation, the answer will come at once. If one desires to know their own future affairs—length of life or brevity—invoking the Six Ding will reveal the truth. In all undertakings, there will be corresponding responses.\n\nAt the first Grand Assembly on the *jiazi* day, consume the talisman; at the second assembly, it is unnecessary. If beginning with the first assembly, consume six talismans in one ten-day period, totaling thirty-six talismans over six assemblies.",
      "overlap_context": "d study the Dao, to benefit and succor the living.*\n\n*In all matters great or small, I depend upon the divine might of the immortals to act as my envoys, to aid my practice, to heed my commands, and to comply in all directions—east, west, south, and north. When named and their seals are drawn, may they arrive instantly. In every summons, may they respond with utmost urgency. Whatever I consult, let there be no breach of faith. May their words be remembered and engraved upon my heart and bones.\"*",
      "start_char": 7982,
      "end_char": 9229,
      "start_sentence": 435,
      "end_sentence": 517,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.39038133621216,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\秘藏通玄变化六阴洞微遁甲真经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "如第一会服六六三十六道符，第二会不必服。 依式祭之。 如一年不及六大会，二年祭足，亦得其小会，不缺也。 凡会书六丁符及诸符，用朱砂黄纸书，当用真武印印之。 秘藏通玄变化六阴洞微适甲真经卷中竟 秘藏通玄变化六阴洞微遁甲真经卷下 立坛法式 坛式之图 立坛式用纂，六个长四尺，六个长二尺五寸，六个长五尺五寸。 先以五尺五寸者， 钉在中央，分作六面，上以净布填之，可方圆二尺许。 次以四尺者，又以二尺五寸者。 钉讫，将绯线栏作六面，可方圆六尺。 第二方圆四尺，第三方圆二尺。 第二纂上安磨子十二首，自子至亥，象色而绘之，随所属色。 如亥子属水，用黑色，次第布之。 层层之下，以净布或案子各六面，各安木刀一口，立在坛下。 第一安真武印，在坛中圆镜一面。 纂安六丁像旗，丁丑黄，丁卯青，丁巳赤，丁未黄，丁酉白，丁亥黑。 第二层上，各安六丁位次。 丁酉位上，安小弩一张，箭二枝。 丁巳位上，安小戟一张。 丁亥位上，安剑一张。 丁卯位上，剑一张。 余二位，无物。 又以枣木板六片，绘玉女真相在上，於真相下书符，朱书各於本位上。 如法安置，各面照外，背向背。 凡开启，各於其属之神前用事，寻常设拜席，只在丁亥面前，以向北方真武也。 坛内祭物 五谷内杂粮六分。",
      "translated_text": "If at the first Grand Assembly one consumes thirty-six talismans, there is no need to consume them at the second. Perform the rites according to the prescribed form. Should one fail to complete the six Grand Assemblies within a year, fulfilling them over two years will suffice, including the minor assemblies without omission.\n\nFor all assemblies, when inscribing the Six Ding talismans and other talismans, use cinnabar on yellow paper, and impress them with the True Warrior seal. *Secret Repository of the Mysterious Transformations: The Six Yin Cavern Essentials of the Hidden Dao of the Eighteen Cyclical Branches, Scroll the Middle* concludes here.\n\n*Secret Repository of the Mysterious Transformations: The Six Yin Cavern Essentials of the Hidden Dao of the Eighteen Cyclical Branches, Scroll the Lower*\n**Method for Erecting the Altar**\n**Diagram of the Altar’s Form**\n\nFor the altar’s construction, prepare eighteen poles: six measuring four feet in length, six measuring two feet and five inches, and six measuring five feet and five inches. First, take the five-foot-five-inch poles and drive them into the center, arranging them into six sides. Cover the top with clean cloth, forming a square or circle approximately two feet across. Next, affix the four-foot poles, followed by the two-foot-five-inch poles. Once secured, encircle them with crimson thread to delineate six sides, forming a square or circle approximately six feet across. The second tier should measure four feet, and the third two feet.\n\nOn the second tier, place twelve millstones, one for each branch from *zi* to *hai*, painted in their corresponding colors. For instance, *hai* and *zi* belong to Water and should be black; arrange them in order. Beneath each tier, place clean cloth or small tables on all six sides, each bearing a wooden sword, standing at the altar’s base.\n\nAt the center of the first tier, place the True Warrior seal alongside a round mirror. Affix the Six Ding banners to the poles: *ding-chou* in yellow, *ding-mao* in blue-green, *ding-si* in red, *ding-wei* in yellow, *ding-you* in white, and *ding-hai* in black.\n\nOn the second tier, arrange the Six Ding positions. At the *ding-you* position, place a small crossbow with two arrows. At the *ding-si* position, place a small halberd. At the *ding-hai* position, place a sword. At the *ding-mao* position, place another sword. The remaining two positions remain unoccupied.\n\nPrepare six jujube-wood tablets, painting the true forms of the Jade Maidens upon them. Beneath each image, inscribe the talisman in cinnabar, placing each at its respective position. Arrange them according to the method, each side facing outward, backs toward one another.\n\nWhen initiating rites, perform them before the deity corresponding to the occasion. For regular worship, set the offering mat before the *ding-hai* side, facing north toward the True Warrior.\n\n**Offerings within the Altar**\nSix portions of mixed grains from the Five Grains.",
      "overlap_context": "nts are alive or deceased, upon invocation, the answer will come at once. If one desires to know their own future affairs—length of life or brevity—invoking the Six Ding will reveal the truth. In all undertakings, there will be corresponding responses.\n\nAt the first Grand Assembly on the *jiazi* day, consume the talisman; at the second assembly, it is unnecessary. If beginning with the first assembly, consume six talismans in one ten-day period, totaling thirty-six talismans over six assemblies.",
      "start_char": 9229,
      "end_char": 9742,
      "start_sentence": 518,
      "end_sentence": 546,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.418723106384277,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\秘藏通玄变化六阴洞微遁甲真经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "香炉六个。 茶六盏。 净布六条。 鲜鱼六头。 鹿脯六碟。 酒六盏。 此大会都祭之法。 如小会，逐旬於所当祭之神祭之，甩烧钱六分。 凡祭时，切莫称呼六丁字，乃玉女讳此字也。 只言二三玉女，一午大会，止有六个，甲子乃大会也。 祭余只是六丁日，各於位下祭之。 且如丁丑日，只於丁丑神用物，一般余五位，只以香荼祭之。 遇甲子日大会，则如前式同祭。 闲时拆去坛场，如祭之第六会，则不拆去，要用事也。 大凡六度各圆，备志诚之士以一年祭，就乃幸也。 如六祭毕，存留坛场於室内，逐日只自出入，切忌他人，莫令见之。 为尚一年有大会六日，小会三十六次。 如事多，一年祭不敷，则祭一大会。 遇小会不可蹉过，反招其咎。 至祝至祝，坛上画符，神象之法，及书名号，并依法式。 丁卯符 丁丑符",
      "translated_text": "Six censers. Six cups of tea. Six strips of pure cloth. Six fresh fish. Six plates of dried venison. Six cups of wine. These are the rites for the grand assembly. For minor assemblies, perform the offerings to the deity of the respective ten-day period, burning six portions of spirit money. During rites, never utter the term \"Six Ding,\" for the Jade Maidens hold this character taboo. Refer only to the \"Second and Third Jade Maidens\"; in the grand assembly of the *wu* noon, there are but six. The *jia-zi* day marks the grand assembly. For other rites, observe only the Six Ding days, offering at each respective position. For instance, on the *ding-chou* day, use the prescribed items only for the *ding-chou* deity, while the remaining five positions receive only incense and tea. On the *jia-zi* grand assembly day, perform the rites as before, offering to all.\n\nWhen not in use, dismantle the altar. However, after the sixth assembly, leave it intact for further rites. Generally, when the six rituals reach completion, a devout practitioner may perform the annual rites—this is most auspicious. Upon completing the six rites, retain the altar within the chamber, entering and exiting alone each day, strictly forbidding others from seeing it. For within a year, there are six grand assemblies and thirty-six minor ones. If affairs are numerous and the year’s rites insufficient, perform one grand assembly. Never neglect a minor assembly, lest it invite misfortune.\n\nIn all invocations and supplications, the drawing of talismans upon the altar, the method of depicting divine images, and the inscription of names must adhere strictly to the prescribed forms.\n\n*Ding-mao* Talisman\n*Ding-chou* Talisman",
      "overlap_context": "e forms of the Jade Maidens upon them. Beneath each image, inscribe the talisman in cinnabar, placing each at its respective position. Arrange them according to the method, each side facing outward, backs toward one another.\n\nWhen initiating rites, perform them before the deity corresponding to the occasion. For regular worship, set the offering mat before the *ding-hai* side, facing north toward the True Warrior.\n\n**Offerings within the Altar**\nSix portions of mixed grains from the Five Grains.",
      "start_char": 9742,
      "end_char": 10065,
      "start_sentence": 547,
      "end_sentence": 568,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.301357507705688,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\秘藏通玄变化六阴洞微遁甲真经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "丁亥符 丁酉符 丁未符 丁巳符 六阴符 此符用枣木板子，一寸五分。 一面书符，一面刻玉女名字。 带於发中，非梳头不可取下。 丁卯玉女足日之，字保中，号无极真君。 此符书于黄纸上，安丁卯玉女位，并书一道于牒前用。 咒曰：无极之真，足日之身。 为吾所请，从吾所行。 急急如律令敕。 书讫，念咒三遍。 取东方炁吹符上，左右手掐大煞文诀，足丁罡履日。 藏形云云。 丁卯合同符 此符念前咒，书于丁卯位，朱书黄纸，同前符为九，酒服。 丁丑玉女炁无上，字太和，号横天真君。 此符安丁丑玉女位下，并书一道于牒前通用。 咒曰：太和至圣，横越天真。 为吾所指，依吾所陈。 急急如律令敕。 书讫，取北方熙吹符上，念呢三遍。 丁丑合同符 此符与前咒诀气同，仍为九，照前以本位酒服之。 丁亥玉女陆明集，字广阳，号都府真君。 此符朱书黄纸上，於丁亥玉女位下，及书一道于牒前用。 咒曰：广阳真君，名字陆明。 为吾所指，助吾所行。 急急如律令敕。 念咒三遍，取北方炁入符。 丁亥合同符 此符同前书咒诀炁，作九子，以本位下酒服之。 丁酉玉女救钦灵，字正一，号亚夫真君。 此符朱书黄纸上，安於丁酉位上。 又书一道于牒前，取西方炁吹符上。 咒曰：救钦之灵，亚夫大真。 为吾所指，佐吾所行。 急急如律令敕。",
      "translated_text": "*Ding-hai* Talisman\n*Ding-you* Talisman\n*Ding-wei* Talisman\n*Ding-si* Talisman\nSix Yin Talismans\n\nThese talismans are inscribed on jujube wood tablets, each one *cun* and five *fen* in size. One side bears the talisman, while the reverse is carved with the name of the Jade Maiden. They are worn within the hair and must not be removed except when combing.\n\nThe Jade Maiden of *Ding-mao* is named *Zubao Zhong*, with the title *Wuji Zhenjun* (True Lord of the Ultimateless). This talisman is written on yellow paper and placed at the station of the *Ding-mao* Jade Maiden, with an additional inscription affixed to the front of the memorial. The incantation reads:\n\n*\"O True One of the Ultimateless, embodied in the Day of the Foot.\nBe summoned by me, act as I command.\nSwiftly, swiftly, as decreed by statute and ordinance!\"*\n\nUpon completion, recite the incantation three times. Draw the *qi* of the eastern direction and blow it onto the talisman. With both hands, form the *Dashai* mudra, and tread the *Ding* step upon the solar path. Conceal the form, and so forth.\n\n*Ding-mao* Union Talisman\nThis talisman, inscribed at the *Ding-mao* station in red on yellow paper, is made in sets of nine following the previous method and consumed with wine.\n\nThe Jade Maiden of *Ding-chou* is named *Qi Wushang*, with the title *Hengtian Zhenjun* (True Lord Traversing Heaven). This talisman is placed beneath the station of the *Ding-chou* Jade Maiden, with an additional inscription affixed to the front of the memorial for general use. The incantation reads:\n\n*\"O Most Sagely of Great Harmony, True One Traversing Heaven.\nBe directed by me, follow my decree.\nSwiftly, swiftly, as decreed by statute and ordinance!\"*\n\nUpon completion, draw the *qi* of the northern direction and blow it onto the talisman, reciting the mantra three times.\n\n*Ding-chou* Union Talisman\nThis talisman, following the same incantation, mudra, and *qi* as before, is made in sets of nine and consumed with wine from its respective station.\n\nThe Jade Maiden of *Ding-hai* is named *Luming Ji*, with the title *Dufu Zhenjun* (True Lord of the Capital Prefecture). This talisman is inscribed in red on yellow paper and placed beneath the station of the *Ding-hai* Jade Maiden, with an additional inscription affixed to the front of the memorial. The incantation reads:\n\n*\"O True Lord of Broad Yang, named Luming.\nBe directed by me, assist my actions.\nSwiftly, swiftly, as decreed by statute and ordinance!\"*\n\nRecite the incantation three times and draw the *qi* of the northern direction into the talisman.\n\n*Ding-hai* Union Talisman\nThis talisman, following the same method of inscription, incantation, mudra, and *qi* as before, is made in sets of nine and consumed with wine from its respective station.\n\nThe Jade Maiden of *Ding-you* is named *Jiuqin Ling*, with the title *Yafu Zhenjun* (True Lord Subordinate). This talisman is inscribed in red on yellow paper and placed at the *Ding-you* station, with an additional inscription affixed to the front of the memorial. Draw the *qi* of the western direction and blow it onto the talisman. The incantation reads:\n\n*\"O Spirit of Salvation and Reverence, Great True One Subordinate.\nBe directed by me, aid my actions.\nSwiftly, swiftly, as decreed by statute and ordinance!\"*",
      "overlap_context": "trictly forbidding others from seeing it. For within a year, there are six grand assemblies and thirty-six minor ones. If affairs are numerous and the year’s rites insufficient, perform one grand assembly. Never neglect a minor assembly, lest it invite misfortune.\n\nIn all invocations and supplications, the drawing of talismans upon the altar, the method of depicting divine images, and the inscription of names must adhere strictly to the prescribed forms.\n\n*Ding-mao* Talisman\n*Ding-chou* Talisman",
      "start_char": 10065,
      "end_char": 10639,
      "start_sentence": 569,
      "end_sentence": 608,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.912224054336548,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\秘藏通玄变化六阴洞微遁甲真经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "丁酉合同符 此符朱书咒炁诀同前，为九子，用本位酒服之。 丁未玉女乘素灵，字玄英，号无比真君。 此符朱书黄纸上，安于丁未位前，书一道于牒前用。 咒曰：无比真君，名曰素灵。 为吾所使，听吾所陈。 急急如律令敕。 咒三遍，取南方炁入符。 丁未合同符 此符朱书咒炁诀同前，为九子，用本位酒服之。 丁巳玉女朱福称，字文广，号高上真君。 此符黄纸朱书，安丁巳位下，一道牒前用。 咒曰：高上之真，名日福称。 为吾所指，为吾所陈。 急急如律令敕。 取南方炁吹符上。 丁巳合同符 咒炁同前，为丸子，用本位酒服。 此玉女符，凡欲所使，依句书召之。 或於牒，或书背后，写其事情。 用真武印印之，背用六丁印印之。 依前用玉女神咒炁诀召之，大获神验矣。 一法，用符方二寸，一面书符，背刊名，枣木版朱书，咒三遍，安座上。 六丁姓名下降符日 丁卯玉女宋镌文伯 子丑日下降 丁丑玉女梁锜元公 寅卯日下降 丁亥玉女姚铆文道 巳午日下降 丁酉玉女申锹文卿 戌亥日下降 丁未玉女朱钓升通 申酉日下降 丁巳玉女陈钧廷卿 辰巳日下降",
      "translated_text": "*Ding-you* Union Talisman\nThis talisman, following the same method of inscription, incantation, mudra, and *qi* as before, is made in sets of nine and consumed with wine from its respective station.\n\nThe Jade Maiden of *Ding-wei* is named *Cheng Suling*, with the title *Wubi Zhenjun* (Incomparable True Lord). This talisman is inscribed in red on yellow paper and placed before the *Ding-wei* station, with an additional inscription affixed to the front of the memorial. The incantation reads:\n\n*\"Incomparable True Lord, named Suling.\nBe directed by me, heed my words.\nSwiftly, swiftly, as decreed by statute and ordinance!\"*\n\nRecite the incantation three times and draw the *qi* of the southern direction into the talisman.\n\n*Ding-wei* Union Talisman\nThis talisman, following the same method of inscription, incantation, mudra, and *qi* as before, is made in sets of nine and consumed with wine from its respective station.\n\nThe Jade Maiden of *Ding-si* is named *Zhu Fucheng*, with the title *Gaoshang Zhenjun* (Supreme True Lord). This talisman is inscribed in red on yellow paper and placed at the *Ding-si* station, with an additional inscription affixed to the front of the memorial. The incantation reads:\n\n*\"Supreme True One, named Fucheng.\nBe directed by me, attend my words.\nSwiftly, swiftly, as decreed by statute and ordinance!\"*\n\nDraw the *qi* of the southern direction and blow it onto the talisman.\n\n*Ding-si* Union Talisman\nFollowing the same incantation, *qi*, and method as before, form into pellets and consume with wine from its respective station.\n\nFor all Jade Maiden talismans, when summoning for use, inscribe the invocation phrase by phrase. This may be done on the memorial or on its reverse, detailing the matter at hand. Seal with the *Zhenwu* seal on the front and the *Liuding* seal on the reverse. Invoke using the Jade Maiden spirit incantation, *qi*, and mudra as before—great spiritual efficacy will be attained.\n\nAnother method: Use a talisman two *cun* in size. Inscribe the talisman on one side and engrave the name on the reverse, writing in red on jujube wood. Recite the incantation three times and place it upon the altar.\n\nDays for the Descent of the *Liuding* Talismans and Names:\n*Ding-mao* Jade Maiden: *Song Juanwenbo* – descends on *zi-chou* days\n*Ding-chou* Jade Maiden: *Liang Qiyuangong* – descends on *yin-mao* days\n*Ding-hai* Jade Maiden: *Yao Maowendao* – descends on *si-wu* days\n*Ding-you* Jade Maiden: *Shen Qiaowenqing* – descends on *xu-hai* days\n*Ding-wei* Jade Maiden: *Zhu Diaoshengtong* – descends on *shen-you* days\n*Ding-si* Jade Maiden: *Chen Juntinqing* – descends on *chen-si* days",
      "overlap_context": " *Ding-you* is named *Jiuqin Ling*, with the title *Yafu Zhenjun* (True Lord Subordinate). This talisman is inscribed in red on yellow paper and placed at the *Ding-you* station, with an additional inscription affixed to the front of the memorial. Draw the *qi* of the western direction and blow it onto the talisman. The incantation reads:\n\n*\"O Spirit of Salvation and Reverence, Great True One Subordinate.\nBe directed by me, aid my actions.\nSwiftly, swiftly, as decreed by statute and ordinance!\"*",
      "start_char": 10640,
      "end_char": 11137,
      "start_sentence": 609,
      "end_sentence": 644,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.92650818824768,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\秘藏通玄变化六阴洞微遁甲真经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "真武印　阔二寸四分，长三寸二分。 阳印形 阴印形 凡此二印，取庚申、乙巳、甲寅、己亥日，取枣木刊阴阳二印，左右臂带之。 阳印当悬左臂上，阴印当悬右臂上。 日中使印，即以阳印，乃至感君侯之梦。 祈雨祈晴祈雪，一切象天法阳之事，即用此印。 乃是丁卯、丁丑、丁亥三玉女之印也，故属阳也。 此玉女指挥事意，即随此转也，皆系阳印用事也。 凡阴印即悬带右臂上，夜中使印，即取用之。 乃至求财，役鬼怯妖，夜间求祷，地下动作，入水入幽，一切象地法阴之事，即以此阴印印之。 乃是丁巳、丁未、丁酉三位之印，故属阴也。 此三玉女，随印所使而转也，并系阴印用事也。 祭印法 凡刊就二印，讫时却於甲子大会，即於北辰之下设席，祝云：奉请□□□□□□□真君下降，臣今依太上之法，刊造阴阳六阴洞微之印，指使玉女，惟愿威灵。 先为臣悟真证盟，次上香。 左右执印，目观北斗，闭炁取北斗真炁。 次第至□，取炁一口，吹在印上。 如此每印各三次，取炁吹之。 用五色线系印把，带在左右手臂上。 如祭时，及用事时，并出入一切动作时，方带之。 如非时在家，不可带，宜安於坛上供养。 闲暇不祭时，不用事，只一日早晨，取净水一盏供养为佳，不得寻常用祭。 如大会之日，切不可行房事，污杂荤腥近身。 须要时时鼓咽津液，灌洗五脏。 此经如神仙之深隐，万术之首规，天地同根，古今并固。 后世如有遇者，亦乃仙籍有名，夙生庆幸，实非易事。 纵若不行，而家贮之、敬之，一切祸事不敢入门。 切在至诚，莫类他卷。 宜安清诤之器贮之，无令秽染闲词。 非时不得轻玩，亦不得妄起邪心。 本欲利济存亡，切恐翻成殃谴。 学者切要正直，宜深思谨慎为尚。 至祝至祝，法门变通动作，列于下卷。 行持符法六丁玉女之印 印之式范，阔二寸四分，长三寸二分。 择木长生日，采枣相木刊之，於甲子庚申之日，以印诸符文。 祭法但依前法祭之，非时不得乱用。 急难所以悬挂，当以衣遮盖，能脱其祸矣。 用绛红罗锦作袋子盛之、不可令杂人见之，恐不灵矣。 夫行持之法，须先设祭，然后变通。 设祭在先，变通在后。 凡动作感梦，求物捕猎，主兵马，遣鬼神，祈旱汾，登山入水，摄盗破魔，求官觅仙，求奴觅婢，迎藏君子，退逐小人，万种所为，各有符法。 至诚郑重，勿易轻心，俯地仰天，当於正用。 非特安邦助国，亦能护道养身。 稍若行邪，罪干九族。 诚在专督顶戴二三玉女者。 凡於庚申、乙巳、甲寅、己亥，取枣木心四方，面各刻二三玉女名号符焉。 用五色丝囊袋之安顶心，非梳头时不可解。 凡书符式 凡书一切符命，俱用朱书，无朱京墨亦可。 逐时须向旬中三位上，设拜行事，余神助之。 一切须向符边，写旬中三卜神名号，即玉女也。 用真武印朱印之，合是阴阳印，虚印再印之。 阳事用左臂阳印，阴事用右臂阴印。 寻常吞服符，但是用符，一一如此为之。 切宜专谨，不可侯为也。 动作变通神应符，备列于后。 感梦符六道 第一道感帝王之梦符法 此符感通至尊之梦，但六度祭毕，玉女自然现身。 不须烧符，玉女自执去。 行此符时，遣当旬玉女，余神助之。 早起朱书此符，却於侧边书当旬玉女真君名字。",
      "translated_text": "The True Warrior Seal measures two *cun* and four *fen* in width and three *cun* and two *fen* in length. There are two forms: the Yang Seal and the Yin Seal. For these two seals, select *geng-shen*, *yi-si*, *jia-yin*, or *ji-hai* days to carve the Yin and Yang seals from jujube wood, then wear them on the arms—hang the Yang Seal on the left arm and the Yin Seal on the right. When using the seal at midday, employ the Yang Seal to invoke dreams from lords and nobles. For all matters imitating Heaven and governed by Yang—such as praying for rain, sunshine, or snow—use this seal. It is the seal of the three Jade Maidens: *Ding-mao*, *Ding-chou*, and *Ding-hai*, and thus belongs to Yang. The intentions of these Jade Maidens shift in accordance with this seal, and all matters are governed by the Yang Seal. For the Yin Seal, hang it on the right arm and use it at night. For all matters imitating Earth and governed by Yin—such as seeking wealth, commanding ghosts, dispelling demons, nocturnal prayers, subterranean actions, entering water, or venturing into darkness—imprint with this Yin Seal. It is the seal of the three Jade Maidens: *Ding-si*, *Ding-wei*, and *Ding-you*, and thus belongs to Yin. These three Jade Maidens act in accordance with the seal’s use, and all matters are governed by the Yin Seal.\n\n**Ritual for Consecrating the Seals**\nAfter carving the two seals, perform the grand assembly on a *jia-zi* day. Set up a mat beneath the Northern Asterism and invoke: *\"I respectfully invite □□□□□□□ True Lord to descend. Your servant, following the methods of the Most High, has carved the Yin and Yang Six Yin Cavern-Subtle Seals to command the Jade Maidens. May your mighty power be manifest.\"* First, awaken the seal’s true efficacy and confirm the covenant, then offer incense. Hold the seals in both hands, gaze at the Northern Dipper, and draw in the true *qi* of the Northern Dipper. Progressing in order to □, inhale *qi* once and blow it onto the seal. Repeat this three times for each seal. Fasten the seals with five-colored threads and wear them on the left and right arms. Wear them during consecration, use, and all movements when entering or exiting. When not in use at home, do not wear them; instead, place them on the altar for veneration. During leisure or when not in use, offer a cup of pure water in the morning as veneration—do not perform ordinary rituals. On the day of the grand assembly, strictly avoid sexual activity, impurity, or the proximity of meat and fish. Frequently swallow saliva to cleanse the five viscera. This scripture is as profound as the hidden arts of immortals, the foremost rule of all techniques, rooted in Heaven and Earth, enduring through ancient and modern times. If later generations encounter it, they are destined for immortality, blessed by past lives—this is no trivial matter. Even if unused, storing and revering it at home ensures no misfortune dares enter. Sincerity is paramount; do not treat it like other texts. Store it in a vessel of purity and tranquility, free from defilement or idle words. Do not casually handle it at inappropriate times, nor harbor impure intentions. Though intended to aid the living and the dead, misuse may bring calamity and retribution. Practitioners must uphold integrity and exercise deep caution. Utmost reverence! The adaptable methods of this Dharma gate are detailed in the following scroll.\n\n**Methods for Using the Six Ding Jade Maidens’ Seals**\nThe seals’ specifications: two *cun* and four *fen* in width, three *cun* and two *fen* in length. Choose a day corresponding to the wood’s birth, harvest jujube wood, and carve the seals on a *jia-zi* or *geng-shen* day, imprinting them with talismanic scripts. Consecrate them according to the previous method; do not use them indiscriminately. In times of urgent peril, hang them and cover them with clothing to avert disaster. Store them in a pouch of crimson silk; do not let others see them, lest their efficacy wane.\n\n**Methods of Practice**\nFirst perform the consecration, then proceed with adaptable techniques. Consecration precedes adaptation. For all actions—invoking dreams, seeking objects, hunting, commanding troops, dispatching spirits, praying for drought or flood, ascending mountains, entering water, capturing thieves, subduing demons, seeking office, pursuing immortality, acquiring servants, welcoming or concealing gentlemen, expelling petty men, or myriad other purposes—each has its own talismanic method. Be utterly sincere and solemn; do not treat this lightly. Whether facing earth or heaven, employ them correctly. Not only do they secure the state and aid the nation, but they also protect the Dao and nurture the body. Any deviation into wickedness will bring guilt upon nine generations. Sincerity lies in venerating the two or three Jade Maidens on the crown of the head. On *geng-shen*, *yi-si*, *jia-yin*, or *ji-hai* days, take the heartwood of jujube, carve the names and talismans of the two or three Jade Maidens on each of its four sides, and place it in a pouch of five-colored silk to wear on the crown of the head. Do not remove it except when combing hair.\n\n**Talismanic Scripts**\nFor all talismanic commands, use cinnabar; if unavailable, ink may suffice. For each action, face the three positions of the current ten-day period, bow, and proceed—other spirits will assist. Write the names of the three divinatory spirits of the ten-day period (the Jade Maidens) beside the talisman. Imprint it with the True Warrior Seal using cinnabar, applying both Yin and Yang seals in sequence. For Yang matters, use the Yang Seal on the left arm; for Yin matters, use the Yin Seal on the right. For ordinary talisman ingestion or use, follow this method precisely. Be meticulous and do not treat it casually.\n\n**Responsive Talismans for Invoking Dreams (Six Methods)**\n**First Method: Talisman for Invoking the Emperor’s Dream**\nThis talisman invokes dreams from the supreme ruler. After performing the sixfold consecration, the Jade Maidens will naturally appear. Do not burn the talisman; the Jade Maidens will take it themselves. When using this talisman, dispatch the Jade Maiden of the current ten-day period, with other spirits assisting. Write this talisman in cinnabar at dawn, then inscribe the name of the Jade Maiden True Lord of the current ten-day period beside it.",
      "overlap_context": "upon the altar.\n\nDays for the Descent of the *Liuding* Talismans and Names:\n*Ding-mao* Jade Maiden: *Song Juanwenbo* – descends on *zi-chou* days\n*Ding-chou* Jade Maiden: *Liang Qiyuangong* – descends on *yin-mao* days\n*Ding-hai* Jade Maiden: *Yao Maowendao* – descends on *si-wu* days\n*Ding-you* Jade Maiden: *Shen Qiaowenqing* – descends on *xu-hai* days\n*Ding-wei* Jade Maiden: *Zhu Diaoshengtong* – descends on *shen-you* days\n*Ding-si* Jade Maiden: *Chen Juntinqing* – descends on *chen-si* days",
      "start_char": 11137,
      "end_char": 12388,
      "start_sentence": 645,
      "end_sentence": 708,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.779675483703613,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\秘藏通玄变化六阴洞微遁甲真经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "上用真武印印之，次以阳印虚印一下，次书开禁户符。 第二开禁户符 此是开禁户符，亦依前法，书及神名用真武印，及阴阳印挞之。 右二符，一处手执於当旬三卜玉女前，祝曰：吾今欲求某事，随意言之。 遣神持此二符，直达帝前，开皇庭禁户，梦中奏帝云：某州某县某人名字年，已行持大教，为帝安国。 帝当善护，毋令见害。 或求官，或别用事，随意告之。 如此咨闻了，用清酒、金钱一分，连符香茶灯菜，供养在当旬玉女真君之前，至夜二更，即念当旬三卜神咒三遍。 见在前神名下取纸、一时烧化、口中言：急去急应，不可迟滞。 便吹灭灯收茶，更自坐，至三更尽方睡。 不经旬日，必有报应。 帝君必受神人所资之事，决无违也。 乃至求官，所为一同。",
      "translated_text": "First, affix the True Martial Seal, then lightly impress with the Yang Seal once, and next inscribe the Talisman for Opening the Forbidden Gate.\n\n**Second: Talisman for Opening the Forbidden Gate**\nThis is the Talisman for Opening the Forbidden Gate. Inscribe it following the previous method, including the spirit’s name, and impress it with the True Martial Seal and the Yin-Yang Seals.\n\nHold these two talismans together before the Jade Maiden of the Three Divinations of the current ten-day period and pray: \"I now seek such-and-such a matter—state your intent as you wish. Dispatch the spirits to bear these two talismans directly before the Emperor, to open the forbidden gates of the imperial court. In the dream, present this to the Emperor: ‘So-and-so of such-and-such prefecture and county, of such-and-such name and age, has practiced the Great Teaching to bring peace to the realm for the Emperor. May the Emperor protect him well and not allow harm to befall him.’ Whether seeking office or other matters, state your request as you wish.\"\n\nAfter thus making your petition, offer a portion of clear wine and gold coins, along with the talismans, incense, tea, lamps, and vegetables, before the True Lord Jade Maiden of the current ten-day period. At the second watch of the night, recite the incantation of the Three Divinations of the current ten-day period three times. Take the paper from beneath the name of the spirit present, burn it all at once, and say: \"Go swiftly, respond swiftly—do not delay.\" Then blow out the lamp, clear the tea, and sit again until the end of the third watch before sleeping. Within ten days, there will surely be a response. The August Lord will certainly accept the matters entrusted by the spirits; there will be no failure. This applies equally to seeking office or any other purpose.",
      "overlap_context": "ethod: Talisman for Invoking the Emperor’s Dream**\nThis talisman invokes dreams from the supreme ruler. After performing the sixfold consecration, the Jade Maidens will naturally appear. Do not burn the talisman; the Jade Maidens will take it themselves. When using this talisman, dispatch the Jade Maiden of the current ten-day period, with other spirits assisting. Write this talisman in cinnabar at dawn, then inscribe the name of the Jade Maiden True Lord of the current ten-day period beside it.",
      "start_char": 12388,
      "end_char": 12685,
      "start_sentence": 709,
      "end_sentence": 721,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.414649248123169,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\秘藏通玄变化六阴洞微遁甲真经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "凡欲感五音人梦符法，并伺前诀，造之发遣，只不用开禁户符。 盖须用也，凡是官员僧道，各依五音用之。 感五音人梦神符五道 宫音 商音 角音 征音 羽音 此符感五音姓人梦，并用前法书之。 发遣不可用禁户符，并庶人不见。 须用也，不问官员士庶僧尼道流，各依音姓书用之，无不感应。 祈求旱潜符法 凡欲祈雨、祈晴、祈雪，春夏秋冬各有神之所主。 春，太和真君，太玄真君，太泯真君。 夏，少一真君，少微真君，少明真君。 秋，太无真君，太全真君，太宫真君。 冬，少固真君，少□真君，少灵真君。 春祭於乾亥之方，即旺气之方。 夏祭於艮寅之地。 秋祭於巽巳之方。 冬祭於坤申之地。 凡祭祈求方，盖长生之地也。 三真祈求召符三道 右符三道，依时换神君之名书之於侧。 於当旬玉女前，祝云：吾见人问，缺少雨水，民庶失业。 吾今遣神，持达某三位真君，来日当至吾坛某方之地，受五？ 咨祷。 如春夏秋冬，则改青钱一分，奉送云程。 急速急速，烧纸并符於乾亥之地，此春祭太和太玄太泯三真君地也。 如夏秋冬，各请真君，各随其地，设江位，用香灯酒果供养了。 上香再拜，叩齿至诚祝曰：臣闻苍天杳冥，浩荡玄真，臣虽愚昧，性合上清。 今民失业，求雨。 渴望膏霖，求晴。 颛望晴晖。 臣行是法，祈祷恣祷玄真。 受臣微祭，愿鉴臣心，执臣之符，为臣奏闻。 皇天垂鉴，愿赐甘霖，晴晖。 臣所奏恳，用秘符文。 伏惟真慈，俯垂聪听。 青钱三分，用送云程。 伫望感通，即时来应，烧纸连符收座。 祷雨符 祈晴符 此符并用五重封角下印，依前作用，此系奏主皇上帝符也，不可轻易。 求雪符 同前析祷法。 呼风符 若欲呼风云，春夏秋冬，各有所主。 春东夏南，秋西冬北，告玉女烧符。 大呼大至，小呼小至。 通仙符 凡歌作此法，欲到某处，朱书一道告玉女，付道手中执之。 闭目藏睛，即刻到也。 延毒符 此符能令人延寿长，众人爱敬。 如意符 凡有所爱，用真武印印之，安在在处。 告玉女，其物自至，如其意。 枕中符 此符朱书安枕中，邪魔自消。 进君子，远小人，神仙欲至，预有梦兆。 令人皈向符 若令人向者，朱书三道。 一道告玉女，一道系臂，一道含口中，求告皈顺。 令人爱敬符 朱书告玉女，并书其人姓名、年甲所属星辰於其符下、其人自爱念。 觅酒符 觅食符 凡欲觅酒觅食，於当旬玉女前，书三道烧於神前，酒食人送至。 觅奴符黄纸朱书 欲求奴及婢，预书，於当旬玉女焚之。 奴婢自来，感应非常。 觅婢符 召相知符 此符欲召相知人，先书符，次书某人姓名於一符上。 祝当旬玉女云：吾欲一见其人来。 旺利符 朱书告玉女，带之几百旺利万倍。 若人欲置财宝，朱书桃板悬门下，则商贾自来财利旺矣。 入水符 欲作此符，先告玉女了。 朱书二道，用印印之，贴在左右脚心，行水上如平。 入海符 此符先告玉女，投於海中，当有龙神拥护，波浪自息，要船住即住，要行即行即应矣。 行兵甲符三道 此三道符，用行兵法，至诚朱书。 先遣玉女持此三符，达知彼禁吏。 又篆三道埋於征战之地，更领吏兵出军，自带三道尤好。 隐遁潜形入军围中符 凡欲入军行事，书此符六道，告玉女毕。 吞三道，顶一道，左右手各持一道，禹步入阵，走入军中，诸军皆不见。",
      "translated_text": "For the method of summoning dreams through the Five Tones, follow the previous instructions for preparation and dispatch, except that the talisman for opening the forbidden door is not used. This is essential. Officials, monks, and Daoists should each apply the method according to their corresponding tone.\n\n**Five Talismans for Summoning Dreams Through the Five Tones**\n- **Gong Tone**\n- **Shang Tone**\n- **Jue Tone**\n- **Zhi Tone**\n- **Yu Tone**\n\nThese talismans summon dreams from individuals whose surnames correspond to the Five Tones. Write them using the previous method. Do not use the talisman for opening the forbidden door, and do not let commoners see it. It is essential and may be used by officials, scholars, commoners, monks, nuns, and Daoists alike—each according to their tone and surname—with unfailing efficacy.\n\n---\n\n**Method for Praying for Rain or Clear Skies**\nTo pray for rain, clear skies, or snow, each season has its presiding deities:\n- **Spring:** True Lord Taihe, True Lord Taixuan, True Lord Taimin\n- **Summer:** True Lord Shaoyi, True Lord Shaowei, True Lord Shaoming\n- **Autumn:** True Lord Taiwu, True Lord Taiquan, True Lord Taigong\n- **Winter:** True Lord Shaogu, True Lord Shao□, True Lord Shaoling\n\nIn spring, make offerings in the Qian-Hai direction (the direction of flourishing qi).\nIn summer, make offerings in the Gen-Yin location.\nIn autumn, make offerings in the Xun-Si direction.\nIn winter, make offerings in the Kun-Shen location.\nThese are the directions of longevity for each season.\n\n**Three Talismans for Summoning the Seasonal True Lords**\nWrite these three talismans, replacing the names of the True Lords according to the season. Before the Jade Maiden of the current ten-day period, pray: *\"I see that the people suffer from a lack of rain, and the common folk are without livelihood. I now dispatch spirits to deliver this to the three True Lords. Tomorrow, they shall arrive at the altar in the designated direction to receive my petition.\"*\n\nFor spring, summer, autumn, and winter, change the offering to one portion of green coins to send them on their journey. Swiftly, swiftly—burn the paper and talisman in the Qian-Hai direction (the location for spring offerings to the True Lords Taihe, Taixuan, and Taimin). For summer, autumn, and winter, summon the respective True Lords in their designated directions. Set up the altar, and offer incense, lamps, wine, and fruit.\n\nLight the incense, bow twice, and knock your teeth while sincerely praying: *\"I have heard that the azure heavens are vast and the mysterious true ones boundless. Though I am foolish, my nature aligns with the Upper Clarity. Now the people suffer without livelihood, and I seek rain. I long for nourishing rains, or clear skies. I humbly perform this ritual, beseeching the mysterious true ones. Accept my modest offering, and may you see my heart. Take this talisman of mine and present it on my behalf. May the August Heaven look upon me with favor and grant sweet rains or clear skies. I present this earnest plea with secret talismanic script. I implore your true compassion to incline your ears and listen. Three portions of green coins are offered to send you on your journey. I await your response, which shall come without delay.\"*\n\nBurn the paper along with the talisman and close the ritual.\n\n**Talisman for Praying for Rain**\n**Talisman for Praying for Clear Skies**\nThese talismans must be folded five times at the corners and sealed with an imprint. Use them as described above; they are talismans for petitioning the August Lord of Heaven and must not be used lightly.\n\n**Talisman for Seeking Snow**\nFollow the same method of prayer as above.\n\n**Talisman for Summoning Wind**\nIf you wish to summon wind or clouds, each season has its direction:\n- Spring: East\n- Summer: South\n- Autumn: West\n- Winter: North\n\nNotify the Jade Maiden and burn the talisman. A great call brings a great wind; a small call brings a small wind.\n\n---\n\n**Talisman for Communicating with Immortals**\nWhen performing this method to reach a certain place, write one talisman in cinnabar, notify the Jade Maiden, and place it in the hand of the Daoist. Close your eyes and conceal your gaze—you will arrive instantly.\n\n**Talisman for Extending Life**\nThis talisman grants long life and causes others to hold you in affection and respect.\n\n**Talisman for Fulfilling Wishes**\nFor whatever you desire, imprint it with the seal of Zhenwu and place it in the appropriate location. Notify the Jade Maiden, and the object will come to you as you wish.\n\n**Talisman for the Pillow**\nWrite this talisman in cinnabar and place it inside your pillow. Evil spirits will dissipate, petty people will stay away, and noble ones will draw near. If immortals wish to visit, you will receive dream omens in advance.\n\n**Talisman for Making Someone Turn Toward You**\nTo make someone turn toward you, write three talismans in cinnabar. Notify the Jade Maiden with one, tie one to your arm, and hold one in your mouth. The person will then turn toward you in devotion.\n\n**Talisman for Making Someone Hold You in Affection**\nWrite in cinnabar, notify the Jade Maiden, and inscribe the person’s name, age, and corresponding star beneath the talisman. The person will naturally hold you in affection.\n\n**Talisman for Obtaining Wine**\n**Talisman for Obtaining Food**\nTo obtain wine or food, write three talismans before the Jade Maiden of the current ten-day period and burn them before the deity. Wine and food will be sent to you.\n\n**Talisman for Obtaining Servants (written in cinnabar on yellow paper)**\nTo seek male or female servants, write the talisman in advance and burn it before the Jade Maiden of the current ten-day period. Servants will come of their own accord, with extraordinary efficacy.\n\n**Talisman for Obtaining Female Servants**\n**Talisman for Summoning Acquaintances**\nTo summon an acquaintance, first write the talisman, then write the person’s name on it. Pray to the Jade Maiden of the current ten-day period: *\"I wish to see this person come.\"* The person will arrive.\n\n**Talisman for Prosperity and Profit**\nWrite in cinnabar, notify the Jade Maiden, and carry it with you—your prosperity and profit will increase a hundredfold. If someone wishes to accumulate wealth, write in cinnabar on a peachwood board and hang it beneath the door. Merchants will come of their own accord, and wealth and profit will flourish.\n\n**Talisman for Entering Water**\nBefore using this talisman, notify the Jade Maiden. Write two talismans in cinnabar, imprint them with the seal, and affix them to the soles of your left and right feet. You will walk upon water as if on level ground.\n\n**Talisman for Entering the Sea**\nNotify the Jade Maiden first, then cast this talisman into the sea. Dragon spirits will protect you, and the waves will calm. If you wish the ship to stop, it will stop; if you wish it to sail, it will sail—all will respond immediately.\n\n**Three Talismans for Military Campaigns**\nThese three talismans are used in military operations. Write them sincerely in cinnabar. First, dispatch the Jade Maiden to deliver these three talismans to the guardian spirits of the enemy. Then, inscribe three more talismans and bury them in the battlefield. It is even better to have the commanding officer carry all three talismans.\n\n**Talisman for Concealment and Invisibility Within Enemy Encampments**\nIf you wish to enter an enemy camp to carry out a mission, write this talisman six times and notify the Jade Maiden. Swallow three, place one on your head, and hold one in each hand. Perform the Yu Step and enter the encampment—you will walk through the enemy ranks unseen.",
      "overlap_context": "nations of the current ten-day period three times. Take the paper from beneath the name of the spirit present, burn it all at once, and say: \"Go swiftly, respond swiftly—do not delay.\" Then blow out the lamp, clear the tea, and sit again until the end of the third watch before sleeping. Within ten days, there will surely be a response. The August Lord will certainly accept the matters entrusted by the spirits; there will be no failure. This applies equally to seeking office or any other purpose.",
      "start_char": 12685,
      "end_char": 14069,
      "start_sentence": 722,
      "end_sentence": 812,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.35292077064514,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\秘藏通玄变化六阴洞微遁甲真经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "役使鬼神符三道 第一道 凡欲役使鬼兵，先篆此符於当旬玉女前，祝云：吾今为某处有某事，意欲下手，修持随意。 所请神当为吾传符，速至五道将军。 速於某日拨发几许戈戟枪棒弓弩，一一齐整，来吾左右，指挥用事，临时须当了毕。 如不依吾之令，吾即斩鬼杀神，莫言不告。 急速急速烧符了，便去。 第二道 此符依前，至诚朱书，禹步至门前，向五道将军云：汝等领二三玉女并鬼部史兵，即时齐往某处，修造某侈事、须当获时了毕，不许迁延。 如或因循，－斩汝之首。 用工之后，各有钱酒，谢汝勤劳。",
      "translated_text": "**Three Talismans for Commanding Ghosts and Spirits**\n\n**First Talisman**\nWhenever you wish to command ghostly soldiers, first inscribe this talisman before the Jade Maiden of the current旬 and recite the following invocation: *\"For such-and-such matter in such-and-such place, I now intend to take action—let the ritual proceed as I will. May the gods I summon transmit this talisman swiftly to the Generals of the Five Roads. By such-and-such day, dispatch a set number of halberds, spears, staves, bows, and crossbows, all fully prepared, to my side. Follow my commands without delay, and the task shall be swiftly completed. Should you disobey my orders, I shall slay ghosts and execute spirits—let none say they were not warned.\"* Burn the talisman at once and depart.\n\n**Second Talisman**\nInscribe this talisman with the same sincerity in cinnabar as before. Perform the Yu Step to the gate and address the Generals of the Five Roads: *\"You and two or three Jade Maidens, along with the ghostly officers and soldiers, shall immediately proceed to such-and-such place to complete such-and-such task. It must be accomplished without delay—no procrastination shall be tolerated. Should you falter, I shall strike off your heads.\"* After the labor is done, each shall receive money and wine in gratitude for their toil.",
      "overlap_context": "e enemy. Then, inscribe three more talismans and bury them in the battlefield. It is even better to have the commanding officer carry all three talismans.\n\n**Talisman for Concealment and Invisibility Within Enemy Encampments**\nIf you wish to enter an enemy camp to carry out a mission, write this talisman six times and notify the Jade Maiden. Swallow three, place one on your head, and hold one in each hand. Perform the Yu Step and enter the encampment—you will walk through the enemy ranks unseen.",
      "start_char": 14070,
      "end_char": 14307,
      "start_sentence": 813,
      "end_sentence": 823,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.2543206214904785,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\秘藏通玄变化六阴洞微遁甲真经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "急急如律令。 烧符又行。 第三道 若欲作此法，当至告玉女，篆符令人持往作事处。 或前后钉，亦可用印。 事毕，烧钱谢之。 神应莫测，妙之妙矣。 摄神符 凡作此法，用真武印，印告玉女，烧一道新当界土地，问此间有甚怪焉？ 追魂符 此法用厌恶人，及官司等事。 凡作法，先书彼人姓名年月日时，并事意於符下。 用鸡卵一个，乱头发一缚符，打碎鸡卯拌符，入合子中作法，埋於鬼门上，不解不止，其人昏晦如醉。 秘秘秘秘秘，不可妄用。 收寇符 凡欲捉贼，先告玉女，烧香书符五道，埋於五路，其贼即获。 伏虎符亦曰斩虎符 若居山中，朱书此符告玉女，贴於山上，其虎自来，在符下受降。 或投虎所，自至受诛。 降龙符亦曰斩龙符 凡作此法，於发洪处投之，死，出水面上。 狩猎符 狩猎依前，书符告神方，去更书带之，自然得获。 集怪符 呼蛇引怪，集乌归鱼，并用此符二道，告玉女烧一道，手中执一道。 口中含一道，轻轻唤，何物即至。 欲遣之，即烧手中符于门外。 行路借鬼兵符 若行路往来，欲借鬼兵心几所到处，书符一道，要鬼吏多少扶持，到某处交易，即时发回。 填破缺符 凡有破缺汉涧，告玉女。 朱书二道，一道告玉女，一道埋当处，自然填满复元，取符烧之。 生产符 救生产符书四道，一道与玉女，烧三道付请符人，去净水调与产妇吞下。 男左女右执符出，死胎顶符出，横生者骨软而生。 治枉死鬼符 若有枉死、投河、自缢、投井卒死者，急书此符於左右，书当旬玉女名，告当旬玉女曰：今有某人某事卒亡，吾以此符救之。 神与急去，用心救治，符到奉行，追摄魂魄，付患人身，即时取活。 速以此符安入口中，顶上用艾炙之，三炷即活。 收鬼符 朱书召玉女，或埋或钉、或贴，鬼自灭亡矣。 治万病符三道 凡欲遣此符治病，右三道治一切患。 上香告当二旬玉女曰：吾今治某人痲，神请用力，随符救治，符到奉行，遣鬼退邪，速为安复。 仍写玉女名於符上，降真香吞即瘥。 治瘟司神符 此符朱书之黄纸上，先一日书一道，依法作用於当旬玉女前：为吾持符，至某处某人家。 司命禁忌官属等神，吾来日至此治瘟杀鬼，疾速摄神庙当处等神，伺侯施行，速去速去。 焚之。 治瘟疫鬼符 此符用纸一片，阔五寸，长七寸，令病人花押，就上书符，盖了病人花押，此符使六神司命。 又治瘟符 令人写花字，书符背上，治瘟鬼。 治瘟疫病者服符 此符以降香汤下，先书白玉女治瘟疫，收摄病源，保佑安泰。 治病不拘远近取验符 此符治病人，黄纸朱书一道，甩真武印印之。 先告当旬玉女，焚看，病者是何病疾，无不痊瘥。 若病人在三五里之外，想病人处，告玉女，书符用印烧吹，符向方而去。 或千里之外、祝其病之所在，无不验矣。 治病法 谨请甲子旬丁卯神、甲戌旬丁丑神、甲申旬丁亥神、甲午旬丁酉神、甲辰旬丁未神、甲寅旬丁巳神，前去疗病，某人身中某疾病，请为解灾释难，驱除祸祟，急还病人魂魄，立即取效，符到奉行，不得迟缓。 急急如上清律令。 指挥即了，便往救治，立即除愈。",
      "translated_text": "**Urgent, urgent—by the statutes and commands!** Burn the talisman and proceed.\n\n**Third Talisman**\nShould you wish to perform this method, first announce it to the Jade Maidens and have someone inscribe the talisman to carry to the work site. Alternatively, drive it in before or after, or use a seal. Once the task is complete, burn paper money in gratitude. The divine response is unfathomable—wondrous beyond wonder.\n\n**Talisman for Summoning Spirits**\nFor this method, use the True Warrior’s seal to imprint and address the Jade Maidens. Burn one talisman to the local earth deity of the new boundary and inquire: *\"What strange occurrences are here?\"*\n\n**Talisman for Pursuing Souls**\nThis method is used to suppress enemies or for official matters. First, write the target’s name, birth year, month, day, and hour, along with the intent, beneath the talisman. Take one chicken egg, a tangle of hair, and the talisman, then crush the egg and mix it with the talisman in a container. Perform the ritual and bury it at the Ghost Gate—unceasing until the target grows dazed and stuporous as if drunk.\n*Secret, secret, secret, secret, secret—do not misuse.*\n\n**Talisman for Capturing Bandits**\nTo apprehend thieves, first notify the Jade Maidens. Burn incense, inscribe five talismans, and bury one at each of the Five Roads—the bandits will be seized.\n\n**Taming Tiger Talisman (also called Slaying Tiger Talisman)**\nIf dwelling in the mountains, inscribe this talisman in cinnabar, address the Jade Maidens, and affix it to the mountain—the tiger will come of its own accord and submit beneath the talisman. Alternatively, cast it where the tiger dwells, and it will arrive to receive its execution.\n\n**Subduing Dragon Talisman (also called Slaying Dragon Talisman)**\nFor this method, cast it into the source of a flood, and the dragon will die, rising to the water’s surface.\n\n**Hunting Talisman**\nFor hunting, as before, inscribe the talisman and address the local deities. Carry it with you after inscribing it—success will come naturally.\n\n**Talisman for Gathering Strange Beings**\nTo summon snakes, lure spirits, gather crows, or draw fish, use two talismans of this kind. Address the Jade Maidens and burn one, while holding the other in hand. Place one in your mouth, call softly, and whatever you desire will arrive. To dismiss them, burn the talisman in hand outside the gate.\n\n**Talisman for Borrowing Ghost Soldiers While Traveling**\nWhen journeying and wishing to borrow ghost soldiers for protection along the way, inscribe one talisman. Specify how many ghost officers you require for assistance, and upon reaching your destination, send them back immediately.\n\n**Talisman for Filling Breaches**\nFor broken or eroded ravines, address the Jade Maidens. Inscribe two talismans in cinnabar—one to notify the Jade Maidens, the other to bury at the site. The breach will naturally fill and restore itself; retrieve and burn the talisman afterward.\n\n**Talisman for Childbirth**\nTo aid delivery, inscribe four talismans. Present one to the Jade Maidens and burn three, giving them to the person requesting the talisman. Have them mix the ashes with clean water for the mother to swallow. If the child is male, have him hold the talisman in his left hand as he emerges; if female, in her right. For a stillborn, place the talisman on its crown to draw it out. For a transverse birth, the bones will soften, and delivery will follow.\n\n**Talisman for Wrongful Death**\nFor those who die unjustly—by drowning, hanging, well-jumping, or sudden demise—quickly inscribe this talisman on their left or right side. Write the name of the Jade Maiden of the current ten-day period and address her: *\"Here lies one who has perished suddenly from such-and-such cause. I use this talisman to save them.\"* Command the spirits to act swiftly, rescue and restore the soul to the afflicted’s body, and revive them at once. Place the talisman in their mouth and apply three moxa cauteries to the crown—they will revive immediately.\n\n**Talisman for Capturing Ghosts**\nInscribe in cinnabar to summon the Jade Maidens, then bury, drive in, or affix it—the ghost will perish.\n\n**Three Talismans for Curing All Illnesses**\nTo employ these talismans for healing, use the three on the right to treat all ailments. Burn incense and address the Jade Maidens of the current two ten-day periods: *\"I now treat so-and-so’s illness. Spirits, lend your power—follow the talisman to heal, expel ghosts, and banish evil. Upon its arrival, act without delay.\"* Write the Jade Maidens’ names on the talisman, burn it with true incense, and have the patient swallow it—they will recover.\n\n**Talisman for the Plague Deity**\nInscribe this talisman on yellow paper in cinnabar. The day before use, inscribe one and perform the method before the Jade Maiden of the current ten-day period: *\"Carry this talisman for me to such-and-such place, to the home of so-and-so. Deities of fate, prohibitions, and their retinues—I come tomorrow to cure plague and slay ghosts. Swiftly summon the local temple spirits to await my commands. Go swiftly, go swiftly!\"* Then burn it.\n\n**Talisman for Plague Demons**\nUse a sheet of paper five *cun* wide and seven *cun* long. Have the patient sign it, then inscribe the talisman over their mark. This talisman commands the Six Spirits and Deities of Fate.\n\n**Another Talisman for Plague**\nHave the person write a decorative character, then inscribe the talisman on their back to treat plague demons.\n\n**Talisman for Ingesting to Cure Plague**\nAdminister this talisman with a decoction of *jiangxiang*. First, write: *\"White Jade Maiden, cure the plague, seize the source of illness, and safeguard peace.\"* The patient will recover.\n\n**Talisman for Verifying Illness Regardless of Distance**\nTo treat a patient, inscribe one talisman in cinnabar on yellow paper and stamp it with the True Warrior’s seal. First, notify the Jade Maiden of the current ten-day period, then burn and observe—whatever ailment afflicts the patient will be cured. If the patient is three to five *li* away, visualize their location, address the Jade Maiden, inscribe the talisman, stamp it, burn it, and blow the ashes toward their direction. Even if they are a thousand *li* away, invoke their location—the results will be certain.\n\n**Method for Treating Illness**\nReverently invoke:\n- The *Dingmao* spirit of the *Jiazi* ten-day period,\n- The *Dingchou* spirit of the *Jiaxu* ten-day period,\n- The *Dinghai* spirit of the *Jiashen* ten-day period,\n- The *Dingyou* spirit of the *Jiawu* ten-day period,\n- The *Dingwei* spirit of the *Jiachen* ten-day period,\n- The *Dingsi* spirit of the *Jiayin* ten-day period.\n\n*\"Proceed to heal the illness of so-and-so, who suffers from such-and-such ailment. I beseech you to resolve their misfortune, dispel calamity, and swiftly restore their soul. The moment the talisman arrives, act without delay!\"*\n**Urgent, urgent—by the statutes and commands of the Highest Clarity!**\nOnce the command is given, proceed at once to heal—the cure will be immediate.",
      "overlap_context": "h the same sincerity in cinnabar as before. Perform the Yu Step to the gate and address the Generals of the Five Roads: *\"You and two or three Jade Maidens, along with the ghostly officers and soldiers, shall immediately proceed to such-and-such place to complete such-and-such task. It must be accomplished without delay—no procrastination shall be tolerated. Should you falter, I shall strike off your heads.\"* After the labor is done, each shall receive money and wine in gratitude for their toil.",
      "start_char": 14307,
      "end_char": 15574,
      "start_sentence": 824,
      "end_sentence": 887,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.579336404800415,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\秘藏通玄变化六阴洞微遁甲真经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "治病六符 符上玉女真形平身，若治病，不用印头。 勑符咒 九天勑下日月星符，左勑青龙，右勑白虎，前勑朱雀，后劫玄武，四十万人，辟除不祥。 符到之处，永亨利贞万邪入地，恶鬼藏形。 急急如律令。 治病掷座法 如有薄福之人使神不应者，迟缓亦同。 即当书旬中符，咒之掷於神座，其神自速至。 假如甲子旬书卯符； 他仿此。 咒曰：谨请甲子旬子卯神，前去某处干事救人，其事宜速，不得有违。 咒符讫，掷着丁卯神座前即住。 乃至千里之间，立有报应。 问诸吉凶之事，乃与人说。 欲缚鬼神，但捻手中鬼目，其鬼即死。 若恶人要来，书恶人姓名吞之，捻人目，即自来也。 召六丁掷座符 凡书符，下笔存思玉女毕。 如断铜截铁，先点二十八点，象二十八宿。 念星点之四点，象四时，八遍。 念咒象一年八节。 凡点下不得再点。 如得此符，似三五将军、六丁神将、力士天丁，千金不受，永为身宝。 秘之秘之，其灵万法之最也。 荐拔亡人冥府符 此符是荐九幽七祖入幽冥地府之符，亦荐众亡人。 先篆三道，玉女之前告之曰：吾有九玄七祖灭亡，未知所在。 或曰：吾有亡者某人，灭亡以来，未知所往所在。 神持此符，直至地狱幽岳，召官吏问之。 吾亡过某人，即时赦放。 急速急速。 言讫焚之，其亡者见现矣。 右件诸符，一一朱书，无朱京墨亦可，以印印之。 凡有作事，书符一道，左右书当旬玉女名，至诚启告所恳事宜。 自大会祭后，不须一一结坛，只是香茶酒果，焚香告白，志心祷祝，玉女自然现本相也。 符亦不须烧，自然去也。 灵异无穷，法子得之，以为至宝。 敬之则九族受庆，福禄荣昌，亦可登仙证道。 慢之则六亲致殃，祸患来至，亦以沉幽作鬼。 可不慎欤，念兹在兹，勿生杂念。 若梦中往返身形，或妇女身边坐外，即是玉女降现，自此其法渐渐如意。 如六神日久出入，现影现形，或耳报，或在眼前，则法子夙缘至矣。 不必演遁，但随心启告，便行便报。 得此者，实乃宿生有仙之名分矣，以致今日得此道矣。 此上至玉皇宫阙，下至地府冥司，一切所为，无不感通。 万金不传。 古人云：宁与人千金，不可与人六甲之阴也。 秘藏通玄变化六阴洞微遁甲真经卷下竟",
      "translated_text": "**Six Talismans for Healing**\nOn each talisman, depict the true form of the Jade Maiden standing upright. When treating illness, do not use the seal at the head.\n\n**Talisman Incantation**\nBy the decree of the Nine Heavens, the talisman of the sun, moon, and stars descends. To the left, command the Azure Dragon; to the right, command the White Tiger; ahead, command the Vermilion Bird; behind, command the Dark Warrior. Four hundred thousand spirits—ward off all inauspicious omens. Wherever the talisman arrives, perpetual harmony and uprightness prevail, and all malevolent spirits vanish into the earth. **Urgent, urgent—by the statutes and commands!**\n\n**Method for Casting Talismans at the Spirit’s Seat**\nIf a person of meager fortune fails to summon the spirits, or if the response is sluggish, proceed thus: inscribe the talisman of the current ten-day period, recite the incantation, and cast it before the spirit’s seat—the spirit will arrive swiftly.\nFor example, in the *Jiazi* ten-day period, inscribe the *Mao* talisman; follow this pattern for others.\n**Incantation:** *\"Reverently invoke the *Zi* and *Mao* spirits of the *Jiazi* ten-day period. Proceed to such-and-such place to attend to matters and save the afflicted. Act with haste—do not disobey.\"*\nAfter reciting the incantation, cast the talisman before the seat of the *Dingmao* spirit and halt. Even across a thousand *li*, the response will be immediate. Inquire about matters of fortune or misfortune, and the spirits will reveal them.\nTo bind ghosts and spirits, simply press the \"ghost’s eye\" between your fingers—the ghost will perish at once. If a malevolent person approaches, write their name, swallow it, and press the \"eye\"—they will come of their own accord.\n\n**Talisman for Casting the Six Ding Spirits at Their Seats**\nWhen inscribing talismans, visualize the Jade Maiden as you begin. To sever copper or steel, first mark twenty-eight points, symbolizing the twenty-eight constellations. Recite the star incantation four times, symbolizing the four seasons, and eight times, symbolizing the eight solar terms. Each point must be made in a single stroke—do not retrace.\nWhoever obtains this talisman will command the generals of the Three and Five, the *Liushi* divine generals, and the celestial enforcers. They will refuse even a thousand gold pieces, for it is a treasure beyond price. **Guard it well—it is the most potent of all methods.**\n\n**Talisman for Delivering the Departed from the Underworld**\nThis talisman guides the nine generations of ancestors and the seven generations of forebears into the netherworld, as well as all departed souls. First, inscribe three talismanic strokes, then address the Jade Maiden: *\"I have lost my ninefold ancestors and sevenfold forebears—where have they gone? Or: I have lost so-and-so—since their passing, I know not where they dwell.\"*\nThe spirit bearing this talisman will descend to the depths of hell and the dark peaks, summoning the officials to inquire. *\"Release my departed so-and-so at once.\"* **Swiftly, swiftly!**\nUpon speaking, burn the talisman—the departed will manifest.\n\nFor all the above talismans, inscribe them in red. If cinnabar is unavailable, use standard ink, then seal them with the appropriate stamp. For any undertaking, inscribe a talisman, write the name of the Jade Maiden of the current ten-day period on either side, and sincerely petition the matter at hand. After a grand ritual offering, there is no need to erect an altar each time—simply present incense, tea, wine, and fruit, burn incense, and make your plea with utmost devotion. The Jade Maiden will naturally appear in her true form. The talisman need not be burned—it will depart of its own accord. Its numinous power is boundless. Whoever obtains this method must treasure it as their greatest possession.\n\nRevere it, and your nine clans will receive blessings—fortune, emolument, and glory will flourish, and you may ascend to immortality and attain the Dao. Disdain it, and your six relations will suffer calamity—disaster will strike, and you may sink into the dark realms as a ghost. **How can one not be cautious?** Focus your mind unwaveringly, and banish all distractions. If in dreams your form travels afar, or if a woman appears seated beside you, it is the Jade Maiden descending. From then on, your methods will gradually align with your will. If the six spirits frequent your presence over time, manifesting as shadows or forms, or communicating through whispers or visions, it is a sign that your karmic affinity with this method has ripened. There is no need for elaborate practice—simply petition with sincerity, and the response will be immediate.\n\nWhoever attains this method has, in truth, borne the name of an immortal in past lives, and thus has come to possess this Way in the present. From the celestial palaces of the Jade Emperor above to the netherworld courts below, all undertakings will be met with resonance. **This is not to be transmitted for ten thousand gold pieces.** As the ancients said: *\"Better to give a thousand gold than to reveal the secrets of the Six Jia’s yin methods.\"*\n\n**The True Scripture of the Six Yin Caverns of the Mysterious and Transformative Hidden Jia, Volume the Lower—Concluded.**",
      "overlap_context": " period,\n- The *Dingwei* spirit of the *Jiachen* ten-day period,\n- The *Dingsi* spirit of the *Jiayin* ten-day period.\n\n*\"Proceed to heal the illness of so-and-so, who suffers from such-and-such ailment. I beseech you to resolve their misfortune, dispel calamity, and swiftly restore their soul. The moment the talisman arrives, act without delay!\"*\n**Urgent, urgent—by the statutes and commands of the Highest Clarity!**\nOnce the command is given, proceed at once to heal—the cure will be immediate.",
      "start_char": 15575,
      "end_char": 16444,
      "start_sentence": 888,
      "end_sentence": 936,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.54066276550293,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\秘藏通玄变化六阴洞微遁甲真经.txt",
        "category": "方法类"
      }
    }
  ]
}