{
  "source_id": "秤星灵台秘要经",
  "source_file": "chunked_daozang\\秤星灵台秘要经.json",
  "total_chunks": 4,
  "total_original_chars": 2601,
  "total_translated_chars": 13723,
  "total_translation_time": 77.57902526855469,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\众术类\\秤星灵台秘要经.txt",
    "category": "众术类"
  },
  "full_translation": "*The Scripture of the Mysterious Terrace of the Stellar Balance: Essential Secrets*\n\n**Title:** *Scripture of the Mysterious Terrace of the Stellar Balance: Essential Secrets*. Author unknown. Base text from *Daoist Canon of the Zhengtong Era*, *Dongzhen* section, *Zhongjie* category.\n\n---\n\nThe natures of the Five Phases differ each from the other:\nWood is unyielding and upright,\nFire is fierce and vehement,\nEarth is kind and harmonious,\nMetal is stern and resolute,\nWater is modest and retiring.\n\n**Method for Dispelling Malevolent Stars**\nThe *Canon of Human Relations* states: The *shen* and *you* positions are the Eight Killing Directions; these positions must never be exposed to fire. Guo Jingchun observed that fire setting in the west portends misfortune, and thus devised this method to dispel it.\n\nFirst, one must prepare a privy, where incense is to be burned constantly. No one else may enter—only oneself. When performing the rite, one must loosen the hair and grasp a sword, standing within the privy. If no one appears for the span of a single *qingke*, place the sword in the privy, and the dispelling may proceed. Should anyone witness the act, neither party will escape misfortune.\n\nAt one such time, Huan Xuan chanced to see it. [Guo] Pu said: \"Neither you nor I shall escape.\" Later, events unfolded exactly as he foretold. This method was deemed inauspicious and concealed as closely as the *Golden Casket Scripture*.\n\nLater, Yixing and Li Quan recorded it in brush within the scrolls of this scripture. Yet I feared that shamans and sorcerers might exploit it for profit, and so during the Qianning era, I examined its errors and removed it, omitting it from the record. Now, however, I worry that the passage of years may cause the text to vanish entirely, and so I have transcribed it separately.\n\n**Dispelling Rite**\n\nWhen the fire star’s celestial motion reaches the *yuan* guardian palace, align its degrees with those of your birth, matching the distance and degree to determine the corresponding day. First, abstain from desires, and from dawn remain in a quiet chamber. After breakfast, at noon, disrobe, grasp your sword, enter the privy to perform the rite, then exit weeping softly. Return to the quiet chamber, bathe, and lie down for an hour. Observe what appears in your dreams—this will surely avert disaster. The rite may be performed twice.\n\nIf the vision is vague, suggesting official misfortune or illness, use cypress wood to carve a likeness of yourself, dress it in your own clothes, and when the fire star appears, stand with unbound hair, sword in hand, call your own name, and invoke the wooden effigy beneath the star. Summon your servants, then burn the effigy. Afterward, enter the quiet chamber, sit upright, and visualize your body. Disburse wealth to the poor, aid the needy, and perform hidden acts of virtue. The wooden figure should be three feet and two inches tall. Pay the craftsman generously and ensure secrecy. The clothing should match the figure’s height. Avoid monks, nuns, chickens, and dogs—if the star reaches the *yuan* guardian, disaster will strike as before. If it afflicts parents, spouse, or children, illness, death, or financial loss will follow. For the noble, exile or ruin is certain. Assess whether the star’s influence was favorable at birth—if so, fortune precedes misfortune.\n\n**Dispelling Rite**\nThe method aligns with the fire rite. If the affliction occurs in the current year or involves the *yuan* guardian, take your own hat and clothes, place them beneath a bamboo grove, and on the day of the star’s malevolence, have someone craft a bamboo effigy. Dress it in your hat and clothes, then stand beneath the star. If rain or overcast skies prevail, perform the rite in the privy: fashion a human shape, call your name, sever the bamboo, and cast it into the privy to dispel disaster. Avoid witnesses—if seen, misfortune is inescapable.\n\n**Dispelling Fire (from the *Nine Planetary Scripture*)**\nUse seven grains of red sesame, five grains of red rice, three grains of red adzuki beans, seven strands of red donkey tail hair, and a pinch of red copper filings. Place them in a vermilion bag and strike your arm with a *fei* branch—greatly auspicious. Alternatively, draw the star’s form and make offerings—also auspicious. Recite the *Sutra of Transforming the Dead*, the *Sutra of Disaster Dispelling*, and wear a vermilion headband with cinnabar. Perform the rite on a cloudless day.\n\nThe *Precious Life Scripture* states: Ride a red horse, wear red clothes, and draw blood from seven points on your body, as well as from a red donkey. When the fire star’s malevolent day arrives, construct an octagonal altar. At each of the four cardinal and intercardinal directions, place arrows tied with the corresponding colors. Mix your blood and the donkey’s blood with sandalwood powder, then sprinkle it on the altar. Light five lamps of red sesame oil at the five directions, using red lamp stands as previously described. Strike your arm with the *pai* rope and wear the headband—auspicious.\n\nThe *Nine Planetary Scripture* further advises: Offer five fruits and firewood matching your age, along with licorice equal to your age in taels, and burn them with previous merit offerings. Wear a red copper bracelet on your arm. Place a vat of water beneath the southern altar, raise a pole with a red banner at noon, and bury six catties of red charcoal.\n\n**Dispelling Earth**\nTake seven grains of black sesame and seven black beans, place them in a black silk bag, and bind it to your left arm with a black cord to dispel all demonic influences, curses, and malevolent spirits. On the first day of the lunar month, cook porridge with black sesame oil, consume a small portion, and distribute the rest to the poor and Daoist monks. Since earth governs all who cultivate the Dao or seek enlightenment through asceticism, almsgiving brings great fortune. Do not harm filial children or the elderly, nor indulge in excessive music—earth favors mourning and disdains revelry.\n\nThe *Nine Planetary Scripture* also states: Forge a plowshare into the true form of the earth star, seven inches long, and store it in a black porcelain jar at the head of your bed. On days when the rooster’s crow aligns with the hour, anoint your head with black sesame oil at dawn, and remove it after a year. Drawing and making offerings to the image is also effective. Offer fruits matching your age, especially black ones—most efficacious.\n\nRecite the incantation: *\"The rooster’s crow is my lord; I, your servant, beseech your protection. Next, dispel calamity.\"* Then bow in worship, consume the offering yourself, and favor sour and bitter foods. Carry the *Eight Yang Scripture* and realgar, burn benzoin, wear black clothes, avoid temples of malevolent spirits, refrain from beef, and shun horn vessels.\n\n**Dispelling Dark Stars**\nThe scripture states: Forge a bracelet from slaughterhouse iron into a serpent shape, mouth clutching tail, and wear it on your left arm. Don black clothes, avoid eating at night or walking in *qi*-laden places. Take a *dou* of soil from a high ridge and place it under your bed. Boil another *dou* of yellow soil, feed it to long-lived geese and crows—greatly auspicious.\n\n**Dispelling Wood**\nTake seven strands of white *du* fur, place them in a white bag, and bind it to your left arm. Avoid eating *du* meat and taking lives. Cast a white silver ingot into the star’s true form, make offerings, and recite scriptures. Do not enter spirit temples, mourn the dead, or visit the sick. Making offerings to all Daoists brings fortune.\n\n**The *Dongwei* Limit Song**\nA person’s noble or base fate is decreed by the stars;\nLimit numbers shift through palaces, each in its time.\nIf you encounter Rāhu, Venus, or Jupiter’s Thursday,\nOr the sun, purple brilliance, or the moon’s company,\nThe limit brings official rank and emolument.\nIf the limit meets gold, wood, moon, or purple *qi* with Rāhu, joyous events arise.\nBut fire and earth stars bring peril.\nFor those born at night, earth’s descent on Tuesday\nFrom three directions spells certain death.\n\nFor those born in daylight, fire is the ruling star.\nIf the limit number aligns with it, death is certain.\nShould this star govern the three directions,\nThough calamity strikes, life remains unsevered.\nAs night-born are ruled by earth and day-born by fire,\nWhen the limit number meets them, disaster may come yet death does not.\n\nDomestic strife arises when *Bo* arrives,\nCoupled with dullness and confusion akin to stupor.\nWhen the limit number encounters the moon’s *Bo*,\nHouseholds grow restless, minds and hearts grow sluggish.\n\nRemember *Ketu*’s loss of office—\nIf it meets *Kui* or *Lou*, relocation follows.\nWhen *Ketu* resides in *Double Fish* or *Wall* constellations,\nAnd the limit number aligns, official promotion brings joy,\nFor these are auspicious celestial lodgings.\nIf it dwells only in *Room* or *Kui* constellations,\nJoy still comes, for they too are favorable,\nThough not as potent as *Wall* or *Lou*.\n\nHead in the yang palace brings swift fortune,\nTail in the yin position spares few disasters.\n*Rāhu* in the yang palace brings swift fortune,\nIn the yin palace, fortune comes more slowly.\n*Ketu* in the yin palace brings swift fortune,\nIn the yang palace, fortune comes more slowly.\n\nWhen the palace’s opposing three directions are now observed,\nAn empty limit bodes ill for all undertakings.\nIf one’s limit aligns and the primary entry and three harmonies are examined,\nThe absence of stars confirms it—\nAn empty limit brings dullness,\nAnd affairs remain unresolved.\n\nWhen the limit of official rank meets emptiness, death follows,\nAt forty-six or forty-seven, life must depart.\nIf this occurs in the realm of official emolument,\nThough fifty is expected, forty-six or forty-seven is the true reckoning.\n\nWhen a benevolent star’s limit meets calamity and taboo,\nDeath strikes at the height of contentment—this is the mechanism.\nIf a favorable limit encounters a baleful star,\nNot as a taboo but as a harbinger,\nFortune and longevity become uncertain—\nDiscern the signs carefully.\n\nStripped of office, *Bo*, and *Ketu*—the limit still reveals.\nMalevolent stars weigh upon each other at their appointed times,\nWhen fate meets them, in which month does death arrive?\nLoss of position and untimely death—ponder this well.\nIf one’s limit number meets *Bo* or *Ketu*,\nAnd taboo stars converge, this person perishes amid ruin.\n\nDay-earth and night-fire govern thus.\nWhen the limit brings fulfillment and official rank ascends,\nFire in yin or yang, earth in its palace—exceedingly auspicious.\n\n---\n\nWhere text is missing, stars align—rank flourishes and position rises,\nShould hempen plaint arise, when one’s limit meets the Purple Qi,\nOutshining all other stars, he assumes command of urgent pacification.\n\nWhen two stars occupy a favorable temple within one limit,\nFour years are added to his lifespan—let all take heed.\nIf within a single limit two baleful stars appear in harmonious conjunction,\nTwo years are extended, thus making four in total.\n\nIn determining fortune or calamity,\nIf the encounter is delayed, blessings come slowly;\nWhen stars move in direct motion, blessings arrive swiftly.\nMalevolent stars lingering in retrograde bring swift disaster,\nWhile direct motion slows its onset.\n\nWhen the limit meets two baleful stars in conjunction,\nDisaster strikes with utmost severity, unyielding.\nIf within one limit two baleful stars converge, the calamity is profound—\nAll other cases follow this pattern.\n\nUpon first entering a taboo star’s official or lodging limit,\nWith the body’s fate and annual stars also afflicted by baleful influences,\nAnd the palace in one of the Five Weak positions—no doubt remains:\nThe month of lingering retrograde is the month of death,\nNo need to wait for the following year—\nThis is disaster at its worst.\n\nIf the limit, annual star, and body’s fate are favorable,\nYet a benevolent star’s influence wanes, peril soon appears.\nWhen a star’s original palace surpasses all others,\nIn the Seven Strong palaces, fortune is amplified.\nIn the Five Weak, misfortune deepens and blessings diminish—\nScholars must carefully weigh good and ill.\n\nThis text, as it follows, holds no greater subtlety:\nThe ancient sages’ fixed determinations leave no room for doubt.\nLife and death are settled without a single error,\nRevealing at last the profound depths of this study.\n\n*The Song of Fortune and Misfortune in the Profound Numbers*\nAt *mao*, fifteen; at *chen*, ten,\nAt *si*, eleven; *you* shares the same pattern.\nAt *wu*, fifteen—strongest of all,\nAt *shen*, seven; *wei*, eight—yet to be examined.\nAt *xu*, *hai*, and *zi*, four and a half years each,\nAt *chou* and *yin*, five years apiece.\n\nFor example, one born at day with Fire in *si*:\n*Wu*, *wei*, *shen*, and *you* are all void.\nAt twenty-five years, life reaches its end—\nOr else ruin befalls him in a foreign land.\nWood in *wu*, Fire in *you*:\nAt thirty-seven, fortune stands firm.\nWhen exhaustion arrives before *you* at *shen*,\nSixty-six marks the onset of misfortune.\n\nHuman life is measured at one hundred years as the standard,\nYet with stars’ benevolent and baleful influences,\nAdding or diminishing by half, few reach this span.\nFrom the life palace, beginning at fifteen years,\nPassing through benevolent stars, one attains the full count of their original palace.\nWhen traversing baleful palaces, observe their direct oppositions and trines,\nAdding or diminishing accordingly.\nEncountering ill, halve the count; encountering good, add half—\nSuch is the method.\n\n*Thus concludes the* Secret Essentials of the Celestial Balance *from the* Lingtai *Repository.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "秤星灵台秘要经 经名：秤星灵奎秘要经。 撰人不详。 底本出处：《正统道藏》洞真部众街类。 秤星灵台秘要经 明五行之性各异 木性强直，火性猛烈，土性仁和，金性严毅，水性谦退。 禳灾星法 人伦经云：申酉为八杀位，此位唯不宜见火。 郭景纯以火在西没，故知不令终因以法禳。 先须争修一厕，常须焚香，勿令人往，只自己如之。 作法时，即须披头仗剑，立此厕间。 如一顷刻不逢人，即置剑於厕中，可以禳之。 若人见之，则彼此不免也。 其时，被桓玄见之。 璞曰：与尔俱不免也。 后果如其言，其法不欲，匿之秘如金匮经。 后一行，与李荃撰笔，斯经卷内收之。 余恐师巫，以为取资之具，乾宁中，勘其疏己去之，更不备载。 今复虑年纪绵邈，流落其本，故别录之。 禳法",
      "translated_text": "*The Scripture of the Mysterious Terrace of the Stellar Balance: Essential Secrets*\n\n**Title:** *Scripture of the Mysterious Terrace of the Stellar Balance: Essential Secrets*. Author unknown. Base text from *Daoist Canon of the Zhengtong Era*, *Dongzhen* section, *Zhongjie* category.\n\n---\n\nThe natures of the Five Phases differ each from the other:\nWood is unyielding and upright,\nFire is fierce and vehement,\nEarth is kind and harmonious,\nMetal is stern and resolute,\nWater is modest and retiring.\n\n**Method for Dispelling Malevolent Stars**\nThe *Canon of Human Relations* states: The *shen* and *you* positions are the Eight Killing Directions; these positions must never be exposed to fire. Guo Jingchun observed that fire setting in the west portends misfortune, and thus devised this method to dispel it.\n\nFirst, one must prepare a privy, where incense is to be burned constantly. No one else may enter—only oneself. When performing the rite, one must loosen the hair and grasp a sword, standing within the privy. If no one appears for the span of a single *qingke*, place the sword in the privy, and the dispelling may proceed. Should anyone witness the act, neither party will escape misfortune.\n\nAt one such time, Huan Xuan chanced to see it. [Guo] Pu said: \"Neither you nor I shall escape.\" Later, events unfolded exactly as he foretold. This method was deemed inauspicious and concealed as closely as the *Golden Casket Scripture*.\n\nLater, Yixing and Li Quan recorded it in brush within the scrolls of this scripture. Yet I feared that shamans and sorcerers might exploit it for profit, and so during the Qianning era, I examined its errors and removed it, omitting it from the record. Now, however, I worry that the passage of years may cause the text to vanish entirely, and so I have transcribed it separately.\n\n**Dispelling Rite**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 319,
      "start_sentence": 0,
      "end_sentence": 20,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.643773794174194,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\秤星灵台秘要经.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "候火星行度来到元守宫，分度一如生时，远近度数，合於何日符同。 遂先绝嗜欲，自晨居静室，早饭了，至日午，可裸形仗剑，入厕作法了，低声哭出厕门，却入静室澡浴卧一时，看梦寐所见何物，必去其祸也。 可二度为之也。 若恍惚与人为官灾、疾病者，宜用柏木，刻如自己之形状，披以己之衣服，候火星见，自己披发仗剑，呼己名，唱柏木形星下，连呼仆妾，以火焚之。 然后，入静室端坐存身，破财施贫，济乏行阴德。 其木人，长三尺二寸，其工匠多与钱物，勿令泄於外人。 其衣服，象木人长短为之，忌僧尼，鸡犬见之，若土到元守，为灾必若第一度，到父母、妻子，疾病死亡，失财。 贵人则坐致流亡。 但看生时，得力与不得力。 若星主得力，则先吉后灾也。 禳法 其法与火同，若年下为灾及元守者，以己之冠冕、衣服，令入木竹林下，候为灾日月，倩人作一竹人形，架其衣服、冠冕，向其星辰下。 姐值阴雨，即向厕上，作人之形，呼己名，断其竹木，投诸厕中，可去其灾。 亦忌人见之，见则不免也。 禳火出九执经 使赤油麻七粒，赤稻五粒，赤小豆三粒，赤驴尾七茎，赤铜屑少许，以诽袋子盛，腓栈子击在臂上，大吉。 又若画其形供养，吉。 又转度人经，及消灾经，及带诽头须朱砂，即於云汉日为之。 宝命经云：乘赤马，着赤衣，在身须七处刺出血，又刺出赤驴血。 当火见日为灾时，造八角坛，於四面四角头，各着四方箭，箭上系四方色，续时己身上血，并赤驴血，与檀末相调，沥於坛上。 上又以赤油、麻油灯五方，五盏灯树皆须赤，前来所用。 袋用徘索子击在臂上，带头须吉。 又九执经云：取随年五果、木柴，随年甘草两数，并前功德焚之，在臂上带赤铜钏，南坛下置水一瓮，午上立竿悬赤旛，埋赤炭六斤。 禳土法 取黑油麻七粒、黑豆七粒，以皂绫袋子盛之，用皂索子系左臂上，能除一切鬼魅邪魔，咒诅之灾。 於朔日，以黑油麻汁作粥，自食少许，余以施贫人及道僧。 缘土管一切修道人，及苦行求正之者，布施则大吉。 不得伤害孝子及老人，不宜多作乐。 缘土好哀哭，不好音乐故也。 又九执经云； 宜以犁具铧铁铸，作一土星真形，长七寸，以黑磁瓮盛之，置於卧床头安之。 每於鸡缓直日平旦时，以黑油麻汁沥头上，经年乃去之。 如画之供养，亦得以随年果子供养，带黑色者，尤妙。 咒曰：鸡缓是我君主，某臣仆愿加佑护，次以度灾厄。 然后，拜之供养讫，自己食之。 好食酸苦等，宜看八阳经带雄朱，烧安息香，着皂衣，不入恶神庙，忌食牛肉，忌角器等。 禳暗曜 经云：以屠宰煞铁打作钏，如蛇形，以口衔尾，带左臂上，着腓衣，忌夜食，及炁处行，取高冈上土一斗，置床下，别取黄土一斗煮熟，送喂长生鹅鸦食之，大吉。 禳木法 取白堵毛七茎，以白袋盛，系左臂上，忌食堵肉，不得杀生命。 又以白银一两，铸作真形，供养看经，不得入神庙，及吊死、问病，供养一切道人吉。 洞微限歌 人生贵贱禀星推，限数交宫各有时。 若遇罗喉金木曜，太阳紫熙月同随。 限逢此曜加官禄，限数若逢金木日月紫炁罗喉主喜庆之事。 火土二星到便危。 夜降土星尽火曜，三方不是死无疑。 夜生人，土不是主。",
      "translated_text": "When the fire star’s celestial motion reaches the *yuan* guardian palace, align its degrees with those of your birth, matching the distance and degree to determine the corresponding day. First, abstain from desires, and from dawn remain in a quiet chamber. After breakfast, at noon, disrobe, grasp your sword, enter the privy to perform the rite, then exit weeping softly. Return to the quiet chamber, bathe, and lie down for an hour. Observe what appears in your dreams—this will surely avert disaster. The rite may be performed twice.\n\nIf the vision is vague, suggesting official misfortune or illness, use cypress wood to carve a likeness of yourself, dress it in your own clothes, and when the fire star appears, stand with unbound hair, sword in hand, call your own name, and invoke the wooden effigy beneath the star. Summon your servants, then burn the effigy. Afterward, enter the quiet chamber, sit upright, and visualize your body. Disburse wealth to the poor, aid the needy, and perform hidden acts of virtue. The wooden figure should be three feet and two inches tall. Pay the craftsman generously and ensure secrecy. The clothing should match the figure’s height. Avoid monks, nuns, chickens, and dogs—if the star reaches the *yuan* guardian, disaster will strike as before. If it afflicts parents, spouse, or children, illness, death, or financial loss will follow. For the noble, exile or ruin is certain. Assess whether the star’s influence was favorable at birth—if so, fortune precedes misfortune.\n\n**Dispelling Rite**\nThe method aligns with the fire rite. If the affliction occurs in the current year or involves the *yuan* guardian, take your own hat and clothes, place them beneath a bamboo grove, and on the day of the star’s malevolence, have someone craft a bamboo effigy. Dress it in your hat and clothes, then stand beneath the star. If rain or overcast skies prevail, perform the rite in the privy: fashion a human shape, call your name, sever the bamboo, and cast it into the privy to dispel disaster. Avoid witnesses—if seen, misfortune is inescapable.\n\n**Dispelling Fire (from the *Nine Planetary Scripture*)**\nUse seven grains of red sesame, five grains of red rice, three grains of red adzuki beans, seven strands of red donkey tail hair, and a pinch of red copper filings. Place them in a vermilion bag and strike your arm with a *fei* branch—greatly auspicious. Alternatively, draw the star’s form and make offerings—also auspicious. Recite the *Sutra of Transforming the Dead*, the *Sutra of Disaster Dispelling*, and wear a vermilion headband with cinnabar. Perform the rite on a cloudless day.\n\nThe *Precious Life Scripture* states: Ride a red horse, wear red clothes, and draw blood from seven points on your body, as well as from a red donkey. When the fire star’s malevolent day arrives, construct an octagonal altar. At each of the four cardinal and intercardinal directions, place arrows tied with the corresponding colors. Mix your blood and the donkey’s blood with sandalwood powder, then sprinkle it on the altar. Light five lamps of red sesame oil at the five directions, using red lamp stands as previously described. Strike your arm with the *pai* rope and wear the headband—auspicious.\n\nThe *Nine Planetary Scripture* further advises: Offer five fruits and firewood matching your age, along with licorice equal to your age in taels, and burn them with previous merit offerings. Wear a red copper bracelet on your arm. Place a vat of water beneath the southern altar, raise a pole with a red banner at noon, and bury six catties of red charcoal.\n\n**Dispelling Earth**\nTake seven grains of black sesame and seven black beans, place them in a black silk bag, and bind it to your left arm with a black cord to dispel all demonic influences, curses, and malevolent spirits. On the first day of the lunar month, cook porridge with black sesame oil, consume a small portion, and distribute the rest to the poor and Daoist monks. Since earth governs all who cultivate the Dao or seek enlightenment through asceticism, almsgiving brings great fortune. Do not harm filial children or the elderly, nor indulge in excessive music—earth favors mourning and disdains revelry.\n\nThe *Nine Planetary Scripture* also states: Forge a plowshare into the true form of the earth star, seven inches long, and store it in a black porcelain jar at the head of your bed. On days when the rooster’s crow aligns with the hour, anoint your head with black sesame oil at dawn, and remove it after a year. Drawing and making offerings to the image is also effective. Offer fruits matching your age, especially black ones—most efficacious.\n\nRecite the incantation: *\"The rooster’s crow is my lord; I, your servant, beseech your protection. Next, dispel calamity.\"* Then bow in worship, consume the offering yourself, and favor sour and bitter foods. Carry the *Eight Yang Scripture* and realgar, burn benzoin, wear black clothes, avoid temples of malevolent spirits, refrain from beef, and shun horn vessels.\n\n**Dispelling Dark Stars**\nThe scripture states: Forge a bracelet from slaughterhouse iron into a serpent shape, mouth clutching tail, and wear it on your left arm. Don black clothes, avoid eating at night or walking in *qi*-laden places. Take a *dou* of soil from a high ridge and place it under your bed. Boil another *dou* of yellow soil, feed it to long-lived geese and crows—greatly auspicious.\n\n**Dispelling Wood**\nTake seven strands of white *du* fur, place them in a white bag, and bind it to your left arm. Avoid eating *du* meat and taking lives. Cast a white silver ingot into the star’s true form, make offerings, and recite scriptures. Do not enter spirit temples, mourn the dead, or visit the sick. Making offerings to all Daoists brings fortune.\n\n**The *Dongwei* Limit Song**\nA person’s noble or base fate is decreed by the stars;\nLimit numbers shift through palaces, each in its time.\nIf you encounter Rāhu, Venus, or Jupiter’s Thursday,\nOr the sun, purple brilliance, or the moon’s company,\nThe limit brings official rank and emolument.\nIf the limit meets gold, wood, moon, or purple *qi* with Rāhu, joyous events arise.\nBut fire and earth stars bring peril.\nFor those born at night, earth’s descent on Tuesday\nFrom three directions spells certain death.",
      "overlap_context": "d. This method was deemed inauspicious and concealed as closely as the *Golden Casket Scripture*.\n\nLater, Yixing and Li Quan recorded it in brush within the scrolls of this scripture. Yet I feared that shamans and sorcerers might exploit it for profit, and so during the Qianning era, I examined its errors and removed it, omitting it from the record. Now, however, I worry that the passage of years may cause the text to vanish entirely, and so I have transcribed it separately.\n\n**Dispelling Rite**",
      "start_char": 319,
      "end_char": 1565,
      "start_sentence": 21,
      "end_sentence": 68,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.2304310798645,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\秤星灵台秘要经.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "昼生人，火不是主。 限数若逢立主死。 此星若是三方主，虽有灾伤命不离。 如夜生土是主昼生火是主限数若逢虽有灾难而不至死。 家宅不宁因孛至，更兼钝闷恰如痴。 限数逢着月孛主家宅不宁身心钝闷。 计都失职人须记，若遇奎娄主转移。 若遇计都在双鱼、壁宿之时，限数若逢，主有迁官之喜，为在好庙之宿。 若只在室奎二宿，主喜庆，为好庙，即不及在壁娄二宿也。 首在阳宫为福紧，尾星阴位定灾稀。 罗喉在阳宫为福紧，在阴宫为福慢。 计都在阴宫为福紧，在阳宫为福慢。 宫中对视三方今，空限凡营事不期。 若人限逢，看正入并三合对照，无星为是。 在空限，主其钝闷，为事不央。 官禄上逢空限死，四旬六七命须辞。 若官禄上逢之时即遇五十不得应在四十六七也。 善星限内逢灾忌，称意中亡此是机。 若人限数逢好星之数，有忌星，此人在称意之中。 只有灾星消息定，若是好限中逢着灾星，不是忌，主其福寿不定，消息详之。 剥官孛计限仍知。 恶曜相累各有时，运上逢之何月死。 失职中亡请细思，若人限数逢着月孛计都之数内有忌星合照，此人失职之中亡也。 昼土夜荧如是主。 限逢称遂转官资，火阴阳土宫尤妙。",
      "translated_text": "For those born in daylight, fire is the ruling star.\nIf the limit number aligns with it, death is certain.\nShould this star govern the three directions,\nThough calamity strikes, life remains unsevered.\nAs night-born are ruled by earth and day-born by fire,\nWhen the limit number meets them, disaster may come yet death does not.\n\nDomestic strife arises when *Bo* arrives,\nCoupled with dullness and confusion akin to stupor.\nWhen the limit number encounters the moon’s *Bo*,\nHouseholds grow restless, minds and hearts grow sluggish.\n\nRemember *Ketu*’s loss of office—\nIf it meets *Kui* or *Lou*, relocation follows.\nWhen *Ketu* resides in *Double Fish* or *Wall* constellations,\nAnd the limit number aligns, official promotion brings joy,\nFor these are auspicious celestial lodgings.\nIf it dwells only in *Room* or *Kui* constellations,\nJoy still comes, for they too are favorable,\nThough not as potent as *Wall* or *Lou*.\n\nHead in the yang palace brings swift fortune,\nTail in the yin position spares few disasters.\n*Rāhu* in the yang palace brings swift fortune,\nIn the yin palace, fortune comes more slowly.\n*Ketu* in the yin palace brings swift fortune,\nIn the yang palace, fortune comes more slowly.\n\nWhen the palace’s opposing three directions are now observed,\nAn empty limit bodes ill for all undertakings.\nIf one’s limit aligns and the primary entry and three harmonies are examined,\nThe absence of stars confirms it—\nAn empty limit brings dullness,\nAnd affairs remain unresolved.\n\nWhen the limit of official rank meets emptiness, death follows,\nAt forty-six or forty-seven, life must depart.\nIf this occurs in the realm of official emolument,\nThough fifty is expected, forty-six or forty-seven is the true reckoning.\n\nWhen a benevolent star’s limit meets calamity and taboo,\nDeath strikes at the height of contentment—this is the mechanism.\nIf a favorable limit encounters a baleful star,\nNot as a taboo but as a harbinger,\nFortune and longevity become uncertain—\nDiscern the signs carefully.\n\nStripped of office, *Bo*, and *Ketu*—the limit still reveals.\nMalevolent stars weigh upon each other at their appointed times,\nWhen fate meets them, in which month does death arrive?\nLoss of position and untimely death—ponder this well.\nIf one’s limit number meets *Bo* or *Ketu*,\nAnd taboo stars converge, this person perishes amid ruin.\n\nDay-earth and night-fire govern thus.\nWhen the limit brings fulfillment and official rank ascends,\nFire in yin or yang, earth in its palace—exceedingly auspicious.",
      "overlap_context": "ngwei* Limit Song**\nA person’s noble or base fate is decreed by the stars;\nLimit numbers shift through palaces, each in its time.\nIf you encounter Rāhu, Venus, or Jupiter’s Thursday,\nOr the sun, purple brilliance, or the moon’s company,\nThe limit brings official rank and emolument.\nIf the limit meets gold, wood, moon, or purple *qi* with Rāhu, joyous events arise.\nBut fire and earth stars bring peril.\nFor those born at night, earth’s descent on Tuesday\nFrom three directions spells certain death.",
      "start_char": 1565,
      "end_char": 2018,
      "start_sentence": 69,
      "end_sentence": 93,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.73532247543335,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\秤星灵台秘要经.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "缺文 星相见职昌位显，主麻词若人限逢紫炁，充胜他星，主领靖紧之权。 一限两星居好庙，益寿四年人要知。 若一限之中见两恶曜在好乐合，延二年之数，即延得四年也。 凡定灾福，若是逢迟，还福慢，顺行还福紧。 恶曜留逆为灾紧，顺行即慢。 限达恶曜两相见，为灾至甚并无移。 若是一限之中见两恶星为灾甚丰他皆仿此也。 初入忌星官宿限，身命行年恶曜随。 留逆之月为亡月，宫为五弱不须疑。 若是初入忌星，行年、身命又逢忌星临照，及在弱宫，此忌□留逆之月，必身亡，更不待第二年。 是灾甚也。 限恶行年身命喜，好星过时便见危。 星辰本宫胜余位，七强宫内福加之。 五弱添灾福力臧，学者须详善恶推。 此书如后更无妙，先贤指定更无迷，生死定人无一失，方显从来学洞微。 洞微大数休咎歌 卯十五兮辰宫十，巳十一兮酉同式。 午宫十五最高强，申七未八却在详。 戌亥子各四年半，丑寅都各五年强。 假令昼生火在巳，午未申酉并空亡。 二十五年为尽处，不然破败在他乡。 木在午兮酉上火，三旬之七福堂堂。 竭在酉前申位尽，六旬之六是为殃。 人生一百以为准，学而细记莫令忘。 夫人生以一百为准，多有星辰善恶，加臧其半，以此不及一百。 从命宫，从十五年，经历善星，得其本宫之数，历恶宫切见相对，与三合加臧之。 遇恶即臧半，善加半，法也。 秤星灵台秘要经竟",
      "translated_text": "---\n\nWhere text is missing, stars align—rank flourishes and position rises,\nShould hempen plaint arise, when one’s limit meets the Purple Qi,\nOutshining all other stars, he assumes command of urgent pacification.\n\nWhen two stars occupy a favorable temple within one limit,\nFour years are added to his lifespan—let all take heed.\nIf within a single limit two baleful stars appear in harmonious conjunction,\nTwo years are extended, thus making four in total.\n\nIn determining fortune or calamity,\nIf the encounter is delayed, blessings come slowly;\nWhen stars move in direct motion, blessings arrive swiftly.\nMalevolent stars lingering in retrograde bring swift disaster,\nWhile direct motion slows its onset.\n\nWhen the limit meets two baleful stars in conjunction,\nDisaster strikes with utmost severity, unyielding.\nIf within one limit two baleful stars converge, the calamity is profound—\nAll other cases follow this pattern.\n\nUpon first entering a taboo star’s official or lodging limit,\nWith the body’s fate and annual stars also afflicted by baleful influences,\nAnd the palace in one of the Five Weak positions—no doubt remains:\nThe month of lingering retrograde is the month of death,\nNo need to wait for the following year—\nThis is disaster at its worst.\n\nIf the limit, annual star, and body’s fate are favorable,\nYet a benevolent star’s influence wanes, peril soon appears.\nWhen a star’s original palace surpasses all others,\nIn the Seven Strong palaces, fortune is amplified.\nIn the Five Weak, misfortune deepens and blessings diminish—\nScholars must carefully weigh good and ill.\n\nThis text, as it follows, holds no greater subtlety:\nThe ancient sages’ fixed determinations leave no room for doubt.\nLife and death are settled without a single error,\nRevealing at last the profound depths of this study.\n\n*The Song of Fortune and Misfortune in the Profound Numbers*\nAt *mao*, fifteen; at *chen*, ten,\nAt *si*, eleven; *you* shares the same pattern.\nAt *wu*, fifteen—strongest of all,\nAt *shen*, seven; *wei*, eight—yet to be examined.\nAt *xu*, *hai*, and *zi*, four and a half years each,\nAt *chou* and *yin*, five years apiece.\n\nFor example, one born at day with Fire in *si*:\n*Wu*, *wei*, *shen*, and *you* are all void.\nAt twenty-five years, life reaches its end—\nOr else ruin befalls him in a foreign land.\nWood in *wu*, Fire in *you*:\nAt thirty-seven, fortune stands firm.\nWhen exhaustion arrives before *you* at *shen*,\nSixty-six marks the onset of misfortune.\n\nHuman life is measured at one hundred years as the standard,\nYet with stars’ benevolent and baleful influences,\nAdding or diminishing by half, few reach this span.\nFrom the life palace, beginning at fifteen years,\nPassing through benevolent stars, one attains the full count of their original palace.\nWhen traversing baleful palaces, observe their direct oppositions and trines,\nAdding or diminishing accordingly.\nEncountering ill, halve the count; encountering good, add half—\nSuch is the method.\n\n*Thus concludes the* Secret Essentials of the Celestial Balance *from the* Lingtai *Repository.*",
      "overlap_context": "ipped of office, *Bo*, and *Ketu*—the limit still reveals.\nMalevolent stars weigh upon each other at their appointed times,\nWhen fate meets them, in which month does death arrive?\nLoss of position and untimely death—ponder this well.\nIf one’s limit number meets *Bo* or *Ketu*,\nAnd taboo stars converge, this person perishes amid ruin.\n\nDay-earth and night-fire govern thus.\nWhen the limit brings fulfillment and official rank ascends,\nFire in yin or yang, earth in its palace—exceedingly auspicious.",
      "start_char": 2019,
      "end_char": 2570,
      "start_sentence": 94,
      "end_sentence": 122,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.96949791908264,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\众术类\\秤星灵台秘要经.txt",
        "category": "众术类"
      }
    }
  ]
}