{
  "source_id": "稚川真人校证术",
  "source_file": "chunked_daozang\\稚川真人校证术.json",
  "total_chunks": 4,
  "total_original_chars": 2996,
  "total_translated_chars": 17597,
  "total_translation_time": 99.56566429138184,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\众术类\\稚川真人校证术.txt",
    "category": "众术类"
  },
  "full_translation": "**Master Zhichuan’s Verification of the Arts**\n*Text Title:* *Master Yachuan’s Verification of the Arts*\nAuthor unknown, approximately dating to the Five Dynasties period. One scroll.\nBase text from: *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, *Zhongshu* Category.\n\n---\n\n**Master Zhichuan’s Verification of the Arts**\n\n**Precelestial Diagram**\n*[Not included]*\n\n**Lineage Transmission Diagram**\nChuanke Yang Yao → Yang Xu Zhouhua → [Anonymous disciple from] Maoyin → Master Meng of Yanshan (no transmission recorded)\n\n---\n\n**On the Precelestial**\nAll things endowed with precelestial *qi* occupy the positions of *geng* and *xin*, corresponding above to the Great White Star of Metal (Venus). This is called the Queen Mother of the West. It produces the marrow of the Red Phoenix of the South—this is the postcelestial, named *Metal Lead*, also called *Radiant Golden Essence*, *Lead White Frost*, or *Golden Liquor*.\n\nRefined with the fire of ten thousand *jun*, it can never be exhausted. When it encounters earth, it dries; therein lies the sage’s work. United with its mother, it takes form; therein the embryo is born, and flesh and bone arise. This is the fixed principle of creation: from nothing, something arises. Metal subdues Wood, and Wood flourishes—such is its meaning.\n\nWhen the Four Symbols are complete, the Center presides as master. When the Three Families gather, the Central Palace becomes the treasure. The meaning of \"treasure and master\" is not the subtlety of the Great Elixir, yet it is not easily understood.\n\nThis is what the Prince of Huainan refined as *Autumn Stone*, yielding inexhaustible treasure. Thus the Lord of Heaven cherishes it, and in compassion for sentient beings, transmits it but once in ten thousand kalpas. Those who receive it must possess the innate bone of immortals; if transmitted to the unworthy, calamity befalls nine generations.\n\nThe *Mysterious Statutes* state: \"To reveal the Dao of Heaven or divulge the Great Treasure is a crime beyond absolution.\"\n\n**True Oral Instructions**\nWithin the male lies the essence of the female,\nBearing yin yet embracing yang’s purity.\nThe Four Symbols depend on harmonious blending;\nEarth and Metal yield forth yellow gold.\n\n**Testimony of the Great Medicine**\nRefine powder into lead,\nTransform stone into dust.\nBy natural fire, transmute;\nRemove the lead to obtain the cinnabar.\nThen enter the *Flowery Pond*,\nReturning to the source, restoring its hue.\nRe-enter the *Spirit Chamber*,\nNurtured again by fire.\nAfter sixty days,\nThe *Golden Liquor Elixir* is complete.\nConsumed, it bestows immortality.\n\n**Secret Writings**\nThe cultivation of the Great Elixir follows the same path as Heaven and Earth’s creation. Thus, *Taiyi* exists before *Taisu*; though it contains the most subtle emptiness, it gives rise to the first signs of manifestation. *Taiji* precedes *Taiyi*, and so there is *Kun* and *Cheng*—this is primordial chaos. Within it lies the essence of *Taiyi*, mother of Heaven and Earth, origin of the myriad things.\n\nOnce the One *qi* divides, the Two Modes separate. Then arise Qian and Kun, yin and yang, the Three Powers and Five Phases, the Five Metals and Eight Stones. The alchemist takes Qian and Kun as the crucible and vessel, and human beings as the medicinal ingredients. They steal the mechanism of yin-yang transformation, refining water and fire with precision, following the principles of *Kan*, *Li*, *Pi*, and *Tai*. Through bitter years of toil, in motion they rise with the Nine Yangs, in stillness they arise with the Six Yins—such is the great purport of elixir cultivation.\n\n**Ode to the Spirit Chamber by Immortal Ge**\nShallow or deep, the Spirit Chamber is newly forged,\nWithin and without, its arrangements bear secret names.\n\nThe White Tiger is paired only with the Dragon,\nThe Green Dragon still walks alongside the Tiger.\nThe Two Modes are originally the union of Metal,\nAll phenomena arise from Earth’s generation.\n\nMysterious beyond mystery, truly luminous and clear—\nWho in the nine-fold city could contest this?\nSecret teachings trace their source:\nTrue Lead is born in *geng*,\nTrue Mercury in *hai*.\nTheir method rests on two principles:\nMercury is governed by yang,\n*Geng* is restrained by yin,\nTogether they unite in the Central Palace.\nAbove and below, the fire blazes,\nTransforming the foundation of the elixir—\nOn the seventeenth day.\n\nAn anonymous master transmitted this to three disciples,\nReaching Master Cui the Daoist.\nNamed the *Golden Mercury Elixir Method*,\nHe practiced it for over ninety years,\nThen vanished without trace.\n\nIts method undergoes four transformations:\nFirst, *Borrowing the Womb’s Darkness to Settle the Embryo*;\nSecond, *Yin Substance with a Yang Embryo*;\nThird, *The Six Spirits Subduing the Corpse*;\nFourth, *Cinnabar Marrow Replacing the Form*.\n\n**Song of the Golden Mercury Cinnabar Method**\nBury the mysterious crucible in warm ashes,\nBy nightfall the yellow sprout stands ready.\nNinefold-refined cinnabar fills the five viscera—\nSplit open, and your lifespan equals Heaven and Earth.\n\n**Xifang Zhongcheng Receives the Dao**\nXifang Zhongcheng followed Master Cui the Daoist for many years,\nReverent and meticulous, enduring hardships,\nUndergoing repeated trials without the slightest respite.\nThe Daoist said: “You may now receive the Dao.”\nA day was chosen for ascending the altar.\nZhongcheng lit incense at the furnace, swore an oath to Heaven,\nBowed twice, prostrated himself, and knelt to receive the teaching.\nMaster Cui addressed him:\n“In former times, the essence of immortality was transmitted to only one person.\nYet you possess the wind and bones of a transcendent—\nThough dwelling among the crowd, you stand apart, uniquely refined.\nNow I shall pass on the secrets entrusted by my immortal teacher:\nThe weights of medicinal ingredients, the guiding principles of fire timing,\nAll that I have heard, I transmit to you in full.\nIf you later encounter a man of flawless virtue and unwavering devotion to the Dao,\nYou may transmit it to him—\nJust as I have done for you, without concealment.”\nThereupon he bestowed the scripture of the *Four Transformations and Nine Revolutions*.\n\n**First Transformation: Settling the Embryo by Borrowing Darkness**\nMercury is the essence of Wood,\nOriginally the marrow of cinnabar.\nJust as it is about to emerge from the womb,\nIt requires the power of true yang.\nWithout the essence of correct yang,\nEven the true mother cannot restrain it.\nThe first transformation meets true yang—\nThis is called *Borrowing the Womb’s Darkness*.\n\n**Second Transformation: Yin Substance with a Yang Embryo**\nThe embryo harbors latent yang,\nYin lies hidden—do not forget for a moment.\nFurther relying on the congealed darkness of *geng*,\nPure yang guards the chamber.\nScholars must be meticulous,\nLest they idly boast of their own understanding.\nThe second transformation yields yang’s radiance,\nYet the face and form remain yin’s substance.\n\n**Third Transformation: The Six Spirits Subduing the Corpse**\nThe method of the Six Spirits of immortals,\nEver concealed by the perfected.\nFor three periods, nurtured by civil fire,\nInside and out—\nWith pure yang.\nFools forget to ponder,\nDying with vain regrets.\nThe third transformation refines the slippery nature,\nYang’s slaying completes the corpse.\n\n**Fourth Transformation: Cinnabar Marrow Replacing the Form**\nOne must recognize the two fundamental principles,\nThen true lead’s darkness flows freely.\nNurtured by gentle, wafting civil fire,\nIntermingling occurs in the Central Palace.\nAfter seven days, the Dao is fulfilled,\nGolden grains form naturally.\nThe treasure is completed through four transformations,\nCinnabar marrow replaces the form.\n\n**Song of Fire Timing**\nDay and night, *Tun* and *Meng* alternate as the two hexagrams—\nThen use the true mother to restrain true lead.\nImmortals fall silent at this point,\nForbidding ordinary minds from seeking with intent.\n\nThe blazing red golden elixir—mercury congeals into gold,\nTo return to true earth is to return to the real.\nFor three periods, the fire timing must be sealed tightly,\nLest glory lead to ruin and the loss of one’s self.\n\nThe secret transmission’s divine method is self-verified—\nOnly then does one trust that within the mysterious, another master exists.\nSeizing the Tiger and Dragon to return to the correct earth,\nNaturally, the transformations give birth to the infant.\n\n**The True Mystery**\nGreat indeed is the wondrous method,\nComing from self-verification.\n\nNot departing from the two flavors—one male, one female.\nThe male is called true lead, the female true mercury.\nPaired in the Central Palace, they naturally resonate and respond.\nWhen *Jiji* is achieved, even *Weiji* may suffice.\nWithout losing the three periods, cease the fire after seven days.\nWithin the crucible, gold increases—all depends on the Dao-mind.\n\nThe Azure Dragon soars and leaps, the White Tiger is restrained and captured.\nOne restrains, one subdues, alternating as mother and child.\nWhen the nine cycles are complete, the yellow sprout emerges of itself.\nOnce the yellow sprout is obtained, the immortal has a home.\nAgain it is born, again it is produced—the Azure Dragon returns to cinnabar.\nA single grain of cinnabar—first offer it to heaven and earth,\nThen take it for oneself, forever escaping the register of death.\nThe fowl feeds and becomes a phoenix, the serpent transforms into a dragon.\n\nAll this I transmit face-to-face, the work of eighty-one days.\nIn the past, I received it from my teacher—all depends on fire timing.\nIf the fire timing is not off, one immediately becomes golden radiance.\nIf the fire timing is amiss, one drifts endlessly without bound.\nThe fire timing has its secrets—now I tell them to you,\nBut once obtained, do not reveal them to others.\nIf I did not speak, I would fear severing heaven’s root.\nIn the West, Zhongcheng completed it—profound indeed is this text.\n\n**Song of the Treasure**\nPeople of the world treasure gold and jade,\nYet know not what truly sustains them.\nSome delight in fine food and coarse fare,\nOthers in splendid palaces—\nA thousand clever schemes they devise,\nYet all are but empty deceit.\nWhy not refine the returning elixir,\nThat life may be endless?\n\n**Song of Elixir-Refining**\nThe great medicine is none other than *jia* and *geng*;\nWhen refined, brother and sister become intimate.\nI bid you observe: when the elixir is complete,\nA crane cries across ten thousand *li* of heaven and earth.\n\n**Secret Formula for Elixir-Refining**\nThe good has no head, the cauldron has no ears.\n*Geng* is the outer, *xin* the inner.\nThe vermilion-clad child, the red marrow—\nNo other substance is needed for direct refinement,\nOnly water and fire matched in harmony.\n\nMercury alone, nothing else—\nFirst it becomes bone, then flesh.\nBone and flesh depend on each other, transforming into kinship.\nFrom this, the river chariot may freely come and go.\nGold transforms into gold, silver into silver—\nHow could there be any other divine immortals?\nBeyond three degrees of refinement and division,\nEven the ancestral lineage is but dust and noise.\n\nSparrows do not hatch phoenixes, foxes and hares do not nurse horses.\nWithout true father and mother, all that is born is false.\n\n**Method of Piercing the Heart and Establishing Restraint**\nHeaven pierces the heart, earth establishes restraint.\nThe eight minerals vanish, the five metals become kin.\nTo dry cinnabar mercury, one must borrow ancestral *qi*.\nNurture the fire for seven days—*Jiji* is reversed.\nNurture it again for seven days—pouring, soaking, and refining.\n\n**Transmission Formula**\nLong ago, my late teacher warned me:\n“The wonder of this art can ascend to golden elixir.\nBut if one’s fortune is meager, it may only become the supreme treasure.”\nHe also said: “For the noble, obtaining it is good fortune;\nFor the petty, obtaining it is misfortune.”\n*The Classic of Yin Conformity* states:\n“The noble one who obtains it endures hardship;\nThe petty one who obtains it treats life lightly.”\nIndeed, when a Daoist obtains it, the heart is enriched—\nEven if the body is poor, it is still good.\nThe petty person, however, says:\n“Life and death are the common lot of humanity.\nHow could insensate metal and stone transform sentient flesh and blood?”\nThey only seek wealth for their household, glory for their person,\nGrand dwellings and fine chambers,\nPowdered faces and painted brows,\nFeasts spread before them,\nSong and dance on embroidered mats,\nWine to satiety, meat to repletion,\nIndulging their appetites without restraint.\nOne day, heaven’s retribution arrives—\nThe teacher who transmitted it before is also implicated.\nHow can one not be cautious?\n\nIf you abandon the noble’s conduct and adopt the petty person’s views,\nNot only will you bring calamity upon yourself—\nHow could I face my late teacher in the heavens above?\nThe immortal masters of past generations never failed to issue solemn warnings.\nHow dare I not stand in awe?\n\nAfter transmission, you must take heed and be vigilant,\nThat fortune and emolument may endure without fail.\n\nXi Fang Zhongcheng transmitted it to Dai Daoheng.\nOn the night of the *jiazi* day, the seventh of the Shangyuan festival,\nFacing south toward the Western Direction, toward the Northern Dipper,\nDaoheng knelt and sought the transmission of the immortal’s art.\nHe was told:\n“Long ago, Immortal Ge transmitted it to Zheng Siyuan,\nWho transmitted it to Ge Zhichuan—Zhichuan was the immortal’s descendant.\nThe immortal did not transmit it to his son but to Siyuan.\nWhat was his intent?\nAmong those who refine the elixir themselves,\nThere is no principle of transmission to father, son, or brother.\nZhichuan’s devotion to his father’s will,\nSiyuan’s repayment of his teacher’s virtue—\nThis was truly a perfect fulfillment of both.\nYet how fitting were the transmissions of the various immortal masters,\nWho refined the elixir, cultivated, and attained the Dao!”\n\nNow I transmit the oral formulas of my late teacher,\nThe lineage of all the preceding texts,\nThe method of transmission and reception,\nAnd the secrets of the *Piercing the Heart and Establishing Restraint* technique.\nI also say: First, one may refine this;\nNext, refine the nine-cycled golden liquid returning elixir.\nBut one must await the guidance of a sage teacher before the great medicine can be completed.\n\nDaoheng bowed twice, prostrated himself, and expressed his gratitude:\n“Now that I have received your teachings, how dare I not reverently obey?”\nHe was deeply indebted to his teacher’s kindness,\nHoping that one day, having completed the nine-cycled cinnabar,\nHe might fully inherit it.\n\nDai Daoheng transmitted the *Art of the Vermilion Marrow Exchanging Form* to Yang Xu.\nDaoheng was of a solitary and pure nature, never conforming to the world.\nFrom his youth, he yearned for immortality, and his resolve only grew stronger.\nLater, he encountered a perfected one,\nWho transmitted to him the arts of golden mercury and cinnabar elixirs.\nSuddenly, it was as if he had found a shortcut to completion—\nPiercing the heart and establishing restraint,\nHe grasped the principle of true correctness.\nOne could say he had deep insight and profound virtue.\nAt first, he did not wish others to know.\nLater, two brothers from the same prefecture, Yang Xu and his sibling,\nStudied the Dao and their merit and virtue grew daily more evident.\nThey knew Dai was no ordinary man,\nAnd so devoted themselves wholeheartedly to serving him, unwavering for years.\nDai also knew that the Yang brothers were extraordinary,\nDestined by fate for immortality.\nThus, he chose a day to transmit all the elixir formulas,\nAlong with what he had personally realized—\nOne could say he had found the right person to transmit to.\nThe Dao was now complete, its wonders beyond compare.\n\n**Song of the Golden Elixir by Zhenyi Zi**\nThe great Dao gave birth to my body,\nYin and Yang lodged within my form.\nEntrusted to the space between heaven and earth,\nLife and death alternate in their course.\n\nThe gate lies within life and death,\nEach path diverges in its course.\nOne gate dwells in yin’s stillness,\nWithin it, the numinous is quiescent.\nCultivating the spirit within yin—\nThis is the Western method.\nAnother Way exists within yang,\nIts wondrous secrets held in immortal texts.\nIt points directly to the root of heaven and earth,\nThis root is called the True One.\nBorn before heaven and earth,\nBy which heaven and earth then opened.\nBid men to gather and accumulate it,\nRefine it within the chamber of geng and xin.\nSummon the dragon within wood,\nSeal its mouth to ensure harmony.\nSuddenly they become husband and wife,\nGradually giving birth to boy and girl.\nAfter ten months, the elder and younger are complete,\nAll transforming into golden liquid.\nThe golden liquid becomes the divine elixir,\nConsuming it, heaven and earth are fulfilled.\nI speak this fully to my fellow practitioners—\nWhere shall you turn your intent to seek it?\nThe sun and moon speed like the wind,\nThirty-six thousand days pass in haste.\n\nMaster Cui the Yellow-Crowned’s Eulogy:\nGreat indeed is the supreme Dao,\nThe root of heaven and earth.\nMoving through the True One,\nIt opens the wondrous gate.\nThe divine elixir’s transformations,\nIts firing times are not complex.\nDraw forth the true mercury,\nPair it with true lead.\nAbove heaven, below earth,\nThe sun and moon traverse their paths.\nCold and heat drive the divisions,\nForming south and north.\nEast and west converge,\nMercury white, lead red.\nConsuming the cinnabar elixir,\nThe immortals have their abode.\n\nCollated and verified by the Perfected One of Ya River.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "稚川真人校证术 经名：雅川真人校证术。 撰人不详，约出於五代以徒。 一卷。 底本出处：《正统道藏》洞神部众术类。 稚川真人校证术 先天图 不录 系系传授图川客杨么杨、旭周化写毫隐名无传燕山孟先生无传 先天论 夫物禀先天之黑，位属庚辛，上应太白金星，是谓西王母，产出南方赤凤髓，是谓后天，号曰金铅，又日美金华，又曰铅白霜，又日金液。 炼以万钧之火，终不能使之枯。 遇土则燥，圣功出焉。 合母则成，胚胎生焉，骨肉生焉。 此则定造化无中生有，金伐木荣，此其义也。 四象备，中央为之主。 三家聚，中宫为之宝。 宝主之义，非造大丹之妙，而未易明。 此淮南王炼秋石，以产无穷之宝。 故上帝惜之，而又哀悯众生，万劫一传得之，得者非宿有仙骨，苟传非人，殃及九祖。 玄科日：秘天道，泄大宝，罪所不赦。 真诀云 雄裹内含雌质，负阴却抱阳精。 四象全凭调燮，土金产出黄金。 大药证日 炼粉为铅，化石为尘。 自然火化，去铅取丹。 更入华池，还源还色。 再入神室，更养以火。 全六十日，成金液丹，服之神仙。 秘文 夫修大丹，与天地造化同途。 故太易在太素之前，虽含虚至妙，则来立兆萌。 太极在太乙之先，故有昆成，乃混沌也。 中有太乙之精，为天地之母，为万物之始。 一黑既分，二仪斯判，然后有乾坤焉，有阴阳焉，有三才五行焉，有五金八石焉。 修丹者以乾坤为鼎器，以人民为药物，盗阴阳变化之机，精调水火，循坎高否泰之理，苦历星霜，动则起於阳九，静则起於阴六，此修丹之大旨也。 葛仙翁述神室吟 浅深神室铸新成，内外安排别有名。",
      "translated_text": "**Master Zhichuan’s Verification of the Arts**\n*Text Title:* *Master Yachuan’s Verification of the Arts*\nAuthor unknown, approximately dating to the Five Dynasties period. One scroll.\nBase text from: *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, *Zhongshu* Category.\n\n---\n\n**Master Zhichuan’s Verification of the Arts**\n\n**Precelestial Diagram**\n*[Not included]*\n\n**Lineage Transmission Diagram**\nChuanke Yang Yao → Yang Xu Zhouhua → [Anonymous disciple from] Maoyin → Master Meng of Yanshan (no transmission recorded)\n\n---\n\n**On the Precelestial**\nAll things endowed with precelestial *qi* occupy the positions of *geng* and *xin*, corresponding above to the Great White Star of Metal (Venus). This is called the Queen Mother of the West. It produces the marrow of the Red Phoenix of the South—this is the postcelestial, named *Metal Lead*, also called *Radiant Golden Essence*, *Lead White Frost*, or *Golden Liquor*.\n\nRefined with the fire of ten thousand *jun*, it can never be exhausted. When it encounters earth, it dries; therein lies the sage’s work. United with its mother, it takes form; therein the embryo is born, and flesh and bone arise. This is the fixed principle of creation: from nothing, something arises. Metal subdues Wood, and Wood flourishes—such is its meaning.\n\nWhen the Four Symbols are complete, the Center presides as master. When the Three Families gather, the Central Palace becomes the treasure. The meaning of \"treasure and master\" is not the subtlety of the Great Elixir, yet it is not easily understood.\n\nThis is what the Prince of Huainan refined as *Autumn Stone*, yielding inexhaustible treasure. Thus the Lord of Heaven cherishes it, and in compassion for sentient beings, transmits it but once in ten thousand kalpas. Those who receive it must possess the innate bone of immortals; if transmitted to the unworthy, calamity befalls nine generations.\n\nThe *Mysterious Statutes* state: \"To reveal the Dao of Heaven or divulge the Great Treasure is a crime beyond absolution.\"\n\n**True Oral Instructions**\nWithin the male lies the essence of the female,\nBearing yin yet embracing yang’s purity.\nThe Four Symbols depend on harmonious blending;\nEarth and Metal yield forth yellow gold.\n\n**Testimony of the Great Medicine**\nRefine powder into lead,\nTransform stone into dust.\nBy natural fire, transmute;\nRemove the lead to obtain the cinnabar.\nThen enter the *Flowery Pond*,\nReturning to the source, restoring its hue.\nRe-enter the *Spirit Chamber*,\nNurtured again by fire.\nAfter sixty days,\nThe *Golden Liquor Elixir* is complete.\nConsumed, it bestows immortality.\n\n**Secret Writings**\nThe cultivation of the Great Elixir follows the same path as Heaven and Earth’s creation. Thus, *Taiyi* exists before *Taisu*; though it contains the most subtle emptiness, it gives rise to the first signs of manifestation. *Taiji* precedes *Taiyi*, and so there is *Kun* and *Cheng*—this is primordial chaos. Within it lies the essence of *Taiyi*, mother of Heaven and Earth, origin of the myriad things.\n\nOnce the One *qi* divides, the Two Modes separate. Then arise Qian and Kun, yin and yang, the Three Powers and Five Phases, the Five Metals and Eight Stones. The alchemist takes Qian and Kun as the crucible and vessel, and human beings as the medicinal ingredients. They steal the mechanism of yin-yang transformation, refining water and fire with precision, following the principles of *Kan*, *Li*, *Pi*, and *Tai*. Through bitter years of toil, in motion they rise with the Nine Yangs, in stillness they arise with the Six Yins—such is the great purport of elixir cultivation.\n\n**Ode to the Spirit Chamber by Immortal Ge**\nShallow or deep, the Spirit Chamber is newly forged,\nWithin and without, its arrangements bear secret names.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 651,
      "start_sentence": 0,
      "end_sentence": 37,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.091957330703735,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\稚川真人校证术.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "白虎但将龙共配，青龙还与虎同行。 二仪本是金和合，万象皆由土发生。 玄了又玄真了了，九重城裹有谁争。 秘诀渊原 真铅，生庚。 真汞，生亥。 其法二因，汞以阳为，庚以阴制，配合中宫。 上下火炽，转作丹基，一七之日。 无名氏以传三人，至崔黄冠。 名日金汞丹术，在世九十余年，后不知所终。 其法四变，一变名就胎借黑，二变名阴质阳胎，三变名六神伏尸，四变名朱髓换形。 金汞丹砂术歌曰 灰埋玄鼎火温灰，一夕黄芽立可济。 九转丹砂成五内，剖开寿永齐天地。 西方仲成授道 西方仲成，从崔黄冠岁久，恭敬谨恪，屡经艰苦，每遭验试，略无少息。 黄冠日：子可受道矣。 遂择日登坛。 仲成灶香盟天，再拜稽首，跪而授道。 崔公及告之曰：昔求仙旨，正传一人。 为尔仙风道骨，虽处稠人之中，超然独异，今将仙师所传之秘，药物斤两，火候指归，全其所闻。 汝后若遇德行谨备、酷志学道之士，方可传之。 亦如余之授子，无所隐焉。 遂授四变九转之经。 一变就胎借黑 汞乃木之精，本是朱之髓。 恰欲出胎时，要借真阳力。 不得正阳精，真母亦难制。 一变感真阳，此谓借胎黑。 二变阴质阳胎 胎孕以潜阳，阴伏莫暂忘。 更籍结庚黑，纯阳守洞房。 学者须子细，莫馒夸胸臆。 二变得阳晶，面目为阴质。 三变六神伏尸 神仙六神法，上真常秘藏。 三时文火养，表裹。 以纯阳。 愚夫莫忘思，至死空嗟咨。 三变流滑性，阳煞以成尸。 四变朱髓换形 须识二因宗，真铅黑便通。 氤氲文火养，交感在中宫。 七日道方毕，金栗自然成。 成宝终四变，朱髓换其形。 火候歌 昼夜屯蒙翻二卦，便将真母制真铅。 神仙到此多缄口，不许寻常着意寻。 赫赤金丹汞结金，要归真土惭归真。 三时火候牢封闭，勿使荣高却丧身。 秘传神法自校证，方信玄中别有师。 捉得虎龙归正土，自然造化有婴儿。 真奥 伟哉妙法，来自校证。",
      "translated_text": "The White Tiger is paired only with the Dragon,\nThe Green Dragon still walks alongside the Tiger.\nThe Two Modes are originally the union of Metal,\nAll phenomena arise from Earth’s generation.\n\nMysterious beyond mystery, truly luminous and clear—\nWho in the nine-fold city could contest this?\nSecret teachings trace their source:\nTrue Lead is born in *geng*,\nTrue Mercury in *hai*.\nTheir method rests on two principles:\nMercury is governed by yang,\n*Geng* is restrained by yin,\nTogether they unite in the Central Palace.\nAbove and below, the fire blazes,\nTransforming the foundation of the elixir—\nOn the seventeenth day.\n\nAn anonymous master transmitted this to three disciples,\nReaching Master Cui the Daoist.\nNamed the *Golden Mercury Elixir Method*,\nHe practiced it for over ninety years,\nThen vanished without trace.\n\nIts method undergoes four transformations:\nFirst, *Borrowing the Womb’s Darkness to Settle the Embryo*;\nSecond, *Yin Substance with a Yang Embryo*;\nThird, *The Six Spirits Subduing the Corpse*;\nFourth, *Cinnabar Marrow Replacing the Form*.\n\n**Song of the Golden Mercury Cinnabar Method**\nBury the mysterious crucible in warm ashes,\nBy nightfall the yellow sprout stands ready.\nNinefold-refined cinnabar fills the five viscera—\nSplit open, and your lifespan equals Heaven and Earth.\n\n**Xifang Zhongcheng Receives the Dao**\nXifang Zhongcheng followed Master Cui the Daoist for many years,\nReverent and meticulous, enduring hardships,\nUndergoing repeated trials without the slightest respite.\nThe Daoist said: “You may now receive the Dao.”\nA day was chosen for ascending the altar.\nZhongcheng lit incense at the furnace, swore an oath to Heaven,\nBowed twice, prostrated himself, and knelt to receive the teaching.\nMaster Cui addressed him:\n“In former times, the essence of immortality was transmitted to only one person.\nYet you possess the wind and bones of a transcendent—\nThough dwelling among the crowd, you stand apart, uniquely refined.\nNow I shall pass on the secrets entrusted by my immortal teacher:\nThe weights of medicinal ingredients, the guiding principles of fire timing,\nAll that I have heard, I transmit to you in full.\nIf you later encounter a man of flawless virtue and unwavering devotion to the Dao,\nYou may transmit it to him—\nJust as I have done for you, without concealment.”\nThereupon he bestowed the scripture of the *Four Transformations and Nine Revolutions*.\n\n**First Transformation: Settling the Embryo by Borrowing Darkness**\nMercury is the essence of Wood,\nOriginally the marrow of cinnabar.\nJust as it is about to emerge from the womb,\nIt requires the power of true yang.\nWithout the essence of correct yang,\nEven the true mother cannot restrain it.\nThe first transformation meets true yang—\nThis is called *Borrowing the Womb’s Darkness*.\n\n**Second Transformation: Yin Substance with a Yang Embryo**\nThe embryo harbors latent yang,\nYin lies hidden—do not forget for a moment.\nFurther relying on the congealed darkness of *geng*,\nPure yang guards the chamber.\nScholars must be meticulous,\nLest they idly boast of their own understanding.\nThe second transformation yields yang’s radiance,\nYet the face and form remain yin’s substance.\n\n**Third Transformation: The Six Spirits Subduing the Corpse**\nThe method of the Six Spirits of immortals,\nEver concealed by the perfected.\nFor three periods, nurtured by civil fire,\nInside and out—\nWith pure yang.\nFools forget to ponder,\nDying with vain regrets.\nThe third transformation refines the slippery nature,\nYang’s slaying completes the corpse.\n\n**Fourth Transformation: Cinnabar Marrow Replacing the Form**\nOne must recognize the two fundamental principles,\nThen true lead’s darkness flows freely.\nNurtured by gentle, wafting civil fire,\nIntermingling occurs in the Central Palace.\nAfter seven days, the Dao is fulfilled,\nGolden grains form naturally.\nThe treasure is completed through four transformations,\nCinnabar marrow replaces the form.\n\n**Song of Fire Timing**\nDay and night, *Tun* and *Meng* alternate as the two hexagrams—\nThen use the true mother to restrain true lead.\nImmortals fall silent at this point,\nForbidding ordinary minds from seeking with intent.\n\nThe blazing red golden elixir—mercury congeals into gold,\nTo return to true earth is to return to the real.\nFor three periods, the fire timing must be sealed tightly,\nLest glory lead to ruin and the loss of one’s self.\n\nThe secret transmission’s divine method is self-verified—\nOnly then does one trust that within the mysterious, another master exists.\nSeizing the Tiger and Dragon to return to the correct earth,\nNaturally, the transformations give birth to the infant.\n\n**The True Mystery**\nGreat indeed is the wondrous method,\nComing from self-verification.",
      "overlap_context": "gs as the medicinal ingredients. They steal the mechanism of yin-yang transformation, refining water and fire with precision, following the principles of *Kan*, *Li*, *Pi*, and *Tai*. Through bitter years of toil, in motion they rise with the Nine Yangs, in stillness they arise with the Six Yins—such is the great purport of elixir cultivation.\n\n**Ode to the Spirit Chamber by Immortal Ge**\nShallow or deep, the Spirit Chamber is newly forged,\nWithin and without, its arrangements bear secret names.",
      "start_char": 652,
      "end_char": 1447,
      "start_sentence": 38,
      "end_sentence": 91,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.036553382873535,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\稚川真人校证术.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "不离二味，一雄一雌。 雄曰真铅，雌日真汞。 配合中宫，自然交应。 既济乃成，未济亦可。 不失．三时，七日息火。 鼎内增金，全凭道心。 青龙飞跃，白虎制擒。 一制一伏，番为子母。 九转数．足，黄芽自出。 既得黄芽，神仙有家。 再生再产，青龙返砂。 丹砂一粒，先祭天地。 后为己服，永出死籍。 鸡餐成凤，蛇化为龙。 吾皆面传，九九之功。 昔因师授，全凭火候。 火候不差，立作金华。 火候有差，邈焉无涯。 火候有诀，今为汝说，既得勿为人泄。 我若不言，恐绝天根。 西方仲成，秘哉斯文。 所以宝歌 世人宝金玉，不知其所已。 或以美梳糙，或者美宫室，千纵巧施为，未免皆虚诳。 何不作还丹，寿命无穷已。 炼丹歌 大药无过甲与庚，炼成兄女得相亲。 教君看取丹成后，万里乾坤一鹤呜。 炼丹秘诀 良无头，釜无耳，庚为表，辛为裹。 朱衣子，红钻髓，更无别物直下制，惟有水火相匹配。 水银一味别无物，先作骨兮后作肉。 骨肉相依化作亲，从此河车任往复。 金化金兮银化银，何曾更有别圣神。 转制分胎三度外，更兼宗祖是嚣尘。 燕雀不生凤，狐兔不乳马。 若无真父母，所生俱是假。 穿心立制法 天为穿心，地为立制。 八石消亡，五金同类。 欲乾朱汞，必假祖气。 养火七日，翻复既济。 再养七日，浇淋渗制。 传后式 畴昔先师尝戒余日：此术之妙，可登金丹。 或者福薄，止为至宝。 又日：君子得#1之幸，小人得之不幸。 《阴符经》云：君子得之固穷，小人得之轻命。 盖道人得之心富矣，身贫固亦善矣。 小人则日：有生有死，人之常理。 岂有无情之金石，能化有情之血肉耶。 但能家富身荣，华居丽室，粉白黛绿，食前方丈，歌舞绮筵，厌酒饱肉，恣极其饮，略不回互。 一日一天谴，前日所授之师，亦招咎焉，可不慎欤。 汝苟弃君子之行，小人之见，不独汝辈有祸，吾独何面目，见先师於上天乎。 昔祖代仙师，未尝不造戒叮咛，余敢不惧焉。 既传之后，汝宜鉴戒，福禄无替。 西方仲成传戴道亨，是夜甲子上元七日，西方面南，向北斗。 道亨长跪求授仙卫，乃告之日：昔葛仙前传郑思远，传葛稚川，稚川乃仙翁裔也。 仙翁不传之子，而传#2思远，其意何如。 盖自修丹之士，则於父子兄弟之亲，无有传者之理也。 如稚父之志，思远报师之德，可谓两全其美矣。 然诸仙祖师，自炼丹修养成道，何其传授之当也。 今将先师口诀，已上诸文传派，受授之法，及穿心立制手法之秘。 又言此术先可作，次作九转金液还丹，待须圣师指示，然后能成大药。 道亨再拜，稽首而谢日：今蒙垂教，敢不奉谨。 皆叨师瘾，万一有成九转丹砂，毕继而受之也。 戴道亨传杨旭，名朱髓换形丹术。 道亨禀性孤洁，木与世合。 冠年慕仙，夙志愈坚，后遇真人，前后之传金汞丹卫，释然有似得其捷径而成，穿心立制，便得正真之理，可谓识之深德之厚也。 初不欲人知觉，后有同郡杨旭兄弟二人，学道日远，功德深着。 心知戴公非常人，遂笃志尽心以奉焉，岁久不倦。 戴公亦知杨旭兄弟不凡，夙有仙契。 遂择日尽授丹诀，及所自悟者，可谓传得其人，其道略则略矣，已妙无加焉。 真一子金丹歌 大道生吾身，阴阳寄吾质。 托身天地问，死生互相历。",
      "translated_text": "Not departing from the two flavors—one male, one female.\nThe male is called true lead, the female true mercury.\nPaired in the Central Palace, they naturally resonate and respond.\nWhen *Jiji* is achieved, even *Weiji* may suffice.\nWithout losing the three periods, cease the fire after seven days.\nWithin the crucible, gold increases—all depends on the Dao-mind.\n\nThe Azure Dragon soars and leaps, the White Tiger is restrained and captured.\nOne restrains, one subdues, alternating as mother and child.\nWhen the nine cycles are complete, the yellow sprout emerges of itself.\nOnce the yellow sprout is obtained, the immortal has a home.\nAgain it is born, again it is produced—the Azure Dragon returns to cinnabar.\nA single grain of cinnabar—first offer it to heaven and earth,\nThen take it for oneself, forever escaping the register of death.\nThe fowl feeds and becomes a phoenix, the serpent transforms into a dragon.\n\nAll this I transmit face-to-face, the work of eighty-one days.\nIn the past, I received it from my teacher—all depends on fire timing.\nIf the fire timing is not off, one immediately becomes golden radiance.\nIf the fire timing is amiss, one drifts endlessly without bound.\nThe fire timing has its secrets—now I tell them to you,\nBut once obtained, do not reveal them to others.\nIf I did not speak, I would fear severing heaven’s root.\nIn the West, Zhongcheng completed it—profound indeed is this text.\n\n**Song of the Treasure**\nPeople of the world treasure gold and jade,\nYet know not what truly sustains them.\nSome delight in fine food and coarse fare,\nOthers in splendid palaces—\nA thousand clever schemes they devise,\nYet all are but empty deceit.\nWhy not refine the returning elixir,\nThat life may be endless?\n\n**Song of Elixir-Refining**\nThe great medicine is none other than *jia* and *geng*;\nWhen refined, brother and sister become intimate.\nI bid you observe: when the elixir is complete,\nA crane cries across ten thousand *li* of heaven and earth.\n\n**Secret Formula for Elixir-Refining**\nThe good has no head, the cauldron has no ears.\n*Geng* is the outer, *xin* the inner.\nThe vermilion-clad child, the red marrow—\nNo other substance is needed for direct refinement,\nOnly water and fire matched in harmony.\n\nMercury alone, nothing else—\nFirst it becomes bone, then flesh.\nBone and flesh depend on each other, transforming into kinship.\nFrom this, the river chariot may freely come and go.\nGold transforms into gold, silver into silver—\nHow could there be any other divine immortals?\nBeyond three degrees of refinement and division,\nEven the ancestral lineage is but dust and noise.\n\nSparrows do not hatch phoenixes, foxes and hares do not nurse horses.\nWithout true father and mother, all that is born is false.\n\n**Method of Piercing the Heart and Establishing Restraint**\nHeaven pierces the heart, earth establishes restraint.\nThe eight minerals vanish, the five metals become kin.\nTo dry cinnabar mercury, one must borrow ancestral *qi*.\nNurture the fire for seven days—*Jiji* is reversed.\nNurture it again for seven days—pouring, soaking, and refining.\n\n**Transmission Formula**\nLong ago, my late teacher warned me:\n“The wonder of this art can ascend to golden elixir.\nBut if one’s fortune is meager, it may only become the supreme treasure.”\nHe also said: “For the noble, obtaining it is good fortune;\nFor the petty, obtaining it is misfortune.”\n*The Classic of Yin Conformity* states:\n“The noble one who obtains it endures hardship;\nThe petty one who obtains it treats life lightly.”\nIndeed, when a Daoist obtains it, the heart is enriched—\nEven if the body is poor, it is still good.\nThe petty person, however, says:\n“Life and death are the common lot of humanity.\nHow could insensate metal and stone transform sentient flesh and blood?”\nThey only seek wealth for their household, glory for their person,\nGrand dwellings and fine chambers,\nPowdered faces and painted brows,\nFeasts spread before them,\nSong and dance on embroidered mats,\nWine to satiety, meat to repletion,\nIndulging their appetites without restraint.\nOne day, heaven’s retribution arrives—\nThe teacher who transmitted it before is also implicated.\nHow can one not be cautious?\n\nIf you abandon the noble’s conduct and adopt the petty person’s views,\nNot only will you bring calamity upon yourself—\nHow could I face my late teacher in the heavens above?\nThe immortal masters of past generations never failed to issue solemn warnings.\nHow dare I not stand in awe?\n\nAfter transmission, you must take heed and be vigilant,\nThat fortune and emolument may endure without fail.\n\nXi Fang Zhongcheng transmitted it to Dai Daoheng.\nOn the night of the *jiazi* day, the seventh of the Shangyuan festival,\nFacing south toward the Western Direction, toward the Northern Dipper,\nDaoheng knelt and sought the transmission of the immortal’s art.\nHe was told:\n“Long ago, Immortal Ge transmitted it to Zheng Siyuan,\nWho transmitted it to Ge Zhichuan—Zhichuan was the immortal’s descendant.\nThe immortal did not transmit it to his son but to Siyuan.\nWhat was his intent?\nAmong those who refine the elixir themselves,\nThere is no principle of transmission to father, son, or brother.\nZhichuan’s devotion to his father’s will,\nSiyuan’s repayment of his teacher’s virtue—\nThis was truly a perfect fulfillment of both.\nYet how fitting were the transmissions of the various immortal masters,\nWho refined the elixir, cultivated, and attained the Dao!”\n\nNow I transmit the oral formulas of my late teacher,\nThe lineage of all the preceding texts,\nThe method of transmission and reception,\nAnd the secrets of the *Piercing the Heart and Establishing Restraint* technique.\nI also say: First, one may refine this;\nNext, refine the nine-cycled golden liquid returning elixir.\nBut one must await the guidance of a sage teacher before the great medicine can be completed.\n\nDaoheng bowed twice, prostrated himself, and expressed his gratitude:\n“Now that I have received your teachings, how dare I not reverently obey?”\nHe was deeply indebted to his teacher’s kindness,\nHoping that one day, having completed the nine-cycled cinnabar,\nHe might fully inherit it.\n\nDai Daoheng transmitted the *Art of the Vermilion Marrow Exchanging Form* to Yang Xu.\nDaoheng was of a solitary and pure nature, never conforming to the world.\nFrom his youth, he yearned for immortality, and his resolve only grew stronger.\nLater, he encountered a perfected one,\nWho transmitted to him the arts of golden mercury and cinnabar elixirs.\nSuddenly, it was as if he had found a shortcut to completion—\nPiercing the heart and establishing restraint,\nHe grasped the principle of true correctness.\nOne could say he had deep insight and profound virtue.\nAt first, he did not wish others to know.\nLater, two brothers from the same prefecture, Yang Xu and his sibling,\nStudied the Dao and their merit and virtue grew daily more evident.\nThey knew Dai was no ordinary man,\nAnd so devoted themselves wholeheartedly to serving him, unwavering for years.\nDai also knew that the Yang brothers were extraordinary,\nDestined by fate for immortality.\nThus, he chose a day to transmit all the elixir formulas,\nAlong with what he had personally realized—\nOne could say he had found the right person to transmit to.\nThe Dao was now complete, its wonders beyond compare.\n\n**Song of the Golden Elixir by Zhenyi Zi**\nThe great Dao gave birth to my body,\nYin and Yang lodged within my form.\nEntrusted to the space between heaven and earth,\nLife and death alternate in their course.",
      "overlap_context": "return to true earth is to return to the real.\nFor three periods, the fire timing must be sealed tightly,\nLest glory lead to ruin and the loss of one’s self.\n\nThe secret transmission’s divine method is self-verified—\nOnly then does one trust that within the mysterious, another master exists.\nSeizing the Tiger and Dragon to return to the correct earth,\nNaturally, the transformations give birth to the infant.\n\n**The True Mystery**\nGreat indeed is the wondrous method,\nComing from self-verification.",
      "start_char": 1447,
      "end_char": 2709,
      "start_sentence": 92,
      "end_sentence": 167,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.15917229652405,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\稚川真人校证术.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "死生中有门，门路各分格。 一门阴静中，於中是灵寂。 修成阴中神，此是西方术。 别有阳中道，妙秘在仙籍。 径指天地根，此根号真一。 生於天地先，天地因而辟。 令人采取积，炼为庚辛室。 邀取木中龙，A口之令契密。 忽然为夫妇，渐生男与女。 十月兄女成。 尽化为金液。 金液作神丹，饵之天地毕。 尽情告同人，何方留意觅。 日月疾如风，三万六千日。 崔黄冠赞曰 大哉至道，天地之根。 运乎真一，开通妙门。 神丹造化，火候不繁。 抽来正汞，配与真铅。 上天下地，日月经历。 寒暑驱分，得成南北。 会合束西，汞白铅赤。 饵之丹砂，神仙有家。 雅川真人校证术竟 ＃１『得』字原脱，据文义补。 ＃２『传一字原误作『得』。",
      "translated_text": "The gate lies within life and death,\nEach path diverges in its course.\nOne gate dwells in yin’s stillness,\nWithin it, the numinous is quiescent.\nCultivating the spirit within yin—\nThis is the Western method.\nAnother Way exists within yang,\nIts wondrous secrets held in immortal texts.\nIt points directly to the root of heaven and earth,\nThis root is called the True One.\nBorn before heaven and earth,\nBy which heaven and earth then opened.\nBid men to gather and accumulate it,\nRefine it within the chamber of geng and xin.\nSummon the dragon within wood,\nSeal its mouth to ensure harmony.\nSuddenly they become husband and wife,\nGradually giving birth to boy and girl.\nAfter ten months, the elder and younger are complete,\nAll transforming into golden liquid.\nThe golden liquid becomes the divine elixir,\nConsuming it, heaven and earth are fulfilled.\nI speak this fully to my fellow practitioners—\nWhere shall you turn your intent to seek it?\nThe sun and moon speed like the wind,\nThirty-six thousand days pass in haste.\n\nMaster Cui the Yellow-Crowned’s Eulogy:\nGreat indeed is the supreme Dao,\nThe root of heaven and earth.\nMoving through the True One,\nIt opens the wondrous gate.\nThe divine elixir’s transformations,\nIts firing times are not complex.\nDraw forth the true mercury,\nPair it with true lead.\nAbove heaven, below earth,\nThe sun and moon traverse their paths.\nCold and heat drive the divisions,\nForming south and north.\nEast and west converge,\nMercury white, lead red.\nConsuming the cinnabar elixir,\nThe immortals have their abode.\n\nCollated and verified by the Perfected One of Ya River.",
      "overlap_context": "that the Yang brothers were extraordinary,\nDestined by fate for immortality.\nThus, he chose a day to transmit all the elixir formulas,\nAlong with what he had personally realized—\nOne could say he had found the right person to transmit to.\nThe Dao was now complete, its wonders beyond compare.\n\n**Song of the Golden Elixir by Zhenyi Zi**\nThe great Dao gave birth to my body,\nYin and Yang lodged within my form.\nEntrusted to the space between heaven and earth,\nLife and death alternate in their course.",
      "start_char": 2709,
      "end_char": 3010,
      "start_sentence": 168,
      "end_sentence": 193,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.277981281280518,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\稚川真人校证术.txt",
        "category": "众术类"
      }
    }
  ]
}