{
  "source_id": "章献明肃皇后受上清毕法箓记",
  "source_file": "chunked_daozang\\章献明肃皇后受上清毕法箓记.json",
  "total_chunks": 2,
  "total_original_chars": 1432,
  "total_translated_chars": 9429,
  "total_translation_time": 51.33869481086731,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\谱箓类\\章献明肃皇后受上清毕法箓记.txt",
    "category": "谱箓类"
  },
  "full_translation": "**Record of Empress Zhangxian Mingsu’s Reception of the Shangqing Complete Dharma Register**\n\n**Text Title:** *Record of Empress Zhangxian Mingsu’s Reception of the Shangqing Complete Dharma Register*\n**Author:** Zhu Ziying of the Northern Song Dynasty\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, *Pulu* Category\n\n---\n\nComposed by the Altar-Consecrating Preceptor, Shangqing Great Cavern Master, Purple-Robed Servant Zhu Ziying:\n\nIn the fourth reign of the Song Dynasty’s Mandate, the third year of the *Shengjun Zaiyou* era, the August Empress Dowager Liu—whose essence was divided from the Nine Numinous, whose spirit was nurtured by the Three Primordials—ushered in an era of radiant prosperity and wielded the transformative power of treasured brilliance. Within, she cultivated harmony among the nine clans; without, she illuminated the myriad governance. Amidst the respite from ten thousand affairs, she dwelled in the realm beyond emptiness, her spirit congealing in the vast desert of the Supreme Void. Golden consorts swept the mats in the jade-green hall; jasper blossoms scattered fragrance in the chamber of vacant purity.\n\nYet she further stilled her spirit and calmed her thoughts, reciting the *Scripture of the Yellow Court’s* Two Luminaries. Her will and intent turned inward in cultivation, unwearied from dawn to dusk. Was this merely to restrain the hun and po? It accorded with the words of the loftiest sages, yet also aimed to return to the root and restore simplicity, thereby sheltering the multitudes under heaven. Thus, she contemplated the Three Pristine Ones, bowed to the Nine Perfected, and wore the sacred jade at her waist. The Southern Perfected gazed upon her with secret favor; the Queen Mother of the West appeared in subtle vision. The response of sweet dew was manifest by day; the merit of accumulation advanced by year. Truly, immortality may be learned, and the Dao does not operate in vain.\n\nStill, she reflected that her refined study remained insufficient to reach the source of the Dao. Having heard that the Purple Void Primordial Lady of Southern Marchmount, Lady Wei, had in the *Xingning* era of the Eastern Jin (Year of *Jiazi*) first received the *Shangqing Great Cavern Treasure Scripture*—a sacred text of secret transmission—from the King of Lesser Existence, the True Person Qingxu Wang of the Celestial King, which was then passed down to Yang the True Person, Assistant Director of Destiny on Maoshan, and subsequently to the Shangqing Immortal Marquis, Historian Xu, she resolved to trace this lineage. The numinous source and true transmission continued unbroken on Maoshan’s peaks; the immortal branches flourished, their fragrance spreading across the seas. Thereupon, she summoned the Feathered Transcendents of the Jade Clarity Luminous Response Abbey, the Profound and Wondrous Great Masters Huangfu Xiji and others, to follow the texts of Wang and Wei, and study the traditions of Yang and Xu.\n\nThey obtained the *Three Grades of Numinous Scriptures of Shangqing*, the *Hidden Writings of Jade Clarity*, the *Multitude of Secrets of the Nine Clarities*, along with the *Golden Spirit’s Two Tigers and Eight Luminaries Jade Record*, the *Supreme August Jade Taboo Register of the Primordial*, the *Flowing Gold Fire Bell and Returning Chariot Complete Dao Three Primordials Jade Tallies*, the *Nine Phoenixes’ Numinous Chapters*, the *Purple-Text White Sash*, the *Yellow Writings of the Grand Tenuity*, the *Jade Palace’s Numinous Flight Records*, and other texts totaling ten scrolls, as well as the *Golden Immortals and Jade Horses* in fifteen scrolls. In accordance with the regulations, they prepared golden dragons and jade fish, golden rams and silver horses, azure silk and golden knots, lotus-purchased brocade with phoenix patterns, plain silk from Nanhe, rosy clouds’ dust-sweeping gauze, crimson chapters’ corpse-repelling cloth, the Four Standards’ luminous mirror and spirit-quaking sword, the Five Colors’ silk robes transcending the world, Shangqing ritual vestments, and all requisite offerings for the covenant—nothing was omitted.\n\nFirst, she dispatched envoys bearing secret petitions to Southern Marchmount to present her request to the Purple Void Primordial Lady, who silently assented to the hidden decree. Then, she commanded the Palace Attendant of the Inner Court’s Western Service, Minister Kang Congzheng, the Palace Attendant and Director of the Inner Court’s Attendants, Minister Jiang Deyong of the Imperial Pharmacy, along with the Right Street Vice Daoist Registrar, Administrator of the Jade Clarity Luminous Response Abbey, and Concurrent Supervisor of Left and Right Street Religious Affairs, the Profound and True Great Master, Purple-Robed Servant Li Zhisun; the Left Street Supervisor and Abbot of Shouning Abbey, the Illuminated and True Great Master, Purple-Robed Servant Shi Zhizhang; the Vice Annual Administrator of the Jade Clarity Luminous Response Abbey, the Profound and Wondrous Great Master, Purple-Robed Servant Zhou Suiliang; the Abbot of the Jade Clarity Luminous Response Abbey, the Profound and Wondrous Great Master, Purple-Robed Servant Huangfu Xiji; and the Abbot of the Jade Clarity Luminous Response Abbey, the Profound and Secret Great Master, Purple-Robed Servant Xue Qinghe—all to jointly prepare yellow petitions and plain silk, and proceed to the Chongxi Abbey on Maoshan in Jiangning Prefecture to establish the Shangqing Imperial Altar. There, they inaugurated a seven-day-and-night jade register ritual, conducting thirty-six hundred *jiao* rites over the days, and transmitting the register in accordance with the regulations. Upon completion, they separately held a three-day-and-night thanksgiving ritual, offering a grand vegetarian feast for the Daoist priests and nuns of the mountain. They cast golden dragons and jade tablets into the Huayang Cavern, and dispatched them to the Golden Mountain Water Palace, thereby pledging alliance with the Seven Sages and expressing sincerity to the Nine Clarities. Thus, the rites of transmission were fulfilled, and the etiquette between master and disciple was exhausted.\n\nAt the outset, when the imperial carriage arrived, spirit cranes descended to welcome it beneath the feathered canopy. On the eve of the ritual’s establishment, rosy clouds spread afar in the night sky. As they lodged the true writ to invoke resonance and presented refined prayers to express devotion, the orchid oil’s flame flared brightly, and stars and moon gathered in brilliance. A hundred spirits received blessings and bestowed auspices; the Five Marchmounts guarded the numinous and offered felicity. By midnight, a gentle wind arose, followed by a sudden downpour. In an instant, the Silver River stood in ordered ranks, its bright orb gleaming like white jade. All declared that the Wind Earl had swept the altar, and the Rain Master had purified the seats—was this not fitting?\n\nOn the dawn of transmission, the radiance of the Nine Auroras flowed and shimmered, congealing in illumination; the misty qi of the Three Pristine Ones drifted and floated in the void. Phoenix canopies gathered; rainbow banners shone; feathered regalia flickered; ten thousand spirits stood in solemnity. As the golden tallies were distributed and the covenants aligned, white cranes soared above the altar, and red auroras circled in the sky. Orchid winds caressed the people; numinous fragrance suffused the wilds. The onlookers stood like a wall, none failing to marvel.\n\nAlas! The gates to the myriad wonders are many, yet learning proceeds in order; the utmost numinous is without form, yet resonance requires no waiting. Herein lies the Empress Dowager’s devotion and sincerity. She harmonized with the firm and yielding, served humans and spirits, summoned transcendent immortals, and aligned with the hidden mysteries. Without the virtue accumulated over vast kalpas, without the supreme fruits of countless lives, who could attain such heights?\n\nThus it is known: when one excels in a good beginning, beauty follows; when one completes plans with the Dao, what cause is there for concern that it will not be perfect? For such as this, the chariot of Eight Radiant Flying Auroras, the feast of Three Primordials Flowing Clouds, the treasures of Ten Essences Returning Waters, and the delicacies of Nine-Hued Phoenix Brains—all shall be summoned without delay.\n\nWith reverence, we consider the sagely intent: upholding the secret scriptures as if they were divine, desiring thereby to manifest devotion to the Vast Heaven, to safeguard the True Sovereign, to secure the imperial lineage for ten thousand generations, and to bless the common people with triple harvests. May weapons of war be stilled forever, and all together partake in abundance and longevity. As for the calculations of the Later Heaven, the boundless mandate, the far-reaching golden branches, and the gifts bestowed upon the black-haired people—how fitting it is!\n\nObserving the accomplishments of this era and examining what the hundred kings have left unrecorded, we faithfully set down this account with an unadorned brush.\n\nRecorded on the twenty-third day of the fourth month, the day *gengchen*, in the second year of the Tiansheng reign, the *jiazi* year. *The Record of Empress Zhangxian Mingsu Receiving the Shangqing Complete Method Register is hereby concluded.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "章献明肃皇后受上清毕法箓记 经名：章献明肃皇后受上清毕法箓记。 北宋朱自英撰。 底本出处：《正统道藏》洞神部谱录类。 章献明肃皇后受上清毕法箓记 临坛度师上清大洞法师赐紫臣朱自英撰 皇宋应运之四叶，圣君在宥之三年。 圣母皇太后刘氏，九灵分粹，三元毓神之三，流光开泰之期，握宝盛明之化。 内以肃雍九族，外以缉熙庶政，万机之暇，宅心虚无之表，凝神太漠之乡，金妃拂筵于琳碧之堂，玉华散馨于虚白之室。 而又澄神澹思，诵《黄庭》二景之经，志意内修，晨夕忘倦，岂独拘魂制魄。 上符高圣之言，盖亦务本还淳，下荫普天之众，于以观三素思。 九真揖仪，璘饭当佩，南真依烯而密盼，西母彷佛以冥观，胖蜜之应，继日而昭，积累之功，卜年而进，信乎仙可学而道不虚行矣。 仍念研精尚鲜，未臻道源，闻南岳紫虚元君魏夫人，昔以束晋兴宁元年甲子岁，先小有天王清虚王真人所受《上清大洞宝经》，灵文秘录，降传于茅山束华上佐司命杨真人，洎上清仙侯许长史。 迄后灵源真系继踵茅峰，逍叶仙枝流芳寰海，县是乃诏玉清昭应官羽人冲妙大师皇甫希及等。 迹王魏之文，研杨许之边。 ．得上清三品神经，玉清隐书，九清众秘，洎金神二虎八景玉录，上皇玉讳元始谱录，流金火铃回车毕道三元玉检，九凤灵章，紫纹白带，太微黄书，琼宫灵飞等录，共一十卷，金仙玉马等一十五卷。 依科备办金龙玉鱼、金羊银马，青丝金纽，蕾买锦凤纹，南和之素，碧霞拂尘之罗，绛章落尸之帛，四规明照景震灵剑，五色缯彩脱世衣裳，上清法服，盟文礼物，莫不周悉。 先遣中使资密辞往南岳，致告于紫虚元君，默允冥旨。 续命入内内侍省内西头供奉。 官臣康从政，入内内侍省内侍殿头句当，御药院臣江德用，并诏右街副道录知玉清昭应宫事同管句左，右街教门公事冲真大师赐紫臣李知损，左街都监寿宁观住持明真大师赐紫臣石知章，玉清昭应宫副直岁宣教大师赐紫臣周遂良，玉清昭应宫住持冲妙大师赐紫臣皇甫希及玉清昭应宫住持冲秘大师赐紫臣薛清和等，同资青词黄素一行礼信，就江宁府茅山崇禧观，开建上清皇坛预启玉录道场七昼夜，散日设醮三百六十分，依科传受。 讫别设谢恩道场三昼夜，设阖山道士女冠大斋一，中投送金龙玉简，金环玉鱼于华阳洞，骛洞金山水府，于以告盟七圣，于以致诚九清，伸授受之仪，罄师资之礼也。 始以输轩至日，灵鹤低迎於羽葆。 当建斋之夕，需云远布於霄空，洎宿露真文以祈感，预陈精梼以伸款，兰膏晃尔，星月集然，百神受厘以效祥，五岳卫灵而荐祉。 至中夜轻风飒至，骤雨需然，须臾之顷，银汉森列，皓魄皎如，咸云风伯扫坛，雨师洒席，观其所以，不亦宜乎。 及启传之旦，九霞流光之辉照烁而凝照，三素飞烟之气缥缈以浮空，枫钦萃焉，霓旌焕焉，羽仪恍焉，万灵肃焉。 当分金列契之际，皓鹤翱翔于坛上，红霞分绕於空中，蕙风袭人，灵芬郁野，观者如堵，莫不欣叹。 蚓夫众妙多门／’而学则有序，至神无方，而感则无待，斯以见我后之用心也，之精诚也。 符健顺，服人神，降灵仙，契冥奥，非浩劫崇累之德，积生至尚之果，其孰能臻於此焉。",
      "translated_text": "**Record of Empress Zhangxian Mingsu’s Reception of the Shangqing Complete Dharma Register**\n\n**Text Title:** *Record of Empress Zhangxian Mingsu’s Reception of the Shangqing Complete Dharma Register*\n**Author:** Zhu Ziying of the Northern Song Dynasty\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, *Pulu* Category\n\n---\n\nComposed by the Altar-Consecrating Preceptor, Shangqing Great Cavern Master, Purple-Robed Servant Zhu Ziying:\n\nIn the fourth reign of the Song Dynasty’s Mandate, the third year of the *Shengjun Zaiyou* era, the August Empress Dowager Liu—whose essence was divided from the Nine Numinous, whose spirit was nurtured by the Three Primordials—ushered in an era of radiant prosperity and wielded the transformative power of treasured brilliance. Within, she cultivated harmony among the nine clans; without, she illuminated the myriad governance. Amidst the respite from ten thousand affairs, she dwelled in the realm beyond emptiness, her spirit congealing in the vast desert of the Supreme Void. Golden consorts swept the mats in the jade-green hall; jasper blossoms scattered fragrance in the chamber of vacant purity.\n\nYet she further stilled her spirit and calmed her thoughts, reciting the *Scripture of the Yellow Court’s* Two Luminaries. Her will and intent turned inward in cultivation, unwearied from dawn to dusk. Was this merely to restrain the hun and po? It accorded with the words of the loftiest sages, yet also aimed to return to the root and restore simplicity, thereby sheltering the multitudes under heaven. Thus, she contemplated the Three Pristine Ones, bowed to the Nine Perfected, and wore the sacred jade at her waist. The Southern Perfected gazed upon her with secret favor; the Queen Mother of the West appeared in subtle vision. The response of sweet dew was manifest by day; the merit of accumulation advanced by year. Truly, immortality may be learned, and the Dao does not operate in vain.\n\nStill, she reflected that her refined study remained insufficient to reach the source of the Dao. Having heard that the Purple Void Primordial Lady of Southern Marchmount, Lady Wei, had in the *Xingning* era of the Eastern Jin (Year of *Jiazi*) first received the *Shangqing Great Cavern Treasure Scripture*—a sacred text of secret transmission—from the King of Lesser Existence, the True Person Qingxu Wang of the Celestial King, which was then passed down to Yang the True Person, Assistant Director of Destiny on Maoshan, and subsequently to the Shangqing Immortal Marquis, Historian Xu, she resolved to trace this lineage. The numinous source and true transmission continued unbroken on Maoshan’s peaks; the immortal branches flourished, their fragrance spreading across the seas. Thereupon, she summoned the Feathered Transcendents of the Jade Clarity Luminous Response Abbey, the Profound and Wondrous Great Masters Huangfu Xiji and others, to follow the texts of Wang and Wei, and study the traditions of Yang and Xu.\n\nThey obtained the *Three Grades of Numinous Scriptures of Shangqing*, the *Hidden Writings of Jade Clarity*, the *Multitude of Secrets of the Nine Clarities*, along with the *Golden Spirit’s Two Tigers and Eight Luminaries Jade Record*, the *Supreme August Jade Taboo Register of the Primordial*, the *Flowing Gold Fire Bell and Returning Chariot Complete Dao Three Primordials Jade Tallies*, the *Nine Phoenixes’ Numinous Chapters*, the *Purple-Text White Sash*, the *Yellow Writings of the Grand Tenuity*, the *Jade Palace’s Numinous Flight Records*, and other texts totaling ten scrolls, as well as the *Golden Immortals and Jade Horses* in fifteen scrolls. In accordance with the regulations, they prepared golden dragons and jade fish, golden rams and silver horses, azure silk and golden knots, lotus-purchased brocade with phoenix patterns, plain silk from Nanhe, rosy clouds’ dust-sweeping gauze, crimson chapters’ corpse-repelling cloth, the Four Standards’ luminous mirror and spirit-quaking sword, the Five Colors’ silk robes transcending the world, Shangqing ritual vestments, and all requisite offerings for the covenant—nothing was omitted.\n\nFirst, she dispatched envoys bearing secret petitions to Southern Marchmount to present her request to the Purple Void Primordial Lady, who silently assented to the hidden decree. Then, she commanded the Palace Attendant of the Inner Court’s Western Service, Minister Kang Congzheng, the Palace Attendant and Director of the Inner Court’s Attendants, Minister Jiang Deyong of the Imperial Pharmacy, along with the Right Street Vice Daoist Registrar, Administrator of the Jade Clarity Luminous Response Abbey, and Concurrent Supervisor of Left and Right Street Religious Affairs, the Profound and True Great Master, Purple-Robed Servant Li Zhisun; the Left Street Supervisor and Abbot of Shouning Abbey, the Illuminated and True Great Master, Purple-Robed Servant Shi Zhizhang; the Vice Annual Administrator of the Jade Clarity Luminous Response Abbey, the Profound and Wondrous Great Master, Purple-Robed Servant Zhou Suiliang; the Abbot of the Jade Clarity Luminous Response Abbey, the Profound and Wondrous Great Master, Purple-Robed Servant Huangfu Xiji; and the Abbot of the Jade Clarity Luminous Response Abbey, the Profound and Secret Great Master, Purple-Robed Servant Xue Qinghe—all to jointly prepare yellow petitions and plain silk, and proceed to the Chongxi Abbey on Maoshan in Jiangning Prefecture to establish the Shangqing Imperial Altar. There, they inaugurated a seven-day-and-night jade register ritual, conducting thirty-six hundred *jiao* rites over the days, and transmitting the register in accordance with the regulations. Upon completion, they separately held a three-day-and-night thanksgiving ritual, offering a grand vegetarian feast for the Daoist priests and nuns of the mountain. They cast golden dragons and jade tablets into the Huayang Cavern, and dispatched them to the Golden Mountain Water Palace, thereby pledging alliance with the Seven Sages and expressing sincerity to the Nine Clarities. Thus, the rites of transmission were fulfilled, and the etiquette between master and disciple was exhausted.\n\nAt the outset, when the imperial carriage arrived, spirit cranes descended to welcome it beneath the feathered canopy. On the eve of the ritual’s establishment, rosy clouds spread afar in the night sky. As they lodged the true writ to invoke resonance and presented refined prayers to express devotion, the orchid oil’s flame flared brightly, and stars and moon gathered in brilliance. A hundred spirits received blessings and bestowed auspices; the Five Marchmounts guarded the numinous and offered felicity. By midnight, a gentle wind arose, followed by a sudden downpour. In an instant, the Silver River stood in ordered ranks, its bright orb gleaming like white jade. All declared that the Wind Earl had swept the altar, and the Rain Master had purified the seats—was this not fitting?\n\nOn the dawn of transmission, the radiance of the Nine Auroras flowed and shimmered, congealing in illumination; the misty qi of the Three Pristine Ones drifted and floated in the void. Phoenix canopies gathered; rainbow banners shone; feathered regalia flickered; ten thousand spirits stood in solemnity. As the golden tallies were distributed and the covenants aligned, white cranes soared above the altar, and red auroras circled in the sky. Orchid winds caressed the people; numinous fragrance suffused the wilds. The onlookers stood like a wall, none failing to marvel.\n\nAlas! The gates to the myriad wonders are many, yet learning proceeds in order; the utmost numinous is without form, yet resonance requires no waiting. Herein lies the Empress Dowager’s devotion and sincerity. She harmonized with the firm and yielding, served humans and spirits, summoned transcendent immortals, and aligned with the hidden mysteries. Without the virtue accumulated over vast kalpas, without the supreme fruits of countless lives, who could attain such heights?",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1218,
      "start_sentence": 0,
      "end_sentence": 27,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.494370460510254,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\谱箓类\\章献明肃皇后受上清毕法箓记.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "是知令乎善始则美，克有终谋之以道，何患不臧。 若然者，八景飞霞之辇，三元流云之宴，十精回水之珍，九色凤脑之撰，将靡日而致之矣。 恭惟圣念，奉若秘文，盖欲昭事昊穹，保宁真主，固宗枋於万载，福民庶之三登，永戢干戈，同承富寿者也。 至於后天之筹，无疆之祚，金枝之远，苍生之赐，不其宜哉。 观一代之能事，考百王之未书，谨直笔以记之。 时天圣二年甲子岁四月戊午朔二十三日庚辰记。 章献明肃皇后受上清毕法箓记竟",
      "translated_text": "Thus it is known: when one excels in a good beginning, beauty follows; when one completes plans with the Dao, what cause is there for concern that it will not be perfect? For such as this, the chariot of Eight Radiant Flying Auroras, the feast of Three Primordials Flowing Clouds, the treasures of Ten Essences Returning Waters, and the delicacies of Nine-Hued Phoenix Brains—all shall be summoned without delay.\n\nWith reverence, we consider the sagely intent: upholding the secret scriptures as if they were divine, desiring thereby to manifest devotion to the Vast Heaven, to safeguard the True Sovereign, to secure the imperial lineage for ten thousand generations, and to bless the common people with triple harvests. May weapons of war be stilled forever, and all together partake in abundance and longevity. As for the calculations of the Later Heaven, the boundless mandate, the far-reaching golden branches, and the gifts bestowed upon the black-haired people—how fitting it is!\n\nObserving the accomplishments of this era and examining what the hundred kings have left unrecorded, we faithfully set down this account with an unadorned brush.\n\nRecorded on the twenty-third day of the fourth month, the day *gengchen*, in the second year of the Tiansheng reign, the *jiazi* year. *The Record of Empress Zhangxian Mingsu Receiving the Shangqing Complete Method Register is hereby concluded.*",
      "overlap_context": "e failing to marvel.\n\nAlas! The gates to the myriad wonders are many, yet learning proceeds in order; the utmost numinous is without form, yet resonance requires no waiting. Herein lies the Empress Dowager’s devotion and sincerity. She harmonized with the firm and yielding, served humans and spirits, summoned transcendent immortals, and aligned with the hidden mysteries. Without the virtue accumulated over vast kalpas, without the supreme fruits of countless lives, who could attain such heights?",
      "start_char": 1218,
      "end_char": 1415,
      "start_sentence": 28,
      "end_sentence": 34,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.844324350357056,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\谱箓类\\章献明肃皇后受上清毕法箓记.txt",
        "category": "谱箓类"
      }
    }
  ]
}