{
  "source_id": "素女妙论",
  "source_file": "chunked_daozang\\素女妙论.json",
  "total_chunks": 16,
  "total_original_chars": 6965,
  "total_translated_chars": 37284,
  "total_translation_time": 200.12560534477234,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\素女妙论.txt",
    "category": "藏外"
  },
  "full_translation": "**The Wondrous Discourse of the Plain Girl**\n\n**(1) The Origin Chapter**\n\nIn ancient times, the Yellow Emperor questioned the Plain Girl, saying: \"I have heard that in high antiquity, sages lived to a thousand years, or eight hundred years, or even two hundred years. In middle antiquity, sages lived to one hundred and twenty years. Yet in our present age, some perish at thirty or twenty, others at five or seven, and still others at two or three. Those who enjoy ease are few, while those afflicted by illness are many. What is the reason for this? I humbly beseech you to enlighten me, and pray do not withhold the essentials.\"\n\nThe Plain Girl replied: \"All human life begins when the father’s essence and mother’s blood unite, coalescing the four elements—earth, water, fire, and wind—to form the body. The causes of long or short life are manifold. Those who die at two or three, five or seven, or twelve or thirteen years do so because their parents conceived without observing prohibitions, thus giving birth to short-lived children. Those who perish at twenty or thirty possess inherently weak constitutions, lacking robust vitality from the start. Failing to study the arts of nourishing life, they reach youth and vigor, their blood and qi at their peak, yet become ensnared by desire. Their essence and qi dissipate, illnesses multiply, and ignorant of remedies, they squander their root and origin. How then can they hope for longevity?\"\n\nThe Emperor asked: \"When the Supreme Ultimate divided, yin and yang first separated—light and pure became heaven, turbid and heavy became earth. The Dao of Qian formed man, the Dao of Kun formed woman. Humanity dwells between them, and all things arise. What exists without yin and yang? Without yin and yang, heaven’s sun and moon would not shine, earth’s myriad things would not grow, and humanity’s ethical relations would cease. The mutual resonance of yin and yang cannot be absent for a single day. Yet I remain unclear about your words. Pray expound in full the essentials of the union of man and woman, and the methods of treating illness, to aid human longevity.\"\n\nThe Plain Girl replied: \"How profound! How profound! The union of man and woman is the Dao of one yin and one yang. Thus, within yin there is yang, and within yang there is yin. The interplay of yin and yang, male and female, is the Dao of heaven and earth. Yet if its essentials are lost, illness arises.\" She continued: \"Embracing yin while bearing yang, when yang reaches its peak, yin is born; when yin reaches its peak, yang sprouts. Within a woman’s yin, yin and yang naturally reside, each possessing firmness and softness, each with its own delightful pleasures.\"\n\nThe Emperor asked: \"I have heard the Dao of conjugal union, yet its deeper meaning eludes me. When husband and wife unite, they often fail to attain mutual joy. I wish to hear of this.\"\n\nThe Plain Girl replied: \"The Dao of conjugal union, the methods of replenishing essence and absorbing qi, the principles of massage and guiding exercises—these return one to the root and restore the origin, deeply anchoring and firmly securing it, yielding enduring harmony. Without the method of absorbing yin, mere coupling is labor in vain, failing to achieve blissful delight. It remains obscure, unable to convey the joy of mutual pleasure, for people do not cherish this Dao. If one practices this method, it is truly the secret essential of nourishing life. In the union of man and woman, the woman’s yin naturally holds wondrous pleasures, yet few know its subtleties. Thus, they often merely stir their passions, leading to mutual dissatisfaction. Exhausting themselves in vain union, they find no delight. If a woman’s essence has not yet arisen and her yin is dry, should the man force himself upon her, his jade stem will labor in vain, drilling into emptiness, wearying his spirit without benefit. Or if the woman’s fire of desire is already kindled yet the man’s jade stem lacks firmness, his essence departs prematurely, leaving his intent unfulfilled. The woman’s heart remains ungratified, and resentment arises.\"\n\n**(2) The Nine Postures Chapter**\n\nThe Emperor asked: \"Man and woman embody humanity’s great desire and the source of all things’ transformation. Yet those who neglect this fail to grasp its essentials—is this not the reason?\"\n\nSu Nü replied: \"Such words are prudent and subtle, yet the foolish deem them lewd, mistaking them for teachings that incite lust and guide desire. In truth, they are wondrous arts of nurturing life. The secret techniques of union comprise nine methods, each named accordingly:\n\nFirst, the Dragon Soaring Posture;\nSecond, the Tiger Striding Posture;\nThird, the Ape Seizing Posture;\nFourth, the Cicada Clinging Posture;\nFifth, the Tortoise Rising Posture;\nSixth, the Phoenix Soaring Posture;\nSeventh, the Hare Suckling Posture;\nEighth, the Fish Kissing Posture;\nNinth, the Crane Mating Posture.\"\n\nThe Emperor asked: \"I have now heard the names of the nine postures, but are there methods to their practice?\"\n\nSu Nü replied: \"Each posture has its own method, modeled after the forms of creatures, hence their collective name, the Nine Postures.\n\n**First, the Dragon Soaring Posture.**\nHave the woman lie supine, her body flat, both feet raised toward the sky. The man lies atop her, resting upon her thighs, and takes her tongue into his mouth. The woman lifts her *yin* gate herself to receive the jade stem as it pierces the Mysterious Gate. Withdrawing, he presses against her gate, then raises his body and sways in motion, employing the method of eight deep and six shallow thrusts. Thus, the *yin* within grows ardently hot, the yang member becomes firm and strong, man delights and woman rejoices, both hearts find joy and pleasure, and a hundred ailments vanish. Its method resembles the coiled dragon awakening and ascending the clouds.\n\n**Second, the Tiger Striding Posture.**\nHave the woman kneel on all fours, her head lowered. The man crouches behind her, embracing her waist as he inserts the jade stem into the *yin* gate, employing the method of five shallow and six deep thrusts. Withdrawing a hundred times, the jade vise opens wide, essence and saliva overflow, and water and fire achieve harmony, fulfilling the wonders of the cinnabar crucible. Vexation and oppression are dispelled, blood and vessels flow freely, the heart is nourished, and the will is strengthened. Its method resembles the tiger or leopard emerging from the forest to roar in the wind.\"\n\n**Third, the Ape Seizing Posture.**\nHave the woman spread her thighs and sit upon the man’s legs, the *yin* gate opening smooth and slick. Insert the jade pestle, tapping the *yin* portal several times, then employ the method of nine shallow and five deep thrusts. The woman murmurs without cease, her fluids overflowing, while the man secures his yang treasury to prevent spillage. A hundred ailments vanish at once, qi is replenished, and one attains longevity without hunger. Its method resembles the ape snatching fruit from the branches—swiftness is its greatest marvel.\n\n**Fourth, the Cicada Clinging Posture.**\nHave the woman straighten her left thigh while bending her right. The man crouches behind her, drawing the jade scepter to strike her crimson pearl, employing the method of seven deep and eight shallow thrusts. The red jewel swells wide, pleasure surging in lively waves, reaching the height of fluid motion. It unblocks and harmonizes the meridians, benefiting the practitioner over time. Its method resembles the golden cicada clinging to the tree, sipping dew in clear song—holding within, never releasing.\n\n**Fifth, the Turtle Ascending Posture.**\nHave the woman lie supine, serene and empty, as if forgetting all passion. The man uses his fingers to lift her legs, raising them past her breasts, then extends his head to suddenly enter the red gate, plunging deep to strike the valley’s fruit. Now retracting, now extending, like the turtle’s head drawing in and out. It dispels lingering heat and expels evil qi from the five viscera. Its method resembles the dark turtle gliding through the waters, its hard shell self-guarding, tail trailing in the mud to preserve its essence.\n\n**Sixth, the Phoenix Soaring Posture.**\nHave the woman lie sideways upon the bed, hands lifting her own thighs. The man tightly embraces her waist with both hands, inserting the golden pestle into the jade gate, thrusting left and right until the *yin* grows fiery and the woman’s body softens and stirs. Employing the method of nine shallow and eight deep thrusts, she delights with gentle gasps, slick fluids boiling forth. It replenishes all deficiencies, fills the marrow, lightens the body, and grants ageless longevity. Its method resembles the auspicious phoenix of Mount Dan beating its wings to soar through the heavens.\n\n**Seventh, the Hare Suckling Posture.**\nFirst, have the man lie supine upon the bed, legs stretched straight. The woman then straddles him backward, grasping the jade stalk to probe the chamber’s gate, threading the zither strings. Once the jade stem stands firm, she employs the method of shallow and deep thrusts, thereby nourishing blood, circulating qi, and relieving soreness in the four limbs. Its method resembles the jade hare’s swift leaps—now crouching, now bounding, appearing and vanishing unpredictably. So long as one does not lose their essence, they may seize the toad’s spirit in the ninefold heavens.\n\n**Eighth, the Fish Kissing Posture.**\nHave two women, one supine and one prone, embrace each other in the act of union. Their *yin* gates meet and naturally rub together, like fish mouths opening as they nibble at duckweed. The man sits to one side, awaiting the crimson tide’s rise. First, he explores the meeting point with his hand, then positions the stem between them, seizing the moment to insert it into both, uniting them in shared pleasure. It greatly strengthens sinews and bones, doubles one’s vigor, warms the center, and remedies the five taxations and seven injuries. Its method resembles fish frolicking among the waterweeds—sipping the clear and spitting the turbid is its essential principle.\n\n**Ninth, the Crane Mating Posture.**\nHave the woman embrace the man’s neck, her right foot resting upon the bed. The man lifts her left thigh with his right hand, hoisting it onto his shoulder, their bodies pressed close. Gently withdrawing the jade stalk, he gazes at her water caltrop teeth, then slowly strikes the valley’s fruit, swaying lightly and unhurriedly. Employing the method of nine shallow and one deep thrust, the flower’s heart suddenly opens, its fragrant fluids soaking through. It preserves the center and guards the spirit, aids digestion and whets the appetite, cures a hundred illnesses, and grants life without hunger. Its method resembles the red-crowned crane’s circling dance—wings outstretched without folding, naturally attaining the wondrous realm.\n\n**(3) On Depth and Shallow Thrusts**\nThe Emperor asked: “The regulation of fire through shallow and deep thrusts is the essential principle of refining the elixir. Yet if the adjustment is improper, each may suffer harm—how is this so?”\n\nLady Su answered: “Shallow thrusts that fall short provoke frustration, while deep thrusts that exceed bring remorse. There are also thirty-six postures and seventy-two variations that can harmonize sweet affection and enhance delight, though their principles run deep.”\n\nThe Emperor asked: “In the Dao of coupling between man and woman, the practice of shallow and deep thrusts often causes harm, with few benefits. I have heard there exists a secret art of ‘gathering and replenishing’ to extend human life—pray, reveal its details.”\n\nLady Su answered: “A man must observe a woman’s emotions and also firmly guard his own treasure, never allowing careless leakage. First, rub both palms until warm, then firmly grasp the jade stalk. Next, employ the method of shallow withdrawals and deep entries, enduring prolonged engagement to heighten pleasure. One must not be too hasty nor too slow, nor plunge to the utmost depth, for excess depth brings harm.\n\nStrike the ‘lute string’ and assault the ‘water caltrop teeth.’ When pleasure reaches its peak, the woman unconsciously clenches her teeth, fragrant sweat breaks forth, breath quickens, eyes close, face flushes, the fragrant pistil fully opens, and slick fluids overflow—this is the utmost pinnacle of blissful cultivation.\n\nMoreover, within the woman’s yin there are eight names, also called the ‘Eight Valleys’:\nFirst, the *Lute String*, one *cun* deep;\nSecond, the *Water Caltrop Teeth*, two *cun* deep;\nThird, the *Secure Nest*, three *cun* deep;\nFourth, the *Mysterious Pearl*, four *cun* deep;\nFifth, the *Valley’s Fruit*, five *cun* deep;\nSixth, the *Healing Gate*, six *cun* deep;\nSeventh, the *Gate of Kun*, seven *cun* deep;\nEighth, the *Northern Pole*, eight *cun* deep.”\n\nThe Emperor asked, “What illnesses arise from harm caused by intercourse?”\n\nSu Nü replied, “The essence of union lies in avoiding excessive depth, for deep penetration injures the five viscera. If it reaches the *Valley’s Fruit*, the liver is harmed, giving rise to dimmed vision, eye discharge, tears, and paralysis of the limbs. If it reaches the *Healing Gate*, the lungs are harmed, causing nausea, retching, phlegm, wheezing, and dizziness. If it reaches the *Gate of Kun*, the spleen is harmed, resulting in a sallow complexion, abdominal distension, restlessness, and cold dysentery. If it reaches the *Northern Pole*, the kidneys are harmed, leading to weakness in the waist and legs, bone steaming, and tidal fever. Sudden shifts between shallow and deep penetration injure the heart, causing facial heat, consumptive cough, nightmares, and seminal emission. Thus, intercourse must not be too deep. The woman’s cinnabar cavity lies three *cun* below the navel—take care not to injure it. Nor should it be too swift or too slow: excessive speed harms the blood, while excessive slowness depletes the *qi*, both bringing harm without benefit.”\n\nThe Emperor asked, “Having grasped the essentials of regulating the ‘fire phase’ and adjusting depth, one must not overlook the principles of harm. Are there further prohibitions to be observed? Pray, do not withhold them.”\n\nLady Su answered: “In refining the elixir, one must avoid taboos. If these are mistakenly violated, at worst Heaven and Earth will strip away one’s allotted years, spirits will bring calamity upon the body, and the Three Peng will spy an opening to cling to illness and misfortune. The children born will be short-lived, dull-witted, or unfilial—some will be obstinate and vicious, bringing harm to their parents. How can one not be cautious?\n\nWhen Heaven and Earth are dark and trembling, during thunderclaps, fierce winds, or violent storms, on the last and first days of the lunar month, the crescent and full moons, in extreme cold or scorching heat, during solar or lunar eclipses, on the birthdays of sages and deities, the days of *gengshen* and *jiazi*, one’s own natal day, the Three Primordials and Eight Festivals, the fifth day of the fifth month, days of lunar inauspiciousness or affliction, or under the baleful influences of *pima* and *hongsha*—on all these, one must not transgress.\n\nMoreover, near the altars of Heaven and Earth, the Five Peaks, rivers and streams, sacred shrines, or before images of deities and spirits, as well as beside wells, stoves, drains, or latrines—each of these places brings harm, often causing early death or the birth of children with monstrous or bizarre forms. There are also taboos to observe during intercourse:\n\nDo not transgress when ravenously hungry, overly sated, severely intoxicated, mentally exhausted or physically fatigued, grieving, sorrowful, or terrified. Do not transgress when newly recovered from illness, in mourning, or when the woman is menstruating.” *(Section Four: The Five Desires and Five Harms)*\n\nThe Emperor asked: “Those who exert themselves in youth and vigor may yet face decline and decay. Excessive joy must bring sorrow in its wake. The perfected person regulates these through the Dao, and thus it is said that one who masters the union with a hundred women may attain a lifespan matching Heaven and Earth. Yet today, men do not reach half a century before their sinews wither, their flesh sags, their fire rages while their water dries, and they become ruined beings—why is this?”\n\nThe Plain Girl replied: “In all people, there are the five desires, five harms, and ten signs of arousal. If these are managed appropriately, the mind is satisfied and desire fulfilled; if mismanaged, each brings its own harm.\n\n**The Five Signs of Desire:**\n1. When the face flushes crimson, the mind harbors thoughts of desire. First, let the jade stem enter, then gently rock and slowly withdraw, often at the gate’s threshold, to gauge her inclination.\n2. When breath escapes through the nostrils, the fire of desire stirs faintly. Let the jade stem penetrate the jade gate and pierce the valley’s fruit, but not too deeply—wait for the fire to reach its proper moment.\n3. When the throat grows parched, passion blazes. Withdraw the jade stem and await the moment when her eyes close, her tongue extends, and her breath comes in gasps. Then move freely, gradually ascending to bliss.\n4. When the red pearl glistens with moisture, the heart’s fire burns fiercely. Piercing it will cause slickness to overflow. Lightly touch the water caltrop teeth, alternating left and right, slow and swift, following her rhythm as the method dictates.\n5. When the golden lotus clings in embrace, the fire has reached its fullness. Her feet must coil around his waist, her hands clasp his shoulders and back, her tongue extend without retreat. Then pierce the jade gate ever more deeply, and all four limbs will know perfect ease.\n\n**The Five Signs of Harm:**\n1. If the jade gate remains closed and unopened, do not pierce it, for this harms the lungs. Lung injury brings phlegm and wheezing, a hoarse voice.\n2. When passion has risen but the jade stem wilts and softens, and union occurs only after desire has waned, this harms the heart. Heart injury disrupts the menstrual flow.\n3. When a young yin joins with an aged yang, the fire of desire burns in vain without fulfillment, this harms the liver. Liver injury brings dizziness and dimmed vision.\n4. When desire is sated and passion fulfilled, yet the yang fire does not subside, this harms the kidneys. Kidney injury leads to vaginal discharge and flooding.\n5. When the monthly affliction is not yet ended and one is compelled to union, this harms the spleen. Spleen injury causes the complexion to wither and yellow.\n\n**The Ten Signs of Arousal:**\n1. When she embraces the man’s back with her jade hands, her lower body moves of its own accord, and she extends her tongue to cling close—this is the sign that the man’s passion is stirred and desire awakened.\n2. When her fragrant body lies supine, limbs outstretched and still, and her breath comes in faint, urgent gasps—this is the sign that she awaits piercing and withdrawal.\n3. When she extends her wrist, opens her palm, and grasps the sleeping man’s jade mallet, turning it—this is the sign of drooling desire.\n4. When she chatters playfully, her eyes beckon and her brows signal, and she occasionally utters sighs of longing—this is the sign that spring passion has reached its peak.\n5. When she clasps her golden lotuses with both hands, baring the gate of the mysterious valley—this is the sign of ripened passion and swift delight.\n6. When she holds the jade scepter in her mouth, appearing drunk or drowsy, and her yin itches within—this is the sign for shallow and deep thrusts.\n7. When she stretches her golden lotuses long, hooking and drawing the jade mallet, advancing and retreating, and softly moans—this is the sign that the yin tide surges.\n8. When she suddenly attains her desire, subtly arches her waist, her fragrant sweat not yet dried, and a smile lingers—this is the sign that yang qi is spent and passion exhausted.\n9. When sweet passion has arrived, bliss grows ever greater, essence is released, yet she still clings tightly—this is the sign that her desire is not yet fulfilled.\n10. When her body grows hot and sweat soaks her, her feet slacken and her hands slow—this is the sign that passion has reached its peak and her wish is satisfied.” *(Section Five: The Great Principle)*\n\nThe Emperor asked, “Of the great human relations, none precedes husband and wife, for only then may there be descendants. Should not a wife’s virtue and a wife’s beauty be carefully chosen?”\n\nSu Nü replied, “A wife’s virtue is inner beauty; a wife’s appearance is outer beauty. First observe her skin, then her inner qualities. If a woman’s hair is scorched and black, her bones large and flesh coarse, her plumpness or leanness immoderate, her height unusual, or her age mismatched, she will not bear descendants. If her speech is bold and forceful, her temper sudden and violent, her yin dry and rough, her womb cold, or if she suffers from dripping discharge, red or white turbidity, or foul odor, she greatly harms yang qi.”\n\nThe Emperor asked, “I have heard of the harm to yang qi. Some seek to remedy this with medicinal tonics—what of this?”\n\nSu Nü replied, “The union of man and woman is not for wanton pleasure. People today, ignorant of cultivation and self-nurturance, force themselves in the act, thus often depleting essence and exhausting qi, giving rise to illness. Some, through mistaken diet or reckless consumption of medicines, injure their nature and forfeit their lives—how truly lamentable!”\n\nThe Emperor asked, “The Way of husband and wife is for the sake of descendants, yet now there are those who bear no children—why is this?”\n\nSu Nü replied, “There are three types of women who bear no children, and three types of men who bear no children. Men whose essence is cold and slippery, those who indulge excessively in dissipation and depletion, or those who falter and shrink back when facing the act—these bear no children. Women whose nature is wanton and stirred by mere sight, whose womb is depleted and cold or whose womb-gate does not open, or whose jealousy burns like fire—these bear no children.”\n\nThe Emperor asked, “If a person has no children, by what method may they be obtained?”\n\nSu Nü replied, “The method for seeking children follows the numbers of yin and yang conjunction. Use yellow gauze, yellow silk, or yellow damask to make clothing, bedding, curtains, and quilts. On an auspicious day of the yellow Dao, take a peach branch and inscribe the year and stem-branch of birth, placing it within the bedchamber. Also, on the third day of the ninth month, take a peach branch extending eastward, inscribe the names upon it, and insert it above the bed. One must then observe when the woman’s monthly flow has ceased for three or four days. Both should bathe, burn incense, and pray to Heaven, Earth, ghosts, and spirits. Then, entering the curtains, they may unite in the act. At that time, the womb-gate has not yet closed, and thus a child may be conceived.\n\nThe method of union: advance and withdraw in accordance with the proper way, purify the heart and cleanse the mind. Do not engage in playful teasing or wanton frolic, do not rely on aphrodisiacs, and do not view erotic illustrations. If these are violated, it harms the parents and is unfavorable for bearing children.”\n\nThe Emperor asked, “The Way of yin and yang is called ‘union’—why is this so?”\n\nSu Nü replied, “When yin and yang unite, the man emits and the woman receives—hence it is called ‘union.’ Within the woman’s yin there are natural signs: without striking the zither’s strings or reaching the water caltrop’s teeth, the utmost pleasure is attained, and the true treasure is revealed. When yin blood envelops yang essence, a son is born; when yang essence envelops yin blood, a daughter is born. This is the Way of yin-yang union.”\n\nThe Emperor asked, “Union is the origin of human relations. Yet why do some fail to harmonize and delight in one another?”\n\nSu Nü replied, “This arises because women cannot discern their husbands’ intentions, and men do not understand their wives’ nature—thus they fail to grasp the Way of human relations and the principle of procreation and lineage. Each may be stubborn and licentious, each harboring dissatisfaction, mutually fostering resentment. Some abandon their own wives to recklessly consort with other women, while others deceive their husbands to engage in illicit unions. Some men suffer from impotence and fail to satisfy desire, while others possess unyielding virility without respite—eventually leading to mutual aversion.”\n\nThe Emperor asked, “When husband and wife are intimate, respectful, and loving, this is the norm of human relations. Yet from what does such reverence and love arise?”\n\nSu Nü replied, “When the union is harmonious, it is aligned with the Dao; when it is discordant, it runs counter to it. When the Eight Characters align and youth and vigor meet in due time, this is alignment with the Dao. When the Eight Characters clash and age and youth fail to meet, this is counter to it. When talent and beauty are both complete and temperaments harmonize, this is alignment with the Dao. When the dull and ugly turn their backs on each other and cruelty and hostility arise, this is counter to it. Yet when affection and mutual accord take root, reverence and respect arise; with reverence and respect come wealth, nobility, longevity, and flourishing descendants.”\n\n---\n\n**6. On Size and Proportion**\nThe Emperor asked, “Why do men’s treasures differ in size, length, hardness, and softness?”\n\nSu Nü replied, “Their forms are bestowed differently, just as human faces vary. The distinctions in size, length, hardness, and softness all depend on one’s endowment. Thus, a man may be short yet his treasure mighty, or robust yet his treasure small; lean and weak yet firm and hard, or stout and large yet soft and shrinking. Some resemble a carriage axle, others can be embraced, and still others swell with flesh and bulging veins—yet none of these hinder the essentials of union.”\n\nThe Emperor asked, “Since men’s members differ in size, length, hardness, and softness, do the methods for achieving pleasurable union also differ?”\n\nSu Nü replied, “Different endowments in size, length, and form are external matters; the key to pleasurable union lies in the inner disposition. First bind them with love and respect, then guide them with sincerity—what need is there to debate size, length, or proportion?”\n\nThe Emperor asked, “Do hardness and softness also differ in their effects?”\n\nSu Nü replied, “Long and large yet limp and soft is inferior to short and small yet firm and hard. Firm and hard yet coarse and violent is not as good as soft and weak yet gentle and considerate. One who attains the mean may be called perfect in both beauty and goodness.”\n\nThe Emperor asked, “Those who practice external arts may use medicines to enlarge the small or stiffen the soft. Do such methods risk future harm, or do they offer strengthening benefits?”\n\nSu Nü replied, “When two hearts unite and qi flows unimpeded, the small naturally grows larger and the soft naturally hardens. Those who master the Dao can achieve this, coupling with a hundred women without wilting. Through cultivation and nurturing, one may use yin to assist yang, regulate breath through inhalation and exhalation, draw water to quench fire, and secure the true treasure—remaining unsated through the night without emission. Practiced over time, this prolongs life and dispels illness. But if one resorts to minerals to invigorate yang or seal oil to stoke the fire, the false flame burns alone, true yang withers and dries—such harm is not insignificant.”\n\nThe Emperor asked, “Are even those who practice cultivation unrestrained?”\n\nSu Nü replied, “Qi circulates in cycles; one should unite when the time is right and cease when the moment passes, expending only what one’s strength allows. To force or indulge in excess is to invite exhaustion and ruin, even for those who cultivate. ‘Taking medicine for three days is not as good as sleeping alone for one night’—such was the warning of the sages of old.”\n\n---\n\n**7. On Nurturing Life**\n\nThe Emperor asked, “In the Way of nurturing life, what is the foundation?”\n\nSu Nü replied, “The Way of nurturing life takes qi as its foundation. Qi moves the blood, blood transforms into essence, essence nourishes the spirit—where the spirit abides, there is life; where the spirit scatters, there is death. Qi is the root of the spirit. One who refines qi enters fire without burning, enters water without drowning. Firmly guarding essence without dissipation, one may lie with a woman through the night without emission. But those who cannot preserve their spirit and act recklessly will surely lose their spirit and forfeit their qi—this is called the axe that severs life.”\n\nThe Emperor asked, “If one adheres solely to the Way of nurturing life and neglects the rites of the bedchamber between husband and wife, human relations will be severed, and posterity will be cut off.”\n\nSu Nü replied, “In youth, when blood and qi are not yet full, one must guard against excess in desire and avoid violent depletion. In the prime of life, when essence and qi overflow, forcibly restraining essence and suppressing desire will give rise to strange illnesses. Thus, one must not refrain entirely, nor go to excess, nor fall short.”\n\nThe Emperor asked, “If one times emissions to dispel arousal, can one preserve essence and nourish the spirit?”\n\nSu Nü replied, “It is not so.”\n\nIf one regularly emits but occasionally retains, sores and ulcers may arise; if one habitually restrains but suddenly releases, one may suffer sudden depletion—both harm the Way of nurturing life.”\n\nThe Emperor asked, “How can one know when a man’s essence and blood are full and his spirit and qi are abundant?”\n\nSu Nü replied, “At sixteen, when *tian gui* arrives, a man’s blood and qi are still insufficient, and his spirit unsettled—thus he must be cautioned. By twenty, his blood and qi gradually flourish, and his essence gathers in the intestines and stomach, to be emitted once every thirty days. At thirty, when his blood and qi are robust, his essence resides in the thighs, to be emitted once every five days. At forty, his essence gathers in the lumbar spine, to be emitted once every seven days. At fifty, as his blood and qi begin to wane, his essence collects in the back and spine, to be emitted once every fifteen days. By sixty-four, *tian gui* is exhausted, the hexagram’s measure is complete, his blood and qi decline, and his seminal essence is spent. After sixty, if one can preserve residual qi and remain vigorous, emission is still possible. By seventy, one must not recklessly indulge in desire or stir the passions.”\n\nThe Emperor asked, “How is it that some reckless youths, relying on their strength, emit three or even five times a day?”\n\nSu Nü replied, “Excessive emission leads to sudden depletion, and later, impotence and debility. If one emits without respite, one invites early death.”\n\nThe Emperor asked, “Why does a man’s yang qi rise vigorously at night, stirring arousal?”\n\nSu Nü replied, “Morning, noon, dusk, and night—these are the four seasons within a day. Thus, yang qi begins to stir at the *zi* hour, corresponding to the hexagram *Fu* (Return); by the *chou* hour, a second yang arises below, corresponding to *Lin* (Approach); by the *yin* hour, the three yang are complete, corresponding to *Tai* (Peace). If one emits violently at midnight, yang essence will wither and deplete—before fifty, one will surely suffer dizziness, visceral pain, dimmed vision, and blocked ears. There are also five injuries: first, if a man emits little during intercourse, it injures his qi; second, if his essence flows sluggishly, it injures his flesh; third, if emission is painful, it injures his sinews; fourth, if his essence is viscous, it harms his bones; fifth, if he suddenly wilts at the threshold, drooling, it injures his blood. All these stem from excessive emission and the exhaustion of seminal essence—how can one not be cautious!”\n\nThe Emperor asked, “When a man and woman delight in intimacy, how can one discern their feelings before words are spoken? The subtleties are delicate and concealed—by what art may one gauge and arouse their desire?”\n\nSu Nü replied, “Whenever a man seeks to probe a woman’s private feelings, he should first tease her with playful words to stir her intent, then gently touch or press with his hands and feet to kindle her passion. A man has four *arrivals*, and a woman has nine *attainments*—if the four do not arrive and the nine are not attained before coupling, there will surely be later afflictions.”\n\nThe Emperor asked, “What are the man’s four *arrivals*?”\n\nSu Nü replied, “If the jade stem is not firm, his yang qi has not arrived; if it is rigid yet unmoving, his flesh qi has not arrived; if it trembles yet does not swell, his bone qi has not arrived; if it swells yet does not endure, his kidney qi has not arrived. Should even one fail to arrive and he proceeds, there will certainly be harm.”\n\nThe Emperor asked, “What are the woman’s nine *attainments*?”\n\nSu Nü replied, “If she yawns, stretches, and sighs, drowsy and half-awake, her lung qi has not attained; if her gate is dry and her thighs remain closed, her heart qi has not attained; if her eyes do not roam and her movements lack joy, her spleen qi has not attained; if she touches the jade stem yet her mood remains unpleased, her blood qi has not attained; if her hands are limp and feet sluggish, lying still without response, her sinew qi has not attained; if she fondles her breasts yet finds no delight, her bone qi has not attained; if her gaze flickers faintly yet her oriole mouth stays shut, her liver qi has not attained; if she presses her body toward him yet her peach cheeks do not flush, her kidney qi has not attained; if her jade gate is only slightly moist and her mouth is not parched, her fluid qi has not attained. Only when all nine signs have manifested should one proceed with the method of *nine shallow, one deep*—then yin and yang will harmonize, and passion will entwine. This can aid yang qi and remedy depletion and taxation.”\n\nThe Emperor asked, “What is the method of *nine shallow, one deep*?”\n\nLady Su Nü replied, “Nine shallow insertions followed by one deep thrust—each cycle measured by the span of a breath—this is the method of *nine shallow, one deep*. From the *qin strings* to the *mysterious pearl* is shallow; from the *tuo* to the *valley’s fruit* is deep. Too shallow brings no pleasure, while too deep risks injury.”\n\nThe Emperor asked, “The alchemical crucible’s regulation, the subtlety of fire timing, and the marvel of water and fire in harmony—I have heard these in detail. Yet there remains more to this treasury of wisdom. I wish to exhaust its principles, that your boundless benevolence may be bestowed to save the world, sparing all generations from premature demise and the sorrow of depletion or barren lineage.”\n\nLady Su Nü replied, “When Heaven and Earth unite in harmony, when yin and yang conjoin in action, first observe her ardor and passion, carefully discern whether her qi signs have fully arrived. Master the art of withdrawal and thrust, the subtlety of adding embers—thus securing your own yang storehouse. Embrace with fragrant kisses, drawing in yin essence to replenish yang qi; inhale through the nose to fill the spinal marrow; hold the divine fluids to nourish the cinnabar field. Let the *niwan*’s potent qi penetrate deeply, coursing through the four limbs, overflowing to enrich blood and qi, preserving youth and forestalling age.”\n\nThe Emperor asked, “The cultivation of gathering and refining, the forging of the inner elixir—this is the foremost marvel of the Dao. How could those endowed with spirit fail to grasp its principles?”\n\nLady Su Nü replied, “Indeed, as Your Majesty commands. This is the wondrous essential for prolonging life and enhancing longevity. Now, heaven is deficient in the northwest, thus a man’s yang qi is ever in surplus while his yin blood is insufficient; earth is incomplete in the southeast, thus a woman’s yin blood is replete while her yang qi is lacking. Those who grasp the profound subtleties take the surplus to replenish the deficient—though they reach a hundred years, their joy remains unaltered. Delight and merriment know no end, and long life with enduring vision spans the heavens and earth. It is fitting to inscribe this upon metal and stone, that it may be transmitted to later generations, for the universal relief of virtue and grace shall be no small thing.”\n\nThe Emperor purified himself with fasting and ablutions, then refined his inner elixir according to the method for eighty-one days. His years extended to one hundred and twenty, and when the cinnabar medicine was complete, he cast a tripod by the lakeside. A divine dragon descended to welcome him, and together with Lady Su Nü, he ascended to heaven in broad daylight.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "《素女妙论》 （一）原始篇 在昔，轩辕问素女曰：“朕闻上古圣人，寿有千岁，或八百岁，又有二百岁； 中古圣人有百二十岁； 今时人寿或三十或二十而亡，又五七岁而亡，又二三岁而亡，安逸者少，抱疾者多矣。 其故何哉？ 幸谕开悟，愿勿吝其要。 ” 素女答曰：“凡人之生，感父精母血而受始，合地水火风而成形。 盖寿夭之际，其因不一。 有二三岁、五七岁至十二三岁而亡者，皆由父母受胎而无禁忌，故生子不寿。 或二三十岁而亡者，其人四大本虚，初无坚固之质，不能学养生之术； 年及少壮，血气方刚，而迷恋欲情，使精气耗散，疾病多生，而不识治疗之方，是乃自丧其本源，岂得望延年益寿乎！ ” 帝问曰：“太级剖判，阴阳肇分，轻清为天，混浊为地，乾道成男，坤道成女，惟人处乎其中，万物生焉，何者而无阴阳矣哉！ 天无阴阳则日月不明，地无阴阳则万物不生，人无阴阳则伦道绝矣。 阴阳交感，不可一日而无焉也。 卿之斯言，朕有未悟，男女交合之要、疾病治疗之方，幸望备道其详，以济人寿。 ” 素女答曰：“甚哉甚哉！ 凡男女交合，乃一阴一阳之道也。 是以阴中有阳，阳中有阴，阴阳男女，天地之道也。 然失其要，则疾病起矣。 ”又曰：“抱阴而负阳，阳极则阴生，阴极则阳萌矣。 凡女子阴中自具阴阳，其间刚健柔顺，各有快美之趣。 ” 帝问曰：“夫妇交感之道，既已闻之，未达其旨。 而夫妇交媾之时，亲之不得其美情，愿为是说。 ” 素女答曰：“凡男女交合之道及补精采气之法、按摩导引之义，返本还元，深根固蒂，得其长久之情。 若非采阴之法，徒劳交合，不得其畅美，终为杏冥，而不能通美快之意，此因人不能慕其道也。 若行此法，实为养生之秘要也。 凡男女交合，其女人阴中自有美快之秘，而知其趣者少焉矣。 故只多感其情，遂以致两情不乐，虚劳交合，而不美快。 且夫女子精液未发，而阴中干，若男子勉强行之，玉茎钻制空亏，只劳神思而无适用也。 或女子欲火已动，男子玉茎不刚坚，精津离形，而意未舒畅，女子心中不快不满，终生憎恶之心。 ” （二）九势篇 帝问曰：“男女者，人道大欲，而万物化生之源也。 而今忽之者，未得其要之故也乎？ ”",
      "translated_text": "**The Wondrous Discourse of the Plain Girl**\n\n**(1) The Origin Chapter**\n\nIn ancient times, the Yellow Emperor questioned the Plain Girl, saying: \"I have heard that in high antiquity, sages lived to a thousand years, or eight hundred years, or even two hundred years. In middle antiquity, sages lived to one hundred and twenty years. Yet in our present age, some perish at thirty or twenty, others at five or seven, and still others at two or three. Those who enjoy ease are few, while those afflicted by illness are many. What is the reason for this? I humbly beseech you to enlighten me, and pray do not withhold the essentials.\"\n\nThe Plain Girl replied: \"All human life begins when the father’s essence and mother’s blood unite, coalescing the four elements—earth, water, fire, and wind—to form the body. The causes of long or short life are manifold. Those who die at two or three, five or seven, or twelve or thirteen years do so because their parents conceived without observing prohibitions, thus giving birth to short-lived children. Those who perish at twenty or thirty possess inherently weak constitutions, lacking robust vitality from the start. Failing to study the arts of nourishing life, they reach youth and vigor, their blood and qi at their peak, yet become ensnared by desire. Their essence and qi dissipate, illnesses multiply, and ignorant of remedies, they squander their root and origin. How then can they hope for longevity?\"\n\nThe Emperor asked: \"When the Supreme Ultimate divided, yin and yang first separated—light and pure became heaven, turbid and heavy became earth. The Dao of Qian formed man, the Dao of Kun formed woman. Humanity dwells between them, and all things arise. What exists without yin and yang? Without yin and yang, heaven’s sun and moon would not shine, earth’s myriad things would not grow, and humanity’s ethical relations would cease. The mutual resonance of yin and yang cannot be absent for a single day. Yet I remain unclear about your words. Pray expound in full the essentials of the union of man and woman, and the methods of treating illness, to aid human longevity.\"\n\nThe Plain Girl replied: \"How profound! How profound! The union of man and woman is the Dao of one yin and one yang. Thus, within yin there is yang, and within yang there is yin. The interplay of yin and yang, male and female, is the Dao of heaven and earth. Yet if its essentials are lost, illness arises.\" She continued: \"Embracing yin while bearing yang, when yang reaches its peak, yin is born; when yin reaches its peak, yang sprouts. Within a woman’s yin, yin and yang naturally reside, each possessing firmness and softness, each with its own delightful pleasures.\"\n\nThe Emperor asked: \"I have heard the Dao of conjugal union, yet its deeper meaning eludes me. When husband and wife unite, they often fail to attain mutual joy. I wish to hear of this.\"\n\nThe Plain Girl replied: \"The Dao of conjugal union, the methods of replenishing essence and absorbing qi, the principles of massage and guiding exercises—these return one to the root and restore the origin, deeply anchoring and firmly securing it, yielding enduring harmony. Without the method of absorbing yin, mere coupling is labor in vain, failing to achieve blissful delight. It remains obscure, unable to convey the joy of mutual pleasure, for people do not cherish this Dao. If one practices this method, it is truly the secret essential of nourishing life. In the union of man and woman, the woman’s yin naturally holds wondrous pleasures, yet few know its subtleties. Thus, they often merely stir their passions, leading to mutual dissatisfaction. Exhausting themselves in vain union, they find no delight. If a woman’s essence has not yet arisen and her yin is dry, should the man force himself upon her, his jade stem will labor in vain, drilling into emptiness, wearying his spirit without benefit. Or if the woman’s fire of desire is already kindled yet the man’s jade stem lacks firmness, his essence departs prematurely, leaving his intent unfulfilled. The woman’s heart remains ungratified, and resentment arises.\"\n\n**(2) The Nine Postures Chapter**\n\nThe Emperor asked: \"Man and woman embody humanity’s great desire and the source of all things’ transformation. Yet those who neglect this fail to grasp its essentials—is this not the reason?\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 870,
      "start_sentence": 0,
      "end_sentence": 40,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.19611430168152,
      "metadata": {
        "source_file": "dao\\藏外\\素女妙论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "素女答曰：“其言慎微，愚者以为亵，而非诲淫导欲之说，实乃养生之妙术。 交媾之秘诀，其法有九，名具以提之： 一曰龙飞势； 二曰虎步势； 三曰猿搏势； 四曰蝉附势； 五曰龟腾势； 六曰凤翔势； 七曰兔吮势； 八曰鱼唼势； 九曰鹤交势。 ” 帝问曰：“九势已闻其目，而行之有法哉？ ” 素女答曰：“每一势有一法，只拟其物状而为势，故目云曰‘九势’。 “一、龙飞势。 令女人仰卧其体，两足朝天。 男子伏其上，据其股，含其舌。 女人自举起牝户，而受玉茎刺入玄牝之门，抽出扣其户，举身动摇，行八深六浅之法，则阴中壮热，阳物刚强，男欢女悦，两情娱快，百疾消除。 其法如蛟龙发蛰攀云之状。 “二、虎步势。 令女人胡跪低头。 男子踞其后，抱其腰而插入玉茎于牝门，行五浅六深之法，抽出百回，玉钳开张，精涎涌出，水火既济，尽丹鼎之妙。 烦懑已除，血脉流通，补心益志。 其法如虎豹出林啸风之状。",
      "translated_text": "Su Nü replied: \"Such words are prudent and subtle, yet the foolish deem them lewd, mistaking them for teachings that incite lust and guide desire. In truth, they are wondrous arts of nurturing life. The secret techniques of union comprise nine methods, each named accordingly:\n\nFirst, the Dragon Soaring Posture;\nSecond, the Tiger Striding Posture;\nThird, the Ape Seizing Posture;\nFourth, the Cicada Clinging Posture;\nFifth, the Tortoise Rising Posture;\nSixth, the Phoenix Soaring Posture;\nSeventh, the Hare Suckling Posture;\nEighth, the Fish Kissing Posture;\nNinth, the Crane Mating Posture.\"\n\nThe Emperor asked: \"I have now heard the names of the nine postures, but are there methods to their practice?\"\n\nSu Nü replied: \"Each posture has its own method, modeled after the forms of creatures, hence their collective name, the Nine Postures.\n\n**First, the Dragon Soaring Posture.**\nHave the woman lie supine, her body flat, both feet raised toward the sky. The man lies atop her, resting upon her thighs, and takes her tongue into his mouth. The woman lifts her *yin* gate herself to receive the jade stem as it pierces the Mysterious Gate. Withdrawing, he presses against her gate, then raises his body and sways in motion, employing the method of eight deep and six shallow thrusts. Thus, the *yin* within grows ardently hot, the yang member becomes firm and strong, man delights and woman rejoices, both hearts find joy and pleasure, and a hundred ailments vanish. Its method resembles the coiled dragon awakening and ascending the clouds.\n\n**Second, the Tiger Striding Posture.**\nHave the woman kneel on all fours, her head lowered. The man crouches behind her, embracing her waist as he inserts the jade stem into the *yin* gate, employing the method of five shallow and six deep thrusts. Withdrawing a hundred times, the jade vise opens wide, essence and saliva overflow, and water and fire achieve harmony, fulfilling the wonders of the cinnabar crucible. Vexation and oppression are dispelled, blood and vessels flow freely, the heart is nourished, and the will is strengthened. Its method resembles the tiger or leopard emerging from the forest to roar in the wind.\"",
      "overlap_context": "into emptiness, wearying his spirit without benefit. Or if the woman’s fire of desire is already kindled yet the man’s jade stem lacks firmness, his essence departs prematurely, leaving his intent unfulfilled. The woman’s heart remains ungratified, and resentment arises.\"\n\n**(2) The Nine Postures Chapter**\n\nThe Emperor asked: \"Man and woman embody humanity’s great desire and the source of all things’ transformation. Yet those who neglect this fail to grasp its essentials—is this not the reason?\"",
      "start_char": 870,
      "end_char": 1272,
      "start_sentence": 41,
      "end_sentence": 65,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.3292875289917,
      "metadata": {
        "source_file": "dao\\藏外\\素女妙论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "“三、猿捕势。 令女人开起两股，坐在男子于两腿上，牝门开张滑滑。 插玉槌，数扣阴户，次行九浅五深之法，女子哝哝不休，津液溢流，男子固济阳匮而不泄。 百疴忽除，益气长生，不饥。 其法如猿搏枝取果实之状，最以快捷为妙。 “四、蝉附势。 令女人直舒左股而屈右股。 男子踞其后，曳玉如意叩其赤珠，行七深八浅之法，红球大张，快活泼泼，极活动之妙。 通利关脉，久久利人。 其法如金蝉抱树吸露清吟之状，只含蓄不吐。 “五、龟腾势。 令女人仰卧，澹然虚无，如忘其情。 男子以两手指托两腿，抬起过乳房，伸出其头，忽入红门，深撞谷实。 忽缩忽伸，如龟头伸缩。 能除留热，遂五脏邪气。 其法如玄龟游腾之状，坚甲自守，曳尾泥中，而全其真。 “六、凤翔势。 令女人横身仰床上，手自举两股。 男子以两手紧抱搂女腰，将金槌插玉门，左右奔突，至阴中壮热，女体软动，行九浅八深之法，则女悦微喘，滑液沸出。 能补诸虚，填精髓，轻身，延年不老。 其法如丹山瑞凤搏扶摇而翱翔寰中之状。 “七、兔吮势。 先男子仰卧床上，直伸两股。 令女人反骑跨男子股上，手握郎中探房门，直穿琴弦，觉玉条坚硬而后行浅深之法，则养血行气，除四股酸疼。 其法如玉兔跳跃之快，忽蹲忽跳，出没不定，只不失其真，则能捉蟾魄于九霄。 “八、鱼唼势。 令二女子一仰一俯，互搂抱以为交接之状。 牝户相合，自摩擦则其鱼口自开，犹游鱼唼萍之形。 男子箕坐其侧，俟红潮嘲发，先以手探两口相合处，将茎安其中间，上下乘便，插入两方交欢。 大坚筋骨，倍气力，温中补五劳七伤。 其法如游鱼戏藻之状，只以唼清吐浊为要。 “九、鹤交势。 令女人搂男子之颈，以右足负床上。 男以右手提女之左股而提肩上，两体紧巾，微抽玉茎，窥其菱齿，徐徐撞谷实，摇摆轻漫，行九浅一深之法，花心忽开，芳液浸润。 保中守神，消食开胃，疗百病，长生不饥。 其法如丹鹤回旋之状，张翎不收，自至妙境。 （三）浅深篇 帝问曰：“火候浅深，炼丹之要旨也。 然调停不得法，各有所捐哉？ ”",
      "translated_text": "**Third, the Ape Seizing Posture.**\nHave the woman spread her thighs and sit upon the man’s legs, the *yin* gate opening smooth and slick. Insert the jade pestle, tapping the *yin* portal several times, then employ the method of nine shallow and five deep thrusts. The woman murmurs without cease, her fluids overflowing, while the man secures his yang treasury to prevent spillage. A hundred ailments vanish at once, qi is replenished, and one attains longevity without hunger. Its method resembles the ape snatching fruit from the branches—swiftness is its greatest marvel.\n\n**Fourth, the Cicada Clinging Posture.**\nHave the woman straighten her left thigh while bending her right. The man crouches behind her, drawing the jade scepter to strike her crimson pearl, employing the method of seven deep and eight shallow thrusts. The red jewel swells wide, pleasure surging in lively waves, reaching the height of fluid motion. It unblocks and harmonizes the meridians, benefiting the practitioner over time. Its method resembles the golden cicada clinging to the tree, sipping dew in clear song—holding within, never releasing.\n\n**Fifth, the Turtle Ascending Posture.**\nHave the woman lie supine, serene and empty, as if forgetting all passion. The man uses his fingers to lift her legs, raising them past her breasts, then extends his head to suddenly enter the red gate, plunging deep to strike the valley’s fruit. Now retracting, now extending, like the turtle’s head drawing in and out. It dispels lingering heat and expels evil qi from the five viscera. Its method resembles the dark turtle gliding through the waters, its hard shell self-guarding, tail trailing in the mud to preserve its essence.\n\n**Sixth, the Phoenix Soaring Posture.**\nHave the woman lie sideways upon the bed, hands lifting her own thighs. The man tightly embraces her waist with both hands, inserting the golden pestle into the jade gate, thrusting left and right until the *yin* grows fiery and the woman’s body softens and stirs. Employing the method of nine shallow and eight deep thrusts, she delights with gentle gasps, slick fluids boiling forth. It replenishes all deficiencies, fills the marrow, lightens the body, and grants ageless longevity. Its method resembles the auspicious phoenix of Mount Dan beating its wings to soar through the heavens.\n\n**Seventh, the Hare Suckling Posture.**\nFirst, have the man lie supine upon the bed, legs stretched straight. The woman then straddles him backward, grasping the jade stalk to probe the chamber’s gate, threading the zither strings. Once the jade stem stands firm, she employs the method of shallow and deep thrusts, thereby nourishing blood, circulating qi, and relieving soreness in the four limbs. Its method resembles the jade hare’s swift leaps—now crouching, now bounding, appearing and vanishing unpredictably. So long as one does not lose their essence, they may seize the toad’s spirit in the ninefold heavens.\n\n**Eighth, the Fish Kissing Posture.**\nHave two women, one supine and one prone, embrace each other in the act of union. Their *yin* gates meet and naturally rub together, like fish mouths opening as they nibble at duckweed. The man sits to one side, awaiting the crimson tide’s rise. First, he explores the meeting point with his hand, then positions the stem between them, seizing the moment to insert it into both, uniting them in shared pleasure. It greatly strengthens sinews and bones, doubles one’s vigor, warms the center, and remedies the five taxations and seven injuries. Its method resembles fish frolicking among the waterweeds—sipping the clear and spitting the turbid is its essential principle.\n\n**Ninth, the Crane Mating Posture.**\nHave the woman embrace the man’s neck, her right foot resting upon the bed. The man lifts her left thigh with his right hand, hoisting it onto his shoulder, their bodies pressed close. Gently withdrawing the jade stalk, he gazes at her water caltrop teeth, then slowly strikes the valley’s fruit, swaying lightly and unhurriedly. Employing the method of nine shallow and one deep thrust, the flower’s heart suddenly opens, its fragrant fluids soaking through. It preserves the center and guards the spirit, aids digestion and whets the appetite, cures a hundred illnesses, and grants life without hunger. Its method resembles the red-crowned crane’s circling dance—wings outstretched without folding, naturally attaining the wondrous realm.\n\n**(3) On Depth and Shallow Thrusts**\nThe Emperor asked: “The regulation of fire through shallow and deep thrusts is the essential principle of refining the elixir. Yet if the adjustment is improper, each may suffer harm—how is this so?”",
      "overlap_context": " her waist as he inserts the jade stem into the *yin* gate, employing the method of five shallow and six deep thrusts. Withdrawing a hundred times, the jade vise opens wide, essence and saliva overflow, and water and fire achieve harmony, fulfilling the wonders of the cinnabar crucible. Vexation and oppression are dispelled, blood and vessels flow freely, the heart is nourished, and the will is strengthened. Its method resembles the tiger or leopard emerging from the forest to roar in the wind.\"",
      "start_char": 1273,
      "end_char": 2090,
      "start_sentence": 66,
      "end_sentence": 105,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.14834427833557,
      "metadata": {
        "source_file": "dao\\藏外\\素女妙论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "素女答曰：“浅而不足者戾意，深而大过者懊人。 又有三十六种、七十二般之法，能合甜情、益快意，然其理深邃。 ” 帝问曰：“男女交媾之道，行浅深之法则多损伤，而补益者少焉矣。 尝闻有采补秘奥以济人寿，愿示其详。 ” 素女答曰：“男子须察女人情态，亦要固守自身之宝物，勿令轻漏泄。 先将两手掌摩热，坚把握玉茎； 次用浅抽深入之法，耐久战，益美快。 不可太急，不可太慢，又勿尽意深入，深则有所损焉。 刺之琴弦，攻其菱齿，若至其美快之极，女子不觉噤齿，香汗喘吁，目合面热，芳蕊大开，滑液溢流，此快科学研究之极也。 又女子阴中有八名，又名‘八谷’： 一曰琴弦，其深一寸； 二曰菱齿，其深二寸； 三曰妥＃，其深三寸； 四曰玄珠，其深四寸； 五曰谷实，其深五寸； 六曰愈阙，其深六寸； 七曰昆户，其深七寸； 八曰北极，其深八寸。 ”",
      "translated_text": "Lady Su answered: “Shallow thrusts that fall short provoke frustration, while deep thrusts that exceed bring remorse. There are also thirty-six postures and seventy-two variations that can harmonize sweet affection and enhance delight, though their principles run deep.”\n\nThe Emperor asked: “In the Dao of coupling between man and woman, the practice of shallow and deep thrusts often causes harm, with few benefits. I have heard there exists a secret art of ‘gathering and replenishing’ to extend human life—pray, reveal its details.”\n\nLady Su answered: “A man must observe a woman’s emotions and also firmly guard his own treasure, never allowing careless leakage. First, rub both palms until warm, then firmly grasp the jade stalk. Next, employ the method of shallow withdrawals and deep entries, enduring prolonged engagement to heighten pleasure. One must not be too hasty nor too slow, nor plunge to the utmost depth, for excess depth brings harm.\n\nStrike the ‘lute string’ and assault the ‘water caltrop teeth.’ When pleasure reaches its peak, the woman unconsciously clenches her teeth, fragrant sweat breaks forth, breath quickens, eyes close, face flushes, the fragrant pistil fully opens, and slick fluids overflow—this is the utmost pinnacle of blissful cultivation.\n\nMoreover, within the woman’s yin there are eight names, also called the ‘Eight Valleys’:\nFirst, the *Lute String*, one *cun* deep;\nSecond, the *Water Caltrop Teeth*, two *cun* deep;\nThird, the *Secure Nest*, three *cun* deep;\nFourth, the *Mysterious Pearl*, four *cun* deep;\nFifth, the *Valley’s Fruit*, five *cun* deep;\nSixth, the *Healing Gate*, six *cun* deep;\nSeventh, the *Gate of Kun*, seven *cun* deep;\nEighth, the *Northern Pole*, eight *cun* deep.”",
      "overlap_context": "enter and guards the spirit, aids digestion and whets the appetite, cures a hundred illnesses, and grants life without hunger. Its method resembles the red-crowned crane’s circling dance—wings outstretched without folding, naturally attaining the wondrous realm.\n\n**(3) On Depth and Shallow Thrusts**\nThe Emperor asked: “The regulation of fire through shallow and deep thrusts is the essential principle of refining the elixir. Yet if the adjustment is improper, each may suffer harm—how is this so?”",
      "start_char": 2090,
      "end_char": 2461,
      "start_sentence": 106,
      "end_sentence": 126,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.01874566078186,
      "metadata": {
        "source_file": "dao\\藏外\\素女妙论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "帝问曰：“交合所伤，亦生何病？ ” 素女答曰：“交会之要，切忌太深，深则伤于五脏。 若至谷实则伤肝，其病眼昏眵泪，四肢不遂； 至愈阙则伤肺，其病恶心哕逆，痰喘昏晕； 至昆户则伤脾，面黄腹胀，烦懑冷痢； 至北极则伤肾，腰脚痿软，骨蒸潮热； 忽浅忽深则伤心，其人面热虚嗽，梦魇遗精。 所以交合不可太深。 女子丹穴在脐下三寸，勿令伤之。 又不可太速，不可太慢，太速则伤血，太慢则损气，并有损而无益焉矣。 ” 帝问曰：“火候调度浅深之要既审领之，损害之理亦不可忽之。 尚有禁忌之功者，冀无吝之。 ”",
      "translated_text": "The Emperor asked, “What illnesses arise from harm caused by intercourse?”\n\nSu Nü replied, “The essence of union lies in avoiding excessive depth, for deep penetration injures the five viscera. If it reaches the *Valley’s Fruit*, the liver is harmed, giving rise to dimmed vision, eye discharge, tears, and paralysis of the limbs. If it reaches the *Healing Gate*, the lungs are harmed, causing nausea, retching, phlegm, wheezing, and dizziness. If it reaches the *Gate of Kun*, the spleen is harmed, resulting in a sallow complexion, abdominal distension, restlessness, and cold dysentery. If it reaches the *Northern Pole*, the kidneys are harmed, leading to weakness in the waist and legs, bone steaming, and tidal fever. Sudden shifts between shallow and deep penetration injure the heart, causing facial heat, consumptive cough, nightmares, and seminal emission. Thus, intercourse must not be too deep. The woman’s cinnabar cavity lies three *cun* below the navel—take care not to injure it. Nor should it be too swift or too slow: excessive speed harms the blood, while excessive slowness depletes the *qi*, both bringing harm without benefit.”\n\nThe Emperor asked, “Having grasped the essentials of regulating the ‘fire phase’ and adjusting depth, one must not overlook the principles of harm. Are there further prohibitions to be observed? Pray, do not withhold them.”",
      "overlap_context": " utmost pinnacle of blissful cultivation.\n\nMoreover, within the woman’s yin there are eight names, also called the ‘Eight Valleys’:\nFirst, the *Lute String*, one *cun* deep;\nSecond, the *Water Caltrop Teeth*, two *cun* deep;\nThird, the *Secure Nest*, three *cun* deep;\nFourth, the *Mysterious Pearl*, four *cun* deep;\nFifth, the *Valley’s Fruit*, five *cun* deep;\nSixth, the *Healing Gate*, six *cun* deep;\nSeventh, the *Gate of Kun*, seven *cun* deep;\nEighth, the *Northern Pole*, eight *cun* deep.”",
      "start_char": 2461,
      "end_char": 2701,
      "start_sentence": 127,
      "end_sentence": 141,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.015307188034058,
      "metadata": {
        "source_file": "dao\\藏外\\素女妙论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "素女答曰：“炼丹避忌，若误犯之，大者天地夺其寿算，鬼神殃其身，三彭窥其隙，抱疾罹厄； 其生儿夭促，不慧不肖，或顽劣凶恶，遗害于父母。 可不谨哉！ 夫天地晦冥震动之时，迅雷烈风暴雨之日，及晦朔弦望、大寒酷暑、日月薄蚀、神圣诞辰、庚申甲、自己本命之辰、三元八节、五月五日、月煞月被、披麻红杀，皆不可犯焉。 又天地五岳川渎祠坛之近侧、神圣祠宇，及诸神鬼像前、井灶溜厕之傍，各有害，多令人夭亡或生怪形奇状之子也，交媾之际，亦有避忌。 大饥勿犯，大饱勿犯，大醉勿犯，神劳力倦勿犯，忧愁悲恐勿犯，病新瘥勿犯，丧服勿犯，女子经中勿犯。 ” （四）五欲五伤篇",
      "translated_text": "Lady Su answered: “In refining the elixir, one must avoid taboos. If these are mistakenly violated, at worst Heaven and Earth will strip away one’s allotted years, spirits will bring calamity upon the body, and the Three Peng will spy an opening to cling to illness and misfortune. The children born will be short-lived, dull-witted, or unfilial—some will be obstinate and vicious, bringing harm to their parents. How can one not be cautious?\n\nWhen Heaven and Earth are dark and trembling, during thunderclaps, fierce winds, or violent storms, on the last and first days of the lunar month, the crescent and full moons, in extreme cold or scorching heat, during solar or lunar eclipses, on the birthdays of sages and deities, the days of *gengshen* and *jiazi*, one’s own natal day, the Three Primordials and Eight Festivals, the fifth day of the fifth month, days of lunar inauspiciousness or affliction, or under the baleful influences of *pima* and *hongsha*—on all these, one must not transgress.\n\nMoreover, near the altars of Heaven and Earth, the Five Peaks, rivers and streams, sacred shrines, or before images of deities and spirits, as well as beside wells, stoves, drains, or latrines—each of these places brings harm, often causing early death or the birth of children with monstrous or bizarre forms. There are also taboos to observe during intercourse:\n\nDo not transgress when ravenously hungry, overly sated, severely intoxicated, mentally exhausted or physically fatigued, grieving, sorrowful, or terrified. Do not transgress when newly recovered from illness, in mourning, or when the woman is menstruating.” *(Section Four: The Five Desires and Five Harms)*",
      "overlap_context": "ntercourse must not be too deep. The woman’s cinnabar cavity lies three *cun* below the navel—take care not to injure it. Nor should it be too swift or too slow: excessive speed harms the blood, while excessive slowness depletes the *qi*, both bringing harm without benefit.”\n\nThe Emperor asked, “Having grasped the essentials of regulating the ‘fire phase’ and adjusting depth, one must not overlook the principles of harm. Are there further prohibitions to be observed? Pray, do not withhold them.”",
      "start_char": 2701,
      "end_char": 2971,
      "start_sentence": 142,
      "end_sentence": 149,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.89233922958374,
      "metadata": {
        "source_file": "dao\\藏外\\素女妙论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "帝问曰：“少壮努力，则有衰败之患。 欢乐之极，必多哀伤。 至人节之以道，故曰御百女寿比天地。 而今人不至半百，筋痿肉脱，火盛水枯，终为败物者，何乎？ ” 素女答曰：“凡人，有五欲、五伤、十动之候，若得其宜，则意满欲足； 不得其宜，则各有所伤。 “五欲之候： “第一，面上潮红者，其意有所思欲，先刺入玉茎，徐徐摇动，慢慢抽出，多在户外，探其情； 第二，鼻孔吐气者，欲火微动，先以玉茎穿阴户，刺其谷实，不可太深，宜俟火候之至； 第三，咽喉干嗄者，情动火炽。 抽玉茎，俟其眼闭舌吐、喘气为声，出入任意，渐至佳境。 第四，红球浸润者，心火大盛，刺之则滑泽外溢，轻及菱齿，一左一右，一缓一急，随便如法； 第五，金莲擎抱者，火候既足焉，必以足缠腰上，两手搂肩背，舌吐不缩，宜刺愈阙，其时四肢通快。 “五伤之候： “第一，阴户尚闭未开者，不可刺之，刺之伤肺，肺伤则痰喘声喝； 第二，情兴已至，金茎软痿，其兴过而后渐交者，伤心，心伤则经水不调； 第三，以少阴合老阳，欲火空燃，而不得所欲者，伤肝，肝伤则心眩目昏； 第四，欲足情满，阳兴未休者，伤肾，肾伤则带下崩漏； 第五，月厄未尽遇逼合者，伤脾，脾伤则，颜色痿黄。 “十动之候： “一、玉手抱男背，下体自动，援吐舌相偎者，令男子动情，兴之候也； 二、芳体仰卧，直伸手足而不动，鼻中微发喘急者，欲刺抽之候也； 三、伸腕开掌，握睡汉之玉槌而动转者，垂涎之候也； 四、言语戏喋，眼来眉去，时发懊之声者，春情极到之候也； 五、自以两手抱金莲，露张玄牝之门者，情熟意快之候也； 六、口含玉如意，如醉如睡，阴中隐痒者，俗浅深奔突之候也； 七、长伸金莲，勾挽玉槌，如进如退，低发呻吟者，阴潮涌来之候也； 八、忽得所欲，而微微转腰，香汗未彻，时带笑容者，恐阳气发泄兴情已尽之候也； 九、甜情已到，美快渐多，精液发泄，尚抱搂紧紧者，意未满之候也； 十、身热汗洽，足缓手慢者，情极愿足之候也。 ” （五）大伦篇",
      "translated_text": "The Emperor asked: “Those who exert themselves in youth and vigor may yet face decline and decay. Excessive joy must bring sorrow in its wake. The perfected person regulates these through the Dao, and thus it is said that one who masters the union with a hundred women may attain a lifespan matching Heaven and Earth. Yet today, men do not reach half a century before their sinews wither, their flesh sags, their fire rages while their water dries, and they become ruined beings—why is this?”\n\nThe Plain Girl replied: “In all people, there are the five desires, five harms, and ten signs of arousal. If these are managed appropriately, the mind is satisfied and desire fulfilled; if mismanaged, each brings its own harm.\n\n**The Five Signs of Desire:**\n1. When the face flushes crimson, the mind harbors thoughts of desire. First, let the jade stem enter, then gently rock and slowly withdraw, often at the gate’s threshold, to gauge her inclination.\n2. When breath escapes through the nostrils, the fire of desire stirs faintly. Let the jade stem penetrate the jade gate and pierce the valley’s fruit, but not too deeply—wait for the fire to reach its proper moment.\n3. When the throat grows parched, passion blazes. Withdraw the jade stem and await the moment when her eyes close, her tongue extends, and her breath comes in gasps. Then move freely, gradually ascending to bliss.\n4. When the red pearl glistens with moisture, the heart’s fire burns fiercely. Piercing it will cause slickness to overflow. Lightly touch the water caltrop teeth, alternating left and right, slow and swift, following her rhythm as the method dictates.\n5. When the golden lotus clings in embrace, the fire has reached its fullness. Her feet must coil around his waist, her hands clasp his shoulders and back, her tongue extend without retreat. Then pierce the jade gate ever more deeply, and all four limbs will know perfect ease.\n\n**The Five Signs of Harm:**\n1. If the jade gate remains closed and unopened, do not pierce it, for this harms the lungs. Lung injury brings phlegm and wheezing, a hoarse voice.\n2. When passion has risen but the jade stem wilts and softens, and union occurs only after desire has waned, this harms the heart. Heart injury disrupts the menstrual flow.\n3. When a young yin joins with an aged yang, the fire of desire burns in vain without fulfillment, this harms the liver. Liver injury brings dizziness and dimmed vision.\n4. When desire is sated and passion fulfilled, yet the yang fire does not subside, this harms the kidneys. Kidney injury leads to vaginal discharge and flooding.\n5. When the monthly affliction is not yet ended and one is compelled to union, this harms the spleen. Spleen injury causes the complexion to wither and yellow.\n\n**The Ten Signs of Arousal:**\n1. When she embraces the man’s back with her jade hands, her lower body moves of its own accord, and she extends her tongue to cling close—this is the sign that the man’s passion is stirred and desire awakened.\n2. When her fragrant body lies supine, limbs outstretched and still, and her breath comes in faint, urgent gasps—this is the sign that she awaits piercing and withdrawal.\n3. When she extends her wrist, opens her palm, and grasps the sleeping man’s jade mallet, turning it—this is the sign of drooling desire.\n4. When she chatters playfully, her eyes beckon and her brows signal, and she occasionally utters sighs of longing—this is the sign that spring passion has reached its peak.\n5. When she clasps her golden lotuses with both hands, baring the gate of the mysterious valley—this is the sign of ripened passion and swift delight.\n6. When she holds the jade scepter in her mouth, appearing drunk or drowsy, and her yin itches within—this is the sign for shallow and deep thrusts.\n7. When she stretches her golden lotuses long, hooking and drawing the jade mallet, advancing and retreating, and softly moans—this is the sign that the yin tide surges.\n8. When she suddenly attains her desire, subtly arches her waist, her fragrant sweat not yet dried, and a smile lingers—this is the sign that yang qi is spent and passion exhausted.\n9. When sweet passion has arrived, bliss grows ever greater, essence is released, yet she still clings tightly—this is the sign that her desire is not yet fulfilled.\n10. When her body grows hot and sweat soaks her, her feet slacken and her hands slow—this is the sign that passion has reached its peak and her wish is satisfied.” *(Section Five: The Great Principle)*",
      "overlap_context": " drains, or latrines—each of these places brings harm, often causing early death or the birth of children with monstrous or bizarre forms. There are also taboos to observe during intercourse:\n\nDo not transgress when ravenously hungry, overly sated, severely intoxicated, mentally exhausted or physically fatigued, grieving, sorrowful, or terrified. Do not transgress when newly recovered from illness, in mourning, or when the woman is menstruating.” *(Section Four: The Five Desires and Five Harms)*",
      "start_char": 2971,
      "end_char": 3830,
      "start_sentence": 150,
      "end_sentence": 182,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.661922454833984,
      "metadata": {
        "source_file": "dao\\藏外\\素女妙论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "帝问曰：“人之大伦，有夫妇而后有子孙。 妇德妇貌，不可不撰乎？ ” 素女答曰：“妇德，内美也； 妇貌，外美也。 先相其皮，而后相内。 若妇人发焦黑，骨大肉粗，肥瘦失度，长短非常，年岁不合者，子孙不育。 言语雄壮，兴动暴忽，阴内干涩，子宫不暖，及淋露赤白浊沥胡臭者，大损阳气。 ” 帝问曰：“损伤阳气之说已闻之。 或以药饵为补导者，如何？ ” 素女答曰：“男女交合，非为淫乐也。 今时之人，不晓修养，勉强临事，故多损精败气，疾病依生焉； 或误饮食服饵而损性丧命，良可哀哉！ ”",
      "translated_text": "The Emperor asked, “Of the great human relations, none precedes husband and wife, for only then may there be descendants. Should not a wife’s virtue and a wife’s beauty be carefully chosen?”\n\nSu Nü replied, “A wife’s virtue is inner beauty; a wife’s appearance is outer beauty. First observe her skin, then her inner qualities. If a woman’s hair is scorched and black, her bones large and flesh coarse, her plumpness or leanness immoderate, her height unusual, or her age mismatched, she will not bear descendants. If her speech is bold and forceful, her temper sudden and violent, her yin dry and rough, her womb cold, or if she suffers from dripping discharge, red or white turbidity, or foul odor, she greatly harms yang qi.”\n\nThe Emperor asked, “I have heard of the harm to yang qi. Some seek to remedy this with medicinal tonics—what of this?”\n\nSu Nü replied, “The union of man and woman is not for wanton pleasure. People today, ignorant of cultivation and self-nurturance, force themselves in the act, thus often depleting essence and exhausting qi, giving rise to illness. Some, through mistaken diet or reckless consumption of medicines, injure their nature and forfeit their lives—how truly lamentable!”",
      "overlap_context": "rches her waist, her fragrant sweat not yet dried, and a smile lingers—this is the sign that yang qi is spent and passion exhausted.\n9. When sweet passion has arrived, bliss grows ever greater, essence is released, yet she still clings tightly—this is the sign that her desire is not yet fulfilled.\n10. When her body grows hot and sweat soaks her, her feet slacken and her hands slow—this is the sign that passion has reached its peak and her wish is satisfied.” *(Section Five: The Great Principle)*",
      "start_char": 3830,
      "end_char": 4064,
      "start_sentence": 183,
      "end_sentence": 198,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.857023239135742,
      "metadata": {
        "source_file": "dao\\藏外\\素女妙论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "帝问曰：“夫妇之道，为子孙之计，而今无子者，何乎？ ” 素女答曰：“三妇无子，三男无子。 男子精冷滑者、多淫虚惫者、临敌畏缩者、无子也； 妇人性淫见物动情者、子藏虚寒藏门不开者、夫妇不如妒忌火壮者，无子也。 ” 帝问曰：“若人无子，取之以何术乎？ ” 素女答曰：“求子之法，按阴合阳合之数，用黄纱黄绫黄绢之属，造衣被帐褥之类，以黄道吉日，取桃枝书年庚，放之卧内。 又九月三日，取东引桃枝书姓名，插之床上，须察妇人月经已止过三四日，各沐浴炷香，祈天地鬼神，入帐中而为交合。 其时子宫未合闭，故有子也。 御法：进退如法，洗心涤虑，勿戏调戏弄，勿借春药，勿见春宫册。 若犯之，损父母，不利生子。 ”",
      "translated_text": "The Emperor asked, “The Way of husband and wife is for the sake of descendants, yet now there are those who bear no children—why is this?”\n\nSu Nü replied, “There are three types of women who bear no children, and three types of men who bear no children. Men whose essence is cold and slippery, those who indulge excessively in dissipation and depletion, or those who falter and shrink back when facing the act—these bear no children. Women whose nature is wanton and stirred by mere sight, whose womb is depleted and cold or whose womb-gate does not open, or whose jealousy burns like fire—these bear no children.”\n\nThe Emperor asked, “If a person has no children, by what method may they be obtained?”\n\nSu Nü replied, “The method for seeking children follows the numbers of yin and yang conjunction. Use yellow gauze, yellow silk, or yellow damask to make clothing, bedding, curtains, and quilts. On an auspicious day of the yellow Dao, take a peach branch and inscribe the year and stem-branch of birth, placing it within the bedchamber. Also, on the third day of the ninth month, take a peach branch extending eastward, inscribe the names upon it, and insert it above the bed. One must then observe when the woman’s monthly flow has ceased for three or four days. Both should bathe, burn incense, and pray to Heaven, Earth, ghosts, and spirits. Then, entering the curtains, they may unite in the act. At that time, the womb-gate has not yet closed, and thus a child may be conceived.\n\nThe method of union: advance and withdraw in accordance with the proper way, purify the heart and cleanse the mind. Do not engage in playful teasing or wanton frolic, do not rely on aphrodisiacs, and do not view erotic illustrations. If these are violated, it harms the parents and is unfavorable for bearing children.”",
      "overlap_context": "harms yang qi.”\n\nThe Emperor asked, “I have heard of the harm to yang qi. Some seek to remedy this with medicinal tonics—what of this?”\n\nSu Nü replied, “The union of man and woman is not for wanton pleasure. People today, ignorant of cultivation and self-nurturance, force themselves in the act, thus often depleting essence and exhausting qi, giving rise to illness. Some, through mistaken diet or reckless consumption of medicines, injure their nature and forfeit their lives—how truly lamentable!”",
      "start_char": 4064,
      "end_char": 4359,
      "start_sentence": 199,
      "end_sentence": 212,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.490996837615967,
      "metadata": {
        "source_file": "dao\\藏外\\素女妙论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "帝问曰：“阴阳之道，名之为交接者，何乎？ ” 素女答曰：“阴阳交合，男施女接，故名之为交接也。 女人阴中自有明兆焉，无刺琴弦而及菱齿，美快之极，放露真宝，阴血包阳精则生男，阳精包阴血，则生女。 谓之阴阳交接之道矣。 ” 帝问曰：“交接，人伦之原也。 而有不相和悦者，何故也乎？ ” 素女答曰：“盖因女子不能察丈夫之意，男子亦不晓妇人之性，此不达人伦之道、生育继嗣之理也。 各顽劣多淫，各怀不足，互填愤怨； 或弃自己妻妄而通外妇，又欺丈夫而野合奸淫； 又男子痿软不满欲情，或强阳悍无休息，后终生厌恶。 ” 帝问曰：“夫妻亲睦相敬爱者，人伦之常也。 而敬爱之情，因何乎生焉？ ”",
      "translated_text": "The Emperor asked, “The Way of yin and yang is called ‘union’—why is this so?”\n\nSu Nü replied, “When yin and yang unite, the man emits and the woman receives—hence it is called ‘union.’ Within the woman’s yin there are natural signs: without striking the zither’s strings or reaching the water caltrop’s teeth, the utmost pleasure is attained, and the true treasure is revealed. When yin blood envelops yang essence, a son is born; when yang essence envelops yin blood, a daughter is born. This is the Way of yin-yang union.”\n\nThe Emperor asked, “Union is the origin of human relations. Yet why do some fail to harmonize and delight in one another?”\n\nSu Nü replied, “This arises because women cannot discern their husbands’ intentions, and men do not understand their wives’ nature—thus they fail to grasp the Way of human relations and the principle of procreation and lineage. Each may be stubborn and licentious, each harboring dissatisfaction, mutually fostering resentment. Some abandon their own wives to recklessly consort with other women, while others deceive their husbands to engage in illicit unions. Some men suffer from impotence and fail to satisfy desire, while others possess unyielding virility without respite—eventually leading to mutual aversion.”\n\nThe Emperor asked, “When husband and wife are intimate, respectful, and loving, this is the norm of human relations. Yet from what does such reverence and love arise?”",
      "overlap_context": "y to Heaven, Earth, ghosts, and spirits. Then, entering the curtains, they may unite in the act. At that time, the womb-gate has not yet closed, and thus a child may be conceived.\n\nThe method of union: advance and withdraw in accordance with the proper way, purify the heart and cleanse the mind. Do not engage in playful teasing or wanton frolic, do not rely on aphrodisiacs, and do not view erotic illustrations. If these are violated, it harms the parents and is unfavorable for bearing children.”",
      "start_char": 4359,
      "end_char": 4645,
      "start_sentence": 213,
      "end_sentence": 229,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.873628616333008,
      "metadata": {
        "source_file": "dao\\藏外\\素女妙论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "素女答曰：“既济者，顺也； 未济者，逆也。 八庚相合，少壮应时者，顺也； 八字不协，老幼不遇者，逆也。 才貌两全，意气相合者，顺也； 蠢丑相背，狠戾反目者，逆也。 但恩受契合则生敬恭，敬恭则富贵长命而子孙蕃育。 ” （六）大小长短篇 帝问曰：“男子宝物，有大小长短硬软之别者，何也？ ” 素女答曰：“赋形不同，各如人面。 其大小长短硬软之别，共在禀赋，故人短而物雄，人壮而物短，瘦弱而肥硬，胖大而软缩。 或有专车者，有抱负者，有肉怒筋胀者，而无害交会之要也。 ” 帝问曰：“郎中有大小长短硬软之不同，而取交接快美之道，亦不同乎？ ” 素女答曰：“赋形不同，大小长短异形者，外观也； 取交接快美者，内情也。 先以爱敬系之，以真情按之，何论大小长短哉！ ” 帝问曰：“硬软亦有别乎？ ” 素女答曰：“长大而萎软，不及短小而坚硬也； 坚硬而粗暴，不如软弱而温藉也。 能得中庸者，可谓尽美尽善焉矣。 ” 帝问曰：“方外之士，能用药物，短小者令其长大，软弱者令其坚硬，恐遗后患乎？ 将有补导之益乎？ ” 素女答曰：“两情相合，气运贯通，则短小者自长大，软弱者自坚硬也。 有道之士能之，故御百女而不痿。 得修养之术，则以阴助阳，呼吸吐纳，借水救火，固济真宝，终夜不泄，久久行之，则益寿除疾。 若用五石壮阳之药，腽肭增火之剂，虚炎独烧，真阳涸渴，其害不少。 ” 帝问曰：“有修养之术者，亦不禁乎？ ” 素女答曰：“气运巡环，临事而合，应时而止，只量力而施，其余勉强迷惑，则修养之士亦至枯败焉。 服药三朝，不如独宿一宵，前哲之诫也。 ” （七）养生篇",
      "translated_text": "Su Nü replied, “When the union is harmonious, it is aligned with the Dao; when it is discordant, it runs counter to it. When the Eight Characters align and youth and vigor meet in due time, this is alignment with the Dao. When the Eight Characters clash and age and youth fail to meet, this is counter to it. When talent and beauty are both complete and temperaments harmonize, this is alignment with the Dao. When the dull and ugly turn their backs on each other and cruelty and hostility arise, this is counter to it. Yet when affection and mutual accord take root, reverence and respect arise; with reverence and respect come wealth, nobility, longevity, and flourishing descendants.”\n\n---\n\n**6. On Size and Proportion**\nThe Emperor asked, “Why do men’s treasures differ in size, length, hardness, and softness?”\n\nSu Nü replied, “Their forms are bestowed differently, just as human faces vary. The distinctions in size, length, hardness, and softness all depend on one’s endowment. Thus, a man may be short yet his treasure mighty, or robust yet his treasure small; lean and weak yet firm and hard, or stout and large yet soft and shrinking. Some resemble a carriage axle, others can be embraced, and still others swell with flesh and bulging veins—yet none of these hinder the essentials of union.”\n\nThe Emperor asked, “Since men’s members differ in size, length, hardness, and softness, do the methods for achieving pleasurable union also differ?”\n\nSu Nü replied, “Different endowments in size, length, and form are external matters; the key to pleasurable union lies in the inner disposition. First bind them with love and respect, then guide them with sincerity—what need is there to debate size, length, or proportion?”\n\nThe Emperor asked, “Do hardness and softness also differ in their effects?”\n\nSu Nü replied, “Long and large yet limp and soft is inferior to short and small yet firm and hard. Firm and hard yet coarse and violent is not as good as soft and weak yet gentle and considerate. One who attains the mean may be called perfect in both beauty and goodness.”\n\nThe Emperor asked, “Those who practice external arts may use medicines to enlarge the small or stiffen the soft. Do such methods risk future harm, or do they offer strengthening benefits?”\n\nSu Nü replied, “When two hearts unite and qi flows unimpeded, the small naturally grows larger and the soft naturally hardens. Those who master the Dao can achieve this, coupling with a hundred women without wilting. Through cultivation and nurturing, one may use yin to assist yang, regulate breath through inhalation and exhalation, draw water to quench fire, and secure the true treasure—remaining unsated through the night without emission. Practiced over time, this prolongs life and dispels illness. But if one resorts to minerals to invigorate yang or seal oil to stoke the fire, the false flame burns alone, true yang withers and dries—such harm is not insignificant.”\n\nThe Emperor asked, “Are even those who practice cultivation unrestrained?”\n\nSu Nü replied, “Qi circulates in cycles; one should unite when the time is right and cease when the moment passes, expending only what one’s strength allows. To force or indulge in excess is to invite exhaustion and ruin, even for those who cultivate. ‘Taking medicine for three days is not as good as sleeping alone for one night’—such was the warning of the sages of old.”\n\n---\n\n**7. On Nurturing Life**",
      "overlap_context": "isfaction, mutually fostering resentment. Some abandon their own wives to recklessly consort with other women, while others deceive their husbands to engage in illicit unions. Some men suffer from impotence and fail to satisfy desire, while others possess unyielding virility without respite—eventually leading to mutual aversion.”\n\nThe Emperor asked, “When husband and wife are intimate, respectful, and loving, this is the norm of human relations. Yet from what does such reverence and love arise?”",
      "start_char": 4645,
      "end_char": 5311,
      "start_sentence": 230,
      "end_sentence": 270,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.693948984146118,
      "metadata": {
        "source_file": "dao\\藏外\\素女妙论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "帝问曰：“养生之道，以何为本？ ” 素女答曰：“养生之道，以气为本。 气能运血，血能化精，精能养神，神在则生，神散则死也。 气者，神之本也。 能炼气者，入火不焦，入水不溺。 固守其精而不散，故终夜御女而不泄。 若不能保守精神，而狂妄任意者，必失神丧气，名之为夺命之斧。 ” 帝问曰：“若人专守养生之道而不行夫妇房帏之礼，则人伦已绝，后继将断。 ” 素女答曰：“凡人年少之时，血气未充足，戒之在色，不可过欲暴泄。 年已及壮，精气满溢，固精厌欲，则生奇病。 故不可不泄，不可太过，亦不可不及。 ”帝问曰：“时泄而遣其兴，能其精而养神乎？ ” 素女答曰：“不然也。",
      "translated_text": "The Emperor asked, “In the Way of nurturing life, what is the foundation?”\n\nSu Nü replied, “The Way of nurturing life takes qi as its foundation. Qi moves the blood, blood transforms into essence, essence nourishes the spirit—where the spirit abides, there is life; where the spirit scatters, there is death. Qi is the root of the spirit. One who refines qi enters fire without burning, enters water without drowning. Firmly guarding essence without dissipation, one may lie with a woman through the night without emission. But those who cannot preserve their spirit and act recklessly will surely lose their spirit and forfeit their qi—this is called the axe that severs life.”\n\nThe Emperor asked, “If one adheres solely to the Way of nurturing life and neglects the rites of the bedchamber between husband and wife, human relations will be severed, and posterity will be cut off.”\n\nSu Nü replied, “In youth, when blood and qi are not yet full, one must guard against excess in desire and avoid violent depletion. In the prime of life, when essence and qi overflow, forcibly restraining essence and suppressing desire will give rise to strange illnesses. Thus, one must not refrain entirely, nor go to excess, nor fall short.”\n\nThe Emperor asked, “If one times emissions to dispel arousal, can one preserve essence and nourish the spirit?”\n\nSu Nü replied, “It is not so.”",
      "overlap_context": "t insignificant.”\n\nThe Emperor asked, “Are even those who practice cultivation unrestrained?”\n\nSu Nü replied, “Qi circulates in cycles; one should unite when the time is right and cease when the moment passes, expending only what one’s strength allows. To force or indulge in excess is to invite exhaustion and ruin, even for those who cultivate. ‘Taking medicine for three days is not as good as sleeping alone for one night’—such was the warning of the sages of old.”\n\n---\n\n**7. On Nurturing Life**",
      "start_char": 5311,
      "end_char": 5588,
      "start_sentence": 271,
      "end_sentence": 287,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.544589042663574,
      "metadata": {
        "source_file": "dao\\藏外\\素女妙论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "若常泄而偶不漏，反生疮痈； 常秘而偶泄，则患暴虚。 各害养生之道。 ” 帝问曰：“男子精血盈满，神气充足，何以知之乎？ ” 素女答曰：“男子二八天癸至，而血气不足，精神未定，故戒之也。 年至二十，血气渐盛，而精聚肠胃，三十日而一泄焉。 三十而血气壮盛，而精在两股，五日一泄焉。 年四十，精聚要脊，七日一泄焉。 五十而血气将衰，精聚背膂，半月一泄。 年至六十四岁，天癸尽，卦数满，血气衰，精液竭矣。 六十已上，能保全余气，兴壮者尚可泄。 至七十，不可妄思欲动情。 ” 帝问曰：“朊知无赖之子，自赖强壮，一日三泄或五泄者，何乎？ ” 素女答曰：“暴泄者暴虚，后必痿辟。 若泄而不休，自招天亡。 ” 帝问曰：“人阳气夜间勃然起立，腾然兴发者，何？ ” 素女答曰：“晨昼暮夜，此一日中之四时也。 故阳气生子时，于卦为复； 至丑时而二阳生下，于卦为临； 寅时三阳已全，于卦为泰。 若人半夜暴泄，则阳精枯损，年未五十，必发头晕腑痛目昏耳塞。 又有五伤： 其一，男女交会，精泄而少者，为气伤； 其二，精出而者，为肉伤； 其三，泄而疼者，为筋伤； 其四，精出而涩者，为骨作； 其五，临门忽痿垂涎者，为血伤。 各泄精过度、精液竭乏所致，何可不谨哉！ ” （八）四至九到篇",
      "translated_text": "If one regularly emits but occasionally retains, sores and ulcers may arise; if one habitually restrains but suddenly releases, one may suffer sudden depletion—both harm the Way of nurturing life.”\n\nThe Emperor asked, “How can one know when a man’s essence and blood are full and his spirit and qi are abundant?”\n\nSu Nü replied, “At sixteen, when *tian gui* arrives, a man’s blood and qi are still insufficient, and his spirit unsettled—thus he must be cautioned. By twenty, his blood and qi gradually flourish, and his essence gathers in the intestines and stomach, to be emitted once every thirty days. At thirty, when his blood and qi are robust, his essence resides in the thighs, to be emitted once every five days. At forty, his essence gathers in the lumbar spine, to be emitted once every seven days. At fifty, as his blood and qi begin to wane, his essence collects in the back and spine, to be emitted once every fifteen days. By sixty-four, *tian gui* is exhausted, the hexagram’s measure is complete, his blood and qi decline, and his seminal essence is spent. After sixty, if one can preserve residual qi and remain vigorous, emission is still possible. By seventy, one must not recklessly indulge in desire or stir the passions.”\n\nThe Emperor asked, “How is it that some reckless youths, relying on their strength, emit three or even five times a day?”\n\nSu Nü replied, “Excessive emission leads to sudden depletion, and later, impotence and debility. If one emits without respite, one invites early death.”\n\nThe Emperor asked, “Why does a man’s yang qi rise vigorously at night, stirring arousal?”\n\nSu Nü replied, “Morning, noon, dusk, and night—these are the four seasons within a day. Thus, yang qi begins to stir at the *zi* hour, corresponding to the hexagram *Fu* (Return); by the *chou* hour, a second yang arises below, corresponding to *Lin* (Approach); by the *yin* hour, the three yang are complete, corresponding to *Tai* (Peace). If one emits violently at midnight, yang essence will wither and deplete—before fifty, one will surely suffer dizziness, visceral pain, dimmed vision, and blocked ears. There are also five injuries: first, if a man emits little during intercourse, it injures his qi; second, if his essence flows sluggishly, it injures his flesh; third, if emission is painful, it injures his sinews; fourth, if his essence is viscous, it harms his bones; fifth, if he suddenly wilts at the threshold, drooling, it injures his blood. All these stem from excessive emission and the exhaustion of seminal essence—how can one not be cautious!”",
      "overlap_context": " cut off.”\n\nSu Nü replied, “In youth, when blood and qi are not yet full, one must guard against excess in desire and avoid violent depletion. In the prime of life, when essence and qi overflow, forcibly restraining essence and suppressing desire will give rise to strange illnesses. Thus, one must not refrain entirely, nor go to excess, nor fall short.”\n\nThe Emperor asked, “If one times emissions to dispel arousal, can one preserve essence and nourish the spirit?”\n\nSu Nü replied, “It is not so.”",
      "start_char": 5588,
      "end_char": 6116,
      "start_sentence": 288,
      "end_sentence": 323,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.702378749847412,
      "metadata": {
        "source_file": "dao\\藏外\\素女妙论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "帝问曰：“男女好述，未发言语而知其情。 机微慎密，以何术恻之趣之？ ” 素女答曰：“凡男子欲探女子私情，先以言语戏谐挑其意，以乎足扭捏趣其情。 男子有四至，女子有九到，若四不至九不到而交俣者，必有后患。 ” 帝问曰：“男子四至者，若何？ ” 素女答曰：“玉茎不强者，阳气未至也； 刚强而不动者，肌气未至也； 振摇而不怒者，骨气未至也； 怒张而不久者，肾气未至也。 若一不至而犯之，必有损伤。 ” 帝问曰：“女人九到者，若何？ ” 素女答曰：“倦伸欠息，而睡觉朦胧，肺气未到也； 门户不润，屈股不开，心气未到也； 目不流视，举止不忻，脾气未到也； 手扪玉茎而情意不悦，血气未到也； 手软足缓，横卧不动，筋气未到也； 抚弄两乳，意向无味，骨气未到也； 瞬波微动，莺口不开，肝气未到也； 举身向人，桃颊不红，肾气未到也； 玉关仅润，口中不渴，液气未到也。 九候已到而后行九浅一深之法，则阴阳调和，情思缠绵。 能助阳气，补虚之劳损。 帝问曰：“何为九浅一深之法？ ”",
      "translated_text": "The Emperor asked, “When a man and woman delight in intimacy, how can one discern their feelings before words are spoken? The subtleties are delicate and concealed—by what art may one gauge and arouse their desire?”\n\nSu Nü replied, “Whenever a man seeks to probe a woman’s private feelings, he should first tease her with playful words to stir her intent, then gently touch or press with his hands and feet to kindle her passion. A man has four *arrivals*, and a woman has nine *attainments*—if the four do not arrive and the nine are not attained before coupling, there will surely be later afflictions.”\n\nThe Emperor asked, “What are the man’s four *arrivals*?”\n\nSu Nü replied, “If the jade stem is not firm, his yang qi has not arrived; if it is rigid yet unmoving, his flesh qi has not arrived; if it trembles yet does not swell, his bone qi has not arrived; if it swells yet does not endure, his kidney qi has not arrived. Should even one fail to arrive and he proceeds, there will certainly be harm.”\n\nThe Emperor asked, “What are the woman’s nine *attainments*?”\n\nSu Nü replied, “If she yawns, stretches, and sighs, drowsy and half-awake, her lung qi has not attained; if her gate is dry and her thighs remain closed, her heart qi has not attained; if her eyes do not roam and her movements lack joy, her spleen qi has not attained; if she touches the jade stem yet her mood remains unpleased, her blood qi has not attained; if her hands are limp and feet sluggish, lying still without response, her sinew qi has not attained; if she fondles her breasts yet finds no delight, her bone qi has not attained; if her gaze flickers faintly yet her oriole mouth stays shut, her liver qi has not attained; if she presses her body toward him yet her peach cheeks do not flush, her kidney qi has not attained; if her jade gate is only slightly moist and her mouth is not parched, her fluid qi has not attained. Only when all nine signs have manifested should one proceed with the method of *nine shallow, one deep*—then yin and yang will harmonize, and passion will entwine. This can aid yang qi and remedy depletion and taxation.”\n\nThe Emperor asked, “What is the method of *nine shallow, one deep*?”",
      "overlap_context": "sceral pain, dimmed vision, and blocked ears. There are also five injuries: first, if a man emits little during intercourse, it injures his qi; second, if his essence flows sluggishly, it injures his flesh; third, if emission is painful, it injures his sinews; fourth, if his essence is viscous, it harms his bones; fifth, if he suddenly wilts at the threshold, drooling, it injures his blood. All these stem from excessive emission and the exhaustion of seminal essence—how can one not be cautious!”",
      "start_char": 6116,
      "end_char": 6538,
      "start_sentence": 324,
      "end_sentence": 352,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.174103021621704,
      "metadata": {
        "source_file": "dao\\藏外\\素女妙论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "素女答曰：“浅插九回，深刺一回，每一回以呼吸定息为度，谓之九浅一深之法也。 自琴弦至玄珠为浅，自妥至谷实为深。 凡太浅不美快，太深有所伤。 ” 帝问曰：“丹鼎调度，火候慎微，水火既济之妙既详闻之，尚有余蕴，愿尽其理，博施救世之仁，令万世无夭亡之患，亦无虚羸绝嗣之忧。 ” 素女答曰：“天地交泰，阴阳会施，先察其情兴，审辨其气候到不到，极抽出插入添炭之妙，固济自己阳匮，香吻相偎，吸阴精而补阳气，引鼻气以填脊髓，含津液以养丹田，令泥丸势气透切，贯通四支，溢益气血，驻颜不老。 ” 帝问曰：“采补修养，炼内丹第一妙义也。 含灵之者，不可不达其理焉？ ”",
      "translated_text": "Lady Su Nü replied, “Nine shallow insertions followed by one deep thrust—each cycle measured by the span of a breath—this is the method of *nine shallow, one deep*. From the *qin strings* to the *mysterious pearl* is shallow; from the *tuo* to the *valley’s fruit* is deep. Too shallow brings no pleasure, while too deep risks injury.”\n\nThe Emperor asked, “The alchemical crucible’s regulation, the subtlety of fire timing, and the marvel of water and fire in harmony—I have heard these in detail. Yet there remains more to this treasury of wisdom. I wish to exhaust its principles, that your boundless benevolence may be bestowed to save the world, sparing all generations from premature demise and the sorrow of depletion or barren lineage.”\n\nLady Su Nü replied, “When Heaven and Earth unite in harmony, when yin and yang conjoin in action, first observe her ardor and passion, carefully discern whether her qi signs have fully arrived. Master the art of withdrawal and thrust, the subtlety of adding embers—thus securing your own yang storehouse. Embrace with fragrant kisses, drawing in yin essence to replenish yang qi; inhale through the nose to fill the spinal marrow; hold the divine fluids to nourish the cinnabar field. Let the *niwan*’s potent qi penetrate deeply, coursing through the four limbs, overflowing to enrich blood and qi, preserving youth and forestalling age.”\n\nThe Emperor asked, “The cultivation of gathering and refining, the forging of the inner elixir—this is the foremost marvel of the Dao. How could those endowed with spirit fail to grasp its principles?”",
      "overlap_context": "ained; if she presses her body toward him yet her peach cheeks do not flush, her kidney qi has not attained; if her jade gate is only slightly moist and her mouth is not parched, her fluid qi has not attained. Only when all nine signs have manifested should one proceed with the method of *nine shallow, one deep*—then yin and yang will harmonize, and passion will entwine. This can aid yang qi and remedy depletion and taxation.”\n\nThe Emperor asked, “What is the method of *nine shallow, one deep*?”",
      "start_char": 6538,
      "end_char": 6814,
      "start_sentence": 353,
      "end_sentence": 363,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.820125818252563,
      "metadata": {
        "source_file": "dao\\藏外\\素女妙论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "素女答曰：“然矣，如帝命。 此延龄益寿之妙要也。 夫天不足西北，故男子阳气有余、阴血不足； 地不满东南，故女子阴血充实、阳气不足。 能达玄微者，以有余补不足，虽至期颐，不改其乐。 快活娱乐，无穷极之时，长生久视，寿俦天地。 宜录之金石，长传后蕊，则普济德泽，亦不少也矣。 ” 帝斋戒沐浴，以其法炼内丹八十一日，寿至一百二十岁。 而丹药已成，铸鼎于湖边，神龙迎降，共素女白日升天。",
      "translated_text": "Lady Su Nü replied, “Indeed, as Your Majesty commands. This is the wondrous essential for prolonging life and enhancing longevity. Now, heaven is deficient in the northwest, thus a man’s yang qi is ever in surplus while his yin blood is insufficient; earth is incomplete in the southeast, thus a woman’s yin blood is replete while her yang qi is lacking. Those who grasp the profound subtleties take the surplus to replenish the deficient—though they reach a hundred years, their joy remains unaltered. Delight and merriment know no end, and long life with enduring vision spans the heavens and earth. It is fitting to inscribe this upon metal and stone, that it may be transmitted to later generations, for the universal relief of virtue and grace shall be no small thing.”\n\nThe Emperor purified himself with fasting and ablutions, then refined his inner elixir according to the method for eighty-one days. His years extended to one hundred and twenty, and when the cinnabar medicine was complete, he cast a tripod by the lakeside. A divine dragon descended to welcome him, and together with Lady Su Nü, he ascended to heaven in broad daylight.",
      "overlap_context": " in yin essence to replenish yang qi; inhale through the nose to fill the spinal marrow; hold the divine fluids to nourish the cinnabar field. Let the *niwan*’s potent qi penetrate deeply, coursing through the four limbs, overflowing to enrich blood and qi, preserving youth and forestalling age.”\n\nThe Emperor asked, “The cultivation of gathering and refining, the forging of the inner elixir—this is the foremost marvel of the Dao. How could those endowed with spirit fail to grasp its principles?”",
      "start_char": 6814,
      "end_char": 6999,
      "start_sentence": 364,
      "end_sentence": 373,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.706750392913818,
      "metadata": {
        "source_file": "dao\\藏外\\素女妙论.txt",
        "category": "藏外"
      }
    }
  ]
}