{
  "source_id": "紫元君授道传心法",
  "source_file": "chunked_daozang\\紫元君授道传心法.json",
  "total_chunks": 3,
  "total_original_chars": 3202,
  "total_translated_chars": 19007,
  "total_translation_time": 121.91297721862793,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\方法类\\紫元君授道传心法.txt",
    "category": "方法类"
  },
  "full_translation": "**The Purple Primordial Sovereign’s Transmission of the Dao: Heart-Method Teachings**\n*Commentary by the Perfected One of Longevity and Yin*\n\nThe *Purple Primordial Sovereign’s Transmission of the Dao: Heart-Method Teachings* is traditionally attributed to the Perfected One of Longevity and Yin. It is suspected that this text emerged during the Tang dynasty. Comprising one scroll, the present edition is derived from the *Daoist Canon of the Zhengtong Era*, under the \"Methods\" category of the *Compendium of Cavernous Truth*.\n\n---\n\nTo transmit the Dao, first transmit the heart. When the heart is true, the Dao is undivided; when the heart is false, the Dao is not authentic. The will governs the qi within the heart, and when the qi is perfected within, errors naturally align. If one’s nature lacks constancy, qi arises from the heart—thus, the transmission of the Dao rests in the master’s heart. To receive the Dao’s heart is to bend and conform, yet if the heart does not attain it, how can the master’s heart be without duality? The primordial heart is undivided.\n\nThe heart is offered to the master first; if one’s words betray the master’s teachings, they will not attain it. In practice, first observe the heart—if the heart is empty, action will not attain it, and the master’s heart will perceive the error. Words arise from the absence of heart; to study the Dao, first refine the heart. If one’s own heart is not true, the oral transmission of the Dao becomes mere empty talk, deceiving others and oneself. The heart’s original nature turns toward the West, yet the Dao’s heart remains unchanged. In all matters, it is thus: to serve the master, first serve emptiness. To receive instruction is like floating clouds—spending the day in vain delusion, never escaping the realm of birth and death.\n\nThe *Purple Primordial Sovereign’s Transmission of the Dao: Heart-Method Teachings* laments the error of a scattered heart. The Dao must reside in the heart; the heart and mouth must not be divided. Guard your heart well, and the gate of the Dao will naturally arrive. If your heart drifts idly, who will willingly follow it? It is like a person employing three masters—where masters multiply, demonic forces arise. A true master does not leave the gate; false masters invite household spirits to chaos. From this, the heart is troubled, and the affairs of the Dao are lost.\n\nFools deceive the wise-hearted; the common eye deludes the wise eye. The teachings of the Perfected are profound, yet the Dao is never far. To transmit the teachings, first transmit the heart. Daoists, let not your hearts scatter. Though a thousand sayings and ten thousand repetitions be spoken, the true Dao has but one gate. This one gate mirrors the Three Powers; the Three Powers give rise to the Three Elixirs; the Three Elixirs descend from the Three Sovereigns; the Three Sovereigns emerge from the primordial chaos.\n\nFrom chaos, Heaven and Earth were born; Heaven and Earth arrayed the Four Poles. The Four Poles gave rise to creation; creation gave rise to the myriad forms; the myriad forms gave rise to the myriad things; the myriad things gave rise to the one gate—this one gate resides in the one heart.\n\nOf those who study the Dao, how many truly comprehend the supreme lineage of my immortal teachings? The worthy grasp it; the foolish reject it. The Dao, when taught to others, should be imparted by the master to the worthy, not bestowed upon the foolish. To teach the foolish invites reproach, and the fault lies with the master.\n\nSince the inception of Heaven and Earth, my method has been undivided, rooted solely in the primordial qi of chaos. The common folk, in their delusion, seek external methods, losing the primordial Dao. Thus, humanity is subject to death, generation after generation, in numbers beyond count—all for having lost the root of the Dao.\n\nNow, I earnestly discuss the source of the heart, that it may flow to later generations. Within the heart, it is like cinnabar, once refined into liquid mercury, which binds most potently. White snow submits, and qi transforms into a dragon. The clouds ascend in a single transformation; seven returns are as mercury. My five viscera are alchemized like wind and qi, bones strengthened, will fortified, skin and flesh permeated, and clarity attained like a mirror.\n\nWords, though cumbersome, fail to convey it. The medicine lies in the West; north and south must submit. Sun and moon ascend and soar; success rests in the hand, failure in the heart. The master is my father and mother; husband and wife become companions. Beyond the Four Symbols, killing qi prevails. When it nurtures me, I am present; when it silences me, I sink. Align with my Dao’s mechanism, and it will harmonize with my heart.\n\nWhen the literary refinement is complete, clouds and dragons descend from Heaven. The world endures without cease. Scholars, apply your hearts! True words teach the heart; when the heart is true, the Dao is upright. Sincerely cultivate the truth, and the Three Elixirs return to life. The Ninefold Mysterious Gate, divine talismans, and numinous sages—when the One of Heaven attains it, knotted cords serve as proof. All depends on the heart. The essential art is without illness. The Primordial Beginning teaches the heart; the Three Powers are ultimately settled. Bowing in reverence, I return to the words: know the heart, know destiny.\n\nStriking the *Dragon and Tiger Song*, it is said:\nThe Four merge in chaos, the ancestors of the Five Phases.\nFirst, mercury—mercury as agent, agent as qi, qi as sinew.\nSecond, yang within yin—yang as the sun’s soul, the soul as the sun’s essence, essence as yang, yang as father, father as the placenta.\nThird, from white liquid it hardens into solid ice—solid ice is yang within yin, yang as bone. Bone relies on qi to generate white liquid, white liquid as marrow.\nFourth, quicksilver—quicksilver as the qi of flesh, qi as blood, blood transforming into hair. Hair relies on skin to form the dark enclosure, completing the substance.\n\nThus, three months form the body; ten months give birth to the remainder. Two months of bathing complete the year. Ultimately, it receives Heaven’s configuration, cycling through the Five Phases in rotation, named the supreme treasure of Heaven and Earth. As humans receive the upright qi of Heaven and Earth, they too become supreme beings.\n\nThe great Dao’s immortal medicine differs from worldly treasures of value. Gold, silver, coral, agate, pearls, and the like are measured by their merit and price, judged by worth. Only our immortal elixir, radiant as the sun and moon, is the treasure that models Heaven and Earth. Those who ingest it may attain longevity, equal to Heaven and Earth. All relies on the natural primordial qi to achieve the Dao!\n\nThis primordial qi is mist and dew in the sky, springs and sources on Earth. Deep as the azure pool’s hue, it is the natural Dao. Immortal scholars, do not err in intent or mistakenly consume alchemical yellow-and-white medicines. If a Daoist attains my natural Dao, the supreme medicine of the Four Qi in chaos, merely consuming it for a thousand days will reveal the path of spiritual transformation is not far. If the Four Qi are insufficient, spiritual transformation lacks foundation—just as a supreme being with incomplete sun and moon cannot be supreme.\n\nThus we know the perfected person harmonizes the patterns of Heaven and Earth to become sagely, while worldly people take the patterns of temporal things as wisdom. Yet can wisdom alone make one a sage? Only by illuminating one’s own Dao, grasping the world’s opportunities, and moving with the times can one achieve merit and establish the model! Measure one’s undertakings by the depth of one’s nature and the distance of one’s roots—when the time comes, all will be reduced to ashes. Only our Three Clarities Palace’s divine-transformation elixir treasure can preserve life and bestow longevity, equaling Heaven and Earth in duration. This Dao must not be transmitted lightly; transmission depends on finding the right person to entrust.\n\nThe Dao in its origin is formless, its root lying in the mutual encroachment of the Five Phases’ qi. Humans in their origin are not perfected; the heart is what perfects them. If the heart is evil, words become inauspicious; inauspicious words lead to estranged conduct, and estranged conduct prevents the Dao’s completion. Therefore, the three grades of cinnabar are entrusted to the worthy, not to the foolish. The foolish, benighted in worldly matters, may spend their days poring over immortal formulas and scriptures, reciting them endlessly, yet never grasp the nature of the Dao. Nature arises from the heart. Abstaining from grains, ingesting qi, practicing daoyin, cultivating conduct, forgetting to govern the Valley Spirit, stabilizing the hun and po, concentrating the spirit and settling the mind—all methods such as these are but empty gates of the Dao, not the true principle of longevity.\n\nThe Nine-Crucible Elixir employs the fire-qi of the four seasons, deploying civil and martial [techniques] without cease, maturing late like the lord awaiting his time. Great vessels are rare in sound, precious and difficult to acquire—even perfected persons struggle to recognize them. Lead serves as the outer frame, encircling and aiding; malachite acts as the agent, able to regulate wind and rain. Azurite can serve as the agent for all gold elixirs, transforming into qi, qi into sinews, and sinews into great strength. If the medicine is not perfected, it is like azurite’s power as an agent: just as a person without food has no strength, food resembles qi, qi resembles the agent, the agent resembles food—without food, strength fails, and affairs cannot prevail. All merit arises from strength, culminating in great robustness! If the medicine lacks strength, it lacks efficacy and cannot secure the body.\n\nWhite liquid and golden blossoms—ice gives birth to dragon and tiger. Dragon and tiger originally transform in mutual succession from the qi of emptiness, following Heaven’s Dao in responsive transformation, thereby attaining the vessels of the four seasons’ celestial patterns. Each receives its generation, like the four seasons’ steaming and fuming, each having its proper return—thus life and death begin. The Dao in its origin is nameless; it is called dragon and tiger. Dragon and tiger embody the two natures of yin and yang, harmonizing and mutually swallowing the qi of subjugation. What is known arises from the substance of being born of the qi of emptiness. Only by cultivating goodness and eliminating evil can it be accomplished.\n\nThe Three Ones ascend in proper order, bound by unchanging rules. The Three Ones correspond to the three superior cinnabars, each with its method of returning the hun and guarding the One. Discussing the gate of supreme medicine, the method of the four qi’s sinews and bones, blood and flesh in mutual succession, must not err by even a hair’s breadth—never lose the timing of yin and yang. Each month, fire is initiated on the first day, following the method of counting nine nines. This Three Ones method is the internal Three Ones method, employing twelve months of fire-times to govern the twelve hours, matching the twelve positions, traversing the nine palaces, emulating the eight trigrams, and harmonizing the five phases.\n\nThe Yellow Emperor, at the abode of the Royal Person, inquired about the gate of the Three Ones. Thereupon, oral instructions were transmitted, passed down through generations of immortal scholars, never to be recorded in writing. The formulas and secrets are transmitted orally. Without adhering to the rules of the Three Ones, even if one masters myriad minor methods, can transform yellow and white to save the world, and amasses wealth like mountains, one will still inevitably face death. Such is not the method of preserving life. Those who study and comprehend it act wisely.\n\nThe resplendent Returned Elixir, bathed in the light of sun and moon, radiant as the stars, reveals the path amid the clouds. When the Returned Elixir is accomplished, its brilliance is unmistakable—like fire within wood, though its color remains concealed, as blue tinged with red qi. Ingesting it for a thousand days transforms the flesh, renews the bones, and opens spiritual communication, stabilizing the hun and po, reversing aging to become youthful. Heavenly spirits assist, connecting with the divine. This must not be rashly divulged. Even before attaining the Dao, one may achieve it; though the accumulation of yin merit may not yet be complete, one attains transcendence and avoids death.\n\nThus we know the great Dao leaves no traces, yet never loses its root. Humans must not lose the legacy of their parents. Apart from this, all methods of subduing mercury to produce yellow are but false gates of the Dao. The secrets run deep; those who comprehend them are few. Within a hundred years, life and death do not cease. Immortal scholars transmit this, protecting one another in succession. Let no idle words arise, for there is no other cause.\n\nThe secrets speak of the supreme medicine, the gate to human longevity. The supreme medicine differs from worldly treasures. The immortal’s elixir treasure, refined a thousand times and transformed ten thousand ways, preserves its original body. Those who ingest it may know the path to spiritual longevity. Therefore, I value time and life over wealth, while fools value worldly treasures, seeking fleeting relief for a day or night, indulging in wives, concubines, and glory—mere walking corpses and wandering ghosts, careless of life and squandering time, bringing about their own destruction. Within a hundred years, the dead are beyond counting.\n\nThe Primordial Lord pities the world’s people, who drift without direction. The wondrous Dao within the medicine has already transformed true persons. Let none act recklessly; each of the four should return to their duties, guarding the Dao and embracing poverty, together accomplishing the elixir of precious life. It is also called \"you two eights,\" for two eights make a catty. White liquid and white snow—white snow is solid ice. Thus it is said: combine you two eights with you, uniting the two natures with cinnabar, never letting common people know. The fire-time follows the count of one nine; nine nines correspond to the position of noon.\n\nWithin the Three Ones, it is said: three days make one period, three threes make nine, and when the nine count is complete, that which bears a purple-black hue is praised by the Primordial Lord. Cherishing later generations of immortal scholars, the discussed songs and secrets are meant to enlighten the master. Let not the heart be divided—thus may one prepare for longevity!\n\nKnow then that Heaven is originally without favor—it takes the heart as its favor; Heaven is originally without partiality—it takes the heart as its partiality; Heaven is originally without calamity—it is man who brings calamity. Calamity arises from man, not from Heaven bestowed upon man. If scholars do not betray their teachers, and children do not defy their parents, then the Dao of Heaven endures long! Thus the transmission from master to disciple is complete!\n\nTherefore, in the utmost affairs there is no duality, and the supreme medicine is without equal. When Heaven and man unite with the Dao, clarity naturally increases their blessings—great and unadulterated. If bones are excessive, flesh cannot prevail; if flesh is excessive, bones cannot prevail. Both bone and flesh depend on sinews to strengthen their power. Power is like a rope—without strength, it is as if a bag cannot hold things; how then can it stand? No infant does not cling to its mother; when an infant loses its mother, it is like medicine without sinews, for medicine relies on its governing power. Without power, there can be no transformative efficacy of spirit.\n\nThose who comprehend see three branches in a single word; those who do not, though they traverse a thousand books and ten thousand formulas, remain fools. Many covet gold and silver first, neglecting to study immortal scriptures. Those who pursue the supreme treasure often favor alchemy, yet before seeing even an ounce, they perish unawares. The wise cherish the supreme medicine; though they have not yet glimpsed the mysterious gate of the elixir, they accumulate goodness. Thus it is.\n\nWith no heart for profit or gain, guarding the Dao and embracing poverty, Heaven’s fork does not punish—blessings follow man. The master naturally senses the utmost, as from the time before Fuxi and Xuanyuan, generations have sought immortality!\n\nWhen the yang qi’s count reaches one hundred and eight, yin qi congeals and binds itself. Suddenly, a purple hue forms the returning elixir—ingesting it grants longevity beyond words. Cinnabar alone, with nothing else, mother and child beget each other without cease. Worldly people squander wealth and treasure, but the enlightened grasp the great returning formula. There are formulas not revealed, sequences not recounted—those who attain them feel gratitude, and may transmit and speak of them.\n\nOne is called the father of earth, two the mother of water? Three is named Yellow Sprout, four the seventy-two minerals. Without medicine, the Yellow Sprout cannot form. Heaven generates things—mother and child merge and sink; mother and child do not abandon each other, for the mother emerges from within the child.\n\nMystery upon mystery lies before the eyes: within yin there is yang, and the Dao is complete. Yin and yang do not part but achieve harmony—refining and ingesting it, one attains immortality.\n\nOne is called the completion within the standard, two the great name of the Dao. Gathering continuously, adding to it, it becomes numinous. In Heaven it is mist and dew, on earth the source of springs. When the count of yin and yang is exhausted, one who attains it speaks no more.\n\nBeneath *jiazi*, fire is applied according to the ten-day period. When the period yields mother and child, it remains the same ten-day period. When the count is complete, it naturally cycles—from this, one may become the head of the two divisions.\n\nOne is called the true source of Autumn Stone, two the great Dao’s essence and spirit. Gathering the returning elixir, one should depart from the dust—such is the immortal guest of the world.\n\nSun and moon are not my form; yin and yang naturally compose my substance. Within the creation of Heaven and Earth, the six directions all return to one. The altar-turtle serves as the palace, veiled again and again. One ten-day period makes one period; one bathing returns to veiling. When the count is complete, it becomes numinous and sacred—Heaven and Earth communicate everywhere.\n\nThe preceding verses on the altar-turtle as palace are my spirit-chamber. Here ends the transmission of the heart-method of the Dao by the Purple Primordial Lord.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "紫元君授道传心法 长生阴真人注 经名：紫元君授道传心法。 原题长生阴真人注，疑此书出世於唐代。 一卷。 底本出处：《正统道藏》 洞真部方法类。 紫元君授道传心法 长生阴真人注 夫授道先授心，心真道不二，心伪道不真。 志管心中气成心中至，误自合，自才无定止气从心中生，乃付道在师心。 领道心如是曲合心不至。 师心岂无二心元都不二。 心，献师先献至口若负师言不至。 奉行先观心心虚行不至，自师心看误意。 言发自无心学道先炼心自心犹不真口授道说束去，诳人自诳身心元向西道心元不异。 万处亦如是奉师先奉空一商授学如浮云终日妄区区，不离生死地。 传紫元君授道传心法怨误心一心行，浮云道须在心，心口言不二，愿善自守心，道门自将至。 若自心悠悠，谁心肯依至，如人使三师，师多鬼竞起。 真师岂出门，伪师乱家鬼，从此烦人心，失却道中事。 愚人诳智心，凡眼惑智眼，真人教门深，道来亦不远。 授教先授心，道士心莫散，千说万遍言，真道有一门，一门象三才，三才出三丹，三丹自三皇，三皇自混沌。 混沌生天地，天地列四极，四极生造化，造化生万象，万象生万物，万物生一门，一门在一心。 夫学道之士，知我仙教上宗，万无一人。 贤者即会，愚者即非，其道欲教授为人，师与贤者说，莫与愚者施。 以说即见非，非犹师之过矣！ 我从立天地之始，其法不二，只在混沌气为元。 凡俗之人，妄求外法，失我道元，致人之有死者，世世不知，有万亿数也，盖为失却道根。 今以切论心源，流行后代，在心如丹用曾，曾为液使，调胶最能，白雪相伏，感气成龙，云腾一变，七反犹曾，使我五藏，化如风气，坚骨壮志，皮肉通笼，明彻如镜D 词烦不达，药在西束，南北必伏，日月升腾，成而在手，失而在心。 师我父母，夫妻得朋，不越四象，杀气相凌，抚我即在，默我即沈，合我道机，与我心同。 修文文讫，天降云龙，世而不绝，学士用心，真言教心，心真道正。 虔诚修真，三丹归命，九转玄门，神符灵圣。 天一得之，结绳为证，莫不因心，要术无病，元始教心，三才终定，稽首言归，知心知命。 击以龙虎歌曰： 四者混沌，五行之祖， 一日曾，曾为使，使为气，气为筋。 二日阴中阳，阳为日之魂，魂为日之精，精为阳，阳为父，父为胞衣。 三日从白液化为坚冰，坚冰是阴中阳，阳为骨，骨凭气而生白液，白液为髓名。 四日水银，水银为肉之气，气为血，血化毛发，毛发凭皮肤为玄郭，而成质。 可知三个月成形，十个月生余，两个月沐浴，合一年。 终禀天成象，递用五行而轮转，得名天地至宝。 如人受天地正气，亦为至人。 我大道仙人药宝，不同在世有价之宝，只如世问所用金银、珊瑚、码瑙、真珠之类，并量其功价，以贵贱论之。 唯有我仙丹，象日月之光明彻，此则法天象地之宝，令人服之，可得长生，天地齐毕。 皆是凭自然混沌之气而成道焉！ 其混沌之气，在天为雾露，在地为泉源，沈如碧潭之色，即是自然之道也。 仙士勿令错用意，妄将变黄白药错服食，如道士得我自然之道，四气混沌至药，但服食一千日，则知神化路不远矣！ 如四气不足，即为神化无凭，亦象至人，日月不足，岂为至人？",
      "translated_text": "**The Purple Primordial Sovereign’s Transmission of the Dao: Heart-Method Teachings**\n*Commentary by the Perfected One of Longevity and Yin*\n\nThe *Purple Primordial Sovereign’s Transmission of the Dao: Heart-Method Teachings* is traditionally attributed to the Perfected One of Longevity and Yin. It is suspected that this text emerged during the Tang dynasty. Comprising one scroll, the present edition is derived from the *Daoist Canon of the Zhengtong Era*, under the \"Methods\" category of the *Compendium of Cavernous Truth*.\n\n---\n\nTo transmit the Dao, first transmit the heart. When the heart is true, the Dao is undivided; when the heart is false, the Dao is not authentic. The will governs the qi within the heart, and when the qi is perfected within, errors naturally align. If one’s nature lacks constancy, qi arises from the heart—thus, the transmission of the Dao rests in the master’s heart. To receive the Dao’s heart is to bend and conform, yet if the heart does not attain it, how can the master’s heart be without duality? The primordial heart is undivided.\n\nThe heart is offered to the master first; if one’s words betray the master’s teachings, they will not attain it. In practice, first observe the heart—if the heart is empty, action will not attain it, and the master’s heart will perceive the error. Words arise from the absence of heart; to study the Dao, first refine the heart. If one’s own heart is not true, the oral transmission of the Dao becomes mere empty talk, deceiving others and oneself. The heart’s original nature turns toward the West, yet the Dao’s heart remains unchanged. In all matters, it is thus: to serve the master, first serve emptiness. To receive instruction is like floating clouds—spending the day in vain delusion, never escaping the realm of birth and death.\n\nThe *Purple Primordial Sovereign’s Transmission of the Dao: Heart-Method Teachings* laments the error of a scattered heart. The Dao must reside in the heart; the heart and mouth must not be divided. Guard your heart well, and the gate of the Dao will naturally arrive. If your heart drifts idly, who will willingly follow it? It is like a person employing three masters—where masters multiply, demonic forces arise. A true master does not leave the gate; false masters invite household spirits to chaos. From this, the heart is troubled, and the affairs of the Dao are lost.\n\nFools deceive the wise-hearted; the common eye deludes the wise eye. The teachings of the Perfected are profound, yet the Dao is never far. To transmit the teachings, first transmit the heart. Daoists, let not your hearts scatter. Though a thousand sayings and ten thousand repetitions be spoken, the true Dao has but one gate. This one gate mirrors the Three Powers; the Three Powers give rise to the Three Elixirs; the Three Elixirs descend from the Three Sovereigns; the Three Sovereigns emerge from the primordial chaos.\n\nFrom chaos, Heaven and Earth were born; Heaven and Earth arrayed the Four Poles. The Four Poles gave rise to creation; creation gave rise to the myriad forms; the myriad forms gave rise to the myriad things; the myriad things gave rise to the one gate—this one gate resides in the one heart.\n\nOf those who study the Dao, how many truly comprehend the supreme lineage of my immortal teachings? The worthy grasp it; the foolish reject it. The Dao, when taught to others, should be imparted by the master to the worthy, not bestowed upon the foolish. To teach the foolish invites reproach, and the fault lies with the master.\n\nSince the inception of Heaven and Earth, my method has been undivided, rooted solely in the primordial qi of chaos. The common folk, in their delusion, seek external methods, losing the primordial Dao. Thus, humanity is subject to death, generation after generation, in numbers beyond count—all for having lost the root of the Dao.\n\nNow, I earnestly discuss the source of the heart, that it may flow to later generations. Within the heart, it is like cinnabar, once refined into liquid mercury, which binds most potently. White snow submits, and qi transforms into a dragon. The clouds ascend in a single transformation; seven returns are as mercury. My five viscera are alchemized like wind and qi, bones strengthened, will fortified, skin and flesh permeated, and clarity attained like a mirror.\n\nWords, though cumbersome, fail to convey it. The medicine lies in the West; north and south must submit. Sun and moon ascend and soar; success rests in the hand, failure in the heart. The master is my father and mother; husband and wife become companions. Beyond the Four Symbols, killing qi prevails. When it nurtures me, I am present; when it silences me, I sink. Align with my Dao’s mechanism, and it will harmonize with my heart.\n\nWhen the literary refinement is complete, clouds and dragons descend from Heaven. The world endures without cease. Scholars, apply your hearts! True words teach the heart; when the heart is true, the Dao is upright. Sincerely cultivate the truth, and the Three Elixirs return to life. The Ninefold Mysterious Gate, divine talismans, and numinous sages—when the One of Heaven attains it, knotted cords serve as proof. All depends on the heart. The essential art is without illness. The Primordial Beginning teaches the heart; the Three Powers are ultimately settled. Bowing in reverence, I return to the words: know the heart, know destiny.\n\nStriking the *Dragon and Tiger Song*, it is said:\nThe Four merge in chaos, the ancestors of the Five Phases.\nFirst, mercury—mercury as agent, agent as qi, qi as sinew.\nSecond, yang within yin—yang as the sun’s soul, the soul as the sun’s essence, essence as yang, yang as father, father as the placenta.\nThird, from white liquid it hardens into solid ice—solid ice is yang within yin, yang as bone. Bone relies on qi to generate white liquid, white liquid as marrow.\nFourth, quicksilver—quicksilver as the qi of flesh, qi as blood, blood transforming into hair. Hair relies on skin to form the dark enclosure, completing the substance.\n\nThus, three months form the body; ten months give birth to the remainder. Two months of bathing complete the year. Ultimately, it receives Heaven’s configuration, cycling through the Five Phases in rotation, named the supreme treasure of Heaven and Earth. As humans receive the upright qi of Heaven and Earth, they too become supreme beings.\n\nThe great Dao’s immortal medicine differs from worldly treasures of value. Gold, silver, coral, agate, pearls, and the like are measured by their merit and price, judged by worth. Only our immortal elixir, radiant as the sun and moon, is the treasure that models Heaven and Earth. Those who ingest it may attain longevity, equal to Heaven and Earth. All relies on the natural primordial qi to achieve the Dao!\n\nThis primordial qi is mist and dew in the sky, springs and sources on Earth. Deep as the azure pool’s hue, it is the natural Dao. Immortal scholars, do not err in intent or mistakenly consume alchemical yellow-and-white medicines. If a Daoist attains my natural Dao, the supreme medicine of the Four Qi in chaos, merely consuming it for a thousand days will reveal the path of spiritual transformation is not far. If the Four Qi are insufficient, spiritual transformation lacks foundation—just as a supreme being with incomplete sun and moon cannot be supreme.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1237,
      "start_sentence": 0,
      "end_sentence": 46,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.29210352897644,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\紫元君授道传心法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "乃知至人合天地文理为圣，世人以时物文理为哲。 哲者自为圣人乎！ 乃自明其道，秉世问机运动，以功成法焉！ 量其作事，根性远近，时至尽化为灰烬。 唯我三清官神化药宝，然得保命长生，天地齐毕，其道不合传之，如传在得人付之。 绿道本无形，以五行气相侵为根，人本无至，以心为至，如心恶即言凶，言凶即行疏，行疏道不成。 所以三品之丹，付贤不付愚。 愚者心暗於世，终日览仙方书诀而念之，元不得其道性。 性由心也，休粮服气，导引修行，忘治谷神，存魂安魄，凝神定思，一法已上，并是道之空门，实非长生之理。 九鼎之丹，用四时火气，张设文武，不绝侯而晚成。 大器希声，宝贵难货，至人难识也。 铅为匡郭，周遭佑助，青瑶为使，能调风雨。 曾青能为一切金丹使，使为气，气为筋，筋成大力焉1 夫药不至者，盖犹曾青之力为使，如人不食即无力，食象气，气象使，使象食，无食力，乃事不胜矣！ 夫功皆从力而生成大壮矣！ 药无力，即无灵而安身。 白液金花，冰生龙虎。 龙虎本从虚无气中相承变，法天道感化，而运得四时天地成象之器。 然各禀发生，犹四时熏蒸，各有所归，生死始启。 道本元者，得名龙虎。 龙虎绿阴阳二性，和合相吞伏之气，所知从虚无气中生有为之质，然修善去恶，即成之。 三一升腾，必定规矩。 三一者，准上三丹，各有归魂守一之法。 论至药门中，四气筋骨，血肉相承之法，不失纤毫，勿令失其阴阳时候。 每月初发火，从一日数九九之法。 此三一法，并是内三一之法，用十二个月火候，管十二时，配十二位，行九官，象八卦，合五行。 黄帝於皇人处，请问三一之门，因此流传口诀授之，如世世仙士付之，亦勿令载於书。 方诀上以口付之，若不依此三一规矩，纵解万般小法，能变黄白救世，财宝如积山亦未免身死矣。 终不是保命之法，学而知之者善。 赫然还丹，日月光顾，星辰透明，云中见路。 其还丹成，赫然分明，亦如木中有火，火虽不露其色，如青中带赤气，服之一千日化肉质，换骨通灵，安神定魄，反老成少，感天神助之，通於神明。 不得辄妄泄露，却如未得道之日，可以成道矣，虽未满阴功之问，且得度世不死矣！ 可知大道无迹，不失其根本，人不失其父母之遗，除此一，万般妄制伏水银成黄不得为真道之门也。 诀中思深，会者有数，百岁之问，生死不住。 仙士传之，递相保护，一辰哉流言，更无别故。 诀中说至药，教人长生之门，至药与世宝别，仙人药宝，千炼万化，全其旧体，令人服食，可知神得长生之路。 所以我惜时贵命轻财，愚者即时贵世有之财宝，救一朝一夕，妻妾荣华，行尸走鬼，轻命弃时，自取灭亡，百岁之问，死者不知其数。 元君所以哀哉，世人流行，药中妙道，已化真人，勿令妄运动，各令四人归业，守道安贫，共成宝命之药。 亦名酉二八，二八成一斤之数，白液白雪是也。 白雪坚冰是也，所以言将酉二八酉，合入二性，同於丹砂，勿令常人知之。 以火候一数九，九九午之位也。 然三一中云：三日一候，三三如九，九数足，其带紫黑色者，元君赞之。 惜於后世仙士，所论歌诀，愿明於师，勿令心二者，可以长生备矣！",
      "translated_text": "Thus we know the perfected person harmonizes the patterns of Heaven and Earth to become sagely, while worldly people take the patterns of temporal things as wisdom. Yet can wisdom alone make one a sage? Only by illuminating one’s own Dao, grasping the world’s opportunities, and moving with the times can one achieve merit and establish the model! Measure one’s undertakings by the depth of one’s nature and the distance of one’s roots—when the time comes, all will be reduced to ashes. Only our Three Clarities Palace’s divine-transformation elixir treasure can preserve life and bestow longevity, equaling Heaven and Earth in duration. This Dao must not be transmitted lightly; transmission depends on finding the right person to entrust.\n\nThe Dao in its origin is formless, its root lying in the mutual encroachment of the Five Phases’ qi. Humans in their origin are not perfected; the heart is what perfects them. If the heart is evil, words become inauspicious; inauspicious words lead to estranged conduct, and estranged conduct prevents the Dao’s completion. Therefore, the three grades of cinnabar are entrusted to the worthy, not to the foolish. The foolish, benighted in worldly matters, may spend their days poring over immortal formulas and scriptures, reciting them endlessly, yet never grasp the nature of the Dao. Nature arises from the heart. Abstaining from grains, ingesting qi, practicing daoyin, cultivating conduct, forgetting to govern the Valley Spirit, stabilizing the hun and po, concentrating the spirit and settling the mind—all methods such as these are but empty gates of the Dao, not the true principle of longevity.\n\nThe Nine-Crucible Elixir employs the fire-qi of the four seasons, deploying civil and martial [techniques] without cease, maturing late like the lord awaiting his time. Great vessels are rare in sound, precious and difficult to acquire—even perfected persons struggle to recognize them. Lead serves as the outer frame, encircling and aiding; malachite acts as the agent, able to regulate wind and rain. Azurite can serve as the agent for all gold elixirs, transforming into qi, qi into sinews, and sinews into great strength. If the medicine is not perfected, it is like azurite’s power as an agent: just as a person without food has no strength, food resembles qi, qi resembles the agent, the agent resembles food—without food, strength fails, and affairs cannot prevail. All merit arises from strength, culminating in great robustness! If the medicine lacks strength, it lacks efficacy and cannot secure the body.\n\nWhite liquid and golden blossoms—ice gives birth to dragon and tiger. Dragon and tiger originally transform in mutual succession from the qi of emptiness, following Heaven’s Dao in responsive transformation, thereby attaining the vessels of the four seasons’ celestial patterns. Each receives its generation, like the four seasons’ steaming and fuming, each having its proper return—thus life and death begin. The Dao in its origin is nameless; it is called dragon and tiger. Dragon and tiger embody the two natures of yin and yang, harmonizing and mutually swallowing the qi of subjugation. What is known arises from the substance of being born of the qi of emptiness. Only by cultivating goodness and eliminating evil can it be accomplished.\n\nThe Three Ones ascend in proper order, bound by unchanging rules. The Three Ones correspond to the three superior cinnabars, each with its method of returning the hun and guarding the One. Discussing the gate of supreme medicine, the method of the four qi’s sinews and bones, blood and flesh in mutual succession, must not err by even a hair’s breadth—never lose the timing of yin and yang. Each month, fire is initiated on the first day, following the method of counting nine nines. This Three Ones method is the internal Three Ones method, employing twelve months of fire-times to govern the twelve hours, matching the twelve positions, traversing the nine palaces, emulating the eight trigrams, and harmonizing the five phases.\n\nThe Yellow Emperor, at the abode of the Royal Person, inquired about the gate of the Three Ones. Thereupon, oral instructions were transmitted, passed down through generations of immortal scholars, never to be recorded in writing. The formulas and secrets are transmitted orally. Without adhering to the rules of the Three Ones, even if one masters myriad minor methods, can transform yellow and white to save the world, and amasses wealth like mountains, one will still inevitably face death. Such is not the method of preserving life. Those who study and comprehend it act wisely.\n\nThe resplendent Returned Elixir, bathed in the light of sun and moon, radiant as the stars, reveals the path amid the clouds. When the Returned Elixir is accomplished, its brilliance is unmistakable—like fire within wood, though its color remains concealed, as blue tinged with red qi. Ingesting it for a thousand days transforms the flesh, renews the bones, and opens spiritual communication, stabilizing the hun and po, reversing aging to become youthful. Heavenly spirits assist, connecting with the divine. This must not be rashly divulged. Even before attaining the Dao, one may achieve it; though the accumulation of yin merit may not yet be complete, one attains transcendence and avoids death.\n\nThus we know the great Dao leaves no traces, yet never loses its root. Humans must not lose the legacy of their parents. Apart from this, all methods of subduing mercury to produce yellow are but false gates of the Dao. The secrets run deep; those who comprehend them are few. Within a hundred years, life and death do not cease. Immortal scholars transmit this, protecting one another in succession. Let no idle words arise, for there is no other cause.\n\nThe secrets speak of the supreme medicine, the gate to human longevity. The supreme medicine differs from worldly treasures. The immortal’s elixir treasure, refined a thousand times and transformed ten thousand ways, preserves its original body. Those who ingest it may know the path to spiritual longevity. Therefore, I value time and life over wealth, while fools value worldly treasures, seeking fleeting relief for a day or night, indulging in wives, concubines, and glory—mere walking corpses and wandering ghosts, careless of life and squandering time, bringing about their own destruction. Within a hundred years, the dead are beyond counting.\n\nThe Primordial Lord pities the world’s people, who drift without direction. The wondrous Dao within the medicine has already transformed true persons. Let none act recklessly; each of the four should return to their duties, guarding the Dao and embracing poverty, together accomplishing the elixir of precious life. It is also called \"you two eights,\" for two eights make a catty. White liquid and white snow—white snow is solid ice. Thus it is said: combine you two eights with you, uniting the two natures with cinnabar, never letting common people know. The fire-time follows the count of one nine; nine nines correspond to the position of noon.\n\nWithin the Three Ones, it is said: three days make one period, three threes make nine, and when the nine count is complete, that which bears a purple-black hue is praised by the Primordial Lord. Cherishing later generations of immortal scholars, the discussed songs and secrets are meant to enlighten the master. Let not the heart be divided—thus may one prepare for longevity!",
      "overlap_context": "ources on Earth. Deep as the azure pool’s hue, it is the natural Dao. Immortal scholars, do not err in intent or mistakenly consume alchemical yellow-and-white medicines. If a Daoist attains my natural Dao, the supreme medicine of the Four Qi in chaos, merely consuming it for a thousand days will reveal the path of spiritual transformation is not far. If the Four Qi are insufficient, spiritual transformation lacks foundation—just as a supreme being with incomplete sun and moon cannot be supreme.",
      "start_char": 1237,
      "end_char": 2472,
      "start_sentence": 47,
      "end_sentence": 88,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 60.979225873947144,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\紫元君授道传心法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "可知天本无亲，以心为亲，天本无私，以心为私，天本无灾，以人为灾，灾由人兴，非天与人。 学士不辜於师，子莫逆於父母，即天道长久矣！ 即人师传备矣！ 所以论至事不二，至药无双，天人合道，明然可增其福，大不杂矣。 若骨多则肉不胜，肉多即骨不胜，骨肉俱由筋，可壮其力，力犹曾也，如无力即如有袋不盛物，岂能立焉？ 无婴儿不恋母，婴儿失母，即如药无筋，为药由主力也，无力自无神化之功。 如会者，一言见三般支条，不会者，即经历千书万诀，不离为愚人。 好先求黄白，不寻读仙书，究其至宝者，多好黄白，未见一两，不觉身亡。 贤者好其至药，虽未见药之玄门，且积善。 如然。 神无、爱利之心，守道安贫，天叉不罚矣善庆从人，师自感其至，且从牺轩之前，后累求仙矣！ 阳气数极一百八，阴气相凝自相结，赫然紫色成还丹，服饵长生不可说。 丹砂一味更无别，子母相生无休歇。 世人不知费财宝，悟者为之大还诀，有诀不彰，有序不述，得之感之，可传可说。 一名土之父，二名水之母？ 三名号黄芽，四为七十二石。 晶如无药，不成黄芽，天生物，子母相汨没，子母不相抛，母向子中出。 玄之又玄在眼前，阴中有阳道自全，阴阳不离得和合，炼之服之得神仙。 一名准中成，二号大道名，采续不断，，添之自灵。 在天为雾露，在地为泉源，数尽阴阳数，得之终不言。 甲子下火当旬候，旬候得子母，仍旧旬候，数足自周旋，从此堪为两分首。 一名真源秋石，二名大道精魄，还丹采之，合宜离尘，是尘仙客。 日月非我形，阴阳自成质，乾坤造化中，六合皆归一，坛鳌为宫，蒙之又蒙，一旬方一候，一沐又还蒙，数足自灵圣，乾坤处处通。 右坛为官等句，吾神室也。 紫元君授道传心法竟",
      "translated_text": "Know then that Heaven is originally without favor—it takes the heart as its favor; Heaven is originally without partiality—it takes the heart as its partiality; Heaven is originally without calamity—it is man who brings calamity. Calamity arises from man, not from Heaven bestowed upon man. If scholars do not betray their teachers, and children do not defy their parents, then the Dao of Heaven endures long! Thus the transmission from master to disciple is complete!\n\nTherefore, in the utmost affairs there is no duality, and the supreme medicine is without equal. When Heaven and man unite with the Dao, clarity naturally increases their blessings—great and unadulterated. If bones are excessive, flesh cannot prevail; if flesh is excessive, bones cannot prevail. Both bone and flesh depend on sinews to strengthen their power. Power is like a rope—without strength, it is as if a bag cannot hold things; how then can it stand? No infant does not cling to its mother; when an infant loses its mother, it is like medicine without sinews, for medicine relies on its governing power. Without power, there can be no transformative efficacy of spirit.\n\nThose who comprehend see three branches in a single word; those who do not, though they traverse a thousand books and ten thousand formulas, remain fools. Many covet gold and silver first, neglecting to study immortal scriptures. Those who pursue the supreme treasure often favor alchemy, yet before seeing even an ounce, they perish unawares. The wise cherish the supreme medicine; though they have not yet glimpsed the mysterious gate of the elixir, they accumulate goodness. Thus it is.\n\nWith no heart for profit or gain, guarding the Dao and embracing poverty, Heaven’s fork does not punish—blessings follow man. The master naturally senses the utmost, as from the time before Fuxi and Xuanyuan, generations have sought immortality!\n\nWhen the yang qi’s count reaches one hundred and eight, yin qi congeals and binds itself. Suddenly, a purple hue forms the returning elixir—ingesting it grants longevity beyond words. Cinnabar alone, with nothing else, mother and child beget each other without cease. Worldly people squander wealth and treasure, but the enlightened grasp the great returning formula. There are formulas not revealed, sequences not recounted—those who attain them feel gratitude, and may transmit and speak of them.\n\nOne is called the father of earth, two the mother of water? Three is named Yellow Sprout, four the seventy-two minerals. Without medicine, the Yellow Sprout cannot form. Heaven generates things—mother and child merge and sink; mother and child do not abandon each other, for the mother emerges from within the child.\n\nMystery upon mystery lies before the eyes: within yin there is yang, and the Dao is complete. Yin and yang do not part but achieve harmony—refining and ingesting it, one attains immortality.\n\nOne is called the completion within the standard, two the great name of the Dao. Gathering continuously, adding to it, it becomes numinous. In Heaven it is mist and dew, on earth the source of springs. When the count of yin and yang is exhausted, one who attains it speaks no more.\n\nBeneath *jiazi*, fire is applied according to the ten-day period. When the period yields mother and child, it remains the same ten-day period. When the count is complete, it naturally cycles—from this, one may become the head of the two divisions.\n\nOne is called the true source of Autumn Stone, two the great Dao’s essence and spirit. Gathering the returning elixir, one should depart from the dust—such is the immortal guest of the world.\n\nSun and moon are not my form; yin and yang naturally compose my substance. Within the creation of Heaven and Earth, the six directions all return to one. The altar-turtle serves as the palace, veiled again and again. One ten-day period makes one period; one bathing returns to veiling. When the count is complete, it becomes numinous and sacred—Heaven and Earth communicate everywhere.\n\nThe preceding verses on the altar-turtle as palace are my spirit-chamber. Here ends the transmission of the heart-method of the Dao by the Purple Primordial Lord.",
      "overlap_context": "r letting common people know. The fire-time follows the count of one nine; nine nines correspond to the position of noon.\n\nWithin the Three Ones, it is said: three days make one period, three threes make nine, and when the nine count is complete, that which bears a purple-black hue is praised by the Primordial Lord. Cherishing later generations of immortal scholars, the discussed songs and secrets are meant to enlighten the master. Let not the heart be divided—thus may one prepare for longevity!",
      "start_char": 2472,
      "end_char": 3152,
      "start_sentence": 89,
      "end_sentence": 113,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.641647815704346,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\紫元君授道传心法.txt",
        "category": "方法类"
      }
    }
  ]
}