{
  "source_id": "紫皇炼度玄科",
  "source_file": "chunked_daozang\\紫皇炼度玄科.json",
  "total_chunks": 14,
  "total_original_chars": 9024,
  "total_translated_chars": 58447,
  "total_translation_time": 308.899290561676,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏续道藏\\紫皇炼度玄科.txt",
    "category": "正统道藏续道藏"
  },
  "full_translation": "*The Purple Sovereign’s Mysterious Rites of Refinement and Liberation*\n**Scripture Title:** *The Purple Sovereign’s Mysterious Rites of Refinement and Liberation*\nOne fascicle. Source text: *Wanli Continuation of the Orthodox Daoist Canon*.\n\n---\n\n*The Purple Sovereign’s Mysterious Rites of Refinement and Liberation*\nThe ritual proceeds according to form. The attending officers burn the talismans for the numinous guard. The chief cantor intones, and all bow to the masters, maintaining mindfulness as prescribed.\n\n**Invocation of the Divine Incantation:**\nThe Five Stars array their radiance, illuminating the Five Directions.\nThe Primordial Sovereign shields the hun-soul; the Cinnabar Elder guards the form.\nThe Luminous Numinous attends the po-soul; the Dark Emperor sustains life.\nThe Yellow Emperor of the Center governs all perfected beings.\nThe Primordial Sovereign decrees below: the dark night unfolds its light.\nSins dissolve in the Northern Bureau; names are inscribed in the Southern Palace.\nThe Golden Register confers rank; the Jade Script dispels calamity.\nThe Scarlet Mound receives refinement; the spirit soars to the Great Azure.\nThe Three Palaces and Nine Bureaus, the boundless divine realm—\nAll universally receive liberation, refined and transformed into celestial paradise.\nHarmony unites with the Dao, merging with the true.\n\nThe chief cantor concludes.\nThe attending officers burn the furnace-activating talisman.\nThe ritual drum is struck twenty-four times. The high priest recites...\n\nThe Supreme Three Heavens, the Great Dark Heaven of Taiying, the Qi of the Purple Sovereign Heavenly Lord—summon forth from within this servant’s body the Three and Five Merit Officials, the Attendants of the Left and Right, the Courier Dragon Riders bearing incense, the Golden Lads attending incense, the Jade Maidens scattering flowers, the Five Emperors’ Direct Talisman Officials and Daily Incense Officers, each thirty-six in number, to emerge. Let those who emerge don solemn attire, display their regalia, and adorn themselves with caps and pendent tassels. Let them report to the local earth deities and the divine guardians of this domain.\n\nThis servant now, in proper ritual order, refines and delivers, ascending the altar to reverently memorialize: the sincerity of this petition has already been fully presented. This servant now petitions [□#1]; may the qi of the Five Numinous Mysterious Origin of the North descend and flow into the bodies of this servant and company, that the sincerity of this servant’s invocation may swiftly reach the Supreme Perfected Three Treasures, the Ancestral Master and Lord of the Teachings, the Dark Heaven Purple Sovereign Emperor.\n\nThe chief cantor intones: *Invoking the sacred ranks.*\n\nThis humble servant [Name], with awe and trepidation, prostrates and bows his head, reverently addressing the Three Pure Ones of the Three Realms, the August Heaven Supreme Jade Sovereign Emperor, the North Pole Purple Tenuity Subduer of Demons Great Emperor, the Celestial Emperor of the Gouchen Star Palace, the Earthly Sovereign Empress of Bearing Heaven and Effecting the Dao, the Divine Numinous Perfected King and Longevity Great Emperor, the Heavenly Worthy of Great Compassion Who Answers Cries, the Ten Directions Numinous Treasure Heavenly Worthies, the Five Emperors of the Five Directions, the Nine Heavens Life-Generating Emperor, the Thirty-Two Heavenly Lords, the Azure Radiance East Primeval Yang Compassionate Father, the Golden Perfection West Primordial Mother, the Palace of the Sun’s Supreme Solar Emperor, the Mansion of the Moon’s Supreme Lunar Sovereign, the Star Lords of the Southern Dipper Who Refine the Hun-Souls, the Star Lords of the Northern Dipper Who Forge the Po-Souls, the Vermilion Mound Great Emperor of the Southern Culmen, the Upper Palace of Southern Prosperity’s Deities of Destiny, Registers, Longevity, and Life-Extension Who Refine and Transform, the Great Deities Who Revive the Dead and Oversee Life, the Perfected of the Ninefold Radiance Who Preside over Refinement, the True Lords of the Upper and Lower Vermilion Mound Fire Palaces, the Three Primordials, Three Grades, and Three Officials Great Emperors, the Five Masters of the Numinous Treasure, the Primordial Lady of the Western Jade Terrace Who Upholds the Dao, the Thunderclap Three Ministries’ Supreme Ministers Perfected Lords, the Ancestral Master and Lord of the Teachings, the Jade Void Preceptor and Purple Sovereign Dark Heaven Emperor, the Ancestral Master Western River Salvific Perfected of Compassion, the Qingwei, Lingbao, and Purple Court Fengdu Dongyue Lineage Transmitting Masters, the Perfected Lords of the Five Bureaus Who Gather the Hun-Souls at Childhood’s Dawn, the Fire Official of the Great Yang, the Water Official of the Great Yin, the Water Palace Fusang Great Emperor, the Southern Prosperity Refinement Bureau’s Envoys of the Fire Marsh and Water Pool, the Venerable Deities of the Jade Eyes Refining Essence, the Venerable Deities of the Golden Liquor Refining Form, the Bing-Ding Vermilion Bird Divine Lords, the Venerable Deities of the Yellow Radiance Who Purify Form, the Primordial Lady of the Stone Mirror Water Mother, the Ren-Gui Dark Warrior Divine Lords, the Envoys of the Northern Capital’s Frigid Pool, the Venerable Deities Who Nurture the Hun and Po, the Great Generals of the Twelve Qi of Chaos Primordial Who Generate Life, the Heavenly Medical Great Sage, the Divine Tiger Marshals He and Qiao, the Fire Palace Courier Lads of the Xuandu Reed Dragon, the Nine Dragons Talisman Envoys, the Five Directions’ Five Numinous Lads, the True Lords of the Offering Altar, and all assembled mighty spirits.\n\nWith reverence, this servant beseeches the Dao’s compassion to turn its profound gaze upon this rite, undertaken on behalf of the deceased [Name], who has passed beyond this realm, their fate unknown between ascent and descent. Relying upon the Most High’s boundless mercy, this servant invokes the mysterious rites to purify and refine them. Humbly drawing upon the profound power of the Dao, may they swiftly attain transcendence.\n\nThis servant, by virtue of past karmic affinity, dares to perform these secret arts. Yet the true water and true fire’s ascending and descending functions remain obscure; the numinous palace and numinous source’s fundamental principles of dryness and moisture remain unknown. Without the Dao’s power, how could refinement be achieved? Thus, with earnest sincerity, this servant presumes to trouble the lofty Perfected Ones’ attention. May they command the chariot of five-colored floating clouds and raise the banner of ninefold radiant light. May the golden lads and jade maidens attend in harmony, the generals, officers, and divine soldiers manifest in majesty. Deign to descend to this ritual altar, preside over the refinement and deliverance, and receive this memorial, which shall now be reverently recited.\n\n*Recitation of the Purple Sovereign’s Memorial.*\n*Recitation of the Petition Concluded.*\n\nThe High Priest intones:\n\nYour servant has heard: the essence of the sun and the radiance of the moon broadly illuminate the earth below; the southern *Li* and northern *Kan* together bring warmth and moisture to living beings. To gather the hun-souls with the spirit and form, one must return in reverence to the compassionate Creation.\n\nHumbly beseeching the Master’s mercy, may true water and true fire be specially arrayed, descending to the Flowery Pool, allowing this servant to refine and deliver. Solemnly praying for the issuance of decrees, may commands be sent to:\n\nThe Radiant Primordial Perfected of Pure Yang within the Sun, the Firelight Lads, General Yu-yi, the Fire Bell Lads, the Lady of Yellow Radiance and Flowing Light within the Moon, the Round Light Lads, General Jie-lin, the Yin-Yang Gatekeepers Gou and Bi of the Thunder Gate, the Four-Eyed Elder and Elder Gao-diao of the Heavenly Peng Gate, the Three Divine White Owls and the Four Great Generals of Long-Skulled Mighty Beasts, the Four Primordial Spirits of Chen, Tang, Song, and Xue, Marshal Chen of the Great Mystery’s Severing, Marshal Wen of the Southern Palace’s Expulsion of Evil, Marshal Yi-qi the Great General of the Talisman Envoys for Pursuing Consumption, Seizing Wasting, and Opening the Heart, Marshal Wen the Earth Spirit’s Illustrious and Martial, the Two Marshals Zhao and Tao of Water and Fire, the Water Pool Envoy Great Spirit Zheng, the Fire Marsh Envoy Great Spirit Bai, the Two Great Generals Guarding the Male and Embracing the Female, the Great Spirit Wang Who Cuts Off Ingratitude, the Great Spirit of Uniting Form and Restoring Body, the Twelvefold Qi of the Primordial Chaos Transforming and Generating Great Spirit—\n\nMay they now descend to this ritual altar to assist this servant in refinement and deliverance, ensuring that the souls undergoing refinement have their karmic filth dissolved like melting ice, their grievances and transgressions extinguished like dying embers, and that they may receive the merit of transformation, following their karma to be reborn.\n\nThis servant, unworthy and foolish, presumes to practice these rites, relying entirely on the true guidance and greatly bestowed with orthodox perfection. May the *qi* of the Dao, the *qi* of life, and the *qi* of Brahma—along with the true *qi* of the Three Lights—flow into this servant’s body, granting the grace of compassionate light to accomplish this sacred task.\n\nAll true water and true fire, this servant earnestly beseeches to fly into the Luminous Pool, fulfilling the pledge of efficacy.\n\nThis servant, daring to offend the majesty of the Dao, reflects from afar upon the profound grace, silently vowing to repay it with manifest virtue.\n\nThe High Priest transforms his spirit, establishing the Fire Marsh and Water Pool, merging water and fire.\n\nThe *Ti Hun* incantation is held within secret instructions; before the throne, a gatha is recited.\n\nThe High Priest ascends the seat, pinching incense with his left hand and intoning in truth:\n\nThis incense, congealed from the Three Pure Ones, its *qi* suffused with the Seven Numinous Spirits—\nFrom the Cinnabar Valley flows its essence, merging the gold’s purity of *Li* and *Kan*;\nFrom the Mystic Terrace is nurtured its excellence, the auspicious union of male and female inscribed in the jade tablets.\n\nThe incense is kindled in the censer,\nburned within the furnace, offered across the void to\nthe Primordial Dharma King, the Heavenly Treasure of the Cavern of Perfection,\nin reverent dedication for the deliverance of the departed souls.\n\nMay a thousand transgressions be absolved, ten thousand sins dissolved.\nTo the north, may the dark *qi* ascend as spirits, the white tally gleaming with the blessings of compassionate clouds;\nto the south, may lives be delivered, the cinnabar talisman melting with the auspicious radiance of the sun of kindness.\nMay litigation at the tomb cease in the household, and calamities in descendants be stilled.\n\nThe High Priest pinches incense with his left hand and invokes:\n\nThis incense, its essence divided from the Moon’s Grotto, its excellence nurtured from Heaven’s Root—\nPurple smoke ascends to the azure vault, its light illuminating the yang spirits;\ncolored mists fly along the Yellow Path, their auspiciousness revealing the yin luminaries.\n\nThe incense is kindled in the censer,\nburned within the furnace, offered across the void to\nthe Supreme Jade Clarity, the Numinous Treasure of the Cavern of Mystery,\nin reverent dedication for the deliverance of ancestral and former souls.\n\nMay each awaken to their true nature, suddenly realizing their original state,\nrelying on the golden tally to emerge from darkness, hearing the sutras and awakening to the Dao;\nwielding the jade talisman to ascend through the ranks, refining their substance and attaining perfection.\nMay they enjoy bliss without striving, carefree and at ease.\n\nThe High Priest pinches incense with his right hand and invokes:\n\nThis incense, its fragrance rising from the Three Ultimates, its *qi* bestowed by the Five Numinous Spirits—\nIts jade splendor shines upon the earth’s blossoms, its emerald flames resplendent;\nits golden radiance extends to heaven’s flowers, its mystery brilliant and luminous.\n\nThe incense is kindled in the censer,\nburned within the furnace, offered across the void.\n\nThe Dao of highest virtue, the Divine Treasure of the Cavernous Spirit—offered in prayer for the patron of this retreat, that the Eastern Florescence bestow blessings and the Southern Culmen extend their years. May seven generations of their lineage share in glory, as clouds swiftly borne by the roc’s flight across ten thousand leagues; may five branches flourish in splendor, as cranes and phoenixes harmonize their calls in the nine marshes. May they cultivate poetry and ritual among the pines and vines, and illuminate their native land with music and song.\n\n*Sound the chime*\n**Celestial Worthy of Universal Salvation, the Most High**\n\nThe High Priest intones directly:\n\nWe bow in reverence, for Heaven is called Father and Earth is called Mother, the primal source of all life and generation. Yin becomes the corporeal soul and Yang the ethereal soul, forming the embodied and sentient destiny of beings. All things preserve their nature and life, yet only the One True endures without losing its root—how much more so for humanity, the most spiritually endowed of all.\n\nYet by the inherent Way of human nature, a single day’s judgments of right and wrong, good and evil, may yield karmic retribution or determine ascent and descent. Though a hundred years may reduce all to decay, the wondrous and the base alike cannot escape. The wheel of rebirth is inescapable; transformation is inevitable. Thus, after death, the wandering soul drifts in darkness, while before birth, the root severs from past attachments. Those who languish through long nights in distant kalpas shall, when their allotted time is spent, find the great cycle open before them; those who ride the dawn and yearn for the light shall, with spirit preserved, awaken to true enlightenment.\n\nWe look up to the Most High, who has spread the great Dharma bridge—bestowing benevolence through love of life, and delivering the world through the flow of true precepts. Heaven-one generates water, Earth-two generates fire; refining jade essence with hammer and chisel, fire descends and water ascends. Dui-seven transforms into the tiger, Zhen-three transforms into the dragon; guarding the golden elixir, the dragon chants and the tiger roars. Without the union of water and fire, how could form be restored? Without the fusion of dragon and tiger, how could spirit be perfected? Through this process of generation and completion, it is called *refinement and deliverance*.\n\nRed lead and black mercury—with my spirit, I unite with theirs; the Crimson Palace and the Cinnabar Field—with the body of the Dao, I unite with their body. The qi and essence of liver, heart, spleen, lungs, and kidneys nurture and sustain life; the quintessence of metal, wood, water, fire, and earth nourish and cultivate. At this time, we array the radiance of sun, moon, and stars, and establish the Flowery Pond of water and fire. Following the teachings and methods of the Purple Emperor, we refine the ethereal and corporeal souls; we command the officials of the Southern Palace to assist in washing and perfecting form.\n\nMay the departed souls before this altar receive deliverance, refining their embryos to return to the root. Once more, they are endowed with the essence of the Five Phases, severing the root of death; anew, they become the most spiritually endowed of all beings. May the sincerity of the patron be fulfilled, the teachings of the Purple Emperor widely propagated, and the sacred name exalted together, as we humbly invoke the grace of their luminous power.\n\n*Sound the chime*\n**Celestial Worthy of Limitless Deliverance**\n\nThe High Priest now intones, proclaiming to the departed souls:\nThe four elements—earth, water, fire, and wind—temporarily conjoin to form the human frame;\nAilments, pains, and afflictions coil and cling, becoming the heart’s distress.\nDeeply consider: what plagues the living in the yang realm likewise persists in the yin realm.\nThough now stilled, the physical form remains untranscended; first, the malevolent manifestations must be purged of illness before one may unite with the True.\n\nThe [Celestial] Bureau now respectfully summons the Heavenly Physicians, the Healing Merit Officers, the Divine Lads Who Taste Medicines, the Acupuncture Spirit Officials, the Six Offices of Healing, and all Departments’ Merit Officers.\nBy the talismanic decree of the Mysterious Heavenly Emperor of the Purple Empyrean, first gather the primordial qi for the departed souls, healing all ailments of the body, all illnesses from their former lives, and dissolving all karmic roots of suffering.\nPurge the blood’s impurities, restore the integrity of form and spirit, and by talismanic command, awaken the luminous clarity of their inherent nature to endure refinement and transformation.\n\nThe Attending Officers now burn the Heavenly Physician Talisman:\n*\"Jade Clarity’s Primordial Venerable One, dispatch the Heavenly Physicians below.\nRestore the withered and decayed, universally deliver and save all heavenly beings.\"*\n\nThe High Priest draws the qi of the Five Directions, arraying it at the altar’s site of water and fire commingling:\nBy the Great Supreme’s compassion, the talismanic decree is issued.\nThe living are preserved whole; the dead are made complete.\nForm and spirit both attain perfection, ascending to the Jade Hall.\nThe Five Qi flow freely, severing the roots of evil.\n\nRed Yao assists the left, Zhen: the paralyzed stretch forth.\nGrinding needles aid the right, Dui: the disabled are made whole.\nWax and tallow descend below, Li: the lame and afflicted rise and walk.\nInk ascends above, Kan: ears and eyes become keen and bright.\nThe numinous treasure at the central Jade: the body grows strong, the frame light.\n\nThe Azure Emperor guards the hun at Mao, the Liver-Wood flourishes long.\nThe Vermilion Emperor nurtures the qi at Wu, the Heart-Fire shines brightly.\nThe White Emperor attends the po at You, the Lung-Metal is born and perfected.\nThe Black Emperor channels the blood at Zi, the Kidney-Water becomes limpid and clear.\nThe Yellow Emperor, central sovereign at the Center, the Spleen-Earth finds peace.\n\nThe Brahman qi pervades the cosmos, naturally attaining the True.\nThe corpse revives from death; white bones become human again.\nDeliverance is bestowed upon the dying, the severed restored to life.\nNine harmonies and ten unions transform and ascend to the Upper Clarity.\n\nThe High Priest further intones:\nThe four births and six paths, the ten kinds of sentient beings,\nAll myriad sufferings of countless deaths—all are made manifest.\nWith a single touch of celestial light, the talismanic decree flourishes.\n\nThe Attending Officers now burn the Blood Lake Talisman and the Privy Tower Talisman, as all recite:\n*\"Great Supreme Elder, ascend and deliver to the Southern Palace.\nThe Three Palaces transform, preserving life naturally.\nThe Emperor of the Sun Palace illumines the earth below;\nThe Sovereign of the Moon Palace purges the Blood Lake.\nThe Primordial Emperor descends, irrigating all beings.\nFacing the Bureau, attending the Celestial Court, sins vanish from the Three Ways.\nThe mighty current washes away filth, cleansing the nether ford.\nThe Primordial Yang Jade Calendar accumulates merit and builds virtue.\nAll举ed by the Three Realms, bones and image unite with the immortals.\nVirtuous merit pierces the heavens, the dark night is illuminated.\nYang Nine summons yang; Yin Six calls forth yin.\nYin and yang conjoin, the decree severs the gate of death.\"*\n\nThe Attending Officers now burn the Separating Womb Talisman, as all recite:\n*\"The Three Clarities’ supreme transformation establishes the images of the Two Modes.\nThe hun and shi are refined, the mysterious responds to the divine mechanism.\nThe meridians are made whole, the hundred bones and four limbs.\nThe Five Viscera are all complete, ascending to the Purple Tenuity.\"*\n\nThe Attending Officers now burn the Exiting Womb Talisman, as all recite:\n*\"By the Emperor’s decree, descend into the dark prison.\nBurn and scour away filth and turbidity, swiftly attain rebirth.\"*\n\nThe Attending Officers now burn the Scouring Womb Talisman, as all recite:\n*\"Mysterious Numinous Great Tenuity, essence refines in purity.\nThe departed souls attain deliverance, penetrating and transcending non-action.\nHeaven hangs its signs, refining the departed souls.\nThe ten kinds of solitary spirits all attain illumination.\nTransmuted into human form, the Three Palaces are all enlightened.\nThe nine orifices align, ascending to Southern Prosperity.\"*\n\nThe Attending Officers now burn the Purifying Corpse Talisman, as all recite:\n*\"The qi of the Five Phases circulates; the qi of the Three Luminaries soars and floats.\nNuminous nectar descends to irrigate; jade liquid permeates the dark.\nThe hun and shen become clear and upright, returning to the heavens above,\nReuniting with the myriad spirits to roam the Jade Capital.\nThe heavens are limpid, the qi pure; the Five Colors rise in brilliance.\nSun and moon emit their radiance, refining the body’s form.\nThe spirit’s essence is inwardly irrigated; fragrant waters refine the essence.\nLight and brilliance illuminate and shine, resplendent in the Upper Clarity.\nThe qi remains unstained by dust; the Five Viscera receive the numinous.\nSins vanish from the Three Ways; misfortunes dissolve in the Nine Nether Realms.\nEvil roots are severed; blessings and felicity arise of themselves.\nToday’s great vow is proclaimed to all.\nThe body receives liberation and ascends to the Emperor’s realm.\nSwiftly, swiftly, as in the statutes and ordinances!\"*\n\n*\"By the Primordial Beginning’s talismanic decree, deliver the departed spirits.\nBlood, corpse, stench, and filth—all malevolence is stilled and pacified.\nThe Seven Fluids are infused; the Five Viscera are transformed and born.\nEver uphold the divine incantation: Primordial, prosperous, harmonious, and steadfast.\nSwiftly, swiftly, as in the Primordial Beginning Emperor’s statutes and ordinances!\"*\n\nThe High Priest draws the qi of the Five Directions and the Three Luminaries, arraying it upon the departed souls, silently intoning:\n*\"Within the True resides the spirit, the Great Lord of Longevity,\nThe Peerless Noble Son, the White Prime Venerable Spirit,\nThe Great Monad Controller of Destiny, Peach and Ginseng united in extension,\nGrasping talismans and holding registers, preserving life and rooting existence.\nAscend to the Upper Clarity, enter and exit the Flowery [Palace].\nWithin the Eight Nether Realms, in the subtlest of spaces,\nBelow, they guard the human body, the Muddy Pellet and Crimson Palace.\nWithin, they govern the Five Qi, harmonizing the hundred spirits.\nTen revolutions return the numinous; the myriad qi unite as immortals.\"*\n\n*Sound the chime*\n**Celestial Worthy of the Cinnabar Realm’s Refinement**\n\nThe High Priest summons the Fire Refinement Officers and Generals:\nSolemnly invoking the Master of Flowing Fire of the Cinnabar Heaven, the True Persons of Refinement and Salvation, the Fire Pool Envoys, the Fire Pool Lads, the Divine Clerks of the Fire Bureau, Marshal Gou Yuan of the Loyalty-and-Filiality Thunder Gate, and all officers, generals, clerks, and soldiers of the Purple Sovereign’s Refinement and Salvation—lead the soul-escorting envoys to guide the departed souls into the Fire Pool for refinement and salvation. Thereby, let karmic filth dissipate like smoke, grievances and transgressions be extinguished like embers, the form fear the Great Yang, and the human substance be reborn anew. As decreed by the Talisman Command of the Purple Sovereign of the Mysterious Heavenly Emperor, swiftly carry this out.\n\nThe attending officers burn the Fire Refinement Talismans within the Fire Pool.\nAll recite the *Central Chapter of the Primordial Beginning*.\nThe High Priest silently intones:\n*\"The Lord of the Southern Quarter, the Essence of the Red Emperor,\nThe Radiant Torch Envoys, the Generals of Bing and Ding,\nThe Vermilion Phoenix, the Fiery Spirit, the resplendent essence of Yang,\nThe Five Phases engender transformation, the myriad things take form and live.\nBy the Emperor’s edict, the envoys must heed:\nSeize the departed, summon the soul, refine and salvage the bodily form.\"*\n\nThe High Priest’s eyes flash like lightning,\nhis left hand stirs the Fire of Wu,\nand he exhales qi into it.\nEnvisioning the Fire Pool, true fire blazing fiercely,\nall chant:\n*\"Spirits of Fiery Essence, streaming light of the Three Terraces,\nRefining the embryo, transmuting the substance, the po refined, the hun renewed.\nFoul qi falls away, borne aloft on rising smoke.\nYin qi dissolves and disperses; Yang qi blends in harmony.\nThe spirit grows ever stronger, penetrating deeply into the Fire Realm.\nMerging with the Nine Qi, wholly uniting with the Primal Sovereign.\nBy edict of the Vast Heaven, molten gold scatters its radiance.\nThe Nine Heavens gleam and descend; steadfast fortune knows no bounds.\"*\n\nEnvision the departed soul within the Fire Pool, receiving refinement:\n*\"Six Jia and Six Yi refine your Liver Meridian,\ngenerating your majestic spirit, making your body sturdy and light.\nSix Bing and Six Ding refine your Heart Meridian,\nforging your spirit-qi, preserving your long life.\nSix Geng and Six Xin refine your Lung Meridian,\nthe Large and Small Intestines, the myriad qi latent and luminous.\nSix Ren and Six Gui refine your Kidney Meridian,\nthe Essence of Hua fills the pool, bones and marrow find peace.\nSix Wu and Six Ji refine your Spleen Meridian,\nprolonging life and enduring vision, flesh and bones become light and pure.\nRefine the body, restore the form, transform the substance into the Three Clarities.\"*\n\nThe High Priest arrays Jade Script and Azure Qi upon the departed soul,\nand all chant:\n*\"The Dragon Han vast and boundless, formless and nameless,\nAcross countless eons, the Yellow Dao shines forth.\nSpirits clear and radiant, the Nine Hun exhale their essence.\nJade Clarity gleams, the Great Auroras rise in splendor.\nThe Primordial Beginning unfolds transformation; all heavens align as one.\nThe Dao-qi of the Three Origins, the Two Images embrace life.\nThose already delivered are delivered; those unformed are formed.\nThe dead are revived; the withered are made flourishing.\nAll creatures that creep and breathe, every dark spirit,\nThose with child and those with embryo—all attain long life.\nThe departed whose fate is spent return their souls to the Three Clarities.\nThe po receives refinement; in the Southern Palace, the form is transformed.\nToday is most auspicious; all attain illumination.\nThe Five Emperors witness and reflect, universally proclaiming to the myriad spirits.\nHeavenly gods and earthly deities, all river sources,\nThe Five Marchmounts and Four Waterways, all renowned mountains,\nThe Caverns of Mystery, the Caverns of Emptiness, the Caverns of Void, the Caverns of Immortals,\nThe Great Saints of the Boundless, the Perfected and Venerable Divinities—\nLimitless and infinite, universally behold and deliver life.\nThe roots of earth are severed; names are recorded in the Mysterious Capital.\nAll Perfected respond universally; all things heed.\"\n\nThe High Priest recites directly.\n\nThe officials of the Fire Marsh complete their refinement and emerge from the Fire Marsh, proceeding to the Water Pool to receive further refinement. As decreed by the Purple Sovereign, Mysterious Heavenly Emperor.\n\n*Sound the chime, raise the invocation:*\n**Yellow Flower, Transfiguring Heavenly Worthy—**\nThe High Priest summons the officials and generals of the Water Refinement:\nWith reverence, we call upon the Eastern Well of the Celestial River, the Great Divine of the Jade Eye and Yellow Flower, the Perfected of Refinement, the Envoys of the Water Pool, the Lads of the Water Pool, the Divine Clerks of the Water Palace, Marshal Biyuan of Loyalty and Filial Piety of the Thunder Gate’s Yin Thunder, and all officials, generals, clerks, and soldiers of the Purple Sovereign’s Refinement—\nLead the guiding envoys of souls, escort the departed spirits into the Water Pool for refinement. Ensure their karmic grime is purged like melting ice, their grievances and defilements cleansed as if washed away. Gather their spirits in the Great Yin, reborn in human form.\n\nAs commanded by the talisman of the Purple Sovereign, Mysterious Heavenly Emperor, swiftly obey.\n\n*The attendant officers burn the Water Refinement Talisman in the Water Pool.*\n*All recite the Middle Chapter.*\nThe High Priest silently intones:\n\n**Lord of the Northern Quarter, Essence of the Black Emperor,**\nMessenger of the Star of the Morning, Generals Ren and Gui.\nThe Yin Spirits of the Dark Warrior, their voices solemn and clear.\nThe Five Phases engender transformation; the myriad things arise.\nBy the Emperor’s decree, the messengers must heed:\nSummon the departed souls, bathe and refine their forms.\n\nThe High Priest exhales through the nose, transforming breath into water, and blows it into the *tizi* pattern with the left hand.\nEnvision the Water Pool: true water vast and boundless.\n*All recite:*\nThe Eastern Well and Yellow Flower, essence of the Stone King.\nThe Flying Dark Water Mother, her body golden, her fluids jade.\nFlowing endlessly, an inexhaustible pool.\nNine Dragons pour forth their streams; the Three Luminaries bestow their essence.\nImmortal beings exhale their moisture, refining the departed souls.\nWithin and without, radiant and clear; surface and interior, both purified.\nThe hundred joints and nine orifices are nourished by primordial qi.\nThe five viscera and six bowels give rise to the myriad spirits.\nThe knots of the womb and embryo dissolve like water unlocking its gates.\nThe roots of death are severed; the roots of evil sink into oblivion.\nNow we refine and transform: the dead husk becomes a living soul.\nReturn to the former state, alter the countenance—\nA jade body, a golden visage.\nTransformed, the filth is swept away; soaring, they ascend to the Purple Court.\n\nEnvision the departed souls in the Water Pool, receiving refinement.\n*All recite:*\nThe Purple Tenuous Yellow Writ, named the Great Mystery.\nIt brings the water of moonlight to nurture the *po* and harmonize the *hun*.\nWithin the body, cultivate simplicity; from the body, the Mysterious Pass emerges.\nHidden in heaven, concealed in earth—\nThe Five Numinous Ladies, nine beams of flying light,\nilluminate the Muddy Pellet.\nYellow qi and Yin blossoms, Yang essence refines the immortal.\nBathe the nine souls, crown them in the Golden Dawn.\nRadiant and resplendent, proclaim the Jade Embryo’s refinement into immortality.\nInterwoven brilliance flows like fragrant rapids.\nThe Nine Yangs transform in unison; the Mysterious Harmony descends in streams.\nThe Primordial Scenery lingers, curving to descend into my body.\nSoaring to the Upper Palace, gazing upon the jeweled pavilion.\n\nThe High Priest inscribes the Jade Writ, exhaling the Azure Qi of the Central Heaven to spread over the departed souls.\n*He further intones:*\nIn the vastness of the Dragon Han, formless and nameless,\nAcross boundless kalpas, the Yellow Dao shines forth.\nSpirits are serene and luminous; the nine souls exhale their essence.\nThe Jade Void gleams with clarity; the Great Radiance stands in splendor.\nThe Primordial Beginning initiates transformation; all heavens unite as one.\nThe Dao-qi of the Three Origins, the Two Images embrace life.\nThose already delivered deliver others; the unformed are formed.\nThe dead are revived; the withered flourish anew.\nAll crawling and wriggling beings, all hidden spirits,\nThose with child and those with child yet unborn—all attain long life.\nThe departed whose fate is spent return their souls to the Three Clarities.\nThe *po* receives refinement; in the Southern Palace, the form is transformed.\nToday is most auspicious; all attain illumination.\nThe Five Emperors witness and reflect, universally proclaiming to the myriad spirits.\nHeavenly gods and earthly deities, all river sources,\nThe Five Marchmounts and Four Waterways, all renowned mountains,\nThe Caverns of Mystery, the Caverns of Emptiness, the Caverns of Void, the Caverns of Immortals,\nThe Great Saints of the Boundless, the Perfected and Venerable Divinities—\nLimitless and infinite, universally behold and deliver life.\nThe roots of earth are severed; names are recorded in the Mysterious Capital.\nAll Perfected respond universally; all things heed.\n\nThe High Priest recites directly.\n\nThe officials of the Water Pool, having completed the refinement and deliverance, now lead the departed souls forth from the Water Pool, awaiting their transformation and rebirth, in accordance with the decrees of the Purple Sovereign, the Mysterious Heavenly Emperor.\n\n*Responding to the sounding of the qing bell:*\nThe Most High Venerable Lord of Refinement and Rebirth\n\nThe High Priest recites directly.\n\nOf human birth, there is that which coalesces into form.\nThe Dao of Heaven creates man; the Dao of Earth creates woman.\nThe Divine Lords bestow destiny; the Great One holds the talisman.\nThe Director of Fates determines the allotted span; the Great One delivers the talisman.\nThe Five Emperors oversee life; the Nine Heavens rejoice in celebration.\nThe Director of Fates reverently assents and obeys; the myriad spirits sing in harmony.\n\nRevering the divine decrees of Heaven and Earth, the Three Realms stand guard in full array.\nOnly through such transformation and coalescence can a person be formed.\n\nToday, within this altar, the departed soul of so-and-so, whose fate has run its course,\nonce returned to the gate of the Yellow Springs, qi scattered and spirit wandered, body perished and form vanished.\nFortunately, the one spirit remains undying, the original true nature yet unsevered.\nThrough transformation and rebirth, the Most High possesses the method:\nThe Twelve Qi of the Primordial Chaos can generate the twelve meridians,\nreturning to the human Dao, governed by the Highest Lord of the Divine Empyrean,\nthe Jade Clarity of the Primordial Unity, the Six Yang of the Primordial Chaos,\nand the Twelve Qi Generative Great Generals.\n\nNow, in accordance with the Purple Sovereign, the Mysterious Heavenly Emperor,\nwe perform the talismanic rites of refinement and deliverance.\nWe invoke the descent of the Most High’s Orthodox True Qi of Life,\nthe Nine Heavens’ Qi of Divine Generation,\nto blend with the original spirit and orthodox qi of the departed,\ncommanding the generals and officials to transform and regenerate according to the method.\n\nThe *Lingbao Natural Jade Chapters of the Nine Heavens’ Divine Generation*—\nthe assembly, with utmost reverence, recites in unison, voices harmonized, tones drawn out.\n\nThe two assistants, each holding the Water and Fire Banners,\nlead the assembly in chanting the *Divine Generation Chapters*,\ncircling in alternating directions to perform the intersecting refinement rites.\n\nThe attendants burn the talismans for generating the kidneys and bladder.\n\nThe High Priest recites silently:\nThe Kidney Spirit, the Mysterious True Lord, styled Yu Ying, overseer,\nand Yang Wenguang, the General of the Primordial Qi of Unity.\nThe Bladder Spirit, the Supreme Void Lord, styled Transmitter, overseer,\nand Zhang Tong, the General of the Six Qi of the Primordial Chaos.\n\nVisualize the midnight celestial qi of the Northern Water within the Zi character,\nswallowed into the cinnabar field, blending with the qi of the kidneys and bladder.\n*Black, black*—one qi, six repetitions, blown upon the departed soul,\ntransforming and generating the kidneys and bladder.\n\nThe High Priest recites silently:\nWithin the Palace of the Kidney’s Domain, the Dark Gate stands round,\nwhere dwells a youth, profound and mysterious.\nHe governs the six divisions and the nine sources of fluids,\nexternally corresponding to the two ears and the hundred streams of essence.\nClad in azure brocade, dancing dragons coil,\nascending to summon luminous clouds, sun, moon, and mist.\nFor the swift alleviation of the hundred ailments and thousand afflictions, hasten to visualize:\nthe two departments of Water and Jade face the Gate of Life.\n\nThe attendants burn the talismans for generating the heart and small intestine.\n\nThe High Priest recites silently:\nThe Heart Spirit, the Cinnabar Prime Lord, styled Guardian of the Numinous, overseer,\nand Ding Zhong, the General of the Two Qi of the Primordial Chaos.\nThe Small Intestine Spirit, the Supreme Numinous Lord, styled Water and Grain, overseer,\nand Li Yuan, the General of the Seven Qi of the Primordial Chaos.\n\nVisualize the celestial qi of the Southern Fire within the Wu character of the noon script,\nswallowed into the cinnabar field, blending with the qi of the heart and small intestine.\n*Silently recite, then exhale with a \"ha\" sound*—one qi, seven repetitions, blown upon the departed soul,\ntransforming and generating the heart and small intestine.\n\nThe High Priest recites silently:\nWithin the Palace of the Heart’s Domain, a lotus holds its bloom,\nbeneath which dwells a youth, the household of the Cinnabar Prime.\n\nThe Master regulates cold and heat, harmonizing the constructive and defensive qi,\nrobed in cinnabar brocade and draped in jade gauze.\nGolden bells and vermilion sashes sway as he sits in dance,\nregulating blood and governing life—his body never withers.\nExternally, the mouth and tongue emit the Five Flowers;\nwhen near death, calling upon him brings revival.\nPracticed long, one soars upon the Great Rosy Clouds.\n\nThe attendant burns the talismans for generating the liver and gallbladder.\n\nThe High Priest recites silently:\nWithin the Liver’s Dragon Abyss Lord, styled Harmonious Luminance, overseer,\nand Ding Qianshan, the General of the Three Qi of the Primordial Chaos.\nThe Gallbladder’s Dragon Radiance Lord, styled Majestic Luminance, overseer,\nand Shen Fu, the General of the Eight Malevolent Qi of the Primordial Chaos.\n\nVisualize the celestial qi of the Eastern Wood within the Mao character of the dawn script,\nswallowed into the cinnabar field, blending with the qi of the liver and gallbladder.\n*Silently recite, then exhale with a \"xu\" sound*—one qi, eight repetitions, blown upon the departed soul,\ntransforming and generating the liver and gallbladder.\n\nThe High Priest recites silently:\nWithin the Palace of the Liver’s Domain, layers of jadeite enfold,\nbeneath which dwells a youth, the Azure Lad.\nHe governs the myriad barriers, the origin of clarity and wisdom,\nclad in azure brocade and girded with jade bells.\nHarmonizing the hun and po, balancing the fluids,\nexternally corresponding to the eyes and the essence of sun and moon.\nThe hundred ailments that afflict him dissolve into the Wuying,\npracticed for seven days, they naturally overflow.\nAt the brink of death, invoke the spirit—life returns;\ngathering the hun and returning the po, never to falter.\n\nThe attendant burns the talismans for generating the lungs and large intestine.\n\nThe High Priest recites silently:\nThe Lung’s Radiant Flower Lord, styled Void Perfection, overseer,\nand Chen Zhiyuan, the General of the Four Qi of the Primordial Chaos.\nThe Large Intestine’s Primordial King Lord, styled Governance and Harmony, overseer,\nand Zhou Ziran, the General of the Nine Qi of the Primordial Chaos.\n\nVisualize the celestial qi of the Western Metal within the You character of the dusk script,\nswallowed into the cinnabar field, blending with the qi of the lungs and large intestine.\n*Silently recite, then exhale with a \"si\" sound*—one qi, nine repetitions, blown upon the departed soul,\ngenerating the lungs and large intestine.\n\nThe High Priest recites silently:\nWithin the Palace of the Lung’s Domain, like a flowered canopy,\nbeneath which sits a youth at the Jade Barrier.\nThe Seven Origins’ Lad governs the regulation of qi,\nexternally corresponding to the Central Peak and the nose’s central position.\nClad in plain brocade and a yellow cloud sash,\nwhen breath is labored and the body unwell,\nhastily invoke the White Prime to harmonize the Six Qi—\nthe immortal’s long gaze knows no calamity.\nPracticed without cease, the form never stagnates.\n\nThe attendant burns the talismans for generating the spleen and stomach.\n\nThe High Priest recites silently:\nThe Spleen’s Ever-Present Lord, styled Peaceful Abode, overseer,\nand Wang Xianzhi, the General of the Five Qi of the Primordial Chaos.\nThe Stomach’s Numinous Source Lord, styled Great Granary, overseer,\nand Zhang Xiu, the General of the Ten Qi of the Primordial Chaos.\n\nVisualize the celestial qi of the Central Earth within the Earth script,\nswallowed into the cinnabar field, blending with the qi of the spleen and stomach.\n*Silently recite the Numinous Treasure incantation*—one qi, ten repetitions, exhaled upon the departed soul,\ngenerating the spleen and stomach.\n\nThe High Priest recites silently:\nThe Palace of the Spleen’s Domain belongs to Wu and Ji,\nwithin which a luminous youth is wrapped in yellow robes.\nHe disperses grain and scatters qi, governing the teeth,\nthe Great Granary’s Two Luminous Lads.\nSeated within the ninefold golden terrace,\na square inch at the Gate of Life.\nHe regulates the hundred grains and the five fragrant flavors,\nwarding off emaciation and illness.\nExternally corresponding to the complexion of the wrist’s abode,\nthe radiance thus generated manifests.\nClad in yellow brocade and jade robes, girded with tiger talismans,\ninvoke the Three Elders—lightly soaring.\nLong life and high immortality, far from the calamity of death.\n\nThe attendant burns the talismans for generating the Triple Burner, heart, and pericardium.\n\nThe High Priest recites silently:\nThe Triple Burner’s Arrayed Spirits Lord, styled Mystic Fluid, overseer,\nand Wang Zhuoli, the General of the Eleven Qi of the Primordial Chaos.\nThe Pericardium’s Vermilion Pearl Lord, styled Numinous Motion, overseer,\nand Zheng Ming, the General of the Twelve Qi of the Primordial Chaos.\n\nVisualize the celestial qi of the Central Palace within the Earth script,\nthe Three Colors—azure, white, and yellow—swallowed into the cinnabar field,\nblending with the pericardium, Triple Burner, and heart.\nThe qi of the body’s nodes and hundred vessels,\nblown upon the departed soul,\ngenerating the Triple Burner, pericardium, heart, nodes, and hundred vessels.\n\nThe Primordial nurtures form and spirit,\ngoverning the northeast quarter.\nHeaven’s brightness governs the yang qi,\ntransforming and generating the Triple Burner.\nThe Primordial’s singular qi-spirit,\ngoverning the northwest and Qian directions.\nHeaven’s brightness governs the true qi,\nnurturing and completing the pericardium.\n\nThe attendant burns the talisman for completing the entire form.\n\nThe High Priest, with his left hand holding the Jade Script, draws the true qi of the Five Directions—twelve breaths—\nswallowed into a single spirit-form, like an infant,\nclad in white rosy clouds, a halo crowning its neck,\nthe spirit radiating auspicious light,\ndescending to suffuse the entire form,\ndispersing into the nine orifices, gathering at the tongue’s tip, then blown forth.\nThe departed soul’s entire body—five viscera, six bowels, four limbs, and hundred vessels—is now complete.\n\nAll recite:\nThe Supreme Peerless, soaring upon the Nine Origins’ radiance,\ncongealing essence and condensing qi, transforming form and transmuting spirit.\nThe Controller of Life blends and unites, scattering form into myriad parts.\nA thousand chariots of fiery armor, ten thousand riders with fluttering banners,\nall join with the Great One, ascending to become Imperial Immortals.\nBo Wu rises without error, Zhong Cheng bends to the script.\nFirst, unite with my qi; second, unite with my spirit;\nthird, unite with my hun; fourth, unite with my po;\nfifth, unite with my purity; sixth, unite with my form.\nThe sixfold union completes the body, the cavernous rosy clouds reveal the true.\nThe Eight Effulgences’ empty chariot, the Three Simplicities’ floating wheel—\nI and the Imperial One together ascend to the Jade Palace.\nLayered blossoms and branching stems, blending with the Heavenly Immortals.\nThe body holds the Dao’s register, the world has its root of life.\nGolden tablets and feathered talismans, names inscribed upon the Solar Chariot.\nWishes fulfilled, celestial blessings flow abundantly.\nDesires manifest, myriad spirits fill the gate.\nEver abide with the Great One, the Imperial One at the Mud-Pill Palace.\nYin and yang blend, a hundred spirits entwine.\nRecite the scripture ten thousand times, the numinous chariot comes to welcome.\nFeasting with the Five Emperors, the Nine Lords of Sun and Moon,\nattaining immortality as an Upper Clarity Perfected.\nEnvision the departed soul’s form—now complete.\n\nAll recite again:\nThe Dragon Han vast and boundless, formless and nameless,\nstretching across countless eons, the Yellow Dao shines forth.\nSpirits clear and luminous, the Nine Hun emit their essence.\nThe Jade Void gleams, the Great Rosy Clouds rise high.\nThe Primordial begins transformation, all heavens unite as one.\nThe Three Origins’ Dao-qi, the Two Images gather life.\nThose already delivered are delivered, those unformed are formed.\nThe dead are revived, the withered made flourishing.\n\nAll creatures that stir and breathe, every hidden spirit—\nthose carrying embryos, those nurturing life within,\nall attain long life.\nThe departed whose fate has passed, their souls return to the Three Clarities.\nTheir poisons undergo refinement and deliverance,\ntransformed in form at the Southern Palace.\nToday is most auspicious—all attain radiance.\nThe Five Emperors reflect and illuminate, proclaiming universally to the ten thousand spirits:\nheavenly gods and earthly deities,\nall river sources,\nthe Five Marchmounts and Four Waterways,\nand all renowned mountains.\nCaverns of Mystery, Caverns of Void,\nCaverns of Emptiness, Caverns of Immortals—\nthe Boundless Great Sage,\nthe Most Perfect Revered Divinities.\nWithout end or limit, they universally witness and deliver life.\nEarth’s roots are severed, names recorded in the Dark Capital.\nThe True Universal Response—all comply and heed.\n\nThe High Master intones directly:\nReverently offering true incense, we humbly present this petition once more\nto the Three Clarities, the Three Treasures, the Supreme Emperor,\nthe Five Numinous Ones, the Five Venerable Lords,\nand the Lord of Soul-Gathering of the Five Bureaus of Childhood’s Beginning.\nWe pray that the true *qi* of the five directions descend again,\nthe *qi* of the three hues of primordial chaos,\nto pour into the departed soul,\nthat the *qi* of the Nine Heavens may quicken its spirit,\nand the true essence of the Three Origins preserve its fate.\nYellow and white arrive in full,\ninner and outer unite in form.\nThe Six Jia circulate, the Five Phases interact,\nmodeling heaven and earth,\nembracing yin and nurturing yang,\nuniting with the Dao to achieve perfection—\nthus exalted and noble.\nThe head becomes Kunlun,\nhair the stars,\neyebrows the canopied parasol,\neyes the sun and moon,\nnose the Pillar of Heaven,\nears the Heavenly Windows,\nmouth the Heavenly Gate,\nface the Heavenly Mirror.\nThe *qi* of the First Origin becomes the true spirit,\nthe *qi* of the Second Origin becomes luminous essence,\nthe *qi* of the Third Origin becomes the Three Palaces,\nthe *qi* of the four seasons becomes the Four Passes,\nthe *qi* of the Five Phases becomes the Five Viscera,\nthe *qi* of the Six Pitches becomes the Six Bowels,\nthe *qi* of the Seven Stars becomes the Seven Orifices,\nthe *qi* of the Eight Winds becomes the Eight Limits,\nthe *qi* of the Nine Heavens becomes the Nine Palaces.\nOuter *qi* aligns with inner *qi*,\ninner spirits align with outer spirits.\nSpirit-father and spirit-mother,\nharmonizing with the primordial spirit,\nprimordial *qi* mutually engendering,\nthe Five Phases gathering to refine.\nWe must thank the Primordial Revered One,\nwhose assent fulfills our earnest prayers.\n\nThe chime sounds—\nFive Spirits Blending with Heaven Honored One.\n\nAll recite.\n\nA thousand harmonies, ten thousand unions,\nnaturally forming the true;\nwhen the myriad *qi* align, all ascend as immortals.\n\nThe High Priest performs the rites of the Five Palaces,\nsilently circulating the *qi* of the Capital of Merit:\n—*gongdu* completes at *mao*,\nthe Horn’s edge stabilizes at *wu*,\nlife flourishes and turns at *you*,\nthe Lone Standard shifts at *zi*.\n*Kehan* illumines the jade—\nthe Capital of Merit gathers souls and draws in the *qi* of *xun*,\nreleasing the mudra to array the departed spirits.\n\nRed apricots held in rank at *zhen*,\nink-black swiftness at *bai*.\nAt *kan*, the true plan grinds with force;\nat *dui*, socks and wax gather the harvest.\nAt *li*, the Numinous Treasure pervades all things;\nthe jade *qi* harmonizes and unites.\nThe jade Orthodox Unity perfects the Dharma,\nwisdom increases and truth is attained—\nsummon the courier to descend and seize.\n\nThe left three fingers grasp the middle joint of the thumb,\nthe *qi* of the Central Heaven releases the mudra,\narraying the departed spirits:\nthe Azure Emperor guards the hun at *mao*,\nthe White Emperor attends the po at *you*;\nthe Vermilion Emperor nurtures *qi* at *wu*,\nthe Black Emperor circulates blood at *zi*;\nthe Yellow Emperor presides at the center—\nthe myriad spirits do not transgress.\n\nThe High Priest clasps the mudra of the Five Peaks,\ndrawing the *qi* of the Five Directions,\nreleasing the mudra to array the departed spirits:\nwhat was withered revives,\nwhat was extinguished is reborn.\nAttaining birth in the heavens,\nthey receive anew the great numen.\nThrough the kalpas of the Nine Heavens,\nthey return to the womb and become infants again.\nImpure *qi* is swept away,\nthe body’s corpse is renewed.\n\nAll recite:\n*Liberating Grievances, Unbinding Knots Heaven Honored One.*\n\nThe acolytes burn the talisman for releasing grievances.\nThe High Priest silently recites the *Qinghua Invocation* once, silently invoking\nthe Heavenly Worthy Who Saves from Suffering,\nthe August Emperor of the Purple Empyrean,\nentreating them to release the departed spirits from grievances and untie their knots,\nfrom the three lifetimes and four debts,\nthat creditors and adversaries may no longer obstruct.\nThe jade mudra and azure *qi* array the departed spirits,\nas the silent incantation and divine talisman descend—\ngrievances unbound, knots released.\nForever freed from enmity,\ndistinctions of contention dissolved.\nAll causes of strife extinguished,\nno evil karma arises.\nEmerging from the cold courts of judgment,\nthe roots of transgression vanish.\nThe departed spirit regains wholeness of body,\nthis is called death and yet rebirth;\nrobes and headdress restored,\none awakens to the truth of coming but not returning.\nNot with the garments of the mortal realm are they offered,\nbut with reverent talismans and incantations,\nassisting the transformation of the body’s vestments,\nascending to the lofty shores of the Dao.\n\nAll recite:\n*Heavenly Worthy of Golden Countenance and Jade Form.*\n\nThe acolytes burn the talisman for robes.\nAll chant the *Jade Invocation* three times.\nThe High Priest silently recites:\nCrimson script and cinnabar robes,\nfluttering in graceful elegance.\nThe primordial talismanic command,\nwhen worn, grants effortless ascent.\n*Oṃ vajri* □, swiftly as the Fire Emperor of the Southern Cinnabar Heaven obeys the law.\n\nThe acolytes burn the talisman for headdress and sash.\nThe High Priest arrays the departed spirits with the jade script and *qi* of the Central Heaven,\nenvisioning them in resplendent robes and headdress,\nawaiting the transmission of precepts.\n\nAt the sounding of the chime:\n*Heavenly Worthy Who Perpetually Transmits the True Precepts.*\n\nThe Dao speaks: \"Precepts are restraint.\" They restrain the human mind from wrongdoing, guiding it to true stillness—thus precepts give rise to stillness. The Confucians also say, \"Knowing restraint, one attains stillness.\" Yet among the Three Caverns' scriptures and the Four Divisions' secret texts, the methods of precepts vary widely. Only the sublime and wondrous Nine True Precepts of the Supreme Numinous Treasure command the reverence of heaven and humanity, observed alike by the hidden and the manifest. Supreme above all that is supreme, profound beyond all that is profound, numinous among the ten thousand spirits, precious as the singular *qi*—their marvel pervades the Three Realms, their precepts govern the Six Passions. Their number is fixed by yang, hence divided into nine; cultivated without falsity, they are called \"true.\" The world looks up to them as its fortress; the hidden and manifest rely on them as their bridge; souls receive them as their healing medicine.\n\nThe method of receiving precepts begins with stillness and silence; the practice of upholding them demands utmost diligence. The assembly bows in reverence, joining in sincere praise.\n\nAt the sounding of the chime:\n*Let each in the assembly respond with reverence.*\n\nThe Three Refuges are refuge in the Dao, refuge in the scriptures, and refuge in the masters. Therefore, all souls must believe and pay homage.\n\nFirst, take refuge in the Supreme Treasure of the Dao:\n*Heavenly Worthy of the Treasure of the Dao.*\n\nSecond, take refuge in the Supreme Treasure of the Scriptures:\n*Heavenly Worthy of the Treasure of the Scriptures.*\n\nThird, take refuge in the Supreme Treasure of the Masters:\n*Heavenly Worthy of the Treasure of the Masters.*\n\nWith the Refuges complete, the transmission of precepts begins. The dark netherworld brightens like spring’s return; karmic debts dissolve forever. The flowers of sin wither; merit and fruition come to perfect fulfillment. The assembly, with utmost devotion, proclaims the Nine Precepts:\n\nThe First Precept: Be diligent and loyal to the sovereign.\nThe Second Precept: Honor and humbly serve your parents.\nThe Third Precept: Do not kill; show compassion to all beings.\nThe Fourth Precept: Do not commit sexual misconduct; maintain purity in body and conduct.\nThe Fifth Precept: Do not steal; practice righteousness and self-restraint.\nThe Sixth Precept: Do not harbor anger or bully others.\nThe Seventh Precept: Do not deceive or harm the virtuous.\nThe Eighth Precept: Do not be arrogant or neglect the true.\nThe Ninth Precept: Do not waver; uphold the precepts with single-minded devotion.\n\nThese Nine Precepts were personally proclaimed by the Nine Heavenly Lords. Those who wear and honor them ascend to the Nine Heavens; those who slight them fall into the Nine Hells. Today, in accordance with the rites, they are transmitted to the departed souls. Listen carefully and never forget from beginning to end.\n\nAll talismans of merit are displayed one by one:\nThe *Announcer* presents the *Talisman of Longevity* and the *Register of Ascension to Heaven*.\nThe wondrous precepts and numinous texts, the Yellow Register and White Tablet, having been set forth in the sacred scriptures, are now reverently offered to the spirits.\n\nThe heart is hard to govern—thus the Nine Precepts return it to the Great Void. The form has not yet transcended—thus the two talismans refine it in the celestial realms. Departed souls, never forget these precepts in any lifetime; keep these talismans close through every kalpa. With spirit settled beyond the material world, the dusty bonds of many lives are forever severed. Reborn in the yang realm, the fruits of goodness naturally ripen in wondrous being. Your virtue shines in the present, bringing boundless blessings. Soon, the souls will be dispatched, protected and guided to ascend as immortals.\n\nThe High Priest dispatches the generals:\n*[Such-and-such] Office respectfully summons the Nine Heavens’ Universal Salvation Court, the Two Great Generals Guarding the Male and Embracing the Female, the principal and deputy generals of this altar, the Four Great Marshals protecting the Dao and overseeing the altar—hasten to escort the departed soul of [Name] directly to the Vermilion Numinous Fire Palace and the Southern Prosperity Upper Palace. By the Emperor’s decree, wind and fire shall not delay.*\n\nAll recite:\n*Heavenly Worthy of Perfect Flowering Completion.*\n\nDeparted souls, you now soar toward the Southern Culmen, leaving the darkness of the Northern Feng. Having paid homage to the Dao, the scriptures, and the masters, the sun of singular truth shines bright. Refining form, spirit, and *qi*, the winds of ten thousand illusions are stilled. You ascend to the vast and boundless realm, reaching the realm of emptiness and non-being. Forever freed from the wheel of rebirth, you abide in effortless freedom. Depart now from this feast; do not forget the grace of the Dao.\n\nAt the sounding of the voice:\n*Heavenly Worthy Who Transcends the Immortal Realms.*\n\nThe High Priest summons Marshal Wen to dispatch the protective escort writ. Having offered thanks, he descends from the dais, and the ascension rites are complete. The High Priest returns to the altar, and the Precentor intones:\n\n*Abide in spirit and offer incense.*\n\nThe High Priest recites:\nIncense Officials and Envoys, Lords of the Left and Right Dragon-Tiger, and all attendant spirit-officials of the incense—may this place where I have just ascended the altar to refine and deliver the departed naturally give rise to golden liquid elixirs, azure mushroom essences, and a hundred numinous perfected beings, all gathered here before this incense burner and brazier.\n\nMay this ritual altar, dedicated to the deliverance of all souls, dissolve all obstructions and lingering attachments. May their forms be refined to purity, their natures perceived with perfect clarity, their true essence of water and fire wondrously congealed, and the realms of humans and heavens be transformed and regenerated.\n\nMay the profound grace extend widely, and the blessings of goodness be equally shared. May the jade maidens and immortal youths of the ten directions, bearing orchid incense, swiftly convey the sincerity of my supplication to the presence of the Supreme Perfect Three Treasures, the Patriarchal Master, and the August Sovereign of the Dark Heaven and Purple Emperor.\n\nThe Purple Emperor’s Rites of Refining and Deliverance are now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "明万历正统道藏续道藏 紫皇炼度玄科 经名：紫皇炼度玄科。 一卷。 底本出处：《万历续道藏》。 紫皇炼度玄科 法事如仪，侍职焚卫灵符，都讲举 各礼师存念如法 请宣神咒 五星列照，焕明五方。 始皇护魂，丹老卫形。 皓灵侍魄，黑帝摄生。 中央黄帝，总御万真。 元皇告下，幽夜开光。 罪消北府，名列南官。 金箓受籍，玉字除殃。 朱陵受炼，飞神太苍。 三宫九府，无极神乡。 普受开度，炼化天堂。 和与道合真。 都讲毕 侍职焚发炉符 鸣法鼓二十四通，高功念",
      "translated_text": "*The Purple Sovereign’s Mysterious Rites of Refinement and Liberation*\n**Scripture Title:** *The Purple Sovereign’s Mysterious Rites of Refinement and Liberation*\nOne fascicle. Source text: *Wanli Continuation of the Orthodox Daoist Canon*.\n\n---\n\n*The Purple Sovereign’s Mysterious Rites of Refinement and Liberation*\nThe ritual proceeds according to form. The attending officers burn the talismans for the numinous guard. The chief cantor intones, and all bow to the masters, maintaining mindfulness as prescribed.\n\n**Invocation of the Divine Incantation:**\nThe Five Stars array their radiance, illuminating the Five Directions.\nThe Primordial Sovereign shields the hun-soul; the Cinnabar Elder guards the form.\nThe Luminous Numinous attends the po-soul; the Dark Emperor sustains life.\nThe Yellow Emperor of the Center governs all perfected beings.\nThe Primordial Sovereign decrees below: the dark night unfolds its light.\nSins dissolve in the Northern Bureau; names are inscribed in the Southern Palace.\nThe Golden Register confers rank; the Jade Script dispels calamity.\nThe Scarlet Mound receives refinement; the spirit soars to the Great Azure.\nThe Three Palaces and Nine Bureaus, the boundless divine realm—\nAll universally receive liberation, refined and transformed into celestial paradise.\nHarmony unites with the Dao, merging with the true.\n\nThe chief cantor concludes.\nThe attending officers burn the furnace-activating talisman.\nThe ritual drum is struck twenty-four times. The high priest recites...",
      "overlap_context": "",
      "start_char": 2,
      "end_char": 236,
      "start_sentence": 0,
      "end_sentence": 22,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.507747411727905,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\紫皇炼度玄科.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "无上三天太冥天乙之炁紫皇天君，召出臣身中三五功曹，左右官使者，左右捧香驿龙骑吏，侍香金童，传言散花玉女，五帝直符直日香官使者，各三十六人出。 出者，严装显服，冠带垂缨，关启此间土地、方域神真。 臣今正尔炼度，升坛谨奏，为入意其诸丹悃，已具奏闻。 臣今关□#1； 愿得北方五灵玄元之炁，下降流入臣等身中，令臣所启之诚，速达径诣，无上至真三宝、祖师教主玄天紫皇上帝。 御前 都讲举 请称法位 具位臣某诚惶诚恐，稽首顿首，上启三清三境天尊，昊天至尊玉皇上帝，北极紫微伏魔大帝，勾陈星宫天皇大帝，承天效法后土皇帝祇，神霄真王长生大帝，太乙寻声救苦天尊，十方灵宝天尊，五方五老上帝，九天生神上帝，三十二天帝君，东华木公元阳慈父，西灵金真祖母元君，日宫太阳帝君，月府太阴皇君，南斗鋾魂星君，北斗铸魄星君，南极朱陵大帝，南昌上宫司命司箓延寿益算炼化尊神，回骸起死监生大神，主炼九华真人，南昌上下朱陵火府真宰，三元三品三官大帝，灵宝五师真君，西瑶主法冲天正一元君，雷霆三省上相真君，祖师教主玉虚师相紫皇玄天上帝，祖师西河救苦萨真人，清微灵宝紫庭酆都东岳诸法传派师真，童初聚魂五府真君，太阳火官、太阴水官，水府扶桑大帝，南昌炼度司火沼水池使者，玉眸炼质尊神，金液炼形尊神，丙丁朱雀神君，黄华荡形尊神，石景水母元君，壬癸玄武神君，北都寒池使者，化魂育魄尊神，混元十二炁化生大将军，天医大圣，神虎何乔二元帅，玄都茭龙驿吏火府赍简童子，九龙符命使者，五方五灵童子，醮筵真宰，合座威灵。 恭望道慈，洞回渊鉴，以今奉为，奉道追炼某伏为亡过某从倾逝，莫测升沉。 仰惟太上之慈悲，特启玄科而濯炼。 敬资玄造，俾遂超升。 臣幸以宿缘，冒行秘法。 真水真火，罔明升降之功； 灵府灵源，曷知燥湿之本。 匪凭道力，何以铸掏，辄据恳切之诚，敢渎高真之听。 伏望命五色浮云之驾，竖九光流景之旌。 金童玉女以雍雍，将吏神兵而赫赫。 俯降法筵，主盟炼度，具有表文，谨当宣读。 宣紫皇表 宣关毕",
      "translated_text": "The Supreme Three Heavens, the Great Dark Heaven of Taiying, the Qi of the Purple Sovereign Heavenly Lord—summon forth from within this servant’s body the Three and Five Merit Officials, the Attendants of the Left and Right, the Courier Dragon Riders bearing incense, the Golden Lads attending incense, the Jade Maidens scattering flowers, the Five Emperors’ Direct Talisman Officials and Daily Incense Officers, each thirty-six in number, to emerge. Let those who emerge don solemn attire, display their regalia, and adorn themselves with caps and pendent tassels. Let them report to the local earth deities and the divine guardians of this domain.\n\nThis servant now, in proper ritual order, refines and delivers, ascending the altar to reverently memorialize: the sincerity of this petition has already been fully presented. This servant now petitions [□#1]; may the qi of the Five Numinous Mysterious Origin of the North descend and flow into the bodies of this servant and company, that the sincerity of this servant’s invocation may swiftly reach the Supreme Perfected Three Treasures, the Ancestral Master and Lord of the Teachings, the Dark Heaven Purple Sovereign Emperor.\n\nThe chief cantor intones: *Invoking the sacred ranks.*\n\nThis humble servant [Name], with awe and trepidation, prostrates and bows his head, reverently addressing the Three Pure Ones of the Three Realms, the August Heaven Supreme Jade Sovereign Emperor, the North Pole Purple Tenuity Subduer of Demons Great Emperor, the Celestial Emperor of the Gouchen Star Palace, the Earthly Sovereign Empress of Bearing Heaven and Effecting the Dao, the Divine Numinous Perfected King and Longevity Great Emperor, the Heavenly Worthy of Great Compassion Who Answers Cries, the Ten Directions Numinous Treasure Heavenly Worthies, the Five Emperors of the Five Directions, the Nine Heavens Life-Generating Emperor, the Thirty-Two Heavenly Lords, the Azure Radiance East Primeval Yang Compassionate Father, the Golden Perfection West Primordial Mother, the Palace of the Sun’s Supreme Solar Emperor, the Mansion of the Moon’s Supreme Lunar Sovereign, the Star Lords of the Southern Dipper Who Refine the Hun-Souls, the Star Lords of the Northern Dipper Who Forge the Po-Souls, the Vermilion Mound Great Emperor of the Southern Culmen, the Upper Palace of Southern Prosperity’s Deities of Destiny, Registers, Longevity, and Life-Extension Who Refine and Transform, the Great Deities Who Revive the Dead and Oversee Life, the Perfected of the Ninefold Radiance Who Preside over Refinement, the True Lords of the Upper and Lower Vermilion Mound Fire Palaces, the Three Primordials, Three Grades, and Three Officials Great Emperors, the Five Masters of the Numinous Treasure, the Primordial Lady of the Western Jade Terrace Who Upholds the Dao, the Thunderclap Three Ministries’ Supreme Ministers Perfected Lords, the Ancestral Master and Lord of the Teachings, the Jade Void Preceptor and Purple Sovereign Dark Heaven Emperor, the Ancestral Master Western River Salvific Perfected of Compassion, the Qingwei, Lingbao, and Purple Court Fengdu Dongyue Lineage Transmitting Masters, the Perfected Lords of the Five Bureaus Who Gather the Hun-Souls at Childhood’s Dawn, the Fire Official of the Great Yang, the Water Official of the Great Yin, the Water Palace Fusang Great Emperor, the Southern Prosperity Refinement Bureau’s Envoys of the Fire Marsh and Water Pool, the Venerable Deities of the Jade Eyes Refining Essence, the Venerable Deities of the Golden Liquor Refining Form, the Bing-Ding Vermilion Bird Divine Lords, the Venerable Deities of the Yellow Radiance Who Purify Form, the Primordial Lady of the Stone Mirror Water Mother, the Ren-Gui Dark Warrior Divine Lords, the Envoys of the Northern Capital’s Frigid Pool, the Venerable Deities Who Nurture the Hun and Po, the Great Generals of the Twelve Qi of Chaos Primordial Who Generate Life, the Heavenly Medical Great Sage, the Divine Tiger Marshals He and Qiao, the Fire Palace Courier Lads of the Xuandu Reed Dragon, the Nine Dragons Talisman Envoys, the Five Directions’ Five Numinous Lads, the True Lords of the Offering Altar, and all assembled mighty spirits.\n\nWith reverence, this servant beseeches the Dao’s compassion to turn its profound gaze upon this rite, undertaken on behalf of the deceased [Name], who has passed beyond this realm, their fate unknown between ascent and descent. Relying upon the Most High’s boundless mercy, this servant invokes the mysterious rites to purify and refine them. Humbly drawing upon the profound power of the Dao, may they swiftly attain transcendence.\n\nThis servant, by virtue of past karmic affinity, dares to perform these secret arts. Yet the true water and true fire’s ascending and descending functions remain obscure; the numinous palace and numinous source’s fundamental principles of dryness and moisture remain unknown. Without the Dao’s power, how could refinement be achieved? Thus, with earnest sincerity, this servant presumes to trouble the lofty Perfected Ones’ attention. May they command the chariot of five-colored floating clouds and raise the banner of ninefold radiant light. May the golden lads and jade maidens attend in harmony, the generals, officers, and divine soldiers manifest in majesty. Deign to descend to this ritual altar, preside over the refinement and deliverance, and receive this memorial, which shall now be reverently recited.\n\n*Recitation of the Purple Sovereign’s Memorial.*\n*Recitation of the Petition Concluded.*",
      "overlap_context": "lden Register confers rank; the Jade Script dispels calamity.\nThe Scarlet Mound receives refinement; the spirit soars to the Great Azure.\nThe Three Palaces and Nine Bureaus, the boundless divine realm—\nAll universally receive liberation, refined and transformed into celestial paradise.\nHarmony unites with the Dao, merging with the true.\n\nThe chief cantor concludes.\nThe attending officers burn the furnace-activating talisman.\nThe ritual drum is struck twenty-four times. The high priest recites...",
      "start_char": 236,
      "end_char": 1059,
      "start_sentence": 23,
      "end_sentence": 43,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.923530340194702,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\紫皇炼度玄科.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "高功作声念 臣闻：日精月华，广照临於下土； 离南坎北，共炎润於生灵。 欲聚魂於形神，须皈依於慈造。 伏望师慈，特布真水真火，降赴华池，容臣炼度。 专祈敕命，告下日中炎光洞明太素真人，火光童子，郁将军，火铃童子，月中黄华石景流光夫人，圆光童子结璘将军，雷门阴阳苟毕二雷神，天蓬门下四目老翁、高刁北翁，素枭三神长颅巨兽四大将军，陈唐宋薛四元神，太玄断□陈元帅，离宫辟恶温元帅，追痨摄瘵开心符使伊祈大将，地祇翊灵昭武温元帅，主水主火赵陶二元帅，水池使者郑大神，火沼使者白大神，守雄抱雌二大将，无义断恩王大神，合形复体大神，混元十二炁化生大神，只今下降法坛，助臣炼度，务令受炼亡魂，业垢冰融，冤尤烬灭，承功托化，随果受生。 臣不渐愚昧，叨冒行持，全资真驭，大赐正真。 道炁、生炁、梵炁，三光真炁，流入臣身，容假慈光，以成胜事。 所有真水、真火，臣谨恳请飞入明池，以副效信。 臣干冒道威，缅想玄恩，潜垂昭报。 高功变神，建火沼水池，水火混合 提魂诀存秘旨内，朝座前念偈 高功升座，左手捻香真念 此香，云凝三素，气蔼七灵。 丹谷流精，离坎混金华之粹； 玄台孕秀，雌雄符玉笈之祥。 香，焚炉内 爇向炉中，遥空供养 元始法王，洞真天宝，奉祝正荐亡灵。 伏愿千愆解释，万罪消除。 北郁升神，白简焕慈云之渥； 南陵度命，丹符融惠日之祥。 绝冢讼於门庭，息灾殃於嗣续。 高功左手捻香，祝 此香，月窟分精，天根毓秀。 腾紫烟於碧落，光焕阳灵； 飞彩雾於黄道，祥开阴曜。 香焚炉内 爇向炉中，遥空供养 太上玉宸，洞玄灵宝，奉祝系荐，祖考先灵。 伏愿各明正性，顿悟本来，凭金简以出幽，闻经悟道； 仗玉符而度品，炼质登真。 快乐无为，逍遥自在。 高功右手捻香，祝 此香，三极腾芳，五灵委炁，耀玉华於地蕊，翠焰玲珑； 施金景於天葩，玄煌炜烨。 香焚炉内 爇向炉中，遥空供养",
      "translated_text": "The High Priest intones:\n\nYour servant has heard: the essence of the sun and the radiance of the moon broadly illuminate the earth below; the southern *Li* and northern *Kan* together bring warmth and moisture to living beings. To gather the hun-souls with the spirit and form, one must return in reverence to the compassionate Creation.\n\nHumbly beseeching the Master’s mercy, may true water and true fire be specially arrayed, descending to the Flowery Pool, allowing this servant to refine and deliver. Solemnly praying for the issuance of decrees, may commands be sent to:\n\nThe Radiant Primordial Perfected of Pure Yang within the Sun, the Firelight Lads, General Yu-yi, the Fire Bell Lads, the Lady of Yellow Radiance and Flowing Light within the Moon, the Round Light Lads, General Jie-lin, the Yin-Yang Gatekeepers Gou and Bi of the Thunder Gate, the Four-Eyed Elder and Elder Gao-diao of the Heavenly Peng Gate, the Three Divine White Owls and the Four Great Generals of Long-Skulled Mighty Beasts, the Four Primordial Spirits of Chen, Tang, Song, and Xue, Marshal Chen of the Great Mystery’s Severing, Marshal Wen of the Southern Palace’s Expulsion of Evil, Marshal Yi-qi the Great General of the Talisman Envoys for Pursuing Consumption, Seizing Wasting, and Opening the Heart, Marshal Wen the Earth Spirit’s Illustrious and Martial, the Two Marshals Zhao and Tao of Water and Fire, the Water Pool Envoy Great Spirit Zheng, the Fire Marsh Envoy Great Spirit Bai, the Two Great Generals Guarding the Male and Embracing the Female, the Great Spirit Wang Who Cuts Off Ingratitude, the Great Spirit of Uniting Form and Restoring Body, the Twelvefold Qi of the Primordial Chaos Transforming and Generating Great Spirit—\n\nMay they now descend to this ritual altar to assist this servant in refinement and deliverance, ensuring that the souls undergoing refinement have their karmic filth dissolved like melting ice, their grievances and transgressions extinguished like dying embers, and that they may receive the merit of transformation, following their karma to be reborn.\n\nThis servant, unworthy and foolish, presumes to practice these rites, relying entirely on the true guidance and greatly bestowed with orthodox perfection. May the *qi* of the Dao, the *qi* of life, and the *qi* of Brahma—along with the true *qi* of the Three Lights—flow into this servant’s body, granting the grace of compassionate light to accomplish this sacred task.\n\nAll true water and true fire, this servant earnestly beseeches to fly into the Luminous Pool, fulfilling the pledge of efficacy.\n\nThis servant, daring to offend the majesty of the Dao, reflects from afar upon the profound grace, silently vowing to repay it with manifest virtue.\n\nThe High Priest transforms his spirit, establishing the Fire Marsh and Water Pool, merging water and fire.\n\nThe *Ti Hun* incantation is held within secret instructions; before the throne, a gatha is recited.\n\nThe High Priest ascends the seat, pinching incense with his left hand and intoning in truth:\n\nThis incense, congealed from the Three Pure Ones, its *qi* suffused with the Seven Numinous Spirits—\nFrom the Cinnabar Valley flows its essence, merging the gold’s purity of *Li* and *Kan*;\nFrom the Mystic Terrace is nurtured its excellence, the auspicious union of male and female inscribed in the jade tablets.\n\nThe incense is kindled in the censer,\nburned within the furnace, offered across the void to\nthe Primordial Dharma King, the Heavenly Treasure of the Cavern of Perfection,\nin reverent dedication for the deliverance of the departed souls.\n\nMay a thousand transgressions be absolved, ten thousand sins dissolved.\nTo the north, may the dark *qi* ascend as spirits, the white tally gleaming with the blessings of compassionate clouds;\nto the south, may lives be delivered, the cinnabar talisman melting with the auspicious radiance of the sun of kindness.\nMay litigation at the tomb cease in the household, and calamities in descendants be stilled.\n\nThe High Priest pinches incense with his left hand and invokes:\n\nThis incense, its essence divided from the Moon’s Grotto, its excellence nurtured from Heaven’s Root—\nPurple smoke ascends to the azure vault, its light illuminating the yang spirits;\ncolored mists fly along the Yellow Path, their auspiciousness revealing the yin luminaries.\n\nThe incense is kindled in the censer,\nburned within the furnace, offered across the void to\nthe Supreme Jade Clarity, the Numinous Treasure of the Cavern of Mystery,\nin reverent dedication for the deliverance of ancestral and former souls.\n\nMay each awaken to their true nature, suddenly realizing their original state,\nrelying on the golden tally to emerge from darkness, hearing the sutras and awakening to the Dao;\nwielding the jade talisman to ascend through the ranks, refining their substance and attaining perfection.\nMay they enjoy bliss without striving, carefree and at ease.\n\nThe High Priest pinches incense with his right hand and invokes:\n\nThis incense, its fragrance rising from the Three Ultimates, its *qi* bestowed by the Five Numinous Spirits—\nIts jade splendor shines upon the earth’s blossoms, its emerald flames resplendent;\nits golden radiance extends to heaven’s flowers, its mystery brilliant and luminous.\n\nThe incense is kindled in the censer,\nburned within the furnace, offered across the void.",
      "overlap_context": "fty Perfected Ones’ attention. May they command the chariot of five-colored floating clouds and raise the banner of ninefold radiant light. May the golden lads and jade maidens attend in harmony, the generals, officers, and divine soldiers manifest in majesty. Deign to descend to this ritual altar, preside over the refinement and deliverance, and receive this memorial, which shall now be reverently recited.\n\n*Recitation of the Purple Sovereign’s Memorial.*\n*Recitation of the Petition Concluded.*",
      "start_char": 1059,
      "end_char": 1847,
      "start_sentence": 44,
      "end_sentence": 81,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.81815242767334,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\紫皇炼度玄科.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "道德高尊，洞神神宝，奉祝斋主某东华锡庆，南极增龄。 七叶联芳，万里快云鹏之运； 五枝挺秀，九皋和凤鹤之鸣。 敦诗礼於松萝，耀弦歌於桑梓。 知磬举 太乙救苦天尊 高功直念 伏以乾称父，坤称母，乃资生资始之元。 阴为魄，阳为魂，成有形有灵之命。 盖万物各存於性命，惟一真不失於根源，而况最灵者人。 自是秉彝之道，一日是非善恶，或罹果报，或致升沉。 百年臭腐，神奇难免。 轮回难逃，变化，所以既没之后，飞爽浮幽，寥未生之前，故根离昔爱。 幽夜沦遐劫者，对尽而大运必通； 乘晨希阳翘者，灵存而正觉有想。 仰惟太上，布大法桥。 以好生而施仁，流真科而度世。 天一生水，地二生火，鋾炼玉粹而火降水升。 兑七化虎，震三化龙，守护金丹而龙吟虎啸。 非水火交姤，何以复其形； 非龙虎混合，何以全其神。 用此生成，谓之炼度。 红铅黑汞，以我之灵，合彼之灵； 绛宫丹田，以道之体，合彼之体。 肝心脾肺肾之气质，载育载生； 金木水火土之英华，以兹以养。 时也，布日月星景，建水火华池。 遵紫皇教法，以奉行鋾魂铸魄； 命南宫官吏，而显助濯质全形。 所冀在坛，受度亡魂，炼胎返本，初再禀五行之秀，斩根断死； 户重为万物之灵，克符斋主之虔诚，益广紫皇之教法，共扬圣号，恭假恩光。 知磬举 度人无量天尊",
      "translated_text": "The Dao of highest virtue, the Divine Treasure of the Cavernous Spirit—offered in prayer for the patron of this retreat, that the Eastern Florescence bestow blessings and the Southern Culmen extend their years. May seven generations of their lineage share in glory, as clouds swiftly borne by the roc’s flight across ten thousand leagues; may five branches flourish in splendor, as cranes and phoenixes harmonize their calls in the nine marshes. May they cultivate poetry and ritual among the pines and vines, and illuminate their native land with music and song.\n\n*Sound the chime*\n**Celestial Worthy of Universal Salvation, the Most High**\n\nThe High Priest intones directly:\n\nWe bow in reverence, for Heaven is called Father and Earth is called Mother, the primal source of all life and generation. Yin becomes the corporeal soul and Yang the ethereal soul, forming the embodied and sentient destiny of beings. All things preserve their nature and life, yet only the One True endures without losing its root—how much more so for humanity, the most spiritually endowed of all.\n\nYet by the inherent Way of human nature, a single day’s judgments of right and wrong, good and evil, may yield karmic retribution or determine ascent and descent. Though a hundred years may reduce all to decay, the wondrous and the base alike cannot escape. The wheel of rebirth is inescapable; transformation is inevitable. Thus, after death, the wandering soul drifts in darkness, while before birth, the root severs from past attachments. Those who languish through long nights in distant kalpas shall, when their allotted time is spent, find the great cycle open before them; those who ride the dawn and yearn for the light shall, with spirit preserved, awaken to true enlightenment.\n\nWe look up to the Most High, who has spread the great Dharma bridge—bestowing benevolence through love of life, and delivering the world through the flow of true precepts. Heaven-one generates water, Earth-two generates fire; refining jade essence with hammer and chisel, fire descends and water ascends. Dui-seven transforms into the tiger, Zhen-three transforms into the dragon; guarding the golden elixir, the dragon chants and the tiger roars. Without the union of water and fire, how could form be restored? Without the fusion of dragon and tiger, how could spirit be perfected? Through this process of generation and completion, it is called *refinement and deliverance*.\n\nRed lead and black mercury—with my spirit, I unite with theirs; the Crimson Palace and the Cinnabar Field—with the body of the Dao, I unite with their body. The qi and essence of liver, heart, spleen, lungs, and kidneys nurture and sustain life; the quintessence of metal, wood, water, fire, and earth nourish and cultivate. At this time, we array the radiance of sun, moon, and stars, and establish the Flowery Pond of water and fire. Following the teachings and methods of the Purple Emperor, we refine the ethereal and corporeal souls; we command the officials of the Southern Palace to assist in washing and perfecting form.\n\nMay the departed souls before this altar receive deliverance, refining their embryos to return to the root. Once more, they are endowed with the essence of the Five Phases, severing the root of death; anew, they become the most spiritually endowed of all beings. May the sincerity of the patron be fulfilled, the teachings of the Purple Emperor widely propagated, and the sacred name exalted together, as we humbly invoke the grace of their luminous power.\n\n*Sound the chime*\n**Celestial Worthy of Limitless Deliverance**",
      "overlap_context": "on.\nMay they enjoy bliss without striving, carefree and at ease.\n\nThe High Priest pinches incense with his right hand and invokes:\n\nThis incense, its fragrance rising from the Three Ultimates, its *qi* bestowed by the Five Numinous Spirits—\nIts jade splendor shines upon the earth’s blossoms, its emerald flames resplendent;\nits golden radiance extends to heaven’s flowers, its mystery brilliant and luminous.\n\nThe incense is kindled in the censer,\nburned within the furnace, offered across the void.",
      "start_char": 1847,
      "end_char": 2371,
      "start_sentence": 82,
      "end_sentence": 114,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.02288007736206,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\紫皇炼度玄科.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "高功直念 宣告亡魂，地水火风，假合成人之形； 痒痾疾痛，萦缠为心之恙。 深虑阳间所患，其在阴境亦然。 今者虽寂，色身未除，恶相先当去病，乃可合真。 某司谨召天医使者，治病功曹，尝药灵童，针砭神吏，六职治官，诸部功曹。 准紫皇玄天上帝符命，先为亡魂摄召生炁，医治在身，生前一切疾病，解释宿业，一切苦根。 荡除血秽，整具形神，符令自性灵明，克膺炼化。 侍职焚天医符 玉清元始尊，敕下天医神。 完全枯朽质，普济度天人。 高功取五方炁，布坛上水火混合之所 太上慈悲，符命颁行。 生者能全，死者能完。 形神俱妙，上朝玉堂。 流通五炁，落灭恶根。 红杳佐左震，瘫挛者伸。 磨针佐右兑，痪废者平。 袜腊下下离，跛痾起行。 墨墨上上坎，耳目聪明。 灵宝中中玉，身强体轻。 青帝护魂卯，肝木长荣。 赤帝养炁午，心火光亨。 白帝侍魄酉，肺金生成。 黑帝通血子，肾水澄清。 黄帝中主中，脾土安宁。 梵炁弥罗，自然成真。 回尸起死，白骨成人。 济度垂死，绝而得生。 九和十合，变化上清。 高功又念 四生六道，十类有情。 万死所苦，一切成章。 天光一接，符命得昌。 侍职焚血湖符，圊楼符，众念 太上丈人，升度南宫。 三宫变化，保命自然。 日宫帝君，列照下土。 月宫皇君，荡涤血湖。 元皇下降，灌溉群生。 对司侍宸，罪灭三途。 洪流荡秽，洗濯冥津。 元阳玉历，积善建功。 三界所举，骨像合仙。 善功彻天，幽夜开明。 阳九到阳，阴六召阴。 阴阳交合，敕断死户。 侍职梵分胎符，众念 三清至化，立像两仪。 烹炼魂识，玄应神机。 周全经络，百骸四肢。 五脏俱备，上升紫微。 侍职梵出胎符，众念 上帝敕命，下降幽扃。 烧荡秽浊，速得生成。 侍职梵荡胎符，众念 玄灵太微，精炼夷夷。 亡魂得度，洞达无为。 上天垂象，制炼亡魂。 十类孤爽，咸得通明。 仙化成人，三宫悉明。 九窍齐并，南昌上生。 侍职梵净尸符，众念 五行之炁周流，三光之炁飞浮。 灵浆下灌，玉液洞幽。 魂神澄正皈上天，会合万神玉京游。 天澄炁清，五色高明。 日月吐华，灌炼身形。 神精内灌，香汤炼精。 光景洞耀，焕映上清。 炁不受尘，五脏纳灵。 罪灭三途，祸消九冥。 恶根断绝，福庆自生。 今日大愿，一切告盟。 身受开度，升入帝乡。 急急如律令。 元始符命，拔度亡灵。 血尸臭秽，凶恶潜宁。 七液得注，五脏化生。 常持神咒，元亨利贞。 急急如元始上帝律令。 高功取五方炁、三光炁、布亡魂，默念 真中有神，长生大君，无英公子，白元尊神，太乙司命，桃康合延，执符把箓，保命生根。 上游上清，出入华□#2。 八冥之内，细微之中。 下镇人身，泥丸绛宫。 中理五炁，混合百神。 十转回灵，万炁齐仙。 知磬举 火炼丹界天尊",
      "translated_text": "The High Priest now intones, proclaiming to the departed souls:\nThe four elements—earth, water, fire, and wind—temporarily conjoin to form the human frame;\nAilments, pains, and afflictions coil and cling, becoming the heart’s distress.\nDeeply consider: what plagues the living in the yang realm likewise persists in the yin realm.\nThough now stilled, the physical form remains untranscended; first, the malevolent manifestations must be purged of illness before one may unite with the True.\n\nThe [Celestial] Bureau now respectfully summons the Heavenly Physicians, the Healing Merit Officers, the Divine Lads Who Taste Medicines, the Acupuncture Spirit Officials, the Six Offices of Healing, and all Departments’ Merit Officers.\nBy the talismanic decree of the Mysterious Heavenly Emperor of the Purple Empyrean, first gather the primordial qi for the departed souls, healing all ailments of the body, all illnesses from their former lives, and dissolving all karmic roots of suffering.\nPurge the blood’s impurities, restore the integrity of form and spirit, and by talismanic command, awaken the luminous clarity of their inherent nature to endure refinement and transformation.\n\nThe Attending Officers now burn the Heavenly Physician Talisman:\n*\"Jade Clarity’s Primordial Venerable One, dispatch the Heavenly Physicians below.\nRestore the withered and decayed, universally deliver and save all heavenly beings.\"*\n\nThe High Priest draws the qi of the Five Directions, arraying it at the altar’s site of water and fire commingling:\nBy the Great Supreme’s compassion, the talismanic decree is issued.\nThe living are preserved whole; the dead are made complete.\nForm and spirit both attain perfection, ascending to the Jade Hall.\nThe Five Qi flow freely, severing the roots of evil.\n\nRed Yao assists the left, Zhen: the paralyzed stretch forth.\nGrinding needles aid the right, Dui: the disabled are made whole.\nWax and tallow descend below, Li: the lame and afflicted rise and walk.\nInk ascends above, Kan: ears and eyes become keen and bright.\nThe numinous treasure at the central Jade: the body grows strong, the frame light.\n\nThe Azure Emperor guards the hun at Mao, the Liver-Wood flourishes long.\nThe Vermilion Emperor nurtures the qi at Wu, the Heart-Fire shines brightly.\nThe White Emperor attends the po at You, the Lung-Metal is born and perfected.\nThe Black Emperor channels the blood at Zi, the Kidney-Water becomes limpid and clear.\nThe Yellow Emperor, central sovereign at the Center, the Spleen-Earth finds peace.\n\nThe Brahman qi pervades the cosmos, naturally attaining the True.\nThe corpse revives from death; white bones become human again.\nDeliverance is bestowed upon the dying, the severed restored to life.\nNine harmonies and ten unions transform and ascend to the Upper Clarity.\n\nThe High Priest further intones:\nThe four births and six paths, the ten kinds of sentient beings,\nAll myriad sufferings of countless deaths—all are made manifest.\nWith a single touch of celestial light, the talismanic decree flourishes.\n\nThe Attending Officers now burn the Blood Lake Talisman and the Privy Tower Talisman, as all recite:\n*\"Great Supreme Elder, ascend and deliver to the Southern Palace.\nThe Three Palaces transform, preserving life naturally.\nThe Emperor of the Sun Palace illumines the earth below;\nThe Sovereign of the Moon Palace purges the Blood Lake.\nThe Primordial Emperor descends, irrigating all beings.\nFacing the Bureau, attending the Celestial Court, sins vanish from the Three Ways.\nThe mighty current washes away filth, cleansing the nether ford.\nThe Primordial Yang Jade Calendar accumulates merit and builds virtue.\nAll举ed by the Three Realms, bones and image unite with the immortals.\nVirtuous merit pierces the heavens, the dark night is illuminated.\nYang Nine summons yang; Yin Six calls forth yin.\nYin and yang conjoin, the decree severs the gate of death.\"*\n\nThe Attending Officers now burn the Separating Womb Talisman, as all recite:\n*\"The Three Clarities’ supreme transformation establishes the images of the Two Modes.\nThe hun and shi are refined, the mysterious responds to the divine mechanism.\nThe meridians are made whole, the hundred bones and four limbs.\nThe Five Viscera are all complete, ascending to the Purple Tenuity.\"*\n\nThe Attending Officers now burn the Exiting Womb Talisman, as all recite:\n*\"By the Emperor’s decree, descend into the dark prison.\nBurn and scour away filth and turbidity, swiftly attain rebirth.\"*\n\nThe Attending Officers now burn the Scouring Womb Talisman, as all recite:\n*\"Mysterious Numinous Great Tenuity, essence refines in purity.\nThe departed souls attain deliverance, penetrating and transcending non-action.\nHeaven hangs its signs, refining the departed souls.\nThe ten kinds of solitary spirits all attain illumination.\nTransmuted into human form, the Three Palaces are all enlightened.\nThe nine orifices align, ascending to Southern Prosperity.\"*\n\nThe Attending Officers now burn the Purifying Corpse Talisman, as all recite:\n*\"The qi of the Five Phases circulates; the qi of the Three Luminaries soars and floats.\nNuminous nectar descends to irrigate; jade liquid permeates the dark.\nThe hun and shen become clear and upright, returning to the heavens above,\nReuniting with the myriad spirits to roam the Jade Capital.\nThe heavens are limpid, the qi pure; the Five Colors rise in brilliance.\nSun and moon emit their radiance, refining the body’s form.\nThe spirit’s essence is inwardly irrigated; fragrant waters refine the essence.\nLight and brilliance illuminate and shine, resplendent in the Upper Clarity.\nThe qi remains unstained by dust; the Five Viscera receive the numinous.\nSins vanish from the Three Ways; misfortunes dissolve in the Nine Nether Realms.\nEvil roots are severed; blessings and felicity arise of themselves.\nToday’s great vow is proclaimed to all.\nThe body receives liberation and ascends to the Emperor’s realm.\nSwiftly, swiftly, as in the statutes and ordinances!\"*\n\n*\"By the Primordial Beginning’s talismanic decree, deliver the departed spirits.\nBlood, corpse, stench, and filth—all malevolence is stilled and pacified.\nThe Seven Fluids are infused; the Five Viscera are transformed and born.\nEver uphold the divine incantation: Primordial, prosperous, harmonious, and steadfast.\nSwiftly, swiftly, as in the Primordial Beginning Emperor’s statutes and ordinances!\"*\n\nThe High Priest draws the qi of the Five Directions and the Three Luminaries, arraying it upon the departed souls, silently intoning:\n*\"Within the True resides the spirit, the Great Lord of Longevity,\nThe Peerless Noble Son, the White Prime Venerable Spirit,\nThe Great Monad Controller of Destiny, Peach and Ginseng united in extension,\nGrasping talismans and holding registers, preserving life and rooting existence.\nAscend to the Upper Clarity, enter and exit the Flowery [Palace].\nWithin the Eight Nether Realms, in the subtlest of spaces,\nBelow, they guard the human body, the Muddy Pellet and Crimson Palace.\nWithin, they govern the Five Qi, harmonizing the hundred spirits.\nTen revolutions return the numinous; the myriad qi unite as immortals.\"*\n\n*Sound the chime*\n**Celestial Worthy of the Cinnabar Realm’s Refinement**",
      "overlap_context": "s before this altar receive deliverance, refining their embryos to return to the root. Once more, they are endowed with the essence of the Five Phases, severing the root of death; anew, they become the most spiritually endowed of all beings. May the sincerity of the patron be fulfilled, the teachings of the Purple Emperor widely propagated, and the sacred name exalted together, as we humbly invoke the grace of their luminous power.\n\n*Sound the chime*\n**Celestial Worthy of Limitless Deliverance**",
      "start_char": 2371,
      "end_char": 3472,
      "start_sentence": 115,
      "end_sentence": 204,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.800697803497314,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\紫皇炼度玄科.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "高功召火炼官将 谨召丹天流火主者、炼度真人，火池使者，火池童子，火府神吏，雷门忠孝阳雷苟元帅，紫皇炼度一行官将吏兵，引魂使者，引导亡魂，入火沼炼度。 务令业垢烟消，冤尤烬灭，惧形太阳，再生人质。 一如紫皇玄天上帝符命，疾速奉行。 侍职焚火炼符，于火沼内 众诵元始中篇 高功默念 南方之君，赤帝之精。 荧使者，丙丁将军。 朱雀炎神，赫赫阳精。 五行造化，万物化生。 天帝有敕，使者须听。 摄亡召魂，炼度身形。 高功以双目，熌动电光 左手剔午火，呵炁入 想火沼，真火炎炎，众念 炎精之神，三台流光。 炼胎易质，魄炼魂更。 秽炁殂落，乘烟飞扬。 阴炁消释，阳炁混康。 精神益壮，洞入火乡。 混合九炁，总契虚皇。 昊天有敕，流金散芒。 九天焕落，贞利无疆。 想亡魂，在火沼受炼 六甲六乙，炼汝肝经。 生汝威神，体健身轻。 六丙六丁，生汝心经。 炼汝神气，保汝长生。 六庚六辛，生汝肺经。 大肠小肠，万炁潜明。 六壬六癸，炼汝肾经。 华精盈池，骨髓安宁。 六戊六己，炼汝脾经。 长生久视，骨肉轻清。 炼身复形，化体三清。 高功玉文青炁布亡魂，众念 龙汉荡荡，无形无名。 渺渺亿劫，黄道开明。 神澄朗曜，九魂吐精。 玉虚澄晖，太霞高明。 元始开化，诸天齐并。 三元道炁，二象摄生。 已度者度，未成者成。 已死即生，已枯使荣。 蠢动蜎息，一切冥灵。 怀胎含孕，咸得长生。 亡者命过，魂归三清。 魄受炼度，南宫变形。 今日大吉，皆得光明。 五帝鉴映，普告万灵。 天神地祇，及诸河源。 五岳四渎，及诸名山。 洞玄洞虚，洞空洞仙。 无极大圣，至真尊神。 无穷无极，普鉴度生。 地根断绝，玄都纪名。 众真普应，一切咸听。 高功直念",
      "translated_text": "The High Priest summons the Fire Refinement Officers and Generals:\nSolemnly invoking the Master of Flowing Fire of the Cinnabar Heaven, the True Persons of Refinement and Salvation, the Fire Pool Envoys, the Fire Pool Lads, the Divine Clerks of the Fire Bureau, Marshal Gou Yuan of the Loyalty-and-Filiality Thunder Gate, and all officers, generals, clerks, and soldiers of the Purple Sovereign’s Refinement and Salvation—lead the soul-escorting envoys to guide the departed souls into the Fire Pool for refinement and salvation. Thereby, let karmic filth dissipate like smoke, grievances and transgressions be extinguished like embers, the form fear the Great Yang, and the human substance be reborn anew. As decreed by the Talisman Command of the Purple Sovereign of the Mysterious Heavenly Emperor, swiftly carry this out.\n\nThe attending officers burn the Fire Refinement Talismans within the Fire Pool.\nAll recite the *Central Chapter of the Primordial Beginning*.\nThe High Priest silently intones:\n*\"The Lord of the Southern Quarter, the Essence of the Red Emperor,\nThe Radiant Torch Envoys, the Generals of Bing and Ding,\nThe Vermilion Phoenix, the Fiery Spirit, the resplendent essence of Yang,\nThe Five Phases engender transformation, the myriad things take form and live.\nBy the Emperor’s edict, the envoys must heed:\nSeize the departed, summon the soul, refine and salvage the bodily form.\"*\n\nThe High Priest’s eyes flash like lightning,\nhis left hand stirs the Fire of Wu,\nand he exhales qi into it.\nEnvisioning the Fire Pool, true fire blazing fiercely,\nall chant:\n*\"Spirits of Fiery Essence, streaming light of the Three Terraces,\nRefining the embryo, transmuting the substance, the po refined, the hun renewed.\nFoul qi falls away, borne aloft on rising smoke.\nYin qi dissolves and disperses; Yang qi blends in harmony.\nThe spirit grows ever stronger, penetrating deeply into the Fire Realm.\nMerging with the Nine Qi, wholly uniting with the Primal Sovereign.\nBy edict of the Vast Heaven, molten gold scatters its radiance.\nThe Nine Heavens gleam and descend; steadfast fortune knows no bounds.\"*\n\nEnvision the departed soul within the Fire Pool, receiving refinement:\n*\"Six Jia and Six Yi refine your Liver Meridian,\ngenerating your majestic spirit, making your body sturdy and light.\nSix Bing and Six Ding refine your Heart Meridian,\nforging your spirit-qi, preserving your long life.\nSix Geng and Six Xin refine your Lung Meridian,\nthe Large and Small Intestines, the myriad qi latent and luminous.\nSix Ren and Six Gui refine your Kidney Meridian,\nthe Essence of Hua fills the pool, bones and marrow find peace.\nSix Wu and Six Ji refine your Spleen Meridian,\nprolonging life and enduring vision, flesh and bones become light and pure.\nRefine the body, restore the form, transform the substance into the Three Clarities.\"*\n\nThe High Priest arrays Jade Script and Azure Qi upon the departed soul,\nand all chant:\n*\"The Dragon Han vast and boundless, formless and nameless,\nAcross countless eons, the Yellow Dao shines forth.\nSpirits clear and radiant, the Nine Hun exhale their essence.\nJade Clarity gleams, the Great Auroras rise in splendor.\nThe Primordial Beginning unfolds transformation; all heavens align as one.\nThe Dao-qi of the Three Origins, the Two Images embrace life.\nThose already delivered are delivered; those unformed are formed.\nThe dead are revived; the withered are made flourishing.\nAll creatures that creep and breathe, every dark spirit,\nThose with child and those with embryo—all attain long life.\nThe departed whose fate is spent return their souls to the Three Clarities.\nThe po receives refinement; in the Southern Palace, the form is transformed.\nToday is most auspicious; all attain illumination.\nThe Five Emperors witness and reflect, universally proclaiming to the myriad spirits.\nHeavenly gods and earthly deities, all river sources,\nThe Five Marchmounts and Four Waterways, all renowned mountains,\nThe Caverns of Mystery, the Caverns of Emptiness, the Caverns of Void, the Caverns of Immortals,\nThe Great Saints of the Boundless, the Perfected and Venerable Divinities—\nLimitless and infinite, universally behold and deliver life.\nThe roots of earth are severed; names are recorded in the Mysterious Capital.\nAll Perfected respond universally; all things heed.\"\n\nThe High Priest recites directly.",
      "overlap_context": "xtension,\nGrasping talismans and holding registers, preserving life and rooting existence.\nAscend to the Upper Clarity, enter and exit the Flowery [Palace].\nWithin the Eight Nether Realms, in the subtlest of spaces,\nBelow, they guard the human body, the Muddy Pellet and Crimson Palace.\nWithin, they govern the Five Qi, harmonizing the hundred spirits.\nTen revolutions return the numinous; the myriad qi unite as immortals.\"*\n\n*Sound the chime*\n**Celestial Worthy of the Cinnabar Realm’s Refinement**",
      "start_char": 3472,
      "end_char": 4164,
      "start_sentence": 205,
      "end_sentence": 263,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.503734588623047,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\紫皇炼度玄科.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "火沼官吏，炼度既周，出火沼，诣水池受炼。 一如紫皇玄天上帝律令。 知磬举 黄华荡形天尊 高功召水炼官将 谨召天河东井、玉眸黄华大神，炼度真人，水池使者，水池童子，水府神吏，雷门忠孝阴雷毕元帅，紫皇炼度一行官将吏兵，引魂使者，引导亡魂，入水池炼度。 务令业垢冰清，冤污荡涤，凝神太阴，再生人质。 一如紫皇玄天上帝符命，疾速奉行。 侍职焚水炼符，于水池内 众诵中篇 高功默念 北方之君，黑帝之精。 辰星使者，壬癸将军。 玄武阴神，肃肃清音。 五行造化，万物发生。 天帝有敕，使者须听。 摄召亡魂，灌炼身形。 高功以鼻出气，化水入 左手剔子文吹入 想水池，真水茫茫，众念 东井黄华，石景王精。 飞玄水母，金体玉津。 滔滔源源，不竭池庭。 九龙灌溉，三光垂精。 仙人吐润，擢炼亡魂。 内外朗彻，表裹俱清。 百关九窍，元炁滋荣。 五脏六腑，万神自生。 胞胎结节，随水开扃。 死根断灭，恶根沉沦。 我今炼化，死骸生魂。 返故改貌，玉体金容。 变化荡秽，飞升紫庭。 想亡魂，在水池受炼 众念 紫微黄书，名曰太玄。 致月华水，养魄和魂。 身中养素，发身玄关。 藏天隐地，五灵夫人，飞光九道，映朗泥丸。 黄炁阴华，阳精炼仙。 沐浴九魂，冠带金晨。 圆明启告，玉胎炼仙。 华光交映，流芳淘津。 九阳齐化，玄和降津。 元景徘徊，曲降我身。 飞升上宫，洞视琼轩。 高功玉文，中天青炁，嘘布亡魂 又念 龙汉荡荡，无形无名。 渺渺亿劫，黄道开明。 神澄朗耀，九魂吐精。 玉虚澄晖，太霞高明。 元始开化，诸天齐并。 三元道炁，二象摄生。 已度者度，未成者成。 已死即生，已枯即荣。 蠢动蜎息，一切冥灵。 怀胎含孕，咸得长生。 亡者命过，魂归三清。 魄受炼度，南宫变形。 今日大吉，皆得光明。 五帝鉴映，普告万灵。 天神地祇，及诸河源。 五岳四渎，及诸名山。 洞玄洞虚。 洞空洞仙。 无极大圣，至真尊神。 无穷无极，普鉴度生。 地根断绝，玄都纪名。 众真普应，一切咸听。 高功直念",
      "translated_text": "The officials of the Fire Marsh complete their refinement and emerge from the Fire Marsh, proceeding to the Water Pool to receive further refinement. As decreed by the Purple Sovereign, Mysterious Heavenly Emperor.\n\n*Sound the chime, raise the invocation:*\n**Yellow Flower, Transfiguring Heavenly Worthy—**\nThe High Priest summons the officials and generals of the Water Refinement:\nWith reverence, we call upon the Eastern Well of the Celestial River, the Great Divine of the Jade Eye and Yellow Flower, the Perfected of Refinement, the Envoys of the Water Pool, the Lads of the Water Pool, the Divine Clerks of the Water Palace, Marshal Biyuan of Loyalty and Filial Piety of the Thunder Gate’s Yin Thunder, and all officials, generals, clerks, and soldiers of the Purple Sovereign’s Refinement—\nLead the guiding envoys of souls, escort the departed spirits into the Water Pool for refinement. Ensure their karmic grime is purged like melting ice, their grievances and defilements cleansed as if washed away. Gather their spirits in the Great Yin, reborn in human form.\n\nAs commanded by the talisman of the Purple Sovereign, Mysterious Heavenly Emperor, swiftly obey.\n\n*The attendant officers burn the Water Refinement Talisman in the Water Pool.*\n*All recite the Middle Chapter.*\nThe High Priest silently intones:\n\n**Lord of the Northern Quarter, Essence of the Black Emperor,**\nMessenger of the Star of the Morning, Generals Ren and Gui.\nThe Yin Spirits of the Dark Warrior, their voices solemn and clear.\nThe Five Phases engender transformation; the myriad things arise.\nBy the Emperor’s decree, the messengers must heed:\nSummon the departed souls, bathe and refine their forms.\n\nThe High Priest exhales through the nose, transforming breath into water, and blows it into the *tizi* pattern with the left hand.\nEnvision the Water Pool: true water vast and boundless.\n*All recite:*\nThe Eastern Well and Yellow Flower, essence of the Stone King.\nThe Flying Dark Water Mother, her body golden, her fluids jade.\nFlowing endlessly, an inexhaustible pool.\nNine Dragons pour forth their streams; the Three Luminaries bestow their essence.\nImmortal beings exhale their moisture, refining the departed souls.\nWithin and without, radiant and clear; surface and interior, both purified.\nThe hundred joints and nine orifices are nourished by primordial qi.\nThe five viscera and six bowels give rise to the myriad spirits.\nThe knots of the womb and embryo dissolve like water unlocking its gates.\nThe roots of death are severed; the roots of evil sink into oblivion.\nNow we refine and transform: the dead husk becomes a living soul.\nReturn to the former state, alter the countenance—\nA jade body, a golden visage.\nTransformed, the filth is swept away; soaring, they ascend to the Purple Court.\n\nEnvision the departed souls in the Water Pool, receiving refinement.\n*All recite:*\nThe Purple Tenuous Yellow Writ, named the Great Mystery.\nIt brings the water of moonlight to nurture the *po* and harmonize the *hun*.\nWithin the body, cultivate simplicity; from the body, the Mysterious Pass emerges.\nHidden in heaven, concealed in earth—\nThe Five Numinous Ladies, nine beams of flying light,\nilluminate the Muddy Pellet.\nYellow qi and Yin blossoms, Yang essence refines the immortal.\nBathe the nine souls, crown them in the Golden Dawn.\nRadiant and resplendent, proclaim the Jade Embryo’s refinement into immortality.\nInterwoven brilliance flows like fragrant rapids.\nThe Nine Yangs transform in unison; the Mysterious Harmony descends in streams.\nThe Primordial Scenery lingers, curving to descend into my body.\nSoaring to the Upper Palace, gazing upon the jeweled pavilion.\n\nThe High Priest inscribes the Jade Writ, exhaling the Azure Qi of the Central Heaven to spread over the departed souls.\n*He further intones:*\nIn the vastness of the Dragon Han, formless and nameless,\nAcross boundless kalpas, the Yellow Dao shines forth.\nSpirits are serene and luminous; the nine souls exhale their essence.\nThe Jade Void gleams with clarity; the Great Radiance stands in splendor.\nThe Primordial Beginning initiates transformation; all heavens unite as one.\nThe Dao-qi of the Three Origins, the Two Images embrace life.\nThose already delivered deliver others; the unformed are formed.\nThe dead are revived; the withered flourish anew.\nAll crawling and wriggling beings, all hidden spirits,\nThose with child and those with child yet unborn—all attain long life.\nThe departed whose fate is spent return their souls to the Three Clarities.\nThe *po* receives refinement; in the Southern Palace, the form is transformed.\nToday is most auspicious; all attain illumination.\nThe Five Emperors witness and reflect, universally proclaiming to the myriad spirits.\nHeavenly gods and earthly deities, all river sources,\nThe Five Marchmounts and Four Waterways, all renowned mountains,\nThe Caverns of Mystery, the Caverns of Emptiness, the Caverns of Void, the Caverns of Immortals,\nThe Great Saints of the Boundless, the Perfected and Venerable Divinities—\nLimitless and infinite, universally behold and deliver life.\nThe roots of earth are severed; names are recorded in the Mysterious Capital.\nAll Perfected respond universally; all things heed.\n\nThe High Priest recites directly.",
      "overlap_context": " earthly deities, all river sources,\nThe Five Marchmounts and Four Waterways, all renowned mountains,\nThe Caverns of Mystery, the Caverns of Emptiness, the Caverns of Void, the Caverns of Immortals,\nThe Great Saints of the Boundless, the Perfected and Venerable Divinities—\nLimitless and infinite, universally behold and deliver life.\nThe roots of earth are severed; names are recorded in the Mysterious Capital.\nAll Perfected respond universally; all things heed.\"\n\nThe High Priest recites directly.",
      "start_char": 4164,
      "end_char": 4978,
      "start_sentence": 264,
      "end_sentence": 334,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.81446599960327,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\紫皇炼度玄科.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "水池官吏，炼度既周，引领亡魂出水池，伺候生化，一如紫皇玄天上帝律令。 知磬举 受炼更生天尊 高功直念 惟人之生，有物混成。 乾道成男，坤道成女。 帝君品命，太乙执符，司命定算，太乙度符，五帝监生，九天称庆，司命敬诺敬顺，万神唱奉。 恭天地神示，三界备守，如此化结，方能成人。 今日在坛，受度亡过某魂，曩因命过，□返泉扃，气散神游，身亡形灭。 所幸一灵不灭，本真未离。 变化更生，太上有法。 十二炁混元能生十二经络，返生人道，自有高上神霄玉清玄一六阳混元十二炁化生大将军主之。 今为奉行紫皇玄天上帝，炼度符法。 请降太上正真生炁，九天生神梵炁，混合己身元神正炁，各命将吏，化生如法。 灵宝自然九天生神玉章，大众虔诚，异口同音，缓声演诵。 二助道，各执水火旛，领众念生神章，一顺一逆，绕行交炼法 侍职焚化生肾脏、膀胱符 高功默念 肾神玄真君、字育婴摄，一炁混元将军杨文光，膀胱神太虚君、传送摄，六炁混元将军张同。 存子文中天炁北方水炁，咽人丹田与肾炁、膀胱炁混合 黑黑 一炁六遍吹布亡魂，化生肾、生膀胱 高功默念 肾部之宫玄阙圆，中有童子冥上玄。 主诸六部九液源，外应两耳百液津。 苍锦云衣舞龙蟠，上致明霞日月烟。 百病千灾急当存，两部水玉对生门。 侍职焚化生心脏、小肠符 高功默念 心神丹元君、字守灵摄。 二炁混元将军丁忠，小肠神太灵君、字水谷摄，七炁混元将军李渊。 左午文中天炁、南方赤炁，咽入丹田与心炁、小肠炁、混合默念，袜腊，一炁七遍呵布亡魂，化生心小肠 高功默念 心部之宫莲含花，下有童子丹元家。",
      "translated_text": "The officials of the Water Pool, having completed the refinement and deliverance, now lead the departed souls forth from the Water Pool, awaiting their transformation and rebirth, in accordance with the decrees of the Purple Sovereign, the Mysterious Heavenly Emperor.\n\n*Responding to the sounding of the qing bell:*\nThe Most High Venerable Lord of Refinement and Rebirth\n\nThe High Priest recites directly.\n\nOf human birth, there is that which coalesces into form.\nThe Dao of Heaven creates man; the Dao of Earth creates woman.\nThe Divine Lords bestow destiny; the Great One holds the talisman.\nThe Director of Fates determines the allotted span; the Great One delivers the talisman.\nThe Five Emperors oversee life; the Nine Heavens rejoice in celebration.\nThe Director of Fates reverently assents and obeys; the myriad spirits sing in harmony.\n\nRevering the divine decrees of Heaven and Earth, the Three Realms stand guard in full array.\nOnly through such transformation and coalescence can a person be formed.\n\nToday, within this altar, the departed soul of so-and-so, whose fate has run its course,\nonce returned to the gate of the Yellow Springs, qi scattered and spirit wandered, body perished and form vanished.\nFortunately, the one spirit remains undying, the original true nature yet unsevered.\nThrough transformation and rebirth, the Most High possesses the method:\nThe Twelve Qi of the Primordial Chaos can generate the twelve meridians,\nreturning to the human Dao, governed by the Highest Lord of the Divine Empyrean,\nthe Jade Clarity of the Primordial Unity, the Six Yang of the Primordial Chaos,\nand the Twelve Qi Generative Great Generals.\n\nNow, in accordance with the Purple Sovereign, the Mysterious Heavenly Emperor,\nwe perform the talismanic rites of refinement and deliverance.\nWe invoke the descent of the Most High’s Orthodox True Qi of Life,\nthe Nine Heavens’ Qi of Divine Generation,\nto blend with the original spirit and orthodox qi of the departed,\ncommanding the generals and officials to transform and regenerate according to the method.\n\nThe *Lingbao Natural Jade Chapters of the Nine Heavens’ Divine Generation*—\nthe assembly, with utmost reverence, recites in unison, voices harmonized, tones drawn out.\n\nThe two assistants, each holding the Water and Fire Banners,\nlead the assembly in chanting the *Divine Generation Chapters*,\ncircling in alternating directions to perform the intersecting refinement rites.\n\nThe attendants burn the talismans for generating the kidneys and bladder.\n\nThe High Priest recites silently:\nThe Kidney Spirit, the Mysterious True Lord, styled Yu Ying, overseer,\nand Yang Wenguang, the General of the Primordial Qi of Unity.\nThe Bladder Spirit, the Supreme Void Lord, styled Transmitter, overseer,\nand Zhang Tong, the General of the Six Qi of the Primordial Chaos.\n\nVisualize the midnight celestial qi of the Northern Water within the Zi character,\nswallowed into the cinnabar field, blending with the qi of the kidneys and bladder.\n*Black, black*—one qi, six repetitions, blown upon the departed soul,\ntransforming and generating the kidneys and bladder.\n\nThe High Priest recites silently:\nWithin the Palace of the Kidney’s Domain, the Dark Gate stands round,\nwhere dwells a youth, profound and mysterious.\nHe governs the six divisions and the nine sources of fluids,\nexternally corresponding to the two ears and the hundred streams of essence.\nClad in azure brocade, dancing dragons coil,\nascending to summon luminous clouds, sun, moon, and mist.\nFor the swift alleviation of the hundred ailments and thousand afflictions, hasten to visualize:\nthe two departments of Water and Jade face the Gate of Life.\n\nThe attendants burn the talismans for generating the heart and small intestine.\n\nThe High Priest recites silently:\nThe Heart Spirit, the Cinnabar Prime Lord, styled Guardian of the Numinous, overseer,\nand Ding Zhong, the General of the Two Qi of the Primordial Chaos.\nThe Small Intestine Spirit, the Supreme Numinous Lord, styled Water and Grain, overseer,\nand Li Yuan, the General of the Seven Qi of the Primordial Chaos.\n\nVisualize the celestial qi of the Southern Fire within the Wu character of the noon script,\nswallowed into the cinnabar field, blending with the qi of the heart and small intestine.\n*Silently recite, then exhale with a \"ha\" sound*—one qi, seven repetitions, blown upon the departed soul,\ntransforming and generating the heart and small intestine.\n\nThe High Priest recites silently:\nWithin the Palace of the Heart’s Domain, a lotus holds its bloom,\nbeneath which dwells a youth, the household of the Cinnabar Prime.",
      "overlap_context": "d earthly deities, all river sources,\nThe Five Marchmounts and Four Waterways, all renowned mountains,\nThe Caverns of Mystery, the Caverns of Emptiness, the Caverns of Void, the Caverns of Immortals,\nThe Great Saints of the Boundless, the Perfected and Venerable Divinities—\nLimitless and infinite, universally behold and deliver life.\nThe roots of earth are severed; names are recorded in the Mysterious Capital.\nAll Perfected respond universally; all things heed.\n\nThe High Priest recites directly.",
      "start_char": 4978,
      "end_char": 5667,
      "start_sentence": 335,
      "end_sentence": 368,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.980158805847168,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\紫皇炼度玄科.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "主适寒热荣卫和，丹锦衣裳披玉罗。 金铃朱带坐婆娑，调血理命身不枯。 外应口舌吐五华，临绝呼之亦登苏， 久久行之飞太霞。 侍职焚化生肝脏、生胆符 高功默念 肝中龙渊君、字合明摄，三炁混元将军丁迁善，胆神龙耀君、字威明摄， 八煞混元将军申孚。 左卯文中天炁、东方青炁、咽入丹田与肝炁、胆炁混合，默念，红杏一炁八遍，嘘炁布亡魂化生肝、生胆 高功默念 肝部之宫翠重裹，下有青童神公子。 主诸关镜聪明始，青锦披裳佩玉铃。 和制魂魄津液平，外应眼目日月精。 百痾所锺存无英，同用七日自充溢。 垂绝念神死复生，摄魂返魄永无倾。 侍职焚化生肺脏、生大肠符 高功默念 肺神皓华君、字虚成摄，四炁混元将军陈志元，大肠神元王君、字治和摄，九炁混元将军周自然。 左酉文中天炁、西金炁，咽及丹田，肺炁、大肠炁，混合默念，磨针一炁九遍，咽布亡魂，生肺、生大肠 高功默念 肺部之宫似华盖，下有童子坐玉关。 七元之子主调气，外应中岳鼻齐位。 素锦衣裳黄云带，喘息呼吸体不快。 急存白元和六炁，神仙久视无灾害。 用之不已形不滞。 侍职焚化生脾、生胃符 高功默念 脾神常在君、字安停摄，五炁混元将军王先知，胃神灵源君、字太仓摄，十炁混元将军章修。 左玉文中天土炁，咽入丹田，与脾炁、胃炁混合，默念灵宝一炁十遍，呼布亡魂，生脾、生胃 高功默念 脾部之宫属戊己，中有明童黄裳裹。 消谷散气摄牙齿，是为太仓两明童。 坐在金台城九重，方圆一寸命门中。 主调百谷五味香，辟却虚赢#3无病伤。 外应尺宅气色芳，光华所生以表明。 黄锦玉衣带虎章，注念三老子轻翔。 长生高仙远死殃。 侍职焚化生三焦、生心、生胞络符 高功默念 三焦神罗列君、字玄液摄，十一炁混元将军王卓立，心胞络神赤珠君、字灵运摄，十二炁混元将军郑明。 左玉文中天炁、中央三色青白黄炁，咽入丹田，与胞络三焦心混合。 一身结节百脉之炁，吹布亡魂，生三焦、生心胞络、生结节、生百脉 混元育形神，主领寅一方。 天朗司阳炁，化生三焦脏。 混元一炁神，主领戍乾方。 天朗司真炁，化育成胞络。 侍职焚全形符 高功左手玉文取五方真炁十二口，咽作一神状，如婴儿，衣白霞，衣项有圆光，神放祥光，下布一形之内，散入九孔之中，聚在舌尖吹布。 亡魂全一身五脏、六腑、四肢、百脉俱全矣 众念 太上洞明，飞景九元。 结精凝炁，化形变神。 司命混合，散形亿分。 千乘火甲，万骑扬旛。 俱与太乙，上造帝仙。 伯无起非，仲成曲文。 一合我炁，再合我神。 三合我魂，四合我魄。 五合我清，六合我形。 成身六合，洞霞启真。 八景虚驾，三素浮轮。 我与帝一，俱升玉宸。 重华累枝，混合天仙。 身有道籍，世有生根。 金简羽符，名刊日轩。 所愿既从，天禄诜诜。 所向如心，万神盈门。 常存太乙，帝一泥丸。 雌雄混合，百灵缠绵。 诵经万徧，灵驾来迎。 携宴五帝，日月九君。 得为神仙，上清真人。 想亡魂形体，俱全矣 众再念 龙汉荡荡，无形无名。 渺渺亿劫，黄道开明。 神澄朗耀，九魂吐精。 玉虚澄辉，太霞高明。 元始开化，诸天齐并。 三元道炁，二象摄生。 已度者度，未成者成。 已死即生，已枯使荣。",
      "translated_text": "The Master regulates cold and heat, harmonizing the constructive and defensive qi,\nrobed in cinnabar brocade and draped in jade gauze.\nGolden bells and vermilion sashes sway as he sits in dance,\nregulating blood and governing life—his body never withers.\nExternally, the mouth and tongue emit the Five Flowers;\nwhen near death, calling upon him brings revival.\nPracticed long, one soars upon the Great Rosy Clouds.\n\nThe attendant burns the talismans for generating the liver and gallbladder.\n\nThe High Priest recites silently:\nWithin the Liver’s Dragon Abyss Lord, styled Harmonious Luminance, overseer,\nand Ding Qianshan, the General of the Three Qi of the Primordial Chaos.\nThe Gallbladder’s Dragon Radiance Lord, styled Majestic Luminance, overseer,\nand Shen Fu, the General of the Eight Malevolent Qi of the Primordial Chaos.\n\nVisualize the celestial qi of the Eastern Wood within the Mao character of the dawn script,\nswallowed into the cinnabar field, blending with the qi of the liver and gallbladder.\n*Silently recite, then exhale with a \"xu\" sound*—one qi, eight repetitions, blown upon the departed soul,\ntransforming and generating the liver and gallbladder.\n\nThe High Priest recites silently:\nWithin the Palace of the Liver’s Domain, layers of jadeite enfold,\nbeneath which dwells a youth, the Azure Lad.\nHe governs the myriad barriers, the origin of clarity and wisdom,\nclad in azure brocade and girded with jade bells.\nHarmonizing the hun and po, balancing the fluids,\nexternally corresponding to the eyes and the essence of sun and moon.\nThe hundred ailments that afflict him dissolve into the Wuying,\npracticed for seven days, they naturally overflow.\nAt the brink of death, invoke the spirit—life returns;\ngathering the hun and returning the po, never to falter.\n\nThe attendant burns the talismans for generating the lungs and large intestine.\n\nThe High Priest recites silently:\nThe Lung’s Radiant Flower Lord, styled Void Perfection, overseer,\nand Chen Zhiyuan, the General of the Four Qi of the Primordial Chaos.\nThe Large Intestine’s Primordial King Lord, styled Governance and Harmony, overseer,\nand Zhou Ziran, the General of the Nine Qi of the Primordial Chaos.\n\nVisualize the celestial qi of the Western Metal within the You character of the dusk script,\nswallowed into the cinnabar field, blending with the qi of the lungs and large intestine.\n*Silently recite, then exhale with a \"si\" sound*—one qi, nine repetitions, blown upon the departed soul,\ngenerating the lungs and large intestine.\n\nThe High Priest recites silently:\nWithin the Palace of the Lung’s Domain, like a flowered canopy,\nbeneath which sits a youth at the Jade Barrier.\nThe Seven Origins’ Lad governs the regulation of qi,\nexternally corresponding to the Central Peak and the nose’s central position.\nClad in plain brocade and a yellow cloud sash,\nwhen breath is labored and the body unwell,\nhastily invoke the White Prime to harmonize the Six Qi—\nthe immortal’s long gaze knows no calamity.\nPracticed without cease, the form never stagnates.\n\nThe attendant burns the talismans for generating the spleen and stomach.\n\nThe High Priest recites silently:\nThe Spleen’s Ever-Present Lord, styled Peaceful Abode, overseer,\nand Wang Xianzhi, the General of the Five Qi of the Primordial Chaos.\nThe Stomach’s Numinous Source Lord, styled Great Granary, overseer,\nand Zhang Xiu, the General of the Ten Qi of the Primordial Chaos.\n\nVisualize the celestial qi of the Central Earth within the Earth script,\nswallowed into the cinnabar field, blending with the qi of the spleen and stomach.\n*Silently recite the Numinous Treasure incantation*—one qi, ten repetitions, exhaled upon the departed soul,\ngenerating the spleen and stomach.\n\nThe High Priest recites silently:\nThe Palace of the Spleen’s Domain belongs to Wu and Ji,\nwithin which a luminous youth is wrapped in yellow robes.\nHe disperses grain and scatters qi, governing the teeth,\nthe Great Granary’s Two Luminous Lads.\nSeated within the ninefold golden terrace,\na square inch at the Gate of Life.\nHe regulates the hundred grains and the five fragrant flavors,\nwarding off emaciation and illness.\nExternally corresponding to the complexion of the wrist’s abode,\nthe radiance thus generated manifests.\nClad in yellow brocade and jade robes, girded with tiger talismans,\ninvoke the Three Elders—lightly soaring.\nLong life and high immortality, far from the calamity of death.\n\nThe attendant burns the talismans for generating the Triple Burner, heart, and pericardium.\n\nThe High Priest recites silently:\nThe Triple Burner’s Arrayed Spirits Lord, styled Mystic Fluid, overseer,\nand Wang Zhuoli, the General of the Eleven Qi of the Primordial Chaos.\nThe Pericardium’s Vermilion Pearl Lord, styled Numinous Motion, overseer,\nand Zheng Ming, the General of the Twelve Qi of the Primordial Chaos.\n\nVisualize the celestial qi of the Central Palace within the Earth script,\nthe Three Colors—azure, white, and yellow—swallowed into the cinnabar field,\nblending with the pericardium, Triple Burner, and heart.\nThe qi of the body’s nodes and hundred vessels,\nblown upon the departed soul,\ngenerating the Triple Burner, pericardium, heart, nodes, and hundred vessels.\n\nThe Primordial nurtures form and spirit,\ngoverning the northeast quarter.\nHeaven’s brightness governs the yang qi,\ntransforming and generating the Triple Burner.\nThe Primordial’s singular qi-spirit,\ngoverning the northwest and Qian directions.\nHeaven’s brightness governs the true qi,\nnurturing and completing the pericardium.\n\nThe attendant burns the talisman for completing the entire form.\n\nThe High Priest, with his left hand holding the Jade Script, draws the true qi of the Five Directions—twelve breaths—\nswallowed into a single spirit-form, like an infant,\nclad in white rosy clouds, a halo crowning its neck,\nthe spirit radiating auspicious light,\ndescending to suffuse the entire form,\ndispersing into the nine orifices, gathering at the tongue’s tip, then blown forth.\nThe departed soul’s entire body—five viscera, six bowels, four limbs, and hundred vessels—is now complete.\n\nAll recite:\nThe Supreme Peerless, soaring upon the Nine Origins’ radiance,\ncongealing essence and condensing qi, transforming form and transmuting spirit.\nThe Controller of Life blends and unites, scattering form into myriad parts.\nA thousand chariots of fiery armor, ten thousand riders with fluttering banners,\nall join with the Great One, ascending to become Imperial Immortals.\nBo Wu rises without error, Zhong Cheng bends to the script.\nFirst, unite with my qi; second, unite with my spirit;\nthird, unite with my hun; fourth, unite with my po;\nfifth, unite with my purity; sixth, unite with my form.\nThe sixfold union completes the body, the cavernous rosy clouds reveal the true.\nThe Eight Effulgences’ empty chariot, the Three Simplicities’ floating wheel—\nI and the Imperial One together ascend to the Jade Palace.\nLayered blossoms and branching stems, blending with the Heavenly Immortals.\nThe body holds the Dao’s register, the world has its root of life.\nGolden tablets and feathered talismans, names inscribed upon the Solar Chariot.\nWishes fulfilled, celestial blessings flow abundantly.\nDesires manifest, myriad spirits fill the gate.\nEver abide with the Great One, the Imperial One at the Mud-Pill Palace.\nYin and yang blend, a hundred spirits entwine.\nRecite the scripture ten thousand times, the numinous chariot comes to welcome.\nFeasting with the Five Emperors, the Nine Lords of Sun and Moon,\nattaining immortality as an Upper Clarity Perfected.\nEnvision the departed soul’s form—now complete.\n\nAll recite again:\nThe Dragon Han vast and boundless, formless and nameless,\nstretching across countless eons, the Yellow Dao shines forth.\nSpirits clear and luminous, the Nine Hun emit their essence.\nThe Jade Void gleams, the Great Rosy Clouds rise high.\nThe Primordial begins transformation, all heavens unite as one.\nThe Three Origins’ Dao-qi, the Two Images gather life.\nThose already delivered are delivered, those unformed are formed.\nThe dead are revived, the withered made flourishing.",
      "overlap_context": "celestial qi of the Southern Fire within the Wu character of the noon script,\nswallowed into the cinnabar field, blending with the qi of the heart and small intestine.\n*Silently recite, then exhale with a \"ha\" sound*—one qi, seven repetitions, blown upon the departed soul,\ntransforming and generating the heart and small intestine.\n\nThe High Priest recites silently:\nWithin the Palace of the Heart’s Domain, a lotus holds its bloom,\nbeneath which dwells a youth, the household of the Cinnabar Prime.",
      "start_char": 5668,
      "end_char": 7025,
      "start_sentence": 369,
      "end_sentence": 450,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.57120752334595,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\紫皇炼度玄科.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "蠢动蜎息，一切冥灵。 怀胎含孕，咸得长生。 亡者命过，魂归三清。 魄受炼度，南宫变形。 今日大吉，皆得光明。 五帝鉴映，普告万灵。 天神地祇，及诸河源。 五岳四渎#4； 及诸名山。 洞玄洞虚，洞空洞仙。 无极大圣，至真尊神。 无穷无极，普鉴度生。 地根断绝，玄都纪名。 真普应，一切成听。 高功直念 恭运真香，重伸奏启，三清三宝上帝，五灵五老帝君，童初五府聚魂真君。 伏愿再降五方真炁，三色混沌之炁，灌注亡魂，俾九天之炁生其神，三元之真保其命。 黄白夫至，内外合形，六甲周流，五行交感，法天象地，含阴育阳，合道成真，既尊且贵。 以首为昆仑，发为星辰，眉为华盖，眼为日月，鼻为天柱，为天窗，口为天门，面为天镜。 一元之炁为真神，二元之炁为精光，三元之炁为三宫，四时之炁为四关，五行之炁为五脏，六律之炁为六腑，七星之炁为七窍，八风之炁为八表，九天之炁为九宫。 外炁以符内炁，内神以符外神。 神父祖母，和合元神，元炁相因，五行会聚成炼。 须谢元尊，允符恳祷。 知磬举 五神混合天尊 众诵",
      "translated_text": "All creatures that stir and breathe, every hidden spirit—\nthose carrying embryos, those nurturing life within,\nall attain long life.\nThe departed whose fate has passed, their souls return to the Three Clarities.\nTheir poisons undergo refinement and deliverance,\ntransformed in form at the Southern Palace.\nToday is most auspicious—all attain radiance.\nThe Five Emperors reflect and illuminate, proclaiming universally to the ten thousand spirits:\nheavenly gods and earthly deities,\nall river sources,\nthe Five Marchmounts and Four Waterways,\nand all renowned mountains.\nCaverns of Mystery, Caverns of Void,\nCaverns of Emptiness, Caverns of Immortals—\nthe Boundless Great Sage,\nthe Most Perfect Revered Divinities.\nWithout end or limit, they universally witness and deliver life.\nEarth’s roots are severed, names recorded in the Dark Capital.\nThe True Universal Response—all comply and heed.\n\nThe High Master intones directly:\nReverently offering true incense, we humbly present this petition once more\nto the Three Clarities, the Three Treasures, the Supreme Emperor,\nthe Five Numinous Ones, the Five Venerable Lords,\nand the Lord of Soul-Gathering of the Five Bureaus of Childhood’s Beginning.\nWe pray that the true *qi* of the five directions descend again,\nthe *qi* of the three hues of primordial chaos,\nto pour into the departed soul,\nthat the *qi* of the Nine Heavens may quicken its spirit,\nand the true essence of the Three Origins preserve its fate.\nYellow and white arrive in full,\ninner and outer unite in form.\nThe Six Jia circulate, the Five Phases interact,\nmodeling heaven and earth,\nembracing yin and nurturing yang,\nuniting with the Dao to achieve perfection—\nthus exalted and noble.\nThe head becomes Kunlun,\nhair the stars,\neyebrows the canopied parasol,\neyes the sun and moon,\nnose the Pillar of Heaven,\nears the Heavenly Windows,\nmouth the Heavenly Gate,\nface the Heavenly Mirror.\nThe *qi* of the First Origin becomes the true spirit,\nthe *qi* of the Second Origin becomes luminous essence,\nthe *qi* of the Third Origin becomes the Three Palaces,\nthe *qi* of the four seasons becomes the Four Passes,\nthe *qi* of the Five Phases becomes the Five Viscera,\nthe *qi* of the Six Pitches becomes the Six Bowels,\nthe *qi* of the Seven Stars becomes the Seven Orifices,\nthe *qi* of the Eight Winds becomes the Eight Limits,\nthe *qi* of the Nine Heavens becomes the Nine Palaces.\nOuter *qi* aligns with inner *qi*,\ninner spirits align with outer spirits.\nSpirit-father and spirit-mother,\nharmonizing with the primordial spirit,\nprimordial *qi* mutually engendering,\nthe Five Phases gathering to refine.\nWe must thank the Primordial Revered One,\nwhose assent fulfills our earnest prayers.\n\nThe chime sounds—\nFive Spirits Blending with Heaven Honored One.\n\nAll recite.",
      "overlap_context": "plete.\n\nAll recite again:\nThe Dragon Han vast and boundless, formless and nameless,\nstretching across countless eons, the Yellow Dao shines forth.\nSpirits clear and luminous, the Nine Hun emit their essence.\nThe Jade Void gleams, the Great Rosy Clouds rise high.\nThe Primordial begins transformation, all heavens unite as one.\nThe Three Origins’ Dao-qi, the Two Images gather life.\nThose already delivered are delivered, those unformed are formed.\nThe dead are revived, the withered made flourishing.",
      "start_char": 7025,
      "end_char": 7456,
      "start_sentence": 451,
      "end_sentence": 476,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.984042406082153,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\紫皇炼度玄科.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "千和万合，自然成真，至万炁齐仙。 高功行五府事，默运 功都成卯　切角镇午　兴生转酉 独隶迁子　可韩明玉　功都聚魂摄取巽炁发诀，布亡魂 红杏持列，震　　墨墨捷白。 坎 磨真计力，兑　　袜腊收成。 离 灵宝万物，玉　　清和合通。 玉 正一成法，智益可真，取驿令下摄。 左三指掐大指中节，中天炁发诀，布亡魂 青帝护魂，卯　　白帝侍魄。 酉 赤帝养炁，午　　黑帝通血。 子 黄帝中主，中　　万神无越。 高功握五岳诀，取五方炁，发诀布亡魂 已枯复荣，已灭复生。 得生天上，更禀大灵。 九天之劫，返胎复婴。 秽炁荡灭，身尸更生。 举 解冤释结天尊",
      "translated_text": "A thousand harmonies, ten thousand unions,\nnaturally forming the true;\nwhen the myriad *qi* align, all ascend as immortals.\n\nThe High Priest performs the rites of the Five Palaces,\nsilently circulating the *qi* of the Capital of Merit:\n—*gongdu* completes at *mao*,\nthe Horn’s edge stabilizes at *wu*,\nlife flourishes and turns at *you*,\nthe Lone Standard shifts at *zi*.\n*Kehan* illumines the jade—\nthe Capital of Merit gathers souls and draws in the *qi* of *xun*,\nreleasing the mudra to array the departed spirits.\n\nRed apricots held in rank at *zhen*,\nink-black swiftness at *bai*.\nAt *kan*, the true plan grinds with force;\nat *dui*, socks and wax gather the harvest.\nAt *li*, the Numinous Treasure pervades all things;\nthe jade *qi* harmonizes and unites.\nThe jade Orthodox Unity perfects the Dharma,\nwisdom increases and truth is attained—\nsummon the courier to descend and seize.\n\nThe left three fingers grasp the middle joint of the thumb,\nthe *qi* of the Central Heaven releases the mudra,\narraying the departed spirits:\nthe Azure Emperor guards the hun at *mao*,\nthe White Emperor attends the po at *you*;\nthe Vermilion Emperor nurtures *qi* at *wu*,\nthe Black Emperor circulates blood at *zi*;\nthe Yellow Emperor presides at the center—\nthe myriad spirits do not transgress.\n\nThe High Priest clasps the mudra of the Five Peaks,\ndrawing the *qi* of the Five Directions,\nreleasing the mudra to array the departed spirits:\nwhat was withered revives,\nwhat was extinguished is reborn.\nAttaining birth in the heavens,\nthey receive anew the great numen.\nThrough the kalpas of the Nine Heavens,\nthey return to the womb and become infants again.\nImpure *qi* is swept away,\nthe body’s corpse is renewed.\n\nAll recite:\n*Liberating Grievances, Unbinding Knots Heaven Honored One.*",
      "overlap_context": "ces,\nthe *qi* of the Eight Winds becomes the Eight Limits,\nthe *qi* of the Nine Heavens becomes the Nine Palaces.\nOuter *qi* aligns with inner *qi*,\ninner spirits align with outer spirits.\nSpirit-father and spirit-mother,\nharmonizing with the primordial spirit,\nprimordial *qi* mutually engendering,\nthe Five Phases gathering to refine.\nWe must thank the Primordial Revered One,\nwhose assent fulfills our earnest prayers.\n\nThe chime sounds—\nFive Spirits Blending with Heaven Honored One.\n\nAll recite.",
      "start_char": 7456,
      "end_char": 7748,
      "start_sentence": 477,
      "end_sentence": 500,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.49823260307312,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\紫皇炼度玄科.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "侍职焚解冤符 高功默念青华诰一遍，默告 救苦天尊，紫皇上帝，请为亡魂，解冤释结，三生四负，冤家债主，不为留难。 玉诀青炁布亡魂，默咒 神符告下，解冤释结。 永脱仇雠，执对分别。 衅缘俱尽，不生恶业。 出离寒庭，罪根消灭。 亡灵得全身体，是谓死而复生； 重整衣冠，当悟来而不往。 不以凡间衣服为献，谨用符咒，助化身章，高登道岸。 举 金容玉相天尊 侍职焚化衣符 众诵玉诰，三遍 高功默念 绛章丹衣，飘飘楚楚。 元始符命，佩之轻举。 唵嚩吱□，急急如南方丹天火帝君律。 侍职焚冠带符 高功玉文中天炁布亡魂，想衣冠楚楚，伺候传戒 知磬举 常传真戒天尊",
      "translated_text": "The acolytes burn the talisman for releasing grievances.\nThe High Priest silently recites the *Qinghua Invocation* once, silently invoking\nthe Heavenly Worthy Who Saves from Suffering,\nthe August Emperor of the Purple Empyrean,\nentreating them to release the departed spirits from grievances and untie their knots,\nfrom the three lifetimes and four debts,\nthat creditors and adversaries may no longer obstruct.\nThe jade mudra and azure *qi* array the departed spirits,\nas the silent incantation and divine talisman descend—\ngrievances unbound, knots released.\nForever freed from enmity,\ndistinctions of contention dissolved.\nAll causes of strife extinguished,\nno evil karma arises.\nEmerging from the cold courts of judgment,\nthe roots of transgression vanish.\nThe departed spirit regains wholeness of body,\nthis is called death and yet rebirth;\nrobes and headdress restored,\none awakens to the truth of coming but not returning.\nNot with the garments of the mortal realm are they offered,\nbut with reverent talismans and incantations,\nassisting the transformation of the body’s vestments,\nascending to the lofty shores of the Dao.\n\nAll recite:\n*Heavenly Worthy of Golden Countenance and Jade Form.*\n\nThe acolytes burn the talisman for robes.\nAll chant the *Jade Invocation* three times.\nThe High Priest silently recites:\nCrimson script and cinnabar robes,\nfluttering in graceful elegance.\nThe primordial talismanic command,\nwhen worn, grants effortless ascent.\n*Oṃ vajri* □, swiftly as the Fire Emperor of the Southern Cinnabar Heaven obeys the law.\n\nThe acolytes burn the talisman for headdress and sash.\nThe High Priest arrays the departed spirits with the jade script and *qi* of the Central Heaven,\nenvisioning them in resplendent robes and headdress,\nawaiting the transmission of precepts.\n\nAt the sounding of the chime:\n*Heavenly Worthy Who Perpetually Transmits the True Precepts.*",
      "overlap_context": "sgress.\n\nThe High Priest clasps the mudra of the Five Peaks,\ndrawing the *qi* of the Five Directions,\nreleasing the mudra to array the departed spirits:\nwhat was withered revives,\nwhat was extinguished is reborn.\nAttaining birth in the heavens,\nthey receive anew the great numen.\nThrough the kalpas of the Nine Heavens,\nthey return to the womb and become infants again.\nImpure *qi* is swept away,\nthe body’s corpse is renewed.\n\nAll recite:\n*Liberating Grievances, Unbinding Knots Heaven Honored One.*",
      "start_char": 7748,
      "end_char": 8046,
      "start_sentence": 501,
      "end_sentence": 523,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.620565176010132,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\紫皇炼度玄科.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "道言戒者，止也。 所以止人非心，归於正定，故戒生定。 儒者亦谓，知止而后有定，但三洞诸经，四部秘典，说戒法，种种不同。 惟无上灵宝九真妙戒之旨，天人共仰，幽显咸遵。 无上之上，洞玄之玄，万神之灵，一炁之宝，妙贯三才，戒制六情，数定於阳，故分於九，修而不伪，故名为真。 凡世仰之，以为城廓； 幽显资之，以为梯航； 灵魂受之，以为法药。 然受戒之法，静默为先； 持戒之功，勤拳为上。 法众皈依，同诚赞咏。 知磬举 按人各众和恭敬 夫三#5皈依者，即为皈依道，皈依经，皈依师也。 是故众魂，皆当信礼。 第一皈依无上道宝，举道宝天尊。 第二皈依无上经宝，举经宝天尊。 第三皈依无上师宝，举师宝天尊。 皈依既毕，戒法将传，幽壤豁若春回，冤对涣然永释。 罪花凋落，功果圆成。 法众虔诚，宣传九戒： 第一戒者，克勤忠於君王。 第二戒者，敬让孝养父母。 第三戒者，不杀慈救众生。 第四戒者，不淫正身处物。 第五戒者，不盗推义损己。 第六戒者，不嗔凶怒凌人。 第七戒者，不诈谄贼害善。 第八戒者，不骄傲忽至真。 第九戒者，不二奉戒专一。 如上九戒，乃九天帝君，亲口宣说。 佩奉者，升入九天； 轻慢者，堕入九地。 今对亡灵，依科传受，切宜谛听，终始勿忘。 所有功德符箓，逐一宣示。 表白宣长生符，生天箓 妙戒灵文，黄箓白简，既备敷於妙典，当敬奉于灵文。 夫心之难制，故九戒则可归心於太虚； 形也未超，以二符则可炼形於上境。 亡灵直斯，生生勿忘於戒言，劫劫常存於符券。 澄神物外，尘缘永断於多生； 受质阳间，善果自臻于妙有。 流芳现在，庆及无穷。 少顷发遣，保举登仙。 高功遣将 某司谨召九天普度院、守雄抱雌二大将，本坛主将副将，护道监坛四大元帅，疾速部卫，亡某径诣朱陵火府、南昌上宫。 上帝有敕，风火无停 举 宝华圆满天尊 汝等亡魂某腾光南极，离暗北酆。 礼道、礼经、礼师，一真日皎； 炼形、炼神、炼炁，万妄风清。 兹登寥廓之乡，径达虚无之境，永脱轮转，自在逍遥，辞筵好去，毋忘道恩。 知声举 超凌仙界天尊",
      "translated_text": "The Dao speaks: \"Precepts are restraint.\" They restrain the human mind from wrongdoing, guiding it to true stillness—thus precepts give rise to stillness. The Confucians also say, \"Knowing restraint, one attains stillness.\" Yet among the Three Caverns' scriptures and the Four Divisions' secret texts, the methods of precepts vary widely. Only the sublime and wondrous Nine True Precepts of the Supreme Numinous Treasure command the reverence of heaven and humanity, observed alike by the hidden and the manifest. Supreme above all that is supreme, profound beyond all that is profound, numinous among the ten thousand spirits, precious as the singular *qi*—their marvel pervades the Three Realms, their precepts govern the Six Passions. Their number is fixed by yang, hence divided into nine; cultivated without falsity, they are called \"true.\" The world looks up to them as its fortress; the hidden and manifest rely on them as their bridge; souls receive them as their healing medicine.\n\nThe method of receiving precepts begins with stillness and silence; the practice of upholding them demands utmost diligence. The assembly bows in reverence, joining in sincere praise.\n\nAt the sounding of the chime:\n*Let each in the assembly respond with reverence.*\n\nThe Three Refuges are refuge in the Dao, refuge in the scriptures, and refuge in the masters. Therefore, all souls must believe and pay homage.\n\nFirst, take refuge in the Supreme Treasure of the Dao:\n*Heavenly Worthy of the Treasure of the Dao.*\n\nSecond, take refuge in the Supreme Treasure of the Scriptures:\n*Heavenly Worthy of the Treasure of the Scriptures.*\n\nThird, take refuge in the Supreme Treasure of the Masters:\n*Heavenly Worthy of the Treasure of the Masters.*\n\nWith the Refuges complete, the transmission of precepts begins. The dark netherworld brightens like spring’s return; karmic debts dissolve forever. The flowers of sin wither; merit and fruition come to perfect fulfillment. The assembly, with utmost devotion, proclaims the Nine Precepts:\n\nThe First Precept: Be diligent and loyal to the sovereign.\nThe Second Precept: Honor and humbly serve your parents.\nThe Third Precept: Do not kill; show compassion to all beings.\nThe Fourth Precept: Do not commit sexual misconduct; maintain purity in body and conduct.\nThe Fifth Precept: Do not steal; practice righteousness and self-restraint.\nThe Sixth Precept: Do not harbor anger or bully others.\nThe Seventh Precept: Do not deceive or harm the virtuous.\nThe Eighth Precept: Do not be arrogant or neglect the true.\nThe Ninth Precept: Do not waver; uphold the precepts with single-minded devotion.\n\nThese Nine Precepts were personally proclaimed by the Nine Heavenly Lords. Those who wear and honor them ascend to the Nine Heavens; those who slight them fall into the Nine Hells. Today, in accordance with the rites, they are transmitted to the departed souls. Listen carefully and never forget from beginning to end.\n\nAll talismans of merit are displayed one by one:\nThe *Announcer* presents the *Talisman of Longevity* and the *Register of Ascension to Heaven*.\nThe wondrous precepts and numinous texts, the Yellow Register and White Tablet, having been set forth in the sacred scriptures, are now reverently offered to the spirits.\n\nThe heart is hard to govern—thus the Nine Precepts return it to the Great Void. The form has not yet transcended—thus the two talismans refine it in the celestial realms. Departed souls, never forget these precepts in any lifetime; keep these talismans close through every kalpa. With spirit settled beyond the material world, the dusty bonds of many lives are forever severed. Reborn in the yang realm, the fruits of goodness naturally ripen in wondrous being. Your virtue shines in the present, bringing boundless blessings. Soon, the souls will be dispatched, protected and guided to ascend as immortals.\n\nThe High Priest dispatches the generals:\n*[Such-and-such] Office respectfully summons the Nine Heavens’ Universal Salvation Court, the Two Great Generals Guarding the Male and Embracing the Female, the principal and deputy generals of this altar, the Four Great Marshals protecting the Dao and overseeing the altar—hasten to escort the departed soul of [Name] directly to the Vermilion Numinous Fire Palace and the Southern Prosperity Upper Palace. By the Emperor’s decree, wind and fire shall not delay.*\n\nAll recite:\n*Heavenly Worthy of Perfect Flowering Completion.*\n\nDeparted souls, you now soar toward the Southern Culmen, leaving the darkness of the Northern Feng. Having paid homage to the Dao, the scriptures, and the masters, the sun of singular truth shines bright. Refining form, spirit, and *qi*, the winds of ten thousand illusions are stilled. You ascend to the vast and boundless realm, reaching the realm of emptiness and non-being. Forever freed from the wheel of rebirth, you abide in effortless freedom. Depart now from this feast; do not forget the grace of the Dao.\n\nAt the sounding of the voice:\n*Heavenly Worthy Who Transcends the Immortal Realms.*",
      "overlap_context": "\nThe primordial talismanic command,\nwhen worn, grants effortless ascent.\n*Oṃ vajri* □, swiftly as the Fire Emperor of the Southern Cinnabar Heaven obeys the law.\n\nThe acolytes burn the talisman for headdress and sash.\nThe High Priest arrays the departed spirits with the jade script and *qi* of the Central Heaven,\nenvisioning them in resplendent robes and headdress,\nawaiting the transmission of precepts.\n\nAt the sounding of the chime:\n*Heavenly Worthy Who Perpetually Transmits the True Precepts.*",
      "start_char": 8046,
      "end_char": 8902,
      "start_sentence": 524,
      "end_sentence": 577,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.461043119430542,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\紫皇炼度玄科.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "高功召温帅，发护送牒 辞谢下座，升送毕 高功回坛，都讲举 存神烧香 高功念 香官使者，左右龙虎君，侍香诸灵官。 当令臣向来升坛炼度之所，自然生金液丹碧芝英，百灵众真，交会在此香鼎炉前。 当愿斋坛，系荐众魂，无边滞爽，炼形清净，见性圆明，妙凝水火之真，生化人天之界。 玄恩广彼，善利均沾，十方仙童玉女，接侍兰香，传臣向来所启之诚，速达径诣无上至真三宝，祖师教主玄天紫皇上帝御前。 紫皇炼度玄科竟 #1疑缺字。 #2疑缺字。 #3『羸』 原作『赢』，疑误，据文义改。 #4『渎』 原作『续』，误，据文义改。 #5『三』 原作『二』，误，据文义改。",
      "translated_text": "The High Priest summons Marshal Wen to dispatch the protective escort writ. Having offered thanks, he descends from the dais, and the ascension rites are complete. The High Priest returns to the altar, and the Precentor intones:\n\n*Abide in spirit and offer incense.*\n\nThe High Priest recites:\nIncense Officials and Envoys, Lords of the Left and Right Dragon-Tiger, and all attendant spirit-officials of the incense—may this place where I have just ascended the altar to refine and deliver the departed naturally give rise to golden liquid elixirs, azure mushroom essences, and a hundred numinous perfected beings, all gathered here before this incense burner and brazier.\n\nMay this ritual altar, dedicated to the deliverance of all souls, dissolve all obstructions and lingering attachments. May their forms be refined to purity, their natures perceived with perfect clarity, their true essence of water and fire wondrously congealed, and the realms of humans and heavens be transformed and regenerated.\n\nMay the profound grace extend widely, and the blessings of goodness be equally shared. May the jade maidens and immortal youths of the ten directions, bearing orchid incense, swiftly convey the sincerity of my supplication to the presence of the Supreme Perfect Three Treasures, the Patriarchal Master, and the August Sovereign of the Dark Heaven and Purple Emperor.\n\nThe Purple Emperor’s Rites of Refining and Deliverance are now complete.",
      "overlap_context": "Having paid homage to the Dao, the scriptures, and the masters, the sun of singular truth shines bright. Refining form, spirit, and *qi*, the winds of ten thousand illusions are stilled. You ascend to the vast and boundless realm, reaching the realm of emptiness and non-being. Forever freed from the wheel of rebirth, you abide in effortless freedom. Depart now from this feast; do not forget the grace of the Dao.\n\nAt the sounding of the voice:\n*Heavenly Worthy Who Transcends the Immortal Realms.*",
      "start_char": 8902,
      "end_char": 9194,
      "start_sentence": 578,
      "end_sentence": 592,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.392832279205322,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\紫皇炼度玄科.txt",
        "category": "正统道藏续道藏"
      }
    }
  ]
}