{
  "source_id": "紫阳真人悟真篇拾遗",
  "source_file": "chunked_daozang\\紫阳真人悟真篇拾遗.json",
  "total_chunks": 4,
  "total_original_chars": 3940,
  "total_translated_chars": 23224,
  "total_translation_time": 134.29702401161194,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\玉诀类\\紫阳真人悟真篇拾遗.txt",
    "category": "玉诀类"
  },
  "full_translation": "**Supplementary Writings to the *Awakening to Reality* by the Perfected One of Purple Yang**\n\n**Title:** *Supplementary Writings to the Perfected One of Purple Yang’s Awakening to Reality*\nOne fascicle, compiled by Weng Baoguang of the Southern Song.\nSource text: *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Jade Instructions* Category.\n\n---\n\n**Miscellaneous Verses, Songs, and Chants from the Chan Tradition**\n\nThis [text] is for those who study the Dao yet fail to comprehend the principles of *xing* (nature) and *li* (principle), practicing only the Golden Elixir (*jindan*). If the Way of *xing* and *ming* (life) remains unrefined, the mind’s operation will not be all-pervasive, and self and other will remain divided. How then can one attain ultimate perfection and transcend the Three Realms?\n\nThus the scriptures say: There are ten kinds of immortals, all of whom refine their minds to firmness and purity within the human realm, living for thousands or tens of thousands of years. Yet without cultivating the Samādhi of Right Awakening (*zhengjue sanmei*), when their retribution is exhausted, they return and scatter into the various destinies.\n\nHence Maitreya Bodhisattva’s *Verses on the Diamond Sutra* declares:\n*\"Though you endure for a hundred thousand kalpas,*\n*In the end, you still fall into emptiness and annihilation.\"*\n\nThus this *Awakening to Reality* first entices practitioners with the lifeline of immortality through inner alchemy, then expands their spiritual powers with the wondrous functions of all buddhas, and finally relinquishes their illusory delusions through the awakened nature of *zhenru* (suchness), returning to the ultimate source of quiescent emptiness.\n\n---\n\n**Six Verses on the Ground of Nature**\n\nThe Buddha-nature is neither identical nor distinct;\nA thousand lamps share a single light.\nTo augment it—how could it overflow?\nTo extinguish attachment—yet no harm is done.\nGrasping and rejecting are both errors;\nBurning and drowning—neither obstructs.\nThe dharmas of seeing, hearing, knowing, and perceiving—\nNot one can be fathomed.\n\nHow wondrous! The sublime body pervades the Ganges’ sands,\nThe myriad forms and phenomena—unobstructed, unbarred.\nWhen you awaken to the true Dharma-eye of perfect penetration,\nYou will know the Three Realms reside within your own home.\n\nGazing, you cannot perceive its form;\nYet when called, it responds with alertness.\nDo not say this sound is like an echo in a valley—\nIf there were no valley, what sound would there be?\n\nOne thing encompasses hearing, seeing, knowing, and perceiving,\nVeiling all sense-realms to reveal its mechanism.\nEven this wondrous \"one thing\" is not truly existent—\nOn what, then, do the four depend?\n\nWithout moving a single step, you arrive in the Western Heaven;\nSitting upright, all directions lie before you.\nThe light behind your neck is still an illusion;\nEven if you purchase immortality with a radish, treading on the soles of your feet, you are not yet a transcendent.\n\nSeeking immortality is originally from non-birth;\nFearing annihilation—when has it ever been momentarily extinguished?\nEyes seeing is not as good as ears seeing;\nWords spoken cannot compare to words smelled.\n\n**No Merit or Demerit**\nAll day long, walking—yet never walked.\nAll day long, sitting—yet never sat.\nCultivating goodness does not accumulate merit;\nCommitting evil incurs no transgression.\nIf people of this age have not yet awakened to the mind,\nDo not cling to these words and act in confusion.\nAfter death, you must face King Yama—\nHow can you escape the boiling cauldrons and grinding stones?\n\n**The Three Realms Are Only Mind**\nThe Three Realms are only the wondrous principle of mind;\nThe myriad things are neither this nor that.\nNot one thing is not my mind;\nNot one thing is my self.\n\n**Seeing the Mind in All Things**\nSeeing things, you see the mind;\nWithout things, the mind is not seen.\nWithin the ten minds’ openness or obstruction,\nThe true mind is never obstructed.\nIf discriminating knowledge arises,\nIt becomes inverted perception.\nWhen you can behold phenomena without mind,\nOnly then do you approach the bodhisattva’s visage.\n\n**Perfect Penetration**\nSeeing true emptiness—emptiness is not empty;\nWhere is perfect clarity not perfectly penetrating?\nRoot, dust, mind, and dharma—all are without substance;\nOnly then do you know the wondrous function is one with the Buddha.\n\n**Following It**\nThe myriad conditions surge before you;\nFollow them in motion or stillness, amidst clamor or silence.\nPerfect clarity, concentration, and wisdom remain unstained—\nLike a lotus born from water, the lotus dries itself.\n\n**Jeweled Moon**\nA single wheel of the jeweled moon hangs in the empty sky,\nIts pure radiance illumining all lands without obstruction.\nGather it—it does not congeal; stir it—it does not disperse.\nAdvance—it does not proceed; retreat—it does not withdraw.\nThat is not distant, this is not near;\nOuter is not external, inner is not within.\nSame within difference, different within same—\nTell me, puppet, do you understand?\n\n**Verses on the *Heart Sutra***\nThe aggregates, sense-spheres, roots, dusts, emptiness, and form—\nNot one dharma can be spoken.\nInverted perceptions are exhausted;\nThe quiescent body is naturally cultivated.\n\n**Self and Others, Also Called \"Equalizing Things\"**\nI am not different from others;\nOthers’ minds differ of themselves.\nPeople have close and distant relations;\nI have no self and other.\nWater-dwellers, land-dwellers, fliers—\nAll are equally observed as one body.\nNoble and base, honored and humble—\nHead and feet are the same as myself.\nI am not even existent—\nHow could there be a \"you\"?\nWhen self and other both vanish,\nAll bubbles return to water.\n\n---\n\n**Reading the *Ancestral Teachings Collection* of Chan Master Xuedou**\n\nA single drop from Caoxi divides into a thousand streams;\nIlluminating the ancient, it clarifies the present without obstruction.\nYet recent scholars do not fathom the source,\nMistaking a hoofprint’s puddle for the great ocean.\n\nMaster Xuedou of Snowy Peak grasped the true essence,\nStriking the Dharma-drum with thunderous roars.\nThe lion-king emerges from its den with a mighty roar—\nA hundred beasts and a thousand demons all tremble in fear.\n\nSometimes in song, sometimes in verse,\nHe earnestly points out the path for the deluded.\nHis words are bold, his meaning profound,\nStriking jade and ringing gold—echoing through the ages.\n\nAlas! The deluded chase after conditions,\nClinging to words and appearances, seeking names and numbers.\nThe true suchness and real mark are originally wordless,\nWithout high or low, without edges or bounds.\nNeither form nor emptiness, nor a dual body—\nThe ten directions’ dusty lands are a single wheel of perfection.\n\nWhat division is there in true concentration between speech and silence?\nIt cannot be grasped, nor can it be abandoned.\nSimply not dwelling on any phenomena—\nThis is the true rule of the Tathāgata.\n\nTo dispel the myriad forms, pair them with the real;\nIf delusion does not arise, the real is not obscured.\nOnly when both real and delusion are negated\nDo you attain the true mind without obstruction.\n\nWithout obstruction, you gain freedom;\nA single awakening instantly dissolves eons of transgressions.\nWithout exerting effort, you realize bodhi—\nFrom this, you forever depart the sea of birth and death.\n\nMy teacher’s Dao is lofty, his words fluent,\nLeft in the world as a model.\nLast night, I summoned him,\nPierced his nostrils with a staff,\nAnd asked him, \"What is the foremost truth?\"\nHe replied, \"Any words spoken are all slander.\"\n\n---\n\n**Precepts, Concentration, and Wisdom**\n\nPrecepts (*jie*), concentration (*ding*), and wisdom (*hui*) are the wondrous functions within the Dharma. Though buddhas and ancestors have spoken of them, those who have not yet realized their meaning still cling. Here, I briefly expound them to aid awakening.\n\nWhen mind and environment are both forgotten, and a single thought does not move—this is *precepts*.\nWhen the awakened nature is perfectly luminous, and inner and outer are crystal-clear—this is *concentration*.\n\n**Wisdom**\n\nResponding to conditions with boundless marvelous function—this is *wisdom*.\nThese three—precepts, concentration, and wisdom—mutually support and complete one another, each serving as both substance and function.\nWhen *precepts* are the substance, then *concentration* and *wisdom* are its function.\nWhen *concentration* is the substance, then *precepts* and *wisdom* are its function.\nWhen *wisdom* is the substance, then *precepts* and *concentration* are its function.\nThe three never part for even an instant.\nLike the sun, which relies on light to illumine, and light, which relies on illumination to shine—\nwithout light, there can be no illumination; without illumination, there can be no shining.\nYet precepts, concentration, and wisdom all arise from a single nature,\njust as light and illumination arise from a single sun.\nIf even the one is not truly one, how can the three be three?\nWhen both three and one are forgotten, clarity and purity abide.\n\n**The Mind Is Buddha**\n\nThe Buddha is the mind, the mind is the Buddha—\nmind and Buddha have always been empty illusions.\nOnly when you know there is no Buddha and no mind\ndo you encounter the true Dharma-body Buddha.\n\nThe Dharma-body Buddha has no form,\na single sphere of radiance containing all images.\nThe formless form is the true form,\nthe imageless image is the true image.\nNeither form nor emptiness, yet not non-emptiness,\nneither moving nor still, neither coming nor going,\nneither different nor identical, neither existent nor non-existent,\ndifficult to grasp, difficult to abandon, difficult to hear or see.\nWithin and without, perfect clarity pervades everywhere—\na single Buddha-land in a grain of sand,\na single grain of sand containing a great chiliocosm,\none body and mind in ten thousand identical forms.\nTo know this, you must realize the Dharma is without mind,\nuntainted and unobstructed—this is pure karma.\nThough good and evil arise in a thousand forms, take no action,\nand you are Namu and Mahākāśyapa.\n\n**Song of the Pearl**\n\nA treasure pearl lies within your robe,\nnaturally perfect and luminous.\nNot knowing to seek it yourself,\nyou count the treasures of others.\n\nCounting others’ treasures brings no benefit,\nonly teaching you to waste your strength.\nHow much better to recognize your own jewel,\nwhose value equals gold beyond measure.\n\nThis pearl’s light is supreme,\nilluminating the three-thousandfold great chiliocosm.\nNever has it diminished in the slightest,\nyet floating clouds obscure it.\n\nSince recognizing this cintāmaṇi,\nwho still clings to bubbles and empty flowers?\nThe Buddha’s pearl and my pearl are the same—\nmy nature returns to the Buddha-nature sea.\n\nPearl is not pearl, sea is not sea,\nthe vast expanse of mind embraces all worlds.\nThough dust and clamor fill your eyes,\nconcentration and wisdom remain perfectly clear.\n\nNeither emptiness nor form,\nwithin and without, luminous as a flawless jade.\nThe six supernormal powers manifest boundless wonders,\nself-benefit and benefiting others reach their utmost.\n\nSeeing is completion, all matters end.\nWithout study, without action, the day is spent.\nFearful as an unborn infant,\nmovement and stillness follow conditions without fixation.\n\nNeither severing delusion nor severing truth—\nthe minds of truth and delusion are both dust.\nAll dharmas have always been without form;\nwithin the formless, the Dharma-body abides.\nThe Dharma-body is the natural, true Buddha,\nneither human nor thing.\nVast and boundless, filling the world,\nit is only the subtle and indistinct.\n\nDust does not stain, light shines of itself.\nNo dharma arises that is not born of the mind.\nIf the mind does not arise, dharmas vanish of themselves—\nthen you know that sin and blessing have no inherent form.\n\nNo Buddha to cultivate, no Dharma to expound.\nThe wise discernment of a true person arises naturally.\nWords spoken become the roar of a lion,\nnot like the wild ox debating birth and death.\n\n**Song of Pointing Out Delusion in Chan Concentration**\n\nThe Tathāgata’s Chan nature is like water—\nwhen the body is still, wind and waves cease of themselves.\nIn movement and rest, profound and ever-clear,\nnot only when sitting is this so.\n\nPeople today seek realization through silent sitting,\nnot knowing it depends entirely on seeing nature.\nIf nature is clear within seeing,\nseeing settles of itself within nature.\nWhen concentration is perfected, wisdom’s function is boundless—\nthis is called the buddhas’ supernormal powers.\nIf you wish to investigate its substance and function,\nyou see only the emptiness of the ten directions.\n\nWithin emptiness, nothing exists,\nnot even the subtle or indistinct.\nIf you seek the subtle and indistinct,\nyou err and lose the way.\nYet these two words—erring and losing—\ncannot be grasped as evidence.\nEven emptiness is like space,\nhow could there be gain or loss, subject or object?\n\nSimply cast aside all dharmas,\nleaving nothing remaining.\nSuddenly, perfect clarity manifests of itself—\nthen you are no different from the buddhas.\n\nThe physical body is my post and thatch,\nso I blend with the world and harmonize with custom.\nIn all actions, without mind,\nwhy dispute right and wrong, honor and disgrace?\n\nThis born body is but a temporary abode,\nthe host of the inn is called Vairocana.\nVairocana neither comes nor goes—\nthen you know birth and death leave no trace.\n\nIf asked what Vairocana is,\nit is only that which is not form.\nBefore your eyes, every leaf and speck of dust—\nneither same nor different, neither close nor distant.\nWithin each speck of dust and every leaf,\neach is Śākyamuni and Mahākāśyapa.\nIf different, the ten thousand sounds all resound;\nif the same, a single wind gathers all.\n\nIf you wish to recognize the cintāmaṇi,\ndo not say you must attain the Dharma to know.\nWhen sick, use medicine to heal;\nonce healed, what need is there for medicine?\n\nWhen the mind is deluded, rely on the Dharma to illuminate;\nwhen the mind is awakened, the Dharma is no longer needed.\nLike a tarnished mirror polished—\nblemishes and dust vanish of themselves.\n\nAll mind and dharmas are delusion,\nso I teach you to leave all forms behind.\nWhen all forms are left behind, what remains?\nThis is called the supreme, true reality.\n\nIf you wish to adorn the Buddha-land,\npractice equality, compassion, and relief of suffering.\nThe bodhisattva’s original vow must be profound—\ndo not grasp at appearances.\n\nThis is called the perfect union of merit and wisdom;\nin the future, you will receive prediction together.\nIf even a speck of dust stains you,\nyou will have no affinity with the buddhas.\n\nTurning the thought, ordinary beings are deluded and attached,\nall stained by the habits of love and desire.\nOnly because of excessive craving and clinging\ndo they constantly dwell in womb, egg, transformation, and moisture births.\n\nTo learn the Way, you must be fierce and resolute,\nyour heart of non-emotion hard as iron.\nEven toward father, mother, wife, and children,\nhow are they different from others?\n\nAlways guard a single sphere of radiance,\nseeing no desires to contemplate.\nAll dharmas are unattached at once—\nwhat need to speak of hell and heaven?\n\nThen my life is in my own hands,\nin emptiness, neither ascending nor descending.\nAppearing and disappearing in the buddhas’ lands,\nI never leave the original seat of bodhi.\n\nGuanyin’s thirty-two manifestations—\nmy learning too is verified through them.\nTransformations beyond all conception,\nall arise from the nature of carefree ease.\n\nI am a Chan practitioner of no-mind,\nindiscriminate in all matters.\nOnce a black ox,\nnow wholly white.\nSometimes I sing, sometimes I laugh—\nothers say I lack sense,\nbut how would they know\nthat beneath this coarse robe\nlies a priceless treasure?\n\nShould they see me speak of emptiness,\nthey swallow the jujube whole.\nThis Dharma only buddhas can know—\nhow could the foolish and dull grasp its outward signs?\n\nThen there are those esteemed Chan practitioners\nwho only learn to match lips and contend with words.\nThey boast of my quick replies,\nyet fundamentally fail to recognize the host.\n\nThey merely pluck branches and gather leaves,\nunable to fathom and investigate the root.\nWith the root attained, branches and leaves flourish;\nwithout the root, branches and leaves cannot endure.\n\nThough they flaunt their grasp of the luminous pearl,\nthey remain entangled in self and other.\nFar removed from the wondrous source of awakening,\nseparated by a thousand miles.\n\nSuch people are pitiable and laughable—\nvainly claiming years of Dao-learning,\ntoo proud to seek guidance,\nwasting their lives in futility.\nThey are dull and deluded roots,\nburdened by heavy karmic wrong views.\nIf they fail to awaken in this life,\nhow will they escape sinking in the next?\n\n*Verse of No-Mind*\nLaughable, my heart—\nstubborn and coarse,\ndull and drifting,\nletting things rest as they are.\n\nI neither cultivate practice\nnor commit offenses,\nneither benefit others\nnor profit myself.\n\nI do not uphold precepts,\nnor observe taboos,\nknow not rites or music,\nnor practice benevolence or righteousness.\nAsk what I can do—\nnot a single thing.\n\nHungry, I eat;\nthirsty, I drink.\nWeary, I sleep;\nawake, I walk.\nHot, I wear light clothes;\ncold, I cover myself.\n\nNo thoughts, no worries—\nwhat sorrow, what joy?\nNo regret, no scheming,\nno念, no intent.\nLife and death, honor and disgrace—\nbut a traveller’s inn.\n\nTrees and nesting crows—\nwhat comparison can be made?\nComing, I do not forbid;\ngoing, I do not stop.\nI neither avoid nor seek,\nneither praise nor blame.\nI do not shun the ugly,\nnor covet the good and beautiful.\n\nI neither dwell in quiet chambers\nnor shun bustling markets.\nI eat when meat is served,\ndrink when wine is offered.\nI do not speak ill of others,\nnor boast of my own rightness.\nI neither favor the noble\nnor slight the lowly and young.\nLoved ones and enemies,\ngreat and small, inner and outer—\nall are met with equanimity,\nwhether in gain or loss, respect or insult.\nMy heart holds no dual views,\ntreading a single, unobstructed path.\n\nI neither initiate blessings\nnor begin misfortunes.\nI respond only when moved,\nrise only when pressed.\nUnafraid of blades,\nhow could I fear tigers or rhinos?\n\nI follow things in their naming,\nunbound by fixed designations.\nEyes do not pursue forms,\nsounds do not enter ears.\nAll appearances are but delusion.\nMale and female, form and voice—\nnone are fixed entities.\nForms and appearances are without mind,\nuntainted and unloved.\nAt ease and carefree,\nnothing can burden me.\n\nThe radiance of wondrous awakening shines through,\nilluminating inner and outer.\nIt encompasses the six directions,\nwithout near or far.\n\nLight yet not light—\nlike the moon in water.\nHard to grasp or relinquish,\nwhat comparison can be made?\n\nUnderstanding this wondrous function,\none transcends all bounds.\nShould one ask of my宗,\nit is just this.\n\n*Twelve Western River Moon Lyrics*\n\nDeluded thoughts need not be forcibly extinguished;\nthe real—why seek it?\nThe original source and self-nature are equally cultivated as buddha.\nDoes enlightenment or delusion depend on sequence?\n\nAwakened, one becomes buddha in an instant;\ndeluded, one drifts for ten thousand kalpas.\nIf one can align a single念 with true cultivation,\ncountless karmic stains are wiped away.\n\nOriginally without birth or extinction,\nyet forcibly divided into birth and extinction.\nHow can sin and blessing have roots?\nThe wondrous essence has never increased or diminished.\n\nI possess a luminous mirror,\nlong obscured by dust.\nToday, polished and bright, it illumines heaven and earth—\nall phenomena stand revealed, beyond concealment.\n\nMy nature enters the nature of all buddhas;\nthe buddha-nature in every realm is thus.\nThe moon’s clear reflection shines on cold springs—\none moon appears in a thousand pools.\n\nSmall—beyond the minutest fraction;\nvast—pervading the three thousand worlds.\nHigh and low, unconstrained, naturally round.\nWhat need to speak of short or long, deep or shallow?\n\nDharmas, dharmas—fundamentally no dharma;\nemptiness, emptiness—yet not empty.\nStillness, speech, silence—originally the same.\nIn dreams, who ever spoke of dreams?\n\nUse within use—no use;\neffort within effort—bestowing effort.\nLike fruit ripening naturally red,\nask not how it was cultivated or planted.\n\nGood and evil—fleeting deluded念;\nglory and decay—unrelated to the heart.\nDarkness and brightness, concealment and display—\nlet them drift as they will.\nEat when hungry, drink when thirsty.\n\nThe spirit, serene and ever still,\ndoes not hinder singing or chanting outside.\nA pool of autumn water, deep and clear—\nwind stirs, fish startle—let them be.\n\nBefore the mirror, no need to forcibly extinguish;\nprovisional names are but expedient bodhi.\nForm and emptiness, brightness and darkness—originally equal.\nTrue and deluded—two distinct bodies.\n\nAwakened, it is called the Pure Land;\nno need for India or Caoxi.\nWho says the Land of Ultimate Bliss lies in the western heavens?\nAwakened, Amitābha manifests.\n\nSelf, others, sentient beings, lifespan—\nwhy distinguish high and low?\nThe dharmakāya illumines all,\nwithout you or I.\nEach念 discerns sameness and difference.\n\nSeeing—when was it ever truly so?\nHearing—what is not necessarily so?\nComing and going, all functions—unknown to one another.\nWho can hinder your birth and death?\n\nAbiding in念, cultivating practice, giving—\ntheir fruition does not transcend gods and humans.\nLike shooting an arrow upward at floating clouds,\nit falls only when its force is spent.\n\nHow much better the true mark of non-action—\nreturn to simplicity, restore purity.\nForget circumstances, let nature follow its course,\nto realize the patience of the unborn.\n\nIf fish and rabbit come to hand,\none naturally forgets the trap and snare.\nThe raft for crossing the river,\nthe ladder for ascending the sky—\nonce arrived, all are discarded.\n\nBefore awakening, one relies on words;\nawakened, words are all false.\nThough the four phrases belong to non-action,\nwhy need they be cast aside?\n\nAwakened, do not seek extinction;\nfollow conditions to guide the deluded.\nIn ordinary dealings, correct wrong views and lead others—\nexpediently point to the real.\n\nThe five eyes and three bodies, the four wisdoms,\nthe six perfections and ten thousand practices—all cultivated in harmony.\nA single orb of perfect radiance, a flawless mani jewel,\nbenefiting others while benefiting oneself.\n\nI see people of this age speak of nature,\nboasting hastily to match the moment.\nYet when they encounter circumstances, they turn deluded—\nhow do they differ from the foolish?\n\nTo speak is to act accordingly;\nonly then is speech and conduct without flaw.\nWield the sword of wisdom to sever demonic illusions—\nthis is called the Tathāgata’s true wisdom.\n\nTo comprehend the wondrous Dao of the unborn,\nnothing surpasses seeing one’s true mind.\nThe true mind is without form, without sound—\nonly the pure Dharma-body remains.\n\nThis Dao is neither outside nor within,\nnor is it to be sought in the middle.\nCast aside both extremes, abandon the center—\nseeing thus is called the highest rank.\n\n*Postscript to the \"Awakening to Reality\" of the Perfected One of Purple Yang*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "紫阳真人悟真篇拾遗 经名：紫阳真人悟真篇拾遗。 一卷，南宋翁葆光述。 底本出处：《正统道藏》洞真部玉诀类。 紫阳真人悟真篇拾遗 禅宗歌颂诗曲杂言 此恐学道之人，不通性理，独修金丹，如此既性命之道未修，则运心不普，物我离齐，又焉能究竟圆通，迥超三界。 故经云：有十种仙，皆於人中炼心坚固精粹，寿千万岁。 若不修正觉三昧，则报尽还来，散入诸趣。 是以弥勒菩萨《金刚经颂》云：饶君百万劫，终是落空亡。 故此《悟真篇》者，先以神仙命脉诱其修炼，次以诸佛妙用广其神通，终以真如觉性遗其幻妄，而归於究竟空寂之本源矣。 性地颂六首 佛性非同异，千灯共一光。 增之宁解溢，灭着且无伤。 取舍俱为过，焚漂总不妨。 见闻知觉法，无一可猜量。 如何妙体遍河沙，万象森罗无障遮。 会得圆通真法眼，始知三界在吾家。 视之不可见其形，及至呼时却又警。 莫道此声如谷响，若还无谷有何声。 一物含闻见觉知，盖诸尘境显其机。 灵常一物尚非有，四者凭何作所依。 不移一步到西天，端坐诸方在目前。 项后有光犹是幻，蕾买生．足底未为仙。 求仙本自无生，畏灭何曾暂灭。 眼见不如耳见，口说争如鼻说。 无罪福 终日行，不曾行。 终日坐，何曾坐。 修善不成功德，造恶元无罪过。 时人若未明心，莫执比言乱做，死后须见阎王，难免擭汤确磨。 三界唯心 三界唯心妙理，万物非此非彼，无一物非我心，无一物是我己。 见物便见心 见物便见心，无物心不见。 十心通塞中，真心无不便。 若生知识解，却成颠倒见。 睹境能无心，始却菩萨面。 圆通 见了真空空不空，圆明何处不圆通。 根尘心法都无物，妙用方知与佛同。 随他 万境纵横在目前，随他动静任哗灌。 圆明定慧终无染，似水生莲莲自乾。 宝月 一轮宝月当虚空，万国清辉无障碍。 收之不聚拨不开，前之不进后不退。 彼非远兮此非近，表非外兮裹非内。 同中有异异中同，问你傀儡会不会。 心经颂 蕴缔根尘空色，都无一法堪言。 颠倒之见已尽，寂静之体修然。 人我又名齐物 我不异人，人心自异。 人有亲疏，我无彼此。 水陆飞行，等观一体。 贵贱尊卑，首足同己。 我尚非有，何尝有你。 彼此俱无，众泡归水。 读雪窦禅师祖英集 曹溪一滴分千派，昭一古澄今无滞碍。 近来学者不穷源，妄指蹄涔为大海。 雪窦老师达真趣，大震雷音槌法鼓。 狮王哮吼出窟来，百兽千邪皆恐惧。 或歌诗，或语句，叮咛指引迷人路。 言词磊落义高深，击玉敲金响千古。 争奈迷人逐境流，却将言相寻名数。 真如实相本无言，无下无高无有边，非色非空非二体，十方尘剎一轮圆。 正定何曾分语默，取不得兮舍不得，但於诸相不留心，即是如来真轨则。 为除万相将真对，妄若不生真尔晦，能到真妄两俱非，方得真心无坚碍。 无坚碍兮能自在，一悟顿消穷劫罪，不施功力证菩提，从此永离生死海。 吾师道高言语畅，留在世问为榜样，昨宵被我唤将来，把鼻孔穿於杖上，问他第一义如何，却道有言皆是谤。 戒定葱解 夫戒、定、慧者，乃法中之妙用也。 佛祖虽尝有言，而未达者犹有所执，今略而言之，庶资开悟。 然其心境两忘，一念不动，曰戒。 觉性圆明，内外莹彻，日定。",
      "translated_text": "**Supplementary Writings to the *Awakening to Reality* by the Perfected One of Purple Yang**\n\n**Title:** *Supplementary Writings to the Perfected One of Purple Yang’s Awakening to Reality*\nOne fascicle, compiled by Weng Baoguang of the Southern Song.\nSource text: *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Jade Instructions* Category.\n\n---\n\n**Miscellaneous Verses, Songs, and Chants from the Chan Tradition**\n\nThis [text] is for those who study the Dao yet fail to comprehend the principles of *xing* (nature) and *li* (principle), practicing only the Golden Elixir (*jindan*). If the Way of *xing* and *ming* (life) remains unrefined, the mind’s operation will not be all-pervasive, and self and other will remain divided. How then can one attain ultimate perfection and transcend the Three Realms?\n\nThus the scriptures say: There are ten kinds of immortals, all of whom refine their minds to firmness and purity within the human realm, living for thousands or tens of thousands of years. Yet without cultivating the Samādhi of Right Awakening (*zhengjue sanmei*), when their retribution is exhausted, they return and scatter into the various destinies.\n\nHence Maitreya Bodhisattva’s *Verses on the Diamond Sutra* declares:\n*\"Though you endure for a hundred thousand kalpas,*\n*In the end, you still fall into emptiness and annihilation.\"*\n\nThus this *Awakening to Reality* first entices practitioners with the lifeline of immortality through inner alchemy, then expands their spiritual powers with the wondrous functions of all buddhas, and finally relinquishes their illusory delusions through the awakened nature of *zhenru* (suchness), returning to the ultimate source of quiescent emptiness.\n\n---\n\n**Six Verses on the Ground of Nature**\n\nThe Buddha-nature is neither identical nor distinct;\nA thousand lamps share a single light.\nTo augment it—how could it overflow?\nTo extinguish attachment—yet no harm is done.\nGrasping and rejecting are both errors;\nBurning and drowning—neither obstructs.\nThe dharmas of seeing, hearing, knowing, and perceiving—\nNot one can be fathomed.\n\nHow wondrous! The sublime body pervades the Ganges’ sands,\nThe myriad forms and phenomena—unobstructed, unbarred.\nWhen you awaken to the true Dharma-eye of perfect penetration,\nYou will know the Three Realms reside within your own home.\n\nGazing, you cannot perceive its form;\nYet when called, it responds with alertness.\nDo not say this sound is like an echo in a valley—\nIf there were no valley, what sound would there be?\n\nOne thing encompasses hearing, seeing, knowing, and perceiving,\nVeiling all sense-realms to reveal its mechanism.\nEven this wondrous \"one thing\" is not truly existent—\nOn what, then, do the four depend?\n\nWithout moving a single step, you arrive in the Western Heaven;\nSitting upright, all directions lie before you.\nThe light behind your neck is still an illusion;\nEven if you purchase immortality with a radish, treading on the soles of your feet, you are not yet a transcendent.\n\nSeeking immortality is originally from non-birth;\nFearing annihilation—when has it ever been momentarily extinguished?\nEyes seeing is not as good as ears seeing;\nWords spoken cannot compare to words smelled.\n\n**No Merit or Demerit**\nAll day long, walking—yet never walked.\nAll day long, sitting—yet never sat.\nCultivating goodness does not accumulate merit;\nCommitting evil incurs no transgression.\nIf people of this age have not yet awakened to the mind,\nDo not cling to these words and act in confusion.\nAfter death, you must face King Yama—\nHow can you escape the boiling cauldrons and grinding stones?\n\n**The Three Realms Are Only Mind**\nThe Three Realms are only the wondrous principle of mind;\nThe myriad things are neither this nor that.\nNot one thing is not my mind;\nNot one thing is my self.\n\n**Seeing the Mind in All Things**\nSeeing things, you see the mind;\nWithout things, the mind is not seen.\nWithin the ten minds’ openness or obstruction,\nThe true mind is never obstructed.\nIf discriminating knowledge arises,\nIt becomes inverted perception.\nWhen you can behold phenomena without mind,\nOnly then do you approach the bodhisattva’s visage.\n\n**Perfect Penetration**\nSeeing true emptiness—emptiness is not empty;\nWhere is perfect clarity not perfectly penetrating?\nRoot, dust, mind, and dharma—all are without substance;\nOnly then do you know the wondrous function is one with the Buddha.\n\n**Following It**\nThe myriad conditions surge before you;\nFollow them in motion or stillness, amidst clamor or silence.\nPerfect clarity, concentration, and wisdom remain unstained—\nLike a lotus born from water, the lotus dries itself.\n\n**Jeweled Moon**\nA single wheel of the jeweled moon hangs in the empty sky,\nIts pure radiance illumining all lands without obstruction.\nGather it—it does not congeal; stir it—it does not disperse.\nAdvance—it does not proceed; retreat—it does not withdraw.\nThat is not distant, this is not near;\nOuter is not external, inner is not within.\nSame within difference, different within same—\nTell me, puppet, do you understand?\n\n**Verses on the *Heart Sutra***\nThe aggregates, sense-spheres, roots, dusts, emptiness, and form—\nNot one dharma can be spoken.\nInverted perceptions are exhausted;\nThe quiescent body is naturally cultivated.\n\n**Self and Others, Also Called \"Equalizing Things\"**\nI am not different from others;\nOthers’ minds differ of themselves.\nPeople have close and distant relations;\nI have no self and other.\nWater-dwellers, land-dwellers, fliers—\nAll are equally observed as one body.\nNoble and base, honored and humble—\nHead and feet are the same as myself.\nI am not even existent—\nHow could there be a \"you\"?\nWhen self and other both vanish,\nAll bubbles return to water.\n\n---\n\n**Reading the *Ancestral Teachings Collection* of Chan Master Xuedou**\n\nA single drop from Caoxi divides into a thousand streams;\nIlluminating the ancient, it clarifies the present without obstruction.\nYet recent scholars do not fathom the source,\nMistaking a hoofprint’s puddle for the great ocean.\n\nMaster Xuedou of Snowy Peak grasped the true essence,\nStriking the Dharma-drum with thunderous roars.\nThe lion-king emerges from its den with a mighty roar—\nA hundred beasts and a thousand demons all tremble in fear.\n\nSometimes in song, sometimes in verse,\nHe earnestly points out the path for the deluded.\nHis words are bold, his meaning profound,\nStriking jade and ringing gold—echoing through the ages.\n\nAlas! The deluded chase after conditions,\nClinging to words and appearances, seeking names and numbers.\nThe true suchness and real mark are originally wordless,\nWithout high or low, without edges or bounds.\nNeither form nor emptiness, nor a dual body—\nThe ten directions’ dusty lands are a single wheel of perfection.\n\nWhat division is there in true concentration between speech and silence?\nIt cannot be grasped, nor can it be abandoned.\nSimply not dwelling on any phenomena—\nThis is the true rule of the Tathāgata.\n\nTo dispel the myriad forms, pair them with the real;\nIf delusion does not arise, the real is not obscured.\nOnly when both real and delusion are negated\nDo you attain the true mind without obstruction.\n\nWithout obstruction, you gain freedom;\nA single awakening instantly dissolves eons of transgressions.\nWithout exerting effort, you realize bodhi—\nFrom this, you forever depart the sea of birth and death.\n\nMy teacher’s Dao is lofty, his words fluent,\nLeft in the world as a model.\nLast night, I summoned him,\nPierced his nostrils with a staff,\nAnd asked him, \"What is the foremost truth?\"\nHe replied, \"Any words spoken are all slander.\"\n\n---\n\n**Precepts, Concentration, and Wisdom**\n\nPrecepts (*jie*), concentration (*ding*), and wisdom (*hui*) are the wondrous functions within the Dharma. Though buddhas and ancestors have spoken of them, those who have not yet realized their meaning still cling. Here, I briefly expound them to aid awakening.\n\nWhen mind and environment are both forgotten, and a single thought does not move—this is *precepts*.\nWhen the awakened nature is perfectly luminous, and inner and outer are crystal-clear—this is *concentration*.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1295,
      "start_sentence": 0,
      "end_sentence": 76,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.866650342941284,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\紫阳真人悟真篇拾遗.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "随绿应物，妙用无穷，曰慧。 此三者相须而成，互为体用。 或戒之为体者，则定、慧为其用。 定为体者，则戒、慧为其用。 慧之为体者，则戒、定为其用。 三者未尝斯须相离也。 犹如日假光而能照，光假照而能明。 非光则不能照，非照则不能明。 原其戒、定、慧者，本乎一性。 光明照者，本乎一日。 一尚非一，三复何三。 三一俱忘，湛然清诤。 即心是佛颂 佛即心兮心即佛，心佛从来皆妄物，若知无佛亦无心，始是真如法身佛。 法身佛，没模样，一颗圆光含万象，无体之体即真体，无相之相即实相。 非色非空非不空，不动不静不来往，无异无同无有无，难取难舍难听望，内外圆明到处通，一佛国在一沙中，一粒沙含大千界，一个身心万个同，知之须会法无心，不染不滞为净业，善恶千端无所为，便是南无及迦叶。 采珠歌 宝子衣中珠，本自圆明好，不会自寻求，却数他人宝。 数他宝，终无益，只是教君空费力，争如认取自家珍，价直黄金千万亿。 此宝珠，光最大，褊照三千大千界，从来不解少分毫，刚被浮云为障碍。 自从认得此摩尼，泡体空花谁更爱，佛珠还与我珠同，我性即归佛性海。 珠非珠，海非海，坦然心量包沙界，任你尘嚣满眼前，定慧圆明常自在。 不是空，不是色，内外皎然如壅塞，六通神用妙无穷，自利利他还解极。 见即了，万事毕，绝学无为度终日，怕兮如未兆婴儿，动止随绿无固必。 不断妄，不断真，真妄之心总属尘，从来万法皆无相，无相之中有法身，法身即是天真佛，亦非人兮亦非 物，浩然充塞天地问，只是希夷并恍惚。 垢不染，光自明，无法不从心裹生，心若不生法自灭，即知罪福本无形。 无佛修，无法说，丈夫智见自然别，出言便作狮子呜，不似野牛论生灭。 禅定指迷歌 如来禅性如水，体静风波自止，兴居湛湛常清，不独坐时方是。 今人静坐取证，不道全在见性，性於见裹若明，见向性中自定，定成慧用无穷，是名诸佛神通，几欲究其体用，但见十方虚空。 空中杳无一物，亦无希夷恍惚。 希恍既不可寻，寻之却成乖失。 只此乖失两字，不可执为凭据。 本空尚乃如空，岂有得失能所。 但将万法遣除，遣令净尽无余，豁然圆明自现，便与诸佛无殊。 色身为我栓桔，且怠和光混俗，举动一切无心，争甚是非荣辱。 生身只是寄居，逆旅主号毗卢，毗卢不来不去，乃知生灭无余。 或问毗卢何以，只为有相不是，眼前叶叶尘尘，非同非异非亲，昆此尘尘叶叶，个个释迦迦叶，异则万籁皆呜，同则一风都摄，若要认得摩尼，莫道得法方知。 有病用他药疗，病痊药更何施。 心迷须假法照，心悟法更不要。 又如昏镜得磨，痕垢自然灭了。 本为心法皆妄，故令离尽诸相，诸相离了如何，是名至真无上。 若欲庄严佛土，平等行慈救苦，菩提本愿须深，切莫相中有取。 此名福慧双圆，当来授记俱先，倘若纤尘有染，却於诸佛无缘。 翻念凡夫迷执，尽被情爱染习，只为贪着情多，常在胎卵化湿。 学道须教猛烈，无情心刚似铁，直饶父母妻儿，又与他人何别。 常守一颗圆光，不见可欲思量，万法一时无着，说甚地狱天堂。 然后我命在我，空中无升无堕，出没诸佛土中，不离菩提本坐。",
      "translated_text": "**Wisdom**\n\nResponding to conditions with boundless marvelous function—this is *wisdom*.\nThese three—precepts, concentration, and wisdom—mutually support and complete one another, each serving as both substance and function.\nWhen *precepts* are the substance, then *concentration* and *wisdom* are its function.\nWhen *concentration* is the substance, then *precepts* and *wisdom* are its function.\nWhen *wisdom* is the substance, then *precepts* and *concentration* are its function.\nThe three never part for even an instant.\nLike the sun, which relies on light to illumine, and light, which relies on illumination to shine—\nwithout light, there can be no illumination; without illumination, there can be no shining.\nYet precepts, concentration, and wisdom all arise from a single nature,\njust as light and illumination arise from a single sun.\nIf even the one is not truly one, how can the three be three?\nWhen both three and one are forgotten, clarity and purity abide.\n\n**The Mind Is Buddha**\n\nThe Buddha is the mind, the mind is the Buddha—\nmind and Buddha have always been empty illusions.\nOnly when you know there is no Buddha and no mind\ndo you encounter the true Dharma-body Buddha.\n\nThe Dharma-body Buddha has no form,\na single sphere of radiance containing all images.\nThe formless form is the true form,\nthe imageless image is the true image.\nNeither form nor emptiness, yet not non-emptiness,\nneither moving nor still, neither coming nor going,\nneither different nor identical, neither existent nor non-existent,\ndifficult to grasp, difficult to abandon, difficult to hear or see.\nWithin and without, perfect clarity pervades everywhere—\na single Buddha-land in a grain of sand,\na single grain of sand containing a great chiliocosm,\none body and mind in ten thousand identical forms.\nTo know this, you must realize the Dharma is without mind,\nuntainted and unobstructed—this is pure karma.\nThough good and evil arise in a thousand forms, take no action,\nand you are Namu and Mahākāśyapa.\n\n**Song of the Pearl**\n\nA treasure pearl lies within your robe,\nnaturally perfect and luminous.\nNot knowing to seek it yourself,\nyou count the treasures of others.\n\nCounting others’ treasures brings no benefit,\nonly teaching you to waste your strength.\nHow much better to recognize your own jewel,\nwhose value equals gold beyond measure.\n\nThis pearl’s light is supreme,\nilluminating the three-thousandfold great chiliocosm.\nNever has it diminished in the slightest,\nyet floating clouds obscure it.\n\nSince recognizing this cintāmaṇi,\nwho still clings to bubbles and empty flowers?\nThe Buddha’s pearl and my pearl are the same—\nmy nature returns to the Buddha-nature sea.\n\nPearl is not pearl, sea is not sea,\nthe vast expanse of mind embraces all worlds.\nThough dust and clamor fill your eyes,\nconcentration and wisdom remain perfectly clear.\n\nNeither emptiness nor form,\nwithin and without, luminous as a flawless jade.\nThe six supernormal powers manifest boundless wonders,\nself-benefit and benefiting others reach their utmost.\n\nSeeing is completion, all matters end.\nWithout study, without action, the day is spent.\nFearful as an unborn infant,\nmovement and stillness follow conditions without fixation.\n\nNeither severing delusion nor severing truth—\nthe minds of truth and delusion are both dust.\nAll dharmas have always been without form;\nwithin the formless, the Dharma-body abides.\nThe Dharma-body is the natural, true Buddha,\nneither human nor thing.\nVast and boundless, filling the world,\nit is only the subtle and indistinct.\n\nDust does not stain, light shines of itself.\nNo dharma arises that is not born of the mind.\nIf the mind does not arise, dharmas vanish of themselves—\nthen you know that sin and blessing have no inherent form.\n\nNo Buddha to cultivate, no Dharma to expound.\nThe wise discernment of a true person arises naturally.\nWords spoken become the roar of a lion,\nnot like the wild ox debating birth and death.\n\n**Song of Pointing Out Delusion in Chan Concentration**\n\nThe Tathāgata’s Chan nature is like water—\nwhen the body is still, wind and waves cease of themselves.\nIn movement and rest, profound and ever-clear,\nnot only when sitting is this so.\n\nPeople today seek realization through silent sitting,\nnot knowing it depends entirely on seeing nature.\nIf nature is clear within seeing,\nseeing settles of itself within nature.\nWhen concentration is perfected, wisdom’s function is boundless—\nthis is called the buddhas’ supernormal powers.\nIf you wish to investigate its substance and function,\nyou see only the emptiness of the ten directions.\n\nWithin emptiness, nothing exists,\nnot even the subtle or indistinct.\nIf you seek the subtle and indistinct,\nyou err and lose the way.\nYet these two words—erring and losing—\ncannot be grasped as evidence.\nEven emptiness is like space,\nhow could there be gain or loss, subject or object?\n\nSimply cast aside all dharmas,\nleaving nothing remaining.\nSuddenly, perfect clarity manifests of itself—\nthen you are no different from the buddhas.\n\nThe physical body is my post and thatch,\nso I blend with the world and harmonize with custom.\nIn all actions, without mind,\nwhy dispute right and wrong, honor and disgrace?\n\nThis born body is but a temporary abode,\nthe host of the inn is called Vairocana.\nVairocana neither comes nor goes—\nthen you know birth and death leave no trace.\n\nIf asked what Vairocana is,\nit is only that which is not form.\nBefore your eyes, every leaf and speck of dust—\nneither same nor different, neither close nor distant.\nWithin each speck of dust and every leaf,\neach is Śākyamuni and Mahākāśyapa.\nIf different, the ten thousand sounds all resound;\nif the same, a single wind gathers all.\n\nIf you wish to recognize the cintāmaṇi,\ndo not say you must attain the Dharma to know.\nWhen sick, use medicine to heal;\nonce healed, what need is there for medicine?\n\nWhen the mind is deluded, rely on the Dharma to illuminate;\nwhen the mind is awakened, the Dharma is no longer needed.\nLike a tarnished mirror polished—\nblemishes and dust vanish of themselves.\n\nAll mind and dharmas are delusion,\nso I teach you to leave all forms behind.\nWhen all forms are left behind, what remains?\nThis is called the supreme, true reality.\n\nIf you wish to adorn the Buddha-land,\npractice equality, compassion, and relief of suffering.\nThe bodhisattva’s original vow must be profound—\ndo not grasp at appearances.\n\nThis is called the perfect union of merit and wisdom;\nin the future, you will receive prediction together.\nIf even a speck of dust stains you,\nyou will have no affinity with the buddhas.\n\nTurning the thought, ordinary beings are deluded and attached,\nall stained by the habits of love and desire.\nOnly because of excessive craving and clinging\ndo they constantly dwell in womb, egg, transformation, and moisture births.\n\nTo learn the Way, you must be fierce and resolute,\nyour heart of non-emotion hard as iron.\nEven toward father, mother, wife, and children,\nhow are they different from others?\n\nAlways guard a single sphere of radiance,\nseeing no desires to contemplate.\nAll dharmas are unattached at once—\nwhat need to speak of hell and heaven?\n\nThen my life is in my own hands,\nin emptiness, neither ascending nor descending.\nAppearing and disappearing in the buddhas’ lands,\nI never leave the original seat of bodhi.",
      "overlap_context": "entration, and Wisdom**\n\nPrecepts (*jie*), concentration (*ding*), and wisdom (*hui*) are the wondrous functions within the Dharma. Though buddhas and ancestors have spoken of them, those who have not yet realized their meaning still cling. Here, I briefly expound them to aid awakening.\n\nWhen mind and environment are both forgotten, and a single thought does not move—this is *precepts*.\nWhen the awakened nature is perfectly luminous, and inner and outer are crystal-clear—this is *concentration*.",
      "start_char": 1295,
      "end_char": 2517,
      "start_sentence": 77,
      "end_sentence": 125,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.458099126815796,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\紫阳真人悟真篇拾遗.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "观音三十二应，我学亦从中证，化现不可思议，尽出逍遥之性。 我是无心禅客，凡事不会拣择，昔时一个黑牛，今日浑身总白，有时自歌自笑，傍人道我神少，争知被褐之形，内怀无价之宝。 更若见我谈空，却似囫园吞枣，此法惟佛能知，凡愚岂解相表。 兼有修禅上宾，只学斗口合唇，夸我问答敏给，却元不识主人。 盖是寻枝摘叶，不解穷究本根，得根枝叶自茂，无根枝叶难存。 便逞已握灵珠，转於人我难除，与他灵源妙觉，远隔千里之殊。 此辈可伤可笑，空说积年学道，心高不肯问人，枉使一生虚老，乃是愚迷钝根，邪见业重为因，若向此生不悟，后世争免沉沦。 无心颂 堪笑我心，如顽如鄙，兀兀腾腾，任物安委。 不解修行，亦不造罪，不曾利人，亦不利己。 不持戒律，不拘忌讳，不知礼乐，不行仁义。 人问所能，百无一会。 饥来吃饭，渴来饮水，困则睡眠，觉则行履，热则单衣，寒则盖被。 无思无虑，何忧何喜，不悔不谋，无念无意，死生荣辱，逆旅而已。 林木柄乌，亦何为比。 来且不禁，去亦不止，不避不来，无赞无毁，不厌丑恶，不羡善美。 不处静室，不远闹市，逢肉也餐，遇酒也醉，不说人非，不夸己是，不厚尊荣，不薄贱稚，亲爱冤仇，大小内 外，一反乐得丧，敬侮俭易，心无两观，坦然一揆。 不为福先，不为祸始，感而后应，迫而后起。 不畏锋刃，焉怕虎兕。 随物称呼，岂拘名字。 眼不就色，声不来耳，凡有所相，皆属妄伪。 男女形声，悉非定体，体相无心，不染不爱，自在逍遥，物莫能累。 妙觉光圆，映彻表裹，包裹六极，无有遐迩。 光兮非光，如月在水，取舍既难，复何比拟。 了兹妙用，迥然超彼，或问所宗，如斯而已。 西江月一十二首 妄想不须强灭，真如何必希求。 本源自性佛齐修，迷悟岂拘先后。 悟则剎那成佛，迷则万劫沦流。 若能一念契真修，灭尽怛沙罪垢。 本自无生无灭，强将生灭区分，只如罪福亦何根，妙体何曾增损。 我有一轮明镜，从来只为蒙昏，今朝磨莹照乾坤，万象超然难隐。 我性入诸佛性，诸方佛性皆然，亭亭蟾影照寒泉，一月千潭普现。 小则毫分莫识，大时遍满三千，高低不约信方圆，说甚短长深浅。 法法法元无法，空空空亦非空，静谊语默本来同，梦裹何曾说梦。 有用用中无用，无功功裹施功，还如果熟自然红，莫问如何修种。 善恶一时妄念，荣枯都不关心，晦明隐显任浮沉，随分饥餐渴饮。 神静湛然常寂，不妨坐外歌吟，一池秋水碧仍深，风动鱼惊尽任。 对镜不须强灭，假名权立菩提，色空明暗本来齐，真妄体分两体。 悟则便名净土，更无天竺曹溪，谁言极乐在天西，了则弥陀出世。 人我众生寿者，宁分彼此高低。 法身通照没吾伊，念念体分同异。 见是何曾是是，闻非未必非非。 往来诸用不相知，生死谁能碍你。 住想修行布施，果报不离天人，恰如仰箭射浮云，坠落祗绿力尽。 争似无为实相，还须返朴归淳，境忘情性任天真，以证无生法忍。 鱼兔若还入手，自然忘却荃蹄，渡河筏子上天梯，到彼悉皆遣奔。 未悟须凭言说，悟来言说皆非，虽然四句属无为，此等何须脱离。 悟了莫求寂灭，随绿只接群迷，寻常邪见及提携，方便指归实际。",
      "translated_text": "Guanyin’s thirty-two manifestations—\nmy learning too is verified through them.\nTransformations beyond all conception,\nall arise from the nature of carefree ease.\n\nI am a Chan practitioner of no-mind,\nindiscriminate in all matters.\nOnce a black ox,\nnow wholly white.\nSometimes I sing, sometimes I laugh—\nothers say I lack sense,\nbut how would they know\nthat beneath this coarse robe\nlies a priceless treasure?\n\nShould they see me speak of emptiness,\nthey swallow the jujube whole.\nThis Dharma only buddhas can know—\nhow could the foolish and dull grasp its outward signs?\n\nThen there are those esteemed Chan practitioners\nwho only learn to match lips and contend with words.\nThey boast of my quick replies,\nyet fundamentally fail to recognize the host.\n\nThey merely pluck branches and gather leaves,\nunable to fathom and investigate the root.\nWith the root attained, branches and leaves flourish;\nwithout the root, branches and leaves cannot endure.\n\nThough they flaunt their grasp of the luminous pearl,\nthey remain entangled in self and other.\nFar removed from the wondrous source of awakening,\nseparated by a thousand miles.\n\nSuch people are pitiable and laughable—\nvainly claiming years of Dao-learning,\ntoo proud to seek guidance,\nwasting their lives in futility.\nThey are dull and deluded roots,\nburdened by heavy karmic wrong views.\nIf they fail to awaken in this life,\nhow will they escape sinking in the next?\n\n*Verse of No-Mind*\nLaughable, my heart—\nstubborn and coarse,\ndull and drifting,\nletting things rest as they are.\n\nI neither cultivate practice\nnor commit offenses,\nneither benefit others\nnor profit myself.\n\nI do not uphold precepts,\nnor observe taboos,\nknow not rites or music,\nnor practice benevolence or righteousness.\nAsk what I can do—\nnot a single thing.\n\nHungry, I eat;\nthirsty, I drink.\nWeary, I sleep;\nawake, I walk.\nHot, I wear light clothes;\ncold, I cover myself.\n\nNo thoughts, no worries—\nwhat sorrow, what joy?\nNo regret, no scheming,\nno念, no intent.\nLife and death, honor and disgrace—\nbut a traveller’s inn.\n\nTrees and nesting crows—\nwhat comparison can be made?\nComing, I do not forbid;\ngoing, I do not stop.\nI neither avoid nor seek,\nneither praise nor blame.\nI do not shun the ugly,\nnor covet the good and beautiful.\n\nI neither dwell in quiet chambers\nnor shun bustling markets.\nI eat when meat is served,\ndrink when wine is offered.\nI do not speak ill of others,\nnor boast of my own rightness.\nI neither favor the noble\nnor slight the lowly and young.\nLoved ones and enemies,\ngreat and small, inner and outer—\nall are met with equanimity,\nwhether in gain or loss, respect or insult.\nMy heart holds no dual views,\ntreading a single, unobstructed path.\n\nI neither initiate blessings\nnor begin misfortunes.\nI respond only when moved,\nrise only when pressed.\nUnafraid of blades,\nhow could I fear tigers or rhinos?\n\nI follow things in their naming,\nunbound by fixed designations.\nEyes do not pursue forms,\nsounds do not enter ears.\nAll appearances are but delusion.\nMale and female, form and voice—\nnone are fixed entities.\nForms and appearances are without mind,\nuntainted and unloved.\nAt ease and carefree,\nnothing can burden me.\n\nThe radiance of wondrous awakening shines through,\nilluminating inner and outer.\nIt encompasses the six directions,\nwithout near or far.\n\nLight yet not light—\nlike the moon in water.\nHard to grasp or relinquish,\nwhat comparison can be made?\n\nUnderstanding this wondrous function,\none transcends all bounds.\nShould one ask of my宗,\nit is just this.\n\n*Twelve Western River Moon Lyrics*\n\nDeluded thoughts need not be forcibly extinguished;\nthe real—why seek it?\nThe original source and self-nature are equally cultivated as buddha.\nDoes enlightenment or delusion depend on sequence?\n\nAwakened, one becomes buddha in an instant;\ndeluded, one drifts for ten thousand kalpas.\nIf one can align a single念 with true cultivation,\ncountless karmic stains are wiped away.\n\nOriginally without birth or extinction,\nyet forcibly divided into birth and extinction.\nHow can sin and blessing have roots?\nThe wondrous essence has never increased or diminished.\n\nI possess a luminous mirror,\nlong obscured by dust.\nToday, polished and bright, it illumines heaven and earth—\nall phenomena stand revealed, beyond concealment.\n\nMy nature enters the nature of all buddhas;\nthe buddha-nature in every realm is thus.\nThe moon’s clear reflection shines on cold springs—\none moon appears in a thousand pools.\n\nSmall—beyond the minutest fraction;\nvast—pervading the three thousand worlds.\nHigh and low, unconstrained, naturally round.\nWhat need to speak of short or long, deep or shallow?\n\nDharmas, dharmas—fundamentally no dharma;\nemptiness, emptiness—yet not empty.\nStillness, speech, silence—originally the same.\nIn dreams, who ever spoke of dreams?\n\nUse within use—no use;\neffort within effort—bestowing effort.\nLike fruit ripening naturally red,\nask not how it was cultivated or planted.\n\nGood and evil—fleeting deluded念;\nglory and decay—unrelated to the heart.\nDarkness and brightness, concealment and display—\nlet them drift as they will.\nEat when hungry, drink when thirsty.\n\nThe spirit, serene and ever still,\ndoes not hinder singing or chanting outside.\nA pool of autumn water, deep and clear—\nwind stirs, fish startle—let them be.\n\nBefore the mirror, no need to forcibly extinguish;\nprovisional names are but expedient bodhi.\nForm and emptiness, brightness and darkness—originally equal.\nTrue and deluded—two distinct bodies.\n\nAwakened, it is called the Pure Land;\nno need for India or Caoxi.\nWho says the Land of Ultimate Bliss lies in the western heavens?\nAwakened, Amitābha manifests.\n\nSelf, others, sentient beings, lifespan—\nwhy distinguish high and low?\nThe dharmakāya illumines all,\nwithout you or I.\nEach念 discerns sameness and difference.\n\nSeeing—when was it ever truly so?\nHearing—what is not necessarily so?\nComing and going, all functions—unknown to one another.\nWho can hinder your birth and death?\n\nAbiding in念, cultivating practice, giving—\ntheir fruition does not transcend gods and humans.\nLike shooting an arrow upward at floating clouds,\nit falls only when its force is spent.\n\nHow much better the true mark of non-action—\nreturn to simplicity, restore purity.\nForget circumstances, let nature follow its course,\nto realize the patience of the unborn.\n\nIf fish and rabbit come to hand,\none naturally forgets the trap and snare.\nThe raft for crossing the river,\nthe ladder for ascending the sky—\nonce arrived, all are discarded.\n\nBefore awakening, one relies on words;\nawakened, words are all false.\nThough the four phrases belong to non-action,\nwhy need they be cast aside?\n\nAwakened, do not seek extinction;\nfollow conditions to guide the deluded.\nIn ordinary dealings, correct wrong views and lead others—\nexpediently point to the real.",
      "overlap_context": "To learn the Way, you must be fierce and resolute,\nyour heart of non-emotion hard as iron.\nEven toward father, mother, wife, and children,\nhow are they different from others?\n\nAlways guard a single sphere of radiance,\nseeing no desires to contemplate.\nAll dharmas are unattached at once—\nwhat need to speak of hell and heaven?\n\nThen my life is in my own hands,\nin emptiness, neither ascending nor descending.\nAppearing and disappearing in the buddhas’ lands,\nI never leave the original seat of bodhi.",
      "start_char": 2517,
      "end_char": 3763,
      "start_sentence": 126,
      "end_sentence": 175,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.01218843460083,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\紫阳真人悟真篇拾遗.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "五眼三身四智，六度万行修齐，圆光一颗好摩尼，利物兼能自利。 我见时人说性，只夸口急酬机，及逢境界转痴迷，又与愚人何异。 说得便须行得，方名言行无亏，能将慧剑斩魔魑，此号如来正智。 欲了无生妙道，莫如自见真心，真心无相亦无音，清净法身只想。 此道非无外有，非中亦莫求寻，二边俱遣奔中心，见了名为上品。 紫阳真人悟真篇拾遗竟",
      "translated_text": "The five eyes and three bodies, the four wisdoms,\nthe six perfections and ten thousand practices—all cultivated in harmony.\nA single orb of perfect radiance, a flawless mani jewel,\nbenefiting others while benefiting oneself.\n\nI see people of this age speak of nature,\nboasting hastily to match the moment.\nYet when they encounter circumstances, they turn deluded—\nhow do they differ from the foolish?\n\nTo speak is to act accordingly;\nonly then is speech and conduct without flaw.\nWield the sword of wisdom to sever demonic illusions—\nthis is called the Tathāgata’s true wisdom.\n\nTo comprehend the wondrous Dao of the unborn,\nnothing surpasses seeing one’s true mind.\nThe true mind is without form, without sound—\nonly the pure Dharma-body remains.\n\nThis Dao is neither outside nor within,\nnor is it to be sought in the middle.\nCast aside both extremes, abandon the center—\nseeing thus is called the highest rank.\n\n*Postscript to the \"Awakening to Reality\" of the Perfected One of Purple Yang*",
      "overlap_context": "f the unborn.\n\nIf fish and rabbit come to hand,\none naturally forgets the trap and snare.\nThe raft for crossing the river,\nthe ladder for ascending the sky—\nonce arrived, all are discarded.\n\nBefore awakening, one relies on words;\nawakened, words are all false.\nThough the four phrases belong to non-action,\nwhy need they be cast aside?\n\nAwakened, do not seek extinction;\nfollow conditions to guide the deluded.\nIn ordinary dealings, correct wrong views and lead others—\nexpediently point to the real.",
      "start_char": 3763,
      "end_char": 3928,
      "start_sentence": 176,
      "end_sentence": 181,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 5.960086107254028,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\紫阳真人悟真篇拾遗.txt",
        "category": "玉诀类"
      }
    }
  ]
}