{
  "source_id": "罗天大醮午朝科",
  "source_file": "chunked_daozang\\罗天大醮午朝科.json",
  "total_chunks": 5,
  "total_original_chars": 2189,
  "total_translated_chars": 15442,
  "total_translation_time": 88.3087170124054,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\罗天大醮午朝科.txt",
    "category": "威仪类"
  },
  "full_translation": "**Morning, Noon, and Evening Rites of the Grand Luotian Jiao**\n**Scripture Title:** *Morning, Noon, and Evening Rituals of the Grand Luotian Jiao* (One fascicle)\n**Source Text:** *Zhengtong Daoist Canon*, *Dongxuan* Section, *Weiyi* Category\n\n---\n\n### **Noon Rite of the Grand Luotian Jiao**\n\n**All officiating masters shall maintain mindfulness as prescribed:**\n\nCinnabar spirit, vermilion fire,\nScarlet mists stir the winds.\nThe crimson wheel turns with unyielding force,\nHeaven’s radiance surges through the eight directions.\nIts might encompasses all,\nTransforming myriad realms.\nMolten gold scatters in boundless space,\nAll demons vanish without trace.\nBanishing evil, shattering malevolence,\nIlluminating the primordial merit.\nGolden talismans command and restrain,\nTreading clouds, spurring dragons.\nJubilant hymns resound in celebration,\nFlowers scatter across the vast heavens.\nDivine transformation operates in hidden motion,\nThe four extremities rest in peace and prosperity.\nProstrate before the Emperor,\nNone dare show disrespect.\n\n**Strike the ritual drum twenty-four times.**\n\n**The Most High Three Heavens, Mysterious Primordial Three Qi, Supreme Venerable Lord Lao, summon forth:**\nFrom within this servant’s body, the Three and Five Merit Officials, Attendants of the Left and Right;\nThe Golden Lads bearing incense on the left, the Jade Maidens transmitting words and scattering flowers on the right;\nThe Thirty-Six Perfected of the Five Thearchs, Direct Talismanic Officials, and Daily Incense Officers—**emerge!**\n\nLet them emerge in solemn attire, adorned with regal vestments, their crowns and sashes draped with tassels.\n**To the Divine Perfected of the Altar’s Earthly Precincts and Local Deities:**\nThis servant now ascends the altar at the noon rite to perform the Dao, paying homage to the Imperial Perfected. Humbly, I present this petition for the supplicant’s intentions, all sincerely recorded in sealed writ.\nMay the Supreme Perfected’s Dao-qi of the Most High, the auspicious radiance of the Numinous Treasure, descend and flow into this servant’s body, that the sincerity of this petition may swiftly reach the presence of the Boundless Great Dao of the Most High Perfected, the Three Clarities’ August Sages, and the Jade Emperor of the Golden Palace in the Supreme Heavenly Vault.\n\n**Recite the Dharma Titles:**\n\n**[Name and rank of the officiant]**, together with the attending altar officials and assembly, reverently and with unified sincerity, address this petition to:\nThe Primordial Heavenly Worthy of Vacuous Non-Being,\nThe Boundless Great Dao, the Supreme Dao Lord,\nThe Supreme Venerable Lord Lao,\nThe August Jade Emperor,\nThe Host of Great Saints who have attained the Dao in the Ten Directions,\nThe Perfected Lords and Venerable Masters,\nThe Thirty-Two Heavenly Thearchs,\nThe Jade Void Emperor,\nThe Great Emperor of the Jade Capital,\nThe Eastern Florescence and Southern Culmen,\nThe Western Numinous and Northern Perfected,\nThe Lord of the Numinous Treasure, Illustrious August Sovereign of the Purple Tenuity’s Upper Palace in the Golden Portal of the Seven Jeweled Jasper Terrace of the Jade Metropolis,\nThe Thirty-Six Divisions of Venerable Scriptures,\nThe Great Dharma Masters of the Mysterious Center,\nThe Supreme Ministers, Supreme Chancellors,\nThe Supreme Protectors, Supreme Tutors,\nThe Twenty-Four Perfected of the Great Peace’s Lesser Teaching,\nThe Perfected King of the Western City’s Assembly,\nThe Perfected Lord of the Great One,\nThe Lord of the Eastern Marchmount’s Upper Minister, Controller of Destinies, the Two Perfected Lords Mao and Ding, Recorders of Lifespans,\nThe Divine Immortals who have attained the Dao in the Sacred Mountains and Grotto-Heavens,\nAll the Perfected and Numinous Beings of the Three Realms’ officialdom.\n\nThis servant has heard:\nWhen the true wind prevails, one’s duty encompasses the essentials of the Dao.\nYet wisdom does not suffice to comprehend all that is seen and heard...\n\nThe heart has yet to grasp the subtle traps of the Dao.\nPursuing profit and trading in fame, one’s feelings shift with worldly customs;\nGazing across the vast expanse toward the distant void, one vainly yearns for the cinnabar splendor of transcendence.\nWere it not for exhausting all efforts to commune with the numinous ranks,\nfear of lingering in regret would surely follow.\nThus, in earnest supplication, how dare I not comply?\nWith sincere words, I now humbly present this memorial.\n\n**Memorial Text**\nAs the petition reveals in full the depth of devotion,\nI trust Your Celestial Compassion will deign to heed its plea.\n\nI have heard:\nNumbers arise from the One, and ranks are perfected in the Three.\nThe One is the root of the myriad things,\nwhile the Three threads the order of the Two Modes.\nWhen the Two Modes join in virtue, the Three Luminaries shine forth in brilliance,\nrightly governing day and night with constancy,\nand circulating the four seasons without error.\nVast as the four seas, they distinguish the auspices and calamities of each region;\nsubtle as the single body, they fuse year and fate to mold and refine.\nThus, the stars and lunar lodges follow the Yang’s path in their celestial courses,\nwhile fortunes, destinies, lifespans, and wealth belong to the celestial offices that govern reckoning.\nNobility and humility are apportioned by fate,\nand all fortunes and misfortunes arise in due time—none but are bestowed by decree.\n\nNow, the officiant [Name] rejoices in encountering an era of prosperity,\nborn in an age of radiant clarity.\nHis life’s fortune, destiny, and wealth are surely due to the illumination of the heavens;\nhis qi, form, and substance are blessed to inherit the harmony of primordial balance.\nAware of such favor, he stands in awe and reveres the precepts,\npurifying the sacred altar to offer blessings,\nand upholding the rites with solemn devotion.\nLooking up to the imperial will, he presents this solemn observance at the appointed hour.\n\nThe sun’s chariot halts its course, and the jade heavens dispel all vapors.\nThe sunflower’s shadow stands true without deviation,\nand the gnomon’s measure shines clear and unmistakable.\nBy verifying the height of the midday sun, one deeply attains its fitting moment;\nby observing the slant of its rays, one transcends all ordinary dwelling.\nThe adept employs this to enter emptiness and stillness,\nwhile the sage uses it to govern the world as an enduring principle.\nThis very moment of alignment secretly accords with wondrous transformation.\n\nNow, at the hour of high noon, as the Dao is practiced,\nthe assembly of ritualists, invoking the Dharma,\nconveys the first pinch of incense.\nMay this fragrant smoke ascend directly to the realm of the Three Purities.\n\nWe, your servants, prostrate body, spirit, and life,\nbowing our heads to the ground.\nReverently relying on the Three Supreme Ones of the Great Highest,\nwe dedicate the merit of this incense offering\nto the reigning emperor, praying that:\nthe Nine Ancestral Shrines be filled with blessings,\nand the Three Luminaries bestow their favor.\nMay he embody the benevolence of Yao, extending its radiance to the four quarters,\nand continue the Way of Zhou, bringing its grace to the ten thousand regions.\nMay he sheathe bows and arrows to still all warfare,\ncultivating culture and laying aside arms;\nreduce punishments and lighten taxes,\nenriching customs and bringing peace to the age.\nMay the pure wind be renewed,\nand the distant antiquity be once more illumined.\n\nNow, therefore, we burn incense,\nreturning to the virtue/power of the Dao, the Venerable, the Great Sage Host, and the Perfected Ones of the Highest.\nAfter attaining the Dao, may they preserve Heaven and endure forever.\n\nAt this noon hour of ritual practice,\nwe, the assembly of the Dharma, offer this second pinch of incense.\nMay its fragrant smoke ascend directly to make offering to the Three Realms and the ten directions,\nto all the Heavenly Great Sages,\nand to the three generations of ancestors and departed spirits of the officiating patrons.\nWe humbly pray that:\nthe yin realms be illumined,\nand the yang souls be settled in clarity.\nWith unobstructed vision, may they perceive the emptiness of all true principles;\nreturning to the root and restoring the origin, may their spirit-minds become as vast as the sea.\nMay they mount the nine-plumed phoenix,\nand be guided by the ten-streamered banners.\nRoaming and feasting in the Pure Capital,\nthey transcend birth and enter the Land of Bliss.\n\nNow, therefore, we burn incense,\nreturning to the virtue/power of the Sutra, the Venerable, the Great Sage Host, and the Perfected Ones of the Highest.\nAfter attaining the Dao, may they ascend into the formless.\n\nAt this noon hour of ritual practice,\nwe, the assembly of the Dharma, offer this third pinch of incense.\nMay its fragrant smoke ascend directly to make offering to the sacred mountains and oceanic peaks,\nto the realized immortals and perfected transcendents,\nto the entire household and kin,\nand to the original destiny of the patron’s life-star.\nWe humbly pray that:\ntheir bright mandate be radiant,\nand the morning breeze spread blessings.\nMay longevity be prolonged in the celestial lodges,\nand robust health and flourishing prosperity be secured in the course of life.\nMay their noble house flourish abundantly,\never attaining auspicious affairs;\nmay their illustrious descendants thrive,\ntheir glorious renown ever increasing.\nIn harmony and reverence, may they delight in the civilizing influence of culture and learning;\nwith soaring vigor and rising splendor, may they exalt the renown of their family in rites and propriety.\nMay their store of blessings be abundant,\nand their prosperity ever expanding.\n\nNow, therefore, we burn incense,\nreturning to the virtue/power of the Master, the Venerable, the Great Sage Host, and the Perfected Ones of the Highest.\nAfter attaining the Dao, may they unite with the Dao in truth.\n\nChanting the directions, we confess and repent...\n\nWith the Invocation of the Life-Spanning Demons, the Triple Hymn, the Triple Bows, and the Repeated Recitation of the Dharma Titles, we, the officiants and all assembled before the altar, reverently and with one heart, address the following supplication:\n\nTo the Supreme Ones of the Three Realms, the Sagely Hosts of the Ten Directions, the Heavenly Perfected and Celestial Emperors of the Jade Capital and Golden Gates, the Venerable Masters and Sagely Assemblies of the Ten Directions, the Officials of the Three Realms, and all majestic numina:\n\nWe have heard that the formless void has no gate, yet through external forms and sounds, prayers are offered; the heart of the Dao is responsive, for through seeing and hearing, the trigger of resonance is sprung. Ever non-acting yet never failing to act, it skillfully saves all beings without abandoning any.\n\nWe, however, are of the shallowest capacity, our virtue all too meager. The steps toward the Dao stretch boundlessly before us, and the work of cultivating the Real can scarcely be accomplished in a day. Clinging to an unshakable folly, we yet seek to plumb the unfathomable depths of the Nameless. Thus, in every act of utmost sincerity, we must place others before ourselves. To deliver beings from the wheel of suffering, we must proclaim the wondrous model.\n\nThe present sponsor of this retreat, so-and-so, has long borne a profound karmic bond, reverently gazing up to the Great Luminosity, preserving frugality and fostering tranquility. Early on, they embraced the frugal virtue of serving Heaven, purifying their essence and clarifying their thoughts; never forgetting the diligence of reverent precepts, they strictly uphold the statutes and ordinances. Solemnly they conduct the rites of their village, kindling orchid-oil lamps at night; in imagination, they ascend to the starry firmament, where the sounds of Sanskrit chanting soar to the heavens, their voices reaching the celestial vaults.\n\nWe pray that the chariots of the Five Luminaries may briefly pause in their circuits through the Three Realms, that the radiance of the Supreme Origin may be made manifest, and that our supplications may reach the boundless. With reverence, we look up to the August Heavenly Emperor, the Perfected Ones of the Highest Sphere, the Immortal Hosts of the Dharma Realm, and the Sagely Assemblies of the Celestial Net.\n\nMay their divine chariots gleam with resplendent luster, as the thousand officials move in ceaseless procession; may their sagely calculations know no limit, firmly securing the mountains and rivers as their guardians. For the sponsor of this retreat, so-and-so, we humbly pray:\n\nMay the hundred spirits surround and protect them, the five agents guard and restrain. Warding off calamity and supporting decline, they dispel the stale qi of demons and malevolence; prolonging life and increasing destiny, they bathe in the lingering radiance of the Immortals and Sages. May fortune, stern in its operation, be ever renewed with the seasons; may misfortune, concealed in action and repose, daily recede. In their conduct, may they fully preserve prosperity and abundance; in their gentle demeanor, may they be truly renowned in fame. May their household transmit blessings, and their persons be known through their deeds. May all living kin, young and old, enjoy joy and well-being; may past ancestors and kindred all be delivered. May the city gods and village spirits protect the numinous altar; may the talisman messengers and merit officers purify the Yellow Path. Each contributing their diligent efforts, may they await promotion in rank and grade. May all sentient beings partake of the moisture of the Dharma, that above, the great compassion of the Heavenly Worthy may be made manifest, and below, our own reverent sincerity may be fulfilled.\n\nWe respectfully present this supplication for your hearing.\n\n**Vows:**\nFirst, may the numinous light shine down;\nSecond, may the moon of the Dao cast forth its splendor;\nThird, may grace be proclaimed throughout the Nine Lands;\nFourth, may sincerity reach the majesty of Heaven;\nFifth, may the true numina all assemble;\nSixth, may the qi of the Dao pervade all;\nSeventh, may the Heavenly Halls be opened wide;\nEighth, may the Hells be shattered and destroyed;\nNinth, may the mysterious workings be universally bestowed;\nTenth, may the chariots of light soar through empty space;\nEleventh, may all under Heaven cherish virtue;\nTwelfth, may the transformation of the Dao be non-acting.\n\nThe incense burner is replenished; we concentrate our spirit and burn incense.\n\nMay the Incense-Official Envoys, the Lords of the Left and Right Dragon-Tiger, and all the attendant spirit-officials of incense cause this place—where we have ascended the altar at the noon audience to perform the Dao-ritual—to naturally generate golden liquor, cinnabar-green mushroom blossoms, and the assembled host of the hundred numina and perfected beings, all gathered here before the incense burner. May it be vouchsafed that the jade maidens and immortal youths of the ten directions attend the orchid banquet, and swiftly convey the sincerity of our supplication directly upward to the presence of the Utmost True, Boundless Great Dao; the Three Clarities and Supreme Sages; and the August Heavenly Venerable, the Jade Emperor of the Golden Portal in the Highest Heaven. The grand offering of the Luo Heaven, performed at the noon hour, is now concluded.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "罗天大醮早午晚三朝科 经名：罗天大醮早午晚三期科。 一卷。 底本出处：《正统道藏》洞玄部威仪类。 罗天大醮午朝科 各礼师存念如法 丹灵朱火，炎霞激风。 赤轮刚运，天光八冲。 迸威包罗，交变万方。 流金豁落，群魔灭踪。 辟奸破妖，明耀元功。 金符召制，蹑云策龙。 谣歌庆会，散花太空。 神化冥运，四极安隆。 伏御帝前，罔有不恭。 鸣法鼓二十四通 无上三天玄元始三炁太上老君，召出臣身中三五功曹左右官使者，左右捧香金童、传言散花玉女、五帝直符直日香官各三十六人出。 出者，严装显服，冠带垂缨。 关启玄坛土地方域神真，臣今午朝升坛行道，朝谒帝真，谨奏为入意，其诸诚意，具载缄誊。 愿得太上至真道炁，灵宝瑞光，下降流入臣身中，令臣所启之诚，速达径御至真无极大道、三清上圣、昊天至尊金阙玉皇上帝御前。 请称法位 具位　与临坛官众等，谨同诚上启：虚无自然元始天尊、无极大道太上道君、太上老君、高上玉皇、十方已得道大圣众，至真诸君丈人、三十二天帝君、玉虚上帝、玉帝大帝、东华南极、西灵北真、玄都玉京金阙七宝琼台紫微上宫灵宝至真明皇道君、三十六部尊经、玄中大法师、上相上宰、上保上傅、太平下教二十四真人、西城总真王君、太乙真人、东岳上卿司命茅君定录保命二真人、名山洞府得道神仙、三界官属一切真灵。 臣闻：运值真风，职参道要。 智不该於闻见；",
      "translated_text": "**Morning, Noon, and Evening Rites of the Grand Luotian Jiao**\n**Scripture Title:** *Morning, Noon, and Evening Rituals of the Grand Luotian Jiao* (One fascicle)\n**Source Text:** *Zhengtong Daoist Canon*, *Dongxuan* Section, *Weiyi* Category\n\n---\n\n### **Noon Rite of the Grand Luotian Jiao**\n\n**All officiating masters shall maintain mindfulness as prescribed:**\n\nCinnabar spirit, vermilion fire,\nScarlet mists stir the winds.\nThe crimson wheel turns with unyielding force,\nHeaven’s radiance surges through the eight directions.\nIts might encompasses all,\nTransforming myriad realms.\nMolten gold scatters in boundless space,\nAll demons vanish without trace.\nBanishing evil, shattering malevolence,\nIlluminating the primordial merit.\nGolden talismans command and restrain,\nTreading clouds, spurring dragons.\nJubilant hymns resound in celebration,\nFlowers scatter across the vast heavens.\nDivine transformation operates in hidden motion,\nThe four extremities rest in peace and prosperity.\nProstrate before the Emperor,\nNone dare show disrespect.\n\n**Strike the ritual drum twenty-four times.**\n\n**The Most High Three Heavens, Mysterious Primordial Three Qi, Supreme Venerable Lord Lao, summon forth:**\nFrom within this servant’s body, the Three and Five Merit Officials, Attendants of the Left and Right;\nThe Golden Lads bearing incense on the left, the Jade Maidens transmitting words and scattering flowers on the right;\nThe Thirty-Six Perfected of the Five Thearchs, Direct Talismanic Officials, and Daily Incense Officers—**emerge!**\n\nLet them emerge in solemn attire, adorned with regal vestments, their crowns and sashes draped with tassels.\n**To the Divine Perfected of the Altar’s Earthly Precincts and Local Deities:**\nThis servant now ascends the altar at the noon rite to perform the Dao, paying homage to the Imperial Perfected. Humbly, I present this petition for the supplicant’s intentions, all sincerely recorded in sealed writ.\nMay the Supreme Perfected’s Dao-qi of the Most High, the auspicious radiance of the Numinous Treasure, descend and flow into this servant’s body, that the sincerity of this petition may swiftly reach the presence of the Boundless Great Dao of the Most High Perfected, the Three Clarities’ August Sages, and the Jade Emperor of the Golden Palace in the Supreme Heavenly Vault.\n\n**Recite the Dharma Titles:**\n\n**[Name and rank of the officiant]**, together with the attending altar officials and assembly, reverently and with unified sincerity, address this petition to:\nThe Primordial Heavenly Worthy of Vacuous Non-Being,\nThe Boundless Great Dao, the Supreme Dao Lord,\nThe Supreme Venerable Lord Lao,\nThe August Jade Emperor,\nThe Host of Great Saints who have attained the Dao in the Ten Directions,\nThe Perfected Lords and Venerable Masters,\nThe Thirty-Two Heavenly Thearchs,\nThe Jade Void Emperor,\nThe Great Emperor of the Jade Capital,\nThe Eastern Florescence and Southern Culmen,\nThe Western Numinous and Northern Perfected,\nThe Lord of the Numinous Treasure, Illustrious August Sovereign of the Purple Tenuity’s Upper Palace in the Golden Portal of the Seven Jeweled Jasper Terrace of the Jade Metropolis,\nThe Thirty-Six Divisions of Venerable Scriptures,\nThe Great Dharma Masters of the Mysterious Center,\nThe Supreme Ministers, Supreme Chancellors,\nThe Supreme Protectors, Supreme Tutors,\nThe Twenty-Four Perfected of the Great Peace’s Lesser Teaching,\nThe Perfected King of the Western City’s Assembly,\nThe Perfected Lord of the Great One,\nThe Lord of the Eastern Marchmount’s Upper Minister, Controller of Destinies, the Two Perfected Lords Mao and Ding, Recorders of Lifespans,\nThe Divine Immortals who have attained the Dao in the Sacred Mountains and Grotto-Heavens,\nAll the Perfected and Numinous Beings of the Three Realms’ officialdom.\n\nThis servant has heard:\nWhen the true wind prevails, one’s duty encompasses the essentials of the Dao.\nYet wisdom does not suffice to comprehend all that is seen and heard...",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 566,
      "start_sentence": 0,
      "end_sentence": 23,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.686073541641235,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\罗天大醮午朝科.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "心未达於荃蹄。 徇利酤名，屡移情於世习； 望洋向漠，徒延想於丹华。 若非竭蹙，以通灵第，恐因循而悔忤，故於恳请，敢不遵依，爰有忱词，谨当宣奏。 宣词 按如词恳，备见忱诚，谅达天慈，必回听览。 臣闻：数起於一，位成乎三。 一为万物之宗，三贯两仪之序。 两仪合德，三景着明，正昼夜而有经，运四时而不武。 大维四海，别分野之灾祥； 微止一身，合年庚而陶铸。 所以星辰斗宿，随阳道以流躔； 禄相命财，属天官主算。 贵贱任分，皆是夤缘。 穷通有时，无非注赐。 今斋官某庆逢昌运，生遇明时。 身命禄财，谅必由於临照； 气形质具，幸允袭於冲和。 知宠若惊，畏天奉戒，洁兰场而荐祉，严科范以伸虔。 仰奉宸猷肃陈，祀事时也。 乌轮停驭，玉宇消氛。 葵影正而不偏，圭法明而易见。 取验中高之势，深得其宜； 坐观斜侧之端，独超所寓。 方士法之而观空入静，圣人用之而治世为常。 惟此正时，密符妙化。 以今临午行道，请法众等，运兹初捻上香。 愿此香烟腾空，径上三清之境。 臣等皈身，皈神皈命，首体投地。 仰依太上三尊，以是捻香功德，上祝当今皇帝，伏愿九庙储庥，三辰效祉。 体尧仁而光被四表，继周道而赖及万方。 橐弓矢而戢干戈，修文偃武； 省刑罚而薄税敛，阜俗安时。 再变淳风，重光邃古。",
      "translated_text": "The heart has yet to grasp the subtle traps of the Dao.\nPursuing profit and trading in fame, one’s feelings shift with worldly customs;\nGazing across the vast expanse toward the distant void, one vainly yearns for the cinnabar splendor of transcendence.\nWere it not for exhausting all efforts to commune with the numinous ranks,\nfear of lingering in regret would surely follow.\nThus, in earnest supplication, how dare I not comply?\nWith sincere words, I now humbly present this memorial.\n\n**Memorial Text**\nAs the petition reveals in full the depth of devotion,\nI trust Your Celestial Compassion will deign to heed its plea.\n\nI have heard:\nNumbers arise from the One, and ranks are perfected in the Three.\nThe One is the root of the myriad things,\nwhile the Three threads the order of the Two Modes.\nWhen the Two Modes join in virtue, the Three Luminaries shine forth in brilliance,\nrightly governing day and night with constancy,\nand circulating the four seasons without error.\nVast as the four seas, they distinguish the auspices and calamities of each region;\nsubtle as the single body, they fuse year and fate to mold and refine.\nThus, the stars and lunar lodges follow the Yang’s path in their celestial courses,\nwhile fortunes, destinies, lifespans, and wealth belong to the celestial offices that govern reckoning.\nNobility and humility are apportioned by fate,\nand all fortunes and misfortunes arise in due time—none but are bestowed by decree.\n\nNow, the officiant [Name] rejoices in encountering an era of prosperity,\nborn in an age of radiant clarity.\nHis life’s fortune, destiny, and wealth are surely due to the illumination of the heavens;\nhis qi, form, and substance are blessed to inherit the harmony of primordial balance.\nAware of such favor, he stands in awe and reveres the precepts,\npurifying the sacred altar to offer blessings,\nand upholding the rites with solemn devotion.\nLooking up to the imperial will, he presents this solemn observance at the appointed hour.\n\nThe sun’s chariot halts its course, and the jade heavens dispel all vapors.\nThe sunflower’s shadow stands true without deviation,\nand the gnomon’s measure shines clear and unmistakable.\nBy verifying the height of the midday sun, one deeply attains its fitting moment;\nby observing the slant of its rays, one transcends all ordinary dwelling.\nThe adept employs this to enter emptiness and stillness,\nwhile the sage uses it to govern the world as an enduring principle.\nThis very moment of alignment secretly accords with wondrous transformation.\n\nNow, at the hour of high noon, as the Dao is practiced,\nthe assembly of ritualists, invoking the Dharma,\nconveys the first pinch of incense.\nMay this fragrant smoke ascend directly to the realm of the Three Purities.\n\nWe, your servants, prostrate body, spirit, and life,\nbowing our heads to the ground.\nReverently relying on the Three Supreme Ones of the Great Highest,\nwe dedicate the merit of this incense offering\nto the reigning emperor, praying that:\nthe Nine Ancestral Shrines be filled with blessings,\nand the Three Luminaries bestow their favor.\nMay he embody the benevolence of Yao, extending its radiance to the four quarters,\nand continue the Way of Zhou, bringing its grace to the ten thousand regions.\nMay he sheathe bows and arrows to still all warfare,\ncultivating culture and laying aside arms;\nreduce punishments and lighten taxes,\nenriching customs and bringing peace to the age.\nMay the pure wind be renewed,\nand the distant antiquity be once more illumined.",
      "overlap_context": "ord of the Great One,\nThe Lord of the Eastern Marchmount’s Upper Minister, Controller of Destinies, the Two Perfected Lords Mao and Ding, Recorders of Lifespans,\nThe Divine Immortals who have attained the Dao in the Sacred Mountains and Grotto-Heavens,\nAll the Perfected and Numinous Beings of the Three Realms’ officialdom.\n\nThis servant has heard:\nWhen the true wind prevails, one’s duty encompasses the essentials of the Dao.\nYet wisdom does not suffice to comprehend all that is seen and heard...",
      "start_char": 566,
      "end_char": 1075,
      "start_sentence": 24,
      "end_sentence": 57,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.336578845977783,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\罗天大醮午朝科.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "今故烧香，自皈依道尊大圣众至真之德。 得道之后，保天长存。 以今临午行道，请法众等，运兹二捻上香。 愿此香烟腾空，径上供养三界十方、诸天大圣、斋官三代祖先亡过魂识。 伏愿阴境开明，阳魂审定。 洞观无碍，见真谛之皆空； 反本还元，湛神襟之似海。 参驾九苞之凤，导迎十绝之幡。 游宴清都，超生乐国。 今故烧香，自皈依经尊大圣众至真之德。 得道之后，升入无形。 以今临午行道，请法众等，运兹三捻上香。 愿此香烟腾空，径上供养灵山海岳、得道神仙、合家人眷、本命元辰。 伏愿景命缉熙，晨风扇祉。 寿考延洪於星舍，康荣厚卫於生经。 蔼蔼高门，时臻吉事； 振振后绪，益炽徽声。 和顺肃雍，乐育文明之化国； 腾酿振起，隆光礼义之名家。 储庆有余，延禧可大。 今故烧香，自皈依师尊大圣众至真之德。 得道之后，与道合真。 唱方 忏悔",
      "translated_text": "Now, therefore, we burn incense,\nreturning to the virtue/power of the Dao, the Venerable, the Great Sage Host, and the Perfected Ones of the Highest.\nAfter attaining the Dao, may they preserve Heaven and endure forever.\n\nAt this noon hour of ritual practice,\nwe, the assembly of the Dharma, offer this second pinch of incense.\nMay its fragrant smoke ascend directly to make offering to the Three Realms and the ten directions,\nto all the Heavenly Great Sages,\nand to the three generations of ancestors and departed spirits of the officiating patrons.\nWe humbly pray that:\nthe yin realms be illumined,\nand the yang souls be settled in clarity.\nWith unobstructed vision, may they perceive the emptiness of all true principles;\nreturning to the root and restoring the origin, may their spirit-minds become as vast as the sea.\nMay they mount the nine-plumed phoenix,\nand be guided by the ten-streamered banners.\nRoaming and feasting in the Pure Capital,\nthey transcend birth and enter the Land of Bliss.\n\nNow, therefore, we burn incense,\nreturning to the virtue/power of the Sutra, the Venerable, the Great Sage Host, and the Perfected Ones of the Highest.\nAfter attaining the Dao, may they ascend into the formless.\n\nAt this noon hour of ritual practice,\nwe, the assembly of the Dharma, offer this third pinch of incense.\nMay its fragrant smoke ascend directly to make offering to the sacred mountains and oceanic peaks,\nto the realized immortals and perfected transcendents,\nto the entire household and kin,\nand to the original destiny of the patron’s life-star.\nWe humbly pray that:\ntheir bright mandate be radiant,\nand the morning breeze spread blessings.\nMay longevity be prolonged in the celestial lodges,\nand robust health and flourishing prosperity be secured in the course of life.\nMay their noble house flourish abundantly,\never attaining auspicious affairs;\nmay their illustrious descendants thrive,\ntheir glorious renown ever increasing.\nIn harmony and reverence, may they delight in the civilizing influence of culture and learning;\nwith soaring vigor and rising splendor, may they exalt the renown of their family in rites and propriety.\nMay their store of blessings be abundant,\nand their prosperity ever expanding.\n\nNow, therefore, we burn incense,\nreturning to the virtue/power of the Master, the Venerable, the Great Sage Host, and the Perfected Ones of the Highest.\nAfter attaining the Dao, may they unite with the Dao in truth.\n\nChanting the directions, we confess and repent...",
      "overlap_context": "rines be filled with blessings,\nand the Three Luminaries bestow their favor.\nMay he embody the benevolence of Yao, extending its radiance to the four quarters,\nand continue the Way of Zhou, bringing its grace to the ten thousand regions.\nMay he sheathe bows and arrows to still all warfare,\ncultivating culture and laying aside arms;\nreduce punishments and lighten taxes,\nenriching customs and bringing peace to the age.\nMay the pure wind be renewed,\nand the distant antiquity be once more illumined.",
      "start_char": 1075,
      "end_char": 1421,
      "start_sentence": 58,
      "end_sentence": 81,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.91207766532898,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\罗天大醮午朝科.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "命魔 三启颂 三礼 重称法位 具位　与临坛官众等，谨同诚上启：三境至尊、十方上圣、玉京金阙天帝天真、十方师尊圣众、三界官属、一切威灵。 臣闻：空相无门，外形声而致祷； 道心有感，因视听以发机。 常无为而无不为，善救物而无弃物。 臣等量惟至浅，德亦甚孤，进道阶梯，渺然无际，修真事业，岂日有为。 独抱不移之愚，欲探无名之赜。 故每推诚之尽节，必须后己以先人。 思济苦轮，宜宣妙范。 令时斋官某夙膺重契，仰戴大明，保俭安淳。 早服事天之啬，洁精澄虑； 不忘祗戒之勤，严奉科条。 肃明里祀，兰缸启夜，想像星垣，梵韵腾空，声闻霄极。 冀款五明之仙驭，少停三境之宸游。 昭格上元，启陈无极。 恭望皇穹上帝、圆极高真、法界仙灵、罗天上圣。 芝軿炜晔，千官络绎以周流； 圣算无疆，保固山河而作镇。 斋官某伏愿百灵拱卫，五物防闲。 捍厄扶衰，屏妖魔之故气； 延龄益算，沐仙圣之余光。 福严运用以时新，祸掩行藏而日替。 操守，克全於富盛； 温参，允着於名闻。 家以庆传，人从行显，见存长幼，咸享欢康，过去宗亲，悉蒙开度。 城隍里社，翊卫灵坛。 符使功曹，肃清黄道。 各效功勤之力，伫升品秩之阶。 一切含生，俱沾法润。 上明天尊大慈之泽，下副臣等皈命之诚。 谨启以闻。 发愿 一愿灵光下烛，二愿道月扬辉，三愿恩宣九地，四愿诚达天威，五愿真灵俱会，六愿道炁周围，七愿天堂开敞，八愿地狱隳摧，九愿玄功普被，十愿驾景空飞，十一愿普天怀德，十二愿道化无为。 复炉 存神烧香",
      "translated_text": "With the Invocation of the Life-Spanning Demons, the Triple Hymn, the Triple Bows, and the Repeated Recitation of the Dharma Titles, we, the officiants and all assembled before the altar, reverently and with one heart, address the following supplication:\n\nTo the Supreme Ones of the Three Realms, the Sagely Hosts of the Ten Directions, the Heavenly Perfected and Celestial Emperors of the Jade Capital and Golden Gates, the Venerable Masters and Sagely Assemblies of the Ten Directions, the Officials of the Three Realms, and all majestic numina:\n\nWe have heard that the formless void has no gate, yet through external forms and sounds, prayers are offered; the heart of the Dao is responsive, for through seeing and hearing, the trigger of resonance is sprung. Ever non-acting yet never failing to act, it skillfully saves all beings without abandoning any.\n\nWe, however, are of the shallowest capacity, our virtue all too meager. The steps toward the Dao stretch boundlessly before us, and the work of cultivating the Real can scarcely be accomplished in a day. Clinging to an unshakable folly, we yet seek to plumb the unfathomable depths of the Nameless. Thus, in every act of utmost sincerity, we must place others before ourselves. To deliver beings from the wheel of suffering, we must proclaim the wondrous model.\n\nThe present sponsor of this retreat, so-and-so, has long borne a profound karmic bond, reverently gazing up to the Great Luminosity, preserving frugality and fostering tranquility. Early on, they embraced the frugal virtue of serving Heaven, purifying their essence and clarifying their thoughts; never forgetting the diligence of reverent precepts, they strictly uphold the statutes and ordinances. Solemnly they conduct the rites of their village, kindling orchid-oil lamps at night; in imagination, they ascend to the starry firmament, where the sounds of Sanskrit chanting soar to the heavens, their voices reaching the celestial vaults.\n\nWe pray that the chariots of the Five Luminaries may briefly pause in their circuits through the Three Realms, that the radiance of the Supreme Origin may be made manifest, and that our supplications may reach the boundless. With reverence, we look up to the August Heavenly Emperor, the Perfected Ones of the Highest Sphere, the Immortal Hosts of the Dharma Realm, and the Sagely Assemblies of the Celestial Net.\n\nMay their divine chariots gleam with resplendent luster, as the thousand officials move in ceaseless procession; may their sagely calculations know no limit, firmly securing the mountains and rivers as their guardians. For the sponsor of this retreat, so-and-so, we humbly pray:\n\nMay the hundred spirits surround and protect them, the five agents guard and restrain. Warding off calamity and supporting decline, they dispel the stale qi of demons and malevolence; prolonging life and increasing destiny, they bathe in the lingering radiance of the Immortals and Sages. May fortune, stern in its operation, be ever renewed with the seasons; may misfortune, concealed in action and repose, daily recede. In their conduct, may they fully preserve prosperity and abundance; in their gentle demeanor, may they be truly renowned in fame. May their household transmit blessings, and their persons be known through their deeds. May all living kin, young and old, enjoy joy and well-being; may past ancestors and kindred all be delivered. May the city gods and village spirits protect the numinous altar; may the talisman messengers and merit officers purify the Yellow Path. Each contributing their diligent efforts, may they await promotion in rank and grade. May all sentient beings partake of the moisture of the Dharma, that above, the great compassion of the Heavenly Worthy may be made manifest, and below, our own reverent sincerity may be fulfilled.\n\nWe respectfully present this supplication for your hearing.\n\n**Vows:**\nFirst, may the numinous light shine down;\nSecond, may the moon of the Dao cast forth its splendor;\nThird, may grace be proclaimed throughout the Nine Lands;\nFourth, may sincerity reach the majesty of Heaven;\nFifth, may the true numina all assemble;\nSixth, may the qi of the Dao pervade all;\nSeventh, may the Heavenly Halls be opened wide;\nEighth, may the Hells be shattered and destroyed;\nNinth, may the mysterious workings be universally bestowed;\nTenth, may the chariots of light soar through empty space;\nEleventh, may all under Heaven cherish virtue;\nTwelfth, may the transformation of the Dao be non-acting.\n\nThe incense burner is replenished; we concentrate our spirit and burn incense.",
      "overlap_context": "e civilizing influence of culture and learning;\nwith soaring vigor and rising splendor, may they exalt the renown of their family in rites and propriety.\nMay their store of blessings be abundant,\nand their prosperity ever expanding.\n\nNow, therefore, we burn incense,\nreturning to the virtue/power of the Master, the Venerable, the Great Sage Host, and the Perfected Ones of the Highest.\nAfter attaining the Dao, may they unite with the Dao in truth.\n\nChanting the directions, we confess and repent...",
      "start_char": 1421,
      "end_char": 2036,
      "start_sentence": 82,
      "end_sentence": 119,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.020198822021484,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\罗天大醮午朝科.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "香官使者、左右龙虎君、侍香诸灵官，当令臣向来午朝升坛行道之所，自然生金液，丹碧芝英，百灵众真，交会在此，香火炉前。 当愿十方仙童玉女，接侍兰筵，传臣向来所奏之诚，速达径上至真无极大道、三清上圣、昊天至尊金阙玉皇上帝御前。 罗天大醮午期科竟",
      "translated_text": "May the Incense-Official Envoys, the Lords of the Left and Right Dragon-Tiger, and all the attendant spirit-officials of incense cause this place—where we have ascended the altar at the noon audience to perform the Dao-ritual—to naturally generate golden liquor, cinnabar-green mushroom blossoms, and the assembled host of the hundred numina and perfected beings, all gathered here before the incense burner. May it be vouchsafed that the jade maidens and immortal youths of the ten directions attend the orchid banquet, and swiftly convey the sincerity of our supplication directly upward to the presence of the Utmost True, Boundless Great Dao; the Three Clarities and Supreme Sages; and the August Heavenly Venerable, the Jade Emperor of the Golden Portal in the Highest Heaven. The grand offering of the Luo Heaven, performed at the noon hour, is now concluded.",
      "overlap_context": "esty of Heaven;\nFifth, may the true numina all assemble;\nSixth, may the qi of the Dao pervade all;\nSeventh, may the Heavenly Halls be opened wide;\nEighth, may the Hells be shattered and destroyed;\nNinth, may the mysterious workings be universally bestowed;\nTenth, may the chariots of light soar through empty space;\nEleventh, may all under Heaven cherish virtue;\nTwelfth, may the transformation of the Dao be non-acting.\n\nThe incense burner is replenished; we concentrate our spirit and burn incense.",
      "start_char": 2036,
      "end_char": 2159,
      "start_sentence": 120,
      "end_sentence": 122,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.353788137435913,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\罗天大醮午朝科.txt",
        "category": "威仪类"
      }
    }
  ]
}