{
  "source_id": "翊圣保德传",
  "source_file": "chunked_daozang\\翊圣保德传.json",
  "total_chunks": 15,
  "total_original_chars": 12764,
  "total_translated_chars": 78911,
  "total_translation_time": 409.2094419002533,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\翊圣保德传.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Hagiography of the Protector of Virtue and Upholder of Sageliness**\n\n**Scripture Title:** *The Hagiography of the Protector of Virtue and Upholder of Sageliness*\nThree scrolls. Compiled by Wang Qinruo of the Song Dynasty. Base text from *The Orthodox Daoist Canon*, Proper Section I. Collated with the *Daoist Canon Compendium* edition.\n\n**Scroll One of The Hagiography of the Protector of Virtue and Upholder of Sageliness**\nCompiled by Wang Qinruo, Duke of Taiyuan, Grand Preceptor with Equal Standing to the Three Excellencies, Joint Manager of Affairs of the Secretariat-Chancellery, and Pillar of State, under imperial command.\n\n**The Perfected Lord, Protector of Virtue and Upholder of Sageliness.**\nAt the beginning of the Jianlong era, Zhang Shouzhen, a commoner from Zhengwu County in Fengxiang Prefecture, was traveling in the Zhongnan Mountains when he suddenly heard a voice calling him from the void, its tone clear and resonant. Startled, Shouzhen looked around but saw nothing. He walked cautiously, straining to listen, and after several *li*, heard the voice again: \"If you go first, I shall follow behind.\" This continued for days, leaving Shouzhen perplexed.\n\nUpon returning home, he heard a voice in his chamber say: \"I descend by imperial mandate to manifest my numen. Why are you so obstinate, refusing to heed my words? Were it not for the great affairs of the Song Dynasty, I would have already reduced you to dust.\" Shouzhen, both astonished and fearful, asked: \"I do not know which stellar deity has deigned to descend. My nature is foolish and dull; I pray the divine one will not overbear me, and I shall surely serve without fail.\"\n\nThe voice replied: \"I am the Great Sagely Minister of the Jade Emperor of the Highest Heaven, sent to ride the dragon and descend into the world. Only a man of uprightness can serve me. I see that you possess an extraordinary bone structure, unlike the common folk. You must reverently follow my teachings.\" Shouzhen said: \"I have heard that among men it is called *wu*, and among women *xian*. Though I dwell in the realm of the ordinary, I am ashamed to be counted among such.\"\n\nThe voice declared: \"I am a celestial deity, not some ghost or specter. The Five Peaks and Four Waterways are under my command. If you turn your heart to the Dao and diligently offer incense and fire, I shall cause you to answer the summons of a great nation and receive the favor of a true sovereign. How could I be the same as those *wu* and *xian*?\" Shouzhen replied: \"Since the divine one instructs me thus, how dare I not serve with reverence?\" He then prepared wine and meat as offerings.\n\nThe voice spoke again: \"I am a divine being. Why do you defile me with such foul offerings? As you are ignorant, I shall not punish you. Henceforth, offer only fragrant tea, vegetarian fare, and fresh fruit. Though I do not consume them, your intent is what matters.\" Shouzhen bowed deeply in apology.\n\nThe voice continued: \"I am your celestial master. You shall also have a master in the human realm. Seek a lofty scholar to receive ordination.\" Shouzhen then paid homage to Master Liang Quan of the Ancient Louguan Abbey as his teacher and was ordained as a Daoist priest. He selected a vacant plot beside his home, spent his family’s wealth, and constructed the Palace of the Northern Emperor, erecting a hall within to serve the deity. Morning and night, he made offerings with utmost devotion.\n\nThe deity said to him: \"Seeing your sincerity and adherence to my teachings, you are a man of integrity, capable of dispelling evil. First, I shall teach you the sword method, that you may expel demons for the people. Later, I shall instruct you in altar rites, that you may pray for the nation’s blessings.\" Shouzhen bowed twice and replied: \"I am but a humble and foolish man, yet by some karmic fortune, I have now found refuge. With utmost devotion, I shall forever uphold the altar rituals and sword methods, awaiting your divine instructions.\"\n\nThe Perfected Lord said: \"There are three sword methods. Use copper, iron, or steel to forge a sharp blade, and with a single glance from me, it shall be ready. For those afflicted by illness, have them wield it, and the pathogenic *qi* shall be dissolved without harm to the person. If earth deities cause calamity, aquatic creatures spawn demons, or the celestial regions bring disaster, troubling the state, employ the *upper sword* to remedy it. For mountain and marsh specters, or fierce flying and crawling creatures that terrorize the realm and poison the people, use the *middle sword*. For *chimei* and *kuilei* spirits that cling to evil, harming beings and bringing misfortune, use the *lower sword*.\"\n\nShouzhen said: \"I have received your teaching on the three swords. I await instruction on the altar rites.\" The Perfected Lord replied: \"There are nine altar methods. The upper three are established for the state:\n\n1. **The Altar of Following Heaven and Prospering the Nation** – For a grand universal offering, arraying 3,600 stellar positions. Banners, mirrors, swords, bows, arrows, and ritual implements are arranged in order, with gates opened and protocols observed.\n2. **The Altar of Extending Blessings and Preserving Life** – For a celestial offering, arraying 2,400 stellar positions. Ritual implements and protocols are one rank lower than the upper altar.\n3. **The Altar of Praying for Harvests and Timely Blessings** – For a universal net offering, arraying 1,200 stellar positions. Ritual implements and protocols are one rank lower than the middle altar.\n\nIf time does not permit for these three altars, one must still prepare pure and elegant prayers, rare flowers and fruits, strike the drum to summon the deities, and offer earnest supplications. Burning incense nine *chi* above the ground to present petitions may also evoke a response.\n\nThe middle three altars are established for officials:\n\n1. **The Yellow Register Altar of Extending Longevity** – Arraying 640 stellar positions.\n2. **The Yellow Register Altar of Attaining Felicity** – Arraying 490 stellar positions.\n3. **The Yellow Register Altar of Dispelling Evil** – Arraying 360 stellar positions.\n\nThe ritual implements and protocols for these three altars differ in rank.\n\nThe lower three altars are established for scholars and commoners:\n\n1. **The Altar of Continuing Life** – Arraying 240 stellar positions.\n2. **The Altar of Gathering Blessings** – Arraying 120 stellar positions.\n3. **The Altar of Averting Disaster** – Arraying 81 stellar positions.\n\nThe protocols for these altars vary according to rank.\n\nBeyond these nine altars, there is also the **Altar for Responding to Circumstances**, which may array 64, 49, or 24 positions. The required ritual implements differ accordingly.\"\n\nThe scholar-gentry and common folk may undertake these rites according to their means. For instance, when commoners pray for the emperor’s protection, they should establish the **Altar of Praying for Grain and Felicity**, arraying 1,200 stellar positions. When beseeching blessings or averting disaster for parents or teachers, they may set up an offering altar, adjusting the scale as appropriate.\n\nGuardian Perfected received these teachings through reverent prostration, and thereafter, many verifications arose, though they cannot all be recorded. During the *Qiande* era, when Emperor Taizong was still the Prince of Jin, he had heard of the numinous responses and dispatched a trusted attendant with treasures, silk, incense, and candles to the palace to perform the offering. The messenger, having purified himself and burned incense, declared: “The Prince of Jin has long admired the divine marvels and wishes to present offerings and expand the halls. He also petitions for an official name to be bestowed.” The Perfected Sovereign replied: “In the future, when the era of the Peaceful Ruler arrives—the second sovereign of the Song—he shall build the **Supreme Clarity Palace of Great Peace**, erecting twelve grand halls. The stars of the Three Realms have their appointed times; this cannot be lightly discussed. Simply inform the Prince that this palace’s construction has already been decreed by Heaven, with a fixed year and month—though the time is not yet ripe.” The messenger returned and reported this to Taizong, who was astonished and ceased his inquiries.\n\nEmperor Taizu had also heard of these matters but remained skeptical. He sent an envoy bearing incense, candles, and a written prayer to the palace to perform the rite. Later, he summoned Guardian Perfected to court to question him in detail. Guardian Perfected recounted everything, adding: “Without utmost sincerity, the gods will not descend.” He further reported the recent descent of the Supreme Sage in full. Taizu summoned a young eunuch to whistle mockingly nearby and said to Guardian Perfected: “Are the words of gods and men truly like this?” Guardian Perfected replied: “If Your Majesty deems my words deceptive, I beg to be examined and executed in the marketplace, lest such speech profane the Supreme Sage.” Taizu ordered Guardian Perfected to remain at the **Jianlong Abbey**. The next day, he dispatched the eunuch Wang Jien to perform the offering. After some time with no response, Jien bowed again in earnest prayer. Soon after, the Perfected Sovereign descended and declared: “I am the High Heavenly Great Sage, Minister to the Jade Emperor, sent by decree to guard the Song’s altars and secure its enduring foundation—not some mountain sprite or forest demon. Yet you send a whistling boy to compare my words? This is unacceptable. Simply tell the sovereign that the celestial palaces are already completed, their jade gates aglow. The Prince of Jin possesses a benevolent heart.” (He repeated, “The Prince of Jin possesses a benevolent heart,” and spoke over a hundred more words.) Jien, trembling with fear, dared not conceal anything and recorded it all before reporting to Taizu. He also recounted the clarity of the divine voice, which left all who heard it in awe. Taizu fell silent, struck with wonder. This occurred on the evening of the nineteenth day of the tenth month in the ninth year of *Kaibao*.\n\nThe following day, Taizu passed away, and Taizong ascended the throne. Soon after, he summoned Guardian Perfected to the **Qionglin Park** to perform the **Grand Offering of the Celestial Circuit**, establishing the **Altar of Prolonging Fortune and Preserving Life**. After the rite, the Perfected Sovereign descended and spoke to the eunuch Wang Jien: “I have words for you to relay to the emperor.” He said:\n\n> In the first year of *Jianlong*, by imperial decree,\n> I descended on dragon-back to guard the lord of men.\n> Sweeping away demons was but a trifling task;\n> I set the cosmos aright and established the firmament.\n> The nation’s fortune has risen, and peace reigns long;\n> The people rejoice in their labors, preserving their celestial nature.\n> The eight directions offer tribute and bow in submission;\n> Myriad spirits tremble and prostrate themselves as subjects.\n> When the imperial kinsmen celebrate longevity, they must burn incense and pray,\n> Passing down reverence and purity toward ruler and kin.\n> I command a swift legion of one million,\n> And countless divine officials in the billions.\n> Those who act with loyalty and filial piety shall receive my blessings;\n> Those who act with rebellion shall surely be punished.\n> Rewards and punishments shall be meted out with perfect equity,\n> So that Heaven remains unstained and Earth free of dust.\n> Loving the people and governing the state surpasses all previous ages;\n> The foundation of ten thousand years shall forever renew.\n\nJien recorded these words on bamboo slips and reported them to Taizong the next day. Upon reading them, Taizong was astonished and bowed in gratitude, saying: “This is the fortune of our house and the blessing of our ancestral temples. We humbly receive the Supreme Sage’s edifying words.” He ordered the text sealed and stored in the inner palace.\n\nSoon after, he dispatched the Palace Attendant Wang Shoujie and the Recorder of the Imperial Presence Wang Guicong to build a palace at the foot of Mount Zhongnan. As they were selecting the site at Zhongnan’s town, the Perfected Sovereign suddenly descended and spoke to Guicong and the others: “This is the place to build the palace of the Supreme Emperor. It cannot be changed.” Thus, the site was fixed. After three years, the palace was completed. At its central axis stood four grand halls: the **Hall of the Jade Emperor’s Luminous Passage** at the front, followed by the **Purple Tenuity Hall**, the **Seven Primes Hall**, and the **Hall of the Perfected Sovereign’s Presence**. To the east of the main halls were the **Four Halls of Heavenly Penetrating, the Nine Luminaries, the Eastern Dipper, and the Three Officials of Heaven, Earth, and Water**. To the west were the **Four Halls of Perfected Warrior, the Twelve Celestial Stems, the Western Dipper, and the Heavenly Ministries**. Additionally, there were the **Hall of the Divine Officials**, the **Dragon Hall**, the **Pavilion of the Southern Dipper**, and images of all the stellar deities. Two towers for hanging bells and scriptures were erected, along with halls for fasting and Daoist chambers—all fully equipped. A stele was erected to record the events, inscribed with the name **Supreme Clarity Palace of Great Peace**, exactly as the Perfected Sovereign had foretold. Taizong appointed a regular court official to oversee the palace and selected Daoist priests to conduct the rites. Every year, during the Three Primes, the emperor’s birthday, and the day of his celestial destiny, envoys were sent to perform offerings. On the evenings of the rites, the emperor would gaze toward the palace and bow in reverence. In times of flood or drought, or when the state was about to undertake major affairs, urgent prayers were offered there.\n\nWhen the palace was first completed, the Perfected Sovereign suddenly descended and addressed Wang Guicong and the others: “You have diligently carried out the imperial decree in building this palace. Yet why have you not opened the **Gate of Sun and Moon Splendor**? Why have you left the walls of the eight minor halls unpainted and the steps, walls, and Sanskrit inscriptions incomplete? You sought only hasty completion to curry favor. However, Heaven will neither conceal your merit nor absolve your fault.” Shoujie and Guicong were deeply alarmed, but as the project had already been reported complete, no further additions could be made. They could only bow in apology and depart. Upon returning to court, both were promoted in rank and rewarded with a thousand taels of silver.\n\nSoon after, Shoujie fell ill and died, while Guicong perished by the sword. Thus was the warning made clear: Heaven neither conceals merit nor absolves fault.\n\nAt the beginning of the Taiping Xingguo era, Emperor Taizong personally led the campaign against Taiyuan. The Perfected Sovereign suddenly descended and addressed Shouzhen, saying: “The Emperor has already arrived at Fen and Jin. Before long, the city will be retaken. You must instruct the supervising officials to prepare a grand offering to give thanks to the Supreme Emperor for this victory.” Shouzhen and the others replied: “This concerns the great affairs of state. We beg to wait for news of victory.” The Perfected Sovereign said: “Heaven has already determined the outcome of victory and defeat.” Within ten days, the imperial army reported triumph. The supervising officials informed the Emperor, who dispatched the eunuch Lu Wenshou with treasures from the inner treasury—incense, medicinal herbs, imperial calligraphy, and liturgical texts—to the palace, where a grand offering was held to give thanks to the Supreme Emperor.\n\nThat evening, the Perfected Sovereign descended again and said: “The Emperor’s grand offering has brought joy to the Supreme Emperor and all the heavens. The imperial destiny shall endure far beyond that of the Tang.” In the sixth year of Taiping Xingguo, Shouzhen attended court to offer congratulations on the Qianming Festival. Summoned for an audience, he presented a memorial, saying: “The sagely Perfected One has descended to bless our flourishing dynasty. I humbly request that an edict be issued to bestow an honorific title, thereby manifesting its divine favor above.” His request was granted. Soon after, an edict was issued:\n\n> The deity of Taiping Palace, having received its mandate from the Supreme Heaven, descends in spirit to the mortal realm. Its fragrant offerings are presented, and its sacrificial blessings are manifest. It has greatly sheltered the people and repeatedly bestowed its majestic favor. It is fitting to confer a noble title in gratitude for its divine grace. Let the deity be enfeoffed as the **Lan Sheng General**.\n\nWhen the edict arrived at the palace, Shouzhen burned incense to announce it. The Perfected Sovereign suddenly descended and said: “You must ask the Emperor: *What sagely being does ‘Yi Sheng’ (Assisting the Sagely) assist?*” For days, Shouzhen was filled with doubt and fear, not daring to reply. The Perfected Sovereign descended again and said: “Simply report this to the Emperor. You will not be blamed.” Shouzhen then submitted a memorial detailing the matter. Upon reading it, Taizong summoned his close ministers and said: “The Jade Emperor’s assisting minister—the one he assists is the Supreme Emperor.” He instructed that this meaning be conveyed to Shouzhen so that he might relay it.\n\nWhen the imperial command was transmitted to the palace, Shouzhen proceeded to the hall, burned incense, and announced it. The Perfected Sovereign said: “This is correct.” In the seventh year, Shouzhen again attended court to offer congratulations. The Perfected Sovereign suddenly descended and said: “I have a message for you to convey to the Emperor:\n\n> When the Great Dao flourishes, dark schemes perish.\n> All the sages of the heavens rejoice.\n> The Song dynasty’s altars shall endure for ages,\n> As the era of Great Peace begins to rise.\n> Let the sovereign’s heart be upright and wise,\n> Loving the people and governing the state with care.\n> The foundation of ten thousand years shall ever renew,\n> Its golden branches and jade leaves never ceasing.\n\nShouzhen received this and reported it to the court. An edict was issued, bestowing upon him a purple robe and the title **Chongyuan Grand Master**.\n\nThereafter, whenever envoys were sent to perform offerings and announcements, if the Perfected Sovereign had any message, Shouzhen would secretly report it. At the beginning of the Zhidao era, the Perfected Sovereign suddenly descended and addressed Shouzhen, saying: “At the founding of the Jianlong era, I descended by the Supreme Emperor’s command to protect the times. Now the foundation is established, and the altars of state shall endure forever. An era of peace shall follow, with enlightened rulers succeeding one another. My time here has reached its end, and I shall return to the heavens. You will no longer hear my words. If the state should pray for blessings, simply purify the altar, burn incense, and face north to address me. Though I may not descend to speak, I shall bestow fortune and protect the imperial altars.”\n\nThe Perfected Sovereign added: “You have served me from my descent until now for thirty-five years, and your diligence has been great. The Supreme Emperor has issued a talismanic command appointing you as the **Lord of the Five Lands**. When this term is fulfilled, you shall ascend as an immortal official. Your time here will also be short.” From then on, the Perfected Sovereign no longer descended to speak.\n\nThe following year, on the sixteenth day of the intercalary seventh month, Shouzhen said to his disciples: “I have received the talismanic command. Now I shall depart.” With these words, he passed away.\n\nLater, when the new sovereign ascended the throne, the rites of veneration were faithfully observed as before. Upon receiving the *Yuanyou* era name, he performed the Feng and Shan sacrifices, and constructed the Jade Purity Radiant Response Palace. Within the palace, at the northwest corner of the Hall of Precious Talismans, the **Hall of Congealed Mandate** was built, and behind it, the **Pavilion of Congealed Mandate**, to enshrine the Perfected Sovereign.\n\nIn the seventh year of Dazhong Xiangfu, an edict was issued:\n\n> The unfolding of the precious mandate is borne by the supreme deity. In response to its wondrous signs, we reverently augment its august title. This is the great ritual of governance and the profound purpose of sheltering the people. Moreover, it assists in proclaiming the primal transformation, serving as a model for all spirits. It governs the hidden and the manifest among living beings, spreading its luminous majesty across the blessed lands. When the imperial foundation was first laid, it descended to govern and protect. From the late cultured sovereign to the present, it has continued to uphold the legacy of the ancestors, fulfilling its appointed role. Thus, we have repeatedly adorned its sacred halls and presented offerings of reverent praise. It has bestowed boundless fortune and aided the flourishing of our grand enterprise. Reflecting upon our humble self, who now inherits and governs this vast realm, we find that the rituals of veneration coincide with the mysterious workings of auspicious omens. In cherishing its hidden assistance, how dare we cease our reverence? Therefore, we further enhance its glorious title, striving to express our sincerest devotion to the supreme essence. We hope thereby to fulfill the rites of respectful offering, ensuring enduring peace for all beings. Hence, we issue this decree, commanding the ministers to deeply comprehend our intent and jointly proclaim this matter. Let the **Lan Sheng General** be granted the title **Yi Sheng Bao De Zhen Jun** (Perfected Sovereign Who Assists the Sagely and Protects Virtue).\n\n**Record of the Perfected Sovereign Who Assists the Sagely and Protects Virtue, Scroll One** (concluded)\n\n**Record of the Perfected Sovereign Who Assists the Sagely and Protects Virtue, Scroll Two**\nCompiled by Wang Qinruo, Duke of Taiyuan, Grand Mentor of the Heir Apparent, Grand Councilor, and Minister of the Three Departments, under imperial command.\n\nThe Perfected Sovereign’s descent into the world often involved bestowing teachings upon people, which were then recorded. Among the people of Qi and Yong, whenever malevolent spirits or monstrous beings caused extreme harm, they would sincerely submit petitions. The Guardian of the True [Dao] would then pray and, following the Sovereign’s instructions, set forth—none failed to be subdued. The miracles and proofs of efficacy were too numerous to record. What follows is an account of what has been transmitted:\n\nThe Guardian of the True once paid homage at the Jade Emperor’s grand hall and saw its plaque inscribed: *Hall of Pervading Illumination*. Not understanding its meaning, he burned incense and entreated, saying, “This humble one fails to grasp the significance of *Pervading Illumination*—dare I beseech the Perfected Sovereign’s teaching?”\n\nThe Perfected Sovereign replied: “The Supreme Emperor resides in the Highest Three Heavens, revered as the Lord of all heavens. All phenomena and the host of immortals bow before Him. He ascends the Golden Hall, and the hall’s radiance is wholly concentrated in the Emperor’s form; the Emperor’s radiance, in turn, illuminates the Golden Hall. Light pervades and penetrates all, leaving nothing unillumined—hence it is called the *Hall of Pervading Illumination*. The Lords of the Heavens, the myriad spirits in attendance, and the assembly of immortals, Brahmā, and Buddhas all come to pay homage. Gazing upon the hall, one sees only the Supreme Emperor, majestic within the great radiance. When the immortal ranks withdraw, the light disperses throughout the heavens.”\n\nThere was an old man named Wang, over seventy years of age, who in his youth had served a military commander but retired in his old age to Mount Zhongnan. He scorned absurd and deceitful matters, clenching his fists in indignation. Initially, he did not deeply believe in the Perfected Sovereign’s descent. Yet after witnessing the miraculous with his own eyes, he was moved to reverence. Thereafter, he visited the palace twice daily to burn incense and prostrate himself, never once neglecting his devotion, even amid wind, rain, frost, or snow.\n\nOne day, he suddenly urged the Guardian of the True to open the hall doors so he might gaze upon the Sovereign, burn incense, and weep, saying: “This old man has always been of unyielding spirit. In my youth, I served in the military and scorned demonic forces, ever upholding integrity. Through a hundred lifetimes of fortune, I have encountered the Supreme Perfected. Now, enfeebled and nearing my end, I wish only that after my passing, I may remain at your side to serve as your attendant—this would be more than enough.”\n\nThe Perfected Sovereign descended in speech and granted his request. Soon after, the old man passed away without illness.\n\nA few days later, the Guardian of the True suddenly heard a voice calling his name from the void beside the Hall of the Perfected Sovereign. It said: “...I am the Iron Wheel General. Why have you so utterly overlooked me?” The Guardian of the True looked up and asked: “The four generals who attend the Perfected Sovereign are ever present in the hall, and I have always revered them. I do not know which star or rank the Iron Wheel General holds.” The voice from the void replied: “I am the old man Wang. Once I made a most earnest vow, begging to serve at the Sovereign’s side. Now I have been accepted and appointed to oversee the iron wheel, ranking below the four generals. When you perform rites or offer sacrifices in the future, do not forget my name.”\n\nThe Perfected Sovereign once said to the Guardian of the True: “Whenever I traverse the heavens on my rounds, the various spirit officials, swift couriers, and soldiers in my retinue number over a million. Comets and malevolent omens, knowing where my procession arrives, all conceal their traces and flee far away. The peaks and ranges, the seas and rivers, can be summoned at my command—how could the world’s mere specters and demonic aberrations be worth counting? Out of regard for your integrity, I entrust you with the sword arts so that you may save the people from suffering and avert calamity. You must apply yourself with diligence, never growing lax or idle. Accumulate merit among the people, extend kindness to all things. Heaven observes all, and your name shall be recorded. But if you treat the Dao with negligence, take its teachings lightly, and fail to uphold emptiness and stillness, you will incur unseen retribution. If I were to grow angry, all things would instantly turn to dust—could you withstand that? Yet when you face punishment, it is only because the five lesser generals are displeased with your lack of devotion. You should show them due reverence. Whatever thoughts arise in you, they already know beforehand. Do not deceive yourself, lest you bring misfortune upon yourself.”\n\nOne day, the Guardian of the True burned incense with leisurely composure and reverently asked: “I have observed the teachings of the Buddha, which declare that in all the heavens above and the earth below, none surpass the Buddha. I wonder, above the Three Clarities, what rank and position do they hold? I humbly beg for your true words to dispel my ignorance.” The Perfected Sovereign descended in speech and said: “The Buddha is a sage who attained the Dao in the West. Among the Three Clarities, there is a separate realm where Brahmā resides. In relation to the Supreme Emperor, they are like the nine ministers serving the Son of Heaven in the mortal world.”\n\nThe Guardian of the True asked: “Yet his teachings have spread widely throughout the world—what is the reason for this?” The Perfected Sovereign replied: “The flourishing of a teaching depends on the Emperor’s will.” The Guardian of the True then asked: “Both Daoist and Buddhist scriptures have been handed down to the world. If one wishes to venerate and follow one of them, which will bring blessings?” The Perfected Sovereign said: “The *Scripture of the Dao and Its Virtue* encompasses all that is vast and embraces all that is minute. It refines the self and cultivates conduct, governs the family and rules the state. If people could grasp its essential meaning, fathom its wondrous use, and in all moments believe in it and practice it, they would not merely increase their blessings—there is nothing they could not attain. The Buddhist *Sutra in Forty-Two Sections* disciplines the mind and cultivates nature, eliminates greed and distances misfortune, imparts compassionate instruction and admonition, and demonstrates good and evil—it too is wholly aligned with the Dao. To follow it in seeking blessings would certainly bring boundless benefit. As for the Duke of Zhou and Confucius, both are ranked among the immortals, and the Six Classics and their commentaries contain the methods for governing the world and the arts of ruling the people—all is therein. Though the world recites them, few truly follow their teachings. If one’s mouth recites while the heart follows, and the heart follows while actions correspond, if the ways of benevolence, righteousness, propriety, and wisdom are always held in mind, then not only will human affairs be rectified, but the principles of long life and enduring vision are not far off.”\n\nThe Guardian of the True once again made a request: “In the Red Valley of Mount Zhongnan, there is a shrine to the valley spirit. The people of the nearby villages often make offerings there, slaughtering oxen and pigs for feasts, with wine and music clamoring loudly, and the common folk dancing. In such matters, do they receive protection?” The Perfected Sovereign said: “Mount Zhongnan is an imperial mountain and a land of imperial blessing. From ancient times to the present, the distinction between the sacred and the profane has always been clear. To invoke evil and summon demons, to kill living beings in pursuit of blessings—how could such acts bring protection? Later, bandits hid in the shrine’s vicinity, and those who hunted them piled brushwood and set it ablaze. The shrine was reduced to ashes, and no numinous signs remained.”\n\nAt the end of the *Jianlong* era, the scholar Liu Wan of Chang’an, who possessed considerable literary talent and stood out among his peers, once came to the hall, bowed twice, and earnestly prayed: “I wish to know whether my future rank and position will be high or low. I beg for a divine revelation.” The Perfected Sovereign descended in speech and said: “Heaven has bestowed upon you a literary nature but not an official’s rank. If you study the Dao and withdraw into seclusion, you may yet prolong your years. If you recklessly seek advancement, you will hasten your own end.” Liu Wan heard this, departed in displeasure, and three years later, he indeed died without having achieved success.\n\nDuring the *Yongxi* era, Master Chen Tuan of Mount Hua, known as the Recluse of Secluded Mystery, passed away in a stone chamber at Zhangchao Valley. Many in the world transmitted accounts of his ascension. Guarding Perfection paid homage at the shrine and, while burning incense, respectfully petitioned: “Master Chen Tuan of Mount Hua has recently died, and people say he achieved *shijie*—liberation through the corpse. Yet I dare not presume to know whether his merits and conduct have truly attained the ranks of immortality. I humbly beseech the Supreme Perfected to grant me a brief instruction.”\n\nThe Perfected Sovereign descended in speech and said: “Chen Tuan’s cultivation of *qi* and nurturing of spirit grasped the essentials. However, his merit in benefiting others was not yet complete; he merely held a specific office.”\n\nDuring the *Duan’gong* era, Gao Ningku, a *Bibu Langzhong* who served as prefectural governor of Fengxiang, once came to the hall to pay his respects. After he departed, the Perfected Sovereign suddenly descended in speech to the temple overseer, Li Zhu, saying: “Gao Ningku’s conduct lacks loyalty and sincerity. His death will not be long in coming.” Li Zhu secretly recorded this. Soon after, Gao Ningku completed his term and returned to the capital, where he was appointed a *San Si Pan Guan*. Upon hearing this, Li Zhu once again burned incense and petitioned: “Gao Ningku now holds this office—what good fortune does this portend?”\n\nThe Perfected Sovereign descended in speech and said: “Death is near.” Within months, Gao Ningku died.\n\nDuring the *Qiande* era, Minister of Personnel Song Bai resided in Zhengwu. He had a younger brother, small in stature, named Qige. At the age of ten, Qige was bewitched by a fox spirit, wailing uncontrollably and behaving erratically. At times, his strength rivaled that of several men, and his family could not restrain him. Every physician who came to treat him with acupuncture was beaten and driven away. Song Bai, purifying his heart, sent a trusted attendant to the temple to offer prayers and earnestly seek protection.\n\nThe Perfected Sovereign descended in speech and said: “Go. I shall send Guarding Perfection to him.” Guarding Perfection received the command and set out. Upon arriving at the household and sitting in the guest hall, Qige suddenly became flustered and disoriented. The family hurried out to greet and bow to Guarding Perfection. After questioning them in detail, Guarding Perfection sternly called Qige’s name. In an instant, Qige shook his head, and from within, a faint murmur emerged. He approached Guarding Perfection, trembling and drenched in sweat. Guarding Perfection rebuked the spirit, and after some time, the ghost revealed its form, kowtowing and admitting its guilt. Guarding Perfection executed it with a protective talisman, and the ghost perished at once. Qige collapsed to the ground and lay unconscious for a long while before reviving, fully restored to health.\n\nThe Perfected Sovereign once suddenly addressed Guarding Perfection: “At the shrine of Li Jing at the foot of the mountain, dozens of fox spirits have gathered. The local earth god has just sent an urgent report. Fearing they may harm the people, you must hasten to expel them.” Guarding Perfection received the command, took up his sword, and departed. In an instant, he arrived before the shrine and shouted several times in a voice like thunder. Soon, dozens of fox spirits emerged, lining up before him in fear and trembling.\n\nGuarding Perfection rebuked them: “This is a place where the Supreme Perfected descends. How dare you defile it? I do not wish to slay you now. Return swiftly to the forests and thickets, and do not stain my sacred sword with blood.” The spirits glanced at one another, then scrambled away in disarray. Guarding Perfection’s departure and return took scarcely any time at all.\n\nA Daoist residing at the temple, Wang Deyuan, asked where he had gone. Guarding Perfection recounted the events in full. Wang Deyuan said: “The journey there and back is twenty *li*—how could you have returned so quickly?”\n\nGuarding Perfection replied: “When I left the shrine, I swung my sword and cut a low-hanging branch from the courtyard tree. You may verify this.” At dawn, Wang Deyuan mounted his horse to investigate. Before the shrine, he detected a foul, putrid stench that made it impossible to approach. He retrieved the severed branch and returned, then bowed twice in astonishment.\n\nAt that time, several hundred fox spirits were causing disturbances in Dengzhou. Guarding Perfection, upon hearing this, burned incense and petitioned, recounting the matter in full and requesting permission to travel there and eliminate them.\n\nThe Perfected Sovereign descended in speech and said: “These fox spirits once transformed into the likeness of bodhisattvas in the Southern Mountains of Chang’an, deceiving local residents into offering wealth as alms. Yet among them, eight or nine out of ten have since turned their hearts toward goodness. For this reason, the Celestial Emperor granted them a mandate to serve as the earth gods of Dengzhou. Even among those like the Duke of Zhou and Confucius, who are ranked among the immortals, the methods of governing the world and ruling the people are all contained within the Five Classics and Six Classics. Though the world recites them, few follow their teachings. If one’s speech aligns with the heart, and the heart aligns with action—if the Way of benevolence, righteousness, propriety, and wisdom is always held in mind—then not only will human affairs be rectified, but the principles of longevity and enduring vision will be close at hand.”\n\nGuarding Perfection once again petitioned: “At the shrine of the Red Valley spirit in the Zhongnan Mountains, many from the nearby villages offer prayers, slaughtering oxen and pigs as offerings, with wine and music resounding loudly, and the people dancing in revelry. Do such acts bring divine favor?”\n\nThe Perfected Sovereign said: “The Zhongnan Mountains are an imperial mountain and a land of imperial blessing. From the common to the sacred, this has been true in all ages. To invoke evil and summon demons, to kill living beings and pray for blessings—how can such acts bring protection? They are far from it indeed.”\n\n...piled brushwood and set it ablaze. The shrine was reduced to ashes, and no numinous signs remained.\n\nAt the end of the *Jianlong* era, the scholar Liu Wan of Chang’an, who possessed considerable literary talent and stood out among his peers, once came to the hall, bowed twice, and earnestly prayed: “I wish to know whether my future rank and position will be high or low. I beg for a divine revelation.” The Perfected Sovereign descended in speech and said: “Heaven has bestowed upon you a literary nature but not an official’s rank. If you study the Dao and withdraw into seclusion, you may yet prolong your years. If you recklessly seek advancement, you will hasten your own end.” Liu Wan heard this, departed in displeasure, and three years later, he indeed died without having achieved success.\n\nDuring the *Yongxi* era, Master Chen Tuan of Mount Hua, known as the Recluse of Secluded Mystery, passed away in a stone chamber at Zhangchao Valley. Many in the world transmitted accounts of his ascension. Guarding Perfection went to pay homage and, while burning incense, respectfully petitioned: “Master Chen Tuan of Mount Hua has recently died, and people say he achieved *shijie* (release from the corpse). I humbly inquire whether his cultivation and conduct have truly attained the ranks of immortality, and beg the Supreme Perfected to deign to offer guidance.”\n\nThe Perfected Sovereign descended in speech and said: “Chen Tuan’s refinement of *qi* and nurturing of spirit grasped the essentials. Yet his merit in benefiting others was insufficient—he merely held a specific office. In the *Duangong* era, Gao Ninggu, a *Bibu Langzhong* (Vice Director of the Ministry of Justice) who oversaw Fengxiang Prefecture, once came to the palace to pay his respects. After he departed, the Perfected Sovereign suddenly descended in speech to the palace overseer Li Zhu, saying: ‘Gao Ninggu’s conduct lacks loyalty and trustworthiness; his death is not far off.’ Li Zhu secretly noted this. Soon after, Ninggu completed his term and returned to the capital to serve as a *San Si Pan Guan* (Judicial Officer of the Three Departments). Upon hearing this, Li Zhu again burned incense and petitioned: ‘Now that Gao Ninggu holds this position, what fortune does he possess?’ The Perfected Sovereign descended in speech and said: ‘Death is imminent.’ Within months, Ninggu died.\n\nDuring the *Qiande* era, Minister of Personnel Song Bai resided in Zhengwu. He had a younger brother, small in stature, named Qige. At the age of ten, Qige was bewitched by a fox spirit, wailing uncontrollably and behaving abnormally. At times, his strength equaled that of several men, and his family could not restrain him. Every physician who came to treat him with acupuncture was assaulted. Song Bai, with a purified heart, sent a trusted attendant to the palace to offer prayers and earnestly seek protection. The Perfected Sovereign descended in speech, saying: ‘Go. I shall send Guarding Perfection to him.’ Guarding Perfection received the command and set out. Upon arriving at the household and sitting in the guest hall, Qige’s agitation and disorder abruptly ceased. The family hurried out to welcome and bow to him. Guarding Perfection questioned them in detail, then sternly called Qige’s name. In an instant, Qige shook his head, and from within, a faint murmur emerged. He approached Guarding Perfection, trembling and drenched in sweat. Guarding Perfection rebuked him, and after some time, the ghost revealed its form, kowtowing and admitting guilt. Guarding Perfection executed it with a protective talisman, and it died instantly. Qige collapsed to the ground and lay unconscious for a long while before reviving, fully restored to health.\n\nThe Perfected Sovereign once suddenly addressed Guarding Perfection, saying: ‘At the Li Jing Temple beneath the mountain, dozens of fox spirits have gathered. The local earth god has just sent an urgent report. Fearing they will harm the people, you must hasten to expel them.’ Guarding Perfection received the command, took up his sword, and departed. In an instant, he sat before the temple and shouted several times in a thunderous voice. Soon, dozens of fox spirits emerged, arraying themselves before him in fear and dread. Guarding Perfection rebuked them, saying: ‘This is a place where the Supreme Perfected descends. How dare you linger here? I do not wish to slay you now. Return swiftly to the wilds, and do not defile my sacred sword with blood.’ The spirits glanced at one another, then fled in disarray, crawling away on all fours.\n\nFrom Guarding Perfection’s departure to his return, scarcely any time had passed. The palace-dwelling Daoist Wang Deyuan asked where he had gone, and Guarding Perfection recounted the events. Deyuan said: ‘From here to there is a round trip of twenty *li*. How could you have returned so quickly?’ Guarding Perfection replied: ‘When I left the temple, I struck a low-hanging branch of a tree in the courtyard with my sword. You may verify this.’ At dawn, Deyuan mounted his horse to investigate. Indeed, before the temple, he detected a foul, putrid stench that made approach impossible. He retrieved the severed branch and returned, then bowed twice in astonishment.\n\nAt another time, hundreds of malevolent foxes gathered in Dengzhou, causing strange disturbances. Guarding Perfection, upon hearing this, burned incense and petitioned, recounting the matter and expressing his willingness to follow the Perfected Sovereign’s command to eliminate them. The Perfected Sovereign descended in speech, saying: ‘These fox spirits once transformed into the likeness of bodhisattvas in the Southern Mountains of Chang’an, deceiving local residents into offering wealth as alms. Yet among them, eight or nine out of ten have since turned toward goodness. For this reason, the Celestial Emperor granted them a mandate to serve as the earth gods of Dengzhou. Their term has limits; when it expires, they will depart of their own accord and pose no further harm. You need not go.’\n\nDuring the *Kaibao* era, in the household of Chen Yingmei, a resident of Fengxiang Prefecture, a mountain sprite caused disturbances, hurling tiles and stones until the courtyard was filled. At times, it emitted smoke and flames, threatening to burn down the house. Wealth was squandered, and the family and relatives were consumed by sorrow.\n\nThey summoned ritual masters to perform exorcisms and commanded Buddhist monks to recite scriptures, yet none could halt the disturbances. The family then relocated to escape, but the sprite followed their tracks and arrived as well. At a loss, Yingmei fasted, purified himself, and bearing incense and fruit offerings, went to the temple to make a devout plea. The Perfected Lord descended and addressed Shouzhen, saying: \"Hasten to receive my command and go dispel this affliction.\"\n\nShouzhen bowed twice, strapped on his sword, and leapt upon his horse. After two nights’ journey, he arrived at the household. Yet the clamor of hurled tiles continued unabated. The onlookers thronged the path, all saying: \"This Daoist will surely fail to banish this sprite.\"\n\nShouzhen then washed himself with utmost purity, straightened his robes, drew his sword, and entered. Suddenly, the disturbances ceased. That evening, he erected an altar in the courtyard. Standing upon it with sword in hand, he called out in a measured yet stern voice: \"Where is the mountain sprite? If you persist in your mischief, come forth and contend with me. If not, you must depart ten thousand *li* away and I shall absolve your transgressions.\"\n\nFor some time, there was no response. From that moment on, the household knew peace and quiet.\n\nThen, accompanying Shouzhen, they journeyed to the temple to present offerings and give thanks.\n\nAnother wealthy household in Chang’an, the Yang family, was likewise plagued by a specter that hurled tiles and set fires, shifting its mischief a thousandfold in a single day. The entire clan lived in dread, finding no peace. At the time, there was a thaumaturge named Li Zhuogui, renowned for his mastery of talismans and exorcisms. The Yangs summoned him, but as he neared their gate, he was struck as if by some unseen force, crawling to his feet only to collapse again. This happened thrice before he fled in disarray.\n\nThe Yangs then invited a host of monks to perform a *daochang* ritual, chanting sutras and reciting mantras to purify the premises. Suddenly, their ritual implements were snatched away—some hurled onto the roof, others cast into the well—and the monks, seized by terror, fled. Even garments and washing stones took flight, rising into the air in twos and threes before tumbling into the courtyard. Whatever they struck remained unharmed. Such uncanny disturbances multiplied beyond recounting.\n\nHaving long heard of the True Lord’s divine power, the Yangs personally carried incense and candles in haste to the temple. There, they prostrated themselves, recounting the haunting and beseeching deliverance. The True Lord descended with a decree: “Return swiftly. I shall send Shouzhen to follow.”\n\nShouzhen bowed deeply and set out for the Yang residence. The onlookers—scholars and commoners alike—crowded the doorways. Shouzhen changed into fresh robes, adjusted his cap, spat water, and brandished his sword, pacing the four corners of the house. At once, the disturbances fell silent.\n\nShouzhen said to the Yangs: “The fiend is subdued. Prepare an offering to confirm its banishment.” That evening, they erected an altar and burned memorials. After the rites concluded, he departed. The entire city bowed in awe and praise.\n\nAfter Shouzhen returned, the Yangs followed him to the temple to present offerings in gratitude.\n\nThere was also a wealthy merchant named Liu Wenji who had fallen under the bewitchment of a fox spirit. His mind grew restless, his movements erratic. One day, he encountered a Daoist in the marketplace who said: “Your face bears the mark of a demonic presence. You must have been ensnared by an evil entity. The True Lord has descended—pray to him with utmost sincerity, and this affliction will surely be cured.”\n\nWenji then prepared incense and candles, rushing to the temple morning and night. On the road, he was pursued by spectral apparitions—sometimes monks or nuns, sometimes women, sometimes merchants—each assuming myriad forms to lure and obstruct him. Wenji, both bewildered and entranced, lost his way. He encountered another Daoist on the road and recounted his plight. The Daoist said: “These are all ghostly illusions. Press onward without hesitation, lest you fall prey to the malevolent spirits.”\n\nWenji’s mind cleared. Within days, he hastened to the temple, purifying himself and prostrating with utmost devotion. After a hundred bows before the altar, the True Lord descended with a decree: “I know of your long journey. I now command Shouzhen to expel the evil for you.”\n\nThat evening, Shouzhen stood Wenji in the courtyard. Wielding his sword and spitting water, he uttered sharp rebukes several times. Wenji, dazed, collapsed to the ground. After some time, he rose and said: “Just now, as you rebuked me, I saw several figures resembling divine generals, each seizing two ghosts and dragging them away.” Trembling with fear, Wenji had fainted without realizing it. Now, his spirit felt clear and refreshed, as if awakening from a deep intoxication. He bowed a hundred times and departed.\n\nThe *Central Transmission of the Venerable Protector of Virtue* concludes here.\n*Further Transmission of the Venerable Protector of Virtue*\n\nCompiled by Wang Qinruo, Duke of Taiyuan Commandery, Grand Mentor of the Heir Apparent, Grand Councilor of the Chancellery and the Secretariat, and Minister of Works of the Song Dynasty, who reverently undertook this task.\n\nSince the True Lord’s advent, officials and commoners alike have journeyed from afar—some sending forth sincere prayers from afar, others purifying themselves to prostrate in worship—all seeking the True Lord’s response, and at times, their pleas have been heard.\n\nFor the most part, his teachings adapt to each person’s nature and habits, offering guidance and admonition:\nTo ministers, he upholds loyalty;\nto children, he upholds filial piety.\nTo the pure and sincere, he imparts refined maxims;\nto the greedy and cruel, he warns with essential truths.\nHis words are simple and accessible, often harmonious in rhythm, yet those who hear them remain few.\n\nNow, based on what has been transmitted, we record them as follows.\n\nDuring the Qiande era, Feng Dongyuan, a Daoist of the White Deer Abbey on Mount Li, was paying homage when he lit incense and reverently addressed the True Lord: “Dongyuan has expounded the books of Confucius and followed the teachings of Laozi for many years, yet in cultivating the self and refining conduct, I have not grasped the true essence. Now, by the fortune of encountering a supreme sage, I dare to seek a single ancient teaching.”\n\nThe True Lord descended and spoke:\n\n\"Only upon reaching the realm does one know peace;\nwhen the form is busy, the numinous essence remains at ease.\nTrue emptiness must be illuminated and penetrated;\nthe subtle and profound lead to the great return.\nIn movement, observe without obstruction;\nprofound stillness harmonizes with nature.\nWhen merit is accomplished, the spirit becomes unfathomable,\nand transformations may ascend to the heavens.\nGoing and staying depend on oneself;\nthe Three Officials pardon past transgressions.\nThe Bureau of Destiny erases the record of sins,\nand the Six Dings report to the heavens above.\n\nAll beings who seek to cultivate the Dao\nmust know the primordial source.\"\n\nDongyuan bowed a hundred times, offered reverent thanks, and departed.\n\nDuring the Kaibao era, Attendant Censor Lu Chong, by imperial decree, governed Fengxiang Prefecture. He visited the abbey to pay homage and requested the Guardian of the True One to descend at the prefectural office, where he arranged an offering and prayed. That evening, after purifying himself and making his devotion, he said: \"Bound by my official duties, I am unable to pay direct homage to your true form. With these humble offerings, I reverently beseech your divine gaze and beg for true words to guide my ignorance.\"\n\nThe True Lord descended and spoke:\n\n\"Exert yourself in serving your lord to be a loyal minister.\nDo not covet ill-gotten wealth, nor heed wicked affairs.\nRectify the penal code and govern the mountains and rivers;\nrelieve and heal the people.\nAct in accord with the kingly Way, and you shall ultimately be a fortunate man.\nAccumulated transgressions become calamities, and surely lead to sinking and drowning.\n\nAll beings possess a formless nature paired with a formed body.\nSince time immemorial, they have been unable to awaken themselves.\nYet there exists a world without limits, a land of unending day,\nwhere the primordial void merges, and the profound and obscure share the same principle.\"\n\nAgain, he said:\n\n\"Within the six directions and the universe,\nmost beings fail to comprehend.\nCreating karma, they proceed blindly,\nlike the blind groping across rivers and seas.\nBut with wisdom as your guide,\nyou may traverse a thousand seas.\"\n\nChong bowed again, recorded the words, and recited them.\n\nLeft Rectifier of Omissions Wang Gui, one day with a purified heart, visited the abbey. He lit incense and earnestly prayed: \"Though I am but a lowly and flawed being, burdened with endless faults, I am fortunate to encounter a supreme perfected one. I humbly beg for divine instruction—how may I cultivate myself to attain long life?\"\n\nThe True Lord descended and spoke:\n\n\"I urge you to cultivate and refine—nothing surpasses diligence.\nWithout ceasing in diligence, even the highest sages will take heed.\nWhen the era of Great Peace arrives, martial and civil arts will flourish.\nWithout civil arts, there is no rectitude; with them, the lord is benefited.\nEnjoy your stipend and profit, but do not defy the king’s command.\nAct with good fortune and virtue, yet remain in pure poverty.\nPure poverty resonates with heaven and earth;\ndefiled wealth is like fire cast upon ice.\nCast upon ice, the fire’s embers gradually fade.\nThose who accumulate evil pierce themselves through.\nPierced through, calamity extends to the seven generations,\nand in the earthly prisons below, suffering befalls kin.\n\nI dangle a thousand-foot rope to fish for those with remaining threads of life.\nThe Dao is revered, virtue is esteemed;\nthe Great Dao gives birth to all things.\nBeings’ heads resemble heaven, their feet resemble earth,\nand their center, empty and open, accords with the true principle.\nCarving doors and windows to make a dwelling,\nwithin the chamber there is one thing—\nneither shadow nor form, profound and obscure, unknown to people.\nIf one can recognize it, one attains longevity.\n\nYang resides in heaven, yin upon the earth;\nwhen the two qi harmonize, there is true significance.\nWithin the void, creation occurs naturally,\nand from nature, the ten thousand kinds arise.\nHeaven is not high, earth is not low;\nthe Great Dao blends with the principle of the primordial void.\nIf those who study the Dao wish to hear this,\nthis is the exalted gateway to cultivation.\"\n\nDuring the Kaibao era, Chancellor Shen Lun suffered from a prolonged external illness. With sincere devotion, he sent an emissary to the abbey to arrange an offering and make this entreaty: \"Lun is of impure and filthy constitution, afflicted by illness. How may I cultivate myself to escape this suffering? I dare to seek sacred words to guide my ignorance.\"\n\nThe True Lord descended and spoke:\n\n\"The numinous essence does not fall ill; the physical form finds peace on its own.\nWhen the physical form is ill, turn inward and observe.\"\n\nThe emissary recorded the words and returned to deliver them to Lun. Lun received and read them, exclaiming in surprise and joy, \"I have grasped it!\" Soon after, his illness was cured, and he sent another emissary to the abbey to offer thanks through ritual.\n\nDaoist Wang Deyuan, while traveling on Mount Zhongnan, lodged at the abbey. He diligently tended the incense and fire, cherished life, yet his temperament was narrow, and he often succumbed to anger. One day, the True Lord descended and addressed him:\n\n\"If you study the Dao and cultivate the true,\nfirst regulate and refine your nature to harmonize with heaven’s harmony.\nForget all deliberate action, do not dissipate your mind and consciousness.\nCultivate serenity and clarity, and the Dao will become visible.\"\n\nAgain, he admonished him:\n\n\"Do not manage what is within, nor what is without.\nIn coming and going, the true and empty are without obstruction.\nWhere you dwell in peace and joy is your home;\neach must diligently practice without waiting for others.\nDo not wait for others—\nthose who have already attained find no hindrance.\nIn the wondrous bliss of true emptiness lies heaven,\nwhere, in union with the sages, all sins are extinguished.\"\n\nAgain, he said:\n\n\"Subtle principles must be practiced to reach the goal;\nin all your movements, accord with the Dao.\nIn action, perceive true emptiness;\ntrue emptiness is without affliction.\nBlending with the primordial void,\nthere exists soundless music.\nIn the furnace of earth and the cauldron of heaven,\nturn your back on the mundane and return to the sagely Dao.\nConstantly observe with wisdom,\nand you may resolve it in this lifetime.\"\n\nDeyuan said: \"Overwhelmed by the True Lord’s descent and teachings, I do not understand the phrase 'in union with the sages, all sins are extinguished.' I humbly beg for further instruction.\"\n\nThe True Lord replied: \"If you eliminate affliction and enter stillness, refine your heart and cultivate the true, accumulating merit until the measure is full, the hundred joints of the Niwan Palace will open, and your primordial spirit will attain numinous communion, thereby uniting with the sages. The wondrous bliss of heaven will be everywhere accessible—how could any sins remain? Thus it is said, 'in union with the sages, all sins are extinguished.'\"\n\nDuring the Taiping Xingguo era, Li Zhu, Director of the Bureau of Imperial Carriages, once governed Fengxiang Prefecture. Having witnessed the numinous responses, he was soon reassigned by imperial decree to oversee the abbey, a post he held for over a decade with strict integrity. The True Lord descended and spoke to him on numerous occasions, though only a few of the recorded transmissions remain. One said:\n\n\"At the beginning of the Jianlong era, I received the mandate of profound stillness. The Supreme Emperor commanded that all the sages, including myself, descend riding dragons, accompanied by the constellations. The Five Peaks received their orders to govern, and the earthly deities secretly supported the state, aiding in the flourishing of the enlightened age. I wish for Li Zhu to know the time of my descent, but he must not lightly disclose it, lest he leak the celestial secrets.\"\n\nAnother time, the True Lord said:\n\n\"Work with me to uniquely aid the state; govern the people with me by the Dao/Way; manage your household with me through kindness and goodness; and remain sober without drinking. When awake, govern the people; when inebriated, govern the spirit. This is the method to prolong life and increase longevity—I urge you, Prefect, to remember it.\"\n\nAnother time, he said:\n\"To govern as an official, seek clarity and brightness;\nLet wisdom and insight together bring purity to affairs.\nObserve the heavens, act in accord with the Dao/Way, and align with hidden virtue;\nConsume the ruler’s salary with constant awe.\nFor me, purify your heart and renew your bones,\nTurn from the mundane, enter sageliness, and hasten toward long life.\nThe joys of the celestial palace surpass the mortal world—\nIn the land of eternal light, your name shall be inscribed.\"\n\nAnother time, he said:\n\"Prefect, you have been reborn in the Central Kingdom for many lifetimes.\nBe as upright and honest with me; do not act with crookedness.\nAccumulate goodness and merit with me; assist and support the enlightened ruler with me;\nWash clean the suffering of the common people with me; and keep in your heart the prisons and judgments with me.\nIf the Supreme Emperor knows of this, you shall be named a celestial official.\nDo not cling to the transient wealth of this world’s turning cycles—\nInstead, cultivate the tangible forms of practice,\nAttain merits that follow you in life,\nAnd gain boundless blessings.\nDo not linger in complacency with me—\nTime passes swiftly.\nThe numinous officials will reward your merits,\nAnd the celestial bureaus will augment your blessings.\nIf you follow my sacred words to the letter,\nYou shall surely prolong your years and increase your longevity.\"\n\nAnother time, he said:\n\"Though you reach seventy years of age,\nYour time in this world will not be long.\nEven if you live a hundred years,\nHow many autumns will you truly have?\nThe earthly courts must be feared;\nThe underworld’s judgments are hard to plead.\nWith merit, you need not fear;\nWith accumulated sins, you will surely face punishment.\nNo descendant can take your place—\nAwaken early, lest you remain foolish.\"\n\nAnother time, he said:\n\"Whether blessed or not, fortune and karma are intertwined.\nWith blessings, fortune arrives;\nWithout them, karma entangles.\nThe three karmic offenses are grave,\nAnd the root of faith is not whole.\nIf you follow my words,\nIt will be as steadfast as Mount Tai.\"\n\nAnother time, he said:\n\"Listen to my words, and your years shall be extended,\nYour health preserved, and your peace secured naturally.\nWith unwavering sincerity, cultivate the truth of the Dao/Way—\nIn this life, you may stand before the Jade Emperor.\"\n\nAnother time, he said:\n\"For your devotion,\nThe stars descend.\nThey arrive riding the dark wind,\nAnd depart upon the dharma rain.\nThey open the eyes and ears of the blind and foolish,\nTurn the hearts of those who have accumulated evil,\nAnd lead them all to the right path.\nBecause of your offerings and prayers to the Supreme,\nEvil men have all come to pay reverence—\nThis is your merit.\nI have already reported this to the Supreme Emperor,\nThat you may gain blessings.\nYou must deepen what is pure, whiten what is white, and brighten what is bright.\nDo not begin with diligence only to grow lax at the end,\nNor change course midway,\nTurning purity into turbidity,\nOr goodness into evil.\nIf the numinous officials report this to the Supreme Emperor,\nHe will know you have strayed from my teachings.\"\n\nOn the night of the tenth day of the seventh month, the True Lord descended and said:\n\"You have served the state with loyalty and diligence,\nAnd governed the people with kindness and love.\nYou must continue to apply yourself—\nDo not betray my sincerity.\nBefore you encountered me,\nAll the evils you committed\nI have already dissolved for you.\nAfter meeting me,\nYou have no further karmic burdens—\nThe attendants have already recorded your merits.\nYou must continue, morning and evening,\nTo accumulate good deeds with me—\nDo not grow idle in heeding my sacred words.\"\n\nAnother time, he said:\n\"Simply attend to the affairs of the state,\nRedress grievances and right wrongs.\nI will always dispatch numinous officials\nTo protect and assist you.\nIn all matters,\nAct with fairness and uprightness,\nAnd follow my sacred words.\nMoreover, this is an age of enlightened rule—\nAll things lie ahead,\nSo you need not worry.\"\n\nHe also said:\n\"Be at ease, do not fret—\nThe military and government will naturally be secure.\nIn every matter, follow the kingly Dao/Way,\nAnd let it spread throughout the realm.\"\n\nAnother time, he said:\n\"As the prefect, offer sincere prayers to the Supreme—\nThe Song dynasty’s altars of state shall be preserved in Chang’an.\nSoon, the world will rejoice in great peace,\nAnd your household shall receive blessings for generations.\"\n\nAnother time, he said:\n\"As the prefect, you must be devout,\nAnd lend your heart to the cause of great peace.\nThe celestial palace will note your duties—\nIn every matter, be even more diligent.\nAll the sages know of you—\nLet your every action inspire awe.\nWhen your merits are complete,\nYou shall dwell forever in the Three Pure Realms.\"\n\nAnother time, he said:\n\"Do not worry needlessly in life,\nNor will you have sorrow after death.\nThe lord judges matters in the yang realm—\nHow many autumns do ordinary men truly have?\nSimply follow the sacred words,\nAnd seek long life in the heavens above?\"\n\nEach time Li Zhu received a transmission, he never failed to recite it morning and evening. The True Lord once said to him:\n\"Though you are nearing eighty and have not cultivated the arts of refinement,\nYou will not escape the fate of concealing your form and ascending in spirit—\nYet you shall still have a position to oversee.\"\n\nLi Zhu bowed twice and said:\n\"In this life, I have been fortunate to encounter the descent of a perfected immortal\nAnd receive your secret teachings many times.\nIf one day I am granted a position to oversee,\nI wish to stand alongside the Guardian of the True.\"\n\nThe True Lord replied:\n\"In the worldly offices of men, the Guardian of the True does not surpass you;\nBut in the celestial ranks, you do not surpass the Guardian of the True.\nSimply return your heart to the true and upright—\nThe steps to ascending as an immortal will come in time.\"\n\nDuring the Chunhua era, the Military Commissioner of the Western Capital, Chancellor Zhao Pu, once dispatched an envoy with offerings to hold a solemn rite and earnestly pray, seeking to know fortune and misfortune. The True Lord descended and said:\n\"Zhao Pu has upheld the altars of state with great merit—\nThe heavens above know this\nAnd grant you blessings and longevity.\nYet in elevating the great, you have harmed the small—\nEven in the netherworld, there are grievances against you.\nYou must recite the true scriptures,\nPetition heaven and earth,\nAnd repent your past transgressions.\nI shall also report this to the Supreme Emperor,\nThat this misfortune may be resolved.\nYour office and lifespan are already fixed.\"\n\nThe envoy recorded this and departed. Zhao Pu knelt to read it, moved to tears. He then burned a written confession to express his remorse and again dispatched someone to the abbey to hold a rite.\n\nThe Grand Master and Assistant Director of the Chancellery, Jia Huangzhong, once sent someone to offer sincerity and pray, seeking sacred instruction. The True Lord descended and said:\n\"The sagely ruler commands his ministers, and ministers serve their ruler—\nThe Dao/Way assists the age,\nThe heart follows the ancients.\nLet neither good nor evil be concealed;\nLet neither treachery nor deceit go unheard.\nWhen ruler and minister unite in the Dao/Way,\nMerits may be established.\"\n\nAnother time, he said:\n\"Love the people with all your heart,\nAnd let rewards and punishments be impartial.\nSimply follow my words,\nAnd your household shall be preserved in peace.\"\n\nThe Palace Attendant Zhang Zhuo once sought sacred words. The True Lord said:\n\"The Great Dao/Way nurtures your nature;\nYin and yang give birth to your body.\"\n\n\"Diligently practice the Dao/Way for me,\nDiligently cultivate the true for me.\nBe just and upright, ever mindful;\nCare and compassion lie with the people.\nWhen opportunity arises, assist the enlightened ruler,\nThat purity and impurity be heard by the Supreme Emperor.\nImpure wealth shall not endure,\nWhile pure poverty befits the celestial beings.\nLet none boast of riches,\nNor fear the scorn of poverty.\nFor true wealth lies within,\nAnd lofty purity feels no shame in poverty.\"\n\nAnother time, he said:\n\"Though the form be common, the nature is not;\nServe the state with manifest integrity.\nThough your household numbers over a thousand,\nEach bears their own transgressions.\"\n\nAnother time, he said:\n\"Simply ingest the yang harmony qi,\nAnd the celestial tortoise shall be steamed anew.\nThe earthen furnace serves another purpose,\nWhile the Dao/Way and virtue renew daily.\nProlong life and accumulate blessings in response,\nAs true emptiness becomes as close as kin.\nWithin the void lies wondrous principle,\nAnd deliverance awaits those with karmic affinity.\"\n\nDaoist Zhou Wuben once presented a memorial at the palace, beseeching sacred words. The True Lord descended and said:\n\"Your words express longing for the heavens above,\nYet your heart and intent remain distant as mountains.\nThe immortal palaces are no farther than your palm,\nBut inner and outer cultivation remain incomplete.\nThe officials of the yin realm record all without omission,\nTo spare you from falling into Dengdu for hundreds of years.\nFollow my words and align with my Dao/Way,\nAnd treading the Three Clarities shall pose no difficulty.\"\n\nZhang Shouzhen’s son, Yuanji, often observed purification rites before visiting the palace. The True Lord descended and said:\n\"Your father, Shouzhen, encountered me,\nThus bestowing blessings upon your descendants.\nDo you not know of Zhang Daoling of Longhushan in Xinzhou?\nTo this day, his lineage remains unbroken,\nFor he too met with the exalted sages.\nAfter attaining the Dao/Way, his merit extended to posterity.\nYou, too, share a karmic bond with me.\nSimply remain at home, filial to your parents,\nAnd loyal to the emperor in your official duties.\nEstablish yourself and spread your name—\nIs this not a fine endeavor?\"\n\nAnother time, he instructed:\n\"When idle, do not wander the streets;\nDiligent study ensures a lasting name.\nLet your name resound throughout the land,\nAnd the Dao’s merit grants longevity.\"\n\nHe also admonished:\n\"Your own transgressions you know best;\nGood and evil follow you each day.\nIf you clearly defy the heavenly Dao,\nThen tell me—who is the fool?\"\n\nDuring the Chunhua era, the True Lord descended and spoke to Shouzhen:\n\"In this age of manifest sagely brilliance,\nCultivating virtue moves the Three Clarities.\nHeaven returns to the true Dao/Way,\nAnd the four seas cease their wars.\nThe eight directions revere the wise and sagely,\nWhile the five grains yield abundant harvests.\nI urge you to cultivate virtue,\nThat the Supreme Emperor may grant you long life.\"\n\nAnother time, he said:\n\"The bandits of Guanzhong arise in accord with the times’ fate;\nThe court must issue commands to summon and capture them,\nAnd officials must not slaughter innocent commoners.\nAs the court cultivates virtue...\"\n\nThe bandits must be eradicated.\n\nHe once descended to admonish the Daoist attendants, saying:\n\"A thousand hearts differ, ten thousand minds all err.\nIntentions fail to align, and with the sagely few can accord.\nHard is the pact to keep.\"\n\nThe True Lord also descended to warn the officials:\n\"Ever maintain loyalty and trust, aligning with Heaven’s will;\nAmong civil and military ranks, the worthy naturally rise.\nFor the sovereign’s ten-thousand-year foundation,\nEver fret for the common folk, lest they suffer cold and hunger.\nLong practice virtue to accord with the Dao/Way,\nBurn incense and pray devoutly to the Mysterious.\nOnly wish the realm at peace, the lord enduring,\nWith one heart assist the era of Great Peace.\"\n\nHe also descended to admonish the court ministers:\n\"The pillar upholding Heaven must establish merit,\nEmbracing the vast seas to aid the enlightened lord.\nAs in King Wen’s reign and the days of Yao,\nThe cosmos is upheld by loyal ministers.\nFor the lord, one must act with utmost resolve,\nIn life and death alike, bear the imperial grace.\nEver practice good and virtue to align with power,\nBe prudent to the end as at the start, and fear not for yourself.\"\n\n**Memorial on the Affairs of the Perfected Lord of Assisting Sagacity and Preserving Virtue**\nYour servant Qin Ruo states: I have heard that when High Heaven bestows its mandate, the Primordial Sage receives the era’s charge, and there must be supreme spirits who manifest hidden assistance. Their counsels and teachings are inscribed in the *Baochan* scriptures, their refined praises recorded in the *Jianguan* annals. Examining the mysterious correspondences of past and present, one sees the mutual resonance of Heaven and humanity.\n\nYour servant Qin Ruo, with utmost joy and reverence, bows his head again and again.\n\nI humbly consider that from the numinous source, blessings overflow; the fiery virtue continues its flourishing. The august fortune unfolds, its mighty signs resplendent. The Primordial Attendant of the Jade Dawn, serving the luminous might of the Golden Portals, descends his essence and spirit upon the unwavering people, revealing the unfathomable workings of yin and yang. He aids the great state in inaugurating its destiny, announcing to the divine lineage the continuation of its design. The omens appear first in subtle signs, startling to hear and behold.\n\nThus, the offerings are augmented and splendid, the laudations richly presented. Grand rites are solemnly observed, pure blessings resound in response. Even the girdled officials and ministers, the common folk with horizontal pupils, bow their heads to gaze upon his immaculate countenance, purify their hearts to await his numinous decrees. According to their natures’ depth or shallowness, their capacities’ breadth or narrowness, he at times admonishes with subtle words, awakening their delusions. His earnest teachings penetrate their hidden subtleties; the benighted masses come to recognize the true and correct.\n\nWhen malevolent spirits wreak havoc—unrecorded even in the Xia tripods—\nOr when blindness breeds calamity—unfathomable even to Qin physicians—\nHe deigns to listen, devoutly and from afar bestowing guidance.\nThe true teachings descend, and noxious influences are surely eradicated.\nThe obscure and profound signs now shine upon the mortal realm,\nWhile the sojourns of the Terrace of Reverence swiftly return to the celestial heights.\nForever shall his fragrant sacrifices be offered,\nAnd his coiled blessings subtly bestowed.\n\nAll his secret words are preserved in the old records,\nTo be arranged and presented for posterity.\nDaring to claim that even the humble and insignificant have been graced by the luminous decree,\nI fast and purify myself to recite them with reverence.\nClasping my hands in trepidation, I cannot fathom their profundity,\nYet roughly expound and elucidate them.\n\nI reflect that the illustrious traces of the Supreme Perfected\nAre indeed the bright proofs of this enlightened age.\nHow could one of my mediocre and insignificant talent\nPresume to describe such matters?\n\nI humbly hope that the August Worthy, Venerable of the Dao/Way, Treasure of the Dao/Way, Responsive to the Chapters, who moves the sagely and enlightened, benevolent and filial Emperor, may deign to peruse this, wield his brush to compose a preface, bestow a name to commemorate his fragrant virtue, and place it at the head of the work. Thus may reverent service be manifest, and boundless blessings be eternally cherished.\n\nYour servant, unable to contain his awe as he gazes toward Heaven and longs for the sagely presence, is overwhelmed with trembling and trepidation.\n\nThe three fascicles recording the affairs of the Perfected Lord of Assisting Sagacity and Preserving Virtue are respectfully submitted herewith for Your Majesty’s perusal.\n\nYour servant Qin Ruo, with utmost reverence and fear, bows his head again and again.\n\n**Memorial Submitted by:**\nWang Qin Ruo, Grand Mentor with the Rank of Grandee, Participant in Determining Governmental Matters, Grand Pillar of State, Duke of Taiyuan Commandery\n\n**Imperial Rescript:**\nWe have perused the memorial in full. The wondrous Dao/Way is vast, rooted in the tranquil and profound; the supreme spirit is boundless, manifest in its responsive virtue. The Primordial Attendant of the Jade Void stands at the apex of the numinous registers. In hidden assistance and completion, he directly reveals the obscure and concealed.\n\nWhen the August Ancestor received the mandate, he descended blessings upon the earth and displayed his numinous power. When Our Illustrious Predecessor continued the glory, he announced the imperial destiny and inaugurated the omens. Thus, the expression of fine recompense began, and a special sanctuary was established. The solemn rites of offering and exorcism were observed, bringing great blessings to the black-haired people.\n\nMoreover, in discerning the subtle and profound, relying upon the liver and gall, he demonstrated earnest teachings and revealed his unfathomable might. His ethereal responses were like echoes; his swift chariot swiftly returned. Since We ascended and inherited the throne, We have reverently augmented our veneration, solemnly establishing the rites at the Reverent Hall, presenting honorific titles at the Primordial Capital. Considering that the secret decrees are fully preserved in the records, We deem this a most flourishing endeavor, desiring to compile and edit them to display these auspicious proofs.\n\nYou, as the foremost of the court, govern the Dao/Way and bring harmony to the state. Drawing from refined and abundant sources, you have harmonized the many and arranged them into a compilation. Meticulous yet comprehensive, you have sealed them in silk wrappers and presented them. Earnestly requesting a preface and hoping for a name, though Our words are shallow and unworthy, how could We not heed such sincere pleas? With reluctance, We accede to your diligent request, moved by your earnestness. Our admiration and esteem are ever-present, day and night unceasing.\n\nYour request is approved. In the third year of the Chongning era, on the eighteenth day of the fourth month, the imperial command was delivered to the Palace of Merit. The decree bestowing an honorific title upon the True Lord states:\n\nThe Chancellery proclaims: Of the August Emperor on High, there are assisting ministers whose numinous power shines resplendently. At the foot of Mount Zhongnan, they have repeatedly received glorious favor, their splendor enhanced by laudatory inscriptions. The Perfected Lord of Assisting Sagacity and Preserving Virtue descended his words at the beginning of the Jianlong era, making manifest his announcements by the end of the Kaibao era. He greatly protects the lands below, guarding our state and homeland. An abode was established for his worship, and his responses were as swift as echoes. Considering Our humble self’s birth and the emperor’s profound and secret prayers, how could We forget to render fine recompense for these auspicious events?\n\nFor utmost sincerity can move, and its responses are surely fulfilled. What is stored within? The blessings of ten thousand generations. Thus, We bestow a grand title, issuing this decree to glorify Our canon. May the divine and celestial realms eternally flourish in pure harmony.\n\nThe Perfected Lord of Assisting Sagacity and Preserving Virtue at the Supreme Clarity Great Peace Palace in Fengxiang Prefecture shall be specially honored as the **Perfected Lord of Assisting Sagacity, Responsive to Stimuli, Storing Blessings, and Preserving Virtue**.\n\nThe *Hagiography of the Perfected Lord of Assisting Sagacity and Preserving Virtue*, Scroll the Lower, concludes.\n\n[The three characters \"莫相待\" (*\"Do not await one another\"*) were originally missing and have been supplemented according to the *Daoist Canon Compendium* edition.]",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "翊圣保德传 经名：翊圣保德传。 三卷。 宋王钦若编慕。 底本出处：《正统道藏》正一部。 参校本：《道藏辑要》本。 翊圣保德传卷上 宋开府仪同三司同中书门下平章事上柱国太原郡开国公王钦若奉劲编集 翊圣保德真君。 建隆之初，凤翔府整屋县民张守真，因游终南山。 忽闻空中有召之者，声甚清彻。 守真惊惧四顾，无所见，默行悚听，约数里，又闻语云：汝若先行，吾即在后。 如是者数日，守真莫能测。 既还其家，又闻室中曰：吾受命降灵，汝何为顽梗如此，不听吾言。 吾若不为宋朝大事，当已粉碎汝矣。 守真方异之，而且惧，因日：未审是何星辰，如此临降。 守真性本愚态且昧，神祇愿勿凭凌，必无事奉。 乃曰：吾是高天大圣玉帝辅臣，授命卫时乘龙降世。 但以非正直之士无以奉，吾教汝有异骨，不类常流，汝可虔心奉吾道训也。 守真曰：窃闻在男日巫，在女曰现，守真虽处凡庸，耻为兹类。 又曰：吾上天之神，非鬼魅也。 五岳四渎，吾能役使。 汝若回心入道，勤奉香火，当令汝应大国之征命，受真主之恩遇，岂同巫现之辈耶。 守真曰：神人既若此教导，敢不虔事。 乃设酒肉之撰以祀焉。 又闻言曰：吾是神人也，汝何为以膻秽读我。 以汝未晓，不欲罪汝，此后但以香荼及素食、鲜果为供。 吾虽不食饮，汝之意也。 守真稽首而谢。 又日：吾为汝天上之师，汝别有人问之师，可但访高士，以求度焉。 守真乃礼古楼观先生梁荃为师，度为道士。 遂於所居之侧，择隙地，出家财，构北帝宫，内立殿以事神。 旦暮崇奉，颇极精至，神谓之曰：观汝虔心，称吾教导，贞洁之士，可以驱邪。 吾先将诲汝剑法，俾汝为民除妖。 后当令汝结坛，俾汝为国祈福。 守真再拜，日：守真本实凡庸，粗怀愚直，当绿夙生奉事，乃致今获归依，愿以至心，永奉灵德坛仪、剑法，恭俟灵训。 真君日：剑法有三，但以铜、铁、锻为利刃，吾目一视便可用也。 有疾之人，俾汝挥击，邪气销铄，其人无损。 或地祇作孽，水族生妖，分野为灾，国家翰虑，当以上剑治之。 或山泽之怪，飞走之雄，震骇闻阎，侵毒黎庶，当以中剑治之。 或魑魅之徒，夔魅之辈，挟邪暴物，作祟害人，当以下剑治之。 守真曰：三剑之法，己闻命矣，结坛之仪，伏俟指教。 真君日：结坛之法有九，上三坛则为国家设之，其上日顺天兴国坛，凡星位三千六百为普天大醮，旌旗、鉴剑、弓矢、法物，罗列次序，开建门户，具有仪范。 其中日延祚保生坛，凡星位二千四百为周天大醮，法物、仪范，降上坛一等。 其下日祈谷福时坛，凡星位一千二百为罗天大醮，法物、仪范降中坛一等。 傥非时祷祀不及，备此三坛。 亦当精洁词章，鲜异花果，扣鼓集神，恳祷而告。 去地九尺，焚香以奏，亦可感应也。 中三坛则为臣寮设之，其上日黄录延寿坛，凡星位六百四十。 其中日黄录臻庆坛，凡星位四百九十。 其下日黄录去邪坛，凡星位三百六十。 此三坛所用法物、仪范各有差降。 下三坛则为士庶设之，其上日续命坛，凡星位二百四十。 其中日集福坛，凡．星位一百二十。 其下日却灾坛，凡星位八十一。 所用仪范，量有等差。 此九坛之外，别有应物坛，或六十四位，或四十九位，或二十四位，法物所须，各以差降。",
      "translated_text": "**The Hagiography of the Protector of Virtue and Upholder of Sageliness**\n\n**Scripture Title:** *The Hagiography of the Protector of Virtue and Upholder of Sageliness*\nThree scrolls. Compiled by Wang Qinruo of the Song Dynasty. Base text from *The Orthodox Daoist Canon*, Proper Section I. Collated with the *Daoist Canon Compendium* edition.\n\n**Scroll One of The Hagiography of the Protector of Virtue and Upholder of Sageliness**\nCompiled by Wang Qinruo, Duke of Taiyuan, Grand Preceptor with Equal Standing to the Three Excellencies, Joint Manager of Affairs of the Secretariat-Chancellery, and Pillar of State, under imperial command.\n\n**The Perfected Lord, Protector of Virtue and Upholder of Sageliness.**\nAt the beginning of the Jianlong era, Zhang Shouzhen, a commoner from Zhengwu County in Fengxiang Prefecture, was traveling in the Zhongnan Mountains when he suddenly heard a voice calling him from the void, its tone clear and resonant. Startled, Shouzhen looked around but saw nothing. He walked cautiously, straining to listen, and after several *li*, heard the voice again: \"If you go first, I shall follow behind.\" This continued for days, leaving Shouzhen perplexed.\n\nUpon returning home, he heard a voice in his chamber say: \"I descend by imperial mandate to manifest my numen. Why are you so obstinate, refusing to heed my words? Were it not for the great affairs of the Song Dynasty, I would have already reduced you to dust.\" Shouzhen, both astonished and fearful, asked: \"I do not know which stellar deity has deigned to descend. My nature is foolish and dull; I pray the divine one will not overbear me, and I shall surely serve without fail.\"\n\nThe voice replied: \"I am the Great Sagely Minister of the Jade Emperor of the Highest Heaven, sent to ride the dragon and descend into the world. Only a man of uprightness can serve me. I see that you possess an extraordinary bone structure, unlike the common folk. You must reverently follow my teachings.\" Shouzhen said: \"I have heard that among men it is called *wu*, and among women *xian*. Though I dwell in the realm of the ordinary, I am ashamed to be counted among such.\"\n\nThe voice declared: \"I am a celestial deity, not some ghost or specter. The Five Peaks and Four Waterways are under my command. If you turn your heart to the Dao and diligently offer incense and fire, I shall cause you to answer the summons of a great nation and receive the favor of a true sovereign. How could I be the same as those *wu* and *xian*?\" Shouzhen replied: \"Since the divine one instructs me thus, how dare I not serve with reverence?\" He then prepared wine and meat as offerings.\n\nThe voice spoke again: \"I am a divine being. Why do you defile me with such foul offerings? As you are ignorant, I shall not punish you. Henceforth, offer only fragrant tea, vegetarian fare, and fresh fruit. Though I do not consume them, your intent is what matters.\" Shouzhen bowed deeply in apology.\n\nThe voice continued: \"I am your celestial master. You shall also have a master in the human realm. Seek a lofty scholar to receive ordination.\" Shouzhen then paid homage to Master Liang Quan of the Ancient Louguan Abbey as his teacher and was ordained as a Daoist priest. He selected a vacant plot beside his home, spent his family’s wealth, and constructed the Palace of the Northern Emperor, erecting a hall within to serve the deity. Morning and night, he made offerings with utmost devotion.\n\nThe deity said to him: \"Seeing your sincerity and adherence to my teachings, you are a man of integrity, capable of dispelling evil. First, I shall teach you the sword method, that you may expel demons for the people. Later, I shall instruct you in altar rites, that you may pray for the nation’s blessings.\" Shouzhen bowed twice and replied: \"I am but a humble and foolish man, yet by some karmic fortune, I have now found refuge. With utmost devotion, I shall forever uphold the altar rituals and sword methods, awaiting your divine instructions.\"\n\nThe Perfected Lord said: \"There are three sword methods. Use copper, iron, or steel to forge a sharp blade, and with a single glance from me, it shall be ready. For those afflicted by illness, have them wield it, and the pathogenic *qi* shall be dissolved without harm to the person. If earth deities cause calamity, aquatic creatures spawn demons, or the celestial regions bring disaster, troubling the state, employ the *upper sword* to remedy it. For mountain and marsh specters, or fierce flying and crawling creatures that terrorize the realm and poison the people, use the *middle sword*. For *chimei* and *kuilei* spirits that cling to evil, harming beings and bringing misfortune, use the *lower sword*.\"\n\nShouzhen said: \"I have received your teaching on the three swords. I await instruction on the altar rites.\" The Perfected Lord replied: \"There are nine altar methods. The upper three are established for the state:\n\n1. **The Altar of Following Heaven and Prospering the Nation** – For a grand universal offering, arraying 3,600 stellar positions. Banners, mirrors, swords, bows, arrows, and ritual implements are arranged in order, with gates opened and protocols observed.\n2. **The Altar of Extending Blessings and Preserving Life** – For a celestial offering, arraying 2,400 stellar positions. Ritual implements and protocols are one rank lower than the upper altar.\n3. **The Altar of Praying for Harvests and Timely Blessings** – For a universal net offering, arraying 1,200 stellar positions. Ritual implements and protocols are one rank lower than the middle altar.\n\nIf time does not permit for these three altars, one must still prepare pure and elegant prayers, rare flowers and fruits, strike the drum to summon the deities, and offer earnest supplications. Burning incense nine *chi* above the ground to present petitions may also evoke a response.\n\nThe middle three altars are established for officials:\n\n1. **The Yellow Register Altar of Extending Longevity** – Arraying 640 stellar positions.\n2. **The Yellow Register Altar of Attaining Felicity** – Arraying 490 stellar positions.\n3. **The Yellow Register Altar of Dispelling Evil** – Arraying 360 stellar positions.\n\nThe ritual implements and protocols for these three altars differ in rank.\n\nThe lower three altars are established for scholars and commoners:\n\n1. **The Altar of Continuing Life** – Arraying 240 stellar positions.\n2. **The Altar of Gathering Blessings** – Arraying 120 stellar positions.\n3. **The Altar of Averting Disaster** – Arraying 81 stellar positions.\n\nThe protocols for these altars vary according to rank.\n\nBeyond these nine altars, there is also the **Altar for Responding to Circumstances**, which may array 64, 49, or 24 positions. The required ritual implements differ accordingly.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1237,
      "start_sentence": 0,
      "end_sentence": 56,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.536949634552,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\翊圣保德传.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "士民之类，可量力而为之。 如臣庶，上为帝王祈佑，当作祈谷福时坛，凡一千二百位。 或为父母师尊禳灾祈福，当为醮设坛，随宜增益也。 守真拜而受之，自尔多有征验，不能备纪。 乾德中，太宗皇帝方在晋邸，颇闻灵应，乃遣近侍宝信币、香烛＇，就宫致醮。 使者斋戒焚香，告日：晋王久钦灵异，欲备俸缙，增修殿宇。 仍表乞劲赐官名。 真君曰：吾将来运值太平君，宋朝第二主，修上清太平宫，建十二座堂殿俨。 三界中星辰，自有时日，不可容易而言。 但为吾启大王，言此宫观，上天已定增建年月也，今犹未可。 使者归以闻太宗，惊异而止。 太祖皇帝素闻之，未甚信异，遣使资香烛清词就宫致祷。 因召守真诣阙备询其事，守真具言之，且曰：非精诚恳至，不能降其神。 仍以上圣降灵事迩，一一闻奏。 太祖召小黄门长啸於侧，谓守真日：神人之言，若此乎。 守真曰：陛下傥谓臣妖妄，乞赐按验，戮臣於市，勿以斯言亵渎上圣。 诏守真止於建隆观，翌日，遣内臣王继恩就观醮设，移时未有所闻，继恩再拜虔告，须臾，真君降言日：吾乃高天大圣玉帝辅臣，盖遵符命降卫宋朝社稷，来定遐长基业，固非山林魑魅之类也。 今乃使小儿呼啸，以比吾言，斯为不可。 汝但说与官家，言天上宫阙已成玉铄开，晋王．有仁心，晋王有仁心，凡百余言。 继恩惶惧不敢隐，具录以奏，因复面言，神音历历，闻者兢悚。 太祖默然异之，时开宝九年十月十九日之夕也。 翌日，太祖升遐，太宗嗣位。 寻召守真於琼林苑为周天大醮，作延祚保生坛。 醮罢，真君降言於内臣王继恩日：吾有言，汝当为吾奏之。 日建隆元年奉帝言，乘龙下降卫人君。 扫除妖孽犹闲事，纵横整顿立乾坤。 国祚已兴长安泰，兆民乐业保天真。 八方效贡来稽首，万灵震伏自称臣。 亲王祝寿须焚祷，递相虔洁向君亲。 吾有捷疾一百万，诸位灵官万亿#1人。 若行忠孝吾加福，若行悖逆必诛身。 赏罚行之既平等，天无氛秽地无尘。 爱民治国胜前代，万年基业永长新。 继恩录之於简，翌日，以闻太宗，览之惊异，稽首谢日：家国之幸，宗庙之庆，虔荷上圣赐以格言。 命缄藏於内殿。 寻遣内供奉官王守节，起居舍人王龟从就终南山下筑宫，方卜地於终南镇，真君忽降言於龟从等曰：此地乃修建上帝宫阙之地，不可易也。 於是乃定凡三年宫成，中正之位列四大殿，前则玉皇通明殿，次紫微殿，次七· 元殿，次则真君所御殿。 束麻之外，有天蓬、九曜、束斗、天地水三官四殿，西应之外，有真武、十二元辰、西斗、天曹四殿，又有灵官堂、龙堂、南斗阁，并列星宿诸神之像，坚锺经二楼，斋道堂室，靡不完备。 建碑以纪其事，题日：上清太平宫，一如真君预言之制。 命常参官一人监宫，择道士焚修。 每岁三元及诞节、上本命日，并遣中使致醮，杞神之夕，上望拜焉。 岁或水旱、或国家将举事，卒致祷焉。 初宫成，真看忽降言谓王龟从等日：汝奉诏修宫，勤则至矣。 然何为不开日月华门，不画八小殿壁，阶墀璧梵亦未严备，唯求速成以冀恩宠。 然上天亦不掩尔功，亦不赦尔罪。 守节、龟从颇切惊惧，然已奏讫，役不及增备，惟稽首析谢而去。 至阙，皆获增秩，赐白金千两。",
      "translated_text": "The scholar-gentry and common folk may undertake these rites according to their means. For instance, when commoners pray for the emperor’s protection, they should establish the **Altar of Praying for Grain and Felicity**, arraying 1,200 stellar positions. When beseeching blessings or averting disaster for parents or teachers, they may set up an offering altar, adjusting the scale as appropriate.\n\nGuardian Perfected received these teachings through reverent prostration, and thereafter, many verifications arose, though they cannot all be recorded. During the *Qiande* era, when Emperor Taizong was still the Prince of Jin, he had heard of the numinous responses and dispatched a trusted attendant with treasures, silk, incense, and candles to the palace to perform the offering. The messenger, having purified himself and burned incense, declared: “The Prince of Jin has long admired the divine marvels and wishes to present offerings and expand the halls. He also petitions for an official name to be bestowed.” The Perfected Sovereign replied: “In the future, when the era of the Peaceful Ruler arrives—the second sovereign of the Song—he shall build the **Supreme Clarity Palace of Great Peace**, erecting twelve grand halls. The stars of the Three Realms have their appointed times; this cannot be lightly discussed. Simply inform the Prince that this palace’s construction has already been decreed by Heaven, with a fixed year and month—though the time is not yet ripe.” The messenger returned and reported this to Taizong, who was astonished and ceased his inquiries.\n\nEmperor Taizu had also heard of these matters but remained skeptical. He sent an envoy bearing incense, candles, and a written prayer to the palace to perform the rite. Later, he summoned Guardian Perfected to court to question him in detail. Guardian Perfected recounted everything, adding: “Without utmost sincerity, the gods will not descend.” He further reported the recent descent of the Supreme Sage in full. Taizu summoned a young eunuch to whistle mockingly nearby and said to Guardian Perfected: “Are the words of gods and men truly like this?” Guardian Perfected replied: “If Your Majesty deems my words deceptive, I beg to be examined and executed in the marketplace, lest such speech profane the Supreme Sage.” Taizu ordered Guardian Perfected to remain at the **Jianlong Abbey**. The next day, he dispatched the eunuch Wang Jien to perform the offering. After some time with no response, Jien bowed again in earnest prayer. Soon after, the Perfected Sovereign descended and declared: “I am the High Heavenly Great Sage, Minister to the Jade Emperor, sent by decree to guard the Song’s altars and secure its enduring foundation—not some mountain sprite or forest demon. Yet you send a whistling boy to compare my words? This is unacceptable. Simply tell the sovereign that the celestial palaces are already completed, their jade gates aglow. The Prince of Jin possesses a benevolent heart.” (He repeated, “The Prince of Jin possesses a benevolent heart,” and spoke over a hundred more words.) Jien, trembling with fear, dared not conceal anything and recorded it all before reporting to Taizu. He also recounted the clarity of the divine voice, which left all who heard it in awe. Taizu fell silent, struck with wonder. This occurred on the evening of the nineteenth day of the tenth month in the ninth year of *Kaibao*.\n\nThe following day, Taizu passed away, and Taizong ascended the throne. Soon after, he summoned Guardian Perfected to the **Qionglin Park** to perform the **Grand Offering of the Celestial Circuit**, establishing the **Altar of Prolonging Fortune and Preserving Life**. After the rite, the Perfected Sovereign descended and spoke to the eunuch Wang Jien: “I have words for you to relay to the emperor.” He said:\n\n> In the first year of *Jianlong*, by imperial decree,\n> I descended on dragon-back to guard the lord of men.\n> Sweeping away demons was but a trifling task;\n> I set the cosmos aright and established the firmament.\n> The nation’s fortune has risen, and peace reigns long;\n> The people rejoice in their labors, preserving their celestial nature.\n> The eight directions offer tribute and bow in submission;\n> Myriad spirits tremble and prostrate themselves as subjects.\n> When the imperial kinsmen celebrate longevity, they must burn incense and pray,\n> Passing down reverence and purity toward ruler and kin.\n> I command a swift legion of one million,\n> And countless divine officials in the billions.\n> Those who act with loyalty and filial piety shall receive my blessings;\n> Those who act with rebellion shall surely be punished.\n> Rewards and punishments shall be meted out with perfect equity,\n> So that Heaven remains unstained and Earth free of dust.\n> Loving the people and governing the state surpasses all previous ages;\n> The foundation of ten thousand years shall forever renew.\n\nJien recorded these words on bamboo slips and reported them to Taizong the next day. Upon reading them, Taizong was astonished and bowed in gratitude, saying: “This is the fortune of our house and the blessing of our ancestral temples. We humbly receive the Supreme Sage’s edifying words.” He ordered the text sealed and stored in the inner palace.\n\nSoon after, he dispatched the Palace Attendant Wang Shoujie and the Recorder of the Imperial Presence Wang Guicong to build a palace at the foot of Mount Zhongnan. As they were selecting the site at Zhongnan’s town, the Perfected Sovereign suddenly descended and spoke to Guicong and the others: “This is the place to build the palace of the Supreme Emperor. It cannot be changed.” Thus, the site was fixed. After three years, the palace was completed. At its central axis stood four grand halls: the **Hall of the Jade Emperor’s Luminous Passage** at the front, followed by the **Purple Tenuity Hall**, the **Seven Primes Hall**, and the **Hall of the Perfected Sovereign’s Presence**. To the east of the main halls were the **Four Halls of Heavenly Penetrating, the Nine Luminaries, the Eastern Dipper, and the Three Officials of Heaven, Earth, and Water**. To the west were the **Four Halls of Perfected Warrior, the Twelve Celestial Stems, the Western Dipper, and the Heavenly Ministries**. Additionally, there were the **Hall of the Divine Officials**, the **Dragon Hall**, the **Pavilion of the Southern Dipper**, and images of all the stellar deities. Two towers for hanging bells and scriptures were erected, along with halls for fasting and Daoist chambers—all fully equipped. A stele was erected to record the events, inscribed with the name **Supreme Clarity Palace of Great Peace**, exactly as the Perfected Sovereign had foretold. Taizong appointed a regular court official to oversee the palace and selected Daoist priests to conduct the rites. Every year, during the Three Primes, the emperor’s birthday, and the day of his celestial destiny, envoys were sent to perform offerings. On the evenings of the rites, the emperor would gaze toward the palace and bow in reverence. In times of flood or drought, or when the state was about to undertake major affairs, urgent prayers were offered there.\n\nWhen the palace was first completed, the Perfected Sovereign suddenly descended and addressed Wang Guicong and the others: “You have diligently carried out the imperial decree in building this palace. Yet why have you not opened the **Gate of Sun and Moon Splendor**? Why have you left the walls of the eight minor halls unpainted and the steps, walls, and Sanskrit inscriptions incomplete? You sought only hasty completion to curry favor. However, Heaven will neither conceal your merit nor absolve your fault.” Shoujie and Guicong were deeply alarmed, but as the project had already been reported complete, no further additions could be made. They could only bow in apology and depart. Upon returning to court, both were promoted in rank and rewarded with a thousand taels of silver.",
      "overlap_context": "ars are established for scholars and commoners:\n\n1. **The Altar of Continuing Life** – Arraying 240 stellar positions.\n2. **The Altar of Gathering Blessings** – Arraying 120 stellar positions.\n3. **The Altar of Averting Disaster** – Arraying 81 stellar positions.\n\nThe protocols for these altars vary according to rank.\n\nBeyond these nine altars, there is also the **Altar for Responding to Circumstances**, which may array 64, 49, or 24 positions. The required ritual implements differ accordingly.\"",
      "start_char": 1237,
      "end_char": 2450,
      "start_sentence": 57,
      "end_sentence": 103,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.83656644821167,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\翊圣保德传.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "既而守节染疾而亡，龟从殁於兵刃。 此乃不掩功、不赦罪之戒明矣。 太平兴国初，太宗皇帝亲征太原，真君忽降言於守真日：官家已临汾晋，非久克复城池，汝当令监官臣等设醮，以谢胜捷於上帝。 守真等曰：国家大事，乞俟捷音。 真君曰：上天已定胜负也。 瑜旬，而王师告捷。 监宫等以闻帝，遣内臣卢文寿资内库、香药、御署、词章诣宫，陈醮以谢上帝。 是夕，真君降言曰：官家设此大醮，上帝与诸天皆喜，国祚延远，过於有唐。 兴国六年，守真以乾明节诣阙朝贺，召见因面奏曰：圣真下降，俯为昌朝，乞降诏加号，以灵既上。 允其奏，寻下诏日：太平宫神受命上穹，降灵下土，芯芬致荐，胎飨有征，大庇斯民，屡垂丕既。 宜加美号，以答神休，其封神为斓圣将军。 诏命至宫，守真焚香以告，真君忽降言曰：汝当上问官家，所言翊圣者，翊於何圣。 守真数日疑惧，不敢答复。 降言曰：汝但驰奏官家，不罪汝。 守真遂具章以闻，太宗览之，召近臣谓之日：玉皇辅臣，所辅翊者，上帝也。 当以此意报守真，令启白也。 既而内臣传命到宫，守真诣殿，焚香以告，真君日：此意是也。 七年守真复诣阙朝贺，真君忽降言日：吾有言，汝当闻於官家，日大道兴，阴谋灭，诸天众圣皆欣悦。 宋朝社稷甚延年，太平景运初兴发。 君上端心显明哲，爱民治国常须切。 万年基业永长新，金枝玉叶无休歇。 守真得之，到阙以闻，诏赐守真紫衣，号崇元大师。 自后每遣使醮告，真君或有言，守真皆密以闻。 至道初，忽降言谓守真日：吾建隆之初，奉上帝命下降卫时，今基业已成，社稷方永。 承平之世将继有明君，吾已有期，却归天上，汝等不复闻吾言矣。 傥国家祈祷，但严洁焚香，北面告吾，虽不降言，当授福卫护宗社。 又日：汝遇吾下降至今三十五年，勤亦多矣。 上帝已有符命授汝，为五土之主。 此限满日，升汝仙官，汝亦不久住也。 自是不复降言。 明年闰七月十六日，守真谓门人等曰：吾已领符命，今将去矣。 言讫而化。 既而圣上嗣位，崇奉之典，率遵旧式，洎受元符，封泰山，建玉清昭应宫。 於宫中宝符阁之西北隅，作凝命殿，殿后为凝命阁，以奉真君。 大中祥符七年，诏日：诞敷宝命，仰荷於至神，昭报殊征，虔增於懿号，盖为邦之大典，庇民之深旨也。 而况翊宣元化，表式众灵，司阴隐於含生，播明威於福地。 当王基肇启，固降治而已，彰泊文考，续承复先，期而斯应。 由是亟营珍馆，备荐徽章。 蒙介福於无垠，佐鸿图於累盛。 顾惟眇质，绍抚绵区，属典礼之交修，实棋祥之杳委。 缅怀幽赞，敢息钦崇。 是用益以丕称奉之茂，则式达至精之恳，庶申祗答之文。 期克享於寅恭，永保宁於品汇。 爰颁成命，俯告宰司。 深体予怀，共宣其事。 斓圣将军，宜加号日：翊圣保德真君。 翊圣保德传卷上竟 #1『亿』 字原作『该』，据《 道藏辑要》 本改。 翊圣保德传卷中 宋开府仪同三司同中书门下平章事上柱国太原郡开国公王钦若奉劲编集",
      "translated_text": "Soon after, Shoujie fell ill and died, while Guicong perished by the sword. Thus was the warning made clear: Heaven neither conceals merit nor absolves fault.\n\nAt the beginning of the Taiping Xingguo era, Emperor Taizong personally led the campaign against Taiyuan. The Perfected Sovereign suddenly descended and addressed Shouzhen, saying: “The Emperor has already arrived at Fen and Jin. Before long, the city will be retaken. You must instruct the supervising officials to prepare a grand offering to give thanks to the Supreme Emperor for this victory.” Shouzhen and the others replied: “This concerns the great affairs of state. We beg to wait for news of victory.” The Perfected Sovereign said: “Heaven has already determined the outcome of victory and defeat.” Within ten days, the imperial army reported triumph. The supervising officials informed the Emperor, who dispatched the eunuch Lu Wenshou with treasures from the inner treasury—incense, medicinal herbs, imperial calligraphy, and liturgical texts—to the palace, where a grand offering was held to give thanks to the Supreme Emperor.\n\nThat evening, the Perfected Sovereign descended again and said: “The Emperor’s grand offering has brought joy to the Supreme Emperor and all the heavens. The imperial destiny shall endure far beyond that of the Tang.” In the sixth year of Taiping Xingguo, Shouzhen attended court to offer congratulations on the Qianming Festival. Summoned for an audience, he presented a memorial, saying: “The sagely Perfected One has descended to bless our flourishing dynasty. I humbly request that an edict be issued to bestow an honorific title, thereby manifesting its divine favor above.” His request was granted. Soon after, an edict was issued:\n\n> The deity of Taiping Palace, having received its mandate from the Supreme Heaven, descends in spirit to the mortal realm. Its fragrant offerings are presented, and its sacrificial blessings are manifest. It has greatly sheltered the people and repeatedly bestowed its majestic favor. It is fitting to confer a noble title in gratitude for its divine grace. Let the deity be enfeoffed as the **Lan Sheng General**.\n\nWhen the edict arrived at the palace, Shouzhen burned incense to announce it. The Perfected Sovereign suddenly descended and said: “You must ask the Emperor: *What sagely being does ‘Yi Sheng’ (Assisting the Sagely) assist?*” For days, Shouzhen was filled with doubt and fear, not daring to reply. The Perfected Sovereign descended again and said: “Simply report this to the Emperor. You will not be blamed.” Shouzhen then submitted a memorial detailing the matter. Upon reading it, Taizong summoned his close ministers and said: “The Jade Emperor’s assisting minister—the one he assists is the Supreme Emperor.” He instructed that this meaning be conveyed to Shouzhen so that he might relay it.\n\nWhen the imperial command was transmitted to the palace, Shouzhen proceeded to the hall, burned incense, and announced it. The Perfected Sovereign said: “This is correct.” In the seventh year, Shouzhen again attended court to offer congratulations. The Perfected Sovereign suddenly descended and said: “I have a message for you to convey to the Emperor:\n\n> When the Great Dao flourishes, dark schemes perish.\n> All the sages of the heavens rejoice.\n> The Song dynasty’s altars shall endure for ages,\n> As the era of Great Peace begins to rise.\n> Let the sovereign’s heart be upright and wise,\n> Loving the people and governing the state with care.\n> The foundation of ten thousand years shall ever renew,\n> Its golden branches and jade leaves never ceasing.\n\nShouzhen received this and reported it to the court. An edict was issued, bestowing upon him a purple robe and the title **Chongyuan Grand Master**.\n\nThereafter, whenever envoys were sent to perform offerings and announcements, if the Perfected Sovereign had any message, Shouzhen would secretly report it. At the beginning of the Zhidao era, the Perfected Sovereign suddenly descended and addressed Shouzhen, saying: “At the founding of the Jianlong era, I descended by the Supreme Emperor’s command to protect the times. Now the foundation is established, and the altars of state shall endure forever. An era of peace shall follow, with enlightened rulers succeeding one another. My time here has reached its end, and I shall return to the heavens. You will no longer hear my words. If the state should pray for blessings, simply purify the altar, burn incense, and face north to address me. Though I may not descend to speak, I shall bestow fortune and protect the imperial altars.”\n\nThe Perfected Sovereign added: “You have served me from my descent until now for thirty-five years, and your diligence has been great. The Supreme Emperor has issued a talismanic command appointing you as the **Lord of the Five Lands**. When this term is fulfilled, you shall ascend as an immortal official. Your time here will also be short.” From then on, the Perfected Sovereign no longer descended to speak.\n\nThe following year, on the sixteenth day of the intercalary seventh month, Shouzhen said to his disciples: “I have received the talismanic command. Now I shall depart.” With these words, he passed away.\n\nLater, when the new sovereign ascended the throne, the rites of veneration were faithfully observed as before. Upon receiving the *Yuanyou* era name, he performed the Feng and Shan sacrifices, and constructed the Jade Purity Radiant Response Palace. Within the palace, at the northwest corner of the Hall of Precious Talismans, the **Hall of Congealed Mandate** was built, and behind it, the **Pavilion of Congealed Mandate**, to enshrine the Perfected Sovereign.\n\nIn the seventh year of Dazhong Xiangfu, an edict was issued:\n\n> The unfolding of the precious mandate is borne by the supreme deity. In response to its wondrous signs, we reverently augment its august title. This is the great ritual of governance and the profound purpose of sheltering the people. Moreover, it assists in proclaiming the primal transformation, serving as a model for all spirits. It governs the hidden and the manifest among living beings, spreading its luminous majesty across the blessed lands. When the imperial foundation was first laid, it descended to govern and protect. From the late cultured sovereign to the present, it has continued to uphold the legacy of the ancestors, fulfilling its appointed role. Thus, we have repeatedly adorned its sacred halls and presented offerings of reverent praise. It has bestowed boundless fortune and aided the flourishing of our grand enterprise. Reflecting upon our humble self, who now inherits and governs this vast realm, we find that the rituals of veneration coincide with the mysterious workings of auspicious omens. In cherishing its hidden assistance, how dare we cease our reverence? Therefore, we further enhance its glorious title, striving to express our sincerest devotion to the supreme essence. We hope thereby to fulfill the rites of respectful offering, ensuring enduring peace for all beings. Hence, we issue this decree, commanding the ministers to deeply comprehend our intent and jointly proclaim this matter. Let the **Lan Sheng General** be granted the title **Yi Sheng Bao De Zhen Jun** (Perfected Sovereign Who Assists the Sagely and Protects Virtue).\n\n**Record of the Perfected Sovereign Who Assists the Sagely and Protects Virtue, Scroll One** (concluded)\n\n**Record of the Perfected Sovereign Who Assists the Sagely and Protects Virtue, Scroll Two**\nCompiled by Wang Qinruo, Duke of Taiyuan, Grand Mentor of the Heir Apparent, Grand Councilor, and Minister of the Three Departments, under imperial command.",
      "overlap_context": " the walls of the eight minor halls unpainted and the steps, walls, and Sanskrit inscriptions incomplete? You sought only hasty completion to curry favor. However, Heaven will neither conceal your merit nor absolve your fault.” Shoujie and Guicong were deeply alarmed, but as the project had already been reported complete, no further additions could be made. They could only bow in apology and depart. Upon returning to court, both were promoted in rank and rewarded with a thousand taels of silver.",
      "start_char": 2450,
      "end_char": 3594,
      "start_sentence": 104,
      "end_sentence": 153,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.73598337173462,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\翊圣保德传.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "真君之降世也，或时有所授人，即传录。 而岐雍之民，有物魅妖怪为害之极者，皆投诚致告，则守真祈祷，奉教而往，无不怯珍。 凡所灵验，不可胜纪。 今录其传闻者云，守真尝朝礼至玉皇大殿，睹其额曰：通明殿，不晓其旨。 因焚香告日：通明之谊，窃所未喻，敢祈真教。 真君曰：上帝在无上三天，为诸天之尊，万象群仙，无不臣者。 常升金殿，殿之光明，昭一於帝身，身之光明，照於金殿。 光明通彻，无所不照，故为通明殿。 诸天帝君，万灵侍卫，仙众梵佛，悉来朝谒。 仰视其殿，惟见大光明中，上帝俨然，仙班既退，光明褊散诸天焉。 有王叟者，年七十余，少事戎帅，老而退居终南镇。 胆气怪诞妄之事，则扼腕切齿。 自真君之始降，未甚信。 向洎目睹灵异，饮然归仰。 自后常日二时赴宫，焚香伏拜，虽风雨霜雪，未尝暂旷。 一日，忽告守真启殿门，瞻礼焚香，且泣曰：老夫本怀刚气，幼事军门，不信邪魔，常守正直。 百生有幸，得遇上真。 今已衰耗，大期将至。 所愿归全之后，得在左右，以备驱使为万足矣。 真君降言而许之。 未几，叟无疾而终。",
      "translated_text": "The Perfected Sovereign’s descent into the world often involved bestowing teachings upon people, which were then recorded. Among the people of Qi and Yong, whenever malevolent spirits or monstrous beings caused extreme harm, they would sincerely submit petitions. The Guardian of the True [Dao] would then pray and, following the Sovereign’s instructions, set forth—none failed to be subdued. The miracles and proofs of efficacy were too numerous to record. What follows is an account of what has been transmitted:\n\nThe Guardian of the True once paid homage at the Jade Emperor’s grand hall and saw its plaque inscribed: *Hall of Pervading Illumination*. Not understanding its meaning, he burned incense and entreated, saying, “This humble one fails to grasp the significance of *Pervading Illumination*—dare I beseech the Perfected Sovereign’s teaching?”\n\nThe Perfected Sovereign replied: “The Supreme Emperor resides in the Highest Three Heavens, revered as the Lord of all heavens. All phenomena and the host of immortals bow before Him. He ascends the Golden Hall, and the hall’s radiance is wholly concentrated in the Emperor’s form; the Emperor’s radiance, in turn, illuminates the Golden Hall. Light pervades and penetrates all, leaving nothing unillumined—hence it is called the *Hall of Pervading Illumination*. The Lords of the Heavens, the myriad spirits in attendance, and the assembly of immortals, Brahmā, and Buddhas all come to pay homage. Gazing upon the hall, one sees only the Supreme Emperor, majestic within the great radiance. When the immortal ranks withdraw, the light disperses throughout the heavens.”\n\nThere was an old man named Wang, over seventy years of age, who in his youth had served a military commander but retired in his old age to Mount Zhongnan. He scorned absurd and deceitful matters, clenching his fists in indignation. Initially, he did not deeply believe in the Perfected Sovereign’s descent. Yet after witnessing the miraculous with his own eyes, he was moved to reverence. Thereafter, he visited the palace twice daily to burn incense and prostrate himself, never once neglecting his devotion, even amid wind, rain, frost, or snow.\n\nOne day, he suddenly urged the Guardian of the True to open the hall doors so he might gaze upon the Sovereign, burn incense, and weep, saying: “This old man has always been of unyielding spirit. In my youth, I served in the military and scorned demonic forces, ever upholding integrity. Through a hundred lifetimes of fortune, I have encountered the Supreme Perfected. Now, enfeebled and nearing my end, I wish only that after my passing, I may remain at your side to serve as your attendant—this would be more than enough.”\n\nThe Perfected Sovereign descended in speech and granted his request. Soon after, the old man passed away without illness.",
      "overlap_context": "t the **Lan Sheng General** be granted the title **Yi Sheng Bao De Zhen Jun** (Perfected Sovereign Who Assists the Sagely and Protects Virtue).\n\n**Record of the Perfected Sovereign Who Assists the Sagely and Protects Virtue, Scroll One** (concluded)\n\n**Record of the Perfected Sovereign Who Assists the Sagely and Protects Virtue, Scroll Two**\nCompiled by Wang Qinruo, Duke of Taiyuan, Grand Mentor of the Heir Apparent, Grand Councilor, and Minister of the Three Departments, under imperial command.",
      "start_char": 3594,
      "end_char": 4022,
      "start_sentence": 154,
      "end_sentence": 174,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.610348463058472,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\翊圣保德传.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "瑜旬，守真忽於真君殿侧，闻空中有呼其名者，曰… 我铁轮将军也，汝何以略不见录。 守真仰而问曰：真君左右四将军，常侍殿中，守真常所虔事，未知铁轮将军是何星辰名位。 空中又曰：我即王叟也，曾有至愿，乞侍左右。 今蒙收录，使掌铁输，位在四将军之下。 汝今后或有醮祭，勿忘吾名也。 真君尝谓守真日：吾每巡游周天，有诸位灵官、捷疾吏兵数逾百万，彗孛、妖珍知吾骑从所至，皆屏迹远避，岳镇海读可以麾召，而世之物魅邪怪，岂足数耶。 吾念汝正直，付汝剑法，俾汝为民救患禳灾。 汝宜精勤，无或懈息，积功於民，加惠及物。 上天所鉴，当录汝名。 若慢道轻教，不守虚寂，自有阴责矣。 吾若一怒，万物立为埃尘，汝其可当乎。 然汝每有责罚，乃有五小将军怒汝不专勤耳，汝自宜致恭於彼。 汝所兴念，彼各豫知，不可欺心，贻汝祸患。 守真尝一日从容焚香，虔诚问曰：守真睹释氏之教，言天上天下无如佛者，未知三清之上，品位何若。 愿赐真语，以镯蒙滞。 真君降言曰：佛，即西方得道之圣人也。 在三清之中，别有梵天居之。 於上帝，则如世之九卿奉天子也。 守真曰：其教流演颇盛於世，又何理也。 真君曰：教流中聚，帝之念也。 守真曰：道释经典并垂於世，未审崇奉何者，即获其福。 真君曰：《 太上道德经》 ，大无不包，细无不纳。 修身炼行，治家治国。 世人若悟其指归，达其妙用，造次於是，信奉而行，岂惟增福，一咏无所不至矣。 释氏之四十二章经，制心治性，去贪远祸，垂慈训诚，证以善恶，亦一贯於道矣。 奉之求福，固亦无涯。 至于周公孔子，皆列仙品，而五经六籍，治世之法，治民之术，尽在此矣。 世虽讽诵，多不依从。 若口诵而心随，心随而事应。 仁义言行，礼智之道，常存于怀，岂惟正其人事，长生久视之理亦何远矣。 守真又尝启请云：终南山中赤谷神祠者，近乡之人多所祈祀，屠牛、击豕以为飨饥，酒乐喧沸，民氓鼓舞。 若斯之事，其获佑乎。 真君曰：终南山皇名山地、皇福地，人凡境圣，今古皆然。 兴邪致妖，杀命祈福，以兹俟佑，斯亦远矣。 既而草窃潜匿於其下，捕贼者积薪焚之，祠宇煨烬，寂无灵异。 建隆末，长安进士刘顽，颇有文学，出於流辈。 尝诣宫再拜恳祷日：顽欲知将来位秩高卑，愿赐灵诰。 真君降言日：天赋汝文性，不赋汝禄位。 汝若学道退闲，当犹延永，若妄求进，身虑促汝寿等也。 顽闻之，不悦而退。 后三载，果无成而卒。",
      "translated_text": "A few days later, the Guardian of the True suddenly heard a voice calling his name from the void beside the Hall of the Perfected Sovereign. It said: “...I am the Iron Wheel General. Why have you so utterly overlooked me?” The Guardian of the True looked up and asked: “The four generals who attend the Perfected Sovereign are ever present in the hall, and I have always revered them. I do not know which star or rank the Iron Wheel General holds.” The voice from the void replied: “I am the old man Wang. Once I made a most earnest vow, begging to serve at the Sovereign’s side. Now I have been accepted and appointed to oversee the iron wheel, ranking below the four generals. When you perform rites or offer sacrifices in the future, do not forget my name.”\n\nThe Perfected Sovereign once said to the Guardian of the True: “Whenever I traverse the heavens on my rounds, the various spirit officials, swift couriers, and soldiers in my retinue number over a million. Comets and malevolent omens, knowing where my procession arrives, all conceal their traces and flee far away. The peaks and ranges, the seas and rivers, can be summoned at my command—how could the world’s mere specters and demonic aberrations be worth counting? Out of regard for your integrity, I entrust you with the sword arts so that you may save the people from suffering and avert calamity. You must apply yourself with diligence, never growing lax or idle. Accumulate merit among the people, extend kindness to all things. Heaven observes all, and your name shall be recorded. But if you treat the Dao with negligence, take its teachings lightly, and fail to uphold emptiness and stillness, you will incur unseen retribution. If I were to grow angry, all things would instantly turn to dust—could you withstand that? Yet when you face punishment, it is only because the five lesser generals are displeased with your lack of devotion. You should show them due reverence. Whatever thoughts arise in you, they already know beforehand. Do not deceive yourself, lest you bring misfortune upon yourself.”\n\nOne day, the Guardian of the True burned incense with leisurely composure and reverently asked: “I have observed the teachings of the Buddha, which declare that in all the heavens above and the earth below, none surpass the Buddha. I wonder, above the Three Clarities, what rank and position do they hold? I humbly beg for your true words to dispel my ignorance.” The Perfected Sovereign descended in speech and said: “The Buddha is a sage who attained the Dao in the West. Among the Three Clarities, there is a separate realm where Brahmā resides. In relation to the Supreme Emperor, they are like the nine ministers serving the Son of Heaven in the mortal world.”\n\nThe Guardian of the True asked: “Yet his teachings have spread widely throughout the world—what is the reason for this?” The Perfected Sovereign replied: “The flourishing of a teaching depends on the Emperor’s will.” The Guardian of the True then asked: “Both Daoist and Buddhist scriptures have been handed down to the world. If one wishes to venerate and follow one of them, which will bring blessings?” The Perfected Sovereign said: “The *Scripture of the Dao and Its Virtue* encompasses all that is vast and embraces all that is minute. It refines the self and cultivates conduct, governs the family and rules the state. If people could grasp its essential meaning, fathom its wondrous use, and in all moments believe in it and practice it, they would not merely increase their blessings—there is nothing they could not attain. The Buddhist *Sutra in Forty-Two Sections* disciplines the mind and cultivates nature, eliminates greed and distances misfortune, imparts compassionate instruction and admonition, and demonstrates good and evil—it too is wholly aligned with the Dao. To follow it in seeking blessings would certainly bring boundless benefit. As for the Duke of Zhou and Confucius, both are ranked among the immortals, and the Six Classics and their commentaries contain the methods for governing the world and the arts of ruling the people—all is therein. Though the world recites them, few truly follow their teachings. If one’s mouth recites while the heart follows, and the heart follows while actions correspond, if the ways of benevolence, righteousness, propriety, and wisdom are always held in mind, then not only will human affairs be rectified, but the principles of long life and enduring vision are not far off.”\n\nThe Guardian of the True once again made a request: “In the Red Valley of Mount Zhongnan, there is a shrine to the valley spirit. The people of the nearby villages often make offerings there, slaughtering oxen and pigs for feasts, with wine and music clamoring loudly, and the common folk dancing. In such matters, do they receive protection?” The Perfected Sovereign said: “Mount Zhongnan is an imperial mountain and a land of imperial blessing. From ancient times to the present, the distinction between the sacred and the profane has always been clear. To invoke evil and summon demons, to kill living beings in pursuit of blessings—how could such acts bring protection? Later, bandits hid in the shrine’s vicinity, and those who hunted them piled brushwood and set it ablaze. The shrine was reduced to ashes, and no numinous signs remained.”\n\nAt the end of the *Jianlong* era, the scholar Liu Wan of Chang’an, who possessed considerable literary talent and stood out among his peers, once came to the hall, bowed twice, and earnestly prayed: “I wish to know whether my future rank and position will be high or low. I beg for a divine revelation.” The Perfected Sovereign descended in speech and said: “Heaven has bestowed upon you a literary nature but not an official’s rank. If you study the Dao and withdraw into seclusion, you may yet prolong your years. If you recklessly seek advancement, you will hasten your own end.” Liu Wan heard this, departed in displeasure, and three years later, he indeed died without having achieved success.",
      "overlap_context": "s old man has always been of unyielding spirit. In my youth, I served in the military and scorned demonic forces, ever upholding integrity. Through a hundred lifetimes of fortune, I have encountered the Supreme Perfected. Now, enfeebled and nearing my end, I wish only that after my passing, I may remain at your side to serve as your attendant—this would be more than enough.”\n\nThe Perfected Sovereign descended in speech and granted his request. Soon after, the old man passed away without illness.",
      "start_char": 4022,
      "end_char": 4958,
      "start_sentence": 175,
      "end_sentence": 215,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.77943205833435,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\翊圣保德传.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "雍熙中，华山希夷先生陈搏，卒於张超谷石室中，世多传其羽化。 ．守真朝礼之，次因焚香启告日：华山陈搏近卒，时人谓之尸解，未审其人功行证仙阶乎，敢希上真略赐指谕。 真君降言日：搏之炼气养神，颇得其要。 然及物之功未至，但有所主掌耳。 端拱中，知凤翔府比部郎中高凝枯，尝诣宫致礼，既去，真君忽降言於监宫李铸日：高凝枯行亏忠信，死非久矣。 铸窃志之，俄而凝枯秩满还京，为三司判官。 铸闻之，乃复焚香启告日：高凝枯今为此职，又何福耶。 真君降言日：死将至矣。 数月而凝枯卒。 吏部尚书宋白，乾德中，家于整屋有弟小，字曰：岐哥。 年十余岁，为狐魅所惑，号呼无度，举动失常，忽力敌数夫，家人莫能制。 医砭之辈至者，必遭凌扑。 白因斋心遣所亲诣宫致梼，恳求卫护，真君降言曰：汝去，吾当令守真往彼。 守真受教而往，方至其家，坐於客馆，而岐哥已觉伟惶失次，家人遽出迎拜。 守真具问之，因厉声呼其名，须臾，岐哥自拌其首，从中唯唯而出，至守真前，战汗悚息。 守真呵责，移时鬼乃露形，叩头伏罪。 守真以卫戮之，应手而毙。 岐哥仆地良久而苏，即获平愈。 真君尝忽谓守真日：山下李靖庙中，有狐鬼数十，盘泊於彼，本方地神适有驰报。 虑其为妖害民，汝可速往逐之。 守真禀命，仗剑而去。 须臾，坐於庙前震呼数四，俄而狐鬼数十悉出，遍列於前，惶惑惊怖。 守真乃责之日：此上真下降之地，汝辈岂宜杂处。 今未欲戮，汝可速返林莽，无以血污吾灵剑。 鬼等相顾，狼狈匍匐而散。 守真自往至还，曾不移时。 有寓宫道士王德渊问其所适，守真具道之。 德渊曰：自此至彼，往复二十里，何其速耶。 守真日：我离庙时，以剑挥下庭树低枝在地，汝可验也。 德渊俟晓跃马而观焉，果於庙前闻腥秽之气，不可近，得断枝而还，始再拜，称异。 时又有妖狐数百，在邓州城中，颇为怪异。 守真闻之，因焚香致告，具道其事，愿奉教往彼除之。 真君降言曰：此狐妖辈，尝於长安南山中，化形为菩萨之状，诱彼居民舍财为供。 其问回心归善，亦十有八九。 上帝以此故，授其符命，俾为邓州土地。 亦有数于周公孔子，皆列仙品，而五经六籍，治世之法，治民之术，尽在此矣。 世虽讽诵，多不依从。 若口诵而心随，心随而事应。 仁义言行，礼智之道，常存于怀，岂惟正其人事，长生久视之理亦何远矣。 守真又尝启请云：终南山中赤谷神祠者，近乡之人多所祈祀，屠牛、击豕以为飨饥，酒乐喧沸，民氓鼓舞。 若斯之事，其获佑乎。 真君曰：终南山皇名山地、皇福地，人凡境圣，今古皆然。 兴邪致妖，杀命祈福，以兹俟佑，斯亦远矣。 既而草窃潜匿於其下，捕贼者积薪焚之，祠宇煨烬，寂无灵异。 建隆末，长安进士刘顽，颇有文学，出於流辈。 尝诣宫再拜恳祷日：顽欲知将来位秩高卑，愿赐灵诰。 真君降言日：天赋汝文性，不赋汝禄位。 汝若学道退闲，当犹延永，若妄求进，身虑促汝寿等也。 顽闻之，不悦而退。 后三载，果无成而卒。",
      "translated_text": "During the *Yongxi* era, Master Chen Tuan of Mount Hua, known as the Recluse of Secluded Mystery, passed away in a stone chamber at Zhangchao Valley. Many in the world transmitted accounts of his ascension. Guarding Perfection paid homage at the shrine and, while burning incense, respectfully petitioned: “Master Chen Tuan of Mount Hua has recently died, and people say he achieved *shijie*—liberation through the corpse. Yet I dare not presume to know whether his merits and conduct have truly attained the ranks of immortality. I humbly beseech the Supreme Perfected to grant me a brief instruction.”\n\nThe Perfected Sovereign descended in speech and said: “Chen Tuan’s cultivation of *qi* and nurturing of spirit grasped the essentials. However, his merit in benefiting others was not yet complete; he merely held a specific office.”\n\nDuring the *Duan’gong* era, Gao Ningku, a *Bibu Langzhong* who served as prefectural governor of Fengxiang, once came to the hall to pay his respects. After he departed, the Perfected Sovereign suddenly descended in speech to the temple overseer, Li Zhu, saying: “Gao Ningku’s conduct lacks loyalty and sincerity. His death will not be long in coming.” Li Zhu secretly recorded this. Soon after, Gao Ningku completed his term and returned to the capital, where he was appointed a *San Si Pan Guan*. Upon hearing this, Li Zhu once again burned incense and petitioned: “Gao Ningku now holds this office—what good fortune does this portend?”\n\nThe Perfected Sovereign descended in speech and said: “Death is near.” Within months, Gao Ningku died.\n\nDuring the *Qiande* era, Minister of Personnel Song Bai resided in Zhengwu. He had a younger brother, small in stature, named Qige. At the age of ten, Qige was bewitched by a fox spirit, wailing uncontrollably and behaving erratically. At times, his strength rivaled that of several men, and his family could not restrain him. Every physician who came to treat him with acupuncture was beaten and driven away. Song Bai, purifying his heart, sent a trusted attendant to the temple to offer prayers and earnestly seek protection.\n\nThe Perfected Sovereign descended in speech and said: “Go. I shall send Guarding Perfection to him.” Guarding Perfection received the command and set out. Upon arriving at the household and sitting in the guest hall, Qige suddenly became flustered and disoriented. The family hurried out to greet and bow to Guarding Perfection. After questioning them in detail, Guarding Perfection sternly called Qige’s name. In an instant, Qige shook his head, and from within, a faint murmur emerged. He approached Guarding Perfection, trembling and drenched in sweat. Guarding Perfection rebuked the spirit, and after some time, the ghost revealed its form, kowtowing and admitting its guilt. Guarding Perfection executed it with a protective talisman, and the ghost perished at once. Qige collapsed to the ground and lay unconscious for a long while before reviving, fully restored to health.\n\nThe Perfected Sovereign once suddenly addressed Guarding Perfection: “At the shrine of Li Jing at the foot of the mountain, dozens of fox spirits have gathered. The local earth god has just sent an urgent report. Fearing they may harm the people, you must hasten to expel them.” Guarding Perfection received the command, took up his sword, and departed. In an instant, he arrived before the shrine and shouted several times in a voice like thunder. Soon, dozens of fox spirits emerged, lining up before him in fear and trembling.\n\nGuarding Perfection rebuked them: “This is a place where the Supreme Perfected descends. How dare you defile it? I do not wish to slay you now. Return swiftly to the forests and thickets, and do not stain my sacred sword with blood.” The spirits glanced at one another, then scrambled away in disarray. Guarding Perfection’s departure and return took scarcely any time at all.\n\nA Daoist residing at the temple, Wang Deyuan, asked where he had gone. Guarding Perfection recounted the events in full. Wang Deyuan said: “The journey there and back is twenty *li*—how could you have returned so quickly?”\n\nGuarding Perfection replied: “When I left the shrine, I swung my sword and cut a low-hanging branch from the courtyard tree. You may verify this.” At dawn, Wang Deyuan mounted his horse to investigate. Before the shrine, he detected a foul, putrid stench that made it impossible to approach. He retrieved the severed branch and returned, then bowed twice in astonishment.\n\nAt that time, several hundred fox spirits were causing disturbances in Dengzhou. Guarding Perfection, upon hearing this, burned incense and petitioned, recounting the matter in full and requesting permission to travel there and eliminate them.\n\nThe Perfected Sovereign descended in speech and said: “These fox spirits once transformed into the likeness of bodhisattvas in the Southern Mountains of Chang’an, deceiving local residents into offering wealth as alms. Yet among them, eight or nine out of ten have since turned their hearts toward goodness. For this reason, the Celestial Emperor granted them a mandate to serve as the earth gods of Dengzhou. Even among those like the Duke of Zhou and Confucius, who are ranked among the immortals, the methods of governing the world and ruling the people are all contained within the Five Classics and Six Classics. Though the world recites them, few follow their teachings. If one’s speech aligns with the heart, and the heart aligns with action—if the Way of benevolence, righteousness, propriety, and wisdom is always held in mind—then not only will human affairs be rectified, but the principles of longevity and enduring vision will be close at hand.”\n\nGuarding Perfection once again petitioned: “At the shrine of the Red Valley spirit in the Zhongnan Mountains, many from the nearby villages offer prayers, slaughtering oxen and pigs as offerings, with wine and music resounding loudly, and the people dancing in revelry. Do such acts bring divine favor?”\n\nThe Perfected Sovereign said: “The Zhongnan Mountains are an imperial mountain and a land of imperial blessing. From the common to the sacred, this has been true in all ages. To invoke evil and summon demons, to kill living beings and pray for blessings—how can such acts bring protection? They are far from it indeed.”\n\n...piled brushwood and set it ablaze. The shrine was reduced to ashes, and no numinous signs remained.\n\nAt the end of the *Jianlong* era, the scholar Liu Wan of Chang’an, who possessed considerable literary talent and stood out among his peers, once came to the hall, bowed twice, and earnestly prayed: “I wish to know whether my future rank and position will be high or low. I beg for a divine revelation.” The Perfected Sovereign descended in speech and said: “Heaven has bestowed upon you a literary nature but not an official’s rank. If you study the Dao and withdraw into seclusion, you may yet prolong your years. If you recklessly seek advancement, you will hasten your own end.” Liu Wan heard this, departed in displeasure, and three years later, he indeed died without having achieved success.",
      "overlap_context": " “I wish to know whether my future rank and position will be high or low. I beg for a divine revelation.” The Perfected Sovereign descended in speech and said: “Heaven has bestowed upon you a literary nature but not an official’s rank. If you study the Dao and withdraw into seclusion, you may yet prolong your years. If you recklessly seek advancement, you will hasten your own end.” Liu Wan heard this, departed in displeasure, and three years later, he indeed died without having achieved success.",
      "start_char": 4958,
      "end_char": 6100,
      "start_sentence": 216,
      "end_sentence": 265,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.411386489868164,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\翊圣保德传.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "雍熙中，华山希夷先生陈搏，卒於张超谷石室中，世多传其羽化。 ．守真朝礼之，次因焚香启告日：华山陈搏近卒，时人谓之尸解，未审其人功行证仙阶乎，敢希上真略赐指谕。 真君降言日：搏之炼气养神，颇得其要。 然及物之功未至，但有所主掌耳。 端拱中，知凤翔府比部郎中高凝枯，尝诣宫致礼，既去，真君忽降言於监宫李铸日：高凝枯行亏忠信，死非久矣。 铸窃志之，俄而凝枯秩满还京，为三司判官。 铸闻之，乃复焚香启告日：高凝枯今为此职，又何福耶。 真君降言日：死将至矣。 数月而凝枯卒。 吏部尚书宋白，乾德中，家于整屋有弟小，字曰：岐哥。 年十余岁，为狐魅所惑，号呼无度，举动失常，忽力敌数夫，家人莫能制。 医砭之辈至者，必遭凌扑。 白因斋心遣所亲诣宫致梼，恳求卫护，真君降言曰：汝去，吾当令守真往彼。 守真受教而往，方至其家，坐於客馆，而岐哥已觉伟惶失次，家人遽出迎拜。 守真具问之，因厉声呼其名，须臾，岐哥自拌其首，从中唯唯而出，至守真前，战汗悚息。 守真呵责，移时鬼乃露形，叩头伏罪。 守真以卫戮之，应手而毙。 岐哥仆地良久而苏，即获平愈。 真君尝忽谓守真日：山下李靖庙中，有狐鬼数十，盘泊於彼，本方地神适有驰报。 虑其为妖害民，汝可速往逐之。 守真禀命，仗剑而去。 须臾，坐於庙前震呼数四，俄而狐鬼数十悉出，遍列於前，惶惑惊怖。 守真乃责之日：此上真下降之地，汝辈岂宜杂处。 今未欲戮，汝可速返林莽，无以血污吾灵剑。 鬼等相顾，狼狈匍匐而散。 守真自往至还，曾不移时。 有寓宫道士王德渊问其所适，守真具道之。 德渊曰：自此至彼，往复二十里，何其速耶。 守真日：我离庙时，以剑挥下庭树低枝在地，汝可验也。 德渊俟晓跃马而观焉，果於庙前闻腥秽之气，不可近，得断枝而还，始再拜，称异。 时又有妖狐数百，在邓州城中，颇为怪异。 守真闻之，因焚香致告，具道其事，愿奉教往彼除之。 真君降言曰：此狐妖辈，尝於长安南山中，化形为菩萨之状，诱彼居民舍财为供。 其问回心归善，亦十有八九。 上帝以此故，授其符命，俾为邓州土地。 亦有数限，俟其岁满，当自远去，无能为害，汝不必往也。 开宝中，凤翔府民陈英美家，有山魑为怪，投掷瓦砾，日盈其庭。 时放烟焰，欲焚其舍。 财物耗散，亲族愁苦。",
      "translated_text": "During the *Yongxi* era, Master Chen Tuan of Mount Hua, known as the Recluse of Secluded Mystery, passed away in a stone chamber at Zhangchao Valley. Many in the world transmitted accounts of his ascension. Guarding Perfection went to pay homage and, while burning incense, respectfully petitioned: “Master Chen Tuan of Mount Hua has recently died, and people say he achieved *shijie* (release from the corpse). I humbly inquire whether his cultivation and conduct have truly attained the ranks of immortality, and beg the Supreme Perfected to deign to offer guidance.”\n\nThe Perfected Sovereign descended in speech and said: “Chen Tuan’s refinement of *qi* and nurturing of spirit grasped the essentials. Yet his merit in benefiting others was insufficient—he merely held a specific office. In the *Duangong* era, Gao Ninggu, a *Bibu Langzhong* (Vice Director of the Ministry of Justice) who oversaw Fengxiang Prefecture, once came to the palace to pay his respects. After he departed, the Perfected Sovereign suddenly descended in speech to the palace overseer Li Zhu, saying: ‘Gao Ninggu’s conduct lacks loyalty and trustworthiness; his death is not far off.’ Li Zhu secretly noted this. Soon after, Ninggu completed his term and returned to the capital to serve as a *San Si Pan Guan* (Judicial Officer of the Three Departments). Upon hearing this, Li Zhu again burned incense and petitioned: ‘Now that Gao Ninggu holds this position, what fortune does he possess?’ The Perfected Sovereign descended in speech and said: ‘Death is imminent.’ Within months, Ninggu died.\n\nDuring the *Qiande* era, Minister of Personnel Song Bai resided in Zhengwu. He had a younger brother, small in stature, named Qige. At the age of ten, Qige was bewitched by a fox spirit, wailing uncontrollably and behaving abnormally. At times, his strength equaled that of several men, and his family could not restrain him. Every physician who came to treat him with acupuncture was assaulted. Song Bai, with a purified heart, sent a trusted attendant to the palace to offer prayers and earnestly seek protection. The Perfected Sovereign descended in speech, saying: ‘Go. I shall send Guarding Perfection to him.’ Guarding Perfection received the command and set out. Upon arriving at the household and sitting in the guest hall, Qige’s agitation and disorder abruptly ceased. The family hurried out to welcome and bow to him. Guarding Perfection questioned them in detail, then sternly called Qige’s name. In an instant, Qige shook his head, and from within, a faint murmur emerged. He approached Guarding Perfection, trembling and drenched in sweat. Guarding Perfection rebuked him, and after some time, the ghost revealed its form, kowtowing and admitting guilt. Guarding Perfection executed it with a protective talisman, and it died instantly. Qige collapsed to the ground and lay unconscious for a long while before reviving, fully restored to health.\n\nThe Perfected Sovereign once suddenly addressed Guarding Perfection, saying: ‘At the Li Jing Temple beneath the mountain, dozens of fox spirits have gathered. The local earth god has just sent an urgent report. Fearing they will harm the people, you must hasten to expel them.’ Guarding Perfection received the command, took up his sword, and departed. In an instant, he sat before the temple and shouted several times in a thunderous voice. Soon, dozens of fox spirits emerged, arraying themselves before him in fear and dread. Guarding Perfection rebuked them, saying: ‘This is a place where the Supreme Perfected descends. How dare you linger here? I do not wish to slay you now. Return swiftly to the wilds, and do not defile my sacred sword with blood.’ The spirits glanced at one another, then fled in disarray, crawling away on all fours.\n\nFrom Guarding Perfection’s departure to his return, scarcely any time had passed. The palace-dwelling Daoist Wang Deyuan asked where he had gone, and Guarding Perfection recounted the events. Deyuan said: ‘From here to there is a round trip of twenty *li*. How could you have returned so quickly?’ Guarding Perfection replied: ‘When I left the temple, I struck a low-hanging branch of a tree in the courtyard with my sword. You may verify this.’ At dawn, Deyuan mounted his horse to investigate. Indeed, before the temple, he detected a foul, putrid stench that made approach impossible. He retrieved the severed branch and returned, then bowed twice in astonishment.\n\nAt another time, hundreds of malevolent foxes gathered in Dengzhou, causing strange disturbances. Guarding Perfection, upon hearing this, burned incense and petitioned, recounting the matter and expressing his willingness to follow the Perfected Sovereign’s command to eliminate them. The Perfected Sovereign descended in speech, saying: ‘These fox spirits once transformed into the likeness of bodhisattvas in the Southern Mountains of Chang’an, deceiving local residents into offering wealth as alms. Yet among them, eight or nine out of ten have since turned toward goodness. For this reason, the Celestial Emperor granted them a mandate to serve as the earth gods of Dengzhou. Their term has limits; when it expires, they will depart of their own accord and pose no further harm. You need not go.’\n\nDuring the *Kaibao* era, in the household of Chen Yingmei, a resident of Fengxiang Prefecture, a mountain sprite caused disturbances, hurling tiles and stones until the courtyard was filled. At times, it emitted smoke and flames, threatening to burn down the house. Wealth was squandered, and the family and relatives were consumed by sorrow.",
      "overlap_context": " “I wish to know whether my future rank and position will be high or low. I beg for a divine revelation.” The Perfected Sovereign descended in speech and said: “Heaven has bestowed upon you a literary nature but not an official’s rank. If you study the Dao and withdraw into seclusion, you may yet prolong your years. If you recklessly seek advancement, you will hasten your own end.” Liu Wan heard this, departed in displeasure, and three years later, he indeed died without having achieved success.",
      "start_char": 6100,
      "end_char": 6988,
      "start_sentence": 266,
      "end_sentence": 304,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.884790658950806,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\翊圣保德传.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "召术士禳禁，命僧徒课诵，皆不能止。 乃移居远遁，亦蹑迹而至。 英美计无所出，因斋戒持香果诣官，精虔以告，真君降言谓守真日：汝速受吾令，往为遣除。 守真再拜，负剑跃马，再宿而至其家。 而掷瓦之声，喧嚣如故。 观者填咽，皆日：此道士必不能去此怪。 守真乃盥涤严洁，整衣引剑而入，其怪忽然而止。 是夕，为坛於庭中，守真嘤剑立其上，厉声徐呼曰：山魑鬼何在乎，傥为妖未已，当出与吾较胜，不然，则当去万里之外，释汝之罪。 如此移时，悄无影响。 自是，其家安肃。",
      "translated_text": "They summoned ritual masters to perform exorcisms and commanded Buddhist monks to recite scriptures, yet none could halt the disturbances. The family then relocated to escape, but the sprite followed their tracks and arrived as well. At a loss, Yingmei fasted, purified himself, and bearing incense and fruit offerings, went to the temple to make a devout plea. The Perfected Lord descended and addressed Shouzhen, saying: \"Hasten to receive my command and go dispel this affliction.\"\n\nShouzhen bowed twice, strapped on his sword, and leapt upon his horse. After two nights’ journey, he arrived at the household. Yet the clamor of hurled tiles continued unabated. The onlookers thronged the path, all saying: \"This Daoist will surely fail to banish this sprite.\"\n\nShouzhen then washed himself with utmost purity, straightened his robes, drew his sword, and entered. Suddenly, the disturbances ceased. That evening, he erected an altar in the courtyard. Standing upon it with sword in hand, he called out in a measured yet stern voice: \"Where is the mountain sprite? If you persist in your mischief, come forth and contend with me. If not, you must depart ten thousand *li* away and I shall absolve your transgressions.\"\n\nFor some time, there was no response. From that moment on, the household knew peace and quiet.",
      "overlap_context": "erve as the earth gods of Dengzhou. Their term has limits; when it expires, they will depart of their own accord and pose no further harm. You need not go.’\n\nDuring the *Kaibao* era, in the household of Chen Yingmei, a resident of Fengxiang Prefecture, a mountain sprite caused disturbances, hurling tiles and stones until the courtyard was filled. At times, it emitted smoke and flames, threatening to burn down the house. Wealth was squandered, and the family and relatives were consumed by sorrow.",
      "start_char": 6988,
      "end_char": 7203,
      "start_sentence": 305,
      "end_sentence": 314,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.369482755661011,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\翊圣保德传.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "乃随守真诣宫，陈醮以谢焉。 又长安富民杨氏家，亦有鬼物为怪，掷瓦纵火，一日万变。 聚族忧惶，莫可宁处。 时有术士李捉鬼者，尤善符禁。 杨氏召之，方及其门，若为物所击，匍匐而起，俄复颠陨，如是者三，遂狼狈而走。 杨氏复召僧众为道场，诵经作梵咀以秽之，俄又若有物攫其道具，或投於屋，或叶於井，覃僧惶惧而去。 乃至梼衣、砧石，亦自空中腾起，三三两两，相逐而落庭中，遇物凌触，而物无所损。 如是之怪尤众，不可具纪。 杨氏素闻真君之灵，乃躬持香烛等驰赴，焚祷具言其怪，且求驱珍，真君降言曰：汝当速归，吾令守真继往也。 守真寻再拜，而往其家。 士民观者，填溢其户。 守真易衣整冠，呎水挥剑，行於四隅，其怪即寂然无声。 守真谓杨氏日：此妖伏矣。 请为醮以核之，向夕，结坛焚章，礼毕而去。 一城之众，稽首称叹。 守真既归，杨氏随诣宫中，陈醮以谢。 又富民刘文际者，忽为狐鬼所惑，心神恍惚，动止不宁。 市中逢道流语日：子面有妖气，必为邪物所着，真君下降，可虔心祷之，必愈斯疾。 文际乃自资香烛，晨夕驰赴，中路为鬼物所追，或为僧尼、妇女，或为商贾万端，诱惑不进，文际既迷且惑。 复遇道流於路，具告其故，道流谓曰：是皆鬼物也，汝宜径往，无或退志，为草妖所害。 文际心悟，不数日奔追至宫，洁．斋恳至，百拜殿下，真君降言日：知汝远来，吾今令守真为汝除邪。 是夕，守真立文际於庭中，守真仗剑嘤水，呵叱数四，文际懵然踏於地，移时而起，曰：适先生呵叱之际，见数人若神将者，各· 擒二鬼而去。 文际惶骇，不觉颠仆，今神思清爽，如酣醉之始醒也。 百拜而去。",
      "translated_text": "Then, accompanying Shouzhen, they journeyed to the temple to present offerings and give thanks.\n\nAnother wealthy household in Chang’an, the Yang family, was likewise plagued by a specter that hurled tiles and set fires, shifting its mischief a thousandfold in a single day. The entire clan lived in dread, finding no peace. At the time, there was a thaumaturge named Li Zhuogui, renowned for his mastery of talismans and exorcisms. The Yangs summoned him, but as he neared their gate, he was struck as if by some unseen force, crawling to his feet only to collapse again. This happened thrice before he fled in disarray.\n\nThe Yangs then invited a host of monks to perform a *daochang* ritual, chanting sutras and reciting mantras to purify the premises. Suddenly, their ritual implements were snatched away—some hurled onto the roof, others cast into the well—and the monks, seized by terror, fled. Even garments and washing stones took flight, rising into the air in twos and threes before tumbling into the courtyard. Whatever they struck remained unharmed. Such uncanny disturbances multiplied beyond recounting.\n\nHaving long heard of the True Lord’s divine power, the Yangs personally carried incense and candles in haste to the temple. There, they prostrated themselves, recounting the haunting and beseeching deliverance. The True Lord descended with a decree: “Return swiftly. I shall send Shouzhen to follow.”\n\nShouzhen bowed deeply and set out for the Yang residence. The onlookers—scholars and commoners alike—crowded the doorways. Shouzhen changed into fresh robes, adjusted his cap, spat water, and brandished his sword, pacing the four corners of the house. At once, the disturbances fell silent.\n\nShouzhen said to the Yangs: “The fiend is subdued. Prepare an offering to confirm its banishment.” That evening, they erected an altar and burned memorials. After the rites concluded, he departed. The entire city bowed in awe and praise.\n\nAfter Shouzhen returned, the Yangs followed him to the temple to present offerings in gratitude.\n\nThere was also a wealthy merchant named Liu Wenji who had fallen under the bewitchment of a fox spirit. His mind grew restless, his movements erratic. One day, he encountered a Daoist in the marketplace who said: “Your face bears the mark of a demonic presence. You must have been ensnared by an evil entity. The True Lord has descended—pray to him with utmost sincerity, and this affliction will surely be cured.”\n\nWenji then prepared incense and candles, rushing to the temple morning and night. On the road, he was pursued by spectral apparitions—sometimes monks or nuns, sometimes women, sometimes merchants—each assuming myriad forms to lure and obstruct him. Wenji, both bewildered and entranced, lost his way. He encountered another Daoist on the road and recounted his plight. The Daoist said: “These are all ghostly illusions. Press onward without hesitation, lest you fall prey to the malevolent spirits.”\n\nWenji’s mind cleared. Within days, he hastened to the temple, purifying himself and prostrating with utmost devotion. After a hundred bows before the altar, the True Lord descended with a decree: “I know of your long journey. I now command Shouzhen to expel the evil for you.”\n\nThat evening, Shouzhen stood Wenji in the courtyard. Wielding his sword and spitting water, he uttered sharp rebukes several times. Wenji, dazed, collapsed to the ground. After some time, he rose and said: “Just now, as you rebuked me, I saw several figures resembling divine generals, each seizing two ghosts and dragging them away.” Trembling with fear, Wenji had fainted without realizing it. Now, his spirit felt clear and refreshed, as if awakening from a deep intoxication. He bowed a hundred times and departed.",
      "overlap_context": "raightened his robes, drew his sword, and entered. Suddenly, the disturbances ceased. That evening, he erected an altar in the courtyard. Standing upon it with sword in hand, he called out in a measured yet stern voice: \"Where is the mountain sprite? If you persist in your mischief, come forth and contend with me. If not, you must depart ten thousand *li* away and I shall absolve your transgressions.\"\n\nFor some time, there was no response. From that moment on, the household knew peace and quiet.",
      "start_char": 7203,
      "end_char": 7840,
      "start_sentence": 315,
      "end_sentence": 338,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.8375084400177,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\翊圣保德传.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "翊圣保德传卷中竟 翊圣保德传卷下 宋开府仪同三司同中书门下平章事上柱国太原郡开国公王钦若奉劲编集 自真君之临降，官吏、民庶不远千里，或驰诚遥祷，或斋洁朝拜，以祈真哑，时有所闻。 大抵多随其性习，加以训勖。 人臣依於忠，人子依於孝。 清淳者，示之格言。 贪酷者，警以要道。 词甚平易，颇叶音韵，然获闻之者至寡。 今据其所传，录之如左。 乾德中，骊山白鹿观道士冯洞元，朝礼之，次焚香虔告曰：洞元讲孔子之书，依老子之教，积有年矣，而修身炼行，未得真旨。 幸逢上圣，敢求一古。 。",
      "translated_text": "The *Central Transmission of the Venerable Protector of Virtue* concludes here.\n*Further Transmission of the Venerable Protector of Virtue*\n\nCompiled by Wang Qinruo, Duke of Taiyuan Commandery, Grand Mentor of the Heir Apparent, Grand Councilor of the Chancellery and the Secretariat, and Minister of Works of the Song Dynasty, who reverently undertook this task.\n\nSince the True Lord’s advent, officials and commoners alike have journeyed from afar—some sending forth sincere prayers from afar, others purifying themselves to prostrate in worship—all seeking the True Lord’s response, and at times, their pleas have been heard.\n\nFor the most part, his teachings adapt to each person’s nature and habits, offering guidance and admonition:\nTo ministers, he upholds loyalty;\nto children, he upholds filial piety.\nTo the pure and sincere, he imparts refined maxims;\nto the greedy and cruel, he warns with essential truths.\nHis words are simple and accessible, often harmonious in rhythm, yet those who hear them remain few.\n\nNow, based on what has been transmitted, we record them as follows.\n\nDuring the Qiande era, Feng Dongyuan, a Daoist of the White Deer Abbey on Mount Li, was paying homage when he lit incense and reverently addressed the True Lord: “Dongyuan has expounded the books of Confucius and followed the teachings of Laozi for many years, yet in cultivating the self and refining conduct, I have not grasped the true essence. Now, by the fortune of encountering a supreme sage, I dare to seek a single ancient teaching.”",
      "overlap_context": "zhen stood Wenji in the courtyard. Wielding his sword and spitting water, he uttered sharp rebukes several times. Wenji, dazed, collapsed to the ground. After some time, he rose and said: “Just now, as you rebuked me, I saw several figures resembling divine generals, each seizing two ghosts and dragging them away.” Trembling with fear, Wenji had fainted without realizing it. Now, his spirit felt clear and refreshed, as if awakening from a deep intoxication. He bowed a hundred times and departed.",
      "start_char": 7841,
      "end_char": 8079,
      "start_sentence": 339,
      "end_sentence": 351,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.207944393157959,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\翊圣保德传.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "真君降言日：到境始知安，形忙灵物闲。 真空须照达，幽微即大还。 动观无障碍，希夷合自然。 功成神莫测，变化可冲天。 去住由自己，三官赦旧愆。 命曹除罪簿，六丁奏上天。 众生要修道，须知元上源。 洞元百拜，虔谢而去。 开宝中，侍御史路冲奉诏知凤翔府，就宫礼请守真，就府署中陈醮祈降。 是夕，洁斋致祷曰：冲身拘职守，阻拜真仪，辄以苹藻，虔祈降鉴，乞赐真语，以导蒙昧。 真君降言日：尽力事君，以为忠臣。 浊财勿顾，邪事莫闻。 整雪刑岳，救疗人民。 动合王道，终为吉人。 积愆为咎，必有沈沦。 众生本无形之性，配有形之躯。 旷劫以来，不能自悟。 自有无极世界，不夜之乡，混合太虚，杳冥同理。 又日：六合乾坤内，众生多不会。 造业向前行，如盲蓦江海。 如将智惠观，自越千重海。 冲再拜，录而诵之。 左补阙王龟从，一日斋心诣宫，焚香恳祷曰：凡庸贱类，衅咎无涯，幸逢上真，愿赐灵诲，如何修身，得获遐寿。 真君降言日：劝汝修炼，莫如精勤，精勤不息，上圣皆闻。 太平降世，用武兴文，无文则不正，用文则益君。 食禄利勿违王命，行吉善但守清贫。 清贫者，响合天地。 浊富者，像火投冰。 投冰者，火绿渐灭。 积恶者，自贯其身。 自贯者，殃及七祖，地府下痛害及亲。 吾悬千尺之索，提钓有绿之人。 道之尊，德之贵，大道能生一切物。 众生头像天，足像地，中心空然合真理。 凿户牖以为室，房室之中有一物，亦无影亦无形，杳杳冥冥人不识，若能识者得长生。 阳在天，阴在地，二气同和诚有谓。 空中造化乃自然，自然之中生万类。 天不高，地不卑，大道混合虚元理。 学道众生审欲闻，此是修行崇妙门。 开宝中，丞相沈伦尝连绵外疾，虔心遣使诣宫，陈醮致告曰：伦浊秽之质，病恼所侵，如何修行，得免兹患，敢祈圣语以导愚蒙。 真君降言日：灵物不病，形躯自安。 形躯有病，返照而看。 来人录之，归致於伦，伦捧览之，惊喜日：吾得之矣。 寻而疾愈，复遣人诣宫醮谢。 道士王德渊因游终南山，寓止宫中，勤奉香火，好养生，而性褊多所患怒。 忽一日，真君降言谓之日：汝学道修真，先当调习其性，以顺天和，忘诸有为，勿耗心识，融怡凝湛，道乃可见。 复戒之日：莫管内莫管外，来往真虚无坚碍。 所居安乐是汝家，各自勤行莫相待。 莫相待#1，先达之人难滞碍。 真空妙乐有天堂，与圣相同灭诸罪。 又曰：妙理须行到，周旋皆合道。 举措见真空，真空无烦恼。 混合太虚中，自有无声乐。 地炉天鳌问，背凡归圣道。 常将智惠观，可向今生了。 德渊日：上感真君降言教示，不晓前篇内与圣相同灭诸罪，愿垂诲谕。 真君日：汝若除烦入静，炼心修真，积累其功，数盈之后，泥丸百节，元神灵通，而自同於圣。 天堂妙乐，无所不至，岂更有诸罪也，故言与圣相同灭诸罪。 太平兴国中，驾部员外郎李铸尝知凤翔府，备睹灵应，俄复奉诏监宫，凡十余年，志颇严洁。 真君前后降语仅十余篇，其存录者数首。 一曰：建隆之初，方禀希夷，上帝命吾众圣皆知，乘龙下降，列宿相随，五岳受命主张，地祇潜扶社稷，密佐明时。 吾要李铸知吾降期，不得轻泄，兔漏天机。",
      "translated_text": "The True Lord descended and spoke:\n\n\"Only upon reaching the realm does one know peace;\nwhen the form is busy, the numinous essence remains at ease.\nTrue emptiness must be illuminated and penetrated;\nthe subtle and profound lead to the great return.\nIn movement, observe without obstruction;\nprofound stillness harmonizes with nature.\nWhen merit is accomplished, the spirit becomes unfathomable,\nand transformations may ascend to the heavens.\nGoing and staying depend on oneself;\nthe Three Officials pardon past transgressions.\nThe Bureau of Destiny erases the record of sins,\nand the Six Dings report to the heavens above.\n\nAll beings who seek to cultivate the Dao\nmust know the primordial source.\"\n\nDongyuan bowed a hundred times, offered reverent thanks, and departed.\n\nDuring the Kaibao era, Attendant Censor Lu Chong, by imperial decree, governed Fengxiang Prefecture. He visited the abbey to pay homage and requested the Guardian of the True One to descend at the prefectural office, where he arranged an offering and prayed. That evening, after purifying himself and making his devotion, he said: \"Bound by my official duties, I am unable to pay direct homage to your true form. With these humble offerings, I reverently beseech your divine gaze and beg for true words to guide my ignorance.\"\n\nThe True Lord descended and spoke:\n\n\"Exert yourself in serving your lord to be a loyal minister.\nDo not covet ill-gotten wealth, nor heed wicked affairs.\nRectify the penal code and govern the mountains and rivers;\nrelieve and heal the people.\nAct in accord with the kingly Way, and you shall ultimately be a fortunate man.\nAccumulated transgressions become calamities, and surely lead to sinking and drowning.\n\nAll beings possess a formless nature paired with a formed body.\nSince time immemorial, they have been unable to awaken themselves.\nYet there exists a world without limits, a land of unending day,\nwhere the primordial void merges, and the profound and obscure share the same principle.\"\n\nAgain, he said:\n\n\"Within the six directions and the universe,\nmost beings fail to comprehend.\nCreating karma, they proceed blindly,\nlike the blind groping across rivers and seas.\nBut with wisdom as your guide,\nyou may traverse a thousand seas.\"\n\nChong bowed again, recorded the words, and recited them.\n\nLeft Rectifier of Omissions Wang Gui, one day with a purified heart, visited the abbey. He lit incense and earnestly prayed: \"Though I am but a lowly and flawed being, burdened with endless faults, I am fortunate to encounter a supreme perfected one. I humbly beg for divine instruction—how may I cultivate myself to attain long life?\"\n\nThe True Lord descended and spoke:\n\n\"I urge you to cultivate and refine—nothing surpasses diligence.\nWithout ceasing in diligence, even the highest sages will take heed.\nWhen the era of Great Peace arrives, martial and civil arts will flourish.\nWithout civil arts, there is no rectitude; with them, the lord is benefited.\nEnjoy your stipend and profit, but do not defy the king’s command.\nAct with good fortune and virtue, yet remain in pure poverty.\nPure poverty resonates with heaven and earth;\ndefiled wealth is like fire cast upon ice.\nCast upon ice, the fire’s embers gradually fade.\nThose who accumulate evil pierce themselves through.\nPierced through, calamity extends to the seven generations,\nand in the earthly prisons below, suffering befalls kin.\n\nI dangle a thousand-foot rope to fish for those with remaining threads of life.\nThe Dao is revered, virtue is esteemed;\nthe Great Dao gives birth to all things.\nBeings’ heads resemble heaven, their feet resemble earth,\nand their center, empty and open, accords with the true principle.\nCarving doors and windows to make a dwelling,\nwithin the chamber there is one thing—\nneither shadow nor form, profound and obscure, unknown to people.\nIf one can recognize it, one attains longevity.\n\nYang resides in heaven, yin upon the earth;\nwhen the two qi harmonize, there is true significance.\nWithin the void, creation occurs naturally,\nand from nature, the ten thousand kinds arise.\nHeaven is not high, earth is not low;\nthe Great Dao blends with the principle of the primordial void.\nIf those who study the Dao wish to hear this,\nthis is the exalted gateway to cultivation.\"\n\nDuring the Kaibao era, Chancellor Shen Lun suffered from a prolonged external illness. With sincere devotion, he sent an emissary to the abbey to arrange an offering and make this entreaty: \"Lun is of impure and filthy constitution, afflicted by illness. How may I cultivate myself to escape this suffering? I dare to seek sacred words to guide my ignorance.\"\n\nThe True Lord descended and spoke:\n\n\"The numinous essence does not fall ill; the physical form finds peace on its own.\nWhen the physical form is ill, turn inward and observe.\"\n\nThe emissary recorded the words and returned to deliver them to Lun. Lun received and read them, exclaiming in surprise and joy, \"I have grasped it!\" Soon after, his illness was cured, and he sent another emissary to the abbey to offer thanks through ritual.\n\nDaoist Wang Deyuan, while traveling on Mount Zhongnan, lodged at the abbey. He diligently tended the incense and fire, cherished life, yet his temperament was narrow, and he often succumbed to anger. One day, the True Lord descended and addressed him:\n\n\"If you study the Dao and cultivate the true,\nfirst regulate and refine your nature to harmonize with heaven’s harmony.\nForget all deliberate action, do not dissipate your mind and consciousness.\nCultivate serenity and clarity, and the Dao will become visible.\"\n\nAgain, he admonished him:\n\n\"Do not manage what is within, nor what is without.\nIn coming and going, the true and empty are without obstruction.\nWhere you dwell in peace and joy is your home;\neach must diligently practice without waiting for others.\nDo not wait for others—\nthose who have already attained find no hindrance.\nIn the wondrous bliss of true emptiness lies heaven,\nwhere, in union with the sages, all sins are extinguished.\"\n\nAgain, he said:\n\n\"Subtle principles must be practiced to reach the goal;\nin all your movements, accord with the Dao.\nIn action, perceive true emptiness;\ntrue emptiness is without affliction.\nBlending with the primordial void,\nthere exists soundless music.\nIn the furnace of earth and the cauldron of heaven,\nturn your back on the mundane and return to the sagely Dao.\nConstantly observe with wisdom,\nand you may resolve it in this lifetime.\"\n\nDeyuan said: \"Overwhelmed by the True Lord’s descent and teachings, I do not understand the phrase 'in union with the sages, all sins are extinguished.' I humbly beg for further instruction.\"\n\nThe True Lord replied: \"If you eliminate affliction and enter stillness, refine your heart and cultivate the true, accumulating merit until the measure is full, the hundred joints of the Niwan Palace will open, and your primordial spirit will attain numinous communion, thereby uniting with the sages. The wondrous bliss of heaven will be everywhere accessible—how could any sins remain? Thus it is said, 'in union with the sages, all sins are extinguished.'\"\n\nDuring the Taiping Xingguo era, Li Zhu, Director of the Bureau of Imperial Carriages, once governed Fengxiang Prefecture. Having witnessed the numinous responses, he was soon reassigned by imperial decree to oversee the abbey, a post he held for over a decade with strict integrity. The True Lord descended and spoke to him on numerous occasions, though only a few of the recorded transmissions remain. One said:\n\n\"At the beginning of the Jianlong era, I received the mandate of profound stillness. The Supreme Emperor commanded that all the sages, including myself, descend riding dragons, accompanied by the constellations. The Five Peaks received their orders to govern, and the earthly deities secretly supported the state, aiding in the flourishing of the enlightened age. I wish for Li Zhu to know the time of my descent, but he must not lightly disclose it, lest he leak the celestial secrets.\"",
      "overlap_context": "on what has been transmitted, we record them as follows.\n\nDuring the Qiande era, Feng Dongyuan, a Daoist of the White Deer Abbey on Mount Li, was paying homage when he lit incense and reverently addressed the True Lord: “Dongyuan has expounded the books of Confucius and followed the teachings of Laozi for many years, yet in cultivating the self and refining conduct, I have not grasped the true essence. Now, by the fortune of encountering a supreme sage, I dare to seek a single ancient teaching.”",
      "start_char": 8079,
      "end_char": 9279,
      "start_sentence": 352,
      "end_sentence": 413,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.84475660324097,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\翊圣保德传.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "又日，与吾独异佐国，与吾以道理民，与吾慈善理家，与吾不饮自醉。 醒时理民，醉时理神。 此语是延年益寿之法，吾劝府主记取。 又日：为官求理在贞明，智惠俱通临事清。 观天行道合阴德，食君爵禄常若惊。 为吾洗心复换骨，背凡入圣奔长生。 天宫快乐胜凡世，不夜之乡挂一名。 又曰：府主累世为人，降生中国。 与吾清直，莫行邪曲，与吾积善累功，与吾佐辅明主，与吾洗雪黎民，与吾挂心刑狱。 上帝若知，名天官也。 克取舍住世轮流之财，但修取有形之像，获随身之功，得无量之福。 与吾不得因循，不奈时光迅速，灵官赏汝功勋，天曹与汝添福。 若一一依吾圣言，必得延年益寿。 又曰，年登七十余，住世不久居。 饶君寿百岁，问汝得几秋。 地府直须怕，冥司难请求。 有功无惊惧，积罪必遭诛。 子孙难替代，早觉莫痴愚。 又曰：有绿无绿，福业相牵。 有绿福至，无绿业缠。 三业大罪，信根不圆。 若遵吾语，如倚太山。 又曰：听吾之言必延汝年，亦将康健保安自然。 志诚不退修真理，今生若在玉皇前。 又日：为汝虔心，星辰下降。 来驾於玄风，去乘於法雨。 开盲愚之耳目，回积恶之人心，尽归投正路。 因汝醮告上玄，恶人尽来归敬，此汝之功也。 吾已与汝闻於上帝，俾汝获福也。 汝宜清者重清，白者重白，明者重明。 勿初勤末怠，中路变异，回清为浊，回善为恶。 设灵官奏闻上帝，若知有误於吾也。 又七月十日夜，真君降言：汝忠勤奉国，惠爱治民，更要用心，勿违吾诚。 未遇吾之前，所作诸恶，吾与汝并销除也。 遇吾之后，况无诸业，左右已录汝功也。 更须晨夕与吾，积其善功，勿得息惰吾圣言也。 又曰：但行王事，洗雪冤沉，常差灵官，护助汝也。 或有诸事，常行平正，依吾圣言。 况是太平君治化，诸事前程，汝但莫忧。 又云：托托莫忧烦，军府自然安。 每事依王道，从他天下传。 又曰：为主虔诚拜上玄，宋朝社稷保长安。 不久太平天下乐，一家受福管长安。 又曰：为主合虔诚，将心助太平。 天宫击其职，每事更宜精。 众圣皆知汝，举措直须惊。 一朝功满后，永住看三清。 又日：生前莫乱忧，已后亦无愁。 主判阳问事，凡人得几秋。 但依圣言着，长生天上求？ 铸每受一篇，未尝不晨夕讽诵焉。 又尝谓铸曰：汝年及八十，别无修炼之功，未免掩形升魂，亦当有所主掌耳。 铸再拜日：此生得遇上真下降，屡受秘语，他日傥获主掌，愿与守真同列。 真君曰：人问官职，守真不及汝，天上名位，汝不及守真也。 但心归真正，升仙阶亦有时矣。 淳化中，西京留守中书令赵普，尝遣使备礼致醮虔祈，愿闻休咎。 真君降言曰：赵普扶持社稷，甚有功勋，上天所知，赐汝福寿。 以大妨小，幽府亦有冤对。 当启诵真经，告析天地，首忏前非。 吾亦与汝达于上帝，庶解兹咎，汝官职、寿数已有限矣。 其使录之而去。 普跪读感涕，因焚词谢过，复遣人诣官醮设。 给事中参知政事贾黄中，尝遣人投诚致祷，以祈圣诲。 真君降言日：圣主命臣臣之事君，道佐当代，心依古人，善恶无隐，奸邪必闻。 君臣合道，可立功勋。 又日：爱民用心，赏罚平等，但依吾语，．合家保安。 殿中承张卓尝乞圣言，真君曰：大道养汝性，阴阳生汝身。",
      "translated_text": "Another time, the True Lord said:\n\n\"Work with me to uniquely aid the state; govern the people with me by the Dao/Way; manage your household with me through kindness and goodness; and remain sober without drinking. When awake, govern the people; when inebriated, govern the spirit. This is the method to prolong life and increase longevity—I urge you, Prefect, to remember it.\"\n\nAnother time, he said:\n\"To govern as an official, seek clarity and brightness;\nLet wisdom and insight together bring purity to affairs.\nObserve the heavens, act in accord with the Dao/Way, and align with hidden virtue;\nConsume the ruler’s salary with constant awe.\nFor me, purify your heart and renew your bones,\nTurn from the mundane, enter sageliness, and hasten toward long life.\nThe joys of the celestial palace surpass the mortal world—\nIn the land of eternal light, your name shall be inscribed.\"\n\nAnother time, he said:\n\"Prefect, you have been reborn in the Central Kingdom for many lifetimes.\nBe as upright and honest with me; do not act with crookedness.\nAccumulate goodness and merit with me; assist and support the enlightened ruler with me;\nWash clean the suffering of the common people with me; and keep in your heart the prisons and judgments with me.\nIf the Supreme Emperor knows of this, you shall be named a celestial official.\nDo not cling to the transient wealth of this world’s turning cycles—\nInstead, cultivate the tangible forms of practice,\nAttain merits that follow you in life,\nAnd gain boundless blessings.\nDo not linger in complacency with me—\nTime passes swiftly.\nThe numinous officials will reward your merits,\nAnd the celestial bureaus will augment your blessings.\nIf you follow my sacred words to the letter,\nYou shall surely prolong your years and increase your longevity.\"\n\nAnother time, he said:\n\"Though you reach seventy years of age,\nYour time in this world will not be long.\nEven if you live a hundred years,\nHow many autumns will you truly have?\nThe earthly courts must be feared;\nThe underworld’s judgments are hard to plead.\nWith merit, you need not fear;\nWith accumulated sins, you will surely face punishment.\nNo descendant can take your place—\nAwaken early, lest you remain foolish.\"\n\nAnother time, he said:\n\"Whether blessed or not, fortune and karma are intertwined.\nWith blessings, fortune arrives;\nWithout them, karma entangles.\nThe three karmic offenses are grave,\nAnd the root of faith is not whole.\nIf you follow my words,\nIt will be as steadfast as Mount Tai.\"\n\nAnother time, he said:\n\"Listen to my words, and your years shall be extended,\nYour health preserved, and your peace secured naturally.\nWith unwavering sincerity, cultivate the truth of the Dao/Way—\nIn this life, you may stand before the Jade Emperor.\"\n\nAnother time, he said:\n\"For your devotion,\nThe stars descend.\nThey arrive riding the dark wind,\nAnd depart upon the dharma rain.\nThey open the eyes and ears of the blind and foolish,\nTurn the hearts of those who have accumulated evil,\nAnd lead them all to the right path.\nBecause of your offerings and prayers to the Supreme,\nEvil men have all come to pay reverence—\nThis is your merit.\nI have already reported this to the Supreme Emperor,\nThat you may gain blessings.\nYou must deepen what is pure, whiten what is white, and brighten what is bright.\nDo not begin with diligence only to grow lax at the end,\nNor change course midway,\nTurning purity into turbidity,\nOr goodness into evil.\nIf the numinous officials report this to the Supreme Emperor,\nHe will know you have strayed from my teachings.\"\n\nOn the night of the tenth day of the seventh month, the True Lord descended and said:\n\"You have served the state with loyalty and diligence,\nAnd governed the people with kindness and love.\nYou must continue to apply yourself—\nDo not betray my sincerity.\nBefore you encountered me,\nAll the evils you committed\nI have already dissolved for you.\nAfter meeting me,\nYou have no further karmic burdens—\nThe attendants have already recorded your merits.\nYou must continue, morning and evening,\nTo accumulate good deeds with me—\nDo not grow idle in heeding my sacred words.\"\n\nAnother time, he said:\n\"Simply attend to the affairs of the state,\nRedress grievances and right wrongs.\nI will always dispatch numinous officials\nTo protect and assist you.\nIn all matters,\nAct with fairness and uprightness,\nAnd follow my sacred words.\nMoreover, this is an age of enlightened rule—\nAll things lie ahead,\nSo you need not worry.\"\n\nHe also said:\n\"Be at ease, do not fret—\nThe military and government will naturally be secure.\nIn every matter, follow the kingly Dao/Way,\nAnd let it spread throughout the realm.\"\n\nAnother time, he said:\n\"As the prefect, offer sincere prayers to the Supreme—\nThe Song dynasty’s altars of state shall be preserved in Chang’an.\nSoon, the world will rejoice in great peace,\nAnd your household shall receive blessings for generations.\"\n\nAnother time, he said:\n\"As the prefect, you must be devout,\nAnd lend your heart to the cause of great peace.\nThe celestial palace will note your duties—\nIn every matter, be even more diligent.\nAll the sages know of you—\nLet your every action inspire awe.\nWhen your merits are complete,\nYou shall dwell forever in the Three Pure Realms.\"\n\nAnother time, he said:\n\"Do not worry needlessly in life,\nNor will you have sorrow after death.\nThe lord judges matters in the yang realm—\nHow many autumns do ordinary men truly have?\nSimply follow the sacred words,\nAnd seek long life in the heavens above?\"\n\nEach time Li Zhu received a transmission, he never failed to recite it morning and evening. The True Lord once said to him:\n\"Though you are nearing eighty and have not cultivated the arts of refinement,\nYou will not escape the fate of concealing your form and ascending in spirit—\nYet you shall still have a position to oversee.\"\n\nLi Zhu bowed twice and said:\n\"In this life, I have been fortunate to encounter the descent of a perfected immortal\nAnd receive your secret teachings many times.\nIf one day I am granted a position to oversee,\nI wish to stand alongside the Guardian of the True.\"\n\nThe True Lord replied:\n\"In the worldly offices of men, the Guardian of the True does not surpass you;\nBut in the celestial ranks, you do not surpass the Guardian of the True.\nSimply return your heart to the true and upright—\nThe steps to ascending as an immortal will come in time.\"\n\nDuring the Chunhua era, the Military Commissioner of the Western Capital, Chancellor Zhao Pu, once dispatched an envoy with offerings to hold a solemn rite and earnestly pray, seeking to know fortune and misfortune. The True Lord descended and said:\n\"Zhao Pu has upheld the altars of state with great merit—\nThe heavens above know this\nAnd grant you blessings and longevity.\nYet in elevating the great, you have harmed the small—\nEven in the netherworld, there are grievances against you.\nYou must recite the true scriptures,\nPetition heaven and earth,\nAnd repent your past transgressions.\nI shall also report this to the Supreme Emperor,\nThat this misfortune may be resolved.\nYour office and lifespan are already fixed.\"\n\nThe envoy recorded this and departed. Zhao Pu knelt to read it, moved to tears. He then burned a written confession to express his remorse and again dispatched someone to the abbey to hold a rite.\n\nThe Grand Master and Assistant Director of the Chancellery, Jia Huangzhong, once sent someone to offer sincerity and pray, seeking sacred instruction. The True Lord descended and said:\n\"The sagely ruler commands his ministers, and ministers serve their ruler—\nThe Dao/Way assists the age,\nThe heart follows the ancients.\nLet neither good nor evil be concealed;\nLet neither treachery nor deceit go unheard.\nWhen ruler and minister unite in the Dao/Way,\nMerits may be established.\"\n\nAnother time, he said:\n\"Love the people with all your heart,\nAnd let rewards and punishments be impartial.\nSimply follow my words,\nAnd your household shall be preserved in peace.\"\n\nThe Palace Attendant Zhang Zhuo once sought sacred words. The True Lord said:\n\"The Great Dao/Way nurtures your nature;\nYin and yang give birth to your body.\"",
      "overlap_context": ". One said:\n\n\"At the beginning of the Jianlong era, I received the mandate of profound stillness. The Supreme Emperor commanded that all the sages, including myself, descend riding dragons, accompanied by the constellations. The Five Peaks received their orders to govern, and the earthly deities secretly supported the state, aiding in the flourishing of the enlightened age. I wish for Li Zhu to know the time of my descent, but he must not lightly disclose it, lest he leak the celestial secrets.\"",
      "start_char": 9279,
      "end_char": 10495,
      "start_sentence": 414,
      "end_sentence": 480,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.40589237213135,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\翊圣保德传.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "为吾勤行道，为吾勤修真。 公廉常用意，忧恤在乎民。 遇时佐明主，清浊上帝闻。 浊富终不久，清贫为天人。 莫教人道富，从他人笑贫。 自有真家富，清高不愧贫。 又日：形凡性不凡，为国显清廉。 家积千余口，有罪自家担。 又日：但服阳和气，天鳌再重蒸。 地炉别有用，道德日日新。 延命积福应，真空若至亲。 虚无有妙理，度脱有绿人。 道士周务本，尝诣宫奏词一通，乞降真语，真君降言日：汝有词言慕上天，其如心意隔关山。 仙宫不远如指掌，内外功夫全未圆。 阴官察录无遗过，免堕邓都数百年。 依吾所语合吾道，要履三清应不难。 张守真子元济，常斋戒诣官，真君降言日：汝父守真遭逢於吾，故令子孙受福。 汝岂不知信州龙虎山张道陵，至今子孙不绝，亦逢於上圣，得道之后，瘾及后世。 汝亦於吾有绿，直须在家孝於父母，食禄忠於帝王，立身扬名，岂非好事。 又诲之日：无事莫街行，勤学必立名。 扬名在天下，道瘾有长生。 又诚日：为过自家知，善恶日相随。 分明违天道，问汝阿谁痴。 淳化中，真君降言示守真日：当今显圣明，修德动三清。 上天归正道，四海息交兵。 八方钦睿圣，五谷尽收成。 劝君须修德，上帝赐长生。 又日： 关西贼寇绿应时数，官家须指挥招捉， 使臣莫杀平人。 官家修德之际，",
      "translated_text": "\"Diligently practice the Dao/Way for me,\nDiligently cultivate the true for me.\nBe just and upright, ever mindful;\nCare and compassion lie with the people.\nWhen opportunity arises, assist the enlightened ruler,\nThat purity and impurity be heard by the Supreme Emperor.\nImpure wealth shall not endure,\nWhile pure poverty befits the celestial beings.\nLet none boast of riches,\nNor fear the scorn of poverty.\nFor true wealth lies within,\nAnd lofty purity feels no shame in poverty.\"\n\nAnother time, he said:\n\"Though the form be common, the nature is not;\nServe the state with manifest integrity.\nThough your household numbers over a thousand,\nEach bears their own transgressions.\"\n\nAnother time, he said:\n\"Simply ingest the yang harmony qi,\nAnd the celestial tortoise shall be steamed anew.\nThe earthen furnace serves another purpose,\nWhile the Dao/Way and virtue renew daily.\nProlong life and accumulate blessings in response,\nAs true emptiness becomes as close as kin.\nWithin the void lies wondrous principle,\nAnd deliverance awaits those with karmic affinity.\"\n\nDaoist Zhou Wuben once presented a memorial at the palace, beseeching sacred words. The True Lord descended and said:\n\"Your words express longing for the heavens above,\nYet your heart and intent remain distant as mountains.\nThe immortal palaces are no farther than your palm,\nBut inner and outer cultivation remain incomplete.\nThe officials of the yin realm record all without omission,\nTo spare you from falling into Dengdu for hundreds of years.\nFollow my words and align with my Dao/Way,\nAnd treading the Three Clarities shall pose no difficulty.\"\n\nZhang Shouzhen’s son, Yuanji, often observed purification rites before visiting the palace. The True Lord descended and said:\n\"Your father, Shouzhen, encountered me,\nThus bestowing blessings upon your descendants.\nDo you not know of Zhang Daoling of Longhushan in Xinzhou?\nTo this day, his lineage remains unbroken,\nFor he too met with the exalted sages.\nAfter attaining the Dao/Way, his merit extended to posterity.\nYou, too, share a karmic bond with me.\nSimply remain at home, filial to your parents,\nAnd loyal to the emperor in your official duties.\nEstablish yourself and spread your name—\nIs this not a fine endeavor?\"\n\nAnother time, he instructed:\n\"When idle, do not wander the streets;\nDiligent study ensures a lasting name.\nLet your name resound throughout the land,\nAnd the Dao’s merit grants longevity.\"\n\nHe also admonished:\n\"Your own transgressions you know best;\nGood and evil follow you each day.\nIf you clearly defy the heavenly Dao,\nThen tell me—who is the fool?\"\n\nDuring the Chunhua era, the True Lord descended and spoke to Shouzhen:\n\"In this age of manifest sagely brilliance,\nCultivating virtue moves the Three Clarities.\nHeaven returns to the true Dao/Way,\nAnd the four seas cease their wars.\nThe eight directions revere the wise and sagely,\nWhile the five grains yield abundant harvests.\nI urge you to cultivate virtue,\nThat the Supreme Emperor may grant you long life.\"\n\nAnother time, he said:\n\"The bandits of Guanzhong arise in accord with the times’ fate;\nThe court must issue commands to summon and capture them,\nAnd officials must not slaughter innocent commoners.\nAs the court cultivates virtue...\"",
      "overlap_context": ".\nLet neither good nor evil be concealed;\nLet neither treachery nor deceit go unheard.\nWhen ruler and minister unite in the Dao/Way,\nMerits may be established.\"\n\nAnother time, he said:\n\"Love the people with all your heart,\nAnd let rewards and punishments be impartial.\nSimply follow my words,\nAnd your household shall be preserved in peace.\"\n\nThe Palace Attendant Zhang Zhuo once sought sacred words. The True Lord said:\n\"The Great Dao/Way nurtures your nature;\nYin and yang give birth to your body.\"",
      "start_char": 10495,
      "end_char": 10997,
      "start_sentence": 481,
      "end_sentence": 511,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.18808341026306,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\翊圣保德传.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "正贼须剪灭。 又尝降言诚辅道士曰： 千人心不同，万人心皆错。 举意不相通，与圣难相约。 真君又尝降言戒官吏等曰： 每存忠信齐其天，文武班行自有贤。 为主万年安基业，常忧黎庶恐饥寒。 长行德行合其道，烧香虔祝告虚玄。 但愿国安君长久，齐心辅佐太平年。 又尝降言戒朝臣等曰： 擎天之柱着功勋，包罗大海佐明君。 文王治世及尧日，辅弼乾坤在忠臣。 为主直须行央烈，死生齐却戴皇恩。 常行吉善合其德，慎终如始莫忧身。 进翔圣保德真君事边表 臣钦若言，臣闻高穹眷命，元圣膺期，必有至神聿彰幽赞，谟训标於保叉，雅颂载於监观，考今古之冥符，见天人之交感。 臣钦若诚庆诚扑，顿首顿首。 伏以灵源锡羡，炎德嗣兴，景祚有开，丕征允赫。 惟玉晨之元辅，奉金阙之明威，降精爽不贰之民，显阴阳莫测之造，佐大邦之启运，告神宗之绍图。 兆自几先，耸乎闻听。 由是增隆华饥，茂荐徽称，巨典崇严，纯禧响答，乃至折绅、卿士，横目、需黎，稽首以瞻粹容，洗心以伫灵诰。 随其性之远近，视其器之浅探，时亦戒以徽音，警其蒙惑。 谆谆之诲，咸洞其隐微。 蚩蚩之氓，潜识其真正。 或魑魅为孽，夏鼎之所未刊。 或膏盲致妖，秦医之所难究。 亦复俯聆，虔恳遥授指踪，真教猥临，草邪必珍。 窈冥之象既炳於人寰，台钦之游亟还於霄极。 永载芯芬之祀，潜施蜷佑之祥。 凡厥秘言，悉存旧录，将伸论次，以示方来。 敢谓微巨猥蒙明诏，斋精仰诵。 盟手兢持，莫觉渊冲，粗伸细绎。 窃念上真之茂躅，实为昭代之明征，岂夫庸琐之才，辄敢形容其事。 伏望崇文广武仪天尊，道宝应章，感圣明、仁孝皇帝陛下，垂流注览，援翰擒文，赐名以纪芳羹，作序以冠篇首。 式彰寅奉，永惧洪休。 臣无任瞻天望圣，战汗屏营之至。 其所录成翊圣保德真君事迩三卷，谨随表上进以闻。 臣钦若诚惶诚惧，顿首顿首，谨言。 开府仪同三司同中书门下平章事上柱国太原郡开国公臣王钦若上表 批答 省表具之，夫妙道为大，本於若冲，至神无方，昭乎善应。 惟玉虚之元辅，冠琼简之真阶。 幽赞财成，直彰阴隐。 当艺祖之受命，降福壤而炳灵，逮文考之绍休，告帝期而启兆。 式申美报，肇建殊庭。 奉禳桧之严科，介苍黔之丕祉。 若乃夷微委鉴，肝蜜攸凭，示谆诲以惟勤，昭明威而匪测。 恍兮之应犹响，泠然之驭亟旋。 自朕纂承寅加崇奉，严眸仪於恭馆，荐嘉号於元都，念秘诰之具存表格，思之攸盛。 期於综缉，以耀休征。 卿任冠枢，衡道熙邦。 采雅资博，洽庶就编。 联而能细，网帐以惟，精封缥囊而来上。 恳求制序，复冀命名。 载循浅昧之辞，曷叔直聪之烈。 勉从勤请，良积腼数，嘉尚之怀，寤兴无舍。 所请宜依崇宁。 三年四月十八日，使命到宫资，降到真君加号劲诰，诰日：门下惟皇上、帝，粤有辅臣，以赫厥灵，终南之下，屡膺景既，增焕褒章。 翊圣保德真君降言於建．隆之初，显告於开宝之末，大庇下土，卫我家邦。 作宫奉祠，昭答如响。 顾眇赏之诞育，皇钦慈之密祈。 吉事有祥，敢忘美报。 夫至诚能感，克应乃孚。 所储维何，万世之庆。 合为丕号，申命用休朕典，神天永缉熙于纯缎。 凤翔府上清太平宫翊圣保德真君，可特加翊圣应感储庆保德真君。",
      "translated_text": "The bandits must be eradicated.\n\nHe once descended to admonish the Daoist attendants, saying:\n\"A thousand hearts differ, ten thousand minds all err.\nIntentions fail to align, and with the sagely few can accord.\nHard is the pact to keep.\"\n\nThe True Lord also descended to warn the officials:\n\"Ever maintain loyalty and trust, aligning with Heaven’s will;\nAmong civil and military ranks, the worthy naturally rise.\nFor the sovereign’s ten-thousand-year foundation,\nEver fret for the common folk, lest they suffer cold and hunger.\nLong practice virtue to accord with the Dao/Way,\nBurn incense and pray devoutly to the Mysterious.\nOnly wish the realm at peace, the lord enduring,\nWith one heart assist the era of Great Peace.\"\n\nHe also descended to admonish the court ministers:\n\"The pillar upholding Heaven must establish merit,\nEmbracing the vast seas to aid the enlightened lord.\nAs in King Wen’s reign and the days of Yao,\nThe cosmos is upheld by loyal ministers.\nFor the lord, one must act with utmost resolve,\nIn life and death alike, bear the imperial grace.\nEver practice good and virtue to align with power,\nBe prudent to the end as at the start, and fear not for yourself.\"\n\n**Memorial on the Affairs of the Perfected Lord of Assisting Sagacity and Preserving Virtue**\nYour servant Qin Ruo states: I have heard that when High Heaven bestows its mandate, the Primordial Sage receives the era’s charge, and there must be supreme spirits who manifest hidden assistance. Their counsels and teachings are inscribed in the *Baochan* scriptures, their refined praises recorded in the *Jianguan* annals. Examining the mysterious correspondences of past and present, one sees the mutual resonance of Heaven and humanity.\n\nYour servant Qin Ruo, with utmost joy and reverence, bows his head again and again.\n\nI humbly consider that from the numinous source, blessings overflow; the fiery virtue continues its flourishing. The august fortune unfolds, its mighty signs resplendent. The Primordial Attendant of the Jade Dawn, serving the luminous might of the Golden Portals, descends his essence and spirit upon the unwavering people, revealing the unfathomable workings of yin and yang. He aids the great state in inaugurating its destiny, announcing to the divine lineage the continuation of its design. The omens appear first in subtle signs, startling to hear and behold.\n\nThus, the offerings are augmented and splendid, the laudations richly presented. Grand rites are solemnly observed, pure blessings resound in response. Even the girdled officials and ministers, the common folk with horizontal pupils, bow their heads to gaze upon his immaculate countenance, purify their hearts to await his numinous decrees. According to their natures’ depth or shallowness, their capacities’ breadth or narrowness, he at times admonishes with subtle words, awakening their delusions. His earnest teachings penetrate their hidden subtleties; the benighted masses come to recognize the true and correct.\n\nWhen malevolent spirits wreak havoc—unrecorded even in the Xia tripods—\nOr when blindness breeds calamity—unfathomable even to Qin physicians—\nHe deigns to listen, devoutly and from afar bestowing guidance.\nThe true teachings descend, and noxious influences are surely eradicated.\nThe obscure and profound signs now shine upon the mortal realm,\nWhile the sojourns of the Terrace of Reverence swiftly return to the celestial heights.\nForever shall his fragrant sacrifices be offered,\nAnd his coiled blessings subtly bestowed.\n\nAll his secret words are preserved in the old records,\nTo be arranged and presented for posterity.\nDaring to claim that even the humble and insignificant have been graced by the luminous decree,\nI fast and purify myself to recite them with reverence.\nClasping my hands in trepidation, I cannot fathom their profundity,\nYet roughly expound and elucidate them.\n\nI reflect that the illustrious traces of the Supreme Perfected\nAre indeed the bright proofs of this enlightened age.\nHow could one of my mediocre and insignificant talent\nPresume to describe such matters?\n\nI humbly hope that the August Worthy, Venerable of the Dao/Way, Treasure of the Dao/Way, Responsive to the Chapters, who moves the sagely and enlightened, benevolent and filial Emperor, may deign to peruse this, wield his brush to compose a preface, bestow a name to commemorate his fragrant virtue, and place it at the head of the work. Thus may reverent service be manifest, and boundless blessings be eternally cherished.\n\nYour servant, unable to contain his awe as he gazes toward Heaven and longs for the sagely presence, is overwhelmed with trembling and trepidation.\n\nThe three fascicles recording the affairs of the Perfected Lord of Assisting Sagacity and Preserving Virtue are respectfully submitted herewith for Your Majesty’s perusal.\n\nYour servant Qin Ruo, with utmost reverence and fear, bows his head again and again.\n\n**Memorial Submitted by:**\nWang Qin Ruo, Grand Mentor with the Rank of Grandee, Participant in Determining Governmental Matters, Grand Pillar of State, Duke of Taiyuan Commandery\n\n**Imperial Rescript:**\nWe have perused the memorial in full. The wondrous Dao/Way is vast, rooted in the tranquil and profound; the supreme spirit is boundless, manifest in its responsive virtue. The Primordial Attendant of the Jade Void stands at the apex of the numinous registers. In hidden assistance and completion, he directly reveals the obscure and concealed.\n\nWhen the August Ancestor received the mandate, he descended blessings upon the earth and displayed his numinous power. When Our Illustrious Predecessor continued the glory, he announced the imperial destiny and inaugurated the omens. Thus, the expression of fine recompense began, and a special sanctuary was established. The solemn rites of offering and exorcism were observed, bringing great blessings to the black-haired people.\n\nMoreover, in discerning the subtle and profound, relying upon the liver and gall, he demonstrated earnest teachings and revealed his unfathomable might. His ethereal responses were like echoes; his swift chariot swiftly returned. Since We ascended and inherited the throne, We have reverently augmented our veneration, solemnly establishing the rites at the Reverent Hall, presenting honorific titles at the Primordial Capital. Considering that the secret decrees are fully preserved in the records, We deem this a most flourishing endeavor, desiring to compile and edit them to display these auspicious proofs.\n\nYou, as the foremost of the court, govern the Dao/Way and bring harmony to the state. Drawing from refined and abundant sources, you have harmonized the many and arranged them into a compilation. Meticulous yet comprehensive, you have sealed them in silk wrappers and presented them. Earnestly requesting a preface and hoping for a name, though Our words are shallow and unworthy, how could We not heed such sincere pleas? With reluctance, We accede to your diligent request, moved by your earnestness. Our admiration and esteem are ever-present, day and night unceasing.\n\nYour request is approved. In the third year of the Chongning era, on the eighteenth day of the fourth month, the imperial command was delivered to the Palace of Merit. The decree bestowing an honorific title upon the True Lord states:\n\nThe Chancellery proclaims: Of the August Emperor on High, there are assisting ministers whose numinous power shines resplendently. At the foot of Mount Zhongnan, they have repeatedly received glorious favor, their splendor enhanced by laudatory inscriptions. The Perfected Lord of Assisting Sagacity and Preserving Virtue descended his words at the beginning of the Jianlong era, making manifest his announcements by the end of the Kaibao era. He greatly protects the lands below, guarding our state and homeland. An abode was established for his worship, and his responses were as swift as echoes. Considering Our humble self’s birth and the emperor’s profound and secret prayers, how could We forget to render fine recompense for these auspicious events?\n\nFor utmost sincerity can move, and its responses are surely fulfilled. What is stored within? The blessings of ten thousand generations. Thus, We bestow a grand title, issuing this decree to glorify Our canon. May the divine and celestial realms eternally flourish in pure harmony.\n\nThe Perfected Lord of Assisting Sagacity and Preserving Virtue at the Supreme Clarity Great Peace Palace in Fengxiang Prefecture shall be specially honored as the **Perfected Lord of Assisting Sagacity, Responsive to Stimuli, Storing Blessings, and Preserving Virtue**.",
      "overlap_context": "hree Clarities.\nHeaven returns to the true Dao/Way,\nAnd the four seas cease their wars.\nThe eight directions revere the wise and sagely,\nWhile the five grains yield abundant harvests.\nI urge you to cultivate virtue,\nThat the Supreme Emperor may grant you long life.\"\n\nAnother time, he said:\n\"The bandits of Guanzhong arise in accord with the times’ fate;\nThe court must issue commands to summon and capture them,\nAnd officials must not slaughter innocent commoners.\nAs the court cultivates virtue...\"",
      "start_char": 10997,
      "end_char": 12272,
      "start_sentence": 512,
      "end_sentence": 577,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 48.74617052078247,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\翊圣保德传.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "翊圣保德传卷下竟 #1『莫相待』三字原缺，据《道藏辑要》本补。",
      "translated_text": "The *Hagiography of the Perfected Lord of Assisting Sagacity and Preserving Virtue*, Scroll the Lower, concludes.\n\n[The three characters \"莫相待\" (*\"Do not await one another\"*) were originally missing and have been supplemented according to the *Daoist Canon Compendium* edition.]",
      "overlap_context": " surely fulfilled. What is stored within? The blessings of ten thousand generations. Thus, We bestow a grand title, issuing this decree to glorify Our canon. May the divine and celestial realms eternally flourish in pure harmony.\n\nThe Perfected Lord of Assisting Sagacity and Preserving Virtue at the Supreme Clarity Great Peace Palace in Fengxiang Prefecture shall be specially honored as the **Perfected Lord of Assisting Sagacity, Responsive to Stimuli, Storing Blessings, and Preserving Virtue**.",
      "start_char": 12273,
      "end_char": 12308,
      "start_sentence": 578,
      "end_sentence": 579,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 1.8141462802886963,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\翊圣保德传.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}