{
  "source_id": "老子像名经",
  "source_file": "chunked_daozang\\老子像名经.json",
  "total_chunks": 12,
  "total_original_chars": 13165,
  "total_translated_chars": 105661,
  "total_translation_time": 444.7960567474365,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\本文类\\老子像名经.txt",
    "category": "本文类"
  },
  "full_translation": "**Laozi Iconographic Scripture of Divine Names**\n*Volume One*\n\nAt that time, the Most High Laozi, together with the Perfected Ones of the Ten Directions, the Mighty Spirits of the Ten Hosts, and boundless multitudes, traversed the infinite worlds of the Ten Directions, propagating the teachings and transforming beings.\n\nThey beheld how sentient beings had committed grave transgressions across the Ten Directions, their orphaned souls mired in suffering, enduring manifold torments. Emerging from darkness into light, they died and were reborn, drifting through the hells of the Ten Directions—some cast into the Wind-and-Thunder Hell of the East, others plunged into the Furnace-and-Coal Hell of the South, confined in the Metal-Hammer Hell of the West, or frozen in the Frigid-Ice Hell of the North. Some fell into the Scalding-Cauldron Hell of the Northeast, others into the Bronze-Pillar Hell of the Southeast; some were trapped in the Slaughter-and-Carving Hell of the Southwest, conscripted into the Fire-Cart Hell of the Northwest, hurled into the Fire-Pit Hell above, or submerged in the Filth-and-Excrement Hell below. They endured every manner of punishment, each according to their karma.\n\nTheir bodies were shattered, limbs scattered asunder, subjected to ceaseless torture day and night without respite. Profoundly moved by the suffering of beings, Laozi now proclaims these one thousand one hundred and sixty divine names of the Heavenly Worthies who manifest through transformation across the Ten Directions. By reverently invoking and extolling these names, may all beings in the infinite worlds of the Ten Directions repent their transgressions, eradicate evil, and cultivate blessings and virtue.\n\nAll you Perfected Ones, listen attentively.\n\nThen the Most High Laozi addressed the Universal Salvation Perfected One of the East and the assembled immortals, declaring the divine names of the ninety Heavenly Worthies of the Nine Qi Infinite World of the East. Those who venerate them shall eradicate boundless sins and attain immeasurable blessings.\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Universal Compassion and Nation-Protection of the East**\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Great Forbearance and Unobstructed Power**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Eastern Flower’s Supreme Minister**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Azure Palace’s Transformative Teaching**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Wondrous Treasure of Immortals**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Embracing Harmony and the Void’s Utmost**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Nine Heavens’ Accumulated Goodness**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the August True Elder**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Hidden Radiance of Primordial Spirit**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Golden Portal and Jade Void**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Mysterious Response to Doubtful Hearts**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Numinous Capital’s Great Deliverance**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Mysterious Spirit’s Utmost Virtue**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Supreme Great Void**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of All-Pervading Wondrous Utmost**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Revealing the True Form**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Treasure Victor’s Primordial Harmony**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Dharma Treasury’s Perfect Utmost**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Mysterious Illumination and True Stillness**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Fulfilled Assembly of Wisdom**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Golden Flower’s Supreme Minister**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of True Conduct and Luminous Causes**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Majestic Light and Ultimate Reality**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Opening Trust and Awakening**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Wisdom’s Understanding and Illuminated Insight**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Purple Void’s Supreme Utmost**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Numinous Heart’s Universal Illumination**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Benevolent Source’s Vast Moistening**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Upright Awakening’s Descending Teachings**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of True Wisdom’s Illuminating Utmost**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Wondrous Treasure of Immortal Deliverance**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Purple Yang’s Numinous Response**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Boundless Wondrous Intent**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Golden Light and Good Wisdom**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Mysterious Void and True Conduct**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Wisdom’s Emptiness and Liberation**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Adorned Mysterious Awakening**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Universal Response and Pervasive Communication**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Void Sovereign’s Descending Illumination**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Wondrous Utmost’s True Source**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Mysterious Response and Illuminated Wisdom**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Treasure Form’s True Yang**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Concentrated Spirit’s Profound Illumination**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Dharma Cloud’s Universal Moistening**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Void’s Illumination and Far-Reaching Gaze**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Dharma Form’s Perfect Completion**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Solemn Wondrous Intent**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Primordial Boundary’s Mysterious Subtlety**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Tranquil Illumination of Profound Truth**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Wondrous Joy and Majestic Light**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Universal Illumination of the Hidden and Manifest**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Inexhaustible Dharma Conditions**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Responding to Conditions and Answering Calls**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Upright Wisdom and Mysterious Void**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Wisdom’s Eyes and Flowing Light**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Jade Flower’s Resplendent Radiance**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Floating Fragrance’s Far-Reaching Gaze**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Flying Clouds’ Vast Covering**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Universal Deliverance and Joyful Sovereignty**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Ocean’s Emptiness and Wisdom’s Understanding**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Compassion and Bestowing Joy**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Void Sovereign’s Universal Salvation**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Dharma Lamp’s Bright Illumination**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Supreme Great Void**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Great Compassion and Deliverance from Suffering**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Supreme Virtue and Compassionate Rescue**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Abiding in Utmost Joy**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Mysterious Harmony and Wondrous Treasure**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Non-Action’s Stillness and Wisdom**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Mysterious Void’s Solemn Purity**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Compassionate Goodness and Universal Salvation**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Wisdom’s Measure Responding to Beings**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Adorned Plain Virtue**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Void’s Utmost Mystery**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Wondrous Source’s Naturalness**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Compassionate Rescue and Protection**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Nameless Treasure Form**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Dharma Cloud’s Descending Shade**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Compassionate Grace’s Vast Transformation**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Mysterious Nectar’s Universal Moistening**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Numinous Harmony and Good Accumulation**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Great Wisdom’s Concentrated Profundity**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Broadly Opening Precepts and Samādhi**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Entrusted Dharma Treasure**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Hidden Spirit’s Penetrating Illumination**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Revered Immortals’ Transformative Teaching**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Great Propagation of the True Dharma**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Dharma Bridge’s Universal Deliverance**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Virtue’s Treasury Encompassing All**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Skillful Means and Manifest Responses**\n\nThe Most High Laozi declared: Such are the Heavenly Worthies, their forms perfectly complete, attended on left and right by boundless retinues, all dwelling within the Nine Qi Infinite World of the East. They broadly expound the Great Vehicle, disseminate the essential teachings of the Dao, and deliver all sinful beings, causing them to depart from suffering and attain peace and joy.\n\nThen the Most High Laozi addressed the Universal Salvation Perfected One of the East and the assembled immortals: If you can guide and transform all beings in the infinite worlds of the Ten Directions—whether male or female—so that they all return to sincerity, reverently bow, invoke, and extol the divine names of the ninety Heavenly Worthies of the Nine Qi Infinite World of the East, they shall eradicate the karmic retributions of life and death for all beings. The sins of arrogance and neglect toward the Three Treasures, failing to cultivate reverence; violating scriptures and breaking precepts, forsaking good and embracing evil; disrespecting masters and teachers, disregarding covenants; deceitful betrayal, defying reason and refusing repayment; malicious speech, cursing and reviling; drunkenness and brawling, disdaining public and private duties; secret plotting of evil, covertly harming others; hating kin and loving strangers, harboring inner resentment and delighting in external affairs; slandering the virtuous, leading them into deviant paths; harming the good and fostering evil, feigning compliance while betraying in secret—such are the Ten Evils of the East, boundless and immeasurable, beyond reckoning.\n\nIf one now wholeheartedly confesses and repents, wishing to eliminate these ten sins, they shall not be recorded by the Ten Upright Deities of the East or the messengers of the Heavenly Emperor, nor reported to the celestial courts. After the expiration of their fate, they shall not fall into the wind-and-thunder hells of the East’s Infinite World. Their embodied spirits in life and death shall be spared the calamities of thunder and lightning. In future rebirths among humans, they shall enjoy boundless happiness.\n\nThen the Universal Salvation Perfected One and all the assembled immortals bowed their heads in single-minded reverence, respectfully receiving the teachings.\n\n*End of Scroll One of the Laozi Icon and Named Sutra*\n*Scroll Two of the Laozi Icon and Named Sutra*\n\nAt that time, the Most High Laozi addressed the Universal Salvation Perfected One of the South and all the assembled immortals: \"In the Infinite World of the Three Qi of the South, there are thirty sacred names and images of Heavenly Worthies. Those who pay homage to them shall eradicate boundless sins and attain boundless blessings.\n\nWith wholehearted faith, pay homage to the Heavenly Worthy of Majestic Virtue and Great Compassion of the South.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Radiant Flame and Numinous Brilliance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Vermilion Numinosity of the Southern Culmen.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Solemn Purity of the Southern Heights.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Formless Longevity.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Cinnabar Numinosity and Settled Wisdom.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Cinnabar Origin and Radiant Wonder.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Vermilion Brilliance and Dharma Origin.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Wisdom Life and Congealed Constancy.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Majestic Brilliance and Liberation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Dharmakāya Manifesting in the World.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Unobstructed Self-Mastery.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Skillful Dharma Exposition.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Augmenting Wisdom and Understanding.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Skillful Means and Transformation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Utmost Quiescence and Limpid Clarity.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Wisdom and Virtue without Equal.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Great Subtlety Responding to Names.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Mysterious Penetration and Settled Appearance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Penetrating Insight into Darkness and Light.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Brahmā’s Brilliance and Vast Teaching.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Blissful and Supreme Retribution.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Ascending the Mysterious to the Utmost.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Wondrous Brilliance and Treasure Victory.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Central Harmony and Great Wisdom.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the One Vehicle and the Empty Ultimate.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mysterious Origin Manifesting Responses.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Boundless Majestic Transformation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Mysterious Splendor and Wondrous Awakening.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Obscure Spirits and Penetrating Serenity.\"\n\nThe Most High Laozi said: \"These Heavenly Worthies, with their retinues of attendants and boundless assemblies, all dwell within the Infinite World of the Three Qi of the South. They broadly expound the Great Vehicle, disseminating the essential teachings of the Dao, liberating all sentient beings from sin, delivering them from suffering, and universally bestowing peace and happiness.\"\n\nAt that time, the Most High Laozi addressed the Universal Salvation Perfected One of the South and all the assembled immortals: \"If you can guide and transform all sentient beings in the Infinite World of the South—whether male or female—so that they all return to sincerity, wholeheartedly pay homage, and praise the sacred names and images of the thirty Heavenly Worthies of the Infinite World of the Three Qi of the South, they shall eradicate the karmic retributions of life and death for all beings. They shall eliminate the sins of having slandered the true scriptures as heterodox teachings, forgotten the transmission of their teachers and disobeyed their instructions, divined omens and falsely predicted fortune and misfortune, deceived and coerced the good into servitude, indulged in licentious desires and wantonly violated the law, stripped and robbed practitioners of their clothing, stolen the permanent implements of the Three Treasures, desecrated tombs and plundered the dead, hoarded scriptures and refused to transmit them, and envied others’ wealth, wishing for their decline and loss.\n\nSuch are the Ten Evils of the South, boundless and immeasurable, beyond reckoning. If one now wholeheartedly confesses and repents, wishing to eliminate these ten sins, they shall not be recorded by the Ten Upright Deities of the South or the messengers of the Great One. Their sins shall not be reported to the celestial courts. After the expiration of their fate, they shall not fall into the furnace-and-charcoal hells of the Infinite World of the South. Their embodied spirits in life and death shall be spared the suffering of scorching and burning. In future rebirths among humans, they shall enjoy boundless happiness.\"\n\nThen the Universal Salvation Perfected One and all the assembled immortals bowed their heads in single-minded reverence, faithfully receiving the teachings.\n\n*End of Scroll Two of the Laozi Icon and Named Sutra*\n*Scroll Three of the Laozi Icon and Named Sutra*\n\nAt that time, the Most High Laozi addressed the Compassionate Perfected One of the West and all the assembled immortals: \"In the Infinite World of the Seven Qi of the West, there are seventy sacred names and images of Heavenly Worthies. Those who pay homage to them shall eradicate boundless sins and attain boundless blessings.\n\nWith wholehearted faith, pay homage to the Heavenly Worthy of Golden Radiance Protecting the Soul of the West.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Numinous Wisdom Illuminating the West.\"\n\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Western Limit Revealing the True.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Nine Elders of the Mysterious True.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Ten Flowers of the Supreme Sages.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Four Voids Illuminating All.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Seven Radiances of the True Origin.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Three Pristine Luminous Spirits.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Golden Gate Expounding the Teachings.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Supreme Limit of the Great Flower.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Empty Cavern and the Void Sovereign.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mysterious Radiance Delivering the World.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Nine Voids and the Great Pristine.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Eight Effulgences of the Numinous Radiance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Seven Awakenings Illuminating Doubts.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Three Pristine Illuminations.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Great Cavern’s Effulgent Flower.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Immeasurable True Suchness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Primordial Harmony and Precious Victory.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Fixed Radiance and Life Register.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Pristine Flower and Pure Virtue.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Wondrous Treasure and Pure Radiance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the True Illumination and Void Limit.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Penetrating Harmony and Numinous Response.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Supreme Mystery on High.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Void Limit and Wondrous Numinous.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Precious Flower and Primordial Brahma.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Pure Treasury and Secret Effulgence.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Patriarch Delivering from Suffering.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mysterious Pristine and Total Virtue.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Great Flower Responding to the Kalpa.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the August Jade Emperor on High.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Victorious Radiance and Precious Brilliance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Supreme Sage and Mysterious Effulgence.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Central August and True Boundary.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Primordial Cavern and Jade Dawn.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Supreme Unity on High.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Ultimate Limit and Luminous Palace.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Jade Void and Towering Form.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Total True and Primordial Cavern.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Flowing Radiance and Manifest Response.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mysterious Insight Illuminating the Obscure.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Far-Reaching and Profound Abyss.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Golden Countenance Revealing Form.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Descending Form and Scattered Effulgence.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Flowing Radiance Illuminating the Four Quarters.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Cavern Origin and Accumulated Responses.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Supreme Mystery Governing All.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Vast Brilliance and Brahma Treasure.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Golden Radiance and Seven Pristine.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Jade Emperor and True Limit.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Supreme Mystery on High.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Cavern Wisdom and Empty Form.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Luminous Mechanism and Flowing Insight.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Seeking the True in the Great Cavern.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Concentrating the Spirit and Meeting the Sages.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the True Mystery and Supreme Unity.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Pure Fullness and Preserving Radiance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Great Vehicle and Effulgent Virtue.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Radiant Brilliance on High.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Universal Cessation and Illuminating Karma.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Jade Moisture and Flowing Splendor.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Supreme Flower and Primordial Unity.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Six Voids and Cavern Palace.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Seven Transformations and Primordial Harmony.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Five Kalpas Initiating Transformation.\n\nThe Most High Laozi said: \"Such are the Heavenly Worthies, their forms perfectly complete, attended on left and right by boundless retinues, all dwelling within the Infinite World of the Seven Qi of the West. They broadly expound the Great Vehicle, disseminate the essential teachings of the Dao, and deliver all sentient beings burdened with sins, enabling them to depart from suffering and attain perfect peace and happiness.\"\n\nAt that time, the Most High Laozi addressed the Compassionate Perfected One of the West and all the assembled immortals: \"If you are able to guide and transform all sentient beings in the Infinite World of the West—whether male or female—so that they all return to sincerity, with wholehearted faith pay homage, recite, and praise the seventy sacred names and images of the Heavenly Worthies in the Infinite World of the Seven Qi of the West, you will eradicate the karmic retributions of life and death for all beings. This includes the sins of uttering false and deceitful words, lacking integrity; the sins of envy toward those superior to oneself; the sins of relying on power to bully the poor and lowly; the sins of feigning kindness while harboring malice, smiling outwardly while seething within; the sins of crafting deceptive arguments and perverting justice to suppress the upright; the sins of berating superiors and inferiors, disdaining the elderly and infirm; the sins of spreading slander to provoke hatred; the sins of exposing the five bodily forms to the Three Luminaries; the sins of groundless resentment and unjust punishment; and the sins of manipulative speech, initially pleasing but later inciting anger.\n\nSuch are the ten evil sins of the West, immeasurable and boundless, beyond reckoning. Now, if one wholeheartedly confesses and repents of these ten sins, they will be absolved, and the Ten Upright Deities of the West will not record their transgressions to report to the celestial courts. After the end of their lifespan, they will not fall into the hells of the Infinite World of the West, where golden hammers and iron rods await, nor will their spirits in life and death suffer the torment of flogging. In their next rebirth among humans, they will enjoy boundless happiness.\"\n\nThereupon, the Compassionate Perfected One and all the assembled immortals bowed their heads in single-minded reverence, faithfully receiving the teachings.\n\n*End of Scroll Three of the Laozi Icon and Named Sutra*\n*Scroll Four of the Laozi Icon and Named Sutra*\n\nAt that time, the Most High Laozi addressed the Perfected One of Salvation from Suffering of the North and all the assembled immortals: \"In the Infinite World of the Five Qi of the North, there are fifty sacred names and images of Heavenly Worthies. Those who pay homage to them shall eradicate boundless sins and attain boundless blessings.\n\nWith wholehearted faith, pay homage to the Heavenly Worthy of the North Prolonging Life and Preserving Destiny.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Northern Limit and Bright Radiance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mysterious Void and Supreme Ultimate.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Purple Salvation and Void Sovereign.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Golden True and Responding Blessings.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Ten Virtues of the Jade Flower.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mysterious Subtlety and Hidden Radiance.\"\n\nWith wholehearted reverence, pay homage to the Heavenly Worthy of the Supreme Treasure of the Lofty Perfected.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mysterious Harmony and Great Salvation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Purple Dawn and Descending Blessings.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Supreme Wisdom and Vast Compassion.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Treasured Stillness and Hidden Source.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Numinous Light and Upright Virtue.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Returning to Simplicity and Revealing Images.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Pacifying Spirits and Serene Illumination.\nWith wholehearted faith, pay homage to the Heavenly Lord of the Purple Ultimate.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mysterious True and Wondrous Treasure.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Unobstructed Fourfold Reach.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Sixfold Discernment and Void Doubt.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Bright Radiance and Scenic Splendor.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Perfect Light and Blazing Brilliance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Golden Reflection and Flowing Perfection.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mysterious Supreme and Purple Void.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Supreme Subtlety of the Grand Tenuity.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Numinous Light and Empty Likeness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Supreme Scenic Sovereign.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Void Brightness and Penetrating Wisdom.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Treasured Mystery and Flowing Transformation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Clarifying Spirits and Preserving Kalpas.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Wondrous Wisdom and Profound Constancy.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Fivefold Numinous Virtue.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Solemn Guest and Manifesting Transformation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Six Perfections and Congealing Spirit.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Lofty Primordial and Supreme Likeness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Universal Light and Vast Salvation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Congealed Mystery and Lofty Supreme.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Radiant Scenery and Primordial Harmony.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Vast Clarity and Treasured Likeness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Empty Wisdom and Unhindered.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Double Light and Myriad Virtues.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Embracing Harmony and Far-Reaching.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Wandering Void and Constant Joy.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Upright Solemnity and Supreme Virtue.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Bright Rosy Clouds and Penetrating Knowledge.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Riding Perfection and Guiding Transformation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Numinous Transformation and Responsive Mechanism.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Penetrating Mystery and Dispelling Obstruction.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Virtue and Intent Supreme.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Void Sovereign and Proclaiming the Sage.\n\nThe Lofty Supreme Lord Lao said: \"Such Heavenly Worthies, with their retinues complete and surrounded by boundless attendants, all dwell within the Five Qi Boundless Realm of the North. They broadly expound the Great Vehicle, disseminate the essential teachings of the Dao, and deliver all sentient beings burdened with sins, enabling them to depart from suffering and attain peace and happiness.\"\n\nAt that time, the Lofty Supreme Lord Lao addressed the Perfected of Salvation from Suffering of the North and the assembly of immortals: \"If you can guide and transform all sentient beings in the Boundless Realm of the North—whether male or female—so that they all return to sincerity, with wholehearted faith pay homage, extol, and praise the names of the fifty sacred images of the Heavenly Worthies in the Five Qi Boundless Realm of the North, you shall eradicate the karmic retributions of sentient beings in the cycle of birth and death. This includes the sins of killing living beings with blood, the sins of refusing to bestow alms and establish meritorious deeds, the sins of consuming living beings for sustenance, the sins of hunting with hawks and hounds to kill living beings, the sins of setting fires to mountains and harming crawling creatures, the sins of seeing the sick and not generating compassion or offering treatment, the sins of digging pits on thoroughfares to break people’s limbs, the sins of recklessly placing thorny brambles to obstruct travelers’ paths, the sins of stealing others’ spouses and deceitfully luring away their servants, and the sins of stealing sacred images, bells, chimes, and other objects.\n\nSuch are the ten evil sins of the North, boundless and immeasurable, beyond reckoning. Now, if one wholeheartedly confesses and repents, eliminating these ten sins, the Ten Upright Deities of the North and the death-recording spirits of the Northern Dipper will not inscribe their offenses. These sins will not be reported to the celestial courts, and after the end of their lives, they shall not fall into the freezing, dark, and icy hells of the Boundless Realm of the North, forever spared the suffering of lying exposed on beds of ice. In their next rebirth among humans, they shall enjoy boundless happiness.\"\n\nThereupon, the Perfected of Salvation from Suffering and the assembly of immortals wholeheartedly prostrated in reverence and respectfully received the teachings.\n\n*Scripture of the Names and Images of Lord Lao, Scroll Four concludes.*\n\n*Scripture of the Names and Images of Lord Lao, Scroll Five*\n\nAt that time, the Lofty Supreme Lord Lao addressed the Perfected of Compassionate Reverence of the Northeast and the assembly of immortals: \"In the Boundless Realm of the Brahman Qi of the Northeast, there are one hundred and twenty sacred names and images of Heavenly Worthies. Those who pay homage to them shall eradicate boundless sins and attain boundless blessings.\"\n\nWith wholehearted faith, pay homage to the Heavenly Worthy of Compassionate Forbearance and Salvation from Suffering of the Northeast.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Primordial Numinous and Lofty Sage.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Central August Supreme One.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Brahman Qi and All-Encompassing.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Yellow Court and Grand Protector.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Three Pristine and Grotto Spirits.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Great Compassion and Pity for Suffering.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Rosy Clouds and Bright Radiance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Central Mystery and Upright Oneness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Yellow Chamber and Serene Grotto.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Lofty Supreme and Void Nothingness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mysterious Subtlety and Supreme Treasure.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Nine Elders of the Yellow Court.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Numinous Might and Deliverance from Suffering.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Eightfold Clarity and Vast Qi.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mysterious True and Supreme Scenery.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Supreme August and Wondrous Victory.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Numinous Light and Preserving Life.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Flowing Light and Penetrating Guidance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Flying Flowers and Celebrating Virtue.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Returning Light and Ultimate Reach.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Responsive Image and Flying Light.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Unintentional and Wondrous Body.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Six Perfections and True Countenance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Prospering the Dao and Manifesting Likeness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Lofty Perfected and Contemplating the Wondrous.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Flowing Transformation and Extending Perfection.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Wondrous Joy and Unsurpassable.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Primordial Numinous and Single Qi.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mysterious Numinous and Eightfold Pristine.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the True Elder and Blessed Celebration.\n\nWith wholehearted faith, pay homage to the Heavenly Worthy of Azure Perfection and Wondrous Awareness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Azure Radiance and Primordial Elder.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Mystic Harmony and Pure Virtue.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Great Vacuity and Supreme Power.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Luminous Perfection and Four Poles.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Spontaneous Emptiness and Ultimate Void.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Accumulated Blessings and Primordial Harmony.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Vast Extension and Compassionate Kindness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Myriad Blessings and Universal Protection.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Compassionate Kindness and Vast Salvation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Luminous Worthies and Compassionate Love.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Opening Salvation and Blessed Dao.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Radiant Light and Compassionate Grace.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Eightfold Reach and Constant Kindness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Six Harmonies and Pervasive Illumination.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Opening Salvation for Sorrow and Affliction.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Mounting Smoke and Supreme Emperor.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Seven Origins and Eight Assemblies.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Great Cinnabar and Threefold Pristine.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Primordial Harmony and Jeweled Likeness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Supreme Perfection and Lofty Truth.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Jade Radiance and Numinous Brilliance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Pervasive Mystery and True Stillness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Central Harmony and Kind Stillness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Reverent Love and Extending Light.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Flowing Light and Great Illumination.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Numinous Perfection and Flowing Brahma.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Supreme Polarity and Ultimate Greatness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Luminous Power and Great Cinnabar.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Pervasive Light and Universal Illumination.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Mystic Mechanism and Wondrous Response.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Golden Perfection and Flowing Reflection.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Jade Radiance and Shimmering Splendor.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Waving Light and Vibrant Brilliance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Demolishing Demons and Liberating Beings.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Secret Brilliance and Longevity.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Pervasive Truth and Dispelling Obstructions.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Radiant Light and Shimmering Brilliance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Great Florescence and Stabilizing Likeness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Inner Brilliance and Embracing Harmony.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Pervasive Numinosity and Transforming Return.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Flying Steps through Ninefold Vacuity.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Pacing the Seven Origins.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Vast and Boundless Radiance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Sevenfold Brilliance and Extending Numinosity.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Primal Chaos and Transforming Creation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Pervasive Illumination and Four Caverns.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Enlightening the Boundless.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Empty Mystery and Illuminating Brahma.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Great Vacuity and Mystic Concealment.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Numinous Capital and Gathering Blessings.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Auspicious Clouds and Universal Coverage.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Cavernous Floating and Sevenfold Brilliance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Numinous Light and Fourfold Illumination.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Preserving Life and Protecting Souls.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Cavernous Vacuity and Perfect Ultimate.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Expounding the Dharma and Transforming Creation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Cinnabar Florescence and Resplendent Reflection.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Flowing Brilliance and Supreme Unity.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Cavernous Enlightenment and Mystic Profundity.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Mystic Pervasiveness and Numinous Brilliance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Divine Light and Distant Insight.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Purple Court and Assembling Sages.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Crafting and Guiding Multitudes of Perfected.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Vast Extension and Mystic Transformation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Numinous Source and Universal Moistening.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Revering Truth and Expounding the Teachings.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Pacifying Transformation and Supreme Mystery.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Radiant Brilliance and Perching in Truth.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Jeweled Brilliance and Cavernous Illumination.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Eightfold Brilliance and Returning Dawn.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Perfect Brilliance and Shimmering Radiance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Illuminating Light and Ultimate Dawn.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Numinous Source and Vast Harmony.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Golden Light and Mystic Brilliance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Vast Truth and Liberating Beings.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Governing Multitudes of Perfected.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Dharma Illumination and Numinous Insight.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Supreme Empyrean and Radiant Brilliance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Binding Clarity and Double Illumination.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Enlightening Truth and Mystic Pristine.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Primal Chaos and Transforming Birth.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Contemplating Mystery and Assembling Stillness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Numinous Light and Resplendent Reflection.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Flourishing Light and Flowing Brilliance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Wisdom Source and Mystic Flourishing.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Congealing Emptiness and Kind Stillness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Dharma Light and Jeweled Likeness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Mystic Light and Universal Illumination.\n\nThe Most High Lord Lao said: These Heavenly Worthies, each with bodies of wondrous golden hue, bear upon their necks flying, resplendent aureoles. Upon their heads they wear seven-jeweled lotus crowns that reach to heaven, adorned with cloud-bright, flowing, radiant hairpins. Their bodies are draped in five-cloud, variegated brocade robes, and they don garments of cinnabar radiance and flowing, shimmering skirts. Their feet are shod in square shoes of double-pearl brilliance. Each is accompanied by ten divisions of attendants: fierce soldiers of heaven and dragon, earthly immortals and Daoist adepts, demon-subduing kings, dharma-protecting perfected, vajra-holding earth spirits, celestial marshals and warriors, jade lads bearing incense, jade maidens scattering flowers, five-colored lions, and divine archers.\n\nThereupon, the Heavenly Worthies mounted the void and traversed the mist, journeying together through the boundless world of the northeast, broadly delivering all sin-laden beings, guiding them into the joyous Dao, and granting each peace.\n\nAt that time, the Most High Lord Lao addressed the Reverent and Compassionate Perfected of the Northeast and the assembled immortals: \"If you can exhort and transform all good men and good women of the boundless world in the northeast, urging them to wholeheartedly submit and sincerely pay homage, extolling the sacred names of the one hundred twenty Heavenly Worthies of the northeastern Brahma qi, then they shall eradicate the sins of setting snares and nets, hunting birds and beasts, committed by both the living and the dead across generations. Next, they shall eradicate the sins of delighting in falconry and hawking, roaming to capture living beings. Next, they shall eradicate the sins of slaughtering the six livestock at year’s end to offer sacrifices. Next, they shall eradicate the sins of falsely accusing the innocent and causing them to be imprisoned. Next, they shall eradicate the sins of severing affection, separating flesh and blood. Next, they shall eradicate the sins of branding the faces of slaves and servants. Next, they shall eradicate the sins of ruining marriages and preventing harmony. Next, they shall eradicate the sins of bodily impurity and defiling the Three Treasures. Next, they shall eradicate the sins of mocking those afflicted with leprosy, madness, wind, or epilepsy. Next, they shall eradicate the sins of nitpicking and seeking out others’ faults.\"\n\nThose who bear these ten heinous sins of the northeast—sins boundless and immeasurable, beyond reckoning—if now they repent with but a snap of the fingers, eradicating these ten transgressions, shall not have their offenses recorded by the Ten Upright Deities of the Northeast, the envoys of the Great One, nor reported to the Celestial Courts. Thus, when their lifespan ends and their fate is spent, they shall not fall into the Cauldron-Boiling Hell of the Boundless World of Brahmanic *qi* in the northeast, forever spared the torment of scalding and boiling. Their five limbs shall remain whole, their six viscera pure, roaming freely in the Purple Chambers and dwelling leisurely in the Crimson Palaces.\n\nShould they be reborn among humans, they shall become teachers and models for others, enlightening sentient beings and guiding them into the Dharma’s true form. This is owing above to the grace of the One Hundred and Twenty Heavenly Worthies of the Brahmanic *qi* in the northeast, and below to the sincerity of these men and women who wholeheartedly submit and take refuge.\n\nThereupon, the Venerable Master of Compassion and Reverence, along with the assembly of immortals, snapped their fingers in homage and bowed in reverence to receive the teachings.\n\n*Laozi’s Scripture of Iconic Names, Scroll the Fifth, concludes.*\n*Laozi’s Scripture of Iconic Names, Scroll the Ninth.*\n\nAt that time, the Most High Laozi addressed the Longevity Perfected of the Upper Realm and the assembly of immortals: The divine names and images of the Three Hundred and Twenty Heavenly Worthies of the Boundless World of Brahmanic *qi* in the Upper Realm—those who pay homage to them shall eradicate boundless sins and attain boundless blessings.\n\nWith utmost sincerity, pay homage to the Heavenly Worthy of Compassion, Salvation, and Suffering Relief.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Solemn Purity and Dharma Endurance.\n\nWith utmost sincerity, pay homage to the Heavenly Worthy of Responsive Transformation and Majestic Power.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Fearless Brahmanic Form.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Great Ocean of Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Boundless Dharma Treasury.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Great Compassion and Myriad Virtues.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Mysterious Subtlety and Self-Mastery.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Boundless Right Awakening.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Compassionate Harmony and Wondrous Treasure.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Solemn Dignity and Majestic Power.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Radiant Upper Virtue.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Dharma Bridge and Great Deliverance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Revealing the Wondrous Gate.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Vast Propagation and Life Preservation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Soul Protection and Merciful Salvation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Karmic Conditions and Salvific Deliverance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Flowing Light and Dharma Joy.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Jade Perfection and Compassionate Love.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Majestic Sagacity and Transforming the Mortal.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Eternal Peace and Settled Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Penetrating Emptiness and Compassionate Remembrance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Faithful Wisdom and Artisan Perfection.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Augmenting and Benefiting Supreme Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Merit, Virtue, and Solemn Purity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Treasure Light and Merciful Salvation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Primordial Perfection and Eternal Bliss.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Universal Illumination and Pure Love.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Riding the Light and Good Stillness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Supreme and Victorious Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Resplendent Light and Self-Mastery.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Golden Perfection and Life Deliverance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Good Concentration and Mysterious Penetration.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Bestowing Compassion and Universal Salvation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wondrous Traces and Subtle Entry.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Secluded Stillness and Penetrating Darkness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Penetrating Harmony and Lofty Mystery.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Longevity and Myriad Virtues.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Utmost Emptiness and Serene Wonder.\nWith utmost sincerity, pay homage to the Heavenly Worthy of True Wandering in the Upper Realms.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Great Penetration and Communion with the Real.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Dharma Flow and Far-Reaching Harmony.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Lofty Virtue and Treasure Treasury.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wisdom Perfected and Illuminating Insight.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Good Responses Without Doubt.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Congealing Eternity and Transforming Destiny.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Universal Light and Exhorting Virtue.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Mysterious Virtue and Settled Vows.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Gathering the Real and Responsive Manifestation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wondrous Perfection and Complete Practice.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Compassionate Transformation and Salvific Deliverance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Dragon Virtue and Majestic Power.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Myriad Transformations in Responsive Manifestation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Constantly Bestowing Myriad Virtues.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Dignified Conduct and Initiating Deliverance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of True Purity and Good Sincerity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Penetrating Spirit and Brahmanic Deliverance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Upright Virtue and Protecting the Mandate.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Secluded Stillness and Abiding Constancy.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Pure Land and Initiating Karmic Conditions.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Skillful Means and Flowing Propagation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Empty Clarity and Great Deliverance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Majestic Virtue and Fearlessness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Eternal Peace and Wondrous Practice.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Responsive Exhortation to Virtue.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Accordance with Conditions and Karmic Resonance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Great Treasury and Wondrous Sound.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Treasure Illumination and Dharma Victory.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wisdom Stillness and Solemn Light.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Vow Power Without Limit.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Universal Vision and Unsurpassed Victory.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wisdom Contemplation and Solar Splendor.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Treasure Treasury and Lunar Radiance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Pure Sovereignty and Perfect Fulfillment.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Forgetting Discriminative Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Radiant Illumination and Contemplative Insight.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wondrous Accumulation and Immortal Brahman.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Flying Wheels and Stepping the Records.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Dharma Assembly and Transformative Deliverance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Lofty Mystery and Primordial Simplicity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wondrous Countenance and Golden Splendor.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Numinous Perfection and the Supreme Thearch.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Victorious Light and Universal Salvation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Supreme Wisdom and Contemplating Emptiness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Initiating Karmic Conditions and Settled Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Golden Form and Wondrous Appearance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Penetrating the Origin and Responsive Light.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Myriad Virtues in Equal Measure.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Great Emptiness and Penetrating Illumination.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Empty Receptivity and Good Accumulation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Dharma King and Responsive Resonance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Dharma Wonder and Guarding the Real.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Empty Liberation and the Ocean of Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Flying Mystery and the Dharma Treasury.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Majestic Transformation and Spiritual Penetration.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Revealing the Essential Purport.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Good Responses and Empty Stillness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Unsurpassed and Most Victorious.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Mysterious Proclamation of the Supreme Teaching.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Universal Salvation in All Directions.\nWith utmost sincerity, pay homage to the Heavenly Worthy of True Liberation and Subduing Demons.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Realizing Emptiness and Faithful Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Dharma Beneficence and Vast Moistening.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Eternal Abiding and Riding the Light.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Constantly Transforming Beings with Goodness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Empty Penetration and the Great Void.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Artisan Perfection and Karmic Convergence.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Treasure Wisdom and Longevity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Primordial and Wondrous Original Form.\nWith utmost sincerity, pay homage to the Heavenly Worthy of True Nature and Eternal Unity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Mysterious Extremity and Congealed Harmony.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Flowing Radiance and Discerning Illumination.\nWith utmost sincerity, pay homage to the Heavenly Worthy of True Wonder and Clarified Mystery.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wisdom, Virtue, and Compassionate Goodness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Dharma Origin and Responsive Manifestation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Mysterious Artisan and Solemn Adornment.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Good Guidance and Initiating the Unenlightened.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Vast Benevolence and Supreme Sagacity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Fearless and Good Instruction.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Proclaiming and Flowing Wondrous Transformation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Conveying and Delivering the Four Kinds of Beings.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Initiating and Guiding the Dharma Teachings.\n\nWith utmost sincerity, pay homage to the Heavenly Worthy of Responding to the World as Dharma King.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Treasure Virtue Pervading All.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Responsive Manifestation and Karmic Connection.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Mighty Clouds Bestowing Blessings.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Good Protection Without Abandonment.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wisdom’s True Ultimate Measure.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Immortal Wandering in Pure Wonder.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Initiating Kalpas and Delivering Beings.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Pervasive Clarity and Perfect Fulfillment.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Jade Radiance and Pure Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Treasure Mind and Supreme Excellence.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Boundless and Mysterious Subtle.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Flowing Light and Universal Longevity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Great Mystery and Lofty Excellence.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Supreme Virtue and Great Perfection.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wondrous Manifestation and Luminous Form.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Sagely Wisdom and Soaring Mystery.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Transcending and Ascending the Treasure Sea.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Morning Light and Supreme Goodness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Kāñcana Grove and Manifesting Sagacity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Divine Perfection and Vast Virtue.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Golden Countenance and Perfect Form.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Jade Splendor and Treasure Illumination.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Responding to Perfection Without Obstruction.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Dao-Wisdom and the Profound Subtle.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Divine Perfection Without Hindrance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Mysterious Response and Spontaneous Nature.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wondrous Enlightenment and Great Completion.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Forgetting Merit and Utmost Profundity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Good Wisdom and Prolonging Life.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Supreme Numinous and Lofty Wonder.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Golden Portal and Illuminating Measure.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Universal Mystery and Virtue.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Vajra-like Stillness and Quiescence.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Empty Form and Upright Solemnity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Empty Mind and Bestowing Blessings.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Pure Wisdom and the Root of Virtue.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Instituting the Dharma at the Kalpa’s Beginning.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Universal Awakening and Constant Purity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Dao-Mechanism and Skillful Response.\nWith utmost sincerity, pay homage to the Heavenly Worthy of True Sovereign and Wondrous Joy.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Great Cavern and Mysterious Emptiness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Utmost Virtue and Pervasive Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Flowing and Spreading Luminous Transformation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Mighty Prohibitions and Myriad Spirits.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Obscure Union with Sagely Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Solitary Stillness and Profound Silence.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Illuminating Might and Governing the World.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Great Completion and Dharma Benefit.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Empty Sovereign and Wondrous Governance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Numinous Radiance and Renewed Brilliance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wisdom Triumphant and True Essence.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Containing Light and Pervasive Serenity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Mirror Assembly and Flowing Clarity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Lofty Mystery and Concealed Virtue.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Profound Emptiness and Hidden Splendor.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Vast Salvation and Delivering Beings.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Great Universal Wisdom-Seed.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Divine Penetration Universally Pervading.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Profound Subtlety and Enduring Vision.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Transcending the Defiled Realms.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Accumulating and Perfecting Mystic Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Kāñcana Grove and Manifesting Form.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Augmenting and Transforming Beings.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Treasure Wisdom and Empty Receptivity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Pervasive Serenity and Dispelling Demons.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Mysterious Emptiness and Treasure Shade.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wondrous Triumph and True Purity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Clarifying Spirit and Refining Shadow.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Numinous Felicity and Enduring Flow.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Subduing Demons and Mighty Transformations.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Weighing Things and Karmic Conditions.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Riding Emptiness and Skillful Guidance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Jade Light and Pure Virtue.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Mighty Virtue and Difficult to Overcome.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Profound Origin and Still Quiescence.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Mysterious Supreme and Numinous Source.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Profound Perfection and Sagely Assembly.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Loving Forbearance and Proclaiming the Teachings.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Opening Transformation and Guiding the Deluded.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Yellow Court and Supreme Ultimate.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Subduing Demons and Rescuing from Suffering.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Still Illumination and Emptiness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Upright Perfection and Numinous Wonder.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Silent Contemplation and the Profound Mystery.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Purple Ultimate and Supreme Origin.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Containing Light and Universal Vows.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Great Void and Myriad Wonders.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Profound Subtlety and the Full Moon.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Vast Kalpa and Primordial Sovereign.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Rescuing and Protecting the Dharma King.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Double Mystery and Congealed Stillness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Treasure Grove and Wondrous Conduct.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Self-Mastery and Skillful Response.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Universal Wisdom and True Form.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Nameless Concealed Virtue.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Great Compassion and Loving-Kindness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Mysterious Virtue and Wisdom Treasury.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wise Awakening and Wondrous Origin.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Compassionate Countenance and Still Form.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Responding to Perfection and the Great Unity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Mighty Radiance Without Hindrance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Lofty Sagacity and Pervasive Clarity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Mysterious Origin and Wondrous Birth.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Empty Wisdom and Congealed Constancy.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Skillful Means and Good Salvation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Pervasive Perfection and Universal Response.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Myriad Goodness and Compassionate Bestowal.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Fragrant Light and Forbearance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Congealing Spirit and Mysterious Awakening.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Great Compassion and Selflessness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Transforming and Subtle Illumination.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Empty Penetration and Graded Measure.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Great Kindness and Myriad Goodness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Oceanic Measure and Boundless Vastness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Luminous Wonder and Lofty Mystery.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Abiding in the Illusory and Empty.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Profound Subtle and the Root of Virtue.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Radiant Numinosity and Delivering Lives.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Assembling Goodness and Initiating the Lineage.\n\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Wondrous Empty True Form.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Embracing Vastness and Graded Measure.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wisdom Treasury and Subtle Penetration.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wisdom’s Resolution and Empty Quiescence.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Universally Illumining the Profound and Mysterious.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Dharma’s Root and Empty Congealment.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Heavenly Treasure and Self-Mastery.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wisdom’s Perfection and Great Fullness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Impartiality and Kind Response.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Initiating Light and Delivering Beings.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Boundless Salvation from Suffering.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Abiding in Stillness and Profound Silence.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Pure Subtlety and Realized Awakening.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Profound Clarity and Penetrating Illumination.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Great Illumination and Empty Liberation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Lofty Purity and Wondrous Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Initiating Conditions and Universal Salvation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Boundless Wondrous Body.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Myriad Transformations of Light and Form.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Purple Emptiness and Mysterious Sagehood.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Soaring in Emptiness and Victorious Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Jade Dawn and Radiant Splendor.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Brahma Treasure and Great Emptiness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Primordial Spirit and Contemplative Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Oceanic Emptiness and Discerning Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Supreme and Wondrous Light.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Kind Vows and Universal Sound.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Subtle Might and Majestic Virtue.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Compassion and Protective Deliverance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Upright Stillness and Brahma Conduct.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Kind Admonitions and Pure Serenity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Immortal Spirits and Orthodox Practice.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Compassionate Bestowal and Flourishing Goodness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Inconceivable Might and Power.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Responding to Conditions and Adapting to Beings.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Abiding in Wisdom and Capacity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of True Wandering and Fundamental Practice.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Three Vehicles and Penetrating the Ultimate.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Accumulated Contemplation and Communicating with Spirits.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Empty Sovereign and Wondrous Treasure.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Abiding in Joy and Solitary Existence.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Pervading the Vast Kalpas.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Fragrant Forest and Eminent Form.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Non-Action and Universal Salvation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Preserving Life and Ascending Birth.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Unmatched Wisdom and Virtue.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Dao’s Wisdom and Lofty Ultimate.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Upright Dignity and Pure Practice.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Impartiality and Kind Salvation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Oceanic Treasury and Inexhaustible.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Proclaiming the Sage and Initiating the Origin.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Extending Blessings and Treasure Spirits.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Flourishing and Wondrous Transformation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Universally Manifesting Myriad Virtues.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Numinous Sound and Expounding Flourishingly.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Ascending Flowers and Delivering Immortals.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Golden Countenance and Responsive Manifestations.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Treasure Mind and Constant Quiescence.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Contemplating and Illumining Emptiness and Non-Being.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Six Penetrations and Realized Awakening.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Illumination and Function in Perfect Clarity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Mysterious True and Wondrous Profundity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Dividing Form and Communicating Virtue.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Primordial Spirit and Upright Stillness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Boundless and Great Deliverance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Tranquil Vastness and Non-Action.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Utmost True and Profound Quiescence.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Mysterious Female and Empty Congealment.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Treasure Summit and Great Accomplishment.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Dharma Accumulation and Radiant Illumination.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Treasure Flower and Strict Purity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Constant Manifestation and Eternal Countenance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Universally Illumining Conditions and Responsive Feelings.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Constantly Bestowing Might and Virtue.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Circulating Salvation from Suffering.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Contemplating Deliverance and Drought-Born Beings.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Entering Samādhi and Abiding in Constancy.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wondrous Sound and Quiescent Resonance.\n\nThe Most High Lord Lao said: Such Heavenly Worthies, with all forms perfectly complete, surrounded by boundless retinues of attendants, universally abide in the Immeasurable Realm of the Upper Regions, broadly expounding the Great Vehicle, disseminating the essential teachings of the Dao, delivering all sentient beings burdened with transgressions, enabling them to depart from suffering and universally attain peace and bliss.\n\nAt that time, the Most High Lord Lao addressed the Upper Region’s Longevity Perfected and all the immortals: If you can guide and transform all sentient beings in the Immeasurable Realm of the Upper Regions—both Daoists and laypersons, men and women—universally leading them to return to sincerity, with utmost reverence pay homage, recite, and extol the sacred names of the three hundred twenty Heavenly Worthies of the Immeasurable Brahma-Qi Realm of the Upper Regions. This can eradicate the karmic retributions of sentient beings, including transgressions from past lives involving bodily actions, precepts, and rituals—such as worshipping earth altars and kitchen stoves; sins of trusting in spirit-mediums and improperly venerating ghosts and spirits; sins of sharing beds with those lacking precepts; sins of gossiping and concealing improper acts; sins of promiscuity and unruly conduct; sins of forging documents to falsely implicate the virtuous; sins of cursing heaven and earth, the Three Luminaries, wind, and rain; sins of disrespecting officials and attacking others’ faults; sins of stealing the permanent property of the Three Treasures; and sins of encroaching upon the sacred lands of the Three Treasures for fields and dwellings.\n\nSuch are the ten grave sins of the Upper Regions, boundless and immeasurable, impossible to recount. Now, if one wholeheartedly confesses and repents, eliminating these ten sins, they will not be recorded by the Ten Upright Deities or the Supreme Unity of the Upper Primordial for submission to the Heavenly Courts. After the expiration of their lifespan, they will not fall into the fiery hells of the Immeasurable Realm of the Upper Regions, forever freed from the anguish of burning and torment. In subsequent rebirths among humans, they will enjoy boundless happiness.\n\nThereupon, the Longevity Perfected and all the immortals wholeheartedly prostrated in reverence, respectfully receiving the teachings.\n\n*Scripture of the Names and Images of Lord Lao, Scroll Nine Concludes*\n*Scripture of the Names and Images of Lord Lao, Scroll Ten*\n\nAt that time, the Most High Lord Lao addressed the Lower Region’s Life-Preserving Perfected and all the immortals: The sacred names of the one hundred twenty Heavenly Worthies of the Immeasurable Brahma-Qi Realm of the Lower Regions—paying homage to them eradicates boundless transgressions and accrues boundless blessings.\n\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Restores Souls and Raises the Dead.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Wondrous Treasure, Supreme Perfected.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Primordial Kalpa’s Illumination.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Universally Plants and Transforms Life.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Supreme and Wondrous Countenance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Brahma-Qi’s Universal Generation.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Circulates and Delivers the World.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Supreme Generation and Life-Preservation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Great Compassion and Longevity.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Perfect Quiescence and Realized Emptiness.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Strictly Examines and Records.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Eradicates Transgressions and Exiles.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Majestic Authority and Self-Mastery.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Ascends and Dredges the Upper Realms.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Manifests Spirit to Aid Beings.\nWith wholehearted faith, pay homage to the Heavenly Worthy, the Boat and Ferry Across the Sea of Suffering.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Protects, Recommends, and Oversees Life.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Perfect Illumination and Victorious Wisdom.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Selfless and Pervasive Wisdom.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Karmic Compassion and Kindness.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Majestically Subdues the Hordes of Demons.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Mounts the True and Directs the Course.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Radiant Transformation and Mystic Congealment.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Reveals the Myriad Forms.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Returns to the Source and Reverts to Quiescence.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Peace, Bliss, and Eternal Preservation.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Preserves Life and Protects Destiny.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Records and Safeguards the Years.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Pacifies and Stabilizes All Sentient Beings.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Restores Spirit and Nurtures Simplicity.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Dissolves Karmic Obstructions.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Preserves Life and Receives Rebirth.\nWith wholehearted faith, pay homage to the Heavenly Worthy Whose Longevity Extends Through Kalpas.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Flows and Expounds the Myriad Models.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Transports and Delivers the Eight Powers.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Brahma-Splendor and Golden Perfection.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Primordial Qi’s Fundamental Principle.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Great August and Luxuriant.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Repays Karmic Causes and Conditions.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Harmonizes the Myriad Spirits.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Mystically Unites the Eight Darknesses.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Supreme Perfected and Supreme Wisdom.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Jade Void Through Kalpas.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Diffuses Nectar and Distributes Qi.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Upholds the Myriad Practices.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Primordial Brahma Who Delivers Beings.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Profound Darkness and Quiescent Congealment.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Heavenly Perfection and Supreme Wonder.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Rides Vows to Rebirth.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Wisdom’s Awakening and Primordial Penetration.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Supreme Ultimate’s Wondrous Completion.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Summons the Perfected and Assembles the Sages.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Settled Radiance and Brilliant Illumination.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Illuminating Observation and Great Deliverance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the True Essentials’ Skillful Guidance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Dragon’s Script and Myriad Transformations.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Majestic Radiance and Mystic Response.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Observes Karmic Conditions and Manifests Splendor.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Jade Perfection and Brahma-Splendor.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Great Illumination and Seven Luminaries.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Mystic Simplicity and Descending Radiance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Radiant Virtue and Subtle Function.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Patrolls the Void and Soars on Steps.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Ten Flowers’ Supreme Vows.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Great Peace and Brahma-Deliverance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Void’s Illumination and Universal Oversight.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Spirit’s Perfection and Wondrous Function.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Circulates Salvation and Forgets Merit.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Jade Illumination and Mystic Awakening.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Brahma-Qi’s Vast Net.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Penetrates the Mysteries and Encompasses the Myriad Models.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Ten Sages’ Revolving Wheel.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Longevity and Protective Deliverance.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Universally Cultivates the Myriad Practices.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Extends Harmony and Upright Transformation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Vast Operation and Compassionate Kindness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Kind Salvation and Wise Completion.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Pervades the Void and Suspends Liberation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mystic Pivot and Profound Quiescence.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Empty Wisdom’s Vast Penetration.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Profound Void’s Assembly of Sages.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Establishes Virtue and Illuminates Harmony.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Constantly and Kindly Rescues Beings.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Wondrous Joy Without Equal.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Accords with Quiescence and Ascends the Mysteries.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Promotes and Magnifies Virtuous Transformation.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Reveres Immortals and Upholds Goodness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Reverence, Love, Compassion, and Forbearance.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Opens Salvation for the Four Kinds of Birth.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Vastly Proclaims and Broadly Disseminates.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Supreme Virtue’s Universal Renown.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Jade Flower’s Flowing Moisture.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Great Forgetfulness and Discerning Wisdom.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Illuminating Emptiness and Shining Quiescence.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Penetrating Wisdom and Upright Faith.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Clarity, Spirit, and the Tranquil Realm.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Responds to Karmic Conditions and Covers Karma.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the One Vehicle’s Contemplative Illumination.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Utmost True and Mystic Origin.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Profound Abyss’s Samadhi.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Six Perfections’ Great Penetration.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Primordial Kalpa’s Primordial Chaos.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Congealed Emptiness and Supreme Wonder.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Profound Root’s Vast Salvation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Great Compassion’s Distant Transformation.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Pities and Remembers the Sunken and Fallen.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Pities and Rescues Humans and Devas.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Transcends and Ascends the Vast Kalpas.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Surpasses the Three Clarities.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Great Net’s Profound Stillness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Utmost Wonder and Supreme Victory.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Void’s Ultimate Great Penetration.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mystic Teachings’ Empty Liberation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Wondrous Victory and Circulating Response.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Penetrates the Profound and Realizes the Ultimate.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Pervades and Transforms the Worlds.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Initiates the Origin and Responds to the Sages.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Supreme Goodness and Jade Flower.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Treasure Perfection and Constant Bliss.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Merit’s Completion and Illumination’s Cessation.\n\nThe Most High Lord Lao said: Such Heavenly Worthies, with all aspects perfected, surrounded by immeasurable retinues of attendants, abide in the boundless Brahma-qi worlds below, broadly expounding the Great Vehicle, unfolding the essential teachings of the Dao, delivering all sinful beings, causing them to depart from suffering and attain peace and bliss.\n\nAt that time, the Most High Lord Lao addressed the Lifeguarding Perfected and all the immortals below: \"If you are able to guide and transform all beings in the boundless worlds below, and extol the sacred names and images of the one hundred twenty Heavenly Worthies of the Brahma-qi boundless worlds, you can reduce the karmic retributions of sentient beings for their past transgressions—sins such as discarding scriptures and scorning sacred texts, gluttony from past vegetarian feasts, licentiousness and jealousy that sunders flesh and blood, misappropriating bamboo, wood, and various ritual implements of the Three Treasures, using false measures and scales to deceive others, selling goods for excessive profit, trading in ill omens and deceiving the worthy, cursing and slandering the noble and base as if they were beasts, slaughtering living beings and butchering creatures, disrespecting parents while cherishing one’s own wife and children. Such are the ten evil sins of the lower worlds, immeasurable and boundless, beyond reckoning. Now, if one wholeheartedly confesses and repents, these ten sins shall be eradicated, and the Ten Upright Deities and the Lower Primordial Unity will not record them. They will not be reported to the Heavenly Courts, and after death, one will not fall into the filthy hells of the boundless worlds below, forever spared the suffering of foul places. Reborn among humans, one shall enjoy immeasurable bliss.\n\nThereupon, the Lifeguarding Perfected and all the immortals bowed their heads in reverence and respectfully received the teachings.\n\nThe Most High Lord Lao said: \"All such Heavenly Worthies of the ten directions are the primordial responses of the Original Beginning to qi, pervading the ten directions of life and death, pacifying and protecting lands, teaching and guiding beings. According to karmic conditions, they scatter their reflections and divide their bodies, appearing in endless transformations. With the turning of kalpas, they are sometimes hidden, sometimes manifest, opening the path to deliverance and bestowing blessings upon the ten thousand heavens. If Daoist priests, nuns, and all men and women can arouse good intentions, whether for rulers, kings, parents, spouses, children, their own families, the seven ancestors and nine lineages, or all beings under heaven and upon earth, and according to their means—whether with gold, silver, pearls, jade, tiles, stones, bronze, iron, cinnabar, or painted and embroidered images—create their likenesses, dispersing them throughout the ten directions to fill all lands, bowing in worship, making offerings, establishing temples to deliver people, performing rituals, reciting scriptures, scattering flowers, lighting lamps, confessing sins, making vows, upholding precepts, and observing fasts, they shall enjoy peace in this life, ascend to heaven in past lives, and gain immeasurable, inconceivable blessings.\n\nIf a ruler faces calamities—such as solar or lunar eclipses, stars losing their courses, floods or droughts, plagues among the people, or wars breaking out on all sides—then within sacred temples and divine altars, or in palace halls and courtyards, they should arrange twelve thousand lamps in ten concentric circles of one thousand two hundred lamps each, opening eight gates to form a complete and radiant illumination within and without. Day and night, they should bow in repentance, scatter flowers, burn incense, and take refuge in the names of the one thousand one hundred sixty sacred images of the ten directions, chanting and reciting them. They should establish grand treasure feasts, release living beings, practice almsgiving, set up a hundred high seats, and lecture on the wondrous scriptures of the Three Caverns’ Great Vehicle. Thus, the land shall be at peace, and the world shall enjoy great tranquility.\n\nIf nobles, governors, or any of the people face various dangers, they too should diligently practice these rites. In this life, they shall flourish, their seven ancestors shall ascend to heaven, they shall escape hell, and the long night shall become bright. For generations without end, they shall enjoy effortless bliss.\n\nThe method of lighting lamps may also involve arranging one thousand two hundred lamps in the ten directions, or constructing a great treasure wheel with twelve thousand lamps above. They may be set up in any location—nobles using a thousand, commoners a hundred—all following this method. At night, the lamp-light should remain unbroken; by day, it may be extinguished. On the day of dispersal, they should hold grand feasts, perform rituals, chant praises, and proclaim their merits to the heavens, gaining immeasurable blessings beyond words.\"\n\nThereupon, the Perfected Ones of the ten directions and all their retinues bowed their heads together, praised the teaching, and withdrew.\n\n*Scripture of the Names and Images of Laozi’s Sacred Likenesses, Scroll Ten* ends here.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "老子像名经卷六(缺) 老子像名经卷七(缺) 老子像名经卷八(缺) 老子像名经 经名：老子像名经。 撰人不详，约出於唐代。 系敦煌本《老子十方像名经》之改编本。 原本十卷（缺第六至八卷）。 底本出处：《正统道藏》洞神部本文类。 老子像名经卷之一 尔时，高上老子与十方真人、十部威神、无量等众游历十方无极世界，宣扬教化。 见诸众生广造十方诸恶重罪，孤魂涂炭，受诸苦恼，出暗入明，一死一生，流曳十方地狱之中，或堕东方风雷地狱，或入南方炉炭地狱，或在西方金锤地狱，或处北方寒冰地狱，或落东北镬汤地狱，或坠东南铜柱地狱，或陷西南屠割地狱，或役西北火车地狱，或投上方火坑地狱，或沉下方粪秽地狱，受种种之罪，随业不同。 身首糜碎，分张异处，昼夜拷掠，无时暂停。 深愍众生，受如是苦。 今当说此十方天尊应化灵像一千一百六十名号，欲令十方无极世界一切众生敬礼称扬，悔过灭恶，生福长善。 汝等众真，各宜谛听。 於是高上老子告东方普济真人及诸仙众 东方九气无极世界九十天尊灵像名号，礼之者灭无量罪，得无量福。 至心信礼东方普慈护国天尊 至心信礼大忍无碍天尊",
      "translated_text": "**Laozi Iconographic Scripture of Divine Names**\n*Volume One*\n\nAt that time, the Most High Laozi, together with the Perfected Ones of the Ten Directions, the Mighty Spirits of the Ten Hosts, and boundless multitudes, traversed the infinite worlds of the Ten Directions, propagating the teachings and transforming beings.\n\nThey beheld how sentient beings had committed grave transgressions across the Ten Directions, their orphaned souls mired in suffering, enduring manifold torments. Emerging from darkness into light, they died and were reborn, drifting through the hells of the Ten Directions—some cast into the Wind-and-Thunder Hell of the East, others plunged into the Furnace-and-Coal Hell of the South, confined in the Metal-Hammer Hell of the West, or frozen in the Frigid-Ice Hell of the North. Some fell into the Scalding-Cauldron Hell of the Northeast, others into the Bronze-Pillar Hell of the Southeast; some were trapped in the Slaughter-and-Carving Hell of the Southwest, conscripted into the Fire-Cart Hell of the Northwest, hurled into the Fire-Pit Hell above, or submerged in the Filth-and-Excrement Hell below. They endured every manner of punishment, each according to their karma.\n\nTheir bodies were shattered, limbs scattered asunder, subjected to ceaseless torture day and night without respite. Profoundly moved by the suffering of beings, Laozi now proclaims these one thousand one hundred and sixty divine names of the Heavenly Worthies who manifest through transformation across the Ten Directions. By reverently invoking and extolling these names, may all beings in the infinite worlds of the Ten Directions repent their transgressions, eradicate evil, and cultivate blessings and virtue.\n\nAll you Perfected Ones, listen attentively.\n\nThen the Most High Laozi addressed the Universal Salvation Perfected One of the East and the assembled immortals, declaring the divine names of the ninety Heavenly Worthies of the Nine Qi Infinite World of the East. Those who venerate them shall eradicate boundless sins and attain immeasurable blessings.\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Universal Compassion and Nation-Protection of the East**\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Great Forbearance and Unobstructed Power**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 474,
      "start_sentence": 0,
      "end_sentence": 18,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.822829008102417,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\老子像名经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "至心信礼东华上相天尊 至心信礼青宫演化天尊 至心信礼仙灵妙宝天尊 至心信礼含和虚极天尊 至心信礼九天积善天尊 至心信礼皇上真老天尊 至心信礼元灵隐耀天尊 至心信礼金阙玉虚天尊 至心信礼疑心玄应天尊 至心信礼灵都大度天尊 至心信礼玄灵至德天尊 至心信礼高上太虚天尊 至心信礼圆通妙极天尊 至心信礼开明真相天尊 至心信礼宝胜元和天尊 至心信礼法藏圆极天尊 至心信礼玄明真定天尊 至心信礼众智成满天尊 至心信礼金华上相天尊 至心信礼真行明因天尊 至心信礼威光实际天尊 至心信礼开通信悟天尊 至心信礼慧解智明天尊 至心信礼紫虚上极天尊 至心信礼灵心普照天尊 至心信礼惠源广润天尊 至心信礼正觉垂训天尊 至心信礼真智照极天尊 至心信礼仙度妙宝天尊 至心信礼紫阳灵应天尊 至心信礼妙意无边天尊 至心信礼金光善慧天尊 至心信礼玄虚真行天尊 至心信礼慧空度脱天尊 至心信礼装严玄觉天尊 至心信礼灵感遍通天尊 至心信礼虚皇降照天尊 至心信礼妙极真源天尊 至心信礼玄应慧明天尊 至心信礼宝相真阳天尊 至心信礼凝神湛照天尊 至心信礼法云普润天尊 至心信礼虚明远览天尊 至心信礼法相圆满天尊 至心信礼妙意端严天尊 至心信礼本际玄微天尊 至心信礼冲真寂照天尊 至心信礼妙乐威光天尊 至心信礼普照幽明天尊 至心信礼法缘无尽天尊 至心信礼随机赴感天尊 至心信礼正智玄虚天尊 至心信礼慧目流光天尊 至心信礼琼华炳曜天尊 至心信礼浮香远览天尊 至心信礼飞云广覆天尊 至心信礼普度乐王天尊 至心信礼海空慧解天尊 至心信礼慈悲与乐天尊 至心信礼虚皇普济天尊 至心信礼法灯朗照天尊 至心信礼高上太虚天尊 至心信礼大悲拔苦天尊 至心信礼上德慈救天尊 至心信礼安住至乐天尊 至心信礼玄和妙宝天尊 至心信礼无为定慧天尊 至心信礼玄虚严浄天尊 至心信礼慈悲善济天尊 至心信礼慧量应物天尊 至心信礼装严素德天尊 至心信礼虚玄至极天尊 至心信礼妙本自然天尊 至心信礼慈悲救护天尊 至心信礼无名宝相天尊 至心信礼法云垂荫天尊 至心信礼慈恩广化天尊 至心信礼玄津普润天尊 至心信礼灵和善积天尊 至心信礼大慧凝湛天尊 至心信礼广开戒定天尊 至心信礼嘱累法宝天尊 至心信礼冥神洞照天尊 至心信礼崇仙开化天尊 至心信礼大弘正法天尊 至心信礼法桥普度天尊 至心信礼德藏包含天尊 至心信礼权变应见天尊 高上老子曰：如是天尊，众相圆满，左右侍卫，无量徒众，并处东方九气无极世界之中。 广演大乘，敷说道要，度脱一切有罪众生，令其离苦，咸使安乐。 尔时，高上老子告东方普济真人及诸仙众：汝等若能导化十方无极世界一切众生，若男若女，咸共归诚，至心敬礼，称扬赞叹东方九气无极世界九十天尊灵像名号，能灭众生生死报对，从来所犯傲忽三宝、不生肃敬之罪，违经破戒、去善就恶之罪，轻慢师主、不依盟约之罪，欺心负信、违理不偿之罪，恶口非法、 咒诅骂詈之罪，醉酒酗斗、凌忽公私之罪，潜行谋恶、阴贼害人之罪，憎亲爱疏、嗔内喜外之罪，谗毁善人、牵入邪径之罪，损善长恶、面从背违之罪。 如是东方十恶之罪，无量无边，不可记忆。 今能一心发露忏悔，愿除此十罪者，则不为东方十直之神、天帝使者录其罪目，上奏天曹，命过之后，不堕东方无极世界风雷地狱之中，生死身神，当免雷霆霹雳之难，后生人中，快乐无极。",
      "translated_text": "With sincere faith, bow and invoke:\n**Heavenly Worthy of the Eastern Flower’s Supreme Minister**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Azure Palace’s Transformative Teaching**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Wondrous Treasure of Immortals**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Embracing Harmony and the Void’s Utmost**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Nine Heavens’ Accumulated Goodness**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the August True Elder**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Hidden Radiance of Primordial Spirit**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Golden Portal and Jade Void**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Mysterious Response to Doubtful Hearts**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Numinous Capital’s Great Deliverance**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Mysterious Spirit’s Utmost Virtue**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Supreme Great Void**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of All-Pervading Wondrous Utmost**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Revealing the True Form**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Treasure Victor’s Primordial Harmony**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Dharma Treasury’s Perfect Utmost**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Mysterious Illumination and True Stillness**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Fulfilled Assembly of Wisdom**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Golden Flower’s Supreme Minister**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of True Conduct and Luminous Causes**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Majestic Light and Ultimate Reality**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Opening Trust and Awakening**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Wisdom’s Understanding and Illuminated Insight**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Purple Void’s Supreme Utmost**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Numinous Heart’s Universal Illumination**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Benevolent Source’s Vast Moistening**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Upright Awakening’s Descending Teachings**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of True Wisdom’s Illuminating Utmost**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Wondrous Treasure of Immortal Deliverance**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Purple Yang’s Numinous Response**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Boundless Wondrous Intent**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Golden Light and Good Wisdom**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Mysterious Void and True Conduct**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Wisdom’s Emptiness and Liberation**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Adorned Mysterious Awakening**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Universal Response and Pervasive Communication**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Void Sovereign’s Descending Illumination**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Wondrous Utmost’s True Source**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Mysterious Response and Illuminated Wisdom**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Treasure Form’s True Yang**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Concentrated Spirit’s Profound Illumination**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Dharma Cloud’s Universal Moistening**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Void’s Illumination and Far-Reaching Gaze**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Dharma Form’s Perfect Completion**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Solemn Wondrous Intent**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Primordial Boundary’s Mysterious Subtlety**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Tranquil Illumination of Profound Truth**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Wondrous Joy and Majestic Light**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Universal Illumination of the Hidden and Manifest**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Inexhaustible Dharma Conditions**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Responding to Conditions and Answering Calls**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Upright Wisdom and Mysterious Void**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Wisdom’s Eyes and Flowing Light**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Jade Flower’s Resplendent Radiance**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Floating Fragrance’s Far-Reaching Gaze**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Flying Clouds’ Vast Covering**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Universal Deliverance and Joyful Sovereignty**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Ocean’s Emptiness and Wisdom’s Understanding**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Compassion and Bestowing Joy**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Void Sovereign’s Universal Salvation**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Dharma Lamp’s Bright Illumination**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Supreme Great Void**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Great Compassion and Deliverance from Suffering**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Supreme Virtue and Compassionate Rescue**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Abiding in Utmost Joy**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Mysterious Harmony and Wondrous Treasure**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Non-Action’s Stillness and Wisdom**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Mysterious Void’s Solemn Purity**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Compassionate Goodness and Universal Salvation**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Wisdom’s Measure Responding to Beings**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Adorned Plain Virtue**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Void’s Utmost Mystery**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Wondrous Source’s Naturalness**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Compassionate Rescue and Protection**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Nameless Treasure Form**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Dharma Cloud’s Descending Shade**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Compassionate Grace’s Vast Transformation**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Mysterious Nectar’s Universal Moistening**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Numinous Harmony and Good Accumulation**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Great Wisdom’s Concentrated Profundity**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Broadly Opening Precepts and Samādhi**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Entrusted Dharma Treasure**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Hidden Spirit’s Penetrating Illumination**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Revered Immortals’ Transformative Teaching**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Great Propagation of the True Dharma**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of the Dharma Bridge’s Universal Deliverance**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Virtue’s Treasury Encompassing All**\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Skillful Means and Manifest Responses**\n\nThe Most High Laozi declared: Such are the Heavenly Worthies, their forms perfectly complete, attended on left and right by boundless retinues, all dwelling within the Nine Qi Infinite World of the East. They broadly expound the Great Vehicle, disseminate the essential teachings of the Dao, and deliver all sinful beings, causing them to depart from suffering and attain peace and joy.\n\nThen the Most High Laozi addressed the Universal Salvation Perfected One of the East and the assembled immortals: If you can guide and transform all beings in the infinite worlds of the Ten Directions—whether male or female—so that they all return to sincerity, reverently bow, invoke, and extol the divine names of the ninety Heavenly Worthies of the Nine Qi Infinite World of the East, they shall eradicate the karmic retributions of life and death for all beings. The sins of arrogance and neglect toward the Three Treasures, failing to cultivate reverence; violating scriptures and breaking precepts, forsaking good and embracing evil; disrespecting masters and teachers, disregarding covenants; deceitful betrayal, defying reason and refusing repayment; malicious speech, cursing and reviling; drunkenness and brawling, disdaining public and private duties; secret plotting of evil, covertly harming others; hating kin and loving strangers, harboring inner resentment and delighting in external affairs; slandering the virtuous, leading them into deviant paths; harming the good and fostering evil, feigning compliance while betraying in secret—such are the Ten Evils of the East, boundless and immeasurable, beyond reckoning.\n\nIf one now wholeheartedly confesses and repents, wishing to eliminate these ten sins, they shall not be recorded by the Ten Upright Deities of the East or the messengers of the Heavenly Emperor, nor reported to the celestial courts. After the expiration of their fate, they shall not fall into the wind-and-thunder hells of the East’s Infinite World. Their embodied spirits in life and death shall be spared the calamities of thunder and lightning. In future rebirths among humans, they shall enjoy boundless happiness.",
      "overlap_context": "aozi addressed the Universal Salvation Perfected One of the East and the assembled immortals, declaring the divine names of the ninety Heavenly Worthies of the Nine Qi Infinite World of the East. Those who venerate them shall eradicate boundless sins and attain immeasurable blessings.\n\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Universal Compassion and Nation-Protection of the East**\nWith sincere faith, bow and invoke:\n**Heavenly Worthy of Great Forbearance and Unobstructed Power**",
      "start_char": 474,
      "end_char": 2000,
      "start_sentence": 19,
      "end_sentence": 111,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.97248315811157,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\老子像名经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "於是普济真人及诸仙众一心顶礼，敬奉教言。 老子像名经卷之一竟 老子像名经卷之二 尔时，高上老子告南方普度真人及诸仙众：南方三气无极世界有三十天尊灵像名号，礼之者灭无量罪，得无量福。 至心信礼南方威德大慈天尊 至心信礼炎光灵耀天尊 至心信礼南极朱陵天尊 至心信礼南上严浄天尊 至心信礼无相长生天尊 至心信礼丹灵定慧天尊 至心信礼丹元光妙天尊 至心信礼朱明法本天尊 至心信礼慧命凝常天尊 至心信礼威光度脱天尊 至心信礼法身出世天尊 至心信礼无碍自在天尊 至心信礼巧说法相天尊 至心信礼增益慧解天尊 至心信礼善权化物天尊 至心信礼至寂澄明天尊 至心信礼智德无等天尊 至心信礼太微应号天尊 至心信礼玄通定相天尊 至心信礼洞鉴幽明天尊 至心信礼梵明弘教天尊 至心信礼安乐胜报天尊 至心信礼升玄至极天尊 至心信礼妙光宝胜天尊 至心信礼中和大慧天尊 至心信礼一乘虚极天尊 至心信礼玄宗诞应天尊 至心信礼无量威化天尊 至心信礼玄晖妙觉天尊 至心信礼冥神洞晏天尊 高上老子曰：如是天尊，众相圆满，左右侍卫，无量徒众，并处南方三气无极世界之中。 广演大乘，敷说道要，度脱一切有罪众生，令其离苦，咸使安乐。 尔时，高上老子告南方普度真人及诸仙众：汝等若能导化南方无极世界一切众生，若男若女，咸共归诚，至心信礼，称扬赞叹南方三气无极世界三十天尊灵像名号，能灭众生生死报对，从来所犯诽谤真经、谓为邪说之罪，忘师传授、不遵教诲之罪，占候图谶、妄说吉凶之罪， 詃诱良善、压为奴婢之罪，放情纵欲、浪行非法之罪，剥脱行人、取其衣服之罪，偷窃三宝常住法具之罪，发掘冢墓、劫剥死人之罪，秘惜经书、不肯传授之罪，妬人富有、愿令衰耗之罪。 如是南方十恶无量无边之罪，不可记忆。 今能一心发露忏悔，除此十罪，不为南方十直之神太一使者录其罪目，上奏天曹，命过之后，不堕南方无极世界炉炭地狱之中，生死身神，长免灼烂苦痛之忧，后生人中，快乐无极。 於是普度真人及诸仙众一心顶礼，信奉教言。 老子像名经卷之二竟 老子像名经卷之三 尔时，高上老子告西方慈悲真人及诸仙众：西方七气无极世界有七十天尊灵像名号，礼之者灭无量罪，得无量福。 至心信礼西方金映护魂天尊 至心信礼西灵慧照天尊",
      "translated_text": "Then the Universal Salvation Perfected One and all the assembled immortals bowed their heads in single-minded reverence, respectfully receiving the teachings.\n\n*End of Scroll One of the Laozi Icon and Named Sutra*\n*Scroll Two of the Laozi Icon and Named Sutra*\n\nAt that time, the Most High Laozi addressed the Universal Salvation Perfected One of the South and all the assembled immortals: \"In the Infinite World of the Three Qi of the South, there are thirty sacred names and images of Heavenly Worthies. Those who pay homage to them shall eradicate boundless sins and attain boundless blessings.\n\nWith wholehearted faith, pay homage to the Heavenly Worthy of Majestic Virtue and Great Compassion of the South.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Radiant Flame and Numinous Brilliance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Vermilion Numinosity of the Southern Culmen.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Solemn Purity of the Southern Heights.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Formless Longevity.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Cinnabar Numinosity and Settled Wisdom.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Cinnabar Origin and Radiant Wonder.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Vermilion Brilliance and Dharma Origin.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Wisdom Life and Congealed Constancy.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Majestic Brilliance and Liberation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Dharmakāya Manifesting in the World.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Unobstructed Self-Mastery.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Skillful Dharma Exposition.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Augmenting Wisdom and Understanding.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Skillful Means and Transformation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Utmost Quiescence and Limpid Clarity.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Wisdom and Virtue without Equal.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Great Subtlety Responding to Names.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Mysterious Penetration and Settled Appearance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Penetrating Insight into Darkness and Light.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Brahmā’s Brilliance and Vast Teaching.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Blissful and Supreme Retribution.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Ascending the Mysterious to the Utmost.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Wondrous Brilliance and Treasure Victory.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Central Harmony and Great Wisdom.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the One Vehicle and the Empty Ultimate.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mysterious Origin Manifesting Responses.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Boundless Majestic Transformation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Mysterious Splendor and Wondrous Awakening.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Obscure Spirits and Penetrating Serenity.\"\n\nThe Most High Laozi said: \"These Heavenly Worthies, with their retinues of attendants and boundless assemblies, all dwell within the Infinite World of the Three Qi of the South. They broadly expound the Great Vehicle, disseminating the essential teachings of the Dao, liberating all sentient beings from sin, delivering them from suffering, and universally bestowing peace and happiness.\"\n\nAt that time, the Most High Laozi addressed the Universal Salvation Perfected One of the South and all the assembled immortals: \"If you can guide and transform all sentient beings in the Infinite World of the South—whether male or female—so that they all return to sincerity, wholeheartedly pay homage, and praise the sacred names and images of the thirty Heavenly Worthies of the Infinite World of the Three Qi of the South, they shall eradicate the karmic retributions of life and death for all beings. They shall eliminate the sins of having slandered the true scriptures as heterodox teachings, forgotten the transmission of their teachers and disobeyed their instructions, divined omens and falsely predicted fortune and misfortune, deceived and coerced the good into servitude, indulged in licentious desires and wantonly violated the law, stripped and robbed practitioners of their clothing, stolen the permanent implements of the Three Treasures, desecrated tombs and plundered the dead, hoarded scriptures and refused to transmit them, and envied others’ wealth, wishing for their decline and loss.\n\nSuch are the Ten Evils of the South, boundless and immeasurable, beyond reckoning. If one now wholeheartedly confesses and repents, wishing to eliminate these ten sins, they shall not be recorded by the Ten Upright Deities of the South or the messengers of the Great One. Their sins shall not be reported to the celestial courts. After the expiration of their fate, they shall not fall into the furnace-and-charcoal hells of the Infinite World of the South. Their embodied spirits in life and death shall be spared the suffering of scorching and burning. In future rebirths among humans, they shall enjoy boundless happiness.\"\n\nThen the Universal Salvation Perfected One and all the assembled immortals bowed their heads in single-minded reverence, faithfully receiving the teachings.\n\n*End of Scroll Two of the Laozi Icon and Named Sutra*\n*Scroll Three of the Laozi Icon and Named Sutra*\n\nAt that time, the Most High Laozi addressed the Compassionate Perfected One of the West and all the assembled immortals: \"In the Infinite World of the Seven Qi of the West, there are seventy sacred names and images of Heavenly Worthies. Those who pay homage to them shall eradicate boundless sins and attain boundless blessings.\n\nWith wholehearted faith, pay homage to the Heavenly Worthy of Golden Radiance Protecting the Soul of the West.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Numinous Wisdom Illuminating the West.\"",
      "overlap_context": "rtedly confesses and repents, wishing to eliminate these ten sins, they shall not be recorded by the Ten Upright Deities of the East or the messengers of the Heavenly Emperor, nor reported to the celestial courts. After the expiration of their fate, they shall not fall into the wind-and-thunder hells of the East’s Infinite World. Their embodied spirits in life and death shall be spared the calamities of thunder and lightning. In future rebirths among humans, they shall enjoy boundless happiness.",
      "start_char": 2000,
      "end_char": 2993,
      "start_sentence": 112,
      "end_sentence": 156,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.8167986869812,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\老子像名经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "至心信礼西极显真天尊 至心信礼玄真九老天尊 至心信礼上圣十华天尊 至心信礼四虚普照天尊 至心信礼真元七映天尊 至心信礼三素皓灵天尊 至心信礼金门演教天尊 至心信礼太华上极天尊 至心信礼空洞虚皇天尊 至心信礼玄光度世天尊 至心信礼九空太素天尊 至心信礼灵耀八景天尊 至心信礼七觉照疑天尊 至心信礼三素光明天尊 至心信礼大洞景华天尊 至心信礼无量真如天尊 至心信礼元和宝胜天尊 至心信礼定光命录天尊 至心信礼皓华素德天尊 至心信礼妙宝净光天尊 至心信礼真明虚极天尊 至心信礼冲和灵应天尊 至心信礼太玄高上天尊 至心信礼虚极妙灵天尊 至心信礼宝花元梵天尊 至心信礼浄藏秘景天尊 至心信礼宗师度脱天尊 至心信礼玄素总德天尊 至心信礼太华应运天尊 至心信礼高皇玉帝天尊 至心信礼胜光宝曜天尊 至心信礼高圣玄景天尊 至心信礼中皇真际天尊 至心信礼元洞玉晨天尊 至心信礼高上太一天尊 至心信礼至极明宫天尊 至心信礼玉虚挺相天尊 至心信礼总真元洞天尊 至心信礼流光应见天尊 至心信礼玄览照幽天尊 至心信礼通远深渊天尊 至心信礼金容显相天尊 至心信礼垂形散景天尊 至心信礼流光四朗天尊 至心信礼洞元积感天尊 至心信礼高玄总众天尊 至心信礼浩明梵宝天尊 至心信礼金光七素天尊 至心信礼玉皇真极天尊 至心信礼玄上太微天尊 至心信礼洞慧虚容天尊 至心信礼明机流览天尊 至心信礼寻真大洞天尊 至心信礼凝神会圣天尊 至心信礼真玄太一天尊 至心信礼浄满保光天尊 至心信礼大乘景德天尊 至心信礼耀明高上天尊 至心信礼普息缘照天尊 至心信礼玉润流辉天尊 至心信礼上华元一天尊 至心信礼六空洞府天尊 至心信礼七变元和天尊 至心信礼五劫开化天尊 至心信礼含光秘景天尊 至心信礼清都证极天尊 至心信礼灵化洞空天尊 至心信礼冲虚入妙天尊 高上老子曰：如是天尊，众相圆满，左右侍卫，无量徒众，并处西方七气无极世界之中，广演大乘，敷说道要，度脱一切有罪众生，令其离苦，咸使安乐。 尔时，高上老子告西方慈悲真人及诸仙众：汝等若能导化西方无极世界一切众生，若男若女，咸共归诚，至心信礼，称扬赞叹西方七气无极世界七十天尊灵像名号，能灭众生生死报对，从来所犯言无信实、诡诳之罪，嫉妬他人胜己之罪，恃其势力、欺波贫贱之罪，口善心恶、面喜意嗔之罪，巧文曲判、枉抑直道之罪，呵叱尊卑、轻侮老病之罪，传人恶语、以成嗔恨之罪，五形不隐、露於三光之罪，无故嫌恨、妄相责罚之罪，言语调弄、初喜后怒之罪。 如是西方十恶之罪，无量无边，不可记忆。 今能一心发露忏悔，除此十罪，不为西方十直之神录其罪目，上奏天曹，命过之后，不堕西方无极世界金锤铁杖地狱之中，生死身神，长免鞭挞之患，后生人中，快乐无极。 於是慈悲真人及诸仙众一心顶礼，信奉教言。 老子像名经卷之三竟 老子像名经卷之四 尔时，高上老子告北方救苦真人及诸仙众：北方五气无极世界有五十天尊灵像名号，礼之者灭无量罪，得无量福。 至心信礼北方延寿保命天尊 至心信礼北极明耀天尊 至心信礼玄虚太极天尊 至心信礼紫度虚皇天尊 至心信礼金真应福天尊 至心信礼琼华十善天尊 至心信礼玄微隐耀天尊",
      "translated_text": "With wholehearted faith, pay homage to the Heavenly Worthy of the Western Limit Revealing the True.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Nine Elders of the Mysterious True.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Ten Flowers of the Supreme Sages.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Four Voids Illuminating All.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Seven Radiances of the True Origin.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Three Pristine Luminous Spirits.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Golden Gate Expounding the Teachings.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Supreme Limit of the Great Flower.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Empty Cavern and the Void Sovereign.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mysterious Radiance Delivering the World.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Nine Voids and the Great Pristine.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Eight Effulgences of the Numinous Radiance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Seven Awakenings Illuminating Doubts.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Three Pristine Illuminations.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Great Cavern’s Effulgent Flower.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Immeasurable True Suchness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Primordial Harmony and Precious Victory.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Fixed Radiance and Life Register.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Pristine Flower and Pure Virtue.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Wondrous Treasure and Pure Radiance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the True Illumination and Void Limit.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Penetrating Harmony and Numinous Response.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Supreme Mystery on High.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Void Limit and Wondrous Numinous.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Precious Flower and Primordial Brahma.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Pure Treasury and Secret Effulgence.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Patriarch Delivering from Suffering.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mysterious Pristine and Total Virtue.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Great Flower Responding to the Kalpa.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the August Jade Emperor on High.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Victorious Radiance and Precious Brilliance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Supreme Sage and Mysterious Effulgence.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Central August and True Boundary.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Primordial Cavern and Jade Dawn.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Supreme Unity on High.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Ultimate Limit and Luminous Palace.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Jade Void and Towering Form.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Total True and Primordial Cavern.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Flowing Radiance and Manifest Response.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mysterious Insight Illuminating the Obscure.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Far-Reaching and Profound Abyss.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Golden Countenance Revealing Form.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Descending Form and Scattered Effulgence.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Flowing Radiance Illuminating the Four Quarters.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Cavern Origin and Accumulated Responses.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Supreme Mystery Governing All.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Vast Brilliance and Brahma Treasure.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Golden Radiance and Seven Pristine.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Jade Emperor and True Limit.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Supreme Mystery on High.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Cavern Wisdom and Empty Form.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Luminous Mechanism and Flowing Insight.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Seeking the True in the Great Cavern.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Concentrating the Spirit and Meeting the Sages.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the True Mystery and Supreme Unity.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Pure Fullness and Preserving Radiance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Great Vehicle and Effulgent Virtue.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Radiant Brilliance on High.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Universal Cessation and Illuminating Karma.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Jade Moisture and Flowing Splendor.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Supreme Flower and Primordial Unity.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Six Voids and Cavern Palace.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Seven Transformations and Primordial Harmony.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Five Kalpas Initiating Transformation.\n\nThe Most High Laozi said: \"Such are the Heavenly Worthies, their forms perfectly complete, attended on left and right by boundless retinues, all dwelling within the Infinite World of the Seven Qi of the West. They broadly expound the Great Vehicle, disseminate the essential teachings of the Dao, and deliver all sentient beings burdened with sins, enabling them to depart from suffering and attain perfect peace and happiness.\"\n\nAt that time, the Most High Laozi addressed the Compassionate Perfected One of the West and all the assembled immortals: \"If you are able to guide and transform all sentient beings in the Infinite World of the West—whether male or female—so that they all return to sincerity, with wholehearted faith pay homage, recite, and praise the seventy sacred names and images of the Heavenly Worthies in the Infinite World of the Seven Qi of the West, you will eradicate the karmic retributions of life and death for all beings. This includes the sins of uttering false and deceitful words, lacking integrity; the sins of envy toward those superior to oneself; the sins of relying on power to bully the poor and lowly; the sins of feigning kindness while harboring malice, smiling outwardly while seething within; the sins of crafting deceptive arguments and perverting justice to suppress the upright; the sins of berating superiors and inferiors, disdaining the elderly and infirm; the sins of spreading slander to provoke hatred; the sins of exposing the five bodily forms to the Three Luminaries; the sins of groundless resentment and unjust punishment; and the sins of manipulative speech, initially pleasing but later inciting anger.\n\nSuch are the ten evil sins of the West, immeasurable and boundless, beyond reckoning. Now, if one wholeheartedly confesses and repents of these ten sins, they will be absolved, and the Ten Upright Deities of the West will not record their transgressions to report to the celestial courts. After the end of their lifespan, they will not fall into the hells of the Infinite World of the West, where golden hammers and iron rods await, nor will their spirits in life and death suffer the torment of flogging. In their next rebirth among humans, they will enjoy boundless happiness.\"\n\nThereupon, the Compassionate Perfected One and all the assembled immortals bowed their heads in single-minded reverence, faithfully receiving the teachings.\n\n*End of Scroll Three of the Laozi Icon and Named Sutra*\n*Scroll Four of the Laozi Icon and Named Sutra*\n\nAt that time, the Most High Laozi addressed the Perfected One of Salvation from Suffering of the North and all the assembled immortals: \"In the Infinite World of the Five Qi of the North, there are fifty sacred names and images of Heavenly Worthies. Those who pay homage to them shall eradicate boundless sins and attain boundless blessings.\n\nWith wholehearted faith, pay homage to the Heavenly Worthy of the North Prolonging Life and Preserving Destiny.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Northern Limit and Bright Radiance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mysterious Void and Supreme Ultimate.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Purple Salvation and Void Sovereign.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Golden True and Responding Blessings.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Ten Virtues of the Jade Flower.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mysterious Subtlety and Hidden Radiance.\"",
      "overlap_context": "d the Compassionate Perfected One of the West and all the assembled immortals: \"In the Infinite World of the Seven Qi of the West, there are seventy sacred names and images of Heavenly Worthies. Those who pay homage to them shall eradicate boundless sins and attain boundless blessings.\n\nWith wholehearted faith, pay homage to the Heavenly Worthy of Golden Radiance Protecting the Soul of the West.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Numinous Wisdom Illuminating the West.\"",
      "start_char": 2993,
      "end_char": 4435,
      "start_sentence": 157,
      "end_sentence": 239,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.88013482093811,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\老子像名经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "至心敬礼高真太宝天尊 至心信礼玄和大度天尊 至心信礼紫晨降福天尊 至心信礼上慧弘慈天尊 至心信礼宝寂幽源天尊 至心信礼灵光正德天尊 至心信礼还淳示像天尊 至心信礼安神寂照天尊 至心信礼紫极元君天尊 至心信礼玄真妙宝天尊 至心信礼四达无碍天尊 至心信礼六辨虚疑天尊 至心信礼明晖景秀天尊 至心信礼圆光炳耀天尊 至心信礼金映流真天尊 至心信礼玄上紫虚天尊 至心信礼太微极妙天尊 至心信礼灵光空相天尊 至心信礼无上景皇天尊 至心信礼虚明洞慧天尊 至心信礼宝玄流化天尊 至心信礼澄神保劫天尊 至心信礼妙智湛常天尊 至心信礼五灵玄德天尊 至心信礼严宾阐化天尊 至心信礼六度凝神天尊 至心信礼高元上相天尊 至心信礼普光弘济天尊 至心信礼凝玄高上天尊 至心信礼耀景元和天尊 至心信礼弘明宝相天尊 至心信礼空慧无滞天尊 至心信礼重光万善天尊 至心信礼含和远畅天尊 至心信礼游虚常乐天尊 至心信礼端严上德天尊 至心信礼明霞通知天尊 至心信礼乘真导化天尊 至心信礼灵化机感天尊 至心信礼通玄释滞天尊 至心信礼德意无上天尊 至心信礼虚皇演圣天尊 至心信礼大哀广济天尊 高上老子曰：如是天尊，众相圆满，左右侍卫，无量徒众，并处北方五气无极世界之中，广演大乘，敷说道要，度脱一切有罪众生，令其离苦，咸使安乐。 尔时，高上老子告北方救苦真人及诸仙众：汝等若能导化北方无极世界一切众生，若男若女，咸共归诚，至心信礼，称扬赞叹北方五气无极世界五十天尊灵像名号，能灭众生生死报对，从来所犯杀他含血众生之罪，不肯施散、营建功德之罪，啖食众生以为滋味之罪，鹰犬游猎、杀害众生之罪，放火烧山、伤杀蠢蠕之罪，见人疾病、不生怜愍、救治之罪，要路掘坑、坠人手足之罪，恣施棘刺、断人要路行踪之罪，偷人妻子、詃诱奴婢之罪，盗人尊像、锺磬、杂物之罪。 如是北方十恶之罪，无量无边，不可记忆。 今能一心发露忏悔，除此十罪，不为北方十直之神、北斗司杀之鬼录其罪目，上奏天曹，命过之后，不坠北方无极世界寒冰瞑泠地狱之中，长免露卧冰床苦痛之患，后生人中，快乐无极。 於是救苦真人及诸仙众一心顶礼，敬奉教言。 老子像名经卷之四竟 老子像名经卷之五 尔时，高上老子告东北慈敬真人及诸仙众：东北梵气无极世界有一百二十天尊灵像名号，礼之者灭无量罪，得无量福。 至心信礼东北方慈忍救苦天尊 至心信礼元灵高圣天尊 至心信礼中皇太一天尊 至心信礼梵气弥纶天尊 至心信礼黄庭太保天尊 至心信礼三素洞神天尊 至心信礼大哀慜苦天尊 至心信礼霞光朗耀天尊 至心信礼中玄正一天尊 至心信礼黄房洞晏天尊 至心信礼高上虚无天尊 至心信礼玄微太宝天尊 至心信礼黄庭九老天尊 至心信礼灵威拔苦天尊 至心信礼八明浩气天尊 至心信礼玄真上景天尊 至心信礼太皇胜妙天尊 至心信礼灵光保命天尊 至心信礼流光通导天尊 至心信礼飞华庆善天尊 至心信礼回光至极天尊 至心信礼应像飞光天尊 至心信礼无心妙体天尊 至心信礼六度真容天尊 至心信礼兴隆道相天尊 至心信礼高真观妙天尊 至心信礼流变延真天尊 至心信礼妙乐难胜天尊 至心信礼元灵一气天尊 至心信礼玄灵八素天尊 至心信礼真老福庆天尊",
      "translated_text": "With wholehearted reverence, pay homage to the Heavenly Worthy of the Supreme Treasure of the Lofty Perfected.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mysterious Harmony and Great Salvation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Purple Dawn and Descending Blessings.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Supreme Wisdom and Vast Compassion.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Treasured Stillness and Hidden Source.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Numinous Light and Upright Virtue.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Returning to Simplicity and Revealing Images.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Pacifying Spirits and Serene Illumination.\nWith wholehearted faith, pay homage to the Heavenly Lord of the Purple Ultimate.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mysterious True and Wondrous Treasure.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Unobstructed Fourfold Reach.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Sixfold Discernment and Void Doubt.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Bright Radiance and Scenic Splendor.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Perfect Light and Blazing Brilliance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Golden Reflection and Flowing Perfection.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mysterious Supreme and Purple Void.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Supreme Subtlety of the Grand Tenuity.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Numinous Light and Empty Likeness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Supreme Scenic Sovereign.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Void Brightness and Penetrating Wisdom.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Treasured Mystery and Flowing Transformation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Clarifying Spirits and Preserving Kalpas.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Wondrous Wisdom and Profound Constancy.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Fivefold Numinous Virtue.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Solemn Guest and Manifesting Transformation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Six Perfections and Congealing Spirit.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Lofty Primordial and Supreme Likeness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Universal Light and Vast Salvation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Congealed Mystery and Lofty Supreme.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Radiant Scenery and Primordial Harmony.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Vast Clarity and Treasured Likeness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Empty Wisdom and Unhindered.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Double Light and Myriad Virtues.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Embracing Harmony and Far-Reaching.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Wandering Void and Constant Joy.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Upright Solemnity and Supreme Virtue.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Bright Rosy Clouds and Penetrating Knowledge.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Riding Perfection and Guiding Transformation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Numinous Transformation and Responsive Mechanism.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Penetrating Mystery and Dispelling Obstruction.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Virtue and Intent Supreme.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Void Sovereign and Proclaiming the Sage.\n\nThe Lofty Supreme Lord Lao said: \"Such Heavenly Worthies, with their retinues complete and surrounded by boundless attendants, all dwell within the Five Qi Boundless Realm of the North. They broadly expound the Great Vehicle, disseminate the essential teachings of the Dao, and deliver all sentient beings burdened with sins, enabling them to depart from suffering and attain peace and happiness.\"\n\nAt that time, the Lofty Supreme Lord Lao addressed the Perfected of Salvation from Suffering of the North and the assembly of immortals: \"If you can guide and transform all sentient beings in the Boundless Realm of the North—whether male or female—so that they all return to sincerity, with wholehearted faith pay homage, extol, and praise the names of the fifty sacred images of the Heavenly Worthies in the Five Qi Boundless Realm of the North, you shall eradicate the karmic retributions of sentient beings in the cycle of birth and death. This includes the sins of killing living beings with blood, the sins of refusing to bestow alms and establish meritorious deeds, the sins of consuming living beings for sustenance, the sins of hunting with hawks and hounds to kill living beings, the sins of setting fires to mountains and harming crawling creatures, the sins of seeing the sick and not generating compassion or offering treatment, the sins of digging pits on thoroughfares to break people’s limbs, the sins of recklessly placing thorny brambles to obstruct travelers’ paths, the sins of stealing others’ spouses and deceitfully luring away their servants, and the sins of stealing sacred images, bells, chimes, and other objects.\n\nSuch are the ten evil sins of the North, boundless and immeasurable, beyond reckoning. Now, if one wholeheartedly confesses and repents, eliminating these ten sins, the Ten Upright Deities of the North and the death-recording spirits of the Northern Dipper will not inscribe their offenses. These sins will not be reported to the celestial courts, and after the end of their lives, they shall not fall into the freezing, dark, and icy hells of the Boundless Realm of the North, forever spared the suffering of lying exposed on beds of ice. In their next rebirth among humans, they shall enjoy boundless happiness.\"\n\nThereupon, the Perfected of Salvation from Suffering and the assembly of immortals wholeheartedly prostrated in reverence and respectfully received the teachings.\n\n*Scripture of the Names and Images of Lord Lao, Scroll Four concludes.*\n\n*Scripture of the Names and Images of Lord Lao, Scroll Five*\n\nAt that time, the Lofty Supreme Lord Lao addressed the Perfected of Compassionate Reverence of the Northeast and the assembly of immortals: \"In the Boundless Realm of the Brahman Qi of the Northeast, there are one hundred and twenty sacred names and images of Heavenly Worthies. Those who pay homage to them shall eradicate boundless sins and attain boundless blessings.\"\n\nWith wholehearted faith, pay homage to the Heavenly Worthy of Compassionate Forbearance and Salvation from Suffering of the Northeast.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Primordial Numinous and Lofty Sage.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Central August Supreme One.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Brahman Qi and All-Encompassing.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Yellow Court and Grand Protector.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Three Pristine and Grotto Spirits.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Great Compassion and Pity for Suffering.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Rosy Clouds and Bright Radiance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Central Mystery and Upright Oneness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Yellow Chamber and Serene Grotto.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Lofty Supreme and Void Nothingness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mysterious Subtlety and Supreme Treasure.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Nine Elders of the Yellow Court.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Numinous Might and Deliverance from Suffering.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Eightfold Clarity and Vast Qi.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mysterious True and Supreme Scenery.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Supreme August and Wondrous Victory.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Numinous Light and Preserving Life.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Flowing Light and Penetrating Guidance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Flying Flowers and Celebrating Virtue.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Returning Light and Ultimate Reach.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Responsive Image and Flying Light.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Unintentional and Wondrous Body.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Six Perfections and True Countenance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Prospering the Dao and Manifesting Likeness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Lofty Perfected and Contemplating the Wondrous.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Flowing Transformation and Extending Perfection.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Wondrous Joy and Unsurpassable.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Primordial Numinous and Single Qi.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mysterious Numinous and Eightfold Pristine.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the True Elder and Blessed Celebration.",
      "overlap_context": "d faith, pay homage to the Heavenly Worthy of the Mysterious Void and Supreme Ultimate.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Purple Salvation and Void Sovereign.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Golden True and Responding Blessings.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Ten Virtues of the Jade Flower.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mysterious Subtlety and Hidden Radiance.\"",
      "start_char": 4435,
      "end_char": 5880,
      "start_sentence": 240,
      "end_sentence": 321,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.35843634605408,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\老子像名经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "至心信礼青真妙觉天尊 至心信礼碧霞始老天尊 至心信礼玄和净德天尊 至心信礼太空至德天尊 至心信礼明真四极天尊 至心信礼自然虚极天尊 至心信礼积庆元和天尊 至心信礼广运慈善天尊 至心信礼万福普护天尊 至心信礼慈善广济天尊 至心信礼明贤慈爱天尊 至心信礼开度福道天尊 至心信礼垂光慈瘾天尊 至心信礼八达常善天尊 至心信礼六合通明天尊 至心信礼开度忧恼天尊 至心信礼乘姻太帝天尊 至心信礼七元八会天尊 至心信礼太丹三素天尊 至心信礼元和宝相天尊 至心信礼太真高上天尊 至心信礼琼光灵耀天尊 至心信礼通玄真定天尊 至心信礼中和善寂天尊 至心信礼崇爱延光天尊 至心信礼流光太明天尊 至心信礼灵真流梵天尊 至心信礼太微至极天尊 至心信礼景德太丹天尊 至心信礼通光普照天尊 至心信礼玄机妙应天尊 至心信礼金真流映天尊 至心信礼玉光耀彩天尊 至心信礼挥光振景天尊 至心信礼灭魔度脱天尊 至心信礼秘景长生天尊 至心信礼通真解滞天尊 至心信礼垂光景耀天尊 至心信礼太华定相天尊 至心信礼内景含和天尊 至心信礼通灵回化天尊 至心信礼飞步九空天尊 至心信礼步纪七元天尊 至心信礼豁落长耀天尊 至心信礼七耀延灵天尊 至心信礼混成开化天尊 至心信礼通明四洞天尊 至心信礼启明无极天尊 至心信礼空玄明梵天尊 至心信礼太空玄隐天尊 至心信礼灵都集庆天尊 至心信礼景云普被天尊 至心信礼洞浮七耀天尊 至心信礼灵光四照天尊 至心信礼保命护魂天尊 至心信礼洞空圆极天尊 至心信礼演法开化天尊 至心信礼丹华皓映天尊 至心信礼流辉帝一天尊 至心信礼洞启幽玄天尊 至心信礼玄普灵耀天尊 至心信礼神光远鉴天尊 至心信礼紫庭会圣天尊 至心信礼匠导众真天尊 至心信礼广运玄化天尊 至心信礼灵源普润天尊 至心信礼崇真演教天尊 至心信礼安化太玄天尊 至心信礼耀景栖真天尊 至心信礼宝耀洞明天尊 至心信礼八景回晨天尊 至心信礼圆景耀霞天尊 至心信礼明光晨极天尊 至心信礼灵源广洽天尊 至心信礼金光玄耀天尊 至心信礼弘真度物天尊 至心信礼总御众真天尊 至心信礼法明灵鉴天尊 至心信礼太霄耀景天尊 至心信礼结朗重明天尊 至心信礼启真玄素天尊 至心信礼混化变生天尊 至心信礼思玄会寂天尊 至心信礼灵光皓映天尊 至心信礼华光流耀天尊 至心信礼慧源玄畅天尊． 至心信礼凝虚善寂天尊 至心信礼法光宝相天尊 至心信礼玄光普照天尊 高上老子曰：此天尊等，并各身作真金妙色，项负飞艳圆光，头戴通天芙蓉七宝华冠，建云光流耀华簪，体佩五云杂色锦被，着丹霞流彩长裙，足蹑双珠景光方履，各与天龙猛卒、地仙道士、控制魔王、护法真人、持地金刚、天丁力士、侍香玉童、散花玉女、五色师子、负弩神王各为十部羽从。 於是天尊乘虚步烟，同游东北无极世界之中，广度一切有罪众生，令入乐道，各使得安。 尔时，高上老子又告东北慈敬真人及诸仙众曰：卿等若能劝化东北无极世界一切善男子、善女人，悉令送心投款，至心礼敬，称扬东北梵气一百二十天尊灵像名号者，则灭除存亡二代从来所犯张罗布网、捕猎鸟兽之罪，次灭好放鹰鹯、游捕众生之罪，次灭岁节告终、屠杀六畜以供荐飨之罪，次灭横引清人以令入狱之罪，次灭夺人恩爱、分隔骨肉之罪，次灭刺印奴婢面额以作痕迹之罪，次灭败人婚媾、不使和合之罪，次灭身体不净、触突三宝之罪，次灭笑人瘨痴风痫疾病之罪，次灭批毛觅疵、求人过恶之罪。",
      "translated_text": "With wholehearted faith, pay homage to the Heavenly Worthy of Azure Perfection and Wondrous Awareness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Azure Radiance and Primordial Elder.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Mystic Harmony and Pure Virtue.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Great Vacuity and Supreme Power.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Luminous Perfection and Four Poles.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Spontaneous Emptiness and Ultimate Void.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Accumulated Blessings and Primordial Harmony.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Vast Extension and Compassionate Kindness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Myriad Blessings and Universal Protection.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Compassionate Kindness and Vast Salvation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Luminous Worthies and Compassionate Love.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Opening Salvation and Blessed Dao.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Radiant Light and Compassionate Grace.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Eightfold Reach and Constant Kindness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Six Harmonies and Pervasive Illumination.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Opening Salvation for Sorrow and Affliction.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Mounting Smoke and Supreme Emperor.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Seven Origins and Eight Assemblies.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Great Cinnabar and Threefold Pristine.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Primordial Harmony and Jeweled Likeness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Supreme Perfection and Lofty Truth.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Jade Radiance and Numinous Brilliance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Pervasive Mystery and True Stillness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Central Harmony and Kind Stillness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Reverent Love and Extending Light.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Flowing Light and Great Illumination.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Numinous Perfection and Flowing Brahma.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Supreme Polarity and Ultimate Greatness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Luminous Power and Great Cinnabar.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Pervasive Light and Universal Illumination.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Mystic Mechanism and Wondrous Response.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Golden Perfection and Flowing Reflection.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Jade Radiance and Shimmering Splendor.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Waving Light and Vibrant Brilliance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Demolishing Demons and Liberating Beings.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Secret Brilliance and Longevity.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Pervasive Truth and Dispelling Obstructions.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Radiant Light and Shimmering Brilliance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Great Florescence and Stabilizing Likeness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Inner Brilliance and Embracing Harmony.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Pervasive Numinosity and Transforming Return.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Flying Steps through Ninefold Vacuity.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Pacing the Seven Origins.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Vast and Boundless Radiance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Sevenfold Brilliance and Extending Numinosity.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Primal Chaos and Transforming Creation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Pervasive Illumination and Four Caverns.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Enlightening the Boundless.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Empty Mystery and Illuminating Brahma.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Great Vacuity and Mystic Concealment.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Numinous Capital and Gathering Blessings.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Auspicious Clouds and Universal Coverage.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Cavernous Floating and Sevenfold Brilliance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Numinous Light and Fourfold Illumination.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Preserving Life and Protecting Souls.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Cavernous Vacuity and Perfect Ultimate.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Expounding the Dharma and Transforming Creation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Cinnabar Florescence and Resplendent Reflection.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Flowing Brilliance and Supreme Unity.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Cavernous Enlightenment and Mystic Profundity.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Mystic Pervasiveness and Numinous Brilliance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Divine Light and Distant Insight.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Purple Court and Assembling Sages.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Crafting and Guiding Multitudes of Perfected.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Vast Extension and Mystic Transformation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Numinous Source and Universal Moistening.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Revering Truth and Expounding the Teachings.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Pacifying Transformation and Supreme Mystery.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Radiant Brilliance and Perching in Truth.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Jeweled Brilliance and Cavernous Illumination.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Eightfold Brilliance and Returning Dawn.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Perfect Brilliance and Shimmering Radiance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Illuminating Light and Ultimate Dawn.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Numinous Source and Vast Harmony.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Golden Light and Mystic Brilliance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Vast Truth and Liberating Beings.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Governing Multitudes of Perfected.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Dharma Illumination and Numinous Insight.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Supreme Empyrean and Radiant Brilliance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Binding Clarity and Double Illumination.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Enlightening Truth and Mystic Pristine.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Primal Chaos and Transforming Birth.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Contemplating Mystery and Assembling Stillness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Numinous Light and Resplendent Reflection.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Flourishing Light and Flowing Brilliance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Wisdom Source and Mystic Flourishing.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Congealing Emptiness and Kind Stillness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Dharma Light and Jeweled Likeness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Mystic Light and Universal Illumination.\n\nThe Most High Lord Lao said: These Heavenly Worthies, each with bodies of wondrous golden hue, bear upon their necks flying, resplendent aureoles. Upon their heads they wear seven-jeweled lotus crowns that reach to heaven, adorned with cloud-bright, flowing, radiant hairpins. Their bodies are draped in five-cloud, variegated brocade robes, and they don garments of cinnabar radiance and flowing, shimmering skirts. Their feet are shod in square shoes of double-pearl brilliance. Each is accompanied by ten divisions of attendants: fierce soldiers of heaven and dragon, earthly immortals and Daoist adepts, demon-subduing kings, dharma-protecting perfected, vajra-holding earth spirits, celestial marshals and warriors, jade lads bearing incense, jade maidens scattering flowers, five-colored lions, and divine archers.\n\nThereupon, the Heavenly Worthies mounted the void and traversed the mist, journeying together through the boundless world of the northeast, broadly delivering all sin-laden beings, guiding them into the joyous Dao, and granting each peace.\n\nAt that time, the Most High Lord Lao addressed the Reverent and Compassionate Perfected of the Northeast and the assembled immortals: \"If you can exhort and transform all good men and good women of the boundless world in the northeast, urging them to wholeheartedly submit and sincerely pay homage, extolling the sacred names of the one hundred twenty Heavenly Worthies of the northeastern Brahma qi, then they shall eradicate the sins of setting snares and nets, hunting birds and beasts, committed by both the living and the dead across generations. Next, they shall eradicate the sins of delighting in falconry and hawking, roaming to capture living beings. Next, they shall eradicate the sins of slaughtering the six livestock at year’s end to offer sacrifices. Next, they shall eradicate the sins of falsely accusing the innocent and causing them to be imprisoned. Next, they shall eradicate the sins of severing affection, separating flesh and blood. Next, they shall eradicate the sins of branding the faces of slaves and servants. Next, they shall eradicate the sins of ruining marriages and preventing harmony. Next, they shall eradicate the sins of bodily impurity and defiling the Three Treasures. Next, they shall eradicate the sins of mocking those afflicted with leprosy, madness, wind, or epilepsy. Next, they shall eradicate the sins of nitpicking and seeking out others’ faults.\"",
      "overlap_context": "pay homage to the Heavenly Worthy of the Flowing Transformation and Extending Perfection.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Wondrous Joy and Unsurpassable.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Primordial Numinous and Single Qi.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mysterious Numinous and Eightfold Pristine.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the True Elder and Blessed Celebration.",
      "start_char": 5880,
      "end_char": 7437,
      "start_sentence": 322,
      "end_sentence": 413,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 48.50835180282593,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\老子像名经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "有此东北十恶之罪，无量无边，不可测忆之罪，今能弹指忏悔，灭除此十罪者，则不为东北十直之神太一使者录其罪目，上奏天曹，则寿终命过之后，不堕东北梵气无极世界镬汤地狱之中，长免镬汤烂煮之患，五体完全，六腑清浄，紫房游纵，丹阙闲居。 若更生人中，作人师范，开化众生，令入法相。 此则上赖东北梵气一百二十天尊之恩，下副此等男女送心投款归命之诚。 於是慈敬真人及诸仙众弹指顶礼，敬奉教言。 老子像名经卷之五竟 老子像名经卷之九 尔时，高上老子告上方延寿真人及诸仙众：上方梵气无极世界三百二十天尊灵像名号，礼之者灭无量罪，得无量福。 至心信礼上方慈悲救苦天尊 至心信礼严浄法忍天尊",
      "translated_text": "Those who bear these ten heinous sins of the northeast—sins boundless and immeasurable, beyond reckoning—if now they repent with but a snap of the fingers, eradicating these ten transgressions, shall not have their offenses recorded by the Ten Upright Deities of the Northeast, the envoys of the Great One, nor reported to the Celestial Courts. Thus, when their lifespan ends and their fate is spent, they shall not fall into the Cauldron-Boiling Hell of the Boundless World of Brahmanic *qi* in the northeast, forever spared the torment of scalding and boiling. Their five limbs shall remain whole, their six viscera pure, roaming freely in the Purple Chambers and dwelling leisurely in the Crimson Palaces.\n\nShould they be reborn among humans, they shall become teachers and models for others, enlightening sentient beings and guiding them into the Dharma’s true form. This is owing above to the grace of the One Hundred and Twenty Heavenly Worthies of the Brahmanic *qi* in the northeast, and below to the sincerity of these men and women who wholeheartedly submit and take refuge.\n\nThereupon, the Venerable Master of Compassion and Reverence, along with the assembly of immortals, snapped their fingers in homage and bowed in reverence to receive the teachings.\n\n*Laozi’s Scripture of Iconic Names, Scroll the Fifth, concludes.*\n*Laozi’s Scripture of Iconic Names, Scroll the Ninth.*\n\nAt that time, the Most High Laozi addressed the Longevity Perfected of the Upper Realm and the assembly of immortals: The divine names and images of the Three Hundred and Twenty Heavenly Worthies of the Boundless World of Brahmanic *qi* in the Upper Realm—those who pay homage to them shall eradicate boundless sins and attain boundless blessings.\n\nWith utmost sincerity, pay homage to the Heavenly Worthy of Compassion, Salvation, and Suffering Relief.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Solemn Purity and Dharma Endurance.",
      "overlap_context": " the sins of severing affection, separating flesh and blood. Next, they shall eradicate the sins of branding the faces of slaves and servants. Next, they shall eradicate the sins of ruining marriages and preventing harmony. Next, they shall eradicate the sins of bodily impurity and defiling the Three Treasures. Next, they shall eradicate the sins of mocking those afflicted with leprosy, madness, wind, or epilepsy. Next, they shall eradicate the sins of nitpicking and seeking out others’ faults.\"",
      "start_char": 7437,
      "end_char": 7728,
      "start_sentence": 414,
      "end_sentence": 422,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.800622940063477,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\老子像名经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "至心信礼应变威力天尊 至心信礼无畏梵形天尊 至心信礼大智慧海天尊 至心信礼无量法藏天尊 至心信礼大悲万善天尊 至心信礼玄微自在天尊 至心信礼无边正觉天尊 至心信礼慈和妙宝天尊 至心信礼端严威力天尊 至心信礼光明上德天尊 至心信礼法桥大度天尊 至心信礼开显妙门天尊 至心信礼弘通保命天尊 至心信礼护魂慈救天尊 至心信礼因缘济度天尊 至心信礼流光法喜天尊 至心信礼玉真慈爱天尊 至心信礼威圣化凡天尊 至心信礼常安定慧天尊 至心信礼洞虚慈念天尊 至心信礼信慧匠成天尊 至心信礼增益胜智天尊 至心信礼功德严净天尊 至心信礼宝光慈救天尊 至心信礼混成长乐天尊 至心信礼普明净爱天尊 至心信礼乘光善寂天尊 至心信礼增上胜慧天尊 至心信礼相光自在天尊 至心信礼金真度命天尊 至心信礼善定玄通天尊 至心信礼垂慈普济天尊 至心信礼妙迹入微天尊 至心信礼幽寂通冥天尊 至心信礼洞畅高玄天尊 至心信礼长生万善天尊 至心信礼至虚静妙天尊 至心信礼真游高上天尊 至心信礼大洞通真天尊 至心信礼法流远洽天尊 至心信礼高德宝藏天尊 至心信礼慧成明智天尊 至心信礼善应无疑天尊 至心信礼凝常转命天尊 至心信礼普光劝善天尊 至心信礼玄德定愿天尊 至心信礼总真应见天尊 至心信礼妙成圆行天尊 至心信礼慈悲化度天尊 至心信礼龙德威力天尊 至心信礼应身万变天尊 至心信礼常施众善天尊 至心信礼威仪开度天尊 至心信礼真净善诚天尊 至心信礼洞灵梵度天尊 至心信礼正德保祚天尊 至心信礼幽寂守常天尊 至心信礼浄土开缘天尊 至心信礼善权流布天尊 至心信礼虚明大度天尊 至心信礼威德无畏天尊 至心信礼常安妙行天尊 至心信礼随应劝善天尊 至心信礼称缘机感天尊 至心信礼大藏妙音天尊 至心信礼宝明法胜天尊 至心信礼智寂严光天尊 至心信礼愿力无尽天尊 至心信礼普见难胜天尊 至心信礼慧观日华天尊 至心信礼宝藏月输天尊 至心信礼浄王满足天尊 至心信礼能忘辩慧天尊 至心信礼耀明观照天尊 至心信礼妙积仙梵天尊 至心信礼飞轮步纪天尊 至心信礼法筵化度天尊 至心信礼高玄太素天尊 至心信礼妙色金华天尊 至心信礼灵真太帝天尊 至心信礼胜光普救天尊 至心信礼上智观空天尊 至心信礼开缘定慧天尊 至心信礼金姿妙相天尊 至心信礼洞元光应天尊, 至心信礼万德齐伦天尊 至心信礼太空洞照天尊 至心信礼虚容善积天尊 至心信礼法王应感天尊 至心信礼法妙守真天尊 至心信礼空解智海天尊 至心信礼飞玄法藏天尊 至心信礼威变神通天尊 至心信礼开明旨要天尊 至心信礼善应空寂天尊 至心信礼无上最胜天尊 至心信礼玄宣至教天尊 至心信礼随方广济天尊 至心信礼真解降魔天尊 至心信礼证空信慧天尊 至心信礼法泽广沾天尊 至心信礼长存驾景天尊 至心信礼常善化物天尊 至心信礼空洞太无天尊 至心信礼匠成缘会天尊 至心信礼宝智长生天尊 至心信礼元妙本相天尊 至心信礼真性常一天尊 至心信礼玄极凝和天尊 至心信礼流耀辨照天尊 至心信礼真妙澄玄天尊 至心信礼智德慈善天尊 至心信礼法元随应天尊 至心信礼玄匠庄严天尊 至心信礼善导开蒙天尊 至心信礼弘仁上圣天尊 至心信礼无畏善诱天尊 至心信礼宣流妙化天尊 至心信礼运度四生天尊 至心信礼开引法教天尊",
      "translated_text": "With utmost sincerity, pay homage to the Heavenly Worthy of Responsive Transformation and Majestic Power.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Fearless Brahmanic Form.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Great Ocean of Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Boundless Dharma Treasury.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Great Compassion and Myriad Virtues.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Mysterious Subtlety and Self-Mastery.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Boundless Right Awakening.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Compassionate Harmony and Wondrous Treasure.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Solemn Dignity and Majestic Power.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Radiant Upper Virtue.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Dharma Bridge and Great Deliverance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Revealing the Wondrous Gate.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Vast Propagation and Life Preservation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Soul Protection and Merciful Salvation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Karmic Conditions and Salvific Deliverance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Flowing Light and Dharma Joy.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Jade Perfection and Compassionate Love.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Majestic Sagacity and Transforming the Mortal.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Eternal Peace and Settled Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Penetrating Emptiness and Compassionate Remembrance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Faithful Wisdom and Artisan Perfection.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Augmenting and Benefiting Supreme Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Merit, Virtue, and Solemn Purity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Treasure Light and Merciful Salvation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Primordial Perfection and Eternal Bliss.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Universal Illumination and Pure Love.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Riding the Light and Good Stillness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Supreme and Victorious Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Resplendent Light and Self-Mastery.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Golden Perfection and Life Deliverance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Good Concentration and Mysterious Penetration.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Bestowing Compassion and Universal Salvation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wondrous Traces and Subtle Entry.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Secluded Stillness and Penetrating Darkness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Penetrating Harmony and Lofty Mystery.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Longevity and Myriad Virtues.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Utmost Emptiness and Serene Wonder.\nWith utmost sincerity, pay homage to the Heavenly Worthy of True Wandering in the Upper Realms.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Great Penetration and Communion with the Real.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Dharma Flow and Far-Reaching Harmony.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Lofty Virtue and Treasure Treasury.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wisdom Perfected and Illuminating Insight.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Good Responses Without Doubt.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Congealing Eternity and Transforming Destiny.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Universal Light and Exhorting Virtue.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Mysterious Virtue and Settled Vows.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Gathering the Real and Responsive Manifestation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wondrous Perfection and Complete Practice.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Compassionate Transformation and Salvific Deliverance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Dragon Virtue and Majestic Power.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Myriad Transformations in Responsive Manifestation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Constantly Bestowing Myriad Virtues.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Dignified Conduct and Initiating Deliverance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of True Purity and Good Sincerity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Penetrating Spirit and Brahmanic Deliverance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Upright Virtue and Protecting the Mandate.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Secluded Stillness and Abiding Constancy.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Pure Land and Initiating Karmic Conditions.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Skillful Means and Flowing Propagation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Empty Clarity and Great Deliverance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Majestic Virtue and Fearlessness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Eternal Peace and Wondrous Practice.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Responsive Exhortation to Virtue.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Accordance with Conditions and Karmic Resonance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Great Treasury and Wondrous Sound.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Treasure Illumination and Dharma Victory.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wisdom Stillness and Solemn Light.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Vow Power Without Limit.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Universal Vision and Unsurpassed Victory.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wisdom Contemplation and Solar Splendor.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Treasure Treasury and Lunar Radiance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Pure Sovereignty and Perfect Fulfillment.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Forgetting Discriminative Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Radiant Illumination and Contemplative Insight.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wondrous Accumulation and Immortal Brahman.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Flying Wheels and Stepping the Records.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Dharma Assembly and Transformative Deliverance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Lofty Mystery and Primordial Simplicity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wondrous Countenance and Golden Splendor.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Numinous Perfection and the Supreme Thearch.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Victorious Light and Universal Salvation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Supreme Wisdom and Contemplating Emptiness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Initiating Karmic Conditions and Settled Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Golden Form and Wondrous Appearance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Penetrating the Origin and Responsive Light.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Myriad Virtues in Equal Measure.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Great Emptiness and Penetrating Illumination.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Empty Receptivity and Good Accumulation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Dharma King and Responsive Resonance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Dharma Wonder and Guarding the Real.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Empty Liberation and the Ocean of Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Flying Mystery and the Dharma Treasury.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Majestic Transformation and Spiritual Penetration.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Revealing the Essential Purport.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Good Responses and Empty Stillness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Unsurpassed and Most Victorious.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Mysterious Proclamation of the Supreme Teaching.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Universal Salvation in All Directions.\nWith utmost sincerity, pay homage to the Heavenly Worthy of True Liberation and Subduing Demons.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Realizing Emptiness and Faithful Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Dharma Beneficence and Vast Moistening.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Eternal Abiding and Riding the Light.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Constantly Transforming Beings with Goodness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Empty Penetration and the Great Void.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Artisan Perfection and Karmic Convergence.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Treasure Wisdom and Longevity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Primordial and Wondrous Original Form.\nWith utmost sincerity, pay homage to the Heavenly Worthy of True Nature and Eternal Unity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Mysterious Extremity and Congealed Harmony.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Flowing Radiance and Discerning Illumination.\nWith utmost sincerity, pay homage to the Heavenly Worthy of True Wonder and Clarified Mystery.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wisdom, Virtue, and Compassionate Goodness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Dharma Origin and Responsive Manifestation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Mysterious Artisan and Solemn Adornment.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Good Guidance and Initiating the Unenlightened.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Vast Benevolence and Supreme Sagacity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Fearless and Good Instruction.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Proclaiming and Flowing Wondrous Transformation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Conveying and Delivering the Four Kinds of Beings.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Initiating and Guiding the Dharma Teachings.",
      "overlap_context": "ongevity Perfected of the Upper Realm and the assembly of immortals: The divine names and images of the Three Hundred and Twenty Heavenly Worthies of the Boundless World of Brahmanic *qi* in the Upper Realm—those who pay homage to them shall eradicate boundless sins and attain boundless blessings.\n\nWith utmost sincerity, pay homage to the Heavenly Worthy of Compassion, Salvation, and Suffering Relief.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Solemn Purity and Dharma Endurance.",
      "start_char": 7728,
      "end_char": 9290,
      "start_sentence": 423,
      "end_sentence": 542,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.19807314872742,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\老子像名经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "至心信礼应世法王天尊 至心信礼宝德周遍天尊 至心信礼机感被缘天尊 至心信礼威云降福天尊 至心信礼善护无弃天尊 至心信礼慧量真极天尊 至心信礼仙游浄妙天尊 至心信礼开劫度人天尊 至心信礼通明满足天尊 至心信礼玉辉浄慧天尊 至心信礼宝意胜上天尊 至心信礼无极玄微天尊 至心信礼流光普寿天尊 至心信礼太玄高胜天尊 至心信礼上德太真天尊 至心信礼妙显光相天尊 至心信礼圣智飞玄天尊 至心信礼超登宝海天尊 至心信礼辰光上善天尊 至心信礼骞林启圣天尊 至心信礼神真广德天尊 至心信礼满相金容天尊 至心信礼玉华宝照天尊 至心信礼应真无滞天尊 至心信礼道慧幽微天尊 至心信礼神真无碍天尊 至心信礼玄应自然天尊 至心信礼妙觉大成天尊 至心信礼忘功至赜天尊 至心信礼善慧延生天尊 至心信礼上灵高妙天尊 至心信礼金阙照量天尊 至心信礼普通玄德天尊 至心信礼金刚湛寂天尊 至心信礼空相端严天尊 至心信礼虚心致福天尊 至心信礼浄慧德本天尊 至心信礼劫初制度天尊 至心信礼遍觉常净天尊 至心信礼道机权应天尊 至心信礼真宰妙乐天尊 至心信礼大洞玄虚天尊 至心信礼至德通慧天尊 至心信礼流布光化天尊 至心信礼威禁万灵天尊 至心信礼冥同圣智天尊 至心信礼寂寥玄默天尊 至心信礼明威御世天尊 至心信礼大成法利天尊 至心信礼虚皇妙宰天尊 至心信礼灵耀重光天尊 至心信礼智胜真要天尊 至心信礼含光洞晏天尊 至心信礼会镜流明天尊 至心信礼高玄隐德天尊 至心信礼冲虚匿景天尊 至心信礼弘救度生天尊 至心信礼大方种智天尊 至心信礼神通普被天尊 至心信礼冲微久视天尊 至心信礼超升有漏天尊 至心信礼积成玄智天尊 至心信礼骞林示相天尊 至心信礼增益化生天尊 至心信礼宝智虚容天尊 至心信礼洞晏消魔天尊 至心信礼玄虚宝荫天尊 至心信礼妙胜真浄天尊 至心信礼澄神炼影天尊 至心信礼灵庆长流天尊 至心信礼制魔威变天尊 至心信礼称物机绿天尊 至心信礼乘虚匠导天尊 至心信礼玉光浄德天尊 至心信礼威德难胜天尊 至心信礼幽元湛寂天尊 至心信礼玄上灵源天尊 至心信礼冲真会圣天尊 至心信礼爱忍宣教天尊 至心信礼开化导迷天尊 至心信礼黄庭太极天尊 至心信礼降魔救苦天尊 至心信礼寂照虚无天尊 至心信礼正真灵妙天尊 至心信礼默念幽玄天尊 至心信礼紫极太元天尊 至心信礼含光普愿天尊 至心信礼太虚众妙天尊 至心信礼冲微满月天尊 至心信礼浩劫元皇天尊 至心信礼救护法王天尊 至心信礼重玄凝寂天尊 至心信礼宝林妙行天尊 至心信礼自在应权天尊 至心信礼遍智真容天尊 至心信礼无名隐德天尊 至心信礼大慈惠爱天尊 至心信礼玄德智藏天尊 至心信礼慧觉妙元天尊 至心信礼慈颜湛相天尊 至心信礼应真太一天尊 至心信礼威光无碍天尊 至心信礼高圣通明天尊 至心信礼玄元诞妙天尊 至心信礼空慧凝常天尊 至心信礼方便善救天尊 至心信礼通真遍应天尊 至心信礼众善慈施天尊 至心信礼香光忍辱天尊 至心信礼凝神玄觉天尊 至心信礼大慈无我天尊 至心信礼运化微明天尊 至心信礼虚通品量天尊 至心信礼大惠众善天尊 至心信礼海量无涯天尊 至心信礼光妙高玄天尊 至心信礼常住虚假天尊 至心信礼玄微德本天尊 至心信礼耀灵度命天尊 至心信礼会善开宗天尊",
      "translated_text": "With utmost sincerity, pay homage to the Heavenly Worthy of Responding to the World as Dharma King.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Treasure Virtue Pervading All.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Responsive Manifestation and Karmic Connection.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Mighty Clouds Bestowing Blessings.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Good Protection Without Abandonment.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wisdom’s True Ultimate Measure.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Immortal Wandering in Pure Wonder.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Initiating Kalpas and Delivering Beings.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Pervasive Clarity and Perfect Fulfillment.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Jade Radiance and Pure Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Treasure Mind and Supreme Excellence.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Boundless and Mysterious Subtle.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Flowing Light and Universal Longevity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Great Mystery and Lofty Excellence.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Supreme Virtue and Great Perfection.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wondrous Manifestation and Luminous Form.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Sagely Wisdom and Soaring Mystery.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Transcending and Ascending the Treasure Sea.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Morning Light and Supreme Goodness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Kāñcana Grove and Manifesting Sagacity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Divine Perfection and Vast Virtue.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Golden Countenance and Perfect Form.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Jade Splendor and Treasure Illumination.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Responding to Perfection Without Obstruction.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Dao-Wisdom and the Profound Subtle.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Divine Perfection Without Hindrance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Mysterious Response and Spontaneous Nature.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wondrous Enlightenment and Great Completion.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Forgetting Merit and Utmost Profundity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Good Wisdom and Prolonging Life.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Supreme Numinous and Lofty Wonder.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Golden Portal and Illuminating Measure.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Universal Mystery and Virtue.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Vajra-like Stillness and Quiescence.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Empty Form and Upright Solemnity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Empty Mind and Bestowing Blessings.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Pure Wisdom and the Root of Virtue.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Instituting the Dharma at the Kalpa’s Beginning.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Universal Awakening and Constant Purity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Dao-Mechanism and Skillful Response.\nWith utmost sincerity, pay homage to the Heavenly Worthy of True Sovereign and Wondrous Joy.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Great Cavern and Mysterious Emptiness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Utmost Virtue and Pervasive Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Flowing and Spreading Luminous Transformation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Mighty Prohibitions and Myriad Spirits.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Obscure Union with Sagely Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Solitary Stillness and Profound Silence.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Illuminating Might and Governing the World.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Great Completion and Dharma Benefit.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Empty Sovereign and Wondrous Governance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Numinous Radiance and Renewed Brilliance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wisdom Triumphant and True Essence.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Containing Light and Pervasive Serenity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Mirror Assembly and Flowing Clarity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Lofty Mystery and Concealed Virtue.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Profound Emptiness and Hidden Splendor.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Vast Salvation and Delivering Beings.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Great Universal Wisdom-Seed.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Divine Penetration Universally Pervading.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Profound Subtlety and Enduring Vision.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Transcending the Defiled Realms.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Accumulating and Perfecting Mystic Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Kāñcana Grove and Manifesting Form.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Augmenting and Transforming Beings.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Treasure Wisdom and Empty Receptivity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Pervasive Serenity and Dispelling Demons.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Mysterious Emptiness and Treasure Shade.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wondrous Triumph and True Purity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Clarifying Spirit and Refining Shadow.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Numinous Felicity and Enduring Flow.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Subduing Demons and Mighty Transformations.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Weighing Things and Karmic Conditions.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Riding Emptiness and Skillful Guidance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Jade Light and Pure Virtue.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Mighty Virtue and Difficult to Overcome.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Profound Origin and Still Quiescence.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Mysterious Supreme and Numinous Source.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Profound Perfection and Sagely Assembly.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Loving Forbearance and Proclaiming the Teachings.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Opening Transformation and Guiding the Deluded.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Yellow Court and Supreme Ultimate.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Subduing Demons and Rescuing from Suffering.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Still Illumination and Emptiness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Upright Perfection and Numinous Wonder.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Silent Contemplation and the Profound Mystery.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Purple Ultimate and Supreme Origin.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Containing Light and Universal Vows.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Great Void and Myriad Wonders.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Profound Subtlety and the Full Moon.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Vast Kalpa and Primordial Sovereign.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Rescuing and Protecting the Dharma King.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Double Mystery and Congealed Stillness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Treasure Grove and Wondrous Conduct.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Self-Mastery and Skillful Response.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Universal Wisdom and True Form.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Nameless Concealed Virtue.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Great Compassion and Loving-Kindness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Mysterious Virtue and Wisdom Treasury.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wise Awakening and Wondrous Origin.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Compassionate Countenance and Still Form.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Responding to Perfection and the Great Unity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Mighty Radiance Without Hindrance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Lofty Sagacity and Pervasive Clarity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Mysterious Origin and Wondrous Birth.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Empty Wisdom and Congealed Constancy.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Skillful Means and Good Salvation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Pervasive Perfection and Universal Response.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Myriad Goodness and Compassionate Bestowal.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Fragrant Light and Forbearance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Congealing Spirit and Mysterious Awakening.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Great Compassion and Selflessness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Transforming and Subtle Illumination.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Empty Penetration and Graded Measure.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Great Kindness and Myriad Goodness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Oceanic Measure and Boundless Vastness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Luminous Wonder and Lofty Mystery.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Abiding in the Illusory and Empty.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Profound Subtle and the Root of Virtue.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Radiant Numinosity and Delivering Lives.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Assembling Goodness and Initiating the Lineage.",
      "overlap_context": "ncerity, pay homage to the Heavenly Worthy of Vast Benevolence and Supreme Sagacity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Fearless and Good Instruction.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Proclaiming and Flowing Wondrous Transformation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Conveying and Delivering the Four Kinds of Beings.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Initiating and Guiding the Dharma Teachings.",
      "start_char": 9290,
      "end_char": 10852,
      "start_sentence": 543,
      "end_sentence": 662,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.74377489089966,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\老子像名经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "至心信礼妙空真相天尊 至心信礼含弘品量天尊 至心信礼智藏微达天尊 至心信礼慧解空寂天尊 至心信礼普照幽玄天尊 至心信礼法本虚凝天尊 至心信礼天宝自在天尊 至心信礼智成大满天尊 至心信礼平等善应天尊 至心信礼开光济物天尊 至心信礼无量救苦天尊 至心信礼静处玄默天尊 至心信礼清微证悟天尊 至心信礼渊澄洞照天尊 至心信礼大明空解天尊 至心信礼高清妙慧天尊 至心信礼开缘普救天尊 至心信礼无量妙身天尊 至心信礼光相万变天尊 至心信礼紫虚玄圣天尊 至心信礼飞空智胜天尊 至心信礼玉晨耀景天尊 至心信礼梵宝太虚天尊 至心信礼元灵观惠天尊 至心信礼海空辩慧天尊 至心信礼尊胜妙光天尊 至心信礼善愿普音天尊 至心信礼希微威德天尊 至心信礼慈悲护度天尊 至心信礼端静梵行天尊 至心信礼善诫清浄天尊 至心信礼仙灵正行天尊 至心信礼慈施兴善天尊 至心信礼威力难思天尊 至心信礼随缘应物天尊 至心信礼常住慧能天尊 至心信礼真游本行天尊 至心信礼三乘洞极天尊 至心信礼积念通灵天尊 至心信礼虚皇妙宝天尊 至心信礼常乐独存天尊 至心信礼弥纶浩劫天尊 至心信礼香林挺相天尊 至心信礼无为普济天尊 至心信礼保命上生天尊 至心信礼智德无等天尊 至心信礼道慧高极天尊 至心信礼端严净行天尊 至心信礼平等善救天尊 至心信礼海藏无尽天尊 至心信礼演圣开元天尊 至心信礼延福宝神天尊 至心信礼兴隆妙化天尊 至心信礼众德普见天尊 至心信礼灵音演畅天尊 至心信礼华上度仙天尊 至心信礼金容感应天尊 至心信礼宝意常寂天尊 至心信礼观照虚无天尊 至心信礼六通证悟天尊 至心信礼照用圆明天尊 至心信礼玄真妙赜天尊 至心信礼分形通德天尊 至心信礼元灵端静天尊 至心信礼无量大度天尊 至心信礼安漠无为天尊 至心信礼至真幽寂天尊 至心信礼玄牝虚凝天尊 至心信礼宝顶大成天尊 至心信礼法积光明天尊 至心信礼宝华严浄天尊 至心信礼应见常容天尊 至心信礼普照缘感天尊 至心信礼常施威德天尊 至心信礼周行救苦天尊 至心信礼念度旱生天尊 至心信礼入定体常天尊 至心信礼妙音寂响天尊 高上老子曰：如是天尊，众相圆满，左右侍卫，无量徒众，普处上方无极世界之中，广演大乘，敷说道要，度脱一切有罪众生，令其离苦，咸使安乐。 尔时，高上老子告上方延寿真人及诸仙众：汝等若能导化上方无极世界一切众生，道俗男女，咸令归诚，至心敬礼，称扬赞叹上方梵气无极世界三百二十天尊灵像名号，能灭众生生死报对，从来所犯身受法戒、拜跪社灶以行祭祀之罪，信用师巫、邪杞鬼神之罪，好与俗人无法戒者同床坐卧之罪，说人长短、隐僻不便之罪，男女混杂、行诸不轨之罪，假造文状、悮陷善人之罪，骂詈天地、三光、风雨之罪， 凌忽官司、攻讦长短之罪，偷盗三宝常住法物之罪，侵取三宝福地、用为田宅之罪。 如是上方十恶之罪，无量无边，不可记忆。 今能一心发露忏悔，除此十罪，不为上方十直之神上元太一录其罪目，上奏天曹，命过之后，不坠上方无极世界火坑地狱之中，长免苦痛灼烂之忧，后生人中，快乐无极。 於是延寿真人及诸仙众一心顶礼，敬奉教言。 老子像名经卷之九竟 老子像名经卷之十 尔时，高上老子告下方保命真人及诸仙众：下方梵气无极世界一百二十天尊灵像名号，礼之者灭无量罪，得无量福。",
      "translated_text": "With utmost sincerity, pay homage to the Heavenly Worthy of the Wondrous Empty True Form.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Embracing Vastness and Graded Measure.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wisdom Treasury and Subtle Penetration.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wisdom’s Resolution and Empty Quiescence.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Universally Illumining the Profound and Mysterious.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Dharma’s Root and Empty Congealment.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Heavenly Treasure and Self-Mastery.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wisdom’s Perfection and Great Fullness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Impartiality and Kind Response.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Initiating Light and Delivering Beings.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Boundless Salvation from Suffering.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Abiding in Stillness and Profound Silence.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Pure Subtlety and Realized Awakening.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Profound Clarity and Penetrating Illumination.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Great Illumination and Empty Liberation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Lofty Purity and Wondrous Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Initiating Conditions and Universal Salvation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Boundless Wondrous Body.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Myriad Transformations of Light and Form.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Purple Emptiness and Mysterious Sagehood.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Soaring in Emptiness and Victorious Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Jade Dawn and Radiant Splendor.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Brahma Treasure and Great Emptiness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Primordial Spirit and Contemplative Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Oceanic Emptiness and Discerning Wisdom.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Supreme and Wondrous Light.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Kind Vows and Universal Sound.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Subtle Might and Majestic Virtue.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Compassion and Protective Deliverance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Upright Stillness and Brahma Conduct.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Kind Admonitions and Pure Serenity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Immortal Spirits and Orthodox Practice.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Compassionate Bestowal and Flourishing Goodness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Inconceivable Might and Power.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Responding to Conditions and Adapting to Beings.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Abiding in Wisdom and Capacity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of True Wandering and Fundamental Practice.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Three Vehicles and Penetrating the Ultimate.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Accumulated Contemplation and Communicating with Spirits.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Empty Sovereign and Wondrous Treasure.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Abiding in Joy and Solitary Existence.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Pervading the Vast Kalpas.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Fragrant Forest and Eminent Form.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Non-Action and Universal Salvation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Preserving Life and Ascending Birth.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Unmatched Wisdom and Virtue.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Dao’s Wisdom and Lofty Ultimate.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Upright Dignity and Pure Practice.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Impartiality and Kind Salvation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Oceanic Treasury and Inexhaustible.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Proclaiming the Sage and Initiating the Origin.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Extending Blessings and Treasure Spirits.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Flourishing and Wondrous Transformation.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Universally Manifesting Myriad Virtues.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Numinous Sound and Expounding Flourishingly.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Ascending Flowers and Delivering Immortals.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Golden Countenance and Responsive Manifestations.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Treasure Mind and Constant Quiescence.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Contemplating and Illumining Emptiness and Non-Being.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Six Penetrations and Realized Awakening.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Illumination and Function in Perfect Clarity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Mysterious True and Wondrous Profundity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Dividing Form and Communicating Virtue.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Primordial Spirit and Upright Stillness.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Boundless and Great Deliverance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Tranquil Vastness and Non-Action.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Utmost True and Profound Quiescence.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Mysterious Female and Empty Congealment.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Treasure Summit and Great Accomplishment.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Dharma Accumulation and Radiant Illumination.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Treasure Flower and Strict Purity.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Constant Manifestation and Eternal Countenance.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Universally Illumining Conditions and Responsive Feelings.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Constantly Bestowing Might and Virtue.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Circulating Salvation from Suffering.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Contemplating Deliverance and Drought-Born Beings.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Entering Samādhi and Abiding in Constancy.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Wondrous Sound and Quiescent Resonance.\n\nThe Most High Lord Lao said: Such Heavenly Worthies, with all forms perfectly complete, surrounded by boundless retinues of attendants, universally abide in the Immeasurable Realm of the Upper Regions, broadly expounding the Great Vehicle, disseminating the essential teachings of the Dao, delivering all sentient beings burdened with transgressions, enabling them to depart from suffering and universally attain peace and bliss.\n\nAt that time, the Most High Lord Lao addressed the Upper Region’s Longevity Perfected and all the immortals: If you can guide and transform all sentient beings in the Immeasurable Realm of the Upper Regions—both Daoists and laypersons, men and women—universally leading them to return to sincerity, with utmost reverence pay homage, recite, and extol the sacred names of the three hundred twenty Heavenly Worthies of the Immeasurable Brahma-Qi Realm of the Upper Regions. This can eradicate the karmic retributions of sentient beings, including transgressions from past lives involving bodily actions, precepts, and rituals—such as worshipping earth altars and kitchen stoves; sins of trusting in spirit-mediums and improperly venerating ghosts and spirits; sins of sharing beds with those lacking precepts; sins of gossiping and concealing improper acts; sins of promiscuity and unruly conduct; sins of forging documents to falsely implicate the virtuous; sins of cursing heaven and earth, the Three Luminaries, wind, and rain; sins of disrespecting officials and attacking others’ faults; sins of stealing the permanent property of the Three Treasures; and sins of encroaching upon the sacred lands of the Three Treasures for fields and dwellings.\n\nSuch are the ten grave sins of the Upper Regions, boundless and immeasurable, impossible to recount. Now, if one wholeheartedly confesses and repents, eliminating these ten sins, they will not be recorded by the Ten Upright Deities or the Supreme Unity of the Upper Primordial for submission to the Heavenly Courts. After the expiration of their lifespan, they will not fall into the fiery hells of the Immeasurable Realm of the Upper Regions, forever freed from the anguish of burning and torment. In subsequent rebirths among humans, they will enjoy boundless happiness.\n\nThereupon, the Longevity Perfected and all the immortals wholeheartedly prostrated in reverence, respectfully receiving the teachings.\n\n*Scripture of the Names and Images of Lord Lao, Scroll Nine Concludes*\n*Scripture of the Names and Images of Lord Lao, Scroll Ten*\n\nAt that time, the Most High Lord Lao addressed the Lower Region’s Life-Preserving Perfected and all the immortals: The sacred names of the one hundred twenty Heavenly Worthies of the Immeasurable Brahma-Qi Realm of the Lower Regions—paying homage to them eradicates boundless transgressions and accrues boundless blessings.",
      "overlap_context": "th utmost sincerity, pay homage to the Heavenly Worthy of Luminous Wonder and Lofty Mystery.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Abiding in the Illusory and Empty.\nWith utmost sincerity, pay homage to the Heavenly Worthy of the Profound Subtle and the Root of Virtue.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Radiant Numinosity and Delivering Lives.\nWith utmost sincerity, pay homage to the Heavenly Worthy of Assembling Goodness and Initiating the Lineage.",
      "start_char": 10852,
      "end_char": 12345,
      "start_sentence": 663,
      "end_sentence": 748,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 46.92137575149536,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\老子像名经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "至心信礼下方还魂起死天尊 至心信礼妙宝上真天尊 至心信礼开明祖劫天尊 至心信礼普植化生天尊 至心信礼上极妙容天尊 至心信礼梵气普生天尊 至心信礼周回度世天尊 至心信礼上生保命天尊 至心信礼大慈延寿天尊 至心信礼圆寂证空天尊 至心信礼严校主录天尊 至心信礼削除罪谪天尊 至心信礼威权自在天尊 至心信礼超浚上界天尊 至心信礼垂神济物天尊 至心信礼舟航苦海天尊 至心信礼保举监生天尊 至心信礼圆明智胜天尊 至心信礼无我慧通天尊 至心信礼缘慈亲善天尊 至心信礼威制群魔天尊 至心信礼乘真御运天尊 至心信礼景化凝玄天尊 至心信礼示见万像天尊 至心信礼还源归寂天尊 至心信礼安乐保常天尊 至心信礼全生护命天尊 至心信礼主录保年天尊 至心信礼安镇含识天尊 至心信礼回灵养素天尊 至心信礼开度宿障天尊 至心信礼保命受生天尊 至心信礼寿穷劫量天尊 至心信礼流演万范天尊 至心信礼运度八威天尊 至心信礼梵景金真天尊 至心信礼一气元纲天尊 至心信礼太皇郁秀天尊 至心信礼报愿生因天尊 至心信礼混合万灵天尊 至心信礼玄会八冥天尊 至心信礼高真上智天尊 至心信礼浩劫玉虚天尊 至心信礼流津布气天尊 至心信礼总持众行天尊 至心信礼元梵度人天尊 至心信礼洞幽凝寂天尊 至心信礼天真太妙天尊 至心信礼乘愿往生天尊 至心信礼慧觉通元天尊 至心信礼太极妙成天尊 至心信礼招真会圣天尊 至心信礼定光景耀天尊 至心信礼观明大度天尊 至心信礼真要匠导天尊 至心信礼龙章万变天尊 至心信礼威光玄感天尊 至心信礼观缘品景天尊 至心信礼玉真梵景天尊 至心信礼太明七耀天尊 至心信礼玄素莅光天尊 至心信礼景德冲用天尊 至心信礼巡虚飞步天尊 至心信礼十华上愿天尊 至心信礼大安梵度天尊 至心信礼虚明总监天尊 至心信礼神真妙用天尊 至心信礼周济忘功天尊 至心信礼玉明玄觉天尊 至心信礼梵气弥罗天尊 至心信礼通玄万范天尊 至心信礼十圣回轮天尊 至心信礼长生护度天尊 至心信礼普修万行天尊 至心信礼延和正化天尊 至心信礼广运慈善天尊 至心信礼善济智成天尊 至心信礼遍空悬解天尊 至心信礼玄枢冥寂天尊 至心信礼空慧弘通天尊 至心信礼洞虚会圣天尊 至心信礼建德明和天尊 至心信礼常善救物天尊 至心信礼妙乐无等天尊 至心信礼契寂升玄天尊 至心信礼兴弘德化天尊 至心信礼崇仙尚善天尊 至心信礼敬爱慈忍天尊 至心信礼开济四生天尊 至心信礼弘宣广瘾天尊 至心信礼上德普闻天尊 至心信礼玉华流润天尊 至心信礼大忘辩智天尊 至心信礼明空照寂天尊 至心信礼通慧正信天尊 至心信礼澄神静域天尊 至心信礼赴感被缘天尊 至心信礼一乘观照天尊 至心信礼至真玄本天尊 至心信礼洞渊三昧天尊 至心信礼六度大通天尊 至心信礼混元祖劫天尊 至心信礼凝虚太妙天尊 至心信礼冥根弘济天尊 至心信礼大悲化远天尊 至心信礼愍念沦坠天尊 至心信礼哀救人天天尊 至心信礼超登浩劫天尊 至心信礼迥出三清天尊 至心信礼大罗凝湛天尊 至心信礼至妙尊胜天尊 至心信礼虚极大通天尊 至心信礼玄宗空解天尊 至心信礼妙胜周应天尊 至心信礼通幽证极天尊 至心信礼遍化世界天尊 至心信礼开元应圣天尊 至心信礼上善玉华天尊 至心信礼宝真常乐天尊 至心信礼功成息照天尊",
      "translated_text": "With wholehearted faith, pay homage to the Heavenly Worthy Who Restores Souls and Raises the Dead.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Wondrous Treasure, Supreme Perfected.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Primordial Kalpa’s Illumination.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Universally Plants and Transforms Life.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Supreme and Wondrous Countenance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Brahma-Qi’s Universal Generation.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Circulates and Delivers the World.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Supreme Generation and Life-Preservation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Great Compassion and Longevity.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Perfect Quiescence and Realized Emptiness.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Strictly Examines and Records.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Eradicates Transgressions and Exiles.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Majestic Authority and Self-Mastery.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Ascends and Dredges the Upper Realms.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Manifests Spirit to Aid Beings.\nWith wholehearted faith, pay homage to the Heavenly Worthy, the Boat and Ferry Across the Sea of Suffering.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Protects, Recommends, and Oversees Life.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Perfect Illumination and Victorious Wisdom.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Selfless and Pervasive Wisdom.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Karmic Compassion and Kindness.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Majestically Subdues the Hordes of Demons.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Mounts the True and Directs the Course.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Radiant Transformation and Mystic Congealment.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Reveals the Myriad Forms.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Returns to the Source and Reverts to Quiescence.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Peace, Bliss, and Eternal Preservation.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Preserves Life and Protects Destiny.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Records and Safeguards the Years.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Pacifies and Stabilizes All Sentient Beings.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Restores Spirit and Nurtures Simplicity.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Dissolves Karmic Obstructions.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Preserves Life and Receives Rebirth.\nWith wholehearted faith, pay homage to the Heavenly Worthy Whose Longevity Extends Through Kalpas.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Flows and Expounds the Myriad Models.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Transports and Delivers the Eight Powers.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Brahma-Splendor and Golden Perfection.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Primordial Qi’s Fundamental Principle.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Great August and Luxuriant.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Repays Karmic Causes and Conditions.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Harmonizes the Myriad Spirits.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Mystically Unites the Eight Darknesses.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Supreme Perfected and Supreme Wisdom.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Jade Void Through Kalpas.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Diffuses Nectar and Distributes Qi.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Upholds the Myriad Practices.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Primordial Brahma Who Delivers Beings.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Profound Darkness and Quiescent Congealment.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Heavenly Perfection and Supreme Wonder.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Rides Vows to Rebirth.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Wisdom’s Awakening and Primordial Penetration.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Supreme Ultimate’s Wondrous Completion.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Summons the Perfected and Assembles the Sages.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Settled Radiance and Brilliant Illumination.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Illuminating Observation and Great Deliverance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the True Essentials’ Skillful Guidance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Dragon’s Script and Myriad Transformations.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Majestic Radiance and Mystic Response.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Observes Karmic Conditions and Manifests Splendor.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Jade Perfection and Brahma-Splendor.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Great Illumination and Seven Luminaries.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Mystic Simplicity and Descending Radiance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Radiant Virtue and Subtle Function.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Patrolls the Void and Soars on Steps.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Ten Flowers’ Supreme Vows.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Great Peace and Brahma-Deliverance.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Void’s Illumination and Universal Oversight.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Spirit’s Perfection and Wondrous Function.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Circulates Salvation and Forgets Merit.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Jade Illumination and Mystic Awakening.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Brahma-Qi’s Vast Net.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Penetrates the Mysteries and Encompasses the Myriad Models.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Ten Sages’ Revolving Wheel.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Longevity and Protective Deliverance.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Universally Cultivates the Myriad Practices.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Extends Harmony and Upright Transformation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Vast Operation and Compassionate Kindness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Kind Salvation and Wise Completion.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Pervades the Void and Suspends Liberation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mystic Pivot and Profound Quiescence.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Empty Wisdom’s Vast Penetration.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Profound Void’s Assembly of Sages.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Establishes Virtue and Illuminates Harmony.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Constantly and Kindly Rescues Beings.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Wondrous Joy Without Equal.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Accords with Quiescence and Ascends the Mysteries.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Promotes and Magnifies Virtuous Transformation.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Reveres Immortals and Upholds Goodness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Reverence, Love, Compassion, and Forbearance.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Opens Salvation for the Four Kinds of Birth.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Vastly Proclaims and Broadly Disseminates.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Supreme Virtue’s Universal Renown.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Jade Flower’s Flowing Moisture.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Great Forgetfulness and Discerning Wisdom.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Illuminating Emptiness and Shining Quiescence.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Penetrating Wisdom and Upright Faith.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Clarity, Spirit, and the Tranquil Realm.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Responds to Karmic Conditions and Covers Karma.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the One Vehicle’s Contemplative Illumination.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Utmost True and Mystic Origin.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Profound Abyss’s Samadhi.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Six Perfections’ Great Penetration.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Primordial Kalpa’s Primordial Chaos.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Congealed Emptiness and Supreme Wonder.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Profound Root’s Vast Salvation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Great Compassion’s Distant Transformation.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Pities and Remembers the Sunken and Fallen.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Pities and Rescues Humans and Devas.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Transcends and Ascends the Vast Kalpas.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Surpasses the Three Clarities.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Great Net’s Profound Stillness.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Utmost Wonder and Supreme Victory.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Void’s Ultimate Great Penetration.\nWith wholehearted faith, pay homage to the Heavenly Worthy of the Mystic Teachings’ Empty Liberation.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Wondrous Victory and Circulating Response.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Penetrates the Profound and Realizes the Ultimate.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Pervades and Transforms the Worlds.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Initiates the Origin and Responds to the Sages.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Supreme Goodness and Jade Flower.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Treasure Perfection and Constant Bliss.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Merit’s Completion and Illumination’s Cessation.",
      "overlap_context": "ence, respectfully receiving the teachings.\n\n*Scripture of the Names and Images of Lord Lao, Scroll Nine Concludes*\n*Scripture of the Names and Images of Lord Lao, Scroll Ten*\n\nAt that time, the Most High Lord Lao addressed the Lower Region’s Life-Preserving Perfected and all the immortals: The sacred names of the one hundred twenty Heavenly Worthies of the Immeasurable Brahma-Qi Realm of the Lower Regions—paying homage to them eradicates boundless transgressions and accrues boundless blessings.",
      "start_char": 12346,
      "end_char": 13908,
      "start_sentence": 749,
      "end_sentence": 868,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 52.25582313537598,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\老子像名经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "高上老子曰：如是天尊，众相圆满，左右侍卫，无量徒众，并处下方梵气无极世界之中，广演大乘，敷说道要，度脱一切有罪众生，令其离苦，咸使安乐。 尔时，高上老子告下方保命真人及诸仙众：汝等若能道化下方无极世界一切众生，赞叹下方梵气无极世界一百二十天尊灵像名号，能减众生生死报对，从来所犯弃掷经书、轻毁圣文之罪，先尝斋食以贪口腹之罪，奸邪淫妬、分离骨肉之罪，擅用三宝竹木种种法物之罪，大斗重秤、方便侵人之罪，出放贩物、过分求利之罪，卖买孤虚、欺诳贤良之罪，恶口骂詈、谤毁良贱、比诸畜生之罪，宰杀众生、屠割物命之罪，轻慢父母、自爱妻儿之罪。 如是下方十恶之罪，无量无边，不可记忆。 今能一心发露忏悔，除此十罪，不为下方十直之神下元太一录其罪目，上奏天曹，命过之后，不堕下方无极世界粪秽地狱之中，长免臭处之苦，后生人中，快乐无量。 於是保命真人及诸仙众一心顶礼，敬奉教言。 高上老子曰：如是十方天尊，皆是元始应气，生死十方，安镇国土，教导众生，随其缘感，散影分身，变见无穷，与劫轮转，隐显不恒，开度一切，福被万天。 若道士、女冠及诸男女能发善心，为人主、国王、父母、妻子、己身眷属、七祖九玄、天下地上一切众生，随其分力，金银珠玉、瓦石铜铁、丹青绣画，造其形像，布散十方，遍满国土，礼拜供养，立观度人，行道念诵，散华然灯，忏悔发愿，奉诫持斋，见世安乐，过去生天，获福无量，不可思议。 若国主有 灾，日月勃蚀，星辰失度，水旱不调，兆人疫疠，兵革四兴，当於灵观玄坛及以宫殿庭阙，以万二千灯作十重，千二百盏，开八方门，使内外圆足，光明朗彻，然於其中，昼夜礼忏，散华烧香，归命十方一千一百六十灵像名号，称扬念诵，建大宝斋，放生布施，立百高座，讲说三洞大乘妙经，即得国土安乐，天下太平。 若公侯牧伯、一切人民有众 灾危，亦当勤行，见世昌炽，七祖升天，免脱地狱，长夜光明，世世罔极，长享无为。 然灯之法，亦可罗列十方千二百盏，亦可大建宝轮，上安万二千灯，亦可所在立之，公侯以千，庶人用百。 皆依此法。 夜则使灯光不绝，昼则息之。 停散之日，皆当广设大斋，行道赞叹，言功诸天，得福无量，不可胜言。 於是十方真人及诸徒众一时稽首，称善而退。 老子像名经卷之十竟",
      "translated_text": "The Most High Lord Lao said: Such Heavenly Worthies, with all aspects perfected, surrounded by immeasurable retinues of attendants, abide in the boundless Brahma-qi worlds below, broadly expounding the Great Vehicle, unfolding the essential teachings of the Dao, delivering all sinful beings, causing them to depart from suffering and attain peace and bliss.\n\nAt that time, the Most High Lord Lao addressed the Lifeguarding Perfected and all the immortals below: \"If you are able to guide and transform all beings in the boundless worlds below, and extol the sacred names and images of the one hundred twenty Heavenly Worthies of the Brahma-qi boundless worlds, you can reduce the karmic retributions of sentient beings for their past transgressions—sins such as discarding scriptures and scorning sacred texts, gluttony from past vegetarian feasts, licentiousness and jealousy that sunders flesh and blood, misappropriating bamboo, wood, and various ritual implements of the Three Treasures, using false measures and scales to deceive others, selling goods for excessive profit, trading in ill omens and deceiving the worthy, cursing and slandering the noble and base as if they were beasts, slaughtering living beings and butchering creatures, disrespecting parents while cherishing one’s own wife and children. Such are the ten evil sins of the lower worlds, immeasurable and boundless, beyond reckoning. Now, if one wholeheartedly confesses and repents, these ten sins shall be eradicated, and the Ten Upright Deities and the Lower Primordial Unity will not record them. They will not be reported to the Heavenly Courts, and after death, one will not fall into the filthy hells of the boundless worlds below, forever spared the suffering of foul places. Reborn among humans, one shall enjoy immeasurable bliss.\n\nThereupon, the Lifeguarding Perfected and all the immortals bowed their heads in reverence and respectfully received the teachings.\n\nThe Most High Lord Lao said: \"All such Heavenly Worthies of the ten directions are the primordial responses of the Original Beginning to qi, pervading the ten directions of life and death, pacifying and protecting lands, teaching and guiding beings. According to karmic conditions, they scatter their reflections and divide their bodies, appearing in endless transformations. With the turning of kalpas, they are sometimes hidden, sometimes manifest, opening the path to deliverance and bestowing blessings upon the ten thousand heavens. If Daoist priests, nuns, and all men and women can arouse good intentions, whether for rulers, kings, parents, spouses, children, their own families, the seven ancestors and nine lineages, or all beings under heaven and upon earth, and according to their means—whether with gold, silver, pearls, jade, tiles, stones, bronze, iron, cinnabar, or painted and embroidered images—create their likenesses, dispersing them throughout the ten directions to fill all lands, bowing in worship, making offerings, establishing temples to deliver people, performing rituals, reciting scriptures, scattering flowers, lighting lamps, confessing sins, making vows, upholding precepts, and observing fasts, they shall enjoy peace in this life, ascend to heaven in past lives, and gain immeasurable, inconceivable blessings.\n\nIf a ruler faces calamities—such as solar or lunar eclipses, stars losing their courses, floods or droughts, plagues among the people, or wars breaking out on all sides—then within sacred temples and divine altars, or in palace halls and courtyards, they should arrange twelve thousand lamps in ten concentric circles of one thousand two hundred lamps each, opening eight gates to form a complete and radiant illumination within and without. Day and night, they should bow in repentance, scatter flowers, burn incense, and take refuge in the names of the one thousand one hundred sixty sacred images of the ten directions, chanting and reciting them. They should establish grand treasure feasts, release living beings, practice almsgiving, set up a hundred high seats, and lecture on the wondrous scriptures of the Three Caverns’ Great Vehicle. Thus, the land shall be at peace, and the world shall enjoy great tranquility.\n\nIf nobles, governors, or any of the people face various dangers, they too should diligently practice these rites. In this life, they shall flourish, their seven ancestors shall ascend to heaven, they shall escape hell, and the long night shall become bright. For generations without end, they shall enjoy effortless bliss.\n\nThe method of lighting lamps may also involve arranging one thousand two hundred lamps in the ten directions, or constructing a great treasure wheel with twelve thousand lamps above. They may be set up in any location—nobles using a thousand, commoners a hundred—all following this method. At night, the lamp-light should remain unbroken; by day, it may be extinguished. On the day of dispersal, they should hold grand feasts, perform rituals, chant praises, and proclaim their merits to the heavens, gaining immeasurable blessings beyond words.\"\n\nThereupon, the Perfected Ones of the ten directions and all their retinues bowed their heads together, praised the teaching, and withdrew.\n\n*Scripture of the Names and Images of Laozi’s Sacred Likenesses, Scroll Ten* ends here.",
      "overlap_context": "faith, pay homage to the Heavenly Worthy Who Pervades and Transforms the Worlds.\nWith wholehearted faith, pay homage to the Heavenly Worthy Who Initiates the Origin and Responds to the Sages.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Supreme Goodness and Jade Flower.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Treasure Perfection and Constant Bliss.\nWith wholehearted faith, pay homage to the Heavenly Worthy of Merit’s Completion and Illumination’s Cessation.",
      "start_char": 13908,
      "end_char": 14820,
      "start_sentence": 869,
      "end_sentence": 883,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.517353057861328,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\本文类\\老子像名经.txt",
        "category": "本文类"
      }
    }
  ]
}