{
  "source_id": "老子秘旨例略",
  "source_file": "chunked_daozang\\老子秘旨例略.json",
  "total_chunks": 3,
  "total_original_chars": 3749,
  "total_translated_chars": 18002,
  "total_translation_time": 90.19175362586975,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\老子秘旨例略.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "*The Subtle Essence of Laozi: An Outline*\n\n**Title:** *The Subtle Essence of Laozi: An Outline* (also known as *Laozi’s Pointers*).\n**Author:** Wang Bi of Wei, who expounded the essential purport of the *Laozi* through the fundamentals of Dark Learning (Xuanxue).\n**Format:** One scroll.\n**Source Text:** *Daoist Canon of the Orthodox Tradition*, Zhengyi Section, Part One.\n**Collated with:** *Seven Lots from the Bookcase of the Clouds*.\n\n---\n\nThe arising of the myriad things and the completion of all works must emerge from the formless and proceed from the nameless. The formless and nameless are the origin of the ten thousand things. Neither warm nor cool, neither gong nor shang, they cannot be heard when listened for, cannot be seen when looked for, cannot be known when embodied, cannot be tasted when savored. Thus, as a thing, they are undifferentiated; as an image, they are formless; as a sound, they are silent; as a flavor, they are without manifestation. Therefore, they serve as the origin and master of all things, embracing and pervading all without exception.\n\nIf warmth existed, it could not be cool; if gong existed, it could not be shang. Form must have its distinctions, sound must have its categories. Thus, an image that has form is not the Great Image; a sound that has tone is not the Great Sound. If the Four Images do not take form, the Great Image has nothing through which to flourish; if the Five Tones do not produce sound, the Great Sound has nothing through which to arrive. When the Four Images take form yet things have no master, the Great Image flourishes; when the Five Tones produce sound yet the mind has no attachment, the Great Sound arrives.\n\nThus, holding to the Great Image, the world comes forth; employing the Great Sound, customs are transformed. Though the formless flourishes and the world comes forth, it comes forth yet cannot be released. Though the silent sound arrives and customs are transformed, they are transformed yet cannot be discerned.\n\nTherefore, Heaven generates the Five Things, yet no-thing is used. The sage practices the Five Teachings, yet no speech brings transformation. Thus, the Dao that can be spoken is not the constant Dao; the name that can be named is not the constant name.\n\nThe mother of the Five Things is neither hot nor cold, neither soft nor hard; the mother of the Five Teachings is neither bright nor dim, neither indulgent nor harmful. Though ancient and modern differ, and customs shift with the times, this does not change. This is what is meant by \"from ancient times to the present, its name does not depart.\"\n\nWithout this, Heaven cannot generate things; without this, governance cannot achieve success. Thus, past and present are connected, beginning and end are the same. Holding to the ancient, one can master the present; mastering the present, one can know the beginning. This is what is called the constant.\n\nWithout the appearance of brightness or dimness, without the image of warmth or coolness—knowing the constant is called illumination. The arising of things and the completion of works all proceed from this. Thus, one surveys the multitude of beginnings.\n\nThe swiftness of lightning is still insufficient to circle in an instant; the movement of riding the wind is still insufficient to reach in a single breath. Excellence in speed lies in not hurrying; excellence in arrival lies in not traveling.\n\nThus, the fullness of what can be spoken is insufficient to govern Heaven and Earth; the extremity of what has form is insufficient to contain the myriad things. Therefore, those who sigh over it cannot exhaust its wonder; those who chant it cannot express its vastness. Naming it cannot capture it; describing it cannot complete it. Names must have distinctions; descriptions must have origins. With distinctions, there is incompleteness; with origins, there is insufficiency. Incompleteness severs its truth; insufficiency makes it unnameable. This can be expounded and made clear.\n\nThe Dao is that by which the myriad things proceed. The Dark is that from which the obscure emerges. The Profound is that which delves into the unfathomable without end. The Great is that which encompasses all without limit. The Remote is that which stretches into the distant without reach. The Subtle is that which lies in the minute without visibility.\n\nThus, the terms *Dao*, *Dark*, *Profound*, *Great*, *Subtle*, and *Remote* each have their meaning, yet none exhausts its extremity. Yet, encompassing without limit cannot be called small; subtly wondrous and formless cannot be called great. Therefore, the text designates it as *Dao* and calls it *Dark*, yet does not name it.\n\nThus, those who speak of it lose its constancy; those who name it depart from its truth; those who act upon it ruin its nature; those who grasp it lose its origin.\n\nTherefore, the sage does not take speech as primary and thus does not violate its constancy; does not take names as constant and thus does not depart from its truth; does not take action as affairs and thus does not ruin its nature; does not take grasping as control and thus does not lose its origin.\n\nThus, the text of Laozi, when debated and expounded, loses its purport; when named and demanded, violates its meaning. Its great return lies in discussing the origin of the Great Beginning to clarify the nature of spontaneity, and in expounding the extremity of the obscure to settle the delusions of confusion.\n\nThus, it does not act yet nothing is left undone; it honors the root to still the branches, guards the mother to preserve the child, devalues clever techniques, acts before things arise, places no demands on others, and seeks only within oneself. This is its great essential.\n\nYet, the Legalists esteem uniformity and use punishments to enforce it. The Logicians esteem defining reality and use names to correct it. The Confucians esteem universal love and use praise to advance it. The Mohists esteem frugality and use rectification to establish it. The Eclectics esteem myriad virtues and use synthesis to practice them.\n\nWhen form is used to regulate things, artifice and falsehood inevitably arise; when names are used to define things, principles and forgiveness are inevitably lost; when praise is used to advance things, competition and esteem inevitably arise; when rectification is used to establish things, discord and opposition inevitably occur; when synthesis is used to practice things, filth and chaos inevitably flourish. These all employ the child and abandon the mother, causing things to lose their support—such methods are insufficient to uphold.\n\nYet, though paths converge, their ends diverge; though destinations align, their purposes conflict. Scholars are confused by what they attain and lost in what they pursue.\n\nObserving their uniformity, one calls it *law*;\nBeholding their settled truth, one calls it *name*;\nDiscerning their pure love, one calls it *Confucianism*;\nExamining their frugality, one calls it *Mohism*;\nWitnessing their lack of attachment, one calls it *Eclecticism*.\nFollowing what one examines, one rectifies names;\nYielding to what one favors, one clings to intentions.\nThus arise tangled, confused debates,\nDivergent pursuits and contentious disputes—\nall from this.\n\nMoreover, in their writings,\nthey cite the end to verify the beginning,\nrather than recounting the beginning to exhaust the end;\nthey open but do not fully disclose,\nguide but do not lead.\nOnly by tracing does one grasp their meaning;\nonly by inference does one exhaust their principle.\nThey skillfully initiate matters to introduce their discourse,\nand clarify the convergence of return to conclude their text.\nThus, those who share the same purpose and are moved by it\nall admire the inception of their words and expand upon them;\nthose who hold divergent aims and compose independently\nall delight in the signs of convergence as proof.\nThough paths differ, they must share the same return;\nthough thoughts vary, they must align in their end.\nBy elevating this return and end,\nthey illuminate the ultimate principle.\nThus, those who reflect by analogy\nall rejoice in the resonance of their thoughts,\nbelieving they have grasped the meaning.\n\nFor all things to endure, they must revert to their form;\nfor achievements to succeed, they must revert to their name.\nThat which endures does not take endurance as endurance—\nit is because it does not forget impermanence.\nThat which is secure does not take security as security—\nit is because it does not forget peril.\nThus, those who safeguard their endurance perish;\nthose who do not forget impermanence endure.\nThose who rest in their position are imperiled;\nthose who do not forget peril are secure.\nOne who excels in lifting the autumn down\nor hearing the thunderclap\nfinds the Dao at odds with form.\nThat which is truly secure is said to be not where security resides;\nthat which truly endures is said to be not where endurance resides;\nkings and lords are truly exalted,\nyet it is said to be not where exaltation is made;\nHeaven and Earth are truly vast,\nyet it is said to be not where vastness is capable;\nsacred works truly exist,\nyet it is said to be the establishment of abolishing the sacred;\nbenevolent virtue is truly manifest,\nyet it is said to be the abiding of abandoning benevolence.\nThus, those who see form but do not reach the Dao\nall resent such words.\n\nTo determine the root of things,\none must, though near, begin from afar to verify their origin;\nto clarify the source of things,\none must, though evident, begin from obscurity to trace their foundation.\nThus, one draws from beyond Heaven and Earth\nto illuminate what lies within the body,\nclarifies the meaning of kings and lords as orphaned and solitary,\nand follows the singular Dao to proclaim its beginning.\nThus, those who examine the near but do not reach the origin of the flowing lineage\nall dismiss such words as absurd, believing them empty.\n\nTherefore, each expounds their own doctrine,\nand people praise the resulting chaos.\nSome find the words circuitous,\nothers mock the arguments—\nas if enlightened yet benighted,\nas if distinct yet disordered.\nThis is the reason.\n\nNames serve to define the other;\nterms follow what is designated.\nNames arise from the other,\nterms emerge from the self.\nThus, when one traverses where no thing is untouched,\nit is termed the *Dao*;\nwhen one seeks where no subtlety is unmanifest,\nit is called the *Mysterious*.\nSubtlety emerges from the Mysterious,\nthe multitude proceeds from the Dao.\nThus, to give life and nurture,\nwithout obstruction or blockage,\nto penetrate the nature of things—\nthis is called the Dao.\nTo give life yet not possess,\nto act yet not rely,\nto grow yet not dominate,\nto have virtue yet no mastery—\nthis is the power of the Mysterious.\nThe Mysterious is called the profound;\nthe Dao is termed the great.\nNames and designations arise from forms and appearances;\nterms and appellations emerge from traversal and seeking.\nNames and designations do not arise in vain,\nterms and appellations do not emerge without cause.\nThus, names and designations greatly miss the essence,\nterms and appellations do not exhaust the ultimate.\nTherefore, to speak of the Mysterious is to say *mysterious yet again mysterious*;\nto speak of the Dao is to say *within the realm, there are the Four Greats*.\n\nThe *Book of Laozi* can nearly be encapsulated in a single phrase:\nAh! To honor the root and quiet the branches—this is all.\nObserve its origins,\ntrace its return—\nwords do not stray from the source,\naffairs do not lose their master.\nThough its text spans five thousand characters,\nit is threaded by a single meaning.\nThough vast and abundant, its categories share the same understanding;\nto encapsulate it in a single phrase\nis to leave no obscurity unrecognized.\nYet if each matter is treated as a separate intention,\nthough eloquent, it only deepens confusion.\n\nLet us attempt to discuss it thus:\nDoes the rise of depravity stem from the deeds of the depraved?\nDoes the emergence of excess arise from the creations of the excessive?\nThus, to guard against depravity lies in preserving sincerity,\nnot in keen scrutiny.\nTo quell excess lies in abandoning ornamentation,\nnot in elaborate regulations.\nTo eradicate theft lies in eliminating desire,\nnot in severe punishments.\nTo halt litigation lies in not esteeming,\nnot in skillful adjudication.\nThus, do not attack their deeds—\nmake them without the heart for deeds;\ndo not harm their desires—\nmake them without the heart for desire.\nPlan at the unmanifest,\nact at the unbegun—\nthis is all.\n\nThus, exhausting sagely wisdom to govern artifice and falsehood\nis not as good as perceiving simplicity to quiet the people’s desires;\npromoting benevolence and righteousness to thicken thin customs\nis not as good as embracing simplicity to preserve sincerity;\nmultiplying clever advantages to advance utility\nis not as good as reducing self-interest to cease ostentatious competition.\nTherefore, abolish surveillance,\nconceal keen perception,\ndiscard incentives,\nprune ostentatious praise,\nreject clever utility,\ndevalue treasures—\nall lie in preventing the people’s loves and desires from arising,\nnot in attacking their depraved deeds.\nThus, perceiving simplicity to abolish sagely wisdom,\nreducing self-interest to discard clever advantages—\nthese are called *honoring the root to quiet the branches*.\n\nThe way of simplicity is not manifest,\nyet the allure of desires is not concealed.\nThough one exhausts sagely brightness to scrutinize it,\nor depletes wisdom and foresight to attack it,\nthe clever grow more refined in thought,\nthe false more varied in deception.\nThe more fiercely it is attacked,\nthe more diligently it is evaded.\nThus, the foolish and wise deceive one another,\nthe six relations grow suspicious,\nsimplicity scatters, truth departs,\nand affairs harbor their treachery.\n\nAbandoning the root to attack the branches—\nthough one exhausts sagely wisdom, this only deepens the disaster.\nHow much worse for those whose methods fall below this?\n\nWhen governed by simplicity and plainness,\naffairs naturally rectify without effort;\nwhen attacked by sagely wisdom,\nthe people grow desperate and cunning flourishes.\nThus, simplicity and plainness may be embraced,\nwhile sagely wisdom may be discarded.\n\nWhen scrutiny is lax, evasion is likewise lax;\nwhen one exhausts keen perception,\nescape grows equally keen.\nLaxity harms plainness little,\nbut strictness deepens artifice and deceit.\n\nAre those who wield the arts of utmost scrutiny and hidden probing\nonly the sagely and wise?\nThe harm they bring—how could it be reckoned?\n\nA hundredfold profit is not yet considered much.\nIf one cannot distinguish names,\none cannot speak of principles;\nif one cannot fix names,\none cannot discuss realities.\n\nAll people are born from form,\nyet no form is born from people.\nThus, for every name there is a corresponding form,\nfor every form there is its proper place.\nKindness cannot be called sageliness,\nwisdom cannot be called kindness—\neach has its own reality.\n\nTo perceive the subtlest traces is the utmost of clarity;\nto probe hidden depths is the utmost of foresight.\nIs one who exhausts utmost clarity not sagely?\nIs one who exhausts utmost foresight not wise?\nBy examining realities and fixing names,\none may discard sageliness without confusion.\n\nWhen the virtue of honest plainness is not manifest,\nwhile the beauty of reputation and conduct is exalted,\npeople cultivate what is exalted in hopes of praise,\npursue what is esteemed in pursuit of profit.\nYearning for praise and profit,\nthey labor at their conduct—\nthe more their reputation shines, the more sincerity recedes;\nthe greater the profit, the more hearts compete.\nFathers and sons, brothers—\naffection loses its truth,\nfilial piety cannot bear sincerity,\ncompassion cannot bear reality—\nall summoned by the exaltation of reputation and conduct.\n\nThe worry that customs grow thin while names arise,\nthat exalting benevolence and righteousness only deepens deceit—\nhow much worse for methods that scorn these?\n\nThus, to abolish benevolence and discard righteousness\nto restore filial piety and compassion\nis not yet considered grand.\n\nWhen city walls grow tall, siege engines arise;\nwhen profit flourishes, schemes deepen.\nIf one abides in desirelessness,\neven rewards will not tempt theft;\nif private desires prevail,\nclever profit only grows more obscured.\nThus, abolish cleverness and discard profit,\nreplace them with few desires—\nthen thieves will vanish,\nthough this is not yet worthy of praise.\n\nSageliness and wisdom are the finest of talents,\nbenevolence and righteousness the greatest of conduct,\ncleverness and profit the best of utility.\nIf the root does not endure,\nyet these three excellences arise,\nthe harm remains the same—\nhow much more for methods that, for the sake of profit,\nneglect plainness?\n\nThus, the ancients sighed:\nHow profound—why are things so hard to comprehend?\nOne knows that the unsagely are unsagely,\nyet does not know that the sagely are not sagely;\none knows that the unkind are unkind,\nyet does not know that kindness is not kindness.\n\nOnly by abolishing sageliness is sagely achievement complete;\nonly by discarding benevolence is benevolent virtue profound.\nOne despises strength not because one desires weakness,\nbut because striving for strength loses strength;\none abolishes benevolence not because one desires unkindness,\nbut because practicing benevolence breeds falsity.\n\nThere is order that leads to chaos,\nsecurity that leads to danger.\nPutting oneself last, one comes first—\ncoming first is not something the first can achieve.\nExcluding oneself, one endures—\nendurance is not something the enduring can effect.\nMerit cannot be seized,\nexcellence cannot be employed.\nThus, one must grasp only the mother of merit.\n\nThe text says: knowing the child,\none must return to guard the mother.\nTracing this principle—\nwhere does it not flow smoothly?\n\nLaozi’s subtle purport concludes here.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "老子微旨例略 经名：老子微旨例略。 又名《老子指略》。 魏王弼撰。 以玄学本与论概述《老子》旨要。 一卷。 底本出处：《正统道藏》正一部。 参校：《云笈七签》。 老子微旨例略 天#1物之所以生，功之所以成，必生乎无形，由乎无名。 #2无形无名者，万物之宗也。 不温不凉，不宫不商，听之不可得而闻，视之不可得而彰，体之不可得而知，味之不可得而尝。 故其为物也则混成，为象也则无形，为音也则希声，为味也则无呈。 故能为品物之宗主，苞#3通靡使不经也。 若温也则不能凉矣。 宫也，则不能商矣。 形必有所分，声必有所属，故象而形者，非大象也，音而声者，非大音也。 然则四象不形，则大象无以畅； 五音不声，则大音无以至。 四象形而物无所主焉，则大象畅矣。 五音声而心无所适焉，则大音至矣。 故执大象则天下往，用大音则风俗移#4也。 无形畅，天下虽往，往而不能释也。 希声至，风俗虽移，移而不能辩也。 是故天生五物，无物为用。 圣行五教，不言为化，是以道可道非常道，名可名非常名也。 五物之母，不炎不寒，不柔不刚； 五教之母，不皦不昧，不恩不伤。 虽古今不同，时移俗易，此不变也。 所谓自古及今，其名不去者也。 天不以此则物不生，治不以此则功不成，故古今通，终始同，执古可以御今，御今可以知古#5始。 此所谓常者也。 无皦昧之状、温凉之象，故知常曰明也。 物生功成，莫不由乎此，故以阅众甫也。 夫奔电之疾，犹不足以一时周，御风之行，犹不足以一息期。 善速在不疾，善至在不行。 故可道之盛未足以官天地，有形之极未足以府万物。 是故叹之者不能尽乎斯羡，咏之者不能畅乎斯弘，名之不能当，称之不能既。 名必有所分，称必有所由，有分则有不兼，有由则有不尽。 不兼则大殊其真，不尽则不可以名，此可演而明也。 夫道也者，取乎万物之所由也。 玄也者，取乎幽冥之所出也。 深也者，取乎探赜而不可究也。 大也者，取乎弥纶而不可极也。 远也者，取乎绵邈#6而不可及也。 微也者，取乎幽微而不可睹也。 然则道玄探大微#7远之言，各有其义，未尽其极者也。 然弥纶无极，不可名细； 微妙无形，不可名大。 是以篇云#8字之曰道，谓之曰玄，而不名也。 然则言之者失其常，名之者离其真，为之者败其性，执之者失其原矣。 是以圣人不以言为主，则不违其常； 不以名为常，则不离其真； 不以为为事，则不败其性； 不以执为制，则不失其原矣。 然则老子#9之文，欲辩而诰者，则失其旨也； 欲名而责者，则违其义也。 故其大归也，论太始之原，以明自然之性； 演幽冥之极，以定惑罔之迷。 因而不为损而不施，崇本以息末，守母以存子，贱夫巧术，为在未有，无责於人，必求诸己。 此其大要也。 而法者尚乎齐同，而刑#10以检之。 名者尚乎定真，而名#11以正之。 儒者尚乎全爱，而誉以进之。 墨者尚乎俭啬，而矫#12以立之。 杂者尚乎众美，而总以行之。 夫形以检物，巧伪必生； 名以定物，理恕必失； 誉以进物，争尚必起； 矫以立物，乖违必作； 杂以行物，秽乱必兴。 斯皆用其子而弃其母，物失所载，未足守也。 然致同涂异，至合趣#13乖，而学者惑其所致，迷其所趣。",
      "translated_text": "*The Subtle Essence of Laozi: An Outline*\n\n**Title:** *The Subtle Essence of Laozi: An Outline* (also known as *Laozi’s Pointers*).\n**Author:** Wang Bi of Wei, who expounded the essential purport of the *Laozi* through the fundamentals of Dark Learning (Xuanxue).\n**Format:** One scroll.\n**Source Text:** *Daoist Canon of the Orthodox Tradition*, Zhengyi Section, Part One.\n**Collated with:** *Seven Lots from the Bookcase of the Clouds*.\n\n---\n\nThe arising of the myriad things and the completion of all works must emerge from the formless and proceed from the nameless. The formless and nameless are the origin of the ten thousand things. Neither warm nor cool, neither gong nor shang, they cannot be heard when listened for, cannot be seen when looked for, cannot be known when embodied, cannot be tasted when savored. Thus, as a thing, they are undifferentiated; as an image, they are formless; as a sound, they are silent; as a flavor, they are without manifestation. Therefore, they serve as the origin and master of all things, embracing and pervading all without exception.\n\nIf warmth existed, it could not be cool; if gong existed, it could not be shang. Form must have its distinctions, sound must have its categories. Thus, an image that has form is not the Great Image; a sound that has tone is not the Great Sound. If the Four Images do not take form, the Great Image has nothing through which to flourish; if the Five Tones do not produce sound, the Great Sound has nothing through which to arrive. When the Four Images take form yet things have no master, the Great Image flourishes; when the Five Tones produce sound yet the mind has no attachment, the Great Sound arrives.\n\nThus, holding to the Great Image, the world comes forth; employing the Great Sound, customs are transformed. Though the formless flourishes and the world comes forth, it comes forth yet cannot be released. Though the silent sound arrives and customs are transformed, they are transformed yet cannot be discerned.\n\nTherefore, Heaven generates the Five Things, yet no-thing is used. The sage practices the Five Teachings, yet no speech brings transformation. Thus, the Dao that can be spoken is not the constant Dao; the name that can be named is not the constant name.\n\nThe mother of the Five Things is neither hot nor cold, neither soft nor hard; the mother of the Five Teachings is neither bright nor dim, neither indulgent nor harmful. Though ancient and modern differ, and customs shift with the times, this does not change. This is what is meant by \"from ancient times to the present, its name does not depart.\"\n\nWithout this, Heaven cannot generate things; without this, governance cannot achieve success. Thus, past and present are connected, beginning and end are the same. Holding to the ancient, one can master the present; mastering the present, one can know the beginning. This is what is called the constant.\n\nWithout the appearance of brightness or dimness, without the image of warmth or coolness—knowing the constant is called illumination. The arising of things and the completion of works all proceed from this. Thus, one surveys the multitude of beginnings.\n\nThe swiftness of lightning is still insufficient to circle in an instant; the movement of riding the wind is still insufficient to reach in a single breath. Excellence in speed lies in not hurrying; excellence in arrival lies in not traveling.\n\nThus, the fullness of what can be spoken is insufficient to govern Heaven and Earth; the extremity of what has form is insufficient to contain the myriad things. Therefore, those who sigh over it cannot exhaust its wonder; those who chant it cannot express its vastness. Naming it cannot capture it; describing it cannot complete it. Names must have distinctions; descriptions must have origins. With distinctions, there is incompleteness; with origins, there is insufficiency. Incompleteness severs its truth; insufficiency makes it unnameable. This can be expounded and made clear.\n\nThe Dao is that by which the myriad things proceed. The Dark is that from which the obscure emerges. The Profound is that which delves into the unfathomable without end. The Great is that which encompasses all without limit. The Remote is that which stretches into the distant without reach. The Subtle is that which lies in the minute without visibility.\n\nThus, the terms *Dao*, *Dark*, *Profound*, *Great*, *Subtle*, and *Remote* each have their meaning, yet none exhausts its extremity. Yet, encompassing without limit cannot be called small; subtly wondrous and formless cannot be called great. Therefore, the text designates it as *Dao* and calls it *Dark*, yet does not name it.\n\nThus, those who speak of it lose its constancy; those who name it depart from its truth; those who act upon it ruin its nature; those who grasp it lose its origin.\n\nTherefore, the sage does not take speech as primary and thus does not violate its constancy; does not take names as constant and thus does not depart from its truth; does not take action as affairs and thus does not ruin its nature; does not take grasping as control and thus does not lose its origin.\n\nThus, the text of Laozi, when debated and expounded, loses its purport; when named and demanded, violates its meaning. Its great return lies in discussing the origin of the Great Beginning to clarify the nature of spontaneity, and in expounding the extremity of the obscure to settle the delusions of confusion.\n\nThus, it does not act yet nothing is left undone; it honors the root to still the branches, guards the mother to preserve the child, devalues clever techniques, acts before things arise, places no demands on others, and seeks only within oneself. This is its great essential.\n\nYet, the Legalists esteem uniformity and use punishments to enforce it. The Logicians esteem defining reality and use names to correct it. The Confucians esteem universal love and use praise to advance it. The Mohists esteem frugality and use rectification to establish it. The Eclectics esteem myriad virtues and use synthesis to practice them.\n\nWhen form is used to regulate things, artifice and falsehood inevitably arise; when names are used to define things, principles and forgiveness are inevitably lost; when praise is used to advance things, competition and esteem inevitably arise; when rectification is used to establish things, discord and opposition inevitably occur; when synthesis is used to practice things, filth and chaos inevitably flourish. These all employ the child and abandon the mother, causing things to lose their support—such methods are insufficient to uphold.\n\nYet, though paths converge, their ends diverge; though destinations align, their purposes conflict. Scholars are confused by what they attain and lost in what they pursue.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1232,
      "start_sentence": 0,
      "end_sentence": 72,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.05212879180908,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\老子秘旨例略.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "观其齐同，则谓之法； 睹其定真，则谓之名； 察其纯爱，则谓之儒； 鉴其俭啬，则谓之墨； 见其不系，则谓之杂。 随其所鉴而正名焉，顺其所好而执意焉。 故使有纷纭愦#14错之论，殊趣辩#15之争，盖由斯矣。 又其为文也，举终以证始，不述始以尽终#16，开而弗达，导而弗率#17。 寻而后既其义，推而后尽其理，善发事始以首其论，明夫会归以终其文。 故使同趣而感发者#18，莫不美其兴言之始，因而演焉； 异旨而独构者，莫不说其会归之征，以为证焉。 夫涂虽殊必同其归，虑虽百必均其致，而举夫归致，以明至理。 故使触类而思者，莫不欣其思之所应，以为得其义焉。 凡物之所以存，乃反其形； 功之所以克，乃反其名。 夫存者不以存为存，以其不忘亡也。 安者不以安为安，以其不忘危也。 故保其存者亡，不忘亡者存； 安其位者危，不忘危者安。 善力举秋毫，善听闻雷霆，此道之与形反也。 安者实安，而曰非安之所安； 存者实存，而曰非存之所存； 侯王实尊，而曰非尊之所为#19； 天地实大，而曰非大之所能； 圣功实存，而曰绝圣之所立； 仁德实着，而曰弃仁之所存。 故使见形而不及道者，莫不忿其言焉。 夫欲定物之本者，则虽近而必自远以证其始； 欲明物之所由者，则虽显而必自幽以叔其本。 故取天地之外，以明形骸之内，明侯王孤寡之义，而从道一以宣其始，故使察近而不及流统之原者，莫不诞其言，以为虚焉。 是以云云者，各申其说，人美其乱。 或迂其言，或讥其论，若晓而昧，若分而乱，斯之由矣。 名也者，定彼者也。 称也者，从谓者也。 名生乎彼，称出乎我。 故涉之乎无物而不由，则称之曰道； 求之乎无妙而不出，则谓之曰玄。 妙出乎玄，众由乎道，故生之畜之，不壅不塞，通物之性，道之谓也。 生而不有，为而不恃，长而不宰，有德而无主，玄之德也。 玄谓之深者也，道称之大者也。 名号生乎形状，称谓出乎涉求，名号不虚生，称谓不虚出。 故名号则大失其旨，称谓则未尽其极，是以谓玄则玄之又玄，称道则域中有四大也#20。 老子之书，其几乎可一言而蔽之。 噫，崇本息末而已矣。 观其所由，寻其所归，言不远宗，事不失主。 文虽五千，贯之者一义。 虽广赡众则同类解，其一言而蔽之，则无幽而不识，每事各为意，则虽辩而愈惑o尝试论之曰：夫邪之兴也，岂邪者之所为乎？ 淫之所起也，岂淫者之所造乎？ 故闲邪在乎存诚，不在善察。 息淫在乎去华，不在兹章。 绝盗在乎去欲，不在严刑。 止讼在乎不尚，不在善听。 故不攻其为也，使其无心於为也； 不害其欲也，使其无心於欲也。 谋之於未兆，为之於未始，如斯而已矣。 故竭圣智以治巧伪，未若见质素以静民欲； 兴仁义以敦薄俗，未若抱朴以全笃实； 多巧利以兴事用，未若寡私欲以息华竞。 故绝司察，潜聪明，去劝进，翦华誉，弃巧用，贱宝货，唯在使民爱欲不生，不在攻其为邪也。 故见素朴以绝圣智，寡私欲以弃巧利，皆祟本以息末之谓也。 夫素朴之道不着，而好欲之美不隐，虽极圣明以察之，竭智虑以攻之，巧愈思精，伪愈多变，攻之弥甚，避之弥勤。 则乃愚智相欺，六亲相疑，朴散真离，事有其奸。",
      "translated_text": "Observing their uniformity, one calls it *law*;\nBeholding their settled truth, one calls it *name*;\nDiscerning their pure love, one calls it *Confucianism*;\nExamining their frugality, one calls it *Mohism*;\nWitnessing their lack of attachment, one calls it *Eclecticism*.\nFollowing what one examines, one rectifies names;\nYielding to what one favors, one clings to intentions.\nThus arise tangled, confused debates,\nDivergent pursuits and contentious disputes—\nall from this.\n\nMoreover, in their writings,\nthey cite the end to verify the beginning,\nrather than recounting the beginning to exhaust the end;\nthey open but do not fully disclose,\nguide but do not lead.\nOnly by tracing does one grasp their meaning;\nonly by inference does one exhaust their principle.\nThey skillfully initiate matters to introduce their discourse,\nand clarify the convergence of return to conclude their text.\nThus, those who share the same purpose and are moved by it\nall admire the inception of their words and expand upon them;\nthose who hold divergent aims and compose independently\nall delight in the signs of convergence as proof.\nThough paths differ, they must share the same return;\nthough thoughts vary, they must align in their end.\nBy elevating this return and end,\nthey illuminate the ultimate principle.\nThus, those who reflect by analogy\nall rejoice in the resonance of their thoughts,\nbelieving they have grasped the meaning.\n\nFor all things to endure, they must revert to their form;\nfor achievements to succeed, they must revert to their name.\nThat which endures does not take endurance as endurance—\nit is because it does not forget impermanence.\nThat which is secure does not take security as security—\nit is because it does not forget peril.\nThus, those who safeguard their endurance perish;\nthose who do not forget impermanence endure.\nThose who rest in their position are imperiled;\nthose who do not forget peril are secure.\nOne who excels in lifting the autumn down\nor hearing the thunderclap\nfinds the Dao at odds with form.\nThat which is truly secure is said to be not where security resides;\nthat which truly endures is said to be not where endurance resides;\nkings and lords are truly exalted,\nyet it is said to be not where exaltation is made;\nHeaven and Earth are truly vast,\nyet it is said to be not where vastness is capable;\nsacred works truly exist,\nyet it is said to be the establishment of abolishing the sacred;\nbenevolent virtue is truly manifest,\nyet it is said to be the abiding of abandoning benevolence.\nThus, those who see form but do not reach the Dao\nall resent such words.\n\nTo determine the root of things,\none must, though near, begin from afar to verify their origin;\nto clarify the source of things,\none must, though evident, begin from obscurity to trace their foundation.\nThus, one draws from beyond Heaven and Earth\nto illuminate what lies within the body,\nclarifies the meaning of kings and lords as orphaned and solitary,\nand follows the singular Dao to proclaim its beginning.\nThus, those who examine the near but do not reach the origin of the flowing lineage\nall dismiss such words as absurd, believing them empty.\n\nTherefore, each expounds their own doctrine,\nand people praise the resulting chaos.\nSome find the words circuitous,\nothers mock the arguments—\nas if enlightened yet benighted,\nas if distinct yet disordered.\nThis is the reason.\n\nNames serve to define the other;\nterms follow what is designated.\nNames arise from the other,\nterms emerge from the self.\nThus, when one traverses where no thing is untouched,\nit is termed the *Dao*;\nwhen one seeks where no subtlety is unmanifest,\nit is called the *Mysterious*.\nSubtlety emerges from the Mysterious,\nthe multitude proceeds from the Dao.\nThus, to give life and nurture,\nwithout obstruction or blockage,\nto penetrate the nature of things—\nthis is called the Dao.\nTo give life yet not possess,\nto act yet not rely,\nto grow yet not dominate,\nto have virtue yet no mastery—\nthis is the power of the Mysterious.\nThe Mysterious is called the profound;\nthe Dao is termed the great.\nNames and designations arise from forms and appearances;\nterms and appellations emerge from traversal and seeking.\nNames and designations do not arise in vain,\nterms and appellations do not emerge without cause.\nThus, names and designations greatly miss the essence,\nterms and appellations do not exhaust the ultimate.\nTherefore, to speak of the Mysterious is to say *mysterious yet again mysterious*;\nto speak of the Dao is to say *within the realm, there are the Four Greats*.\n\nThe *Book of Laozi* can nearly be encapsulated in a single phrase:\nAh! To honor the root and quiet the branches—this is all.\nObserve its origins,\ntrace its return—\nwords do not stray from the source,\naffairs do not lose their master.\nThough its text spans five thousand characters,\nit is threaded by a single meaning.\nThough vast and abundant, its categories share the same understanding;\nto encapsulate it in a single phrase\nis to leave no obscurity unrecognized.\nYet if each matter is treated as a separate intention,\nthough eloquent, it only deepens confusion.\n\nLet us attempt to discuss it thus:\nDoes the rise of depravity stem from the deeds of the depraved?\nDoes the emergence of excess arise from the creations of the excessive?\nThus, to guard against depravity lies in preserving sincerity,\nnot in keen scrutiny.\nTo quell excess lies in abandoning ornamentation,\nnot in elaborate regulations.\nTo eradicate theft lies in eliminating desire,\nnot in severe punishments.\nTo halt litigation lies in not esteeming,\nnot in skillful adjudication.\nThus, do not attack their deeds—\nmake them without the heart for deeds;\ndo not harm their desires—\nmake them without the heart for desire.\nPlan at the unmanifest,\nact at the unbegun—\nthis is all.\n\nThus, exhausting sagely wisdom to govern artifice and falsehood\nis not as good as perceiving simplicity to quiet the people’s desires;\npromoting benevolence and righteousness to thicken thin customs\nis not as good as embracing simplicity to preserve sincerity;\nmultiplying clever advantages to advance utility\nis not as good as reducing self-interest to cease ostentatious competition.\nTherefore, abolish surveillance,\nconceal keen perception,\ndiscard incentives,\nprune ostentatious praise,\nreject clever utility,\ndevalue treasures—\nall lie in preventing the people’s loves and desires from arising,\nnot in attacking their depraved deeds.\nThus, perceiving simplicity to abolish sagely wisdom,\nreducing self-interest to discard clever advantages—\nthese are called *honoring the root to quiet the branches*.\n\nThe way of simplicity is not manifest,\nyet the allure of desires is not concealed.\nThough one exhausts sagely brightness to scrutinize it,\nor depletes wisdom and foresight to attack it,\nthe clever grow more refined in thought,\nthe false more varied in deception.\nThe more fiercely it is attacked,\nthe more diligently it is evaded.\nThus, the foolish and wise deceive one another,\nthe six relations grow suspicious,\nsimplicity scatters, truth departs,\nand affairs harbor their treachery.",
      "overlap_context": " and esteem inevitably arise; when rectification is used to establish things, discord and opposition inevitably occur; when synthesis is used to practice things, filth and chaos inevitably flourish. These all employ the child and abandon the mother, causing things to lose their support—such methods are insufficient to uphold.\n\nYet, though paths converge, their ends diverge; though destinations align, their purposes conflict. Scholars are confused by what they attain and lost in what they pursue.",
      "start_char": 1232,
      "end_char": 2444,
      "start_sentence": 73,
      "end_sentence": 134,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.36501669883728,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\老子秘旨例略.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "盖舍本而攻末，虽极圣智，愈致斯灾。 况术之下此者乎？ 夫镇之以素朴，则无为而自正； 攻之以圣智，则民穷而巧殷。 故素朴可抱，而圣智可弃。 夫察司之简，则避之亦简，竭其聪明，则逃之亦察。 简则害朴寡，密则巧伪深矣。 夫能为至察探幽之术者，匪唯圣智哉？ 其为害也，岂可记乎？ 故百倍之利，未渠多也。 夫不能辩名，则不可与言理。 不能定名，则不可与论实也。 凡民生於形，未有形生於民者也。 故有此名必有此形，有此形必有其分，仁不得谓之圣，智不得谓之仁，则各有其实矣。 夫察见至微者，明之极也。 探射隐伏者，虑之极也。 能尽极明，匪唯圣乎？ 能尽极虑，匪唯智乎？ 校实定名以观，绝圣可无惑矣。 夫敦朴之德不着，而名行之美显尚，则修其所尚，而望其誉，修其所道，而冀其利。 望誉冀利，以勤其行，名弥美而诚愈外，利弥重而心愈竞。 父子兄弟，怀情失直，孝不任诚，慈不任实，盖显名行之所招也。 患俗薄而名兴，行崇仁义愈致斯伪，况术之贱此者乎？ 故绝仁弃义，以复孝慈，未渠弘也。 夫城高则冲生，利兴则求深，苟存无欲，则虽赏而不窃，私欲苟行，则巧利愈昏。 故绝巧弃利，代以寡欲，盗则无有，未足美也。 夫圣智才之杰也，仁义行之大者也，巧利用之善也。 本苟不存，而兴此三美，害犹如之，况术之有利斯以忽素朴乎？ 故古人有叹曰：甚矣，何物之难悟也。 既知不圣为不圣，未知圣之不圣也； 既知不仁为不仁，未知仁之为不仁也。 故绝圣而后圣功全，弃仁而后仁德厚。 夫恶强非欲不强也，为强则失强也； 绝仁非欲不仁也，为仁则伪成也。 有其治而乃乱，保其安而乃危。 后其身而身先，身先非先身之所能也。 外其身而身存，身存非存身之所为也。 功不可取，美不可用，故必取其为功之母而已矣。 篇云既知其子，而必复守其母，寻斯理也，何往而不畅哉？ 老子微旨例略竟 #1天：《云笈七签》本作『夫』。 #2此句，《云笈七签》本作『必生乎无形，形由乎无名』。 #3苞：《云笈七签》本作『包』。 #4此句，《云笈七签》本作『用大音则风俗移』。 #5此句，《云笈七签》本作『证今可以知古』。 #6绵邈：《云笈七签》本作『缅邈』。 #7微：《云笈七签》本作『妙』。 #8篇云：《云笈七签》本作『经云』。 #9老子：《云笈七签》本作『老君』。 #10刑：《云笈七签》本作『形』。 #11名：《云笈七签》本作『言』。 #12矫：《云笈七签》本作『智』。 #13趣：《云笈七签》本作『趋』。 #14债：《云笈七签》本作『愤』。 #15：《云笈七签》本作『析』。 #16此句，《云笈七签》本作『本始以尽终』。 #17率：《云笈签》本作『牵』。 #18此句，《云笈七签》本作『故使同趋而感发于事者』。 #19此句，《云笈七签》本作『非尊之所尊』。 此后，至『道，称之大者也。 』脱，然於此下有『皆理之大者也』。 #20此后，《云笈七签》本脱。",
      "translated_text": "Abandoning the root to attack the branches—\nthough one exhausts sagely wisdom, this only deepens the disaster.\nHow much worse for those whose methods fall below this?\n\nWhen governed by simplicity and plainness,\naffairs naturally rectify without effort;\nwhen attacked by sagely wisdom,\nthe people grow desperate and cunning flourishes.\nThus, simplicity and plainness may be embraced,\nwhile sagely wisdom may be discarded.\n\nWhen scrutiny is lax, evasion is likewise lax;\nwhen one exhausts keen perception,\nescape grows equally keen.\nLaxity harms plainness little,\nbut strictness deepens artifice and deceit.\n\nAre those who wield the arts of utmost scrutiny and hidden probing\nonly the sagely and wise?\nThe harm they bring—how could it be reckoned?\n\nA hundredfold profit is not yet considered much.\nIf one cannot distinguish names,\none cannot speak of principles;\nif one cannot fix names,\none cannot discuss realities.\n\nAll people are born from form,\nyet no form is born from people.\nThus, for every name there is a corresponding form,\nfor every form there is its proper place.\nKindness cannot be called sageliness,\nwisdom cannot be called kindness—\neach has its own reality.\n\nTo perceive the subtlest traces is the utmost of clarity;\nto probe hidden depths is the utmost of foresight.\nIs one who exhausts utmost clarity not sagely?\nIs one who exhausts utmost foresight not wise?\nBy examining realities and fixing names,\none may discard sageliness without confusion.\n\nWhen the virtue of honest plainness is not manifest,\nwhile the beauty of reputation and conduct is exalted,\npeople cultivate what is exalted in hopes of praise,\npursue what is esteemed in pursuit of profit.\nYearning for praise and profit,\nthey labor at their conduct—\nthe more their reputation shines, the more sincerity recedes;\nthe greater the profit, the more hearts compete.\nFathers and sons, brothers—\naffection loses its truth,\nfilial piety cannot bear sincerity,\ncompassion cannot bear reality—\nall summoned by the exaltation of reputation and conduct.\n\nThe worry that customs grow thin while names arise,\nthat exalting benevolence and righteousness only deepens deceit—\nhow much worse for methods that scorn these?\n\nThus, to abolish benevolence and discard righteousness\nto restore filial piety and compassion\nis not yet considered grand.\n\nWhen city walls grow tall, siege engines arise;\nwhen profit flourishes, schemes deepen.\nIf one abides in desirelessness,\neven rewards will not tempt theft;\nif private desires prevail,\nclever profit only grows more obscured.\nThus, abolish cleverness and discard profit,\nreplace them with few desires—\nthen thieves will vanish,\nthough this is not yet worthy of praise.\n\nSageliness and wisdom are the finest of talents,\nbenevolence and righteousness the greatest of conduct,\ncleverness and profit the best of utility.\nIf the root does not endure,\nyet these three excellences arise,\nthe harm remains the same—\nhow much more for methods that, for the sake of profit,\nneglect plainness?\n\nThus, the ancients sighed:\nHow profound—why are things so hard to comprehend?\nOne knows that the unsagely are unsagely,\nyet does not know that the sagely are not sagely;\none knows that the unkind are unkind,\nyet does not know that kindness is not kindness.\n\nOnly by abolishing sageliness is sagely achievement complete;\nonly by discarding benevolence is benevolent virtue profound.\nOne despises strength not because one desires weakness,\nbut because striving for strength loses strength;\none abolishes benevolence not because one desires unkindness,\nbut because practicing benevolence breeds falsity.\n\nThere is order that leads to chaos,\nsecurity that leads to danger.\nPutting oneself last, one comes first—\ncoming first is not something the first can achieve.\nExcluding oneself, one endures—\nendurance is not something the enduring can effect.\nMerit cannot be seized,\nexcellence cannot be employed.\nThus, one must grasp only the mother of merit.\n\nThe text says: knowing the child,\none must return to guard the mother.\nTracing this principle—\nwhere does it not flow smoothly?\n\nLaozi’s subtle purport concludes here.",
      "overlap_context": "he branches*.\n\nThe way of simplicity is not manifest,\nyet the allure of desires is not concealed.\nThough one exhausts sagely brightness to scrutinize it,\nor depletes wisdom and foresight to attack it,\nthe clever grow more refined in thought,\nthe false more varied in deception.\nThe more fiercely it is attacked,\nthe more diligently it is evaded.\nThus, the foolish and wise deceive one another,\nthe six relations grow suspicious,\nsimplicity scatters, truth departs,\nand affairs harbor their treachery.",
      "start_char": 2444,
      "end_char": 3630,
      "start_sentence": 135,
      "end_sentence": 196,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.77460813522339,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\老子秘旨例略.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}