{
  "source_id": "老子注",
  "source_file": "chunked_daozang\\老子注.json",
  "total_chunks": 35,
  "total_original_chars": 17851,
  "total_translated_chars": 67692,
  "total_translation_time": 368.3323395252228,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\老子注.txt",
    "category": "藏外"
  },
  "full_translation": "A Commentary on the *Laozi* by Chen Li of the Qing Dynasty\n*Laozi Zhu* (Commentary on the *Laozi*), One Scroll\nBy Chen Li of Panyu\nManuscript copy by the Shi family, 1930\n\n**Chapter One**\nThe Dao that can be spoken is not the eternal Dao;\nThe name that can be named is not the eternal name.\n[This means the eternal Dao cannot be spoken, nor can the eternal name be named. The eternal Dao and eternal name refer to the Dao. Chapter Twenty-Five states: \"There is a thing, formlessly formed, born before heaven and earth. I know not its name, so I style it 'Dao.'\" Such is the case. The Dao precedes heaven and earth and remains unchanged through all ages—hence it is called \"eternal.\" After the existence of heaven and earth, myriad transformations arise without end; its Dao may be spoken, its name may be named, yet these are mutable and not eternal.]\n\n\"Nameless\" is the beginning of heaven and earth;\n\"Named\" is the mother of the myriad things.\n[He Shanggong’s commentary states: \"Nameless\" refers to the Dao; \"named\" refers to heaven and earth.]\n\nThus, by constantly dwelling in non-being, one may observe its mystery;\nBy constantly dwelling in being, one may observe its manifestations.\n[Non-desire means restraining one’s desires. By constantly restraining desires, one may observe the subtleties of the Dao. Yet all things possess desire—emerging into life and entering into death—so one must also constantly observe the tendencies of things through one’s own desires. He Shanggong says: \"Manifestations\" (*jiao*) means \"tendencies\" (*gui*), observing the tendencies of worldly customs. Lu [Huiqing] says: \"*Jiao* means 'minor paths,' 'boundaries,' or 'subtle mysteries.'\"]\n\nThese two emerge from the same source yet bear different names;\nBoth are called the profound.\nProfounder still is the gate of all mysteries.\n[He Shanggong says: \"The two\" refers to having desire and being without desire. Li comments: In restraint, it is called \"non-being\"; in its inherent state, it is called \"being.\"]\n\n**Chapter Two**\n\nAll under heaven know beauty as beauty, and already this is ugliness;\nAll know goodness as goodness, and already this is not goodness.\n[Knowing beauty and goodness leads to competition in concealing goodness, losing their naturalness.]\n\nThus, being and non-being give rise to each other,\nDifficulty and ease complete each other,\nLong and short form each other,\nHigh and low incline toward each other,\nTones and voices harmonize with each other,\nFront and back follow each other.\n[These six are the natural tendencies of the myriad things.]\n\nTherefore, the sage abides in non-action,\nPractices the teaching without words,\nAnd the myriad things arise without refusal.\n[They move of themselves without ceasing.]\nThey give life yet do not possess,\nAct yet do not rely,\nAccomplish yet do not dwell—\nOnly because they do not dwell,\nDo they not depart.\n\n**Chapter Three**\n\nDo not exalt the worthy, and the people will not contend;\nDo not prize rare goods, and the people will not steal;\nDo not display what is desirable,\nAnd the people’s hearts will not be disturbed.\n[All editions lack the character *min* (\"people\"); following the official edition.]\n\nThus, in the governance of the sage:\nHe empties their hearts,\n[Removes cravings, eliminates chaos and confusion.]\nFills their bellies,\n[Embraces the Dao and holds to unity, guarding the five spirits.]\nWeakens their ambitions,\n[Harmonious, yielding, and humble, not grasping authority.]\nStrengthens their bones,\n[Cherishes essence and values generosity, filling the marrow and firming the bones.]\nSo that the common people remain without knowledge and without desire,\nAnd those with knowledge dare not act.\n[The wise delight in action; restrain them so they dare not act.]\nAct through non-action, and nothing will be left ungoverned.\n\n**Chapter Four**\n\nThe Dao is empty, yet its use is inexhaustible.\n[“Empty” means “void.”]\nAbysmal, it seems the ancestor of the myriad things.\nIt blunts their sharpness,\n[Sharpened by craft, they cannot long endure—thus it blunts them.]\nUntangles their entanglements,\nHarmonizes their radiance,\nMingles with their dust.\nDeep, it seems perhaps to exist.\nI do not know whose child it is—\n[Laozi says: I do not know from whence it arises.]\nIt appears before the Lord of Heaven.\n\n**Chapter Five**\n\nHeaven and Earth are not humane—\nThey treat the myriad things as straw dogs.\nThe sage is not humane—\nThey treat the common people as straw dogs.\n[Straw and dogs are the basest of things.]\n\nBetween Heaven and Earth,\nIs it not like a bellows?\n[Wang Bi says: *Tuo* refers to the \"piston bellows.\"\n*Yue* refers to the \"musical pipe.\"]\nEmpty yet never exhausted,\n[He Shanggong says: Without any time of depletion.\n*Qu* (屈), *Fuwen* (《释文》) writes as *jue* (掘), noting He Shanggong’s version as *jue*.]\nMoving, it brings forth ever more.\nThe more words are spoken, the sooner they reach their limit—\n[Lu Deming says: Wang Bi says: \"principle and number.\"\nGu Huan says: \"circumstance and fate.\"]\nBetter to hold fast to the center.\n\n**Chapter Six**\n\nThe Valley Spirit does not die—\n[Valley (*gu*) means \"emptiness.\"\nValley Spirit (*gushen*) is the spirit of emptiness.\n*Fuwen*: *Gu*, pronounced *gu* (古木反), refers to that which is hollow at the center.]\nThis is called the Dark Womb.\n[Dark (*xuan*) means \"profound and deep.\"\nWomb (*pin*) means \"aperture.\"]\nThe gateway of the Dark Womb\nIs called the root of Heaven and Earth.\n[He Shanggong says: The gates of nose and mouth\nAre the passages through which the primordial *qi* of Heaven and Earth flows in and out.]\nSubtly continuous, as if existing—\n[He Shanggong says: The breath of nose and mouth should be soft and fine,\nAs if present, yet as if absent.\nUse the *qi* with ease and leisure,\nNot with haste, urgency, or strain.]\nIts use is never exhausted.\n\n**Chapter Seven**\n\nHeaven and Earth endure—\nHeaven and Earth endure so long\nBecause they do not live for themselves.\n[Heaven and Earth give life to things yet do not claim life for themselves.]\nThus they live long.\nTherefore the sage places their person last yet finds themselves first,\nSets their person aside yet preserves it.\nIs this not because they are selfless?\nThus they fulfill their self.\n[The essence of Laozi’s teaching lies in fulfilling the self.]\n\n**Chapter Eight**\n\nThe highest virtue is like water.\nWater benefits the ten thousand things yet does not contend,\nFlowing where the many shun.\n[Wang Bi: People shun the lowly.\nThus it nearly approaches the Dao.\nHe Shanggong: The nature of water nearly aligns with the Dao.]\nIt dwells in goodness,\nIts heart is deep as an abyss,\n[He Shanggong: Water is profoundly empty; the abyss is deep and clear.]\nIts giving is kind,\n[He Shanggong: The ten thousand things receive life from water, aligning with emptiness, not with fullness.]\nIts speech is true,\n[He Shanggong: Water reflects shadows within; forms do not lose their essence.]\nIts governance is just,\n[He Shanggong: Nothing remains unwashed; all is cleansed and level.]\nIts work is capable,\n[He Shanggong: It can be square or round, bending or straight, adapting to form.]\nIts movement is timely.\n[He Shanggong: It scatters in summer and congeals in winter, moving in accord with the seasons, never losing the celestial timing.]\nTruly, because it does not contend,\nIt is without blame.\n\n**Chapter Nine**\n\nTo hold and fill it to the brim\nIs not as good as stopping in time.\n[Wang Bi: To hold means not to lose virtue; yet even without losing virtue, one should act as if without virtue or merit.]\nTo grind and sharpen it,\n[Chuai (*揣*) means \"to grind.\"\nGu says: \"to refine.\"\nRui (*锐*): *Shiwen* reads as *yue* (悦), noting He Shanggong’s version has *rui* (锐).]\nCannot be long preserved.\nWhen gold and jade fill the hall,\nNone can guard them.\nWealth and honor breed arrogance,\nBringing misfortune upon oneself.\nTo withdraw once the work is done—\nThis is the Dao of Heaven.\n[Wang Bi: The four seasons alternate; when the work is complete, they shift away.]\n\nTo carry the soul and embrace the One—\nCan this be done without separation?\n[The \"One\" is that which is called \"the valley spirit never dies.\"\nThe human body carries the *hun*-soul and embraces the spirit—\nCan this be done without separation?]\n\nTo concentrate the *qi* and attain softness—\nCan one be like an infant?\nCan the *qi* remain undivided,\nAnd reach the utmost softness and weakness of an infant?\n\nTo cleanse and purify the mysterious mirror—\nCan this be done without flaw?\n[He Shanggong says: One should wash the heart,\nMaking it pure and clean.\nThe heart dwells in the realm of profound darkness,\nSurveying and knowing the ten thousand things—\nThus it is called the \"mysterious mirror.\"]\n\nTo love the people and govern the state—\nCan this be done without knowledge?\n[Chapter Sixty-Five: \"To govern the state with cleverness\nIs the state’s ruin.\"]\n\nThe gate of Heaven opens and closes—\nCan one be without the feminine?\n[The \"gate of Heaven\" is unclear.\nHe Shanggong says: The gate of Heaven refers to the nostrils.\nWang Bi says: The gate of Heaven is that by which all under Heaven follows.\n\"Opening and closing\" refers to the juncture of order and chaos.\nThe feminine responds but does not initiate,\nFollowing but not acting—\nDoes this mean the gate of Heaven opens and closes,\nAnd one can *be* the feminine?\nThe *Guanben* edition notes: According to the commentary, *wu* (无) seems to read as *wei* (为).\nLi says: *Wei* (为) is correct.\n\"To be the feminine\" is what is called \"guarding the feminine.\"\nThe interpretations of He Shanggong and Wang Bi remain unresolved.]\n\nTo understand the four directions and be all-pervading—\nCan this be done without action?\n\nTo give life and nurture it,\nTo give life yet not possess;\nTo act yet not rely;\nTo lead yet not dominate—\nThis is called the profound *virtue*.\n\nThirty spokes join in a single hub—\nIt is where there is *wu* that the cart finds its use.\nClay is shaped to form a vessel—\nIt is where there is *wu* that the vessel finds its use.\nDoors and windows are cut to make a room—\nIt is where there is *wu* that the room finds its use.\nThus, \"having\" brings advantage,\nWhile *wu* brings use.\n\nThe five colors blind the eye;\nThe five tones deafen the ear;\nThe five flavors dull the palate.\nRacing and hunting madden the heart;\nRare goods impede conduct.\nTherefore, the sage attends to the belly, not the eye—\nThus, he rejects that and embraces this.\n\nFavor and disgrace are both as startling—\nRegard great trouble as you do your own body.\n\nWhat does it mean, \"favor and disgrace are both as startling\"?\nFavor is inferior—\nGaining it is startling,\nLosing it is startling.\nThis is what is meant by \"favor and disgrace are both as startling.\"\n\nWhat does it mean, \"regard great trouble as you do your own body\"?\nThe reason I have great trouble\nIs that I have a body.\nIf I had no body,\nWhat trouble could I have?\n\nThus, one who values their body as the world\nMay be entrusted with the world;\nOne who cherishes their body as the world\nMay be charged with the world.\n\n---\n\nLook at it, yet see it not—call it the Level.\nListen to it, yet hear it not—call it the Rare.\nGrasp at it, yet hold it not—call it the Subtle.\nThese three cannot be fully examined,\nSo they merge into one.\nAbove, it is not bright;\nBelow, it is not dark.\nEndless, unnameable—\nIt returns to nothingness.\nThis is called the formless form,\nThe imageless image,\nCalled the indistinct and evanescent.\nMeet it, yet see not its head;\nFollow it, yet see not its rear.\nHold to the ancient Dao to master present being,\nAnd know the ancient beginning—\nThis is called the thread of the Dao.\n\n---\n\nThe ancients who were adept as scholars\nWere subtly mysterious, profoundly penetrating,\nSo deep they could not be known.\nOnly because they could not be known\nDo I force a description of their demeanor:\n\nHesitant, as if crossing a winter stream;\nWary, as if fearing neighbors on all sides;\nReserved, as if a guest;\nYielding, as ice about to melt;\nSimple, as uncarved wood;\nVast, as a valley;\nOpaque, as muddied water.\n\nWho can still the turbid and gradually clarify it?\nWho can remain at rest and slowly bring forth life?\n\nThose who preserve this Dao do not desire fullness.\nOnly because they are not full\nCan they be worn yet not newly made.\n\nReach emptiness to its utmost, guard stillness with sincerity.\nAll things arise together—\nI thereby observe their return.\nNow, things flourish in abundance,\nEach returning to its root.\n\nReturning to the root is called stillness;\nThis is called restoring the mandate.\nRestoring the mandate is called constancy.\nKnowing constancy is called clarity;\nNot knowing constancy, reckless action brings misfortune.\nKnowing constancy, one is all-embracing;\nEmbracing, one is impartial;\nImpartial, one is kingly;\nKingly, one is celestial;\nCelestial, one is of the Dao;\nOf the Dao, one endures—\nTo the end of life, without peril.\n\nIn the highest antiquity, the people knew only that rulers existed.\nNext, they drew near and praised them;\nNext, they feared them;\nNext, they reviled them.\nWhere trust is insufficient,\nThere will be distrust.\n\nHow weighty their words!\nTheir work is accomplished, their affairs completed,\nYet the people all say, “We are naturally thus.”\n\nChapter Eighteen\nWhen the great Dao is abandoned, there is benevolence and righteousness.\nWhen cleverness and knowledge arise, there is great artifice.\nWhen the six relations are not in harmony, there is filial piety and compassion.\nWhen the state is benighted and disordered, there are loyal ministers.\n\nChapter Nineteen\nCut off sageliness, cast away knowledge—\nThe people will benefit a hundredfold.\nCut off benevolence, cast away righteousness—\nThe people will return to filial piety and compassion.\nCut off skill, cast away profit—\nThere will be no thieves or bandits.\nThese three, as cultural refinements, are insufficient;\nThus, let there be that to which they belong:\nManifest plainness, embrace simplicity,\nReduce self-interest, diminish desires.\n\nChapter Twenty\nCut off learning, and there will be no worries.\nHow great is the difference between compliance and flattery?\nHow vast is the distance between good and evil?\nWhat others fear, one cannot but fear—\nVast and boundless, it is not yet ended!\nThe multitude bustle and rejoice,\nAs if feasting on the grand sacrifice,\nAs if ascending the springtime terrace.\nI alone remain still, showing no sign,\nLike an infant who has not yet learned to smile,\nWeary and forlorn, as if with no place to return.\nThe multitude all have more than enough,\nWhile I alone seem to have lost everything.\nWhat a fool’s heart I possess—so muddled!\nThe common folk are bright and clear,\nWhile I alone am dull and dim.\nThe common folk are sharp and discerning,\nWhile I alone am dull and obscure,\nVast as the sea,\nDrifting as if without end.\nThe multitude all have their uses,\nWhile I alone am stubborn and coarse.\nI alone differ from others,\nYet I value the nourishment of the Mother.\n\nChapter Twenty-One\nThe bearing of great virtue\nFollows only the Dao.\nAs a thing, the Dao is\nElusive and evanescent.\nEvanescent, elusive—\nWithin it there are images.\nElusive, evanescent—\nWithin it there are things.\nDark and obscure—\nWithin it there is essence.\nIts essence is most real,\nWithin it there is trust.\nFrom ancient times until now,\nIts name has never departed,\nBy which we may observe the origin of all things.\nHow do I know the form of the origin of all things?\nBy this.\n\nChapter Twenty-Two\n\n“To yield is to be preserved whole;\nTo be bent is to become straight;\nTo be hollow is to be filled;\nTo be tattered is to be renewed;\nTo want is to possess;\nTo have abundance is to be perplexed.”\n\nThus the sage embraces the One and becomes the model for all under heaven.\nHe does not display himself, and so is luminous;\nHe does not assert himself, and so is distinguished;\nHe does not boast, and so achieves merit;\nHe does not vaunt himself, and so endures.\nIt is precisely because he does not contend\nThat none under heaven can contend with him.\nThe ancient saying “To yield is to be preserved whole”—\nIs it an empty phrase?\nTruly, to be preserved whole is to return to it.\n\nChapter Twenty-Three\nSparse speech accords with nature.\nFierce winds do not last the morning;\nTorrential rains do not last the day.\nWho brings these about?\nHeaven and earth.\nIf even heaven and earth cannot endure long,\nHow much less can man?\nTherefore, those who align with the Dao:\nThose of the Dao are one with the Dao;\nThose of virtue are one with virtue;\nThose of loss are one with loss.\nThose one with the Dao—the Dao delights in attaining them;\nThose one with virtue—virtue delights in attaining them;\nThose one with loss—loss delights in attaining them.\nWhere trust is insufficient,\nThere will be those who do not trust.\n\nChapter Twenty-Four\nOne who stands on tiptoe does not stand firm;\nOne who strides cannot walk far;\nOne who displays himself is not luminous;\nOne who asserts himself is not distinguished;\nOne who boasts achieves no merit;\nOne who vaunts himself does not endure.\nIn the Way, these are called\n“Superfluous food and redundant conduct.”\nSome things despise them—\nTherefore those with the Dao do not abide in them.\n\nChapter Twenty-Five\nThere is a thing formed in chaos,\nBorn before heaven and earth.\n\nSilent, oh so vast!\nStanding alone, unchanging,\nCircling endlessly without weariness.\nIt may be called the Mother of all under heaven.\nI know not its name—\nI style it \"Dao,\"\nAnd by force name it \"Great.\"\nGreat means flowing,\nFlowing means far-reaching,\nFar-reaching means returning.\nThus the Dao is great,\nHeaven is great,\nEarth is great,\nAnd the king, too, is great.\nWithin the realm, there are four greats,\nAnd the king occupies one among them.\nMan models himself on earth,\nEarth models itself on heaven,\nHeaven models itself on the Dao,\nThe Dao models itself on spontaneity.\n\nChapter Twenty-Six\nWeight is the root of lightness;\nStillness is the ruler of restlessness.\nThus the sage travels all day\nWithout parting from the heavy supply wagon.\nThough there be splendid sights,\nHe dwells serenely, transcendent.\nHow could the lord of ten thousand chariots\nTreat his person lightly before all under heaven?\nTo be light is to lose one’s root;\nTo be restless is to lose one’s ruler.\n\nChapter Twenty-Seven\nIn skillful movement,\nNo tracks are left;\n\nIn skillful speech,\nNo flaws are found;\nIn skillful reckoning,\nNo counting rods are used;\nIn skillful closure,\nNo bolts or bars are needed, yet none can open;\nIn skillful binding,\nNo cords or knots are tied, yet none can untie.\nThus the sage is ever skillful in saving people,\nAnd so none are abandoned;\nEver skillful in saving things,\nAnd so nothing is discarded.\nThis is called inheriting enlightenment.\n\nTherefore, the good person is the teacher of the not-good,\nAnd the not-good person is the resource of the good.\nIf one does not value one’s teacher,\nNor cherish one’s resource,\nThough wise, one is greatly deluded.\nThis is called the essential mystery.\n\nChapter Twenty-Eight\nKnow the masculine,\nYet hold to the feminine,\nAnd be a valley to all under heaven.\nBeing a valley to all under heaven,\nOne’s constant virtue never departs,\nAnd one returns to the state of infancy.\n\nKnow the bright,\nYet hold to the dark,\nAnd be a model to all under heaven.\nBeing a model to all under heaven,\nOne’s constant virtue never errs,\nAnd one returns to the boundless.\n\nKnow glory,\nYet hold to disgrace,\nAnd be a valley to all under heaven.\nBeing a valley to all under heaven,\nOne’s constant virtue is then fulfilled,\nAnd one returns to the uncarved block.\n\nWhen the uncarved block is scattered, it becomes vessels;\nThe sage, using them, becomes a leader of officials.\nThus the great system makes no cuts.\n\nThose who would take all under heaven and act upon it—I see they will not succeed.\nAll under heaven is a sacred vessel; it cannot be acted upon.\nThose who act upon it ruin it; those who grasp it lose it.\n\nThus, things may lead or follow,\nmay warm or chill,\nmay strengthen or weaken,\nmay be secure or imperiled.\n\nTherefore, the sage discards excess, extravagance, and arrogance.\n\n---\n\nChapter Thirty\nOne who assists a ruler through the Dao\ndoes not dominate all under heaven with military force.\nSuch affairs tend to rebound:\nwhere armies encamp, brambles grow;\nin the wake of great armies, years of famine follow.\n\nThe good achieve their aim and stop—\nthey dare not seize dominance through force.\nHaving achieved their aim, they do not boast;\nhaving achieved their aim, they do not vaunt;\nhaving achieved their aim, they do not grow arrogant;\nhaving achieved their aim, they act only when compelled;\nhaving achieved their aim, they do not force.\n\nWhen things reach their prime, they age—\nthis is called not following the Dao.\nWhat does not follow the Dao perishes early.\n\nThe fine weapon is an inauspicious instrument—\nsome beings detest it,\nthus one who embodies the Dao does not dwell with it.\n\nThe noble person at rest honors the left,\nbut in deploying troops, honors the right.\nWeapons are inauspicious instruments,\nnot the instruments of the noble person.\nOnly when compelled does one employ them,\nand even then, tranquility is prized.\nTo triumph yet not exult—\nthose who exult in victory delight in slaughter.\nOne who delights in slaughter\ncannot realize their will under heaven.\n\nAuspicious affairs esteem the left,\ninauspicious affairs esteem the right.\nThe deputy general stands on the left,\nthe supreme general on the right—\nthis is to position them as if for mourning rites.\nWhen multitudes are slain,\none presides over them with grief and sorrow;\nwhen victory is won, one treats it with mourning rites.\n\nChapter Thirty-Two\nThe Dao is eternally nameless.\nThough the uncarved block is small,\nnone under heaven can make it a servant.\nIf lords and kings could guard it,\nthe myriad things would of themselves submit.\nHeaven and earth unite\nto send down sweet dew,\nand the people, without being commanded, distribute it evenly.\n\nOnce the system of names begins,\nnames too will have their limits.\nKnowing the limit, one may avoid peril.\nThe Dao’s presence in the world\nis like valley streams flowing to rivers and seas.\n\nChapter Thirty-Three\nOne who knows others is wise,\nbut one who knows oneself is enlightened.\nOne who conquers others has force,\nbut one who conquers oneself is strong.\nOne who knows contentment is rich.\nOne who acts with vigor has resolve.\nOne who does not lose their place endures.\nOne who dies yet does not perish enjoys long life.\n\nChapter Thirty-Four\nThe great Dao flows everywhere,\nto left and right alike.\nThe myriad things depend on it for life, yet it does not refuse them.\nIts work is accomplished, yet it claims no possession.\nIt clothes and nourishes the myriad things yet does not lord over them—\nthus it may be called small.\nThe myriad things return to it, yet it does not lord over them—\nthus it may be called great.\nBecause it never regards itself as great,\nit is able to fulfill its greatness.\n\nChapter Thirty-Five\nHold to the great image,\nand all under heaven will come to you.\nThey come without harm,\nand find peace, safety, and great abundance.\nMusic and fine food\nmay make the passing traveler pause.\nBut when the Dao is spoken,\nit is so bland as to seem flavorless.\nLook at it—it cannot be seen.\nListen to it—it cannot be heard.\nUse it—it cannot be exhausted.\n\nChapter Thirty-Six\nTo intend to contract it,\none must first surely expand it;\nto intend to weaken it,\none must first surely strengthen it;\nto intend to abolish it,\none must first surely exalt it;\nto intend to seize it,\none must first surely give it.\nThis is called subtle illumination—\nthe hidden brightness where schemes lie concealed within, never revealed without.\nThe soft and weak overcome the hard and strong.\nFish must not be taken from the depths—\nthey must not lose their place of reliance.\nThe state’s sharp instruments must not be shown to others.\nTo show them is to risk losing them.\n\nChapter Thirty-Seven\nThe Dao ever acts without acting, yet nothing is left undone.\nShould lords and kings hold fast to it,\nthe myriad things will transform of themselves.\nTransformed, should desire arise,\nI shall press it down with the nameless uncarved block.\nThe nameless uncarved block—\nit too will be without desire.\nWithout desire, through stillness,\nall under heaven will settle of itself.\n\nChapter Thirty-Eight\nHighest virtue does not act as virtue—\nthus it possesses virtue.\nLower virtue does not lose virtue—\nthus it possesses no virtue.\nHighest virtue acts without acting and without purpose.\nLower virtue acts with purpose and intention.\nHighest benevolence acts without purpose,\nhighest righteousness acts with purpose.\nHighest ritual acts, yet if none respond,\nit rolls up its sleeves and drags them along.\n\nThe *Hanfeizi* states: \"Benevolence (*ren*) means to delight in loving others from the heart, to rejoice in their good fortune and grieve at their misfortune—an impulse the mind cannot suppress, not done for the sake of reward.\" It further says: \"Righteousness (*yi*) is appropriateness. Acting as is appropriate, thus it is called 'highest righteousness.' It acts with purpose and intention.\" Wang [Bi] comments: \"Ritual (*li*) exalts refined reverence; when reciprocation is lacking, resentment arises. Thus it is called 'highest ritual.' When none respond, it rolls up its sleeves and drags them along.\"\n\nTherefore, the loss of the Dao gives rise to virtue;\n**[Wang comments: \"The greatest of all—could this not be the Dao? Though its achievements are vast and its wealth boundless, possessing the myriad things, each still attains its own virtue. Yet if it cannot employ non-action or abandon purpose as its essence, then it has lost its greatness. This is what is meant by 'the loss of the Dao gives rise to virtue.'\" ]**\nthe loss of virtue gives rise to benevolence,\nthe loss of benevolence gives rise to righteousness,\nthe loss of righteousness gives rise to ritual.\nRitual is the thinning of loyalty and trust, the beginning of chaos.\nForethought is the flower of the Dao, the onset of folly.\nThus the great person dwells in the substantial, not the superficial;\nin the fruit, not the flower.\nTherefore, they discard that and embrace this.\n\nChapter Thirty-Nine\nOf old, those who attained the One:\nHeaven attained the One and became clear,\nEarth attained the One and became tranquil,\nthe spirits attained the One and became numinous,\nthe valleys attained the One and became full,\nthe myriad things attained the One and came to life,\nlords and kings attained the One and became the standard for all under heaven.\nPushing this to its limit:\nWere heaven not thus clear, it would fear splitting;\n**[Without the One, it would have no means to be clear.]**\nwere earth not thus tranquil, it would fear erupting;\nwere the spirits not thus numinous, they would fear vanishing;\nwere the valleys not thus full, they would fear drying up;\nwere the myriad things not thus alive, they would fear perishing;\nwere lords and kings not thus noble and exalted,\n**[‘Noble and exalted’ should read ‘the standard.’]**\nthey would fear toppling.\nThus the noble takes the lowly as its root,\nthe high takes the low as its foundation.\nTherefore lords and kings call themselves \"the orphaned,\" \"the widowed,\" \"the unworthy.\"\nIs this not taking the lowly as their root? Is it not so?\nThus, to amass many carriages is to have no carriage.\nDesire not to gleam like jade or glint like stone.\n**[Wang comments: \"When form exhausts its substance, this is not desired.\"]**\n\nChapter Forty\n\nThe movement of the Dao is return;\nits function is weakness.\nAll things under heaven are born from being,\nbeing is born from non-being.\n\nChapter Forty-One\n\nWhen superior scholars hear of the Dao, they diligently practice it;\nmiddling scholars hear of the Dao, and it seems to exist or not;\ninferior scholars hear of the Dao, and they laugh loudly at it.\nIf it were not laughed at, it would not suffice to be the Dao!\nThus the established sayings have it:\n“The luminous Dao seems dark,\nthe advancing Dao seems to retreat,\nthe level Dao seems uneven,\nsupreme virtue resembles a valley,\ngreat purity seems sullied,\nample virtue seems insufficient,\nestablished virtue seems indolent,\nsubstance true seems altered,\nthe great square has no corners,\nthe great vessel is late in completion,\nthe great tone is soundless,\nthe great image has no form.”\nThe Dao is hidden and nameless.\nOnly the Dao is good at bestowing and completing.\n\nChapter Forty-Two\n\nThe Dao gives birth to the One,\nthe One gives birth to the Two,\nthe Two gives birth to the Three,\nthe Three gives birth to the myriad things.\nThe myriad things bear yin and embrace yang,\nand through the blending of qi they achieve harmony.\nWhat people dislike are only “the orphaned,” “the widowed,” and “the unworthy,”\nyet kings and dukes use these as their titles.\nThus things may be diminished yet gain,\nor increased yet lose.\nWhat others teach, I also teach:\n“The strong and violent do not meet a natural death.”\nI take this as the father of all teachings.\n\nChapter Forty-Three\n\nThe softest under heaven gallops through the hardest under heaven.\nNon-being enters where there is no gap.\nThrough this I know the benefit of non-action.\nTeaching without words,\nthe benefit of non-action—\nfew under heaven attain these.\n\nChapter Forty-Four\n\nFame or self—which is dearer?\nSelf or wealth—which is greater?\nGain or loss—which is more harmful?\nThus excessive love incurs great cost,\nhoarding much incurs heavy loss.\nKnowing contentment brings no disgrace,\nknowing when to stop brings no danger—\nthis is how to endure long.\n\nChapter Forty-Five\n\nGreat perfection seems flawed, yet its use is inexhaustible;\ngreat fullness seems empty, yet its use is unending.\nGreat straightness seems bent,\ngreat skill seems clumsy,\ngreat eloquence seems inarticulate.\nRestlessness overcomes cold,\nstillness overcomes heat—\npurity and stillness set the standard for all under heaven.\n\nChapter Forty-Six\n\nWhen the Way prevails under heaven,\nwarhorses are retired to fertilize the fields.\nWhen the Way is lost under heaven,\nwarhorses breed on the outskirts.\nNo misfortune is greater than not knowing contentment;\nno fault is greater than the desire for gain.\nThus, the contentment of knowing contentment is ever content.\n\nChapter Forty-Seven\n\nWithout stepping outside, one knows all under heaven.\nWithout gazing through the window, one sees the Way of heaven.\nThe farther one goes, the less one knows.\nTherefore the sage knows without traveling,\nnames without seeing,\naccomplishes without acting.\n\nChapter Forty-Eight\n\nIn the pursuit of learning, one gains day by day.\nIn the pursuit of the Way, one loses day by day.\nLosing and losing again,\nuntil one reaches non-action.\nThrough non-action, nothing is left undone.\nTo take all under heaven, one must act without ado.\nWhen there is ado, it is no longer sufficient to take all under heaven.\n\nChapter Forty-Nine\n\nThe sage has no constant mind,\nbut takes the mind of the people as their own.\nThe good I treat as good,\nthe not-good I also treat as good—thus attaining virtue in goodness.\nThe trustworthy I trust,\nthe untrustworthy I also trust—thus attaining virtue in trust.\nThe sage, in the world,\ncontracts their spirit for the world to harmonize their mind.\nThe people all fix their ears and eyes upon them,\nand the sage treats them all as children.\n\nChapter Fifty\n\nEmerging into life, entering into death.\n\nThe *Hanfeizi* states: \"Humans begin with life and end with death. The beginning is called 'emerging,' the end is called 'entering.'\"\n\nOf those who follow the way of life, ten or three do so; of those who follow the way of death, ten or three do so. Yet among those who live, ten or three move toward the realm of death. Why is this? Because they overindulge in the pursuit of life.\n\nI have heard that those skilled in nurturing life, when traveling on land, do not encounter rhinoceroses or tigers; when entering battle, they are not struck by armor or weapons. The rhinoceros finds no place to thrust its horn, the tiger no place to sink its claws, the weapon no place to lodge its blade. Why is this? Because they do not enter the realm of death.\n\nChapter Fifty-One\nThe Dao gives them life, virtue nurtures them, things shape them, and circumstances complete them. Thus, the myriad things without exception revere the Dao and honor virtue. The Dao’s reverence, virtue’s honor—none commands them, yet they ever remain spontaneous. Therefore, the Dao gives them life, virtue nurtures them, fosters their growth, nourishes their maturity, refines and ripens them, shelters and protects them. It gives life yet does not possess, acts yet does not rely, leads yet does not dominate—this is called profound virtue.\n\nChapter Fifty-Two\nThe world has a beginning, which serves as the world’s mother. Once you grasp the mother, you know her children. Once you know the children, return to abide by the mother, and to the end of your days you will not be imperiled. Block its openings, shut its gates, and to the end of your life you will not toil. Open its openings, meddle in its affairs, and to the end of your life you will not be saved. Seeing the small is called clarity; guarding the soft is called strength. Employing its light, returning to its clarity, leaving no misfortune for the self—this is called following the constant.\n\nChapter Fifty-Three\nIf I were suddenly endowed with knowledge and walked the great Dao, only deviance would I fear. The great Dao is level, yet the people prefer shortcuts. The court is excessively adorned, the fields are excessively overgrown, the granaries are excessively empty. They wear embroidered garments, carry sharp swords, sate themselves with food and drink, and possess surplus wealth and goods—this is called the boastfulness of thieves. How far is this from the Dao!\n\nChapter Fifty-Four\n\nThe well-established cannot be uprooted; the well-embraced cannot slip away. Thus, descendants perform sacrifices without cease.\n\nCultivate it in the self, and its virtue becomes genuine;\ncultivate it in the family, and its virtue becomes abundant;\ncultivate it in the village, and its virtue becomes enduring;\ncultivate it in the state, and its virtue becomes bountiful;\ncultivate it in the world, and its virtue becomes universal.\n\nTherefore, observe the self through the self,\nobserve the family through the family,\nobserve the village through the village,\nobserve the state through the state,\nobserve the world through the world.\nHow do I know the world is thus?\nBy this.\n\nChapter Fifty-Five\nOne whose virtue is profoundly embodied is like a newborn babe.\nWasps, scorpions, vipers, and snakes do not sting;\nfierce beasts do not seize,\nbirds of prey do not strike.\nThough bones are weak and sinews soft, the grasp is firm.\nUnknowing of the union of female and male, the organ stirs—\nthis is the perfection of essence.\nCrying all day without hoarseness—\nthis is the perfection of harmony.\nTo know harmony is called the constant;\nto know the constant is called clarity.\nTo indulge life is called ominous;\nto let the mind command the qi is called force.\nWhen things reach their prime, they age—\nthis is called contrary to the Dao.\nWhat is contrary to the Dao perishes early.\n\nThe wise do not speak;\nthose who speak are not wise.\nBlock the openings,\nshut the gates,\nblunt the sharpness,\nuntangle the knots,\nsoften the glare,\nmerge with the dust—\nthis is called profound sameness.\nThus, one cannot be drawn near,\ncannot be kept distant,\ncannot be benefited,\ncannot be harmed,\ncannot be honored,\ncannot be debased.\nTherefore, one is esteemed by all under heaven.\n\nChapter Fifty-Seven\nGovern the state with uprightness,\ndeploy troops with cunning,\nwin the world through nonaction.\nHow do I know this is so?\nBy this:\nThe more taboos in the world, the poorer the people;\nthe more sharp tools the people possess, the more benighted the state;\nthe more skills and crafts people master, the more strange things arise;\nthe more laws and decrees are proclaimed,\nthe more thieves and bandits appear.\nThus the sage declares:\n“I practice nonaction, and the people transform themselves;\nI cherish stillness, and the people rectify themselves;\nI engage in no affairs, and the people enrich themselves;\nI am without desire, and the people simplify themselves.”\n\nWhen governance is muddled, the people are simple and honest.\nWhen governance is meticulous, the people are lacking and flawed.\nMisfortune—where fortune leans;\nFortune—where misfortune lurks.\nWho knows their ultimate end?\nThere is no constant norm.\nThe norm reverts to the strange,\ngoodness reverts to the ominous.\nThe people’s delusion\nhas endured for so long!\n\nThus the sage is square but does not cut,\nhas edges but does not wound,\nis straight but not overbearing,\nbright but not dazzling.\n\nChapter Fifty-Nine\nIn governing people and serving heaven,\nnothing surpasses frugality.\nOnly through frugality\ncan one be said to submit early.\nEarly submission is called the repeated accumulation of virtue.\nWith repeated accumulation of virtue, there is nothing one cannot overcome;\nwith nothing one cannot overcome, none can fathom one’s limits.\nWhen none can fathom one’s limits,\none can possess the state.\nPossessing the state’s mother,\none can endure long.\nThis is called the Way of deep roots, firm foundation,\nlong life, and enduring vision.\n\nChapter Sixty\nGoverning a great state\nis like cooking a small fish.\nWang says: Do not disturb it.\nWhen the Dao presides over the world,\nits ghosts do not manifest their numinosity.\nNot that the ghosts lack numinosity—\ntheir numinosity does not harm people.\nNot only does their numinosity not harm people,\nthe sage also does not harm people.\nAs neither harms the other,\ntheir virtues converge and return.\n\n**Chapter Sixty-One**\nA great state is the lower reaches of the river,\nthe confluence of all under heaven,\nthe female of all under heaven.\nThe female ever overcomes the male through stillness,\nfor stillness is the way of the lowly.\n\nThus, when a great state humbles itself before a small state,\nit wins the allegiance of the small state.\nWhen a small state humbles itself before a great state,\nit wins the favor of the great state.\nTherefore, some humble themselves to gain,\nwhile others gain through humility.\nA great state desires no more than to shelter and nurture others,\na small state desires no more than to serve and attend others.\nWhen both attain what they seek,\nthe greater must take the lower position.\n\n**Chapter Sixty-Two**\nThe Dao is the mystery of the ten thousand things,\nthe treasure of the good,\nthe refuge of the not-good.\nFine words can be traded in the marketplace,\nnoble conduct can elevate others.\nIf people are not good,\nwhy should they be cast aside?\nTherefore, when the Son of Heaven is established\nand the Three Ministers appointed,\nthough one may offer a jade disc preceded by a team of four horses,\nit is not equal to sitting and presenting this Dao.\nWhy was this Dao so valued in ancient times?\nDid they not say: \"Through it, one attains what one seeks,\nand with it, the guilty may be spared\"?\nThus it is prized by all under heaven.\n\n**Chapter Sixty-Three**\nAct through non-action,\nattend to affairs through non-affairs,\nsavor the flavorless.\nRegard the small as great, the few as many,\nrepay resentment with virtue.\n\nPlan for difficulty while it is still easy;\nundertake the great while it is still small.\nThe difficult affairs of the world\nmust begin with what is easy;\nthe great affairs of the world\nmust begin with what is small.\nTherefore, the sage never attempts the great,\nand thus accomplishes the great.\nOne who makes promises lightly will seldom keep faith;\none who takes things lightly will surely encounter many difficulties.\nTherefore, the sage treats all as difficult,\nand thus never meets with difficulty.\n\n**Chapter Sixty-Four**\nWhat is at rest is easily maintained;\nwhat has not yet shown signs is easily forestalled;\nwhat is fragile is easily dissolved;\nwhat is minute is easily scattered.\nAct before things arise;\ngovern before disorder begins.\n\nA tree as wide as a man’s embrace grows from a tiny shoot;\na nine-tiered terrace rises from a basket of earth;\na journey of a thousand *li* begins beneath one’s feet.\nThose who act will fail;\nthose who grasp will lose.\nTherefore, the sage acts not,\nand so does not fail;\ngrasps not,\nand so does not lose.\n\nIn their undertakings, people often fail when near completion.\nIf one is as careful at the end as at the beginning,\nthere will be no failure.\nTherefore, the sage desires what others do not desire,\ndoes not prize goods hard to obtain;\nlearns what others do not learn,\nand restores what the multitude has passed over.\nThus, he aids the spontaneity of the ten thousand things\nand does not dare to act.\n\n**Chapter Sixty-Five**\nThose of old who were skilled in the Dao\ndid not use it to enlighten the people,\nbut to make them simple.\nThe people are difficult to govern\nbecause they are too clever.\nTherefore, to govern the state with cleverness\nis the state’s ruin;\nnot to govern the state with cleverness\nis the state’s blessing.\nTo know these two is also a model.\nAlways knowing the model\nis called profound virtue.\nProfound virtue is deep, far-reaching,\nand turns back with things.\nOnly then does it attain great compliance.\n\n**Chapter Sixty-Six**\n\nThe rivers and seas can be kings of the hundred valleys\nbecause they excel at lying low.\nThus they can be kings of the hundred valleys.\nTherefore, if one wishes to be above the people,\none must speak as though below them;\nif one wishes to lead the people,\none must place oneself behind them.\nThus the sage abides above,\nand the people do not feel oppressed;\nabides ahead,\nand the people do not feel harmed.\nThus the world delights in exalting him and never tires.\nBecause he does not contend,\nno one in the world can contend with him.\n\n**Chapter Sixty-Seven**\nThe world all says my Dao is great,\nyet it seems unlike anything else.\nPrecisely because it is great,\nit seems unlike anything else.\nIf it resembled anything,\nlong ago it would have become small!\n\nI possess three treasures,\nwhich I hold fast and guard:\nthe first is compassion,\nthe second is frugality,\nthe third is not daring to be first in the world.\nWith compassion, one can be courageous;\nwith frugality, one can be expansive;\nnot daring to be first in the world,\none can become the vessel of leaders.\nNow, to abandon compassion yet seek courage,\nto abandon frugality yet seek expansion,\nto abandon the rear yet seek the front—\nthis is death.\nFor with compassion,\none triumphs in battle and stands firm in defense.\nHeaven will save such a one,\nguarding him with compassion.\n\nA good commander is not belligerent;\na good warrior is not enraged;\none who excels in victory does not contend;\none who excels in employing others places himself below them.\nThis is called the virtue of non-contention,\nthis is called employing the strength of others,\nthis is called matching the ultimate of Heaven.\n\nChapter Sixty-Nine\nOn the use of arms, there is a saying:\n“I dare not act as host but act as guest,\ndare not advance an inch but retreat a foot.”\nThis is called marching without marching,\nraising arms without arms,\nseizing without an enemy,\nwielding weapons without weapons.\nNo calamity is greater than underestimating the enemy;\nunderestimating the enemy nearly costs me my treasures.\nThus when evenly matched armies meet,\nthe side that grieves will prevail.\n\nChapter Seventy\nMy words are very easy to know,\nvery easy to practice.\nYet none in the world can know them,\nnone can practice them.\nWords have their source,\naffairs have their lord.\nIt is only through ignorance\nthat I am not known.\nThose who know me are few,\nthus I am esteemed.\nTherefore the sage wears coarse cloth while holding jade.\n\nChapter Seventy-One\nTo know yet not claim knowledge is supreme;\nto claim knowledge yet remain ignorant is a flaw.\nOnly by recognizing this flaw as a flaw\ncan one avoid being flawed.\nThe sage is not flawed,\nfor he recognizes the flaw as a flaw—\nthus he is not flawed.\n\nChapter Seventy-Two\nWhen the people do not fear authority,\ngreat authority will arrive.\nDo not constrict their dwelling,\ndo not oppress their livelihood.\nOnly by not oppressing them\nwill they not be oppressed.\nTherefore the sage knows himself but does not display himself,\nloves himself but does not exalt himself.\nThus he discards that and takes this.\n\nChapter Seventy-Three\n\nBoldness in daring leads to death;\nboldness in restraint leads to life.\nThese two may bring either benefit or harm.\nWho knows the reason for what Heaven abhors?\nEven the sage finds this difficult.\n\nThe Dao of Heaven\ndoes not contend yet excels in victory,\ndoes not speak yet excels in response,\nis not summoned yet comes of itself,\nis unhurried yet excels in planning.\nThe net of Heaven is vast and wide,\nsparse yet nothing escapes.\n\nChapter Seventy-Four\nWhen the people do not fear death,\nhow can death be used to frighten them?\nIf the people were always to fear death,\nthen those who act perversely—\ncould I seize and kill them?\nWho would dare?\nThere is always an executioner who kills.\nTo kill in place of the executioner\nis like hewing in place of the master carpenter.\nFew who hew in place of the master carpenter\ndo not injure their own hands.\n\nChapter Seventy-Five\nThe people’s hunger\ncomes from their superiors consuming too much in taxes—\nthus they hunger.\nThe people’s unruliness\ncomes from their superiors’ meddling—\nthus they are unruly.\nThe people’s disregard for death\ncomes from their excessive pursuit of life—\nthus they disregard death.\nOnly those who do not make life their pursuit\nare wiser than those who value life.\n\nChapter Seventy-Six\nWhen people are born, they are supple and weak;\nwhen they die, they are stiff and strong.\nAll things—plants and trees—\nwhen alive are supple and fragile;\nwhen dead, they are withered and dry.\nThus the stiff and strong are companions of death,\nthe supple and weak are companions of life.\nTherefore when an army is strong, it will not prevail;\nwhen a tree is strong, it invites the axe.\nThe strong and great dwell below;\nthe supple and weak dwell above.\n\nChapter Seventy-Seven\nThe Dao of Heaven—\nis it not like the drawing of a bow?\nWhat is high is pressed down,\nwhat is low is lifted up;\nwhat has excess is reduced,\nwhat is deficient is supplemented.\nThe Dao of Heaven reduces excess\nand supplements deficiency.\nThe Dao of man is not so:\nit reduces deficiency\nto serve excess.\nWho can take from their excess\nto serve all under Heaven?\nOnly those who hold the Dao.\nThus the sage acts without claiming,\nachieves without abiding,\nand does not wish to display worth.\n\nChapter Seventy-Eight\nNothing in all under Heaven\nis more supple and weak than water,\nyet in attacking the hard and strong\nnothing can surpass it—\nnothing can take its place.\nThe weak overcomes the strong,\nthe supple overcomes the hard—\nnone under Heaven does not know this,\nyet none can practice it.\nThus the sage says:\nTo bear a state’s disgrace\nis to be called lord of the altars of soil and grain;\nto bear a state’s misfortune\nis to be called king of all under Heaven.\nTrue words seem their opposite.\n\nChapter Seventy-Nine\n\nTo reconcile great resentment,\nsurely some resentment remains—\nhow can this be called good?\nThus the sage holds the left tally\nyet makes no demand upon others.\nThose with virtue oversee the tally,\nthose without virtue oversee exactions.\nThe Heavenly Dao shows no partiality,\nyet ever accords with the good.\n\nChapter Eighty\nLet the state be small, its people few,\nso that though there be tools of ten or a hundred men’s labor,\nthey are not used.\nLet the people regard death as weighty\nand not wander far away.\nThough there be boats and carriages,\nthere is nowhere to ride them;\nthough there be armor and weapons,\nthere is nowhere to array them.\nLet the people return to knotting cords and using them.\nSweet be their food,\nfine their clothing,\nsecure their dwellings,\njoyful their customs.\nNeighboring states gaze upon one another,\nthe sounds of their chickens and dogs heard across the way—\nyet the people reach old age and death\nwithout ever coming or going.\n\nChapter Eighty-One\nTruthful words are not fine,\nfine words are not truthful.\nThe good do not dispute,\nthe disputatious are not good.\nThe knowing are not learned,\nthe learned do not know.\nThe sage does not accumulate—\nhaving acted for others, they have all the more;\nhaving given to others, they possess all the more.\nThe Way of Heaven benefits and does no harm.\nThe Way of the sage acts and does not contend.\n\nThe closing quotation mark indicates, \"From this point onward, this should serve as the concluding statement of the preceding chapter.\" This interpretation is precise. Though the brushstrokes of classical scholars may seem casually gathered, they are free from the flaws of carelessness or arbitrary assertion. Master Wang, steadfast in preserving his teacher’s lineage, feared its dispersal and thus recorded and preserved it. His intent was pure and earnest—truly admirable. Having borrowed the text for a mere seven days, I instructed my second daughter, Zhao Chun, to transcribe it in full, and now append this colophon before returning it. Written on the twenty-eighth day of the intercalary sixth month, the year *gengwu* (137). Postscript by Shi Guangying.\n\n**Collation Notes:**\n(1) \"已\" appears in the *Heshang* and Wang versions; the Mawangdui manuscripts (A and B) both read \"矣.\"\n(2) \"辞\" appears in the *Heshang* and Wang versions; the Mawangdui B manuscript reads \"始.\"\n(3) \"惟\" appears in the *Heshang* version; the Wang version reads \"唯,\" as do the Mawangdui A and B manuscripts.\n(4) \"使常\" appears in the *Heshang* and Wang versions as \"常使\"; the Mawangdui A and B manuscripts read \"恒使.\"\n(5) \"知\" appears in the *Heshang* version; the Wang version reads \"智,\" while the Mawangdui A and B manuscripts follow the *Heshang* version.\n(6) \"绵\" appears in the Wang version; the *Heshang* version also reads \"绵,\" as do the Mawangdui A and B manuscripts.\n(7) The character \"能\" is missing in the original; it is supplied here following the *Heshang* and Wang versions.\n(8) \"生\" appears in the *Heshang*, Wang, and Mawangdui A and B manuscripts as \"身.\"\n(9) \"耶\" appears in the Wang version; the *Heshang* version reads \"邪,\" while the Mawangdui A and B manuscripts read \"舆.\"\n(10) \"锐\" appears in the *Heshang* version; the Wang version reads \"棁,\" and the Mawangdui A and B manuscripts read \"兑.\"\n(11) \"长\" appears in the *Heshang*, Wang, and Mawangdui A and B manuscripts; some versions read \"常.\"\n(12) This line appears in the *Heshang* version as \"功成名遂身退\"; the Wang and Mawangdui B manuscripts read \"功遂身退,\" while the Mawangdui A manuscript reads \"功述身芮.\"\n(13) \"无\" appears in the Wang version; the *Heshang* version is identical but lacks the particle \"乎.\" The Mawangdui A and B manuscripts read \"毋,\" with \"乎\" at the end of the sentence.\n(14) The *Heshang*, Wang, and Mawangdui A and B manuscripts all include the character \"之\" after \"为.\"\n(15) The character appears as such in the original. According to the *Siku Quanshu* edition of *Daode Zhenjing Zhu* (commentary by Wu Cheng of the Yuan), it should read \"拟.\" Likely a transcription error. Additionally, \"也\" in the *Siku* edition reads \"已.\"\n(16) \"豫焉\" appears in the Wang version; the *Heshang* version reads \"与兮,\" while the Mawangdui A and B manuscripts read \"曰与呵其.\"\n(17) \"容\" appears in the Wang version; the *Heshang* and Mawangdui A and B manuscripts read \"客.\"\n(18) Some versions, following the *Daozang* edition of the *Heshang* commentary, insert \"止\" after \"以.\" The *Siku* edition of the *Heshang* version, the Wang version, and the Mawangdui A and B manuscripts all omit \"止.\"\n(19) \"惟\" appears in the *Heshang* and Wang versions; the Mawangdui A manuscript reads \"唯.\"\n(20) \"谓\" appears in the *Heshang*, Wang, and Mawangdui A and B manuscripts; some versions read \"曰,\" though the source is unclear.\n(21) \"悠焉\" appears in the *Heshang* version as \"犹兮,\" in the Wang version as \"悠兮,\" and in the Mawangdui B manuscript as \"犹呵.\"\n(22) \"慧知\" appears in the *Heshang* version as \"智惠,\" in the Wang version as \"慧智,\" in the Mawangdui A manuscript as \"知快,\" and in the Mawangdui B manuscript as \"知慧.\"\n(23) \"于\" appears in the *Heshang*, Wang, and Mawangdui A and B manuscripts as \"与.\"\n(24) \"何若\" appears in the *Heshang* and Mawangdui A and B manuscripts; the Wang version reads \"若何.\"\n(25) The *Heshang* version omits \"能\"; the Wang and Mawangdui A and B manuscripts include it.\n(26) The *Heshang*, Wang, and Mawangdui B manuscripts all include \"于\" after \"况.\"\n(27) \"得\" appears in the Wang version; the *Heshang* version reads \"失.\" This passage differs in the Mawangdui A and B manuscripts.\n(28) \"企\" appears in the Wang version; the *Heshang* version reads \"跂.\"\n(29) The Wang version includes \"也\" at the end of the sentence; the *Heshang* version is identical, though \"在\" appears as \"于.\"\n(30) The *Heshang* and Mawangdui B manuscripts include \"而\" after \"立\"; the Wang version omits it.\n(31) \"王\" appears in the *Heshang*, Wang, and Mawangdui A and B manuscripts; the Song edition by Fan Yingyang reads \"人.\"\n(32) \"域\" appears in the Mawangdui A and B manuscripts as \"国.\"\n(33) \"王\" appears in the *Heshang*, Wang, and Mawangdui A and B manuscripts.\n\n(34) The Song edition by Fan Yingyang reads \"person.\" \"本\" appears identically in the Wang and Mawangdui A and B manuscripts; the *Heshang* version reads \"subject.\" The *Hanfeizi’s \"Illustrating the Dao\"* and the *Yongle Encyclopedia* quote it as \"root.\"\n\n(35) \"数\" appears identically in the Wang and Mawangdui A and B manuscripts; the *Heshang* version reads \"reckoning.\"\n\n(36) \"常\" appears as \"恒\" in the Mawangdui A and B manuscripts.\n\n(37) Some versions include \"惜\" after \"爱.\" The *Heshang*, Wang, and Mawangdui A and B manuscripts all omit \"惜.\"\n\n(38) \"婴\" appears identically in the Wang and Mawangdui A manuscripts; the *Heshang* version also reads \"婴.\"\n\n(39) The *Heshang*, Wang, and Mawangdui B manuscripts all omit the character \"无.\"\n\n(40) \"有\" appears identically in the Wang version; the *Heshang* and Mawangdui A and B manuscripts all read \"者.\"\n\n(41) \"淡\" appears identically in the Wang version; the *Heshang* version reads \"惔.\" The Mawangdui silk manuscript A reads \"恬淡\" as \"铦袭,\" while B reads \"铦.\"\n\n(42) \"天下莫能臣也\" appears identically in the Wang version; the *Heshang* version reads \"天下不敢臣.\" The Mawangdui B manuscript reads \"而天下弗敢臣.\"\n\n(43) \"夫\" appears identically in the Wang version; the *Heshang* version reads \"天.\" \"止\" appears identically in the Wang version; the *Heshang* version reads \"之.\" The Mawangdui B manuscript follows the Wang version.\n\n(44) \"止\" appears identically in the Wang version; the *Heshang* version reads \"之.\" \"可\" appears identically in the Wang version; the *Heshang* version reads \"所.\" The Mawangdui B manuscript reads \"知止所以不殆.\"\n\n(45) \"于\" appears identically in the Wang version; the *Heshang* version reads \"与.\" The Mawangdui A and B manuscripts follow the *Heshang* version.\n\n(46) \"衣养\" appears identically in the Wang version; the *Heshang* version reads \"爱养,\" and the *Yongle Encyclopedia* reads \"衣被.\" The Mawangdui A and B manuscripts read \"万物归焉而弗为主.\"\n\n(47) \"于\" appears identically in the *Heshang* and Wang versions; the Mawangdui B manuscript reads \"为.\"\n\n(48) \"为\" appears identically in the *Heshang* and Wang versions; the Mawangdui A and B manuscripts both read \"于.\"\n\n(49) This passage in the *Heshang* version reads \"是以圣人终不为大.\" The Mawangdui silk manuscript B reads \"是以圣人之能成大也，以其不为大也.\"\n\n(50) \"率\" in the Siku *Heshang* version reads \"守.\"\n\n(51) \"太\" appears identically in the *Heshang*, Wang, and Mawangdui A and B manuscripts. Some versions read \"泰.\"\n\n(52) \"国家安宁\" in the Siku *Heshang* version reads \"国安家宁.\"\n\n(53) \"足\" appears identically in the Wang version; the *Heshang* and Mawangdui A and B manuscripts read \"可.\"\n\n(54) \"歙\" appears identically in the Wang version; the *Heshang* version reads \"噏.\" The Mawangdui A manuscript reads \"拾,\" while B omits the character.\n\n(55) \"欲\" appears identically in the Wang and Mawangdui A and B manuscripts; the *Heshang* version reads \"使.\"\n\n(56) The Wang and Mawangdui A and B manuscripts all include \"之\" at the end of the sentence; the *Heshang* version and *Yongle Encyclopedia* omit it.\n\n(57) The Wang version includes \"夫\"; the *Heshang* version omits it. \"无\" appears identically in the Wang version; the *Heshang* version reads \"不.\" The Mawangdui A and B manuscripts both read \"夫将不辱，不辱……\"\n\n(58) \"扔\" appears identically in the Wang version; the *Heshang* version reads \"仍.\" The Mawangdui A and B manuscripts both read \"乃.\"\n\n(59) \"贞\" appears identically in the Wang version; the *Heshang* and Mawangdui A and B manuscripts read \"正.\"\n\n(60) \"蹶\" appears identically in the Wang version; the *Heshang* version also reads \"蹶.\" The Mawangdui B manuscript reads \"欮.\"\n\n(61) \"榖\" appears identically in the Wang version; the *Heshang* version reads \"毂.\" The Mawangdui A and B manuscripts write \"榖\" without the \"殳\" component.\n\n(62) Both instances of \"舆\" appear identically in the Wang version; the *Heshang* version reads \"车\" in both cases. The Mawangdui A manuscript reads \"与,\" while B reads \"舆.\"\n\n(63) \"珞珞\" appears identically in the Wang version; the *Heshang* version reads \"落落,\" and the Mawangdui A and B manuscripts read \"硌硌.\"\n\n(64) \"榖\" appears identically in the Wang version; the *Heshang* version reads \"毂.\" The Mawangdui A and B manuscripts write \"榖\" without the \"殳\" component.\n\n(65) \"是以\" appears identically in the Wang and Mawangdui A manuscripts; the *Heshang* version reads \"以是.\"\n\n(66) Before this passage, the *Heshang* and Mawangdui A and B manuscripts all include the sentence \"罪莫大于可欲,\" which the Wang version omits.\n\n(67) The Wang and Mawangdui A and B manuscripts all include \"矣\" at the end of the sentence; the *Heshang* version omits it.\n\n(68) \"窥\" appears identically in the Wang version; the *Heshang* version also reads \"窥.\" The Mawangdui A manuscript reads \"规,\" while B reads \"圭见.\"\n\n(69) \"歙歙\" appears identically in the Wang version; the *Heshang* version reads \"怵怵.\" The Mawangdui A manuscript reads \"焉,\" while B reads \"欱欱焉.\"\n\n(70) The Wang version includes the character \"亦,\" which the *Heshang* version omits. For this passage, the Mawangdui A manuscript reads \"而民生生动皆之死地之十有三,\" while B reads \"而民生生僮皆之死地之十有三.\"\n\n(71) \"被\" appears identically in the Wang version; the *Heshang* version reads \"避.\" For this passage, the Mawangdui A manuscript reads \"入军不被甲兵,\" while B reads \"入军不被兵革.\"\n\n(72) \"亭之毒之\" appears identically in the Wang version and Mawangdui B manuscript; the *Heshang* version reads \"成之熟之.\"\n\n(73) \"得\" appears identically in the Wang version and Mawangdui A and B manuscripts; the *Heshang* version reads \"知.\"\n\n(74) \"以\" appears identically in the Wang version and Mawangdui A and B manuscripts; the *Heshang* version reads \"复.\"\n\n(75) \"袭\" appears as \"习\" in the *Heshang* and Wang versions; the Mawangdui A manuscript reads \"袭.\"\n\n(76) \"其\" appears as \"甚\" in the *Heshang*, Wang, and Mawangdui A and B versions.\n\n(77) \"彩\" appears identically in the *Heshang* and Wang versions; the Mawangdui A and B manuscripts read \"采.\"\n\n(78) \"夸\" appears identically in the *Heshang* and Wang versions; the *Hanfeizi Yu Lao* citation reads \"竽,\" and the Mawangdui B manuscript reads \"杅.\"\n\n(79) The Wang version includes the character \"也,\" which the *Heshang* version omits. The Mawangdui A and B manuscripts are both damaged at this passage.\n\n(80) The Wang version and Mawangdui A and B manuscripts all include the character \"以,\" which the *Heshang* version omits.\n\n(81) \"邦\" appears as \"国\" in the *Heshang* and Wang versions. The Mawangdui A manuscript reads \"邦,\" while B reads \"国.\"\n\n(82) After the character \"下,\" the *Heshang* version and Mawangdui B manuscript both include an additional \"之,\" which the Wang version omits.\n\n(83) \"蜂虿虺蛇\" appears identically in the Wang version; the *Heshang* version reads \"毒虫.\" For this passage, the Mawangdui A manuscript reads \"逢地弗螫,\" while B reads \"蜂疠虫蛇弗赫.\"\n\n(84) \"攫\" appears identically in the Wang version; the *Heshang* version reads \"玃.\" For this passage, the Mawangdui A manuscript reads \"鸟猛兽弗搏,\" while B reads \"据鸟孟兽弗捕.\"\n\n(85) The *Heshang* version reads identically (omitted character), the Wang version reads \"全,\" and the Mawangdui B manuscript reads \"脧.\"\n\n(86) The *Heshang* version and Mawangdui A and B manuscripts all include an additional \"亦\" at the beginning of the sentence, which the Wang version omits. \"疏\" appears as \"踈\" in the *Heshang* and Wang versions; the Mawangdui A manuscript reads \"疏.\"\n\n(87) The *Heshang* version and Mawangdui A manuscript both include an additional \"亦\" at the beginning of the sentence, which the Wang version omits.\n\n(88) The *Heshang* version and Mawangdui A and B manuscripts all include an additional \"亦\" at the beginning of the sentence, which the Wang version omits.\n\n(89) \"令\" appears identically in the Wang version; the *Heshang* version and Mawangdui A and B manuscripts read \"物.\"\n\n(90) \"妖\" appears identically in the Wang version; the *Heshang* version reads \"訞.\"\n\n(91) \"人\" appears identically in the Wang version; the *Heshang* version reads \"民.\"\n\n(92) \"刿\" appears identically in the Wang version; the *Heshang* version reads \"害,\" and the Mawangdui B manuscript reads \"刺.\"\n\n(93) \"耀\" appears identically in the Wang version; the *Heshang* version reads \"曜,\" and the Mawangdui B manuscript reads \"眺.\"\n\n(94) \"克\" appears identically in the Wang version and *Siku* edition. The same applies below.\n\n(95) This passage appears identically in the *Heshang* and Wang versions.\n\nThe Mawangdui A manuscript reads: *\"The female constantly overcomes the male with her serenity; for her serenity [□□], it is fitting to be below.\"* The B manuscript reads: *\"The female constantly overcomes the male with her stillness; for her stillness, therefore it is fitting to be below.\"*\n\n(96) *\"故\"* appears identically in the Wang version; the *Heshang* version and Mawangdui A and B manuscripts all read *\"欲.\"*\n\n(97) *\"邪\"* appears identically in the Wang version; the *Heshang* version reads *\"耶,\"* the Mawangdui A manuscript reads *\"舆,\"* and the B manuscript reads *\"与.\"*\n\n(98) The *Heshang* version, Wang version, and Mawangdui A and B manuscripts all omit the second *\"易\"* character.\n\n(99) The *Heshang* version and Mawangdui A manuscript both omit the final *\"矣\"* character. The Wang version includes it.\n\n(100) *\"泮\"* appears identically in the Wang version; the *Heshang* version reads *\"破.\"* The Mawangdui A and B manuscripts are damaged here.\n\n(101) The *Heshang* version omits the two characters *\"是以.\"* The Wang version and Mawangdui B manuscript include them.\n\n(102) The *Heshang* version omits the *\"故\"* character. The Wang version and Mawangdui A and B manuscripts include it.\n\n(103) *\"稽\"* appears identically in the Wang version and Mawangdui A and B manuscripts; the *Heshang* version reads *\"楷.\"* The same applies below.\n\n(104) The *Heshang* version and Mawangdui A and B manuscripts all omit the two characters *\"然后,\"* while the Wang version includes them. After the *\"至\"* character, the *Heshang* version includes an additional *\"于,\"* which the Wang version and Mawangdui A and B manuscripts omit.\n\n(105) The *Heshang* version omits the *\"其\"* character; the Wang version and Mawangdui A and B manuscripts include it.\n\n(106) After the *\"以\"* character, the *Heshang* version and Mawangdui A and B manuscripts all include the two characters *\"圣人,\"* which the Wang version omits.\n\n(107) The *Heshang* version and Mawangdui B manuscript both omit the *\"道\"* character; the Wang version includes it.\n\n(108) The *Heshang* version omits the *\"也\"* character; the Wang version and Mawangdui B manuscript include it. The Mawangdui A manuscript reads *\"细久矣.\"*\n\n(109) *\"保\"* appears identically in the Wang version; the *Heshang* version reads *\"宝,\"* and the Mawangdui B manuscript is damaged here.\n\n(110) The *Heshang* version and Wang version both include an additional *\"古\"* character after *\"天,\"* punctuating after *\"天.\"* The Mawangdui A manuscript reads *\"是胃天古之极也,\"* and the B manuscript reads *\"是胃肥天古之极也.\"*\n\n(111) *\"扔\"* appears identically in the Wang version; the *Heshang* version reads *\"仍,\"* and the Mawangdui A and B manuscripts both read *\"乃.\"*\n\n(112) *\"惟\"* appears as *\"唯\"* in the *Heshang* version, Wang version, and Mawangdui A and B manuscripts.\n\n(113) *\"惟\"* appears as *\"唯\"* in the *Heshang* version and Wang version. The Mawangdui B manuscript reads *\"以其病病.\"*\n\n(114) The *Heshang* version omits the *\"则\"* character and includes an additional *\"矣\"* at the end of the sentence. The Wang version includes *\"则\"* but omits *\"矣.\"* The Mawangdui B manuscript reads *\"则大威将至矣.\"*\n\n(115) *\"狎\"* appears identically in the Wang version; the *Heshang* version reads *\"狭,\"* the Mawangdui A manuscript reads *\"闸,\"* and the B manuscript is damaged here.\n\n(116) The *Heshang* version omits the *\"夫\"* character; the Wang version and Mawangdui A and B manuscripts include it.\n\n(117) *\"疏\"* appears identically in the Wang version and Mawangdui B manuscript; the *Heshang* version reads *\"疎.\"*\n\n(118) The *Heshang* version and Mawangdui A and B manuscripts omit the second *\"杀\"* character; the Wang version includes it.\n\n(119) This passage reads in the *Heshang* version: *\"夫代司杀者是谓代大匠斫,\"* in the Wang version: *\"夫代司杀者杀是谓代大匠斫,\"* in the Mawangdui A manuscript: *\"夫伐司杀者杀是伐大匠斫也,\"* and in the B manuscript: *\"夫代司杀者杀是代大匠斫.\"*\n\n(120) After the *\"斫\"* character, the *Heshang* version, Wang version, and Mawangdui A manuscript all include an additional *\"者\"* character. The Mawangdui B manuscript omits it.\n\n(121) This passage reads in the *Heshang* version: *\"希有不伤手者矣,\"* in the Wang version: *\"希有不伤其手矣,\"* in the Mawangdui A manuscript: *\"则□不伤其手矣,\"* and in the B manuscript: *\"则希不伤其手.\"*\n\n(122) The *Heshang* version and Wang version both read *\"饥,\"* while the Mawangdui A and B manuscripts both read *\"饥.\"*\n\n(123) *\"不胜\"* appears identically in the *Heshang* version, Wang version, and Mawangdui A and B manuscripts; some versions read *\"灭.\"*\n\n(124) *\"兵\"* appears identically in the Wang version; the *Heshang* version reads *\"共,\"* the Mawangdui A manuscript reads *\"恒,\"* and the B manuscript reads *\"竞.\"*\n\n(125) *\"与\"* appears identically in the Wang version; the *Heshang* version reads *\"乎.\"* The Mawangdui A and B manuscripts both read *\"也.\"*\n\n(126) *\"补\"* appears identically in the Wang version and Mawangdui A manuscript; the *Heshang* version reads *\"与.\"*\n\n(127) *\"补\"* appears identically in the *Heshang* version and Wang version; the Mawangdui B manuscript reads *\"益.\"*\n\n(128) This line reads *\"Among all under heaven, none is more yielding and weak than water\"* in the *Heshang* version, while the Wang version and Mawangdui A and B manuscripts all read *\"Among all under heaven, none is more yielding or weak than water.\"*\n\n(129) *\"之\"* appears identically in the Wang version and Mawangdui A manuscript; the *Heshang* version reads *\"知.\"*\n\n(130) *\"易\"* appears as *\"知\"* in the Wang version, *Heshang* version, and Mawangdui B manuscript.\n\n(131) *\"是以\"* appears identically in the Wang version; the *Heshang* version and Mawangdui A manuscript read *\"故,\"* while the Mawangdui B manuscript reads *\"是故.\"*\n\n(132) After the character *\"国,\"* the *Heshang* version and Mawangdui A and B manuscripts all include an additional *\"之,\"* which is absent in the Wang version. *\"国\"* appears as *\"邦\"* in the Mawangdui A manuscript.\n\n(133) After the character *\"伯,\"* the *Heshang* version and Mawangdui A and B manuscripts all include an additional *\"人,\"* which is absent in the Wang version. *\"伯\"* appears as *\"百\"* in the Mawangdui A and B manuscripts.\n\n(134) *\"舆\"* appears identically in the Wang version; the *Heshang* version reads *\"舆,\"* while the Mawangdui A and B manuscripts both read *\"车.\"*\n\n(135) *\"人\"* appears identically in the Wang version; the *Heshang* version and Mawangdui B manuscript both read *\"民.\"*\n\n(136) *\"憬\"* may also appear as *\"景.\"*\n\n(137) *\"庚午\"* corresponds to the year 1930 CE.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "老子注 清 陈澧注 《老子注》一卷 番禺陈澧撰 民国十九年石氏抄本 一章 道，可道，非常道； 名，可名，非常名。 【言常道不可道，常名不可名也。 常道常名谓道也。 二十五章云：有物混成，先天地生，吾不知其名，字之曰道。 是也。 道在天地之先，而万古不变，故曰常也。 既有天地之后，万变不穷，其道可道，其名可名，然变而非常矣。 】无名，天地之始； 有名，万物之母。 【河上公注云：无名者谓道，有名谓天地。 】故常无，欲以观其妙； 常有，欲以观其徼。 【无欲，谓禁遏其欲也。 常禁遏其欲，以观道妙，然万物皆有欲。 出生入死，故又常以己之有欲。 观万物之归趣也。 河上云：徼』，归』也。 观世俗之归趣。 陆云：『徼』，『小道』也； 『边』也； 『微妙』也。 】此两者同出而异名，同谓之玄，玄之又玄，众妙之门。 【河上云：两者，谓有欲无欲也。 澧谓：于其禁遏，名之曰无，于其本有，名之曰有也。 】 二章",
      "translated_text": "A Commentary on the *Laozi* by Chen Li of the Qing Dynasty\n*Laozi Zhu* (Commentary on the *Laozi*), One Scroll\nBy Chen Li of Panyu\nManuscript copy by the Shi family, 1930\n\n**Chapter One**\nThe Dao that can be spoken is not the eternal Dao;\nThe name that can be named is not the eternal name.\n[This means the eternal Dao cannot be spoken, nor can the eternal name be named. The eternal Dao and eternal name refer to the Dao. Chapter Twenty-Five states: \"There is a thing, formlessly formed, born before heaven and earth. I know not its name, so I style it 'Dao.'\" Such is the case. The Dao precedes heaven and earth and remains unchanged through all ages—hence it is called \"eternal.\" After the existence of heaven and earth, myriad transformations arise without end; its Dao may be spoken, its name may be named, yet these are mutable and not eternal.]\n\n\"Nameless\" is the beginning of heaven and earth;\n\"Named\" is the mother of the myriad things.\n[He Shanggong’s commentary states: \"Nameless\" refers to the Dao; \"named\" refers to heaven and earth.]\n\nThus, by constantly dwelling in non-being, one may observe its mystery;\nBy constantly dwelling in being, one may observe its manifestations.\n[Non-desire means restraining one’s desires. By constantly restraining desires, one may observe the subtleties of the Dao. Yet all things possess desire—emerging into life and entering into death—so one must also constantly observe the tendencies of things through one’s own desires. He Shanggong says: \"Manifestations\" (*jiao*) means \"tendencies\" (*gui*), observing the tendencies of worldly customs. Lu [Huiqing] says: \"*Jiao* means 'minor paths,' 'boundaries,' or 'subtle mysteries.'\"]\n\nThese two emerge from the same source yet bear different names;\nBoth are called the profound.\nProfounder still is the gate of all mysteries.\n[He Shanggong says: \"The two\" refers to having desire and being without desire. Li comments: In restraint, it is called \"non-being\"; in its inherent state, it is called \"being.\"]\n\n**Chapter Two**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 403,
      "start_sentence": 0,
      "end_sentence": 31,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.483867883682251,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "天下皆知美之为美，斯恶矣； 皆知善之为善，斯不善已（一）。 【知美善则竟为藏善，失其自然。 】故有无相生，难易相成，长短相形。 【官本云：各本俱作『形』。 《释文》作『较』。 盖用弼本。 按：『生』、『成』、『形』、『倾』四字为韵，作『形』是。 高下相倾，陆云：『倾』，高下不正貌。 】音声相和，前后相随。 【此六者，万物之自然。 】是以圣人处无为之事，行不言之教，万物作焉【河上云：各自动也。 】而不辞（二）。 【河上云：不辞谢而歇止。 】生而不有，为而不恃，功成而弗居，夫惟弗居（三），是以不去。 三章 不尚贤，使民不争； 不贵难得之货，使民不为盗； 不见可欲，【见，胡甸切。 】使民心不乱，【各本无『民』字，从官本。 】是以圣人之治，虚其心，【河上云：除嗜欲，去乱烦。 】实其腹，【河上云：怀道抱一，守五神也。 】弱其志，【河上云：和柔谦让，不处权也。 】强其骨，【河上云：爱精重施，髓满骨坚。 】使常民无知无欲（四），使夫知者不敢为也（五），【智者喜于有为，使之不敢为。 】为无为，则无不治。 四章 道冲，而用之或不盈。 【『冲』，『虚』也。 】渊兮，似万物之宗，挫其锐，【揣而锐之，不可长保，故挫之也。 】解其纷，和其光，同其尘，湛兮，似或存。 吾不知谁之子。 【河上云：老子言我不知道所从生。 】象帝之先。 【河上云：道自在天帝之先。 】 五章",
      "translated_text": "All under heaven know beauty as beauty, and already this is ugliness;\nAll know goodness as goodness, and already this is not goodness.\n[Knowing beauty and goodness leads to competition in concealing goodness, losing their naturalness.]\n\nThus, being and non-being give rise to each other,\nDifficulty and ease complete each other,\nLong and short form each other,\nHigh and low incline toward each other,\nTones and voices harmonize with each other,\nFront and back follow each other.\n[These six are the natural tendencies of the myriad things.]\n\nTherefore, the sage abides in non-action,\nPractices the teaching without words,\nAnd the myriad things arise without refusal.\n[They move of themselves without ceasing.]\nThey give life yet do not possess,\nAct yet do not rely,\nAccomplish yet do not dwell—\nOnly because they do not dwell,\nDo they not depart.\n\n**Chapter Three**\n\nDo not exalt the worthy, and the people will not contend;\nDo not prize rare goods, and the people will not steal;\nDo not display what is desirable,\nAnd the people’s hearts will not be disturbed.\n[All editions lack the character *min* (\"people\"); following the official edition.]\n\nThus, in the governance of the sage:\nHe empties their hearts,\n[Removes cravings, eliminates chaos and confusion.]\nFills their bellies,\n[Embraces the Dao and holds to unity, guarding the five spirits.]\nWeakens their ambitions,\n[Harmonious, yielding, and humble, not grasping authority.]\nStrengthens their bones,\n[Cherishes essence and values generosity, filling the marrow and firming the bones.]\nSo that the common people remain without knowledge and without desire,\nAnd those with knowledge dare not act.\n[The wise delight in action; restrain them so they dare not act.]\nAct through non-action, and nothing will be left ungoverned.\n\n**Chapter Four**\n\nThe Dao is empty, yet its use is inexhaustible.\n[“Empty” means “void.”]\nAbysmal, it seems the ancestor of the myriad things.\nIt blunts their sharpness,\n[Sharpened by craft, they cannot long endure—thus it blunts them.]\nUntangles their entanglements,\nHarmonizes their radiance,\nMingles with their dust.\nDeep, it seems perhaps to exist.\nI do not know whose child it is—\n[Laozi says: I do not know from whence it arises.]\nIt appears before the Lord of Heaven.",
      "overlap_context": "*) means \"tendencies\" (*gui*), observing the tendencies of worldly customs. Lu [Huiqing] says: \"*Jiao* means 'minor paths,' 'boundaries,' or 'subtle mysteries.'\"]\n\nThese two emerge from the same source yet bear different names;\nBoth are called the profound.\nProfounder still is the gate of all mysteries.\n[He Shanggong says: \"The two\" refers to having desire and being without desire. Li comments: In restraint, it is called \"non-being\"; in its inherent state, it is called \"being.\"]\n\n**Chapter Two**",
      "start_char": 406,
      "end_char": 981,
      "start_sentence": 32,
      "end_sentence": 68,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.957874298095703,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "天地不仁，以万物为刍狗； 圣人不仁，以百姓为刍狗。 【刍与狗，至贱之物。 】天地之间，其犹橐钥乎？ 【王云：『橐』，『排橐』也。 『钥』，『乐钥』也。 】虚而不屈，【河上云：无有屈竭时。 『屈』，《释文》作『掘』，云河上本作『掘』。 】动而愈出，多言数穷，【陆云：王云：理数也。 顾云：势数也。 】不如守中。 六章 谷神不死，【『谷』，『虚』也。 『谷神』，虚神也。 《释文》：谷，古木反。 中央无者也。 】是谓玄牝。 【『玄』，『幽深』也。 『牝』，『窍』也。 】玄牝之门，是谓天地根，【河上云：鼻、口之门，是乃通天地之元气，所从往来。 】绵绵若存（六），用之不勤。 【河上云：鼻、口呼噏，息当绵绵微妙，若可存，又若无有，用气常宽舒，不当急疾勤劳也。 】 七章",
      "translated_text": "**Chapter Five**\n\nHeaven and Earth are not humane—\nThey treat the myriad things as straw dogs.\nThe sage is not humane—\nThey treat the common people as straw dogs.\n[Straw and dogs are the basest of things.]\n\nBetween Heaven and Earth,\nIs it not like a bellows?\n[Wang Bi says: *Tuo* refers to the \"piston bellows.\"\n*Yue* refers to the \"musical pipe.\"]\nEmpty yet never exhausted,\n[He Shanggong says: Without any time of depletion.\n*Qu* (屈), *Fuwen* (《释文》) writes as *jue* (掘), noting He Shanggong’s version as *jue*.]\nMoving, it brings forth ever more.\nThe more words are spoken, the sooner they reach their limit—\n[Lu Deming says: Wang Bi says: \"principle and number.\"\nGu Huan says: \"circumstance and fate.\"]\nBetter to hold fast to the center.\n\n**Chapter Six**\n\nThe Valley Spirit does not die—\n[Valley (*gu*) means \"emptiness.\"\nValley Spirit (*gushen*) is the spirit of emptiness.\n*Fuwen*: *Gu*, pronounced *gu* (古木反), refers to that which is hollow at the center.]\nThis is called the Dark Womb.\n[Dark (*xuan*) means \"profound and deep.\"\nWomb (*pin*) means \"aperture.\"]\nThe gateway of the Dark Womb\nIs called the root of Heaven and Earth.\n[He Shanggong says: The gates of nose and mouth\nAre the passages through which the primordial *qi* of Heaven and Earth flows in and out.]\nSubtly continuous, as if existing—\n[He Shanggong says: The breath of nose and mouth should be soft and fine,\nAs if present, yet as if absent.\nUse the *qi* with ease and leisure,\nNot with haste, urgency, or strain.]\nIts use is never exhausted.",
      "overlap_context": "will be left ungoverned.\n\n**Chapter Four**\n\nThe Dao is empty, yet its use is inexhaustible.\n[“Empty” means “void.”]\nAbysmal, it seems the ancestor of the myriad things.\nIt blunts their sharpness,\n[Sharpened by craft, they cannot long endure—thus it blunts them.]\nUntangles their entanglements,\nHarmonizes their radiance,\nMingles with their dust.\nDeep, it seems perhaps to exist.\nI do not know whose child it is—\n[Laozi says: I do not know from whence it arises.]\nIt appears before the Lord of Heaven.",
      "start_char": 984,
      "end_char": 1313,
      "start_sentence": 69,
      "end_sentence": 92,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.298582315444946,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "天地长久，天地所以能长且久者（七），以其不自生。 【天地生物而不自生。 】故能长生。 是以圣人后其生而身先（八），外其身而身存，非以其无私耶（九）？ 故能成其私。 【老氏之旨，在成其私。 】 八章 上善若水，水善利万物而不争，处众人之所恶，【王云：人恶卑也。 故几于道。 河上云：水性几与道同。 】居善也，心善渊，【河上云：水深空虚，渊深清明。 】与善仁，【河上云：万物得水以生，与虚不与盈也。 】言善信，【河上云：水内影照，形不失其情也。 】正善治，【河上云：无有不洗，清旦平也。 】事善能，【河上云：能方能圆，曲直随形。 】动善时。 【河上云：夏散冬凝，应期而动，不失天时。 】夫唯不争，故无尤。 九章 持而盈之，不如其已。 【王云：持谓不失德也，既不失其德，又如其无德无功者也。 】揣而锐之（十），【『揣』，『磨』也。 顾云：『治』也。 『锐』，《释文》作『悦』，云河上作『锐』。 】不可长保（十一），金玉满堂，莫之能守。 富贵而骄，自遗其咎。 功遂身退（十二），天之道。 【王云：四时更运，功成则移。 】 十章",
      "translated_text": "**Chapter Seven**\n\nHeaven and Earth endure—\nHeaven and Earth endure so long\nBecause they do not live for themselves.\n[Heaven and Earth give life to things yet do not claim life for themselves.]\nThus they live long.\nTherefore the sage places their person last yet finds themselves first,\nSets their person aside yet preserves it.\nIs this not because they are selfless?\nThus they fulfill their self.\n[The essence of Laozi’s teaching lies in fulfilling the self.]\n\n**Chapter Eight**\n\nThe highest virtue is like water.\nWater benefits the ten thousand things yet does not contend,\nFlowing where the many shun.\n[Wang Bi: People shun the lowly.\nThus it nearly approaches the Dao.\nHe Shanggong: The nature of water nearly aligns with the Dao.]\nIt dwells in goodness,\nIts heart is deep as an abyss,\n[He Shanggong: Water is profoundly empty; the abyss is deep and clear.]\nIts giving is kind,\n[He Shanggong: The ten thousand things receive life from water, aligning with emptiness, not with fullness.]\nIts speech is true,\n[He Shanggong: Water reflects shadows within; forms do not lose their essence.]\nIts governance is just,\n[He Shanggong: Nothing remains unwashed; all is cleansed and level.]\nIts work is capable,\n[He Shanggong: It can be square or round, bending or straight, adapting to form.]\nIts movement is timely.\n[He Shanggong: It scatters in summer and congeals in winter, moving in accord with the seasons, never losing the celestial timing.]\nTruly, because it does not contend,\nIt is without blame.\n\n**Chapter Nine**\n\nTo hold and fill it to the brim\nIs not as good as stopping in time.\n[Wang Bi: To hold means not to lose virtue; yet even without losing virtue, one should act as if without virtue or merit.]\nTo grind and sharpen it,\n[Chuai (*揣*) means \"to grind.\"\nGu says: \"to refine.\"\nRui (*锐*): *Shiwen* reads as *yue* (悦), noting He Shanggong’s version has *rui* (锐).]\nCannot be long preserved.\nWhen gold and jade fill the hall,\nNone can guard them.\nWealth and honor breed arrogance,\nBringing misfortune upon oneself.\nTo withdraw once the work is done—\nThis is the Dao of Heaven.\n[Wang Bi: The four seasons alternate; when the work is complete, they shift away.]",
      "overlap_context": "rofound and deep.\"\nWomb (*pin*) means \"aperture.\"]\nThe gateway of the Dark Womb\nIs called the root of Heaven and Earth.\n[He Shanggong says: The gates of nose and mouth\nAre the passages through which the primordial *qi* of Heaven and Earth flows in and out.]\nSubtly continuous, as if existing—\n[He Shanggong says: The breath of nose and mouth should be soft and fine,\nAs if present, yet as if absent.\nUse the *qi* with ease and leisure,\nNot with haste, urgency, or strain.]\nIts use is never exhausted.",
      "start_char": 1316,
      "end_char": 1778,
      "start_sentence": 93,
      "end_sentence": 123,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.783483743667603,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "载营魄抱一，能无离乎？ 【『一』即所谓谷神不死者也，人身载营魂而抱神，能无离乎？ 专气致柔，能婴儿乎？ 能不分其气，又极柔弱如婴儿乎？ 】涤除玄览，能无疵乎？ 【河上云：当洗其心，使洁净也。 心处玄冥之处，览知万物，故谓之玄览。 】爱民治国，能无知乎？ 【六十五章：以智治国，国之贼。 】天门开阖，能无雌乎（十三）？ 【天门未详。 河上云：天门谓鼻孔。 王云：天门，天下之所由从也。 开阖，治乱之际也。 雌应而不倡，因而不为，言天门开阖，能为雌乎？ 官本云：按注义『无』似作『为』。 澧谓作『为』是也。 『为雌』即所谓守其雌也。 河上注、王注，未定孰是。 】明白四达，能无为乎？ 生之畜之，生而不有； 为而不恃； 长而不宰。 是谓玄德。 十一章",
      "translated_text": "To carry the soul and embrace the One—\nCan this be done without separation?\n[The \"One\" is that which is called \"the valley spirit never dies.\"\nThe human body carries the *hun*-soul and embraces the spirit—\nCan this be done without separation?]\n\nTo concentrate the *qi* and attain softness—\nCan one be like an infant?\nCan the *qi* remain undivided,\nAnd reach the utmost softness and weakness of an infant?\n\nTo cleanse and purify the mysterious mirror—\nCan this be done without flaw?\n[He Shanggong says: One should wash the heart,\nMaking it pure and clean.\nThe heart dwells in the realm of profound darkness,\nSurveying and knowing the ten thousand things—\nThus it is called the \"mysterious mirror.\"]\n\nTo love the people and govern the state—\nCan this be done without knowledge?\n[Chapter Sixty-Five: \"To govern the state with cleverness\nIs the state’s ruin.\"]\n\nThe gate of Heaven opens and closes—\nCan one be without the feminine?\n[The \"gate of Heaven\" is unclear.\nHe Shanggong says: The gate of Heaven refers to the nostrils.\nWang Bi says: The gate of Heaven is that by which all under Heaven follows.\n\"Opening and closing\" refers to the juncture of order and chaos.\nThe feminine responds but does not initiate,\nFollowing but not acting—\nDoes this mean the gate of Heaven opens and closes,\nAnd one can *be* the feminine?\nThe *Guanben* edition notes: According to the commentary, *wu* (无) seems to read as *wei* (为).\nLi says: *Wei* (为) is correct.\n\"To be the feminine\" is what is called \"guarding the feminine.\"\nThe interpretations of He Shanggong and Wang Bi remain unresolved.]\n\nTo understand the four directions and be all-pervading—\nCan this be done without action?\n\nTo give life and nurture it,\nTo give life yet not possess;\nTo act yet not rely;\nTo lead yet not dominate—\nThis is called the profound *virtue*.",
      "overlap_context": "should act as if without virtue or merit.]\nTo grind and sharpen it,\n[Chuai (*揣*) means \"to grind.\"\nGu says: \"to refine.\"\nRui (*锐*): *Shiwen* reads as *yue* (悦), noting He Shanggong’s version has *rui* (锐).]\nCannot be long preserved.\nWhen gold and jade fill the hall,\nNone can guard them.\nWealth and honor breed arrogance,\nBringing misfortune upon oneself.\nTo withdraw once the work is done—\nThis is the Dao of Heaven.\n[Wang Bi: The four seasons alternate; when the work is complete, they shift away.]",
      "start_char": 1781,
      "end_char": 2088,
      "start_sentence": 124,
      "end_sentence": 148,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.046583414077759,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "三十辐共一毂，当其无，有车之用。 埏埴以为器，【陆云：『埏』，河上云『和』也； 『埴』，河上云『土』也。 】当其无，有器之用。 凿户牖以为室，当其无，有室之用。 故有之以为利，无之以为用。 【车以转轴者为用，器以容物者为用，室以出入通明者为用，皆在空虚之处。 吴云：『无』者，空虚之处也。 】 十二章 五色令人目盲； 五音令人耳聋； 五味令人口爽； 【陆云：『爽』，差也。 河上云：『亡』也。 】驰骋畋猎，令人心发狂； 难得之货，令人行妨。 【行而有害也。 《左传》云：匹夫无罪，怀璧其罪。 『行』，陆云：下孟反。 】是以圣人为腹不为目，故去彼取此。 【吴云：但为实腹以养气，不为悦目而绚物也，但言不为目，益举一以包其四。 】 十三章",
      "translated_text": "Thirty spokes join in a single hub—\nIt is where there is *wu* that the cart finds its use.\nClay is shaped to form a vessel—\nIt is where there is *wu* that the vessel finds its use.\nDoors and windows are cut to make a room—\nIt is where there is *wu* that the room finds its use.\nThus, \"having\" brings advantage,\nWhile *wu* brings use.\n\nThe five colors blind the eye;\nThe five tones deafen the ear;\nThe five flavors dull the palate.\nRacing and hunting madden the heart;\nRare goods impede conduct.\nTherefore, the sage attends to the belly, not the eye—\nThus, he rejects that and embraces this.",
      "overlap_context": "minine?\nThe *Guanben* edition notes: According to the commentary, *wu* (无) seems to read as *wei* (为).\nLi says: *Wei* (为) is correct.\n\"To be the feminine\" is what is called \"guarding the feminine.\"\nThe interpretations of He Shanggong and Wang Bi remain unresolved.]\n\nTo understand the four directions and be all-pervading—\nCan this be done without action?\n\nTo give life and nurture it,\nTo give life yet not possess;\nTo act yet not rely;\nTo lead yet not dominate—\nThis is called the profound *virtue*.",
      "start_char": 2091,
      "end_char": 2406,
      "start_sentence": 149,
      "end_sentence": 172,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 3.580585241317749,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "宠辱若惊，【陆云：文简云：『宠』，『得』也； 『辱』，失也。 顾云：『若』，而也。 】贵大患若身。 【陆云：河上云：『贵』，畏也； 身空也。 】何谓宠辱若惊？ 宠为下，得之若惊，【上之荣辱，为下者得之，当若惊也。 】失之若惊，【失之即辱也。 】是谓宠辱若惊。 何谓贵大患若身？ 吾所以有大患者，为吾有身，及吾无身，吾有何患？ 故贵以身为天下，若可寄天下，爱以身为天下，若可托天下。 【『若』，犹『乃』也。 】 十四章 视之不见，名曰夷。 【陆云：『夷』，顾云『平』也； 锺云『灭』也，『平』也。 】听之不闻，名曰希，搏之不得，名曰微。 此三者，不可致诘，故混而为一。 其上不皦，【陆云：『皦』，『明』也。 其下不昧，绳绳不可名，陆云：『绳绳』，梁帝云：无涯际之貌。 顾云：无穷不可序。 】复归于无物。 是谓无状之状，无物之象，是谓惚恍。 迎之不见其首，随之不见其后。 执古之道以御今之有，能知古始，是谓道纪。 十五章 古之善为士者，微妙玄通，深不可识。 夫唯不可识，故强为容（十四）。 【吴云：强为之模其外之容，下文七者是也（十五）。 】豫焉（十六），若冬涉川，犹兮，若畏四邻，俨兮，其若容（十七）。 【『客』与『释』韵，作『容』者误也。 】涣兮，若冰之将释。 敦兮，其若朴。 旷兮，其若谷。 混兮，其若浊。 孰能浊以静之徐清（十八）？ 孰能安以久？ 动之徐生。 【王云：『孰能』者，言其难也。 官本云：《永乐大典》无『久』字。 按：河上云：谁能安静以久，徐徐以长生。 其本似无『动』字。 】保此道者不欲盈。 夫惟不盈（十九），故能蔽不新成。 【官本云：『蔽』，《永乐大典》作『敝』是也。 二十二章：敝则新。 吴云：凡物敝则缺，新则成，敝而缺者，不盈也，新而成者，盈也。 保守此道之人，不欲其盈，故能敝缺，不为新成。 】 十六章",
      "translated_text": "Favor and disgrace are both as startling—\nRegard great trouble as you do your own body.\n\nWhat does it mean, \"favor and disgrace are both as startling\"?\nFavor is inferior—\nGaining it is startling,\nLosing it is startling.\nThis is what is meant by \"favor and disgrace are both as startling.\"\n\nWhat does it mean, \"regard great trouble as you do your own body\"?\nThe reason I have great trouble\nIs that I have a body.\nIf I had no body,\nWhat trouble could I have?\n\nThus, one who values their body as the world\nMay be entrusted with the world;\nOne who cherishes their body as the world\nMay be charged with the world.\n\n---\n\nLook at it, yet see it not—call it the Level.\nListen to it, yet hear it not—call it the Rare.\nGrasp at it, yet hold it not—call it the Subtle.\nThese three cannot be fully examined,\nSo they merge into one.\nAbove, it is not bright;\nBelow, it is not dark.\nEndless, unnameable—\nIt returns to nothingness.\nThis is called the formless form,\nThe imageless image,\nCalled the indistinct and evanescent.\nMeet it, yet see not its head;\nFollow it, yet see not its rear.\nHold to the ancient Dao to master present being,\nAnd know the ancient beginning—\nThis is called the thread of the Dao.\n\n---\n\nThe ancients who were adept as scholars\nWere subtly mysterious, profoundly penetrating,\nSo deep they could not be known.\nOnly because they could not be known\nDo I force a description of their demeanor:\n\nHesitant, as if crossing a winter stream;\nWary, as if fearing neighbors on all sides;\nReserved, as if a guest;\nYielding, as ice about to melt;\nSimple, as uncarved wood;\nVast, as a valley;\nOpaque, as muddied water.\n\nWho can still the turbid and gradually clarify it?\nWho can remain at rest and slowly bring forth life?\n\nThose who preserve this Dao do not desire fullness.\nOnly because they are not full\nCan they be worn yet not newly made.",
      "overlap_context": "\nClay is shaped to form a vessel—\nIt is where there is *wu* that the vessel finds its use.\nDoors and windows are cut to make a room—\nIt is where there is *wu* that the room finds its use.\nThus, \"having\" brings advantage,\nWhile *wu* brings use.\n\nThe five colors blind the eye;\nThe five tones deafen the ear;\nThe five flavors dull the palate.\nRacing and hunting madden the heart;\nRare goods impede conduct.\nTherefore, the sage attends to the belly, not the eye—\nThus, he rejects that and embraces this.",
      "start_char": 2409,
      "end_char": 3154,
      "start_sentence": 173,
      "end_sentence": 225,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.50486946105957,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "致虚极，守静笃。 【致虚而极，守静而笃。 】万物并作，吾以观复。 夫物芸芸，各复归其根。 【所谓复也，荣必归于枯，生必归于死。 】归根曰静，是谓复命（二十），复命曰常。 【『常』，『理』也。 】知常曰明，不知常，妄作凶，知常客，【知万物皆当归根复命，自不争竞，而能容根。 】容乃公，公乃王，王乃天，天乃道，道乃久，没身不殆。 十七章 太上，下知有之，下知有君上而已。 其次亲而誉之，其次畏之，其次侮之，信不足焉，有不信焉！ 【王云：信不足焉，则有不信。 】悠焉（二十一），其贵言，【行不言之教。 】功成事遂，百姓皆谓我自然。 【『我』、『百姓』，自谓也。 不知上之功，故以为我自然也。 】",
      "translated_text": "Reach emptiness to its utmost, guard stillness with sincerity.\nAll things arise together—\nI thereby observe their return.\nNow, things flourish in abundance,\nEach returning to its root.\n\nReturning to the root is called stillness;\nThis is called restoring the mandate.\nRestoring the mandate is called constancy.\nKnowing constancy is called clarity;\nNot knowing constancy, reckless action brings misfortune.\nKnowing constancy, one is all-embracing;\nEmbracing, one is impartial;\nImpartial, one is kingly;\nKingly, one is celestial;\nCelestial, one is of the Dao;\nOf the Dao, one endures—\nTo the end of life, without peril.\n\nIn the highest antiquity, the people knew only that rulers existed.\nNext, they drew near and praised them;\nNext, they feared them;\nNext, they reviled them.\nWhere trust is insufficient,\nThere will be distrust.\n\nHow weighty their words!\nTheir work is accomplished, their affairs completed,\nYet the people all say, “We are naturally thus.”",
      "overlap_context": "uld not be known\nDo I force a description of their demeanor:\n\nHesitant, as if crossing a winter stream;\nWary, as if fearing neighbors on all sides;\nReserved, as if a guest;\nYielding, as ice about to melt;\nSimple, as uncarved wood;\nVast, as a valley;\nOpaque, as muddied water.\n\nWho can still the turbid and gradually clarify it?\nWho can remain at rest and slowly bring forth life?\n\nThose who preserve this Dao do not desire fullness.\nOnly because they are not full\nCan they be worn yet not newly made.",
      "start_char": 3157,
      "end_char": 3449,
      "start_sentence": 226,
      "end_sentence": 243,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 5.414095640182495,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "十八章 大道废，有仁义。 【所谓失道而后德，失德而后仁，失仁而后义也。 】慧知出（二十二），有大伪。 六亲不和，有孝慈。 国家昏乱，有忠臣。 十九章 绝圣弃智，民利百倍； 绝仁弃义，民复孝慈； 绝巧弃利，盗贼无有。 此三者以为文不足，【『文』，疑当作『民』。 声之误也。 『为』，去声。 此三者，本以为民，而实不足以为民也。 】故令有所属：【使民有所属。 】见素抱朴，少私寡欲。 【王云：属之于素朴寡欲。 】 二十章 绝学无忧。 【绝学则无忧。 】唯之于阿（二十三），相去几何？ 善之于恶，相去何若（二十四）？ 人之所畏，不可不畏，荒兮，其未央哉！ 众人熙熙，如享太牢，如登春台。 我独泊兮，其未兆，如婴儿之未孩，儽儽兮若无所归！ 众人皆有余，而我独若遗。 我愚人之心也哉，沌沌兮！ 俗人昭昭，我独昏昏。 俗人察察，我独闷闷，澹兮，其若海，飂兮，若无止。 众人皆有以，【王云：『以』，『用』也。 】而我独顽似鄙，我独异于人，而贵食母。 二十一章 孔德之容，【『孔德』，未详。 王云：『孔』，『空』也。 以空为德。 】惟道是从。 道之为物，惟恍惟惚，惚兮恍兮，其中有象； 恍兮惚兮，其中有物； 窈兮冥兮，其中有精，其精甚真，其中有信。 自古及今，其名不去，以阅众甫，吾何以知众甫之状哉？ 以此。 二十二章",
      "translated_text": "Chapter Eighteen\nWhen the great Dao is abandoned, there is benevolence and righteousness.\nWhen cleverness and knowledge arise, there is great artifice.\nWhen the six relations are not in harmony, there is filial piety and compassion.\nWhen the state is benighted and disordered, there are loyal ministers.\n\nChapter Nineteen\nCut off sageliness, cast away knowledge—\nThe people will benefit a hundredfold.\nCut off benevolence, cast away righteousness—\nThe people will return to filial piety and compassion.\nCut off skill, cast away profit—\nThere will be no thieves or bandits.\nThese three, as cultural refinements, are insufficient;\nThus, let there be that to which they belong:\nManifest plainness, embrace simplicity,\nReduce self-interest, diminish desires.\n\nChapter Twenty\nCut off learning, and there will be no worries.\nHow great is the difference between compliance and flattery?\nHow vast is the distance between good and evil?\nWhat others fear, one cannot but fear—\nVast and boundless, it is not yet ended!\nThe multitude bustle and rejoice,\nAs if feasting on the grand sacrifice,\nAs if ascending the springtime terrace.\nI alone remain still, showing no sign,\nLike an infant who has not yet learned to smile,\nWeary and forlorn, as if with no place to return.\nThe multitude all have more than enough,\nWhile I alone seem to have lost everything.\nWhat a fool’s heart I possess—so muddled!\nThe common folk are bright and clear,\nWhile I alone am dull and dim.\nThe common folk are sharp and discerning,\nWhile I alone am dull and obscure,\nVast as the sea,\nDrifting as if without end.\nThe multitude all have their uses,\nWhile I alone am stubborn and coarse.\nI alone differ from others,\nYet I value the nourishment of the Mother.\n\nChapter Twenty-One\nThe bearing of great virtue\nFollows only the Dao.\nAs a thing, the Dao is\nElusive and evanescent.\nEvanescent, elusive—\nWithin it there are images.\nElusive, evanescent—\nWithin it there are things.\nDark and obscure—\nWithin it there is essence.\nIts essence is most real,\nWithin it there is trust.\nFrom ancient times until now,\nIts name has never departed,\nBy which we may observe the origin of all things.\nHow do I know the form of the origin of all things?\nBy this.\n\nChapter Twenty-Two",
      "overlap_context": "g, one is impartial;\nImpartial, one is kingly;\nKingly, one is celestial;\nCelestial, one is of the Dao;\nOf the Dao, one endures—\nTo the end of life, without peril.\n\nIn the highest antiquity, the people knew only that rulers existed.\nNext, they drew near and praised them;\nNext, they feared them;\nNext, they reviled them.\nWhere trust is insufficient,\nThere will be distrust.\n\nHow weighty their words!\nTheir work is accomplished, their affairs completed,\nYet the people all say, “We are naturally thus.”",
      "start_char": 3452,
      "end_char": 4012,
      "start_sentence": 244,
      "end_sentence": 286,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.165884971618652,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "『曲则全，枉则直，洼则盈，弊则新，少则得，多则惑。 』是以圣人抱一为天下式，不自见，故明； 【见，胡甸切】。 不自是，故彰； 不自伐，故有功； 不自矜，故长。 夫唯不争，故天下莫能与之争（二十五），古之所谓『曲则全』者，岂虚言哉？ 诚全而归之。 二十三章 希言自然。 【王云：无味不足之言，乃是自然之至言也。 】飘风不终朝，骤雨不终日，孰为此者？ 天地。 天地尚不能久，而况人乎（二十六）？ 故从事于道者。 道者同于道，德者同于德，失者同于失。 同于道者，道亦乐得之； 同于德者，德亦乐得之； 同于失者，失亦乐得之（二十七）。 信不足焉，有不信焉！ 二十四章 企者不立（二十八）； 跨者不行； 自见者不明； 【见，胡甸切。 】自是者不彰； 自伐者无功； 自矜者不长。 其在道（二十九），曰余食赘行，物或恶之，故有道者不处。 二十五章 有物混成，先天地生。",
      "translated_text": "“To yield is to be preserved whole;\nTo be bent is to become straight;\nTo be hollow is to be filled;\nTo be tattered is to be renewed;\nTo want is to possess;\nTo have abundance is to be perplexed.”\n\nThus the sage embraces the One and becomes the model for all under heaven.\nHe does not display himself, and so is luminous;\nHe does not assert himself, and so is distinguished;\nHe does not boast, and so achieves merit;\nHe does not vaunt himself, and so endures.\nIt is precisely because he does not contend\nThat none under heaven can contend with him.\nThe ancient saying “To yield is to be preserved whole”—\nIs it an empty phrase?\nTruly, to be preserved whole is to return to it.\n\nChapter Twenty-Three\nSparse speech accords with nature.\nFierce winds do not last the morning;\nTorrential rains do not last the day.\nWho brings these about?\nHeaven and earth.\nIf even heaven and earth cannot endure long,\nHow much less can man?\nTherefore, those who align with the Dao:\nThose of the Dao are one with the Dao;\nThose of virtue are one with virtue;\nThose of loss are one with loss.\nThose one with the Dao—the Dao delights in attaining them;\nThose one with virtue—virtue delights in attaining them;\nThose one with loss—loss delights in attaining them.\nWhere trust is insufficient,\nThere will be those who do not trust.\n\nChapter Twenty-Four\nOne who stands on tiptoe does not stand firm;\nOne who strides cannot walk far;\nOne who displays himself is not luminous;\nOne who asserts himself is not distinguished;\nOne who boasts achieves no merit;\nOne who vaunts himself does not endure.\nIn the Way, these are called\n“Superfluous food and redundant conduct.”\nSome things despise them—\nTherefore those with the Dao do not abide in them.\n\nChapter Twenty-Five\nThere is a thing formed in chaos,\nBorn before heaven and earth.",
      "overlap_context": "hapter Twenty-One\nThe bearing of great virtue\nFollows only the Dao.\nAs a thing, the Dao is\nElusive and evanescent.\nEvanescent, elusive—\nWithin it there are images.\nElusive, evanescent—\nWithin it there are things.\nDark and obscure—\nWithin it there is essence.\nIts essence is most real,\nWithin it there is trust.\nFrom ancient times until now,\nIts name has never departed,\nBy which we may observe the origin of all things.\nHow do I know the form of the origin of all things?\nBy this.\n\nChapter Twenty-Two",
      "start_char": 4015,
      "end_char": 4400,
      "start_sentence": 287,
      "end_sentence": 317,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.320369243621826,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "寂兮寥兮！ 独立不改（三十），周行而不殆。 可以为天下母。 吾不知其名，字之曰道，强为之名曰大。 大曰逝，逝曰远，远曰反。 故道大，天大，地大，王亦大（三十一）。 域中有四大（三十二），而王居其一焉（三十三）。 人法地，地法天，天法道，道法自然。 二十六章 重为轻根，静为躁君。 是以圣人终日行不离辎重，【吴云：此言轻之本乎重也。 】虽有荣观，燕处超然。 【吴云：此言动之主乎静也。 】奈何万乘之主而以身轻天下？ 【谓以其身轻动于天下之上也。 】轻则失本（三十四），躁则失君。 二十七章 善行，无辙迹；",
      "translated_text": "Silent, oh so vast!\nStanding alone, unchanging,\nCircling endlessly without weariness.\nIt may be called the Mother of all under heaven.\nI know not its name—\nI style it \"Dao,\"\nAnd by force name it \"Great.\"\nGreat means flowing,\nFlowing means far-reaching,\nFar-reaching means returning.\nThus the Dao is great,\nHeaven is great,\nEarth is great,\nAnd the king, too, is great.\nWithin the realm, there are four greats,\nAnd the king occupies one among them.\nMan models himself on earth,\nEarth models itself on heaven,\nHeaven models itself on the Dao,\nThe Dao models itself on spontaneity.\n\nChapter Twenty-Six\nWeight is the root of lightness;\nStillness is the ruler of restlessness.\nThus the sage travels all day\nWithout parting from the heavy supply wagon.\nThough there be splendid sights,\nHe dwells serenely, transcendent.\nHow could the lord of ten thousand chariots\nTreat his person lightly before all under heaven?\nTo be light is to lose one’s root;\nTo be restless is to lose one’s ruler.\n\nChapter Twenty-Seven\nIn skillful movement,\nNo tracks are left;",
      "overlap_context": "rust.\n\nChapter Twenty-Four\nOne who stands on tiptoe does not stand firm;\nOne who strides cannot walk far;\nOne who displays himself is not luminous;\nOne who asserts himself is not distinguished;\nOne who boasts achieves no merit;\nOne who vaunts himself does not endure.\nIn the Way, these are called\n“Superfluous food and redundant conduct.”\nSome things despise them—\nTherefore those with the Dao do not abide in them.\n\nChapter Twenty-Five\nThere is a thing formed in chaos,\nBorn before heaven and earth.",
      "start_char": 4400,
      "end_char": 4658,
      "start_sentence": 318,
      "end_sentence": 335,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.282730579376221,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "善言，无瑕谪； 善数（三十五），不用筹策； 善闭，无关揵而不可开； 善结，无绳约而不可解。 是以圣人常善救人（三十六），故无弃人； 常善救物，故无弃物。 是谓袭明。 【据晁说之跋，则此数语为古本所无，独河上公本有之。 】故善人者不善人之师，不善人者善人之资。 不贵其师，不爱其资（三十七），虽智大迷，是谓要妙。 二十八章 知其雄，【以观其徼也。 】守其雌，【以观其妙也。 】为天下溪。 为天下溪：常德不离，复归于婴儿（三十八）。 知其白，守其黑，为天下式。 为天下式，常德不忒，复归于无极。 知其荣，守其辱，为天下谷。 【谷，亦水所归。 】为天下谷，常德乃足，复归于无朴（三十九）。 朴散则为器，圣人用之则为官长。 【因其器而用之，为官长。 】故大制不割。 【因而用之，故制而不割。 】 二十九章",
      "translated_text": "In skillful speech,\nNo flaws are found;\nIn skillful reckoning,\nNo counting rods are used;\nIn skillful closure,\nNo bolts or bars are needed, yet none can open;\nIn skillful binding,\nNo cords or knots are tied, yet none can untie.\nThus the sage is ever skillful in saving people,\nAnd so none are abandoned;\nEver skillful in saving things,\nAnd so nothing is discarded.\nThis is called inheriting enlightenment.\n\nTherefore, the good person is the teacher of the not-good,\nAnd the not-good person is the resource of the good.\nIf one does not value one’s teacher,\nNor cherish one’s resource,\nThough wise, one is greatly deluded.\nThis is called the essential mystery.\n\nChapter Twenty-Eight\nKnow the masculine,\nYet hold to the feminine,\nAnd be a valley to all under heaven.\nBeing a valley to all under heaven,\nOne’s constant virtue never departs,\nAnd one returns to the state of infancy.\n\nKnow the bright,\nYet hold to the dark,\nAnd be a model to all under heaven.\nBeing a model to all under heaven,\nOne’s constant virtue never errs,\nAnd one returns to the boundless.\n\nKnow glory,\nYet hold to disgrace,\nAnd be a valley to all under heaven.\nBeing a valley to all under heaven,\nOne’s constant virtue is then fulfilled,\nAnd one returns to the uncarved block.\n\nWhen the uncarved block is scattered, it becomes vessels;\nThe sage, using them, becomes a leader of officials.\nThus the great system makes no cuts.",
      "overlap_context": "Dao models itself on spontaneity.\n\nChapter Twenty-Six\nWeight is the root of lightness;\nStillness is the ruler of restlessness.\nThus the sage travels all day\nWithout parting from the heavy supply wagon.\nThough there be splendid sights,\nHe dwells serenely, transcendent.\nHow could the lord of ten thousand chariots\nTreat his person lightly before all under heaven?\nTo be light is to lose one’s root;\nTo be restless is to lose one’s ruler.\n\nChapter Twenty-Seven\nIn skillful movement,\nNo tracks are left;",
      "start_char": 4658,
      "end_char": 5000,
      "start_sentence": 336,
      "end_sentence": 361,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.98632287979126,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "将欲取天下而为之，吾见其不得已。 天下神器，不可为也。 为者败之，执者失之。 故物或行或随，【或自行，或随人。 】或歔或吹，【『歔』，河上本作『呴』。 『呴』，『温』也。 『温』，『寒』也。 】或强或羸，或挫或隳。 【『挫』，读若『莝』。 《诗》郑笺：『莝』，『委』也。 委，安也。 河上本作『载』，云：『载』，『安』也。 『隳』，『危』也。 】是以圣人去甚，去奢，去泰。 三十章 以道佐人主者，不以兵强天下，其事好还：师之所处，荆棘生焉，大军之后，必有凶年。 善有果而已（四十），【王云：『果』犹『济』也，言善用师者趣以济难而已。 】不敢以取强。 果而勿矜，果而勿伐，果而勿骄，果而不得已，果而勿强。 物壮则老，是谓不道。 不道早已。 【王云：『壮』，武力暴兴，喻以兵强于天下者也，飘风不终朝，骤雨不终日，故暴兴必不道早已也。 】 三十一章",
      "translated_text": "Those who would take all under heaven and act upon it—I see they will not succeed.\nAll under heaven is a sacred vessel; it cannot be acted upon.\nThose who act upon it ruin it; those who grasp it lose it.\n\nThus, things may lead or follow,\nmay warm or chill,\nmay strengthen or weaken,\nmay be secure or imperiled.\n\nTherefore, the sage discards excess, extravagance, and arrogance.\n\n---\n\nChapter Thirty\nOne who assists a ruler through the Dao\ndoes not dominate all under heaven with military force.\nSuch affairs tend to rebound:\nwhere armies encamp, brambles grow;\nin the wake of great armies, years of famine follow.\n\nThe good achieve their aim and stop—\nthey dare not seize dominance through force.\nHaving achieved their aim, they do not boast;\nhaving achieved their aim, they do not vaunt;\nhaving achieved their aim, they do not grow arrogant;\nhaving achieved their aim, they act only when compelled;\nhaving achieved their aim, they do not force.\n\nWhen things reach their prime, they age—\nthis is called not following the Dao.\nWhat does not follow the Dao perishes early.",
      "overlap_context": "t,\nYet hold to the dark,\nAnd be a model to all under heaven.\nBeing a model to all under heaven,\nOne’s constant virtue never errs,\nAnd one returns to the boundless.\n\nKnow glory,\nYet hold to disgrace,\nAnd be a valley to all under heaven.\nBeing a valley to all under heaven,\nOne’s constant virtue is then fulfilled,\nAnd one returns to the uncarved block.\n\nWhen the uncarved block is scattered, it becomes vessels;\nThe sage, using them, becomes a leader of officials.\nThus the great system makes no cuts.",
      "start_char": 5003,
      "end_char": 5372,
      "start_sentence": 362,
      "end_sentence": 385,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.073160171508789,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "夫佳兵不祥之器，物或恶之，故有道者不处。 【王文简云：古所谓兵者，皆指五兵而言，故曰兵者不祥之器。 『佳』，当作『隹』。 『隹』，古『唯』字。 唯兵为不祥之器，故有道者不处。 上言夫，唯下言，故文义正相承也。 】君子居则贵左，用兵则贵右。 兵者不祥之器，非君子之器，不得已而用之，恬淡为上（四十一）。 胜而不美。 而美之者，是乐杀人。 夫乐杀人者，则不可以得志于天下矣。 吉事尚左，凶事尚右。 偏将军居左，上将军居右，言以丧礼处之。 杀人之众，以哀悲莅之，战胜以丧礼处之。 【据晁说之跋，则王辅嗣以此章为非老子之言。 】",
      "translated_text": "The fine weapon is an inauspicious instrument—\nsome beings detest it,\nthus one who embodies the Dao does not dwell with it.\n\nThe noble person at rest honors the left,\nbut in deploying troops, honors the right.\nWeapons are inauspicious instruments,\nnot the instruments of the noble person.\nOnly when compelled does one employ them,\nand even then, tranquility is prized.\nTo triumph yet not exult—\nthose who exult in victory delight in slaughter.\nOne who delights in slaughter\ncannot realize their will under heaven.\n\nAuspicious affairs esteem the left,\ninauspicious affairs esteem the right.\nThe deputy general stands on the left,\nthe supreme general on the right—\nthis is to position them as if for mourning rites.\nWhen multitudes are slain,\none presides over them with grief and sorrow;\nwhen victory is won, one treats it with mourning rites.",
      "overlap_context": "ke of great armies, years of famine follow.\n\nThe good achieve their aim and stop—\nthey dare not seize dominance through force.\nHaving achieved their aim, they do not boast;\nhaving achieved their aim, they do not vaunt;\nhaving achieved their aim, they do not grow arrogant;\nhaving achieved their aim, they act only when compelled;\nhaving achieved their aim, they do not force.\n\nWhen things reach their prime, they age—\nthis is called not following the Dao.\nWhat does not follow the Dao perishes early.",
      "start_char": 5375,
      "end_char": 5623,
      "start_sentence": 386,
      "end_sentence": 401,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 5.345539569854736,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "三十二 道常无名。 朴虽小，天下莫能臣也（四十二）。 侯王若能守之，万物将自宾。 天地相合，以降甘露，民莫之令而自均。 始制有名。 名亦既有，夫亦将知止（四十三），知止可以不殆（四十四）。 譬道之在天下，犹川谷之于江海（四十五）。 三十三章 知人者智，【不得为明也。 】自知者明。 胜人者有力，【不得为强也。 】自胜者强。 知足者富，强行者有志，不失其所者久，死而不亡者寿。 三十四章 大道汜兮，其可左右。 【河上云：无所不宜。 】万物恃之而生而不辞，功成不名有。 衣养万物而不为主（四十六），常无欲可名于小（四十七）； 【『于』，犹『为』也。 】万物归焉而不为主，可名为大（四十八）。 以其终不自为大（四十九），故能成其大。 三十五章 执大象，天下徃。 【河上云：『象』，『道』也。 圣人率大道则天下万物移心归徃之也（五十）。 】徃而不害，安平太（五十一），【河上云：万物归徃而不伤害则国家安宁而致太平矣（五十二）。 】乐与饵，过客止。 【有声与味，众人悦之。 】道之出口，淡乎其无味，视之不足见，听之不足闻，用之不足既（五十三）。 【吴云：客既过去，则其声容与味亦出而无复有。 】",
      "translated_text": "Chapter Thirty-Two\nThe Dao is eternally nameless.\nThough the uncarved block is small,\nnone under heaven can make it a servant.\nIf lords and kings could guard it,\nthe myriad things would of themselves submit.\nHeaven and earth unite\nto send down sweet dew,\nand the people, without being commanded, distribute it evenly.\n\nOnce the system of names begins,\nnames too will have their limits.\nKnowing the limit, one may avoid peril.\nThe Dao’s presence in the world\nis like valley streams flowing to rivers and seas.\n\nChapter Thirty-Three\nOne who knows others is wise,\nbut one who knows oneself is enlightened.\nOne who conquers others has force,\nbut one who conquers oneself is strong.\nOne who knows contentment is rich.\nOne who acts with vigor has resolve.\nOne who does not lose their place endures.\nOne who dies yet does not perish enjoys long life.\n\nChapter Thirty-Four\nThe great Dao flows everywhere,\nto left and right alike.\nThe myriad things depend on it for life, yet it does not refuse them.\nIts work is accomplished, yet it claims no possession.\nIt clothes and nourishes the myriad things yet does not lord over them—\nthus it may be called small.\nThe myriad things return to it, yet it does not lord over them—\nthus it may be called great.\nBecause it never regards itself as great,\nit is able to fulfill its greatness.\n\nChapter Thirty-Five\nHold to the great image,\nand all under heaven will come to you.\nThey come without harm,\nand find peace, safety, and great abundance.\nMusic and fine food\nmay make the passing traveler pause.\nBut when the Dao is spoken,\nit is so bland as to seem flavorless.\nLook at it—it cannot be seen.\nListen to it—it cannot be heard.\nUse it—it cannot be exhausted.",
      "overlap_context": "en, tranquility is prized.\nTo triumph yet not exult—\nthose who exult in victory delight in slaughter.\nOne who delights in slaughter\ncannot realize their will under heaven.\n\nAuspicious affairs esteem the left,\ninauspicious affairs esteem the right.\nThe deputy general stands on the left,\nthe supreme general on the right—\nthis is to position them as if for mourning rites.\nWhen multitudes are slain,\none presides over them with grief and sorrow;\nwhen victory is won, one treats it with mourning rites.",
      "start_char": 5626,
      "end_char": 6132,
      "start_sentence": 402,
      "end_sentence": 433,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.164748907089233,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "三十六章 将欲『歙』之（五十四），必固张之； 将欲弱之（五十五），必固强之； 将欲废之，必固兴之； 将欲夺之，必固与之。 是谓微明，【阴谋藏于内，不露于外也。 】柔弱胜刚强。 鱼不可脱于渊，【不可失其所依据。 】国之利器不可以示人。 示人则恐失之。 三十七章 道常无为而无不为。 侯王若能守之（五十六），万物将自化。 化而欲作，吾将镇之以无名之朴。 【河上云：复欲作巧伪者，侯王当身镇抚以道德。 】无名之朴，夫亦将无欲（五十七）。 【夫指民而言。 】不欲以静，【无形，静也。 】天下将自定。 三十八章 上德不德，是以有德。 【王云：惟道是用，不德其德。 《韩非》云：德者，内也； 得者，外也。 上德不德，言其神不淫于外也。 又云：不得则有德。 】下德不失德，是以无德。 上德无为而无以为。 【《韩非》云：意无所制也。 】下德为之而有以为。 【王云：凡不能无为而为之者，皆下德也。 仁义礼节是也。 】上仁为之而无以为，上义为之而有以为。 上礼为之而莫之应，则攘臂而扔之（五十八）。 【王云：极下德之量上仁是也。 足以及于无以为而犹为之耶。",
      "translated_text": "Chapter Thirty-Six\nTo intend to contract it,\none must first surely expand it;\nto intend to weaken it,\none must first surely strengthen it;\nto intend to abolish it,\none must first surely exalt it;\nto intend to seize it,\none must first surely give it.\nThis is called subtle illumination—\nthe hidden brightness where schemes lie concealed within, never revealed without.\nThe soft and weak overcome the hard and strong.\nFish must not be taken from the depths—\nthey must not lose their place of reliance.\nThe state’s sharp instruments must not be shown to others.\nTo show them is to risk losing them.\n\nChapter Thirty-Seven\nThe Dao ever acts without acting, yet nothing is left undone.\nShould lords and kings hold fast to it,\nthe myriad things will transform of themselves.\nTransformed, should desire arise,\nI shall press it down with the nameless uncarved block.\nThe nameless uncarved block—\nit too will be without desire.\nWithout desire, through stillness,\nall under heaven will settle of itself.\n\nChapter Thirty-Eight\nHighest virtue does not act as virtue—\nthus it possesses virtue.\nLower virtue does not lose virtue—\nthus it possesses no virtue.\nHighest virtue acts without acting and without purpose.\nLower virtue acts with purpose and intention.\nHighest benevolence acts without purpose,\nhighest righteousness acts with purpose.\nHighest ritual acts, yet if none respond,\nit rolls up its sleeves and drags them along.",
      "overlap_context": "s not lord over them—\nthus it may be called great.\nBecause it never regards itself as great,\nit is able to fulfill its greatness.\n\nChapter Thirty-Five\nHold to the great image,\nand all under heaven will come to you.\nThey come without harm,\nand find peace, safety, and great abundance.\nMusic and fine food\nmay make the passing traveler pause.\nBut when the Dao is spoken,\nit is so bland as to seem flavorless.\nLook at it—it cannot be seen.\nListen to it—it cannot be heard.\nUse it—it cannot be exhausted.",
      "start_char": 6135,
      "end_char": 6600,
      "start_sentence": 434,
      "end_sentence": 469,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.446601390838623,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "《韩非》云：仁者谓中心欣然爱人，其喜人之有福而恶人之有祸也。 生心之所不能已也，非求其报也。 又云：义者，宜也。 宜而为之，故曰上义。 为之而有以为也。 王云：礼者，尚好修敬，校责往不对之间忿怒生焉。 故曰上礼。 为之而莫之应，则攘臂而扔之也。 】故失道而后德，【王云：大之极也，其为道乎？ 虽盛业大富而有万物，犹各得其德，虽贵以无为用不能舍，无以为体也。 不能舍，无以为体，则失其为大矣。 所谓失道而后德也。 故失道而后德。 】失德而后仁，失仁而后义，失义而后礼。 夫礼者，忠信之薄而乱之首。 前识者，道之华而愚之始。 是以大丈夫处其厚，不居其薄； 处其实，不居其华。 故去彼取此。 三十九章 昔之得一者：天得一以清，地得一以宁，神得一以灵，谷得一以盈，万物得一以生，侯王得一以为天下贞（五十九）。 其致之。 天无以清，将恐裂； 【不得一则无以清。 】地无以宁，将恐发； 神无以灵，将恐歇； 谷无以盈，将恐竭； 万物无以生，将恐灭； 侯王无以贵高，【『贵高』当为『贞』。 】将恐蹶（六十）。 故贵以贱为本，高以下为基。 是以侯王自谓孤、寡、不榖（六十一）。 此非以贱为本耶？ 非乎？ 故致数舆无舆（六十二）。 不欲琭琭如玉，珞珞如石（六十三）。 【王云：体尽于形，故不欲也。 】 四十章",
      "translated_text": "The *Hanfeizi* states: \"Benevolence (*ren*) means to delight in loving others from the heart, to rejoice in their good fortune and grieve at their misfortune—an impulse the mind cannot suppress, not done for the sake of reward.\" It further says: \"Righteousness (*yi*) is appropriateness. Acting as is appropriate, thus it is called 'highest righteousness.' It acts with purpose and intention.\" Wang [Bi] comments: \"Ritual (*li*) exalts refined reverence; when reciprocation is lacking, resentment arises. Thus it is called 'highest ritual.' When none respond, it rolls up its sleeves and drags them along.\"\n\nTherefore, the loss of the Dao gives rise to virtue;\n**[Wang comments: \"The greatest of all—could this not be the Dao? Though its achievements are vast and its wealth boundless, possessing the myriad things, each still attains its own virtue. Yet if it cannot employ non-action or abandon purpose as its essence, then it has lost its greatness. This is what is meant by 'the loss of the Dao gives rise to virtue.'\" ]**\nthe loss of virtue gives rise to benevolence,\nthe loss of benevolence gives rise to righteousness,\nthe loss of righteousness gives rise to ritual.\nRitual is the thinning of loyalty and trust, the beginning of chaos.\nForethought is the flower of the Dao, the onset of folly.\nThus the great person dwells in the substantial, not the superficial;\nin the fruit, not the flower.\nTherefore, they discard that and embrace this.\n\nChapter Thirty-Nine\nOf old, those who attained the One:\nHeaven attained the One and became clear,\nEarth attained the One and became tranquil,\nthe spirits attained the One and became numinous,\nthe valleys attained the One and became full,\nthe myriad things attained the One and came to life,\nlords and kings attained the One and became the standard for all under heaven.\nPushing this to its limit:\nWere heaven not thus clear, it would fear splitting;\n**[Without the One, it would have no means to be clear.]**\nwere earth not thus tranquil, it would fear erupting;\nwere the spirits not thus numinous, they would fear vanishing;\nwere the valleys not thus full, they would fear drying up;\nwere the myriad things not thus alive, they would fear perishing;\nwere lords and kings not thus noble and exalted,\n**[‘Noble and exalted’ should read ‘the standard.’]**\nthey would fear toppling.\nThus the noble takes the lowly as its root,\nthe high takes the low as its foundation.\nTherefore lords and kings call themselves \"the orphaned,\" \"the widowed,\" \"the unworthy.\"\nIs this not taking the lowly as their root? Is it not so?\nThus, to amass many carriages is to have no carriage.\nDesire not to gleam like jade or glint like stone.\n**[Wang comments: \"When form exhausts its substance, this is not desired.\"]**\n\nChapter Forty",
      "overlap_context": ".\nWithout desire, through stillness,\nall under heaven will settle of itself.\n\nChapter Thirty-Eight\nHighest virtue does not act as virtue—\nthus it possesses virtue.\nLower virtue does not lose virtue—\nthus it possesses no virtue.\nHighest virtue acts without acting and without purpose.\nLower virtue acts with purpose and intention.\nHighest benevolence acts without purpose,\nhighest righteousness acts with purpose.\nHighest ritual acts, yet if none respond,\nit rolls up its sleeves and drags them along.",
      "start_char": 6600,
      "end_char": 7125,
      "start_sentence": 470,
      "end_sentence": 508,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.889997482299805,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "反者道之动，弱者道之用。 天下万物生于有，有生于无。 四十一章 上士闻道，勤而行之； 中士闻道，若存若亡； 下士闻道，大笑之。 不笑不足以为道！ 故建言有之：【引古语也。 】『明道若昧，进道若退，夷道若颣，上德若谷，大白若辱，广德若不足，建德若偷，【建立偷惰。 】质真若渝，大方无隅，大器晚成，大音希声，大象无形。 』道隐无名，夫唯道，善贷且成。 四十二章 道生一，【此即周濂溪所谓无极而太极也。 一生二，二者，阴阳也。 二生三，一阴一阳，中有冲气，为三也。 】三生万物。 万物负阴而抱阳，冲气以为和。 人之所恶唯孤、寡、不榖（六十四）。 而王公以为称。 故物或损之而益； 或益之而损。 人之所教，我亦教之：【河上云：言我教众人，使去强为弱，去刚为柔。 】『强梁者不得其死。 』吾将以为教父。 四十三章 天下之至柔驰骋天下之至坚。 无有入无间。 吾是以知无为之有益（六十五）。 不言之教，无为之益，天下希及之。 四十四章 名与身孰亲？ 身与货孰多？ 【吴云：多，犹云所重。 】得与亡孰病？ 【王云：得多利而亡其身，何者为病也。 按：王注『多』当作『名』。 】是故甚爱必大费，多藏必厚亡。 知足不辱，知止不殆，可以长久。 四十五章 大成若缺，其用不弊。 大盈若冲，其用不穷。 大直若屈，大巧若拙，大辩若讷。 【此所谓『反』也。 】躁胜寒，静胜热，【专以『静胜热』为喻，其言『躁胜寒』者兼及之耳。 】清静为天下正。 四十六章",
      "translated_text": "The movement of the Dao is return;\nits function is weakness.\nAll things under heaven are born from being,\nbeing is born from non-being.\n\nChapter Forty-One\n\nWhen superior scholars hear of the Dao, they diligently practice it;\nmiddling scholars hear of the Dao, and it seems to exist or not;\ninferior scholars hear of the Dao, and they laugh loudly at it.\nIf it were not laughed at, it would not suffice to be the Dao!\nThus the established sayings have it:\n“The luminous Dao seems dark,\nthe advancing Dao seems to retreat,\nthe level Dao seems uneven,\nsupreme virtue resembles a valley,\ngreat purity seems sullied,\nample virtue seems insufficient,\nestablished virtue seems indolent,\nsubstance true seems altered,\nthe great square has no corners,\nthe great vessel is late in completion,\nthe great tone is soundless,\nthe great image has no form.”\nThe Dao is hidden and nameless.\nOnly the Dao is good at bestowing and completing.\n\nChapter Forty-Two\n\nThe Dao gives birth to the One,\nthe One gives birth to the Two,\nthe Two gives birth to the Three,\nthe Three gives birth to the myriad things.\nThe myriad things bear yin and embrace yang,\nand through the blending of qi they achieve harmony.\nWhat people dislike are only “the orphaned,” “the widowed,” and “the unworthy,”\nyet kings and dukes use these as their titles.\nThus things may be diminished yet gain,\nor increased yet lose.\nWhat others teach, I also teach:\n“The strong and violent do not meet a natural death.”\nI take this as the father of all teachings.\n\nChapter Forty-Three\n\nThe softest under heaven gallops through the hardest under heaven.\nNon-being enters where there is no gap.\nThrough this I know the benefit of non-action.\nTeaching without words,\nthe benefit of non-action—\nfew under heaven attain these.\n\nChapter Forty-Four\n\nFame or self—which is dearer?\nSelf or wealth—which is greater?\nGain or loss—which is more harmful?\nThus excessive love incurs great cost,\nhoarding much incurs heavy loss.\nKnowing contentment brings no disgrace,\nknowing when to stop brings no danger—\nthis is how to endure long.\n\nChapter Forty-Five\n\nGreat perfection seems flawed, yet its use is inexhaustible;\ngreat fullness seems empty, yet its use is unending.\nGreat straightness seems bent,\ngreat skill seems clumsy,\ngreat eloquence seems inarticulate.\nRestlessness overcomes cold,\nstillness overcomes heat—\npurity and stillness set the standard for all under heaven.",
      "overlap_context": "and exalted’ should read ‘the standard.’]**\nthey would fear toppling.\nThus the noble takes the lowly as its root,\nthe high takes the low as its foundation.\nTherefore lords and kings call themselves \"the orphaned,\" \"the widowed,\" \"the unworthy.\"\nIs this not taking the lowly as their root? Is it not so?\nThus, to amass many carriages is to have no carriage.\nDesire not to gleam like jade or glint like stone.\n**[Wang comments: \"When form exhausts its substance, this is not desired.\"]**\n\nChapter Forty",
      "start_char": 7128,
      "end_char": 7762,
      "start_sentence": 509,
      "end_sentence": 554,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.616415739059448,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "天下有道，却走马以粪； 【河上云：『粪』者，粪田也。 】天下无道，戎马生于郊。 祸莫大于不知足（六十六），咎莫大于欲得。 故知足之足常足矣（六十七）。 四十七章 不出户，知天下。 不窥牖（六十八），见天道。 其出弥远，其知弥少。 【出而求知，则神逐于外，出弥远，知弥少也。 】是以圣人不行而知，不见而名，不为而成。 四十八章 为学日益，为道日损，损之又损，以至于无为。 无为而无不为。 取天下常以无事。 及其有事，不足以取天下。 四十九章 圣人无常心，以百姓心为心。 善者吾善之，不善者吾亦善之，德善。 【善与不善不必分别，则不见有不善者而得善矣。 『德』，读若『得』。 下同。 六十二章『人之不善，何弃之有。 』】信者吾信之，不信者吾亦信之，德信。 圣人在天下，歙歙为天下浑其心（六十九），百姓皆注其耳目，圣人皆孩之。 五十章 出生入死。",
      "translated_text": "Chapter Forty-Six\n\nWhen the Way prevails under heaven,\nwarhorses are retired to fertilize the fields.\nWhen the Way is lost under heaven,\nwarhorses breed on the outskirts.\nNo misfortune is greater than not knowing contentment;\nno fault is greater than the desire for gain.\nThus, the contentment of knowing contentment is ever content.\n\nChapter Forty-Seven\n\nWithout stepping outside, one knows all under heaven.\nWithout gazing through the window, one sees the Way of heaven.\nThe farther one goes, the less one knows.\nTherefore the sage knows without traveling,\nnames without seeing,\naccomplishes without acting.\n\nChapter Forty-Eight\n\nIn the pursuit of learning, one gains day by day.\nIn the pursuit of the Way, one loses day by day.\nLosing and losing again,\nuntil one reaches non-action.\nThrough non-action, nothing is left undone.\nTo take all under heaven, one must act without ado.\nWhen there is ado, it is no longer sufficient to take all under heaven.\n\nChapter Forty-Nine\n\nThe sage has no constant mind,\nbut takes the mind of the people as their own.\nThe good I treat as good,\nthe not-good I also treat as good—thus attaining virtue in goodness.\nThe trustworthy I trust,\nthe untrustworthy I also trust—thus attaining virtue in trust.\nThe sage, in the world,\ncontracts their spirit for the world to harmonize their mind.\nThe people all fix their ears and eyes upon them,\nand the sage treats them all as children.\n\nChapter Fifty\n\nEmerging into life, entering into death.",
      "overlap_context": "ncurs great cost,\nhoarding much incurs heavy loss.\nKnowing contentment brings no disgrace,\nknowing when to stop brings no danger—\nthis is how to endure long.\n\nChapter Forty-Five\n\nGreat perfection seems flawed, yet its use is inexhaustible;\ngreat fullness seems empty, yet its use is unending.\nGreat straightness seems bent,\ngreat skill seems clumsy,\ngreat eloquence seems inarticulate.\nRestlessness overcomes cold,\nstillness overcomes heat—\npurity and stillness set the standard for all under heaven.",
      "start_char": 7765,
      "end_char": 8159,
      "start_sentence": 555,
      "end_sentence": 581,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.694126844406128,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "【《韩非》云：人始于生而卒于死。 始之谓出，卒之谓入。 】生之徒十有三，死之徒十有三，人之生，动之死地亦十有三（七十）。 夫何故？ 以其生生之厚。 【『之十有三』，王本作『亦十有三』。 今从《韩非》所引改。 王云：『十有三』犹云『十分有三分，取其生道全生之极十分有三耳； 取死之道全死之极亦十分有三耳，而民生生之厚更之无生之地焉』。 澧谓此言死地但十分有三分耳，而人皆趋此三分也。 】盖闻善摄生者，陆行不遇兕虎，入军不被甲兵（七十一）。 兕无所投其角，虎无所措其爪，兵无所容其刃。 夫何故？ 以其无死地。",
      "translated_text": "The *Hanfeizi* states: \"Humans begin with life and end with death. The beginning is called 'emerging,' the end is called 'entering.'\"\n\nOf those who follow the way of life, ten or three do so; of those who follow the way of death, ten or three do so. Yet among those who live, ten or three move toward the realm of death. Why is this? Because they overindulge in the pursuit of life.\n\nI have heard that those skilled in nurturing life, when traveling on land, do not encounter rhinoceroses or tigers; when entering battle, they are not struck by armor or weapons. The rhinoceros finds no place to thrust its horn, the tiger no place to sink its claws, the weapon no place to lodge its blade. Why is this? Because they do not enter the realm of death.",
      "overlap_context": "ine\n\nThe sage has no constant mind,\nbut takes the mind of the people as their own.\nThe good I treat as good,\nthe not-good I also treat as good—thus attaining virtue in goodness.\nThe trustworthy I trust,\nthe untrustworthy I also trust—thus attaining virtue in trust.\nThe sage, in the world,\ncontracts their spirit for the world to harmonize their mind.\nThe people all fix their ears and eyes upon them,\nand the sage treats them all as children.\n\nChapter Fifty\n\nEmerging into life, entering into death.",
      "start_char": 8159,
      "end_char": 8398,
      "start_sentence": 582,
      "end_sentence": 595,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 4.056499481201172,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 20,
      "original_text": "五十一章 道生之，德畜之，物形之，势成之。 是以万物莫不尊道而贵德。 道之尊，德之贵，夫莫之命而常自然。 故道生之，德畜之，长之育之，亭之毒之（七十二），养之覆之，生而不有，为而不恃，长而不宰，是谓玄德。 五十二章 天下有始，以为天下母。 既得其母（七十三），以知其子（七十四）。 既知其子，复守其母，没身不殆。 塞其兑，闭其门，终身不勤。 【王云：无事永逸，故终身不勤也。 】开其兑，济其事，终身不救。 见小曰明，守柔曰强。 用其光，复归其明，无遗身殃，是谓袭常（七十五）。 五十三章 使我介然有知，行于大道，唯施是畏。 大道其夷（七十六），而民好径。 朝甚除，【王云：『朝』，『宫室』也。 『除』，『洁好』也。 】田甚芜，仓甚虚，服文彩（七十七）。 带利剑，厌饮食，财货有余，是谓盗夸（七十八）。 非道也哉（七十九）！ 五十四章",
      "translated_text": "Chapter Fifty-One\nThe Dao gives them life, virtue nurtures them, things shape them, and circumstances complete them. Thus, the myriad things without exception revere the Dao and honor virtue. The Dao’s reverence, virtue’s honor—none commands them, yet they ever remain spontaneous. Therefore, the Dao gives them life, virtue nurtures them, fosters their growth, nourishes their maturity, refines and ripens them, shelters and protects them. It gives life yet does not possess, acts yet does not rely, leads yet does not dominate—this is called profound virtue.\n\nChapter Fifty-Two\nThe world has a beginning, which serves as the world’s mother. Once you grasp the mother, you know her children. Once you know the children, return to abide by the mother, and to the end of your days you will not be imperiled. Block its openings, shut its gates, and to the end of your life you will not toil. Open its openings, meddle in its affairs, and to the end of your life you will not be saved. Seeing the small is called clarity; guarding the soft is called strength. Employing its light, returning to its clarity, leaving no misfortune for the self—this is called following the constant.\n\nChapter Fifty-Three\nIf I were suddenly endowed with knowledge and walked the great Dao, only deviance would I fear. The great Dao is level, yet the people prefer shortcuts. The court is excessively adorned, the fields are excessively overgrown, the granaries are excessively empty. They wear embroidered garments, carry sharp swords, sate themselves with food and drink, and possess surplus wealth and goods—this is called the boastfulness of thieves. How far is this from the Dao!\n\nChapter Fifty-Four",
      "overlap_context": " Yet among those who live, ten or three move toward the realm of death. Why is this? Because they overindulge in the pursuit of life.\n\nI have heard that those skilled in nurturing life, when traveling on land, do not encounter rhinoceroses or tigers; when entering battle, they are not struck by armor or weapons. The rhinoceros finds no place to thrust its horn, the tiger no place to sink its claws, the weapon no place to lodge its blade. Why is this? Because they do not enter the realm of death.",
      "start_char": 8402,
      "end_char": 8785,
      "start_sentence": 596,
      "end_sentence": 618,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.592049598693848,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 21,
      "original_text": "善建者不拔，善抱者不脱，子孙以祭祀不辍（八十）。 修之于身，其德乃真； 修之于家，其德乃余； 修之于乡，其德乃长； 修之于邦，【『邦』，各本作『国』。 汉人避讳改也。 此依《韩非》。 『邦』、『丰』为韵。 】其德乃丰； 修之于天下，其德乃普。 故以身观身，以家观家，以乡观乡，以国观邦（八十一），以天下观天下。 吾何以知天下然哉（八十二）？ 以此。 五十五章 含德之厚，比于赤子。 蜂虿虺蛇不螫（八十三），猛兽不据，攫鸟不搏（八十四）。 骨弱筋柔而握固。 未知牝牡之合而作（八十五）， 【『』，《释文》本一作『脧』，《说文》：赤子阴也。 】精之至也。 终日号而不嗄，【『嗄』，河上本作『哑』。 】和之至也。 知和曰常，知常曰明，【句与十章同。 益生日祥，吴云：『祥』，『妖』也。 】心使气曰强。 物壮则老，谓之不道，不道早已。 【三十章亦云：『物壮则老，是谓不道，不道早已。 』】 五十六章",
      "translated_text": "The well-established cannot be uprooted; the well-embraced cannot slip away. Thus, descendants perform sacrifices without cease.\n\nCultivate it in the self, and its virtue becomes genuine;\ncultivate it in the family, and its virtue becomes abundant;\ncultivate it in the village, and its virtue becomes enduring;\ncultivate it in the state, and its virtue becomes bountiful;\ncultivate it in the world, and its virtue becomes universal.\n\nTherefore, observe the self through the self,\nobserve the family through the family,\nobserve the village through the village,\nobserve the state through the state,\nobserve the world through the world.\nHow do I know the world is thus?\nBy this.\n\nChapter Fifty-Five\nOne whose virtue is profoundly embodied is like a newborn babe.\nWasps, scorpions, vipers, and snakes do not sting;\nfierce beasts do not seize,\nbirds of prey do not strike.\nThough bones are weak and sinews soft, the grasp is firm.\nUnknowing of the union of female and male, the organ stirs—\nthis is the perfection of essence.\nCrying all day without hoarseness—\nthis is the perfection of harmony.\nTo know harmony is called the constant;\nto know the constant is called clarity.\nTo indulge life is called ominous;\nto let the mind command the qi is called force.\nWhen things reach their prime, they age—\nthis is called contrary to the Dao.\nWhat is contrary to the Dao perishes early.",
      "overlap_context": "hapter Fifty-Three\nIf I were suddenly endowed with knowledge and walked the great Dao, only deviance would I fear. The great Dao is level, yet the people prefer shortcuts. The court is excessively adorned, the fields are excessively overgrown, the granaries are excessively empty. They wear embroidered garments, carry sharp swords, sate themselves with food and drink, and possess surplus wealth and goods—this is called the boastfulness of thieves. How far is this from the Dao!\n\nChapter Fifty-Four",
      "start_char": 8788,
      "end_char": 9182,
      "start_sentence": 619,
      "end_sentence": 647,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.039359092712402,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 22,
      "original_text": "知者不言，言者不知。 塞其兑，闭其门，挫其锐，解其纷，和其光，同其尘，是谓玄同，故不可得而亲，不可得而疏（八十六）。 不可得而利，不可得而害（八十七）。 不可得而贵，不可得而贱（八十八）。 故为天下贵。 五十七章 以正治国，以奇用兵，以无事取天下。 吾何以知其然哉？ 以此：【『吾何以』云云，当为上章之结语。 】天下多忌讳而民弥贫； 民多利器，国家滋昏； 人多伎巧，奇物滋起； 法令滋彰（八十九），盗贼多有，故圣人云：『我无为而民自化，我好静而民自正，我无事而民自富，我无欲而民自朴。 』 五十八章",
      "translated_text": "The wise do not speak;\nthose who speak are not wise.\nBlock the openings,\nshut the gates,\nblunt the sharpness,\nuntangle the knots,\nsoften the glare,\nmerge with the dust—\nthis is called profound sameness.\nThus, one cannot be drawn near,\ncannot be kept distant,\ncannot be benefited,\ncannot be harmed,\ncannot be honored,\ncannot be debased.\nTherefore, one is esteemed by all under heaven.\n\nChapter Fifty-Seven\nGovern the state with uprightness,\ndeploy troops with cunning,\nwin the world through nonaction.\nHow do I know this is so?\nBy this:\nThe more taboos in the world, the poorer the people;\nthe more sharp tools the people possess, the more benighted the state;\nthe more skills and crafts people master, the more strange things arise;\nthe more laws and decrees are proclaimed,\nthe more thieves and bandits appear.\nThus the sage declares:\n“I practice nonaction, and the people transform themselves;\nI cherish stillness, and the people rectify themselves;\nI engage in no affairs, and the people enrich themselves;\nI am without desire, and the people simplify themselves.”",
      "overlap_context": " bones are weak and sinews soft, the grasp is firm.\nUnknowing of the union of female and male, the organ stirs—\nthis is the perfection of essence.\nCrying all day without hoarseness—\nthis is the perfection of harmony.\nTo know harmony is called the constant;\nto know the constant is called clarity.\nTo indulge life is called ominous;\nto let the mind command the qi is called force.\nWhen things reach their prime, they age—\nthis is called contrary to the Dao.\nWhat is contrary to the Dao perishes early.",
      "start_char": 9185,
      "end_char": 9441,
      "start_sentence": 648,
      "end_sentence": 662,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 5.667018175125122,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 23,
      "original_text": "其政闷闷，其民醇醇。 其政察察，其民缺缺。 祸兮，福之所倚； 福兮，祸之所伏。 孰知其极？ 其无正。 正复为奇，善复为妖（九十），人之迷（九十一），其日固乆！ 是以圣人方而不割，廉而不刿（九十二），直而不肆，光而不耀（九十三）。 五十九章 治人、事天莫若啬。 夫惟啬，是谓早服。 【《韩非》云：啬之者，爱其精神，啬其智识也。 啬之为术也，生于道理。 众人离于患，陷于祸，犹未知退而不服从道理。 圣人维未见祸患之形虚无，服从于道理。 故曰：夫唯啬，是谓早服。 】早服谓之重积德。 重积德则无不克（九十四），无不克则莫知其极。 莫知其极，可以有国。 有国之母，【《韩非》云：『母』者，『道』也； 道也者，生于所以有国之术，故谓之有国之母。 】可以长久。 是谓深根、固柢、长生久视之道。 六十章 治大国若烹小鲜。 王云：不扰也。 以道莅天下，其鬼不神。 【神，灵也。 】非其鬼不神，其神不伤人。 【非鬼不灵，乃其灵气潜处于幽阴不出而惊扰生人也。 】非其神不伤人，【非独其神不伤人。 】圣人亦不伤人，【阴不惊扰阳，圣不惊扰愚。 】夫两不相伤，故德交归焉。 【不伤人者，圣人之德。 鬼不伤人，亦由圣人以道莅天下故也。 故德交归于圣人矣。 】",
      "translated_text": "When governance is muddled, the people are simple and honest.\nWhen governance is meticulous, the people are lacking and flawed.\nMisfortune—where fortune leans;\nFortune—where misfortune lurks.\nWho knows their ultimate end?\nThere is no constant norm.\nThe norm reverts to the strange,\ngoodness reverts to the ominous.\nThe people’s delusion\nhas endured for so long!\n\nThus the sage is square but does not cut,\nhas edges but does not wound,\nis straight but not overbearing,\nbright but not dazzling.\n\nChapter Fifty-Nine\nIn governing people and serving heaven,\nnothing surpasses frugality.\nOnly through frugality\ncan one be said to submit early.\nEarly submission is called the repeated accumulation of virtue.\nWith repeated accumulation of virtue, there is nothing one cannot overcome;\nwith nothing one cannot overcome, none can fathom one’s limits.\nWhen none can fathom one’s limits,\none can possess the state.\nPossessing the state’s mother,\none can endure long.\nThis is called the Way of deep roots, firm foundation,\nlong life, and enduring vision.\n\nChapter Sixty\nGoverning a great state\nis like cooking a small fish.\nWang says: Do not disturb it.\nWhen the Dao presides over the world,\nits ghosts do not manifest their numinosity.\nNot that the ghosts lack numinosity—\ntheir numinosity does not harm people.\nNot only does their numinosity not harm people,\nthe sage also does not harm people.\nAs neither harms the other,\ntheir virtues converge and return.",
      "overlap_context": "he poorer the people;\nthe more sharp tools the people possess, the more benighted the state;\nthe more skills and crafts people master, the more strange things arise;\nthe more laws and decrees are proclaimed,\nthe more thieves and bandits appear.\nThus the sage declares:\n“I practice nonaction, and the people transform themselves;\nI cherish stillness, and the people rectify themselves;\nI engage in no affairs, and the people enrich themselves;\nI am without desire, and the people simplify themselves.”",
      "start_char": 9444,
      "end_char": 9950,
      "start_sentence": 663,
      "end_sentence": 699,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.211363554000854,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 24,
      "original_text": "六十一章 大国者下流，天下之交，天下之牝。 牝常以静胜，牝以静为下（九十五）。 故大国以下小国，则取小国。 小国以下大国，则取大国。 故或下以取，或下而取。 大国不过欲兼畜人，小国不过欲入事人。 夫两者各得其所故（九十六），大者宜为下。 六十二章 道者，万物之奥，善人之宝，不善人之所保。 美言可以市，尊行可以加人。 人之不善，何弃之有？ 故立天子，置三公，虽有拱璧，以先驷马，不如坐进此道。 古之所以贵此道者何？ 不曰以求得，有罪以免邪（九十七）？ 故为天下贵。 六十三章 为无为，事无事，味无味。 大小多少，报怨以德。 【《论语》『以德报怨，何如？ 』或即老氏之流也。 】图难于其易； 为大于其细。 天下难事，必作于易； 天下大事，必作于细。 是以圣人终不为大，故能成其大。 夫轻诺必寡信，多易必易多难（九十八）。 是以圣人犹难之，故终无难矣（九十九）。 六十四章 其安易持； 其未兆易谋； 其脆易泮（一百）； 其微易散。 为之于未有，王云：谓其安未兆也。 治之于未乱。 【王云：谓微脆也。 澧谓：此以上言慎始。 】合抱之木，生于毫末； 九层之台，起于累土； 千里之行，始于足下。 【此所谓万物之自然也。 】为者败之； 执者失之。 【为者助长，执者自尽。 】是以圣人无为（一百零一），故无败； 无执，故无失。 【所谓辅万物之自然。 】民之从事，常于几成而败之。 【王云：不慎终也。 】慎终如始，则无败事。 是以圣人欲不欲，【『欲不欲』犹言『志在不欲』也。 】不贵难得之货； 学不学，复众人之所过。 【王云：不学而能者，自然也。 澧谓『学不学』犹云『学为自然』，众人之学过于自然，当复之也。 】以辅万物之自然而不敢为。 六十五章 古之善为道者，非以明民，将以愚之。 【秦法如此。 】民之难治，以其智多。 故以智治国（一百零二），国之贼； 不以智治国，国之福。 知此两者亦稽式（一百零三）。 常知稽式，是谓玄德。 玄德深矣，远矣，与物反矣。 然后乃至大顺（一百零四）。 六十六章",
      "translated_text": "**Chapter Sixty-One**\nA great state is the lower reaches of the river,\nthe confluence of all under heaven,\nthe female of all under heaven.\nThe female ever overcomes the male through stillness,\nfor stillness is the way of the lowly.\n\nThus, when a great state humbles itself before a small state,\nit wins the allegiance of the small state.\nWhen a small state humbles itself before a great state,\nit wins the favor of the great state.\nTherefore, some humble themselves to gain,\nwhile others gain through humility.\nA great state desires no more than to shelter and nurture others,\na small state desires no more than to serve and attend others.\nWhen both attain what they seek,\nthe greater must take the lower position.\n\n**Chapter Sixty-Two**\nThe Dao is the mystery of the ten thousand things,\nthe treasure of the good,\nthe refuge of the not-good.\nFine words can be traded in the marketplace,\nnoble conduct can elevate others.\nIf people are not good,\nwhy should they be cast aside?\nTherefore, when the Son of Heaven is established\nand the Three Ministers appointed,\nthough one may offer a jade disc preceded by a team of four horses,\nit is not equal to sitting and presenting this Dao.\nWhy was this Dao so valued in ancient times?\nDid they not say: \"Through it, one attains what one seeks,\nand with it, the guilty may be spared\"?\nThus it is prized by all under heaven.\n\n**Chapter Sixty-Three**\nAct through non-action,\nattend to affairs through non-affairs,\nsavor the flavorless.\nRegard the small as great, the few as many,\nrepay resentment with virtue.\n\nPlan for difficulty while it is still easy;\nundertake the great while it is still small.\nThe difficult affairs of the world\nmust begin with what is easy;\nthe great affairs of the world\nmust begin with what is small.\nTherefore, the sage never attempts the great,\nand thus accomplishes the great.\nOne who makes promises lightly will seldom keep faith;\none who takes things lightly will surely encounter many difficulties.\nTherefore, the sage treats all as difficult,\nand thus never meets with difficulty.\n\n**Chapter Sixty-Four**\nWhat is at rest is easily maintained;\nwhat has not yet shown signs is easily forestalled;\nwhat is fragile is easily dissolved;\nwhat is minute is easily scattered.\nAct before things arise;\ngovern before disorder begins.\n\nA tree as wide as a man’s embrace grows from a tiny shoot;\na nine-tiered terrace rises from a basket of earth;\na journey of a thousand *li* begins beneath one’s feet.\nThose who act will fail;\nthose who grasp will lose.\nTherefore, the sage acts not,\nand so does not fail;\ngrasps not,\nand so does not lose.\n\nIn their undertakings, people often fail when near completion.\nIf one is as careful at the end as at the beginning,\nthere will be no failure.\nTherefore, the sage desires what others do not desire,\ndoes not prize goods hard to obtain;\nlearns what others do not learn,\nand restores what the multitude has passed over.\nThus, he aids the spontaneity of the ten thousand things\nand does not dare to act.\n\n**Chapter Sixty-Five**\nThose of old who were skilled in the Dao\ndid not use it to enlighten the people,\nbut to make them simple.\nThe people are difficult to govern\nbecause they are too clever.\nTherefore, to govern the state with cleverness\nis the state’s ruin;\nnot to govern the state with cleverness\nis the state’s blessing.\nTo know these two is also a model.\nAlways knowing the model\nis called profound virtue.\nProfound virtue is deep, far-reaching,\nand turns back with things.\nOnly then does it attain great compliance.\n\n**Chapter Sixty-Six**",
      "overlap_context": "re long.\nThis is called the Way of deep roots, firm foundation,\nlong life, and enduring vision.\n\nChapter Sixty\nGoverning a great state\nis like cooking a small fish.\nWang says: Do not disturb it.\nWhen the Dao presides over the world,\nits ghosts do not manifest their numinosity.\nNot that the ghosts lack numinosity—\ntheir numinosity does not harm people.\nNot only does their numinosity not harm people,\nthe sage also does not harm people.\nAs neither harms the other,\ntheir virtues converge and return.",
      "start_char": 9953,
      "end_char": 10789,
      "start_sentence": 700,
      "end_sentence": 766,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.816426753997803,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 25,
      "original_text": "江海所以能为百谷王者，以其善下之（一百零五），故能为百谷王。 是以欲上民（一百零六），必以言下之，欲先民，必以身后之。 是以圣人处上而民不重； 处前而民不害。 是以天下乐推而不厌。 以其不争，故天下莫能与之争。 六十七章 天下皆谓我道大（一百零七），似不肖。 夫唯大，故似不肖。 若肖，久矣其细也夫（一百零八）！ 我有三宝，持而保之（一百零九）：一曰慈，二曰俭，三曰不敢为天下先。 慈，故能勇； 俭，故能广； 【王云：节俭爱费，天下不匮。 故能广也。 】不敢为天下先，故能成器长。 今舍慈且勇，【王云：『且』犹『取』也。 】舍俭且广，舍后且先，死矣。 夫慈，以战则胜，以守则固。 天将救之，以慈卫之。 【天亦以慈卫之。 】 六十八章",
      "translated_text": "The rivers and seas can be kings of the hundred valleys\nbecause they excel at lying low.\nThus they can be kings of the hundred valleys.\nTherefore, if one wishes to be above the people,\none must speak as though below them;\nif one wishes to lead the people,\none must place oneself behind them.\nThus the sage abides above,\nand the people do not feel oppressed;\nabides ahead,\nand the people do not feel harmed.\nThus the world delights in exalting him and never tires.\nBecause he does not contend,\nno one in the world can contend with him.\n\n**Chapter Sixty-Seven**\nThe world all says my Dao is great,\nyet it seems unlike anything else.\nPrecisely because it is great,\nit seems unlike anything else.\nIf it resembled anything,\nlong ago it would have become small!\n\nI possess three treasures,\nwhich I hold fast and guard:\nthe first is compassion,\nthe second is frugality,\nthe third is not daring to be first in the world.\nWith compassion, one can be courageous;\nwith frugality, one can be expansive;\nnot daring to be first in the world,\none can become the vessel of leaders.\nNow, to abandon compassion yet seek courage,\nto abandon frugality yet seek expansion,\nto abandon the rear yet seek the front—\nthis is death.\nFor with compassion,\none triumphs in battle and stands firm in defense.\nHeaven will save such a one,\nguarding him with compassion.",
      "overlap_context": "skilled in the Dao\ndid not use it to enlighten the people,\nbut to make them simple.\nThe people are difficult to govern\nbecause they are too clever.\nTherefore, to govern the state with cleverness\nis the state’s ruin;\nnot to govern the state with cleverness\nis the state’s blessing.\nTo know these two is also a model.\nAlways knowing the model\nis called profound virtue.\nProfound virtue is deep, far-reaching,\nand turns back with things.\nOnly then does it attain great compliance.\n\n**Chapter Sixty-Six**",
      "start_char": 10792,
      "end_char": 11107,
      "start_sentence": 767,
      "end_sentence": 789,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.033339738845825,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 26,
      "original_text": "善为士者不武； 【王云：士卒之师也。 】善战者不怒，善胜战者不与； 【王云：不与争也。 】善用人者为下。 是谓不争之德，是谓用人之力，是谓配天之极（一百一十）。 六十九章 用兵有言：古人有言也。 『吾不敢为主而为客，【河上云：不敢先举兵。 】不敢进寸而退尺。 』是谓行无行，攘无臂，扔无敌（一百一十一），执无兵。 【谓制胜于无形也。 即上章『不武』、『不怒』、『不与』之意。 】祸莫大于轻敌，轻敌几丧吾宝。 故抗兵相加，哀者胜矣。 七十章 吾言甚易知，甚易行。 天下莫能知，莫能行。 言有宗，事有君。 夫惟无知（一百一十二），是以不我知。 知我者希，则我者贵。 是以圣人被褐怀玉。 七十一章 知不知上，不知知病，【知而不自以为知者，上也。 不知而自以为知者，病也。 《论语》曰：『知之为知之，不知为不知。 』老氏之学则知之亦不为知之也。 】夫惟病病（一百一十三），是以不病。 圣人不病，以其病病，是以不病。 七十二章 民不畏威，则大威至（一百一十四）。 无狎其所居（一百一十五），无厌其所生。 夫唯不厌（一百一十六），是以不厌。 是以圣人自知不自见，自爱不自贵。 故去彼取此。 七十三章",
      "translated_text": "A good commander is not belligerent;\na good warrior is not enraged;\none who excels in victory does not contend;\none who excels in employing others places himself below them.\nThis is called the virtue of non-contention,\nthis is called employing the strength of others,\nthis is called matching the ultimate of Heaven.\n\nChapter Sixty-Nine\nOn the use of arms, there is a saying:\n“I dare not act as host but act as guest,\ndare not advance an inch but retreat a foot.”\nThis is called marching without marching,\nraising arms without arms,\nseizing without an enemy,\nwielding weapons without weapons.\nNo calamity is greater than underestimating the enemy;\nunderestimating the enemy nearly costs me my treasures.\nThus when evenly matched armies meet,\nthe side that grieves will prevail.\n\nChapter Seventy\nMy words are very easy to know,\nvery easy to practice.\nYet none in the world can know them,\nnone can practice them.\nWords have their source,\naffairs have their lord.\nIt is only through ignorance\nthat I am not known.\nThose who know me are few,\nthus I am esteemed.\nTherefore the sage wears coarse cloth while holding jade.\n\nChapter Seventy-One\nTo know yet not claim knowledge is supreme;\nto claim knowledge yet remain ignorant is a flaw.\nOnly by recognizing this flaw as a flaw\ncan one avoid being flawed.\nThe sage is not flawed,\nfor he recognizes the flaw as a flaw—\nthus he is not flawed.\n\nChapter Seventy-Two\nWhen the people do not fear authority,\ngreat authority will arrive.\nDo not constrict their dwelling,\ndo not oppress their livelihood.\nOnly by not oppressing them\nwill they not be oppressed.\nTherefore the sage knows himself but does not display himself,\nloves himself but does not exalt himself.\nThus he discards that and takes this.\n\nChapter Seventy-Three",
      "overlap_context": "\nthe second is frugality,\nthe third is not daring to be first in the world.\nWith compassion, one can be courageous;\nwith frugality, one can be expansive;\nnot daring to be first in the world,\none can become the vessel of leaders.\nNow, to abandon compassion yet seek courage,\nto abandon frugality yet seek expansion,\nto abandon the rear yet seek the front—\nthis is death.\nFor with compassion,\none triumphs in battle and stands firm in defense.\nHeaven will save such a one,\nguarding him with compassion.",
      "start_char": 11110,
      "end_char": 11625,
      "start_sentence": 790,
      "end_sentence": 825,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.806829929351807,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 27,
      "original_text": "勇于敢，则杀； 【王云：必不得其死。 】勇于不敢，则活。 此两者或利或害。 天之所恶，孰知其故？ 是以圣人犹难之。 天之道不争而善胜，不言而善应，不召而自来，繟然而善谋，天网恢恢，疏而不失（一百一十七）。 七十四章 民不畏死，奈何以死惧之？ 若使民常畏死，而为奇者，【王云：诡异乱群谓之『奇』也。 】吾得执而杀之。 孰敢？ 常有司杀者杀（一百一十八）。 夫代司杀者杀，是谓代大匠斫（一百一十九）。 夫代大匠斫（一百二十），希有不伤手矣（一百二十一）。 七十五章 民之饥，【当作『饥』（一百二十二）。 】以其上食税之多，是以饥。 民之难治，以其上之有为，是以难治。 民之轻死，以其求生之厚，是以轻死。 夫唯无以生为者，是贤于贵生。 七十六章 人之生也柔弱，其死也坚强。 万物草木之生也柔脆，其死也枯槁。 故坚强者死之徒，柔弱者生之徒。 是以兵强则不胜（一百二十三），木强则兵（一百二十四）。 【谓剪伐也。 】强大处下，【王云：木之本也】。 柔弱处上。 【王云：枝条是也。 】",
      "translated_text": "Boldness in daring leads to death;\nboldness in restraint leads to life.\nThese two may bring either benefit or harm.\nWho knows the reason for what Heaven abhors?\nEven the sage finds this difficult.\n\nThe Dao of Heaven\ndoes not contend yet excels in victory,\ndoes not speak yet excels in response,\nis not summoned yet comes of itself,\nis unhurried yet excels in planning.\nThe net of Heaven is vast and wide,\nsparse yet nothing escapes.\n\nChapter Seventy-Four\nWhen the people do not fear death,\nhow can death be used to frighten them?\nIf the people were always to fear death,\nthen those who act perversely—\ncould I seize and kill them?\nWho would dare?\nThere is always an executioner who kills.\nTo kill in place of the executioner\nis like hewing in place of the master carpenter.\nFew who hew in place of the master carpenter\ndo not injure their own hands.\n\nChapter Seventy-Five\nThe people’s hunger\ncomes from their superiors consuming too much in taxes—\nthus they hunger.\nThe people’s unruliness\ncomes from their superiors’ meddling—\nthus they are unruly.\nThe people’s disregard for death\ncomes from their excessive pursuit of life—\nthus they disregard death.\nOnly those who do not make life their pursuit\nare wiser than those who value life.\n\nChapter Seventy-Six\nWhen people are born, they are supple and weak;\nwhen they die, they are stiff and strong.\nAll things—plants and trees—\nwhen alive are supple and fragile;\nwhen dead, they are withered and dry.\nThus the stiff and strong are companions of death,\nthe supple and weak are companions of life.\nTherefore when an army is strong, it will not prevail;\nwhen a tree is strong, it invites the axe.\nThe strong and great dwell below;\nthe supple and weak dwell above.",
      "overlap_context": " as a flaw\ncan one avoid being flawed.\nThe sage is not flawed,\nfor he recognizes the flaw as a flaw—\nthus he is not flawed.\n\nChapter Seventy-Two\nWhen the people do not fear authority,\ngreat authority will arrive.\nDo not constrict their dwelling,\ndo not oppress their livelihood.\nOnly by not oppressing them\nwill they not be oppressed.\nTherefore the sage knows himself but does not display himself,\nloves himself but does not exalt himself.\nThus he discards that and takes this.\n\nChapter Seventy-Three",
      "start_char": 11628,
      "end_char": 12073,
      "start_sentence": 826,
      "end_sentence": 856,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.838680505752563,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 28,
      "original_text": "七十七章 天之道，其犹张弓与（一百二十五）？ 高者抑之，下者举之，有余者损之，不足者补之（一百二十六）。 天之道损有余而补不足（一百二十七），人之道则不然：损不足以奉有余。 孰能有余以奉天下？ 唯有道者。 是以圣人为而不恃，功成而不处，其不欲见贤。 七十八章 天下莫柔弱于水（一百二十八），而攻坚强者莫之能胜（一百二十九），其无以易之。 【磨砺金石必于水。 】弱之胜强，柔之胜刚，天下莫不易（一百三十），莫能行。 是以圣人云（一百三十一）：受国之垢，是谓社稷主。 受国不祥（一百三十二），是谓天下王。 正言若反。 七十九章",
      "translated_text": "Chapter Seventy-Seven\nThe Dao of Heaven—\nis it not like the drawing of a bow?\nWhat is high is pressed down,\nwhat is low is lifted up;\nwhat has excess is reduced,\nwhat is deficient is supplemented.\nThe Dao of Heaven reduces excess\nand supplements deficiency.\nThe Dao of man is not so:\nit reduces deficiency\nto serve excess.\nWho can take from their excess\nto serve all under Heaven?\nOnly those who hold the Dao.\nThus the sage acts without claiming,\nachieves without abiding,\nand does not wish to display worth.\n\nChapter Seventy-Eight\nNothing in all under Heaven\nis more supple and weak than water,\nyet in attacking the hard and strong\nnothing can surpass it—\nnothing can take its place.\nThe weak overcomes the strong,\nthe supple overcomes the hard—\nnone under Heaven does not know this,\nyet none can practice it.\nThus the sage says:\nTo bear a state’s disgrace\nis to be called lord of the altars of soil and grain;\nto bear a state’s misfortune\nis to be called king of all under Heaven.\nTrue words seem their opposite.\n\nChapter Seventy-Nine",
      "overlap_context": " than those who value life.\n\nChapter Seventy-Six\nWhen people are born, they are supple and weak;\nwhen they die, they are stiff and strong.\nAll things—plants and trees—\nwhen alive are supple and fragile;\nwhen dead, they are withered and dry.\nThus the stiff and strong are companions of death,\nthe supple and weak are companions of life.\nTherefore when an army is strong, it will not prevail;\nwhen a tree is strong, it invites the axe.\nThe strong and great dwell below;\nthe supple and weak dwell above.",
      "start_char": 12076,
      "end_char": 12350,
      "start_sentence": 857,
      "end_sentence": 871,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 5.903717041015625,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 29,
      "original_text": "和大怨，必有余怨，安可以为善？ 是以圣人执左契而不责于人。 有德司契，无德司彻。 天道无亲，常与善人。 八十章 小国寡民，使有什伯之器而不用（一百三十三）； 使民重死而不远徙； 虽有舟舆（一百三十四），无所乘之； 虽有甲兵，无所陈之。 使人复结绳而用之（一百三十五）。 甘其食，美其服，安其居，乐其俗，邻国相望，鸡狗之声相闻，民至老死，不相徃来。 八十一章 信言不美，美言不信。 善者不辩，辩者不善。 知者不博，博者不知。 圣人不积，【为人与人不积于己也。 】既以为人己愈有，既以与人己愈多。 天之道，利而不害。 圣人之道，为而不争。 右番禺陈氏澧《老子注》一卷，从汪憬吾丈家钞本借录（一百三十六）。 注甚简略，似随笔札记不经意之作。 然如十五章『俨兮其若客』，谓『客』与『释』韵，辨别本作『容』之误。 『故能敝不新成』，从《永乐大典》本作『敝』，以官本作『蔽』为非。 三十九章『侯王无以贵高将蹶』，谓『贵高』当为『贞』。 【以前后文推之，此说不易。 】四十四章王注『得多利而亡，其身何者为病也』，谓『多』当作『名』。 五十八章『吾何以知其然哉？ 以此。",
      "translated_text": "To reconcile great resentment,\nsurely some resentment remains—\nhow can this be called good?\nThus the sage holds the left tally\nyet makes no demand upon others.\nThose with virtue oversee the tally,\nthose without virtue oversee exactions.\nThe Heavenly Dao shows no partiality,\nyet ever accords with the good.\n\nChapter Eighty\nLet the state be small, its people few,\nso that though there be tools of ten or a hundred men’s labor,\nthey are not used.\nLet the people regard death as weighty\nand not wander far away.\nThough there be boats and carriages,\nthere is nowhere to ride them;\nthough there be armor and weapons,\nthere is nowhere to array them.\nLet the people return to knotting cords and using them.\nSweet be their food,\nfine their clothing,\nsecure their dwellings,\njoyful their customs.\nNeighboring states gaze upon one another,\nthe sounds of their chickens and dogs heard across the way—\nyet the people reach old age and death\nwithout ever coming or going.\n\nChapter Eighty-One\nTruthful words are not fine,\nfine words are not truthful.\nThe good do not dispute,\nthe disputatious are not good.\nThe knowing are not learned,\nthe learned do not know.\nThe sage does not accumulate—\nhaving acted for others, they have all the more;\nhaving given to others, they possess all the more.\nThe Way of Heaven benefits and does no harm.\nThe Way of the sage acts and does not contend.",
      "overlap_context": "ing in all under Heaven\nis more supple and weak than water,\nyet in attacking the hard and strong\nnothing can surpass it—\nnothing can take its place.\nThe weak overcomes the strong,\nthe supple overcomes the hard—\nnone under Heaven does not know this,\nyet none can practice it.\nThus the sage says:\nTo bear a state’s disgrace\nis to be called lord of the altars of soil and grain;\nto bear a state’s misfortune\nis to be called king of all under Heaven.\nTrue words seem their opposite.\n\nChapter Seventy-Nine",
      "start_char": 12353,
      "end_char": 12835,
      "start_sentence": 872,
      "end_sentence": 899,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.658594846725464,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 30,
      "original_text": "』，谓『自此以上当为上章结语』。 均立说精确。 经儒手笔，虽信手掇拾，要无空疏武断之病。 汪丈笃守师承，恐其散佚，录而存之。 其用心纯笃，尤可钦也。 借读仅七日，命次女肇纯钞竟，因跋而还之。 庚午闰六月廿八日（一百三十七）。 石光瑛跋。 【校记】 （一）『已』，河上本、王本同。 马王堆甲本、乙本均作『矣』。 （二）『辞』，河上本、王本同。 马王堆乙本作『始』。 （三）『惟』，河上本同，王本作『唯』，马王堆甲本、乙本均同王本。 （四）『使常』，河上本、王本均作『常使』，马王堆甲本、乙本均作『恒使』。 （五）『知』，河上本同，王本则作『智』，马王堆甲本、乙本均同河上本。 （六）『绵』，王本同，河上本则作『绵』，马王堆甲本、乙本均同王本。 （七）原脱『能』字，据河上本、王本补。 （八）『生』，河上本、王本、马王堆甲本、乙本均作『身』。 （九）『耶』，王本同，河上本作『邪』，马王堆甲本、乙本均作『舆』。 （十）『锐』，河上本同，王本作『棁』，马王堆甲本、乙本均作『兑』。 （十一）『长』，河上本、王本、马王堆甲乙本均同。 或本作『常』。 （十二）此句河上本作『功成名遂身退』。 王本、马王堆乙本均作『功遂身退』，马王堆甲本作『功述身芮』。 （十三）『无』，王本同，河上本亦同，但无『乎』字。 马王堆甲本、乙本均作『毋』，句末亦有『乎』字。 （十四）河上本、王本、马王堆甲乙本『为』字后均有『之』字。 （十五）『』，原文如此。 检四库全书所载《道德真经注》（元吴澄撰），字应作『拟』。 殆传抄误作。 又『也』，四库本作『已』。 （十六）『豫焉』，王本同，河上本则作『与兮』。 马王堆甲本、乙本均作『曰与呵其』。 （十七）『容』，王本同，河上本、马王堆甲乙本均作『客』。 （十八）或据《道藏》河上公本在『以』字后补『止』字。 四库河上本、王本、马王堆甲乙本均无『止』字。 （十九）『惟』，河上本、王本、马王堆甲本均作『唯』。 （二十）『谓』，河上本、王本、马王堆甲乙本均同。 或作『曰』。 不知何据。 （二十一）『悠焉』，河上本作『犹兮』，王本作『悠兮』，马王堆乙本作『犹呵』。 （二十二）『慧知』，河上本作『智惠』，王本作『慧智』，马王堆甲本作『知快』，马王堆乙本作『知慧』。 （二十三）『于』，河上本、王本、马王堆甲乙本均作『与』。 （二十四）『何若』，河上本、马王堆甲乙本均同，王本作『若何』。 （二十五）河上本无『能』字，王本、马王堆甲乙本均有。 （二十六）『况』字后河上本、王本、马王堆乙本均有『于』字。 （二十七）『得』，王本同，河上本作『失』。 此段马王堆甲乙本均有所不同。 （二十八）『企』，王本同，河上本作『跂』。 （二十九）王本句末有『也』字，河上本同，但『在』作『于』。 （三十）河上本、马王堆乙本『立』字后多一『而』字，王本则无。 （三十一）『王』，河上本、王本、马王堆甲乙本均同，宋范应阳本作『人』。 （三十二）『域』，马王堆甲乙本均作『国』。 （三十三）『王』，河上本、王本、马王堆甲乙本均同。",
      "translated_text": "The closing quotation mark indicates, \"From this point onward, this should serve as the concluding statement of the preceding chapter.\" This interpretation is precise. Though the brushstrokes of classical scholars may seem casually gathered, they are free from the flaws of carelessness or arbitrary assertion. Master Wang, steadfast in preserving his teacher’s lineage, feared its dispersal and thus recorded and preserved it. His intent was pure and earnest—truly admirable. Having borrowed the text for a mere seven days, I instructed my second daughter, Zhao Chun, to transcribe it in full, and now append this colophon before returning it. Written on the twenty-eighth day of the intercalary sixth month, the year *gengwu* (137). Postscript by Shi Guangying.\n\n**Collation Notes:**\n(1) \"已\" appears in the *Heshang* and Wang versions; the Mawangdui manuscripts (A and B) both read \"矣.\"\n(2) \"辞\" appears in the *Heshang* and Wang versions; the Mawangdui B manuscript reads \"始.\"\n(3) \"惟\" appears in the *Heshang* version; the Wang version reads \"唯,\" as do the Mawangdui A and B manuscripts.\n(4) \"使常\" appears in the *Heshang* and Wang versions as \"常使\"; the Mawangdui A and B manuscripts read \"恒使.\"\n(5) \"知\" appears in the *Heshang* version; the Wang version reads \"智,\" while the Mawangdui A and B manuscripts follow the *Heshang* version.\n(6) \"绵\" appears in the Wang version; the *Heshang* version also reads \"绵,\" as do the Mawangdui A and B manuscripts.\n(7) The character \"能\" is missing in the original; it is supplied here following the *Heshang* and Wang versions.\n(8) \"生\" appears in the *Heshang*, Wang, and Mawangdui A and B manuscripts as \"身.\"\n(9) \"耶\" appears in the Wang version; the *Heshang* version reads \"邪,\" while the Mawangdui A and B manuscripts read \"舆.\"\n(10) \"锐\" appears in the *Heshang* version; the Wang version reads \"棁,\" and the Mawangdui A and B manuscripts read \"兑.\"\n(11) \"长\" appears in the *Heshang*, Wang, and Mawangdui A and B manuscripts; some versions read \"常.\"\n(12) This line appears in the *Heshang* version as \"功成名遂身退\"; the Wang and Mawangdui B manuscripts read \"功遂身退,\" while the Mawangdui A manuscript reads \"功述身芮.\"\n(13) \"无\" appears in the Wang version; the *Heshang* version is identical but lacks the particle \"乎.\" The Mawangdui A and B manuscripts read \"毋,\" with \"乎\" at the end of the sentence.\n(14) The *Heshang*, Wang, and Mawangdui A and B manuscripts all include the character \"之\" after \"为.\"\n(15) The character appears as such in the original. According to the *Siku Quanshu* edition of *Daode Zhenjing Zhu* (commentary by Wu Cheng of the Yuan), it should read \"拟.\" Likely a transcription error. Additionally, \"也\" in the *Siku* edition reads \"已.\"\n(16) \"豫焉\" appears in the Wang version; the *Heshang* version reads \"与兮,\" while the Mawangdui A and B manuscripts read \"曰与呵其.\"\n(17) \"容\" appears in the Wang version; the *Heshang* and Mawangdui A and B manuscripts read \"客.\"\n(18) Some versions, following the *Daozang* edition of the *Heshang* commentary, insert \"止\" after \"以.\" The *Siku* edition of the *Heshang* version, the Wang version, and the Mawangdui A and B manuscripts all omit \"止.\"\n(19) \"惟\" appears in the *Heshang* and Wang versions; the Mawangdui A manuscript reads \"唯.\"\n(20) \"谓\" appears in the *Heshang*, Wang, and Mawangdui A and B manuscripts; some versions read \"曰,\" though the source is unclear.\n(21) \"悠焉\" appears in the *Heshang* version as \"犹兮,\" in the Wang version as \"悠兮,\" and in the Mawangdui B manuscript as \"犹呵.\"\n(22) \"慧知\" appears in the *Heshang* version as \"智惠,\" in the Wang version as \"慧智,\" in the Mawangdui A manuscript as \"知快,\" and in the Mawangdui B manuscript as \"知慧.\"\n(23) \"于\" appears in the *Heshang*, Wang, and Mawangdui A and B manuscripts as \"与.\"\n(24) \"何若\" appears in the *Heshang* and Mawangdui A and B manuscripts; the Wang version reads \"若何.\"\n(25) The *Heshang* version omits \"能\"; the Wang and Mawangdui A and B manuscripts include it.\n(26) The *Heshang*, Wang, and Mawangdui B manuscripts all include \"于\" after \"况.\"\n(27) \"得\" appears in the Wang version; the *Heshang* version reads \"失.\" This passage differs in the Mawangdui A and B manuscripts.\n(28) \"企\" appears in the Wang version; the *Heshang* version reads \"跂.\"\n(29) The Wang version includes \"也\" at the end of the sentence; the *Heshang* version is identical, though \"在\" appears as \"于.\"\n(30) The *Heshang* and Mawangdui B manuscripts include \"而\" after \"立\"; the Wang version omits it.\n(31) \"王\" appears in the *Heshang*, Wang, and Mawangdui A and B manuscripts; the Song edition by Fan Yingyang reads \"人.\"\n(32) \"域\" appears in the Mawangdui A and B manuscripts as \"国.\"\n(33) \"王\" appears in the *Heshang*, Wang, and Mawangdui A and B manuscripts.",
      "overlap_context": "heard across the way—\nyet the people reach old age and death\nwithout ever coming or going.\n\nChapter Eighty-One\nTruthful words are not fine,\nfine words are not truthful.\nThe good do not dispute,\nthe disputatious are not good.\nThe knowing are not learned,\nthe learned do not know.\nThe sage does not accumulate—\nhaving acted for others, they have all the more;\nhaving given to others, they possess all the more.\nThe Way of Heaven benefits and does no harm.\nThe Way of the sage acts and does not contend.",
      "start_char": 12835,
      "end_char": 14246,
      "start_sentence": 900,
      "end_sentence": 954,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.71574330329895,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 31,
      "original_text": "宋范应阳本作『人』。 （三十四）『本』，王本、马王堆甲乙本均同，河上本作『臣』。 《韩非子喻老》、《永乐大典》引作『根』。 （三十五）『数』，王本、马王堆甲乙本均同，河上本作『计』。 （三十六）『常』，马王堆甲乙本均作『恒』。 （三十七）『爱』后或多一『惜』字。 河上本、王本、马王堆甲乙本均无『惜』字。 （三十八）『婴』，王本、马王堆甲本均同，河上本作『婴』。 （三十九）河上本、王本、马王堆乙本均无『无』字。 （四十）『有』，王本同，河上本、马王堆甲乙本均作『者』。 （四十一）『淡』，王本同，河上本作『惔』。 马王堆帛书甲本『恬淡』作『铦袭』，乙本作『铦』。 （四十二）『天下莫能臣也』，王本同，河上本则作『天下不敢臣』。 马王堆乙本作『而天下弗敢臣』。 （四十三）『夫』，王本同，河上本作『天』。 『止』，王本同，河上本作『之』。 马王堆乙本同王本。 （四十四）『止』，王本同，河上本作『之』。 『可』，王本同，河上本作『所』。 马王堆乙本作『知止所以不殆』。 （四十五）『于』，王本同，河上本作『与』。 马王堆甲乙本同河上本。 （四十六）『衣养』，王本同，河上本作『爱养』，《永乐大典》作『衣被』。 马王堆甲乙本作『万物归焉而弗为主』。 （四十七）『于』，河上本、王本均同，马王堆乙本作『为』。 （四十八）『为』，河上本、王本均同，马王堆甲乙本均作『于』。 （四十九）此句河上本作『是以圣人终不为大』。 马王堆帛书乙本作『是以圣人之能成大也，以其不为大也』。 （五十）『率』，四库河上本作『守』。 （五十一）『太』，河上本、王本、马王堆甲乙本均同。 或本作『泰』。 （五十二）『国家安宁』，四库河上本作『国安家宁』。 （五十三）『足』，王本同，河上本、马王堆甲乙本均作『可』。 （五十四）『歙』，王本同，河上本作『噏』。 马王堆甲本作『拾』，乙本作『』。 （五十五）『欲』，王本、马王堆甲乙本均同，河上本作『使』。 （五十六）王本、马王堆甲乙本句末均有『之』字，河上本、《永乐大典》均无。 （五十七）王本有『夫』字，河上本无。 『无』，王本同，河上本作『不』。 马王堆甲乙本均作『夫将不辱，不辱……』。 （五十八）『扔』，王本同，河上本作『仍』。 马王堆甲乙本均『乃』。 （五十九）『贞』，王本同，河上本、马王堆甲乙本均作『正』。 （六十）『蹶』，王本同，河上本作『蹶』。 马王堆乙本作『欮』。 （六十一）『榖』，王本同，河上本作『毂』。 马王堆甲乙本『榖』均不从『殳』。 （六十二）两『舆』字，王本同，河上本均作『车』。 马王堆甲本作『与』，乙本作『舆』。 （六十三）『珞珞』，王本同，河上本作『落落』，马王堆甲乙本均作『硌硌』。 （六十四）『榖』，王本同，河上本作『毂』。 马王堆甲乙本『榖』均不从『殳』。 （六十五）『是以』，王本、马王堆甲本均同，河上本作『以是』。 （六十六）此句之前，河上本、马王堆甲乙本均多『罪莫大于可欲』一句，王本则无。 （六十七）句末王本、马王堆甲乙本均有『矣』字，河上本无。",
      "translated_text": "(34) The Song edition by Fan Yingyang reads \"person.\" \"本\" appears identically in the Wang and Mawangdui A and B manuscripts; the *Heshang* version reads \"subject.\" The *Hanfeizi’s \"Illustrating the Dao\"* and the *Yongle Encyclopedia* quote it as \"root.\"\n\n(35) \"数\" appears identically in the Wang and Mawangdui A and B manuscripts; the *Heshang* version reads \"reckoning.\"\n\n(36) \"常\" appears as \"恒\" in the Mawangdui A and B manuscripts.\n\n(37) Some versions include \"惜\" after \"爱.\" The *Heshang*, Wang, and Mawangdui A and B manuscripts all omit \"惜.\"\n\n(38) \"婴\" appears identically in the Wang and Mawangdui A manuscripts; the *Heshang* version also reads \"婴.\"\n\n(39) The *Heshang*, Wang, and Mawangdui B manuscripts all omit the character \"无.\"\n\n(40) \"有\" appears identically in the Wang version; the *Heshang* and Mawangdui A and B manuscripts all read \"者.\"\n\n(41) \"淡\" appears identically in the Wang version; the *Heshang* version reads \"惔.\" The Mawangdui silk manuscript A reads \"恬淡\" as \"铦袭,\" while B reads \"铦.\"\n\n(42) \"天下莫能臣也\" appears identically in the Wang version; the *Heshang* version reads \"天下不敢臣.\" The Mawangdui B manuscript reads \"而天下弗敢臣.\"\n\n(43) \"夫\" appears identically in the Wang version; the *Heshang* version reads \"天.\" \"止\" appears identically in the Wang version; the *Heshang* version reads \"之.\" The Mawangdui B manuscript follows the Wang version.\n\n(44) \"止\" appears identically in the Wang version; the *Heshang* version reads \"之.\" \"可\" appears identically in the Wang version; the *Heshang* version reads \"所.\" The Mawangdui B manuscript reads \"知止所以不殆.\"\n\n(45) \"于\" appears identically in the Wang version; the *Heshang* version reads \"与.\" The Mawangdui A and B manuscripts follow the *Heshang* version.\n\n(46) \"衣养\" appears identically in the Wang version; the *Heshang* version reads \"爱养,\" and the *Yongle Encyclopedia* reads \"衣被.\" The Mawangdui A and B manuscripts read \"万物归焉而弗为主.\"\n\n(47) \"于\" appears identically in the *Heshang* and Wang versions; the Mawangdui B manuscript reads \"为.\"\n\n(48) \"为\" appears identically in the *Heshang* and Wang versions; the Mawangdui A and B manuscripts both read \"于.\"\n\n(49) This passage in the *Heshang* version reads \"是以圣人终不为大.\" The Mawangdui silk manuscript B reads \"是以圣人之能成大也，以其不为大也.\"\n\n(50) \"率\" in the Siku *Heshang* version reads \"守.\"\n\n(51) \"太\" appears identically in the *Heshang*, Wang, and Mawangdui A and B manuscripts. Some versions read \"泰.\"\n\n(52) \"国家安宁\" in the Siku *Heshang* version reads \"国安家宁.\"\n\n(53) \"足\" appears identically in the Wang version; the *Heshang* and Mawangdui A and B manuscripts read \"可.\"\n\n(54) \"歙\" appears identically in the Wang version; the *Heshang* version reads \"噏.\" The Mawangdui A manuscript reads \"拾,\" while B omits the character.\n\n(55) \"欲\" appears identically in the Wang and Mawangdui A and B manuscripts; the *Heshang* version reads \"使.\"\n\n(56) The Wang and Mawangdui A and B manuscripts all include \"之\" at the end of the sentence; the *Heshang* version and *Yongle Encyclopedia* omit it.\n\n(57) The Wang version includes \"夫\"; the *Heshang* version omits it. \"无\" appears identically in the Wang version; the *Heshang* version reads \"不.\" The Mawangdui A and B manuscripts both read \"夫将不辱，不辱……\"\n\n(58) \"扔\" appears identically in the Wang version; the *Heshang* version reads \"仍.\" The Mawangdui A and B manuscripts both read \"乃.\"\n\n(59) \"贞\" appears identically in the Wang version; the *Heshang* and Mawangdui A and B manuscripts read \"正.\"\n\n(60) \"蹶\" appears identically in the Wang version; the *Heshang* version also reads \"蹶.\" The Mawangdui B manuscript reads \"欮.\"\n\n(61) \"榖\" appears identically in the Wang version; the *Heshang* version reads \"毂.\" The Mawangdui A and B manuscripts write \"榖\" without the \"殳\" component.\n\n(62) Both instances of \"舆\" appear identically in the Wang version; the *Heshang* version reads \"车\" in both cases. The Mawangdui A manuscript reads \"与,\" while B reads \"舆.\"\n\n(63) \"珞珞\" appears identically in the Wang version; the *Heshang* version reads \"落落,\" and the Mawangdui A and B manuscripts read \"硌硌.\"\n\n(64) \"榖\" appears identically in the Wang version; the *Heshang* version reads \"毂.\" The Mawangdui A and B manuscripts write \"榖\" without the \"殳\" component.\n\n(65) \"是以\" appears identically in the Wang and Mawangdui A manuscripts; the *Heshang* version reads \"以是.\"\n\n(66) Before this passage, the *Heshang* and Mawangdui A and B manuscripts all include the sentence \"罪莫大于可欲,\" which the Wang version omits.\n\n(67) The Wang and Mawangdui A and B manuscripts all include \"矣\" at the end of the sentence; the *Heshang* version omits it.",
      "overlap_context": " version reads \"跂.\"\n(29) The Wang version includes \"也\" at the end of the sentence; the *Heshang* version is identical, though \"在\" appears as \"于.\"\n(30) The *Heshang* and Mawangdui B manuscripts include \"而\" after \"立\"; the Wang version omits it.\n(31) \"王\" appears in the *Heshang*, Wang, and Mawangdui A and B manuscripts; the Song edition by Fan Yingyang reads \"人.\"\n(32) \"域\" appears in the Mawangdui A and B manuscripts as \"国.\"\n(33) \"王\" appears in the *Heshang*, Wang, and Mawangdui A and B manuscripts.",
      "start_char": 14246,
      "end_char": 15655,
      "start_sentence": 955,
      "end_sentence": 1009,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.356947660446167,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 32,
      "original_text": "（六十八）『窥』，王本同，河上本作『窥』。 马王堆甲本作『规』，乙本作 『圭见』。 （六十九）『歙歙』，王本同，河上本作『怵怵』。 马王堆甲本作『焉』，乙本作『欱欱焉』。 （七十）王本有『亦』字，河上本无。 此句马王堆甲本作『而民生生动皆之死地之十有三』，乙本作『而民生生僮皆之死地之十有三』。 （七十一）『被』，王本同，河上本作『避』。 此句马王堆甲本作『入军不被甲兵』，乙本作『入军不被兵革』。 （七十二）『亭之毒之』，王本、马王堆乙本同，河上本作『成之熟之』。 （七十三）『得』，王本、马王堆甲乙本均同，河上本作『知』。 （七十四）『以』，王本、马王堆甲乙本均同，河上本作『复』。 （七十五）『袭』，河上本、王本均作『习』，马王堆甲本作『袭』。 （七十六）『其』，河上本、王本、马王堆甲乙本均作『甚』。 （七十七）『彩』，河上本、王本均作『彩』，马王堆甲乙本均作『采』。 （七十八）『夸』，河上本、王本同，《韩非子喻老》引作『竽』，马王堆乙本作『杅』。 （七十九）王本有『也』字，河上本无。 马王堆甲乙本均残泐此句。 （八十）王本、马王堆甲乙本均有『以』字，河上本无。 （八十一）『邦』，河上本、王本均作『国』。 马王堆甲本作『邦』，乙本作『国』。 （八十二）『下』字后河上本、马王堆乙本均多一『之』字，王本无。 （八十三）『蜂虿虺蛇』，王本同，河上本作『毒虫』。 此句马王堆甲本作『逢地弗螫』，乙本作『蜂疠虫蛇弗赫』。 （八十四）『攫』，王本同，河上本作『玃』。 此句马王堆甲本作『鸟猛兽弗搏』，乙本作『据鸟孟兽弗捕』。 （八十五）『』，河上本同，王本作『全』，马王堆乙本作『脧』。 （八十六）河上本、马王堆甲乙本句首均多一『亦』字，王本无。 『疏』，河上本、王本均作『踈』，马王堆甲本作『疏』。 （八十七）河上本、马王堆甲本句首多一『亦』字，王本无。 （八十八）河上本、马王堆甲乙本句首多一『亦』字，王本无。 （八十九）『令』，王本同，河上本、马王堆甲乙本作『物』。 （九十）『妖』，王本同，河上本作『訞』。 （九十一）『人』，王本同，河上本作『民』。 （九十二）『刿』，王本同，河上本作『害』，马王堆乙本作『刺』。 （九十三）『耀』，王本同，河上本作『曜』，马王堆乙本作『眺』。 （九十四）『克』，王本同，四库本作『克』。 下同。 （九十五）此句河上本、王本均同。",
      "translated_text": "(68) \"窥\" appears identically in the Wang version; the *Heshang* version also reads \"窥.\" The Mawangdui A manuscript reads \"规,\" while B reads \"圭见.\"\n\n(69) \"歙歙\" appears identically in the Wang version; the *Heshang* version reads \"怵怵.\" The Mawangdui A manuscript reads \"焉,\" while B reads \"欱欱焉.\"\n\n(70) The Wang version includes the character \"亦,\" which the *Heshang* version omits. For this passage, the Mawangdui A manuscript reads \"而民生生动皆之死地之十有三,\" while B reads \"而民生生僮皆之死地之十有三.\"\n\n(71) \"被\" appears identically in the Wang version; the *Heshang* version reads \"避.\" For this passage, the Mawangdui A manuscript reads \"入军不被甲兵,\" while B reads \"入军不被兵革.\"\n\n(72) \"亭之毒之\" appears identically in the Wang version and Mawangdui B manuscript; the *Heshang* version reads \"成之熟之.\"\n\n(73) \"得\" appears identically in the Wang version and Mawangdui A and B manuscripts; the *Heshang* version reads \"知.\"\n\n(74) \"以\" appears identically in the Wang version and Mawangdui A and B manuscripts; the *Heshang* version reads \"复.\"\n\n(75) \"袭\" appears as \"习\" in the *Heshang* and Wang versions; the Mawangdui A manuscript reads \"袭.\"\n\n(76) \"其\" appears as \"甚\" in the *Heshang*, Wang, and Mawangdui A and B versions.\n\n(77) \"彩\" appears identically in the *Heshang* and Wang versions; the Mawangdui A and B manuscripts read \"采.\"\n\n(78) \"夸\" appears identically in the *Heshang* and Wang versions; the *Hanfeizi Yu Lao* citation reads \"竽,\" and the Mawangdui B manuscript reads \"杅.\"\n\n(79) The Wang version includes the character \"也,\" which the *Heshang* version omits. The Mawangdui A and B manuscripts are both damaged at this passage.\n\n(80) The Wang version and Mawangdui A and B manuscripts all include the character \"以,\" which the *Heshang* version omits.\n\n(81) \"邦\" appears as \"国\" in the *Heshang* and Wang versions. The Mawangdui A manuscript reads \"邦,\" while B reads \"国.\"\n\n(82) After the character \"下,\" the *Heshang* version and Mawangdui B manuscript both include an additional \"之,\" which the Wang version omits.\n\n(83) \"蜂虿虺蛇\" appears identically in the Wang version; the *Heshang* version reads \"毒虫.\" For this passage, the Mawangdui A manuscript reads \"逢地弗螫,\" while B reads \"蜂疠虫蛇弗赫.\"\n\n(84) \"攫\" appears identically in the Wang version; the *Heshang* version reads \"玃.\" For this passage, the Mawangdui A manuscript reads \"鸟猛兽弗搏,\" while B reads \"据鸟孟兽弗捕.\"\n\n(85) The *Heshang* version reads identically (omitted character), the Wang version reads \"全,\" and the Mawangdui B manuscript reads \"脧.\"\n\n(86) The *Heshang* version and Mawangdui A and B manuscripts all include an additional \"亦\" at the beginning of the sentence, which the Wang version omits. \"疏\" appears as \"踈\" in the *Heshang* and Wang versions; the Mawangdui A manuscript reads \"疏.\"\n\n(87) The *Heshang* version and Mawangdui A manuscript both include an additional \"亦\" at the beginning of the sentence, which the Wang version omits.\n\n(88) The *Heshang* version and Mawangdui A and B manuscripts all include an additional \"亦\" at the beginning of the sentence, which the Wang version omits.\n\n(89) \"令\" appears identically in the Wang version; the *Heshang* version and Mawangdui A and B manuscripts read \"物.\"\n\n(90) \"妖\" appears identically in the Wang version; the *Heshang* version reads \"訞.\"\n\n(91) \"人\" appears identically in the Wang version; the *Heshang* version reads \"民.\"\n\n(92) \"刿\" appears identically in the Wang version; the *Heshang* version reads \"害,\" and the Mawangdui B manuscript reads \"刺.\"\n\n(93) \"耀\" appears identically in the Wang version; the *Heshang* version reads \"曜,\" and the Mawangdui B manuscript reads \"眺.\"\n\n(94) \"克\" appears identically in the Wang version and *Siku* edition. The same applies below.\n\n(95) This passage appears identically in the *Heshang* and Wang versions.",
      "overlap_context": "ally in the Wang version; the *Heshang* version reads \"毂.\" The Mawangdui A and B manuscripts write \"榖\" without the \"殳\" component.\n\n(65) \"是以\" appears identically in the Wang and Mawangdui A manuscripts; the *Heshang* version reads \"以是.\"\n\n(66) Before this passage, the *Heshang* and Mawangdui A and B manuscripts all include the sentence \"罪莫大于可欲,\" which the Wang version omits.\n\n(67) The Wang and Mawangdui A and B manuscripts all include \"矣\" at the end of the sentence; the *Heshang* version omits it.",
      "start_char": 15659,
      "end_char": 16779,
      "start_sentence": 1010,
      "end_sentence": 1048,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.21680736541748,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 33,
      "original_text": "马王堆甲本作『牝恒以靓胜牡为其靓□□宜为下』，乙本作『牝恒以静朕牡为其静也故宜为下也』。 （九十六）『故』，王本同，河上本、马王堆甲乙本均作『欲』，。 （九十七）『邪』，王本同，河上本作『耶』，马王堆甲本作『舆』，乙本作『与』。 （九十八）河上本、王本、马王堆甲乙本均无后一『易』字。 （九十九）河上本、马王堆甲本句末均无『矣』字。 王本有。 （一百）『泮』，王本同，河上本作『破』。 此处马王堆甲乙本均残泐。 （一百零一）河上本无『是以』二字。 王本、马王堆乙本均有。 （一百零二）河上本无『故』字。 王本、马王堆甲乙本均有。 （一百零三）『稽』，王本、马王堆甲乙本同，河上本作『楷』。 下同。 （一百零四）河上本、马王堆甲乙本均无『然后』二字，王本有。 『至』字后河上本多一『于』字，王本、马王堆甲乙本均无。 （一百零五）河上本无『其』字，王本、马王堆甲乙本均有。 （一百零六）『以』字后河上本、马王堆甲乙本均多『圣人』二字，王本无。 （一百零七）河上本、马王堆乙本均无『道』字，王本有。 （一百零八）河上本无『也』字，王本、马王堆乙本有。 马王堆甲本作『细久矣』。 （一百零九）『保』，王本同，河上本作『宝』，马王堆乙本作『』。 （一百一十）河上本、王本均在『天』字后多一『古』字，在『天』字点断。 马王堆甲本作『是胃天古之极也』，乙本作『是胃肥天古之极也』。 （一百一十一）『扔』，王本同，河上本作『仍』，马王堆甲乙本均作『乃』。 （一百一十二）『惟』，河上本、王本、马王堆甲乙本均作『唯』。 （一百一十三）『惟』，河上本、王本均作『唯』。 马王堆乙本此句作『以其病病』。 （一百一十四）河上本无『则』字，句末多一『矣』字。 王本有『则』无『矣』。 马王堆乙本此句作『则大威将至矣』。 （一百一十五）『狎』，王本同，河上本作『狭』，马王堆甲本作『闸』，乙本作『』。 （一百一十六）河上本无『夫』字，王本、马王堆甲乙本均有。 （一百一十七）『疏』，王本、马王堆乙本均同，河上本作『疎』。 （一百一十八）河上本、马王堆甲乙本无后一『杀』字，王本有。 （一百一十九）此句河上本作『夫代司杀者是谓代大匠斫』，王本作『夫代司杀者杀是谓代大匠斫』，马王堆甲本作『夫伐司杀者杀是伐大匠斫也』，乙本作『夫代司杀者杀是代大匠斫』。 （一百二十）『斫』字后河上本、王本、马王堆甲本均多一『者』字。 马王堆乙本无『者』字。 （一百二十一）此句河上本作『希有不伤手者矣』，王本作『希有不伤其手矣』，马王堆甲本作『则□不伤其手矣』，乙本作『则希不伤其手』。 （一百二十二）河上本、王本均作『饥』，马王堆甲乙本均作『饥』。 （一百二十三）『不胜』，河上本、王本、马王堆甲乙本均同，或本作『灭』。 （一百二十四）『兵』，王本同，河上本作『共』，马王堆甲本作『恒』，乙本作『竞』。 （一百二十五）『与』，王本同，河上本作『乎』。 马王堆甲乙本均作『也』。 （一百二十六）『补』，王本、马王堆甲本均同，河上本作『与』。",
      "translated_text": "The Mawangdui A manuscript reads: *\"The female constantly overcomes the male with her serenity; for her serenity [□□], it is fitting to be below.\"* The B manuscript reads: *\"The female constantly overcomes the male with her stillness; for her stillness, therefore it is fitting to be below.\"*\n\n(96) *\"故\"* appears identically in the Wang version; the *Heshang* version and Mawangdui A and B manuscripts all read *\"欲.\"*\n\n(97) *\"邪\"* appears identically in the Wang version; the *Heshang* version reads *\"耶,\"* the Mawangdui A manuscript reads *\"舆,\"* and the B manuscript reads *\"与.\"*\n\n(98) The *Heshang* version, Wang version, and Mawangdui A and B manuscripts all omit the second *\"易\"* character.\n\n(99) The *Heshang* version and Mawangdui A manuscript both omit the final *\"矣\"* character. The Wang version includes it.\n\n(100) *\"泮\"* appears identically in the Wang version; the *Heshang* version reads *\"破.\"* The Mawangdui A and B manuscripts are damaged here.\n\n(101) The *Heshang* version omits the two characters *\"是以.\"* The Wang version and Mawangdui B manuscript include them.\n\n(102) The *Heshang* version omits the *\"故\"* character. The Wang version and Mawangdui A and B manuscripts include it.\n\n(103) *\"稽\"* appears identically in the Wang version and Mawangdui A and B manuscripts; the *Heshang* version reads *\"楷.\"* The same applies below.\n\n(104) The *Heshang* version and Mawangdui A and B manuscripts all omit the two characters *\"然后,\"* while the Wang version includes them. After the *\"至\"* character, the *Heshang* version includes an additional *\"于,\"* which the Wang version and Mawangdui A and B manuscripts omit.\n\n(105) The *Heshang* version omits the *\"其\"* character; the Wang version and Mawangdui A and B manuscripts include it.\n\n(106) After the *\"以\"* character, the *Heshang* version and Mawangdui A and B manuscripts all include the two characters *\"圣人,\"* which the Wang version omits.\n\n(107) The *Heshang* version and Mawangdui B manuscript both omit the *\"道\"* character; the Wang version includes it.\n\n(108) The *Heshang* version omits the *\"也\"* character; the Wang version and Mawangdui B manuscript include it. The Mawangdui A manuscript reads *\"细久矣.\"*\n\n(109) *\"保\"* appears identically in the Wang version; the *Heshang* version reads *\"宝,\"* and the Mawangdui B manuscript is damaged here.\n\n(110) The *Heshang* version and Wang version both include an additional *\"古\"* character after *\"天,\"* punctuating after *\"天.\"* The Mawangdui A manuscript reads *\"是胃天古之极也,\"* and the B manuscript reads *\"是胃肥天古之极也.\"*\n\n(111) *\"扔\"* appears identically in the Wang version; the *Heshang* version reads *\"仍,\"* and the Mawangdui A and B manuscripts both read *\"乃.\"*\n\n(112) *\"惟\"* appears as *\"唯\"* in the *Heshang* version, Wang version, and Mawangdui A and B manuscripts.\n\n(113) *\"惟\"* appears as *\"唯\"* in the *Heshang* version and Wang version. The Mawangdui B manuscript reads *\"以其病病.\"*\n\n(114) The *Heshang* version omits the *\"则\"* character and includes an additional *\"矣\"* at the end of the sentence. The Wang version includes *\"则\"* but omits *\"矣.\"* The Mawangdui B manuscript reads *\"则大威将至矣.\"*\n\n(115) *\"狎\"* appears identically in the Wang version; the *Heshang* version reads *\"狭,\"* the Mawangdui A manuscript reads *\"闸,\"* and the B manuscript is damaged here.\n\n(116) The *Heshang* version omits the *\"夫\"* character; the Wang version and Mawangdui A and B manuscripts include it.\n\n(117) *\"疏\"* appears identically in the Wang version and Mawangdui B manuscript; the *Heshang* version reads *\"疎.\"*\n\n(118) The *Heshang* version and Mawangdui A and B manuscripts omit the second *\"杀\"* character; the Wang version includes it.\n\n(119) This passage reads in the *Heshang* version: *\"夫代司杀者是谓代大匠斫,\"* in the Wang version: *\"夫代司杀者杀是谓代大匠斫,\"* in the Mawangdui A manuscript: *\"夫伐司杀者杀是伐大匠斫也,\"* and in the B manuscript: *\"夫代司杀者杀是代大匠斫.\"*\n\n(120) After the *\"斫\"* character, the *Heshang* version, Wang version, and Mawangdui A manuscript all include an additional *\"者\"* character. The Mawangdui B manuscript omits it.\n\n(121) This passage reads in the *Heshang* version: *\"希有不伤手者矣,\"* in the Wang version: *\"希有不伤其手矣,\"* in the Mawangdui A manuscript: *\"则□不伤其手矣,\"* and in the B manuscript: *\"则希不伤其手.\"*\n\n(122) The *Heshang* version and Wang version both read *\"饥,\"* while the Mawangdui A and B manuscripts both read *\"饥.\"*\n\n(123) *\"不胜\"* appears identically in the *Heshang* version, Wang version, and Mawangdui A and B manuscripts; some versions read *\"灭.\"*\n\n(124) *\"兵\"* appears identically in the Wang version; the *Heshang* version reads *\"共,\"* the Mawangdui A manuscript reads *\"恒,\"* and the B manuscript reads *\"竞.\"*\n\n(125) *\"与\"* appears identically in the Wang version; the *Heshang* version reads *\"乎.\"* The Mawangdui A and B manuscripts both read *\"也.\"*\n\n(126) *\"补\"* appears identically in the Wang version and Mawangdui A manuscript; the *Heshang* version reads *\"与.\"*",
      "overlap_context": ") \"人\" appears identically in the Wang version; the *Heshang* version reads \"民.\"\n\n(92) \"刿\" appears identically in the Wang version; the *Heshang* version reads \"害,\" and the Mawangdui B manuscript reads \"刺.\"\n\n(93) \"耀\" appears identically in the Wang version; the *Heshang* version reads \"曜,\" and the Mawangdui B manuscript reads \"眺.\"\n\n(94) \"克\" appears identically in the Wang version and *Siku* edition. The same applies below.\n\n(95) This passage appears identically in the *Heshang* and Wang versions.",
      "start_char": 16779,
      "end_char": 18167,
      "start_sentence": 1049,
      "end_sentence": 1093,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.01132583618164,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 34,
      "original_text": "（一百二十七）『补』，河上本、王本同，马王堆乙本作『益』。 （一百二十八）此句河上本作『天下柔弱莫过于水』，王本、马王堆甲乙本均作『天下莫柔弱于水』。 （一百二十九）『之』，王本、马王堆甲本均同，河上本作『知』。 （一百三十）『易』，王本、河上本、马王堆乙本均作『知』。 （一百三十一）『是以』，王本同，河上本、马王堆甲本作『故』，马王堆乙本作『是故』。 （一百三十二）『国』字后河上本、马王堆甲乙本均多一『之』字，王本无『之』字。 『国』，马王堆甲本作『邦』。 （一百三十三）『伯』字后河上本、马王堆甲乙本均多一『人』字，王本无『人』字。 『伯』，马王堆甲乙本均作『百』。 （一百三十四）『舆』，王本同，河上本作『舆』，马王堆甲乙本均作『车』。 （一百三十五）『人』，王本同，河上本、马王堆乙本均作『民』。 （一百三十六）『憬』，或作『景』。 （一百三十七）『庚午』，即公元一九三零年。",
      "translated_text": "(127) *\"补\"* appears identically in the *Heshang* version and Wang version; the Mawangdui B manuscript reads *\"益.\"*\n\n(128) This line reads *\"Among all under heaven, none is more yielding and weak than water\"* in the *Heshang* version, while the Wang version and Mawangdui A and B manuscripts all read *\"Among all under heaven, none is more yielding or weak than water.\"*\n\n(129) *\"之\"* appears identically in the Wang version and Mawangdui A manuscript; the *Heshang* version reads *\"知.\"*\n\n(130) *\"易\"* appears as *\"知\"* in the Wang version, *Heshang* version, and Mawangdui B manuscript.\n\n(131) *\"是以\"* appears identically in the Wang version; the *Heshang* version and Mawangdui A manuscript read *\"故,\"* while the Mawangdui B manuscript reads *\"是故.\"*\n\n(132) After the character *\"国,\"* the *Heshang* version and Mawangdui A and B manuscripts all include an additional *\"之,\"* which is absent in the Wang version. *\"国\"* appears as *\"邦\"* in the Mawangdui A manuscript.\n\n(133) After the character *\"伯,\"* the *Heshang* version and Mawangdui A and B manuscripts all include an additional *\"人,\"* which is absent in the Wang version. *\"伯\"* appears as *\"百\"* in the Mawangdui A and B manuscripts.\n\n(134) *\"舆\"* appears identically in the Wang version; the *Heshang* version reads *\"舆,\"* while the Mawangdui A and B manuscripts both read *\"车.\"*\n\n(135) *\"人\"* appears identically in the Wang version; the *Heshang* version and Mawangdui B manuscript both read *\"民.\"*\n\n(136) *\"憬\"* may also appear as *\"景.\"*\n\n(137) *\"庚午\"* corresponds to the year 1930 CE.",
      "overlap_context": "rsion, Wang version, and Mawangdui A and B manuscripts; some versions read *\"灭.\"*\n\n(124) *\"兵\"* appears identically in the Wang version; the *Heshang* version reads *\"共,\"* the Mawangdui A manuscript reads *\"恒,\"* and the B manuscript reads *\"竞.\"*\n\n(125) *\"与\"* appears identically in the Wang version; the *Heshang* version reads *\"乎.\"* The Mawangdui A and B manuscripts both read *\"也.\"*\n\n(126) *\"补\"* appears identically in the Wang version and Mawangdui A manuscript; the *Heshang* version reads *\"与.\"*",
      "start_char": 18171,
      "end_char": 18615,
      "start_sentence": 1094,
      "end_sentence": 1106,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.351796865463257,
      "metadata": {
        "source_file": "dao\\藏外\\老子注.txt",
        "category": "藏外"
      }
    }
  ]
}