{
  "source_id": "老君变化无极经",
  "source_file": "chunked_daozang\\老君变化无极经.json",
  "total_chunks": 7,
  "total_original_chars": 3236,
  "total_translated_chars": 19413,
  "total_translation_time": 118.92099618911743,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\老君变化无极经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Scripture of Lord Lao’s Transformations and the Infinite**\n\n**Scripture Title:** *The Scripture of Lord Lao’s Transformations and the Infinite*. Author unknown, approximately composed during the Northern and Southern Dynasties. One scroll. Base text from: *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n---\n\nWithin the boundless transformations of Lord Lao,\nEmerging from the hidden depths of the Yellow Chamber Palace.\nRefining the form, pure and serene, in union with the Void,\nRadiance and light spread throughout the eight directions.\n\nOnce the True Name is revealed, the Nine Lords assemble,\nThe Dao’s principles endure, joy without end.\nMounting the chariot drawn by nine dragons, with attendants in tow,\nAscending the eight-tiered jade tower.\n\nFrom the golden terrace, gazing upon Mount Hua,\nWhere the Perfected Ones upon the mountain bestowed upon me this scripture.\nThey taught me to cultivate the Dao, keeping the body pure,\nBeware of lust and excess, lest they destroy your form.\n\nPurify the body, cleanse the self, and attain longevity,\nFor the Dao of Lord Lao naturally aligns with this.\nWithout seeking the fame of this Dao’s teachings,\nHow can one transcend calamity and attain rebirth?\n\nThe wise contemplate this and grasp its essence,\nSealing the breath within, releasing it in threads, qi becomes luminous.\nTransmission and copying follow the proper method, arising with the seasons,\nHarvesting in autumn, storing in winter, entering the Yellow Court.\nSubtle and profound, qi merges as one.\n\nLord Lao transforms and alters his form,\nAppearing among the Hu as the True Scripture.\nThe Hu people rebel without sincerity,\nSurrendering by day, betraying by night, incurring guilt.\n\nTheir tribes and strongmen meet ruin,\nKneeling in supplication, begging for life.\nLord Lao, steadfast in resolve, refuses to heed,\nCondemning them to wear the red robes of punishment.\n\nShaving their heads, cutting their beards as a pledge of faith,\nSevering ties with wives, forbidding the taking of life.\nIf they can follow the transformation and transcend their names,\nThey may eat once at noon and recite the True Scripture.\n\nThey must not deceive, slacken, or indulge in lust,\nFor those who violate the law will have their forms destroyed.\nThe Hu people, humbled, revere the Dao’s power,\nFollowing the turning of the times into the Western Han.\n\nThe surname is Wood and Child, the given name Bow,\nDwelling in the Chengdu Prefecture of Shu Commandery.\nFrom the Crimson-Named Realm emerges the Icehouse,\nBow and Long unite to establish the Center of Heaven.\n\nRiding the Three, employing the Six, myriad spirits revere,\nTrue ranks of the Three Masters bear names.\nTwenty-four Treaties bring qi to fulfillment,\nDividing talismans, contracts, statutes, and decrees.\n\nPunitive talismans and temple subjugations follow fixed penalties,\nLord Lao’s Orthodox Law makes the Dao resplendent.\nImmortal officials record petitions as requested,\nThe *Yin-Yang Central Canon* remains unknown to men.\n\nOnly the Dragon-Womb Master transforms the form,\nWhite-haired and fluttering, he roams the Celestial Court.\nFeathers and wings spread, plumage complete,\nFive-colored and dappled like arrayed stars.\nThe Jade Armillary and Balanced Standard bear their true names.\n\nDwelling where misty waves rise in the eastern sea,\nSea waters do not flow unless winds stir them.\nWithout bounds or shores, east and west align,\nNot resisting the gentle current, thus it endures long.\nVast and boundless, the great sea is king of a hundred valleys,\nA hundred rivers pour in, waters surging.\nIts source lies in Kunlun’s Hua-Yin Hall,\nWhere yin qi surges, difficult to withstand.\n\nOne should guard against it to avert calamity,\nAttaining Great Peace and ascending to the Immortal Chambers.\nRiding clouds and driving dragons to Nanyang,\nFeasting and dining, the traveling kitchen fills the belly.\nPlucking the zither, strumming strings, raising cups of joy,\nOne must discern tones and distinguish gong from shang.\nJue and zhi arise together in the same hall.\n\nI enter the Dark River to still the Spring’s Origin,\nThe Great Dao lies level and open—who has not heard?\nNurturing scholars, all under heaven call themselves subjects,\nDisciples bow twice and inquire of what is asked.\n\nThe Dao holds subtle qi that gives life to humankind,\nYet this is not something the benighted can expound.\nThe Dao’s qi flows ceaselessly, hard to follow,\nDispersing and circulating like floating clouds.\nFloating clouds drift lightly back into the mountains,\nPassing through no aperture, entering no gate.\nSubtle matters are difficult to speak of—\nThose who grasp the subtle ascend as immortals.\nThey wander beside the Five Peaks and Weak Waters,\nWhere Weak Waters admit no one, slaying all who enter.\nThose with wisdom and insight avert calamity,\nAbiding with the world in endless joy.\nWho knows the Mysterious Mandate of Great Purity?\nPeople of this age are mostly foolish and blind.\nWhen the seven-and-nine cycle ends, demonic thieves arise—\nWhy not guard and cultivate yourself in advance?\nBitter words and beneficial deeds never deceive;\nOnce parted from oneself, when shall reunion come?\nDao and worldly ways differ—ponder this well.\nMountains and hills overgrown with weeds are hard to tend.\nA good physician places ten in the mouth,\nKind and joyful gentlemen are what the people long for.\nSimply open your heart and hasten to it,\nDispelling evil and rebellion without doubt.\nThe hesitant and doubtful cannot cultivate the Dao.\n\nDragons transform into floating clouds, reaching the southern barbarians,\nThe Yangtze’s waters run dry, the people grow few.\nDemonic thieves roam among the populace,\nDisrupting and stifling qi—no one can distinguish.\nWhen the Master Lord emerges, he slays them all,\nAnd only then does Great Peace reveal the True Lord.\n\nExcessive fortune becomes the seed of humanity,\nInscribed names ascend to the Supreme Lord on High.\nBestowed with talismans and registers to guard the body’s form,\nThoughts like a summoning—ever following one.\nReverence like attendance—intimately close,\nTrue qi arrives and attaches, forming the myriad spirits.\nWith heaven it preserves, ascending Kunlun,\nHarnessing nine dragons, journeying like clouds.\nThe radiant youths reach Liaodong,\nWhen urgent matters arise, swift horses bear the message.\nA thousand li pursued like flying bees,\nYet poisonous and harmful qi cannot be breached.\nRoads blocked and severed, no passage remains—\nAlas, in this world, longing for the Nine Lords.\nA mother’s nurturing of her child shares the same intent,\nWithout bias or partiality, one may follow.\nSpirit birds repel evil and dispel the multitude of ills,\nTreacherous ministers and villainous sons plunge into the earth.\nThen comes Great Peace, the qi pure and just,\nThe True Lord emerges, discerning men’s countenances.\n\nThree, five, seven, nine—inner and outer in harmony,\nThe methods of nurturing life, qi in accord.\nHarmonious and compliant, above and below, no calamity strikes,\nYet many fail to comprehend, idly speaking of emptiness.\nWestern affairs unfinished, broken and bound again,\nHolding the heart in hesitation, no path to follow.\nGreat disaster suddenly arrives, roads impassable—\nYou wish to flee the world, east of Huayin.\nWandering atop high mountains, gazing at the sea’s waters,\nThe sun’s rising vast and boundless, unbearable to behold.\nIt darkens men’s eyes, inviting transgression and guilt,\nFish hide in deep abysses, lured to death by bait.\nThe south not only devours its own tail,\nLiver and heart live alone, the body as if dead.\nWithin the Golden Countenance City, a white pheasant appears,\nA rarity in the world, the sight of men.\nForbidden ground’s treasures must not be approached—\nGreed, lust, and desire rend the heart asunder.\nCorpses strewn violently, drawing sighs from men,\nUnable to purify themselves, they cry out to heaven in resentment.\n\nOur Dao is pure and unsullied, selecting the seed-people,\nFew possess clear understanding to respond to our scripture.\nSouth to Huai and Yang, crossing Meng Ford,\nA floating bridge flutters lightly atop the water’s crest.\n\nThe myriad clans pass without hindrance,\nTheir names recorded on scrolls at the ford’s gate.\nThey falsely claim to escort the officials,\nYet upon inquiry, their true origins are revealed.\nHuman hearts return to their feelings, restoring the root,\nFor roots deeply probed endure, and things revert to nature.\nThe qi of nature emerges from emptiness and nothingness,\nThe vast and boundless Lu Dao moves in harmony with it.\nFortunate to have the innocent ones lend support,\nThey shed the net’s entanglements, their six wings unfurled.\nCrying to the heavens, they soar toward the Nine Capitals,\nYet who can unravel the essence of the Nine Capitals?\nThe immortal Wang Qiao dwells in his stone hut,\nServing as disciple to Laozi, their lives aligned in accord.\nSurveying the ages of emperors, he knows rise and fall,\nThe noble man of the Dao harbors no sorrow in his heart.\nVast and cleansing like a ceaseless flow,\nThe hundred rivers’ waters return to the sea.\nThe sea’s surging waves hold boundless aspiration,\nYet boundless constraints give way to Wo Jiao.\nWo Jiao receives all without fail, dissolving it,\nTransforming scattered forms into drifting clouds.\nThe drifting clouds, light and fleeting, return to the mountains,\nCondensing at the valley’s mouth to form sweet springs.\nWhen affairs converge in the twilight, the household falls silent,\nDivine boys and jade maidens stand in attendance.\nThey assist men and women in becoming the ten thousand spirits,\nAnd the ten thousand spirits all arise as perfected beings.\nOnce perfected, they ascend as immortals,\nRoaming the Five Peaks upon purple clouds.\nYoked to six dragons, they meet at Heaven’s Gate,\nWhere harmful qi deters all from advancing.\nTen journeys, ten deaths, none return at first—\nIf you wish to enter the gate, follow Lu Ban.\nI speak to the world’s master craftsmen:\nThe Chamber of Lingering Yin lies within the Central Cinnabar.\nInner and outer flow freely without hindrance,\n\nHarmonizing qi and uniting sound, the Dao’s origin unfurls.\nThe Dao’s continuity—who can truly follow?\nIn a town of ten households, not one holds the mean.\nMy Dao-qi is constrained, unable to expand;\nI rage at the ghostly teachers who blame my ministers.\nSummoning and selecting seeds without diligence,\nThe Great Peace nears—affairs must be divided.\nPetitions list names before the Grand Clarity,\nWith merits, conduct, and records compiled as one.\nWithin the Jade Calendar lie the names of the living—\nThe Three Qi must be complete to cherish the child’s form.\nWithout practicing the Three, Five, Seven, or Nine births,\nHow can one transcend and witness the Great Peace?\n\nThe *Yin-Yang Central Classic*’s matters are hard to fathom,\nYet at times, enlightenment comes through keen reflection.\nEmerging from yang, entering yin, reaching profound darkness,\nWithin the Eight Poles lie the Nine Cities.\nWithin the Nine Palaces, the celestial patterns align—\nThe Three Qi and Five Qi give rise to the body.\nSeven and Nine dispel misfortune and ward off calamity,\nThe celestial reckoning flows with the seasons’ clarity.\n\nThe Three Masters issue teachings to officers and soldiers,\nGuardian Generals encamp around the dwelling.\nThey repel stale qi and expel malevolent spirits,\nWhile the Martial Lord brings blessings to the central courtyard.\nDisasters vanish, harm recedes, the Dao grows radiant,\nNames resound far and wide, the world knows glory,\nDescendants flourish, aiding ministers and lords.\nCrimson Chariot Envoys stand at the gate pavilion,\nAttendants flank the Dao’s portal.\nScribes and clerks occupy the center,\nThe Lord of the Middle Prime oversees the records.\n\nUnblocking stagnation to return to one’s homeland,\nDwelling in peace and joy, life extends long.\nSurveying the Five Emperors’ rule over the Han heartland,\nGreat trees flourish, spreading their fame.\nDrooping branches and leaves shade the yang,\nThe Four Seas gather to form pillars and beams.\nExhorting men and women to kindness,\nBreathing life into the Eight Woods, qi reigns supreme.\nThe true Dharma establishes the celestial and earthly order,\nHeaven and Earth’s sovereigns rectify yin and yang.\nThe Dao resides within, its name proclaimed—\nThe Chamber of Lingering Yin shimmers in dark yellow.\nLush lingzhi mushrooms blanket the palace halls,\nJade towers and golden gates stand on either side.\nBronze sentinels sit in watchful gaze,\nGuarding the public gates with frost-like severity.\nThe crimson gates blaze—who can withstand them?\nThe worthy and noble are called \"Dao Masters.\"\nTo prevent calamity and dispel harm, contemplate the Primordial Yang,\nQi overflows, suffusing the body with radiant splendor.\nFeathers sprout upon my form as I soar through the clouds,\nAscending to meet the Venerable Lord in the Yellow Mountains.\nRoaming the Southern Peak, lodging in tranquil chambers,\nI wander with the immortal Wang Qiao.\nWestward to the Broad Han, traversing the Long Wall,\nIn Chang’an’s city, barbarian horses neigh.\nTossing their heads, bits clenched, the people take alarm,\nFleeing in panic, they abandon the empty earthen walls.\nFather and son turn to tigers, seizing the hour’s advantage,\nObserving the world’s vicissitudes, they proclaim their names.\n\nThe era is tumultuous, qi unsettled,\nCold and heat afflict the human form.\nRebellious hair and inverted sitting punish the greedy,\nThe world dreads their might, laws and bans constrain.\nThe man of Dao remains untroubled,\nVast and pure, dwelling in the long flow.\nWater’s bound current knows no rest,\nLightly the skiff glides, drifting with the wind.\nOars and sculls urge it onward, swift as floating,\nPassing one another without delay.\nTo linger is to sink or rise—\nHarming the ignorant and deepening others’ sorrow.\n\nSouthward across rivers and seas to Jianye’s city,\nWhere once great joy brought descendants glory.\nFailing to uphold the root leads to ruin in death,\nIn the southern lands, miasmic qi withers the grass.\nBirds cannot fly past it, men perish in its grip—\nTo avoid harm and live long, keep distance.\nGuard the Dao to build merit and fame,\nNever covet wealth, lust, or desire.\nBe steadfast, pure, and resolute—your will must be clear,\nOnly then can you transcend and witness the Great Peace.\n\nThe True Lord of Great Peace once more brings clarity,\nOrdering documents to await the crane’s cry.\nThe Twenty-Four Governances convene at Yangping,\nTheir overseers record households and names.\nRemoving death and inscribing life, they ascend to the Grand Clarity,\nTexts and teachings are made distinct.\nOut with the old, in with the new—grants are bestowed,\nMerits are tallied to protect all beings.\nMale and female officials bear separate titles,\nThe wise overseers refine human forms.\nIf one with understanding seeks life,\nOpen their heart, transform them together, and first solidify sincerity.\nList their names on the register to transcend life,\nNever obstruct or block human sentiment.\nOverseers must be discerning, pondering the scriptures—\nIf one breaks the law, their crimes are recorded.\nWhips and cudgels bring bodily affliction,\nThose who govern the people must keep their hearts level.\nNever act perversely or harbor selfish motives,\nNor let lust, desire, or beauty enslave your form.\n\nIdle and scattered, the libationers—both new and old—\nWith dull natures and obstructed minds, fail to grasp the truth.\nDiscoursing on the Dao’s origin, they madly delude others,\nTheir vulgar tongues expose them to common inquiry.\nInviting disaster, they face the Three Examinations,\nYet as kin of the Dao’s qi, they receive no grace.\nUnable to repent or appeal to higher powers,\nThey provoke the overseers’ precise judgment.\nGood and evil bear distinct names, their deeds recorded—\nI have officials among men to enforce this.\nDrive them to ruin, even unto death,\nFor those above, excessive desires lack loyalty.\nThe people, burdened by corvée, neglect farming,\nPlanting out of season, flowers wither without bloom.\nHalf the eggs spoil, their names inscribed in death,\nGrain becomes gold and jade—cut off their sustenance.\nPeople gaze at one another, faces sallow with reproach,\nHearts heavy with sorrow, suffering worse than bereavement.\n\nIn an age of chaos, no order remains,\nRulers greedy, ministers corrupt, laws forsaken.\nThe world seeks change, yet no loyal men appear,\nLoyal ministers and filial sons hide in seclusion.\nAvoiding worldly affairs, they feign madness,\nWhile treacherous ministers and villains soar in ambition.\nRighteous words are spoken to restore order,\nUpholding justice, wielding authority, easing the heart’s burden.\nOfficials falter, losing their moral compass,\nSoldiers and hundreds of officers endure hardship.\nBearing earth, treading water, they march in lament,\nThe hundred rivers’ currents rush toward the marsh city.\nThe true onslaught is hard to withstand—\nFire loses its brightness, the sun dims.\nFiefs and lands are leveled, the state becomes a kingdom,\nThe people of Qi sigh, their bodies broken.\nRaising sheep that turn to tigers, mice to wolves,\nTheir names and natures change, their norms overturned.\n\nWestward across the famous waters, through fiery paths,\nDeep forests and valleys brim with poisonous frost.\nA hundred grasses are slaughtered, their leaves wither yellow,\nIn the first month of spring, the heavens align.\nThe Dipper’s pivot turns with the morning sun,\nNurturing all life, extending their years.\nIn harmony with Heaven, they become divine generals,\nHan Zhong and Fan Li assist in their governance.\nConsuming the Nine Elixirs, fasting on grain,\nDwelling in famed mountains, in stone chambers and halls.\n\nBefore lies the source’s long flow, its course vast—\nChaos follows to the sea’s southern light.\nThe sea’s waters, still, thicken like paste,\nThe source’s roar unchecked, none to withstand.\nNeither sweet nor bitter, scentless, unscented,\nYet within, the crimson child crosses to life.\n\nMy Dao defies mortal sentiment,\nIts true law aligns with Heaven and Earth, the body bright.\nThe Way emerges from subtlety, enters the Mystery’s palace,\nVast and distant, boundless, fathomless.\nLike a hundred rivers flowing to the sea,\nNo stream too small to deepen its expanse.\n\nScholars who love learning yearn for purity and loyalty,\nHumble and yielding, their resolve held deep.\nUnaligned with divided hearts, they refine their origin,\nFor I, the Dao, cherish life and love the good.\nHarmonizing the people, embracing simplicity, guarding unadorned integrity—\nXu You washed his ears by the river’s edge.\nPure and unsullied, set apart from the crowd,\nHe rested on stone, rinsed his mouth with the stream, meditated on truth.\nGathering the essence of mushrooms, he became ten thousand spirits,\nConsuming the Three Subtleties, drinking the divine elixir.\nHis lifespan endless, linked to Heaven,\nRoaming and playing beyond all limits, through the Eightfold Gates.\nThe Eightfold Tower of Departure bends and extends,\nWithin the Ninefold Depths, profound and unpeopled.\nWho can divide the qi of Chaos?\nIt unfolds yin and yang, spreading the Dao’s origin.\nNurturing the limbs, sprouting the flower’s root,\nThe root grows firm and enduring, as nature intends.\nThe qi of nature flows from Kunlun,\nNorth of the mountain, bitter and desolate, lie warm springs.\nThey heal all ailments, dispel misfortune,\nEven the guilty find fortune renewed.\nThe *Laozi’s Transformations Beyond Limits* concludes here.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "老君变化无极经 经名：老君变化与极经。 撰人不详，约出於南北朝。 一卷。 底本出处：《正统道藏》正一部 老君变化无极经 老君变化无极中，出处幽微黄房宫。 炼形淑淑虚无同，光景布行八极中。 真名一出会九公，道理长远乐无穷。 胶驾九龙车马僮，上登八重玉阙中。 金楼之台望华山，山上真人授我经。 教我学道身当清，慎勿贪淫没汝形。 清身洁己身长生，老君之道自然并。 不求吾道经教名，那得度灾为种生。 贤者思之解其情，缄入缕出气自明。 施写有法随时生，秋收冬藏入黄庭。 窈窈冥冥气合并。 老君变化易身形，出在胡中作真经。 胡儿反叛无真诚， 朝降暮反结罪名。 部落强丁至死倾，叩头来前索求生。 老君执意欲不听， 谪被赭衣在身形。 沐头剔须为信盟，绝其妻娶禁杀生。 若能从化过其名， 日中一食读真经。 不得欺殆贪淫情，若有犯法灭汝形。 胡儿弥伏道气隆， 随时转运西汉中。",
      "translated_text": "**The Scripture of Lord Lao’s Transformations and the Infinite**\n\n**Scripture Title:** *The Scripture of Lord Lao’s Transformations and the Infinite*. Author unknown, approximately composed during the Northern and Southern Dynasties. One scroll. Base text from: *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n---\n\nWithin the boundless transformations of Lord Lao,\nEmerging from the hidden depths of the Yellow Chamber Palace.\nRefining the form, pure and serene, in union with the Void,\nRadiance and light spread throughout the eight directions.\n\nOnce the True Name is revealed, the Nine Lords assemble,\nThe Dao’s principles endure, joy without end.\nMounting the chariot drawn by nine dragons, with attendants in tow,\nAscending the eight-tiered jade tower.\n\nFrom the golden terrace, gazing upon Mount Hua,\nWhere the Perfected Ones upon the mountain bestowed upon me this scripture.\nThey taught me to cultivate the Dao, keeping the body pure,\nBeware of lust and excess, lest they destroy your form.\n\nPurify the body, cleanse the self, and attain longevity,\nFor the Dao of Lord Lao naturally aligns with this.\nWithout seeking the fame of this Dao’s teachings,\nHow can one transcend calamity and attain rebirth?\n\nThe wise contemplate this and grasp its essence,\nSealing the breath within, releasing it in threads, qi becomes luminous.\nTransmission and copying follow the proper method, arising with the seasons,\nHarvesting in autumn, storing in winter, entering the Yellow Court.\nSubtle and profound, qi merges as one.\n\nLord Lao transforms and alters his form,\nAppearing among the Hu as the True Scripture.\nThe Hu people rebel without sincerity,\nSurrendering by day, betraying by night, incurring guilt.\n\nTheir tribes and strongmen meet ruin,\nKneeling in supplication, begging for life.\nLord Lao, steadfast in resolve, refuses to heed,\nCondemning them to wear the red robes of punishment.\n\nShaving their heads, cutting their beards as a pledge of faith,\nSevering ties with wives, forbidding the taking of life.\nIf they can follow the transformation and transcend their names,\nThey may eat once at noon and recite the True Scripture.\n\nThey must not deceive, slacken, or indulge in lust,\nFor those who violate the law will have their forms destroyed.\nThe Hu people, humbled, revere the Dao’s power,\nFollowing the turning of the times into the Western Han.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 386,
      "start_sentence": 0,
      "end_sentence": 28,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.36948847770691,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\老君变化无极经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "木子为姓讳口弓，居在蜀郡成都官。 赤名之域出凌阴， 弓长合世建天中。 乘三使六万神崇，真列三师有姓名。 二十四治气当成， 分符券契律令名。 诛符伐庙有常刑，老君正法道自明。 仙官簿录随所请， 阴阳中经无人明。 唯有龙胎师度形，白发翩翩游天庭。 羽翼开张毛衣成， 五色斑斑如列星。 游玑玉衡正其名。 居束烟浪生海阳，海水不流须风扬。 无有涯岸束西相，不逆细流故探长。 汪汪巨海百谷王，百川倾流水汤汤。 源出昆仑华阴堂，阴气踊跃难可当。 宜预防之过灾殃，得见太平升仙房。 乘云驾龙到南阳，饮食行厨布腹肠。 弹琴鼓弦举乐觞，要当解音别宫商。 角征所生同室堂。 吾入幽河止泉元，大道坦坦莫不闻。 养士天下皆称臣，弟子再拜请所问。",
      "translated_text": "The surname is Wood and Child, the given name Bow,\nDwelling in the Chengdu Prefecture of Shu Commandery.\nFrom the Crimson-Named Realm emerges the Icehouse,\nBow and Long unite to establish the Center of Heaven.\n\nRiding the Three, employing the Six, myriad spirits revere,\nTrue ranks of the Three Masters bear names.\nTwenty-four Treaties bring qi to fulfillment,\nDividing talismans, contracts, statutes, and decrees.\n\nPunitive talismans and temple subjugations follow fixed penalties,\nLord Lao’s Orthodox Law makes the Dao resplendent.\nImmortal officials record petitions as requested,\nThe *Yin-Yang Central Canon* remains unknown to men.\n\nOnly the Dragon-Womb Master transforms the form,\nWhite-haired and fluttering, he roams the Celestial Court.\nFeathers and wings spread, plumage complete,\nFive-colored and dappled like arrayed stars.\nThe Jade Armillary and Balanced Standard bear their true names.\n\nDwelling where misty waves rise in the eastern sea,\nSea waters do not flow unless winds stir them.\nWithout bounds or shores, east and west align,\nNot resisting the gentle current, thus it endures long.\nVast and boundless, the great sea is king of a hundred valleys,\nA hundred rivers pour in, waters surging.\nIts source lies in Kunlun’s Hua-Yin Hall,\nWhere yin qi surges, difficult to withstand.\n\nOne should guard against it to avert calamity,\nAttaining Great Peace and ascending to the Immortal Chambers.\nRiding clouds and driving dragons to Nanyang,\nFeasting and dining, the traveling kitchen fills the belly.\nPlucking the zither, strumming strings, raising cups of joy,\nOne must discern tones and distinguish gong from shang.\nJue and zhi arise together in the same hall.\n\nI enter the Dark River to still the Spring’s Origin,\nThe Great Dao lies level and open—who has not heard?\nNurturing scholars, all under heaven call themselves subjects,\nDisciples bow twice and inquire of what is asked.",
      "overlap_context": "o wear the red robes of punishment.\n\nShaving their heads, cutting their beards as a pledge of faith,\nSevering ties with wives, forbidding the taking of life.\nIf they can follow the transformation and transcend their names,\nThey may eat once at noon and recite the True Scripture.\n\nThey must not deceive, slacken, or indulge in lust,\nFor those who violate the law will have their forms destroyed.\nThe Hu people, humbled, revere the Dao’s power,\nFollowing the turning of the times into the Western Han.",
      "start_char": 386,
      "end_char": 701,
      "start_sentence": 29,
      "end_sentence": 51,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.363933801651001,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\老君变化无极经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "道有微气生活人，诚非下愚所可陈。 道气绵绵难可遵，布散流行如浮云。 浮云翩翩还入山，亦无孔穴入无问。 细微之事难可言，若解微者飞升仙。 比游五岳弱水边，弱水不度入杀人。 有知之明预防灾，与世相守乐无期。 玄命太清谁知之，今世之人多愚痴。 七九数尽鬼贼来，何不防闲自修理。 苦言利行不相欺，与己一别会何时。 道俗不同善自思，丘山草秽难可治。 口中安十为良医，恺悌君子民所思。 但当披怀来趣之，消除恶逆心无疑。 犹豫之子道不治。 龙变浮云到南蛮，江水枯竭人民单。 鬼贼游行在民问， 聊乱止气无人分。 师君一出诛尽群，尔乃太平见真君。",
      "translated_text": "The Dao holds subtle qi that gives life to humankind,\nYet this is not something the benighted can expound.\nThe Dao’s qi flows ceaselessly, hard to follow,\nDispersing and circulating like floating clouds.\nFloating clouds drift lightly back into the mountains,\nPassing through no aperture, entering no gate.\nSubtle matters are difficult to speak of—\nThose who grasp the subtle ascend as immortals.\nThey wander beside the Five Peaks and Weak Waters,\nWhere Weak Waters admit no one, slaying all who enter.\nThose with wisdom and insight avert calamity,\nAbiding with the world in endless joy.\nWho knows the Mysterious Mandate of Great Purity?\nPeople of this age are mostly foolish and blind.\nWhen the seven-and-nine cycle ends, demonic thieves arise—\nWhy not guard and cultivate yourself in advance?\nBitter words and beneficial deeds never deceive;\nOnce parted from oneself, when shall reunion come?\nDao and worldly ways differ—ponder this well.\nMountains and hills overgrown with weeds are hard to tend.\nA good physician places ten in the mouth,\nKind and joyful gentlemen are what the people long for.\nSimply open your heart and hasten to it,\nDispelling evil and rebellion without doubt.\nThe hesitant and doubtful cannot cultivate the Dao.\n\nDragons transform into floating clouds, reaching the southern barbarians,\nThe Yangtze’s waters run dry, the people grow few.\nDemonic thieves roam among the populace,\nDisrupting and stifling qi—no one can distinguish.\nWhen the Master Lord emerges, he slays them all,\nAnd only then does Great Peace reveal the True Lord.",
      "overlap_context": "al Chambers.\nRiding clouds and driving dragons to Nanyang,\nFeasting and dining, the traveling kitchen fills the belly.\nPlucking the zither, strumming strings, raising cups of joy,\nOne must discern tones and distinguish gong from shang.\nJue and zhi arise together in the same hall.\n\nI enter the Dark River to still the Spring’s Origin,\nThe Great Dao lies level and open—who has not heard?\nNurturing scholars, all under heaven call themselves subjects,\nDisciples bow twice and inquire of what is asked.",
      "start_char": 702,
      "end_char": 973,
      "start_sentence": 52,
      "end_sentence": 68,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.665854930877686,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\老君变化无极经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "有福过度为种人， 条名上白太上君。 赐与符录护身形，思如呼之恒随人。 敬如侍之与相亲， 真气来附成万神。 与天相保升昆仑，縿驾九龙行如云。 郁郁之童至辽东， 时欲从急驿马通。 千里相逐如飞蜂，毒害之气难可冲。 道路隔塞绝不通， 奈何此世思九公。 母能养子恩意同，无偏无党可相从。 灵禽辟邪除群凶， 奸臣贼子入地冲。 尔乃太平气清公，真君当出别人容。 三五七九内外同， 养生之法气相从。 和顺上下无灾冲，人多不解妄说空。 西事未讫折复束， 持心犹豫无所从。 大灾奄至路不通，汝欲避世华阴东。 游上高山望海水， 日出浩汗不可视。 令人目暗犯过罪，鱼藏深渊食饵死。 南方不但自食尾， 肝心独活舍如死。 金容城中有白雉，世之所希人所视。 禁地之物不可底， 贪淫爱色心断乱。 强尸纵横令人叹，不能清己呼天怨。 吾道清洁选种民， 少有明解应吾文。 南到淮扬经孟津，浮桥翩翩在水巅。",
      "translated_text": "Excessive fortune becomes the seed of humanity,\nInscribed names ascend to the Supreme Lord on High.\nBestowed with talismans and registers to guard the body’s form,\nThoughts like a summoning—ever following one.\nReverence like attendance—intimately close,\nTrue qi arrives and attaches, forming the myriad spirits.\nWith heaven it preserves, ascending Kunlun,\nHarnessing nine dragons, journeying like clouds.\nThe radiant youths reach Liaodong,\nWhen urgent matters arise, swift horses bear the message.\nA thousand li pursued like flying bees,\nYet poisonous and harmful qi cannot be breached.\nRoads blocked and severed, no passage remains—\nAlas, in this world, longing for the Nine Lords.\nA mother’s nurturing of her child shares the same intent,\nWithout bias or partiality, one may follow.\nSpirit birds repel evil and dispel the multitude of ills,\nTreacherous ministers and villainous sons plunge into the earth.\nThen comes Great Peace, the qi pure and just,\nThe True Lord emerges, discerning men’s countenances.\n\nThree, five, seven, nine—inner and outer in harmony,\nThe methods of nurturing life, qi in accord.\nHarmonious and compliant, above and below, no calamity strikes,\nYet many fail to comprehend, idly speaking of emptiness.\nWestern affairs unfinished, broken and bound again,\nHolding the heart in hesitation, no path to follow.\nGreat disaster suddenly arrives, roads impassable—\nYou wish to flee the world, east of Huayin.\nWandering atop high mountains, gazing at the sea’s waters,\nThe sun’s rising vast and boundless, unbearable to behold.\nIt darkens men’s eyes, inviting transgression and guilt,\nFish hide in deep abysses, lured to death by bait.\nThe south not only devours its own tail,\nLiver and heart live alone, the body as if dead.\nWithin the Golden Countenance City, a white pheasant appears,\nA rarity in the world, the sight of men.\nForbidden ground’s treasures must not be approached—\nGreed, lust, and desire rend the heart asunder.\nCorpses strewn violently, drawing sighs from men,\nUnable to purify themselves, they cry out to heaven in resentment.\n\nOur Dao is pure and unsullied, selecting the seed-people,\nFew possess clear understanding to respond to our scripture.\nSouth to Huai and Yang, crossing Meng Ford,\nA floating bridge flutters lightly atop the water’s crest.",
      "overlap_context": "ul gentlemen are what the people long for.\nSimply open your heart and hasten to it,\nDispelling evil and rebellion without doubt.\nThe hesitant and doubtful cannot cultivate the Dao.\n\nDragons transform into floating clouds, reaching the southern barbarians,\nThe Yangtze’s waters run dry, the people grow few.\nDemonic thieves roam among the populace,\nDisrupting and stifling qi—no one can distinguish.\nWhen the Master Lord emerges, he slays them all,\nAnd only then does Great Peace reveal the True Lord.",
      "start_char": 973,
      "end_char": 1358,
      "start_sentence": 69,
      "end_sentence": 101,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.926811218261719,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\老君变化无极经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "过度万姓无留难， 条牒姓名诣津门。 宜名诈称送司官，推问情实尽其元。 人心归情还本根， 根探固久物自然。 自然之气出虚无，鲁道荡荡合与俱。 赖得赤子相接扶， 解脱罗网六翮舒。 唳天高飞诣九都，九都之要谁能舒。 仙人王乔处石庐， 师事老子合生符。 历观帝世知沉浮，有道君子心不忧。 荡荡涤涤如长流， 百川之水归海中。 海水儳涌志无穷，无穷之束有沃焦。 沃焦所受无不消， 变散形身作浮云。 浮云翩翩还入山，结气谷口为甘泉。 事会之瞑家无言， 神男玉女侍在边。 扶助男女成万神，万神皆生为真人。 真人已成飞升仙， 游於五岳乘紫云。 胶驾六龙会天门，门有害气不敢前。 十往十死初不还， 汝欲入门依鲁班。 天下名巧吾语育，凌阴之室在中丹。 内外相通无留难，",
      "translated_text": "The myriad clans pass without hindrance,\nTheir names recorded on scrolls at the ford’s gate.\nThey falsely claim to escort the officials,\nYet upon inquiry, their true origins are revealed.\nHuman hearts return to their feelings, restoring the root,\nFor roots deeply probed endure, and things revert to nature.\nThe qi of nature emerges from emptiness and nothingness,\nThe vast and boundless Lu Dao moves in harmony with it.\nFortunate to have the innocent ones lend support,\nThey shed the net’s entanglements, their six wings unfurled.\nCrying to the heavens, they soar toward the Nine Capitals,\nYet who can unravel the essence of the Nine Capitals?\nThe immortal Wang Qiao dwells in his stone hut,\nServing as disciple to Laozi, their lives aligned in accord.\nSurveying the ages of emperors, he knows rise and fall,\nThe noble man of the Dao harbors no sorrow in his heart.\nVast and cleansing like a ceaseless flow,\nThe hundred rivers’ waters return to the sea.\nThe sea’s surging waves hold boundless aspiration,\nYet boundless constraints give way to Wo Jiao.\nWo Jiao receives all without fail, dissolving it,\nTransforming scattered forms into drifting clouds.\nThe drifting clouds, light and fleeting, return to the mountains,\nCondensing at the valley’s mouth to form sweet springs.\nWhen affairs converge in the twilight, the household falls silent,\nDivine boys and jade maidens stand in attendance.\nThey assist men and women in becoming the ten thousand spirits,\nAnd the ten thousand spirits all arise as perfected beings.\nOnce perfected, they ascend as immortals,\nRoaming the Five Peaks upon purple clouds.\nYoked to six dragons, they meet at Heaven’s Gate,\nWhere harmful qi deters all from advancing.\nTen journeys, ten deaths, none return at first—\nIf you wish to enter the gate, follow Lu Ban.\nI speak to the world’s master craftsmen:\nThe Chamber of Lingering Yin lies within the Central Cinnabar.\nInner and outer flow freely without hindrance,",
      "overlap_context": " pheasant appears,\nA rarity in the world, the sight of men.\nForbidden ground’s treasures must not be approached—\nGreed, lust, and desire rend the heart asunder.\nCorpses strewn violently, drawing sighs from men,\nUnable to purify themselves, they cry out to heaven in resentment.\n\nOur Dao is pure and unsullied, selecting the seed-people,\nFew possess clear understanding to respond to our scripture.\nSouth to Huai and Yang, crossing Meng Ford,\nA floating bridge flutters lightly atop the water’s crest.",
      "start_char": 1358,
      "end_char": 1682,
      "start_sentence": 102,
      "end_sentence": 129,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.023776292800903,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\老君变化无极经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "同气合音舒道元。 道之绵绵谁能遵，十室之邑无中人。 令吾道气屈不伸， 怒吾师鬼咎吾臣。 呼行选种不精勤，太平垂至事当分。 条牒姓名言太清， 功劳行状与集并。 玉历之中有生名，三气当备爱子形。 不行三五七九生， 那得过度见太平。 阴阳中经事难明，时有开解能思精。 出阳入阴至玄冥， 八极之内有九城。 九宫之内应天经，三气五气令身生。 七九去灾除殃丁， 天历运度随时清。 三师出教给吏兵，守宅将军绕舍营。 辟斥故气却邪精， 武夷来福在中庭。 除灾去害道日明，名显远殊世有荣，子孙昌隆辅相卿。 赤车使者在门亭，左右使从道门旁。 通事书佐处中央，中元之君摄纪纲。 开通屈滞到故乡，处所安乐命延长。 历观五帝治汉中，大树蓊蓊布名张。 垂枝布叶阴覆阳，四海来会为柱梁。 劝化男女善相将，接息八木气当王。 正法天地立纪纲，乾坤所主正阴阳。 道在其中名布行，凌阴之室色玄黄。 芝草蒙蒙覆宫堂，金楼玉阙侠两傍。 铜人翁仲坐相望，侠守公门严如霜。 赤门赫赫谁能当，贤人君子字道长。 防灾除害思元阳，气流溢布身华光。 身生吾羽飞云行，上谒老君山中黄。 游观南岳宿闲房，仙人王乔共遨翔。 西到广汉历长城，长安城中胡马呜。 奋头衔勒人民惊，民惊奔走空土城。 父子为虎因时营，观世浮沉发公名。 时世浩扰气不宁，温寒不适在人形。 变发坐逆罚贪夫，威令世畏法禁拘。 有道之士心无忧，荡荡涤涤处长流。 水之束流无息休，翩翩扬舟随风流。 橹棹相催行如浮，转相过度无稽留。 稽滞不去必沉浮，伤子无知益人忧。 南度江海建邺城，故时大乐子孙荣。 不承权舆至死倾，日南瘴气草不生。 飞乌不过没人形，远嫌避害可长生。 与道相守建功名，莫贪财利色欲情。 贞洁守节志当清，尔乃过度见太平。 太平真君复能明，整理文书应鹄呜。 二十四治会阳平，主者资籍户言名。 除死着生诣太清，文字教案令分明。 迁故迎新给所请，有功增录护群生。 男官女官有别名，聪明主者炼人形。 若有明解来求生，开心同化首凝诚。 条名上簿过度生，不得壅过塞人情。 主者明顺思书经，若有不法结罪名。 鞭杖在身病殃丁，亲民之职心当平。 不得鬲戾始拓情，贪淫爱色役汝形。 冗散祭酒新故民，素性间塞不识真。 论说道元狂惑人，口舌陋露俗人问。 招来祸害三考前，同属道气不蒙恩。 不能悔咎上呼怨，动吾主者精断弹。 善恶异名列状言，吾有司官在人问。 当驱治之至死倾，上多烦欲无忠贞。 民困於役不农耕，种植失时花无荣。 服卵半伤结死名，谷如金玉断之粮。 人民相视色责黄，心愁意苦剧遭丧。 思乱之世无纪纲，君贪臣浊失法常。 世欲变改无忠良，忠臣孝子深隐藏。 不预世事托佯狂，奸臣贼子志飞扬。 义言自陈徕纪纲，执正立权舒中肠。 群寮困顿失义方，士卒百上困狼当。 负土蹑水啼吟行，百川之流奔沼城。 真来之冲难可当，火失其明日无光。 封邑齐土国为王，齐人感叹身摧伤。 养羊为虎鼠为狼，变化姓字易其常。 西度名水历火行，深林还谷多毒霜。 杀戮百草叶枯黄，孟春正月合天呈。 回转斗枢随朝阳，养育群生寿命长。 与天相保神圣将，韩终范蠡相辅匡。 饮食九药辟谷粮，名山可处石室堂。",
      "translated_text": "Harmonizing qi and uniting sound, the Dao’s origin unfurls.\nThe Dao’s continuity—who can truly follow?\nIn a town of ten households, not one holds the mean.\nMy Dao-qi is constrained, unable to expand;\nI rage at the ghostly teachers who blame my ministers.\nSummoning and selecting seeds without diligence,\nThe Great Peace nears—affairs must be divided.\nPetitions list names before the Grand Clarity,\nWith merits, conduct, and records compiled as one.\nWithin the Jade Calendar lie the names of the living—\nThe Three Qi must be complete to cherish the child’s form.\nWithout practicing the Three, Five, Seven, or Nine births,\nHow can one transcend and witness the Great Peace?\n\nThe *Yin-Yang Central Classic*’s matters are hard to fathom,\nYet at times, enlightenment comes through keen reflection.\nEmerging from yang, entering yin, reaching profound darkness,\nWithin the Eight Poles lie the Nine Cities.\nWithin the Nine Palaces, the celestial patterns align—\nThe Three Qi and Five Qi give rise to the body.\nSeven and Nine dispel misfortune and ward off calamity,\nThe celestial reckoning flows with the seasons’ clarity.\n\nThe Three Masters issue teachings to officers and soldiers,\nGuardian Generals encamp around the dwelling.\nThey repel stale qi and expel malevolent spirits,\nWhile the Martial Lord brings blessings to the central courtyard.\nDisasters vanish, harm recedes, the Dao grows radiant,\nNames resound far and wide, the world knows glory,\nDescendants flourish, aiding ministers and lords.\nCrimson Chariot Envoys stand at the gate pavilion,\nAttendants flank the Dao’s portal.\nScribes and clerks occupy the center,\nThe Lord of the Middle Prime oversees the records.\n\nUnblocking stagnation to return to one’s homeland,\nDwelling in peace and joy, life extends long.\nSurveying the Five Emperors’ rule over the Han heartland,\nGreat trees flourish, spreading their fame.\nDrooping branches and leaves shade the yang,\nThe Four Seas gather to form pillars and beams.\nExhorting men and women to kindness,\nBreathing life into the Eight Woods, qi reigns supreme.\nThe true Dharma establishes the celestial and earthly order,\nHeaven and Earth’s sovereigns rectify yin and yang.\nThe Dao resides within, its name proclaimed—\nThe Chamber of Lingering Yin shimmers in dark yellow.\nLush lingzhi mushrooms blanket the palace halls,\nJade towers and golden gates stand on either side.\nBronze sentinels sit in watchful gaze,\nGuarding the public gates with frost-like severity.\nThe crimson gates blaze—who can withstand them?\nThe worthy and noble are called \"Dao Masters.\"\nTo prevent calamity and dispel harm, contemplate the Primordial Yang,\nQi overflows, suffusing the body with radiant splendor.\nFeathers sprout upon my form as I soar through the clouds,\nAscending to meet the Venerable Lord in the Yellow Mountains.\nRoaming the Southern Peak, lodging in tranquil chambers,\nI wander with the immortal Wang Qiao.\nWestward to the Broad Han, traversing the Long Wall,\nIn Chang’an’s city, barbarian horses neigh.\nTossing their heads, bits clenched, the people take alarm,\nFleeing in panic, they abandon the empty earthen walls.\nFather and son turn to tigers, seizing the hour’s advantage,\nObserving the world’s vicissitudes, they proclaim their names.\n\nThe era is tumultuous, qi unsettled,\nCold and heat afflict the human form.\nRebellious hair and inverted sitting punish the greedy,\nThe world dreads their might, laws and bans constrain.\nThe man of Dao remains untroubled,\nVast and pure, dwelling in the long flow.\nWater’s bound current knows no rest,\nLightly the skiff glides, drifting with the wind.\nOars and sculls urge it onward, swift as floating,\nPassing one another without delay.\nTo linger is to sink or rise—\nHarming the ignorant and deepening others’ sorrow.\n\nSouthward across rivers and seas to Jianye’s city,\nWhere once great joy brought descendants glory.\nFailing to uphold the root leads to ruin in death,\nIn the southern lands, miasmic qi withers the grass.\nBirds cannot fly past it, men perish in its grip—\nTo avoid harm and live long, keep distance.\nGuard the Dao to build merit and fame,\nNever covet wealth, lust, or desire.\nBe steadfast, pure, and resolute—your will must be clear,\nOnly then can you transcend and witness the Great Peace.\n\nThe True Lord of Great Peace once more brings clarity,\nOrdering documents to await the crane’s cry.\nThe Twenty-Four Governances convene at Yangping,\nTheir overseers record households and names.\nRemoving death and inscribing life, they ascend to the Grand Clarity,\nTexts and teachings are made distinct.\nOut with the old, in with the new—grants are bestowed,\nMerits are tallied to protect all beings.\nMale and female officials bear separate titles,\nThe wise overseers refine human forms.\nIf one with understanding seeks life,\nOpen their heart, transform them together, and first solidify sincerity.\nList their names on the register to transcend life,\nNever obstruct or block human sentiment.\nOverseers must be discerning, pondering the scriptures—\nIf one breaks the law, their crimes are recorded.\nWhips and cudgels bring bodily affliction,\nThose who govern the people must keep their hearts level.\nNever act perversely or harbor selfish motives,\nNor let lust, desire, or beauty enslave your form.\n\nIdle and scattered, the libationers—both new and old—\nWith dull natures and obstructed minds, fail to grasp the truth.\nDiscoursing on the Dao’s origin, they madly delude others,\nTheir vulgar tongues expose them to common inquiry.\nInviting disaster, they face the Three Examinations,\nYet as kin of the Dao’s qi, they receive no grace.\nUnable to repent or appeal to higher powers,\nThey provoke the overseers’ precise judgment.\nGood and evil bear distinct names, their deeds recorded—\nI have officials among men to enforce this.\nDrive them to ruin, even unto death,\nFor those above, excessive desires lack loyalty.\nThe people, burdened by corvée, neglect farming,\nPlanting out of season, flowers wither without bloom.\nHalf the eggs spoil, their names inscribed in death,\nGrain becomes gold and jade—cut off their sustenance.\nPeople gaze at one another, faces sallow with reproach,\nHearts heavy with sorrow, suffering worse than bereavement.\n\nIn an age of chaos, no order remains,\nRulers greedy, ministers corrupt, laws forsaken.\nThe world seeks change, yet no loyal men appear,\nLoyal ministers and filial sons hide in seclusion.\nAvoiding worldly affairs, they feign madness,\nWhile treacherous ministers and villains soar in ambition.\nRighteous words are spoken to restore order,\nUpholding justice, wielding authority, easing the heart’s burden.\nOfficials falter, losing their moral compass,\nSoldiers and hundreds of officers endure hardship.\nBearing earth, treading water, they march in lament,\nThe hundred rivers’ currents rush toward the marsh city.\nThe true onslaught is hard to withstand—\nFire loses its brightness, the sun dims.\nFiefs and lands are leveled, the state becomes a kingdom,\nThe people of Qi sigh, their bodies broken.\nRaising sheep that turn to tigers, mice to wolves,\nTheir names and natures change, their norms overturned.\n\nWestward across the famous waters, through fiery paths,\nDeep forests and valleys brim with poisonous frost.\nA hundred grasses are slaughtered, their leaves wither yellow,\nIn the first month of spring, the heavens align.\nThe Dipper’s pivot turns with the morning sun,\nNurturing all life, extending their years.\nIn harmony with Heaven, they become divine generals,\nHan Zhong and Fan Li assist in their governance.\nConsuming the Nine Elixirs, fasting on grain,\nDwelling in famed mountains, in stone chambers and halls.",
      "overlap_context": "housand spirits,\nAnd the ten thousand spirits all arise as perfected beings.\nOnce perfected, they ascend as immortals,\nRoaming the Five Peaks upon purple clouds.\nYoked to six dragons, they meet at Heaven’s Gate,\nWhere harmful qi deters all from advancing.\nTen journeys, ten deaths, none return at first—\nIf you wish to enter the gate, follow Lu Ban.\nI speak to the world’s master craftsmen:\nThe Chamber of Lingering Yin lies within the Central Cinnabar.\nInner and outer flow freely without hindrance,",
      "start_char": 1682,
      "end_char": 2995,
      "start_sentence": 130,
      "end_sentence": 210,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 46.92971587181091,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\老君变化无极经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "前临源流道里长，混沌相随到海阳。 海水不流湛如浆，源流臧喊无人当。 不甜不苦无臭香，中有赤子过度生。 吾之为道不人情，正法天地身聪明。 道出微妙入玄官，绵邈攸长难可穷。 譬如百川入海江，不逆细流致其深。 好学之士慕清忠，谦卑顺下志在心。 不共并心精其元，道吾好生爱善人。 和民抱朴守素贞，许由洗耳於河滨。 清洁有素绝不群，枕石漱流静思真。 采取芝英成万神，服食三微饮神丹。 寿命无穷与天连，游戏无极八重问。 八重离楼屈复伸，九重之裹窈无人。 混沌之气谁能分，演散阴阳舒道元。 养育肢体生华根，根生固久应自然。 自然之气出昆仑，山北绝苦有温泉。 疗治万病除殃患，犯罪之人更福原。 老君变化无极经竟",
      "translated_text": "Before lies the source’s long flow, its course vast—\nChaos follows to the sea’s southern light.\nThe sea’s waters, still, thicken like paste,\nThe source’s roar unchecked, none to withstand.\nNeither sweet nor bitter, scentless, unscented,\nYet within, the crimson child crosses to life.\n\nMy Dao defies mortal sentiment,\nIts true law aligns with Heaven and Earth, the body bright.\nThe Way emerges from subtlety, enters the Mystery’s palace,\nVast and distant, boundless, fathomless.\nLike a hundred rivers flowing to the sea,\nNo stream too small to deepen its expanse.\n\nScholars who love learning yearn for purity and loyalty,\nHumble and yielding, their resolve held deep.\nUnaligned with divided hearts, they refine their origin,\nFor I, the Dao, cherish life and love the good.\nHarmonizing the people, embracing simplicity, guarding unadorned integrity—\nXu You washed his ears by the river’s edge.\nPure and unsullied, set apart from the crowd,\nHe rested on stone, rinsed his mouth with the stream, meditated on truth.\nGathering the essence of mushrooms, he became ten thousand spirits,\nConsuming the Three Subtleties, drinking the divine elixir.\nHis lifespan endless, linked to Heaven,\nRoaming and playing beyond all limits, through the Eightfold Gates.\nThe Eightfold Tower of Departure bends and extends,\nWithin the Ninefold Depths, profound and unpeopled.\nWho can divide the qi of Chaos?\nIt unfolds yin and yang, spreading the Dao’s origin.\nNurturing the limbs, sprouting the flower’s root,\nThe root grows firm and enduring, as nature intends.\nThe qi of nature flows from Kunlun,\nNorth of the mountain, bitter and desolate, lie warm springs.\nThey heal all ailments, dispel misfortune,\nEven the guilty find fortune renewed.\nThe *Laozi’s Transformations Beyond Limits* concludes here.",
      "overlap_context": " the famous waters, through fiery paths,\nDeep forests and valleys brim with poisonous frost.\nA hundred grasses are slaughtered, their leaves wither yellow,\nIn the first month of spring, the heavens align.\nThe Dipper’s pivot turns with the morning sun,\nNurturing all life, extending their years.\nIn harmony with Heaven, they become divine generals,\nHan Zhong and Fan Li assist in their governance.\nConsuming the Nine Elixirs, fasting on grain,\nDwelling in famed mountains, in stone chambers and halls.",
      "start_char": 2995,
      "end_char": 3307,
      "start_sentence": 211,
      "end_sentence": 228,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.6414155960083,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\老君变化无极经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}