{
  "source_id": "至真子龙虎大丹诗",
  "source_file": "chunked_daozang\\至真子龙虎大丹诗.json",
  "total_chunks": 3,
  "total_original_chars": 2720,
  "total_translated_chars": 17126,
  "total_translation_time": 105.71892547607422,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\方法类\\至真子龙虎大丹诗.txt",
    "category": "方法类"
  },
  "full_translation": "**Preface to *The Supreme Perfection’s Dragon-Tiger Great Elixir Poems***\n\nBy Lu Tianzao, *Xuan De* Gentleman, Acting Commissioner of Education for Huainan West Circuit, granted the fish-shaped tally of office\n\nZhou Fang of Shaoshi Mountain, a recluse in common robes, styled himself *Guiyi* (\"Returning to Oneness\") and took the Daoist name *Zhizhenzi* (\"Supreme Perfection Master\"). He often perused the scriptures of immortals, delving into the subtleties of emptiness, exploring the gateways to transcendence, and mastering the pivotal mechanisms of *qi*-refinement. His aspiration was to unite his body with the Void, his heart forgetting the dusty world.\n\nRoaming through various commanderies and traversing many famous mountains, in the regions between the capital and Luoyang, he sometimes encountered lofty adepts. From them, he received transmissions of esoteric teachings, discerning the root and origin of \"jade water\" and tracing the lineage of the Golden Elixir. He grasped the wondrous functions of the Water Tiger and Fire Dragon, the mysteries of Earth, Metal, Fire, and Water, the proper inversion of Heaven and Earth, and the cyclic signs of day and night.\n\nZhou Fang listened with rapt attention, his heart stirred and his focus unwavering. Thus, he chose a sacred mountain and selected a true and sublime site. Heaven and Earth became his crucible, the cosmos his furnace; *Kan* (Water) and *Li* (Fire) were the essence of the supreme medicine, while lead and mercury formed the substance of the Great Elixir. Relying on the Four Symbols and aligning with the Three Powers, he followed the *wu-ji* (Earth) to perfect its true form and harnessed the River Chariot to refine its essential nature.\n\nWhen activated, Yin and Yang conjoined; when perfected, the Sun and Moon revolved. The Tiger’s roar resounded before the jade chime furnace, the Dragon’s cry echoed within the golden radiance crucible. Water and Fire coalesced, Dragon and Tiger intermingled, and with flawless timing, the Golden Elixir was achieved.\n\nThe Prince of Huai encountered this method and refined \"autumn stone,\" consuming it to ascend with his entire household to heaven. The Yellow Emperor obtained it and delved into the Golden Radiance, riding a dragon to the Han after his repast. This Elixir is neither a mineral nor a herb, nor the techniques of the Three Peaks’ maidens, nor the arts of absorbing essence through countless breaths.\n\nAll the above are the results of failing to meet a true master—some obtain mercury but not lead, or comprehend Water but not Fire. Thus it is said: a solitary Yang does not generate, a lone Yin does not give birth. It is like a mother gestating a child or a parrot incubating an egg. If one meets a master’s guidance and obtains the Elixir formula, the work is accomplished, and one’s name is listed among the Upper Clarity; when merit is fulfilled, the body roams the Purple Palace.\n\nNow, I roughly express my humble thoughts to reveal the true mechanism, briefly outlining the grand principles to transmit to like-minded seekers.\n\nWritten on the ninth day of the ninth month in the *bingyin* year of the Tiansheng era (1026).\n\n---\n\n**The Supreme Perfection’s Dragon-Tiger Great Elixir Poems**\n\nWithin lead lies mercury, called the Yellow Sprout—\nLet no common fool boast idly of its worth.\nMaster the Dragon and Tiger to harmonize the crucible,\nAnd emulate the Sun and Moon to move the River Chariot.\n\nArrange the furnace and tripod to fly the golden liquid,\nTransforming Heaven and Earth to refine jade radiance.\nThis method is not like the cicada’s molting—\nFreely you shall dwell in the Jade Emperor’s realm.\n\nDiscard idle songs and cease reading books,\nHold fast to a single intent to gather the Mystic Pearl.\nWithin the Heaven-Earth crucible, refine the Three Mercuries,\nIn the Sun-Moon furnace, simmer the Five Talismans.\n\nHaving traversed worldly affairs in full measure,\nYou can revive withered bones into a true body.\nSwiftly complete the work with the *daogui*’s power,\nRide the Tiger and mount the Dragon to ascend to the Jade Capital.\n\nRecognize the root and comprehend *Kun* (Earth),\nThen east, west, south, and north become your neighbors.\nIn *Li*’s palace lies the hidden Nine-Return Elixir,\nWithin *Kan* is deeply stored the Seven-Rebirth Silver.\n\nWhen White Snow descends, distinguish *jia* and *yi*,\nOn the day the Yellow Sprout is born, fix *geng* and *xin*.\nWhen the Golden Elixir’s firing time is complete after three years,\nYou may float eastward for ten thousand springs.\n\nThe Golden Crow and Jade Hare follow an unerring path,\nThe Three Maidens and Three Boys are originally one family.\nThe Steed of Intent chases crimson splendor,\nThe Monkey of the Heart often drifts on white elm blossoms.\n\nOnce you attended the Queen Mother’s cup of jade liquid,\nNow await Master Ding to split the jade melon.\nIn the eight hundred *lü* of green, we shall meet,\nAfter a thousand mornings of elixir refinement, leaning on mist and clouds.\n\nFor ten years, I toiled through worldly mechanisms,\nYet few know this Way within.\nThe roc’s strike into the dark sea is not without its day,\nThe dragon’s leap from cinnabar will come in time.\n\nSleeves conceal the golden hammer to subdue the Five Tigers,\nThe casket hides the precious sword to slay the Three Corpses.\nWith a single thunderous chariot’s shock, Heaven and Earth grow still—\nSeizing the luminous pearl within *Kan* and *Li*.\n\nMove mountains and overturn seas with the divine furnace,\nTransform the sword into a dragon roaring over Mirror Lake.\nA single thunderclap dispels demons,\nA thousand leagues of lightning slays yin maggots.\n\nHeaven and Earth have seized the Treasure of Non-Action,\n*Li* and *Kan* newly bestow the Pearl of Creation.\nThe Golden Bones are transmuted by lead and mercury’s power,\nA pair of simurghs leads straight to Penglai.\n\nI go to pay homage to the immortals, knocking at the grotto gate,\nIn Chang’e’s tent, embracing the Dragon’s heir.\nPluck the golden flower and the vermilion sun by their roots,\nIn the crucible, refine lead frost into the honored vessel of creation.\n\nSubduing Dragon and Tiger is the true endeavor—\nWhy be bound by the crow and hare’s morning and dusk?\nWhen the great cycle of *jiazi* completes its revolution,\nYou must ride the River Chariot to cross the sea village.\n\nGather lead’s radiance to match *jia* and *geng*,\nThe Sun’s soul and Moon’s spirit determine waxing and waning.\nWithin the Three Powers’ crucible, attack the golden laughter,\nIn the Ten Thousand Images’ furnace, refine the stone essence.\n\nThe Wild Horse is reined in, Dragon and Tiger cower,\nThe Mad Monkey is tamed, ghosts and spirits tremble.\nWhen the Gate of Heaven opens, the numinous light arrives—\nThe distant Milky Way clears, and the earth grows bright.\n\nThe Lü family once shared with me true lead,\nOnly in the Mysterious did I comprehend the Mysterious.\nThe Red Horse is captured within the Golden Valley,\nThe Blue Ox is driven before the Jade Stream.\n\nIn the night’s starry haze, I pursue the talisman envoy,\nAt dawn in the cloudy grotto, I dispatch the sword immortal.\nToday, I sever the karma rainbow,\nAnd turn the oars to sail the boat home across the blue waves.\n\nThe Great Elixir’s single secret originates from the master,\nIn white memorials and yellow robes, I petition the Red City.\nWhen refining in the golden crucible, I seal the child’s name,\nWhen simmering in the jade furnace, I bind the immortal’s title.\n\nDivine cinnabar subdues fire, enveloped in radiant light,\nSpiritual mercury flies and congeals, its aura pure and clear.\nAfter nurturing soul and spirit through nine revolutions,\nWithin the gourd, all is revealed, penetrating *shenming*.\n\nErect the sword and stabilize the furnace to refine solar radiance,\nThe true water within water is called Flowing Rosy Clouds.\nIn *Li*’s palace lies a path to the Green Dragon’s chamber,\n*Kan*’s gate has no door to the White Tiger’s home.\n\nFreely gather White Snow according to the seasons,\nAdvance to select the day to harvest the Yellow Sprout.\nInvert the jade flask to drain the celestial liquid,\nExchange bones for spirit with a single grain of sand.\n\nWhite gold transmutes to purple, its merit most sublime,\nDissolving aged countenance to restore youthful prime.\nThe numinous elixir reaches the gourd, stored in *Kan*’s gate,\nDivine cinnabar opens the crucible, piercing *Li*’s palace bright.\n\nDimly one has attained the immortal’s realm,\nWith topknot and beard, soon to wander the winds of Penglai’s garden.\nAfter refining for a thousand days, open the furnace to see—\nMyriad forms all emerge from a single crucible’s gleam.\n\nI bitterly recount these deeds to you in earnest:\nWhen awakened, one must truly comprehend.\nDo not recklessly capsize the boat’s oar,\nNor fear the high winds when casting the fishing line.\n\nSmelt the toad’s radiance into mercury within the fire,\nSwiftly boil the sun’s essence into silver within the water.\nThe returning elixir’s precious essence completes its triple cycle,\nWild cranes roam freely while the world’s men toil in vain.\n\nBefore your eyes lies the true realm of Five Peaks’ clouds,\nGather the mysterious pearl and sow the valley’s spirit.\nTemper the sun’s soul to nourish decaying bones,\nSimmer the moon’s essence to gather wandering dust.\n\nWithin the crucible, the Yellow Sprout returns to *ren* and *gui*,\nIn the furnace, White Snow distinguishes *bing* and *yin*.\nThe Four Symbols secretly unite, Dragon and Tiger in awe,\nRiding the waves across the sea to ascend the Celestial Ford.\n\nThe crucible is no mere metal vessel—it is true lead,\nEver profound within the profound, distant and abstruse.\nWhen the mare is gathered, she ascends the Purple Court,\nWhen the ox is released, the sun is stored in the Cinnabar Field.\n\nThe toad’s palace blazes with *Li*’s Dragon Child,\nThe phoenix’s cry resounds with *Dui*’s Tiger Immortal.\nOne must wield the weapons of *jia* and *bing* to deploy water and fire,\nRefining autumn stone to naturally prolong the years.\n\nA decade of surging waves, a single breath’s mechanism—\nFishing for the turtle is no idle moment’s task.\nWithin the gourd, joyous scenes of eternal spring,\nAcross the seas, carefree wonders in this world arise.\n\nRefined provisions of brocade-scaled fish and rice,\nA flask of golden liquid congeals like solid fat.\nThrough life, untangled by right or wrong,\nMy clarity stands distinct for all the cosmos to know.\n\nAmidst chaotic peaks, five-colored clouds arise,\nConcealing the cinnabar’s most revered name.\nJust witness the crucible’s workings of creation,\nThe Patriarch’s furnace clearly severs all ties.\n\nHeaven and Earth have seized the Infant’s nature,\nLead and mercury will congeal the Crone’s affection.\nOnce the Dragon-Tiger pill is refined,\nKnow that upon entering the mouth, even spirits will take fright.\n\nAdorned with the moon and stars, clad in feathered robes,\nSuch adepts have rarely glimpsed the realm of *Xiyi*.\nMercury arises within lead—how would lead know?\nThe Dao resides in man, yet man remains unaware.\n\nIn the fleeting light of time, days pass in vain,\nIn the desolate gate and courtyard, how can one seek a master?\nPrepare the golden crucible to smelt Dragon and Tiger,\nConsume it, and youthful complexion will permeate to the bone.\n\nBefore an ancient peak’s stream and stones,\nFour seasons of blossoms bloom in another realm.\nSun and moon cast their radiance upon the golden crucible,\nDragon and Tiger roar beside the jade furnace’s gleam.\n\nWithin the casket, the sword of stars is forged,\nIn the satchel, brocade verses are refined.\nSevering the yin maggots to purify the cosmos,\nNaturally, one regains youth and extends years.\n\nThe ninefold cyclical Returned Elixir takes three years,\nRequiring the Golden Duke to bind mercury and lead.\nThe Crone dissolves her palace to face the Purple Gate,\nThe Infant grasps firm, circulating the Elixir Field.\n\nThe Mysterious Pearl is gathered as heaven and earth grow still,\nThe flowing essence is reclaimed to solidify the universe.\nTo know the root-matter of longevity,\nKnow that the root of longevity lies within man.\n\nMen of the world fail to grasp the quest for longevity,\nWandering mountains in vain, seeking quietude.\nWho awakens to the need for elixir refinement?\nOnly through accruing yin virtue is it made clear.\n\nThe Flowery Pond nurtures the effortless substance,\nWater and fire refine the elusive essence.\nSwallowing the Dragon-Tiger treasure from the pot,\nThe form’s substance must be nourished to ensure enduring glory.\n\nTo cultivate the Dao, one must clarify yin and yang,\nIn the gates of yin and yang, all who perceive prosper.\nKnow the Dragon’s abode in the Eastern Sea,\nThe Tiger’s domain in the Western Mountains holds its own direction.\n\nWithin the Eight Trigrams crucible, add water and fire,\nIn the Three Powers furnace, layer blue and yellow.\nThe Returned Elixir is completed in due time,\nThen withdraw to the divine capital, freely raising cups.\n\nAmidst the cosmos, wild cranes and solitary clouds,\nA pot of numinous medicine, a single adornment.\nIn the satchel, transcribing the *Three Clarities’ Records*,\nIn the sleeve, the hidden dragon-sword slays demons.\n\nFor a decade, delving deeply into scrolls,\nAt six intervals, thirstily drinking wine by the gallon.\nRoaming north and south, east and west,\nFew share this resonance when encountered.\n\nIn the solitude of profound stillness, one harmonizes with the *Xiyi*,\nAll seas and mountains become as one.\nFirst, restrain the mad monkey,\nThen, corral the wild horse.\n\nWhen white snow arises, distinguish the mercury’s form,\nYellow sprouts grow in harmony with the true wind.\nAfter three years of pure yang in the Returned Elixir,\nRide the crane, carefree, across the eastern sea.\n\nMen of the world do not recognize lead’s blossom,\nThe crimson snow, Azure Dragon, and White Tiger’s domain.\nOne must borrow essence and soul, harmonize spirit and vigor,\nRefining the primordial liquid into divine cinnabar.\n\nIn the Li Palace, fire flourishes, gold births treasure,\nAt the Kan Gate, the sound of springs yields mercury’s sprouts.\nIngesting it, the cycle of years extends,\nThe body radiates light, wreathed in auspicious clouds.\n\nThe five flavors return as the supreme essence,\nInfant and Elder Sister, Crone and Youth forget emotion.\nFrom yin emerges the pure yang substance,\nWithin fire, the Supreme Simplicity is forged.\n\nMalevolent qi scatters into a thousand scenes,\nThe primordial spirit is gathered into a singular name.\nUpon reaching the pot, swallow the Li Dragon’s child,\nReverse aging, refine the visage, and bones grow clear.\n\nSeizing the golden rainbow, snatching the pearl,\nAlive, it is swallowed—sweet as cream.\nThe divine sword flies as the Black Dragon flees the sun,\nIron talismans quell sea monsters in their flight.\n\nWhite snow revives the soul, filling the jade coffer,\nYellow sprouts’ precious essence ignites the red furnace.\nThe Flowery Pond irrigates the numinous tortoise’s triumph,\nAll phenomena converge within the crucible-pot.\n\nOne thing divides into myriad forms,\nWith steadfast resolve, cultivation is not arduous.\nSimply blend jade water with lead and mercury,\nRely on golden radiance to descend the fire elixir.\n\nThe medicine penetrates the Three Passes, hastening to the Kan Gate,\nThe spirit clears the Six Viscera, guarding the Mud Pill.\nBurning incense, upholding precepts in reverence,\nTrue immortals will descend upon the sacred altar.\n\nThe Supreme Dao is clear, its affairs unburdened,\nIn its simplicity, how could it be difficult?\nThe Dragon hides within the two-eight gate,\nThe Tiger rests within the three-five number.\n\nLead and mercury harmonize as the Azure Phoenix’s marrow,\nRaven and toad pair with purple coral’s teeth.\nThe maiden of the south can gather it in her palm,\nBringing it back to craft the Great Elixir.\n\nThe upper and lower mysteries hold celestial secrets,\nThe Great Dao requires clarity of the three-five-one.\nAfter winter, yang stirs within the Qian trigram,\nAt the spring equinox, the Kun hexagram’s lines complete.\n\nThe Dragon divides metal and water, slaying geng and xin,\nAt the summer solstice, fire and wood follow jia and yi.\nThe secret of the Returned Elixir is subtler still,\nNaturally, the heart roams free and at ease.\n\nRefining the elixir, discern yin and yang with care,\nWithin one pot, two things prosper.\nWhen identifying the medicine, clarify the crucible,\nOn the day of practice, select the furnace’s direction.\n\nThe Three Powers triumph as heaven and earth’s sovereign,\nThe Four Symbols submit to the king of sky and land.\nConsuming the Dragon’s essence and Tiger’s mercury,\nNaturally, one claims dominion in the immortal realm.\n\nThe crow and hare gallop beneath the Jade Void,\nThe River Chariot transports it toward the jade pot.\nRefining the elixir requires the Three Powers’ crucible,\nNurturing the medicine demands the Four Symbols’ furnace.\n\nLead and mercury are refined into flowing liquid,\nDragon and Tiger are tempered into descending true cream.\nOnce, the Yellow Emperor ascended the azure clouds,\nLeaving traces for the resolute man to follow.\n\n*The Supreme Perfected’s Dragon-Tiger Great Elixir Poems* conclude.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "至真子龙虎大丹诗 经名：至真子龙虎大丹诗。 北宋周方撰。 一卷。 底本出处：《正统道藏》洞真部方法类。 至真子龙虎大丹诗序 宣德郎权发遣提举淮南西路学事借徘鱼袋卢天造 少室山隐居布衣周方，字归一，道号至真子。 方常览仙经，每穷虚旨，探登真之门户，详炼气之枢机，欲身契虚无，乃心忘尘境。 纵游诸郡，多历名山，京洛之间，或逢高士，亲承传付便话幽微，判玉水之根元，割金丹之宗祖。 指水虎火龙之妙用，诀土金火水之玄机，明乾坤反覆之宜，晓昼夜循环之候。 方闻倾心踊跃，注意惧听，乃卜名山，择真胜地。 乾坤为鼎，天地为炉，坎离为至药之宗，铅汞作大丹之体。 须凭四象又按三才，法戊己成其真形，驾河车运为正质。 发则阴阳交媾，胜则日月盘旋。 虎啸则玉磬炉前，龙吟则金华鼎内，水火结伏，龙虎相乘，刻漏无差，金丹成矣。 淮王遇而炼秋石，服之拔宅升天； 轩皇得而探金华，餐毕跨龙登汉。 此丹非金石之类、草木之名，非三峰少女之方，非百数吸精之术。 已上皆是不遇明师，或得汞而不得铅，或明水而不明火。 故云孤阳不产，寡阴不生。 且如母之孕儿，鹦之抱卵。 若逢师指，得遇丹方，功成而名列上清，行满而身游紫府。 今乃略伸拙意，用剖真机，聊述宏纲，用传同好。 天圣四年丙寅岁九月九日序。 至真子龙虎大丹诗 铅中有汞号黄芽，时辈凡流莫馒夸。 解把虎龙调鼎鼎，能师日月运河车。 安排炉鳌飞金液，造化乾坤炼玉华。 上法岂同蝉蜕去，逍遥自是玉皇家。 弃却闲昤罢读书，持心一志采玄珠。 乾坤鼎裹炼三汞，日月炉中烹五符。 解聚世情多遍历，能生枯骨下真躯。 行功速彻刀圭力，跨虎乘龙上玉都。 认得根宗悟得坤，束西南北自为邻。 离宫隐奥九还药，坎裹深藏七返银。 白雪降时分甲乙，黄芽产日定庚辛。 金丹火候三年满，且泛束都万万春。 金乌玉兔路无差，三女三男本一家。 意马又随红仅艳，心猿常泛白榆花。 曾朝王母杯琼液，只候丁公破玉瓜。 八百绿中同会去，千朝丹伏倚烟霞。 十载区区历世机，就中此道少人知。 鹏搏瞑海非无日，龙跃丹砂自有时。 袖隐金锤除五虎，匣藏宝剑杀三尸。 雷车一震乾坤静，夺得明珠在坎离。 移山覆海用神炉，化剑为龙吼鉴湖。 雷震一声除魍魉，电飞千里杀阴蛆。 乾坤已夺无为宝，离坎新添造化珠。 金骨点成铅汞力，双鸾直引至蓬壶。 去谒神仙叩洞门，嫦娥帐裹抱龙孙，金花朱日连根取，鼎炼铅霜造化尊。 制伏虎龙为事业，岂拘乌兔走朝昏。 大终甲子循环满，必驾河车渡海村。 采摘铅华配甲庚，日魂月魄定亏盈。 三才鼎裹攻金笑，万象炉中炼石精。 野马收归龙虎惧，颠猿伏得鬼神惊。 天门开处灵光至，远了星河豁地明。 吕家曾与我真铅，只向玄中悟得玄。 赤马捉归金谷内，青牛赶放玉溪前。 星烟夜裹追符使，云洞朝来发剑仙。 除剪业虹期此日，沧波回去棹征船。 大丹一诀自先生，白简黄衣奏赤城。 金鼎炼时封子号，玉炉烹日系仙名。 神砂伏火华光罩，灵汞飞凝彩气清。 魂魄养成经九转，壶中豁落透申明。 卓剑安炉炼日华，水中真水号流霞。 离宫有径青龙室，坎户无门白虎家。 节候恣情收白雪，向前选日采黄芽。 玉壶倒尽天庭液，换骨通灵一粒砂。",
      "translated_text": "**Preface to *The Supreme Perfection’s Dragon-Tiger Great Elixir Poems***\n\nBy Lu Tianzao, *Xuan De* Gentleman, Acting Commissioner of Education for Huainan West Circuit, granted the fish-shaped tally of office\n\nZhou Fang of Shaoshi Mountain, a recluse in common robes, styled himself *Guiyi* (\"Returning to Oneness\") and took the Daoist name *Zhizhenzi* (\"Supreme Perfection Master\"). He often perused the scriptures of immortals, delving into the subtleties of emptiness, exploring the gateways to transcendence, and mastering the pivotal mechanisms of *qi*-refinement. His aspiration was to unite his body with the Void, his heart forgetting the dusty world.\n\nRoaming through various commanderies and traversing many famous mountains, in the regions between the capital and Luoyang, he sometimes encountered lofty adepts. From them, he received transmissions of esoteric teachings, discerning the root and origin of \"jade water\" and tracing the lineage of the Golden Elixir. He grasped the wondrous functions of the Water Tiger and Fire Dragon, the mysteries of Earth, Metal, Fire, and Water, the proper inversion of Heaven and Earth, and the cyclic signs of day and night.\n\nZhou Fang listened with rapt attention, his heart stirred and his focus unwavering. Thus, he chose a sacred mountain and selected a true and sublime site. Heaven and Earth became his crucible, the cosmos his furnace; *Kan* (Water) and *Li* (Fire) were the essence of the supreme medicine, while lead and mercury formed the substance of the Great Elixir. Relying on the Four Symbols and aligning with the Three Powers, he followed the *wu-ji* (Earth) to perfect its true form and harnessed the River Chariot to refine its essential nature.\n\nWhen activated, Yin and Yang conjoined; when perfected, the Sun and Moon revolved. The Tiger’s roar resounded before the jade chime furnace, the Dragon’s cry echoed within the golden radiance crucible. Water and Fire coalesced, Dragon and Tiger intermingled, and with flawless timing, the Golden Elixir was achieved.\n\nThe Prince of Huai encountered this method and refined \"autumn stone,\" consuming it to ascend with his entire household to heaven. The Yellow Emperor obtained it and delved into the Golden Radiance, riding a dragon to the Han after his repast. This Elixir is neither a mineral nor a herb, nor the techniques of the Three Peaks’ maidens, nor the arts of absorbing essence through countless breaths.\n\nAll the above are the results of failing to meet a true master—some obtain mercury but not lead, or comprehend Water but not Fire. Thus it is said: a solitary Yang does not generate, a lone Yin does not give birth. It is like a mother gestating a child or a parrot incubating an egg. If one meets a master’s guidance and obtains the Elixir formula, the work is accomplished, and one’s name is listed among the Upper Clarity; when merit is fulfilled, the body roams the Purple Palace.\n\nNow, I roughly express my humble thoughts to reveal the true mechanism, briefly outlining the grand principles to transmit to like-minded seekers.\n\nWritten on the ninth day of the ninth month in the *bingyin* year of the Tiansheng era (1026).\n\n---\n\n**The Supreme Perfection’s Dragon-Tiger Great Elixir Poems**\n\nWithin lead lies mercury, called the Yellow Sprout—\nLet no common fool boast idly of its worth.\nMaster the Dragon and Tiger to harmonize the crucible,\nAnd emulate the Sun and Moon to move the River Chariot.\n\nArrange the furnace and tripod to fly the golden liquid,\nTransforming Heaven and Earth to refine jade radiance.\nThis method is not like the cicada’s molting—\nFreely you shall dwell in the Jade Emperor’s realm.\n\nDiscard idle songs and cease reading books,\nHold fast to a single intent to gather the Mystic Pearl.\nWithin the Heaven-Earth crucible, refine the Three Mercuries,\nIn the Sun-Moon furnace, simmer the Five Talismans.\n\nHaving traversed worldly affairs in full measure,\nYou can revive withered bones into a true body.\nSwiftly complete the work with the *daogui*’s power,\nRide the Tiger and mount the Dragon to ascend to the Jade Capital.\n\nRecognize the root and comprehend *Kun* (Earth),\nThen east, west, south, and north become your neighbors.\nIn *Li*’s palace lies the hidden Nine-Return Elixir,\nWithin *Kan* is deeply stored the Seven-Rebirth Silver.\n\nWhen White Snow descends, distinguish *jia* and *yi*,\nOn the day the Yellow Sprout is born, fix *geng* and *xin*.\nWhen the Golden Elixir’s firing time is complete after three years,\nYou may float eastward for ten thousand springs.\n\nThe Golden Crow and Jade Hare follow an unerring path,\nThe Three Maidens and Three Boys are originally one family.\nThe Steed of Intent chases crimson splendor,\nThe Monkey of the Heart often drifts on white elm blossoms.\n\nOnce you attended the Queen Mother’s cup of jade liquid,\nNow await Master Ding to split the jade melon.\nIn the eight hundred *lü* of green, we shall meet,\nAfter a thousand mornings of elixir refinement, leaning on mist and clouds.\n\nFor ten years, I toiled through worldly mechanisms,\nYet few know this Way within.\nThe roc’s strike into the dark sea is not without its day,\nThe dragon’s leap from cinnabar will come in time.\n\nSleeves conceal the golden hammer to subdue the Five Tigers,\nThe casket hides the precious sword to slay the Three Corpses.\nWith a single thunderous chariot’s shock, Heaven and Earth grow still—\nSeizing the luminous pearl within *Kan* and *Li*.\n\nMove mountains and overturn seas with the divine furnace,\nTransform the sword into a dragon roaring over Mirror Lake.\nA single thunderclap dispels demons,\nA thousand leagues of lightning slays yin maggots.\n\nHeaven and Earth have seized the Treasure of Non-Action,\n*Li* and *Kan* newly bestow the Pearl of Creation.\nThe Golden Bones are transmuted by lead and mercury’s power,\nA pair of simurghs leads straight to Penglai.\n\nI go to pay homage to the immortals, knocking at the grotto gate,\nIn Chang’e’s tent, embracing the Dragon’s heir.\nPluck the golden flower and the vermilion sun by their roots,\nIn the crucible, refine lead frost into the honored vessel of creation.\n\nSubduing Dragon and Tiger is the true endeavor—\nWhy be bound by the crow and hare’s morning and dusk?\nWhen the great cycle of *jiazi* completes its revolution,\nYou must ride the River Chariot to cross the sea village.\n\nGather lead’s radiance to match *jia* and *geng*,\nThe Sun’s soul and Moon’s spirit determine waxing and waning.\nWithin the Three Powers’ crucible, attack the golden laughter,\nIn the Ten Thousand Images’ furnace, refine the stone essence.\n\nThe Wild Horse is reined in, Dragon and Tiger cower,\nThe Mad Monkey is tamed, ghosts and spirits tremble.\nWhen the Gate of Heaven opens, the numinous light arrives—\nThe distant Milky Way clears, and the earth grows bright.\n\nThe Lü family once shared with me true lead,\nOnly in the Mysterious did I comprehend the Mysterious.\nThe Red Horse is captured within the Golden Valley,\nThe Blue Ox is driven before the Jade Stream.\n\nIn the night’s starry haze, I pursue the talisman envoy,\nAt dawn in the cloudy grotto, I dispatch the sword immortal.\nToday, I sever the karma rainbow,\nAnd turn the oars to sail the boat home across the blue waves.\n\nThe Great Elixir’s single secret originates from the master,\nIn white memorials and yellow robes, I petition the Red City.\nWhen refining in the golden crucible, I seal the child’s name,\nWhen simmering in the jade furnace, I bind the immortal’s title.\n\nDivine cinnabar subdues fire, enveloped in radiant light,\nSpiritual mercury flies and congeals, its aura pure and clear.\nAfter nurturing soul and spirit through nine revolutions,\nWithin the gourd, all is revealed, penetrating *shenming*.\n\nErect the sword and stabilize the furnace to refine solar radiance,\nThe true water within water is called Flowing Rosy Clouds.\nIn *Li*’s palace lies a path to the Green Dragon’s chamber,\n*Kan*’s gate has no door to the White Tiger’s home.\n\nFreely gather White Snow according to the seasons,\nAdvance to select the day to harvest the Yellow Sprout.\nInvert the jade flask to drain the celestial liquid,\nExchange bones for spirit with a single grain of sand.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1296,
      "start_sentence": 0,
      "end_sentence": 68,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 49.99841237068176,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\至真子龙虎大丹诗.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "白金变紫最殊功，解点衰颜反幼童。 灵液到壶藏坎户，神丹开鼎透离宫。 依稀已达仙家景，髻髭将游闻苑风。 炼经千日开炉看，万象都钻一鼎中。 苦把行藏说与君，悟时须是解须真。 莫教浪扑倾舟棹，窃忌风高举钓纶。 锻炼蟾光火内汞，速烹日景水中银。 还丹宝质三周满，野鹤逍遥板苑人。 眼前真境五峰云，解采玄珠种谷神。 锻炼日魂滋朽骨，煎烹月魄聚游尘。 黄芽鼎内归壬癸，白雪炉中判丙寅。 四象暗交龙虎惧，乘搓泛海上天津。 鼎非金鼎是真铅，只向玄中远又玄。 牝马收时朝紫府，乾牛放日贮丹田。 蟾宫赫奕离龙子，呜凤威晖兑虎仙。 须藉甲兵施水火，炼成秋石自延年。 十载洪波一息机，钓鳖非是等闲时。 壶中快乐长春景，海内逍遥在世奇。 修僎锦鳞餐稻饭，瓶斟金液自凝脂。 平生不挂是非事，表我分明宇宙知。 乱峰深处五云生，裹隐丹砂最许名。 正见鼎中施造化，祖师炉内断分明。 乾坤已夺婴儿性，铅汞将凝姥女情。 炼就一丸龙虎药，定知入口鬼神惊。 戴月簪星着羽衣，此流应未见希夷。 汞生铅裹铅何识，道在人中人不知。 恍惚光阴虚过日，寂寥门户岂寻师。 安排金鼎烹龙虎。 服了童颜彻骨滋。 一溪泉石古峰前，四季花开别洞天。 日月流晖金鼎上，虎龙昤啸玉炉边。",
      "translated_text": "White gold transmutes to purple, its merit most sublime,\nDissolving aged countenance to restore youthful prime.\nThe numinous elixir reaches the gourd, stored in *Kan*’s gate,\nDivine cinnabar opens the crucible, piercing *Li*’s palace bright.\n\nDimly one has attained the immortal’s realm,\nWith topknot and beard, soon to wander the winds of Penglai’s garden.\nAfter refining for a thousand days, open the furnace to see—\nMyriad forms all emerge from a single crucible’s gleam.\n\nI bitterly recount these deeds to you in earnest:\nWhen awakened, one must truly comprehend.\nDo not recklessly capsize the boat’s oar,\nNor fear the high winds when casting the fishing line.\n\nSmelt the toad’s radiance into mercury within the fire,\nSwiftly boil the sun’s essence into silver within the water.\nThe returning elixir’s precious essence completes its triple cycle,\nWild cranes roam freely while the world’s men toil in vain.\n\nBefore your eyes lies the true realm of Five Peaks’ clouds,\nGather the mysterious pearl and sow the valley’s spirit.\nTemper the sun’s soul to nourish decaying bones,\nSimmer the moon’s essence to gather wandering dust.\n\nWithin the crucible, the Yellow Sprout returns to *ren* and *gui*,\nIn the furnace, White Snow distinguishes *bing* and *yin*.\nThe Four Symbols secretly unite, Dragon and Tiger in awe,\nRiding the waves across the sea to ascend the Celestial Ford.\n\nThe crucible is no mere metal vessel—it is true lead,\nEver profound within the profound, distant and abstruse.\nWhen the mare is gathered, she ascends the Purple Court,\nWhen the ox is released, the sun is stored in the Cinnabar Field.\n\nThe toad’s palace blazes with *Li*’s Dragon Child,\nThe phoenix’s cry resounds with *Dui*’s Tiger Immortal.\nOne must wield the weapons of *jia* and *bing* to deploy water and fire,\nRefining autumn stone to naturally prolong the years.\n\nA decade of surging waves, a single breath’s mechanism—\nFishing for the turtle is no idle moment’s task.\nWithin the gourd, joyous scenes of eternal spring,\nAcross the seas, carefree wonders in this world arise.\n\nRefined provisions of brocade-scaled fish and rice,\nA flask of golden liquid congeals like solid fat.\nThrough life, untangled by right or wrong,\nMy clarity stands distinct for all the cosmos to know.\n\nAmidst chaotic peaks, five-colored clouds arise,\nConcealing the cinnabar’s most revered name.\nJust witness the crucible’s workings of creation,\nThe Patriarch’s furnace clearly severs all ties.\n\nHeaven and Earth have seized the Infant’s nature,\nLead and mercury will congeal the Crone’s affection.\nOnce the Dragon-Tiger pill is refined,\nKnow that upon entering the mouth, even spirits will take fright.\n\nAdorned with the moon and stars, clad in feathered robes,\nSuch adepts have rarely glimpsed the realm of *Xiyi*.\nMercury arises within lead—how would lead know?\nThe Dao resides in man, yet man remains unaware.\n\nIn the fleeting light of time, days pass in vain,\nIn the desolate gate and courtyard, how can one seek a master?\nPrepare the golden crucible to smelt Dragon and Tiger,\nConsume it, and youthful complexion will permeate to the bone.\n\nBefore an ancient peak’s stream and stones,\nFour seasons of blossoms bloom in another realm.\nSun and moon cast their radiance upon the golden crucible,\nDragon and Tiger roar beside the jade furnace’s gleam.",
      "overlap_context": "rd, all is revealed, penetrating *shenming*.\n\nErect the sword and stabilize the furnace to refine solar radiance,\nThe true water within water is called Flowing Rosy Clouds.\nIn *Li*’s palace lies a path to the Green Dragon’s chamber,\n*Kan*’s gate has no door to the White Tiger’s home.\n\nFreely gather White Snow according to the seasons,\nAdvance to select the day to harvest the Yellow Sprout.\nInvert the jade flask to drain the celestial liquid,\nExchange bones for spirit with a single grain of sand.",
      "start_char": 1297,
      "end_char": 1821,
      "start_sentence": 69,
      "end_sentence": 99,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.865015983581543,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\至真子龙虎大丹诗.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "匣中炼就星辰剑，囊裹修成锦绣篇。 斩绝阴蛆清宇宙，自然返老得延年。 还丹九转是三年，须藉金公结汞铅。 姥女销宫朝紫户，婴儿握固运丹田。 玄珠采得乾坤静，流液收归宇宙坚。 要识长生根祖事，长生根祖在人边。 世人不解觅长生，馒去寻山静处行。 须修丹药谁惺悟，藉施阴德甚分明。 华池养就无为物，水火烹成恍惚精。 吞却龙虎壶中宝，须滋形质定常荣。 修道须明阴与阳，阴阳门户见皆昌。 龙生束海须知位，虎在西山自有方。 八卦鼎中添水火，三才炉内覆青黄。 还丹克日工夫就，遁迹神都且泛觞。 野鹤孤云宇宙中，一壶灵药一条饰。 囊中传写三清录，袖裹诛妖隐剑龙。 十载精穷书卷卷，六时渴饮酒千锺。 自行南北束西路，少有同声向此逢。 一契希夷寂寞中，海山群岳总相同。 直须只把颠猿制，更且收将野马笼。 白雪产时分汞象，黄芽生自和真风。 还丹三载纯阳后，跨鹤逍遥过海束。 世人不会识铅花，绛雪青龙白虎家。 须假精魂和气魄，炼成元液变神砂。 离宫火盛金生宝，坎户泉声汞产芽。 服饵主周延甲子，满身光透庆云霞。 五味还来号至精，婴兄姥女自忘情。 阴中产就纯阳物，火内烧成太易卿。 妖气散为千景象，元神收得一般名。 到壶吞却离龙子，返老移颜骨格清。 捉得金虹夺得珠，活吞入口美如酥。 骊龙走日飞神剑，海怪奔时镇铁符。 白雪返魂填玉柜，黄芽宝质发红炉。 华池浇灌灵龟胜，万象齐钻在鼎壶。 一物分形几万般，坚心修整不为难。 但将玉水和铅汞，须藉金华下火丹。 药透三关趋坎户，神清六腑镇泥丸。 烧香奉戒虔恭处，自有真仙降宝坛。 至道分明事不烦，淡然一味岂艰难。 龙居二八门中隐，虎在三五数内安。 铅汞合和青凤髓，乌蟾匹配紫琅牙。 南方女子能收掌，采得归来作大丹。 上玄下玄天机密，大道须明三五一。 冬后阳生乾卦中，立春仲遇坤爻毕。 龙分金水杀庚辛，夏至火林从甲乙。 诀得还丹妙更微，自然放荡心舒逸。 炼丹子细辨阴阳，一个壶中二物昌。 识药之时明鼎器，下功至日选炉方。 三才得胜乾坤主，四象归从天地王。 服却龙精和虎汞，自然有位霸仙乡。 乌兔奔腾下玉虚，河车般运向琼壶。 炼丹须按三才鼎，养药令安四象炉。 铅汞烹为流液质，虎龙锻作降真酥。 轩皇昔日青云路，留得踪由许丈夫。 至真子龙虎大丹诗竟",
      "translated_text": "Within the casket, the sword of stars is forged,\nIn the satchel, brocade verses are refined.\nSevering the yin maggots to purify the cosmos,\nNaturally, one regains youth and extends years.\n\nThe ninefold cyclical Returned Elixir takes three years,\nRequiring the Golden Duke to bind mercury and lead.\nThe Crone dissolves her palace to face the Purple Gate,\nThe Infant grasps firm, circulating the Elixir Field.\n\nThe Mysterious Pearl is gathered as heaven and earth grow still,\nThe flowing essence is reclaimed to solidify the universe.\nTo know the root-matter of longevity,\nKnow that the root of longevity lies within man.\n\nMen of the world fail to grasp the quest for longevity,\nWandering mountains in vain, seeking quietude.\nWho awakens to the need for elixir refinement?\nOnly through accruing yin virtue is it made clear.\n\nThe Flowery Pond nurtures the effortless substance,\nWater and fire refine the elusive essence.\nSwallowing the Dragon-Tiger treasure from the pot,\nThe form’s substance must be nourished to ensure enduring glory.\n\nTo cultivate the Dao, one must clarify yin and yang,\nIn the gates of yin and yang, all who perceive prosper.\nKnow the Dragon’s abode in the Eastern Sea,\nThe Tiger’s domain in the Western Mountains holds its own direction.\n\nWithin the Eight Trigrams crucible, add water and fire,\nIn the Three Powers furnace, layer blue and yellow.\nThe Returned Elixir is completed in due time,\nThen withdraw to the divine capital, freely raising cups.\n\nAmidst the cosmos, wild cranes and solitary clouds,\nA pot of numinous medicine, a single adornment.\nIn the satchel, transcribing the *Three Clarities’ Records*,\nIn the sleeve, the hidden dragon-sword slays demons.\n\nFor a decade, delving deeply into scrolls,\nAt six intervals, thirstily drinking wine by the gallon.\nRoaming north and south, east and west,\nFew share this resonance when encountered.\n\nIn the solitude of profound stillness, one harmonizes with the *Xiyi*,\nAll seas and mountains become as one.\nFirst, restrain the mad monkey,\nThen, corral the wild horse.\n\nWhen white snow arises, distinguish the mercury’s form,\nYellow sprouts grow in harmony with the true wind.\nAfter three years of pure yang in the Returned Elixir,\nRide the crane, carefree, across the eastern sea.\n\nMen of the world do not recognize lead’s blossom,\nThe crimson snow, Azure Dragon, and White Tiger’s domain.\nOne must borrow essence and soul, harmonize spirit and vigor,\nRefining the primordial liquid into divine cinnabar.\n\nIn the Li Palace, fire flourishes, gold births treasure,\nAt the Kan Gate, the sound of springs yields mercury’s sprouts.\nIngesting it, the cycle of years extends,\nThe body radiates light, wreathed in auspicious clouds.\n\nThe five flavors return as the supreme essence,\nInfant and Elder Sister, Crone and Youth forget emotion.\nFrom yin emerges the pure yang substance,\nWithin fire, the Supreme Simplicity is forged.\n\nMalevolent qi scatters into a thousand scenes,\nThe primordial spirit is gathered into a singular name.\nUpon reaching the pot, swallow the Li Dragon’s child,\nReverse aging, refine the visage, and bones grow clear.\n\nSeizing the golden rainbow, snatching the pearl,\nAlive, it is swallowed—sweet as cream.\nThe divine sword flies as the Black Dragon flees the sun,\nIron talismans quell sea monsters in their flight.\n\nWhite snow revives the soul, filling the jade coffer,\nYellow sprouts’ precious essence ignites the red furnace.\nThe Flowery Pond irrigates the numinous tortoise’s triumph,\nAll phenomena converge within the crucible-pot.\n\nOne thing divides into myriad forms,\nWith steadfast resolve, cultivation is not arduous.\nSimply blend jade water with lead and mercury,\nRely on golden radiance to descend the fire elixir.\n\nThe medicine penetrates the Three Passes, hastening to the Kan Gate,\nThe spirit clears the Six Viscera, guarding the Mud Pill.\nBurning incense, upholding precepts in reverence,\nTrue immortals will descend upon the sacred altar.\n\nThe Supreme Dao is clear, its affairs unburdened,\nIn its simplicity, how could it be difficult?\nThe Dragon hides within the two-eight gate,\nThe Tiger rests within the three-five number.\n\nLead and mercury harmonize as the Azure Phoenix’s marrow,\nRaven and toad pair with purple coral’s teeth.\nThe maiden of the south can gather it in her palm,\nBringing it back to craft the Great Elixir.\n\nThe upper and lower mysteries hold celestial secrets,\nThe Great Dao requires clarity of the three-five-one.\nAfter winter, yang stirs within the Qian trigram,\nAt the spring equinox, the Kun hexagram’s lines complete.\n\nThe Dragon divides metal and water, slaying geng and xin,\nAt the summer solstice, fire and wood follow jia and yi.\nThe secret of the Returned Elixir is subtler still,\nNaturally, the heart roams free and at ease.\n\nRefining the elixir, discern yin and yang with care,\nWithin one pot, two things prosper.\nWhen identifying the medicine, clarify the crucible,\nOn the day of practice, select the furnace’s direction.\n\nThe Three Powers triumph as heaven and earth’s sovereign,\nThe Four Symbols submit to the king of sky and land.\nConsuming the Dragon’s essence and Tiger’s mercury,\nNaturally, one claims dominion in the immortal realm.\n\nThe crow and hare gallop beneath the Jade Void,\nThe River Chariot transports it toward the jade pot.\nRefining the elixir requires the Three Powers’ crucible,\nNurturing the medicine demands the Four Symbols’ furnace.\n\nLead and mercury are refined into flowing liquid,\nDragon and Tiger are tempered into descending true cream.\nOnce, the Yellow Emperor ascended the azure clouds,\nLeaving traces for the resolute man to follow.\n\n*The Supreme Perfected’s Dragon-Tiger Great Elixir Poems* conclude.",
      "overlap_context": " lead know?\nThe Dao resides in man, yet man remains unaware.\n\nIn the fleeting light of time, days pass in vain,\nIn the desolate gate and courtyard, how can one seek a master?\nPrepare the golden crucible to smelt Dragon and Tiger,\nConsume it, and youthful complexion will permeate to the bone.\n\nBefore an ancient peak’s stream and stones,\nFour seasons of blossoms bloom in another realm.\nSun and moon cast their radiance upon the golden crucible,\nDragon and Tiger roar beside the jade furnace’s gleam.",
      "start_char": 1822,
      "end_char": 2779,
      "start_sentence": 100,
      "end_sentence": 154,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.85549712181091,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\至真子龙虎大丹诗.txt",
        "category": "方法类"
      }
    }
  ]
}