{
  "source_id": "萃善录",
  "source_file": "chunked_daozang\\萃善录.json",
  "total_chunks": 16,
  "total_original_chars": 16626,
  "total_translated_chars": 111239,
  "total_translation_time": 613.6874091625214,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\表奏类\\萃善录.txt",
    "category": "表奏类"
  },
  "full_translation": "**Collected Auspicious Records**\n*Sutra Title:* *Collected Auspicious Records*. Author unknown, approximately dating to the Ming dynasty. Two scrolls.\n*Source of Base Text:* *Daoist Canon of the Zhengtong Era*, *Comprehensive Section*, *Memorials and Memorial Presentations*.\n\n---\n\n### **Collected Auspicious Records, Scroll One**\n\n#### **Prayer for the Sovereign’s Birthday**\nThe Sage is born—auspicious lightning flashes from the purple pivot of the North Star;\nThe August Lord descends upon you—joyous clouds part along the Yellow Dao.\nWith reverent solemnity, we present our words; at dawn’s first light, we make our plea.\n\nWe humbly recall that the ancestral seal has been newly transmitted, and we have journeyed afar to behold the imperial court. Fragrant incense was bestowed upon the Dragon-Tiger Altar, where we received the Supreme Decree in person. Yet in the Hall of the Qilin, where we would offer birthday felicitations, we have not yet turned our carriage southward. Thus, we command the masters of the Mystery to perform the purification rites, that we may face Your August Countenance and return due praise.\n\nWe devoutly pray that the green missive may ascend by night, summoning the immortal host from the Pure Capital; that the vermilion palace may bask in vernal warmth, and Your Majesty’s great foundation of blessings endure forever.\n\n#### **Prayer for Rain**\nThe earth is spread as an altar, and the soil becomes jade;\nGazing at the clouds, we beseech the mandate of Heaven, and it rains pearls.\nLife’s vitality is swiftly restored, yet the Primal Work claims no credit.\n\nWe humbly recall that since we took the name of the Dao, we have awaited the farmer’s fullness. In all our labors, from dawn’s toil to dusk’s rest, we have cherished the hope of spring planting and autumn harvest. Yet this year, severe drought has struck, unlike times past. From the suburban altars to the ancestral temples, we have prayed long; would that the seedlings might flourish by morning or evening! But the people, burdened by grain transport, grow weary. Should famine descend, how shall the year be sustained? Though the divine response was not distant, frost and mist arose instead. We return the numinous waters to pacify the spirits, and offer libations to repay the root.\n\nWe devoutly pray that Your bounty may be bestowed in full, preserving these years of plenty. From the third day onward, let the rains become a deluge, their beneficent waves spreading ever wider. May no one fail to receive its grace, and all alike return to the land of joy.\n\n#### **Prayer for the Celestial Master’s Return from the Capital to the Mountain**\nThe Sovereign’s command brooks no delay in departure;\nYet we are barred from gazing upon the limpid light, though it lies but a footstep away.\nAugust Heaven shows no partiality, its wondrous workings unfolding in both inquiries of the Mystery.\n\nWith reverence, we seal incense in the imperial capital and return to present our memorial at the ancestral altar. We humbly recall that our blessings derive from hereditary endowment, and we have presumptuously inherited the ancestral seal. Yet our words and deeds are fraught with remorse, and we have often transgressed the teachings. Family misfortune and fate’s perversity have brought repeated calamities. Fortunate to live in an era of dragon-soaring governance, we have been summoned to court by post-horse relay. Who would have thought that a minor recovery would stretch into half a year’s confinement? Longing for the imperial favor of an audience, we have strictly observed the purification rites of the Numinous Treasure, seeking to repent our faults and dispel disaster, to pray for grace and beseech the mandate.\n\nWe devoutly pray that the imperial heart may hold us in esteem, and human desires be fulfilled. May it perceive our private repentance and bestow the gift of life’s creation. May the true wind blaze resplendent, deepening the vermilion screen’s favor; may new blessings abound, and the purple-sealed decrees fall like heavy dew. May all who cherish their destiny be encompassed by Your grace and protection.\n\n#### **Prayer of Thanksgiving for the Fire-Averting Rites**\nIn the *gengwu* year, a dream in the spring of the vast heavens:\nBefore the Hall of August Felicity, an apparition appeared. Then, at the Bamboo Pavilion, a soul returned, declaring that its chamber would suffer fire. The Pavilion’s master, moved by long-standing concern, vowed to perform the rites, and peace was restored.\n\nDreams are interpreted as dreams, for ephemeral visions hold no certainty. Yet to doubt is to transmit doubt—how dare we ignore the lessons of the past? In former times, we sought blessings; now, we repay kindness. We humbly recall that if one seeks the preservation of even a single tree, one must fear sleeping upon kindling. The transformations of butterflies are too myriad to fathom, and those who hear of them harbor hidden worries. How much more so the uncertainties of deer and moats, where loss and gain may hinge on chance? Caution is paramount. Thus, on account of these dim and inscrutable omens, we have sought peace and tranquility. The August Lord has shown compassion, and we yearn to repay His favor.\n\nWe devoutly pray that the initial covenant may be fulfilled, and the final grace be granted in harmony. How could we ever forget? May we forever bear the gift of wind and rain’s protective grace. As Heaven commands, may it secretly align with the hearts of our ancestors and the incense fires of our lineage. May virtue spread like spring’s sunlight, and grace bathe the boundless expanse.\n\n#### **Prayer for the Celestial Master’s Rites of Thanksgiving for the Completion of the Canon Hall**\nThe Dao’s mechanism knows no rest, and thus it gazes upon the extraordinary court.\nThe Dharma Treasury is newly completed, truly dependent upon the Mystery’s creation.\nThus, we celebrate with a single rite and beseech the host of perfected beings.\n\nWe humbly recall that we have turned our thoughts inward, examining ourselves and reflecting on our faults. Some arise from past causes bearing present effects; others stem from our own inadequacies, which invite manifold errors. Some grievances of the heart remain unrecognized; some hidden transgressions go uncorrected. Some, by fate’s station, encounter solitary stars; others, in the palace of descendants, turn their backs on auspicious constellations. Such deviations have brought us to this pass—how may we repent and be absolved?\n\nWe declare that the construction of the precious canon is a testament to the efficacy of divine intervention. Moreover, the banners of the perfected stand in solemn array, capable of turning the heavens through their revolutions. Fortunate in human skill’s accomplishment, we aspire to the sagely brilliance that fulfills desires. With solemnity, we present our humble offerings, reverently revealing our sincerity.\n\nWe devoutly pray that Your August Countenance may shine with clemency, and spring’s vitality arise in Your virtue. The workings of creation know no pause, transforming and communicating in the turning of a wheel. The Eight Trigrams congeal the spirit, revealing the six children of Heaven and Earth. The three yang forces burst forth in splendor, reversing adversity and prosperity in a single moment. The mandate is bestowed by Heaven; we await grace this very day.\n\n#### **Wu Weide’s Prayer for His Deceased Mother**\nOn the road as a traveler, the sky seems distant, and the wanderer’s heart races in vain.\nAt home, the clouds linger over the mountain peaks, yet the face of my compassionate mother remains unseen.\nI bow to the Mystery’s teachings and knock at the gates of the Pure Capital.\n\nI humbly recall that my studies in immortality were shallow, and my service to my mother was lacking. I had thought that, like a tumbleweed, I might yet return to repay the joy of beans and water. Who could have foreseen that, like drifting duckweed, I would return only to shed tears upon the *lai* robes? What benefit is there in a single son leaving the household? Yet the ten directions’ deliverance from suffering is no falsehood. As the day of mourning arrives, I humbly initiate this special rite.\n\nWe devoutly pray that pearls may float upon the lion throne, and jade be kneaded into the dragon script. May the carriage return from Penglai, awakening her from the dream of emptiness; may she attend the banquet by the Peach Pool, ascending to the realm of bliss. May her soul and spirit find their way, and her descendants be truly blessed.\n\n#### **Prayer for the Establishment of the Rites for the Nine Dark Realms**\nNo being can foresee the future—grief strikes as a minister is torn away.\nYet this sorrow cannot be stilled, so we beseech the August Lord to grant ascension.\nOur words fail, and our tears of blood flow unceasingly.\n\nWe humbly recall that our father’s frost-white hair came too soon, and the jade-like purity of the swallow—what enmity did it bear? Who would have thought that, though toothless, it harbored such deep venom? A mere injury to the finger has brought immeasurable sorrow.\n\nWould it be that his descendants avoid untimely fate, or is it rather that his own life was bound by destiny? His loyal heart, ever radiant, cannot silence the sorrow of this world; his noble example, vast and enduring, may yet console the hopes of those beneath the Yellow Springs. Though humble water-cress may be offered, the mirror of the gods remains impartial. We humbly beseech the opening of the Gate of Liberation, that the path to the Void be revealed, ancient grievances melt like ice, and no reckless thoughts arise from delusion. May the departed soul ascend like clouds, its essence refined through the fruit of goodness, and may it follow the true Dao, guiding posterity by its virtue.\n\n**Prayer by the Immortal Maiden for Her Parents**\nFather, what shall I rely upon? Mother, whom shall I depend on? Alas, the eternal separation from those to whom I return. Heaven provides the beginning, Earth nurtures life—may the work of creation begin anew. With three bows of dark jade, nine prostrations of utmost sincerity, we beseech.\n\nWe recall that though the youngest daughter has found her place, her parents cannot be redeemed. In gratitude, she offers sacrifices and praises their virtuous teachings, which benefit others; in vigilance, she honors their memory, ashamed of her own meager deeds. Her eyes, like mugwort, shed tears for the times; her heart, like grass, stirs with thoughts of remembrance. The bright water is set forth in full, and the grace of the divine waves is truly relied upon.\n\nWe humbly pray that the Great Potter’s wheel never ceases, that the All-Seeing Mirror shows mercy. May the light of Earth’s Dao and the radiance of Yang revive the withered form of the mother-plant; may the harmony of human destiny and the mysterious unite to fulfill the private longings of the sunflower and bud.\n\n**Annual Prayer for the Establishment of the Rites to Honor the Mother**\nO Mother, who nurtured me—how endless is the pain of parting! The first anniversary of mourning has come, yet the passage of time, swift as a white colt, offers no respite. Clad in mourning white, my grief ascends to the vault of heaven.\n\nWe recall that since suffering the sorrow of Lady Lu’s fate, I have endured the return of the stars to their stations. Contemplating the unfathomable rise and fall of life, I take solace in the rites of deliverance. With reverence, I purify my dwelling and solemnly welcome the divine chariot.\n\nWe humbly pray that clouds part to reveal the Yellow Dao, that winds carry the green petition. May the decree summon the Three Realms to carefree wandering, and the myriad immortals descend in attendance. May her compassionate light reach far, illuminating the sincerity of my observance; may the dawn of tomorrow’s audience leave no childish plea unanswered.\n\n**Sun Qiubi’s Prayer for Universal Deliverance to Fulfill His Vow and Honor His Late Master and Ancestor Lu Zijian**\nRecalling his former guidance, I vow that if a promise is made, it must be kept. In this act of universal deliverance, I think of him as if he were present, that he may fittingly ascend. Daring not to renege on my word, I venture to address the celestial hearing.\n\nWe recall that bodily affliction brought suffering, and the illness showed no remission. In haste, we appealed to Heaven, and by grace were granted a temporary reprieve through a single offering. Yet with no ground left for revival, we suddenly realize seven years have already passed. Though the departed are distant, the promises made remain; what the heart knows, the spirits record. Thus, we earnestly fulfill our vow, hoping to emerge from darkness.\n\nWe humbly pray that the Great Dao, ever compassionate, and the Perfect Truth, boundless in scope, may point the way to Penglai’s path—perhaps returning by the Weaving Maiden’s route—or enter the grain of millet to partake in the joy of celestial beings. May the merit of this round completion enlighten both the living and the departed.\n\n**Chen Zhishuai Huang Nie’s Memorial Prayer**\n\nIn the Green Forest, bandits were quelled, and ripe wheat allowed the troops to rest. On Black Ridge, immortals nested, and sacred thatch was purified for the Emperor’s rites. The jade caskets’ statutes were strictly observed, and the jade altar’s ancient ceremonies solemnly performed.\n\nWe recall that, though unworthy, we were entrusted with pacification and suppression. We held that humanity is Heaven and Earth’s most precious, and could not bear to destroy life. Yet if rebels leave the sovereign and father with sorrow, they are called traitors to the state. Thus, we personally led the soldiers, capturing the ringleaders alive. Though we returned in triumph, we could not avoid indiscriminate killing. We repay the aid of the wind’s rustling and cranes’ cries, and show the benevolence of weeding to let the seedlings grow.\n\nWe humbly pray that the cosmos may turn toward harmony, and all strife and suffering dissolve. War is a fearsome instrument, used only when unavoidable; may the grievances of bleached bones be wholly dispelled. Serving the public good, we know no restraint in action; may the depths of our sincere hearts be clearly seen.\n\n**Memorial for the Three Courts**\n\n**Late Memorial**\n\nCool breezes rise in the medicinal halls as the fifth month of summer brings wind’s warmth; incense ascends the sacred altar, where thrice-daily audiences lengthen the day. The celestial might is near at hand, and we extol the radiance of the sovereign’s virtue.\n\nWe humbly recall our undeserved favor, leading troops through campaigns—barely easing the siege at Tingjian, then gathering strength at Hongqian. As an anthill burns to ash, we fortunately delivered the ringleaders in cages; the dragon countenance brightened with joy upon receiving the courier’s tidings of victory. Now, assembling at the united peaks, we reverently ascribe merit to the imperial court.\n\nWe pray that august Heaven may protect Song, restoring the old borders of Zhou, renewing all transformations, that sovereign and ministers may rejoice in harmony, and the five weapons lie at rest, multiplying the realm’s gladness.\n\n---\n\n**Palace Gate Memorial on Locusts**\n\nThe willows of the encampment at Xiliu are newly cleared, ending years of banditry; the white poplars mourn the graves, yet cannot summon the souls of the long-night dead. We perform rites in blessed precincts, offering earnest prayers to vast Heaven.\n\nReflecting on the uprising in Ganzhou, where the dead lay thick as hemp: those bound and executed hastened their own street executions; those who broke ranks and charged bore grievances of the wild grasses. In our judgment, we acted to save the people, trusting the emperor’s aid to crush the rebels. Killing was not by choice, yet lives were saved without end.\n\nWe pray for a great amnesty in dark prisons, universally liberating suffering souls. May the five regions’ diverse customs transform weapons into plows; may the Three Dynasties’ shared ethos merge chariots and script in rites and music.\n\n---\n\n**Palace Gate Memorial on Locust Plague**\n\nFields of abundant grain stretch unbroken, promising a rich harvest; yet swarms of locusts invade, gnawing and bringing disaster. This concerns the people’s lives, and thus the emperor’s heart.\n\nWe recall that the lands south of the great river, long called a land of joy, have seen borderlands briefly at peace, spared urgent military demands. Yet Zhexiang’s poor harvest has already strained official granaries. We had hoped for a bumper autumn, to preserve the lives of the many. Now, this great locust scourge fills every village; we, mere ant-like ministers governing the realm, can but weakly order captures in the fields and earnestly perform exorcisms to the heavens.\n\nWe pray that Heaven may pity all beings, absolving myriad sins, sweeping away the winged pests, and encouraging the gods of the state’s fields. May the precious harvest hang heavy for reaping, bestowing joy upon the farmers. Our vows are urgent; we await swift grace.\n\n---\n\n**Prayer for Clear Skies at Xianying Temple**\n\nWe had hoped for rainbows, but were granted only mist; the lingering clouds refuse to disperse, deepening our worry over floods. Gazing upon the people of Zhe, dwelling in their lands—these encircled fields of watery realms—we see that though rain falls often, the seedlings fail to bloom. The river’s tides gnaw the banks, and lake waters rise to engulf homes. As marshes grow stagnant and damp, illness threatens to fester.\n\nThe Son of Heaven bends his thoughts in concern; his ministers strive for peace and stability. We solemnly prepare the altar rites, reverently presenting our memorial.\n\nWe pray that Heaven and Earth may open wide, the sun’s radiance shining forth. May the three seasons of farming proceed, completing summer’s toil for autumn’s harvest; may the thousand-mile realm flourish, ensuring the people’s well-being.\n\n---\n\n**Preparatory Prayer for Clear Skies at the Bright Hall**\n\nSovereign of the state, child of the people, continuing the great unity of the primordial origin; father of Heaven, mother of Earth, revering the ancestral sacrifices of the Three Ages. We gather for the fast and offer prayers in advance.\n\nWe pray that the autumn skies may clear, the jade candle of time burn bright. May the Supreme Emperor send blessings, completing the rites in the grand hall; may the young ruler succeed to the throne, his great foundation flourishing ever more.\n\n---\n\n**Prayer for Rain at Xianying Temple**\n\nThe people are weary, having lost spring’s planting and autumn’s harvest. Heaven speaks not, yet the sun shines daily without rain. We deeply reflect on our governance’s failings, humbly presenting our distress.\n\nWe recall the canal defenses’ lack of success, our return yet unfulfilled. Meteors streak the daytime skies, repeatedly foretelling drought in the wilds; the fiery season’s qi presses urgently upon the water fields. Though we have prayed at all shrines, we seek only the Supreme Emperor’s mercy.\n\nWe pray that clouds and thunder may descend, filling ditches and furrows. May the planting of grain proceed, granting a bountiful harvest; may jade unite with pearls, displaying Heaven’s auspicious signs. If our officials have erred, we beg punishment upon ourselves.\n\n---\n\n**Second Prayer for Rain at Xianying Temple**\n\nThe farming season is lost, the drought severe as scorching flames. Heaven’s ear is near, yet our trust remains unanswered, bringing no blessing. Thus, we cast aside weariness and knock upon the bright heavens.\n\nWe recall the two capitals’ granaries, where solitary loyalty serves the state. Expenditures double, yet funds are scarce; undeserved honors should be relinquished, yet we remain. Zhexi and Zhedong, lands of grain, pray for abundance; the summer’s plum rains, once hoped for, now wither the earth.\n\nShamans and markets alike fail to move human effort; lightning and dragons respond only to Heaven’s command. Having performed rites by the lakeside, we pray for abundant rains to revive all.\n\nWe pray that the proud sun may be restrained, and sweet rains bestowed. May water plowing and fire weeding swiftly proceed in the fields; may grain rot and coins flow, aiding the state’s stores. We hope for a moderate harvest, averting further calamities.\n\n---\n\n**Prayer for Rain on Behalf of Maoshan**\n\nThe year’s harvest nears, yet requires moisture; autumn’s sun scorches the sands, worsening the drought. Here, where immortals and sages dwell, the common people offer prayers.\n\nWe recall our unworthy appointment to this sacred office, overseeing the auxiliary capital. At this time of many concerns, we hope for a single good harvest. The season of harvest approaches, yet the fields suffer from dry hardness. From the nearby suburbs to distant frontiers, a thousand *li* of land share the people’s year-end anxieties. The Emperor surveys the four directions—can he bear to cut short these lives? As the drought spreads through our jurisdiction, we fear the blame rests solely with this humble minister. Truly, we tremble without rest, hoping our sincerity may reach above.\n\nWe pray that virtue’s blessings may spread universally, benefiting all beings. Pity these toiling people, long laboring in the fields; send abundant rains, that the year’s work may not be in vain.\n\n---\n\n**Prayer to Avert Fire at Kaiyuan Palace**\n\nMeteors fall in daylight, warning Heaven’s high clarity; flames spread from house to house, grieving the people’s displacement. With solemn sorrow, we address the azure vault.\n\nWe recall our futile service, leaving families barely intact. The springs’ flow is blocked, already harming the people; fires rage unchecked, repeatedly burning empty storehouses. Yet Shangqiu’s sacrifices endure, and the Song state’s blessings are boundless. Thus, we perform the rites of libation, reverently invoking the jade-like deities.\n\nWe pray that great benevolence may be bestowed, silently averting disasters. May the vast capital rest secure, the warm winds stilled; may the spring fields receive nourishing rains, hastening the plow.\n\n**Prayer to Avert Warfare**\n\nThe mountain caves, devoid of reason, breed the bandits of the greenwood; the borders we guard bear the deep sorrow of our people. With reverence, we lift our gaze to the vast heavens and solemnly present our perilous plight.\n\nWe recall the years of governing this land, when our borders enjoyed peace. Yet neighboring raiders spread their poison, swiftly turning roads to ashes; the wicked lurk like rats, their treachery stirring within our very walls. Heaven struck down their rebels, yet daily warnings still rush in. The royal palace was breached, and our outposts suffered grievous losses. Our forces, though poised to crush them, have yet to achieve decisive victory. Pleading for the people’s lives, we humbly beseech the Emperor to accept their surrender. We pray that one region’s transgressions be pardoned, sparing countless lives. May misfortune shift with the heavens’ will, and our armies’ might be bolstered by their early triumph. Let their ringleaders be destroyed, offering slight solace to the innocent dead. May the fields and villages be pacified, and all know the mercy of sparing life.\n\n**Prayer for the Emperor’s Heir**\n\nFacing south in court, long has he succeeded to the great lord’s throne; as heir, he should inherit the blessings of a son. Repeatedly, we have offered prayers to the azure vault, awaiting divine response within the palace. Now, at the Hall of the Supreme One, on the destined hour of the Lower Prime, we command the Daoist priests to reverently present their vermilion petitions. We pray that the Emperor’s heart may turn to safeguard the nation’s lineage. May the signs of prosperity converge, and the bows of succession be bestowed. Let the joy of the pepper chambers be fulfilled, as the peach and the gourd’s legacy endure.\n\n**Memorial for the Ninth Depths Ritual by Minister Zhang**\n\nThe toil of a mother’s virtue is vast and hard to repay; her sorrow pierces the Dao of Heaven, which responds without fail. Thus, we perform this pure ritual, reverently pouring forth our sincerest devotion.\n\nWe recall our late mother, whose noble conduct was embodied in her person. Among seven children of the same generation as my late father, she nurtured and embraced us with loyalty and filial piety, her grandchildren thriving through three generations. Her compassion was boundless—her kindness extended to neighboring states, and even the simplest meals brought comfort to our humble chambers. Her life was cut short by the misfortune of her orphans; her frail form seemed lost to us. Our repeated pleas only deepen our grief. Respectfully following the jade tablets’ decree, we now present this green petition.\n\nWe pray that her merits be acknowledged, her errors forgiven. May the wind rise in the white poplars, not waiting for the tomb’s closure; may the fire pass along the golden thread, swiftly ascending to the Land of Bliss. May her grace extend to the Yellow Springs below, and its blessings overflow to all around.\n\n**Prayer for the Five-Seven Ritual by the Minister of Justice**\n\nA woman’s path is to grow old with her husband; when he dies, my sorrow is nearly unbearable. I raise the dust-covered desk in self-pity, composing this petition to submit above.\n\nWe recall my late husband, who had barely received his first official post when he lost his parents. Grief clung to him like a shroud, and as he prepared for distant days, illness struck at the graveside. He perished in his prime, leaving our household in anguish, a calamity worse than any other. Our orphaned children have no support; to whom can my bitter weeping be heard? We pray that your divine gaze may look upon our sorrow, pardoning our transgressions. May his soul be guided to the land of the living, where he may still recognize his kin. May I, a widow, and our weak children forever dwell in the shelter of the Dao.\n\n**Prayer at the Yellow Register Ritual at Yulong Palace by General Chen**\n\nAs I take up my duties anew, the greenwood bandits remain unquelled; moved by the times’ many troubles, I perform the Yellow Register Ritual. I have personally come to the hall of blessings, where the sacred altar awaits. My heart is loyal to the throne, though my hair is white from war.\n\nThe Fujian region has lifted its alert, thanks to the harmony between ruler and people. Yet as I move my post to the Jiang region, famine and hardship have repeatedly struck. Is this due to the people’s accumulated transgressions, or the cruelty of corrupt officials? Reverently, we perform this ritual at the abode of the immortals, hoping to turn the heavens’ and earth’s benevolence. We pray that the jade candle burns evenly, the pearl treads its proper path. May the Emperor’s life be firmly secured above, and all living things preserved below. May the mountain rebels be pacified, sparing our troops from prolonged campaigning. May the fields yield abundant harvests, granting the people and officials a fleeting peace.\n\n**Prayer for the Return of the Celestial Master as the Patriarch’s Protector**\n\nGazing north, we imagine the wild geese bearing letters from the patriarch of the Mystic Gate; looking east, we pray to the true spirits of great creation. The response should not delay, and the report must acknowledge its source. We recall our own cultivation, though our conduct is not our own. At the edge of the teaching’s reach, we have done our utmost to uphold it; beyond the passes, we now face separation. We have repeatedly sought blessings to implore Heaven, and by its grace, we have reached this day. This is no mere fortune—how dare we take our vows lightly? With solemnity, we prepare the primal altar and reverently perform this pure ritual. We pray that the nation may restore its old ways, and the Emperor’s favor renew itself. May the rain of teaching nourish the Dao’s mountain in nine streams, and the star of longevity shine upon the three tiers of the celestial platform.\n\n**Prayer for the Celestial Master’s Stay in the Capital to Establish the Annual Scripture**\n\nThe days’ remainder, the years’ remainder—by fortunate light, we have reached this time. The state must prosper, the family must prosper—we seek blessings for all. With gratitude and prayer, we tread carefully, as if before the sacred. We recall that in our court, the Emperor’s sacrifices extend far, his heart ever constant. Though years pass, his virtue is not forgotten; though the heavens conceal the Dao’s lineage, his grace welcomes the new. Reverently, we present our offerings, silently conveying our devotion like sunflowers turning to the sun. Our inscription cannot repay this debt; only your bright gaze can perceive our sincerity. We pray that great creation bestows its benevolence, and the imperial capital enjoys harmony. May all life thrive as one, and every door welcome the spring’s auspicious air. May both public and private life flourish, and the post stations swiftly bear glad tidings. We vow to cultivate hidden virtue, looking up to answer the primal merit.\n\n**Closing the Altar**\n\nIn this world of dust, we have strictly observed the rituals at the jade altar; from the Emperor’s pure heights, the sacred standards descend to witness. The morning rites are complete, the fast’s affairs concluded. Ritual values moderation to perfect its form; its meaning aligns with the libation’s completion. We pray that the imperial spirit, majestic and serene, may observe our reverent withdrawal. May the enlightened masters clearly perceive and pardon the solemnity of our final rites.\n\n**Prayer of Thanksgiving**\n\nAs the first yang returns, the father first seeks the eldest son in the east; as the three wishes are graciously fulfilled, the Emperor looks down upon you. Such grace, such virtue—how can we repay or express it? We recall that our humble devotion has been thorough, and the imperial spirit has not been blind. Snow first appeared as an omen, and for half a month, the skies cleared. The sun warmed like spring, and after three days, rain fell. All this was the work of the divine, as the signs of qi made clear. Moreover, our allies have stood together through peril and peace, and all officials have moved and rested in tranquility. This was not by our design—it was the Emperor’s will. How else could heaven’s timing align with human affairs? Bathed in blessings, we give thanks and pray. We pray that your gaze may open like the orchids by the stream, ever responsive to the slightest offering. May the omens sprout like seedlings, and your silent goodness answer all desires.\n\n**Prayer for Recovery on Behalf of Another**\n\nIllness binds hearts as one, and the weight of duty calls for mutual support. Though love may differ from kinship, sincerity seeks the shelter of heaven’s grace. The Emperor heeds words and fulfills human desires.\n\nWe recall how one has labored to open the halls of the Dao, yet the body has accumulated afflictions. Wind is the root of lesser ailments, and external causes still linger shallowly. Yet there is water that flows against the current—deep indeed are the distant concerns. No success has come from the marvels of ginseng and atractylodes. How then can one hope to ride upon grace? We pray that the fragrance of immortal ink may linger, that the elixir’s mist may disperse, that the Celestial Physician may descend to earth, and that the healing assembly may bring forth medicine. May the Star of Longevity shine brightly, and the Star of Life ascend high. Like the pine, may one never age; may every blemish be washed away, and the balm of blessings be shared equally.\n\n---\n\n**Preparatory Prayer for the Golden Register Grand Fast at the Mountain, Spring of the Gengwu Year**\n\nHeaven above and earth below have entrusted the great enterprise. Famous mountains and mighty rivers are duly revered in external sacrifices. A single envoy is dispatched to reverently reach the Three Spirits. As the bells, chimes, jades, and silks are first arrayed, the ritual implements of jade tablets, bi discs, and huang pendants are all prepared. Their elegance is manifest, embodying the heart of the Son of Heaven, who unites heaven and earth. When the numinous is made clear, it becomes the foundation for the altars of state and the well-being of the people.\n\n---\n\n**Morning Court Prayer**\n\nWe clarify the spring decree and base ourselves in the sincerity of the morning sun. With reverent awe, we dare not neglect the respect due to heaven. Though what we gaze upon is not distant, silent understanding is achieved. We reflect: upon what do the people rely for order and peace? It is the Emperor who truly governs as their master. Heaven is high, the stars distant, yet the five planets move without error. Earth’s bounty and human harmony stabilize the eight directions, unmoving.\n\n---\n\n**Midday Court Prayer**\n\nThe brilliance of *li* shines in both directions, as the sun reaches its zenith again. The Dao of heaven is timely and perfect—none is greater than heaven. We solemnly dispatch envoys to perform the sacrifices, gazing toward the imperial palace to hasten the court audience. Moved by utmost sincerity, we reverently await a virtuous response. Not a single person is not his subject; heaven bestows auspicious omens, and all things fulfill their lives, each day dependent on transformation and nurturance.\n\n---\n\n**Evening Court Prayer**\n\nIn governing the realm and leading the people, we do not forget the vigilance of evening reflection. Dividing our mandate, we entreat heaven with ever-greater care in dawn and dusk audiences. Sealing our sincerity, we reach from afar, penetrating the Three Realms in silent communion. In the quiet of these moments, we offer our praise. May the state’s principles be perfectly ordered. We still hear the songs of Yao’s lands; the imperial standard is without bias, and great blessings are bestowed according to the *Ji Chou* decrees.\n\n---\n\n**Main Offering Prayer**\n\nThe altars of state face hardship, and we have presumptuously inherited their foundation. The sacrifices to mountains and rivers—how can we repay the lofty deities? We consider the many perils of the land and measure the difficulty of being a ruler. The people have endured danger and distress; famine years cannot avoid displacement and ruin. Without the power to turn back heaven’s will, how can the state endure? We dare to lodge our sincerity in this single offering, hoping to avert calamity through the Three Spirits. May we be enlightened to the signs of the times, and may a modest peace be shown. May the roots of the state be revived, and great prosperity’s omens unfold. May the people be nurtured and settled, and order and peace be gradually achieved.\n\n---\n\n**Preparatory Prayer for the Emperor’s Birthday, Ren Shen Year**\n\nAs the month of his birth approaches, we measure its beginning with silent reverence in our hearts. In awe of the vast heavens, we solemnly repay our origins through external sacrifices. Thus, we dispatch envoys bearing offerings, perform the fast at the immortal altar, and observe the five rites, praying in accordance with the proper forms that the Three Spirits may take notice. The virtue of the sagely wood flourishes, carrying forth the heart of nurturance and growth. As the dawn of the next day approaches, we present the offerings and proclaim the purpose.\n\n---\n\n**Morning Court Prayer**\n\nRising early with utmost care, we offer the initial sincerity of our sacrifices to the Emperor. Restless in our duties, we place the people’s well-being first. Entrusting ourselves to the mysterious rites to seek the mandate, we reveal the heart of the Son of Heaven. Embracing benevolence, we reflect: it is the Emperor alone who is mindful of this. With five winds and ten rains, we achieve the abundance of the middle way. Across the four seas and nine provinces, the resources for modest peace are sufficient.\n\n---\n\n**Midday Court Prayer**\n\nWhen the sun reaches its zenith, it turns back—truly, the warning lies in fullness. Heaven’s hearing is most near; who can ensure its steadfastness? The state stands with its people, and the times are ripe for action. Bearing golden tally sticks, we pray for grace; shouldering cinnabar tablets, we serve the mandate. May heaven grant its favor, further opening the omens of prosperous reign. Following the ancestors’ path, we teach the great peace of the state.\n\n---\n\n**Evening Court Prayer**\n\nAs the day wanes into night, we dare not grow lax in court ritual. The foundation of the state lies in the person—we have presumptuously inherited the bright mandate. Now, as the time of the initial offering arrives, we humbly initiate the modest rites. Is there no desire to seek abundant blessings? We pray that the silent gaze may be fixed upon us. The characters of \"longevity\" are vast—how can we repay such great grace? We personally follow the words of the Dao and, in the end, humbly entreat. We swear to embody the responsibility of acting on heaven’s behalf.\n\n---\n\n**Main Offering Prayer**\n\nAs the sun reaches its second zenith, we have presumptuously shared in the spirit of mountains and rivers. Heaven has no constant favorites; it silently bears the weight of the imperial enterprise. Moved by the times, we issue commands and pray. In dense forests, we rise early and retire late. Recently, winter has followed the decree of spring—who will establish the people’s standard? The concerns are not merely drought, flood, illness, or plague. Reflecting on the state’s principles, how can we fulfill the responsibility of cultivating the self, ordering the family, governing the state, and bringing peace to the realm? The manifold proofs gather upon our person. Thus, we perform the solemn external sacrifices, praying that the Three Spirits may grant their protection. For those who have land and people, our aspiration is for stability. For the state and the family, may we personally witness the effects of great peace.\n\n---\n\n**Preparatory Prayer for the Emperor’s Birthday**\n\nThree days bring renewed weather, marking the beginning of the imperial birthday. The eight wildernesses open into a realm of longevity, ensuring the perpetuity of the mandate. Fragrant mists swirl in the empty air, and the true wind unfurls. Now, the golden envoy bears the water-hearted sword, erects the jade altar, and hangs the pearls of millet. We humbly initiate the modest rites, reverently awaiting the imperial consideration. We pray that the Three Realms may dispense grace, and the myriad immortals may descend to witness. May the nine-five blessings be longevity; may the nine-five blessings be wealth. May the vast realm become our home. Eight thousand years shall be spring; eight thousand years shall be autumn. May we endure beyond antiquity, never aging.\n\n---\n\n**Court Prayer**\n\nThe sagely ruler’s intelligence and clarity shine forth, as the rainbow flows on the day of the Upper Third. Fragrant offerings move the spirits, and the turtle and milfoil extend across the heavens. We welcome the imperial envoys from the blessed land, solemnly presenting the golden register to entreat heaven. Bowing our heads to the red clouds, we offer our sincerity in blue-green prayers. Reverently, we pray that the stars may shine, and the sea’s moisture may open the way to longevity. Before the Three Palaces, may the mountains stand tall as the sun rises. May the people of the nine lands be nurtured.\n\n**Further Prayer**\n\nThe Dao of Heaven is revered; we reverently seal incense in the blessed land. The imperial heart holds us in its regard; we pray for the imperial house to receive divine favor. Bowing low, we present the green memorial, offering it to the profound gaze of the unseen. We pray that though distant, it may be as if near, attending to high and low alike. May no inquiry go unanswered, and good responses abound. May yin and yang harmonize, and wind and rain arrive in due season. May governance be effortless, ministers virtuous, and the common people flourish.\n\n**Prayer for the Heavenly Calendar to Bless the Sage**\n\nAs the Son of Heaven acts on behalf of Heaven, at the outset of his succession, the appointed time draws near like lightning. We offer our prayers in advance for blessings. May this be an era of peace, where weapons are laid aside, and the black-haired people return to benevolence. May armor and blades be washed clean as garments, and the signs of great peace endure. May the sun and moon shine brightly, mountains and rivers stand majestically, and the emperor’s longevity equal that of Heaven.\n\n**Prayer for the State Ritual at Mount Yanzao**\n\nHeaven bestows the Nine Categories, guiding the realm to ascend to the realm of longevity. The state conducts the Seven Sacrifices, ascending the central peak of the famed mountain. Gazing upon the golden gates, the four quarters are stabilized; aligning with the jade balance, the seven celestial bodies are set in order. All this arises from the hidden efforts of the people below, sincerely manifesting the heart of the August Emperor above. We pray that the eight directions be united and at peace, the Three Palaces gain longevity. May Heaven and Earth be level, the primordial qi upright, enabling all things to be without flaw. May yin and yang harmonize, and the harvests be abundant, bringing fortune to the One Man.\n\n**Morning Court Prayer**\n\nBathing in the Salty Pool, emerging from the Valley of the Sun, the crimson sun displays its nine rays. Pushing open the gates of Heaven, entering the imperial abode, we behold a single cluster of red clouds. Donning the night robes, we await the dawn, as the warm breath of spring returns. From afar, we present the incense of state affairs, awaiting the bestowal of policies for peace and governance. We pray that fortune uphold the precious throne, and blessings fill the celestial palace. May the dragon tower be comforted, and auspicious omens be praised within the crane precincts. As yang divides from yin, the Two Modes are established; may the imperial plan endure for a hundred million generations. As autumn’s virtue brings forth the myriad treasures, may the black-haired people of the eight directions be enriched.\n\n**Midday Court Prayer**\n\nAs the sun reaches Kunwu, the zenith is perfectly attained, and the image of fulfillment is complete. The wind-borne chariot ascends directly, and memorials are presented in words. The golden bells fall silent, the jade balance follows its course. We exhaust our devotion, and the imperial heart holds us in its regard. We pray for the imperial way to be grandly unfolded, and civil virtue to flourish. May the Six Treasuries and Three Affairs be justly governed, establishing a foundation of great prosperity that endures. May the Four Seas and Nine Provinces be as one, sharing in the joy of effortless rule.\n\n**Memorial for the Proper Offering to the Great Yin**\n\nThe radiance of life unites with virtue, moving the supreme essence of Heaven’s Oneness. The suspended image descends in spirit, carrying the universal moisture of the earth’s center. The vast true creation, the subtle divine mechanism—before them, I, humbly observing the waxing and waning, follow the Dao. The Palace of Broad Cold is pure and still, its lofty abode adorned with the Seven Treasures. The bright water’s fragrance aligns with the great function of the square mirror. To achieve the wondrous alchemy of ninefold rebirth, one must rely on the surplus of a single drop of golden waves. Together, we look to the moisture descending below, nourishing all things in their turn. Responding to Heaven and form, the Dao and appearance must align with the completeness of creation. The moon is the po, the sun the hun; they do not transgress the bounds of yin and yang. The refining and molding depend entirely on this—we know where to return.\n\n**Memorial to the Heavenly Worthy on the Ninth Night of the Ritual for Lonely Spirits**\n\nThe Jade Treasury seals the covenant with the true, lifting the lonely souls from the Nine Earths. The Precious Flower responds to the invocation, verifying the fruits of the Dao across the heavens. Gazing upward, we soak the imperial hearing; looking down, we rely on the fast and offerings. Together, we look to the Jade Capital to nurture excellence, the Jasper Towers to send forth fragrance. Adorned with the myriad treasures, we look up to the Brahma qi of the Woven Net. The Nine Heavens illuminate, opening the dark paths of the gloomy thoroughfares. May souls cross the Crimson Mound, and blessings flow to their descendants.\n\n**Yellow-Edged Proclamation to Welcome the True**\n\nThe six tubes float in spring; the first yang returns. The nine gates are guarded at dawn; the ten thousand sages arrive as one. At the time when the yellow altar awaits the imperial favor, when the purple qi heralds the beginning, we shall reverently clear the path, gazing upward as the True descends from the void. The Milky Way shines and turns; the divine qi moves beyond wind and thunder. Heaven and Earth are bright and discerning; the imperial robes flow with the light of sun and moon. The hundred spirits of the realm rise to attend the vanguard. The jasper altar and crimson standards long await the ranks of the alchemical registers. The jade table and red clouds once more witness the assembly of the pine and flower.\n\n**Proclamation at the Gate of Supervision**\n\nThe Dharma gate is vast; how could it distinguish between near and far? The imperial abode is pure and lofty; if one does not stray, it is as if close at hand. Let there be reverence and stillness—why not return? Ask not who the child is, nor say the body is a guest. The myriad wonders are not wondrous; here, the mechanism of tranquil non-action is revealed. The supreme words are wordless—how could there be deeds too lofty to perform? Come, let us together behold the millet of the immortals. Truly, there is no wind or rain. The Penglai Isles are purified; following them, one easily attains the body. The dusty world is boundless—where does one hasten? When one arrives at home, the mysterious barrier is straight and direct. Here, in this hall, is the entrance. The divine and bright are diligent in vigilance; the ordinary and sacred return as one.\n\n**Proclamation of the Heavenly Physician**\n\nThe world’s greatest suffering is that of the poor, who are afflicted with many illnesses. Why does Heaven allow this? The medical Dao silently governs. Even when wandering souls transform, there is the intention to lift one’s head and cry out. Thinking of Shennong and the Yellow Emperor, their lofty abodes in the Nine Heavens are hard to inquire of. Like Qin Yueren or Bian Que, their life-giving qi endures through a thousand generations. The Jade Emperor’s supreme medicine, the three-grade elixir of gold and jade, the ninefold return that mends creation and aids yin and yang—possessing divine qi yet leaving no trace. How vast is Heaven’s law of the Dao, ever inclined toward nurturing and healing pain. Do not say ghosts are not human; beyond the work of divine and sagely craftsmanship, they assist that primordial transformation, aiding our fast’s merit.\n\n**Proclamation for the Ritual Bath**\n\nThe poet sings of the Jade Maiden’s basin, meant only for washing the hair. The fisherman answers the grandee: this water is but fit to wash the feet. Neither is wholly good—do not follow their example. For the inversion of yin and yang in Kan and Li holds great power. Moreover, in the heaven and earth formed by the one and six, the qi is first received. Those who drink it know its warmth; those who scoop it find its coolness endless. This is called the ritual bath, fully arrayed in its form. Autumn enters the lungs and liver, the five viscera; it sprinkles the dew of the golden stem, chilling the hair and bones. A single flask immerses the ice of cold jade. Facing it, dust and grime vanish of themselves, enabling both form and spirit to attain perfection. This is not like spring’s end, when one returns singing from the Yi River, nor like sighing at Huaqing, emerging from the warm springs to receive the gift. Freed from the self—who is the one washing?\n\n**Monitor of the Students’ Register**\n\nWhen the Great Ultimate first divided, Heaven and Earth were established, and the Six Offspring arose. The primordial qi dispersed and divided, yin and yang intertwined, and the myriad forms took shape. Yet none is more noble than humankind, for we are endowed with spirit, serving as the heart of Heaven and Earth. Who, then, holds the handle of creation? The loveliness of orchids and thoroughwort springs from the reverence of the ten thousand spirits. But when one sits in the grass and vanishes like a cloud—if even a single thought arises to sustain them—beyond that support, they remain bound like a melon to its stem, unable to restore the fragrance of a frozen valley. The ranks of officials are orderly, their transformations traceless. You know the dream of old—regard it thus. The magic mushroom has no root; here, you may fathom the manifold wonders. The peach blossom, greedy for its fruit, teaches one to blame the east wind in vain. Be pure, be free, and ever wakeful—go forth.\n\n**Monitor of the Fasting Hall**\n\nMillet and sorghum are not fragrant—I have heard these words. Though the sacrificial grains be impure, the officers listen in silence. The Dao of Heaven and Earth shines clearly; the feelings of ghosts and spirits are utterly transparent. Without sincerity, no offering is accepted; by virtue, recompense is due. For though the petals be arrayed in full, even pine blossoms are not spurned. If fragrance may be presented, then even water plants and algae bear no fault. Yet fire from labored wood may cook a meal, but how dare one offer a feast of dust and soot? Moreover, the Sage’s teaching warns: \"Do not eat what is improperly prepared.\" If the stench of raw flesh offends Heaven, how much more the exalted Lord? Thus, if we would not profane purity, by what means shall we illumine and serve the gods? Only you, the worthy, who have made your merit manifest—do not neglect your duty. The richness of the Dao is not a matter of taste; why seek the discernment of Yi Ya? The food is ready to be tasted—let not the stain of Zigong’s finger mar it. The cloud-kitchen must be kept pure, that the heavenly rank may rise.\n\n**The Water-Chestnut Enclosure**\n\nErect the water-chestnut enclosure to welcome the wandering souls—once in a lifetime, twice in an age. Arriving at Penglai, one hears the wondrous Dao—across a thousand years, the reunion is profound. The years fly like a shuttle; youth fades like spring’s blossoms on the trees. How many days does a life hold? The north wind stirs the sand, and the withered branches howl in the cold. Your journey, too, has been arduous. All under Heaven are brothers; this gathering is of immortals. Long ago, the Dark Master pointed the true path through the hidden pass. Now, the Lord of Teachings once more spreads the compassionate ferry across the sea of suffering. By what cause or karma have we gained this expedient means? Life is what I desire; righteousness, too, is what I desire. Fortunate to encounter the fish and bear both at once—does the noble lord it over others, or the lowly? Do not imitate the clam and snipe locked in strife. Snowflakes melt to moisten the lips; clouds gather to cleanse the heart. The flavor of the Dao is enduring; the seeds of goodness reveal themselves. Heaven is vast, Earth is broad—why should the night rain trouble one’s grievances? Yin reaches its extreme, and yang returns—another message of spring’s breeze.\n\n**Register of the Lonely Spirits**\n\nZhuangzi once said: \"Having received a completed form, that form must one day perish.\" Ruan Jian argued there were no ghosts, yet ghosts proved otherwise. Thus we know the inherent nature of the two qi cannot be dismissed by a single path. The tales of Boyou and Peng Sheng—did the ancients deceive us? The wrongs of Weiqi and Guan Fu—are the trustworthy histories not as they say? From life to death, from ancient times to the present, the gardens of Jingu—how could there be no song and dance here? The flowers and trees of Pingquan—how many have lived to see them? The river of descendants flows ever eastward, while the sun sets in the west. The widowed, the orphaned, the solitary, the childless—among the common people, many are those without recourse. Some perish from plague, others die young or in darkness. Half of those whom Heaven has stripped suffer a thousand hardships, beset by poverty and sickness. How many sighs can they bear? In the end, all return to nothingness. Without a master to make offerings, they are called lonely spirits. Yet now, by good fortune, they encounter the Yellow Register Fast of the Daoist Office, which has specially initiated this wondrous rite. They are filled with food and never hunger; warmed by clothing and never cold. The thirty-six sacred scriptures and good karma—have they not received the twelve thousand golden tablets? The spirits of the dead shall all ascend to the paths of immortals and buddhas, fully capable of entering the gates of Heaven and the gates of men. All may depart from the Yellow Altar, turn their heads, and swiftly ride the pure winds of Penglai. Their names are recorded in the Cinnabar Palace; in time, they shall all enter the Millet Pearl and the Azure Vault. Rejoicing greatly, they shall soon transcend.\n\n**Register of the Generals and Officers**\n\nCloud-script fills the Great Void; the Dao is made manifest through writing. The divine qi of wind and thunder resides in the heart. Moreover, the light and mountains scattered between Heaven and Earth share a single principle with the union of Heaven and humanity. Lord Lu became a thunder spirit; Fu Yue rose as a constellation. General Li, though he never received a noble title in life, must surely rank among those whose honors ascend with the stars. Zhang Suiyang, who vowed to kill the enemy even in death, will surely rouse his unfinished heroic heart. Though the essence of the Dao arises naturally, its function in the law must be strategically employed. The jade terrace rises from the earth; the jade carriage gazes upon Heaven. The golden tablets seal the tally; the treasure books open the lock. By these means, the numinous wind is spread and the sun of wisdom shines forth. By these means, the lost are guided back and the bewildered cross the ford. In the darkest depths of the Nine Netherworlds, even a single inch of the cinnabar heart brings light. Silent accord lies in the Dao; the noble transformation does not rely on the spirit. Without performing good deeds, how can one attract auspicious omens and attain the joy of the immortals? By assessing merit and bestowing rewards, one may ascend beyond the ranks of Heaven.\n\n**Register of the Ritual Sequence**\n\nFasting is for serving the Emperor—it must proceed from the root. The Dao of culture is not distant from humanity; how can there be a guiding principle without its details? We, the officers of the Yellow Altar, are none other than the court of the Purple Palace. In orderly ranks, we earnestly instruct: our words become the law, our actions become the model. Act as though the Lord and Father stand before you. What is spoken, what is written—know that immortals can be learned. Walk the full circle within the compass; turn within the square of the carpenter’s rule. Do not say you see nothing, hear nothing. What fault lies in punishment? A single miswritten character in the *Huangting* script brings error. No transgression can be concealed on the Gengshen day—what fear is there of the Three Corpses? Let us swear our alliance to Heaven, bright as the sun.\n\n**Tea Register**\n\nI ask: the magic leaves of the sea—has their radiance not soared to the Milky Way? The auspicious herbs of the mountains—has their fragrance not mingled with the sweet basil? By their rare merit of the highest rank, they draw in the finest qi of the gathered blossoms. Consider the Heavenly Master, who inherited the Han lineage: his vessel was prepared with the root of immortality, his Dao profound and subtle. The water of the middle cauldron is clearly seen; the tender buds flourish thickly. Not to mention the unopened buds of Mengding, the purple orchids and fragrant cassia they depend upon, the vermilion grasses and fine grains that attend them. A gentle thunder cracks the pod, awakening the benighted. The moon shapes them into cakes; their crystal brilliance stands alone. One sip measures the capacity of all; together, they suffice for discourse. The tongue’s root stirs in secret; the green banner is unfurled. Pressing on to Penglai, the clear wind fills both sleeves. Holding the green jade tablet, one attends the morning audience; joy reaches the ninefold palace. Slowly, the sun rises three yards high; leisurely, the five thousand characters advance. Fine lines naturally link in the stone tripod; noble names rise again from the golden bowl. White snow fills the cup, flowers linger—briefly, the fragrance graces the tip of the nose. The benevolent wind silently gathers pearls; buds early restore spring to the palm. Nodding, one steps forward; the heart is steeped and offered.\n\n**Wine Edict**\n\nUpon the yellow altar, sweet wine is set; the great potter’s wheel turns, and the solitary yang is born. In the dark pavilion, cups fly; the grand rites are complete, and all blessings gather. Bamboo and pine stand as if drunk; gibbons and cranes welcome in joy. Together we revere the Heavenly Master, whose cloud-qi is as venerable as the udumbara. Amidst the sacred mountains’ tripods and cauldrons of this enlightened age, harmonious black nectar flows; from the immortals’ palace, auspicious mists and fragrant winds arise. Raising the gourd, one pours the celestial brew—spirit transcends the mundane. Pausing the cup, one questions the bright moon—elevated thoughts remain unstained by dust. Merging with the division upon the cauldron of Qingzhou, permeating the subtleties within the jade scepter’s yellow core, one sinks into the intoxicating savor of the Dao’s flavor, steeped in the grace of the immortals’ breeze. A heart brimming with profound reflection ferments a full measure of joyous blackness. Passed among men to be extolled, why speak of a thousand days’ rare fragrance? Summoned by the Son of Heaven, one would yet intoxicate the ninefold palace with spring’s hues. One imagines, as the phoenix-side banquet concludes, the vermilion edict inscribed, the imperial gift of yellow-sealed wine bestowed upon the saddle. Tapping the jade pot, one envisions the Daoist minister’s heart as clear as ice; pointing to the golden stem’s dew, one smiles at the immortal palm’s congealed pearls. The rich, dark flavor deepens; the fragrance of roses draws near.\n\n---\n\n**Water Lantern Edict**\n\nWater lanterns mirror the water, unfolding into lotus blossoms that face both heaven and earth. The sky’s reflection dries the heavens, illuminating the empty isle of Penglai. The nine abysses know no night; a thousand torches float upon spring. Crow and hare yield their radiance; seated by the sea, one communes with the Silver River. Fish and dragons blow waves, racing across the platter—one suspects they are luminous pearls. Yet this single golden light resides entirely upon the tips of the lords’ brushes. With sand-wrapped millet, why summon the soul of Quzi? As waves birth flowers, one may recite the verses of Su the Immortal. Where this lingering brightness reaches, even the hidden depths of the earth return to light.\n\n---\n\n**Universal Deliverance and Covenant Edict**\n\nThe precious moon regains its fullness, the jade axe at last stilled. For nine nights, the spring wind stirs, and the golden statutes are revealed. Solemnly, no dust-borne steeds take flight; lightly, no immortal chariots leave traces. Five difficulties are resolved in emerald order; three obscurities are dispelled. The ten directions float in emptiness, yet a single pearl gathers all. Within lies the spontaneous workings of creation, here extending deliverance to the hidden and dark. Crane messages dawn in clarity; dragon patterns rise with the clouds. In reverence for the distant and the departed, one presents the sincere heart of self-purification. To escape suffering and ascend to truth, one gazes upward to the wondrous Dao of deliverance. Now is the time; Heaven indeed attends.\n\n---\n\n*Collected Virtues, First Scroll Concludes*\n*Collected Virtues, Second Scroll*\n\n**Li Clan’s Solemn Establishment of the Nine-Yin Ascension Rite for Deliverance of the Deceased Husband and Descendant Spirits: The Principal Invocation of the Orthodox Offering**\n\nLife and death are vast indeed—rites of celebration and mourning mark their bounds. With fasting, purification, and ablution, Heaven and Earth attend. Already, the golden tablets have bent to grace; now, with jade rites, we humbly offer thanks in clarity.\n\nWe recall with reverence: how shallow our portion of Heaven’s favor, how fleeting the kindness bestowed upon this handmaiden. In two years, seven bereavements—husband lost, then child, then grandchild. One body weeps for three generations. Daughters perished, grandsons followed; strange maladies arose, suspicions of lingering affliction. The divine trembled in wrath, calamities pressed without cease. This body dared not rest in ease; this heart knew its guilt.\n\nWe have purified ourselves, crossing the Six Paths to dissolve transgressions. Yet how much greater to prostrate in sincerity, to invoke the sacred peaks and plead for deliverance. August Heaven looms above; the bright waters declare themselves.\n\nWe pray: may the Dao’s life-giving spirits show mercy, may benevolence forsake no being. Through the ninefold refinement of immortal rites, may they be moved to unseal the gate of liberation. May the human realm be renewed, forever sealing the path of hidden suffering. May the day of grace dawn, and accumulated virtue repay Heaven’s debt.\n\n---\n\n**Preliminary Invocation**\nThe Supreme Emperor’s boundless compassion ever fears estrangement from the human way. Though all mortals must die, the true rites of salvation endure to aid all beings. Yet in old age, how could one lose both sky and earth’s support? Those long departed—who will open the ground of their rebirth?\n\nThus, with a heart of cinnabar sincerity, we reverently prepare the jasper altar. The five winds stir gently, fortunately upholding the mystic norm; the nine gates of cloud part, permitting dawn and dusk to enter the pure radiance.\n\n---\n\n**Morning Invocation**\nThe virtue of cherishing life is vast, moving the exalted sages to cast their light. The heart that honors the distant is enduring; we solemnly begin the morning audience and plead for deliverance. The sun’s qi bridges the meeting of Heaven and humanity; yang brightness communicates the mechanism of creation. The three realms commune in spirit; the nine springs rejoice. Jade texts spread across kalpas, guiding the way for immortals; golden tablets flow with cinnabar, sealing the sincerity of mortal pleas.\n\n---\n\n**Midday Invocation**\nRising early to serve the Emperor, the devotion of fasting remains incomplete. Approaching the court at noon, we lament family hardships too deep for words. External misfortunes have struck, bringing inner grief and mourning. All day we examine our faults; we repent our calamities before Heaven. Blocked paths now open in silence; the Northern Dipper severs the road of hidden suffering. Radiant clarity shines through; the Southern Palace raises the liberated souls.\n\n---\n\n**Evening Invocation**\nThe autumnal palace at dusk reflects the many hardships of human life. The morning rites extend into night; child-readers chant their subtle verses. The Dao opens the light of the hidden earth; virtue pours forth the nourishing dew of its surplus. May it aid the departed and bless the living. Heaven’s decree and human fate align—may we gather the twilight of the elm’s shade. May the sun’s glory flourish in posterity, ever more lush than orchid sprouts.\n\n---\n\n**Invocation to the Perfected Lady for the Thirty-Seventh Generation Celestial Master, Master Xīwēi**\n\nAlas! This disciple journeyed afar, only to die as a stranger and never return. Yet Heaven’s wisdom is keen; it pities the voiceless sorrow of the people. The door stands empty of hope—thus, the true words of the invocation begin.\n\nWe recall with reverence: so-and-so, having inherited the teaching for three years, packed his belongings and traveled ten thousand *li*. By the grace of his ancestors, he met with fortune; yet stricken by lingering illness, how suddenly he perished. The heart breaks at the arrival of letters from afar; the spirit grieves for the traveler’s shroud. The bond of mother and child, the vastness of life and death—we turn in devotion to the ancestral teaching, first sweeping clean the household.\n\nWe pray: may the four qi shine clear, may the five texts open wide. The North cannot be dwelt in long—may the Emperor dispatch the Three Summons. The Eastern Limit delivers boundless beings—may the scripture be transmitted ten times over.\n\n---\n\n**Second Day: Morning Invocation**\nDawn’s light is desolate; no robes bow before the mother. Mortal sorrow is poignant—we rely on letters to cry out to Heaven. The solemn presence of the ten directions and three realms descends; today begins the second day’s six audiences.\n\nWe pray: may yang radiance shine universally, may imperial decrees be issued. May the wandering soul of the northern wastes be permitted to follow the melting snow; may the immortal register of Penglai be inscribed, allowing transcendence and ascension.\n\n---\n\n**Midday Invocation**\nThe sun stands at its zenith; the brocade of day’s return is torn. Yet the spirit remains as if present—we raise incense of fragrant herbs in reverence. The cries for a lost child are mournful; the longing for Heaven is urgent.\n\nWe pray: may the Jade Heaven stir to action, may the Golden Gates dispense grace. May the great courtyard of flowing fire open wide, utterly dissolving all past stains. May they enter the ministry of the Supreme Mystery and achieve transcendence.\n\n---\n\n**Evening Invocation**\nThe hour of night’s settling arrives; the eldest son is no longer seen in the bedchamber. The evening audience of the rite proceeds; the assembled sages still attend the altar. We strictly adhere to the teachings, manifesting reverence before the lofty firmament.\n\nWe pray: may the night’s qi be serene and clear, may the celestial perfected guide the ascent. May the soul be delivered—may its wish for eternal freedom be fulfilled. May mother and child find connection, perhaps meeting in dreams.\n\n---\n\n**Third Day: Morning Invocation**\nThe forest greets the dawn sun; sorrowful, we watch the crow return to feed its parent. The altar gazes toward the vast sky; with pardon in mind, we think of the phoenix ascending at sunrise. Bathed in fragrance, we return to the command and prostrate ourselves to beg for grace.\n\nWe pray: may the gates of vastness open wide, may jade tablets enter the audience. Mindful of the descendants of Yangping, may they be attached to the immortal ranks. May they receive the true transmission of the Jade Bureau and personally hear the supreme Dao.\n\n---\n\n**Midday Invocation**\nThe sun’s light stretches long; grieving the divergent paths of south and north. Heaven’s majesty is close at hand—how can we bear the sight of an aged mother and young child? The bright waters are offered again; sorrow runs deep.\n\nWe pray: may talismans be issued from the Jade Steps, may decrees descend from the Vermilion Mound. May they ride the feathered wind to return, briefly recalling their old retreat. May they enter the jeweled pearl and listen to its radiance, suddenly awakening to past errors.\n\n---\n\n**Evening Invocation**\nWhite hair and a blue lamp—forever severed is the dream of holding a jade ring. Golden texts and cinnabar tablets—we rely on the rites of refining jade. The night’s scene is quiet and desolate; the fast’s work is complete.\n\nWe pray: may the celestial texts be gathered and spread, may the Emperor’s grace be widely proclaimed. May the departed ascend to perfection, returning the qi of Heaven, Earth, mountains, and rivers. May they expound the scriptures and transmit the Dao, awakening to the constancy of life and death, day and night.\n\n---\n\n**Preliminary Invocation for the Celestial Master’s Audience and Return to the Mountain, by Imperial Decree, to Perform the Golden Niche Fast**\n\nThe Emperor proclaims: with reverence, we have chosen an auspicious day to express our devotion to the mountains, rivers, and altars of the land. With rites and music, we serve Heaven, preparing jade, silk, drums, and bells in full measure. At this moment when the three realms commune in trust, we begin with solemn purification of qi.\n\n**Invocation for the Procession of Gold, Where Earth Becomes Jade**\n\nWhere gold is put to use, the very earth turns to jade. Gazing upward, we behold the boundless virtue—how dare we falter in resolve? The majesty of cap and sandal shines forth, never straying even a foot’s length. Cloud chariots advance in solemn grace, star-canopied tents glow with radiant light. Bestowed commands converge in harmony; spirits align with fortune, seasons with their proper order. Auspicious omens descend in full: the sun’s brilliance redoubles, the moon’s clarity deepens. The seven celestial bodies align in perfect order; the five weapons remain untried.\n\n---\n\n**Morning Audience Invocation**\n\nAt sunrise, the hour of *yin* receives its guest, as Yao took Heaven as his model in greatness. Heaven’s favor renews its mandate, as Tang inscribed the sun’s power to ever renew. Preserving the dawn’s pure and luminous *qi*, we hold morning court in solemn reverence. The divine presence abides—may the Emperor ever bear this in mind. Gathering blessings for all beings, may he never stand alone in his august rule. May the records of the year be bountiful, not monopolizing glory in spring and autumn alone.\n\n---\n\n**Midday Audience Invocation**\n\nThe radiance of *Li* illumines all, as we look up to receive the sun’s twin beams. The celestial image stands high—how dare we neglect Heaven’s entrusted teachings? The divine presence hovers above, vast and boundless; the sovereign’s spirit, moment by moment, manifests its power. The Dark Ultimate receives homage; the Pure Capital dispenses decrees. The foundation of the divine realm and the nation remains unshaken, securing the Nine Lands. The customs of the capital’s counties flourish, as the four cardinal virtues bring great order.\n\n---\n\n**Evening Audience Invocation**\n\nAs autumn’s first breath arrives, the day wanes into evening. A single thread of sincerity stands revealed, preserving the night’s *qi* to serve Heaven. In the vast and formless, no partiality exists; in the depths of secrecy, commands are issued. Grandly upholding the ancestral way, he assists his house with devotion. The imperial carriage is not his heart’s desire—truly, he relies on the Dao of foundational aid. Seated in the Hall of Light to govern, how dare he stray from the wellspring of assisting virtue?\n\n---\n\n**Principal Offering Invocation**\n\nThe state is called the eldest son, like a treasured vessel held close to the body. The father is revered as the august lord—even in quietude, one seeks his command. How dare we shirk this duty? Daily, we offer silent gratitude for his support. Through ritual, words reach their mark; through sincerity, offerings are received. All people are kin, all things companions—united in the benevolence of a single gaze. When customs flourish and governance is achieved, the virtue of the Three Powers shines forth in full.\n\n---\n\n**Preliminary Invocation for the Thousand Autumns Festival**\n\nBearing the weight of great responsibility, he succeeds to the mandate of Heaven and Earth. Nurturing life in due season, he attends to Heaven and Earth with a heart set afar. Sincerity extends beyond jade and silk; reverence is perfected upon the jasper terrace. Sweeping clean the dust of the lower realm, he humbly receives the high command of the vaulted heavens. Jade wheels advance with phoenix escorts, harmonizing with the imperial progress. Golden registers open the vast origins, their evening petitions never failing.\n\n---\n\n**Three-Audience Invocation**\n\nHeaven, in its trust, protects the people below. Daily, he reflects on the charge of the Eastern Palace. From dawn until the sun’s decline, he reveres the Purple Ultimate’s court. Examining himself, he finds his true nature; offering his heart, he extends his devotion afar. May the divine spirits deign to witness this, weaving blessings for the ancestral altars. In the Five Studies, he cultivates himself, diligently striving toward the realm of perfected personhood. In the Two Palaces, the brows relax, as spring’s warmth suffuses the halls of inquiry and repose.\n\n---\n\n**Principal Offering Invocation**\n\nThe nation’s foundation rests upon the peachwood talisman—how dare he neglect the duty of succession? In the spring of kings, he nurtures the substance of life, upholding the signs of growth and completion. On the day of birth, he sends fragrant offerings, ascending the sacred mountain to perform the Golden Register rites. Heaven’s gaze is not distant—it is as if the Emperor himself were present. Overseeing the realm and pacifying the armies, he extends his support within and without. Inquiring after well-being and attending meals, he fulfills loyalty and filial piety toward ruler and kin.\n\n---\n\n**Preliminary Invocation**\n\nThe palace mirrors the celestial patterns; envoys hasten with solemn urgency. The dragon-sealed decrees of the regional lords are received as altar rites commence in solemnity. Cloud-palace rains from the jade firmament wash away the dust; winds of the golden hall disperse. The Emperor’s mandate brings spring’s warmth; the nation’s sincerity is conveyed in evening petitions. Tomorrow, the ranks will assemble in perfect order for the morning audience. The radiance of the ninefold gates and imperial avenues awaits Heaven’s decree.\n\n---\n\n**Morning Audience Invocation**\n\nThe sun’s chariot ascends the Yellow Way as the dawn court assembles in solemnity. The immortal retinue gathers in the crimson clouds, floating above the imperial path. To convey the nation’s sincerity, we dispel the baleful influences of fire and earth. Though the sovereign’s virtue alone could turn Heaven’s course, he first seeks the Emperor’s command to establish the foundation. Stars align in *Yi* and *Zhen*, gathering a hundredfold obedience to the imperial person. The moon resides in *Jin* and *Qin*, uniting the three directions in vast fortune.\n\n---\n\n**Midday Audience Invocation**\n\nCelestial patterns are calculated; the state averts omens as the Grand Astrologer records them. In the spring’s bright daylight, envoys approach the Primordial with reverence. Offering blessings is the minister’s duty; averting disaster lies within the Emperor’s power to transform. Facing the divine, we refine our words and await commands. From beginning to end, we follow Heaven’s Dao—stars do not harm the earthly realm. Auspicious signs flourish around the compassionate person; virtue eternally aids the celestial chariot.\n\n---\n\n**Evening Audience Invocation**\n\nThe calendar-keeper observes the stars, divining portents to report above. Serving the altars and blessing the state, we preserve the night’s *qi* to approach the Primordial. Though the *yinghuo* planet’s movements are erratic, the dark rites of *gui* and offerings can still be employed. The great net remains in place; turning the course is not difficult. The lord’s sacrificial ale flows without worry, as spring’s radiance suffuses the flowery halls. With the peachwood talisman comes fortune, stirring joy in the maple palace.\n\n---\n\n**Principal Offering Invocation**\n\nHeaven is called Father, Earth is called Mother. The terrace observes the planet’s lingering and retreating paths. Heaven forms images, Earth forms shapes—the state holds the intent of sacrificial offerings. The dark model is presented in the jasper hall; green petitions ascend to the Pure Capital. Commands are issued to the stars, flowing blessings upon ruler and sovereign. A single word retreats—let not spring and autumn monopolize glory. A single *qi* resides at the center, eternally securing peace for the people and the altars. Blessings reach the sagely heirs, prosperity extends through the ancestral branches.\n\n---\n\n**Sacred Festival Invocation**\n\nReverently following the August Heaven, he is entrusted with the weight of succession. Enduring through boundless generations, he deeply reflects on the difficulty of carrying on the legacy. Measuring the first moments of his birth anew, he examines himself to serve the Emperor. Purifying the Golden Register, inscribing the jasper rites, his sight and hearing never stray. He has fulfilled the rites of approaching the Primordial; the divine oversight shines forth. Exhausting his devotion, he offers all praise. From afar, he unfurls green petitions beneath the azure vault.\n\nWe humbly pray: may the dark workings remain unforced, extending the jade calendar’s vast span. May yin and yang harmonize, wind and rain arrive in season, and all beings rejoice together. May loyal ministers flourish, all things be nurtured, and the myriad states stand firm.\n\n---\n\n**Offering for Preserving Life and Guiding the Departed**\n\nWhen harvests fail and illness descends, he prostrates himself to examine his conduct. Honoring the distant past remains ever-present; he cries out to Heaven to plead for life. Inscribing his steadfast red heart, he disturbs the lofty divine hearing.\n\nReflecting on accumulated transgressions and regrets, calamity and darkness have befallen the realm. Wandering souls transform; the dead cannot be revived. Heaven’s affliction lies in having a body; the living can scarcely preserve themselves. Caught between two perils, he is gripped by anxiety and dread.\n\n**Purification of Intent at Sacred Peaks and Prayer at the Crimson Gates**\n\nThus he purifies his resolve upon renowned mountains, beseeching the transmission of his plea to the crimson palaces. He observes the rites of the golden tablets and offers libations to the jade wheels. May the supreme and manifest Perfect Benevolence deign to extend threefold pardon, that the talismans of deliverance from suffering be vast, and escape from suffering know no other path; that the virtue of cherishing life be all-encompassing, and the prolongation of life have its source. May the family line flourish, and the grace of Heaven be eternally borne.\n\n---\n\n**Opening Petition for the Universal Salvation Retreat on the Bingyin Day**\n\nEmbodying the heart of Heaven and Earth, he grieves for the three springs and mourns the nine nights. Approaching the realm of immortals, though a thousand *li* distant, he conveys a single sincerity. The primordial covenant is first pledged, and the green missive is presented. Reflecting that with an impartial heart he engages all things, he seeks to extend his own concern to others. He has heard that the perennial salvation of renowned mountains is universal, and this aligns with his own enduring aspiration for even the smallest measure of land. How pitiful it is that souls unremembered in sacrifice become orphaned! If they may yet attain transcendence, how could those who ought to think of their kin dare lag behind? His earlier words stand firm as the sun; his inner sincerity resonates with Heaven. Having once made a solemn vow to lead the way, how could he not personally enact a virtuous beginning? The altar’s rules are as pure as ice; the path of the assembly opens like parting clouds. May the five *qi* coalesce into truth, and the Three Spirits unite in virtue. May the mystic wind foster growth, once more inaugurating the primordial state of the Great Ultimate. May the moon of the Dao shine brightly, illuminating even beyond the deepest shadows.\n\n---\n\n**Morning Audience Petition**\n\nThe imperial halls glow crimson with clouds; the Yellow Springs bend to the sun’s passage. The jade steps of the immortals’ realm are arrayed in green; the ranks stand in solemn order for the dawn audience. The sun’s rays illuminate the prostrate sunflowers; spring does not forsake even a single blade of grass. The Way of renewal is ceaseless as Heaven. The bright offering arises in the East—such is this dawn. Joy is unmatched by facing south; why should these words be doubted?\n\n---\n\n**Midday Audience Petition**\n\nThe marvel of the Dao is depicted in the *Yi*’s \"Before the Drawing,\" where meeting occurs in separation. Yang arises from the firm’s end, and thus we observe its return. Gazing toward the cinnabar spirits, he petitions for life; aspiring to the golden tablets, he seeks accomplishment. The three *qi* harmonize; a single light pervades all. The solar essence is refined, emerging clearly from the mechanism. The celestial nature remains unobstructed, transcending to unite with its ultimate state.\n\n---\n\n**Evening Audience Petition**\n\nCranes arrayed like stars stand in solemn ranks at dusk; dragon-script petitions float upon the gentle night air. With utmost sincerity, he serves the Emperor; expounding the teachings, he inherits the great salvific work. Beneath the lamp of wisdom, the heart’s essence is as clear as a mirror. The jade registers record merit, and once more he beholds the sun and moon of three lifetimes. The precious talismans deliver life, reopening the *qian* and *kun* of the four images.\n\n---\n\n**Main Offering Petition**\n\nThunder resounds and rain overflows, washing away the grievances of the hidden earth. Heaven is luminous and Earth discerning; the mystic gate’s beneficence is impartial. The gracious blessings secretly align; the sincerity of the retreat is fulfilled. Reflecting that he upholds the wondrous Dao and aspires to the true rites—what cannot be named is beyond ordinary names; what saves all without exception is universal salvation—he initiates a compassion as boundless as the heart, seeking to perfect the benevolence that completes all things. From the Eastern Pole, willow branches secretly sprinkle the lingering coolness; within the green millet, the yang of spring’s growth is contained. Transforming the Dharma rain to nourish all, he exhales the divine wind upon the withered and decayed. Having already manifested evident efficacy, there shall be no unredeemed souls in the hidden darkness. Though his humble offerings are meager, how could he ever repay such profound grace? May the Nine Perfected rejoice in assembly, and the One Virtue shine in harmony. The Great Dao may be sought through sentiment; when human affairs are exhausted, principle is revealed. From the heart’s origin, he dares to glimpse the wholeness of Heaven and Earth. When all things flourish, who is excluded from the vastness of *qian* and *kun*?\n\n---\n\n**Petition for the Universal Salvation Assembly to Repay and Transcend**\n\nThe deepest bond of mother and child once prompted prayers for healing and peace. Though the paths of the living and the dead diverge, love for the living and sorrow for the dead are boundless. One expression of gratitude, one plea; thrice purified, thrice bathed. Reflecting that his late son, of humble birth and frail constitution, strayed from the path of nurturing care and languished long in debilitating illness, he and his wife together appealed to August Heaven. Moved by the pitifulness of their foal-like child, they hoped for the silent protection of the great spirits. Yet unexpectedly, he was cut down in his prime; medicines and stones proved futile. One after another, they withered away, grieving the loss of a generation. The surviving mother cannot escape blame, and the covenant of original blessing is broken. Now, on this occasion of the Universal Salvation retreat, he seeks to aid the cultivation of the departed’s good karma. May the azure vault witness and the black registers erase his name. May the cycles of sun and moon assist the first steps of the orphaned soul. May father precede and son follow, together ascending the immortal ranks of the highest grade.\n\n---\n\n**Petition of the Five Perfected to Recommend the Deceased Attendant**\n\nHeaven’s grace in salvation does not exclude the hidden darkness. When people make earnest supplications, their affairs often concern grief and mourning. With a single sincerity, he petitions and prostrates a hundred times. Reflecting that his late grandson, born in an inauspicious time and long departed, was raised in swaddling clothes to continue the family line. After coming of age, marriage was planned, yet suddenly he was lost forever. The paths of the living and the dead are now sundered; the bond between grandmother and grandson knows no end. Now that the great mourning period has arrived, he dares to solemnly present this pure offering, seeking to aid his ascent. May the Purple Palace cleanse his transgressions, and the mystic power bestow creation. May his celestial nature shine clearly, dispelling past delusions. May the Dharma rain nourish all, reaching both near and far, the withered and the decayed. May all these numinous consciousnesses together attain carefree wandering.\n\n---\n\n**Opening Petition by the Assembly Leader for the Nine Dark Realms to Recommend Kin**\n\nAs days pass and months come, thoughts of kin grow ever more poignant. Heaven is high and Earth is deep; the heart that honors the distant past is enduring. Seeking the Great Dao’s gate, he offers libations upon renowned mountains and presents petitions. His foolish sincerity is fitting; the master’s guidance brings completion. The jade script emits light, inaugurating the rites of the *Lingbao*; the royal writ bestows life, and the path of the Vermilion Mound remains ever open. Such unmerited grace defies repayment.\n\n---\n\n**Three-Day Petition**\n\n*Qian* begins and *kun* is born; Heaven alone endures through the ages. Rising early and retiring late, he thrice approaches the audience rites each day. Relying on the immortals’ rites that perfect all things, he initiates the filial duty of repaying his parents. Humbly presenting his offerings, he looks up to answer the true banners. Only through filial piety can he move the divine; bowing in reverence, he feels shame. Considering that life is as fleeting as night and day, he reflects on where he ought to return.\n\n**Main Petition**\n\nThe Dao revolves through the human realm, its creative power of generation without end. Gazing toward the imperial union, his reverent sincerity remains unwavering. He hastens to the immortal realm, humbly submitting his red heart.\n\nReflecting on the wanderer’s longing for kin and the child’s grass-like heart, he recalls the boundless grace of Heaven, which cannot restore the light of the long night. The spring rains have moistened the earth, deepening the sorrow of the Nine Springs. How can the root of life be erased? In kinship, all share the same bond. Relying on the golden tablet to emerge from the dark path and following the jade tally to open the road of life, he devoutly presents this pure offering, reverently answering the great favor.\n\nMay the Three Blacks stream forth their radiance, and the Primordial Qi initiate its course. All things return to their origin, and the Supreme Ultimate divides the heavens. Light emerges from obscurity, nurturing the Central Land. Inscribed in the heart, desires are fulfilled; virtue is cultivated to repay kindness.\n\n---\n\n**Petition by Sun Zhen to Invoke the Host of Former Worthies**\n\nHow can one repay distant ancestors? The source of education must not be obscured. To deliver the departed from darkness and raise them to transcendence, where else can hope be placed? With a heart of sincerest devotion, he reverently invokes the Three Treasures.\n\nReflecting on his late master, in life he was upright, and in death, he harbored no regrets. Yet human affairs are never uniform, and praise or blame is hard to reconcile in the mouths of many. The world is full of falsehoods, and the true heart may be obscured. Fearing his own shortcomings, he follows his humble sincerity and makes this request. Thus, he establishes the mysterious model, adorning the jade altar with purity.\n\nMay the teachings he revered and the true master of the Dao shine forth, their jade script resplendent, illuminating the gates of the Ten Grounds. May the jade chariot linger, descending from the Nine Heavens’ procession. Gazing upward, he awaits the beginning, his hope boundless.\n\n---\n\n**Three-Day Petition**\n\nRising early, he divines the day to pray for the transcendence of his departed kin. Vigilant at dusk, he serves Heaven with a heart of utmost reverence. At dawn, he conducts himself with care, for the imperial realm is pure and lofty. The master’s legacy must not fade among later generations, for the Dao’s function does not stray from a single thing. Relying on good fortune and blessings, he guides the dark journey. The golden tablet communicates with the divine, directly pointing to the land of carefree wandering. The cinnabar terrace heeds the command, joining the journey through the heavens of purity and stillness.\n\n---\n\n**Main Petition**\n\nThe transmission of learning depends on the master; none can fathom the depths of the Nine Springs. The Way of generating spirits reopens the beginning of the Supreme Ultimate. How could he forget the great creation that bends to perfect all things?\n\nReflecting on his late master, illusion gives rise to karmic fruit, for emptiness itself bears no blossoms. Gazing upon the vast and boundless sea of darkness, how could he transcend it? Yet through the expedient means of the mysterious rites, he finds a place of reliance. Gathering the departed spirits to bestow kindness and delivering suffering souls to universal salvation, the myriad knots are untied, and the three karmic roots are severed. In repayment of kindness, he offers the reverence of fragrant herbs; in observance of ritual, he pours forth the devotion of the sunflower.\n\nMay the divine lords deign to receive his offering, their boundless grace flowing everywhere. Dharmakāya and saṃbhogakāya alike point to the path of emptiness. The Dao of Heaven and the Dao of humanity converge as the return to purity and stillness. May the blessings he receives extend to his descendants, who will forever bear them in gratitude.\n\n---\n\n**Zhang Guoxiang’s Petition for His Father on the Final Seventh Day**\n\nWithout a father, what can a child rely upon? Alas, as a son, he has little to depend on. He laments that Heaven is too high, and the debt to his parents too great to repay. The seventh day has come to an end, and the dew-like offerings are made again and again.\n\nReflecting on his late father, he navigated the world with a long heart but plotted his life with poor skill. His toils were like a dream, and he longed to avoid faults but could not. Now, with rites to guide the dead, how could his orphaned son dare to lag behind? He purifies his humble abode to petition the divine and announces his plea on the dragon tablet to proclaim grace. With respect, he performs the muddy and impure rites, presenting the pure offering.\n\nMay the boundless benevolence extend everywhere, and the great creation embrace all. In response to his earnest devotion to distant ancestors, may the path of salvation for all beings be broadened. The Great Void stretches endlessly, the divine without trace. The long night is vast, yet the path of renewal is shown.\n\n---\n\n**Zhang Wushan’s Petition for the Return and Protection of His Daughter**\n\nIllness is a shared concern, whether for daughter or son. No virtue goes unrequited, and no one dares defy Heaven. His foolish wish has been fulfilled, and he dares not betray the goodness of their original vow.\n\nReflecting on his daughter, her blood stagnated in her *qi*, and her milk congealed into paralysis. With a heart desperate for divine aid and blessings, he prayed she might not die. Bowing in gratitude for the gift of deliverance from suffering and the elimination of disaster, he rejoiced in her rebirth. Now that her fate is settled in a harmonious home, the debt of the offering remains recorded. Thus, he purifies the dusty hall and solemnly prepares the wind-borne chariot.\n\nMay clouds gather to bestow great fortune, and stars align to open the Yellow Road. May joy fill the gates, and the spring deepen the delight of the daughter’s chamber. May the house’s prosperity be fulfilled, swiftly meeting the hopes of the family. May all affairs proceed smoothly, and both virtues shine together.\n\n---\n\n**Zhang Zijiang’s Petition for the Return of the Jade Terrace’s Wet Nurse**\n\nThe pain of illness is unbearable, and none can replace the sorrow of a mother’s chamber.\n\n**Zhang Zijiang’s Petition for the Return of the Jade Terrace’s Wet Nurse (continued)**\n\nWith steadfast heart, I offer prayers, trusting in the golden palace’s benevolence. The sacred edicts hold no other decree, and the efficacy of the healing rites has its source. Though my prostrations number ten thousand, what benefit do they bring to the vast heavens? Yet the divine ear is not so lofty as to be deaf to the humblest earth—thus, I humbly fulfill my vow through these rites, reverently storing the offerings within the sacred altar. Though the waters of the moat be but a drop, the Celestial Capital is not far. May the Emperor’s heart, ever discerning, grant the extension of my mother’s years.\n\nMay the warmth of beans and water repay the spring radiance of my parents’ shared old age; may the late-blooming daylily of her twilight years flourish with a hundred blessings. How could I repay such grace? Dare I forget the cultivation of virtue?\n\n**Prayer for the Return of the Mountain Mother’s Rites**\nTo honor one’s kin is to honor the aged; joy and sorrow are rightly shared. The Dao that can be spoken is not the eternal Dao; the name that can be named is not the eternal name. Yet in the sincerity of my devotion, no barrier stands. Relying on heaven’s compliance with my desire, I prostrate myself in gratitude.\n\nRecalling how my maternal mother, so-and-so, fell gravely ill, her condition as precarious as a single hair, I hastened to her bedside, fearing the day’s end would come too soon. Before I could reach her door, I cried out to heaven mid-journey. My filial heart’s wish was granted, and the Emperor’s virtue daily renewed. Dare I break my vow? Thus, I present these rites with reverence.\n\nMay her life be lengthened by the precious calendar, her years guided by the turning jade. May the daylily in the hall endure the spring’s light without aging; may the peach and plum within the gate thrive in her lingering shade. May she forever bear the weight of heaven’s grace, and may her blessings overflow like jade’s luster.\n\n**Huangzhu Pavilion’s Director’s Prayer for the Seventieth Anniversary Rites**\nThe great hall’s pillars and beams rest upon a single steward; the seventieth year of life is a cause for celebration. In the reverence of this blessed land, I offer prayers for heavenly aid with utmost sincerity. May the Emperor’s will align with my deepest wish. May the days and months within the gourd preserve an ageless spring; may the mountains and rivers beyond the cauldron share the boundless flavor of the Dao.\n\n**Petition for the Sevenfold Rites of Protection and Peace**\nTo trespass thrice is forbidden, yet I beg sevenfold grace; to honor the One, I devote my whole heart to repaying my vow. Entrusting my green missive, I convey my sincerity to the vermilion steps.\n\nRecalling my service in the mountains and forests, how could heaven and earth not favor me? Yet reflecting on my past conduct, I see unfulfilled vows and broken promises. Now, as I strive to continue, I tremble at the weight of my failings—how can I justify them? Though the responsibilities of my office differ, my heart in serving the public good remains the same. How could the gods betray me? The Dao knows no division. Thus, I offer these rites in gratitude, praying the gods will see my sincerity and pardon my transgressions.\n\nMay the great creation show forbearance, and may the assembled immortals accept my offerings. May past faults be absolved, and future blessings secured; the days ahead are long. May I dwell in a blessed land, delight in a pure era, and submit to heaven’s decree.\n\n**Collective Prayer for So-and-so’s Protection**\nWhen illness strikes, one calls for their parents—who else could bring such urgency? The wellspring of immortality flows from our ancestors; thus, we gather to make this plea.\n\nSo-and-so of the Lü clan, born with a delicate frame amid the radiance of the womb, has dwelled in seclusion, lacking proper care. A minor ailment has arisen, giving cause for distant concern. Looking upward, I trace the source of my lineage—how could I forsake the grace of my teachers and heaven’s favor for posterity? Yet if I turn my gaze to the sustenance of life, I find the means to ensure daily peace. To seek aid from without is folly; my utmost reverence remains unadorned.\n\n**Supplication for Divine Favor**\nMay the offerings ascend in perfect sincerity, and the sacred words descend in gracious bestowal. As mugwort’s fragrance rises beyond the well, may the marvels of divine medicine swiftly manifest; as orchids bloom in the courtyard, may the joy of flourishing descendants soon be seen. The cosmic order endures, and this inscription shall never fade.\n\n**Memorial for the Completion of the Three Pure Ones Hall at Mount Wu, Presented by Master Wu in Winter of Bingyin**\nHeaven and ancestors bear the weight of succession; the people and the state demand enduring protection. Thus, we ascend this sacred mountain to honor the newly established imperial shrine, offering solemn rites to convey the nation’s distant reverence. We dispatch celestial envoys to reverently prepare the jade altar. Illuminating its rituals, illuminating its scriptures, we maintain solemnity in our observances. Though unseen in heaven, unseen on earth, we present our supplications in words.\n\n**Morning Audience Prayer**\nWith utmost sincerity, we perform the rites without fail. Seeking to stabilize the great foundation, we offer prayers day and night. When the qi of heaven’s vastness flows in harmony, the work of cosmic assistance endures. Cultivating virtue to align with heaven, we offer devotion wherever we dwell. As the primordial unity is preserved, the seasons manifest their cyclical passage; as the three realms commune in trust, the greatness of the Dao’s origin endures through time.\n\n**Midday Audience Prayer**\nAs yang energy revives in the six conduits, we measure the nation’s governance by its ordered signs. As the nine celestial gates open to the day, we pray for the state’s foundation to thrive in prosperity. For the people embody the heart of the two poles, while the ruler bears the sole responsibility of establishing destiny. Through abundant rites, we receive unobstructed illumination. May the four seas remain eternally pure, firmly securing the golden vessel of the realm; may the three seasons bring no harm, perpetuating the harmony of the jade candle.\n\n**Evening Audience Prayer**\nHeaven entrusts the household, and self-cultivation is its foundation. Day by day, we uphold reverence, following the Dao in our conduct. Preserving the night’s qi, we present our words; observing the evening rites, we face the divine. Without a sovereign, whom would we serve? The Emperor alone considers these matters. When the inner palace is harmonized, may lasting peace govern within; when the ancestral branches flourish in obedience, may former achievements be gloriously extended.\n\n**Primary Offering Prayer**\nWith humble diligence, we seek governance, and the effects of harmony are thus achieved. With unified virtue, we move the spirits, and our reverent devotion dares not lag behind. As the sacred precinct is completed under imperial rule, we, the ritual officers, present our many offerings. The clarity of Qian’s pattern demands balance; where earthly forces falter, we must seek their cause. How shall we guide the people toward flourishing harmony? How shall we bring peace to all within and beyond? The state’s principles are established—we contemplate crossing the abyss to deliver aid. Daily, we perceive the signs of the times, for heaven’s assistance lies in following its will. The unicorn’s hooves respond to the season, as we reflect on the Dao of jade-like perfection. Vast blessings flow in ceaseless grace, ever dependent on the turning of heaven’s benevolence. As the primal qi returns to its source, the image of great peace emerges.\n\n**Prayer for the Bingmao Spring Protection Rites**\nThough dwelling in a blessed land, we remain ever mindful of distant concerns. Under the sheltering clouds of heaven, we rely truly on the divine. How could we forget the time for vigilance against complacency, especially now, as the dragonflies gather and the fast begins? Like sunflowers turning to the light, we beseech the mandate; with refined offerings, we pray for grace. May the Lord of Waters take pity on our sincerity and grant eternal stability. May all remain peaceful, and the depths of the abyss prove indelible.\n\n**Preemptive Rites for the Receding Tides, Presented by the Celestial Master**\nThe provincial authorities, troubled by the tides, dispatched urgent orders. My household, humble as flowing water, follows ancestral teachings in preparation. My heart adheres solely to the Dao—without heaven’s aid, how could these matters succeed? We preemptively present the pure rites, humbly beseeching vast favor. As the radiant mandate is proclaimed, we pray for the swift pacification of sea monsters. As the winds of teaching spread, may the sand barriers of old be restored. May the people’s resolve be strengthened, and the state’s foundation eternally secured.\n\n**Memorial for the Yellow Register Rites of Wuchen Year, Presented by the Celestial Master**\nWe specially inaugurate the yellow altar, adhering to the celestial and terrestrial regulations. From the cinnabar repository, we present offerings to fulfill the vows of three generations and one family. Though our transgressions are few, our faith has been wanting; though we pledge reform, we still confront past errors. Yet in clarity, we find tolerance; in the unseen, we place our trust. May the Dao ever respond with goodness, turning the mechanisms of transformation within the celestial patterns. Though the sage remains beyond comprehension, may the qi of spirits and humans commune beyond the heavens. May we perceive the dawn and foresee events before they unfold.\n\n**First Day, Morning Audience Prayer for the Sovereign**\nWith loyal sincerity, we answer heaven, upholding the weighty rites of the fast. At dawn’s clarity, we meticulously observe the initial audience’s ceremonies. We dare not invoke divine power for private ends but first offer our assistance in repaying heaven’s grace. May the gates of the celestial palace open at dawn, the sun warm the banners, and the treasures of heaven and earth harmonize, revealing the governance of tranquil rule. May the hearts of heaven and the people rejoice, singing the songs of disarmed peace.\n\n**Midday Audience Prayer for the Ministers**\nIn answering heaven’s will, we fulfill the duties of descendants and ministers. Looking down, we stabilize the state’s foundation; through generations of good governance, ministers prove worthy. Presenting our daytime devotion to the true, we proclaim the urgent hopes of the times. May auspicious clouds support the sun, and the cold valleys exhale spring. May the jade candle align with the seasons, its harmony never straying from perfect balance. May the golden cauldron fortify the foundation, all within the realm of nurturing transformation.\n\n**Evening Audience Prayer for All Under Heaven**\nWith evening devotion, we present our pure words. Having long followed the teachings, we prioritize the people’s well-being. We dare not hastily voice private requests but first hope for the welfare of all living beings. May the sun rise from the dark valley, and auspicious stars shine forth. May the Emperor pity his children, and spring’s warmth return to the cold grass and trees. May heaven turn its vast potter’s wheel, and the sun lend its warmth to the twilight years.\n\n**Second Day, Early Dawn Prayer for the Lonely Souls**\nAt the dim light of dawn, we face the origin; as the sun emerges, rain glistens at daybreak. Beneath the great brightness, profound insight merges. Who pities the wandering souls with no return? Who can pull them from the sea of delusion? Only the Dao of the sacred rites offers this path—such is the Supreme Emperor’s utmost benevolence. May the sun of wisdom rise with the morning, and the divine wind arrive at dawn. Kan receives Wu, Li receives Ji—thus fire descends as water ascends. Qian provides the beginning, Kun nurtures life—thus heaven encompasses and earth fosters.\n\n**Midday Prayer for the Primary Offering**\nAs the sun’s auspice reaches its zenith again, why should our morning prayers be incessant? Heaven watches from above—how dare we seek blessings in obscurity? We especially honor the departed kin of this household, who initiated the tenfold Dao of salvation. The jade texts bear witness; the golden tablets hold no partiality. May their refined essences depart from brightness, advancing beyond the spirit journey. May ancestors bless their descendants, upholding the lineage of the mysterious province. Though women too may attain immortality, they remain bound to the registers of change.\n\n**Evening Prayer for Ancestral Offerings**\nThis servant divines the night—immortals of noble rank transmit their texts, while mortals hold to the common saying: \"Benevolence resides in boundless love.\" Gazing upon the departed, whether kin or stranger, where have their spirits and souls gone? A single gesture toward emptiness, all return to purity. May the moon’s wisdom-light illumine them, their awakened nature attuned to heaven. Illusory bodies are no bodies—let them grasp the radiant root of spirit. Formless yet born of form, may they transcend the constancy of night and day.\n\n**Third-Day Morning Prayer for the Teaching**\nThe sun’s rays strike the golden gate; thrice we behold the crimson clouds of dawn. Dew arrays the jade throne; once we petition the mysterious workings of spring. Guarding the teachings entrusted to us, we tremble as duty demands vigilance with the seasons. Admonishing one another in reverence, we speak with trembling awe. May we abide in obscurity yet shine, cleave to light without losing it. May the true source be upheld, the learning of cap and gown unbroken. May fresh grace descend like imperial edicts, and the lineage of hemp and silk grow ever greater.\n\n**Midday Prayer for the Master’s Gate and Palace Gate**\nA thousand years of ancestral teachings sustain the blessed land where rites are offered. The *Book of Changes*’ human culture arrays the proper positions of the household. Linked in hidden sorrow, all equally seek peace. Thrice we present our morning prayers to the clouds, heeding the returning spring as we gather records. May the sky’s light shine bright, clouds and thunder unite in harmony. May the fragrant flames of devotion burn ever high, grace flowing from above. May the branches of the lineage flourish in order, with blessings at their heart.\n\n**Evening Prayer for Heirs**\nLong have we called to heaven, hoping the mysterious lineage might find a trust. Yet all day we stand in dread—why has our earnest wish not been fulfilled? Perhaps it stems from what past lives have summoned, or what this humble self has brought upon itself. Could it be lawsuits over tombs, or some hidden curse? As this audience draws to a close, we dare lay bare our plea. May the perfected ones grant amnesty, washing away ten thousand sins to dispel hardship. May the ninefold qi wondrously coalesce, ushering the return of the single yang.\n\n**Prayer to August Heaven**\nHeaven’s records bear witness to the ancient yellow threads of covenant; dew-like sincerity is secretly offered, along with this servant’s crimson heart of devotion. We answer delayed blessings, lay bare our feelings, and await fate’s decree. We recall our youth, lost and adrift, trembling as if cast into peril. Half a lifetime’s earnest intent remains unfulfilled, while a single thread of posterity’s sorrow weighs heavily. Though parents are gone, their wishes endure; we examine ourselves and know this in our hearts. Circumstances linger, yet silently we trace the cause. The divine hosts stand in solemn array—how could retribution be unrelated? If we were to consume these words again, what punishment could we refuse? A thousand transgressions we repent; three petitions we offer as one. May you graciously pardon all without omission, deign to grant what we rely upon. The Emperor’s boundless love sustains all things in their becoming; this servant dares not speak further, yet secretly harbors this offering in the heart. One day, we shall know gratitude and repay heaven’s accumulated goodness.\n\n**Prayer to the Three Heavens**\nUrgent is our cry to heaven—can words be cast aside and trust abandoned? Auspiciously we divined the day to repay blessings with fasting rites. May kindness extend to the manifest and hidden, may scrutiny reach the subtle and concealed. Where there is completion, there is response; where there is goodness, there is no refusal. We aspire to summon blessings, vowing to broaden our practice of hidden virtue. Grant us our wishes, and we dare not extinguish the good within our hearts.\n\n**Prayer to the Eastern Pole**\nThe sacred statutes were first established to fulfill past vows. Ascending together with the departed luminaries, we bow to the renewed mandate. The sagely work is impartial; the human Dao is reborn. The borrowed radiance of auspicious light is no private favor; the vitality of life flows without trace. Siblings share alike, each according to their measure, long or short. Each has its own form and appearance—what intent did creation ever hold?\n\n**Prayer to the Earth, Southern Pole, Northern Pole, and Nine Dark Realms**\nThe Emperor’s fasting rites rescue those who wander the long night. This servant, with a foolish heart, answers the vows of former times. The Dao encompasses all norms; grace reaches the nine springs. Only by aiding the dead can one extend life; only by delivering the hidden can one bring fortune. May goodness spread without limit, all ascending to the lofty vermilion palace. May wishes be inevitably fulfilled, awaiting but the turning of the great potter’s wheel.\n\n*End of the Second Scroll of the Record of Gathered Goodness*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "萃善录 经名：莘善录。 原不题撰人，约出矜明代。 二卷。 底本出处：《正统道藏》洞神部表奏类。 萃善录卷上 圣节祝君之词 圣人生焉，瑞远紫枢之电； 上帝临汝，喜开黄道之云。 斋肃陈词，明晨有请。 伏念新传祖印，远觐宸廷，香颁龙虎之坛，亲承上旨； 寿祝麒麟之殿，未遂南辕。 命玄倡以修斋，对威颜而归美。 恭愿绿章夜达，来仙仗於清都； 丹宸春融，永丕基之洪福。 谢雨词 布地为坛，土皆作玉，望云请命，天乃雨珠，生意顿回，元功不宰。 伏念自名以道，待饱於农，凡仰愧俯作之余，有春作秋祈之望，属以亢早，异於曩时。 既自郊而祖官，祷之久矣； 庶匪朝而依夕，苗则勃然。 盖移粟之民已疲，倘荐饥则岁何仰，不违咫尺，遂俾雾霜，返神水以安灵，荐演污而报本。 伏愿赐之终惠，保此有年，自三日已往为霖，更溥余波之润，无一夫不被其泽，同为乐国之归。 天师在京就山还醮 君命不俟驾，阻瞻咫尺之清光； 皇天无私亲，妙运两问之元化。 敬缄香於帝里，归奏牍於宗坛。 伏念庆藉世资，叨传祖印，言尤行悔，顾教法以多违； 家难命奇，致灾非之荐见。 幸际龙飞之治，迷为驿传之朝，孰谓微愈，竟淹半载，思切宸旎之宠对，聿严灵宝之斋修，谢过消灾，祈恩请命。 伏愿帝心简在，人欲必从，鉴其悔艾之私，锡以生成之造，真风赫奕，日深丹扆之知； 新渥骈蕃，露重紫泥之赐。 凡存志命，悉宥恩庥。 酬攘火醮词 庚午年昊皆春梦，见崇禧厅前有一物，又遇竹轩魂归，乃云其房当有火灾，久轩遂许醮获安。 梦而占梦，同知幻境之无凭，疑以传疑，敢忽前车而不戒，昔焉徽福，今也酬恩，伏念求木苟完，寝薪是惧，彼蝶化之纷纭莫诘，闻者隐忧； 况鹿隍之失得或然，慎之为贵。 乃以恍惚杳冥之故，而为和平安静之求，帝示矜容，人思报称。 伏愿初盟克践，终惠允谐，曷日而忘，永戴风雨拼蒙之造，惟天所命，密符祖宗香火之心，德布春阳，恩沾莫景。 天师庆成藏殿醮词 道机无息，乃眷殊庭，法藏聿新，寔依玄造，爰庆成於一醮，庸吁告於群真。 伏念切已兴思，批躬省过，或以前因而今受，或谓寡是以多非，或下情宿怨而罔知，或阴隐可为而自失，或命身之位与孤曜以相逢，或嗣息之宫背吉星而不照，乖违至此、忏释何由。 谓宝藏经营，信斡旋之有地，况真斿森列，可运转以回天，幸人巧之成功，希圣明之从欲，肃陈凡捆，恪露中诚。 伏愿霁仰威颜，春生容德，造化无停轮之理，变通於转毂之问，八卦凝神，见乾坤之六子，三阳发秀，回否泰於一时，锡命在天，俟恩即日。 吴惟德荐母 客途天远，空驰游子之心，乡岫云停，不见慈亲之面，俯遵玄教，仰叩清都，伏念浅矣学仙，阙焉事母，将谓转蓬苟得，尚酬菽水之欢，岂期泛梗言还，遽洒莱衣之血。 揆一子出家而奚益，幸十方救苦之不诬，愍日适临，冲科特启。 伏愿珠浮狮坐，玉揉龙章，蓬岛回车，唤醒虚无之梦，桃池侍宴，容登快乐之乡，魂气有归，后昆允赖。 建九幽正醮词 物莫预知，痛先臣之弃背，情恶可已，祈上帝以超升，言不成文，泣尽继血。 伏念父吴霜未老，燕璞何仇。 孰谓无牙，而蕴至深之毒，乃伤其指，竟罹罔极之忧。",
      "translated_text": "**Collected Auspicious Records**\n*Sutra Title:* *Collected Auspicious Records*. Author unknown, approximately dating to the Ming dynasty. Two scrolls.\n*Source of Base Text:* *Daoist Canon of the Zhengtong Era*, *Comprehensive Section*, *Memorials and Memorial Presentations*.\n\n---\n\n### **Collected Auspicious Records, Scroll One**\n\n#### **Prayer for the Sovereign’s Birthday**\nThe Sage is born—auspicious lightning flashes from the purple pivot of the North Star;\nThe August Lord descends upon you—joyous clouds part along the Yellow Dao.\nWith reverent solemnity, we present our words; at dawn’s first light, we make our plea.\n\nWe humbly recall that the ancestral seal has been newly transmitted, and we have journeyed afar to behold the imperial court. Fragrant incense was bestowed upon the Dragon-Tiger Altar, where we received the Supreme Decree in person. Yet in the Hall of the Qilin, where we would offer birthday felicitations, we have not yet turned our carriage southward. Thus, we command the masters of the Mystery to perform the purification rites, that we may face Your August Countenance and return due praise.\n\nWe devoutly pray that the green missive may ascend by night, summoning the immortal host from the Pure Capital; that the vermilion palace may bask in vernal warmth, and Your Majesty’s great foundation of blessings endure forever.\n\n#### **Prayer for Rain**\nThe earth is spread as an altar, and the soil becomes jade;\nGazing at the clouds, we beseech the mandate of Heaven, and it rains pearls.\nLife’s vitality is swiftly restored, yet the Primal Work claims no credit.\n\nWe humbly recall that since we took the name of the Dao, we have awaited the farmer’s fullness. In all our labors, from dawn’s toil to dusk’s rest, we have cherished the hope of spring planting and autumn harvest. Yet this year, severe drought has struck, unlike times past. From the suburban altars to the ancestral temples, we have prayed long; would that the seedlings might flourish by morning or evening! But the people, burdened by grain transport, grow weary. Should famine descend, how shall the year be sustained? Though the divine response was not distant, frost and mist arose instead. We return the numinous waters to pacify the spirits, and offer libations to repay the root.\n\nWe devoutly pray that Your bounty may be bestowed in full, preserving these years of plenty. From the third day onward, let the rains become a deluge, their beneficent waves spreading ever wider. May no one fail to receive its grace, and all alike return to the land of joy.\n\n#### **Prayer for the Celestial Master’s Return from the Capital to the Mountain**\nThe Sovereign’s command brooks no delay in departure;\nYet we are barred from gazing upon the limpid light, though it lies but a footstep away.\nAugust Heaven shows no partiality, its wondrous workings unfolding in both inquiries of the Mystery.\n\nWith reverence, we seal incense in the imperial capital and return to present our memorial at the ancestral altar. We humbly recall that our blessings derive from hereditary endowment, and we have presumptuously inherited the ancestral seal. Yet our words and deeds are fraught with remorse, and we have often transgressed the teachings. Family misfortune and fate’s perversity have brought repeated calamities. Fortunate to live in an era of dragon-soaring governance, we have been summoned to court by post-horse relay. Who would have thought that a minor recovery would stretch into half a year’s confinement? Longing for the imperial favor of an audience, we have strictly observed the purification rites of the Numinous Treasure, seeking to repent our faults and dispel disaster, to pray for grace and beseech the mandate.\n\nWe devoutly pray that the imperial heart may hold us in esteem, and human desires be fulfilled. May it perceive our private repentance and bestow the gift of life’s creation. May the true wind blaze resplendent, deepening the vermilion screen’s favor; may new blessings abound, and the purple-sealed decrees fall like heavy dew. May all who cherish their destiny be encompassed by Your grace and protection.\n\n#### **Prayer of Thanksgiving for the Fire-Averting Rites**\nIn the *gengwu* year, a dream in the spring of the vast heavens:\nBefore the Hall of August Felicity, an apparition appeared. Then, at the Bamboo Pavilion, a soul returned, declaring that its chamber would suffer fire. The Pavilion’s master, moved by long-standing concern, vowed to perform the rites, and peace was restored.\n\nDreams are interpreted as dreams, for ephemeral visions hold no certainty. Yet to doubt is to transmit doubt—how dare we ignore the lessons of the past? In former times, we sought blessings; now, we repay kindness. We humbly recall that if one seeks the preservation of even a single tree, one must fear sleeping upon kindling. The transformations of butterflies are too myriad to fathom, and those who hear of them harbor hidden worries. How much more so the uncertainties of deer and moats, where loss and gain may hinge on chance? Caution is paramount. Thus, on account of these dim and inscrutable omens, we have sought peace and tranquility. The August Lord has shown compassion, and we yearn to repay His favor.\n\nWe devoutly pray that the initial covenant may be fulfilled, and the final grace be granted in harmony. How could we ever forget? May we forever bear the gift of wind and rain’s protective grace. As Heaven commands, may it secretly align with the hearts of our ancestors and the incense fires of our lineage. May virtue spread like spring’s sunlight, and grace bathe the boundless expanse.\n\n#### **Prayer for the Celestial Master’s Rites of Thanksgiving for the Completion of the Canon Hall**\nThe Dao’s mechanism knows no rest, and thus it gazes upon the extraordinary court.\nThe Dharma Treasury is newly completed, truly dependent upon the Mystery’s creation.\nThus, we celebrate with a single rite and beseech the host of perfected beings.\n\nWe humbly recall that we have turned our thoughts inward, examining ourselves and reflecting on our faults. Some arise from past causes bearing present effects; others stem from our own inadequacies, which invite manifold errors. Some grievances of the heart remain unrecognized; some hidden transgressions go uncorrected. Some, by fate’s station, encounter solitary stars; others, in the palace of descendants, turn their backs on auspicious constellations. Such deviations have brought us to this pass—how may we repent and be absolved?\n\nWe declare that the construction of the precious canon is a testament to the efficacy of divine intervention. Moreover, the banners of the perfected stand in solemn array, capable of turning the heavens through their revolutions. Fortunate in human skill’s accomplishment, we aspire to the sagely brilliance that fulfills desires. With solemnity, we present our humble offerings, reverently revealing our sincerity.\n\nWe devoutly pray that Your August Countenance may shine with clemency, and spring’s vitality arise in Your virtue. The workings of creation know no pause, transforming and communicating in the turning of a wheel. The Eight Trigrams congeal the spirit, revealing the six children of Heaven and Earth. The three yang forces burst forth in splendor, reversing adversity and prosperity in a single moment. The mandate is bestowed by Heaven; we await grace this very day.\n\n#### **Wu Weide’s Prayer for His Deceased Mother**\nOn the road as a traveler, the sky seems distant, and the wanderer’s heart races in vain.\nAt home, the clouds linger over the mountain peaks, yet the face of my compassionate mother remains unseen.\nI bow to the Mystery’s teachings and knock at the gates of the Pure Capital.\n\nI humbly recall that my studies in immortality were shallow, and my service to my mother was lacking. I had thought that, like a tumbleweed, I might yet return to repay the joy of beans and water. Who could have foreseen that, like drifting duckweed, I would return only to shed tears upon the *lai* robes? What benefit is there in a single son leaving the household? Yet the ten directions’ deliverance from suffering is no falsehood. As the day of mourning arrives, I humbly initiate this special rite.\n\nWe devoutly pray that pearls may float upon the lion throne, and jade be kneaded into the dragon script. May the carriage return from Penglai, awakening her from the dream of emptiness; may she attend the banquet by the Peach Pool, ascending to the realm of bliss. May her soul and spirit find their way, and her descendants be truly blessed.\n\n#### **Prayer for the Establishment of the Rites for the Nine Dark Realms**\nNo being can foresee the future—grief strikes as a minister is torn away.\nYet this sorrow cannot be stilled, so we beseech the August Lord to grant ascension.\nOur words fail, and our tears of blood flow unceasingly.\n\nWe humbly recall that our father’s frost-white hair came too soon, and the jade-like purity of the swallow—what enmity did it bear? Who would have thought that, though toothless, it harbored such deep venom? A mere injury to the finger has brought immeasurable sorrow.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1252,
      "start_sentence": 0,
      "end_sentence": 50,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 49.43932890892029,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\表奏类\\萃善录.txt",
        "category": "表奏类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "岂其遗胤之不夭，抑亦患身之有数，丹心耿耿，不能呜没世之悲，玄范恢恢，庶以慰重泉之望，涧芹可荐，鉴藻无私，伏愿开解脱门，指虚无路，宿冤冰释，益喉敢起於妄心，逝魄云升，炼质全资於善果，率行正道，惠迪后人。 仙姑荐父母 父何估，母何恃，嗟永隔於归宁； 乾资始，坤资生，冀重开於化育。 三黛请命，九拜投诚。 伏念季女有归，二亲莫赎，谢焉供杞，赞善教以利人； 惕若奉先，愧近功而抚己。 蒿目拨感时之泪，草心萌追远之思，明水具陈，恩波允赖。 伏愿大钧无息，至鉴有容，地道阳光，超桩萱之朽质，人元合妙，副葵蕾之私情。 周年建醮荐母 母兮鞠我，寥义之痛无穷； 期而小祥，白驹之过何速，惟据哀素，上彻穹苍。 伏念某自罹陆妃之悲，忍见星周之次，念升沉之莫测，幸坺度之有科，谨洁尘居，肃迎飓驭。 伏愿云开黄道，风送绿章，诏三界以逍遥，拥万真之来下，慈光远被，庸昭观盥之诚，明日将朝，不尽童蒙之渎。 孙秋碧就普度酬所许保安就荐先师祖卢自间 追想前猷，愿有盟而必答； 寓诚普度，思如在以宜超，敢食前言，辄干上听。",
      "translated_text": "Would it be that his descendants avoid untimely fate, or is it rather that his own life was bound by destiny? His loyal heart, ever radiant, cannot silence the sorrow of this world; his noble example, vast and enduring, may yet console the hopes of those beneath the Yellow Springs. Though humble water-cress may be offered, the mirror of the gods remains impartial. We humbly beseech the opening of the Gate of Liberation, that the path to the Void be revealed, ancient grievances melt like ice, and no reckless thoughts arise from delusion. May the departed soul ascend like clouds, its essence refined through the fruit of goodness, and may it follow the true Dao, guiding posterity by its virtue.\n\n**Prayer by the Immortal Maiden for Her Parents**\nFather, what shall I rely upon? Mother, whom shall I depend on? Alas, the eternal separation from those to whom I return. Heaven provides the beginning, Earth nurtures life—may the work of creation begin anew. With three bows of dark jade, nine prostrations of utmost sincerity, we beseech.\n\nWe recall that though the youngest daughter has found her place, her parents cannot be redeemed. In gratitude, she offers sacrifices and praises their virtuous teachings, which benefit others; in vigilance, she honors their memory, ashamed of her own meager deeds. Her eyes, like mugwort, shed tears for the times; her heart, like grass, stirs with thoughts of remembrance. The bright water is set forth in full, and the grace of the divine waves is truly relied upon.\n\nWe humbly pray that the Great Potter’s wheel never ceases, that the All-Seeing Mirror shows mercy. May the light of Earth’s Dao and the radiance of Yang revive the withered form of the mother-plant; may the harmony of human destiny and the mysterious unite to fulfill the private longings of the sunflower and bud.\n\n**Annual Prayer for the Establishment of the Rites to Honor the Mother**\nO Mother, who nurtured me—how endless is the pain of parting! The first anniversary of mourning has come, yet the passage of time, swift as a white colt, offers no respite. Clad in mourning white, my grief ascends to the vault of heaven.\n\nWe recall that since suffering the sorrow of Lady Lu’s fate, I have endured the return of the stars to their stations. Contemplating the unfathomable rise and fall of life, I take solace in the rites of deliverance. With reverence, I purify my dwelling and solemnly welcome the divine chariot.\n\nWe humbly pray that clouds part to reveal the Yellow Dao, that winds carry the green petition. May the decree summon the Three Realms to carefree wandering, and the myriad immortals descend in attendance. May her compassionate light reach far, illuminating the sincerity of my observance; may the dawn of tomorrow’s audience leave no childish plea unanswered.\n\n**Sun Qiubi’s Prayer for Universal Deliverance to Fulfill His Vow and Honor His Late Master and Ancestor Lu Zijian**\nRecalling his former guidance, I vow that if a promise is made, it must be kept. In this act of universal deliverance, I think of him as if he were present, that he may fittingly ascend. Daring not to renege on my word, I venture to address the celestial hearing.",
      "overlap_context": " Dark Realms**\nNo being can foresee the future—grief strikes as a minister is torn away.\nYet this sorrow cannot be stilled, so we beseech the August Lord to grant ascension.\nOur words fail, and our tears of blood flow unceasingly.\n\nWe humbly recall that our father’s frost-white hair came too soon, and the jade-like purity of the swallow—what enmity did it bear? Who would have thought that, though toothless, it harbored such deep venom? A mere injury to the finger has brought immeasurable sorrow.",
      "start_char": 1252,
      "end_char": 1697,
      "start_sentence": 51,
      "end_sentence": 67,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.744986057281494,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\表奏类\\萃善录.txt",
        "category": "表奏类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "伏念有身为患，厥疾弗廖，急告于天，犹幸苟延於一醮，回生无地，忽惊已过於七年，逝者远而许者存，心所知即神所记，谠焉报既，期以出幽。 伏愿大道有情，至真无外，指蓬莱路，或从织女而归，入黍米中，同会天人之乐，周圆功果，启迪仍昆。 陈制帅黄镍宿启词 绿林戢盗，熟小麦以休师； 皂岭巢仙，洁菁茅而事帝，科严修於玉匮，事宿阐於瑶坛。 伏念谬以抚绥，任兹讨捕，谓人为天地之贵，何忍残生； 若贼遗君父之忧，是名负国。 爰亲从於士卒，偶活致於渠魁，虽幸凯还，能无滥杀，报风声鹤唳之助，见莠除苗长之仁。 伏愿旋斡雍熙，销沈乖熬。 兵凶器，用非得已，壹空白骨之冤； 利公家，知无不为，洞鉴丹心之素。 三朝词",
      "translated_text": "We recall that bodily affliction brought suffering, and the illness showed no remission. In haste, we appealed to Heaven, and by grace were granted a temporary reprieve through a single offering. Yet with no ground left for revival, we suddenly realize seven years have already passed. Though the departed are distant, the promises made remain; what the heart knows, the spirits record. Thus, we earnestly fulfill our vow, hoping to emerge from darkness.\n\nWe humbly pray that the Great Dao, ever compassionate, and the Perfect Truth, boundless in scope, may point the way to Penglai’s path—perhaps returning by the Weaving Maiden’s route—or enter the grain of millet to partake in the joy of celestial beings. May the merit of this round completion enlighten both the living and the departed.\n\n**Chen Zhishuai Huang Nie’s Memorial Prayer**\n\nIn the Green Forest, bandits were quelled, and ripe wheat allowed the troops to rest. On Black Ridge, immortals nested, and sacred thatch was purified for the Emperor’s rites. The jade caskets’ statutes were strictly observed, and the jade altar’s ancient ceremonies solemnly performed.\n\nWe recall that, though unworthy, we were entrusted with pacification and suppression. We held that humanity is Heaven and Earth’s most precious, and could not bear to destroy life. Yet if rebels leave the sovereign and father with sorrow, they are called traitors to the state. Thus, we personally led the soldiers, capturing the ringleaders alive. Though we returned in triumph, we could not avoid indiscriminate killing. We repay the aid of the wind’s rustling and cranes’ cries, and show the benevolence of weeding to let the seedlings grow.\n\nWe humbly pray that the cosmos may turn toward harmony, and all strife and suffering dissolve. War is a fearsome instrument, used only when unavoidable; may the grievances of bleached bones be wholly dispelled. Serving the public good, we know no restraint in action; may the depths of our sincere hearts be clearly seen.\n\n**Memorial for the Three Courts**",
      "overlap_context": "r, illuminating the sincerity of my observance; may the dawn of tomorrow’s audience leave no childish plea unanswered.\n\n**Sun Qiubi’s Prayer for Universal Deliverance to Fulfill His Vow and Honor His Late Master and Ancestor Lu Zijian**\nRecalling his former guidance, I vow that if a promise is made, it must be kept. In this act of universal deliverance, I think of him as if he were present, that he may fittingly ascend. Daring not to renege on my word, I venture to address the celestial hearing.",
      "start_char": 1697,
      "end_char": 1988,
      "start_sentence": 68,
      "end_sentence": 79,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.681769132614136,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\表奏类\\萃善录.txt",
        "category": "表奏类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "凉生药殿，夏五月以风熏； 梵达芝坛，日三朝而昼永。 响天威之咫尺，赞君德之辉光。 伏念某叨窃宠灵，周旋军旅，仅解严於汀建，复蓄锐於洪虔。 蚁穴就焚，幸凶渠之槛送； 龙颜动喜，因捷报於驿闻。 兹阐事於合峰，敬归功於魏阙。 伏愿皇天佑宋，旧境还周，万化更新，见君臣之庆会，五兵寝息，增朝野之欢娱。 晚朝词 细柳除营，甫定积年之寇； 白杨悲陇，莫招长夜之魂，即福地以修斋，迩昊天而沥恳。 言念盗兴於赣，人死如麻，就缚抵刑，自速弃街之戮； 摧锋陷阵，多衔草野之冤。 在臣意者以拯民，惟帝相之而破贼，杀非得已，生亦无穷。 伏愿大赦幽牢，普超苦爽，五方异俗，化金革於农桑； 三代同风，混车书於礼乐。 宫门骊蝗 多稼连畴，意丰登而可待； 群蝗入境，乃侵啮以为灾，民命所关，帝心斯在。 言念大江之右，夙称乐土之中，边国粗宁，幸免军需之急．浙乡不熟, 已伤官耀之繁。 正望稔於此秋，庶全生於尔众。 属蝗辅之大孽，遍满乡闾； 顾蚁虱之小臣，主持官宇，力捕莫施於坎地，醮禳惟谨於析天。 伏愿哀悯众生，赦原万罪，羽虫揖揖扫除，劝州田祖之神； 宝穑垂垂刈获，锡农夫之庆。 矢词迫切，拜赐须臾。 显应观设醮祈晴词 望霓有梼，既赐雾茫，积撩不收，遂忧昏垫，睠浙人之宅土，即泽国之围田，凡雨过多，虽苗无秀，蚓江潮之啮岸，加湖水之渰庐、因沮泖以复阴，将郁蒸而成疾、天子侧躬而翰虑，计臣思戢以遑安，肃阐醮筵，恪陈奏牍。 伏愿乾坤轩豁，离曜辉光，农务三时，讫暑耘而秋熟，王几千里，保物阜以民康。 明堂预告设醮祈晴饲 君国子民，绍一元之大统，父天母地，严三世之亲祠，爰合祭以戒食，用前期而申梼，伏．愿环穹秋豁，玉烛时调，上帝降祥，礼迄成於重屋； 冲人嗣服，祚益茂於丕基。 显应观祈雨词 民亦劳止，春失种以无秋； 天何言哉，日常旸而不雨，深惟阙政，祇控危衷。 伏念护漕罔功，来归未遂，星流白昼，屡传旱野之占； 气入朱明，愈急水田之务，既群祠而遍梼，惟上帝之求哀。 伏愿动下云雷，泽盈沟侩，贻势播谷，锡岁事之丰登； 合璧连珠，示乾文之嘉瑞，如乖吏状，请罚臣躬。 显应观再设醮祈雨词 农时既失，早太甚以如焚； 天听孔卑，信未孚而弗福，故忘烦喋，仰叩穹明。 伏念两仪漕畿，孤忠体国，经费倍支而罕拨，叨荣宜去而复留。 浙西东粒米之乡，所祈丰稔； 夏仲孟梅霖之景，乃向焦枯。 暴巫徒市，莫效於人为； 呼电召龙，率由於帝命。 既濒湖而醮款，祈沛泽以昭苏。 伏愿救敛骄阳，恩敷甘雨，水耕火耨，亟施田畋之功； 粟腐钱流，吃济邦储之用，尚谐中熟，庶弥多虞。 代茅山祈雨词 年谷垂成，政需泽润，秋阳为沙，反病亢乾，即仙圣之所居，为黎元之有祷，伏念滥膺颛闯，兼领陪京，维时多虞，所望一稔，序既当於擎敛，田尚苦於燥刚，始自近郊，远连并塞，地绵千 里，皆怀卒岁之忧，帝监四方，忍绝斯人之命，使旱势遍臻於属部，恐咎端专，在於微臣，实震惧之靡宁，冀精诚而上达，伏愿普敷德泽，徧惠群生，哀此矜人，久服劳於穑事，沛然下雨，俾无废於岁功。 开元宫禳火词 流星陨昼，仰天戒之高明，比屋延烧，伤民生之荡析，肃持恻怛，上告穹苍，伏念无补，使家仅寻时痪，泉务流而乃壅，已病闻阎，火弗戢而屡焚，仍空盖藏，维商丘之有祀祚，宋国之无疆，爰修罐瓒之仪，祇款琳琅之驾，伏愿诞施仁爱，潜弭灾虞，地大京师，息融风而奠枕，春探田野，赐膏雨以催耕。",
      "translated_text": "**Late Memorial**\n\nCool breezes rise in the medicinal halls as the fifth month of summer brings wind’s warmth; incense ascends the sacred altar, where thrice-daily audiences lengthen the day. The celestial might is near at hand, and we extol the radiance of the sovereign’s virtue.\n\nWe humbly recall our undeserved favor, leading troops through campaigns—barely easing the siege at Tingjian, then gathering strength at Hongqian. As an anthill burns to ash, we fortunately delivered the ringleaders in cages; the dragon countenance brightened with joy upon receiving the courier’s tidings of victory. Now, assembling at the united peaks, we reverently ascribe merit to the imperial court.\n\nWe pray that august Heaven may protect Song, restoring the old borders of Zhou, renewing all transformations, that sovereign and ministers may rejoice in harmony, and the five weapons lie at rest, multiplying the realm’s gladness.\n\n---\n\n**Palace Gate Memorial on Locusts**\n\nThe willows of the encampment at Xiliu are newly cleared, ending years of banditry; the white poplars mourn the graves, yet cannot summon the souls of the long-night dead. We perform rites in blessed precincts, offering earnest prayers to vast Heaven.\n\nReflecting on the uprising in Ganzhou, where the dead lay thick as hemp: those bound and executed hastened their own street executions; those who broke ranks and charged bore grievances of the wild grasses. In our judgment, we acted to save the people, trusting the emperor’s aid to crush the rebels. Killing was not by choice, yet lives were saved without end.\n\nWe pray for a great amnesty in dark prisons, universally liberating suffering souls. May the five regions’ diverse customs transform weapons into plows; may the Three Dynasties’ shared ethos merge chariots and script in rites and music.\n\n---\n\n**Palace Gate Memorial on Locust Plague**\n\nFields of abundant grain stretch unbroken, promising a rich harvest; yet swarms of locusts invade, gnawing and bringing disaster. This concerns the people’s lives, and thus the emperor’s heart.\n\nWe recall that the lands south of the great river, long called a land of joy, have seen borderlands briefly at peace, spared urgent military demands. Yet Zhexiang’s poor harvest has already strained official granaries. We had hoped for a bumper autumn, to preserve the lives of the many. Now, this great locust scourge fills every village; we, mere ant-like ministers governing the realm, can but weakly order captures in the fields and earnestly perform exorcisms to the heavens.\n\nWe pray that Heaven may pity all beings, absolving myriad sins, sweeping away the winged pests, and encouraging the gods of the state’s fields. May the precious harvest hang heavy for reaping, bestowing joy upon the farmers. Our vows are urgent; we await swift grace.\n\n---\n\n**Prayer for Clear Skies at Xianying Temple**\n\nWe had hoped for rainbows, but were granted only mist; the lingering clouds refuse to disperse, deepening our worry over floods. Gazing upon the people of Zhe, dwelling in their lands—these encircled fields of watery realms—we see that though rain falls often, the seedlings fail to bloom. The river’s tides gnaw the banks, and lake waters rise to engulf homes. As marshes grow stagnant and damp, illness threatens to fester.\n\nThe Son of Heaven bends his thoughts in concern; his ministers strive for peace and stability. We solemnly prepare the altar rites, reverently presenting our memorial.\n\nWe pray that Heaven and Earth may open wide, the sun’s radiance shining forth. May the three seasons of farming proceed, completing summer’s toil for autumn’s harvest; may the thousand-mile realm flourish, ensuring the people’s well-being.\n\n---\n\n**Preparatory Prayer for Clear Skies at the Bright Hall**\n\nSovereign of the state, child of the people, continuing the great unity of the primordial origin; father of Heaven, mother of Earth, revering the ancestral sacrifices of the Three Ages. We gather for the fast and offer prayers in advance.\n\nWe pray that the autumn skies may clear, the jade candle of time burn bright. May the Supreme Emperor send blessings, completing the rites in the grand hall; may the young ruler succeed to the throne, his great foundation flourishing ever more.\n\n---\n\n**Prayer for Rain at Xianying Temple**\n\nThe people are weary, having lost spring’s planting and autumn’s harvest. Heaven speaks not, yet the sun shines daily without rain. We deeply reflect on our governance’s failings, humbly presenting our distress.\n\nWe recall the canal defenses’ lack of success, our return yet unfulfilled. Meteors streak the daytime skies, repeatedly foretelling drought in the wilds; the fiery season’s qi presses urgently upon the water fields. Though we have prayed at all shrines, we seek only the Supreme Emperor’s mercy.\n\nWe pray that clouds and thunder may descend, filling ditches and furrows. May the planting of grain proceed, granting a bountiful harvest; may jade unite with pearls, displaying Heaven’s auspicious signs. If our officials have erred, we beg punishment upon ourselves.\n\n---\n\n**Second Prayer for Rain at Xianying Temple**\n\nThe farming season is lost, the drought severe as scorching flames. Heaven’s ear is near, yet our trust remains unanswered, bringing no blessing. Thus, we cast aside weariness and knock upon the bright heavens.\n\nWe recall the two capitals’ granaries, where solitary loyalty serves the state. Expenditures double, yet funds are scarce; undeserved honors should be relinquished, yet we remain. Zhexi and Zhedong, lands of grain, pray for abundance; the summer’s plum rains, once hoped for, now wither the earth.\n\nShamans and markets alike fail to move human effort; lightning and dragons respond only to Heaven’s command. Having performed rites by the lakeside, we pray for abundant rains to revive all.\n\nWe pray that the proud sun may be restrained, and sweet rains bestowed. May water plowing and fire weeding swiftly proceed in the fields; may grain rot and coins flow, aiding the state’s stores. We hope for a moderate harvest, averting further calamities.\n\n---\n\n**Prayer for Rain on Behalf of Maoshan**\n\nThe year’s harvest nears, yet requires moisture; autumn’s sun scorches the sands, worsening the drought. Here, where immortals and sages dwell, the common people offer prayers.\n\nWe recall our unworthy appointment to this sacred office, overseeing the auxiliary capital. At this time of many concerns, we hope for a single good harvest. The season of harvest approaches, yet the fields suffer from dry hardness. From the nearby suburbs to distant frontiers, a thousand *li* of land share the people’s year-end anxieties. The Emperor surveys the four directions—can he bear to cut short these lives? As the drought spreads through our jurisdiction, we fear the blame rests solely with this humble minister. Truly, we tremble without rest, hoping our sincerity may reach above.\n\nWe pray that virtue’s blessings may spread universally, benefiting all beings. Pity these toiling people, long laboring in the fields; send abundant rains, that the year’s work may not be in vain.\n\n---\n\n**Prayer to Avert Fire at Kaiyuan Palace**\n\nMeteors fall in daylight, warning Heaven’s high clarity; flames spread from house to house, grieving the people’s displacement. With solemn sorrow, we address the azure vault.\n\nWe recall our futile service, leaving families barely intact. The springs’ flow is blocked, already harming the people; fires rage unchecked, repeatedly burning empty storehouses. Yet Shangqiu’s sacrifices endure, and the Song state’s blessings are boundless. Thus, we perform the rites of libation, reverently invoking the jade-like deities.\n\nWe pray that great benevolence may be bestowed, silently averting disasters. May the vast capital rest secure, the warm winds stilled; may the spring fields receive nourishing rains, hastening the plow.",
      "overlap_context": "iscriminate killing. We repay the aid of the wind’s rustling and cranes’ cries, and show the benevolence of weeding to let the seedlings grow.\n\nWe humbly pray that the cosmos may turn toward harmony, and all strife and suffering dissolve. War is a fearsome instrument, used only when unavoidable; may the grievances of bleached bones be wholly dispelled. Serving the public good, we know no restraint in action; may the depths of our sincere hearts be clearly seen.\n\n**Memorial for the Three Courts**",
      "start_char": 1988,
      "end_char": 3359,
      "start_sentence": 80,
      "end_sentence": 134,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.05882287025452,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\表奏类\\萃善录.txt",
        "category": "表奏类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "禳兵词 峒穴无知，辄起绿林之盗，封疆所界，深怀赤子之忧，仰迩颢穹，肃陈危捆。 伏念典州瑜岁，闱境逢年，邻寇鹧张，毒忽流於涂炭，凶徒鼠伏，衅将动於萧墙，荷天败其逆徒，尚日驰於警报，王宫陷逐，寨卒创残居多，控扼之兵未快荡平之举，敬为民之请命，辄吁帝以投诚，伏愿赦过一方，全生万众，厄会密移於天运，先声克壮於军容，歼厥渠魁，稍谢无辜之鬼，安其田里，咸归不杀之仁。 祈皇嗣 南面视朝，久嗣大君之位，束储继体，宜膺男子之祥，屡醮祷於苍穹，伫感通於禁掖，即太乙贵神之馆，合下元本命之辰，申饬羽流，恪陈朱奏，伏愿帝心，顾佑国脉，昌隆带触，授弓骈集，椒途之喜，承桃主器，允符瓜瓞之绵。 章尚书九幽醮词 劬劳念母德，至大以难酬，哀痛彻天道，无方而善应，辄修清醮，恭沥丹忱。 伏念亡母，懿行在躬，先臣同齿子七人，而保抱忠孝良勤孙，三世以团乐，慈怜备至，汤沐既开於邻国，旨甘粗适於偏闱上，寿以倾诸孤之衅，顾微躯而若失，更再愬以增悲，敬遵玉匮之科，荐刻绿章之奏。 伏愿恩言曰可，过误其空。 风起白杨，不待幽阡之闭； 火传金线，亟超乐土之生。 下及漏泉，旁沾余润。 方司法五七词 女子有行，所期偕老，吾夫又死，几不胜哀，举尘案以自怜，写录章而上奏。 伏念亡夫，甫沾寸禄，杳失层亲，枕块缠悲，方经营於远日，临茔成疾，竟殒灭於芳年，痛兹家室之情，惨甚户门之祸，孤螫无倚，痛泣何闻，伏愿降鉴哀恫，赦除愆妄，度此魂於生地，仍识天伦，抚弱子者寡妻，常依道荫。 陈帅玉隆宫黄镍宿启词 视事惟新，未靖绿林之寇，感时多故，辄修黄录之斋。 躬造福庭，宿开灵墠，臣丹心君上，白发兵间。 闽部解严，幸君民之肃睦，江墟徙镇，伤饥馑之荐臻。 岂生灵积过之满盈，抑官吏贪残之由致，祇醮神仙之宅，觊回天地之仁，伏愿玉烛调和，珠踱循轨，上固一人之寿，下全万物之生，峒孽就平，师不烦於久外，田禾告稔，臣庶获以偷安。 天历为宗师还保安醮词 北望雁书，想玄门之宗主，束瞻马首，祈洪造之真灵，应不逾时，报当知本，伏念进修在己，行止非人，司教日边，每尽扶持之力，摩身关外，适当间隔之时，尝缴福以吁上天，乃蒙恩而有 今日，端不由於幸得，何敢食於盟言，敬肃元坛，恪酬清醮，伏愿国经求旧，帝渥从新，教雨载濡，纳道山於九润，寿星一点，映台象於三阶。 天师留京建年经词 日之余，岁之余，幸依光而及此，邦必达，家必达，期徽福以皆然，且谢且祈，如临如履，伏念某朝，君身远祀，帝心长时，荐易於年华，德难忘旧，天密胚於道脉，恩企迎新，恪陈藻荐之诚，默寓葵倾之悃，铭藏匪报，鉴照惟明，伏愿洪造垂仁，皇都协庆，生成一致，门迎佳气之春，出处两荣，驿寄喜音之早誓，修阴德仰答元功。 解坛词 人间尘世，严祭祀之琼坛，帝所清高，下照临之玉节，朝仪已备，斋事告周，礼贵节以成文，义有同於既灌，伏愿皇灵穆穆，鉴观趋退之恭，师造昭昭，察宥慎终之典。 谢恩词 一阳来复父，初索於震男，三愿幸孚帝，下观而临汝，此恩此德，何报何言，伏念某素款既周，皇灵不昧，雪先呈瑞，余半月以俱晴，日暖如春，后三朝而乃雨，皆神明之所感，於气象以可知，况凡我同盟，相终始於险降，暨百尔执事，咸进退以安闲，非由臣意，简在帝心，何以天时合於人事，载黑载沐，且谢且祈，伏愿鉴藻，有开涧苹，惟享几微，发见验所欲之必从，兆朕萌芽，信不言而善应。",
      "translated_text": "**Prayer to Avert Warfare**\n\nThe mountain caves, devoid of reason, breed the bandits of the greenwood; the borders we guard bear the deep sorrow of our people. With reverence, we lift our gaze to the vast heavens and solemnly present our perilous plight.\n\nWe recall the years of governing this land, when our borders enjoyed peace. Yet neighboring raiders spread their poison, swiftly turning roads to ashes; the wicked lurk like rats, their treachery stirring within our very walls. Heaven struck down their rebels, yet daily warnings still rush in. The royal palace was breached, and our outposts suffered grievous losses. Our forces, though poised to crush them, have yet to achieve decisive victory. Pleading for the people’s lives, we humbly beseech the Emperor to accept their surrender. We pray that one region’s transgressions be pardoned, sparing countless lives. May misfortune shift with the heavens’ will, and our armies’ might be bolstered by their early triumph. Let their ringleaders be destroyed, offering slight solace to the innocent dead. May the fields and villages be pacified, and all know the mercy of sparing life.\n\n**Prayer for the Emperor’s Heir**\n\nFacing south in court, long has he succeeded to the great lord’s throne; as heir, he should inherit the blessings of a son. Repeatedly, we have offered prayers to the azure vault, awaiting divine response within the palace. Now, at the Hall of the Supreme One, on the destined hour of the Lower Prime, we command the Daoist priests to reverently present their vermilion petitions. We pray that the Emperor’s heart may turn to safeguard the nation’s lineage. May the signs of prosperity converge, and the bows of succession be bestowed. Let the joy of the pepper chambers be fulfilled, as the peach and the gourd’s legacy endure.\n\n**Memorial for the Ninth Depths Ritual by Minister Zhang**\n\nThe toil of a mother’s virtue is vast and hard to repay; her sorrow pierces the Dao of Heaven, which responds without fail. Thus, we perform this pure ritual, reverently pouring forth our sincerest devotion.\n\nWe recall our late mother, whose noble conduct was embodied in her person. Among seven children of the same generation as my late father, she nurtured and embraced us with loyalty and filial piety, her grandchildren thriving through three generations. Her compassion was boundless—her kindness extended to neighboring states, and even the simplest meals brought comfort to our humble chambers. Her life was cut short by the misfortune of her orphans; her frail form seemed lost to us. Our repeated pleas only deepen our grief. Respectfully following the jade tablets’ decree, we now present this green petition.\n\nWe pray that her merits be acknowledged, her errors forgiven. May the wind rise in the white poplars, not waiting for the tomb’s closure; may the fire pass along the golden thread, swiftly ascending to the Land of Bliss. May her grace extend to the Yellow Springs below, and its blessings overflow to all around.\n\n**Prayer for the Five-Seven Ritual by the Minister of Justice**\n\nA woman’s path is to grow old with her husband; when he dies, my sorrow is nearly unbearable. I raise the dust-covered desk in self-pity, composing this petition to submit above.\n\nWe recall my late husband, who had barely received his first official post when he lost his parents. Grief clung to him like a shroud, and as he prepared for distant days, illness struck at the graveside. He perished in his prime, leaving our household in anguish, a calamity worse than any other. Our orphaned children have no support; to whom can my bitter weeping be heard? We pray that your divine gaze may look upon our sorrow, pardoning our transgressions. May his soul be guided to the land of the living, where he may still recognize his kin. May I, a widow, and our weak children forever dwell in the shelter of the Dao.\n\n**Prayer at the Yellow Register Ritual at Yulong Palace by General Chen**\n\nAs I take up my duties anew, the greenwood bandits remain unquelled; moved by the times’ many troubles, I perform the Yellow Register Ritual. I have personally come to the hall of blessings, where the sacred altar awaits. My heart is loyal to the throne, though my hair is white from war.\n\nThe Fujian region has lifted its alert, thanks to the harmony between ruler and people. Yet as I move my post to the Jiang region, famine and hardship have repeatedly struck. Is this due to the people’s accumulated transgressions, or the cruelty of corrupt officials? Reverently, we perform this ritual at the abode of the immortals, hoping to turn the heavens’ and earth’s benevolence. We pray that the jade candle burns evenly, the pearl treads its proper path. May the Emperor’s life be firmly secured above, and all living things preserved below. May the mountain rebels be pacified, sparing our troops from prolonged campaigning. May the fields yield abundant harvests, granting the people and officials a fleeting peace.\n\n**Prayer for the Return of the Celestial Master as the Patriarch’s Protector**\n\nGazing north, we imagine the wild geese bearing letters from the patriarch of the Mystic Gate; looking east, we pray to the true spirits of great creation. The response should not delay, and the report must acknowledge its source. We recall our own cultivation, though our conduct is not our own. At the edge of the teaching’s reach, we have done our utmost to uphold it; beyond the passes, we now face separation. We have repeatedly sought blessings to implore Heaven, and by its grace, we have reached this day. This is no mere fortune—how dare we take our vows lightly? With solemnity, we prepare the primal altar and reverently perform this pure ritual. We pray that the nation may restore its old ways, and the Emperor’s favor renew itself. May the rain of teaching nourish the Dao’s mountain in nine streams, and the star of longevity shine upon the three tiers of the celestial platform.\n\n**Prayer for the Celestial Master’s Stay in the Capital to Establish the Annual Scripture**\n\nThe days’ remainder, the years’ remainder—by fortunate light, we have reached this time. The state must prosper, the family must prosper—we seek blessings for all. With gratitude and prayer, we tread carefully, as if before the sacred. We recall that in our court, the Emperor’s sacrifices extend far, his heart ever constant. Though years pass, his virtue is not forgotten; though the heavens conceal the Dao’s lineage, his grace welcomes the new. Reverently, we present our offerings, silently conveying our devotion like sunflowers turning to the sun. Our inscription cannot repay this debt; only your bright gaze can perceive our sincerity. We pray that great creation bestows its benevolence, and the imperial capital enjoys harmony. May all life thrive as one, and every door welcome the spring’s auspicious air. May both public and private life flourish, and the post stations swiftly bear glad tidings. We vow to cultivate hidden virtue, looking up to answer the primal merit.\n\n**Closing the Altar**\n\nIn this world of dust, we have strictly observed the rituals at the jade altar; from the Emperor’s pure heights, the sacred standards descend to witness. The morning rites are complete, the fast’s affairs concluded. Ritual values moderation to perfect its form; its meaning aligns with the libation’s completion. We pray that the imperial spirit, majestic and serene, may observe our reverent withdrawal. May the enlightened masters clearly perceive and pardon the solemnity of our final rites.\n\n**Prayer of Thanksgiving**\n\nAs the first yang returns, the father first seeks the eldest son in the east; as the three wishes are graciously fulfilled, the Emperor looks down upon you. Such grace, such virtue—how can we repay or express it? We recall that our humble devotion has been thorough, and the imperial spirit has not been blind. Snow first appeared as an omen, and for half a month, the skies cleared. The sun warmed like spring, and after three days, rain fell. All this was the work of the divine, as the signs of qi made clear. Moreover, our allies have stood together through peril and peace, and all officials have moved and rested in tranquility. This was not by our design—it was the Emperor’s will. How else could heaven’s timing align with human affairs? Bathed in blessings, we give thanks and pray. We pray that your gaze may open like the orchids by the stream, ever responsive to the slightest offering. May the omens sprout like seedlings, and your silent goodness answer all desires.",
      "overlap_context": " barely intact. The springs’ flow is blocked, already harming the people; fires rage unchecked, repeatedly burning empty storehouses. Yet Shangqiu’s sacrifices endure, and the Song state’s blessings are boundless. Thus, we perform the rites of libation, reverently invoking the jade-like deities.\n\nWe pray that great benevolence may be bestowed, silently averting disasters. May the vast capital rest secure, the warm winds stilled; may the spring fields receive nourishing rains, hastening the plow.",
      "start_char": 3360,
      "end_char": 4741,
      "start_sentence": 135,
      "end_sentence": 163,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.128324031829834,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\表奏类\\萃善录.txt",
        "category": "表奏类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "代人保疾词 疾病同心，义重扶持之日； 爱慈异骨，诚祈覆焘之天，惟帝纳言，以人从欲。 伏念某力开道宇，身积患端，风为末疾之根，外因犹浅疾，有逆流之水，远虑实深，未收功於参术之奇，曷驾以希恩，伏愿仙墨香留，神丹雾散，天医临地，医会有药。 长生福星，明寿星高，如桩难老，瑕庇一洗，膏馥同沾。 庚午年春，舒贵和捧御香入山建金镍大斋宿启词 皇天后土，既全付於丕图，名山大川，庸聿严於外祀，远驰一使，祇格三灵，当鼓钟玉帛之初陈，乃圭辟综璜之具备，昭其文也，寓乾坤宗子之心，神而明之，为社稷生民之地。 早朝词 申明春令，爰据朝日之诚，寅畏夙通，敢替事天之敬，仰观非远，默感而通，念有民何赖以治安，亦惟帝实为之主宰，天高星远，行五纬以无差，地利人和，镇八维而不动。 午朝词 离文明两，如日再中，乾道时成，惟天为大，肃使华而代祀，仰帝阙以趁朝愿，感至诚聿严善应，一民莫非其有，天与祯祥万物，各遂其生，日依化育。 晚朝词 纂图御众，不忘夕惕之思，分命祈天，益谨暮朝之敬，缄一诚而自远，贯三极以潜通，密勿之间，对扬斯在，国经咸若，尚闻尧壤之歌、皇极无偏，丕锡箕畴之福。 正醮词 社稷艰难，叨承基绪，山川里祀，曷答穹祇。 念有土之多虞，揆为君之不易，赤子备尝於危殆，凶年不免於流 亡，无以回天，岂其能国。 敢寓诚於一醮，庶悔祸於三灵。 启迪时几，愿示小康之效； 昭苏邦本，即开大有之祥，生聚敉宁，治安驯致。 壬申圣节宿启词 诞弥厥月，揆初默斡於中怀，钦若昊天，报本聿严於外祀，乃驰使币祇，醮仙坛，修五礼，以如方祈三灵而有鉴，盛德在木，载扬发育之心，明日将朝，荐启敷宣之目。 早朝词 夙兴惟谨、致祀帝之初诚，吁食靡宁，以保民为先务，托玄科而请命，见宗子之用心，怀在有仁，念兹惟帝，五风十雨，得中道之丰登，四海九州，足小康之资聚。 午朝词 日中则反，戒实在於满盈； 天听孔卑，念孰为之保定，国有与立，时方可为。 奉金筹以祈恩，启丹肩而事命，惟天孚佑，益开享祚之祥； 率祖攸行，训至宁邦之盛。 晚朝词 日之余日夜，敢终怠於朝仪，国之本在身，忝丕承於明命，时临初度，齐启冲科，宁无自求多福之心，所愿密注，长生之字，大恩曷报，躬行遵道之言，终惠有祈，誓体代天之责。 正醮词 日当再育，忝分光岳之灵，天无常亲，密运基图之重，抚时以感，出命而祈，蓊焉夜寐以夙兴，比者冬行於春令，孰为民极，固不止水旱疾疫之忧， 自揆国经，何以这修齐治平之责，林然庶证，丛於厥躬，乃修外祀之严，愿格三灵之佑，有人有土，志维绥靖之求，而国而家，身见隆平之效。 圣节宿启词 三日天气新，揆於初度，八荒开寿 域，保运长存，香雾空蒙，真风演迤，适金人捧水心之剑，建瑶坛，悬黍米之珠，宿启冲科，仰关宸虑，伏愿三境疏恩，万真降鉴，九五福曰寿，九五福日富，廓寰宇以为家，八千岁为春，八千岁为秋，长上古而不老。 朝词 聪明作后，虹流上巳之辰，馨香感神，鳖扑普天之下，来皇华於福地，肃金录以祈天，稽首红云，投诚青祝，恭愿星辉，海润开寿，当於三宫，山高日升，育人民於九土。",
      "translated_text": "**Prayer for Recovery on Behalf of Another**\n\nIllness binds hearts as one, and the weight of duty calls for mutual support. Though love may differ from kinship, sincerity seeks the shelter of heaven’s grace. The Emperor heeds words and fulfills human desires.\n\nWe recall how one has labored to open the halls of the Dao, yet the body has accumulated afflictions. Wind is the root of lesser ailments, and external causes still linger shallowly. Yet there is water that flows against the current—deep indeed are the distant concerns. No success has come from the marvels of ginseng and atractylodes. How then can one hope to ride upon grace? We pray that the fragrance of immortal ink may linger, that the elixir’s mist may disperse, that the Celestial Physician may descend to earth, and that the healing assembly may bring forth medicine. May the Star of Longevity shine brightly, and the Star of Life ascend high. Like the pine, may one never age; may every blemish be washed away, and the balm of blessings be shared equally.\n\n---\n\n**Preparatory Prayer for the Golden Register Grand Fast at the Mountain, Spring of the Gengwu Year**\n\nHeaven above and earth below have entrusted the great enterprise. Famous mountains and mighty rivers are duly revered in external sacrifices. A single envoy is dispatched to reverently reach the Three Spirits. As the bells, chimes, jades, and silks are first arrayed, the ritual implements of jade tablets, bi discs, and huang pendants are all prepared. Their elegance is manifest, embodying the heart of the Son of Heaven, who unites heaven and earth. When the numinous is made clear, it becomes the foundation for the altars of state and the well-being of the people.\n\n---\n\n**Morning Court Prayer**\n\nWe clarify the spring decree and base ourselves in the sincerity of the morning sun. With reverent awe, we dare not neglect the respect due to heaven. Though what we gaze upon is not distant, silent understanding is achieved. We reflect: upon what do the people rely for order and peace? It is the Emperor who truly governs as their master. Heaven is high, the stars distant, yet the five planets move without error. Earth’s bounty and human harmony stabilize the eight directions, unmoving.\n\n---\n\n**Midday Court Prayer**\n\nThe brilliance of *li* shines in both directions, as the sun reaches its zenith again. The Dao of heaven is timely and perfect—none is greater than heaven. We solemnly dispatch envoys to perform the sacrifices, gazing toward the imperial palace to hasten the court audience. Moved by utmost sincerity, we reverently await a virtuous response. Not a single person is not his subject; heaven bestows auspicious omens, and all things fulfill their lives, each day dependent on transformation and nurturance.\n\n---\n\n**Evening Court Prayer**\n\nIn governing the realm and leading the people, we do not forget the vigilance of evening reflection. Dividing our mandate, we entreat heaven with ever-greater care in dawn and dusk audiences. Sealing our sincerity, we reach from afar, penetrating the Three Realms in silent communion. In the quiet of these moments, we offer our praise. May the state’s principles be perfectly ordered. We still hear the songs of Yao’s lands; the imperial standard is without bias, and great blessings are bestowed according to the *Ji Chou* decrees.\n\n---\n\n**Main Offering Prayer**\n\nThe altars of state face hardship, and we have presumptuously inherited their foundation. The sacrifices to mountains and rivers—how can we repay the lofty deities? We consider the many perils of the land and measure the difficulty of being a ruler. The people have endured danger and distress; famine years cannot avoid displacement and ruin. Without the power to turn back heaven’s will, how can the state endure? We dare to lodge our sincerity in this single offering, hoping to avert calamity through the Three Spirits. May we be enlightened to the signs of the times, and may a modest peace be shown. May the roots of the state be revived, and great prosperity’s omens unfold. May the people be nurtured and settled, and order and peace be gradually achieved.\n\n---\n\n**Preparatory Prayer for the Emperor’s Birthday, Ren Shen Year**\n\nAs the month of his birth approaches, we measure its beginning with silent reverence in our hearts. In awe of the vast heavens, we solemnly repay our origins through external sacrifices. Thus, we dispatch envoys bearing offerings, perform the fast at the immortal altar, and observe the five rites, praying in accordance with the proper forms that the Three Spirits may take notice. The virtue of the sagely wood flourishes, carrying forth the heart of nurturance and growth. As the dawn of the next day approaches, we present the offerings and proclaim the purpose.\n\n---\n\n**Morning Court Prayer**\n\nRising early with utmost care, we offer the initial sincerity of our sacrifices to the Emperor. Restless in our duties, we place the people’s well-being first. Entrusting ourselves to the mysterious rites to seek the mandate, we reveal the heart of the Son of Heaven. Embracing benevolence, we reflect: it is the Emperor alone who is mindful of this. With five winds and ten rains, we achieve the abundance of the middle way. Across the four seas and nine provinces, the resources for modest peace are sufficient.\n\n---\n\n**Midday Court Prayer**\n\nWhen the sun reaches its zenith, it turns back—truly, the warning lies in fullness. Heaven’s hearing is most near; who can ensure its steadfastness? The state stands with its people, and the times are ripe for action. Bearing golden tally sticks, we pray for grace; shouldering cinnabar tablets, we serve the mandate. May heaven grant its favor, further opening the omens of prosperous reign. Following the ancestors’ path, we teach the great peace of the state.\n\n---\n\n**Evening Court Prayer**\n\nAs the day wanes into night, we dare not grow lax in court ritual. The foundation of the state lies in the person—we have presumptuously inherited the bright mandate. Now, as the time of the initial offering arrives, we humbly initiate the modest rites. Is there no desire to seek abundant blessings? We pray that the silent gaze may be fixed upon us. The characters of \"longevity\" are vast—how can we repay such great grace? We personally follow the words of the Dao and, in the end, humbly entreat. We swear to embody the responsibility of acting on heaven’s behalf.\n\n---\n\n**Main Offering Prayer**\n\nAs the sun reaches its second zenith, we have presumptuously shared in the spirit of mountains and rivers. Heaven has no constant favorites; it silently bears the weight of the imperial enterprise. Moved by the times, we issue commands and pray. In dense forests, we rise early and retire late. Recently, winter has followed the decree of spring—who will establish the people’s standard? The concerns are not merely drought, flood, illness, or plague. Reflecting on the state’s principles, how can we fulfill the responsibility of cultivating the self, ordering the family, governing the state, and bringing peace to the realm? The manifold proofs gather upon our person. Thus, we perform the solemn external sacrifices, praying that the Three Spirits may grant their protection. For those who have land and people, our aspiration is for stability. For the state and the family, may we personally witness the effects of great peace.\n\n---\n\n**Preparatory Prayer for the Emperor’s Birthday**\n\nThree days bring renewed weather, marking the beginning of the imperial birthday. The eight wildernesses open into a realm of longevity, ensuring the perpetuity of the mandate. Fragrant mists swirl in the empty air, and the true wind unfurls. Now, the golden envoy bears the water-hearted sword, erects the jade altar, and hangs the pearls of millet. We humbly initiate the modest rites, reverently awaiting the imperial consideration. We pray that the Three Realms may dispense grace, and the myriad immortals may descend to witness. May the nine-five blessings be longevity; may the nine-five blessings be wealth. May the vast realm become our home. Eight thousand years shall be spring; eight thousand years shall be autumn. May we endure beyond antiquity, never aging.\n\n---\n\n**Court Prayer**\n\nThe sagely ruler’s intelligence and clarity shine forth, as the rainbow flows on the day of the Upper Third. Fragrant offerings move the spirits, and the turtle and milfoil extend across the heavens. We welcome the imperial envoys from the blessed land, solemnly presenting the golden register to entreat heaven. Bowing our heads to the red clouds, we offer our sincerity in blue-green prayers. Reverently, we pray that the stars may shine, and the sea’s moisture may open the way to longevity. Before the Three Palaces, may the mountains stand tall as the sun rises. May the people of the nine lands be nurtured.",
      "overlap_context": ", as the signs of qi made clear. Moreover, our allies have stood together through peril and peace, and all officials have moved and rested in tranquility. This was not by our design—it was the Emperor’s will. How else could heaven’s timing align with human affairs? Bathed in blessings, we give thanks and pray. We pray that your gaze may open like the orchids by the stream, ever responsive to the slightest offering. May the omens sprout like seedlings, and your silent goodness answer all desires.",
      "start_char": 4742,
      "end_char": 6035,
      "start_sentence": 164,
      "end_sentence": 201,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 46.82919502258301,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\表奏类\\萃善录.txt",
        "category": "表奏类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "又 天道惟钦，谨缄香於福地，帝心简在，祈眷佑於皇家，俯读绿章，上陈玄鉴，伏愿咫尺，若临卑高，罔问不言善应，阴阳顺而风雨时至，治无为，股肱良，而庶民育。 天历祝圣 代天作子，方当继统之初，绕电有期，预至祝厘之请，伏愿清时偃武，黔首归仁，甲兵洗衣裳，垂太平有象，日月光，山河壮，万寿齐天。 阎皂山国醮词 天锡九畴，抚下期跻於寿域； 国专七祀，升中爰即於名山。 眷膺金阙，以定四邮，及在玉衡，以齐七政，皆阴隐下民之力，致虔昭上帝之心，伏愿八表一又宁三宫益寿，天地平而元气正，俾万物以无疵，阴阳和而庶频成，资一人之有庆。 早朝词 浴咸池，出旸谷，现赤日之九芒，排阊阖，入帝居，觐红云之一朵，眷宵衣而待旦，吹暖律以回暄，远驰奏事之香，待锡治安之策，伏愿福持宝位，庆浃璇宫，慰安向於龙楼，赞休征於鹤禁，阳分阴而二仪立，衍亿世之皇图，正得秋而万宝成，洽八方之黎献。 午朝词 日至昆吾，而正中克成厌象，风驾扶摇而直上，敷奏以言，蚓金铎之息声，暨玉衡之顺轨，用殚朕志，简在帝心，伏愿俯赞，皇猷诞敷文德，六府三事，允治丕弘有永之基，四海九州攸同，共乐无为之治。 表榜 正荐太阴表 生明合德，运天一之至精，悬象降灵，行地中之溥润，恢恢真造，泯泯神机，某临照随人，盈虚有道，广寒清静，严七宝之高居，明水芯芬，叶方诸之大用，欲成玉炼九生之妙，必资金波一滴之余，共望泽润下，滋类从俯，应天与形，道与貌必符造化之全，月为魄日，为魂不越阴阳之外，陶镕允赖倪仰知归。 炼孤魂第九夜天尊表副 玉匮盟真，超幽魂於九地，宝华应号，证道果於诸天，仰渍宸聪，俯据斋捆，共望玉京毓秀，琼阙腾芳，万宝装严，仰弥罗之梵炁，九天照烛，开幽暗之昏衢，魂度朱陵，庆流后裔。 黄镶榜语迎真 六管浮春，一阳来复，九关戒晓，万圣齐临，方黄坛望幸之时，正紫气开先之际，将恭清道，仰止浮空，云汉昭回，神气运风霆之表，天地明察，衮衣流日月之光，方域百灵，起居先路，瑶坛绛节，久凝药籍之班，玉几红云，一鉴松花之会。 监门榜 法门广大，曾何间於戚疏，帝所清高，若不违於咫尺，必恭敬止，盍归来乎，莫问子为谁，孰云身是客，众妙非妙，於此示寂然不动之机，至言无言，亦岂有甚高难行之事，好共看天人黍米，信本无风雨，蓬莱洁己，从之致身易尔，尘世茫茫，汲汲何许，是到家时，玄关直直，堂堂这裹，有入门处，神明懋戒，凡圣同归。 天医榜 世之最苦者日穷民，偏多疾疢，天果何为而有，医道默与主张，至於游魂为变之时，亦有仰首呜号之意，想神农想轩后，九霄难问於高居，如秦缓如越人，千载犹存於生气，玉皇之上药，三品金碧之大丹，九还补造化而裨阴阳，有神气而无形迹，洪惟天法道，每垂情於养，愈疾痛之间，莫谓鬼非人，重施力於神圣工巧之外，赞彼元化，相我斋功。 沐浴榜 诗人吟玉女有盆，只要洗头，渔父答大夫，此水但堪濯足，皆非尽善，不可效尤，盖阴阳颠倒之坎离，其功甚大，况一六生成之天地，得气最先，饮之者玲暖自知，掬之者清凉无尽，是名沐浴，具体设陈，秋入肺肝五内，洒金茎之露，冷侵毛骨，一壶浸寒玉之冰，对之而尘垢自消，因得以形神俱妙，非如春暮，果从沂水以咏归，岂比华清叹出温泉而拜赐，脱然无我，洗者是谁？",
      "translated_text": "**Further Prayer**\n\nThe Dao of Heaven is revered; we reverently seal incense in the blessed land. The imperial heart holds us in its regard; we pray for the imperial house to receive divine favor. Bowing low, we present the green memorial, offering it to the profound gaze of the unseen. We pray that though distant, it may be as if near, attending to high and low alike. May no inquiry go unanswered, and good responses abound. May yin and yang harmonize, and wind and rain arrive in due season. May governance be effortless, ministers virtuous, and the common people flourish.\n\n**Prayer for the Heavenly Calendar to Bless the Sage**\n\nAs the Son of Heaven acts on behalf of Heaven, at the outset of his succession, the appointed time draws near like lightning. We offer our prayers in advance for blessings. May this be an era of peace, where weapons are laid aside, and the black-haired people return to benevolence. May armor and blades be washed clean as garments, and the signs of great peace endure. May the sun and moon shine brightly, mountains and rivers stand majestically, and the emperor’s longevity equal that of Heaven.\n\n**Prayer for the State Ritual at Mount Yanzao**\n\nHeaven bestows the Nine Categories, guiding the realm to ascend to the realm of longevity. The state conducts the Seven Sacrifices, ascending the central peak of the famed mountain. Gazing upon the golden gates, the four quarters are stabilized; aligning with the jade balance, the seven celestial bodies are set in order. All this arises from the hidden efforts of the people below, sincerely manifesting the heart of the August Emperor above. We pray that the eight directions be united and at peace, the Three Palaces gain longevity. May Heaven and Earth be level, the primordial qi upright, enabling all things to be without flaw. May yin and yang harmonize, and the harvests be abundant, bringing fortune to the One Man.\n\n**Morning Court Prayer**\n\nBathing in the Salty Pool, emerging from the Valley of the Sun, the crimson sun displays its nine rays. Pushing open the gates of Heaven, entering the imperial abode, we behold a single cluster of red clouds. Donning the night robes, we await the dawn, as the warm breath of spring returns. From afar, we present the incense of state affairs, awaiting the bestowal of policies for peace and governance. We pray that fortune uphold the precious throne, and blessings fill the celestial palace. May the dragon tower be comforted, and auspicious omens be praised within the crane precincts. As yang divides from yin, the Two Modes are established; may the imperial plan endure for a hundred million generations. As autumn’s virtue brings forth the myriad treasures, may the black-haired people of the eight directions be enriched.\n\n**Midday Court Prayer**\n\nAs the sun reaches Kunwu, the zenith is perfectly attained, and the image of fulfillment is complete. The wind-borne chariot ascends directly, and memorials are presented in words. The golden bells fall silent, the jade balance follows its course. We exhaust our devotion, and the imperial heart holds us in its regard. We pray for the imperial way to be grandly unfolded, and civil virtue to flourish. May the Six Treasuries and Three Affairs be justly governed, establishing a foundation of great prosperity that endures. May the Four Seas and Nine Provinces be as one, sharing in the joy of effortless rule.\n\n**Memorial for the Proper Offering to the Great Yin**\n\nThe radiance of life unites with virtue, moving the supreme essence of Heaven’s Oneness. The suspended image descends in spirit, carrying the universal moisture of the earth’s center. The vast true creation, the subtle divine mechanism—before them, I, humbly observing the waxing and waning, follow the Dao. The Palace of Broad Cold is pure and still, its lofty abode adorned with the Seven Treasures. The bright water’s fragrance aligns with the great function of the square mirror. To achieve the wondrous alchemy of ninefold rebirth, one must rely on the surplus of a single drop of golden waves. Together, we look to the moisture descending below, nourishing all things in their turn. Responding to Heaven and form, the Dao and appearance must align with the completeness of creation. The moon is the po, the sun the hun; they do not transgress the bounds of yin and yang. The refining and molding depend entirely on this—we know where to return.\n\n**Memorial to the Heavenly Worthy on the Ninth Night of the Ritual for Lonely Spirits**\n\nThe Jade Treasury seals the covenant with the true, lifting the lonely souls from the Nine Earths. The Precious Flower responds to the invocation, verifying the fruits of the Dao across the heavens. Gazing upward, we soak the imperial hearing; looking down, we rely on the fast and offerings. Together, we look to the Jade Capital to nurture excellence, the Jasper Towers to send forth fragrance. Adorned with the myriad treasures, we look up to the Brahma qi of the Woven Net. The Nine Heavens illuminate, opening the dark paths of the gloomy thoroughfares. May souls cross the Crimson Mound, and blessings flow to their descendants.\n\n**Yellow-Edged Proclamation to Welcome the True**\n\nThe six tubes float in spring; the first yang returns. The nine gates are guarded at dawn; the ten thousand sages arrive as one. At the time when the yellow altar awaits the imperial favor, when the purple qi heralds the beginning, we shall reverently clear the path, gazing upward as the True descends from the void. The Milky Way shines and turns; the divine qi moves beyond wind and thunder. Heaven and Earth are bright and discerning; the imperial robes flow with the light of sun and moon. The hundred spirits of the realm rise to attend the vanguard. The jasper altar and crimson standards long await the ranks of the alchemical registers. The jade table and red clouds once more witness the assembly of the pine and flower.\n\n**Proclamation at the Gate of Supervision**\n\nThe Dharma gate is vast; how could it distinguish between near and far? The imperial abode is pure and lofty; if one does not stray, it is as if close at hand. Let there be reverence and stillness—why not return? Ask not who the child is, nor say the body is a guest. The myriad wonders are not wondrous; here, the mechanism of tranquil non-action is revealed. The supreme words are wordless—how could there be deeds too lofty to perform? Come, let us together behold the millet of the immortals. Truly, there is no wind or rain. The Penglai Isles are purified; following them, one easily attains the body. The dusty world is boundless—where does one hasten? When one arrives at home, the mysterious barrier is straight and direct. Here, in this hall, is the entrance. The divine and bright are diligent in vigilance; the ordinary and sacred return as one.\n\n**Proclamation of the Heavenly Physician**\n\nThe world’s greatest suffering is that of the poor, who are afflicted with many illnesses. Why does Heaven allow this? The medical Dao silently governs. Even when wandering souls transform, there is the intention to lift one’s head and cry out. Thinking of Shennong and the Yellow Emperor, their lofty abodes in the Nine Heavens are hard to inquire of. Like Qin Yueren or Bian Que, their life-giving qi endures through a thousand generations. The Jade Emperor’s supreme medicine, the three-grade elixir of gold and jade, the ninefold return that mends creation and aids yin and yang—possessing divine qi yet leaving no trace. How vast is Heaven’s law of the Dao, ever inclined toward nurturing and healing pain. Do not say ghosts are not human; beyond the work of divine and sagely craftsmanship, they assist that primordial transformation, aiding our fast’s merit.\n\n**Proclamation for the Ritual Bath**\n\nThe poet sings of the Jade Maiden’s basin, meant only for washing the hair. The fisherman answers the grandee: this water is but fit to wash the feet. Neither is wholly good—do not follow their example. For the inversion of yin and yang in Kan and Li holds great power. Moreover, in the heaven and earth formed by the one and six, the qi is first received. Those who drink it know its warmth; those who scoop it find its coolness endless. This is called the ritual bath, fully arrayed in its form. Autumn enters the lungs and liver, the five viscera; it sprinkles the dew of the golden stem, chilling the hair and bones. A single flask immerses the ice of cold jade. Facing it, dust and grime vanish of themselves, enabling both form and spirit to attain perfection. This is not like spring’s end, when one returns singing from the Yi River, nor like sighing at Huaqing, emerging from the warm springs to receive the gift. Freed from the self—who is the one washing?",
      "overlap_context": "rant offerings move the spirits, and the turtle and milfoil extend across the heavens. We welcome the imperial envoys from the blessed land, solemnly presenting the golden register to entreat heaven. Bowing our heads to the red clouds, we offer our sincerity in blue-green prayers. Reverently, we pray that the stars may shine, and the sea’s moisture may open the way to longevity. Before the Three Palaces, may the mountains stand tall as the sun rises. May the people of the nine lands be nurtured.",
      "start_char": 6036,
      "end_char": 7379,
      "start_sentence": 202,
      "end_sentence": 226,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.492876291275024,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\表奏类\\萃善录.txt",
        "category": "表奏类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "监生榜 太极肇判，乾坤定而六子生，元气散分，阴阳交而万形具，惟人最贵，所主有神，以其为天地之心，果谁执造化之柄，茁兰可爱，皆由万灵恭奉而来，坐草云亡，或出一念，扶持之外，未脱秋瓜之蒂，莫回寒谷之芳，秩秩有司，化化无迹，子知向来梦，应作如是观，灵芝本亦无根，到此好参众妙，桃花自贪结子，教人错恨东风，净洒酒然，长惺惺去。 监斋榜 黍稷非馨，吾闻其语，粢盛不洁，士听无哗，天地之道昭昭然，鬼神之情洞洞尔，非诚莫享，在德宜酬，盖芬芯具陈，虽松华而不弃，若馨香可荐，纵蕴藻以无嫌，然劳薪之火，其可以炊，而埃墨之饭，安敢以祭，况失饪不食，圣人之教训宜然，苟闻腥于天，上帝之崇高，则否致其洁也，将何道神而明之，惟汝贤尚昭乃勋，母旷厥职，道腴非味、何求易牙之知，食指欲尝，罔俾子公之染，云厨必戒，天爵宜升。 芰郭 立荚郭以款幽魂，一期两见，到蓬山而闻妙道，千载重逢，流年掷梭，红颜春树，人生能几何，朔风惊沙，枯梢号寒，子行亦良苦，四海兄弟，一会神仙，曩者玄师，曾指幽关之正路，今兹教主，又宏苦海之慈航，以何因绿，得此方便，生我所欲也，义我所欲也，幸逢兼取之鱼熊，贵者骄人乎，贱者骄人乎，勿效相持之鹉蚌，雪起可以适口，云岌为之洗心，道味悠长，善端呈露，天宽地大，曾何夜雨烦冤，阴极阳回，别有春风消息。 孤魂榜 庄子尝言，受成形而形有尽，阮瞻所见，论无鬼而鬼不然，则知二气之良能，难以一途而偏废，伯有彭生之事，古人岂欺我哉 ，魏其灌夫之冤，信史有如彼者，生生死死，古古今今，金谷园林，此地岂无歌舞，平泉花木，几人看到，子孙逝川，只解东流白日，又还西落，日鳏寡曰孤独，配下民多无告之穷，或札痿或夭昏，而上天之剥丧者半，艰难万状，贫病交攻，其间浩叹何胜，到底同归于尽，以无祭主，故日孤魂，幸今逢黄箓斋官，又特启玄科好事，饱汝以食而无馁，暖汝以衣而不寒，三十六部尊经善绿，得未尝有一万二千金简，魂气当无不之仙道佛道，尽堪行天门人门，皆可去黄坛回首处，快乘蓬岛清风，丹府记名，时尽入黍珠碧落，皆大惧喜，便好超升。 将吏榜 云篆太虚，道因文显，风霆神气，将以心存，况两间光岳之散分，有一揆天人之会合，鲁公竟为雷吏，傅说自是列星，李将军生不封侯，其必在爵秩同升之列，张睢阳死愿杀贼，将亦发英雄未了之心，虽道之体本出於自然，而法之用皇存乎 策役，琼台拔地，玉辇瞻天，金简合符，宝书启钥，于以廓灵风而昭慧日，于以引归路而济迷津，九幽之黑处，皆明一寸之丹心，默契惟道，贵度非神，不行作善，降祥驯致仙家之喜庆，论功行赏，超迁天上之班资。 节次榜 斋以事帝，固宜由本，以及文道不远人，其可有纲而无目，眷我黄坛列职，无非紫府朝班，秩秩有仪，谆谆以告，言而为法，动而为则，当如君父之在前，举之於口，笔之於书，须信神仙之可学，必也周行中规，折行中矩，勿谓视於无形，听於无声，谪果何尤，黄庭之误者一字，过无可奏庚申，何畏乎三尸，相与盟天，有如皎日。 茶榜 问海上灵搓，光彩已腾於星汉，撷山中瑞草，芳香又接於蘅薇，策上品之奇勋，吸群英之佳气，共惟天师，冑承汉叶，器备仙根，道味精微，灼见中湩之水，善芽茂密，未论蒙顶之苞，紫兰香桂之所依，朱草嘉禾之近侍，轻雷破荚，苏醒群昏，明月为团，晶辉独露，一饮者已量，俱足共谈，而舌本潜通，曳翠旗，按蓬莱，清风两腋，执苍璧，朝闻阖，喜彻九重，迟迟三丈之日高，款款五千之文进，佳句自联於石鼎，贵名又起於金瓯，白雪满碗花徘徊，小引鼻端之馥，仁风暗结珠，蓓蕾早回掌上之春，点首而前，沦心以进。",
      "translated_text": "**Monitor of the Students’ Register**\n\nWhen the Great Ultimate first divided, Heaven and Earth were established, and the Six Offspring arose. The primordial qi dispersed and divided, yin and yang intertwined, and the myriad forms took shape. Yet none is more noble than humankind, for we are endowed with spirit, serving as the heart of Heaven and Earth. Who, then, holds the handle of creation? The loveliness of orchids and thoroughwort springs from the reverence of the ten thousand spirits. But when one sits in the grass and vanishes like a cloud—if even a single thought arises to sustain them—beyond that support, they remain bound like a melon to its stem, unable to restore the fragrance of a frozen valley. The ranks of officials are orderly, their transformations traceless. You know the dream of old—regard it thus. The magic mushroom has no root; here, you may fathom the manifold wonders. The peach blossom, greedy for its fruit, teaches one to blame the east wind in vain. Be pure, be free, and ever wakeful—go forth.\n\n**Monitor of the Fasting Hall**\n\nMillet and sorghum are not fragrant—I have heard these words. Though the sacrificial grains be impure, the officers listen in silence. The Dao of Heaven and Earth shines clearly; the feelings of ghosts and spirits are utterly transparent. Without sincerity, no offering is accepted; by virtue, recompense is due. For though the petals be arrayed in full, even pine blossoms are not spurned. If fragrance may be presented, then even water plants and algae bear no fault. Yet fire from labored wood may cook a meal, but how dare one offer a feast of dust and soot? Moreover, the Sage’s teaching warns: \"Do not eat what is improperly prepared.\" If the stench of raw flesh offends Heaven, how much more the exalted Lord? Thus, if we would not profane purity, by what means shall we illumine and serve the gods? Only you, the worthy, who have made your merit manifest—do not neglect your duty. The richness of the Dao is not a matter of taste; why seek the discernment of Yi Ya? The food is ready to be tasted—let not the stain of Zigong’s finger mar it. The cloud-kitchen must be kept pure, that the heavenly rank may rise.\n\n**The Water-Chestnut Enclosure**\n\nErect the water-chestnut enclosure to welcome the wandering souls—once in a lifetime, twice in an age. Arriving at Penglai, one hears the wondrous Dao—across a thousand years, the reunion is profound. The years fly like a shuttle; youth fades like spring’s blossoms on the trees. How many days does a life hold? The north wind stirs the sand, and the withered branches howl in the cold. Your journey, too, has been arduous. All under Heaven are brothers; this gathering is of immortals. Long ago, the Dark Master pointed the true path through the hidden pass. Now, the Lord of Teachings once more spreads the compassionate ferry across the sea of suffering. By what cause or karma have we gained this expedient means? Life is what I desire; righteousness, too, is what I desire. Fortunate to encounter the fish and bear both at once—does the noble lord it over others, or the lowly? Do not imitate the clam and snipe locked in strife. Snowflakes melt to moisten the lips; clouds gather to cleanse the heart. The flavor of the Dao is enduring; the seeds of goodness reveal themselves. Heaven is vast, Earth is broad—why should the night rain trouble one’s grievances? Yin reaches its extreme, and yang returns—another message of spring’s breeze.\n\n**Register of the Lonely Spirits**\n\nZhuangzi once said: \"Having received a completed form, that form must one day perish.\" Ruan Jian argued there were no ghosts, yet ghosts proved otherwise. Thus we know the inherent nature of the two qi cannot be dismissed by a single path. The tales of Boyou and Peng Sheng—did the ancients deceive us? The wrongs of Weiqi and Guan Fu—are the trustworthy histories not as they say? From life to death, from ancient times to the present, the gardens of Jingu—how could there be no song and dance here? The flowers and trees of Pingquan—how many have lived to see them? The river of descendants flows ever eastward, while the sun sets in the west. The widowed, the orphaned, the solitary, the childless—among the common people, many are those without recourse. Some perish from plague, others die young or in darkness. Half of those whom Heaven has stripped suffer a thousand hardships, beset by poverty and sickness. How many sighs can they bear? In the end, all return to nothingness. Without a master to make offerings, they are called lonely spirits. Yet now, by good fortune, they encounter the Yellow Register Fast of the Daoist Office, which has specially initiated this wondrous rite. They are filled with food and never hunger; warmed by clothing and never cold. The thirty-six sacred scriptures and good karma—have they not received the twelve thousand golden tablets? The spirits of the dead shall all ascend to the paths of immortals and buddhas, fully capable of entering the gates of Heaven and the gates of men. All may depart from the Yellow Altar, turn their heads, and swiftly ride the pure winds of Penglai. Their names are recorded in the Cinnabar Palace; in time, they shall all enter the Millet Pearl and the Azure Vault. Rejoicing greatly, they shall soon transcend.\n\n**Register of the Generals and Officers**\n\nCloud-script fills the Great Void; the Dao is made manifest through writing. The divine qi of wind and thunder resides in the heart. Moreover, the light and mountains scattered between Heaven and Earth share a single principle with the union of Heaven and humanity. Lord Lu became a thunder spirit; Fu Yue rose as a constellation. General Li, though he never received a noble title in life, must surely rank among those whose honors ascend with the stars. Zhang Suiyang, who vowed to kill the enemy even in death, will surely rouse his unfinished heroic heart. Though the essence of the Dao arises naturally, its function in the law must be strategically employed. The jade terrace rises from the earth; the jade carriage gazes upon Heaven. The golden tablets seal the tally; the treasure books open the lock. By these means, the numinous wind is spread and the sun of wisdom shines forth. By these means, the lost are guided back and the bewildered cross the ford. In the darkest depths of the Nine Netherworlds, even a single inch of the cinnabar heart brings light. Silent accord lies in the Dao; the noble transformation does not rely on the spirit. Without performing good deeds, how can one attract auspicious omens and attain the joy of the immortals? By assessing merit and bestowing rewards, one may ascend beyond the ranks of Heaven.\n\n**Register of the Ritual Sequence**\n\nFasting is for serving the Emperor—it must proceed from the root. The Dao of culture is not distant from humanity; how can there be a guiding principle without its details? We, the officers of the Yellow Altar, are none other than the court of the Purple Palace. In orderly ranks, we earnestly instruct: our words become the law, our actions become the model. Act as though the Lord and Father stand before you. What is spoken, what is written—know that immortals can be learned. Walk the full circle within the compass; turn within the square of the carpenter’s rule. Do not say you see nothing, hear nothing. What fault lies in punishment? A single miswritten character in the *Huangting* script brings error. No transgression can be concealed on the Gengshen day—what fear is there of the Three Corpses? Let us swear our alliance to Heaven, bright as the sun.\n\n**Tea Register**\n\nI ask: the magic leaves of the sea—has their radiance not soared to the Milky Way? The auspicious herbs of the mountains—has their fragrance not mingled with the sweet basil? By their rare merit of the highest rank, they draw in the finest qi of the gathered blossoms. Consider the Heavenly Master, who inherited the Han lineage: his vessel was prepared with the root of immortality, his Dao profound and subtle. The water of the middle cauldron is clearly seen; the tender buds flourish thickly. Not to mention the unopened buds of Mengding, the purple orchids and fragrant cassia they depend upon, the vermilion grasses and fine grains that attend them. A gentle thunder cracks the pod, awakening the benighted. The moon shapes them into cakes; their crystal brilliance stands alone. One sip measures the capacity of all; together, they suffice for discourse. The tongue’s root stirs in secret; the green banner is unfurled. Pressing on to Penglai, the clear wind fills both sleeves. Holding the green jade tablet, one attends the morning audience; joy reaches the ninefold palace. Slowly, the sun rises three yards high; leisurely, the five thousand characters advance. Fine lines naturally link in the stone tripod; noble names rise again from the golden bowl. White snow fills the cup, flowers linger—briefly, the fragrance graces the tip of the nose. The benevolent wind silently gathers pearls; buds early restore spring to the palm. Nodding, one steps forward; the heart is steeped and offered.",
      "overlap_context": "ath, fully arrayed in its form. Autumn enters the lungs and liver, the five viscera; it sprinkles the dew of the golden stem, chilling the hair and bones. A single flask immerses the ice of cold jade. Facing it, dust and grime vanish of themselves, enabling both form and spirit to attain perfection. This is not like spring’s end, when one returns singing from the Yi River, nor like sighing at Huaqing, emerging from the warm springs to receive the gift. Freed from the self—who is the one washing?",
      "start_char": 7380,
      "end_char": 8842,
      "start_sentence": 227,
      "end_sentence": 242,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 51.745399475097656,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\表奏类\\萃善录.txt",
        "category": "表奏类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "酒榜 黄坛设醴，洪钧转而一阳生，玄馆飞觞，大礼成而诸福备，竹松如醉，猿鹤欢迎，共惟天师，云炁尊昙，道山钟鼎圣明时，和黑甘露，神仙府瑞霭香风，举瓢酌天浆，神情迈俗，停杯问明月，逸兴无尘，混融乎 青州鬲上之分，浃洽乎 玉瓒黄中之妙，沉酣道味，酝藉仙风，有盎然深念之良心，便酿就满腔之喜黑，与人传颂，何须论千日奇芳，天子呼来，又欲醉九重春色，想宴罢凤边丹诏记，赐来马上黄封，敲玉壶冰想道臣心之如水，指金茎露，笑看仙掌之凝珠，郁皂味浓，蘅薇香近。 水灯榜 水灯映水，开成仰覆之莲花，天影枯天，照见虚无之蓬岛，九渊不夜，千炬浮春，乌兔让辉，到海坐通於银汉，鱼龙吹浪走盘，疑是於明珠，然此一点金色光，尽在诸公笔头上，怀沙包黍，何劳招屈子之魂，逐浪生花，又可诵坡仙之句，余明所及，幽壤咸归。 普度告盟榜 宝月重圆，始停玉斧，春风九夜，爰启金科，肃肃乎尘马不飞，飘飘然仙车无迹，五难绿理，去三黑攸分，十方浮空，来一珠俱摄，中有自然造化，於焉溥度幽冥鹤信，晓通龙文云起，慎终追远，具陈洁己之诚心，脱苦登真，仰止度人之妙道，时其可矣，天实临之。 萃善录卷上竟 萃善录卷下",
      "translated_text": "**Wine Edict**\n\nUpon the yellow altar, sweet wine is set; the great potter’s wheel turns, and the solitary yang is born. In the dark pavilion, cups fly; the grand rites are complete, and all blessings gather. Bamboo and pine stand as if drunk; gibbons and cranes welcome in joy. Together we revere the Heavenly Master, whose cloud-qi is as venerable as the udumbara. Amidst the sacred mountains’ tripods and cauldrons of this enlightened age, harmonious black nectar flows; from the immortals’ palace, auspicious mists and fragrant winds arise. Raising the gourd, one pours the celestial brew—spirit transcends the mundane. Pausing the cup, one questions the bright moon—elevated thoughts remain unstained by dust. Merging with the division upon the cauldron of Qingzhou, permeating the subtleties within the jade scepter’s yellow core, one sinks into the intoxicating savor of the Dao’s flavor, steeped in the grace of the immortals’ breeze. A heart brimming with profound reflection ferments a full measure of joyous blackness. Passed among men to be extolled, why speak of a thousand days’ rare fragrance? Summoned by the Son of Heaven, one would yet intoxicate the ninefold palace with spring’s hues. One imagines, as the phoenix-side banquet concludes, the vermilion edict inscribed, the imperial gift of yellow-sealed wine bestowed upon the saddle. Tapping the jade pot, one envisions the Daoist minister’s heart as clear as ice; pointing to the golden stem’s dew, one smiles at the immortal palm’s congealed pearls. The rich, dark flavor deepens; the fragrance of roses draws near.\n\n---\n\n**Water Lantern Edict**\n\nWater lanterns mirror the water, unfolding into lotus blossoms that face both heaven and earth. The sky’s reflection dries the heavens, illuminating the empty isle of Penglai. The nine abysses know no night; a thousand torches float upon spring. Crow and hare yield their radiance; seated by the sea, one communes with the Silver River. Fish and dragons blow waves, racing across the platter—one suspects they are luminous pearls. Yet this single golden light resides entirely upon the tips of the lords’ brushes. With sand-wrapped millet, why summon the soul of Quzi? As waves birth flowers, one may recite the verses of Su the Immortal. Where this lingering brightness reaches, even the hidden depths of the earth return to light.\n\n---\n\n**Universal Deliverance and Covenant Edict**\n\nThe precious moon regains its fullness, the jade axe at last stilled. For nine nights, the spring wind stirs, and the golden statutes are revealed. Solemnly, no dust-borne steeds take flight; lightly, no immortal chariots leave traces. Five difficulties are resolved in emerald order; three obscurities are dispelled. The ten directions float in emptiness, yet a single pearl gathers all. Within lies the spontaneous workings of creation, here extending deliverance to the hidden and dark. Crane messages dawn in clarity; dragon patterns rise with the clouds. In reverence for the distant and the departed, one presents the sincere heart of self-purification. To escape suffering and ascend to truth, one gazes upward to the wondrous Dao of deliverance. Now is the time; Heaven indeed attends.\n\n---\n\n*Collected Virtues, First Scroll Concludes*\n*Collected Virtues, Second Scroll*",
      "overlap_context": "n jade tablet, one attends the morning audience; joy reaches the ninefold palace. Slowly, the sun rises three yards high; leisurely, the five thousand characters advance. Fine lines naturally link in the stone tripod; noble names rise again from the golden bowl. White snow fills the cup, flowers linger—briefly, the fragrance graces the tip of the nose. The benevolent wind silently gathers pearls; buds early restore spring to the palm. Nodding, one steps forward; the heart is steeped and offered.",
      "start_char": 8843,
      "end_char": 9333,
      "start_sentence": 243,
      "end_sentence": 252,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.31215763092041,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\表奏类\\萃善录.txt",
        "category": "表奏类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "李氏崇建九幽升度大斋荐拔亡夫及子孙孤魂正醮词 礼庆夭昏，死生大矣，斋戒沐浴，天地临之，已蒙金简之曲成，庸阐琼科而昭谢。 伏念臣妾得天何浅，惠妾无终，两年而有七丧，夫亡子继，一身而哭三世，女殒孙姐，间逢疾状之可疑，或谓患端之有在，神灵震怒，灾祸频仍，身不敢以遑安，心实知其有罪。 亦尝洁己，津六道以消愆； 孰若投诚，醮名山而请命。 皇穹在上，明水自陈。 伏愿道有生神，仁无弃物，仙科九炼，感归解脱之门，人道一新，永塞伏连之路，蒙恩有日，积善酬天。 宿启词 上帝至仁，常恐乖违於人道，凡民有死，犹传济物之真科，何垂老而兼失於所天，彼长逝者孰开其生地。 乃据丹悃，祇肃瑶坛，五模风微，幸纲维於玄范，九关云启，容朝夕於清光。 早朝词 好生德大，感上圣之垂光，追远心长，肃初朝而请命，日一气接天人之会，阳明通造化之机，三极神交，九原庆幸，玉文布劫，爰指路於仙灵，金简流丹，式合符於凡悃。 午朝词 事帝夙兴，致斋忱而未悉，趋朝昼接，愬家难以申言，比由外患之干，而有中殇之哭，省愆终日，悔祸惟天，否塞潜通，北斗弭伏连之路，离明洞照，南宫升解脱之魂。 晚朝词 夕殿澄秋，监人生之多难，朝仪卜夜，奏童读之微言，道开幽壤之光明，德沛余波之膏润，允资既往，兼惠其生，天定而人景，幸收於榆晚，日昌厥后春，益茂於兰芽。 元君荐三十七代天师希微宿启词 嗟子行役，竟客死而不归，惟天聪明，念民情之无告，倚门望绝，启醮词真。 伏念某人嗣教三年，束装万里，藉祖宗之福泽，偶有遭逢，婴疾病之淹留，胡然夭丧，心拆外书之至，神伤旅衬之来，母子至情，死生大事，敬归依於祖教，先汛扫於家庭。 伏愿四炁朗清，五文开廓，北方不可久处，帝遣三招，东极无量度人，经传十徧。 二日早朝词 曙色苍凉，不见衣冠之拜母； 凡情恳恻，正凭笺牍以吁天，俨十方三界之临，正二日六朝之始。 伏愿阳者普照，勑札下颁，报冀朔之游魂，许从雪，注蓬瀛之仙籍，得遂超升。 午朝词 日之方中，缺望昼归之锦，神其如在，揭虔露捆之香，哭子声悲，望天情切。 伏愿玉天赐动，金阙疏恩，大开流火之庭，尽除宿垢，入侍太玄之省，得遂超升。 晚朝词 时当昏定，长儿不见於寝闱，醮有晚朝，列圣尚临於坛席，恪遵教范，昭格上穹。 伏愿夜气澄清，天真登引，神魂可度，愿永遂於逍遥，母子有绿，或相逢於梦寐。 三日早朝词 林迎晓日，伤情看返哺之乌； 坛望昊天，衔赦想朝阳之凤，沐熏皈命，俯伏祈恩。 伏愿闻阖广开，珪璋入觐，念阳平之遗裔，俾缀仙班，受玉局之真诠，亲闻至道。 午朝词 日景舒长，怆南去北来之异路，天威咫尺，监母老子幼以何心，明水再陈，哀情深切。 伏愿符颁玉陛，勑下朱陵，乘飕羽以归来、略思旧隐，入宝珠而听莹，顿悟昨非。 晚朝词 白发青灯，永断持环之梦，金书丹简，爰依炼玉之科，夜景闲寥，斋功圆满。 伏愿乾文集布，帝泽广宣，遗世登真，既返天地山川之气，说经授道，应悟死生昼夜之常。 天师入觐回山奉旨修金镍斋宿启词 皇帝若曰：敬恭卜日，致山川社稷之心，礼乐事天，备玉帛鼓钟之实，乃三极交孚之际，当炁戒肃之初。",
      "translated_text": "**Li Clan’s Solemn Establishment of the Nine-Yin Ascension Rite for Deliverance of the Deceased Husband and Descendant Spirits: The Principal Invocation of the Orthodox Offering**\n\nLife and death are vast indeed—rites of celebration and mourning mark their bounds. With fasting, purification, and ablution, Heaven and Earth attend. Already, the golden tablets have bent to grace; now, with jade rites, we humbly offer thanks in clarity.\n\nWe recall with reverence: how shallow our portion of Heaven’s favor, how fleeting the kindness bestowed upon this handmaiden. In two years, seven bereavements—husband lost, then child, then grandchild. One body weeps for three generations. Daughters perished, grandsons followed; strange maladies arose, suspicions of lingering affliction. The divine trembled in wrath, calamities pressed without cease. This body dared not rest in ease; this heart knew its guilt.\n\nWe have purified ourselves, crossing the Six Paths to dissolve transgressions. Yet how much greater to prostrate in sincerity, to invoke the sacred peaks and plead for deliverance. August Heaven looms above; the bright waters declare themselves.\n\nWe pray: may the Dao’s life-giving spirits show mercy, may benevolence forsake no being. Through the ninefold refinement of immortal rites, may they be moved to unseal the gate of liberation. May the human realm be renewed, forever sealing the path of hidden suffering. May the day of grace dawn, and accumulated virtue repay Heaven’s debt.\n\n---\n\n**Preliminary Invocation**\nThe Supreme Emperor’s boundless compassion ever fears estrangement from the human way. Though all mortals must die, the true rites of salvation endure to aid all beings. Yet in old age, how could one lose both sky and earth’s support? Those long departed—who will open the ground of their rebirth?\n\nThus, with a heart of cinnabar sincerity, we reverently prepare the jasper altar. The five winds stir gently, fortunately upholding the mystic norm; the nine gates of cloud part, permitting dawn and dusk to enter the pure radiance.\n\n---\n\n**Morning Invocation**\nThe virtue of cherishing life is vast, moving the exalted sages to cast their light. The heart that honors the distant is enduring; we solemnly begin the morning audience and plead for deliverance. The sun’s qi bridges the meeting of Heaven and humanity; yang brightness communicates the mechanism of creation. The three realms commune in spirit; the nine springs rejoice. Jade texts spread across kalpas, guiding the way for immortals; golden tablets flow with cinnabar, sealing the sincerity of mortal pleas.\n\n---\n\n**Midday Invocation**\nRising early to serve the Emperor, the devotion of fasting remains incomplete. Approaching the court at noon, we lament family hardships too deep for words. External misfortunes have struck, bringing inner grief and mourning. All day we examine our faults; we repent our calamities before Heaven. Blocked paths now open in silence; the Northern Dipper severs the road of hidden suffering. Radiant clarity shines through; the Southern Palace raises the liberated souls.\n\n---\n\n**Evening Invocation**\nThe autumnal palace at dusk reflects the many hardships of human life. The morning rites extend into night; child-readers chant their subtle verses. The Dao opens the light of the hidden earth; virtue pours forth the nourishing dew of its surplus. May it aid the departed and bless the living. Heaven’s decree and human fate align—may we gather the twilight of the elm’s shade. May the sun’s glory flourish in posterity, ever more lush than orchid sprouts.\n\n---\n\n**Invocation to the Perfected Lady for the Thirty-Seventh Generation Celestial Master, Master Xīwēi**\n\nAlas! This disciple journeyed afar, only to die as a stranger and never return. Yet Heaven’s wisdom is keen; it pities the voiceless sorrow of the people. The door stands empty of hope—thus, the true words of the invocation begin.\n\nWe recall with reverence: so-and-so, having inherited the teaching for three years, packed his belongings and traveled ten thousand *li*. By the grace of his ancestors, he met with fortune; yet stricken by lingering illness, how suddenly he perished. The heart breaks at the arrival of letters from afar; the spirit grieves for the traveler’s shroud. The bond of mother and child, the vastness of life and death—we turn in devotion to the ancestral teaching, first sweeping clean the household.\n\nWe pray: may the four qi shine clear, may the five texts open wide. The North cannot be dwelt in long—may the Emperor dispatch the Three Summons. The Eastern Limit delivers boundless beings—may the scripture be transmitted ten times over.\n\n---\n\n**Second Day: Morning Invocation**\nDawn’s light is desolate; no robes bow before the mother. Mortal sorrow is poignant—we rely on letters to cry out to Heaven. The solemn presence of the ten directions and three realms descends; today begins the second day’s six audiences.\n\nWe pray: may yang radiance shine universally, may imperial decrees be issued. May the wandering soul of the northern wastes be permitted to follow the melting snow; may the immortal register of Penglai be inscribed, allowing transcendence and ascension.\n\n---\n\n**Midday Invocation**\nThe sun stands at its zenith; the brocade of day’s return is torn. Yet the spirit remains as if present—we raise incense of fragrant herbs in reverence. The cries for a lost child are mournful; the longing for Heaven is urgent.\n\nWe pray: may the Jade Heaven stir to action, may the Golden Gates dispense grace. May the great courtyard of flowing fire open wide, utterly dissolving all past stains. May they enter the ministry of the Supreme Mystery and achieve transcendence.\n\n---\n\n**Evening Invocation**\nThe hour of night’s settling arrives; the eldest son is no longer seen in the bedchamber. The evening audience of the rite proceeds; the assembled sages still attend the altar. We strictly adhere to the teachings, manifesting reverence before the lofty firmament.\n\nWe pray: may the night’s qi be serene and clear, may the celestial perfected guide the ascent. May the soul be delivered—may its wish for eternal freedom be fulfilled. May mother and child find connection, perhaps meeting in dreams.\n\n---\n\n**Third Day: Morning Invocation**\nThe forest greets the dawn sun; sorrowful, we watch the crow return to feed its parent. The altar gazes toward the vast sky; with pardon in mind, we think of the phoenix ascending at sunrise. Bathed in fragrance, we return to the command and prostrate ourselves to beg for grace.\n\nWe pray: may the gates of vastness open wide, may jade tablets enter the audience. Mindful of the descendants of Yangping, may they be attached to the immortal ranks. May they receive the true transmission of the Jade Bureau and personally hear the supreme Dao.\n\n---\n\n**Midday Invocation**\nThe sun’s light stretches long; grieving the divergent paths of south and north. Heaven’s majesty is close at hand—how can we bear the sight of an aged mother and young child? The bright waters are offered again; sorrow runs deep.\n\nWe pray: may talismans be issued from the Jade Steps, may decrees descend from the Vermilion Mound. May they ride the feathered wind to return, briefly recalling their old retreat. May they enter the jeweled pearl and listen to its radiance, suddenly awakening to past errors.\n\n---\n\n**Evening Invocation**\nWhite hair and a blue lamp—forever severed is the dream of holding a jade ring. Golden texts and cinnabar tablets—we rely on the rites of refining jade. The night’s scene is quiet and desolate; the fast’s work is complete.\n\nWe pray: may the celestial texts be gathered and spread, may the Emperor’s grace be widely proclaimed. May the departed ascend to perfection, returning the qi of Heaven, Earth, mountains, and rivers. May they expound the scriptures and transmit the Dao, awakening to the constancy of life and death, day and night.\n\n---\n\n**Preliminary Invocation for the Celestial Master’s Audience and Return to the Mountain, by Imperial Decree, to Perform the Golden Niche Fast**\n\nThe Emperor proclaims: with reverence, we have chosen an auspicious day to express our devotion to the mountains, rivers, and altars of the land. With rites and music, we serve Heaven, preparing jade, silk, drums, and bells in full measure. At this moment when the three realms commune in trust, we begin with solemn purification of qi.",
      "overlap_context": "thers all. Within lies the spontaneous workings of creation, here extending deliverance to the hidden and dark. Crane messages dawn in clarity; dragon patterns rise with the clouds. In reverence for the distant and the departed, one presents the sincere heart of self-purification. To escape suffering and ascend to truth, one gazes upward to the wondrous Dao of deliverance. Now is the time; Heaven indeed attends.\n\n---\n\n*Collected Virtues, First Scroll Concludes*\n*Collected Virtues, Second Scroll*",
      "start_char": 9333,
      "end_char": 10624,
      "start_sentence": 253,
      "end_sentence": 294,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.61481523513794,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\表奏类\\萃善录.txt",
        "category": "表奏类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "於行用金，其土皆玉，端倪仰止德，曷敢於二三； 戴履孔昭威，不违於咫尺，云车穆穆，星幄荧荧。 锡命会同，神合吉，时合序； 降祥兹至，日重晖，月重明。 七政咸齐，五兵不试。 早朝词 日出寅宾，尧则天而为大； 天休申命，汤铭日以能新。 存旦气之清明，秉晨朝而齐肃，有神如在，惟帝念兹，敛福群生，期不孤於皇极，书年大有，毋专美於春秋。 午朝词 离文明照，仰承并日之言，乾象高陈，敢替奉天之训，神洋洋其在上，皇刻刻兮扬灵，玄极受朝，清都分命，神州国本，镇九有以不摇，畿县民风，张四维而大治。 晚朝词 一信始秋，当莫朝而曰夕、寸诚独露，存夜气以事天，冲漠之际无私，密勿之间有命，丕承率祖，克相厥家，黄屋非心，允赖弼基之道，明堂坐治，敢违辅德之原。 正醮词 国称宗子，若重器之在躬，父日严君，宜平居而请命，时措敢违於责任，日宣密谢於扶持。 礼以达言，诚惟克享，民胞物与，同流一视之仁，俗美政成，丕显三灵之德。 千秋节宿启词 丕承任重，继体乾坤，载育惟时，潜心天地，诚远将於玉帛，仪只肃於瑶台，夙清下土之尘，俯埃高穹之命，琼轮出警鸾，和侧听於宸游，金录启玄鸿，造不违於夕奏。 三朝词 惟天孚佑下民，日省青宫之寄，自朝至于中昃，寅恭紫极之朝，抚己实生，效心远致，冀神灵之委鉴，绵宗社以流恩，五学身修，夙懋成人之地，两宫眉宇，春融问寝之天。 正醮词 国本承桃，责任敢违於继述，王春育质，主张实兆於生成，监诞日以遣香仪，即名山而修金箓，惟天不隔，若帝之临，监国抚军，极扶持於内外，问安侍膳，全忠孝於君亲。 宿启词 宫占象纬，驰使命以有严，方镇龙章，按坛仪之初肃，云阁琅霄之雨，尘消金殿之风，帝命春融，国忱夕奏，一体班行之序，明日将朝； 九阙辇路之光，惟天所命。 早朝词 升日车於黄道，晓肃朝班，拥仙仗於红云，空浮御路，致国家之忱悃，禳火土之光芒，虽君德自可以回天，必帝命以先之为地，星当翼轸，集百顺於皇躬，月在晋秦，合三方於洪福。 午朝词 天文推步，国禳太史之占，春昼朝元，使肃近臣之敬，祝厘者臣之责任，惧灾者帝可转移，对越修辞，敷宣待命。 首尾违行天道，星不珍於坤仪； 吉祥茂集慈躬，德永裨於乾御。 晚朝词 司历占星，窥授氛而奏上，奉祠祝国，存夜气以朝元，惟荧惑之留退靡常，而玄科之桧禳可用，纲维有在，回斡非难，主鬯无虞，蔼春晖於花萼，承桃有庆，动喜色於枫宸。 正醮词 乾称父，坤称母、台占留退之躔，天成象，地成形，国有祭禳之旨，玄范俯陈於琼馆，绿章上奏於清都，分命星辰，流恩君后，片言退舍，毋专美於春秋，一气居中，永镇安於民社，福沾圣嗣，庆衍宗枝。 圣节词 钦若昊天，式付纂承之重，无疆历服，深惟克绍之艰，揆初度以再时，爰省躬而事帝，斋修金箓，文启琼科，视听弗违，已罄朝元之礼，监临有赫，庸殚归美之诚，遥娣碧霄，重敷绿奏。 伏愿玄功不宰，玉历绵洪，阴阳调而风雨时，群生胥乐； 股肱良而庶物育，万邦以贞。 保生度往醮词 稔愆降疾，伏地省躬，追远固存，吁天请命，写丹心之耿耿，渎玄听之高高。 伏念尤悔积中，夭昏逮下，游魂为变，死者不可复生，天患有身，存者其能自保，两端危急，一揆忧惶。",
      "translated_text": "**Invocation for the Procession of Gold, Where Earth Becomes Jade**\n\nWhere gold is put to use, the very earth turns to jade. Gazing upward, we behold the boundless virtue—how dare we falter in resolve? The majesty of cap and sandal shines forth, never straying even a foot’s length. Cloud chariots advance in solemn grace, star-canopied tents glow with radiant light. Bestowed commands converge in harmony; spirits align with fortune, seasons with their proper order. Auspicious omens descend in full: the sun’s brilliance redoubles, the moon’s clarity deepens. The seven celestial bodies align in perfect order; the five weapons remain untried.\n\n---\n\n**Morning Audience Invocation**\n\nAt sunrise, the hour of *yin* receives its guest, as Yao took Heaven as his model in greatness. Heaven’s favor renews its mandate, as Tang inscribed the sun’s power to ever renew. Preserving the dawn’s pure and luminous *qi*, we hold morning court in solemn reverence. The divine presence abides—may the Emperor ever bear this in mind. Gathering blessings for all beings, may he never stand alone in his august rule. May the records of the year be bountiful, not monopolizing glory in spring and autumn alone.\n\n---\n\n**Midday Audience Invocation**\n\nThe radiance of *Li* illumines all, as we look up to receive the sun’s twin beams. The celestial image stands high—how dare we neglect Heaven’s entrusted teachings? The divine presence hovers above, vast and boundless; the sovereign’s spirit, moment by moment, manifests its power. The Dark Ultimate receives homage; the Pure Capital dispenses decrees. The foundation of the divine realm and the nation remains unshaken, securing the Nine Lands. The customs of the capital’s counties flourish, as the four cardinal virtues bring great order.\n\n---\n\n**Evening Audience Invocation**\n\nAs autumn’s first breath arrives, the day wanes into evening. A single thread of sincerity stands revealed, preserving the night’s *qi* to serve Heaven. In the vast and formless, no partiality exists; in the depths of secrecy, commands are issued. Grandly upholding the ancestral way, he assists his house with devotion. The imperial carriage is not his heart’s desire—truly, he relies on the Dao of foundational aid. Seated in the Hall of Light to govern, how dare he stray from the wellspring of assisting virtue?\n\n---\n\n**Principal Offering Invocation**\n\nThe state is called the eldest son, like a treasured vessel held close to the body. The father is revered as the august lord—even in quietude, one seeks his command. How dare we shirk this duty? Daily, we offer silent gratitude for his support. Through ritual, words reach their mark; through sincerity, offerings are received. All people are kin, all things companions—united in the benevolence of a single gaze. When customs flourish and governance is achieved, the virtue of the Three Powers shines forth in full.\n\n---\n\n**Preliminary Invocation for the Thousand Autumns Festival**\n\nBearing the weight of great responsibility, he succeeds to the mandate of Heaven and Earth. Nurturing life in due season, he attends to Heaven and Earth with a heart set afar. Sincerity extends beyond jade and silk; reverence is perfected upon the jasper terrace. Sweeping clean the dust of the lower realm, he humbly receives the high command of the vaulted heavens. Jade wheels advance with phoenix escorts, harmonizing with the imperial progress. Golden registers open the vast origins, their evening petitions never failing.\n\n---\n\n**Three-Audience Invocation**\n\nHeaven, in its trust, protects the people below. Daily, he reflects on the charge of the Eastern Palace. From dawn until the sun’s decline, he reveres the Purple Ultimate’s court. Examining himself, he finds his true nature; offering his heart, he extends his devotion afar. May the divine spirits deign to witness this, weaving blessings for the ancestral altars. In the Five Studies, he cultivates himself, diligently striving toward the realm of perfected personhood. In the Two Palaces, the brows relax, as spring’s warmth suffuses the halls of inquiry and repose.\n\n---\n\n**Principal Offering Invocation**\n\nThe nation’s foundation rests upon the peachwood talisman—how dare he neglect the duty of succession? In the spring of kings, he nurtures the substance of life, upholding the signs of growth and completion. On the day of birth, he sends fragrant offerings, ascending the sacred mountain to perform the Golden Register rites. Heaven’s gaze is not distant—it is as if the Emperor himself were present. Overseeing the realm and pacifying the armies, he extends his support within and without. Inquiring after well-being and attending meals, he fulfills loyalty and filial piety toward ruler and kin.\n\n---\n\n**Preliminary Invocation**\n\nThe palace mirrors the celestial patterns; envoys hasten with solemn urgency. The dragon-sealed decrees of the regional lords are received as altar rites commence in solemnity. Cloud-palace rains from the jade firmament wash away the dust; winds of the golden hall disperse. The Emperor’s mandate brings spring’s warmth; the nation’s sincerity is conveyed in evening petitions. Tomorrow, the ranks will assemble in perfect order for the morning audience. The radiance of the ninefold gates and imperial avenues awaits Heaven’s decree.\n\n---\n\n**Morning Audience Invocation**\n\nThe sun’s chariot ascends the Yellow Way as the dawn court assembles in solemnity. The immortal retinue gathers in the crimson clouds, floating above the imperial path. To convey the nation’s sincerity, we dispel the baleful influences of fire and earth. Though the sovereign’s virtue alone could turn Heaven’s course, he first seeks the Emperor’s command to establish the foundation. Stars align in *Yi* and *Zhen*, gathering a hundredfold obedience to the imperial person. The moon resides in *Jin* and *Qin*, uniting the three directions in vast fortune.\n\n---\n\n**Midday Audience Invocation**\n\nCelestial patterns are calculated; the state averts omens as the Grand Astrologer records them. In the spring’s bright daylight, envoys approach the Primordial with reverence. Offering blessings is the minister’s duty; averting disaster lies within the Emperor’s power to transform. Facing the divine, we refine our words and await commands. From beginning to end, we follow Heaven’s Dao—stars do not harm the earthly realm. Auspicious signs flourish around the compassionate person; virtue eternally aids the celestial chariot.\n\n---\n\n**Evening Audience Invocation**\n\nThe calendar-keeper observes the stars, divining portents to report above. Serving the altars and blessing the state, we preserve the night’s *qi* to approach the Primordial. Though the *yinghuo* planet’s movements are erratic, the dark rites of *gui* and offerings can still be employed. The great net remains in place; turning the course is not difficult. The lord’s sacrificial ale flows without worry, as spring’s radiance suffuses the flowery halls. With the peachwood talisman comes fortune, stirring joy in the maple palace.\n\n---\n\n**Principal Offering Invocation**\n\nHeaven is called Father, Earth is called Mother. The terrace observes the planet’s lingering and retreating paths. Heaven forms images, Earth forms shapes—the state holds the intent of sacrificial offerings. The dark model is presented in the jasper hall; green petitions ascend to the Pure Capital. Commands are issued to the stars, flowing blessings upon ruler and sovereign. A single word retreats—let not spring and autumn monopolize glory. A single *qi* resides at the center, eternally securing peace for the people and the altars. Blessings reach the sagely heirs, prosperity extends through the ancestral branches.\n\n---\n\n**Sacred Festival Invocation**\n\nReverently following the August Heaven, he is entrusted with the weight of succession. Enduring through boundless generations, he deeply reflects on the difficulty of carrying on the legacy. Measuring the first moments of his birth anew, he examines himself to serve the Emperor. Purifying the Golden Register, inscribing the jasper rites, his sight and hearing never stray. He has fulfilled the rites of approaching the Primordial; the divine oversight shines forth. Exhausting his devotion, he offers all praise. From afar, he unfurls green petitions beneath the azure vault.\n\nWe humbly pray: may the dark workings remain unforced, extending the jade calendar’s vast span. May yin and yang harmonize, wind and rain arrive in season, and all beings rejoice together. May loyal ministers flourish, all things be nurtured, and the myriad states stand firm.\n\n---\n\n**Offering for Preserving Life and Guiding the Departed**\n\nWhen harvests fail and illness descends, he prostrates himself to examine his conduct. Honoring the distant past remains ever-present; he cries out to Heaven to plead for life. Inscribing his steadfast red heart, he disturbs the lofty divine hearing.\n\nReflecting on accumulated transgressions and regrets, calamity and darkness have befallen the realm. Wandering souls transform; the dead cannot be revived. Heaven’s affliction lies in having a body; the living can scarcely preserve themselves. Caught between two perils, he is gripped by anxiety and dread.",
      "overlap_context": "y and night.\n\n---\n\n**Preliminary Invocation for the Celestial Master’s Audience and Return to the Mountain, by Imperial Decree, to Perform the Golden Niche Fast**\n\nThe Emperor proclaims: with reverence, we have chosen an auspicious day to express our devotion to the mountains, rivers, and altars of the land. With rites and music, we serve Heaven, preparing jade, silk, drums, and bells in full measure. At this moment when the three realms commune in trust, we begin with solemn purification of qi.",
      "start_char": 10624,
      "end_char": 11948,
      "start_sentence": 295,
      "end_sentence": 336,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 48.50138854980469,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\表奏类\\萃善录.txt",
        "category": "表奏类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "爰洁志於名山，祈通情於绛阙，科修金简，醮款琼轮。 伏愿丕显至仁，曲垂三宥，救苦之符广大，出苦无他，好生之德克周，延生有自，克昌家脉，永戴天恩。 丙寅普度斋宿启词 体天地心，抚三春而悲九夜，即神仙境，由千里而致一忱，玄范初盟，绿章敷奏。 伏念以平心而处物，将推己以及人，侧闻名山溥度之常，政协寸地永怀之自。 谓甚堪伶悯，魂而不祀者则为孤； 倘遂可超升，亲而当思者其敢后。 前言如日，中诚契天，既尝昭告以率先，敢不躬行而善始，坛规冰肃，辈路云开。 伏愿五炁凝真，三灵合德，玄风发育，又开太极之初； 道月光明，洞照重阴之表。 早朝词 帝馆云红，普泉曲希阳而度，仙阶土碧，肃班行戒晓之朝，日下照於倾葵，春不违於一草，更生之道，无息者天，明荐起於东方，有如此旦，乐莫加於南面，奚取斯言。 午朝词 道妙画前之易，相见乎离，阳生贞下之元，以观其复，望丹灵而请命，希金简以成功，三炁有融，一光普及，日魂既炼，了然以出於机，天性无违，超乎而会其极。 晚朝词 鹤序星罗，立夕仪之济济，龙章露奏，浮夜气之融融，存诚婵事帝之恭，演教袭度人之大，慧光烛下，心体镜如，玉字策勋，又睹三生之日月，宝符度命，重开四象之乾坤。 正醮词 雷动雨盈，幽壤之烦冤顿洗，天明地察，玄门之善利无私，惠泽潜符，斋忱允遂。 伏念服膺妙道，引领真科，莫得而名者，固非常名，无所不度者，是为溥度，乃启如心之恕，以干成物之仁，东极杨枝，密洒清凉之余润，始青黍米，中含发育之阳春，变法雨以涵濡，嘘灵风于枯朽、已着显然之功用，必无不济之幽冥，菲荐庸陈，隆恩曷报。 伏愿九真庆会，一德昭融，大道可以情求，人事尽而理现，本心所发，敢窥天地之全，庶物咸亨，孰外乾坤之大。 就普度会酬醮超度词 母子至情，尝致抱病保安之请； 幽冥异路，罔殚爱生伤死之思，一谢一祈，三熏三沐。 伏念臣亡男某，草茅贱质，蒲柳微资，偶违摄养之方，久困沉绵之疾，遂同夫主，仰告皇天，念驹犊之可怜，冀鸿厉之默佑，岂期夭折，糜药石以无功，相继凋零，痛药砧之倾世，莫逭未亡人之咎，竟乖元徽福之盟，兹逢普度之斋筵，回助往生之善果。 伏愿苍穹锡鉴，黑籍销名，日居月诸，用助孤螫之初款，父前子后，同登上品之仙阶。 五真人荐成舍人 天垂济度，恩不间於幽冥，人有恳祈，事每关於伤悼，一忱请命，百拜陈词。 伏念臣亡孙某，生也时乖，死而日远，襁中抱养，本为继绝之谋，冠后拟婚，遽作永归之诀，泉壤之涂既隔，母孙之念何穷，兹已及於大祥，敢肃陈於清醮、爰资荐拔，俾遂超升。 伏愿紫府洗愆，玄功锡造，性天朗彻，廓除宿昔之沈迷，法雨载濡，溥及迩遐之枯槁，凡兹灵识，同一逍遥。 会首建九幽荐亲宿启词 日往月来，思亲念切，天高地厚，追远心长，求大道以有门，醮名山而告简，愚诚宜致，师造曲成，琼篆发光，灵宝之科肇启，王书锡命，朱陵之路常开，不次之恩，莫穷之报。 三朝词 乾始坤生，天独存於沦祭，夙兴夜寐，日三接於朝仪，赖仙科成物之仁，启子职报亲之礼，俯陈凡捆，仰答真斿，惟孝感于神明，鞠躬兹愧，谓生同於夜旦，抚乎知归。",
      "translated_text": "**Purification of Intent at Sacred Peaks and Prayer at the Crimson Gates**\n\nThus he purifies his resolve upon renowned mountains, beseeching the transmission of his plea to the crimson palaces. He observes the rites of the golden tablets and offers libations to the jade wheels. May the supreme and manifest Perfect Benevolence deign to extend threefold pardon, that the talismans of deliverance from suffering be vast, and escape from suffering know no other path; that the virtue of cherishing life be all-encompassing, and the prolongation of life have its source. May the family line flourish, and the grace of Heaven be eternally borne.\n\n---\n\n**Opening Petition for the Universal Salvation Retreat on the Bingyin Day**\n\nEmbodying the heart of Heaven and Earth, he grieves for the three springs and mourns the nine nights. Approaching the realm of immortals, though a thousand *li* distant, he conveys a single sincerity. The primordial covenant is first pledged, and the green missive is presented. Reflecting that with an impartial heart he engages all things, he seeks to extend his own concern to others. He has heard that the perennial salvation of renowned mountains is universal, and this aligns with his own enduring aspiration for even the smallest measure of land. How pitiful it is that souls unremembered in sacrifice become orphaned! If they may yet attain transcendence, how could those who ought to think of their kin dare lag behind? His earlier words stand firm as the sun; his inner sincerity resonates with Heaven. Having once made a solemn vow to lead the way, how could he not personally enact a virtuous beginning? The altar’s rules are as pure as ice; the path of the assembly opens like parting clouds. May the five *qi* coalesce into truth, and the Three Spirits unite in virtue. May the mystic wind foster growth, once more inaugurating the primordial state of the Great Ultimate. May the moon of the Dao shine brightly, illuminating even beyond the deepest shadows.\n\n---\n\n**Morning Audience Petition**\n\nThe imperial halls glow crimson with clouds; the Yellow Springs bend to the sun’s passage. The jade steps of the immortals’ realm are arrayed in green; the ranks stand in solemn order for the dawn audience. The sun’s rays illuminate the prostrate sunflowers; spring does not forsake even a single blade of grass. The Way of renewal is ceaseless as Heaven. The bright offering arises in the East—such is this dawn. Joy is unmatched by facing south; why should these words be doubted?\n\n---\n\n**Midday Audience Petition**\n\nThe marvel of the Dao is depicted in the *Yi*’s \"Before the Drawing,\" where meeting occurs in separation. Yang arises from the firm’s end, and thus we observe its return. Gazing toward the cinnabar spirits, he petitions for life; aspiring to the golden tablets, he seeks accomplishment. The three *qi* harmonize; a single light pervades all. The solar essence is refined, emerging clearly from the mechanism. The celestial nature remains unobstructed, transcending to unite with its ultimate state.\n\n---\n\n**Evening Audience Petition**\n\nCranes arrayed like stars stand in solemn ranks at dusk; dragon-script petitions float upon the gentle night air. With utmost sincerity, he serves the Emperor; expounding the teachings, he inherits the great salvific work. Beneath the lamp of wisdom, the heart’s essence is as clear as a mirror. The jade registers record merit, and once more he beholds the sun and moon of three lifetimes. The precious talismans deliver life, reopening the *qian* and *kun* of the four images.\n\n---\n\n**Main Offering Petition**\n\nThunder resounds and rain overflows, washing away the grievances of the hidden earth. Heaven is luminous and Earth discerning; the mystic gate’s beneficence is impartial. The gracious blessings secretly align; the sincerity of the retreat is fulfilled. Reflecting that he upholds the wondrous Dao and aspires to the true rites—what cannot be named is beyond ordinary names; what saves all without exception is universal salvation—he initiates a compassion as boundless as the heart, seeking to perfect the benevolence that completes all things. From the Eastern Pole, willow branches secretly sprinkle the lingering coolness; within the green millet, the yang of spring’s growth is contained. Transforming the Dharma rain to nourish all, he exhales the divine wind upon the withered and decayed. Having already manifested evident efficacy, there shall be no unredeemed souls in the hidden darkness. Though his humble offerings are meager, how could he ever repay such profound grace? May the Nine Perfected rejoice in assembly, and the One Virtue shine in harmony. The Great Dao may be sought through sentiment; when human affairs are exhausted, principle is revealed. From the heart’s origin, he dares to glimpse the wholeness of Heaven and Earth. When all things flourish, who is excluded from the vastness of *qian* and *kun*?\n\n---\n\n**Petition for the Universal Salvation Assembly to Repay and Transcend**\n\nThe deepest bond of mother and child once prompted prayers for healing and peace. Though the paths of the living and the dead diverge, love for the living and sorrow for the dead are boundless. One expression of gratitude, one plea; thrice purified, thrice bathed. Reflecting that his late son, of humble birth and frail constitution, strayed from the path of nurturing care and languished long in debilitating illness, he and his wife together appealed to August Heaven. Moved by the pitifulness of their foal-like child, they hoped for the silent protection of the great spirits. Yet unexpectedly, he was cut down in his prime; medicines and stones proved futile. One after another, they withered away, grieving the loss of a generation. The surviving mother cannot escape blame, and the covenant of original blessing is broken. Now, on this occasion of the Universal Salvation retreat, he seeks to aid the cultivation of the departed’s good karma. May the azure vault witness and the black registers erase his name. May the cycles of sun and moon assist the first steps of the orphaned soul. May father precede and son follow, together ascending the immortal ranks of the highest grade.\n\n---\n\n**Petition of the Five Perfected to Recommend the Deceased Attendant**\n\nHeaven’s grace in salvation does not exclude the hidden darkness. When people make earnest supplications, their affairs often concern grief and mourning. With a single sincerity, he petitions and prostrates a hundred times. Reflecting that his late grandson, born in an inauspicious time and long departed, was raised in swaddling clothes to continue the family line. After coming of age, marriage was planned, yet suddenly he was lost forever. The paths of the living and the dead are now sundered; the bond between grandmother and grandson knows no end. Now that the great mourning period has arrived, he dares to solemnly present this pure offering, seeking to aid his ascent. May the Purple Palace cleanse his transgressions, and the mystic power bestow creation. May his celestial nature shine clearly, dispelling past delusions. May the Dharma rain nourish all, reaching both near and far, the withered and the decayed. May all these numinous consciousnesses together attain carefree wandering.\n\n---\n\n**Opening Petition by the Assembly Leader for the Nine Dark Realms to Recommend Kin**\n\nAs days pass and months come, thoughts of kin grow ever more poignant. Heaven is high and Earth is deep; the heart that honors the distant past is enduring. Seeking the Great Dao’s gate, he offers libations upon renowned mountains and presents petitions. His foolish sincerity is fitting; the master’s guidance brings completion. The jade script emits light, inaugurating the rites of the *Lingbao*; the royal writ bestows life, and the path of the Vermilion Mound remains ever open. Such unmerited grace defies repayment.\n\n---\n\n**Three-Day Petition**\n\n*Qian* begins and *kun* is born; Heaven alone endures through the ages. Rising early and retiring late, he thrice approaches the audience rites each day. Relying on the immortals’ rites that perfect all things, he initiates the filial duty of repaying his parents. Humbly presenting his offerings, he looks up to answer the true banners. Only through filial piety can he move the divine; bowing in reverence, he feels shame. Considering that life is as fleeting as night and day, he reflects on where he ought to return.",
      "overlap_context": "self to examine his conduct. Honoring the distant past remains ever-present; he cries out to Heaven to plead for life. Inscribing his steadfast red heart, he disturbs the lofty divine hearing.\n\nReflecting on accumulated transgressions and regrets, calamity and darkness have befallen the realm. Wandering souls transform; the dead cannot be revived. Heaven’s affliction lies in having a body; the living can scarcely preserve themselves. Caught between two perils, he is gripped by anxiety and dread.",
      "start_char": 11948,
      "end_char": 13215,
      "start_sentence": 337,
      "end_sentence": 369,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 46.51576614379883,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\表奏类\\萃善录.txt",
        "category": "表奏类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "正醮词 斡旋人道，生生之造无穷，瞻望帝合，疑疑之忱惟谨，恭趋仙境，俯控丹衷。 伏念蒿目怀亲，草心游子，昊天罔极，莫回长夜之光明，春雨既濡，益重九原之凄惨，况本根之难泯、在眷序以攸同，凭金简以出幽途，遵玉符而开生路，恪陈清醮、祇答洪休。 伏愿三黑流光，一元启运，物观其复，又分太极之天，光晦而明，载育中华之地，铭心从欲，种德酬恩。 荐孙真率宿启词 追远何由，教育之原敢昧； 出幽有造，超升之望焉依，庸历寸丹，恭祈三宝。 伏念先师某，生惟任直，死亦无他，人事莫齐，美恶难调於众口； 世绿多妄，晦明或昧於本心，惧寡过以未能，率下忱而有请，乃修玄范，昭洁瑶坛。 伏愿教道所宗，师真实主，玉书炳焕，照开十地之门； 琼驾徘徊，来下九天之驭，仰瞻伊始，望幸无穷。 三朝词 夙兴卜日、祈超异骨之亲，夕惕事天，肃致寸心之敬，朝端谨饬，帝所清高，惟师承难泯於后人，盖道用不违於一物，资凭善利，接引冥行，金简通神、直指逍遥之地、丹台听命，同游清静之天。 正醮词 授业惟师，莫诂九原之下，生神有道，又开太极之初，允荷曲成，敢忘大造。 伏念先师某，幻而为果，空本无花，望冥海之茫洋，云何超越，赖玄科之方便，得所凭依。 摄先灵以惠来，度苦魂而兼济，万绿解纽，三业无根，酬恩羞藻荐之恭，执礼尽葵倾之敬。 伏愿灵尊克享，至泽旁流，法身报身，一指虚无之路； 天道人道，同为清静之归，余庆所沾，后昆永戴。 张国祥荐父终七词 无父何怙，嗟为子以略依； 谓天盖高，痛思亲而曷报，日云终七，露捆再三。 伏念亡父某，涉世心长，谋身计拙，惟劳生若梦，欲寡过以未能； 曰度死有科，岂遗孤之敢后，洁蜗庐而请命，告龙简以宣恩，敬寓演污，礼陈清醮。 伏愿至仁无外，洪造有容，一及矜追远之诚，恢广济生之道，太虚荡荡，漠乎无朕之神，长夜漫漫，示以自新之路。 张梧山还保女醮词 惟疾之忧，女均为子，无德不报，人敢违天，果符一愿之愚，敢负初盟之善。 伏念某昨因女某，血滞於气，乳结而瘫，尽乞灵彻福之心，庶几不死； 拜度厄消灾之赐，幸尔更生。 相攸已遂於宜家，醮款仍书於欠籍，乃清尘宇，祇肃飕车。 伏愿云拥洪禧，星开黄道，门阑多喜，春浓甥馆之娱； 宅相克成，早满亲庭之望，百为兼顺，二美同荣。 张资姜间还玉台保母 疾首弗廖，莫代慈闱之痛；",
      "translated_text": "**Main Petition**\n\nThe Dao revolves through the human realm, its creative power of generation without end. Gazing toward the imperial union, his reverent sincerity remains unwavering. He hastens to the immortal realm, humbly submitting his red heart.\n\nReflecting on the wanderer’s longing for kin and the child’s grass-like heart, he recalls the boundless grace of Heaven, which cannot restore the light of the long night. The spring rains have moistened the earth, deepening the sorrow of the Nine Springs. How can the root of life be erased? In kinship, all share the same bond. Relying on the golden tablet to emerge from the dark path and following the jade tally to open the road of life, he devoutly presents this pure offering, reverently answering the great favor.\n\nMay the Three Blacks stream forth their radiance, and the Primordial Qi initiate its course. All things return to their origin, and the Supreme Ultimate divides the heavens. Light emerges from obscurity, nurturing the Central Land. Inscribed in the heart, desires are fulfilled; virtue is cultivated to repay kindness.\n\n---\n\n**Petition by Sun Zhen to Invoke the Host of Former Worthies**\n\nHow can one repay distant ancestors? The source of education must not be obscured. To deliver the departed from darkness and raise them to transcendence, where else can hope be placed? With a heart of sincerest devotion, he reverently invokes the Three Treasures.\n\nReflecting on his late master, in life he was upright, and in death, he harbored no regrets. Yet human affairs are never uniform, and praise or blame is hard to reconcile in the mouths of many. The world is full of falsehoods, and the true heart may be obscured. Fearing his own shortcomings, he follows his humble sincerity and makes this request. Thus, he establishes the mysterious model, adorning the jade altar with purity.\n\nMay the teachings he revered and the true master of the Dao shine forth, their jade script resplendent, illuminating the gates of the Ten Grounds. May the jade chariot linger, descending from the Nine Heavens’ procession. Gazing upward, he awaits the beginning, his hope boundless.\n\n---\n\n**Three-Day Petition**\n\nRising early, he divines the day to pray for the transcendence of his departed kin. Vigilant at dusk, he serves Heaven with a heart of utmost reverence. At dawn, he conducts himself with care, for the imperial realm is pure and lofty. The master’s legacy must not fade among later generations, for the Dao’s function does not stray from a single thing. Relying on good fortune and blessings, he guides the dark journey. The golden tablet communicates with the divine, directly pointing to the land of carefree wandering. The cinnabar terrace heeds the command, joining the journey through the heavens of purity and stillness.\n\n---\n\n**Main Petition**\n\nThe transmission of learning depends on the master; none can fathom the depths of the Nine Springs. The Way of generating spirits reopens the beginning of the Supreme Ultimate. How could he forget the great creation that bends to perfect all things?\n\nReflecting on his late master, illusion gives rise to karmic fruit, for emptiness itself bears no blossoms. Gazing upon the vast and boundless sea of darkness, how could he transcend it? Yet through the expedient means of the mysterious rites, he finds a place of reliance. Gathering the departed spirits to bestow kindness and delivering suffering souls to universal salvation, the myriad knots are untied, and the three karmic roots are severed. In repayment of kindness, he offers the reverence of fragrant herbs; in observance of ritual, he pours forth the devotion of the sunflower.\n\nMay the divine lords deign to receive his offering, their boundless grace flowing everywhere. Dharmakāya and saṃbhogakāya alike point to the path of emptiness. The Dao of Heaven and the Dao of humanity converge as the return to purity and stillness. May the blessings he receives extend to his descendants, who will forever bear them in gratitude.\n\n---\n\n**Zhang Guoxiang’s Petition for His Father on the Final Seventh Day**\n\nWithout a father, what can a child rely upon? Alas, as a son, he has little to depend on. He laments that Heaven is too high, and the debt to his parents too great to repay. The seventh day has come to an end, and the dew-like offerings are made again and again.\n\nReflecting on his late father, he navigated the world with a long heart but plotted his life with poor skill. His toils were like a dream, and he longed to avoid faults but could not. Now, with rites to guide the dead, how could his orphaned son dare to lag behind? He purifies his humble abode to petition the divine and announces his plea on the dragon tablet to proclaim grace. With respect, he performs the muddy and impure rites, presenting the pure offering.\n\nMay the boundless benevolence extend everywhere, and the great creation embrace all. In response to his earnest devotion to distant ancestors, may the path of salvation for all beings be broadened. The Great Void stretches endlessly, the divine without trace. The long night is vast, yet the path of renewal is shown.\n\n---\n\n**Zhang Wushan’s Petition for the Return and Protection of His Daughter**\n\nIllness is a shared concern, whether for daughter or son. No virtue goes unrequited, and no one dares defy Heaven. His foolish wish has been fulfilled, and he dares not betray the goodness of their original vow.\n\nReflecting on his daughter, her blood stagnated in her *qi*, and her milk congealed into paralysis. With a heart desperate for divine aid and blessings, he prayed she might not die. Bowing in gratitude for the gift of deliverance from suffering and the elimination of disaster, he rejoiced in her rebirth. Now that her fate is settled in a harmonious home, the debt of the offering remains recorded. Thus, he purifies the dusty hall and solemnly prepares the wind-borne chariot.\n\nMay clouds gather to bestow great fortune, and stars align to open the Yellow Road. May joy fill the gates, and the spring deepen the delight of the daughter’s chamber. May the house’s prosperity be fulfilled, swiftly meeting the hopes of the family. May all affairs proceed smoothly, and both virtues shine together.\n\n---\n\n**Zhang Zijiang’s Petition for the Return of the Jade Terrace’s Wet Nurse**\n\nThe pain of illness is unbearable, and none can replace the sorrow of a mother’s chamber.",
      "overlap_context": "un* is born; Heaven alone endures through the ages. Rising early and retiring late, he thrice approaches the audience rites each day. Relying on the immortals’ rites that perfect all things, he initiates the filial duty of repaying his parents. Humbly presenting his offerings, he looks up to answer the true banners. Only through filial piety can he move the divine; bowing in reverence, he feels shame. Considering that life is as fleeting as night and day, he reflects on where he ought to return.",
      "start_char": 13216,
      "end_char": 14161,
      "start_sentence": 370,
      "end_sentence": 403,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.59114646911621,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\表奏类\\萃善录.txt",
        "category": "表奏类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "矢心请梼，幸推金阙之仁，礼宝诰以无他，奏药功而有自。 念拜虽万万，果何益於昊天，然听匪高高，实潜通於寸地，庸告成於愿力，爰敬藏於醮修，潢潦至微，清都不远，惟帝心之简在，祈母算以增延。 菽水春晖，锡双亲之齐老，萱花晚景，增百福以攸同，何以酬恩，敢忘种德。 还保岳母醮词 亲其亲，长其长，宜休戚之相关； 道可道，名可名，信精诚之不隔，赖天从欲，伏地知归。 伏念某昨以外母某，疾亟于躬，势危如发，急於问寝，惧穷日之后时； 行未及门，乃吁天於中道。 半子之心如愿，上帝之德日生，敢食盟言，谨陈醮礼。 伏愿寿增宝历，数斡玑缠，堂上萱桩。 耐春光而不老，门中桃李，托余荫以同荣，永戴艰穹，旁沾玉润。 黄竹轩提点七十常住建醮庆毒词 大厦栋梁之寄，主者独称，七旬弧矢之期，人生所庆。 以福地寅恭之义，致祈天助爱之诚，惟帝所从，允臣至愿，壶中日月，留不老之春光，铛外山川，均无穷之道味。 节次启许保安七醮合醮词 渎本戒三，瓦乞灵而致七； 敬惟主一，庸专志以酬初。 寓捆绿章，通诚丹陛，伏念山林之役，天地焉休，俯省前猷，积愿言而莫践，适当后继，凛负咎以奚文，虽本原所任之责有殊，然福利奉公之心则一，神岂可负，道无不同，爰戴醮以报恩，冀鉴情而宥过。 伏愿大造优容，众真饮格。 谢往愆，祈终惠，来日正长，居善地，乐清时，惟天所命。 众为某保安词 人疾必呼其父母，谁使之然，仙源端赖於祖宗，宜众以告。 惟吕氏某，以弱质处胚辉之际，偶深居失调护之方，驯致微病，颇关远虑。 念仰瞻推本，岂能违师天裕后之恩； 苟回盼资生，即自有随日遣安之道，外求则妄，至敬无文。",
      "translated_text": "**Zhang Zijiang’s Petition for the Return of the Jade Terrace’s Wet Nurse (continued)**\n\nWith steadfast heart, I offer prayers, trusting in the golden palace’s benevolence. The sacred edicts hold no other decree, and the efficacy of the healing rites has its source. Though my prostrations number ten thousand, what benefit do they bring to the vast heavens? Yet the divine ear is not so lofty as to be deaf to the humblest earth—thus, I humbly fulfill my vow through these rites, reverently storing the offerings within the sacred altar. Though the waters of the moat be but a drop, the Celestial Capital is not far. May the Emperor’s heart, ever discerning, grant the extension of my mother’s years.\n\nMay the warmth of beans and water repay the spring radiance of my parents’ shared old age; may the late-blooming daylily of her twilight years flourish with a hundred blessings. How could I repay such grace? Dare I forget the cultivation of virtue?\n\n**Prayer for the Return of the Mountain Mother’s Rites**\nTo honor one’s kin is to honor the aged; joy and sorrow are rightly shared. The Dao that can be spoken is not the eternal Dao; the name that can be named is not the eternal name. Yet in the sincerity of my devotion, no barrier stands. Relying on heaven’s compliance with my desire, I prostrate myself in gratitude.\n\nRecalling how my maternal mother, so-and-so, fell gravely ill, her condition as precarious as a single hair, I hastened to her bedside, fearing the day’s end would come too soon. Before I could reach her door, I cried out to heaven mid-journey. My filial heart’s wish was granted, and the Emperor’s virtue daily renewed. Dare I break my vow? Thus, I present these rites with reverence.\n\nMay her life be lengthened by the precious calendar, her years guided by the turning jade. May the daylily in the hall endure the spring’s light without aging; may the peach and plum within the gate thrive in her lingering shade. May she forever bear the weight of heaven’s grace, and may her blessings overflow like jade’s luster.\n\n**Huangzhu Pavilion’s Director’s Prayer for the Seventieth Anniversary Rites**\nThe great hall’s pillars and beams rest upon a single steward; the seventieth year of life is a cause for celebration. In the reverence of this blessed land, I offer prayers for heavenly aid with utmost sincerity. May the Emperor’s will align with my deepest wish. May the days and months within the gourd preserve an ageless spring; may the mountains and rivers beyond the cauldron share the boundless flavor of the Dao.\n\n**Petition for the Sevenfold Rites of Protection and Peace**\nTo trespass thrice is forbidden, yet I beg sevenfold grace; to honor the One, I devote my whole heart to repaying my vow. Entrusting my green missive, I convey my sincerity to the vermilion steps.\n\nRecalling my service in the mountains and forests, how could heaven and earth not favor me? Yet reflecting on my past conduct, I see unfulfilled vows and broken promises. Now, as I strive to continue, I tremble at the weight of my failings—how can I justify them? Though the responsibilities of my office differ, my heart in serving the public good remains the same. How could the gods betray me? The Dao knows no division. Thus, I offer these rites in gratitude, praying the gods will see my sincerity and pardon my transgressions.\n\nMay the great creation show forbearance, and may the assembled immortals accept my offerings. May past faults be absolved, and future blessings secured; the days ahead are long. May I dwell in a blessed land, delight in a pure era, and submit to heaven’s decree.\n\n**Collective Prayer for So-and-so’s Protection**\nWhen illness strikes, one calls for their parents—who else could bring such urgency? The wellspring of immortality flows from our ancestors; thus, we gather to make this plea.\n\nSo-and-so of the Lü clan, born with a delicate frame amid the radiance of the womb, has dwelled in seclusion, lacking proper care. A minor ailment has arisen, giving cause for distant concern. Looking upward, I trace the source of my lineage—how could I forsake the grace of my teachers and heaven’s favor for posterity? Yet if I turn my gaze to the sustenance of life, I find the means to ensure daily peace. To seek aid from without is folly; my utmost reverence remains unadorned.",
      "overlap_context": "chariot.\n\nMay clouds gather to bestow great fortune, and stars align to open the Yellow Road. May joy fill the gates, and the spring deepen the delight of the daughter’s chamber. May the house’s prosperity be fulfilled, swiftly meeting the hopes of the family. May all affairs proceed smoothly, and both virtues shine together.\n\n---\n\n**Zhang Zijiang’s Petition for the Return of the Jade Terrace’s Wet Nurse**\n\nThe pain of illness is unbearable, and none can replace the sorrow of a mother’s chamber.",
      "start_char": 14161,
      "end_char": 14826,
      "start_sentence": 404,
      "end_sentence": 428,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.334280729293823,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\表奏类\\萃善录.txt",
        "category": "表奏类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "伏愿醮捆上孚，奏言下锡，艾香越井，早收神药之奇功； 兰茁谢庭，行见孙枝之喜色，纲维有在，铭镂难磨。 吴宗师丙寅冬捧香回山建醮并庆成三清殿宿启词 惟天惟祖宗，纂承任重； 有民有社稷，定保心长，适名山崇帝所之新，以秩祀致国忱之远，乃驰玄使，祇肃瑶坛。 昭其度、昭其文，斋庄有执； 潜而天、潜而地，敷奏以言。 早朝词 至诚望秩，朝彻无违，大本欲安，夙夜以告，惟高厚之气顺，则参赞之功存，修德承天，享诚随地，一元保合，时成物象之通，三极交孚，日永道原之大。 午朝词 六管阳生，揆国经於治象； 九关昼接，祈邦本於时康，盖有民为两极之心，而立命者一人之责，多仪克享，明照不违，四海永清，诞保金瓯之固，三时不害，益绵玉烛之和。 晚朝词 天付有家，修身为本，日严只敬，遵道而行，存夜气以敷言，致夕仪而对越，非后何戴，惟帝念兹，宫壶一和、式永绥於内治，宗枝百顺，尚丕显於前猷。 正醮词 小心图治，协和之效如斯，一德感神，望秩之忱敢后。 属真境告成於御宇，以祠官柢荐於多仪。 乾文之昭示者，欲得其平，地利之或乖者，盍求其故。 何以纳黎元於熙洽，何以臻中外之ㄨ安。 为国有经，涉渊思济，每见几於终日，惟助顺之在天，麟趾应时，自省玉成之道，鸿禧流庆，永依钧转之仁，一气还元，太平有象。 丁卯春建保安醮词 福地措躬，每怀远虑，云天垂荫，允赖真灵，敢忘燕安防患之时，况值蜻集建斋之日。 葵倾请命，藻荐祈恩，愿悯至情，介水官而永镇； 相安无事，戴渊造以难磨。 天师退潮预建醮词 省府忧潮，致驿书而有命，臣门如水，率祖教以将行。 心惟道之是遵，事非天而曷济。 预陈清醮，仰冀洪恩，威命焕颁，祈早清於海怪，教风诞播，还旧障之沙堤，益固民情，永宁邦本。 戊辰年天师建黄镍宿启词 黄坛特启，按参天两地之规，丹府具陈，酬三世一家之愿，思过不几於寡信，践言兼首於前非，明察有容，显幽是赖。 伏愿道常善应，斡化机於仪象之问，圣不可知，交神气於天人之表，诂朝而见，先事以闻。 一日早朝祝君 忠实答天，奉斋科之重典，清明在旦，谨礼节於初朝，假灵不敢以及私，赞化先期於报上。 伏愿晓开阊闱，日暖旌旗，乾符坤珍，洽睹垂衣之治，天心民命，欢吟洗甲之诗。 午朝臣僚 上答天心，孙谋子职，俯绥国本，世治臣贤，朝真敷昼接之诚，宣化极时需之望。 伏愿庆霄扶日，寒谷嘘春，玉烛顺时，不出燮调之外，金汤固本，咸归陶冶之中。 晚朝天下 斋忱夕奏，洁己而言，教典夙遵，裕民为急。 敢曰遽形於私请，幸期先及於生灵。 伏愿昧谷阳生，景星光现，帝怜赤子，春回草木之寒，天转洪钧，日借桑榆之暖。 二日早朝孤爽 昧爽朝元，曦输雨旦，大明烛下，渊鉴兼融，念谁怜游魄之无归，欲自拔迷津而莫可，惟玄科之有道，此上帝之至仁。 伏愿慧日乘晨，灵风造晓，坎纳戊，离纳己，乃火降以水升； 乾资始，坤资生，又天涵而地育。 午朝正荐 日瑞再中，何造朝之喋喋，天临在上，敢徽福於冥冥，重惟一门谢世之亲，诞启十回度人之道，玉文有证，金简无私。 伏愿炼质离明，超神旅进，祖其裕后，仰承玄省之宗，女亦有仙，尚隶易迁之籍。",
      "translated_text": "**Supplication for Divine Favor**\nMay the offerings ascend in perfect sincerity, and the sacred words descend in gracious bestowal. As mugwort’s fragrance rises beyond the well, may the marvels of divine medicine swiftly manifest; as orchids bloom in the courtyard, may the joy of flourishing descendants soon be seen. The cosmic order endures, and this inscription shall never fade.\n\n**Memorial for the Completion of the Three Pure Ones Hall at Mount Wu, Presented by Master Wu in Winter of Bingyin**\nHeaven and ancestors bear the weight of succession; the people and the state demand enduring protection. Thus, we ascend this sacred mountain to honor the newly established imperial shrine, offering solemn rites to convey the nation’s distant reverence. We dispatch celestial envoys to reverently prepare the jade altar. Illuminating its rituals, illuminating its scriptures, we maintain solemnity in our observances. Though unseen in heaven, unseen on earth, we present our supplications in words.\n\n**Morning Audience Prayer**\nWith utmost sincerity, we perform the rites without fail. Seeking to stabilize the great foundation, we offer prayers day and night. When the qi of heaven’s vastness flows in harmony, the work of cosmic assistance endures. Cultivating virtue to align with heaven, we offer devotion wherever we dwell. As the primordial unity is preserved, the seasons manifest their cyclical passage; as the three realms commune in trust, the greatness of the Dao’s origin endures through time.\n\n**Midday Audience Prayer**\nAs yang energy revives in the six conduits, we measure the nation’s governance by its ordered signs. As the nine celestial gates open to the day, we pray for the state’s foundation to thrive in prosperity. For the people embody the heart of the two poles, while the ruler bears the sole responsibility of establishing destiny. Through abundant rites, we receive unobstructed illumination. May the four seas remain eternally pure, firmly securing the golden vessel of the realm; may the three seasons bring no harm, perpetuating the harmony of the jade candle.\n\n**Evening Audience Prayer**\nHeaven entrusts the household, and self-cultivation is its foundation. Day by day, we uphold reverence, following the Dao in our conduct. Preserving the night’s qi, we present our words; observing the evening rites, we face the divine. Without a sovereign, whom would we serve? The Emperor alone considers these matters. When the inner palace is harmonized, may lasting peace govern within; when the ancestral branches flourish in obedience, may former achievements be gloriously extended.\n\n**Primary Offering Prayer**\nWith humble diligence, we seek governance, and the effects of harmony are thus achieved. With unified virtue, we move the spirits, and our reverent devotion dares not lag behind. As the sacred precinct is completed under imperial rule, we, the ritual officers, present our many offerings. The clarity of Qian’s pattern demands balance; where earthly forces falter, we must seek their cause. How shall we guide the people toward flourishing harmony? How shall we bring peace to all within and beyond? The state’s principles are established—we contemplate crossing the abyss to deliver aid. Daily, we perceive the signs of the times, for heaven’s assistance lies in following its will. The unicorn’s hooves respond to the season, as we reflect on the Dao of jade-like perfection. Vast blessings flow in ceaseless grace, ever dependent on the turning of heaven’s benevolence. As the primal qi returns to its source, the image of great peace emerges.\n\n**Prayer for the Bingmao Spring Protection Rites**\nThough dwelling in a blessed land, we remain ever mindful of distant concerns. Under the sheltering clouds of heaven, we rely truly on the divine. How could we forget the time for vigilance against complacency, especially now, as the dragonflies gather and the fast begins? Like sunflowers turning to the light, we beseech the mandate; with refined offerings, we pray for grace. May the Lord of Waters take pity on our sincerity and grant eternal stability. May all remain peaceful, and the depths of the abyss prove indelible.\n\n**Preemptive Rites for the Receding Tides, Presented by the Celestial Master**\nThe provincial authorities, troubled by the tides, dispatched urgent orders. My household, humble as flowing water, follows ancestral teachings in preparation. My heart adheres solely to the Dao—without heaven’s aid, how could these matters succeed? We preemptively present the pure rites, humbly beseeching vast favor. As the radiant mandate is proclaimed, we pray for the swift pacification of sea monsters. As the winds of teaching spread, may the sand barriers of old be restored. May the people’s resolve be strengthened, and the state’s foundation eternally secured.\n\n**Memorial for the Yellow Register Rites of Wuchen Year, Presented by the Celestial Master**\nWe specially inaugurate the yellow altar, adhering to the celestial and terrestrial regulations. From the cinnabar repository, we present offerings to fulfill the vows of three generations and one family. Though our transgressions are few, our faith has been wanting; though we pledge reform, we still confront past errors. Yet in clarity, we find tolerance; in the unseen, we place our trust. May the Dao ever respond with goodness, turning the mechanisms of transformation within the celestial patterns. Though the sage remains beyond comprehension, may the qi of spirits and humans commune beyond the heavens. May we perceive the dawn and foresee events before they unfold.\n\n**First Day, Morning Audience Prayer for the Sovereign**\nWith loyal sincerity, we answer heaven, upholding the weighty rites of the fast. At dawn’s clarity, we meticulously observe the initial audience’s ceremonies. We dare not invoke divine power for private ends but first offer our assistance in repaying heaven’s grace. May the gates of the celestial palace open at dawn, the sun warm the banners, and the treasures of heaven and earth harmonize, revealing the governance of tranquil rule. May the hearts of heaven and the people rejoice, singing the songs of disarmed peace.\n\n**Midday Audience Prayer for the Ministers**\nIn answering heaven’s will, we fulfill the duties of descendants and ministers. Looking down, we stabilize the state’s foundation; through generations of good governance, ministers prove worthy. Presenting our daytime devotion to the true, we proclaim the urgent hopes of the times. May auspicious clouds support the sun, and the cold valleys exhale spring. May the jade candle align with the seasons, its harmony never straying from perfect balance. May the golden cauldron fortify the foundation, all within the realm of nurturing transformation.\n\n**Evening Audience Prayer for All Under Heaven**\nWith evening devotion, we present our pure words. Having long followed the teachings, we prioritize the people’s well-being. We dare not hastily voice private requests but first hope for the welfare of all living beings. May the sun rise from the dark valley, and auspicious stars shine forth. May the Emperor pity his children, and spring’s warmth return to the cold grass and trees. May heaven turn its vast potter’s wheel, and the sun lend its warmth to the twilight years.\n\n**Second Day, Early Dawn Prayer for the Lonely Souls**\nAt the dim light of dawn, we face the origin; as the sun emerges, rain glistens at daybreak. Beneath the great brightness, profound insight merges. Who pities the wandering souls with no return? Who can pull them from the sea of delusion? Only the Dao of the sacred rites offers this path—such is the Supreme Emperor’s utmost benevolence. May the sun of wisdom rise with the morning, and the divine wind arrive at dawn. Kan receives Wu, Li receives Ji—thus fire descends as water ascends. Qian provides the beginning, Kun nurtures life—thus heaven encompasses and earth fosters.\n\n**Midday Prayer for the Primary Offering**\nAs the sun’s auspice reaches its zenith again, why should our morning prayers be incessant? Heaven watches from above—how dare we seek blessings in obscurity? We especially honor the departed kin of this household, who initiated the tenfold Dao of salvation. The jade texts bear witness; the golden tablets hold no partiality. May their refined essences depart from brightness, advancing beyond the spirit journey. May ancestors bless their descendants, upholding the lineage of the mysterious province. Though women too may attain immortality, they remain bound to the registers of change.",
      "overlap_context": "make this plea.\n\nSo-and-so of the Lü clan, born with a delicate frame amid the radiance of the womb, has dwelled in seclusion, lacking proper care. A minor ailment has arisen, giving cause for distant concern. Looking upward, I trace the source of my lineage—how could I forsake the grace of my teachers and heaven’s favor for posterity? Yet if I turn my gaze to the sustenance of life, I find the means to ensure daily peace. To seek aid from without is folly; my utmost reverence remains unadorned.",
      "start_char": 14826,
      "end_char": 16114,
      "start_sentence": 429,
      "end_sentence": 476,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.29006910324097,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\表奏类\\萃善录.txt",
        "category": "表奏类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "晚朝附荐 臣卜其夜，仙贵度以垂文，人有常言，仁者存乎博爱。 眷道俗戚疏之既往，想精神魂魄以何之，一指虚无，同归清静。 伏愿慧光如月，觉性俱天，幻身非身，了取灵明之本，无质生质，超然夜旦之常。 三日早朝教门 日射金门，三觐红云之晓，露陈玉座，一干玄造之春，护焉司教之在躬，惕若随时之为义，闰杨相戒，战栗以言。 伏愿遵晦而明，依光不昧，真源承绪，箕裘之学无遗，新渥如纶，冠褐之宗益大。 午朝师门兼宫门 千年祖教，嗣福地以奉祠，大易人文，列家人之正位，相关幽戚，均乞平安。 朝接昼以云三，听回春而采录。 伏愿天光日丽，云覆雷同，绵绵香火之隆，恩覃自上，秩秩本支之茂，福在其中。 晚朝祈嗣 久矣呼天，冀玄宗之有托，凛焉终日，何素志之未孚。 想因先世之所招，或者微躬之自召，将非冢讼，其有诅盟。 适当朝谒之终，辄敢敷陈之告。 伏愿列真肆赦，洗万罪以消屯，九气妙凝，接一阳而来复。 昊天正词 天籍屡书，有上世久盟之黄线，露忱密奏，兼微臣自许之丹衷，答贶愆期，陈情俟命。 伏念某少而失估，惕若投艰，半生素志之未孚，一脉后忧之甚大。 亲莫留而愿在，躬自省以心知，事会因循，默推源之有故，神明森列，岂责报之所关，苟为又食斯言，其将奚辞于罚，千愆并谢，三款一酬。 伏愿曲宥无遗，俯从允赖，帝当博爱，溥成物以资生，臣不敢言，窃容心而抱送，知恩有日，积善酬天。 三天词 急乃吁天，可食言而弃信，吉焉卜日，庸报贶以修斋，惠普及於显幽，鉴潜孚於微隐，曲成有在，善应无违，思以致祥，誓广行於阴德，赐之如愿，敢自泯於良心。 东极词 明科肇启，兼酬宿昔之言，逝爽同升，一拜维新之命，圣功不宰，人道重开。 瑞光之假借非私，生意之贯通无迹。 同胞同与，各随分以短长，自色自形，初何心於造化。 后土南极北极九幽 帝留斋法，救长夜之冥行，臣抚愚衷，答先时之宿款，道存万范，恩到九泉，惟济死以及生，乃度幽而为福。 伏愿善无不溥，咸升朱府之高，愿有必从，少待洪钧之转。 萃善录卷下竟",
      "translated_text": "**Evening Prayer for Ancestral Offerings**\nThis servant divines the night—immortals of noble rank transmit their texts, while mortals hold to the common saying: \"Benevolence resides in boundless love.\" Gazing upon the departed, whether kin or stranger, where have their spirits and souls gone? A single gesture toward emptiness, all return to purity. May the moon’s wisdom-light illumine them, their awakened nature attuned to heaven. Illusory bodies are no bodies—let them grasp the radiant root of spirit. Formless yet born of form, may they transcend the constancy of night and day.\n\n**Third-Day Morning Prayer for the Teaching**\nThe sun’s rays strike the golden gate; thrice we behold the crimson clouds of dawn. Dew arrays the jade throne; once we petition the mysterious workings of spring. Guarding the teachings entrusted to us, we tremble as duty demands vigilance with the seasons. Admonishing one another in reverence, we speak with trembling awe. May we abide in obscurity yet shine, cleave to light without losing it. May the true source be upheld, the learning of cap and gown unbroken. May fresh grace descend like imperial edicts, and the lineage of hemp and silk grow ever greater.\n\n**Midday Prayer for the Master’s Gate and Palace Gate**\nA thousand years of ancestral teachings sustain the blessed land where rites are offered. The *Book of Changes*’ human culture arrays the proper positions of the household. Linked in hidden sorrow, all equally seek peace. Thrice we present our morning prayers to the clouds, heeding the returning spring as we gather records. May the sky’s light shine bright, clouds and thunder unite in harmony. May the fragrant flames of devotion burn ever high, grace flowing from above. May the branches of the lineage flourish in order, with blessings at their heart.\n\n**Evening Prayer for Heirs**\nLong have we called to heaven, hoping the mysterious lineage might find a trust. Yet all day we stand in dread—why has our earnest wish not been fulfilled? Perhaps it stems from what past lives have summoned, or what this humble self has brought upon itself. Could it be lawsuits over tombs, or some hidden curse? As this audience draws to a close, we dare lay bare our plea. May the perfected ones grant amnesty, washing away ten thousand sins to dispel hardship. May the ninefold qi wondrously coalesce, ushering the return of the single yang.\n\n**Prayer to August Heaven**\nHeaven’s records bear witness to the ancient yellow threads of covenant; dew-like sincerity is secretly offered, along with this servant’s crimson heart of devotion. We answer delayed blessings, lay bare our feelings, and await fate’s decree. We recall our youth, lost and adrift, trembling as if cast into peril. Half a lifetime’s earnest intent remains unfulfilled, while a single thread of posterity’s sorrow weighs heavily. Though parents are gone, their wishes endure; we examine ourselves and know this in our hearts. Circumstances linger, yet silently we trace the cause. The divine hosts stand in solemn array—how could retribution be unrelated? If we were to consume these words again, what punishment could we refuse? A thousand transgressions we repent; three petitions we offer as one. May you graciously pardon all without omission, deign to grant what we rely upon. The Emperor’s boundless love sustains all things in their becoming; this servant dares not speak further, yet secretly harbors this offering in the heart. One day, we shall know gratitude and repay heaven’s accumulated goodness.\n\n**Prayer to the Three Heavens**\nUrgent is our cry to heaven—can words be cast aside and trust abandoned? Auspiciously we divined the day to repay blessings with fasting rites. May kindness extend to the manifest and hidden, may scrutiny reach the subtle and concealed. Where there is completion, there is response; where there is goodness, there is no refusal. We aspire to summon blessings, vowing to broaden our practice of hidden virtue. Grant us our wishes, and we dare not extinguish the good within our hearts.\n\n**Prayer to the Eastern Pole**\nThe sacred statutes were first established to fulfill past vows. Ascending together with the departed luminaries, we bow to the renewed mandate. The sagely work is impartial; the human Dao is reborn. The borrowed radiance of auspicious light is no private favor; the vitality of life flows without trace. Siblings share alike, each according to their measure, long or short. Each has its own form and appearance—what intent did creation ever hold?\n\n**Prayer to the Earth, Southern Pole, Northern Pole, and Nine Dark Realms**\nThe Emperor’s fasting rites rescue those who wander the long night. This servant, with a foolish heart, answers the vows of former times. The Dao encompasses all norms; grace reaches the nine springs. Only by aiding the dead can one extend life; only by delivering the hidden can one bring fortune. May goodness spread without limit, all ascending to the lofty vermilion palace. May wishes be inevitably fulfilled, awaiting but the turning of the great potter’s wheel.\n\n*End of the Second Scroll of the Record of Gathered Goodness*",
      "overlap_context": "? Heaven watches from above—how dare we seek blessings in obscurity? We especially honor the departed kin of this household, who initiated the tenfold Dao of salvation. The jade texts bear witness; the golden tablets hold no partiality. May their refined essences depart from brightness, advancing beyond the spirit journey. May ancestors bless their descendants, upholding the lineage of the mysterious province. Though women too may attain immortality, they remain bound to the registers of change.",
      "start_char": 16115,
      "end_char": 16954,
      "start_sentence": 477,
      "end_sentence": 507,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.40708351135254,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\表奏类\\萃善录.txt",
        "category": "表奏类"
      }
    }
  ]
}