{
  "source_id": "蓬莱山西灶还丹歌",
  "source_file": "chunked_daozang\\蓬莱山西灶还丹歌.json",
  "total_chunks": 42,
  "total_original_chars": 15717,
  "total_translated_chars": 82869,
  "total_translation_time": 503.76943135261536,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
    "category": "众术类"
  },
  "full_translation": "**The Song of Returning Elixir from the Western Furnace of Mount Penglai**\n\n**Title:** *The Song of Returning Elixir from the Western Furnace of Mount Penglai*\n**Original Author:** Attributed to Huang Xuanzhong of the Han, though official titles, place names, and literary style suggest a Tang-era forgery. Originally one scroll, later divided into two.\n**Source:** *Daoist Canon of the Zhengtong Era*, *Compendia of the Divine Empyrean Section*, *Miscellaneous Arts Category*.\n\n---\n\n### *The Song of Returning Elixir from the Western Furnace of Mount Penglai, Scroll One*\n**Composed by Huang Xuanzhong, Han Examiner of the Court of Judicature and Revision, Grand Master for Glorious Happiness with Gold and Purple Insignia**\n\nYour servant has heard that the wren in the trees does not seek more than a single branch for its nest, and the field mouse drinks from the river only to fill its belly. Yet Your Majesty’s fame surpasses that of Donghu, and your governance harmonizes the southern winds, bringing peace to the myriad people—none fail to find repose. Why then do you prize the glory of the imperial chariot yet slight the Dao of immortality?\n\nYour servant humbly submits: In the Yuanfeng era, by imperial decree, I journeyed to Mount Penglai to seek the wondrous arts. I endured the perils of the sea, traversed the hidden yang, and risked death in pursuit of the supreme Dao. By the distant grace of Your Majesty’s favor, moved by this humble servant’s devotion, I encountered a great immortal who bestowed upon me the sacred elixir. With utmost sincerity, I presented it to the throne. How could Your Majesty heed the words of flattering ministers, mistaking it for heresy and deceit, and command your servant to consume it himself? Soon after, I took leave of the imperial court, overcome with sorrow and longing. Before I could fully explore the palaces, a decade passed in fleeting moments, and I feared that leisurely deliberation would forever bar my return.\n\nLater, I learned that Your Majesty had ordered Dongfang Shuo to summon the Queen Mother of the West and erect a dew-receiving basin—clear proof of Your Majesty’s deep regret. Your servant has heard that to serve one’s lord with loyalty and stand by one’s friends with righteousness is the way of the minister. Disloyalty to the sovereign invites punishment from all officials; betrayal of friends brings abandonment by all companions. At the Western Furnace of the Shaowei Courtyard in the Ziyang Palace, I personally received the wondrous Dao of the returning elixir and secretly recorded its formula. I implore Your Majesty to heed the admonitions of loyal ministers and verify this method. Do not repeat the errors of past years by yielding to the words of vulgar flatterers.\n\nThe elixir shall be compounded by Left Reminder Chen Fangjing, with Right Aide Zhou Zhenyuan overseeing the firing. My son, Zhicheng, will tend the furnace and perform the offerings, ensuring the refinement is precise and subtle. With earnest devotion, may the purple jade briefly appear, and may Your Majesty’s bones become golden for eternity.\n\nWhy cling to the grandeur of the Hanlin Palace, which is but the essence of the mortal realm? The Northern Gate and Western Hall are far from vast; the Nine Divisions of the Imperial Sacrifices cannot compare to true harmony; the powdered and rouged chambers are but ugly vessels. How much more sublime is the unparalleled wonder of Mount Penglai, famed as the immortal mountain! Here stand the palaces of the sun and moon, cloud chambers and golden pavilions. Halls are adorned with gold and jade, towers gleam with coral, magpies encircle sacred mushrooms, and simurghs soar among jade trees. Heavenly boys and jade maidens stir the cauldrons with song, while rare birds and famed fowl arrive without cease. Beyond the crystal curtains, the mysterious wind rustles; within the jasper doors, fine rain drizzles. A single sip of jade nectar grants a thousand years; a moment’s taste of the great elixir ensures ten thousand ages. Soon you will witness the mulberry fields turn to sea, and the sea revert to mulberry fields. Some ascend to attend the Heavenly Elder, others pass through the Cloud Gate, descending to Yingzhou to seek rare treasures. The yellow-roofed halls of the mortal world are not worthy of reverence; even the embroidered robes of high ministers cannot compare in nobility.\n\nWhy does Your Majesty not personally visit these wondrous realms, instead suffering the bonds of the mundane? Soon you will see your crown entombed in the stone hall, your body buried in the earth, leaving your descendants to kneel in vain, pouring libations at your cold mausoleum. In the span of a morning and evening, this fate will be upon you. Even a hundred years as Son of Heaven cannot equal a single day as an immortal.\n\nI beseech Your Majesty’s sagacious judgment: do not seek your own demise.\n\nRespectfully dispatched, the Elixir-Bearing Youth of Nanyang, to present this memorial for Your Majesty’s consideration.\n\n**Huang Xuanzhong, Right Senior Minister of the Purple Tenuity of Mount Penglai’s Nanyang, prostrates and respectfully submits.**\n\nAll who uphold this sacred Dao must seek it without deviation, through purity, fasting, and tranquil contemplation. The furnace must be established and the stove arranged; one must not act contrary to the divine methods. Every movement and mechanism must align with the Dao of Heaven. The mineral and herbal ingredients must be of the finest quality, without error.\n\nAll herbs are tribute from the provinces, save three varieties native to this mountain. Six common mortal ingredients may be substituted, as listed below.\n\n**One Song of the Yellow Tooth Stone** (for crafting the Yellow Tooth elixir, five-character verse)\n**One Hundred Seventy-Two Herbal Songs** (describing the forms, names, harvesting seasons, and properties of 172 herbs, including their times of vitality and decay)\n**Total: 168 songs**\n\n---\n\n### **Crafting the Yellow Tooth, First Method**\n**Song:**\nLayer *ren* [water phase] in repeated folds,\nLead and yellow powder in successive weights.\nThe white and yellow of *you-niu* [rooster-metal] in three hues,\nBlend with the brine of the eastern tail.\nPlace *bing-ding* [fire phase] atop,\nTogether enter the red flames.\n\nFollow the song’s instructions, layering repeatedly until *ren* is exhausted. The process should align with the Summer Solstice. Grind with ice stone for best results. Use the eastern tail [direction], but avoid days of *jia-wu-geng* [wood, earth, metal] and fixed [inauspicious] dates.\n\n---\n\n### **Second Herb: Dewy Countenance Grass**\n**Common Name:** Earth Record\n**Textual Name:** Stone Record\nStem and flowers are red, nature toxic. Dislikes rough texture; grows on cliffs. Native to Henan. Vital in *jia-yi* [wood phase], perishes in *wu-ji* [earth phase]. Harvest on *jia-yin* day; leaves are round. Gather twenty days after the Spring Equinox. Primarily treats malignant sores. Aligns with the Spring Equinox.\n\n**Song:**\nThis herb is found among men,\nHenan yields the rarest kind.\nPluck and blend with mercury,\nOvernight it answers heaven’s truth.\n\n---\n\n### **Third Herb: Frosty Countenance Grass**\n**Common Name:** Heaven’s Edge\n**Textual Name:** White Microbe\nNature as above. Native to the southern roads of Ke. Vital in *jia-ren* [wood-water], perishes in *wu-gui* [earth-water]. Vines bear three flowers. Aligns with the Summer Solstice. Harvest after the Beginning of Spring.\n\n**Song:**\nFrom distant trees, climb the cliffs,\nThree flowers face the peaks.\nPluck and bury in *yi* [wood] earth,\nFollow the eastern tail’s method, then enter *gui-ren* [water phase].\n\n---\n\n### **Fourth Herb: Twin Husband Grass**\n**Common Name:** Hibiscus Vine\n**Textual Name:** Purple Jade\nNature as above. Treats consumptive illness. Native to Annan Prefecture.\n\n**Fourth Herb: Twin Husband Grass (continued)**\nNative to *bing-ding* [fire phase], perishes in *jia-ji* [wood-earth]. Leaves purple-green, varying in size. Aligns with the Lesser Heat solar term. Harvest after the Beginning of Summer.\n\n**Song:**\nVines climb toward heaven’s waters,\nBy the pond, flowers bloom near stone.\nWait for the *bing-ding* hour of night,\nThe Weaver Girl’s form must be firm.\n\n**Fifth Herb: Stone Heaven**\n**Common Name:** Fishing Line Grass\n**Textual Name:** Martial Grass\nMildly toxic. Native to the northern frontier. Manifests as metal, with a long, verdant hue. Native to *jia-ren* [wood-water], perishes in *ding-mao* [fire-rabbit]. Treats mercury poisoning and intestinal wind.\n\n**Song:**\nAcross the land, sharp leaves unfurl,\nSeek the mountains for their green glow.\nUse fermented mash at Summer Solstice,\nHarvest when the wild geese return.\n\n**Sixth Herb: Stone Mysterious**\n**Common Name:** Vine of Bitterness\n**Textual Name:** Recorded Branch\nWarm in nature. Hardens mercury. Green in color. Native to *wu-ji* [earth], perishes in *ding-ren* [fire-water]. Treats abdominal paralysis. Aligns with the Lesser Heat solar term. Harvest after the Beginning of Autumn.\n\n**Song:**\nBlack vines bear green leaves,\nBorn again in wild marshes.\nCalmly place upon *bing* [fire],\nOnly then will mighty strength arise.\n\n**Seventh Herb: Ten-Thousand-Year Spring**\n**Common Name:** Water Indigo\n**Textual Name:** Earth Mirror\nCool in nature. Native to the Jiangnan region. Resembles indigo—young leaves blue-green, aging to red. Native to *wu-ding* [earth-fire], perishes in *jia-ji* [wood-earth].\n\n**Eighth Herb: Thousand-Autumn Brocade**\n**Common Name:** Earth Curtain\n**Textual Name:** Green Loft\nTreats infantile malnutrition. Aligns with the Greater Cold solar term. Harvest ten days after the Spring Equinox.\n\n**Song:**\nGreen in hue, pointed and red—like indigo in form,\nDwelling on lofty peaks or deep in pools.\nFirst paired with the Returned Elixir as its abode,\nCool in nature yet sweet in taste.\n\n**Ninth Herb: Everlasting Spring**\n**Common Name:** Shade Ganoderma\n**Textual Name:** Green Heart\nWarm in nature. Native to Jiannan. Native to *jia-yi* [wood], perishes in *wu-ji* [earth]. Leaves large as a hand’s palm, wrinkled. Treats severe wind disorders. Aligns with the Greater Heat solar term. Harvest after the Beginning of Summer.\n\n**Song:**\nWrinkled leaves unfurl by distant mountain springs,\nLarge and pointed green, small and round.\nOnly in Jiannan does it grow finest—\nThe Perfected call it the Herb of the Cinnabar Field.\n\n**Tenth Herb: Cold Cicada Leaf**\n**Common Name:** Beauty Grass\n**Textual Name:** Warm Grass\nNative to Bazhou and Pengzhou. Resembles a cicada’s wing—shoots blue-green or red, varying. Native to *wu-ding* [earth-fire], withers in *jia-xu* [wood-earth]. Treats red and white vaginal discharge. Aligns with the Rain Water solar term. Harvest after the Beginning of Autumn.\n\n**Song:**\nLeaves like cicada wings, stems like cords,\nEver by the pool’s edge, mirrored in clear water.\nWhen the time is right, gather three or five—\nEight *zhu* of golden powder, three *sheng* of sap.\n\n**Eleventh Herb: Thousand Spirits**\n*(Text continues)*\n\n**Twelfth Herb: Red Horse State**\n**Common Name:** Earth Receptacle\n**Textual Name:** Purple Canopy\nNature: Toxic\nNative to Beiji. Stems and leaves purple. Grows in *jia-ren* [wood-water], withers in *ding-ji* [fire-earth]. Treats retching and hiccups. Aligns with the Spring Equinox solar term. Harvest after the Spring Equinox.\n\n**Song:**\nBranches red, leaves purple cling to cliffs,\nThis herb the Perfected secretly array.\nJust when the furnace’s dragon unfurls,\nThen you’ll know my jade-like numinous power.\n\n**Thirteenth Herb: Ten Thousand Sunlit Blossoms**\n**Common Name:** Hu Wave Water Chestnut\n**Textual Name:** Beauty Vegetable\nNature: Benign\nNative to Hebei. Leaves green, flowers purple. Grows in *jia-ji* [wood-earth], withers in *ding-ren* [fire-water]. Treats malignant sores. Aligns with the Summer Solstice solar term. Harvest after the White Dew.\n\n**Song:**\nCluster on cluster, leaves thrust forth from marshland’s birth,\nSummer blooms near spring’s verdant verge.\nAdd to the red kiln and simmer within—\nIn ten days’ decoction, this herb most potent proves.\n\n**Song:**\nPetals of the water chestnut, snipped as if by scissors’ blade,\nEach year the Perfected Ones themselves bestow this aid.\nShould you seek its purple chambers free of purple hue,\nPluck and boil it with the womb-stone’s embryo true.\n\n**Fourteenth Herb: Cold Spring Mirror**\n**Common Name:** Large-Leaf Duckweed\n**Textual Name:** Pool’s Countenance\nNature: Cool\nNative to Yunnan. Leaves round, floating upon the water. Grows in *bing-ding* [fire-fire], withers in *jia-yi* [wood-wood]. Treats malignant sores. Aligns with the Grain Full solar term. Harvest after the Summer Begins.\n\n**Song:**\nFloating life on ponds—leaves verdant, bright,\nIn sapphire-toothed elixirs, most numinous in might.\nHenceforth with mercury beneath the sun’s gaze,\nEven gold shall strive in vain for fame’s praise.\n\n**Fifteenth Herb: Cavern Stalks**\n**Common Name:** Zhou Zhi\n**Textual Name:** Lu’s Countenance\nNature: Hot\nNative to Luozhou. Leaves green, branches white and sour. Grows in *jia-ding* [wood-fire], withers in *wu-ji* [earth-earth]. Treats poisonous winds. Aligns with the Grain Full solar term. Harvest after the Summer Begins.\n\n**Song:**\nLeaves green, stems tart, sprouting from the mound,\nThorned blooms like upturned bowls abound.\nIf the Returned Cinnabar bypasses the pool’s embrace,\nHow shall immortals vie for a ten-thousand-year grace?\n\n**Sixteenth Herb: Duke Without Seizure**\n**Common Name:** Stone Vine\n**Textual Name:** Moistening Spring\nNative to the Southern Mountains of Chang’an. Leaves like beans, vines trailing purple. Grows in *ding-ji* [fire-earth], wilts in *wu-ren* [earth-water]. Treats malignant sores. Aligns with the Great Cold solar term. Harvest after the White Dew.\n\n**Song:**\nCluster on cluster, purple shadows rise from Chang’an’s plain,\nBorn at spring’s first breath, its hue defies the cold’s domain.\nWhen plucking at the crumbling cliffs, beware the torrents’ reign,\nAnd guard against the myriad spirits’ watchful gaze and feign.\n\n**Seventeenth Herb: Heaven’s Mirror Cold**\n**Common Name:** Stone Fan\n**Textual Name:** Green-Backed\nNative to the Henan Circuit. Each stem bears but a single leaf.\n\n**Seventeenth Herb: Heaven’s Mirror Cold**\n**Common Name:** Stone Fan\n**Textual Name:** Green-Backed\nNative to the Henan Circuit. Each stem bears but a single leaf. Grows in *wu-ren* [earth-water], wilts in *jia-ji* [wood-earth]. Treats cold. Aligns with the Beginning of Summer solar term. Harvest after the original text’s omission.\n\n**Song:**\nLeaves like woven fans cling to cliffs’ sheer face,\nEach tree bears but one stem in its embrace.\nFrom graves and dead springs, all effect is vain,\nSever man from dog—then its power shall reign.\n\n**Eighteenth Herb: Free-Flowing Trails**\n**Common Name:** Purple Cowrie Vine\n**Textual Name:** Cliff Mugwort\nCold in nature. Native to Sanyuan County. Leaves pointed. Aligns with the White Dew solar term. Harvest after the Winter Solstice.\n\n**Song:**\nBranches trail, vines unfurl like golden orchids bright,\nOnly true immortals’ hands may pluck its sacred light.\nTo ascend the Purple Tenuity’s celestial gate,\nHow wondrous its radiance upon the Daoist altar’s state.\n\n**Nineteenth Herb: Corpse-Release Red**\n**Common Name:** Stone Quilt\n**Textual Name:** Earth Veins\nWarm in nature. Native to Yangzhou. Resembles duckweed, stems slender. Grows in *yi-gui* [wood-water], wilts in *you-xu* [metal-dog]. Treats all visceral counterflow and malignities. Aligns with the Lesser Cold solar term. Harvest after the Beginning of Summer.\n\n**Song:**\nGreen cliffs near stone, its form like shears refined,\nPurple Tower and Penglai share its name enshrined.\nAlone with cinnabar and mercury it’s wrought,\nBeneath the flame, copper’s ring is forever naught.\n\n**Twentieth Herb: Immortal’s Node Ganoderma**\n**Common Name:** Stone Contest\n**Textual Name:** Nine Accumulations\nCool in nature. Native to Henan. Shape pointed and fine, nodes clustered. Grows in *wu-ding* [earth-fire], wilts in *yi-gui* [wood-water]. Treats heat oppression and leg qi. Aligns with the Autumn Equinox. Harvest after the Beginning of Winter.\n\n**Song:**\n\n**Song:**\nIn heaven’s realm it wholly lacks, yet earthly bounds possess its grace,\nUnrecognized by mortal kind, it withers in its native place.\nThis day unfolds its golden lore,\nThat monarchs hence may know its name evermore.\n\n**Twenty-First Herb: Gilded Terrace Ganoderma**\n**Common Name:** Horse Purslane\n**Textual Name:** Green Essence\nCold in nature. Native to Heyang Prefecture. Leaves sharp and round, slightly fermented. Grows in *jia-ding* [wood-fire], wilts in *ren-ji* [water-earth]. Treats sores and malign boils. Aligns with the Cold Dew solar term. Harvest after the Beginning of Winter.\n\n**Song:**\nWhen the Net-Spinner’s Bride had yet to ascend,\nShe plucked this Gilded Terrace by the hundred.\nThrough three cycles of sixty years she passed,\nThen soared aloft on clouds of jubilation.\n\n**Twenty-Second Herb: Light Gold Essence**\n**Common Name:** Stone Branch\n**Textual Name:** Supreme Distance\nNative to Leyang. Treats deafness.\n\n**Song:**\nCold leaves cluster thick along the winding way,\nA treasure in the heavens, rare on mortal clay.\nPlucked and boiled in a pot with White Nightshade,\nThen shall its wondrous power be displayed.\n\n**Twenty-Third Herb: Celestial Ganoderma**\n**Common Name:** Capital’s Elixir\n**Textual Name:** Heaven’s Void\nNative to Luozhou. Treats windstroke.\n\n**Song:**\nCrimson pearls its seeds, the tree so green,\nPurple Terrace’s Immortal gives it name anew.\nYet with Cinnabar Yang it turns to white,\nOnly then does Green Essence dare the Dark Abyss pursue.\n\n**Twenty-Fourth Herb: Jade Pool**\n**Common Name:** Jade Pool Willow\n**Textual Name:** Radiant Ganoderma\nNative to Jiangzhou. Stem pale green, leaves slender and fine. Treats toothache, wind-sores, and gan.\n\n**Song:**\nIn mountain courts no Jade Willow grew,\nYet mortals err in calling it so.\nWhen gathering, take but little—heed this rule,\nLest the immortal’s pouch or pharmacy overflow.\n\n**Twenty-Fifth Herb: Ten-Thousand Perfections Lotus**\n**Common Name:** Mountain Sweet Chrysanthemum\n**Textual Name:** Water’s Husband\nResembles sweet chrysanthemum. Treats ghostly qi.\n\n**Song:**\n\n**Song:**\nVermilion peaks, their beauty shuns the lofty slope,\nYet where Yang’s favor lingers, here it thrives in droves.\nGathered, it must be used at once—heed well this law,\nLest Heaven’s messenger ferry it across the rivers’ flow.\n\n**Twenty-Seventh Herb: Celestial Mystery**\n**Common Name:** Stone Sweet\n**Textual Name:** Earth’s Sweet\nNative to Zhongwanzhou. Leaves green, growing upon stone. Treats regurgitation.\n\n**Song:**\nWithin the stone lies fire, fire conceals the Yin,\nYang’s qi latent rises—efficacy like gold.\nWhen gathering by day, beware the barking hound,\nFor if the dog should bark, its use will not take hold.\n\n**Twenty-Eighth Herb: Stone Heavenly Zither**\n**Common Name:** Stone Permitted\n**Textual Name:** Returning Ganoderma\nLeaves of three colors. Treats all wind disorders.\n\n**Song:**\nIn Jingzhou’s imperial prefecture, all men ail,\nTheir sickness borne of earth’s surging qi.\nAdd and release the Returning Elixir, simmered overnight,\nFrom hence a century free of wind’s decree.\n\n**Twenty-Ninth Herb: Furry Camphor**\n**Common Name:** Great Perfection\n**Textual Name:** Forest Ganoderma\nCold in nature. Native to Henan Circuit. Resembles purple chrysanthemum. Treats wind-jaundice.\n\n**Song:**\nThis uncarved block, when carved, blooms with flowered nodes,\nWithin its downy fur, seeds branch and spread.\nPity this thing—though found among men,\nWho among men knows its name, filled with dread?\n\nThe preceding eight herbs: born in *jia-ren*, die in *yi-gui*, aligned with the Winter Solstice. Gather after the Beginning of Spring.\n\n**Thirtieth Herb: Ten-Thousand-Year Perfection**\n**Common Name:** Five-Spirit Ganoderma\n**Textual Name:** None recorded.\n\n**Thirty-First Herb: Purple Leaf**\n**Common Name:** None recorded.\n**Textual Name:** None recorded.\nCold in nature. Treats demonic qi and heartway aberrations.\n\n**Song:**\nSwaying brocade vines rise from Chang’an,\nFacing snow, they bloom beyond the upper balustrade.\nNo need for spring’s glory—hidden, they bear fruit in secret,\nThe Heavenly Maidens of Great Luo feast upon them always.\n\n**Thirty-Second Herb: Gold-Grain Cold**\n**Common Name:** Wrinkled Face\n**Textual Name:** Martial Ganoderma\nWarm in nature. Native to Hengzhou. Leaves large as a hand’s span, wrinkled. Treats wind-lichen.\n\n**Song:**\nLeaf upon leaf spreads across the sand, growing everywhere,\nImmortal beings plant them around their immortal courts.\nKnow only the days of *wu-ji*, *geng-xin*—\nGather then, how could one fail to attain numinous communion?\n\n**Thirty-Third Herb: Barbarian Chrysanthemum**\n**Common Name:** Willow Pond\n**Textual Name:** Heart-Barrier Grass\nWarm in nature. Leaves like willow, trailing vines. Treats women’s blood and qi.\n\n**Song:**\nGreen gold scatters emerald, trailing golden tendrils,\nVerdant leaves drift lonely, circling the azure heavens.\nGather with the vines in the third month of spring—\nPity the mercury burning within the fire.\n\nThe preceding three herbs: born in *wu-ji-ding*, die in *jia-yi*. Aligned with the Great Cold, gather after the Beginning of Winter.\n\n**Thirty-Fourth Herb: Heaven-Pointed Gold**\n\n**Thirty-Fifth Herb: Barbarian Yam Vine**\n**Common Name:** Hu Shu Vine\n**Textual Name:** Beauty’s Grace\nHot in nature, toxic. Treats insect and snake poisons. Found in Meiyuan County, resembling *shu yu* (yam).\n\n**Song:**\nThick leaves of blue-green gold, thriving by the stream—\nPity the immortal herb that mortals fail to see.\nIf you would ascend to heaven on high,\nTake only this as your cloud-ladder.\n\n**Thirty-Sixth Herb: Jade Unfolds Spring**\n**Common Name:** Mountain Dendrobium\n**Textual Name:** River Spring\nWarm in nature. Native to Khotan. Three leaves, resembling elm.\n\n**Song:**\nEach tree bears three leaves, their distant glow like elm,\nAs winter divides and spring’s season draws near.\nThe immortal plucks it, pacing the void.\n\n**Thirty-Seventh Herb: Thorny Bean Vine**\n**Common Name:** True Zhi\n**Textual Name:** [None]\nWarm in nature. Found in Jiannan. Three leaves, resembling beans. Treats blood-wind.\n\n**Song:**\nEach leaf bears immortal intent, embracing emptiness to gain the great tone.\nThirty days within the golden casket—\nNo need to cast it into the depths.\n\n**Thirty-Eighth Herb: Night-Closed Tree**\n**Common Name:** Returning Heart\n**Textual Name:** Pine South\nNative to Shangzhou. Grows as a tree with small leaves that close at night. Treats heart-madness.\n\n**Song:**\nLovely tree with tender leaves, branches open at dawn, close at dusk.\nPity the tree of heaven—\nFit to bear mortals in flight.\n\n**Thirty-Ninth Herb: Purple Square Heaven**\n**Common Name:** Willow-Leaf Mustard\n**Textual Name:** [None]\nHot in nature. Found in Qingzhou. Leaves like willow, several inches long, exuding sap. Treats all wind-evil.\n\n**Song:**\nSmall leaves bloom beside the mountain, planted by the immortal’s own hand.\nFrom this, discern the true herb—\nBefore your eyes, journey to Mount Tiantai.\n\n**Fortieth Herb: King [Illegible]**\n**Common Name:** Green Wind\n**Textual Name:** [None]\nToxic. A cluster of several leaves. Found in Yangmeimao. Treats meridians and hemorrhoids.\n\n**Song:**\nEarth parts to reveal jade leaves, branches rising alone to claim the azure sky.\nThough many stone medicines may subdue,\nNone match the yin spirit in its power.\n\n**Forty-First Herb: Red Lotus**\n**Common Name:** Stone Sword\n**Textual Name:** [None]\nHot in nature. Found in Ganzhou. A cluster of several blades. Treats all wind.\n\n**Song:**\nBrocade stone moss grows where clouds and rain gather,\nThe red lotus unfurls like a sword’s edge.\nNo decoction boils jade so well as this—\nThus did the immortal bestow its name.\n\n**Forty-Second Herb: Barbarian Xin Vine**\n**Common Name:** Three-Leaf Grass\n**Textual Name:** Profound Truth\nToxic. Found in Jiangzhou. Leaves with three points. Treats insect poison.\n\n**Song:**\nBranches and twigs, leaves sharp as blades,\nNear summer, as autumn nears, the vine begins to climb.\nOnly after the third turning of the third month\nIs the formula complete—then fire it in the flame.\n\n**Forty-Third Herb: Purple Immortal Zhi**\n**Common Name:** Heavenly Pool\n**Textual Name:** [None]\nHot in nature. Leaves resembling loquat.\n\n**Forty-First Herb: Purple Immortal Zhi**\n**Treats:** Heart pain.\n\n**Song:**\nThe swaying immortal fruit grows by mountain streams,\nFit to serve as a ladder to Penglai’s square acre.\nOften among men, yet men know it not—\nThus did Peach Source’s path become lost to them.\n\n**Forty-Second Herb: Stone Bean Vine**\n**Common Name:** Stay-with-Me\n**Textual Name:** Single Chapter\nCold and toxic in nature. Leaves pointed, with trailing vines and stems of purple-green.\n**Treats:** Insect poison.\n\n**Song:**\nBlack jade for stems, gold for its fragrance,\nIt stretches its vines across rocky slopes.\nThe maiden of southern Qin once used it—\nTo refine mercury smokeless in the crucible’s flame.\n\n**Forty-Third Herb: Mountain Stone Vine**\n**Common Name:** True Fish\n**Textual Name:** [None]\nWarm in nature. Found in Wenzhou. Leaves with three points, resembling large beans.\n**Treats:** Inverted sores.\n\n**Song:**\nJade spread on golden vessels, inscribed among men,\nIts sprouts in Peng Palace, its fruit in the fields.\nIt must be that the five centers are like snow—\nHow could all other things compare to its dusky mist?\n\n**Forty-Fourth Herb: Jade Millet Grass**\n**Common Name:** Traveling Needle\n**Textual Name:** [None]\nFound in Henan. Cold in nature. Resembles *huan* vine, with seeds like broomcorn millet.\n**Treats:** Wind-heat.\n\n**Song:**\nGold and jade arrayed in pearl-like grains,\nHeaven and earth each bear their distinct forms.\nWhen it grows in heaven, it is purple-green;\nWhen found among men, it is sparse and green.\n\n**Forty-Fifth Herb: Layered Gold**\n**Common Name:** Small Yam Medicine\n**Textual Name:** [None]\nWarm in nature. Found in Chen Jinzhou. Leaves resemble yam, with roots.\n**Treats:** Water diseases.\n\n**Song:**\nBury its root in a golden casket, unfurl its lotus head,\nThe True Man of Creation left it behind long ago.\nRemember well the five turnings when they unfold—\nBoil it to water, and the five metals will soften.\n*(Also called* Earth Su.)\n\n**Forty-Sixth Herb: Stone Fern**\n**Common Name:** Lost Darkness\n**Textual Name:** Lingering Gold\nHot in nature. Found in Chu lands. Branches with numerous leaves.\n**Treats:** Wind-cold.\n\n**Song:**\n\n**Forty-Seventh Herb: Jingyu**\n**Common Name:** Jinmu Flower\n**Textual Name:** [None]\nWarm in nature. Found in Shannan Circuit. Vines with four ridges, pointed leaves.\n**Treats:** Blood and qi disorders.\n\n**Song:**\nClustered with pointed leaves and four-ridged stems,\nIts light claims the vernal equinox, thriving wild across the fields.\nLater generations studying the Dao all use this—\nKnow then that from this comes longevity.\n\n**Forty-Eighth Herb: Layered Vine**\n**Common Name:** Human Affection\n**Textual Name:** Quji\nHot in nature. Found in Jiangnan Circuit. Small leaves grow first, then large leaves extend along the vine.\n**Treats:** All sores.\n\n**Song:**\nThe swelling True Qi ascends to heaven,\nJust at the vernal equinox, it descends to the wild fields.\nIf met with green salt and blended together,\nKnow then that the living carriage emerges among men.\n\n**Forty-Ninth Herb: Returning-Bone Herb**\n**Common Name:** Rat’s Milkvetch\n**Textual Name:** Single Mugwort\nHot in nature. Grows in Jianzhou. Stems like mugwort, with purple leaves.\n**Breaks and treats:** Wind sores.\n\n**Song:**\n[...] buried where a thousand returns,\nThe wheel of life and death ascends the azure mountains.\nIf only you recognize this boiled in the pot,\nAfter the fire, the golden body emerges into the world.\n\n**Fiftieth Herb: Slightly Purple**\n**Common Name:** Purple Cowrie\n**Textual Name:** [None]\n**Treats:** Paralysis and numbness.\n\n**Song:**\nWithin the copper vase, cinnabar frost is spread,\nFrost like mist-shrouded smoke, yet without light.\nSuddenly, it melts further at the moment of solidity—\nPity the hue surpasses even jade.\n\n**Fifty-First Herb: Cold-Stone Sunflower**\n**Common Name:** Attached Mugwort\n**Textual Name:** Inquiry Mushroom\nLeaves round like mugwort. Hard in nature. Treats wind.\n\n**Song:**\nMountains embrace their hues around the mountain court,\nCountless immortals cultivate it in the capital.\nOnly when blended with cinnabar and yang powder—\nOnce boiled, the bronze’s ring is forever stilled.\n\n**Fifty-Second Herb: Silk-Veined Vine**\n**Common Name:** Snake Onion\n**Textual Name:** Fitting One\nHot in nature. Grows in Qizhou. Veined like silk. Treats regurgitation.\n\n**Song:**\nVines spread, stems rise along green streams,\nPity its strength rivals the mountains.\nIf you can add fish-water through the night,\nEven bones buried for years may yet return.\n\n**Fifty-Third Herb: Chicken-Gut Vine**\n**Common Name:** Forest Watcher\n**Textual Name:** [None]\nWarm in nature. Grows in Baizhou. Leaves like chicken intestines. Treats all difficult births.\n\n**Song:**\nVines extend, stems sprout across ten thousand li,\nBranches gain color, claiming spring’s glory.\nFrom this, cinnabar knows no blackness—\nWithin mercury, the Purple River’s name must appear.\n\n**Fifty-Fourth Herb: Black-Gold Foot**\n**Common Name:** Supreme Mushroom\n**Textual Name:** Inauspicious\nHot in nature. Grows in Jiangling Prefecture. Stalks like black hairpins, leaves like ferns. Treats waist and leg ailments.\n\n**Song:**\nGolden crow feet scatter the cold mountains,\nImmortal seekers strain their eyes in longing.\nOnce you grasp the Primordial’s wisdom,\nTake care never to pass it to another.\n\n**Fifty-Fifth Herb: Snake-Holding Chrysanthemum**\n**Common Name:** Single Mushroom\n**Textual Name:** [None]\nWarm in nature. Grows in Taiyuan. Leaves like a snake’s bite, flowers like chrysanthemums. Treats throat obstruction.\n\n**Song:**\nThe former herb bears flowers like green willows,\nGolden vines spread along the brookside.\nWhen harvesting, beware the filial son—\nThe dog’s bark warns of ghosts harming the furnace-tender.\n\n**Fifty-Sixth Herb: Returning Cedar**\n**Common Name:** Wise Mushroom\n**Textual Name:** [None]\nWarm in nature. Grows in Annan.\n\n**Song:**\nVines spread, stems rise along jade-green streams,\nHarvesters lose their way through the four seasons’ changes.\nYou must remember well, lest you err—\nThis is the ladder to Penglai, ten thousand leagues away.\n\n**Fifty-Sixth Herb: Returning Cedar (continued)**\nShape like a cedar, purple in color. Treats perverse qi.\n\n**Song:**\nVast and golden, it unfurls against the azure sky,\nThe purple Daoist inquires of mysteries profound.\nIf you would craft the returning elixir from this,\nYou must boil it through ten nights to see.\n\n**Fifty-Seventh Herb: Golden Peach Vine**\n**Common Name:** Lingering Fear\n**Textual Name:** Single Man\nWarm in nature. Grows in Hezhong Prefecture. Shape like a grapevine, trailing its tendrils.\n\n**Song:**\nCarved from green silk, it spreads its verdant hues,\nThe perfected one conceals it from the vulgar.\nBoil it only in the waters of the Mystic River—\nMercury bewildered, gold seals twine in purple robes.\n\n**Fifty-Eighth Herb: Earth [Missing Character]**\n**Common Name:** Swallow Flower\n**Textual Name:** [None]\nHot in nature. Grows in Huzhou. Leaf veins like a silkworm cocoon, the size of a thumb’s face. Treats epilepsy.\n\n**Song:**\nLeaf upon leaf, three by three, crimson against the boughs,\nMost potent in the Way of the returning elixir.\nBoil it in mercury for two watches of the night—\nThen freely wield it to line the furnace’s fire-wall.\n\n**Fifty-Ninth Herb: Slightly Red**\n**Common Name:** Cliff-Piercing Cloth\n**Textual Name:** Purple Heaven-Heaven, also called Martial Countenance Vermilion Mushroom\nCool in nature. Grows in the kingdom of Yutian.\n\n**Sixtieth Herb: One Stem, One Leaf**\n**Textual Name:** [None]\nLeaf’s underside purple, stem likewise.\n**Song:**\nBeyond the bounds, it winds through forests and springs—\nMust be simmered in the crucible.\nThrice boiled with eight stones,\nHow could the body not grow firm?\n\nThe preceding twenty-seven herbs:\nBorn in *ding-si*, die in *wu-ren*—\nHarvest after the Winter Solstice.\n\n**Sixty-First Herb: Dog’s-Tongue Vine**\n**Common Name:** Fishweed\n**Textual Name:** [None]\nCold in nature. Grows in Chenxu Prefecture.\nVines trail like a dog’s tongue. Treats snake venom.\n**Song:**\nDog’s tongue, true to its name—\nVulgar folk and perfected ones call it by two.\nWere this herb not of this world,\nCrossing the river, filial piety would lack its power.\n\n**Sixty-Second Herb: Jade Rampart**\n**Common Name:** Foreigner’s Head\n**Textual Name:** [None]\nCool in nature. Grows in Qiyong.\nFlowers like bannered canopies, their tips purple.\nTreats cholera.\n**Song:**\nFlowers like tattered banners, leaves like crimson silk—\nNorth of the mountains, south of the river, each in dual form.\nWhen gathering it, guard it well—\nLet not outsiders know of the inner garden.\n\n**Sixty-Third Herb: Jade Caltrop**\n**Common Name:** Intercalary Mushroom\n**Textual Name:** *Dui*\nCold in nature. Grows in Jinan.\nStems slender, leaves small, yellow in hue.\nTreats heat-induced dysentery.\n**Song:**\n\n**Sixty-Third Herb: Crimson Tooth**\n**Common Name:** [None]\n**Textual Name:** *Single Tooth*\nWarm in nature. Grows in Hexi Circuit.\nLeaves like those of the mandarin orange, crimson in color, growing on rocks.\nTreats floating convulsions.\n**Song:**\nMoon first rising o’er the cliff’s edge—\nCarved for lords and Daoist robes alike.\nShould the phoenix appear, it dances of itself—\nNo need for Jin courtiers to play their reed pipes.\n\n**Sixty-Fourth Herb: Millet Gold**\n**Common Name:** [None]\n**Textual Name:** *Single Boat*\nCool in nature. Grows in Mian and Suizhou.\nStems slender, leaves pointed and round.\nTreats all blood and qi disorders.\n**Song:**\nA noble immortal herb among men—\nYet mortals treat it as commonplace.\nWere it simmered with golden sand by night,\nOne would know it outlives the tortoise’s years.\n\n**Sixty-Fifth Herb: Purple Stone Amaranth**\n**Common Name:** Cloud Garment\n**Textual Name:** *Purple Canopy*\nHot in nature. Grows in Tongzhou.\nResembles amaranth with three veins.\n\n**Treats bone paralysis.**\n**Song:**\nThrough the threefold haze of *Tongzhi*—dim, dim—\nAmong elixirs, none surpass its power.\nNot only does it lend a golden luster,\nBut in one night it transmutes yellow bronze.\n\n**Sixty-Sixth Herb: Floating Perilla**\n**Common Name:** Intertwined Silk\n**Textual Name:** *Great Net*\nWarm in nature. Grows in Yunzhou.\nResembles peas; its flowers and leaves treat blood dizziness.\n**Song:**\nCrimson shadows twine the traveler’s path—\nThough found among men, it is not of this world.\nWere the Heavenly Maiden Weizhen to see it,\nShe would surely pluck her skirts full.\n\n**Sixty-Seventh Herb: Earth Smilax**\n**Common Name:** River Grass\n**Textual Name:** *Maiden’s Vine*\nWarm in nature. Trailing vine with seeds.\nTreats intestinal obstructions.\n**Song:**\nGreen willows grace every secluded courtyard,\nYet few pluck from the dark river’s flow.\nPlant it abundantly in your inner garden—\nGuard the recipe, lest outsiders know.\n\n**Sixty-Eighth Herb: Azurite**\n**Common Name:** Belt Azure\n**Textual Name:** *Barrier Channel*\nHot in nature. Grows in Shanzhou.\nTrailing vine with pointed leaves.\nTreats qi obstructions.\n**Song:**\nThe Azure Emperor offers golden pills—\nThis divine water must be blended and consumed.\nIf placed within a green crucible,\nAlas, the scattered snow melts before all eyes.\n\n**Sixty-Ninth Herb: Profound Darkness**\n**Common Name:** Stone Garment, also Fish Garment\n**Textual Name:** *Supreme Cycle*\nHot in nature. Grows in Jiangling Prefecture, resembling stone lichen.\nTreats cold qi.\n**Song:**\n\nDeep in profound darkness it grows upon stone,\nThough present among men, none know its name.\nPlace but a trace within the great elixir—\nAt once, auspicious clouds gather beneath your feet.\n\nThe preceding ten herbs are born in *jia*-*ding*, die in *wu*-*ji*, and correspond to the Beginning of Autumn. Gather them twenty days after the Beginning of Summer.\n\n**Seventieth Herb: Returning Year**\n**Common Name:** Wooden Mutual Pearl\n**Textual Name:** *Containing Purple*\nWarm in nature. Grows in Kunlun.\nLeaves like the elm, bearing pearls upon them.\nTreats wind.\n**Song:**\nHeaven endures, earth abides, waters vast and flowing,\nThe numinous herb holds its pearl, its hue naturally fragrant.\nHenceforth by the moonlit shores of the boundless sea,\nIt may be decocted and refined into nectar divine.\n\n**Seventy-First Herb: Calendar Epoch**\n**Common Name:** Southern Heaven\n**Textual Name:** None recorded\nWarm in nature. Grows in Fengxiang Prefecture.\nFour-ridged stem, purple flowers, leaves small and pointed.\nTreats all malign cold disorders.\n**Song:**\nWithin Hongzhang Temple spring grasses grow,\nUnlike those that fade when spring’s end brings the Calendar Epoch.\nIf blended within a white crucible,\nSoon the nine snows scatter their radiant light.\n\n**Seventy-Second Herb: Purple Gold Thatch**\n**Common Name:** Even Mugwort\n**Textual Name:** None recorded\nCold in nature. Grows in Jiannan.\nPurple-green stems, leaves long and pointed.\nTreats heart pain.\n**Song:**\nAlone she walks, the verdant bride,\nNever meet one born of Golden Flower’s distant courtyard.\nPluck and boil it upon golden ground—\nFrom this moment, its name is known without smoke’s trace.\n\n**Seventy-Third Herb: Purple Sea Toon**\n**Common Name:** Intertwined Epoch\n**Textual Name:** None recorded\nHot in nature. Grows in Jiangzhou.\nLeaves like the *zhuang*, purple in hue, forming a tree.\nTreats windstroke.\n**Song:**\n\nTogether they gleam like golden caskets shadowing spring mountains,\nCountless immortals hold and gaze upon them in hand.\nOne kind melts of itself to reveal its pattern,\nYet none compare to this one for refining the Golden Elixir.\n\n**Seventy-Fourth Herb: Golden Micro**\n**Common Name:** Double Gold\n**Textual Name:** None recorded\nWarm in nature. Grows in Jiannan.\nTwines around rocks, leaves like *lei* onions, bearing seeds and roots.\nTreats infantile malnutrition.\n**Song:**\nThe Yang-separated bride loves the lingzhi fish,\nAlone she sends ten thousand sheets of letters to the immortal elder.\nOnce she recognizes Golden Micro boiled with cold stone,\nHer river chariot ascends, body borne into azure emptiness.\n\n**Seventy-Fifth Herb: Purple Dream Minister**\n**Common Name:** Village Epoch\n**Textual Name:** Stone Knotweed (also recorded)\nGrows in Hebei Circuit.\nPurple in color.\nTreats heart pain.\n**Song:**\nFlower Epoch faces the Qin River for ten thousand leagues,\nThough born across ten thousand leagues, it refuses to speak.\nIf boiled together with the Three Rivers’ waters,\nIts living form should tread the nine heavens’ sky.\n\n**Seventy-Sixth Herb: Stone Mustard**\n**Common Name:** Earth Flower\n**Textual Name:** Southern Herb\nWarm in nature. Grows in the capital.\nLeaves like southern mustard greens.\nTreats infantile fright.\n**Song:**\nThe Purple Tenuity Heavenly Maiden does not cut cloth,\nYet she must ask mortals for Stone Mustard’s branches.\nAvoid boiling it in a white-patterned crucible—\nInstead, let cinnabar’s poison and mercury take flight.\n\n**Seventy-Seventh Herb: Mountain Ridge**\n**Common Name:** Ravine-Below Lingzhi\n**Textual Name:** Never-Above Lingzhi\nCold in nature. Grows in Yizhou.\nLeaves like *boleng* watergrass, forming clusters.\nTreats wind disorders.\n**Song:**\n*Ding-ding*—the sound of woodcutting follows the crow,\n*Miao-miao*—river waves, the grass naturally numinous.\nOnly Mountain Ridge is fit for careful gathering,\nWhere eight kinds of stone medicines naturally form.\n\n**Seventy-Eighth Herb: Point-Tail Palm**\n**Common Name:** Wind Grass\n**Textual Name:** None recorded\nCold in nature. Grows in Hengding Prefecture.\nOne leaf with three pointed tips.\nTreats all malign sores.\n\n**Seventy-Ninth Herb: Wang Qi**\n**Common Name:** Green Heaven\n**Textual Name:** No Celebration\nWarm in nature. Grows in Jiangnan Circuit.\nLeaves like *cheqian* (plantain), with striated stems.\nTreats poisonous sores.\nGrows readily north of the Wei Prefecture’s river—\nwhere it thrives, people often dry it in the cold sun.\nBoil it with five salts to form *yin’e*—\nhow then could one fail to live a long life?\n**Song:**\n*Dudu*—the Grand Treasury’s green elixir,\nrequires this numinous medium as its master.\nOnce this harmonized pulp is consumed,\nbefore your eyes, ten thousand springs unfold.\n\n**Eightieth Herb: Pointed Caltrop Vine**\n**Common Name:** Great Pair\nGrows in Jiannan.\nLeaves like caltrop, trailing in vines.\nTreats malign sores.\n**Song:**\nMortals fail to grasp the gold elixir’s intent—\nthe pointed caltrop must become jade-medicine’s clay.\nNot to mention how sulfur whitens,\nit can also subdue arsenic within the crucible.\n\n**Eighty-First Herb: Heaven’s Mandate Fulfilled**\n**Common Name:** Having Destiny\n**Textual Name:** None recorded\nCold in nature. Grows in Zhong-Wanzhou.\nTreats heat disorders; the rest goes unspoken.\n**Song:**\nThe jade maidens of Yuyang Palace boil celestial pulp,\nonly when *Heaven’s Mandate Fulfilled* begins to fragrance.\nIt must guide mercury to open the path,\nand serve as the courtyard wall for green elixir.\n\n**Eighty-Second Herb: Facing-Heaven Grass**\n**Common Name:** Ghost’s Urine Tube\n**Textual Name:** None recorded\nCold in nature. Grows in Tong-Hua Prefecture.\n\n**Eighty-Second Herb: Facing-Heaven Grass (continued)**\nHollow-stemmed with nodes, long in growth.\nTreats malign sores.\n**Song:**\nFrom afar, heaven’s shadow enters the void’s edge—\nwhen grown in Tong-Hua, it carpets the market ground.\nBehold the grass within the purple river chariot:\nwithout it, the golden elixir’s work cannot abide.\n\n**Eighty-Third Herb: Cicada’s Aid**\n**Common Name:** Nine-Clan Elixir, also called *Jingtian*\n**Textual Name:** None recorded\nCold in nature. Grows in Yuyang County.\nLeaves resemble plantain; vines trail with long roots.\nTreats heat disorders.\n**Song:**\nRound upon round, myriad leaves sprout from orchid branches—\nonly in Yuyang does it flourish in season.\nBuried west of the Three Palaces for October’s use,\nthen fit to enter the medicine, harmonizing the subtle.\n\n**Eighty-Fourth Herb: Golden Lock of Heaven**\n**Common Name:** Ashen Goosefoot\n**Textual Name:** Falling Goosefoot\nWarm in nature. Grows in Ba-Nan.\nLeaves small and square, reddish.\nTreats rising qi.\n**Song:**\nGolden Heaven’s surplus, rendered to ash,\nmust blend with yellow sprouts to form the clay.\nFrom this, mercury must be subdued—\nthis alone is the ladder to the returning elixir’s path.\n\n**Eighty-Fifth Herb: Returning Phoenix Vine**\n**Common Name:** Heaven’s Mother\n**Textual Name:** None recorded\nWarm in nature. Grows in Meiyuan County.\nVines trail with three leaves.\nTreats blood dizziness.\n**Song:**\nA thousand fathoms up the mountain stones, across the plains—\nsince ancient times, people have passed down its origin in Meiyuan.\n\n**Eighty-Sixth Herb: Uniting Yang Water Chestnut**\n**Common Name:** Purslane\n**Textual Name:** None recorded\nCold in nature.\nLeaves round, texture slippery.\nTreats intestinal heat.\nGrows in Danfang Prefecture.\n**Song:**\nSoft tendrils trail across Danfang,\nfit to join the returning elixir’s domain.\nMercury dare not take the lead—\nvainly chasing cinnabar, lost in the crucible.\n\n**Eighty-Seventh Herb: Uniting Yang Amaranth**\n**Common Name:** Human Amaranth\n**Textual Name:** Knotted Needle\nCold in nature.\nGrows in foreign lands.\nLeaves pointed.\nTreats gan disorders.\n**Song:**\nHarmonizing spirit and ordering the po, it emits silver light,\nthis stone-drug pouch forming one method.\nToday, the jade pestle advances by the chart—\nit too can subdue the Four Spirit Frosts.\n\n**Eighty-Eighth Herb: Uniting the Great Heaven**\n**Common Name:** Red Salt Flower, also called Celebration Reed\n**Textual Name:** None recorded\nWarm in nature.\nGrows in Yizhou.\nLeaves narrow and pointed, flowers like brambles.\nTreats blood and qi.\n**Song:**\nIn the Uniting the Great Palace, Uniting the Great Heaven,\nburned to ash and boiled in cold springs.\nYang ren cannot pass this ash—\nyin gui must ultimately fly away as smoke.\n\n**Eighty-Ninth Herb: Hibiscus Boat**\n**Common Name:** Rice Sack\n**Textual Name:** None recorded\nCool in nature.\nGrows in Qiannan.\n\n**Eighty-Ninth Herb: Hibiscus Boat (continued)**\nLeaves verdant, flowers bearing seeds.\nTreats malign heat and oppression.\n**Song:**\nInto the azure vastness, deep into the unseen,\nonly the flower-boat reaches the Dao’s corner.\nThough root and sprout are boiled with herbs as one,\nthis stone alone sinks while the rest naturally float.\n\nThe preceding twenty herbs:\nBorn in *wu-ren* years, die in *ding-ji* years.\nGathered at the *Beginning of Summer* or forty days before the *Beginning of Autumn*.\n\n**Ninetieth Herb: Unchanging Spring**\n**Common Name:** Kunlun Mallow\n**Textual Name:** Purple Pestle\nGrows in the Western Heaven.\nLeaves round with angles, flowers purple.\nTreats oil convulsions.\n**Song:**\nPlanted alone atop the loftiest crag,\nit blooms in courtyards among mortals.\nWhen the returning elixir’s reckoning is met,\nhow could sulfur fail to yield to its ash?\n\n**Ninety-First Herb: Fox-Grandson Vine**\n**Common Name:** Earth Coin\n**Textual Name:** None recorded\nHot in nature.\nGrows in the farthest south.\nVines trailing, leaves pointed, branches resonant.\nTreats malign sores.\n**Song:**\nFar-reaching vines coil round the Celestial Ford,\ngrowing till the south wind blows, never knowing spring.\nBrought in the third month to court the Emperor’s will,\nit would make the living body tread the azure scales.\n\n**Ninety-Second Herb: Stone Channel**\n**Common Name:** Lower Fish Herb\n**Textual Name:** None recorded\nCold in nature.\nGrows in Kaitong Prefecture.\nLeaves like bamboo, flowers yellow.\nTreats childhood *gan* disorders.\n**Song:**\nIn the jade-flower grotto, the river fish unfurls,\nthe fairest model among ten thousand herbs.\nWhen it cures purple cinnabar to a lustrous yellow,\nit also washes green cinnabar till its red fades.\n\nThe preceding three herbs:\nBorn in *wu-ding* years, die in *jia-yi* years.\nGathered at the *Beginning of Winter* or twenty days thereafter.\n\n**Ninety-Third Herb: Fish-Gut Vine**\n**Common Name:** Spirit Flower\n**Textual Name:** Bramble Pear\nWarm in nature.\nGrows in Xuanzhou and Hebei.\nLeaves like horse purslane, bearing brambles.\nTreats malign sores.\n**Song:**\n\n**Ninety-Third Herb: Fish-Gut Vine (continued)**\nOne asks, \"Is there a medicine like fish-gut?\"\nIt resolves and restores the elixir, fine for formulas.\nIn the three cauldrons’ smoke, auspicious hues unfold;\nin the Nine Heavens’ palace, numinous fragrance abides.\n\n**Ninety-Fourth Herb: Mountain Chrysanthemum**\n**Common Name:** True Floating Man\n**Textual Name:** None recorded\nCold in nature.\nGrows in Weinan County.\nLeaves like tea, flowers like chrysanthemum.\nTreats wine-induced heart palpitations.\n**Song:**\nFlowers like yellow chrysanthemum, leaves like tea,\nthe common folk know not its immortal lineage.\nIt can restore green cinnabar’s complexion,\nand turn rouge powder to golden ivory.\n\n**Ninety-Fifth Herb: Single Perfection**\n**Common Name:** Shepherd’s Purse\n**Textual Name:** None recorded\nGrows in Henan Prefecture.\nHot in nature.\nLeaves like lotus, grows near water.\nTreats snakebite.\n**Song:**\nHeavenly perfection, earthly truth—all from man,\nyet common mortals fail to recognize the real.\nFrom this, the Eight Spirits willingly accept death,\nwhile mortals henceforth escape as dust.\n\n**Ninety-Sixth Herb: Golden Mirror Cold**\n**Common Name:** Human Fungus\n**Textual Name:** None recorded\nGrows in Annan Prefecture.\nResembles mallow, bears hair.\nTreats insect and snake venom.\n**Song:**\nBorn in autumn on stone and stone alike,\nleaves with hair, stems with crimson specks.\nBeyond the Three Conjunctions, several forms appear—\nof all, the finest hails from the Eastern Capital.\n\n**Ninety-Seventh Herb: Green Branch**\n**Common Name:** Bitter Awakening Wood\n**Textual Name:** None recorded\nGrows in West Long Prefecture.\nCold in nature.\nMatures into a tree with branches.\nTreats beriberi.\n**Song:**\nA full-grown tree with branches spans ten thousand mountains,\nplanted by the Queen of the West among mortals.\nIt refines green vitriol without foul qi,\nand preserves the luster of purple gold.\n\n**Ninety-Eighth Herb: Purple Tower Spring**\n**Common Name:** White Horse Herb\n**Textual Name:** None recorded\nAlso called Lingering Jasmine.\nLeaves purple, green, and pointed.\nGrows in Jiangzhou.\n**Song:**\n\n**Purple Tower Spring (continued)**\n**Song:**\nIn grandeur blooms the Purple Tower Spring,\nalone it claims the mortal world’s white-backed scales.\nTo refine the returning elixir, one must add boiling,\nto ascend the azure heavens and attain the Ninefold Perfected.\n\n**Ninety-Ninth Herb: Heaven-Supporting Terrace**\n**Common Name:** Back-Vinegar Wood\n**Textual Name:** None recorded\nWarm in nature, matures into a tree bearing fruit.\nGrows in Mount Zhongnan.\nTreats regurgitation.\n**Song:**\nTowering tall, the tree grows on Southern Mountain,\namong ten thousand woods, this one is most worthy.\nWhen the celestial medicine is fired, a surplus must remain—\nit revives the living body, restoring white bones whole.\n\n**One Hundredth Herb: Sturdy Metal Bone**\n**Common Name:** Green Fish Marsh\n**Textual Name:** Celestial Pattern Taro\nWarm in nature.\nResembles cogongrass, bears fruit.\nTreats fetal leakage.\n**Song:**\nSparse leaves spread like cogongrass,\neach year the Perfected One waters it with jade dew.\nIt grants the returning elixir wings to grow,\nand those who consume it ascend to the azure heavens.\n\n**One Hundred First Herb: Wood Melon**\n**Common Name:** Heaven-Union Fruit\n**Song:**\nSwaying, the celestial tree grows in southern Ba,\nits sunlit blossoms lush, held each day.\nWhen the great medicine is compounded, it must be split abundantly—\nonly after autumn’s harvest is it fit for use.\n\n**One Hundred Second Herb: Scattered Dew Herb**\n**Common Name:** No-Green\n**Textual Name:** None recorded\nCold in nature, grows in Bazhou.\nA cluster of three or two leaves, laden with dew.\nTreats epidemic diseases.\n**Song:**\nA cluster of flowers with scattered leaves,\nknown for its goodness yet unnamed among men.\nBehold—when the medicine is wrought, its golden hue is fair,\nand those who gather it with incantations startle ghosts and gods.\n\nThe preceding ten herbs:\nborn in *wuzi*, die in *jiasi*,\ncorrespond to the advent of autumn,\nand are gathered after the Summer Solstice, before and after the Beginning of Winter.\n\n**End of *Songs of the Western Hearth of Penglai Mountain: Returning Elixir*, Scroll the First**\n**Beginning of *Songs of the Western Hearth of Penglai Mountain: Returning Elixir*, Scroll the Second**\n\n**Han Inspector Attendant and Grand Master for Splendid Happiness Huang Xuanzhong’s Compilation**\n\n**103: Yellow Emperor’s Spring**\n**Common Name:** Hibiscus Water\n**Textual Name:** None recorded\nCold in nature. Its flowers vary between purple and yellow, growing around water. Treats poisonous winds.\n\n**Song:**\nThough beams and pillars serve a house’s frame,\nthe Way of Returning Elixir needs hibiscus water.\nIf one speaks of the finest from the Queen Mother of the West,\ngathered from Southern Mountain, its use is all-encompassing.\n\n**104: Mountain Turbidity**\n**Common Name:** Water Turbidity\n**Textual Name:** None recorded\nEach stem bears three leaves, resembling *shuòyì*. Treats wind-blood disorders.\n\n**Song:**\nJade towers open mirrors to reflect three mountains,\nthis herb’s birth is no ordinary matter.\nIf not upon the lofty peaks of rocky summits,\nthen it must grow nurtured by cliffside springs.\n\n**105: Autumn’s End Record**\n**Common Name:** White Luxuriant Tree\n**Textual Name:** None recorded\nGrows into a tree with willow-like leaves. Found on roads beyond the mountain passes. Treats all malign sores.\n\n**Song:**\nThe sky stretches long, the moon hangs in azure vastness,\nthe moon stands before a thousand mountains and ten thousand herbs.\nWhen gathering and compounding medicine, take heed—\npluck and simmer it together with yellow sprouts.\n\n**106: Floating Forest Pool**\n**Common Name:** Earth’s Wrinkle\n**Textual Name:** None recorded\nLeaves resemble willow but are wrinkled. Hot in nature. Treats cold winds.\n\n**Song:**\nJade Pool’s waters, cold and clear, mirror heaven’s heart,\nthis herb’s worth could rival gold in price.\nWhen paired with sulphur, they grasp each other tight—\nbest of all for guiding lead and *ren*’s flight.\n\n**107: Crane’s Arrival Branch**\n**Common Name:** Female Chastetree\n**Textual Name:** None recorded\nEffective for treating cholera.\n\n**Song:**\nLevel and boundless, heaven and earth press near,\nyet depths beyond Dragon Gate outmeasure the sea.\nThis immortal herb grows as a tree among men—\nunrecognized, it buries itself in obscurity.\n\n**108: Mountain Purple Perilla**\n**Common Name:** Jiezhou Greens\n**Textual Name:** None recorded\nFound in Shezhou and Xuanzhou. Stems purple, leaves like true purple perilla. Cold in nature.\n\n**Song:**\nIn jade depths, profound waves arise,\nthis fine herb’s seeds resemble silk.\nWith cinnabar from Danyang, it banishes black hues—\nground with stone, it turns pure as snow.\n\n**109: Harmonizing Spirit Mushroom**\n**Common Name:** Returning Bone\n**Textual Name:** None recorded\nFound in Zhongwanzhou. Resembles *ju* trees. Effective for treating consumption and manic madness.\n\n**Song:**\nThe world already holds the herb of returning cinnabar,\nyet cast aside, it refuses to be consumed.\nThough born only to die again,\nhow pitiful—this immortal herb left to idle.\n\n**110: Fragrant Rue Guide**\n**Common Name:** Cottonwood\n**Textual Name:** None recorded\nGrows in Maozhou. Warm in nature. Becomes a tree with cotton inside. Treats blood stagnation and qi obstruction.\n\n**Song:**\nThe Dao levels the paths of heaven’s wandering,\nyet common folk fail to learn its ways.\nIf you take this and boil it with mercury,\nhow could white clouds not gather before your eyes?\n\n**111: Cliff Indigo**\n**Common Name:** Trough-Attaching Grass\n**Textual Name:** None recorded\nBitter in taste, toxic. One leaf with many points, like *jin* grass. Treats white wind.\n\n**Song:**\nGold forged like jade, fire’s sand,\nthis herb’s numinous power acts as a fang.\nIts nature shares a root with woman and fire—\nonly because it refuses to submit to the river chariot.\n\n**112: Startled Dragon’s Return**\n**Common Name:** Camphorwood\n**Textual Name:** None recorded\nToxic. Leaves as wide as three fingers, grows into a tree. Found near Hanshan in Mengxiazhou. Treats ghostly infestations.\n\n**Song:**\nThough kindred to the tree in form and grain,\nZhang Qian rode the azure clouds to bring it here.\nThis tree, once past a thousand years of age,\nparts every river’s course as though by its own might.\n\nThe preceding ten herbs: born on *jia-ren* days, wither on *wu-ren* days. Harvest them at the advent of the Beginning of Winter, or around the Spring and Autumn Equinoxes.\n\n**113: Purple Chicken’s Intestines**\n**Common Name:** Water Vine\n**Textual Name:** None recorded\nWarm in nature. Found in the Jiangnan Circuit. Grows near water, trailing in vines. Treats paralysis and numbness.\n\n**Song:**\nWhere emerald streams arise in distant, quiet pools,\nlater adepts lose their way in search of truth.\nWhen *ren-gui* days grow hard, boil it well—\nif left past two nights, it softens like mud.\n\n**114: Longevity’s Embrace**\n**Common Name:** Wintergreen\n**Textual Name:** None recorded\nWarm in nature. Found in the Hebei Circuit. Leaves evergreen, grows into a tree with fruit. Treats fractures and injuries.\n\n**Song:**\nThrough four seasons, unchanging beneath the jade-hued clouds,\nit harmonizes with the returning elixir as one family.\nThough men of old consumed it for millennia in vain,\nhow much less could it serve mercury as the river chariot?\n\n**115: Reed-Mouth Cold**\n**Common Name:** Heroic Mushroom\n**Textual Name:** *Fengyi*\nCold in nature. Found in Yun’an. Leaves round, stems small. Treats windstroke.\n\n**Song:**\nRound as the heavens and earth, shaped like an egg,\nthis numinous herb, this immortal formula, grows from the earth.\nSuch a treasure could save the mortal world—\ntoday, it is cherished only in the immortals’ scriptures.\n\n**116: Silk-Bearing Gold**\n**Common Name:** Tallow Tree\n**Textual Name:** None recorded\nCold in nature. Found in Mian and Jianzhou. Hangs in golden threads. Treats blocked menstruation in women.\n\n**Song:**\nTen thousand strands descend like green-gold silk,\nyet this immortal herb remains unknown to men.\nOnly when mercury’s body endures the flame\nmust it be refined a hundred times to enter the subtle mystery.\n\n**117: Guarding Niter**\n**Common Name:** Dissolving Bamboo Grass\n**Textual Name:** *Caogou Zhi*\nHot in nature. Found in Guangzhou. Leaves round as fingers, with stems. Prepares against noxious cold and poison.\n\n**Song:**\nAmid the thousand mists of the Three Gorges,\nthis cold herb takes form in Guangzhou.\nIn the smoke of the eight minerals, it is father and son;\nin the heavens above, it bears many names.\n\n**118: Imperial Wine-Soberer**\n**Common Name:** Cinnabar Mushroom\n**Textual Name:** *Lou Chun Grass*\nCold in nature. Found in the Henan Circuit. Three flowers, leaves green. Treats heart pain.\n\n**Song:**\nWhy does this blue-cinnabar dissolve wine’s grip?\nThe numinous herb must first be boiled through the night.\nFrom now on, drink deeply—drunkenness will fade,\nespecially when plucked and burned in the fire.\n\n**119: Jade-Enveloping Mushroom**\n**Common Name:** Floating Water Indigo\n**Textual Name:** None recorded\nCold in nature. Found in the Lingwai Circuit. Like small indigo, leaves long and pointed. Treats lung paralysis.\n\n**Song:**\nRow upon row, it rises by the stream in verdant shoots,\nits power unyielding, equal to the eight minerals.\nIn every crucible, only a pinch is needed—\nelse, like all things, it must be burned in the fire.\n\n**120: Lute Mushroom**\n**Common Name:** Hanger-On\n**Textual Name:** *Baitian*\nCold in nature. Found in Yunnan. Leaves round and long, bearing seeds. Treats severe wind.\n\n**121: Earth-Simmered Vine**\n**Common Name:** Great Jade\n**Textual Name:** *Laohan*\nCold in nature. Found in Bazhong Prefecture. Leaves with three points, trailing vines. Treats wind diseases.\n\n**Song:**\nOnly when lush does one know it grows on Heaven’s Terrace—\nit must be drawn with green salt to yield white sap.\nIf smoke lingers yet fails to rise above the embers,\nthen this vine must be planted to make a fence.\n\n**122: Bronze-Hoof Vine**\n**Common Name:** Supreme Jade Mushroom\n**Textual Name:** *Linzhi*\nCold in nature. Found in Qin Chuan. Leaves long and pointed, trailing vines. Treats wind malignities.\n\n**Song:**\nThe Queen Mother of the East wanders amid clouds and rain,\nyet the Bronze-Hoof Vine refuses to grow.\nOnly when Your Majesty gathers it in Qin Chuan—\nand when gathering, never speak its name beforehand.\n\n**123: Barbarian Gold Toxin**\n**Common Name:** Miasma-Heaven Tree\n**Textual Name:** None recorded\nToxic. Found in Yunnan. Treats snake venom.\nThe tree stands no taller than three feet; its leaves are pointed, and its broken sap is lethal.\n\n**Song:**\nWhen yin and yang fail to merge, this tree is born—\nits poisonous branches refuse to grow tall.\nBoil it in the second *hai* hour by the river’s edge,\nand you will know how yin’s *gui* dissolves without flame.\n\n**124: River-Seeking Herb**\n**Common Name:** River Wind\n**Textual Name:** None recorded\nCold in nature. Found in southern Qian. The sprouts grow several yards long. Treats joy-sickness.\n\n**Song:**\nThe vast sea stretches a thousand myriad leagues—\nhow could this herb’s search be twice as long?\nOnly Zhang Qian would know where to find it,\nbut when gathering, never decoct it with salt.\n\n**125: Essence Mushroom**\n**Common and Textual Names:** None recorded\nYellow-white in color, without stem or stalk, unaligned with the seasons, and does not treat illness.\n\n**Song:**\nWhen it sprouts in spring, it is mostly yellow-white;\nwhen it sprouts in summer or autumn, it bears black and green.\nOnly ask Dongfang Shuo before the palace hall—\nhe knows both its place and its name.\n\n**126: Stone Channel**\n**Common Name:** Cold Bamboo Herb\n**Textual Name:** None recorded\nCold in nature. Kills parasites. Found in southern Jing. Resembles bamboo sprouts, long in growth.\n\n**Song:**\n\n**Song:**\nIts emerald roots spread across earth and sky,\nits power settles the po and anchors the hun.\nWherever planted in the third month’s season,\nthat household’s descendants shall prosper.\n\n**127: Wild Lotus**\n**Common Name:** Tray Herb\n**Textual Name:** None recorded\nCold in nature. Found in Huainan Circuit. Leaves as large as platters, bearing rootlets.\n\n**Song:**\nIts whole body grows and thrives by the streamside—\nsummon Zhang Qian to ask of its native land.\nOnce gathered, chop root and stem together,\nand it can boil white the foulest cinnabar sores.\n\n**128: Gold-Encrusted Branch**\n**Common Name:** Red Sandalwood\n**Textual Name:** None recorded\nWarm in nature. Found in Lingnan. The tree casts a golden sheen. Treats the five kinds of snake venom.\n\n**Song:**\nLayer upon layer, gold upon golden sheen,\nthis tree is rarely met with among men.\nWhen your servant reached Mount Ao’s northern face,\nthe Perfected One himself bestowed the dark gong.\n\n**129: Earth Vein**\n**Common Name:** Thorn Taro\n**Textual Name:** None recorded\nCold in nature, found in the Five Lakes. Leaves and roots each a foot long. Treats all heat illnesses.\n\n**Song:**\nWarm and cool, sun and moon soak the boundless sky,\nfine herbs fill the fields of the human realm.\nAdd but a pinch among the Eight Stones—\nforever shall your golden bones endure.\n\n**130: Golden Sheen Copper**\n**Common Name:** Boxwood\n**Textual Name:** None recorded\nCold in nature. Found in Maozhou. Can treat leprosy.\n\n**Song:**\nAmid the thriving forests of myriad trees,\nonly this one pierces the sage’s discerning eye.\nWhen you seek to gather it, the Jade Dragon enters—\ndo not treat it as common or take it lightly.\n\n**131: Deep Pool Grass**\n**Common Name:** Chin-Rest Heaven\n**Textual Name:** None recorded\nCold in nature. Found in Jinzhou.\n\n**131: Deep Pool Grass (continued)**\nLeaves fine, stems long, color blue-green tinged with yellow. Treats shivering cold.\n\n**Song:**\nSubtle grasses cluster by the quiet stream,\ndrooping leaves and slender shoots beside the water’s edge.\nCountless immortals have consumed and ascended—\nonce bestowed by parents upon the wife of Right Army.\n\n**132: Purple Palace**\n**Common Name:** Frost-Bearing Flower\n**Textual Name:** None recorded\nFound in Hebei Circuit. Leaves the size of a palm, purple stems. Treats scorching heat.\n\n**Song:**\nJade Yang Palace maidens play at hidden hooks,\nthe Purple Palace conceals its form, its shape withdrawn.\nHaving flown to the Nine Heavens’ celestial court,\nthe immortal scriptures transcribed remain to this day.\n\n**133: Wuyang Seed**\n**Common Name:** Sky-Connecting Grass\n**Textual Name:** None recorded\nWarm in nature. Found on Kunlun. Shoots long, leaves fine. Treats bone paralysis.\n\n**Song:**\nDelicate Wuyang grass, its seedlings stretch to avoid the spring wind.\nAmong great medicines, its efficacy is most profound—\nmeet water and you must not delay.\n\n**134: Pointed Jade**\n**Common Name:** Human Longevity\n**Textual Name:** None recorded\nCold in nature. Leaves large as a hand, resembling plantain. Treats horse ringworm.\n\n**Song:**\nWinding through lake streams into the Tian Mountains,\nshoots rise several feet, leaves pointed and round.\nA slice of white gold, like frost abiding—\nis this not a numinous fragrance, yet how can it be whole?\n\n**135: Moonless Ganoderma**\n**Common Name:** Germ-Free\n**Textual Name:** None recorded\nWarm in nature. Found throughout the world. Color purple-red, stemless. Treats malignant sores.\n\n**Song:**\nYin and Yang’s abundant qi naturally engenders it,\nunbound by the moon’s duality of light and dark.\nIt can suppress and subdue mercury—\nthe Yang King shall then lose his tender affection.\n\n**136: Sea Passage**\n**Common Name:** Face Ganoderma\n**Textual Name:** None recorded\nWarm in nature. Found beyond the mountain ranges. Leaves like white *tongbei*. Regulates menstrual irregularities.\n\n**Song:**\n\n**137: Wu Net Grass**\n**Common Name:** None recorded in common texts\n**Textual Name:** None recorded\nToxic in nature. Found in the Jiang-Huai region. Grows into a tree, leaves like two fingers. Treats *zanpan*.\n\n**Song:**\nLeaf upon leaf, life-generating like the moon,\ningesting it restores one’s root—becoming an immortal.\nMoreover, when refined with the returning elixir,\nhow could golden bones not be made whole?\n\nThe Empress Dowager of the former dynasty commanded its gathering,\nbut after her reign, none sought it again.\nDo not speak of its use within the golden elixir—\nif known to others, it would be prized beyond gold.\n\n**138: Wu Pear Reed**\n**Common Name & Textual Name:** Identical\nWarm in nature. Found in Jiangnan. Vines extend with branches. Treats metal-inflicted wounds.\n\n**Song:**\nLush vines trail, leaves like rattan,\nmost skillful in mercury, versatile in function.\nPounded thin, it fails—boil it further,\nthen it softens, pliable as a rope.\n\n**139: Wu Millet Vine**\n**Common Name:** Interval Ganoderma\n**Textual Name:** None recorded\nWarm in nature, toxic. Found in Yunnan. Slender leaves with seeds. Treats *leng* disease.\n\n**Song:**\n\n**140: Rao Ya Huan**\n**Common Name:** Lue Shao Sprout\n**Textual Name:** None recorded\nFound in Shu. Vines extend with seeds. Treats leaking sores.\n\n**Song:**\nGolden petals tangled with jade blossoms,\nWu and Shu each yield two kinds.\nWhen gathering, take care—\ndo not let the sunlight slant.\n\n**140: Rao Ya Huan (alternate entry)**\n**Song:**\nThe Sacred Emperor’s heavenly maiden,\nby this spirit herb ascended to heaven.\nNow that you know the Three Perfected Grasses,\nyou shall surely meet the ancient Xihe’s chariot.\n\n**141: Golden Flower Boat**\n**Common Name:** Worshipping Woman’s Ganoderma\n**Textual Name:** None recorded\nCold in nature. Found in Weinan. Pointed leaves, long stems. Treats all wind disorders.\n\n**Song:**\nLayered red leaves embrace the azure void,\nten thousand blossoms bloom from the earth.\nWhen gathering, consult Master Fangshuo—\nonly you must not offend the spirits.\n\n**142: Rao He Gong**\n**Common Name:** Red Willow\n**Textual Name:** None recorded\nCold in nature. Found in Zizhou. Tree-like. Also treats accumulations and hard masses.\n\n**Song:**\nThe immortal praised the seeds of Mount Tiantai,\neach year the Perfected One secretly commands their opening.\nFangshuo took some home last year—\nwhy did he not present them when summoned?\n\n**143: Wang Grass**\n**Common Name & Textual Name:** None recorded\n\n**Toxic in nature.** Found in Shu lands. Grows into a tree; leaves as wide as two fingers. Treats sores and ringworm.\n\n**Song:**\nThe immortal herb grows in distant lands,\njourneying alongside the returning elixir.\nUnlike other remedies with lustrous hues,\nit alone harmonizes well with mercury’s nature.\n\n**144: Li Lu**\n**Common Name:** None recorded in texts.\n**Warm in nature.** Found in Shu. Has trailing vines. Its bark treats metal-inflicted wounds.\n\n**Song:**\nDeep within the sacred mountains it dwells,\nborn where sun and moon shine through.\nAs an assistant to the cinnabar,\neven cinnabar itself dare not contend.\n\n**145: Xu Sui Grass**\n**Common Name:** Questioning Ganoderma\n**Textual Name:** None recorded\n**Toxic in nature.** Slender leaves with seeds. Treats cold disorders.\n\n**Song:**\nThe earth spans a thousand rivers wide,\nthe mountains cradle a hundred herbs divine.\nFrom here to the Nine Heavens’ height,\non the mountain’s edge, the Jade Capital shines.\n\n**Additional Miscellaneous Herbs (85 in total, without songs, listed below):**\nHeavenly General, Great Boar, Celestial Maiden Ganoderma, Black Flight, Luan Blossom, Qin Woman’s Net, Shrimp-Fin Vegetable, Heavenly Maiden’s Robe, Floating Perfection, Orphan, Three Springs Vegetable, Nine-Tailed Insect, Qin Perfected One, Thunder Onion, Azure Azure, Jade Maiden Flower, Heaven-Born Ganoderma, Jade-Carving Grass, Solitary Goat, Mat Flower, Lingering Grass, Stone-Dissolving Herb, White Horse Vegetable, Stone Sword, Heavenly Capital, Water Purple Perilla, Shy Woman’s Ganoderma, Human-Face Vegetable, Stone Mother, Solitary Mugwort, Chen Gong’s Chariot, Water Giant Victory, Assisting Fish Fat, Heavenly Tube, Ghost’s Curtain, River Pig’s Ear, Qin Land’s Spots, Bitter Gourd Flower, Sheep’s Tail, Dog’s Ear, Returning End Grass, White Poplar Ganoderma, Dictamnus Root-Bark, Ghost Taro, Single Decoction, Wu Yang Seed, Brocade Robe, Cold-Adding Grass, Taro Mat, Great Segment, Two-Foot Cheek, Ten Thousand Li Long, Imperial Wine-Soberer, Dog Mugwort, Dog Pepper, White Luxuriant Tree, Golden Shadow Companion, Heavenly Hall Woman, Divine Chaste Tree, Asarum, Purple Bitter Taste, Chen Empress’ Mushroom, Tall Sheep’s Tail, Southern Wind, Red Mother, Ever-Spring Grass, Miasma Heaven Tree, Worshipping Woman’s Ganoderma, Stone Flower, Stone Ganoderma, Hibiscus Woman’s Spring, Reed Spirit Grass, Offering Perfected One, Bamboo Hall, Red Sandalwood, Qin Woman’s Ganoderma, Mountain Purple Perilla, Dog-Holding Grass, Tiantai Mountain Herb, Mountain Maiden Grass, Bronze Hoof Vine, Wrinkled-Face Grass, Excessive Rain Grass, White Flower Tree, Purple Divine Ganoderma.\n\n**Total: 85 herbs.**\n\n**146: Bai Luo Pin**\n**Common Name:** Cloud Ganoderma\n**Textual Name:** Purple Fan\n**Benign in nature.** Found in Lingnan. Leaves resemble round or notched oil palm; stems vary between purple and green. Born in *wu-ding* (earth-metal) and *yi-ding* (fire-metal) years, withers in *jia-ren* (wood-metal) years. Grows several *chi* tall.\n\n**147: Qing Tian Xin**\n**Common Name:** White Lofty\n**Textual Name:** Single Mugwort\n**Cool in nature.** Found in Khotan. Leaves resemble mugwort, with three lobes forming branches; flowers are greenish-yellow. Born in *jia-wu* (wood-earth) years, withers in *ding-ren* (fire-water) years. **Treats internal injuries.** Harvest before the White Dew solar term, after the Start of Autumn. *Song:*\n*Not tall, leaves like oil’s sheen,*\n*Ever on high peaks, ridge tops unseen.*\n*Though born when spring’s first breath is true,*\n*Its power waits till autumn’s due.*\n\n**148: Feng Huang Ke**\n**Common Name:** Mountain Bamboo\n**Textual Name:** Snow-Bearing Countenance\n**Cold in nature.** Found in Southern India. Leaves resemble bamboo, branches like wood, tips like scallions; flowers are purple. Born in *jia-ding* (wood-fire) years, withers in *wu-ji* (earth-earth) years. **Treats proliferating sores.** Harvest before the Limit of Heat solar term, after the Start of Summer. *Song:*\n*Leaves like winter bamboo cling to cliffs so steep,*\n*In gardens too, or courts where mortals keep.*\n*Flowers purple-red, inconstant bloom,*\n*Yet radiant glory fills all seasons’ gloom.*\n\n**149: Chi Luo Teng**\n**Common Name:** Red Apple Grass\n**Textual Name:** Earth’s Heart\n**Cold in nature, bitter in taste.** Shape resembles paulownia leaves, color purple-red. Found in Silla. **Treats inverted sores.** Born in *wu-ren* (earth-water) years, withers in *ding-gui* (fire-water) years. Harvest before the Lesser Cold solar term, after the Start of Spring. *Song:*\n*Leaves like red silk twine round balustrades,*\n*On mountain peaks or courts where light pervades.*\n*To fade, cast it in ninefold streams—*\n*There, in the waters, its spirit gleams.*\n\n**150: Bai Luan Xiang**\n**Common Name:** Three-Leaf Grass\n**Textual Name:** Purple Remnant\n**Harmonizes with all medicines.** Found in Central India. Leafless, with three leaves. Born in *wu-geng* (earth-metal) years. **Treats consumptive illnesses.** Harvest before the Grain in Ear solar term, after the Start of Autumn. *Song:*\n*Vines unfurl three leaves, so slender, slight,*\n*Half by the pool, half on the rocky height.*\n*To know it, boil in sunlit hours,*\n*Then refine by moon to salt’s pure powers.*\n\n**151: Sao Tian Yu**\n**Common Name:** Azure-Stem Ganoderma\n**Textual Name:** Silk-Patterned Grass\n**Cold in nature.** Found in Ruizhou. Leaves like fingerprints, growing several *chi* tall. Born in *jia-wu* (wood-earth) years, withers in *bing-ding* (fire-fire) years. **Treats water diseases.** Harvest before the Start of Winter solar term, after the Winter Solstice. *Song:*\n*By streams, its veins like silk in crimson script,*\n*Year after year, its leaves turn verdant, stripped.*\n*When plucking, heed the taboos well,*\n*Lest water’s essence break the spell.*\n\n**152: Feng Zhen Ren**\n**Common Name:** Water Knot\n**Textual Name:** Yellow Bramble\n**Hot in nature.** Found in Daizhou. Leaves green with seeds. Born in *jia-ding* (wood-fire) years, withers in *gui-ji* (water-earth) years. *Song:*\n*Flowers like gold unfurl on mountains wide,*\n*Leaves in three blades, as if by scissors tied.*\n*When quicksilver’s life is sealed anew,*\n*It crafts the Great Return’s elixir true.*\n\n**153: Heaven’s Circlet Zhi**\n**Common Name:** Stone Willow\n**Textual Name:** Earth Zhi\n**Hot in nature.** Found in Longyou. Resembles a willow, several *chi* tall. **Treats toothache.** Harvest after the Cold Dew solar term, before Minor Heat. *Song:*\n*Stem upon stem, white, clinging to cliffs,*\n*Leaf upon leaf, arrayed beside blossoms.*\n*Place a pinch by green-watered pools—*\n*From this, the Azure Elixir sheds all dust.*\n\n**154: Water Peach**\n**Common Name:** Green-Red\n**Textual Name:** Heroic Zhi\n**Warm in nature.** Found on Mount Lu in Jiangzhou. Born in *wu-ding* (earth-fire) years, withers in *geng-ji* (metal-earth) years. Resembles a peach, grows near water. **Treats paralysis and spasms.** Harvest after the Great Cold solar term, before the Spring Equinox. *Song:*\n*Wondrous zhi, rare herb of sacred peaks,*\n*Its trunk stands by winding stream and spring.*\n*Best used to disperse water’s qi with its bloom—*\n*Gather it only when spring’s warmth is full.*\n\n**155: Subtle Fragrance**\n**Common Name:** Stone Marrow\n**Textual Name:** Earth Subtlety\n**Cold in nature.** Found in Hunan.\n\n**155: Subtle Fragrance (continued)**\nLeaves small, flowers delicate. Born in *wu-ding* (earth-fire) years, withers in *jia-yi* (wood-wood) years. **Treats chest and diaphragm heat-qi.** Harvest after the Start of Autumn solar term, before the Limit of Heat. *Song:*\n*Clustered fine leaves, tiny blossoms arrayed,*\n*On level slopes or cliffs they are laid.*\n*Like grass from Queen Mother’s western bower,*\n*Examine the stem—slender as a hairpin’s power.*\n\n**156: Verdant Layers**\n**Common Name:** Layered Terrace Grass\n**Textual Name:** Bramble Shadow\n**Warm in nature.** Found in Longyou. Leaves small and layered. Born in *bing-ding* (fire-fire) years, withers in *geng-ji* (metal-earth) years. **Treats malignant sores.** Harvest after the Grain in Ear solar term, before the Start of Spring. *Song:*\n*Leaves bearing fruit hold the greatest might,*\n*Heaven and earth share this same sight.*\n*When gathering, keep it pure and bright—*\n*For ease in use, align with *zhun-meng’s* light.*\n\n**157: Mountain Brocade Zhi**\n**Common Name:** Mountain Cloud Terrace\n**Textual Name:** Nine-Hole Vegetable\n**Cold in nature.** Found in Xianyang. Branches and leaves resemble *yuntai*. Born in *jia-ding* (wood-fire) years, withers in *mao-you* (wood-metal) years. **Treats all heat-winds.** Harvest after the Winter Solstice, before the Waking of Insects. *Song:*\n*Branches coil where mountain mists entwine,*\n*By cliffs or pools they softly shine.*\n*If in flowers they’re boiled awhile,*\n*Their taste reveals a sweetness mild.*\n\n**158: Threaded Gold Cold**\n**Common Name:** Purple Stone Duckweed\n**Textual Name:** River Qi\n**Warm in nature.** Toxic. Found on Mount Zhongnan. Leaves like *wei*, stems purple. Born in *wu-ding* (earth-fire) years, withers in *yi-gui* (wood-water) years. **Treats qi-swelling.** Harvest after the Start of Autumn, before the Start of Winter. *Song:*\n*Moonlight on golden towers guides the true,*\n*The third pool’s depths hold spirits anew.*\n*Just at Start of Winter’s turn,*\n*Gather when cranes’ cries cease to burn.*\n\n**159: Cowrie Purple**\n**Common Name:** Wind Stone Vine\n**Textual Name:** Earth Oil\n**Cold in nature.** Found on White Horse Mountain. Leaves round, vines trailing. Born in *jia-yi* (wood-wood) years, withers in *wu-ji* (earth-earth) years. **Treats acute exhaustion.** Harvest after the Lesser Cold solar term, before the Spring Equinox. *Song:*\n*Vines spread, round leaves in rows align,*\n*By cliffside springs they softly twine.*\n*Though Eight Stones may seem of no worth,*\n*Grind with green lotus for rebirth.*\n\n**160: Crane Spring Zhi**\n**Common Name:** Crow’s-Foot Chicken Grass\n**Textual Name:** Fine Zhi Grass\n**Hot in nature.** Found in Jingzhou. Leaves small, stems slender. Born in *wu-ren* (earth-water) years, withers in *jia-yi* (wood-wood) years. **Treats chronic diarrhea.** Harvest after the Summer Solstice, before the Lesser Heat. *Song:*\n*Slender stems with leaves so slight,*\n*By waterside they catch the light.*\n*When summer’s heat begins to wane,*\n*Gather then to ease the pain.*\n\n**161: Stone Joint Zhi**\n**Common Name:** Cold Seed\n**Textual Name:** Embracing Spring\n**Hot in nature.** Found in Lantian County. Leaves large and pointed, stems purple with nodes. Born in *gui-ji* (water-earth) years, withers in *zi-wu* (water-fire) years. **Treats heart pain.** Harvest after the White Dew solar term, before the Beginning of Winter. *Song:*\n*Leaves like mulberry, stems like joints,*\n*Loving to grow on lofty cliffs’ heights.*\n*If brought among men to repel ghosts,*\n*It can also in heaven subdue spirits.*\n\n**The preceding entries correspond to solar terms, the Six Jia cycles, and the numinous subtleties of cold and heat.**\n\n**162: Stone Toon Zhi**\n**Common Name:** Scenic Zhi\n**Textual Name:** Yellow Wind\nFound in the Jiangnan Circuit. **Treats heart vomiting and counterflow.** *Song:*\n*Vines extend from branch to branch by cliffs,*\n*With ocean veins’ flow, its taste bears salt.*\n*A myriad herbs of Ziyang, heaven’s grass—*\n*Fit to boil with mortal red salt.*\n\n**163: Stone Pepper Vine Zhi**\n**Common Name:** Nine Fields\n**Textual Name:** Heavenly Circumference\nFound in Beizhou. **Treats paralysis and wilting.** *Song:*\n*Carved like the Queen Mother’s skirt sash,*\n*Slender stems from immortals’ abode.*\n*When gathering, purity must be kept—*\n*Still fear the golden shadow slanting west.*\n\n**163: Stone Pepper Vine Zhi (continued)**\n*Song:*\n*Vines stretch far into the celestial net,*\n*Later immortals, gather without disdain.*\n*Harvest at dawn, at noon—beware the storm,*\n*No need to cross the river’s waves again.*\n\n**164: Crane-Chanting Branch**\n**Common Name:** Stone Leaf\n**Textual Name:** Wenlu\nFound in Daizhou. **A single stem bears many leaves, growing on stone.** *Treats all wind-cold disorders.*\n*Song:*\n*Dragon’s zhi and phoenix’s plume from wondrous peaks,*\n*Dwelling by moonlit sands near cliffside heights.*\n*Born where willow catkins drift in empty light,*\n*Mix with mercury and boil with salt just right.*\n\n**The preceding entries are warm or hot in nature.**\n*Born under Jia and Ren, wither under Yi and Gui.*\n*Gather after the Winter Solstice, seek before the Start of Spring.*\n\n**165: Earth Bamboo**\n**Common Name:** Golden Apple\n**Textual Name:** Geng Zhi\n**Nature:** Cold\nFound in Hebei. **Appears like bamboo stems, green in color.** *Treats throat blockage.*\n*Born under Wu and Ding, wither under Jia and Yi.*\n*Gather after the Great Cold, seek before the Start of Winter.*\n*Song:*\n*Slender stems and tiny leaves of verdant hue,*\n*Known by two names—one celestial, one earthly true.*\n*This plant shifts unseen through all four seasons’ span,*\n*Most potent when gathered as blossoms begin.*\n\n**166: Purple Gold Bloom**\n**Common Name:** Stone Heart\n**Textual Name:** Fish Leaf\n**Nature:** Hot, toxic\nFound in Luozhou. **Leaves round with purple undersides.** *Treats malignant sores.*\n*Born under Jia and Ji, wither under Wu and Ren.*\n*Gather after the Spring Equinox, seek before the Start of Summer.*\n*Song:*\n*When mortals ask of this herb’s name,*\n*Its leaves are round with crimson specks like shells.*\n*Boiled as in the darkest depths’ alchemy,*\n*Even sinking stones will rise and float as well.*\n\n**167: Sun Water Mint**\n**Common Name:** Supreme Peace\n**Textual Name:** None recorded\n**Nature:** Warm\nFound in Chenxu Prefecture.\n\n**167: Sun Water Mint (continued)**\n**Leaves resemble perilla, stems purple.** *Treats all types of coughs.*\n*Song:*\n*Leaves cut like gold’s base, wrinkled with golden light,*\n*Growing by perennial streams of emerald green.*\n*Only when true adepts come to gather and refine,*\n*Do soft robes grace the halls of Purple Yang’s abode.*\n\n**168: Stone Purple Vine**\n**Common Name:** Bowstring Grass\n**Textual Name:** Manifest Vision\n**Nature:** Hot\nFound in Silla. **Leaves vine-like, stems thorned.** *Treats malignant sores.*\n*Song:*\n*Leaf upon leaf, curved ‘round the brook’s hidden bend,*\n*How pitiful this true herb—mortals scarce attend.*\n*Only the wanderers of Taihang and southern peaks,*\n*Boil it to brew the sacred fish for transcendence seek.*\n\n**169: Purple Cowrie Vine**\n**Common Name:** Mirror Chill\n**Textual Name:** None recorded\n**Nature:** Hot\nFound in Luozhou. **Stems purple, leaves emerge above the flowers.**\n*Song:*\n*Graceful purple leaves on trailing vines unfold,*\n*Scarce in wild mountains, rare as legends told.*\n*Gathered, it banishes a hundred ills with ease,*\n*Yet pities take—it hides in cliffs’ secluded pleas.*\n\n**170: Thousand Mulberry Vine**\n**Common Name:** Flower Mulberry\n**Textual Name:** Reverent Mulberry\n**Nature:** Hot\nFound in Chenxu Prefecture. **Leaves vine in trailing strands.**\n\n**170: Thousand Mulberry Vine (continued)**\n**Remedy for lumbar and back pain.**\n*Song:*\n*Passed down the Jade Tree formula of immortals fair,*\n*Once tasted in Chenxu—its blessings to share.*\n*Gather with fasting, in silence profound,*\n*Consume to banish pain, life’s span unbound.*\n\n**171: Water Chrysanthemum**\n**Common Name:** Golden Edge\n**Textual Name:** None recorded\nFound in Henan Prefecture. **Leaves like the scholar-tree, flowers like chrysanthemum.**\n**Remedy for all water qi and edema.**\n*Song:*\n*Nowhere in mortal lands will it thrive,*\n*Yet deep in distant woods, it comes alive.*\n*Where it takes root, no other tree may stand,*\n*Only brambles and thorns in dense rings expand.*\n\n**172: Roe’s Hoof**\n**Common Name:** Qi Mushroom\n**Textual Name:** None recorded\n**Nature:** Cold\n**Leaves like a roe’s hoof, stems purple.**\n**Remedy for chronic diarrhea and discharge.**\n*Song:*\n*Commonly called Flower Mulberry, its leaves like slender strands,*\n*Trailing vines by the brook’s edge in winding bands.*\n*Sharing flavor with Roe’s Hoof in kindred grace,*\n*Together steeped in icy broth to cool and brace.*\n\n*The \"Songs of the Western Exile’s Returned Elixir\" from Mount Penglai, Scroll the Lower, concludes.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "蓬莱山西灶还丹歌 经名：蓬莱山西灶还丹歌。 原题汉黄玄锺撰。 但书中官名、地名及歌词文体音出唐代。 当系唐人伪托。 原本一卷，徒分作二卷。 底本出处：《正统道藏》洞神部众街类。 蓬莱山西灶还丹歌卷上 汉检校仆射金紫光禄大夫黄玄锺撰 臣闻鹪鹩在木，不逾一枝之巢。 偃鼠饮河，无过一肠之满。 伏惟陛下名逾东户，调美南风，在於兆民，无不咸止。 何重万乘之荣，而轻不死之道。 臣伏以元封年奉诏蓬莱，亲求妙术，经过海难，涉历幽阳，不惮危亡，而求至道。 先是，皇恩远责，以感微臣尽忠，得遇大仙，躬赐灵药，极诚进上。 何谓陛下安听佞臣，信为祆诈，赐臣自饵。 臣俄别皇庭，不胜悲望，游宫未遍，少许十年，恐虑从容，自为永阻。 又承陛下令东方朔召西王母、夜置承露盘，即知陛下后悔之甚。 臣又闻事君尽忠，在朋立义，於君不忠，则人臣共罚； 不义於朋，则交友共弃。 臣於紫阳宫少微院西灶，躬受还丹妙道讫，依方潜录。 伏惟陛下，须纳忠臣谏，必效此方，莫比昔年，却从俗佞。 其药令左拾遗陈方景捣合，右丞周真宜候火，臣男志诚启垆并醮等，必锻炼精微。 愿懃诚志，紫琼暂逢，长为金骨。 陛下莫重含元大内，为上极精华。 北阙西堂，殊非至广。 太常九部，不足为声。 粉黛诸房，全为丑质。 矧此蓬莱妙绝殊境，得号仙山。 日殿月宫，云房金阁。 堂排金碧，楼焕珊瑚，鹊绕灵芝，鸾飞琼树。 天男玉女，沸鼎弦歌。 异鸟名禽，朝来不歇。 水精帘外，飒飒玄风。 碧玉户中，泠泠细雨。 琼浆一饮，少许千年； 大药暂餐，应期万载。 等闲见桑田为海水，见海水作桑田。 或即上朝天老，或自适云关，时下入瀛洲，散寻异宝。 寰中黄屋，不足为尊，补衮之流，未足为贵。 陛下何不生亲异境，而苦恋凡问。 目看冠葬石堂，身埋后土，使子孙空拜，沥酒寒陵，朝暮之间，即当见矣。 纵百年天子，不及一日仙人。 伏惟圣智审裁，莫自求其毙矣。 谨差南阳执药童，奉表以闻。 蓬莱山南阳紫微右长丞黄玄锺顿首谨言。 佥举臣此圣道，世不异求，惟在清斋，存心念静，设垆安灶，不得抵作方神，举措发机，须合天道。 其石药等，并须上好草药，勿令错误。 其药皆是州土进上，唯三般，出臣此山，以人间六味替用，并列如后。 石药黄牙歌一首，是造黄牙五言，草药形状名，采时节应用生死，一百七十二味草药歌，都合计一百六十八首。 造黄牙第－ 歌曰： 铺壬为迭迭，铅黄粉次重重。 牛酉白黄三色，依东尾咸浆味共通。 一安丙丁上，齐入赤炎中。 右依歌，并须重重，以壬尽为度，应夏至之节，以冰石研之佳，依东尾，忌甲戊庚除定等日。 露容草第二 俗为地录，书云石录。 茎花赤，性毒，恶理求体脉，生岩石，出河南，生甲乙，死戊己，甲寅，叶圆。 春分后二十日采，上治恶疮，应春分节。 歌日： 此药人问有，河南出最珍。 拈来和汞点，一夜应天真。 霜容草第三 俗为天涯，书为白微，性与上同。 出刻南道，生甲壬，死戊癸，引蔓三花，应夏至节，立春后采之。 歌日： 远树攀崖上，三花叶对峰。 拈来埋乙地，依东尾法还入癸壬中。 双夫草第四 俗名芙蔓，书为紫琼。 性与上同，治劳，出安南府。",
      "translated_text": "**The Song of Returning Elixir from the Western Furnace of Mount Penglai**\n\n**Title:** *The Song of Returning Elixir from the Western Furnace of Mount Penglai*\n**Original Author:** Attributed to Huang Xuanzhong of the Han, though official titles, place names, and literary style suggest a Tang-era forgery. Originally one scroll, later divided into two.\n**Source:** *Daoist Canon of the Zhengtong Era*, *Compendia of the Divine Empyrean Section*, *Miscellaneous Arts Category*.\n\n---\n\n### *The Song of Returning Elixir from the Western Furnace of Mount Penglai, Scroll One*\n**Composed by Huang Xuanzhong, Han Examiner of the Court of Judicature and Revision, Grand Master for Glorious Happiness with Gold and Purple Insignia**\n\nYour servant has heard that the wren in the trees does not seek more than a single branch for its nest, and the field mouse drinks from the river only to fill its belly. Yet Your Majesty’s fame surpasses that of Donghu, and your governance harmonizes the southern winds, bringing peace to the myriad people—none fail to find repose. Why then do you prize the glory of the imperial chariot yet slight the Dao of immortality?\n\nYour servant humbly submits: In the Yuanfeng era, by imperial decree, I journeyed to Mount Penglai to seek the wondrous arts. I endured the perils of the sea, traversed the hidden yang, and risked death in pursuit of the supreme Dao. By the distant grace of Your Majesty’s favor, moved by this humble servant’s devotion, I encountered a great immortal who bestowed upon me the sacred elixir. With utmost sincerity, I presented it to the throne. How could Your Majesty heed the words of flattering ministers, mistaking it for heresy and deceit, and command your servant to consume it himself? Soon after, I took leave of the imperial court, overcome with sorrow and longing. Before I could fully explore the palaces, a decade passed in fleeting moments, and I feared that leisurely deliberation would forever bar my return.\n\nLater, I learned that Your Majesty had ordered Dongfang Shuo to summon the Queen Mother of the West and erect a dew-receiving basin—clear proof of Your Majesty’s deep regret. Your servant has heard that to serve one’s lord with loyalty and stand by one’s friends with righteousness is the way of the minister. Disloyalty to the sovereign invites punishment from all officials; betrayal of friends brings abandonment by all companions. At the Western Furnace of the Shaowei Courtyard in the Ziyang Palace, I personally received the wondrous Dao of the returning elixir and secretly recorded its formula. I implore Your Majesty to heed the admonitions of loyal ministers and verify this method. Do not repeat the errors of past years by yielding to the words of vulgar flatterers.\n\nThe elixir shall be compounded by Left Reminder Chen Fangjing, with Right Aide Zhou Zhenyuan overseeing the firing. My son, Zhicheng, will tend the furnace and perform the offerings, ensuring the refinement is precise and subtle. With earnest devotion, may the purple jade briefly appear, and may Your Majesty’s bones become golden for eternity.\n\nWhy cling to the grandeur of the Hanlin Palace, which is but the essence of the mortal realm? The Northern Gate and Western Hall are far from vast; the Nine Divisions of the Imperial Sacrifices cannot compare to true harmony; the powdered and rouged chambers are but ugly vessels. How much more sublime is the unparalleled wonder of Mount Penglai, famed as the immortal mountain! Here stand the palaces of the sun and moon, cloud chambers and golden pavilions. Halls are adorned with gold and jade, towers gleam with coral, magpies encircle sacred mushrooms, and simurghs soar among jade trees. Heavenly boys and jade maidens stir the cauldrons with song, while rare birds and famed fowl arrive without cease. Beyond the crystal curtains, the mysterious wind rustles; within the jasper doors, fine rain drizzles. A single sip of jade nectar grants a thousand years; a moment’s taste of the great elixir ensures ten thousand ages. Soon you will witness the mulberry fields turn to sea, and the sea revert to mulberry fields. Some ascend to attend the Heavenly Elder, others pass through the Cloud Gate, descending to Yingzhou to seek rare treasures. The yellow-roofed halls of the mortal world are not worthy of reverence; even the embroidered robes of high ministers cannot compare in nobility.\n\nWhy does Your Majesty not personally visit these wondrous realms, instead suffering the bonds of the mundane? Soon you will see your crown entombed in the stone hall, your body buried in the earth, leaving your descendants to kneel in vain, pouring libations at your cold mausoleum. In the span of a morning and evening, this fate will be upon you. Even a hundred years as Son of Heaven cannot equal a single day as an immortal.\n\nI beseech Your Majesty’s sagacious judgment: do not seek your own demise.\n\nRespectfully dispatched, the Elixir-Bearing Youth of Nanyang, to present this memorial for Your Majesty’s consideration.\n\n**Huang Xuanzhong, Right Senior Minister of the Purple Tenuity of Mount Penglai’s Nanyang, prostrates and respectfully submits.**\n\nAll who uphold this sacred Dao must seek it without deviation, through purity, fasting, and tranquil contemplation. The furnace must be established and the stove arranged; one must not act contrary to the divine methods. Every movement and mechanism must align with the Dao of Heaven. The mineral and herbal ingredients must be of the finest quality, without error.\n\nAll herbs are tribute from the provinces, save three varieties native to this mountain. Six common mortal ingredients may be substituted, as listed below.\n\n**One Song of the Yellow Tooth Stone** (for crafting the Yellow Tooth elixir, five-character verse)\n**One Hundred Seventy-Two Herbal Songs** (describing the forms, names, harvesting seasons, and properties of 172 herbs, including their times of vitality and decay)\n**Total: 168 songs**\n\n---\n\n### **Crafting the Yellow Tooth, First Method**\n**Song:**\nLayer *ren* [water phase] in repeated folds,\nLead and yellow powder in successive weights.\nThe white and yellow of *you-niu* [rooster-metal] in three hues,\nBlend with the brine of the eastern tail.\nPlace *bing-ding* [fire phase] atop,\nTogether enter the red flames.\n\nFollow the song’s instructions, layering repeatedly until *ren* is exhausted. The process should align with the Summer Solstice. Grind with ice stone for best results. Use the eastern tail [direction], but avoid days of *jia-wu-geng* [wood, earth, metal] and fixed [inauspicious] dates.\n\n---\n\n### **Second Herb: Dewy Countenance Grass**\n**Common Name:** Earth Record\n**Textual Name:** Stone Record\nStem and flowers are red, nature toxic. Dislikes rough texture; grows on cliffs. Native to Henan. Vital in *jia-yi* [wood phase], perishes in *wu-ji* [earth phase]. Harvest on *jia-yin* day; leaves are round. Gather twenty days after the Spring Equinox. Primarily treats malignant sores. Aligns with the Spring Equinox.\n\n**Song:**\nThis herb is found among men,\nHenan yields the rarest kind.\nPluck and blend with mercury,\nOvernight it answers heaven’s truth.\n\n---\n\n### **Third Herb: Frosty Countenance Grass**\n**Common Name:** Heaven’s Edge\n**Textual Name:** White Microbe\nNature as above. Native to the southern roads of Ke. Vital in *jia-ren* [wood-water], perishes in *wu-gui* [earth-water]. Vines bear three flowers. Aligns with the Summer Solstice. Harvest after the Beginning of Spring.\n\n**Song:**\nFrom distant trees, climb the cliffs,\nThree flowers face the peaks.\nPluck and bury in *yi* [wood] earth,\nFollow the eastern tail’s method, then enter *gui-ren* [water phase].\n\n---\n\n### **Fourth Herb: Twin Husband Grass**\n**Common Name:** Hibiscus Vine\n**Textual Name:** Purple Jade\nNature as above. Treats consumptive illness. Native to Annan Prefecture.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1266,
      "start_sentence": 0,
      "end_sentence": 71,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.93959975242615,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "生丙丁，死甲己。 叶紫绿，大小不定，应小暑节，立夏后采用。 歌曰： 引蔓生天水，池中好开花傍石问。 度宵丙丁候，女体须坚。 石天第五 俗为纶草，书为武草。 性淡毒，生朔方，现形金，长色青。 生甲壬，死丁卯，治汞，又治肠风。 歌日： 遍地开尖叶，寻山展绿微。 用浆应夏至，采须鸿雁归。 石玄第六 俗为荼蔓，书为录支。 性温，坚汞，色绿，生戊己，死丁壬，治腹瘫，应小暑节，立秋后采用。 歌日： 蔓黑开青叶，还生野泽中。 从容安丙上，唯能巨壮功。 万年春第七 俗名水蓝，书为地镜。 性玲，生江南道。 如蓝，小青老赤。 生戊丁，死甲己。",
      "translated_text": "**Fourth Herb: Twin Husband Grass (continued)**\nNative to *bing-ding* [fire phase], perishes in *jia-ji* [wood-earth]. Leaves purple-green, varying in size. Aligns with the Lesser Heat solar term. Harvest after the Beginning of Summer.\n\n**Song:**\nVines climb toward heaven’s waters,\nBy the pond, flowers bloom near stone.\nWait for the *bing-ding* hour of night,\nThe Weaver Girl’s form must be firm.\n\n**Fifth Herb: Stone Heaven**\n**Common Name:** Fishing Line Grass\n**Textual Name:** Martial Grass\nMildly toxic. Native to the northern frontier. Manifests as metal, with a long, verdant hue. Native to *jia-ren* [wood-water], perishes in *ding-mao* [fire-rabbit]. Treats mercury poisoning and intestinal wind.\n\n**Song:**\nAcross the land, sharp leaves unfurl,\nSeek the mountains for their green glow.\nUse fermented mash at Summer Solstice,\nHarvest when the wild geese return.\n\n**Sixth Herb: Stone Mysterious**\n**Common Name:** Vine of Bitterness\n**Textual Name:** Recorded Branch\nWarm in nature. Hardens mercury. Green in color. Native to *wu-ji* [earth], perishes in *ding-ren* [fire-water]. Treats abdominal paralysis. Aligns with the Lesser Heat solar term. Harvest after the Beginning of Autumn.\n\n**Song:**\nBlack vines bear green leaves,\nBorn again in wild marshes.\nCalmly place upon *bing* [fire],\nOnly then will mighty strength arise.\n\n**Seventh Herb: Ten-Thousand-Year Spring**\n**Common Name:** Water Indigo\n**Textual Name:** Earth Mirror\nCool in nature. Native to the Jiangnan region. Resembles indigo—young leaves blue-green, aging to red. Native to *wu-ding* [earth-fire], perishes in *jia-ji* [wood-earth].",
      "overlap_context": " perishes in *wu-gui* [earth-water]. Vines bear three flowers. Aligns with the Summer Solstice. Harvest after the Beginning of Spring.\n\n**Song:**\nFrom distant trees, climb the cliffs,\nThree flowers face the peaks.\nPluck and bury in *yi* [wood] earth,\nFollow the eastern tail’s method, then enter *gui-ren* [water phase].\n\n---\n\n### **Fourth Herb: Twin Husband Grass**\n**Common Name:** Hibiscus Vine\n**Textual Name:** Purple Jade\nNature as above. Treats consumptive illness. Native to Annan Prefecture.",
      "start_char": 1266,
      "end_char": 1551,
      "start_sentence": 72,
      "end_sentence": 94,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.126063108444214,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "治小儿疳，应大寒节，春分后十日采用。 歌日： 青色尖赤样如蓝，亦在高山亦在潭。 先共还丹为舍宅，亦能性玲味能甘。 千秋锦第八 俗呼地幕，书为青乔。 性温，出剑南。 生甲乙，死戊己。 叶大如手面皱，治大风，应大暑节，立夏后采用。 歌曰： 面紧开敷远涧泉，大时尖绿小时圆。 唯有剑南生最好，真人呼作草丹田。 年年春第九 俗呼荫芝，书为青心。 性热，生岭南道。 生戊壬，死丁己。 叶紫，治白风。 应清明节，立秋后采之。 歌日： 叶紫枝青远水头，春风到日自芳幽。 可怜红展仙人爱，八般石药总拘留。 寒蝉叶第十 俗为美草，尽为温草。 出巴蓬州。 形如蝉叶，苗青赤不定。 生戊丁，萎甲戌。 治赤白带下，应雨水节，立秋后采之。 歌日： 叶如蝉翼带如绳，常在潭边映水澄。 恰到用时合三五，八铢金粉汁三升。 千灵第十一",
      "translated_text": "**Eighth Herb: Thousand-Autumn Brocade**\n**Common Name:** Earth Curtain\n**Textual Name:** Green Loft\nTreats infantile malnutrition. Aligns with the Greater Cold solar term. Harvest ten days after the Spring Equinox.\n\n**Song:**\nGreen in hue, pointed and red—like indigo in form,\nDwelling on lofty peaks or deep in pools.\nFirst paired with the Returned Elixir as its abode,\nCool in nature yet sweet in taste.\n\n**Ninth Herb: Everlasting Spring**\n**Common Name:** Shade Ganoderma\n**Textual Name:** Green Heart\nWarm in nature. Native to Jiannan. Native to *jia-yi* [wood], perishes in *wu-ji* [earth]. Leaves large as a hand’s palm, wrinkled. Treats severe wind disorders. Aligns with the Greater Heat solar term. Harvest after the Beginning of Summer.\n\n**Song:**\nWrinkled leaves unfurl by distant mountain springs,\nLarge and pointed green, small and round.\nOnly in Jiannan does it grow finest—\nThe Perfected call it the Herb of the Cinnabar Field.\n\n**Tenth Herb: Cold Cicada Leaf**\n**Common Name:** Beauty Grass\n**Textual Name:** Warm Grass\nNative to Bazhou and Pengzhou. Resembles a cicada’s wing—shoots blue-green or red, varying. Native to *wu-ding* [earth-fire], withers in *jia-xu* [wood-earth]. Treats red and white vaginal discharge. Aligns with the Rain Water solar term. Harvest after the Beginning of Autumn.\n\n**Song:**\nLeaves like cicada wings, stems like cords,\nEver by the pool’s edge, mirrored in clear water.\nWhen the time is right, gather three or five—\nEight *zhu* of golden powder, three *sheng* of sap.\n\n**Eleventh Herb: Thousand Spirits**\n*(Text continues)*",
      "overlap_context": "is. Aligns with the Lesser Heat solar term. Harvest after the Beginning of Autumn.\n\n**Song:**\nBlack vines bear green leaves,\nBorn again in wild marshes.\nCalmly place upon *bing* [fire],\nOnly then will mighty strength arise.\n\n**Seventh Herb: Ten-Thousand-Year Spring**\n**Common Name:** Water Indigo\n**Textual Name:** Earth Mirror\nCool in nature. Native to the Jiangnan region. Resembles indigo—young leaves blue-green, aging to red. Native to *wu-ding* [earth-fire], perishes in *jia-ji* [wood-earth].",
      "start_char": 1551,
      "end_char": 1929,
      "start_sentence": 95,
      "end_sentence": 125,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.129282236099243,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "俗为水蒿，书为白章支。 性玲。 出蕃中。 形如蒿，数叶，色青。 生丙戊，死甲壬。 治恶疮及酒症。 应惊蛰节，立冬后采之。 歌曰： 丛丛吐叶达泽生，夏时花发近春青。 红灶更添将内煮，一旬药内此多灵。 赤马州第十二 俗为地容，书为紫盖。 性毒。 出北济。 茎叶紫。 生甲壬，死丁己。 疗呕逆。 应春分节，春分后采之上。 歌日： 枝红叶紫透山崖，此药真人暗以排。 恰到炉中开龙后，始知我有玉灵才。 万日荣第十三 俗呼胡波菱，书为美菜。 性善。 生河北。 叶青花紫。 生甲己，死丁壬。 治恶疮。 应夏至节，白露后采用。 歌曰：",
      "translated_text": "**Twelfth Herb: Red Horse State**\n**Common Name:** Earth Receptacle\n**Textual Name:** Purple Canopy\nNature: Toxic\nNative to Beiji. Stems and leaves purple. Grows in *jia-ren* [wood-water], withers in *ding-ji* [fire-earth]. Treats retching and hiccups. Aligns with the Spring Equinox solar term. Harvest after the Spring Equinox.\n\n**Song:**\nBranches red, leaves purple cling to cliffs,\nThis herb the Perfected secretly array.\nJust when the furnace’s dragon unfurls,\nThen you’ll know my jade-like numinous power.\n\n**Thirteenth Herb: Ten Thousand Sunlit Blossoms**\n**Common Name:** Hu Wave Water Chestnut\n**Textual Name:** Beauty Vegetable\nNature: Benign\nNative to Hebei. Leaves green, flowers purple. Grows in *jia-ji* [wood-earth], withers in *ding-ren* [fire-water]. Treats malignant sores. Aligns with the Summer Solstice solar term. Harvest after the White Dew.\n\n**Song:**\nCluster on cluster, leaves thrust forth from marshland’s birth,\nSummer blooms near spring’s verdant verge.\nAdd to the red kiln and simmer within—\nIn ten days’ decoction, this herb most potent proves.",
      "overlap_context": "bles a cicada’s wing—shoots blue-green or red, varying. Native to *wu-ding* [earth-fire], withers in *jia-xu* [wood-earth]. Treats red and white vaginal discharge. Aligns with the Rain Water solar term. Harvest after the Beginning of Autumn.\n\n**Song:**\nLeaves like cicada wings, stems like cords,\nEver by the pool’s edge, mirrored in clear water.\nWhen the time is right, gather three or five—\nEight *zhu* of golden powder, three *sheng* of sap.\n\n**Eleventh Herb: Thousand Spirits**\n*(Text continues)*",
      "start_char": 1929,
      "end_char": 2195,
      "start_sentence": 126,
      "end_sentence": 155,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.045745134353638,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "菱头片片剪刀裁，每岁真人自送来。 欲得紫房无紫艳，拈来共煮石中胎。 寒泉镜第十四 俗为大叶萍，书为池容。 性凉。 出云南。 叶圆，浮水上。 生丙，丁，死甲乙。 治恶疮。 应小满节，立夏后采上。 歌日： 浮生池中叶青青，碧牙药内最多灵。 从此水银加日影，黄金争得不闻名。 洞章支第十五 俗为周支，书为卢容。 性热。 出罗州。 叶绿枝白酸。 生甲丁，死戊己。 治毒风。 应小满节，立夏后采用。 歌日： 叶青茎酿生乎坟，有茨开花似覆盆。 还丹不得池中过，仙人争得万年魂。 公无取第十六 俗为石藤，书为润春。 出长安南山上。 叶如豆，引蔓紫。 生丁己，萎戊壬。 治恶疮。 应大寒节，白露后采上。 歌曰： 丛丛紫影出长安，生在春初色耐寒。 薄阙采时防大雨，摘时仍虑万妖看。 天镜寒第十七 俗呼石扇，书云背青。 出河南道。 每一枝一叶。",
      "translated_text": "**Song:**\nPetals of the water chestnut, snipped as if by scissors’ blade,\nEach year the Perfected Ones themselves bestow this aid.\nShould you seek its purple chambers free of purple hue,\nPluck and boil it with the womb-stone’s embryo true.\n\n**Fourteenth Herb: Cold Spring Mirror**\n**Common Name:** Large-Leaf Duckweed\n**Textual Name:** Pool’s Countenance\nNature: Cool\nNative to Yunnan. Leaves round, floating upon the water. Grows in *bing-ding* [fire-fire], withers in *jia-yi* [wood-wood]. Treats malignant sores. Aligns with the Grain Full solar term. Harvest after the Summer Begins.\n\n**Song:**\nFloating life on ponds—leaves verdant, bright,\nIn sapphire-toothed elixirs, most numinous in might.\nHenceforth with mercury beneath the sun’s gaze,\nEven gold shall strive in vain for fame’s praise.\n\n**Fifteenth Herb: Cavern Stalks**\n**Common Name:** Zhou Zhi\n**Textual Name:** Lu’s Countenance\nNature: Hot\nNative to Luozhou. Leaves green, branches white and sour. Grows in *jia-ding* [wood-fire], withers in *wu-ji* [earth-earth]. Treats poisonous winds. Aligns with the Grain Full solar term. Harvest after the Summer Begins.\n\n**Song:**\nLeaves green, stems tart, sprouting from the mound,\nThorned blooms like upturned bowls abound.\nIf the Returned Cinnabar bypasses the pool’s embrace,\nHow shall immortals vie for a ten-thousand-year grace?\n\n**Sixteenth Herb: Duke Without Seizure**\n**Common Name:** Stone Vine\n**Textual Name:** Moistening Spring\nNative to the Southern Mountains of Chang’an. Leaves like beans, vines trailing purple. Grows in *ding-ji* [fire-earth], wilts in *wu-ren* [earth-water]. Treats malignant sores. Aligns with the Great Cold solar term. Harvest after the White Dew.\n\n**Song:**\nCluster on cluster, purple shadows rise from Chang’an’s plain,\nBorn at spring’s first breath, its hue defies the cold’s domain.\nWhen plucking at the crumbling cliffs, beware the torrents’ reign,\nAnd guard against the myriad spirits’ watchful gaze and feign.\n\n**Seventeenth Herb: Heaven’s Mirror Cold**\n**Common Name:** Stone Fan\n**Textual Name:** Green-Backed\nNative to the Henan Circuit. Each stem bears but a single leaf.",
      "overlap_context": "e:** Hu Wave Water Chestnut\n**Textual Name:** Beauty Vegetable\nNature: Benign\nNative to Hebei. Leaves green, flowers purple. Grows in *jia-ji* [wood-earth], withers in *ding-ren* [fire-water]. Treats malignant sores. Aligns with the Summer Solstice solar term. Harvest after the White Dew.\n\n**Song:**\nCluster on cluster, leaves thrust forth from marshland’s birth,\nSummer blooms near spring’s verdant verge.\nAdd to the red kiln and simmer within—\nIn ten days’ decoction, this herb most potent proves.",
      "start_char": 2195,
      "end_char": 2576,
      "start_sentence": 156,
      "end_sentence": 193,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.549602746963501,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "生戊壬，死甲己。 治冷。 应立夏节，原缺后采上。 歌曰： 叶如统扇达崖生，每树还生一个茎。 丘墓死泉无用效，绝人断犬始为灵。 逍逍引第十八 俗呼紫贝藤，书为崖艾。 性冷。 出三元县。 叶锐。 应白露节，冬至后采上。 歌曰： 抽枝引蔓发金兰，但是真人手把看。 欲度紫微天上阙，可怜光彩入仙坛。 尸解红第十九 俗呼石被，书云地纹。 性温。 出扬州。 形如水萍，枝茎细。 生乙癸，死酉戌。 治一切五藏反恶。 应小寒节，立夏后采上。 歌日： 绿崖近石剪成形，紫阁蓬莱有两名。 独体丹阳兼汞煮，后兹火下绝铜声。 仙节芝第二十 俗呼石赛，书云九积。 性凉。 出河南。 形尖细，拥节。 生戊丁，死乙癸。 治热闷脚气。 应秋分节，立冬后采用。 歌日：",
      "translated_text": "**Seventeenth Herb: Heaven’s Mirror Cold**\n**Common Name:** Stone Fan\n**Textual Name:** Green-Backed\nNative to the Henan Circuit. Each stem bears but a single leaf. Grows in *wu-ren* [earth-water], wilts in *jia-ji* [wood-earth]. Treats cold. Aligns with the Beginning of Summer solar term. Harvest after the original text’s omission.\n\n**Song:**\nLeaves like woven fans cling to cliffs’ sheer face,\nEach tree bears but one stem in its embrace.\nFrom graves and dead springs, all effect is vain,\nSever man from dog—then its power shall reign.\n\n**Eighteenth Herb: Free-Flowing Trails**\n**Common Name:** Purple Cowrie Vine\n**Textual Name:** Cliff Mugwort\nCold in nature. Native to Sanyuan County. Leaves pointed. Aligns with the White Dew solar term. Harvest after the Winter Solstice.\n\n**Song:**\nBranches trail, vines unfurl like golden orchids bright,\nOnly true immortals’ hands may pluck its sacred light.\nTo ascend the Purple Tenuity’s celestial gate,\nHow wondrous its radiance upon the Daoist altar’s state.\n\n**Nineteenth Herb: Corpse-Release Red**\n**Common Name:** Stone Quilt\n**Textual Name:** Earth Veins\nWarm in nature. Native to Yangzhou. Resembles duckweed, stems slender. Grows in *yi-gui* [wood-water], wilts in *you-xu* [metal-dog]. Treats all visceral counterflow and malignities. Aligns with the Lesser Cold solar term. Harvest after the Beginning of Summer.\n\n**Song:**\nGreen cliffs near stone, its form like shears refined,\nPurple Tower and Penglai share its name enshrined.\nAlone with cinnabar and mercury it’s wrought,\nBeneath the flame, copper’s ring is forever naught.\n\n**Twentieth Herb: Immortal’s Node Ganoderma**\n**Common Name:** Stone Contest\n**Textual Name:** Nine Accumulations\nCool in nature. Native to Henan. Shape pointed and fine, nodes clustered. Grows in *wu-ding* [earth-fire], wilts in *yi-gui* [wood-water]. Treats heat oppression and leg qi. Aligns with the Autumn Equinox. Harvest after the Beginning of Winter.\n\n**Song:**",
      "overlap_context": "igns with the Great Cold solar term. Harvest after the White Dew.\n\n**Song:**\nCluster on cluster, purple shadows rise from Chang’an’s plain,\nBorn at spring’s first breath, its hue defies the cold’s domain.\nWhen plucking at the crumbling cliffs, beware the torrents’ reign,\nAnd guard against the myriad spirits’ watchful gaze and feign.\n\n**Seventeenth Herb: Heaven’s Mirror Cold**\n**Common Name:** Stone Fan\n**Textual Name:** Green-Backed\nNative to the Henan Circuit. Each stem bears but a single leaf.",
      "start_char": 2576,
      "end_char": 2912,
      "start_sentence": 194,
      "end_sentence": 228,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.240563869476318,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "天上全无人世有，人问不识自凋零。 今朝自开好金诀，从此君王记取名。 遍金台第二十－ 俗呼马苋，书为绿微。 性冷。 出河阳府。 叶锐圆酦。 生甲丁，死壬己。 治疮及恶疖，应寒露节，立冬后采用。 歌日．. ! 同罗新妇未仙时，折得金台数百枝。 经得三周周甲子，三年身驾庆云飞。 轻金微第二十二 俗为石支，书呼上远。 出乐阳。 治通耳。 歌日： 寒叶丛丛绕路逵，天上为珍世上稀。 拈向白英锅内煮，始知此药最多奇。 高天芝第二十三 俗为京人丹，书为天莫。 出洛州。 治中风。",
      "translated_text": "**Song:**\nIn heaven’s realm it wholly lacks, yet earthly bounds possess its grace,\nUnrecognized by mortal kind, it withers in its native place.\nThis day unfolds its golden lore,\nThat monarchs hence may know its name evermore.\n\n**Twenty-First Herb: Gilded Terrace Ganoderma**\n**Common Name:** Horse Purslane\n**Textual Name:** Green Essence\nCold in nature. Native to Heyang Prefecture. Leaves sharp and round, slightly fermented. Grows in *jia-ding* [wood-fire], wilts in *ren-ji* [water-earth]. Treats sores and malign boils. Aligns with the Cold Dew solar term. Harvest after the Beginning of Winter.\n\n**Song:**\nWhen the Net-Spinner’s Bride had yet to ascend,\nShe plucked this Gilded Terrace by the hundred.\nThrough three cycles of sixty years she passed,\nThen soared aloft on clouds of jubilation.\n\n**Twenty-Second Herb: Light Gold Essence**\n**Common Name:** Stone Branch\n**Textual Name:** Supreme Distance\nNative to Leyang. Treats deafness.\n\n**Song:**\nCold leaves cluster thick along the winding way,\nA treasure in the heavens, rare on mortal clay.\nPlucked and boiled in a pot with White Nightshade,\nThen shall its wondrous power be displayed.\n\n**Twenty-Third Herb: Celestial Ganoderma**\n**Common Name:** Capital’s Elixir\n**Textual Name:** Heaven’s Void\nNative to Luozhou. Treats windstroke.",
      "overlap_context": "nglai share its name enshrined.\nAlone with cinnabar and mercury it’s wrought,\nBeneath the flame, copper’s ring is forever naught.\n\n**Twentieth Herb: Immortal’s Node Ganoderma**\n**Common Name:** Stone Contest\n**Textual Name:** Nine Accumulations\nCool in nature. Native to Henan. Shape pointed and fine, nodes clustered. Grows in *wu-ding* [earth-fire], wilts in *yi-gui* [wood-water]. Treats heat oppression and leg qi. Aligns with the Autumn Equinox. Harvest after the Beginning of Winter.\n\n**Song:**",
      "start_char": 2912,
      "end_char": 3165,
      "start_sentence": 229,
      "end_sentence": 251,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.496736764907837,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "歌曰： 红珠为子树青青，紫苑仙人别作名 还共丹阳为白色，绿微始肯入玄冥。 专瑶池第二十四 俗呼玉池柳，书云英芝。 出江州。 茎青白，叶尖细。 治牙疼风疳。 歌日： 山庭玉柳本来无，更说人问是已疏。 堪用采时须少与，药院仙囊莫遣余。 万成荷第二十五 欲呼山甘菊，书云苹夫。 样似甘菊。 治鬼气。 歌曰： 先生白日上升天，还因此药每宵煎。 及至采时须便用，不须将过五湖船。 伺巨舟第二十六 俗为石桑，书为景芝。 出蛮中。 叶如桑成树。 治一切风。 歌日：",
      "translated_text": "**Song:**\nCrimson pearls its seeds, the tree so green,\nPurple Terrace’s Immortal gives it name anew.\nYet with Cinnabar Yang it turns to white,\nOnly then does Green Essence dare the Dark Abyss pursue.\n\n**Twenty-Fourth Herb: Jade Pool**\n**Common Name:** Jade Pool Willow\n**Textual Name:** Radiant Ganoderma\nNative to Jiangzhou. Stem pale green, leaves slender and fine. Treats toothache, wind-sores, and gan.\n\n**Song:**\nIn mountain courts no Jade Willow grew,\nYet mortals err in calling it so.\nWhen gathering, take but little—heed this rule,\nLest the immortal’s pouch or pharmacy overflow.\n\n**Twenty-Fifth Herb: Ten-Thousand Perfections Lotus**\n**Common Name:** Mountain Sweet Chrysanthemum\n**Textual Name:** Water’s Husband\nResembles sweet chrysanthemum. Treats ghostly qi.\n\n**Song:**",
      "overlap_context": "tion.\n\n**Twenty-Second Herb: Light Gold Essence**\n**Common Name:** Stone Branch\n**Textual Name:** Supreme Distance\nNative to Leyang. Treats deafness.\n\n**Song:**\nCold leaves cluster thick along the winding way,\nA treasure in the heavens, rare on mortal clay.\nPlucked and boiled in a pot with White Nightshade,\nThen shall its wondrous power be displayed.\n\n**Twenty-Third Herb: Celestial Ganoderma**\n**Common Name:** Capital’s Elixir\n**Textual Name:** Heaven’s Void\nNative to Luozhou. Treats windstroke.",
      "start_char": 3166,
      "end_char": 3416,
      "start_sentence": 252,
      "end_sentence": 275,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 5.844528436660767,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "彤彤山艳怯高坡，因此承阳出处多。 将得便须随用却，莫令天使渡江河。 天上玄第二十七 俗为石甘，书为地甘。 出忠万州。 叶绿，生石上。 治反胃病。 歌日： 石中有火火藏阴，阳气潜生效比金。 采日用须防犬吠，犬吠采之用不任。 石天琴第二十八 一俗呼石可，书云还芝。 叶三色。 治一切风。 歌日： 京州皇郡人人病，病者还因地气冲。 添放还丹经宿煮，从兹百岁绝无风。 毛章第二十九 俗为大成，书云林芝。 性冷。 出河南道。 形如萋菊。 治风疸。 歌日： 此朴雕成花拥节，毳毛笼里子分枝。 可怜此物人问有，惆怅人问识是谁。 右已前八味，生甲壬，死乙癸，应冬至节，立春后探用。 成万岁第三十 俗为五灵芝，书无名。",
      "translated_text": "**Song:**\nVermilion peaks, their beauty shuns the lofty slope,\nYet where Yang’s favor lingers, here it thrives in droves.\nGathered, it must be used at once—heed well this law,\nLest Heaven’s messenger ferry it across the rivers’ flow.\n\n**Twenty-Seventh Herb: Celestial Mystery**\n**Common Name:** Stone Sweet\n**Textual Name:** Earth’s Sweet\nNative to Zhongwanzhou. Leaves green, growing upon stone. Treats regurgitation.\n\n**Song:**\nWithin the stone lies fire, fire conceals the Yin,\nYang’s qi latent rises—efficacy like gold.\nWhen gathering by day, beware the barking hound,\nFor if the dog should bark, its use will not take hold.\n\n**Twenty-Eighth Herb: Stone Heavenly Zither**\n**Common Name:** Stone Permitted\n**Textual Name:** Returning Ganoderma\nLeaves of three colors. Treats all wind disorders.\n\n**Song:**\nIn Jingzhou’s imperial prefecture, all men ail,\nTheir sickness borne of earth’s surging qi.\nAdd and release the Returning Elixir, simmered overnight,\nFrom hence a century free of wind’s decree.\n\n**Twenty-Ninth Herb: Furry Camphor**\n**Common Name:** Great Perfection\n**Textual Name:** Forest Ganoderma\nCold in nature. Native to Henan Circuit. Resembles purple chrysanthemum. Treats wind-jaundice.\n\n**Song:**\nThis uncarved block, when carved, blooms with flowered nodes,\nWithin its downy fur, seeds branch and spread.\nPity this thing—though found among men,\nWho among men knows its name, filled with dread?\n\nThe preceding eight herbs: born in *jia-ren*, die in *yi-gui*, aligned with the Winter Solstice. Gather after the Beginning of Spring.\n\n**Thirtieth Herb: Ten-Thousand-Year Perfection**\n**Common Name:** Five-Spirit Ganoderma\n**Textual Name:** None recorded.",
      "overlap_context": ":** Radiant Ganoderma\nNative to Jiangzhou. Stem pale green, leaves slender and fine. Treats toothache, wind-sores, and gan.\n\n**Song:**\nIn mountain courts no Jade Willow grew,\nYet mortals err in calling it so.\nWhen gathering, take but little—heed this rule,\nLest the immortal’s pouch or pharmacy overflow.\n\n**Twenty-Fifth Herb: Ten-Thousand Perfections Lotus**\n**Common Name:** Mountain Sweet Chrysanthemum\n**Textual Name:** Water’s Husband\nResembles sweet chrysanthemum. Treats ghostly qi.\n\n**Song:**",
      "start_char": 3416,
      "end_char": 3747,
      "start_sentence": 276,
      "end_sentence": 304,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.555550336837769,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "叶紫，性冷。 治鬼气心邪。 歌曰： 摇扬锦蔓出长安，对雪开花入上阑。 不要春荣潜茂实，大罗天女镇长餐。 粟金寒第三十一 俗呼皱面，书为武芝。 性温。 出恒州，叶大如手面皱，治风癣。 歌曰： 叶叶铺沙遍地生，仙人多种绕仙庭。 但知戊己庚辛日，采之何得不通灵。 胡菊花第三十二 俗呼杨柳池，书为阑心草。 性温。 叶如柳引蔓。 治女人血气。 歌日： 绿金散翠引金条，绿叶零丁绕碧霄。 三月春时和蔓采，可怜汞在火中烧。 右已前三味，生戊己丁，死甲乙。 应大寒节，立冬后探上。 天尖金第三十三",
      "translated_text": "**Thirty-First Herb: Purple Leaf**\n**Common Name:** None recorded.\n**Textual Name:** None recorded.\nCold in nature. Treats demonic qi and heartway aberrations.\n\n**Song:**\nSwaying brocade vines rise from Chang’an,\nFacing snow, they bloom beyond the upper balustrade.\nNo need for spring’s glory—hidden, they bear fruit in secret,\nThe Heavenly Maidens of Great Luo feast upon them always.\n\n**Thirty-Second Herb: Gold-Grain Cold**\n**Common Name:** Wrinkled Face\n**Textual Name:** Martial Ganoderma\nWarm in nature. Native to Hengzhou. Leaves large as a hand’s span, wrinkled. Treats wind-lichen.\n\n**Song:**\nLeaf upon leaf spreads across the sand, growing everywhere,\nImmortal beings plant them around their immortal courts.\nKnow only the days of *wu-ji*, *geng-xin*—\nGather then, how could one fail to attain numinous communion?\n\n**Thirty-Third Herb: Barbarian Chrysanthemum**\n**Common Name:** Willow Pond\n**Textual Name:** Heart-Barrier Grass\nWarm in nature. Leaves like willow, trailing vines. Treats women’s blood and qi.\n\n**Song:**\nGreen gold scatters emerald, trailing golden tendrils,\nVerdant leaves drift lonely, circling the azure heavens.\nGather with the vines in the third month of spring—\nPity the mercury burning within the fire.\n\nThe preceding three herbs: born in *wu-ji-ding*, die in *jia-yi*. Aligned with the Great Cold, gather after the Beginning of Winter.\n\n**Thirty-Fourth Herb: Heaven-Pointed Gold**",
      "overlap_context": "ysanthemum. Treats wind-jaundice.\n\n**Song:**\nThis uncarved block, when carved, blooms with flowered nodes,\nWithin its downy fur, seeds branch and spread.\nPity this thing—though found among men,\nWho among men knows its name, filled with dread?\n\nThe preceding eight herbs: born in *jia-ren*, die in *yi-gui*, aligned with the Winter Solstice. Gather after the Beginning of Spring.\n\n**Thirtieth Herb: Ten-Thousand-Year Perfection**\n**Common Name:** Five-Spirit Ganoderma\n**Textual Name:** None recorded.",
      "start_char": 3747,
      "end_char": 4012,
      "start_sentence": 305,
      "end_sentence": 327,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.904369115829468,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "俗为胡署蔓，书为美容。 性热，有毒。 治虫蛇毒。 出美元县，样如署预。 歌曰： 厚叶青金爱在溪，可怜仙药俗人迷。 欲得飞升天上去，只将此药是云梯。 玉展春第三十四 俗为山斛，书为江春。 性温。 出于阗国。 三叶，叶如榆。 治风。 歌曰： 每树生三叶，遥光叶似榆。 冬分春节近，仙人把步虚。 荆豆蔓第三十五 俗为真芝，书无名。 性温。 出剑南。 三叶，叶如豆。 治血风。 歌日： 每叶生仙意，含虚得大音。 三旬金柜里，不用未投深。 夜合木第三十六 俗为还心，书为松南。 出商州。 成树叶小，夜即合。 治心狂。 歌曰： 美树低新叶，晨开暮掩枝。 可怜天上木，堪载俗人飞。 紫方天第三十七 俗为杨叶芥，书无名。 性热。 出青州。 叶如杨长数寸，有津液。 治一切风邪。 歌日： 小叶傍山开，真人手自栽。 从兹辨真药，目下往天台。 王□第三十八 俗为青风，书无名。 有毒。 一丛数叶。 出养美茂。 治经脉并痔。 歌日： 地开玉叶展枝丛，独自抽茎占碧空。 石药数般能压伏，唯共阴神最得功。 红蓬第三十九 俗呼石剑，书无名。 性热。 出甘州。 一丛数刃。 治一切风。 歌曰： 锦石苔生云雨处，红蓬能展剑锋形。 消汤煮玉无过此，因得仙人别作名。 胡辛蔓第四十 俗名三叶草，书名深真。 有毒。 出江州。 叶三尖。 治虫毒。 歌日： 枝条条叶叶如刀，近夏当秋蔓始高。 恰到第三三转后，始将方就火中烧。 紫仙芝第四十一 俗呼天池，书无名。 性热。 叶如枇杷叶。",
      "translated_text": "**Thirty-Fifth Herb: Barbarian Yam Vine**\n**Common Name:** Hu Shu Vine\n**Textual Name:** Beauty’s Grace\nHot in nature, toxic. Treats insect and snake poisons. Found in Meiyuan County, resembling *shu yu* (yam).\n\n**Song:**\nThick leaves of blue-green gold, thriving by the stream—\nPity the immortal herb that mortals fail to see.\nIf you would ascend to heaven on high,\nTake only this as your cloud-ladder.\n\n**Thirty-Sixth Herb: Jade Unfolds Spring**\n**Common Name:** Mountain Dendrobium\n**Textual Name:** River Spring\nWarm in nature. Native to Khotan. Three leaves, resembling elm.\n\n**Song:**\nEach tree bears three leaves, their distant glow like elm,\nAs winter divides and spring’s season draws near.\nThe immortal plucks it, pacing the void.\n\n**Thirty-Seventh Herb: Thorny Bean Vine**\n**Common Name:** True Zhi\n**Textual Name:** [None]\nWarm in nature. Found in Jiannan. Three leaves, resembling beans. Treats blood-wind.\n\n**Song:**\nEach leaf bears immortal intent, embracing emptiness to gain the great tone.\nThirty days within the golden casket—\nNo need to cast it into the depths.\n\n**Thirty-Eighth Herb: Night-Closed Tree**\n**Common Name:** Returning Heart\n**Textual Name:** Pine South\nNative to Shangzhou. Grows as a tree with small leaves that close at night. Treats heart-madness.\n\n**Song:**\nLovely tree with tender leaves, branches open at dawn, close at dusk.\nPity the tree of heaven—\nFit to bear mortals in flight.\n\n**Thirty-Ninth Herb: Purple Square Heaven**\n**Common Name:** Willow-Leaf Mustard\n**Textual Name:** [None]\nHot in nature. Found in Qingzhou. Leaves like willow, several inches long, exuding sap. Treats all wind-evil.\n\n**Song:**\nSmall leaves bloom beside the mountain, planted by the immortal’s own hand.\nFrom this, discern the true herb—\nBefore your eyes, journey to Mount Tiantai.\n\n**Fortieth Herb: King [Illegible]**\n**Common Name:** Green Wind\n**Textual Name:** [None]\nToxic. A cluster of several leaves. Found in Yangmeimao. Treats meridians and hemorrhoids.\n\n**Song:**\nEarth parts to reveal jade leaves, branches rising alone to claim the azure sky.\nThough many stone medicines may subdue,\nNone match the yin spirit in its power.\n\n**Forty-First Herb: Red Lotus**\n**Common Name:** Stone Sword\n**Textual Name:** [None]\nHot in nature. Found in Ganzhou. A cluster of several blades. Treats all wind.\n\n**Song:**\nBrocade stone moss grows where clouds and rain gather,\nThe red lotus unfurls like a sword’s edge.\nNo decoction boils jade so well as this—\nThus did the immortal bestow its name.\n\n**Forty-Second Herb: Barbarian Xin Vine**\n**Common Name:** Three-Leaf Grass\n**Textual Name:** Profound Truth\nToxic. Found in Jiangzhou. Leaves with three points. Treats insect poison.\n\n**Song:**\nBranches and twigs, leaves sharp as blades,\nNear summer, as autumn nears, the vine begins to climb.\nOnly after the third turning of the third month\nIs the formula complete—then fire it in the flame.\n\n**Forty-Third Herb: Purple Immortal Zhi**\n**Common Name:** Heavenly Pool\n**Textual Name:** [None]\nHot in nature. Leaves resembling loquat.",
      "overlap_context": ":** Heart-Barrier Grass\nWarm in nature. Leaves like willow, trailing vines. Treats women’s blood and qi.\n\n**Song:**\nGreen gold scatters emerald, trailing golden tendrils,\nVerdant leaves drift lonely, circling the azure heavens.\nGather with the vines in the third month of spring—\nPity the mercury burning within the fire.\n\nThe preceding three herbs: born in *wu-ji-ding*, die in *jia-yi*. Aligned with the Great Cold, gather after the Beginning of Winter.\n\n**Thirty-Fourth Herb: Heaven-Pointed Gold**",
      "start_char": 4012,
      "end_char": 4681,
      "start_sentence": 328,
      "end_sentence": 400,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.507025718688965,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "治心痛。 歌日： 摇摇仙果长山溪，堪作蓬莱方丈梯。 每在人问人不识，桃源因此去人迷。 石豆蔓第四十二 俗为留君，书云单章。 性冷毒。 叶尖，引蔓茎，紫青。 治虫毒。 歌日： 黑玉为茎金作芳，抽条引蔓散岩岗。 秦南少女当时用，抽汞无烟在火铛。 山石蔓第四十三 俗呼真鱼，书无名。 性温。 出文代州。 叶三尖，如大豆。 治逆疮。 歌日： 玉铺金器写人问，苗在蓬宫果在田。 应是五心须似雪，况当诸物拟昏烟。 玉粟草第四十四 俗为行针，书无名。 出河南。 性冷。 如还藤，有子如糜。 治风热。 歌日： 调金铺玉颗如珠，天上人问样有殊。 天上生时生紫翠，人问有者绿疏疏。 层金第四十五 俗呼小署药，书无名。 性温。 出辰锦州。 叶如署药，有根。 治水病。 歌日： 埋根金柜展蓬头，造化真人昔日留。 五转转开须好记，煮将为水五金柔。 地苏也。 石蕨第四十六 俗为失蒙，书云留金。 性热。 出楚地。 枝次数叶。 治风冷。 歌日：",
      "translated_text": "**Forty-First Herb: Purple Immortal Zhi**\n**Treats:** Heart pain.\n\n**Song:**\nThe swaying immortal fruit grows by mountain streams,\nFit to serve as a ladder to Penglai’s square acre.\nOften among men, yet men know it not—\nThus did Peach Source’s path become lost to them.\n\n**Forty-Second Herb: Stone Bean Vine**\n**Common Name:** Stay-with-Me\n**Textual Name:** Single Chapter\nCold and toxic in nature. Leaves pointed, with trailing vines and stems of purple-green.\n**Treats:** Insect poison.\n\n**Song:**\nBlack jade for stems, gold for its fragrance,\nIt stretches its vines across rocky slopes.\nThe maiden of southern Qin once used it—\nTo refine mercury smokeless in the crucible’s flame.\n\n**Forty-Third Herb: Mountain Stone Vine**\n**Common Name:** True Fish\n**Textual Name:** [None]\nWarm in nature. Found in Wenzhou. Leaves with three points, resembling large beans.\n**Treats:** Inverted sores.\n\n**Song:**\nJade spread on golden vessels, inscribed among men,\nIts sprouts in Peng Palace, its fruit in the fields.\nIt must be that the five centers are like snow—\nHow could all other things compare to its dusky mist?\n\n**Forty-Fourth Herb: Jade Millet Grass**\n**Common Name:** Traveling Needle\n**Textual Name:** [None]\nFound in Henan. Cold in nature. Resembles *huan* vine, with seeds like broomcorn millet.\n**Treats:** Wind-heat.\n\n**Song:**\nGold and jade arrayed in pearl-like grains,\nHeaven and earth each bear their distinct forms.\nWhen it grows in heaven, it is purple-green;\nWhen found among men, it is sparse and green.\n\n**Forty-Fifth Herb: Layered Gold**\n**Common Name:** Small Yam Medicine\n**Textual Name:** [None]\nWarm in nature. Found in Chen Jinzhou. Leaves resemble yam, with roots.\n**Treats:** Water diseases.\n\n**Song:**\nBury its root in a golden casket, unfurl its lotus head,\nThe True Man of Creation left it behind long ago.\nRemember well the five turnings when they unfold—\nBoil it to water, and the five metals will soften.\n*(Also called* Earth Su.)\n\n**Forty-Sixth Herb: Stone Fern**\n**Common Name:** Lost Darkness\n**Textual Name:** Lingering Gold\nHot in nature. Found in Chu lands. Branches with numerous leaves.\n**Treats:** Wind-cold.\n\n**Song:**",
      "overlap_context": "n Vine**\n**Common Name:** Three-Leaf Grass\n**Textual Name:** Profound Truth\nToxic. Found in Jiangzhou. Leaves with three points. Treats insect poison.\n\n**Song:**\nBranches and twigs, leaves sharp as blades,\nNear summer, as autumn nears, the vine begins to climb.\nOnly after the third turning of the third month\nIs the formula complete—then fire it in the flame.\n\n**Forty-Third Herb: Purple Immortal Zhi**\n**Common Name:** Heavenly Pool\n**Textual Name:** [None]\nHot in nature. Leaves resembling loquat.",
      "start_char": 4681,
      "end_char": 5121,
      "start_sentence": 401,
      "end_sentence": 447,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.997282028198242,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "铜瓶内里布丹霜，霜似烟笼未有光。 忽更添消重固际，可怜颜色过於璋。 荆第四十七 俗呼仅木花，书无名。 性温，出山南道。 蔓四棱，叶尖。 治血气。 歌曰： 丛开尖叶四棱茎，光占春分满野生。 后辈习真皆用此，即知从此得长生。 重台蔓第四十八 俗为人眷，书云渠迫。 性热。 出江南道。 小小叶生，大叶引蔓。 治一切疮。 歌日： 隆隆真气上升天，恰至春分降野田。 若遇青盐相拌合，即知生驾出人问。 还骨草第四十九 俗呼鼠英蒿，书云单蒿。 性热。 生剑州。 一如蒿茎，紫叶。 破治风疮。 歌曰： □□埋处是千还，轮转存亡上碧山。 但能识此锅中煮，火罢金身出世问。 稍紫第五十 俗呼紫贝，书无名。 治瘫。 歌曰：",
      "translated_text": "**Forty-Seventh Herb: Jingyu**\n**Common Name:** Jinmu Flower\n**Textual Name:** [None]\nWarm in nature. Found in Shannan Circuit. Vines with four ridges, pointed leaves.\n**Treats:** Blood and qi disorders.\n\n**Song:**\nClustered with pointed leaves and four-ridged stems,\nIts light claims the vernal equinox, thriving wild across the fields.\nLater generations studying the Dao all use this—\nKnow then that from this comes longevity.\n\n**Forty-Eighth Herb: Layered Vine**\n**Common Name:** Human Affection\n**Textual Name:** Quji\nHot in nature. Found in Jiangnan Circuit. Small leaves grow first, then large leaves extend along the vine.\n**Treats:** All sores.\n\n**Song:**\nThe swelling True Qi ascends to heaven,\nJust at the vernal equinox, it descends to the wild fields.\nIf met with green salt and blended together,\nKnow then that the living carriage emerges among men.\n\n**Forty-Ninth Herb: Returning-Bone Herb**\n**Common Name:** Rat’s Milkvetch\n**Textual Name:** Single Mugwort\nHot in nature. Grows in Jianzhou. Stems like mugwort, with purple leaves.\n**Breaks and treats:** Wind sores.\n\n**Song:**\n[...] buried where a thousand returns,\nThe wheel of life and death ascends the azure mountains.\nIf only you recognize this boiled in the pot,\nAfter the fire, the golden body emerges into the world.\n\n**Fiftieth Herb: Slightly Purple**\n**Common Name:** Purple Cowrie\n**Textual Name:** [None]\n**Treats:** Paralysis and numbness.\n\n**Song:**\nWithin the copper vase, cinnabar frost is spread,\nFrost like mist-shrouded smoke, yet without light.\nSuddenly, it melts further at the moment of solidity—\nPity the hue surpasses even jade.",
      "overlap_context": "ves resemble yam, with roots.\n**Treats:** Water diseases.\n\n**Song:**\nBury its root in a golden casket, unfurl its lotus head,\nThe True Man of Creation left it behind long ago.\nRemember well the five turnings when they unfold—\nBoil it to water, and the five metals will soften.\n*(Also called* Earth Su.)\n\n**Forty-Sixth Herb: Stone Fern**\n**Common Name:** Lost Darkness\n**Textual Name:** Lingering Gold\nHot in nature. Found in Chu lands. Branches with numerous leaves.\n**Treats:** Wind-cold.\n\n**Song:**",
      "start_char": 5121,
      "end_char": 5452,
      "start_sentence": 448,
      "end_sentence": 479,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.823496341705322,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "排蔓抽茎绕碧溪，四时改变采人迷。 直须好记莫令错，万里蓬莱此是梯。 寒石葵第五十－ 俗为附蒿，书云问芝。 叶圆似蒿。 性坚。 治风。 歌日： 山含山色绕山庭，无限仙人种在京。 唯共丹阳阳粉合，一朝煮罢绝铜声。 绢文蔓第五十二 俗为蛇葱，书呼宜人。 性热。 出蕲州。 如绢文。 治反胃。 歌日： 排蔓开枝长绿溪，可怜气力与山齐。 若能连夜添鱼水，白骨埋年尚也回。 鸡肠蔓第五十三 俗为林更，书无名。 性温。 出白州。 叶如鸡肠。 治一切难产。 歌日： 引蔓开枝万里生，抽条得色占春荣。 从此丹阳无黑色，汞中须有紫河名。 乌金脚第五十四 俗呼太芝，书名不祥。 性热。 出江陵府。 脚如乌钗，叶如蕨。 治腰脚。 歌日： 插金乌脚散寒山，学道仙君望眼穿。 从此既合含元识，切须不使别人传。 蛇衔菊第五十五 俗为单芝，书云未有。 性温。 出太原。 叶如蛇衔，花似菊。 治喉闭。 歌曰： 前草含花似绿杨，花排金蔓引溪傍。 采日切须防孝子，犬吠垆人被鬼伤。 还椿第五十六 俗为哲芝，书阙名。 性温。 出安南。",
      "translated_text": "**Fifty-First Herb: Cold-Stone Sunflower**\n**Common Name:** Attached Mugwort\n**Textual Name:** Inquiry Mushroom\nLeaves round like mugwort. Hard in nature. Treats wind.\n\n**Song:**\nMountains embrace their hues around the mountain court,\nCountless immortals cultivate it in the capital.\nOnly when blended with cinnabar and yang powder—\nOnce boiled, the bronze’s ring is forever stilled.\n\n**Fifty-Second Herb: Silk-Veined Vine**\n**Common Name:** Snake Onion\n**Textual Name:** Fitting One\nHot in nature. Grows in Qizhou. Veined like silk. Treats regurgitation.\n\n**Song:**\nVines spread, stems rise along green streams,\nPity its strength rivals the mountains.\nIf you can add fish-water through the night,\nEven bones buried for years may yet return.\n\n**Fifty-Third Herb: Chicken-Gut Vine**\n**Common Name:** Forest Watcher\n**Textual Name:** [None]\nWarm in nature. Grows in Baizhou. Leaves like chicken intestines. Treats all difficult births.\n\n**Song:**\nVines extend, stems sprout across ten thousand li,\nBranches gain color, claiming spring’s glory.\nFrom this, cinnabar knows no blackness—\nWithin mercury, the Purple River’s name must appear.\n\n**Fifty-Fourth Herb: Black-Gold Foot**\n**Common Name:** Supreme Mushroom\n**Textual Name:** Inauspicious\nHot in nature. Grows in Jiangling Prefecture. Stalks like black hairpins, leaves like ferns. Treats waist and leg ailments.\n\n**Song:**\nGolden crow feet scatter the cold mountains,\nImmortal seekers strain their eyes in longing.\nOnce you grasp the Primordial’s wisdom,\nTake care never to pass it to another.\n\n**Fifty-Fifth Herb: Snake-Holding Chrysanthemum**\n**Common Name:** Single Mushroom\n**Textual Name:** [None]\nWarm in nature. Grows in Taiyuan. Leaves like a snake’s bite, flowers like chrysanthemums. Treats throat obstruction.\n\n**Song:**\nThe former herb bears flowers like green willows,\nGolden vines spread along the brookside.\nWhen harvesting, beware the filial son—\nThe dog’s bark warns of ghosts harming the furnace-tender.\n\n**Fifty-Sixth Herb: Returning Cedar**\n**Common Name:** Wise Mushroom\n**Textual Name:** [None]\nWarm in nature. Grows in Annan.\n\n**Song:**\nVines spread, stems rise along jade-green streams,\nHarvesters lose their way through the four seasons’ changes.\nYou must remember well, lest you err—\nThis is the ladder to Penglai, ten thousand leagues away.",
      "overlap_context": "sand returns,\nThe wheel of life and death ascends the azure mountains.\nIf only you recognize this boiled in the pot,\nAfter the fire, the golden body emerges into the world.\n\n**Fiftieth Herb: Slightly Purple**\n**Common Name:** Purple Cowrie\n**Textual Name:** [None]\n**Treats:** Paralysis and numbness.\n\n**Song:**\nWithin the copper vase, cinnabar frost is spread,\nFrost like mist-shrouded smoke, yet without light.\nSuddenly, it melts further at the moment of solidity—\nPity the hue surpasses even jade.",
      "start_char": 5452,
      "end_char": 5936,
      "start_sentence": 480,
      "end_sentence": 529,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.675702810287476,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "状如椿，色紫。 治邪气。 歌曰： 落落金字展青天，紫道人问玄又玄。 若共还丹从此造，即须煮过十宵看。 金桃蔓第五十七 俗呼留恐，书云单夫。 性温。 出河中府。 状如葡萄引蔓。 歌日： 刻出青罗展绿微，真人不遣俗人知。 玄河河内但能煮，汞迷金章绕紫衣。 地□第五十八 俗为花，书无名。 性热，生湖州。 叶文如茧大指面。 治癫痫。 歌曰： 三三叶叶映枝红，最向还丹道有功。 但向汞中二更煮，任拈直用火墙笼。 稍红第五十九 俗为穿崖布，书云紫天天，亦名武容朱芝。 性凉。 生于阗国。",
      "translated_text": "**Fifty-Sixth Herb: Returning Cedar (continued)**\nShape like a cedar, purple in color. Treats perverse qi.\n\n**Song:**\nVast and golden, it unfurls against the azure sky,\nThe purple Daoist inquires of mysteries profound.\nIf you would craft the returning elixir from this,\nYou must boil it through ten nights to see.\n\n**Fifty-Seventh Herb: Golden Peach Vine**\n**Common Name:** Lingering Fear\n**Textual Name:** Single Man\nWarm in nature. Grows in Hezhong Prefecture. Shape like a grapevine, trailing its tendrils.\n\n**Song:**\nCarved from green silk, it spreads its verdant hues,\nThe perfected one conceals it from the vulgar.\nBoil it only in the waters of the Mystic River—\nMercury bewildered, gold seals twine in purple robes.\n\n**Fifty-Eighth Herb: Earth [Missing Character]**\n**Common Name:** Swallow Flower\n**Textual Name:** [None]\nHot in nature. Grows in Huzhou. Leaf veins like a silkworm cocoon, the size of a thumb’s face. Treats epilepsy.\n\n**Song:**\nLeaf upon leaf, three by three, crimson against the boughs,\nMost potent in the Way of the returning elixir.\nBoil it in mercury for two watches of the night—\nThen freely wield it to line the furnace’s fire-wall.\n\n**Fifty-Ninth Herb: Slightly Red**\n**Common Name:** Cliff-Piercing Cloth\n**Textual Name:** Purple Heaven-Heaven, also called Martial Countenance Vermilion Mushroom\nCool in nature. Grows in the kingdom of Yutian.",
      "overlap_context": "green willows,\nGolden vines spread along the brookside.\nWhen harvesting, beware the filial son—\nThe dog’s bark warns of ghosts harming the furnace-tender.\n\n**Fifty-Sixth Herb: Returning Cedar**\n**Common Name:** Wise Mushroom\n**Textual Name:** [None]\nWarm in nature. Grows in Annan.\n\n**Song:**\nVines spread, stems rise along jade-green streams,\nHarvesters lose their way through the four seasons’ changes.\nYou must remember well, lest you err—\nThis is the ladder to Penglai, ten thousand leagues away.",
      "start_char": 5936,
      "end_char": 6196,
      "start_sentence": 530,
      "end_sentence": 554,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.141460657119751,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "一枝一叶，叶背紫枝。 歌日： 界外绕林泉，必向经铛煎。 三度煮八石，如何体不坚。 右已前二十七味，生丁己，死戊壬， 应冬至后采。 狗舌蔓第六十 俗为鱼藻，书无名。 性寒。 出陈许州。 引蔓如狗舌。 治蛇毒。 歌曰： 狗舌还如狗舌形，俗客真人字两名。 不是人间无此草，渡江见孝用无灵。 玉垒第六十一 俗为番头，书无名。 性凉。 生岐雍。 花如盖幢，花稍紫。 治霍乱。 歌日： 花如蠢帜叶如绯，山北河南各两仪。 欲采之时须固惜，内园莫使外人知。 玉蒢第六十二 俗呼闰芝，书名兑。 性冷，出济南。 茎微叶小，色黄。 治热痢。 歌日：",
      "translated_text": "**Sixtieth Herb: One Stem, One Leaf**\n**Textual Name:** [None]\nLeaf’s underside purple, stem likewise.\n**Song:**\nBeyond the bounds, it winds through forests and springs—\nMust be simmered in the crucible.\nThrice boiled with eight stones,\nHow could the body not grow firm?\n\nThe preceding twenty-seven herbs:\nBorn in *ding-si*, die in *wu-ren*—\nHarvest after the Winter Solstice.\n\n**Sixty-First Herb: Dog’s-Tongue Vine**\n**Common Name:** Fishweed\n**Textual Name:** [None]\nCold in nature. Grows in Chenxu Prefecture.\nVines trail like a dog’s tongue. Treats snake venom.\n**Song:**\nDog’s tongue, true to its name—\nVulgar folk and perfected ones call it by two.\nWere this herb not of this world,\nCrossing the river, filial piety would lack its power.\n\n**Sixty-Second Herb: Jade Rampart**\n**Common Name:** Foreigner’s Head\n**Textual Name:** [None]\nCool in nature. Grows in Qiyong.\nFlowers like bannered canopies, their tips purple.\nTreats cholera.\n**Song:**\nFlowers like tattered banners, leaves like crimson silk—\nNorth of the mountains, south of the river, each in dual form.\nWhen gathering it, guard it well—\nLet not outsiders know of the inner garden.\n\n**Sixty-Third Herb: Jade Caltrop**\n**Common Name:** Intercalary Mushroom\n**Textual Name:** *Dui*\nCold in nature. Grows in Jinan.\nStems slender, leaves small, yellow in hue.\nTreats heat-induced dysentery.\n**Song:**",
      "overlap_context": "e a silkworm cocoon, the size of a thumb’s face. Treats epilepsy.\n\n**Song:**\nLeaf upon leaf, three by three, crimson against the boughs,\nMost potent in the Way of the returning elixir.\nBoil it in mercury for two watches of the night—\nThen freely wield it to line the furnace’s fire-wall.\n\n**Fifty-Ninth Herb: Slightly Red**\n**Common Name:** Cliff-Piercing Cloth\n**Textual Name:** Purple Heaven-Heaven, also called Martial Countenance Vermilion Mushroom\nCool in nature. Grows in the kingdom of Yutian.",
      "start_char": 6196,
      "end_char": 6485,
      "start_sentence": 555,
      "end_sentence": 584,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.84939694404602,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "秦王得地拟求仙，恰到岐阳岐上山。 向遇洞真亲指点，交共矾石一处煎。 红廿第六十三 俗无名，书云单齿。 性温。 出河西道。 叶如柑，色赤，石上生。 治浮痉。 歌日： 引云首月生崖上，镂出王公入羽衣。 若见凤凰他自舞，不须晋客把笙吹。 粟金第六十四 俗无名，书为单舟。 性凉。 出绵遂州。 抽茎叶尖圆。 治一切血气。 歌曰： 堂堂仙药在人问，恰见凡人似等闲。 若共金沙和夜煮，即知长在比龟年。 紫石苋第六十五 俗呼云裳，书为紫盖。 性热。 出通州。 如苋三道。",
      "translated_text": "**Sixty-Third Herb: Crimson Tooth**\n**Common Name:** [None]\n**Textual Name:** *Single Tooth*\nWarm in nature. Grows in Hexi Circuit.\nLeaves like those of the mandarin orange, crimson in color, growing on rocks.\nTreats floating convulsions.\n**Song:**\nMoon first rising o’er the cliff’s edge—\nCarved for lords and Daoist robes alike.\nShould the phoenix appear, it dances of itself—\nNo need for Jin courtiers to play their reed pipes.\n\n**Sixty-Fourth Herb: Millet Gold**\n**Common Name:** [None]\n**Textual Name:** *Single Boat*\nCool in nature. Grows in Mian and Suizhou.\nStems slender, leaves pointed and round.\nTreats all blood and qi disorders.\n**Song:**\nA noble immortal herb among men—\nYet mortals treat it as commonplace.\nWere it simmered with golden sand by night,\nOne would know it outlives the tortoise’s years.\n\n**Sixty-Fifth Herb: Purple Stone Amaranth**\n**Common Name:** Cloud Garment\n**Textual Name:** *Purple Canopy*\nHot in nature. Grows in Tongzhou.\nResembles amaranth with three veins.",
      "overlap_context": "in Qiyong.\nFlowers like bannered canopies, their tips purple.\nTreats cholera.\n**Song:**\nFlowers like tattered banners, leaves like crimson silk—\nNorth of the mountains, south of the river, each in dual form.\nWhen gathering it, guard it well—\nLet not outsiders know of the inner garden.\n\n**Sixty-Third Herb: Jade Caltrop**\n**Common Name:** Intercalary Mushroom\n**Textual Name:** *Dui*\nCold in nature. Grows in Jinan.\nStems slender, leaves small, yellow in hue.\nTreats heat-induced dysentery.\n**Song:**",
      "start_char": 6485,
      "end_char": 6730,
      "start_sentence": 585,
      "end_sentence": 609,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 5.853379964828491,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "治骨瘫。 歌日： 通芝三背影胧胧，丹药药中最有功。 不等能添金色润，又能一夜煮黄铜。 浮真草第六十六 俗呼交绵，书云大罗。 性温。 出郓州。 如豌豆，以花叶治血晕。 歌日： 阳阳红影绕人途，人间虽有世间无。 若遣卫真天女见，必应摘满满裾裾。 土苓第六十七 俗为江中草，书云牵女蔓。 性温。 引蔓有子。 治肠结。 歌日： 绿杨幽院家家有，恰取玄河用者稀。 从此内园须剩种，用方莫使外人知。 石青第六十八 俗为带青，书云关渠。 性热。 出单州。 引蔓叶尖。 治气结。 歌日： 碧阳天子献金丹，须兹神水合和餐。 若向青锅锅内着，可怜雪散及人看。 窈冥第六十九 俗呼石衣，亦云鱼衣，书云太周。 性热。 出江陵府，如石衣。 治冷气。 歌日：",
      "translated_text": "**Treats bone paralysis.**\n**Song:**\nThrough the threefold haze of *Tongzhi*—dim, dim—\nAmong elixirs, none surpass its power.\nNot only does it lend a golden luster,\nBut in one night it transmutes yellow bronze.\n\n**Sixty-Sixth Herb: Floating Perilla**\n**Common Name:** Intertwined Silk\n**Textual Name:** *Great Net*\nWarm in nature. Grows in Yunzhou.\nResembles peas; its flowers and leaves treat blood dizziness.\n**Song:**\nCrimson shadows twine the traveler’s path—\nThough found among men, it is not of this world.\nWere the Heavenly Maiden Weizhen to see it,\nShe would surely pluck her skirts full.\n\n**Sixty-Seventh Herb: Earth Smilax**\n**Common Name:** River Grass\n**Textual Name:** *Maiden’s Vine*\nWarm in nature. Trailing vine with seeds.\nTreats intestinal obstructions.\n**Song:**\nGreen willows grace every secluded courtyard,\nYet few pluck from the dark river’s flow.\nPlant it abundantly in your inner garden—\nGuard the recipe, lest outsiders know.\n\n**Sixty-Eighth Herb: Azurite**\n**Common Name:** Belt Azure\n**Textual Name:** *Barrier Channel*\nHot in nature. Grows in Shanzhou.\nTrailing vine with pointed leaves.\nTreats qi obstructions.\n**Song:**\nThe Azure Emperor offers golden pills—\nThis divine water must be blended and consumed.\nIf placed within a green crucible,\nAlas, the scattered snow melts before all eyes.\n\n**Sixty-Ninth Herb: Profound Darkness**\n**Common Name:** Stone Garment, also Fish Garment\n**Textual Name:** *Supreme Cycle*\nHot in nature. Grows in Jiangling Prefecture, resembling stone lichen.\nTreats cold qi.\n**Song:**",
      "overlap_context": "xtual Name:** *Single Boat*\nCool in nature. Grows in Mian and Suizhou.\nStems slender, leaves pointed and round.\nTreats all blood and qi disorders.\n**Song:**\nA noble immortal herb among men—\nYet mortals treat it as commonplace.\nWere it simmered with golden sand by night,\nOne would know it outlives the tortoise’s years.\n\n**Sixty-Fifth Herb: Purple Stone Amaranth**\n**Common Name:** Cloud Garment\n**Textual Name:** *Purple Canopy*\nHot in nature. Grows in Tongzhou.\nResembles amaranth with three veins.",
      "start_char": 6730,
      "end_char": 7075,
      "start_sentence": 610,
      "end_sentence": 644,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.581251859664917,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "窈窈冥冥石上生，人问虽有不知名。 大药之中安少许，即知足下庆云迎。 右已前十味，生甲丁，死戊己，应立秋节，立夏二十日探上。 还年第七十 俗为木相珠，书云含紫。 性温。 出昆仑。 叶如榆，上有珠。 治风。 歌日： 天长地久水洋洋，灵草含珠色自芳。 从此月滨滨海上，又堪煮炼作琼浆。 历章第七十－ 俗呼南天，书无名。 性温。 出凤翔府。 四棱，花紫，叶尖小。 治一切恶冷疾。 歌日： 红章寺里生春草，不似春终见历章。 若向白天锅内合，即知九雪散精光。 紫金茅第七十二 俗呼齐蒿，书无名。 性冷，出剑南。 茎紫青，叶尖长。 治心痛。 歌日： 青青新妇独行行，勿遇金华远院生。 因折将来煮金地，无烟从此始知名。 紫海椿第七十三 俗为交周，书无名。 性热，出江州。 叶如桩，色紫成树。 治中风。 歌曰：",
      "translated_text": "Deep in profound darkness it grows upon stone,\nThough present among men, none know its name.\nPlace but a trace within the great elixir—\nAt once, auspicious clouds gather beneath your feet.\n\nThe preceding ten herbs are born in *jia*-*ding*, die in *wu*-*ji*, and correspond to the Beginning of Autumn. Gather them twenty days after the Beginning of Summer.\n\n**Seventieth Herb: Returning Year**\n**Common Name:** Wooden Mutual Pearl\n**Textual Name:** *Containing Purple*\nWarm in nature. Grows in Kunlun.\nLeaves like the elm, bearing pearls upon them.\nTreats wind.\n**Song:**\nHeaven endures, earth abides, waters vast and flowing,\nThe numinous herb holds its pearl, its hue naturally fragrant.\nHenceforth by the moonlit shores of the boundless sea,\nIt may be decocted and refined into nectar divine.\n\n**Seventy-First Herb: Calendar Epoch**\n**Common Name:** Southern Heaven\n**Textual Name:** None recorded\nWarm in nature. Grows in Fengxiang Prefecture.\nFour-ridged stem, purple flowers, leaves small and pointed.\nTreats all malign cold disorders.\n**Song:**\nWithin Hongzhang Temple spring grasses grow,\nUnlike those that fade when spring’s end brings the Calendar Epoch.\nIf blended within a white crucible,\nSoon the nine snows scatter their radiant light.\n\n**Seventy-Second Herb: Purple Gold Thatch**\n**Common Name:** Even Mugwort\n**Textual Name:** None recorded\nCold in nature. Grows in Jiannan.\nPurple-green stems, leaves long and pointed.\nTreats heart pain.\n**Song:**\nAlone she walks, the verdant bride,\nNever meet one born of Golden Flower’s distant courtyard.\nPluck and boil it upon golden ground—\nFrom this moment, its name is known without smoke’s trace.\n\n**Seventy-Third Herb: Purple Sea Toon**\n**Common Name:** Intertwined Epoch\n**Textual Name:** None recorded\nHot in nature. Grows in Jiangzhou.\nLeaves like the *zhuang*, purple in hue, forming a tree.\nTreats windstroke.\n**Song:**",
      "overlap_context": "nnel*\nHot in nature. Grows in Shanzhou.\nTrailing vine with pointed leaves.\nTreats qi obstructions.\n**Song:**\nThe Azure Emperor offers golden pills—\nThis divine water must be blended and consumed.\nIf placed within a green crucible,\nAlas, the scattered snow melts before all eyes.\n\n**Sixty-Ninth Herb: Profound Darkness**\n**Common Name:** Stone Garment, also Fish Garment\n**Textual Name:** *Supreme Cycle*\nHot in nature. Grows in Jiangling Prefecture, resembling stone lichen.\nTreats cold qi.\n**Song:**",
      "start_char": 7075,
      "end_char": 7450,
      "start_sentence": 645,
      "end_sentence": 679,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.70560884475708,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "同同金柜影春山，无限真人手把看。 一种自糜开样度，不如此个起金丹。 金微第七十四 俗为重金，书无名。 性温。 出剑南。 绕石生，叶如雷葱，有子根。 治小儿疳。 歌日： 离阳新妇爱芝鱼，独寄仙翁万纸书。 因识金微煮寒石，河车身驾入青虚。 紫梦大夫第七十五 俗呼乡周，一名石蓼，书无名。 出河北道。 色紫。 治心痛。 歌曰： 花周万里对秦川，万里虽生不肯言。 若共三河同更煮，生身应踏九霄天。 石芥第七十六 俗为地花，书为南草。 性温。 出京中。 叶如南芥菜。 治小儿惊。 歌曰： 紫微天女不裁衣，会要人问石芥枝。 忌向白章锅里煮，便将砂毒水银飞。 山棱第七十七 俗为涧下芝，书云莫上芝。 性冷。 出益州。 叶如波棱蓊成。 治风。 歌曰： 丁丁伐木声从乌，淼淼江波草自灵。 唯有山棱宜好采，八般石药自然成。 尖尾葵第七十八 俗呼为风草，书无名。 性寒。 出恒定州。 一叶三尖。 治一切恶疮。 歌日：",
      "translated_text": "Together they gleam like golden caskets shadowing spring mountains,\nCountless immortals hold and gaze upon them in hand.\nOne kind melts of itself to reveal its pattern,\nYet none compare to this one for refining the Golden Elixir.\n\n**Seventy-Fourth Herb: Golden Micro**\n**Common Name:** Double Gold\n**Textual Name:** None recorded\nWarm in nature. Grows in Jiannan.\nTwines around rocks, leaves like *lei* onions, bearing seeds and roots.\nTreats infantile malnutrition.\n**Song:**\nThe Yang-separated bride loves the lingzhi fish,\nAlone she sends ten thousand sheets of letters to the immortal elder.\nOnce she recognizes Golden Micro boiled with cold stone,\nHer river chariot ascends, body borne into azure emptiness.\n\n**Seventy-Fifth Herb: Purple Dream Minister**\n**Common Name:** Village Epoch\n**Textual Name:** Stone Knotweed (also recorded)\nGrows in Hebei Circuit.\nPurple in color.\nTreats heart pain.\n**Song:**\nFlower Epoch faces the Qin River for ten thousand leagues,\nThough born across ten thousand leagues, it refuses to speak.\nIf boiled together with the Three Rivers’ waters,\nIts living form should tread the nine heavens’ sky.\n\n**Seventy-Sixth Herb: Stone Mustard**\n**Common Name:** Earth Flower\n**Textual Name:** Southern Herb\nWarm in nature. Grows in the capital.\nLeaves like southern mustard greens.\nTreats infantile fright.\n**Song:**\nThe Purple Tenuity Heavenly Maiden does not cut cloth,\nYet she must ask mortals for Stone Mustard’s branches.\nAvoid boiling it in a white-patterned crucible—\nInstead, let cinnabar’s poison and mercury take flight.\n\n**Seventy-Seventh Herb: Mountain Ridge**\n**Common Name:** Ravine-Below Lingzhi\n**Textual Name:** Never-Above Lingzhi\nCold in nature. Grows in Yizhou.\nLeaves like *boleng* watergrass, forming clusters.\nTreats wind disorders.\n**Song:**\n*Ding-ding*—the sound of woodcutting follows the crow,\n*Miao-miao*—river waves, the grass naturally numinous.\nOnly Mountain Ridge is fit for careful gathering,\nWhere eight kinds of stone medicines naturally form.\n\n**Seventy-Eighth Herb: Point-Tail Palm**\n**Common Name:** Wind Grass\n**Textual Name:** None recorded\nCold in nature. Grows in Hengding Prefecture.\nOne leaf with three pointed tips.\nTreats all malign sores.",
      "overlap_context": "annan.\nPurple-green stems, leaves long and pointed.\nTreats heart pain.\n**Song:**\nAlone she walks, the verdant bride,\nNever meet one born of Golden Flower’s distant courtyard.\nPluck and boil it upon golden ground—\nFrom this moment, its name is known without smoke’s trace.\n\n**Seventy-Third Herb: Purple Sea Toon**\n**Common Name:** Intertwined Epoch\n**Textual Name:** None recorded\nHot in nature. Grows in Jiangzhou.\nLeaves like the *zhuang*, purple in hue, forming a tree.\nTreats windstroke.\n**Song:**",
      "start_char": 7450,
      "end_char": 7879,
      "start_sentence": 680,
      "end_sentence": 723,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.733945369720459,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 20,
      "original_text": "渭州河北便生此，生处人多泠曝之。 五盐共煮为鄞鄂，如何不得命长时。 王骑第七十九 俗为绿天，书云无庆。 性温。 出江南道。 叶如车前茎文。 治毒疮。 歌曰： 都都太府青丹药，要此灵媒作主人。 从此和浆方服了，眼前亲见万年春。 尖苟蔓第八十 俗呼大对。 生剑南。 叶如苟引蔓。 治恶疮。 歌日： 人生不识金丹意，尖苟须为玉药泥。 不说硫黄添白色，亦能瓶内伏雌砒。 成天命第八十－ 俗呼有命，书无名。 性冷。 出忠万州。 治热病，余不言。 歌日： 玉阳宫女煮天浆，要得成天命始香。 须与水银开径路，兼为青丹作院墙。 朝天草第八十二 俗为鬼尿筒，书无名。 性冷。 出同华州。",
      "translated_text": "**Seventy-Ninth Herb: Wang Qi**\n**Common Name:** Green Heaven\n**Textual Name:** No Celebration\nWarm in nature. Grows in Jiangnan Circuit.\nLeaves like *cheqian* (plantain), with striated stems.\nTreats poisonous sores.\nGrows readily north of the Wei Prefecture’s river—\nwhere it thrives, people often dry it in the cold sun.\nBoil it with five salts to form *yin’e*—\nhow then could one fail to live a long life?\n**Song:**\n*Dudu*—the Grand Treasury’s green elixir,\nrequires this numinous medium as its master.\nOnce this harmonized pulp is consumed,\nbefore your eyes, ten thousand springs unfold.\n\n**Eightieth Herb: Pointed Caltrop Vine**\n**Common Name:** Great Pair\nGrows in Jiannan.\nLeaves like caltrop, trailing in vines.\nTreats malign sores.\n**Song:**\nMortals fail to grasp the gold elixir’s intent—\nthe pointed caltrop must become jade-medicine’s clay.\nNot to mention how sulfur whitens,\nit can also subdue arsenic within the crucible.\n\n**Eighty-First Herb: Heaven’s Mandate Fulfilled**\n**Common Name:** Having Destiny\n**Textual Name:** None recorded\nCold in nature. Grows in Zhong-Wanzhou.\nTreats heat disorders; the rest goes unspoken.\n**Song:**\nThe jade maidens of Yuyang Palace boil celestial pulp,\nonly when *Heaven’s Mandate Fulfilled* begins to fragrance.\nIt must guide mercury to open the path,\nand serve as the courtyard wall for green elixir.\n\n**Eighty-Second Herb: Facing-Heaven Grass**\n**Common Name:** Ghost’s Urine Tube\n**Textual Name:** None recorded\nCold in nature. Grows in Tong-Hua Prefecture.",
      "overlap_context": "ves like *boleng* watergrass, forming clusters.\nTreats wind disorders.\n**Song:**\n*Ding-ding*—the sound of woodcutting follows the crow,\n*Miao-miao*—river waves, the grass naturally numinous.\nOnly Mountain Ridge is fit for careful gathering,\nWhere eight kinds of stone medicines naturally form.\n\n**Seventy-Eighth Herb: Point-Tail Palm**\n**Common Name:** Wind Grass\n**Textual Name:** None recorded\nCold in nature. Grows in Hengding Prefecture.\nOne leaf with three pointed tips.\nTreats all malign sores.",
      "start_char": 7879,
      "end_char": 8189,
      "start_sentence": 724,
      "end_sentence": 754,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.666206121444702,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 21,
      "original_text": "心空有节长。 治恶疮。 歌曰： 遥遥天影入端虚，同华生时市地铺。 看取紫河车内草，无此黄金事不居。 辅蝉质第八十三 俗呼九宗丹，亦云景天，书无名。 性冷。 出渔阳县。 叶如车前，引蔓根长。 治热疾。 歌曰： 团团万叶出兰枝，唯有渔阳出得时。 三殿西埋十月用，然堪入药和精微。 金锁天第八十四 俗为灰藿，书云落藜。 性温。 出巴南。 叶方小，赤。 治上气。 歌曰： 金天剩进遣成灰，须共黄牙拌作泥。 从此水银须压伏，只此还丹路是梯。 还蔓第八十五 俗云天毋，书无名。 性温。 出美原县。 引蔓三叶。 治血晕。 歌曰： 千寻山石上遍川，万古人传出美原。",
      "translated_text": "**Eighty-Second Herb: Facing-Heaven Grass (continued)**\nHollow-stemmed with nodes, long in growth.\nTreats malign sores.\n**Song:**\nFrom afar, heaven’s shadow enters the void’s edge—\nwhen grown in Tong-Hua, it carpets the market ground.\nBehold the grass within the purple river chariot:\nwithout it, the golden elixir’s work cannot abide.\n\n**Eighty-Third Herb: Cicada’s Aid**\n**Common Name:** Nine-Clan Elixir, also called *Jingtian*\n**Textual Name:** None recorded\nCold in nature. Grows in Yuyang County.\nLeaves resemble plantain; vines trail with long roots.\nTreats heat disorders.\n**Song:**\nRound upon round, myriad leaves sprout from orchid branches—\nonly in Yuyang does it flourish in season.\nBuried west of the Three Palaces for October’s use,\nthen fit to enter the medicine, harmonizing the subtle.\n\n**Eighty-Fourth Herb: Golden Lock of Heaven**\n**Common Name:** Ashen Goosefoot\n**Textual Name:** Falling Goosefoot\nWarm in nature. Grows in Ba-Nan.\nLeaves small and square, reddish.\nTreats rising qi.\n**Song:**\nGolden Heaven’s surplus, rendered to ash,\nmust blend with yellow sprouts to form the clay.\nFrom this, mercury must be subdued—\nthis alone is the ladder to the returning elixir’s path.\n\n**Eighty-Fifth Herb: Returning Phoenix Vine**\n**Common Name:** Heaven’s Mother\n**Textual Name:** None recorded\nWarm in nature. Grows in Meiyuan County.\nVines trail with three leaves.\nTreats blood dizziness.\n**Song:**\nA thousand fathoms up the mountain stones, across the plains—\nsince ancient times, people have passed down its origin in Meiyuan.",
      "overlap_context": "Destiny\n**Textual Name:** None recorded\nCold in nature. Grows in Zhong-Wanzhou.\nTreats heat disorders; the rest goes unspoken.\n**Song:**\nThe jade maidens of Yuyang Palace boil celestial pulp,\nonly when *Heaven’s Mandate Fulfilled* begins to fragrance.\nIt must guide mercury to open the path,\nand serve as the courtyard wall for green elixir.\n\n**Eighty-Second Herb: Facing-Heaven Grass**\n**Common Name:** Ghost’s Urine Tube\n**Textual Name:** None recorded\nCold in nature. Grows in Tong-Hua Prefecture.",
      "start_char": 8189,
      "end_char": 8485,
      "start_sentence": 755,
      "end_sentence": 785,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.61937403678894,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 22,
      "original_text": "六戊锅中经宿煮，八般顽石自无烟。 同阳芰第八十六 俗呼马齿菜，书无名。 性冷。 叶圆，味滑。 治肠热。 出单方州。 歌曰： 茸茸引蔓满单方，能共还丹作郡乡。 水银不敢当头坐，谩趁朱砂迷在铛。 同阳糜第入十七 俗为人苋，书为结针。 性冷。 出蕃中。 叶尖。 治疳疾。 歌曰： 调神理魄发银光，石药兹囊作一方。 今日玉依表进，亦能压伏四神霜。 同巨天第八十入 俗为红盐花，亦为庆节蒲，书无名。 性温。 出益州。 叶尖狭，花如茨。 治血气。 歌曰： 同巨官中同巨天，烧成灰烬煮寒泉。 阳壬不得此灰过，阴癸终须飞作烟。 芙花舟第八十九 俗呼米囊，书无名。 性凉。 出黔南。",
      "translated_text": "**Eighty-Sixth Herb: Uniting Yang Water Chestnut**\n**Common Name:** Purslane\n**Textual Name:** None recorded\nCold in nature.\nLeaves round, texture slippery.\nTreats intestinal heat.\nGrows in Danfang Prefecture.\n**Song:**\nSoft tendrils trail across Danfang,\nfit to join the returning elixir’s domain.\nMercury dare not take the lead—\nvainly chasing cinnabar, lost in the crucible.\n\n**Eighty-Seventh Herb: Uniting Yang Amaranth**\n**Common Name:** Human Amaranth\n**Textual Name:** Knotted Needle\nCold in nature.\nGrows in foreign lands.\nLeaves pointed.\nTreats gan disorders.\n**Song:**\nHarmonizing spirit and ordering the po, it emits silver light,\nthis stone-drug pouch forming one method.\nToday, the jade pestle advances by the chart—\nit too can subdue the Four Spirit Frosts.\n\n**Eighty-Eighth Herb: Uniting the Great Heaven**\n**Common Name:** Red Salt Flower, also called Celebration Reed\n**Textual Name:** None recorded\nWarm in nature.\nGrows in Yizhou.\nLeaves narrow and pointed, flowers like brambles.\nTreats blood and qi.\n**Song:**\nIn the Uniting the Great Palace, Uniting the Great Heaven,\nburned to ash and boiled in cold springs.\nYang ren cannot pass this ash—\nyin gui must ultimately fly away as smoke.\n\n**Eighty-Ninth Herb: Hibiscus Boat**\n**Common Name:** Rice Sack\n**Textual Name:** None recorded\nCool in nature.\nGrows in Qiannan.",
      "overlap_context": "ed to ash,\nmust blend with yellow sprouts to form the clay.\nFrom this, mercury must be subdued—\nthis alone is the ladder to the returning elixir’s path.\n\n**Eighty-Fifth Herb: Returning Phoenix Vine**\n**Common Name:** Heaven’s Mother\n**Textual Name:** None recorded\nWarm in nature. Grows in Meiyuan County.\nVines trail with three leaves.\nTreats blood dizziness.\n**Song:**\nA thousand fathoms up the mountain stones, across the plains—\nsince ancient times, people have passed down its origin in Meiyuan.",
      "start_char": 8486,
      "end_char": 8791,
      "start_sentence": 786,
      "end_sentence": 817,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.943503141403198,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 23,
      "original_text": "叶青青，花含子。 治恶热闷。 歌日： 青天万里入幽无，唯有花舟接道隅。 虽共根苗和药煮，一般沉石自然浮。 右已前二十味，生戊壬，死丁己，应立夏节，立秋前四十日探用。 同变春第九十 俗呼昆仑葵，书为紫。 出西天。 叶圆成角，花紫。 治油痉。 歌日： 巅巅孤上占崖栽，每在人间院内开。 恰至还丹能计会，硫黄争得不当灰。 ＇ 狐孙藤第九十一 俗为地钱，书无名。 性热。 出最南。 引蔓叶尖，枝有声。 治恶疮。 歌日： 遥遥引蔓绕天津，长至南风不至春。 三月进来朝帝意，欲使生身蹋碧鳞。 石渠第九十二 俗呼下鱼菜，书无名。 性冻。 出开通州。 叶如竹，花黄。 治小儿疳。 歌曰： 碧花洞里展江鱼，万药之中最是模。 疗得紫丹黄色润，兼洗青丹色脱朱。 右已前三味，生戊丁，死甲乙，应立冬节，后二十日探上。 鱼肠蔓第九十三 俗为灵花，书为茨梨。 性温。 出宣州河北。 叶如马苋，有茨。 治恶疮。 歌日：",
      "translated_text": "**Eighty-Ninth Herb: Hibiscus Boat (continued)**\nLeaves verdant, flowers bearing seeds.\nTreats malign heat and oppression.\n**Song:**\nInto the azure vastness, deep into the unseen,\nonly the flower-boat reaches the Dao’s corner.\nThough root and sprout are boiled with herbs as one,\nthis stone alone sinks while the rest naturally float.\n\nThe preceding twenty herbs:\nBorn in *wu-ren* years, die in *ding-ji* years.\nGathered at the *Beginning of Summer* or forty days before the *Beginning of Autumn*.\n\n**Ninetieth Herb: Unchanging Spring**\n**Common Name:** Kunlun Mallow\n**Textual Name:** Purple Pestle\nGrows in the Western Heaven.\nLeaves round with angles, flowers purple.\nTreats oil convulsions.\n**Song:**\nPlanted alone atop the loftiest crag,\nit blooms in courtyards among mortals.\nWhen the returning elixir’s reckoning is met,\nhow could sulfur fail to yield to its ash?\n\n**Ninety-First Herb: Fox-Grandson Vine**\n**Common Name:** Earth Coin\n**Textual Name:** None recorded\nHot in nature.\nGrows in the farthest south.\nVines trailing, leaves pointed, branches resonant.\nTreats malign sores.\n**Song:**\nFar-reaching vines coil round the Celestial Ford,\ngrowing till the south wind blows, never knowing spring.\nBrought in the third month to court the Emperor’s will,\nit would make the living body tread the azure scales.\n\n**Ninety-Second Herb: Stone Channel**\n**Common Name:** Lower Fish Herb\n**Textual Name:** None recorded\nCold in nature.\nGrows in Kaitong Prefecture.\nLeaves like bamboo, flowers yellow.\nTreats childhood *gan* disorders.\n**Song:**\nIn the jade-flower grotto, the river fish unfurls,\nthe fairest model among ten thousand herbs.\nWhen it cures purple cinnabar to a lustrous yellow,\nit also washes green cinnabar till its red fades.\n\nThe preceding three herbs:\nBorn in *wu-ding* years, die in *jia-yi* years.\nGathered at the *Beginning of Winter* or twenty days thereafter.\n\n**Ninety-Third Herb: Fish-Gut Vine**\n**Common Name:** Spirit Flower\n**Textual Name:** Bramble Pear\nWarm in nature.\nGrows in Xuanzhou and Hebei.\nLeaves like horse purslane, bearing brambles.\nTreats malign sores.\n**Song:**",
      "overlap_context": "** Red Salt Flower, also called Celebration Reed\n**Textual Name:** None recorded\nWarm in nature.\nGrows in Yizhou.\nLeaves narrow and pointed, flowers like brambles.\nTreats blood and qi.\n**Song:**\nIn the Uniting the Great Palace, Uniting the Great Heaven,\nburned to ash and boiled in cold springs.\nYang ren cannot pass this ash—\nyin gui must ultimately fly away as smoke.\n\n**Eighty-Ninth Herb: Hibiscus Boat**\n**Common Name:** Rice Sack\n**Textual Name:** None recorded\nCool in nature.\nGrows in Qiannan.",
      "start_char": 8791,
      "end_char": 9216,
      "start_sentence": 818,
      "end_sentence": 858,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.163366079330444,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 24,
      "original_text": "人问有药是鱼肠，解与还丹好作方。 三鼎烟中开瑞色，九霄宫里镇灵香。 山菊第九十四 俗为真浮人，书无名。 性冷。 出渭南县。 叶如荼，花似菊。 治酒病心忪。 歌日： 花如黄菊叶如茶，俗人不识出仙家。 能与青丹出颜色，兼将红粉作黄牙。 单真第九十五 俗为荠苹，书无名。 出河南府。 性热。 叶如莲，近水生。 治蛇咬。 歌日： 天真天地本由人，自是凡夫不识真。 从此八灵甘受死，凡人自此免为尘。 金镜寒第九十六 俗为人芝，书无名。 出安南府。 如葵菜，有毛。 治虫蛇毒。 歌曰： 石中石上总秋生，叶上生毛红点茎。 三接外几数般样，样中最好是东京。 青枝第九十七 俗为苦启木，书无名。 出西龙州。 性冷。 成树有枝条。 治脚气。 歌曰： 成木生条长万山，西王亲种在人问。 善使青矾无恶气，又能不失紫金班。 紫楼春第九十八 俗为白马菜，书无名。 又为留着茉。 叶紫青尖。 出江州。 歌曰：",
      "translated_text": "**Ninety-Third Herb: Fish-Gut Vine (continued)**\nOne asks, \"Is there a medicine like fish-gut?\"\nIt resolves and restores the elixir, fine for formulas.\nIn the three cauldrons’ smoke, auspicious hues unfold;\nin the Nine Heavens’ palace, numinous fragrance abides.\n\n**Ninety-Fourth Herb: Mountain Chrysanthemum**\n**Common Name:** True Floating Man\n**Textual Name:** None recorded\nCold in nature.\nGrows in Weinan County.\nLeaves like tea, flowers like chrysanthemum.\nTreats wine-induced heart palpitations.\n**Song:**\nFlowers like yellow chrysanthemum, leaves like tea,\nthe common folk know not its immortal lineage.\nIt can restore green cinnabar’s complexion,\nand turn rouge powder to golden ivory.\n\n**Ninety-Fifth Herb: Single Perfection**\n**Common Name:** Shepherd’s Purse\n**Textual Name:** None recorded\nGrows in Henan Prefecture.\nHot in nature.\nLeaves like lotus, grows near water.\nTreats snakebite.\n**Song:**\nHeavenly perfection, earthly truth—all from man,\nyet common mortals fail to recognize the real.\nFrom this, the Eight Spirits willingly accept death,\nwhile mortals henceforth escape as dust.\n\n**Ninety-Sixth Herb: Golden Mirror Cold**\n**Common Name:** Human Fungus\n**Textual Name:** None recorded\nGrows in Annan Prefecture.\nResembles mallow, bears hair.\nTreats insect and snake venom.\n**Song:**\nBorn in autumn on stone and stone alike,\nleaves with hair, stems with crimson specks.\nBeyond the Three Conjunctions, several forms appear—\nof all, the finest hails from the Eastern Capital.\n\n**Ninety-Seventh Herb: Green Branch**\n**Common Name:** Bitter Awakening Wood\n**Textual Name:** None recorded\nGrows in West Long Prefecture.\nCold in nature.\nMatures into a tree with branches.\nTreats beriberi.\n**Song:**\nA full-grown tree with branches spans ten thousand mountains,\nplanted by the Queen of the West among mortals.\nIt refines green vitriol without foul qi,\nand preserves the luster of purple gold.\n\n**Ninety-Eighth Herb: Purple Tower Spring**\n**Common Name:** White Horse Herb\n**Textual Name:** None recorded\nAlso called Lingering Jasmine.\nLeaves purple, green, and pointed.\nGrows in Jiangzhou.\n**Song:**",
      "overlap_context": "est model among ten thousand herbs.\nWhen it cures purple cinnabar to a lustrous yellow,\nit also washes green cinnabar till its red fades.\n\nThe preceding three herbs:\nBorn in *wu-ding* years, die in *jia-yi* years.\nGathered at the *Beginning of Winter* or twenty days thereafter.\n\n**Ninety-Third Herb: Fish-Gut Vine**\n**Common Name:** Spirit Flower\n**Textual Name:** Bramble Pear\nWarm in nature.\nGrows in Xuanzhou and Hebei.\nLeaves like horse purslane, bearing brambles.\nTreats malign sores.\n**Song:**",
      "start_char": 9216,
      "end_char": 9638,
      "start_sentence": 859,
      "end_sentence": 901,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.830327272415161,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 25,
      "original_text": "堂堂开色紫楼春，独占人间白背鳞。 还丹药就须添煮，青霄得上九天真。 辅天台第九十九 俗为背醋木，书无名。 性温，成树带子。 出终南山。 治反胃。 歌日： 笼笼成树长南山，万木之中此最贤。 天药烧时须剩点，应得生身白骨全。 劲金骨第一百 俗为绿鱼沼，书名天文芋。 性温。 如茅有果。 治漏胎。 歌曰： 疏疏引叶恰如茅，每岁真人玉水浇。 能与还丹生羽翼，凡人身吃入青霄。 木瓜第一百一 俗为天同果。 歌曰： 摇摇天树长巴南，带日花繁每日含。 大药合时须剩裂，经秋采摘始宜堪。 零零草第一百二 俗为无青，书无名。 性玲，出巴州。 一丛三两叶，含露。 治疫病。 歌日： 一丛花带叶零零，人间知好不知名。 看取药成金色美，取之符咒鬼神惊。 右已前十味，生戊子，死甲巳，应立 秋节，夏至后立冬前后探之。 蓬莱山西灶还丹歌卷上竟 蓬莱山西灶还丹歌卷下",
      "translated_text": "**Purple Tower Spring (continued)**\n**Song:**\nIn grandeur blooms the Purple Tower Spring,\nalone it claims the mortal world’s white-backed scales.\nTo refine the returning elixir, one must add boiling,\nto ascend the azure heavens and attain the Ninefold Perfected.\n\n**Ninety-Ninth Herb: Heaven-Supporting Terrace**\n**Common Name:** Back-Vinegar Wood\n**Textual Name:** None recorded\nWarm in nature, matures into a tree bearing fruit.\nGrows in Mount Zhongnan.\nTreats regurgitation.\n**Song:**\nTowering tall, the tree grows on Southern Mountain,\namong ten thousand woods, this one is most worthy.\nWhen the celestial medicine is fired, a surplus must remain—\nit revives the living body, restoring white bones whole.\n\n**One Hundredth Herb: Sturdy Metal Bone**\n**Common Name:** Green Fish Marsh\n**Textual Name:** Celestial Pattern Taro\nWarm in nature.\nResembles cogongrass, bears fruit.\nTreats fetal leakage.\n**Song:**\nSparse leaves spread like cogongrass,\neach year the Perfected One waters it with jade dew.\nIt grants the returning elixir wings to grow,\nand those who consume it ascend to the azure heavens.\n\n**One Hundred First Herb: Wood Melon**\n**Common Name:** Heaven-Union Fruit\n**Song:**\nSwaying, the celestial tree grows in southern Ba,\nits sunlit blossoms lush, held each day.\nWhen the great medicine is compounded, it must be split abundantly—\nonly after autumn’s harvest is it fit for use.\n\n**One Hundred Second Herb: Scattered Dew Herb**\n**Common Name:** No-Green\n**Textual Name:** None recorded\nCold in nature, grows in Bazhou.\nA cluster of three or two leaves, laden with dew.\nTreats epidemic diseases.\n**Song:**\nA cluster of flowers with scattered leaves,\nknown for its goodness yet unnamed among men.\nBehold—when the medicine is wrought, its golden hue is fair,\nand those who gather it with incantations startle ghosts and gods.\n\nThe preceding ten herbs:\nborn in *wuzi*, die in *jiasi*,\ncorrespond to the advent of autumn,\nand are gathered after the Summer Solstice, before and after the Beginning of Winter.\n\n**End of *Songs of the Western Hearth of Penglai Mountain: Returning Elixir*, Scroll the First**\n**Beginning of *Songs of the Western Hearth of Penglai Mountain: Returning Elixir*, Scroll the Second**",
      "overlap_context": " West Long Prefecture.\nCold in nature.\nMatures into a tree with branches.\nTreats beriberi.\n**Song:**\nA full-grown tree with branches spans ten thousand mountains,\nplanted by the Queen of the West among mortals.\nIt refines green vitriol without foul qi,\nand preserves the luster of purple gold.\n\n**Ninety-Eighth Herb: Purple Tower Spring**\n**Common Name:** White Horse Herb\n**Textual Name:** None recorded\nAlso called Lingering Jasmine.\nLeaves purple, green, and pointed.\nGrows in Jiangzhou.\n**Song:**",
      "start_char": 9638,
      "end_char": 10052,
      "start_sentence": 902,
      "end_sentence": 936,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.652779340744019,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 26,
      "original_text": "汉检校仆射金紫光禄大夫黄玄锺撰 黄帝春第一百三 俗为芙蓉水，书无名。 性冷。 花紫黄不定，绕水生。 治毒风。 歌曰： 栋宇虽生梁柱功，还丹道要水芙蓉。 若说西王生最好，南山采得用通同。 山浊第一百四 俗为水浊，书无名。 每枝三叶，如蒴。 治风血。 歌曰： 玉楼开镜影三山，此草生时不等闲。 若不高峰峰石上，即须长养在崖泉。 毕录秋第一百五 俗为白茂树，书无名。 成树叶如柳。 出岭外道。 治一切恶疮。 歌曰： 天长月在碧霄悬，月在千山万药前。 采合药时须记取，拈共黄牙一处煎。 浮林池第－百六 俗为地皱，书无名。 叶如柳面皱。 性热。 治冷风。",
      "translated_text": "**Han Inspector Attendant and Grand Master for Splendid Happiness Huang Xuanzhong’s Compilation**\n\n**103: Yellow Emperor’s Spring**\n**Common Name:** Hibiscus Water\n**Textual Name:** None recorded\nCold in nature. Its flowers vary between purple and yellow, growing around water. Treats poisonous winds.\n\n**Song:**\nThough beams and pillars serve a house’s frame,\nthe Way of Returning Elixir needs hibiscus water.\nIf one speaks of the finest from the Queen Mother of the West,\ngathered from Southern Mountain, its use is all-encompassing.\n\n**104: Mountain Turbidity**\n**Common Name:** Water Turbidity\n**Textual Name:** None recorded\nEach stem bears three leaves, resembling *shuòyì*. Treats wind-blood disorders.\n\n**Song:**\nJade towers open mirrors to reflect three mountains,\nthis herb’s birth is no ordinary matter.\nIf not upon the lofty peaks of rocky summits,\nthen it must grow nurtured by cliffside springs.\n\n**105: Autumn’s End Record**\n**Common Name:** White Luxuriant Tree\n**Textual Name:** None recorded\nGrows into a tree with willow-like leaves. Found on roads beyond the mountain passes. Treats all malign sores.\n\n**Song:**\nThe sky stretches long, the moon hangs in azure vastness,\nthe moon stands before a thousand mountains and ten thousand herbs.\nWhen gathering and compounding medicine, take heed—\npluck and simmer it together with yellow sprouts.\n\n**106: Floating Forest Pool**\n**Common Name:** Earth’s Wrinkle\n**Textual Name:** None recorded\nLeaves resemble willow but are wrinkled. Hot in nature. Treats cold winds.",
      "overlap_context": "en the medicine is wrought, its golden hue is fair,\nand those who gather it with incantations startle ghosts and gods.\n\nThe preceding ten herbs:\nborn in *wuzi*, die in *jiasi*,\ncorrespond to the advent of autumn,\nand are gathered after the Summer Solstice, before and after the Beginning of Winter.\n\n**End of *Songs of the Western Hearth of Penglai Mountain: Returning Elixir*, Scroll the First**\n**Beginning of *Songs of the Western Hearth of Penglai Mountain: Returning Elixir*, Scroll the Second**",
      "start_char": 10052,
      "end_char": 10350,
      "start_sentence": 937,
      "end_sentence": 965,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.55940294265747,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 27,
      "original_text": "歌日： 玉塘水泠泠天心，此药将堪价比金。 能共硫黄相把捉，就中最好走铅壬。 鹤来枝第－百七 俗为女贞，书无名。 宜治霍乱。 歌曰： 平平天地自侵临，不到龙门是海深。 仙药人间成树木，人间不识自埋沉。 山紫苏第－百八 俗为界州莱，书无名。 出歙州宣州。 茎紫，叶如真紫苏。 性冷。 歌日： 玉潭深底见深波，好药人间核似罗。 唯共丹阳除黑色，染成如雪石中磨。 调神芝第－百九 俗呼为还骨，书无名。 出忠万州。 如句树。 宜治痨及狂癫。 歌日： 人间自有草还丹，抛向人间不肯餐。 任是生来还又死，可怜仙药放教闲。 香茹引第一百－十 俗为绵木是，书无名。 生茂州。 性温。 成树木，内有绵。 治血拥气。 歌日： 逍遥天路道能平，自是凡夫不学生。 能取此来和汞煮，眼前争不白云迎。 崖蓝－百一十－ 俗为附槽草，书无名。 味苦，有毒。 一叶数尖，如烬草。 治白风。 歌日： 金成似玉火中砂，此草多灵伴作牙。 心共女人同火本，只缘不伏是河车。 慑龙回第－百一十二 俗为豫樟木，书无名。 有毒。 叶大三指，成树。 孟夏州近汉山有之。 治鬼注。",
      "translated_text": "**Song:**\nJade Pool’s waters, cold and clear, mirror heaven’s heart,\nthis herb’s worth could rival gold in price.\nWhen paired with sulphur, they grasp each other tight—\nbest of all for guiding lead and *ren*’s flight.\n\n**107: Crane’s Arrival Branch**\n**Common Name:** Female Chastetree\n**Textual Name:** None recorded\nEffective for treating cholera.\n\n**Song:**\nLevel and boundless, heaven and earth press near,\nyet depths beyond Dragon Gate outmeasure the sea.\nThis immortal herb grows as a tree among men—\nunrecognized, it buries itself in obscurity.\n\n**108: Mountain Purple Perilla**\n**Common Name:** Jiezhou Greens\n**Textual Name:** None recorded\nFound in Shezhou and Xuanzhou. Stems purple, leaves like true purple perilla. Cold in nature.\n\n**Song:**\nIn jade depths, profound waves arise,\nthis fine herb’s seeds resemble silk.\nWith cinnabar from Danyang, it banishes black hues—\nground with stone, it turns pure as snow.\n\n**109: Harmonizing Spirit Mushroom**\n**Common Name:** Returning Bone\n**Textual Name:** None recorded\nFound in Zhongwanzhou. Resembles *ju* trees. Effective for treating consumption and manic madness.\n\n**Song:**\nThe world already holds the herb of returning cinnabar,\nyet cast aside, it refuses to be consumed.\nThough born only to die again,\nhow pitiful—this immortal herb left to idle.\n\n**110: Fragrant Rue Guide**\n**Common Name:** Cottonwood\n**Textual Name:** None recorded\nGrows in Maozhou. Warm in nature. Becomes a tree with cotton inside. Treats blood stagnation and qi obstruction.\n\n**Song:**\nThe Dao levels the paths of heaven’s wandering,\nyet common folk fail to learn its ways.\nIf you take this and boil it with mercury,\nhow could white clouds not gather before your eyes?\n\n**111: Cliff Indigo**\n**Common Name:** Trough-Attaching Grass\n**Textual Name:** None recorded\nBitter in taste, toxic. One leaf with many points, like *jin* grass. Treats white wind.\n\n**Song:**\nGold forged like jade, fire’s sand,\nthis herb’s numinous power acts as a fang.\nIts nature shares a root with woman and fire—\nonly because it refuses to submit to the river chariot.\n\n**112: Startled Dragon’s Return**\n**Common Name:** Camphorwood\n**Textual Name:** None recorded\nToxic. Leaves as wide as three fingers, grows into a tree. Found near Hanshan in Mengxiazhou. Treats ghostly infestations.",
      "overlap_context": "th willow-like leaves. Found on roads beyond the mountain passes. Treats all malign sores.\n\n**Song:**\nThe sky stretches long, the moon hangs in azure vastness,\nthe moon stands before a thousand mountains and ten thousand herbs.\nWhen gathering and compounding medicine, take heed—\npluck and simmer it together with yellow sprouts.\n\n**106: Floating Forest Pool**\n**Common Name:** Earth’s Wrinkle\n**Textual Name:** None recorded\nLeaves resemble willow but are wrinkled. Hot in nature. Treats cold winds.",
      "start_char": 10351,
      "end_char": 10856,
      "start_sentence": 966,
      "end_sentence": 1013,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.694596767425537,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 28,
      "original_text": "歌日： 稍稍同木也同材，张骞乘上碧云来。 此树生过一千岁，一切江河路自开。 右已前十味，生甲壬，死戊壬，应立 冬节，并春分及秋分前后探之。 紫鸡肠第一百一十三 俗为水蔓，书无名。 性热。 出江南道。 近水生，引蔓。 治瘫。 歌曰： 碧溪生处远闲碘，后学真人路自迷。 壬癸硬时须好煮，若过再宿耎如泥。 寿容第－百一十四 俗为冬青，书无名。 性温。 出河北道。 叶青成树，有子。 治折伤。 歌日： 四时不改黛云遮，解共还丹作一家。 千岁生时空服食，况论与汞作河车。 芦口寒第－百－十五 俗为英芝，书为奉宜。 性冷。 出云安。 叶圆小茎。 治中风。 歌曰： 团团天地卵成形，灵草仙方□地生。 此物堪将救人世，今朝由惜载仙经。 带丝金第－百－十六 俗为揪树，书无名。 性冷。 出绵剑州。 成悬丝。 治妇人经脉不通。 歌日： 万条垂下绿金丝，仙药人间总不知。 须向炎中汞身在，即须百过入玄微。 防石硝第一百－十七 俗为销草竹，书为草苟芝。 性热。 出广州。 叶圆如指茎。 备治恶寒毒。 歌曰： 三峡峡中千水气，化成寒草广州生。 八石烟中为父子，九天天上又多名。 御酒醒第一百一十八 俗为丹芝，书为楼春草。 性冷。 出河内道。 三花，叶色青。 治心痛。 歌日： 青丹消酒缘何事，灵草先须煮度宵。 从此饮多醉便醒，况拈同向火中烧。 暹玉芝第一百一十九 俗为浮水蓝，书无名。 性冷。 出岭外道。 如小蓝，叶尖长。 治肺瘫。 歌曰： 行行绕涧起青苗，八石同功力不饶。 一切垆中须少许，不然同向火中烧。 琵琶芝第一百二十 俗为附除，书为白天。 性冷。 出云南。 叶圆长，带子。 治大风。 歌曰：",
      "translated_text": "**Song:**\nThough kindred to the tree in form and grain,\nZhang Qian rode the azure clouds to bring it here.\nThis tree, once past a thousand years of age,\nparts every river’s course as though by its own might.\n\nThe preceding ten herbs: born on *jia-ren* days, wither on *wu-ren* days. Harvest them at the advent of the Beginning of Winter, or around the Spring and Autumn Equinoxes.\n\n**113: Purple Chicken’s Intestines**\n**Common Name:** Water Vine\n**Textual Name:** None recorded\nWarm in nature. Found in the Jiangnan Circuit. Grows near water, trailing in vines. Treats paralysis and numbness.\n\n**Song:**\nWhere emerald streams arise in distant, quiet pools,\nlater adepts lose their way in search of truth.\nWhen *ren-gui* days grow hard, boil it well—\nif left past two nights, it softens like mud.\n\n**114: Longevity’s Embrace**\n**Common Name:** Wintergreen\n**Textual Name:** None recorded\nWarm in nature. Found in the Hebei Circuit. Leaves evergreen, grows into a tree with fruit. Treats fractures and injuries.\n\n**Song:**\nThrough four seasons, unchanging beneath the jade-hued clouds,\nit harmonizes with the returning elixir as one family.\nThough men of old consumed it for millennia in vain,\nhow much less could it serve mercury as the river chariot?\n\n**115: Reed-Mouth Cold**\n**Common Name:** Heroic Mushroom\n**Textual Name:** *Fengyi*\nCold in nature. Found in Yun’an. Leaves round, stems small. Treats windstroke.\n\n**Song:**\nRound as the heavens and earth, shaped like an egg,\nthis numinous herb, this immortal formula, grows from the earth.\nSuch a treasure could save the mortal world—\ntoday, it is cherished only in the immortals’ scriptures.\n\n**116: Silk-Bearing Gold**\n**Common Name:** Tallow Tree\n**Textual Name:** None recorded\nCold in nature. Found in Mian and Jianzhou. Hangs in golden threads. Treats blocked menstruation in women.\n\n**Song:**\nTen thousand strands descend like green-gold silk,\nyet this immortal herb remains unknown to men.\nOnly when mercury’s body endures the flame\nmust it be refined a hundred times to enter the subtle mystery.\n\n**117: Guarding Niter**\n**Common Name:** Dissolving Bamboo Grass\n**Textual Name:** *Caogou Zhi*\nHot in nature. Found in Guangzhou. Leaves round as fingers, with stems. Prepares against noxious cold and poison.\n\n**Song:**\nAmid the thousand mists of the Three Gorges,\nthis cold herb takes form in Guangzhou.\nIn the smoke of the eight minerals, it is father and son;\nin the heavens above, it bears many names.\n\n**118: Imperial Wine-Soberer**\n**Common Name:** Cinnabar Mushroom\n**Textual Name:** *Lou Chun Grass*\nCold in nature. Found in the Henan Circuit. Three flowers, leaves green. Treats heart pain.\n\n**Song:**\nWhy does this blue-cinnabar dissolve wine’s grip?\nThe numinous herb must first be boiled through the night.\nFrom now on, drink deeply—drunkenness will fade,\nespecially when plucked and burned in the fire.\n\n**119: Jade-Enveloping Mushroom**\n**Common Name:** Floating Water Indigo\n**Textual Name:** None recorded\nCold in nature. Found in the Lingwai Circuit. Like small indigo, leaves long and pointed. Treats lung paralysis.\n\n**Song:**\nRow upon row, it rises by the stream in verdant shoots,\nits power unyielding, equal to the eight minerals.\nIn every crucible, only a pinch is needed—\nelse, like all things, it must be burned in the fire.\n\n**120: Lute Mushroom**\n**Common Name:** Hanger-On\n**Textual Name:** *Baitian*\nCold in nature. Found in Yunnan. Leaves round and long, bearing seeds. Treats severe wind.",
      "overlap_context": "d\nBitter in taste, toxic. One leaf with many points, like *jin* grass. Treats white wind.\n\n**Song:**\nGold forged like jade, fire’s sand,\nthis herb’s numinous power acts as a fang.\nIts nature shares a root with woman and fire—\nonly because it refuses to submit to the river chariot.\n\n**112: Startled Dragon’s Return**\n**Common Name:** Camphorwood\n**Textual Name:** None recorded\nToxic. Leaves as wide as three fingers, grows into a tree. Found near Hanshan in Mengxiazhou. Treats ghostly infestations.",
      "start_char": 10857,
      "end_char": 11600,
      "start_sentence": 1014,
      "end_sentence": 1088,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.932574033737183,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 29,
      "original_text": "秦王天上玉京东，曾有真人上碧空。 因得琵琶芝草吃，生身身坐紫阳宫。 土燖蔓第－百二十－ 俗为巨玉，书为劳寒。 性冷。 出巴蓬州。 叶三尖，引蔓。 治风病。 歌日： 盈盈方知天台上，须共青盐引白浆。 毗上有烟烟不起，即须要此作篱墙。 铜蹄蔓第一百二十二 俗为太玉芝，书云林芝。 性冷。 出秦川。 有叶尖长，引蔓。 治风邪。 歌曰： 东王公母行云雨，恰遣铜蹄蔓不生。 惟须陛下秦川采，采时不得预称名。 胡金毒第一百二十三 俗为瘴天树，书无名。 有毒。 出云南。 治蛇毒。 树不高三尺，叶尖，破味杀人。 歌曰： 阴阳不交生此树，味毒枝条不肯高。 第二亥河河内煮，即知阴癸不炎消。 寻河草第－百二十四 俗为江风，书无名。 性冷，出黔南。 生苗长数丈。 治喜病。 歌曰： 巨海海长千万里，此药寻何二复然。 间取张骞必知处，采时切忌用盐煎。 精蕈第一百二十五 书俗无名，色黄白，无苗茎，不应节，不治病。 歌日： 春时生即多黄白，秋夏生时带黑青。 殿前但间东方朔，此人知处又知名。 石渠第－百二十六 俗为寒竹草，书无名。 性冷。 杀虫。 出荆南。 如竹苗长。 歌曰：",
      "translated_text": "**121: Earth-Simmered Vine**\n**Common Name:** Great Jade\n**Textual Name:** *Laohan*\nCold in nature. Found in Bazhong Prefecture. Leaves with three points, trailing vines. Treats wind diseases.\n\n**Song:**\nOnly when lush does one know it grows on Heaven’s Terrace—\nit must be drawn with green salt to yield white sap.\nIf smoke lingers yet fails to rise above the embers,\nthen this vine must be planted to make a fence.\n\n**122: Bronze-Hoof Vine**\n**Common Name:** Supreme Jade Mushroom\n**Textual Name:** *Linzhi*\nCold in nature. Found in Qin Chuan. Leaves long and pointed, trailing vines. Treats wind malignities.\n\n**Song:**\nThe Queen Mother of the East wanders amid clouds and rain,\nyet the Bronze-Hoof Vine refuses to grow.\nOnly when Your Majesty gathers it in Qin Chuan—\nand when gathering, never speak its name beforehand.\n\n**123: Barbarian Gold Toxin**\n**Common Name:** Miasma-Heaven Tree\n**Textual Name:** None recorded\nToxic. Found in Yunnan. Treats snake venom.\nThe tree stands no taller than three feet; its leaves are pointed, and its broken sap is lethal.\n\n**Song:**\nWhen yin and yang fail to merge, this tree is born—\nits poisonous branches refuse to grow tall.\nBoil it in the second *hai* hour by the river’s edge,\nand you will know how yin’s *gui* dissolves without flame.\n\n**124: River-Seeking Herb**\n**Common Name:** River Wind\n**Textual Name:** None recorded\nCold in nature. Found in southern Qian. The sprouts grow several yards long. Treats joy-sickness.\n\n**Song:**\nThe vast sea stretches a thousand myriad leagues—\nhow could this herb’s search be twice as long?\nOnly Zhang Qian would know where to find it,\nbut when gathering, never decoct it with salt.\n\n**125: Essence Mushroom**\n**Common and Textual Names:** None recorded\nYellow-white in color, without stem or stalk, unaligned with the seasons, and does not treat illness.\n\n**Song:**\nWhen it sprouts in spring, it is mostly yellow-white;\nwhen it sprouts in summer or autumn, it bears black and green.\nOnly ask Dongfang Shuo before the palace hall—\nhe knows both its place and its name.\n\n**126: Stone Channel**\n**Common Name:** Cold Bamboo Herb\n**Textual Name:** None recorded\nCold in nature. Kills parasites. Found in southern Jing. Resembles bamboo sprouts, long in growth.\n\n**Song:**",
      "overlap_context": "ed\nCold in nature. Found in the Lingwai Circuit. Like small indigo, leaves long and pointed. Treats lung paralysis.\n\n**Song:**\nRow upon row, it rises by the stream in verdant shoots,\nits power unyielding, equal to the eight minerals.\nIn every crucible, only a pinch is needed—\nelse, like all things, it must be burned in the fire.\n\n**120: Lute Mushroom**\n**Common Name:** Hanger-On\n**Textual Name:** *Baitian*\nCold in nature. Found in Yunnan. Leaves round and long, bearing seeds. Treats severe wind.",
      "start_char": 11600,
      "end_char": 12118,
      "start_sentence": 1089,
      "end_sentence": 1137,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.994918823242188,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 30,
      "original_text": "遍地敷天长翠根，功能定魄又安魂。 但是人家三月种，此户当知足子孙。 野成荷第－百二十七 俗为盘草，书无名。 性冷。 出淮南道。 叶大如盘，有根子。 歌曰： 全身长养在溪傍，诏取张骞问本乡。 采得根苗一时锉，又能煮白恶丹阳。 含金枝第一百二十八 俗为紫檀，书无名。 性温。 出岭南。 树有金影。 治五般蛇毒。 歌曰： 排金金影影重重，此树人间不易逢。 臣到鳌山山北面，真人亲手赐玄锺。 地脉第一百二十九 俗为茨芋，书无名。 性冷，出在五湖。 叶长一尺，根同。 治一切热病。 歌曰： 温凉日月浸长天，好药人间自满田。 八石之中安少许，永知金骨骨长存。 金影铜第一百三十 俗为黄杨木，书无名。 性冷。 出茂州。 能治大风。 歌日： 林林万木凡木盛，唯有此真圣眼穿。 若欲采时玉龙入，不得如常似等闲。 潭沉草第一百三十－ 俗为支颐天，书无名。 性冷。 出锦州。",
      "translated_text": "**Song:**\nIts emerald roots spread across earth and sky,\nits power settles the po and anchors the hun.\nWherever planted in the third month’s season,\nthat household’s descendants shall prosper.\n\n**127: Wild Lotus**\n**Common Name:** Tray Herb\n**Textual Name:** None recorded\nCold in nature. Found in Huainan Circuit. Leaves as large as platters, bearing rootlets.\n\n**Song:**\nIts whole body grows and thrives by the streamside—\nsummon Zhang Qian to ask of its native land.\nOnce gathered, chop root and stem together,\nand it can boil white the foulest cinnabar sores.\n\n**128: Gold-Encrusted Branch**\n**Common Name:** Red Sandalwood\n**Textual Name:** None recorded\nWarm in nature. Found in Lingnan. The tree casts a golden sheen. Treats the five kinds of snake venom.\n\n**Song:**\nLayer upon layer, gold upon golden sheen,\nthis tree is rarely met with among men.\nWhen your servant reached Mount Ao’s northern face,\nthe Perfected One himself bestowed the dark gong.\n\n**129: Earth Vein**\n**Common Name:** Thorn Taro\n**Textual Name:** None recorded\nCold in nature, found in the Five Lakes. Leaves and roots each a foot long. Treats all heat illnesses.\n\n**Song:**\nWarm and cool, sun and moon soak the boundless sky,\nfine herbs fill the fields of the human realm.\nAdd but a pinch among the Eight Stones—\nforever shall your golden bones endure.\n\n**130: Golden Sheen Copper**\n**Common Name:** Boxwood\n**Textual Name:** None recorded\nCold in nature. Found in Maozhou. Can treat leprosy.\n\n**Song:**\nAmid the thriving forests of myriad trees,\nonly this one pierces the sage’s discerning eye.\nWhen you seek to gather it, the Jade Dragon enters—\ndo not treat it as common or take it lightly.\n\n**131: Deep Pool Grass**\n**Common Name:** Chin-Rest Heaven\n**Textual Name:** None recorded\nCold in nature. Found in Jinzhou.",
      "overlap_context": "n color, without stem or stalk, unaligned with the seasons, and does not treat illness.\n\n**Song:**\nWhen it sprouts in spring, it is mostly yellow-white;\nwhen it sprouts in summer or autumn, it bears black and green.\nOnly ask Dongfang Shuo before the palace hall—\nhe knows both its place and its name.\n\n**126: Stone Channel**\n**Common Name:** Cold Bamboo Herb\n**Textual Name:** None recorded\nCold in nature. Kills parasites. Found in southern Jing. Resembles bamboo sprouts, long in growth.\n\n**Song:**",
      "start_char": 12118,
      "end_char": 12527,
      "start_sentence": 1138,
      "end_sentence": 1176,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.511424541473389,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 31,
      "original_text": "叶细茎长，色青黄。 治凛。 歌日： 沉沉细草绕闲溪，委叶抽条傍水坻。 无限真人吃仙去，二亲曾赠右军妻。 紫殿第一百三十二 俗为负霜花，书无名。 出河北道。 叶指面大，紫茎。 治焦热。 歌曰： 玉阳宫女学藏钩，紫殿藏形形自收。 飞得九天天女局，仙经抄出至今留。 武阳种第一百三十三 俗为连天草，书无名。 性温。 出昆仑。 苗长叶细。 治骨瘫。 歌日： 纤纤细草武阳种，生苗引稼避春风。 大药药中功最甚，见水不得莫从容。 尖玉第一百三十四 俗为人寿，书无名。 性冷。 叶大如手，似车前。 治马癖。 歌日： 绕湖水涧入天山，苗高数尺叶尖圆。 白金一片如霜在，亦是灵芳岂得全。 不月芝第一百三十五 俗为无菌，书无名。 性温。 天下有。 色紫赤，无茎。 治恶疮。 歌日： 阴阳繁气自然生，不受阴阳一月情。 能共水银相压伏，阳王当共失柔情。 海通第一百三十六 俗为颜芝，书无名。 性温。 出岭外。 叶如通背白。 治经脉不调。 歌曰：",
      "translated_text": "**131: Deep Pool Grass (continued)**\nLeaves fine, stems long, color blue-green tinged with yellow. Treats shivering cold.\n\n**Song:**\nSubtle grasses cluster by the quiet stream,\ndrooping leaves and slender shoots beside the water’s edge.\nCountless immortals have consumed and ascended—\nonce bestowed by parents upon the wife of Right Army.\n\n**132: Purple Palace**\n**Common Name:** Frost-Bearing Flower\n**Textual Name:** None recorded\nFound in Hebei Circuit. Leaves the size of a palm, purple stems. Treats scorching heat.\n\n**Song:**\nJade Yang Palace maidens play at hidden hooks,\nthe Purple Palace conceals its form, its shape withdrawn.\nHaving flown to the Nine Heavens’ celestial court,\nthe immortal scriptures transcribed remain to this day.\n\n**133: Wuyang Seed**\n**Common Name:** Sky-Connecting Grass\n**Textual Name:** None recorded\nWarm in nature. Found on Kunlun. Shoots long, leaves fine. Treats bone paralysis.\n\n**Song:**\nDelicate Wuyang grass, its seedlings stretch to avoid the spring wind.\nAmong great medicines, its efficacy is most profound—\nmeet water and you must not delay.\n\n**134: Pointed Jade**\n**Common Name:** Human Longevity\n**Textual Name:** None recorded\nCold in nature. Leaves large as a hand, resembling plantain. Treats horse ringworm.\n\n**Song:**\nWinding through lake streams into the Tian Mountains,\nshoots rise several feet, leaves pointed and round.\nA slice of white gold, like frost abiding—\nis this not a numinous fragrance, yet how can it be whole?\n\n**135: Moonless Ganoderma**\n**Common Name:** Germ-Free\n**Textual Name:** None recorded\nWarm in nature. Found throughout the world. Color purple-red, stemless. Treats malignant sores.\n\n**Song:**\nYin and Yang’s abundant qi naturally engenders it,\nunbound by the moon’s duality of light and dark.\nIt can suppress and subdue mercury—\nthe Yang King shall then lose his tender affection.\n\n**136: Sea Passage**\n**Common Name:** Face Ganoderma\n**Textual Name:** None recorded\nWarm in nature. Found beyond the mountain ranges. Leaves like white *tongbei*. Regulates menstrual irregularities.\n\n**Song:**",
      "overlap_context": "r shall your golden bones endure.\n\n**130: Golden Sheen Copper**\n**Common Name:** Boxwood\n**Textual Name:** None recorded\nCold in nature. Found in Maozhou. Can treat leprosy.\n\n**Song:**\nAmid the thriving forests of myriad trees,\nonly this one pierces the sage’s discerning eye.\nWhen you seek to gather it, the Jade Dragon enters—\ndo not treat it as common or take it lightly.\n\n**131: Deep Pool Grass**\n**Common Name:** Chin-Rest Heaven\n**Textual Name:** None recorded\nCold in nature. Found in Jinzhou.",
      "start_char": 12527,
      "end_char": 12972,
      "start_sentence": 1177,
      "end_sentence": 1222,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.116797924041748,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 32,
      "original_text": "先朝太后教人采，自后人问更不寻。 莫说金丹丹内用，人问若得过於金。 吴网草第一百三十七 俗书无名。 性毒。 出江淮。 成树，叶如两指。 治赞盘。 歌日： 叶叶能生生似月，服之得本便神仙。 况共还丹同煮炼，金骨如何不得全。 吴梨芦第一百三十八 书俗同一名。 性温。 出江南。 有蔓引枝。 治金疮。 歌日： 蓱蓱引蔓叶如藤，汞中最巧又多能。 打薄不成但更煮，还须软腻引如绳。 吴粟随第一百三十九 俗为间芝，书无名。 性温，有毒。 出云南。 细叶有子。 治泠病。 歌日：",
      "translated_text": "**137: Wu Net Grass**\n**Common Name:** None recorded in common texts\n**Textual Name:** None recorded\nToxic in nature. Found in the Jiang-Huai region. Grows into a tree, leaves like two fingers. Treats *zanpan*.\n\n**Song:**\nLeaf upon leaf, life-generating like the moon,\ningesting it restores one’s root—becoming an immortal.\nMoreover, when refined with the returning elixir,\nhow could golden bones not be made whole?\n\nThe Empress Dowager of the former dynasty commanded its gathering,\nbut after her reign, none sought it again.\nDo not speak of its use within the golden elixir—\nif known to others, it would be prized beyond gold.\n\n**138: Wu Pear Reed**\n**Common Name & Textual Name:** Identical\nWarm in nature. Found in Jiangnan. Vines extend with branches. Treats metal-inflicted wounds.\n\n**Song:**\nLush vines trail, leaves like rattan,\nmost skillful in mercury, versatile in function.\nPounded thin, it fails—boil it further,\nthen it softens, pliable as a rope.\n\n**139: Wu Millet Vine**\n**Common Name:** Interval Ganoderma\n**Textual Name:** None recorded\nWarm in nature, toxic. Found in Yunnan. Slender leaves with seeds. Treats *leng* disease.\n\n**Song:**",
      "overlap_context": "n nature. Found throughout the world. Color purple-red, stemless. Treats malignant sores.\n\n**Song:**\nYin and Yang’s abundant qi naturally engenders it,\nunbound by the moon’s duality of light and dark.\nIt can suppress and subdue mercury—\nthe Yang King shall then lose his tender affection.\n\n**136: Sea Passage**\n**Common Name:** Face Ganoderma\n**Textual Name:** None recorded\nWarm in nature. Found beyond the mountain ranges. Leaves like white *tongbei*. Regulates menstrual irregularities.\n\n**Song:**",
      "start_char": 12972,
      "end_char": 13223,
      "start_sentence": 1223,
      "end_sentence": 1249,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.178506851196289,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 33,
      "original_text": "金章乱引碧英花，吴蜀生时各两家。 恰至采时须致意，采时不得日光斜。 绕崖还第一百四十 俗为略杓苗，书无名。 出蜀。 有引蔓，带子。 治漏疮。 歌曰： 章敬天皇天女仙，因得兹灵得上天。 今朝既识三真草，必知朝见旧羲轩。 金花舟第一百四十一 俗为拜妇芝，书无名。 性冷。 出渭南。 尖叶茎长。 治诸风。 歌曰： 登登红叶绕青冥，万朵英花□地生。 采取之时问方朔，唯君不得犯神灵。 绕河公第一百四十二 俗为赤柳，书无名。 性冷。 出梓州。 如树。 亦治癖结块。 歌曰： 仙人自美种天台，每岁真人密遣开。 方朔去年家亦有，诏看何不进将来。 菵草第一百四十三 俗书无名。",
      "translated_text": "**140: Rao Ya Huan**\n**Common Name:** Lue Shao Sprout\n**Textual Name:** None recorded\nFound in Shu. Vines extend with seeds. Treats leaking sores.\n\n**Song:**\nGolden petals tangled with jade blossoms,\nWu and Shu each yield two kinds.\nWhen gathering, take care—\ndo not let the sunlight slant.\n\n**140: Rao Ya Huan (alternate entry)**\n**Song:**\nThe Sacred Emperor’s heavenly maiden,\nby this spirit herb ascended to heaven.\nNow that you know the Three Perfected Grasses,\nyou shall surely meet the ancient Xihe’s chariot.\n\n**141: Golden Flower Boat**\n**Common Name:** Worshipping Woman’s Ganoderma\n**Textual Name:** None recorded\nCold in nature. Found in Weinan. Pointed leaves, long stems. Treats all wind disorders.\n\n**Song:**\nLayered red leaves embrace the azure void,\nten thousand blossoms bloom from the earth.\nWhen gathering, consult Master Fangshuo—\nonly you must not offend the spirits.\n\n**142: Rao He Gong**\n**Common Name:** Red Willow\n**Textual Name:** None recorded\nCold in nature. Found in Zizhou. Tree-like. Also treats accumulations and hard masses.\n\n**Song:**\nThe immortal praised the seeds of Mount Tiantai,\neach year the Perfected One secretly commands their opening.\nFangshuo took some home last year—\nwhy did he not present them when summoned?\n\n**143: Wang Grass**\n**Common Name & Textual Name:** None recorded",
      "overlap_context": "ommon Name & Textual Name:** Identical\nWarm in nature. Found in Jiangnan. Vines extend with branches. Treats metal-inflicted wounds.\n\n**Song:**\nLush vines trail, leaves like rattan,\nmost skillful in mercury, versatile in function.\nPounded thin, it fails—boil it further,\nthen it softens, pliable as a rope.\n\n**139: Wu Millet Vine**\n**Common Name:** Interval Ganoderma\n**Textual Name:** None recorded\nWarm in nature, toxic. Found in Yunnan. Slender leaves with seeds. Treats *leng* disease.\n\n**Song:**",
      "start_char": 13223,
      "end_char": 13530,
      "start_sentence": 1250,
      "end_sentence": 1279,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.811527729034424,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 34,
      "original_text": "性毒。 出蜀地。 成树，叶大如两指。 治疮癣。 歌日： 长生远地生灵草，能共还丹一处行。 不与诸方兼色润，唯能善合水银情。 藜芦第一百四十四 俗书无名。 性温。 出蜀。 有蔓引。 皮治金疮。 歌曰： 名山深处有，日月照中生。 还为丹辅佐，朱生不敢争。 续随草第一百四十五 俗为问芝，书无名。 性毒。 细叶有子。 治泠。 歌曰： 地满千河广，山含百草灵。 从兹九天到，山涯见玉京。 元卷更诸色药，无歌，共八十五味，如后。 天将将、大猪猪、乾女芝、乌飞、鸾花、秦女罗、虾菜、天女衣、浮真、孤儿、三泉菜、九尾虫、秦真人、雷葱、青青、玉女花、天生芝、镂玉草、孤羊、茵花、零零草、防石消、白马菜、石剑、天都、水紫苏、妇羞芝、人面菜、石母、孤蒿、陈公车、水巨胜、辅鱼脂、天筒、鬼幕、江猪耳 、秦地班、苦瓢花、羊尾、狗耳 、归末草、白杨芝、白鲜皮、鬼芋、单煎、武阳种、团锦衣、寒加草、芋茵、大段、二尺颊、万里长、御酒醒、苟艾、苟椒、白茂树、金影同、天堂女、神荆、细辛、紫苦味、陈后蕈、高羊尾、南风、红母、草常春、瘴天树、拜妇芝、石花、石芝、芙人春、芦灵草、奉真人、竹堂、紫檀、秦女芝、山紫苏、狗衔草、天台树草、山姑草、铜蹄蔓、皱面草、霖雨淫草、白花木、紫神芝。 右计八十五味。 白萝频第一百四十六 俗为云芝，书为紫扇。 性善。 出岭南。 叶如油拨圆缺，苗紫青不定。 生戊丁，萎甲壬。 高数尺。",
      "translated_text": "**Toxic in nature.** Found in Shu lands. Grows into a tree; leaves as wide as two fingers. Treats sores and ringworm.\n\n**Song:**\nThe immortal herb grows in distant lands,\njourneying alongside the returning elixir.\nUnlike other remedies with lustrous hues,\nit alone harmonizes well with mercury’s nature.\n\n**144: Li Lu**\n**Common Name:** None recorded in texts.\n**Warm in nature.** Found in Shu. Has trailing vines. Its bark treats metal-inflicted wounds.\n\n**Song:**\nDeep within the sacred mountains it dwells,\nborn where sun and moon shine through.\nAs an assistant to the cinnabar,\neven cinnabar itself dare not contend.\n\n**145: Xu Sui Grass**\n**Common Name:** Questioning Ganoderma\n**Textual Name:** None recorded\n**Toxic in nature.** Slender leaves with seeds. Treats cold disorders.\n\n**Song:**\nThe earth spans a thousand rivers wide,\nthe mountains cradle a hundred herbs divine.\nFrom here to the Nine Heavens’ height,\non the mountain’s edge, the Jade Capital shines.\n\n**Additional Miscellaneous Herbs (85 in total, without songs, listed below):**\nHeavenly General, Great Boar, Celestial Maiden Ganoderma, Black Flight, Luan Blossom, Qin Woman’s Net, Shrimp-Fin Vegetable, Heavenly Maiden’s Robe, Floating Perfection, Orphan, Three Springs Vegetable, Nine-Tailed Insect, Qin Perfected One, Thunder Onion, Azure Azure, Jade Maiden Flower, Heaven-Born Ganoderma, Jade-Carving Grass, Solitary Goat, Mat Flower, Lingering Grass, Stone-Dissolving Herb, White Horse Vegetable, Stone Sword, Heavenly Capital, Water Purple Perilla, Shy Woman’s Ganoderma, Human-Face Vegetable, Stone Mother, Solitary Mugwort, Chen Gong’s Chariot, Water Giant Victory, Assisting Fish Fat, Heavenly Tube, Ghost’s Curtain, River Pig’s Ear, Qin Land’s Spots, Bitter Gourd Flower, Sheep’s Tail, Dog’s Ear, Returning End Grass, White Poplar Ganoderma, Dictamnus Root-Bark, Ghost Taro, Single Decoction, Wu Yang Seed, Brocade Robe, Cold-Adding Grass, Taro Mat, Great Segment, Two-Foot Cheek, Ten Thousand Li Long, Imperial Wine-Soberer, Dog Mugwort, Dog Pepper, White Luxuriant Tree, Golden Shadow Companion, Heavenly Hall Woman, Divine Chaste Tree, Asarum, Purple Bitter Taste, Chen Empress’ Mushroom, Tall Sheep’s Tail, Southern Wind, Red Mother, Ever-Spring Grass, Miasma Heaven Tree, Worshipping Woman’s Ganoderma, Stone Flower, Stone Ganoderma, Hibiscus Woman’s Spring, Reed Spirit Grass, Offering Perfected One, Bamboo Hall, Red Sandalwood, Qin Woman’s Ganoderma, Mountain Purple Perilla, Dog-Holding Grass, Tiantai Mountain Herb, Mountain Maiden Grass, Bronze Hoof Vine, Wrinkled-Face Grass, Excessive Rain Grass, White Flower Tree, Purple Divine Ganoderma.\n\n**Total: 85 herbs.**\n\n**146: Bai Luo Pin**\n**Common Name:** Cloud Ganoderma\n**Textual Name:** Purple Fan\n**Benign in nature.** Found in Lingnan. Leaves resemble round or notched oil palm; stems vary between purple and green. Born in *wu-ding* (earth-metal) and *yi-ding* (fire-metal) years, withers in *jia-ren* (wood-metal) years. Grows several *chi* tall.",
      "overlap_context": "g, consult Master Fangshuo—\nonly you must not offend the spirits.\n\n**142: Rao He Gong**\n**Common Name:** Red Willow\n**Textual Name:** None recorded\nCold in nature. Found in Zizhou. Tree-like. Also treats accumulations and hard masses.\n\n**Song:**\nThe immortal praised the seeds of Mount Tiantai,\neach year the Perfected One secretly commands their opening.\nFangshuo took some home last year—\nwhy did he not present them when summoned?\n\n**143: Wang Grass**\n**Common Name & Textual Name:** None recorded",
      "start_char": 13530,
      "end_char": 14139,
      "start_sentence": 1280,
      "end_sentence": 1315,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.400832891464233,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 35,
      "original_text": "治滑痢。 应白露节，立秋五日采之。 歌日： 不高数尺叶如油，常在高山上岭头。 此物虽生立春后，用之力足待经秋。 青天心第一百四十七 俗为白微，书为单蒿。 性凉。 生于阗国。 叶如蒿，三瓣成枝，青黄花。 生甲戊，死丁壬。 治中伤。 应立冬节，白露后采之上。 歌曰： 花如金色绕山开，叶成三片剪刀裁。 计会水银成活后，兼能善作大还媒。 凤凰窠第一百四十八 俗为山竹，书为负雪容。 性冷。 出南天竺国。 叶如竹，枝如木，如葱尾，花紫。 生甲丁，死戊己。 治反花疮。 应处暑节，立夏后采用。 歌日： 叶如寒竹傍崖生，亦在人家亦在庭。 花带紫绯开不定，可怜光彩四时荣。 赤萝藤第一百四十九 俗呼赤苹草，书为地心。 性冷，味苦。 形如桐叶，色紫赤。 出新罗国。 治逆疮。 生戊壬，死丁癸，应小寒节，立春后采之。 歌日： 叶如绯榜绕栏生，亦在山头亦在庭。 欲谢但知投九水，水中自识紫芝灵。 白鸾相第一百五十 俗呼三叶草，书为紫余。 性和诸药。 生中天竺国。 无枝，三叶。 生戊庚。 治劳疾。 应芒种节，立秋后采之。 歌日： 蔓开三叶叶纤纤，半在池傍半在岩。 欲识但经和日煮，月过成炼以为咸。 扫天鱼第一百五十一 俗为碧章芝，书为绢文草。 性寒冷。 出瑞州。 叶如指面，不高数尺。 生甲戊，死丙丁。 治水病。 应立冬节，冬至后采。 歌日： 溪生文理绯绢字，周□年年叶转青。 摘日用时须忌讳，忌讳无过见水精。 奉真人第一百五十二 俗为水结，书为黄茨。 性热。 出岱州。 叶绿有子。 生甲丁，死癸己。",
      "translated_text": "**147: Qing Tian Xin**\n**Common Name:** White Lofty\n**Textual Name:** Single Mugwort\n**Cool in nature.** Found in Khotan. Leaves resemble mugwort, with three lobes forming branches; flowers are greenish-yellow. Born in *jia-wu* (wood-earth) years, withers in *ding-ren* (fire-water) years. **Treats internal injuries.** Harvest before the White Dew solar term, after the Start of Autumn. *Song:*\n*Not tall, leaves like oil’s sheen,*\n*Ever on high peaks, ridge tops unseen.*\n*Though born when spring’s first breath is true,*\n*Its power waits till autumn’s due.*\n\n**148: Feng Huang Ke**\n**Common Name:** Mountain Bamboo\n**Textual Name:** Snow-Bearing Countenance\n**Cold in nature.** Found in Southern India. Leaves resemble bamboo, branches like wood, tips like scallions; flowers are purple. Born in *jia-ding* (wood-fire) years, withers in *wu-ji* (earth-earth) years. **Treats proliferating sores.** Harvest before the Limit of Heat solar term, after the Start of Summer. *Song:*\n*Leaves like winter bamboo cling to cliffs so steep,*\n*In gardens too, or courts where mortals keep.*\n*Flowers purple-red, inconstant bloom,*\n*Yet radiant glory fills all seasons’ gloom.*\n\n**149: Chi Luo Teng**\n**Common Name:** Red Apple Grass\n**Textual Name:** Earth’s Heart\n**Cold in nature, bitter in taste.** Shape resembles paulownia leaves, color purple-red. Found in Silla. **Treats inverted sores.** Born in *wu-ren* (earth-water) years, withers in *ding-gui* (fire-water) years. Harvest before the Lesser Cold solar term, after the Start of Spring. *Song:*\n*Leaves like red silk twine round balustrades,*\n*On mountain peaks or courts where light pervades.*\n*To fade, cast it in ninefold streams—*\n*There, in the waters, its spirit gleams.*\n\n**150: Bai Luan Xiang**\n**Common Name:** Three-Leaf Grass\n**Textual Name:** Purple Remnant\n**Harmonizes with all medicines.** Found in Central India. Leafless, with three leaves. Born in *wu-geng* (earth-metal) years. **Treats consumptive illnesses.** Harvest before the Grain in Ear solar term, after the Start of Autumn. *Song:*\n*Vines unfurl three leaves, so slender, slight,*\n*Half by the pool, half on the rocky height.*\n*To know it, boil in sunlit hours,*\n*Then refine by moon to salt’s pure powers.*\n\n**151: Sao Tian Yu**\n**Common Name:** Azure-Stem Ganoderma\n**Textual Name:** Silk-Patterned Grass\n**Cold in nature.** Found in Ruizhou. Leaves like fingerprints, growing several *chi* tall. Born in *jia-wu* (wood-earth) years, withers in *bing-ding* (fire-fire) years. **Treats water diseases.** Harvest before the Start of Winter solar term, after the Winter Solstice. *Song:*\n*By streams, its veins like silk in crimson script,*\n*Year after year, its leaves turn verdant, stripped.*\n*When plucking, heed the taboos well,*\n*Lest water’s essence break the spell.*\n\n**152: Feng Zhen Ren**\n**Common Name:** Water Knot\n**Textual Name:** Yellow Bramble\n**Hot in nature.** Found in Daizhou. Leaves green with seeds. Born in *jia-ding* (wood-fire) years, withers in *gui-ji* (water-earth) years. *Song:*\n*Flowers like gold unfurl on mountains wide,*\n*Leaves in three blades, as if by scissors tied.*\n*When quicksilver’s life is sealed anew,*\n*It crafts the Great Return’s elixir true.*",
      "overlap_context": "ountain Herb, Mountain Maiden Grass, Bronze Hoof Vine, Wrinkled-Face Grass, Excessive Rain Grass, White Flower Tree, Purple Divine Ganoderma.\n\n**Total: 85 herbs.**\n\n**146: Bai Luo Pin**\n**Common Name:** Cloud Ganoderma\n**Textual Name:** Purple Fan\n**Benign in nature.** Found in Lingnan. Leaves resemble round or notched oil palm; stems vary between purple and green. Born in *wu-ding* (earth-metal) and *yi-ding* (fire-metal) years, withers in *jia-ren* (wood-metal) years. Grows several *chi* tall.",
      "start_char": 14139,
      "end_char": 14805,
      "start_sentence": 1316,
      "end_sentence": 1380,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.054007053375244,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 36,
      "original_text": "治牙疼。 应寒露节，小暑后采。 歌日： 茎茎白色绕山崖，重重开叶傍花排。 绿水池边安少许，青丹从此绝尘埃。 天周芝第一百五十三 俗呼石柳，书为地芝。 性热。 出陇右。 形如杨柳，不高数尺。 歌曰： 枝同杨柳色青青，秋景凋零春景荣。 不遇至人亲指引，纵能何处觅清名。 水桃第一百五十四 俗为绿红，书为英芝。 性温。 出江州庐山。 生．戊丁，死庚己。 形如桃，近水生。 治瘫。 应大寒节，春分后采之。 歌曰： 灵芝异草出灵山，立干生於曲涧泉。 好用英华散水气，采时须得受春暄。 幽微芳第一百五十五 俗为石髓，书为地微。 性冷。 生湖南。",
      "translated_text": "**153: Heaven’s Circlet Zhi**\n**Common Name:** Stone Willow\n**Textual Name:** Earth Zhi\n**Hot in nature.** Found in Longyou. Resembles a willow, several *chi* tall. **Treats toothache.** Harvest after the Cold Dew solar term, before Minor Heat. *Song:*\n*Stem upon stem, white, clinging to cliffs,*\n*Leaf upon leaf, arrayed beside blossoms.*\n*Place a pinch by green-watered pools—*\n*From this, the Azure Elixir sheds all dust.*\n\n**154: Water Peach**\n**Common Name:** Green-Red\n**Textual Name:** Heroic Zhi\n**Warm in nature.** Found on Mount Lu in Jiangzhou. Born in *wu-ding* (earth-fire) years, withers in *geng-ji* (metal-earth) years. Resembles a peach, grows near water. **Treats paralysis and spasms.** Harvest after the Great Cold solar term, before the Spring Equinox. *Song:*\n*Wondrous zhi, rare herb of sacred peaks,*\n*Its trunk stands by winding stream and spring.*\n*Best used to disperse water’s qi with its bloom—*\n*Gather it only when spring’s warmth is full.*\n\n**155: Subtle Fragrance**\n**Common Name:** Stone Marrow\n**Textual Name:** Earth Subtlety\n**Cold in nature.** Found in Hunan.",
      "overlap_context": "ped.*\n*When plucking, heed the taboos well,*\n*Lest water’s essence break the spell.*\n\n**152: Feng Zhen Ren**\n**Common Name:** Water Knot\n**Textual Name:** Yellow Bramble\n**Hot in nature.** Found in Daizhou. Leaves green with seeds. Born in *jia-ding* (wood-fire) years, withers in *gui-ji* (water-earth) years. *Song:*\n*Flowers like gold unfurl on mountains wide,*\n*Leaves in three blades, as if by scissors tied.*\n*When quicksilver’s life is sealed anew,*\n*It crafts the Great Return’s elixir true.*",
      "start_char": 14805,
      "end_char": 15090,
      "start_sentence": 1381,
      "end_sentence": 1408,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.912133455276489,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 37,
      "original_text": "叶小花细。 生戊丁，死甲乙。 治胸隔气热。 应立秋节，处暑后采之。 歌日： 丛丛细叶小花排，亦在平坡亦在崖。 剪出西王南架草，审看茎脚小於钗。 绿重重第一百五十六 俗为重台草，书为茨影子。 性温。 出陇右。 叶小大重迭。 生丙丁，死庚己。 治恶疮。 应芒种节，立春后采。 歌日： 叶中有果最多功，天上人问一样同。 采摘之时须净洁，易中将用应屯蒙。 山锦芝第一百五十七 俗为山云台，书为九孔菜。 性冷。 出咸阳。 枝叶一如云台。 生甲丁，死卯酉。 治一切热风。 应冬至节，惊蛰后采之。 歌曰： 枝条体本绕山岚，亦在崖中亦在潭。 若向花中频煮后，即知从此味能甘。 缕金寒第一百五十八 俗为紫石苹，书为江蕲。 性温。 有毒。 出终南山。 叶如蔚出，茎紫。 生戊丁，死乙癸。 治气肿。 应立秋节，立冬后采之。 歌曰： 月光金阁引真人，第三池内最多神。 恰是立冬冬后采，采时须避鹤呜群。 贝殊紫第一百五十九 俗为风石蔓，书为地油。 性冷。 出白马山。 叶圆引蔓。 生甲乙，死戊己。 治急劳。 应小寒节，春分后采之。 歌曰： 引蔓排枝叶叶圆，可怜生处傍崖泉。 八石不应无用日，用时须待绿芙研。 鹤春芝第一百六十 俗为乌脚鸡草，书为细芝草。 性热。 出荆州。 叶小枝茎细。 生戊壬，死甲乙。 治滑痢。 应夏至节，小暑后采之。 歌曰：",
      "translated_text": "**155: Subtle Fragrance (continued)**\nLeaves small, flowers delicate. Born in *wu-ding* (earth-fire) years, withers in *jia-yi* (wood-wood) years. **Treats chest and diaphragm heat-qi.** Harvest after the Start of Autumn solar term, before the Limit of Heat. *Song:*\n*Clustered fine leaves, tiny blossoms arrayed,*\n*On level slopes or cliffs they are laid.*\n*Like grass from Queen Mother’s western bower,*\n*Examine the stem—slender as a hairpin’s power.*\n\n**156: Verdant Layers**\n**Common Name:** Layered Terrace Grass\n**Textual Name:** Bramble Shadow\n**Warm in nature.** Found in Longyou. Leaves small and layered. Born in *bing-ding* (fire-fire) years, withers in *geng-ji* (metal-earth) years. **Treats malignant sores.** Harvest after the Grain in Ear solar term, before the Start of Spring. *Song:*\n*Leaves bearing fruit hold the greatest might,*\n*Heaven and earth share this same sight.*\n*When gathering, keep it pure and bright—*\n*For ease in use, align with *zhun-meng’s* light.*\n\n**157: Mountain Brocade Zhi**\n**Common Name:** Mountain Cloud Terrace\n**Textual Name:** Nine-Hole Vegetable\n**Cold in nature.** Found in Xianyang. Branches and leaves resemble *yuntai*. Born in *jia-ding* (wood-fire) years, withers in *mao-you* (wood-metal) years. **Treats all heat-winds.** Harvest after the Winter Solstice, before the Waking of Insects. *Song:*\n*Branches coil where mountain mists entwine,*\n*By cliffs or pools they softly shine.*\n*If in flowers they’re boiled awhile,*\n*Their taste reveals a sweetness mild.*\n\n**158: Threaded Gold Cold**\n**Common Name:** Purple Stone Duckweed\n**Textual Name:** River Qi\n**Warm in nature.** Toxic. Found on Mount Zhongnan. Leaves like *wei*, stems purple. Born in *wu-ding* (earth-fire) years, withers in *yi-gui* (wood-water) years. **Treats qi-swelling.** Harvest after the Start of Autumn, before the Start of Winter. *Song:*\n*Moonlight on golden towers guides the true,*\n*The third pool’s depths hold spirits anew.*\n*Just at Start of Winter’s turn,*\n*Gather when cranes’ cries cease to burn.*\n\n**159: Cowrie Purple**\n**Common Name:** Wind Stone Vine\n**Textual Name:** Earth Oil\n**Cold in nature.** Found on White Horse Mountain. Leaves round, vines trailing. Born in *jia-yi* (wood-wood) years, withers in *wu-ji* (earth-earth) years. **Treats acute exhaustion.** Harvest after the Lesser Cold solar term, before the Spring Equinox. *Song:*\n*Vines spread, round leaves in rows align,*\n*By cliffside springs they softly twine.*\n*Though Eight Stones may seem of no worth,*\n*Grind with green lotus for rebirth.*\n\n**160: Crane Spring Zhi**\n**Common Name:** Crow’s-Foot Chicken Grass\n**Textual Name:** Fine Zhi Grass\n**Hot in nature.** Found in Jingzhou. Leaves small, stems slender. Born in *wu-ren* (earth-water) years, withers in *jia-yi* (wood-wood) years. **Treats chronic diarrhea.** Harvest after the Summer Solstice, before the Lesser Heat. *Song:*\n*Slender stems with leaves so slight,*\n*By waterside they catch the light.*\n*When summer’s heat begins to wane,*\n*Gather then to ease the pain.*",
      "overlap_context": "hers in *geng-ji* (metal-earth) years. Resembles a peach, grows near water. **Treats paralysis and spasms.** Harvest after the Great Cold solar term, before the Spring Equinox. *Song:*\n*Wondrous zhi, rare herb of sacred peaks,*\n*Its trunk stands by winding stream and spring.*\n*Best used to disperse water’s qi with its bloom—*\n*Gather it only when spring’s warmth is full.*\n\n**155: Subtle Fragrance**\n**Common Name:** Stone Marrow\n**Textual Name:** Earth Subtlety\n**Cold in nature.** Found in Hunan.",
      "start_char": 15090,
      "end_char": 15668,
      "start_sentence": 1409,
      "end_sentence": 1469,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.17292594909668,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 38,
      "original_text": "镂出西王裙带花，枝茎纤细出仙家。 采摘之时须净洁，仍忧金影向西斜。 石节第一百六十一 俗为寒种，书为拥春。 性热。 出蓝田县。 叶大锐，枝紫有节。 生癸己，死子午。 治心痛。 应白露节，立冬后采之。 歌日： 叶如桑叶茎如节，爱向巅崖崖上生。 若向人间能辟鬼，又能天上慑神灵。 右已前应节候六甲玲热探之灵。 石椿第一百六十二 俗为景芝，书为黄风。 出江南道。 治心呕逆。 歌曰： 枝枝抽蔓傍崖岩，海脉滋通味带咸。 万出紫阳天上草，堪将人世煮红盐。 石胡蔓第一百六十三 俗为九田，书为天周。 出贝州。 治妳瘫。",
      "translated_text": "**161: Stone Joint Zhi**\n**Common Name:** Cold Seed\n**Textual Name:** Embracing Spring\n**Hot in nature.** Found in Lantian County. Leaves large and pointed, stems purple with nodes. Born in *gui-ji* (water-earth) years, withers in *zi-wu* (water-fire) years. **Treats heart pain.** Harvest after the White Dew solar term, before the Beginning of Winter. *Song:*\n*Leaves like mulberry, stems like joints,*\n*Loving to grow on lofty cliffs’ heights.*\n*If brought among men to repel ghosts,*\n*It can also in heaven subdue spirits.*\n\n**The preceding entries correspond to solar terms, the Six Jia cycles, and the numinous subtleties of cold and heat.**\n\n**162: Stone Toon Zhi**\n**Common Name:** Scenic Zhi\n**Textual Name:** Yellow Wind\nFound in the Jiangnan Circuit. **Treats heart vomiting and counterflow.** *Song:*\n*Vines extend from branch to branch by cliffs,*\n*With ocean veins’ flow, its taste bears salt.*\n*A myriad herbs of Ziyang, heaven’s grass—*\n*Fit to boil with mortal red salt.*\n\n**163: Stone Pepper Vine Zhi**\n**Common Name:** Nine Fields\n**Textual Name:** Heavenly Circumference\nFound in Beizhou. **Treats paralysis and wilting.** *Song:*\n*Carved like the Queen Mother’s skirt sash,*\n*Slender stems from immortals’ abode.*\n*When gathering, purity must be kept—*\n*Still fear the golden shadow slanting west.*",
      "overlap_context": "or rebirth.*\n\n**160: Crane Spring Zhi**\n**Common Name:** Crow’s-Foot Chicken Grass\n**Textual Name:** Fine Zhi Grass\n**Hot in nature.** Found in Jingzhou. Leaves small, stems slender. Born in *wu-ren* (earth-water) years, withers in *jia-yi* (wood-wood) years. **Treats chronic diarrhea.** Harvest after the Summer Solstice, before the Lesser Heat. *Song:*\n*Slender stems with leaves so slight,*\n*By waterside they catch the light.*\n*When summer’s heat begins to wane,*\n*Gather then to ease the pain.*",
      "start_char": 15668,
      "end_char": 15941,
      "start_sentence": 1470,
      "end_sentence": 1494,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.654601097106934,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 39,
      "original_text": "歌日： 遥遥引蔓入天罗，后学仙君莫厌多。 采日采时防大雨，将行不用渡江波。 吟鹤枝第一百六十四 俗为石叶，书为问卢。 出代州。 一枝数叶，生石上。 治一切风冷。 歌曰： 龙芝凤出奇山，时居月碛傍崖巅。 空生柳坻明絮后，和汞一处用盐煎。 右已前性温热。 生甲壬，死乙癸。 应冬至节，立春后探之。 土竹第一百六十五 俗为金苹，书为更芝。 性冷。 出河北。 样如竹茎，青。 治喉闭。 生戊丁，死甲乙。 应大寒节，立冬后采之。 歌曰： 纤枝小叶色青青，天上人间有两名。 此物四时看不定，落花时节采多灵。 紫金英第一百六十六 俗为石心，书为鱼叶。 性热，有毒。 出罗州。 叶圆背紫。 治恶疮。 生甲己，死戊壬。 应春分节，立夏后采之。 歌日： 音世人问草，叶圆贝点朱。 还同玄内煮，沉石自然浮。 日水苏第一百六十七 俗为太平，书无名。 性温。 出陈许州。",
      "translated_text": "**163: Stone Pepper Vine Zhi (continued)**\n*Song:*\n*Vines stretch far into the celestial net,*\n*Later immortals, gather without disdain.*\n*Harvest at dawn, at noon—beware the storm,*\n*No need to cross the river’s waves again.*\n\n**164: Crane-Chanting Branch**\n**Common Name:** Stone Leaf\n**Textual Name:** Wenlu\nFound in Daizhou. **A single stem bears many leaves, growing on stone.** *Treats all wind-cold disorders.*\n*Song:*\n*Dragon’s zhi and phoenix’s plume from wondrous peaks,*\n*Dwelling by moonlit sands near cliffside heights.*\n*Born where willow catkins drift in empty light,*\n*Mix with mercury and boil with salt just right.*\n\n**The preceding entries are warm or hot in nature.**\n*Born under Jia and Ren, wither under Yi and Gui.*\n*Gather after the Winter Solstice, seek before the Start of Spring.*\n\n**165: Earth Bamboo**\n**Common Name:** Golden Apple\n**Textual Name:** Geng Zhi\n**Nature:** Cold\nFound in Hebei. **Appears like bamboo stems, green in color.** *Treats throat blockage.*\n*Born under Wu and Ding, wither under Jia and Yi.*\n*Gather after the Great Cold, seek before the Start of Winter.*\n*Song:*\n*Slender stems and tiny leaves of verdant hue,*\n*Known by two names—one celestial, one earthly true.*\n*This plant shifts unseen through all four seasons’ span,*\n*Most potent when gathered as blossoms begin.*\n\n**166: Purple Gold Bloom**\n**Common Name:** Stone Heart\n**Textual Name:** Fish Leaf\n**Nature:** Hot, toxic\nFound in Luozhou. **Leaves round with purple undersides.** *Treats malignant sores.*\n*Born under Jia and Ji, wither under Wu and Ren.*\n*Gather after the Spring Equinox, seek before the Start of Summer.*\n*Song:*\n*When mortals ask of this herb’s name,*\n*Its leaves are round with crimson specks like shells.*\n*Boiled as in the darkest depths’ alchemy,*\n*Even sinking stones will rise and float as well.*\n\n**167: Sun Water Mint**\n**Common Name:** Supreme Peace\n**Textual Name:** None recorded\n**Nature:** Warm\nFound in Chenxu Prefecture.",
      "overlap_context": " extend from branch to branch by cliffs,*\n*With ocean veins’ flow, its taste bears salt.*\n*A myriad herbs of Ziyang, heaven’s grass—*\n*Fit to boil with mortal red salt.*\n\n**163: Stone Pepper Vine Zhi**\n**Common Name:** Nine Fields\n**Textual Name:** Heavenly Circumference\nFound in Beizhou. **Treats paralysis and wilting.** *Song:*\n*Carved like the Queen Mother’s skirt sash,*\n*Slender stems from immortals’ abode.*\n*When gathering, purity must be kept—*\n*Still fear the golden shadow slanting west.*",
      "start_char": 15942,
      "end_char": 16338,
      "start_sentence": 1495,
      "end_sentence": 1534,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.991361856460571,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 40,
      "original_text": "叶如紫苏，茎紫。 治一切。 歌日： 叶裁金底皱金光，生在长年绿水傍。 别有真人来采用，紫阳宫内软衣裳。 石紫蔓第一百六十八 俗为努头草，书为示见。 性热。 出新罗。 叶蔓茎有茨。 治恶疮。 歌日： 叶叶弯弯绕涧隅，可怜真草世人疏。 唯有太行南山客，将来个个煮仙鱼。 紫贝萝第一百六十九 俗为镜寒，书无名。 性热。 出罗州。 茎紫，叶出花上。 歌日： 婆娑紫叶长藤萝，山野生时亦不多。 采得却能除百疾，惜乎生没在岩阿。 千桑蔓第一百七十 俗为花桑，书为敬桑。 性热。 生陈许州。 叶叶引蔓。",
      "translated_text": "**167: Sun Water Mint (continued)**\n**Leaves resemble perilla, stems purple.** *Treats all types of coughs.*\n*Song:*\n*Leaves cut like gold’s base, wrinkled with golden light,*\n*Growing by perennial streams of emerald green.*\n*Only when true adepts come to gather and refine,*\n*Do soft robes grace the halls of Purple Yang’s abode.*\n\n**168: Stone Purple Vine**\n**Common Name:** Bowstring Grass\n**Textual Name:** Manifest Vision\n**Nature:** Hot\nFound in Silla. **Leaves vine-like, stems thorned.** *Treats malignant sores.*\n*Song:*\n*Leaf upon leaf, curved ‘round the brook’s hidden bend,*\n*How pitiful this true herb—mortals scarce attend.*\n*Only the wanderers of Taihang and southern peaks,*\n*Boil it to brew the sacred fish for transcendence seek.*\n\n**169: Purple Cowrie Vine**\n**Common Name:** Mirror Chill\n**Textual Name:** None recorded\n**Nature:** Hot\nFound in Luozhou. **Stems purple, leaves emerge above the flowers.**\n*Song:*\n*Graceful purple leaves on trailing vines unfold,*\n*Scarce in wild mountains, rare as legends told.*\n*Gathered, it banishes a hundred ills with ease,*\n*Yet pities take—it hides in cliffs’ secluded pleas.*\n\n**170: Thousand Mulberry Vine**\n**Common Name:** Flower Mulberry\n**Textual Name:** Reverent Mulberry\n**Nature:** Hot\nFound in Chenxu Prefecture. **Leaves vine in trailing strands.**",
      "overlap_context": "ith purple undersides.** *Treats malignant sores.*\n*Born under Jia and Ji, wither under Wu and Ren.*\n*Gather after the Spring Equinox, seek before the Start of Summer.*\n*Song:*\n*When mortals ask of this herb’s name,*\n*Its leaves are round with crimson specks like shells.*\n*Boiled as in the darkest depths’ alchemy,*\n*Even sinking stones will rise and float as well.*\n\n**167: Sun Water Mint**\n**Common Name:** Supreme Peace\n**Textual Name:** None recorded\n**Nature:** Warm\nFound in Chenxu Prefecture.",
      "start_char": 16338,
      "end_char": 16603,
      "start_sentence": 1535,
      "end_sentence": 1561,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.20708417892456,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 41,
      "original_text": "治腰背疼。 歌曰： 传得仙人玉树方，当年陈许获亲尝。 采时斋戒忘言话，服饵除疼寿命长。 水菊第一百七十一 俗为金缘，书无名。 出河南府。 叶如乔，花如菊。 治一切水气浮。 歌日： 人间到处种难成，远地幽林却自生。 生处定须无别树，周回荆棣密层层。 獐蹄第一百七十二 俗为蕲芝，书无名。 性冷。 叶如獐蹄，茎紫。 治滑漏。 歌曰： 俗号花桑叶似条，条长引蔓遗溪傍。 还共獐蹄同气味，一时和合入冰汤。 蓬莱山西窜还丹歌卷下竟",
      "translated_text": "**170: Thousand Mulberry Vine (continued)**\n**Remedy for lumbar and back pain.**\n*Song:*\n*Passed down the Jade Tree formula of immortals fair,*\n*Once tasted in Chenxu—its blessings to share.*\n*Gather with fasting, in silence profound,*\n*Consume to banish pain, life’s span unbound.*\n\n**171: Water Chrysanthemum**\n**Common Name:** Golden Edge\n**Textual Name:** None recorded\nFound in Henan Prefecture. **Leaves like the scholar-tree, flowers like chrysanthemum.**\n**Remedy for all water qi and edema.**\n*Song:*\n*Nowhere in mortal lands will it thrive,*\n*Yet deep in distant woods, it comes alive.*\n*Where it takes root, no other tree may stand,*\n*Only brambles and thorns in dense rings expand.*\n\n**172: Roe’s Hoof**\n**Common Name:** Qi Mushroom\n**Textual Name:** None recorded\n**Nature:** Cold\n**Leaves like a roe’s hoof, stems purple.**\n**Remedy for chronic diarrhea and discharge.**\n*Song:*\n*Commonly called Flower Mulberry, its leaves like slender strands,*\n*Trailing vines by the brook’s edge in winding bands.*\n*Sharing flavor with Roe’s Hoof in kindred grace,*\n*Together steeped in icy broth to cool and brace.*\n\n*The \"Songs of the Western Exile’s Returned Elixir\" from Mount Penglai, Scroll the Lower, concludes.*",
      "overlap_context": "me:** None recorded\n**Nature:** Hot\nFound in Luozhou. **Stems purple, leaves emerge above the flowers.**\n*Song:*\n*Graceful purple leaves on trailing vines unfold,*\n*Scarce in wild mountains, rare as legends told.*\n*Gathered, it banishes a hundred ills with ease,*\n*Yet pities take—it hides in cliffs’ secluded pleas.*\n\n**170: Thousand Mulberry Vine**\n**Common Name:** Flower Mulberry\n**Textual Name:** Reverent Mulberry\n**Nature:** Hot\nFound in Chenxu Prefecture. **Leaves vine in trailing strands.**",
      "start_char": 16603,
      "end_char": 16837,
      "start_sentence": 1562,
      "end_sentence": 1582,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.000587224960327,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\蓬莱山西灶还丹歌.txt",
        "category": "众术类"
      }
    }
  ]
}