{
  "source_id": "虚静冲和先生徐神翁语录",
  "source_file": "chunked_daozang\\虚静冲和先生徐神翁语录.json",
  "total_chunks": 20,
  "total_original_chars": 17554,
  "total_translated_chars": 105918,
  "total_translation_time": 567.9154489040375,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\虚静冲和先生徐神翁语录.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Recorded Sayings of Master Xu the Tranquil and Harmonious**\n*Title:* *The Recorded Sayings of Master Xu the Void, Serene, and Harmonious*\nCompiled by Song Qing in the late Southern Song. Two fascicles.\nSource text: *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n**Preface to *The Recorded Sayings of Master Xu the Tranquil and Harmonious***\n\nIn this fleeting human life, all that one receives—whether from Heaven, fate, allotted share, or predestined measure—cannot be altered by even a hair’s breadth. Yet because most cannot fathom the underlying principles, they remain unaware of these truths until they seek out those who have attained the Dao, those who, as the saying goes, \"have already grasped what lies within my heart.\"\n\nWhen Confucius knew of Boniu’s impending death or foretold that Shang Qu would have sons, was this mere worldly divination? No—it arose from direct perception. Master Xu, while in Hailing, would inscribe characters for people, revealing their fortunes and misfortunes throughout life, and his words never failed to prove true. In my youth, I often traveled along the Yangtze and Huai Rivers and heard many of his sayings. Over time, however, those who truly understood him grew fewer, and his teachings became more revered.\n\nMiao Xiyi, a Daoist of Tianqing Abbey, was a disciple of the Master. For decades, he remained at the Master’s side, recording his written words and preserving them. He later asked me to edit and arrange these records so that their essence might be passed down to his followers. This was twenty-seven years ago. After Miao’s death, his writings were taken away by others. When I later came to govern this region, I recovered the original draft from among the people and once again arranged and compared them.\n\nConfucius said, \"I do not speak of the strange, the violent, or the chaotic.\" If words bear no verification, they are but strange tales; if they are beyond comprehension, they belong to the realm of spirits. In such cases, silence is best. Yet if words prove true—if they reveal fortune and misfortune to others, making clear what should be avoided or embraced—how can they be dismissed as unknowable?\n\nThose who attained the Dao in ancient times did so by exhaustively understanding principle and fully realizing their nature. When principle is fully understood, all principles under Heaven become one; when one’s own nature is fully realized, the natures of all things are likewise mastered. Thus, they are called those who \"know beforehand,\" who \"see beforehand,\" who \"awaken beforehand.\" The world marvels at this, yet those who have attained the Dao do not consider it extraordinary.\n\nBut how could the achievements of Master Xu be limited to this alone?\n\nWritten in the third month of the *wuyin* year of the Shaoxing reign (1138) by Zhu Yi of Tongxiang.\n\n---\n\n**Postface to *The Recorded Sayings of Master Xu the Tranquil and Harmonious***\n\nI had long heard of the extraordinary Master Xu of Hailing and regretted not having encountered more of his teachings. In the *yisi* year of the Chunxi reign (1185), while serving as acting governor of this region, I sought out his traces but found no records to gather. When I inquired among his disciples, they said: \"In our land, since the Han and Jin dynasties, immortals have followed one after another. In Master Xu’s time, there were also Chen Doudou, the Recluse Zhou, and Master Tang, who appeared in succession. They were but our neighbors—how much more so was Master Xu, who attained the Dao and for over fifty years instructed commoners, servants, women, and children in numbers beyond counting? How could all of this be recorded?\"\n\nWhen I asked about what they had personally seen or heard, some replied: \"The Master ascended seventy-eight years ago, and none of the elders who knew him remain.\" Later, someone showed me a printed edition of the *Recorded Sayings* from Yanling, compiled by the Daoist Miao Xiyi and edited by Zhu Xinzhong. Though the collection was quite detailed, errors and inconsistencies made verification impossible.\n\nIn my leisure, I inquired among the local scholars, and some could recount what their fathers and elder brothers—disciples of the Master—had seen and heard. Comparing these with Miao’s records, I found occasional discrepancies, but the core of his words was confirmed. I also obtained an earlier account of the Master’s conduct and teachings, written by the village elder Pan Ruyi. Though I was strict in my selection, I regretted that the record was not more extensive.\n\nThus, I had Miao’s records reexamined in light of what I had heard, revising and editing them. Inconsistencies, contradictions, and errors—numbering in the dozens—were corrected, with doubtful passages preserved in both versions. I also added accounts from elders, as well as records from *Dongxuan Bilu*, *Longchuan Biezhi*, *Sun Gong Tanpu*, and *Tong’an Zhi*, totaling eighteen entries, which I combined with the conduct record into a single volume. Like carving hard wood, I strove to ensure its reliability, that this land might preserve his teachings and turn from evil toward goodness—a small aid to the customs of the age.\n\nWritten on the first day of the first month of the *dingwei* year (1187) by Zhu Songqing, Gentleman for Court Audiences, Prefect of Taizhou Prefecture, concurrently responsible for agriculture, irrigation, and military farming.\n\n---\n\n**The Recorded Sayings of Master Xu the Void, Serene, and Harmonious (Fascicle One)**\n\nMaster Xu, styled Shouxin, was a native of Hailing in Taizhou. At nineteen, he entered Tianqing Abbey, where he lived in obscurity, sweeping and cleaning. There, he encountered a perfected one who transmitted the Dao to him, and he recited the *Scripture of Salvation* daily. When asked about good or ill fortune, he would respond with words from the scripture.\n\nHe always carried a broom, and people called him \"Xu the Second Sweeper.\" The Transport Commissioner Jiang Yingshu, noting the scripture’s line, \"The Divine Lord receives the mandate to sweep away all inauspiciousness,\" began calling him \"Divine Master.\" From then on, all referred to him as the Divine Master.\n\nIn the second year of the Chongning reign (1103), an imperial edict bestowed upon him the title \"Master of Void, Serene Harmony.\" He was summoned to court three times. In the second year of the Daguan reign (1108), on the twentieth day of the fourth month, he shed his mortal form at the Daoist cloister of the Upper Clarity Repository of Auspiciousness. He was seventy-six years old. He was posthumously granted the title Grand Master for Court Audiences, and an imperial decree ordered his burial in the eastern outskirts of the city, at the eastern plain of Xianglin.\n\nDuring the Xuanhe reign (1119–1125), the Ascension to Perfection Abbey was built on the site. In the Jiayou reign (1056–1063), the Daoist Yu Yuanji of Tiantai came to reside at Yuntang. After more than a year, he manifested signs of leprosy, and the community shunned him. The Master alone served him with utmost reverence. When Yu Yuanji passed away, the Master informed Xu Zongchen of Hai’an Town, who provided a coffin for burial. The Master mourned him as a teacher.\n\nAfter the burial, he returned and wept bitterly, bowing to all the Daoist adepts, even the servants. Then, before the North Pole Hall, he took Yu’s belongings and burned them all. From then on, he wore only tattered robes and carried a broom to sweep. Sometimes he would shut himself in his room all day, singing or laughing. When he saw others, he would bow first. Everyone thought him mad.\n\nThe day after the burial, Xu Zongchen saw the Master coming to express his gratitude and took out a bolt of cloth and a thousand coins to offer him. The Master had already left, and though Xu pursued him for several paces, he could not catch up. Puzzled, Xu later went to the abbey to inquire, only to learn that the Master had never left at all.\n\nDuring the Zhiping reign (1064–1067), a Daoist of ugly and swarthy appearance, with a broad forehead and a topknot wrapped in plain cloth, arrived wearing a coarse robe. From his staff hung a gourd the size of a fist, and he claimed to have come from the Two Rivers region. When asked his name, he only called himself the Black Daoist. He lodged at the residence of a man named Zhao and often visited the abbey. The abbey’s prior, Chen Yongyi, had already taken notice of him and frequently gave him thirty taels of silver. Later, the Black Daoist would sit in silent meditation beneath the North Pole Hall, speaking in whispers only when the Master approached—no one else could hear their words.\n\nAfter more than a year, he departed, telling Zhao: “I have nothing to repay your kindness, but I shall ensure that your inn remains free of mosquitoes and bedbugs in the summer months.” True to his word, the inn thereafter saw no such pests, and its guest lodgings were always full.\n\nDuring the Xining reign (1068–1077), the Daoist prelate Chongji, Master Tang Riyan, was making his nightly rounds of the abbey quarters when he saw what appeared to be a flicker of firelight in the kitchen. Upon arriving, he found nothing. The Master’s sleeping quarters were beneath the kitchen; pushing open the door, he saw the Master sitting upright facing east, eyes closed in meditation, entirely unperturbed. One day, when the abbey’s provisions ran low, the Master was sent to the estate to oversee the delivery of rice, and he went at once.\n\nWhen the hour grew late, Master Tang arrived behind the Three Clarities Hall and found the Master lying asleep with a broom for a pillow. He called out and berated him. The Master replied, “The rice will arrive by morning.” Tang, enraged, did not press further but waited until dawn to question the rice porters. They said, “Brother Xu urged us yesterday without a moment’s rest, and we had already returned home earlier.” The estate lay over a hundred *li* from the prefectural seat; Tang was stunned. Thereafter, he gave the Master a religious name and enrolled him in the register of disciples, and people began to believe he had encountered an immortal.\n\nThose who came to ask about fortune or misfortune received answers in the form of passages from the *Scripture of Salvation*, or silence, or even sharp rebukes—each response carrying its own meaning. At the close of the Xining reign, he was granted an imperial dispensation for his fidelity and ordained as a Daoist priest. The Master merely laughed and declined, saying, “I only know how to sweep,” and continued his labor as before.\n\nEach evening, he gathered incense papers from the halls and took them to his room, where he would casually write characters on them, folding each one away. The next day, when visitors came seeking written talismans, he would distribute them in order, answering all their questions until the papers were exhausted and the seekers departed.\n\nWhile sweeping, he never cast anything aside. Withered leaves and rotting wood were piled at their roots, while dry leaves were gathered in one place. After rituals, he collected leftover lamp oil to fuel the morning and evening pestles and mills. Unusable stove remnants were twisted to extract every drop of grease, and even the dregs were not discarded but stored in a vessel. During winnowing, broken rice grains were also collected in a separate container. On bitterly cold days, he would gather beggars and vagrants, burning fallen leaves beneath them and scattering the remnants over the flames. He then cooked congee from the broken rice and shared it with them.\n\nThe Daoist Master Cui of Zhenyuan Abbey in Shuzhou, named Guzhi and styled Daoguang, once traveled to Stone Pillar Ridge, where he saw two men playing *weiqi* beneath a pine tree. One of them gave Cui a piece and instructed him to swallow it. Hesitant, Cui proceeded on his way until he suddenly encountered the Master, to whom he recounted the incident and showed the piece. The Master took it and swallowed it, then passed through Wutang before departing. Later, when Cui returned to the ridge, he met the same players, who berated him harshly. From that time on, Cui descended into madness.\n\nMaster Tang Riyan frequently hosted Daoist adepts from all directions. Whenever the Master swept the Cloud Hall, visitors would invariably arrive that day. Shen Boyu, the magistrate of Hailing, brought his young son to see the Master and asked whether the boy would hold office. The Master did not answer, but when pressed, he said, “Metal and Water govern his fate; his official post will come at twenty-seven.” Later, Shen consulted an astrologer, who confirmed the two stars in his son’s chart. The year he was appointed to office matched the Master’s prediction.\n\nShen’s wife fell ill and sought a written charm. The Master inscribed *Wuxiang Guanyin* (“Guanyin of No-Thought”). When she asked again, he wrote, “Recite it ten times.” That October, she died. Later, Shen read the commentary on the *Scripture of Salvation* and learned that *Wuxiang Guanyin* presided over the register of the long night.\n\nZha, a retired minister of works, visited the Master with Shen, but the Master did not emerge. After knocking for some time, the Master said, “I see only Magistrate Shen, not Minister Zha.” The two left, and shortly afterward, Zha died.\n\nThe abbey’s superiors, noting the dilapidated state of the buildings and the growing number of visitors, placed a donation chest beside the Master’s seat to fund repairs. The Master approved, and offerings from near and far soon poured in, sometimes reaching tens of thousands in a single day. Yet there were also days when the chest remained sealed and untouched, though the donations continued as usual.\n\nDuring the famine of the Xining era, the abbey’s gates lacked provisions. Each morning, the Master would personally distribute several hundred coins to the stewards for purchasing vegetables. The servants suspected he had a hidden stash and plotted to steal it. While he was out, they secretly opened his door, only to find a basin of water inside. One stumbled, soaking his clothes. As he straightened his garments, the Master suddenly appeared, sitting atop a tree, laughing: “I told you not to open it.” The would-be thieves fled in disarray.\n\nPrefect Zhang Cis han had an old friend serving as an official in Chengdu. A letter arrived stating, “There is a Daoist in Chengdu wearing tattered robes who calls himself Old Man Xu of Tianqing Abbey in Taizhou.” During the Yuanfeng era, Jiang Yingshu, the transport commissioner, first met the Master and asked, “What are you skilled in?” The Master replied, “I don’t know anything.”\n\n“Can you foretell fortune and misfortune?”\n“I cannot.”\n\n“Do you understand the *Scripture of Salvation* when you read it?”\n“I do not.”\n\n“How do you assess my official career?”\n“The official is most astute.”\nPressed again and again, he said, “You should favor Zang and punish Xing.”\n“And if I do not favor Zang and punish Xing?”\nThe Master reached behind his back with his hand and said, “The tumor pains me too much to speak of it.” (For Jiang had a growth on his back that flared with rage, swelling until he could not speak—a condition he had never revealed to anyone.) Thereupon he ordered two attendants to support the Master as he bowed to him, declaring, “A true man indeed!” The scripture says: *“The Divine Lord receives his mandate to sweep away all inauspiciousness.”* This man is worthy of the title. Henceforth he called him the Divine Lord and composed a poem for him:\n\n*Bearing the broom to sweep all dust,*\n*For thirty springs it has been thus.*\n*I pity his lone resolve,*\n*Feminine stillness, never first to move.*\n\nHe established the Hall of Embracing Stillness in his honor. Some say that Lü Jifu’s poem, which included the line *“to cease all boasting and guard the feminine alone,”* inspired Jiang to adopt the name. Jiang also saw a stele beside the hall inscribed to the Perfected One Le Zichang and wrote a poem upon it:\n\n*Jade altars three-tiered, thick with moss,*\n*I picture the Perfected One drinking from the crimson cup.*\n*The soughing immortal wind stirs cedar and cypress—*\n*Only the whirlwind’s chariot could bring him back for a time.*\n\nZichang’s former residence stood beside Lezhen Bridge in present-day Chongzhen Ward, the very site of his ascension. During the Liang Dynasty’s Datong era, the Lezhen Abbey was built there. By the Tang Dynasty’s Dazhong era, it was relocated eastward—today’s Tianqing Abbey. The Master’s own dwelling also lay east of Lezhen Bridge, which is why Jiang’s poem suggests he was Zichang reborn.\n\nJiang Yingshu once asked the Master for a written character. He wrote the character *long* (dragon). When asked why it was incomplete, he replied, “It will be filled in later.”\n\nThat year, he was appointed Academician of the Dragon Diagram Pavilion. When asked again, he replied, \"For now, it will endure.\" Pressed further, he added three strokes. Asked about the back tumor, he said, \"It will descend beneath the pavilion.\" Later, when appointed Academician of the Dragon Diagram Pavilion, the tumor indeed shifted slightly downward.\n\nOnce, when asked for a written character, he wrote *Red Heavenly Demon King*, and on another occasion, *Bearing Heaven’s Burden of Stone*. Asked how many *dan* the burden weighed, he said, \"Two thousand *dan*.\" Soon after, he was transferred to command Guangzhou, fulfilling the prophecy of *Red Heavenly Demon King*. Later, when he entered the Bureau of Military Affairs, it validated *Bearing Heaven’s Burden of Stone*.\n\nDuring Jiang’s tenure as Transport Commissioner, he wished to dredge the Guishan Canal. Though he pondered it long, he had not spoken of it to anyone. One day, he brought the matter to the Master, who immediately said, \"If you wish to open it, then open it—why ask others?\" Jiang’s intent was thus settled.\n\nWhen Chancellor Wang of Jing dispatched someone to request a written character, the Master wrote *First Unfurling King* in four characters, just as before. The Master said, \"The *admonish* character need not include the *person* radical.\" This referred to the classic line: *\"Red script, jade characters.\"* Later, as the Master returned to Jinling by boat, an old man suddenly called from the shore, \"My lord, Master Xu the Immortal has a letter for you.\" Upon receiving it, he saw the same four characters as before. The old man vanished in an instant. Soon after, the Master passed away. During the Zhenghe era, he was posthumously enfeoffed as Prince of Shu—his written prophecy fulfilled.\n\nMinister Yu Ce, dismissed from Tongzhou at the end of the Yuanfeng era, came to visit the Master. The Master wrote *Azure Dragon, White Tiger, Vermilion Bird, Dark Warrior, Lion, White Crane*, arranging them to left and right, with *sun and moon illuminating*, filling the chamber with radiance—twenty-four characters in all. The Master said, \"You have gained it, gained it! If you can employ these characters...\" Upon returning to the capital, Yu was appointed Sacrificial Attendant of the Court of Imperial Sacrifices. At the time, ritual objects were being prepared, and he saw the processional banners of *Azure Dragon, White Tiger*, and the others—only then did he grasp the Master’s meaning.\n\nWhen his son Yu Hang requested a written character, he received *Thirty-Two Passages*. At the time, Hang was eleven; by the Yuanfu era, when he passed the provincial examination, he was thirty-two.\n\nIn the seventh year of Yuanfeng, candidates for the Southern Palace examination sought a written character. The Master wrote *Music Turns to Ashes* in four characters. Zhang Zhengyi’s son, Dacheng, received *Mountains Swallow Mist* in four characters. That year’s examination featured a *Music Emerges from Emptiness* essay, and the examination hall caught fire.\n\nMinister Fan Bing, serving as Surveillance Commissioner, asked the Master, \"How much do you eat each day?\" The Master replied, \"I stop when full.\" Asked if he dreamed, he...\n\nHe replied, \"Ever since I received the correct Dao, I have never dreamed—only later did I cease to have them.\"\n\nFan asked, \"Is this through cultivation and awakening, or merely through encountering those who have attained the Dao?\"\nThe Master did not answer.\nPressed repeatedly, he said, \"Through encountering others.\"\n\"In which year did you encounter them?\"\n\"In the gengxu year.\"\n\"In this gengshen year, have you transmitted the Dao to others?\"\nHe smiled but did not answer.\n\nFan, who had no sons, requested a written character. The Master wrote *Winding Bay* in two characters. A year later, in Yangzhou’s Bay Head, he had a son. Later, when passing through Hailing, he saw the Master again. The Master said, \"Go three to five *li* east of the prefecture to welcome a scholar.\" The next day, passing through Tongzhou, he reached Tang Bay and had another son.\n\nQian She-ren Xie, observing mourning for his mother, resided at Daning Temple in Taizhou. He sought a written character from the Master, who wrote *Above Brightness: Seven Luminaries, Maheśvara Heaven* in seven characters. Soon after, his residence suffered a conflagration. His son, Dongmei, once received from the Master the four characters *All Arrive Before the Emperor*. When Xie was sent as an envoy to Samhan, Dongmei accompanied him and on the same day resigned and departed.\n\nLiu Gu, a commoner serving as Proofreader in the Classics Bureau, had long been acquainted with the Master. Once, visiting the Hall of Master Le, he asked, \"Where is the True One?\"\nThe Master pointed to the tip of the statue’s nose.\nLiu silently grasped his meaning: \"Le’s comings and goings are but the ebb and flow of a single *qi*.\"\nLiu composed a poem:\n*Coming, coming—asking for an empty cause,*\n*Head bowed long, alone dusting the void.*\n*Yet pointing to the clay dot on the nose’s tip,*\n*He laughs and says, ‘Here is Master Le.’\"*\n\nLiu once slept in the kitchen with the Master, using straw as bedding. One night, the room blazed as bright as day. He saw the Master sitting with mouth agape and eyes wide, while a voice from the void said, \"Xu Xi will stand and die entering the barbarian lands; Lü Huizhi will choke on a goji berry husk.\" At the time, Xi was managing border affairs, and Lü was still in mourning in Weiyang—both were acquaintances of Liu. Later, Xi met with the Yongle disaster, and Lü was demoted during the Yuanyou era, only reinstated in the Jiaxu year of Shaosheng.\n\nWhen Attendant Lü Yirou had not yet passed the imperial examination, his father visited the Master, who said, \"Fifty-four is auspicious,\" and also, \"Second place.\" Later, Yirou indeed ranked second in the examinations, and fifty-four was his generational order.\n\nWang Zhongjing, a Gentleman for Consultation, sent someone to request a written character. The Master wrote *□*; when pressed again, he said, \"Hasten into the Dao—you may not have time.\" That year, Zhongjing died.\n\nSun Sheng, upon completing his term as Assistant Magistrate, bid the Master farewell. The Master said, \"While in office, wear the *fei*.\" Later, though offered two appointments, he declined both. When a general amnesty was granted, he was appointed *fei* as an Imperial Censor.\n\nWang Hefu requested a written character. The Master wrote *Three Mountains*, and later he became Supervisor of Songshan’s Chongfu Abbey.\n\nLin Chuchu, in the capital, saw a written character by the Master in the possession of Jiang the Daoist of Taizhou. Lin burned incense before the Master’s portrait, prayed, and drew lots, receiving *Returning to the Five Constants*. Later, he was appointed Professor of Changzhou, serving a full five-year term.\n\nLiu Gu’s son-in-law, Jiang Jing, a Gentleman for Consultation, visited the Master during the Yuanfeng era. He recalled, \"At first, I saw the Master on the altar platform. Observing his posture and demeanor, he seemed human. But perceiving his spirit and bearing, he was one of those anciently said to wander with the Creator. I stood in silent awe, craning my neck to divine his intent. The Master was sweeping the floor and simply raised his broom in response. I bowed, and he shouldered the broom and descended the altar. Thus, I knew him as one who truly embraced the One without loss, discerning fortune and misfortune without divination.\"\n\nFan Tuiguan Qian sent a letter to Li Nangong but received no reply for a long time. Doubting, he asked the Master, who wrote *Stone*. Days later, Nangong entrusted Qian with cash, delegating it to Shi Pi.\n\nLi Zhide, a poet and scholar of the *Fa Yan*, asked the Master about having no sons. The Master said, \"Better to buy a position in the Ministry of Rites than to wait for a gift,\" and wrote *Kong Meng* in two characters. Later, Li indeed had two sons.\n\nLi, en route to serve as Magistrate of Yancheng in Chuzhou, saw the Master, who said, \"When your term ends, wear the *fei*.\" Soon after, during the general amnesty of the Yichou year of Yuanfeng, he changed his mourning attire and was granted the *fei* on the very day he handed over his seal.\n\nZhou Yu passed the imperial examination in the third year of Xining and remained in the selection pool for a long time. One day, seeing the Master, he received the two characters *Eight Capitals*. Though Zhou knew of the phrase \"eightfold alignment with the numinous\" in the classics, he did not understand. The Master said, \"This refers to the convergence of names.\" That year, he was appointed Acting Constable of Suqian County in Huaiyang Commandery. After capturing bandits, he was promoted to Collator in the Imperial Library. The selection rank was the seventh grade, and the capital rank was the eighth.\n\nIn the early Yuanyou era, Palace Guard Wang Sheng, escorting a transport, sought an audience with the Master. The Master said nothing but instructed him to drink three cups of water.\n\nUnable to drink, he declined. The Master said, \"If you cannot drink three cups of water, how could you drink from a river of other things?\" Overcome with awe, Wang Sheng dared not conceal anything. It turned out his wife, née Li, was jealous and had drowned a maidservant in water, intending to perform a Daoist ritual to absolve the deed. The Master said, \"This will do well.\"\n\nThat night, after the ritual was completed, Wang Sheng and his wife both dreamed of the drowned maidservant, who said, \"The divine elder has delivered me—my grievance is released.\"\n\nGrand Master of the Palace Ceremonies Zhang Andao, retired and afflicted with an eye ailment, sent a messenger bearing incense to request a written talisman. The Master inscribed four characters: *Returning Deer, Liu Xuan*, alluding to the classical phrase \"returning robber, flowing mystery.\" Zhang wrote in thanks, saying, \"Upon receiving these four characters and grasping their meaning, I shall burn my salary records. May all the greed and stinginess accumulated over countless kalpas vanish with this flame.\" Thereafter, his eye ailment gradually improved.\n\nMinister of Personnel Lü Jifu, having completed his mother’s mourning period in the early Yuanyou era and been assigned a regional post, heard of impeachment charges against him and sought a written instruction from the Master. The Master wrote two characters: *Establish Staff*. Lü said, \"With exile looming, how could I dare hope for such an honor?\" The Master replied, \"You will ultimately establish your staff.\"\n\nSoon after, he was demoted to Vice Military Commissioner of Jianning Commandery. When the Shaosheng era began, he was recalled to command Yan’an, and shortly thereafter appointed Military Commissioner of Baoning Commandery with the title of Grand Master for Palace Counsel. When Lü first came to pay respects, the Master looked at him and said, \"Guard well, guard well\"—all understood this as a warning to safeguard his wealth and rank. Later, when he was assigned to a princely fief, he firmly declined, and was instead sent to Shanzhou, which corresponded to the \"guard\" in *Shan Guard*. Through successive demotions, the Master’s admonition to \"guard well\" proved apt.\n\nLü once received a written character from the Master, which read: \"Within the Northern Capital’s Spring and Music Bureau, ten thousand ghosts gather—all seek to block the human ranks and sever the Gate of Life.\" Later, Lü was demoted from Yan’an.\n\nWhen Grand Councilor Su Zizhan was first appointed Prefect of Dengzhou, he came to request a character. The Master wrote: *come, king, guard, three*. Su then asked about the essentials of Daoist cultivation, to which the Master replied: *\"Leisurely delight.\"* Su later consulted a Daoist priest for an interpretation of the characters. The priest said: \"The scriptures speak of *crimson writings and jade characters*—an imperial decree is the king’s command. You wrote *come* with the character for *king*, so an imperial summons will soon arrive.\" Indeed, Su was soon recalled to serve as Academician of the Dragon Diagram Hall, then sent out again to govern Yangzhou.\n\nDoubtful of the Master’s words about *\"leisurely delight,\"* Su sent another messenger to request a character, but the Master refused to write. Later, when exiled to Huizhou, Su dispatched his son Guo to ask again. The Master did not receive Ziyou, saying only: \"My elder brother trusted my words but could not put them into practice.\"\n\nSu Huangmen Ziyou, from Jixi, sent someone to request a character. The Master wrote: *\"The time has come to extinguish the self and pass through the Great Yin.\"* Soon after, Ziyou was recalled, rising through the ranks to Vice Director of the Chancellery. At the end of the Yuanyou era, he was sent out to govern Yuanzhou. He sent another messenger to inquire, and the Master wrote: *\"Recite the scriptures ten times over—virtue and merit will descend at once.\"* To the messenger, he added: \"Ten in the past, ten in the present.\" Upon hearing this, Ziyou said: \"Long ago, he told me that in the *xu* year I would have much fortune, and in the *you* year much misfortune. Could there truly be a rebirth after ten years?\" Before reaching Yuanzhou, he was transferred to the southern frontier. Only at the end of the Yuanfu era did he return.\n\nDaoist Pan Fengzhen, who had repeatedly failed the scripture examinations during the Yuanyou era, received four characters from the Master: *\"thirty-two days.\"* When he passed the exam later that year, he was thirty-two years old.\n\nJiang Wei, a candidate from Sanqu, wished to change his name to Ru Zhen. He came to see the Master but had not yet spoken when the Master said: \"Your surname is Jiang—remove the *gong* radical and add the *nü* character, and it will be excellent.\" Jiang changed his name accordingly and later passed the imperial examination.\n\nAttendant Gentleman Liu Yuan, who during the Yuanyou era had been exiled with his father, requested a character and received: *\"hold jade, grasp the tally.\"* Soon after, both father and son were recalled. Liu was appointed Director of the Eastern Palace Gate Office, while his father became Director of the Palace Domestic Service. The scriptures contain the phrase: *\"holding records, grasping registers, they approach the emperor’s presence.\"* The Master had replaced *records* with *jade* and *registers* with *tally*, for both men were eunuchs of high rank, serving as military commissioners *ad interim*.\n\nA teaching assistant from Suzhou named Chen sought a character, but the Master refused to write. Instead, he berated Chen repeatedly and ordered a large goblet filled with water to be drunk. After several rounds, Chen begged to stop, unable to drink more. The Master said: \"If you cannot drink this, how will you drink the waters of the lake?\" (For Chen had once profited from another’s misfortune, showing no mercy when the man drowned.) Terrified, Chen prostrated himself and confessed: \"You have borne both wealth and fate to this point—how could one so unrepentant be taught?\" Chen then entered the Daoist path.\n\nA military officer serving as a frontier commander, whose family had long received no news, came to request a character. The Master wrote: *\"double house.\"* Soon after, a funeral announcement arrived: the officer’s coffin was being escorted home. Only then did he understand that the two characters meant *\"a corpse arrives from a thousand miles away.\"*\n\nCommandant Qi, who sought a character in the *xinsi* year of the Yuanyou era, received the character *shame*. Qi’s mother had been born in the *chou* year, and within ten days, she died. When Qi saw the Master again, he was given the character *envy*. Soon after, Qi himself died. For the upper part of *envy* is *yang*, and the lower part is *next*—*yang* signified the *wei* year, and *next* meant one would follow another.\n\nWhen Prefect Zhou Deng of the commandery first took office, his boat stopped at Sishang. The Master sent him a letter. Upon opening it, Zhou found only the words: *\"kill people, set fires.\"* Three days after arriving at his post, the commandery saw three bandits—one a murderer, two arsonists—all captured.\n\nIn the *guiyou* year of the Yuanyou era, a candidate from Jiangling visited the Master, who said: \"This year, eight mouths will pass the examination.\" When the results were announced, eight names on the list contained the character *mouth*.\n\nA candidate from Gusou traveling to the capital requested a character. The Master said: \"Have no worries—the land spirit of Huating has already prepared to welcome you.\" That year, the candidate passed and was assigned to the Huating registry.\n\nAttendant He Xuan had a relative who insisted they visit the Master together. He Xuan was reluctant, saying: \"Does one not know oneself?\" Yet he went. At first sight, the Master said to him: \"Sir, do you not know yourself?\"\n\nIn the Yuanyou era, Chen Gu led a group to craft a ceremonial canopy and present it to the Eastern Peak. He invited the scholar Hao Ting to join him. Hesitant, Hao sought a character and received: *\"dwell.\"* Chen said to him: \"Dwell is an omen of peace.\" After the ceremony, on their return to Gaoyou, Hao fell ill and died. Chen transported his coffin home, only then realizing that *dwell* meant *\"a corpse returns in an ancient cart.\"*\n\nIn the Yuanyou era, the imperial son-in-law Zhang Dunli memorialized the throne about the Master’s reputation, and the emperor bestowed upon him a purple robe and the title *Master of Perfect Penetration*. The Master declined them, continuing to wear his usual attire.\n\nThe Master once wrote a gatha for the assembly:\n*\"Heaven and earth—a foot’s span,\nThe four seas—a single drop.\nBlink your eyes once,\nAnd all traces vanish.\"*\n\nHe also wrote poems:\n*\"Gazing afar at South Village’s tranquil scene,\nThe fields of those before are reaped by those behind.\nIf those behind take no joy in their lot,\nStill others will come to reap after them.*\n\n*Time flows like water in haste—\nSeize the moment and rest when you may.\nChildren and grandchildren have their own fortunes;\nDo not toil for them like ox or horse.*\n\n*Wealth and poverty each have their causes,\nPredestined by past karma—do not force your fate.\nIf you never sowed in springtime,\nHow can you expect a harvest from barren fields?*\n\n*South Village, North Estate—flowers before your eyes,\nFine sons and daughters—do not boast in vain.\nWhen I die one morning,\nAll will belong to Zhang the Third or Li the Fourth.\"*\n\nIn the fourth year of the Yuanyou era, a clerk of the commandery named Chen Deyi went missing. The magistrate of Hailing, Li Yuangui, issued a document setting a one-month deadline for his recovery. Chen sought a character, and the Master wrote: *\"talent.\"* On the day before the deadline, Chen was found on the official road outside the gate. That day was the eleventh of the eleventh month—the month’s cyclical sign was *zi*. Adding *zi* to *talent* formed *exist*, and *eleven* formed *at*.\n\nIn the Yuanyou era, a registered household of Yangzhou named Zhong Jing suddenly died. As he was about to be encoffined, he revived and said: \"At first, I was summoned to the netherworld, but after verification, I was released to return.\" Midway, the escorting ghost-official asked, \"How will you thank me?\" Jing replied, \"I have only a vegetarian certificate.\" The official said, \"This will do.\" He exchanged it for a slip of paper and took it away with delight. Upon reviving, Jing held a small paper in his hand, inscribed with two faint lines of fine script—indecipherable. He showed it to the Master, who said, \"This is a netherworld promissory note. It reads: *One vegetarian certificate, worth five hundred strings of cash.* Return quickly to buy paper money and burn it along with the note.\"\n\nA man of Haimen in Tongzhou, Hao Qing, was passing through Hailing while trading dried fish. He sought a character and received *forbid*. Qing thought, \"What prohibition could there be for dried fish?\" Yet upon reaching Qiantang, he encountered bandits who plundered all his goods. Later, the thief was captured—Lin Xiao’er.\n\nThe Daoist Li Bashi, styled Shourou, was skilled at interpreting the Master’s characters. In the early Yuanyou era, he traveled to Yangzhou to hold a Dragon Flower Assembly, where Daoists and layfolk treated him with the reverence due the Master. Suddenly, the Master wrote a character on a slip of paper, folded it, and gave it to Xu Daozheng, saying, \"Wait until Li Bashi returns, then give this to him.\" Several days later, Li returned gravely ill. Xu handed him the paper, which read: *Already summoned to the Northern Netherworld by Deng.* Shourou repeatedly cried, \"I am guilty of death!\" and soon died.\n\nThe Right Palace Attendant Jia Bin, during the Yuanyou era, sought a character and received *Feng*, with four dots added beneath it. Later, he was appointed to oversee the postal relay stations of four prefectures: Zhang, Quan, Fu, and Xing.\n\nThe Gentleman for Court Audiences Zhou Jing, in the late Yuanyou era, fell ill with a chill. He dreamed of an old man who gave him medicine, saying, \"I have come especially to save you.\" Upon waking, his illness was much improved—though at the time, he had not yet met the Master. Later, at the home of Academician Qiao Zhizhong, he first saw the Master’s portrait and realized it was the man from his dream. In the Bingzi year of the Shaosheng era, he visited the Master, who, upon seeing him, bowed and said, \"After such a long separation, are you well?\" Only then did Zhou recall that his illness years before had been cured by the Master’s intervention.\n\nThe Chengdu Daoist Sai Gongchen, in the winter of the Wuchen year of the Yuanyou era, transcribed the *Biography of the Divine Master* written by Jia Shansiang and sought a character from the Master. At first sight, the Master said, \"Why trouble yourself with biographies? Human life is full of unnecessary affairs. First compose a hymn, and I will write a character for you.\" Gongchen’s hymn read:\n*\"Divine Master, Divine Master,\nLike the moon filling the sky.\nNot gazing with the eyes,\nYet illuminating all without end.\"*\nThe Master then wrote the four characters *longevity, virtue, movement, scripture* and said, \"Your parents are at peace—no need to ask. The *virtue* character refers to your mother, née He, whose hidden virtue brings you fortune. *Movement* means movement; stillness leads to extinction. The *scripture* character lacks craft—you must cultivate diligence.\"\n\nJia Shi received the two characters *earth spirit*. Indeed, he had once dreamed of being granted a talismanic mandate, appointing him as the earth deity of the Supreme Clarity Palace in Bozhou.\n\nBefore taking vows, the monk Zhitong visited the abbey to request ordination. The Master asked him, and the Master said, \"You may become a monk.\" He wrote the character *Chen* and gave it to him. Later, Zhitong was ordained at Zifu Temple by the elder Daoyuan, whose secular surname was Chen. Afterward, he returned to thank the Master, who said, \"Zifu Temple is now desolate, but in the future, someone will rebuild it—there will be more pavilions, halls, and towers.\" He then wrote the character *Dao* for him. Zhitong thought *Dao* was his master’s name. After Daoyuan’s death, his successor was Fadao, who extensively renovated Zifu Temple, making it resplendent. Twenty-eight years later, an edict ordered each prefecture to convert its finest temple into a Divine Empyrean Jade Clarity Longevity Palace. The prefecture selected Zifu Temple, and the abbot was the Great Master Daoqing, styled Yin Ruoshen. The pagoda was renamed the Tower of Dense Rosy Clouds, and all halls, gates, and corridors were renewed. The Master’s words were fulfilled.\n\nThe Grand Master Chen Xiang, while serving as vice-prefect, presented the Master with a poem:\n*\"Morning after morning, I carry a broom by my side;\nEvening after evening, I sweep my chamber.\nSweeping without cease, day and night,\nWhen the dust is cleared, the true immortal emerges.\"*\n\nThe Presented Scholar Zhou Huo, in the eighth year of the Yuanyou era, failed the provincial examination and sought a character. The Master wrote *cultivate*. Three years later, Lu Nongshi, the prefect of Taizhou, recommended Zhou. He was selected.\n\nThe Changzhou man Liu Dao, during the Yuanyou era, came to leave the household life. The Master said, \"You should not stay here.\" He wrote the three characters *nine, sun, qian*, with *sun* on the left. Several years later, Liu became a Daoist at the Nine Luminaries Courtyard of the Establishing Prosperity Abbey in the capital. The scriptures contain the phrase *the nine suns guide qian*.\n\nJiang Jiang, during the Yuanyou era, visited the Master with a group of people. The Master singled out Jiang and gave him a slip of paper, saying, \"You will find use for this character.\" It was *bury*. Li Bashi interpreted it: \"Could there be two burial matters left unfinished?\" One was born in the *mao* hour, the other in the *si* hour. Jiang wept and said, \"Indeed, my parents’ burials have not been settled—I was born in *mao* and *si*.\" That very day, he hastened to inter them without delay.\n\nYao Wenzhi of the eastern outskirts of Yangzhou had not yet met the Master.\n\nIn the early Yuanfeng era, an old man suddenly knocked at the door, holding only a broom. He said, \"I am Xu the Second Elder from Taizhou. There is a broom growing in your back garden—go and see it.\" Yao accompanied the Master to the garden, where the Master pointed to a spot and said, \"This is my broom.\" Yao followed his gaze and saw a single shoot of *nie* bamboo, shaped like a broom. When he turned back, the old man had vanished. He returned to see the Master, who appeared just like the old man he had met, though the Master had never left.\n\nThe Master said, \"That place is suitable for building a hermitage to cultivate the Dao. One day, you may seek to renovate the abbey there.\" Yao then built a hermitage where the bamboo broom grew, painting the Master’s image to honor with incense and fire. Whenever he had doubts, he prayed to it, and all proved efficacious. By the Yuanyou era, he came to build the Three Clarities Hall.\n\nYao Wenzhi planned to relocate his parents’ graves. He first found a low-lying site, then a high one, but could not decide between them. He took a handful of soil from each, sealed them in his sleeve, and went to ask the Master. Before he could speak, the Master said, \"Use the low ground.\" Yao took out the two soil pouches, and the Master pointed to one, saying, \"This soil is fine.\" He checked the seal—it was from the low site.\n\nQian Duanshu’s sister was childless. Duanshu brought her to see the Master, who wrote the four characters *Yuanshi Shangdi* (Primeval Lord of the Dao). His sister said, \"I understand now—I will only bear a daughter.\" Later, this proved true, for the character *shi* (始) contains *nü* (女, \"woman\") within it.\n\nDuring the Yuanyou era, Wang Wei, not yet an official, came to see the Master. The Master immediately called out, \"Officer Wang, do not worry about your future.\" To a Daoist, he said, \"Please take the officer to the abbot’s quarters for tea.\" When Wang saw the Master again, the Master patted his back and said, \"When you become a prefectural official one day, remember to look after the abbey’s affairs.\" Wang merely assented. Twenty years later, he became an assistant magistrate in Taizhou. At that time, the abbey’s abbot was involved in a legal matter, sent to the judicial office. Wang recalled the Master’s words and devoted himself to the case.\n\nA man from Hangzhou named Fan Xiaowu brought a courtesan surnamed Lü to ask the Master for a written divination. The Master wrote in large characters: *\"Lü has no husband; Fan has no wife.\"* Both were terrified and left.\n\nJi Tiancong from Rugao owed a tea merchant three hundred strings of cash. The merchant sued him in court. Unable to repay, Ji hanged himself in his bamboo grove but was saved by a man named Ding. The merchant, hearing of this, took pity and asked the court to extend the deadline. From then on, Ji’s livelihood recovered. Later, he repaid the merchant five hundred strings, but the merchant refused the excess and departed.\n\nJi later fell ill and refined *qiushi* (autumn stone) for consumption. At the end of the Yuanyou era, he visited the Master, who said, \"Are you not Ji the Third?\" He struck Ji’s cheek and rebuked him: \"Why do you consume such filth? Do you remember the bamboo grove? It was no different then—what more was there to cling to?\" Ji awakened and begged to stay at the abbey to serve the Master. The Master agreed, saying, \"You may do me a great service by accumulating small acts of goodness.\" He then ordered Ji to work with Yao Wenzhi as a supervisor to build the Three Clarities Hall and renovate the abbey’s structures.\n\nIn the fifth year of Chongning, Ji fell ill in the seventh month and asked the Master for consecrated water. The Master refused and asked, \"What is your surname?\" Ji replied, \"Ji (籍).\" The Master asked, \"How is *ji* written?\" Ji said, \"Bamboo radical above *lai* and *xi*.\" The Master said, \"Just use *xi* (昔). If you add *yi* (夕) to it, you get *xi* (夕)—hurry home.\" Ji died sitting upright on the twenty-first night, which was a *jisi* day. For *xi* (昔) denotes the twenty-first day, and adding *yi* (夕) to *ji* (己) means death.\n\nOne day, the Master said to the Daoists renovating the abbey, \"Go quickly to Zhenzhou to buy timber.\" They followed his instructions and arrived in Zhenzhou. Asking around, they were told, \"This morning, a large raft of timber arrived, priced at 1,600 strings. The Changlu monks offered 1,500, but the merchant has not sold it yet.\" The Daoists matched the price and secured the timber—the Changlu monks arrived too late.\n\nDeng Yan, a scholar from Xiuzhou, sought a divination from the Master during the Yuanyou era while preparing for the imperial examinations. The Master wrote four characters: *yang yi xi ji* (羊一夕已). That year, Deng did not pass. He died in the *xinwei* year.\n\nCheng Ruoqing, a *baolu* attendant to the imperial chambers, was initially among a group where no one recognized his worth. During the Yuanyou era, he bid farewell to the Master to return to Qianshan. The Master saw him off with a poem:\n*\"A patched hemp robe with knotted corners,\nA molting phoenix is no match for a chicken.\nThough clams and oysters lack color,\nInside lies a pearl unknown to others.\"*\nTwenty years later, Cheng and the Master were summoned together to the Upper Clarity Palace and granted the title *Baolu Xiansheng* (Master of the Precious Register).\n\nPrefect Liu Yi sent someone to ask the Master for a written divination. The Master wrote three characters: *lin xia ren* (林下人, \"one who dwells beneath the forest\"). Liu rejoiced, saying, \"I follow the Dao. Last night, I dreamed of two youths drinking milk—I now know I am a *lin xia ren*.\" Later, he died in Chuzhou.\n\nPrefect Xiong Gao’s elder brother, a *daizhi*, had come seeking medical treatment and intended to return to Poyang.\n\nXiong Gao asked the Master for guidance, who wrote the character *ding* (丁). He said, \"This can also be a *ding*. If you take the character *xia* (下) and lift its foot, it becomes *ding*. Add a mouth, and it becomes *ke* (可). If you add a person, what character would it be?\" He then asked, \"Why can this character not be used?\" The Master replied, \"Only by adding three strokes would it be permissible.\" Several days later, Xiong Gao returned to request another character, and the Master wrote *dao yan ci* (道言此, \"the Dao speaks this\"). Later, news arrived that his elder brother had died at Dingzi River in Zhenzhou, and his youngest son passed the following day. Thus was verified the meaning of the *dao* character missing two strokes, and the subtle foreshadowing of Dingzi River.\n\nRegistrar Liu Bian had once falsified an autopsy report, and the prefect sought to settle the matter. He came to see the Master, intending to depart in the first month. The Master said, \"Next year, in the first month.\" Liu did not take this seriously. Coincidentally, Transport Commissioner Li Cong issued a document to the prefecture, detaining him for impeachment, and he was only able to leave in the first month of the following year.\n\nLin Dan, Director of the Palace Administration, served as the Huainan Transport Commissioner and requested a written divination. The Master wrote: *shang shang dang dang □ ling* (上尚当党□陵, \"above, esteem, ought, faction, □, mound\"). Only the □ character had an extra stroke. Later, Lin was transferred to Hedong as Transport Commissioner and died in Shangdang.\n\nThe Venerable Master Foyin Liaoyuan of Jinshan Monastery sent a letter to the Master. The Master did not open the seal but simply said, \"All is well.\" On the envelope, he wrote fourteen *jin* (金, \"gold\") characters, arranged in pairs, and instructed the messenger to take it back. Later, another messenger came seeking a written divination, and the Master wrote *er qi fo* (二七佛, \"two sevens, Buddha\"). Foyin resided at Jinshan for fourteen years.\n\nLiu Gu, a commoner from Jiangyin, faced a lawsuit in the winter of the *gengwu* year of the Yuanyou era (1090), when villagers were incited to accuse him over a land dispute. The case was referred to the Huai-Dong Surveillance Commission. Fearing disaster, Liu Gu came to see the Master, who wrote seven *tian* (天, \"heaven\") characters: three in a row, and one appended below the other six. Liu silently grasped the meaning, changed his surname to Huangfu, and fled to Mount Lu. Once, he stayed at the home of his son-in-law, Jiang Jing, an official in Anren, Raozhou. The Huai-Dong Surveillance Commission learned of this, and an imperial edict ordered Jiang’s punishment. Liu escaped, and three years later, in the Shaosheng era (1094–1098), the land dispute was resolved in his favor, and Jiang was pardoned by imperial grace.\n\nIn the fourth month of the *jiaxu* year of the Yuanyou era (1094), the Master secluded himself and refused to go out. Daoist followers entreated him, saying, \"Wait until the era name changes, then come out.\" Several days later, the era name was indeed changed to Shaosheng.\n\nAcademician Wang Mingsou once received a written divination from the Master. Upon opening it, he found the character *lü* (吕) written as □. After this, he lost a young son and an elder daughter. He sent another messenger to ask the Master, who wrote *ji qiu shuang jiang* (季秋霜降, \"late autumn, Frost’s Descent\"). Later, Wang was appointed Vice Minister of Justice in the ninth month.\n\nAt the beginning of the Shaosheng era, a candidate from Hailing asked the Master about his examination prospects. The Master said, \"Vice Minister Lu will come, and the entire city will wear green.\" In the subsequent examination, He Chang, Yan Bang, Guo Guan, Zhang Zhichang, Li Bin, and Guo Yuanyu passed. When Lu Nongshi, the prefect, hosted a banquet for them, Palace Attendant Zha Yingchen composed a poem containing the lines: *\"I await the day Huang Ba is summoned as minister; / You must believe the words of Elder Xu are divine.\"*\n\nBefore Li Bin passed the imperial examination, his mother, Madame Jiang, asked the Master for a divination. Upon seeing her, the Master immediately said, \"This year is not prosperous; your ancestors possess hidden virtue.\" Madame Jiang asked again, and the Master replied, \"Come back when the Wood element is flourishing.\" That year, Li Bin received a recommendation. Madame Jiang visited the Master again, who said, \"Now is the time when Wood flourishes.\" Li Bin indeed passed the examination.\n\nIn the *bingzi* year of the Shaosheng era (1096), Shang Shizhi traveled to Weiyang for the examinations and asked the Master for guidance. The Master said, \"I carry my own burden, yet there is one born in the *hai* year accompanying me.\" That year, Shang passed the examination, and the top candidate from Hailing, Wang Shan, shared the same *xinhai* birth year as Shang.\n\nIn the Shaosheng era, Xia Rishi, a Daoist priest at Tianqing Abbey in Suzhou, requested a written divination and received the characters *shang wen san shi san* (上闻三十三, \"reported above, thirty-three\"). At the time, he was twenty-five years old and died eight years later.\n\nThe scholar Lu Biaomin visited the Master, who said, \"I give you the character *shi* (實, \"truth\"),\" but when Lu looked, it was written as *yin* (寅). The Master added, \"This is not for you; it is for your father.\" Soon after, Lu’s grandmother passed away.\n\nMagistrate Liu of Rugao, Registrar Cai of Hailing, and Constable Chen of Xinghua visited the Master together. The Master wrote the character *shi* (矢, \"arrow\"). Turning to Liu, he said, \"Add a mouth to make *zhi* (知, 'knowledge').\" To Cai, he said, \"Add *ju* (巨) to make *ju* (矩, 'rule').\" To Chen, he said, \"Add *dou* (豆) to make *duan* (短, 'short').\" Shortly afterward, Chen fell ill and died. Liu was habitually cunning, so the Master admonished him. Cai, whose given name was Juhou (\"Residing in Thickness\"), later became an attendant official.\n\nJiang Daogan, suffering from illness, sought a written divination. The Master wrote *meng* (萌, \"sprout\"), and he died on the tenth day of the tenth month.\n\nA clerk’s wife from the prefecture came to see the Master. Before she could speak, he rebuked her, saying, \"What face do you have to come here? Even returning what you stole would be too late.\" The woman left in terror. The next day, she was arrested by the authorities, for several days earlier, she had murdered a girl from the Xing family to steal her clothes.\n\nShang Shizhi visited the Master due to a minor illness. The Master spoke to him, saying, \"The Dao gives birth to the One; the One gives birth to the Two; the Two give birth to the Three; the Three give birth to the myriad things.\" As he saw him out, he repeatedly called for *ma ya xiao* (馬牙硝, \"sodium sulfate\"). His tone seemed to carry a warning or admonition. Upon returning home, a physician prescribed medicine that included sodium sulfate.\n\nTransport Commissioner Zhang Zu requested a written divination, and the Master wrote *long* (珑, \"gem\"). Zhang remarked, \"A dragon in the earth is like a fish out of water, and *long* resembles a tomb.\" Soon after, he fell ill and died.\n\nCao Shunyuan, a judicial officer, visited the Master and received the characters *fu fu yan shi* (夫夫檐石, \"husband, husband, eaves, stone\"). His household had two pregnant women. The scriptures contain the phrase *\"bearing the weight of heaven and carrying stones,\"* and *fu* (夫) signifies two persons.\n\nActing Professor Bao You and Legal Clerk Wu La visited the Master. The Master said, \"The two officials are well-versed in the Three Teachings.\" Wu replied, \"It is precisely because I am not well-versed that I hope the Master will point me toward one gate.\" The Master said, \"There is the Gate of Perfect Penetration and the Gate of Prajna.\" He then expounded on the Three Teachings. Wu asked, \"Though this is so, which gate should I enter?\" The Master replied, \"If you are well-versed in the Three Teachings, why do you ask which gate to enter?\"\n\nOne day, when several officials were preparing a Daoist ritual, they arrived at the abbey concerned that the funds they had brought might be insufficient. They wished to increase the amount.\n\nThe thought had not yet settled when he went to see the Master. The Master abruptly said, \"If you are to relinquish, then relinquish—why ask further?\" Acting Professor Bao visited the Master, who asked, \"What character is formed when water is added above the character *nei* (内)?\" Bao replied, \"There is no such character.\" The Master then asked, \"What if water is added below *nei*?\" Bao said, \"There is no such character either.\" The Master asked again, \"What if water is added to the side?\" Bao answered, \"*Rui* (汭).\" The Master laughed and said, \"This character is precisely what we need today.\" Later, when Bao returned, the Prefect summoned him to dine at the Western Tower. As he took his seat, he saw on the wall a poem left by Dongpo, in which the character *rui* (汭) appeared, coinciding with the day’s events.\n\nOne day, at the home of the wealthy man Yang Gongzuo of Shanyang, an unusual fragrance was detected. Suddenly, an old man carrying a broom passed through the courtyard. At that moment, the Daoist nun Xu Daosheng of Huaiyang was present. Startled, Yang asked about him, and Daosheng said, \"This is the Divine Elder Xu.\" Yang stepped forward to bow, but the old man had already vanished, leaving only a wooden *dou* (斗) on the ground. Yang then went with Daosheng to see the Master, who confirmed that the old man was the one they had encountered. When asked about the *dou*, the Master said it was the *dou* from the pillar of the Three Officials Hall. He added, \"We wish to repair this hall.\" Yang Gongzuo donated several hundred thousand coins to rebuild it.\n\nAt Gaoyou, Sang Zhengguo was preparing to take the imperial examination and sought the Master’s counsel. The Master wrote three characters on a yellow-green slip: *huang lü jian*. The scriptures speak of *huang xian bai jian*, but the Master omitted *bai* (\"white\") and replaced *xian* (\"thread\") with *lü* (\"register\"). That year, Sang indeed passed the examination.\n\nHu, the Registrar, was attending his father when the elder retired from office and returned to Taizhou. The Master said, \"This Registrar Hu is like Registrar Pan.\" Earlier, Pan had also attended his father in retirement and returned home, whereupon his father passed away. Soon after, Hu’s father likewise died.\n\nZeng, the Revenue Officer, visited the Master on the Double Ninth Festival. As he took his leave, he said, \"I shall call again in the spring.\" The Master replied, \"We shall meet on this day next year.\" Zeng was delayed by affairs, and when he returned, it was indeed the Double Ninth of the following year.\n\nOld gardener Feng Wang had the Master’s portrait painted in his home and daily offered food and drink before it. One day, he forgot the offering, but the next morning, he carried a bundle of radishes to the temple storeroom. Seeing him, the Master said, \"You treated me well—I would have gone hungry yesterday had I not received a meal from the Qian family.\" The Qian family, too, made daily offerings of food.\n\nA young man of the Sun family visited the Master, who wrote three characters: *ri xia ren* (\"man beneath the sun\"). He added, \"Return home at once—today, an imperial messenger has received this same message.\" Sun hurried home, fell gravely ill, and died beneath the sun.\n\nMagistrate Zhang Lian, having been dismissed from office, was seeking a boat when he came to see the Master. The Master wrote two characters: *Ji Shui* (\"Auspicious Water\"), saying, \"Proceed as you intend.\" Zhang went to see the prefect, who told him, \"I have just assigned Zhou Yong’s boat to another.\" *Ji Shui* was indeed Zhou Yong’s name.\n\nVice-Director Zheng, bringing his family to see the Master, had a daughter who had just come of age. The Master suddenly remarked, \"Neither mother nor daughter may linger—the mother clings to the daughter, and the daughter to the mother.\" Soon after, the daughter fell ill and died.\n\nVinaya monk Weiyong of Baoyin Temple, along with several monks, visited the Master. The Master turned to Weiyong, took a rush cushion as if for meditation, and said to the others, \"None of you can sit as he does.\" The group did not understand, but later Weiyong left the monastery to reside at Baoning.\n\nDuring the Shaosheng era, Tang An of Wuwei Commandery visited the Master and had his portrait painted to take home, where he honored it with incense and offerings for a long time. His daughter-in-law had a three-year-old son, and Tang dreamed the Master said, \"Have this child leave home to become a monk.\" Upon waking, he told his wife Qin, who grew angry, deeming it an ill omen. Soon after, the child fell ill and died. Qin, enraged, cast the Master’s portrait into the river. Later, she contracted an epidemic and developed a paralyzed arm. Tang returned to see the Master, who said, \"Your wife cast me into the river, as if to drown me. Yet I was retrieved from the shore at Changlu.\" Tang was deeply ashamed and apologized before leaving.\n\nLater, a merchant from Tanzhou named Liu Zhen visited the Master, who suddenly said, \"I must thank you for saving me.\" Liu replied, \"Recently, at Changlu, I saw a scroll floating on the water. I retrieved it—it was your portrait.\"\n\nOne day, Lu Xi encountered the Master at the rear gate of the abbey. The Master asked, \"What is your surname?\" \"Lu,\" he replied. The Master said, \"Why not sit outside the gate? A relative is coming to visit you.\" He added, \"In two or three days.\" Lu returned home, and three days later, a relative named Shi Sheng arrived, only to fall gravely ill. Lu again sought the Master, who gave him a character (□). Three days later, Shi Sheng died outside Lu’s gate.\n\nCourt Gentleman Wang Anzhong once wrote his name and birth details, seeking a divination. The Master circled the three characters of his name and wrote eight more around them: *Qing Long, Bai Hu, Zhu Que, Xuan Wu* (\"Azure Dragon, White Tiger, Vermilion Bird, Black Tortoise\"). He said, \"This is all you need.\" Later, in the capital for a grand ceremony, Wang was assigned to officiate at the suburban altar. There, he saw the four spirit banners positioned exactly where he had stood.\n\nAnother time, Wang sought a charm for water. The Master said, \"No incantation is needed—on the fifth day of the fifth month, willow-branch water will suffice.\" Later, returning to Hangzhou, Wang’s daughter fell ill. A monk treated her by sipping water through a willow twig and reciting incantations—on that very day, the Double Fifth, the girl died.\n\nPrime Minister Zhang Tianjue once moored his boat before Guangshan Temple in Weiyang. On the shore, he saw a Daoist’s hand emerge from a hut, plucking a comb from between his fingers to groom his hair. The man’s bearing was extraordinary. Zhang hastily invited him aboard and asked, \"The one combing his hair just now—was that not a sword?\" The Daoist assented. Zhang said, \"May I see it?\" The Daoist, as before, took a comb from his fingernail—a slender, silver-white object about three inches long. With a breath, it transformed into a sword. Zhang took it and examined it—it was indeed a sword. As they spoke, the Daoist vanished.\n\nLater, Zhang visited the Master at Hailing and, before he could ask about the encounter, the Master handed him a slip of paper with two characters: *dong wen*. The first character, *dong* (\"cave\"), had its middle stroke lowered to form *shui* (\"water\"), while the second, *wen* (\"script\"), was two mouths (*kou*). Thus, Zhang knew the Daoist by the water was Lord Lü.\n\nIn his leisure, the Master often stood beside the incense cabinet. Suddenly, two beautiful women entered hand in hand, singing as they approached him. The assembly was astonished, but after a while, they departed. Two elders, Chen and Li, stood nearby and asked, \"Who were they?\" The Master replied, \"The two immortal sisters, He and Jiang.\" The crowd rushed after them but saw them vanish at the gate.\n\nWhen Academician Gong Shenfu was first exiled, a follower sought a divination from the Master, who wrote eight characters: *xing shi qi si bai gu cheng ren* (\"Rise from the corpse, revive the dead, turn white bones into living men\"). The scriptures say: *hui hai qi si* (\"Return the bones, raise the dead\").\n\nThe abbot of Tianqing Abbey composed a fundraising petition and asked the Master to write the heading. The Master said, \"This petition will be resolved by someone with a ‘mouth’ in their name.\" Among those who contributed, many had the character *kou* (\"mouth\") in their names or surnames.\n\nA certain Elder Li often interpreted the Master’s written characters. One day, he asked for a divination, and the Master wrote two characters: *shi fei* (\"right and wrong\"), but with *shi* incomplete (是□). Li could not decipher it. A Daoist named Xu said, \"The Master means that in your interpretations, there is little right and much wrong.\"\n\nThe Master laughed.\n\nA certain Elder Chen, who also often interpreted the Master’s written characters, once stood by his side. The Master gave him a slip of paper on which he wrote *guo du san jie* (\"crossing the Three Realms\"). Chen was overjoyed, saying, \"The next line in the scripture reads *wei deng xian weng* ('ascend to the rank of Immortal Elder').\" A Daoist named Xue Gu said, \"This is not an auspicious sign.\" Xue Gu was ill at the time, and a crane stood in the courtyard. The Master prayed for him, saying, \"*Guo du san jie*.\" After reciting it several times, the crane died within days. Soon after, Chen indeed passed away.\n\nJiangyan’s tax officer, Marshal Shen Fu, had obtained a talisman and water from the Weizhou fangshi Zhang Zigao during the Shaosheng era. He had abstained from grain for nearly two months. When he came to see the Master, the Master wrote seven characters for him: *qi shang shi shui zhi duo* (\"the excess of his food and taxes\"). The Master meant to warn him against abstaining from grain, but Shen did not understand. A month later, he died.\n\nAttendant Gentleman Yuan Fu was appointed magistrate of Haimen in Tongzhou and brought his family to see the Master. Fu personally brewed a cup of tea and offered it to the Master. The Master took a sip, then returned it to Fu, saying, \"You and yours should drink it all for peace and ease.\" Fu had not yet drunk it when, along the way, a Daoist priest arrived and bowed to him. Fu then gave the tea to his wife and children to drink. Upon returning to the boat, his family asked, \"Just now, the immortal told everyone to drink the tea, but why did the magistrate not drink it?\" Fu then realized he had not drunk it himself and thought nothing of it. When he arrived in Haimen, he died, while all who had drunk the tea remained safe.\n\nIn the Jiaxu year of the Shaosheng era, Tianqing Abbey held an Upper Prime Offering for three evenings, concluding on the sixteenth day of the first month. Daoists Wang Shanxiang and others were cleaning the ritual vessels in the storage when they saw a man of imposing appearance, dressed in a plain cloth robe, approach the storeroom and bow deeply. Shanxiang and the others paid him no mind, and he left. When the Master arrived, he asked, \"Why did you not invite the Daoist to drink tea?\" Shanxiang replied, \"We were too busy.\" The Master rebuked him, saying, \"That was Lord Lü come to visit me.\" Shanxiang pursued him but could not catch up.\n\nZhu Zongyin of Xinzhou sought a written divination to determine whether he should leave home to cultivate the Dao. The Master wrote *san jie wu di* (\"Three Realms, Five Emperors\") and said, \"You may go to Zhenzhou.\" He then entered Yizhen Abbey. Later, when tested on the scriptures, he drew the characters *di lie* (\"Emperor’s rank\") at the beginning of the text. That year, he passed the examination. The characters he had been assigned to explain were *san jie wu di* at the top and *lie yan shang qing* (\"ranked among the Supreme Clarity\") at the bottom.\n\nA candidate from Mingzhou named Qin had repeatedly failed the imperial examinations. He asked the Master, who said, \"When you see Zhang Guolao crossing the sea in an iron boat, you will pass the provincial examination.\" Later, Qin traveled to the capital for the examination. While sitting in Jingde Temple, he saw a mural behind him depicting exactly what the Master had described. That year, he passed.\n\nDaoist Liu Shouning was raising funds to cast a bell and asked when it would be completed. The Master said, \"Only after three fires.\" After two failed castings, he asked the Master again, who said, \"You must go to Tongzhou.\" He then went to Jinghai, where he found a man named Zhang Lengzi. As Zhang was about to strike the furnace, he suddenly saw the Master arrive. The crowd joyfully welcomed him, but he vanished at once. The bell was then cast successfully in a single attempt.\n\n---\n\n*The Record of Master Xu, the Serene and Harmonious Master of Emptiness and Stillness, Volume One* concludes.\n\n*The Record of Master Xu, the Serene and Harmonious Master of Emptiness and Stillness, Volume Two*\n\nOn the first day of the ninth month in the Yihai year of the Shaosheng era, the Master shut his door and did not emerge. He neither ate nor drank. When Daoists knocked at his door, there was no sound. On the seventh day of the eleventh month, Prefect Lu Nongshi arrived and ordered the Daoist overseer to knock. After a while, a faint sound was heard. Lu called out, \"I have been here for some time. Since you have not emerged, the people have been deeply anxious.\" The Master then came out to meet him. Lu asked him about it, and the Master said, \"I was attending to a minor matter.\"\n\nA few days later, someone presented four purple-flowered stone pillars. While the Master had not yet emerged from his seclusion, the Daoist overseer Xu Shoujie also knocked at his door and bowed in request. After the Master came out, he said to Prefect Lu, \"This vice-minister is difficult to teach.\" He then demanded wine. Lu suspected that, as the Master usually did not drink, his request must have a meaning. He quickly brought wine, but the Master did not drink it. Instead, he said, \"This is a thing that corrupts people.\" Lu asked, \"Is there nothing divine about it?\" The Master replied, \"That is not the case, but it is no different from wealth. If one does not guard against it upon reaching this point, they are difficult to teach.\" This was specifically to admonish Shoujie.\n\nThe Master then asked for paper and brush and wrote: *huo xian pin kong er zi, shou xin sheng duo ji, nan gan xie Tai zhou Xu Shoucheng ti xi, xiang hou qu bu de ye, jin tui jian nan, sui fa qian xin, zhui jian xian wang jiu yuan, Shaosheng er nian shi yi yue chu qi ri wei* (\"Perhaps the first two characters are *pin kong* ['rank' and 'emptiness']; keeping faith brings much good fortune. Grateful for the support of Xu Shoucheng of Taizhou, but henceforth one must not act recklessly. Advancing or retreating is difficult, so I have resolved to sincerely perform a rite for the long-departed ancestors. Done on the seventh day of the eleventh month in the second year of the Shaosheng era.\"). In all, fifty-two characters were written. He handed them to Shoujie, saying, \"You may have them today, but I will take them back in a few days.\" No one could understand their meaning.\n\nPreviously, at the end of the Yuanyou era, when the Three Clarities Hall was being rebuilt, the Master had told Shoujie, \"You should withdraw your name and donate all your robes and alms-bowl to construct the hall.\" Shoujie did not comply. Now, the Master admonished him again, but he still did not understand. On the seventh day of the eleventh month the following year, Shoujie died.\n\nA soldier from Jiangyan named Wang Li was gravely ill and near death. His wife went to the prefectural market to purchase funeral items when she encountered her neighbor, an old woman surnamed Li, and together they went to see the Master. The Master said, \"The Wang family’s household affairs will become the Li family’s.\" Upon returning home, Wang Li’s illness was cured, but the Li family’s son died, and they used the Wang family’s coffin to enshroud him.\n\nWang Hui asked the Master to select a day for planting early rice. The Master said, \"The second day of the sixth month is good.\" The Daoists said, \"Is that not too late?\" Hui had always trusted the Master’s words, so he returned home to wait. That year, there was a drought, and those who had planted earlier saw their crops wither. Rain fell at the end of the fifth month, so he planted on the second day of the sixth month. The harvest was twice that of a normal year.\n\nQu Yuan of Haimen offered the Master a large silver incense burner. The Master rebuked him, saying, \"Will this not mislead other monks?\" Yuan repeatedly begged to leave it, but the Master refused. Yuan withdrew and said to the Daoists, \"Originally, I made this burner to offer to the Great Master Sengqie in Sishang. Now, I have instead offered it to the Master, hence his words.\"\n\nThe Master then saw Yuan again and said, \"You need not see me. Go speak with Elder Jie instead.\" Yuan returned home and died of illness. Yuan had a eldest son named Yuan Zeng, styled Xiaojie, who had also died but remained unburied, so father and son lay together in the same chamber.\n\nHan Shunyan had two sons who fell ill with an epidemic. He asked the Master, who wrote the character *sheng* (生). Shunyan was overjoyed. Later, one son died, while the other recovered. Li Bashi explained, \"The one who recovered must be *chou sheng*—the character *sheng* (生) is composed of *niu* (牛, ox) and *yi* (一, one).\" Shunyan confirmed this was so.\n\nChang Qing of Huaiyang Commandery lived in a village and was wealthy. Near his home stood a mountain, its western slopes bordering Fuli, rich in stone but of no use. One day, an old man knocked at his door and said, \"This mountain holds brocade stone. If you can take it to offer to Tianqing Abbey in Taizhou, will you not achieve great merit?\" Qing laughed, \"How could this mountain have brocade stone?\" The old man replied, \"Take it and doubt not.\" Suddenly, the old man vanished. Qing told his wife, née Cao, who said, \"Try quarrying it.\" Indeed, they found stone with veins like purple brocade.\n\nQing and his wife came to see the Master, who was the old man they had met. Before they could speak, the Master wrote *huasheng zhutian* (化生诸天, \"transformed and born among the heavens\") and handed it to them. Qing and his wife bowed to the Master, saying, \"We have not yet transformed a single thing—why bow?\" Qing asked, \"What would you have us transform?\" The Master said, \"Stone beams and stone pillars.\" Qing then returned to Huaiyang to quarry them. Within a year, the work was complete. They transported the stones by sea, but encountered a violent storm. The sailors were helpless, so Qing called upon the Master for protection. Suddenly, all went dark, and in the lightning’s glow, they saw divine beings swiftly lifting the boat. The next day, the wind ceased, and they had already reached Haimen, docking at Chaiwu. Qing went ahead to see the Master, who said, \"The journey was perilous. Had it not been for this, you would not have arrived so swiftly.\"\n\nGeng Chun, a Gentleman for Meritorious Achievement, wished to arrange his eldest son’s marriage but received no answer after repeated inquiries. One day, the Master wrote the characters *jiao yin* (角引, \"horn\" and \"pull\") and said, \"The same as your grandmother’s.\" Later, he married a woman from Tongzhou named Zhang, whose grandmother was also surnamed Zhang.\n\nTan Yong, a monk who had retired from the Stone Pagoda Monastery in Yangzhou, returned to Tianhe to bid the Master farewell. The Master wrote the character *xiang* (香, \"incense\") and gave it to him. Later, he resided at Xiangshan in Siming.\n\nZhang Sui, a wealthy man, was appointed military commissioner of Yangzhou but had not yet assumed office when he visited the Master. The Master took paper and wrote a large *wang* (亡, \"death\") character, adding forty-nine dots beside it. When Zhang Sui arrived in Yangzhou, he died before a month had passed. His younger brother, Cheng, also died forty-nine days later.\n\nA great merchant of Jiangdong named Li visited the Master, who drew water and offered him several cups to drink. Li declined, saying he could not drink more. The Master said, \"He drinks a whole river, yet you cannot drink a few cups?\" Li, ashamed, apologized and begged to hold a grand ritual feast to atone for his past transgressions. The Master permitted it. Li had once sailed the river with another merchant, coveting his wealth. Midway, he got the man drunk and pushed him into the river.\n\nChen Hu, a presented scholar, had a fifteen-year-old daughter who bowed and burned incense before the Master. The Master bit her neck twice, then tried to bite her again. The girl screamed in fear and fled. That night, she hanged herself. The next morning, Hu asked the Master, who said, \"This girl was entangled by a karmic debt from a past life. I intended to spit on her three times, but your daughter fled. I knew she would not escape her fate. You may examine the rope.\" Hu returned home and inspected it: of the three strands of the rope, two were broken, leaving only one intact.\n\nLu Nongshi, the Left Assistant Director, was serving as prefect of Tai when he received word that Zeng Zikai had been appointed as his replacement, though Lu had not yet received a new commission. Doubtful, he asked the Master, who said, \"Minister Lu replaces Minister Zeng, and Minister Zeng replaces Minister Lu.\" Lu said, \"I once replaced Minister Zeng in Jinling.\" The Master repeated his words and added, \"The coast is a good place to serve.\" Ten days later, he was appointed to Haizhou. Later, Zikai moved from Tai to Hai, and they again replaced each other.\n\nLu once submitted a memorial to the court and asked the Master about it. The Master wrote the character *zheng* (郑). Then he asked, \"What character is formed when you add a hand to *zheng*?\" Lu said, \"*Zhi* (掷, 'to cast').\" The Master said, \"It has been cast.\" Lu grew anxious. The Master said, \"After three years, it will no longer be cast.\" When Lu left Hailing to bid the Master farewell, he asked, \"How will this journey be?\" The Master said, \"There are many Daoists, and vegetables are expensive.\" Later, Lu was transferred from Hai to Cai. Shortly after, he was summoned to court and appointed a vice director. His earlier memorial, which had gone unanswered, was now addressed, leading to his promotion. Thus, the Master’s words about three years were fulfilled.\n\nLu once received the four characters *fu tian dan shi* (负天担石, \"bearing heaven and shouldering stone\"), a sign of high office. While in the capital, he sent someone to ask the Master for a written answer, who wrote *zhong lao* (终老, \"to grow old\"). Later, Lu was appointed prefect of Bozhou, where the Temple of the Supreme Lord Lao stood. When he fell ill, he again sent someone to ask the Master, who wrote *shang san shi er er* (上三十二二, \"thirty-two or two above\") and five characters in all. He added, \"The two characters below form the left side of *tian* (天, 'heaven'), making *zuo cheng* (左丞, 'Left Assistant Director'). No need for the *ren* (人, 'person') character.\" Lu died in Bo on the twenty-second day of the third month.\n\nLin Ling’e sought a written answer during the Shaosheng era (1094–1098) and received the three characters *lin xia ren* (林下人, \"a person beneath the trees\"). In the early Zhenghe era (1111–1118), he responded to an imperial summons from Chuzhou.\n\nWhen Tianqing Abbey was rebuilding the Hall of the Three Pure Ones and raising the beams, the Daoists informed the Master, who said, \"The upper is done, the lower is done.\" Soon after, Minister Lu arrived. Looking up at the beam’s inscription, he saw it read *Daozheng Quanyuan* (道正劝缘, \"The Daoist Director Exhorts Contributions\"). Lu said, \"This is the work of the Divine Master—what have others to do with it?\" He immediately ordered the beam lowered and had the Divine Master’s name inscribed instead before raising it again. The assembly said the Master’s words had been fulfilled.\n\nLater, the abbey was renamed Xianyuan Wanshou Palace, and a new Hall of the Three Pure Ones was constructed, with the former hall repurposed as a lecture hall. Thus, the hall plaque was taken down, and a lecture hall inscription was erected in its place. In the eighth year of the Zhenghe era (1118), the lecture hall was again converted into a hall, where the Sacred Ancestor was enshrined, and the lecture hall inscription was removed to make way for a new hall plaque.\n\nThe Daoist Kan Ruozhuo traveled to Shanyang to visit his family and bid farewell to the Master. The Master inscribed the characters *qu ye* (去野, \"departing the wilds\") for him. Upon reaching Shanyang, Ruozhuo passed away.\n\nLady Pei, the wife of Zhou Zhi, fell ill and requested a character based on her birth month. Born in the sixth month, the Master added a *shi* (十, \"ten\") beneath the *liu* (六, \"six\"), and Lady Pei ultimately did not recover.\n\nMinister Shen Xi once sought a character, saying, \"I wish to know the fortunes and misfortunes of my life.\" The Master wrote *dai jing wu di* (待经五帝, \"await passing the Five Emperors\") and added, \"One cannot advance beyond this point.\" The character *shi* (侍, \"attendant\") was written as three stacked *ren* (人, \"person\"). Later, Shen’s son Zhao became a minister, concurrently serving as Imperial Lecturer and Imperial Reader, before being appointed to govern a prefecture.\n\nZhao had long consumed alchemical elixirs and preferred drinking water, unable to eat dry food. He wrote to the Master, asking if he might gradually introduce dry food to nourish himself, and awaited a reply. One night, he dreamed the Master gave him a steamed bun, urging him to eat it, but he could not swallow it after several attempts. The Master said, \"You must force yourself to eat it.\" He managed to consume half, and the next day, he could eat dry food.\n\nNai Guangshun would often visit the Master, who said to him, \"You live behind the city—why not move to the east side?\" For three or four years, Guangshun only replied that he lacked the means to relocate. The Master grew angry, and Guangshun asked him to select an auspicious date. The Master said, \"The fifth day of the fifth month is good.\" Later, due to a great flood, Guangshun moved his residence on the fifth day of the fifth month.\n\nWhen Guangshun sought the Master’s advice on arranging his son’s marriage, the Master said, \"Among eight households lighting lanterns, only yours does not—proceed with the wedding before lanterns are lit.\" At the time, in the neighborhood where marriages were being arranged, eight of the nine families with brides over nine years old encountered misfortune, while only Guangshun’s household remained unharmed.\n\nGuangshun’s seven-year-old daughter suffered from convulsions. Upon seeing the Master, he was told, \"Quickly ask Daoist Dai and visit Scholar Chen.\" Guangshun inquired, and Dai said, \"I have no medicine, but I hear Scholar Chen recently compounded the Supreme Treasure Elixir, which specifically treats this illness.\" He went to seek it, but by the time the medicine was obtained, it was too late to save her, and administering it proved ineffective.\n\nUpon seeing the Master again, he said, \"Congratulations, though you shall not become a father-in-law.\" Upon returning home, the girl had already revived, and later left the household to become a Daoist nun.\n\nThere was a man named Qian Zhen who suddenly died, his heart still faintly warm. His family could not bear to enshroud him, and after five days, he revived. He recounted that at first, he was pursued by someone and brought before an official bureau where records were examined and affairs adjudicated. He was then sent to supervise road repairs east of Rugao County. Once the task was completed, an underling reported, \"There is still one more road to be overseen—let this man supervise it.\" The official said, \"Zhen is a disciple of the Divine Assembly; allow him to return swiftly.\" Yet they still summoned Zhen, permitting him to oversee the work. After Zhen revived, Xu Zhen had just returned from outside when he suddenly suffered a headache and died that very night.\n\nDianzhí Yang Gongzuo was traveling to Tiantai to oversee wine production when he came to see the Master, who wrote the characters for \"Double Fifth.\" Later, at the age of fifty-five, he passed away, and from his encoffining to burial, another fifty-five days elapsed.\n\nWhen the monk Fasheng first came to see the Master seeking to leave the household, the Master said, \"You cannot become Avalokiteśvara Bodhisattva; you may only become Kṣitigarbha Bodhisattva.\" Later, he went to a monastery to leave the household and was tonsured during the scripture examination. For Avalokiteśvara wears a crown upon the head, while Kṣitigarbha alone reveals his bare topknot.\n\nHuang Qi had no sons and sought a written prediction. The Master wrote the four characters *yuan tai ping yu*, which he interpreted as \"the first month of the celestial stem.\" Despite this inscription, Huang Qi remained childless, for his capacity for conception and nurturing was incomplete.\n\nAnother time, someone asked the Master about his younger cousin’s illness. The Master said, \"Your cousin is unwell—what can I do?\" Several days later, she passed away.\n\nWhen Zhai Ping fell ill, his wife inquired of the Master, who said, \"A cellar, a cellar.\" By the time she returned home, Ping had already died, and she then realized his words referred to the character for \"cellar.\"\n\nA man from Zhejiang, Meng Shen, was skilled in leatherwork and wished to change his profession to seek an official career. Upon meeting the Master, he received the five characters *zhi xin yi jiu ge*. Meng understood and returned to the capital with his former craft, where his skills flourished.\n\nBian De went to Sishang to burn incense but, upon reaching the border, suddenly lost his way. After traveling westward over a mile, he saw countless bleached bones, as if in a place untrodden by humans. An old man called out, \"This is not the path—come this way.\" Bian then found the official road. Upon returning to see the Master, the Master said, \"You took the wrong path on your incense-burning journey.\"\n\nChen Zongshi, a Daoist of Dongling Abbey in Changzhou, had his name recorded during the Shaosheng era and sought a written prediction from the Master. The Master said nothing but merely added the character for \"mountain\" above the character *zong* in his name. When pressed repeatedly, the Master said, \"It is only this.\" On his way back, Zongshi heard that Dongling Abbey lacked a resident Daoist, and the townspeople petitioned the county magistrate to appoint him for ritual purification. When the official notice arrived, his name was written as *Chongshi*. Zongshi said, \"That is a mistake.\" The clerk replied, \"It was changed to avoid the magistrate’s personal taboo.\"\n\nWang Shaoqing Shifu, during the Shaosheng era, was appointed magistrate of Poyang and sent someone to request a written prediction. He received the character for \"longevity\" with its mouth missing. While traveling through Jinling, his post was changed to Shouzhou. On the day he assumed office, he received the death notice of his eldest brother, which fulfilled the missing \"mouth\" of the character.\n\nWhen Master Lü Daqing Zhifu served as Transport Commissioner and met the Master, he was given the character *ang*. Later, he was appointed prefect of Suzhou, then transferred to Mingzhou, and again to Raozhou, considering himself a three-time local governor. While in Raozhou, one day upon returning from outside, he looked up at the prefectural sign and suddenly understood the meaning of *ang*.\n\nLü once brought his family back to Longshu and bid farewell to the Master, who asked, \"Is there a well there?\" Lü replied, \"There are several wells at the residence.\" The Master said, \"Many wells are good.\" Upon arriving in Shuzhou, Lü encountered a conflagration.\n\nWu Chang sought a written prediction in the Jiaxu year of the Shaosheng era and received the three characters *san san bi*. At the time, Wu was not yet an official but had long harbored an interest in talismanic arts. In the Bingzi year, while serving his father in an official post in Jianghuai, he received the *Orthodox Tianxin Method* from Master Wang of Magu Mountain at Yanchang Abbey. Master Wang said, \"I have just realized the meaning of the characters you received. In the scripture, there is a passage: 'The heart is reported to the thirty-two heavens; thirty-two bows are made; the eyes are closed in silent contemplation.' The Master concealed the secret of *Tianxin* within these three sentences: the three characters refer to the *Tianxin* secret method, and *bi* means 'secret.'\"\n\nDuring the Yuanfu era, Cai Chengyi Si served as the registrar of Liuhe. When he observed mourning for his mother and met the Master, the Master asked, \"Where do you reside?\" Cai replied, \"Yizhen.\"\n\nThe Master said, \"Come reside here, and let me heal my ailing child.\" The following year, Cai accordingly brought his family. His eldest son, who had been afflicted since childhood with an inability to walk, was offered to the Master as an incense attendant. The Master named him Shanren, and within a year, the boy could walk. Four years later, he accompanied the Master to the capital and became a Daoist. When Cai’s wife, née Zhang, met the Master, he wrote for her a Daoist incantation: *\"In the first month, a long fast purifies the soul and spirit; the myriad qi remain everlasting, untouched by suffering; the body radiates light.\"* These were twenty-two characters in total, though the character for \"suffering\" was written as *kang*. Within days of receiving the writing, the entire household fell ill. Cai sent someone to inquire of the Master, who gave the messenger a dozen or so *linqin* fruits and a single plum, saying, \"Give each person one *linqin*, but give the second mistress the plum.\" Those who ate the *linqin* recovered, while the one who ate the plum died.\n\nCai once sought consecrated water from the Master to cure Zhang’s illness. After drinking it, she recovered, and Cai offered gold and silk in gratitude. The Master refused, saying, \"I require you to undertake a great act of karmic merit.\" When pressed further, he replied, \"It will come in time.\" During the Chongning era, Cai brought his family to visit the Master. The Master led them to the mural of the *Scripture of Salvation*, where they beheld the transformed visages. He also inscribed on Cai’s body the four characters *\"Shenjing Taiyin.\"* Several days later, Cai fell ill, and when he asked the Master about it, the Master said, \"Performing meritorious deeds will avert harm.\" At that time, the Jade Emperor Pavilion was being rebuilt, so Cai pledged to raise funds from ten thousand patrons to commission statues of the Jade Emperor and the Thirty-Two Heavens. Once Cai recovered, he returned to Qiantang, where he raised funds to carve wooden statues, along with attendant figures, ritual vessels, flowers, and fruits for offering. Later, he lived seventeen more years.\n\nCai’s son-in-law, Tian You, visited the Master on account of his mother’s illness. The Master wrote the characters for *\"mountains, rivers, forests, and trees,\"* and Tian’s mother passed away. In the third year of the Yuanfu era, Quan Yanbo traveled to take the autumn examinations. Three days before the results were posted, the Master sent his disciple Zhou Xiyuan to Quan’s home with a message: \"The Divine Master sends word of your success.\" Quan asked if there were any other instructions. Xiyuan replied, \"When the Master spoke to me, he only raised his thumb.\" When the results were announced, Quan was selected as the top candidate.\n\nXie Gongju of Chengdu, a merchant, arrived in Zhenzhou during the Yuanfu era. He had sold all his goods except for a few solitary wooden boats. Unable to find buyers, he encountered an old man who said, \"Why not go to Hailing and seek out Xie Xun? The salt fields there require such boats.\" He went to Hailing and sold them. Upon meeting the Master, he realized it was the old man he had seen earlier.\n\nWu Jiacheng, the magistrate of Taixing, visited the Master, who immediately concealed himself. Wu withdrew and ascended the Hall of the Three Clarities. The Master emerged and called to his attendant, saying, \"Why has that official not departed?\" The attendant replied, \"He has not yet taken leave of the prefectural authorities.\" The Master said, \"He cannot leave today, nor can he leave tomorrow.\" The next day, Wu suddenly developed a debilitating foot ailment.\n\nWhen the high official Qi Zhan met the Master, the Master asked, \"How old are you?\" Qi replied, \"Sixty-five.\" The Master said, \"In five more years, you will be seventy.\" Qi died at seventy.\n\nThe loyal and steadfast military officer Pu Zhen, afflicted by wind-stroke and unable to walk, was carried in a reclining sedan to meet the Master, leaning on a staff and supported by several women to reach the hall. At first sight, the Master grew furious, saying, \"You have been nourished for a thousand days as a soldier—with such infirmity, what use are you?\" He struck with his staff at those supporting Pu, then struck Pu himself. Pu fled to avoid the blows, and in his haste, found himself running as if fully recovered.\n\nZhang Ganchu of Huaidong, bearing a compass to meet the Master, was promptly told, \"Your esteemed father, the Court Gentleman for Consultation, has already secured an appointment—you are to be dispatched to Lizhou.\" Later, it was reported that he had indeed been assigned as the Investigating Censor of the Lizhou Circuit.\n\nGe Guang, suffering from an illness without sweating, sent someone to pray to the Master, who wrote the four characters *Di Yuan Yu Zhai* and gave them to him. As there was a passage mentioning *Di Yuan Yu* in the *Qi Jing*, Ge immediately went to the abbey to perform a purification ritual. By midday the next day, he had broken into a sweat and recovered.\n\nGe, having no sons, asked the Master, \"The guardian spirit’s statue in the supervising student’s hall has been damaged. I wish to have it recast—what should its appearance be?\" The Master said, \"Make it a dignified and solemn countenance of a young man.\" Ge followed his instruction, and the following year, he had a son who resembled the statue. Later, he had two more sons, both dignified and solemn.\n\nZhu Zhaoyan, mourning in Qianshan, was invited by the county magistrate to oversee the local academy. He sent someone to Hailing to request a written charm from the Master, who wrote *twenty-four, twenty-four*—six characters in all. At the time, the academy had exactly twenty-four students. When the number later increased by a few, Zhu grew doubtful of the charm’s efficacy. Yet soon, some students left, and the number never exceeded twenty-four—though he never understood the repeated inscription’s meaning. An elder of the village remarked, \"Previously, an official in mourning came here to oversee the academy, and the number of students never exceeded twenty-four either.\"\n\nThere was a certain Dong Qing who, during the Yuanyou era, had sought ordination at Tianqing Abbey but was bullied by the community and lacked the courage to proceed. One day, upon meeting the Master, who was then eating, the Master grasped his hand, carried his rice bowl, and led him straight to the latrine. The Master himself took over a hundred bamboo slips, drew water to wash them, and while cleaning, also fed Dong. Moved and enlightened, Dong bowed and said, \"I wish to perform this task myself.\" From then on, he remained at the abbey, diligent to the end.\n\nIn the winter of the third year of Yuanyou, a street Daoist from Huaixi returned and suddenly went mad. In the bitter cold, he wore only a single layer of clothing, clutching a scroll, speaking incoherently. At times, he groaned as if being tortured, confessing his transgressions. He also carried a box and basket to the Master’s hall, spreading out their contents before him and kowtowing in supplication. The Master struck his chest several times with his fist, and the man suddenly collapsed, drenched in sweat like rain, before regaining his senses.\n\nThe Venerable Master Shi Huaisheng of Chongzhen Abbey in Jintan, a Daoist of high attainment, had once served alongside a Daoist named Li under Master Shen as a street attendant. Li had once hidden money in his shoe to test the Master. Huaisheng said, \"This is not right.\" When they both met the Master, he exposed Li’s deception, and from then on, the Master harbored the intention to spiritually transform Huaisheng. After the Master’s ascension, Huaisheng resided at Chongzhen Abbey, where he could foretell people’s fortunes with great accuracy and composed poems and hymns with remarkable fluency. In the *dingmao* year of Shaoxing, he passed away at the age of eighty-seven. Over a year later, Zhao Deming encountered him in Changzhou as if he were still alive, only to later learn that he had long since departed.\n\nDuring the Yuanyou era, as the late Emperor had no heir, he dispatched an imperial envoy bearing incense to consult the Master, who wrote the two characters *Ji Ren* in response. The envoy privately remarked, \"The character *ji* consists of eleven strokes.\" Later, Emperor Huizong ascended the throne—it had been an auspicious omen for his imperial name.\n\nWang Chen, in the third year of Yuanyou, was to take the southern official examination, and his wife went to see the Master. The Master said, \"Rejoice! Wang Xian—one son will suffice.\" That year, he passed the examination.\n\nWhen Attendant Gentleman Wang Gu served as Transport Commissioner and met the Master, the Master wrote the character *xing* (行) and smiled, saying, \"This character would be better with a *yu* (鱼) inside, but I fear you won’t get what you seek.\" Later, he was appointed Prefect of Hengzhou. He also once received the characters *five years*, and was subsequently transferred to command the forces in Guangdong.\n\nLü Heqing of the Ministry of Revenue, in the early years of Yuanfu, came from Weiyang to see the Master. Upon their first meeting, the Master shut his door and refused to emerge. Lü held continuous ritual feasts, and by the seventh session, the Master suddenly appeared, saying, \"Thank you, Minister Lü, for your meritorious work—return home at once, and if you arrive early, there will be cause for celebration.\" Lü was detained for a meal by the local officials, and by the next evening, as he traveled to Yangzhou, his home had just suffered a conflagration, the flames beyond control. Had he not returned, his family would have perished.\n\nZhu Pang of Hezhou, a candidate for the imperial examinations, inquired of the Master in the early Yuanfu era. The Master did not respond. When Zhu pressed further, the Master said, \"A scholar should write for himself—no need to ask for a character.\" Persisting, Zhu received this reply with a smile: \"Reluctant to cease, you’ll wait until the rain soaks your head.\" Later, under the Huo Renzhong examination roster, Zhu passed.\n\nZhu Pang once brought three portraits—those of Lü the Perfected, Immortal Jiang, and Master Shen—to show the Master. Unrolling Lü’s portrait first, the Master asked, \"Has he come before?\" Zhu replied, \"He has.\" \"How was he received?\" \"As a guest from Shandong.\" Unrolling Immortal Jiang’s portrait, the Master asked the same. Zhu said, \"She has come, though somewhat plump.\" \"How was she received?\" \"As an ordinary woman.\" Unrolling Master Shen’s portrait, the Master again asked, and Zhu answered as before. The Master said, \"He has come, and was treated as an ordinary man.\" \"Among the three, who is superior?\" \"Lü the Perfected is somewhat better.\"\n\nShi Xiang of Yancheng in Chuzhou met the Master during the Yuanfu era. The Master said, \"Return home quickly. In the ninth month, a Daoist will arrive—treat him well and make offerings.\" Shi returned home, and by mid-ninth month, while burning incense at night, he heard voices outside his door. It was a band of thieves. Realizing the Master’s words, he opened the door to welcome them, setting out wine, delicacies, gold, and silk to gift them. His household was spared from terror.\n\nShi had received two bottles of consecrated water from the Master. Pointing to them, the Master instructed, \"Give one to your family to drink regularly. Keep the other until an epidemic strikes the village, then distribute it.\" Shi followed the Master’s words, storing one bottle for three years—still sealed as before. Suddenly, a great plague erupted. Shi took the water to aid the afflicted; its fragrance was extraordinary, and all who drank were cured. When the water was exhausted, a set of mouse bones, white as snow, remained in the bottle—no one knew their origin.\n\nIn the autumn of the third Yuanfu year, Daoists Xu Ruogu and Xu Ruoxu, among others, accompanied the Master through the palace corridors. The Master suddenly said to Xu Ruogu, \"You must not suppress Master Xu.\" Xu, alarmed, stepped aside. At the time, Xu Ruogu was a monastic supervisor, while Xu Ruoxu stood among the assembly. By the Zhenghe era, Xu Ruoxu was appointed Right Street Supervisor, and Xu Ruogu became a Daoist Rectifier. In the early Xuanhe era, Xu Ruogu was granted the title of Gold Altar Gentleman, while Xu Ruoxu was appointed to the Hall of Serene Contemplation as Scripture Reciter and Left Street Registrar, later promoted to Collator of the Hall of Serene Contemplation.\n\nAt the end of the Yuanfu era, Minister Cai, stripped of his titles as *Duanming* Academician and *Longtu* Scholar, and appointed Supervisor of the Dongxiao Palace, came to see the Master. As he reached the temple gate, the Master came out to greet him. Cai requested a written character, and the Master wrote: \"All arrive before the Emperor,\" with the character *di* (帝) having one stroke branching into two legs below. Another time, the Master sent word: \"The two administrations—east and west—and the Minister of Military Affairs.\" By the early Chongning era, both Cai and Yuandu were summoned. Cai was soon appointed Chancellor, while Yuandu became Minister of Military Affairs.\n\nThe Master once gave Cai the characters *thirty-two heavens*. Later, Cai was appointed Vice Director of the Chancellery, promoted to Left Assistant Director, and then Right Chancellor—each appointment lasting twelve days. Yuandu once received the characters *immortal Dao, noble life*, then *illustrious minister*, and later *auspicious minister*. He was subsequently appointed Military Commissioner of the Zhaojun Prefecture and Grand Preceptor.\n\nAn Dun, the Censor-in-Chief, was initially appointed to Changsha. He came to see the Master, who only asked, \"How much is your salary?\" An did not understand. The Master slowly said, \"You will not go to Changsha.\" Soon after, An was recalled to the capital. Another time, An secretly sought the Master’s counsel on a matter. The Master said, \"Hasten to see the Cai brothers.\" At the time, the two ministers had just left the court, and An suspected the Master was jesting. Shortly after, the two were recalled to the two administrations, and An was soon appointed to the executive council.\n\nDaoists Xu Xichun and Huang Ruohou had not yet taken monastic vows during the Yuanfu era. One day, the Master gave each a folded sheet of official paper. Upon opening them, both found the character *Chen*. In the first year of Chongning, Prefect Chen Liaoweng visited the Master and inquired of his attendants who had served the Master longest. The temple head named Xu and Huang. Chen said, \"This temple’s restoration is entirely due to the Master’s divine power—why not grant these two disciples the tonsure?\" He then ordered them to reside permanently and complete the ordination rites.\n\nMaster Quanzhi, the Radiant Guardian, was a Daoist register at the Tianqing Temple during the Yuanfu era. Long devoted to talismanic arts, the Master always addressed him as \"Master.\" In the *yiyou* year, Quanzhi asked the Master about resigning his temple post. The Master said, \"A fine Master.\" Quanzhi later traveled to Qianshan, using talismanic water to heal people. The provincial authorities reported his deeds to the court. He then hastened to the capital and was granted the title Radiant Guardian Master.\n\nMinister Cai once brought his family to see the Master. Pointing to Lady Xu, the Master said, \"The lady has fallen—help her up.\" No one understood. Upon reaching Qiantang, Lady Xu fell ill and did not recover. The Master once gave Cai the character *army*, and he was appointed to Yunzhou. He received the character *kun*, and was appointed to Chengdu. The character *north*? He was appointed Hanlin Academician. Chengdu is the *kun* direction, and the Hanlin Academy is the northern gate of learning.\n\nTwo days before the Lantern Festival of the third Yuanfu year, the Master struck and destroyed all the lanterns with his staff. Days later, Emperor Zhezong’s posthumous edict arrived.\n\nTwo candidates from Jianzhou, Zhu and Liu, were heading to the southern examinations. The Master wrote the character *auspicious* for each. When they reached the capital, Zhu fell ill and died, while Liu passed. Liu’s character had the *mouth* radical beneath *scholar*, while Zhu’s had it beneath *earth*—and the ink was dull.\n\nWu Jing, a candidate from Gusu, was taking the provincial examination. The Master wrote: \"Seventy-three.\" When the results were announced, Wu ranked seventy-third.\n\n*Record of Master Xu, the Void and Serene Master, concluded.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "虚静冲和先生徐神翁语录 经名：虚静坤和先生徐神翁语录。 南宋未宋卿编。 二卷。 底本出处：《正统道藏》正一部。 徐神翁语录序 人生一世间，其所受用，有天有命，有分有数，丝毫不可易。 以不能穷理，故不自知之，必就有道者问焉，所谓先得我心者。 孔子知伯牛之死，知商瞿之有子，是岂用世之占卜法哉。 盖有得於目击者，徐筑在海陵为人书字，示以其人平生祸福，言无不验。 翌早时往来江淮，多闻其言，岁月深，知者益少严之。 天庆观道士苗希颐，翁弟子也。 在翁左右数十年，录其书字藏之。 求予删次存其实，以告其徒，今二十七年矣。 希颐死，其书为人取去。 予来守是邦，获其初药於民间，复次比之。 孔子曰：吾不语怪力乱神。 夫言而无验怪也，不可知神也，若此可以忘言矣。 若言而有验，以祸福示人，使晓然知所避就，岂不可知者。 盖古之得道者，穷理尽性而已。 理穷则天下之理，一能尽己之性则能尽物之性。 故谓之先知，谓之先见，谓之先觉。 世人以为奇，而有道者不以为高也。 然所以为神翁，岂止如是而已哉。 绍兴戊寅三月，桐乡朱翌序。 徐神翁语录后序 余旧闻海陵徐神翁异，常恨未及多见其说。 淳熙乙巳，假守是邦，因得访其遗迹，而略无传记可玫。 询之其徒，则曰：吾乡自汉晋以来，仙者接踵。 神翁之时，又有陈豆豆、周处士、唐先生相继而出。 亦曰：吾东家丘耳，况神翕得道五十余年间，小夫贱隶、妇人孺子得其告戒者，不啻以万数，曾何传录之？ 有问其尝所见闻者，或云：翁之仙去已七十八年，故老无复存矣。 继有以严陵所刊语录示余者，盖道士苗希颐所记，而朱新仲舍人为删次也。 虽裒集颇详，而讹缪无以考正。 暇日访诸邑子，则有能道其父兄与公弟子之所见闻者。 质之苗录，时有异同，而其言则有玫焉。 又出其往时乡老潘汝一所为行化状，第严於采择，惜其所记之不广也。 因俾取希颐之录，证以所闻，重为编削。 其间舛缪乖忤、删正损益者，殆数十处，传疑则两存之。 又益以耆旧所传，及《东轩笔录》、《龙川别志》、《孙公谭圃同安志》所载，凡十有八事，与行化状合为一编。 攻之坚木，庶以传信。 且使是邦家诵遗训，得以去恶就善，亦风俗之一助也。 岁在丁未正月旦日，朝散大夫知泰州军州兼管内劝农营田屯田事朱宋卿序。 虚静冲和先生徐神翁语录卷上 徐神翕名守信，泰州海陵人。 年十九入天庆观，隐迹于扫洒之役。 尝遇至人授道，日诵《度人经》。 有问休咎者，假经中语以告。 常携一帚人呼日徐二筑。 发运使蒋颖叔，以经中有神公受命普扫不祥之语，呼曰神翁。 自是，皆以神翁目之。 崇宁二年，诏赐号虚静冲和先生，凡三召赴阙。 大观二年四月二十日，解化于上清储祥宫之道院，年七十有六，赠太中大夫，勑葬本州城东响林东原。 宣和中，即其地建升真观。 嘉佑中，有天台道士余元吉来寓云堂。 岁余示癞疾，众皆恶之，公独奉事甚谨。 元吉委化，公告于海安镇徐宗晨，得棺以葬，哀之如师。 既葬而归，复恸哭，遍拜羽众，下至厮役。 已而造北极殿前，取囊衣悉焚之。 止衣敝袍，执荧洒扫。 或入室闭户终日，若歌若笑，见人必先拜，皆以为狂耳。",
      "translated_text": "**The Recorded Sayings of Master Xu the Tranquil and Harmonious**\n*Title:* *The Recorded Sayings of Master Xu the Void, Serene, and Harmonious*\nCompiled by Song Qing in the late Southern Song. Two fascicles.\nSource text: *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n**Preface to *The Recorded Sayings of Master Xu the Tranquil and Harmonious***\n\nIn this fleeting human life, all that one receives—whether from Heaven, fate, allotted share, or predestined measure—cannot be altered by even a hair’s breadth. Yet because most cannot fathom the underlying principles, they remain unaware of these truths until they seek out those who have attained the Dao, those who, as the saying goes, \"have already grasped what lies within my heart.\"\n\nWhen Confucius knew of Boniu’s impending death or foretold that Shang Qu would have sons, was this mere worldly divination? No—it arose from direct perception. Master Xu, while in Hailing, would inscribe characters for people, revealing their fortunes and misfortunes throughout life, and his words never failed to prove true. In my youth, I often traveled along the Yangtze and Huai Rivers and heard many of his sayings. Over time, however, those who truly understood him grew fewer, and his teachings became more revered.\n\nMiao Xiyi, a Daoist of Tianqing Abbey, was a disciple of the Master. For decades, he remained at the Master’s side, recording his written words and preserving them. He later asked me to edit and arrange these records so that their essence might be passed down to his followers. This was twenty-seven years ago. After Miao’s death, his writings were taken away by others. When I later came to govern this region, I recovered the original draft from among the people and once again arranged and compared them.\n\nConfucius said, \"I do not speak of the strange, the violent, or the chaotic.\" If words bear no verification, they are but strange tales; if they are beyond comprehension, they belong to the realm of spirits. In such cases, silence is best. Yet if words prove true—if they reveal fortune and misfortune to others, making clear what should be avoided or embraced—how can they be dismissed as unknowable?\n\nThose who attained the Dao in ancient times did so by exhaustively understanding principle and fully realizing their nature. When principle is fully understood, all principles under Heaven become one; when one’s own nature is fully realized, the natures of all things are likewise mastered. Thus, they are called those who \"know beforehand,\" who \"see beforehand,\" who \"awaken beforehand.\" The world marvels at this, yet those who have attained the Dao do not consider it extraordinary.\n\nBut how could the achievements of Master Xu be limited to this alone?\n\nWritten in the third month of the *wuyin* year of the Shaoxing reign (1138) by Zhu Yi of Tongxiang.\n\n---\n\n**Postface to *The Recorded Sayings of Master Xu the Tranquil and Harmonious***\n\nI had long heard of the extraordinary Master Xu of Hailing and regretted not having encountered more of his teachings. In the *yisi* year of the Chunxi reign (1185), while serving as acting governor of this region, I sought out his traces but found no records to gather. When I inquired among his disciples, they said: \"In our land, since the Han and Jin dynasties, immortals have followed one after another. In Master Xu’s time, there were also Chen Doudou, the Recluse Zhou, and Master Tang, who appeared in succession. They were but our neighbors—how much more so was Master Xu, who attained the Dao and for over fifty years instructed commoners, servants, women, and children in numbers beyond counting? How could all of this be recorded?\"\n\nWhen I asked about what they had personally seen or heard, some replied: \"The Master ascended seventy-eight years ago, and none of the elders who knew him remain.\" Later, someone showed me a printed edition of the *Recorded Sayings* from Yanling, compiled by the Daoist Miao Xiyi and edited by Zhu Xinzhong. Though the collection was quite detailed, errors and inconsistencies made verification impossible.\n\nIn my leisure, I inquired among the local scholars, and some could recount what their fathers and elder brothers—disciples of the Master—had seen and heard. Comparing these with Miao’s records, I found occasional discrepancies, but the core of his words was confirmed. I also obtained an earlier account of the Master’s conduct and teachings, written by the village elder Pan Ruyi. Though I was strict in my selection, I regretted that the record was not more extensive.\n\nThus, I had Miao’s records reexamined in light of what I had heard, revising and editing them. Inconsistencies, contradictions, and errors—numbering in the dozens—were corrected, with doubtful passages preserved in both versions. I also added accounts from elders, as well as records from *Dongxuan Bilu*, *Longchuan Biezhi*, *Sun Gong Tanpu*, and *Tong’an Zhi*, totaling eighteen entries, which I combined with the conduct record into a single volume. Like carving hard wood, I strove to ensure its reliability, that this land might preserve his teachings and turn from evil toward goodness—a small aid to the customs of the age.\n\nWritten on the first day of the first month of the *dingwei* year (1187) by Zhu Songqing, Gentleman for Court Audiences, Prefect of Taizhou Prefecture, concurrently responsible for agriculture, irrigation, and military farming.\n\n---\n\n**The Recorded Sayings of Master Xu the Void, Serene, and Harmonious (Fascicle One)**\n\nMaster Xu, styled Shouxin, was a native of Hailing in Taizhou. At nineteen, he entered Tianqing Abbey, where he lived in obscurity, sweeping and cleaning. There, he encountered a perfected one who transmitted the Dao to him, and he recited the *Scripture of Salvation* daily. When asked about good or ill fortune, he would respond with words from the scripture.\n\nHe always carried a broom, and people called him \"Xu the Second Sweeper.\" The Transport Commissioner Jiang Yingshu, noting the scripture’s line, \"The Divine Lord receives the mandate to sweep away all inauspiciousness,\" began calling him \"Divine Master.\" From then on, all referred to him as the Divine Master.\n\nIn the second year of the Chongning reign (1103), an imperial edict bestowed upon him the title \"Master of Void, Serene Harmony.\" He was summoned to court three times. In the second year of the Daguan reign (1108), on the twentieth day of the fourth month, he shed his mortal form at the Daoist cloister of the Upper Clarity Repository of Auspiciousness. He was seventy-six years old. He was posthumously granted the title Grand Master for Court Audiences, and an imperial decree ordered his burial in the eastern outskirts of the city, at the eastern plain of Xianglin.\n\nDuring the Xuanhe reign (1119–1125), the Ascension to Perfection Abbey was built on the site. In the Jiayou reign (1056–1063), the Daoist Yu Yuanji of Tiantai came to reside at Yuntang. After more than a year, he manifested signs of leprosy, and the community shunned him. The Master alone served him with utmost reverence. When Yu Yuanji passed away, the Master informed Xu Zongchen of Hai’an Town, who provided a coffin for burial. The Master mourned him as a teacher.\n\nAfter the burial, he returned and wept bitterly, bowing to all the Daoist adepts, even the servants. Then, before the North Pole Hall, he took Yu’s belongings and burned them all. From then on, he wore only tattered robes and carried a broom to sweep. Sometimes he would shut himself in his room all day, singing or laughing. When he saw others, he would bow first. Everyone thought him mad.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1227,
      "start_sentence": 0,
      "end_sentence": 60,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.368374824523926,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\虚静冲和先生徐神翁语录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "初葬之明日，徐宗晨见公来谢，乃取疋布千钱欲赠之。 公已出门，相望数步间，追莫能及。 宗晨疑之，后至观询问，公实未尝出也。 治平中，有道人状貌丑黑，雇负广颡，幅巾布袍，杖头挂一药瓢如拳大，云自二川来。 问其姓名，但云黑道人。 寓赵生邸舍，常至观中。 先见知观陈用已用已，每以三十金遗之。 次往北极殿下嘿坐，惟公至则与密语，他人莫闻也。 岁余而去，谓赵生曰：吾无以谢汝，令汝店中暑月无蚊纳耳。 后果如其言，客寓常满。 熙宁中，道正冲寂大师唐日严，暮夜巡寮，望厨中若有火光，至则无之。 公寝室在厨下，推户视之，见公东向瞑目端坐，犹不以介意。 一日乏斋粮，令公往庄所督米，公即往。",
      "translated_text": "The day after the burial, Xu Zongchen saw the Master coming to express his gratitude and took out a bolt of cloth and a thousand coins to offer him. The Master had already left, and though Xu pursued him for several paces, he could not catch up. Puzzled, Xu later went to the abbey to inquire, only to learn that the Master had never left at all.\n\nDuring the Zhiping reign (1064–1067), a Daoist of ugly and swarthy appearance, with a broad forehead and a topknot wrapped in plain cloth, arrived wearing a coarse robe. From his staff hung a gourd the size of a fist, and he claimed to have come from the Two Rivers region. When asked his name, he only called himself the Black Daoist. He lodged at the residence of a man named Zhao and often visited the abbey. The abbey’s prior, Chen Yongyi, had already taken notice of him and frequently gave him thirty taels of silver. Later, the Black Daoist would sit in silent meditation beneath the North Pole Hall, speaking in whispers only when the Master approached—no one else could hear their words.\n\nAfter more than a year, he departed, telling Zhao: “I have nothing to repay your kindness, but I shall ensure that your inn remains free of mosquitoes and bedbugs in the summer months.” True to his word, the inn thereafter saw no such pests, and its guest lodgings were always full.\n\nDuring the Xining reign (1068–1077), the Daoist prelate Chongji, Master Tang Riyan, was making his nightly rounds of the abbey quarters when he saw what appeared to be a flicker of firelight in the kitchen. Upon arriving, he found nothing. The Master’s sleeping quarters were beneath the kitchen; pushing open the door, he saw the Master sitting upright facing east, eyes closed in meditation, entirely unperturbed. One day, when the abbey’s provisions ran low, the Master was sent to the estate to oversee the delivery of rice, and he went at once.",
      "overlap_context": "informed Xu Zongchen of Hai’an Town, who provided a coffin for burial. The Master mourned him as a teacher.\n\nAfter the burial, he returned and wept bitterly, bowing to all the Daoist adepts, even the servants. Then, before the North Pole Hall, he took Yu’s belongings and burned them all. From then on, he wore only tattered robes and carried a broom to sweep. Sometimes he would shut himself in his room all day, singing or laughing. When he saw others, he would bow first. Everyone thought him mad.",
      "start_char": 1227,
      "end_char": 1507,
      "start_sentence": 61,
      "end_sentence": 73,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.437288999557495,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\虚静冲和先生徐神翁语录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "至日哺时，唐至三清殿后，见公枕帚而卧，呼而诟之。 公曰：来早米至矣。 唐怒，不复问，诂旦运米者。 至云：徐二哥昨日催促，不得少休，适已先归矣。 庄去郡往反百余里，唐愕然，乃为公命名，置弟子籍中，人始信其遇异人矣。 从而问休咎，或书《度人经》语以对，或不答，或大骂，皆有所谓也。 熙宁末，以守信被恩泽，度为道士。 公笑而不受，曰我只解扫地耳，力役如故。 公每日晚间，於殿堂诸处收香贴纸入房中，信手书字折迭一处。 明日有来求字者，以次取而付之。 悉酬所问，纸尽人亦绝矣。 公扫洒之际，略无奔物，木叶腐者，就拥其根，槁叶则收置一处。 每醮罢收拾灯缸之余者，给晨夕碓硙之用。 残灶之不可复用者，即紾取膏油。 其滓犹不肯卉，收一器中。 舂簸之际，粞米亦聚於一器。 遇大寒时，聚丐士燃桥叶，取残往散於其上而焚之。 仍煮粞米粥，与丐士同食。 舒州真源宫道士崔仙翁，名古之，字道光。 尝游石幢岭，见松下二人奕暮，与崔一子，令吞之。 崔迟疑，行至中路忽见公，遂语其事，示以所得碁子。 公取而吞之，过昊塘而去。 后崔复至是岭，遇前奕者，大加叱责，崔自此病狂。 唐日严延接四方羽流，公或肃清云堂，栩日必有至者。 海陵宰沈伯玉，携幼子见公，问有官禄否？ 公不答，固问之。 公曰：金水在命，禄在二十七年。 后沈令日者推之，二星果在命，后授官之年如公言。 沈宰妻病求字，公书无想观音四字。 再请之，又书诵之十过。 是年十月，妻病死。 沈后看《度人经注》，无想观音乃掌长夜之录者。 致仕查驾部，与沈宰同见公公不出。 杳叩户甚久，公曰：只见沈官人，不见查官人。 二人遂去，未几查卒。 观主首以屋宇敝坏，而求见公者日众。 遂置柜于公之座侧，期布施修造，公许之。 远近施金，日或至万数。 然亦有虚日、封缄不动，而所收如常。 熙宁中岁饥，观门缺乏。 公每旦自出数百金，遗知事市蔬。 仆辈意公有私藏，欲窃之。 伺公出，潜启其户。 有盆水在内，足蹶而仆，尽濡其衣。 方振衣间，公忽坐林上笑曰：教你休开。 盗者狼狈而走。 郡守张次山，有故旧在城都守官。 有书来云：成都有一道人，衣弊衣，称泰州天庆观徐二翁。 元丰中，蒋颖叔为发运。 初见公，问会何事？ 公云不会。",
      "translated_text": "When the hour grew late, Master Tang arrived behind the Three Clarities Hall and found the Master lying asleep with a broom for a pillow. He called out and berated him. The Master replied, “The rice will arrive by morning.” Tang, enraged, did not press further but waited until dawn to question the rice porters. They said, “Brother Xu urged us yesterday without a moment’s rest, and we had already returned home earlier.” The estate lay over a hundred *li* from the prefectural seat; Tang was stunned. Thereafter, he gave the Master a religious name and enrolled him in the register of disciples, and people began to believe he had encountered an immortal.\n\nThose who came to ask about fortune or misfortune received answers in the form of passages from the *Scripture of Salvation*, or silence, or even sharp rebukes—each response carrying its own meaning. At the close of the Xining reign, he was granted an imperial dispensation for his fidelity and ordained as a Daoist priest. The Master merely laughed and declined, saying, “I only know how to sweep,” and continued his labor as before.\n\nEach evening, he gathered incense papers from the halls and took them to his room, where he would casually write characters on them, folding each one away. The next day, when visitors came seeking written talismans, he would distribute them in order, answering all their questions until the papers were exhausted and the seekers departed.\n\nWhile sweeping, he never cast anything aside. Withered leaves and rotting wood were piled at their roots, while dry leaves were gathered in one place. After rituals, he collected leftover lamp oil to fuel the morning and evening pestles and mills. Unusable stove remnants were twisted to extract every drop of grease, and even the dregs were not discarded but stored in a vessel. During winnowing, broken rice grains were also collected in a separate container. On bitterly cold days, he would gather beggars and vagrants, burning fallen leaves beneath them and scattering the remnants over the flames. He then cooked congee from the broken rice and shared it with them.\n\nThe Daoist Master Cui of Zhenyuan Abbey in Shuzhou, named Guzhi and styled Daoguang, once traveled to Stone Pillar Ridge, where he saw two men playing *weiqi* beneath a pine tree. One of them gave Cui a piece and instructed him to swallow it. Hesitant, Cui proceeded on his way until he suddenly encountered the Master, to whom he recounted the incident and showed the piece. The Master took it and swallowed it, then passed through Wutang before departing. Later, when Cui returned to the ridge, he met the same players, who berated him harshly. From that time on, Cui descended into madness.\n\nMaster Tang Riyan frequently hosted Daoist adepts from all directions. Whenever the Master swept the Cloud Hall, visitors would invariably arrive that day. Shen Boyu, the magistrate of Hailing, brought his young son to see the Master and asked whether the boy would hold office. The Master did not answer, but when pressed, he said, “Metal and Water govern his fate; his official post will come at twenty-seven.” Later, Shen consulted an astrologer, who confirmed the two stars in his son’s chart. The year he was appointed to office matched the Master’s prediction.\n\nShen’s wife fell ill and sought a written charm. The Master inscribed *Wuxiang Guanyin* (“Guanyin of No-Thought”). When she asked again, he wrote, “Recite it ten times.” That October, she died. Later, Shen read the commentary on the *Scripture of Salvation* and learned that *Wuxiang Guanyin* presided over the register of the long night.\n\nZha, a retired minister of works, visited the Master with Shen, but the Master did not emerge. After knocking for some time, the Master said, “I see only Magistrate Shen, not Minister Zha.” The two left, and shortly afterward, Zha died.\n\nThe abbey’s superiors, noting the dilapidated state of the buildings and the growing number of visitors, placed a donation chest beside the Master’s seat to fund repairs. The Master approved, and offerings from near and far soon poured in, sometimes reaching tens of thousands in a single day. Yet there were also days when the chest remained sealed and untouched, though the donations continued as usual.\n\nDuring the famine of the Xining era, the abbey’s gates lacked provisions. Each morning, the Master would personally distribute several hundred coins to the stewards for purchasing vegetables. The servants suspected he had a hidden stash and plotted to steal it. While he was out, they secretly opened his door, only to find a basin of water inside. One stumbled, soaking his clothes. As he straightened his garments, the Master suddenly appeared, sitting atop a tree, laughing: “I told you not to open it.” The would-be thieves fled in disarray.\n\nPrefect Zhang Cis han had an old friend serving as an official in Chengdu. A letter arrived stating, “There is a Daoist in Chengdu wearing tattered robes who calls himself Old Man Xu of Tianqing Abbey in Taizhou.” During the Yuanfeng era, Jiang Yingshu, the transport commissioner, first met the Master and asked, “What are you skilled in?” The Master replied, “I don’t know anything.”",
      "overlap_context": "relate Chongji, Master Tang Riyan, was making his nightly rounds of the abbey quarters when he saw what appeared to be a flicker of firelight in the kitchen. Upon arriving, he found nothing. The Master’s sleeping quarters were beneath the kitchen; pushing open the door, he saw the Master sitting upright facing east, eyes closed in meditation, entirely unperturbed. One day, when the abbey’s provisions ran low, the Master was sent to the estate to oversee the delivery of rice, and he went at once.",
      "start_char": 1507,
      "end_char": 2399,
      "start_sentence": 74,
      "end_sentence": 124,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.674638032913208,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\虚静冲和先生徐神翁语录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "问知祸福否？ 云不知。 问看《度人经》还通晓否？ 云不晓。 问我为官如何？ 云官人好聪明。 再三问之，云宜臧邢。 不臧刑如何？ 公以手扪背，曰瘤子痛说不得也。 盖蒋背有瘤，盛怒财痛，至不能语，未尝告人也。 乃命二吏掖公而拜之，曰真人也。 经云：神公受命，普扫不祥。 公可以当之。 遂呼为神公，因留诗曰：持帚扫诸尘，经今三十春。 怜渠独行意，雌静不先人。 为公立守雌堂。 或云：吕吉甫赠诗，有为止矜夸独守雌之句，故蒋公取以为名也。 蒋又见殿侧有乐子长真人碑，题诗曰：瑶坛三级满苍苔，想像真人饮赤柸。 飒飒仙风动杉桧，只应飙驭暂归来。 子长旧宅，在今冲真坊乐真桥之侧，盖飞升之地。 梁大同中，建乐真观。 至唐大中时，徙而东之，今天庆观是也。 又公所居，亦在乐真桥之东，故蒋诗谓公乃子长再来也。 蒋颖叔尝求字，书龙字。 问何故不全？ 曰后来添之。",
      "translated_text": "“Can you foretell fortune and misfortune?”\n“I cannot.”\n\n“Do you understand the *Scripture of Salvation* when you read it?”\n“I do not.”\n\n“How do you assess my official career?”\n“The official is most astute.”\nPressed again and again, he said, “You should favor Zang and punish Xing.”\n“And if I do not favor Zang and punish Xing?”\nThe Master reached behind his back with his hand and said, “The tumor pains me too much to speak of it.” (For Jiang had a growth on his back that flared with rage, swelling until he could not speak—a condition he had never revealed to anyone.) Thereupon he ordered two attendants to support the Master as he bowed to him, declaring, “A true man indeed!” The scripture says: *“The Divine Lord receives his mandate to sweep away all inauspiciousness.”* This man is worthy of the title. Henceforth he called him the Divine Lord and composed a poem for him:\n\n*Bearing the broom to sweep all dust,*\n*For thirty springs it has been thus.*\n*I pity his lone resolve,*\n*Feminine stillness, never first to move.*\n\nHe established the Hall of Embracing Stillness in his honor. Some say that Lü Jifu’s poem, which included the line *“to cease all boasting and guard the feminine alone,”* inspired Jiang to adopt the name. Jiang also saw a stele beside the hall inscribed to the Perfected One Le Zichang and wrote a poem upon it:\n\n*Jade altars three-tiered, thick with moss,*\n*I picture the Perfected One drinking from the crimson cup.*\n*The soughing immortal wind stirs cedar and cypress—*\n*Only the whirlwind’s chariot could bring him back for a time.*\n\nZichang’s former residence stood beside Lezhen Bridge in present-day Chongzhen Ward, the very site of his ascension. During the Liang Dynasty’s Datong era, the Lezhen Abbey was built there. By the Tang Dynasty’s Dazhong era, it was relocated eastward—today’s Tianqing Abbey. The Master’s own dwelling also lay east of Lezhen Bridge, which is why Jiang’s poem suggests he was Zichang reborn.\n\nJiang Yingshu once asked the Master for a written character. He wrote the character *long* (dragon). When asked why it was incomplete, he replied, “It will be filled in later.”",
      "overlap_context": "enly appeared, sitting atop a tree, laughing: “I told you not to open it.” The would-be thieves fled in disarray.\n\nPrefect Zhang Cis han had an old friend serving as an official in Chengdu. A letter arrived stating, “There is a Daoist in Chengdu wearing tattered robes who calls himself Old Man Xu of Tianqing Abbey in Taizhou.” During the Yuanfeng era, Jiang Yingshu, the transport commissioner, first met the Master and asked, “What are you skilled in?” The Master replied, “I don’t know anything.”",
      "start_char": 2399,
      "end_char": 2747,
      "start_sentence": 125,
      "end_sentence": 150,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.953634023666382,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\虚静冲和先生徐神翁语录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "是年，除龙图阁直学士。 再问之，曰且得久而。 再叩之，乃加三点。 问背瘤如何？ 曰阁下则下也。 后除龙图阁学士，瘤果移稍下。 又尝求字，得赤天魔王字，又得负天担石字。 问担得几石？ 曰二千石。 未几移帅广州，乃应赤天魔王之语。 后入为枢密，则负天担石之验。 蒋为发运日，欲开龟山河，心计之久，未尝语人。 一日怀此事见公，公遽云：开则便开，何须问人？ 其意乃次。 王荆公遣人求字，书初舒王字四字，如此书。 公曰：劝字内不须用人字也。 盖经有赤书玉字之句。 后公还金陵，舟行。 忽岸侧有老人呼曰：相公，徐神翁有书。 接书视之，亦如前四字，老人忽不见。 未几，公薨。 政和中追封舒王，其书验矣。 虞尚书策，元丰末罢通州，伴来见公。 公书青龙、白虎、朱雀、玄武、狮子、白鹤、罗列左右，日月照明，洞焕室内，凡二十四字。 公曰：得也，得也使得此字也。 到阙，除大常寺奉礼郎。 时方修礼物，见排列青龙、白虎等仪仗，方悟策。 又与子沆求字，得三十二过字。 时沆年十一，至元符中过省，年三十二矣。 元丰七年，举子赴南宫试，求字，书乐出成灰四字。 张正议之子大成，得山岳吞烟四字。 是举试，乐出虚论而贡院火。 尚书范镗作宪使，问公每日食多少？ 曰饱便住。 问有梦否？",
      "translated_text": "That year, he was appointed Academician of the Dragon Diagram Pavilion. When asked again, he replied, \"For now, it will endure.\" Pressed further, he added three strokes. Asked about the back tumor, he said, \"It will descend beneath the pavilion.\" Later, when appointed Academician of the Dragon Diagram Pavilion, the tumor indeed shifted slightly downward.\n\nOnce, when asked for a written character, he wrote *Red Heavenly Demon King*, and on another occasion, *Bearing Heaven’s Burden of Stone*. Asked how many *dan* the burden weighed, he said, \"Two thousand *dan*.\" Soon after, he was transferred to command Guangzhou, fulfilling the prophecy of *Red Heavenly Demon King*. Later, when he entered the Bureau of Military Affairs, it validated *Bearing Heaven’s Burden of Stone*.\n\nDuring Jiang’s tenure as Transport Commissioner, he wished to dredge the Guishan Canal. Though he pondered it long, he had not spoken of it to anyone. One day, he brought the matter to the Master, who immediately said, \"If you wish to open it, then open it—why ask others?\" Jiang’s intent was thus settled.\n\nWhen Chancellor Wang of Jing dispatched someone to request a written character, the Master wrote *First Unfurling King* in four characters, just as before. The Master said, \"The *admonish* character need not include the *person* radical.\" This referred to the classic line: *\"Red script, jade characters.\"* Later, as the Master returned to Jinling by boat, an old man suddenly called from the shore, \"My lord, Master Xu the Immortal has a letter for you.\" Upon receiving it, he saw the same four characters as before. The old man vanished in an instant. Soon after, the Master passed away. During the Zhenghe era, he was posthumously enfeoffed as Prince of Shu—his written prophecy fulfilled.\n\nMinister Yu Ce, dismissed from Tongzhou at the end of the Yuanfeng era, came to visit the Master. The Master wrote *Azure Dragon, White Tiger, Vermilion Bird, Dark Warrior, Lion, White Crane*, arranging them to left and right, with *sun and moon illuminating*, filling the chamber with radiance—twenty-four characters in all. The Master said, \"You have gained it, gained it! If you can employ these characters...\" Upon returning to the capital, Yu was appointed Sacrificial Attendant of the Court of Imperial Sacrifices. At the time, ritual objects were being prepared, and he saw the processional banners of *Azure Dragon, White Tiger*, and the others—only then did he grasp the Master’s meaning.\n\nWhen his son Yu Hang requested a written character, he received *Thirty-Two Passages*. At the time, Hang was eleven; by the Yuanfu era, when he passed the provincial examination, he was thirty-two.\n\nIn the seventh year of Yuanfeng, candidates for the Southern Palace examination sought a written character. The Master wrote *Music Turns to Ashes* in four characters. Zhang Zhengyi’s son, Dacheng, received *Mountains Swallow Mist* in four characters. That year’s examination featured a *Music Emerges from Emptiness* essay, and the examination hall caught fire.\n\nMinister Fan Bing, serving as Surveillance Commissioner, asked the Master, \"How much do you eat each day?\" The Master replied, \"I stop when full.\" Asked if he dreamed, he...",
      "overlap_context": " Chongzhen Ward, the very site of his ascension. During the Liang Dynasty’s Datong era, the Lezhen Abbey was built there. By the Tang Dynasty’s Dazhong era, it was relocated eastward—today’s Tianqing Abbey. The Master’s own dwelling also lay east of Lezhen Bridge, which is why Jiang’s poem suggests he was Zichang reborn.\n\nJiang Yingshu once asked the Master for a written character. He wrote the character *long* (dragon). When asked why it was incomplete, he replied, “It will be filled in later.”",
      "start_char": 2747,
      "end_char": 3251,
      "start_sentence": 151,
      "end_sentence": 185,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.765201568603516,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\虚静冲和先生徐神翁语录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "曰自不受道正顾钱后来不曾有梦。 问是修行悟解惟复遇人得道？ 公不答。 再三问之，曰遇人。 何年遇人？ 曰庚戌。 今年庚申公度人否？ 笑而不答。 范未有子，求字，公书湾湾二字。 岁余，在扬州湾头得子。 后再过海陵，见公，公日更去州东三五里，接取个秀才。 次日过通州，方至唐湾，又得一子。 钱舍人勰持母服，寓居泰州大宁寺，见公求字，书上明七曜摩夷天七字，俄遭回禄。 其子东美，尝得公书齐到帝前四字。 会勰使三韩，东美偕行，同日谢辞去。 经义所检讨布衣刘谷，与公早相识，尝造乐真人堂，问真人安在？ 公指像之鼻端示之，刘嘿会其意，谓：乐之出没，一气往来耳。 刘作诗云：来来来问个空因，一向低头独拂尘。 却指鼻端泥一点，笑言便是乐真人。 谷尝与公以草藉地，宿於厨中。 一夕光耀如昼，见公张口瞪目而坐，空中闻人语云：徐禧入蕃直立死，吕惠卿吃着枸杞夹子。 时禧经营边事，而吕犹持服维扬，二人皆谷所善者。 其后禧有永乐之祸，而吕更元佑之贬，绍圣甲戌方复官。 待制吕益柔未第日，其父见公，公曰五十四好，又云第二人。 后益柔第二人登科，五十四乃其排行也。 承议王仲京遣人求字，书□字； 再问公，公云：速入道，亦恐不及。 是年卒。 孙升签判任满别公，公曰：做官时着诽。 后两任不赴，遇覃恩，赐诽为御史。 王和甫求字，书三山字，后提举嵩山崇福宫提举。 林处初在京师，见泰州蒋道士有公所书字。 处对公像焚香，祷而拈之，得回度五常四字； 后除常州教授，再任首尾五年。 刘谷壻蒋静待制，元丰中谒公，云：初见公醮坛上，观其屈伸状貌，人也。 察其神宇，则古所谓与造物游者。 静默然无言，鸶立扬眦以卜之。 公方扫地，遂举帚以对。 静揖之，即肩帚下坛去。 於是，知其真所谓抱一勿失，不以卜筮而知吉凶者。 范推官迁以书干李南公，久未有报，疑以问公。 公书石字，后数日，南公以缙钱诿石丕遗之。 李直德诗法言，以未有子问公。 公曰买底祠部，不如赐底，又书孔孟二字，后果得二子。 李赴楚州盐城宰，见公，公曰汝临替着诽。 寻遇元丰乙丑覃恩，改服色，拜勑日乃交印时也。 周裕熙宁三年登进士第，久在选调。 一日见公，公书八京两字。 裕虽知经有八景冥合之句而未晓，公曰此回名合也。 是年权淮阳军宿迁县尉，获贼改秘书省校书郎，盖选·阶七等，至京秩为八也。 元佑初侍禁王胜，因押纲求见公。 公无语，令饮水三杯。",
      "translated_text": "He replied, \"Ever since I received the correct Dao, I have never dreamed—only later did I cease to have them.\"\n\nFan asked, \"Is this through cultivation and awakening, or merely through encountering those who have attained the Dao?\"\nThe Master did not answer.\nPressed repeatedly, he said, \"Through encountering others.\"\n\"In which year did you encounter them?\"\n\"In the gengxu year.\"\n\"In this gengshen year, have you transmitted the Dao to others?\"\nHe smiled but did not answer.\n\nFan, who had no sons, requested a written character. The Master wrote *Winding Bay* in two characters. A year later, in Yangzhou’s Bay Head, he had a son. Later, when passing through Hailing, he saw the Master again. The Master said, \"Go three to five *li* east of the prefecture to welcome a scholar.\" The next day, passing through Tongzhou, he reached Tang Bay and had another son.\n\nQian She-ren Xie, observing mourning for his mother, resided at Daning Temple in Taizhou. He sought a written character from the Master, who wrote *Above Brightness: Seven Luminaries, Maheśvara Heaven* in seven characters. Soon after, his residence suffered a conflagration. His son, Dongmei, once received from the Master the four characters *All Arrive Before the Emperor*. When Xie was sent as an envoy to Samhan, Dongmei accompanied him and on the same day resigned and departed.\n\nLiu Gu, a commoner serving as Proofreader in the Classics Bureau, had long been acquainted with the Master. Once, visiting the Hall of Master Le, he asked, \"Where is the True One?\"\nThe Master pointed to the tip of the statue’s nose.\nLiu silently grasped his meaning: \"Le’s comings and goings are but the ebb and flow of a single *qi*.\"\nLiu composed a poem:\n*Coming, coming—asking for an empty cause,*\n*Head bowed long, alone dusting the void.*\n*Yet pointing to the clay dot on the nose’s tip,*\n*He laughs and says, ‘Here is Master Le.’\"*\n\nLiu once slept in the kitchen with the Master, using straw as bedding. One night, the room blazed as bright as day. He saw the Master sitting with mouth agape and eyes wide, while a voice from the void said, \"Xu Xi will stand and die entering the barbarian lands; Lü Huizhi will choke on a goji berry husk.\" At the time, Xi was managing border affairs, and Lü was still in mourning in Weiyang—both were acquaintances of Liu. Later, Xi met with the Yongle disaster, and Lü was demoted during the Yuanyou era, only reinstated in the Jiaxu year of Shaosheng.\n\nWhen Attendant Lü Yirou had not yet passed the imperial examination, his father visited the Master, who said, \"Fifty-four is auspicious,\" and also, \"Second place.\" Later, Yirou indeed ranked second in the examinations, and fifty-four was his generational order.\n\nWang Zhongjing, a Gentleman for Consultation, sent someone to request a written character. The Master wrote *□*; when pressed again, he said, \"Hasten into the Dao—you may not have time.\" That year, Zhongjing died.\n\nSun Sheng, upon completing his term as Assistant Magistrate, bid the Master farewell. The Master said, \"While in office, wear the *fei*.\" Later, though offered two appointments, he declined both. When a general amnesty was granted, he was appointed *fei* as an Imperial Censor.\n\nWang Hefu requested a written character. The Master wrote *Three Mountains*, and later he became Supervisor of Songshan’s Chongfu Abbey.\n\nLin Chuchu, in the capital, saw a written character by the Master in the possession of Jiang the Daoist of Taizhou. Lin burned incense before the Master’s portrait, prayed, and drew lots, receiving *Returning to the Five Constants*. Later, he was appointed Professor of Changzhou, serving a full five-year term.\n\nLiu Gu’s son-in-law, Jiang Jing, a Gentleman for Consultation, visited the Master during the Yuanfeng era. He recalled, \"At first, I saw the Master on the altar platform. Observing his posture and demeanor, he seemed human. But perceiving his spirit and bearing, he was one of those anciently said to wander with the Creator. I stood in silent awe, craning my neck to divine his intent. The Master was sweeping the floor and simply raised his broom in response. I bowed, and he shouldered the broom and descended the altar. Thus, I knew him as one who truly embraced the One without loss, discerning fortune and misfortune without divination.\"\n\nFan Tuiguan Qian sent a letter to Li Nangong but received no reply for a long time. Doubting, he asked the Master, who wrote *Stone*. Days later, Nangong entrusted Qian with cash, delegating it to Shi Pi.\n\nLi Zhide, a poet and scholar of the *Fa Yan*, asked the Master about having no sons. The Master said, \"Better to buy a position in the Ministry of Rites than to wait for a gift,\" and wrote *Kong Meng* in two characters. Later, Li indeed had two sons.\n\nLi, en route to serve as Magistrate of Yancheng in Chuzhou, saw the Master, who said, \"When your term ends, wear the *fei*.\" Soon after, during the general amnesty of the Yichou year of Yuanfeng, he changed his mourning attire and was granted the *fei* on the very day he handed over his seal.\n\nZhou Yu passed the imperial examination in the third year of Xining and remained in the selection pool for a long time. One day, seeing the Master, he received the two characters *Eight Capitals*. Though Zhou knew of the phrase \"eightfold alignment with the numinous\" in the classics, he did not understand. The Master said, \"This refers to the convergence of names.\" That year, he was appointed Acting Constable of Suqian County in Huaiyang Commandery. After capturing bandits, he was promoted to Collator in the Imperial Library. The selection rank was the seventh grade, and the capital rank was the eighth.\n\nIn the early Yuanyou era, Palace Guard Wang Sheng, escorting a transport, sought an audience with the Master. The Master said nothing but instructed him to drink three cups of water.",
      "overlap_context": "idates for the Southern Palace examination sought a written character. The Master wrote *Music Turns to Ashes* in four characters. Zhang Zhengyi’s son, Dacheng, received *Mountains Swallow Mist* in four characters. That year’s examination featured a *Music Emerges from Emptiness* essay, and the examination hall caught fire.\n\nMinister Fan Bing, serving as Surveillance Commissioner, asked the Master, \"How much do you eat each day?\" The Master replied, \"I stop when full.\" Asked if he dreamed, he...",
      "start_char": 3251,
      "end_char": 4215,
      "start_sentence": 186,
      "end_sentence": 237,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.456571102142334,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\虚静冲和先生徐神翁语录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "辞不能饮，公曰：三盏水不能饮，况他饮一河水耶？ 胜皇恐，不敢隐，盖其妻李氏妬，溺一婢於水，欲作醮解之。 公云如此却好。 醮毕之夕，胜与李氏皆梦所溺婢云：神翁度我，我冤释矣。 宣徽使张安道休致而病目，遣人赍香求字。 公书回鹿刘玄四字与之，经有回跖流玄之语。 张以书谢曰：蒙示四字、一见体会来意，将俸历焚。 讫旷劫以来贪吝之心，使随此火光俏灭。 自此目疾渐愈。 参政吕吉甫，元佑初母服阕除郡，闻有台章求字，公书建节二字。 吕云：方虞罪逐，敢有是望。 公曰：终须建节。 俄贬建宁军节度副使，至绍圣改元召帅延安，寻自观文殿学士拜保宁军节度使。 吉甫初来拜公，公顾曰善守善守，皆谓使之善守富贵也。 已而除藩府，固辞，降之单州，则单守之应； 相继迁谪，则又使善守之意也。",
      "translated_text": "Unable to drink, he declined. The Master said, \"If you cannot drink three cups of water, how could you drink from a river of other things?\" Overcome with awe, Wang Sheng dared not conceal anything. It turned out his wife, née Li, was jealous and had drowned a maidservant in water, intending to perform a Daoist ritual to absolve the deed. The Master said, \"This will do well.\"\n\nThat night, after the ritual was completed, Wang Sheng and his wife both dreamed of the drowned maidservant, who said, \"The divine elder has delivered me—my grievance is released.\"\n\nGrand Master of the Palace Ceremonies Zhang Andao, retired and afflicted with an eye ailment, sent a messenger bearing incense to request a written talisman. The Master inscribed four characters: *Returning Deer, Liu Xuan*, alluding to the classical phrase \"returning robber, flowing mystery.\" Zhang wrote in thanks, saying, \"Upon receiving these four characters and grasping their meaning, I shall burn my salary records. May all the greed and stinginess accumulated over countless kalpas vanish with this flame.\" Thereafter, his eye ailment gradually improved.\n\nMinister of Personnel Lü Jifu, having completed his mother’s mourning period in the early Yuanyou era and been assigned a regional post, heard of impeachment charges against him and sought a written instruction from the Master. The Master wrote two characters: *Establish Staff*. Lü said, \"With exile looming, how could I dare hope for such an honor?\" The Master replied, \"You will ultimately establish your staff.\"\n\nSoon after, he was demoted to Vice Military Commissioner of Jianning Commandery. When the Shaosheng era began, he was recalled to command Yan’an, and shortly thereafter appointed Military Commissioner of Baoning Commandery with the title of Grand Master for Palace Counsel. When Lü first came to pay respects, the Master looked at him and said, \"Guard well, guard well\"—all understood this as a warning to safeguard his wealth and rank. Later, when he was assigned to a princely fief, he firmly declined, and was instead sent to Shanzhou, which corresponded to the \"guard\" in *Shan Guard*. Through successive demotions, the Master’s admonition to \"guard well\" proved apt.",
      "overlap_context": "t understand. The Master said, \"This refers to the convergence of names.\" That year, he was appointed Acting Constable of Suqian County in Huaiyang Commandery. After capturing bandits, he was promoted to Collator in the Imperial Library. The selection rank was the seventh grade, and the capital rank was the eighth.\n\nIn the early Yuanyou era, Palace Guard Wang Sheng, escorting a transport, sought an audience with the Master. The Master said nothing but instructed him to drink three cups of water.",
      "start_char": 4215,
      "end_char": 4538,
      "start_sentence": 238,
      "end_sentence": 253,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.44313359260559,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\虚静冲和先生徐神翁语录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "吕尝得公字，云北都泉曲府中有万鬼群，但欲遏人等，断绝人命门。 后自延安得谪。 内相苏子瞻初起知登州，来求字，公书来王守三字。 又问学道之要，公云闲好。 苏公见许道士，求解字。 许曰：经云赤书玉字，勑乃王命，公作来字书，则王命将下。 果召为内翰，复出守扬州。 苏公疑闲好之言，再遣人求字，公不书。 后谪惠州，遣子过求字，公不见子由，谓：吾兄信其言，而不能用也。 苏黄门子由，自绩溪遣人求字，公书运当灭度身经太阴。 俄被召，历侍从至门下侍郎。 元佑末出知袁州，再遣人问之，书曰十遍转经福德立降。 谓来使曰：过去十，见在十。 子由闻之曰：日者谓予，戌运多福，酉运多厄，岂十年后有再生之理乎。 未至袁，迁岭表，元符末乃还。 道士潘奉真，元佑中累试经未中，公书三十二日四字，后试中时年三十二。 三衢进士江纬，欲更名汝真。 来见公，未及语，公曰：汝姓江，去工字，安女字即佳。 江遂易名，后登第。 客省使刘爰，元佑中与其父被谪，求字得执玉把节四字。 未几，与父皆得召，爰除内东门司，其父知内侍省。 经中有执录把籍同到帝前之语，公以录为玉，以籍为节，盖二公皆中贵人，为节度留后也。 宿州陈助教求字，公不书，但连叱之，仍命巨觥盛水饮之。 数四，陈生辞，不能复饮。 公曰：汝不能饮此，况他饮湖水耶？ 盖尝利人之财，其人溺水无救心也。 陈皇恐，谢公曰：尔负财负命到此，不省是难教化也。 陈生遂入道。 有一武臣为边将，其家久不得信，来求字，公书重屋二字。 既而讣至，官为护柩以归，始悟二字乃千里尸至。 齐巡检元佑辛未求字，书羞字，齐母丑生，不瑜旬而亡。 再见公，公书羡字，未几齐卒。 盖以羡字之上为羊字，其下为次字。 羊者未年，次者相次也。 郡守周邓初赴任，舟次泗上，公以书遗之。 及启封，止云杀人放火。 周到任三日，郡有杀人放火三盗，皆得。 元佑癸酉，江陵举子见公。 公曰：今年八口得解。 后榜出，姓名有口者八人。 姑苏举子赴省来求字，公曰：汝无虑，华亭土地已备礼迎近矣。 是举中第，注华亭簿。 供奉和铉有亲戚，相约同见公。 和意不欲往，因曰：人岂不自知。 不得已； 遂同来。 公一见，谓和曰：官人岂不自知。 陈古元佑中，率众造帐座，献东岳，约郝艇秀才偕行。 郝犹豫，来求字，得居字。 陈谓郝曰：居者，安之兆也。 事毕回至高邮，郝以疾卒。 陈载其柩归，始悟居字乃古载尸归也。 元佑中，驸马都尉张敦礼以公名奏闻，赐紫服及赐号圆通大师。 公不受，常服如故。 公尝书一偈示众，云：天地一尺，四海一滴。 把眼一贬，不见踪迹。 又尝写诗云：遥望南庄景色幽，前人田土后人收。 后人不用心欢喜，更有收人在后头。 汲汲光阴似水流，随时得过便须休。 儿孙自有兄孙福，莫与儿孙作马牛。 富贵贫穷各有由，宿缘分定莫刚求。 不曾下得春时种，空守荒田望有收。 南庄北宅眼前花，好兄好女莫谩夸。 我若一朝身死后，又属张三李四家。 元佑四年，郡吏陈德仪亡失。 海陵宰李元规印纸，限一月寻访。 求字，公书才。 如此字，至限满前一日於门首官道上获之。 是日乃十一月十一日，盖月建在子所得。 才字加子为存字，十一为在字。",
      "translated_text": "Lü once received a written character from the Master, which read: \"Within the Northern Capital’s Spring and Music Bureau, ten thousand ghosts gather—all seek to block the human ranks and sever the Gate of Life.\" Later, Lü was demoted from Yan’an.\n\nWhen Grand Councilor Su Zizhan was first appointed Prefect of Dengzhou, he came to request a character. The Master wrote: *come, king, guard, three*. Su then asked about the essentials of Daoist cultivation, to which the Master replied: *\"Leisurely delight.\"* Su later consulted a Daoist priest for an interpretation of the characters. The priest said: \"The scriptures speak of *crimson writings and jade characters*—an imperial decree is the king’s command. You wrote *come* with the character for *king*, so an imperial summons will soon arrive.\" Indeed, Su was soon recalled to serve as Academician of the Dragon Diagram Hall, then sent out again to govern Yangzhou.\n\nDoubtful of the Master’s words about *\"leisurely delight,\"* Su sent another messenger to request a character, but the Master refused to write. Later, when exiled to Huizhou, Su dispatched his son Guo to ask again. The Master did not receive Ziyou, saying only: \"My elder brother trusted my words but could not put them into practice.\"\n\nSu Huangmen Ziyou, from Jixi, sent someone to request a character. The Master wrote: *\"The time has come to extinguish the self and pass through the Great Yin.\"* Soon after, Ziyou was recalled, rising through the ranks to Vice Director of the Chancellery. At the end of the Yuanyou era, he was sent out to govern Yuanzhou. He sent another messenger to inquire, and the Master wrote: *\"Recite the scriptures ten times over—virtue and merit will descend at once.\"* To the messenger, he added: \"Ten in the past, ten in the present.\" Upon hearing this, Ziyou said: \"Long ago, he told me that in the *xu* year I would have much fortune, and in the *you* year much misfortune. Could there truly be a rebirth after ten years?\" Before reaching Yuanzhou, he was transferred to the southern frontier. Only at the end of the Yuanfu era did he return.\n\nDaoist Pan Fengzhen, who had repeatedly failed the scripture examinations during the Yuanyou era, received four characters from the Master: *\"thirty-two days.\"* When he passed the exam later that year, he was thirty-two years old.\n\nJiang Wei, a candidate from Sanqu, wished to change his name to Ru Zhen. He came to see the Master but had not yet spoken when the Master said: \"Your surname is Jiang—remove the *gong* radical and add the *nü* character, and it will be excellent.\" Jiang changed his name accordingly and later passed the imperial examination.\n\nAttendant Gentleman Liu Yuan, who during the Yuanyou era had been exiled with his father, requested a character and received: *\"hold jade, grasp the tally.\"* Soon after, both father and son were recalled. Liu was appointed Director of the Eastern Palace Gate Office, while his father became Director of the Palace Domestic Service. The scriptures contain the phrase: *\"holding records, grasping registers, they approach the emperor’s presence.\"* The Master had replaced *records* with *jade* and *registers* with *tally*, for both men were eunuchs of high rank, serving as military commissioners *ad interim*.\n\nA teaching assistant from Suzhou named Chen sought a character, but the Master refused to write. Instead, he berated Chen repeatedly and ordered a large goblet filled with water to be drunk. After several rounds, Chen begged to stop, unable to drink more. The Master said: \"If you cannot drink this, how will you drink the waters of the lake?\" (For Chen had once profited from another’s misfortune, showing no mercy when the man drowned.) Terrified, Chen prostrated himself and confessed: \"You have borne both wealth and fate to this point—how could one so unrepentant be taught?\" Chen then entered the Daoist path.\n\nA military officer serving as a frontier commander, whose family had long received no news, came to request a character. The Master wrote: *\"double house.\"* Soon after, a funeral announcement arrived: the officer’s coffin was being escorted home. Only then did he understand that the two characters meant *\"a corpse arrives from a thousand miles away.\"*\n\nCommandant Qi, who sought a character in the *xinsi* year of the Yuanyou era, received the character *shame*. Qi’s mother had been born in the *chou* year, and within ten days, she died. When Qi saw the Master again, he was given the character *envy*. Soon after, Qi himself died. For the upper part of *envy* is *yang*, and the lower part is *next*—*yang* signified the *wei* year, and *next* meant one would follow another.\n\nWhen Prefect Zhou Deng of the commandery first took office, his boat stopped at Sishang. The Master sent him a letter. Upon opening it, Zhou found only the words: *\"kill people, set fires.\"* Three days after arriving at his post, the commandery saw three bandits—one a murderer, two arsonists—all captured.\n\nIn the *guiyou* year of the Yuanyou era, a candidate from Jiangling visited the Master, who said: \"This year, eight mouths will pass the examination.\" When the results were announced, eight names on the list contained the character *mouth*.\n\nA candidate from Gusou traveling to the capital requested a character. The Master said: \"Have no worries—the land spirit of Huating has already prepared to welcome you.\" That year, the candidate passed and was assigned to the Huating registry.\n\nAttendant He Xuan had a relative who insisted they visit the Master together. He Xuan was reluctant, saying: \"Does one not know oneself?\" Yet he went. At first sight, the Master said to him: \"Sir, do you not know yourself?\"\n\nIn the Yuanyou era, Chen Gu led a group to craft a ceremonial canopy and present it to the Eastern Peak. He invited the scholar Hao Ting to join him. Hesitant, Hao sought a character and received: *\"dwell.\"* Chen said to him: \"Dwell is an omen of peace.\" After the ceremony, on their return to Gaoyou, Hao fell ill and died. Chen transported his coffin home, only then realizing that *dwell* meant *\"a corpse returns in an ancient cart.\"*\n\nIn the Yuanyou era, the imperial son-in-law Zhang Dunli memorialized the throne about the Master’s reputation, and the emperor bestowed upon him a purple robe and the title *Master of Perfect Penetration*. The Master declined them, continuing to wear his usual attire.\n\nThe Master once wrote a gatha for the assembly:\n*\"Heaven and earth—a foot’s span,\nThe four seas—a single drop.\nBlink your eyes once,\nAnd all traces vanish.\"*\n\nHe also wrote poems:\n*\"Gazing afar at South Village’s tranquil scene,\nThe fields of those before are reaped by those behind.\nIf those behind take no joy in their lot,\nStill others will come to reap after them.*\n\n*Time flows like water in haste—\nSeize the moment and rest when you may.\nChildren and grandchildren have their own fortunes;\nDo not toil for them like ox or horse.*\n\n*Wealth and poverty each have their causes,\nPredestined by past karma—do not force your fate.\nIf you never sowed in springtime,\nHow can you expect a harvest from barren fields?*\n\n*South Village, North Estate—flowers before your eyes,\nFine sons and daughters—do not boast in vain.\nWhen I die one morning,\nAll will belong to Zhang the Third or Li the Fourth.\"*\n\nIn the fourth year of the Yuanyou era, a clerk of the commandery named Chen Deyi went missing. The magistrate of Hailing, Li Yuangui, issued a document setting a one-month deadline for his recovery. Chen sought a character, and the Master wrote: *\"talent.\"* On the day before the deadline, Chen was found on the official road outside the gate. That day was the eleventh of the eleventh month—the month’s cyclical sign was *zi*. Adding *zi* to *talent* formed *exist*, and *eleven* formed *at*.",
      "overlap_context": "pointed Military Commissioner of Baoning Commandery with the title of Grand Master for Palace Counsel. When Lü first came to pay respects, the Master looked at him and said, \"Guard well, guard well\"—all understood this as a warning to safeguard his wealth and rank. Later, when he was assigned to a princely fief, he firmly declined, and was instead sent to Shanzhou, which corresponded to the \"guard\" in *Shan Guard*. Through successive demotions, the Master’s admonition to \"guard well\" proved apt.",
      "start_char": 4539,
      "end_char": 5801,
      "start_sentence": 254,
      "end_sentence": 323,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.430224657058716,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\虚静冲和先生徐神翁语录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "扬州市户锺静，元佑中暴卒，将敛而苏，云：初被追至阴府，证事放还。 至中途，护送鬼吏云：何以谢我？ 静曰：唯有斋牒一道。 吏曰：此物亦可。 乃以片纸易之，欣然持去。 及苏，手中有小纸，淡墨细书两行字，不可晓，乃以示公。 公曰：此阴府当钱贴子，其上云：斋牒一道，当钱五百贯。 汝速归买纸钱，并贴子焚之。 通州海门人鄗庆，贩鱼过海陵，来求字，得禁字。 庆谓：所贩槁鱼，何禁之有？ 比至钱塘遇盗，所有荡尽，后获盗之人乃林小二。 道士李八师守柔，善释公字。 元佑初，往扬州作龙华会，道俗以事公之礼待之。 公忽以片纸书字，折之与许道正云：候李八师归，与之。 后数日，李抱病归，许以字授之，书云：已摄北罗邓。 守柔连呼死罪，竟卒。 右班殿直贾宾，元佑中求字得冯字，又加四点於其下，后得漳泉福兴四州军巡辖马递铺。 宣德郎周景，元佑末感寒疾，梦一老人授之以药曰：我特来救尔。 及觉，病良已，是时犹未识公。 后於给事乔执中家，始见公像，乃所梦者。 至绍圣丙子来见公，公一见揖之，曰：久别安乐。 周始悟昔年之疾，得公救之。 成都道士赛拱辰，元佑戊辰冬录贾善祥所撰神公传记，来求字。 公一见曰：何烦作传记，人生无计多事尔，且先作一颂，当为写字。 拱辰颂云：神公神公，如月满空。 不以目视，照见无穷。 公遂书寿德动经四字，公云：尔父母安乐，不须问； 德字则尔母何氏，阴德福尔； 动则动，静歇灭； 经字少工，宜精进。 贾师得地祇两字，贾果曾梦授符命，除亳州太清宫土地。 僧智通未度时，诣观求出家。 问公，公云：汝可为僧。 书陈字与之。 智通后於资福寺出家，长老道圆度为僧，道圆俗姓陈也。 既而来谢公，公云：资福今则寂寥，后有人修造，在向后更有楼台殿阁。 又书道字与之，智通谓道字其师名也。 道圆死，继之者乃法道，创修资福极华焕。 后二十八年，诏郡府各以一寺之甲者，改神霄玉清万寿宫。 郡以资福应诏，知宫则道清大师印若绅也。 又改塔为郁罗萧台，殿堂门糜皆更新之。 公之言验。 大夫陈祥作信，倅时赠公诗曰：朝携一帚随我身，暮携一帚扫我室。 朝朝暮暮扫不停，尘埃扫尽真仙出。 进士周获，元佑八年失解，求字，公书佃字。 后三年，陆农师守泰州，周预荐。 常州刘道，元佑中来出家，公曰：汝不当住此。 书九日乾三字，日字在左。 后数年，於京师建隆观九曜院为道士。 经中有九日导乾之语。 蒋讲元佑中与众人见公，公独招蒋，授以片纸曰：汝用得此字。 乃葬字。 李八师解之云：岂有两葬事未了乎？ 其一卯生，其一巳生。 蒋泣曰：讲父母皆未葬，实卯与巳生也。 即日襄厝不敢缓。 维扬城束人姚文质，初未识公。",
      "translated_text": "In the Yuanyou era, a registered household of Yangzhou named Zhong Jing suddenly died. As he was about to be encoffined, he revived and said: \"At first, I was summoned to the netherworld, but after verification, I was released to return.\" Midway, the escorting ghost-official asked, \"How will you thank me?\" Jing replied, \"I have only a vegetarian certificate.\" The official said, \"This will do.\" He exchanged it for a slip of paper and took it away with delight. Upon reviving, Jing held a small paper in his hand, inscribed with two faint lines of fine script—indecipherable. He showed it to the Master, who said, \"This is a netherworld promissory note. It reads: *One vegetarian certificate, worth five hundred strings of cash.* Return quickly to buy paper money and burn it along with the note.\"\n\nA man of Haimen in Tongzhou, Hao Qing, was passing through Hailing while trading dried fish. He sought a character and received *forbid*. Qing thought, \"What prohibition could there be for dried fish?\" Yet upon reaching Qiantang, he encountered bandits who plundered all his goods. Later, the thief was captured—Lin Xiao’er.\n\nThe Daoist Li Bashi, styled Shourou, was skilled at interpreting the Master’s characters. In the early Yuanyou era, he traveled to Yangzhou to hold a Dragon Flower Assembly, where Daoists and layfolk treated him with the reverence due the Master. Suddenly, the Master wrote a character on a slip of paper, folded it, and gave it to Xu Daozheng, saying, \"Wait until Li Bashi returns, then give this to him.\" Several days later, Li returned gravely ill. Xu handed him the paper, which read: *Already summoned to the Northern Netherworld by Deng.* Shourou repeatedly cried, \"I am guilty of death!\" and soon died.\n\nThe Right Palace Attendant Jia Bin, during the Yuanyou era, sought a character and received *Feng*, with four dots added beneath it. Later, he was appointed to oversee the postal relay stations of four prefectures: Zhang, Quan, Fu, and Xing.\n\nThe Gentleman for Court Audiences Zhou Jing, in the late Yuanyou era, fell ill with a chill. He dreamed of an old man who gave him medicine, saying, \"I have come especially to save you.\" Upon waking, his illness was much improved—though at the time, he had not yet met the Master. Later, at the home of Academician Qiao Zhizhong, he first saw the Master’s portrait and realized it was the man from his dream. In the Bingzi year of the Shaosheng era, he visited the Master, who, upon seeing him, bowed and said, \"After such a long separation, are you well?\" Only then did Zhou recall that his illness years before had been cured by the Master’s intervention.\n\nThe Chengdu Daoist Sai Gongchen, in the winter of the Wuchen year of the Yuanyou era, transcribed the *Biography of the Divine Master* written by Jia Shansiang and sought a character from the Master. At first sight, the Master said, \"Why trouble yourself with biographies? Human life is full of unnecessary affairs. First compose a hymn, and I will write a character for you.\" Gongchen’s hymn read:\n*\"Divine Master, Divine Master,\nLike the moon filling the sky.\nNot gazing with the eyes,\nYet illuminating all without end.\"*\nThe Master then wrote the four characters *longevity, virtue, movement, scripture* and said, \"Your parents are at peace—no need to ask. The *virtue* character refers to your mother, née He, whose hidden virtue brings you fortune. *Movement* means movement; stillness leads to extinction. The *scripture* character lacks craft—you must cultivate diligence.\"\n\nJia Shi received the two characters *earth spirit*. Indeed, he had once dreamed of being granted a talismanic mandate, appointing him as the earth deity of the Supreme Clarity Palace in Bozhou.\n\nBefore taking vows, the monk Zhitong visited the abbey to request ordination. The Master asked him, and the Master said, \"You may become a monk.\" He wrote the character *Chen* and gave it to him. Later, Zhitong was ordained at Zifu Temple by the elder Daoyuan, whose secular surname was Chen. Afterward, he returned to thank the Master, who said, \"Zifu Temple is now desolate, but in the future, someone will rebuild it—there will be more pavilions, halls, and towers.\" He then wrote the character *Dao* for him. Zhitong thought *Dao* was his master’s name. After Daoyuan’s death, his successor was Fadao, who extensively renovated Zifu Temple, making it resplendent. Twenty-eight years later, an edict ordered each prefecture to convert its finest temple into a Divine Empyrean Jade Clarity Longevity Palace. The prefecture selected Zifu Temple, and the abbot was the Great Master Daoqing, styled Yin Ruoshen. The pagoda was renamed the Tower of Dense Rosy Clouds, and all halls, gates, and corridors were renewed. The Master’s words were fulfilled.\n\nThe Grand Master Chen Xiang, while serving as vice-prefect, presented the Master with a poem:\n*\"Morning after morning, I carry a broom by my side;\nEvening after evening, I sweep my chamber.\nSweeping without cease, day and night,\nWhen the dust is cleared, the true immortal emerges.\"*\n\nThe Presented Scholar Zhou Huo, in the eighth year of the Yuanyou era, failed the provincial examination and sought a character. The Master wrote *cultivate*. Three years later, Lu Nongshi, the prefect of Taizhou, recommended Zhou. He was selected.\n\nThe Changzhou man Liu Dao, during the Yuanyou era, came to leave the household life. The Master said, \"You should not stay here.\" He wrote the three characters *nine, sun, qian*, with *sun* on the left. Several years later, Liu became a Daoist at the Nine Luminaries Courtyard of the Establishing Prosperity Abbey in the capital. The scriptures contain the phrase *the nine suns guide qian*.\n\nJiang Jiang, during the Yuanyou era, visited the Master with a group of people. The Master singled out Jiang and gave him a slip of paper, saying, \"You will find use for this character.\" It was *bury*. Li Bashi interpreted it: \"Could there be two burial matters left unfinished?\" One was born in the *mao* hour, the other in the *si* hour. Jiang wept and said, \"Indeed, my parents’ burials have not been settled—I was born in *mao* and *si*.\" That very day, he hastened to inter them without delay.\n\nYao Wenzhi of the eastern outskirts of Yangzhou had not yet met the Master.",
      "overlap_context": "th.\"*\n\nIn the fourth year of the Yuanyou era, a clerk of the commandery named Chen Deyi went missing. The magistrate of Hailing, Li Yuangui, issued a document setting a one-month deadline for his recovery. Chen sought a character, and the Master wrote: *\"talent.\"* On the day before the deadline, Chen was found on the official road outside the gate. That day was the eleventh of the eleventh month—the month’s cyclical sign was *zi*. Adding *zi* to *talent* formed *exist*, and *eleven* formed *at*.",
      "start_char": 5802,
      "end_char": 6854,
      "start_sentence": 324,
      "end_sentence": 380,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.833117485046387,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\虚静冲和先生徐神翁语录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "在元丰初，忽见老人扣门，独持一帚云：我泰州徐二翁也，我有一帚生在你后园中，可往看之。 姚与公往园中，公指一处曰：此我帚也。 姚随所指见蘗竹一茎，生如帚状，回视已失老父所在。 遂来见公，如所见老父，而公未尝出也。 公曰：彼处可卓庵修行，他日求观中修造。 姚即於生帚处结庵，绘公像奉香火，有疑则祷之，无不验。 至元佑中，来建三清殿。 文质谋迁葬父母，先得一低地，又得一高处。 心不能次，各取土一掬。 封袖间以问公。 文质未及言，公即云：用低地。 文质出二土囊，公指其一曰：此土佳。 视所封刀，低处也。 钱端叔之妹无子，端叔携以见公，公书元始上帝四字。 其妹云：我已自晓，止得女子尔。 其后果然，盖始字女台也。 元佑中，王微未仕，来见公，公即呼曰：王官人莫愁前程。 谓一道士曰：请官人道正处吃茶。 及再见公，公抚其背曰：他时为州官日，照顾观门一事。 微亦唯唯而已。 后二十年，为泰州理掾。 适本观主首有公事，宪司送司理院。 擏悟前语，为尽心焉。 杭州人范小五，携一娼姓吕，来求字。 公大书云：吕氏无夫，范氏无妻。 皆皇恐而退。 如皋人籍天从，欠茶客三百千，客讼於官。 久无所偿，於其家竹园中自缢，有丁生救之而兔。 客闻而怜之，复告于官，乞宽其限。 天从自此生计复兴，其后以五百千偿客，客不受余金而去。 天从因病炼服秋石，元佑末见公，公曰：尔非籍三乎？ 批其颊而叱之曰：何故食至秽之物，尔记得竹园中否？ 譬如彼时，更何恋耶。 天从遂悟，乞住观中奉事公。 公许之曰：尔可为我作胜事，积少善绿。 遂令同姚文质作紏首，造三清殿，更修观宇。 天从至祟宁五年七月感疾，求公咒水。 公不与，问：尔姓甚？ 曰：姓籍。 问：籍字如何写？ 曰：竹头下从来从昔。 公曰：只用昔字，更使得一夕字，子急归去。 天从於二十一日夜坐亡，是日乃己巳。 盖昔字二十一日也，一夕从己则死矣。 公一日谓修观道士曰：速去真州买木。 遂如其言至真州，问之市人，云：今早有木筏甚大，欲得一千六百贯，长芦僧酬一千五百贯，客未售。 道士如其价而得之，长芦人再来已不及矣。 秀州进士邓巘，元佑中赴举求字，公书羊一夕已四字。 是年不第，至辛未年卒。 宝录侍宸程若清，初在俦，众人无识者。 元佑中，别公归潜山，公以诗饯之，曰：破布襕衫结角提，退毛鸾凤不如鸡。 蚌蛤虽然无颜色，内有宝珠人不知。 后二十年，程与公赴召，同居上清，赐号宝箓先生。 提举刘谊，遣人求字，书林下人三字。 谊喜曰：我奉道，昨梦双童饮乳，乃知余宝林下人也。 后至楚州卒。 郡守熊皋之兄待制，本以病访医，且欲归鄱阳。",
      "translated_text": "In the early Yuanfeng era, an old man suddenly knocked at the door, holding only a broom. He said, \"I am Xu the Second Elder from Taizhou. There is a broom growing in your back garden—go and see it.\" Yao accompanied the Master to the garden, where the Master pointed to a spot and said, \"This is my broom.\" Yao followed his gaze and saw a single shoot of *nie* bamboo, shaped like a broom. When he turned back, the old man had vanished. He returned to see the Master, who appeared just like the old man he had met, though the Master had never left.\n\nThe Master said, \"That place is suitable for building a hermitage to cultivate the Dao. One day, you may seek to renovate the abbey there.\" Yao then built a hermitage where the bamboo broom grew, painting the Master’s image to honor with incense and fire. Whenever he had doubts, he prayed to it, and all proved efficacious. By the Yuanyou era, he came to build the Three Clarities Hall.\n\nYao Wenzhi planned to relocate his parents’ graves. He first found a low-lying site, then a high one, but could not decide between them. He took a handful of soil from each, sealed them in his sleeve, and went to ask the Master. Before he could speak, the Master said, \"Use the low ground.\" Yao took out the two soil pouches, and the Master pointed to one, saying, \"This soil is fine.\" He checked the seal—it was from the low site.\n\nQian Duanshu’s sister was childless. Duanshu brought her to see the Master, who wrote the four characters *Yuanshi Shangdi* (Primeval Lord of the Dao). His sister said, \"I understand now—I will only bear a daughter.\" Later, this proved true, for the character *shi* (始) contains *nü* (女, \"woman\") within it.\n\nDuring the Yuanyou era, Wang Wei, not yet an official, came to see the Master. The Master immediately called out, \"Officer Wang, do not worry about your future.\" To a Daoist, he said, \"Please take the officer to the abbot’s quarters for tea.\" When Wang saw the Master again, the Master patted his back and said, \"When you become a prefectural official one day, remember to look after the abbey’s affairs.\" Wang merely assented. Twenty years later, he became an assistant magistrate in Taizhou. At that time, the abbey’s abbot was involved in a legal matter, sent to the judicial office. Wang recalled the Master’s words and devoted himself to the case.\n\nA man from Hangzhou named Fan Xiaowu brought a courtesan surnamed Lü to ask the Master for a written divination. The Master wrote in large characters: *\"Lü has no husband; Fan has no wife.\"* Both were terrified and left.\n\nJi Tiancong from Rugao owed a tea merchant three hundred strings of cash. The merchant sued him in court. Unable to repay, Ji hanged himself in his bamboo grove but was saved by a man named Ding. The merchant, hearing of this, took pity and asked the court to extend the deadline. From then on, Ji’s livelihood recovered. Later, he repaid the merchant five hundred strings, but the merchant refused the excess and departed.\n\nJi later fell ill and refined *qiushi* (autumn stone) for consumption. At the end of the Yuanyou era, he visited the Master, who said, \"Are you not Ji the Third?\" He struck Ji’s cheek and rebuked him: \"Why do you consume such filth? Do you remember the bamboo grove? It was no different then—what more was there to cling to?\" Ji awakened and begged to stay at the abbey to serve the Master. The Master agreed, saying, \"You may do me a great service by accumulating small acts of goodness.\" He then ordered Ji to work with Yao Wenzhi as a supervisor to build the Three Clarities Hall and renovate the abbey’s structures.\n\nIn the fifth year of Chongning, Ji fell ill in the seventh month and asked the Master for consecrated water. The Master refused and asked, \"What is your surname?\" Ji replied, \"Ji (籍).\" The Master asked, \"How is *ji* written?\" Ji said, \"Bamboo radical above *lai* and *xi*.\" The Master said, \"Just use *xi* (昔). If you add *yi* (夕) to it, you get *xi* (夕)—hurry home.\" Ji died sitting upright on the twenty-first night, which was a *jisi* day. For *xi* (昔) denotes the twenty-first day, and adding *yi* (夕) to *ji* (己) means death.\n\nOne day, the Master said to the Daoists renovating the abbey, \"Go quickly to Zhenzhou to buy timber.\" They followed his instructions and arrived in Zhenzhou. Asking around, they were told, \"This morning, a large raft of timber arrived, priced at 1,600 strings. The Changlu monks offered 1,500, but the merchant has not sold it yet.\" The Daoists matched the price and secured the timber—the Changlu monks arrived too late.\n\nDeng Yan, a scholar from Xiuzhou, sought a divination from the Master during the Yuanyou era while preparing for the imperial examinations. The Master wrote four characters: *yang yi xi ji* (羊一夕已). That year, Deng did not pass. He died in the *xinwei* year.\n\nCheng Ruoqing, a *baolu* attendant to the imperial chambers, was initially among a group where no one recognized his worth. During the Yuanyou era, he bid farewell to the Master to return to Qianshan. The Master saw him off with a poem:\n*\"A patched hemp robe with knotted corners,\nA molting phoenix is no match for a chicken.\nThough clams and oysters lack color,\nInside lies a pearl unknown to others.\"*\nTwenty years later, Cheng and the Master were summoned together to the Upper Clarity Palace and granted the title *Baolu Xiansheng* (Master of the Precious Register).\n\nPrefect Liu Yi sent someone to ask the Master for a written divination. The Master wrote three characters: *lin xia ren* (林下人, \"one who dwells beneath the forest\"). Liu rejoiced, saying, \"I follow the Dao. Last night, I dreamed of two youths drinking milk—I now know I am a *lin xia ren*.\" Later, he died in Chuzhou.\n\nPrefect Xiong Gao’s elder brother, a *daizhi*, had come seeking medical treatment and intended to return to Poyang.",
      "overlap_context": "ple. The Master singled out Jiang and gave him a slip of paper, saying, \"You will find use for this character.\" It was *bury*. Li Bashi interpreted it: \"Could there be two burial matters left unfinished?\" One was born in the *mao* hour, the other in the *si* hour. Jiang wept and said, \"Indeed, my parents’ burials have not been settled—I was born in *mao* and *si*.\" That very day, he hastened to inter them without delay.\n\nYao Wenzhi of the eastern outskirts of Yangzhou had not yet met the Master.",
      "start_char": 6854,
      "end_char": 7890,
      "start_sentence": 381,
      "end_sentence": 437,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.82338190078735,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\虚静冲和先生徐神翁语录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "皋以问公，公书丁字，曰：也作得丁字也，作得下字只挑脚是丁字，更添口作可字，若添人则何字？ 又曰：使此何字不得？ 只添三点则使得。 数日后又来求字，公书道言此三字。 后得信，知其兄至真州丁字河卒，其幼子次日又卒。 乃验道字缺二画之意，而丁河之微隐若此。 主簿柳卞尝验尸不实，州将平其事。 来见公，欲正月起行。 公曰：明年正月。 卞不以为然。 会运使李琮牒州拘留，劾奏明年正月始得脱去。 殿院林旦为淮南漕，求字，公书上尚当党□陵六字。 唯□字多一画，后移漕河东卒於上党。 佛印大师了元住金山，致书於公。 公不开缄，只云好好。 又於封皮上书金字十四个，两两相并，授来人持去。 复遣人求字，公书二七佛三字，后住金山凡十四年。 江阴布衣刘谷，元佑庚午冬，或讽村民以田事进状讼谷，事下淮东宪司。 谷惧祸，来见公，公书天字七个，并列者三，其一缀於六字之下。 谷默领其意，乃变姓皇甫，逃於庐山。 尝至饶州安仁婿蒋静官所，淮宪以闻，有旨治静。 谷逃，三年至绍圣，而田事直，静亦会恩乃免。 元佑甲戌四月中，公杜门不出，道众请之，曰：候改年号则出。 数日，果改绍圣元年。 内翰王明叟尝得公书，启封有吕字作□。 如此书，后丧一幼子一长女。 复遣人问公，公书季秋霜降四字，逮除刑部侍郎乃九月也。 绍圣初，海陵举子问公得失，公曰：陆侍郎来满城着绿。 次举何昌、言榜、郭观、张知常、李彬、郭元瑜登科时，陆农师典郡开宴召之。 中奉查应辰赋诗，有伫看黄霸征为相、须信徐翁语有神之句。 李彬朝奉未第时，母姜氏问公，公一见即曰：今年未旺，尔祖有阴德。 姜再问之，公曰：候木旺却来相见。 是年彬获荐，姜复见公，公曰：却是木旺也。 彬果登科。 绍圣丙子，尚释之赴维扬试，问公，公曰：我个裹自担，却一个亥生底在。 尚是年获荐，而海陵魁王山乃与尚，皆辛亥生也。 秀州天庆观道士夏日时，绍圣中求字，得上闻三十三字。 是时年二十五，后八年卒。 进士陆表民见公，公曰：与尔个实字，视之，作寅如此书。 又曰：汝不可用，与汝父可也。 已而陆丧祖母。 如皋令刘、海陵簿蔡、兴化尉陈，同见公，公书矢字。 顾刘曰：尔添口为知。 顾蔡曰：尔添巨为矩。 顾陈曰：尔添豆为短。 未几，陈病卒。 刘常任智，故警之。 蔡名居厚，后为从官。 蒋道感疾求字，书萌字，十月十日亡。 州吏孙氏妻见公，未及语，叱之曰：尔何面目来个裹，便还他物亦不及矣。 妪惶恐而去，翊日为官所捕。 乃数日前，利邢氏女子衣物而杀之。 尚释之以小疾访公，公与语曰：道生一，一生二，二生三，三生万物。 及送出，连呼马牙硝，其意似有戒饰。 及归，有医留药，其汤使用马牙硝。 运使张祖求字，书珑字。 张自云：龙在土为失水，且珑墓也。 寻以疾卒。 曹判官舜元见公，得妇夫檐石字，家有二妇人怀妊也。 经中有负天担石之语，夫者二人也。 权教授鲍由，与理掾吴垃见公。 公曰：二官人三教并通。 垃云：正为未通，望先生指示一门。 公曰：有圆通门、般若门。 又历说三教事。 吴云：虽然如是，当从何门入？ 公曰：既是三教并通，又却问从何门入？ 吴一日诸公作醮，既至观，虑所携镪未敷，欲增之。",
      "translated_text": "Xiong Gao asked the Master for guidance, who wrote the character *ding* (丁). He said, \"This can also be a *ding*. If you take the character *xia* (下) and lift its foot, it becomes *ding*. Add a mouth, and it becomes *ke* (可). If you add a person, what character would it be?\" He then asked, \"Why can this character not be used?\" The Master replied, \"Only by adding three strokes would it be permissible.\" Several days later, Xiong Gao returned to request another character, and the Master wrote *dao yan ci* (道言此, \"the Dao speaks this\"). Later, news arrived that his elder brother had died at Dingzi River in Zhenzhou, and his youngest son passed the following day. Thus was verified the meaning of the *dao* character missing two strokes, and the subtle foreshadowing of Dingzi River.\n\nRegistrar Liu Bian had once falsified an autopsy report, and the prefect sought to settle the matter. He came to see the Master, intending to depart in the first month. The Master said, \"Next year, in the first month.\" Liu did not take this seriously. Coincidentally, Transport Commissioner Li Cong issued a document to the prefecture, detaining him for impeachment, and he was only able to leave in the first month of the following year.\n\nLin Dan, Director of the Palace Administration, served as the Huainan Transport Commissioner and requested a written divination. The Master wrote: *shang shang dang dang □ ling* (上尚当党□陵, \"above, esteem, ought, faction, □, mound\"). Only the □ character had an extra stroke. Later, Lin was transferred to Hedong as Transport Commissioner and died in Shangdang.\n\nThe Venerable Master Foyin Liaoyuan of Jinshan Monastery sent a letter to the Master. The Master did not open the seal but simply said, \"All is well.\" On the envelope, he wrote fourteen *jin* (金, \"gold\") characters, arranged in pairs, and instructed the messenger to take it back. Later, another messenger came seeking a written divination, and the Master wrote *er qi fo* (二七佛, \"two sevens, Buddha\"). Foyin resided at Jinshan for fourteen years.\n\nLiu Gu, a commoner from Jiangyin, faced a lawsuit in the winter of the *gengwu* year of the Yuanyou era (1090), when villagers were incited to accuse him over a land dispute. The case was referred to the Huai-Dong Surveillance Commission. Fearing disaster, Liu Gu came to see the Master, who wrote seven *tian* (天, \"heaven\") characters: three in a row, and one appended below the other six. Liu silently grasped the meaning, changed his surname to Huangfu, and fled to Mount Lu. Once, he stayed at the home of his son-in-law, Jiang Jing, an official in Anren, Raozhou. The Huai-Dong Surveillance Commission learned of this, and an imperial edict ordered Jiang’s punishment. Liu escaped, and three years later, in the Shaosheng era (1094–1098), the land dispute was resolved in his favor, and Jiang was pardoned by imperial grace.\n\nIn the fourth month of the *jiaxu* year of the Yuanyou era (1094), the Master secluded himself and refused to go out. Daoist followers entreated him, saying, \"Wait until the era name changes, then come out.\" Several days later, the era name was indeed changed to Shaosheng.\n\nAcademician Wang Mingsou once received a written divination from the Master. Upon opening it, he found the character *lü* (吕) written as □. After this, he lost a young son and an elder daughter. He sent another messenger to ask the Master, who wrote *ji qiu shuang jiang* (季秋霜降, \"late autumn, Frost’s Descent\"). Later, Wang was appointed Vice Minister of Justice in the ninth month.\n\nAt the beginning of the Shaosheng era, a candidate from Hailing asked the Master about his examination prospects. The Master said, \"Vice Minister Lu will come, and the entire city will wear green.\" In the subsequent examination, He Chang, Yan Bang, Guo Guan, Zhang Zhichang, Li Bin, and Guo Yuanyu passed. When Lu Nongshi, the prefect, hosted a banquet for them, Palace Attendant Zha Yingchen composed a poem containing the lines: *\"I await the day Huang Ba is summoned as minister; / You must believe the words of Elder Xu are divine.\"*\n\nBefore Li Bin passed the imperial examination, his mother, Madame Jiang, asked the Master for a divination. Upon seeing her, the Master immediately said, \"This year is not prosperous; your ancestors possess hidden virtue.\" Madame Jiang asked again, and the Master replied, \"Come back when the Wood element is flourishing.\" That year, Li Bin received a recommendation. Madame Jiang visited the Master again, who said, \"Now is the time when Wood flourishes.\" Li Bin indeed passed the examination.\n\nIn the *bingzi* year of the Shaosheng era (1096), Shang Shizhi traveled to Weiyang for the examinations and asked the Master for guidance. The Master said, \"I carry my own burden, yet there is one born in the *hai* year accompanying me.\" That year, Shang passed the examination, and the top candidate from Hailing, Wang Shan, shared the same *xinhai* birth year as Shang.\n\nIn the Shaosheng era, Xia Rishi, a Daoist priest at Tianqing Abbey in Suzhou, requested a written divination and received the characters *shang wen san shi san* (上闻三十三, \"reported above, thirty-three\"). At the time, he was twenty-five years old and died eight years later.\n\nThe scholar Lu Biaomin visited the Master, who said, \"I give you the character *shi* (實, \"truth\"),\" but when Lu looked, it was written as *yin* (寅). The Master added, \"This is not for you; it is for your father.\" Soon after, Lu’s grandmother passed away.\n\nMagistrate Liu of Rugao, Registrar Cai of Hailing, and Constable Chen of Xinghua visited the Master together. The Master wrote the character *shi* (矢, \"arrow\"). Turning to Liu, he said, \"Add a mouth to make *zhi* (知, 'knowledge').\" To Cai, he said, \"Add *ju* (巨) to make *ju* (矩, 'rule').\" To Chen, he said, \"Add *dou* (豆) to make *duan* (短, 'short').\" Shortly afterward, Chen fell ill and died. Liu was habitually cunning, so the Master admonished him. Cai, whose given name was Juhou (\"Residing in Thickness\"), later became an attendant official.\n\nJiang Daogan, suffering from illness, sought a written divination. The Master wrote *meng* (萌, \"sprout\"), and he died on the tenth day of the tenth month.\n\nA clerk’s wife from the prefecture came to see the Master. Before she could speak, he rebuked her, saying, \"What face do you have to come here? Even returning what you stole would be too late.\" The woman left in terror. The next day, she was arrested by the authorities, for several days earlier, she had murdered a girl from the Xing family to steal her clothes.\n\nShang Shizhi visited the Master due to a minor illness. The Master spoke to him, saying, \"The Dao gives birth to the One; the One gives birth to the Two; the Two give birth to the Three; the Three give birth to the myriad things.\" As he saw him out, he repeatedly called for *ma ya xiao* (馬牙硝, \"sodium sulfate\"). His tone seemed to carry a warning or admonition. Upon returning home, a physician prescribed medicine that included sodium sulfate.\n\nTransport Commissioner Zhang Zu requested a written divination, and the Master wrote *long* (珑, \"gem\"). Zhang remarked, \"A dragon in the earth is like a fish out of water, and *long* resembles a tomb.\" Soon after, he fell ill and died.\n\nCao Shunyuan, a judicial officer, visited the Master and received the characters *fu fu yan shi* (夫夫檐石, \"husband, husband, eaves, stone\"). His household had two pregnant women. The scriptures contain the phrase *\"bearing the weight of heaven and carrying stones,\"* and *fu* (夫) signifies two persons.\n\nActing Professor Bao You and Legal Clerk Wu La visited the Master. The Master said, \"The two officials are well-versed in the Three Teachings.\" Wu replied, \"It is precisely because I am not well-versed that I hope the Master will point me toward one gate.\" The Master said, \"There is the Gate of Perfect Penetration and the Gate of Prajna.\" He then expounded on the Three Teachings. Wu asked, \"Though this is so, which gate should I enter?\" The Master replied, \"If you are well-versed in the Three Teachings, why do you ask which gate to enter?\"\n\nOne day, when several officials were preparing a Daoist ritual, they arrived at the abbey concerned that the funds they had brought might be insufficient. They wished to increase the amount.",
      "overlap_context": "ed the title *Baolu Xiansheng* (Master of the Precious Register).\n\nPrefect Liu Yi sent someone to ask the Master for a written divination. The Master wrote three characters: *lin xia ren* (林下人, \"one who dwells beneath the forest\"). Liu rejoiced, saying, \"I follow the Dao. Last night, I dreamed of two youths drinking milk—I now know I am a *lin xia ren*.\" Later, he died in Chuzhou.\n\nPrefect Xiong Gao’s elder brother, a *daizhi*, had come seeking medical treatment and intended to return to Poyang.",
      "start_char": 7890,
      "end_char": 9162,
      "start_sentence": 438,
      "end_sentence": 505,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.827781200408936,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\虚静冲和先生徐神翁语录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "意未次，往见公。 公遽云：舍便舍，又何须问。 鲍教授见公，公问：内字上加水为甚字？ 鲍曰：无此字。 又问：内字下加水字为甚字？ 曰：亦无此字。 又问：傍加水如何？ 鲍曰：汭字。 公笑曰：今日正用得此字。 既归，太守召食西楼，方即席，观壁间有东坡留题，内陈汭字，适与日相值云。 山阳富人杨公佐家，一日闻异香，忽有一老父持帚过庭下，适有淮阳道姑徐道生在焉。 杨惊而问之，道生曰：此徐神翁也。 公佐前揖，已失所在，唯一木斗在地。 乃与道生来见公，即所见者，询其斗则三官殿前柱口斗也。 公曰：欲修此殿。 公佐施钱数十万重建。",
      "translated_text": "The thought had not yet settled when he went to see the Master. The Master abruptly said, \"If you are to relinquish, then relinquish—why ask further?\" Acting Professor Bao visited the Master, who asked, \"What character is formed when water is added above the character *nei* (内)?\" Bao replied, \"There is no such character.\" The Master then asked, \"What if water is added below *nei*?\" Bao said, \"There is no such character either.\" The Master asked again, \"What if water is added to the side?\" Bao answered, \"*Rui* (汭).\" The Master laughed and said, \"This character is precisely what we need today.\" Later, when Bao returned, the Prefect summoned him to dine at the Western Tower. As he took his seat, he saw on the wall a poem left by Dongpo, in which the character *rui* (汭) appeared, coinciding with the day’s events.\n\nOne day, at the home of the wealthy man Yang Gongzuo of Shanyang, an unusual fragrance was detected. Suddenly, an old man carrying a broom passed through the courtyard. At that moment, the Daoist nun Xu Daosheng of Huaiyang was present. Startled, Yang asked about him, and Daosheng said, \"This is the Divine Elder Xu.\" Yang stepped forward to bow, but the old man had already vanished, leaving only a wooden *dou* (斗) on the ground. Yang then went with Daosheng to see the Master, who confirmed that the old man was the one they had encountered. When asked about the *dou*, the Master said it was the *dou* from the pillar of the Three Officials Hall. He added, \"We wish to repair this hall.\" Yang Gongzuo donated several hundred thousand coins to rebuild it.",
      "overlap_context": "e toward one gate.\" The Master said, \"There is the Gate of Perfect Penetration and the Gate of Prajna.\" He then expounded on the Three Teachings. Wu asked, \"Though this is so, which gate should I enter?\" The Master replied, \"If you are well-versed in the Three Teachings, why do you ask which gate to enter?\"\n\nOne day, when several officials were preparing a Daoist ritual, they arrived at the abbey concerned that the funds they had brought might be insufficient. They wished to increase the amount.",
      "start_char": 9162,
      "end_char": 9411,
      "start_sentence": 506,
      "end_sentence": 521,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.7189462184906,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\虚静冲和先生徐神翁语录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "高邮桑正国将赴举，问公，公书黄绿简三字。 经云：黄线白简。 公去白字，而以箓为绿。 是岁果中第。 胡主簿思问侍其父，致政归泰州。 公曰：主簿与潘主簿一般。 先是，潘亦侍父致政归乡，父卒。 未几，胡之父亦卒。 曾司户湛，重九日访公。 及退谓公曰：开春当复拜见。 公曰：相见明年今日。 湛以事濡滞，比再至，则次年重九日也。 老囿冯旺，绘公像於家，日荐饮馔。 偶一日忘之，翊日自负萝卜来施库下。 公见之曰：我倚得尔好，昨日若不得钱家饭，便不饿却我。 钱亦日以饭为供也。 孙氏子访公，公书日下人三字。 又云：尔速归，今日内使得此字也。 孙急归，得暴疾，卒於日下。 张判官涟罢官，谋舟未得，来见公，公书吉水二字，云：且意就使。 张往见郡守，守云：适已差周永船矣。 吉水则周永也。 郑通判询挈家见公，时一女方及笄。 公忽云：母也恋女不得，女也恋母不得。 未几，女感疾而卒。 报恩寺律僧惟永，与数僧同见公。 公顾惟永，取一蒲团若坐禅者，谓诸人曰：尔等不如他会如此坐。 众不能晓，后惟永出世住宝宁云。 绍圣中，无为军汤安见公，且画公像归，奉香火久之。 其子妇有一子三岁，安梦公云：可施此子出家。 觉而语其妻秦氏，秦恚以为不祥，未几儿病死。 秦氏怒取公像投江中，后秦氏感时疾，得软臂疾。 安复来见公，公云：尔妻奔我於江中，谓溺死矣。 我却到长芦上得来。 安大愧，谢而去。 继有潭州贾人刘真见公，公遽云：昨谢汝相救。 刘真言：顷至长芦，见文书一轴浮水上，取之乃公像也。 陆羲一日遇公於观后门，公问：汝姓甚？ 曰：姓陆。 公曰：尔何不出门外坐，有亲戚来觑你也。 又曰：三日二日。 羲归三日，果有一亲戚时生至其家二感疾。 羲复叩公，公以□字授之。 又三日，时生殂於羲之门外。 承务郎王安中，尝书姓名年甲求字。 公於王安中三字周回，书青龙、白虎、朱雀、玄武八字，曰：只此是也。 至京遇大礼，差行事郊坛，见四兽旗正在安中所立处左右前后也。 又尝求叹水，公云：此不须咒水，五月五日却用得杨枝水。 后归至杭州，以女子病，有僧治之，持杨枝吮水。 诵咒是日，女子卒，乃重午日也。 丞相张天觉，尝泊舟维杨山光寺前。 见岸侧有道人院手，且於中指间取篦掠发，神彩甚异。 亟邀至，问之曰：适见掠发者，无乃剑乎。 道人唯唯。 张云：一观可否？ 道人如前，於指甲间取一篦子，如白金色，长三寸许，以气吹之，欻然成剑。 张接视之，剑也。 坐问遽失道人所在。 后诣海陵见公，欲问所遇，未及语，公出片纸授之，有洞文二字。 洞字中一画移下则为洞字，回乃二口，则知水侧道人乃吕公也。 公暇日多立於香柜之侧，忽有两美妇携手而来，歌唱自若，直抵公所。 众皆骇愕，久之而去。 有陈李二翁在傍，问公：何人耶？ 公曰：何蒋二仙姑也。 众急追，及门而隐。 龚深甫司业初起谪籍，生追人求字，公书兴尸起死白骨成人八字。 经云：回骸起死。 天庆观主首作疏化缘，请公为斜首。 公曰：此疏遇有口者即了矣。 凡入疏者，或姓或名多有口焉。 李七翁者，常释公所书字。 一日问公求字，公书是非二字作是□。 如此书，李莫能晓。 有许道士曰：公以尔所释字，少是多非也。",
      "translated_text": "At Gaoyou, Sang Zhengguo was preparing to take the imperial examination and sought the Master’s counsel. The Master wrote three characters on a yellow-green slip: *huang lü jian*. The scriptures speak of *huang xian bai jian*, but the Master omitted *bai* (\"white\") and replaced *xian* (\"thread\") with *lü* (\"register\"). That year, Sang indeed passed the examination.\n\nHu, the Registrar, was attending his father when the elder retired from office and returned to Taizhou. The Master said, \"This Registrar Hu is like Registrar Pan.\" Earlier, Pan had also attended his father in retirement and returned home, whereupon his father passed away. Soon after, Hu’s father likewise died.\n\nZeng, the Revenue Officer, visited the Master on the Double Ninth Festival. As he took his leave, he said, \"I shall call again in the spring.\" The Master replied, \"We shall meet on this day next year.\" Zeng was delayed by affairs, and when he returned, it was indeed the Double Ninth of the following year.\n\nOld gardener Feng Wang had the Master’s portrait painted in his home and daily offered food and drink before it. One day, he forgot the offering, but the next morning, he carried a bundle of radishes to the temple storeroom. Seeing him, the Master said, \"You treated me well—I would have gone hungry yesterday had I not received a meal from the Qian family.\" The Qian family, too, made daily offerings of food.\n\nA young man of the Sun family visited the Master, who wrote three characters: *ri xia ren* (\"man beneath the sun\"). He added, \"Return home at once—today, an imperial messenger has received this same message.\" Sun hurried home, fell gravely ill, and died beneath the sun.\n\nMagistrate Zhang Lian, having been dismissed from office, was seeking a boat when he came to see the Master. The Master wrote two characters: *Ji Shui* (\"Auspicious Water\"), saying, \"Proceed as you intend.\" Zhang went to see the prefect, who told him, \"I have just assigned Zhou Yong’s boat to another.\" *Ji Shui* was indeed Zhou Yong’s name.\n\nVice-Director Zheng, bringing his family to see the Master, had a daughter who had just come of age. The Master suddenly remarked, \"Neither mother nor daughter may linger—the mother clings to the daughter, and the daughter to the mother.\" Soon after, the daughter fell ill and died.\n\nVinaya monk Weiyong of Baoyin Temple, along with several monks, visited the Master. The Master turned to Weiyong, took a rush cushion as if for meditation, and said to the others, \"None of you can sit as he does.\" The group did not understand, but later Weiyong left the monastery to reside at Baoning.\n\nDuring the Shaosheng era, Tang An of Wuwei Commandery visited the Master and had his portrait painted to take home, where he honored it with incense and offerings for a long time. His daughter-in-law had a three-year-old son, and Tang dreamed the Master said, \"Have this child leave home to become a monk.\" Upon waking, he told his wife Qin, who grew angry, deeming it an ill omen. Soon after, the child fell ill and died. Qin, enraged, cast the Master’s portrait into the river. Later, she contracted an epidemic and developed a paralyzed arm. Tang returned to see the Master, who said, \"Your wife cast me into the river, as if to drown me. Yet I was retrieved from the shore at Changlu.\" Tang was deeply ashamed and apologized before leaving.\n\nLater, a merchant from Tanzhou named Liu Zhen visited the Master, who suddenly said, \"I must thank you for saving me.\" Liu replied, \"Recently, at Changlu, I saw a scroll floating on the water. I retrieved it—it was your portrait.\"\n\nOne day, Lu Xi encountered the Master at the rear gate of the abbey. The Master asked, \"What is your surname?\" \"Lu,\" he replied. The Master said, \"Why not sit outside the gate? A relative is coming to visit you.\" He added, \"In two or three days.\" Lu returned home, and three days later, a relative named Shi Sheng arrived, only to fall gravely ill. Lu again sought the Master, who gave him a character (□). Three days later, Shi Sheng died outside Lu’s gate.\n\nCourt Gentleman Wang Anzhong once wrote his name and birth details, seeking a divination. The Master circled the three characters of his name and wrote eight more around them: *Qing Long, Bai Hu, Zhu Que, Xuan Wu* (\"Azure Dragon, White Tiger, Vermilion Bird, Black Tortoise\"). He said, \"This is all you need.\" Later, in the capital for a grand ceremony, Wang was assigned to officiate at the suburban altar. There, he saw the four spirit banners positioned exactly where he had stood.\n\nAnother time, Wang sought a charm for water. The Master said, \"No incantation is needed—on the fifth day of the fifth month, willow-branch water will suffice.\" Later, returning to Hangzhou, Wang’s daughter fell ill. A monk treated her by sipping water through a willow twig and reciting incantations—on that very day, the Double Fifth, the girl died.\n\nPrime Minister Zhang Tianjue once moored his boat before Guangshan Temple in Weiyang. On the shore, he saw a Daoist’s hand emerge from a hut, plucking a comb from between his fingers to groom his hair. The man’s bearing was extraordinary. Zhang hastily invited him aboard and asked, \"The one combing his hair just now—was that not a sword?\" The Daoist assented. Zhang said, \"May I see it?\" The Daoist, as before, took a comb from his fingernail—a slender, silver-white object about three inches long. With a breath, it transformed into a sword. Zhang took it and examined it—it was indeed a sword. As they spoke, the Daoist vanished.\n\nLater, Zhang visited the Master at Hailing and, before he could ask about the encounter, the Master handed him a slip of paper with two characters: *dong wen*. The first character, *dong* (\"cave\"), had its middle stroke lowered to form *shui* (\"water\"), while the second, *wen* (\"script\"), was two mouths (*kou*). Thus, Zhang knew the Daoist by the water was Lord Lü.\n\nIn his leisure, the Master often stood beside the incense cabinet. Suddenly, two beautiful women entered hand in hand, singing as they approached him. The assembly was astonished, but after a while, they departed. Two elders, Chen and Li, stood nearby and asked, \"Who were they?\" The Master replied, \"The two immortal sisters, He and Jiang.\" The crowd rushed after them but saw them vanish at the gate.\n\nWhen Academician Gong Shenfu was first exiled, a follower sought a divination from the Master, who wrote eight characters: *xing shi qi si bai gu cheng ren* (\"Rise from the corpse, revive the dead, turn white bones into living men\"). The scriptures say: *hui hai qi si* (\"Return the bones, raise the dead\").\n\nThe abbot of Tianqing Abbey composed a fundraising petition and asked the Master to write the heading. The Master said, \"This petition will be resolved by someone with a ‘mouth’ in their name.\" Among those who contributed, many had the character *kou* (\"mouth\") in their names or surnames.\n\nA certain Elder Li often interpreted the Master’s written characters. One day, he asked for a divination, and the Master wrote two characters: *shi fei* (\"right and wrong\"), but with *shi* incomplete (是□). Li could not decipher it. A Daoist named Xu said, \"The Master means that in your interpretations, there is little right and much wrong.\"",
      "overlap_context": "bout him, and Daosheng said, \"This is the Divine Elder Xu.\" Yang stepped forward to bow, but the old man had already vanished, leaving only a wooden *dou* (斗) on the ground. Yang then went with Daosheng to see the Master, who confirmed that the old man was the one they had encountered. When asked about the *dou*, the Master said it was the *dou* from the pillar of the Three Officials Hall. He added, \"We wish to repair this hall.\" Yang Gongzuo donated several hundred thousand coins to rebuild it.",
      "start_char": 9412,
      "end_char": 10673,
      "start_sentence": 522,
      "end_sentence": 595,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.262070417404175,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\虚静冲和先生徐神翁语录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "公笑。 陈七翁者，亦常解公字。 一日侍公侧，公以片纸与之，书过度三界字。 陈大喜，谓：经之下文云位登仙翁也。 有道人薛谷曰：此非吉也。 谷是有病，鹤在庭下。 公祝之曰：过度三界。 诵之数遍，鹤数日死。 未几，陈果卒。 姜堰催纲司将校沈福，绍圣初得渭州方士张子皋符水，绝粒近两月。 来见公，公书以其尚食税之多七字与之。 公意戒其绝粒尔。 沈不悟，月余而死。 袁承议符赴通州海门宰，挈家见公。 符自烹茶一盏奉公，公饮一呷，即授与符，曰：尔等一切吃吃了安乐。 符未吃，间道正来揖符，即授与妻儿等遍饮。 及归船，家人问曰：适仙生令一切吃茶，独知县不饮，何也？ 符方省不曾饮，亦不介意。 至海门卒，举家饮茶者皆安。 绍圣甲戊，天庆作上元醮，三夕十六日斋毕。 道士王善祥等，在醮器库豚涤见一人，形貌磊落，衣布袍，至库前长揖。 善祥等皆不介意，既去。 公至，问曰：何不请道人吃茶？ 善祥曰：为忙。 公咄之曰：此吕公访我耳。 善祥追之不及。 信州竹宗隐，求字卜出家。 公书三界五帝字，曰：可往真州。 遂投仪真观。 后遇试经，得帝列二字经头。 是年试中，披戴盖所挑经头，上则三界五帝，下则列言上清。 四明举子秦生，累举不第。 问公，公曰：若见张果老乘铁船过海，即过省也。 后兔解赴省试，在景德寺坐间，见壁画在后，视之其画如公所言者，是年擢第。 道士刘守宁募缘铸锺，问何日可成？ 公云：三火方得。 已而再铸不就，复问公，公云：须是通州。 遂往静海，得张冷子者，欲鼓间，忽见公来，众欣然迎之，辄不复见，遂一铸而成。 虚静汁和先生徐神翁语录卷上竟 虚静冲和先生徐神翁语录卷下 公自绍圣乙亥九月旦，扃户不出，不饮不食，道众叩户，寂无音响。 十一月七日，郡守陆农师至，令道正击户，有顷闻警软之音。 陆呼曰：佃在此久矣，士民自公不出，忧惶颇甚。 遂出相见。 陆问之，公曰：作少缘事故尔。 数日，有人献紫花石柱四。 公初闭户未出，道正许守节亦扣户拜请。 公既出，谓陆守曰：侍郎此人难教化也。 遽索酒，陆守疑其素不饮，今索之必有谓。 亟取酒至，公亦不饮，乃曰：此坏人之物也。 陆云：在神公莫不然否？ 公曰：也则不得，此与财无异，至此不戒，是难教化也。 盖专以戒守节耳。 又索纸笔，写云：或先品空二字，守信生多吉，难感谢泰州许寿澄提携，向后去不得野，进退艰难，遂发虔心，追荐先亡久远，绍圣二年十一月初七日为。 据共五十二字，授与守节曰：今日使得，后数日复取去。 皆莫能晓。 先是元佑末，重建三清殿，公谓守节曰：尔可退却名目，将衣钵尽施造殿。 守节不从，至此又戒之，亦不悟。 明年十一月初七日，守节死。 姜堰兵子王立病将死，其妻入郡市丧具，邂逅邻媪李氏，同见公。 公云：王家家计，却是李家底。 及归，王立病愈，而李氏子亡，遂以王氏棺殓之。 王惠问公择日种早稻，公云：六月初二日好。 道众云：莫大晚否？ 惠信受有素，遂归俟之。 会岁旱，先种者皆槁，五月末得雨，遂以六月二日种，所收倍於常年。 海门翟元以大银炉施公，公叱之曰：岂不误他和尚。 元再三乞留，公不纳。 元退与道士言：初作此炉，欲往泗上施僧伽大士，今报以施公，故有是语也。",
      "translated_text": "The Master laughed.\n\nA certain Elder Chen, who also often interpreted the Master’s written characters, once stood by his side. The Master gave him a slip of paper on which he wrote *guo du san jie* (\"crossing the Three Realms\"). Chen was overjoyed, saying, \"The next line in the scripture reads *wei deng xian weng* ('ascend to the rank of Immortal Elder').\" A Daoist named Xue Gu said, \"This is not an auspicious sign.\" Xue Gu was ill at the time, and a crane stood in the courtyard. The Master prayed for him, saying, \"*Guo du san jie*.\" After reciting it several times, the crane died within days. Soon after, Chen indeed passed away.\n\nJiangyan’s tax officer, Marshal Shen Fu, had obtained a talisman and water from the Weizhou fangshi Zhang Zigao during the Shaosheng era. He had abstained from grain for nearly two months. When he came to see the Master, the Master wrote seven characters for him: *qi shang shi shui zhi duo* (\"the excess of his food and taxes\"). The Master meant to warn him against abstaining from grain, but Shen did not understand. A month later, he died.\n\nAttendant Gentleman Yuan Fu was appointed magistrate of Haimen in Tongzhou and brought his family to see the Master. Fu personally brewed a cup of tea and offered it to the Master. The Master took a sip, then returned it to Fu, saying, \"You and yours should drink it all for peace and ease.\" Fu had not yet drunk it when, along the way, a Daoist priest arrived and bowed to him. Fu then gave the tea to his wife and children to drink. Upon returning to the boat, his family asked, \"Just now, the immortal told everyone to drink the tea, but why did the magistrate not drink it?\" Fu then realized he had not drunk it himself and thought nothing of it. When he arrived in Haimen, he died, while all who had drunk the tea remained safe.\n\nIn the Jiaxu year of the Shaosheng era, Tianqing Abbey held an Upper Prime Offering for three evenings, concluding on the sixteenth day of the first month. Daoists Wang Shanxiang and others were cleaning the ritual vessels in the storage when they saw a man of imposing appearance, dressed in a plain cloth robe, approach the storeroom and bow deeply. Shanxiang and the others paid him no mind, and he left. When the Master arrived, he asked, \"Why did you not invite the Daoist to drink tea?\" Shanxiang replied, \"We were too busy.\" The Master rebuked him, saying, \"That was Lord Lü come to visit me.\" Shanxiang pursued him but could not catch up.\n\nZhu Zongyin of Xinzhou sought a written divination to determine whether he should leave home to cultivate the Dao. The Master wrote *san jie wu di* (\"Three Realms, Five Emperors\") and said, \"You may go to Zhenzhou.\" He then entered Yizhen Abbey. Later, when tested on the scriptures, he drew the characters *di lie* (\"Emperor’s rank\") at the beginning of the text. That year, he passed the examination. The characters he had been assigned to explain were *san jie wu di* at the top and *lie yan shang qing* (\"ranked among the Supreme Clarity\") at the bottom.\n\nA candidate from Mingzhou named Qin had repeatedly failed the imperial examinations. He asked the Master, who said, \"When you see Zhang Guolao crossing the sea in an iron boat, you will pass the provincial examination.\" Later, Qin traveled to the capital for the examination. While sitting in Jingde Temple, he saw a mural behind him depicting exactly what the Master had described. That year, he passed.\n\nDaoist Liu Shouning was raising funds to cast a bell and asked when it would be completed. The Master said, \"Only after three fires.\" After two failed castings, he asked the Master again, who said, \"You must go to Tongzhou.\" He then went to Jinghai, where he found a man named Zhang Lengzi. As Zhang was about to strike the furnace, he suddenly saw the Master arrive. The crowd joyfully welcomed him, but he vanished at once. The bell was then cast successfully in a single attempt.\n\n---\n\n*The Record of Master Xu, the Serene and Harmonious Master of Emptiness and Stillness, Volume One* concludes.\n\n*The Record of Master Xu, the Serene and Harmonious Master of Emptiness and Stillness, Volume Two*\n\nOn the first day of the ninth month in the Yihai year of the Shaosheng era, the Master shut his door and did not emerge. He neither ate nor drank. When Daoists knocked at his door, there was no sound. On the seventh day of the eleventh month, Prefect Lu Nongshi arrived and ordered the Daoist overseer to knock. After a while, a faint sound was heard. Lu called out, \"I have been here for some time. Since you have not emerged, the people have been deeply anxious.\" The Master then came out to meet him. Lu asked him about it, and the Master said, \"I was attending to a minor matter.\"\n\nA few days later, someone presented four purple-flowered stone pillars. While the Master had not yet emerged from his seclusion, the Daoist overseer Xu Shoujie also knocked at his door and bowed in request. After the Master came out, he said to Prefect Lu, \"This vice-minister is difficult to teach.\" He then demanded wine. Lu suspected that, as the Master usually did not drink, his request must have a meaning. He quickly brought wine, but the Master did not drink it. Instead, he said, \"This is a thing that corrupts people.\" Lu asked, \"Is there nothing divine about it?\" The Master replied, \"That is not the case, but it is no different from wealth. If one does not guard against it upon reaching this point, they are difficult to teach.\" This was specifically to admonish Shoujie.\n\nThe Master then asked for paper and brush and wrote: *huo xian pin kong er zi, shou xin sheng duo ji, nan gan xie Tai zhou Xu Shoucheng ti xi, xiang hou qu bu de ye, jin tui jian nan, sui fa qian xin, zhui jian xian wang jiu yuan, Shaosheng er nian shi yi yue chu qi ri wei* (\"Perhaps the first two characters are *pin kong* ['rank' and 'emptiness']; keeping faith brings much good fortune. Grateful for the support of Xu Shoucheng of Taizhou, but henceforth one must not act recklessly. Advancing or retreating is difficult, so I have resolved to sincerely perform a rite for the long-departed ancestors. Done on the seventh day of the eleventh month in the second year of the Shaosheng era.\"). In all, fifty-two characters were written. He handed them to Shoujie, saying, \"You may have them today, but I will take them back in a few days.\" No one could understand their meaning.\n\nPreviously, at the end of the Yuanyou era, when the Three Clarities Hall was being rebuilt, the Master had told Shoujie, \"You should withdraw your name and donate all your robes and alms-bowl to construct the hall.\" Shoujie did not comply. Now, the Master admonished him again, but he still did not understand. On the seventh day of the eleventh month the following year, Shoujie died.\n\nA soldier from Jiangyan named Wang Li was gravely ill and near death. His wife went to the prefectural market to purchase funeral items when she encountered her neighbor, an old woman surnamed Li, and together they went to see the Master. The Master said, \"The Wang family’s household affairs will become the Li family’s.\" Upon returning home, Wang Li’s illness was cured, but the Li family’s son died, and they used the Wang family’s coffin to enshroud him.\n\nWang Hui asked the Master to select a day for planting early rice. The Master said, \"The second day of the sixth month is good.\" The Daoists said, \"Is that not too late?\" Hui had always trusted the Master’s words, so he returned home to wait. That year, there was a drought, and those who had planted earlier saw their crops wither. Rain fell at the end of the fifth month, so he planted on the second day of the sixth month. The harvest was twice that of a normal year.\n\nQu Yuan of Haimen offered the Master a large silver incense burner. The Master rebuked him, saying, \"Will this not mislead other monks?\" Yuan repeatedly begged to leave it, but the Master refused. Yuan withdrew and said to the Daoists, \"Originally, I made this burner to offer to the Great Master Sengqie in Sishang. Now, I have instead offered it to the Master, hence his words.\"",
      "overlap_context": "n will be resolved by someone with a ‘mouth’ in their name.\" Among those who contributed, many had the character *kou* (\"mouth\") in their names or surnames.\n\nA certain Elder Li often interpreted the Master’s written characters. One day, he asked for a divination, and the Master wrote two characters: *shi fei* (\"right and wrong\"), but with *shi* incomplete (是□). Li could not decipher it. A Daoist named Xu said, \"The Master means that in your interpretations, there is little right and much wrong.\"",
      "start_char": 10673,
      "end_char": 11944,
      "start_sentence": 596,
      "end_sentence": 664,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.80385088920593,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\虚静冲和先生徐神翁语录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "即复见公，公云：尔不须见我，且与杰老一处说话。 元归至家，病死。 元有长子名元曾，字孝杰，死未葬，父子伺室殡厝。 韩舜言有二子同染疫，问公，公书生字。 舜言大喜，后一子亡，一子愈。 李八师释之曰：病愈者必丑生，生字从牛从一也。 舜言云然。 淮阳军村居常清富於财，境有山，西接符离，石矿甚多，不入用。 一日有老父扣门见之，云：此山有锦石，汝能取施泰州天庆观，结大胜绿否？ 清笑曰：此山安得锦石耶？ 老父云：尔取之勿疑。 遽失老父所在。 语其妻，曹氏云：尔试凿之。 果有石纹，如紫锦。 清夫妇来见公，即所见老父也。 未语间，公书化生诸天授之。 清与妻拜公曰：未曾化得一物，何拜？ 清曰：欲化何物？ 公曰：石条石柱。 清遂还淮阳取之，不逾年而就。 泛海而来，遇暴风雨，舟人不能措手，清呼公护持。 忽大暗，雾电光中，若见神物挈舟甚速。 翊日风止，已达海门，入往至柴墟。 清先来见公，公曰：路中惊怖不易，若不然不如此速也。 宣德郎耿纯，欲与长子娶妇，累问不答。 一日书角引二字，且云与尔祖母同。 后娶通州张氏，其祖母亦张氏也。 释谭永住扬州石塔退院，归天合么别公。 公书香字授之，后至四明住香山。 大资张邃明除帅扬州未视事，谒公。 公取纸大书一亡字，傍作四十九点。 邃明至扬州，未瑜月而薨。 其季成，后四十九日亦卒。 江东巨商李氏见公，公汲水，饮之数杯，李辞以不能多饮。 公云：彼饮一江水，汝乃不能饮数杯耶？ 李愧谢，乞作大斋醮，以涤前过，公许之。 李昔与一商共泛江，利其厚赀，至中流醉坠於江。 进士陈护有女子十五岁，拜香於公前，公两啮其颈，后欲啮之，女号惧而逃，是夜自缢死。 诘旦护问公，公云：此女为宿冤所缠，吾欲三喷之，汝女自逃，吾知不免矣。 汝验其绳可见也。 护归验之，则所缢之绳，三股中断，惟一股存。 左丞陆农师守泰，见得报除曾子开为代，而陆未有新命。 疑而问公，公云：陆侍郎替曾侍郎，曾侍郎替陆侍郎。 陆云：某在金陵尝与曾侍郎为代。 公言如初。 又云：海上好守官。 经旬日，报除海州。 其后子开自泰移海，又相为代。 陆尝刻奏於朝，问公，公书郑字。 复云：郑字加手为甚字？ 陆云：掷字。 公云：掷了也。 陆忧之。 公云； 过三年后，却不掷了。 及离海陵日别公，云：此去如何？ 公云：道众多也，菜又贵也。 后自海移蔡，未几被召，遂除丞辖。 盖前所陈不下，至是获伸，故大用，始验三年之语。 陆又尝得负天担石四字，乃执政之验。 陆在朝遣人求字，公书终老二字。 后守亳州，老君祠在焉。 陆既感疾，复遣人问公，得上三十二二，凡五字。 又云：下而二字，做得天字左丞也，不须使人字也。 竟薨于亳，乃三月二十二日。 林灵噩绍圣中求字，得林下人三字。 政和初，自楚州应诏。 天庆重建三清殿，上梁，道众白公，公云：上了下，下了上。 已而陆侍郎至，仰视梁记乃书，道正劝缘。 陆曰：神公之力，他人何与。 亟令下之，别书神公姓名，而后上焉。 众谓公言应矣。",
      "translated_text": "The Master then saw Yuan again and said, \"You need not see me. Go speak with Elder Jie instead.\" Yuan returned home and died of illness. Yuan had a eldest son named Yuan Zeng, styled Xiaojie, who had also died but remained unburied, so father and son lay together in the same chamber.\n\nHan Shunyan had two sons who fell ill with an epidemic. He asked the Master, who wrote the character *sheng* (生). Shunyan was overjoyed. Later, one son died, while the other recovered. Li Bashi explained, \"The one who recovered must be *chou sheng*—the character *sheng* (生) is composed of *niu* (牛, ox) and *yi* (一, one).\" Shunyan confirmed this was so.\n\nChang Qing of Huaiyang Commandery lived in a village and was wealthy. Near his home stood a mountain, its western slopes bordering Fuli, rich in stone but of no use. One day, an old man knocked at his door and said, \"This mountain holds brocade stone. If you can take it to offer to Tianqing Abbey in Taizhou, will you not achieve great merit?\" Qing laughed, \"How could this mountain have brocade stone?\" The old man replied, \"Take it and doubt not.\" Suddenly, the old man vanished. Qing told his wife, née Cao, who said, \"Try quarrying it.\" Indeed, they found stone with veins like purple brocade.\n\nQing and his wife came to see the Master, who was the old man they had met. Before they could speak, the Master wrote *huasheng zhutian* (化生诸天, \"transformed and born among the heavens\") and handed it to them. Qing and his wife bowed to the Master, saying, \"We have not yet transformed a single thing—why bow?\" Qing asked, \"What would you have us transform?\" The Master said, \"Stone beams and stone pillars.\" Qing then returned to Huaiyang to quarry them. Within a year, the work was complete. They transported the stones by sea, but encountered a violent storm. The sailors were helpless, so Qing called upon the Master for protection. Suddenly, all went dark, and in the lightning’s glow, they saw divine beings swiftly lifting the boat. The next day, the wind ceased, and they had already reached Haimen, docking at Chaiwu. Qing went ahead to see the Master, who said, \"The journey was perilous. Had it not been for this, you would not have arrived so swiftly.\"\n\nGeng Chun, a Gentleman for Meritorious Achievement, wished to arrange his eldest son’s marriage but received no answer after repeated inquiries. One day, the Master wrote the characters *jiao yin* (角引, \"horn\" and \"pull\") and said, \"The same as your grandmother’s.\" Later, he married a woman from Tongzhou named Zhang, whose grandmother was also surnamed Zhang.\n\nTan Yong, a monk who had retired from the Stone Pagoda Monastery in Yangzhou, returned to Tianhe to bid the Master farewell. The Master wrote the character *xiang* (香, \"incense\") and gave it to him. Later, he resided at Xiangshan in Siming.\n\nZhang Sui, a wealthy man, was appointed military commissioner of Yangzhou but had not yet assumed office when he visited the Master. The Master took paper and wrote a large *wang* (亡, \"death\") character, adding forty-nine dots beside it. When Zhang Sui arrived in Yangzhou, he died before a month had passed. His younger brother, Cheng, also died forty-nine days later.\n\nA great merchant of Jiangdong named Li visited the Master, who drew water and offered him several cups to drink. Li declined, saying he could not drink more. The Master said, \"He drinks a whole river, yet you cannot drink a few cups?\" Li, ashamed, apologized and begged to hold a grand ritual feast to atone for his past transgressions. The Master permitted it. Li had once sailed the river with another merchant, coveting his wealth. Midway, he got the man drunk and pushed him into the river.\n\nChen Hu, a presented scholar, had a fifteen-year-old daughter who bowed and burned incense before the Master. The Master bit her neck twice, then tried to bite her again. The girl screamed in fear and fled. That night, she hanged herself. The next morning, Hu asked the Master, who said, \"This girl was entangled by a karmic debt from a past life. I intended to spit on her three times, but your daughter fled. I knew she would not escape her fate. You may examine the rope.\" Hu returned home and inspected it: of the three strands of the rope, two were broken, leaving only one intact.\n\nLu Nongshi, the Left Assistant Director, was serving as prefect of Tai when he received word that Zeng Zikai had been appointed as his replacement, though Lu had not yet received a new commission. Doubtful, he asked the Master, who said, \"Minister Lu replaces Minister Zeng, and Minister Zeng replaces Minister Lu.\" Lu said, \"I once replaced Minister Zeng in Jinling.\" The Master repeated his words and added, \"The coast is a good place to serve.\" Ten days later, he was appointed to Haizhou. Later, Zikai moved from Tai to Hai, and they again replaced each other.\n\nLu once submitted a memorial to the court and asked the Master about it. The Master wrote the character *zheng* (郑). Then he asked, \"What character is formed when you add a hand to *zheng*?\" Lu said, \"*Zhi* (掷, 'to cast').\" The Master said, \"It has been cast.\" Lu grew anxious. The Master said, \"After three years, it will no longer be cast.\" When Lu left Hailing to bid the Master farewell, he asked, \"How will this journey be?\" The Master said, \"There are many Daoists, and vegetables are expensive.\" Later, Lu was transferred from Hai to Cai. Shortly after, he was summoned to court and appointed a vice director. His earlier memorial, which had gone unanswered, was now addressed, leading to his promotion. Thus, the Master’s words about three years were fulfilled.\n\nLu once received the four characters *fu tian dan shi* (负天担石, \"bearing heaven and shouldering stone\"), a sign of high office. While in the capital, he sent someone to ask the Master for a written answer, who wrote *zhong lao* (终老, \"to grow old\"). Later, Lu was appointed prefect of Bozhou, where the Temple of the Supreme Lord Lao stood. When he fell ill, he again sent someone to ask the Master, who wrote *shang san shi er er* (上三十二二, \"thirty-two or two above\") and five characters in all. He added, \"The two characters below form the left side of *tian* (天, 'heaven'), making *zuo cheng* (左丞, 'Left Assistant Director'). No need for the *ren* (人, 'person') character.\" Lu died in Bo on the twenty-second day of the third month.\n\nLin Ling’e sought a written answer during the Shaosheng era (1094–1098) and received the three characters *lin xia ren* (林下人, \"a person beneath the trees\"). In the early Zhenghe era (1111–1118), he responded to an imperial summons from Chuzhou.\n\nWhen Tianqing Abbey was rebuilding the Hall of the Three Pure Ones and raising the beams, the Daoists informed the Master, who said, \"The upper is done, the lower is done.\" Soon after, Minister Lu arrived. Looking up at the beam’s inscription, he saw it read *Daozheng Quanyuan* (道正劝缘, \"The Daoist Director Exhorts Contributions\"). Lu said, \"This is the work of the Divine Master—what have others to do with it?\" He immediately ordered the beam lowered and had the Divine Master’s name inscribed instead before raising it again. The assembly said the Master’s words had been fulfilled.",
      "overlap_context": "d of the fifth month, so he planted on the second day of the sixth month. The harvest was twice that of a normal year.\n\nQu Yuan of Haimen offered the Master a large silver incense burner. The Master rebuked him, saying, \"Will this not mislead other monks?\" Yuan repeatedly begged to leave it, but the Master refused. Yuan withdrew and said to the Daoists, \"Originally, I made this burner to offer to the Great Master Sengqie in Sishang. Now, I have instead offered it to the Master, hence his words.\"",
      "start_char": 11944,
      "end_char": 13121,
      "start_sentence": 665,
      "end_sentence": 736,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.87475299835205,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\虚静冲和先生徐神翁语录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "其后改仙源万寿宫，别建三清殿，以旧殿为讲堂，遂下殿牌而立堂额。 政和戊戌，复以讲堂为殿，奉安圣祖，又下堂额而立殿牌。 道士阚若拙往山阳，省亲别公。 公书去野二字，至山阳而亡。 周稙妻裴氏病，书妻生月求字。 裴六月生，公於六字下添十字，裴竟不起。 沈侍郎锡尝求字，云：愿示平生休咎。 公书待经五帝，且云向上去不得也，侍字作三重人。 其后子昭为侍郎，兼侍讲，又兼侍读，遂出领郡。 子昭服金石药，独喜饮水，不能乾食。 作书问公，欲进少乾食以自养，方待报问。 一夕梦公以蒸饼令食，再三不能咽。 公云：汝强食之。 仅食其半，翊日遂能食乾物。 佴光顺每见公，公云：尔在城后住，何不移居城束。 凡三四年，但云力未能动。 公怒之，光顺即问公择日，公曰：五月五日好。 后因大水迁居，乃五月五日。 又为其子娶妇来问公，公云：八家都上灯，惟尔家不上灯，遂用未上灯时纳妇。 时里巷娶妇者，九岁余八家皆有事故，惟光顺家无恙。 光顺女七岁得惊疾，见公，公曰：速问戴道士，见陈秀才。 光顺问之，戴云：吾无药，闻陈秀才近合至宝丹，专治此疾。 遂往求之。 比得药已不救，灌之不效。",
      "translated_text": "Later, the abbey was renamed Xianyuan Wanshou Palace, and a new Hall of the Three Pure Ones was constructed, with the former hall repurposed as a lecture hall. Thus, the hall plaque was taken down, and a lecture hall inscription was erected in its place. In the eighth year of the Zhenghe era (1118), the lecture hall was again converted into a hall, where the Sacred Ancestor was enshrined, and the lecture hall inscription was removed to make way for a new hall plaque.\n\nThe Daoist Kan Ruozhuo traveled to Shanyang to visit his family and bid farewell to the Master. The Master inscribed the characters *qu ye* (去野, \"departing the wilds\") for him. Upon reaching Shanyang, Ruozhuo passed away.\n\nLady Pei, the wife of Zhou Zhi, fell ill and requested a character based on her birth month. Born in the sixth month, the Master added a *shi* (十, \"ten\") beneath the *liu* (六, \"six\"), and Lady Pei ultimately did not recover.\n\nMinister Shen Xi once sought a character, saying, \"I wish to know the fortunes and misfortunes of my life.\" The Master wrote *dai jing wu di* (待经五帝, \"await passing the Five Emperors\") and added, \"One cannot advance beyond this point.\" The character *shi* (侍, \"attendant\") was written as three stacked *ren* (人, \"person\"). Later, Shen’s son Zhao became a minister, concurrently serving as Imperial Lecturer and Imperial Reader, before being appointed to govern a prefecture.\n\nZhao had long consumed alchemical elixirs and preferred drinking water, unable to eat dry food. He wrote to the Master, asking if he might gradually introduce dry food to nourish himself, and awaited a reply. One night, he dreamed the Master gave him a steamed bun, urging him to eat it, but he could not swallow it after several attempts. The Master said, \"You must force yourself to eat it.\" He managed to consume half, and the next day, he could eat dry food.\n\nNai Guangshun would often visit the Master, who said to him, \"You live behind the city—why not move to the east side?\" For three or four years, Guangshun only replied that he lacked the means to relocate. The Master grew angry, and Guangshun asked him to select an auspicious date. The Master said, \"The fifth day of the fifth month is good.\" Later, due to a great flood, Guangshun moved his residence on the fifth day of the fifth month.\n\nWhen Guangshun sought the Master’s advice on arranging his son’s marriage, the Master said, \"Among eight households lighting lanterns, only yours does not—proceed with the wedding before lanterns are lit.\" At the time, in the neighborhood where marriages were being arranged, eight of the nine families with brides over nine years old encountered misfortune, while only Guangshun’s household remained unharmed.\n\nGuangshun’s seven-year-old daughter suffered from convulsions. Upon seeing the Master, he was told, \"Quickly ask Daoist Dai and visit Scholar Chen.\" Guangshun inquired, and Dai said, \"I have no medicine, but I hear Scholar Chen recently compounded the Supreme Treasure Elixir, which specifically treats this illness.\" He went to seek it, but by the time the medicine was obtained, it was too late to save her, and administering it proved ineffective.",
      "overlap_context": "ams, the Daoists informed the Master, who said, \"The upper is done, the lower is done.\" Soon after, Minister Lu arrived. Looking up at the beam’s inscription, he saw it read *Daozheng Quanyuan* (道正劝缘, \"The Daoist Director Exhorts Contributions\"). Lu said, \"This is the work of the Divine Master—what have others to do with it?\" He immediately ordered the beam lowered and had the Divine Master’s name inscribed instead before raising it again. The assembly said the Master’s words had been fulfilled.",
      "start_char": 13121,
      "end_char": 13586,
      "start_sentence": 737,
      "end_sentence": 760,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.710161924362183,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\虚静冲和先生徐神翁语录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "复见公，公曰：贺喜，但尔不作妇翁耳。 及归，女子已苏，后出家为女冠。 有钱臻者暴卒，心微温，家人不忍殓，五日而苏。 自云初为人追，至一官府有据按治事者，今往如皋县东监治道路。 既毕，吏白：尚有一路欲就，令此人监治。 官曰； 臻神公会下人，可令速归。 却追臻，璇许臻监治。 臻既苏，许臻方自外归，忽头痛，是夕暴卒。 殿直杨公佐赴天台监酒，来见公，公书重午二字。 后五十五岁卒，自殡至葬又五十五日。 僧法胜初来见公，求出家。 公曰：汝作观音菩萨不得，且作地藏菩萨。 后往寺中出家，试经中落发。 盖观音乃顶冠，地藏则独示顶相尔。 黄杞未有子，求字。 公书元台平育四字，作元月干云。 如此书，竟无子。 盖胎育不全耳。 又尝以堂妹病问公，公云：汝妹不安，吾将奈何。 数日而亡。 翟平病，其妻问公，公曰：较也，较也。 比归平已卒，方悟其言乃窖藏之窖尔。 浙人孟轸善轨革，欲改业图仕。 进见公，公书质心依旧格五字。 轸悟，以旧术游都城，其术盛行。 卞德往泗上烧香，已及境，忽失道。 西行里余，见枯骨无数，似非人行处。 有老父呼曰：不是路也，可从此来。 遂得官道。 既归见公，公云：汝等烧香也错了路。 常州洞灵观道士陈宗式，绍圣中书姓名见公求字。 公无语，止於宗字上加一山字。 再三问之，公曰：只是如此也。 宗式既回中道，闻洞灵阙人，邑人乞於县宰，以宗式焚修。 及得帖，乃名崇式。 宗式曰：名误也。 吏曰：以邑令所讳，故改之尔。 王少卿硕甫，绍圣问守鄱阳，遣人求字，得寿字阙其口。 行次金陵，改除寿州。 赴官日得长兄之讣，乃应阙口。 吕大卿直甫为漕日见公，公书盎字。 已而除知宿州，改明州，又改饶州，自谓三守土也。 在饶时，一日自外归，仰视州额，方悟盎字。 吕又尝挈家将归龙舒，别公，公云：彼有井否？ 云：居有数井。 公云：井多即好。 至舒州，遭回禄。 吴敞绍圣甲戌求字，得三三闭字。 时吴未仕，而素有符箓之志。 丙子岁，侍其父官於江淮，於延昌观麻姑山王法师处授天心正法。 王曰：吾适悟公所得字，乃经中有上闻三十二天心，拜三十二过，闭目静思之语。 公於此三句中隐天心秘，三字谓天心秘法也，闭则秘也。 元符中蔡承议似为六合簿，丁母忧见公。 公问：甚处居？ 云：仪真。",
      "translated_text": "Upon seeing the Master again, he said, \"Congratulations, though you shall not become a father-in-law.\" Upon returning home, the girl had already revived, and later left the household to become a Daoist nun.\n\nThere was a man named Qian Zhen who suddenly died, his heart still faintly warm. His family could not bear to enshroud him, and after five days, he revived. He recounted that at first, he was pursued by someone and brought before an official bureau where records were examined and affairs adjudicated. He was then sent to supervise road repairs east of Rugao County. Once the task was completed, an underling reported, \"There is still one more road to be overseen—let this man supervise it.\" The official said, \"Zhen is a disciple of the Divine Assembly; allow him to return swiftly.\" Yet they still summoned Zhen, permitting him to oversee the work. After Zhen revived, Xu Zhen had just returned from outside when he suddenly suffered a headache and died that very night.\n\nDianzhí Yang Gongzuo was traveling to Tiantai to oversee wine production when he came to see the Master, who wrote the characters for \"Double Fifth.\" Later, at the age of fifty-five, he passed away, and from his encoffining to burial, another fifty-five days elapsed.\n\nWhen the monk Fasheng first came to see the Master seeking to leave the household, the Master said, \"You cannot become Avalokiteśvara Bodhisattva; you may only become Kṣitigarbha Bodhisattva.\" Later, he went to a monastery to leave the household and was tonsured during the scripture examination. For Avalokiteśvara wears a crown upon the head, while Kṣitigarbha alone reveals his bare topknot.\n\nHuang Qi had no sons and sought a written prediction. The Master wrote the four characters *yuan tai ping yu*, which he interpreted as \"the first month of the celestial stem.\" Despite this inscription, Huang Qi remained childless, for his capacity for conception and nurturing was incomplete.\n\nAnother time, someone asked the Master about his younger cousin’s illness. The Master said, \"Your cousin is unwell—what can I do?\" Several days later, she passed away.\n\nWhen Zhai Ping fell ill, his wife inquired of the Master, who said, \"A cellar, a cellar.\" By the time she returned home, Ping had already died, and she then realized his words referred to the character for \"cellar.\"\n\nA man from Zhejiang, Meng Shen, was skilled in leatherwork and wished to change his profession to seek an official career. Upon meeting the Master, he received the five characters *zhi xin yi jiu ge*. Meng understood and returned to the capital with his former craft, where his skills flourished.\n\nBian De went to Sishang to burn incense but, upon reaching the border, suddenly lost his way. After traveling westward over a mile, he saw countless bleached bones, as if in a place untrodden by humans. An old man called out, \"This is not the path—come this way.\" Bian then found the official road. Upon returning to see the Master, the Master said, \"You took the wrong path on your incense-burning journey.\"\n\nChen Zongshi, a Daoist of Dongling Abbey in Changzhou, had his name recorded during the Shaosheng era and sought a written prediction from the Master. The Master said nothing but merely added the character for \"mountain\" above the character *zong* in his name. When pressed repeatedly, the Master said, \"It is only this.\" On his way back, Zongshi heard that Dongling Abbey lacked a resident Daoist, and the townspeople petitioned the county magistrate to appoint him for ritual purification. When the official notice arrived, his name was written as *Chongshi*. Zongshi said, \"That is a mistake.\" The clerk replied, \"It was changed to avoid the magistrate’s personal taboo.\"\n\nWang Shaoqing Shifu, during the Shaosheng era, was appointed magistrate of Poyang and sent someone to request a written prediction. He received the character for \"longevity\" with its mouth missing. While traveling through Jinling, his post was changed to Shouzhou. On the day he assumed office, he received the death notice of his eldest brother, which fulfilled the missing \"mouth\" of the character.\n\nWhen Master Lü Daqing Zhifu served as Transport Commissioner and met the Master, he was given the character *ang*. Later, he was appointed prefect of Suzhou, then transferred to Mingzhou, and again to Raozhou, considering himself a three-time local governor. While in Raozhou, one day upon returning from outside, he looked up at the prefectural sign and suddenly understood the meaning of *ang*.\n\nLü once brought his family back to Longshu and bid farewell to the Master, who asked, \"Is there a well there?\" Lü replied, \"There are several wells at the residence.\" The Master said, \"Many wells are good.\" Upon arriving in Shuzhou, Lü encountered a conflagration.\n\nWu Chang sought a written prediction in the Jiaxu year of the Shaosheng era and received the three characters *san san bi*. At the time, Wu was not yet an official but had long harbored an interest in talismanic arts. In the Bingzi year, while serving his father in an official post in Jianghuai, he received the *Orthodox Tianxin Method* from Master Wang of Magu Mountain at Yanchang Abbey. Master Wang said, \"I have just realized the meaning of the characters you received. In the scripture, there is a passage: 'The heart is reported to the thirty-two heavens; thirty-two bows are made; the eyes are closed in silent contemplation.' The Master concealed the secret of *Tianxin* within these three sentences: the three characters refer to the *Tianxin* secret method, and *bi* means 'secret.'\"\n\nDuring the Yuanfu era, Cai Chengyi Si served as the registrar of Liuhe. When he observed mourning for his mother and met the Master, the Master asked, \"Where do you reside?\" Cai replied, \"Yizhen.\"",
      "overlap_context": "le only Guangshun’s household remained unharmed.\n\nGuangshun’s seven-year-old daughter suffered from convulsions. Upon seeing the Master, he was told, \"Quickly ask Daoist Dai and visit Scholar Chen.\" Guangshun inquired, and Dai said, \"I have no medicine, but I hear Scholar Chen recently compounded the Supreme Treasure Elixir, which specifically treats this illness.\" He went to seek it, but by the time the medicine was obtained, it was too late to save her, and administering it proved ineffective.",
      "start_char": 13586,
      "end_char": 14485,
      "start_sentence": 761,
      "end_sentence": 816,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.339558601379395,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\虚静冲和先生徐神翁语录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "公曰：可来此居，且教化我个病孩儿。 似次年遂携家来，其长子幼患足不能行，舍与公为侍香。 公以善仁名之，踰年遂能行，后四年侍公赴阙为道士。 蔡妻张氏见公，公书道言正月长斋魂神澄正万气长存不经苦恼身有光明，凡二十二字。 惟恼字作伉。 书不数日，举家病。 遣人问公，公以林擒十数枚、李子一枚授来人，云：每人与林擒一个，惟二娘子与李子。 遂食之，凡食林擒者皆安，惟食李者亡。 蔡尝以张氏病求咒水，饮之而愈，因施金帛。 公不受，云：要汝作大缘事在。 再叩之，曰：且得。 至崇宁中，挈家来谒公。 引至度人经画壁，观变相。 又书身经太阴四字。 后数日似感疾，问公，公曰：作福则无害。 时方重建玉皇阁，遂许化万人缘，造玉皇及三十二天像。 似既安，遂归钱塘，募缘雕木像及侍从供器花果之类来施，后享寿十七年。 蔡婿田佑以母病见，公书山川林木，其母亡。 元符己卯全彦博赴秋试，榜未出前三日，公遣道童周希元至其家曰：神公令来报捷。 问来时更有何语？ 希元曰：公语我时，惟立大指。 榜出，以魁选。 成都谢公举，元符问作商至真州，诸物皆货尽，惟余数独木舟。 货未得，见一老人云：何不往海陵谢询之，则盐场所用也。 遂至海陵市之。 及见公，乃所见老人也。 泰兴宰昊嘉成见公，公即隐去。 嘉成退，而登三清殿。 公出呼从者曰：尔官人何故不行？ 吏云：未辞，州行未得。 公曰：今日行不得，明日更行不得也。 斓日，忽得软足疾。 大卿齐湛见公，公问：年几何？ 湛曰：六十五。 公曰：更五年即七十矣。 至七十而卒。",
      "translated_text": "The Master said, \"Come reside here, and let me heal my ailing child.\" The following year, Cai accordingly brought his family. His eldest son, who had been afflicted since childhood with an inability to walk, was offered to the Master as an incense attendant. The Master named him Shanren, and within a year, the boy could walk. Four years later, he accompanied the Master to the capital and became a Daoist. When Cai’s wife, née Zhang, met the Master, he wrote for her a Daoist incantation: *\"In the first month, a long fast purifies the soul and spirit; the myriad qi remain everlasting, untouched by suffering; the body radiates light.\"* These were twenty-two characters in total, though the character for \"suffering\" was written as *kang*. Within days of receiving the writing, the entire household fell ill. Cai sent someone to inquire of the Master, who gave the messenger a dozen or so *linqin* fruits and a single plum, saying, \"Give each person one *linqin*, but give the second mistress the plum.\" Those who ate the *linqin* recovered, while the one who ate the plum died.\n\nCai once sought consecrated water from the Master to cure Zhang’s illness. After drinking it, she recovered, and Cai offered gold and silk in gratitude. The Master refused, saying, \"I require you to undertake a great act of karmic merit.\" When pressed further, he replied, \"It will come in time.\" During the Chongning era, Cai brought his family to visit the Master. The Master led them to the mural of the *Scripture of Salvation*, where they beheld the transformed visages. He also inscribed on Cai’s body the four characters *\"Shenjing Taiyin.\"* Several days later, Cai fell ill, and when he asked the Master about it, the Master said, \"Performing meritorious deeds will avert harm.\" At that time, the Jade Emperor Pavilion was being rebuilt, so Cai pledged to raise funds from ten thousand patrons to commission statues of the Jade Emperor and the Thirty-Two Heavens. Once Cai recovered, he returned to Qiantang, where he raised funds to carve wooden statues, along with attendant figures, ritual vessels, flowers, and fruits for offering. Later, he lived seventeen more years.\n\nCai’s son-in-law, Tian You, visited the Master on account of his mother’s illness. The Master wrote the characters for *\"mountains, rivers, forests, and trees,\"* and Tian’s mother passed away. In the third year of the Yuanfu era, Quan Yanbo traveled to take the autumn examinations. Three days before the results were posted, the Master sent his disciple Zhou Xiyuan to Quan’s home with a message: \"The Divine Master sends word of your success.\" Quan asked if there were any other instructions. Xiyuan replied, \"When the Master spoke to me, he only raised his thumb.\" When the results were announced, Quan was selected as the top candidate.\n\nXie Gongju of Chengdu, a merchant, arrived in Zhenzhou during the Yuanfu era. He had sold all his goods except for a few solitary wooden boats. Unable to find buyers, he encountered an old man who said, \"Why not go to Hailing and seek out Xie Xun? The salt fields there require such boats.\" He went to Hailing and sold them. Upon meeting the Master, he realized it was the old man he had seen earlier.\n\nWu Jiacheng, the magistrate of Taixing, visited the Master, who immediately concealed himself. Wu withdrew and ascended the Hall of the Three Clarities. The Master emerged and called to his attendant, saying, \"Why has that official not departed?\" The attendant replied, \"He has not yet taken leave of the prefectural authorities.\" The Master said, \"He cannot leave today, nor can he leave tomorrow.\" The next day, Wu suddenly developed a debilitating foot ailment.\n\nWhen the high official Qi Zhan met the Master, the Master asked, \"How old are you?\" Qi replied, \"Sixty-five.\" The Master said, \"In five more years, you will be seventy.\" Qi died at seventy.",
      "overlap_context": " there is a passage: 'The heart is reported to the thirty-two heavens; thirty-two bows are made; the eyes are closed in silent contemplation.' The Master concealed the secret of *Tianxin* within these three sentences: the three characters refer to the *Tianxin* secret method, and *bi* means 'secret.'\"\n\nDuring the Yuanfu era, Cai Chengyi Si served as the registrar of Liuhe. When he observed mourning for his mother and met the Master, the Master asked, \"Where do you reside?\" Cai replied, \"Yizhen.\"",
      "start_char": 14485,
      "end_char": 15106,
      "start_sentence": 817,
      "end_sentence": 852,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.297074794769287,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\虚静冲和先生徐神翁语录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "忠节将校濮真，中风不能行，乘卧轿见公，且策杖令数妇人掖至堂上。 公一见大怒，云：养兵千日，尔病如此，将何用？ 以杖击退扶掖者，又以杖击真。 真走避，不觉奔杖，遂行如故。 淮东张干楚执规见公，公遽曰：尊文朝议已得，利州差遣也。 已而见报，除利州路提刑。 葛光感疾未汗，令人祈於公，公书帝元育斋四字与之。 经有帝元育齐京之语，光即诣观修斋。 翊日中，汗而愈。 光未有子，问公云：监生大神像坏，光欲改塑，不知仪容如何？ 公曰：作后生端严相。 光受教，次年得子，如所塑状。 后又得二子，皆端严。 祝昭彦忧居铅山，邑宰请主学。 因人至海陵求字，公书二十四二十四，凡六字与之。 学之生徒适二十四人，后增三数人，颇疑不验。 已而有去者，率不过二十四人，特未晓迭书之意。 乡老云：前此一官人持服来此主学，亦未尝过二十四人。 有董庆者，元符间自谋於天庆出家，为众涤掴，未能勇次。 一日见公，公方饭，即握其手，携饭盂直抵溷舍。 公自取筹百十枚，汲水以濯，且擢且饭。 庆感悟，乃作礼曰：愿躬此役。 自此留观中，终始不懈。 元符三年冬，有街坊道士自淮西归，忽发狂。 大寒中单衣持篇，语言异常。 或呻吟如被考掠，自言所造愆恶。 又持箱筐至公堂上，以其所藏物列布座前，叩头祈哀。 公以拳击其心数下，忽仆地流汗如雨，始醒。 金坛崇真观道士明素大师史怀胜，尝与一李道士，同事神公为街坊。 李尝匿钱於履中，以试公。 怀胜曰：不可。 既同见公，公发其隐，由是公有点化怀胜之意。 公羽化后，怀胜居崇真观，能预言人休咎甚验，作诗颂甚敏。 绍兴丁卯，年八十七而终。 岁余，有赵德明在常州遇之如平生，后乃知其卒已久矣。 元符中，哲庙以圣嗣未立，遣中使资香问公，公书吉人二字以对。 中使私谓，吉字十一口也。 已而徽庙即位，盖祈御名也。 王谌元符三年赴南官试，其妻见公。 公曰：且喜王岘。 一子了当，是年登第。 王待制古为运使日见公，公书行字，笑曰：此字内好使个鱼字，但恐未得他底。 其后知衡州。 又尝得五年字，移帅广东。",
      "translated_text": "The loyal and steadfast military officer Pu Zhen, afflicted by wind-stroke and unable to walk, was carried in a reclining sedan to meet the Master, leaning on a staff and supported by several women to reach the hall. At first sight, the Master grew furious, saying, \"You have been nourished for a thousand days as a soldier—with such infirmity, what use are you?\" He struck with his staff at those supporting Pu, then struck Pu himself. Pu fled to avoid the blows, and in his haste, found himself running as if fully recovered.\n\nZhang Ganchu of Huaidong, bearing a compass to meet the Master, was promptly told, \"Your esteemed father, the Court Gentleman for Consultation, has already secured an appointment—you are to be dispatched to Lizhou.\" Later, it was reported that he had indeed been assigned as the Investigating Censor of the Lizhou Circuit.\n\nGe Guang, suffering from an illness without sweating, sent someone to pray to the Master, who wrote the four characters *Di Yuan Yu Zhai* and gave them to him. As there was a passage mentioning *Di Yuan Yu* in the *Qi Jing*, Ge immediately went to the abbey to perform a purification ritual. By midday the next day, he had broken into a sweat and recovered.\n\nGe, having no sons, asked the Master, \"The guardian spirit’s statue in the supervising student’s hall has been damaged. I wish to have it recast—what should its appearance be?\" The Master said, \"Make it a dignified and solemn countenance of a young man.\" Ge followed his instruction, and the following year, he had a son who resembled the statue. Later, he had two more sons, both dignified and solemn.\n\nZhu Zhaoyan, mourning in Qianshan, was invited by the county magistrate to oversee the local academy. He sent someone to Hailing to request a written charm from the Master, who wrote *twenty-four, twenty-four*—six characters in all. At the time, the academy had exactly twenty-four students. When the number later increased by a few, Zhu grew doubtful of the charm’s efficacy. Yet soon, some students left, and the number never exceeded twenty-four—though he never understood the repeated inscription’s meaning. An elder of the village remarked, \"Previously, an official in mourning came here to oversee the academy, and the number of students never exceeded twenty-four either.\"\n\nThere was a certain Dong Qing who, during the Yuanyou era, had sought ordination at Tianqing Abbey but was bullied by the community and lacked the courage to proceed. One day, upon meeting the Master, who was then eating, the Master grasped his hand, carried his rice bowl, and led him straight to the latrine. The Master himself took over a hundred bamboo slips, drew water to wash them, and while cleaning, also fed Dong. Moved and enlightened, Dong bowed and said, \"I wish to perform this task myself.\" From then on, he remained at the abbey, diligent to the end.\n\nIn the winter of the third year of Yuanyou, a street Daoist from Huaixi returned and suddenly went mad. In the bitter cold, he wore only a single layer of clothing, clutching a scroll, speaking incoherently. At times, he groaned as if being tortured, confessing his transgressions. He also carried a box and basket to the Master’s hall, spreading out their contents before him and kowtowing in supplication. The Master struck his chest several times with his fist, and the man suddenly collapsed, drenched in sweat like rain, before regaining his senses.\n\nThe Venerable Master Shi Huaisheng of Chongzhen Abbey in Jintan, a Daoist of high attainment, had once served alongside a Daoist named Li under Master Shen as a street attendant. Li had once hidden money in his shoe to test the Master. Huaisheng said, \"This is not right.\" When they both met the Master, he exposed Li’s deception, and from then on, the Master harbored the intention to spiritually transform Huaisheng. After the Master’s ascension, Huaisheng resided at Chongzhen Abbey, where he could foretell people’s fortunes with great accuracy and composed poems and hymns with remarkable fluency. In the *dingmao* year of Shaoxing, he passed away at the age of eighty-seven. Over a year later, Zhao Deming encountered him in Changzhou as if he were still alive, only to later learn that he had long since departed.\n\nDuring the Yuanyou era, as the late Emperor had no heir, he dispatched an imperial envoy bearing incense to consult the Master, who wrote the two characters *Ji Ren* in response. The envoy privately remarked, \"The character *ji* consists of eleven strokes.\" Later, Emperor Huizong ascended the throne—it had been an auspicious omen for his imperial name.\n\nWang Chen, in the third year of Yuanyou, was to take the southern official examination, and his wife went to see the Master. The Master said, \"Rejoice! Wang Xian—one son will suffice.\" That year, he passed the examination.\n\nWhen Attendant Gentleman Wang Gu served as Transport Commissioner and met the Master, the Master wrote the character *xing* (行) and smiled, saying, \"This character would be better with a *yu* (鱼) inside, but I fear you won’t get what you seek.\" Later, he was appointed Prefect of Hengzhou. He also once received the characters *five years*, and was subsequently transferred to command the forces in Guangdong.",
      "overlap_context": "e Master emerged and called to his attendant, saying, \"Why has that official not departed?\" The attendant replied, \"He has not yet taken leave of the prefectural authorities.\" The Master said, \"He cannot leave today, nor can he leave tomorrow.\" The next day, Wu suddenly developed a debilitating foot ailment.\n\nWhen the high official Qi Zhan met the Master, the Master asked, \"How old are you?\" Qi replied, \"Sixty-five.\" The Master said, \"In five more years, you will be seventy.\" Qi died at seventy.",
      "start_char": 15107,
      "end_char": 15933,
      "start_sentence": 853,
      "end_sentence": 896,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.245486974716187,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\虚静冲和先生徐神翁语录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "吕金部和卿，元符初自维扬来见公，公一见，杜门不出。 吕连日作斋醮，至第七会，公忽出云：谢金部作缘事，可速归来，早到家即贺喜。 吕以郡官留食，次日晚行至扬州，则其家正罹回禄，救之不及。 和州朱霶泽民，元符初问科举，公不答。 再叩之，公云：秀才自写得，不须讨字。 固问之，公笑曰：交休不肯休，直待雨淋头。 后霍仁仲榜登科。 泽民尝携吕真人等三画像见公。 初展吕公像，问：曾来否？ 云：曾来。 问：如何待之？ 云：以山东客待之。 展蒋仙姑像问之，亦曰：曾来，但差肥耳。 如何待之？ 云：以庸妇待之。 展申先生像，问之如前，公云：曾来，以常人待之。 三人孰优？ 云吕公且得。 楚州盐城时襄，元符中见公，公云：尔速归，九月间有道者来，尔善待之，仍须布施。 襄归，至九月中旬夜烧香，闻户外有人，乃群盗也。 襄悟，开户迎之，列酒肴罗金帛遗之。 家人悉免惊怖。 襄得公咒水二瓶，公指示曰：此一瓶与家人时时饮之。 此一瓶候村中疫疾时施之。 襄如公言，留其一，凡三年封缄如故。 忽大疫，襄取水施疫者，新香异常，饮者皆愈。 水尽，瓶中有鼠骨一副，其白如雪，不知所从来也。 元符三年秋，道士许若谷、徐若虚等数人，从公行殿庑间。 公忽谓许曰：尔不可压徐师。 许皇恐而避，时许为道监，徐在众列。 至政和问，徐被命为右街都监，而许为道正。 宣和初，许授金坛郎，而徐除凝神殿授经签书左街道录院事，再迁凝神殿校籍。 蔡相元符末，落端明龙图学士提举洞霄宫，来见公。 方至观门，公即出迎。 蔡求字，公书齐到帝前，而帝字直下一画分二脚。 又尝遣人语之曰：东西二府枢密相公。 至祟宁初，与元度俱被召，已而拜相，而元度除枢密。 又尝得三十二天字，后除丞旨，迁左辖，拜右相，皆十二日也。 元度尝得仙道贵生字，又尝得昭相字，又得庆相字，后拜昭庆军节度使开府。 御史中丞安惇，初有长沙之命，来见公。 公但问：请俸几何？ 安不晓，公徐言曰：不到长沙。 未几，果召还。 又尝密叩所疑，公曰：速往见蔡家兄弟。 时二公方去朝廷，疑为戏语。 俄二公召还长二府，安亦继召为执政。 道士徐希纯、黄若厚，元符中未披度。 公一日各以令纸折而与之，开视各得陈字。 崇宁改元，郡守陈了翁访公，询左右有何久侍公者。 主首以徐黄二人对，陈曰：此观兴修皆神公之力，二弟子何不与披度？ 遂令常住进纳披戴。 葆光法师全若水，元符间为天庆观道籍，夙有符箓之心，公常以法师呼之。 乙酉岁问公，欲退道籍职。 公曰：好法师。 全过潜山，以符水救人，监司以名闻。 后趋阙，赐号葆光法师。 蔡相尝拥家见公，公指徐夫人曰：夫人倒地也，扶起夫人。 众不晓，至钱塘，徐以疾不起。 又尝得军字，除郓州。 得坤字，除成都。 得北字？ 除内翰。 成都坤维之地，内翰北门学士也。 元符三年上元张灯前二日，公以杖尽击毁之。 数日，哲庙遗诏至。 建州举子朱刘二人赴南宫，公各书一吉字与之。 比至都下，朱以疾卒，刘登第。 盖刘所得从士下口，朱所得者从土下口，而墨色晦。 姑苏举子吴经赴省试，公书云：七十三。 逮放膀，第七十三名。 虚静冲和先生徐神翁语录卷下竟",
      "translated_text": "Lü Heqing of the Ministry of Revenue, in the early years of Yuanfu, came from Weiyang to see the Master. Upon their first meeting, the Master shut his door and refused to emerge. Lü held continuous ritual feasts, and by the seventh session, the Master suddenly appeared, saying, \"Thank you, Minister Lü, for your meritorious work—return home at once, and if you arrive early, there will be cause for celebration.\" Lü was detained for a meal by the local officials, and by the next evening, as he traveled to Yangzhou, his home had just suffered a conflagration, the flames beyond control. Had he not returned, his family would have perished.\n\nZhu Pang of Hezhou, a candidate for the imperial examinations, inquired of the Master in the early Yuanfu era. The Master did not respond. When Zhu pressed further, the Master said, \"A scholar should write for himself—no need to ask for a character.\" Persisting, Zhu received this reply with a smile: \"Reluctant to cease, you’ll wait until the rain soaks your head.\" Later, under the Huo Renzhong examination roster, Zhu passed.\n\nZhu Pang once brought three portraits—those of Lü the Perfected, Immortal Jiang, and Master Shen—to show the Master. Unrolling Lü’s portrait first, the Master asked, \"Has he come before?\" Zhu replied, \"He has.\" \"How was he received?\" \"As a guest from Shandong.\" Unrolling Immortal Jiang’s portrait, the Master asked the same. Zhu said, \"She has come, though somewhat plump.\" \"How was she received?\" \"As an ordinary woman.\" Unrolling Master Shen’s portrait, the Master again asked, and Zhu answered as before. The Master said, \"He has come, and was treated as an ordinary man.\" \"Among the three, who is superior?\" \"Lü the Perfected is somewhat better.\"\n\nShi Xiang of Yancheng in Chuzhou met the Master during the Yuanfu era. The Master said, \"Return home quickly. In the ninth month, a Daoist will arrive—treat him well and make offerings.\" Shi returned home, and by mid-ninth month, while burning incense at night, he heard voices outside his door. It was a band of thieves. Realizing the Master’s words, he opened the door to welcome them, setting out wine, delicacies, gold, and silk to gift them. His household was spared from terror.\n\nShi had received two bottles of consecrated water from the Master. Pointing to them, the Master instructed, \"Give one to your family to drink regularly. Keep the other until an epidemic strikes the village, then distribute it.\" Shi followed the Master’s words, storing one bottle for three years—still sealed as before. Suddenly, a great plague erupted. Shi took the water to aid the afflicted; its fragrance was extraordinary, and all who drank were cured. When the water was exhausted, a set of mouse bones, white as snow, remained in the bottle—no one knew their origin.\n\nIn the autumn of the third Yuanfu year, Daoists Xu Ruogu and Xu Ruoxu, among others, accompanied the Master through the palace corridors. The Master suddenly said to Xu Ruogu, \"You must not suppress Master Xu.\" Xu, alarmed, stepped aside. At the time, Xu Ruogu was a monastic supervisor, while Xu Ruoxu stood among the assembly. By the Zhenghe era, Xu Ruoxu was appointed Right Street Supervisor, and Xu Ruogu became a Daoist Rectifier. In the early Xuanhe era, Xu Ruogu was granted the title of Gold Altar Gentleman, while Xu Ruoxu was appointed to the Hall of Serene Contemplation as Scripture Reciter and Left Street Registrar, later promoted to Collator of the Hall of Serene Contemplation.\n\nAt the end of the Yuanfu era, Minister Cai, stripped of his titles as *Duanming* Academician and *Longtu* Scholar, and appointed Supervisor of the Dongxiao Palace, came to see the Master. As he reached the temple gate, the Master came out to greet him. Cai requested a written character, and the Master wrote: \"All arrive before the Emperor,\" with the character *di* (帝) having one stroke branching into two legs below. Another time, the Master sent word: \"The two administrations—east and west—and the Minister of Military Affairs.\" By the early Chongning era, both Cai and Yuandu were summoned. Cai was soon appointed Chancellor, while Yuandu became Minister of Military Affairs.\n\nThe Master once gave Cai the characters *thirty-two heavens*. Later, Cai was appointed Vice Director of the Chancellery, promoted to Left Assistant Director, and then Right Chancellor—each appointment lasting twelve days. Yuandu once received the characters *immortal Dao, noble life*, then *illustrious minister*, and later *auspicious minister*. He was subsequently appointed Military Commissioner of the Zhaojun Prefecture and Grand Preceptor.\n\nAn Dun, the Censor-in-Chief, was initially appointed to Changsha. He came to see the Master, who only asked, \"How much is your salary?\" An did not understand. The Master slowly said, \"You will not go to Changsha.\" Soon after, An was recalled to the capital. Another time, An secretly sought the Master’s counsel on a matter. The Master said, \"Hasten to see the Cai brothers.\" At the time, the two ministers had just left the court, and An suspected the Master was jesting. Shortly after, the two were recalled to the two administrations, and An was soon appointed to the executive council.\n\nDaoists Xu Xichun and Huang Ruohou had not yet taken monastic vows during the Yuanfu era. One day, the Master gave each a folded sheet of official paper. Upon opening them, both found the character *Chen*. In the first year of Chongning, Prefect Chen Liaoweng visited the Master and inquired of his attendants who had served the Master longest. The temple head named Xu and Huang. Chen said, \"This temple’s restoration is entirely due to the Master’s divine power—why not grant these two disciples the tonsure?\" He then ordered them to reside permanently and complete the ordination rites.\n\nMaster Quanzhi, the Radiant Guardian, was a Daoist register at the Tianqing Temple during the Yuanfu era. Long devoted to talismanic arts, the Master always addressed him as \"Master.\" In the *yiyou* year, Quanzhi asked the Master about resigning his temple post. The Master said, \"A fine Master.\" Quanzhi later traveled to Qianshan, using talismanic water to heal people. The provincial authorities reported his deeds to the court. He then hastened to the capital and was granted the title Radiant Guardian Master.\n\nMinister Cai once brought his family to see the Master. Pointing to Lady Xu, the Master said, \"The lady has fallen—help her up.\" No one understood. Upon reaching Qiantang, Lady Xu fell ill and did not recover. The Master once gave Cai the character *army*, and he was appointed to Yunzhou. He received the character *kun*, and was appointed to Chengdu. The character *north*? He was appointed Hanlin Academician. Chengdu is the *kun* direction, and the Hanlin Academy is the northern gate of learning.\n\nTwo days before the Lantern Festival of the third Yuanfu year, the Master struck and destroyed all the lanterns with his staff. Days later, Emperor Zhezong’s posthumous edict arrived.\n\nTwo candidates from Jianzhou, Zhu and Liu, were heading to the southern examinations. The Master wrote the character *auspicious* for each. When they reached the capital, Zhu fell ill and died, while Liu passed. Liu’s character had the *mouth* radical beneath *scholar*, while Zhu’s had it beneath *earth*—and the ink was dull.\n\nWu Jing, a candidate from Gusu, was taking the provincial examination. The Master wrote: \"Seventy-three.\" When the results were announced, Wu ranked seventy-third.\n\n*Record of Master Xu, the Void and Serene Master, concluded.*",
      "overlap_context": "er said, \"Rejoice! Wang Xian—one son will suffice.\" That year, he passed the examination.\n\nWhen Attendant Gentleman Wang Gu served as Transport Commissioner and met the Master, the Master wrote the character *xing* (行) and smiled, saying, \"This character would be better with a *yu* (鱼) inside, but I fear you won’t get what you seek.\" Later, he was appointed Prefect of Hengzhou. He also once received the characters *five years*, and was subsequently transferred to command the forces in Guangdong.",
      "start_char": 15934,
      "end_char": 17184,
      "start_sentence": 897,
      "end_sentence": 967,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.65019869804382,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\虚静冲和先生徐神翁语录.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}