{
  "source_id": "西游录注",
  "source_file": "chunked_daozang\\西游录注.json",
  "total_chunks": 17,
  "total_original_chars": 9913,
  "total_translated_chars": 49838,
  "total_translation_time": 283.37246108055115,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\西游录注.txt",
    "category": "藏外"
  },
  "full_translation": "Here follows the translation:\n\nThe *Annotated Record of Western Travels* (Xiyou Lu Zhu), compiled by Yelü Chucai of the Yuan dynasty and annotated by Li Wentian of the Qing, states: At the beginning of the dynasty, the Grand Chancellor accompanied the western campaign, journeying fifty or sixty thousand *li*, and remained in the Western Regions for six or seven years. His *Record of Western Travels* recounts these events, a text rarely seen, and thus an abridgment is provided here.\n\nIn the spring of the *wuyin* year, the thirteenth year of the Great Ancestor of the Yuan, the Grand Chancellor set out from Yunzhong. The *Collection of the Serene Layman* contains a poem titled *\"Passing Yunzhong: A Gift to Minister Li.\"* Arriving at the Tianshan Mountains, the *Book of Han: Treatise on the Western Regions* records: \"The King of the Biluo state rules from Qiandang, east of the Tianshan.\" Jin Zhuo’s annotation to the *\"Annals of Emperor Wu\"* states: \"The Tianshan lies near the Pulei state, over eight thousand *li* from Chang’an.\" Yan Shigu comments: \"The Tianshan is the Qilian Mountains.\" The astronomer Qi Yunshi, in his *Essentials of the Western Frontier*, writes: \"The mountains of Hami are the Tianshan. Three hundred *li* north of the mountains lies Barkol. The Liugu River lies northeast of the city, its source in the Tianshan, and its waters are used to irrigate the fields.\" Crossing the great desert...\n\nThe *Northern Frontier Prepared Responses* by Song scholar Cheng Dachang states: \"The Great Desert refers to the vast expanse of shifting sands, appearing boundless and desolate. Later historians of the Han dynasty altered the term to *qi* (碛). *Qi* denotes accumulated sand—its meaning remains the same.\" The *Great Tang Records on the Western Regions* notes: \"Six hundred *li* west of Qiuci lies a small *qi*, beyond which lies the state of Balūka.\" Crossing the desert, Qi Yunshi’s *Record of a Ten-Thousand-*Li* Journey* recounts: \"Anxi Prefecture, formerly called Great Bay, was later reestablished as Anxi Prefecture and now renamed a prefectural state. Five *li* beyond its northern gate, one crosses a dry riverbed and enters the sandy wastes. The locals call it *Gobi*, the ancient *Han Sea*. The land is composed of sand and stone as if forged into skin by smelting.\"\n\nArriving at the imperial encampment—here referring to the Yuan Taizu’s traveling court at Kharakhorum, as described in Qiu Chuji’s *Record of a Western Journey*: \"the emperor’s former *wuli duo*.\" The *Record of a Western Journey* states: \"On the twenty-eighth day of the sixth lunar month in the *xinsi* year, we moored at *Woli Duo*, the Chinese term for a traveling palace.\" It was also called *Naiman Guoli Duo*, for after Taizu conquered the Naiman, he established his encampment here to facilitate western campaigns. The following year—the *jimao* year—marked the fourteenth year of Yuan Taizu’s reign. A grand western expedition was launched, passing through the Altay Mountains. Cheng Dachang’s *Northern Frontier Prepared Responses* records: \"During the Sui and Tang dynasties, the Ashina Turks of the Göktürks occupied the northern lands of the ancient Xiongnu and dwelled on the southern slopes of the Altay Mountains.\" According to the *Collected Works of Master Zhanran*, Volume One contains the poem *\"Passing the Altay Mountains in the Style of Another’s Rhyme.\"* The *Geographical Explanation of the Western Regions* states: \"The Bogda Mountains of Urumqi rise in three peaks, soaring into the clouds. Midway up the slopes lies a pool, over ten *li* in circumference, called *Haizi* by the locals. To the south of the mountains are the so-called Seven *Daban*, which correspond to this location.\" As noted in the *Old唐书*: \"From Jiaohe County in Xizhou, traveling north through Liugu Valley, crossing Jinsha Ridge, one reaches the city of the Beiting Protectorate.\" Further, Du Fu’s poetic annotations record: \"From Jiaohe, traveling eighty *li* north to Longquan Inn, then entering the valley for one hundred thirty *li*, passing through Liugu Valley, crossing Taisha Ridge, and after one hundred sixty *li*, passing the Han garrison at Shihui, one arrives at the Beiting Protectorate.\" Today, Urumqi is the former seat of the Tang Beiting Protectorate, and Turpan the ancient seat of Xizhou. By comparing the distances between them, this *Daban* is the so-called Jinsha Ridge. Near the ridge lies a slope where the sand is fine and loose, causing horses’ hooves to slip—hence the names *Jinsha* (\"Golden Sand\") and *Taisha* (\"Platform Sand\"). The *Imperial Western Regions Atlas* states: \"The present-day Altan corresponds to the ancient Altay Mountains. The *Old唐书* records that the Ashina Turks dwelled on the southern slopes of the Altay, and Pei Luo crossed west beyond the Altay—this confirms it.\" At that time, it was midsummer, yet snow congealed and ice accumulated, requiring the cutting of ice to forge a path.\n\nAmidst towering pines and cypresses, flowers and grasses fill the valleys. West of the Altay Mountains, all waters flow westward into the sea. As Liu Qi’s *Record of a Northern Mission* states: \"Leaving the northern frontier and traveling northwest, the land gradually rises, bordering the Xia state. For the first seven or eight thousand *li*, east of the mountains, all waters flow east; west of the mountains, all waters flow west, as the land gradually descends.\"\n\nQi Yunshi’s *Essentials of the Western Frontier* notes: \"The rivers of Xinjiang diverge in their courses. Those of the southern route all flow east, originating from the southern and northern mountains—such as the Ulan Usu of Kashgar, the Jade River of Yarkand, the Karakash and Yurungkash of Khotan, the Hushqi of Ush, the Hunbash of Aksu, the Weigan of Kuqa, and the Kaidu of Karashahr—all converging eastward in Lop Nur of Turpan. All meltwater from the snows of the southern and northern mountains flows into it. Accumulating and pooling underground, it forms the ancient Puchang Sea.\n\nThe waters of the northern route, such as the various rivers of Ili, mostly flow west; those of the Irtysh in Tacheng mostly flow east; the Manas River of Urumqi mostly flows north. Some empty into lakes, some traverse reed marshes, some vanish into the sands, and many are fed by converging meltwater.\"\n\nTo its south lies the Uighur city.\n\nFrom the *Supplementary Records of the Western Regions in the Yuan History*: \"The land of the Uighurs. In the twentieth year of the Zhiyuan era, four postal stations and a paper-currency treasury were established in Uighur territory.\"\n\nFrom the *Ming Shifa Lu*: \"Huozhou, known in the Yuan as Uighur. Seventy *li* to the east lies Liuchen City, and one hundred *li* to its west lies Turpan, which was the seat of the ancient Kingdom of Gaochang.\"\n\nAccording to the *Liao History: Military Defense Records*: \"Among the subject states’ armies were the Uighurs, the Ganzhou Uighurs, the Shazhou Uighurs, and the Hezhou Uighurs.\" This refers to the city of the Hezhou Uighurs.\n\nHong Hao’s *Records of Songmo* states: \"The Uighurs of Ganzhou, Liangzhou, Guazhou, and Shazhou all once had tribal encampments. Only those dwelling beyond the four commanderies established their own states, each with its own ruler.\" Another name for this place is *Shiba*.\n\nThe *Record of a Western Mission* states: \"Proceeding northwest along the Longgu River, one reaches Bieshibali to the south after nearly five hundred *li*.\"\n\nFrom the *Supplementary Records of the Western Regions in the Yuan History*: \"Bieshibali. In the fifteenth year of the Zhiyuan era, Basachali was granted a tiger tally to oversee the postal and military stations of the Uighur city of Bieshibali. In the seventeenth year, the garrison commander Qi Gongzhi was stationed there. In the eighteenth year, at the request of Prince Ajiji, thirty new stations were established from Taihe Ridge to Bieshibali. In the twentieth year, the Pacification Commission of Bieshibali, Hezhou, and other regions was established. In the twenty-third year, one thousand newly surrendered imperial guardsmen were sent to garrison and cultivate Bieshibali, where a marshal’s headquarters was established.\"\n\nThe *Ming History: Western Regions Annals* states: \"Bieshibali was a great state of the Western Regions. To its south lay Khotan, to its west Samarkand, to its east Huozhou, and to its north the Oirats. During the Yuan, the emperor considered establishing a pacification commission there.\"\n\nThe *Record of Western Travels* refers to it as \"Biesimada City.\"\n\nOuyang Xuan’s *Genealogy of the Gao Clan of Gaochang* states: \"Beiting is today’s Bieshibali City.\"\n\nA Tang stele remains there. The *Record of Western Travels* states: \"The Duan Prefecture of Beiting. In the third year of the Jinglong era, Yang He, the Grand Protector, governed with virtue, and two stone inscriptions from the Longxing West Temple remain, their merit and virtue still radiant. The temple houses a collection of Buddhist scriptures, and many frontier cities of the Tang still endure.\"\n\nFrom the *Huai Xi Miscellany*: \"Tenage’er was the Tang’s Jinman County, where fragments of a stele still stand.\"\n\nThe *Western Regions: A Topographical Account* states: \"Dinggu Mountain in Kuqa lies north of the city. An ancient temple stands there, with many Tang steles, and a pagoda towering several dozen *zhang* in height.\"\n\nThe *Records of the Waterways of the Western Regions* states: \"The four sources of Barkol Lake: the southeastern source is called Zhaomoduo Sha Wulumuqi, and its administrative seat is Gongning City. To the city’s south lies the Alagui Mountains, and to its east the Bogda Mountains. North of the mountains lies Fukang County. Traveling east along the mountains for one hundred ninety *li*, one reaches the Tang’s Shapozhen, the Mohe City where Ashina Helu resided. Fifty *li* farther east lies Jimusa, the pagoda city of the Western Turk Khaganate, which in the Tang was Jinman County of Tingzhou, later renamed Houting County—the seat of the Beiting Protectorate. The Yuan established the Beiting Marshal Headquarters in Bieshibali, also governing from this site. The old city lies over twenty *li* north of today’s Baohui City, in a place called Hubaozi. The ruined city contains a fragmentary stele of the Tang’s Jinman County, the stone split in two, each piece eight *cun* tall and six *cun* wide—one with seven lines of text, the other with six.\"\n\nThis is the so-called Hanhai Army.\n\nIn Liu Yu’s *Record of the Western Mission* from the Yuan, it is written: “The land of the Hanhai is exceedingly cold and high; even in the height of summer, the snow does not melt.” What is now called the Hanhai was in ancient times Mount Jinshan. The *Treatise on Geography* in the *Old Book of Tang* states: “The Beiting Grand Protectorate was originally Tingzhou. In the fourteenth year of the Zhenguan era, Gaochang was pacified. The Hanhai Army was established, and in the second year of the Chang’an era, it was formally established.” The Hanhai lies several hundred *li* from the city. The *Exegesis of Western Regions’ Geography* says: “From Hami east to Anxi Prefecture and west to Turpan, there are several hundred *li* of sandy wastes, devoid of water and grass, barren lands—these are called the Hanhai, now known as the Gobi.” Within this sea are islets, upon which lie the molted feathers of birds that alight there.\n\nThe *Records of the Grand Historian: Account of the Xiongnu* states: “General Huo Qubing was enfeoffed at Mount Langjuxu, performed the *chan* rites at Guyuan, and returned after reaching the Hanhai.” Ru Chun notes: “The Hanhai is the name of the Northern Sea.” Zhang Shoujie’s *Correct Meanings* says: “According to records, the Hanhai is the name of a great sea, where flocks of birds shed their feathers and nest upon the stones, hence its name.” Li Guangting’s *Illustrated Survey of the Western Regions* remarks: “According to Yelü Chucai’s *Record of the Western Journey*: ‘In the year *wuchen*, we reached the imperial encampment and arrived at what was Tang’s Gaochang,’ and so on—this identifies present-day Jimusa as the Hanhai, which differs from Liu Yu’s *Record of the Western Mission*. Moreover, his reference to Pulei Sea is also imprecise.”\n\nThe *Exegesis of Western Regions’ Geography* states: “Balikun is called Huining City. There is a lake there, the ancient Pulei Sea, also called Posihai, commonly known as the Haizi. It lies north of the city beneath the sandy mountains. It stretches over a hundred *li* from east to west, and its opposite shore spans several tens of *li*.” The *Book of Later Han* records Zhang Dang’s account of the Huyan King, who frequently moved between Pulei and Qinhai. The *Yuanhe Era Geography* notes that north of Nazhi County in Yizhou, one reaches Pulei Sea. Tang’s Yizhou is today’s Hami, which lies near Balikun, and Balikun was also the territory of the Han-era Pulei Kingdom. Thus, this lake is undoubtedly the Pulei Sea.\n\nTwo hundred *li* west of the city lies Luntai County.\n\nThe *New Tang History: Treatise on Geography* records: “From Yancheng in Tingzhou west to Luntai County is a total of three hundred and twenty *li*.” The *Record of Western Travels* states: “In the great city of Biesima, several hundred *li* to its east lies a prefecture called Xiliang. Over three hundred *li* to its west lies a county called Luntai.” The Master inquired, “How many stages must one travel to reach the imperial encampment?” All replied, “Proceeding southwest for over ten thousand *li*, one arrives.” A Tang stele stands there. The *Records of Western Regions’ Waterways* also discusses this.\n\nFive hundred *li* south of the city lies Hezhou. The *History of Yuan: Biography of Yelü Xiliang* states: “From Ku’er, one reaches Hala Huozhou.” The *History of Yuan: Appendix on Northwestern Lands* records “Hela Huo” under “Alimali.” This is Tang’s Gaochang. The *History of Liao: Treatise on Military Guards* notes: “The subject-state army includes Gaochang.” The *History of Ming* records: “Huozhou’s terrain is mountainous, its rocks crimson as fire, hence its name. East of Huozhou lies a ruined city, the former capital of the Gaochang Kingdom, where the Han-era Wuji Colonel was stationed. To its northwest lies Beshbaliq, later annexed by Turpan.” It is also called Yizhou. The *Collection of Master Zhanran: Twelve Nostalgic Poems* contains the line: “Crossing the Gobi west of Yizhou.” The annotation explains: “Northwest of Yizhou lies the Gobi; Yizhou is also called Xizhou.” The *Western Regions’ Exegesis of Geography* states: “The *Yuanhe Era Geography* records that north of Nazhi County in Yizhou, one reaches Pulei Sea. Tang’s Yizhou is today’s Hami.”\n\nThree to four thousand *li* west of Gaochang lies Wuduan City, which was Tang’s Yutian Kingdom. The *History of Yuan: Appendix on Northwestern Lands* renders it as “Hutan,” while the *Biography of Hesimaile* and the *Biography of Bayan Badulu* both write it as “Woduan.” The *Annals of Emperor Xianzong* records it as “Kuoduan”—all phonetic variations of the characters for “Wuduan.” Today it is called “Hotan.” The *History of Ming* writes it as “Aduan” and also retains the ancient name “Yutian,” though these are not two separate places. The *Western Regions’ Exegesis of Geography* explains: “Yarkand was the land of the Han-era Shache Kingdom. After the Tang, it was incorporated into Yutian, also called Hotan. The Han-era Yutian Kingdom was where the Tang established the Yutian Protectorate. The Uyghurs call the Han people ‘Heitai,’ and Hotan is a corruption of ‘Heitai.’ Legend holds that the Han general Ren Shang abandoned his troops there.”\n\nThe river yields black-and-white jade.\n\nThe *Essentials of the Western Frontier* states: \"In the mountains of Yarkand, there is the Mierdi Mountain, over two hundred *li* south of the city, which produces jade. There is the Ma’erhuluke Mountain, over four hundred *li* southwest of the city, which also produces jade. Another great mountain lies southwest of Yarkand, connected to Mierdi Mountain. The Uyghurs call it Tashidabahan—likely the so-called Congling. The waters include the Jade River, which flows from Mierdi Mountain and branches southward into Hotan. Within Hotan’s borders, a range of snow-capped mountains gives rise to the Karakash River, the Yulongkash River, and the Halangguitake River, all rich in jade and vital for irrigation.\"\n\nBeyond the Gobi Desert for over a thousand *li* lies the city of Bula. The *Supplementary Records of the Northwest* renders it as \"Pula.\" The *Biography of Yelü Xiliang* states: \"They arrived at Bula City.\" Li Guangting’s *Illustrated Survey of the Western Regions* notes: \"Bula City is a phonetic evolution of ‘Bolao City’ from the *Record of a Western Envoy*. South of the city lies the Yin Mountains, also called the Pine Tree Ridge. The mountaintop holds a lake. Today’s Sailimu Lake lies amid four mountains—this is the lake.\"\n\nSouth of Bula stretch the Yin Mountains, a thousand *li* east to west and two hundred *li* north to south. The *Record of a Western Journey* recounts: \"At first, north of the Shatuo, we gazed southward at the horizon, where it appeared like silver mist. Asking those beside me, none knew. The master said, ‘It is likely the Yin Mountains.’ The next day, crossing the Shatuo, we met woodcutters and asked again—all confirmed it.\" Volume One of *The Collected Works of the Serene Scholar* contains *Six Poems Matching Rhymes While Crossing the Yin Mountains*.\n\nAtop the mountains lies a lake, seventy or eighty *li* in circumference. The *Essentials of the Western Frontier* states: \"Among Ili’s waters is Sailimu Lake, over two hundred *li* northeast of the city, separated by mountains. While all waters within the region flow into the Ili River, Sailimu Lake alone does not.\" The *Western Regions’ Exegesis of Geography* records: \"Sailimu Lake lies over two hundred *li* northeast of Ili City, east of the Tarqi Ridge. To its north is a valley called Borotal.\"\n\nTo the south of the lake, the land is entirely covered with *linqin* trees, their canopies dense and lush, blocking out the sunlight. Exiting the Yin Mountains, one reaches the city of Alima. *The Record of the Western Mission* states: \"Exiting the pass, one arrives at the city of Alimali, where streams crisscross the markets.\" *The Record of the Western Mission* reads \"Exiting the pass to Alimali City\"—it should be \"Exiting the pass to Alima City,\" with an extraneous *li* character. This is the \"Alima City\" of *The Collected Works of the Serene Scholar*, not the \"Alimali\" of *Supplementary Records of the Northwest*. The Westerners call *linqin* \"Alima,\" and as the orchards encircle the city, it takes its name from them. There are eight or nine dependent towns and villages. *The Zhiyuan Translation of Languages* states: \"In Mongolian, 'pear' is called *Alima*.\" The region abounds in grapes and pears. The five grains are sown just as in the Central Plains.\n\nFurther west flows a great river called Yilie. Liu Qi’s *Record of the Northern Mission* recounts: \"In the twelfth month of the fourth year of the Xingding era, we departed the northern frontier and traveled through increasingly elevated terrain. After seven or eight thousand *li*, and then another four or five thousand *li*, the land grew exceedingly warm, passing over a hundred cities, none bearing Han names. After nearly ten thousand *li*, we reached the Yili City of the Uyghur kingdom, the capital of the Uyghur king.\" The name \"Yili\" is a phonetic shift from \"Yilie,\" likely derived from the Yilie River. *The Record of the Western Journey* states: \"Following the south of Heavenly Lake, descending past Alima City, and traveling west for four days, one reaches Dalasumein. *Mein* means 'river.'\" Xu Song’s postscript notes: \"Alima City corresponds to the present-day Western Alimatu River, northeast of Gongchen City, emerging from the Taleqi Mountain Pass and flowing southwest to the Alimatu River, barely a hundred *li* away. Traveling west for four days to Dalasumein, this is the present-day Ili River. Calculating the four days’ journey westward, it should lie west of the present-day Chalin Ford.\" As for the Yilie River, Li Guangting states: \"It likely refers to the present-day Chahanwusu River west of Zhandé City, subsumed under the general name of the Ili.\" *The Western Regions’ Exegesis of Geography* records: \"The Ili River lies roughly one *li* south of Ili City, its source in the Kax and Kongjisi Rivers. Its mighty currents run deep and wide, gathering all waters within the region. Passing south of the city, it turns northwest, flowing over seven hundred *li* before entering Kazakh territory, where it vanishes into the sands.\"\n\nAccording to *The Old Book of Tang*: \"During the Zhenguan era, the Western Turkic Khaganate divided its tribes into two, with the Yilie River as the boundary. In the second year of the Xianqing era, Su Dingfang served as the Grand Military Commissioner of the Yili Circuit and campaigned against the Western Turks.\" The \"Yili\" mentioned here is the present-day Ili, named after the river. \"Li\" and \"li\" share the same name, while \"lie\" is phonetically similar. To its west lies the city of Husisuwoluoduo, the capital of the Western Liao. Chen Shiyuan’s *Translated Terms in Various Histories* explains: \"*Wo’erduo* means 'tent palace' in Chinese. *The History of Liao* refers to it as *woluoduo*, a phonetic variation.\" *The Record of the Western Mission* states: \"Passing between the six *tu* and two mountains, the land levels out with a dense populace, crisscrossed by irrigation channels, and strewn with old ramparts and walls. Upon inquiry, we learned this was the former residence of the Khitans. The distance from here to Karakorum is nearly fifteen thousand *li*.\" *The Veritable Records of the Tianzuo Era in The History of Liao* records: \"Yelü Dashi established a capital city called Husisuwoluoduo.\" Furthermore, *The History of Liao’s Military Defense* mentions: \"The vassal armies include the Humusi Mountain tribes.\" *Humusi* is the same as the \"Husi\" in *The Veritable Records*. Additionally, *The Table of Tribes and Clans* notes that in the second year of the Tianzan era of Emperor Taizu of Liao, the Humusi Mountain tribes were defeated. *The Table of Various Tribes* also lists the Humusi tribe. All these refer to the \"Husi\" in this record, later called *wo’erduo* after Yelü Dashi established his capital. *The History of Liao’s Administrative Divisions* states: \"Where the ruler resides is called a *woluoduo*.\" *The History of Jin’s Official System* explains: \"*Woliduo* is the place where government affairs are conducted.\" The city had several dozen dependent towns.\n\nFurther west several hundred *li* lies Talas City. *The Record of a Western Envoy* states: \"On the twenty-eighth day, we passed Talasi Monastery.\" According to *The Record of a Western Journey*, there is \"Darasu-mo'nian.\" The original annotation reads: \"Mo'nian means river.\" Thus, \"Talas\" is the homophonic equivalent of \"Darasu.\" This city takes its name from the river, whose upper reaches are already called the Darasu River. In this record, it is referred to as the Yili River, located east of the Central Prefecture of the Western Liao River. Flowing west for several hundred *li*, the river encircles this city, which is the Talas City in this record and the Talasi Monastery passed by Liu Yu. Further southwest over four hundred *li* lies Khujand City. *The Record of a Western Envoy* states: \"On the fourth day, we crossed the Khujand River, where the ferryboats resembled official shoes. The locals said: ‘The river’s source lies in the great southern mountains, a land rich in jade.’ It is likely the Kunlun Mountains.\"\n\nEight Cities—Bapu, *The Supplementary Record of Northwestern Regions in the History of the Yuan* renders this as \"Babu,\" which is homophonous with \"Bapu\" in this record but written differently. Kesan City, *The Supplementary Record* writes it as \"Kesan,\" an alternate form of \"Kesan\" in this record. *The Biography of Hesimaili* renders it as \"Kesan City.\" Balan City. *Record of Western Travels* states: \"In the renwu year, during the first month of spring, the balan trees first bloomed, resembling small peach blossoms. By autumn, their fruits were harvested and eaten, tasting like walnuts.\" *Zhanran’s Collected Records of Western Travels in Verse* reads: \"Having tasted balan without regard for price, / Brewing grape wine without paying tribute to officials.\" Other poems mentioning balan and grapes are too numerous to list. Khujand abounds in pomegranates, each as large as a chess piece, sweet with a slight sourness. Squeezing three to five yields a bowlful of juice, a supreme delight for the thirsty.\n\nKhujand is written as \"Huzhan\" in *The Supplementary Record of Northwestern Regions in the History of the Yuan* and as \"Huozhan\" in *The History of the Ming’s Western Regions*. *The Biography of Xue Talahai* in *The History of the Yuan* records campaigns against the states of Huhuchan, which correspond to the lands of Khujand. Another passage in *The History of the Yuan*, *The Biography of Guo Baoyu*, states: \"He pacified Bieshibali, Bieshilan, and other cities, then advanced to the Khujand River.\" From this biography, we know that \"Khujand\" and \"Khujand\" are homophonous, the city having taken its name from the river. Balan City is surrounded by balan orchards, hence its name. Its flowers resemble apricot blossoms but are slightly paler, and its leaves are like peach leaves but somewhat smaller. It blooms in winter and bears fruit abundantly in summer.\n\nIn Bapu, the largest watermelons weigh fifty *jin*. *Records of Songmo* states: \"The watermelon is shaped like a flat gourd but round, its rind a deep green that turns yellow after a year. Its flesh resembles that of a sweet melon, filled with juice, and is especially cooling.\" Ming-dynasty scholar Zhang Yi’s *Qingshang Lu* quotes Yelü Chucai’s *Record of Western Travels*: \"In Bapu, the largest watermelons weigh fifty *jin* and can hold a fox.\" The phrase \"can hold a fox\" is absent here, having been excised by *Laoxue Conglu*. A long-eared donkey can carry only two at a time.\n\nFive hundred *li* northwest of Khujand lies the city of Edarala. *The Basic Annals of the Yuan History* records: \"In the fourteenth year, Edarala City was taken,\" which corresponds to the homophonic transcription of \"Edarala\" in this text. *The Supplementary Record of Northwestern Regions* writes it as \"Wutilar’er.\" Another entry in *The Basic Annals* states: \"In the fifteenth year, in autumn, the city of Wotuoluo’er was attacked and captured,\" which is phonetically similar. The discrepancy likely arises from drawing on different sources, leading to repetition. Moreover, the western regions were fierce and unruly; it is not impossible that the city was retaken after rebellion, hence the two campaigns.\n\nLi Guangting’s *Illustrated Survey of the Western Regions* notes: \"When Qiuci submitted to the Yuan, it became Bieshibali, and its western border city was called Kuxian, which is the homophonic equivalent of today’s ‘Kuche.’ *The Biography of Yelü Xiliang* in *The History of the Yuan* records campaigns reaching Hunbasheng City. Today, south of Aksu, there is a Hunbashi Village. When Emperor Shizu was recalled from the lands of the Two Kings, he passed through Kuxian City to Hala Huozhou, then to Yizhou, crossing the great desert to return—this is also called Khujand.\" Zheng Wen’s *Record of Western Travels* states: \"Five hundred *li* northwest of Khujand lies Edarala City.\" All refer to the same place. It governs over a dozen dependent cities.\n\nThis city’s chieftains once killed several imperial envoys and over a hundred merchants, seizing all their goods and wealth. The western campaign arose from this. *The Basic Annals of the Yuan History* states: \"In the summer of the fourteenth year of Taizu’s reign, the sixth month, the Western Regions killed envoys. The Emperor personally led the army to campaign, taking Edarala City and capturing its chieftain, Hajji Erketü.\" Over a thousand *li* west of Edarala lies a great city called Xunsiqan. *Record of the Western Mission* says: \"Passing Xunsiqan, the city is vast and its people numerous.\" *The Basic Annals of Taizu in the Yuan History* states: \"In the fifteenth year, Xunsiqan City was taken.\" It also says: \"In the sixteenth year, Xiemisigan City was attacked.\" Now, it is noted that after Taizu took this city, it later rebelled, hence the second attack in the sixteenth year. \"Xiemisigan\" is \"Xunsiqan.\" *Supplementary Records of the Northwest* renders it as \"Samarqand.\" *The Biography of Anzhuni in the Yuan History* says: \"Taizu campaigned west to Xunsiqan.\" *The Biography of Guo Baoyu* says: \"He took Xunsiqan City.\" It also says: \"Leading troops to occupy Xunsiqan, he entered the Iron Gate and encamped at the Great Snow Mountains.\" *The Biography of Yelü Ahai* says: \"He took Xunsiqan and other cities.\" *Ming Shifalu* states: \"Samarqand, the ancient land of the Xiuxian Kingdom, lies west of Xuandu Mountain. The Tang established the Xiuxian Supervisory Prefecture there, appointing its five *dudu*. During the Yuan, the imperial son-in-law Temür ruled the land. To the east lay Yang’ershalu Haiya Sailanda Shigan, and to the west, cities such as Kesh and Dielimi, all subject to it.\"\n\nSamarqand, as the Westerners call it, means \"fertile,\" named for its rich and abundant land. *The Journey to the West* states: \"Samarqand, a city ten thousand *li* away, is the finest place in the Uighur realm.\" Du Huan’s *Record of Travels* says: \"Samojian is fertile, its people wealthy, and its land small. There is a sacred shrine called Bazhu.\" From *Zhanran’s Collection: Twelve Poems of Nostalgia*: \"Moved by grace to bear the imperial decree, I entrusted my message to Xunsi.\" The annotation reads: \"Xunsiqian is a city in the Western Regions. The Westerners say: ‘Xunsi means fertile; qian means city.’ Together, it is called the Fertile City.\" It is exceedingly prosperous. They use gold and copper coins without holes or rims. For dozens of *li* around the city lie gardens and groves, with flowing canals and gushing springs, square ponds and round pools, flowers and trees stretching endlessly—truly a splendid sight. Their melons grow as large as a horse’s head. The land yields no millet, glutinous rice, or soybeans, and rain is absent even in midsummer. Wine is brewed from grapes. Though mulberry trees grow, they do not raise silkworms, and all wear *qushu* clothing. From *Zhanran’s Collection*, Volume 7, *Two Playful Poems*: \"A *qushun* robe, light and trimmed in teal, / New grape wine swirls in goose-yellow hues.\" Volume 5, *Poem on Begging for a Fan*: \"A *qushun* roundly cut like a white jade plate, / The recluse himself trims the pale bamboo.\" *The Yuan History: Treatise on Carriages and Attire* states: \"*Zhisun*, in Chinese, means ‘single-color attire.’ It was bestowed upon meritorious nobles, high ministers, and close attendants, and even musicians and diviners were granted such robes, though the quality varied. All were called *zhisun*.\" White is considered an auspicious color, while blue is worn for mourning, so all dress in white. Chen Cheng’s *Record of an Embassy to the Western Regions* says: \"The ruler of Herat wraps his head in white cloth and braids his hair into a queue. Men shave their heads and bind them with white cloth. Women cover their heads with white cloth.\"\n\nSix or seven hundred *li* west of Samarkand lies the city of Bukhara, where the land yields even greater abundance and towns are somewhat more numerous. *The Yuan History: Annals of Taizu* records: \"In the fifteenth year, Bukhara was taken.\" *The Biography of Yelü Ahai* states: \"Bukhara was subdued.\" *Supplementary Records of the Northwest* lists \"Bukhara\" beneath \"Termedh.\" This appears to be the same \"Bukhara\" mentioned in the *Annals*. *Ming Shifa Record* says: \"Bukhār lies seven hundred *li* west of Samarkand. Calculating by distance, since Samarkand is Samarkand, then Bukhār must be Bukhara.\" *The Biography of Yelü Ahai* further notes: \"Following the Emperor in his western campaign, he captured cities such as Bukhara and Samarkand.\" In volume five of *The Collected Works of Zhanran*, the seventh poem of *Poems Presented to Marshal Pucha* reads: \"Idly riding a lean horse past Bukhara, / Once more I arrive at the home of the Prefect of Xiyang.\" Volume six also contains *Dreaming of the Old Man of Ten Thousand Pines in Bukhara*. Samarkand was the capital of the Karluk tribe ruled by the Sogdians. *Record of a Northern Mission* states: \"There are Muslim Karluks who are cruel by nature. They must slaughter animals with their own hands before eating, and even during fasts, they indulge in wine and dried meat without restraint.\" *Journey to the West* records: \"Upon reaching the city of Almalik, the king of the Pusuman came to welcome them, and they lodged in the Western Garden.\" \"Pusuman\" and \"Muslim Karluk\" are both phonetic variations of \"Karluk.\" Furthermore, according to *The Liao History: Table of Various Tribes*, there was a Puswan tribe, and *The Jin History* lists \"Pusuwo\" among the twelve pastoral offices. Here, they are referred to as the \"Karluk tribe,\" suggesting they belong to the same group. In the annotations to *One Hundred Rhymes of Nostalgia* in volume twelve of *The Collected Works of Zhanran*, it is written: \"Dashi Linya, a minister of the Liao, led his people into exile. In less than twenty years, he conquered dozens of Western Regions states, spanning tens of thousands of *li*. His lineage endured for several generations over a hundred years, and they greatly valued civil education.\"\n\nThe Western Regions still revere him to this day, posthumously styling him \"Virtuous Ancestor.\" In the annotations to *Spring Outing by the River* in volume five, it is written: \"Near Samarkand lies the Suli Tan of the Western Regions, where the former palace still stands.\" The cities of Bukhara, Khujand, and Otrar were all subject to it. *An Illustrated Survey of the Western Regions* states: \"According to *The Annals of Yuan Taizu*, in the fourteenth year (jimao, 1219), the Western Regions killed envoys. The Emperor personally led a campaign and took Otrar. Otrar is present-day Aksu. The Yeshiding Stone River is the Bide'er River of Wushi.\" West of Bukhara, a great river flows into the sea. *The Annals of Taizu* records: \"In the fifteenth year, summer, fifth month, the imperial encampment halted by the Yeshiding Stone River.\" However, at that time, the cities of Bukhara and Samarkand had already been taken, so this great river is not the Yeshiding Stone River but rather the present-day Amu Darya. This is known from *The Secret History of the Mongols* and *The Record of a Journey to the West*. To its west lies the city of Urgench. *The Annals of the Yuan History* states: \"In the autumn of the sixteenth year, the imperial sons Jochi, Chagatai, and Ögedei divided their forces to attack and capture the cities of Urgench and others.\" \"Urgench\" is a homophonic rendering of the three characters \"Yulongjie.\" In Mongolian, \"official\" is called *chi*, hence the name \"Yulongjiechi.\" *The Secret History of the Mongols* says: \"Crossing the Amu Darya, they encamped below the city of Ürünggechi.\" \"Ürüngge\" is even closer in sound to \"Yuligan.\" *The Biography of Hesumaili* in *The Yuan History* renders it as \"the land of Yuelianjiechi.\" *The Biography of Yelü Xiliang* records: \"In the fifth month, they traveled west to Beilesali. In the sixth month, they reached Huanzhasun. Proceeding another nine hundred *li* west, they arrived at Yelikan City. Later, they returned with the two princes to Bula City.\" Note: Beilesali is Bula City. Huanzhasun is a phonetic shift of \"Husi,\" the capital of the Western Liao. \"Nine hundred *li* to Yelikan City\" is a phonetic variation of \"Yulongjie,\" which is Urgench, and also a homophonic rendering of the three characters \"Yuligan.\" \"Returning to Bula City\" is again Beilesali. The translations were likely done by a single person, yet inconsistencies arose between earlier and later passages, and the compilers of the biographies were unfamiliar with Mongolian, leaving readers bewildered.\n\nThe Suli Tan Empress Dowager resided there. The region was even more prosperous than Bukhara. This empress dowager was likely the wife of Zhilugu, for at that time, the Naiman usurped Zhilugu’s kingdom and honored his consort as the Empress Dowager. Further west, along the great river, lies the city of Ban. *The Annals of the Yuan History* records: \"In the sixteenth year (xinsi, 1221), summer, fourth month, the imperial encampment halted at the Iron Gate Pass. In autumn, the Emperor attacked the cities of Banlehe and others.\" *The Biography of Baicha Khan* states: \"Baicha Khan was a native of Banlehe in the Western Regions. Initially, Baicha Khan was born in the River Central region. That night, the sky was clear and serene, the moon bright as day. In the Western Regions, white is called *baicha*, hence his name.\" Note: River Central refers to Samarkand; Banlehe is Ban City. Further west lies the Brick City. *The Record of a Journey to the West* says: \"West of the southern bank of the Iron Gate lies a mountain stronghold called Tuanbala, its terrain perilously steep.\" This \"Brick City\" is a phonetic shift of \"Tuan City.\" Thus, *The Record* states: \"From there, traveling thirty *li* southeast, they passed Banli City.\" Since this city lies west of Banli, it is clear that \"Brick City\" corresponds to \"Tuanbala\" in *The Record*. *The Great Tang Records on the Western Regions* states: \"Traveling southwest from the country of Jieshuangna for over two hundred *li*, one enters the mountains. The mountain paths are rugged, the stream crossings treacherous, with few signs of human habitation and scarce water and grass. Proceeding three hundred *li* southeast through the mountains, one enters the Iron Gate. The Iron Gate is flanked by mountains, their cliffs sheer and towering. Though a narrow path exists, it is perilous and obstructed. The stone walls on either side are iron-colored, and the gate is reinforced with iron bolts and hung with many iron bells. Due to its impregnability, it is so named. Exiting the Iron Gate, one reaches the country of Duhuoluo,\" and so on. This \"Brick City\" was likely the former territory of the Tang-era Tuhuoluo kingdom.\n\nFrom here, proceeding west leads directly to the Black Indian City. The region also has its own script. Liu Qi’s *Record of a Northern Mission* states: \"There are the Indu Huihe, dark-skinned and honest. Their written contracts and laws are all in the Huihe script, written with reed pens. Their language is unintelligible to the Chinese.\" *Record of a Western Mission* says: \"The country of Yindu is closest to China, with a population of twelve million households. It is the Han-era Shendu.\" Giulio Aleni’s *Chronicles of the World Beyond the Administrative Regions* states: \"Southwest of China lies India, the Five Indias of Tianzhu, situated along the Indus River.\" *The History of the Han: Treatise on the Western Regions* records: \"The state of Wulei borders Yundu to the north.\" Yan Shigu notes: \"Yundu is Shendu or Tiandu. These are all the same name, differing only in pronunciation.\" Minister Zhao Shaonan observes: \"Tiandu is Tianzhu. The Tianzhu of *The History of the Later Han* corresponds to the Yundu of this *Treatise*, and later generations also call it the country of India.\" Its script and pronunciation differ from those of the Buddhist lands.\n\nThe land abounds with Buddhist statues. *The Western Journey Record* states: \"Qishimi to the west is where the robe and bowl of Śākyamuni were transmitted.\" *Records Heard in Songmo* notes: \"The Uyghurs revere Buddhism most devoutly. They gather in a hall, sculpting Buddha images within. For every fast, they must slaughter sheep. When drunk, they dip their fingers in blood to anoint the Buddha’s mouth, or lift its feet to their lips, calling this ‘intimate reverence.’ When reciting scriptures, they don robes and chant in the language of Western India.\"\n\n*The Great Tang Records on the Western Regions* records: The state of Kashmir, formerly miswritten as \"Chubin.\" They do not slaughter cattle or sheep but drink their milk. The locals have never seen snow. Wheat ripens twice a year. In midsummer, tin vessels placed in the sand soon melt. Horse dung falling to the ground boils and bubbles. Moonlight shines as brightly as summer sunlight. To its south flows a great river, cold as ice, its torrents fierce and swift, emptying into the Southern Sea.\n\n*The New Tang History: Treatise on Geography* states: \"Five small states lie on the western frontier of India, extending to the state of Tifengri. Within its borders flows the great river Maitrā, also called the Sindhu, which rises from the northern Mount Bökün, flows west to Tifengri, then north into the sea.\"\n\n*Chronicles of the World Beyond the Administrative Regions* says: \"In Eastern India flows a great river named the Ganges. The people believe that bathing in its waters washes away all past misdeeds.\"\n\nThe land yields abundant sugarcane, from which they extract juice to brew wine and refine sugar. Traveling northwest from India, one reaches the state of Kefucha.\n\n*The History of the Yuan: Biography of Guo Baoyu* records: \"In the year xinsi, the Sultan of Kefucha conquered the state of Naiman, led his troops to occupy Samarkand, and upon hearing of the Emperor’s approach, abandoned the city and fled south into the Iron Gate Pass, stationing his forces on the Great Snow Mountain. Baoyu pursued them, and they fled further into India.\"\n\n*The Old Tang History: Traditions of the Western Rong* states: \"The state of Persia borders the state of Tuhuoluo and Kang to the east, and to the north lies the Kesa tribe of the Turks.\"\n\nNote: The so-called Kesa is likely the modern Russian Cossack region, corresponding to the Kefucha of this record. For thousands of *li*, the land is a vast plain without hills or mounds, and no cities or towns are established.\n\n*Chronicles of the World Beyond the Administrative Regions* states: \"At the northwesternmost reaches of Asia lies a great state called Muscovy, stretching fifteen thousand *li* from east to west and eight thousand *li* from north to south, divided into sixteen provinces. The Volga River is the largest, with eighty tributaries, all converging as its estuaries, and over seventy mouths empty into the Northern Arctic Sea.\"\n\n*The Great Tang Records on the Western Regions* records: \"Traveling fifteen or sixteen hundred *li* southwest from Sindhu, one reaches the state of Aduobachiluo, which spans over five thousand *li* in circumference. From Aduobachiluo, traveling seven hundred *li* north, one reaches the state of Biduoshiluo, within the borders of Western India, spanning over three thousand *li* in circumference. From there, traveling three hundred *li* northeast, one reaches the state of Aducha, also within Western India, spanning two thousand four or five hundred *li* in circumference. Its capital city measures over twenty *li* in circumference, with no great ruler but subject to the state of Sindhu. From there, traveling nine hundred *li* northeast, one reaches the state of Falana, spanning over four thousand *li* in circumference. Continuing northwest, crossing great mountains, fording broad rivers, passing through small towns and villages for over two thousand *li*, one leaves the borders of India and arrives at the state of Caojuzha.\"\n\nThe people raise many sheep and horses and ferment honey for wine. In this land, days are long and nights short; by the time a sheep’s shoulder is roasted, the sun has risen again. This precisely matches the account of the state of Guliwo in the *Tang History*.\n\n*The History of the Yuan: Biography of Tutuga* records: \"Qincha is over thirty thousand *li* from China. In summer, the nights are extremely short, and the sun sets only briefly before rising again.\"\n\n*The Treatise on Geography: Supplementary Records of the Northwest* states: \"Qiongelie is named after its river and is a vassal of Jili. Jisi is over twenty-five thousand *li* from the Great Capital. Days are long and nights short; when the sun sets, a roasted sheep’s rib is done, and dawn has already broken in the east.\" This is the state of Guliwo recorded in the *Tang History*.\n\n*The New Tang History: Treatise on Geography* states: \"On the north bank of the Xiane River lies the city of Fugui. Traveling directly north and slightly east for fifteen hundred *li*, passing through snow mountains, pine and birch forests, and various springs and lakes, one reaches Guliwo. Thirteen days’ journey further west lies the Dubo tribe. Six or seven days north of that lies the Jiankun tribe, where the Laoshān Mountains and the Jian River are found. North of the Guliwo and Dubo tribes lies a small sea, which can be crossed in eight days by horse when the ice is solid. North of the sea stand many great mountains. The people there are tall and imposing, with customs similar to those of Guliwo—days are long and nights short.\"\n\n*The New Tang History: Traditions of the Uyghurs* records: \"Guliwo lies north of the Han Sea, with five thousand warriors. The land abounds with lilies. It produces fine horses, their heads resembling camels’, capable of running several hundred *li*. The land extends north to the sea, the farthest from the capital. Beyond the sea to the north, days are long and nights short; when the sun sets, a roasted sheep’s shoulder is done, and dawn has already broken in the east—this is near the place of sunrise.\"\n\nYet the names of these states differ. Could it be that over the long passage of time, pronunciations have diverged?\n\n*The Collected Talks of the Old Scholar of Shuzhai* states: \"Commissioner Xu Xianchen said that in Anggila, the sun does not set; only a streak of dark qi veils it, and by the time a sheep’s shoulder is cooked, the sun has risen again. Liu Jingzhi of Baoding, who served as a judge, witnessed this himself.\" This also matches the account of Guliwo in the *Tang History*, though the place names differ—perhaps due to changes over time.\n\nFrom this, it is evident that the sun and moon do not rise and set beneath the earth but revolve beneath the North Pole to create day and night, a truth supported by evidence.\n\nPursuing this line of thought, Xunsiqan lies nearly twenty thousand *li* from the Central Plains, while India is equally distant from Xunsiqan, and Fu cha is again equally distant from India. *The Western Envoy’s Record* states: \"The *New Tang History* records: ‘Fulin lies forty thousand *li* from the capital, upon the Western Sea.’ The rare and wondrous goods it produces align precisely with those of today in terms of distance—there can be no doubt of this.\" Though the route winds and twists, it is undeniably remote, spanning countless tens of thousands of *li*.\n\nThe annotation to the *Shuangxi Collection*’s poem \"Dingling\" notes: \"During the reign of the sagely Taizong of our dynasty, an edict was issued to He Rui and others to enter the Northern Sea. After several years of travel, they reached the Mountain of the Unsetting Sun.\"\n\nYu Hao’s *Archaeological Records of the Western Regions* cites the *Record of Western Travels*: \"In the spring of the *wuyin* year, we departed from Yunzhong, reached the Celestial Mountains, crossed the great desert, traversed the shifting sands, and arrived at the imperial encampment. The following year, a grand western expedition was launched, passing through the Golden Mountains. It was midsummer, yet snow congealed and ice accumulated, so we hewed a path through the ice. Pines and cypresses soared into the heavens, while flowers and grasses filled the valleys. West of the Golden Mountains, all waters flowed westward into the sea. To its south lay a Uyghur city named Bieshiba, where a Tang stele stood—this was the Hanhai Garrison (cited in juan ten).\"\n\nYu’s annotation explains: \"The *Tang History: Uyghur Annals* states: ‘After the fall of the Uyghurs, their remnants took refuge in the mountains and forests, living as bandits among the various tribes. During the reign of Emperor Yizong, the great chieftain Pugu Jun struck north from Beiting, beheaded Shang Kongre, and sent his head to the capital. Thereupon, the two prefectures of Xiting were both recovered, and envoys were dispatched to submit to the court. Later, their history was lost to record. Yet their state never recovered, and they continued to trade sheep and horses at the frontier.’ This is the origin of the Uyghurs’ Five Cities. The Hanhai Garrison was established in Beiting by Guo Yuanzhen at the beginning of the Jinglong era. Bieshiba is a corruption of Bieshibali. During the Yuan, there was a Branch Secretariat of Bieshibali.\"\n\nSeveral hundred *li* from the city lies the Hanhai Sea, within which is an islet entirely covered in feathers shed by the birds that alight there. Two hundred *li* west of the city stands Luntai County, where a Tang stele remains. Five hundred *li* to the city’s south lies Hezhou, which was Tang’s Gaochang and is also called Yizhou.\n\nLi’s annotation notes: \"The *Illustrated Gazetteer of the Western Regions* states: ‘Tang’s Yizhou is today’s Hami.’ It also says: ‘Today’s Zhenxi Prefecture is ancient Yizhou. Pizhan is ancient Gaochang.’\"\n\nExamining the *Yuanhe Junxian Zhi* and the *Taiping Huanyu Ji*, the Tang’s Beiting Protectorate-General commanded three armies to defend against the Türgesh and the Kirghiz. It oversaw the Hanhai, Tianshan, Yiwu, and Hanhai Armies, with a garrison of twelve thousand troops stationed within the city (as above).",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "西游录注（元）耶律楚材撰（清）李文田注 中书令国初时扈从西征，行五六万里，留西域六七年，有《西游录》述其事，人所罕见，因节略于此。 公戊寅春三月， 元太祖十三年也。 出云中， 《湛然居士集》有《过云中赠李尚书诗》。 抵天山， 《汉书西域传》：“卑陆国，王治天山东乾当国。 ”晋灼《武帝纪注》曰：“天山近蒲类国，去长安八千余里。 ”师古曰：“天山即祁连山。 ”祁太史韵士《西陲要略》曰：“哈密之山，即天山。 山之北三百余里为巴里坤，柳谷水在城东北，源出天山，藉资灌田焉。 ” 涉大碛，",
      "translated_text": "Here follows the translation:\n\nThe *Annotated Record of Western Travels* (Xiyou Lu Zhu), compiled by Yelü Chucai of the Yuan dynasty and annotated by Li Wentian of the Qing, states: At the beginning of the dynasty, the Grand Chancellor accompanied the western campaign, journeying fifty or sixty thousand *li*, and remained in the Western Regions for six or seven years. His *Record of Western Travels* recounts these events, a text rarely seen, and thus an abridgment is provided here.\n\nIn the spring of the *wuyin* year, the thirteenth year of the Great Ancestor of the Yuan, the Grand Chancellor set out from Yunzhong. The *Collection of the Serene Layman* contains a poem titled *\"Passing Yunzhong: A Gift to Minister Li.\"* Arriving at the Tianshan Mountains, the *Book of Han: Treatise on the Western Regions* records: \"The King of the Biluo state rules from Qiandang, east of the Tianshan.\" Jin Zhuo’s annotation to the *\"Annals of Emperor Wu\"* states: \"The Tianshan lies near the Pulei state, over eight thousand *li* from Chang’an.\" Yan Shigu comments: \"The Tianshan is the Qilian Mountains.\" The astronomer Qi Yunshi, in his *Essentials of the Western Frontier*, writes: \"The mountains of Hami are the Tianshan. Three hundred *li* north of the mountains lies Barkol. The Liugu River lies northeast of the city, its source in the Tianshan, and its waters are used to irrigate the fields.\" Crossing the great desert...",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 261,
      "start_sentence": 0,
      "end_sentence": 13,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.41820502281189,
      "metadata": {
        "source_file": "dao\\藏外\\西游录注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "宋程大昌《北边备对》曰：“大漠，言沙碛广莫，望之漠漠然。 汉以后史家变称为碛。 碛者，沙积也。 其义一也。 ”《大唐西域记》：“龟兹西行六百里，经小碛，至跋禄伽国。 ” 逾沙漠， 祁韵士《万里行程记》云：“安西州，旧名大湾，后复设安西府，今改为州。 出北门五里许，过一涸河，即入沙碛。 土人呼为戈壁，即古瀚海也。 地以沙石为骨，如熔炼而成肤。 ” 达行在所。 此指元太祖和林之行在，邱处机《西游记》所云“皇帝旧兀里多”者也。 《西游记》：“辛巳六月廿八日，泊窝里朵，汉语行宫也。 ”又称为乃满国兀里朵，盖太祖灭乃蛮后，即置行在于此，以便西伐也。 明年， 己卯年也，是为元太祖十四年。 大举西伐，道过金山。 《北边备对》曰：“金山，隋唐间突厥阿史那氏，得古匈奴北部之地，居金山之阳。 ”案：《湛然居士集》卷一有《过金山用人韵诗》。 《西域释地》云：“乌鲁木齐博克达山，三峰峭拔入云，山腰有潭，周十余里，土人称海子。 山南有俗所呼七个达坂者，即此。 ”按：《唐书》西州交河县，北行经柳谷，度金沙岭，至北庭都护城。 又按：杜甫诗注：“自交河北行八十里，至龙泉馆，北入谷百三十里，经柳谷，度台沙岭，百六十里，经石会汉戍，至北庭都护府。 ”今乌鲁木齐为唐北庭都护故治，土鲁番为西州古治，以相距道里考之，此“达坂”即所谓金沙岭。 今岭畔有陟坡，沙子细碎，滑马足，“金沙”、“台沙”之名当以此。 《皇舆西域图志》云：“按今阿勒坦为古金山，《唐书》称阿史那氏居金山之阳，裴罗西超金山者，是也。 ” 时方盛夏，雪凝冰积，斫冰为道。",
      "translated_text": "The *Northern Frontier Prepared Responses* by Song scholar Cheng Dachang states: \"The Great Desert refers to the vast expanse of shifting sands, appearing boundless and desolate. Later historians of the Han dynasty altered the term to *qi* (碛). *Qi* denotes accumulated sand—its meaning remains the same.\" The *Great Tang Records on the Western Regions* notes: \"Six hundred *li* west of Qiuci lies a small *qi*, beyond which lies the state of Balūka.\" Crossing the desert, Qi Yunshi’s *Record of a Ten-Thousand-*Li* Journey* recounts: \"Anxi Prefecture, formerly called Great Bay, was later reestablished as Anxi Prefecture and now renamed a prefectural state. Five *li* beyond its northern gate, one crosses a dry riverbed and enters the sandy wastes. The locals call it *Gobi*, the ancient *Han Sea*. The land is composed of sand and stone as if forged into skin by smelting.\"\n\nArriving at the imperial encampment—here referring to the Yuan Taizu’s traveling court at Kharakhorum, as described in Qiu Chuji’s *Record of a Western Journey*: \"the emperor’s former *wuli duo*.\" The *Record of a Western Journey* states: \"On the twenty-eighth day of the sixth lunar month in the *xinsi* year, we moored at *Woli Duo*, the Chinese term for a traveling palace.\" It was also called *Naiman Guoli Duo*, for after Taizu conquered the Naiman, he established his encampment here to facilitate western campaigns. The following year—the *jimao* year—marked the fourteenth year of Yuan Taizu’s reign. A grand western expedition was launched, passing through the Altay Mountains. Cheng Dachang’s *Northern Frontier Prepared Responses* records: \"During the Sui and Tang dynasties, the Ashina Turks of the Göktürks occupied the northern lands of the ancient Xiongnu and dwelled on the southern slopes of the Altay Mountains.\" According to the *Collected Works of Master Zhanran*, Volume One contains the poem *\"Passing the Altay Mountains in the Style of Another’s Rhyme.\"* The *Geographical Explanation of the Western Regions* states: \"The Bogda Mountains of Urumqi rise in three peaks, soaring into the clouds. Midway up the slopes lies a pool, over ten *li* in circumference, called *Haizi* by the locals. To the south of the mountains are the so-called Seven *Daban*, which correspond to this location.\" As noted in the *Old唐书*: \"From Jiaohe County in Xizhou, traveling north through Liugu Valley, crossing Jinsha Ridge, one reaches the city of the Beiting Protectorate.\" Further, Du Fu’s poetic annotations record: \"From Jiaohe, traveling eighty *li* north to Longquan Inn, then entering the valley for one hundred thirty *li*, passing through Liugu Valley, crossing Taisha Ridge, and after one hundred sixty *li*, passing the Han garrison at Shihui, one arrives at the Beiting Protectorate.\" Today, Urumqi is the former seat of the Tang Beiting Protectorate, and Turpan the ancient seat of Xizhou. By comparing the distances between them, this *Daban* is the so-called Jinsha Ridge. Near the ridge lies a slope where the sand is fine and loose, causing horses’ hooves to slip—hence the names *Jinsha* (\"Golden Sand\") and *Taisha* (\"Platform Sand\"). The *Imperial Western Regions Atlas* states: \"The present-day Altan corresponds to the ancient Altay Mountains. The *Old唐书* records that the Ashina Turks dwelled on the southern slopes of the Altay, and Pei Luo crossed west beyond the Altay—this confirms it.\" At that time, it was midsummer, yet snow congealed and ice accumulated, requiring the cutting of ice to forge a path.",
      "overlap_context": " *\"Annals of Emperor Wu\"* states: \"The Tianshan lies near the Pulei state, over eight thousand *li* from Chang’an.\" Yan Shigu comments: \"The Tianshan is the Qilian Mountains.\" The astronomer Qi Yunshi, in his *Essentials of the Western Frontier*, writes: \"The mountains of Hami are the Tianshan. Three hundred *li* north of the mountains lies Barkol. The Liugu River lies northeast of the city, its source in the Tianshan, and its waters are used to irrigate the fields.\" Crossing the great desert...",
      "start_char": 262,
      "end_char": 927,
      "start_sentence": 14,
      "end_sentence": 43,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.651517868041992,
      "metadata": {
        "source_file": "dao\\藏外\\西游录注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "松桧参天，花草弥谷。 金山而西，水皆西流入海。 金刘祁《北使记》：“出北界，行西北向，地浸高，并夏国。 前七八千里，山之东，水尽东； 山之西，水亦西，地浸下。 ”祁韵士《西陲要略》云：“新疆诸水，分流异趋，南路之水皆东流，出自南北山中，若喀什喀尔之乌兰乌苏、叶尔羌之玉河、和阗之哈喇哈什、玉陇哈什二河，乌什之瑚什奇、阿克苏之浑巴什、库车之渭干、喀喇沙尔之开都，悉东会于土鲁番之罗卜淖尔。 凡南北山积雪融化之水，皆入之。 湓沦渟蓄，伏流地中，即古蒲昌海也。 北路之水，若伊犁诸河多西流，塔尔巴哈台之额尔齐斯诸河多东流，乌鲁木齐之玛纳斯河多北流，或归入淖尔，或流经苇湖，或伏入沙碛，以及雪融会合之水甚多。 ” 其南有回鹘城，",
      "translated_text": "Amidst towering pines and cypresses, flowers and grasses fill the valleys. West of the Altay Mountains, all waters flow westward into the sea. As Liu Qi’s *Record of a Northern Mission* states: \"Leaving the northern frontier and traveling northwest, the land gradually rises, bordering the Xia state. For the first seven or eight thousand *li*, east of the mountains, all waters flow east; west of the mountains, all waters flow west, as the land gradually descends.\"\n\nQi Yunshi’s *Essentials of the Western Frontier* notes: \"The rivers of Xinjiang diverge in their courses. Those of the southern route all flow east, originating from the southern and northern mountains—such as the Ulan Usu of Kashgar, the Jade River of Yarkand, the Karakash and Yurungkash of Khotan, the Hushqi of Ush, the Hunbash of Aksu, the Weigan of Kuqa, and the Kaidu of Karashahr—all converging eastward in Lop Nur of Turpan. All meltwater from the snows of the southern and northern mountains flows into it. Accumulating and pooling underground, it forms the ancient Puchang Sea.\n\nThe waters of the northern route, such as the various rivers of Ili, mostly flow west; those of the Irtysh in Tacheng mostly flow east; the Manas River of Urumqi mostly flows north. Some empty into lakes, some traverse reed marshes, some vanish into the sands, and many are fed by converging meltwater.\"\n\nTo its south lies the Uighur city.",
      "overlap_context": "is fine and loose, causing horses’ hooves to slip—hence the names *Jinsha* (\"Golden Sand\") and *Taisha* (\"Platform Sand\"). The *Imperial Western Regions Atlas* states: \"The present-day Altan corresponds to the ancient Altay Mountains. The *Old唐书* records that the Ashina Turks dwelled on the southern slopes of the Altay, and Pei Luo crossed west beyond the Altay—this confirms it.\" At that time, it was midsummer, yet snow congealed and ice accumulated, requiring the cutting of ice to forge a path.",
      "start_char": 927,
      "end_char": 1236,
      "start_sentence": 44,
      "end_sentence": 54,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.069412231445312,
      "metadata": {
        "source_file": "dao\\藏外\\西游录注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "《元吏西北地附录》曰：“畏兀儿地。 至元二十年，立畏兀儿四处站及交钞库。 ”《明世法录》曰：“火州，元号畏兀儿。 东七十里，距柳陈城西百里，为土鲁番，即古高昌国治。 ”案：《辽史兵卫志》：“属国军有回鹘，有甘州回鹘，有沙州回鹘，有和州回鹘。 ”此和州回鹘城也。 末洪皓《松漠纪闻》曰：“回鹘、甘、凉、瓜、沙，旧皆有族帐。 惟居四郡外地者，颇自为国，有君长。 ” 名别石把， 《西使记》曰：“龙骨河复西北行，与别失八里南以相直，近五百里。 ”《元史西北地附录》曰：“别失八里。 至元十五年，授八撒察里虎符，掌别失八里畏吾城子里军站事。 十七年，以万户綦公直戍别失八里。 十八年，从诸王阿只吉请，自太和岭至别失八里，置新站三十。 二十年，立别失八里和州等处宣慰司。 二十三年，遣侍卫新附兵千人屯田别失八里，置元帅府。 ”《明史西域传》云：“别失八里，西域大国也。 南接于阗，西抵撒马儿罕，东抵火州，北连瓦剌。 元世祖议宣慰司。 ”《西游记》作“鳖思马大城”。 欧阳玄《高昌契氏家传》：“北庭者，今之别失八里城。 ” 有唐碑。 《西游记》曰：“北庭端府。 景龙三年，杨河大都护有德政，有龙兴西寺二石刻在，功德焕然可观。 寺有佛书一藏，唐之边城往往尚存。 ”《槐西杂志》：“特纳格尔，为唐金满县也，尚有残碑。 ”《西域释地》曰：“库车丁谷山在城北，有古寺，多唐碑，浮图高数十丈。 ”《西域水道记》：“巴尔库勒淖尔四源，东南源曰招摩多沙乌鲁木齐，治曰巩宁城。 城南阻阿拉癸山，东扼博克达山，山之阴为阜康县。 又东并山行一百九十里，为唐沙钵镇，即阿史那贺鲁所处之莫贺城。 又东五十里，为济木萨西突厥之可汗浮图城，唐为庭州金满县，又改后庭县，北庭都护治也。 元于别失八里立北庭都元帅府，亦治于斯。 故城在今保惠城北二十余里，地曰护堡子。 破城有唐金满县残碑，碑石立为二，俱高八寸，广六寸，一石七行，一石六行。 ” 所谓瀚海军。",
      "translated_text": "From the *Supplementary Records of the Western Regions in the Yuan History*: \"The land of the Uighurs. In the twentieth year of the Zhiyuan era, four postal stations and a paper-currency treasury were established in Uighur territory.\"\n\nFrom the *Ming Shifa Lu*: \"Huozhou, known in the Yuan as Uighur. Seventy *li* to the east lies Liuchen City, and one hundred *li* to its west lies Turpan, which was the seat of the ancient Kingdom of Gaochang.\"\n\nAccording to the *Liao History: Military Defense Records*: \"Among the subject states’ armies were the Uighurs, the Ganzhou Uighurs, the Shazhou Uighurs, and the Hezhou Uighurs.\" This refers to the city of the Hezhou Uighurs.\n\nHong Hao’s *Records of Songmo* states: \"The Uighurs of Ganzhou, Liangzhou, Guazhou, and Shazhou all once had tribal encampments. Only those dwelling beyond the four commanderies established their own states, each with its own ruler.\" Another name for this place is *Shiba*.\n\nThe *Record of a Western Mission* states: \"Proceeding northwest along the Longgu River, one reaches Bieshibali to the south after nearly five hundred *li*.\"\n\nFrom the *Supplementary Records of the Western Regions in the Yuan History*: \"Bieshibali. In the fifteenth year of the Zhiyuan era, Basachali was granted a tiger tally to oversee the postal and military stations of the Uighur city of Bieshibali. In the seventeenth year, the garrison commander Qi Gongzhi was stationed there. In the eighteenth year, at the request of Prince Ajiji, thirty new stations were established from Taihe Ridge to Bieshibali. In the twentieth year, the Pacification Commission of Bieshibali, Hezhou, and other regions was established. In the twenty-third year, one thousand newly surrendered imperial guardsmen were sent to garrison and cultivate Bieshibali, where a marshal’s headquarters was established.\"\n\nThe *Ming History: Western Regions Annals* states: \"Bieshibali was a great state of the Western Regions. To its south lay Khotan, to its west Samarkand, to its east Huozhou, and to its north the Oirats. During the Yuan, the emperor considered establishing a pacification commission there.\"\n\nThe *Record of Western Travels* refers to it as \"Biesimada City.\"\n\nOuyang Xuan’s *Genealogy of the Gao Clan of Gaochang* states: \"Beiting is today’s Bieshibali City.\"\n\nA Tang stele remains there. The *Record of Western Travels* states: \"The Duan Prefecture of Beiting. In the third year of the Jinglong era, Yang He, the Grand Protector, governed with virtue, and two stone inscriptions from the Longxing West Temple remain, their merit and virtue still radiant. The temple houses a collection of Buddhist scriptures, and many frontier cities of the Tang still endure.\"\n\nFrom the *Huai Xi Miscellany*: \"Tenage’er was the Tang’s Jinman County, where fragments of a stele still stand.\"\n\nThe *Western Regions: A Topographical Account* states: \"Dinggu Mountain in Kuqa lies north of the city. An ancient temple stands there, with many Tang steles, and a pagoda towering several dozen *zhang* in height.\"\n\nThe *Records of the Waterways of the Western Regions* states: \"The four sources of Barkol Lake: the southeastern source is called Zhaomoduo Sha Wulumuqi, and its administrative seat is Gongning City. To the city’s south lies the Alagui Mountains, and to its east the Bogda Mountains. North of the mountains lies Fukang County. Traveling east along the mountains for one hundred ninety *li*, one reaches the Tang’s Shapozhen, the Mohe City where Ashina Helu resided. Fifty *li* farther east lies Jimusa, the pagoda city of the Western Turk Khaganate, which in the Tang was Jinman County of Tingzhou, later renamed Houting County—the seat of the Beiting Protectorate. The Yuan established the Beiting Marshal Headquarters in Bieshibali, also governing from this site. The old city lies over twenty *li* north of today’s Baohui City, in a place called Hubaozi. The ruined city contains a fragmentary stele of the Tang’s Jinman County, the stone split in two, each piece eight *cun* tall and six *cun* wide—one with seven lines of text, the other with six.\"\n\nThis is the so-called Hanhai Army.",
      "overlap_context": "pan. All meltwater from the snows of the southern and northern mountains flows into it. Accumulating and pooling underground, it forms the ancient Puchang Sea.\n\nThe waters of the northern route, such as the various rivers of Ili, mostly flow west; those of the Irtysh in Tacheng mostly flow east; the Manas River of Urumqi mostly flows north. Some empty into lakes, some traverse reed marshes, some vanish into the sands, and many are fed by converging meltwater.\"\n\nTo its south lies the Uighur city.",
      "start_char": 1237,
      "end_char": 2028,
      "start_sentence": 55,
      "end_sentence": 92,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.27070116996765,
      "metadata": {
        "source_file": "dao\\藏外\\西游录注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "元刘郁《西使记》曰：“瀚海地极高寒，虽酷暑，雪不消。 ”今之所谓瀚海者，即古金山也。 《唐书地理志》：“北庭大都护府，本庭州。 贞观十四年，平高昌。 置有瀚海军，长安二年置。 ”瀚海去城数百里， 《西域释地》云：“哈密东至安西州，西至土鲁番，俱有沙碛，乏水草，不毛之地数百里，谓之瀚海，今呼为戈壁。 ” 海中有屿，其上皆禽鸟所落羽毛。 《史记匈奴传》：“骠骑将军去病封于狼居胥山，禅姑衍，临翰海而还。 ”如淳曰：“翰海，北海名。 ”张守节《正义》曰：“按：翰海自一大海名，群鸟解羽伏乳于石，因名也。 ”李光廷《西域图考》曰：“按：文正《西游录》云：‘戊辰，达行在所，至即唐之高昌’云云，此以今济木萨为瀚海，与刘郁《西使记》殊，且言蒲类海，亦未确也。 ”《西域释地》云：“巴里坤名会宁城。 有海子，即古蒲类海，一名婆悉海，俗呼为海子，在城北沙山之下。 东西袤一百余里，对岸广数十里。 《后汉书》张珰言呼延王常展转蒲类、秦海之间，《元和志》言伊州纳职县北直抵蒲类海。 唐之伊州，即今哈密，距巴里坤相近，而巴里坤又为汉蒲类国地。 是此海子为蒲类海无疑。 ” 城西二百里，有轮台县，",
      "translated_text": "In Liu Yu’s *Record of the Western Mission* from the Yuan, it is written: “The land of the Hanhai is exceedingly cold and high; even in the height of summer, the snow does not melt.” What is now called the Hanhai was in ancient times Mount Jinshan. The *Treatise on Geography* in the *Old Book of Tang* states: “The Beiting Grand Protectorate was originally Tingzhou. In the fourteenth year of the Zhenguan era, Gaochang was pacified. The Hanhai Army was established, and in the second year of the Chang’an era, it was formally established.” The Hanhai lies several hundred *li* from the city. The *Exegesis of Western Regions’ Geography* says: “From Hami east to Anxi Prefecture and west to Turpan, there are several hundred *li* of sandy wastes, devoid of water and grass, barren lands—these are called the Hanhai, now known as the Gobi.” Within this sea are islets, upon which lie the molted feathers of birds that alight there.\n\nThe *Records of the Grand Historian: Account of the Xiongnu* states: “General Huo Qubing was enfeoffed at Mount Langjuxu, performed the *chan* rites at Guyuan, and returned after reaching the Hanhai.” Ru Chun notes: “The Hanhai is the name of the Northern Sea.” Zhang Shoujie’s *Correct Meanings* says: “According to records, the Hanhai is the name of a great sea, where flocks of birds shed their feathers and nest upon the stones, hence its name.” Li Guangting’s *Illustrated Survey of the Western Regions* remarks: “According to Yelü Chucai’s *Record of the Western Journey*: ‘In the year *wuchen*, we reached the imperial encampment and arrived at what was Tang’s Gaochang,’ and so on—this identifies present-day Jimusa as the Hanhai, which differs from Liu Yu’s *Record of the Western Mission*. Moreover, his reference to Pulei Sea is also imprecise.”\n\nThe *Exegesis of Western Regions’ Geography* states: “Balikun is called Huining City. There is a lake there, the ancient Pulei Sea, also called Posihai, commonly known as the Haizi. It lies north of the city beneath the sandy mountains. It stretches over a hundred *li* from east to west, and its opposite shore spans several tens of *li*.” The *Book of Later Han* records Zhang Dang’s account of the Huyan King, who frequently moved between Pulei and Qinhai. The *Yuanhe Era Geography* notes that north of Nazhi County in Yizhou, one reaches Pulei Sea. Tang’s Yizhou is today’s Hami, which lies near Balikun, and Balikun was also the territory of the Han-era Pulei Kingdom. Thus, this lake is undoubtedly the Pulei Sea.\n\nTwo hundred *li* west of the city lies Luntai County.",
      "overlap_context": "Tingzhou, later renamed Houting County—the seat of the Beiting Protectorate. The Yuan established the Beiting Marshal Headquarters in Bieshibali, also governing from this site. The old city lies over twenty *li* north of today’s Baohui City, in a place called Hubaozi. The ruined city contains a fragmentary stele of the Tang’s Jinman County, the stone split in two, each piece eight *cun* tall and six *cun* wide—one with seven lines of text, the other with six.\"\n\nThis is the so-called Hanhai Army.",
      "start_char": 2030,
      "end_char": 2516,
      "start_sentence": 93,
      "end_sentence": 113,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.006790399551392,
      "metadata": {
        "source_file": "dao\\藏外\\西游录注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "《新唐书地理志》：“庭州西延城西至轮台县，共三百二十里。 ”《西游记》：“鳖思马大城，其东数百里，有府曰西凉。 其西三百余里，有县曰轮台。 师问曰：‘有几程得至行在？ ’皆曰：‘西南更行万余里，即是。 ’” 唐碑在焉。 《西域水道记》有说。 城之南五百里，有和州， 《元史耶律希亮传》：“由苦先至哈剌火州。 ”《元史西北地附录》：“阿里麻里”之下有“合剌火”者。 即唐之高昌， 《辽史兵卫志》：“属国军有高昌。 ”《明史》：“火州，其地多山，青红若火，故名。 火州东有荒城，即高昌国都，汉戊己校尉所治。 西北连别失八里，后为土鲁番所并。 ” 亦名伊州。 《湛然居士集十二怀古诗》：“瀚海过西伊。 ”自注云：“伊州之西北有瀚海，伊州又谓之西州。 ”《西域释地》曰：“《元和志》言伊州纳职县北直抵蒲类海。 唐之伊州，即今哈密。 ” 高昌西三四千里，有五端城，即唐之于阗国。 《元史西北地附录》作“忽炭”者，是也。 《曷思麦里传》作“斡端”，《拜延八都鲁传》亦作“斡端”，《宪宗纪》则作“扩端”，均此“五端”二字之声转。 今称“和阗”者，是其地也。 《明史》作“阿端”，又沿古名作“于阗”，均非两地。 《西域释地》云：“叶尔羌，汉莎车国地。 唐以后并入于阗，又曰和阗。 汉于阗国，唐置于阗都督府于此。 回人谓汉人为‘黑台’，和阗即‘黑台’之讹。 相传汉任尚弃其众于此。 ”",
      "translated_text": "The *New Tang History: Treatise on Geography* records: “From Yancheng in Tingzhou west to Luntai County is a total of three hundred and twenty *li*.” The *Record of Western Travels* states: “In the great city of Biesima, several hundred *li* to its east lies a prefecture called Xiliang. Over three hundred *li* to its west lies a county called Luntai.” The Master inquired, “How many stages must one travel to reach the imperial encampment?” All replied, “Proceeding southwest for over ten thousand *li*, one arrives.” A Tang stele stands there. The *Records of Western Regions’ Waterways* also discusses this.\n\nFive hundred *li* south of the city lies Hezhou. The *History of Yuan: Biography of Yelü Xiliang* states: “From Ku’er, one reaches Hala Huozhou.” The *History of Yuan: Appendix on Northwestern Lands* records “Hela Huo” under “Alimali.” This is Tang’s Gaochang. The *History of Liao: Treatise on Military Guards* notes: “The subject-state army includes Gaochang.” The *History of Ming* records: “Huozhou’s terrain is mountainous, its rocks crimson as fire, hence its name. East of Huozhou lies a ruined city, the former capital of the Gaochang Kingdom, where the Han-era Wuji Colonel was stationed. To its northwest lies Beshbaliq, later annexed by Turpan.” It is also called Yizhou. The *Collection of Master Zhanran: Twelve Nostalgic Poems* contains the line: “Crossing the Gobi west of Yizhou.” The annotation explains: “Northwest of Yizhou lies the Gobi; Yizhou is also called Xizhou.” The *Western Regions’ Exegesis of Geography* states: “The *Yuanhe Era Geography* records that north of Nazhi County in Yizhou, one reaches Pulei Sea. Tang’s Yizhou is today’s Hami.”\n\nThree to four thousand *li* west of Gaochang lies Wuduan City, which was Tang’s Yutian Kingdom. The *History of Yuan: Appendix on Northwestern Lands* renders it as “Hutan,” while the *Biography of Hesimaile* and the *Biography of Bayan Badulu* both write it as “Woduan.” The *Annals of Emperor Xianzong* records it as “Kuoduan”—all phonetic variations of the characters for “Wuduan.” Today it is called “Hotan.” The *History of Ming* writes it as “Aduan” and also retains the ancient name “Yutian,” though these are not two separate places. The *Western Regions’ Exegesis of Geography* explains: “Yarkand was the land of the Han-era Shache Kingdom. After the Tang, it was incorporated into Yutian, also called Hotan. The Han-era Yutian Kingdom was where the Tang established the Yutian Protectorate. The Uyghurs call the Han people ‘Heitai,’ and Hotan is a corruption of ‘Heitai.’ Legend holds that the Han general Ren Shang abandoned his troops there.”",
      "overlap_context": "east to west, and its opposite shore spans several tens of *li*.” The *Book of Later Han* records Zhang Dang’s account of the Huyan King, who frequently moved between Pulei and Qinhai. The *Yuanhe Era Geography* notes that north of Nazhi County in Yizhou, one reaches Pulei Sea. Tang’s Yizhou is today’s Hami, which lies near Balikun, and Balikun was also the territory of the Han-era Pulei Kingdom. Thus, this lake is undoubtedly the Pulei Sea.\n\nTwo hundred *li* west of the city lies Luntai County.",
      "start_char": 2517,
      "end_char": 3110,
      "start_sentence": 114,
      "end_sentence": 147,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.360544204711914,
      "metadata": {
        "source_file": "dao\\藏外\\西游录注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "河出乌白玉。 《西陲要略》云：“叶尔羌之山，则有密尔迪山，在城南二百余里，产玉。 有玛尔瑚卢克山，在城西南四百余里，产玉。 又有一大山，在叶尔羌西南，与密尔迪山相连。 回人呼为塔什达巴罕，疑即所谓葱岭者是也。 水则有玉河，自密尔迪山流出，南分支入和阗。 和阗境内一带山皆积雪，水则有哈喇哈什河，有玉陇哈什河，有哈琅圭塔克河，俱多产五，且资灌田。 ” 过瀚海千余里，有不剌城。 《西北地附录》作“普刺”。 《耶律希亮传》：“至不剌城。 ”李光廷《西域图考》曰：“不剌城，即《西使记》‘孛罗城’之转音，城南有阴山，即松树头岭。 山顶在池。 今赛喇木泊在四山之中，即池也。 ” 不剌南有阴山，东西千里，南北二百里。 《西游记》曰：“初在沙陀北，南望天际，若银霞。 问之左右，皆未详。 师曰：‘多是阴山’。 翌日，过沙陀，遇樵者，再问之，皆曰然。 ”《湛然居士集》卷一有《过阴山和人韵诗六首》。 山顶有池，周围七八十里。 《西陲要略》曰：“伊犁之水，有赛里木淖尔，在城东北，隔山二百余里。 凡境内之水，皆朝宗于伊犁河，惟赛里木淖尔不与焉。 ”《西域释地》：“赛里木诺尔，在伊犁城东北二百余里，塔尔奇岭之东。 其北有川，名博罗塔拉。 ”",
      "translated_text": "The river yields black-and-white jade.\n\nThe *Essentials of the Western Frontier* states: \"In the mountains of Yarkand, there is the Mierdi Mountain, over two hundred *li* south of the city, which produces jade. There is the Ma’erhuluke Mountain, over four hundred *li* southwest of the city, which also produces jade. Another great mountain lies southwest of Yarkand, connected to Mierdi Mountain. The Uyghurs call it Tashidabahan—likely the so-called Congling. The waters include the Jade River, which flows from Mierdi Mountain and branches southward into Hotan. Within Hotan’s borders, a range of snow-capped mountains gives rise to the Karakash River, the Yulongkash River, and the Halangguitake River, all rich in jade and vital for irrigation.\"\n\nBeyond the Gobi Desert for over a thousand *li* lies the city of Bula. The *Supplementary Records of the Northwest* renders it as \"Pula.\" The *Biography of Yelü Xiliang* states: \"They arrived at Bula City.\" Li Guangting’s *Illustrated Survey of the Western Regions* notes: \"Bula City is a phonetic evolution of ‘Bolao City’ from the *Record of a Western Envoy*. South of the city lies the Yin Mountains, also called the Pine Tree Ridge. The mountaintop holds a lake. Today’s Sailimu Lake lies amid four mountains—this is the lake.\"\n\nSouth of Bula stretch the Yin Mountains, a thousand *li* east to west and two hundred *li* north to south. The *Record of a Western Journey* recounts: \"At first, north of the Shatuo, we gazed southward at the horizon, where it appeared like silver mist. Asking those beside me, none knew. The master said, ‘It is likely the Yin Mountains.’ The next day, crossing the Shatuo, we met woodcutters and asked again—all confirmed it.\" Volume One of *The Collected Works of the Serene Scholar* contains *Six Poems Matching Rhymes While Crossing the Yin Mountains*.\n\nAtop the mountains lies a lake, seventy or eighty *li* in circumference. The *Essentials of the Western Frontier* states: \"Among Ili’s waters is Sailimu Lake, over two hundred *li* northeast of the city, separated by mountains. While all waters within the region flow into the Ili River, Sailimu Lake alone does not.\" The *Western Regions’ Exegesis of Geography* records: \"Sailimu Lake lies over two hundred *li* northeast of Ili City, east of the Tarqi Ridge. To its north is a valley called Borotal.\"",
      "overlap_context": "” and also retains the ancient name “Yutian,” though these are not two separate places. The *Western Regions’ Exegesis of Geography* explains: “Yarkand was the land of the Han-era Shache Kingdom. After the Tang, it was incorporated into Yutian, also called Hotan. The Han-era Yutian Kingdom was where the Tang established the Yutian Protectorate. The Uyghurs call the Han people ‘Heitai,’ and Hotan is a corruption of ‘Heitai.’ Legend holds that the Han general Ren Shang abandoned his troops there.”",
      "start_char": 3111,
      "end_char": 3629,
      "start_sentence": 148,
      "end_sentence": 174,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.994502067565918,
      "metadata": {
        "source_file": "dao\\藏外\\西游录注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "池南地皆林檎，树阴蓊郁，不露日色。 出阴山，有阿里马城。 《西使记》曰：“出关至阿里麻里城，市井皆流水交贯。 ”《西使记》云“出关至阿里麻里城”，当云“出关至阿里麻城”，衍一“里”字。 此即《湛然集》之“阿里马城”，非《西北地附录》之“阿力麻里”也。 西人目“林檎”曰“阿里马”，附郭皆林檎园，故以名。 附庸城邑八九。 《至元译语》曰：“蒙古语‘梨’曰‘阿里马’。 ” 多蒲萄、梨果。 播种五谷，一如中原。 又西有大河，曰亦列。 刘祁《北使记》曰：“兴定四年十二月，出北界行，地浸高。 前七八千里。 又前四五千里，地甚燠，历城百余，皆非汉名。 又几万里，至回纥国之益离城，即回纥王所都”云云。 案“益离”即“亦列”之声转，盖以亦列水得名也。 《西游记》曰：“沿天池正南，下阿里马城，又西行四日，至答剌速没辇。 没辇，河也。 ”徐松跋云：“阿里马城者，即今西阿里玛图河，在拱宸城东北，出塔勒奇山口，西南至阿里玛图河，仅百里。 又西行四日，至答剌速没辇，是今伊犁河。 以西行四日计之，当在今察林渡之西渡河。 ”亦列河，李光廷曰：“当是今瞻德城西之察罕乌苏河，以伊犁统名之耳。 ”《西域释地》：“伊犁河在伊犁城南一里许，源出哈什、空吉斯二河，洪流深广，境内之水皆归焉。 过城南，折而西北流七百余里，入哈萨克界，遇沙而伏。 ”按：《唐书》：“贞观中，西突厥分其部为二，以伊列水为界。 显庆二年，苏定方为伊丽道行军总管，讨西突厥。 ”所称伊丽，即今伊犁，以水为名。 “犁”与“丽”同名，“列”则音相近耳。 其西有城，曰虎司窝鲁朵，即西辽之都。 明陈士元《诸史译语》云：“‘斡耳朵’，华言‘帐房’也。 《辽史》称‘斡鲁朵’，音之转也。 ”《西使记》云：“过六屠两山间，土平民伙，沟洫映带，多故垒壤垣。 问之，盖契丹故居也。 计其地，去和林万五千里而近。 ”《辽史天祚本纪》：“耶律大石建都城，号虎思斡鲁朵。 ”又《辽史兵卫志》：“属国军有胡母思山蕃。 ”胡母思，即《本纪》之“虎思”矣。 又《部族表》，辽太祖天赞二年，破胡母思山蕃。 又《诸部表》有忽母思部。 均即此《录》之“虎司”，自大石建都后称为“斡耳朵”者也。 《辽史营卫志》：“居有宫卫，谓之斡鲁朵。 ”《金史百官志》：“斡里朵，官府治事之所也。 ” 附庸城数十。",
      "translated_text": "To the south of the lake, the land is entirely covered with *linqin* trees, their canopies dense and lush, blocking out the sunlight. Exiting the Yin Mountains, one reaches the city of Alima. *The Record of the Western Mission* states: \"Exiting the pass, one arrives at the city of Alimali, where streams crisscross the markets.\" *The Record of the Western Mission* reads \"Exiting the pass to Alimali City\"—it should be \"Exiting the pass to Alima City,\" with an extraneous *li* character. This is the \"Alima City\" of *The Collected Works of the Serene Scholar*, not the \"Alimali\" of *Supplementary Records of the Northwest*. The Westerners call *linqin* \"Alima,\" and as the orchards encircle the city, it takes its name from them. There are eight or nine dependent towns and villages. *The Zhiyuan Translation of Languages* states: \"In Mongolian, 'pear' is called *Alima*.\" The region abounds in grapes and pears. The five grains are sown just as in the Central Plains.\n\nFurther west flows a great river called Yilie. Liu Qi’s *Record of the Northern Mission* recounts: \"In the twelfth month of the fourth year of the Xingding era, we departed the northern frontier and traveled through increasingly elevated terrain. After seven or eight thousand *li*, and then another four or five thousand *li*, the land grew exceedingly warm, passing over a hundred cities, none bearing Han names. After nearly ten thousand *li*, we reached the Yili City of the Uyghur kingdom, the capital of the Uyghur king.\" The name \"Yili\" is a phonetic shift from \"Yilie,\" likely derived from the Yilie River. *The Record of the Western Journey* states: \"Following the south of Heavenly Lake, descending past Alima City, and traveling west for four days, one reaches Dalasumein. *Mein* means 'river.'\" Xu Song’s postscript notes: \"Alima City corresponds to the present-day Western Alimatu River, northeast of Gongchen City, emerging from the Taleqi Mountain Pass and flowing southwest to the Alimatu River, barely a hundred *li* away. Traveling west for four days to Dalasumein, this is the present-day Ili River. Calculating the four days’ journey westward, it should lie west of the present-day Chalin Ford.\" As for the Yilie River, Li Guangting states: \"It likely refers to the present-day Chahanwusu River west of Zhandé City, subsumed under the general name of the Ili.\" *The Western Regions’ Exegesis of Geography* records: \"The Ili River lies roughly one *li* south of Ili City, its source in the Kax and Kongjisi Rivers. Its mighty currents run deep and wide, gathering all waters within the region. Passing south of the city, it turns northwest, flowing over seven hundred *li* before entering Kazakh territory, where it vanishes into the sands.\"\n\nAccording to *The Old Book of Tang*: \"During the Zhenguan era, the Western Turkic Khaganate divided its tribes into two, with the Yilie River as the boundary. In the second year of the Xianqing era, Su Dingfang served as the Grand Military Commissioner of the Yili Circuit and campaigned against the Western Turks.\" The \"Yili\" mentioned here is the present-day Ili, named after the river. \"Li\" and \"li\" share the same name, while \"lie\" is phonetically similar. To its west lies the city of Husisuwoluoduo, the capital of the Western Liao. Chen Shiyuan’s *Translated Terms in Various Histories* explains: \"*Wo’erduo* means 'tent palace' in Chinese. *The History of Liao* refers to it as *woluoduo*, a phonetic variation.\" *The Record of the Western Mission* states: \"Passing between the six *tu* and two mountains, the land levels out with a dense populace, crisscrossed by irrigation channels, and strewn with old ramparts and walls. Upon inquiry, we learned this was the former residence of the Khitans. The distance from here to Karakorum is nearly fifteen thousand *li*.\" *The Veritable Records of the Tianzuo Era in The History of Liao* records: \"Yelü Dashi established a capital city called Husisuwoluoduo.\" Furthermore, *The History of Liao’s Military Defense* mentions: \"The vassal armies include the Humusi Mountain tribes.\" *Humusi* is the same as the \"Husi\" in *The Veritable Records*. Additionally, *The Table of Tribes and Clans* notes that in the second year of the Tianzan era of Emperor Taizu of Liao, the Humusi Mountain tribes were defeated. *The Table of Various Tribes* also lists the Humusi tribe. All these refer to the \"Husi\" in this record, later called *wo’erduo* after Yelü Dashi established his capital. *The History of Liao’s Administrative Divisions* states: \"Where the ruler resides is called a *woluoduo*.\" *The History of Jin’s Official System* explains: \"*Woliduo* is the place where government affairs are conducted.\" The city had several dozen dependent towns.",
      "overlap_context": "op the mountains lies a lake, seventy or eighty *li* in circumference. The *Essentials of the Western Frontier* states: \"Among Ili’s waters is Sailimu Lake, over two hundred *li* northeast of the city, separated by mountains. While all waters within the region flow into the Ili River, Sailimu Lake alone does not.\" The *Western Regions’ Exegesis of Geography* records: \"Sailimu Lake lies over two hundred *li* northeast of Ili City, east of the Tarqi Ridge. To its north is a valley called Borotal.\"",
      "start_char": 3630,
      "end_char": 4576,
      "start_sentence": 175,
      "end_sentence": 219,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.215635299682617,
      "metadata": {
        "source_file": "dao\\藏外\\西游录注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "又西数百里，有塔剌思城。 《西使记》曰：“二十八日过塔剌寺。 ”案《西游记》有“答剌速没辇”。 原注：“没辇，河也。 ”是“塔剌思”即“答剌速”之对音。 此城以河得名，其上游已名为答剌速河，此《录》称为亦列河，在西辽河中府都之东也。 此河西行数百里，绕此城，即此《录》之塔剌思城，又即刘郁所过之塔剌寺矣。 又西南四百余里，有苦盏城、 《西使记》曰：“四日过忽章河，渡船如公鞋然。 土人云：‘河源出南大山，地多产玉。 ’疑为昆仑山。 ”",
      "translated_text": "Further west several hundred *li* lies Talas City. *The Record of a Western Envoy* states: \"On the twenty-eighth day, we passed Talasi Monastery.\" According to *The Record of a Western Journey*, there is \"Darasu-mo'nian.\" The original annotation reads: \"Mo'nian means river.\" Thus, \"Talas\" is the homophonic equivalent of \"Darasu.\" This city takes its name from the river, whose upper reaches are already called the Darasu River. In this record, it is referred to as the Yili River, located east of the Central Prefecture of the Western Liao River. Flowing west for several hundred *li*, the river encircles this city, which is the Talas City in this record and the Talasi Monastery passed by Liu Yu. Further southwest over four hundred *li* lies Khujand City. *The Record of a Western Envoy* states: \"On the fourth day, we crossed the Khujand River, where the ferryboats resembled official shoes. The locals said: ‘The river’s source lies in the great southern mountains, a land rich in jade.’ It is likely the Kunlun Mountains.\"",
      "overlap_context": "Emperor Taizu of Liao, the Humusi Mountain tribes were defeated. *The Table of Various Tribes* also lists the Humusi tribe. All these refer to the \"Husi\" in this record, later called *wo’erduo* after Yelü Dashi established his capital. *The History of Liao’s Administrative Divisions* states: \"Where the ruler resides is called a *woluoduo*.\" *The History of Jin’s Official System* explains: \"*Woliduo* is the place where government affairs are conducted.\" The city had several dozen dependent towns.",
      "start_char": 4576,
      "end_char": 4795,
      "start_sentence": 220,
      "end_sentence": 231,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 5.948699235916138,
      "metadata": {
        "source_file": "dao\\藏外\\西游录注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "八普城、 《元史西北地附录》有“巴补”，即此《录》“八普”之音同字异也。 可伞城、 《西北地附录》作“柯散”，即此《录》“可伞”之异文也。 《曷思麦里传》作“可散城”。 芭榄城。 《西游记》：“壬午之春正月，杷榄始华，类小桃。 俟秋，采其实，食之，味如胡桃。 ”《湛然集记西游事诗》：“亲尝芭榄宁论价，自酿蒲萄不纳官。 ”其他诗言杷榄、蒲萄者，不可枚举。 苦盏多石榴，其大如栱，甘而差酸。 凡三五枚，绞汁盈盂，渴中之尤物也。 苦盏，《元史西北地附录》作“忽毡”，《明史西域传》作“火占”。 《元史薛塔剌海传》从征虎忽缠诸国，即此苦盏城地矣。 又《元史，郭宝玉传》曰：“收别失八里、别失兰等城，次忽章河。 ”据此《传》知“苦盏”与“忽章”同音，盖以河得名。 芭榄城边皆芭榄园，故以名。 其花如杏而微淡，叶如桃而差小。 冬季而花，夏盛而实。 八普城西瓜大者五十斤， 《松漠纪闻》曰：“西瓜形如匾蒲而圆，色极青翠，经岁则变黄，其瓞类酣瓜，中有汁，尤冷。 ”明张翼《清赏录》引耶律楚材《西游录》云：“八普城西瓜大者重五十斤，可以容狐。 ”今此文无“可以容狐”四字，为《老学丛录》删节。 长耳仅负二枚。 苦盏西北五百里，有讹打剌城。 《元史本纪》“十四年，取讹答剌城”，即此“讹打剌”三字之对音也。 《西北地附录》作“兀提剌耳”。 又《本纪》“十五年，秋，攻斡脱罗儿城，克之”，与此亦音近，疑所采不一书，故致重复。 且西域强悍，未必非取后复叛，故两次征克也。 李光廷《西域图考》云：“龟兹入元，为别失八里，西境城曰苦先，即今‘库车’之对音。 《元史耶律希亮传》云从征至浑八升城。 今阿克苏南有浑巴什庄。 世祖自二王所召还，由苦先城至哈剌火州，出伊州，涉大漠还，亦曰苦盏。 ”文正《西游录》云：“苦盏西北五百里，有讹打剌城。 ”皆是地也。 附庸城十数。",
      "translated_text": "Eight Cities—Bapu, *The Supplementary Record of Northwestern Regions in the History of the Yuan* renders this as \"Babu,\" which is homophonous with \"Bapu\" in this record but written differently. Kesan City, *The Supplementary Record* writes it as \"Kesan,\" an alternate form of \"Kesan\" in this record. *The Biography of Hesimaili* renders it as \"Kesan City.\" Balan City. *Record of Western Travels* states: \"In the renwu year, during the first month of spring, the balan trees first bloomed, resembling small peach blossoms. By autumn, their fruits were harvested and eaten, tasting like walnuts.\" *Zhanran’s Collected Records of Western Travels in Verse* reads: \"Having tasted balan without regard for price, / Brewing grape wine without paying tribute to officials.\" Other poems mentioning balan and grapes are too numerous to list. Khujand abounds in pomegranates, each as large as a chess piece, sweet with a slight sourness. Squeezing three to five yields a bowlful of juice, a supreme delight for the thirsty.\n\nKhujand is written as \"Huzhan\" in *The Supplementary Record of Northwestern Regions in the History of the Yuan* and as \"Huozhan\" in *The History of the Ming’s Western Regions*. *The Biography of Xue Talahai* in *The History of the Yuan* records campaigns against the states of Huhuchan, which correspond to the lands of Khujand. Another passage in *The History of the Yuan*, *The Biography of Guo Baoyu*, states: \"He pacified Bieshibali, Bieshilan, and other cities, then advanced to the Khujand River.\" From this biography, we know that \"Khujand\" and \"Khujand\" are homophonous, the city having taken its name from the river. Balan City is surrounded by balan orchards, hence its name. Its flowers resemble apricot blossoms but are slightly paler, and its leaves are like peach leaves but somewhat smaller. It blooms in winter and bears fruit abundantly in summer.\n\nIn Bapu, the largest watermelons weigh fifty *jin*. *Records of Songmo* states: \"The watermelon is shaped like a flat gourd but round, its rind a deep green that turns yellow after a year. Its flesh resembles that of a sweet melon, filled with juice, and is especially cooling.\" Ming-dynasty scholar Zhang Yi’s *Qingshang Lu* quotes Yelü Chucai’s *Record of Western Travels*: \"In Bapu, the largest watermelons weigh fifty *jin* and can hold a fox.\" The phrase \"can hold a fox\" is absent here, having been excised by *Laoxue Conglu*. A long-eared donkey can carry only two at a time.\n\nFive hundred *li* northwest of Khujand lies the city of Edarala. *The Basic Annals of the Yuan History* records: \"In the fourteenth year, Edarala City was taken,\" which corresponds to the homophonic transcription of \"Edarala\" in this text. *The Supplementary Record of Northwestern Regions* writes it as \"Wutilar’er.\" Another entry in *The Basic Annals* states: \"In the fifteenth year, in autumn, the city of Wotuoluo’er was attacked and captured,\" which is phonetically similar. The discrepancy likely arises from drawing on different sources, leading to repetition. Moreover, the western regions were fierce and unruly; it is not impossible that the city was retaken after rebellion, hence the two campaigns.\n\nLi Guangting’s *Illustrated Survey of the Western Regions* notes: \"When Qiuci submitted to the Yuan, it became Bieshibali, and its western border city was called Kuxian, which is the homophonic equivalent of today’s ‘Kuche.’ *The Biography of Yelü Xiliang* in *The History of the Yuan* records campaigns reaching Hunbasheng City. Today, south of Aksu, there is a Hunbashi Village. When Emperor Shizu was recalled from the lands of the Two Kings, he passed through Kuxian City to Hala Huozhou, then to Yizhou, crossing the great desert to return—this is also called Khujand.\" Zheng Wen’s *Record of Western Travels* states: \"Five hundred *li* northwest of Khujand lies Edarala City.\" All refer to the same place. It governs over a dozen dependent cities.",
      "overlap_context": "estern Liao River. Flowing west for several hundred *li*, the river encircles this city, which is the Talas City in this record and the Talasi Monastery passed by Liu Yu. Further southwest over four hundred *li* lies Khujand City. *The Record of a Western Envoy* states: \"On the fourth day, we crossed the Khujand River, where the ferryboats resembled official shoes. The locals said: ‘The river’s source lies in the great southern mountains, a land rich in jade.’ It is likely the Kunlun Mountains.\"",
      "start_char": 4796,
      "end_char": 5577,
      "start_sentence": 232,
      "end_sentence": 267,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.355124711990356,
      "metadata": {
        "source_file": "dao\\藏外\\西游录注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "此城渠酋，尝杀命吏数人、商贾百数，尽掠其财货。 西伐之举由此也。 《元史本纪》：“太祖十四年夏六月，西域杀使者，帝帅师亲征，取讹答剌城，擒其酋哈只儿只兰秃。 ” 讹打剌西千余里，有大城曰寻斯干。 《西使记》曰：“过挦思干，城大而民繁。 ”《元史太祖本纪》曰：“十五年，克寻思干城。 ”又曰：“十六年，攻薛迷思干城。 ”今案太祖克此城，后复叛，故十六年再攻之。 “薛迷思干”，即“寻斯干”也。 《西北地附录》作“撒麻耳干”。 《元史按竺迩传》曰：“太祖西征寻斯干。 ”《郭宝玉传》曰：“下挦思干城。 ”又曰：“引兵据挦思干，入铁门，屯大雪山。 ”《耶律阿海传》曰：“下寻斯干等城。 ”《明世法录》曰：“撒马儿干，古挦宾国，在悬度山西。 唐以其地为修鲜都督府，拜其五都督。 元驸马帖木儿主其国。 东有养儿沙鹿海牙赛兰达失干，西有渴石迭里迷诸城，并隶焉。 ”",
      "translated_text": "This city’s chieftains once killed several imperial envoys and over a hundred merchants, seizing all their goods and wealth. The western campaign arose from this. *The Basic Annals of the Yuan History* states: \"In the summer of the fourteenth year of Taizu’s reign, the sixth month, the Western Regions killed envoys. The Emperor personally led the army to campaign, taking Edarala City and capturing its chieftain, Hajji Erketü.\" Over a thousand *li* west of Edarala lies a great city called Xunsiqan. *Record of the Western Mission* says: \"Passing Xunsiqan, the city is vast and its people numerous.\" *The Basic Annals of Taizu in the Yuan History* states: \"In the fifteenth year, Xunsiqan City was taken.\" It also says: \"In the sixteenth year, Xiemisigan City was attacked.\" Now, it is noted that after Taizu took this city, it later rebelled, hence the second attack in the sixteenth year. \"Xiemisigan\" is \"Xunsiqan.\" *Supplementary Records of the Northwest* renders it as \"Samarqand.\" *The Biography of Anzhuni in the Yuan History* says: \"Taizu campaigned west to Xunsiqan.\" *The Biography of Guo Baoyu* says: \"He took Xunsiqan City.\" It also says: \"Leading troops to occupy Xunsiqan, he entered the Iron Gate and encamped at the Great Snow Mountains.\" *The Biography of Yelü Ahai* says: \"He took Xunsiqan and other cities.\" *Ming Shifalu* states: \"Samarqand, the ancient land of the Xiuxian Kingdom, lies west of Xuandu Mountain. The Tang established the Xiuxian Supervisory Prefecture there, appointing its five *dudu*. During the Yuan, the imperial son-in-law Temür ruled the land. To the east lay Yang’ershalu Haiya Sailanda Shigan, and to the west, cities such as Kesh and Dielimi, all subject to it.\"",
      "overlap_context": "ng* in *The History of the Yuan* records campaigns reaching Hunbasheng City. Today, south of Aksu, there is a Hunbashi Village. When Emperor Shizu was recalled from the lands of the Two Kings, he passed through Kuxian City to Hala Huozhou, then to Yizhou, crossing the great desert to return—this is also called Khujand.\" Zheng Wen’s *Record of Western Travels* states: \"Five hundred *li* northwest of Khujand lies Edarala City.\" All refer to the same place. It governs over a dozen dependent cities.",
      "start_char": 5577,
      "end_char": 5947,
      "start_sentence": 268,
      "end_sentence": 287,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.489433765411377,
      "metadata": {
        "source_file": "dao\\藏外\\西游录注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "寻斯干者，西人云肥也，以地土肥饶，故名。 《西游记》曰：“寻思干城，万里外回纥国国最佳处。 ”杜环《经行记》曰：“萨末建，土沃，人富，国小，有神祠，名拔诸。 ”《湛然集十二怀古诗》：“感恩承圣敕，寄信到寻罳。 ”自注：“寻思虔，西域城名。 西人云：‘寻罳，肥也。 虔，城也。 ’通谓之肥城。 ” 甚富庶。 用金铜钱，无孔郭。 环城数十里皆园林，飞渠走泉，方池圆沼，花木连延，诚为胜概。 瓜大者如马首。 谷无黍、糯、大豆，盛夏无雨。 以蒲萄酿酒，有桑不能蚕，皆服屈胞。 《湛然集》卷七《戏作二首》：“屈眴轻衫裁鸭绿，蒲萄新酒泛鹅黄。 ”卷五《乞扇诗》：“屈眴圆裁白玉盘，幽人自翦素琅玕。 ”《元史舆服志》曰：“质孙，华言一色服也。 勋戚大臣近侍，赐则服之，下至乐工、术士，皆有此服，精粗之制不同，总曰质孙。 ” 以白衣为吉〔色〕，以青衣为丧服，故皆衣白。 陈诚《使西域记》：“哈烈国主以白布缠头，辫发后髢。 男子髡首，缠以白布。 妇人以白布蒙首。 ”",
      "translated_text": "Samarqand, as the Westerners call it, means \"fertile,\" named for its rich and abundant land. *The Journey to the West* states: \"Samarqand, a city ten thousand *li* away, is the finest place in the Uighur realm.\" Du Huan’s *Record of Travels* says: \"Samojian is fertile, its people wealthy, and its land small. There is a sacred shrine called Bazhu.\" From *Zhanran’s Collection: Twelve Poems of Nostalgia*: \"Moved by grace to bear the imperial decree, I entrusted my message to Xunsi.\" The annotation reads: \"Xunsiqian is a city in the Western Regions. The Westerners say: ‘Xunsi means fertile; qian means city.’ Together, it is called the Fertile City.\" It is exceedingly prosperous. They use gold and copper coins without holes or rims. For dozens of *li* around the city lie gardens and groves, with flowing canals and gushing springs, square ponds and round pools, flowers and trees stretching endlessly—truly a splendid sight. Their melons grow as large as a horse’s head. The land yields no millet, glutinous rice, or soybeans, and rain is absent even in midsummer. Wine is brewed from grapes. Though mulberry trees grow, they do not raise silkworms, and all wear *qushu* clothing. From *Zhanran’s Collection*, Volume 7, *Two Playful Poems*: \"A *qushun* robe, light and trimmed in teal, / New grape wine swirls in goose-yellow hues.\" Volume 5, *Poem on Begging for a Fan*: \"A *qushun* roundly cut like a white jade plate, / The recluse himself trims the pale bamboo.\" *The Yuan History: Treatise on Carriages and Attire* states: \"*Zhisun*, in Chinese, means ‘single-color attire.’ It was bestowed upon meritorious nobles, high ministers, and close attendants, and even musicians and diviners were granted such robes, though the quality varied. All were called *zhisun*.\" White is considered an auspicious color, while blue is worn for mourning, so all dress in white. Chen Cheng’s *Record of an Embassy to the Western Regions* says: \"The ruler of Herat wraps his head in white cloth and braids his hair into a queue. Men shave their heads and bind them with white cloth. Women cover their heads with white cloth.\"",
      "overlap_context": "ate and encamped at the Great Snow Mountains.\" *The Biography of Yelü Ahai* says: \"He took Xunsiqan and other cities.\" *Ming Shifalu* states: \"Samarqand, the ancient land of the Xiuxian Kingdom, lies west of Xuandu Mountain. The Tang established the Xiuxian Supervisory Prefecture there, appointing its five *dudu*. During the Yuan, the imperial son-in-law Temür ruled the land. To the east lay Yang’ershalu Haiya Sailanda Shigan, and to the west, cities such as Kesh and Dielimi, all subject to it.\"",
      "start_char": 5948,
      "end_char": 6371,
      "start_sentence": 288,
      "end_sentence": 312,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.569120168685913,
      "metadata": {
        "source_file": "dao\\藏外\\西游录注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "寻思干西六七百里，有蒲华城，土产更饶，城邑稍多。 《元史太祖本纪》：“十五年，克蒲华城。 ”《耶律阿海传》：“下蒲华城。 ”《西北地附录》：“忒耳迷”之下，有“不花剌”。 似即《本纪》之蒲华。 《明世法录》曰：“卜花儿在撤马儿罕西七百里。 以道里计之，撒马儿干即寻思干，则卜花儿即蒲华矣。 ”《耶律阿海传》：“从帝攻西城，下蒲华、寻斯干等城。 ”《湛然集》卷五《赠蒲察元帅诗》其七：“闲乘羸马过蒲华，又到西阳太守家。 ”又卷六有《蒲华城梦万松老人诗》。 寻思于乃谋速鲁蛮种落梭里檀所都。 《北使记》曰：“有没速鲁蛮回纥者，性残忍，肉必手杀而啖，虽斋亦酒脯自若。 ”《西游记》曰：“至阿里马城，铺速满国王来迎，宿于西园。 ”“铺速满”及“没速鲁蛮”，皆“谋速鲁蛮”之转声也。 又按《辽史诸部表》有普速完部，《金史》群牧十二处有蒲速斡，此云“谋速鲁蛮种”，似一类也。 《湛然集》卷十二《怀古一百韵》注云：“大石林牙，辽之宗臣，挈众而亡。 不满二十年，克西域数十国，幅员数万里。 传数主，凡百余年，颇尚文教。",
      "translated_text": "Six or seven hundred *li* west of Samarkand lies the city of Bukhara, where the land yields even greater abundance and towns are somewhat more numerous. *The Yuan History: Annals of Taizu* records: \"In the fifteenth year, Bukhara was taken.\" *The Biography of Yelü Ahai* states: \"Bukhara was subdued.\" *Supplementary Records of the Northwest* lists \"Bukhara\" beneath \"Termedh.\" This appears to be the same \"Bukhara\" mentioned in the *Annals*. *Ming Shifa Record* says: \"Bukhār lies seven hundred *li* west of Samarkand. Calculating by distance, since Samarkand is Samarkand, then Bukhār must be Bukhara.\" *The Biography of Yelü Ahai* further notes: \"Following the Emperor in his western campaign, he captured cities such as Bukhara and Samarkand.\" In volume five of *The Collected Works of Zhanran*, the seventh poem of *Poems Presented to Marshal Pucha* reads: \"Idly riding a lean horse past Bukhara, / Once more I arrive at the home of the Prefect of Xiyang.\" Volume six also contains *Dreaming of the Old Man of Ten Thousand Pines in Bukhara*. Samarkand was the capital of the Karluk tribe ruled by the Sogdians. *Record of a Northern Mission* states: \"There are Muslim Karluks who are cruel by nature. They must slaughter animals with their own hands before eating, and even during fasts, they indulge in wine and dried meat without restraint.\" *Journey to the West* records: \"Upon reaching the city of Almalik, the king of the Pusuman came to welcome them, and they lodged in the Western Garden.\" \"Pusuman\" and \"Muslim Karluk\" are both phonetic variations of \"Karluk.\" Furthermore, according to *The Liao History: Table of Various Tribes*, there was a Puswan tribe, and *The Jin History* lists \"Pusuwo\" among the twelve pastoral offices. Here, they are referred to as the \"Karluk tribe,\" suggesting they belong to the same group. In the annotations to *One Hundred Rhymes of Nostalgia* in volume twelve of *The Collected Works of Zhanran*, it is written: \"Dashi Linya, a minister of the Liao, led his people into exile. In less than twenty years, he conquered dozens of Western Regions states, spanning tens of thousands of *li*. His lineage endured for several generations over a hundred years, and they greatly valued civil education.\"",
      "overlap_context": " nobles, high ministers, and close attendants, and even musicians and diviners were granted such robes, though the quality varied. All were called *zhisun*.\" White is considered an auspicious color, while blue is worn for mourning, so all dress in white. Chen Cheng’s *Record of an Embassy to the Western Regions* says: \"The ruler of Herat wraps his head in white cloth and braids his hair into a queue. Men shave their heads and bind them with white cloth. Women cover their heads with white cloth.\"",
      "start_char": 6372,
      "end_char": 6820,
      "start_sentence": 313,
      "end_sentence": 330,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.984185695648193,
      "metadata": {
        "source_file": "dao\\藏外\\西游录注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "西域至今思之，庙号德宗。 ”卷五《河中春游诗》注云：“寻斯干有西域梭里檀，故宫在焉。 ” 蒲华、苦盏、讹打剌城，皆隶焉。 《西域图考》云：“《元太祖纪》：十四年己卯，西域杀使。 帝亲征，取讹答剌城。 讹答剌，即阿克苏城。 也石的石河，即乌什之毕底尔河也。 ” 蒲华之西，有大河入于海。 《太祖本纪》：“十五年夏五月，驻跸也石的石河。 ”但是时克蒲华城及寻思干城，此大河非也石的石河，却是今阿母河。 以《元秘史》及《西游记》知之矣。 其西有玉里犍城， 《元史本纪》：“十六年秋，皇子术赤、察合台、窝阔台，分破玉龙杰赤等城，下之。 ”玉里犍，即“玉龙杰”三字之对音。 蒙古谓“官”曰“赤”，故名玉龙杰赤也。 《元秘史》曰：“过阿梅河，至兀笼格赤城下营。 ”“兀笼格”尤与“玉里犍”声近矣。 《元史曷思麦里传》作“月恋揭赤之地。 ”《耶律希亮传》：“五月，西行至孛劣撒里。 六月，至换札孙。 又西行九百里，至也里虔城。 又从二王还，至不剌城。 ”案：孛劣撒里，即不剌城。 换札孙，即“虎司”之声转，此西辽都也。 “九百里至也里虔城”，即“玉龙杰”之转声，此即玉龙杰赤也，又即“玉里犍”三字之对音。 “还至不剌城”，又即“孛劣撒里”。 盖翻译本一人，而前后不相照，作传者又不相照，作传者又不识蒙古语，故使读者茫然耳。 梭里檀母后所居。 富庶又盛于蒲华。 此母后当是直鲁古之妻，其时乃蛮篡直鲁古之国，而尊其后为皇太后也。 又西濒大河，有班城。 《元史本纪》：“十六年辛巳，夏四月，驻跸铁门关。 秋，帝攻班勒纥等城。 ”《白察罕传》：“察罕，西域板勒纥城人。 初，察罕生于河中，其夜天气清肃，月白如昼，西域谓白为察罕，故名察罕。 ”案：河中，即寻思干城； 板勒纥，即班城也。 又西有砖城。 《西游记》曰：“铁门南岸西有山寨，名团八剌，山势险固。 ”此“砖城”与“团城”声转也。 故《记》云：“由此东南行三十里，过班里城。 ”则此城在班里之西，故知“砖城”即彼《记》之“团八剌”也。 《大唐西域记》曰：“羯霜那国西南行二百余里，入山。 山路崎岖，溪径危险，既绝人里，又少水草。 东南山行三百余里，入铁门。 铁门者，左右带山，山极峭峻，虽有峡径，加之险阻，两旁石壁，其色如铁，既设门扇，又以铁锢，多有铁铃，悬诸门扇，因其险固，遂以为名。 出铁门到睹货罗国”云云。 此“砖城”盖唐之吐火罗国故也。 自此而西，直抵黑色印度城。 亦有文字， 刘祁《北使记》曰：“有印都回纥者，色黑而性愿。 其书契约束，并回纥字，笔苇其管，言语不与中国通。 ”《西使记》曰：“印毒国去中国最近，军民一千二百万户，即汉身毒也。 ”艾儒略《职方外纪》曰：“中国之西南曰印弟亚，即天竺五印度也，在印度河左右。 ”《汉书西域传》：“无雷国北与捐毒接。 ”师古曰：“捐毒，即身毒、天笃也。 本皆一名，语有轻重耳。 ”臣召南案：“天笃，即天竺。 《后汉书传》之天竺，即此《传》之捐毒，而后世又曰印度国也。 ” 与佛国字体声音不同。",
      "translated_text": "The Western Regions still revere him to this day, posthumously styling him \"Virtuous Ancestor.\" In the annotations to *Spring Outing by the River* in volume five, it is written: \"Near Samarkand lies the Suli Tan of the Western Regions, where the former palace still stands.\" The cities of Bukhara, Khujand, and Otrar were all subject to it. *An Illustrated Survey of the Western Regions* states: \"According to *The Annals of Yuan Taizu*, in the fourteenth year (jimao, 1219), the Western Regions killed envoys. The Emperor personally led a campaign and took Otrar. Otrar is present-day Aksu. The Yeshiding Stone River is the Bide'er River of Wushi.\" West of Bukhara, a great river flows into the sea. *The Annals of Taizu* records: \"In the fifteenth year, summer, fifth month, the imperial encampment halted by the Yeshiding Stone River.\" However, at that time, the cities of Bukhara and Samarkand had already been taken, so this great river is not the Yeshiding Stone River but rather the present-day Amu Darya. This is known from *The Secret History of the Mongols* and *The Record of a Journey to the West*. To its west lies the city of Urgench. *The Annals of the Yuan History* states: \"In the autumn of the sixteenth year, the imperial sons Jochi, Chagatai, and Ögedei divided their forces to attack and capture the cities of Urgench and others.\" \"Urgench\" is a homophonic rendering of the three characters \"Yulongjie.\" In Mongolian, \"official\" is called *chi*, hence the name \"Yulongjiechi.\" *The Secret History of the Mongols* says: \"Crossing the Amu Darya, they encamped below the city of Ürünggechi.\" \"Ürüngge\" is even closer in sound to \"Yuligan.\" *The Biography of Hesumaili* in *The Yuan History* renders it as \"the land of Yuelianjiechi.\" *The Biography of Yelü Xiliang* records: \"In the fifth month, they traveled west to Beilesali. In the sixth month, they reached Huanzhasun. Proceeding another nine hundred *li* west, they arrived at Yelikan City. Later, they returned with the two princes to Bula City.\" Note: Beilesali is Bula City. Huanzhasun is a phonetic shift of \"Husi,\" the capital of the Western Liao. \"Nine hundred *li* to Yelikan City\" is a phonetic variation of \"Yulongjie,\" which is Urgench, and also a homophonic rendering of the three characters \"Yuligan.\" \"Returning to Bula City\" is again Beilesali. The translations were likely done by a single person, yet inconsistencies arose between earlier and later passages, and the compilers of the biographies were unfamiliar with Mongolian, leaving readers bewildered.\n\nThe Suli Tan Empress Dowager resided there. The region was even more prosperous than Bukhara. This empress dowager was likely the wife of Zhilugu, for at that time, the Naiman usurped Zhilugu’s kingdom and honored his consort as the Empress Dowager. Further west, along the great river, lies the city of Ban. *The Annals of the Yuan History* records: \"In the sixteenth year (xinsi, 1221), summer, fourth month, the imperial encampment halted at the Iron Gate Pass. In autumn, the Emperor attacked the cities of Banlehe and others.\" *The Biography of Baicha Khan* states: \"Baicha Khan was a native of Banlehe in the Western Regions. Initially, Baicha Khan was born in the River Central region. That night, the sky was clear and serene, the moon bright as day. In the Western Regions, white is called *baicha*, hence his name.\" Note: River Central refers to Samarkand; Banlehe is Ban City. Further west lies the Brick City. *The Record of a Journey to the West* says: \"West of the southern bank of the Iron Gate lies a mountain stronghold called Tuanbala, its terrain perilously steep.\" This \"Brick City\" is a phonetic shift of \"Tuan City.\" Thus, *The Record* states: \"From there, traveling thirty *li* southeast, they passed Banli City.\" Since this city lies west of Banli, it is clear that \"Brick City\" corresponds to \"Tuanbala\" in *The Record*. *The Great Tang Records on the Western Regions* states: \"Traveling southwest from the country of Jieshuangna for over two hundred *li*, one enters the mountains. The mountain paths are rugged, the stream crossings treacherous, with few signs of human habitation and scarce water and grass. Proceeding three hundred *li* southeast through the mountains, one enters the Iron Gate. The Iron Gate is flanked by mountains, their cliffs sheer and towering. Though a narrow path exists, it is perilous and obstructed. The stone walls on either side are iron-colored, and the gate is reinforced with iron bolts and hung with many iron bells. Due to its impregnability, it is so named. Exiting the Iron Gate, one reaches the country of Duhuoluo,\" and so on. This \"Brick City\" was likely the former territory of the Tang-era Tuhuoluo kingdom.\n\nFrom here, proceeding west leads directly to the Black Indian City. The region also has its own script. Liu Qi’s *Record of a Northern Mission* states: \"There are the Indu Huihe, dark-skinned and honest. Their written contracts and laws are all in the Huihe script, written with reed pens. Their language is unintelligible to the Chinese.\" *Record of a Western Mission* says: \"The country of Yindu is closest to China, with a population of twelve million households. It is the Han-era Shendu.\" Giulio Aleni’s *Chronicles of the World Beyond the Administrative Regions* states: \"Southwest of China lies India, the Five Indias of Tianzhu, situated along the Indus River.\" *The History of the Han: Treatise on the Western Regions* records: \"The state of Wulei borders Yundu to the north.\" Yan Shigu notes: \"Yundu is Shendu or Tiandu. These are all the same name, differing only in pronunciation.\" Minister Zhao Shaonan observes: \"Tiandu is Tianzhu. The Tianzhu of *The History of the Later Han* corresponds to the Yundu of this *Treatise*, and later generations also call it the country of India.\" Its script and pronunciation differ from those of the Buddhist lands.",
      "overlap_context": " Here, they are referred to as the \"Karluk tribe,\" suggesting they belong to the same group. In the annotations to *One Hundred Rhymes of Nostalgia* in volume twelve of *The Collected Works of Zhanran*, it is written: \"Dashi Linya, a minister of the Liao, led his people into exile. In less than twenty years, he conquered dozens of Western Regions states, spanning tens of thousands of *li*. His lineage endured for several generations over a hundred years, and they greatly valued civil education.\"",
      "start_char": 6820,
      "end_char": 8057,
      "start_sentence": 331,
      "end_sentence": 393,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.28912162780762,
      "metadata": {
        "source_file": "dao\\藏外\\西游录注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "佛像甚多。 《西使记》曰：“乞石迷西，盖传释迦氏衣钵者。 ”《松漠记闻》曰：“回鹘奉释氏最甚，共为一堂，塑佛像其中，每斋必到羊。 或酒酣，以指染血涂佛口，或捧其足而鸣之，谓之亲敬。 诵经则衣袈裟，作西竺语。 ”《大唐西域记》：迦湿弥罗国，旧曰“厨宾”，讹也。 不屠牛羊，但饮其乳。 土人不识雪。 岁二熟麦。 盛夏置锡器于沙中，寻即熔铄。 马粪堕地沸溢，月光射人如夏日。 其南有大河，冷如冰雪，湍流猛峻，注于南海。 《新唐书地理志》曰：“天竺西境小国五，至提■〈风日〉国。 其国有弥兰大河，一曰新头河，自北渤昆山来，西流至提■〈风日〉国，北入于海。 ”《职方外纪》曰：“东印度有大河，名安日。 国人谓经此水一浴，所作罢业，悉得消除。 ” 土多甘蔗，取其液酿酒、熬糖。 印度西北行，有可弗叉国。 《元史郭宝玉传》：“辛巳，可弗叉国惟算端罕破乃满国，引兵据挦思干，闻帝将至，弃城南走，入铁门屯大雪山。 宝玉追之，遂奔印度。 ”《旧唐书西戎传》：“波斯国东与吐火罗康国接，北邻突厥之可萨部。 ”按：所云可萨者，盖即今俄罗斯之可萨斯克，此《录》之可弗叉国也。 数千里皆平川，无复丘垤，不立城邑。 《职方外纪》曰：“亚细亚西北之尽境，有大国，曰莫斯哥未亚，东西径万五千里，南北径八千里，中分十六道。 有窝儿加河最大，支河八十，皆以为尾闾，而以七十余口入北高海。 ”《大唐西域记》：“从信度国西南行千五六百里，至阿黠婆翅罗国，国周五千余里。 自阿黠婆翅罗国北行七百余里，至臂多势罗国，属西印度境，国周三千余里。 从此东北行三百余里，至阿黠荼国，属西印度境，国周二千四五百里，国大都城周二十余里，无大君长，役属信度国。 从此东北行九百余里，至伐剌拿国，周四千余里。 复从此西北逾大山，涉广川，历小城邑，行二千余里，出印度境，至漕矩咤国。 ” 民多羊马，以蜜为酿。 此国昼长夜促，羊膊熟，日已复出。 正符《唐史》所载骨利斡国事， 《元史土土哈传》：“钦察去中国三万余里，夏夜极短，日暂没即出。 ”《地理志西北地附录》曰：“邛可剌者，因水为名，附庸于吉利。 吉思去大都二万五千余里，昼长夜短，日没时，炙羊肋熟，东方已曙。 ”即《唐史》所载骨利斡国也。 《新唐书地理志》曰：“仙娥河北岸有富贵城，又正北如东过雪山松桦林及诸泉泊千五百里，至骨利斡。 又西十三日，行至都播部落。 又北六七日，至坚昆部落，有牢山剑水。 骨利斡、都播二部落北有小海，冰坚时马行八日可渡。 海北多大山，其民状貌甚伟，风俗类骨利斡，昼长而夜短。 ”又《回鹘列传》：“骨利斡处瀚海北，胜兵五千。 草多百合。 产良马，首似橐它，驰数百里。 其地北距海，去京师最远。 又北度海则昼长夜短，日入烹羊胛，熟，东方已明，盖近日出处也。 ” 但国名不同，岂非岁时久远，语音讹舛？ 《庶斋老学丛谈》曰：“许献臣佥事说盎吉剌日不落，只一道黑气遮日，煮羊膊熟，日又出也。 保定刘敬之往任断事官，亲见之。 ”此亦符《唐史》骨利斡国事，但地名又不同，或有沿革。 观此，则日月不出入乎地中，绕北极之下以为昼夜，信而有证。",
      "translated_text": "The land abounds with Buddhist statues. *The Western Journey Record* states: \"Qishimi to the west is where the robe and bowl of Śākyamuni were transmitted.\" *Records Heard in Songmo* notes: \"The Uyghurs revere Buddhism most devoutly. They gather in a hall, sculpting Buddha images within. For every fast, they must slaughter sheep. When drunk, they dip their fingers in blood to anoint the Buddha’s mouth, or lift its feet to their lips, calling this ‘intimate reverence.’ When reciting scriptures, they don robes and chant in the language of Western India.\"\n\n*The Great Tang Records on the Western Regions* records: The state of Kashmir, formerly miswritten as \"Chubin.\" They do not slaughter cattle or sheep but drink their milk. The locals have never seen snow. Wheat ripens twice a year. In midsummer, tin vessels placed in the sand soon melt. Horse dung falling to the ground boils and bubbles. Moonlight shines as brightly as summer sunlight. To its south flows a great river, cold as ice, its torrents fierce and swift, emptying into the Southern Sea.\n\n*The New Tang History: Treatise on Geography* states: \"Five small states lie on the western frontier of India, extending to the state of Tifengri. Within its borders flows the great river Maitrā, also called the Sindhu, which rises from the northern Mount Bökün, flows west to Tifengri, then north into the sea.\"\n\n*Chronicles of the World Beyond the Administrative Regions* says: \"In Eastern India flows a great river named the Ganges. The people believe that bathing in its waters washes away all past misdeeds.\"\n\nThe land yields abundant sugarcane, from which they extract juice to brew wine and refine sugar. Traveling northwest from India, one reaches the state of Kefucha.\n\n*The History of the Yuan: Biography of Guo Baoyu* records: \"In the year xinsi, the Sultan of Kefucha conquered the state of Naiman, led his troops to occupy Samarkand, and upon hearing of the Emperor’s approach, abandoned the city and fled south into the Iron Gate Pass, stationing his forces on the Great Snow Mountain. Baoyu pursued them, and they fled further into India.\"\n\n*The Old Tang History: Traditions of the Western Rong* states: \"The state of Persia borders the state of Tuhuoluo and Kang to the east, and to the north lies the Kesa tribe of the Turks.\"\n\nNote: The so-called Kesa is likely the modern Russian Cossack region, corresponding to the Kefucha of this record. For thousands of *li*, the land is a vast plain without hills or mounds, and no cities or towns are established.\n\n*Chronicles of the World Beyond the Administrative Regions* states: \"At the northwesternmost reaches of Asia lies a great state called Muscovy, stretching fifteen thousand *li* from east to west and eight thousand *li* from north to south, divided into sixteen provinces. The Volga River is the largest, with eighty tributaries, all converging as its estuaries, and over seventy mouths empty into the Northern Arctic Sea.\"\n\n*The Great Tang Records on the Western Regions* records: \"Traveling fifteen or sixteen hundred *li* southwest from Sindhu, one reaches the state of Aduobachiluo, which spans over five thousand *li* in circumference. From Aduobachiluo, traveling seven hundred *li* north, one reaches the state of Biduoshiluo, within the borders of Western India, spanning over three thousand *li* in circumference. From there, traveling three hundred *li* northeast, one reaches the state of Aducha, also within Western India, spanning two thousand four or five hundred *li* in circumference. Its capital city measures over twenty *li* in circumference, with no great ruler but subject to the state of Sindhu. From there, traveling nine hundred *li* northeast, one reaches the state of Falana, spanning over four thousand *li* in circumference. Continuing northwest, crossing great mountains, fording broad rivers, passing through small towns and villages for over two thousand *li*, one leaves the borders of India and arrives at the state of Caojuzha.\"\n\nThe people raise many sheep and horses and ferment honey for wine. In this land, days are long and nights short; by the time a sheep’s shoulder is roasted, the sun has risen again. This precisely matches the account of the state of Guliwo in the *Tang History*.\n\n*The History of the Yuan: Biography of Tutuga* records: \"Qincha is over thirty thousand *li* from China. In summer, the nights are extremely short, and the sun sets only briefly before rising again.\"\n\n*The Treatise on Geography: Supplementary Records of the Northwest* states: \"Qiongelie is named after its river and is a vassal of Jili. Jisi is over twenty-five thousand *li* from the Great Capital. Days are long and nights short; when the sun sets, a roasted sheep’s rib is done, and dawn has already broken in the east.\" This is the state of Guliwo recorded in the *Tang History*.\n\n*The New Tang History: Treatise on Geography* states: \"On the north bank of the Xiane River lies the city of Fugui. Traveling directly north and slightly east for fifteen hundred *li*, passing through snow mountains, pine and birch forests, and various springs and lakes, one reaches Guliwo. Thirteen days’ journey further west lies the Dubo tribe. Six or seven days north of that lies the Jiankun tribe, where the Laoshān Mountains and the Jian River are found. North of the Guliwo and Dubo tribes lies a small sea, which can be crossed in eight days by horse when the ice is solid. North of the sea stand many great mountains. The people there are tall and imposing, with customs similar to those of Guliwo—days are long and nights short.\"\n\n*The New Tang History: Traditions of the Uyghurs* records: \"Guliwo lies north of the Han Sea, with five thousand warriors. The land abounds with lilies. It produces fine horses, their heads resembling camels’, capable of running several hundred *li*. The land extends north to the sea, the farthest from the capital. Beyond the sea to the north, days are long and nights short; when the sun sets, a roasted sheep’s shoulder is done, and dawn has already broken in the east—this is near the place of sunrise.\"\n\nYet the names of these states differ. Could it be that over the long passage of time, pronunciations have diverged?\n\n*The Collected Talks of the Old Scholar of Shuzhai* states: \"Commissioner Xu Xianchen said that in Anggila, the sun does not set; only a streak of dark qi veils it, and by the time a sheep’s shoulder is cooked, the sun has risen again. Liu Jingzhi of Baoding, who served as a judge, witnessed this himself.\" This also matches the account of Guliwo in the *Tang History*, though the place names differ—perhaps due to changes over time.\n\nFrom this, it is evident that the sun and moon do not rise and set beneath the earth but revolve beneath the North Pole to create day and night, a truth supported by evidence.",
      "overlap_context": "ver.\" *The History of the Han: Treatise on the Western Regions* records: \"The state of Wulei borders Yundu to the north.\" Yan Shigu notes: \"Yundu is Shendu or Tiandu. These are all the same name, differing only in pronunciation.\" Minister Zhao Shaonan observes: \"Tiandu is Tianzhu. The Tianzhu of *The History of the Later Han* corresponds to the Yundu of this *Treatise*, and later generations also call it the country of India.\" Its script and pronunciation differ from those of the Buddhist lands.",
      "start_char": 8057,
      "end_char": 9319,
      "start_sentence": 394,
      "end_sentence": 448,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.80531167984009,
      "metadata": {
        "source_file": "dao\\藏外\\西游录注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "寻思干去中原几二万里，印度去寻思干又等，可弗叉去印度又等， 《西使记》曰：“《新唐书》载：‘拂菻去京师四万里，在西海上。 ’所产珍异之物，与今日：道里正同，盖无疑也。 ” 虽萦迂曲折，不为不远，不知几万里也。 《双溪集丁零诗》注：“圣朝太宗尝诏和瑞等入北海，往复数年，得日不落之山。 ” 俞浩《西域考古录》引《西游录》： 戊寅春三月，出云中，抵天山，涉大碛，逾沙漠，达行在所。 明年，大举西伐，道过金山。 时方盛夏，雪凝冰积，斫冰为道，松桧参天，花草弥谷。 金山而西，水皆西流入海。 其南有回鹘城，名别石把，有唐碑。 所谓瀚海军也（卷十引）。 俞注云：“《唐书回鹘传》云：‘回鹘之亡，其遗帐伏山林间，狙盗诸蕃以自给。 懿宗时，大酋仆固俊自北庭击吐蕃，斩尚恐热，传首京师。 于是西庭二州俱恢复，遣使请命于朝，其后史亡其传。 然其国卒不振，时以羊马至边互市’云。 此回鹘五城之所由也。 瀚海军在北庭，景龙初，郭元振所置。 别石把，即别失八里之转。 元有别失八里行中书省。 ” 瀚海去城数百里，海中有屿，其上皆禽鸟所落羽毛。 城西二百里，有轮台县，唐碑在焉。 城之南五百里，有和州，即唐之高昌，亦名伊州。 李注云：“《西域图志》曰：‘唐伊州为今哈密。 ’又曰：‘今镇西府，古伊州。 辟展，古高昌。 ’”",
      "translated_text": "Pursuing this line of thought, Xunsiqan lies nearly twenty thousand *li* from the Central Plains, while India is equally distant from Xunsiqan, and Fu cha is again equally distant from India. *The Western Envoy’s Record* states: \"The *New Tang History* records: ‘Fulin lies forty thousand *li* from the capital, upon the Western Sea.’ The rare and wondrous goods it produces align precisely with those of today in terms of distance—there can be no doubt of this.\" Though the route winds and twists, it is undeniably remote, spanning countless tens of thousands of *li*.\n\nThe annotation to the *Shuangxi Collection*’s poem \"Dingling\" notes: \"During the reign of the sagely Taizong of our dynasty, an edict was issued to He Rui and others to enter the Northern Sea. After several years of travel, they reached the Mountain of the Unsetting Sun.\"\n\nYu Hao’s *Archaeological Records of the Western Regions* cites the *Record of Western Travels*: \"In the spring of the *wuyin* year, we departed from Yunzhong, reached the Celestial Mountains, crossed the great desert, traversed the shifting sands, and arrived at the imperial encampment. The following year, a grand western expedition was launched, passing through the Golden Mountains. It was midsummer, yet snow congealed and ice accumulated, so we hewed a path through the ice. Pines and cypresses soared into the heavens, while flowers and grasses filled the valleys. West of the Golden Mountains, all waters flowed westward into the sea. To its south lay a Uyghur city named Bieshiba, where a Tang stele stood—this was the Hanhai Garrison (cited in juan ten).\"\n\nYu’s annotation explains: \"The *Tang History: Uyghur Annals* states: ‘After the fall of the Uyghurs, their remnants took refuge in the mountains and forests, living as bandits among the various tribes. During the reign of Emperor Yizong, the great chieftain Pugu Jun struck north from Beiting, beheaded Shang Kongre, and sent his head to the capital. Thereupon, the two prefectures of Xiting were both recovered, and envoys were dispatched to submit to the court. Later, their history was lost to record. Yet their state never recovered, and they continued to trade sheep and horses at the frontier.’ This is the origin of the Uyghurs’ Five Cities. The Hanhai Garrison was established in Beiting by Guo Yuanzhen at the beginning of the Jinglong era. Bieshiba is a corruption of Bieshibali. During the Yuan, there was a Branch Secretariat of Bieshibali.\"\n\nSeveral hundred *li* from the city lies the Hanhai Sea, within which is an islet entirely covered in feathers shed by the birds that alight there. Two hundred *li* west of the city stands Luntai County, where a Tang stele remains. Five hundred *li* to the city’s south lies Hezhou, which was Tang’s Gaochang and is also called Yizhou.\n\nLi’s annotation notes: \"The *Illustrated Gazetteer of the Western Regions* states: ‘Tang’s Yizhou is today’s Hami.’ It also says: ‘Today’s Zhenxi Prefecture is ancient Yizhou. Pizhan is ancient Gaochang.’\"",
      "overlap_context": " sun does not set; only a streak of dark qi veils it, and by the time a sheep’s shoulder is cooked, the sun has risen again. Liu Jingzhi of Baoding, who served as a judge, witnessed this himself.\" This also matches the account of Guliwo in the *Tang History*, though the place names differ—perhaps due to changes over time.\n\nFrom this, it is evident that the sun and moon do not rise and set beneath the earth but revolve beneath the North Pole to create day and night, a truth supported by evidence.",
      "start_char": 9321,
      "end_char": 9875,
      "start_sentence": 449,
      "end_sentence": 478,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.473535776138306,
      "metadata": {
        "source_file": "dao\\藏外\\西游录注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "考《元和郡县志》、《太平寰宇记》，唐北庭都护府所管三军，防制突骑施坚昆，统瀚海天山伊吾瀚海军，在城内兵一万二千人，是也（同上）。",
      "translated_text": "Examining the *Yuanhe Junxian Zhi* and the *Taiping Huanyu Ji*, the Tang’s Beiting Protectorate-General commanded three armies to defend against the Türgesh and the Kirghiz. It oversaw the Hanhai, Tianshan, Yiwu, and Hanhai Armies, with a garrison of twelve thousand troops stationed within the city (as above).",
      "overlap_context": "he Hanhai Sea, within which is an islet entirely covered in feathers shed by the birds that alight there. Two hundred *li* west of the city stands Luntai County, where a Tang stele remains. Five hundred *li* to the city’s south lies Hezhou, which was Tang’s Gaochang and is also called Yizhou.\n\nLi’s annotation notes: \"The *Illustrated Gazetteer of the Western Regions* states: ‘Tang’s Yizhou is today’s Hami.’ It also says: ‘Today’s Zhenxi Prefecture is ancient Yizhou. Pizhan is ancient Gaochang.’\"",
      "start_char": 9876,
      "end_char": 9942,
      "start_sentence": 479,
      "end_sentence": 479,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 2.4706201553344727,
      "metadata": {
        "source_file": "dao\\藏外\\西游录注.txt",
        "category": "藏外"
      }
    }
  ]
}