{
  "source_id": "许真君玉匣记",
  "source_file": "chunked_daozang\\许真君玉匣记.json",
  "total_chunks": 3,
  "total_original_chars": 2423,
  "total_translated_chars": 14647,
  "total_translation_time": 69.13080501556396,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏续道藏\\许真君玉匣记.txt",
    "category": "正统道藏续道藏"
  },
  "full_translation": "**The Jade Casket Record of Lord Xu the Perfected**\n\n**Title:** *The Jade Casket Record of Lord Xu the Perfected*\n**Author:** Unknown\n**Three chapters in one scroll.**\n**Source of the base text:** *Wanli Continuation of the Daoist Canon*\n\n**Preface to *The Jade Casket Record***\n\n*The Jade Casket Record* was composed by Lord Xu the Perfected of Jingyang. In former times, the Perfected One saved the people through the Dao, transmuting tiles into gold to relieve the debts of the common folk, placing talismans in water to cure their illnesses, slaying the great serpent in Shangliao, and beheading the venomous *shen* in Jiangxi. His merits and virtues were vast and boundless, beyond full recounting. Yet even after ascending to immortality with his entire household, his compassion for saving the world remained unwavering.\n\nHe observed how those who prayed and performed exorcisms often violated the prohibitions of Heaven and Earth, thereby inviting calamities and unrest. He reflected: \"The Most High cherishes life as virtue, and the common people establish fasts and offer sacrifices to repent for transgressions and seek blessings. Yet, unaware of the prohibitions, they instead incur misfortune.\" Moved by pity, he personally examined the celestial registers, meticulously distinguishing the cyclical signs, fortunes, misfortunes, and omens of each day and hour, and disseminated this knowledge to the world. Thus, the countless multitudes with karmic affinity, whether praying or exorcising, might know how to avoid misfortune and pursue good fortune, ascending together into the realm of longevity.\n\nThe Perfected One’s intent herein reflects the heart of the Most High. Recently, the Daoist adept Ni Shouzhen of Gusou obtained this text from an extraordinary person and, receiving it with reverence and faith, feared that few would encounter it. He wished to have it printed to broaden its transmission, and thus I compose this preface.\n\nNow, the fortunes, misfortunes, calamities, and blessings of humankind are fundamentally ordained by Heaven. Without delving into the principles of creation and transformation, one cannot thoroughly investigate and comprehend them. Only the sage can accept them, the worthy can understand them, while the rest of the multitude, unable to know or accept them, may tread upon the mechanisms of misfortune, violate the celestial prohibitions, and—though seeking to repent and atone—repeatedly err, thereby incurring even graver transgressions against Heaven’s taboos. This is why *The Jade Casket Record* was composed.\n\nShouzhen, having obtained it, did not keep it for himself but transmitted it to others. If people know to employ the auspicious and avoid the inauspicious, thereby evading harm in this world, his merit and conduct shall indeed be vast. For those who aspire to the Dao, if they can receive and apply this text with reverence and faith, using it to exorcise calamities, repent for transgressions, request blessings, and prolong life, their good fortune shall surely be assured.\n\nWritten on the first day of the fourth lunar month in the summer of the *guichou* year of the *Longji* reign, the eighth year of Xuande (1433), by Wu Zijin of the *Gengbi* Studio.\n\n**Note within the Record:** The days of *wuzi* and *wuchen* are deemed usable.\n**Respectfully noted.**\n\n*The Divine Empyrean Jade Instructions* and *The Celestial Statutes of the Lady of Azure* record: On the six *wu* days, one must not burn incense—does this mean prayers and supplications for the dead are forbidden? Lord Yi must have received specific teachings on this; those who understand should exercise careful discernment.\n\n*Master Xu’s Jade Casket Record*\nThe Perfected Lord observed that people of the world, when performing blessings to fulfill vows—offering memorials, presenting petitions, holding fasts, or conducting jiao rites—sometimes meet with misfortune or fortune, bringing either blessings or calamity. There are households that, despite performing blessings, suffer repeated disasters, even the ruin and dispersal of their descendants. How could this be?\n\nThe Perfected Lord examined the celestial archives and reviewed the registers. He found that the fault lay with the green-tally masters, who sought only the five fortunes and benefits, disregarding the Six Jia spirits of their ancestors in their lifetimes. They did not know that during the Six Jia cycles, the celestial luminaries might be in the underworld or among mortals, thus causing those who received blessings to suffer misfortune instead.\n\nThe Perfected Lord thereupon recorded these findings, naming them *The Jade Casket Record*, and entrusted them to the National Preceptor. The Daoist priests presented them to the throne, revealing the principles of fortune and misfortune. This method, regardless of whether the obstruction lies with heaven, earth, spirits, or ghosts, allows one to discern good and ill fortune by examining the Six Jia cycles.\n\n**Jiazi and Yichou days:** All spirits are on earth. If one seeks blessings, conducts jiao rites to fulfill vows, prays for sons or daughters, the fortune received will be tenfold. This is because the Calculating Star (Jidu) is in the heavens to receive blessings. If one performs blessings on these days, it is an extremely auspicious omen.\n\n**Bingyin day:** All spirits are in heaven. If one seeks blessings, fulfills vows, or performs sacrifices to mountains and rivers, or summons souls to substitute for the living, they will instead suffer misfortune. Using this day for blessings brings great inauspiciousness.\n\n**Dingmao, Wuchen, and Jisi days:** All spirits are on earth. If one seeks blessings, presents memorials, performs sacrifices, summons souls to substitute for the living, conducts jiao rites to pray for sons or daughters, or petitions to avert calamities, the fortune received will be tenfold. Using these three days brings great auspiciousness.\n\n**Gengwu and Xinwei days:** All spirits are in heaven, offering prayers, while the stone carriages are in the underworld. If one seeks blessings, performs sacrifices to fulfill vows, presents memorials, or petitions, the master of the household will suffer illness. Great inauspiciousness.\n\n**Renshen day:** All spirits are in heaven, with some stationed in the underworld. If one seeks blessings, performs sacrifices, presents memorials, or prays for sons or daughters, the fortune received will be tenfold. Extremely auspicious.\n\n**Guiyou day:** Sacrifices to the river and lake officials bring great auspiciousness. Other forms of seeking blessings are inauspicious.\n\n**Jiaxu and Yihai days:** All spirits are in heaven, not among mortals or in the underworld. If one seeks minor blessings or makes vows at the household gate, the spirits will descend but bring misfortune instead. If the gate rites are performed during the *chen* hour, it will be auspicious.\n\n**Bingzi, Dingchou, and Wuwu days:** All spirits are dispersed. The celestial offices pursue matters at the household gate, while the Western River’s stone carriages transport sand to the shore. If one seeks blessings, they will instead suffer unexpected disasters and even homicide. Three days of great inauspiciousness.\n\n**Jimao and Gengchen days:** All spirits descend to the underworld. If one seeks blessings, it will benefit descendants, bringing glory, wealth, and nobility. This day is chosen by heaven for birthdays, and those born on it will enjoy great auspiciousness for forty-four days.\n\n**Xinsi day:** All spirits are in heaven, constructing river embankments and transporting earth and stone for pagodas. They labor without rest for two or three days. If one seeks blessings, three generations will perish, descendants will fall into poverty and dispersal, and legal troubles will arise. Great inauspiciousness.\n\n**Renwu and Guiwei days:** All spirits are in heaven. If one seeks blessings, the master of the household will die within two years, fields will yield no harvest, and disputes or legal troubles will arise. Sacrifices will cause people to drown, and wind and fire disasters will strike. Great inauspiciousness.\n\n**Jiashen and Yiyou days:** All spirits descend from heaven to the underworld and the mortal realm. If one seeks blessings, performs sacrifices to fulfill vows, presents memorials, petitions, repays heaven and earth, or prays to avert disasters, the fortune received will be tenfold. Extremely auspicious.\n\n**Bingxu and Dinghai days:** All spirits descend from heaven to the underworld and the mortal realm. If one seeks blessings, performs sacrifices to fulfill vows, presents memorials, or petitions, these two days are extremely auspicious.\n\n**Wuzi and Jichou days:** All spirits are in heaven and the underworld. If one seeks blessings, performs sacrifices to fulfill vows, or repays kindness, it is greatly auspicious. But if one curses heaven and earth, it brings great inauspiciousness, and no expiation will be possible.\n\n**Gengyin day:** All spirits are in heaven, reviewing the ledgers. If one seeks blessings, presents petitions, performs sacrifices to fulfill vows, it will cause people to drown, harm the master, and bring great inauspiciousness.\n\n**Xinmao day:** All spirits are in the underworld. If one makes minor vows, summons souls to substitute for the living, or holds feasts for the deceased, small offerings may be used. It is moderately auspicious.\n\n**Renchen and Guisi days:** All spirits are in heaven, dispatched to audit the registers of life and death. If one seeks blessings or performs sacrifices, it will bring illness, harm neighbors, and kill the master. Great inauspiciousness.\n\n**Jiazi day:** All spirits descend universally among mortals. If one seeks blessings, presents memorials, petitions, or petitions to repay the Five Earth and Soil Officials, or petitions to the Perfected Lord of Life-Recording and Repentance, the fortune received on this day will be tenfold, greatly benefiting descendants. Extremely auspicious.\n\n**Yiwei day:** All spirits are in heaven. If one performs blessings, it is slightly auspicious but not fully effective.\n\n**Bingshen, Dingyou, and Wuxu days:** All spirits are before the Jade Emperor’s hall in heaven, compiling the registers of life and death, recording the karmic causes of good and evil, fortune and misfortune for all people in heaven and earth. If one seeks blessings or performs sacrifices, it brings great inauspiciousness.\n\n**Jihai day:** All spirits descend from the Jade Emperor to the mortal realm and the underworld. If one performs sacrifices to seek blessings, presents memorials, petitions, or summons souls to substitute for the living, the master of the household will enjoy long life. Extremely auspicious.\n\n**Gengzi and Xinchou days:** All spirits are in heaven. If one seeks blessings or performs sacrifices, it will bring illness, epidemics, and later homicide. Misfortune will manifest within ten years. Great inauspiciousness.\n\n**Renyin and Guimao days:** The registers of karmic accounts are recorded. If one seeks blessings, makes vows, or offers thanks to heaven, earth, the human realm, and the six livestock, all affairs shall be greatly auspicious.\n\n**Jiachen day:** All spirits are in the heavenly palace. Seeking blessings brings great inauspiciousness.\n\n**Yisi day:** All spirits are in the human realm and the underworld. If one seeks blessings, performs sacrifices to fulfill vows, or petitions the River and Lake Water Officials, blessings shall be tenfold. Greatly auspicious.\n\n**Bingwu day:** All spirits are in heaven, not in the mortal realm. Seeking blessings brings great inauspiciousness.\n\n**Dingwei day:** All spirits are in the underworld. If one seeks blessings, fulfills vows, or presents memorials, it is greatly auspicious.\n\n**Wushen day:** All spirits are in heaven, neither in the mortal realm nor the underworld. Those who seek blessings or fulfill vows shall harm the household’s elder, kill teachers or masters, and bring great inauspiciousness.\n\n**Jiyou day:** Heaven grants universal amnesty. If one seeks blessings and advances fields and silkworms, it is greatly auspicious.\n\n**Gengxu and Xinhai days:** All spirits are in heaven. Performing blessings for the River and Lake Daoist envoys or minor prayers brings half-auspiciousness. But if one presents memorials or petitions, it brings great inauspiciousness, inviting calamity and requiring exorcism.\n\n**Renzi and Guichou days:** All spirits are in the heavenly palace. If one seeks blessings, fulfills vows, presents memorials, or petitions, it shall kill people, harm fields and silkworms. Using this day brings great inauspiciousness.\n\n**Jiayin and Yimao days:** All spirits are in the mortal realm and the underworld. Seeking blessings, presenting memorials, petitioning to repay kindness, fulfilling vows, giving thanks, extending life, or transcending calamity brings great auspiciousness.\n\n**Bingchen, Dingsi, Wuwu, and Jiwei days:** All spirits are in heaven. If one seeks blessings or performs sacrifices, it invites misfortune to households, harms the six livestock, and brings great inauspiciousness for four days.\n\n**Gengshen day:** The Five Blessings open the Dao, and all spirits worshipped under heaven descend in attendance upon the Jade Emperor. This day opens the Gate of Heaven. Performing blessings, sacrifices, two-year rituals, or preparing Water and Land Masses, presenting memorials, or petitions brings great auspiciousness.\n\n**Xinyou day:** All spirits descend from the Jade Emperor to the mortal realm and the underworld. If one seeks blessings, it brings great inauspiciousness.\n\n**Renxu and Guihai days:** These are the days of the Six Exhausted Spirits. Praying for blessings or fulfilling vows in the mortal realm shall bring orphanhood, widowhood, and poverty. Great inauspiciousness.\n\nThe above records compile the auspicious and inauspicious days within the six *jia* cycles.\n\nThe Perfected Lord again addressed the Jade Emperor: \"In the *Jade Casket Record*, if one encounters days of quarrelsome speech, days of destruction, the Four Killing Spirits, or days of obstructed death, how should this be understood?\"\n\nThe Jade Emperor replied: \"Regardless of such circumstances, as long as the spirits of heaven, earth, the Three Realms, and the underworld descend to the mortal realm, and the Five Blessings align, all days—without exception—are omens of great auspiciousness.\"\n\nThe Perfected Lord bowed again and received the teaching, which was disseminated to the world so that those who aspire to the Dao might follow its instructions.\n\nHere ends the *Jade Casket Record* of Master Xu.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "许真君玉匣记 经名：许真君玉匣记。 撰人不详。 三篇同卷。 底本出处：《万历续道藏》。 许真君玉匣记序 《玉匣记》者，旌阳许真君之所着也。 真君昔以道济人，化瓦为金以输民之通负，置符於水愈人之疾，诛巨蟒於上辽，馘毒蜃於江西。 功德溥博，未可具述，及其拔宅上仙，而救世之心倦倦不已。 见人之祈禳者，触犯天地禁忌，致生灾殃，连锦不宁。 若曰：太上以好生为德，而下民建斋设醮，本以谢过缴福，惟不知禁忌，反受殃咎。 乃恻然怜之，躬考天曹簿籍，日辰甲子，福祸灾祥，毫分缕析，流传於世。 俾亿兆有缘，或祈或禳，庶知避凶趁吉，同跻寿域。 真君是心，盖亦太上之心也。 近姑苏道友倪守真，得之於异人，受而敬信之。 犹虑见闻者少，欲授诸梓，以广其传礼，予为之序。 惟夫人之福祸灾祥，固本於天，非探知造化之理者，不能细究而明之。 惟圣人能安之，贤人能知之，其余众人，不得知而安也。 则有蹈祸机，触禁网，虽欲忏悔首谢而复误，罹天忌业又甚焉，此《玉匣记》之所县以作也。 守真得之，不以自秘，而又传之人。 人知吉焉，而用凶焉，而避免戾於斯世，其功行不亦溥乎。 慕道之士，诚能礼信而用之。 於以禳灾谢过，于以请福延生，其福庆必有所归矣。 宣德八年龙集癸丑夏四月朔旦，耕笔斋吴子谨书序。 记内以戊子、戊辰为可用。 谨按",
      "translated_text": "**The Jade Casket Record of Lord Xu the Perfected**\n\n**Title:** *The Jade Casket Record of Lord Xu the Perfected*\n**Author:** Unknown\n**Three chapters in one scroll.**\n**Source of the base text:** *Wanli Continuation of the Daoist Canon*\n\n**Preface to *The Jade Casket Record***\n\n*The Jade Casket Record* was composed by Lord Xu the Perfected of Jingyang. In former times, the Perfected One saved the people through the Dao, transmuting tiles into gold to relieve the debts of the common folk, placing talismans in water to cure their illnesses, slaying the great serpent in Shangliao, and beheading the venomous *shen* in Jiangxi. His merits and virtues were vast and boundless, beyond full recounting. Yet even after ascending to immortality with his entire household, his compassion for saving the world remained unwavering.\n\nHe observed how those who prayed and performed exorcisms often violated the prohibitions of Heaven and Earth, thereby inviting calamities and unrest. He reflected: \"The Most High cherishes life as virtue, and the common people establish fasts and offer sacrifices to repent for transgressions and seek blessings. Yet, unaware of the prohibitions, they instead incur misfortune.\" Moved by pity, he personally examined the celestial registers, meticulously distinguishing the cyclical signs, fortunes, misfortunes, and omens of each day and hour, and disseminated this knowledge to the world. Thus, the countless multitudes with karmic affinity, whether praying or exorcising, might know how to avoid misfortune and pursue good fortune, ascending together into the realm of longevity.\n\nThe Perfected One’s intent herein reflects the heart of the Most High. Recently, the Daoist adept Ni Shouzhen of Gusou obtained this text from an extraordinary person and, receiving it with reverence and faith, feared that few would encounter it. He wished to have it printed to broaden its transmission, and thus I compose this preface.\n\nNow, the fortunes, misfortunes, calamities, and blessings of humankind are fundamentally ordained by Heaven. Without delving into the principles of creation and transformation, one cannot thoroughly investigate and comprehend them. Only the sage can accept them, the worthy can understand them, while the rest of the multitude, unable to know or accept them, may tread upon the mechanisms of misfortune, violate the celestial prohibitions, and—though seeking to repent and atone—repeatedly err, thereby incurring even graver transgressions against Heaven’s taboos. This is why *The Jade Casket Record* was composed.\n\nShouzhen, having obtained it, did not keep it for himself but transmitted it to others. If people know to employ the auspicious and avoid the inauspicious, thereby evading harm in this world, his merit and conduct shall indeed be vast. For those who aspire to the Dao, if they can receive and apply this text with reverence and faith, using it to exorcise calamities, repent for transgressions, request blessings, and prolong life, their good fortune shall surely be assured.\n\nWritten on the first day of the fourth lunar month in the summer of the *guichou* year of the *Longji* reign, the eighth year of Xuande (1433), by Wu Zijin of the *Gengbi* Studio.\n\n**Note within the Record:** The days of *wuzi* and *wuchen* are deemed usable.\n**Respectfully noted.**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 535,
      "start_sentence": 0,
      "end_sentence": 25,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.975216388702393,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\许真君玉匣记.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "《神霄玉诀》及《女青天律》载：六戊日不可烧香，死祝祈梼乎？ 意真君必有所授，知者宜慎择之可也。 许真君玉匣记 真君见世人作福酬愿，拜表上章，建斋设醮，或凶或吉，作福作祸。 有人家作福，重生灾祸，破散子孙者，此事不知如何？ 真君考於天曹案内，检簿看之。 盖绿片师只取五福利者，超先祖六甲在日，不知六甲旬中，天曜或在地府，或在人间，致令受生殃祸。 真君遂乃录之，名曰《玉匣记》，付国师。 道士奏闻，见其祸福，其法不问天隔、地隔、神隔、鬼隔，看此六甲旬中，并知吉凶也。 甲子、乙丑日，诸神在地。 若人求福，设醮还愿，求男乞女，收福十倍。 皆得计都星在天上受福，若人作福，大吉之兆也。 丙寅日，诸神在天。 若人求福还愿，祭杞山川，召魂代命，返受其殃。 如用此日作福，大凶。 丁卯、戊辰、己巳日，诸神在地。 若人求福，拜表祭祀，召魂代命，设醮求男乞女，度厄拜章，收福十倍。 用此三日，大吉利。 庚午、辛未日，诸神在天祷，辈石下在地府。 若人求福，祭祀还愿，奏章拜表，主人疾病，大凶。 壬申日，诸神在天，止於地府。 若人求福祭祀，上表拜表，求男乞女，收福十倍，大吉利。 癸酉日，祭祀河泊水官，用之大吉，其余求福者凶也。 甲戌、乙亥日，诸神在天，不在人间地府。 若人小求福，门首立愿，即得神下，却受其殃。 其门首用辰时，则吉利。 丙子、丁丑、戊寅日，诸神破，天曹追上门，西河辇石，运砂直岸。 若人求福，返诸横祸及杀人，三日大凶也。 己卯、庚辰日，诸神下地府。 若人求福，利益子孙，荣华富贵。 此日天择生日，得四十四日生大吉。 辛巳日，诸神在天问，作河运石土塔，二三日在彼，不歇辛苦。 若人求福，即死三代，子孙穷之进散，主官事，大凶。 壬午、癸未日，诸神在天。 若人求福，先持二年后，主人死，田蚤不收。 又口舌官事，不可祭祀，令人落水，主风火之难，大凶。 甲申、乙酉日，诸神在天，降下地府人间。 若人求福，祭祀还愿，上表拜章，答天地，祈禳灾祸，收福十倍，大吉利。 丙戌、丁亥日，诸神在天，降下地府人间。 若人求福，祭杞还愿，拜表上章，此二日大吉。 戊子、己丑日，诸神在天问地府。 若人求福祭祀，了愿酬恩，大吉。 若咒咀天地，大凶，解释不得。 庚寅日，诸神在天，会算簿案。 若人求福，笺奏祭祀了愿，令人落水，死损师人，大凶。 辛卯日，诸神在地府。 若人小小立愿，召魂代命，设赛先亡，饮食小可，用之平，吉利也。 壬辰、癸巳日，诸神在天，系使元时，勘会生死文簿。 若人求福祭祀，主疾病，损邻舍，杀师人，大凶。 甲子日，诸神普降人间。 若人求福，上章进词表补，谢五土社官，许福表忏注生真君。 其日收福，大利十倍，利益子孙，吉利。 乙未日，诸神在天。 若人作福不得，小吉。 丙申、丁酉、戊戌日，诸神在天玉帝殿前，造合死文簿，注天上天下万民罪福善恶因缘。 若人求福祭祀，大凶。 己亥日，诸神在天，从玉皇差降人问地府。 若祭杞求福，上章拜表，召魂代命，主人寿长，大吉利。 庚子、辛丑日，诸神在天。 若人求福祭祀，主见疾病瘟疫之灾，后杀人，十年见祸，大凶。",
      "translated_text": "*The Divine Empyrean Jade Instructions* and *The Celestial Statutes of the Lady of Azure* record: On the six *wu* days, one must not burn incense—does this mean prayers and supplications for the dead are forbidden? Lord Yi must have received specific teachings on this; those who understand should exercise careful discernment.\n\n*Master Xu’s Jade Casket Record*\nThe Perfected Lord observed that people of the world, when performing blessings to fulfill vows—offering memorials, presenting petitions, holding fasts, or conducting jiao rites—sometimes meet with misfortune or fortune, bringing either blessings or calamity. There are households that, despite performing blessings, suffer repeated disasters, even the ruin and dispersal of their descendants. How could this be?\n\nThe Perfected Lord examined the celestial archives and reviewed the registers. He found that the fault lay with the green-tally masters, who sought only the five fortunes and benefits, disregarding the Six Jia spirits of their ancestors in their lifetimes. They did not know that during the Six Jia cycles, the celestial luminaries might be in the underworld or among mortals, thus causing those who received blessings to suffer misfortune instead.\n\nThe Perfected Lord thereupon recorded these findings, naming them *The Jade Casket Record*, and entrusted them to the National Preceptor. The Daoist priests presented them to the throne, revealing the principles of fortune and misfortune. This method, regardless of whether the obstruction lies with heaven, earth, spirits, or ghosts, allows one to discern good and ill fortune by examining the Six Jia cycles.\n\n**Jiazi and Yichou days:** All spirits are on earth. If one seeks blessings, conducts jiao rites to fulfill vows, prays for sons or daughters, the fortune received will be tenfold. This is because the Calculating Star (Jidu) is in the heavens to receive blessings. If one performs blessings on these days, it is an extremely auspicious omen.\n\n**Bingyin day:** All spirits are in heaven. If one seeks blessings, fulfills vows, or performs sacrifices to mountains and rivers, or summons souls to substitute for the living, they will instead suffer misfortune. Using this day for blessings brings great inauspiciousness.\n\n**Dingmao, Wuchen, and Jisi days:** All spirits are on earth. If one seeks blessings, presents memorials, performs sacrifices, summons souls to substitute for the living, conducts jiao rites to pray for sons or daughters, or petitions to avert calamities, the fortune received will be tenfold. Using these three days brings great auspiciousness.\n\n**Gengwu and Xinwei days:** All spirits are in heaven, offering prayers, while the stone carriages are in the underworld. If one seeks blessings, performs sacrifices to fulfill vows, presents memorials, or petitions, the master of the household will suffer illness. Great inauspiciousness.\n\n**Renshen day:** All spirits are in heaven, with some stationed in the underworld. If one seeks blessings, performs sacrifices, presents memorials, or prays for sons or daughters, the fortune received will be tenfold. Extremely auspicious.\n\n**Guiyou day:** Sacrifices to the river and lake officials bring great auspiciousness. Other forms of seeking blessings are inauspicious.\n\n**Jiaxu and Yihai days:** All spirits are in heaven, not among mortals or in the underworld. If one seeks minor blessings or makes vows at the household gate, the spirits will descend but bring misfortune instead. If the gate rites are performed during the *chen* hour, it will be auspicious.\n\n**Bingzi, Dingchou, and Wuwu days:** All spirits are dispersed. The celestial offices pursue matters at the household gate, while the Western River’s stone carriages transport sand to the shore. If one seeks blessings, they will instead suffer unexpected disasters and even homicide. Three days of great inauspiciousness.\n\n**Jimao and Gengchen days:** All spirits descend to the underworld. If one seeks blessings, it will benefit descendants, bringing glory, wealth, and nobility. This day is chosen by heaven for birthdays, and those born on it will enjoy great auspiciousness for forty-four days.\n\n**Xinsi day:** All spirits are in heaven, constructing river embankments and transporting earth and stone for pagodas. They labor without rest for two or three days. If one seeks blessings, three generations will perish, descendants will fall into poverty and dispersal, and legal troubles will arise. Great inauspiciousness.\n\n**Renwu and Guiwei days:** All spirits are in heaven. If one seeks blessings, the master of the household will die within two years, fields will yield no harvest, and disputes or legal troubles will arise. Sacrifices will cause people to drown, and wind and fire disasters will strike. Great inauspiciousness.\n\n**Jiashen and Yiyou days:** All spirits descend from heaven to the underworld and the mortal realm. If one seeks blessings, performs sacrifices to fulfill vows, presents memorials, petitions, repays heaven and earth, or prays to avert disasters, the fortune received will be tenfold. Extremely auspicious.\n\n**Bingxu and Dinghai days:** All spirits descend from heaven to the underworld and the mortal realm. If one seeks blessings, performs sacrifices to fulfill vows, presents memorials, or petitions, these two days are extremely auspicious.\n\n**Wuzi and Jichou days:** All spirits are in heaven and the underworld. If one seeks blessings, performs sacrifices to fulfill vows, or repays kindness, it is greatly auspicious. But if one curses heaven and earth, it brings great inauspiciousness, and no expiation will be possible.\n\n**Gengyin day:** All spirits are in heaven, reviewing the ledgers. If one seeks blessings, presents petitions, performs sacrifices to fulfill vows, it will cause people to drown, harm the master, and bring great inauspiciousness.\n\n**Xinmao day:** All spirits are in the underworld. If one makes minor vows, summons souls to substitute for the living, or holds feasts for the deceased, small offerings may be used. It is moderately auspicious.\n\n**Renchen and Guisi days:** All spirits are in heaven, dispatched to audit the registers of life and death. If one seeks blessings or performs sacrifices, it will bring illness, harm neighbors, and kill the master. Great inauspiciousness.\n\n**Jiazi day:** All spirits descend universally among mortals. If one seeks blessings, presents memorials, petitions, or petitions to repay the Five Earth and Soil Officials, or petitions to the Perfected Lord of Life-Recording and Repentance, the fortune received on this day will be tenfold, greatly benefiting descendants. Extremely auspicious.\n\n**Yiwei day:** All spirits are in heaven. If one performs blessings, it is slightly auspicious but not fully effective.\n\n**Bingshen, Dingyou, and Wuxu days:** All spirits are before the Jade Emperor’s hall in heaven, compiling the registers of life and death, recording the karmic causes of good and evil, fortune and misfortune for all people in heaven and earth. If one seeks blessings or performs sacrifices, it brings great inauspiciousness.\n\n**Jihai day:** All spirits descend from the Jade Emperor to the mortal realm and the underworld. If one performs sacrifices to seek blessings, presents memorials, petitions, or summons souls to substitute for the living, the master of the household will enjoy long life. Extremely auspicious.\n\n**Gengzi and Xinchou days:** All spirits are in heaven. If one seeks blessings or performs sacrifices, it will bring illness, epidemics, and later homicide. Misfortune will manifest within ten years. Great inauspiciousness.",
      "overlap_context": "the Dao, if they can receive and apply this text with reverence and faith, using it to exorcise calamities, repent for transgressions, request blessings, and prolong life, their good fortune shall surely be assured.\n\nWritten on the first day of the fourth lunar month in the summer of the *guichou* year of the *Longji* reign, the eighth year of Xuande (1433), by Wu Zijin of the *Gengbi* Studio.\n\n**Note within the Record:** The days of *wuzi* and *wuchen* are deemed usable.\n**Respectfully noted.**",
      "start_char": 535,
      "end_char": 1815,
      "start_sentence": 26,
      "end_sentence": 85,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.39117789268494,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\许真君玉匣记.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "壬寅、癸卯日，记会之簿。 若人求福许愿，谢天地人间六畜，用之百事大吉。 甲辰日，诸神在天宫，求福大凶。 乙巳日，诸神在人问地府。 若人求福，祭祀了愿河泊水官，收福十倍，大吉。 丙午日，诸神在天，不在人间，求福大凶也。 丁未日，诸神在地府。 若人求福，了愿拜章，大吉。 戊申日，诸神在天，不在人间地府。 求福了愿者，损家长，杀师人，大凶。 己酉日，上界天赦。 若人求福，进田蚕，大吉。 庚戌、辛亥日，诸神在天上。 作福，河泊道使，小小祈福，半吉。 如上章拜表，大凶，返受其殃，主禳祸也。 壬子、癸丑日，诸神在天宫。 若人求福了愿，拜章上表，主杀人口，损田蚤，用此日，大凶。 甲寅、乙卯日，诸神在人间地府。 求福上章，拜表酬恩，了愿答谢，延生度厄，大吉。 丙辰、丁巳、戊午、己未日，诸神在天。 若人求福，祭祀人家招祸，损六畜，四日大凶。 庚申日，是五福开道，天下一应祀神降道，皆相玉帝，此日开天门。 作福祭祀二年，神人预修水陆，上章拜表，大吉。 辛酉日，诸神从玉帝差降人间地府。 若人求福，大凶。 壬戌、癸亥日，乃六神穷日。 人间祈福了愿，主孤寡贫穷，大凶。 右前项纂策，六甲旬中吉凶日子已竟。 真君重告玉帝曰：右乃《玉匣记》中，或值赤口白舌、执破日者，四杀神隔受死日者，此言如何？ 玉皇上帝曰：不问如此，只要天上天下及三界众真降人问地府，五福通日，不问值隔，大吉利之兆也。 真君再拜而授之，流传于世，俾慕道之士，依教奉行。 许真君玉匣记竟",
      "translated_text": "**Renyin and Guimao days:** The registers of karmic accounts are recorded. If one seeks blessings, makes vows, or offers thanks to heaven, earth, the human realm, and the six livestock, all affairs shall be greatly auspicious.\n\n**Jiachen day:** All spirits are in the heavenly palace. Seeking blessings brings great inauspiciousness.\n\n**Yisi day:** All spirits are in the human realm and the underworld. If one seeks blessings, performs sacrifices to fulfill vows, or petitions the River and Lake Water Officials, blessings shall be tenfold. Greatly auspicious.\n\n**Bingwu day:** All spirits are in heaven, not in the mortal realm. Seeking blessings brings great inauspiciousness.\n\n**Dingwei day:** All spirits are in the underworld. If one seeks blessings, fulfills vows, or presents memorials, it is greatly auspicious.\n\n**Wushen day:** All spirits are in heaven, neither in the mortal realm nor the underworld. Those who seek blessings or fulfill vows shall harm the household’s elder, kill teachers or masters, and bring great inauspiciousness.\n\n**Jiyou day:** Heaven grants universal amnesty. If one seeks blessings and advances fields and silkworms, it is greatly auspicious.\n\n**Gengxu and Xinhai days:** All spirits are in heaven. Performing blessings for the River and Lake Daoist envoys or minor prayers brings half-auspiciousness. But if one presents memorials or petitions, it brings great inauspiciousness, inviting calamity and requiring exorcism.\n\n**Renzi and Guichou days:** All spirits are in the heavenly palace. If one seeks blessings, fulfills vows, presents memorials, or petitions, it shall kill people, harm fields and silkworms. Using this day brings great inauspiciousness.\n\n**Jiayin and Yimao days:** All spirits are in the mortal realm and the underworld. Seeking blessings, presenting memorials, petitioning to repay kindness, fulfilling vows, giving thanks, extending life, or transcending calamity brings great auspiciousness.\n\n**Bingchen, Dingsi, Wuwu, and Jiwei days:** All spirits are in heaven. If one seeks blessings or performs sacrifices, it invites misfortune to households, harms the six livestock, and brings great inauspiciousness for four days.\n\n**Gengshen day:** The Five Blessings open the Dao, and all spirits worshipped under heaven descend in attendance upon the Jade Emperor. This day opens the Gate of Heaven. Performing blessings, sacrifices, two-year rituals, or preparing Water and Land Masses, presenting memorials, or petitions brings great auspiciousness.\n\n**Xinyou day:** All spirits descend from the Jade Emperor to the mortal realm and the underworld. If one seeks blessings, it brings great inauspiciousness.\n\n**Renxu and Guihai days:** These are the days of the Six Exhausted Spirits. Praying for blessings or fulfilling vows in the mortal realm shall bring orphanhood, widowhood, and poverty. Great inauspiciousness.\n\nThe above records compile the auspicious and inauspicious days within the six *jia* cycles.\n\nThe Perfected Lord again addressed the Jade Emperor: \"In the *Jade Casket Record*, if one encounters days of quarrelsome speech, days of destruction, the Four Killing Spirits, or days of obstructed death, how should this be understood?\"\n\nThe Jade Emperor replied: \"Regardless of such circumstances, as long as the spirits of heaven, earth, the Three Realms, and the underworld descend to the mortal realm, and the Five Blessings align, all days—without exception—are omens of great auspiciousness.\"\n\nThe Perfected Lord bowed again and received the teaching, which was disseminated to the world so that those who aspire to the Dao might follow its instructions.\n\nHere ends the *Jade Casket Record* of Master Xu.",
      "overlap_context": "l spirits descend from the Jade Emperor to the mortal realm and the underworld. If one performs sacrifices to seek blessings, presents memorials, petitions, or summons souls to substitute for the living, the master of the household will enjoy long life. Extremely auspicious.\n\n**Gengzi and Xinchou days:** All spirits are in heaven. If one seeks blessings or performs sacrifices, it will bring illness, epidemics, and later homicide. Misfortune will manifest within ten years. Great inauspiciousness.",
      "start_char": 1816,
      "end_char": 2454,
      "start_sentence": 86,
      "end_sentence": 117,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.764410734176636,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\许真君玉匣记.txt",
        "category": "正统道藏续道藏"
      }
    }
  ]
}