{
  "source_id": "许颠君石函记",
  "source_file": "chunked_daozang\\许颠君石函记.json",
  "total_chunks": 15,
  "total_original_chars": 16863,
  "total_translated_chars": 104642,
  "total_translation_time": 571.1959948539734,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\众术类\\许颠君石函记.txt",
    "category": "众术类"
  },
  "full_translation": "**The Stone Casket Record of Perfected Lord Xu**\n*Title:* *The Stone Casket Record of Perfected Lord Xu*\nTwo fascicles, falsely attributed to Xu Xun. Likely composed during the Southern Song dynasty.\n*Source text:* *Zhengtong Daoist Canon*, *Supplement to the Daoist Canon*.\n\n**Contents of the Stone Casket**\n**Fascicle One**\n- *On the Primordial Essence of the Great Yang*\n- *On the Yin-Yang of Sun and Moon*\n- *On the Mother of Medicines*\n- *On the Right and Wrong of Medicinal Substances*\n- *The Cinnabar Song of Verifying the Dao*\n\n**Fascicle Two**\n- *The Mysterious Pointer to the Sacred Stone*\n- *On the Mysterious Clarity of the Divine Chamber*\n- *On the Void of the Golden Crucible*\n- *On the Rectification of Virtue in the Hall of Light*\n\n**Preface to *The Stone Casket Record of Perfected Lord Xu***\nThe Perfected Lord’s surname was Xu, his given name Xun, and his courtesy name Jingzhi. A native of Runan, his ancestors for generations revered the supreme Dao. In the first year of Taikang of Emperor Wu of the Western Jin (280 CE), he was recommended as a *xiaolian* (filial and incorrupt), but declined the post. The imperial court then extended a formal summons with honors, and the Perfected Lord, unable to refuse, accepted the position of magistrate of Jingyang County in Shu Commandery. Due to the chaos of the age, he resigned his office to enter the Dao, dedicating himself to cultivation. Following the teachings of the Perfected King of Illuminated Filial Dao and the lineage of transcendents who ascend through flight, his merits and conduct were perfected. He captured and slew serpents and miasmic creatures, healed the sick with incantations and talismanic waters, and restored the dead to life—countless were his deeds.\n\nLater, in the second year of Ningkang of Emperor Xiaowu of the Eastern Jin (374 CE), on the first day of the eighth month (jiaxu), at West Mountain in Hongzhou, he received a jade edict from the August Emperor. Together with his household of forty-two souls and all their possessions, he ascended bodily into the heavens, leaving behind a stone casket. He declared: \"As the world changes and the times shift, let this serve as a record for the age.\" Later, Zhang Shou opened the casket and discovered nine secret texts within—these were the Perfected Lord’s supreme methods for refining the golden elixir, titled *The Stone Casket Record*.\n\nXie Guanfu, the Jade Eminence of West Mountain’s Yulong, along with his eminent disciple, the Transcendent-Clad-in-Void Zhu Mingshu, and Zheng Daoquan of Dongjia, transmitted these teachings in succession, passing them down to the present day. This text embodies the mechanism of highest-grade ascent, not some minor path of peripheral elixir arts. Only those with the bones of immortals, who encounter this writing, should treasure and conceal it—do not show it to the unworthy. The vows within these pages are weighty; read with utmost caution!\n\n**The Stone Casket Record of Perfected Lord Xu, Fascicle One**\n*On the Primordial Essence of the Great Yang*\n\nThe Great Dao of the Mysterious Origin is without image or form, yet responsive to nature, manifesting in movement and stillness. Movement is the primordial Yang; primordial Yang is primordial essence, and primordial essence gives birth to true fire. This fire arises in the depths of the Mysterious-Mysterious, separating and uniting to form the hun-soul—thus begins the division of the sun. Its radiance emerges from Fusang, the nine qi congealing into luminous clarity, its ascending light suffusing all beneath heaven. This is the brilliance of Yang illumination, the crimson *li* penetrating the landscape.\n\nIts crystalline splendor shines forth, welling up with dragon-light, coalescing into golden mist. Jade qi and pearlescent hues, auspicious vapors and propitious radiance fill the void. Clouds veil the nine heavens: the sagely conceal their cloud-light, the worthy conceal their cloud-light; gold conceals its cloud-light, jade conceals its cloud-light, pearls conceal their cloud-light, fragrance conceals its cloud-light, blossoms conceal their cloud-light, water conceals its cloud-light, fire conceals its cloud-light. They emit manifold rays, illuminating heaven and earth, scattering mist and trailing hues, dispersing qi to engender the myriad beings.\n\nThe myriad beings begin with the One; the One gives rise to the Two, the Two to the Three, and the Three to the ten thousand things. Both land and water teem with life, beyond all reckoning. Even in the dark yin of filth and muck, within the hardest and most stubborn stones, among mountain crags and grasses, wherever earth takes form—whether creatures fleet of foot or swift of wing, whether fierce demons or malevolent spirits—none is untouched, none is unpervaded.\n\nAmong those that fly are birds that hunt spirits and chase monsters; among those that run are beasts so fierce that ten men cannot withstand them. The largest include camels, oxen, elephants, and horses; the smallest, mustard seeds and tiny insects. Whether rotting and decaying, born from wombs or eggs, moist or dry, all that bears spirit and stirs with life arises from this, proceeds from this. Each receives its nature and assumes its form, its substance shaped by its aspect, its color determined by its place. What is red becomes red, what is black becomes black, what is blue becomes blue, what is white becomes white, what is yellow becomes yellow—such are the transformations of the Five Phases, responsive to their positions, not artificially dyed!\n\nAs for those that bear transformation and nurture hues: \"Bearing transformation\" refers to stones that, sensing qi, transform and give birth to life; \"nurturing hues\" refers to colors ranging from pale white and light yellow to faint red and delicate green, from deep blue and dark black to exotic greens and rare reds, wondrous tints and peerless shades—each attains its own beauty. All are the workings of spirit and the transformations of qi, forming natural essences. Beings receive qi in varying depths, so their colors and appearances are not fixed. They follow the Great Dao, self-transforming—thus it is said: \"form without form,\" \"transformation without transformation.\" This is what is meant by the Dao.\n\nAs the saying goes: in heaven, it hangs as celestial images; on earth, it takes form; in stone, it becomes treasure. When essence gathers, it becomes a jewel, and jewels are radiance. How marvelous! Such is the Great Dao—who can condense the golden blossom?\n\nWhen fire flourishes, it melts metal; when metal is felled, wood flourishes. Wood’s flourishing is the outward display of Yang, its branches spreading, while within it harbors Yin, its blossoms unfolding. The Perfected Lord of Yin says: \"The golden blossom is born—the treasure of heaven and earth. Those who grasp this speak the true and ultimate Dao.\"\n\nIn but a moment, the Dipper turns, celestial images wax and wane. When full, wood thrives and grows deep green; when waning, its blossoms are felled and wither. Why? Because what is first formed by the mutual conquest of Yin and Yang is the culmination of the Dao. When conquered, blossoms scatter and fall like drifting rouge and powder—this is the hun-soul leaping and toying with spirit, the light red flying with the soul’s numen.\n\nRed varies in depth, powder in weight. Where color is deep and essence light, it flies upward in flames, like purple frost beneath a dark canopy, congealing in the crucible as earthly yellow-gold powder. Where color is pale and essence heavy, nurtured, it transforms into golden yellow—this is the fire-nurtured *jiaoshao*, the cinnabar Yang’s bone-transformation.\n\nThe hun-soul follows where the po-soul abides; the po-soul follows where the hun-soul arises. The hun-soul shines with purple blossoms; the po-soul gathers Yang. Gathering Yang, the hun-qi enters the po-soul’s belly, concealing the hun within the po’s abdomen. The qi of sun and moon unite; the dragon exhales, the tiger displays its hues; the tiger inhales the dragon’s light. The two qi swallow and merge, enveloping the four directions, harmonizing the four images, their qi converging at the center.\n\nThus, with the first transformation, qi becomes water; with the second, water becomes cinnabar; with the third, cinnabar becomes mercury; with the fourth, mercury becomes gold; with the fifth, gold becomes the elixir. This elixir gathers the numinous essence of heaven and earth, seizes the radiance of sun and moon, captures the water and fire of Kan and Li, pursues the earth’s po-soul, and unites with the heaven’s hun-soul. Dragon and tiger become cinnabar; the flying bird and running hare become blossoms. Harmonizing their light, they enter the chamber together—only the noble house of the Nine and Five is revered. Whether the medicine is right or wrong in principle, the white tiger and green dragon yield their marrow. From the root and stem sprouts the yellow sprout; gold and silver fill my house.\n\nIf used to save human lives, human lives shall enjoy eternal blossoming. Those who ingest it may soar through the skies and traverse the waters, riding dragons and cranes. There is no other reason—all is the transformation of the Dao.\n\nThe transmutation of the medicine arises when fire attains its numinous function, and the medicine gains spiritual penetration. The Dao harmonizes with nature, and the work achieves its marvel! Someone may ask: in harmonizing the tripod and furnace, one inhales the fat and marrow of the Nine Dragons and the Red Sun—what is the meaning of this? The answer is: lead is the sacred vessel, and vessel and spirit interpenetrate. The vessel is transformed by the spirit, and spirit and vessel unite as one body. Naturally, breath and response correspond—then the spirit follows the inhalation to arrive, radiance pursues the spirit’s brilliance, rosy clouds descend like jade, and crimson drops swiftly fall. The numinous essence ascends and descends, gathered into the Water Palace and Dragon Court, where it is nurtured into purple longevity.\n\nThe true qi of the golden embryo transforms into golden liquid, subtly following creation’s course, and mercury naturally arises. Through the twelve hours, it circulates through *wu* and *ji*, fire divides into the four cardinal directions—thus the two solstices and two equinoxes. The two solstices are *zi*, *wu*, and *chen*; when discussed, they encompass a thousand changes and ten thousand transformations, entering and exiting the void, opening the gate of all wonders, and revealing the primordial medicine of ascension. If one obtains and cultivates it, how could one not achieve longevity, ascend through the clouds, and fly to pay court to the Jade Emperor as a spirit of pure, numinous subtlety? How could this be sought with ease!\n\nThis Dao is truly secret; few alchemists hear of it, and so they drift through the cycles of life and death, far from the Way of immortality. Now, the radiance of the dragon is the essence within fire, clarity emerging from the essence, light arising from clarity, and flame born from light. The fiery flame communicates with the numinous, and its radiance blazes brilliantly. Within it lies golden azure, hollow azure’s round light, vast and boundless, shimmering without end. The radiance of Yu Yi shines forth, the Great Yang’s southern brightness, the Great Yin’s northern darkness—south and north unite, the two spirits meet, male and female harmonize, water and fire aid each other. Water gains fire and generates radiance.\n\nNow, the Great Abyss of Mysterious Splendor is pure blackness, its form hidden and its luster submerged—how could it manifest the mysterious splendor of the black moon? Only by embracing the qi of yang can it generate brightness. As yang accumulates and yin transforms, the years and months take shape. Yang resides in their number, ceaselessly advancing and retreating, thus giving rise to the waxing and waning of fullness and deficiency, ever between the dark and new moons. Darkness arises at the dark moon, brightness at the new moon. Thus, on the third day, yang is born, stirring in the east. The radiance of the Great Yang’s Yu Yi coalesces into brilliance, dwelling in the western position, likened to the formation of splendor. Befriending east and west, the Dao lies in gaining and losing companions—this is called the union of Yu Yi and splendor.\n\nGreat indeed is the radiance of the Great Yang’s Yu Yi! Its luminosity illumines the four corners, returning its light to the center—this is called the Five Virtues. The Five Virtues are the five planets, their light dividing into myriad forms, each gaining subtle brightness. They illuminate the moonlit night, hiding their brilliance at dawn, exchanging radiance between day and night—this is the union of Qian and Kun. The moon contains its light, which is the essence of the sun—this is called the exchange of radiance. Dawn emerges in the east, dusk sets in the west—thus it is called the union of rest.\n\nIf the great elixir does not rely on the exchange of radiance between sun and moon, the union of Qian and Kun, what else could serve as its foundation? It is not the cinnabar and mercury of the human world, nor the five metals and eight minerals—it is the wondrous subtlety of the Great Yang’s mysterious origin. When the flying soul soars and transforms, it becomes the most refined and numinous; when it responds and communicates, it becomes the most divine and sagely. Without the shimmering radiance of Yu Yi, what else could achieve this?\n\nYet the sun and moon circulate above, advancing and retreating, completing the year’s work below. The sun comes and the moon goes, moving south and then north, north and then south—thus the Dao of life and death arises. Death refers to the time after the summer solstice, when the sun reaches the southern limit, yin qi flourishes, and yang qi gradually wanes. The Dao reaches its end and returns to Kun’s origin—this is why the myriad things die, culminating in *hai*. Life refers to the time after the winter solstice, when the sun reaches the northern limit, yang qi gradually grows, and it returns to Qian’s origin, penetrating and achieving benefit and integrity—this is why the myriad things live, culminating in *si*. The sun’s movement between south and north gives rise to the Dao of life and death.\n\nMoreover, the two solstices of winter and summer and the two equinoxes of spring and autumn are the four cardinal directions of heaven and earth. Spring gives birth, summer grows, autumn kills, and winter stores—this is following the yin and yang of heaven and earth to generate the myriad things. Such is the wondrous function of the great returning elixir, which forms a single body.\n\nThis is called modeling heaven and imaging earth, casting the tripod and sealing the furnace. One must choose an auspicious land on a famous mountain to establish the altar and hall. The mountain should be extraordinary and elegant, the land prized for facing the sun. With the tiger’s posture and dragon’s peak, facing mountains and flowing waters, it should often harbor rare birds and strange beasts, conceal treasures and jewels, be far from graves, and have few human traces—naturally attracting fortune and welcoming auspiciousness. Only when born of worthiness and nobility can it serve as a place for refining the elixir.\n\nThe sage embodies heaven’s Dao and models earth’s generation, grasping the sun and seizing the moon, enveloping Qian and Kun. To obtain the essence of the crow, one must first seek the marrow of the hare—this is the symbolic taking of Fu Xi. First civil, then martial, proceeding in accordance with the Dao of the *Yi*! The withdrawal and addition of water and fire depend on numinous skill; wondrous function arises naturally, and yang is born within the golden chamber.\n\nNow, the birth of yang is *fu*; at the *zi* hour, it stirs, and the Yellow Bell responds to the pitch. Yang qi circulates, gradually passing through *lin* and *tai*, until at *si*, Qian’s hardness is exhausted and Kun’s softness arrives. Yin is born at *gou*; at *wu*, it gradually passes through *pi* and *bo*, until Kun’s *hai* nears its end. As the years and months shift, the elixir’s Dao nears completion. The child emerges from the mother’s womb, shedding its fetal form and transforming spiritually.\n\n*Gou* at *wu* is the fire of *Li* giving birth to mercury; *fu* at *zi* is the water of *Kan* giving birth to lead. Mercury congeals because of lead, and lead is subdued because of mercury—this is the longing of mother and child forming the elixir. From the union with nature arises the most refined and wondrous, which cannot be left unconsidered. The key lies in carefully seeking the true oral instructions, awakening to the mysterious penetration, and distinguishing falsehood from truth—only then can it be seen.\n\nHaving grasped the celestial image of the sun and moon suspended in brilliance, the mechanism of myriad transformations, the boundless and inexhaustible flux of generation—those who attain this, how could their longevity not equal heaven and earth? How then could one lightly discuss it with the unworthy!\n\nThus, I have set forth these brief discourses on the Dao, not as a complete treatise, but to distill the essence of these words into a secret register of cinnabar, akin to oral instructions. Hear my admonition: to recklessly transmit this to the unworthy invites swift calamity. Beware! Beware!\n\n**On the Sun and Moon as Female and Male**\n\nThe Southern Florescence reaches its utmost; the golden palace and divine chamber are vast and luminous, enduring through infinite kalpas. The wheel of Mount Sumeru turns without distinction of dawn or dusk; rosy clouds scatter, illuminating both darkness and light. Cycling through ninety myriad millions, it moves with unceasing vigor, spreading qi to enliven all beings. The solar essence is the celestial treasure; dragon radiance shines forth, fiery clouds blaze, and flames flicker with numinous power.\n\nThrough numinous penetration, one attains sageliness—suddenly, the soul soars, luminous and crystalline, suffusing the body with light. The light, ninety thousand leagues in circumference, encircles the golden city. Within the yang cavern, amid the verdant forest of empty azure, the divine dragon transforms; at its heart dwells the golden spirit. The adamantine traces are veiled in dense purple haze; from the purple longevity and purple spirit, radiant clouds arise. Purple longevity gives birth to purple essence, and radiant clouds yield purple numen, emerging in response to the hidden true purple.\n\nThe azure yang and purple pole are supremely true and numinous, perpetuating generation in unbroken succession. The Primordial Beginning and Primordial Crystal—crystal is the unique essence of numinous penetration, while the Primordial Beginning is the origin of all treasures. It transmits the ancestor of the ten thousand qi, the qi that harbors the origin of all things. Qi itself is formless; spirit moves and qi transforms. Above, it weaves through the heavens; below, it interlaces the earth. Their paths intersect like measured degrees, their conjunctions like a shuttle, moving back and forth—southward, then returning north.\n\nThe sun’s path runs south, and the forms of the ten thousand things wane. When its course reaches its limit, the sun turns back to the northern realm, and the ten thousand things respond in concealment. All arise from the black and red paths, intersecting the yellow path as they traverse south and north.\n\nOne who can observe the Dao of heaven and grasp the movements of heaven may summon and gather dragon crystal and tiger essence, feeding on rosy clouds. This requires the craft of the mysterious gate and the skill to refine the golden crucible. In harmonizing, one steals from the void of yin and yang, naturally forming substance. What exists in the void? What image follows its generation?\n\nIn the hidden yin, lead virtue is concealed within; when fire stirs, external yang dances in the emptiness. The radiance of victory spans eighty thousand leagues, descending upon the divine chamber. Endless flowing clouds linger, their light penetrating deeply into the courtyard of utmost emptiness. They replenish the eastern river, enter the Hall of Light, and the true virtue’s precious splendor fills the five hues.\n\nClouds arise and transform into verdant earth; fire stirs and changes into blazing red lotuses. When grim yin prevails, true lead sinks into darkness; when expansive yang appears, true mercury floats in whiteness. When purity reveals the treasure, yellow gold may be wrought. As the soul stabilizes and the spirit congeals, fresh rosy clouds emerge in fragments. Horse teeth turn frosty, and mercury becomes powder. It can revive the dead, restoring their wandering souls to wakefulness.\n\nIts efficacy is unfathomable—even ghosts and spirits cannot fathom its mysteries. The fire numbers are obscure; even the sagest cannot know its applications. The wondrous transformations of the mysterious origin seem both present and absent. When present, true lead bears form; when absent, fire arises from the void.\n\nThe fire of *Li* transforms emptily, and flowers transmute into fire. The transmutation of flowers relies entirely on the fire’s work. Who can employ fire that arises from nothing? When cinnabar is achieved, fire dissolves into nothingness. Within it, fire follows the changes of the lines, yet fire itself is unborn.\n\nThe qi of *bing* and *xin* transforms into true water, nourishing the true gold of *yi* and *geng*. The qi of *ding* and *ren* transforms into true wood. It can nourish the true fire of *wu* and *gui*. The qi of *jia* and *ji* transforms into true earth. Earth, the mother of the ten thousand things, is the cinnabar’s parent. Father and mother transmit the embryo, arraying the nine names.\n\nThe first year of the nine paths is the great ancestor. Sons and grandsons follow their fathers in succession. The *Qian* Dao produces the male; the *Kun* Dao, the female. The azure path’s qi emerges east of the yellow path. Suddenly, thunder roars, ascending to the azure sky. The thunder of *Zhen* in the east at *mao*—four yang signs respond to the season. Elm flowers wither, leaves scatter in disarray. The Dipper turns, its handle pointing to *mao*.\n\nThe white path’s qi emerges west of the yellow path. Luxuriant golden flowers give birth to the golden rooster. Metal is born in the west, flourishing in *dui* at *you*. How could shepherd’s purse and wheat not wither? Four yin winds blow across the earth at *guan*, the setting sun. The Dipper turns, its handle pointing to *you*.\n\nThe red path’s qi emerges south of the yellow path. Flickering and blazing, it burns eternally. True yang fire flourishes in *Li* at *wu*; from *si* to *wu* to *ding*, the first yin arises. Heavenly winds stir, and fire glitters. At its zenith, decline begins—decay resides in *wu*.\n\nThe black path’s qi emerges north of the yellow path. The divine pool’s water is profoundly dark. Within the darkness, a yang gradually grows. The *Fu* hexagram, by this, reveals its sprouting signs. The *Huangzhong* tone establishes *zi*, gradually unfolding principle. Heaven and earth’s warp and weft renew their beginning.\n\nThe sun moves along the yellow path within its course; the moon traverses the nine paths as the Great Unity. The nine paths and nine crucibles reach the divine chamber—of old, the Yellow Emperor once mastered them. The Yellow Emperor rode a dragon to ascend the Purple Tenuity, his seventy-two ministers all feathered transcendents. Ascending the cloudy heavens, treading the void, they flew into the golden city of the cinnabar clouds. From then on, they reclined and rose as true immortals.\n\nOnce, he encountered a divine lord who bestowed the great elixir. Following the phoenix’s carriage, they journeyed through Mount Emei. Not in vain did they endure toil and hardship: thatched huts untrimmed, paths impassable, thorns piercing the sky, obscuring distant mountains. The peaks of Emei were perilous to climb.\n\nHe entreated the august personage to return at dusk. He rejected heterodox gates and minor arts: no mere swallowing of saliva to form golden liquid, no refining of urine into autumn stone, no claims of fasting or abstaining from grain, no methods of shoulder-shaking or breath-counting, no closing of eyes to manipulate essence and spirit, no clenching of fists to seize demonic thieves, no reliance on yin shadows to nourish numinous things, no practices of the Three Peaks or sexual rites.\n\nWhen the art is perfected and the Dao is achieved, one ascends the highest mechanism of immortality. Yet worldly scholars cannot adhere to it. Telling it to the vulgar, they disbelieve—let them read the *Annals of Master Jingyang* to understand.\n\n**On the Mother of Medicines**\n\nThe Dao of the Elixir is not the work of mundane five metals or eight minerals, nor cinnabar or mercury. It is formless union with the void, vast completion of emptiness—this is called true emptiness. The substance of true emptiness is the foundation of the Returned Elixir, the mother of the Great Medicine.\n\nWhat is the form of the mother of the Great Medicine? What is the appearance of her body, and from what essence does she arise? The essence is a thing formed within primordial chaos, a thing that dwells before the image of the Emperor. The image precedes true emptiness, which merges with the natural. True emptiness and the natural unite with form and image; the movement of spirit turns the image, and the turning of true emptiness is not empty. The marvel of non-emptiness is the power of spirit. The spirit communicates, transforms, and assumes a black color. Black is the profound origin where virtue and power are concealed. The Dao conceals profound virtue in a vast abyss—its broad and fathomless source is called the Northern Ocean.\n\nThe Northern Ocean is vast and great, giving birth to the boundless. Boundless and without limit is the Dao. The limitless Dao gives birth to the One. The One attains the highest clarity, first in heaven. Being first in heaven, it is the primordial beginning, six million years of Dao-generated completion. Completion perfects the Dao, the green ancestor of the lineage, which can generate all images and thus is the mother of the Elixir.\n\nMother lead is black—why is mother lead black? When it achieves the water of the six origins and resides in the north, it aligns with the stars. It governs transformation and nurtures life below. The essence of lead contains five colors, which transform into green, yellow, white, red, and black. Black is the profound origin, the foundation of water. Water is the pivot of the Dao, and its number is One. The One is the true qi of the Center within Kan, harmonizing with the indistinct and the obscure. They mutually require each other, joining like dragon and tiger. At the inception of dragon and tiger, what was there? Yin and yang stir and excite each other; the formless unites with the void. The void arises from being, and being arises from non-being.\n\nNon-being is the beginning of non-action; being is the mother of action. It is the first of the four images, the origin of the five phases, and the pivot of cinnabar. The pivot is the intercourse of the two qi of water and fire. Water and fire refine each other; yin and yang overcome each other. How is this made clear? Briefly test it: the sun and moon within the crucible are the qi of water and fire. The qi of water moistens downward, and the qi of fire flames upward. Descending and ascending, they meet and welcome each other, joining and uniting. Water excites fire and extinguishes it; extinguished fire becomes earth. Earth can generate metal, and metal can generate water. Metal and water generate each other, mutually containing and nurturing. They nourish metal and augment water, augmenting water to nourish metal. When metal and water correspond, they moisten and enrich the flesh. The flesh becomes like jade cream, pure and true as white jade blossoms. It extends longevity beyond price, a priceless true pearl, the cinnabar-formed body.\n\nWhat was there before? Formless being arises from being; water and fire nourish each other. The two qi mutually require each other; the formless unites with the void. The substance of united void has the function of one *jin* in number. The number divides into two weights, covering and revealing two circles. Before their union, first determine above and below. The number of the upper arc is eight, and the number of the lower arc is also eight. Combining the two eights above and below yields the substance of Qian and Kun. The substance of Qian and Kun is one *jin*; the Dao of the Elixir is thus upright and unwavering.\n\nFirmness and softness have outer and inner aspects; metal and water divide into balanced weights. Yin and yang have lightness and heaviness. They dance and mutually employ each other, unfolding the three powers. Qian and Kun unite in substance! The Qian trigram images heaven and covers; its three lines are connected. The Kun trigram images earth and reveals; its six lines are broken yet interconnected. The qi flows through the six breaks, and the three connections open. The Qian trigram undergoes three changes, and the Kun trigram undergoes three changes. Qian connects, Kun breaks; breaking and connecting alternate, opening and closing. Black and white come and go.\n\nGreat indeed are black and white! Yang is the seed, yin the planting. Cultivating and nurturing the seed yields the yellow sprout. The yellow sprout generates mercury; mercury emits three blossoms. Mercury coagulates into cinnabar, like grains of gold. One grain taken daily for a hundred days transforms the form and changes the bones. The bones become like metal and stone; form and spirit attain each other. Form and spirit are both wondrous, and longevity knows no limit. The sacred virtue of golden cinnabar arises from formless being, and being arises from non-being. The trigrams and lines correspond, harmonizing with the intercourse of Zhen, Dui, Kan, and Li. The four images are emptiness and formlessness, impossible to depict. The primordial essence is difficult to perceive; the formless unites with the void.\n\nThe form of the formless is the transformation of emptiness. The transformation of cinnabar is natural; cinnabar transforms and arises from the natural—this is the wondrous function. The wondrous is the maiden; the maiden belongs to the Dui direction. The metal mother resides in the position of the metal father, nurturing and safeguarding. \"Nurturing\" is the One; \"safeguarding\" is the Four. They nurture and safeguard metal and water—metal and water are thus Four and One. Three days correspond to Geng; Geng gives birth to the Dui gate. Dui gives birth to the Qian father; Qian is the father of metal. The body of metal takes water and fire as its foundation. When fire flourishes, it melts metal, and metal transforms into water. Harmonizing and circulating, this water turns north and flows east, nourishing the verdant wood of Zhen and generating the dragon’s light of Jiao and Kang. The eastern constellations bear the southern fire star, refining the qi of Kui and Lou, rectifying the positions of Geng and Xin. The position corresponds to the western Great White Metal Hall.\n\nThe Metal Hall is the tiger’s chamber. Adjusting and descending, the earth follows and transforms the substance. Luxuriant and numinous, myriad auspices and spirits—supremely virtuous and honorable, their transformations are inexhaustible and cannot be surpassed. Once, a single grain transformed the ends of the earth. It can both save lives and harmonize families. If one hears of this early and diligently cultivates, the Emperor will invite you to ascend the Great Luo.\n\n**On the Right and Wrong of Medicinal Substances**\n\nWhen Qian and Kun unite in intercourse, the ten thousand things transform and arise. If Qian is not originary, or originary but not prosperous, or prosperous but not beneficial, or beneficial but not upright, it violates heaven and turns away from the source. Yang has nothing to bestow, and yin has nothing from which to sprout. Thus, the above does not descend, and the below does not ascend; heaven does not mist, and earth does not steam. Having lost the harmonious creation, how can the ten thousand things arise? This is called medicine that is not upright and violates heaven, fire that does not harmonize and turns away from the source. Though fire moves, the celestial tally does not respond. If the numinous does not descend, the hun soul flies away. If the medicine is not upright, wind and clouds do not aid the tiger. Without form, the dragon’s light is utterly cut off—how then can cinnabar arise?\n\nThus we know that cinnabar must be transformed by medicine, and medicine arises from cinnabar. As the *Scripture of the Golden and Azure* states: \"Mercury is the essence of metal; when water returns as yellow liquid, this is the transformation of medicine.\" When medicine transforms, fire stirs and blossoms float—distinct and singular. The mother abandons that which it generates, welling forth as yellow liquid. This is the essence of the Great Yang, whose qi is called the Flowing Pearl. The Flowing Pearl is flowing mercury. The solar soul descends like dewdrops scattering pearls, gathering as water, flowing as liquid, congealing into solid ice, crystallizing as frost’s delicate lattice, coral’s sinuous curves, or the blossoms of cassia trees. Borrowing the name of the crescent-moon spirit fungus, it coalesces into the Great Precious Pearl. Fire moves the Three Luminaries, and numinous radiance illumines the night. This is the mutual aid of yin and yang, with Xun and Gen returning to Kun, yang departing and yin arriving, brightness waning and darkness arising.\n\nBrightness and darkness are the exhaustion of the nine; when the nine are exhausted, yang’s light gradually brightens. The divine palace conceals its brilliance, luminosity hides its glow, and numinous cinnabar submits to the body. The arising of darkness is the birth of the six; the six are the beginning of the yin tally. Six in the second place is the end of obscurity; six in the third is ren and gui, which roundly return to the black body. This is the beginning and end of Qian and Kun, images following the generation of lines, numinous transformation and spiritual communion—the transformation of medicine.\n\nNaturally summoning rosy clouds and gathering radiance, it engenders the numinous, drawing the blazing sun’s sprouts and nurturing the round and luminous divine medicine. Summoning tally and creating transformation, tiger omens and dragon auspices arise; the five tones harmonize, and luminous light crystallizes into amber-golden paste. The six pitch-standards shift, and cinnabar dots red agate. Fire’s emptiness shines through yin and yang; exiting and entering the two divisions, metal flourishes and wood prospers, unfolding the transformation of medicine.\n\nThe transformation of medicine is the Vermilion Bird’s regulation and movement, transmuting into jia and yi, nourishing bing and ding, fostering the Vermilion Fowl. The fowl belongs to the western position, transforming into the dui direction and becoming metal. Metal is born of water, pairing with ren and gui; water is born of metal, its qi endowed by geng and xin. Metal and water generate each other, mutually containing and conceiving. Within the mother’s womb, it is called the metal embryo and water mother. Water and fire melt and refine, now sinking, now floating. The floating is white cinnabar-mercury; the sinking is black water-lead. Floating and sinking without constancy, it is profound and difficult to fathom.\n\nThe Most High said: \"Seen but not visible, heard but not audible, it latently creates transformation, bound to the seasons and divisions.\" The seasons and divisions refer to zi, wu, mao, and you. At *fu-zi*, fish scales cluster; at *gou-wu*, horse teeth frost; at *zhuang-mao*, stalactites form; at *guan-you*, feathers and wings break; at *bo-xu*, it resembles canine teeth; at *kun-xuan*, yin generates and yang transforms.\n\nKun generates Zhen and Dui, Qian; Qian generates Xun and Kun. Moreover, Qian receives ren and jia; Kan embraces the six wu; Gen unites with the six bing; Zhen illuminates the six geng; Xun completes the six xin; Li contains the six ji; Kun envelops yi and gui; Dui senses the six ding. The eight trigrams transform from Qian into the ten stems, uniting with the celestial origin.\n\nThe east’s jia and yi wood is the Azure Dragon, positioned among the seven lodges of Jiao, Kang, Di, Fang, Xin, Wei, and Ji. Its form is like a dragon, dwelling in the east—hence it is called the Azure Dragon. The south’s bing and ding fire is the Vermilion Bird, positioned among the seven lodges of Jing, Gui, Liu, Xing, Zhang, Yi, and Zhen. Its form is like a quail or crow, dwelling in the south—hence it is called the Vermilion Bird. The west’s geng and xin metal is the White Tiger, positioned among the seven lodges of Kui, Lou, Wei, Mao, Bi, Zui, and Shen. Its form is like a tiger, dwelling in the west—hence it is called the White Tiger. The north’s ren and gui water is the Dark Warrior, positioned among the seven lodges of Dou, Niu, Nü, Xu, Wei, Shi, and Bi. It has the body of a tortoise and snake, dwelling in the north—hence it is called the Dark Warrior.\n\nThe eight trigrams form images from Qian; the four and seven move the spirit’s work. Examining the sun’s path from south to north, the moon’s course from west to east, movement follows the Dipper’s turning, and transformation lies within. Within is the numinous cinnabar tripod; Qian completes mercury powder, which dots mercury into gold—how could it be merely thousands or tens of thousands? Though it aids the world, it is not excessive; it is not yet sufficient to be called divine or sagely. Ingesting it, one becomes a flying immortal, ascending to the azure heavens by day. Transcending the Three Realms, unbound by the Five Phases, my life rests in myself, forever escaping the suffering of the dark underworld.\n\nWithout the Great Return Elixir, who can avoid the path to the Yellow Springs? I dare not speak falsely; the scholar must realize this for themselves. Fully expounding the principles of the Three Powers, Qian and Kun complete their beginning and end. Cinnabar-mercury and lead-silver share the same root in nature and disposition. Grasping the sages’ intent, one creates a golden coffer. It produces night-shining sand, cinnabar called \"as-you-wish,\" refining into a priceless pearl. Lifespan becomes equal to heaven and earth.\n\nThose who attain this principle must revere it; those who peruse this text will verify their nature with you. Scholars, savor and ponder it—make it the bright mirror of the elixir chamber. Comprehending yin and yang, yin contains the yang chamber; the sun’s brilliance is manifest, the divine formula blazing. Purple blossoms lush, radiance resplendent, the sun’s glory illumines the dark void. Light interpenetrates, ascending and descending in communion.\n\nThe Three Powers’ water and fire manifest as cold and heat; fire ascends and water descends, like the sun and moon’s coming and going. Water and fire follow the sun and moon without diminishing their brightness. Cinnabar-mercury and lead-silver are of one kind. One kind of numinous sprout, a divine and wondrous medicine: the yellow sprout in one tripod divides into two and eight; twenty-four tripods begin in the flowering pond. In the end, the numinous gives birth to white snow. The divine tally and white snow can return the hun soul. When lesser scholars hear of this, they slander and rage.\n\nWhy, when one has already died, can the hun soul return? Once dead, the hun and po forever disperse—where can they be sought? Xu Fu spent years searching for herbs, yet the immortal grasses and numinous fungi were nowhere to be found. Since the Penglai immortal grasses have no form, on what basis can the returning hun soul rely?\n\nI now tell you of the medicine that returns the hun soul: to return the hun soul, one must have the celestial hun and po. This is the true ancestor of the human hun soul. Returning the hun revives the dead form, restoring the body to its former state. Reborn into the world, what method is there?\n\nThe method is this: when *fu-zi* arrives, fish scales cluster; at *gou-wu*, horse teeth frost; at *zhuang-mao*, stalactites form; at *guan-you*, feathers and wings break. The body revives and lives again as before. How can one be reborn into the world?\n\nThe method by which it arises is the primordial womb—father and mother of the hun soul.\nThe father-mother primordial womb cannot be discoursed upon;\nIn its vastness, it gives birth to the ten thousand kinds of hun.\nSown in the fields of cultivation, they gestate and form the embryo—\nWithin the transformations of womb, egg, moisture, and metamorphosis,\nSome become human, some beast, some fowl, some insect.\nHuman, beast, fowl, and insect all receive their nature;\nNature and life are bound together, the hun striking life.\nThe hun is the essence of metal, forming the foundation of life;\nThe foundation of life nurtures nature, the hun following alongside.\nNature and life are bound together, striking the hun and po.\n\nThe po belongs to the dim and obscure hun,\nTo the indistinct and the profound—\nThe essence of these two qi\nCan generate the ten thousand images, uniting Heaven and Earth.\nGreat indeed is the union of Heaven and Earth, the gate of convergence!\nThe *Yi* contains Heaven and Earth, uniting the Raven and Hare;\nThe essence of the Raven and the marrow of the Hare join with the po and hun,\nRoot and stem bound together, belonging to nature and life.\nRefine the hun and forge the po to create the divine elixir.\nBy summoning and calling forth the hun spirit, it can be returned—\nNot through talismans or white snow alone;\nEven a single cauldron of cinnabar would prove difficult in effect.\n\nA single cauldron of cinnabar may be ingested,\nAnd with prolonged use, it can restore yang and transform the bones,\nRestoring yang and transforming the bones to become a true immortal—\nYet this requires the divine talisman and true white snow.\nGreat indeed is the divine talisman and true white snow!\nIt revives the hun and restores life, as with Xu Jia.\nThis is the most wondrous gate of the mysterious origin;\nLesser methods and side doors surely cannot achieve this.\nThough the lesser methods of side doors have many adherents,\nThey cannot surpass the true lead and mercury.\n\nTrue lead and true mercury—true Dragon and Tiger—\nDragon and Tiger radiate with light like Pangu.\nBeneath the first green, the Tiger contends for brightness;\nSeizing the divine light, they divide into yellow and green.\nThe essence-light of Dragon and Tiger shoot toward each other,\nGathered into the golden world of Penglai.\nWithin it stands the Terrace of Gathered Light, the Treasury of Treasures,\nWhere the jewel-flower blooms in perfect roundness, its radiance unfolding.\n\nThe light is resplendent,\nFive-colored red glass encasing the moon of treasures.\nSuddenly, the moon of treasures veils the red glass,\nMutually enclosing, their lights intertwining.\nWater and fire entwine, blending sun and moon;\nSun and moon unite like linked rings,\nThe five stars strung as pearls, threading the five phases.\nThreading the five phases without dissipation,\nNaturally, water and fire generate the divine substance.\n\nThe divine substance is wondrous—\nThe Star of the Old Man of the Southern Pole appears as an auspice.\nThe star appears as an auspice,\nDivine aid causes the purple qi of the Great Yang to arise.\nThe purple qi, like mist, ascends straight upward,\nPiercing the canopy at the center of the cauldron.\nWithin the cauldron, it coils like frost and snow,\nRising and descending, intertwining.\nIntertwined and bound together, they form branching pillars,\nDelicate and intricate as a coral tree.\n\nThe coral scatters its strands, its branches falling away;\nYang’s hardness gradually grows as yin’s weakness is stripped away.\nWhen all yin is exhausted, yang qi flourishes,\nAnd after nine revolutions, the elixir forms, crystallizing into purple blossoms.\nThe purple blossoms enwrap the gathered golden essence,\nDrawing forth the quintessence of the Five Emperors’ splendor.\n\nThe essence of rosy clouds divides into five names:\nDawn’s rosy clouds are bright,\nDusk’s rosy clouds are divine,\nFalling rosy clouds are numinous,\nFlying rosy clouds descend,\nFire’s rosy clouds welcome.\nWelcoming the rosy clouds, they return home in splendor,\nGenerating the five fortunes of true noble rosy clouds—\nAuspicious and infinitely propitious, the great flourishing rosy clouds of numinous cinnabar.\nThe myriad auspices gather in reverence to the Dragon’s rosy clouds of purple numinous cinnabar,\nUniversally aiding the immortals of the grassy realms for ten thousand years—\nThe rosy clouds of ten thousand numinous cinnabars that transmute stone into gold,\nThe rosy clouds of wish-fulfilling treasures,\nThe numinous cinnabar of the five rosy clouds, five stones, and five spirits.\nThe Most High Mysterious Origin Sage Ancestor adds to them,\nForming five cauldrons of purple divine cinnabar.\nTwenty-four cauldrons divided into five,\nWith added water and fire, the cinnabar is refined.\nYears and months link endlessly,\nTwelve divine talismans and nine white snows,\nRevolving and augmenting,\nAdding sun and moon,\nSun and moon augmenting water and fire,\nAdding yin talismans and yang talismans—\nNo deviation, no error, no misfortune, no alteration.\nThe nine-year white snow re-enters, turning into cinnabar,\nIts divine power enhanced by the divine talisman.\nThe divine medicine transforms,\nBelonging to yin and yang;\nYin and yang belong to the hexagrams,\nThe hexagrams’ fire mutually supporting.\nYin and yang drive each other,\nYin and yang push and shift, perfectly continuous without flaw.\nThe lines continue the hexagrams, following their changes,\nShifting and moving without fixed abode—\nAbove, middle, and below,\nEight thousand six hundred and forty hexagrams.\n*Qian* and *Kun*, *Kan* and *Li* account for four hexagrams:\n*Li*’s fire ascends above, *Kan*’s water moistens below.\n*Kan* and *Li*—water and fire—drive each other,\nMutually propelling, fire following the hexagrams.\nWhen the hexagrams’ fire wanes or waxes, it returns to the source,\nReturning to the origin, origin after year after year,\nMonth after month, day after day,\nMatching the primordial talisman’s fire record,\nUniting with the primordial talisman’s record without error.\nThe fire’s splendor accumulates, layer upon layer,\nRefining the essence to the divine, the sagely, the numinous, the ultimate—\nNo addition can increase its boundless fortune,\nIts vast and great divine transformations,\nIts ultimate numinous changes—\nThree things that cannot be added.\nThis is the cinnabar of the Mysterious Origin Sage Ancestor:\nThree cauldrons of cinnabar,\nSix years for purple numinous cinnabar,\nSeven years for purple longevity cinnabar,\nEight years for purple golden cinnabar—\nThe highest grade, the supreme medicine,\nThe numinous purple talisman of divine medicine,\nThe divine talisman descending from Heaven.\n\n**Cinnabar’s Verification of the Dao Song**\nTeach the child these wondrous words,\nThat the child may know the origin of the Dao.\n\nAt the beginning of Heaven and Earth, there was the Nameless—\nI grasped the primal before Heaven and Earth.\nWith names, it became the Mother of the Myriad Things,\nAnd the myriad things return to the vast origin.\n\nGathering yin to form the Earth,\nAccumulating yang to shape the Heavens—\nStealing the principle of the Three Powers,\nCinnabar aligns with Nature.\n\nThe true and upright virtue of Qian and Kun,\nRadiant and bright, gives birth to the essence of life.\nDim and distant, then dark and profound,\nIts reflected light embraces the Great One.\n\nGold takes cinnabar as its master,\nReceiving harmony from the mother of mercury.\nThe essence of the sun’s departing fire,\nPierces the abode of the formless and unseen.\nSpiritual brilliance penetrates the luminous,\nIts radiant splendor blazing forth and abiding.\n\nThe White Tiger inhales the red glass,\nGolden blossoms give rise to jade mushrooms.\nTo congeal the supreme medicine,\nMyriad transformations follow the hexagrams’ strategies.\n\nThe cinnabar’s image follows the hexagrams’ grains,\nIts numinous efficacy defies depiction.\nThe treasure coalesces in azure skies,\nIts rosy glow dividing into five hues:\nFirst called Crimson Golden Red,\nSecond named Flying White Snow,\nThird termed Celestial Valley Green,\nFourth known as Black Lead Liquid,\nFifth named Central Yellow Essence—\nOnce solidified, it endures for ten thousand springs.\n\nSearching the hundred bones and nine orifices,\nAll illness is eradicated.\nIt restores the aged and infirm,\nLightens the body, and darkens the hair.\nTeeth regrow like silver and jade,\nDim eyes shine like lamps.\nConcealing one’s traces among men,\nOne accumulates deeds of hidden virtue.\n\nNot clinging to worldly splendor,\nOne may yet ascend to the Jade Clarity.\nHeal the sick when they seek aid,\nBestow gold upon the poor,\nImpart the alchemical canon to the earnest—\nThus concludes the first scroll of *Master Xu’s Stone Casket Record*.\n\n**Oral Instructions of Master Chen**\nWhen merit and practice reach fulfillment in a single morning,\nHeavenly scriptures arrive at the Supreme Ultimate.\n\nTrue medicine is lead,\nTrue mercury follows the fire’s arising.\nWater and fire respond to Heaven’s tally,\nTiming must not err.\nIf the four seasons fall out of balance,\nCold and warmth no longer follow the rhythm.\nMidwinter like scorching summer,\nMidsummer thick with frost and snow—\nOften the clepsydra falters,\nDawn and dusk grow indistinct.\n\nWhen Kun’s fire wanes toward extinction,\nYin’s encroachment stirs yet unmanifest.\nWater surges, Kan consumes yang,\nFire multiplies, poised to fell the wood.\nMutual conquest, not mutual generation,\nYin and yang defy the proper order.\nFire and metal fail to return,\nThe Dipper strays south and north.\nThe four sevens plunge into chaos,\nThe celestial pivot is lost.\n\nRefining adepts, ponder deeply,\nApply your mind with meticulous care.\nKnowing it need not be spoken,\nIt lies in diligent practice.\nRead this text ten thousand times—\nIt is called the Ladder to Heaven.\n\nThus concludes the second scroll of *Master Xu’s Stone Casket Record*.\n\n**The Sage Stone’s Pointer to the Mysterious**\nFrom what constraint do the myriad forms arise in emptiness?\nWondrous transformation stems from cinnabar and mercury.\n\nFrom Fusang’s east, the golden crow’s essence emerges,\nIts flaming feathers ablaze with radiance.\nSoaring and coursing, the yang fire is called the Sun’s Soul,\nSetting at dusk, flourishing at dawn—waning returns to waxing.\nThe red wheel harnesses the chariot of dawn’s light,\nCircling the lost and returning, roaming the bounded realm.\nThe true essence manifests as cinnabar through the body,\nMelting stone and flowing gold—who can discern its depth?\n\nIts light sustains Heaven and Earth, receiving the sun’s glow,\nAll things live through the cinnabar’s transformation.\nYet cinnabar is no fabricated thing,\nNot smelted from the five metals nor the eight stones.\nWithin the Great Void lies the grain of Returned Cinnabar,\nTransforming into a night-shining pearl unknown to men.\nThe pearl’s glow, dense and resplendent, appears in the cinnabar skies,\nThe jade hare’s limpid radiance follows the hexagrams’ lines.\nKun gives rise to Zhen, Dui to Qian, then Xun,\nGen and Kun begin and end, returning to the yang lines.\nYang departs, yin arrives—the sacred medicine,\nImmortal perfected ones call it Purple Golden Ointment.\n\nOne drop restores sight to the blind,\nTwo drops regrow flesh on withered bones,\nThree drops transmute stubborn stone into gold,\nFour drops turn long rivers to curds,\nFive drops keep spring blossoms from falling,\nSun and moon bloom eternally, never fading.\nCommon pottery and rubble all turn to gold,\nDecayed things touched by it renew their hue.\nFor those afflicted by consumptive corpse-transmission,\nIngesting it brings instant efficacy and bodily lightness.\n\nThe foolish claim it is a thing within the body,\nSeeking matches in the bedchamber.\nYet it is not the body’s qi and essence—\nWhen essence departs and qi dissipates, what enters?\nThe hundred spirits scatter and flee,\nLeaving the aged, withered, and infirm with chronic ailments.\nThe sage declares all such notions false—\nHow can they compare to refining the golden liquid?\n\nThe master explains the golden liquid’s ancient origin:\nAt Pan Gu’s initial division, the Dao’s root.\nIt was the dragon’s essence giving birth to the tiger’s marrow,\nJia and Yi, Geng and Xin transforming into Ren and Gui.\nBing and Ding, the Vermilion Bird’s fiery spirit soars,\nDescending to the Dark Heaven to unite with Wu and Ji.\nThirty-six cycles of ascent and descent,\nScarlet intertwining in north and south.\nSubtly inverting the essence of Heaven and Earth,\nWondrous creation arises from the Three, the Five, and the One.\n\nWhat do the Three, the Five, and the One signify?\nThey give birth to Heaven, Earth, and Man.\nBirth to Heaven grants the power to reverse Heaven,\nBirth to Earth ensures firmness and the flourishing of all things.\nBirth to Man divides high and low—\nThose of shallow fortune cannot refine cinnabar.\nThe earnest adept must first recognize lead,\nFor without discerning true lead, cultivation is in vain.\n\nHeaven has five thieves—those who see them prosper.\nLead harbors five hues, each an auspicious sign.\nBorn from the Nameless at Heaven and Earth’s beginning,\nThe Mother of the Myriad Things is no ordinary being.\nBeyond the ordinary, it eludes even sages,\nHidden within the Mysterious Origin’s indistinct depths.\nDim and distant, dark and profound—awaiting the utmost essence,\nStirring yang into lightning, generating light.\n\nThe light spirals, dividing into five colors,\nBeneath it lies lead’s essence, unknown to men.\nIn spring, plants and trees; in summer, like ice;\nIn autumn, no gathering frost; in winter, no snow.\nEmbracing harmony, nurturing gradually to numinous attainment,\nThe yellow sprout does not mingle with worldly lead.\n\nThe yellow sprout, nurtured for eight hundred years,\nTransforms into azure mercury, elusive to find.\nAzure mercury, quicksilver hard to seek,\nIt courses through the Four Great without end.\nAzure mercury, aged another eight hundred years,\nTransforms into azure gold, even harder to obtain.\nAzure gold is the azure dragon’s bone,\nIts generating number three, its completing number eight.\nWhen three and eight’s count ends, mercury’s qi turns azure,\nTransforming into azure dust that ascends.\n\nAscending forever as the immortal’s emolument,\nThrough eons of primal brightness, it becomes the Five Blessings.\nEmerald clouds and luminous azure dust,\nRising to the Clear Capital, returning to its domain.\nEntering the Palace of Purple Yang,\nThe Hall of Bright Sun blazes with dragon’s red glow.\nIts radiance shines boundlessly,\nUtmost yang extinguishes all yin’s shadows.\n\nLead divides into five hues, flames soaring into the void—\nAzure, crimson, white, black, with yellow at the center.\n\nGlowing bright and radiant, hues blend in warmth,\nPurple spirits and auspicious qi shroud in cinnabar clouds.\nThe myriad spirits breathe, lead’s qi flows through,\nJade lads and jade maidens feast upon the vast sky,\nFeeding on its radiance, the Heavenly Elder,\nAll immortals partake, their lives boundless.\n\nOnce the Jade Emperor appeared in the dark vault,\nProclaiming this the ancestral lineage of returning elixir.\nThis lead differs from worldly lead—\nSuspended in space, luminous and resplendent,\nIts sunset glow pierces the Crystal Palace,\nConcealed brilliance reveals the Golden Rooster’s form.\n\nBreathing winds and clouds, tiger and dragon convene,\nDragon calls to tiger, tiger calls to dragon,\nVast qi congeals into the true supreme medicine,\nSwift as lightning, one ascends into the clouds.\nTransforming form and bone, the body soars through space,\nIts visage like the Primordial Heavenly Honored One,\nSharing one qi with heaven and earth,\nReturning to the root, reverting to the source—this is the ancestor.\n\nThough myriad divergent methods are expounded,\nNone compare to the affairs of golden cinnabar.\nAbiding in the world, lead essence rules the five metals,\nParent of the seventy-two stones.\nWhen the adept’s spirit gathers it,\nFirst cast out the yin earth.\nKnead lead and cinnabar into clods of soil,\nSealed with the six-one method, cherished and guarded.\nRefine with fire for a day and night,\nFire extinguished, smoke dispersed, earth turns to ash.\nRising lead inverts and enters the ash pool,\nFire ignites, lead melts into divine water.\nThis divine water originally issues from white gold—\nFirst take white gold to fashion the crucible,\nWhite gold is the womb of mercury,\nReverting to the source, mercury is refined.\nMercury is the elixir of immortality,\nNot the common mercury of the vulgar world.\n\nAzure Phoenix descends from the flaming sky,\nShedding feathers, head, and talons.\nMercury, thus subdued, cannot take flight,\nRefined into golden elixir, the great medicine.\n\nYet I fear revealing heaven’s secrets,\nSuch words are rare in the mortal realm.\nIf not for repeated exhortations,\nThose lustful and greedy would be no better than beasts.\nShould one violate these precepts, the gods know—\nDrawn into Dengdu, the punishment is no light matter.\nBeyond lie the nine springs, endless suffering,\nNot to be spoken of lightly or carelessly.\nCareless speech betrays the unworthy,\nDooming them to ten thousand kalpas of hellish torment.\n\n**On the Luminous Perfection of the Spirit Chamber**\n\nAmong all worldly affairs, only one is extraordinary—\nThat extraordinary thing is the matter of the True One,\nThe Way of the Returning Elixir.\nMany scholars pursue it,\nYet few glimpse its root or fathom its end,\nThus a thousand attempts yield ten thousand failures,\nAnd true success remains rare.\n\nFor the great elixir’s refinement,\nOne must build an altar in an auspicious direction,\nSelect the land, choose an auspicious day—\nNo reckless action, lest misfortune be invited.\nThe altar has three tiers, each eight feet square,\nUnequal in height, each with its own guiding line.\nThe topmost tier stands two by six in height,\nAligned with the Nine Palaces, the nine luminaries, nine positions—\nIts upper breadth one zhang and six feet, the number of two eights.\nThe middle tier stands two by five in height,\nDivided by the Eight Trigrams, the heart and viscera of the altar—\nIts breadth one zhang and four feet, corresponding to the twenty-four qi.\nThe lowest tier stands two by six in height,\nArranged with the eight gates, opening and closing by measure—\nIts breadth two zhang and eight feet, aligned with the twenty-eight constellations.\nFour sides wield swords to suppress the four directions,\nEight mirrors hang to dispel inauspicious influences,\nFive-colored silks drape according to position and direction.\nUpon the altar rests a sacred furnace named the Spirit Crucible,\nThe Spirit Crucible appears and vanishes, gathering fire’s qi,\nGathering fire’s qi to nurture the cauldron,\nThe cauldron receives fire’s qi to nourish the Spirit Chamber.\nThe Spirit Chamber, luminous and perfect—\nNot round, yet like a parrot’s form,\nNot bright, yet waxing with the moon.\n\nThe golden cauldron, crescent like a pot,\nThe Spirit Chamber, its child, tapers at both ends.\nEntering the cauldron, the cauldron resists settling,\nEntering the cauldron, the embryo lies transverse, the cauldron tilts.\nAn inverted cauldron loses the Hall of Brightness’ true virtue,\nA transverse embryo disrupts yin and yang.\nSun and moon fail to unite, metal and water exhaust,\nPassion and nature part, never to meet.\nMan’s cap and woman’s hairpin miss their timely years,\nQi fails to merge, bodies fail to unite—\nAll because the ritual image is askew,\nCausing Qian and Kun to remain unjoined.\nKan and Li, north and south, in chaos,\nEast and west, Mao and You, indistinguishable.\nWater and fire lose their positions,\nMetal and wood stray from their directions.\nThe dragon hides, vanishing from the celestial path,\nKilling qi scatters with the wind—\nThe tiger, formless, for the golden embryo fails to take shape.\nHare and rooster part, heaven and earth overturn without reason,\nDivine water spills and is lost.\n\nIf one seeks the crow and obtains the hare,\nOne must rely on the craftsman’s hand to establish Qian and Kun,\nEnter the cauldron to harmonize, reorder yin and yang,\nRevolve the sun and moon—\nOnly then can one follow positions and directions,\nMetal and wood unite.\nRevolving fire’s qi to engender the solar essence,\nSubduing metal and water to nourish the lunar spirit.\nThe qi of east, west, south, and north,\nAll descend into the golden cauldron,\nAuspicious tiger and dragon signs congeal within the profound darkness.\nChaos and light intermingle, radiance vast and boundless,\nThe boundless true void—\nThe true void refines the wondrous,\nRefining the wondrous true void,\nThe true void conceals the profound.\nConcealed void refines the wondrous, refining bedrock metal—\nThe wondrous divides the maiden,\nDui’s body engenders Ren.\nThis speaks of refining the wondrous to perfect the Spirit Chamber,\nThe Spirit Chamber’s brilliance opens, the spirit emerges and vanishes.\nEmergence is brightness—\nThis speaks of refining the wondrous to unite as numen,\nThe numinous essence, crystalline, the spirit as qi.\nQi has no form,\nQi enters the profound darkness, traversing the indistinct.\nWithin the indistinct, at the center, dwells the numinous—\nThe numinous speaks of wondrous qi uniting as spirit.\nSpirit moves qi, qi engenders the numinous,\nThe numinous is the child, qi the mother.\nHow could the Mysterious Origin’s Sacred Ancestor speak falsely?\n\nIt further speaks of refining the spirit to unite with the Dao,\nRefining spirit to unite with the Dao—this is no ordinary Dao.\nOne should seek it diligently in the *Yin Fu Jing*,\nObserve the heavens’ Way—what is the sky?\nThe sky has the Silver River, the chamber has what?\nThe chamber has the stellar river, constellations arrayed—\nZhang and Yi fly, Xu and Wei pursue.\nThe twenty-eight constellations revolve,\nWater and fire tread in north and south.\nZi and Shen command, He and Fang unite,\nWhite Tiger and Azure Dragon stand on either side.\nThe tiger roars, wind arises; the dragon spouts mist,\nMist and rosy clouds redden, outshining chaotic flames.\n\nScarlet fragments shatter into beads,\nBead upon bead—true pearls of crimson,\nCrimson blossoms with purple veins birth the Golden Duke.\nGolden Duke joins with water and earth,\nRefined into yellow sprouts that turn to white snow,\nPurple sand and rouge swirl in disarray,\nSwirling—Azure Dragon’s ointment.\n\nThe rouge, young; the White Tiger, aged,\nRefined into dragon’s ointment and tiger’s marrow,\nIn the Hall of Longevity, the wish-fulfilling jewel is born,\nWhat are ten thousand taels of gold to this?\n\nWhat are ten thousand taels?\nIt can touch the withered elder, granting eternal youth,\nThe Hall of Longevity’s elixir brings myriad springs,\nThe radiant sun nourishes, the Pillar of Heaven gleams.\n\nWhen the Pillar of Heaven gleams, soul and spirit unite,\nToad’s marrow and hare’s essence—mercury floats white,\nSpirit responds to soul’s radiance, birthing jade mushrooms,\nThe Divine Mansion of Broad Cold, the palace of Chang’e.\n\nCinnabar’s flying light rises, shaking Li’s restraint,\nThe Golden Crow flies into the Palace of Broad Cold,\nFlaming mists and rosy clouds—dragon’s exhaled vapor,\nVermilion cinnabar descends, purple-gold crimson.\n\nCrimson blossoms of purple-gold, golden blossoms of purple,\nGolden blossoms trace purple clouds in purple haze,\nHaze threads golden light through purple mist,\nCrimson and purple blend, concealing golden hue.\n\nPurple radiance shines sunward, ascending golden-green,\nGolden-green void-blue births purple radiance,\nVerdant haze clears to azure, merging with blue mist,\nMist’s blossoms—numinous essence, numinous cinnabar sap.\n\nCinnabar sheds its crimson, turning azure-green,\nIn form, it manifests in the unseen,\nScattered, the dragon hides like a ghost in concealment.\nLike a ghost in concealment, it flees—water and fire cannot trace it,\nYet when cinnabar and mercury cling to form, water and fire arise,\nWithout true lead, it truly cannot be.\n\nTruly cannot be—\nCinnabar hides within lead, stone conceals fire,\nStrike stone to see fire, fire births mist,\nWithout striking, the mist’s essence remains natural,\nCinnabar hidden in lead is also natural.\n\nWater nurtures, fire nourishes—only then is there resonance,\nResonating, it penetrates, birthing golden liquid,\nGolden liquid unites with spirit, eternally numinous,\nFlaming, it connects spirit with qi.\n\nSpirit rushes, qi moves—wind and thunder drum,\nDrumming wind and thunder, fire gives birth to earth,\nKan’s wu, the mysterious earth—metal is the father,\nLi’s ji, the receptive earth—mercury is the mother.\n\nMercury as mother—the Supreme’s words:\n“The world has a beginning, which is the mother of all under heaven.”\nHeaven above, vast and azure,\nCrystal numinosity, flying light,\nTrue numinosity summons—cinnabar and mercury take flight,\nFlying light of cinnabar,\nFiery flames press close in pursuit,\nBoiling, the sound is mournful,\nIts voice echoes over rivers, responding to emptiness,\nWhat does emptiness give birth to?\nWater’s surge, fire’s seething.\n\nFire seethes—the Weaver Girl’s qi wanes,\nWater surges—the Infant Boy sheds blackness,\nShedding black, purity reveals the treasure,\nQi wanes—red departs from its hue.\n\nThe Great Yang shines,\nThe Great Yang unfurls its light, renewing daily,\nThe sun’s renewal—mercury’s first coagulation,\nLead and mercury’s first coagulation—what form does the elixir take?\n\nThe elixir’s form in heaven\nEmerges as sun and moon,\nThe sun as a flowing pearl,\nPrimal qi’s emptiness and nothingness,\nPiercing metal, entering stone,\nSpirit emerges, ghost vanishes.\n\nSpirit emerges—spirit ascends to Heaven’s Gate,\nAt once the celestial soul;\nGhost vanishes—ghost enters Earth’s Door,\nAt once the terrestrial spirit.\nCelestial soul and terrestrial spirit encircle the ancestral origin,\nMutually serving as chambers, dividing at zi and wu,\nWater and fire intersect, fire gives birth to earth,\nTwo earths form the gui, silver transforms into gold,\nLi’s fire chamber holds Kan’s essence.\n\nLi’s essence-light,\nHeaven’s One lies hidden,\nHeaven conceals its light,\nBrightness does not emerge,\nHidden brightness shines within,\nExternally, it connects with radiance.\n\nRadiance fills the void,\nLight and brightness interpenetrate,\nThis is the sacred day and sacred month where metal and fire meet,\nNuminous movement subtly connects,\nThe purple numinous elixir,\nThe elixir possesses numinous power,\nUniting with yang fire,\nFlaming, it burns the void.\n\nFlying light spreads qi,\nResonating, it penetrates,\nJade mushroom’s elixir essence,\nPierces mist, enters crimson.\n\nEntering crimson—fire’s blossom-light,\nClearly illuminating.\nThe illuminator is Li’s feminine,\nThe illuminator is Kan’s masculine,\nLi’s feminine and Kan’s masculine,\nLight and brightness interpenetrate.\n\nPenetrating the feminine into the masculine,\nTransformations are boundless.\nLayer upon layer, piercing mist—blossoms upon blossoms,\nBlossoms arise from the two luminaries,\nTrue Wood, true Metal.\nTrue Wood binds the east—Zhen’s thunder arises,\nZhen is the eldest son—Zhen’s Wood gives birth to fire.\nZhen is also the dragon,\nThe dragon follows fire’s path—fire is true.\n\nIts west—Dui conceals Metal and Water,\nWater can harmonize with geng,\nDui is the youngest daughter.\nTiger’s roar births wind,\nWind and rain take form and sound,\nSwift and ceaseless,\nForm and sound leave no trace,\nMetal and Wood intersect,\nThe two qi descend with numinosity,\nForge into golden essence.\n\nGolden essence, the great elixir,\nWithin it, the Five Phases,\nThe Five Phases’ numinous water,\nNuminous water’s golden nectar,\nNuminous water, numinous fire.\nThe two are intimate,\nWater within fire,\nGold contained in water.\n\nTrue yang mercury receives metal’s qi,\nZhen unites with geng and xin, entering the you position,\nZhen receives the yang tally, gradually forming the ninefold brilliance of radiant light.\nZhen’s initial presence,\nFrom the beginning, entering the turning Zhen, giving birth to numinous Kun,\nThe initial six transforms into Zhen’s initial nine.\nIlluminating the six geng—geng belongs to you,\nZhen governs five days as one pentad,\nZhen arrives to receive the tally for sixty hours.\n\nThe upper yang cycle ends and begins anew,\nEnding at Zhen, beginning at Dui,\nDui pursues the yin tally, Kun’s six-two,\nExchanging lines, the image’s transformation cannot be fathomed.\nSix-two changes to yang, becoming nine-two,\nThis is metal entering the realm of fire,\nThe moon traverses the ding position, half-wheel light,\nWhy does metal serve fire?\nHow does Dui resonate with six ding?\n\nDing belongs to ji, Dui to metal,\nDing belongs to fire,\nMetal and fire intersect, fire gives birth to earth,\nEarth gives birth to metal,\nMetal and fire begin at Dui,\nGoverning five days as one pentad.\nDui arrives to receive the tally for sixty hours,\nThe middle yang cycle,\nEnding and beginning anew.\nEnding at Dui, beginning at Qian,\nYang departs, yin arrives—naturally so.\n\nYang’s extremity is Qian, yin’s extremity is Kun,\nQian ends at nine, yin ends at six,\nSix-two and six-three—three changes form nine,\nNine-three, vigilant at dusk—forming Qian’s body,\nIn full brilliance, it roundly illuminates the east’s jia.\nThe six jia belong—Qian governs three and five,\nQian governs five days as one pentad,\nQian arrives to receive the tally for sixty hours,\nThe lower yang cycle—thirty-five preceding,\nAccumulating one hundred eighty hours—symbolizing half a year,\nVirtue completes Qian’s body, uniting the two eights,\nYang’s extremity gives birth to yin—Qian’s body is full,\nRetreating yang, approaching yin—turning to receive at Xun,\nXun governs the yin tally, Kun’s initial six,\nSix xin forms Xun, forming from sixteen,\nSixteen to twenty-six,\nXun is about to give birth to Gen.\n\nXun governs five days as one pentad,\nXun arrives to receive the tally for sixty hours,\nThe upper yin cycle—ending then beginning.\n\nEnding at Xun’s hexagram, beginning to form Gen,\nXun and Gen exchange lines—images now fixed.\nImages now fixed, Gen unites with six bing to receive Xun,\nSix-one Xun, six-two Gen,\nSix-three presses near—yin flourishes in full.\n\nYin flourishes, water waxes as fire wanes,\nThe twenty-third day belongs to the last quarter.\nLast quarter—Gen’s fire naturally wanes,\nGen governs five days as one pentad,\nCeasing at Gen, it arrives to receive the tally for sixty hours,\nThe middle yin cycle—ending then beginning.\n\nEnding at Gen’s hexagram, beginning to form Kun,\nKun’s image is black,\nYi and gui’s six-three—Kun’s yi,\nSix-one belongs to Kun—thirty days,\nKun governs five days as one pentad complete.\n\nKun arrives to receive the tally for sixty hours,\nThe lower yin cycle—ending then beginning,\nBeginning at the prior three-five,\nEnding at the latter three-five.\nSix pentads—dusk and dawn receive cold and heat,\nDusk and dawn, darkness and new moon—shifting in turn,\nDarkness accumulates one hundred eighty hours—symbolizing half a year,\nAfter the prior quarter, before the latter quarter,\nSix pentads, three decades—symbolizing one year,\nOne year fully employs twelve nodes,\nHexagram fire wanes and waxes through each month.\n\nOne month, six pentads—one celestial cycle,\nFirst the prior heaven, then the succeeding heaven,\nTime tallies ten thousand three hundred.\nTen thousand three thousand—fire tally complete,\nStandard for three years.\n\nThree years—fire refines the flowing-pearl tripod,\nThe tripod resembles summoning yang to gather the celestial mirror,\nWithin the tripod, light reflects the sun’s rosy glow,\nGlow reflects the sun’s essence to unite with the tripod.\n\nUniting the tripod, the sun’s red transmits the gnomon’s shadow,\nThe gnomon’s shadow moves south to the sun’s bing,\nThe sun reaches bing-noon—lines merge with mercury,\nStriking the spirit chamber.\nSpirit drinks the shadow,\nDrinking the shadow, deeply drunk—drunk then sober,\nSpirit and qi harmonize—spirit mellows.\n\nSpirit mellows,\nTrailing flames, flickering,\nCirculating numinous light in a circle.\nLight—mirror’s surface, fire’s crystal plate,\nThe crystal plate scatters like golden grains.\nGolden grains—fire’s radiance, Mars’ glow,\nDrunk like willow and wheat—color deep yellow,\nThe Grand Granary’s spirit abode—plate brimming.\nBrimming, glinting—crystal radiance,\nNight belongs to the moon’s essence—tripod’s image white.\n\nTripod’s image white—this is the moon’s fullness,\nTripod connects to heaven,\nIn heaven, the moon is full—so too the tripod.\nIn heaven, within the tripod—hexagram belongs to Qian,\nQian’s substance,\nTripod’s round brightness moves with the moon’s fullness,\nLight like a mirror’s surface, a crystal plate,\nRefining silver toad—moon-round.\nMoon full, waxing at Xun—waning at its side,\nDarkness belongs to yin tally—tripod’s image black,\nNew moon’s image white, darkness’ image black,\nBlack and white, waning and waxing—round and crescent,\nWithin round and crescent,\nMoon bright at midnight—listen to the watchman’s clepsydra.\n\nAs the clepsydra ends, the day gazes at the gnomon’s plate,\nLong gazing at the shadow—forgetting the prior day’s sunset,\nSunset at you—rosy glow,\nImage responds to cinnabar.\nWithin the tripod, together reflecting—knotting red glow.\n\nTripod—exquisite, resonant,\nResonant fire transforms into lotus,\nFire tally knots—gathering the sun’s primordial chaos,\nPrimordial chaos—not the ordinary sweetness of honey on the tongue.\nFeeding, unaware—body follows the wind,\nLightly rising, soaring—riding the great void.\nRiding the great void—revealing the immortal lineage,\nDo not speak of meeting again in the next life,\nToo foolish and ignorant,\nCease discussing wondrous being—speak of true emptiness.\n\nRight and wrong the same,\nEmptiness is precisely form, form is emptiness,\nIts color—verdant, shining red.\nI reveal to you my family’s tradition,\nThe great yang moves within the moon’s brightness,\nMoon’s brightness—great yang, heaven’s medicine,\nWhen one ingests it—riding simurgh and crane.\nTen thousand methods, a thousand gates—all are mistaken,\nLearn this one move of my family,\nThis one move—leaping beyond the five phases, truly joyous.\n\nThe golden tripod—empty, without discussion.\nI have heard that in high antiquity, refining the elixir\nMust rely on method,\nWondrously meeting across many lives,\nPredestined affinity—encountering to become true,\nThis is called mutual attainment,\nGaining the numen of heaven and earth.\n\nSomeone asks: The numen of heaven and earth,\nBorn from where?\nAnswer: Chiseling open primordial chaos,\nEarth divides into yellow and black,\nGiving birth to heaven and earth’s golden essence,\nDeeply hidden in the murky depths,\nAs the Dao’s root,\nWhen feathered guests obtain it, they can create the golden tripod.\n\nMoreover, the golden tripod—\nFrom what is it born?\nFrom what does it arise?\nAnswer: Born from formless,\nThe beginning of the nameless,\nThe mother of the ten thousand things—what is it?\nThe child obtains golden essence to establish the foundation of life,\nThe foundation of life is merely the golden flower’s pool,\nThe flower pool’s spirit water—great abyss’ crystal,\nThe great abyss’ golden crystal—surpassing the ten thousand numina,\nThe ten thousand numina are called the mother of the ten thousand things,\nFormer sages took it to make the tripod’s gold.\n\nTripod’s gold—originally sought within medicine,\nSought—it is not the world’s gold,\nThe world’s gold—what is extraordinary?\nGolden tripod, tripod’s gold—connecting heaven and earth,\nConnecting the three luminaries, the tripod receives the tally,\nMercury invades the golden tripod—qi generates emptiness,\nEmpty qi generates emptiness—nothing generates being,\nBeing generates nothing,\nOriginally having nothing—nothing.\nNothing transforms the pivot,\nThe pivot’s natural true kind,\nWhy worry water and fire will not nurture?\n\nWater moistens downward—water above,\nPo absorbs mercury—hun sways the pattern,\nFire below—fire flames upward,\nFire nurtures water—generating according to line images.\nYang image—flowing pearl, water makes the elixir,\nYin image—following metal, water grows,\nMetal, water, fire—named three-five,\nMetal three-five,\nMetal governs the exterior—mercury dwells alongside,\nZhen’s green dragon, Dui’s white tiger,\nQian’s body—round brightness, metal three-five.\n\nMetal gradually darkens, water gradually rises,\nWhite tiger wanes and waxes—transforming into black tiger,\nXuanwu—yin born, entering gui’s realm,\nXun, Gen return to Kun—water three-five.\nMetal as child, water as mother,\nYin tally, yang fire—dividing zi and wu,\nHard and soft, civil and martial—shifting in turn,\nFire born, fire extinguished—transforming into earth.\n\nThis is fire three-five,\nWater and fire intersect the four directions,\nMetal acts as fire—about to wane,\nOnce as water—about to generate fire then ending, fire then beginning,\nWaning then ending, generating then beginning,\nFixed floating and sinking—metal transforms into water,\nDividing the clepsydra—white transforms into black,\nBlack then ending, white then beginning,\nBlack and white come and go—following the moon!\n\nKnowing white, come to guard black—depart,\nThree hundred sixty-five degrees.\n\nOpening the Gate of Life and sealing the Door of Death,\nwater and fire roam leisurely within the crucible and cauldron.\nWater and fire without error—yet the medicine holds numinous power.\nWhy numinous?\nWater dissolves, fire steams and seethes,\nwater and fire act as matchmakers to summon the solar soul.\nThe soul expands, the spirit shatters—yang’s radiance takes flight,\nthe po devours the soul’s bloom and feeds on azure sand.\n\nFeeding on azure sand, feeding on horse-tooth spar,\nhorse-tooth spar’s numinous marvel unmatched in the world—\nearning the name \"flowing soul.\"\nSoul crosses water, water crosses soul,\nthunder shakes yang brightness—heavenly tally descends in obeisance.\nDaybreak aligns with the sun’s end—\n*hasten, hasten, as in the statutes and ordinances!*\n\nUrge the soul to pursue and tame the tiger’s den,\nbreathing in wind and clouds, drawing in water and fire.\nWater and fire boil and roar—the tiger’s roar resounds.\n\nWater’s numinous essence gleams, fire’s numinous essence gleams,\nwater’s numinous spirit, fire’s numinous spirit—po and hun.\nThe po’s numen can absorb the hun’s luminous essence.\nHun absorbs po, po absorbs hun—\nhun absorbs po, then hun settles the crucible;\npo absorbs hun, then po crucibles the hun.\n\nNow, the hun-crucible:\nit subdues and restrains mercury, preventing it from flying,\nsoaring and playing within the crucible’s light.\nScattered rosy clouds dissolve in searing brilliance—\npurple gold and rouge powder—thus called \"hun settled.\"\nSettled, it does not move; moved, fire rises straight.\nFire’s straight ascent and descent—\nneither going nor coming—\nwhen applied, it becomes treasure.\n\nNow, the po-crucible:\nXuanwu’s tranquility—\ntranquil, then metal generates water.\nMetal can generate water—\nwater then clarifies and brightens.\nBrightness gives rise to gathered radiance—thus called \"po,\"\nthe crucible is indeed this.\n\nMetal nurtures water, fire nurtures metal,\nhun longs for po, po longs for hun—\nnaturally, the golden crucible governs spirit and brightness,\nproducing cinnabar whose nature aligns with essence—\nnot mere cinnabar or mercury.\n\nThe great medicine, the golden elixir—three times eight grades,\nmyriad images and hexagrams arrayed within the golden crucible.\nWater and fire applied with depth and precision,\nthe twenty-four qi mutually advance and align.\n\nSeen yet unseen, heard yet unheard,\nlong life and wondrous years refine the golden crucible.\nFired into priceless treasure—\nreversing yang, transmuting bones into purple dissolution and gold.\n\nPurple dissolution and gold commune with spirit and numen,\nthe golden crow enters yang—light advances.\nAzure rosy clouds dance, crimson rosy clouds move,\nazure and crimson together return to the golden crucible.\nRefined into the alchemical furnace—\nnine returns, seven reversions smelt the void.\n\nSeven reversions smelt into red jade powder,\nnine returns smelt into purple gold nectar.\nPurple gold nectar, red jade powder—\nhun harmonizes with po, po harmonizes with hun.\nOriginally possessing void, void transforms into spirit.\n\nSpirit transforms into qi, qi transforms into water,\nwater transforms into wood, wood transforms into fire,\nfire transforms into earth, earth transforms into metal,\nmetal transforms into water.\nDrill, cluster the five phases within the golden crucible—\nthe two luminaries ascend in radiant splendor.\n\nWater flies, fire flies—\nLi transforms into fire, Kan transforms into water.\nWater excites fire, fire excites water—\nLi chews Kan, Kan chews Li,\nmutually chewing, grinding like rainbow-shedding, rainbow-shedding qi,\ncondensing into saltpeter-like fragments.\nHorse-tooth spar’s teeth gleam with luminous purity.\n\nLight pursues the living into tiger’s amber,\non the purple gold terrace, frost and snow congeal.\nIts hue like jade, ethereally drifting—\nyang qi, light and pure, gently wafting.\n\nLight and pure yang sand gleams like the sun,\nglittering, vying in brilliance—sand outshines color.\nFlickering, resplendent—yellow chariot’s numen,\nthe chariot’s numen can transmute and quicken life.\nThe chariot’s numen originally emerges from Fusang,\nits essence found within lead, derived from sand.\nIts ascending light scatters like grain, stars fly in disarray.\nStars ground fine—azure dragon’s bones—\nthe most divine, most sagely flying substance.\nIf it does not fly, how can one know?\nTest by tossing a bit into the void—\nsurely it possesses the power to return to heaven.\n\nCinnabar soars high, ascending into the sky,\nvermilion seen rushing into the golden crow’s den.\nLight and pure yang nurtures the yang medicine—\nradiance shoots toward yang, light illuminates the medicine.\nMutually shining, mutually searing—merging their light,\nbreath by breath, purple radiance ascends to the Great Yang.\n\nGreat Yin and Great Yang—true water and fire.\nWater overcomes fire, fire extinguishes—greatly transforming into earth.\nHidden brightness, subdued fire—earth’s latent radiance,\nlatent radiance conceals void, void transforms into qi.\nVoid qi connects, linking above and below.\n\nLinking above and below—fire follows the hexagrams.\nHexagram fire waxes and wanes—when full, it prospers.\nIlluminating yang’s light, fire ignites brilliance—\ncountless thousands of miles.\nLight generates fire’s prosperity—\nyang’s essence pursues fire, fire summons yang.\nYang’s burning mirror sears the sun—\nilluminating yang without end or limit.\nFire triumphs, light surges—qi’s light circulates.\nLight penetrates the earth, earth connects with primordial qi.\nFire follows light, fire’s qi circulates—generating the ten thousand things.\nBefore one’s eyes, fire transforms, shining with yang’s light.\n\nYang’s burning mirror gathers yang’s light, stirring and resonating.\nStirred, it then connects—generating the indistinct.\nFlourishing, blazing flames—yang’s essence.\nLight pierces mist, giving birth to fire’s dazzling splendor.\n\nYang’s light follows into the golden abode,\nilluminating the Qian and Kun’s cinnabar world.\nGolden sand sprays fire, scattering yang’s light—\nthe great earth’s yang light generates the world.\n\nLight pursues spirit, spirit pursues light—\nthe great thousand-worlds of sand lie hidden within.\nWhen kalpas exhaust the Ganges’ sands of worlds,\none grain of sand, one kalpa—yang’s light is lost.\n\nYang’s light lost—what name remains?\nFrom Dragon Han to Yan Kang, to Crimson Brightness—\nthese speak of kalpas already sunken and drowned,\nkalpa’s power inescapable, unheard of.\n\nBlack winds drift, losing the Three Powers,\ntoppling peaks, collapsing mountains—all reduced to dust.\nEarth, water, fire, wind—all swept away,\nhouses and towers, all utterly submerged.\n\nAll creatures, all life lose sustenance,\nno distinction between south, north, east, or west.\nThe forest of myriad images—no trace remains,\nthe five phases, four images—where to seek?\n\nSound, resonance, form—inescapable.\nChaotic primordial light all darkens—\nprofoundly still, returning to profound profundity,\nunilluminated depths reaching the utmost extreme.\n\nAt the utmost extreme, it returns to the origin,\nreverting to the root, returning to the origin—before heaven and earth.\nBefore heaven and earth—\none qi can divide heaven and earth’s origin.\nPrimordial yellow’s upright qi—true unity’s ancestor,\nable to generate the myriad images as the elixir’s mother.\nBy the mother, omens are established—forming the elixir’s foundation.\nOmens summon the Azure Waist messenger to return.\n\nThe Azure Waist is summoned into the Hall of Lingering Light,\nrefined into window dust—light no longer appears.\nWindow dust is also called \"sun’s yellow haze.\"\n\nThe Great Yang transforms—\nwhen the Great Yang transforms, what occurs?\nWater and fire flow through the twelve hours,\nwithin the twelve hours, zi and wu exist in the center.\nMao and you divide the four nines—\nfour nines, fire drills thirty-six.\nZi and wu, mao and you divide north and south.\n\nWu belongs to yang—yin fire arises.\nChen, xu, chou, wei divide the four eights,\nfour eights, fire drills thirty-two,\nwater and fire simmer and boil to achieve completion.\n\nZi belongs to yin—yang fire arises.\nYin, shen, si, hai divide the four eights,\nfour eights, fire drills thirty-two,\na hundred marks of time divide day and night.\nDay is heat, night is cold,\ncold and heat clearly follow yin and yang.\nYin and yang divide like a chicken’s egg,\nlife and death ever cycle in seven at beginning and end.\n\nOn the third day, geng arises in Zhen, received by Dui in the west—\nthis is the soul born in Kun, dwelling in the northeast.\nThe po perishes in yi—this is the soul’s death.\nDeath and life connect without cease.\nWood three, metal four combine to make seven,\nyin and yang divide into two crescents.\nWhen metal womb and Kun unite with Qian,\nenvelop Qian and Kun—must be firmly sealed.\n\nHand-capture sun and moon to form the spirit chamber,\nKan’s palace radiates with Zhang Lihua’s brilliance.\nThe spirit chamber is round and bright—three, five, one.\nThree, five: geng, Zhen, Dui, Qian.\nKun envelops yi and gui as yin yi,\nhiding crescent, full, waning, and new moons’ palaces.\nBlack and white, waxing and waning—fortune or misfortune.\nFortune should be full, misfortune deficient.\nWhen spirit and qi transform, losing rhythm,\nthe metal womb and spirit chamber resemble the Great Yin.\nIf you doubt, just observe the moon above.\n\nYellow and white within establish essence and soul,\npo white, hun yellow—hun enters po.\nYellow becomes white, white returns to yellow,\nessence black turns back, yellow turns black,\nblend essence and hun to refine po’s blackness.\n\nScattered light reveals yellow and white,\nyellow and white coalesce, their lights connecting.\nHeaven’s Great Yang is born, earth’s moon is born.\nThe tiger inhales the dragon’s light—body becomes luminous.\nWithin the white metal womb, yellow gold is produced.\nYellow gold and white gold divide two and eight,\npassed down through ages—dare not leak.\nTell the common folk, yet they will not believe.\nIf they doubt, just let them observe like Hua.\n\nAbove, there is originally one move—\nrecognize the medicine that births heaven, earth, and man.\nHeaven-born, earth-born—also man-born.\nYou must ponder and seek carefully.\nWhen found, ascend to Jade Capital,\nriding phoenix and crane, you ascend.\n\n*On the Hall of Luminous Virtue*\nThe Hall of Luminous Virtue has three names:\nin Xia, it is called the Generational Chamber;\nin Shang, the Double Chamber;\nin Zhou, the Hall of Luminous Virtue.\nIt is the palace where the Son of Heaven enacts upright virtue,\nwhere ministers and officials arrange hierarchy.\n\nThe Hall of Luminous Virtue venerates the Gate of the Solar Door,\nestablishing the Upright Yang.\nFrom ancient times to now, those who honor true spirits\nare called the Hall of Luminous Virtue.\nThe Yellow Emperor, on Jing Mountain,\nrefined the golden liquid divine elixir,\nbuilt the Chamber of Primordial Unity.\nIts chamber, kindled by fire, generated yang light.\nAccumulated yang becomes luminous—\nalso called the Hall of Luminous Virtue,\nor the Azure Spirit Abode.\n\nResponding to the images of sun and moon,\nit becomes the dwelling of spirit and brightness.\nIts dimensions vast, great luminosity in four directions,\nspirits and gods communicate with the numinous.\nSpirits are water, fire, wind, and clouds.\nWater and fire return to storage—\nfire stores in the abode of Li,\nwater returns to the land of Kan.\nWind and clouds, dragon and tiger,\nwest rises to meet east,\ncompleting Xu and Wei, Tail and Winnowing Basket—\nthe twenty-eight constellations.\nThe crow falls in geng and xin,\nstimulating transformation and birth.\nQi levels in the west,\nwater, fire, metal, wood—\nmutually overcoming, mutually generating,\nthe five phases reverse and repeat.\nReversed, they invite misfortune;\naligned, they bring fortune.\nJoy may bring great peace,\nanger may spawn weapons and war, inauspicious omens,\ndisasters appearing instantly.\n\nMountains and hills,\nhalberds and spears—\nkilling qi invades the heavens,\nsand flies, stones roll,\ncomets wander,\nVenus startles the skies.\nThe state faces collapse and peril,\nfire’s harmony is disrupted.\nThus metal and water circulate in brilliance,\ndragon and tiger simmer and roar.\nSuch is the image of yin and yang overcoming,\nmutually generating and killing.\n\nMoreover, weapons and war\nare the image of metal and fire’s stirring.\nJoy stirs thunder’s roar,\nthunder roars with shaking resonance.\nShaking resonance is yang brightness’s fiery dryness—\nfire’s dryness harms metal,\nscattering marriage and loss.\nWhat seeks the metal liquid?\nBlazing fire spreads wildly,\nvainly setting below—\nthe dark pearl burns, fire worms hunger,\npo weakens, hun flies—\nthen the divine elixir is far indeed!\n\nWater must not be too abundant—\nabundance lets yin invade its viscera.\nYin stands, then yang is not full.\nYang cannot overcome yin—\nJueyin drums wind,\npushing to harm and damage wood.\nDamaged wood is spirit,\ndragon and tiger embrace illness.\nWithin illness lies bing—\nthus it is called disease.\nDisease means sun and moon do not exchange bing,\nnot exchanging bing means numbers diverge from their pairs.\nYang loses its contract,\nyin invades its brightness—\nthis is the image of yin and yang not uniting.\n\nIf yin and yang are unsettled,\nthen the four images do not stand,\nthe eight trigrams are not divided.\nMoreover, whence does cinnabar arise?\nFire’s body is yin and yang,\nattaining the mean of water and fire.\nThe two deplete the vessel, relying on victory or defeat,\non the elixir foundation’s firmness.\nThus, facing and turning avoid negligence,\nembodying the two crescents,\nuniting metal and water’s transformations,\ngiving birth to emptiness,\nentrusting the medicine’s transformation.\nThe medicine’s transformation has returning light—\nwithin no-thing, there is something.\nReturning something is returning nothing—\nnothing is nothing’s firm necessity,\nsomething is firmness’s essence.\nThe two ends of being and non-being—\nlisten as I briefly expound.\n\nMoreover, non-being is the qi of water, wood, metal, and earth,\nthe four directions concealed in emptiness.\nMoreover, the Dao is stored within it!\nThis speaks of formless form taking shape—\nwhere does shaped form arise?\nNot grasping the principle of non-being,\ndare not rashly evaluate.\nHeaven and earth’s essence and spirit\nmust not be lightly raised.\nAlas, not obtaining refinement—\ncan one take it? Not obtaining distinction—\nhow can one plan?\n\nMoreover, being is the vessel of earth, metal, and primordial yellow.\nIts vessel, receiving fire, expands—\nthen sets forth to summon responses.\nAt first, as if present, as if absent,\nif present, then misty and faint,\nthe Dao hidden in the subtle and obscure.\nSubtle, then stirred by misty vapors;\nobscure, then moved by swirling clouds.\nSubtle and obscure stir and move,\nmisty vapors and swirling clouds—bellows and pistons.\nAt the beginning, the foundation is laid,\nomens already sprout—\nthe Great Yin transforms and gives birth.\nTransformation is spirit’s movement,\nspirit’s movement is qi’s transformation.\nCongealing and accumulating form substance.\nSubstance, deep blue—\nrosy fire flows with light.\nLight’s essence condenses,\nessence’s redness penetrates the po.\nRed shadow arrives at dawn,\ncondensing into jade’s rosy clouds—\ncalled Li’s red flakes.\nLi’s red flies,\nlight red soars,\ndivine beings take flight,\nfive colors soaring—\nsoaring five colors,\nthe Great Yang’s azure light.\n\nYellow, white, black, and yellow—\nyellow resides at the center,\nthe sovereign father, the Great Yang.\nThe Great Yang’s yellow Dao,\nthe yellow Dao turns north,\nthe black Dao returns in cycle,\nthe yellow Dao returns in cycle,\nthe returning yellow aligns with the pitch-pipes,\npitch and pipe mutually engender.\n\nAt winter solstice, the one Yang—\nwhy is the day so short?\nWhy is the night so long?\nFor four nights,\nthe nine Yins overpower its Yang.\nThe Yang, though born, has not yet recovered;\nthe shadow’s length grows with the hour,\nthe time measured by the moon’s passage,\nthe day’s birth at winter solstice’s extreme.\nWithin nine days of winter solstice’s extreme,\nthe shadow advances by one *ke*;\nfive nines, five *ke* advanced, then complete—\nforty-five days mark the onset of spring.\n\nAfter the onset of spring, nine days pass,\nwithin those nine days, the shadow advances by one *ke*;\nfive nines, five *ke* advanced, then complete—\nforty-five days align with the spring equinox.\nAfter the spring equinox, nine days pass,\nwithin those nine days, the shadow advances by one *ke*;\nfive nines, five *ke* advanced, then complete—\nforty-five days mark the onset of summer.\n\nAfter the onset of summer, another nine days,\nwithin those ninety days, the shadow advances by one *ke*;\nfive nines, five *ke* advanced, then complete—\nforty-five days mark the four seasonal nodes alike.\nFrom the onset of summer to the day’s center, sixty *ke*—\neach *ke* sees the day’s shadow gradually lengthen.\nThe sun reaches its southern extreme;\nafter the summer solstice, nine days retreat,\nwithin those nine days, the shadow retreats by one *ke*;\nfive nines, five *ke* retreated, then complete—\nforty-five days mark the onset of autumn.\n\nAfter the onset of autumn, nine days pass,\nwithin those nine days, the shadow retreats by one *ke*;\nfive nines, five *ke* retreated, then complete—\nforty-five days align with the autumn equinox.\nAfter the autumn equinox, nine days pass,\nwithin those nine days, the shadow retreats by one *ke*;\nfive nines, five *ke* retreated, then complete—\nforty-five days mark the onset of winter.\nAfter the onset of winter, nine days pass,\nwithin those nine days, the shadow retreats by one *ke*;\nfive nines, five *ke* retreated, then complete—\nthe eight nodes conclude in forty-five days.\n\nThe eight nodes span three hundred sixty days,\nday and night total thirty-six thousand *ke*,\nthirty-six thousand *ke* of hourly reckoning.\nAt the hour’s reckoning, the *ke*—\nat winter solstice’s midday, forty *ke*,\nthe day’s shadow swift as lightning’s flash,\nthe Great Yang’s rapid speed, its light unceasing.\nNaturally, the Yang’s qi seeks concealment and storage.\nYang concealed, Yin employed without rest;\nYin born, Yang grown—sixty *ke*.\nYang’s end, qi ascends, Yang’s light emerges.\n\nNinefold radiance bright,\nninefold light enfolds jade-green radiance,\njade-green radiance—the divine’s revered luminosity.\nRevered luminous divine yellow,\nthe divine ascends the Hall of Light,\nthe divine is called emperor-king.\nThe emperor-king transmits the red,\nthe Red Emperor bestows color,\nthe Azure Emperor receives virtue,\nthe White Emperor engenders light,\nthe Black Emperor’s profound yellow.\nThe Five Emperors blend as one,\nblended divine light,\ndivine light lush and luxuriant,\ndivine power boundless.\n\nThe divine’s extremity receives rectitude,\nrectifies its divine color.\nThe divine conceals within its chamber,\ndivine yellow, divine black—\nyellow-black divine essence.\nYellow is the Metal Spirit,\nblack is the Northern Numen.\nBlack is water’s foundation,\ninwardly cherishing its essence.\nIts essence most numinous,\nits essence most steadfast.\n\nThe Supreme declares:\nIts essence most true,\nwithin it lies trust—\ntrust that responds without fail.\nThat which responds to trust\nis Heaven’s tally.\nHeaven’s tally shines bright,\nflying tally wondrously numinous.\nNuminous movement subtly responds,\nresponding to the divine’s purple numen.\nPurple numinous divine medicine,\nmedicine possessed of divine numinosity.\nDivine medicine, numinous and spirited,\nthe flower of the primordial origin.\n\nSpirit with qi and essence,\nspirit ascends purple clouds,\nits qi circulates and turns—\n*Jia*, *Bing*, *Geng*, *Ren*.\n*Geng* and *Ren* are Metal and Water in mutual fullness,\n*Jia* and *Bing* are Water and Fire in flourishing abundance.\nTwo Fires form flame,\ntwo Woods form forest.\nFire and Wood, bound in kinship,\nsisters and brothers.\n*Kan* and *Li*, *Zhen* and *Dui*—\nmale and female in mutual intimacy.\nThe male crowned with Lesser Yang,\nthe female coiffed with Lesser Yin.\nYin and Yang harmonize in measure,\nthe numbers seven and eight.\n\nSeven and eight’s numbers complete,\nnine and six mutually attain.\nNew moon, full moon, first quarter, last quarter—\nthese four span thirty days.\nThe numbers nine and six—\nold Yang, the *Qian* father,\nold Yin, the *Kun* mother,\nthrough the mother, kinship is achieved.\nComparable to human relations,\nthe father governs the son,\nthe son governs the grandson,\ngeneration upon generation,\nkinship ever deepening.\nLead and mercury in mutual intimacy,\nno different from human relations.\nYin and Yang in union,\nthe essence of purity.\n\nThe numinous continues its radiance,\nradiance continues the numinous.\nWithin the radiance-numinous palace,\nthe tiger’s roar, the dragon’s song,\nthe five tones harmonize,\nthe six pitch-pipes’ Yang brightness.\nYang-bright divine light\nillumines the Hall of Light.\nThe Hall of Light’s rectified virtue,\nruler and minister in harmony,\nenacting benevolence, establishing righteousness,\npracticing martial arts, cultivating letters.\nLoyalty, trust, ritual, wisdom—\nthe five constants in peace.\nThe imperial transformation spreads beneath heaven,\nenriching the state, pacifying the people.\n\nThe various celestial bodies traverse their courses,\ndivine qi fills the chamber.\nThe five qi intermingle,\nthe divine descends in a rushing torrent.\nQi like mist and haze,\nintertwining with the divine’s governance.\nThe Dao of intertwining\nfollows the sequence of qi.\nThe sequence of qi without error—\ndusk and dawn, cold and heat,\nday’s heat, night’s cold,\nYang’s flow, Yin’s infusion.\n\nThe Palace of Vast Cold congeals water’s flourishing cinnabar,\ncinnabar crystallizes, delicate as horse’s teeth.\nHorse’s teeth are originally the Golden Crow’s bones,\nthe sun’s resplendent essence returns to the moon’s grotto.\nThe moon’s grotto, sunlit, becomes the white Hall of Light—\nthe Hall of Light is the chamber of Metal and Water.\nMetal and Water mutually engender,\nMetal’s moisture engenders yellow liquid.\nLiquid boils in the crucible,\nmercury flows as divine water,\ncascading in threes,\nlayer upon layer,\ncongealing firm as solid ice.\n\nThe dragon coils, the tiger gazes,\nthe tiger’s nature, the dragon’s sentiment,\npursuing light, chasing brightness.\nWithin light, indistinct and vague;\nwithin brightness, deep and obscure.\nCinnabar’s numinous flower,\nthe flower’s essence—\nborn of divine luminosity.\nYin’s spirit, Yang’s brightness,\naccumulating Yang with Yin,\nYin with the spirit’s governance,\nYang with brightness’s governance.\nYin and Yang harmonize in measure—\nthe foundation of transformation and nurturance.\n\nTransformation refers to the sun’s triple illumination,\nnurturance refers to the moon’s triple movement.\nSun and moon unite their qi,\nthe two qi mutually propel.\nWater as one, Fire as two—\nunited, they form three.\nThree gives birth to the myriad things,\nthree’s transformations reach their extremity.\n\nThree is mercury,\nmercury’s transformation engenders the numinous.\nThe numinous flower stands alone,\na rare treasure, wondrous gem,\nthe five phases’ divine substance—\nthe medicine completed in the subtle and obscure.\nIf one questions the adept,\nthey surely cannot glimpse it.\nOnly those with resolve,\ncherishing it, await the hour.\nAttaining the true five phases’ wondrous use,\nborrowing the ordinary five phases’ Water and Fire.\nThe five phases’ mutual generation and conquest—\nsuch is the principle of nature.\n\nThe sage, numinous and enlightened, comprehends the transformations of Heaven and Earth—nothing more than the bending to complete the myriad things, penetrating the Dao of day and night. By day, he observes the sundial’s degrees, aligning with the celestial tally; by night, he listens to the water clock’s chimes, overseeing the *River Chart*. The moon’s phases trace their course, stars sparse in north and south; the void’s expanse below responds within the crucible. The spirit-turtle chases the fire’s pursuit, the Black Tiger floats to the White Tiger’s den, the Red Dragon leaps into the Green Dragon’s cave. The two medicines return to their origin, merging once more; cinnabar unites with Metal Elder. Mercury joins with lead, cinnabar befriends gold. Gold becomes the spirit-chamber, the Hall of Light’s true virtue; radiant and vast, the Mysterious Palace, where Qian and Kun unite as one.\n\nKun gives birth to Zhen’s Dragon, the Yang tally resumes its course; the Li soul enters the Po, revolving with Heaven’s display. Water spurs fire, the crucible and cauldron both resound; yin and yang revolve, Zhen receives geng and xin. Metal inherently conquers Wood—how then does it engender? The moon moves to ding’s position, Metal enters the Fire’s realm. Fire’s exuberance melts Metal, Metal supplants Wood’s flourishing; Fire extinguished becomes Earth, Earth can generate Metal, Metal can generate Water, Water can generate Wood. Conquering and engendering, they become each other’s parents. Parents beget the child, the child succeeds the parents. Kun gives birth to Zhen and Dui, Dui gives birth to Kun’s body. When the three and five qi are full, the Three Luminaries align. The Hare’s spirit generates light, the moon waxes in the east; the moon waxes then wanes, before the Yin Terrace. Sixteen govern the tally, the Yin tally resumes its course. Gen points to bing in the south; on the twenty-third day, when the three and five periods are complete, Metal enters the Water’s realm. Kun’s tally flows vast, Water returns to the north, congealing into Metal, transforming into Water.\n\nFire follows the moving lines, images follow man’s life—emerging and vanishing in the spirit-furnace, hidden in the recumbent moon. Nurturing the Metal embryo, transforming to generate Metal liquid, congealing like yellow butter, crumbling like golden grains. The Metal’s hue becomes translucent, shifting from yellow to red; illuminating the silk-wrapped fire, it becomes the Reverted Elixir. Opening the furnace, overturning the crucible, radiant clouds pour forth. Golden cinnabar like powder, ground fine as frost, blended and kneaded, molding yin and yang. Ninefold refined millet grains—offerings to Heaven complete—a myriad bushels of luminous pearls cannot exchange for a single grain. One grain ingested, the body sprouts wings; summoning wind and calling thunder, the ten thousand spirits attend at one’s side. Altering the four seasons, lingering with sun and moon, winter transforms to scorching summer, summer flies with frost and snow; autumn blooms with spring’s blossoms, spring scatters yellow leaves.\n\nThis is what is meant by \"the cosmos in the palm of one’s hand, the ten thousand transformations born from one’s body.\" The Long River turns to curds, transmuting gold beyond the Northern Dipper. I dare not speak falsely—discern the existence within nothingness. From nothingness, Heaven and Earth are born; I endure as long as Heaven and Earth. This Dao is most forbidden; its secrets lie in the mouth. Revealed recklessly to the vulgar, calamity and blame will surely follow. Practice with utmost care and secrecy, and the divine spirits will protect and bless you. Cultivate abundant hidden virtue, and immortality will surely be yours.\n\n*Record in the Stone Casket of Perfected Xu, Volume the Lower—End.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "许真君石函记 经名：许真君石函记。 二卷，假托许逊撰，当出於南宋。 底本出处：《正统道藏》续道藏。 石函目录 卷上 太阳元晶论 日月雌雄论 药母论 药物是非论 丹砂证道歌 卷下 圣石指玄篇 神室玄明论 金鼎虚无论 明堂正德论 许真君石函记序 真君姓许，名逊字敬之，汝南人。 其祖父世慕至道，西晋武帝太康元年，举孝廉，不就，朝廷加以礼聘，真君不得已，拜蜀郡旌阳县令。 因世乱，弃官入道，精志修炼，乃踵孝道明王之教，真仙飞举之宗，功着行成。 收斩蛇蜃，咒施符水，疗病回生，不计其数。 后於东晋孝武帝宁康二年，甲戌八月一日，於洪州西山，感上帝玉诏，举家四十二口并百好，拔宅上升。 乃留下一石函，谓曰：世变时迁，为时之记，后为张守发其函，得函中秘文九篇，乃真君修炼金丹之上道也，名《石函记》。 西山玉隆高士谢观复，洎高弟清虚羽衣朱明叔、东嘉郑道全等，递相授受，传至于今。 此文乃上品升举之机关，非丹术旁门之小道，宿有仙骨，获遇斯文，得之者宝而藏诸，非人勿示。 篇中誓愿深重，请细警焉！ 许真君石函记卷上 太阳元晶论",
      "translated_text": "**The Stone Casket Record of Perfected Lord Xu**\n*Title:* *The Stone Casket Record of Perfected Lord Xu*\nTwo fascicles, falsely attributed to Xu Xun. Likely composed during the Southern Song dynasty.\n*Source text:* *Zhengtong Daoist Canon*, *Supplement to the Daoist Canon*.\n\n**Contents of the Stone Casket**\n**Fascicle One**\n- *On the Primordial Essence of the Great Yang*\n- *On the Yin-Yang of Sun and Moon*\n- *On the Mother of Medicines*\n- *On the Right and Wrong of Medicinal Substances*\n- *The Cinnabar Song of Verifying the Dao*\n\n**Fascicle Two**\n- *The Mysterious Pointer to the Sacred Stone*\n- *On the Mysterious Clarity of the Divine Chamber*\n- *On the Void of the Golden Crucible*\n- *On the Rectification of Virtue in the Hall of Light*\n\n**Preface to *The Stone Casket Record of Perfected Lord Xu***\nThe Perfected Lord’s surname was Xu, his given name Xun, and his courtesy name Jingzhi. A native of Runan, his ancestors for generations revered the supreme Dao. In the first year of Taikang of Emperor Wu of the Western Jin (280 CE), he was recommended as a *xiaolian* (filial and incorrupt), but declined the post. The imperial court then extended a formal summons with honors, and the Perfected Lord, unable to refuse, accepted the position of magistrate of Jingyang County in Shu Commandery. Due to the chaos of the age, he resigned his office to enter the Dao, dedicating himself to cultivation. Following the teachings of the Perfected King of Illuminated Filial Dao and the lineage of transcendents who ascend through flight, his merits and conduct were perfected. He captured and slew serpents and miasmic creatures, healed the sick with incantations and talismanic waters, and restored the dead to life—countless were his deeds.\n\nLater, in the second year of Ningkang of Emperor Xiaowu of the Eastern Jin (374 CE), on the first day of the eighth month (jiaxu), at West Mountain in Hongzhou, he received a jade edict from the August Emperor. Together with his household of forty-two souls and all their possessions, he ascended bodily into the heavens, leaving behind a stone casket. He declared: \"As the world changes and the times shift, let this serve as a record for the age.\" Later, Zhang Shou opened the casket and discovered nine secret texts within—these were the Perfected Lord’s supreme methods for refining the golden elixir, titled *The Stone Casket Record*.\n\nXie Guanfu, the Jade Eminence of West Mountain’s Yulong, along with his eminent disciple, the Transcendent-Clad-in-Void Zhu Mingshu, and Zheng Daoquan of Dongjia, transmitted these teachings in succession, passing them down to the present day. This text embodies the mechanism of highest-grade ascent, not some minor path of peripheral elixir arts. Only those with the bones of immortals, who encounter this writing, should treasure and conceal it—do not show it to the unworthy. The vows within these pages are weighty; read with utmost caution!\n\n**The Stone Casket Record of Perfected Lord Xu, Fascicle One**\n*On the Primordial Essence of the Great Yang*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 478,
      "start_sentence": 0,
      "end_sentence": 27,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.829870462417603,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\许颠君石函记.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "玄元大道，无象无形，感於自然，而有动静。 动者，元阳也，元阳即元精，元精生真火，发生於玄玄之际，离合而成魂，乃日之始判也。 明出扶桑，九炁澄辉，腾光遍照，普天之下，所谓阳明之辉，红离透景也。 晶明照耀，涌出龙光，结成金霞，玉气珠彩，祥烟瑞光，满於空中，云藏九重，圣藏云光，贤藏云光。 金藏云光，玉藏云光，珠藏云光，香藏云光，华藏云光，水藏云光，火藏云光，放种种光，洞照天地，分霞逐彩，布气生灵。 生灵者，始生一，一生二，二生三，三生万物也。 水陆并济，不可胜计。 至於幽阴粪壤之中，坚刚顽石之所，山岩草木，生地成形，善走能飞，凶妖恶怪，无不遍也，无不通也。 且能飞者，有寻妖逐怪之禽； 善走者，有数夫不可当之兽。 至大有驼牛象马之畜，至小有芥粟微末之虫，朽蠹腐化，胎生卵湿，含灵蠢动，无不从也，无不由也。 各各禀性分形，因仪化质，随方逐位，各分其色。 得红而红，得黑而黑，得青而青，得白而白，得黄而黄，五行变易，感位而生，岂假染哉！ 至於含化育彩，含化者，石中感气，化而生灵； 育彩者，乃色分浅白，轻黄，淡红微翠，深青沉黑，异绿奇红，妙颜绝色，各得其态。 皆神运气化，而成自然之质也。 物得之者，气禀有浅探，故色象无定休，任其大道，自化者也，故云无形之形，神化之化，可谓道也。 所谓在天悬象，在地成形，在石成珍，聚精而为宝，宝即光明也。 奇哉！ 大道如是，孰能结金华也。 火盛消金，金伐木荣，木荣者，表阳而枝布，裹阴而华施，阴真君云：金华生兮天地宝，人会此言真至道也。 须臾时分斗转，象逐亏盈，盈则木盛而坚青，亏则华伐而凋零。 何也？ 始则阴阳相伐而成者，道之委也，伐则华残乱落，如飘红粉，是魂跃弄精神，轻红飞魂灵。 红有浅深，粉有重轻，色深休轻，飞而炎上者，若紫霜玄盖，在鼎凝结，即地黄金粉； 色浅休重，养之色变庚黄，是火养鲛鮹，乃丹阳换骨也。 魂随魄住，魄逐魂生，魂耀紫华，魄以收阳。 收阳魂气入魄腹，藏魂在魄腹，日月气双，龙呼虎彩，虎吸龙光，二气吞并，笼罩四方，合和四象，气禀中央。 故气一变而为水，二变而为砂，三变而为汞，四变而为金，五变而成丹。 此丹聚天地之灵晶，夺日月之光明，摄坎离之水火，追地魄，合天魂。 龙虎作丹砂，飞乌走兔华，，和光同入室，唯尊九五家，药物是非理，白虎青龙髓，根蒂出黄芽，金银满我家。 若将济人命，人命永年华。 得服之者，飞天涉水，龙鹤可驾。 此无它，皆之所化也。",
      "translated_text": "The Great Dao of the Mysterious Origin is without image or form, yet responsive to nature, manifesting in movement and stillness. Movement is the primordial Yang; primordial Yang is primordial essence, and primordial essence gives birth to true fire. This fire arises in the depths of the Mysterious-Mysterious, separating and uniting to form the hun-soul—thus begins the division of the sun. Its radiance emerges from Fusang, the nine qi congealing into luminous clarity, its ascending light suffusing all beneath heaven. This is the brilliance of Yang illumination, the crimson *li* penetrating the landscape.\n\nIts crystalline splendor shines forth, welling up with dragon-light, coalescing into golden mist. Jade qi and pearlescent hues, auspicious vapors and propitious radiance fill the void. Clouds veil the nine heavens: the sagely conceal their cloud-light, the worthy conceal their cloud-light; gold conceals its cloud-light, jade conceals its cloud-light, pearls conceal their cloud-light, fragrance conceals its cloud-light, blossoms conceal their cloud-light, water conceals its cloud-light, fire conceals its cloud-light. They emit manifold rays, illuminating heaven and earth, scattering mist and trailing hues, dispersing qi to engender the myriad beings.\n\nThe myriad beings begin with the One; the One gives rise to the Two, the Two to the Three, and the Three to the ten thousand things. Both land and water teem with life, beyond all reckoning. Even in the dark yin of filth and muck, within the hardest and most stubborn stones, among mountain crags and grasses, wherever earth takes form—whether creatures fleet of foot or swift of wing, whether fierce demons or malevolent spirits—none is untouched, none is unpervaded.\n\nAmong those that fly are birds that hunt spirits and chase monsters; among those that run are beasts so fierce that ten men cannot withstand them. The largest include camels, oxen, elephants, and horses; the smallest, mustard seeds and tiny insects. Whether rotting and decaying, born from wombs or eggs, moist or dry, all that bears spirit and stirs with life arises from this, proceeds from this. Each receives its nature and assumes its form, its substance shaped by its aspect, its color determined by its place. What is red becomes red, what is black becomes black, what is blue becomes blue, what is white becomes white, what is yellow becomes yellow—such are the transformations of the Five Phases, responsive to their positions, not artificially dyed!\n\nAs for those that bear transformation and nurture hues: \"Bearing transformation\" refers to stones that, sensing qi, transform and give birth to life; \"nurturing hues\" refers to colors ranging from pale white and light yellow to faint red and delicate green, from deep blue and dark black to exotic greens and rare reds, wondrous tints and peerless shades—each attains its own beauty. All are the workings of spirit and the transformations of qi, forming natural essences. Beings receive qi in varying depths, so their colors and appearances are not fixed. They follow the Great Dao, self-transforming—thus it is said: \"form without form,\" \"transformation without transformation.\" This is what is meant by the Dao.\n\nAs the saying goes: in heaven, it hangs as celestial images; on earth, it takes form; in stone, it becomes treasure. When essence gathers, it becomes a jewel, and jewels are radiance. How marvelous! Such is the Great Dao—who can condense the golden blossom?\n\nWhen fire flourishes, it melts metal; when metal is felled, wood flourishes. Wood’s flourishing is the outward display of Yang, its branches spreading, while within it harbors Yin, its blossoms unfolding. The Perfected Lord of Yin says: \"The golden blossom is born—the treasure of heaven and earth. Those who grasp this speak the true and ultimate Dao.\"\n\nIn but a moment, the Dipper turns, celestial images wax and wane. When full, wood thrives and grows deep green; when waning, its blossoms are felled and wither. Why? Because what is first formed by the mutual conquest of Yin and Yang is the culmination of the Dao. When conquered, blossoms scatter and fall like drifting rouge and powder—this is the hun-soul leaping and toying with spirit, the light red flying with the soul’s numen.\n\nRed varies in depth, powder in weight. Where color is deep and essence light, it flies upward in flames, like purple frost beneath a dark canopy, congealing in the crucible as earthly yellow-gold powder. Where color is pale and essence heavy, nurtured, it transforms into golden yellow—this is the fire-nurtured *jiaoshao*, the cinnabar Yang’s bone-transformation.\n\nThe hun-soul follows where the po-soul abides; the po-soul follows where the hun-soul arises. The hun-soul shines with purple blossoms; the po-soul gathers Yang. Gathering Yang, the hun-qi enters the po-soul’s belly, concealing the hun within the po’s abdomen. The qi of sun and moon unite; the dragon exhales, the tiger displays its hues; the tiger inhales the dragon’s light. The two qi swallow and merge, enveloping the four directions, harmonizing the four images, their qi converging at the center.\n\nThus, with the first transformation, qi becomes water; with the second, water becomes cinnabar; with the third, cinnabar becomes mercury; with the fourth, mercury becomes gold; with the fifth, gold becomes the elixir. This elixir gathers the numinous essence of heaven and earth, seizes the radiance of sun and moon, captures the water and fire of Kan and Li, pursues the earth’s po-soul, and unites with the heaven’s hun-soul. Dragon and tiger become cinnabar; the flying bird and running hare become blossoms. Harmonizing their light, they enter the chamber together—only the noble house of the Nine and Five is revered. Whether the medicine is right or wrong in principle, the white tiger and green dragon yield their marrow. From the root and stem sprouts the yellow sprout; gold and silver fill my house.\n\nIf used to save human lives, human lives shall enjoy eternal blossoming. Those who ingest it may soar through the skies and traverse the waters, riding dragons and cranes. There is no other reason—all is the transformation of the Dao.",
      "overlap_context": "ngjia, transmitted these teachings in succession, passing them down to the present day. This text embodies the mechanism of highest-grade ascent, not some minor path of peripheral elixir arts. Only those with the bones of immortals, who encounter this writing, should treasure and conceal it—do not show it to the unworthy. The vows within these pages are weighty; read with utmost caution!\n\n**The Stone Casket Record of Perfected Lord Xu, Fascicle One**\n*On the Primordial Essence of the Great Yang*",
      "start_char": 478,
      "end_char": 1446,
      "start_sentence": 28,
      "end_sentence": 61,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.62152433395386,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\许颠君石函记.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "药化者，火得神用，药有灵通，道合自然，功成妙矣！ 或问调和鼎鼎，吸九龙红日之膏膘，其义何哉！ 答曰：铅为神器，器与神通，器因神化，神器合和，共为一休，自然呼吸相应，则神随吸至，光逐神彩，霞落青云，琉红坠速，灵晶上降，撮归水府龙官，养之紫寿。 金胎真气，化为金液，潜随造化，汞自然生。 经历十二时中，循环戊己，火分四正，则二至二分。 二至则子午辰，论之则千变万化，出入虚无，开张众妙之门，现出升天药祖。 得而修之，岂不长生升云，飞朝玉帝，为清真灵妙之神仙？ 岂容易而求哉！ 此道真秘，炼士罕得而闻之，所以流浪生死，去仙道远矣！ 且夫龙光者，乃火中之精，晶中发明，明中出光，光中生焰，炎焰通灵，光明炽盛。 中有金碧，空青圆光，九万广旷，无边荧荧。 郁仪之光耀，太阳南明，太阴北黑，南北相契，两神相得，男女相和，水火相济，水得火而生光明也。 夫太渊玄英者，纯黑休也，潜形沈彩，岂能化现玄英黑月？ 因抱阳之气，得以生明，积阳易阴，成其岁月，阳居其数，推迁不止，故有圆缺亏盈，常在晦朔之间。 晦而生暗，朔而生明。 故三日阳生，震动於东，太阳郁仪之光，结璘生明，寄休西方之位，谕如结璘，友於东西，道在得朋丧朋，是谓郁仪结璘也。 大哉！ 太阳郁仪之光，渊明四隅，归光於中，名曰五德。 五德者，五星也，光分万象，各得微明，为月夜照，晓则藏辉，昼夜交光，乾坤合休也。 谓月含其光，是日之精，是谓交光。 晓出於东，暮落於西，故曰合休。 大丹若不以日月交光，乾坤合休，更假何物而为之乎？ 则非人间水银朱砂，五金八石，所谓太阳玄元之妙也。 乃飞魂腾化，则至精至灵，感而遂通，则至神至圣，非荧荧郁仪之光，且孰如是也！ 然则日月循环、推移於上，而成其岁功於下也。 日来月往，南而复北，北而复南，故有生死之道也。 死者谓夏至之后，日穷南陆，阴气以盛，阳气渐消，道穷既极，归於坤元，万物所以死也，而极於亥。 生者，冬至之后，日穷北陆，阳气渐长，整乎乾元，亨而得利贞，万物所以生也，而极於己。 日则运移南北，故有生死之道也。 且夫冬夏二至，春秋二分，乃天地之四正，春生夏长，秋杀冬藏，盖顺天地阴阳生万物也。 此夫大还丹之妙用，其为一体也。 所谓法天象地，铸鼎泥炉，须择福地名山，方可建立坛宇。 山要异秀，地贵朝阳，虎势龙峰，朝山迭水，常有奇禽异兽，隐宝藏珍，远隔丘坟，人希迹绝，自然招福迎祥。 凡用必生於贤贵，可作炼丹之所也。 圣人能体天之道，法地之生，把日捉月，包乾裹坤，欲得乌精，先求兔髓，乃义皇之取象也。 先文后武，合易道而行焉！ 水火抽添，得在於神功，妙用自然，阳生於金室也。 且夫阳生於金室也，且夫阳生者复，子时兴，黄锺应律，阳气通行，渐历临泰，至己则乾刚数尽，坤柔将至； 阴生姤，午渐历否剥，坤亥将终，运移岁月，丹道将成，子出母胞，脱胎神化。 姤午是离火生汞也，复子是坎水生铅也，汞因铅结，铅因汞伏，乃子母想恋而成丹也。 自合自然，至精至妙，不可不思也。 要在细求真诀，志悟玄通，别假验真，是非可见。",
      "translated_text": "The transmutation of the medicine arises when fire attains its numinous function, and the medicine gains spiritual penetration. The Dao harmonizes with nature, and the work achieves its marvel! Someone may ask: in harmonizing the tripod and furnace, one inhales the fat and marrow of the Nine Dragons and the Red Sun—what is the meaning of this? The answer is: lead is the sacred vessel, and vessel and spirit interpenetrate. The vessel is transformed by the spirit, and spirit and vessel unite as one body. Naturally, breath and response correspond—then the spirit follows the inhalation to arrive, radiance pursues the spirit’s brilliance, rosy clouds descend like jade, and crimson drops swiftly fall. The numinous essence ascends and descends, gathered into the Water Palace and Dragon Court, where it is nurtured into purple longevity.\n\nThe true qi of the golden embryo transforms into golden liquid, subtly following creation’s course, and mercury naturally arises. Through the twelve hours, it circulates through *wu* and *ji*, fire divides into the four cardinal directions—thus the two solstices and two equinoxes. The two solstices are *zi*, *wu*, and *chen*; when discussed, they encompass a thousand changes and ten thousand transformations, entering and exiting the void, opening the gate of all wonders, and revealing the primordial medicine of ascension. If one obtains and cultivates it, how could one not achieve longevity, ascend through the clouds, and fly to pay court to the Jade Emperor as a spirit of pure, numinous subtlety? How could this be sought with ease!\n\nThis Dao is truly secret; few alchemists hear of it, and so they drift through the cycles of life and death, far from the Way of immortality. Now, the radiance of the dragon is the essence within fire, clarity emerging from the essence, light arising from clarity, and flame born from light. The fiery flame communicates with the numinous, and its radiance blazes brilliantly. Within it lies golden azure, hollow azure’s round light, vast and boundless, shimmering without end. The radiance of Yu Yi shines forth, the Great Yang’s southern brightness, the Great Yin’s northern darkness—south and north unite, the two spirits meet, male and female harmonize, water and fire aid each other. Water gains fire and generates radiance.\n\nNow, the Great Abyss of Mysterious Splendor is pure blackness, its form hidden and its luster submerged—how could it manifest the mysterious splendor of the black moon? Only by embracing the qi of yang can it generate brightness. As yang accumulates and yin transforms, the years and months take shape. Yang resides in their number, ceaselessly advancing and retreating, thus giving rise to the waxing and waning of fullness and deficiency, ever between the dark and new moons. Darkness arises at the dark moon, brightness at the new moon. Thus, on the third day, yang is born, stirring in the east. The radiance of the Great Yang’s Yu Yi coalesces into brilliance, dwelling in the western position, likened to the formation of splendor. Befriending east and west, the Dao lies in gaining and losing companions—this is called the union of Yu Yi and splendor.\n\nGreat indeed is the radiance of the Great Yang’s Yu Yi! Its luminosity illumines the four corners, returning its light to the center—this is called the Five Virtues. The Five Virtues are the five planets, their light dividing into myriad forms, each gaining subtle brightness. They illuminate the moonlit night, hiding their brilliance at dawn, exchanging radiance between day and night—this is the union of Qian and Kun. The moon contains its light, which is the essence of the sun—this is called the exchange of radiance. Dawn emerges in the east, dusk sets in the west—thus it is called the union of rest.\n\nIf the great elixir does not rely on the exchange of radiance between sun and moon, the union of Qian and Kun, what else could serve as its foundation? It is not the cinnabar and mercury of the human world, nor the five metals and eight minerals—it is the wondrous subtlety of the Great Yang’s mysterious origin. When the flying soul soars and transforms, it becomes the most refined and numinous; when it responds and communicates, it becomes the most divine and sagely. Without the shimmering radiance of Yu Yi, what else could achieve this?\n\nYet the sun and moon circulate above, advancing and retreating, completing the year’s work below. The sun comes and the moon goes, moving south and then north, north and then south—thus the Dao of life and death arises. Death refers to the time after the summer solstice, when the sun reaches the southern limit, yin qi flourishes, and yang qi gradually wanes. The Dao reaches its end and returns to Kun’s origin—this is why the myriad things die, culminating in *hai*. Life refers to the time after the winter solstice, when the sun reaches the northern limit, yang qi gradually grows, and it returns to Qian’s origin, penetrating and achieving benefit and integrity—this is why the myriad things live, culminating in *si*. The sun’s movement between south and north gives rise to the Dao of life and death.\n\nMoreover, the two solstices of winter and summer and the two equinoxes of spring and autumn are the four cardinal directions of heaven and earth. Spring gives birth, summer grows, autumn kills, and winter stores—this is following the yin and yang of heaven and earth to generate the myriad things. Such is the wondrous function of the great returning elixir, which forms a single body.\n\nThis is called modeling heaven and imaging earth, casting the tripod and sealing the furnace. One must choose an auspicious land on a famous mountain to establish the altar and hall. The mountain should be extraordinary and elegant, the land prized for facing the sun. With the tiger’s posture and dragon’s peak, facing mountains and flowing waters, it should often harbor rare birds and strange beasts, conceal treasures and jewels, be far from graves, and have few human traces—naturally attracting fortune and welcoming auspiciousness. Only when born of worthiness and nobility can it serve as a place for refining the elixir.\n\nThe sage embodies heaven’s Dao and models earth’s generation, grasping the sun and seizing the moon, enveloping Qian and Kun. To obtain the essence of the crow, one must first seek the marrow of the hare—this is the symbolic taking of Fu Xi. First civil, then martial, proceeding in accordance with the Dao of the *Yi*! The withdrawal and addition of water and fire depend on numinous skill; wondrous function arises naturally, and yang is born within the golden chamber.\n\nNow, the birth of yang is *fu*; at the *zi* hour, it stirs, and the Yellow Bell responds to the pitch. Yang qi circulates, gradually passing through *lin* and *tai*, until at *si*, Qian’s hardness is exhausted and Kun’s softness arrives. Yin is born at *gou*; at *wu*, it gradually passes through *pi* and *bo*, until Kun’s *hai* nears its end. As the years and months shift, the elixir’s Dao nears completion. The child emerges from the mother’s womb, shedding its fetal form and transforming spiritually.\n\n*Gou* at *wu* is the fire of *Li* giving birth to mercury; *fu* at *zi* is the water of *Kan* giving birth to lead. Mercury congeals because of lead, and lead is subdued because of mercury—this is the longing of mother and child forming the elixir. From the union with nature arises the most refined and wondrous, which cannot be left unconsidered. The key lies in carefully seeking the true oral instructions, awakening to the mysterious penetration, and distinguishing falsehood from truth—only then can it be seen.",
      "overlap_context": "er the chamber together—only the noble house of the Nine and Five is revered. Whether the medicine is right or wrong in principle, the white tiger and green dragon yield their marrow. From the root and stem sprouts the yellow sprout; gold and silver fill my house.\n\nIf used to save human lives, human lives shall enjoy eternal blossoming. Those who ingest it may soar through the skies and traverse the waters, riding dragons and cranes. There is no other reason—all is the transformation of the Dao.",
      "start_char": 1446,
      "end_char": 2644,
      "start_sentence": 62,
      "end_sentence": 103,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.15770125389099,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\许颠君石函记.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "吾因达日月悬明之象，千变万化之机，生生浩浩，无穷无极，得之者，岂不寿同天地？ 何得轻议於非人哉！ 故少立道论，非成篇轴，述此言之精，为丹砂之秘箓，如同口诀。 听吾所嘱，妄传非人，殃祸疾速。 戒之！ 戒之！ 日月雌雄论 夫南华至极，金阙神室，圆明广大，浩劫无穷，轮须弥兮无差晓夜霞散落兮处暗处明循环九十万亿，行健而布气生灵，日华天宝，龙光照耀，烈火霞明，焰焰通灵。 通灵达圣，恍朗飞魂，魂飞晶灵，透体光明。 光圆九万，周币金城，阳洞之中，空青之林，须神龙化，中有金神，金刚密迹，紫霞郁郁，紫寿紫神，霞英英生，紫寿紫生，霞英紫灵，潜应而出紫真。 青阳紫极，至真至灵，生生相绩。 元始元晶者，晶乃英灵独透，元始者为万宝之初先也。 传万气之祖，气藏万物之元，气本无质，神运气化，上则经天，下则纬地，交躔如度，合景如梭，一往一来，南而复北。 日道南行，万物形消，数极日回北陆，万物潜应，皆生黑赤二道，交躔黄道，运行南北。 人能观天之道，执天之行，招摄龙晶，虎准霞饵，须是玄门匠手，能修金鼎，调燮则以阴阳盗虚无，自然成质。 虚无何有，象逐何生。 幽阴隐兮，内怀铅德，火动兮外阳舞空，胜光八万丈，下临神室，无穷流霞，驻景深入，虚极之庭，补助河东，运入明堂，正德宝华，光满五彩。 霞生兮化青青之土，火动兮变灼灼之红莲，惨阴无光兮真铅沉黑，舒阳现明兮真汞浮白，洁白见宝兮可造黄金，魂定魄凝兮片片霞新，马齿如霜兮水银成粉，能点死尸兮归魂复醒。 其功莫测兮，鬼神莫能驱其奥； 火数难明兮，至圣莫能知其用。 玄元妙化，若有若无。 若有者真铅而有象，若无者火自於虚无。 离火虚化兮华化火，华化全凭兮火化功，孰能用兮无中化火，丹砂就兮火化无。 中有火随爻变无，遂火无生。 丙辛之气兮化真水，而滋乙庚化真金，丁壬之气兮化真木。 能滋戊癸化真火，甲己之气化真土，土能生万物为丹母，父母传胎列名九。 九道元年是曾祖，子子孙孙子继父，乾道成男坤道女，青道气出黄道东，迅雷忽发升青空，雷天大壮震束卯，四阳应候榆华老，凋零落叶乱纷纷，斗转星移魁在卯。 白道气出黄道西，郁郁金华生金鸡，金生西旺兑西酉，荠麦何曾不衰朽，四阴风地观斜阳，斗转星移罡在酉。 赤道气出黄道南，荧荧赫赫常炎炎，正阳火旺离南午，巳午至丁一阴祖。 天风遁起火瓓珊，盛极则衰衰在午，黑道气出黄道北，华池神水元乌黑。 黑中渐长一阳生，复卦因兹发兆萌，黄锺建子渐通理，天地经纶复更始。 日行黄道运其中，月行九道为太一，九道九鼎至神室，上古轩辕曾制服。 黄帝乘龙升紫微，七十二臣皆羽客，登云天兮步虚空，飞入金城兮丹霄，偃仰从兹得作真铨客。 曾遇神君赐大药，随鸾从驾经峨媚，不枉区区受劳役，茅茨不剪路难行，荆棘侵天没远山，峨媚峻岭难登涉。 礼请皇人驾晚还，不受傍门并小术，不言咽唾成金液，不炼小便为秋石，不言辟谷与休粮，不解摇肩并数息，不曾闭目弄精魂，不言握固擒魔贼，不言阴景滋灵物，不言三峰御女。 术成道成仙上上机，世间学者不能依，说与凡流都不信，读了旌阳记可知。",
      "translated_text": "Having grasped the celestial image of the sun and moon suspended in brilliance, the mechanism of myriad transformations, the boundless and inexhaustible flux of generation—those who attain this, how could their longevity not equal heaven and earth? How then could one lightly discuss it with the unworthy!\n\nThus, I have set forth these brief discourses on the Dao, not as a complete treatise, but to distill the essence of these words into a secret register of cinnabar, akin to oral instructions. Hear my admonition: to recklessly transmit this to the unworthy invites swift calamity. Beware! Beware!\n\n**On the Sun and Moon as Female and Male**\n\nThe Southern Florescence reaches its utmost; the golden palace and divine chamber are vast and luminous, enduring through infinite kalpas. The wheel of Mount Sumeru turns without distinction of dawn or dusk; rosy clouds scatter, illuminating both darkness and light. Cycling through ninety myriad millions, it moves with unceasing vigor, spreading qi to enliven all beings. The solar essence is the celestial treasure; dragon radiance shines forth, fiery clouds blaze, and flames flicker with numinous power.\n\nThrough numinous penetration, one attains sageliness—suddenly, the soul soars, luminous and crystalline, suffusing the body with light. The light, ninety thousand leagues in circumference, encircles the golden city. Within the yang cavern, amid the verdant forest of empty azure, the divine dragon transforms; at its heart dwells the golden spirit. The adamantine traces are veiled in dense purple haze; from the purple longevity and purple spirit, radiant clouds arise. Purple longevity gives birth to purple essence, and radiant clouds yield purple numen, emerging in response to the hidden true purple.\n\nThe azure yang and purple pole are supremely true and numinous, perpetuating generation in unbroken succession. The Primordial Beginning and Primordial Crystal—crystal is the unique essence of numinous penetration, while the Primordial Beginning is the origin of all treasures. It transmits the ancestor of the ten thousand qi, the qi that harbors the origin of all things. Qi itself is formless; spirit moves and qi transforms. Above, it weaves through the heavens; below, it interlaces the earth. Their paths intersect like measured degrees, their conjunctions like a shuttle, moving back and forth—southward, then returning north.\n\nThe sun’s path runs south, and the forms of the ten thousand things wane. When its course reaches its limit, the sun turns back to the northern realm, and the ten thousand things respond in concealment. All arise from the black and red paths, intersecting the yellow path as they traverse south and north.\n\nOne who can observe the Dao of heaven and grasp the movements of heaven may summon and gather dragon crystal and tiger essence, feeding on rosy clouds. This requires the craft of the mysterious gate and the skill to refine the golden crucible. In harmonizing, one steals from the void of yin and yang, naturally forming substance. What exists in the void? What image follows its generation?\n\nIn the hidden yin, lead virtue is concealed within; when fire stirs, external yang dances in the emptiness. The radiance of victory spans eighty thousand leagues, descending upon the divine chamber. Endless flowing clouds linger, their light penetrating deeply into the courtyard of utmost emptiness. They replenish the eastern river, enter the Hall of Light, and the true virtue’s precious splendor fills the five hues.\n\nClouds arise and transform into verdant earth; fire stirs and changes into blazing red lotuses. When grim yin prevails, true lead sinks into darkness; when expansive yang appears, true mercury floats in whiteness. When purity reveals the treasure, yellow gold may be wrought. As the soul stabilizes and the spirit congeals, fresh rosy clouds emerge in fragments. Horse teeth turn frosty, and mercury becomes powder. It can revive the dead, restoring their wandering souls to wakefulness.\n\nIts efficacy is unfathomable—even ghosts and spirits cannot fathom its mysteries. The fire numbers are obscure; even the sagest cannot know its applications. The wondrous transformations of the mysterious origin seem both present and absent. When present, true lead bears form; when absent, fire arises from the void.\n\nThe fire of *Li* transforms emptily, and flowers transmute into fire. The transmutation of flowers relies entirely on the fire’s work. Who can employ fire that arises from nothing? When cinnabar is achieved, fire dissolves into nothingness. Within it, fire follows the changes of the lines, yet fire itself is unborn.\n\nThe qi of *bing* and *xin* transforms into true water, nourishing the true gold of *yi* and *geng*. The qi of *ding* and *ren* transforms into true wood. It can nourish the true fire of *wu* and *gui*. The qi of *jia* and *ji* transforms into true earth. Earth, the mother of the ten thousand things, is the cinnabar’s parent. Father and mother transmit the embryo, arraying the nine names.\n\nThe first year of the nine paths is the great ancestor. Sons and grandsons follow their fathers in succession. The *Qian* Dao produces the male; the *Kun* Dao, the female. The azure path’s qi emerges east of the yellow path. Suddenly, thunder roars, ascending to the azure sky. The thunder of *Zhen* in the east at *mao*—four yang signs respond to the season. Elm flowers wither, leaves scatter in disarray. The Dipper turns, its handle pointing to *mao*.\n\nThe white path’s qi emerges west of the yellow path. Luxuriant golden flowers give birth to the golden rooster. Metal is born in the west, flourishing in *dui* at *you*. How could shepherd’s purse and wheat not wither? Four yin winds blow across the earth at *guan*, the setting sun. The Dipper turns, its handle pointing to *you*.\n\nThe red path’s qi emerges south of the yellow path. Flickering and blazing, it burns eternally. True yang fire flourishes in *Li* at *wu*; from *si* to *wu* to *ding*, the first yin arises. Heavenly winds stir, and fire glitters. At its zenith, decline begins—decay resides in *wu*.\n\nThe black path’s qi emerges north of the yellow path. The divine pool’s water is profoundly dark. Within the darkness, a yang gradually grows. The *Fu* hexagram, by this, reveals its sprouting signs. The *Huangzhong* tone establishes *zi*, gradually unfolding principle. Heaven and earth’s warp and weft renew their beginning.\n\nThe sun moves along the yellow path within its course; the moon traverses the nine paths as the Great Unity. The nine paths and nine crucibles reach the divine chamber—of old, the Yellow Emperor once mastered them. The Yellow Emperor rode a dragon to ascend the Purple Tenuity, his seventy-two ministers all feathered transcendents. Ascending the cloudy heavens, treading the void, they flew into the golden city of the cinnabar clouds. From then on, they reclined and rose as true immortals.\n\nOnce, he encountered a divine lord who bestowed the great elixir. Following the phoenix’s carriage, they journeyed through Mount Emei. Not in vain did they endure toil and hardship: thatched huts untrimmed, paths impassable, thorns piercing the sky, obscuring distant mountains. The peaks of Emei were perilous to climb.\n\nHe entreated the august personage to return at dusk. He rejected heterodox gates and minor arts: no mere swallowing of saliva to form golden liquid, no refining of urine into autumn stone, no claims of fasting or abstaining from grain, no methods of shoulder-shaking or breath-counting, no closing of eyes to manipulate essence and spirit, no clenching of fists to seize demonic thieves, no reliance on yin shadows to nourish numinous things, no practices of the Three Peaks or sexual rites.\n\nWhen the art is perfected and the Dao is achieved, one ascends the highest mechanism of immortality. Yet worldly scholars cannot adhere to it. Telling it to the vulgar, they disbelieve—let them read the *Annals of Master Jingyang* to understand.",
      "overlap_context": "the fire of *Li* giving birth to mercury; *fu* at *zi* is the water of *Kan* giving birth to lead. Mercury congeals because of lead, and lead is subdued because of mercury—this is the longing of mother and child forming the elixir. From the union with nature arises the most refined and wondrous, which cannot be left unconsidered. The key lies in carefully seeking the true oral instructions, awakening to the mysterious penetration, and distinguishing falsehood from truth—only then can it be seen.",
      "start_char": 2644,
      "end_char": 3857,
      "start_sentence": 104,
      "end_sentence": 139,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.08430624008179,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\许颠君石函记.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "药母论 夫丹道者，非人间五金八石，朱砂水银之所为也。 是无形合虚，旷成虚无，是谓真虚。 真虚之体，还丹之基，大药之母。 大药之母何形容，形容体貌缘何质，质者混成中有物，有物来居象帝先，象先真虚合自然。 真虚自然合色象，色象之因神运转，运转真虚虚不空，不空之妙有神通。 通神神化神色黑，黑者玄元藏道德，道藏玄德大渊深，广渊源号北溟。 北溟广大生浩，浩浩无边无极道，无极大道道生一，一极高明先天得。 先天故为元始六百万岁道生成，生成成道绿宗祖，能生万象为丹母。 母铅黑母铅黑，时缘何得黑，成水六元居，北上应星辰，主化育下生，铅精含五色，色化青黄白赤黑，黑者玄元是水基，水者道枢其数一。 一者坎中真一之气，符合恍惚，杳冥相须，相将象龙，须臾象虎，虎龙之初，夫何有乎？ 阴阳感激，无形合虚，虚生於有，有生於无。 无为之始，有为之母，四象之首，五行之初，丹砂之枢纽也。 枢扭者，水火二气相交也。 水火相烁也，阴阳相胜也，何以明乎？ 略试之，且壶中日月是水火之气，水气润下，火气炎上，上降下升，相交相迎，相迎相接。 水激火灭，火灭为土，土能生金，金能生水。 金水相生，递相含孕，滋金而益水，益水而滋金，金水相符，润泽肌肤。 肌如琼酥，素真玉华，延遐无价，无价真珠，丹砂形躯。 夫何有乎？ 无质生质，水火相滋，二气相须，无形合虚，合虚之体，体用一斤之数，数分两弦，覆仰两圆，论未合之先，先定上下。 上弦数得八，下弦数亦八，以二八合上下，得乾坤之体，乾坤体一斤，丹道正不倾。 刚柔有表裹，金水分两停，阴阳有轻重。 有舞互相用，互用展三才，乾坤合体哉！ 乾卦象天，覆者也； 三画体连，坤卦象地，仰者也。 六断通气，气通往来，三连通开，爻开六断。 乾卦三变，坤卦三变，乾连坤断，断续连开，黑白往来。 大哉黑白，阳种阴栽，栽培育种，种出黄芽。 黄芽生汞，汞吐三华，汞结成砂，砂如金粟，一粒一服，服食百日，改形换骨，骨变金石，形神相得，形神俱妙，寿无穷极。 金砂圣德，无质生质，质生於无，卦爻相符，符合震兑坎离交会，四象虚无，不可画图，元精难睹，无形合虚。 无形之形，虚化之化。 化丹砂者自然也，丹砂化生於自然者，妙用也。 妙者少女，少女属於兑方，金母居金父之位，长养堤防者也。 长者一也，养者四也，长养金水也，金水乃四一。 三日配庚，庚生兑户，兑生乾父，乾者金之父也，金体以水火为基，火盛消金，金化为水，和融周章，其水北转而东流，滋震木之苍苍，生角亢之龙光。 东方之宿，荷南方之荧惑，烁奎娄之气，整庚辛之位，位应西方太白金堂。 金堂虎房，调降地随宜化质，郁郁神祥，万瑞万灵，至尊至德，变化不穷不可加。 曾将一粒变天涯，既能济命复齐家。 人能闻早勤修炼，上帝邀君升大罗。 药物是非论 夫乾坤交媾，万物化生，乾而不元，元而不亨，亨而不利，利而不贞，则违天背源，阳无所施，阴无以萌，故上不降而下不升，天不氤而地不氲。 既失冲和之造，万物何从而生哉．是谓药不正而违天，火不合而背源，火虽动而天符不应，灵不降则魂以飞扬，药不正则风云不济虎，无形则杳绝龙光，且丹砂何从而生哉？",
      "translated_text": "**On the Mother of Medicines**\n\nThe Dao of the Elixir is not the work of mundane five metals or eight minerals, nor cinnabar or mercury. It is formless union with the void, vast completion of emptiness—this is called true emptiness. The substance of true emptiness is the foundation of the Returned Elixir, the mother of the Great Medicine.\n\nWhat is the form of the mother of the Great Medicine? What is the appearance of her body, and from what essence does she arise? The essence is a thing formed within primordial chaos, a thing that dwells before the image of the Emperor. The image precedes true emptiness, which merges with the natural. True emptiness and the natural unite with form and image; the movement of spirit turns the image, and the turning of true emptiness is not empty. The marvel of non-emptiness is the power of spirit. The spirit communicates, transforms, and assumes a black color. Black is the profound origin where virtue and power are concealed. The Dao conceals profound virtue in a vast abyss—its broad and fathomless source is called the Northern Ocean.\n\nThe Northern Ocean is vast and great, giving birth to the boundless. Boundless and without limit is the Dao. The limitless Dao gives birth to the One. The One attains the highest clarity, first in heaven. Being first in heaven, it is the primordial beginning, six million years of Dao-generated completion. Completion perfects the Dao, the green ancestor of the lineage, which can generate all images and thus is the mother of the Elixir.\n\nMother lead is black—why is mother lead black? When it achieves the water of the six origins and resides in the north, it aligns with the stars. It governs transformation and nurtures life below. The essence of lead contains five colors, which transform into green, yellow, white, red, and black. Black is the profound origin, the foundation of water. Water is the pivot of the Dao, and its number is One. The One is the true qi of the Center within Kan, harmonizing with the indistinct and the obscure. They mutually require each other, joining like dragon and tiger. At the inception of dragon and tiger, what was there? Yin and yang stir and excite each other; the formless unites with the void. The void arises from being, and being arises from non-being.\n\nNon-being is the beginning of non-action; being is the mother of action. It is the first of the four images, the origin of the five phases, and the pivot of cinnabar. The pivot is the intercourse of the two qi of water and fire. Water and fire refine each other; yin and yang overcome each other. How is this made clear? Briefly test it: the sun and moon within the crucible are the qi of water and fire. The qi of water moistens downward, and the qi of fire flames upward. Descending and ascending, they meet and welcome each other, joining and uniting. Water excites fire and extinguishes it; extinguished fire becomes earth. Earth can generate metal, and metal can generate water. Metal and water generate each other, mutually containing and nurturing. They nourish metal and augment water, augmenting water to nourish metal. When metal and water correspond, they moisten and enrich the flesh. The flesh becomes like jade cream, pure and true as white jade blossoms. It extends longevity beyond price, a priceless true pearl, the cinnabar-formed body.\n\nWhat was there before? Formless being arises from being; water and fire nourish each other. The two qi mutually require each other; the formless unites with the void. The substance of united void has the function of one *jin* in number. The number divides into two weights, covering and revealing two circles. Before their union, first determine above and below. The number of the upper arc is eight, and the number of the lower arc is also eight. Combining the two eights above and below yields the substance of Qian and Kun. The substance of Qian and Kun is one *jin*; the Dao of the Elixir is thus upright and unwavering.\n\nFirmness and softness have outer and inner aspects; metal and water divide into balanced weights. Yin and yang have lightness and heaviness. They dance and mutually employ each other, unfolding the three powers. Qian and Kun unite in substance! The Qian trigram images heaven and covers; its three lines are connected. The Kun trigram images earth and reveals; its six lines are broken yet interconnected. The qi flows through the six breaks, and the three connections open. The Qian trigram undergoes three changes, and the Kun trigram undergoes three changes. Qian connects, Kun breaks; breaking and connecting alternate, opening and closing. Black and white come and go.\n\nGreat indeed are black and white! Yang is the seed, yin the planting. Cultivating and nurturing the seed yields the yellow sprout. The yellow sprout generates mercury; mercury emits three blossoms. Mercury coagulates into cinnabar, like grains of gold. One grain taken daily for a hundred days transforms the form and changes the bones. The bones become like metal and stone; form and spirit attain each other. Form and spirit are both wondrous, and longevity knows no limit. The sacred virtue of golden cinnabar arises from formless being, and being arises from non-being. The trigrams and lines correspond, harmonizing with the intercourse of Zhen, Dui, Kan, and Li. The four images are emptiness and formlessness, impossible to depict. The primordial essence is difficult to perceive; the formless unites with the void.\n\nThe form of the formless is the transformation of emptiness. The transformation of cinnabar is natural; cinnabar transforms and arises from the natural—this is the wondrous function. The wondrous is the maiden; the maiden belongs to the Dui direction. The metal mother resides in the position of the metal father, nurturing and safeguarding. \"Nurturing\" is the One; \"safeguarding\" is the Four. They nurture and safeguard metal and water—metal and water are thus Four and One. Three days correspond to Geng; Geng gives birth to the Dui gate. Dui gives birth to the Qian father; Qian is the father of metal. The body of metal takes water and fire as its foundation. When fire flourishes, it melts metal, and metal transforms into water. Harmonizing and circulating, this water turns north and flows east, nourishing the verdant wood of Zhen and generating the dragon’s light of Jiao and Kang. The eastern constellations bear the southern fire star, refining the qi of Kui and Lou, rectifying the positions of Geng and Xin. The position corresponds to the western Great White Metal Hall.\n\nThe Metal Hall is the tiger’s chamber. Adjusting and descending, the earth follows and transforms the substance. Luxuriant and numinous, myriad auspices and spirits—supremely virtuous and honorable, their transformations are inexhaustible and cannot be surpassed. Once, a single grain transformed the ends of the earth. It can both save lives and harmonize families. If one hears of this early and diligently cultivates, the Emperor will invite you to ascend the Great Luo.\n\n**On the Right and Wrong of Medicinal Substances**\n\nWhen Qian and Kun unite in intercourse, the ten thousand things transform and arise. If Qian is not originary, or originary but not prosperous, or prosperous but not beneficial, or beneficial but not upright, it violates heaven and turns away from the source. Yang has nothing to bestow, and yin has nothing from which to sprout. Thus, the above does not descend, and the below does not ascend; heaven does not mist, and earth does not steam. Having lost the harmonious creation, how can the ten thousand things arise? This is called medicine that is not upright and violates heaven, fire that does not harmonize and turns away from the source. Though fire moves, the celestial tally does not respond. If the numinous does not descend, the hun soul flies away. If the medicine is not upright, wind and clouds do not aid the tiger. Without form, the dragon’s light is utterly cut off—how then can cinnabar arise?",
      "overlap_context": " methods of shoulder-shaking or breath-counting, no closing of eyes to manipulate essence and spirit, no clenching of fists to seize demonic thieves, no reliance on yin shadows to nourish numinous things, no practices of the Three Peaks or sexual rites.\n\nWhen the art is perfected and the Dao is achieved, one ascends the highest mechanism of immortality. Yet worldly scholars cannot adhere to it. Telling it to the vulgar, they disbelieve—let them read the *Annals of Master Jingyang* to understand.",
      "start_char": 3858,
      "end_char": 5098,
      "start_sentence": 140,
      "end_sentence": 182,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.71185851097107,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\许颠君石函记.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "是知丹须药化，药自丹生，《金碧经》云：为金精，水还黄液者，药之化也。 药化则火动华浮，迥然独异，母舍彼生，涌成黄液，，是太阳之精，气号日流珠，流珠即流汞也。 日魂欲降，如露华滴珠，聚而为水，流而为液，凝而坚冰，结霜玲珑，珊瑚屈曲，华英桂树，寄名偃月灵芝，结成大宝珠。 火运三光，灵辉照夜，此是阴阳相济，巽艮还坤，阳往阴来，明消生暗。 明暗者，九尽也，九尽则阳光渐亮，神府藏辉，光曜隐明，灵砂伏体。 生暗者，六生也，六生为阴符之始，六二晦可己，六三壬癸，圆归黑体，此乃乾坤终始，象逐爻生，神变灵通，药之化也。 自然招霞摄彩，聚景生灵，引赫赫之日苗，孕圆明之神药，招符造化，虎瑞龙祥，五音互奏，瑶光结琥珀金膏； 六律虒迁，丹砂点红瑠玛瑙。 火虚明而经阴阳，出入二分则金盛木荣，铺舒药化。 药化者，是朱雀调运，化得甲乙而， 滋丙丁，滋养朱鸡，鸡属西位，化兑方，而为金，金生於水，配合壬癸； 水生於金，气禀庚辛。 金水相生，自相含孕，在母胎中日金胎水母，水火消烁，或沉或浮，浮者砂汞白，沉者水铅黑，浮沉不定，杳难穷测。 太上日：视之不见，听之不闻，潜藏造化，拘逐时分。 时分谓子午卯酉也。 复子则鱼鳞狎猎，姤午则马齿如霜，壮卯则琅玕锺乳，观酉则羽翮摧伤，剥戌则有似犬牙，坤玄则阴生阳化。 夫坤生震兑乾，乾生巽坤，且乾纳壬甲，坎怀六戊，艮合六丙，震照六庚，巽成六辛，离藏六己，坤包乙癸，兑感六丁。 八卦从乾变十干，合天元。 束方甲乙木者，青龙也，位角亢氏房心尾箕七宿。 其形如龙，在於东方，故曰青龙也。 南方丙丁火者，朱雀也，位井鬼柳星张翼轸七宿其形如鹑乌，在於南方，故日朱雀也。 西方庚辛金者，白虎也，位奎娄胃昴毕嘴参七宿，其形如虎，在西方，故曰白虎也。 北方壬癸水者，玄武也，位斗牛女虚危室壁七宿，有龟蛇之体，在北方，故曰玄武也。 八卦乾成象，四七运神功，考日喥南北，月度西束，运移随斗转，变化在其中，中有灵砂鼎，乾成水银粉点汞作黄金，何啻千万蜓。 济世不为多，未足为神圣，服饵作飞仙，白曰升青天。 超出三界外，不被五行牵，我命方在我，永脱幽冥苦。 若非大还丹，谁兔归泉路？ 吾不敢虚说，学者当自悟，尽述三才理，乾坤尽终始。 砂汞与铅银，情性本同根，会得圣人意，造作黄金匮。 产出夜明砂，丹砂号如意，炼成无价珠，寿命同天地。 得其理者须当爱敬，览此文者与君证性，学者味而详之，作丹房之明镜。 理阴阳，阴含阳房，昭明日所，赫赫神方，紫华郁郁，光辉辉日，日耀玄空，光明相通，上下贯通。 三才水火，发为寒暑，火升水降，同日月之往来，水火随日月不亏明，砂汞与铅银同一种。 一种灵苗神异药，黄芽一鼎分二八，二十四鼎始华池，终则神灵生白雪，神符白雪能返魂，下士闻之生谤瞋。 为何因既死，如何得返魂，既死永休魂魄散，魄散魂消何处寻？ 徐福经年采药去，仙草灵芝无觅处。 蓬莱仙草既无形，且道返魂何所据？ 我今说汝返魂药，返魂须是天魂魄，此是人魂正祖宗，返魂再活死形容。 回体再活复如故，再生人世何法度。",
      "translated_text": "Thus we know that cinnabar must be transformed by medicine, and medicine arises from cinnabar. As the *Scripture of the Golden and Azure* states: \"Mercury is the essence of metal; when water returns as yellow liquid, this is the transformation of medicine.\" When medicine transforms, fire stirs and blossoms float—distinct and singular. The mother abandons that which it generates, welling forth as yellow liquid. This is the essence of the Great Yang, whose qi is called the Flowing Pearl. The Flowing Pearl is flowing mercury. The solar soul descends like dewdrops scattering pearls, gathering as water, flowing as liquid, congealing into solid ice, crystallizing as frost’s delicate lattice, coral’s sinuous curves, or the blossoms of cassia trees. Borrowing the name of the crescent-moon spirit fungus, it coalesces into the Great Precious Pearl. Fire moves the Three Luminaries, and numinous radiance illumines the night. This is the mutual aid of yin and yang, with Xun and Gen returning to Kun, yang departing and yin arriving, brightness waning and darkness arising.\n\nBrightness and darkness are the exhaustion of the nine; when the nine are exhausted, yang’s light gradually brightens. The divine palace conceals its brilliance, luminosity hides its glow, and numinous cinnabar submits to the body. The arising of darkness is the birth of the six; the six are the beginning of the yin tally. Six in the second place is the end of obscurity; six in the third is ren and gui, which roundly return to the black body. This is the beginning and end of Qian and Kun, images following the generation of lines, numinous transformation and spiritual communion—the transformation of medicine.\n\nNaturally summoning rosy clouds and gathering radiance, it engenders the numinous, drawing the blazing sun’s sprouts and nurturing the round and luminous divine medicine. Summoning tally and creating transformation, tiger omens and dragon auspices arise; the five tones harmonize, and luminous light crystallizes into amber-golden paste. The six pitch-standards shift, and cinnabar dots red agate. Fire’s emptiness shines through yin and yang; exiting and entering the two divisions, metal flourishes and wood prospers, unfolding the transformation of medicine.\n\nThe transformation of medicine is the Vermilion Bird’s regulation and movement, transmuting into jia and yi, nourishing bing and ding, fostering the Vermilion Fowl. The fowl belongs to the western position, transforming into the dui direction and becoming metal. Metal is born of water, pairing with ren and gui; water is born of metal, its qi endowed by geng and xin. Metal and water generate each other, mutually containing and conceiving. Within the mother’s womb, it is called the metal embryo and water mother. Water and fire melt and refine, now sinking, now floating. The floating is white cinnabar-mercury; the sinking is black water-lead. Floating and sinking without constancy, it is profound and difficult to fathom.\n\nThe Most High said: \"Seen but not visible, heard but not audible, it latently creates transformation, bound to the seasons and divisions.\" The seasons and divisions refer to zi, wu, mao, and you. At *fu-zi*, fish scales cluster; at *gou-wu*, horse teeth frost; at *zhuang-mao*, stalactites form; at *guan-you*, feathers and wings break; at *bo-xu*, it resembles canine teeth; at *kun-xuan*, yin generates and yang transforms.\n\nKun generates Zhen and Dui, Qian; Qian generates Xun and Kun. Moreover, Qian receives ren and jia; Kan embraces the six wu; Gen unites with the six bing; Zhen illuminates the six geng; Xun completes the six xin; Li contains the six ji; Kun envelops yi and gui; Dui senses the six ding. The eight trigrams transform from Qian into the ten stems, uniting with the celestial origin.\n\nThe east’s jia and yi wood is the Azure Dragon, positioned among the seven lodges of Jiao, Kang, Di, Fang, Xin, Wei, and Ji. Its form is like a dragon, dwelling in the east—hence it is called the Azure Dragon. The south’s bing and ding fire is the Vermilion Bird, positioned among the seven lodges of Jing, Gui, Liu, Xing, Zhang, Yi, and Zhen. Its form is like a quail or crow, dwelling in the south—hence it is called the Vermilion Bird. The west’s geng and xin metal is the White Tiger, positioned among the seven lodges of Kui, Lou, Wei, Mao, Bi, Zui, and Shen. Its form is like a tiger, dwelling in the west—hence it is called the White Tiger. The north’s ren and gui water is the Dark Warrior, positioned among the seven lodges of Dou, Niu, Nü, Xu, Wei, Shi, and Bi. It has the body of a tortoise and snake, dwelling in the north—hence it is called the Dark Warrior.\n\nThe eight trigrams form images from Qian; the four and seven move the spirit’s work. Examining the sun’s path from south to north, the moon’s course from west to east, movement follows the Dipper’s turning, and transformation lies within. Within is the numinous cinnabar tripod; Qian completes mercury powder, which dots mercury into gold—how could it be merely thousands or tens of thousands? Though it aids the world, it is not excessive; it is not yet sufficient to be called divine or sagely. Ingesting it, one becomes a flying immortal, ascending to the azure heavens by day. Transcending the Three Realms, unbound by the Five Phases, my life rests in myself, forever escaping the suffering of the dark underworld.\n\nWithout the Great Return Elixir, who can avoid the path to the Yellow Springs? I dare not speak falsely; the scholar must realize this for themselves. Fully expounding the principles of the Three Powers, Qian and Kun complete their beginning and end. Cinnabar-mercury and lead-silver share the same root in nature and disposition. Grasping the sages’ intent, one creates a golden coffer. It produces night-shining sand, cinnabar called \"as-you-wish,\" refining into a priceless pearl. Lifespan becomes equal to heaven and earth.\n\nThose who attain this principle must revere it; those who peruse this text will verify their nature with you. Scholars, savor and ponder it—make it the bright mirror of the elixir chamber. Comprehending yin and yang, yin contains the yang chamber; the sun’s brilliance is manifest, the divine formula blazing. Purple blossoms lush, radiance resplendent, the sun’s glory illumines the dark void. Light interpenetrates, ascending and descending in communion.\n\nThe Three Powers’ water and fire manifest as cold and heat; fire ascends and water descends, like the sun and moon’s coming and going. Water and fire follow the sun and moon without diminishing their brightness. Cinnabar-mercury and lead-silver are of one kind. One kind of numinous sprout, a divine and wondrous medicine: the yellow sprout in one tripod divides into two and eight; twenty-four tripods begin in the flowering pond. In the end, the numinous gives birth to white snow. The divine tally and white snow can return the hun soul. When lesser scholars hear of this, they slander and rage.\n\nWhy, when one has already died, can the hun soul return? Once dead, the hun and po forever disperse—where can they be sought? Xu Fu spent years searching for herbs, yet the immortal grasses and numinous fungi were nowhere to be found. Since the Penglai immortal grasses have no form, on what basis can the returning hun soul rely?\n\nI now tell you of the medicine that returns the hun soul: to return the hun soul, one must have the celestial hun and po. This is the true ancestor of the human hun soul. Returning the hun revives the dead form, restoring the body to its former state. Reborn into the world, what method is there?\n\nThe method is this: when *fu-zi* arrives, fish scales cluster; at *gou-wu*, horse teeth frost; at *zhuang-mao*, stalactites form; at *guan-you*, feathers and wings break. The body revives and lives again as before. How can one be reborn into the world?",
      "overlap_context": "mist, and earth does not steam. Having lost the harmonious creation, how can the ten thousand things arise? This is called medicine that is not upright and violates heaven, fire that does not harmonize and turns away from the source. Though fire moves, the celestial tally does not respond. If the numinous does not descend, the hun soul flies away. If the medicine is not upright, wind and clouds do not aid the tiger. Without form, the dragon’s light is utterly cut off—how then can cinnabar arise?",
      "start_char": 5098,
      "end_char": 6302,
      "start_sentence": 183,
      "end_sentence": 220,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.32030391693115,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\许颠君石函记.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "其法度所生，元胎魂父母。 父母元胎不可论，浩浩生生万种魂，种於稼穑孕生胎，胎卵湿化化生中，或人或兽或禽虫。 人兽禽虫皆禀性，性命相连魂击命，魂是金精作命基，命基养性魂相随，性命相连击魂魄。 魄属杳冥魂，恍惚，恍惚窈冥二气精，能生万象合乾坤，乾坤大哉合门户。 易蕴乾坤合乌兔，乌精兔髓与魄魂，根蒂相连属性命，炼魂煅魄作神丹。 摄召魂灵能返还，不是神符并白雪，一鼎丹砂效也难。 一鼎丹砂可服食，久服回阳能换骨，回阳换骨作真仙，须是神符并白雪。 大哉神符真白雪，返魂再活生徐甲，此是玄元至妙门，小法傍门定不能。 傍门小法卫虽众，不能胜极真铅汞。 真铅真汞真龙虎，龙虎辉光似盘古，始青之下虎争明，夺神光兮分黄青，龙虎精光两相射，采入蓬壶金世界。 中有留光聚宝台，宝华圆满光明开。 光皎洁，五色红璃笼宝月，忽然宝月罩红璃，互相笼罩光相结，水火交缠混日月，日月合璧如连环，五星连珠贯五行。 贯穿五行不散失，自然水火生神物。 神物异，南极老人星呈瑞。 星呈瑞，神助太阳生紫气，紫气如姻直上腾，上冲华盖鼎中心，鼎中盘结如霜雪，上降下升相交接，交接相连互枝柱，玲珑状如珊瑚树。 珊瑚散索枝零落，阳刚渐长阴弱剥，剥尽群阴阳气加，丹成九转结紫华。 紫华光裹撮金华，撮得精英五帝华。 彩霞精，分五名，朝霞明，暮霞神，落霞灵，飞霞降，火霞迎。 迎霞嫁嫁还家家生五福真贵霞妙灵砂吉祥万瑞大亨霞广灵砂嘉瑞众尊拱龙霞紫灵砂普济草仙万岁霞万灵砂点石为金如意霞宝灵砂五霞五石五灵砂太上玄元圣祖加加为五鼎紫神砂二十四鼎分五鼎加添水火炼成砂岁月连连相接接十二神符九白雪转转增添加日月日月增添水火加阴符阳符不可差不差不凶不改变白雪九年重入转入转砂神力加神符神药药变化药属阴阳阴阳属卦卦火相扶阴阳相驾阴阳推迁整续无暇整爻续卦随爻变化往来不定上中与下八千六百四十卦乾坤坎离计四卦离卦火升上坎卦水润下坎离水火相驱驾相驱相驾火随卦卦火亏盈还本源返本还源源又年又年又月月又日日合元符火记历火合元符记不差火华迭迭累精华至神至圣至灵至极不可加其福无量无边至极不可加广大神通灵变至极不可加三不加此是玄元圣祖砂三鼎砂六年紫灵砂七年紫寿砂八年紫金砂上品上药药灵紫篆神药神符自天 丹砂证道歌 教子真妙言，令子知道元。",
      "translated_text": "The method by which it arises is the primordial womb—father and mother of the hun soul.\nThe father-mother primordial womb cannot be discoursed upon;\nIn its vastness, it gives birth to the ten thousand kinds of hun.\nSown in the fields of cultivation, they gestate and form the embryo—\nWithin the transformations of womb, egg, moisture, and metamorphosis,\nSome become human, some beast, some fowl, some insect.\nHuman, beast, fowl, and insect all receive their nature;\nNature and life are bound together, the hun striking life.\nThe hun is the essence of metal, forming the foundation of life;\nThe foundation of life nurtures nature, the hun following alongside.\nNature and life are bound together, striking the hun and po.\n\nThe po belongs to the dim and obscure hun,\nTo the indistinct and the profound—\nThe essence of these two qi\nCan generate the ten thousand images, uniting Heaven and Earth.\nGreat indeed is the union of Heaven and Earth, the gate of convergence!\nThe *Yi* contains Heaven and Earth, uniting the Raven and Hare;\nThe essence of the Raven and the marrow of the Hare join with the po and hun,\nRoot and stem bound together, belonging to nature and life.\nRefine the hun and forge the po to create the divine elixir.\nBy summoning and calling forth the hun spirit, it can be returned—\nNot through talismans or white snow alone;\nEven a single cauldron of cinnabar would prove difficult in effect.\n\nA single cauldron of cinnabar may be ingested,\nAnd with prolonged use, it can restore yang and transform the bones,\nRestoring yang and transforming the bones to become a true immortal—\nYet this requires the divine talisman and true white snow.\nGreat indeed is the divine talisman and true white snow!\nIt revives the hun and restores life, as with Xu Jia.\nThis is the most wondrous gate of the mysterious origin;\nLesser methods and side doors surely cannot achieve this.\nThough the lesser methods of side doors have many adherents,\nThey cannot surpass the true lead and mercury.\n\nTrue lead and true mercury—true Dragon and Tiger—\nDragon and Tiger radiate with light like Pangu.\nBeneath the first green, the Tiger contends for brightness;\nSeizing the divine light, they divide into yellow and green.\nThe essence-light of Dragon and Tiger shoot toward each other,\nGathered into the golden world of Penglai.\nWithin it stands the Terrace of Gathered Light, the Treasury of Treasures,\nWhere the jewel-flower blooms in perfect roundness, its radiance unfolding.\n\nThe light is resplendent,\nFive-colored red glass encasing the moon of treasures.\nSuddenly, the moon of treasures veils the red glass,\nMutually enclosing, their lights intertwining.\nWater and fire entwine, blending sun and moon;\nSun and moon unite like linked rings,\nThe five stars strung as pearls, threading the five phases.\nThreading the five phases without dissipation,\nNaturally, water and fire generate the divine substance.\n\nThe divine substance is wondrous—\nThe Star of the Old Man of the Southern Pole appears as an auspice.\nThe star appears as an auspice,\nDivine aid causes the purple qi of the Great Yang to arise.\nThe purple qi, like mist, ascends straight upward,\nPiercing the canopy at the center of the cauldron.\nWithin the cauldron, it coils like frost and snow,\nRising and descending, intertwining.\nIntertwined and bound together, they form branching pillars,\nDelicate and intricate as a coral tree.\n\nThe coral scatters its strands, its branches falling away;\nYang’s hardness gradually grows as yin’s weakness is stripped away.\nWhen all yin is exhausted, yang qi flourishes,\nAnd after nine revolutions, the elixir forms, crystallizing into purple blossoms.\nThe purple blossoms enwrap the gathered golden essence,\nDrawing forth the quintessence of the Five Emperors’ splendor.\n\nThe essence of rosy clouds divides into five names:\nDawn’s rosy clouds are bright,\nDusk’s rosy clouds are divine,\nFalling rosy clouds are numinous,\nFlying rosy clouds descend,\nFire’s rosy clouds welcome.\nWelcoming the rosy clouds, they return home in splendor,\nGenerating the five fortunes of true noble rosy clouds—\nAuspicious and infinitely propitious, the great flourishing rosy clouds of numinous cinnabar.\nThe myriad auspices gather in reverence to the Dragon’s rosy clouds of purple numinous cinnabar,\nUniversally aiding the immortals of the grassy realms for ten thousand years—\nThe rosy clouds of ten thousand numinous cinnabars that transmute stone into gold,\nThe rosy clouds of wish-fulfilling treasures,\nThe numinous cinnabar of the five rosy clouds, five stones, and five spirits.\nThe Most High Mysterious Origin Sage Ancestor adds to them,\nForming five cauldrons of purple divine cinnabar.\nTwenty-four cauldrons divided into five,\nWith added water and fire, the cinnabar is refined.\nYears and months link endlessly,\nTwelve divine talismans and nine white snows,\nRevolving and augmenting,\nAdding sun and moon,\nSun and moon augmenting water and fire,\nAdding yin talismans and yang talismans—\nNo deviation, no error, no misfortune, no alteration.\nThe nine-year white snow re-enters, turning into cinnabar,\nIts divine power enhanced by the divine talisman.\nThe divine medicine transforms,\nBelonging to yin and yang;\nYin and yang belong to the hexagrams,\nThe hexagrams’ fire mutually supporting.\nYin and yang drive each other,\nYin and yang push and shift, perfectly continuous without flaw.\nThe lines continue the hexagrams, following their changes,\nShifting and moving without fixed abode—\nAbove, middle, and below,\nEight thousand six hundred and forty hexagrams.\n*Qian* and *Kun*, *Kan* and *Li* account for four hexagrams:\n*Li*’s fire ascends above, *Kan*’s water moistens below.\n*Kan* and *Li*—water and fire—drive each other,\nMutually propelling, fire following the hexagrams.\nWhen the hexagrams’ fire wanes or waxes, it returns to the source,\nReturning to the origin, origin after year after year,\nMonth after month, day after day,\nMatching the primordial talisman’s fire record,\nUniting with the primordial talisman’s record without error.\nThe fire’s splendor accumulates, layer upon layer,\nRefining the essence to the divine, the sagely, the numinous, the ultimate—\nNo addition can increase its boundless fortune,\nIts vast and great divine transformations,\nIts ultimate numinous changes—\nThree things that cannot be added.\nThis is the cinnabar of the Mysterious Origin Sage Ancestor:\nThree cauldrons of cinnabar,\nSix years for purple numinous cinnabar,\nSeven years for purple longevity cinnabar,\nEight years for purple golden cinnabar—\nThe highest grade, the supreme medicine,\nThe numinous purple talisman of divine medicine,\nThe divine talisman descending from Heaven.\n\n**Cinnabar’s Verification of the Dao Song**\nTeach the child these wondrous words,\nThat the child may know the origin of the Dao.",
      "overlap_context": "n soul: to return the hun soul, one must have the celestial hun and po. This is the true ancestor of the human hun soul. Returning the hun revives the dead form, restoring the body to its former state. Reborn into the world, what method is there?\n\nThe method is this: when *fu-zi* arrives, fish scales cluster; at *gou-wu*, horse teeth frost; at *zhuang-mao*, stalactites form; at *guan-you*, feathers and wings break. The body revives and lives again as before. How can one be reborn into the world?",
      "start_char": 6302,
      "end_char": 7214,
      "start_sentence": 221,
      "end_sentence": 241,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.39334726333618,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\许颠君石函记.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "无名天地始，我得天地先，有名万物母，万物复洪源。 聚阴以为地，积阳以为天，盗得三才理，丹砂合自然。 乾坤真正德，晃朗生灵质，杳杳复冥冥，回光含太乙。 金以砂为主，禀和水银母，太阳离火精，射入希夷府，灵英透景明，光华赫然住。 白虎吸红璃，金华生玉芝，欲凝成至药，万化随爻策。 丹象逐爻铢，灵通难画图，宝结蓝天碧，霞光分五色，一号紫金红，二名飞白雪，三日天谷青，四号黑铅液，五名中黄精，固形万万春。 百骸搜九窍，是病都除了，救却老残容，身轻发不皓，续齿如银玉，视暗如灯烛，隐迹在人问，积行施阴德。 不是恋凡华，玉清朝未得，病者即与医，贫者赠黄白，学者遗丹经，指 许真君石函记卷上竟 陈通口诀，功行一朝圆，天书朝太极。 真药便是铅，真汞随火发，水火应天符，不得差时节，四季若不调，寒暄不应律。 仲冬如炎暑，仲夏浓霜雪，多应更漏乖，晦爽不明白。 坤火衰将灭，阴侵萌未发，水盛坎消阳，火多将伐木，相克不相生，阴阳不顺律。 火金不返还，斗错移南北，四七乱纵横，璇玑皆丧失。 炼士审思之，留心子细推，知之不必言，在勤而行之。 此书万遍读，名曰上天梯。 许真君石函记卷下 圣石指玄篇 万象虚生何所约，妙化本因丹汞作。 扶桑束出金乌精，炎焰羽毛光烁烁， 飞走阳火名日魂，暮落朝荣晦还朔。 红轮驾起景阳车，循亡还合游匡郭， 现出真精透体砂，烁石流金孰辨博？ 光济乾坤受日霞，万物生因丹化作。 丹砂则非有为物，不炼五金烧八石，太虚中有颗还丹，化作夜明珠不识， 珠光郁郁现丹霄，玉兔澄辉逐卦爻，坤生震兑乾将巽，艮坤终始复阳爻， 阳往阴来神圣药，仙真号日紫金膏。 一点瞽人双目明，二点枯骨再生肉， 三点顽石化作金，四点长河化酥酪，五点春华不堕叶，日月长开永不绝。 凡磁瓦砾尽成金，朽物沾之色变新，劳疗传尸若得药，服之立效便身轻。 愚者只言身内物，尽向房中寻配匹，即非身内气和精，精去气消何所入？ 百神解散尽遗亡，老倒形枯成癖疾。 圣人言此总成非，争如炼取黄金液。 师言金液昔何因，盘古初分大道根，本是龙精生虎髓，甲乙庚辛化壬癸， 丙丁朱雀火神飞，飞下玄天合戊己。 上降下升三十六，赫赤交缠在南北， 微微腾倒天地精，妙造尽从三五一。 三五与一何所云，生天生地亦生人， 生天能有回天力，生地坚牢万物荣，生人人中分贵贱，福浅丹砂岂能炼？ 志士先须认取铅，不辨真铅枉修炼，天有五贼见者昌，铅舍五彩态殊祥， 生自无名天地始，有名万物母非凡。 非凡通圣人难识，即在玄元藏恍惚， 杳杳冥冥期至精，激阳为电生光明。 光明盘旋分五色，下有铅精人不识， 春元草木夏如冰，秋不聚霜冬没雪，含和长养渐通灵，黄芽不与世铅亲。 黄芽养经八百岁，化为青汞卒难寻，青汞水银难寻觅，周流四大无穷 极。 青汞又经八百岁，化作青金转难得，青金本是青龙骨，生数为三成数八， 三八数终汞气青，化作青埃飞上升。 上升永作仙人禄，浩劫元明为五福， 翡翠景云日青埃，升赴清都归所属。 翠华进入紫阳宫，昭阳殿起龙光红， 光明晃耀照无穷，极阳绝景阴消空。 铅分五彩焰飞空，青赤白黑黄居中，",
      "translated_text": "At the beginning of Heaven and Earth, there was the Nameless—\nI grasped the primal before Heaven and Earth.\nWith names, it became the Mother of the Myriad Things,\nAnd the myriad things return to the vast origin.\n\nGathering yin to form the Earth,\nAccumulating yang to shape the Heavens—\nStealing the principle of the Three Powers,\nCinnabar aligns with Nature.\n\nThe true and upright virtue of Qian and Kun,\nRadiant and bright, gives birth to the essence of life.\nDim and distant, then dark and profound,\nIts reflected light embraces the Great One.\n\nGold takes cinnabar as its master,\nReceiving harmony from the mother of mercury.\nThe essence of the sun’s departing fire,\nPierces the abode of the formless and unseen.\nSpiritual brilliance penetrates the luminous,\nIts radiant splendor blazing forth and abiding.\n\nThe White Tiger inhales the red glass,\nGolden blossoms give rise to jade mushrooms.\nTo congeal the supreme medicine,\nMyriad transformations follow the hexagrams’ strategies.\n\nThe cinnabar’s image follows the hexagrams’ grains,\nIts numinous efficacy defies depiction.\nThe treasure coalesces in azure skies,\nIts rosy glow dividing into five hues:\nFirst called Crimson Golden Red,\nSecond named Flying White Snow,\nThird termed Celestial Valley Green,\nFourth known as Black Lead Liquid,\nFifth named Central Yellow Essence—\nOnce solidified, it endures for ten thousand springs.\n\nSearching the hundred bones and nine orifices,\nAll illness is eradicated.\nIt restores the aged and infirm,\nLightens the body, and darkens the hair.\nTeeth regrow like silver and jade,\nDim eyes shine like lamps.\nConcealing one’s traces among men,\nOne accumulates deeds of hidden virtue.\n\nNot clinging to worldly splendor,\nOne may yet ascend to the Jade Clarity.\nHeal the sick when they seek aid,\nBestow gold upon the poor,\nImpart the alchemical canon to the earnest—\nThus concludes the first scroll of *Master Xu’s Stone Casket Record*.\n\n**Oral Instructions of Master Chen**\nWhen merit and practice reach fulfillment in a single morning,\nHeavenly scriptures arrive at the Supreme Ultimate.\n\nTrue medicine is lead,\nTrue mercury follows the fire’s arising.\nWater and fire respond to Heaven’s tally,\nTiming must not err.\nIf the four seasons fall out of balance,\nCold and warmth no longer follow the rhythm.\nMidwinter like scorching summer,\nMidsummer thick with frost and snow—\nOften the clepsydra falters,\nDawn and dusk grow indistinct.\n\nWhen Kun’s fire wanes toward extinction,\nYin’s encroachment stirs yet unmanifest.\nWater surges, Kan consumes yang,\nFire multiplies, poised to fell the wood.\nMutual conquest, not mutual generation,\nYin and yang defy the proper order.\nFire and metal fail to return,\nThe Dipper strays south and north.\nThe four sevens plunge into chaos,\nThe celestial pivot is lost.\n\nRefining adepts, ponder deeply,\nApply your mind with meticulous care.\nKnowing it need not be spoken,\nIt lies in diligent practice.\nRead this text ten thousand times—\nIt is called the Ladder to Heaven.\n\nThus concludes the second scroll of *Master Xu’s Stone Casket Record*.\n\n**The Sage Stone’s Pointer to the Mysterious**\nFrom what constraint do the myriad forms arise in emptiness?\nWondrous transformation stems from cinnabar and mercury.\n\nFrom Fusang’s east, the golden crow’s essence emerges,\nIts flaming feathers ablaze with radiance.\nSoaring and coursing, the yang fire is called the Sun’s Soul,\nSetting at dusk, flourishing at dawn—waning returns to waxing.\nThe red wheel harnesses the chariot of dawn’s light,\nCircling the lost and returning, roaming the bounded realm.\nThe true essence manifests as cinnabar through the body,\nMelting stone and flowing gold—who can discern its depth?\n\nIts light sustains Heaven and Earth, receiving the sun’s glow,\nAll things live through the cinnabar’s transformation.\nYet cinnabar is no fabricated thing,\nNot smelted from the five metals nor the eight stones.\nWithin the Great Void lies the grain of Returned Cinnabar,\nTransforming into a night-shining pearl unknown to men.\nThe pearl’s glow, dense and resplendent, appears in the cinnabar skies,\nThe jade hare’s limpid radiance follows the hexagrams’ lines.\nKun gives rise to Zhen, Dui to Qian, then Xun,\nGen and Kun begin and end, returning to the yang lines.\nYang departs, yin arrives—the sacred medicine,\nImmortal perfected ones call it Purple Golden Ointment.\n\nOne drop restores sight to the blind,\nTwo drops regrow flesh on withered bones,\nThree drops transmute stubborn stone into gold,\nFour drops turn long rivers to curds,\nFive drops keep spring blossoms from falling,\nSun and moon bloom eternally, never fading.\nCommon pottery and rubble all turn to gold,\nDecayed things touched by it renew their hue.\nFor those afflicted by consumptive corpse-transmission,\nIngesting it brings instant efficacy and bodily lightness.\n\nThe foolish claim it is a thing within the body,\nSeeking matches in the bedchamber.\nYet it is not the body’s qi and essence—\nWhen essence departs and qi dissipates, what enters?\nThe hundred spirits scatter and flee,\nLeaving the aged, withered, and infirm with chronic ailments.\nThe sage declares all such notions false—\nHow can they compare to refining the golden liquid?\n\nThe master explains the golden liquid’s ancient origin:\nAt Pan Gu’s initial division, the Dao’s root.\nIt was the dragon’s essence giving birth to the tiger’s marrow,\nJia and Yi, Geng and Xin transforming into Ren and Gui.\nBing and Ding, the Vermilion Bird’s fiery spirit soars,\nDescending to the Dark Heaven to unite with Wu and Ji.\nThirty-six cycles of ascent and descent,\nScarlet intertwining in north and south.\nSubtly inverting the essence of Heaven and Earth,\nWondrous creation arises from the Three, the Five, and the One.\n\nWhat do the Three, the Five, and the One signify?\nThey give birth to Heaven, Earth, and Man.\nBirth to Heaven grants the power to reverse Heaven,\nBirth to Earth ensures firmness and the flourishing of all things.\nBirth to Man divides high and low—\nThose of shallow fortune cannot refine cinnabar.\nThe earnest adept must first recognize lead,\nFor without discerning true lead, cultivation is in vain.\n\nHeaven has five thieves—those who see them prosper.\nLead harbors five hues, each an auspicious sign.\nBorn from the Nameless at Heaven and Earth’s beginning,\nThe Mother of the Myriad Things is no ordinary being.\nBeyond the ordinary, it eludes even sages,\nHidden within the Mysterious Origin’s indistinct depths.\nDim and distant, dark and profound—awaiting the utmost essence,\nStirring yang into lightning, generating light.\n\nThe light spirals, dividing into five colors,\nBeneath it lies lead’s essence, unknown to men.\nIn spring, plants and trees; in summer, like ice;\nIn autumn, no gathering frost; in winter, no snow.\nEmbracing harmony, nurturing gradually to numinous attainment,\nThe yellow sprout does not mingle with worldly lead.\n\nThe yellow sprout, nurtured for eight hundred years,\nTransforms into azure mercury, elusive to find.\nAzure mercury, quicksilver hard to seek,\nIt courses through the Four Great without end.\nAzure mercury, aged another eight hundred years,\nTransforms into azure gold, even harder to obtain.\nAzure gold is the azure dragon’s bone,\nIts generating number three, its completing number eight.\nWhen three and eight’s count ends, mercury’s qi turns azure,\nTransforming into azure dust that ascends.\n\nAscending forever as the immortal’s emolument,\nThrough eons of primal brightness, it becomes the Five Blessings.\nEmerald clouds and luminous azure dust,\nRising to the Clear Capital, returning to its domain.\nEntering the Palace of Purple Yang,\nThe Hall of Bright Sun blazes with dragon’s red glow.\nIts radiance shines boundlessly,\nUtmost yang extinguishes all yin’s shadows.\n\nLead divides into five hues, flames soaring into the void—\nAzure, crimson, white, black, with yellow at the center.",
      "overlap_context": "s that cannot be added.\nThis is the cinnabar of the Mysterious Origin Sage Ancestor:\nThree cauldrons of cinnabar,\nSix years for purple numinous cinnabar,\nSeven years for purple longevity cinnabar,\nEight years for purple golden cinnabar—\nThe highest grade, the supreme medicine,\nThe numinous purple talisman of divine medicine,\nThe divine talisman descending from Heaven.\n\n**Cinnabar’s Verification of the Dao Song**\nTeach the child these wondrous words,\nThat the child may know the origin of the Dao.",
      "start_char": 7214,
      "end_char": 8499,
      "start_sentence": 242,
      "end_sentence": 294,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.078829526901245,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\许颠君石函记.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "荧荧皎皎色融融，紫神瑞气丹霞笼。 万神呼吸铅气通，玉童玉女啖太空， 准食其辉天老翁，群仙饮食寿无穷。 先朝玉帝现玄穹，说是还丹药祖宗， 此铅不与世铅同，悬空晃朗朗悬空，落霞光透水晶宫，隐明内昭金鸡容。 呼吸风云会虎龙，龙呼於虎虎呼龙，浩气结成真至药，人准迅速入云中。 改形换骨身飞空，貌同元始天尊容，共分一气天地同，返本还源是祖宗。 说尽万般差别法，总与金砂事不同，住世铅精五金主，七十二石之父母。 炼士英灵采得来，倾下先须去阴土，铅砂搏成如土块，六一固济相爱护， 用火缎炼一昼夜，火灭姻消土化灰。 腾铅倒制入灰池，火发铅镕化神水， 神水元因出白金，先取白金为鼎器，白金即是水银胎，返本还源水银制， 水银便是长生药，不是凡问水银作。 朱雀炎空飞下来，摧折羽毛头与脚， 水银绿此不能飞，炼作金丹为大药。 更言恐怕泄天机，此言闻者世间稀， 不是叮咛频嘱付，好色贪财如兽畜。 如违戒约有神明，摄入邓都罪不轻， 更有九泉无限苦，不可等闲容易语。 等闲容易泄非人，万劫沉沦受冥苦。 神室圆明论 凡世间万事，有一事之非凡，非凡者，乃真一之事也，述还丹之道也。 学者甚多，皆不见根源，难穷本末，所以千举万败，竟无成。 果世稀遇者哉！ 凡修大丹，要在筑坛旺方，取土地，择吉祥，不得妄为，妄为招殃。 坛有三级兮方八尺，上下不等兮各有绳墨。 上有一层高二六，上按九官兮九曜九位上方阔一丈六兮二八之数，中有一层高二五，中分八卦兮坛中之心腹，中方阔上丈四兮按二十四气，下有一层高二六，下列八门兮开闭有度，下方阔二丈八兮按二十八宿，四面创剑兮镇压四方，八面悬镜兮照灭邪殃，挂五色彩兮依位逐方，坛上有鳌兮名曰神炉，神炉出没兮炉收火气，收火气兮而聚鼎，鼎受火气兮养神室，神室圆明兮非圆非明，非圆兮状如鹦子，非明兮逐月而生。 金鼎偃月如锅釜，神室为子两分尖，入鼎定鼎鼎难定，入鼎横胎倒鼎偏，倒鼎明堂失正德，横胎用定乱阴阳。 日月不交金水竭。 情性相离不相接，男冠女笄失时年，气不交兮体不合，只因法象有偏颇，致使乾坤不交接。 坎离南北乱纵横，束西卯酉难分别，水火失位，金木差方。 龙潜变匿，失天际之归舟，杀气随风耗散，则虎无形者，盖谓金胎失产，鸡兔相离，覆载无端，倾失神水。 若欲求乌，获兔，须凭匠手立乾坤，入鼎讽燮，重整阴阳运日月，始得依方逐位，金木交并。 运火气而生日晶，伏金水而滋月魄，束西南北之气，并降归金鼎之中，虎瑞龙祥咸结於杳冥之内。 混沌交光，辉辉寥廓，寥廓真空，真空炼妙，炼妙真空，真空隐奥。 隐空炼妙炼庚金，妙分少女，兑体生壬，此言炼妙成神室，神室明开神出没，出为明，此言炼妙合为灵，灵质玲珑神为气，气无质，气入杳冥通恍惚，恍惚中居中有灵，灵言妙气合为神，神运气，气生灵，灵为子，气为母，玄元圣祖岂虚言。 又言炼神合於道，炼神合道非常道，宜向阴符细寻讨观天之道天若何，天有银河室有何，室有星河布列宿，张翼飞兮虚危逐，二十八宿运推兮，水火交踱在南北，赀参相命合氏房，白虎青龙在两傍，虎啸风生龙吐雾，雾霞红红胜火乱。",
      "translated_text": "Glowing bright and radiant, hues blend in warmth,\nPurple spirits and auspicious qi shroud in cinnabar clouds.\nThe myriad spirits breathe, lead’s qi flows through,\nJade lads and jade maidens feast upon the vast sky,\nFeeding on its radiance, the Heavenly Elder,\nAll immortals partake, their lives boundless.\n\nOnce the Jade Emperor appeared in the dark vault,\nProclaiming this the ancestral lineage of returning elixir.\nThis lead differs from worldly lead—\nSuspended in space, luminous and resplendent,\nIts sunset glow pierces the Crystal Palace,\nConcealed brilliance reveals the Golden Rooster’s form.\n\nBreathing winds and clouds, tiger and dragon convene,\nDragon calls to tiger, tiger calls to dragon,\nVast qi congeals into the true supreme medicine,\nSwift as lightning, one ascends into the clouds.\nTransforming form and bone, the body soars through space,\nIts visage like the Primordial Heavenly Honored One,\nSharing one qi with heaven and earth,\nReturning to the root, reverting to the source—this is the ancestor.\n\nThough myriad divergent methods are expounded,\nNone compare to the affairs of golden cinnabar.\nAbiding in the world, lead essence rules the five metals,\nParent of the seventy-two stones.\nWhen the adept’s spirit gathers it,\nFirst cast out the yin earth.\nKnead lead and cinnabar into clods of soil,\nSealed with the six-one method, cherished and guarded.\nRefine with fire for a day and night,\nFire extinguished, smoke dispersed, earth turns to ash.\nRising lead inverts and enters the ash pool,\nFire ignites, lead melts into divine water.\nThis divine water originally issues from white gold—\nFirst take white gold to fashion the crucible,\nWhite gold is the womb of mercury,\nReverting to the source, mercury is refined.\nMercury is the elixir of immortality,\nNot the common mercury of the vulgar world.\n\nAzure Phoenix descends from the flaming sky,\nShedding feathers, head, and talons.\nMercury, thus subdued, cannot take flight,\nRefined into golden elixir, the great medicine.\n\nYet I fear revealing heaven’s secrets,\nSuch words are rare in the mortal realm.\nIf not for repeated exhortations,\nThose lustful and greedy would be no better than beasts.\nShould one violate these precepts, the gods know—\nDrawn into Dengdu, the punishment is no light matter.\nBeyond lie the nine springs, endless suffering,\nNot to be spoken of lightly or carelessly.\nCareless speech betrays the unworthy,\nDooming them to ten thousand kalpas of hellish torment.\n\n**On the Luminous Perfection of the Spirit Chamber**\n\nAmong all worldly affairs, only one is extraordinary—\nThat extraordinary thing is the matter of the True One,\nThe Way of the Returning Elixir.\nMany scholars pursue it,\nYet few glimpse its root or fathom its end,\nThus a thousand attempts yield ten thousand failures,\nAnd true success remains rare.\n\nFor the great elixir’s refinement,\nOne must build an altar in an auspicious direction,\nSelect the land, choose an auspicious day—\nNo reckless action, lest misfortune be invited.\nThe altar has three tiers, each eight feet square,\nUnequal in height, each with its own guiding line.\nThe topmost tier stands two by six in height,\nAligned with the Nine Palaces, the nine luminaries, nine positions—\nIts upper breadth one zhang and six feet, the number of two eights.\nThe middle tier stands two by five in height,\nDivided by the Eight Trigrams, the heart and viscera of the altar—\nIts breadth one zhang and four feet, corresponding to the twenty-four qi.\nThe lowest tier stands two by six in height,\nArranged with the eight gates, opening and closing by measure—\nIts breadth two zhang and eight feet, aligned with the twenty-eight constellations.\nFour sides wield swords to suppress the four directions,\nEight mirrors hang to dispel inauspicious influences,\nFive-colored silks drape according to position and direction.\nUpon the altar rests a sacred furnace named the Spirit Crucible,\nThe Spirit Crucible appears and vanishes, gathering fire’s qi,\nGathering fire’s qi to nurture the cauldron,\nThe cauldron receives fire’s qi to nourish the Spirit Chamber.\nThe Spirit Chamber, luminous and perfect—\nNot round, yet like a parrot’s form,\nNot bright, yet waxing with the moon.\n\nThe golden cauldron, crescent like a pot,\nThe Spirit Chamber, its child, tapers at both ends.\nEntering the cauldron, the cauldron resists settling,\nEntering the cauldron, the embryo lies transverse, the cauldron tilts.\nAn inverted cauldron loses the Hall of Brightness’ true virtue,\nA transverse embryo disrupts yin and yang.\nSun and moon fail to unite, metal and water exhaust,\nPassion and nature part, never to meet.\nMan’s cap and woman’s hairpin miss their timely years,\nQi fails to merge, bodies fail to unite—\nAll because the ritual image is askew,\nCausing Qian and Kun to remain unjoined.\nKan and Li, north and south, in chaos,\nEast and west, Mao and You, indistinguishable.\nWater and fire lose their positions,\nMetal and wood stray from their directions.\nThe dragon hides, vanishing from the celestial path,\nKilling qi scatters with the wind—\nThe tiger, formless, for the golden embryo fails to take shape.\nHare and rooster part, heaven and earth overturn without reason,\nDivine water spills and is lost.\n\nIf one seeks the crow and obtains the hare,\nOne must rely on the craftsman’s hand to establish Qian and Kun,\nEnter the cauldron to harmonize, reorder yin and yang,\nRevolve the sun and moon—\nOnly then can one follow positions and directions,\nMetal and wood unite.\nRevolving fire’s qi to engender the solar essence,\nSubduing metal and water to nourish the lunar spirit.\nThe qi of east, west, south, and north,\nAll descend into the golden cauldron,\nAuspicious tiger and dragon signs congeal within the profound darkness.\nChaos and light intermingle, radiance vast and boundless,\nThe boundless true void—\nThe true void refines the wondrous,\nRefining the wondrous true void,\nThe true void conceals the profound.\nConcealed void refines the wondrous, refining bedrock metal—\nThe wondrous divides the maiden,\nDui’s body engenders Ren.\nThis speaks of refining the wondrous to perfect the Spirit Chamber,\nThe Spirit Chamber’s brilliance opens, the spirit emerges and vanishes.\nEmergence is brightness—\nThis speaks of refining the wondrous to unite as numen,\nThe numinous essence, crystalline, the spirit as qi.\nQi has no form,\nQi enters the profound darkness, traversing the indistinct.\nWithin the indistinct, at the center, dwells the numinous—\nThe numinous speaks of wondrous qi uniting as spirit.\nSpirit moves qi, qi engenders the numinous,\nThe numinous is the child, qi the mother.\nHow could the Mysterious Origin’s Sacred Ancestor speak falsely?\n\nIt further speaks of refining the spirit to unite with the Dao,\nRefining spirit to unite with the Dao—this is no ordinary Dao.\nOne should seek it diligently in the *Yin Fu Jing*,\nObserve the heavens’ Way—what is the sky?\nThe sky has the Silver River, the chamber has what?\nThe chamber has the stellar river, constellations arrayed—\nZhang and Yi fly, Xu and Wei pursue.\nThe twenty-eight constellations revolve,\nWater and fire tread in north and south.\nZi and Shen command, He and Fang unite,\nWhite Tiger and Azure Dragon stand on either side.\nThe tiger roars, wind arises; the dragon spouts mist,\nMist and rosy clouds redden, outshining chaotic flames.",
      "overlap_context": "ascends.\n\nAscending forever as the immortal’s emolument,\nThrough eons of primal brightness, it becomes the Five Blessings.\nEmerald clouds and luminous azure dust,\nRising to the Clear Capital, returning to its domain.\nEntering the Palace of Purple Yang,\nThe Hall of Bright Sun blazes with dragon’s red glow.\nIts radiance shines boundlessly,\nUtmost yang extinguishes all yin’s shadows.\n\nLead divides into five hues, flames soaring into the void—\nAzure, crimson, white, black, with yellow at the center.",
      "start_char": 8499,
      "end_char": 9755,
      "start_sentence": 295,
      "end_sentence": 331,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.9831006526947,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\许颠君石函记.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "红碎碎成颗颗，颗粒颗粒真珠红，红英紫脉生金公。 金公水土相并合，炼就黄芽成白雪，紫砂红粉乱飘飘，乱飘飘兮青龙膏。 红粉少白虎老，炼就龙膏并虎脑，长生殿生如意宝，点金万两何足道！ 何足道，能点衰翁永不老，长生殿药万万春，丽日滋生天柱明。 天柱明时魂交魄，蟾蛛兔髓汞浮白，魄感魂华生玉芝，广寒神舍垣娥宅。 飞光砂起震离束，金乌飞入广寒宫，灿火姻霞龙吐雾，绛砂坠落紫金红。 红英紫金金英紫，金英紫篆紫霞缕，缕金光透紫霞姻，红紫混成藏金色。 紫华耀日升金碧，金碧空青生紫华，翠霞澄碧接青霞，霞英灵景灵砂液。 砂脱离红青碧色，象则成形现杳冥，散则龙潜如鬼匿。 如鬼匿飞走水火难寻觅，砂汞附形生水火，不得真铅实不可。 实不可，砂隐铅中石隐火，击石见火火生姻，不击元姻体自然，砂隐铅中亦自然。 水养火滋才感激，感而遂通生金液，金液通神万古灵，焰焰通灵气与神。 神奔气运风雷鼓，鼓动风雷火生土，坎戊玄土金为父，离己牝土汞为母。 汞为母太上语，天下有始兮以为天下母，天上苍苍，晶灵飞光，真灵感召，砂汞飞光，飞光砂，炎火逼逼逐，熬熬声悲泣，其声河上应虚张，虚张何生，水激火烹。 火烹兮女气索，水激兮婴兄脱黑，脱黑则洁白见宝，气索则变红离色。 太阳明，太阳舒光为日新，日初新汞初凝，铅汞初凝兮丹象何陈。 丹象於天，出为日月，日为流珠，元气虚无，透金入石，神出鬼没。 神出兮神升天门，即日天魂； 鬼没兮鬼入地户，即曰地魄。 天魂地魄周宗祖，互为室宅分子午，水火交火生土，二土成圭银化金，离中火舍坎中精。 离中精光，天一伏藏，天藏其光，明亦不出，隐明内照，外通光耀。 光耀圆空，光明相通，是金火交圣日圣月，灵运潜通，紫灵神药，药有神通，通神阳火，焰焰烧空。 飞光布气，感而遂通，玉芝丹质，透霞入红。 入红兮火华光，分明照耀。 耀者离雌，照者坎雄，离雌坎雄，光明相通。 通雌入雄，变化无穷。 迭迭透霞兮华彩重重，华因二景，真木真金。 真木束方兮震雷生，震为长男兮震木生火。 震又为龙，龙从火行火真。 其西方兮兑藏金水水能调庚，兑为少女。 虎啸风生，风雨形声，迅速不停，形声绝影，金木交并，二气降灵，搏成金精。 金精大药，中有五行，五行神水，神水金浆，神水神火。 两相亲，火中水处，水中含金。 阳真汞受金气，震合庚辛入酉位，震受阳符渐成九爽利舒光。 震初有，从初入转震生灵坤，初六变成初九震。 照六庚庚属酉，震当五日为一候，震来受符六十时。 阳遁上元终则始，终於震卦始成兑，兑逐阴符坤六二，交爻变象莫能窥。 六二换阳成九二，此是金来入火乡，月行丁位半轮光，金何为火？ 何以兑感六丁？ 丁属己兑属金，丁属火，金火相交火生土，土生金，金火始兑，当五日为一候。 兑来受符，六十时阳遁中元，终则始。 终於兑卦始成乾，阳往阴来任自然。 阳极乾阴极坤，乾终九阴终六，六二六三兮三变成九，九三夕惕兮成乾体，盛明兮圆照束方甲。 六甲属兮乾当三五，乾当五日为一候，乾来受符六十时，阳遁下元兮前三十五，积一百八十时兮象半年，德就乾体交二八，阳极阴生兮乾体满，退阳就阴兮转受於巽，巽统阴符坤初六，六辛成巽成自十六，十六至二十六，巽将生艮。",
      "translated_text": "Scarlet fragments shatter into beads,\nBead upon bead—true pearls of crimson,\nCrimson blossoms with purple veins birth the Golden Duke.\nGolden Duke joins with water and earth,\nRefined into yellow sprouts that turn to white snow,\nPurple sand and rouge swirl in disarray,\nSwirling—Azure Dragon’s ointment.\n\nThe rouge, young; the White Tiger, aged,\nRefined into dragon’s ointment and tiger’s marrow,\nIn the Hall of Longevity, the wish-fulfilling jewel is born,\nWhat are ten thousand taels of gold to this?\n\nWhat are ten thousand taels?\nIt can touch the withered elder, granting eternal youth,\nThe Hall of Longevity’s elixir brings myriad springs,\nThe radiant sun nourishes, the Pillar of Heaven gleams.\n\nWhen the Pillar of Heaven gleams, soul and spirit unite,\nToad’s marrow and hare’s essence—mercury floats white,\nSpirit responds to soul’s radiance, birthing jade mushrooms,\nThe Divine Mansion of Broad Cold, the palace of Chang’e.\n\nCinnabar’s flying light rises, shaking Li’s restraint,\nThe Golden Crow flies into the Palace of Broad Cold,\nFlaming mists and rosy clouds—dragon’s exhaled vapor,\nVermilion cinnabar descends, purple-gold crimson.\n\nCrimson blossoms of purple-gold, golden blossoms of purple,\nGolden blossoms trace purple clouds in purple haze,\nHaze threads golden light through purple mist,\nCrimson and purple blend, concealing golden hue.\n\nPurple radiance shines sunward, ascending golden-green,\nGolden-green void-blue births purple radiance,\nVerdant haze clears to azure, merging with blue mist,\nMist’s blossoms—numinous essence, numinous cinnabar sap.\n\nCinnabar sheds its crimson, turning azure-green,\nIn form, it manifests in the unseen,\nScattered, the dragon hides like a ghost in concealment.\nLike a ghost in concealment, it flees—water and fire cannot trace it,\nYet when cinnabar and mercury cling to form, water and fire arise,\nWithout true lead, it truly cannot be.\n\nTruly cannot be—\nCinnabar hides within lead, stone conceals fire,\nStrike stone to see fire, fire births mist,\nWithout striking, the mist’s essence remains natural,\nCinnabar hidden in lead is also natural.\n\nWater nurtures, fire nourishes—only then is there resonance,\nResonating, it penetrates, birthing golden liquid,\nGolden liquid unites with spirit, eternally numinous,\nFlaming, it connects spirit with qi.\n\nSpirit rushes, qi moves—wind and thunder drum,\nDrumming wind and thunder, fire gives birth to earth,\nKan’s wu, the mysterious earth—metal is the father,\nLi’s ji, the receptive earth—mercury is the mother.\n\nMercury as mother—the Supreme’s words:\n“The world has a beginning, which is the mother of all under heaven.”\nHeaven above, vast and azure,\nCrystal numinosity, flying light,\nTrue numinosity summons—cinnabar and mercury take flight,\nFlying light of cinnabar,\nFiery flames press close in pursuit,\nBoiling, the sound is mournful,\nIts voice echoes over rivers, responding to emptiness,\nWhat does emptiness give birth to?\nWater’s surge, fire’s seething.\n\nFire seethes—the Weaver Girl’s qi wanes,\nWater surges—the Infant Boy sheds blackness,\nShedding black, purity reveals the treasure,\nQi wanes—red departs from its hue.\n\nThe Great Yang shines,\nThe Great Yang unfurls its light, renewing daily,\nThe sun’s renewal—mercury’s first coagulation,\nLead and mercury’s first coagulation—what form does the elixir take?\n\nThe elixir’s form in heaven\nEmerges as sun and moon,\nThe sun as a flowing pearl,\nPrimal qi’s emptiness and nothingness,\nPiercing metal, entering stone,\nSpirit emerges, ghost vanishes.\n\nSpirit emerges—spirit ascends to Heaven’s Gate,\nAt once the celestial soul;\nGhost vanishes—ghost enters Earth’s Door,\nAt once the terrestrial spirit.\nCelestial soul and terrestrial spirit encircle the ancestral origin,\nMutually serving as chambers, dividing at zi and wu,\nWater and fire intersect, fire gives birth to earth,\nTwo earths form the gui, silver transforms into gold,\nLi’s fire chamber holds Kan’s essence.\n\nLi’s essence-light,\nHeaven’s One lies hidden,\nHeaven conceals its light,\nBrightness does not emerge,\nHidden brightness shines within,\nExternally, it connects with radiance.\n\nRadiance fills the void,\nLight and brightness interpenetrate,\nThis is the sacred day and sacred month where metal and fire meet,\nNuminous movement subtly connects,\nThe purple numinous elixir,\nThe elixir possesses numinous power,\nUniting with yang fire,\nFlaming, it burns the void.\n\nFlying light spreads qi,\nResonating, it penetrates,\nJade mushroom’s elixir essence,\nPierces mist, enters crimson.\n\nEntering crimson—fire’s blossom-light,\nClearly illuminating.\nThe illuminator is Li’s feminine,\nThe illuminator is Kan’s masculine,\nLi’s feminine and Kan’s masculine,\nLight and brightness interpenetrate.\n\nPenetrating the feminine into the masculine,\nTransformations are boundless.\nLayer upon layer, piercing mist—blossoms upon blossoms,\nBlossoms arise from the two luminaries,\nTrue Wood, true Metal.\nTrue Wood binds the east—Zhen’s thunder arises,\nZhen is the eldest son—Zhen’s Wood gives birth to fire.\nZhen is also the dragon,\nThe dragon follows fire’s path—fire is true.\n\nIts west—Dui conceals Metal and Water,\nWater can harmonize with geng,\nDui is the youngest daughter.\nTiger’s roar births wind,\nWind and rain take form and sound,\nSwift and ceaseless,\nForm and sound leave no trace,\nMetal and Wood intersect,\nThe two qi descend with numinosity,\nForge into golden essence.\n\nGolden essence, the great elixir,\nWithin it, the Five Phases,\nThe Five Phases’ numinous water,\nNuminous water’s golden nectar,\nNuminous water, numinous fire.\nThe two are intimate,\nWater within fire,\nGold contained in water.\n\nTrue yang mercury receives metal’s qi,\nZhen unites with geng and xin, entering the you position,\nZhen receives the yang tally, gradually forming the ninefold brilliance of radiant light.\nZhen’s initial presence,\nFrom the beginning, entering the turning Zhen, giving birth to numinous Kun,\nThe initial six transforms into Zhen’s initial nine.\nIlluminating the six geng—geng belongs to you,\nZhen governs five days as one pentad,\nZhen arrives to receive the tally for sixty hours.\n\nThe upper yang cycle ends and begins anew,\nEnding at Zhen, beginning at Dui,\nDui pursues the yin tally, Kun’s six-two,\nExchanging lines, the image’s transformation cannot be fathomed.\nSix-two changes to yang, becoming nine-two,\nThis is metal entering the realm of fire,\nThe moon traverses the ding position, half-wheel light,\nWhy does metal serve fire?\nHow does Dui resonate with six ding?\n\nDing belongs to ji, Dui to metal,\nDing belongs to fire,\nMetal and fire intersect, fire gives birth to earth,\nEarth gives birth to metal,\nMetal and fire begin at Dui,\nGoverning five days as one pentad.\nDui arrives to receive the tally for sixty hours,\nThe middle yang cycle,\nEnding and beginning anew.\nEnding at Dui, beginning at Qian,\nYang departs, yin arrives—naturally so.\n\nYang’s extremity is Qian, yin’s extremity is Kun,\nQian ends at nine, yin ends at six,\nSix-two and six-three—three changes form nine,\nNine-three, vigilant at dusk—forming Qian’s body,\nIn full brilliance, it roundly illuminates the east’s jia.\nThe six jia belong—Qian governs three and five,\nQian governs five days as one pentad,\nQian arrives to receive the tally for sixty hours,\nThe lower yang cycle—thirty-five preceding,\nAccumulating one hundred eighty hours—symbolizing half a year,\nVirtue completes Qian’s body, uniting the two eights,\nYang’s extremity gives birth to yin—Qian’s body is full,\nRetreating yang, approaching yin—turning to receive at Xun,\nXun governs the yin tally, Kun’s initial six,\nSix xin forms Xun, forming from sixteen,\nSixteen to twenty-six,\nXun is about to give birth to Gen.",
      "overlap_context": "ently in the *Yin Fu Jing*,\nObserve the heavens’ Way—what is the sky?\nThe sky has the Silver River, the chamber has what?\nThe chamber has the stellar river, constellations arrayed—\nZhang and Yi fly, Xu and Wei pursue.\nThe twenty-eight constellations revolve,\nWater and fire tread in north and south.\nZi and Shen command, He and Fang unite,\nWhite Tiger and Azure Dragon stand on either side.\nThe tiger roars, wind arises; the dragon spouts mist,\nMist and rosy clouds redden, outshining chaotic flames.",
      "start_char": 9755,
      "end_char": 11006,
      "start_sentence": 332,
      "end_sentence": 375,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.981059551239014,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\许颠君石函记.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "巽当五日为一候，巽来受符六十时，阴遁上元终则始。 终於巽卦始成艮，巽艮交爻象已定。 象已定，艮合六丙当受巽，六一巽六二艮，六三加临阴巳盛。 阴盛水旺火将残，二十三日属下弦。 下弦艮火自合亏，艮当五日为一候，止艮来受符，六十时阴遁中元，终则始。 终於艮卦始成坤，坤象黑，乙癸六三兮坤它乙，六一属坤兮三十日，坤当五日为一候毕。 坤来受符六十时，阴遁下元终则始，始於前前三五，终於后后三五。 六候昏明受寒暑，昏明晦朔运推移，晦积一百八十时象半年前弦之后后弦前，六候三旬象一年，一年全用十二节，卦火亏盈逐一月。 一月六候一周天，先天而后绩后天，时计一万零三千。 一万三千符火足，准三年。 三年火炼流珠鼎，鼎似招阳聚天镜，鼎中光映日霞红，霞映日魂来合鼎。 合鼎日红传晷景，晷景南行日至丙，日至丙午爻并汞，冲神室。 神饮景，饮景沉醉醉复醒，神气冲和神酩酊。 神酩酊，绵绵焰焰，通灵光运圆。 光明镜面火晶盘，晶盘散撒如金粟。 金粟火华荧惑，醉如柳麦色黄深，太仓神舍盘盈盈。 盈盈闪烁晶赫赫，夜属月魂鼎象白。 鼎象白兮是月圆，鼎通天，天上月圆鼎亦然。 天上鼎内卦属乾，乾物，鼎圆明运月圆，光如镜面水晶盘，炼出银蟾似月圆。 月圆望盈巽损侧，晦属阴符鼎象黑，朔象白晦象黑，黑白亏盈或圆缺，圆缺之中，月明中夜听更漏。 漏才终当日视晷盘，久晷景忘前日落，酉落霞红，象应丹砂。 鼎内同映结红霞。 鼎玲珑玲，珑火化华芙蓉，火符结撮日洪蒙，洪蒙不是寻常入口美味甘如蜜。 因食不觉体随风，轻举飞腾骯太空。 骯太空显仙宗，莫言来世又相逢，太愚蒙，休谈妙有说真空。 是非同，空即是色，色是空，其色苍苍照耀红。 与君说破我家风，太阳移在月明中，月明太阳天上药，人服之时跨鸾鹤。 万法千门都是错，学取吾家这一着，这一着，跳出五行真快乐。 金鼎虚无论 余闻上古修丹。 须凭法，妙会多生，夙契相遇成真，是谓共获，生天地之灵也。 或问：天地之灵，生於何所？ 答日：凿开混沌，土分黄黑色，生天地之金精，深藏溟滓，为道之根本，羽客受得，可造金鼎。 且金鼎者，夫何为生？ 何为而有？ 日：生自无形，无名之始，有何为万物之母，子得金精作命基，命基只是金华池，华池神水太渊晶，太渊金晶绝万灵，万灵号日万物母，先圣将来为鼎金。 鼎金元来药里寻，寻来不是世问金，世问金，何足异，金鼎鼎金通天地，通得三光鼎受符，汞侵金鼎气生虚，虚气生虚无生有，有生无，元有虚无。 虚化枢，枢纽的然真种类，何忧水火不吹嘘。 水润下水在上，魄吸水银魂荡样，火在下火炎上，火养水生逐爻象。 阳象流珠水作丹，阴象随金逐水长，金水火名三五，金三五，金主策外汞相处，震青龙兑白虎，乾体圆明金三五。 金渐晦水渐举，白虎亏盈变黑虎，玄武阴生入癸乡，巽艮还坤水三五。 金为子水为母，阴符阳火分子午，刚柔文武运推移，火生火灭化为土。 此是火三五，水火交四维，金作火将衰，一作水将生火则终火则始，衰则终生则始，定浮沉兮金化水，分刻漏白化黑，黑则终白则始，黑白往来逐月矣！ 知白来守黑去，三百六十有五度。",
      "translated_text": "Xun governs five days as one pentad,\nXun arrives to receive the tally for sixty hours,\nThe upper yin cycle—ending then beginning.\n\nEnding at Xun’s hexagram, beginning to form Gen,\nXun and Gen exchange lines—images now fixed.\nImages now fixed, Gen unites with six bing to receive Xun,\nSix-one Xun, six-two Gen,\nSix-three presses near—yin flourishes in full.\n\nYin flourishes, water waxes as fire wanes,\nThe twenty-third day belongs to the last quarter.\nLast quarter—Gen’s fire naturally wanes,\nGen governs five days as one pentad,\nCeasing at Gen, it arrives to receive the tally for sixty hours,\nThe middle yin cycle—ending then beginning.\n\nEnding at Gen’s hexagram, beginning to form Kun,\nKun’s image is black,\nYi and gui’s six-three—Kun’s yi,\nSix-one belongs to Kun—thirty days,\nKun governs five days as one pentad complete.\n\nKun arrives to receive the tally for sixty hours,\nThe lower yin cycle—ending then beginning,\nBeginning at the prior three-five,\nEnding at the latter three-five.\nSix pentads—dusk and dawn receive cold and heat,\nDusk and dawn, darkness and new moon—shifting in turn,\nDarkness accumulates one hundred eighty hours—symbolizing half a year,\nAfter the prior quarter, before the latter quarter,\nSix pentads, three decades—symbolizing one year,\nOne year fully employs twelve nodes,\nHexagram fire wanes and waxes through each month.\n\nOne month, six pentads—one celestial cycle,\nFirst the prior heaven, then the succeeding heaven,\nTime tallies ten thousand three hundred.\nTen thousand three thousand—fire tally complete,\nStandard for three years.\n\nThree years—fire refines the flowing-pearl tripod,\nThe tripod resembles summoning yang to gather the celestial mirror,\nWithin the tripod, light reflects the sun’s rosy glow,\nGlow reflects the sun’s essence to unite with the tripod.\n\nUniting the tripod, the sun’s red transmits the gnomon’s shadow,\nThe gnomon’s shadow moves south to the sun’s bing,\nThe sun reaches bing-noon—lines merge with mercury,\nStriking the spirit chamber.\nSpirit drinks the shadow,\nDrinking the shadow, deeply drunk—drunk then sober,\nSpirit and qi harmonize—spirit mellows.\n\nSpirit mellows,\nTrailing flames, flickering,\nCirculating numinous light in a circle.\nLight—mirror’s surface, fire’s crystal plate,\nThe crystal plate scatters like golden grains.\nGolden grains—fire’s radiance, Mars’ glow,\nDrunk like willow and wheat—color deep yellow,\nThe Grand Granary’s spirit abode—plate brimming.\nBrimming, glinting—crystal radiance,\nNight belongs to the moon’s essence—tripod’s image white.\n\nTripod’s image white—this is the moon’s fullness,\nTripod connects to heaven,\nIn heaven, the moon is full—so too the tripod.\nIn heaven, within the tripod—hexagram belongs to Qian,\nQian’s substance,\nTripod’s round brightness moves with the moon’s fullness,\nLight like a mirror’s surface, a crystal plate,\nRefining silver toad—moon-round.\nMoon full, waxing at Xun—waning at its side,\nDarkness belongs to yin tally—tripod’s image black,\nNew moon’s image white, darkness’ image black,\nBlack and white, waning and waxing—round and crescent,\nWithin round and crescent,\nMoon bright at midnight—listen to the watchman’s clepsydra.\n\nAs the clepsydra ends, the day gazes at the gnomon’s plate,\nLong gazing at the shadow—forgetting the prior day’s sunset,\nSunset at you—rosy glow,\nImage responds to cinnabar.\nWithin the tripod, together reflecting—knotting red glow.\n\nTripod—exquisite, resonant,\nResonant fire transforms into lotus,\nFire tally knots—gathering the sun’s primordial chaos,\nPrimordial chaos—not the ordinary sweetness of honey on the tongue.\nFeeding, unaware—body follows the wind,\nLightly rising, soaring—riding the great void.\nRiding the great void—revealing the immortal lineage,\nDo not speak of meeting again in the next life,\nToo foolish and ignorant,\nCease discussing wondrous being—speak of true emptiness.\n\nRight and wrong the same,\nEmptiness is precisely form, form is emptiness,\nIts color—verdant, shining red.\nI reveal to you my family’s tradition,\nThe great yang moves within the moon’s brightness,\nMoon’s brightness—great yang, heaven’s medicine,\nWhen one ingests it—riding simurgh and crane.\nTen thousand methods, a thousand gates—all are mistaken,\nLearn this one move of my family,\nThis one move—leaping beyond the five phases, truly joyous.\n\nThe golden tripod—empty, without discussion.\nI have heard that in high antiquity, refining the elixir\nMust rely on method,\nWondrously meeting across many lives,\nPredestined affinity—encountering to become true,\nThis is called mutual attainment,\nGaining the numen of heaven and earth.\n\nSomeone asks: The numen of heaven and earth,\nBorn from where?\nAnswer: Chiseling open primordial chaos,\nEarth divides into yellow and black,\nGiving birth to heaven and earth’s golden essence,\nDeeply hidden in the murky depths,\nAs the Dao’s root,\nWhen feathered guests obtain it, they can create the golden tripod.\n\nMoreover, the golden tripod—\nFrom what is it born?\nFrom what does it arise?\nAnswer: Born from formless,\nThe beginning of the nameless,\nThe mother of the ten thousand things—what is it?\nThe child obtains golden essence to establish the foundation of life,\nThe foundation of life is merely the golden flower’s pool,\nThe flower pool’s spirit water—great abyss’ crystal,\nThe great abyss’ golden crystal—surpassing the ten thousand numina,\nThe ten thousand numina are called the mother of the ten thousand things,\nFormer sages took it to make the tripod’s gold.\n\nTripod’s gold—originally sought within medicine,\nSought—it is not the world’s gold,\nThe world’s gold—what is extraordinary?\nGolden tripod, tripod’s gold—connecting heaven and earth,\nConnecting the three luminaries, the tripod receives the tally,\nMercury invades the golden tripod—qi generates emptiness,\nEmpty qi generates emptiness—nothing generates being,\nBeing generates nothing,\nOriginally having nothing—nothing.\nNothing transforms the pivot,\nThe pivot’s natural true kind,\nWhy worry water and fire will not nurture?\n\nWater moistens downward—water above,\nPo absorbs mercury—hun sways the pattern,\nFire below—fire flames upward,\nFire nurtures water—generating according to line images.\nYang image—flowing pearl, water makes the elixir,\nYin image—following metal, water grows,\nMetal, water, fire—named three-five,\nMetal three-five,\nMetal governs the exterior—mercury dwells alongside,\nZhen’s green dragon, Dui’s white tiger,\nQian’s body—round brightness, metal three-five.\n\nMetal gradually darkens, water gradually rises,\nWhite tiger wanes and waxes—transforming into black tiger,\nXuanwu—yin born, entering gui’s realm,\nXun, Gen return to Kun—water three-five.\nMetal as child, water as mother,\nYin tally, yang fire—dividing zi and wu,\nHard and soft, civil and martial—shifting in turn,\nFire born, fire extinguished—transforming into earth.\n\nThis is fire three-five,\nWater and fire intersect the four directions,\nMetal acts as fire—about to wane,\nOnce as water—about to generate fire then ending, fire then beginning,\nWaning then ending, generating then beginning,\nFixed floating and sinking—metal transforms into water,\nDividing the clepsydra—white transforms into black,\nBlack then ending, white then beginning,\nBlack and white come and go—following the moon!\n\nKnowing white, come to guard black—depart,\nThree hundred sixty-five degrees.",
      "overlap_context": "s five days as one pentad,\nQian arrives to receive the tally for sixty hours,\nThe lower yang cycle—thirty-five preceding,\nAccumulating one hundred eighty hours—symbolizing half a year,\nVirtue completes Qian’s body, uniting the two eights,\nYang’s extremity gives birth to yin—Qian’s body is full,\nRetreating yang, approaching yin—turning to receive at Xun,\nXun governs the yin tally, Kun’s initial six,\nSix xin forms Xun, forming from sixteen,\nSixteen to twenty-six,\nXun is about to give birth to Gen.",
      "start_char": 11006,
      "end_char": 12220,
      "start_sentence": 376,
      "end_sentence": 419,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.49414777755737,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\许颠君石函记.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "开生门闭死户，水火优游居鼎釜，水火无差药有灵，为何灵？ 水消烁火熏蒸，水火为媒招日魂，魂张神碎飞阳华，魄啖魂华食碧砂。 食碧砂食马牙，马牙灵异世无比，得号流魂。 魂涉水水涉魂，震阳明，天符降奉，日晨准日讫，急急如律令。 劝追魂来伏虎窟，呼吸风云水火入，水火烹轰虎喷声。 水灵晶火灵晶，水灵火灵魄与魂，魄灵能吸魂灵晶。 魂吸魄魄吸魂，魂吸魄兮魂定鼎，魄吸魂兮魄鼎魂。 且魂鼎者，制伏水银不飞扬，翱翔戏鼎光，散霞消烁烁紫金红粉故曰魂定。 定则不动，动则火直，火直往来，不往不来，着而成宝。 且魄鼎者，玄武宁静，静则金生水，金能生水，水乃澄明，明生聚景故日魄，鼎乃是也。 金养水火养金，魂恋魄魄恋魂，自然金鼎宰神明，产出丹砂性合情，不是朱砂及水银。 大药金丹三八品，万象爻铢列金鼎，水火加临有浅探，二十四气相推准。 视之不见听不闻，高寿妙年修金鼎，烧成无价珍，回阳换骨紫消金。 紫消金通神灵，金乌入阳光进，青霞舞红霞运，青红同入归金鼎，修成造化炉，九还七返炼虚无。 七返炼成红玉粉，九还炼就紫金酥。 紫金酥红玉粉，魂和魄魄和魂，元有虚无虚化神。 神化气，气化水，水化木，木化火，火化土，土化金，金化水。 钻，簇五行金鼎裹，腾腾两曜运光辉。 水飞火飞，离化火，坎化水，水激火，火激水，离咀坎，坎咀离，相咀相嚼碎虹蜕虹蚬气结如屑硝，马齿搓牙光皎洁。 。 光逐人生虎魄中，紫金台上凝霜雪，色若琼瑶虚飘飘，阳气轻清轻拂拂。 轻清阳砂光耀日，耀耀争光砂夺色，荧煌晃晃黄舆灵，舆灵能点化生灵，舆灵本在扶桑出，体因砂有铅中得，腾光粟乱星飞乱，星研细，青龙骨，至神至圣飞腾物，飞腾不飞何得知？ 试将些子望空掷，果然能有回天力。 丹砂高奔登空，朱见走入金乌窟，轻清阳光养阳药，华射阳光光射药，相辉相烁混其光，吸吸紫华升太阳。 太阴太阳真水火，水克火灭太化为土，隐明伏火土潜辉，潜辉藏虚虚化气，虚气接连通上下。 通上下兮火随卦，卦火亏盈盈则昌。 照阳光火着光，几千万丈，光生火昌，阳晶逐火火招阳，阳燧烁日兮照阳无穷无极，火胜光冲运气光，光彻地地通元气，火随光，火气运行生万物，目前火化晖阳光。 阳燧聚阳光感激，感而遂通生恍惚，荣荣赫焰阳精，光透姻生火折灿。 阳光随入黄金舍照耀乾坤砂世界，金砂喷火散阳光，大地阳光生世界。 光逐神生神逐光，大千沙界此中藏，劫尽恒河沙世界，一砂一劫失阳光。 阳光既失何所名，龙汉延康至赤明，此言劫数已沉沦，劫力难逃不可闻。 黑风飘荡失三才，倒岳摧山尽作尘，地水火风皆席卷，屋宇楼台尽底沉。 蠢动含灵皆失养，不分南北与束西，森罗万象无踪迹，五行四象何所觅。 声响声形不可逃。 混混元光皆暗黑，玄寂寂，复玄玄，不明探处至深极。 至深极，则返还元，返本还元天地先。 天地先，一气能分天地元，元黄正气真一祖，能生万象为丹母，因母立兆作丹基，兆召青腰使者归。 青腰召入留光殿，炼作窗尘光不现，窗尘亦名日黄埃。 太阳变，太阳变则有何为，水火通流十二时，十二时无中有子午，卯酉分四九，四九火钻三十六，子午卯酉分南北。",
      "translated_text": "Opening the Gate of Life and sealing the Door of Death,\nwater and fire roam leisurely within the crucible and cauldron.\nWater and fire without error—yet the medicine holds numinous power.\nWhy numinous?\nWater dissolves, fire steams and seethes,\nwater and fire act as matchmakers to summon the solar soul.\nThe soul expands, the spirit shatters—yang’s radiance takes flight,\nthe po devours the soul’s bloom and feeds on azure sand.\n\nFeeding on azure sand, feeding on horse-tooth spar,\nhorse-tooth spar’s numinous marvel unmatched in the world—\nearning the name \"flowing soul.\"\nSoul crosses water, water crosses soul,\nthunder shakes yang brightness—heavenly tally descends in obeisance.\nDaybreak aligns with the sun’s end—\n*hasten, hasten, as in the statutes and ordinances!*\n\nUrge the soul to pursue and tame the tiger’s den,\nbreathing in wind and clouds, drawing in water and fire.\nWater and fire boil and roar—the tiger’s roar resounds.\n\nWater’s numinous essence gleams, fire’s numinous essence gleams,\nwater’s numinous spirit, fire’s numinous spirit—po and hun.\nThe po’s numen can absorb the hun’s luminous essence.\nHun absorbs po, po absorbs hun—\nhun absorbs po, then hun settles the crucible;\npo absorbs hun, then po crucibles the hun.\n\nNow, the hun-crucible:\nit subdues and restrains mercury, preventing it from flying,\nsoaring and playing within the crucible’s light.\nScattered rosy clouds dissolve in searing brilliance—\npurple gold and rouge powder—thus called \"hun settled.\"\nSettled, it does not move; moved, fire rises straight.\nFire’s straight ascent and descent—\nneither going nor coming—\nwhen applied, it becomes treasure.\n\nNow, the po-crucible:\nXuanwu’s tranquility—\ntranquil, then metal generates water.\nMetal can generate water—\nwater then clarifies and brightens.\nBrightness gives rise to gathered radiance—thus called \"po,\"\nthe crucible is indeed this.\n\nMetal nurtures water, fire nurtures metal,\nhun longs for po, po longs for hun—\nnaturally, the golden crucible governs spirit and brightness,\nproducing cinnabar whose nature aligns with essence—\nnot mere cinnabar or mercury.\n\nThe great medicine, the golden elixir—three times eight grades,\nmyriad images and hexagrams arrayed within the golden crucible.\nWater and fire applied with depth and precision,\nthe twenty-four qi mutually advance and align.\n\nSeen yet unseen, heard yet unheard,\nlong life and wondrous years refine the golden crucible.\nFired into priceless treasure—\nreversing yang, transmuting bones into purple dissolution and gold.\n\nPurple dissolution and gold commune with spirit and numen,\nthe golden crow enters yang—light advances.\nAzure rosy clouds dance, crimson rosy clouds move,\nazure and crimson together return to the golden crucible.\nRefined into the alchemical furnace—\nnine returns, seven reversions smelt the void.\n\nSeven reversions smelt into red jade powder,\nnine returns smelt into purple gold nectar.\nPurple gold nectar, red jade powder—\nhun harmonizes with po, po harmonizes with hun.\nOriginally possessing void, void transforms into spirit.\n\nSpirit transforms into qi, qi transforms into water,\nwater transforms into wood, wood transforms into fire,\nfire transforms into earth, earth transforms into metal,\nmetal transforms into water.\nDrill, cluster the five phases within the golden crucible—\nthe two luminaries ascend in radiant splendor.\n\nWater flies, fire flies—\nLi transforms into fire, Kan transforms into water.\nWater excites fire, fire excites water—\nLi chews Kan, Kan chews Li,\nmutually chewing, grinding like rainbow-shedding, rainbow-shedding qi,\ncondensing into saltpeter-like fragments.\nHorse-tooth spar’s teeth gleam with luminous purity.\n\nLight pursues the living into tiger’s amber,\non the purple gold terrace, frost and snow congeal.\nIts hue like jade, ethereally drifting—\nyang qi, light and pure, gently wafting.\n\nLight and pure yang sand gleams like the sun,\nglittering, vying in brilliance—sand outshines color.\nFlickering, resplendent—yellow chariot’s numen,\nthe chariot’s numen can transmute and quicken life.\nThe chariot’s numen originally emerges from Fusang,\nits essence found within lead, derived from sand.\nIts ascending light scatters like grain, stars fly in disarray.\nStars ground fine—azure dragon’s bones—\nthe most divine, most sagely flying substance.\nIf it does not fly, how can one know?\nTest by tossing a bit into the void—\nsurely it possesses the power to return to heaven.\n\nCinnabar soars high, ascending into the sky,\nvermilion seen rushing into the golden crow’s den.\nLight and pure yang nurtures the yang medicine—\nradiance shoots toward yang, light illuminates the medicine.\nMutually shining, mutually searing—merging their light,\nbreath by breath, purple radiance ascends to the Great Yang.\n\nGreat Yin and Great Yang—true water and fire.\nWater overcomes fire, fire extinguishes—greatly transforming into earth.\nHidden brightness, subdued fire—earth’s latent radiance,\nlatent radiance conceals void, void transforms into qi.\nVoid qi connects, linking above and below.\n\nLinking above and below—fire follows the hexagrams.\nHexagram fire waxes and wanes—when full, it prospers.\nIlluminating yang’s light, fire ignites brilliance—\ncountless thousands of miles.\nLight generates fire’s prosperity—\nyang’s essence pursues fire, fire summons yang.\nYang’s burning mirror sears the sun—\nilluminating yang without end or limit.\nFire triumphs, light surges—qi’s light circulates.\nLight penetrates the earth, earth connects with primordial qi.\nFire follows light, fire’s qi circulates—generating the ten thousand things.\nBefore one’s eyes, fire transforms, shining with yang’s light.\n\nYang’s burning mirror gathers yang’s light, stirring and resonating.\nStirred, it then connects—generating the indistinct.\nFlourishing, blazing flames—yang’s essence.\nLight pierces mist, giving birth to fire’s dazzling splendor.\n\nYang’s light follows into the golden abode,\nilluminating the Qian and Kun’s cinnabar world.\nGolden sand sprays fire, scattering yang’s light—\nthe great earth’s yang light generates the world.\n\nLight pursues spirit, spirit pursues light—\nthe great thousand-worlds of sand lie hidden within.\nWhen kalpas exhaust the Ganges’ sands of worlds,\none grain of sand, one kalpa—yang’s light is lost.\n\nYang’s light lost—what name remains?\nFrom Dragon Han to Yan Kang, to Crimson Brightness—\nthese speak of kalpas already sunken and drowned,\nkalpa’s power inescapable, unheard of.\n\nBlack winds drift, losing the Three Powers,\ntoppling peaks, collapsing mountains—all reduced to dust.\nEarth, water, fire, wind—all swept away,\nhouses and towers, all utterly submerged.\n\nAll creatures, all life lose sustenance,\nno distinction between south, north, east, or west.\nThe forest of myriad images—no trace remains,\nthe five phases, four images—where to seek?\n\nSound, resonance, form—inescapable.\nChaotic primordial light all darkens—\nprofoundly still, returning to profound profundity,\nunilluminated depths reaching the utmost extreme.\n\nAt the utmost extreme, it returns to the origin,\nreverting to the root, returning to the origin—before heaven and earth.\nBefore heaven and earth—\none qi can divide heaven and earth’s origin.\nPrimordial yellow’s upright qi—true unity’s ancestor,\nable to generate the myriad images as the elixir’s mother.\nBy the mother, omens are established—forming the elixir’s foundation.\nOmens summon the Azure Waist messenger to return.\n\nThe Azure Waist is summoned into the Hall of Lingering Light,\nrefined into window dust—light no longer appears.\nWindow dust is also called \"sun’s yellow haze.\"\n\nThe Great Yang transforms—\nwhen the Great Yang transforms, what occurs?\nWater and fire flow through the twelve hours,\nwithin the twelve hours, zi and wu exist in the center.\nMao and you divide the four nines—\nfour nines, fire drills thirty-six.\nZi and wu, mao and you divide north and south.",
      "overlap_context": ".\n\nThis is fire three-five,\nWater and fire intersect the four directions,\nMetal acts as fire—about to wane,\nOnce as water—about to generate fire then ending, fire then beginning,\nWaning then ending, generating then beginning,\nFixed floating and sinking—metal transforms into water,\nDividing the clepsydra—white transforms into black,\nBlack then ending, white then beginning,\nBlack and white come and go—following the moon!\n\nKnowing white, come to guard black—depart,\nThree hundred sixty-five degrees.",
      "start_char": 12220,
      "end_char": 13435,
      "start_sentence": 420,
      "end_sentence": 458,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.43965673446655,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\许颠君石函记.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "午属阳，阴火发，辰戌丑未分四八，四八火钻三十二，水火烹煎成既济。 子属阴阳火发，寅申巳亥分四八，四八火钻三十二，百刻时辰分昼夜。 昼为暑夜为寒，寒暑分明顺阴阳，阴阳两分如鸡子，生死常七在始终。 三日庚生震受西，谓魂生坤在束北，魄丧乙谓魂死，死生相接无休息，木三金四合成七，阴阳两分分两弦，合就金胎坤合乾，包裹乾坤须固密。 手搏日月为神室，坎殿光辉张丽华，神室圆明三五一。 三五庚震兑乾，坤包乙癸为阴乙，包藏弦望晦朔宫，黑白亏盈吉或凶。 吉当圆满凶却缺，神明变气失符节，金胎神室象太阴，不信但观天上月。 黄白在裹立精魂，魄白魂黄魂入魄，黄如白白回黄，精黑转回黄转黑，混其精魂炼魄黑。 散光生现黄白，黄白团圆光相接，生天太阳生地月，虎吸龙光透体明，白金胎内产黄金。 黄金白金分二八，万古传流不敢泄，说与凡流却不信，不信但教如华看。 向上元来有一着，认取生天生地药，生天生地亦生人，君且思量仔细寻。 寻得之时赴玉京，跨鸾骑鹤君上升 明堂正德论 夫明堂者，其名有三：夏曰世室，商曰重室，周号明堂，为天子布正德之宫，臣僚序尊卑之所。 明堂奉日门，立正阳。 上古及今尊真神所得号明堂者，黄帝於荆山，炼金液神丹，造玄一室，其室附火而生阳光，积阳为明，亦称明堂，又日苍精神舍。 应日月之象，作神明之所，其所方广，大明四通，灵神通灵。 神者水火风云也，水火归藏 ，火藏离所，水归坎乡。 风云龙虎，举西合东，毕勖尾箕，二十八宿。 乌坠庚辛，感化生育，气平西方，水火金木，相克相生，五行返覆。 逆则招祸，顺则致福，喜则或具太平，怒则或生兵革不祥，立见灾殃。 丘陵。 戈戟，杀气侵天，飞砂走石，慧星彷徨，惊飞太白，国有倾危，火难调燮。 致令金水周彰，龙虎烹轰。 如是则阴阳相胜，相生相杀之象也。 且兵革者，金火鼓动之象也。 喜动轰雷，雷轰震响，震响者是阳明火燥，火燥伤金，为姻散失，金液何求？ 炎火谩张，空设下，玄珠烧损火虫饥，魄弱魂飞，则灵丹远矣！ ．水不可大盛，盛则阴侵其肠，阴立则阳不满，阳不能胜其阴，厥阴鼓风，推伤损木。 损木者神，龙虎抱疾，疾中有丙，故日病。 病者日月不换丙，不换丙者，数差其偶也。 阳失其契，阴侵其明，此乃阴阳不交之象也。 若阴阳不定，则四象不立，八卦未分。 且丹砂从何而生哉？ 火体阴阳，得中水火，两者耗器凭胜负，在丹基之坚固。 故府仰免疏虞，体两弦，合金水变化，生虚无，托药化。 药化有还光，化药无中有，还有是还无，无则无固必，有是固谁质，有无两端的，听吾聊陈悉。 且无者水木金木之气，四方隐於虚无，且道藏乎其中矣！ ．此言无质成形，形生何所？ 不达无理，辄敢妄评。 天地之精灵，不可轻举，惜乎未得炼之可取炼之未得别也难图。 且有者土金玄黄之器，其器得火而施张得，则设生感召，始则若有若无，若有则霏霏微微，道隐希夷，希则感而氤氤，夷则动而氲氲。 希夷感动，氤氲橐钥，始之肇基，立兆已萌，太阴化生。 化者神运，神运气化，凝委而成形质。 形质苍苍，霞火流光，光华精结，精红透魄，红影来朝，结就玉霄绛霄霞结，号离红屑，离红飞扬，轻红翱翔，神物飞扬，五色翱翔，，翱翔五色，太阳光青。",
      "translated_text": "Wu belongs to yang—yin fire arises.\nChen, xu, chou, wei divide the four eights,\nfour eights, fire drills thirty-two,\nwater and fire simmer and boil to achieve completion.\n\nZi belongs to yin—yang fire arises.\nYin, shen, si, hai divide the four eights,\nfour eights, fire drills thirty-two,\na hundred marks of time divide day and night.\nDay is heat, night is cold,\ncold and heat clearly follow yin and yang.\nYin and yang divide like a chicken’s egg,\nlife and death ever cycle in seven at beginning and end.\n\nOn the third day, geng arises in Zhen, received by Dui in the west—\nthis is the soul born in Kun, dwelling in the northeast.\nThe po perishes in yi—this is the soul’s death.\nDeath and life connect without cease.\nWood three, metal four combine to make seven,\nyin and yang divide into two crescents.\nWhen metal womb and Kun unite with Qian,\nenvelop Qian and Kun—must be firmly sealed.\n\nHand-capture sun and moon to form the spirit chamber,\nKan’s palace radiates with Zhang Lihua’s brilliance.\nThe spirit chamber is round and bright—three, five, one.\nThree, five: geng, Zhen, Dui, Qian.\nKun envelops yi and gui as yin yi,\nhiding crescent, full, waning, and new moons’ palaces.\nBlack and white, waxing and waning—fortune or misfortune.\nFortune should be full, misfortune deficient.\nWhen spirit and qi transform, losing rhythm,\nthe metal womb and spirit chamber resemble the Great Yin.\nIf you doubt, just observe the moon above.\n\nYellow and white within establish essence and soul,\npo white, hun yellow—hun enters po.\nYellow becomes white, white returns to yellow,\nessence black turns back, yellow turns black,\nblend essence and hun to refine po’s blackness.\n\nScattered light reveals yellow and white,\nyellow and white coalesce, their lights connecting.\nHeaven’s Great Yang is born, earth’s moon is born.\nThe tiger inhales the dragon’s light—body becomes luminous.\nWithin the white metal womb, yellow gold is produced.\nYellow gold and white gold divide two and eight,\npassed down through ages—dare not leak.\nTell the common folk, yet they will not believe.\nIf they doubt, just let them observe like Hua.\n\nAbove, there is originally one move—\nrecognize the medicine that births heaven, earth, and man.\nHeaven-born, earth-born—also man-born.\nYou must ponder and seek carefully.\nWhen found, ascend to Jade Capital,\nriding phoenix and crane, you ascend.\n\n*On the Hall of Luminous Virtue*\nThe Hall of Luminous Virtue has three names:\nin Xia, it is called the Generational Chamber;\nin Shang, the Double Chamber;\nin Zhou, the Hall of Luminous Virtue.\nIt is the palace where the Son of Heaven enacts upright virtue,\nwhere ministers and officials arrange hierarchy.\n\nThe Hall of Luminous Virtue venerates the Gate of the Solar Door,\nestablishing the Upright Yang.\nFrom ancient times to now, those who honor true spirits\nare called the Hall of Luminous Virtue.\nThe Yellow Emperor, on Jing Mountain,\nrefined the golden liquid divine elixir,\nbuilt the Chamber of Primordial Unity.\nIts chamber, kindled by fire, generated yang light.\nAccumulated yang becomes luminous—\nalso called the Hall of Luminous Virtue,\nor the Azure Spirit Abode.\n\nResponding to the images of sun and moon,\nit becomes the dwelling of spirit and brightness.\nIts dimensions vast, great luminosity in four directions,\nspirits and gods communicate with the numinous.\nSpirits are water, fire, wind, and clouds.\nWater and fire return to storage—\nfire stores in the abode of Li,\nwater returns to the land of Kan.\nWind and clouds, dragon and tiger,\nwest rises to meet east,\ncompleting Xu and Wei, Tail and Winnowing Basket—\nthe twenty-eight constellations.\nThe crow falls in geng and xin,\nstimulating transformation and birth.\nQi levels in the west,\nwater, fire, metal, wood—\nmutually overcoming, mutually generating,\nthe five phases reverse and repeat.\nReversed, they invite misfortune;\naligned, they bring fortune.\nJoy may bring great peace,\nanger may spawn weapons and war, inauspicious omens,\ndisasters appearing instantly.\n\nMountains and hills,\nhalberds and spears—\nkilling qi invades the heavens,\nsand flies, stones roll,\ncomets wander,\nVenus startles the skies.\nThe state faces collapse and peril,\nfire’s harmony is disrupted.\nThus metal and water circulate in brilliance,\ndragon and tiger simmer and roar.\nSuch is the image of yin and yang overcoming,\nmutually generating and killing.\n\nMoreover, weapons and war\nare the image of metal and fire’s stirring.\nJoy stirs thunder’s roar,\nthunder roars with shaking resonance.\nShaking resonance is yang brightness’s fiery dryness—\nfire’s dryness harms metal,\nscattering marriage and loss.\nWhat seeks the metal liquid?\nBlazing fire spreads wildly,\nvainly setting below—\nthe dark pearl burns, fire worms hunger,\npo weakens, hun flies—\nthen the divine elixir is far indeed!\n\nWater must not be too abundant—\nabundance lets yin invade its viscera.\nYin stands, then yang is not full.\nYang cannot overcome yin—\nJueyin drums wind,\npushing to harm and damage wood.\nDamaged wood is spirit,\ndragon and tiger embrace illness.\nWithin illness lies bing—\nthus it is called disease.\nDisease means sun and moon do not exchange bing,\nnot exchanging bing means numbers diverge from their pairs.\nYang loses its contract,\nyin invades its brightness—\nthis is the image of yin and yang not uniting.\n\nIf yin and yang are unsettled,\nthen the four images do not stand,\nthe eight trigrams are not divided.\nMoreover, whence does cinnabar arise?\nFire’s body is yin and yang,\nattaining the mean of water and fire.\nThe two deplete the vessel, relying on victory or defeat,\non the elixir foundation’s firmness.\nThus, facing and turning avoid negligence,\nembodying the two crescents,\nuniting metal and water’s transformations,\ngiving birth to emptiness,\nentrusting the medicine’s transformation.\nThe medicine’s transformation has returning light—\nwithin no-thing, there is something.\nReturning something is returning nothing—\nnothing is nothing’s firm necessity,\nsomething is firmness’s essence.\nThe two ends of being and non-being—\nlisten as I briefly expound.\n\nMoreover, non-being is the qi of water, wood, metal, and earth,\nthe four directions concealed in emptiness.\nMoreover, the Dao is stored within it!\nThis speaks of formless form taking shape—\nwhere does shaped form arise?\nNot grasping the principle of non-being,\ndare not rashly evaluate.\nHeaven and earth’s essence and spirit\nmust not be lightly raised.\nAlas, not obtaining refinement—\ncan one take it? Not obtaining distinction—\nhow can one plan?\n\nMoreover, being is the vessel of earth, metal, and primordial yellow.\nIts vessel, receiving fire, expands—\nthen sets forth to summon responses.\nAt first, as if present, as if absent,\nif present, then misty and faint,\nthe Dao hidden in the subtle and obscure.\nSubtle, then stirred by misty vapors;\nobscure, then moved by swirling clouds.\nSubtle and obscure stir and move,\nmisty vapors and swirling clouds—bellows and pistons.\nAt the beginning, the foundation is laid,\nomens already sprout—\nthe Great Yin transforms and gives birth.\nTransformation is spirit’s movement,\nspirit’s movement is qi’s transformation.\nCongealing and accumulating form substance.\nSubstance, deep blue—\nrosy fire flows with light.\nLight’s essence condenses,\nessence’s redness penetrates the po.\nRed shadow arrives at dawn,\ncondensing into jade’s rosy clouds—\ncalled Li’s red flakes.\nLi’s red flies,\nlight red soars,\ndivine beings take flight,\nfive colors soaring—\nsoaring five colors,\nthe Great Yang’s azure light.",
      "overlap_context": "ns summon the Azure Waist messenger to return.\n\nThe Azure Waist is summoned into the Hall of Lingering Light,\nrefined into window dust—light no longer appears.\nWindow dust is also called \"sun’s yellow haze.\"\n\nThe Great Yang transforms—\nwhen the Great Yang transforms, what occurs?\nWater and fire flow through the twelve hours,\nwithin the twelve hours, zi and wu exist in the center.\nMao and you divide the four nines—\nfour nines, fire drills thirty-six.\nZi and wu, mao and you divide north and south.",
      "start_char": 13435,
      "end_char": 14690,
      "start_sentence": 459,
      "end_sentence": 503,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.53414869308472,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\许颠君石函记.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "黄白黑黄，黄居中央，君父太阳，太阳黄道，黄道转北，黑道回还，黄道回还，回黄应律，律吕相生。 冬至一阳，曰何太短？ 夜何太长？ 月四夜，九阴胜其阳，阳生未复，晷景滋生时计月时至日生冬至极冬至极九日之中进一刻，五九五刻进则终，四十五日立春功。 立春之后得九日，九日之中进一刻，五九五刻进则终，四十五日春分同。 春分之后得九日，九日之中进一刻，五九五刻进则终，四十五日立夏同。 立夏之后又九日，九十之中进一刻，五九五刻进则终，四十五日四节同。 立夏至日中六十刻，一刻昼景渐长，日南极，夏至后退得九日，九日之中退一刻，五九五刻退则终，四十五日立秋功。 立秋之后得九日，九日之中退一刻，五九五刻退则终，四十五日秋分同。 秋分之后得九日，九日之中退一刻，五九五刻退则终，四十五日立冬同。 立冬之后得九日，九日之中退一刻，五九五刻退则终，四十五日八节终。 八节三百六十日，昼夜三万六千刻，三万六千时计刻。 时讦刻，冬至日中四十刻，日景捡梭如电激，太阳疾速不停光，自然阳气索灭藏。 阳藏阴用无休息，阴生阳长六十刻，阳终气升阳光出。 九华明，九华光裹翠华青，翠华神所尊光明。 尊明神黄，神升明堂，神称帝皇，帝皇传赤，赤帝度色，青帝受德，白帝生光，黑帝玄黄。 五帝混合，混合神光，神光郁郁，神用无极。 神极受正，正其神色，神藏其室，神黄神黑，黄黑神精。 黄者金神，黑者北灵，黑者水基，内怀其精。 其精甚灵，其精甚坚。 太上日：其精甚真，其中有信，信无不应。 信应者，天符也。 天符照明，飞符恍灵，灵运潜应，应神紫灵。 紫灵神药，药有神灵，神药灵灵，化元之英。 神与气精，神升紫云，其气运转，甲丙庚壬。 庚壬乃金水相盈，甲丙是水火滋荣，二火成炎，二木成林，火木眷恋，姊妹弟兄。 坎离震兑，男女相亲，男冠少阳，女笄少阴，阴阳合度，七八之数。 七八数讫，九六相得，晦朔弦望，四者三十。 九六之数，老阳乾父，老阴坤母，因母致亲。 比夫人伦，父之制子，子之制孙，生生相续，亲之又亲。 铅汞相亲，无异人伦，阴阳交合，纯粹之精。 灵续其景，景续其灵，景灵宫裹，虎啸龙昤，五音互奏、六律阳明，阳明神光，照耀明堂。 明堂正德，君臣相得，施仁设义，讲武修文。 忠信礼智，五常和平，皇化天下，富国安民。 诸辰经历，神气满室，五气交并，神降奔突。 气如烟雾，交合神御，交合之道，顺其气序。 气序无差，昏明寒暑，昼暑夜寒，阳流阴注。 广寒宫结水昌砂，砂结玲珑若马牙，马牙本是金乌骨，赫赫日精归月窟。 月窟日照白明堂，明堂便是金水室。 金水互相生，金润生黄液，液生鼎沸，汞流神水，瀑涌三三，重迭累累，凝如坚冰。 龙蟠虎视，虎性龙情，随光逐明。 光中恍惚，明中杳冥，丹砂灵英，灵英之质，生於神明。 阴神阳明，积阳以阴，阴以神之，阳以明之，阴阳合度，化育之基。 化者谓日有三照，育者谓月有三移，日月合气，二气相推。 水一火二，合而成三，三生万物，三变至极。 三者汞也，汞变生灵，灵英独秀，异宝奇珍，五行神物，药就希夷。 人问术士，必不能窥，唯有志者，怀而待时，得真五行之妙用，假凡五行之水火，五行生克，其理自然。",
      "translated_text": "Yellow, white, black, and yellow—\nyellow resides at the center,\nthe sovereign father, the Great Yang.\nThe Great Yang’s yellow Dao,\nthe yellow Dao turns north,\nthe black Dao returns in cycle,\nthe yellow Dao returns in cycle,\nthe returning yellow aligns with the pitch-pipes,\npitch and pipe mutually engender.\n\nAt winter solstice, the one Yang—\nwhy is the day so short?\nWhy is the night so long?\nFor four nights,\nthe nine Yins overpower its Yang.\nThe Yang, though born, has not yet recovered;\nthe shadow’s length grows with the hour,\nthe time measured by the moon’s passage,\nthe day’s birth at winter solstice’s extreme.\nWithin nine days of winter solstice’s extreme,\nthe shadow advances by one *ke*;\nfive nines, five *ke* advanced, then complete—\nforty-five days mark the onset of spring.\n\nAfter the onset of spring, nine days pass,\nwithin those nine days, the shadow advances by one *ke*;\nfive nines, five *ke* advanced, then complete—\nforty-five days align with the spring equinox.\nAfter the spring equinox, nine days pass,\nwithin those nine days, the shadow advances by one *ke*;\nfive nines, five *ke* advanced, then complete—\nforty-five days mark the onset of summer.\n\nAfter the onset of summer, another nine days,\nwithin those ninety days, the shadow advances by one *ke*;\nfive nines, five *ke* advanced, then complete—\nforty-five days mark the four seasonal nodes alike.\nFrom the onset of summer to the day’s center, sixty *ke*—\neach *ke* sees the day’s shadow gradually lengthen.\nThe sun reaches its southern extreme;\nafter the summer solstice, nine days retreat,\nwithin those nine days, the shadow retreats by one *ke*;\nfive nines, five *ke* retreated, then complete—\nforty-five days mark the onset of autumn.\n\nAfter the onset of autumn, nine days pass,\nwithin those nine days, the shadow retreats by one *ke*;\nfive nines, five *ke* retreated, then complete—\nforty-five days align with the autumn equinox.\nAfter the autumn equinox, nine days pass,\nwithin those nine days, the shadow retreats by one *ke*;\nfive nines, five *ke* retreated, then complete—\nforty-five days mark the onset of winter.\nAfter the onset of winter, nine days pass,\nwithin those nine days, the shadow retreats by one *ke*;\nfive nines, five *ke* retreated, then complete—\nthe eight nodes conclude in forty-five days.\n\nThe eight nodes span three hundred sixty days,\nday and night total thirty-six thousand *ke*,\nthirty-six thousand *ke* of hourly reckoning.\nAt the hour’s reckoning, the *ke*—\nat winter solstice’s midday, forty *ke*,\nthe day’s shadow swift as lightning’s flash,\nthe Great Yang’s rapid speed, its light unceasing.\nNaturally, the Yang’s qi seeks concealment and storage.\nYang concealed, Yin employed without rest;\nYin born, Yang grown—sixty *ke*.\nYang’s end, qi ascends, Yang’s light emerges.\n\nNinefold radiance bright,\nninefold light enfolds jade-green radiance,\njade-green radiance—the divine’s revered luminosity.\nRevered luminous divine yellow,\nthe divine ascends the Hall of Light,\nthe divine is called emperor-king.\nThe emperor-king transmits the red,\nthe Red Emperor bestows color,\nthe Azure Emperor receives virtue,\nthe White Emperor engenders light,\nthe Black Emperor’s profound yellow.\nThe Five Emperors blend as one,\nblended divine light,\ndivine light lush and luxuriant,\ndivine power boundless.\n\nThe divine’s extremity receives rectitude,\nrectifies its divine color.\nThe divine conceals within its chamber,\ndivine yellow, divine black—\nyellow-black divine essence.\nYellow is the Metal Spirit,\nblack is the Northern Numen.\nBlack is water’s foundation,\ninwardly cherishing its essence.\nIts essence most numinous,\nits essence most steadfast.\n\nThe Supreme declares:\nIts essence most true,\nwithin it lies trust—\ntrust that responds without fail.\nThat which responds to trust\nis Heaven’s tally.\nHeaven’s tally shines bright,\nflying tally wondrously numinous.\nNuminous movement subtly responds,\nresponding to the divine’s purple numen.\nPurple numinous divine medicine,\nmedicine possessed of divine numinosity.\nDivine medicine, numinous and spirited,\nthe flower of the primordial origin.\n\nSpirit with qi and essence,\nspirit ascends purple clouds,\nits qi circulates and turns—\n*Jia*, *Bing*, *Geng*, *Ren*.\n*Geng* and *Ren* are Metal and Water in mutual fullness,\n*Jia* and *Bing* are Water and Fire in flourishing abundance.\nTwo Fires form flame,\ntwo Woods form forest.\nFire and Wood, bound in kinship,\nsisters and brothers.\n*Kan* and *Li*, *Zhen* and *Dui*—\nmale and female in mutual intimacy.\nThe male crowned with Lesser Yang,\nthe female coiffed with Lesser Yin.\nYin and Yang harmonize in measure,\nthe numbers seven and eight.\n\nSeven and eight’s numbers complete,\nnine and six mutually attain.\nNew moon, full moon, first quarter, last quarter—\nthese four span thirty days.\nThe numbers nine and six—\nold Yang, the *Qian* father,\nold Yin, the *Kun* mother,\nthrough the mother, kinship is achieved.\nComparable to human relations,\nthe father governs the son,\nthe son governs the grandson,\ngeneration upon generation,\nkinship ever deepening.\nLead and mercury in mutual intimacy,\nno different from human relations.\nYin and Yang in union,\nthe essence of purity.\n\nThe numinous continues its radiance,\nradiance continues the numinous.\nWithin the radiance-numinous palace,\nthe tiger’s roar, the dragon’s song,\nthe five tones harmonize,\nthe six pitch-pipes’ Yang brightness.\nYang-bright divine light\nillumines the Hall of Light.\nThe Hall of Light’s rectified virtue,\nruler and minister in harmony,\nenacting benevolence, establishing righteousness,\npracticing martial arts, cultivating letters.\nLoyalty, trust, ritual, wisdom—\nthe five constants in peace.\nThe imperial transformation spreads beneath heaven,\nenriching the state, pacifying the people.\n\nThe various celestial bodies traverse their courses,\ndivine qi fills the chamber.\nThe five qi intermingle,\nthe divine descends in a rushing torrent.\nQi like mist and haze,\nintertwining with the divine’s governance.\nThe Dao of intertwining\nfollows the sequence of qi.\nThe sequence of qi without error—\ndusk and dawn, cold and heat,\nday’s heat, night’s cold,\nYang’s flow, Yin’s infusion.\n\nThe Palace of Vast Cold congeals water’s flourishing cinnabar,\ncinnabar crystallizes, delicate as horse’s teeth.\nHorse’s teeth are originally the Golden Crow’s bones,\nthe sun’s resplendent essence returns to the moon’s grotto.\nThe moon’s grotto, sunlit, becomes the white Hall of Light—\nthe Hall of Light is the chamber of Metal and Water.\nMetal and Water mutually engender,\nMetal’s moisture engenders yellow liquid.\nLiquid boils in the crucible,\nmercury flows as divine water,\ncascading in threes,\nlayer upon layer,\ncongealing firm as solid ice.\n\nThe dragon coils, the tiger gazes,\nthe tiger’s nature, the dragon’s sentiment,\npursuing light, chasing brightness.\nWithin light, indistinct and vague;\nwithin brightness, deep and obscure.\nCinnabar’s numinous flower,\nthe flower’s essence—\nborn of divine luminosity.\nYin’s spirit, Yang’s brightness,\naccumulating Yang with Yin,\nYin with the spirit’s governance,\nYang with brightness’s governance.\nYin and Yang harmonize in measure—\nthe foundation of transformation and nurturance.\n\nTransformation refers to the sun’s triple illumination,\nnurturance refers to the moon’s triple movement.\nSun and moon unite their qi,\nthe two qi mutually propel.\nWater as one, Fire as two—\nunited, they form three.\nThree gives birth to the myriad things,\nthree’s transformations reach their extremity.\n\nThree is mercury,\nmercury’s transformation engenders the numinous.\nThe numinous flower stands alone,\na rare treasure, wondrous gem,\nthe five phases’ divine substance—\nthe medicine completed in the subtle and obscure.\nIf one questions the adept,\nthey surely cannot glimpse it.\nOnly those with resolve,\ncherishing it, await the hour.\nAttaining the true five phases’ wondrous use,\nborrowing the ordinary five phases’ Water and Fire.\nThe five phases’ mutual generation and conquest—\nsuch is the principle of nature.",
      "overlap_context": "—\nthe Great Yin transforms and gives birth.\nTransformation is spirit’s movement,\nspirit’s movement is qi’s transformation.\nCongealing and accumulating form substance.\nSubstance, deep blue—\nrosy fire flows with light.\nLight’s essence condenses,\nessence’s redness penetrates the po.\nRed shadow arrives at dawn,\ncondensing into jade’s rosy clouds—\ncalled Li’s red flakes.\nLi’s red flies,\nlight red soars,\ndivine beings take flight,\nfive colors soaring—\nsoaring five colors,\nthe Great Yang’s azure light.",
      "start_char": 14690,
      "end_char": 15924,
      "start_sentence": 504,
      "end_sentence": 550,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.30665445327759,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\许颠君石函记.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "圣人神而明之，以知天地之化，不过曲成万物，通乎昼夜之道。 昼视晷度，准则天符，夜听更漏，上督河图。 月纪低勖，星稀南北，虚张下应於鼎中，神龟随火而奔逐，黑虎浮束白虎穴，赤龙跳入青龙窟，二药还元复混融，丹砂合体入金公。 汞与铅合，砂与金亲，金作神室，明堂正德，恍朗玄官，乾坤合同。 坤生震龙，阳符复行，离魂入魄，运转天呈。 水激火发鼎釜俱呜，阴阳运转，震受庚辛。 金本克木，夫何以生？ 月行丁位，金入火乡，火盛消金，金代木荣，火灭为土，土能生金，金能生水，水能生木，相克相生，互为父母。 父母生子，子继父母，坤生震兑，兑生坤体，三五气足，三光合度。 兔魄生光，月满束方，月满复亏，阴台已前。 十六受统，阴符复行，艮直丙南，二十有三，三五候足，金入水乡。 坤符荡荡，水归北方，凝而成金，化而为水。 火随爻动，象逐人生，出没神炉，明藏偃月。 长养金胎，化生金液，凝如黄酥，碎如金粟。 金色透明，从黄返赤，照缙火生，而成还丹。 开炉倒鼎，进出霞光，金砂如粉，研细如霜，和匀搏栩，搏摄阴阳。 九成黍粒，谢天祭毕，万斛明珠，难换一粒。 一粒才服，身生羽翼，呼风召雷，万神侍侧。 更换四时，留连日月，冬变炎暑，夏飞霜雪，秋发春华，春飘黄叶。 所谓宇宙在乎手，万化生乎身者也。 长河化酥酪，点金过北斗，吾不敢虚说，识取无中有，无中生天地，我同天地久。 其道至禁，诀之在口，妄示凡，必遭殃咎。 慎密修持，神明护佑流，广施阴德，神仙必有。 许真君石函记卷下竟",
      "translated_text": "The sage, numinous and enlightened, comprehends the transformations of Heaven and Earth—nothing more than the bending to complete the myriad things, penetrating the Dao of day and night. By day, he observes the sundial’s degrees, aligning with the celestial tally; by night, he listens to the water clock’s chimes, overseeing the *River Chart*. The moon’s phases trace their course, stars sparse in north and south; the void’s expanse below responds within the crucible. The spirit-turtle chases the fire’s pursuit, the Black Tiger floats to the White Tiger’s den, the Red Dragon leaps into the Green Dragon’s cave. The two medicines return to their origin, merging once more; cinnabar unites with Metal Elder. Mercury joins with lead, cinnabar befriends gold. Gold becomes the spirit-chamber, the Hall of Light’s true virtue; radiant and vast, the Mysterious Palace, where Qian and Kun unite as one.\n\nKun gives birth to Zhen’s Dragon, the Yang tally resumes its course; the Li soul enters the Po, revolving with Heaven’s display. Water spurs fire, the crucible and cauldron both resound; yin and yang revolve, Zhen receives geng and xin. Metal inherently conquers Wood—how then does it engender? The moon moves to ding’s position, Metal enters the Fire’s realm. Fire’s exuberance melts Metal, Metal supplants Wood’s flourishing; Fire extinguished becomes Earth, Earth can generate Metal, Metal can generate Water, Water can generate Wood. Conquering and engendering, they become each other’s parents. Parents beget the child, the child succeeds the parents. Kun gives birth to Zhen and Dui, Dui gives birth to Kun’s body. When the three and five qi are full, the Three Luminaries align. The Hare’s spirit generates light, the moon waxes in the east; the moon waxes then wanes, before the Yin Terrace. Sixteen govern the tally, the Yin tally resumes its course. Gen points to bing in the south; on the twenty-third day, when the three and five periods are complete, Metal enters the Water’s realm. Kun’s tally flows vast, Water returns to the north, congealing into Metal, transforming into Water.\n\nFire follows the moving lines, images follow man’s life—emerging and vanishing in the spirit-furnace, hidden in the recumbent moon. Nurturing the Metal embryo, transforming to generate Metal liquid, congealing like yellow butter, crumbling like golden grains. The Metal’s hue becomes translucent, shifting from yellow to red; illuminating the silk-wrapped fire, it becomes the Reverted Elixir. Opening the furnace, overturning the crucible, radiant clouds pour forth. Golden cinnabar like powder, ground fine as frost, blended and kneaded, molding yin and yang. Ninefold refined millet grains—offerings to Heaven complete—a myriad bushels of luminous pearls cannot exchange for a single grain. One grain ingested, the body sprouts wings; summoning wind and calling thunder, the ten thousand spirits attend at one’s side. Altering the four seasons, lingering with sun and moon, winter transforms to scorching summer, summer flies with frost and snow; autumn blooms with spring’s blossoms, spring scatters yellow leaves.\n\nThis is what is meant by \"the cosmos in the palm of one’s hand, the ten thousand transformations born from one’s body.\" The Long River turns to curds, transmuting gold beyond the Northern Dipper. I dare not speak falsely—discern the existence within nothingness. From nothingness, Heaven and Earth are born; I endure as long as Heaven and Earth. This Dao is most forbidden; its secrets lie in the mouth. Revealed recklessly to the vulgar, calamity and blame will surely follow. Practice with utmost care and secrecy, and the divine spirits will protect and bless you. Cultivate abundant hidden virtue, and immortality will surely be yours.\n\n*Record in the Stone Casket of Perfected Xu, Volume the Lower—End.*",
      "overlap_context": "rcury,\nmercury’s transformation engenders the numinous.\nThe numinous flower stands alone,\na rare treasure, wondrous gem,\nthe five phases’ divine substance—\nthe medicine completed in the subtle and obscure.\nIf one questions the adept,\nthey surely cannot glimpse it.\nOnly those with resolve,\ncherishing it, await the hour.\nAttaining the true five phases’ wondrous use,\nborrowing the ordinary five phases’ Water and Fire.\nThe five phases’ mutual generation and conquest—\nsuch is the principle of nature.",
      "start_char": 15924,
      "end_char": 16524,
      "start_sentence": 551,
      "end_sentence": 574,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.259485483169556,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\许颠君石函记.txt",
        "category": "众术类"
      }
    }
  ]
}