{
  "source_id": "诸师圣诞冲举酌献仪",
  "source_file": "chunked_daozang\\诸师圣诞冲举酌献仪.json",
  "total_chunks": 12,
  "total_original_chars": 4530,
  "total_translated_chars": 31059,
  "total_translation_time": 182.9986231327057,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\诸师圣诞冲举酌献仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**Ritual for Offering Libations on the Ascension Days of the Venerable Masters**\n*Scripture Title:* *Ritual for Offering Libations on the Ascension Days of the Venerable Masters*. One fascicle.\n*Source Text:* *Daoist Canon of the Zhengtong Era*, *Dongxuan Section*, *Category of Dignified Rituals*.\n\n---\n\n**Ritual for Offering Libations on the Ascension Day of the Venerable Masters**\n**Offering Libations on the Jade Emperor’s Sacred Birthday (First Lunar Month, Ninth Day)**\n\nRainbow hues diffuse auspicious radiance, as we gaze upon the incense altar beneath the Azure Heavens;\nCranes stand in reverent devotion, presenting fragrant vessels upon the blessed realm.\nWith solemnity, we kindle the true incense of Dao and virtue, and in utmost sincerity, we present our offerings to:\nThe Most High, Opener of Heaven, Holder of the Talisman, Ruler of the Calendar, Embracer of Truth, and Embodiment of the Dao—\nThe August Jade Emperor of the Vast Heavens, the Supreme Lord of the Lofty Firmament;\nThe Sacred Father, Celestial King of Resplendent and Wondrous Joy;\nThe August Mother, Empress of Precious Moonlight;\nThe Sacred Assembly of the Golden Towers of Mount Mi;\nThe Lofty Perfected of the Jade Capital—all relying upon the true incense, universally conjoined in offering.\n\nAgain, we kindle the true incense and present our offerings to:\nThe Three Pristine Ones of the Formless and Spontaneous, the Three Realms of Heavenly Worthies;\nThe Great Emperor of the Northern Culmen, the Purple Tenuity;\nThe Heavenly August Emperor of the Southern Culmen;\nThe Earthly Sovereign, Queen of the Sustaining Earth, Who Responds to Heaven’s Patterns;\nThe Myriad Spirits of the Three Realms and the True Lords of the Ten Directions.\nOn this day of homage, we reverently beseech all true numina, humbly invoking their vast compassion to deign to gaze upon us with penetrating insight.\n\n**Proclamation of Intent**\nWe humbly submit: the Great Dao is formless, yet wondrously initiates and nourishes the myriad things...\n\nThe Perfectly Real, though without form, governs the manifold beings and guides the cosmic pattern. Its wondrous workings are beyond fathoming, its numinous mechanism unfathomable. With unadorned reverence, we exhaustively offer our celebration and homage to the sacred.\n\nWe reverently recall the August Jade Emperor, the Great Heavenly Worthy, the Mysterious Culmen, the Lofty Lord of Heaven—co-equal in radiance with Heaven and Earth, conjoined in virtue with Sun and Moon. In the True Realm of Floating Black, the records preserve the inception of the Dao’s transmission; in the Supreme Palace of Purple Tenuity, the decree of salvation for humankind is revealed. From celestial scriptures, the Treasure Book emerges; from rosy clouds, the Golden Seal is unfurled. This is the celestial chapter of the Great Brahma, the hidden rhyme of all heavens. Resplendent is the teaching beyond words, transcending the mechanism of the formless. Eight rays cast their brilliance—who can fathom the vast kalpas? The Two Modes respond to the turning of the Dao—none can plumb its true source. We trust in the gracious oversight of your compassion, that it may but slightly fulfill our yearning for refuge.\n\nThe assemblies of all heavens and the Three Realms are not distant. Jade trees and immortal blossoms—within a hand’s span of the Jade Void; jasper chariots and azure carriages—resounding with harmonious jade music. With utmost reverence, we perform the first offering.\n\nMoreover, the Terrace of Fragrant Mist manifests the Brahma-form of conditioned existence; the Great Brahma of the Vast Ocean possesses the divine power of the boundless. This is the spiritual pivot of the Mysterious Ancestor, the essential decree of the Lofty Sovereign. It is the lamp of wisdom in the dark crossroads, the boat and oar across the vast sea—above, securing the nation and pacifying the people; below, rescuing the imperiled and delivering the distressed. It uplifts all sentient beings, transcending distinctions of wisdom and folly, high and low; it disseminates the true and mysterious, shattering the barriers of non-being, form, emptiness, and obstruction.\n\nWe, of humble and meager virtue, are none but those molded by your grace. We reflect that we, who feast our ears upon the Dharma-sound, universally bathe in your sacred blessings. Hearing the exposition, we marvel at its rarity and deepen our awakening, moved by your vast compassion. As we encounter this auspicious occasion of your descent into the world, we reverently perform the morning audience at the break of day. Like the boundless bright mirror, what need is there for offerings in venerating the honored? Like the great bell’s mighty resonance, though silent, it responds when struck. We dare not presume upon repeated entreaties, yet humbly pray for your gracious acceptance. Bowing twice, we offer incense and perform the second presentation.\n\nMoreover, the True Realm of Wondrous Existence universally manifests the body of the King of Sublime Joy; the Supreme Palace of Miroku is the very throne of the Root Emperor. It embodies the essence of the primordial qi’s gestation and fully realizes the vast truth of the Three Luminaries. Its wondrous virtue is beyond thought, its divine power beyond discourse. Concealed above the Jade Capital, towering high in the Golden Portal. Five thousand secret words fuse the great Dao of the Three Powers; eight thousand and more salvations reach the multitudes of the Six Realms. Spontaneously so, not to be known by knowledge; settled yet responsive, free in coming and going. Unconstrained by union or separation, its transformations are all-pervading and unfathomable. It expounds the decree of purity and liberation, delivering those sunk in delusion, sorrow, and suffering. It roams through the Three Realms, universally manifesting above the Ten Directions.\n\nWe humbly pray that you not disdain our childish importunity, but rather incline your imperial heart. Witness our devotion in fasting, ablutions, and vigil; open the covering of your nurturing embrace. May your majestic presence shine forth, bringing joy beyond words. Overwhelmed with reverence, we conclude with the third offering.\n\n**Proclamation of Petition**\n**Dedication**\n\nWe humbly pray that Heaven’s hearing be ever clear, the imperial heart ever discerning. Enduring yet not domineering, it takes Heaven and Earth as its foundation; gazed upon, it grows ever loftier, transcending form and name to stand alone. Its grace sustains all beings, its blessings extend to state and homeland.\n\nOn the fifteenth day of the first lunar month, the birth anniversary of the Celestial Master: in the heavens, the fragrant rose marks the millennial dawn of a perfected immortal; on earth, the plantain and lychee express the timely reverence of a sacred celebration. With reverence, we kindle true incense, offering it to the Ancestral Master, the Three Heavens’ Upholder of the Teaching, the Great Dharma Celestial Master Who Assists the Primordial and Embodies the Dao; the Perfected Lord of True Response, Who Subtly Transforms and Quietly Manifests; the Most High and Vast Emperor of the Six Harmonies, the Heavenly Worthy Who Subdues Demons and Protects the Dao; the Sacred Ancestor, Marquis Wen Cheng of the Han, Preceptor of the Realm; the Sacred Father of the Orthodox Unity, Perfected Lord of Tong-□; the Sacred Mother, Primordial Lady; the Lineal Master, Perfected Lord of the Wondrous Dao Who Expounds the Teaching of the Great Clarity; the Affiliated Master, Perfected Lord of Illuminating Transformation and Vast Virtue of the Great Clarity; the Orthodox Unity’s Female Master, Primordial Lady; the Two Perfected Lords Wang and Zhao, Attendants to the Imperial Presence; the Immortal Maidens Wen Ji, Wen Guang, Yu Lan, and Fang Zhi; the Commandant of the Imperial Chariot, Marquis of Lou Ting; the Governor of Yi Yang, Marquis of Lang Zhong; the Governor of Nan Jun, the Palace Attendant and Imperial Censor; the Perfected Lords, Primordial Ladies, Immortal Maidens, Ancestral Immortals, Flying Ascendants, and Immortal Kin of all generations of Orthodox Unity Celestial Masters; the High Perfected of this temple’s incense fire; the Perfected Lords, Divine Officials, and Generals of the Thunder Rites; the local deities of Jiangdong; all the assembled deities of the Three Realms; and every true numen.\n\nAll together, we offer true incense in universal veneration. The proclamation of intent is declared.\n\nBowing in reverence, we recall how the crane’s cry at Mount Heming first inaugurated the unfolding of boundless numinous transformation, while the fish-scale ranks of the sacred writs were honored with the radiant favor of the Most High. From the Han dynasty onward, the lineage gained renown, succeeding the Marquis of Liu in perpetuating its glory. Mountains and forests gaze in awe, seas and lands turn in devotion.\n\nWe now reverently recall the Ancestral Master, the Perfected Lord of Orthodox Unity, the very fount of Orthodox Unity and sovereign of the Mysterious Origin. He saved the world on Heaven’s behalf, transmitting the precious registers to posterity; he cultivated perfection upon the earth, nurturing the golden elixir to fulfill the great Dao. The inheritance of seal and sword stretches far into antiquity, while his meritorious deeds and virtuous conduct shine with vast splendor. Green carriages and cinnabar chariots drew the descent of the Perfected Ones from the Golden Towers; dragon scripts and phoenix seals delved into the treasuries of the Purple Yang’s inner canon. Honored by the sagely court with exalted bestowals, his transformative embrace extended wide as a sheltering canopy. His divine influence spread afar, purple mists enveloped the heavens. Dragons frolicked and unicorns danced, their graceful descent observed in awe; phoenixes sang and simurghs called, their harmonious ranks arrayed in solemn feast.\n\nWith utmost reverence, we now present the first offering.\n\nWhereas the heavens manifest as stars and constellations, the earth as rivers and mountains—marking the rise and fall of a hundred generations—so too do robes and crowns, the very source of waters, become the legacy upon which posterity gazes in reverence. The Three Heavens rejoice as one, the Four Seas surge with jubilation, for we perceive that the treasury of the supreme Dao stores the essence of all, and that this essence is indeed the primordial nurturing of the finest spirits. Its fragrant roots run deep, its luxuriant branches and leaves radiate glory; it nourishes the mountains and forests as clothing and covering clothe and cover the grasses and trees.\n\nWe, your humble disciples, dwell beneath the shelter of your teaching, abiding in the jade courts. Ever do we hold fast to emulation and devotion, never wavering in our observance. We beseech you to regard our earnest reverence, to bestow the grace of your acceptance, that we may partake of your resplendent brilliance and penetrate the wondrous meaning. May the celestial countenance be pleased, spring suffusing the fungus face with heightened radiance; may auspicious clouds and luminous qi draw near the imperial terrace, suffusing it with felicity. We meet amidst wind and cloud in the heavens above, we behold the sun and moon among humankind below.\n\nWith redoubled sincerity, we present the second offering.\n\nWhere six giant turtles bear the mountain and twin phoenixes support the imperial carriage, the hour of your blessed birth is most felicitous; where the Five Elders open the way and a host of immortals flank the axle, we now render our praise. Your achievements are profound, your sheltering grace ever-present. Lofty as the Hall of Supreme Harmony, you uphold the transformation of this pure lineage, ever-present, advancing with the times. The scales of fish and dragons stand erect, rejoicing together in the sight of the celestial and human realms; these whiskers and beard gaze straight ahead, as if once more beholding the light of sun and moon. Amid the fragrance of orchids and angelica, our thoughts renew the sincerity of sunflowers and mallows. Though thrice-kindled incense may fade, our reverence redoubles with a hundred bows.\n\nWith utmost reverence, we present this memorial to express our words, purify the libation cup, and offer our praises. The grace we receive is boundless, its particulars beyond enumeration. We pray that you deign to regard our humble offering of water-plantains, that your overflowing favor may nourish generations to come. May the luminous presence above forever illumine the true wind; may your majestic spirit ever abide in the radiance of the transforming sun. May your virtuous splendor know no end, and the immortal Dao flourish ever more.\n\nWith deepest reverence, we conclude with the third offering.\nThe memorial is proclaimed and the merit dedicated.\n\nMay we humbly pray that, grasping the pivot of the Dao, you move in harmony with Heaven’s revolutions. As the teachings receive their nurturing moisture, the fish-scale robes bask in the grace of rain and dew; where the imperial presence sheds its radiance, the duck-feather sandals tread above the stars. May the jade courts remain serene and solemn, the Daoist assembly secure and harmonious.\n\nOn the fifteenth day of the second month, the birth of the Dao’s Ancestor is celebrated with this memorial. Though the Great Dao bears no name, we mark the dawn of its descent; though the Most Divine shines in majesty, how can our reverent praises suffice? With utmost devotion, we kindle the true incense of virtue and power, and in all sincerity present our offerings to the Most High Lord of Dao and Virtue of the Grand Pure Immortal Realm, the August Emperor of Primordial Virtue.\n\nWe reverently beseech the compassion of the Dao, that it may turn and illumine our humble offering. Once more we kindle the true incense and present our devotions, offering to the Jade Pure Originator of Heaven, the Supreme Pure Numinous Treasure Heavenly Worthy, the Golden Watchtower Lords of the Heavens, the Lofty Perfected of the Great Mystery’s Wondrous Existence, the Dharma Lord Mysterious Heavenly Emperor, the Patriarch Orthodox Unity Perfected Lord, the Thousand Perfected and Ten Thousand Sages of the Three Realms and Ten Directions, the Officials and Generals of the Thunder Rites, the Earth God of Jiangdong, and all the divine beings who gather in homage on this day. May the true incense be universally offered to all.\n\nThe memorial is proclaimed.\n\n---\n\nWe humbly acknowledge that birth has no beginning and follows no end, its profound communion lying in dark stillness; it may bear the name \"constant\" yet is not the constant Dao, for it is pure and self-so. Receiving the wondrous qi from the Jade Void, it manifests its pure countenance within the numinous chamber.\n\nWith reverence, we recall the Primordial August Emperor, the Most High Lord Lao, who presides over the teachings of the Mysterious Origin, dwelling in the Great Crimson Heaven. He establishes the peoples and creatures, moving the cosmos of Heaven and Earth; he governs yin and yang, directing the sun and moon. He shapes and nurtures all kinds, delivering and saving both the manifest and the hidden. Now, in the midst of the green-yang season’s order, on this festival of the Purple Palace’s true origin, the Nine Heavens rejoice in harmony, and the Three Realms open in auspiciousness. Auspicious radiance flows from the Mysterious Pivot, and numinous light shines upon the realm of longevity. Thus, we extend our felicitous devotion and respectfully present our celebratory rites.\n\nThe white deer draws his chariot, as if descending to grace the Han court; the azure ox bears his carriage, still condescending to the Zhou dynasty. With earnest sincerity, we perform the first offering.\n\nWe humbly observe that nine dragons embrace the auspiciousness, marking the flourishing dawn of the sagely era; eight luan-birds sing in unison, presenting and welcoming the Perfected One on this bright morning. The great transformation is proclaimed, and the numinous sounds are unfolded. Solemn as the sun and deep as the moon’s horns, we look up to the Way of treading the stars and walking the heavens. He upholds the warp of the myriad transformations, governing and ordering the Three Powers.\n\nWe, your servants, who guard the jade halls and follow the ritual codes, face the pure radiance in reverent attendance, gazing upon the purple qi ever ascending. We, the feathered ones of Peng Isle, purify the forest-dwelling offerings; we diligently cultivate the Mysterious Canon, hoping for your gracious regard. Rooted in origin, we endure as long as Heaven and Earth; neither void nor form, we transcend images and numbers in solitary eminence. With renewed sincerity, we perform the second offering.\n\nWe humbly note that golden tablets and jade scriptures expound the divine Perfected Ones of the Three Caverns; the Father’s words and sagely teachings bequeath virtue and power across a thousand ages. He spreads the wind of purity and clarity, abundantly inaugurating the transformation of the subtle and tranquil. Unfolding the threads of cloud-caps and rosy skirts, he reveals the mysteries of red writings and jade characters. His teachings cover the Central Lands, his grace extends to the lower realms. The Pass Keeper gazes afar to observe the qi, while heaven and humanity await the transmission of scriptures. It cannot be grasped, it cannot be heard—though the great Dao alone transcends speech and silence; that which abides is spirit, that which passes is transformation—only the most abundant virtue can be described.\n\nHow then shall we praise and extol? Only through diligent purification and ablution. We humbly pray that the transmission of the precelestial Dao may guide the lost through endless kalpas, ever serving as the bridge for the lower realms and transforming all peoples within the four quarters. Thus, even the inquiries of Kongtong shall find no fault, and the blemishes of Guye shall vanish. May the lineage of the Dao store up auspiciousness, and may the jade halls share in this felicity.\n\nWith utmost reverence, we conclude the third offering.\n\n[Recite the] scripture. Proclaim the memorial.\n\nIn dedication—\nThis month being mid-spring, the wind and light have reached the season of blossoms;\nLongevity equal to heaven, virtue and power now descend upon the immortal’s birthday.\nAll heavens rejoice as one, the three realms share in joy.\n\nWe humbly pray that the jade throne remain exalted, the cinnabar gates open and clear.\nMay the nation achieve unity, following the eternal scripture of virtue and power;\nMay heaven and earth, first and last, transcend form and name to stand alone.\nEach in harmony and purity, together attaining great peace.\n\nWe humbly pray that the Dao be revered and virtue honored, that forests and springs forever delight in prosperity;\nThat days grow richer and months more flourishing, and nurturing rains and dew equally moisten all under cultivation.\n\nOn the third day of the third month, the birth of the exalted perfected—\nThe third day of the third month, precisely the time when Orchid Pavilion gathered for purification rites;\nWith one virtue and one heart, we celebrate the sage of the Golden Portal’s incarnate transformation.\n\nReverently kindling true incense, with utmost sincerity we make offerings to:\nThe Lord of Myriad Dharmas, Jade Void Master and Minister, Mysterious Heavenly Thearch;\nThe Golden Portal’s incarnate transformation, the Demon-Quelling Heavenly Worthy;\nHis holy father, Heavenly Lord of Pure Joy, Radiant Perfected Great Emperor;\nHis holy mother, Queen of Excellent Victory, Jade Perfected Supreme Immortal;\nHis holy preceptor, August Emperor of Abundant Heaven;\nAncestral Heavenly Master, Grand Minister of Supreme Mystery, Perfected Lord of Orthodox Unity;\nThe Star Lords of the *Xu* and *Wei* constellations;\nThe Manifested Star Lord of Military Merit;\nThe Divine Lord of Culture and Destiny, Master of Zi and Tong;\nThe Five Perfected Lords of Attained Dao on Mount Wudang;\nThe Heavenly Rectifier of the Northern Culmen’s Protective Sagely Mansion;\nThe Officials, Lords, Generals, and Clerks of the Yuanhe Migration and Correction Bureau;\nThe Exalted Perfected of the Temple’s Fragrant Hearth;\nThe Perfected Officials and Generals of the Thunder Rites Department;\nThe local deities of Jiangdong;\nAll the true numina of the three realms who gather in homage on this day;\nAnd the Perfected Controllers of the Mysterious Void’s passing oversight.\n\nMay all be upheld by true incense and universally receive these offerings.\n\nProclaim the intent.\n\nWe humbly recall how the sun’s auspicious dream presaged glory, celebrating the Mysterious Heaven’s responsive transformation; parting the clouds, we gaze toward its advent, prostrating upon the generous earth to present our sentiments. All heavens descend in unison, myriad spirits chant in homage.\n\nWith reverence we invoke the Teaching Master, the Mysterious Heavenly Thearch, who embodies Heaven’s Dao and wields the Emperor’s mandate. Born of Pure Joy’s numinous conception, his qi converges amid the Five Peaks and the Three Luminaries; aligned with the *Xu* and *Wei* constellations, he harmonizes the primordial harmony of the Nine Empyreans and Eight Radiant Scenes. Rightly enthroned in the lofty Northern Culmen, he ever more brilliantly augments the flourishing of Eastern Wu. Repeatedly bathed in the resplendent robes of the sagely court, he graciously inclines toward the mortal world’s devotion. Pouring fine nectar like flowing rosy clouds, we offer libations upon the wind; modestly preparing mountain herbs and river weeds, we beseech the August Sage’s radiant presence. With sincere heart we perform the first offering.\n\nWe bow in awe of the Jade Void’s Preceptor and Minister, gazing toward the Northern Culmen’s majesty; the Golden Portal’s True Honored One, entrusted to posterity’s veneration. His numinous radiance shines resplendently, his sagely virtue towers sublimely—all wishes are fulfilled, no hidden realm remains unillumined. His potent *kuigang* energy directs its force, sweeping away demonic forces from the Six Caverns; separating humans and ghosts, he manifests meritorious deeds within seven days. Both manifest and hidden realms attain peace, observed through ages past and present.\n\nWe, your humble servants, have been shaped by your nurturing grace, our gratitude and praise run deep. In action and retreat, in acceptance and rejection, we rely solely upon your sagely teachings; in sheltering protection and steadfast support, we differ not from those touched by your numinous blessings. Now, on this propitious day, we once more invoke the Mysterious Wind. Presuming to present these modest offerings, we seek to repay your boundless favor. Though our words may seem childishly irreverent, we pray you deign to witness our sincerity. Jade pendants and jeweled robes descend from the vast cloud-filled skies; golden coins and treasure horses but faintly express our worldly reverence. Renewing our devotion, we perform the second offering.\n\nWe acknowledge that to neglect ritual would be remiss, how dare we forget our private joy in celebration? Moved by our sincerity, you respond in communion, and we look up to your virtue of cherishing life. O Spirit, your presence is as if here; O August One, your numinous power is ever proclaimed. With earnest longing we gaze upon you, solemnly presenting our offerings.\n\nWe humbly pray you descend to this earthly realm and graciously regard our modest devotion. With humble herbs and earnest sincerity, we perform the threefold courteous rites; how fortunate are the mountains and forests to behold your radiance, now but a foot’s distance away. Offering our utmost sincerity, we conclude with the third libation.\n\n[Recite the] scripture. Proclaim the memorial.\n\nWe now turn our intentions outward:\nAs spring’s warmth melts the air, peach and plum blossoms open across the imperial gardens;\nAs the Heavenly Countenance shines in solemn grace, we reverently prepare the southern-stream’s pondweed and white southernwood.\nTen thousandfold joy and glory, one sincere celebration of felicity.\n\nWe humbly pray that the Lofty Perfected may peer into our depths, that the Lineage of Sages may bestow their compassion.\nMay our single thought of utmost sincerity be met with the Nine Categories of the Great Model.\nMay cap and robe flourish in splendor, may jade halls stand secure in peace.\n\nOn the ninth day of the ninth month, the Lofty Perfected and Ancestral Master ascend in offering of this text:\nRiding the clouds to pay homage to the Emperor, they return on this double-ninth day;\nPouring water to honor the Perfected, they look up to the Three Heavens now intimately near.\n\nWith reverence we kindle true incense, devoutly offering to:\nThe Ancestral Celestial Master,\nThe Three Heavens’ Upholding Teaching and Assisting Primordial Dao Great Dharma Celestial Master,\nThe Orthodox Unity and Primordial Mystery Spiritually Transformed and Serenely Responsive Manifest Protector Perfected Lord,\nThe Boundless Six Directions Lofty and Illustrious Great Emperor,\nThe Demon-Quelling and Dao-Protecting Heavenly Worthy and remaining sagely hosts—\nall as before.\n\nAgain we kindle true incense, offering to:\nThe Jade Clarity Master and Minister, Mysterious Heavenly Thearch and Lord of Myriad Dharmas;\nThe Golden Palace’s Manifested Body, Demon-Quelling Heavenly Worthy;\nThe Sacred Father, Pure Joy Heavenly Lord and Illustrious Perfected Great Emperor;\nThe Sacred Mother, Excellent Victory Heavenly Consort and Jade Perfected Supreme Immortal;\nThe realized divine officials and sacred assembly of Mount Wudang;\nThe high perfected of the incense hall;\nThe thunder and lightning dharma departments’ officials and divine marshals;\nThe local earth gods of the Jiangdong region;\nAnd all the perfected and numinous beings of this day’s court and praise—\nall rely upon this true incense in universal and equal offering.\n\nWe now proclaim our intent:\nAs autumn winds stir the jade pendants, we recall the Double Yang’s ascension;\n\nAs golden stalks glisten with dawn’s dew, we offer libations in accord with this auspicious festival.\nThe myriad heavens descend in attendance, and the ten thousand spirits join in harmonious praise.\n\nWith reverence we recall the Ancestral Celestial Master, the Orthodox Unity Perfected Lord,\nwho grasps the pivot of Heaven and moves in concert with its revolutions.\nAt Jade Peak’s sacred precinct, he received the Nine Cauldrons’ scriptures;\nwith crimson tally and rainbow banner, his radiance illumined the edicts of the Three Heavens.\nFrom the Han dynasty’s dragon-rising era to the time when cranes departed Shu’s capital,\nhis teachings flourished, their splendor resplendent even now.\n\nWe now honor the Dharma Lord, the Mysterious Heavenly Thearch,\nwho embodies Heaven’s Dao and wields the Emperor’s talisman.\nBorn of Pure Joy’s wondrous conception, his qi condensed between the Five Peaks and the Three Luminaries;\naligned with the astral mansions of Kui and Lou, he harmonized the primordial harmony of the Nine Empyreans and Eight Sceneries.\nRightly enthroned at the Northern Culmen’s height, he lends greater luster to Eastern Wu’s prosperity.\nBoth bathe in the sacred dynasty’s resplendent robes, and in human realms, sunflowers turn toward their brilliance.\nWe humbly gather dogwood sprigs, offering them downwind in libation;\nwe duly prepare water-plants and pondweed, praying for the august presence of the Most High.\nWith sincere devotion, we present the first offering.\n\nBehold the purple lingzhi’s brows—how they evoke the Master’s lofty majesty;\nthe Dark Warrior’s banners and standards, entrusted to posterity’s gaze.\nDivine radiance shines resplendent, Heaven’s vision clear and bright,\never advancing with the times, leaving no hidden realm unobserved.\nAt Deer Hall and Salt Well, his meritorious deeds are inscribed on towering steles;\nat Needle Stream and Areca Plum, the earth below cherishes his boundless grace.\nOur endless veneration dares not lag behind in this morning’s rites.\n\nWe reflect humbly upon our own undeserved cultivation,\nour deepest joy and praise rooted in this sacred influence.\nWhether in action or retreat, we rely solely on the sagely teachings;\nin sheltering protection and guiding support, we seek only the blessings of numinous favor.\nOn this propitious day, we once more invoke the Mysterious Wind,\npresenting these modest offerings in gratitude for the vast and boundless gifts.\nMay our childish simplicity not offend, and may our sincerity be witnessed.\nJade pendants and kingfisher robes descend through the vast expanse of cloud and sky;\ncold springs and autumn chrysanthemums but faintly reflect our reverent devotion.\nWith renewed devotion, we present the second offering.\n\nWith phoenix-scripted decrees, he bears the Three Heavens’ gracious mandate;\nwith feathered canopies and rainbow banners, he attends the Ninefold Festival of Ascending Perfection.\nThe gods, vast and majestic, abide above; the imperial presence, keen and luminous, manifests its power.\nRiding white clouds to the Emperor’s realm, his work complete, he departs for the separate palace;\nreceiving the plain-text scriptures and true instructions, his might subdues all demonic forces.\nFor thousands of years, the Orthodox Unity’s transmission has endured,\nexpanding the glory of the Twenty-Eight Treatments’ ancestral teachings.\nThe merit of transforming nests rivals the awe-inspiring might of Heaven’s guardians.\nNo empty praise suffices—we solemnly present our offerings in reverence.\n\nWe humbly pray for your descent to this earthly realm, graciously witnessing our sincerity.\nDogwood and chrysanthemum diffuse their fragrance, thrice offering our earnest rites;\nthe mountains and forests are blessed, beholding your radiance at a mere hand’s span.\nWith all our devotion, we conclude the threefold offering.\n\nProclamation of the Petition\nDedication of Merit\n\nSwans and cranes drift through the void, descending their majestic presence to within a hand’s span;\ncrowns and robes array in order, offering reverence and respect thrice over.\nThe eight directions stand clear in autumn’s purity, as all heavens gather in clouds.\nWe humbly pray you deign to accept our earnest sincerity, manifesting the great teachings,\ntransmitting the scriptures at the Jade Bureau, ever illuminating the ancestral Dao and virtue;\npresiding over the law in the Dark Heavens, abundantly extending boundless blessings.\nMay the jade courts remain serene and solemn, the Daoist assembly harmonious and at peace.\nMay the divine spirits grant their protection, expanding the radiance of Dao and virtue;\nmay the rites and appearances be revered and solemn, ushering in an era of harmony and prosperity.\nMay crowns and robes flourish in splendor, jade temples thrive in tranquility.\nThe ritual of offering to the birth and ascension of all masters is now concluded.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "诸师圣诞冲举酌献仪 经名：诸师圣诞冲举酌献仪。 一卷。 底本出处：《正统道藏》洞玄部威仪类。 诸师圣诞冲举酌献仪 玉帝圣诞酌献仪正月初九日 虹流蔼瑞，瞻香案於昊天； 鹄立驰诚，荐芳罇於福地。 恭炷道德真香，虔诚奏启供养，太上开天执符御历含真体道昊天玉皇大天尊、玄穹高上帝，光严妙乐国王圣父天尊、宝月光皇太后圣母元君、金阙弥罗圣众、玉京侍卫高真，悉仗真香，普同供养。 再炷真香，奏启供养虚无自然三清三境天尊、北极紫微大帝、南极天皇上帝、承天效法后土皇地祇、三界万灵十方真宰，是日朝贺一切真灵，恭望洪慈，俯垂洞鉴。 宣意 伏以大道无形，妙万物而资始；",
      "translated_text": "**Ritual for Offering Libations on the Ascension Days of the Venerable Masters**\n*Scripture Title:* *Ritual for Offering Libations on the Ascension Days of the Venerable Masters*. One fascicle.\n*Source Text:* *Daoist Canon of the Zhengtong Era*, *Dongxuan Section*, *Category of Dignified Rituals*.\n\n---\n\n**Ritual for Offering Libations on the Ascension Day of the Venerable Masters**\n**Offering Libations on the Jade Emperor’s Sacred Birthday (First Lunar Month, Ninth Day)**\n\nRainbow hues diffuse auspicious radiance, as we gaze upon the incense altar beneath the Azure Heavens;\nCranes stand in reverent devotion, presenting fragrant vessels upon the blessed realm.\nWith solemnity, we kindle the true incense of Dao and virtue, and in utmost sincerity, we present our offerings to:\nThe Most High, Opener of Heaven, Holder of the Talisman, Ruler of the Calendar, Embracer of Truth, and Embodiment of the Dao—\nThe August Jade Emperor of the Vast Heavens, the Supreme Lord of the Lofty Firmament;\nThe Sacred Father, Celestial King of Resplendent and Wondrous Joy;\nThe August Mother, Empress of Precious Moonlight;\nThe Sacred Assembly of the Golden Towers of Mount Mi;\nThe Lofty Perfected of the Jade Capital—all relying upon the true incense, universally conjoined in offering.\n\nAgain, we kindle the true incense and present our offerings to:\nThe Three Pristine Ones of the Formless and Spontaneous, the Three Realms of Heavenly Worthies;\nThe Great Emperor of the Northern Culmen, the Purple Tenuity;\nThe Heavenly August Emperor of the Southern Culmen;\nThe Earthly Sovereign, Queen of the Sustaining Earth, Who Responds to Heaven’s Patterns;\nThe Myriad Spirits of the Three Realms and the True Lords of the Ten Directions.\nOn this day of homage, we reverently beseech all true numina, humbly invoking their vast compassion to deign to gaze upon us with penetrating insight.\n\n**Proclamation of Intent**\nWe humbly submit: the Great Dao is formless, yet wondrously initiates and nourishes the myriad things...",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 280,
      "start_sentence": 0,
      "end_sentence": 11,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.93959903717041,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\诸师圣诞冲举酌献仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "至真罔象，制群品以御图。 妙用难窥，灵机莫测。 庸假无文之敬，式殚庆圣之恭。 恭惟昊天玉皇大天尊、玄穹高上帝，天地同明，日月合德。 浮黎真境，记传受道之初； 紫微上宫，显示度人之旨。 出宝书於天篆，发金纽於霞文。 乃大梵之天章，实诸天之隐韵。 焕尔不言之教，超乎无眹之机。 八角垂芒，孰窥浩劫； 二仪应运，莫测真源。 允希监宥之私，少副依归之志。 诸天庆会，三境非遥。 玉树仙花，睇玉虚之咫尺； 琅舆碧辇，演琼韵以雍容。 谨运虔恭，礼伸初献。 伏以郁罗萧台，现有为之梵相； 溟津大梵，具无极之神通。 斯玄祖之灵枢，实穹皇之要旨。 昏衢慧烛，溟渤舟航，上则安国康民，下而扶危度厄。 拯提趣类，绝智愚高下之分； 敷畅真玄，破无有色空之碍。 顾惟菲薄，莫匪甄陶。 伏念某等餐听法音，普沾圣泽。 闻演说而叹希有，益开悟而感弘慈。 荐逢降世之佳辰，用谨朝元於平旦。 如无边明镜，在供养尊礼以奚为； 若大音洪锺，虽寂寞扣求而必应。 不遗再渎，尚赐居歆，再拜上香，礼伸二献。 伏以妙有真境，普示现国王之身； 弥罗上宫，即根本帝尊之位。 具一气胚胎之萃，全三光浩渺之真。 妙德难思，神通莫议。 隐隐玉京之上，巍巍金阙之高。 五千秘言，融三才之大道； 八千余度，接六趣之众生。 自然而然，非识可识； 定而能应，去来自在。 以无拘合而可分，变化圆通而莫测。 演清净解脱之旨，济沈迷忧苦之途。 周游於三境之中，溥现於十方之上。 伏愿不违童渎，惟简帝心。 鉴斋戒沐浴之虔； 开覆焘载持之造。 昭一临有赫，喜庆难言，倾倒虔恭，礼终三献。 宣疏 回向",
      "translated_text": "The Perfectly Real, though without form, governs the manifold beings and guides the cosmic pattern. Its wondrous workings are beyond fathoming, its numinous mechanism unfathomable. With unadorned reverence, we exhaustively offer our celebration and homage to the sacred.\n\nWe reverently recall the August Jade Emperor, the Great Heavenly Worthy, the Mysterious Culmen, the Lofty Lord of Heaven—co-equal in radiance with Heaven and Earth, conjoined in virtue with Sun and Moon. In the True Realm of Floating Black, the records preserve the inception of the Dao’s transmission; in the Supreme Palace of Purple Tenuity, the decree of salvation for humankind is revealed. From celestial scriptures, the Treasure Book emerges; from rosy clouds, the Golden Seal is unfurled. This is the celestial chapter of the Great Brahma, the hidden rhyme of all heavens. Resplendent is the teaching beyond words, transcending the mechanism of the formless. Eight rays cast their brilliance—who can fathom the vast kalpas? The Two Modes respond to the turning of the Dao—none can plumb its true source. We trust in the gracious oversight of your compassion, that it may but slightly fulfill our yearning for refuge.\n\nThe assemblies of all heavens and the Three Realms are not distant. Jade trees and immortal blossoms—within a hand’s span of the Jade Void; jasper chariots and azure carriages—resounding with harmonious jade music. With utmost reverence, we perform the first offering.\n\nMoreover, the Terrace of Fragrant Mist manifests the Brahma-form of conditioned existence; the Great Brahma of the Vast Ocean possesses the divine power of the boundless. This is the spiritual pivot of the Mysterious Ancestor, the essential decree of the Lofty Sovereign. It is the lamp of wisdom in the dark crossroads, the boat and oar across the vast sea—above, securing the nation and pacifying the people; below, rescuing the imperiled and delivering the distressed. It uplifts all sentient beings, transcending distinctions of wisdom and folly, high and low; it disseminates the true and mysterious, shattering the barriers of non-being, form, emptiness, and obstruction.\n\nWe, of humble and meager virtue, are none but those molded by your grace. We reflect that we, who feast our ears upon the Dharma-sound, universally bathe in your sacred blessings. Hearing the exposition, we marvel at its rarity and deepen our awakening, moved by your vast compassion. As we encounter this auspicious occasion of your descent into the world, we reverently perform the morning audience at the break of day. Like the boundless bright mirror, what need is there for offerings in venerating the honored? Like the great bell’s mighty resonance, though silent, it responds when struck. We dare not presume upon repeated entreaties, yet humbly pray for your gracious acceptance. Bowing twice, we offer incense and perform the second presentation.\n\nMoreover, the True Realm of Wondrous Existence universally manifests the body of the King of Sublime Joy; the Supreme Palace of Miroku is the very throne of the Root Emperor. It embodies the essence of the primordial qi’s gestation and fully realizes the vast truth of the Three Luminaries. Its wondrous virtue is beyond thought, its divine power beyond discourse. Concealed above the Jade Capital, towering high in the Golden Portal. Five thousand secret words fuse the great Dao of the Three Powers; eight thousand and more salvations reach the multitudes of the Six Realms. Spontaneously so, not to be known by knowledge; settled yet responsive, free in coming and going. Unconstrained by union or separation, its transformations are all-pervading and unfathomable. It expounds the decree of purity and liberation, delivering those sunk in delusion, sorrow, and suffering. It roams through the Three Realms, universally manifesting above the Ten Directions.\n\nWe humbly pray that you not disdain our childish importunity, but rather incline your imperial heart. Witness our devotion in fasting, ablutions, and vigil; open the covering of your nurturing embrace. May your majestic presence shine forth, bringing joy beyond words. Overwhelmed with reverence, we conclude with the third offering.\n\n**Proclamation of Petition**\n**Dedication**",
      "overlap_context": "eavenly August Emperor of the Southern Culmen;\nThe Earthly Sovereign, Queen of the Sustaining Earth, Who Responds to Heaven’s Patterns;\nThe Myriad Spirits of the Three Realms and the True Lords of the Ten Directions.\nOn this day of homage, we reverently beseech all true numina, humbly invoking their vast compassion to deign to gaze upon us with penetrating insight.\n\n**Proclamation of Intent**\nWe humbly submit: the Great Dao is formless, yet wondrously initiates and nourishes the myriad things...",
      "start_char": 280,
      "end_char": 908,
      "start_sentence": 12,
      "end_sentence": 58,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.48172354698181,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\诸师圣诞冲举酌献仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "伏愿天听惟明，帝心有鉴。 长而不宰，与天地以为宗； 仰之弥高，超形名而独立。 恩全民物，泽被邦家。 祖天师诞辰正月十五日 天上蘅薇，记千载生仙之旦； 人间蕉荔，表一时庆圣之心。 恭炷真香，供养祖师三天扶教辅元体道大法天师、正一冲玄神化静应显佑真君、六合无穷高明大帝降魔护道天尊，圣祖汉师相留文成侯、正一圣父桐□真人、正一圣母元君，嗣师太清演教妙道真君，系师太清昭化广德真君，正一女师元君、左右侍宸王赵二真人、正一文姬仙女、文光仙女、玉兰仙女、芳芝仙女，奉车都尉楼亭侯、义阳太守阆中侯、南郡太守侍御史，正一历代天师真人元君仙姑仙祖仙宗飞腾仙眷，本观香火高真，雷霆法部官将真官、土地江东之神，三界朝贺、一切真灵。 悉运真香，普同供养。 宣意",
      "translated_text": "We humbly pray that Heaven’s hearing be ever clear, the imperial heart ever discerning. Enduring yet not domineering, it takes Heaven and Earth as its foundation; gazed upon, it grows ever loftier, transcending form and name to stand alone. Its grace sustains all beings, its blessings extend to state and homeland.\n\nOn the fifteenth day of the first lunar month, the birth anniversary of the Celestial Master: in the heavens, the fragrant rose marks the millennial dawn of a perfected immortal; on earth, the plantain and lychee express the timely reverence of a sacred celebration. With reverence, we kindle true incense, offering it to the Ancestral Master, the Three Heavens’ Upholder of the Teaching, the Great Dharma Celestial Master Who Assists the Primordial and Embodies the Dao; the Perfected Lord of True Response, Who Subtly Transforms and Quietly Manifests; the Most High and Vast Emperor of the Six Harmonies, the Heavenly Worthy Who Subdues Demons and Protects the Dao; the Sacred Ancestor, Marquis Wen Cheng of the Han, Preceptor of the Realm; the Sacred Father of the Orthodox Unity, Perfected Lord of Tong-□; the Sacred Mother, Primordial Lady; the Lineal Master, Perfected Lord of the Wondrous Dao Who Expounds the Teaching of the Great Clarity; the Affiliated Master, Perfected Lord of Illuminating Transformation and Vast Virtue of the Great Clarity; the Orthodox Unity’s Female Master, Primordial Lady; the Two Perfected Lords Wang and Zhao, Attendants to the Imperial Presence; the Immortal Maidens Wen Ji, Wen Guang, Yu Lan, and Fang Zhi; the Commandant of the Imperial Chariot, Marquis of Lou Ting; the Governor of Yi Yang, Marquis of Lang Zhong; the Governor of Nan Jun, the Palace Attendant and Imperial Censor; the Perfected Lords, Primordial Ladies, Immortal Maidens, Ancestral Immortals, Flying Ascendants, and Immortal Kin of all generations of Orthodox Unity Celestial Masters; the High Perfected of this temple’s incense fire; the Perfected Lords, Divine Officials, and Generals of the Thunder Rites; the local deities of Jiangdong; all the assembled deities of the Three Realms; and every true numen.\n\nAll together, we offer true incense in universal veneration. The proclamation of intent is declared.",
      "overlap_context": "in delusion, sorrow, and suffering. It roams through the Three Realms, universally manifesting above the Ten Directions.\n\nWe humbly pray that you not disdain our childish importunity, but rather incline your imperial heart. Witness our devotion in fasting, ablutions, and vigil; open the covering of your nurturing embrace. May your majestic presence shine forth, bringing joy beyond words. Overwhelmed with reverence, we conclude with the third offering.\n\n**Proclamation of Petition**\n**Dedication**",
      "start_char": 908,
      "end_char": 1229,
      "start_sentence": 59,
      "end_sentence": 68,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.686280488967896,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\诸师圣诞冲举酌献仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "伏以启运鹤鸣，丕阐无穷之灵化； 分荣鱼鬣，诞膺太上之休光。 由汉室以着称，继留侯而济美。 山林瞻仰、海宇归崇。 恭惟祖师正一真君，正一之宗，玄元之主。 代天济世，以宝箓而传后人； 度地修真，养金丹而成大道。 印剑之纂承悠远，功行之表着恢弘。 绿辇丹舆，感金阙至真之降； 龙章凤篆，探紫阳内典之藏。 奉圣朝褒锡之尊，见师造覆持之广。 神风遐着，. 紫雾弥罗。 龙戏麟盘，仰翩翩而下逮； 鸾鸣凤唱，斯秩秩以居饮。 辄运 虔恭，礼伸初献。",
      "translated_text": "Bowing in reverence, we recall how the crane’s cry at Mount Heming first inaugurated the unfolding of boundless numinous transformation, while the fish-scale ranks of the sacred writs were honored with the radiant favor of the Most High. From the Han dynasty onward, the lineage gained renown, succeeding the Marquis of Liu in perpetuating its glory. Mountains and forests gaze in awe, seas and lands turn in devotion.\n\nWe now reverently recall the Ancestral Master, the Perfected Lord of Orthodox Unity, the very fount of Orthodox Unity and sovereign of the Mysterious Origin. He saved the world on Heaven’s behalf, transmitting the precious registers to posterity; he cultivated perfection upon the earth, nurturing the golden elixir to fulfill the great Dao. The inheritance of seal and sword stretches far into antiquity, while his meritorious deeds and virtuous conduct shine with vast splendor. Green carriages and cinnabar chariots drew the descent of the Perfected Ones from the Golden Towers; dragon scripts and phoenix seals delved into the treasuries of the Purple Yang’s inner canon. Honored by the sagely court with exalted bestowals, his transformative embrace extended wide as a sheltering canopy. His divine influence spread afar, purple mists enveloped the heavens. Dragons frolicked and unicorns danced, their graceful descent observed in awe; phoenixes sang and simurghs called, their harmonious ranks arrayed in solemn feast.\n\nWith utmost reverence, we now present the first offering.",
      "overlap_context": "r; the Perfected Lords, Primordial Ladies, Immortal Maidens, Ancestral Immortals, Flying Ascendants, and Immortal Kin of all generations of Orthodox Unity Celestial Masters; the High Perfected of this temple’s incense fire; the Perfected Lords, Divine Officials, and Generals of the Thunder Rites; the local deities of Jiangdong; all the assembled deities of the Three Realms; and every true numen.\n\nAll together, we offer true incense in universal veneration. The proclamation of intent is declared.",
      "start_char": 1229,
      "end_char": 1435,
      "start_sentence": 69,
      "end_sentence": 84,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.157241582870483,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\诸师圣诞冲举酌献仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "伏以天为星辰，地为河岳，关百世之盛衰； 衣之冠冕，水之本源，寄后人之瞻仰。 三天具庆，四海欢腾，自惟至道储精，寔乃先天毓秀。 流芳根本，茂枝叶以光荣； 沃润山林，如草木之衣被。 伏念某等仰依师荫，寓处琳庭。 每依仿以有怀，惟奉持而弗替。 尚监勤拳之至，俯垂享格之私，休有烈光，洞融妙义。 天颜有喜，春浮芝脸以增辉； 云气祥光，日近薇垣而蔼瑞。 际会风云於天上，近瞻日月於人间。 再运丹衷，礼伸二献。 伏以六鳌驾山，双凤扶辇，洽惟庆诞之良时； 五老启途，群仙翼辕，用致赞扬於今日。 转钧有造，覆锦惟怀。 巍乎泰省之崇，翊此清门之化，无往不在，与时偕行。 鱼鬣端披，喜共睹天人之相； 此髯正视，若再瞻日月之光。 方蘅薇之香气，又新念葵藿之丹诚。 难泯三熏，益谨百拜。 惟恭奉疏牍以敷言，洁寿解而称颂。 恩庥知自，个款奚殚。 伏愿鉴行潦之微芹，沃余波於奕叶。 明明在上，永垂耀於真风； 赫赫厥灵，尚依光於化日。 德辉无尽，仙道弥昌。 倾倒虔恭，礼终三献。 宣疏 回向",
      "translated_text": "Whereas the heavens manifest as stars and constellations, the earth as rivers and mountains—marking the rise and fall of a hundred generations—so too do robes and crowns, the very source of waters, become the legacy upon which posterity gazes in reverence. The Three Heavens rejoice as one, the Four Seas surge with jubilation, for we perceive that the treasury of the supreme Dao stores the essence of all, and that this essence is indeed the primordial nurturing of the finest spirits. Its fragrant roots run deep, its luxuriant branches and leaves radiate glory; it nourishes the mountains and forests as clothing and covering clothe and cover the grasses and trees.\n\nWe, your humble disciples, dwell beneath the shelter of your teaching, abiding in the jade courts. Ever do we hold fast to emulation and devotion, never wavering in our observance. We beseech you to regard our earnest reverence, to bestow the grace of your acceptance, that we may partake of your resplendent brilliance and penetrate the wondrous meaning. May the celestial countenance be pleased, spring suffusing the fungus face with heightened radiance; may auspicious clouds and luminous qi draw near the imperial terrace, suffusing it with felicity. We meet amidst wind and cloud in the heavens above, we behold the sun and moon among humankind below.\n\nWith redoubled sincerity, we present the second offering.\n\nWhere six giant turtles bear the mountain and twin phoenixes support the imperial carriage, the hour of your blessed birth is most felicitous; where the Five Elders open the way and a host of immortals flank the axle, we now render our praise. Your achievements are profound, your sheltering grace ever-present. Lofty as the Hall of Supreme Harmony, you uphold the transformation of this pure lineage, ever-present, advancing with the times. The scales of fish and dragons stand erect, rejoicing together in the sight of the celestial and human realms; these whiskers and beard gaze straight ahead, as if once more beholding the light of sun and moon. Amid the fragrance of orchids and angelica, our thoughts renew the sincerity of sunflowers and mallows. Though thrice-kindled incense may fade, our reverence redoubles with a hundred bows.\n\nWith utmost reverence, we present this memorial to express our words, purify the libation cup, and offer our praises. The grace we receive is boundless, its particulars beyond enumeration. We pray that you deign to regard our humble offering of water-plantains, that your overflowing favor may nourish generations to come. May the luminous presence above forever illumine the true wind; may your majestic spirit ever abide in the radiance of the transforming sun. May your virtuous splendor know no end, and the immortal Dao flourish ever more.\n\nWith deepest reverence, we conclude with the third offering.\nThe memorial is proclaimed and the merit dedicated.",
      "overlap_context": "agon scripts and phoenix seals delved into the treasuries of the Purple Yang’s inner canon. Honored by the sagely court with exalted bestowals, his transformative embrace extended wide as a sheltering canopy. His divine influence spread afar, purple mists enveloped the heavens. Dragons frolicked and unicorns danced, their graceful descent observed in awe; phoenixes sang and simurghs called, their harmonious ranks arrayed in solemn feast.\n\nWith utmost reverence, we now present the first offering.",
      "start_char": 1436,
      "end_char": 1850,
      "start_sentence": 85,
      "end_sentence": 113,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.161803007125854,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\诸师圣诞冲举酌献仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "伏愿执道之枢，与天同运。 教宗蒙润，鱼衣承雨露之恩； 帝所垂光，凫舄履星辰之上。 琳庭清肃，道众安和。 道祖降诞献文二月十五日 大道无名，式际降生之旦； 至神有赫，庸殚庆赞之诚。 恭炷道德真香，虔诚奏启供养，太清仙境太上老君道德天尊、混元上德皇帝。 恭望道慈，洞回昭鉴，再运真香，虔诚奏启。 供养玉清元始天尊、上清灵宝天尊、金阙诸天上帝、大罗妙有高真、法主玄天上帝、祖师正一真君、三界十方千真万圣、雷霆法部官将、江东土地之神，是日朝贺一切真灵。 悉运真香，普同供养。 宣意",
      "translated_text": "May we humbly pray that, grasping the pivot of the Dao, you move in harmony with Heaven’s revolutions. As the teachings receive their nurturing moisture, the fish-scale robes bask in the grace of rain and dew; where the imperial presence sheds its radiance, the duck-feather sandals tread above the stars. May the jade courts remain serene and solemn, the Daoist assembly secure and harmonious.\n\nOn the fifteenth day of the second month, the birth of the Dao’s Ancestor is celebrated with this memorial. Though the Great Dao bears no name, we mark the dawn of its descent; though the Most Divine shines in majesty, how can our reverent praises suffice? With utmost devotion, we kindle the true incense of virtue and power, and in all sincerity present our offerings to the Most High Lord of Dao and Virtue of the Grand Pure Immortal Realm, the August Emperor of Primordial Virtue.\n\nWe reverently beseech the compassion of the Dao, that it may turn and illumine our humble offering. Once more we kindle the true incense and present our devotions, offering to the Jade Pure Originator of Heaven, the Supreme Pure Numinous Treasure Heavenly Worthy, the Golden Watchtower Lords of the Heavens, the Lofty Perfected of the Great Mystery’s Wondrous Existence, the Dharma Lord Mysterious Heavenly Emperor, the Patriarch Orthodox Unity Perfected Lord, the Thousand Perfected and Ten Thousand Sages of the Three Realms and Ten Directions, the Officials and Generals of the Thunder Rites, the Earth God of Jiangdong, and all the divine beings who gather in homage on this day. May the true incense be universally offered to all.\n\nThe memorial is proclaimed.",
      "overlap_context": "articulars beyond enumeration. We pray that you deign to regard our humble offering of water-plantains, that your overflowing favor may nourish generations to come. May the luminous presence above forever illumine the true wind; may your majestic spirit ever abide in the radiance of the transforming sun. May your virtuous splendor know no end, and the immortal Dao flourish ever more.\n\nWith deepest reverence, we conclude with the third offering.\nThe memorial is proclaimed and the merit dedicated.",
      "start_char": 1850,
      "end_char": 2087,
      "start_sentence": 114,
      "end_sentence": 125,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.301432371139526,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\诸师圣诞冲举酌献仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "伏以生无始而随无终，玄通冥寂； 可常名而非常道，清净自然。 禀妙气於玉虚，现粹容於神室。 恭惟太上老君混元皇帝，主玄元教，居太赤天，立民物而运乾坤，宰阴阳而行日月，甄陶品类，拯济显幽。 方青阳时序之中，乃紫府真元之节。 九清庆洽，三极祥开。 流瑞蔼於玄枢，焕灵光於寿域。 爰伸贺悃，敬奉庆仪。 白鹿引车，若光临於汉室； 青牛拥驾，犹下逮於周朝。 谨运丹哀，礼伸初献。 伏以九龙拥瑞，纪毓圣之昌辰； 八鸾同鸣，荐迎真於谷旦。 阐扬大化，演绎灵音。 俨日渊月角之尊，仰天步星行之道。 纲维万化，宰制三才。 伏念某等职守琳庭，率循科范，奉清光而对越，瞻紫气以弥高。 戒蓬岛之羽流，洁林居之藻荐。 祇修玄典，仰冀鉴观。 自本自根，等乾坤而同久； 非空非色，超象数以独尊。 再运丹衷，礼伸二献。 伏以金简玉书，阐神真於三洞； 父言圣训，垂道德於千龄。 诞扬清净之风，茂启希夷之化。 开云弁霞裾之绪，发赤书玉字之玄。 教被中华，恩周下土。 关令方探於望气，天人有待於传经。 搏不得，听不闻，虽大道独超乎语嘿； 存者神，过者化，惟盛德则可以形容。 何以赞扬，第勤熏沐，伏愿先天传道，浩劫指迷，长为下土之津梁，悉化群黎於方域。 驯至空同之问，自无姑射之疵。 道统储祥，琳庭协庆。 倾倒虔恭，礼终三献。 □经 宣疏",
      "translated_text": "---\n\nWe humbly acknowledge that birth has no beginning and follows no end, its profound communion lying in dark stillness; it may bear the name \"constant\" yet is not the constant Dao, for it is pure and self-so. Receiving the wondrous qi from the Jade Void, it manifests its pure countenance within the numinous chamber.\n\nWith reverence, we recall the Primordial August Emperor, the Most High Lord Lao, who presides over the teachings of the Mysterious Origin, dwelling in the Great Crimson Heaven. He establishes the peoples and creatures, moving the cosmos of Heaven and Earth; he governs yin and yang, directing the sun and moon. He shapes and nurtures all kinds, delivering and saving both the manifest and the hidden. Now, in the midst of the green-yang season’s order, on this festival of the Purple Palace’s true origin, the Nine Heavens rejoice in harmony, and the Three Realms open in auspiciousness. Auspicious radiance flows from the Mysterious Pivot, and numinous light shines upon the realm of longevity. Thus, we extend our felicitous devotion and respectfully present our celebratory rites.\n\nThe white deer draws his chariot, as if descending to grace the Han court; the azure ox bears his carriage, still condescending to the Zhou dynasty. With earnest sincerity, we perform the first offering.\n\nWe humbly observe that nine dragons embrace the auspiciousness, marking the flourishing dawn of the sagely era; eight luan-birds sing in unison, presenting and welcoming the Perfected One on this bright morning. The great transformation is proclaimed, and the numinous sounds are unfolded. Solemn as the sun and deep as the moon’s horns, we look up to the Way of treading the stars and walking the heavens. He upholds the warp of the myriad transformations, governing and ordering the Three Powers.\n\nWe, your servants, who guard the jade halls and follow the ritual codes, face the pure radiance in reverent attendance, gazing upon the purple qi ever ascending. We, the feathered ones of Peng Isle, purify the forest-dwelling offerings; we diligently cultivate the Mysterious Canon, hoping for your gracious regard. Rooted in origin, we endure as long as Heaven and Earth; neither void nor form, we transcend images and numbers in solitary eminence. With renewed sincerity, we perform the second offering.\n\nWe humbly note that golden tablets and jade scriptures expound the divine Perfected Ones of the Three Caverns; the Father’s words and sagely teachings bequeath virtue and power across a thousand ages. He spreads the wind of purity and clarity, abundantly inaugurating the transformation of the subtle and tranquil. Unfolding the threads of cloud-caps and rosy skirts, he reveals the mysteries of red writings and jade characters. His teachings cover the Central Lands, his grace extends to the lower realms. The Pass Keeper gazes afar to observe the qi, while heaven and humanity await the transmission of scriptures. It cannot be grasped, it cannot be heard—though the great Dao alone transcends speech and silence; that which abides is spirit, that which passes is transformation—only the most abundant virtue can be described.\n\nHow then shall we praise and extol? Only through diligent purification and ablution. We humbly pray that the transmission of the precelestial Dao may guide the lost through endless kalpas, ever serving as the bridge for the lower realms and transforming all peoples within the four quarters. Thus, even the inquiries of Kongtong shall find no fault, and the blemishes of Guye shall vanish. May the lineage of the Dao store up auspiciousness, and may the jade halls share in this felicity.\n\nWith utmost reverence, we conclude the third offering.\n\n[Recite the] scripture. Proclaim the memorial.",
      "overlap_context": "the Golden Watchtower Lords of the Heavens, the Lofty Perfected of the Great Mystery’s Wondrous Existence, the Dharma Lord Mysterious Heavenly Emperor, the Patriarch Orthodox Unity Perfected Lord, the Thousand Perfected and Ten Thousand Sages of the Three Realms and Ten Directions, the Officials and Generals of the Thunder Rites, the Earth God of Jiangdong, and all the divine beings who gather in homage on this day. May the true incense be universally offered to all.\n\nThe memorial is proclaimed.",
      "start_char": 2087,
      "end_char": 2615,
      "start_sentence": 126,
      "end_sentence": 161,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.654478788375854,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\诸师圣诞冲举酌献仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "回向 月惟春仲，风光已及於花辰； 寿与天齐，道德斯临於仙旦。 诸天同庆，三界均欢。 伏愿玉几高明，丹扃通彻。 国家宁一，遵道德之常经； 天地后先，超形名而独立。 各谐清净，共底雍熙。 伏愿道尊德贵，林泉永乐於升平； 日富月昌，雨露均沾於化育。 高真降诞三月三日 三月三日，正兰亭修楔之辰； 一德一心，庆金阙化身之圣。 恭炷真香，虔诚供养，万法教主玉虚师相玄天上帝、金阙化身荡魔天尊，圣父净乐天君明真大帝、圣母善胜天后琼真上仙，圣师丰乾大帝、祖天师泰玄上相正一真君、虚危二宿星君、应化武曲星君、文昌梓潼帝君、武当山得道五伯灵官、北极佑圣府天乙真庆官元和迁校府官君将吏、观庭香火高真、雷霆法部官将真官、土地江东之神，是日朝贺三界真灵，玄虚过往紏察真司。 悉仗真香，普同供养。 宣意",
      "translated_text": "In dedication—\nThis month being mid-spring, the wind and light have reached the season of blossoms;\nLongevity equal to heaven, virtue and power now descend upon the immortal’s birthday.\nAll heavens rejoice as one, the three realms share in joy.\n\nWe humbly pray that the jade throne remain exalted, the cinnabar gates open and clear.\nMay the nation achieve unity, following the eternal scripture of virtue and power;\nMay heaven and earth, first and last, transcend form and name to stand alone.\nEach in harmony and purity, together attaining great peace.\n\nWe humbly pray that the Dao be revered and virtue honored, that forests and springs forever delight in prosperity;\nThat days grow richer and months more flourishing, and nurturing rains and dew equally moisten all under cultivation.\n\nOn the third day of the third month, the birth of the exalted perfected—\nThe third day of the third month, precisely the time when Orchid Pavilion gathered for purification rites;\nWith one virtue and one heart, we celebrate the sage of the Golden Portal’s incarnate transformation.\n\nReverently kindling true incense, with utmost sincerity we make offerings to:\nThe Lord of Myriad Dharmas, Jade Void Master and Minister, Mysterious Heavenly Thearch;\nThe Golden Portal’s incarnate transformation, the Demon-Quelling Heavenly Worthy;\nHis holy father, Heavenly Lord of Pure Joy, Radiant Perfected Great Emperor;\nHis holy mother, Queen of Excellent Victory, Jade Perfected Supreme Immortal;\nHis holy preceptor, August Emperor of Abundant Heaven;\nAncestral Heavenly Master, Grand Minister of Supreme Mystery, Perfected Lord of Orthodox Unity;\nThe Star Lords of the *Xu* and *Wei* constellations;\nThe Manifested Star Lord of Military Merit;\nThe Divine Lord of Culture and Destiny, Master of Zi and Tong;\nThe Five Perfected Lords of Attained Dao on Mount Wudang;\nThe Heavenly Rectifier of the Northern Culmen’s Protective Sagely Mansion;\nThe Officials, Lords, Generals, and Clerks of the Yuanhe Migration and Correction Bureau;\nThe Exalted Perfected of the Temple’s Fragrant Hearth;\nThe Perfected Officials and Generals of the Thunder Rites Department;\nThe local deities of Jiangdong;\nAll the true numina of the three realms who gather in homage on this day;\nAnd the Perfected Controllers of the Mysterious Void’s passing oversight.\n\nMay all be upheld by true incense and universally receive these offerings.\n\nProclaim the intent.",
      "overlap_context": "ly pray that the transmission of the precelestial Dao may guide the lost through endless kalpas, ever serving as the bridge for the lower realms and transforming all peoples within the four quarters. Thus, even the inquiries of Kongtong shall find no fault, and the blemishes of Guye shall vanish. May the lineage of the Dao store up auspiciousness, and may the jade halls share in this felicity.\n\nWith utmost reverence, we conclude the third offering.\n\n[Recite the] scripture. Proclaim the memorial.",
      "start_char": 2615,
      "end_char": 2953,
      "start_sentence": 162,
      "end_sentence": 177,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.779239892959595,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\诸师圣诞冲举酌献仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "伏以梦日储祥，庆玄天而应化； 披云望幸，伏厚地以陈情。 诸天齐临，万神唱奉。 恭惟教主玄天上帝，得天之道，执帝之符。 净乐孕灵，锺五岳三光之间炁； 虚危应宿，合九霄八景之元和。 宜尊居北极之高，益光赞东吴之盛。 屡沐圣朝之华衮，诞臻人世之葵倾。 细酌流霞，顺下风而献奠； 庸修涧藻，祈上圣以光临。 谨运丹衷，礼伸初献。 伏以玉虚师相，仰北极之崇高； 金阙真尊，寄后人之瞻睹。 灵光奕奕，圣德巍巍，然有愿以皆从，故无幽而不烛。 魁罡激指，扫妖魔於六洞之中； 人鬼分离，着功行於七日之内。 显幽俱泰，今古攸遵。 伏念某等叨沐甄陶，惟深庆赞。 行藏用舍，莫非圣训之依； 覆焘匡扶，所异灵休之及。 荐逢此日，再启玄风。 辄陈潢潦之仪，以答鸿厖之贶。 不违童渎，尚鉴时忱。 瑶佩琼裾，下云霄之浩荡； 金钱宝马，略尘世之恭虔。 再运虔诚，礼伸二献。 伏以渎则不告，敢忘庆贺之私； 感而遂通，仰藉好生之德。 神洋洋乎如在，皇刻刻兮扬灵。 第切瞻依，肃严献奠。 伏望迂临下土，惠鉴微忱。 苹藻将诚，三侑殷勤之礼； 山林多幸，一瞻只尺之光。 庸罄一忱，礼终三献。 □经 宣疏",
      "translated_text": "We humbly recall how the sun’s auspicious dream presaged glory, celebrating the Mysterious Heaven’s responsive transformation; parting the clouds, we gaze toward its advent, prostrating upon the generous earth to present our sentiments. All heavens descend in unison, myriad spirits chant in homage.\n\nWith reverence we invoke the Teaching Master, the Mysterious Heavenly Thearch, who embodies Heaven’s Dao and wields the Emperor’s mandate. Born of Pure Joy’s numinous conception, his qi converges amid the Five Peaks and the Three Luminaries; aligned with the *Xu* and *Wei* constellations, he harmonizes the primordial harmony of the Nine Empyreans and Eight Radiant Scenes. Rightly enthroned in the lofty Northern Culmen, he ever more brilliantly augments the flourishing of Eastern Wu. Repeatedly bathed in the resplendent robes of the sagely court, he graciously inclines toward the mortal world’s devotion. Pouring fine nectar like flowing rosy clouds, we offer libations upon the wind; modestly preparing mountain herbs and river weeds, we beseech the August Sage’s radiant presence. With sincere heart we perform the first offering.\n\nWe bow in awe of the Jade Void’s Preceptor and Minister, gazing toward the Northern Culmen’s majesty; the Golden Portal’s True Honored One, entrusted to posterity’s veneration. His numinous radiance shines resplendently, his sagely virtue towers sublimely—all wishes are fulfilled, no hidden realm remains unillumined. His potent *kuigang* energy directs its force, sweeping away demonic forces from the Six Caverns; separating humans and ghosts, he manifests meritorious deeds within seven days. Both manifest and hidden realms attain peace, observed through ages past and present.\n\nWe, your humble servants, have been shaped by your nurturing grace, our gratitude and praise run deep. In action and retreat, in acceptance and rejection, we rely solely upon your sagely teachings; in sheltering protection and steadfast support, we differ not from those touched by your numinous blessings. Now, on this propitious day, we once more invoke the Mysterious Wind. Presuming to present these modest offerings, we seek to repay your boundless favor. Though our words may seem childishly irreverent, we pray you deign to witness our sincerity. Jade pendants and jeweled robes descend from the vast cloud-filled skies; golden coins and treasure horses but faintly express our worldly reverence. Renewing our devotion, we perform the second offering.\n\nWe acknowledge that to neglect ritual would be remiss, how dare we forget our private joy in celebration? Moved by our sincerity, you respond in communion, and we look up to your virtue of cherishing life. O Spirit, your presence is as if here; O August One, your numinous power is ever proclaimed. With earnest longing we gaze upon you, solemnly presenting our offerings.\n\nWe humbly pray you descend to this earthly realm and graciously regard our modest devotion. With humble herbs and earnest sincerity, we perform the threefold courteous rites; how fortunate are the mountains and forests to behold your radiance, now but a foot’s distance away. Offering our utmost sincerity, we conclude with the third libation.\n\n[Recite the] scripture. Proclaim the memorial.",
      "overlap_context": "ansion;\nThe Officials, Lords, Generals, and Clerks of the Yuanhe Migration and Correction Bureau;\nThe Exalted Perfected of the Temple’s Fragrant Hearth;\nThe Perfected Officials and Generals of the Thunder Rites Department;\nThe local deities of Jiangdong;\nAll the true numina of the three realms who gather in homage on this day;\nAnd the Perfected Controllers of the Mysterious Void’s passing oversight.\n\nMay all be upheld by true incense and universally receive these offerings.\n\nProclaim the intent.",
      "start_char": 2953,
      "end_char": 3411,
      "start_sentence": 178,
      "end_sentence": 213,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.503790855407715,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\诸师圣诞冲举酌献仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "回向 春日融融，开遍上林之桃李； 天颜穆穆，敬修南涧之苹蘩。 万倍欢荣，一诚庆贺。 伏愿高真洞鉴，列圣垂慈。 格一念之精诚，锡九畴之洪范。 冠裳兴盛，琳宇昌安。 高真祖师冲举献文九月九日 乘云谒帝，当九日之再临； 酌水朝真，仰三天之孔迩。 恭炷真香，虔诚供养祖天师、三天扶教辅元体道大法天师、正一冲玄神化静应显佑真君，六合无穷高明大帝、降魔护道天尊余圣位，同前，再炷真香，供养万法教主玉虚师相玄天上帝、金阙化身荡魔天尊，圣父净乐天君明真大帝、圣母善胜天后琼真上仙，武当山得道灵官圣众、观庭香火高真、雷霆法部官将真官、土地江东之神、是日朝赞一切真灵，悉仗真香，普同供养。 宣意 伏以玉佩秋风，记重阳之升举；",
      "translated_text": "We now turn our intentions outward:\nAs spring’s warmth melts the air, peach and plum blossoms open across the imperial gardens;\nAs the Heavenly Countenance shines in solemn grace, we reverently prepare the southern-stream’s pondweed and white southernwood.\nTen thousandfold joy and glory, one sincere celebration of felicity.\n\nWe humbly pray that the Lofty Perfected may peer into our depths, that the Lineage of Sages may bestow their compassion.\nMay our single thought of utmost sincerity be met with the Nine Categories of the Great Model.\nMay cap and robe flourish in splendor, may jade halls stand secure in peace.\n\nOn the ninth day of the ninth month, the Lofty Perfected and Ancestral Master ascend in offering of this text:\nRiding the clouds to pay homage to the Emperor, they return on this double-ninth day;\nPouring water to honor the Perfected, they look up to the Three Heavens now intimately near.\n\nWith reverence we kindle true incense, devoutly offering to:\nThe Ancestral Celestial Master,\nThe Three Heavens’ Upholding Teaching and Assisting Primordial Dao Great Dharma Celestial Master,\nThe Orthodox Unity and Primordial Mystery Spiritually Transformed and Serenely Responsive Manifest Protector Perfected Lord,\nThe Boundless Six Directions Lofty and Illustrious Great Emperor,\nThe Demon-Quelling and Dao-Protecting Heavenly Worthy and remaining sagely hosts—\nall as before.\n\nAgain we kindle true incense, offering to:\nThe Jade Clarity Master and Minister, Mysterious Heavenly Thearch and Lord of Myriad Dharmas;\nThe Golden Palace’s Manifested Body, Demon-Quelling Heavenly Worthy;\nThe Sacred Father, Pure Joy Heavenly Lord and Illustrious Perfected Great Emperor;\nThe Sacred Mother, Excellent Victory Heavenly Consort and Jade Perfected Supreme Immortal;\nThe realized divine officials and sacred assembly of Mount Wudang;\nThe high perfected of the incense hall;\nThe thunder and lightning dharma departments’ officials and divine marshals;\nThe local earth gods of the Jiangdong region;\nAnd all the perfected and numinous beings of this day’s court and praise—\nall rely upon this true incense in universal and equal offering.\n\nWe now proclaim our intent:\nAs autumn winds stir the jade pendants, we recall the Double Yang’s ascension;",
      "overlap_context": "uminous power is ever proclaimed. With earnest longing we gaze upon you, solemnly presenting our offerings.\n\nWe humbly pray you descend to this earthly realm and graciously regard our modest devotion. With humble herbs and earnest sincerity, we perform the threefold courteous rites; how fortunate are the mountains and forests to behold your radiance, now but a foot’s distance away. Offering our utmost sincerity, we conclude with the third libation.\n\n[Recite the] scripture. Proclaim the memorial.",
      "start_char": 3411,
      "end_char": 3718,
      "start_sentence": 214,
      "end_sentence": 226,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.107074737548828,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\诸师圣诞冲举酌献仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "金茎晓露，对佳节以献酬。 诸天下临，万神唱奉。 恭惟祖天师正一真君，执天之枢，与天同运。 瑶峰玉局，亲传九鼎之书； 绛节霓旌，光被三天之诏。 由汉室龙兴之世，至蜀都鹤去之时。 益衍宗风，光于今日。 载惟法主玄天上帝，得天之道，执帝之符。 净乐孕灵，锺五岳三光之间气； 奎娄应宿，合九霄八景之元和。 宜尊居北极之高，益光赞东吴之盛。 俱沐圣朝之华衮，诞臻人境之葵倾。 细把茱萸，顺下风而献奠； 庸修苹藻，祈上圣以光临。 谨运丹衷，礼伸初献。 伏以紫芝眉宇，仰师省之崇高； 玄武旌旗，寄后人之瞻睹。 灵光奕奕，天视昭昭，盖与时以偕行，乃无幽而不察。 鹿堂盐井，着功行於丰碑； 针涧榔梅，重怀恩於下土。 无穷倾慕，敢后朝修。 伏念某叨沐甄陶，惟深庆赞。 行藏用舍，莫非圣训之依； 覆焘匡扶，所冀灵庥之被。 荐逢此日，再启玄风，辄陈潢潦之仪，以答鸿厖之贶。 不违童渎，尚鉴时忱。 瑶佩琼裾，下云霄之浩荡； 寒泉秋菊，略尘世之恭虔。 再运丹衷，礼伸二献 伏以鸾书凤诰，承三天眷命之隆； 羽葆霓旌，际九日升真之会。 神洋洋虖在上，皇剡剡兮扬灵。 乘白云至帝乡，功成别馆； 受素书传真诀，威制群魔。 绵数千百年正一之传，恢二十八治宗风之盛。 化巢之功勋，若被镇天之威武。 非虚莫既赞，宣肃严献奠。 伏望迂临下土，惠鉴微忱。 茱菊流芳，三侑殷勤之礼； 山林多幸，一瞻只尺之光。 庸罄一忱，礼终三献。 宣疏 回向",
      "translated_text": "As golden stalks glisten with dawn’s dew, we offer libations in accord with this auspicious festival.\nThe myriad heavens descend in attendance, and the ten thousand spirits join in harmonious praise.\n\nWith reverence we recall the Ancestral Celestial Master, the Orthodox Unity Perfected Lord,\nwho grasps the pivot of Heaven and moves in concert with its revolutions.\nAt Jade Peak’s sacred precinct, he received the Nine Cauldrons’ scriptures;\nwith crimson tally and rainbow banner, his radiance illumined the edicts of the Three Heavens.\nFrom the Han dynasty’s dragon-rising era to the time when cranes departed Shu’s capital,\nhis teachings flourished, their splendor resplendent even now.\n\nWe now honor the Dharma Lord, the Mysterious Heavenly Thearch,\nwho embodies Heaven’s Dao and wields the Emperor’s talisman.\nBorn of Pure Joy’s wondrous conception, his qi condensed between the Five Peaks and the Three Luminaries;\naligned with the astral mansions of Kui and Lou, he harmonized the primordial harmony of the Nine Empyreans and Eight Sceneries.\nRightly enthroned at the Northern Culmen’s height, he lends greater luster to Eastern Wu’s prosperity.\nBoth bathe in the sacred dynasty’s resplendent robes, and in human realms, sunflowers turn toward their brilliance.\nWe humbly gather dogwood sprigs, offering them downwind in libation;\nwe duly prepare water-plants and pondweed, praying for the august presence of the Most High.\nWith sincere devotion, we present the first offering.\n\nBehold the purple lingzhi’s brows—how they evoke the Master’s lofty majesty;\nthe Dark Warrior’s banners and standards, entrusted to posterity’s gaze.\nDivine radiance shines resplendent, Heaven’s vision clear and bright,\never advancing with the times, leaving no hidden realm unobserved.\nAt Deer Hall and Salt Well, his meritorious deeds are inscribed on towering steles;\nat Needle Stream and Areca Plum, the earth below cherishes his boundless grace.\nOur endless veneration dares not lag behind in this morning’s rites.\n\nWe reflect humbly upon our own undeserved cultivation,\nour deepest joy and praise rooted in this sacred influence.\nWhether in action or retreat, we rely solely on the sagely teachings;\nin sheltering protection and guiding support, we seek only the blessings of numinous favor.\nOn this propitious day, we once more invoke the Mysterious Wind,\npresenting these modest offerings in gratitude for the vast and boundless gifts.\nMay our childish simplicity not offend, and may our sincerity be witnessed.\nJade pendants and kingfisher robes descend through the vast expanse of cloud and sky;\ncold springs and autumn chrysanthemums but faintly reflect our reverent devotion.\nWith renewed devotion, we present the second offering.\n\nWith phoenix-scripted decrees, he bears the Three Heavens’ gracious mandate;\nwith feathered canopies and rainbow banners, he attends the Ninefold Festival of Ascending Perfection.\nThe gods, vast and majestic, abide above; the imperial presence, keen and luminous, manifests its power.\nRiding white clouds to the Emperor’s realm, his work complete, he departs for the separate palace;\nreceiving the plain-text scriptures and true instructions, his might subdues all demonic forces.\nFor thousands of years, the Orthodox Unity’s transmission has endured,\nexpanding the glory of the Twenty-Eight Treatments’ ancestral teachings.\nThe merit of transforming nests rivals the awe-inspiring might of Heaven’s guardians.\nNo empty praise suffices—we solemnly present our offerings in reverence.\n\nWe humbly pray for your descent to this earthly realm, graciously witnessing our sincerity.\nDogwood and chrysanthemum diffuse their fragrance, thrice offering our earnest rites;\nthe mountains and forests are blessed, beholding your radiance at a mere hand’s span.\nWith all our devotion, we conclude the threefold offering.\n\nProclamation of the Petition\nDedication of Merit",
      "overlap_context": "ected Supreme Immortal;\nThe realized divine officials and sacred assembly of Mount Wudang;\nThe high perfected of the incense hall;\nThe thunder and lightning dharma departments’ officials and divine marshals;\nThe local earth gods of the Jiangdong region;\nAnd all the perfected and numinous beings of this day’s court and praise—\nall rely upon this true incense in universal and equal offering.\n\nWe now proclaim our intent:\nAs autumn winds stir the jade pendants, we recall the Double Yang’s ascension;",
      "start_char": 3718,
      "end_char": 4286,
      "start_sentence": 227,
      "end_sentence": 269,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.835439443588257,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\诸师圣诞冲举酌献仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "鸾鹤浮空，降威容於只尺； 冠裳列序，致礼敬於再三。 八表秋清，诸天云会。 伏愿歆格微诚，显大教，传经玉局，永光道德之宗； 主法玄天，茂衍厖鸿之庆。 琳庭清肃，道众和安。 神灵孚佑，教弘道德之光； 仪相崇严，运启雍熙之治。 冠裳兴盛，琳宇昌安。 诸师圣诞冲举酌献仪竟",
      "translated_text": "Swans and cranes drift through the void, descending their majestic presence to within a hand’s span;\ncrowns and robes array in order, offering reverence and respect thrice over.\nThe eight directions stand clear in autumn’s purity, as all heavens gather in clouds.\nWe humbly pray you deign to accept our earnest sincerity, manifesting the great teachings,\ntransmitting the scriptures at the Jade Bureau, ever illuminating the ancestral Dao and virtue;\npresiding over the law in the Dark Heavens, abundantly extending boundless blessings.\nMay the jade courts remain serene and solemn, the Daoist assembly harmonious and at peace.\nMay the divine spirits grant their protection, expanding the radiance of Dao and virtue;\nmay the rites and appearances be revered and solemn, ushering in an era of harmony and prosperity.\nMay crowns and robes flourish in splendor, jade temples thrive in tranquility.\nThe ritual of offering to the birth and ascension of all masters is now concluded.",
      "overlap_context": "rivals the awe-inspiring might of Heaven’s guardians.\nNo empty praise suffices—we solemnly present our offerings in reverence.\n\nWe humbly pray for your descent to this earthly realm, graciously witnessing our sincerity.\nDogwood and chrysanthemum diffuse their fragrance, thrice offering our earnest rites;\nthe mountains and forests are blessed, beholding your radiance at a mere hand’s span.\nWith all our devotion, we conclude the threefold offering.\n\nProclamation of the Petition\nDedication of Merit",
      "start_char": 4286,
      "end_char": 4416,
      "start_sentence": 270,
      "end_sentence": 279,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 5.390519380569458,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\诸师圣诞冲举酌献仪.txt",
        "category": "威仪类"
      }
    }
  ]
}