{
  "source_id": "诸经圣胎神用诀",
  "source_file": "chunked_daozang\\诸经圣胎神用诀.json",
  "total_chunks": 6,
  "total_original_chars": 5736,
  "total_translated_chars": 33747,
  "total_translation_time": 160.65986704826355,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\方法类\\诸经圣胎神用诀.txt",
    "category": "方法类"
  },
  "full_translation": "*The Secret Formulae of the Sacred Embryo’s Divine Applications*\n*Scripture Title:* *The Secret Formulae of the Sacred Embryo’s Divine Applications*\n*Author:* Unknown\n*Volume:* One\n*Source Text:* *Daoist Canon of the Zhengtong Era*, *Section on Methods of the Cavernous Divine*\n\nThe Master said: \"One who knows the supreme Dao is not slain by Heaven; one who ingests primordial qi is not extinguished by Earth.\"\n\nThe supreme Dao is not distant—it resides within one’s own body. Through refined and subtle application of the mind, life endures.\n\n*The Secret Principles of Master Liu* states: \"To attain longevity, cultivate the root of one’s existence.\" It begins with essence and qi. Essence and qi coalesce to form the body; the body is the foundation that receives qi, and qi is the root of the formed. Primordial qi is the origin from which form is endowed—thus may the principle of formed existence be discerned.\n\nThe Scripture says: \"Deeply root and firmly stem—this is the Dao of long life and enduring vision.\" It further says: \"Within the form, mother and child—why not guard them?\" Within the form, primordial qi is the mother, and spirit is the child. Initially, through the qi of inhalation and exhalation, the form is established—hence it is called mother. Once form and qi are established, the inherent spirit arises—hence it is called child.\n\nThe supreme spirit, united with qi and form, circulates within the viscera, governing breath above and below. With prolonged practice, the spirit naturally clarifies, and qi naturally harmonizes. When the spirit is inwardly luminous, it illumines the five viscera; when qi is harmonized, it empowers the four limbs.\n\nThus, the Yellow Emperor, through three months of inward vision, stabilized the mind with spirit, thereby transforming and nurturing the five viscera. This principle may be inferred and attained!\n\nIt further says: \"Within intent, movement and stillness—qi attains spirit’s penetration. Practicing the Dao with self-mastery, my spirit shines brightly.\" This truth, too, may be inferred and attained.\n\nYet people of this age allow spirit and qi to move separately, mother and child to drift apart. Though qi breathes within, the spirit constantly engages externals. Thus, qi lacks a master, and spirit is obstructed; when spirit is obstructed, essence scatters.\n\nMoreover, spirit is the master, and form is the dwelling. If the master does not tend within but daily labors without, the dwelling naturally becomes empty, and the body decays.\n\nAlas, in this degenerate age, within each day and night—across the hundred divisions of time—the body’s qi completes thirteen thousand five hundred breaths, all expended outwardly by the spirit. Not a single breath abides within the body—how then can one hope for the Dao of long life and enduring vision?\n\nThe Master said: \"If one knows the governance of spirit and qi, the circulation of mother and child, then the gate to deathless longevity becomes visible. If qi lacks governance, left to mere breathing, it merely facilitates the five viscera and digests the five grains—unable to return yin to yang, to replenish blood and marrow.\"\n\nThe Master said: \"I take spirit as my chariot and qi as my steed, driving them ceaselessly without weariness.\"\n\nThe Scripture says: \"When the world possesses the Dao, even horses are retired to fertilize fields.\" This is precisely its meaning.\n\nMaster Yin the Perfected said: \"When spirit can govern qi, the nose ceases to breathe.\" This saying is most profound.\n\nThe method of governing qi...\n\nTo the Niwan Palace above and the Gate of Life below, the two luminaries follow one another—thus may the decrepit and aged be restored. If in exhalation the spirit fails to govern, a single breath is incomplete; if in inhalation the spirit fails to govern, a single breath is likewise incomplete. If in every breath the spirit and qi can merge, then the embryo forms within the hidden qi, and the qi breathes within the formed embryo. When embryo and qi conjoin internally, death is forever banished.\n\nOnce the work is accomplished, in men the essence gathers, in women the infant coalesces—though desire may stir, it cannot contend with the spirit. This is called the true return of essence to spirit. Such is the secret of refining the breath in the Upper Clarity Jade Perfection tradition. Practiced daily, one naturally savors its flavor, gradually uniting with the Perfect Dao of the Most High.\n\n**Master Haichan’s Formula for Embryonic Breathing**\nThe primordial qi is the mother of Heaven and Earth, the root of the Great Dao, the essence of yin and yang. In things it is called the pure and harmonious qi; in humans it is called the primordial qi—it is the nature and the life. In a single day and night, there are thirteen thousand five hundred breaths, through which the true qi constantly leaks from the mouth and nose. The sages who refine embryonic breathing for long periods store it in the cinnabar field, so that its subtle ingress and egress stabilize the body and secure long life. Long life means the heart and spirit-qi unite, merging with the Dao in truth.\n\n**Master Xuanhu’s Formula for Embryonic Breathing**\nThe Great Dao takes emptiness as its root and the absence of form as its subtlety. Returning to the primordial, settling into quiescence and primordial simplicity, one draws qi into the cinnabar field, refines the spirit in the golden chamber, and stabilizes the heart in the ocean of awareness. When the heart is settled, the spirit is at peace; when the spirit is at peace, the qi abides; when the qi abides, the heart naturally rejoices. Constantly, within the hundred divisions of the day, one contains and guards the true breath.\n\nIt is also said: when spirit and breath settle, metal and wood intermingle; when heart and intention are at peace, dragon and tiger meet—this is the true function of the inner elixir and embryonic breathing. For those who cultivate the Dao, if they wish for long life without death, they must first refine the heart.\n\nThe Perfected One said: The heart lies one inch and three fen below the lungs. It is called the Jade Kettle, within which dwells a single qi of empty whiteness. The Scripture says: \"From emptiness white arises\"—it is called by one name the Jade Kettle, by another the Spirit Chamber, by another the Jade Palace, by another the Crimson Palace. Within it dwells the Heavenly Worthy Who Saves from Suffering, the deathless spirit, the Heavenly Worthy of Numinous Treasure, the talisman of the Primordial Beginning, the Perfected One of Grand Unity, and the Perfected One Who Saves from Suffering. Constantly uphold the primordial qi, never allowing it to scatter. When the cinnabar sand coalesces, it is as large as a millet grain, its color like yellow gold—it is called the Precious Jade. If one can recognize, distinguish, and apprehend it, sealing the six gates and ever guarding the celestial truth, embryonic breathing forms of itself, and one may prolong life for ages without dying.\n\n**Yuan Tiangang’s Formula for Embryonic Breathing**\nYin and yang are the true qi of Heaven and Earth. One yin, one yang, they give birth to the myriad things. In humans they are the qi of inhalation and exhalation; in Heaven they are the qi of cold and heat. It is also said: these two can alter the qi of the four seasons—this is the wu and ji that enclose and conceal the true qi.\n\nIt is said: when spring arrives in the xun position, it can bring forth the myriad things; when summer arrives in the kun position, it can nurture the myriad things; when autumn arrives in the qian position, it can ripen the myriad things; when winter arrives in the gen position, it can contain the myriad things. All these are the rising and descending, the emerging and submerging of yin and yang in their numinous function. Thus yang qi emerges from water and flourishes in wood; yin qi emerges from fire and flourishes in metal. Yang is born at zi and emerges at mao; yin is born at wu and enters at you. These four cardinal points are the gates and doors of Heaven and Earth.\n\nThe Great Dao must draw upon the correct qi of the four seasons. In all cultivation, movement and breath are yin; stillness and breath are yang. In practice, one must attain settled heart, settled strength, settled spirit, and settled breath—then dragon and tiger will intimately meet, and the sacred embryo will form. This is called the embryonic breathing of the Perfected One.\n\n**The Formula for Embryonic Breathing of the Perfected One**\nIn all cultivation, first settle the heart and qi. When heart and qi are settled, the spirit congeals; when the spirit congeals, the heart is at peace; when the heart is at peace, the qi ascends; when qi ascends, the realm is empty; when the realm is empty, there is clarity and stillness; when there is clarity and stillness, there is nothingness; when there is nothingness, life is whole; when life is whole, the Dao arises; when the Dao arises, forms are severed; when forms are severed, awareness is luminous; when awareness is luminous, the spirit is penetrating.\n\nThe Scripture says: \"When the heart is penetrating, the myriad methods are all penetrating; when the heart is still, the myriad methods are all extinguished.\" This is the true concentration of the Tathāgata. For those who cultivate the Dao, first cultivate the method of settling the heart. Once the method of settling is attained, the returned elixir is not far, the golden liquid is not distant—immortality is achieved.\n\n**Master Xu Shen’s Formula for Embryonic Breathing**\nThe spirit is the function of the empty and primordial; the breath is the function of the primordial qi. Refine away the boundaries of the dusty world—whether right or wrong, self or others, wealth or beauty, grasping or relinquishing, enmity or kinship—all are equal and uniform. Naturally, protection and assistance arise, and the Dao-heart is accomplished.\n\nThe Scripture says: \"The spirit is the function of emptiness.\" Essence, qi, and spirit—these three are the numinous terrace. For those who cultivate, if the three of breath, settled essence, qi, and spirit are attained, one may live long without dying and become an immortal who transcends the world—this is no empty claim.\n\n**Master Yanluo’s Formula for Embryonic Breathing**\nThat which moves is originally moving; that which is still is originally still. In ancient times, there was originally no movement or stillness—movement and stillness share a single source. Yet because all sentient beings are deluded and their thoughts unsettled, the sages left teachings to instruct people in settling the breath. When the spirit follows the settled breath, and the qi abides, the spirit settles. If the qi moves, the heart moves; if the heart moves, the spirit is wearied.\n\nFor those who cultivate the Dao, if they do not practice embryonic breathing, there remains the source of movement and stillness—how then can they enter the gate of non-action? They will lose their way.\n\n**Damo Chan Master’s Formula for Embryonic Breathing**\nTo refine embryonic breathing is to refine qi and settle the heart. Constantly breathe at the heart-wheel, then one does not cling to the myriad things. If the qi is unsettled, even Chan is empty. If the qi is settled, the colored body is free from illness, and both Chan and the Dao are at peace.\n\nFor cultivators who fail to guard the heart, the primordial qi scatters and cannot be gathered—how then can the Dao be accomplished? The ancients said: when qi is settled, the heart is settled; when qi congeals, the heart is still—this is the essence of the Great Dao, also called the Returned Elixir. The Daoist, free from all attachments, practices thus daily, and this is called true samādhi and contemplation. Thus, the sages and worthies of the three times all cultivated by this method, known as the dual cultivation of Chan and samādhi.\n\n**Li Zhenren’s Embryonic Breathing Formula (Taboo Name: Ziming)**\nFor true embryonic breathing, enter a pure chamber, burn incense, face the wall, sit cross-legged with the soles of the feet turned upward, free the heart from attachments, and empty the mind of thoughts. Calm the spirit and settle the breath, constantly observing it throughout the body—naturally, it will flow unimpeded. Learners must not fully close the breath, for complete closure harms the spirit. Instead, gauge the length of one’s own breath, allowing qi to enter and exit without being heard by the ear—this is the subtle method. If one constantly regulates the breath, neither exhaling nor inhaling, and over time abides in the cinnabar field, firmly guarding it, this is called true embryonic breathing. The Dao will surely be accomplished!\n\n**Baopuzi’s Embryonic Breathing Formula**\nAll cultivators must settle the breath. Breath is correctness, peace, harmony, return, submission, tranquility, and stillness. If one constantly practices thus in the four dignified postures, one will surely enter the true Dao. Do not cling to any realm; empty the heart and fill the abdomen—this is most subtle. Simply calm the breath and settle the heart: when the heart is settled, qi becomes quiescent; when qi is quiescent, the spirit becomes still; when the spirit is still, the realm becomes empty; when the realm is empty, there is extinction; when there is extinction, there is no affair; when there is no affair, there is purity; when there is purity, the Dao arises; when the Dao arises, there is spontaneity; when there is spontaneity, there is freedom. Having entered freedom, there is boundless ease, and one becomes an immortal. Naturally, the Five Agents gather, the Six Qi harmonize, the Eight Trigrams pair, and the inner elixir is formed. The body and form endure forever without decay.\n\n**Kang Cangzi’s Embryonic Breathing Formula**\nIn all cultivation and entry into the Dao, quiet the heart and do not disturb the spirit; do not leak qi and scatter the spirit; do not startle the breath and trouble the body; do not speak and exhaust the breath; do not speak and deplete the blood; do not stagnate the breath and swallow; do not distance the breath and weep; do not abandon the breath and act carelessly; do not anger the breath and disturb the spirit; do not worry the breath and harbor resentment; do not think of the breath and cling to the self; do not contend and harm the breath; do not remember others. In walking, standing, sitting, and lying down, constantly maintain this practice—the heart will naturally be joyful, and accomplishment will come of itself. Without cultivating this principle, one wastes effort and will never succeed. But if one practices thus daily, the elixir will surely be formed. When movement and stillness are both forgotten, the Dao is attained without seeking.\n\n**Yuan Xian Zhenren’s Embryonic Breathing Formula**\nThose who study non-action embryonic breathing cultivate only the originally pure heart, also called true suchness, which is fundamentally empty. It resembles the great void: without going or coming, without above or below, neither moving nor still, utterly silent and vast, of the same body as true emptiness, of the same source as the Great Dao, and meeting the original face. If one cultivates the Great Dao, one should cultivate non-action. The heart is clear and empty, quiescent yet without quiescence, still yet without stillness. When the heart is settled and the realm fades, when both heart and realm are forgotten, one enters the true Dao of non-action. If cultivators practice this method, the elixir will form of itself, and naturally, qi will settle, achieving embryonic breathing.\n\n**He Xiangu’s Embryonic Breathing Formula**\nRefinement is cultivation; breath is harmony, spirit, and essence. The root of breathing qi is the pure and tranquil true qi. Observe it entering the cinnabar field, exhaling and inhaling subtly. Thus, the dragon and tiger are naturally subdued. If the heart is without movement, the spirit without thought, and harmony without desire, this is called the Great Samādhi. When true qi abides in the form, one attains the rank of a true immortal, with boundless transformations, and is called a true person. For embryonic breathing, one must preserve the spirit and settle the intent, embracing and guarding the Three Passes—essence, qi, and spirit. All cultivators must constantly embrace and guard these three methods in every period of the day, and naturally, treasures will gather. The nation will be prosperous and the people at peace; the heart-king will be free, the spirit harmonious and smooth, illness rare, vexations few, the body light and agile, the ears sharp and the eyes bright. This is the direct path of true cultivation. If one practices this method for three to five years, heaven will protect, spirits will aid, and ordinary people will love and respect. Over time, one will naturally attain the Dao.\n\n**Yu Yun Zhang Guolao’s Embryonic Breathing Formula**\nThe embryo is the palace of conception. Breathing qi is received in the primordial sea, one inch and three fen below the navel, called the cinnabar field. There, true essence forms the body, receiving the qi of heaven and earth. In the first month, it is like a pearl; in the second, like dew; in the third, like a peach or plum—this is called the pure and harmonious qi, the uncarved block. While the child is in the mother’s womb, when the mother exhales, it exhales; when the mother inhales, it inhales. By the tenth month, the qi is full, and it is born. The six senses turn outward, no longer returning to the original state, failing to guard the inner breath—thus, there is birth and death. Therefore, the sage said: “I do not indulge the Three Corpses; the six senses constantly rest in the cinnabar field, guarding without retreat.” All cultivators must first cultivate the gate of heart-stillness. It is also said: “Understanding the heart and cultivating the Dao saves effort and is easily accomplished. Without understanding the heart and cultivating the Dao, one wastes effort to no avail.” First, understand the source of the heart, then naturally settle. The dragon and tiger will be subdued, and the immortal Dao will surely be accomplished. The cinnabar field lies one inch and three fen below the navel—it is the palace of primordial qi, governing the three hundred and sixty spirits of radiant essence, guarding and protecting the primordial qi. Within it sits a divine turtle, inhaling and exhaling primordial qi. In one day and night, there are thirteen thousand five hundred breaths, all of primordial qi, which leak out through the mouth and nose, allowing pathogenic qi to invade and cause illness.\n\nThe cinnabar field is the source of generative qi. It has ten names: first, *cinnabar field*; second, *essence-path*; third, *qi-sea*; fourth, *guardian palace*; fifth, *great source*; sixth, *spirit chamber*; seventh, *primordial treasury*; eighth, *treasure-gathering*; ninth, *wu-ji* (戊己); and tenth, *root origin*. All are the dwelling place of grand harmony and primordial qi. If one stores essence and qi within the cinnabar field, one attains the Dao of longevity and enduring vision.\n\nAll practitioners must constantly contain and absorb true breath within the cinnabar field during movement, stillness, sitting, and rest. Thus, primordial qi becomes substantial, and through long refinement, one becomes an immortal. This is the true adept’s *embryonic breathing*.\n\n**Master Hou’s Embryonic Breathing Formula**\nThe realm of true unity does not depart from its source. The source is the One Heart. When the heart does not move or act, it is the source; when the source does not halt or abide, it is the heart. If the heart is pure and still, it becomes the great elixir; if the heart is deluded and chaotic, it becomes the great thief—seizing one’s essence, stealing one’s spirit, ruining one’s furnace, losing one’s elixir, harming one’s body, and forfeiting one’s life.\n\nAll Dao practitioners must first cultivate the method of stilling the heart. Through heart-stilling, one attains a settled mind. When the mind is settled, the spirit is at peace; lead and mercury unite, and dragon and tiger become intimate. When the celestial cycle is complete, essence is replenished, qi is augmented, and the spirit is nourished. If these three methods are perfected, the myriad spirits gather in the cinnabar field, blood and qi circulate throughout the body, and one roams freely in the Dao of longevity.\n\nIt is also said: How does one attain purity and stillness? By clarifying the spirit, cutting off thoughts, dissolving the self, extinguishing external realms, and embracing the true—this is the wondrous Dao of stillness.\n\n**Master Guiguzi’s Embryonic Breathing Formula**\nAll Dao practitioners return to their origin and restore purity, inwardly uniting with true qi. When the Dao returns, the four images, five phases, six qi, seven origins, and eight trigrams refine essence, qi, and spirit to form their substance. This is taking the substantial from the void, the existent from the nonexistent, and inwardly concealing the true elixir.\n\nThus, refining the heart produces spirit, refining essence produces form, and refining qi produces life—these are the ascending and descending qi of yin and yang. The source of qi is the root of life. Therefore, cultivating these three methods is the great Dao.\n\n**The Yellow Emperor’s Embryonic Breathing Formula**\nAll Dao practitioners must constantly practice inward contemplation, dispelling the three corpses and transcending the six emotions. They return inwardly to preserve the three treasures, with the heart-spirit guarding its palace and qi sealed without dissipation. The myriad spirits rejoice, qi is nourished, form is refined, and nature is preserved. These three methods cannot be abandoned—they are the true unity of embryonic breathing and the great elixir of the mysterious pass.\n\n**Master Chen Xiyi’s Embryonic Breathing Formula**\nThe Dao transforms youth into age, age into illness, illness into death, death into spirit, and spirit into the myriad things. Qi transforms into living beings, essence transforms into form, and the three—spirit, qi, and essence—refine into true immortals.\n\nThus, it is said: Preserve essence, nourish spirit, and refine qi—these are the three divine powers, which one must not fail to know. Zi-wu (子午), mao-you (卯酉), and the four seasons are the gates of yin and yang’s entry and exit. A settled mind unmoving is called *chan* (meditation); spirit penetrating myriad changes is called *ling* (numinous); wisdom comprehending all matters is called *hui* (wisdom); the Dao’s origin uniting with qi is called *cultivation*; true qi returning to its source is called *refinement*; dragon and tiger uniting is called *elixir*; and the three elixirs harmonizing is called *completion*. If practitioners know this root source, they may draw near to the Dao.\n\n**Master Xiaoyaozi’s Embryonic Breathing Formula**\nCultivation is resolve and nurturance; nurturance is sustenance, concealment, and truth. To nurture breath, one must first nurture essence; to nurture essence, one must first nurture spirit; to nurture spirit, one must first nurture nature; to nurture nature, one must first nurture life. Nature and life are spirit and qi, hun and po, yin and yang, *li* and *kan*. Through prolonged practice, the sacred embryo forms—this is true embryonic breathing.\n\n**Master Zhang the Celestial Master’s Embryonic Breathing Formula**\nPrimordial qi is formless, the true heart is lawless, and the great Dao is not near. Only the method of refining breath contains the true Dao.\n\nIt is also said: When heart is settled, qi is settled, and spirit is settled, all Dao practitioners who unite with the primordial Dao of the great elixir—cleansing emptiness, stilling thoughts, forgetting intentions, and abiding in quiescence without phenomena—engage in true embryonic breathing and will undoubtedly become immortals.\n\n**Master Guo’s Embryonic Breathing Formula**\nRefinement is cultivation, nurturance, and emptiness. The ears do not hear, the eyes do not see, the nose does not smell, the tongue does not taste, and breath and qi settle the heart. This method arises from non-being into being, from non-existence into existence, from non-form into form, from non-emptiness into emptiness. It is not being as being, not non-being as non-being, not form as form, not emptiness as emptiness—this is the true method of embryonic breathing, nurturing harmony, and regulating the spirit.\n\nIt is also said: Seeing without perceiving the self, hearing without attaining sound, transcending all extremes—this is called the wondrous Dao, the highest method.\n\n**The Central Yellow-Old Lord’s Embryonic Breathing Formula**\nThe root of heaven and earth arises from yin and yang. Pure qi becomes heaven, turbid qi becomes earth; pure qi becomes the heart, and turbid qi becomes the kidneys. Yet worldly entanglements stir the human heart, causing pure and turbid to remain undivided.\n\nHow can one comprehend this principle? In every action, movement, sight, and sound, the five thieves steal one’s true origin: the eyes transmit to the heart, and the heart’s movement wearies the spirit; the ears transmit to the heart, and the heart conveys sounds to the kidneys, exhausting the spirit and vexing the heart—thus, all is ruined. If thoughts stir, true qi leaks, and embryonic breathing cannot form.\n\nHow then can it be achieved? If one sits in stillness, thoughts unmoving, breath forgotten, and emotions stilled, qi and spirit harmonize, and through prolonged practice, one naturally becomes an immortal.\n\n**Master Liu’s Embryonic Breathing Formula**\nPeople often live in the world yet do not know what daily phenomena create within themselves.\n\nAlas! This is the qi of the great heavens. When primordial essence does not decline, things coalesce into vessels: above, they rely on the heavens’ pure qi, gathering to form shape; below, they connect with the earth’s turbid qi, congealing to form substance. Within, they contain the One True, yet worldly people do not recognize it, thus leaking it outward—this is essence, qi, and spirit. If one does not guard these three, old age and death draw near. The sage never strays from these three methods: in movement and stillness, waking and sleeping, through long practice they coalesce into the embryo, and one becomes an immortal.\n\nA verse says:\nPeople live in the world yet know not their root,\nEver greedy, they cast aside their true origin.\nNeglecting the primordial yang and true breathing qi,\nThey incur heaven’s wrath and illness clings to the body.\n\n**The Embryonic Breathing Formula of the Old Mother of Mount Li**\nThe sutra states: Heaven and earth steal from the myriad things, the myriad things steal from humans, and humans steal from the myriad things. Thus, the three thieves oppose one another, scattering and losing the true radiance of spirit, and embryonic breathing cannot form. If the practitioner does not covet the myriad things, they will not steal your original nature. Therefore it is said: The true Daoist of one’s allotted portion—I do not take what is yours, and you do not take what is mine—only guard your portion. What is guarding one’s portion? It is neither issuing forth nor entering in, constantly guarding the original source, neither moving nor still, neither coming nor going, seemingly existent yet seemingly nonexistent—this is the living dead. Immortality is near!\n\n**The Embryonic Breathing Formula of Immortal Li**\nPeople of the world who uphold the Dao and maintain cultivation must pay homage to the true and repent of transgressions. On days of *gengshen* and *jiazi*, on the anniversaries of parents’ distant passing, and on the Three Primes and Eight Festivals, one should perform purification rites and offer sacrifices, so that the gods and heavens will protect and bless. Moreover, if each day one remains serene and untroubled, calming the heart and sitting in stillness, regulating spirit and nurturing qi, never leaving the inner chamber, then naturally the Three Palaces will ascend and descend, the Six Qi will circulate, the hundred meridians will flow unimpeded, and the myriad things will gather in the Yellow Court. The Yellow Court is the Central Palace. If one constantly guards the Central Palace, essence and qi will not leak—this is true embryonic breathing.\n\n**The Embryonic Breathing Formula of the Daoist of Mount Tiantai**\nIn cultivation, one must always practice equanimity and forbearance, utterly rejecting the arising of deviant thoughts, with true heart and resolute will. Circulate the qi of heart and kidneys, moving them up and down to unite in the Central Palace. Let the various spirits not scatter, warmly nurture the primordial qi, and cinnabar and the yellow sprout will naturally emerge. Deep roots and firm stems yield perpetual breathing, and through long practice, one attains longevity, leaves the world, and achieves the Dao.\n\n**The Embryonic Breathing Formula of Master Liu**\nIn practicing the primordial method of embryonic breathing, the heart must not kill, not desire, not steal, not covet, not be deviant, not be deluded, not be arrogant, not be reckless. The heart becomes bright and clear, and by constantly maintaining purification and precepts, true breathing is ever regulated, and illumination pervades the body and world. When body and heart are pure and still, this is longevity. The Daoist is like a gold mine or a treasure trove—firm and solid. If the Six Gates do not open, deviant qi cannot enter, and the whole body remains free of illness. If the Six Gates are not closed, thieves will plunder the golden treasure, and one will fall ill. The Dao will not be achieved!\n\nA verse says:\nThe true qi within the heart is heaven’s essence,\nJust when spirit is clear and qi is like a mirror.\nIf the great Dao relies on its wondrous function,\nWithin the heart’s purity, qi gives birth to the numinous.\nGoing and coming without pause,\nAbove and below ceaselessly, creation is accomplished.\nWhen spirit is still and qi is settled, untouched by affairs,\nThis time, breathing abides and the natural numinous arises.\n\nThose who study later but do not rest in the primordial Dao, whose idle thoughts never cease, whose arising and ceasing never end, will be swept away by external things. How can embryonic breathing be achieved?\n\n**The Embryonic Breathing Formula of Langranzi**\nIn cultivation, one must burn incense, enter the chamber, sit in stillness, and empty the heart. Knock the teeth to gather the spirits, stabilize the mind-horse, and subdue the heart-monkey, collecting them all in one place and settling them in the Cinnabar Field to warm and nurture them. Inwardly observe without issuing forth, like a general leading an army. Spirit is the commander, qi is the army. Where qi goes, spirit follows; the two move together and must not be separated. A thousand disasters are extinguished, and ten thousand illnesses do not afflict. If the practitioner of the Dao attains this method and diligently practices it—today this poor Daoist reveals the celestial mechanism. If you do not practice it, I will incur misfortune.\n\n**The Embryonic Breathing Formula of Inward Vision within the Hundred Peaks**\nEmbryonic breathing is unknown to worldly people, yet all worthies attain realization through it. Without this method, one cannot hold fast; without the oral transmission, one cannot begin; without direct instruction, one cannot proceed. Even if guided by hand, one may still fail to master it. Some foolish people attempt to stabilize the heart-monkey and capture the mind-horse, yet waste their efforts in vain, accomplishing nothing. If the true cultivator wishes to capture the heart-monkey and subdue the mind-horse, they must first regulate qi and settle breathing, then calm the heart, still thoughts, and forget emotions—only then can they succeed. Without doing so, time and days pass in vain. Without a teacher’s guidance, this matter is difficult to know.\n\n**Cao the Immortal Maiden’s Embryonic Breathing Formula**\n\nEmbryonic breathing cannot be achieved through mere methods or techniques. Those who attempt it by such means stray far from the Dao. When a person is born, the spirit must be preserved, qi retained, and the Dao cultivated—spirit and qi depend upon each other to complete one’s nature and life. Emptiness allows the numinous to flow freely and radiance to shine; harmony circulates smoothly and nourishes with softness. When the spirit is at peace, qi flows unimpeded; when qi flows unimpeded, the blood harmonizes; when the blood harmonizes, the bones strengthen; when the bones strengthen, the marrow fills; when the marrow fills, the abdomen swells; when the abdomen swells, the lower body solidifies; when the lower body solidifies, one’s steps become light and vigorous; when steps are light and vigorous, movement brings no fatigue; when the four limbs are healthy and strong, it is like a nation’s borders at peace and prosperous. When qi and blood are harmonious and abundant, it is like a nation’s treasuries full. It is like a wealthy household—spirit and will are harmonious and joyful, the complexion naturally brightens, and one’s steps become like dancing. The Dao of immortality is near.\n\nThus it is said: Today’s people recite the Buddha’s name or invoke the Dao only to avert disaster and seek blessings, yet they would do better to focus their minds on eliminating delusion. Is this not excellent? Those of insight who observe and practice this will naturally achieve embryonic breathing.\n\n**Here ends the formula for the embryonic spirit’s application, as transmitted by the perfected sages.**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "诸真圣胎神用诀 经名：诸真圣胎神用诀。 不着撰人。 一卷。 底本出处：《正统道藏》洞神部方法类。 诸真圣胎神用诀 师曰：知至道者天不杀，服元炁者地不灭。 夫至道者不远，祇在己身，用心精微，命乃长久。 《刘公秘旨》曰：欲得长生，当修所生之本。 始於精炁，精炁待而为形，形为受炁之本，炁是有形之根，元炁禀形之由，可察成形之理。 经曰：深根固蒂，长生久视之道。 又曰：形中子母，何不守之？ 且形中以元炁为母，以神为子，初因呼吸之炁而立成形，故为母也。 形炁既立，而固有神，故为子也。 夫至神也，与炁合形，神与炁但循环於藏府之内，驭呼吸於上下，久久习之，则神自明，而炁自和。 神既内明，照彻五藏，炁和则使用於四肢。 故黄帝三月内视，住心以神，则化生缠绵五藏。 斯言可推而得之也！ 又曰：意中动静，炁得神通。 行道自持，我神光明。 斯理之然，然可推而得之也。 今世之人，神与炁各行，子与母相离，炁虽呼吸於内，神常运物於外。 如此遂使炁无主而神不通，神不通而精自散。 又以神为主，以形为宅舍，主人不营於内，日营於外，自然宅舍空虚，而形体衰朽矣。 瓦末世道流，每一昼一夜，百刻之中，形炁之得总一万三千五百息，皆外役於神，无息住於形体之中，而何能冀长生久视之道。 先生曰：若知神炁之所主，子母运行，则长生不死之门可见也。 若炁无主宰，任自呼吸咐，通利五藏，消化五谷而已，不能还阴返阳，填补血脑耳。 师曰：吾以神为车，以炁为马，终日御之，而不倦也。 经云：天下有道，却走马以粪。 正谓此也。 尹真人曰：神能御炁，则鼻不息。 斯言至矣。 御炁之法",
      "translated_text": "*The Secret Formulae of the Sacred Embryo’s Divine Applications*\n*Scripture Title:* *The Secret Formulae of the Sacred Embryo’s Divine Applications*\n*Author:* Unknown\n*Volume:* One\n*Source Text:* *Daoist Canon of the Zhengtong Era*, *Section on Methods of the Cavernous Divine*\n\nThe Master said: \"One who knows the supreme Dao is not slain by Heaven; one who ingests primordial qi is not extinguished by Earth.\"\n\nThe supreme Dao is not distant—it resides within one’s own body. Through refined and subtle application of the mind, life endures.\n\n*The Secret Principles of Master Liu* states: \"To attain longevity, cultivate the root of one’s existence.\" It begins with essence and qi. Essence and qi coalesce to form the body; the body is the foundation that receives qi, and qi is the root of the formed. Primordial qi is the origin from which form is endowed—thus may the principle of formed existence be discerned.\n\nThe Scripture says: \"Deeply root and firmly stem—this is the Dao of long life and enduring vision.\" It further says: \"Within the form, mother and child—why not guard them?\" Within the form, primordial qi is the mother, and spirit is the child. Initially, through the qi of inhalation and exhalation, the form is established—hence it is called mother. Once form and qi are established, the inherent spirit arises—hence it is called child.\n\nThe supreme spirit, united with qi and form, circulates within the viscera, governing breath above and below. With prolonged practice, the spirit naturally clarifies, and qi naturally harmonizes. When the spirit is inwardly luminous, it illumines the five viscera; when qi is harmonized, it empowers the four limbs.\n\nThus, the Yellow Emperor, through three months of inward vision, stabilized the mind with spirit, thereby transforming and nurturing the five viscera. This principle may be inferred and attained!\n\nIt further says: \"Within intent, movement and stillness—qi attains spirit’s penetration. Practicing the Dao with self-mastery, my spirit shines brightly.\" This truth, too, may be inferred and attained.\n\nYet people of this age allow spirit and qi to move separately, mother and child to drift apart. Though qi breathes within, the spirit constantly engages externals. Thus, qi lacks a master, and spirit is obstructed; when spirit is obstructed, essence scatters.\n\nMoreover, spirit is the master, and form is the dwelling. If the master does not tend within but daily labors without, the dwelling naturally becomes empty, and the body decays.\n\nAlas, in this degenerate age, within each day and night—across the hundred divisions of time—the body’s qi completes thirteen thousand five hundred breaths, all expended outwardly by the spirit. Not a single breath abides within the body—how then can one hope for the Dao of long life and enduring vision?\n\nThe Master said: \"If one knows the governance of spirit and qi, the circulation of mother and child, then the gate to deathless longevity becomes visible. If qi lacks governance, left to mere breathing, it merely facilitates the five viscera and digests the five grains—unable to return yin to yang, to replenish blood and marrow.\"\n\nThe Master said: \"I take spirit as my chariot and qi as my steed, driving them ceaselessly without weariness.\"\n\nThe Scripture says: \"When the world possesses the Dao, even horses are retired to fertilize fields.\" This is precisely its meaning.\n\nMaster Yin the Perfected said: \"When spirit can govern qi, the nose ceases to breathe.\" This saying is most profound.\n\nThe method of governing qi...",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 668,
      "start_sentence": 0,
      "end_sentence": 32,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.940906524658203,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\诸经圣胎神用诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "上至泥丸，下至命门，二景相随，可救残老矣。 若呼不得神宰，一息不全，吸不得神宰，亦一息不全。 若能息息之中，使神炁相合，则胎从伏炁中结，炁从有胎中息，胎炁内结，永无死矣。 功成之后，男子聚精，女子结婴，虽动於欲不能与神争，是谓真返精为神也。 此者乃是上清玉真修息之诀。 日能行之，自得其味，渐合太上真道。 海蟾真人胎息诀 夫元炁者，天地之母，大道之根，阴阳之质。 在物名淳利之炁，在人名元炁者也。 乃性命也。 凡一昼一夜，一万三千五百息，常常口鼻中泄了真炁。 圣人久炼胎息者，常纳於丹田，故微微出入，定自身，安而得长生。 长生者，乃心与神炁相合，与道同真也。 玄葫真人胎息诀 夫大道以空为本，绝相为妙达，本元静定太素，纳炁於丹田，炼神於金室，定心於觉海。 心定神宁，神宁则炁住，炁住则自然心乐。 常於百刻之中，含守於真息。 又云神息定而金木交，心意宁而龙虎会，此内丹之真胎息之用也。 凡修道之人，若要长生不死，先须炼心。 真人日：心者，在肺之下，一寸三分。 曰：玉壶内有虚白一炁。 经云：虚中生白，一名玉壶，二名神室，三名玉馆，四名绛宫。 中有救苦天尊，中有不死之神，中有灵宝天尊，中有元始符命，中有太一真人，中有救苦真人。 常持元炁，勿令失散，丹砂结就，大如黍米，色如黄金，一名宝琳。 若人识得辩得认得，塞其六门，常守天真，胎息自成，延年久而不死矣。 袁天纲胎息诀 夫阴阳者，天地之真炁，一阴一阳，生育万物。 在人为呼吸之炁，在天为寒暑之炁。 又云：此两者能改移四时之炁，此乃戊己，包藏真炁。 云：春至在巽，能发生万物，夏至在坤，能长养万物，秋至在乾，能成熟万物，冬至在艮，能含藏万物。 此皆阴阳出没，升降神用，故阳炁出水盛木，阴炁出火盛金，阳生於子，出乎卯，阴生於午，入乎酉。 此四仲之辰，皆是天地之门户也。 凡大道者，必取四时之正炁，凡修行，动息为阴，定息为阳。 凡作时须得心定力定，神定息定，龙亲虎会，结就圣胎，名曰真人胎息也。 於真人胎息诀 凡所修行，先定心炁，心炁定则神凝，神凝则心安，心安则炁升，熙升则境空，境空则清静，清静则无物，无物则命全，命全则道生，道生则绝相，绝相则觉明，觉明则神通。 经云：心通万法皆通，心静万法皆灭。 此一门如来真定者也。 凡修道者，先修心定之法，既得定法，还丹不远，金液非遥，仙道得矣。 徐神公胎息诀 夫神者，虚元之用，息者，元炁之用。 炼去尘世之境，若是非人我，财色取舍，得失冤亲，平等如一，自然佑护，道心成矣。 经云：神者虚无用之。 精、炁、神三者，便是灵台。 修行之人，若是息定精炁神三件，可长生不死，必为出世之仙，则不虚矣。 烟萝子胎息诀 夫动者本动，静者本静，古者本无动静，且动静者一源。 盖为一切众生，妄想不定，圣人留教，教人定息，神随炁定，炁住神定，若炁动心动，心动神疲。 凡修道之人，不行胎息则有动静之源，怎入无为之门户也？ 走失了也。 达磨禅师胎息诀 夫炼胎息者，炼炁定心是也。 常息於心轮，则不着万物，炁若不定，禅亦空也。 炁若定则色身无病，禅道双安。",
      "translated_text": "To the Niwan Palace above and the Gate of Life below, the two luminaries follow one another—thus may the decrepit and aged be restored. If in exhalation the spirit fails to govern, a single breath is incomplete; if in inhalation the spirit fails to govern, a single breath is likewise incomplete. If in every breath the spirit and qi can merge, then the embryo forms within the hidden qi, and the qi breathes within the formed embryo. When embryo and qi conjoin internally, death is forever banished.\n\nOnce the work is accomplished, in men the essence gathers, in women the infant coalesces—though desire may stir, it cannot contend with the spirit. This is called the true return of essence to spirit. Such is the secret of refining the breath in the Upper Clarity Jade Perfection tradition. Practiced daily, one naturally savors its flavor, gradually uniting with the Perfect Dao of the Most High.\n\n**Master Haichan’s Formula for Embryonic Breathing**\nThe primordial qi is the mother of Heaven and Earth, the root of the Great Dao, the essence of yin and yang. In things it is called the pure and harmonious qi; in humans it is called the primordial qi—it is the nature and the life. In a single day and night, there are thirteen thousand five hundred breaths, through which the true qi constantly leaks from the mouth and nose. The sages who refine embryonic breathing for long periods store it in the cinnabar field, so that its subtle ingress and egress stabilize the body and secure long life. Long life means the heart and spirit-qi unite, merging with the Dao in truth.\n\n**Master Xuanhu’s Formula for Embryonic Breathing**\nThe Great Dao takes emptiness as its root and the absence of form as its subtlety. Returning to the primordial, settling into quiescence and primordial simplicity, one draws qi into the cinnabar field, refines the spirit in the golden chamber, and stabilizes the heart in the ocean of awareness. When the heart is settled, the spirit is at peace; when the spirit is at peace, the qi abides; when the qi abides, the heart naturally rejoices. Constantly, within the hundred divisions of the day, one contains and guards the true breath.\n\nIt is also said: when spirit and breath settle, metal and wood intermingle; when heart and intention are at peace, dragon and tiger meet—this is the true function of the inner elixir and embryonic breathing. For those who cultivate the Dao, if they wish for long life without death, they must first refine the heart.\n\nThe Perfected One said: The heart lies one inch and three fen below the lungs. It is called the Jade Kettle, within which dwells a single qi of empty whiteness. The Scripture says: \"From emptiness white arises\"—it is called by one name the Jade Kettle, by another the Spirit Chamber, by another the Jade Palace, by another the Crimson Palace. Within it dwells the Heavenly Worthy Who Saves from Suffering, the deathless spirit, the Heavenly Worthy of Numinous Treasure, the talisman of the Primordial Beginning, the Perfected One of Grand Unity, and the Perfected One Who Saves from Suffering. Constantly uphold the primordial qi, never allowing it to scatter. When the cinnabar sand coalesces, it is as large as a millet grain, its color like yellow gold—it is called the Precious Jade. If one can recognize, distinguish, and apprehend it, sealing the six gates and ever guarding the celestial truth, embryonic breathing forms of itself, and one may prolong life for ages without dying.\n\n**Yuan Tiangang’s Formula for Embryonic Breathing**\nYin and yang are the true qi of Heaven and Earth. One yin, one yang, they give birth to the myriad things. In humans they are the qi of inhalation and exhalation; in Heaven they are the qi of cold and heat. It is also said: these two can alter the qi of the four seasons—this is the wu and ji that enclose and conceal the true qi.\n\nIt is said: when spring arrives in the xun position, it can bring forth the myriad things; when summer arrives in the kun position, it can nurture the myriad things; when autumn arrives in the qian position, it can ripen the myriad things; when winter arrives in the gen position, it can contain the myriad things. All these are the rising and descending, the emerging and submerging of yin and yang in their numinous function. Thus yang qi emerges from water and flourishes in wood; yin qi emerges from fire and flourishes in metal. Yang is born at zi and emerges at mao; yin is born at wu and enters at you. These four cardinal points are the gates and doors of Heaven and Earth.\n\nThe Great Dao must draw upon the correct qi of the four seasons. In all cultivation, movement and breath are yin; stillness and breath are yang. In practice, one must attain settled heart, settled strength, settled spirit, and settled breath—then dragon and tiger will intimately meet, and the sacred embryo will form. This is called the embryonic breathing of the Perfected One.\n\n**The Formula for Embryonic Breathing of the Perfected One**\nIn all cultivation, first settle the heart and qi. When heart and qi are settled, the spirit congeals; when the spirit congeals, the heart is at peace; when the heart is at peace, the qi ascends; when qi ascends, the realm is empty; when the realm is empty, there is clarity and stillness; when there is clarity and stillness, there is nothingness; when there is nothingness, life is whole; when life is whole, the Dao arises; when the Dao arises, forms are severed; when forms are severed, awareness is luminous; when awareness is luminous, the spirit is penetrating.\n\nThe Scripture says: \"When the heart is penetrating, the myriad methods are all penetrating; when the heart is still, the myriad methods are all extinguished.\" This is the true concentration of the Tathāgata. For those who cultivate the Dao, first cultivate the method of settling the heart. Once the method of settling is attained, the returned elixir is not far, the golden liquid is not distant—immortality is achieved.\n\n**Master Xu Shen’s Formula for Embryonic Breathing**\nThe spirit is the function of the empty and primordial; the breath is the function of the primordial qi. Refine away the boundaries of the dusty world—whether right or wrong, self or others, wealth or beauty, grasping or relinquishing, enmity or kinship—all are equal and uniform. Naturally, protection and assistance arise, and the Dao-heart is accomplished.\n\nThe Scripture says: \"The spirit is the function of emptiness.\" Essence, qi, and spirit—these three are the numinous terrace. For those who cultivate, if the three of breath, settled essence, qi, and spirit are attained, one may live long without dying and become an immortal who transcends the world—this is no empty claim.\n\n**Master Yanluo’s Formula for Embryonic Breathing**\nThat which moves is originally moving; that which is still is originally still. In ancient times, there was originally no movement or stillness—movement and stillness share a single source. Yet because all sentient beings are deluded and their thoughts unsettled, the sages left teachings to instruct people in settling the breath. When the spirit follows the settled breath, and the qi abides, the spirit settles. If the qi moves, the heart moves; if the heart moves, the spirit is wearied.\n\nFor those who cultivate the Dao, if they do not practice embryonic breathing, there remains the source of movement and stillness—how then can they enter the gate of non-action? They will lose their way.\n\n**Damo Chan Master’s Formula for Embryonic Breathing**\nTo refine embryonic breathing is to refine qi and settle the heart. Constantly breathe at the heart-wheel, then one does not cling to the myriad things. If the qi is unsettled, even Chan is empty. If the qi is settled, the colored body is free from illness, and both Chan and the Dao are at peace.",
      "overlap_context": "he five viscera and digests the five grains—unable to return yin to yang, to replenish blood and marrow.\"\n\nThe Master said: \"I take spirit as my chariot and qi as my steed, driving them ceaselessly without weariness.\"\n\nThe Scripture says: \"When the world possesses the Dao, even horses are retired to fertilize fields.\" This is precisely its meaning.\n\nMaster Yin the Perfected said: \"When spirit can govern qi, the nose ceases to breathe.\" This saying is most profound.\n\nThe method of governing qi...",
      "start_char": 668,
      "end_char": 1920,
      "start_sentence": 33,
      "end_sentence": 86,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.24562931060791,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\诸经圣胎神用诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "修行之人，因不守心，元炁失了不收，道怎成矣。 古人云，炁定心定，炁凝心静，是大道之要，又名还丹。 道人无诸挂念，日日如斯，则名真定禅观。 故三世贤圣修行皆在此诀，名为禅定双修也。 李真人胎息诀讳子明 夫胎息真炁者，入於一净室，焚香面壁，束南结踟趺坐，心无挂念，意无所思，澄神定息，常於遍身观之，自然通畅。 诸学之人不得全闭定炁，全闭则伤神，但量自家息之长短，放炁出入，不得自耳闻之，如此则妙也。 若常常调息，不出不入，久而在於丹田，固守在之者，名为真胎也。 道必成矣！ 抱朴子胎息诀 凡修行之人，须要定息。 息者，正也，安也，顺也，归也，伏也，宁也，静也。 若四威仪中，常作如是，决入真道。 勿着诸境，虚心实腹，最为妙也。 但澄息心定，心定则炁寂，炁寂则神静，神静则境空，境空则寂灭，寂灭则无事，无事则清静，清静则道生，道生则自然，自然则逍遥，既入逍遥，则无量自在，得做神仙。 自然五行总聚，六炁和合，八卦配偶，成於内丹，身形永劫不坏矣。 亢仓子胎息诀 凡修炼入道，息心勿乱精神，勿泄息神，勿惕息仟，勿出息言，勿语息血，勿滞息唾，勿远息涕，勿弃息慎，勿恼息神，勿忧息怨，勿念息我，勿争息害，勿记若人，行住坐外，常持如是，其心自乐，自然成就，不修此理，枉费其功，终无成法，但日日如是，其丹必就，若动静双忘，道不求自得矣。 元宪真人胎息诀 夫学无为胎息者，只是本清静心也，亦名真如，本无物也。 有若太虚相似，无去无来，无上无下，非动非静，寂寂寥寥，与真空同体，与大道同源，与本面目相逢者也。 若修大道，当修无为，其心清虚，寂而无寂，静而无静，心澄境谢，心境双忘，则入无为真道也。 学道之人，若修如是法门，则其丹自成，自然炁定而得胎息矣。 何仙姑胎息诀 夫炼者，修也，息者，熙也，神也，精也。 息炁本源者，清静真炁也。 观入丹田，细细出入。 如此者，龙虎自伏，若心无动，神无思，熙无欲，则名日太定。 真炁存於形质，真仙之位，变化无穷，号日真人矣。 夫胎息者，须存神定意，抱守三关者，精炁神也。 凡修行之人，须每於六时，常抱守三法，则自然有宝聚也。 国富民安，心王自在，乃神和畅，少病也，少恼也，身体轻便也，耳目聪明也。 是修真之人，真道径路。 若三五年间，常行此法，天护佑，神加持，凡人爱敬，久而自然得道矣。 玉云张果老胎息诀 夫胎者，受生之宫也。 息炁纳於元海，在母脐下一寸三分，名日丹田。 受真精成形，纳天地之炁，一月如珠，二月如露，三月如桃李，此名淳和之炁，朴也。 子在母胞胎之中，母呼则呼，母吸则吸，至於十月炁足而生，六情转於外，岂於返视元初，不守内息，故有生死。 故圣人云：我不纵三尸，六情常息於丹田，守而无退。 凡修道之人，先修心静之门。 又云：了心修道，则省力而易成，不了心而修道，修道者，返费功而无益，先了心源，然后自定，自然龙虎伏，观仙道必成矣。 夫丹田者，在脐下一寸三分，是元炁之宫位，管三百六十坐精光神，守护元炁。 内有神龟一坐，吐纳元炁，往来呼吸，一昼一夜，一万三千五百息，皆元炁，於口鼻中泄出，故引入邪炁所侵而生病也。",
      "translated_text": "For cultivators who fail to guard the heart, the primordial qi scatters and cannot be gathered—how then can the Dao be accomplished? The ancients said: when qi is settled, the heart is settled; when qi congeals, the heart is still—this is the essence of the Great Dao, also called the Returned Elixir. The Daoist, free from all attachments, practices thus daily, and this is called true samādhi and contemplation. Thus, the sages and worthies of the three times all cultivated by this method, known as the dual cultivation of Chan and samādhi.\n\n**Li Zhenren’s Embryonic Breathing Formula (Taboo Name: Ziming)**\nFor true embryonic breathing, enter a pure chamber, burn incense, face the wall, sit cross-legged with the soles of the feet turned upward, free the heart from attachments, and empty the mind of thoughts. Calm the spirit and settle the breath, constantly observing it throughout the body—naturally, it will flow unimpeded. Learners must not fully close the breath, for complete closure harms the spirit. Instead, gauge the length of one’s own breath, allowing qi to enter and exit without being heard by the ear—this is the subtle method. If one constantly regulates the breath, neither exhaling nor inhaling, and over time abides in the cinnabar field, firmly guarding it, this is called true embryonic breathing. The Dao will surely be accomplished!\n\n**Baopuzi’s Embryonic Breathing Formula**\nAll cultivators must settle the breath. Breath is correctness, peace, harmony, return, submission, tranquility, and stillness. If one constantly practices thus in the four dignified postures, one will surely enter the true Dao. Do not cling to any realm; empty the heart and fill the abdomen—this is most subtle. Simply calm the breath and settle the heart: when the heart is settled, qi becomes quiescent; when qi is quiescent, the spirit becomes still; when the spirit is still, the realm becomes empty; when the realm is empty, there is extinction; when there is extinction, there is no affair; when there is no affair, there is purity; when there is purity, the Dao arises; when the Dao arises, there is spontaneity; when there is spontaneity, there is freedom. Having entered freedom, there is boundless ease, and one becomes an immortal. Naturally, the Five Agents gather, the Six Qi harmonize, the Eight Trigrams pair, and the inner elixir is formed. The body and form endure forever without decay.\n\n**Kang Cangzi’s Embryonic Breathing Formula**\nIn all cultivation and entry into the Dao, quiet the heart and do not disturb the spirit; do not leak qi and scatter the spirit; do not startle the breath and trouble the body; do not speak and exhaust the breath; do not speak and deplete the blood; do not stagnate the breath and swallow; do not distance the breath and weep; do not abandon the breath and act carelessly; do not anger the breath and disturb the spirit; do not worry the breath and harbor resentment; do not think of the breath and cling to the self; do not contend and harm the breath; do not remember others. In walking, standing, sitting, and lying down, constantly maintain this practice—the heart will naturally be joyful, and accomplishment will come of itself. Without cultivating this principle, one wastes effort and will never succeed. But if one practices thus daily, the elixir will surely be formed. When movement and stillness are both forgotten, the Dao is attained without seeking.\n\n**Yuan Xian Zhenren’s Embryonic Breathing Formula**\nThose who study non-action embryonic breathing cultivate only the originally pure heart, also called true suchness, which is fundamentally empty. It resembles the great void: without going or coming, without above or below, neither moving nor still, utterly silent and vast, of the same body as true emptiness, of the same source as the Great Dao, and meeting the original face. If one cultivates the Great Dao, one should cultivate non-action. The heart is clear and empty, quiescent yet without quiescence, still yet without stillness. When the heart is settled and the realm fades, when both heart and realm are forgotten, one enters the true Dao of non-action. If cultivators practice this method, the elixir will form of itself, and naturally, qi will settle, achieving embryonic breathing.\n\n**He Xiangu’s Embryonic Breathing Formula**\nRefinement is cultivation; breath is harmony, spirit, and essence. The root of breathing qi is the pure and tranquil true qi. Observe it entering the cinnabar field, exhaling and inhaling subtly. Thus, the dragon and tiger are naturally subdued. If the heart is without movement, the spirit without thought, and harmony without desire, this is called the Great Samādhi. When true qi abides in the form, one attains the rank of a true immortal, with boundless transformations, and is called a true person. For embryonic breathing, one must preserve the spirit and settle the intent, embracing and guarding the Three Passes—essence, qi, and spirit. All cultivators must constantly embrace and guard these three methods in every period of the day, and naturally, treasures will gather. The nation will be prosperous and the people at peace; the heart-king will be free, the spirit harmonious and smooth, illness rare, vexations few, the body light and agile, the ears sharp and the eyes bright. This is the direct path of true cultivation. If one practices this method for three to five years, heaven will protect, spirits will aid, and ordinary people will love and respect. Over time, one will naturally attain the Dao.\n\n**Yu Yun Zhang Guolao’s Embryonic Breathing Formula**\nThe embryo is the palace of conception. Breathing qi is received in the primordial sea, one inch and three fen below the navel, called the cinnabar field. There, true essence forms the body, receiving the qi of heaven and earth. In the first month, it is like a pearl; in the second, like dew; in the third, like a peach or plum—this is called the pure and harmonious qi, the uncarved block. While the child is in the mother’s womb, when the mother exhales, it exhales; when the mother inhales, it inhales. By the tenth month, the qi is full, and it is born. The six senses turn outward, no longer returning to the original state, failing to guard the inner breath—thus, there is birth and death. Therefore, the sage said: “I do not indulge the Three Corpses; the six senses constantly rest in the cinnabar field, guarding without retreat.” All cultivators must first cultivate the gate of heart-stillness. It is also said: “Understanding the heart and cultivating the Dao saves effort and is easily accomplished. Without understanding the heart and cultivating the Dao, one wastes effort to no avail.” First, understand the source of the heart, then naturally settle. The dragon and tiger will be subdued, and the immortal Dao will surely be accomplished. The cinnabar field lies one inch and three fen below the navel—it is the palace of primordial qi, governing the three hundred and sixty spirits of radiant essence, guarding and protecting the primordial qi. Within it sits a divine turtle, inhaling and exhaling primordial qi. In one day and night, there are thirteen thousand five hundred breaths, all of primordial qi, which leak out through the mouth and nose, allowing pathogenic qi to invade and cause illness.",
      "overlap_context": " embryonic breathing, there remains the source of movement and stillness—how then can they enter the gate of non-action? They will lose their way.\n\n**Damo Chan Master’s Formula for Embryonic Breathing**\nTo refine embryonic breathing is to refine qi and settle the heart. Constantly breathe at the heart-wheel, then one does not cling to the myriad things. If the qi is unsettled, even Chan is empty. If the qi is settled, the colored body is free from illness, and both Chan and the Dao are at peace.",
      "start_char": 1920,
      "end_char": 3185,
      "start_sentence": 87,
      "end_sentence": 130,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.7916464805603,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\诸经圣胎神用诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "丹田者，生炁之源，一名丹田，二名精路，三名炁海，四名守宫，五名大源，六名神室，七名元藏，八名采宝，九名戊己，十名本根。 皆是太和元炁居止之处，若存精炁於丹田，则得长生久视之道。 凡修行之人，行住坐外常含纳真息於丹田，则得元炁成实，久炼而成仙矣。 斯乃真人之胎息者也。 侯真人胎息诀 夫真一法界者，不离於本源。 本源者，则是一心也。 不动不行，心则是源，不停不住，源则是心。 其心清静，则成大药，其心惑乱，则成大贼。 夺其精，盗其神，败其炉，失其药，患其身，丧其命也。 凡在道之人，必先修心静之法。 但於心静，必得定心。 心定则神安，铅汞相投，龙虎亲也。 周天数足，添精益炁养神，此三法若全，则万神感会於丹田，血炁周流於遍体，逍遥於长生之道。 又云：如何清静？ 当澄其神，绝其虑，亡其我，灭其境，抱其真，此谓妙静之道。 鬼谷子胎息诀 凡修道之人，返本还纯，内合真炁，故道返，则四象、五行、六炁、七元、八卦而炼精炁神成其形质，则是虚中取实，无中取有，而内秘真丹也。 故炼心为神，炼精为形，炼炁为命，此是阴阳升降之炁也。 炁源者，命之根也。 故修三法则大道也。 黄帝胎息诀 凡修道者，常行内观，遣去三尸，出於六情，返内存三，心神守官，炁闭不散，诸神欢畅，养炁炼形存性，此三法不可弃，是真一胎息也，玄关大药也。 陈希夷胎息诀 夫道化少，少化老，老化病，病化死，死化神，神化万物。 炁化生灵，精化成形，神炁精三化，炼成真仙。 故云存精、养神、炼炁，此乃三德之神，不可不知，子午、卯酉、四时，乃是阴阳出入之门户也。 定心不动谓之日禅，神通万变谓之曰灵，智通万事谓之日慧，道元合炁谓之曰修，真炁归源谓之日炼，龙虎相交谓之曰丹，三丹同契谓之曰了。 若修行之人，知此根源，乃可入道近矣。 逍遥子胎息诀 夫修者，志也，养也； 养者，颐也，伏也，真也。 凡欲养息，先须养精，凡欲养精，先须养神，凡欲养神，先须养性，凡欲养性，先须养命。 性命者，乃是神炁也，魂魄也，阴阳也，离坎也。 久而行之，结成圣胎，乃真胎息也。 张天师胎息诀 夫元炁无形，真心无法，大道无迩，唯炼息一法，乃含真道。 又云心定、炁定、神定，凡修道流，若合大丹元道，清虚寂静，绝虑忘意，空静无物，万法无踪，真修胎息也，成仙无疑也。 郭真人胎息诀 夫炼者，修也，养也，虚也。 耳不听也，眼不见也，鼻不闻也，舌不味也，息炁定心也。 此法从不有中有，不无中无，不色中色，不空中空，非有为有，非无为无，非色为色，非空为空，此乃真胎息养熙调神之法。 又云视不见我，听不得闻，离种种边，名为妙道。 此法最为上也。 中央黄老君胎息诀 夫本立天地，生於阴阳，清炁为天，浊熙为地，清炁为心，浊熙为肾。 被世牵惹，引动人心，故清浊不分也。 怎晓此理哉！ 每动作处，经行处，眼见耳闻，五贼送了真元，眼送与心，心动神疲； 又被耳送与心，心送音声入肾，神劳心烦，坏了也。 若动念则泄真炁，故胎息不成矣。 如何得成？ 若人静坐念心不动，息念忘情，炁神调匀，久而自成仙矣。 柳真人胎息诀 夫人往往在世问，不知自身日用物所造化也。",
      "translated_text": "The cinnabar field is the source of generative qi. It has ten names: first, *cinnabar field*; second, *essence-path*; third, *qi-sea*; fourth, *guardian palace*; fifth, *great source*; sixth, *spirit chamber*; seventh, *primordial treasury*; eighth, *treasure-gathering*; ninth, *wu-ji* (戊己); and tenth, *root origin*. All are the dwelling place of grand harmony and primordial qi. If one stores essence and qi within the cinnabar field, one attains the Dao of longevity and enduring vision.\n\nAll practitioners must constantly contain and absorb true breath within the cinnabar field during movement, stillness, sitting, and rest. Thus, primordial qi becomes substantial, and through long refinement, one becomes an immortal. This is the true adept’s *embryonic breathing*.\n\n**Master Hou’s Embryonic Breathing Formula**\nThe realm of true unity does not depart from its source. The source is the One Heart. When the heart does not move or act, it is the source; when the source does not halt or abide, it is the heart. If the heart is pure and still, it becomes the great elixir; if the heart is deluded and chaotic, it becomes the great thief—seizing one’s essence, stealing one’s spirit, ruining one’s furnace, losing one’s elixir, harming one’s body, and forfeiting one’s life.\n\nAll Dao practitioners must first cultivate the method of stilling the heart. Through heart-stilling, one attains a settled mind. When the mind is settled, the spirit is at peace; lead and mercury unite, and dragon and tiger become intimate. When the celestial cycle is complete, essence is replenished, qi is augmented, and the spirit is nourished. If these three methods are perfected, the myriad spirits gather in the cinnabar field, blood and qi circulate throughout the body, and one roams freely in the Dao of longevity.\n\nIt is also said: How does one attain purity and stillness? By clarifying the spirit, cutting off thoughts, dissolving the self, extinguishing external realms, and embracing the true—this is the wondrous Dao of stillness.\n\n**Master Guiguzi’s Embryonic Breathing Formula**\nAll Dao practitioners return to their origin and restore purity, inwardly uniting with true qi. When the Dao returns, the four images, five phases, six qi, seven origins, and eight trigrams refine essence, qi, and spirit to form their substance. This is taking the substantial from the void, the existent from the nonexistent, and inwardly concealing the true elixir.\n\nThus, refining the heart produces spirit, refining essence produces form, and refining qi produces life—these are the ascending and descending qi of yin and yang. The source of qi is the root of life. Therefore, cultivating these three methods is the great Dao.\n\n**The Yellow Emperor’s Embryonic Breathing Formula**\nAll Dao practitioners must constantly practice inward contemplation, dispelling the three corpses and transcending the six emotions. They return inwardly to preserve the three treasures, with the heart-spirit guarding its palace and qi sealed without dissipation. The myriad spirits rejoice, qi is nourished, form is refined, and nature is preserved. These three methods cannot be abandoned—they are the true unity of embryonic breathing and the great elixir of the mysterious pass.\n\n**Master Chen Xiyi’s Embryonic Breathing Formula**\nThe Dao transforms youth into age, age into illness, illness into death, death into spirit, and spirit into the myriad things. Qi transforms into living beings, essence transforms into form, and the three—spirit, qi, and essence—refine into true immortals.\n\nThus, it is said: Preserve essence, nourish spirit, and refine qi—these are the three divine powers, which one must not fail to know. Zi-wu (子午), mao-you (卯酉), and the four seasons are the gates of yin and yang’s entry and exit. A settled mind unmoving is called *chan* (meditation); spirit penetrating myriad changes is called *ling* (numinous); wisdom comprehending all matters is called *hui* (wisdom); the Dao’s origin uniting with qi is called *cultivation*; true qi returning to its source is called *refinement*; dragon and tiger uniting is called *elixir*; and the three elixirs harmonizing is called *completion*. If practitioners know this root source, they may draw near to the Dao.\n\n**Master Xiaoyaozi’s Embryonic Breathing Formula**\nCultivation is resolve and nurturance; nurturance is sustenance, concealment, and truth. To nurture breath, one must first nurture essence; to nurture essence, one must first nurture spirit; to nurture spirit, one must first nurture nature; to nurture nature, one must first nurture life. Nature and life are spirit and qi, hun and po, yin and yang, *li* and *kan*. Through prolonged practice, the sacred embryo forms—this is true embryonic breathing.\n\n**Master Zhang the Celestial Master’s Embryonic Breathing Formula**\nPrimordial qi is formless, the true heart is lawless, and the great Dao is not near. Only the method of refining breath contains the true Dao.\n\nIt is also said: When heart is settled, qi is settled, and spirit is settled, all Dao practitioners who unite with the primordial Dao of the great elixir—cleansing emptiness, stilling thoughts, forgetting intentions, and abiding in quiescence without phenomena—engage in true embryonic breathing and will undoubtedly become immortals.\n\n**Master Guo’s Embryonic Breathing Formula**\nRefinement is cultivation, nurturance, and emptiness. The ears do not hear, the eyes do not see, the nose does not smell, the tongue does not taste, and breath and qi settle the heart. This method arises from non-being into being, from non-existence into existence, from non-form into form, from non-emptiness into emptiness. It is not being as being, not non-being as non-being, not form as form, not emptiness as emptiness—this is the true method of embryonic breathing, nurturing harmony, and regulating the spirit.\n\nIt is also said: Seeing without perceiving the self, hearing without attaining sound, transcending all extremes—this is called the wondrous Dao, the highest method.\n\n**The Central Yellow-Old Lord’s Embryonic Breathing Formula**\nThe root of heaven and earth arises from yin and yang. Pure qi becomes heaven, turbid qi becomes earth; pure qi becomes the heart, and turbid qi becomes the kidneys. Yet worldly entanglements stir the human heart, causing pure and turbid to remain undivided.\n\nHow can one comprehend this principle? In every action, movement, sight, and sound, the five thieves steal one’s true origin: the eyes transmit to the heart, and the heart’s movement wearies the spirit; the ears transmit to the heart, and the heart conveys sounds to the kidneys, exhausting the spirit and vexing the heart—thus, all is ruined. If thoughts stir, true qi leaks, and embryonic breathing cannot form.\n\nHow then can it be achieved? If one sits in stillness, thoughts unmoving, breath forgotten, and emotions stilled, qi and spirit harmonize, and through prolonged practice, one naturally becomes an immortal.\n\n**Master Liu’s Embryonic Breathing Formula**\nPeople often live in the world yet do not know what daily phenomena create within themselves.",
      "overlap_context": "al Dao will surely be accomplished. The cinnabar field lies one inch and three fen below the navel—it is the palace of primordial qi, governing the three hundred and sixty spirits of radiant essence, guarding and protecting the primordial qi. Within it sits a divine turtle, inhaling and exhaling primordial qi. In one day and night, there are thirteen thousand five hundred breaths, all of primordial qi, which leak out through the mouth and nose, allowing pathogenic qi to invade and cause illness.",
      "start_char": 3185,
      "end_char": 4456,
      "start_sentence": 131,
      "end_sentence": 185,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.61485314369202,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\诸经圣胎神用诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "噫！ 乃上天之炁也。 元精不衰，物结成器，上依天之清炁，聚而成形，下接地之浊炁，凝而成体。 内包一真，世人不识，故泄於外，乃精炁神也。 若不守此三者，老死近矣。 圣人常不离此三法，行住坐卧，久结成胎，神仙矣。 颂曰：为人在世不知根，一向贪心弃本真。 不管元阳真息炁，至今天怒病缠身。 骊山老母胎息诀 经云：天地万物之盗，万物人之盗，人万物之盗。 故三盗相反，走失了真熙精神也，不成胎息。 若修行之人，不爱万物，自不盗你本性也。 故云：本分道人，我不要你底，你不要我底，只守分。 守分者，何也？ 乃是不出不入，常守本源，不动不静，不来不去似有似无，是个死的活人。 仙道近矣！ 李仙姑胎息诀 夫世问之人，奉道持修，须要朝真谢罪。 每於庚申甲子之日，父母远忌之辰，三元八节之日，宜修斋醮者，神天佑护。 更若每日清静无事，澄心静坐，调神养炁，不离本室，自然三宫升降，六气周流，百脉通行，万物齐会於黄庭。 黄庭者，乃中宫也。 若常守於中宫，精炁不走，此乃真胎息也。 天台道者胎息诀 凡人修炼，常行平等忍辱，一屏邪心所起，真心志坚，运心肾二炁，上下往来，交媾於中宫。 诸神不散，温养元炁，丹砂黄芽自出，深根固蒂，永息绵绵，久而长生，出世得道矣。 刘真人胎息诀 若修胎息元道之法，心不杀、不欲、不盗、不偷、不邪、不妄、不颊、不狂，心自明朗，常守斋戒，真息常调，观照遍身世界。 身心清静，乃是长生。 道人若金坑宝贝坚实，六门不开，邪炁不入，一身无病患。 若六门不闭，盗尽金宝，人生疾也。 道自不成矣！ 颂曰：心中真炁是天英，正是神清炁镜明。 大道若依玄妙用，心中清静炁生灵。 一去一来不暂停，上下无休造化成。 神静炁澄无事染，这回息住自然灵。 后学之者，不息元道，妄念不停，生灭不息，随他物去了。 怎成胎息也？ 朗然子胎息诀 凡修行之人，焚香入室，静坐冥心，叩齿集神，定意马，伏心猿，都收在一处，放在丹田，令温养之。 内观勿出，如元帅行军。 神是主，炁是军。 炁到处神到，二物相逐，不得相离。 万病不干，千灾皆灭。 学道之人，若得此法，勤而行之。 今日贫道方泄天机，你若不行，我有殃矣。 百嶂内视胎息诀 且胎息者，世人不知，诸贤皆从证果。 若不得此法也，把不定，不得口诀，不得下手，不得亲传。 把手教着尚做不过，一等愚人，便待定心猿捉意马，往往空费其功夫，不成大事。 若真修炼之人，欲捉心猿收意马，先须调炁定息，然后澄心息虑忘情，乃可应也。 若不如是，则空过了时光日月。 不因师指，此事难知矣。",
      "translated_text": "Alas! This is the qi of the great heavens. When primordial essence does not decline, things coalesce into vessels: above, they rely on the heavens’ pure qi, gathering to form shape; below, they connect with the earth’s turbid qi, congealing to form substance. Within, they contain the One True, yet worldly people do not recognize it, thus leaking it outward—this is essence, qi, and spirit. If one does not guard these three, old age and death draw near. The sage never strays from these three methods: in movement and stillness, waking and sleeping, through long practice they coalesce into the embryo, and one becomes an immortal.\n\nA verse says:\nPeople live in the world yet know not their root,\nEver greedy, they cast aside their true origin.\nNeglecting the primordial yang and true breathing qi,\nThey incur heaven’s wrath and illness clings to the body.\n\n**The Embryonic Breathing Formula of the Old Mother of Mount Li**\nThe sutra states: Heaven and earth steal from the myriad things, the myriad things steal from humans, and humans steal from the myriad things. Thus, the three thieves oppose one another, scattering and losing the true radiance of spirit, and embryonic breathing cannot form. If the practitioner does not covet the myriad things, they will not steal your original nature. Therefore it is said: The true Daoist of one’s allotted portion—I do not take what is yours, and you do not take what is mine—only guard your portion. What is guarding one’s portion? It is neither issuing forth nor entering in, constantly guarding the original source, neither moving nor still, neither coming nor going, seemingly existent yet seemingly nonexistent—this is the living dead. Immortality is near!\n\n**The Embryonic Breathing Formula of Immortal Li**\nPeople of the world who uphold the Dao and maintain cultivation must pay homage to the true and repent of transgressions. On days of *gengshen* and *jiazi*, on the anniversaries of parents’ distant passing, and on the Three Primes and Eight Festivals, one should perform purification rites and offer sacrifices, so that the gods and heavens will protect and bless. Moreover, if each day one remains serene and untroubled, calming the heart and sitting in stillness, regulating spirit and nurturing qi, never leaving the inner chamber, then naturally the Three Palaces will ascend and descend, the Six Qi will circulate, the hundred meridians will flow unimpeded, and the myriad things will gather in the Yellow Court. The Yellow Court is the Central Palace. If one constantly guards the Central Palace, essence and qi will not leak—this is true embryonic breathing.\n\n**The Embryonic Breathing Formula of the Daoist of Mount Tiantai**\nIn cultivation, one must always practice equanimity and forbearance, utterly rejecting the arising of deviant thoughts, with true heart and resolute will. Circulate the qi of heart and kidneys, moving them up and down to unite in the Central Palace. Let the various spirits not scatter, warmly nurture the primordial qi, and cinnabar and the yellow sprout will naturally emerge. Deep roots and firm stems yield perpetual breathing, and through long practice, one attains longevity, leaves the world, and achieves the Dao.\n\n**The Embryonic Breathing Formula of Master Liu**\nIn practicing the primordial method of embryonic breathing, the heart must not kill, not desire, not steal, not covet, not be deviant, not be deluded, not be arrogant, not be reckless. The heart becomes bright and clear, and by constantly maintaining purification and precepts, true breathing is ever regulated, and illumination pervades the body and world. When body and heart are pure and still, this is longevity. The Daoist is like a gold mine or a treasure trove—firm and solid. If the Six Gates do not open, deviant qi cannot enter, and the whole body remains free of illness. If the Six Gates are not closed, thieves will plunder the golden treasure, and one will fall ill. The Dao will not be achieved!\n\nA verse says:\nThe true qi within the heart is heaven’s essence,\nJust when spirit is clear and qi is like a mirror.\nIf the great Dao relies on its wondrous function,\nWithin the heart’s purity, qi gives birth to the numinous.\nGoing and coming without pause,\nAbove and below ceaselessly, creation is accomplished.\nWhen spirit is still and qi is settled, untouched by affairs,\nThis time, breathing abides and the natural numinous arises.\n\nThose who study later but do not rest in the primordial Dao, whose idle thoughts never cease, whose arising and ceasing never end, will be swept away by external things. How can embryonic breathing be achieved?\n\n**The Embryonic Breathing Formula of Langranzi**\nIn cultivation, one must burn incense, enter the chamber, sit in stillness, and empty the heart. Knock the teeth to gather the spirits, stabilize the mind-horse, and subdue the heart-monkey, collecting them all in one place and settling them in the Cinnabar Field to warm and nurture them. Inwardly observe without issuing forth, like a general leading an army. Spirit is the commander, qi is the army. Where qi goes, spirit follows; the two move together and must not be separated. A thousand disasters are extinguished, and ten thousand illnesses do not afflict. If the practitioner of the Dao attains this method and diligently practices it—today this poor Daoist reveals the celestial mechanism. If you do not practice it, I will incur misfortune.\n\n**The Embryonic Breathing Formula of Inward Vision within the Hundred Peaks**\nEmbryonic breathing is unknown to worldly people, yet all worthies attain realization through it. Without this method, one cannot hold fast; without the oral transmission, one cannot begin; without direct instruction, one cannot proceed. Even if guided by hand, one may still fail to master it. Some foolish people attempt to stabilize the heart-monkey and capture the mind-horse, yet waste their efforts in vain, accomplishing nothing. If the true cultivator wishes to capture the heart-monkey and subdue the mind-horse, they must first regulate qi and settle breathing, then calm the heart, still thoughts, and forget emotions—only then can they succeed. Without doing so, time and days pass in vain. Without a teacher’s guidance, this matter is difficult to know.",
      "overlap_context": "nds to the kidneys, exhausting the spirit and vexing the heart—thus, all is ruined. If thoughts stir, true qi leaks, and embryonic breathing cannot form.\n\nHow then can it be achieved? If one sits in stillness, thoughts unmoving, breath forgotten, and emotions stilled, qi and spirit harmonize, and through prolonged practice, one naturally becomes an immortal.\n\n**Master Liu’s Embryonic Breathing Formula**\nPeople often live in the world yet do not know what daily phenomena create within themselves.",
      "start_char": 4456,
      "end_char": 5483,
      "start_sentence": 186,
      "end_sentence": 237,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.20716381072998,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\诸经圣胎神用诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "曹仙姑胎息诀 且胎息者，非方卫之所能为。 为者，则失道远矣。 且人之生也，须以神存炁留道生，神与炁二者相须，乃成性命。 虚者通灵而光明，和者周流而柔润，神安则炁畅，炁畅则血融，血融则骨强，骨强则髓满，髓满则腹盈，腹盈则下实，下实则行步轻健，行步轻健则动作不疲，四肢康强，犹国之封域平泰，炁血和盛，犹国之府库充实，譬人家富，神志和悦，颜色自怡，行步歌舞，仙道近矣。 故曰：今人念佛念道，只要除灾救祸，不如志念除妄。 还好么？ 达人观斯而行之，自成胎息者矣。 诸真圣胎神用诀竟",
      "translated_text": "**Cao the Immortal Maiden’s Embryonic Breathing Formula**\n\nEmbryonic breathing cannot be achieved through mere methods or techniques. Those who attempt it by such means stray far from the Dao. When a person is born, the spirit must be preserved, qi retained, and the Dao cultivated—spirit and qi depend upon each other to complete one’s nature and life. Emptiness allows the numinous to flow freely and radiance to shine; harmony circulates smoothly and nourishes with softness. When the spirit is at peace, qi flows unimpeded; when qi flows unimpeded, the blood harmonizes; when the blood harmonizes, the bones strengthen; when the bones strengthen, the marrow fills; when the marrow fills, the abdomen swells; when the abdomen swells, the lower body solidifies; when the lower body solidifies, one’s steps become light and vigorous; when steps are light and vigorous, movement brings no fatigue; when the four limbs are healthy and strong, it is like a nation’s borders at peace and prosperous. When qi and blood are harmonious and abundant, it is like a nation’s treasuries full. It is like a wealthy household—spirit and will are harmonious and joyful, the complexion naturally brightens, and one’s steps become like dancing. The Dao of immortality is near.\n\nThus it is said: Today’s people recite the Buddha’s name or invoke the Dao only to avert disaster and seek blessings, yet they would do better to focus their minds on eliminating delusion. Is this not excellent? Those of insight who observe and practice this will naturally achieve embryonic breathing.\n\n**Here ends the formula for the embryonic spirit’s application, as transmitted by the perfected sages.**",
      "overlap_context": "may still fail to master it. Some foolish people attempt to stabilize the heart-monkey and capture the mind-horse, yet waste their efforts in vain, accomplishing nothing. If the true cultivator wishes to capture the heart-monkey and subdue the mind-horse, they must first regulate qi and settle breathing, then calm the heart, still thoughts, and forget emotions—only then can they succeed. Without doing so, time and days pass in vain. Without a teacher’s guidance, this matter is difficult to know.",
      "start_char": 5484,
      "end_char": 5721,
      "start_sentence": 238,
      "end_sentence": 246,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.859667778015137,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\诸经圣胎神用诀.txt",
        "category": "方法类"
      }
    }
  ]
}