{
  "source_id": "还丹显妙通幽集",
  "source_file": "chunked_daozang\\还丹显妙通幽集.json",
  "total_chunks": 4,
  "total_original_chars": 3602,
  "total_translated_chars": 21583,
  "total_translation_time": 124.54005789756775,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\方法类\\还丹显妙通幽集.txt",
    "category": "方法类"
  },
  "full_translation": "*The Revealed Wondrous and Profound Collection of the Returned Elixir*\n*Sutra Title:* *The Revealed Wondrous and Profound Collection of the Returned Elixir*\nOne scroll, originally attributed to Qianzhenzi of Shaoshi Mountain; likely composed during the Northern Song. Source text: *Daoist Canon of the Zhengtong Era*, *Dongzhen* section, Methods category.\n\n**Preface to *The Revealed Wondrous and Profound Collection of the Returned Elixir***\n\nThose who fix their minds on the elixir and exhaust their thoughts on the Yellow Sprout, yet fail to comprehend lead and mercury, squander their treasures in vain. Some seek the frost of a hundred herbs, hoping to master refinement; others compound the five alums, striving for transformation. Yet they waste years of effort, never grasping the essence of lead and mercury.\n\nFrom my youth, I have been deeply concerned for the talents of others. Beyond my thirtieth year, I encountered the supreme Dao. Having awakened to the subtleties of *xiyi* (profound stillness), I at last understood the mysteries of *huanghu* (the indistinct and evanescent). When the Yellow Emperor ascended and ruled by non-action, when Liu An rose and abandoned the rat—these were not empty legends, but truths confirmed by near evidence.\n\nThus, the enlightened have instructed me: The Dragon and Tiger are Metal and Water; Metal and Water are lead and mercury; lead and mercury are yin and yang; yin and yang are *kan* and *li*; *kan* and *li* are husband and wife; husband and wife are male and female. Though they originate from a single source, they diverge into many names—like the Sovereign, who is one yet called by different titles.\n\nI have observed how people of this world seek the Tiger in *geng* and *xin*, pursue the Dragon in *jia* and *yi*, unaware that the Dragon dwells in *geng* and *xin*, while the Tiger resides in *jia* and *yi*. Fire blazes in *ren* and *gui*, while Water abides in *bing* and *ding*. The sages of old never recorded these matters plainly, for this Way is ultimately simple.\n\nHence the adage: *\"The Dragon emerges from within Fire; the Tiger is born from within Water.\"*\nAnd again: *\"The Dragon does not dwell in the eastern Qi; the Tiger is not found in the western Rong.\"*\nAnd further: *\"When suddenly the Wood position transforms into Metal, this is the heart of the Great Elixir.\"*\n\nSuch is the truth.\n\nNow, by unforeseen fortune, I have delved into the profound texts. Humbly offering my meager talents, I emulate Yuanyangzi’s *Collection of Golden Liquor* by composing *Thirty Poems on the Revealed Wondrous and Profound* to await later gentlemen who share my aspirations, that they may verify and reflect upon them.\n\n*The Revealed Wondrous and Profound Collection of the Returned Elixir*\nBy Qianzhenzi of Shaoshi Mountain\n\n**The Poems Say:**\n\n**The Poems Say:**\n\nAt the first turning, arrange the Tiger to lead—\nFirst you must deeply enter cultivation within Water.\nAfter ten days, with intent refine Lead and Mercury,\nThen fire-temper the River Chariot, seeking it in *jia*.\n\nAt the second turning, arrange and listen to the One Spirit—\nBring it back to be simmered within Water.\nDiligently refine it in the Yang Cauldron,\nClad in blue robes, wed it to *geng*.\n\nAt the third turning, diligently cultivate in the North—\nFrom this, once unite Yin and Yang.\nWater steams, fire smelts—seventy-two times—\n*Ren* and *gui*, husband and wife, emerge from the bridal chamber.\n\nAt the fourth turning, cultivate for not yet ten weeks—\nOpen the furnace, part the cauldron like floating clouds.\nYou must wash and change into fresh, pure garments,\nLest dust and grime taint and pollute.\n\nAfter five turnings refining Lead and Mercury,\nThe Three Flowers exude fragrance like light crimson.\nOpen the furnace, draw forth the Water, then add more fire,\nAnd again arrange them to enter the *kan* palace.\n\nAt the sixth turning, continuously for over five months,\n*Geng*-husband and *jia*-wife are in close embrace.\nYou must ensure the sealing is firm and tight,\nLest Water flow within the furnace.\n\nWhen Metal and Water unite, they are not one body;\nWhere Tiger and Dragon intertwine, there is but a single form.\nThe immortals left this divine elixir formula:\nGrasp the white of the West and the blue of the East.\n\nThis single essence of numinous cinnabar belongs to the Four Spirits,\nWithin the furnace, a small Heaven and Earth.\nThe *Cantong Qi* clearly states it—\nHow many gates are there to the Divine Water and Flowery Pond?\n\nFrom of old, those of resolve refine cinnabar,\nBut this Way first requires recognizing Horse’s Teeth.\nWhen Dragon and Tiger unite, there is no other medicine—\nWho knows that the Yellow Emperor’s Golden Flower is most exquisite?\n\nThe sages conveyed this matter in veiled terms:\nLead and Mercury originally belong to the true East.\nThe woman, though strong, and the man, though yielding,\nAt once harmonize and enter the Central Palace.\n\nOnly the numinous cinnabar holds the deepest principle—\nThe One Yang must be sought within Water.\nDo not burn the hard, stubborn medicines of the world,\nFor surely you will fail and waste your gold.\n\nThe Crone of the West is a fetus within Fire,\nThe Vermilion of the East comes from within Water.\nOnly the Central Palace can achieve perfect unity,\nNever tainted by even a speck of dust.\n\nThe Supreme Way is not for ordinary minds to presume to know—\nWho has seen the Blue Dragon don a blue robe?\nThe Yellow Sprout is not resolved in the Black Quarter,\nAnd the yielding maiden must ultimately follow Fire in flight.\n\nThe divine formula of Golden Liquor is not one path—\nThe Flowery Pond’s subtlety is hard to discuss.\nRuler and minister, father and son return to the Central Earth,\nThe Blue Soul, after years, is wed to the Spirit.\n\nLead and Mercury have ever been of one true essence,\nYet scholars have long been deluded and confused.\nRely on you, sir, to carefully seek North and South—\nWater and Fire, though distinct in form, are the root of the medicine.\n\nWhen pure Yin is exhausted, pure Yang remains;\nWithin Earth it conceals the body, within Water it hides.\nIf it does not harmonize with the Five Phases,\nHow can it become the king among medicines?\n\nIf common folk wish to refine the Golden Elixir,\nFirst study the scriptures to recognize the Nine Returns.\nDo not toy with the Four Yellows or Eight Stones,\nFor you will never in your life reach the Three Mountains.\n\nFirst refine the Flowing Pearl into transforming cinnabar,\nThen bring it into the cauldron to unite with the Golden Flower.\nFools do not believe in the art of longevity—\nWhen the nine turnings are complete, do not boast.\n\nThe divine elixir is said to have many methods,\nBut swallows and sparrows cannot give birth to phoenixes.\nApart from true Lead and true Mercury,\nAll else fails to harmonize with the palace tones.\n\nThe *jia*-*yi* Dragon emerges from the *li* trigram,\nThe *geng*-*xin* Tiger is born from the *kan* village.\nAs husband and wife, they can guard each other,\nUnchanging in their original nature and disposition.\n\nThe immortals left words praising the Yellow Sprout—\nMetal and Water together form one cauldron’s flower.\nOnly after transforming into Dragon and Tiger\nDo *kan* and *li* enter the Purple River Chariot together.\n\nBefore the *kan* boy and *li* girl were formed,\nHeaven early paired them as the Two Modes.\nOnce transformed into husband and wife,\nThey are renamed the Sage of No-Knowing.\n\nEvery household’s *wangxiang* conceals Dragon and Tiger,\nEverywhere the veiled hides *kan* and *li*.\nFrom of old, people have been deluded and failed to recognize them—\nHow would the sages willingly reveal the subtle and recondite?\n\nAfter long refining in the furnace, the essence of Lead appears,\nRuddy frost, light as powder, in profusion.\nA hundred *hu* of pearls and jades are not worth its price—\nThen you know the celestial realm is your future path.\n\nConstantly, one grain is ground into dust,\nSlowly mixed with Mercury over fire.\nWho would envy halls filled with pearls and jades?\nShedding the mortal, you at once become a true person.\n\nWhen alchemical talk is exchanged, it seems endless—\nWhich one attains the true within the true?\nIn vain they compound the Four Yellows and Eight Stones,\nUnaware that the White Tiger and Dragon are kin.\n\nWithin *ren*-*yin* Water, draw forth the *geng* Tiger;\nWithin the *wu*-*ji* furnace, anchor the *jia* Dragon.\nThanks to the South’s *wuji*, they are\nDiligently guarded, their forms crimson.\n\nThe middle boy and middle girl meet,\nAt sixteen years of age, their principles are one.\nMoreover, the General serves as matchmaker—\nTheir harmony is entirely due to the Golden Mortar.\n\nWhen Yin refines the essence of Lead through nine turnings,\nA centenarian elder reverts to youth.\nThis time, the White Tiger will not return to the North,\nAnd the Blue Dragon will no longer go back to the East.\n\n*Geng*-*xin* is the cauldron, Fire the matchmaker,\nPure Yang of *bing*-*wu* conceals the child’s embryo.\nContinuously, day by day, for three hundred days,\nWho knows whence this Way originally came?\n\n**The Purple Mist Immortal Explains the Great Elixir Ode**\n\nWhere do worldly people recognize the Yellow Sprout?\nThis thing is within Lead, and in my home.\nLead and Mercury together form the Qi of Heaven and Earth—\nOnly after shedding the embryo does the Purple Bright Sand appear.\n\nThe Two Qi’s cinnabar is the most numinous thing—\nTrue and correctly formed Qi is the Yellow Essence.\nWithin Mercury there is something to be taken from Lead—\nPeople wander lost on the road, unaware.\n\nThe Great Way is clearly before your eyes,\nYet people of this age do not grasp it before returning to the spring.\nThe Yellow Sprout is the Qi of Qian and Kun,\nIts nature and will’s root is like Mercury’s continuity.\n\nUnite with the Great Way, unite with the source—\nWhen mother and child meet, they dare not speak.\nFirst Mercury, then Lead—this is the true Great Way.\nDo not let the companion be lost, like the crane coming to the carriage.\n\nThis thing all comes from the fullness of sixteen,\nIn an auspicious year and month, placed in the furnace.\nFor a thousand mornings, know the fire’s timing—\nDo not let the sprout dry while Mercury remains wet.\n\nThe sun and moon prolong life, yet people perish—\nThe true Way is clear, yet they cannot force it.\nEvery household has Lead and Mercury—\nWhere do they wander lost in the overgrown grass?\n\nLead and Mercury dwell in the river, not on the mountain;\nDay and night, pursue them in the Three Fields.\nIn past years, you may have indulged a careless nature,\nBut gradually your face will wither, becoming a ghost’s visage.\n\nThe Great Way leaves behind two scrolls of scripture,\nNaturally matching to form a model.\nHeaven has always had the female and male—\nWhy seek medicine names in other lands?\n\nTo use Lead, one must blend it with Mercury,\nTwo families unite as bride sings her song.\nWhen refined to the Purple River Chariot, the earth trembles—\nWhite clouds accompany the crane as it passes.\n\nThe Jia-Yi spirits drive the chart of creation,\nThe Azure Dragon knows it as the soft Lead of Zi.\nClearly wrought, how could it be hard to grasp?\nYet they say the immortals deceive my disciples.\n\nTrue Dragon and White Tiger merge as an embryo,\nTen months of gestation until it fully opens.\nThis is the true oral formula for Lead’s sprout—\nWhere in the world do people seek the Three Powers?\n\nThe old woman’s daughter is born drunk as mud,\nFor a thousand mornings in the dark chamber, she neither rises nor sets.\nWith sincere heart, day and night, diligently tend the fire—\nDo not let Mercury fall out of step with the times.\n\nThe sprout dwells in the Central Palace, Mercury in the South,\nIn ordinary measure, do not be greedy.\nReturning Cinnabar is not hard to seek—\nIt is only that without the mechanism, the mouth stays sealed.\n\nThe market brims with Yellow Sprouts, yet none find their home,\nPeople lightly treat them as dust and mud.\nEven nobles recognize the true numinous medicine—\nYet for greed, they mingle and lose it.\n\nWhen heaven and earth first parted, sun and moon rose high,\nShaped like a parrot’s egg or a peach.\nThe qi of yin and yang knows its season—\nOnly after three years does it shed its mother’s womb.\n\nThe Great Dao has never failed anyone,\nYet Lead and Mercury are cast aside like dust.\nPeople simply lack discernment—\nThe two qi, Cinnabar, water, and fire are kin.\n\nThis thing is born of heaven, yet people do not know it,\nThe true qi of yin and yang resides in Dui and Li.\nKan holds the five colors—its true name and nature—\nRecognize the Yellow Sprout, and return as a sage.\n\nClearly moving, it seeks itself—\nThe sprout is in the Central Palace, not the heart.\nIf primordial qi can become the Great Dao,\nKnow that the Great Dao does not sink into obscurity.\n\nDo not say the human heart does not seek it—\nThe Lead sprout and sun-moon dwell in the Central Palace.\nThe maiden of the North is the numinous medicine—\nWith a companion, she departs for the great Penglai.\n\nLead and Mercury have been passed down for myriad ages,\nHow many have known them? How many have cultivated?\nIf common folk knew the numinous medicine,\nEarthly immortals would flow like water.\n\n*Qin Yuan Chun* explains:\nSeven returns to the ordinary—within man,\nFirst refine the self and await the time.\n\nThe work of seven returns is hard for people to grasp—\nReturn to the root, restore the original,\nSeven turns gather in Dui’s yang nine.\nSimply practice the six positions of yin,\nWhat need to fear the three peaks buried in snow?\nSleep soundly within.\n\nIn cultivation, one must resolve the will,\nRefine according to the season,\nDo not let the heart wander outward.\nStill as Li, pure and without filth,\nDivine water frequently poured—\nThere is another sweetness.\n\nWhen the first yang stirs,\nIn the deep night, the water clock endless,\nThe first yang arises at the Fu hexagram.\nAfter midnight, rise, clothe yourself, grasp firmly,\nSit upright.\n\nThe Mysterious Female drives, rushing past the nape—\nOne strike through the three barriers,\nOnly then does one realize the work’s greatness.\nWood Lead’s pulp, Metal Mercury’s fire,\nWithin water and fire, there is an infant outside Dui.\n\nIn the endless night, the stars grind,\nOnly point to heaven—\nDo not let the exchange go awry.\nThe Lead cauldron warms,\nLight pierces the curtains,\nCreation races onward.\n\nAt the fire’s first blaze,\nReturn to the Jade Chamber,\nThe cauldron full and warm,\nThe body traverses the Zhou Tian.\nWater and fire drawn and added according to the great number,\nAll reaches the Cinnabar Field—\nOne must ensure the firing ceases,\nNaturally, the light is not of day.\n\nAdmiring the light, it shines through the curtains,\nIlluminating a thousand thousand steps.\nInner nurturing, the Returning Cinnabar forms itself—\nThe work of creation,\nDivine and sacred as a sealed torch.\n\nTiger and Dragon mate,\nThe work of advancing fire still perilous.\nWater generates Metal, the yin soul—\nThis fire grows the Azure Dragon.\nThe hun in the liver, Mao’s three sevens,\nWithin the numbers, no excess or lack.\nFollowing one another,\nUntil the Mud Pill Palace.\n\nFire frequently added,\nThe work’s wondrous understanding brings long life,\nThe countenance forever without aging.\nAble to fight demons and external paths,\nIt teaches me to roam freely,\nStanding as an immortal’s title.\n\nBy the winding river, gazing at the moon’s radiance,\nA crow flies.\nBright and resplendent,\nThe Milky Way curves,\nOn the clam’s surface, light shines,\nWithin grows the sala tree,\nThe Mao rabbit’s thousand-year fur like jade.\n\nWithin yin, yang is born—\nOne must only awaken to it.\nThe sun’s crow bears three feet,\nWithin yang, yin hides,\nOriginally dwelling in Li.\n\nTwo things gathered into one place,\nFacing the scene, observe the form—\nDo not let dust and defilement arise.\nAt that time, drink the knife’s edge yourself—\nWho would believe\nThat within nothingness, a child is nurtured?\n\nAt the proper time, one must understand—\nRecognize the knife’s edge,\nIn the palm, darkly fragrant.\nDiligently drink the jade nectar, always sated,\nFrequently refine the great medicine—\nDo not idly cast it away.\n\nThe Dragon moves left, the Tiger strides right,\nWithin nothingness, the elder brother is born—\nThose who are lost vie to know the Dao.\nAt Zi and Wu, silent—this work is best.\nWithout knowing how to cultivate,\nOne speaks emptily of a thousand thousand.\n\nDiscern the water’s source—clear or turbid,\nWood and Metal—ask of their separation.\n\nKunlun Mountain,\nWhere fierce waters surge,\nA single stream bound,\nNine bends turbid to the bottom,\nThe lower flow blocked, nowhere to stop.\nStilled, cold and clear,\nIt reflects the body of divine light.\n\nMetal and Wood—this is the wondrous principle,\nDragon and Tiger unite—\nWhat need for shared origin?\nOnly fear that sentient beings will not comprehend,\nAgain raising yin and yang,\nDeeply ashamed.\n\nWithout a teacher’s guidance,\nThis matter is hard to know—\nThe Dao’s essentials are profound and subtle.\n\nKan and Li’s root is Lead and Mercury,\nHaving seen through a thousand chapters,\nThe principle of seclusion is hard to grasp.\nWhen the master bestows the wondrous principle,\nTen thousand scrolls are mastered,\nThe heart rejoices in another way.\n\nWithin being, nothingness arises,\nGreatly embracing heaven and earth,\nSmallly entering the tip of a hair.\nThe Primordial Beginning once spoke of it as a millet grain,\nThe numinous treasure clearly—\nOnly then does one realize it is truly direct.\n\nThe heavenly mechanism is deep and distant—\nBegin swiftly, do not delay too long.\n\nEarth’s qi rises, heaven’s rain descends,\nAll things sprout—\nThis is the image of the heavenly mechanism.\n\nAt the mountain’s peak, a spring, fathoms deep,\nThe rope too short to seek it—\nTo find it is surely difficult to hope for.\n\nCultivate in youth, the root strong,\nIn old age, Lead is weak, Mercury scant—\nHow then,\nWith senses all stilled, spirit scattered,\nThe root gone dry,\nCan one ascend to the original?\n\nThe Penglai path,\nRely on three thousand deeds fulfilled,\nAlone step into the clouds and return.\n\nThe sea waves inquire of Penglai Isle—\nThose who fulfill their deeds and depart are rare indeed.\nNo path, no boat, vast and boundless,\nEven Master Li Shi would find it hard to reach.\nCultivate harmony early, with youthful vigor,\nGuard the profound and mysterious Dao.\n\nThough seas shift and change, the body stays young,\nThe Jade Emperor hears and issues a golden decree.\nHe Xiangu’s hymn to Lü the True Man, to the tune of *Qinyuan Chun*:\n\nSevenfold Returned Elixir,\nThe cyclical elixir’s work is supreme.\nRely on north and south, west and east,\nThe Five Phases and Four Images all return to earth,\nRestoring the root and original nature, then all is clear.\n\nFor one, first refine the self and await the hour.\nRefining the self begins with rectitude;\nAwaiting the hour, the elixir forms within.\nTherein lies the subtle mystery—\nIntercourse and union, Dragon and Tiger meet Lord Ding,\nEmbracing the dark turtle child.\n\nAt the first stir of yang, in the dead of night,\nThe water clock runs long.\nAs the yang struggles to rise, rely on the hexagram’s image to enter the Li trigram.\nThrice three, nine nines—the fire talisman proves true,\nThe elixir enters the belly, the heart cools of itself.\n\nThe gentle lead cauldron,\nLight piercing the curtains.\nThe gentle lead cauldron enters the central source,\nPlaced in the Three Palaces to nourish the auspicious lotus.\nOnce the lotus blooms, the sacred principle is naturally understood,\nDivine radiance step by step illuminates the immortals.\n\nCreation races on, Dragon and Tiger unite.\nThe seven-return furnace fears only delay;\nWhen the elixir is forged, one knows it of oneself.\nSeizing the true workings of heaven and earth,\nIn the twelve hours, it is but a single moment.\nThe work of advancing the fire is perilous as combat.\n\nThe work of advancing the fire has its season,\nWithin the cauldron, the elixir’s snowflakes fly.\nIf one asks what craft I pursue,\nI drink from the Nine Bends River’s jade-green pool.\nBy the winding river, the moon’s glow is clear and cold,\nA crow takes flight.\n\nThe golden crow flies into the azure depths,\nFrom the sea’s bottom, the wooden dragon is seized,\nA night-shining pearl is grasped,\nIts five-colored radiance illuminating the immortal palace.\n\nThen one drinks the *daogui* of one’s own accord—\nThe *daogui* enters the belly, ghosts and spirits tremble.\nSitting alone in a quiet chamber, the room fills with light.\nNo longer drawn to the underworld’s ghostly allure,\nOne’s heart is set on hanging one’s name among the immortals.\n\nYet who would believe,\nA child is nurtured from nothingness?\nOne’s own child is reared,\nNeither cold nor hot, never hungry.\nThen a pair—son and daughter—are raised,\nKept secret from all others.\n\nDiscern the water’s source, clear or turbid,\nWood and metal inquire of separation.\nWood and metal stand apart at the four directions,\nYet the center sees through the Five Phases whole.\nTo resolve it, seek only ancestor and origin,\nUnderstanding yin and yang before and after noon.\n\nWithout a teacher’s guidance,\nThis matter is hard to know.\nFor long life, one must bow to a master’s transmission,\nGrasping the heavenly mechanism is not difficult.\nMouth to mouth, passed down without written word,\nOnly those with prior affinity gain the enlightened master’s teaching.\n\nThe Dao is subtle and profound,\nThe heavenly mechanism deep and distant—\nBegin swiftly, do not delay too long.\n\nThe Penglai path,\nRely on three thousand deeds fulfilled,\nAlone step into the clouds and return.\nThe wondrous revelation of the Returned Elixir concludes *The Hidden Collection*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "还丹显妙通幽集 经名：还丹显妙通幽集。 一卷，原题少室山潜真子迷，疑出於北宋。 底本出处：《正统道藏》洞真部方法类。 还丹显妙通幽集序 凡以丹宠留心，黄芽役虑，不明铅汞，浪费珠珍。 或求百草之霜，欲明制伏； 或合五矾之匮辄务变通。 徒消岁月之功，莫达铅汞之旨。 余自从弱冠，常切亲人才，逾立年，便逢至道。 既悟希夷之旨，方知恍惚之问，轩帝去而垂衣，刘安升而弃鼠，事不虚传，迩唯昭验。 故达者指余曰：龙虎者，金水也； 金水者，铅汞也； 铅汞者，阴阳也； 阴阳者，坎离也； 坎离者，夫妇也； 夫妇者，男女也。 始自一源，终分数号，其皇同出而异名也。 吾切见世人，向庚辛而求虎，诣甲乙以寻龙。 殊不知龙在庚辛，虎居甲乙，火炎壬癸，水居丙丁。 自古圣人不直书其事，盖为此道至易也。 故讶日：龙从火裹出，虎向水中生。 又日：龙不居东淇，虎不在西虏。 又日：俄然木位化为金，便是大丹心。 此之谓也。 余今不期多幸，获究玄文，敢罄菲材，效元阳子《金液集作》显妙通幽诗三十首，以俟后来君子与余同志者，印证耳。 还丹显妙通幽集 少室山潜真子迷 诗曰",
      "translated_text": "*The Revealed Wondrous and Profound Collection of the Returned Elixir*\n*Sutra Title:* *The Revealed Wondrous and Profound Collection of the Returned Elixir*\nOne scroll, originally attributed to Qianzhenzi of Shaoshi Mountain; likely composed during the Northern Song. Source text: *Daoist Canon of the Zhengtong Era*, *Dongzhen* section, Methods category.\n\n**Preface to *The Revealed Wondrous and Profound Collection of the Returned Elixir***\n\nThose who fix their minds on the elixir and exhaust their thoughts on the Yellow Sprout, yet fail to comprehend lead and mercury, squander their treasures in vain. Some seek the frost of a hundred herbs, hoping to master refinement; others compound the five alums, striving for transformation. Yet they waste years of effort, never grasping the essence of lead and mercury.\n\nFrom my youth, I have been deeply concerned for the talents of others. Beyond my thirtieth year, I encountered the supreme Dao. Having awakened to the subtleties of *xiyi* (profound stillness), I at last understood the mysteries of *huanghu* (the indistinct and evanescent). When the Yellow Emperor ascended and ruled by non-action, when Liu An rose and abandoned the rat—these were not empty legends, but truths confirmed by near evidence.\n\nThus, the enlightened have instructed me: The Dragon and Tiger are Metal and Water; Metal and Water are lead and mercury; lead and mercury are yin and yang; yin and yang are *kan* and *li*; *kan* and *li* are husband and wife; husband and wife are male and female. Though they originate from a single source, they diverge into many names—like the Sovereign, who is one yet called by different titles.\n\nI have observed how people of this world seek the Tiger in *geng* and *xin*, pursue the Dragon in *jia* and *yi*, unaware that the Dragon dwells in *geng* and *xin*, while the Tiger resides in *jia* and *yi*. Fire blazes in *ren* and *gui*, while Water abides in *bing* and *ding*. The sages of old never recorded these matters plainly, for this Way is ultimately simple.\n\nHence the adage: *\"The Dragon emerges from within Fire; the Tiger is born from within Water.\"*\nAnd again: *\"The Dragon does not dwell in the eastern Qi; the Tiger is not found in the western Rong.\"*\nAnd further: *\"When suddenly the Wood position transforms into Metal, this is the heart of the Great Elixir.\"*\n\nSuch is the truth.\n\nNow, by unforeseen fortune, I have delved into the profound texts. Humbly offering my meager talents, I emulate Yuanyangzi’s *Collection of Golden Liquor* by composing *Thirty Poems on the Revealed Wondrous and Profound* to await later gentlemen who share my aspirations, that they may verify and reflect upon them.\n\n*The Revealed Wondrous and Profound Collection of the Returned Elixir*\nBy Qianzhenzi of Shaoshi Mountain\n\n**The Poems Say:**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 456,
      "start_sentence": 0,
      "end_sentence": 28,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.358976364135742,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\还丹显妙通幽集.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "一转安排虎作头，先须深入水中修，经旬用意除铅汞，火炼河车向甲求。 二转安排听一灵，将来还向水中烹，经阳鼎裹殷勤炼，被着青衣嫁与庚。 三转勤修在北方，从兹一度合阴阳，水蒸火烁七十二，壬癸夫妻出洞房。 四转修来未十旬，开炉辟鼎若浮云，直须洗换衣鲜洁，莫使尘埃有污熏。 铅汞修持经五转，三花馥馥若轻红，开炉出水重添火，又却安排入坎官。 六转绵绵逾五月，庚夫甲妇正绸缪，直教固济须牢密，莫使炉中有水流。 金水合时非一体，虎龙交处一重形，仙人留此神丹诀，会取束西白与青。 一味灵砂属四神，炉中一个小乾坤，《参同契》里分明说，神水华池几处门。 由来志士炼丹砂，此道先须识马牙，龙虎合时无异药，谁知黄帝美金华。 圣人垂意事朦胧，铅汞元来属正束，女却刚强男侄妮，一时和合入中宫。 唯有灵砂理最探，一阳须向水中寻，莫烧世上坚顽药，必定无成损尔金。 西方姥女火中胎，束极朱南水裹来，唯有中宫堪混一，不曾纤粟染尘埃。 至道凡人莫强知，青龙谁见着青衣，黄芽不向黑方了，妮女终须逐火飞。 金液神方非一门，华池要妙理难论，君臣父子归中土，青魄经年嫁与魂。 铅汞从来体一真，由来学士自迷昏，凭君子细寻南北，水火分形是药根。 纯阴才尽却纯阳，土裹港身水裹藏，若共五行无计会，如何得作药中王。 凡流若欲炼金丹，经诀先须认九还，莫弄四黄并八石，终身不得到三山。 初炼流珠变化砂，将来鼎裹合金华，凡徒不信长生术，九转功成切莫夸。 神丹见说极多方，燕雀无由产凤凰，除却真铅与真汞，其余皆不合宫商。 甲乙龙从离象出，庚辛虎自坎乡生，为夫为妇能相守，不改当时性与情。 仙人留语赞黄芽，金水同为一鼎花，只自变为龙虎后，坎离同入紫河车。 坎男离女未成时，早被天公配二仪，及到变为夫妇后，立名翻作圣无知。 家家罔象藏龙虎，处处朦胧隐坎离，自为从来迷不识，圣人争肯露希夷。 炉中久炼见铅精，扑扑红霜似粉轻，百斛珠玑非价直，即知霄汉是前程。 时时一粒碾为尘，火上徐徐掺水银，谁羡满堂珠与玉，脱凡即便作真人。 相逢道话馒云云，那个真中得正真，徒配四黄并八石，宁知白虎与龙亲。 壬寅水裹抽庚虎，戊己炉中镇甲龙，赖得南方有无忌，殷勤相守赤形容。 中男中女两相逢，二八年华理一同，更有将军为绍介，调缪全是得金筑。 阴炼铅精九转终，百年耆老却成童，白虎这回休反北，青龙从此不归束。 庚辛为鼎火为媒，丙午纯阳隐子胎，历历绵绵三百日，不知此道自何来。 紫烟真人解大丹颂 世人何处认黄芽，此物铅中在我家，铅汞共成天地气，脱胎方见紫明砂。 二气丹砂物最灵，真成正气是黄精，汞中有物铅中取，人自迷津落路行。 大道分明在目前，时人不会俟归泉，黄芽便是乾坤气，性志根基似汞连。 合其大道合其源，子母相逢不敢言，先汞后铅真大道，莫交失伴鹄来轩。 此物皆从二八圆，吉年吉月入炉安，千朝火候知时节，莫遣芽乾汞不乾。 日月延人人自亡，分明真道不能强，家家尽有铅兼汞，何处迷津落草荒。 铅汞居川不在山，三田日夜好追攀，往年纵却疏狂性，渐渐廷赢作鬼颜。 大道空留两卷经，自然匹配作仪刑，天生牝牡从前有，何得他州问药名。",
      "translated_text": "**The Poems Say:**\n\nAt the first turning, arrange the Tiger to lead—\nFirst you must deeply enter cultivation within Water.\nAfter ten days, with intent refine Lead and Mercury,\nThen fire-temper the River Chariot, seeking it in *jia*.\n\nAt the second turning, arrange and listen to the One Spirit—\nBring it back to be simmered within Water.\nDiligently refine it in the Yang Cauldron,\nClad in blue robes, wed it to *geng*.\n\nAt the third turning, diligently cultivate in the North—\nFrom this, once unite Yin and Yang.\nWater steams, fire smelts—seventy-two times—\n*Ren* and *gui*, husband and wife, emerge from the bridal chamber.\n\nAt the fourth turning, cultivate for not yet ten weeks—\nOpen the furnace, part the cauldron like floating clouds.\nYou must wash and change into fresh, pure garments,\nLest dust and grime taint and pollute.\n\nAfter five turnings refining Lead and Mercury,\nThe Three Flowers exude fragrance like light crimson.\nOpen the furnace, draw forth the Water, then add more fire,\nAnd again arrange them to enter the *kan* palace.\n\nAt the sixth turning, continuously for over five months,\n*Geng*-husband and *jia*-wife are in close embrace.\nYou must ensure the sealing is firm and tight,\nLest Water flow within the furnace.\n\nWhen Metal and Water unite, they are not one body;\nWhere Tiger and Dragon intertwine, there is but a single form.\nThe immortals left this divine elixir formula:\nGrasp the white of the West and the blue of the East.\n\nThis single essence of numinous cinnabar belongs to the Four Spirits,\nWithin the furnace, a small Heaven and Earth.\nThe *Cantong Qi* clearly states it—\nHow many gates are there to the Divine Water and Flowery Pond?\n\nFrom of old, those of resolve refine cinnabar,\nBut this Way first requires recognizing Horse’s Teeth.\nWhen Dragon and Tiger unite, there is no other medicine—\nWho knows that the Yellow Emperor’s Golden Flower is most exquisite?\n\nThe sages conveyed this matter in veiled terms:\nLead and Mercury originally belong to the true East.\nThe woman, though strong, and the man, though yielding,\nAt once harmonize and enter the Central Palace.\n\nOnly the numinous cinnabar holds the deepest principle—\nThe One Yang must be sought within Water.\nDo not burn the hard, stubborn medicines of the world,\nFor surely you will fail and waste your gold.\n\nThe Crone of the West is a fetus within Fire,\nThe Vermilion of the East comes from within Water.\nOnly the Central Palace can achieve perfect unity,\nNever tainted by even a speck of dust.\n\nThe Supreme Way is not for ordinary minds to presume to know—\nWho has seen the Blue Dragon don a blue robe?\nThe Yellow Sprout is not resolved in the Black Quarter,\nAnd the yielding maiden must ultimately follow Fire in flight.\n\nThe divine formula of Golden Liquor is not one path—\nThe Flowery Pond’s subtlety is hard to discuss.\nRuler and minister, father and son return to the Central Earth,\nThe Blue Soul, after years, is wed to the Spirit.\n\nLead and Mercury have ever been of one true essence,\nYet scholars have long been deluded and confused.\nRely on you, sir, to carefully seek North and South—\nWater and Fire, though distinct in form, are the root of the medicine.\n\nWhen pure Yin is exhausted, pure Yang remains;\nWithin Earth it conceals the body, within Water it hides.\nIf it does not harmonize with the Five Phases,\nHow can it become the king among medicines?\n\nIf common folk wish to refine the Golden Elixir,\nFirst study the scriptures to recognize the Nine Returns.\nDo not toy with the Four Yellows or Eight Stones,\nFor you will never in your life reach the Three Mountains.\n\nFirst refine the Flowing Pearl into transforming cinnabar,\nThen bring it into the cauldron to unite with the Golden Flower.\nFools do not believe in the art of longevity—\nWhen the nine turnings are complete, do not boast.\n\nThe divine elixir is said to have many methods,\nBut swallows and sparrows cannot give birth to phoenixes.\nApart from true Lead and true Mercury,\nAll else fails to harmonize with the palace tones.\n\nThe *jia*-*yi* Dragon emerges from the *li* trigram,\nThe *geng*-*xin* Tiger is born from the *kan* village.\nAs husband and wife, they can guard each other,\nUnchanging in their original nature and disposition.\n\nThe immortals left words praising the Yellow Sprout—\nMetal and Water together form one cauldron’s flower.\nOnly after transforming into Dragon and Tiger\nDo *kan* and *li* enter the Purple River Chariot together.\n\nBefore the *kan* boy and *li* girl were formed,\nHeaven early paired them as the Two Modes.\nOnce transformed into husband and wife,\nThey are renamed the Sage of No-Knowing.\n\nEvery household’s *wangxiang* conceals Dragon and Tiger,\nEverywhere the veiled hides *kan* and *li*.\nFrom of old, people have been deluded and failed to recognize them—\nHow would the sages willingly reveal the subtle and recondite?\n\nAfter long refining in the furnace, the essence of Lead appears,\nRuddy frost, light as powder, in profusion.\nA hundred *hu* of pearls and jades are not worth its price—\nThen you know the celestial realm is your future path.\n\nConstantly, one grain is ground into dust,\nSlowly mixed with Mercury over fire.\nWho would envy halls filled with pearls and jades?\nShedding the mortal, you at once become a true person.\n\nWhen alchemical talk is exchanged, it seems endless—\nWhich one attains the true within the true?\nIn vain they compound the Four Yellows and Eight Stones,\nUnaware that the White Tiger and Dragon are kin.\n\nWithin *ren*-*yin* Water, draw forth the *geng* Tiger;\nWithin the *wu*-*ji* furnace, anchor the *jia* Dragon.\nThanks to the South’s *wuji*, they are\nDiligently guarded, their forms crimson.\n\nThe middle boy and middle girl meet,\nAt sixteen years of age, their principles are one.\nMoreover, the General serves as matchmaker—\nTheir harmony is entirely due to the Golden Mortar.\n\nWhen Yin refines the essence of Lead through nine turnings,\nA centenarian elder reverts to youth.\nThis time, the White Tiger will not return to the North,\nAnd the Blue Dragon will no longer go back to the East.\n\n*Geng*-*xin* is the cauldron, Fire the matchmaker,\nPure Yang of *bing*-*wu* conceals the child’s embryo.\nContinuously, day by day, for three hundred days,\nWho knows whence this Way originally came?\n\n**The Purple Mist Immortal Explains the Great Elixir Ode**\n\nWhere do worldly people recognize the Yellow Sprout?\nThis thing is within Lead, and in my home.\nLead and Mercury together form the Qi of Heaven and Earth—\nOnly after shedding the embryo does the Purple Bright Sand appear.\n\nThe Two Qi’s cinnabar is the most numinous thing—\nTrue and correctly formed Qi is the Yellow Essence.\nWithin Mercury there is something to be taken from Lead—\nPeople wander lost on the road, unaware.\n\nThe Great Way is clearly before your eyes,\nYet people of this age do not grasp it before returning to the spring.\nThe Yellow Sprout is the Qi of Qian and Kun,\nIts nature and will’s root is like Mercury’s continuity.\n\nUnite with the Great Way, unite with the source—\nWhen mother and child meet, they dare not speak.\nFirst Mercury, then Lead—this is the true Great Way.\nDo not let the companion be lost, like the crane coming to the carriage.\n\nThis thing all comes from the fullness of sixteen,\nIn an auspicious year and month, placed in the furnace.\nFor a thousand mornings, know the fire’s timing—\nDo not let the sprout dry while Mercury remains wet.\n\nThe sun and moon prolong life, yet people perish—\nThe true Way is clear, yet they cannot force it.\nEvery household has Lead and Mercury—\nWhere do they wander lost in the overgrown grass?\n\nLead and Mercury dwell in the river, not on the mountain;\nDay and night, pursue them in the Three Fields.\nIn past years, you may have indulged a careless nature,\nBut gradually your face will wither, becoming a ghost’s visage.\n\nThe Great Way leaves behind two scrolls of scripture,\nNaturally matching to form a model.\nHeaven has always had the female and male—\nWhy seek medicine names in other lands?",
      "overlap_context": "s is the heart of the Great Elixir.\"*\n\nSuch is the truth.\n\nNow, by unforeseen fortune, I have delved into the profound texts. Humbly offering my meager talents, I emulate Yuanyangzi’s *Collection of Golden Liquor* by composing *Thirty Poems on the Revealed Wondrous and Profound* to await later gentlemen who share my aspirations, that they may verify and reflect upon them.\n\n*The Revealed Wondrous and Profound Collection of the Returned Elixir*\nBy Qianzhenzi of Shaoshi Mountain\n\n**The Poems Say:**",
      "start_char": 456,
      "end_char": 1798,
      "start_sentence": 29,
      "end_sentence": 67,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.3673198223114,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\还丹显妙通幽集.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "用铅须得汞相和，二姓为亲女唱歌，炼到紫河车动地，白云相伴鹤来过。 甲乙神驱造化图，青龙知是子铅酥，分明制出何难会，却道仙家诳我徒。 真龙白虎合为胎，十月怀耽始满开，此是铅芽真口诀，世人何处觅三才。 姥女初生醉似泥，千朝暗室不束西，虔心日夜勤加火，莫遣随时汞不齐。 芽在中宫汞在南，寻常斟酌莫交贪，还丹不是难求药，自是无机口不钳。 满市黄芽无所归，世人轻易作尘泥，公卿尽识真灵药，祇为贪婪混着伊。 天地初分日月高，状如鹦子又如桃，阴阳正气知时节，直待三年脱母胞。 大道从来不负人，分明铅汞弃如尘，世人只为无分别，二气丹砂水火亲。 此物天生人不知，阴阳真气兑居离，坎居五色真名姓，认得黄芽作圣归。 分明运动自追寻，芽在中宫不在心，元气若能为大道，须知大道莫沈昤。 莫道人心自不寻，铅芽日月在中宫，北方诧女是灵药，得伴相随去大蓬。 铅汞传来几万秋，几人识得几人修，若交俗姓知灵药，地上仙人似水流。 沁园春解 七返还凡，在人，先须炼己待时。 七返功，人难会，返本还元，七转收归兑阳九。 但行阴六位，何虑三峰雪裹安然睡。 在人修，须发志，烹炼依时，勿使心游外。 澄李湛然无垢腻，神水频浇，别有甘甜味。 正一阳初动，中宵漏永， 一阳生当复卦，子后披衣握固，端然　坐。 玄牝驱驰冲项过，一撞三关，始觉工夫大。 木铅浆，金汞火，水火之中有个婴兑外。 漏永中宵星斗磨，唯指天呈，莫遣交差错。 温温铅鼎，光透帘帏，造化争驰， 火初炎，归玉户，满鼎温温，遍体周天度。 水火抽添依大数，尽到丹田，须遣教烧住，自然光非昼。 慕光射帘帏，可照千千步，内养还丹他自做，造化功夫，神圣如缄炬。 虎龙交媾，进火功夫犹斗危。 水生金，阴魄这火长青龙，魂向肝中卯三七，数中无太少。 相从相随，直到泥丸脑。 火频添，功夫妙解使长生，颜貌常无老。 能斗邪魔并外道，教我逍遥，立得神仙号。 曲江上，看月华澄争，有个乌飞。 灿灿明，天河曲，蚌上光辉，内长娑罗木，卯兔千年毛似玉。 阴裹生阳，只要人知悟，日中乌生三足，阳内藏阴，本向离中住。 二物同收归一处，对景观形，辄莫生尘污。 当时自饮刀圭，又谁信，无中养就儿。 正当时，须自晓，认得刀圭，掌内冥冥香。 勤饮琼浆常是饱，大药频修，莫要虚抛了。 龙左行，虎右逵，无裹生兄，迷者争知道。 子午寂然功最好，不会修持，空说千千兆。 辩水源清浊，木金问隔， 昆仑山，出猛水，一派束流，九曲浊连底，下流不通无处止。 澄冷清清，照见神光体。 金木因为妙旨，龙虎相交，何假同元义。 只恐众生难省会，再举阴阳，切切生惭愧。 不因师指，此事难知，道要玄微。 坎离根铅汞，始看尽千章，难取希夷理。 际会先生蒙妙旨，万卷皆通，别是心欢喜。 有中藏无内起，大纳乾坤，小入毫毛裹。 元始曾言如黍米，灵宝分明，始觉直端的。 天机深远，下手速修无太迟。 地气腾，天雨降，万物生芽，便是天机象。 山顶有泉深数丈，索短求他，要觅应难望。 少年修，根脚壮，老后铅虚汞少，如何向，视听都休神散荡，本去乾枯，怎得成元上。 蓬莱路，仗三千行满，独步云归。",
      "translated_text": "To use Lead, one must blend it with Mercury,\nTwo families unite as bride sings her song.\nWhen refined to the Purple River Chariot, the earth trembles—\nWhite clouds accompany the crane as it passes.\n\nThe Jia-Yi spirits drive the chart of creation,\nThe Azure Dragon knows it as the soft Lead of Zi.\nClearly wrought, how could it be hard to grasp?\nYet they say the immortals deceive my disciples.\n\nTrue Dragon and White Tiger merge as an embryo,\nTen months of gestation until it fully opens.\nThis is the true oral formula for Lead’s sprout—\nWhere in the world do people seek the Three Powers?\n\nThe old woman’s daughter is born drunk as mud,\nFor a thousand mornings in the dark chamber, she neither rises nor sets.\nWith sincere heart, day and night, diligently tend the fire—\nDo not let Mercury fall out of step with the times.\n\nThe sprout dwells in the Central Palace, Mercury in the South,\nIn ordinary measure, do not be greedy.\nReturning Cinnabar is not hard to seek—\nIt is only that without the mechanism, the mouth stays sealed.\n\nThe market brims with Yellow Sprouts, yet none find their home,\nPeople lightly treat them as dust and mud.\nEven nobles recognize the true numinous medicine—\nYet for greed, they mingle and lose it.\n\nWhen heaven and earth first parted, sun and moon rose high,\nShaped like a parrot’s egg or a peach.\nThe qi of yin and yang knows its season—\nOnly after three years does it shed its mother’s womb.\n\nThe Great Dao has never failed anyone,\nYet Lead and Mercury are cast aside like dust.\nPeople simply lack discernment—\nThe two qi, Cinnabar, water, and fire are kin.\n\nThis thing is born of heaven, yet people do not know it,\nThe true qi of yin and yang resides in Dui and Li.\nKan holds the five colors—its true name and nature—\nRecognize the Yellow Sprout, and return as a sage.\n\nClearly moving, it seeks itself—\nThe sprout is in the Central Palace, not the heart.\nIf primordial qi can become the Great Dao,\nKnow that the Great Dao does not sink into obscurity.\n\nDo not say the human heart does not seek it—\nThe Lead sprout and sun-moon dwell in the Central Palace.\nThe maiden of the North is the numinous medicine—\nWith a companion, she departs for the great Penglai.\n\nLead and Mercury have been passed down for myriad ages,\nHow many have known them? How many have cultivated?\nIf common folk knew the numinous medicine,\nEarthly immortals would flow like water.\n\n*Qin Yuan Chun* explains:\nSeven returns to the ordinary—within man,\nFirst refine the self and await the time.\n\nThe work of seven returns is hard for people to grasp—\nReturn to the root, restore the original,\nSeven turns gather in Dui’s yang nine.\nSimply practice the six positions of yin,\nWhat need to fear the three peaks buried in snow?\nSleep soundly within.\n\nIn cultivation, one must resolve the will,\nRefine according to the season,\nDo not let the heart wander outward.\nStill as Li, pure and without filth,\nDivine water frequently poured—\nThere is another sweetness.\n\nWhen the first yang stirs,\nIn the deep night, the water clock endless,\nThe first yang arises at the Fu hexagram.\nAfter midnight, rise, clothe yourself, grasp firmly,\nSit upright.\n\nThe Mysterious Female drives, rushing past the nape—\nOne strike through the three barriers,\nOnly then does one realize the work’s greatness.\nWood Lead’s pulp, Metal Mercury’s fire,\nWithin water and fire, there is an infant outside Dui.\n\nIn the endless night, the stars grind,\nOnly point to heaven—\nDo not let the exchange go awry.\nThe Lead cauldron warms,\nLight pierces the curtains,\nCreation races onward.\n\nAt the fire’s first blaze,\nReturn to the Jade Chamber,\nThe cauldron full and warm,\nThe body traverses the Zhou Tian.\nWater and fire drawn and added according to the great number,\nAll reaches the Cinnabar Field—\nOne must ensure the firing ceases,\nNaturally, the light is not of day.\n\nAdmiring the light, it shines through the curtains,\nIlluminating a thousand thousand steps.\nInner nurturing, the Returning Cinnabar forms itself—\nThe work of creation,\nDivine and sacred as a sealed torch.\n\nTiger and Dragon mate,\nThe work of advancing fire still perilous.\nWater generates Metal, the yin soul—\nThis fire grows the Azure Dragon.\nThe hun in the liver, Mao’s three sevens,\nWithin the numbers, no excess or lack.\nFollowing one another,\nUntil the Mud Pill Palace.\n\nFire frequently added,\nThe work’s wondrous understanding brings long life,\nThe countenance forever without aging.\nAble to fight demons and external paths,\nIt teaches me to roam freely,\nStanding as an immortal’s title.\n\nBy the winding river, gazing at the moon’s radiance,\nA crow flies.\nBright and resplendent,\nThe Milky Way curves,\nOn the clam’s surface, light shines,\nWithin grows the sala tree,\nThe Mao rabbit’s thousand-year fur like jade.\n\nWithin yin, yang is born—\nOne must only awaken to it.\nThe sun’s crow bears three feet,\nWithin yang, yin hides,\nOriginally dwelling in Li.\n\nTwo things gathered into one place,\nFacing the scene, observe the form—\nDo not let dust and defilement arise.\nAt that time, drink the knife’s edge yourself—\nWho would believe\nThat within nothingness, a child is nurtured?\n\nAt the proper time, one must understand—\nRecognize the knife’s edge,\nIn the palm, darkly fragrant.\nDiligently drink the jade nectar, always sated,\nFrequently refine the great medicine—\nDo not idly cast it away.\n\nThe Dragon moves left, the Tiger strides right,\nWithin nothingness, the elder brother is born—\nThose who are lost vie to know the Dao.\nAt Zi and Wu, silent—this work is best.\nWithout knowing how to cultivate,\nOne speaks emptily of a thousand thousand.\n\nDiscern the water’s source—clear or turbid,\nWood and Metal—ask of their separation.\n\nKunlun Mountain,\nWhere fierce waters surge,\nA single stream bound,\nNine bends turbid to the bottom,\nThe lower flow blocked, nowhere to stop.\nStilled, cold and clear,\nIt reflects the body of divine light.\n\nMetal and Wood—this is the wondrous principle,\nDragon and Tiger unite—\nWhat need for shared origin?\nOnly fear that sentient beings will not comprehend,\nAgain raising yin and yang,\nDeeply ashamed.\n\nWithout a teacher’s guidance,\nThis matter is hard to know—\nThe Dao’s essentials are profound and subtle.\n\nKan and Li’s root is Lead and Mercury,\nHaving seen through a thousand chapters,\nThe principle of seclusion is hard to grasp.\nWhen the master bestows the wondrous principle,\nTen thousand scrolls are mastered,\nThe heart rejoices in another way.\n\nWithin being, nothingness arises,\nGreatly embracing heaven and earth,\nSmallly entering the tip of a hair.\nThe Primordial Beginning once spoke of it as a millet grain,\nThe numinous treasure clearly—\nOnly then does one realize it is truly direct.\n\nThe heavenly mechanism is deep and distant—\nBegin swiftly, do not delay too long.\n\nEarth’s qi rises, heaven’s rain descends,\nAll things sprout—\nThis is the image of the heavenly mechanism.\n\nAt the mountain’s peak, a spring, fathoms deep,\nThe rope too short to seek it—\nTo find it is surely difficult to hope for.\n\nCultivate in youth, the root strong,\nIn old age, Lead is weak, Mercury scant—\nHow then,\nWith senses all stilled, spirit scattered,\nThe root gone dry,\nCan one ascend to the original?\n\nThe Penglai path,\nRely on three thousand deeds fulfilled,\nAlone step into the clouds and return.",
      "overlap_context": "t force it.\nEvery household has Lead and Mercury—\nWhere do they wander lost in the overgrown grass?\n\nLead and Mercury dwell in the river, not on the mountain;\nDay and night, pursue them in the Three Fields.\nIn past years, you may have indulged a careless nature,\nBut gradually your face will wither, becoming a ghost’s visage.\n\nThe Great Way leaves behind two scrolls of scripture,\nNaturally matching to form a model.\nHeaven has always had the female and male—\nWhy seek medicine names in other lands?",
      "start_char": 1799,
      "end_char": 3091,
      "start_sentence": 68,
      "end_sentence": 123,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.841042041778564,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\还丹显妙通幽集.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "海波问，蓬莱岛，行满功成，去者绝希少。 无路无舟空浩渺，郦市先生，要到应难到，养冲和宜在早，意气男兄，守取幽玄道。 沧海变移身未老，玉帝知闻，铃有金书诏。 何仙姑颂吕真人《沁园春》 七返还丹， 反覆还丹最有功，须凭南北与西束，五行四象皆归土，还得根元性便通。 在人先须炼己待时， 炼己先须正，待时丹成体，内有玄微，交媾往来，龙虎见丁公，抱得黑龟儿。 正一阳初动，中宵漏永。 漏永更长战一阳，须凭卦象入离乡，三三九九火符验，入腹灵丹心自凉。 温温铅鼎，光透帘帏。 温温铅鼎入中源，放入三官养瑞莲，莲就自然通圣理，神光步步照神仙。 造化争驰，龙虎交媾。 七还炉鼎只忧迟，丹药烧成已自知，捉得乾坤真造化，十二时中只一时。 进火功夫犹斗危。 进火功夫自有期，鼎中丹药雪花飞，有人问我攻何业，九曲江边饮碧池。 曲江上看月华澄冷，有个乌飞。 金乌飞入碧潭中，海底擒来木上龙，夺得夜明珠一颗，霞光五道照仙官。 当时自饮刀圭， 刀圭入腹鬼神惊，独坐闲房满室明，不向阴司有鬼趣，一心专待挂仙名。 又谁信，无中养就儿。 自家养就一婴儿，不寒不热不曾饥，再养一双儿共女，等闲不许别人知。 辩水源清浊，木金问隔， 金木问隔在四边，中央识破五行全，要了但寻宗与祖，会得阴阳午后前。 不因师指，此事难知。 长生须是拜师传，央得天机甚不难，口口相传不记字，得通明师宿有缘。 道要玄微，天机深远，下手速修无太迟。 蓬莱路，仗三千行满，独步云归。 还丹显妙通幽集竟",
      "translated_text": "The sea waves inquire of Penglai Isle—\nThose who fulfill their deeds and depart are rare indeed.\nNo path, no boat, vast and boundless,\nEven Master Li Shi would find it hard to reach.\nCultivate harmony early, with youthful vigor,\nGuard the profound and mysterious Dao.\n\nThough seas shift and change, the body stays young,\nThe Jade Emperor hears and issues a golden decree.\nHe Xiangu’s hymn to Lü the True Man, to the tune of *Qinyuan Chun*:\n\nSevenfold Returned Elixir,\nThe cyclical elixir’s work is supreme.\nRely on north and south, west and east,\nThe Five Phases and Four Images all return to earth,\nRestoring the root and original nature, then all is clear.\n\nFor one, first refine the self and await the hour.\nRefining the self begins with rectitude;\nAwaiting the hour, the elixir forms within.\nTherein lies the subtle mystery—\nIntercourse and union, Dragon and Tiger meet Lord Ding,\nEmbracing the dark turtle child.\n\nAt the first stir of yang, in the dead of night,\nThe water clock runs long.\nAs the yang struggles to rise, rely on the hexagram’s image to enter the Li trigram.\nThrice three, nine nines—the fire talisman proves true,\nThe elixir enters the belly, the heart cools of itself.\n\nThe gentle lead cauldron,\nLight piercing the curtains.\nThe gentle lead cauldron enters the central source,\nPlaced in the Three Palaces to nourish the auspicious lotus.\nOnce the lotus blooms, the sacred principle is naturally understood,\nDivine radiance step by step illuminates the immortals.\n\nCreation races on, Dragon and Tiger unite.\nThe seven-return furnace fears only delay;\nWhen the elixir is forged, one knows it of oneself.\nSeizing the true workings of heaven and earth,\nIn the twelve hours, it is but a single moment.\nThe work of advancing the fire is perilous as combat.\n\nThe work of advancing the fire has its season,\nWithin the cauldron, the elixir’s snowflakes fly.\nIf one asks what craft I pursue,\nI drink from the Nine Bends River’s jade-green pool.\nBy the winding river, the moon’s glow is clear and cold,\nA crow takes flight.\n\nThe golden crow flies into the azure depths,\nFrom the sea’s bottom, the wooden dragon is seized,\nA night-shining pearl is grasped,\nIts five-colored radiance illuminating the immortal palace.\n\nThen one drinks the *daogui* of one’s own accord—\nThe *daogui* enters the belly, ghosts and spirits tremble.\nSitting alone in a quiet chamber, the room fills with light.\nNo longer drawn to the underworld’s ghostly allure,\nOne’s heart is set on hanging one’s name among the immortals.\n\nYet who would believe,\nA child is nurtured from nothingness?\nOne’s own child is reared,\nNeither cold nor hot, never hungry.\nThen a pair—son and daughter—are raised,\nKept secret from all others.\n\nDiscern the water’s source, clear or turbid,\nWood and metal inquire of separation.\nWood and metal stand apart at the four directions,\nYet the center sees through the Five Phases whole.\nTo resolve it, seek only ancestor and origin,\nUnderstanding yin and yang before and after noon.\n\nWithout a teacher’s guidance,\nThis matter is hard to know.\nFor long life, one must bow to a master’s transmission,\nGrasping the heavenly mechanism is not difficult.\nMouth to mouth, passed down without written word,\nOnly those with prior affinity gain the enlightened master’s teaching.\n\nThe Dao is subtle and profound,\nThe heavenly mechanism deep and distant—\nBegin swiftly, do not delay too long.\n\nThe Penglai path,\nRely on three thousand deeds fulfilled,\nAlone step into the clouds and return.\nThe wondrous revelation of the Returned Elixir concludes *The Hidden Collection*.",
      "overlap_context": " rises, heaven’s rain descends,\nAll things sprout—\nThis is the image of the heavenly mechanism.\n\nAt the mountain’s peak, a spring, fathoms deep,\nThe rope too short to seek it—\nTo find it is surely difficult to hope for.\n\nCultivate in youth, the root strong,\nIn old age, Lead is weak, Mercury scant—\nHow then,\nWith senses all stilled, spirit scattered,\nThe root gone dry,\nCan one ascend to the original?\n\nThe Penglai path,\nRely on three thousand deeds fulfilled,\nAlone step into the clouds and return.",
      "start_char": 3092,
      "end_char": 3757,
      "start_sentence": 124,
      "end_sentence": 152,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.97271966934204,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\还丹显妙通幽集.txt",
        "category": "方法类"
      }
    }
  ]
}