{
  "source_id": "道书援神契",
  "source_file": "chunked_daozang\\道书援神契.json",
  "total_chunks": 4,
  "total_original_chars": 2201,
  "total_translated_chars": 13796,
  "total_translation_time": 75.50347995758057,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\道书援神契.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Daoist Scripture in Concord with the Divine: A Preface**\n\nThe text is titled *Daoist Scripture in Concord with the Divine* (*Daoshu Yuanshen Qi*). Its author is unknown. It comprises one scroll. The base text is derived from *The Orthodox Daoist Canon*, First Section.\n\n**Preface to *Daoist Scripture in Concord with the Divine***\n\nThose who discuss the teachings of Laozi in the world all call them heterodox, claiming their origins lie in Confucianism, though their later currents diverged. Yet Confucianism cannot be termed a \"teaching\"—it is the constant Way of all under Heaven. Yao, Shun, Yu, Tang, Wen, Wu, the Duke of Zhou, and Confucius arose in succession—what \"teaching\" is there to speak of? When the Way of Zhou declined, rites and music fell into disuse, and customs grew deceitful. The Way of Confucius was seen as at odds with the times, and thus it was labeled a \"teaching,\" its roots traceable to this.\n\nLaozi lived contemporaneously with Confucius and was most renowned for his mastery of ritual. Confucius often consulted him on matters of propriety. Laozi, recognizing that the Dao could not be practiced in an age of chaos, purified himself and departed the state, dedicating himself to clarity and emptiness. Confucius, grieving that the Dao went unfulfilled and that the cultural legacy would be lost, traveled among the various states. Though their paths of advancement and retreat differed, their attire and observance of ritual and law never varied.\n\nIn later generations, the followers of Confucius altered their garments with the customs of each state, while the followers of Laozi did not shift with the times. Thus, the robes of today’s Daoist priests resemble those of the ancient Confucians. As for cultivating life and nature, they are rooted in the *Book of Changes*; in offering sacrifices and invoking spirits, they are rooted in the *Rites of Zhou*, particularly the *Spring Offices* and the *Minister of Rites*. Their talismans, seals, caps, and sashes likewise never stray from ancient institutions.\n\nYet due to the corruptions of later currents, they have been ranked alongside shamans and spirit-mediums. This book is thus composed to exalt them, tracing their origins and currents in thirty-four entries. It is titled *Daoist Scripture in Concord with the Divine*.\n\nComposed in the ninth year of the *Dade* era.\n\nPalaces and Abodes\nIn antiquity, the residences of kings and lords were all called *gong* (palaces), while the tall towers flanking city gates were called *guan* (observatories). The halls featured eastern and western staircases, connected by a gate in alignment. Ancestral temples followed the same design. Today, the Hall of the Most High and the Hall of Great Accomplishment share this form—an ancient institution. As the *Book of Songs* says: *\"Harmonious within the palace.\"* The *Commentary* states: *\"Then they ascended the observation terrace.\"*\n\nAltars for Offerings\nIn ancient times, all sacrifices required an altar. Later, prefectures and commanderies established altars for the gods of soil and grain. The *Records* say: *\"An altar without a roof.\"* Ancient offering altars stood in the open, but today they are placed beneath roofs for simplicity.\n\nBells and Chime-Stones\nIn antiquity, ritual music employed sets of sixteen *bianzhong* (bronze bells) and *bianqing* (chime-stones), corresponding to the twelve pitch-standards and the four clear notes of the *gong* mode. There were also *texuan* bells and *texuan* chime-stones—*texuan* meaning \"suspended alone.\" Today’s bronze bells and jade chime-stones of the cavernous registers, along with large bells, all derive from these. The great bronze chime-stones originate from the practice of striking jars. As the *Rites of Zhou* states: *\"The Fu official casts bells; the Qing official fashions chime-stones.\"*\n\nIncense and Lamps\nIn ancient times, sacrifices involved burning offerings. During Emperor Wu of Han’s worship of the Great Unity, incense and lamps were first used. The *Book of Rites* says: *\"After the libation, then ignite the fragrant reeds.\"*\n\nDivine Spirits\nIn antiquity, the House of Chongli could summon celestial and terrestrial spirits. The *Classic of Mountains and Seas* states: *\"Thereupon Chongli was commanded to sever the connection between earth and heaven.\"* The *Rites of Zhou: Offices of Spring* records that at the winter solstice, music was performed at the Circular Mound, and after six changes of the music, all celestial spirits descended. At the summer solstice, music was performed at the Square Marsh, and after six changes, all terrestrial spirits emerged.\n\nCakes, Fruits, and Wine Offerings\nIn ancient times, sacrifices used millet, glutinous millet, and animal victims. Emperor Wu of Liang substituted animal victims with flour effigies. Emperor Xuanzong of Tang further replaced these with cakes and pastries. The *Rites of Zhou* states that the *Bian* official was responsible for dates, chestnuts, water caltrops, and delicacies, as well as parched grain cakes and powdered offerings. The *Wine* official oversaw the five fermented liquors and three wines.\n\n**Tents and Curtains**\nIn ancient times, palaces and chambers were all furnished with tents and curtains. The *Rites of Zhou* states that the *Muren* official was responsible for them.\n\n**Ritual Attire**\nIn ancient times, ritual attire for sacrifices included the inner garment, knee cover, pendants, and lower robes—what is now called ritual attire is descended from these. Mencius said: \"Without complete attire, one does not dare to perform sacrifices.\" The *Book of Rites* states: \"The noble man of old always wore jade pendants.\"\n\n**Caps and Robes**\nIn ancient times, scholar-officials all wore caps, tied with cords but without hairpins, except for ceremonial *bian* and *mian* caps, which used hairpins. Master Quan wore the *zhangfu* cap, saying: \"I grew up in Song, so I wear the cap of Song.\" Zhuangzi said: \"Yuan Xian wore a birch-bark cap and carried a birch staff\"—this was the birch-bark cap. The *Book of Rites* mentions wide sleeves, referring to robes with large sleeves; Daoist robes belong to this category. When Li Bi of the Tang became a Daoist, he was granted purple robes, and later generations followed this as a custom. The straight collar embodies the spirit of ease and detachment.\n\n**Jade Tablets and Simplified Wands**\nIn ancient times, dukes and marquises all carried jade tablets. The *Rites of Zhou* records the *huan* tablet, *xin* tablet, *shen* tablet, and *gong* tablet. The *Book of Rites* states that scholars held wands of fishbone-patterned bamboo or wooden slips.\n\n**Spirit Tablets**\nIn ancient times, wooden tablets were used in ancestral temple sacrifices, and stone tablets in sacrifices to the altars of soil and grain, as recorded in the *Book of Rites*. Today’s spirit tablets are of the same kind.\n\n**Tally Slips**\nIn ancient times, bamboo slips two *chi* long were used, bound together with leather cords. Some were made of wooden tablets, called *du*. Today’s tally slips follow this model. The *Preface to the Spring and Autumn Annals* says: \"For minor matters, slips and tablets sufficed.\" When Confucius edited the *Spring and Autumn Annals*, he \"wrote when he should write, and excised when he should excise\"—these were wooden tablets. In ancient times, summons and commands used tally tokens. Tallies were made of bamboo slips; today’s yellow-paper spirit-summoning talismans replace bamboo. The human-shaped talisman represents the messenger.\n\n**Chanting the Void**\nIn ancient times, sacrificial music included hymns, or sometimes the *Mao Odes*. Today’s ritual chanting in Daoist ceremonies originates from this. The *Book of Documents* says: \"Sound follows prolonged melody, and tones harmonize.\"\n\n**Memorials and Petitions**\nIn ancient times, sacrifices used prayer tablets; later generations used paper. The *Book of Documents* states: \"The scribe then inscribed the prayer.\" The *Rites of Zhou* records that the Grand Master of Ceremonies oversaw prayers, and the *fanghan* box replaced the wooden tablet case. When Yin Hao sent a letter, it was mistakenly delivered as an empty box—this was a wooden case.\n\n**Kneeling and Bowing**\nThe *Rites of Zhou* records nine types of bows. Today’s prostration with forehead to the ground follows Zhou practice. The *Book of Documents* says: \"Bow, prostrating the head.\" The *Book of Rites* states: \"When receiving [gifts] while standing, one does not kneel.\"\n\n**Ritual Staff**\nIn ancient times, peach branches were used to dispel misfortune. Hou Yi was killed with a peachwood club, so later generations used it to expel ghosts. Today’s *Tianpeng* staff belongs to this category. The *Rites of Zhou* says: \"The shamans and invocators use peachwood and reeds.\"\n\n**Ritual Sword**\nIn ancient times, scholar-officials all wore swords. The *Book of Han* records: \"Swords and shoes were permitted in the palace.\" The *Rites of Zhou* mentions bows and arrows used to rescue the sun and moon—this is its origin. The *jieshui* ritual embodies the meaning of the Rain Master cleansing the dust.\n\n**Directional Silks**\nIn ancient times, sacrifices to the Five Thearchs used colors corresponding to each direction. The five-directional silks follow this practice.\n\n**Incantations**\nOriginally, the character for \"prayer\" (*zhu*) was written with the \"speech\" radical, but later people used the vulgar form with the \"mouth\" radical. When Tang of Shang prayed at the net, or Guo Luo prayed over the mantis eggs, this was the same idea.\n\n**Talismanic Script**\nThe *Rites of Zhou* records that to exorcise inauspicious birds, one wrote the names of the ten days, twelve months, and twelve years on a talisman and hung it on a tree to drive them away. The ancients used seal script; today’s talismanic script resembles this.\n\n**Lamp Arrangement**\nWhen Cang Jie created writing, grain rained from the sky, and ghosts wailed at night. Thus, in Daoist rituals, the earth is marked as a prison, with rice as the boundary. Later generations used rice in all lamp arrangements, following this precedent.\n\n**Spirit Embodiment**\nSince ancient times, sacrifices required a *shi* (spirit impersonator), who was the grandson of the deceased, wearing the ancestor’s attire and sitting in the seat of the spirit tablet. This was also called *jia* (blessing). The *Book of Rites* says: \"The invocator announces with filial piety; the *jia* responds with kindness.\" Today, when offering to the deceased and borrowing a medium, this practice is transmitted from that origin.\n\n**Hand Warmer**\nIn ancient times, the *guanxian* ritual used the *guizan* (jade ladle). The ladle’s shape was a basin with a handle like a jade tablet, filled with wine; when holding the ladle, one did not hold the tablet. Today, when Daoists hold a hand warmer, they do not hold a tablet—this follows the same principle.\n\n**Emperor’s Bell**\nIn ancient sacrifices, dancers held *nao* bells, of which the *dizhong* (Emperor’s Bell) was the smallest.\n\n**Qi Formulae**\nDaoist texts write *qi* with the \"fire\" radical.\n\nThe Dao of Drawing Qi: The Principle of Inhaling and Exhaling Yin and Yang\nThe *Yi Lüe Li* states: \"When the note *gong* is struck, *shang* responds; when the low is cultivated, the high descends—this is the principle of stirring the spirit to its fullest.\" The Qi maiden’s wail summoned wind; Zou Yan’s lament brought frost; and harmonious *qi* arrived when the pitch-pipes were blown—all belong to this category.\n\n**Command Tablet**\nThe *Rites of Zhou* records: \"The *ya zhang* (tusked jade tablet) was used to muster troops.\" The Han bronze tiger tally, round above and square below, bore five tusk-like characters resembling drooping dewdrops, while its reverse depicted a crouching tiger with the inscription: \"Made in the manner of the ancient *ya zhang* as a tiger tally.\" Today, the command tablet used to summon generals follows this method.\n\n**Banners and Canopies**\nThe *Rites of Zhou* includes standards such as *jing*, *mao*, *pei*, and *di*—these are their forms.\n\n**Yun Ao**\nIn ancient times, sacrifices were accompanied by music, which this practice emulates. The banners are typically taller than usual, and the music employs only pure tones to reach Heaven and Earth. Those who carry them in hand symbolize celestial music, allowing it to be performed while moving.\n\n**Praying for the Sick**\nA saying goes: \"When Confucius fell ill, Zilu requested to pray.\" The *Book of Documents* records: \"When King Wu was ill, the Duke of Zhou erected three altars to pray for him.\"\n\n**Praying for Clear Skies or Rain, and Dispelling Disasters**\nAnciently, there was the *chongyu* sacrifice for drought and the sacrifice for floods. King Tang offered himself in place of a sacrificial victim to pray in the mulberry grove. Dong Zhongshu’s *Chunqiu Fanlu* describes methods for summoning or halting rain: crafting five-colored dragons according to the day and celestial stem, each with its own prescribed form—these are not repeated here. To dispel fire, in the eighteenth year of Duke Zhao of Lu, Song, Wei, Chen, and Zheng all suffered fires on the same day. Zichan, acting on behalf of fire, thus made great sacrifices to the earth spirits, performing exorcisms in the four directions to quell the conflagration.\n\n**Fasting from Grain**\nThe *Confucian Family Sayings* states: \"Those who consume *qi* attain spirit clarity and longevity; those who eat grain gain wisdom and skill; those who consume nothing do not die.\"\n\n**Daoists**\nConfucius said: \"A scholar devoted to the Dao—one who eats merely to sustain himself is unworthy of discussion. Likewise, one who feels shame at coarse clothing and poor food is unworthy of discussion.\" The Daoist texts cite the *Aid to the Divine Contract* in full.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "道书援神契 经名：道书援神契。 不着撰人。 一卷。 底本出处：《正统道藏》正一部。 道书援神契序 世之议老子教者，皆曰异端，其初本於儒，而末之流自异也。 儒不可谓之教，天下常道也。 尧、舜、禹、汤、文、武、周公、孔子，相继而作，何教之云？ 周道衰，礼乐废，而俗多诈，视孔子之道若与时异，因指为教，其本诸此。 老子与孔子同时，最号知礼，孔子常问以礼，老子以道莫行於乱世，洁己去国，务为清虚。 孔子悯道之不行，斯文将丧，历聘诸国，其进退不同，衣服礼法未尝异也。 后世孔子徒之服随国俗变，老子徒之服不与俗移。 故今之道士服，类古之儒服也。 至於修养性命，则本乎易； 醮祭鬼神则本乎周礼，春官、宗伯符檄冠佩，又未尝不本乎古之制也。 因末流之弊，列于巫祝，作是书而大之，本其源流凡三十四条，名之日《道书援神契》。 大德九年序。 道书援神契",
      "translated_text": "**The Daoist Scripture in Concord with the Divine: A Preface**\n\nThe text is titled *Daoist Scripture in Concord with the Divine* (*Daoshu Yuanshen Qi*). Its author is unknown. It comprises one scroll. The base text is derived from *The Orthodox Daoist Canon*, First Section.\n\n**Preface to *Daoist Scripture in Concord with the Divine***\n\nThose who discuss the teachings of Laozi in the world all call them heterodox, claiming their origins lie in Confucianism, though their later currents diverged. Yet Confucianism cannot be termed a \"teaching\"—it is the constant Way of all under Heaven. Yao, Shun, Yu, Tang, Wen, Wu, the Duke of Zhou, and Confucius arose in succession—what \"teaching\" is there to speak of? When the Way of Zhou declined, rites and music fell into disuse, and customs grew deceitful. The Way of Confucius was seen as at odds with the times, and thus it was labeled a \"teaching,\" its roots traceable to this.\n\nLaozi lived contemporaneously with Confucius and was most renowned for his mastery of ritual. Confucius often consulted him on matters of propriety. Laozi, recognizing that the Dao could not be practiced in an age of chaos, purified himself and departed the state, dedicating himself to clarity and emptiness. Confucius, grieving that the Dao went unfulfilled and that the cultural legacy would be lost, traveled among the various states. Though their paths of advancement and retreat differed, their attire and observance of ritual and law never varied.\n\nIn later generations, the followers of Confucius altered their garments with the customs of each state, while the followers of Laozi did not shift with the times. Thus, the robes of today’s Daoist priests resemble those of the ancient Confucians. As for cultivating life and nature, they are rooted in the *Book of Changes*; in offering sacrifices and invoking spirits, they are rooted in the *Rites of Zhou*, particularly the *Spring Offices* and the *Minister of Rites*. Their talismans, seals, caps, and sashes likewise never stray from ancient institutions.\n\nYet due to the corruptions of later currents, they have been ranked alongside shamans and spirit-mediums. This book is thus composed to exalt them, tracing their origins and currents in thirty-four entries. It is titled *Daoist Scripture in Concord with the Divine*.\n\nComposed in the ninth year of the *Dade* era.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 360,
      "start_sentence": 0,
      "end_sentence": 18,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.470210790634155,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\道书援神契.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "宫观 古者，王侯之居皆日宫，城门之两旁高楼谓之观，殿堂分东西阶，连以门应。 宗庙亦然。 今天尊殿与大成殿同，古之制也。 诗曰：雍雍在宫。 传曰：遂登观台。 醮坛 古者，祭皆有坛。 后世州郡有社稷坛。 记曰：坛而不屋。 古醮坛在野，今於屋下，从简也。 钟磬 古者，祭乐有编钟、编磬，每架十六，以应十二律及四宫清声。 又有特悬钟、特悬磬。 特悬者，独悬也。 今洞案金钟玉磬，又有大钟等，皆本诸此。 其大铜磬本诸击缶。 《周礼》：凫氏为钟，磬氏为磬。 香灯 古者，祭祀有燔燎，至汉武帝祠太一始用香灯。 《礼记》曰：既奠，然后炳音热萧。 神只 古有重黎氏能降天神地。 祇书曰：乃命重黎，绝地天通。 《周礼· 春官》冬至奏乐於圆丘。 乐六变而天神皆降。 夏至奏乐方泽，乐六变地祇皆出。 饼果附酒 古者，祭用黍稷牺牲。 梁武帝以面为牺牲代之。 唐玄宗又以饼饵代之，《周礼》笾人掌枣栗菱美。 又有糗饼粉赛。 又酒正掌五齐三酒。",
      "translated_text": "Palaces and Abodes\nIn antiquity, the residences of kings and lords were all called *gong* (palaces), while the tall towers flanking city gates were called *guan* (observatories). The halls featured eastern and western staircases, connected by a gate in alignment. Ancestral temples followed the same design. Today, the Hall of the Most High and the Hall of Great Accomplishment share this form—an ancient institution. As the *Book of Songs* says: *\"Harmonious within the palace.\"* The *Commentary* states: *\"Then they ascended the observation terrace.\"*\n\nAltars for Offerings\nIn ancient times, all sacrifices required an altar. Later, prefectures and commanderies established altars for the gods of soil and grain. The *Records* say: *\"An altar without a roof.\"* Ancient offering altars stood in the open, but today they are placed beneath roofs for simplicity.\n\nBells and Chime-Stones\nIn antiquity, ritual music employed sets of sixteen *bianzhong* (bronze bells) and *bianqing* (chime-stones), corresponding to the twelve pitch-standards and the four clear notes of the *gong* mode. There were also *texuan* bells and *texuan* chime-stones—*texuan* meaning \"suspended alone.\" Today’s bronze bells and jade chime-stones of the cavernous registers, along with large bells, all derive from these. The great bronze chime-stones originate from the practice of striking jars. As the *Rites of Zhou* states: *\"The Fu official casts bells; the Qing official fashions chime-stones.\"*\n\nIncense and Lamps\nIn ancient times, sacrifices involved burning offerings. During Emperor Wu of Han’s worship of the Great Unity, incense and lamps were first used. The *Book of Rites* says: *\"After the libation, then ignite the fragrant reeds.\"*\n\nDivine Spirits\nIn antiquity, the House of Chongli could summon celestial and terrestrial spirits. The *Classic of Mountains and Seas* states: *\"Thereupon Chongli was commanded to sever the connection between earth and heaven.\"* The *Rites of Zhou: Offices of Spring* records that at the winter solstice, music was performed at the Circular Mound, and after six changes of the music, all celestial spirits descended. At the summer solstice, music was performed at the Square Marsh, and after six changes, all terrestrial spirits emerged.\n\nCakes, Fruits, and Wine Offerings\nIn ancient times, sacrifices used millet, glutinous millet, and animal victims. Emperor Wu of Liang substituted animal victims with flour effigies. Emperor Xuanzong of Tang further replaced these with cakes and pastries. The *Rites of Zhou* states that the *Bian* official was responsible for dates, chestnuts, water caltrops, and delicacies, as well as parched grain cakes and powdered offerings. The *Wine* official oversaw the five fermented liquors and three wines.",
      "overlap_context": "re rooted in the *Rites of Zhou*, particularly the *Spring Offices* and the *Minister of Rites*. Their talismans, seals, caps, and sashes likewise never stray from ancient institutions.\n\nYet due to the corruptions of later currents, they have been ranked alongside shamans and spirit-mediums. This book is thus composed to exalt them, tracing their origins and currents in thirty-four entries. It is titled *Daoist Scripture in Concord with the Divine*.\n\nComposed in the ninth year of the *Dade* era.",
      "start_char": 360,
      "end_char": 772,
      "start_sentence": 19,
      "end_sentence": 51,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.061574697494507,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\道书援神契.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "帐幕 古者，宫室皆有幕帟。 《周礼》：幕人掌之。 法服 古者，祭祀法服有中单蔽膝佩裳之属，今法服乃其流也。 孟子曰：衣服不备，不敢以祭。 《礼记》曰：古之君子必佩玉。 冠裳 古者，士大夫皆有冠，但缨而不簪，唯弁冕簪缨。 全夫子戴章甫冠，曰：吾长於宋，故冠宋之冠。 庄子曰：原宪华冠华杖，即桦皮冠也。 《礼记》有侈袂，大袖衣也，道衣其类也。 唐李泌为道士，赐紫。 后人因以为常。 直领者，取其萧散之意也。 圭简 古之公侯皆执圭。 《周礼》有桓圭、信音身圭、躬圭。 《礼记》：士执鱼须音班文，竹木简之类也。 位牌 古者，祭宗庙有木主，祭社稷有石主，见《礼记》。 今位牌，即其类也。 符简 古者，以竹二尺为简，以皮连穿之。 又有以木片者，谓之牍。 今符简象此也。 《春秋序》曰：小事简牍而已。 孔子修《春秋》，笔则笔，削则削，是木版也。 古者，召命有符节。 符以竹片为之，今黄纸召神符代竹也。 人形符象，使者也。 步虚 古者，祭祀歌乐章，或歌毛诗。 今法事长吟，本诸此也。 《书》曰：声依永律和声。 章表 古者，祭祀有祝版，后世用纸也。 《书》曰：史乃册祝。 《周礼》：大宗伯掌其祝，号盛奏方函代版匣也。 殷浩寄书，误达空函是木匣也。 跪拜 《周礼》 拜有九等。 今稽首，周法也。 《书》曰：拜，稽首。 《礼记》曰：受立不跪。 法尺 古者，被除不祥，用桃枝。 后羿死於桃棒，故后世逐鬼用之。 今天蓬尺是其类也。 《周礼》曰：巫祝桃茢。 法剑 古之士大夫皆佩剑。 《汉书》：剑履上殿。 《周礼》有救日月之弓矢，此其流也。 劫水，雨师清尘之义也。 方彩 古者，祭五帝各随其方色。 五方信彩是也。 禁祝 古以咒字作祝字，从口旁，乃后人俗字也。 成汤祝网，果羸祝螟蛉，即此意也。 符文 《周礼》禳祆音妖鸟者，以方书十日之号、十二月之号，十二岁之号，悬树上即去。 古人用篆字，今之符文，犹似之也。 铺灯 古者，仓颉制字而天雨粟，鬼夜哭。 故道法划地为狱，以米为界，后世凡铺灯皆用米，本诸此也。 附体 古来祭必有尸，尸者以孙为之，服其祖之服，坐于神位之席，又谓之嘏。 《礼记》曰：祝以孝告，嘏以慈告。 今之荐先亡而借体，通传者本诸此也。 手炉 古者，灌献之礼用圭瓒。 瓒之形盘，柄象圭，盛酒其中，执瓒则不执圭。 今道士执手垆则不执简，亦此意也。 帝钟 古之祀神舞者，执铙帝钟，铙之小者耳。 气诀 道书作炁字。",
      "translated_text": "**Tents and Curtains**\nIn ancient times, palaces and chambers were all furnished with tents and curtains. The *Rites of Zhou* states that the *Muren* official was responsible for them.\n\n**Ritual Attire**\nIn ancient times, ritual attire for sacrifices included the inner garment, knee cover, pendants, and lower robes—what is now called ritual attire is descended from these. Mencius said: \"Without complete attire, one does not dare to perform sacrifices.\" The *Book of Rites* states: \"The noble man of old always wore jade pendants.\"\n\n**Caps and Robes**\nIn ancient times, scholar-officials all wore caps, tied with cords but without hairpins, except for ceremonial *bian* and *mian* caps, which used hairpins. Master Quan wore the *zhangfu* cap, saying: \"I grew up in Song, so I wear the cap of Song.\" Zhuangzi said: \"Yuan Xian wore a birch-bark cap and carried a birch staff\"—this was the birch-bark cap. The *Book of Rites* mentions wide sleeves, referring to robes with large sleeves; Daoist robes belong to this category. When Li Bi of the Tang became a Daoist, he was granted purple robes, and later generations followed this as a custom. The straight collar embodies the spirit of ease and detachment.\n\n**Jade Tablets and Simplified Wands**\nIn ancient times, dukes and marquises all carried jade tablets. The *Rites of Zhou* records the *huan* tablet, *xin* tablet, *shen* tablet, and *gong* tablet. The *Book of Rites* states that scholars held wands of fishbone-patterned bamboo or wooden slips.\n\n**Spirit Tablets**\nIn ancient times, wooden tablets were used in ancestral temple sacrifices, and stone tablets in sacrifices to the altars of soil and grain, as recorded in the *Book of Rites*. Today’s spirit tablets are of the same kind.\n\n**Tally Slips**\nIn ancient times, bamboo slips two *chi* long were used, bound together with leather cords. Some were made of wooden tablets, called *du*. Today’s tally slips follow this model. The *Preface to the Spring and Autumn Annals* says: \"For minor matters, slips and tablets sufficed.\" When Confucius edited the *Spring and Autumn Annals*, he \"wrote when he should write, and excised when he should excise\"—these were wooden tablets. In ancient times, summons and commands used tally tokens. Tallies were made of bamboo slips; today’s yellow-paper spirit-summoning talismans replace bamboo. The human-shaped talisman represents the messenger.\n\n**Chanting the Void**\nIn ancient times, sacrificial music included hymns, or sometimes the *Mao Odes*. Today’s ritual chanting in Daoist ceremonies originates from this. The *Book of Documents* says: \"Sound follows prolonged melody, and tones harmonize.\"\n\n**Memorials and Petitions**\nIn ancient times, sacrifices used prayer tablets; later generations used paper. The *Book of Documents* states: \"The scribe then inscribed the prayer.\" The *Rites of Zhou* records that the Grand Master of Ceremonies oversaw prayers, and the *fanghan* box replaced the wooden tablet case. When Yin Hao sent a letter, it was mistakenly delivered as an empty box—this was a wooden case.\n\n**Kneeling and Bowing**\nThe *Rites of Zhou* records nine types of bows. Today’s prostration with forehead to the ground follows Zhou practice. The *Book of Documents* says: \"Bow, prostrating the head.\" The *Book of Rites* states: \"When receiving [gifts] while standing, one does not kneel.\"\n\n**Ritual Staff**\nIn ancient times, peach branches were used to dispel misfortune. Hou Yi was killed with a peachwood club, so later generations used it to expel ghosts. Today’s *Tianpeng* staff belongs to this category. The *Rites of Zhou* says: \"The shamans and invocators use peachwood and reeds.\"\n\n**Ritual Sword**\nIn ancient times, scholar-officials all wore swords. The *Book of Han* records: \"Swords and shoes were permitted in the palace.\" The *Rites of Zhou* mentions bows and arrows used to rescue the sun and moon—this is its origin. The *jieshui* ritual embodies the meaning of the Rain Master cleansing the dust.\n\n**Directional Silks**\nIn ancient times, sacrifices to the Five Thearchs used colors corresponding to each direction. The five-directional silks follow this practice.\n\n**Incantations**\nOriginally, the character for \"prayer\" (*zhu*) was written with the \"speech\" radical, but later people used the vulgar form with the \"mouth\" radical. When Tang of Shang prayed at the net, or Guo Luo prayed over the mantis eggs, this was the same idea.\n\n**Talismanic Script**\nThe *Rites of Zhou* records that to exorcise inauspicious birds, one wrote the names of the ten days, twelve months, and twelve years on a talisman and hung it on a tree to drive them away. The ancients used seal script; today’s talismanic script resembles this.\n\n**Lamp Arrangement**\nWhen Cang Jie created writing, grain rained from the sky, and ghosts wailed at night. Thus, in Daoist rituals, the earth is marked as a prison, with rice as the boundary. Later generations used rice in all lamp arrangements, following this precedent.\n\n**Spirit Embodiment**\nSince ancient times, sacrifices required a *shi* (spirit impersonator), who was the grandson of the deceased, wearing the ancestor’s attire and sitting in the seat of the spirit tablet. This was also called *jia* (blessing). The *Book of Rites* says: \"The invocator announces with filial piety; the *jia* responds with kindness.\" Today, when offering to the deceased and borrowing a medium, this practice is transmitted from that origin.\n\n**Hand Warmer**\nIn ancient times, the *guanxian* ritual used the *guizan* (jade ladle). The ladle’s shape was a basin with a handle like a jade tablet, filled with wine; when holding the ladle, one did not hold the tablet. Today, when Daoists hold a hand warmer, they do not hold a tablet—this follows the same principle.\n\n**Emperor’s Bell**\nIn ancient sacrifices, dancers held *nao* bells, of which the *dizhong* (Emperor’s Bell) was the smallest.\n\n**Qi Formulae**\nDaoist texts write *qi* with the \"fire\" radical.",
      "overlap_context": "es, Fruits, and Wine Offerings\nIn ancient times, sacrifices used millet, glutinous millet, and animal victims. Emperor Wu of Liang substituted animal victims with flour effigies. Emperor Xuanzong of Tang further replaced these with cakes and pastries. The *Rites of Zhou* states that the *Bian* official was responsible for dates, chestnuts, water caltrops, and delicacies, as well as parched grain cakes and powdered offerings. The *Wine* official oversaw the five fermented liquors and three wines.",
      "start_char": 773,
      "end_char": 1804,
      "start_sentence": 52,
      "end_sentence": 130,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.973054885864258,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\道书援神契.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "取炁之道，呼吸阴阳之义也。 《易略例》曰：命宫而商应，修下而高者降，鼓舞尽神之义也。 齐女号而起风，邹衍哭而降霜，吹律而和气至，皆此类也。 令牌 《周礼》：牙璋以起军旅。 汉铜虎符，上圆下方，刻五牙文，若垂露状，背文作一坐虎形，铭其旁曰：如古牙璋作虎符。 今召将用令牌，此法也。 旛幢 《周礼》有旌旄旆谛之属，此其制 云傲 古者，祭祀有乐，此仿之也。 其常高於常，乐全用清声，达於天地。 手执者象天乐可游行而奏也。 祷疾 语曰：子疾病，子路请祷。 《尚书》：武王疾，周公立三坛以祷之。 睛雨附禳灾 古有崇雩之祭，水早之祭也。 成汤以身代牺牲而祷於桑林之野。 董仲舒《春秋繁露》有请雨止雨法：随日辰造五色龙，各有法式，此不再具。 禳火，春秋昭公十八年，宋卫陈郑同日火，子产为火，故大为社被，禳於四方，振除火灾。 休粮 《孔子家语》曰：食气者，神明而寿； 食谷者，智慧而巧； 不食者不死。 道士 孔子曰：士志於道，食者，未足与议也。 而耻恶衣恶食者，未足与议者。 道书援神契竟",
      "translated_text": "The Dao of Drawing Qi: The Principle of Inhaling and Exhaling Yin and Yang\nThe *Yi Lüe Li* states: \"When the note *gong* is struck, *shang* responds; when the low is cultivated, the high descends—this is the principle of stirring the spirit to its fullest.\" The Qi maiden’s wail summoned wind; Zou Yan’s lament brought frost; and harmonious *qi* arrived when the pitch-pipes were blown—all belong to this category.\n\n**Command Tablet**\nThe *Rites of Zhou* records: \"The *ya zhang* (tusked jade tablet) was used to muster troops.\" The Han bronze tiger tally, round above and square below, bore five tusk-like characters resembling drooping dewdrops, while its reverse depicted a crouching tiger with the inscription: \"Made in the manner of the ancient *ya zhang* as a tiger tally.\" Today, the command tablet used to summon generals follows this method.\n\n**Banners and Canopies**\nThe *Rites of Zhou* includes standards such as *jing*, *mao*, *pei*, and *di*—these are their forms.\n\n**Yun Ao**\nIn ancient times, sacrifices were accompanied by music, which this practice emulates. The banners are typically taller than usual, and the music employs only pure tones to reach Heaven and Earth. Those who carry them in hand symbolize celestial music, allowing it to be performed while moving.\n\n**Praying for the Sick**\nA saying goes: \"When Confucius fell ill, Zilu requested to pray.\" The *Book of Documents* records: \"When King Wu was ill, the Duke of Zhou erected three altars to pray for him.\"\n\n**Praying for Clear Skies or Rain, and Dispelling Disasters**\nAnciently, there was the *chongyu* sacrifice for drought and the sacrifice for floods. King Tang offered himself in place of a sacrificial victim to pray in the mulberry grove. Dong Zhongshu’s *Chunqiu Fanlu* describes methods for summoning or halting rain: crafting five-colored dragons according to the day and celestial stem, each with its own prescribed form—these are not repeated here. To dispel fire, in the eighteenth year of Duke Zhao of Lu, Song, Wei, Chen, and Zheng all suffered fires on the same day. Zichan, acting on behalf of fire, thus made great sacrifices to the earth spirits, performing exorcisms in the four directions to quell the conflagration.\n\n**Fasting from Grain**\nThe *Confucian Family Sayings* states: \"Those who consume *qi* attain spirit clarity and longevity; those who eat grain gain wisdom and skill; those who consume nothing do not die.\"\n\n**Daoists**\nConfucius said: \"A scholar devoted to the Dao—one who eats merely to sustain himself is unworthy of discussion. Likewise, one who feels shame at coarse clothing and poor food is unworthy of discussion.\" The Daoist texts cite the *Aid to the Divine Contract* in full.",
      "overlap_context": "*\nIn ancient times, the *guanxian* ritual used the *guizan* (jade ladle). The ladle’s shape was a basin with a handle like a jade tablet, filled with wine; when holding the ladle, one did not hold the tablet. Today, when Daoists hold a hand warmer, they do not hold a tablet—this follows the same principle.\n\n**Emperor’s Bell**\nIn ancient sacrifices, dancers held *nao* bells, of which the *dizhong* (Emperor’s Bell) was the smallest.\n\n**Qi Formulae**\nDaoist texts write *qi* with the \"fire\" radical.",
      "start_char": 1804,
      "end_char": 2258,
      "start_sentence": 131,
      "end_sentence": 159,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.998639583587646,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\道书援神契.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}