{
  "source_id": "道德真经藏室纂微篇开题",
  "source_file": "chunked_daozang\\道德真经藏室纂微篇开题.json",
  "total_chunks": 4,
  "total_original_chars": 3975,
  "total_translated_chars": 24490,
  "total_translation_time": 72.44366574287415,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\玉诀类\\道德真经藏室纂微篇开题.txt",
    "category": "玉诀类"
  },
  "full_translation": "**The Daoist Classic *Zàngshì Zuǎnwēi* (Hidden Treasures of the Dao/Way: The Chapter on the Revered and Subtle)**\n\n**Title:** *Zàngshì Zuǎnwēi* (Hidden Treasures of the Dao/Way: The Chapter on the Revered and Subtle)\n**Compiled by:** Chen Jingyuan of the Song Dynasty.\n**Ten volumes.**\nAccording to Yang Zhonggen’s preface, this work was published in the sixth year of the reign of Emperor Baobao (1258 CE). The original source: *Zhèngtǒng Dàozàng* (Canon of the Orthodox Daoist Treasury), under the *Dòngshén* (Cavernous Deities) section, *Yùjué* (Jade Prescriptions) category.\n\n---\n\n**Prologue to *Zàngshì Zuǎnwēi* (Hidden Treasures of the Dao/Way: The Chapter on the Revered and Subtle)**\n\nThe sage Laozi bore the surname Li, given name Er, and was called Cōng (or Bóyáng in some accounts). According to Daoist scriptures and writings, he transcended the void before the heavens and earth took form, mastered the marvelous transformations of nature, and dwelled perpetually in the celestial realm, serving as the imperial teacher in succession. These are matters beyond the scope of the six directions, so they are omitted here.\n\nThose who stray from his teachings say this of him: Laozi’s mother, moved by the radiance of a great meteor, conceived. When her time came, she was destined to be of the Li lineage, and gave birth to him in the royal house of Shang. In the seventeenth year of Shang’s eighteenth king, King Yangjia (regnal year *Gēngshēn*), she wandered beneath a Li tree and bore Laozi. He was born with a white head, and thus could speak immediately, pointing to the Li tree and saying: “This is my surname.”\n\nOthers say: His father bore the surname Li, given name Wúguǒ. His mother was of the Yin clan, named Yìshòu. In the ninth year of Shang’s twenty-second king, King Wuding (regnal year *Gēngchén*), on the fifteenth day of the second month at the hour of the Hare (*Mǎoshí*), Laozi was born.\n\nSome accounts describe his physique as follows: eight feet eight inches in height, with a yellow complexion, fine eyebrows, broad forehead, long ears, large eyes, sparse teeth, square mouth, thick lips, and three five lines on his brow that revealed the Dao’s principles. His forehead bore the mark of *rìjiǎo* (sun’s horn), his eyes the *yuèyuān* (moon’s abyss), his nose had twin bones, his ears three openings, his feet pressed upon the *èrwǔ* (two noon) points, and his hands grasped the *shíwén* (ten characters). These peculiarities signified that his *qi* was supremely refined and his form uniquely attuned.\n\nHe was born in the village of Lèxiāng, County Kǔ, State Chu, on the banks of the Yáo River. By the twenty-first year of King Zhòu’s reign (regnal year *Dīngmǎo*), he resided on the southern slopes of Qíshān.\n\nThe Western King (Wūwáng) heard of him and decreed that he be appointed as the *Shǒucángshǐ* (Keeper of the Hidden Treasures). When King Wū conquered Shang, Laozi was transferred to the position of *Zhùxiàshǐ* (Pillar-Hall Historian). Through the reigns of King Chéng and King Kāng, he remained in seclusion, holding his lowly rank in silence.\n\nAfter a long time in the Zhou court, he saw its decline and resigned his post. In the twenty-fifth year of King Zhāo’s reign (regnal year *Guǐchǒu*), on the twenty-ninth day of the fifth month at the hour of the Horse (*Rénwǔ*), he ascended a green ox, rode a thin-wheeled carriage, with Xu Jiā as his charioteer, and departed from Zhou.\n\nThe official of the Pass, Yin Xi, was a Zhou noble, surnamed Yin, given name Xi, and styled *Yánggōng*. He wrote nine chapters on the Dao and virtue. Some say this is the *Xīshēng Jīng* (Scripture of the Western Ascension).\n\nThe passages cited by Zhuangzi and Liezi also speak of him: “He mastered the inner arts of celestial lodges (*xīngsù*), refined the essence of the cosmos, concealed his virtue, and practiced benevolence, while the world knew him not.”\n\nYin Xi was tall and handsome, with a profound appreciation for ancient texts and a mastery of celestial omens and esoteric writings. He observed the heavens and contemplated the earth with unerring insight, penetrating even the subtlest changes, so much so that not even the transformations of spirits and gods could escape him.\n\nHis nature was vast and generous, yet he did not conform to worldly customs. He was kind and frugal, loving all widely, and often diminished himself to aid others. In court, he was a guest of the Eastern Palace; outside, he served as the official of the Hángǔ Pass.\n\nEach time he gazed upon the sky, he yearned for transcendence. Before Laozi arrived at the Pass, Yin Xi climbed the tower and looked in all four directions. He saw a purple cloud rising in the east and drifting westward, and knew that a true sage was about to pass through the capital. He then issued strict orders: his attendants swept the path, burned incense, and awaited the divine omen.\n\nOn the twelfth day of the seventh month (regnal year *Jiǎzǐ*), Laozi arrived at the Pass. Yin Xi, with hands clasped in reverence, invited him to his residence. He then assisted Laozi in washing, grooming, and purifying himself with ritual ablutions. Yin Xi fasted and questioned Laozi until the twenty-fifth day of the twelfth month, when Laozi, feigning illness, resigned his post and imparted the two chapters on the *Dao* and *Virtue* (*Dé*).\n\nYin Xi bowed his head and begged to follow Laozi westward to the deserts of Liúshā. Laozi replied: “You have not yet attained the Dao. How could you follow me to distant lands?”\n\nThe deserts of Liúshā were a foreign realm, where crude customs were difficult to refine. Yet how could the *Héwèi* (Guardian of the Pass) resist such temptations? Only if one nurtures the Dao within, preserving the divine light in one’s essence, can one purify the body, still the mind, and guard the One. After a thousand days of fasting and refining one’s form to its utmost subtlety, then one may seek me in the market of Qīngyáng, Shù District. But even then, how could you?\n\nYin Xi bowed repeatedly and withdrew. Laozi suddenly ascended into the sky, rising slowly toward the *Tàiwēi* (Great Subtlety) constellation.\n\nYin Xi waited until the light faded and the air grew still, then returned to his tower, fasting in seclusion. He barred all servants and attendants, recited the scriptures for three years, and meditated with concentrated thought for a thousand days. His mind became still, his body released, and his bones and flesh dissolved. He then exhausted the mysteries of celestial transformations and the subtleties of form-shifting, mastering them all.\n\nThus, he left his home, transcending the world with lofty strides, and finally reached the market of Qīngyáng. There, he met Laozi. Laozi then commissioned Yin Xi as *Wénshǐ Xiānshēng* (Master of the Primordial Text), and they journeyed together to the deserts of Liúshā.\n\nSome say that during King Zhāo’s reign, Laozi departed the Pass, transforming and guiding the Western barbarians. By the time of King Yōu, he had returned to the central lands.\n\nThus, when Confucius visited Zhou, he revered Laozi and inquired about ritual propriety. Laozi said: “The man you speak of—his flesh and bones have long since decayed. Only his words remain.”\n\nMoreover, the worthy attains his moment and rides the winds, or if not, he travels with humility like the commoner. I have heard this: a skilled merchant hides his wares as if they were nonexistent, while a man of virtue conceals his power, appearing as if foolish. Abandon your arrogance and greed, your vain demeanor and licentious desires—these bring no benefit to your life. This is why I have told you as I have.\n\nConfucius departed and said to his disciples: “I know how the crow flies and the fish swims. I know how the beast runs. The running one can be ensnared with a net, the swimming one with a hook, and the flying one with a snare.\n\nBut the dragon—how it rides the wind and clouds to ascend to the heavens—this I cannot know. Today, I have seen Laozi; he is like the dragon.”\n\nAt that time, the world was in darkness, and the Way of the Kings waned, so he emerged from the pass again. Some say he lived over two hundred years, for he cultivated the Dao and nourished his lifespan.\n\nLaozi received learning from Rongcheng, and inquired about the Dao from Changdao—both were ancient recluse sages.\n\nLaozi’s son was named Zong. Zong served the state of Wei as a general and was ennobled at Duangan. Zong’s son was Zhu, Zhu’s son was Gong, and Gong’s distant descendant was Jia. Jia served under Emperor Wen of Han. Jia’s son, Jie, became the Grand Tutor to the King of Jiaoxi and settled his family in Qi.\n\nWhen Heaven and Earth exist, then Dao techniques exist. Those who uphold the Dao—when have they ever been lacking? From Fu Xi onward, through the Three Dynasties, eminent Daoist sages have appeared in every generation.\n\nSpeaking of Laozi, he was originally a spiritually gifted man, indeed one who attained the Dao with extraordinary precision. In his time, the common folk saw his longevity and his white hair from birth, so they called him Laozi. *Lao* is an honorific for \"old,\" and *zi* is a general honorific for \"master.\"\n\nSome people, upon receiving their fate, possess innate spiritual insight and extraordinary perception, their qi differing from that of ordinary men. They are destined to be masters of the Dao, thus able to be aided by celestial spirits and followed by the multitude of immortals.\n\nTherefore, the methods he transmitted to save the world—such as the Nine Elixirs and Eight Stones, the Jade Nectar and Golden Liquor, preserving the True Self and guarding the Primordial, meditating on the spirit and traversing the inner chambers, guiding the qi and refining the form, warding off disasters and evil, pacifying ghosts and nurturing the nature, fasting and transforming, silent admonition and instruction, commanding ghosts and demons—all these were the common practices Laozi employed to safeguard the world. These were not the ultimate extremes.\n\nLater, governing the family and the world were but minor applications of the Great Dao, the remaining tasks of the Sage.\n\nLaozi, serene and effortless, devoted himself solely to longevity, so even though he remained in Zhou for long, his rank and position did not advance. He harmonized his light and blended with the dust, inwardly possessing natural authenticity. Valuing the Dao, he embraced emptiness and responded spontaneously, transforming without action. Thus, he wrote his book as *mysterious and subtle, difficult to recognize*, and departed once the Dao was complete. This is what is meant by the *vast and true person*.\n\nMoreover, Laozi’s descendants continued their sacrifices without ceasing, ascending to the Celestial Capital of Jade. Zhuangzi’s drumming of his wife’s funeral basin, sending her to serve the Emperor in Heaven, were all acts of those who became masters of the Dao, causing later generations to believe in the attainability of longevity—not as mere marvels, but as something that could be learned, though not fully comprehended.\n\nThis is called the *teaching beyond the square*, possessing the purity of antiquity.\n\nThroughout the dynasties, his temples and reverence have never ceased. In Tang’s Qianfeng Year 1, Emperor Gaozong posthumously conferred the title *Playful Primordial Emperor* upon Laozi. In Guangzhu Year 1, the Empress Dowager posthumously conferred the title *Primordial Heavenly Empress* upon Yin Xi, making him the *Holy Ancestor of the Tang*.\n\nIn antiquity, Laozi composed two treatises, *Dao* and *De*. Today’s *Laozi’s Classic of the Dao and Virtue* was likely titled thus by Guan Yin after receiving the text.\n\nThe Dao is profound and difficult to speak of. There exists a formless unity—compelled to name it, we call it the Dao. Since it permeates all life, it is called *through* (通). Again, *Dao* means to tread. How much more so the Dao of the path, which makes people revere its words and follow its practice!\n\nThe Dao is the revered foundation of virtue. Where there is the Dao, there must be virtue. Virtue is *obtained*. Obtained inwardly in the heart, outwardly in things—obtained and not lost—thus things are allowed to flourish, and this is called virtue.\n\nWhere there is virtue, there must be the Dao. Virtue and the Dao rely upon each other and do not separate, hence *Dao and Virtue*.\n\n*Jing* means *constant*, *law*. It speaks of principles that are constant and can be emulated, as with the Nine Classics. Again, *jing* is an honorific for *book*.\n\nNow, when we say *Dao Jing* (upper) and *De Jing* (lower), the first chapter of the upper takes *Dao*—the Dao that can be spoken of, the constant Dao. The first chapter of the lower takes *upper virtue*—virtue that is not virtue, hence having virtue, and thus the title.\n\nLater commentators, following the text, say the Dao cannot be displayed without virtue, and virtue cannot be illuminated without the Dao. The Dao is formless and without action, thus it precedes the transformation of things. Virtue is functional and active, thus it follows after birth and transformation. When the Dao declines, virtue arises; when virtue declines, the Five Constants arise. This shows that Dao and Virtue are the foundation of all conduct, the root of the Five Constants.\n\nThus, the *Dao Jing* comes first, the *De Jing* follows, the two volumes emulating the generation of the Two Principles, eighty-one chapters symbolizing the extreme number of the sun. Therefore, the upper *Jing* clarifies the Dao by emulating Heaven, the lower *Jing* clarifies virtue by emulating Earth.\n\nHeaven’s number is odd, so the upper *Jing* has thirty-seven chapters. Earth’s number is even, so the lower *Jing* has forty-four chapters. All this originates from ancient sages, continuing the old tradition. This *Classic* takes the profound depths as its core, nature as its body, and Dao and virtue as its function. Its essence lies in governing the self and the state.\n\nTo govern the state: if I do nothing, the people transform themselves; if I desire nothing, the people return to simplicity. To govern the self: block the orifices and close the gates, and the spirit of the valley will not die. Reduce private desires and minimize cravings—this is its essential meaning, which can be spoken of.\n\nBut as for that which cannot be seen when viewed, cannot be heard when listened to, the unfathomable depths beyond depths, the gateway to all marvels—this is surely beyond speech or transmission.\n\nThose who wander in its outer halls all believe they have ascended to the inner chambers and glimpsed its mysteries. Only when they refine their essence and ponder deeply do they realize, regarding the Dao, that even an autumn hair’s tip is but a fraction of what they have yet to grasp.\n\nThey depend on their teachers’ instructions and briefly compile the subtle insights of former sages. Yet, for those who have truly attained enlightenment, this is but a fleeting shadow of self-awakening.\n\nLaozi declared that there is no second Dao in the world, no dual hearts in the Sage. His writing was to transmit the Dao; his teachings were to save the times. Since the times’ afflictions differed, his methods of expression also varied. His methods varied, so his doctrines differed, causing later scholars to see these differences and thus regard Confucius and Laozi as holding opposing teachings.\n\n「If one grasps the Dao and does not constrain it by time, aligns with its essence and is not bound by outward forms, understands its intent without clinging to its words, then the writings of all the sages complement one another without fail, and their teachings do not diverge in the least.\n\nSince the decline of the Three Dynasties, no sage-kings arose, and the world drowned in the excesses of textualism, lacking the means to return to their original nature and restore its simplicity. The Dao waned and virtue declined, never more so than in this age.\n\nLaozi, born in the Zhou era, presented himself with gentle humility, while his true essence was the boundless, unspoiling emptiness that sustains all things—thus his withdrawal from the world and retreat to seclusion.\n\nWhen Guan Ling (尹喜) requested him to record his teachings, he composed the *Eighty-One Chapters* (《道德经》) to elucidate the profound truths of virtue and the Dao.\n\nHis words were concise, his principles vast—rooted in depth, structured by simplicity, refined in essence, and coarse in outward expression. He sought only to restore the people to the unadorned purity of knotted cords (结绳之朴), and nothing more.\n\nHis efforts to uphold teaching and save the times were indeed most urgent and sincere.\n\nAlas, later generations failed to perceive the complete workings of Heaven and Earth or the grand essence of the sages. Confucianists like Sima Qian even claimed that those who study Confucius reject Laozi, and those who study Laozi reject Confucius—saying the Dao does not allow for such divergent paths.\n\nYang Xiong declared: *\"To extinguish rites and music, I have no use for them.\"* Han Yu said: *\"Gazing from a well, one’s view of the sky is small.\"* Yet these three masters (三君子) are one in truth—how could they not understand the sages’ profound intent?\n\nThe Dao is like the seasons: summer thrives in growth, autumn excels in restraint. One brings flourishing abundance, the other brings withering return to origin. Together, they complete the cycle of Heaven’s function.\n\nFrom Fu Xi’s first creation of laws to the reigns of Yao and Shun, and through the Three Dynasties, rites and music were fully established, resplendent and complete—this was the summer of the Dao.\n\nIn Laozi’s time, ritualistic excesses had grown too severe. If one did not curb the superficial flourishes and return to virtue and the Dao, how could the sage’s grand work ever be fulfilled?\n\nHis words state: *\"When the Dao is lost, virtue appears; when righteousness is lost, rites arise.\"* Rites, being the thinnest veneer of loyalty and trust, are also the source of chaos. He proclaimed that nothing is more exalted than virtue and the Dao, nor more debased than rites. If rites are reversed to restore righteousness, and righteousness is then returned to virtue and the Dao, then this is indeed sufficient for governing the world.\n\nThus, he dismissed righteousness, rites, wisdom, and intelligence, recording only the virtue and Dao to instruct all under Heaven.\n\nIn later generations, some spoke of the *\"mixed formation of things\"* and *\"that which precedes Heaven and Earth.\"*\n\nAt the beginning of the *Yijing* (《易》), all was in a state of undifferentiated chaos (浑沦), without visible form or nameable *qi*. Only when the changes of the *Yijing* manifest as one did numbers arise.\n\nOne change yields seven, seven changes yield nine, and nine is completion—then it returns again to one, tracing its origin. Such endless transformations and cycles have no end.\n\nThus, Laozi wrote *Eighty-One Chapters* (九九篇) to reveal the ebb and flow of yin and yang, the rise and fall of calamity and fortune, the Dao’s ceaseless motion, and the beginning and end of human affairs—all without exception.\n\nConfucius lived in Laozi’s time and also recorded his teachings to ensure their immortality. Confucius said: *\"My learning knows no end.\"* Laozi, however, sought to transcend learning.\n\nConfucius said: *\"Must one be a sage?\"* Laozi, however, sought to transcend sainthood.\n\nConfucius prized righteousness and rites, while Laozi abandoned them. Confucius promoted worthy talent, but Laozi did not exalt the virtuous.\n\nConfucius said: *\"The wise are not confused.\"* Laozi declared: *\"To govern with wisdom is to harm the state.\"* His words were largely opposed, yet was this deliberate contradiction?\n\nLaozi’s true aim was to reveal the fundamental nature of the Dao to rectify the times’ excesses, while Confucius established the conventional paths of the Dao to adapt to worldly changes. Their approaches could not help but differ.\n\nTo transcend learning is to allow one’s nature and destiny to unfold naturally, achieving the marvel of *\"sitting in forgetfulness\"* (坐忘) and daily refinement.\n\nTo transcend sainthood is to let people rest in their natural state, without the ambition to dazzle or confuse the wise and simple alike.\n\nTo abandon righteousness and rites is to eliminate the distinctions of favoritism and partiality, ensuring that the world does not cling to *\"only love one’s own parents and children\"* (不独亲其亲，子其子), but instead unifies in filial piety and benevolence (同归於孝慈).\n\nTo not exalt the virtuous is to end the disputes of Confucians and Mohists, so that the world has no hearts of mutual rivalry or ambition (无夸跂相轧之心).\n\n*\"To govern with wisdom is to harm the state\"*—the more deceitful and false the words, the more constrained the wisdom becomes. Who could compare this to governance that is *\"dim and quiet\"* (闷闷), allowing the people to remain *\"pure and simple\"* (淳淳)?\n\nThe reason their teachings differ is not to create opposition, but rather because of Laozi’s and Zhuangzi’s writings—where nineteen out of twenty are allegorical (寓言), and their profound truths are often conveyed through dialogues between Confucius and Laozi, or accounts of Confucius inquiring about rites. Does this make their Dao divergent?\n\nWhy then do we have phrases like *\"stealing comparisons from Laozi and Peng Zu\"* (窃比老彭) or *\"like a dragon\"* (犹龙)? It must be that their names differ, yet their essence is the same.\n\nLater generations, bound by rigid doctrines, saw the sages as increasingly distant in outward form.\n\nLaozi said: *\"My words are very easy to know, very easy to practice. Yet the world cannot know them, cannot practice them.\"*\n\nA thousand generations later, if one sage arises, they will apply what they know and practice, achieving a reign of *\"pure clarity\"* (清静之治). They will also expound upon his words, creating a vast and profound text.\n\nIf the four seas return to simplicity, and the virtue and Dao are not forgotten, how fortunate would that be! How fortunate would that be!\n\n**Bo Ge of Wen Kang (文康公葛邲) in succession to Zhong (仲)** recorded this. **Bi Xuzi Chen Jun (碧虚子陈君)** received instruction from **Zhang Wumen (张无梦)**, the **Hong Mengzi (鸿蒙子)** of Tian Tai Mountain (天台山), attaining Laozi’s essence. He printed the *藏室纂微篇* (*Collected Essentials from the Hidden Chamber*), gathering the refined insights of all commentaries while integrating his master’s secret transmissions. Its meaning encompasses both Dao and things, elucidates the principles of purity and simplicity, and magnifies the divine transformations of the sages.\n\nDuring the **Xining era (熙宁)**, he was summoned to the imperial audience hall and presented his work. The emperor’s favor was exceptional, and it was decreed to be included in the *Daozang* (《道藏》). It was enshrined in famous mountains across the land, and scholars of the four seas took it as their model and standard.»\n\nThe **Master Yang Zhonggeng (仲庚)**, having sought the Dao in the western lands of Shu at the end of the Five Dynasties period and later studied this scripture in the southeastern regions, devoted himself to its teachings from youth to old age. Though he fathomed the profound depths of the *Yin-Yang* mysteries, he still gazed across the boundless sea of meaning with humble awe—grateful to glimpse the essentials of the *Collected Essentials from the Hidden Chamber*, as though parting the clouds to behold the sun and moon.\n\nYet, lamenting that the world lacked a flawless edition and its circulation remained limited, he reverently collated and meticulously corrected the text from the *Daozang*. He solicited benevolent patrons, commissioned artisans to engrave and print it, ensuring its enduring transmission.\n\nIn gratitude, he first honors the **Dao Ancestor of the Primordial Void (玄元道祖)** for establishing the teachings, then repays the nurturing guidance of his father and master. He prays that all kindred spirits may delve deeply, pondering the text to align with the Dao, all attaining the realization of *wuwei* (non-action), thereby perpetuating the true Daoist spirit, safeguarding the nation’s prosperity, and—though but a humble hermit—offering a token of filial gratitude.\n\nOn the **First Day of the First Month, the Year of the Horse (戊午)**, in the **Bao’you era (宝佑)** of the Great Song, **Yang Zhonggeng (杨仲庚)**, the overseer and abbot of **Lingshan Lingying Observatory (灵应观)**, respectfully prostrates and inscribes this preface.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "道德真经藏室纂微篇 经名：道德真经藏室慕微篇。 宋陈景元编撰。 十卷。 据杨仲庚序，是书朴理宗宝佑六年（公元一二五八年）刊行。 底本出处：《正统道藏》洞神部玉诀类。 道德真经藏室纂微开题 老子姓李，名耳，字聪，或字伯阳。 按道家经籍所说，则挺生空洞之先，变化自然之妙，而常居天上，代为帝师，此则六合之外事，故略而不论也。 非其径庭之语者，举其大药，云：老子母感大流星而有娠，应见于李氏，降生于商室，於商十八王阳甲之十七年，岁在庚申，寄胎托娠，经八十一年，极太阳九九之数。 其母常逍遥李树之下，而生老子。 老子生而皓首，故能言，因指李曰：此吾姓也。 又云：父姓李，名无果。 母尹氏，名益寿。 当商二十二王武丁之九年，岁在庚辰，二月十五日卯时生也。 或云老子身长八尺八寸，黄色，美眉，广颗，聃耳，大目，疏齿，方口，厚唇，额有三五达理，日角月渊，鼻有双骨，耳有三漏，足蹈二午，手握十文，盖察气至清，而受形特异。 生於楚国苦县濑乡曲仁里，涡水之阴。 至纣二十一年丁卯岁，居岐山之阳。 西伯闻之，诏为守藏史。 武王克商，转为柱下史，历成、康之世，潜默卑秩。 居周久之，见周衰而退官。 至昭王二十五年癸丑岁，五月二十九日壬午，乃乘青牛薄軬车，徐甲为御，遂去周。 关令尹喜，周大夫也，姓尹，名喜，字阳公。 着书九篇，说道德之事。 或今西升经是。 又庄、列所引之句或言善内学星宿，服精华，隐德行仁，时人莫知也。 喜姿形长美，雅好典坟，善天文秘纬，仰观俯察，莫不洞彻，虽鬼神之变无以匿。 其情大度恢杰，不修俗礼，慈俭博爱，损身济物，入为东宫宾友，出补函谷关令。 每望霄汉，有升虚之思。 老子未至关时，喜登楼四望，见东方有紫云西迈，知有真人当过京邑，乃戒严，门吏扫路焚香以俟应兆。 至七月十二日甲子，老子到关。 喜擎腮曲拳，邀迎就舍，巾栉盥漱，斋戒问道，至于十二月二十五日，退官托疾，二十八日，授《道》《德》二篇。 喜叩头请随老子西祖流沙。 老子曰：汝未得道，恶能随吾远适。 夫流沙异域，犷俗难化，而何卫可御邪，唯生道入腹，神明皆存，而能除垢止念，静心守一，千日清斋，炼形入妙，而后可寻吾於蜀郡青羊之肆，其若之何。 喜唯唯而谢。 老子忽然腾空，冉冉升乎太微。 喜候光景斯散，影响萧寂，楼居清斋，屏绝童隶，诵经三年，精思千日，心凝形释，骨肉都融。 已而穷数达变之微，因形移易之妙，无不尽之矣。 於是去家，超然高蹈，既往青羊之肆，乃会老子。 老子命喜为文始先生，俱游乎流沙之域。 或日昭王时出关，化导西胡，至幽王时，却还中夏。 故孔子适周，严事老子而问礼焉。 老子曰：子所言者，其人与骨皆已朽矣，独其言在耳。 且君子得其时则驾，不得其时则蓬累而行。 吾闻之，良贾深藏若虚，君子盛德，容貌若愚，去子之骄气与多欲，态色与淫志，是皆无益於子之身，吾所以告子若是而已。 孔子去，谓弟子曰：乌吾知其能飞，鱼吾知其能游，兽吾知其能走。 走者可以为罔，游者可以为纶，飞者可以为矰。 至於龙，吾不能知其乘风云而上天。 吾今日见老子，其犹龙邪。",
      "translated_text": "**The Daoist Classic *Zàngshì Zuǎnwēi* (Hidden Treasures of the Dao/Way: The Chapter on the Revered and Subtle)**\n\n**Title:** *Zàngshì Zuǎnwēi* (Hidden Treasures of the Dao/Way: The Chapter on the Revered and Subtle)\n**Compiled by:** Chen Jingyuan of the Song Dynasty.\n**Ten volumes.**\nAccording to Yang Zhonggen’s preface, this work was published in the sixth year of the reign of Emperor Baobao (1258 CE). The original source: *Zhèngtǒng Dàozàng* (Canon of the Orthodox Daoist Treasury), under the *Dòngshén* (Cavernous Deities) section, *Yùjué* (Jade Prescriptions) category.\n\n---\n\n**Prologue to *Zàngshì Zuǎnwēi* (Hidden Treasures of the Dao/Way: The Chapter on the Revered and Subtle)**\n\nThe sage Laozi bore the surname Li, given name Er, and was called Cōng (or Bóyáng in some accounts). According to Daoist scriptures and writings, he transcended the void before the heavens and earth took form, mastered the marvelous transformations of nature, and dwelled perpetually in the celestial realm, serving as the imperial teacher in succession. These are matters beyond the scope of the six directions, so they are omitted here.\n\nThose who stray from his teachings say this of him: Laozi’s mother, moved by the radiance of a great meteor, conceived. When her time came, she was destined to be of the Li lineage, and gave birth to him in the royal house of Shang. In the seventeenth year of Shang’s eighteenth king, King Yangjia (regnal year *Gēngshēn*), she wandered beneath a Li tree and bore Laozi. He was born with a white head, and thus could speak immediately, pointing to the Li tree and saying: “This is my surname.”\n\nOthers say: His father bore the surname Li, given name Wúguǒ. His mother was of the Yin clan, named Yìshòu. In the ninth year of Shang’s twenty-second king, King Wuding (regnal year *Gēngchén*), on the fifteenth day of the second month at the hour of the Hare (*Mǎoshí*), Laozi was born.\n\nSome accounts describe his physique as follows: eight feet eight inches in height, with a yellow complexion, fine eyebrows, broad forehead, long ears, large eyes, sparse teeth, square mouth, thick lips, and three five lines on his brow that revealed the Dao’s principles. His forehead bore the mark of *rìjiǎo* (sun’s horn), his eyes the *yuèyuān* (moon’s abyss), his nose had twin bones, his ears three openings, his feet pressed upon the *èrwǔ* (two noon) points, and his hands grasped the *shíwén* (ten characters). These peculiarities signified that his *qi* was supremely refined and his form uniquely attuned.\n\nHe was born in the village of Lèxiāng, County Kǔ, State Chu, on the banks of the Yáo River. By the twenty-first year of King Zhòu’s reign (regnal year *Dīngmǎo*), he resided on the southern slopes of Qíshān.\n\nThe Western King (Wūwáng) heard of him and decreed that he be appointed as the *Shǒucángshǐ* (Keeper of the Hidden Treasures). When King Wū conquered Shang, Laozi was transferred to the position of *Zhùxiàshǐ* (Pillar-Hall Historian). Through the reigns of King Chéng and King Kāng, he remained in seclusion, holding his lowly rank in silence.\n\nAfter a long time in the Zhou court, he saw its decline and resigned his post. In the twenty-fifth year of King Zhāo’s reign (regnal year *Guǐchǒu*), on the twenty-ninth day of the fifth month at the hour of the Horse (*Rénwǔ*), he ascended a green ox, rode a thin-wheeled carriage, with Xu Jiā as his charioteer, and departed from Zhou.\n\nThe official of the Pass, Yin Xi, was a Zhou noble, surnamed Yin, given name Xi, and styled *Yánggōng*. He wrote nine chapters on the Dao and virtue. Some say this is the *Xīshēng Jīng* (Scripture of the Western Ascension).\n\nThe passages cited by Zhuangzi and Liezi also speak of him: “He mastered the inner arts of celestial lodges (*xīngsù*), refined the essence of the cosmos, concealed his virtue, and practiced benevolence, while the world knew him not.”\n\nYin Xi was tall and handsome, with a profound appreciation for ancient texts and a mastery of celestial omens and esoteric writings. He observed the heavens and contemplated the earth with unerring insight, penetrating even the subtlest changes, so much so that not even the transformations of spirits and gods could escape him.\n\nHis nature was vast and generous, yet he did not conform to worldly customs. He was kind and frugal, loving all widely, and often diminished himself to aid others. In court, he was a guest of the Eastern Palace; outside, he served as the official of the Hángǔ Pass.\n\nEach time he gazed upon the sky, he yearned for transcendence. Before Laozi arrived at the Pass, Yin Xi climbed the tower and looked in all four directions. He saw a purple cloud rising in the east and drifting westward, and knew that a true sage was about to pass through the capital. He then issued strict orders: his attendants swept the path, burned incense, and awaited the divine omen.\n\nOn the twelfth day of the seventh month (regnal year *Jiǎzǐ*), Laozi arrived at the Pass. Yin Xi, with hands clasped in reverence, invited him to his residence. He then assisted Laozi in washing, grooming, and purifying himself with ritual ablutions. Yin Xi fasted and questioned Laozi until the twenty-fifth day of the twelfth month, when Laozi, feigning illness, resigned his post and imparted the two chapters on the *Dao* and *Virtue* (*Dé*).\n\nYin Xi bowed his head and begged to follow Laozi westward to the deserts of Liúshā. Laozi replied: “You have not yet attained the Dao. How could you follow me to distant lands?”\n\nThe deserts of Liúshā were a foreign realm, where crude customs were difficult to refine. Yet how could the *Héwèi* (Guardian of the Pass) resist such temptations? Only if one nurtures the Dao within, preserving the divine light in one’s essence, can one purify the body, still the mind, and guard the One. After a thousand days of fasting and refining one’s form to its utmost subtlety, then one may seek me in the market of Qīngyáng, Shù District. But even then, how could you?\n\nYin Xi bowed repeatedly and withdrew. Laozi suddenly ascended into the sky, rising slowly toward the *Tàiwēi* (Great Subtlety) constellation.\n\nYin Xi waited until the light faded and the air grew still, then returned to his tower, fasting in seclusion. He barred all servants and attendants, recited the scriptures for three years, and meditated with concentrated thought for a thousand days. His mind became still, his body released, and his bones and flesh dissolved. He then exhausted the mysteries of celestial transformations and the subtleties of form-shifting, mastering them all.\n\nThus, he left his home, transcending the world with lofty strides, and finally reached the market of Qīngyáng. There, he met Laozi. Laozi then commissioned Yin Xi as *Wénshǐ Xiānshēng* (Master of the Primordial Text), and they journeyed together to the deserts of Liúshā.\n\nSome say that during King Zhāo’s reign, Laozi departed the Pass, transforming and guiding the Western barbarians. By the time of King Yōu, he had returned to the central lands.\n\nThus, when Confucius visited Zhou, he revered Laozi and inquired about ritual propriety. Laozi said: “The man you speak of—his flesh and bones have long since decayed. Only his words remain.”\n\nMoreover, the worthy attains his moment and rides the winds, or if not, he travels with humility like the commoner. I have heard this: a skilled merchant hides his wares as if they were nonexistent, while a man of virtue conceals his power, appearing as if foolish. Abandon your arrogance and greed, your vain demeanor and licentious desires—these bring no benefit to your life. This is why I have told you as I have.\n\nConfucius departed and said to his disciples: “I know how the crow flies and the fish swims. I know how the beast runs. The running one can be ensnared with a net, the swimming one with a hook, and the flying one with a snare.\n\nBut the dragon—how it rides the wind and clouds to ascend to the heavens—this I cannot know. Today, I have seen Laozi; he is like the dragon.”",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1211,
      "start_sentence": 0,
      "end_sentence": 49,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 27.921064615249634,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\道德真经藏室纂微篇开题.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "是时天下暗，王道衰，故再出关。 或言二百余岁，以其修道而养寿也。 老子受学於容成，问道於常摐，皆古之隐君子也。 老子之子，名宗。 宗仕魏，为将军，封於段干。 宗之子注，注之子宫，宫之远孙假，假仕於汉孝文帝。 假之子解，解为胶西王印太傅，因家于齐。 夫有天地，则有道术，道卫之士，何时暂乏。 自伏羲以来，至于三代，显名道士，世世有之。 论之老子，本亦人灵，盖得道之尤精者也。 时俗见其久寿，又生而皓首，故曰老子。 老者尊称也。 子者通号也。 人受命自有通神达见者，禀气与常人不同，应为道主，故能为天神所济，众仙所从。 是以所出度世之法，若九丹八石，玉醴金液，存真守元，思神历藏，行气炼形，消灾辟恶，治鬼养性，绝谷变化，默固教戒，役使鬼魅，皆老子常所经历救世之卫，非至极者也。 已而治家治世，皆大道之土苴，圣人之余事也。 老子恬淡无为，专以长生为务，故在周虽久，而名位不迁者，盖和光同尘，内实自然，所贵道，虚无因应，变化无为，故着书称微妙难识，道成乃去，是所谓博大真人也。 且老子之子孙，祭祀不辍，而升于玉京。 庄子之鼓盆，送妻而入侍帝宸，皆为道之宗师者，使后世之人，信长生之可学，非神异，而学不能及也。 是曰方外之教，有淳古之风焉。 历代尊崇庙貌不绝。 至唐乾封元年，高宗诏赠老子为玄元皇帝。 光宅元年，太后诏赠尹氏为先天太后，故为有唐圣祖焉。 昔老子着书曰《道》《德》二篇，今曰《老子道德经》者，当是关尹受书之后标题云耳。 夫道者杳然难言，有物混成，强名曰道，以其通生万物，故训曰通。 又道，蹈也。 况道路之道，使人佩服其言，而履行之也。 道者德之钦，有道则必有德，德，得也。 内得於心，外得於物，得而不丧也，故物得以生，谓之德。 有德则必全道，道德相须而不相离，故曰道德也。 经者，常也，法也。 言其理有常可法，如九经可法之义。 又经者，书之尊称也。 今言《道经》上，《德经》下者，上篇之首取其道，可道，非常道。 下篇之首取其上德不德，是以有德，而题之也。 后之说者，故随文生义，言道非德无以显，德非道无以明。 道无为无形，故居化物之先。 德有用有为，故在生化之后。 道衰而有德，德衰而有五常，是明道德为众行之先，五常之本。 故《道经》居先，《德经》次之，上、下二卷，法两仪之生育，八十一章，象太阳之极数。 是以上经明道以法天，下经明德以法地。 天数奇，故上经三十有七章。 地数偶，故下经四十有四章。 此皆起自先贤，且仍旧贯，此经以重渊为宗，自然为体，道德为用，其要在乎治身、治国。 治国则我无为而民自化，我无欲而民自朴。 治身则塞其兑闭其门，谷神不死，少私寡欲。 此其要旨，可得而言也。 若夫视之不见，听之不闻，渊之又渊，众妙之门，殆不可得而言传也。 故游其廊麻者，皆自以谓升堂睹奥，及其研精覃思，然后於道，知其秋毫之端，万分未得处一焉。 辄依师授之旨，略纂昔贤之微，其如悦惚杳冥在达者之 自悟耳。 老子论 天下无二道，圣人无两心，其着书所以传道，其垂教所以救时。 救时之弊不同，故迹之出亦异，其迹既异，故立言有不同，使后世之士於此异观，而以孔、老为殊训也。",
      "translated_text": "At that time, the world was in darkness, and the Way of the Kings waned, so he emerged from the pass again. Some say he lived over two hundred years, for he cultivated the Dao and nourished his lifespan.\n\nLaozi received learning from Rongcheng, and inquired about the Dao from Changdao—both were ancient recluse sages.\n\nLaozi’s son was named Zong. Zong served the state of Wei as a general and was ennobled at Duangan. Zong’s son was Zhu, Zhu’s son was Gong, and Gong’s distant descendant was Jia. Jia served under Emperor Wen of Han. Jia’s son, Jie, became the Grand Tutor to the King of Jiaoxi and settled his family in Qi.\n\nWhen Heaven and Earth exist, then Dao techniques exist. Those who uphold the Dao—when have they ever been lacking? From Fu Xi onward, through the Three Dynasties, eminent Daoist sages have appeared in every generation.\n\nSpeaking of Laozi, he was originally a spiritually gifted man, indeed one who attained the Dao with extraordinary precision. In his time, the common folk saw his longevity and his white hair from birth, so they called him Laozi. *Lao* is an honorific for \"old,\" and *zi* is a general honorific for \"master.\"\n\nSome people, upon receiving their fate, possess innate spiritual insight and extraordinary perception, their qi differing from that of ordinary men. They are destined to be masters of the Dao, thus able to be aided by celestial spirits and followed by the multitude of immortals.\n\nTherefore, the methods he transmitted to save the world—such as the Nine Elixirs and Eight Stones, the Jade Nectar and Golden Liquor, preserving the True Self and guarding the Primordial, meditating on the spirit and traversing the inner chambers, guiding the qi and refining the form, warding off disasters and evil, pacifying ghosts and nurturing the nature, fasting and transforming, silent admonition and instruction, commanding ghosts and demons—all these were the common practices Laozi employed to safeguard the world. These were not the ultimate extremes.\n\nLater, governing the family and the world were but minor applications of the Great Dao, the remaining tasks of the Sage.\n\nLaozi, serene and effortless, devoted himself solely to longevity, so even though he remained in Zhou for long, his rank and position did not advance. He harmonized his light and blended with the dust, inwardly possessing natural authenticity. Valuing the Dao, he embraced emptiness and responded spontaneously, transforming without action. Thus, he wrote his book as *mysterious and subtle, difficult to recognize*, and departed once the Dao was complete. This is what is meant by the *vast and true person*.\n\nMoreover, Laozi’s descendants continued their sacrifices without ceasing, ascending to the Celestial Capital of Jade. Zhuangzi’s drumming of his wife’s funeral basin, sending her to serve the Emperor in Heaven, were all acts of those who became masters of the Dao, causing later generations to believe in the attainability of longevity—not as mere marvels, but as something that could be learned, though not fully comprehended.\n\nThis is called the *teaching beyond the square*, possessing the purity of antiquity.\n\nThroughout the dynasties, his temples and reverence have never ceased. In Tang’s Qianfeng Year 1, Emperor Gaozong posthumously conferred the title *Playful Primordial Emperor* upon Laozi. In Guangzhu Year 1, the Empress Dowager posthumously conferred the title *Primordial Heavenly Empress* upon Yin Xi, making him the *Holy Ancestor of the Tang*.\n\nIn antiquity, Laozi composed two treatises, *Dao* and *De*. Today’s *Laozi’s Classic of the Dao and Virtue* was likely titled thus by Guan Yin after receiving the text.\n\nThe Dao is profound and difficult to speak of. There exists a formless unity—compelled to name it, we call it the Dao. Since it permeates all life, it is called *through* (通). Again, *Dao* means to tread. How much more so the Dao of the path, which makes people revere its words and follow its practice!\n\nThe Dao is the revered foundation of virtue. Where there is the Dao, there must be virtue. Virtue is *obtained*. Obtained inwardly in the heart, outwardly in things—obtained and not lost—thus things are allowed to flourish, and this is called virtue.\n\nWhere there is virtue, there must be the Dao. Virtue and the Dao rely upon each other and do not separate, hence *Dao and Virtue*.\n\n*Jing* means *constant*, *law*. It speaks of principles that are constant and can be emulated, as with the Nine Classics. Again, *jing* is an honorific for *book*.\n\nNow, when we say *Dao Jing* (upper) and *De Jing* (lower), the first chapter of the upper takes *Dao*—the Dao that can be spoken of, the constant Dao. The first chapter of the lower takes *upper virtue*—virtue that is not virtue, hence having virtue, and thus the title.\n\nLater commentators, following the text, say the Dao cannot be displayed without virtue, and virtue cannot be illuminated without the Dao. The Dao is formless and without action, thus it precedes the transformation of things. Virtue is functional and active, thus it follows after birth and transformation. When the Dao declines, virtue arises; when virtue declines, the Five Constants arise. This shows that Dao and Virtue are the foundation of all conduct, the root of the Five Constants.\n\nThus, the *Dao Jing* comes first, the *De Jing* follows, the two volumes emulating the generation of the Two Principles, eighty-one chapters symbolizing the extreme number of the sun. Therefore, the upper *Jing* clarifies the Dao by emulating Heaven, the lower *Jing* clarifies virtue by emulating Earth.\n\nHeaven’s number is odd, so the upper *Jing* has thirty-seven chapters. Earth’s number is even, so the lower *Jing* has forty-four chapters. All this originates from ancient sages, continuing the old tradition. This *Classic* takes the profound depths as its core, nature as its body, and Dao and virtue as its function. Its essence lies in governing the self and the state.\n\nTo govern the state: if I do nothing, the people transform themselves; if I desire nothing, the people return to simplicity. To govern the self: block the orifices and close the gates, and the spirit of the valley will not die. Reduce private desires and minimize cravings—this is its essential meaning, which can be spoken of.\n\nBut as for that which cannot be seen when viewed, cannot be heard when listened to, the unfathomable depths beyond depths, the gateway to all marvels—this is surely beyond speech or transmission.\n\nThose who wander in its outer halls all believe they have ascended to the inner chambers and glimpsed its mysteries. Only when they refine their essence and ponder deeply do they realize, regarding the Dao, that even an autumn hair’s tip is but a fraction of what they have yet to grasp.\n\nThey depend on their teachers’ instructions and briefly compile the subtle insights of former sages. Yet, for those who have truly attained enlightenment, this is but a fleeting shadow of self-awakening.\n\nLaozi declared that there is no second Dao in the world, no dual hearts in the Sage. His writing was to transmit the Dao; his teachings were to save the times. Since the times’ afflictions differed, his methods of expression also varied. His methods varied, so his doctrines differed, causing later scholars to see these differences and thus regard Confucius and Laozi as holding opposing teachings.",
      "overlap_context": "and greed, your vain demeanor and licentious desires—these bring no benefit to your life. This is why I have told you as I have.\n\nConfucius departed and said to his disciples: “I know how the crow flies and the fish swims. I know how the beast runs. The running one can be ensnared with a net, the swimming one with a hook, and the flying one with a snare.\n\nBut the dragon—how it rides the wind and clouds to ascend to the heavens—this I cannot know. Today, I have seen Laozi; he is like the dragon.”",
      "start_char": 1211,
      "end_char": 2448,
      "start_sentence": 50,
      "end_sentence": 103,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 16.42919087409973,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\道德真经藏室纂微篇开题.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "苟通其道而不窒以时，会其心而不拘以迹，得其意而不泥以言，则诸圣之书相为终始，固未尝少戾也。 自三代之季，圣王不作，天下溺於文胜之弊，无以反其情性，而复其初。 道降德衰，未有甚於此时者也。 老聃氏生於周，以濡弱谦下为表，以虚空不毁万物为实，故其去藏室而隐也。 关令尹喜请着书，遂作八十一章，以畅道德之旨。 其辞简，其理远，以深为根，以约为纪，以本为精，以末为粗，必欲使斯民复结绳之朴而后已。 其所以扶教救时，可谓切至矣。 不幸后世不见天地之全功，圣人之大体，儒者若马迁氏，至谓学儒者黜老，学老者黜儒，道不同不相为谋也。 杨雄氏曰：绝灭礼乐，吾无取焉。 韩愈氏曰：坐井观天，其见者小也。 三君子者一，何不知圣人之甚欤。 盖道犹岁也，圣人时也。 夏以生出为功，秋以收敛为德，一则使之荣华而蕃鲜，一则使之凋悴而反本，相因而岁功成焉。 且自伏羲始造法，迄于尧、舜、三代，礼乐制作，炳然大备，则夏之时也。 当老子之时，礼文过度，若不敛浮华而归道德，圣功何由而成哉。 其言失道而后德至，失义而后礼，礼者忠信之薄而乱之首者，谓天下莫尊於道德，而莫卑於礼，苟自礼反之於仁义，仁义复归於道德，其於治天下有不足为矣。 所以黜仁义礼智，而皆以道德着书诏天下。 后世其言，有物混成，先天地生。 夫太易之初，浑沦而已，无形体之可见，无气质之可名，逮乎易变而为一，始有数矣。 一变而为七，七变而为九，九者究也，乃复归而为一，即其所生而归之也。 如此变化往复，何有穷尽。 故老氏着书九九篇，以明阴阳消息，祸福倚伏，天道往来，人事终始，无不备焉。 孔子与老氏同时，皆着书以垂不朽。 孔子曰：我学不厌。 老氏则绝学。 孔子曰：必也圣乎。 老氏则绝圣。 孔子贵仁义，老氏弃仁义。 孔子举贤才，老氏不尚贤。 孔子曰：智者不惑。 老氏曰：以智治国，国之贼。 其立言大率相反，是岂故相乖背耶。 盖孔子立道之常以经世变，老子明道之本以救时弊，其势不得不然也。 绝学则使已任其性命之情，而造坐忘日损之妙。 绝圣则使人安其性命之情，而无惊愚明污之志。 弃仁义，则无别趸踶跂之私，使天下不独亲其亲，子其子，而同归於孝慈。 不尚贤，则无儒、墨毕起之争，使天下无夸跂相轧之心。 以智治国，国之贼，言浇伪多而智愈困，孰若政闷闷而民淳淳哉。 其所以立言不同者，以此及庄周之书，寓言十九，发明玄旨多假孔、老相为问答，而传亦载其问礼之事，使其道异耶。 何为有窃比老彭及犹龙之语，是必有名异而实同者。 后世束教之士，以迹观圣人相去益远矣。 老子曰：吾言甚易知，甚易行。 天下莫能知，莫能行。 万世之后，一遇圣贤，既以其所知行之，而成清静之治。 又以其所言发之，而为博大之书。 使四海还淳，道德不废，抑何幸欤。 抑何幸欤。 文康公葛邲次仲述 碧虚子陈君景元，师事天台山鸿蒙子张无梦，得老氏心，印有《道德经藏室纂微篇》，盖摭诸家注疏之精华，而参以师传之秘文，义该赡道物兼明，发挥清静之宗，丕赞圣神之化。 熙宁中，召对便殿，因进所着。 睿眷殊渥宣附《道藏》，镇诸名山，四海学徒，典刑是赖。",
      "translated_text": "「If one grasps the Dao and does not constrain it by time, aligns with its essence and is not bound by outward forms, understands its intent without clinging to its words, then the writings of all the sages complement one another without fail, and their teachings do not diverge in the least.\n\nSince the decline of the Three Dynasties, no sage-kings arose, and the world drowned in the excesses of textualism, lacking the means to return to their original nature and restore its simplicity. The Dao waned and virtue declined, never more so than in this age.\n\nLaozi, born in the Zhou era, presented himself with gentle humility, while his true essence was the boundless, unspoiling emptiness that sustains all things—thus his withdrawal from the world and retreat to seclusion.\n\nWhen Guan Ling (尹喜) requested him to record his teachings, he composed the *Eighty-One Chapters* (《道德经》) to elucidate the profound truths of virtue and the Dao.\n\nHis words were concise, his principles vast—rooted in depth, structured by simplicity, refined in essence, and coarse in outward expression. He sought only to restore the people to the unadorned purity of knotted cords (结绳之朴), and nothing more.\n\nHis efforts to uphold teaching and save the times were indeed most urgent and sincere.\n\nAlas, later generations failed to perceive the complete workings of Heaven and Earth or the grand essence of the sages. Confucianists like Sima Qian even claimed that those who study Confucius reject Laozi, and those who study Laozi reject Confucius—saying the Dao does not allow for such divergent paths.\n\nYang Xiong declared: *\"To extinguish rites and music, I have no use for them.\"* Han Yu said: *\"Gazing from a well, one’s view of the sky is small.\"* Yet these three masters (三君子) are one in truth—how could they not understand the sages’ profound intent?\n\nThe Dao is like the seasons: summer thrives in growth, autumn excels in restraint. One brings flourishing abundance, the other brings withering return to origin. Together, they complete the cycle of Heaven’s function.\n\nFrom Fu Xi’s first creation of laws to the reigns of Yao and Shun, and through the Three Dynasties, rites and music were fully established, resplendent and complete—this was the summer of the Dao.\n\nIn Laozi’s time, ritualistic excesses had grown too severe. If one did not curb the superficial flourishes and return to virtue and the Dao, how could the sage’s grand work ever be fulfilled?\n\nHis words state: *\"When the Dao is lost, virtue appears; when righteousness is lost, rites arise.\"* Rites, being the thinnest veneer of loyalty and trust, are also the source of chaos. He proclaimed that nothing is more exalted than virtue and the Dao, nor more debased than rites. If rites are reversed to restore righteousness, and righteousness is then returned to virtue and the Dao, then this is indeed sufficient for governing the world.\n\nThus, he dismissed righteousness, rites, wisdom, and intelligence, recording only the virtue and Dao to instruct all under Heaven.\n\nIn later generations, some spoke of the *\"mixed formation of things\"* and *\"that which precedes Heaven and Earth.\"*\n\nAt the beginning of the *Yijing* (《易》), all was in a state of undifferentiated chaos (浑沦), without visible form or nameable *qi*. Only when the changes of the *Yijing* manifest as one did numbers arise.\n\nOne change yields seven, seven changes yield nine, and nine is completion—then it returns again to one, tracing its origin. Such endless transformations and cycles have no end.\n\nThus, Laozi wrote *Eighty-One Chapters* (九九篇) to reveal the ebb and flow of yin and yang, the rise and fall of calamity and fortune, the Dao’s ceaseless motion, and the beginning and end of human affairs—all without exception.\n\nConfucius lived in Laozi’s time and also recorded his teachings to ensure their immortality. Confucius said: *\"My learning knows no end.\"* Laozi, however, sought to transcend learning.\n\nConfucius said: *\"Must one be a sage?\"* Laozi, however, sought to transcend sainthood.\n\nConfucius prized righteousness and rites, while Laozi abandoned them. Confucius promoted worthy talent, but Laozi did not exalt the virtuous.\n\nConfucius said: *\"The wise are not confused.\"* Laozi declared: *\"To govern with wisdom is to harm the state.\"* His words were largely opposed, yet was this deliberate contradiction?\n\nLaozi’s true aim was to reveal the fundamental nature of the Dao to rectify the times’ excesses, while Confucius established the conventional paths of the Dao to adapt to worldly changes. Their approaches could not help but differ.\n\nTo transcend learning is to allow one’s nature and destiny to unfold naturally, achieving the marvel of *\"sitting in forgetfulness\"* (坐忘) and daily refinement.\n\nTo transcend sainthood is to let people rest in their natural state, without the ambition to dazzle or confuse the wise and simple alike.\n\nTo abandon righteousness and rites is to eliminate the distinctions of favoritism and partiality, ensuring that the world does not cling to *\"only love one’s own parents and children\"* (不独亲其亲，子其子), but instead unifies in filial piety and benevolence (同归於孝慈).\n\nTo not exalt the virtuous is to end the disputes of Confucians and Mohists, so that the world has no hearts of mutual rivalry or ambition (无夸跂相轧之心).\n\n*\"To govern with wisdom is to harm the state\"*—the more deceitful and false the words, the more constrained the wisdom becomes. Who could compare this to governance that is *\"dim and quiet\"* (闷闷), allowing the people to remain *\"pure and simple\"* (淳淳)?\n\nThe reason their teachings differ is not to create opposition, but rather because of Laozi’s and Zhuangzi’s writings—where nineteen out of twenty are allegorical (寓言), and their profound truths are often conveyed through dialogues between Confucius and Laozi, or accounts of Confucius inquiring about rites. Does this make their Dao divergent?\n\nWhy then do we have phrases like *\"stealing comparisons from Laozi and Peng Zu\"* (窃比老彭) or *\"like a dragon\"* (犹龙)? It must be that their names differ, yet their essence is the same.\n\nLater generations, bound by rigid doctrines, saw the sages as increasingly distant in outward form.\n\nLaozi said: *\"My words are very easy to know, very easy to practice. Yet the world cannot know them, cannot practice them.\"*\n\nA thousand generations later, if one sage arises, they will apply what they know and practice, achieving a reign of *\"pure clarity\"* (清静之治). They will also expound upon his words, creating a vast and profound text.\n\nIf the four seas return to simplicity, and the virtue and Dao are not forgotten, how fortunate would that be! How fortunate would that be!\n\n**Bo Ge of Wen Kang (文康公葛邲) in succession to Zhong (仲)** recorded this. **Bi Xuzi Chen Jun (碧虚子陈君)** received instruction from **Zhang Wumen (张无梦)**, the **Hong Mengzi (鸿蒙子)** of Tian Tai Mountain (天台山), attaining Laozi’s essence. He printed the *藏室纂微篇* (*Collected Essentials from the Hidden Chamber*), gathering the refined insights of all commentaries while integrating his master’s secret transmissions. Its meaning encompasses both Dao and things, elucidates the principles of purity and simplicity, and magnifies the divine transformations of the sages.\n\nDuring the **Xining era (熙宁)**, he was summoned to the imperial audience hall and presented his work. The emperor’s favor was exceptional, and it was decreed to be included in the *Daozang* (《道藏》). It was enshrined in famous mountains across the land, and scholars of the four seas took it as their model and standard.»",
      "overlap_context": ", for those who have truly attained enlightenment, this is but a fleeting shadow of self-awakening.\n\nLaozi declared that there is no second Dao in the world, no dual hearts in the Sage. His writing was to transmit the Dao; his teachings were to save the times. Since the times’ afflictions differed, his methods of expression also varied. His methods varied, so his doctrines differed, causing later scholars to see these differences and thus regard Confucius and Laozi as holding opposing teachings.",
      "start_char": 2448,
      "end_char": 3665,
      "start_sentence": 104,
      "end_sentence": 154,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 23.289856910705566,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\道德真经藏室纂微篇开题.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "仲庚西蜀末访道东南，课习是经，垂髻逮白，义海重玄，望洋窃叹，幸窥纂微之要，若披云雾而睹日月也。 第以世无善本，流行未博，敬就藏恢详加校正，募化善士，命工刊梓，以传不朽。 上答玄元道祖立言开教之恩，次酬父师生成训迪之赐，普祈同志，潜心玩绎，因言会道，俱证无为，益衍真风，保安国祚，庶表林下野人报本之万一云。 皇宋宝佑戊午上元日，瞻山灵应观开山管辖住持观事臣杨仲庚拜手馑书。",
      "translated_text": "The **Master Yang Zhonggeng (仲庚)**, having sought the Dao in the western lands of Shu at the end of the Five Dynasties period and later studied this scripture in the southeastern regions, devoted himself to its teachings from youth to old age. Though he fathomed the profound depths of the *Yin-Yang* mysteries, he still gazed across the boundless sea of meaning with humble awe—grateful to glimpse the essentials of the *Collected Essentials from the Hidden Chamber*, as though parting the clouds to behold the sun and moon.\n\nYet, lamenting that the world lacked a flawless edition and its circulation remained limited, he reverently collated and meticulously corrected the text from the *Daozang*. He solicited benevolent patrons, commissioned artisans to engrave and print it, ensuring its enduring transmission.\n\nIn gratitude, he first honors the **Dao Ancestor of the Primordial Void (玄元道祖)** for establishing the teachings, then repays the nurturing guidance of his father and master. He prays that all kindred spirits may delve deeply, pondering the text to align with the Dao, all attaining the realization of *wuwei* (non-action), thereby perpetuating the true Daoist spirit, safeguarding the nation’s prosperity, and—though but a humble hermit—offering a token of filial gratitude.\n\nOn the **First Day of the First Month, the Year of the Horse (戊午)**, in the **Bao’you era (宝佑)** of the Great Song, **Yang Zhonggeng (杨仲庚)**, the overseer and abbot of **Lingshan Lingying Observatory (灵应观)**, respectfully prostrates and inscribes this preface.",
      "overlap_context": "ter’s secret transmissions. Its meaning encompasses both Dao and things, elucidates the principles of purity and simplicity, and magnifies the divine transformations of the sages.\n\nDuring the **Xining era (熙宁)**, he was summoned to the imperial audience hall and presented his work. The emperor’s favor was exceptional, and it was decreed to be included in the *Daozang* (《道藏》). It was enshrined in famous mountains across the land, and scholars of the four seas took it as their model and standard.»",
      "start_char": 3665,
      "end_char": 3850,
      "start_sentence": 155,
      "end_sentence": 158,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 4.803553342819214,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\道德真经藏室纂微篇开题.txt",
        "category": "玉诀类"
      }
    }
  ]
}