{
  "source_id": "道教三字经",
  "source_file": "chunked_daozang\\道教三字经.json",
  "total_chunks": 5,
  "total_original_chars": 4954,
  "total_translated_chars": 27261,
  "total_translation_time": 215.7727963924408,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\藏外\\道教三字经.txt",
    "category": "藏外"
  },
  "full_translation": "**\"Daoist Three-Character Classic\" by Yi Xinying**\n\n**I: The Dao’s Single Qi Transforms the Three Pure Ones**\nThe Great Dao, one in *qi*, gives birth to the Three Pure Ones.\nMost void and numinous, most subtle and profound.\nThough named with force, it is the Great Dao.\nIts essence is naturally so—\nManifest in Oneness, it precedes the Sovereign’s form.\nFormless and boundless, its essence is profound.\nFrom its mysterious transformation, light and sound arise.\nIt cleaves the murky chaos, gradually brightening.\nThe Boundless shifts, dividing into three *qi*s.\nFirst, the Azure *qi*—named *Qingwei*.\nThe Dragon-Han kalpa shines with celestial splendor.\nThe Primordial White *qi*—named *Yuyu*.\nThe True Text appears, illuminating the Great Void.\nThe Dark-Yellow *qi*—named *Dachi*.\nThe Sovereign Above opens, and myriad transformations teem.\n\n**II: The Three Caverns’ Scriptures and Talismans Surpass All Ages**\nThe Venerable Primordial One expounds the Cavern of Truth.\nHe initiates the Great Teaching, expounding the Three Vehicles.\nThe Venerable Soul-Treasure expounds the Cavern of Mystery.\nGolden precepts are established; sacred talismans are transmitted.\nThe Venerable Dao and Virtue expounds the Cavern of the Divine.\nTwelve divisions instruct gods and humans.\nA sacred platform is erected within the Treasure Pearl.\nScriptures are transmitted, their meanings boundless.\nOur august sovereign gathers the Cloud Books,\nCorrecting the Celestial Chant at the kalpa’s dawn.\nHe translates the Three Caverns, then the Four Auxiliaries—\nSeventy-two in total, surpassing all ages.\n\n**III: The Gods Proclaim the Dao and Ascend to Heaven**\nFrom the Jade Pure to the Western Paradise,\nThe Mysterious Wind spreads, harmonizing transformations.\nThe Jade Emperor, most compassionate,\nAbandons his royal seat, enduring hard practice through countless kalpas,\nHis resolve never dimmed.\nHe attains the Golden Immortal, named *Rulai*.\nHe rules the Jade Capital, pacifying the Xiao Platform.\nThe Heavenly Sovereign governs the Three Realms,\nReciting scriptures to sever obstacles.\nHe instructs the Bodhisattvas: no inner or outer distinction.\nThe Quiet and Mysterious Venerable, Lin Biancai,\nPreaches the Law on the Nine-Harmony Terrace.\nHe initiates the Old Master, teaching the Way of Perfection.\nHe transforms kings, saving subjects.\nHis teachings spread to three thousand souls.\nThey receive this decree and ascend in broad daylight.\n\n**IV: The Ancient Daoist Lineage Venerates the Great Cavern Scripture**\nTracing the source, we seek the distant past.\nThose who verified the Dao recorded only the Universal.\nExamining the True Lineage, we distinguish the ancestral sects.\nGreat and small sects are counted from the beginning.\nThe Ancient Daoist Lineage remains from antiquity,\nFlourishing most brightly in the Yellow Emperor’s age.\nTo govern the realm, he emulated Guangcheng.\nHe visited Kongtong, discussing longevity.\nHe came to Jutusi, glimpsing Jinglu.\nHe honored the True Ones, offering the *Zhi Tu* diagram.\nHe explored the Nine Chambers of Qingcheng Peak,\nGaining the Dragon’s hoofprints—evidence remains.\nHe guarded the One Scripture, taught by the Immortal King.\nHe lectured on the principles of life, dispelling illness.\nWithout agitating the essence, without exhausting the spirit,\nHe preserved limbs and senses, discarding cleverness.\nHarmonizing *qi* and spirit, he formed the Immortal embryo.\nAt twelve hundred years, his body showed no decay.\nIn the Pure Joy Realm, a prince emerged,\nFree from dust, liberated from birth and death.\nEntering the Great Harmony, he toiled diligently.\nBrandishing the Wisdom Sword, he subdued the Two Tyrants.\nLeaping from the Southern Cliff, he manifested True Martial.\nHis great deed accomplished, he repaid his parents.\nKing Fu Cha of Wu revered him deeply.\nSeeking to save others, he went to Qi.\nThe *Kongdong Pian* was not lightly revealed.\nThis tradition, passed down for forty thousand kalpas,\nIs one lineage, venerating the Great Cavern.\nResearching the True Principle, Canghu was weighty.\n\n**V: The Golden Elixir and Mysterious Refinement Are Complementary**\nThe Golden Elixir Sect began with Wa Huang.\nHe illuminated transformation, following Yin-Yang.\nBy the time of Xuanyuan, he devoted himself to research.\nAfter governing and teaching, he pursued immortality.\nHe combined divine medicines, refining the Golden Elixir.\nWith the Dragon Chariot ascending, many near officials were saved.\nBeneath Jing Mountain, ancient traces remain.\nThis is one lineage, venerating the Nine Cauldrons.\nRefining mercury and lead, he exhausted the roots.\nThe Mysterious Refinement Sect received the True Transmission.\nHuang Shi was instructed during the Zhou’s宣 era.\nHe clarified inner cultivation, the law being simplest:\nOnly still the heart—dispel desires.\nEmpty and still, observe the Three Essentials.\nOnly serene, aspiring to the Dao’s utmost.\nThis is one lineage, venerating Stillness.\n\nHolding the Fixed Observation, the Round Pearl shines.\n\n**VI: Embryonic Breath and Yellow Sprouts Return to Infantile Vitality**\nThe Changhuai Sect opened the Divine.\nDwelling above, he attained the True.\nThe Return-to-Root Method restores the Commanding Gate.\nA single-character decree is pondered in stillness.\nObserving clouds arise, he tunes the unstrung.\nExhausting the subtle and vast, he encompasses heaven and earth.\nThis is one lineage, venerating Embryonic Breath.\nThe Unstrung’s resonance connects to the Boundless.\nThe Harmony-Preserving Sect, from Master Contong,\nConsumes the Five Sprouts, eating Cloud Flowers.\nStrictly guarding, his Primordial Spirit is full.\nHis body unyielding, he defies Heaven’s work.\nThis is one lineage, venerating *Qi*-Nourishment.\nGuarding the Mysterious Female, he returns to the Marvelous Truth.\n\n**VII: The Inner Chamber Cultivates Life and Harmonizes the Spirit**\nThe Spirit-Harmonizing Sect was transmitted by Su Nu.\nLife-preservation methods reveal human subtleties.\nHealing myriad ailments, his skill was wondrous.\nRestoring injuries, his face never aged.\nHe gathered *jing* and *qi*, filling marrow and brain.\nAvoiding deceit, he was cautious in examination.\nThis is one lineage, venerating the Inner Chamber.\nClarifying the *Qi* Dao, he nurtures the Yang method.\n\n**VIII: The Southern Palace’s Cangyi Strengthens Vitality and Spirit**\nThe Southern Palace Sect follows the One True.\nSecret incantations subdue ghosts and gods.\nBrandishing the Spirit Sword, demons flee.\nHidden forms appear—this must be verified in person.\nThis is one lineage, venerating Talismans and Charms.\nDirecting spirit and matter, merging with clouds.\nThe Cangyi Sect stems from Pengtong,\nWho studied with Dayu and Shen Nong.\nRefining cinnabar, he followed the Heavenly Pattern.\nGathering divine medicines, he used the Nine Additions.\nConsuming stone elixirs, eating immortal herbs,\nHe transformed marrow into essence, returning to the Immortal form.\nThis is one lineage, venerating Alchemical Nourishment.\nExtending life, preserving original essence.\nThe *Jianli* Sect flourished under Xi Nong.\nRed Pine’s descendants numbered Ningfeng.\nHealing vacuity and evil *qi*, one may prolong years.\nGargling the Spirit Elixir, calamities do not approach.\nLubricating joints, unblocking the *dantian*,\nStrengthening the body, firming sinews and bones,\nSubduing worms and snakes, removing afflictions,\nDriving away evil diseases from a hundred *li* away.\nThis is one lineage, venerating *Daoyin* exercises.\nRefining the subtle, entering the marvelous realm.\n\n**IX: Establishing Altars to Subdue Evil—Narrated from the Beginning**\nThe Ritual Sect descended from Gao Xin.\nTending the Virtue Platform, he bore the Sacred Talisman.\nDrawing on the Two Principles, he established the Mountain Spirit’s foundation.\n\n「Nurturing the nation’s lineage, averting calamities and misfortunes.\nObtaining liberation, attaining the Mysterious Palace.\nHiding the Golden Tablet, sealing the Mountain’s decree.\nThe King of Xia, Yu, personally diligent and frugal.\nDredging the Nine Rivers, dispelling temporal afflictions.\nPiercing the Gorge Gates, facing many perils.\nPraying to the Mountain Spirit, aided by the Hidden Sage.\nRevealing the Jade Seal, alongside the Sacred Talisman.\nSevering worldly constraints, dispatching the Child of Law.\nMountain-dwelling incantations, subduing demons with might.\nForbidding mountain sacrilege, locking the Huai Whirlpools.\nFulfilling this life, harmonizing water and earth.\nMerits accomplished, entering the Bright Yang Palace.\n\nBetween Wu and Hui, Zhang the recluse arose.\nPlowing the riverside, he gained the Primordial Beginning.\nConstructing the Spirit Hall, devoutly offering sustenance.\nMoved by Heaven’s Venerable One, he received the Great Cavern.\nScriptures and Talismans’ methods, transmitted with the Heart Seal.\nA single verse of praise, from Yuan Bo’s respect.\nWarding off pestilence, eradicating epidemics.\nRooted wishful power, returning to the Supreme Deity.\nKing He of Yue, ascending to the baoqiu mound.\nGazing at the Forest Dwelling, he obtained Yu’s writings.\nCombining one scroll, with red jade characters.\nA hundred and seven, plus fourteen more.\nThe True Ritual Sect’s methods, their teachings preserved.\nThe Standard and Ritual formats, seven degrees in total.\nTalismans and Rituals, precepts and laws.\nTalismans a hundred and two, Rituals forty-six.\nPrecepts a thousand and two, laws aligned with Qi.\nGreat and small chapters, all part of the Ritual.\nThis one lineage, venerating the Spirit Treasure Dao.\nPraising the Divine Illumination, reaching the most profound depths.\n\n**X: The Pillared History Sect’s Esoteric Transmission—From Sanfeng**\nThe Pillared History Sect, esteemed as the Celestial Mysterious, descended to Sanfeng.\nRevering the Pillared Historian, surnamed Youlong.\nBeyond the Tang and Song, reaching Sanfeng.\nGuān Lìng’s Marshal, the first transmission.\nComposing nine chapters, expounding on its origins.\nXi Yi the Lord, hidden in Taihua.\nThe Woodian Gathering, a historian’s praise.\nThe Sixth Patriarch Zhang, named Hidden Sage.\nUniting the south and north, the Essentials of Mysterious Dao.\nBelow Xi Yi, the Daoist learning flourished.\nThe third transmission, Yao Fu received it.\nThe \"Observing Things\" chapter, a scripture for the world.\nThe Great Rounded Principle, harmonizing with the Void.\nThe sixth transmission, Lin Xi succeeded.\nThe Taiji Diagram, following the Old Master’s *Yijing*.\nThe Confucian school, with Master Zhongni.\nThe Sage of Law, his aspiration fulfilled.\nDeparting Zhou, during the reign of King Jing.\nInquiring about rites, he consulted Master Laozi.\nAfter Zi Gong, it was Xun Qing.\nEvaluating the scholars, their distinctions made clear.\nHuman hearts are perilous, the Daoist heart is subtle.\nSixteen characters, the Daoist scripture’s words.\nThe fifth transmission, thus Han Fei.\nInterpreting Master Lao’s teachings, his name in the Law.\nTo Jia Yi, following the ancient sages.\nIlluminating the Dao’s methods, refining the \"Old Chapter.\"\nThe Eleventh: The Teachings of Daoism from Mount Mao—Many Transmitters\nThe Daoist Healing Sect, originating from the Elder.\nTo An Qi, teachings were divided.\nThe Yellow-Lao arts, skilled in governing the people.\nPassed to Gai Gong, ending as a Han official.\nBelow An Qi, entrusted to Ma Ming.\nFollowing Inner Learning, the True Sage of Yin.\nGaining the Great Clarity, entering Red City.\nRefining White Gold, blessing the poor in times.\nThe third transmission, Wei Boyang.\nStudying the *Tongqi* Contract, the King of the Alchemical Scriptures.\nThe Sage’s Transmission, straightforwardly stated.\nClaiming the *Yijing* as metaphor, discussing the Elixir.\nTang Pengxiao, based on the Primordial Axis.\nClarifying the True Meaning, illuminating the Mirror Diagram.\n\nThe Teaching of the Mao Mountain Sect—Ghost Valley as Master\nInstructed in the Foundations, concealed at Hua Mountain.\nShu Shen Jun, transmitted in the Western City.\nObtained the Two Scenes, returning to Jin Tan.\nThe Fifth Transmission, Qingxu True Sage.\nThe Eight Hidden Scriptures, the High Immortal Classic.\nSixth Transmission to Zhou, surnamed Zisun.\nThe Linghui Talisman, the Golden Mysteries Chapter.\nBelow Qingxu, Wei Fu Ren.\nRetreating to the Quiet Chamber, mastering the Yellow Court.\nThe Ninth Generation, Yang Xi Jun.\nInstructed in the True Law, composing the *Qu Su* Text.\nBelow Zisun, promoting Xu Ying.\nConsuming Jade Elixir, receiving Brain Essence.\nThe Second Generation, Xu Shilang.\nHealing abdominal ailments, practicing the Alchemical Prescriptions.\nJian Ji Gong, the Sixth in Line.\nCultivating the Daoist Canon, compiling the Scriptures and Talismans.\nThe Eighth Generation, Tao Zhengbai.\nInterpreting the True Edicts, rectifying the Hidden Precepts.\nThe Eleventh Generation, surnamed Sima.\nSitting in Forgetfulness, attaining the Supreme Greatness.\nDiscussing humanity’s worth, valuing life.\nLife in the Dao suffices, returning to True Nature.\n\n---\nThe Twelve: Essential Alchemical Numerology of the Bo Immortal\nThe Alchemical Sect, descending from the Western Queen Mother.\nDescending to the Muted Palace, instructing Emperor Wu of Han.\nThe Shangqing Scripture, twelve matters expounded.\nExamining the Inner Transmission, meticulously recorded.\nThirteen transmissions, all in alchemical arts.\nThe Five Profits’ disciples, few grasp the True Meaning.\nHan’s Huainan King valued the Elixir Arts.\nThe *Hongbao* Classic, alas, long lost.\nThe Bo Immortal, transmitted by the Left Family.\nThe *Liuzhu* Song, recording his life.\nRefining the True One, entering Great Stillness.\nThe Ritual and Offering Methods, bequeathed to Bao Zheng.\nJin’s Baopuzi obtained Zheng’s writings.\nExpounding the Elixir Dao, over a thousand words.\nDiscussing Immortal Prescriptions, discerning the Primordial Intent.\nTwelve Chapters, hailed as unparalleled skill.\n\n---\nThe Thirteen: The Taiping Zhengyi Yu Zhang Sect\nThe Taiping Sect, taught by Yu Ji.\nThe *Qingling* Book, one hundred seventy scrolls.\nPracticing this Law, successors multiplied.\nDiscussing the Revival of the Nation, weighing minutely.\nValuing the Scripture’s intent, only Xiang Kai.\nRepeatedly petitioning, the ruler remained unmoved.\nThe Zhengyi Sect, the Han Heavenly Master.\nThe *Mengwei* Talisman, the Ritual Chapters.\nSevering the Old Qi, dissolving the Three Activities.\nObtaining the Great Elixir, distinguishing true from false.\nVenerating the *Doujing*, crossing the Jade Circuit.\nSixty-three generations, passed down through the ages.\nThe Mysterious Learning Sect, following He Wang.\nThe *Chongxu* Treatise, expounding Laozi and Zhuangzi.\nTo the Seven Worthies, learning without learning.\nGazing into the Hall’s depths, promoting Xiang Guo.\nThe Yu Zhang Sect, ancestral to Lan Qi.\nThe Filial and Fraternal King, the True Master.\nPersonally enlightening, digging three tombs.\nSeeing corpses, his body suddenly whole.\nLevitating afar, displaying supernatural power.\nThe Copper Talisman and Vouchers, containing divine efficacy.\nTransmitted to Chen Mu, guarding the True Eagle.\nCharging the Initiates, the Edict of Jingyang.\nThe Third Ancestor Xu, surnamed Xiantu.\nThe *Shifen* Record, the Cauldron of Law.\n\n---\nThe Fourteen: Complete Perfection Cultivation—Southern and Northern Schools\nThe Southern School arose, ancestral to Bo Duān.\nAt Tianhui Zhen, mastered by Hai Tan.\nAt parting, he personally entrusted:\n“Abandon your methods; I shall grant initiation.”\nEncountering the Ma Clan, the True Conduct Officer.\nArriving in Jinghu, consuming the Elixir and ascending.\nThe Third Ancestor Xue, originally a monk.\nStudying the *Xinglin*, under Huan Xia.\nCommunicating the Sect’s Essence, composing the *Fuming* Chapter.\nObtaining External Protection, the Dao thus complete.\nThe Fourth Ancestor Chen, surnamed Nihuan.\nPracticing base arts, hiding in the marketplace.\nThe *Dalei* Scripture, bestowed by Mother Li.\nExterminating demonic forces, averting calamities.\nThe Elixir in the Jar, distributed for relief.\nThe *Cui Xu* Chapter, left to the scattered officials.\nThe Fifth Ancestor Bai, residing at Wuyi.\nThe *Haiqiong* Collection, revealing the Mysteries.\n\nThe Northern School’s Master, surnamed Chongyang.\nFollowing the Bell and Lu, ancestral to Shaoyang.\nFive Chapters of Text, attaining Sweet Tranquility.\nReviving the Dead, entering the Tomb Chamber.\nBurning the Grass Hut, discerning true from false.\nJourneying to the Eastern Sea, crossing the Fierce Steed.\nBefore birth, personally dissecting.\nThe Nine-Turn Elixir, few comprehend.\nFifteen Discourses, the Teaching Compilation.\nMeasuring the Scriptures, encompassing Mysterious Meaning.\nThe Qiu-Liu Debate, the Hao-Wang-Sun.\nThe Yuan Zhong Emperor honored the Longmen Sect.\nBelow Danyang, ancestral to Piyun.\nThe *Wutu* Scripture, gathering Mysterious Texts.\nThe Fourth Ancestor Zhao, residing at Nan Yue.\nThe *Tongyuan* Treatise, regretting later scholars.\nZhi Xu Wong, the direct transmission.\nExpounding the Great Essentials, elucidating the Primordial.\nBelow Changchun, ancestral to Zhiping.\nInheriting the Teachings, in Yan Jing.\nThe *Baoguang* Collection, and the Sayings.\nEstablishing the Daoist Hall, expanding the framework.\nThe Fourth Ancestor Li, named Haoran.\nThe *Xiyou* Record, a posthumous work.\nThe Fifth Ancestor Wang, composing *Xinxin*.\nGifting the Bright Teaching, presiding over Baiyun.\nAnother eight transmissions, reaching Chongxu.\nComposing *Zhengli*, clarifying Mysterious Mechanisms.\nFollowing this, Monk Huayang.\nWriting the *Xianlun*, the Daoist Law flourished.\n\n---\nThe Fifteen: Yuan Shi’s Transmission and the Establishment of Precepts\nThe Precept Sect’s Law, the most ancient transmission.\nThe Vacuous Sovereign, leaving the Green Earth.\nHan Immortals, their conduct upright.\nVenerating the New Hat, one hundred eighty.\nJin’s Ruan Ji, Qi’s Zhang Xi, upholding the Great Precepts, honoring the Treasure Verses.\nTang’s Pan Gong, classifying the Precept Categories.\nEmphasizing the Eight-One, slighting the State Six.\nThe Three True Precepts, the Master’s Dao.\nDiligently compiling, the Law thus complete.\nCalled Xuandu, and studied together.\nInitially adhering to the Ten, then the Three Hundred.\nThe Wisdom Precepts, belonging to Marvelous Virtue.\nThe Female True Precepts, cherishing this conduct.\nExhorting beyond faults, the Precepts balanced.\nTo the Ming Dynasty, succeeding Kunyang.\nExplaining the Heart’s Law, the Precepts ever clearer.\nAbove, the thirteen sects described.\nThe Fasting and Expiation Methods, accompanying the Talismans.\n\n---\nThe Sixteen: The Three Talismans and Seven Fasts—Heavenly and Human Unity\nThe Golden and Jade Talismans, the Yellow Talisman.\nThese three fasts, accruing spiritual blessings.\nPracticing the Golden Talisman, the Imperial Clan rejoiced.\nPersonally praying, the rains came in season.\nEstablishing the Great Fast, Dao Wu Jun.\nPacifying the world, sweeping away the mists.\nThe *Mingzhen*, the *Ziran*, the *Sanyuan*, the *Bajie*,\nThe *Dongshen*, the *Zhijiao*, the *Tutan*—seven grades.\nEntering the Sacred Law, ascending the Void Rites.\n\nThe Path of Encountered Veneration—Blessings of Longevity Abound\nExpiating Sufferings, the Green Mysteries Unveiled\nThe Sacred Banner moves, rites of perfection solemnly observed\nThe Power of Graceful Light, the willow in the jar\nFlesh turns to bone, decay revives\nThe Expiation of Ten Thousand Spirits—who gathers them?\nThe Lord of the Willow, his disciples united\nQuelling calamities, the Law’s Radiant Scriptures\nPiercing the Mysteries, comprehending the roots\nThe Master of the Southern Lands, succeeding all households\nThe lonely and bereaved, their sacrifices and refineries extolled\nCommanding He Qiao, to the Nether Path he proceeds\nRescuing the stagnant souls, emerging from the Abyss\n\n**The Seventeenth: The Boundless Marvels of Knowing the Dao’s Movement and Stillness**\nThe Sect of the Talismans—now the Law is known\nMovement and stillness, must be thoroughly understood\nWater, Fire, Earth, Wood, Metal—\nThese Five Agents, mutually interdependent\nSpirit, Soul, Mind, Intention—\nThese Five Essences, governed as one wills\nLife’s Merit, Time’s Affairs—\nThese Five Thieves, cannot be seized\nInner Five Essences, Outer Five Thieves\nSudden interaction, tenfold karmic births arise\nKarmic seeds take root, six desires manifest\nThe Seventeen Paths, thus established\nEye, nose, ear, tongue, body, mind—\nEncountering good and evil, deep habits form\nLost in delusion, one becomes a mortal\nEnlightened, one becomes a sage\nClarifying right and wrong, cultivating virtuous conduct\nCelestial Immortals, Human Immortals,\nEarthly Immortals, Spiritual Immortals,\nAnd Heavenly Immortals—five ranks\nEmploying the Nine and Six, refining the threads of governance\nFrom Immortal Truth to Supreme Sagehood\nEach undergoes three transmigrations, nine grades respond\nWest and North, South and East—\nGathered in procession, entering the Central Palace\nThe Dragon and Tiger, the Alchemical Soil—\nThese Three Natures, converge in one place\nCirculating the Heavenly Cycle, diligently refining\nFlames ascend—True Persons manifest\nFive Qi gather, body and function complete\nThe Three-One Transformation, wondrous without limit\nThe Dao-Body, the True-Body,\nThe Reward-Body—these are the Three Bodies\nThe Response-Body arises, another body born\nDisplaying marvelous forms, conforming to worldly constraints\nGathering and dispersing at will, without measure\nA cloud of divided bodies, transforming into myriad symbols\nThe Original precedes, the Manifest follows\nAppearing according to circumstances, ever not the same\nThe White Emperor, the Peerless Essence,\nThe Peach of Immortality, the Keeper of Fate,\nThe Grand Unity—these are the Five Spirits\nThe Comet’s fullness, the Spirit’s clarity\nHeaven’s Vision, the Dharma’s Sound\nSpiritual Contact, the Assembly of Spirits\nAncient Divine Intuition, the Omen’s Foreknowledge\nPermeating the Dharmadhātu, without end\n**The Eighteenth: Early Cultivation of the Six Virtues/Degrees**\n\nHeaven and Earth, the Waterways—\nAccumulating worldly sins, one must suffer retribution\nColor’s burdens, Love’s burdens,\nGreed’s burdens, Illusion’s burdens,\nThe Body’s burdens—these are the Five Sufferings\nAnd the Three Paths—truly human trials\nHearing and contemplating, one returns to the Path of Awakening\nProfoundly embodying practice, attaining intuitive realization\nThe Degree of Right Faith, the Degree of Virtuous Stillness,\nThe Degree of Golden Brilliance, the Degree of Universal Virtue,\nThe Degree of Primordial Fate, the Degree of Perfect Truth—\nThus gradually attaining, the Six Degrees\nCompassion and Love, Virtue and Patience—\nThe Four Practices suffice, the Alchemical Scriptures confirmed\nThe Virtue of Eternal Truth, the Virtue of Pure Response—\nThese Four Powers, the Celestial Capital’s proof\nThe Paths of Sage and Mortal, the Gates of Purity and Defilement\nThe Five Mortal Realms—no need for debate\n\n**The Nineteenth: Heaven and Earth’s Yin and Yang Must Be Clarified**\nThe Yellow Ancestor, the Six Celestial Realms\nA hundred merits, ascending and transforming\nThe Transcendent Balance, the Eighteen Celestial Realms\nThe Six Senses purified, coarse dust abandoned\nThe Subsequent Six Realms, light and subtle\nThe Further Six Realms, even lighter and more refined\nThe Celestial Passages—four more Realms\nForgotten are the mind and its perceptions, turning to Qi observation\nGradually attaining the Marvelous, entering the Profound Mysteries\nNo descent into ruin, the Four Dharma Realms\nThe Constant Fusion, the Jade Elevation,\nThe Dharma Passage, the Final Termination—\nThese Four Mortalities, all Three Realms\nTreading the Vehicles, none obstructed\nHaving clarified the Heavens, one must now discuss the Earth\nThe Earth follows the Heavens, its Qi encompassing all\nThe Ten Directions’ Realms, and the Abyssal Depths\nThe Six Non-Existent, encircling the Central Peak\nThe Indistinct and Undivided, the Great Primordial Chaos\nThe Clouds drift—boundless, neither high nor low\nThe Vast and Silent, the limitless expanse\nThe Net of Heaven, the Three Realms’ splendor\nThe Mist of Fine Rain, the Great and Flourishing\nThe Great Compass’ Motion, unobstructed\nThe Four Cardinal Paths, the Eight Round Realms\nFloating in the Void, sustained by the Wind\nThe Wind’s friction, the Qi’s ascent\nThe Diamond’s Strength, riding upon the Heavens\nThe Sun, Moon, and Stars, doubling their revolutions\nLayered layers traversed, like rolling a pill\nYin and Yang—too much or too little\nIf rigidly opposed, calamities ensue\nThe Nine Yangs, the Sixteen Yin\nThe Celestial Locks, the Earthly Axes\nCalculating the Rebirths, three thousand six\nYin’s negation, Yang’s fervor\nHeaven’s exhaustion of Yin, Earth’s exhaustion of Yang\nThe Two Great Wheels, in shared contention\nGazing upon the Above and Below, humans dwell in the Middle\nDistanced from the Four Quarters, entering the Vaulted Heavens\nCounting this Earth, until the Great Cataclysm\nWithout the Dao’s Power, who would not perish?\nThe Nourished Earth, the Golden Grain Earth,\nThe Iron Earth, the Watery Earth,\nThe Great Wind Earth—these are the Five Earths\nThe Void, Form, and Moisture, reaching the utmost subtlety\nThe Fifth Soil, the Sixth Soil,\nThe Floating Soil—these are the Three Soils\n\n**The Twentieth: The Paths of Immortals Across the Ages**\nGuiding the People’s Scriptures, now clarified\nSixty-one stages, sequentially divided\nThe Way of the Supreme Sovereign, the Way of the Highest Truth,\nThe Way of the Mid-True, the Many Ways\nKnowing their few, observing their openings\nUnobstructed Void, entering the Multitude of Marvels\nAll who learn must embody this themselves\nAspirations steadfast, all virtues arise\nFaith enables action, merit unmatched\nRemoving defilements, diligently refining\nStudying diverse arts, distilling their essentials\nAscending the stages, thus deeply cultivating\nPeering into the Lapis Circle, probing the Mysteries’ Depths\nAttaining Void and Stillness, no trace remains\nOnce upon the King of Mu\nDisgusted with mortal affairs\nLightly regarding wealth and honor, he wandered to Kunlun\nLi the Eight-Hundred, the Ancient Lord of Shu\nDeparted in seclusion, his spirit dwelling with the tortoise\nThe Prince of Wang, enamored with Immortality\nFollowing the Floating Isle, he returned on a crane\n\nThe Benevolent Savior, Master Ma,\nHealing the Dragon’s Ills with Licorice Decoction.\nJie Yuanze possessed Daoist arts,\nAngling for Crucian Carp to present to King Wu.\n\nBo Dong, the Master of Breath Cultivation,\nOnce imprisoned, vanished by hidden form.\nYoung Moneyless Master studied the Way,\nDwelling at Jùqū, chanting Immortal Scriptures.\n\nAt seven, the boy Ding Lingwei\nStudied Daoist arts and returned after a thousand years.\nJi Xiān and Xián Yán practiced the Cicada’s Shedding,\nTheir coffin borne aloft from Tianmù Mountain.\n\nThe Feng Xue clan endured harsh asceticism,\nAchieving Corpse-Resurrection, greeted by the Dark Crane.\n\nThe Lady of Great Mysteries, young widowed,\nMastered Immortal Arts and sat in the Kitchen Hall.\n\nZhang Zhennu repented his brothel life,\nInspired by Lü the Immortal, attaining True Cultivation.\n\nAncient High Masters, their names—Guìdí Duō—\nAlas, for those who linger, time slips away.\nThree Characters written, urging the beginner’s path:\nRefined vinegar essence brings supreme delight.\n\nDo not cling to forms, nor fixate on texts—\nAwaken to this truth, and thus attain the Real.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "道教三字经 易心莹 一：大道一炁化三清 至虚灵，至微妙。 强称名，为大道。 道之体，本自然。 兆于一，象帝先。 浑无物，杳冥精。 玄化流，光音生。 辟混朦，渐微明。 太无变，三分气。 始青气，号清微。 龙汉劫，天景晖。 元白气，号禹馀。 显真文，焕太虚。 玄黄气，号大赤。 开上皇，万化孳。 二：三洞经箓冠古今 元始尊，说洞真。 启大教，演三乘。 灵宝尊，说洞玄。 金科立，宝箓传。 道德尊，说洞神。 十二部，度天人。 建法筵，宝珠中。 传经蕴，义无穷。 我皇人，集云书。 正天音，在劫初。 译三洞，次四辅。 七十二，冠古今。 三：诸神弘道传飞升 自玉清，至西那。 玄风及，同顺化。 玉皇尊，大有情。 舍王位，苦修行，历多劫，志不灰。 证金仙，号如来。 位玉京，镇萧台。 斡天帝，总三才。 本行经，断障碍。 告菩萨，无内外。 静妙尊，林辩才。 广说法，九和台。 开始老，学修真。 化国王，度臣民。 宏教法，三千人。 受此决，白日升。 四：古仙宗崇大洞经 溯源流，追上古。 证道者，书唯普。 考真系，别宗祖。 大小宗，从头数。 古仙宗，遗上世。 极昌明，在黄帝。 欲治国，慕广成。 访崆峒，论长生。 来具茨，窥靖庐。 礼诸真，奉芝图。 探九室，青城峰。 获龙蹻，有遗踪。 守一经，仙王授。 讲生理，除病垢。 无摇精，无劳神。 隳肢体，黜聪明。 神气和，结仙胎。 千二百，身不衰。 净乐国，有王子。 出尘埃，了生死。 入太和，自勤苦。 提慧剑，降二竖。 跃南崖，现真武。 大功成，报父母。 吴夫差，仰止切。 求度人，之齐国。 空洞篇，不轻泄。 传斯文，四万劫。 此一家，宗大洞。 研真理，苍胡重。 五：金液聚玄两相宜 金液宗，始娲皇。 明造化，法阴阳。 逮轩辕，费专研。 政教余，且学仙。 合神药，炼金丹。 龙车举，鼎湖间。 得度者，多近臣。 荆山下，旧迹存。 此一家，宗九鼎。 炼汞铅，穷根本。 聚玄宗，左真传。 授黄氏，在周宣。 明内功，法最简。 但澄心，物欲遣。 空无寂，观三要。 惟湛然，期至道。 此一家，宗清静。 持定观，圆珠映。 六：胎息黄芽返童婴 长淮宗，开神。 居上，得其真。 归根法，复命关。 一字诀，静中参。 观云起，调无弦。 穷妙有，括人天。 此一家，宗胎息。 弦际通，复无极。 葆和宗，老容成。 服五芽，食云英。 严固守，元神充。 身不挠，夺天工。 此一家，宗服气。 守玄牝，还妙谛。 七：房室养生调神宗 调神宗，传素女。 保身法，人妙理。 治众病，功奇巧。 补伤损，颜不老。 摄精气，填血脑。 防邪伪，慎检讨。 此一家，宗内房。 明气道，养阳方。 八：南宫苍益健利灵 南宫宗，师一真。 秘密咒，役鬼神。 挥灵剑，妖邪遁。 隐形景，须体证。 此一家，宗符箓。 运精神，合云物。 苍益宗，系彭桐。 僦大隗，并神农。 炼丹砂，法乾纲。 采灵药，九加方。 茹石散，饵琼芝。 易骨髓，返仙姿。 此一家，宗服食。 延寿命，保质原。 键利宗，盛羲农。 赤松后，数宁封。 治虚邪，可延年。 漱灵液，灾不干。 畅关节，通泥丸。 壮体魄，筋骨坚。 伏虫蛇，除患害。 驱恶疾，百里外。 此一家，宗导引。 致精微，入妙境。 九：设坛镇邪从头叙 科醮宗，降高辛。 牧德台，宝符膺。 资二仪，奠岳灵。",
      "translated_text": "**\"Daoist Three-Character Classic\" by Yi Xinying**\n\n**I: The Dao’s Single Qi Transforms the Three Pure Ones**\nThe Great Dao, one in *qi*, gives birth to the Three Pure Ones.\nMost void and numinous, most subtle and profound.\nThough named with force, it is the Great Dao.\nIts essence is naturally so—\nManifest in Oneness, it precedes the Sovereign’s form.\nFormless and boundless, its essence is profound.\nFrom its mysterious transformation, light and sound arise.\nIt cleaves the murky chaos, gradually brightening.\nThe Boundless shifts, dividing into three *qi*s.\nFirst, the Azure *qi*—named *Qingwei*.\nThe Dragon-Han kalpa shines with celestial splendor.\nThe Primordial White *qi*—named *Yuyu*.\nThe True Text appears, illuminating the Great Void.\nThe Dark-Yellow *qi*—named *Dachi*.\nThe Sovereign Above opens, and myriad transformations teem.\n\n**II: The Three Caverns’ Scriptures and Talismans Surpass All Ages**\nThe Venerable Primordial One expounds the Cavern of Truth.\nHe initiates the Great Teaching, expounding the Three Vehicles.\nThe Venerable Soul-Treasure expounds the Cavern of Mystery.\nGolden precepts are established; sacred talismans are transmitted.\nThe Venerable Dao and Virtue expounds the Cavern of the Divine.\nTwelve divisions instruct gods and humans.\nA sacred platform is erected within the Treasure Pearl.\nScriptures are transmitted, their meanings boundless.\nOur august sovereign gathers the Cloud Books,\nCorrecting the Celestial Chant at the kalpa’s dawn.\nHe translates the Three Caverns, then the Four Auxiliaries—\nSeventy-two in total, surpassing all ages.\n\n**III: The Gods Proclaim the Dao and Ascend to Heaven**\nFrom the Jade Pure to the Western Paradise,\nThe Mysterious Wind spreads, harmonizing transformations.\nThe Jade Emperor, most compassionate,\nAbandons his royal seat, enduring hard practice through countless kalpas,\nHis resolve never dimmed.\nHe attains the Golden Immortal, named *Rulai*.\nHe rules the Jade Capital, pacifying the Xiao Platform.\nThe Heavenly Sovereign governs the Three Realms,\nReciting scriptures to sever obstacles.\nHe instructs the Bodhisattvas: no inner or outer distinction.\nThe Quiet and Mysterious Venerable, Lin Biancai,\nPreaches the Law on the Nine-Harmony Terrace.\nHe initiates the Old Master, teaching the Way of Perfection.\nHe transforms kings, saving subjects.\nHis teachings spread to three thousand souls.\nThey receive this decree and ascend in broad daylight.\n\n**IV: The Ancient Daoist Lineage Venerates the Great Cavern Scripture**\nTracing the source, we seek the distant past.\nThose who verified the Dao recorded only the Universal.\nExamining the True Lineage, we distinguish the ancestral sects.\nGreat and small sects are counted from the beginning.\nThe Ancient Daoist Lineage remains from antiquity,\nFlourishing most brightly in the Yellow Emperor’s age.\nTo govern the realm, he emulated Guangcheng.\nHe visited Kongtong, discussing longevity.\nHe came to Jutusi, glimpsing Jinglu.\nHe honored the True Ones, offering the *Zhi Tu* diagram.\nHe explored the Nine Chambers of Qingcheng Peak,\nGaining the Dragon’s hoofprints—evidence remains.\nHe guarded the One Scripture, taught by the Immortal King.\nHe lectured on the principles of life, dispelling illness.\nWithout agitating the essence, without exhausting the spirit,\nHe preserved limbs and senses, discarding cleverness.\nHarmonizing *qi* and spirit, he formed the Immortal embryo.\nAt twelve hundred years, his body showed no decay.\nIn the Pure Joy Realm, a prince emerged,\nFree from dust, liberated from birth and death.\nEntering the Great Harmony, he toiled diligently.\nBrandishing the Wisdom Sword, he subdued the Two Tyrants.\nLeaping from the Southern Cliff, he manifested True Martial.\nHis great deed accomplished, he repaid his parents.\nKing Fu Cha of Wu revered him deeply.\nSeeking to save others, he went to Qi.\nThe *Kongdong Pian* was not lightly revealed.\nThis tradition, passed down for forty thousand kalpas,\nIs one lineage, venerating the Great Cavern.\nResearching the True Principle, Canghu was weighty.\n\n**V: The Golden Elixir and Mysterious Refinement Are Complementary**\nThe Golden Elixir Sect began with Wa Huang.\nHe illuminated transformation, following Yin-Yang.\nBy the time of Xuanyuan, he devoted himself to research.\nAfter governing and teaching, he pursued immortality.\nHe combined divine medicines, refining the Golden Elixir.\nWith the Dragon Chariot ascending, many near officials were saved.\nBeneath Jing Mountain, ancient traces remain.\nThis is one lineage, venerating the Nine Cauldrons.\nRefining mercury and lead, he exhausted the roots.\nThe Mysterious Refinement Sect received the True Transmission.\nHuang Shi was instructed during the Zhou’s宣 era.\nHe clarified inner cultivation, the law being simplest:\nOnly still the heart—dispel desires.\nEmpty and still, observe the Three Essentials.\nOnly serene, aspiring to the Dao’s utmost.\nThis is one lineage, venerating Stillness.\n\nHolding the Fixed Observation, the Round Pearl shines.\n\n**VI: Embryonic Breath and Yellow Sprouts Return to Infantile Vitality**\nThe Changhuai Sect opened the Divine.\nDwelling above, he attained the True.\nThe Return-to-Root Method restores the Commanding Gate.\nA single-character decree is pondered in stillness.\nObserving clouds arise, he tunes the unstrung.\nExhausting the subtle and vast, he encompasses heaven and earth.\nThis is one lineage, venerating Embryonic Breath.\nThe Unstrung’s resonance connects to the Boundless.\nThe Harmony-Preserving Sect, from Master Contong,\nConsumes the Five Sprouts, eating Cloud Flowers.\nStrictly guarding, his Primordial Spirit is full.\nHis body unyielding, he defies Heaven’s work.\nThis is one lineage, venerating *Qi*-Nourishment.\nGuarding the Mysterious Female, he returns to the Marvelous Truth.\n\n**VII: The Inner Chamber Cultivates Life and Harmonizes the Spirit**\nThe Spirit-Harmonizing Sect was transmitted by Su Nu.\nLife-preservation methods reveal human subtleties.\nHealing myriad ailments, his skill was wondrous.\nRestoring injuries, his face never aged.\nHe gathered *jing* and *qi*, filling marrow and brain.\nAvoiding deceit, he was cautious in examination.\nThis is one lineage, venerating the Inner Chamber.\nClarifying the *Qi* Dao, he nurtures the Yang method.\n\n**VIII: The Southern Palace’s Cangyi Strengthens Vitality and Spirit**\nThe Southern Palace Sect follows the One True.\nSecret incantations subdue ghosts and gods.\nBrandishing the Spirit Sword, demons flee.\nHidden forms appear—this must be verified in person.\nThis is one lineage, venerating Talismans and Charms.\nDirecting spirit and matter, merging with clouds.\nThe Cangyi Sect stems from Pengtong,\nWho studied with Dayu and Shen Nong.\nRefining cinnabar, he followed the Heavenly Pattern.\nGathering divine medicines, he used the Nine Additions.\nConsuming stone elixirs, eating immortal herbs,\nHe transformed marrow into essence, returning to the Immortal form.\nThis is one lineage, venerating Alchemical Nourishment.\nExtending life, preserving original essence.\nThe *Jianli* Sect flourished under Xi Nong.\nRed Pine’s descendants numbered Ningfeng.\nHealing vacuity and evil *qi*, one may prolong years.\nGargling the Spirit Elixir, calamities do not approach.\nLubricating joints, unblocking the *dantian*,\nStrengthening the body, firming sinews and bones,\nSubduing worms and snakes, removing afflictions,\nDriving away evil diseases from a hundred *li* away.\nThis is one lineage, venerating *Daoyin* exercises.\nRefining the subtle, entering the marvelous realm.\n\n**IX: Establishing Altars to Subdue Evil—Narrated from the Beginning**\nThe Ritual Sect descended from Gao Xin.\nTending the Virtue Platform, he bore the Sacred Talisman.\nDrawing on the Two Principles, he established the Mountain Spirit’s foundation.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1274,
      "start_sentence": 0,
      "end_sentence": 147,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 24.82587957382202,
      "metadata": {
        "source_file": "dao\\藏外\\道教三字经.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "保国祚，免灾迍。 得解脱，证玄宫。 藏金简，钟山封。 夏禹王，躬勤俭。 疏九河，除时患。 凿峡门，多险阻。 祈神人，阴相辅。 示玉印，并经符。 斩世阨，遣童律。 栖山咒，力伏魔。 禁岳渎，锁淮涡。 竟此身，水土平。 功绩就，入阳明。 吴会间，张隐者。 锄河滨，获元始。 筑灵宫，勤供养。 感天尊，授大洞。 经箓法，传心印。 一句偈，元伯敬。 祛瘟灾，除疫疠。 本愿力，归上帝。 阖闾王，登包墟。 窥林屋，得禹书。 合一卷，赤玉字。 百有七，又十四。 太真科，法维谨。 通典格，有七等。 箓与科，戒和律。 箓百二，科四六。 戒千二，律与齐。 大小章，并醮仪。 此一家，宗灵宝。 赞神明，至幽渺。 上十宗，是正传。 分宗派，别先后。 十：柱史玄妙传三丰 尊柱史，号犹龙。 越唐宋，至三丰。 关令尹，第一传。 着九篇，述渊源。 希夷君，隐太华。 木岩集，史文嘉。 六祖张，号隐仙。 会南北，玄要篇。 希夷下，道学兴。 第三传，尧夫承。 观物篇，经世书。 大圆理，合虚无。 第六传，濂溪继。 太极图，宗老易。 儒学派，孔仲尼。 法圣哲，志所期。 去适周，景王间。 问诸礼，师老聃。 子弓后，是荀卿。 评诸子，甚分明。 人心危，道心微。 十六字，道书辞。 第五传，乃韩非。 解喻老，名法归。 至贾谊，踵前贤。 明道术，修故篇。 十一：治道茅山多传人 治道派，本丈人。 至安期，教乃分。 黄老术，善治民。 传盖公，终汉臣。 安期下，付马鸣。 宗内学，阴真君。 得太清，入赤城。 炼白金，惠时贫。 第三传，魏伯阳。 参同契，丹经王。 神仙传，且直言。 谓假易，论作丹。 唐彭晓，据元枢。 释真义，明镜图。",
      "translated_text": "「Nurturing the nation’s lineage, averting calamities and misfortunes.\nObtaining liberation, attaining the Mysterious Palace.\nHiding the Golden Tablet, sealing the Mountain’s decree.\nThe King of Xia, Yu, personally diligent and frugal.\nDredging the Nine Rivers, dispelling temporal afflictions.\nPiercing the Gorge Gates, facing many perils.\nPraying to the Mountain Spirit, aided by the Hidden Sage.\nRevealing the Jade Seal, alongside the Sacred Talisman.\nSevering worldly constraints, dispatching the Child of Law.\nMountain-dwelling incantations, subduing demons with might.\nForbidding mountain sacrilege, locking the Huai Whirlpools.\nFulfilling this life, harmonizing water and earth.\nMerits accomplished, entering the Bright Yang Palace.\n\nBetween Wu and Hui, Zhang the recluse arose.\nPlowing the riverside, he gained the Primordial Beginning.\nConstructing the Spirit Hall, devoutly offering sustenance.\nMoved by Heaven’s Venerable One, he received the Great Cavern.\nScriptures and Talismans’ methods, transmitted with the Heart Seal.\nA single verse of praise, from Yuan Bo’s respect.\nWarding off pestilence, eradicating epidemics.\nRooted wishful power, returning to the Supreme Deity.\nKing He of Yue, ascending to the baoqiu mound.\nGazing at the Forest Dwelling, he obtained Yu’s writings.\nCombining one scroll, with red jade characters.\nA hundred and seven, plus fourteen more.\nThe True Ritual Sect’s methods, their teachings preserved.\nThe Standard and Ritual formats, seven degrees in total.\nTalismans and Rituals, precepts and laws.\nTalismans a hundred and two, Rituals forty-six.\nPrecepts a thousand and two, laws aligned with Qi.\nGreat and small chapters, all part of the Ritual.\nThis one lineage, venerating the Spirit Treasure Dao.\nPraising the Divine Illumination, reaching the most profound depths.\n\n**X: The Pillared History Sect’s Esoteric Transmission—From Sanfeng**\nThe Pillared History Sect, esteemed as the Celestial Mysterious, descended to Sanfeng.\nRevering the Pillared Historian, surnamed Youlong.\nBeyond the Tang and Song, reaching Sanfeng.\nGuān Lìng’s Marshal, the first transmission.\nComposing nine chapters, expounding on its origins.\nXi Yi the Lord, hidden in Taihua.\nThe Woodian Gathering, a historian’s praise.\nThe Sixth Patriarch Zhang, named Hidden Sage.\nUniting the south and north, the Essentials of Mysterious Dao.\nBelow Xi Yi, the Daoist learning flourished.\nThe third transmission, Yao Fu received it.\nThe \"Observing Things\" chapter, a scripture for the world.\nThe Great Rounded Principle, harmonizing with the Void.\nThe sixth transmission, Lin Xi succeeded.\nThe Taiji Diagram, following the Old Master’s *Yijing*.\nThe Confucian school, with Master Zhongni.\nThe Sage of Law, his aspiration fulfilled.\nDeparting Zhou, during the reign of King Jing.\nInquiring about rites, he consulted Master Laozi.\nAfter Zi Gong, it was Xun Qing.\nEvaluating the scholars, their distinctions made clear.\nHuman hearts are perilous, the Daoist heart is subtle.\nSixteen characters, the Daoist scripture’s words.\nThe fifth transmission, thus Han Fei.\nInterpreting Master Lao’s teachings, his name in the Law.\nTo Jia Yi, following the ancient sages.\nIlluminating the Dao’s methods, refining the \"Old Chapter.\"\nThe Eleventh: The Teachings of Daoism from Mount Mao—Many Transmitters\nThe Daoist Healing Sect, originating from the Elder.\nTo An Qi, teachings were divided.\nThe Yellow-Lao arts, skilled in governing the people.\nPassed to Gai Gong, ending as a Han official.\nBelow An Qi, entrusted to Ma Ming.\nFollowing Inner Learning, the True Sage of Yin.\nGaining the Great Clarity, entering Red City.\nRefining White Gold, blessing the poor in times.\nThe third transmission, Wei Boyang.\nStudying the *Tongqi* Contract, the King of the Alchemical Scriptures.\nThe Sage’s Transmission, straightforwardly stated.\nClaiming the *Yijing* as metaphor, discussing the Elixir.\nTang Pengxiao, based on the Primordial Axis.\nClarifying the True Meaning, illuminating the Mirror Diagram.",
      "overlap_context": "ngthening the body, firming sinews and bones,\nSubduing worms and snakes, removing afflictions,\nDriving away evil diseases from a hundred *li* away.\nThis is one lineage, venerating *Daoyin* exercises.\nRefining the subtle, entering the marvelous realm.\n\n**IX: Establishing Altars to Subdue Evil—Narrated from the Beginning**\nThe Ritual Sect descended from Gao Xin.\nTending the Virtue Platform, he bore the Sacred Talisman.\nDrawing on the Two Principles, he established the Mountain Spirit’s foundation.",
      "start_char": 1274,
      "end_char": 1909,
      "start_sentence": 148,
      "end_sentence": 224,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 11.103615045547485,
      "metadata": {
        "source_file": "dao\\藏外\\道教三字经.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "茅山派，师鬼谷。 授初成，隐华岳。 叔申君，西城传。 得二景，归金坛。 第五传，清虚真。 八隐书，高仙经。 六传周，号紫阳。 灵晖箓，金玄章。 清虚下，魏夫人。 退静室，谙黄庭。 第九世，杨羲君。 授正法，曲素文。 紫阳下，推许映。 服玉液，朝脑精。 第二世，许侍朗。 愈腹疾，服术方。 简寂公，为第六。 修道藏，纂经箓。 八世陶，号贞白。 诠真诰，正隐诀。 十一世，称司马。 坐忘理，极正大。 论吾人，在贵生。 生道足，返天真。 十二：方仙要数葛仙翁 方仙派，西王母。 降闷宫，授汉武。 上清经，十二事。 稽内传，详为志。 十三传，皆方技。 五利徒，鲜真谛。 汉淮南，重丹器。 鸿宝书，惜久佚。 葛仙翁，左氏传。 流珠歌，记生前。 修真一，入大定。 经醮法，遗鲍郑。 晋抱朴，得郑书。 述丹道，千有余。 论仙方，识元意。 十二篇，称绝艺。 十三：太平正一豫章派 太平宗，师于吉。 青领书，百七十。 修此法，嗣息增。 论兴国，较铢分。 重经意，惟襄楷。 累上疏，君不解。 正一派，汉天师。 盟威箓，拜章仪。 斩故气，消三业。 得大丹，辨正邪。 奉斗经，度玉局。 六十三，沿世袭。 玄学派，宗何王。 崇虚论，述老庄。 至七贤，学无学。 窥堂奥，推向郭。 豫章派，祖兰期。 孝悌王，是本师。 亲点化，掘三墓。 见尸体，身忽合。 遥轻举，显神通。 铜符券，蕴神功。 传谌母，守真鹰。 嘱度者，旌阳令。 三祖许，号仙都。 石函记，法鼎炉。 十四：全真修道南北宗 南宗兴，祖伯端。 天回镇，师海蟾。 临行时，亲嘱咐。 脱汝法，当授度。 逢马氏，司真行。 至荆湖，饵丹升。 三祖薛，本僧衲。 参杏林，师环下。 通宗说，复命篇。 得外护，道乃全。 四祖陈，号泥丸。 习贱业，隐市廛。 大雷书，黎母授。 诛邪魔，除灾咎。 壶中药，随布济。 翠虚篇，遗散吏。 五祖白，居武夷。 海琼集，显秘密。 北宗师，号重阳。 宗钟吕，祖少阳。 五篇文，获甘镇。 活死人，入墓寝。 焚草庵，见真假。 赴东溟，度烈马。 未生前，亲抉剖。 九转丹，几人悟。 十五论，教化集。 揆诸经，括玄义。 邱刘谭，郝王孙。 元中主，尊龙门。 丹阳下，祖披云。 乌兔经，萃玄文。 四祖赵，居南岳。 同源论，悔后学。 致虚翁，是嫡传。 抒大要，阐先天。 长春下，祖志平。 承遗教，在燕京。 葆光集，及语录。 建道场，宏规模。 四祖李，名浩然。 西游记，称遗篇。 五祖王，着信心。 赠光教，主白云。 又八传，至冲虚。 撰正理，明玄机。 继此者，僧华阳。 着仙论，道法昌。 十五：元始演法留戒律 律宗法，传最古。 虚皇尊，留青土。 汉仙人，素行直。 奉新笠，百八十。 晋阮基，齐张岜，持大戒，礼宝偈。 唐潘公，品戒目。 重八一，轻州六。 三真戒，师道一。 勤修纂，法始卒。 曰玄都，并研习。 初遵十，中三百。 智慧戒，属妙德。 女真戒，爱此行。 勉过咎，律均衡。 至明季，嗣昆阳。 说心法，律益彰。 已上说，十三宗。 斋忏法，箓相从。 十六：三箓七斋天人通 曰金玉，曰黄箓。 此三斋，资冥福。 修金箓，喜宗皇。 躬祈祷，时雨将。 建鸿斋，道武君。 克寰宇，扫烟氛。 曰明真，曰自然。 曰三元，曰八节。 曰洞神，曰指教。 曰涂炭，为七品。 入圣法，升虚仪。",
      "translated_text": "The Teaching of the Mao Mountain Sect—Ghost Valley as Master\nInstructed in the Foundations, concealed at Hua Mountain.\nShu Shen Jun, transmitted in the Western City.\nObtained the Two Scenes, returning to Jin Tan.\nThe Fifth Transmission, Qingxu True Sage.\nThe Eight Hidden Scriptures, the High Immortal Classic.\nSixth Transmission to Zhou, surnamed Zisun.\nThe Linghui Talisman, the Golden Mysteries Chapter.\nBelow Qingxu, Wei Fu Ren.\nRetreating to the Quiet Chamber, mastering the Yellow Court.\nThe Ninth Generation, Yang Xi Jun.\nInstructed in the True Law, composing the *Qu Su* Text.\nBelow Zisun, promoting Xu Ying.\nConsuming Jade Elixir, receiving Brain Essence.\nThe Second Generation, Xu Shilang.\nHealing abdominal ailments, practicing the Alchemical Prescriptions.\nJian Ji Gong, the Sixth in Line.\nCultivating the Daoist Canon, compiling the Scriptures and Talismans.\nThe Eighth Generation, Tao Zhengbai.\nInterpreting the True Edicts, rectifying the Hidden Precepts.\nThe Eleventh Generation, surnamed Sima.\nSitting in Forgetfulness, attaining the Supreme Greatness.\nDiscussing humanity’s worth, valuing life.\nLife in the Dao suffices, returning to True Nature.\n\n---\nThe Twelve: Essential Alchemical Numerology of the Bo Immortal\nThe Alchemical Sect, descending from the Western Queen Mother.\nDescending to the Muted Palace, instructing Emperor Wu of Han.\nThe Shangqing Scripture, twelve matters expounded.\nExamining the Inner Transmission, meticulously recorded.\nThirteen transmissions, all in alchemical arts.\nThe Five Profits’ disciples, few grasp the True Meaning.\nHan’s Huainan King valued the Elixir Arts.\nThe *Hongbao* Classic, alas, long lost.\nThe Bo Immortal, transmitted by the Left Family.\nThe *Liuzhu* Song, recording his life.\nRefining the True One, entering Great Stillness.\nThe Ritual and Offering Methods, bequeathed to Bao Zheng.\nJin’s Baopuzi obtained Zheng’s writings.\nExpounding the Elixir Dao, over a thousand words.\nDiscussing Immortal Prescriptions, discerning the Primordial Intent.\nTwelve Chapters, hailed as unparalleled skill.\n\n---\nThe Thirteen: The Taiping Zhengyi Yu Zhang Sect\nThe Taiping Sect, taught by Yu Ji.\nThe *Qingling* Book, one hundred seventy scrolls.\nPracticing this Law, successors multiplied.\nDiscussing the Revival of the Nation, weighing minutely.\nValuing the Scripture’s intent, only Xiang Kai.\nRepeatedly petitioning, the ruler remained unmoved.\nThe Zhengyi Sect, the Han Heavenly Master.\nThe *Mengwei* Talisman, the Ritual Chapters.\nSevering the Old Qi, dissolving the Three Activities.\nObtaining the Great Elixir, distinguishing true from false.\nVenerating the *Doujing*, crossing the Jade Circuit.\nSixty-three generations, passed down through the ages.\nThe Mysterious Learning Sect, following He Wang.\nThe *Chongxu* Treatise, expounding Laozi and Zhuangzi.\nTo the Seven Worthies, learning without learning.\nGazing into the Hall’s depths, promoting Xiang Guo.\nThe Yu Zhang Sect, ancestral to Lan Qi.\nThe Filial and Fraternal King, the True Master.\nPersonally enlightening, digging three tombs.\nSeeing corpses, his body suddenly whole.\nLevitating afar, displaying supernatural power.\nThe Copper Talisman and Vouchers, containing divine efficacy.\nTransmitted to Chen Mu, guarding the True Eagle.\nCharging the Initiates, the Edict of Jingyang.\nThe Third Ancestor Xu, surnamed Xiantu.\nThe *Shifen* Record, the Cauldron of Law.\n\n---\nThe Fourteen: Complete Perfection Cultivation—Southern and Northern Schools\nThe Southern School arose, ancestral to Bo Duān.\nAt Tianhui Zhen, mastered by Hai Tan.\nAt parting, he personally entrusted:\n“Abandon your methods; I shall grant initiation.”\nEncountering the Ma Clan, the True Conduct Officer.\nArriving in Jinghu, consuming the Elixir and ascending.\nThe Third Ancestor Xue, originally a monk.\nStudying the *Xinglin*, under Huan Xia.\nCommunicating the Sect’s Essence, composing the *Fuming* Chapter.\nObtaining External Protection, the Dao thus complete.\nThe Fourth Ancestor Chen, surnamed Nihuan.\nPracticing base arts, hiding in the marketplace.\nThe *Dalei* Scripture, bestowed by Mother Li.\nExterminating demonic forces, averting calamities.\nThe Elixir in the Jar, distributed for relief.\nThe *Cui Xu* Chapter, left to the scattered officials.\nThe Fifth Ancestor Bai, residing at Wuyi.\nThe *Haiqiong* Collection, revealing the Mysteries.\n\nThe Northern School’s Master, surnamed Chongyang.\nFollowing the Bell and Lu, ancestral to Shaoyang.\nFive Chapters of Text, attaining Sweet Tranquility.\nReviving the Dead, entering the Tomb Chamber.\nBurning the Grass Hut, discerning true from false.\nJourneying to the Eastern Sea, crossing the Fierce Steed.\nBefore birth, personally dissecting.\nThe Nine-Turn Elixir, few comprehend.\nFifteen Discourses, the Teaching Compilation.\nMeasuring the Scriptures, encompassing Mysterious Meaning.\nThe Qiu-Liu Debate, the Hao-Wang-Sun.\nThe Yuan Zhong Emperor honored the Longmen Sect.\nBelow Danyang, ancestral to Piyun.\nThe *Wutu* Scripture, gathering Mysterious Texts.\nThe Fourth Ancestor Zhao, residing at Nan Yue.\nThe *Tongyuan* Treatise, regretting later scholars.\nZhi Xu Wong, the direct transmission.\nExpounding the Great Essentials, elucidating the Primordial.\nBelow Changchun, ancestral to Zhiping.\nInheriting the Teachings, in Yan Jing.\nThe *Baoguang* Collection, and the Sayings.\nEstablishing the Daoist Hall, expanding the framework.\nThe Fourth Ancestor Li, named Haoran.\nThe *Xiyou* Record, a posthumous work.\nThe Fifth Ancestor Wang, composing *Xinxin*.\nGifting the Bright Teaching, presiding over Baiyun.\nAnother eight transmissions, reaching Chongxu.\nComposing *Zhengli*, clarifying Mysterious Mechanisms.\nFollowing this, Monk Huayang.\nWriting the *Xianlun*, the Daoist Law flourished.\n\n---\nThe Fifteen: Yuan Shi’s Transmission and the Establishment of Precepts\nThe Precept Sect’s Law, the most ancient transmission.\nThe Vacuous Sovereign, leaving the Green Earth.\nHan Immortals, their conduct upright.\nVenerating the New Hat, one hundred eighty.\nJin’s Ruan Ji, Qi’s Zhang Xi, upholding the Great Precepts, honoring the Treasure Verses.\nTang’s Pan Gong, classifying the Precept Categories.\nEmphasizing the Eight-One, slighting the State Six.\nThe Three True Precepts, the Master’s Dao.\nDiligently compiling, the Law thus complete.\nCalled Xuandu, and studied together.\nInitially adhering to the Ten, then the Three Hundred.\nThe Wisdom Precepts, belonging to Marvelous Virtue.\nThe Female True Precepts, cherishing this conduct.\nExhorting beyond faults, the Precepts balanced.\nTo the Ming Dynasty, succeeding Kunyang.\nExplaining the Heart’s Law, the Precepts ever clearer.\nAbove, the thirteen sects described.\nThe Fasting and Expiation Methods, accompanying the Talismans.\n\n---\nThe Sixteen: The Three Talismans and Seven Fasts—Heavenly and Human Unity\nThe Golden and Jade Talismans, the Yellow Talisman.\nThese three fasts, accruing spiritual blessings.\nPracticing the Golden Talisman, the Imperial Clan rejoiced.\nPersonally praying, the rains came in season.\nEstablishing the Great Fast, Dao Wu Jun.\nPacifying the world, sweeping away the mists.\nThe *Mingzhen*, the *Ziran*, the *Sanyuan*, the *Bajie*,\nThe *Dongshen*, the *Zhijiao*, the *Tutan*—seven grades.\nEntering the Sacred Law, ascending the Void Rites.",
      "overlap_context": "Below An Qi, entrusted to Ma Ming.\nFollowing Inner Learning, the True Sage of Yin.\nGaining the Great Clarity, entering Red City.\nRefining White Gold, blessing the poor in times.\nThe third transmission, Wei Boyang.\nStudying the *Tongqi* Contract, the King of the Alchemical Scriptures.\nThe Sage’s Transmission, straightforwardly stated.\nClaiming the *Yijing* as metaphor, discussing the Elixir.\nTang Pengxiao, based on the Primordial Axis.\nClarifying the True Meaning, illuminating the Mirror Diagram.",
      "start_char": 1909,
      "end_char": 3151,
      "start_sentence": 225,
      "end_sentence": 372,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 19.63048481941223,
      "metadata": {
        "source_file": "dao\\藏外\\道教三字经.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "遇修崇，福寿益。 救苦忏，启青玄。 宝幡动，礼妙严。 恩光力，瓶中柳。 肉白骨，起枯朽。 万灵忏，何人集。 柳真君，弟子俱。 灭灾祸，法琼篇。 通玄妙，了根源。 所南公，继诸家。 哀茕独，祭炼夸。 敕何乔，诣冥途。 拯滞魄，出幽都。 十七：知法动静妙无穷 宗箓明，当知法。 动与静，须了达。 曰水火，土木金。 此五行，互为因。 曰精神，魂魄意。 此五神，随所御。 曰命功，时物事。 此五贼，不可执。 内五神，外五贼。 忽相感，生十业。 业识起，有六欲。 十七乘，从此立。 眼鼻耳，舌身心。 缘善恶，结习深。 迷为凡，悟为圣。 明顺逆，修善行。 曰灵仙，曰人仙。 曰地仙，曰神仙。 并天仙，为五等。 用九六，絜纲领。 自仙真，至上圣。 各三迁，九品应。 西与北，南与东。 行攒簇，入中宫。 曰龙虎，曰丹土。 此三性，归一处。 运周天，勤烹炼。 火焰飞，真人现。 五气聚，体用全。 三一化，妙无边。 曰道身，曰真身。 曰报身，乃三身。 应身起，又生身。 示妙相，顺世困。 任聚散，无限量。 云分身，化万象。 前为本，后为迹。 随机显，常不一。 有白元，有无英。 有桃康，有司命。 有太一，为五灵。 彗圆备，神自明。 天视通，梵音通。 神触通，神会通。 夙神通，预兆通。 周法界，无不穷。 十八：至德六度早修行 曰天地，曰水途。 积世孽，当受辜。 曰色累，曰爱累。 曰贪累，曰华竟。 曰身累，此五苦。 并三途，为人难。 闻思修，归觉路。 善体行，得会悟。 正信度，定善度。 金华度，普德度。 元命度，全真度。 斯渐证，称六度。 慈与爱，善与忍。 四行足，丹书允。 曰真常，曰净应。 此四德，清都证。 圣凡路，净秽门。 凡五道，不须论。 十九：天地阴阳须自明 曰黄曾，有六天。 百善功，得升迁。 曰越衡，十八天。 六根净，粗尘捐。 次六天，细且轻。 再致六，轻染更。 曰霄度，乃四天。 忘心识，转气观。 渐为妙，入重玄。 无沦坏，四梵天。 曰常融，曰玉隆。 曰梵度，贾夷终。 此四民，并三界。 蹑诸乘，无滞碍。 既明天，须论地。 地依天，气包举。 十方界，及洞渊。 六无聚，拥京山。 混无分，沌朴大。 云莪莪，无高下。 溟寂然，梓无涯。 罗天布，三境奢。 蒙细雨，鸿益华。 洪钧运，无障遮。 径四维，八圆界。 浮虚空，风所待。 风虚摩，气抡然。 金刚力，乘乎天。 日月星，倍循环。 重重涉，似转丸。 阴与阳，过不及。 若扞格，生灾翳。 曰九阳，曰百六。 运天关，转地轴。 计轮回，三千六。 阴否蚀，阳激勃。 天穷阴，地穷阳。 两大轮，共颉颃。 观上下，人在中。 距四方，入穹窿。 数此地，至浩劫。 非道力，谁不灭。 润泽地，金粟地。 刚铁地，水泽地。 大风泽，称五地。 空色润，至微细。 曰戊土，曰已土。 曰浮黎，为三土。 二十：历代神仙把路引 度人经，且说明。 六十一，次第分。 太上道，上真道。 中真道，种种道。 知其几，观其窍。 空无碍，入众妙。 凡学人，当自体。 志向坚，万善举。 信能行，功无比。 除秽垢，勤磨洗。 参众术，撮枢要。 循阶梯，爰深造。 窥琅环，探玄奥。 致虚寂，无朕兆。 昔穆王，厌国情。 轻富贵，徂昆仑。 李八百，古蜀君。 去归隐，禅鳖灵。 王子晋，好神仙。 随浮邱，驾鹤还。",
      "translated_text": "The Path of Encountered Veneration—Blessings of Longevity Abound\nExpiating Sufferings, the Green Mysteries Unveiled\nThe Sacred Banner moves, rites of perfection solemnly observed\nThe Power of Graceful Light, the willow in the jar\nFlesh turns to bone, decay revives\nThe Expiation of Ten Thousand Spirits—who gathers them?\nThe Lord of the Willow, his disciples united\nQuelling calamities, the Law’s Radiant Scriptures\nPiercing the Mysteries, comprehending the roots\nThe Master of the Southern Lands, succeeding all households\nThe lonely and bereaved, their sacrifices and refineries extolled\nCommanding He Qiao, to the Nether Path he proceeds\nRescuing the stagnant souls, emerging from the Abyss\n\n**The Seventeenth: The Boundless Marvels of Knowing the Dao’s Movement and Stillness**\nThe Sect of the Talismans—now the Law is known\nMovement and stillness, must be thoroughly understood\nWater, Fire, Earth, Wood, Metal—\nThese Five Agents, mutually interdependent\nSpirit, Soul, Mind, Intention—\nThese Five Essences, governed as one wills\nLife’s Merit, Time’s Affairs—\nThese Five Thieves, cannot be seized\nInner Five Essences, Outer Five Thieves\nSudden interaction, tenfold karmic births arise\nKarmic seeds take root, six desires manifest\nThe Seventeen Paths, thus established\nEye, nose, ear, tongue, body, mind—\nEncountering good and evil, deep habits form\nLost in delusion, one becomes a mortal\nEnlightened, one becomes a sage\nClarifying right and wrong, cultivating virtuous conduct\nCelestial Immortals, Human Immortals,\nEarthly Immortals, Spiritual Immortals,\nAnd Heavenly Immortals—five ranks\nEmploying the Nine and Six, refining the threads of governance\nFrom Immortal Truth to Supreme Sagehood\nEach undergoes three transmigrations, nine grades respond\nWest and North, South and East—\nGathered in procession, entering the Central Palace\nThe Dragon and Tiger, the Alchemical Soil—\nThese Three Natures, converge in one place\nCirculating the Heavenly Cycle, diligently refining\nFlames ascend—True Persons manifest\nFive Qi gather, body and function complete\nThe Three-One Transformation, wondrous without limit\nThe Dao-Body, the True-Body,\nThe Reward-Body—these are the Three Bodies\nThe Response-Body arises, another body born\nDisplaying marvelous forms, conforming to worldly constraints\nGathering and dispersing at will, without measure\nA cloud of divided bodies, transforming into myriad symbols\nThe Original precedes, the Manifest follows\nAppearing according to circumstances, ever not the same\nThe White Emperor, the Peerless Essence,\nThe Peach of Immortality, the Keeper of Fate,\nThe Grand Unity—these are the Five Spirits\nThe Comet’s fullness, the Spirit’s clarity\nHeaven’s Vision, the Dharma’s Sound\nSpiritual Contact, the Assembly of Spirits\nAncient Divine Intuition, the Omen’s Foreknowledge\nPermeating the Dharmadhātu, without end\n**The Eighteenth: Early Cultivation of the Six Virtues/Degrees**\n\nHeaven and Earth, the Waterways—\nAccumulating worldly sins, one must suffer retribution\nColor’s burdens, Love’s burdens,\nGreed’s burdens, Illusion’s burdens,\nThe Body’s burdens—these are the Five Sufferings\nAnd the Three Paths—truly human trials\nHearing and contemplating, one returns to the Path of Awakening\nProfoundly embodying practice, attaining intuitive realization\nThe Degree of Right Faith, the Degree of Virtuous Stillness,\nThe Degree of Golden Brilliance, the Degree of Universal Virtue,\nThe Degree of Primordial Fate, the Degree of Perfect Truth—\nThus gradually attaining, the Six Degrees\nCompassion and Love, Virtue and Patience—\nThe Four Practices suffice, the Alchemical Scriptures confirmed\nThe Virtue of Eternal Truth, the Virtue of Pure Response—\nThese Four Powers, the Celestial Capital’s proof\nThe Paths of Sage and Mortal, the Gates of Purity and Defilement\nThe Five Mortal Realms—no need for debate\n\n**The Nineteenth: Heaven and Earth’s Yin and Yang Must Be Clarified**\nThe Yellow Ancestor, the Six Celestial Realms\nA hundred merits, ascending and transforming\nThe Transcendent Balance, the Eighteen Celestial Realms\nThe Six Senses purified, coarse dust abandoned\nThe Subsequent Six Realms, light and subtle\nThe Further Six Realms, even lighter and more refined\nThe Celestial Passages—four more Realms\nForgotten are the mind and its perceptions, turning to Qi observation\nGradually attaining the Marvelous, entering the Profound Mysteries\nNo descent into ruin, the Four Dharma Realms\nThe Constant Fusion, the Jade Elevation,\nThe Dharma Passage, the Final Termination—\nThese Four Mortalities, all Three Realms\nTreading the Vehicles, none obstructed\nHaving clarified the Heavens, one must now discuss the Earth\nThe Earth follows the Heavens, its Qi encompassing all\nThe Ten Directions’ Realms, and the Abyssal Depths\nThe Six Non-Existent, encircling the Central Peak\nThe Indistinct and Undivided, the Great Primordial Chaos\nThe Clouds drift—boundless, neither high nor low\nThe Vast and Silent, the limitless expanse\nThe Net of Heaven, the Three Realms’ splendor\nThe Mist of Fine Rain, the Great and Flourishing\nThe Great Compass’ Motion, unobstructed\nThe Four Cardinal Paths, the Eight Round Realms\nFloating in the Void, sustained by the Wind\nThe Wind’s friction, the Qi’s ascent\nThe Diamond’s Strength, riding upon the Heavens\nThe Sun, Moon, and Stars, doubling their revolutions\nLayered layers traversed, like rolling a pill\nYin and Yang—too much or too little\nIf rigidly opposed, calamities ensue\nThe Nine Yangs, the Sixteen Yin\nThe Celestial Locks, the Earthly Axes\nCalculating the Rebirths, three thousand six\nYin’s negation, Yang’s fervor\nHeaven’s exhaustion of Yin, Earth’s exhaustion of Yang\nThe Two Great Wheels, in shared contention\nGazing upon the Above and Below, humans dwell in the Middle\nDistanced from the Four Quarters, entering the Vaulted Heavens\nCounting this Earth, until the Great Cataclysm\nWithout the Dao’s Power, who would not perish?\nThe Nourished Earth, the Golden Grain Earth,\nThe Iron Earth, the Watery Earth,\nThe Great Wind Earth—these are the Five Earths\nThe Void, Form, and Moisture, reaching the utmost subtlety\nThe Fifth Soil, the Sixth Soil,\nThe Floating Soil—these are the Three Soils\n\n**The Twentieth: The Paths of Immortals Across the Ages**\nGuiding the People’s Scriptures, now clarified\nSixty-one stages, sequentially divided\nThe Way of the Supreme Sovereign, the Way of the Highest Truth,\nThe Way of the Mid-True, the Many Ways\nKnowing their few, observing their openings\nUnobstructed Void, entering the Multitude of Marvels\nAll who learn must embody this themselves\nAspirations steadfast, all virtues arise\nFaith enables action, merit unmatched\nRemoving defilements, diligently refining\nStudying diverse arts, distilling their essentials\nAscending the stages, thus deeply cultivating\nPeering into the Lapis Circle, probing the Mysteries’ Depths\nAttaining Void and Stillness, no trace remains\nOnce upon the King of Mu\nDisgusted with mortal affairs\nLightly regarding wealth and honor, he wandered to Kunlun\nLi the Eight-Hundred, the Ancient Lord of Shu\nDeparted in seclusion, his spirit dwelling with the tortoise\nThe Prince of Wang, enamored with Immortality\nFollowing the Floating Isle, he returned on a crane",
      "overlap_context": " and Seven Fasts—Heavenly and Human Unity\nThe Golden and Jade Talismans, the Yellow Talisman.\nThese three fasts, accruing spiritual blessings.\nPracticing the Golden Talisman, the Imperial Clan rejoiced.\nPersonally praying, the rains came in season.\nEstablishing the Great Fast, Dao Wu Jun.\nPacifying the world, sweeping away the mists.\nThe *Mingzhen*, the *Ziran*, the *Sanyuan*, the *Bajie*,\nThe *Dongshen*, the *Zhijiao*, the *Tutan*—seven grades.\nEntering the Sacred Law, ascending the Void Rites.",
      "start_char": 3151,
      "end_char": 4383,
      "start_sentence": 373,
      "end_sentence": 521,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 156.85016560554504,
      "metadata": {
        "source_file": "dao\\藏外\\道教三字经.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "善济物，马师皇。 愈龙疾，甘草汤。 介元则，有道术。 钓鲻鱼，献吴王。 董仲君，善服气。 曾被狱，隐形去。 幼学道，钱妙真。 居句曲，诵仙经。 七岁童，丁令威。 学仙道，千年归。 暨彗琰，修蝉蜕。 天目山，棺版飞。 冯薛氏，修苦行。 得尸解，玄鹤迎。 太玄女，少丧夫。 治仙术，坐行厨。 张珍奴，悔青楼。 感吕仙，得真修。 古高真，诰谛多。 嗟同人，易蹉跎。 作三字，勉初学。 细醋精，得至乐。 莫泥象，莫执文。 悟此理，乃为真。",
      "translated_text": "The Benevolent Savior, Master Ma,\nHealing the Dragon’s Ills with Licorice Decoction.\nJie Yuanze possessed Daoist arts,\nAngling for Crucian Carp to present to King Wu.\n\nBo Dong, the Master of Breath Cultivation,\nOnce imprisoned, vanished by hidden form.\nYoung Moneyless Master studied the Way,\nDwelling at Jùqū, chanting Immortal Scriptures.\n\nAt seven, the boy Ding Lingwei\nStudied Daoist arts and returned after a thousand years.\nJi Xiān and Xián Yán practiced the Cicada’s Shedding,\nTheir coffin borne aloft from Tianmù Mountain.\n\nThe Feng Xue clan endured harsh asceticism,\nAchieving Corpse-Resurrection, greeted by the Dark Crane.\n\nThe Lady of Great Mysteries, young widowed,\nMastered Immortal Arts and sat in the Kitchen Hall.\n\nZhang Zhennu repented his brothel life,\nInspired by Lü the Immortal, attaining True Cultivation.\n\nAncient High Masters, their names—Guìdí Duō—\nAlas, for those who linger, time slips away.\nThree Characters written, urging the beginner’s path:\nRefined vinegar essence brings supreme delight.\n\nDo not cling to forms, nor fixate on texts—\nAwaken to this truth, and thus attain the Real.",
      "overlap_context": " distilling their essentials\nAscending the stages, thus deeply cultivating\nPeering into the Lapis Circle, probing the Mysteries’ Depths\nAttaining Void and Stillness, no trace remains\nOnce upon the King of Mu\nDisgusted with mortal affairs\nLightly regarding wealth and honor, he wandered to Kunlun\nLi the Eight-Hundred, the Ancient Lord of Shu\nDeparted in seclusion, his spirit dwelling with the tortoise\nThe Prince of Wang, enamored with Immortality\nFollowing the Floating Isle, he returned on a crane",
      "start_char": 4383,
      "end_char": 4575,
      "start_sentence": 522,
      "end_sentence": 545,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 3.3626513481140137,
      "metadata": {
        "source_file": "dao\\藏外\\道教三字经.txt",
        "category": "藏外"
      }
    }
  ]
}