{
  "source_id": "道迹灵仙记",
  "source_file": "chunked_daozang\\道迹灵仙记.json",
  "total_chunks": 7,
  "total_original_chars": 6184,
  "total_translated_chars": 37553,
  "total_translation_time": 114.7037582397461,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\记传类\\道迹灵仙记.txt",
    "category": "记传类"
  },
  "full_translation": "**Dao/Way Traces of the Spiritually Transcendent Record**\n*Sutra Name*: **Dao/Way Traces of the Spiritually Transcendent Record**\n\nThe original text does not name its author, but it is suspected to be a remnant of the *Southern Dynasties* text *Dao/Way Traces Scripture* by Gu Xuan (顾欢). Many of the ghostly deities listed in this work appear in Tao Hongjing’s *True Admonitions* (《真诰》). One volume. Source of the base text: *Zhengtong Daozang* (正统道藏), under the *Dongxuan* (洞玄) section of the *Recorded Biographies* (记传类).\n\n---\n\n**Dao/Way Traces of the Spiritually Transcendent Record**\n**First Chapter: The Six Palaces of the Six Realms of Ghostly Deities**\n\nThe Luo Ding (罗酆) Mountains lie in the northern *癸地* (Guidi, the 8th of the 28 lunar constellations’ earthly domains). Towering two thousand six hundred *里* (li, ~840 miles), their circumference spans three thousand *里* (li, ~1,260 miles). Beneath the mountain lies a *Dongtian* (洞天, \"Cavern of Heaven\"), encircling one thousand five hundred *里* (li, ~630 miles). Both above and below this cavern are palaces occupied by ghosts and spirits.\n\nUpon the mountain are six palaces, and within the cavern, there are another six. Each palace measures a thousand *里* (li, ~420 miles) in circumference—these are the six *Tian* (天, \"Heavens\") of the ghostly deities, with the mountain-top palaces as the outer realms and the cavern palaces as the inner. Their structures are identical.\n\nThe first palace is called the **Palace of the Perishing Tyrant’s Dark Dao/Way** (纣绝阴天宫), the second the **Palace of the Great Slaying and Righteous Decrees** (太杀谅事宗天宫), the third the **Palace of the Illuminating Dawn and the Unyielding Offender’s Martial City** (明晨耐犯武城天宫), the fourth the **Palace of the Serene Light and Punitive Qi** (恬照罪气天宫), the fifth the **Palace of the Sovereign Spirit and the Seven Non-Realms** (宗灵七非天宫), and the sixth the **Palace of the Audacious Official and the Endless Winding Realm** (敢司连宛屡天宫). These six palaces constitute the governance of the ghostly deities across the Six Realms.\n\nThe six cavern palaces mirror their names and forms exactly, hence they are called the **Inner and Outer Six Heavenly Palaces** (六天内外宫殿).\n\nIf mortals know the names of the six gates of the Luo Ding palaces, the hundred ghosts dare not cause harm.\n\nBefore sleeping, one should face north and recite the incantation three times, softly. The divine incantation reads:\n\n*\"I am a disciple of the Most High. Below, I command the Six Realms. These Six Heavenly Palaces are under my jurisdiction. It is not only my jurisdiction but also the domain of the Most High. I know the names of the Six Heavenly Gates—thus I attain longevity. If any dare to offend, the Most High will behead you.*\n\n*The first palace is named the Palace of the Perishing Tyrant’s Dark Dao/Way. From here, proceed eastward to the second, and in sequence, to the sixth.*\n\n*Then, with the six incisors of the rat, descend and rest—warding off all malevolent ghosts and demons.\"*\n\nWhen a person dies, they first go to the **Palace of the Perishing Tyrant’s Dark Dao/Way** to be registered. Some may first visit famous mountains or Mount Tai (泰山), the Yangtze (江), or the Yellow River (河), but they need not immediately proceed to the first heavenly palace. On the day they are due for registration, their fate—whether fortunate or ill-fated, and the consequences of their deeds—will be determined here, in the first heavenly palace.\n\nThe **Palace of the Great Slaying** governs the slaying ghosts (杀鬼), the second realm. Those who die violently or suddenly also pass through here.\n\nThe **Palace of the Illuminating Dawn** is where virtuous sages and enlightened beings are registered before their passing. The **Palace of the Serene Light** oversees the allocation of retribution, fortune, misfortune, predestined fate, and the punishment of offenses. The **Ghostly Officials of the Northern Dipper** (鬼官北斗君) administer this realm. The *Northern Dipper* (北斗) of the ghostly officials is not the celestial *Northern Dipper*—rather, it is a separate *Northern Dipper Official* who governs life and death.\n\nThe *Ghostly Officials’ Supreme Emperor* (太帝) is the **Northern Emperor** (北帝君), who presides over the first heavenly palace and oversees all six. The remaining four heavenly palaces are each governed by the **Four Bright Lords** (四明公).\n\nEach of the six heavenly palaces is staffed by one official, totaling three officials for the six realms—akin to the modern *criminal and judicial offices* (刑名之职). These officials examine and sentence the deceased, reporting to the **True Immortal Officials of Fate** (真仙司命) and overseeing their governance. They also command the **Immortal Precincts** (仙府) and collectively manage the affairs of life and death, with all major judgments made by the immortal officials.\n\nThe *Ghostly Officials’ Northern Dipper* (鬼官北斗君) is merely the **examiner of the Daoist Seven Stars** (道家七辰北斗之考官). This ghostly official is also subordinate to the **Nine Star Spirits** (九星之精), reporting to the **Jade Emperor of the Northern Pole** (北辰玉君).\n\nXiang Liang (项梁) composed *The Luo Ding Ode* (《酆都颂》), which reads:\n\n*\"The Tyrant’s Perishing Banner in the Dawn,\nThe Righteous Decrees Meet their End in the Heavy Fog.\"*\n\nThe flaming glow rises like smoke in the heavens,\nIts brilliance bursts forth like the radiant splendor of the sun’s reflection.\n\nThe martial city encircles the divine peaks,\nSerene and luminous, it swallows the Azure River whole.\nThe grand gates overlook the Vermilion Well,\nWhile Cloud Gate looms dark and towering.\n\nThe Seven Non-Existent [Stars] span their wondrous canopy,\nAnd the Linked Enveloping [Stars] stretch their arcane magic.\nSix heavens stretch across the Northern Dao—\nThis is the realm of ghosts and spirits.\n\nThe ode contains twenty thousand words,\nNow I briefly excerpt the inscriptions of the Six Heavens alone.\nEven at night, it may be read in whispers,\nA charm to repel malevolent ghosts.\n\nOn Mount Luo Ding, the trees, waters, and marshes are all like those of the mortal world,\nYet the rice grains are as large as pomegranate seeds,\nTheir taste like that of water chestnuts—\nThe other four grains are likewise, though they are simply called \"rice\" and \"heavy-thought\" [重思].\n\nDu Qiong composed *The Heavy-Thought Ode*:\n*\"Spring’s verdant abundance descends in misty grace,\nLush and emerald, the heavy-thought grain thrives.\nDivine qi envelops all—\nThe auspicious grain ripens in season.\nWith the four seasons enjoyed,\nThe people bless the harvest with offerings.\nThe sacred grain flourishes in the boundless capital,\nIts colossal ears stretch across my dark hall—\nHere lies a clear omen,\nBy which the Sage-King brings prosperity.\"*\n\nThis is called *heavy-thought rice* [重思].\nIts grains are like pomegranate seeds,\nLarge and distinct, with a taste like water chestnuts—\nAlso presented above to the immortal officials.\n\n**Chapter on the Ghostly Sovereigns**\nFlame-Regal Jia [炎庆甲] was the ancient Flame Emperor,\nNow the Northern Grand Sovereign [北太帝君],\nThe master of all ghosts and spirits in the world.\n\nKing Wu of Zhou [武王] now serves as the Ghostly Official of the Northern Dipper.\nXuanyu [夏启] is the Eastern Bright Lord [东明公], commanding the Dipper Marshal.\nKing Wen [文王] is the Western Bright Lord [西明公], commanding the Northern Emperor’s Marshal.\nChao Gong Si [召公奭] is the Southern Bright Lord [南明公].\nWu Ji Za [吴季札] is the Northern Bright Lord [北明公].\n\nThe Four Bright Lords each have four attendants.\nYet these Four Lords later shall receive the Dao of transformation,\nAscending to the ranks beneath the immortals.\n\nThe Four Bright Lords oversee the ghosts of the four directions,\nAnd sixteen Bright Attendants [四明郎] govern the blood-and-sacrifice ghosts of the world’s ancestral halls.\n\nZhou Zhen [周颛] was the Ghostly Marshal of Fate,\nNow Deng Yue [邓岳] and Cheng Xie [程遐] serve in his place due to his many affairs.\n\nJia Yi [贾谊], the Western Bright Prohibition Officer,\nOnce mismanaged the imperial stables and was demoted to guard Mount Tai,\nNow the Mount Tai Sovereign has recently petitioned to make him a marshal.\n\nThe Southern Gate Warden has been replaced by Zhou Fu [周抚], succeeding Ge Jian [郄鉴].\n\nEach Heavenly Gate has two wardens,\nAnd each warden has four Gate-Keeping Officers—\nThus, one Heavenly Gate has eight Gate-Keeping Officers in total.\nThese officers serve beneath the Heavenly Gate Wardens—\nThis is the gate of the Northern Emperor.\n\nThe Heavenly Gate Warden under the Northern Dipper is now Zang Hong [臧洪],\nWho succeeded Kui Hao [隗嚣], with another position filled by Wang Bo [王波].\n\nJi Zhan [纪瞻], originally the marshal of the River-Pacifying General,\nNow serves as a Northern Heaven Gate-Keeping Officer,\nReplacing Tian Yin Zhan [田银瞻] and Yu Tan [虞谭],\nTaking turns to guard the Heavenly Gate for one day at a time.\n\nWei Zhao [魏钊] leads as the Marquis of Lu Mountain.\nGu He [顾和], returning from garrison duty in Liaodong,\nHaving completed his service, is now to be appointed as the Standard-Bearer Officer.\nFan Ming [范明], the former Standard-Bearer, has been promoted to the Lord of the Seal.\n\nYin Hao [殷浩] attends the Emperor of Dawn,\nConfronting He Yan [何晏] in debate.\nWen Tai Zhen [温太真] is the Overseer of the Eastern Sea,\nRecently appointing Du Yu [杜预] as his Chief of Staff,\nWith a rank equivalent to that of a General’s Chief of Staff.\n\nHe Sidao [何次道], originally an internal inspector under the Northern Emperor,\nHas since returned to the Zhu Huo Palace to receive transformation,\nDue to his prior deeds of great benevolence.\n\nEmperor Wu of Wei [魏武帝] serves as the Northern Grand Tutor [北若太傅].\nThe rest are too numerous to recount.\n\nThis is the affair of ghosts and spirits,\nUnworthy of being revealed to the world—\nThe words of Master Xun [荀公].\n\n**Chapter Three: The Dao of Sleeping**\n\nWhen a man lies down, his bed must be raised high—\nfor if it is high, the earthly *qi* will not reach him,\nand the ghosts will not blow upon him.\nThe *qi* of ghosts invading a man\nalways ascends from the earth below.\n\nThe chamber where one sleeps must be kept pure and clean—\nif it is pure, one receives the refined *qi* of the spirits;\nif it is unclean, one receives the stale *qi* of the past.\nThe disruptive *qi* of the dead within a chamber\nmakes all undertakings fail,\nall actions collapse.\nThe same applies to the body—\none must bathe and cleanse oneself often,\nor else hope is lost.\n\nDo not speak of the Dao while learning the Dao.\nIf one speaks of the Dao while learning the Dao,\nghosts will assault the person,\nand nothing will succeed—\nthe body will fall ill,\nfor the essence has not yet been perfected.\n\nMaster Shan Sheng, far away, received the teachings of Master Meng.\nIn the evening, before sleep, he would recite the *Huangting Neijing* once,\nthen rest—\nthus refining his soul and spirit by himself.\nIf one practices this for twenty-one years,\none becomes immortal—\nthis is the way of harmonizing ten thousand recitations.\nTo recite three or four times in the evening is already excellent.\nMadame Jiang of the Northern Peak said:\n“Reciting this also prevents illness—\nthis is the Dao of not dying.”\n\n**Chapter Four: Nighttime Tooth-Chattering**\n\nAt night, one must habitually chatter one’s teeth—\nfor tooth-chattering has no limit.\nKilling ghosts and malevolent ghosts fear the sound of tooth-chattering,\nand thus dare not approach a man.\n\nIf one combines this with spitting and reciting incantations,\nthe effect is even better.\n\nIn the past, there was a man named Bao Zhu,\nfrom Jibei.\nHe was not one to study the Dao,\nnor did he know any techniques.\nAt over forty years of age,\nhe suddenly suffered from wind illness—\nhis face was distorted, his eyes and mouth misaligned,\nand the wind *qi* entered his mouth,\ncausing his upper and lower teeth to constantly strike together,\nwith a loud sound,\nday and night without cease.\nHe lived to be 127 years old.\nLater, he encountered extreme cold and fell into the Changshou River,\nwhere he drowned.\n\nEven the Northern Emperor’s subordinates,\nwho were sent to kill ghosts and punish those who wander the earth,\ndid not dare approach Zhu.\nThe Ghost Official questioned the reason,\nand the Heavenly Executioner replied:\n“This man uses many techniques to restrain us.\nHe habitually strikes his teeth and beats the heavenly drum\nto alert the spirit within his body,\nso that the spirit cannot scatter,\nand the ghostly *qi* cannot enter.\nThus, there was no cause for us to kill him.”\n\nFrom this, it can be reasoned:\nIf Zhu had not fallen into the water,\nhe might have lived to a thousand years without dying.\nAt that time, he encountered extreme cold\nand walked on the frozen river,\nhis mouth unable to chatter his teeth—\nthus, the ghosts caused him to drown in the river.\n\nEven those afflicted with wind illness,\nwhose teeth chatter on their own,\nstill manage to avoid death and repel ghosts—\nhow much more so for a genuine Daoist\nwho deliberately chatter his teeth\nand beats the heavenly drum to strengthen his spirit!\n\nThe *Xianfang* says:\n“Constantly swallowing saliva and chattering the teeth\nwill make one’s lifespan reverse and shorten.”\n\n**Chapter Five: The Northern Emperor’s Officials**\n\nEight attendants serve the Emperor of Dawn:\nXu Shu, Pang De, Yuan Yu, Li Guang, Wang Jia, He Yan, Jie Jie, and Yin Hao—\nall like the *shizhong* of the mortal world.\n\nThe Four Bright Lords and the Northern Dipper Lord\neach have five attendants to the Emperor of Dawn.\nThe eight mentioned earlier are the Northern Emperor’s officials,\nand their selection follows the same rules.\n\nThere are also four *zhonglang* direct attendants,\nlike the *shangshu* of the mortal world.\nDai Yuan, Gongsun Du, Liu Feng, and Guo Jia hold these posts today.\nFeng was the adopted son of Xuande,\nwho now serves as the Northern He Marquis,\nopposing Han Sui.\nHe is now under the command of the Celestial Officials.\n\nThere are also two *dajinchen* officials,\nlike the *shangshu* of the mortal world—\ntoday, Han Guangwu and Sun Wentai hold these posts.\n\nThere are also *zhongjinchen* officials,\nlike the *zhongshu* of the mortal world,\nwith two overseers—\nYan Huai and Yang Biao hold these posts.\nHuai’s courtesy name was *Siji*,\nand Biao’s was *Wenxian*.\n\nThe father of Xu Changshi now serves as the Southern Danfang Marquis.\nThere are two Danfang Marqises,\neach overseeing the south and north.\nXu Changshi’s father is the Southern Danfang Marquis,\nLiu Zan serves as his *simaji*,\nBao Xun is the Northern Danfang Marquis,\nand Wei Zun is his *simaji*.\nThey also control the keys to the southern and northern gates.\nXu commands a thousand soldiers of the Southern威,\nand Bao Xun commands a thousand soldiers of the Northern威—\ntheir primary duty is to guard the gates,\nlike the *Yulin* overseers of the mortal world.\nThe soldiers of the Southern威 and Northern威\nfollow the Daoist example of the Heavenly Warriors and armored soldiers.\n\nSun Ce serves as the guest of the Shuming Lord,\nHan Gao as the guest of the Naning Lord,\nJin Xuan as the guest of the Ximing Lord,\nand Xun Hu as the guest of the Beiming Lord.\nAmong them, those with past virtues and hidden deeds of benevolence and rescue\nare sometimes directly appointed to celestial offices,\nor enter the Southern Palace to receive transformation,\nregardless of their former rank.\n\nThe rewards and punishments one receives in life\nare measured by one’s accumulated karma.\n\nGenerally, those who practice great benevolence and relieve the suffering of the destitute\nare swiftly admitted to the Southern Palace,\nbecoming the path of immortal transformation.\n\nYu Yuan Gui serves as the Northern Emperor’s *qianzhongwei* General,\ntaking Guo Changxiang as his *changshi* and Hua Shao as his *simaji*—\nthis is what is called a *jun gong*,\ncommanding thousands of ghostly soldiers.\n\nKong Rong serves as the *houzhongwei* General,\nwith Zhang Xu as his *simaji* and Tang Gu as his *changshi*.\n\nTao Can serves as the Xihe Marquis,\nalso commanding thousands of soldiers.\nHe recently sought Teng Han to replace him,\nbut the request was not yet granted.\nXu Ning serves as his *changshi*,\nbut due to his failure to capture the rebellious generals at the Northern Gate,\nhe was dismissed from office.\nCai Mo should replace Ning.\n\nThe Four Viceroys each command ten thousand ghostly soldiers,\nwhile central officials command only thousands.\nThe Four Viceroys consist of:\nthe Taishan Lord, the Lulong Lord, the Dongyue General, and the Nanba Marquis—\neach commanding ten thousand soldiers.\n\nHe Zong serves as the Nanba Marquis,\nCao Ren as the Lulong Lord,\nLiu Tao as the Dongyue General,\nand Xun Lei as the Taishan Lord.\n\nThere are hundreds of places where ten thousand soldiers are stationed,\nand hundreds where thousands are stationed—\nall under mutual command and subordination.\n\n「All hold the title of *changshi* (長史). The *zhuanshi* (司馬) Zhen took Gu Zong as the Taishan General, appointed Cao Hong as the *zhuanshi* (司馬), and Huan Fan as the *changshi* (長史).\nWang Yishao’s affairs in the Imperial Palace have lasted five years; it is said that his affairs have now dispersed.\n\nJiang Ji became the Nan Mountain Marquis, commanding two thousand soldiers.\nWang Gu became the Departmental Ghost General.\n\nAmong those with official ranks, they roughly recognize one another by surname and given name,\nbut those without rank are countless—impossible to enumerate fully.\nEven among the scattered ranks, the number of mortals in China is far greater than those on the frontier.\n\nXu Zhao now serves as the Right Marshal of Dongming Gong, a post akin to the *zhongshu shi* (中书监) of the mortal world.\nShao Shi serves as Dongming Gong, having been appointed as the Right Protector of the Nine Palaces in the upper realm.\n\nThe rulers beneath the earth are divided into three grades,\nas are the titles of *guishuai* (鬼帅).\nAll are granted these positions due to accumulated virtue and deeds in their past lives.\n\nSome seek longevity through Daoist practice,\nothers through their descendants’ virtuous conduct, which spreads the blessings of their ancestors,\nor through reciting the profound and mysterious teachings,\nso that their influence flows into the Kun Ancestors.\n\nThe paths to attaining these ranks are many,\nyet the means of achieving them are varied.\n\nIt is essential to accumulate hidden merit in this world\nbefore ascending to these stages of broad life.\n\nThe *guishuai* (鬼帅) attain martial mastery,\nwhile the rulers attain literary mastery—\nboth mark the beginning of transcendence.\nThey are also called by the degree *Donghua* (东华),\nregistered in the *Shangdi* (上帝)’s ledgers,\nand are not subject to the *Tengguan* (酆官) or the Three Officials’ regulations.\n\nThe lowest-grade rulers beneath the earth are scattered in the outer dwellings,\nidle and without purpose,\nunbound by the Nine Palaces’ teachings or training,\nyet still within the *Dongtian* (洞天).\nThey are the lowest among the rulers.\n\nAccording to the Four Ming Laws,\none must follow the prescribed terms for 140 years before advancing—\none advancement grants the *buxian* (步仙) stage,\nallowing them to serve as messengers of the immortals.\nThe second-grade rulers beneath the earth\ndirectly attain the *xingxian* (行仙) stage,\nserving as immortals for 40 years before being promoted to oversee the *jian* (禁) positions—\nthe *jian* (禁) ranks are akin to mortal officials scattered in the world.\n\nThis is the middle rank among the rulers beneath the earth,\nwith Li Dong and others currently within it.\n\nThe third-grade rulers beneath the earth\nare the highest among the rulers,\nable to enter and exit the chambers of the immortals,\nroam the divine lands of the *Shenzhou* (神州),\nand transfer between the *Yizhan* (易迁) and *Tongchu* (童初) bureaus.\nThey may also attend the feasts on the *Donghua* (东华) Upper Platform,\nreceive instruction in refining their forms,\nand cultivate the *jingqi* (景气) of the *Ying* (易).\nAt twelve years, their *qi* (氣) controls their spirit and soul,\nat fifteen years, their spirit returns to their body, and their soul is preserved.\nAt thirty years, their bones within the coffin revive,\ntheir spirit and soul reunite,\nat forty years, they fully recover and are reborn,\nreturning to wander among mortals.\nAt fifty years, they are appointed as immortal officials,\nand at sixty years, they may roam the *Guanghan* (广寒) Palace.\nAt a hundred years, they enter the *Kunyun* (昆瀛) Palace—\nthis is the highest rank among the rulers beneath the earth,\nthe ultimate indulgence of the immortals.\n\nZhang Jiangzi and others initially belonged to the third rank,\nbut they have only now entered the *Yizhan* (易迁).\n\nThe hierarchy of *guishuai* (鬼帅) is similarly structured.\n\nOn the night of the twenty-fourth day of the seventh month,\nthe *Baomingjun* (保命君) informed me.\n\nThe immortal Xin Xuanzi composed and presented this poem as the sixth in his sequence.\n\nXuanzi, styled *Yanqi* (延期), was born in Dinggu of Longxi (陇西定谷).\nDuring the reign of Emperor Ming of the Han,\nhe served as a *Jianyi dafu* (谏议大夫).\nHe was the son of Sin Yin, the governor of Shangluo, Yunzhong, and Zhao (上洛、云中、赵国) counties.\n\nIn his youth, Xuanzi loved learning and followed the Dao.\nHe revered and upheld the precepts,\ndevoted himself to austere practice,\nate vegetables at noon,\nrefined his form and preserved his essence,\nand was unmoved by external affairs.\nThough officials from the state and capital court repeatedly invited him,\nhe never accepted their offers.\nSometimes he wandered in the mountains and forests,\nabandoning the world’s dust and turmoil,\nand aspired to meet Zi Jin among the Weicheng peaks,\ntraveling to Junyang to walk in the *Xuan* (玄) Way.\nThus, he changed his name to Xuanzi,\nand styled himself *Yanqi*.\n\nHe did not expect that his ancestors had committed many transgressions,\nbringing calamity upon their descendants.\nYet, through his sincerity and virtue,\nhe was recorded in the *Shangdi*’s (上帝) ledgers,\nand his fate reached the *Hou Kun* (后昆).\nThough his lifespan was not long,\nhe perished at the Changliang ferry.\n\nThe Western Queen Mother saw my bitter practice,\nand the *Tengdu Shangdi* (酆都上帝) pitied my Daoist resolve.\nShe moved the *Siling* (司命) to act,\nsent orders to the Three Officials,\nseized my body,\nand restored my soul to its true form.\nThus, I was granted the *Yitai* (颐胎) position as an immortal spirit,\nand it has now been over two hundred years.\n\nRecently, I was awarded the degree *Nangong* (南宫),\nfixed my strategy at *Zhuling* (朱陵),\nand preserved my essence, awaiting the time to ascend as an immortal.\n\nYet the *Tai Di* (太帝) now sees fit to assign me as the commander of Donghai Hou,\nreplacing Yu Sheng,\nand also to select me as a *Jianzhong langjiang* (禁中郎将),\noverseeing the affairs of Wu Yue’s ghostly deities.\nMy duties are endless and exhausting.\n\nAs for those who wear the *mao* (冠) of dawn and the *qing* (青) sash,\ntheir robes fluttering with elegance,\nascending the *xian* (仙) stages with resonant bells,\nand riding in jade carriages—\nthough they may possess true hearts,\nthey have yet to see the day of their attainment.\n\nI regret that I have not yet been permitted\nto join the *Xuanzhen* (玄真) in their ranks,\nfeast together in the *Kunlun* (昆阆) halls,\nlisten to the lingering melodies of the *Junjiao* (钧韶),\npluck the jade sprigs from the secluded peaks,\nwear the green robes of the Nine Heavens,\nand dance with clouded wings across the ten directions.\n\nNow I am tasked with commanding the multitude of ghosts,\nsettling disputes among them,\ndwelling amidst the profane,\nand hearing the cacophony of malevolent spirits.\nMy affairs are distant from the Dao and Virtue,\nand my gaze is ever more detached from the truth.\nYet I am familiar with the serene stillness of the *Xuanjing* (玄境),\nand the boundless freedom of the *Taichu* (太初).\n\nFor those who share the same resonance and gather together,\nthings also fall into similar categories.\nTheir distant voices echo faintly,\ntheir lingering *jingqi* (景气) and accumulated essence\nare why the *Shangqing* (上清) ledgers are named as such,\nand the *Danlu* (丹箓) *Xuanjie* (玄阶) are called by these terms.\nThe Daoist *qi* (氣) harmonizes with their spiritual virtue,\nand they entrust their bodies to the lofty and bright.\nThus, they come to follow me.\n\nToday, I present three poems\nto express the depth of my gratitude.\n\nThe verses read:\n\n*In days past, I entered the realm of darkness,*\n*Following the carriage in response to the spirit’s call.*\n*The spirit remains with the chamber unscattered,*\n*My essence merges with the auspicious clouds.*\n*Though my form is not the clarity of bright jade,*\n*The mysterious artisan cannot fail to carve me.*\n*Stepping forward, I hear the distant chant,*\n*Lifting my hands, I play with the resonant strings.*\n*In the forest chambers, there is leisurely joy,*\n*Yet I sever all ties beyond the pavilion’s gate.*\n*The lingering essence clings to the round brilliance,*\n*How rare and faint the praises now resound!*\n*The silent and boundless realm conveys my emotions,*\n*The mysterious essence seizes the harmonious sounds.*\n*The high wheels may vary in their paths,*\n*Yet the ten thousand fathoms bring them to seek me.*\n\nThe rustling **Researcher of the Dao**, merging spirit with the soul’s embrace,\nSubmitting to the boundless transformation of the world, his heart marked by the secluded groves.\nTogether they wander beyond the realm of reason, in quietude ascending the eastern peaks.\nCommanding the carriage to the broad **Duān** heights, transcending mortal shores to the land of darkness.\nIn the void, there are forms—yet within them, no permanence.\nAwakening to the boundless speech of existence and nonexistence, they gather at the **Hutao Bridge**.\nWith eyes, they behold the **Mysterious Sage**—ghosts and spirits forget their own essence.\n\n**Mysterious Sage** remarks: *\"In the Wei dynasty, there was a man named Xīnpí, styled Zuòzhì, who was his seventh descendant. During the Han dynasty’s *Jiànwǔ* era (2nd year), he migrated from Lóngxī to settle in Yǐngchuān’s Yángzhài County. Xīnpí served in the Wei court as the General Who Bears the Imperial Edict, Grand Marshal, and Marshal of the Army, holding the title of Marquis of Wèiwèi. His son, named Chǎng, became Governor of Hénèi and Minister of the Imperial Sacrifices.*\n\n**Mysterious Sage** remarks: *\"The Regulus, this is Jin’s Regulus the Grand General. The Northern Emperor once appointed him as the Pacifying General of the East, later ennobling him as Marquis of Dōnghǎi. Now he serves as the Morning Attendant of the **Duān** Court, akin to a modern-day Grand Chamberlain. The Right Imperial Censor is the **Right General of the Imperial Guard**, a position of great weight. The Left Imperial Censor is Xiè Yòuyú, appointed as the Marshal of the **Duān** Mountains. The **Prince of Nánchāng**, once the Southern Zhūyáng Gatekeeper and Spirit Gate Marquis under the Northern Emperor, later became the **High Clarity’s Censor**, but was once demoted for a dispute with Liú Qìng’s grandson—now he is to resume his duties. The **High Clarity’s Censor** is akin to the **Chancellor of State** in the mortal world.\n\nHé Cìdào now resides in the Southern Palace’s **Xínghuá Terrace**, having already received the scriptures, now journeying toward the Southern Peak. This man, in life, performed many benevolent deeds, thus attaining early transcendence.\n\nZhōu Bó-rén has recently been appointed as the **Central Protector of Xīmíng**, a role akin to the **Grand Tutor** of the mortal world. Due to an unfair selection of Dèng Yòu, he was demoted to **Central Guardian**, equivalent to a **Minor Tutor**. The above are the words of **Mysterious Sage**—the affairs of the netherworld are many, and here I record but a fragment, omitting further details.\n\n**Master Péi** recounts that within a year, the seventh rank of transcendent beings was attained.\"*\n\nThe **Hé Mountain** has practitioners of the Dao, **Dèng Bǔyuán** and **Wáng Xuānfǔ**, who ingested **qīngjīng stone** and followed the method of swallowing **sun-essence elixirs**. Through thirty-four years of concentrated meditation in the **Dòngfáng Chamber**, they attained inner vision of the **Five Viscera**. On the fifth day of the fifth month this year, the **Grand Sovereign** dispatched a **feathered chariot** to welcome them. On that very day, they ascended to the heavens on **clouds and dragons**, now residing at the **Northern Mystic Enclosure Terrace**, where they received scriptures and were granted the rank of **Middle True Person**.\n\nIn the **Huáyáng Mountains**, practitioners of the Dao—**Yín Qiánzǐ**, **Zhāng Shígēng**, and **Lǐ Fānghuí**—all from the **Jìn Wǔdì** era, ingested **elixirs** from **Guǎnchéngzi the Immortal** using **steamed wood methods**, extending their years and vitality. Later, they received **Sūmén Zhōu Shòulíng’s** teachings on **elixirs of the Red Clouds**, devoting fifty years to inner contemplation without food, their bodies light and youthful in appearance. On the twelfth day of the second month this year, **Tàiyī** dispatched a welcome, and on that day, they ascended on clouds to the heavens, now at **Mystic State** as **High Immortals**—**Shígēng** as **East Source Marquis**.\n\nIn **Héngshān**, **Zhāng Lǐzhèng** and **Lǐ Míngqī** practiced the Dao. **Lǐzhèng**, from the late **Hàn Dynasty**, consumed **huángjīng** in the mountains, maintaining vigor like a man of forty. **Míngqī**, from the late **Wèi Dynasty**, ingested **ze-xié wúshí pills**, then together retreated to a cave. Later, they received **Xīchéngjūn’s** **Rainbow Divine Elixir**, consuming it for forty-three years. Stricken by elixir difficulties, they fled to **Guǎngzhōu** as travelers during **Téng Hán’s** governorship. Their inner and outer vision became clear, their eyes sharp and bodies light—traveling five hundred *lǐ* in a day, also practicing **guarding the One** for thirty years. On the first day of the third month, **Dōnghuá** dispatched a welcome, and on that day, they ascended on clouds to the heavens, now residing in the **Fāngzhū Biāoshì Chamber** as **Supreme Immortals**.\n\nIn **Lu Jiāng’s** **Qiánshān**, **Zhèng Jǐngshì** and **Zhāng Zhònghuá** received **Mèng Dérán’s** oral teachings at the start of the **Jìn Dynasty**, practicing **Five Viscera Containment** and **Sun-Essence Cultivation**, along with **húmá** (hemp) and **mystic elixirs**, eventually abandoning food entirely. Their bodies grew light and strong, reversing their aging. On the nineteenth day of the fourth month this year, **Northern Mystic Tàiyī** welcomed them in a **cloud palanquin**, ascending in broad daylight to **Mystic State**.\n\nIn **Kuòcāngshān**, **Píng Zhòngjié**, a native of **Héngdōng**, fled to the mountains during the **Great Hu** chaos, studying **Sòng Jūn’s** **Mirror of the Heart** methods, mastering **hundred deities**, and practicing **Dòngfáng Chamber** techniques for forty-five years. His body grew refined, his **true qi** manifest. On the first day of the fifth month this year, **Central Yellow Old Tàiyī** dispatched a welcome, and on that day, he ascended on **clouds and dragons** to the heavens, now at the **Cānglàng Cloud Terrace**.\n\nIn **Jiǎn Shàobái Mountain**, **Zhào Guāngxìn**, from **Yángchéng**, entered the mountains at the end of the **Wèi Dynasty**, receiving **Lǐ Fǎchéng’s** **qi-cultivation methods** and **Zuǒjūn’s** **Mystic Middle Dao**. Through eighteen years of inner vision of the **Five Viscera**, he wandered between prefectures, sometimes selling elixirs. Many came to the market to buy **dānshā** (cinnabar) for **Jiǔhuá Elixirs**, each dose complete. On the seventeenth day of the sixth month this year, **Tàiyī Dàojūn** dispatched a welcome, and after three days’ farewell with mountain companions, he ascended on **clouds and dragons** in broad daylight, now in the **Eastern Mystic Sea**.\n\nIn **Lángwǔ Mountain**, **Yú Wēngshēng**, from **Kuàijī**, received **Jièjūn’s** **Sun-Essence Diet** in the **Wú era**, hiding in these mountains while practicing **cloud-qi transformation**. Through long meditation, his form shrank like a child’s. On the twenty-third day of the seventh month this year, **Eastern Mystic Tàidì** dispatched a welcome, and on that day, he ascended on clouds to the heavens, now in **Tānggǔ Mountain**.\n\nIn **Chìshuǐ Mountain**, **Zhū Rùzǐ**, from the late **Wú era**, consumed **chrysanthemum blossoms** and **wood-based elixirs**, later encountering **Xīguīzǐ**, who granted him **transcendence**. **Xīguīzǐ** taught him **Essential Speech** and **Níwán Chamber** methods. After thirty years, he could summon **clouds and rain** in his chamber. On the fifth day of the eighth month this year, **Xī Wángmǔ** dispatched a welcome, and on that day, he ascended in a **five-colored cloud chariot** to the heavens, now in the **Jīshí Chamber**.\n\nAmong the **named mountains and Five Peaks**, hundreds of thousands practice the Dao, with many ascending yearly—names recorded separately. Each month, some depart; their numbers cannot be fully chronicled. Here, I merely record those who attained transcendence this year. Some, unwilling to ascend, remain indefinitely in the **Five Peaks and named mountains**, numbering countless thousands. Others serve as **immortal officials**, sealing and governing these mountains—also in the thousands.\n\nThis record was completed on the night of the twentieth day of the ninth month by **Qīnglíng Cù**.\n\n**Dào Jì** of **Dōngqīng**, ranked eighth, later entered the **Wěiyǔ Mountain’s Stone Chamber**, the **Dàyǒu Palace**, where he received **stone-essence, golden-light, hidden-transformation methods** from **Xīlíngzǐ Dōu**. **Xīlíngzǐ Dōu** is a **Tàixuān Immortal Maiden**.\n\nThose who studied with him at the same time and now reside in the **Dàyǒu Chamber** include:\n- **Guǎngyù Bào Shùyáng** of **Guǎngyù**,\n- **Tàiyuān Wáng Yǎngbó** of **Tàiyuān**,\n- **Yǐngchuān Liú Wěihuì** of **Yǐngchuān**,\n- **Dài Jùn Duàn Jìzhèng** of **Dài Jùn**,\nall having received teachings from **Xīlíngzǐ Dōu**.\n\nAs **Jìzhǔ** prepared to depart, his form took the likeness of a **wù-jǐ** figure upon his pillow.\n\nHis tomb lies south of **Shēngpán Mountain** in **Chéngdū**, **Shǔ Jùn**. **Zhūgě Wǔhòu** once erected a stele with this inscription before his grave:\n\n*\"Mystic void, great stillness—\nYin and yang in harmony.\nHeaven and earth in union—\nTen thousand things flourish.\"*\n\nThe Master’s teachings distinguished between yielding and firmness.\nGhosts and spirits observed, and the Six Perfections shone clearly.\n\n**Guǎngyù Bào Shùyáng** was a high official of **Zhào Wáng** Zhāng Ěr and Zhāng Áo during the reign of **Hàn Gāodì**. In his youth, he took delight in cultivating life and consuming cassia bark, yet he died suddenly in laughter. His tomb now lies north of the mountains in **Liáo Jì City**.\n\n**Tàiyuān Wáng Yǎngbó** served as a **Zhōngchángshì** during **Lǚ Hòu**’s regency in the **Hàn**. His younger brother, **Wáng Cǎi**, in his youth consumed *Zéxiè* (Alisma), and together with **Liúhóu** Zhāng Liáng, they gathered herbs in **Zhōngnán Shān**. Yet **Yǎngbó** did not return, and he became a disciple of **Jìzhǔ**. He later studied the **Rìyuè qì** (Solar-Lunar qi) and became an inner-chamber disciple, attaining the Dao. Upon his return to his homeland, he took the form of a staff and sandals, and his body perished beneath a mulberry tree. His tomb is now on the western mountains of **Rǔnán Ānchéng County**.\n\n**Yǐngchuān Liú Wěihuì** was once **Gōngchē Shìmǎ** **Liú Fèng** during the reign of **Hàn Jǐngdì**. Later, he became a disciple of **Jìzhǔ**, and in his later years, he cultivated the **Rìyuè qì**, becoming an inner-chamber disciple who attained the Dao.\n\n**Dài Jùn Duàn Jìzhèng** was originally a recluse, taking no medicines or elixirs. Only in his later years did he study with **Jìzhǔ**, and together they traversed **Qínchuān**, both achieving *shījiě* (embodied transcendence). They were buried by the riverbank, and today, this place is **Nánzhèng Qínchuān**.\n\n**Jìzhǔ** had one son and one daughter, both of whom attained the Dao. His son was named **Fǎyù**, and his daughter, **Jìhuá**. They now reside in **Wěiyǔ Shān**.\n\n**Jìhuá** today is still reciting the *Sānlìshíjiǔzhāng* (Thirty-Nine Chapters), yet she has not yet finished.\n\n**Jìzhǔ** studied the *Yùjīng* (Jade Scripture), consumed the essence of the **Míngdān** (Luminous Elixir), and drew upon the radiance of dawn. Even now, his complexion is as youthful as a twenty-year-old maiden’s, his beard three *chǐ* long, and as black as ink.\n\nYesterday, **Dōngqīng Jūn** spoke of the Dao, recounting such matters as these—truly wondrous deeds! Yet I do not know their full meaning.\n\n**Jìzhǔ**, taking the form of hidden light, concealed his traces in **Wěiyǔ**, as fully recorded in the *Zǐyáng Zhuàn*. Last night, **Dōngqīng** arrived and casually inquired about **Jìzhǔ**’s origins. **Dōngqīng** answered, and I have recorded his words here. I present them above, hoping you will not find fault. After reading, please consign them to the flames.\n\nThis was later memorialized by **Shèng Lǐ Jūn**, largely consistent with the foregoing. Yet **Dōngqīng** further added annotations numbering over ten thousand words—a truly extraordinary work.\n\nRecently, we spoke much of divine transformations, and I mentioned **Jìzhǔ** in passing.\n\nLast month, I was also granted the *Shénhǔ Jīng Jiězhù* (Commentary on the Tiger Spirit Scripture), a text unknown to the world, whose meaning I myself do not fully grasp. If I hear of matters like those of **Jìzhǔ**, I shall surely report them in secret.\n\nThe *Língxiān Jì* (Record of Numinous Traces) is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "道迹灵仙记 经名：道迹灵仙记。 原不题撰人，疑系南朝顾欢《道迹经》残卷。 书中所载鬼神名录多见於陶弘景《真诰》。 一卷。 底本出处：《正统道藏》洞玄部记传类。 道迹灵仙记 六宫名第一 罗酆山在北方之癸地，山高二千六百里，周回三万里。 其山下有洞天，在山之下周回一万五千里，其上其下并有鬼神宫室。 山上有六宫，洞中复有六宫，一宫辄周回千里，是为六天鬼神之宫也，山上为外宫，洞中为内宫，制度等耳。 第一宫名为纣绝阴天宫，第二宫名为太杀谅事宗天宫，第三宫名为明晨耐犯武城天宫，第四宫名为恬照罪气天宫，第五官名为宗灵七非天宫，第六宫名为敢司连宛屡天宫，凡六天宫，是为鬼神六天之治也。 洞中六天宫，亦同名相像如一，号六天内外宫殿者也。 世人有知酆都六天宫门名，则百鬼不敢为害。 欲卧时先向北咒之三过，微其音也，神咒曰： 吾是太上弟子，下统六天，六天之宫，是吾所部，不但所部，乃太上之所主。 吾知六天门名，是故长生，敢有犯者，太上斩汝。 第一宫名纣绝阴天宫，以次东行第二，从此以次讫六宫止。 乃啄齿六下乃卧，辟诸鬼魔之炁。 人初死皆先诣纣绝阴天宫中受事，或有先诣名山及泰山江河者，不必便径先诣第一天也。 要受事之日，罪考吉凶之目，当来诣此第一天宫耳。 太杀天宫主杀鬼，是第二天也，卒死暴亡又经於此也。 贤人圣人去世，先经明晨第三天宫受事，祸福吉凶宿命罪害由恬照第四天宫，鬼官北斗君治此中。 鬼官之北斗，非天上之北斗也，鬼官别有北斗君以司生杀耳。 鬼官之太帝者，北帝君也，治第一天宫中，总主诸六天宫。 余四天宫，其四明公各在其中。 治二天宫辄立一官，六天凡立为三官，三官如今之刑名之职，主诸考谪，常以上属真仙司命兼以总御之也，并统仙府，共司死生之任，大断制皆由仙官。 鬼官北斗君乃是道家七辰北斗之考官耳，此鬼一官又隶九星之精，上属北辰玉君。 项梁成作《酆都颂》曰： 纣绝标帝晨，谅事遘重阿。",
      "translated_text": "**Dao/Way Traces of the Spiritually Transcendent Record**\n*Sutra Name*: **Dao/Way Traces of the Spiritually Transcendent Record**\n\nThe original text does not name its author, but it is suspected to be a remnant of the *Southern Dynasties* text *Dao/Way Traces Scripture* by Gu Xuan (顾欢). Many of the ghostly deities listed in this work appear in Tao Hongjing’s *True Admonitions* (《真诰》). One volume. Source of the base text: *Zhengtong Daozang* (正统道藏), under the *Dongxuan* (洞玄) section of the *Recorded Biographies* (记传类).\n\n---\n\n**Dao/Way Traces of the Spiritually Transcendent Record**\n**First Chapter: The Six Palaces of the Six Realms of Ghostly Deities**\n\nThe Luo Ding (罗酆) Mountains lie in the northern *癸地* (Guidi, the 8th of the 28 lunar constellations’ earthly domains). Towering two thousand six hundred *里* (li, ~840 miles), their circumference spans three thousand *里* (li, ~1,260 miles). Beneath the mountain lies a *Dongtian* (洞天, \"Cavern of Heaven\"), encircling one thousand five hundred *里* (li, ~630 miles). Both above and below this cavern are palaces occupied by ghosts and spirits.\n\nUpon the mountain are six palaces, and within the cavern, there are another six. Each palace measures a thousand *里* (li, ~420 miles) in circumference—these are the six *Tian* (天, \"Heavens\") of the ghostly deities, with the mountain-top palaces as the outer realms and the cavern palaces as the inner. Their structures are identical.\n\nThe first palace is called the **Palace of the Perishing Tyrant’s Dark Dao/Way** (纣绝阴天宫), the second the **Palace of the Great Slaying and Righteous Decrees** (太杀谅事宗天宫), the third the **Palace of the Illuminating Dawn and the Unyielding Offender’s Martial City** (明晨耐犯武城天宫), the fourth the **Palace of the Serene Light and Punitive Qi** (恬照罪气天宫), the fifth the **Palace of the Sovereign Spirit and the Seven Non-Realms** (宗灵七非天宫), and the sixth the **Palace of the Audacious Official and the Endless Winding Realm** (敢司连宛屡天宫). These six palaces constitute the governance of the ghostly deities across the Six Realms.\n\nThe six cavern palaces mirror their names and forms exactly, hence they are called the **Inner and Outer Six Heavenly Palaces** (六天内外宫殿).\n\nIf mortals know the names of the six gates of the Luo Ding palaces, the hundred ghosts dare not cause harm.\n\nBefore sleeping, one should face north and recite the incantation three times, softly. The divine incantation reads:\n\n*\"I am a disciple of the Most High. Below, I command the Six Realms. These Six Heavenly Palaces are under my jurisdiction. It is not only my jurisdiction but also the domain of the Most High. I know the names of the Six Heavenly Gates—thus I attain longevity. If any dare to offend, the Most High will behead you.*\n\n*The first palace is named the Palace of the Perishing Tyrant’s Dark Dao/Way. From here, proceed eastward to the second, and in sequence, to the sixth.*\n\n*Then, with the six incisors of the rat, descend and rest—warding off all malevolent ghosts and demons.\"*\n\nWhen a person dies, they first go to the **Palace of the Perishing Tyrant’s Dark Dao/Way** to be registered. Some may first visit famous mountains or Mount Tai (泰山), the Yangtze (江), or the Yellow River (河), but they need not immediately proceed to the first heavenly palace. On the day they are due for registration, their fate—whether fortunate or ill-fated, and the consequences of their deeds—will be determined here, in the first heavenly palace.\n\nThe **Palace of the Great Slaying** governs the slaying ghosts (杀鬼), the second realm. Those who die violently or suddenly also pass through here.\n\nThe **Palace of the Illuminating Dawn** is where virtuous sages and enlightened beings are registered before their passing. The **Palace of the Serene Light** oversees the allocation of retribution, fortune, misfortune, predestined fate, and the punishment of offenses. The **Ghostly Officials of the Northern Dipper** (鬼官北斗君) administer this realm. The *Northern Dipper* (北斗) of the ghostly officials is not the celestial *Northern Dipper*—rather, it is a separate *Northern Dipper Official* who governs life and death.\n\nThe *Ghostly Officials’ Supreme Emperor* (太帝) is the **Northern Emperor** (北帝君), who presides over the first heavenly palace and oversees all six. The remaining four heavenly palaces are each governed by the **Four Bright Lords** (四明公).\n\nEach of the six heavenly palaces is staffed by one official, totaling three officials for the six realms—akin to the modern *criminal and judicial offices* (刑名之职). These officials examine and sentence the deceased, reporting to the **True Immortal Officials of Fate** (真仙司命) and overseeing their governance. They also command the **Immortal Precincts** (仙府) and collectively manage the affairs of life and death, with all major judgments made by the immortal officials.\n\nThe *Ghostly Officials’ Northern Dipper* (鬼官北斗君) is merely the **examiner of the Daoist Seven Stars** (道家七辰北斗之考官). This ghostly official is also subordinate to the **Nine Star Spirits** (九星之精), reporting to the **Jade Emperor of the Northern Pole** (北辰玉君).\n\nXiang Liang (项梁) composed *The Luo Ding Ode* (《酆都颂》), which reads:\n\n*\"The Tyrant’s Perishing Banner in the Dawn,\nThe Righteous Decrees Meet their End in the Heavy Fog.\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 783,
      "start_sentence": 0,
      "end_sentence": 29,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 16.986398935317993,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\道迹灵仙记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "炎如霄中烟，勃若景耀华。 武城带神峰，恬照吞青河。 阊阖临丹井，云门郁嵯峨。 七非通奇盖，连宛亦敷魔。 六天横北道，此是鬼神家。 颂有二万言，今略道六天之宫铭钞出之耳。 夜中亦可微读，亦云辟鬼邪。 酆都山上树木水泽俱如人间，但稻粒如石榴子大，味如菱，其余四谷故尔，但名稻名重思耳。 杜琼作《重思赋》曰：霏霏春茂，翠矣重思。 灵气交被，嘉谷应时。 四节既享，祝人以祠。 神禾郁于浩京，巨穗横我玄台，爰有明祥，帝者以熙。 此之谓矣。 酆都稻名重思，其米如石榴子，粒异大，色味如菱，亦以上献仙官。 鬼神主第二 炎庆甲者，古之炎帝也，今为北太帝君，天下鬼神之主也。 武王发今为鬼官北斗君。 夏启为东明公，领斗君师。 文王为西明公，领北帝师。 召公奭为南明公。 吴季札为北明公。 四明公复有宾友四人。 然此四公后并当受化形之道，升仙阶之下也。 四明主领四方鬼，四明郎十六人，主天下房庙鬼之血食。 周颛为鬼官司命帅，今邓岳、程遐二人代，以其多事故也。 西明都禁郎贾谊，昔为治马融事不当，黜守泰山，泰山君近请为司马。 南门亭长今用周抚代郄鉴。 一天门有二亭长，一亭长辄有四修门郎，一天门凡八修门郎也。 门郎为天门亭长下官，此是北帝门也。 北斗君天门亭长今是臧洪，臧洪代隗嚣，又一人是王波新补。 纪瞻本为抚河将军司马，今为北天修门郎，代田银瞻与虞谭，更直一日守天门。 魏钊领庐山侯。 顾和从辽东戍还，有事已散，北帝君当用为执盖郎，执盖郎范明迁补典柄侯。 殷浩侍帝晨，与何晏对。 温太真为监海开国伯，治东海，近取杜预为长史，位比大将军长史。 何次道始从北帝内禁御史，得还朱火宫受化，以其先多施惠之功故也。 魏武帝为北若太傅。 其余多不能复一二。 此盖鬼神之事，不足示於世也，荀公言也。",
      "translated_text": "The flaming glow rises like smoke in the heavens,\nIts brilliance bursts forth like the radiant splendor of the sun’s reflection.\n\nThe martial city encircles the divine peaks,\nSerene and luminous, it swallows the Azure River whole.\nThe grand gates overlook the Vermilion Well,\nWhile Cloud Gate looms dark and towering.\n\nThe Seven Non-Existent [Stars] span their wondrous canopy,\nAnd the Linked Enveloping [Stars] stretch their arcane magic.\nSix heavens stretch across the Northern Dao—\nThis is the realm of ghosts and spirits.\n\nThe ode contains twenty thousand words,\nNow I briefly excerpt the inscriptions of the Six Heavens alone.\nEven at night, it may be read in whispers,\nA charm to repel malevolent ghosts.\n\nOn Mount Luo Ding, the trees, waters, and marshes are all like those of the mortal world,\nYet the rice grains are as large as pomegranate seeds,\nTheir taste like that of water chestnuts—\nThe other four grains are likewise, though they are simply called \"rice\" and \"heavy-thought\" [重思].\n\nDu Qiong composed *The Heavy-Thought Ode*:\n*\"Spring’s verdant abundance descends in misty grace,\nLush and emerald, the heavy-thought grain thrives.\nDivine qi envelops all—\nThe auspicious grain ripens in season.\nWith the four seasons enjoyed,\nThe people bless the harvest with offerings.\nThe sacred grain flourishes in the boundless capital,\nIts colossal ears stretch across my dark hall—\nHere lies a clear omen,\nBy which the Sage-King brings prosperity.\"*\n\nThis is called *heavy-thought rice* [重思].\nIts grains are like pomegranate seeds,\nLarge and distinct, with a taste like water chestnuts—\nAlso presented above to the immortal officials.\n\n**Chapter on the Ghostly Sovereigns**\nFlame-Regal Jia [炎庆甲] was the ancient Flame Emperor,\nNow the Northern Grand Sovereign [北太帝君],\nThe master of all ghosts and spirits in the world.\n\nKing Wu of Zhou [武王] now serves as the Ghostly Official of the Northern Dipper.\nXuanyu [夏启] is the Eastern Bright Lord [东明公], commanding the Dipper Marshal.\nKing Wen [文王] is the Western Bright Lord [西明公], commanding the Northern Emperor’s Marshal.\nChao Gong Si [召公奭] is the Southern Bright Lord [南明公].\nWu Ji Za [吴季札] is the Northern Bright Lord [北明公].\n\nThe Four Bright Lords each have four attendants.\nYet these Four Lords later shall receive the Dao of transformation,\nAscending to the ranks beneath the immortals.\n\nThe Four Bright Lords oversee the ghosts of the four directions,\nAnd sixteen Bright Attendants [四明郎] govern the blood-and-sacrifice ghosts of the world’s ancestral halls.\n\nZhou Zhen [周颛] was the Ghostly Marshal of Fate,\nNow Deng Yue [邓岳] and Cheng Xie [程遐] serve in his place due to his many affairs.\n\nJia Yi [贾谊], the Western Bright Prohibition Officer,\nOnce mismanaged the imperial stables and was demoted to guard Mount Tai,\nNow the Mount Tai Sovereign has recently petitioned to make him a marshal.\n\nThe Southern Gate Warden has been replaced by Zhou Fu [周抚], succeeding Ge Jian [郄鉴].\n\nEach Heavenly Gate has two wardens,\nAnd each warden has four Gate-Keeping Officers—\nThus, one Heavenly Gate has eight Gate-Keeping Officers in total.\nThese officers serve beneath the Heavenly Gate Wardens—\nThis is the gate of the Northern Emperor.\n\nThe Heavenly Gate Warden under the Northern Dipper is now Zang Hong [臧洪],\nWho succeeded Kui Hao [隗嚣], with another position filled by Wang Bo [王波].\n\nJi Zhan [纪瞻], originally the marshal of the River-Pacifying General,\nNow serves as a Northern Heaven Gate-Keeping Officer,\nReplacing Tian Yin Zhan [田银瞻] and Yu Tan [虞谭],\nTaking turns to guard the Heavenly Gate for one day at a time.\n\nWei Zhao [魏钊] leads as the Marquis of Lu Mountain.\nGu He [顾和], returning from garrison duty in Liaodong,\nHaving completed his service, is now to be appointed as the Standard-Bearer Officer.\nFan Ming [范明], the former Standard-Bearer, has been promoted to the Lord of the Seal.\n\nYin Hao [殷浩] attends the Emperor of Dawn,\nConfronting He Yan [何晏] in debate.\nWen Tai Zhen [温太真] is the Overseer of the Eastern Sea,\nRecently appointing Du Yu [杜预] as his Chief of Staff,\nWith a rank equivalent to that of a General’s Chief of Staff.\n\nHe Sidao [何次道], originally an internal inspector under the Northern Emperor,\nHas since returned to the Zhu Huo Palace to receive transformation,\nDue to his prior deeds of great benevolence.\n\nEmperor Wu of Wei [魏武帝] serves as the Northern Grand Tutor [北若太傅].\nThe rest are too numerous to recount.\n\nThis is the affair of ghosts and spirits,\nUnworthy of being revealed to the world—\nThe words of Master Xun [荀公].",
      "overlap_context": "ife and death, with all major judgments made by the immortal officials.\n\nThe *Ghostly Officials’ Northern Dipper* (鬼官北斗君) is merely the **examiner of the Daoist Seven Stars** (道家七辰北斗之考官). This ghostly official is also subordinate to the **Nine Star Spirits** (九星之精), reporting to the **Jade Emperor of the Northern Pole** (北辰玉君).\n\nXiang Liang (项梁) composed *The Luo Ding Ode* (《酆都颂》), which reads:\n\n*\"The Tyrant’s Perishing Banner in the Dawn,\nThe Righteous Decrees Meet their End in the Heavy Fog.\"*",
      "start_char": 783,
      "end_char": 1526,
      "start_sentence": 30,
      "end_sentence": 68,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 15.965844869613647,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\道迹灵仙记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "人卧法第三 人卧床当令高，高则地气不及，鬼吹不干。 鬼气之侵人，常依地而逆上耳。 人卧室宇当令洁净，洁争则受灵气，不净则受故气。 故气之乱人室宇者，所为不成，所作不立。 一身亦尔，当数洗沐澡洁，不尔无冀。 勿道学道，道学道，鬼犯人，事不立，使人病，是体未真故也。 山世远受孟先生法，暮卧先读《黄庭内经》一过，乃眠，使人魂魄自练制，但行此二十一年亦仙，是为合万过也。 夕得三四过乃佳，北岳蒋夫人云：读此亦使人无病，是不死之道也。 夜行啄齿第四 夜行常啄齿，啄齿亦无限数也。 杀鬼邪鬼常畏啄齿声，是故不得犯人也。 若兼之以漱液咒说益善。 昔鲍助者，济北人，都不学道，亦不知法术。 年四十余忽得面风，口目不正，风气入口而两齿上下常相切拍，甚有声响，如此昼夜不止，得寿年百二十七岁。 后乃遇寒过大水，堕长寿河中死耳。 北帝中间亦比遣杀鬼及日游地殃使取之，而此数杀鬼终不敢近助，鬼官问其故，天杀答云：此人乃多方术以制於我，常行叩齿呜打天鼓以警身中神，神不得散，鬼炁不得入，是以无有缘起趣得杀之耳。 以此论之，若助不行水渡河，亦或可出千岁寿不訾也。 当是遇大寒冻，步行水上，口禁不能复叩齿，是故鬼因溺着河中耳。 患风病而齿自叩动者，犹尚僻不死却杀鬼矣，何况道士真叩齿，呜天鼓具身神耶。 仙方云：常吞液叩齿，使人反少。 太帝官隶第五 侍帝晨有八人，徐庶、庞得、爰榆、李广、王嘉、何晏、解结、殷浩等居之，并如世之侍中。 四明公及北斗君并有侍帝晨五人，其向者八人是北太帝官隶耳，其选用亦同。 又有中郎直事四人，如世之尚书也。 戴渊、公孙度、刘封、郭嘉，此四人今见在职。 封者，是玄德之养子，玄德今为北河侯，与韩遂对，统今属仙官。 又有大禁晨二人，如今尚书，今汉光武及孙文台二人居之。 又有中禁晨，如今之中书，令监有二人，颜怀、杨彪二人居之。 怀字思季，彪字文先者也。 许长史父，今为南弹方侯，弹方侯有二人，各司南北。 许长史父为南弹方侯，留赞为司马，鲍勋为北弹方侯，韦遵为司马，亦各主南北门钥。 许领威南兵千人，鲍勋领威北兵千人，大都备门主收执而已，如今世上有羽林监。 威南兵威北兵，如道家天丁力士甲卒之例也。 孙策为束明公宾友，汉高为南明公宾友，晋宣为西明公宾友，荀或为北明公宾友。 其中宿运前生在世有阴德惠拯者，乃时有径补天官，或入南宫受化，不拘职位也。 在世之罪福多少，乃为称量处分耳。 大都行阴德多恤穷厄，例皆速入南宫，为仙化之道也。 庾元规为北太帝前中卫大将军，取郭长翔为长史，以华韶为司马，此所谓军公者也，领鬼兵数千人。 孔文举为后中卫大将军，以张绣为司马，唐固为长史。 陶侃为西河侯，亦领兵数千，近求滕含自代，犹未许侃，以徐宁为长史，坐收北阙叛将不擒免官，当以蔡谟代宁。 四镇皆领鬼兵万人，中官领兵不过数千。 四镇有泰山君、卢龙公、东越大将军、南巴侯四官，各领一万人也。 何曾为南巴侯，曹仁为卢龙公，刘陶为东越大将军，荀类为泰山君。 领兵一万镇处，亦有数百处也，领数千镇处，亦有数百处，更相统隶耳。",
      "translated_text": "**Chapter Three: The Dao of Sleeping**\n\nWhen a man lies down, his bed must be raised high—\nfor if it is high, the earthly *qi* will not reach him,\nand the ghosts will not blow upon him.\nThe *qi* of ghosts invading a man\nalways ascends from the earth below.\n\nThe chamber where one sleeps must be kept pure and clean—\nif it is pure, one receives the refined *qi* of the spirits;\nif it is unclean, one receives the stale *qi* of the past.\nThe disruptive *qi* of the dead within a chamber\nmakes all undertakings fail,\nall actions collapse.\nThe same applies to the body—\none must bathe and cleanse oneself often,\nor else hope is lost.\n\nDo not speak of the Dao while learning the Dao.\nIf one speaks of the Dao while learning the Dao,\nghosts will assault the person,\nand nothing will succeed—\nthe body will fall ill,\nfor the essence has not yet been perfected.\n\nMaster Shan Sheng, far away, received the teachings of Master Meng.\nIn the evening, before sleep, he would recite the *Huangting Neijing* once,\nthen rest—\nthus refining his soul and spirit by himself.\nIf one practices this for twenty-one years,\none becomes immortal—\nthis is the way of harmonizing ten thousand recitations.\nTo recite three or four times in the evening is already excellent.\nMadame Jiang of the Northern Peak said:\n“Reciting this also prevents illness—\nthis is the Dao of not dying.”\n\n**Chapter Four: Nighttime Tooth-Chattering**\n\nAt night, one must habitually chatter one’s teeth—\nfor tooth-chattering has no limit.\nKilling ghosts and malevolent ghosts fear the sound of tooth-chattering,\nand thus dare not approach a man.\n\nIf one combines this with spitting and reciting incantations,\nthe effect is even better.\n\nIn the past, there was a man named Bao Zhu,\nfrom Jibei.\nHe was not one to study the Dao,\nnor did he know any techniques.\nAt over forty years of age,\nhe suddenly suffered from wind illness—\nhis face was distorted, his eyes and mouth misaligned,\nand the wind *qi* entered his mouth,\ncausing his upper and lower teeth to constantly strike together,\nwith a loud sound,\nday and night without cease.\nHe lived to be 127 years old.\nLater, he encountered extreme cold and fell into the Changshou River,\nwhere he drowned.\n\nEven the Northern Emperor’s subordinates,\nwho were sent to kill ghosts and punish those who wander the earth,\ndid not dare approach Zhu.\nThe Ghost Official questioned the reason,\nand the Heavenly Executioner replied:\n“This man uses many techniques to restrain us.\nHe habitually strikes his teeth and beats the heavenly drum\nto alert the spirit within his body,\nso that the spirit cannot scatter,\nand the ghostly *qi* cannot enter.\nThus, there was no cause for us to kill him.”\n\nFrom this, it can be reasoned:\nIf Zhu had not fallen into the water,\nhe might have lived to a thousand years without dying.\nAt that time, he encountered extreme cold\nand walked on the frozen river,\nhis mouth unable to chatter his teeth—\nthus, the ghosts caused him to drown in the river.\n\nEven those afflicted with wind illness,\nwhose teeth chatter on their own,\nstill manage to avoid death and repel ghosts—\nhow much more so for a genuine Daoist\nwho deliberately chatter his teeth\nand beats the heavenly drum to strengthen his spirit!\n\nThe *Xianfang* says:\n“Constantly swallowing saliva and chattering the teeth\nwill make one’s lifespan reverse and shorten.”\n\n**Chapter Five: The Northern Emperor’s Officials**\n\nEight attendants serve the Emperor of Dawn:\nXu Shu, Pang De, Yuan Yu, Li Guang, Wang Jia, He Yan, Jie Jie, and Yin Hao—\nall like the *shizhong* of the mortal world.\n\nThe Four Bright Lords and the Northern Dipper Lord\neach have five attendants to the Emperor of Dawn.\nThe eight mentioned earlier are the Northern Emperor’s officials,\nand their selection follows the same rules.\n\nThere are also four *zhonglang* direct attendants,\nlike the *shangshu* of the mortal world.\nDai Yuan, Gongsun Du, Liu Feng, and Guo Jia hold these posts today.\nFeng was the adopted son of Xuande,\nwho now serves as the Northern He Marquis,\nopposing Han Sui.\nHe is now under the command of the Celestial Officials.\n\nThere are also two *dajinchen* officials,\nlike the *shangshu* of the mortal world—\ntoday, Han Guangwu and Sun Wentai hold these posts.\n\nThere are also *zhongjinchen* officials,\nlike the *zhongshu* of the mortal world,\nwith two overseers—\nYan Huai and Yang Biao hold these posts.\nHuai’s courtesy name was *Siji*,\nand Biao’s was *Wenxian*.\n\nThe father of Xu Changshi now serves as the Southern Danfang Marquis.\nThere are two Danfang Marqises,\neach overseeing the south and north.\nXu Changshi’s father is the Southern Danfang Marquis,\nLiu Zan serves as his *simaji*,\nBao Xun is the Northern Danfang Marquis,\nand Wei Zun is his *simaji*.\nThey also control the keys to the southern and northern gates.\nXu commands a thousand soldiers of the Southern威,\nand Bao Xun commands a thousand soldiers of the Northern威—\ntheir primary duty is to guard the gates,\nlike the *Yulin* overseers of the mortal world.\nThe soldiers of the Southern威 and Northern威\nfollow the Daoist example of the Heavenly Warriors and armored soldiers.\n\nSun Ce serves as the guest of the Shuming Lord,\nHan Gao as the guest of the Naning Lord,\nJin Xuan as the guest of the Ximing Lord,\nand Xun Hu as the guest of the Beiming Lord.\nAmong them, those with past virtues and hidden deeds of benevolence and rescue\nare sometimes directly appointed to celestial offices,\nor enter the Southern Palace to receive transformation,\nregardless of their former rank.\n\nThe rewards and punishments one receives in life\nare measured by one’s accumulated karma.\n\nGenerally, those who practice great benevolence and relieve the suffering of the destitute\nare swiftly admitted to the Southern Palace,\nbecoming the path of immortal transformation.\n\nYu Yuan Gui serves as the Northern Emperor’s *qianzhongwei* General,\ntaking Guo Changxiang as his *changshi* and Hua Shao as his *simaji*—\nthis is what is called a *jun gong*,\ncommanding thousands of ghostly soldiers.\n\nKong Rong serves as the *houzhongwei* General,\nwith Zhang Xu as his *simaji* and Tang Gu as his *changshi*.\n\nTao Can serves as the Xihe Marquis,\nalso commanding thousands of soldiers.\nHe recently sought Teng Han to replace him,\nbut the request was not yet granted.\nXu Ning serves as his *changshi*,\nbut due to his failure to capture the rebellious generals at the Northern Gate,\nhe was dismissed from office.\nCai Mo should replace Ning.\n\nThe Four Viceroys each command ten thousand ghostly soldiers,\nwhile central officials command only thousands.\nThe Four Viceroys consist of:\nthe Taishan Lord, the Lulong Lord, the Dongyue General, and the Nanba Marquis—\neach commanding ten thousand soldiers.\n\nHe Zong serves as the Nanba Marquis,\nCao Ren as the Lulong Lord,\nLiu Tao as the Dongyue General,\nand Xun Lei as the Taishan Lord.\n\nThere are hundreds of places where ten thousand soldiers are stationed,\nand hundreds where thousands are stationed—\nall under mutual command and subordination.",
      "overlap_context": "[杜预] as his Chief of Staff,\nWith a rank equivalent to that of a General’s Chief of Staff.\n\nHe Sidao [何次道], originally an internal inspector under the Northern Emperor,\nHas since returned to the Zhu Huo Palace to receive transformation,\nDue to his prior deeds of great benevolence.\n\nEmperor Wu of Wei [魏武帝] serves as the Northern Grand Tutor [北若太傅].\nThe rest are too numerous to recount.\n\nThis is the affair of ghosts and spirits,\nUnworthy of being revealed to the world—\nThe words of Master Xun [荀公].",
      "start_char": 1527,
      "end_char": 2789,
      "start_sentence": 69,
      "end_sentence": 113,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 18.404744386672974,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\道迹灵仙记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "皆有长史，司马颛取顾众为泰山将军，用曹洪为司马，桓范为长史。 王逸少有事击禁中已五年，云事已散。 蒋济为南山伯，领二千兵。 王庾为部鬼将军。 此有职位者粗相识知姓字耳，其无位者不可一二尽知之也，如此散者无限数也。 指记中国人，边方不可一二。 许肇今为东明公右帅晨，帅晨之任，如世间中书监。 邵奭为东明公，云行上补九宫右保公。 地下主者复有三等，鬼帅之号复有三等，并是世有功德积行所锺。 或身求长生，涉道所及，或子弟善行，庸播祖弥，或讽明洞玄，化流昆祖。 夫求之者非一，而获之者多途矣。 要由世积阴行，然后阶此广生耳。 鬼帅武解，主者文解，俱仙之始也，亦度名东华，简刊上帝，不隶酆官，不受制度三官之府矣。 其一等地下主者散在外舍，闲停无业，不受九宫教制，不闻练化之业，虽俱在洞天，而是主者之下者也。 比自按四明法，一百四十年依格得进耳，一进始得步仙阶，给仙人使令。 其二等地下主者，便径得行仙阶，给仙人，四十年进补管禁位，管禁之位如世间散吏者也。 此格即下主者之中条也，李东等今在一等中。 其三等地下主者，即主者之高者也，便得出入仙人之堂寝，游行神州之乡，出馆易迁、童初二府，入宴东华上台，受学化形，擢景易气，十二年气摄神魂，十五年神来藏魄，三十年棺中骨还，附神神气，四十年平复更生，还游人间，五十年位补仙官，六十年得游广寒，百年得入昆瀛之宫，此即主者之上者，仙人之纵容矣。 张姜子等先在第三等中，亦始得入易迁耳。 鬼帅之位次亦如此矣。 右七月二十四日夜保命君告。 灵人辛玄子自序拜诗第六 辛玄子字延期，陇西定谷人也。 汉明帝时谏议大夫，上洛、云中、赵国三郡太守辛隐之子也。 玄子少好学有道，尊奉法戒，至心苦行，日中菜食，炼形守精，不遘外物，州府辟聘一无降就，或游山林，弃世风尘，志愿逢子晋於维岑，旅浚阳以步玄，故改名为玄子，而自字为延期矣。 不图先世多愆，殃流子孙，结青刊於帝简，运况逮於后昆，享年不永，遂没命於长梁之津。 西王母见我苦行，酆都上帝愍我道心，告动司命，传檄三官，摄取形骸，还魂复真，使颐胎位为灵神，於今二百余年矣。 近得度名南宫，定策朱陵，藏精待时，方列为仙。 而太帝今且见差领东海侯，代庾生，又见选补禁中郎将，为吴越鬼神之司，主事靡滥，斯亦劳矣。 若夫冠晨佩青，萧条羽袂，呜铃仙阶，转軿琼室者，虽实素心，而卒未有日也。 恨未便得与玄真并罗，同宴昆阆之墉，察钧韶之遗音，攘琼芝乎幽峰，振翠衣於九霄，舞云翮於十方耳。 方当摄御群鬼，领理是非，处众秽之中，闻声交於邪魔之纷纭，事与道德为阔，眼再盻真为疏，熟比熙寂於玄境，逍遥於太初哉。 夫同声偕合，物亦类分，相闻邈矣，系景委积，是以名书上清，丹箓玄阶，有道之气，与灵合德，托体高晖，故来相从。 今赠诗三篇，以叙推情之至也。 其词曰： 畴昔入冥乡，顺驾应灵招。 神随室无散，炁与庆云消。 形非明玉质，玄匠安能雕。 蹑足昤幽唱，仰手玩呜条。 林室有逸欢，绝此轩外交。 遗景附圆曜，嘉音何寥寥。 寂通寄兴感，玄炁摄动音。 高轮虽参差，万仞故来寻。",
      "translated_text": "「All hold the title of *changshi* (長史). The *zhuanshi* (司馬) Zhen took Gu Zong as the Taishan General, appointed Cao Hong as the *zhuanshi* (司馬), and Huan Fan as the *changshi* (長史).\nWang Yishao’s affairs in the Imperial Palace have lasted five years; it is said that his affairs have now dispersed.\n\nJiang Ji became the Nan Mountain Marquis, commanding two thousand soldiers.\nWang Gu became the Departmental Ghost General.\n\nAmong those with official ranks, they roughly recognize one another by surname and given name,\nbut those without rank are countless—impossible to enumerate fully.\nEven among the scattered ranks, the number of mortals in China is far greater than those on the frontier.\n\nXu Zhao now serves as the Right Marshal of Dongming Gong, a post akin to the *zhongshu shi* (中书监) of the mortal world.\nShao Shi serves as Dongming Gong, having been appointed as the Right Protector of the Nine Palaces in the upper realm.\n\nThe rulers beneath the earth are divided into three grades,\nas are the titles of *guishuai* (鬼帅).\nAll are granted these positions due to accumulated virtue and deeds in their past lives.\n\nSome seek longevity through Daoist practice,\nothers through their descendants’ virtuous conduct, which spreads the blessings of their ancestors,\nor through reciting the profound and mysterious teachings,\nso that their influence flows into the Kun Ancestors.\n\nThe paths to attaining these ranks are many,\nyet the means of achieving them are varied.\n\nIt is essential to accumulate hidden merit in this world\nbefore ascending to these stages of broad life.\n\nThe *guishuai* (鬼帅) attain martial mastery,\nwhile the rulers attain literary mastery—\nboth mark the beginning of transcendence.\nThey are also called by the degree *Donghua* (东华),\nregistered in the *Shangdi* (上帝)’s ledgers,\nand are not subject to the *Tengguan* (酆官) or the Three Officials’ regulations.\n\nThe lowest-grade rulers beneath the earth are scattered in the outer dwellings,\nidle and without purpose,\nunbound by the Nine Palaces’ teachings or training,\nyet still within the *Dongtian* (洞天).\nThey are the lowest among the rulers.\n\nAccording to the Four Ming Laws,\none must follow the prescribed terms for 140 years before advancing—\none advancement grants the *buxian* (步仙) stage,\nallowing them to serve as messengers of the immortals.\nThe second-grade rulers beneath the earth\ndirectly attain the *xingxian* (行仙) stage,\nserving as immortals for 40 years before being promoted to oversee the *jian* (禁) positions—\nthe *jian* (禁) ranks are akin to mortal officials scattered in the world.\n\nThis is the middle rank among the rulers beneath the earth,\nwith Li Dong and others currently within it.\n\nThe third-grade rulers beneath the earth\nare the highest among the rulers,\nable to enter and exit the chambers of the immortals,\nroam the divine lands of the *Shenzhou* (神州),\nand transfer between the *Yizhan* (易迁) and *Tongchu* (童初) bureaus.\nThey may also attend the feasts on the *Donghua* (东华) Upper Platform,\nreceive instruction in refining their forms,\nand cultivate the *jingqi* (景气) of the *Ying* (易).\nAt twelve years, their *qi* (氣) controls their spirit and soul,\nat fifteen years, their spirit returns to their body, and their soul is preserved.\nAt thirty years, their bones within the coffin revive,\ntheir spirit and soul reunite,\nat forty years, they fully recover and are reborn,\nreturning to wander among mortals.\nAt fifty years, they are appointed as immortal officials,\nand at sixty years, they may roam the *Guanghan* (广寒) Palace.\nAt a hundred years, they enter the *Kunyun* (昆瀛) Palace—\nthis is the highest rank among the rulers beneath the earth,\nthe ultimate indulgence of the immortals.\n\nZhang Jiangzi and others initially belonged to the third rank,\nbut they have only now entered the *Yizhan* (易迁).\n\nThe hierarchy of *guishuai* (鬼帅) is similarly structured.\n\nOn the night of the twenty-fourth day of the seventh month,\nthe *Baomingjun* (保命君) informed me.\n\nThe immortal Xin Xuanzi composed and presented this poem as the sixth in his sequence.\n\nXuanzi, styled *Yanqi* (延期), was born in Dinggu of Longxi (陇西定谷).\nDuring the reign of Emperor Ming of the Han,\nhe served as a *Jianyi dafu* (谏议大夫).\nHe was the son of Sin Yin, the governor of Shangluo, Yunzhong, and Zhao (上洛、云中、赵国) counties.\n\nIn his youth, Xuanzi loved learning and followed the Dao.\nHe revered and upheld the precepts,\ndevoted himself to austere practice,\nate vegetables at noon,\nrefined his form and preserved his essence,\nand was unmoved by external affairs.\nThough officials from the state and capital court repeatedly invited him,\nhe never accepted their offers.\nSometimes he wandered in the mountains and forests,\nabandoning the world’s dust and turmoil,\nand aspired to meet Zi Jin among the Weicheng peaks,\ntraveling to Junyang to walk in the *Xuan* (玄) Way.\nThus, he changed his name to Xuanzi,\nand styled himself *Yanqi*.\n\nHe did not expect that his ancestors had committed many transgressions,\nbringing calamity upon their descendants.\nYet, through his sincerity and virtue,\nhe was recorded in the *Shangdi*’s (上帝) ledgers,\nand his fate reached the *Hou Kun* (后昆).\nThough his lifespan was not long,\nhe perished at the Changliang ferry.\n\nThe Western Queen Mother saw my bitter practice,\nand the *Tengdu Shangdi* (酆都上帝) pitied my Daoist resolve.\nShe moved the *Siling* (司命) to act,\nsent orders to the Three Officials,\nseized my body,\nand restored my soul to its true form.\nThus, I was granted the *Yitai* (颐胎) position as an immortal spirit,\nand it has now been over two hundred years.\n\nRecently, I was awarded the degree *Nangong* (南宫),\nfixed my strategy at *Zhuling* (朱陵),\nand preserved my essence, awaiting the time to ascend as an immortal.\n\nYet the *Tai Di* (太帝) now sees fit to assign me as the commander of Donghai Hou,\nreplacing Yu Sheng,\nand also to select me as a *Jianzhong langjiang* (禁中郎将),\noverseeing the affairs of Wu Yue’s ghostly deities.\nMy duties are endless and exhausting.\n\nAs for those who wear the *mao* (冠) of dawn and the *qing* (青) sash,\ntheir robes fluttering with elegance,\nascending the *xian* (仙) stages with resonant bells,\nand riding in jade carriages—\nthough they may possess true hearts,\nthey have yet to see the day of their attainment.\n\nI regret that I have not yet been permitted\nto join the *Xuanzhen* (玄真) in their ranks,\nfeast together in the *Kunlun* (昆阆) halls,\nlisten to the lingering melodies of the *Junjiao* (钧韶),\npluck the jade sprigs from the secluded peaks,\nwear the green robes of the Nine Heavens,\nand dance with clouded wings across the ten directions.\n\nNow I am tasked with commanding the multitude of ghosts,\nsettling disputes among them,\ndwelling amidst the profane,\nand hearing the cacophony of malevolent spirits.\nMy affairs are distant from the Dao and Virtue,\nand my gaze is ever more detached from the truth.\nYet I am familiar with the serene stillness of the *Xuanjing* (玄境),\nand the boundless freedom of the *Taichu* (太初).\n\nFor those who share the same resonance and gather together,\nthings also fall into similar categories.\nTheir distant voices echo faintly,\ntheir lingering *jingqi* (景气) and accumulated essence\nare why the *Shangqing* (上清) ledgers are named as such,\nand the *Danlu* (丹箓) *Xuanjie* (玄阶) are called by these terms.\nThe Daoist *qi* (氣) harmonizes with their spiritual virtue,\nand they entrust their bodies to the lofty and bright.\nThus, they come to follow me.\n\nToday, I present three poems\nto express the depth of my gratitude.\n\nThe verses read:\n\n*In days past, I entered the realm of darkness,*\n*Following the carriage in response to the spirit’s call.*\n*The spirit remains with the chamber unscattered,*\n*My essence merges with the auspicious clouds.*\n*Though my form is not the clarity of bright jade,*\n*The mysterious artisan cannot fail to carve me.*\n*Stepping forward, I hear the distant chant,*\n*Lifting my hands, I play with the resonant strings.*\n*In the forest chambers, there is leisurely joy,*\n*Yet I sever all ties beyond the pavilion’s gate.*\n*The lingering essence clings to the round brilliance,*\n*How rare and faint the praises now resound!*\n*The silent and boundless realm conveys my emotions,*\n*The mysterious essence seizes the harmonious sounds.*\n*The high wheels may vary in their paths,*\n*Yet the ten thousand fathoms bring them to seek me.*",
      "overlap_context": "ly soldiers,\nwhile central officials command only thousands.\nThe Four Viceroys consist of:\nthe Taishan Lord, the Lulong Lord, the Dongyue General, and the Nanba Marquis—\neach commanding ten thousand soldiers.\n\nHe Zong serves as the Nanba Marquis,\nCao Ren as the Lulong Lord,\nLiu Tao as the Dongyue General,\nand Xun Lei as the Taishan Lord.\n\nThere are hundreds of places where ten thousand soldiers are stationed,\nand hundreds where thousands are stationed—\nall under mutual command and subordination.",
      "start_char": 2789,
      "end_char": 4028,
      "start_sentence": 114,
      "end_sentence": 156,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 24.820476293563843,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\道迹灵仙记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "萧萧研道子，合神契灵衿。 委顺浪世化，心标窈窕林。 同期理外游，相与静东岑。 命驾广酆阿，逸边超冥乡。 空中自有物，有中亦无常。 悟言有无际，相与会濠梁。 目击玄解子，鬼神理自忘。 玄子云：魏时辛毗字佐治，是其七世之孙也，汉建武二年从陇西徙居颖川阳翟县。 毗仕魏世使持节大将军、司马宣王军帅卫尉侯。 毗子名敞，为河内太守、太常卿。 玄子云：庾生者是晋庾太尉也，北帝往用为抚东将军，后又转为东海侯，今又用为酆台侍帝晨，如今世侍中。 右禁监，如世右卫将军而甚重。 左禁监是谢幼舆，以酆岳为司马。 郄南昌公，先为北帝南朱阳大门灵关侯，后又转为高明司直，昔坐与刘庆孙争免官，今始当复职也。 高明司直，如世间尚书仆射。 何次道今在南宫承华台中，已得受书，行至南岳中。 此人在世时施惠之功甚多，故早得反形也。 周伯仁近见用为西明公中都护，中都护如世太傅之官也，坐选邓攸不平，左降为中护，中护准少傅。 右是辛玄子所言说，冥中事亦多矣，今粗书一隅耳，不复一二具记之也。 裴君说一年中得道人第七",
      "translated_text": "The rustling **Researcher of the Dao**, merging spirit with the soul’s embrace,\nSubmitting to the boundless transformation of the world, his heart marked by the secluded groves.\nTogether they wander beyond the realm of reason, in quietude ascending the eastern peaks.\nCommanding the carriage to the broad **Duān** heights, transcending mortal shores to the land of darkness.\nIn the void, there are forms—yet within them, no permanence.\nAwakening to the boundless speech of existence and nonexistence, they gather at the **Hutao Bridge**.\nWith eyes, they behold the **Mysterious Sage**—ghosts and spirits forget their own essence.\n\n**Mysterious Sage** remarks: *\"In the Wei dynasty, there was a man named Xīnpí, styled Zuòzhì, who was his seventh descendant. During the Han dynasty’s *Jiànwǔ* era (2nd year), he migrated from Lóngxī to settle in Yǐngchuān’s Yángzhài County. Xīnpí served in the Wei court as the General Who Bears the Imperial Edict, Grand Marshal, and Marshal of the Army, holding the title of Marquis of Wèiwèi. His son, named Chǎng, became Governor of Hénèi and Minister of the Imperial Sacrifices.*\n\n**Mysterious Sage** remarks: *\"The Regulus, this is Jin’s Regulus the Grand General. The Northern Emperor once appointed him as the Pacifying General of the East, later ennobling him as Marquis of Dōnghǎi. Now he serves as the Morning Attendant of the **Duān** Court, akin to a modern-day Grand Chamberlain. The Right Imperial Censor is the **Right General of the Imperial Guard**, a position of great weight. The Left Imperial Censor is Xiè Yòuyú, appointed as the Marshal of the **Duān** Mountains. The **Prince of Nánchāng**, once the Southern Zhūyáng Gatekeeper and Spirit Gate Marquis under the Northern Emperor, later became the **High Clarity’s Censor**, but was once demoted for a dispute with Liú Qìng’s grandson—now he is to resume his duties. The **High Clarity’s Censor** is akin to the **Chancellor of State** in the mortal world.\n\nHé Cìdào now resides in the Southern Palace’s **Xínghuá Terrace**, having already received the scriptures, now journeying toward the Southern Peak. This man, in life, performed many benevolent deeds, thus attaining early transcendence.\n\nZhōu Bó-rén has recently been appointed as the **Central Protector of Xīmíng**, a role akin to the **Grand Tutor** of the mortal world. Due to an unfair selection of Dèng Yòu, he was demoted to **Central Guardian**, equivalent to a **Minor Tutor**. The above are the words of **Mysterious Sage**—the affairs of the netherworld are many, and here I record but a fragment, omitting further details.\n\n**Master Péi** recounts that within a year, the seventh rank of transcendent beings was attained.\"*",
      "overlap_context": "g forward, I hear the distant chant,*\n*Lifting my hands, I play with the resonant strings.*\n*In the forest chambers, there is leisurely joy,*\n*Yet I sever all ties beyond the pavilion’s gate.*\n*The lingering essence clings to the round brilliance,*\n*How rare and faint the praises now resound!*\n*The silent and boundless realm conveys my emotions,*\n*The mysterious essence seizes the harmonious sounds.*\n*The high wheels may vary in their paths,*\n*Yet the ten thousand fathoms bring them to seek me.*",
      "start_char": 4028,
      "end_char": 4469,
      "start_sentence": 157,
      "end_sentence": 176,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 7.664013862609863,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\道迹灵仙记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "霍山中有学道者邓伯元、王玄甫，受服青精石饭，吞日丹景之法，精思洞房以来积三十四年，乃内见五藏，冥中夜书，以今年五月五日太帝遣羽车见迎。 伯元、玄甫以其日遂乘云驾龙，白日登天，今在北玄圃台，受书位为中真人。 华阳山中有学道者尹虔子、张石生、李方回，并晋武帝时人，受仙人管城子蒸丹饵木法，俱服得延年日健，中又受苏门周寿陵服丹霞之道，从来五十年精心内视，不复饮食，体骨轻便，色如童子，以今年二月十二日太一遣迎，以其日乘云升天，今在玄州受书为高仙人，石生为东源伯。 衡山有学道者张礼正、李明期二人，礼正以汉末在山中服黄精，颜色丁壮，常如年四十。 明期以魏末入山，服泽泻梧实丸，乃共同止岩中，后俱受西城君虹景神丹方，从来服此丹已四十三年。 中患丹沙之难，得俱出广州为游客，是滕含为刺史时也。 遂内外洞彻，眼明身轻，一日行五百里，又兼守一，亦已三十年。 以三月一日东华遣迎，以其日乘云升天，今在方诸飙室为上仙。 卢江潜山中有学道者郑景世、张重华，并以晋初受仙人孟德然口诀，以入山行守五藏含日法，兼服胡麻，又服玄丹，久久不复食饮，而身体轻强，反易故形，以今年四月十九日，北玄老太一迎以云軿，白日升天，今在玄州。 括苍山有学道者平仲节，河东人，以大胡乱中国时来渡江入括苍山，师宋君存心镜之道，具百神，行洞房事，如此积四十五年，中精思身形更少，体有真炁，今年五月一日中央黄老遣迎，即日乘云驾龙，白日升天，今在沧浪云台。 剡小白山中有学道者赵广信，阳城人，魏末渡江入此山，受李法成服炁法，又师左君守玄中之道，内见五藏彻视法，如此十八年，周旋郡国，或卖药出入，人莫知也，多来郡下市丹砂作九华丹，丹成一服。 太一道君以今年六月十七日遣迎，停三日，与山中同志别去，遂乘云驾龙，白日登天，今在东华海中。 狼伍山中有学道者虞翁生，会稽人，昔受仙人介君食日精法，以吴时来隐此山，兼行云气回形之道，精思积久，形体更少如童子，今年七月二十三日，东华太帝遣迎，即日乘云升天，今在汤谷山中。 赤水山中有学道者朱孺子，吴末入此山，服菊华及木饵，后遇西归子，从乞度世，西归子授以要言，入室存泥丸法，三十年遂能致云雨於洞房中，今年八月五日西王母遣迎，即日乘五色云车登天，今在积石室。 名山五岳中学道者数百万人，今年有得道而升天者人名如别，年年月月皆有去者，如此不可悉纪，今为疏一年之得道人耳。 有不乐上升而长在五岳名山者，亦不可胜数，或为仙官使封掌名山者，亦复有数千。 右九月二十日夜清灵疏出。 东卿道季主等第八 司马季主后入委羽山石室大有宫中，受石精金光藏景化形法於西灵子都。 西灵子都者，太玄仙女也。 其同时今在大有室中者，广育鲍叔阳、太原王养伯，颖川刘伟惠，代郡段季正，俱受师西灵子都之道也。 季主临去之际，托形枕席为戊己之像。 墓在蜀郡成都升盘山之南，诸葛武侯昔建碑铭季主墓前，碑赞曰： 玄漠大寂，混合阴阳。 天地交浮，万品滋彰。",
      "translated_text": "The **Hé Mountain** has practitioners of the Dao, **Dèng Bǔyuán** and **Wáng Xuānfǔ**, who ingested **qīngjīng stone** and followed the method of swallowing **sun-essence elixirs**. Through thirty-four years of concentrated meditation in the **Dòngfáng Chamber**, they attained inner vision of the **Five Viscera**. On the fifth day of the fifth month this year, the **Grand Sovereign** dispatched a **feathered chariot** to welcome them. On that very day, they ascended to the heavens on **clouds and dragons**, now residing at the **Northern Mystic Enclosure Terrace**, where they received scriptures and were granted the rank of **Middle True Person**.\n\nIn the **Huáyáng Mountains**, practitioners of the Dao—**Yín Qiánzǐ**, **Zhāng Shígēng**, and **Lǐ Fānghuí**—all from the **Jìn Wǔdì** era, ingested **elixirs** from **Guǎnchéngzi the Immortal** using **steamed wood methods**, extending their years and vitality. Later, they received **Sūmén Zhōu Shòulíng’s** teachings on **elixirs of the Red Clouds**, devoting fifty years to inner contemplation without food, their bodies light and youthful in appearance. On the twelfth day of the second month this year, **Tàiyī** dispatched a welcome, and on that day, they ascended on clouds to the heavens, now at **Mystic State** as **High Immortals**—**Shígēng** as **East Source Marquis**.\n\nIn **Héngshān**, **Zhāng Lǐzhèng** and **Lǐ Míngqī** practiced the Dao. **Lǐzhèng**, from the late **Hàn Dynasty**, consumed **huángjīng** in the mountains, maintaining vigor like a man of forty. **Míngqī**, from the late **Wèi Dynasty**, ingested **ze-xié wúshí pills**, then together retreated to a cave. Later, they received **Xīchéngjūn’s** **Rainbow Divine Elixir**, consuming it for forty-three years. Stricken by elixir difficulties, they fled to **Guǎngzhōu** as travelers during **Téng Hán’s** governorship. Their inner and outer vision became clear, their eyes sharp and bodies light—traveling five hundred *lǐ* in a day, also practicing **guarding the One** for thirty years. On the first day of the third month, **Dōnghuá** dispatched a welcome, and on that day, they ascended on clouds to the heavens, now residing in the **Fāngzhū Biāoshì Chamber** as **Supreme Immortals**.\n\nIn **Lu Jiāng’s** **Qiánshān**, **Zhèng Jǐngshì** and **Zhāng Zhònghuá** received **Mèng Dérán’s** oral teachings at the start of the **Jìn Dynasty**, practicing **Five Viscera Containment** and **Sun-Essence Cultivation**, along with **húmá** (hemp) and **mystic elixirs**, eventually abandoning food entirely. Their bodies grew light and strong, reversing their aging. On the nineteenth day of the fourth month this year, **Northern Mystic Tàiyī** welcomed them in a **cloud palanquin**, ascending in broad daylight to **Mystic State**.\n\nIn **Kuòcāngshān**, **Píng Zhòngjié**, a native of **Héngdōng**, fled to the mountains during the **Great Hu** chaos, studying **Sòng Jūn’s** **Mirror of the Heart** methods, mastering **hundred deities**, and practicing **Dòngfáng Chamber** techniques for forty-five years. His body grew refined, his **true qi** manifest. On the first day of the fifth month this year, **Central Yellow Old Tàiyī** dispatched a welcome, and on that day, he ascended on **clouds and dragons** to the heavens, now at the **Cānglàng Cloud Terrace**.\n\nIn **Jiǎn Shàobái Mountain**, **Zhào Guāngxìn**, from **Yángchéng**, entered the mountains at the end of the **Wèi Dynasty**, receiving **Lǐ Fǎchéng’s** **qi-cultivation methods** and **Zuǒjūn’s** **Mystic Middle Dao**. Through eighteen years of inner vision of the **Five Viscera**, he wandered between prefectures, sometimes selling elixirs. Many came to the market to buy **dānshā** (cinnabar) for **Jiǔhuá Elixirs**, each dose complete. On the seventeenth day of the sixth month this year, **Tàiyī Dàojūn** dispatched a welcome, and after three days’ farewell with mountain companions, he ascended on **clouds and dragons** in broad daylight, now in the **Eastern Mystic Sea**.\n\nIn **Lángwǔ Mountain**, **Yú Wēngshēng**, from **Kuàijī**, received **Jièjūn’s** **Sun-Essence Diet** in the **Wú era**, hiding in these mountains while practicing **cloud-qi transformation**. Through long meditation, his form shrank like a child’s. On the twenty-third day of the seventh month this year, **Eastern Mystic Tàidì** dispatched a welcome, and on that day, he ascended on clouds to the heavens, now in **Tānggǔ Mountain**.\n\nIn **Chìshuǐ Mountain**, **Zhū Rùzǐ**, from the late **Wú era**, consumed **chrysanthemum blossoms** and **wood-based elixirs**, later encountering **Xīguīzǐ**, who granted him **transcendence**. **Xīguīzǐ** taught him **Essential Speech** and **Níwán Chamber** methods. After thirty years, he could summon **clouds and rain** in his chamber. On the fifth day of the eighth month this year, **Xī Wángmǔ** dispatched a welcome, and on that day, he ascended in a **five-colored cloud chariot** to the heavens, now in the **Jīshí Chamber**.\n\nAmong the **named mountains and Five Peaks**, hundreds of thousands practice the Dao, with many ascending yearly—names recorded separately. Each month, some depart; their numbers cannot be fully chronicled. Here, I merely record those who attained transcendence this year. Some, unwilling to ascend, remain indefinitely in the **Five Peaks and named mountains**, numbering countless thousands. Others serve as **immortal officials**, sealing and governing these mountains—also in the thousands.\n\nThis record was completed on the night of the twentieth day of the ninth month by **Qīnglíng Cù**.\n\n**Dào Jì** of **Dōngqīng**, ranked eighth, later entered the **Wěiyǔ Mountain’s Stone Chamber**, the **Dàyǒu Palace**, where he received **stone-essence, golden-light, hidden-transformation methods** from **Xīlíngzǐ Dōu**. **Xīlíngzǐ Dōu** is a **Tàixuān Immortal Maiden**.\n\nThose who studied with him at the same time and now reside in the **Dàyǒu Chamber** include:\n- **Guǎngyù Bào Shùyáng** of **Guǎngyù**,\n- **Tàiyuān Wáng Yǎngbó** of **Tàiyuān**,\n- **Yǐngchuān Liú Wěihuì** of **Yǐngchuān**,\n- **Dài Jùn Duàn Jìzhèng** of **Dài Jùn**,\nall having received teachings from **Xīlíngzǐ Dōu**.\n\nAs **Jìzhǔ** prepared to depart, his form took the likeness of a **wù-jǐ** figure upon his pillow.\n\nHis tomb lies south of **Shēngpán Mountain** in **Chéngdū**, **Shǔ Jùn**. **Zhūgě Wǔhòu** once erected a stele with this inscription before his grave:\n\n*\"Mystic void, great stillness—\nYin and yang in harmony.\nHeaven and earth in union—\nTen thousand things flourish.\"*",
      "overlap_context": ".\n\nZhōu Bó-rén has recently been appointed as the **Central Protector of Xīmíng**, a role akin to the **Grand Tutor** of the mortal world. Due to an unfair selection of Dèng Yòu, he was demoted to **Central Guardian**, equivalent to a **Minor Tutor**. The above are the words of **Mysterious Sage**—the affairs of the netherworld are many, and here I record but a fragment, omitting further details.\n\n**Master Péi** recounts that within a year, the seventh rank of transcendent beings was attained.\"*",
      "start_char": 4469,
      "end_char": 5676,
      "start_sentence": 177,
      "end_sentence": 201,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 20.60748553276062,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\道迹灵仙记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "先生理着，分别柔刚。 鬼神以观，六度显明。 广育鲍叔阳者，汉高帝时赵王张耳、张敖之大夫也，少好养生服桂屑，而卒於语笑间，今墓在辽蓟城之北山。 太原王养伯者，汉高吕后摄政时中常侍，中郎王采者，少服泽泻，与留侯张良俱采药於终南山，而养伯不返，师事季主。 颖川刘伟惠，汉景帝时公车司马刘讽者也，后事季主，晚服日月气，为入室弟子，道成。 晚归乡里，托形杖履，身死桑树之下，今墓在汝南安城县西山。 代郡段季正，本隐士者也，不见有所服御，晚乃从季主学道，行度秦川，俱得尸解，而遂葬於川边，今南郑秦川是也，此人亦季主入室弟子。 季主一男一女俱得道，男名法育，女名济华，今皆在委羽山中。 济华今日正读《三十九章》，犹未过竟。 季主读玉经，服明丹之华，挹扶晨之晖，今颜色如二十女子，须长三尺，黑如墨也。 昨日东卿君道，如此所疏，真奇事也，不知此云何耳。 季主托形隐景，潜迹委羽，《紫阳传》具载其事。 昨夜东卿至，聊试请问季主本末，东卿见答，今疏如别，为以上呈，愿不怪之，省讫付火。 是后圣李君纪也，大都与前者略同，然东卿复兼有注解近万余言，大奇作也。 昨来多论神化之事，聊及季主耳。 去月又见授《神虎经解注》，非世所闻，亦自不赏其旨也，若更闻如季主之比者，自当密白。 道迹灵仙记竟",
      "translated_text": "The Master’s teachings distinguished between yielding and firmness.\nGhosts and spirits observed, and the Six Perfections shone clearly.\n\n**Guǎngyù Bào Shùyáng** was a high official of **Zhào Wáng** Zhāng Ěr and Zhāng Áo during the reign of **Hàn Gāodì**. In his youth, he took delight in cultivating life and consuming cassia bark, yet he died suddenly in laughter. His tomb now lies north of the mountains in **Liáo Jì City**.\n\n**Tàiyuān Wáng Yǎngbó** served as a **Zhōngchángshì** during **Lǚ Hòu**’s regency in the **Hàn**. His younger brother, **Wáng Cǎi**, in his youth consumed *Zéxiè* (Alisma), and together with **Liúhóu** Zhāng Liáng, they gathered herbs in **Zhōngnán Shān**. Yet **Yǎngbó** did not return, and he became a disciple of **Jìzhǔ**. He later studied the **Rìyuè qì** (Solar-Lunar qi) and became an inner-chamber disciple, attaining the Dao. Upon his return to his homeland, he took the form of a staff and sandals, and his body perished beneath a mulberry tree. His tomb is now on the western mountains of **Rǔnán Ānchéng County**.\n\n**Yǐngchuān Liú Wěihuì** was once **Gōngchē Shìmǎ** **Liú Fèng** during the reign of **Hàn Jǐngdì**. Later, he became a disciple of **Jìzhǔ**, and in his later years, he cultivated the **Rìyuè qì**, becoming an inner-chamber disciple who attained the Dao.\n\n**Dài Jùn Duàn Jìzhèng** was originally a recluse, taking no medicines or elixirs. Only in his later years did he study with **Jìzhǔ**, and together they traversed **Qínchuān**, both achieving *shījiě* (embodied transcendence). They were buried by the riverbank, and today, this place is **Nánzhèng Qínchuān**.\n\n**Jìzhǔ** had one son and one daughter, both of whom attained the Dao. His son was named **Fǎyù**, and his daughter, **Jìhuá**. They now reside in **Wěiyǔ Shān**.\n\n**Jìhuá** today is still reciting the *Sānlìshíjiǔzhāng* (Thirty-Nine Chapters), yet she has not yet finished.\n\n**Jìzhǔ** studied the *Yùjīng* (Jade Scripture), consumed the essence of the **Míngdān** (Luminous Elixir), and drew upon the radiance of dawn. Even now, his complexion is as youthful as a twenty-year-old maiden’s, his beard three *chǐ* long, and as black as ink.\n\nYesterday, **Dōngqīng Jūn** spoke of the Dao, recounting such matters as these—truly wondrous deeds! Yet I do not know their full meaning.\n\n**Jìzhǔ**, taking the form of hidden light, concealed his traces in **Wěiyǔ**, as fully recorded in the *Zǐyáng Zhuàn*. Last night, **Dōngqīng** arrived and casually inquired about **Jìzhǔ**’s origins. **Dōngqīng** answered, and I have recorded his words here. I present them above, hoping you will not find fault. After reading, please consign them to the flames.\n\nThis was later memorialized by **Shèng Lǐ Jūn**, largely consistent with the foregoing. Yet **Dōngqīng** further added annotations numbering over ten thousand words—a truly extraordinary work.\n\nRecently, we spoke much of divine transformations, and I mentioned **Jìzhǔ** in passing.\n\nLast month, I was also granted the *Shénhǔ Jīng Jiězhù* (Commentary on the Tiger Spirit Scripture), a text unknown to the world, whose meaning I myself do not fully grasp. If I hear of matters like those of **Jìzhǔ**, I shall surely report them in secret.\n\nThe *Língxiān Jì* (Record of Numinous Traces) is now complete.",
      "overlap_context": "huān Liú Wěihuì** of **Yǐngchuān**,\n- **Dài Jùn Duàn Jìzhèng** of **Dài Jùn**,\nall having received teachings from **Xīlíngzǐ Dōu**.\n\nAs **Jìzhǔ** prepared to depart, his form took the likeness of a **wù-jǐ** figure upon his pillow.\n\nHis tomb lies south of **Shēngpán Mountain** in **Chéngdū**, **Shǔ Jùn**. **Zhūgě Wǔhòu** once erected a stele with this inscription before his grave:\n\n*\"Mystic void, great stillness—\nYin and yang in harmony.\nHeaven and earth in union—\nTen thousand things flourish.\"*",
      "start_char": 5676,
      "end_char": 6213,
      "start_sentence": 202,
      "end_sentence": 218,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 10.254794359207153,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\道迹灵仙记.txt",
        "category": "记传类"
      }
    }
  ]
}