{
  "source_id": "醮三洞真文五法正一盟威箓立成仪",
  "source_file": "chunked_daozang\\醮三洞真文五法正一盟威箓立成仪.json",
  "total_chunks": 11,
  "total_original_chars": 7851,
  "total_translated_chars": 54965,
  "total_translation_time": 196.21661138534546,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\醮三洞真文五法正一盟威箓立成仪.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**Ritual of the Three Caverns True Scriptures: Five Methods of the Rectified One Alliance-Oath Talisman’s Established Rites**\n*(Title as in the Daozang: Ritual of the Three Caverns True Scriptures: Five Methods of the Rectified One Alliance-Oath Talisman’s Established Rites)*\n*Original Attribution: Compiled by Zhang Wanfu, a Disciple of the Three Caverns*\n*One Scroll*\n*Source: Canon of the Orthodox Daozang, First Section*\n\n---\n\n**Ritual of the Three Caverns True Scriptures: Five Methods of the Rectified One Alliance-Oath Talisman’s Established Rites**\n*Composed by Zhang Wanfu, a Disciple of the Three Caverns*\n\nAll who perform the *jiào* ritual do so to offer sincerity to Heaven and Earth, and to pray for blessings from the numinous spirits. If one is not wholly devoted, one cannot hope to move them. If one’s sincerity is not absolute, yet still expects a response—such a thing has never been heard. Those who cultivate must exhaust their sincerity.\n\nAs for the ritual setup, a named mountain or cavern is ideal. If not, then a secluded, quiet place will suffice for arranging the implements and seats. The offerings must be fresh and abundant. In mountain caverns where mats are unavailable, use grass or leaves instead. The ritual cloths must be scrupulously clean, both inside and out, free from contamination by dogs, rats, or livestock. Avoid unclean meats and greasy foods, and refrain from ascending or touching the altar, or from shouting or scolding—whether to elders or juniors.\n\nThe offerings must be prepared as in the *zhāi* fast, though common folk, unaware of subtleties, may dismiss even wine and preserved meats as insufficient. Indeed, the Dao’s methods are pure and refined; they especially abhor filth and impurity. The stars, constellations, and sacred peaks are all domains of the true immortals. To ignore their origins and blindly follow false teachings—such errors are grievous indeed! To know the labors of the sage and yet mock them with vulgar laughter—how lamentable!\n\n---\n**First: Establishing the Altar and Seats**\nThe Dao’s spirits are formless; only the utmost sincerity can move them. The numinous souls are without manifestation, yet they must be invoked with proper rites. Those who practice must erect the altar and arrange the seats to invite blessings.\n\nThe altar shall follow the *Lingbao* method of summoning the true, opening the five gates—East, West, South, North, and the Celestial Sovereign—each spanning twenty-four feet, with railings as prescribed. Why? The Three Caverns’ teachings place *Dongxuan* at the center, and thus its rites are used to harmonize above and below.\n\nOnce the altar is erected, place the *Shangqing* seat in the center, slightly forward-facing south, draped with a green-and-purple patterned cloth. Open the talisman and place it upon the seat, with three trays before it: one divided into nine parts, one into six, and three lamp stands—one tray divided into one part—totaling sixteen divisions and sixteen cups, with three incense burners.\n\nNext, to the north and near the west, place the *Liujia* (Six Celestial Stems) seats, facing south, draped with a crimson cloth. Open the talisman and arrange the seat, with six trays before it: each divided into one part, one incense burner, six cups, and one lamp.\n\nNext, at the eastern end, place the *Sanhuang* (Three Sovereigns) seats, facing south, draped with a green cloth. Open the talisman and arrange the seats—*East Heaven Sovereign, Earth Sovereign, and Human Sovereign*—with three trays before them: each divided into one part, three incense burners, three cups, and three lamps.\n\nNext, to the east and facing north, place the *Five Sacred Peaks True Forms Diagram*, facing west, draped with a crimson cloth. Arrange the talisman-diagram upon the seat, with three trays before it:\n- The nearest tray to the north, divided into five parts, for the *Five Peak Lords*;\n- The next tray to the south, divided into two parts, for the *Assisting Command Lords*;\n- The *Qingcheng-Lushan Envoys* seat, with three trays divided into nine parts.\nTotal: nine cups, four lamps, and four incense burners.\n\nNext, to the south, place the *Five Talisman Seats*, facing west, draped with a cloth. Arrange the talismans upon the seats, with three trays before them, each divided into one part. Place a separate mat with a black cloth slightly forward, or on another seat:\n- *Renwu Mountain Seat*: one tray, one cup, one incense burner, one lamp.\n- The next two trays: the *True Scripture Five Talismans Eight Scenes Inner Sounds Seats*, each divided into five parts, totaling ten parts, ten cups, one incense burner, and one lamp.\n\nNext, to the south, place the *Alliance-Oath Seat*, facing east, draped with a crimson cloth. Arrange the talisman upon the seat, with three trays before it:\n- Each tray divided into eight parts, totaling twenty-four parts, with twenty-four cups (or twelve, or eight, or three, as the method dictates), one incense burner, and one lamp.\n\nNext, to the north, place the *East and West Two Prohibition Seats*, facing east, draped with a green cloth. Arrange the talismans upon the seats, with three trays before them:\n- The nearest tray to the north, divided into one part, for the *West Peak Lord*;\n- The next tray to the south, divided into one part, for the *Central Yellow Taiyi*;\n- The next tray to the west, divided into four parts, for the *Four Spirit Lords*.\nTotal: three trays, sixteen parts (or six trays, three parts), two incense burners, and two lamps.\n\nIf the *Seven Stars* are being invoked, place their seats within the altar, behind the *Shangqing* and before the *Liujia*, facing south, draped with a purple cloth, with seven trays: each divided into one part, seven cups, one incense burner, and one lamp. Even if not invoked, this seat must still be arranged.\n\nThe *Hetu* (River Diagram) may also be placed behind the *Shangqing* and before the *Sanhuang*, draped with a green cloth, facing south, with one tray divided into nine parts, one incense burner, nine cups, and one lamp.\n\nAfter the ritual, place the *zhènxìn* (ritual purity offerings: salt, pickled vegetables, rice, etc.) before the *Shangqing* seat, slightly to the east on a small mat.\n\nIf a teacher is present, the arrangement must be as described. The incense, lamps, and *zhènxìn* offerings must all conform to the rites. If possible, each seat should have its own table, draped with a clean cloth, and the talismans placed upon them—this is even better. Each altar must be surrounded by a crimson rope barrier on all four sides. If rope is unavailable, use ash or wheat bran instead. To help the numinous souls focus, a clean curtain may be hung around the altar to prevent the incense smoke and lamps from scattering.\n\n**Purification of the Altar and Cleansing of Impurities (Second Section)**\n\nThe purpose of purifying the altar is to dispel the lingering *qi* of defilement, to perfume and honor the numinous souls, so that the inner and outer spaces may be cleansed and harmonized, and both humanity and the divine may be moved.\n\nFor all rituals that begin, this method must be followed—it is not limited to this alone.\n\nPreviously, the *Xiangwang* scripture (the \"King of Incense\" text) was inscribed on paper to dispel impurities. The water was prepared with peach bark, bamboo leaves, *chénxiāng* (aloewood), *jīshé* (chicken tongue herb, *Houttuynia cordata*), and *xiāngbǎi* (sweet osmanthus) leaves, finely chopped and boiled in a silk pouch filled with water, then sprinkled over the altar and all ritual objects, and used for bathing as well.\n\nAlternatively, pure spring water or fresh water may also be employed.\n\nFollowing the previous chapter’s arrangement, after the water has been spread, the practitioner dons the prescribed ritual attire and sprinkles *jiànshuǐ* (sword-water) upon the earthen doorway. The sword is applied first, then the water, with each three steps apart. Upon beginning the invocation, the steps are taken in the manner of the *Three Powers* (Heaven, Earth, and Humanity).\n\nAfter completing the steps, the practitioner clenches their fists, closes their eyes, and mentally invokes the presence of the *Scriptures, Registers, and Degrees of the Master* to the west, the *Tang General* (唐将军) and his mounted troops, bearing sword and seal, to the left, the *Ge General* (葛将军) and his troops, wielding halberds and bearing swords, to the right, and the *Zhou General* (周将军) and his troops, holding scepters, to the front. The *Zhenren* (True Person) descends in crimson robes, riding the *Nine Phoenix*, stepping through the *Dǒu* (ritual step formation) to receive the impurities.\n\nThe *Seven Stars* (七星) cover the practitioner’s body, with the head raised and the fingers pointing forward, not shielding the eyes.\n\nWhen complete, the practitioner opens their eyes and recites the **Incantation of the Four Spirits** (四灵咒):\n\n**Incantation of the Four Spirits:**\n\n*\"Chant to be inserted here.\"*\n\nThe **Eastern Azure Dragon** (East方青龙), whose essence is the brilliance of the Horn and Tail constellations (角亢之精), likewise follows the usual method.\n\nWhen complete, the practitioner presses their hands to their heart, standing in the **Dingzi posture** (丁字立), and recites the incantation as follows:\n\n*\"I summon the hundred spirits—now that they have assembled,\nI shall traverse the clouds—then proceed with the **Three Talents Steps** (三才步).\nNext, I command the waters of the Yangtze, Yellow, Huai, and Hai rivers,\nwhich are not ordinary waters—\nI spit water once (乃噀水一下),\nand chant to absorb it three times (唱摄三下).\nThen, having invoked the names, I solemnly request the **Eastern Azure Dragon** (东方青龙),\nto descend with **true qi** (真气) into my body—\nas it is.\n\nNext, I perform the **Three Talents Steps, Nine Phases, or the Completed Hexagram** (九迹或既济卦).\nThen I request the **Five Pure Boy Lords** (五童君), and the rest follows the usual method.\n\nNext, I perform the **Seven Stars Firm Steps** (七星刚步), and place the water bowl (水椀) to completion.\n\nUpon entering the gate, the **Third Invocation** (入户祝) is chanted:\n*\"Four Heavenly Functionaries* (四上功曹),\n*Dragon-Tiger Envoys* (龙虎使者),\n*True One of the Three Talents* (正一生炁),\n*Attendant of the Pure and Silent Maiden* (侍静素女),\nthose who appear at night—\nI beseech the **Bright Clarity Pure Boy** (开明童子)\nand the **Supreme Mystic Maiden** (上玄少女)\nto enter with me into the **Yellow Palace’s embrace** (黄宫之裹),\nto traverse and fulfill all that is summoned,\nand to make it heard above.\n\nWhen done, I enter and circle the altar once,\nthen face west-north and stand where the **initiated** (事人) are positioned.\nThe remaining **palace attendants** (宫男) take their places facing east,\nfirst offering incense to all the seats,\nthen offering the **Invocation of Announcement** (启告香) incense.\nNext, I chant—\neach bows to the Master and meditates as prescribed.\nThen I meditate on the **Three Masters** (三师) as usual.\n\nThe **Fourth Invocation** (发炉第四) is chanted:\n*\"Rumble the sacred drum thirty-six times* (吒法鼓三十六通).\nTo the **Supreme Three Heavens, Primordial Beginning, Three Talents, and the Venerable Lord Lao** (无上三天玄元始三炁太上老君),\nI summon from my body the **Thirty-six Heavenly Functionaries** (三五功曹),\nthe **Left and Right Official Envoys** (左右官使者),\nthose who bear incense on the **Left and Right** (左右捧香),\nthe **Stationary Dragon and Mounted Messenger** (驿龙骑吏),\nthe **Golden Boy Attendant of Incense** (侍香金童),\nthe **Jade Maiden Scattering Flowers** (散花玉女),\nthe **Five Emperors’ Direct Talismans** (五帝直符),\nand the **Directing Day Incense Officials** (直日香官),\nall thirty-six in number, to depart from the gate (出关),\nand I summon the **State and County Earthly Deities, Local Domain Officials, and True Gods** (启州县土地里域真官正神).\nI now properly burn incense and establish the **rites of purification** (设醮),\nwishing the **Ten Directions’ True Gods of the Three Talents** (十方正真生炁) to descend and flow into my body,\nso that all that is summoned may swiftly reach and directly ascend to the **Jade Emperor of the Three Pure Ones** (三清玉帝) at the **True Virtue’s few** (至真几) before me.\nNext, I present the **Supplication of Appeal** (上奏按香),\nand all the officials bow twice (再拜).*\n\nThen the **Fifth Invocation** (出灵官第五) is chanted.\n\nLong kneeling, striking the teeth twenty-four times.\n\nI now properly summon from within my body:\n- The **Five-Bodied True Officials** (五体真官),\n- **Supreme Celestial and Supreme Spirit** (上仙上灵),\n- **Directing Functionaries** (直使功曹) and **Rectified Unity Functionaries** (正一功曹),\n- Left and Right Official Messengers (左右官使者),\n- **Yin-Yang Divine Decision Clerks** (阴阳神决吏),\n- **Science-Carriage Red-Symbol Clerks** (科车赤符吏),\n- **Firm-Wind Cavalry Stationed at Relay Posts** (刚风骑置驿马),\n- **Petitioning Officials** (上章吏官), each two in number;\n\n- From within my body:\n  - **Void-Nothingness Natural Left and Right Attendants** (虚无自然左右侍郎),\n  - **Chaos-Jade Emperor, Supreme True One** (混沌玉帝太真),\n  - Left and Right **Leading Celestial Jade Lads** (左右领仙玉郎),\n  - **Nine Mysterious Supreme Void Functionaries** (九玄上虚功曹),\n  - **Three Primordial Functionaries** (三元功曹), each twenty-four in number;\n\n- **Upper Clarity Jade Void Messengers** (上清玉虚使者),\n- **Divine Immortal Messengers** (神仙使者),\n- **Great Mountain Messengers** (太山使者),\n- **Golden Dawn Jade Lads** (金晨玉童),\n- **Great Hua Jade Maidens** (太华玉女),\n- Left and Right **Spiritual Flyers** (左右灵飞),\n- **Jade Void Attendants** (玉虚侍郎), each twenty-four in number;\n\n- The **Five Emperors** (五帝),\n- **Primordial Sovereign** (元皇),\n- **Supreme True One** (太真), each nine thousand in number;\n\n- **Heaven-Patrolling Auxiliary Immortal Cavalry** (检天辅仙骑),\n- **Auxiliary True Cavalry** (辅真骑),\n- **Auxiliary Spirit Cavalry** (辅神骑),\n- **Auxiliary Imperial Cavalry** (辅帝骑),\n- **Auxiliary Spirit Cavalry** (辅灵骑), each nine hundred million in number;\n\n- **Five Emperors’ Flying Wheel Sky-Striding Cavalry** (五帝飞轮策空骑),\n- **Five Emperors’ Flying Immortal Sky-Soaring Cavalry** (五帝飞仙腾空骑), each nine hundred million in number;\n\n- **Nine-Heaven Flying Jade Feathered Canopy Cavalry** (九天飞琼羽盖骑),\n- **Flying Axle Green Paired Cavalry** (飞辕绿骈骑),\n- **Earth-Conquering Dragon-Soaring Cavalry** (制地龙腾骑), each nine hundred million in number;\n\n- **Natural Spirit-Summoning Longevity-Generating Bamboo Immortal Clerks** (自然招真生芝玉仙吏),\n- **Spirit-Summoning Longevity-Generating Bamboo Immortal Clerks** (招神生芝玉仙吏),\n- **Divine Pill Longevity-Generating Bamboo Immortal Clerks** (神丹生芝玉仙吏), each nine hundred million in number;\n\n- **Golden True Radiant-Thunder Cavalry** (金真辉电骑),\n- **Yang Essence Cloud-Stirring Rain-Descending Cavalry** (阳精兴云降雨骑),\n- **Yin Essence Cloud-Stirring Rain-Descending Cavalry** (阴精兴云降雨骑),\n- **Yang Clarity Illuminating Radiance Thunder-Chasing Cavalry** (阳明照曜逐电骑),\n- **Cloud Gate Scepter-Wielding Golden Radiance Cavalry** (云门执节金光骑), each nine hundred million in number;\n\n- From within my body:\n  - **Numinous Treasure Cavernous Mysterious Three Departments Eight Scenes Celestial Inner-Sound Divine Immortals** (灵宝洞玄三部八景诸天内音神仙),\n  - **Embroidered-Robe Jade Maidens** (绣衣玉女),\n  - **Five Emperors’ Direct Talismans** (五帝直符),\n  - **Messengers of Transmission and Petition** (传言奏事),\n  - **Sun, Moon, and Star Hosts** (日月星宿),\n  - **Five Emperors’ Official Retinue** (五帝官属),\n  - **Divine Dragon Cavalry** (神龙骑),\n  - **Flying Dragon Cavalry** (飞龙骑),\n  - **Relay Dragon Cavalry** (驿龙骑),\n  - **Cloud Dragon Cavalry** (云龙骑), all properly arrayed in ceremonial attire and insignia, their majesty aligned, standing before me.\n\nThey proclaim and command the **Eight Directions, Celestial, Earthly, and Water Officials, Five Sacred Mountains and Four Great Rivers, Nine Rivers and Eight Poles, Famous Mountains and Marshes, Five Emperors’ True Officials, Four Departments of Inspection, Nine Divisions of Examination, Primordial Four Beginnings, and the Officers of the Sixty-Four Hexagrams**, as well as the **Boundless and Infinite, High and Low, Profound and Bright, Deep and Shallow, Innumerable True Officials**, who govern the **Qi of the Primordial Sovereign, Nine Palaces and Eight Diagrams, Six Hexagrams Direct Talismans, Void-Nothingness Direct Matters, Five Sacred Mountains’ Flying Immortals, and Divine Dragon Feathered Cavalry**, all to open the gate.\n\nThey report to me that in the year **blank**, month **blank**, day **blank**, I presented myself before **Master So-and-So of the Upper Clarity Great Cavern** (上清大洞法师某君), where I received the **Complete Dao of Immortal Spirits, Upper Clarity Immortal Registers, Numinous Treasure True Scriptures, Eight Scenes Five Methods, Six Hexagrams Secret Talismans, Western Sacred Mountain, Five Sacred Mountains True Immortal Registers, Three Sovereigns Five Emperors Divine Talismans, Nine-Heaven Phoenix Qi Rectified Dao Registers, Golden God Tiger Talisman, and the Seven Primordial Spirits’ Liberation**, returning in the vehicle of the Dao, donning the form of the body, preserving and nurturing the offerings, and on the auspicious day at the **Spirit Platform of the Certain Hall**, I set up a modest **rites of purification**, presenting my sincerity and offerings, to contract with the **True Spirits of the Three Realms’ Officials**, who with my body’s **Five-Bodied Thirty-Six Thousand Divine Clerks** divide form and merge shadows, guarding the platform, eliminating demonic influences, and ensuring solemnity without disorder, so that my petition may be heard and granted.\n\n**Sixth Invocation of Official Summoning** (请官启事第六):\nFrom this point onward, all readings must be spoken in a level, low voice. At every double kneeling, pause for a long time, and do not speak loudly.\n\nA disciple of the **Upper Clarity Mysterious Capital Great Cavern Three Scenes** (上清玄都大洞三景弟子), **Mr. So-and-So of Certain Sacred Mountain** (某岳先生), **Small Fate True Person of Certain Emperor** (某帝小兆真人), kneels twice and requests the officials.\n\nI now properly summon:\n- The **Twenty-Four High True Ones of the Supreme Sovereign** (上皇二十四高真),\n- **Jade Clarity Purple Void Supreme Primordial Dao Sovereign** (玉清紫虚高上元皇道君), along with all divine immortals, jade lads, and jade maidens, to unite in riding the clouds and mastering the qi, responding to the scene and descending their light upon the purification rites.\n\nDouble kneeling.\n\nI now properly summon:\n- The **Three-Heaven Rectified Dao Three Primordial Great Sovereigns** (三天正法三元大君),\n- **Luminous Micro Heavenly Capital Primordial Sovereign True Sovereign** (太微灵都元皇真君),\n- **Divine Immortal Elders** (神仙丈人),\n- Jade lads and maidens,\n- **Sixty-Three Departments of Spirit Official True Persons** (六十三部灵官真人), to unite in responding to the scene, mastering the qi, and riding the clouds, soaring through the sky and descending their light upon the purification rites.\n\nDouble kneeling.\n\nI now properly summon:\n- **Supreme Clarity High Immortals** (太清高仙),\n- **Scene-Cloud True Persons** (景云真人),\n- **Supreme Elders** (太上丈人),\n- **Supreme Sovereign Lords** (上皇君),\n- **Nine-Hua Supreme Emperors** (九华太帝),\n- **Mysterious Yellow Jade Maidens** (玄黄玉女), to unite in dispersing their essence and scattering their qi, responding to sensations and adapting to circumstances, driving the scene and communicating with spirits, riding the light and descending to the rites.\n\nDouble kneeling.\n\nI now properly summon:\n- The **Left and Right Spirit Flyers of the Jade Palace** (琼宫左右灵飞),\n- **True Lads and Divine Immortal Maidens**, to descend their light upon the rites.\n\nDouble kneeling.\n\nI now properly summon:\n- **River Diagram Grand Marshal** (河图太尉),\n- **Nine Dawn Lords of the Jade Emperor’s Palace** (玉帝府九晨君),\n- **True Sovereign Consorts** (真皇夫人),\n- **Divine Messengers** (诸灵官使者),\n- Jade lads and maidens, to unite in mastering the scene and dividing their radiance, descending their light upon the rites.\n\nDouble kneeling.\n\nI now properly summon:\n- The **Twenty-Four High True Persons of the Great Peace Teaching** (太平下教二十四高真人), to unite in dwelling upon their spirits and responding to sensations, spreading great compassion and mercy, pondering those with intent, and descending their radiance in orderly succession upon the rites.\n\nDouble kneeling.\n\nI now properly summon:\n- The **Seven Stars of the Northern Dipper True Sovereigns** (北斗七星真君),\n- **Auxiliary and Rectifying True Rulers** (辅弼真宰),\n- **Immortal Spirit Cavalry Escorts**, to unite in mastering the scene and dividing their radiance, descending their light upon the rites.\n\nDouble kneeling.\n\nI now properly summon:\n- The **Six Hexagrams’ Leading Sixty-Day True Gods** (六甲所领六旬真神),\n- **Six Ding Jade Maidens** (六丁玉女),\n- **Talisman Clerks and Directing Officials** (符吏从官),\n- **Direct Day Direct Talismans** (直日直符),\n- **Twelve Guards**, all to descend and attend the purification rites.\n\nDouble kneeling.\n\nI now properly summon:\n- **Lord of the Western Sacred Mountain** (西岳君), along with:\n  - **Flying Heavenly Elders** (飞天丈人),\n  - **Supreme One of the Central Yellow** (太一中黄),\n  - **Mysterious Supreme Jade Lads** (玄上玉童),\n  - **Tiger King Li** (虎王李君),\n  - **Fierce Beast Masters** (猛兽先生), to unite in descending and attending the purification rites.\n\nDouble kneeling.\n\nI now properly summon:\n- **Five Sacred Peaks Sovereigns** (五岳君),\n- **Assisting-Life Concealed Marshal Sovereigns** (佐命潜霍储君),\n- **Green City Elders** (青城丈人),\n- **Lushan Envoys** (庐山使者),\nand the **local mountain and river true spirits** (当境山川真灵),\nall to descend and attend the purification rites.\nDouble kneeling.\n\nI now properly summon:\n- **Celestial Sovereign of Heavenly Emperor** (天皇天一君),\n- **Earthly Sovereign of Great One** (地皇太一君),\n- **Human Sovereign of Mysterious One** (人皇玄一君),\nand their **Spirit Cavalry Escorts** (真灵骑从),\nall to descend and attend the purification rites.\nDouble kneeling.\n\nI now properly summon:\n- **Human-Wu Mountain Form** (人乌山形),\nand its **Spirit Cavalry Escorts** (真灵骑从),\nto unite in descending and attend the purification rites.\nDouble kneeling.\n\nI now properly summon:\n- **Eastern Sovereign of Soul-Striking Azure Emperor** (东方灵威仰苍帝君),\n- **Sovereign of Green-Fangled Nine Qi Heavenly Lord** (青牙九炁天君),\n- **Supreme True King** (太上真王),\n- **Green-Waisted Jade Maidens** (青腰玉女),\nand the **Eastern Suburb Spirits Officials** (东乡诸灵官),\nall to attend the purification rites.\nDouble kneeling.\n\nI now properly summon:\n- **Southern Sovereign of Vermilion Scorching Vermilion Emperor** (南方赤熛弩赤帝君),\n- **Sovereign of Crimson-Dan Three Qi Heavenly Lord** (朱丹三炁天君),\n- **Primordial Qi Elders** (元炁丈人),\n- **Crimson Palace Supreme Crimson Jade Maidens** (朱宫太丹玉女),\nand the **Southern Suburb Spirits Officials** (南乡诸灵官),\nall to attend the purification rites.\nDouble kneeling.\n\nI now properly summon:\n- **Central Sovereign of Containing-Pivot Yellow Emperor** (中央含枢纽黄帝君),\n- **Supreme True Person** (太帝真人),\n- **Child-Dan Yellow Court Wu-Ji Heavenly Azure Jade Maidens** (子丹黄庭戊己天苍玉女),\nand the **Central Supreme Sovereign Spirits Officials** (中央太帝灵官),\nall to attend the purification rites.\nDouble kneeling.\n\nI now properly summon:\n- **Western Sovereign of Radiant Marshal Precious White Emperor** (西方曜伯宝白帝君),\n- **Sovereign of Illuminous Stone Seven Qi Heavenly Lord** (明石七炁天君),\n- **Primordial Qi Elders** (元炁丈人),\n- **Supreme White Pure Jade Maidens** (太上白素玉女),\nand the **Western Suburb Spirits Officials** (西乡诸灵官),\nall to attend the purification rites.\nDouble kneeling.\n\nI now properly summon:\n- **Northern Sovereign of Concealed Marquis Black Emperor** (北方隐侯局黑帝君),\n- **Sovereign of Mysterious Nourishing Five Qi Heavenly Lord** (玄滋五炁天君),\n- **Supreme Spirit Sovereign** (太上灵君),\n- **Night-Light Jade Maidens** (夜光玉女),\nand the **Northern Suburb Spirits Officials** (北乡诸灵官),\nall to attend the purification rites.\nDouble kneeling.\n\nI now properly summon:\n- **Sovereign of Xia Emperor** (夏帝君),\n- **Five Sacred Peaks Spirit Mountain True Persons** (五岳灵山真人),\n- **Yangtze and Yellow Rivers, Four Seas** (江河四渎),\n- **Three Officials, Nine Ministries Spirits Officials** (三官九府诸灵官),\n- **Earthly Immortals Jade Maidens** (地仙玉女),\nand the **Five Sacred Peaks Flying Immortals Spirits Officials** (五岳飞仙诸仙官),\nall to attend the purification rites.\nDouble kneeling.\n\nI now properly summon:\n- **Fighting Constellation True Persons** (斗宫诸真人),\n- **Jade Boys and Jade Maidens** (玉童玉女),\n- **High Immortal Spirit Officials** (高仙神官),\nadorned in **purple and emerald ten-petal robes** (紫翠十华之帔) and **cloud-brocade phoenix-patterned skirts** (云锦凤罗之裙),\nwith **Tiger Talisman** (虎章) at their right and **Dragon Saber** (龙剑) at their left,\nriding **Azure Forest Palanquins** (碧林之辇) and **Triple White Clouds** (三素之云),\ncasting their radiance and gazing back,\nto gracefully descend and attend the purification rites.\nDouble kneeling.\n\nI now properly summon:\n- **Left Upper Celestial Concealing-Body Great General** (左上仙蔽身大将军), one named **Tang Hong** (姓唐，名宏，字文明),\nwearing **crimson piled-up robes and great cap** (赤积朱衣大冠),\nholding a **scepter in the left hand** (左手执节) and a **talisman in the right** (右手持符),\nwith **three hundred million sword-wielding soldiers** (佩剑兵士三千万众),\nto descend and attend the purification rites.\nDouble kneeling.\n\nI now properly summon:\n- **Right Upper Spirit-Concealing Great General** (右上灵隐形大将军), one named **Ge Yong** (姓葛，名雍，字文度),\nwearing **crimson headband and piled-up robes with great cap** (赤帻朱衣大冠),\nholding a **halberd in the left hand** (左手执戟) and a **talisman in the right** (右手持符),\nwith **three hundred million sword-wielding soldiers** (佩剑兵士三千万众),\nto descend and attend the purification rites.\nDouble kneeling.\n\nI now properly summon:\n- **Central Upper Divine-Hidden Great General** (中上神藏影大将军), one named **Zhou Wu** (姓周，名武，字文刚),\nwearing **crimson headband and piled-up robes with great cap** (赤帻朱衣大冠),\nholding a **scepter in the left hand** (左手执节) and a **talisman in the right** (右手持符),\nwith **three hundred million sword-wielding soldiers** (佩剑兵士三千万众),\nto descend and attend the purification rites.\nDouble kneeling.\n\nI now properly summon:\n- The **Too-Upper Supreme Orthodoxy Child General Talisman** (太上正一童子一将军箓) and its **Orthodoxy Functionary Envoys** (箓中正一功曹使者) and **Immortal Boy Attendants** (仙童侍从),\nto descend and attend the purification rites.\n\nI now properly summon:\n- The **Too-Upper Supreme Orthodoxy Child Ten Generals Talisman** (太上正一童子十将军箓) and its **Functionary Envoys** (功曹使者), **Officials and Tiger Guards** (郎吏虎贲等),\nto descend and attend the purification rites.\n\nI now properly summon:\n- The **Too-Upper Supreme Immortal One Hundred Fifty Generals Talisman** (太上正一上仙上灵百五十将军箓) and its **Functionary Envoys** (功曹使者), **General Officials and Soldiers** (将军吏兵),\nto descend and attend the purification rites.\n\nI now properly summon:\n- The **Too-Upper Three Celestial Departments Tang General, Ge General, Zhou General** (太上赤天三部唐将军、葛将军、周将军) and their **Attendant Soldiers and Officials** (并侍从兵吏), each with **three hundred million troops** (各三千万众), in **solemn attire and splendid garments** (严装盛服),\nto descend and attend the purification rites.\n\nI now properly summon:\n- The **Too-Upper Supreme Spirit One Hundred Ghosts Summoning Talisman** (太上上灵百鬼召箓) and its **Functionary Envoys** (功曹使者), **General Officials and Soldiers** (将军吏兵),\nto descend and attend the purification rites.\n\nI now properly summon:\n- The **Too-Upper Primordial Command Chaos Red Talisman** (太上元命混沌赤箓) and its **Functionary Envoys** (功曹使者), **Immortal Boys, Jade Maidens, General Officials and Soldiers** (仙人玉女、将军吏兵),\nto descend and attend the purification rites.\n\nI now properly summon:\n- The **Too-Upper Three-Five Immortals One Hundred Ghosts Summoning Talisman** (太上三五上仙百鬼召箓) and its **General Officials and Soldiers** (将军吏兵),\nto descend and attend the purification rites.\n\nI now properly summon:\n- The **Too-Upper Nine Regions Community Command Talisman** (太上九州社令箓) and its **Functionary Envoys** (功曹使者), **General Officials and Soldiers** (将军吏兵),\nto descend and attend the purification rites.\nDouble kneeling.\n\nI now properly summon:\n- The **Too-Upper Three-Five Stars Just Five Battles Talisman** (太上三五星刚五斗箓) and its **Functionary Envoys** (功曹使者), **Polaris Guards and Battle Steps** (魁罡斗步), **General Officials and Soldiers** (将军吏兵),\nto descend and attend the purification rites.\n\nI now properly summon:\n- The **Too-Upper River Diagram Precious Talisman** (太上河图宝箓) and its **Functionary Envoys** (功曹使者), **Immortal Boys and Jade Maidens** (仙童玉女),\nto descend and attend the purification rites.\n\nI now properly summon:\n- The **Too-Upper Six Harm-Dispelling Divine Talisman** (太上解六害神符箓) and its **True Officials** (真官), who **dispel punishments and avert calamities** (解刑却害), **General Officials and Soldiers** (将军吏兵等),\nto descend and attend the purification rites.\n\nI now properly summon:\n- The **Too-Upper Nine Phoenixes Impurity-Breaking Talisman** (太上九凤破秽箓) and its **Five-Direction Impurity-Breaking General Officials and Soldiers** (五方破秽将军吏兵),\nto descend and attend the purification rites.\n\nI now properly summon:\n- The **Too-Upper Supreme Chapter Seal Talisman** (太上都章毕印箓) and its **True Gods** (真神), **Functionary Envoys** (功曹使者), **Immortal Boys and Jade Maidens** (仙童玉女),\nto descend and attend the purification rites.\n\nI now properly summon:\n- The **Too-Upper Evil-Beheading Canopy Talisman** (太上斩邪华盖箓) and its **Functionary Envoys** (功曹使者), **General Officials and Soldiers** (将军吏兵),\nto descend and attend the purification rites.\n\nI now properly summon:\n- The **Too-Upper Nine-Heavens Military Talisman** (太上九天兵符箓) and its **Commanding Nine-Heavens Spirit Sovereigns** (统领九天神君), **General Officials and Soldiers** (将军吏兵),\nto descend and attend the purification rites.\n\nI now properly summon:\n- The **Too-Upper Nine Palaces Disaster-Warding Talisman** (太上九宫捍厄箓) and its **Various Officials** (诸官), **Disaster-Averting Sovereigns** (却厄君), **General Officials and Soldiers** (将军吏兵),\nto descend and attend the purification rites.\n\nI now properly summon with two bows:\n- The **Too-Upper Eight Trigrams Protective Body Talisman** (太上八卦护身箓), its **Functionary Envoys** (功曹), **Eight-Directional Protective Body Sovereigns** (八方护身君), and **General Officials and Soldiers** (将军吏兵),\nto descend and attend the purification rites.\n\nI now properly summon with two bows:\n- The **Too-Upper Examination and Conveyance Talisman** (太上考召箓), its **Examination and Conveyance Sovereigns** (考召君), **Generals and Officials** (将吏), and **Spirit Officials of the Conveyance** (摄召灵官),\nto descend and attend the purification rites.\n\nI now properly summon with two bows:\n- The **Too-Upper Evil-Beheading Crimson Talisman** (太上斩邪赤箓), its **Evil-Dispelling Generals and Officials** (辟斥将军吏兵) and **Evil-Beheading Spirit Officials** (斩邪灵官),\nto descend and attend the purification rites.\n\nI now properly summon with two bows:\n- The **Too-Upper Evil-Dispelling Spirit Talisman** (太上辟邪神箓), its **Functionary Envoys** (功曹使者), **General Officials and Soldiers** (将军吏兵),\nto descend and attend the purification rites.\n\nI now properly summon with two bows:\n- The **Too-Upper Four Divisions Restraining Qi Talisman** (太上四部禁炁箓), its **Restraining Qi Generals** (禁炁将军), **Functionary Envoys and Soldiers** (功曹吏兵),\nto descend and attend the purification rites.\n\nI now properly summon with two bows:\n- The **Too-Upper Great Evil-Beheading Talisman** (太上大斩邪箓), its **Evil-Punishing Sovereigns** (诛邪), **Severing and Cutting Off Water Realm Demonic Qi** (断绝水府精邪), and **General Officials and Soldiers** (将军吏兵),\nto descend and attend the purification rites.\n\nI now properly summon with two bows:\n- The **Too-Upper Functionary Envoys Talisman** (太上功曹箓), its **Functionary Envoys** (功曹使者), **Immortal Boys and Jade Maidens** (仙童玉女), and **Soldiers** (吏兵),\nto descend and attend the purification rites.\n\nI now properly summon with two bows:\n- The **Too-Upper Life-Preserving and Longevity Talisman** (太上保命长生箓), its **Life-Preserving Officials and Soldiers** (保命君吏),\nto descend and attend the purification rites.\n\nWith two bows, I now properly summon the **Noble Generals and Officials** (贵神将吏) of the **Too-Upper Three Elements Great General Contract** (太上三元大将军券契),\nto descend and attend the purification rites.\n\nWith two bows, I now properly summon the **Yangping Rectification of the Capital and Rectification Talisman** (阳平治都功治箓).\nIf the **Capital and Rectification** (都功) is not accepted, then I do not summon it.\n\nThe **Rectification Ritual** (治典) comprises **Twenty-Four Rectifications** (二十四治), each with **Twenty-Four Rectifiers** (二十四人), **Twenty-Four Officials** (二十四职), and each **Office** (职) commands **Two Hundred and Forty Soldiers** (二百四十军), each **Soldier** (军) has **Two Thousand and Forty Generals** (二千四百将), each **General** (将) commands **Twenty-Four Thousand Soldiers** (二万四千吏), and each **Soldier** (吏) commands **Twenty-Four Thousand Troops** (二十四万兵).\nThere are **Male Officials** (男官), **Female Officials** (女官), and **Twenty-Four Officials** (二十四官).\nThere are **Male Rectifiers** (男职), **Female Rectifiers** (女职), and **Twenty-Four Rectifiers** (二十四职).\nThere are **Male Qi** (男气), **Female Qi** (女气), and **Twenty-Four Qi** (二十四气).\n\nWithin each **Rectification** (治), there are **Five Hundred Generals** (五百将) beneath the **Tiger-Forces威仪** (虎贲威仪) bell, each with **Twenty-Four Rectifiers** (二十四人).\nWithin each **Rectification** (治), there are **One Hundred and Twenty Marshals** (校尉百二十人).\nWithin each **Rectification** (治), there are **Two Functionary Envoys** (功曹二人).\nWithin each **Rectification** (治), there are **Two Chief Clerks** (主簿二人).\nWithin each **Rectification** (治), there are **Twelve Assistants** (干佐十二人).\nWithin each **Rectification** (治), there are **Twelve Vajra Boy Attendants** (金刚童子十二人).\nWithin each **Rectification** (治), there are **Twelve Junior Clerks** (小吏十二人).\nWithin each **Rectification** (治), there are **Twelve Supervisory Officials of the Departmental Seal** (部章督邮十二人).\nWithin each **Rectification** (治), there are **Twelve Attendants** (从事十二人).\nWithin each **Rectification** (治), there are **Two Messengers** (使者士二人).\nWithin each **Rectification** (治), there are **Two Transmitters of the Departmental Seal** (通章二人).\nWithin each **Rectification** (治), there are **Twelve Rectification Sovereigns** (典治君十二人).\nWithin each **Rectification** (治), there are **Twenty-Four Examination and Conveyance Clerks** (考召吏二十四人).\nWithin each **Rectification** (治), there are **Twenty-Four Left and Right Yin-Yang Vitality Clerks** (左右阴阳二十四生炁吏).\nWithin each **Rectification** (治), there are **Twenty-Four Commanding Generals of the Battle Standard** (建节监功大将军二十四人).\nWithin each **Rectification** (治), there are **Twenty-Four Clerks of the Front Step** (前步效功吏二十四人).\nWithin each **Rectification** (治), there are **Twenty-Four Clerks of the Rear Step** (后步效杀二十四人).\nWithin each **Rectification** (治), there are **Twenty-Four Post Station Chiefs** (驿亭丞二十四人).\nWithin each **Rectification** (治), there are **Two Supervisory Attendants of the Seal** (监章从事二人).\nWithin each **Rectification** (治), there are **Two Attendants of the Seal** (按章从事二人).\nWithin each **Rectification** (治), there are **Two Recorders of the Seal** (录章从事二人).\nWithin each **Rectification** (治), there are **Two Inspectors of the Seal** (校章从事二人).\nWithin each **Rectification** (治), there are **Two Presenters of the Seal** (呈章从事二人).\nWithin each **Rectification** (治), there are **Twenty-Four Kings of the Hundred Ghosts** (铃下百鬼中王二十四人).\nWithin each **Rectification** (治), there are **Two Stabilizers of the Seal** (定章从事二人).\nWithin each **Rectification** (治), there are **Two Bearers of the Seal** (赍章从事二人).\nWithin each **Rectification** (治), there are **Two Guardians of the Seal** (御章从事二人).\n\nWith two bows, I now properly summon the **True Officials Guarding Sacred Mountains and Great Marshes** (名山大泽守土真官), the **Superintendents of the Current Realm** (当界主司), the **Supervisors of the Void** (虚空监察), the **Four Officials and Five Emperors** (四司五帝), and the **Responsive Spirits of True Essence** (应感真灵),\neach leading their respective luminous radiance and descending light (分辉垂光),\nto descend and attend the purification rites.\n\nWith two bows, I now properly conclude the summoning of all **Saints** (众圣).\nI now properly visualize the **True Essence Spirits** (真灵) in their myriad layers and countless ranks (百匝千重、亿乘万骑),\nall present at the altar (坛所),\neach according to their proper order and solemnly arrayed.\nThe **Spirits of True Essence** (灵真) shine with radiant splendor (光辉焕耀),\nstanding solemnly before my eyes (肃然在目).\n\nI now bow twice before proceeding.\n\nNext, I recite the **Words** (词), and upon completion, I bow twice again.\n\nNext, I properly declare the **Names and Positions** (名位).\n\n「The **Disciple of the Upper Clarity Primordial Great Cavern** (上清玄都大洞三景弟子),\nserving the **Three Caverns Ritual Method** (三洞醮法事),\nnow respectfully invokes the **Master of Certain Peak** (某岳先生),\nthe **Imperial Small Talisman Sage** (某帝小兆真人),\nand **Your Servants** (臣某等),\nwith utmost reverence and trembling fear (诚惶诚恐),\nnow humbly kneel and bow twice (谨叩头再拜),\nto address:\n\nThe **Primordial Sovereign of Natural Nothingness** (虚无自然元始天尊),\nthe **Supreme Old Master of the Boundless Dao** (无极大道太上老君),\nthe **Upper Marshal and Upper Minister** (上相上宰),\nthe **Primordial Sovereign of the Boundless** (无极元君),\nthe **Supreme High Daoist Lord of Jade Morn** (太上玉晨高上道君),\nthe **Celestial Sovereign of the Supreme Clarity** (太微天帝君),\nthe **Imperial Sovereign of the Golden Gate of the Posterior Sage** (后圣金阙帝君),\nthe **Twenty-Four High Sages of Jade Sovereignty** (玉皇二十四高真),\nthe **Primordial Sovereign of Jade Clarity and Purple Emptiness** (玉清紫虚元皇道君),\nthe **Four Aides and Upper Marshals and Ministers** (四辅上相上宰),\nthe **Great Lord of Eastern Flowery and the Azure Boys** (东华方诸青童大君),\nthe **Three Celestial Just Laws and Primordial Lords** (三天正法三元君),\nthe **Primordial Sovereign of the Supreme Clarity’s Spirit Cavern** (太微灵都元皇真君),\nthe **Supreme Sage of the Nine Celestial Phoenix Qi** (九天凤炁太清上仙),\nthe **Supreme Elder** (太上丈人),\nthe **Divine Elder** (神仙丈人),\nthe **Jade Boys and Jade Girls** (玉童玉女),\nthe **Sovereign Emperors of the Three Platforms and Seven Primordial Aides** (三台七元辅弼尊帝),\nthe **Divine and True Supreme Sage** (神真上圣),\nthe **Supreme Protector of the Southern Pole, Purple Primordial Lady** (上保南极紫元夫人),\nthe **Supreme Attendant, Most Pure Sage** (上傅太素真君),\nthe **Supreme True King of the Western City** (上宰西城总真王君),\nthe **True Person of the Supreme Extremity** (太极真人),\nthe **Red Sage of Southern Peak** (南岳赤君),\nthe **Twenty-Four True Persons of the Lower Teaching of Great Peace** (太平下教二十四真人),\nthe **Southern Peak Lady Wei, Attendant of Life** (司命南岳魏夫人),\nthe **Lady of Purple Micro, Attendant of Life** (紫微王夫人),\nthe **Peaceful Consort of Nine-Hua Peak** (九华安妃),\nthe **True Person of the Great Primordial** (太元真人),\nthe **Lord of the Eastern Court, Attendant of Life, Master Mao** (东卿司命茅君),\nthe **Pure-Spirit Sage, Master Pei** (清灵真人裴君),\nthe **True Person of Purple Yang, Master Zhou** (紫阳真人周君),\nthe **Morning Attendant of the Divine Consort** (仙侯侍帝晨),\nthe **Two True Persons of Master Xu** (二许真人),\nthe **Attendant of Life, Master Yang** (司命杨君),\nthe **True Person of the Curved Bend** (句曲真人),\nthe **Right Prohibition Officer of the Divine Record, Master Mao Zhongjun** (定录右禁郎茅中君),\nthe **Divine Record Officer of Life Preservation, Master Mao Xiaojun** (三官保命司直茅小君),\nthe **All True Spirits of the Hua Yang Cavern, overseeing the fate of life and death and fortune and misfortune in the vast regions of the Blue Brute and Wu Yue** (华阳洞府领括苍吴越生死罪福众真),\nthe **Thirty-Six Attendants of Life** (三十六司命官君),\nthe **Nine Morning Lords of the River Diagram** (河图九晨君),\nthe **All Spirit Officials of the Six Jia** (六甲诸灵官),\nthe **Lord of Western Peak** (西岳君),\nthe **Lord of the Central Yellow, Great Unity** (中黄太一君),\nthe **Five Peaks and Nine Mountains, Aiding the Mandate** (五岳九山佐命君),\nthe **Three Primordial Sovereigns** (三皇真君),\nthe **Supreme Primordial Sovereign of the Boundless Dao** (无上元始太上大道君),\nthe **Five Elders of the Supreme Deity** (五老上帝),\nthe **Most Venerable Great Sage of Ultimate Truth** (至真大圣尊神),\nthe **Supreme Master of the Mysterious Middle** (玄中大法师),\nthe **All Sages of Dao and Virtue** (道德众圣),\nthe **Great Celestial Sovereign** (天尊大帝),\nthe **Celestial Sovereign of the Three True Persons of the Supreme Unity** (天帝玄一三真人),\nthe **Supreme Sovereign of the Boundless Dao, Master of Clear Might** (太上明威正一天尊),\nthe **Heir to the Celestial Master, the Successor Master, the System Master, and the Female Master** (天师嗣师、系师、女师),\nand the **Gatekeepers under the Three Masters’ Gate** (三师门下典者君吏),\nas well as the **Supreme Daoist Sovereign** (上皇太上道君),\nthe **Supreme Primordial Lord of the Supreme Clarity** (太清玄元上三天无极大道太上老君),\nthe **Supreme Elder** (太上丈人),\nthe **Nine Elders of the Nine Qi** (九炁丈人),\nand the **Nine Elders of the Nine Celestial Caverns** (九老仙都君),\n\nwith **myriad layers and countless ranks of Dao-Qi** (百千万重道炁),\nand the **thousand and two hundred spirit officials** (千二百官君),\nthe **Supreme Daoist Lord of Jade Sovereignty in the Southern Upper Dao** (太清玉陛下南上大道君),\nand **all True Spirits of the Four Directions and Three Realms** (四方三界一切真灵),\nthe **Jade Boys of the Three Caverns Canon** (三洞典经玉郎),\nand the **Divine Officials of the Sages** (神仙官属),\n\nYour servant, **Certain** (臣某),\nthrough seven generations of accumulated **virtue** (积德),\nnow rejoices in this present life (庆及今生).\nFrom youth, I have aspired to the **Dao** (慕道),\nmy thoughts ever seeking the **wonderful methods** (妙法).\nWith a **pure and austere resolve** (洁志清严),\nI submit to the **Master’s Gate** (归命师门),\nand with **diligent reverence and humility** (勤求俛仰),\nI seek to attain the **door of Certain Lord** (以诣某君门下),\nto receive the **precious scriptures** (宝经),\n**celestial texts** (天书),\n**jade characters** (玉字),\n**talismans and diagrams** (符图),\n**essential keys** (要诀),\nand **inner and outer ritual ordinations** (内外治箓).\nI wear the **auspicious tokens** (佩服),\npreserve the **forms of the body** (身形),\nand diligently practice **offerings and nourishment** (供养),\nyet have not yet attained the **True Spirits** (未契真灵).\n\nOn this auspicious day and favorable occasion (今吉日良会),\nafter **bathing and purifying with incense** (沐浴熏修),\nI **spread out the ritual seat** (敷陈法座)\nand **offer fragrant delicacies** (施设芳馔),\nto **invite and present the True Spirits** (启荐真灵).\n\nI humbly pray that the **Venerable Sages** (大圣众尊),\nmay **return to their cloud-borne carriages** (回云驾),\nand **condescend to accept my offerings** (俯垂采纳),\nto **illuminate my mortal sentiments** (鉴映凡情),\nand **examine what I have spoken** (省理所言),\nthus **bestowing blessings and granting fortune** (留恩降福).\n\nI, your humble servant, prostrate myself with two bows.\n**Three times offering incense.**\n**Three times offering water.**\n\nYour servant, with utmost reverence, now humbly presents this petition:\n\nThe Great Dao is subtle and wondrous,\nits divine functions boundless.\nIt inhales and exhales yin and yang,\ngiving birth and nurturing all things.\nAll beings with form\nare born of the Dao,\nnourished and perfected,\nas a mother bears her child.\nAll things that return to it\nare in communion with its power.\n\nI humbly pray to the Most High and the Venerable Sages,\nthat in their compassion for those with sincere hearts,\nthey grant me the blessing of enlightenment.\n\nIf my seven generations of ancestors\nhave committed great sins—\ntransgressing laws and taboos,\ndefiling heaven and earth, the sun, moon, and stars,\nor blaspheming gods and spirits,\nreviling the True Spirits,\nslandering scriptures and the Dao,\noppressing the weak and deceiving the poor,\ntheir threefold karma and six senses\nfilled with arrogance and disrespect toward elders,\ncommitting murder and theft,\ncountless crimes and offenses—\nI beseech the boundless mercy of the Great Forgiveness,\nthat all seven generations of my ancestors,\ntheir souls now transformed,\nmay be universally pardoned,\nfreed from the nether realms,\ntranscending to blessed lands,\nrefining in the Southern Palace,\nachieving Daoist perfection,\nascending to the Nine Heavens,\nand dwelling in effortless freedom.\n\nMy own deep-rooted karma has brought me grave illness and misfortune,\nyet my diseases fade unseen,\nall calamities vanish,\nevil schemes and malevolent spirits,\nall banished—\nmy celestial blessings everlasting,\njoy and fortune boundless.\n\nTogether with my master and fellow practitioners,\nand my kin and relatives,\nmay we all attain longevity,\nour lives steadfast and auspicious.\n\nI pray that my heart may be illuminated with clarity,\nmy wisdom perfected and boundless,\nthat the True Saints may secretly guide me,\nthe spirits descend to meet me,\nthat noble teachers and kindred friends\nwill appear without seeking,\nthat elixirs of jade and gold\nwill come naturally,\nthat the Way may be practiced and attained,\nthat immortality may be sought and found,\nthat my intentions align with my heart,\nand all my endeavors succeed.\n\nI, your servant, prostrate myself with two bows.\n**Three times offering incense.**\n**Three times offering water.**\n\nYour servant, **prostrate with two bows**, respectfully and solemnly presents this petition to the Most Exalted and Revered Celestial Worthies, the Most Venerable and Divine Saints, the Three Caverns of Divine Truth, and the Four Directors and Five Emperors.\n\nBy the grace of fate, the deep kindness of past lives has endured, and through the nine heavens’ calamities, its blessings now extend to this humble body. Encountering the auspicious era of the Way’s flourishing, I have been granted the opportunity to partake in the sacred texts, the lofty and secret scriptures, and the talismans and diagrams of the Three Caverns.\n\nSince my first, unworthy contact with these teachings, I have revered the Most High and True Ones, my heart yearning for the divine, yet my devotion remains shallow and insufficient. I fear not being able to move the spirits, and thus dread that my sinful self may sink into filth and decay, lost forever in the nine depths.\n\nBut the Heavenly Mercy is vast and boundless, its efficacy ever-present. With a heart steadfast in sincerity and a will of infinite resolve, I now humbly lay forth my ten thousand wishes, my mind clear and my gratitude sincere, revealing both old and new vows.\n\nI pray that the Most Venerable and Exalted Saints, the Noble Masters, and the Most True Heavenly Worthies may, in their infinite grace, look down upon this lowly one. I am deeply ashamed and fearful, not daring to rest in ease, for the Heavenly Light shines far and wide, illuminating even the most hidden places. With my heart laid bare, I present this petition, boldly offering it for your consideration.\n\nI beg for the talismans and sacred scriptures of the True Ones, and for divine spirits to guard and protect me, that I may ascend mountains and traverse dangers, move through forests and ravines, and that all my requests and aspirations may be fulfilled as I speak.\n\nMay the Way’s mysteries be revealed, and the divine intelligences converge; may my ten thousand wishes be realized in my heart.\n\nLet me gather the elixir herbs and medicines without concealment.\nLet mountain spirits submit and hide themselves, never interfering in my trials.\nLet poisonous beasts and venomous creatures never harm this body.\nLet celestial youths and jade maidens attend me, east and west.\n\nMay all the spirits of **qi** descend into my form, calming the five viscera, granting clarity within and without, opening my mind and awakening my understanding, enabling me to foresee fortune and misfortune, and may the Three Corpses be banished, the Nine Parasites never take root. May my body bear divine markings, and I soon attain the state of the **Saints**.\n\nOnly through the grace of the Most Exalted and Great Emperors and True Worthies, who bestow blessings and mercy, may their favor flow down to all the common folk, granting me the fulfillment of my prayers. I am overwhelmed by their boundless kindness and will strive to repay it.\n\nYour servant, **prostrate with two bows**, is sincerely awestruck and trembling.\n\n**Three times offering incense.**\n**Three times offering water.**\n\n**Ritual for Escorting the True Spirit (7th True Ritual)**\n\nYour servant, **prostrate with two bows**, humbly states:\nThe Most Exalted Spirit has labored to descend from the heights and enter the profane realm below, yet has been burdened by my meager offerings of food and drink, and my crude words and simple reasoning. I have long delayed the True Ritual’s observance, and my guilt is boundless.\n\nNow the **cloud-chariot** is prepared, and the path has been cleared. I pray that the Most Exalted Spirit may return and ascend to the **Golden Gate**.\n\nUnworthy as I am, I beg for the grace to be permitted to ride the chariot and ascend. I humbly await Your boundless mercy.\n\nYour servant, **sincerely awestruck and trembling**, **prostrates with two bows**.\n\n**Four times offering incense and water, and presenting the sacrificial offerings of the jiao ritual.**\n**Collecting the dharma talismans and position tablets, then commanding the minor spirit officials.**\n\n**Commanding the Minor Spirit Officials (8th True Ritual)**\n\nThe hierarchy of high and low, the order of human and divine—all must follow proper paths, without error or excess. The sequence must be respected.\n\nNow that the Most Exalted Spirit has ascended, all those who tend, guard, and serve—including the **True Officials of the Land** and the **soldiers and officers within my body**, who wield talismans and diagrams—though their ranks are low and duties minor, have not yet participated in the **Dharma Seat**. I pray that each may be assigned their proper station, according to their rank, and receive my humble words.\n\n**Offering incense.**\n**Offering water.**\n\n**Humbly praying that the Celestial Chariot be properly guided, I dare not delay it further.**\n\nMay it be that after the Most Exalted’s descent, each return to their proper duties, as usual, guarding and protecting, bestowing blessings and warding off calamities, leaving behind grace and spreading virtue.\n\nThe **Jade Boys and Jade Girls** who attend the scriptures, the **Left and Right Jade Officers**, along with the **True Officials** entrusted to me—may they each take their appointed stations, united in heart and body with me, moving and resting without separation.\n\nShould there be disasters, dangers, or afflictions—spirit vexation, qi confusion, or breach of oath—then the officers and soldiers shall bear the first blame. The **Mysterious Laws and Ritual Codes** are strict; the penalty is not light. The spirits must take heed.\n\n**Dispersing incense and water.**\n\n**The Inner Officials (9th True Ritual)**\n\nHaving completed the *jiao* ritual, I now summon the **Five-Body True Officials** of my origin, the **Three-Cavern Jade Officers**, and all **Spiritual Cavalry**—may they return to my body, each taking their proper station: left to the left, right to the right. May they sit in tranquility within the **Golden Hall and Jade Chamber**, preserving the **vital essence** and **perfecting the True**. Only when I later summon them forth again shall they emerge, as in past practice. I remain in silent meditation for a long while, striking my teeth three times, visualizing the spirits, and they return to my body in perfect harmony—like soldiers of a state returning to their barracks, all still and serene—before the incense burner is extinguished.\n\n**Extinguishing the Incense Burner (10th True Ritual)**\n\nFrom this point onward, the chapter shall be recited in a high, level tone, as in the *zhai* ritual.\n\nThe **Incense Officials and Messengers**, the **Left and Right Dragon and Tiger Lords**, and the **Attending Spirit Officials of Incense**—at this moment of altar stillness, the **Golden Pillars and Jade Flowers** shall naturally manifest.\n\nI, [Name], having sought the Dao and attained it, having sought immortality and attained it, with the **Seven Ancestors and Three Teachers** all granted ascension—now bathed in the **Mysterious Grace**—pray that the **Ten-Directional Immortal Boys and Girls** attend the incense smoke, swiftly conveying my petitions to the **Three-Heavenly Sovereign**, the **Formless, Nameless, Supreme Primordial Emperor**.\n\n**The Hymn for Sending the Spirits (11th True Ritual)**\n\nVast and boundless, without form,\nYet moved by the emotions of the living.\nWith reverence, blessings descend from heaven;\nWith transgression, demons are drawn near.\nFortune and misfortune arise with fate;\nProsperity and adversity follow their causes.\nThe Dao does not value jade and pearls;\nThe spirits fear only sincerity of heart.\nEnduring toil in refining elixirs,\nI pour forth my earnest devotion.\nNaturally communing with the Great Saints,\nAll descend with enlightened grace.\nWith incense in hand, I present my wishes,\nBowing in hope of virtuous approval.\n\nThe Celestial Sovereign abides in eternal stillness,\nTurning the heart toward the boundless void.\n\nUpon completion, the disciple of immortality descends from the altar, as is customary.\n\n**The Doorway Blessing (12th True Ritual)**\n\nThe **Supreme Dark Principle**, the **Eight Windows of Light** now open.\nWhat was petitioned has been communicated to the **Spirit of the Maiden**.\nThe rites now concluded, all spirits return to their stations,\nAnd the myriad spirits rest in hidden tranquility.\n\n**Taboos After the Jiao Ritual (13th True Ritual)**\n\nThe ritual food may be given to **worthy men, Daoists**, but not to **common, impure folk**—especially not to **filial sons or women**, who are strictly forbidden. Nor should it be given to ordinary people as alms. According to ancient law, it must be cast into **long-flowing waters** or buried in the earth.\n\nDo not drink alcohol—it disturbs the *qi*;\nDo not eat the **Five Spices**—it clouds the mind;\nDo not share meals with others—it mixes the *qi*;\nDo not gaze upon the dead or living—it pollutes the *qi*;\nDo not be angry—it scatters the *qi*;\nDo not grieve—it harms the spirit;\nDo not see blood—it defiles the *qi*.\n\nThe **Seven Precepts** above must be observed for seven days, or at least fourteen—though forty-nine days would be ideal. These prohibitions apply not only after the *jiao* but are also strictly observed by **all Daoist practitioners**.\n\nAll items procured for the *jiao* must be fresh, abundant, and pure—free of holes, cracks, or filth. They must not be purchased through bargaining or buried for profit. Impure items are unfit for ritual use, such as **sugarcane, taro, or medicinal herbs**—though **ginseng or poria** are permitted, as these are sacred substances nurtured by spirits. When preparing them, one must first bathe in purity, cleanse the utensils and tools with incense, and avoid loud speech, anger (great or small), or mingling with outsiders.\n\nIf unable to prepare them oneself, one must seek a **ritual cook**, who must first be instructed to bathe, change into clean clothes, and oversee the preparation personally.\n\n**The Five Sacred Scriptures of the Three-Cavern Dao Completed, the Ritual of the True Unity’s Oath and威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "醮三洞真文五法正一盟威箓立成仪 经名：醮三洞真文五法正一盟威箓立成仪。 原题账万福撰。 一卷。 底本出处：《正统道藏》正一部。 醮三洞真文五法正一盟威箓立成仪 三洞弟子张万福撰 凡醮者，所以荐诚於天地，祈福於冥灵。 若不精专，则不足以通感，尽诚而福不应者，未之有也，诚不极而望臻者，亦未闻矣。 修佩之者，宜竭诚焉。 凡设座，得名山洞穴是佳，不然，即幽闲虚寂，亦可施置其器物座具。 时果芳馔，必在丰新。 山洞间无席，即藉草以木叶。 若净为巾，预慎内外，不得犬鼠畜产，离秽荤肥，登临犯触，及呵叱大小。 盛馔一如斋法，世人心昧，不睹精微，即云酒脯，但生不信。 且道法清虚，特忌殗秽。 星辰岳渎，皆是真仙主之。 不究根寻源，直信邪说，若斯之类，吁可痛哉。 知上士之所勤，下愚之大笑也。 设坛座位第一 洁坛解秽第二 入户咒第三 发炉第四 出灵官第五 请官启事第六 送神真第七 勑小吏神第八 内官第九 复炉第十 送神颂第十一 出户咒第十二 醮后诸忌第十三 设坛座位第一 夫神道非形，至诚斯感； 真灵无象，启必有方。 修之者，须立坛位，以祈福应也。 其坛，请依灵宝招真法，开东、西、南、北、王上五门，方二丈四尺，栏纂如法。 何者？ 三洞经法，洞玄居中，故用其事，以通上下也。 立坛讫，置上清位於坛中，稍近前，南向施青绛纹巾，以法箓开安座上，前设五尺盘三枚。 一盘九分，一盘六分，三盏灯，一盘一分，都合十六分十六杯，三炉香。 次北近西六甲位，南向敷绛巾，以符开安座，前设六盘，每盘一分，一炉香，六杯，灯一。 次东头三皇位，南向敷碧巾，以符开安座上，从东天皇，次地皇，次人皇，前设三盘。 盘一分，三香，三杯，三灯。 次东面北头，五岳真形图，西向敷绛巾，以图符安座上，前三盘。 近北一盘，五分，五岳君位近南，一盘二分； 佐命君位次南向，二盘，各一分； 青城庐山使者位，三盘，九分。 九杯，四灯，四炉香也。 次南五符位，西向敷巾，以符安座上，前三盘。 一盘一分，稍前，或别席敷皂巾。 人乌山位一盘，一杯，一香，一灯。 次后二盘，真文五符八景内音位，各五分，合十分，十杯，一香，一灯。 次南设盟威位，东向敷绛巾，符安座上，前设三盘。 盘八分，合二十四分，二十四杯，或十二杯，或八，或三，各有法象，一香，一炉。 次北设东西二禁位，东向敷青巾，以符安座上，前设三盘。 近北一盘一分，西岳君位； 次近南，中黄太一位，一盘一分； 次近西，四神君位，一盘四分。 都三盘，合十六分，或六盘，三分，二香，二灯。 若修七星，即於坛中上清后、六甲前，南向敷紫巾，设七盘。 盘一分，七杯，一香，一灯，此位纵不修，亦宜设位。 夫醮法，以斯为首也。 河图； 附上清，亦可於上清后、三皇前，敷青巾，南向设一盘九分，一香，九杯，一灯。 醮余镇信盥、豉、米等，於上清前，小近东一席置之。 项见师，作如是设位，非敢自专其所，须香灯、镇信，并须如法。 或能每座设案，更以净巾，以箓於案上更佳。 各设版坛，四面并须绛绳栏之。 不然，即灰，或麦麸围之。 欲使真灵有位想念，可以净幕遮围，不使香灯散乱尤佳也。",
      "translated_text": "**Ritual of the Three Caverns True Scriptures: Five Methods of the Rectified One Alliance-Oath Talisman’s Established Rites**\n*(Title as in the Daozang: Ritual of the Three Caverns True Scriptures: Five Methods of the Rectified One Alliance-Oath Talisman’s Established Rites)*\n*Original Attribution: Compiled by Zhang Wanfu, a Disciple of the Three Caverns*\n*One Scroll*\n*Source: Canon of the Orthodox Daozang, First Section*\n\n---\n\n**Ritual of the Three Caverns True Scriptures: Five Methods of the Rectified One Alliance-Oath Talisman’s Established Rites**\n*Composed by Zhang Wanfu, a Disciple of the Three Caverns*\n\nAll who perform the *jiào* ritual do so to offer sincerity to Heaven and Earth, and to pray for blessings from the numinous spirits. If one is not wholly devoted, one cannot hope to move them. If one’s sincerity is not absolute, yet still expects a response—such a thing has never been heard. Those who cultivate must exhaust their sincerity.\n\nAs for the ritual setup, a named mountain or cavern is ideal. If not, then a secluded, quiet place will suffice for arranging the implements and seats. The offerings must be fresh and abundant. In mountain caverns where mats are unavailable, use grass or leaves instead. The ritual cloths must be scrupulously clean, both inside and out, free from contamination by dogs, rats, or livestock. Avoid unclean meats and greasy foods, and refrain from ascending or touching the altar, or from shouting or scolding—whether to elders or juniors.\n\nThe offerings must be prepared as in the *zhāi* fast, though common folk, unaware of subtleties, may dismiss even wine and preserved meats as insufficient. Indeed, the Dao’s methods are pure and refined; they especially abhor filth and impurity. The stars, constellations, and sacred peaks are all domains of the true immortals. To ignore their origins and blindly follow false teachings—such errors are grievous indeed! To know the labors of the sage and yet mock them with vulgar laughter—how lamentable!\n\n---\n**First: Establishing the Altar and Seats**\nThe Dao’s spirits are formless; only the utmost sincerity can move them. The numinous souls are without manifestation, yet they must be invoked with proper rites. Those who practice must erect the altar and arrange the seats to invite blessings.\n\nThe altar shall follow the *Lingbao* method of summoning the true, opening the five gates—East, West, South, North, and the Celestial Sovereign—each spanning twenty-four feet, with railings as prescribed. Why? The Three Caverns’ teachings place *Dongxuan* at the center, and thus its rites are used to harmonize above and below.\n\nOnce the altar is erected, place the *Shangqing* seat in the center, slightly forward-facing south, draped with a green-and-purple patterned cloth. Open the talisman and place it upon the seat, with three trays before it: one divided into nine parts, one into six, and three lamp stands—one tray divided into one part—totaling sixteen divisions and sixteen cups, with three incense burners.\n\nNext, to the north and near the west, place the *Liujia* (Six Celestial Stems) seats, facing south, draped with a crimson cloth. Open the talisman and arrange the seat, with six trays before it: each divided into one part, one incense burner, six cups, and one lamp.\n\nNext, at the eastern end, place the *Sanhuang* (Three Sovereigns) seats, facing south, draped with a green cloth. Open the talisman and arrange the seats—*East Heaven Sovereign, Earth Sovereign, and Human Sovereign*—with three trays before them: each divided into one part, three incense burners, three cups, and three lamps.\n\nNext, to the east and facing north, place the *Five Sacred Peaks True Forms Diagram*, facing west, draped with a crimson cloth. Arrange the talisman-diagram upon the seat, with three trays before it:\n- The nearest tray to the north, divided into five parts, for the *Five Peak Lords*;\n- The next tray to the south, divided into two parts, for the *Assisting Command Lords*;\n- The *Qingcheng-Lushan Envoys* seat, with three trays divided into nine parts.\nTotal: nine cups, four lamps, and four incense burners.\n\nNext, to the south, place the *Five Talisman Seats*, facing west, draped with a cloth. Arrange the talismans upon the seats, with three trays before them, each divided into one part. Place a separate mat with a black cloth slightly forward, or on another seat:\n- *Renwu Mountain Seat*: one tray, one cup, one incense burner, one lamp.\n- The next two trays: the *True Scripture Five Talismans Eight Scenes Inner Sounds Seats*, each divided into five parts, totaling ten parts, ten cups, one incense burner, and one lamp.\n\nNext, to the south, place the *Alliance-Oath Seat*, facing east, draped with a crimson cloth. Arrange the talisman upon the seat, with three trays before it:\n- Each tray divided into eight parts, totaling twenty-four parts, with twenty-four cups (or twelve, or eight, or three, as the method dictates), one incense burner, and one lamp.\n\nNext, to the north, place the *East and West Two Prohibition Seats*, facing east, draped with a green cloth. Arrange the talismans upon the seats, with three trays before them:\n- The nearest tray to the north, divided into one part, for the *West Peak Lord*;\n- The next tray to the south, divided into one part, for the *Central Yellow Taiyi*;\n- The next tray to the west, divided into four parts, for the *Four Spirit Lords*.\nTotal: three trays, sixteen parts (or six trays, three parts), two incense burners, and two lamps.\n\nIf the *Seven Stars* are being invoked, place their seats within the altar, behind the *Shangqing* and before the *Liujia*, facing south, draped with a purple cloth, with seven trays: each divided into one part, seven cups, one incense burner, and one lamp. Even if not invoked, this seat must still be arranged.\n\nThe *Hetu* (River Diagram) may also be placed behind the *Shangqing* and before the *Sanhuang*, draped with a green cloth, facing south, with one tray divided into nine parts, one incense burner, nine cups, and one lamp.\n\nAfter the ritual, place the *zhènxìn* (ritual purity offerings: salt, pickled vegetables, rice, etc.) before the *Shangqing* seat, slightly to the east on a small mat.\n\nIf a teacher is present, the arrangement must be as described. The incense, lamps, and *zhènxìn* offerings must all conform to the rites. If possible, each seat should have its own table, draped with a clean cloth, and the talismans placed upon them—this is even better. Each altar must be surrounded by a crimson rope barrier on all four sides. If rope is unavailable, use ash or wheat bran instead. To help the numinous souls focus, a clean curtain may be hung around the altar to prevent the incense smoke and lamps from scattering.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1283,
      "start_sentence": 0,
      "end_sentence": 70,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 15.357864618301392,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\醮三洞真文五法正一盟威箓立成仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "洁坛解秽第二 夫所以洁坛者，荡涤故炁，芳泽真灵，使内外清通，人神俱感。 凡启醮，悉皆如之，非直此也。 向王书解秽符於纸上，其水桃皮、竹叶、沉香、鸡舌、香柏叶等，锉绢袋沉汤中煮之，以洒坛及器物中，并沐浴。 或以清泉新水，亦得用也。 依前章铺讫，具法服，以剑水於地户上，先剑后水，相去各三步，启奏作三才步。 步毕，握固瞑目，存经、籍、度师在西面，存唐将军兵马佩剑执印在左，葛将军兵马执戟佩剑在右，周将军兵马执节在前，真人着朱衣、乘九凤、步斗临坛收秽。 七星覆己，头上柄指前，不得遮己目。 毕，开目诵四灵 咒。 咒曰：",
      "translated_text": "**Purification of the Altar and Cleansing of Impurities (Second Section)**\n\nThe purpose of purifying the altar is to dispel the lingering *qi* of defilement, to perfume and honor the numinous souls, so that the inner and outer spaces may be cleansed and harmonized, and both humanity and the divine may be moved.\n\nFor all rituals that begin, this method must be followed—it is not limited to this alone.\n\nPreviously, the *Xiangwang* scripture (the \"King of Incense\" text) was inscribed on paper to dispel impurities. The water was prepared with peach bark, bamboo leaves, *chénxiāng* (aloewood), *jīshé* (chicken tongue herb, *Houttuynia cordata*), and *xiāngbǎi* (sweet osmanthus) leaves, finely chopped and boiled in a silk pouch filled with water, then sprinkled over the altar and all ritual objects, and used for bathing as well.\n\nAlternatively, pure spring water or fresh water may also be employed.\n\nFollowing the previous chapter’s arrangement, after the water has been spread, the practitioner dons the prescribed ritual attire and sprinkles *jiànshuǐ* (sword-water) upon the earthen doorway. The sword is applied first, then the water, with each three steps apart. Upon beginning the invocation, the steps are taken in the manner of the *Three Powers* (Heaven, Earth, and Humanity).\n\nAfter completing the steps, the practitioner clenches their fists, closes their eyes, and mentally invokes the presence of the *Scriptures, Registers, and Degrees of the Master* to the west, the *Tang General* (唐将军) and his mounted troops, bearing sword and seal, to the left, the *Ge General* (葛将军) and his troops, wielding halberds and bearing swords, to the right, and the *Zhou General* (周将军) and his troops, holding scepters, to the front. The *Zhenren* (True Person) descends in crimson robes, riding the *Nine Phoenix*, stepping through the *Dǒu* (ritual step formation) to receive the impurities.\n\nThe *Seven Stars* (七星) cover the practitioner’s body, with the head raised and the fingers pointing forward, not shielding the eyes.\n\nWhen complete, the practitioner opens their eyes and recites the **Incantation of the Four Spirits** (四灵咒):\n\n**Incantation of the Four Spirits:**\n\n*\"Chant to be inserted here.\"*",
      "overlap_context": "ement must be as described. The incense, lamps, and *zhènxìn* offerings must all conform to the rites. If possible, each seat should have its own table, draped with a clean cloth, and the talismans placed upon them—this is even better. Each altar must be surrounded by a crimson rope barrier on all four sides. If rope is unavailable, use ash or wheat bran instead. To help the numinous souls focus, a clean curtain may be hung around the altar to prevent the incense smoke and lamps from scattering.",
      "start_char": 1284,
      "end_char": 1539,
      "start_sentence": 71,
      "end_sentence": 81,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 6.722837448120117,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\醮三洞真文五法正一盟威箓立成仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "东方青龙，角亢之精云云，并依常。 毕，以手抚心，丁字立，咒曰： 吾召百神既集，即当游云云，次三才步。 次勑水江河淮海，非凡水云云，乃噀水一下，唱摄三下。 次称名位讫，谨请东方青龙，降以真气入臣身中云云。 次作三才步、九迹或既济卦。 次请五童君云云，其他并常也。 次作七星刚步，放水椀讫。 入户祝第三 四上功曹、龙虎使者、正一生炁、侍静素女，夜有所启，请得开明童子、上玄少女，与我俱入黄宫之裹，通达所启，皆使上闻。 毕便入，绕坛一周，启事人西北设位而立。 余众宫男设位向东，先上诸座香，次上启告香也。 次唱，各礼师存念如法。 次存三师如常。 发炉第四 呜法鼓三十六通。 无上三天玄元始三炁太上老君，召出臣某身中三五功曹、左右官使者、左右捧香、驿龙骑吏、侍香金童、散花玉女、五帝直符、直日香官，各三十六人出关，启州县土地里域真官正神，臣某今正尔烧香设醮，愿得十方正真生炁降流臣等身中，令所启，速达径御三清玉帝至真几前。 次上奏按香，众官再拜。 出灵官第五",
      "translated_text": "The **Eastern Azure Dragon** (East方青龙), whose essence is the brilliance of the Horn and Tail constellations (角亢之精), likewise follows the usual method.\n\nWhen complete, the practitioner presses their hands to their heart, standing in the **Dingzi posture** (丁字立), and recites the incantation as follows:\n\n*\"I summon the hundred spirits—now that they have assembled,\nI shall traverse the clouds—then proceed with the **Three Talents Steps** (三才步).\nNext, I command the waters of the Yangtze, Yellow, Huai, and Hai rivers,\nwhich are not ordinary waters—\nI spit water once (乃噀水一下),\nand chant to absorb it three times (唱摄三下).\nThen, having invoked the names, I solemnly request the **Eastern Azure Dragon** (东方青龙),\nto descend with **true qi** (真气) into my body—\nas it is.\n\nNext, I perform the **Three Talents Steps, Nine Phases, or the Completed Hexagram** (九迹或既济卦).\nThen I request the **Five Pure Boy Lords** (五童君), and the rest follows the usual method.\n\nNext, I perform the **Seven Stars Firm Steps** (七星刚步), and place the water bowl (水椀) to completion.\n\nUpon entering the gate, the **Third Invocation** (入户祝) is chanted:\n*\"Four Heavenly Functionaries* (四上功曹),\n*Dragon-Tiger Envoys* (龙虎使者),\n*True One of the Three Talents* (正一生炁),\n*Attendant of the Pure and Silent Maiden* (侍静素女),\nthose who appear at night—\nI beseech the **Bright Clarity Pure Boy** (开明童子)\nand the **Supreme Mystic Maiden** (上玄少女)\nto enter with me into the **Yellow Palace’s embrace** (黄宫之裹),\nto traverse and fulfill all that is summoned,\nand to make it heard above.\n\nWhen done, I enter and circle the altar once,\nthen face west-north and stand where the **initiated** (事人) are positioned.\nThe remaining **palace attendants** (宫男) take their places facing east,\nfirst offering incense to all the seats,\nthen offering the **Invocation of Announcement** (启告香) incense.\nNext, I chant—\neach bows to the Master and meditates as prescribed.\nThen I meditate on the **Three Masters** (三师) as usual.\n\nThe **Fourth Invocation** (发炉第四) is chanted:\n*\"Rumble the sacred drum thirty-six times* (吒法鼓三十六通).\nTo the **Supreme Three Heavens, Primordial Beginning, Three Talents, and the Venerable Lord Lao** (无上三天玄元始三炁太上老君),\nI summon from my body the **Thirty-six Heavenly Functionaries** (三五功曹),\nthe **Left and Right Official Envoys** (左右官使者),\nthose who bear incense on the **Left and Right** (左右捧香),\nthe **Stationary Dragon and Mounted Messenger** (驿龙骑吏),\nthe **Golden Boy Attendant of Incense** (侍香金童),\nthe **Jade Maiden Scattering Flowers** (散花玉女),\nthe **Five Emperors’ Direct Talismans** (五帝直符),\nand the **Directing Day Incense Officials** (直日香官),\nall thirty-six in number, to depart from the gate (出关),\nand I summon the **State and County Earthly Deities, Local Domain Officials, and True Gods** (启州县土地里域真官正神).\nI now properly burn incense and establish the **rites of purification** (设醮),\nwishing the **Ten Directions’ True Gods of the Three Talents** (十方正真生炁) to descend and flow into my body,\nso that all that is summoned may swiftly reach and directly ascend to the **Jade Emperor of the Three Pure Ones** (三清玉帝) at the **True Virtue’s few** (至真几) before me.\nNext, I present the **Supplication of Appeal** (上奏按香),\nand all the officials bow twice (再拜).*\n\nThen the **Fifth Invocation** (出灵官第五) is chanted.",
      "overlap_context": "ing scepters, to the front. The *Zhenren* (True Person) descends in crimson robes, riding the *Nine Phoenix*, stepping through the *Dǒu* (ritual step formation) to receive the impurities.\n\nThe *Seven Stars* (七星) cover the practitioner’s body, with the head raised and the fingers pointing forward, not shielding the eyes.\n\nWhen complete, the practitioner opens their eyes and recites the **Incantation of the Four Spirits** (四灵咒):\n\n**Incantation of the Four Spirits:**\n\n*\"Chant to be inserted here.\"*",
      "start_char": 1539,
      "end_char": 1991,
      "start_sentence": 82,
      "end_sentence": 100,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 11.951533555984497,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\醮三洞真文五法正一盟威箓立成仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "长跪，叩齿二十四通。 谨出臣某身中五体真官、上仙上灵、直使功曹、正一功曹、左右官使者、阴阳神决吏、科车赤符吏、刚风骑置驿马、上章吏官，各二人； 出臣某身中虚无自然左右侍郎、混沌玉帝太真、左右领仙玉郎、九玄上虚功曹、三元功曹，各二十四人； 出上清玉虚使者、神仙使者、太山使者、金晨玉童、太华玉女、左右灵飞、玉虚侍郎，各二十四人； 出五帝、元皇、太真，各九千人； 出检天辅仙骑、辅真骑、辅神骑、辅帝骑、辅灵骑，各九亿万众； 出五帝飞轮策空骑、五帝飞仙腾空骑，各九亿万众； 出九天飞琼羽盖骑、飞辕绿骈骑、制地龙腾骑，各九亿万众； 出自然招真生芝玉仙吏、招神生芝玉仙吏、神丹生芝玉仙吏，各九亿万众； 出金真辉电骑、阳精兴云降雨骑、阴精兴云降雨骑、阳明照曜逐电骑、云门执节金光骑，各九亿万众； 出臣某身中灵宝洞玄三部八景诸天内音神仙、绣衣玉女、五帝直符、传言奏事、日月星宿、五帝官属、神龙骑、飞龙骑、驿龙骑、云龙骑乘等，一合严装冠带，整其威仪，对立臣某前，告勑上下八方、天官、地官、水官、五岳四渎、九江八极、名山大泽、五帝真官、四司监察、九部考召、玄元四始、甲子诸官君，无极无穷、无高无下、无幽无明、无深无浅、无鞅数众真官，注气乾皇、九宫八卦、六甲直符、虚无直事、五岳飞仙、神龙羽骑等，并为关启。 奏闻臣某，去某年、某月、某日，诣上清大洞法师某君门下，奉受仙灵毕法、上清仙箓、灵宝真文、八景五法、六甲秘符、西岳名山、五岳真仙图箓、三皇五帝神符、九天凤炁正法真箓、金神虎符、豁落七元灵飞、六甲紫文交带，回车毕道，佩服身形，存修供养，吉辰於某观灵坛之上，旋设薄醮，陈情献欵，以契真灵三界官属，与臣某身中五体三万六千神吏，分形合影，营护坛所，馘减妖氛，咸令肃穆，无使参差，听臣某关奏启请，必蒙降赴。 请官启事第六 从此已后，并须平声低言读之，每至再拜，皆住良久，不得高厉也。 上清玄都大洞三景弟子、某岳先生、某帝小兆真人臣某，再拜请官。 谨奉请上皇二十四高真、玉清紫虚高上元皇道君等，各神仙、玉童、玉女，一合乘云驭炁，应景分灵，垂光降临醮席。 再拜。 谨奉请三天正法三元大君、太微灵都元皇真君、神仙丈人、玉童玉女、六十三部灵官真人，一合分灵应景，驭炁乘云，腾空遍下，垂光降临醮席。 再拜。 谨奉请太清高仙、景云真人、太上丈人、上皇君、九华太帝、玄黄玉女，一合流精散气，逐感随机，驾景通神，乘光降席。 再拜。 谨奉请琼宫左右灵飞、真童玉女神仙等众，垂光降席。 再拜。 谨奉请河图太尉、玉帝府九晨君、真皇夫人、诸灵官使者、玉童玉女等，一合驭景分晖，垂光降席。 再拜。 谨奉请太平下教二十四高真人，一合留神应感，布大慈悲，念彼有心，同尘接世，分晖列照，垂光降席。 再拜。 谨奉请北斗七星真君、辅弼真宰、仙灵骑从，一合驭景分晖，垂光降席。 再拜。 谨奉请六甲所领六旬真神、六丁玉女、符吏从官、直日直符、十二守士，并临降醮席。 再拜。 谨奉请西岳君，及飞天丈人、太一中黄、玄上玉童、虎王李君、猛兽先生，一合来下，降临醮席。",
      "translated_text": "Long kneeling, striking the teeth twenty-four times.\n\nI now properly summon from within my body:\n- The **Five-Bodied True Officials** (五体真官),\n- **Supreme Celestial and Supreme Spirit** (上仙上灵),\n- **Directing Functionaries** (直使功曹) and **Rectified Unity Functionaries** (正一功曹),\n- Left and Right Official Messengers (左右官使者),\n- **Yin-Yang Divine Decision Clerks** (阴阳神决吏),\n- **Science-Carriage Red-Symbol Clerks** (科车赤符吏),\n- **Firm-Wind Cavalry Stationed at Relay Posts** (刚风骑置驿马),\n- **Petitioning Officials** (上章吏官), each two in number;\n\n- From within my body:\n  - **Void-Nothingness Natural Left and Right Attendants** (虚无自然左右侍郎),\n  - **Chaos-Jade Emperor, Supreme True One** (混沌玉帝太真),\n  - Left and Right **Leading Celestial Jade Lads** (左右领仙玉郎),\n  - **Nine Mysterious Supreme Void Functionaries** (九玄上虚功曹),\n  - **Three Primordial Functionaries** (三元功曹), each twenty-four in number;\n\n- **Upper Clarity Jade Void Messengers** (上清玉虚使者),\n- **Divine Immortal Messengers** (神仙使者),\n- **Great Mountain Messengers** (太山使者),\n- **Golden Dawn Jade Lads** (金晨玉童),\n- **Great Hua Jade Maidens** (太华玉女),\n- Left and Right **Spiritual Flyers** (左右灵飞),\n- **Jade Void Attendants** (玉虚侍郎), each twenty-four in number;\n\n- The **Five Emperors** (五帝),\n- **Primordial Sovereign** (元皇),\n- **Supreme True One** (太真), each nine thousand in number;\n\n- **Heaven-Patrolling Auxiliary Immortal Cavalry** (检天辅仙骑),\n- **Auxiliary True Cavalry** (辅真骑),\n- **Auxiliary Spirit Cavalry** (辅神骑),\n- **Auxiliary Imperial Cavalry** (辅帝骑),\n- **Auxiliary Spirit Cavalry** (辅灵骑), each nine hundred million in number;\n\n- **Five Emperors’ Flying Wheel Sky-Striding Cavalry** (五帝飞轮策空骑),\n- **Five Emperors’ Flying Immortal Sky-Soaring Cavalry** (五帝飞仙腾空骑), each nine hundred million in number;\n\n- **Nine-Heaven Flying Jade Feathered Canopy Cavalry** (九天飞琼羽盖骑),\n- **Flying Axle Green Paired Cavalry** (飞辕绿骈骑),\n- **Earth-Conquering Dragon-Soaring Cavalry** (制地龙腾骑), each nine hundred million in number;\n\n- **Natural Spirit-Summoning Longevity-Generating Bamboo Immortal Clerks** (自然招真生芝玉仙吏),\n- **Spirit-Summoning Longevity-Generating Bamboo Immortal Clerks** (招神生芝玉仙吏),\n- **Divine Pill Longevity-Generating Bamboo Immortal Clerks** (神丹生芝玉仙吏), each nine hundred million in number;\n\n- **Golden True Radiant-Thunder Cavalry** (金真辉电骑),\n- **Yang Essence Cloud-Stirring Rain-Descending Cavalry** (阳精兴云降雨骑),\n- **Yin Essence Cloud-Stirring Rain-Descending Cavalry** (阴精兴云降雨骑),\n- **Yang Clarity Illuminating Radiance Thunder-Chasing Cavalry** (阳明照曜逐电骑),\n- **Cloud Gate Scepter-Wielding Golden Radiance Cavalry** (云门执节金光骑), each nine hundred million in number;\n\n- From within my body:\n  - **Numinous Treasure Cavernous Mysterious Three Departments Eight Scenes Celestial Inner-Sound Divine Immortals** (灵宝洞玄三部八景诸天内音神仙),\n  - **Embroidered-Robe Jade Maidens** (绣衣玉女),\n  - **Five Emperors’ Direct Talismans** (五帝直符),\n  - **Messengers of Transmission and Petition** (传言奏事),\n  - **Sun, Moon, and Star Hosts** (日月星宿),\n  - **Five Emperors’ Official Retinue** (五帝官属),\n  - **Divine Dragon Cavalry** (神龙骑),\n  - **Flying Dragon Cavalry** (飞龙骑),\n  - **Relay Dragon Cavalry** (驿龙骑),\n  - **Cloud Dragon Cavalry** (云龙骑), all properly arrayed in ceremonial attire and insignia, their majesty aligned, standing before me.\n\nThey proclaim and command the **Eight Directions, Celestial, Earthly, and Water Officials, Five Sacred Mountains and Four Great Rivers, Nine Rivers and Eight Poles, Famous Mountains and Marshes, Five Emperors’ True Officials, Four Departments of Inspection, Nine Divisions of Examination, Primordial Four Beginnings, and the Officers of the Sixty-Four Hexagrams**, as well as the **Boundless and Infinite, High and Low, Profound and Bright, Deep and Shallow, Innumerable True Officials**, who govern the **Qi of the Primordial Sovereign, Nine Palaces and Eight Diagrams, Six Hexagrams Direct Talismans, Void-Nothingness Direct Matters, Five Sacred Mountains’ Flying Immortals, and Divine Dragon Feathered Cavalry**, all to open the gate.\n\nThey report to me that in the year **blank**, month **blank**, day **blank**, I presented myself before **Master So-and-So of the Upper Clarity Great Cavern** (上清大洞法师某君), where I received the **Complete Dao of Immortal Spirits, Upper Clarity Immortal Registers, Numinous Treasure True Scriptures, Eight Scenes Five Methods, Six Hexagrams Secret Talismans, Western Sacred Mountain, Five Sacred Mountains True Immortal Registers, Three Sovereigns Five Emperors Divine Talismans, Nine-Heaven Phoenix Qi Rectified Dao Registers, Golden God Tiger Talisman, and the Seven Primordial Spirits’ Liberation**, returning in the vehicle of the Dao, donning the form of the body, preserving and nurturing the offerings, and on the auspicious day at the **Spirit Platform of the Certain Hall**, I set up a modest **rites of purification**, presenting my sincerity and offerings, to contract with the **True Spirits of the Three Realms’ Officials**, who with my body’s **Five-Bodied Thirty-Six Thousand Divine Clerks** divide form and merge shadows, guarding the platform, eliminating demonic influences, and ensuring solemnity without disorder, so that my petition may be heard and granted.\n\n**Sixth Invocation of Official Summoning** (请官启事第六):\nFrom this point onward, all readings must be spoken in a level, low voice. At every double kneeling, pause for a long time, and do not speak loudly.\n\nA disciple of the **Upper Clarity Mysterious Capital Great Cavern Three Scenes** (上清玄都大洞三景弟子), **Mr. So-and-So of Certain Sacred Mountain** (某岳先生), **Small Fate True Person of Certain Emperor** (某帝小兆真人), kneels twice and requests the officials.\n\nI now properly summon:\n- The **Twenty-Four High True Ones of the Supreme Sovereign** (上皇二十四高真),\n- **Jade Clarity Purple Void Supreme Primordial Dao Sovereign** (玉清紫虚高上元皇道君), along with all divine immortals, jade lads, and jade maidens, to unite in riding the clouds and mastering the qi, responding to the scene and descending their light upon the purification rites.\n\nDouble kneeling.\n\nI now properly summon:\n- The **Three-Heaven Rectified Dao Three Primordial Great Sovereigns** (三天正法三元大君),\n- **Luminous Micro Heavenly Capital Primordial Sovereign True Sovereign** (太微灵都元皇真君),\n- **Divine Immortal Elders** (神仙丈人),\n- Jade lads and maidens,\n- **Sixty-Three Departments of Spirit Official True Persons** (六十三部灵官真人), to unite in responding to the scene, mastering the qi, and riding the clouds, soaring through the sky and descending their light upon the purification rites.\n\nDouble kneeling.\n\nI now properly summon:\n- **Supreme Clarity High Immortals** (太清高仙),\n- **Scene-Cloud True Persons** (景云真人),\n- **Supreme Elders** (太上丈人),\n- **Supreme Sovereign Lords** (上皇君),\n- **Nine-Hua Supreme Emperors** (九华太帝),\n- **Mysterious Yellow Jade Maidens** (玄黄玉女), to unite in dispersing their essence and scattering their qi, responding to sensations and adapting to circumstances, driving the scene and communicating with spirits, riding the light and descending to the rites.\n\nDouble kneeling.\n\nI now properly summon:\n- The **Left and Right Spirit Flyers of the Jade Palace** (琼宫左右灵飞),\n- **True Lads and Divine Immortal Maidens**, to descend their light upon the rites.\n\nDouble kneeling.\n\nI now properly summon:\n- **River Diagram Grand Marshal** (河图太尉),\n- **Nine Dawn Lords of the Jade Emperor’s Palace** (玉帝府九晨君),\n- **True Sovereign Consorts** (真皇夫人),\n- **Divine Messengers** (诸灵官使者),\n- Jade lads and maidens, to unite in mastering the scene and dividing their radiance, descending their light upon the rites.\n\nDouble kneeling.\n\nI now properly summon:\n- The **Twenty-Four High True Persons of the Great Peace Teaching** (太平下教二十四高真人), to unite in dwelling upon their spirits and responding to sensations, spreading great compassion and mercy, pondering those with intent, and descending their radiance in orderly succession upon the rites.\n\nDouble kneeling.\n\nI now properly summon:\n- The **Seven Stars of the Northern Dipper True Sovereigns** (北斗七星真君),\n- **Auxiliary and Rectifying True Rulers** (辅弼真宰),\n- **Immortal Spirit Cavalry Escorts**, to unite in mastering the scene and dividing their radiance, descending their light upon the rites.\n\nDouble kneeling.\n\nI now properly summon:\n- The **Six Hexagrams’ Leading Sixty-Day True Gods** (六甲所领六旬真神),\n- **Six Ding Jade Maidens** (六丁玉女),\n- **Talisman Clerks and Directing Officials** (符吏从官),\n- **Direct Day Direct Talismans** (直日直符),\n- **Twelve Guards**, all to descend and attend the purification rites.\n\nDouble kneeling.\n\nI now properly summon:\n- **Lord of the Western Sacred Mountain** (西岳君), along with:\n  - **Flying Heavenly Elders** (飞天丈人),\n  - **Supreme One of the Central Yellow** (太一中黄),\n  - **Mysterious Supreme Jade Lads** (玄上玉童),\n  - **Tiger King Li** (虎王李君),\n  - **Fierce Beast Masters** (猛兽先生), to unite in descending and attending the purification rites.",
      "overlap_context": "正神).\nI now properly burn incense and establish the **rites of purification** (设醮),\nwishing the **Ten Directions’ True Gods of the Three Talents** (十方正真生炁) to descend and flow into my body,\nso that all that is summoned may swiftly reach and directly ascend to the **Jade Emperor of the Three Pure Ones** (三清玉帝) at the **True Virtue’s few** (至真几) before me.\nNext, I present the **Supplication of Appeal** (上奏按香),\nand all the officials bow twice (再拜).*\n\nThen the **Fifth Invocation** (出灵官第五) is chanted.",
      "start_char": 1991,
      "end_char": 3252,
      "start_sentence": 101,
      "end_sentence": 132,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 45.618557929992676,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\醮三洞真文五法正一盟威箓立成仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "再拜。 谨奉请五岳君、佐命潜霍储君、青城丈人、庐山使者，及当境山川真灵，并降临醮席。 再　　拜。 谨奉请天皇天一君、地皇太一君、人皇玄一君、真灵骑从，并降临醮席。 再拜。 谨奉请人乌山形、真灵骑从，一合来下，降临醮席。 再拜。 谨奉请东方灵威仰苍帝君、青牙九炁天君、太上真王、青腰玉女、东乡诸灵官，并临醮席。 再拜。 谨奉请南方赤熛弩赤帝君、朱丹三炁天君、元炁丈人、朱宫太丹玉女、南乡诸灵官，并临醮席。 再拜。 谨奉请中央含枢纽黄帝君、太帝真人、子丹黄庭戊己天苍玉女、中央太帝灵官，并临醮席。 再拜。 谨奉请西方曜伯宝白帝君、明石七炁天君、元炁丈人、太上白素玉女、西乡诸灵官，并临醮席。 再拜。 谨奉请北方隐侯局黑帝君、玄滋五炁天君、太上灵君、夜光玉女、北乡诸灵官，并临醮席。 再拜。 谨奉请夏帝君、五岳灵山真人、江河四渎、三官九府诸灵官、地仙玉女、五岳飞仙诸仙官，并临醮席。 再拜。 谨奉请斗宫诸真人、玉童玉女、高仙神官，服紫翠十华之帔、云锦凤罗之裙，右佩虎章，左带龙剑，御碧林之辇，乘三素之云，垂光回眄，曲赐下临。 再拜。 谨奉请左上仙蔽身大将军一人，姓唐，名宏，字文明。 赤积朱衣大冠，左手执节，右手持符。 佩剑兵士三千万众，下临醮席。 再拜。 谨奉请右上灵隐形大将军一人，姓葛，名雍，字文度。 赤帻朱衣大冠，左手执戟，右手持符。 佩剑兵士三千万众，下临醮席。 再拜。 谨奉请中上神藏影大将军一人，姓周，名武，字文刚。 赤帻朱衣大冠，左手执节，右手持符。 佩剑兵士三千万众，下临醮席。 再拜。 谨奉请臣身中所佩太上正一童子一将军箓，箓中正一功曹使者、仙童侍从，降临醮席。 谨奉请臣身中所佩太上正一童子十将军箓，箓中功曹使者、郎吏虎贲等，降临醮席。 谨奉请臣身中所佩太上正一上仙上灵百五十将军箓，箓中功曹使者、将军吏兵，降临醮席。 谨奉请臣身中所佩太上赤天三部唐将军、葛将军、周将军，并侍从兵吏，各三千万众，严装盛服，降临醮席。 谨奉请臣身中所佩太上上灵百鬼召箓，箓中功曹使者、将军吏兵，降临醮席。 谨奉请臣身中所佩太上元命混沌赤箓，箓中功曹使者、仙人玉女、将军吏兵，降临醮席。 谨奉请臣身中所佩太上三五上仙百鬼召箓，箓中将军吏兵，降临醮席。 谨奉请臣身中所佩太上九州社令箓，箓中功曹使者，将军吏兵，降临醮席。 再拜。 谨奉请臣身中所佩太上三五星刚五斗箓，箓中功曹使者、魁罡斗步、将军吏兵，降临醮席。 谨奉请臣身中所佩太上河图宝箓，箓中功曹使者、仙童玉女，降临醮席。 谨奉请臣身中所佩太上解六害神符箓，箓中真官，解刑却害，将军吏兵等，降临醮席。 谨奉请臣身中所佩太上九凤破秽箓，箓中五方破秽将军吏兵，降临醮席。 谨奉请臣身中所佩太上都章毕印箓，箓中真神、功曹使者、仙童玉女，降临醮席。 谨奉请臣身中所佩太上斩邪华盖箓，箓中功曹使者、将军吏兵，降临醮席。 谨奉请臣身中所佩太上九天兵符箓，箓中统领九天神君、将军吏兵，降临醮席。 谨奉请臣身中所佩太上九宫捍厄箓，箓中诸官、却厄君、将军吏兵，降临醮席。",
      "translated_text": "Double kneeling.\n\nI now properly summon:\n- **Five Sacred Peaks Sovereigns** (五岳君),\n- **Assisting-Life Concealed Marshal Sovereigns** (佐命潜霍储君),\n- **Green City Elders** (青城丈人),\n- **Lushan Envoys** (庐山使者),\nand the **local mountain and river true spirits** (当境山川真灵),\nall to descend and attend the purification rites.\nDouble kneeling.\n\nI now properly summon:\n- **Celestial Sovereign of Heavenly Emperor** (天皇天一君),\n- **Earthly Sovereign of Great One** (地皇太一君),\n- **Human Sovereign of Mysterious One** (人皇玄一君),\nand their **Spirit Cavalry Escorts** (真灵骑从),\nall to descend and attend the purification rites.\nDouble kneeling.\n\nI now properly summon:\n- **Human-Wu Mountain Form** (人乌山形),\nand its **Spirit Cavalry Escorts** (真灵骑从),\nto unite in descending and attend the purification rites.\nDouble kneeling.\n\nI now properly summon:\n- **Eastern Sovereign of Soul-Striking Azure Emperor** (东方灵威仰苍帝君),\n- **Sovereign of Green-Fangled Nine Qi Heavenly Lord** (青牙九炁天君),\n- **Supreme True King** (太上真王),\n- **Green-Waisted Jade Maidens** (青腰玉女),\nand the **Eastern Suburb Spirits Officials** (东乡诸灵官),\nall to attend the purification rites.\nDouble kneeling.\n\nI now properly summon:\n- **Southern Sovereign of Vermilion Scorching Vermilion Emperor** (南方赤熛弩赤帝君),\n- **Sovereign of Crimson-Dan Three Qi Heavenly Lord** (朱丹三炁天君),\n- **Primordial Qi Elders** (元炁丈人),\n- **Crimson Palace Supreme Crimson Jade Maidens** (朱宫太丹玉女),\nand the **Southern Suburb Spirits Officials** (南乡诸灵官),\nall to attend the purification rites.\nDouble kneeling.\n\nI now properly summon:\n- **Central Sovereign of Containing-Pivot Yellow Emperor** (中央含枢纽黄帝君),\n- **Supreme True Person** (太帝真人),\n- **Child-Dan Yellow Court Wu-Ji Heavenly Azure Jade Maidens** (子丹黄庭戊己天苍玉女),\nand the **Central Supreme Sovereign Spirits Officials** (中央太帝灵官),\nall to attend the purification rites.\nDouble kneeling.\n\nI now properly summon:\n- **Western Sovereign of Radiant Marshal Precious White Emperor** (西方曜伯宝白帝君),\n- **Sovereign of Illuminous Stone Seven Qi Heavenly Lord** (明石七炁天君),\n- **Primordial Qi Elders** (元炁丈人),\n- **Supreme White Pure Jade Maidens** (太上白素玉女),\nand the **Western Suburb Spirits Officials** (西乡诸灵官),\nall to attend the purification rites.\nDouble kneeling.\n\nI now properly summon:\n- **Northern Sovereign of Concealed Marquis Black Emperor** (北方隐侯局黑帝君),\n- **Sovereign of Mysterious Nourishing Five Qi Heavenly Lord** (玄滋五炁天君),\n- **Supreme Spirit Sovereign** (太上灵君),\n- **Night-Light Jade Maidens** (夜光玉女),\nand the **Northern Suburb Spirits Officials** (北乡诸灵官),\nall to attend the purification rites.\nDouble kneeling.\n\nI now properly summon:\n- **Sovereign of Xia Emperor** (夏帝君),\n- **Five Sacred Peaks Spirit Mountain True Persons** (五岳灵山真人),\n- **Yangtze and Yellow Rivers, Four Seas** (江河四渎),\n- **Three Officials, Nine Ministries Spirits Officials** (三官九府诸灵官),\n- **Earthly Immortals Jade Maidens** (地仙玉女),\nand the **Five Sacred Peaks Flying Immortals Spirits Officials** (五岳飞仙诸仙官),\nall to attend the purification rites.\nDouble kneeling.\n\nI now properly summon:\n- **Fighting Constellation True Persons** (斗宫诸真人),\n- **Jade Boys and Jade Maidens** (玉童玉女),\n- **High Immortal Spirit Officials** (高仙神官),\nadorned in **purple and emerald ten-petal robes** (紫翠十华之帔) and **cloud-brocade phoenix-patterned skirts** (云锦凤罗之裙),\nwith **Tiger Talisman** (虎章) at their right and **Dragon Saber** (龙剑) at their left,\nriding **Azure Forest Palanquins** (碧林之辇) and **Triple White Clouds** (三素之云),\ncasting their radiance and gazing back,\nto gracefully descend and attend the purification rites.\nDouble kneeling.\n\nI now properly summon:\n- **Left Upper Celestial Concealing-Body Great General** (左上仙蔽身大将军), one named **Tang Hong** (姓唐，名宏，字文明),\nwearing **crimson piled-up robes and great cap** (赤积朱衣大冠),\nholding a **scepter in the left hand** (左手执节) and a **talisman in the right** (右手持符),\nwith **three hundred million sword-wielding soldiers** (佩剑兵士三千万众),\nto descend and attend the purification rites.\nDouble kneeling.\n\nI now properly summon:\n- **Right Upper Spirit-Concealing Great General** (右上灵隐形大将军), one named **Ge Yong** (姓葛，名雍，字文度),\nwearing **crimson headband and piled-up robes with great cap** (赤帻朱衣大冠),\nholding a **halberd in the left hand** (左手执戟) and a **talisman in the right** (右手持符),\nwith **three hundred million sword-wielding soldiers** (佩剑兵士三千万众),\nto descend and attend the purification rites.\nDouble kneeling.\n\nI now properly summon:\n- **Central Upper Divine-Hidden Great General** (中上神藏影大将军), one named **Zhou Wu** (姓周，名武，字文刚),\nwearing **crimson headband and piled-up robes with great cap** (赤帻朱衣大冠),\nholding a **scepter in the left hand** (左手执节) and a **talisman in the right** (右手持符),\nwith **three hundred million sword-wielding soldiers** (佩剑兵士三千万众),\nto descend and attend the purification rites.\nDouble kneeling.\n\nI now properly summon:\n- The **Too-Upper Supreme Orthodoxy Child General Talisman** (太上正一童子一将军箓) and its **Orthodoxy Functionary Envoys** (箓中正一功曹使者) and **Immortal Boy Attendants** (仙童侍从),\nto descend and attend the purification rites.\n\nI now properly summon:\n- The **Too-Upper Supreme Orthodoxy Child Ten Generals Talisman** (太上正一童子十将军箓) and its **Functionary Envoys** (功曹使者), **Officials and Tiger Guards** (郎吏虎贲等),\nto descend and attend the purification rites.\n\nI now properly summon:\n- The **Too-Upper Supreme Immortal One Hundred Fifty Generals Talisman** (太上正一上仙上灵百五十将军箓) and its **Functionary Envoys** (功曹使者), **General Officials and Soldiers** (将军吏兵),\nto descend and attend the purification rites.\n\nI now properly summon:\n- The **Too-Upper Three Celestial Departments Tang General, Ge General, Zhou General** (太上赤天三部唐将军、葛将军、周将军) and their **Attendant Soldiers and Officials** (并侍从兵吏), each with **three hundred million troops** (各三千万众), in **solemn attire and splendid garments** (严装盛服),\nto descend and attend the purification rites.\n\nI now properly summon:\n- The **Too-Upper Supreme Spirit One Hundred Ghosts Summoning Talisman** (太上上灵百鬼召箓) and its **Functionary Envoys** (功曹使者), **General Officials and Soldiers** (将军吏兵),\nto descend and attend the purification rites.\n\nI now properly summon:\n- The **Too-Upper Primordial Command Chaos Red Talisman** (太上元命混沌赤箓) and its **Functionary Envoys** (功曹使者), **Immortal Boys, Jade Maidens, General Officials and Soldiers** (仙人玉女、将军吏兵),\nto descend and attend the purification rites.\n\nI now properly summon:\n- The **Too-Upper Three-Five Immortals One Hundred Ghosts Summoning Talisman** (太上三五上仙百鬼召箓) and its **General Officials and Soldiers** (将军吏兵),\nto descend and attend the purification rites.\n\nI now properly summon:\n- The **Too-Upper Nine Regions Community Command Talisman** (太上九州社令箓) and its **Functionary Envoys** (功曹使者), **General Officials and Soldiers** (将军吏兵),\nto descend and attend the purification rites.\nDouble kneeling.\n\nI now properly summon:\n- The **Too-Upper Three-Five Stars Just Five Battles Talisman** (太上三五星刚五斗箓) and its **Functionary Envoys** (功曹使者), **Polaris Guards and Battle Steps** (魁罡斗步), **General Officials and Soldiers** (将军吏兵),\nto descend and attend the purification rites.\n\nI now properly summon:\n- The **Too-Upper River Diagram Precious Talisman** (太上河图宝箓) and its **Functionary Envoys** (功曹使者), **Immortal Boys and Jade Maidens** (仙童玉女),\nto descend and attend the purification rites.\n\nI now properly summon:\n- The **Too-Upper Six Harm-Dispelling Divine Talisman** (太上解六害神符箓) and its **True Officials** (真官), who **dispel punishments and avert calamities** (解刑却害), **General Officials and Soldiers** (将军吏兵等),\nto descend and attend the purification rites.\n\nI now properly summon:\n- The **Too-Upper Nine Phoenixes Impurity-Breaking Talisman** (太上九凤破秽箓) and its **Five-Direction Impurity-Breaking General Officials and Soldiers** (五方破秽将军吏兵),\nto descend and attend the purification rites.\n\nI now properly summon:\n- The **Too-Upper Supreme Chapter Seal Talisman** (太上都章毕印箓) and its **True Gods** (真神), **Functionary Envoys** (功曹使者), **Immortal Boys and Jade Maidens** (仙童玉女),\nto descend and attend the purification rites.\n\nI now properly summon:\n- The **Too-Upper Evil-Beheading Canopy Talisman** (太上斩邪华盖箓) and its **Functionary Envoys** (功曹使者), **General Officials and Soldiers** (将军吏兵),\nto descend and attend the purification rites.\n\nI now properly summon:\n- The **Too-Upper Nine-Heavens Military Talisman** (太上九天兵符箓) and its **Commanding Nine-Heavens Spirit Sovereigns** (统领九天神君), **General Officials and Soldiers** (将军吏兵),\nto descend and attend the purification rites.\n\nI now properly summon:\n- The **Too-Upper Nine Palaces Disaster-Warding Talisman** (太上九宫捍厄箓) and its **Various Officials** (诸官), **Disaster-Averting Sovereigns** (却厄君), **General Officials and Soldiers** (将军吏兵),\nto descend and attend the purification rites.",
      "overlap_context": "ng Officials** (符吏从官),\n- **Direct Day Direct Talismans** (直日直符),\n- **Twelve Guards**, all to descend and attend the purification rites.\n\nDouble kneeling.\n\nI now properly summon:\n- **Lord of the Western Sacred Mountain** (西岳君), along with:\n  - **Flying Heavenly Elders** (飞天丈人),\n  - **Supreme One of the Central Yellow** (太一中黄),\n  - **Mysterious Supreme Jade Lads** (玄上玉童),\n  - **Tiger King Li** (虎王李君),\n  - **Fierce Beast Masters** (猛兽先生), to unite in descending and attending the purification rites.",
      "start_char": 3252,
      "end_char": 4540,
      "start_sentence": 133,
      "end_sentence": 182,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 28.850812196731567,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\醮三洞真文五法正一盟威箓立成仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "再拜。 谨奉请臣身中所佩太上八卦护身箓，箓中功曹、八方护身君、将军吏兵，降临醮席。 谨奉请臣身中所佩太上考召箓，箓中考召君、将吏、摄召灵官，降临醮席。 谨奉请臣身中所佩太上斩邪赤箓，箓中辟斥将军吏兵、斩邪灵官，降临醮席。 谨奉请臣身中所佩太上辟邪神箓，箓中功曹使者、将军吏兵，降临醮席。 谨奉请臣身中所佩太上四部禁炁箓，箓中禁炁将军、功曹吏兵，降临醮席。 谨奉请臣身中所佩太上大斩邪箓，箓中诛邪、断绝水府精邪、将军吏兵，降临醮席。 谨奉请臣身中所佩太上功曹箓，箓中功曹使者、仙童玉女、吏兵，降临醮席。 谨奉请臣身中所佩太上保命长生箓，箓中保命君吏，降临醮席。 再拜。 谨奉请太上三元大将军券契中贵神将吏，降临醮席。 再拜。 谨奉请阳平治都功治箓。 若不受都功，不请也。 言治典二十四治，治有二十四人，官有二十四职，职有二百四十军，军有二千四百将，将有二万四千吏，吏有二十四万兵，男官、女官、二十四官，男职、女职、二十四职，男气、女气、二十四气。 治中虎贲威仪铃下五百将，各二十四人。 治中校尉百二十人。 治中功曹二人。 治中主簿二人。 治中干佐十二人。 治中金刚童子十二人。 治中小吏十二人。 治中部章督邮十二人。 治中从事十二人。 治中使者士二人。 治中通章二人。 治中典治君十二人。 治中考召吏二十四人。 治中左右阴阳二十四生炁吏。 治中建节监功大将军二十四人。 治中前步效功吏二十四人。 治中后步效杀二十四人。 治中驿亭丞二十四人。 治中监章从事二人。 治中按章从事二人。 治中录章从事二人。 治中校章从事二人。 治中呈章从事二人。 治中铃下百鬼中王二十四人。 治中定章从事二人。 治中赍章从事二人。 治中御章从事二人。 谨奉请名山大泽守土真官、当界主司、虚空监察、四司五帝、应感真灵，各领分辉垂光，降临醮席。 再拜。 请众圣事毕，便伏想见真灵百匝千重、亿乘万骑，悉在坛所，各依位次，俨然陈列，灵真光辉焕耀，肃然在目。 前毕再拜。 次读词，词讫亦拜。 次称名位。",
      "translated_text": "I now properly summon with two bows:\n- The **Too-Upper Eight Trigrams Protective Body Talisman** (太上八卦护身箓), its **Functionary Envoys** (功曹), **Eight-Directional Protective Body Sovereigns** (八方护身君), and **General Officials and Soldiers** (将军吏兵),\nto descend and attend the purification rites.\n\nI now properly summon with two bows:\n- The **Too-Upper Examination and Conveyance Talisman** (太上考召箓), its **Examination and Conveyance Sovereigns** (考召君), **Generals and Officials** (将吏), and **Spirit Officials of the Conveyance** (摄召灵官),\nto descend and attend the purification rites.\n\nI now properly summon with two bows:\n- The **Too-Upper Evil-Beheading Crimson Talisman** (太上斩邪赤箓), its **Evil-Dispelling Generals and Officials** (辟斥将军吏兵) and **Evil-Beheading Spirit Officials** (斩邪灵官),\nto descend and attend the purification rites.\n\nI now properly summon with two bows:\n- The **Too-Upper Evil-Dispelling Spirit Talisman** (太上辟邪神箓), its **Functionary Envoys** (功曹使者), **General Officials and Soldiers** (将军吏兵),\nto descend and attend the purification rites.\n\nI now properly summon with two bows:\n- The **Too-Upper Four Divisions Restraining Qi Talisman** (太上四部禁炁箓), its **Restraining Qi Generals** (禁炁将军), **Functionary Envoys and Soldiers** (功曹吏兵),\nto descend and attend the purification rites.\n\nI now properly summon with two bows:\n- The **Too-Upper Great Evil-Beheading Talisman** (太上大斩邪箓), its **Evil-Punishing Sovereigns** (诛邪), **Severing and Cutting Off Water Realm Demonic Qi** (断绝水府精邪), and **General Officials and Soldiers** (将军吏兵),\nto descend and attend the purification rites.\n\nI now properly summon with two bows:\n- The **Too-Upper Functionary Envoys Talisman** (太上功曹箓), its **Functionary Envoys** (功曹使者), **Immortal Boys and Jade Maidens** (仙童玉女), and **Soldiers** (吏兵),\nto descend and attend the purification rites.\n\nI now properly summon with two bows:\n- The **Too-Upper Life-Preserving and Longevity Talisman** (太上保命长生箓), its **Life-Preserving Officials and Soldiers** (保命君吏),\nto descend and attend the purification rites.\n\nWith two bows, I now properly summon the **Noble Generals and Officials** (贵神将吏) of the **Too-Upper Three Elements Great General Contract** (太上三元大将军券契),\nto descend and attend the purification rites.\n\nWith two bows, I now properly summon the **Yangping Rectification of the Capital and Rectification Talisman** (阳平治都功治箓).\nIf the **Capital and Rectification** (都功) is not accepted, then I do not summon it.\n\nThe **Rectification Ritual** (治典) comprises **Twenty-Four Rectifications** (二十四治), each with **Twenty-Four Rectifiers** (二十四人), **Twenty-Four Officials** (二十四职), and each **Office** (职) commands **Two Hundred and Forty Soldiers** (二百四十军), each **Soldier** (军) has **Two Thousand and Forty Generals** (二千四百将), each **General** (将) commands **Twenty-Four Thousand Soldiers** (二万四千吏), and each **Soldier** (吏) commands **Twenty-Four Thousand Troops** (二十四万兵).\nThere are **Male Officials** (男官), **Female Officials** (女官), and **Twenty-Four Officials** (二十四官).\nThere are **Male Rectifiers** (男职), **Female Rectifiers** (女职), and **Twenty-Four Rectifiers** (二十四职).\nThere are **Male Qi** (男气), **Female Qi** (女气), and **Twenty-Four Qi** (二十四气).\n\nWithin each **Rectification** (治), there are **Five Hundred Generals** (五百将) beneath the **Tiger-Forces威仪** (虎贲威仪) bell, each with **Twenty-Four Rectifiers** (二十四人).\nWithin each **Rectification** (治), there are **One Hundred and Twenty Marshals** (校尉百二十人).\nWithin each **Rectification** (治), there are **Two Functionary Envoys** (功曹二人).\nWithin each **Rectification** (治), there are **Two Chief Clerks** (主簿二人).\nWithin each **Rectification** (治), there are **Twelve Assistants** (干佐十二人).\nWithin each **Rectification** (治), there are **Twelve Vajra Boy Attendants** (金刚童子十二人).\nWithin each **Rectification** (治), there are **Twelve Junior Clerks** (小吏十二人).\nWithin each **Rectification** (治), there are **Twelve Supervisory Officials of the Departmental Seal** (部章督邮十二人).\nWithin each **Rectification** (治), there are **Twelve Attendants** (从事十二人).\nWithin each **Rectification** (治), there are **Two Messengers** (使者士二人).\nWithin each **Rectification** (治), there are **Two Transmitters of the Departmental Seal** (通章二人).\nWithin each **Rectification** (治), there are **Twelve Rectification Sovereigns** (典治君十二人).\nWithin each **Rectification** (治), there are **Twenty-Four Examination and Conveyance Clerks** (考召吏二十四人).\nWithin each **Rectification** (治), there are **Twenty-Four Left and Right Yin-Yang Vitality Clerks** (左右阴阳二十四生炁吏).\nWithin each **Rectification** (治), there are **Twenty-Four Commanding Generals of the Battle Standard** (建节监功大将军二十四人).\nWithin each **Rectification** (治), there are **Twenty-Four Clerks of the Front Step** (前步效功吏二十四人).\nWithin each **Rectification** (治), there are **Twenty-Four Clerks of the Rear Step** (后步效杀二十四人).\nWithin each **Rectification** (治), there are **Twenty-Four Post Station Chiefs** (驿亭丞二十四人).\nWithin each **Rectification** (治), there are **Two Supervisory Attendants of the Seal** (监章从事二人).\nWithin each **Rectification** (治), there are **Two Attendants of the Seal** (按章从事二人).\nWithin each **Rectification** (治), there are **Two Recorders of the Seal** (录章从事二人).\nWithin each **Rectification** (治), there are **Two Inspectors of the Seal** (校章从事二人).\nWithin each **Rectification** (治), there are **Two Presenters of the Seal** (呈章从事二人).\nWithin each **Rectification** (治), there are **Twenty-Four Kings of the Hundred Ghosts** (铃下百鬼中王二十四人).\nWithin each **Rectification** (治), there are **Two Stabilizers of the Seal** (定章从事二人).\nWithin each **Rectification** (治), there are **Two Bearers of the Seal** (赍章从事二人).\nWithin each **Rectification** (治), there are **Two Guardians of the Seal** (御章从事二人).\n\nWith two bows, I now properly summon the **True Officials Guarding Sacred Mountains and Great Marshes** (名山大泽守土真官), the **Superintendents of the Current Realm** (当界主司), the **Supervisors of the Void** (虚空监察), the **Four Officials and Five Emperors** (四司五帝), and the **Responsive Spirits of True Essence** (应感真灵),\neach leading their respective luminous radiance and descending light (分辉垂光),\nto descend and attend the purification rites.\n\nWith two bows, I now properly conclude the summoning of all **Saints** (众圣).\nI now properly visualize the **True Essence Spirits** (真灵) in their myriad layers and countless ranks (百匝千重、亿乘万骑),\nall present at the altar (坛所),\neach according to their proper order and solemnly arrayed.\nThe **Spirits of True Essence** (灵真) shine with radiant splendor (光辉焕耀),\nstanding solemnly before my eyes (肃然在目).\n\nI now bow twice before proceeding.\n\nNext, I recite the **Words** (词), and upon completion, I bow twice again.\n\nNext, I properly declare the **Names and Positions** (名位).",
      "overlap_context": "tes.\n\nI now properly summon:\n- The **Too-Upper Nine-Heavens Military Talisman** (太上九天兵符箓) and its **Commanding Nine-Heavens Spirit Sovereigns** (统领九天神君), **General Officials and Soldiers** (将军吏兵),\nto descend and attend the purification rites.\n\nI now properly summon:\n- The **Too-Upper Nine Palaces Disaster-Warding Talisman** (太上九宫捍厄箓) and its **Various Officials** (诸官), **Disaster-Averting Sovereigns** (却厄君), **General Officials and Soldiers** (将军吏兵),\nto descend and attend the purification rites.",
      "start_char": 4540,
      "end_char": 5453,
      "start_sentence": 183,
      "end_sentence": 230,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 24.28143334388733,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\醮三洞真文五法正一盟威箓立成仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "上清玄都大洞三景弟子，奉行三洞醮法事某岳先生，某帝小兆真人臣某等，诚惶诚恐，谨叩头再拜，上启虚无自然元始天尊、无极大道太上老君、上相上宰、无极元君、太上玉晨高上道君、太微天帝君、后圣金阙帝君、玉皇二十四高真、玉清紫虚元皇道君、四辅上相上宰、东华方诸青童大君、三天正法三元君、太微灵都元皇真君、九天凤炁太清上仙、太上丈人、神仙丈人、玉童玉女、三台七元辅弼尊帝、神真上圣、上保南极紫元夫人、上傅太素真君、上宰西城总真王君、太极真人、南岳赤君、太平下教二十四真人、司命南岳魏夫人、紫微王夫人、九华安妃、太元真人、东卿司命茅君、清灵真人裴君、紫阳真人周君、仙侯侍帝晨、二许真人、司命杨君、句曲真人、定录右禁郎茅中君、三官保命司直茅小君、华阳洞府领括苍吴越生死罪福众真、三十六司命官君、河图九晨君、六甲诸灵官、西岳君、中黄太一君、五岳九山佐命君、三皇真君、无上元始太上大道君、五老上帝、至真大圣尊神、玄中大法师、道德众圣、天尊大帝、天帝玄一三真人、太上明威正一天尊、天师嗣师、系师、女师、三师门下典者君吏、上皇太上道君、太清玄元上三天无极大道太上老君、太上丈人、九老仙都君、九炁丈人等，百千万重道炁，千二百官君，太清玉陛下南上大道君、四方三界一切真灵、三洞典经玉郎、神仙官属，臣某七世积德，庆及今生，少怀慕道，心思妙法，洁志清严，归命师门，勤求俛仰，以诣某君门下，奉受宝经、天书、玉字、符图、要诀、内外治箓，佩服身形，存修供养，未契真灵。 以今吉日良会，沐浴熏修，敷陈法座，施设芳馔，启荐真灵。 伏惟大圣众尊，愿回云驾，俯垂采纳，鉴映凡情，省理所言，留恩降福。",
      "translated_text": "「The **Disciple of the Upper Clarity Primordial Great Cavern** (上清玄都大洞三景弟子),\nserving the **Three Caverns Ritual Method** (三洞醮法事),\nnow respectfully invokes the **Master of Certain Peak** (某岳先生),\nthe **Imperial Small Talisman Sage** (某帝小兆真人),\nand **Your Servants** (臣某等),\nwith utmost reverence and trembling fear (诚惶诚恐),\nnow humbly kneel and bow twice (谨叩头再拜),\nto address:\n\nThe **Primordial Sovereign of Natural Nothingness** (虚无自然元始天尊),\nthe **Supreme Old Master of the Boundless Dao** (无极大道太上老君),\nthe **Upper Marshal and Upper Minister** (上相上宰),\nthe **Primordial Sovereign of the Boundless** (无极元君),\nthe **Supreme High Daoist Lord of Jade Morn** (太上玉晨高上道君),\nthe **Celestial Sovereign of the Supreme Clarity** (太微天帝君),\nthe **Imperial Sovereign of the Golden Gate of the Posterior Sage** (后圣金阙帝君),\nthe **Twenty-Four High Sages of Jade Sovereignty** (玉皇二十四高真),\nthe **Primordial Sovereign of Jade Clarity and Purple Emptiness** (玉清紫虚元皇道君),\nthe **Four Aides and Upper Marshals and Ministers** (四辅上相上宰),\nthe **Great Lord of Eastern Flowery and the Azure Boys** (东华方诸青童大君),\nthe **Three Celestial Just Laws and Primordial Lords** (三天正法三元君),\nthe **Primordial Sovereign of the Supreme Clarity’s Spirit Cavern** (太微灵都元皇真君),\nthe **Supreme Sage of the Nine Celestial Phoenix Qi** (九天凤炁太清上仙),\nthe **Supreme Elder** (太上丈人),\nthe **Divine Elder** (神仙丈人),\nthe **Jade Boys and Jade Girls** (玉童玉女),\nthe **Sovereign Emperors of the Three Platforms and Seven Primordial Aides** (三台七元辅弼尊帝),\nthe **Divine and True Supreme Sage** (神真上圣),\nthe **Supreme Protector of the Southern Pole, Purple Primordial Lady** (上保南极紫元夫人),\nthe **Supreme Attendant, Most Pure Sage** (上傅太素真君),\nthe **Supreme True King of the Western City** (上宰西城总真王君),\nthe **True Person of the Supreme Extremity** (太极真人),\nthe **Red Sage of Southern Peak** (南岳赤君),\nthe **Twenty-Four True Persons of the Lower Teaching of Great Peace** (太平下教二十四真人),\nthe **Southern Peak Lady Wei, Attendant of Life** (司命南岳魏夫人),\nthe **Lady of Purple Micro, Attendant of Life** (紫微王夫人),\nthe **Peaceful Consort of Nine-Hua Peak** (九华安妃),\nthe **True Person of the Great Primordial** (太元真人),\nthe **Lord of the Eastern Court, Attendant of Life, Master Mao** (东卿司命茅君),\nthe **Pure-Spirit Sage, Master Pei** (清灵真人裴君),\nthe **True Person of Purple Yang, Master Zhou** (紫阳真人周君),\nthe **Morning Attendant of the Divine Consort** (仙侯侍帝晨),\nthe **Two True Persons of Master Xu** (二许真人),\nthe **Attendant of Life, Master Yang** (司命杨君),\nthe **True Person of the Curved Bend** (句曲真人),\nthe **Right Prohibition Officer of the Divine Record, Master Mao Zhongjun** (定录右禁郎茅中君),\nthe **Divine Record Officer of Life Preservation, Master Mao Xiaojun** (三官保命司直茅小君),\nthe **All True Spirits of the Hua Yang Cavern, overseeing the fate of life and death and fortune and misfortune in the vast regions of the Blue Brute and Wu Yue** (华阳洞府领括苍吴越生死罪福众真),\nthe **Thirty-Six Attendants of Life** (三十六司命官君),\nthe **Nine Morning Lords of the River Diagram** (河图九晨君),\nthe **All Spirit Officials of the Six Jia** (六甲诸灵官),\nthe **Lord of Western Peak** (西岳君),\nthe **Lord of the Central Yellow, Great Unity** (中黄太一君),\nthe **Five Peaks and Nine Mountains, Aiding the Mandate** (五岳九山佐命君),\nthe **Three Primordial Sovereigns** (三皇真君),\nthe **Supreme Primordial Sovereign of the Boundless Dao** (无上元始太上大道君),\nthe **Five Elders of the Supreme Deity** (五老上帝),\nthe **Most Venerable Great Sage of Ultimate Truth** (至真大圣尊神),\nthe **Supreme Master of the Mysterious Middle** (玄中大法师),\nthe **All Sages of Dao and Virtue** (道德众圣),\nthe **Great Celestial Sovereign** (天尊大帝),\nthe **Celestial Sovereign of the Three True Persons of the Supreme Unity** (天帝玄一三真人),\nthe **Supreme Sovereign of the Boundless Dao, Master of Clear Might** (太上明威正一天尊),\nthe **Heir to the Celestial Master, the Successor Master, the System Master, and the Female Master** (天师嗣师、系师、女师),\nand the **Gatekeepers under the Three Masters’ Gate** (三师门下典者君吏),\nas well as the **Supreme Daoist Sovereign** (上皇太上道君),\nthe **Supreme Primordial Lord of the Supreme Clarity** (太清玄元上三天无极大道太上老君),\nthe **Supreme Elder** (太上丈人),\nthe **Nine Elders of the Nine Qi** (九炁丈人),\nand the **Nine Elders of the Nine Celestial Caverns** (九老仙都君),\n\nwith **myriad layers and countless ranks of Dao-Qi** (百千万重道炁),\nand the **thousand and two hundred spirit officials** (千二百官君),\nthe **Supreme Daoist Lord of Jade Sovereignty in the Southern Upper Dao** (太清玉陛下南上大道君),\nand **all True Spirits of the Four Directions and Three Realms** (四方三界一切真灵),\nthe **Jade Boys of the Three Caverns Canon** (三洞典经玉郎),\nand the **Divine Officials of the Sages** (神仙官属),\n\nYour servant, **Certain** (臣某),\nthrough seven generations of accumulated **virtue** (积德),\nnow rejoices in this present life (庆及今生).\nFrom youth, I have aspired to the **Dao** (慕道),\nmy thoughts ever seeking the **wonderful methods** (妙法).\nWith a **pure and austere resolve** (洁志清严),\nI submit to the **Master’s Gate** (归命师门),\nand with **diligent reverence and humility** (勤求俛仰),\nI seek to attain the **door of Certain Lord** (以诣某君门下),\nto receive the **precious scriptures** (宝经),\n**celestial texts** (天书),\n**jade characters** (玉字),\n**talismans and diagrams** (符图),\n**essential keys** (要诀),\nand **inner and outer ritual ordinations** (内外治箓).\nI wear the **auspicious tokens** (佩服),\npreserve the **forms of the body** (身形),\nand diligently practice **offerings and nourishment** (供养),\nyet have not yet attained the **True Spirits** (未契真灵).\n\nOn this auspicious day and favorable occasion (今吉日良会),\nafter **bathing and purifying with incense** (沐浴熏修),\nI **spread out the ritual seat** (敷陈法座)\nand **offer fragrant delicacies** (施设芳馔),\nto **invite and present the True Spirits** (启荐真灵).\n\nI humbly pray that the **Venerable Sages** (大圣众尊),\nmay **return to their cloud-borne carriages** (回云驾),\nand **condescend to accept my offerings** (俯垂采纳),\nto **illuminate my mortal sentiments** (鉴映凡情),\nand **examine what I have spoken** (省理所言),\nthus **bestowing blessings and granting fortune** (留恩降福).",
      "overlap_context": "ts** (众圣).\nI now properly visualize the **True Essence Spirits** (真灵) in their myriad layers and countless ranks (百匝千重、亿乘万骑),\nall present at the altar (坛所),\neach according to their proper order and solemnly arrayed.\nThe **Spirits of True Essence** (灵真) shine with radiant splendor (光辉焕耀),\nstanding solemnly before my eyes (肃然在目).\n\nI now bow twice before proceeding.\n\nNext, I recite the **Words** (词), and upon completion, I bow twice again.\n\nNext, I properly declare the **Names and Positions** (名位).",
      "start_char": 5454,
      "end_char": 6129,
      "start_sentence": 231,
      "end_sentence": 233,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 23.777008056640625,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\醮三洞真文五法正一盟威箓立成仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "臣某稽首再拜。 三上香。 三上汤。 臣某谨重上启： 夫大道微妙，神用无方，吐纳阴阳，生成万物。 有形之类，皆是道生，长养成就，如母所受。 凡厥回向，莫不感通。 伏惟太上众尊，哀怜有心，赐见开悟。 若臣某上代七祖，有大罪，负越科禁，秽犯天地、日月星辰，或骂詈神鬼，指斥真灵，诽经谤道，抑弱欺贫，三业六根，骄慢四辈，杀生偷盗，万罪千愆。 启大宥之恩，普赐原赦臣某七祖父母，先化亡魂，永离幽牢，迁升福地，南宫受炼，仙化成人，高步九天，无为自在。 臣某宿根重积，固疾深灾，众病潜消，诸殃殄灭，凶谋恶逆，奸鬼邪神，一切消除，天禄永延，福乐无尽。 同师共法，及以姻宗，久视长生，巍巍贞吉。 乞臣某心灵朗悟，智慧圆通，真圣冥扶，神灵降接，良师善友，玉液金丹，必自相逢，不求而至，行道得道，求仙得仙，举意从心，万向皆遂。 臣某稽首再拜。 三上香。 三上汤。",
      "translated_text": "I, your humble servant, prostrate myself with two bows.\n**Three times offering incense.**\n**Three times offering water.**\n\nYour servant, with utmost reverence, now humbly presents this petition:\n\nThe Great Dao is subtle and wondrous,\nits divine functions boundless.\nIt inhales and exhales yin and yang,\ngiving birth and nurturing all things.\nAll beings with form\nare born of the Dao,\nnourished and perfected,\nas a mother bears her child.\nAll things that return to it\nare in communion with its power.\n\nI humbly pray to the Most High and the Venerable Sages,\nthat in their compassion for those with sincere hearts,\nthey grant me the blessing of enlightenment.\n\nIf my seven generations of ancestors\nhave committed great sins—\ntransgressing laws and taboos,\ndefiling heaven and earth, the sun, moon, and stars,\nor blaspheming gods and spirits,\nreviling the True Spirits,\nslandering scriptures and the Dao,\noppressing the weak and deceiving the poor,\ntheir threefold karma and six senses\nfilled with arrogance and disrespect toward elders,\ncommitting murder and theft,\ncountless crimes and offenses—\nI beseech the boundless mercy of the Great Forgiveness,\nthat all seven generations of my ancestors,\ntheir souls now transformed,\nmay be universally pardoned,\nfreed from the nether realms,\ntranscending to blessed lands,\nrefining in the Southern Palace,\nachieving Daoist perfection,\nascending to the Nine Heavens,\nand dwelling in effortless freedom.\n\nMy own deep-rooted karma has brought me grave illness and misfortune,\nyet my diseases fade unseen,\nall calamities vanish,\nevil schemes and malevolent spirits,\nall banished—\nmy celestial blessings everlasting,\njoy and fortune boundless.\n\nTogether with my master and fellow practitioners,\nand my kin and relatives,\nmay we all attain longevity,\nour lives steadfast and auspicious.\n\nI pray that my heart may be illuminated with clarity,\nmy wisdom perfected and boundless,\nthat the True Saints may secretly guide me,\nthe spirits descend to meet me,\nthat noble teachers and kindred friends\nwill appear without seeking,\nthat elixirs of jade and gold\nwill come naturally,\nthat the Way may be practiced and attained,\nthat immortality may be sought and found,\nthat my intentions align with my heart,\nand all my endeavors succeed.\n\nI, your servant, prostrate myself with two bows.\n**Three times offering incense.**\n**Three times offering water.**",
      "overlap_context": "on (今吉日良会),\nafter **bathing and purifying with incense** (沐浴熏修),\nI **spread out the ritual seat** (敷陈法座)\nand **offer fragrant delicacies** (施设芳馔),\nto **invite and present the True Spirits** (启荐真灵).\n\nI humbly pray that the **Venerable Sages** (大圣众尊),\nmay **return to their cloud-borne carriages** (回云驾),\nand **condescend to accept my offerings** (俯垂采纳),\nto **illuminate my mortal sentiments** (鉴映凡情),\nand **examine what I have spoken** (省理所言),\nthus **bestowing blessings and granting fortune** (留恩降福).",
      "start_char": 6129,
      "end_char": 6502,
      "start_sentence": 234,
      "end_sentence": 249,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 6.0493714809417725,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\醮三洞真文五法正一盟威箓立成仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "臣某谨重上启高灵众尊、上圣尊神、三洞神真、四司五帝，臣某有幸，宿世恩深，九天之劫，转及今身，值遇明运，道法流行，得以秽质参染灵文、高上秘箓、三洞符图宝章。 自叨窃以来，尊仰上真，心希神仙，而精诚浅末，未能感灵，常恐罪身沉倾臭秽，沦没九泉。 天慈广大，展其功效，心守诚信，志度无穷。 今日上告，万愿开陈，清心启谢，披露宿新。 伏愿上圣高尊、诸君丈人、至真天尊，曲降卑贱，诚惭诚恐，不敢自宁，天光遐照，无幽不鉴，披心上启，敢奉以闻，乞真符宝箓、神灵侍卫，营护臣身登山涉险，出入林涧，所求所向，皆得如言。 金石开通，神明交会，万愿从心。 采服芝药，不得隐藏。 山精伏匿，万试不干。 虎狼毒虫，令不加身。 仙童玉女，给侍东西。 万神灵炁，降入身形，安镇五脏，内外聪明，心开意悟，逆知吉凶，三尸消灭，九虫不生，身有奇毛，早得神仙。 惟蒙高尊大帝真人，降福垂恩，流下众庶，赐如所陈，不胜洪泽，辄以自效。 臣某诚惶诚恐，稽首再拜。 三上香。 三上汤",
      "translated_text": "Your servant, **prostrate with two bows**, respectfully and solemnly presents this petition to the Most Exalted and Revered Celestial Worthies, the Most Venerable and Divine Saints, the Three Caverns of Divine Truth, and the Four Directors and Five Emperors.\n\nBy the grace of fate, the deep kindness of past lives has endured, and through the nine heavens’ calamities, its blessings now extend to this humble body. Encountering the auspicious era of the Way’s flourishing, I have been granted the opportunity to partake in the sacred texts, the lofty and secret scriptures, and the talismans and diagrams of the Three Caverns.\n\nSince my first, unworthy contact with these teachings, I have revered the Most High and True Ones, my heart yearning for the divine, yet my devotion remains shallow and insufficient. I fear not being able to move the spirits, and thus dread that my sinful self may sink into filth and decay, lost forever in the nine depths.\n\nBut the Heavenly Mercy is vast and boundless, its efficacy ever-present. With a heart steadfast in sincerity and a will of infinite resolve, I now humbly lay forth my ten thousand wishes, my mind clear and my gratitude sincere, revealing both old and new vows.\n\nI pray that the Most Venerable and Exalted Saints, the Noble Masters, and the Most True Heavenly Worthies may, in their infinite grace, look down upon this lowly one. I am deeply ashamed and fearful, not daring to rest in ease, for the Heavenly Light shines far and wide, illuminating even the most hidden places. With my heart laid bare, I present this petition, boldly offering it for your consideration.\n\nI beg for the talismans and sacred scriptures of the True Ones, and for divine spirits to guard and protect me, that I may ascend mountains and traverse dangers, move through forests and ravines, and that all my requests and aspirations may be fulfilled as I speak.\n\nMay the Way’s mysteries be revealed, and the divine intelligences converge; may my ten thousand wishes be realized in my heart.\n\nLet me gather the elixir herbs and medicines without concealment.\nLet mountain spirits submit and hide themselves, never interfering in my trials.\nLet poisonous beasts and venomous creatures never harm this body.\nLet celestial youths and jade maidens attend me, east and west.\n\nMay all the spirits of **qi** descend into my form, calming the five viscera, granting clarity within and without, opening my mind and awakening my understanding, enabling me to foresee fortune and misfortune, and may the Three Corpses be banished, the Nine Parasites never take root. May my body bear divine markings, and I soon attain the state of the **Saints**.\n\nOnly through the grace of the Most Exalted and Great Emperors and True Worthies, who bestow blessings and mercy, may their favor flow down to all the common folk, granting me the fulfillment of my prayers. I am overwhelmed by their boundless kindness and will strive to repay it.\n\nYour servant, **prostrate with two bows**, is sincerely awestruck and trembling.\n\n**Three times offering incense.**\n**Three times offering water.**",
      "overlap_context": " wisdom perfected and boundless,\nthat the True Saints may secretly guide me,\nthe spirits descend to meet me,\nthat noble teachers and kindred friends\nwill appear without seeking,\nthat elixirs of jade and gold\nwill come naturally,\nthat the Way may be practiced and attained,\nthat immortality may be sought and found,\nthat my intentions align with my heart,\nand all my endeavors succeed.\n\nI, your servant, prostrate myself with two bows.\n**Three times offering incense.**\n**Three times offering water.**",
      "start_char": 6503,
      "end_char": 6915,
      "start_sentence": 250,
      "end_sentence": 264,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 8.313111305236816,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\醮三洞真文五法正一盟威箓立成仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "送神真第七 臣某启： 上劳尊灵，下降凡秽，加以食膳寡薄，词理庸拙，久稽真仪，罪当万责。 今云车已整，里路方披，仰劳尊神还登金阙。 臣某不逮，愿赐开宥升车之恩，伏希罔极。 臣某诚惶诚恐，稽首再拜。 四散香汤及醮胙，收法箓及位版，然勑小神吏。 勑小吏神第八 夫上下尊卑，人神共轨，不可谬滥，须依次序。 今尊神既升，诸有营护侍卫土地真官、及身中兵吏，主掌符图，位卑职小，未预法座之者，请各配位，依其上下，受臣某言启。 上香。 上汤。",
      "translated_text": "**Ritual for Escorting the True Spirit (7th True Ritual)**\n\nYour servant, **prostrate with two bows**, humbly states:\nThe Most Exalted Spirit has labored to descend from the heights and enter the profane realm below, yet has been burdened by my meager offerings of food and drink, and my crude words and simple reasoning. I have long delayed the True Ritual’s observance, and my guilt is boundless.\n\nNow the **cloud-chariot** is prepared, and the path has been cleared. I pray that the Most Exalted Spirit may return and ascend to the **Golden Gate**.\n\nUnworthy as I am, I beg for the grace to be permitted to ride the chariot and ascend. I humbly await Your boundless mercy.\n\nYour servant, **sincerely awestruck and trembling**, **prostrates with two bows**.\n\n**Four times offering incense and water, and presenting the sacrificial offerings of the jiao ritual.**\n**Collecting the dharma talismans and position tablets, then commanding the minor spirit officials.**\n\n**Commanding the Minor Spirit Officials (8th True Ritual)**\n\nThe hierarchy of high and low, the order of human and divine—all must follow proper paths, without error or excess. The sequence must be respected.\n\nNow that the Most Exalted Spirit has ascended, all those who tend, guard, and serve—including the **True Officials of the Land** and the **soldiers and officers within my body**, who wield talismans and diagrams—though their ranks are low and duties minor, have not yet participated in the **Dharma Seat**. I pray that each may be assigned their proper station, according to their rank, and receive my humble words.\n\n**Offering incense.**\n**Offering water.**",
      "overlap_context": "y bear divine markings, and I soon attain the state of the **Saints**.\n\nOnly through the grace of the Most Exalted and Great Emperors and True Worthies, who bestow blessings and mercy, may their favor flow down to all the common folk, granting me the fulfillment of my prayers. I am overwhelmed by their boundless kindness and will strive to repay it.\n\nYour servant, **prostrate with two bows**, is sincerely awestruck and trembling.\n\n**Three times offering incense.**\n**Three times offering water.**",
      "start_char": 6915,
      "end_char": 7137,
      "start_sentence": 265,
      "end_sentence": 276,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 5.178513765335083,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\醮三洞真文五法正一盟威箓立成仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "伏以龙舆整驭，不敢久停。 幸愿降临之后，各还所职，如常守卫，降福除祸，留恩布德。 侍经玉童玉女、左右玉郎，兼臣某所受真官，各依掌卫，与臣某同心一体，行住动止，不相去离。 若有灾危厄患，神惑气昏，违犯契盟，吏兵先坐，玄科格律，罪□不轻，神宜慎之。 散香汤等。 内官第九 臣某设醮已毕，向来所出身中五体真官、三洞玉郎吏、一切灵骑，并愿还臣某身中，各依所守，在左还左，在右还右，安坐金堂玉室，保炁全真，须臣某后召复出，一如故事，伏良久闭目，叩齿三通，想见身神，翕然尽还身中，如世中州府兵马，各还营幕，帖然澄静，然后复炉。 复炉第十 此后一章，平声高唱，一如斋法事。 香官使者、左右龙虎君、侍香诸灵官，当今坛静之所，自然生金芝玉英。 臣某求道得道，求仙得仙，七祖三师，悉蒙升度，遍沐玄恩。 十方仙童玉女，接侍香烟，传臣向来言奏，速达径御三天太上、无形、无名、无极、元尊玉帝几前。 送神颂第十一 眇眇空无像，悠悠感有情。 敬则垂天贶，泄则被魔精。 吉凶随运起，否泰应缘生。 道不贵珠玉，神惧在志诚。 丹碧尽勤苦，恳欵竭中情。 自然通大圣，皆得降明灵。 捻香陈所愿，稽首冀嘉贞。 天尊常湛寂，回心归杳冥。 诵毕，学仙下坛，一如常法。 出户祝第十二 玄上太阴，八窗开明。 向有所陈，少女通灵。 事毕复位，万神潜宁。 醮后诸忌第十三 凡醮食，可以饭贤人、道士，不得与杂俗昏秽之人，孝子、妇人尤忌，亦不道饷遗俗流之类，旧法皆送於长流水中，及土地埋之。 勿饮酒，其气乱； 勿食五辛，其气昏； 勿与别人同坐，其气杂； 勿视死看生，其气秽； 勿嗔怒，其气奔； 勿悲哀，其神伤； 勿见血，其气污。 已上七戒，宜依七日，或二七日不违之，能满四十九日更佳。 大都道人忌之，悉然非止醮后。 夫求市醮物，皆须时新丰洁，无蚛孔及尘秽之物。 又不得论其财，镪其入土。 沉秽之物，不充醮物，蔗芋、署药、藕葛之徒，若以人参、伏苓之类，不禁。 此皆灵物所育，营办之时，先沐浴清净，烧香洗涤器物、刀机，不得高言厉语，嗔怒小大，交游外俗。 如不解自营，须求造食，人先约勒，令沐浴换新衣，专自看之。 醮三洞真文五法正一盟威箓立成仪竟",
      "translated_text": "**Humbly praying that the Celestial Chariot be properly guided, I dare not delay it further.**\n\nMay it be that after the Most Exalted’s descent, each return to their proper duties, as usual, guarding and protecting, bestowing blessings and warding off calamities, leaving behind grace and spreading virtue.\n\nThe **Jade Boys and Jade Girls** who attend the scriptures, the **Left and Right Jade Officers**, along with the **True Officials** entrusted to me—may they each take their appointed stations, united in heart and body with me, moving and resting without separation.\n\nShould there be disasters, dangers, or afflictions—spirit vexation, qi confusion, or breach of oath—then the officers and soldiers shall bear the first blame. The **Mysterious Laws and Ritual Codes** are strict; the penalty is not light. The spirits must take heed.\n\n**Dispersing incense and water.**\n\n**The Inner Officials (9th True Ritual)**\n\nHaving completed the *jiao* ritual, I now summon the **Five-Body True Officials** of my origin, the **Three-Cavern Jade Officers**, and all **Spiritual Cavalry**—may they return to my body, each taking their proper station: left to the left, right to the right. May they sit in tranquility within the **Golden Hall and Jade Chamber**, preserving the **vital essence** and **perfecting the True**. Only when I later summon them forth again shall they emerge, as in past practice. I remain in silent meditation for a long while, striking my teeth three times, visualizing the spirits, and they return to my body in perfect harmony—like soldiers of a state returning to their barracks, all still and serene—before the incense burner is extinguished.\n\n**Extinguishing the Incense Burner (10th True Ritual)**\n\nFrom this point onward, the chapter shall be recited in a high, level tone, as in the *zhai* ritual.\n\nThe **Incense Officials and Messengers**, the **Left and Right Dragon and Tiger Lords**, and the **Attending Spirit Officials of Incense**—at this moment of altar stillness, the **Golden Pillars and Jade Flowers** shall naturally manifest.\n\nI, [Name], having sought the Dao and attained it, having sought immortality and attained it, with the **Seven Ancestors and Three Teachers** all granted ascension—now bathed in the **Mysterious Grace**—pray that the **Ten-Directional Immortal Boys and Girls** attend the incense smoke, swiftly conveying my petitions to the **Three-Heavenly Sovereign**, the **Formless, Nameless, Supreme Primordial Emperor**.\n\n**The Hymn for Sending the Spirits (11th True Ritual)**\n\nVast and boundless, without form,\nYet moved by the emotions of the living.\nWith reverence, blessings descend from heaven;\nWith transgression, demons are drawn near.\nFortune and misfortune arise with fate;\nProsperity and adversity follow their causes.\nThe Dao does not value jade and pearls;\nThe spirits fear only sincerity of heart.\nEnduring toil in refining elixirs,\nI pour forth my earnest devotion.\nNaturally communing with the Great Saints,\nAll descend with enlightened grace.\nWith incense in hand, I present my wishes,\nBowing in hope of virtuous approval.\n\nThe Celestial Sovereign abides in eternal stillness,\nTurning the heart toward the boundless void.\n\nUpon completion, the disciple of immortality descends from the altar, as is customary.\n\n**The Doorway Blessing (12th True Ritual)**\n\nThe **Supreme Dark Principle**, the **Eight Windows of Light** now open.\nWhat was petitioned has been communicated to the **Spirit of the Maiden**.\nThe rites now concluded, all spirits return to their stations,\nAnd the myriad spirits rest in hidden tranquility.\n\n**Taboos After the Jiao Ritual (13th True Ritual)**\n\nThe ritual food may be given to **worthy men, Daoists**, but not to **common, impure folk**—especially not to **filial sons or women**, who are strictly forbidden. Nor should it be given to ordinary people as alms. According to ancient law, it must be cast into **long-flowing waters** or buried in the earth.\n\nDo not drink alcohol—it disturbs the *qi*;\nDo not eat the **Five Spices**—it clouds the mind;\nDo not share meals with others—it mixes the *qi*;\nDo not gaze upon the dead or living—it pollutes the *qi*;\nDo not be angry—it scatters the *qi*;\nDo not grieve—it harms the spirit;\nDo not see blood—it defiles the *qi*.\n\nThe **Seven Precepts** above must be observed for seven days, or at least fourteen—though forty-nine days would be ideal. These prohibitions apply not only after the *jiao* but are also strictly observed by **all Daoist practitioners**.\n\nAll items procured for the *jiao* must be fresh, abundant, and pure—free of holes, cracks, or filth. They must not be purchased through bargaining or buried for profit. Impure items are unfit for ritual use, such as **sugarcane, taro, or medicinal herbs**—though **ginseng or poria** are permitted, as these are sacred substances nurtured by spirits. When preparing them, one must first bathe in purity, cleanse the utensils and tools with incense, and avoid loud speech, anger (great or small), or mingling with outsiders.\n\nIf unable to prepare them oneself, one must seek a **ritual cook**, who must first be instructed to bathe, change into clean clothes, and oversee the preparation personally.\n\n**The Five Sacred Scriptures of the Three-Cavern Dao Completed, the Ritual of the True Unity’s Oath and威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威威",
      "overlap_context": " excess. The sequence must be respected.\n\nNow that the Most Exalted Spirit has ascended, all those who tend, guard, and serve—including the **True Officials of the Land** and the **soldiers and officers within my body**, who wield talismans and diagrams—though their ranks are low and duties minor, have not yet participated in the **Dharma Seat**. I pray that each may be assigned their proper station, according to their rank, and receive my humble words.\n\n**Offering incense.**\n**Offering water.**",
      "start_char": 7138,
      "end_char": 8035,
      "start_sentence": 277,
      "end_sentence": 319,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 20.115567684173584,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\醮三洞真文五法正一盟威箓立成仪.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}