{
  "source_id": "重阳教化集",
  "source_file": "chunked_daozang\\重阳教化集.json",
  "total_chunks": 9,
  "total_original_chars": 9240,
  "total_translated_chars": 67147,
  "total_translation_time": 240.25790548324585,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太平部\\重阳教化集.txt",
    "category": "正统道藏太平部"
  },
  "full_translation": "**The Precepts of the Authentic Master of Chongyang: The Golden Lock and Jade Barrier**\n\n**Title:** *Precepts of the Authentic Master of Chongyang: The Golden Lock and Jade Barrier*\n**Author:** *The Golden Sage (金王哲, Jīn Wáng Zhé)*—attributed to Chongyang Master (终南山重阳子, Zhōngyáng Zǐ) Wang Zhuozhe (王壮喆).\n**Volume:** *One scroll.*\n**Source:** *The Canon of the Orthodox Daoist Treasure (正统道藏, Zhèngtǒng Dàozàng) – The Peaceful Section (太平部, Tàipíng Bù).*\n\n---\n\n**The Precepts of the Authentic Master of Chongyang: The Golden Lock and Jade Barrier**\n\nThe Chongyang Master of Zhongnan Mountain, Wang Zhuozhe, composed:\n\nSomeone asked: *\"What is the supreme principle of cultivating the True Way?\"*\nThe Master replied: *\"First, eliminate nameless afflictions; second, abstain from craving for wine, sex, wealth, and fortune. This is the method of cultivation.\"*\n\nThe human body contains all the principles of Heaven and Earth. Heaven and Earth nurture the myriad things, and the myriad things fill the space between Heaven and Earth. Yet the lofty and vast nature of Heaven and Earth is never obscured by the myriad things. Those who cultivate must embody this principle in all affairs.\n\nSomeone posed a difficulty: *\"Heaven has darkness, Earth has tremors, mountains crumble, seas dry up, and the sun and moon wax and wane. Moreover, humans fall ill and face death—how can these be addressed?\"*\nThe Master answered: *\"To rectify them, one must attain the methods of the Most High (太上, Tàishàng) to refine the Five Phases (五行, Wǔxíng).\"*\n\nSomeone asked: *\"What are the methods of the Five Phases?\"*\nThe Precepts stated: *\"First, one must uphold precepts: maintain purity, endure hardship with patience, practice compassionate goodness, sever the Ten Evils (十恶, Shí'è), act skillfully, and rescue all sentient beings. Serve the sovereign with loyalty, honor parents and teachers with filial piety—these are the methods of cultivation. Then, practice the True Function.\"*\n\nThe Precepts further stated: *\"Within the body, East and West must be discerned as Gēng-Jiǎ-Wù-Yǒu (庚甲卯酉). Second, within the body, South and North must be discerned as Kǎn-Lǐ-Qiān-Yóng (坎离铅汞).\"*\n\nThe Precepts explained: *\"Gēng-Jiǎ-Wù-Yǒu refers to day and night. Jiǎ-Wù (甲卯) is the **qi** of the liver. During the eight seasonal nodes of *Lìchūn* (立春) and *Chūnfèn* (春分), the mouth produces saliva (津, jīn). Gēng-Yǒu (庚酉) is the **qi** of the lungs. During the eight seasonal nodes of *Lìqiū* (立秋) and *Qiūfèn* (秋分), the mouth produces fluid (液, yè). Kǎn-Lǐ (坎离) refers to cold and heat. Lǐ-Qiān (离铅) is the **qi** of the heart. During the eight seasonal nodes of *Lìxià* (立夏) and *Xiàzhì* (夏至), the body’s **qi** manifests as blood (血, xuè). Kǎn-Yóng (坎汞) is the **qi** of the kidneys. During the eight seasonal nodes of *Lìdōng* (立冬) and *Dōngzhì* (冬至), the body’s **qi** manifests as essence (精, jīng). Essence gives rise to the shadow (魄, pò), blood to the spirit (魂, hún). Essence is one’s innate nature (性, xìng), blood is one’s life (命, mìng). Those who grasp the nature and life are practicing the True Way.\"*\n\nThe Precepts stated: *\"Essence and blood are the foundation of the physical form. True **qi** is the foundation of nature and life. Thus, it is said: ‘Where there is blood, true **qi** can arise.’ When true **qi** is robust and complete, longevity naturally follows, as essence and blood coalesce into form.\"*\n\nSomeone asked: *\"If one is already human, why do they experience death and decay in sequence? What is the reason?\"*\nThe Master answered: *\"Those who die early are those whose minds cling to sensual pleasures and cravings for the world. Men waste their essence, women deplete their blood. If one does not sever nameless afflictions by day nor slay the Three Corpses (三尸, Sānshī) and dark spirits (阴鬼, yīnguǐ) by night, then men and women alike will face death.\"*\n\nSomeone asked: *\"What makes one immortal?\"*\nThe Master answered: *\"The immortal are those whose bodies are pure and without defilement, who preserve their true **qi** in the elixir field (丹田, Dāntián), whose essence and blood do not diminish—these are the ones who do not die.\"*\n\nSomeone posed a difficulty: *\"Yet many today practice purity and abstain from wives, yet still fail to attain the Way—why is this?\"*\nThe Master answered: *\"Though such people may be outwardly pure, they do not grasp the True Function of purity. Their bodies may be still, but their minds are not. They may be pure in form, yet their intentions are not. Have you not heard the *Scripture of Purity and Stillness (清静经, Qīngjìng Jīng)* say: ‘The Dao has clarity and turbidity, movement and stillness. Clarity is the source of turbidity, movement the foundation of stillness.’ The Scripture also says: ‘Neither defiled nor pure.’ If one speaks of True Purity and Stillness, then: ‘The eyes produce no tears, the nose no pus, the mouth no saliva, and there is no need to refine the large and small excretions. Men preserve their essence, women stabilize their blood, and all malevolent influences return to harmony while all diseases do not arise.’ Only then is the elixir field truly pure and still. The purity and stillness spoken of by people today are merely hollow names.\"*\n\n*\"Cultivation, when inner and outer align, does not first speak of the Great Vehicle (大乘, Dàshèng), but rather the Small Vehicle (小乘, Xiǎoshèng). The *Heart Sutra (心经, Xīn Jīng)* states: ‘Capable of both small and great, it does not first speak of the past, but rather the present.’ The past refers to the fruit, the present to the function. It further says: ‘When function is complete and fruit is fulfilled, it does not first speak of the True, but rather the False.’ Only the One Spirit (一灵, Yīlíng) is True; the four great elements (肉身四大, Ròushēn Sìdà) of the physical body are False appearances. One refines the False to attain the True, merging them as one.\"*\n\nThe Precepts stated: *\"Present comfort in the body is the Small Vehicle, the root of the Great Vehicle. The initial stage of the Way, the heart is the Small Vehicle, the fruit is the Great Vehicle. The Small Vehicle is the root, the Great Vehicle the branch. The Precepts say: ‘The branch and root rely upon each other; the branch borrows the root to flourish.’ The Precepts further say: ‘All arise from yin and yang, relying upon the father’s essence and mother’s blood—these are the body’s foundation. Yet people today cultivate without preserving the father’s essence and mother’s blood, dissipating their true **qi**, damaging their primal yang (元阳, Yuánsāng). Thus, they age, age brings illness, and illness leads to death. Since death is inevitable, why not address it?\"*\n\n*\"The True Dao is such: in emptiness there is reality, in reality there is emptiness. The Scripture says: ‘The Great Dao is formless, yet gives birth to Heaven and Earth; the Great Dao is nameless, yet nourishes all things.’ Those born from true nature are likewise. In ancient times, the Venerable Lord Lao (老君, Lǎojūn) refined gold, wood, water, fire, and earth, leaving behind three profound teachings of the Great Vehicle: each line eradicates sins, each phrase brings longevity. The first is ‘Divine Immortals embrace the One (神仙抱一, Shénxiān Bào Yī)’, the second is ‘Wealth and peace for the realm and its people (富国安民, Fùguó Ānmín)’, the third is ‘Strengthened armies and victory in battle (强兵战胜, Qiángbīng Zhànshèng).’\"*\n\nSomeone asked: *\"What is ‘Divine Immortals embrace the One’?\"*\n**[The Master replied:]** *\"‘Embrace the One’ refers to the fundamental essence of all beings under Heaven.\"*\n\n「The **One** (一, *Yī*) is the fundamental essence of all things under Heaven. The **One** is the **Dao/Way** (道, *Dào*). In ancient times, the **One** at its inception was **True Water** (真水, *Zhēnshuǐ*). From True Water, **qi** (气, *qì*) arises; from **qi**, True Water arises again. All things under Heaven originate from the **One**, which then nurtures them. The **One** gives rise to the **Two**, the **Two** to the **Three**, and the **Three** to all things.\n\nWithin the **Three**, the **Four** manifest as **wisdom’s functions** (四智功, *Sìzhì Gōng*), the **Five** as **eyes awakened** (五眼恁起, *Wǔyǎn Nènqǐ*), the **Six** as **senses cleansed** (六根扫荡, *Liùgēn Sǎodàng*), the **Seven** as **spirits unfurled** (七魄运开, *Qīpò Yùnkāi*), the **Eight** as **trigrams expounded** (八卦说, *Bāguà Shuō*), and the **Nine** as **true reflections of the Dao** (九思真道, *Jiǔsī Zhēndào*). To rely on the **fruits of the unexhausted** (无漏果, *Wúlòu Guǒ*) in perfect harmony, and to let the mind and thoughts naturally extend within the **elixir field** (丹田, *Dāntián*), guarding the **original qi** (元炁, *Yuánguì*), without letting it disperse—this is the method of **embracing the One** (抱一, *Bàoyī*).\n\nSomeone asked: *\"What is ‘wealth and peace for the realm and its people’?\"*\n**[The Master replied:]**: *\"Within the bodies of men and women, each possesses the **Nine Rivers and Four Seas** (九江四海, *Jiǔjiāng Sìhǎi*), the **Dragon Palaces** (龙宫, *Lónggōng*). In their **treasuries** (库藏, *Kùcáng*), there lie the **Seven Treasures and Eight Jewels** (七珍八宝, *Qīzhēn Bābǎo*). Do not let the **Six Thieves** (六贼, *Liùzéi*) steal them—this is the way of **wealth and peace for the realm and its people** (富国安民, *Fùguó Ānmín*).*\n\nSomeone asked: *\"What is ‘strengthened armies and victory in battle’?\"*\n**[The Master replied:]**: *\"The way of **victory in battle** (战胜, *Zhànshèng*) is something few in the world know. Victory in battle is the **constant principle** (常之法, *Chángzhī Fǎ*).*\n**Difficulty:** *\"Since you have spoken of the **Pure and Quiet** (清静, *Qīngjìng*) method, why do you mention the principle of **victory in battle**?\"*\n**Resolution:** *\"The common people do not grasp the method of **victory in battle**, and thus they cannot cure illness and the **impermanence** (无常, *Wúcháng*) of suffering. The way of **victory in battle** is as follows: First, **vanquish nameless afflictions** (无名烦恼, *Wúmíng Fánnǎo*); second, in the **nightly realm** (夜间境, *Yèjiān Jìng*), **defeat the Three Corpses and Ghostly Thieves** (三尸阴鬼, *Sānshī Yīnguǐ*); third, **overcome all dharmas** (万法, *Wànfǎ*). This is the method of **victory in battle**.*\n\nIf one attains the **Three Vehicles** (三乘, *Sānshèng*), they transform **suffering and afflictions** (殃恼, *Yāngnǎo*) into **blessings** (福, *Fú*). For those who practice the **Dao/Way**, the **Pure and Quiet** (清静, *Qīngjìng*) method is the foundation of the **Great Vehicle** (大乘, *Dàshèng*). To become a practitioner of the Great Vehicle, one must first begin with the **Small Vehicle** (小乘, *Xiǎoshèng*). **Purity does not depart from impurity** (清不离浊, *Qīngbùlí Zhuó*), **movement does not depart from stillness** (动不离静, *Dòngbùlí Jìng*), yet within stillness, movement arises, and within impurity, purity emerges.\n\nThere are **Heaven and Earth** (天地, *Tiāndì*), **Sun and Moon** (日月, *Rìyuè*), **Water and Fire** (水火, *Shuǐhuǒ*), and **Yin and Yang** (阴阳, *Yīnyáng*)—these are called **True Dao/Way** (真道, *Zhēndào*). The **sutra** (经, *Jīng*) says: *“Pure Yang without creation, Pure Yin without growth; when Yin and Yang harmonize, they give birth to all things.”* Yet today’s practitioners of the **Dao/Way** do not practice the **True Dao/Way**.\n\nThe **Dao/Way** is the **enlightenment of life and death** (了达性命, *Liǎodá Xìngmìng*), and **life and death** (性命, *Xìngmìng*) are the **essence and blood** (精血, *Jīngxuè*). All the myriad diseases of humanity stem from harm to one’s **life and death** (命, *Mìng*). Those who suffer from illness do not affect the **Five Zang** (五脏, *Wǔzàng*) directly; rather, they diminish the **Three Treasures** (精、气、血三宝, *Jīng, qì, xuè sānbǎo*)—**essence, qi, and blood**. If one seeks **peace and longevity** (安乐长生, *Ānlè Chángshēng*), they must hold fast to the **awareness of purity and stillness** (清静之识, *Qīngjìngzhī Shí*).\n\nEven those not yet **out of the household** (出家, *Chūjiā*), in their youth, may not uphold the **fruits of purity and stillness** (清静之果, *Qīngjìngzhī Guǒ*) and thus begin with the **Small Vehicle**. They then ascend to the **Middle Vehicle** (中乘, *Zhōngshèng*) and the **Great Vehicle** (上乘, *Shàngshèng*). The **first stage** (初地, *Chūdì*) is the **awakening of the dharma-mind** (达法心, *Dáfǎxīn*)—this is the **Small Vehicle**. Those who **realize enlightenment** (觉悟者, *Juéwùzhě*) belong to the **Middle Vehicle**. Those who **fully comprehend** (了达者, *Liǎodázhě*) belong to the **Great Vehicle**.\n\nThe **first** is the **City of Transformation** (化城, *Huàchéng*), the **second** is the **City of Silver** (银城, *Yínchéng*), the **third** is the **City of Gold** (金城, *Jīnchéng*). Like a single great tree: first, there is its **root**; then, its **twigs**. As always, one should **abide in purity and stillness** (清静, *Qīngjìng*)—this is the **true path** (正道, *Zhèngdào).*\n\n「The Master was asked: *\"Suppose one’s body is in a state of purity and stillness, yet one encounters a day of celestial demons—how should one respond? And if one meets an external heretic (波巡), how should one treat them?\"*\nThe Master replied: *\"波巡 refers to the boundaries of the realm. All realms have their limits—one must only grasp the three essentials of advance and retreat and distinguish between purity and impurity. If encountering forces of yin and yang, one must add fire to water to clarify the turbid—this is the method of non-coagulation.\"*\n\nThe secret formula states: *\"When demonic armies arrive, one must prepare swiftly, inspecting the three thousand strong soldiers.\"* The secret formula continues: *\"The three thousand cures of true function.\"* These \"strong soldiers\" are the **qi**. When they come and do not depart, accumulated over a thousand breaths, their **qi** remains in the **dantian** without dispersing—only warmth is taught, not coldness—thus forming the embryonic **xian** (immortal), the supreme method.\n\nIf one attains such supreme mastery, one will forever possess this true function. When the work is complete and the fruit is ripe, one will forever achieve peace and eternal life.\n\nAll practitioners, when facing calamity, must prepare with caution.\n\nThe Master was asked: *\"How should one respond?\"*\nThe Master explained: *\"When one faces calamity, one first perceives the signs of death.\"*\n\nThe Master was asked: *\"What are the signs of death?\"*\nThe secret formula states: *\"When the celestial pillar trembles, trees fall and mountains crumble, the six spirits are in chaos, life and essence cannot be preserved, the spirit wanders in confusion, the heavens darken, and the sun and moon lose their light—this is the seed of impermanence. A body with leaks is hell; a fruit without leaks is paradise. Those with leaky bodies must attain the perfect fruit without leaks to fulfill the Dao’s fruit.\"*\n\nThe Master was asked: *\"If the White Ox departs, how should one capture it?\"*\nThe secret formula states: *\"When the White Ox departs, strike the **xuan** (mystic) gate urgently, firmly securing the four gates. Use the immortal’s fishing method, and with the Three Island hand seal, point toward the Yellow River flowing backward. Cover the Golden Gate and merge with the Jade Lock. As if beheading the White Ox, it will naturally not flee—this is the method of the machine emerging from water to reach the other shore.\"*\n\nThere are ten methods to stabilize life and essence. The secret formula states:\n*\"The first is the Golden Gate Jade Lock stabilization;\nThe second is the Three Island revival and exchange of life and death stabilization;\nThe third is the Nine Bend Yellow River reverse-flow stabilization.\nThese are the methods for those who attain the perfect fruit without leaks to fulfill the Dao of immortality. If one stabilizes the precious **qi**, do not let it stagnate the waist and legs or dim the eyes—this is the method of stabilizing the three treasures.\"*\n\nThe Master was asked: *\"If one stabilizes the three treasures and transports them to be stored where?\"*\nThe secret formula states: *\"First, use the method of piercing the knees with reed sprouts, boiling the **qi** in the treasure furnace, and transporting the bones’ **qi** to the surging spring, supplementing the two feet. Then, practice the seven returns of the elixir. If the **qi** stagnates and weakens the waist and legs, perform the Iron Chariot Black Ox function, then open the slaughter gate. If one attains the real **yuan** (primordial) **qi** filling the abdomen, first practice the method of flying golden crystals from the elbow. If one does not practice these methods—neither piercing the knees nor the seven returns of the Three Islands—then practice transporting essence from the elbow to supplement the brain, seeking eternal youth and life. Today’s practitioners focus on the upper body but neglect the lower, like a child building a tower with an unstable foundation.\"*\n\nThe Master explained: *\"How does one ensure the middle **qi**’s essence is firm and stable? Then, at the **kan** (water) palace, use the three vehicles—Sheep, Deer, and Great Ox—to transport the treasure from Jing Mountain.\"*\n\nThe secret formula states: *\"Near Jing Mountain, there was a man named Bian He. One day, while carving mountains for firewood, he saw a phoenix perched on a stone. Bian He knew there was treasure within, so he presented it to the emperor, who flew into a rage and had Bian He’s feet amputated.\"*\n\nThe secret formula explains: *\"Bian He represents insight; the stubborn stone is the mind. The phoenix is true **qi**, forming the body. The jade is the marrow’s essence within the bones. Amputation symbolizes failing to practice piercing the knees.\"*\n\nThe secret formula states: *\"Practicing purity and stillness is called completing the lower treasure—like the sun and moon. Then, use the three vehicles to transport it to the peak of Kunlun. Alas, today’s people can speak but cannot create, can explain but cannot reveal the secrets. They say, ‘The heart practices, but the intention does not move.’ Today’s people are mostly deluded and do not cultivate the body.\"*\n\nThe Master instructed: *\"When practicing, rise at the **zi** and **wu** hours in the sitting posture, rubbing the hands. As true **qi** seethes through the body, pass the heavenly bridge and the forehead—only guide the **qi** to the upper and lower jaws. With intention, divide the true **qi**, letting it circulate downward. The **yuan** essence of the sun falls into the jaws, flowing from the left corner of the mouth to the right, gathering the saliva as the **xuan** pearl and sweet dew. With the Red Dragon, stir it evenly until it settles, then rinse it as snow-white flowers—it has a sweet taste. The mouth is the eight-colored glass canal, where one essence produces eight flavors of water, and two waters can generate the eight consciousnesses.\"*\n\nThe Master said: *\"The mouth contains the hidden true **qi**. Within the true **qi** are divided the eight **guà**—**Gèn** for the start of spring, **Zhèn** for the spring equinox, **Xùn** for the start of summer, **Lí** for the summer solstice, **Kūn** for the start of autumn, **Duì** for the autumn equinox, **Qián** for the start of winter, and **Kǎn** for the winter solstice.\n\nWithin the eight **guà**, each produces **yīn** and **yáng**; within **yīn** and **yáng**, each divides into cold and heat.\nThe key is this: Swallowing saliva is **yīn**; guiding the **qi** afterward is **yáng**. One must seek the **yīn** and **yáng** waters of **xuan** pearl and sweet dew, swallowing them in three parts, leaving two to rest, lest the tree wither and exhaust itself.\nIt is also said: 'Cherish the water, lest it flow into the rivers and be cut off.'\n\nRegarding the seven returns, the key is this: When swallowing the **shén** water to the **qì kē** (vital node), the lungs transform it into fluid, which effectively treats all coughs and wheezes, gradually arising from the **pò** (ethereal soul).\nIt is also said: When swallowing saliva to the heart, it opens one’s mind to enlightenment, and it is the **xīnshén** (heart-mind) water that washes the heart to reveal true nature.\n\nThe hymn says: 'Seeing the five-petaled flower bloom, step by step ascending to the Immortal Platform.\nThe **shén** water transforms into blood; swallowing the **shén** water to the liver, the liver being wood, is called the **Qīnglóng** (Green Dragon). When the dragon receives water, it thrives, effectively treating all eye ailments, and the **qi** transforms into saliva.\nSwallowing the **shén** water to the spleen, the spleen being earth, when earth receives water, it produces the yellow sprout.\n\nThe abdomen contains the large and small intestines, winding nine times, reaching the navel’s center—one inch and three **fēn** (fingers), round like a coin, one inch in diameter—left green, right white, front red, back black, and center yellow, named the **Dāntián** (Elixir Field).\nWithin the Field stands a palace, named the **Huángtínggōng** (Yellow Court Palace).\nThere is a small mound within, called the **Dāntuó** (Elixir Mound).\nOn the mound sits a single golden **dǐng** (cauldron), below which true fire is constantly fed, and above which **shén** water is constantly added.\nThe water and fire are **Kǎn** and **Lí** (the **guà** of water and fire).\nThis fire and water are the **jūn** fire (sovereign fire), **chén** fire (minister fire), and **mín** fire (common fire); these three fires are the true flavors, the heart, nature, and intention.\n\nNowadays, people have not yet comprehended these three aspects: the first flavor is not clear, the second not enlightened, and the third, wisdom cannot yet attain the **Dao**. If one attains these three aspects, one achieves the **sān míng liù tōng** (three clarities and six penetrations).\nWhen feeding the fire, one washes above with water and tempers below with fire.\nThe scripture says: 'Fire emerges from below the body, water from above; when the upper unites with the lower and the lower seals the upper, **Qián** and **Kūn** (heaven and earth) harmonize, commanding the dragon to coil around the golden **dǐng** and the tiger to retreat from the **Dāntián**, this is the marvelous method.'\nIt is called the **Tuó dāo guī** (Mound-Knife Pill).\n\nIf one practices this method, they will forever attain peace, comfort, and longevity.\n\nThe question arises: 'Why does one speak of the **Tuó dāo guī** as a single grain, why as self-administered **Tuó dāo guī**, and why as **Tiělí Tuó dāo guī**?'\nThe key is this: The three **Tuó dāo guī** are treasures—**jīng** (essence), **qi**, and blood.\nThe key is this: The **single grain Tuó dāo guī** is the saliva; the **self-administered Tuó dāo guī** is swallowing saliva and ingesting **qi**; the **Tiělí Tuó dāo guī** is the true **qi** in practice, unchanging and unretreatable, driving all malevolent forces to rectification.\nAs when practicing, if hungry, one eats **jīn fàn** (golden food); if thirsty, one drinks **yù jiāng** (jade nectar). When cold, one feeds the fire; when hot, one adds the water.\nThe fire is true **yáng**; the water is true **yīn**.\nThis method is the art of **drawing, supplementing, reducing, and adding**.\n\nThe key is this: **Drawing** is collecting true **qi** from above; **supplementing** is drawing warm **qi** from below into the **Dāntián**. If one warms the **shèn gōng** (kidney palace), all diseases will be dispelled.\n\nThe question arises: 'Why do both men and women sometimes suffer sudden, irregular illnesses?'\nThe answer is this: It is because all men and women are entangled in desires, pleasures, and attachments to the world. By day, they cannot cease nameless vexations; by night, within the realm of senses, they cannot sever the **sān shī** (three corpses)—**yīn guǐ** (demonic spirits)—and thus men deplete their **jīng**, women deplete their blood-**qi**. The three treasures flee, and the original **yáng** is lost, hence the irregular illnesses.\n\nIf one does not heed the words of the **shénxiān** (immortal sages), it is like a leaky, ruined house—if the owner does not repair it, the palace collapses, damaging its beams and pillars, and thus one falls ill.\n\nThe difficulty is this: 'Why do even children, who are pure and undisturbed, not deplete the three treasures yet still suffer irregular illnesses?'\nThe key is this: Children who are sick were, in their past lives, conceived in their mother’s womb when her blood-**qi** was deficient. They did not receive the full ten months of prenatal **qi**, or they were exposed to **winds, excesses, heat, and dampness**, or the four **jì** (seasons) were not properly observed, causing the child to be born with irregular illnesses.\n\nThe question arises: 'Why are there those with ugly or beautiful appearances?'\nThe key is this: Those with a **zhèng** (correct) appearance were conceived when their parents’ **yīn** and **yáng** were harmonized with the **sun** and **moon**—before the **wǔ** hour and after the **chǒu** hour—thus attaining true beauty, longevity, and prosperity. Their correct appearance brings joy to their parents.\nIf conceived after the **wǔ** hour or before the **chǒu** hour, they may have deformed appearances—such as illness, deafness, muteness, or stunted growth—often with inferior natures, displeasing to others, short lives, and lack of prosperity. This is the foundation of **zào huà** (creation).\n\nThe question arises: 'If one encounters a **yuān mó** (grievous demon), how should one treat it?'\nThe key is this: **Qīngjìng** (purity and stillness) is essential.\nIn haste, steal moments of calm; in calm, seek stillness.\nWhen facing difficulties, one must swiftly retreat.\nThe **xīn wáng** (heart-king) must employ the **guàn xiǎng** (pervasive visualization) method, urgently driving the **shén yì** (spiritual intention) into the **shàng ní wán** (upper brain palace), sitting upright and visualizing: before the eyes, Immortal Men and Women dance with celestial music, striking the teeth and settling the mind, gazing upon the **Kūnlún** Mountain’s scenery, seeing the **shàng niú** (upper ox), **yáng** (sheep), **lù** (deer), **mǎ** (horse), and **yù tù** (jade rabbit), and with intention, seizing and binding them above.\nAt the time of practice, suddenly imagine a treasure tree above, with flowers blooming and bearing fruit. With intention, pluck and swallow the fruit—those who consume this will forever attain peace, comfort, and longevity.\nThis is the method of rectification; one sentence comprehended, the great **láo** (barrier) secures the four gates.\nThe key is this: **Xué hǎi mìng mén qì dìng** (the blood sea at the life gate is stabilized), **wú kāi bì hù jīng dìng** (the door of essence is neither opened nor closed), **bù sī wài jìng shén dìng** (the spirit is undisturbed by external affairs).\"\n\nThe **essence and blood** that scatter are the **nature and life**. The **single-minded intent** is the **true sovereign**.\n\nThe **teeth** are the **Mystic Pass** (*Xuānguān*), the **closing of the elixir field** is the **lower Mystic Pass**, the **raising of the golden essence** to the upper pass is the **Golden Pass** (*Jīnguān*), and the **tight clenching of the teeth** is the **Jade Lock** (*Yùsuǒ*). When the **six senses** remain unmoved, this is the **Six Degrees** (*Liùdù*), called the **Universal Pass** (*Dōuguān*).\n\nThe **lower intake of the upper cheek** is the **Vertex Yang Pass** (*Dǐngyángguān*), the **nose** is the **Heavenly Gate** (*Tiānmén*), and the **spine’s cleft** is the **Double Pass** (*Shuāngguān*). When performing the work, all locks open simultaneously.\n\nWhen the **spirit** does not move, the **intent** does not stray. The **intent** is **flickering**—this is the method of **clarity and stillness**.\n\nIn **spring, summer, autumn, and winter**, if a child’s urine is **yellow**, it means the **elixir field** is **emptied and decayed**, having lost the **lower source**. To **preserve the true qi**, urgently use the **method of piercing the Nine Curves** (*Chuān Jiǔqū*), also called the **Nine Circulations of piercing the small intestine** (*Jiǔzhuàn Chuān xiǎocháng*). The **true qi** will **nine times penetrate the kidney hall**, and the urine will naturally become **greenish-white**. Then, the body will attain **peace and comfort**.\n\n**Question:** What is the **method of the Three Vehicles** (*Sānshèng zhī fǎ*)?\n\n---\n\n**Question:** What is the **method of the Three Vehicles** (*Sānshèng zhī fǎ*)?\n\n**Answer:** The **method of the Three Vehicles** is as follows: the **lower Vehicle** (*xiàshèng*) is like a newborn babe, the **middle Vehicle** (*zhōngshèng*) is like a child sitting on the ground, and the **upper Vehicle** (*shàngshèng*) is like a child walking.\n\nIf one attains these **Three Vehicles**, they transcend the **Three Realms**—the **Realm of Desire** (*yùjiè*), the **Realm of Form** (*sèjiè*), and the **Formless Realm** (*wúsèjiè*). This reveals the **Threefold Nature** of the mind and body: the **Law-body** (*fǎshēn*) of **clarity and stillness**, the **Reward-body** (*bàoshēn*) of **perfection**, and the **Transformation-body** (*hùeshēn*) of **threefold meditation**.\n\nEach of these has its own **manifested spirit** (*xiǎnjì zhī shén*). The first is the **method of the Highest Venerable** refining the **Wood of A and B**—this is the **Empty Plain** (*xūtǎn*), where the **Highest Venerable** (*Tàishàng*) teaches the **Laozi** in **green robes**, guiding the **Three Thousand Green-Robed Daoists** (*sānqiān qīngyī dào shì*). He leaves behind the **Nine Circulations of Piercing the Small Intestine** (*Jiǔzhuàn Chuān xiǎocháng*), specifically the **Ninefold Transformation of the Elixir’s Greenish-Yellow Sprout** (*Dānhuángyá Chuān xī*), a **supreme method** lost to the world.\n\nThe second is the **method of Śākyamuni Buddha**, refining the **Fire of C and D** (*jiàn diǎnfāng bǐngdīng huǒ*)—the body clad in the **flaming robe of the monastic order** (*lièhuà jiāshā*), where the **Three Thousand Red Children** (*sānqiān chìzǐ*)—the **monks and nuns** (*bīqú sēngrén*)—leave behind the **Twelvefold *Mahāyāna Sūtras*** (*Dàshèng zūn jīng shí’èrbù*). He also transmits the **method of striking the Ninefold Iron Drum** (*shè jiǔchóng tiěgǔ*) and the **Ninefold Transformation of the Reed Sprout** (*Lúyá Chuān xī*).\n\nThe **Dragon Flower Triple Assembly** (*Lónghuá Sān huì*)—where the **Master** (*fūzǐ*) in the **Confucian Study Hall of Lu** (*Lǔguó xíxué táng*)—refines the **Metal of G and H** (*jiàn xīfāng gēngxīn jīn*) for the **Three Thousand White-Robed Laymen** (*sānqiān báiyī jūshì*). He leaves behind the **Ten Volumes of the *Analects*** (*Lúnyǔ shí juàn*), along with the **method of piercing the Nine Curves with the Clear Pearl** (*Míngzhū Chuān Jiǔqū*) and the **Ninefold Transformation of the Reed Sprout** (*Lúyá Chuān xī*).\n\nThe **Three Teachings** are like the **three legs of a cauldron**—their essence converges into **One**. There is no duality, no triplicity; the **Three Teachings** do not depart from the **True Dao** (*zhēndào*).\n\n**Illustration:** It is like a single tree bearing three branches.\n\n**Question:** Within the **Great Dao** (*Dàdào*), how many ranks of **Immortal** (*shénxiān*) are there?\n\n**Answer:** The *Collection of Transmissions* (*Zhuàn Dàojí*) mentions **five ranks of Immortals** (*wǔ děng shénxiān*). The first rank does not uphold **precepts** (*jìe*), does not abstain from **alcohol and meat** (*jiǔròu*), does not refrain from killing, and does not cultivate **virtue** (*shàn*). Such are the **Ghostly Immortals** (*guǐxiān*).\n\nThe second rank cultivates **True Qi** (*zhēnqì*) for longevity and becomes **Earthly Immortals** (*dìxiān*).\n\nThe third rank loves **warfare** (*zhànzhēng*) and is called **Sword Immortals** (*jiànxiān*).\n\nThe fourth rank practices **sitting meditation** (*dǎzuò xiūxíng*) and is known as **Spirit Immortals** (*shénxiān*).\n\nThe fifth rank honors **teachers and elders**, **parents and children**, and practices the **Six Perfections** (*liùdù*) and **Ten Thousand Benevolent Means** (*wànxíng fāngbiàn*) to save all beings, cutting off the **Ten Evils** (*shí’è*), refraining from killing, and abstaining from **alcohol and meat** (*jiǔròu*). They embody **righteousness without deceit**, their **intent harmonizes with the Heavenly Mind** (*yì tóng tiānxīn*), and their **conduct is straight and unselfish** (*zhèngzhí wú sīqū*). Such are called **Heavenly Immortals** (*tiānxiān*).\n\nWhen one first awakens to **good intent** (*shànxīn*), that is the **auspicious land** (*jíxiáng zhī dì*). For those who practice **great cultivation** (*dà xiūxíng*) in the **good dharma**, there are **prohibitions** (*jìn jì*) to observe.\n\n**Prohibition:** In the **fifth and sixth months**, and the **twelfth month**, one must **preserve clarity and stillness** (*qīngjìng*), avoiding great disturbances.\n\nAdditionally, the **fifth and sixth months** are months of **great slaughter** (*dà shā*), so men must not approach women, lest they suffer the **Five Strains and Seven Injuries** (*wǔ láo qī shāng*). Men who damage their **vital essence and blood** (*jīngxiě qìyè*) lose their **life and vitality**, while women who damage their **vital essence** (*jīngxiě*) lose their **fertility**. This is because they harm the **True Qi of the Five Phases** (*wǔxíng zhēnqì*), resulting in **Five Strains** (*láo*), or the **Seven Treasures** (*qī bǎo*), causing **Seven Injuries** (*shāng*). All diseases arise from these imbalances.\n\n**Question:** How do diseases originate?\n\n**Answer:** All diseases stem from **improper alignment of the Eight Nodes** (*bājié bùzhèng zhī qì*).\n\n**Question:** What are the **Eight Evils** (*bāxié*)?\n\n**Answer:** The **Eight Evils** arise when **yin and yang** are **out of harmony** within the **Eight Trigrams** (*bāguà*), manifesting as **Eight Nodal Qi** (*bājié zhī qì*). They lead one into **evil** through **hunger, overindulgence, labor, exertion, wind, cold, heat, and dampness** (*jī lái tòng bǎo, hánjí yōuxīn, yuǎnxíng kùnjuàn, língrè shēnzuì*). During such times, one must not practice **internal alchemy** (*xínggōng*), as it may transform into **grave illness** (*dàbìng*), and **clarity and stillness** (*qīngjìng*) should be preserved.\n\nWhen practicing, one must **collect the Jade Essence** (*Yùyè*) on the tongue, **collect the Primordial Yang** (*Yuányáng*) in the **Elixir Nose** (*Dānbí*), **collect the Golden Essence** (*Jīnyè*) in the **Elixir Kidney Hall** (*Dāngǔtáng*), and **fill the bones with the refined marrow and essence** (*rújīng suǐ mǎn gǔ shí*). Such a body, even after **a hundred years of death**, remains **unrotted** (*jīnggǔ bùjiě*), known as the **method of the Connected Child and the Pearl that Secures the Bones** (*Liánzǐ huán zhèn gǔ*).\n\n**Prohibition:** The **Twenty-Four Great Prohibitions** (*èrshísì jìn*) for the **Great Elixir** (*Dàdān*) are the **Twenty-Four Qi of the Year** (*yīnián èrshísì qì*). If one wishes to seek **wondrous methods** (*miàojué*), they must first **calm their intent** (*yì zì xī*) and **surrender wealth and possessions** (*kěn shě zhòngjīn jìngcái*).\n\nThe first is **sacrificing one’s body** (*shěshēn bùshī*)—when one sees their **teachers, elders, parents, or children** in peril, they **offer their life to save another** (*shěmìng qiúmìng*).\n\nThe second is **presenting flowers to the teacher** (*jiānghuā xiànshī*)—when their **teachers or elders** are about to **scold or strike**, they must **welcome them with joy and smiles**, ensuring their face bears no **anger or resentment** (*miànshàng wú zhēnshù*).\n\nThe third is **preparing meals to honor the teacher** (*lìngshàn ér gōngyǎng*)—when food is **delicious**, they must first **offer it to their teacher** (*xiān fèng qí shī*). This is called the **Threefold Sacrifice** (*Sān bùshī*).\n\n**The Immortals say:** **Perseverance** (*jiān*) is the **Dao**, and **joy** (*huānxǐ*) is the **connection** (*yuán*). If one does not **diligently seek their teacher** (*qióng qí shī*), how can they attain the **Dao**?\n\n**Lu the Elder** (*Lǚ wēng*) says: Without the **teacher’s guidance** (*bùyīn shī zhǐ*), this matter is **difficult to know** (*cǐshì nánzhī*).\n\nAgain, it is said: **One who studies without understanding** (*xué ér bùzhì*) is not truly studying; **one who studies but does not follow their teacher** (*xué ér bùcóngshī*) is **stealing learning** (*dàoxué*), a **thief within the method**. If they **conceal their ancestral teachers** (*yǎn zǔshàng shīdé*), they **shorten their own lifespan** (*cù zìjǐ shòu*), just as ordinary people do.\n\n**To exalt oneself while belittling the teacher** is to **hold fast to false pretenses** (*qīnggōng zuòzuò*), a **disruptive practice**. Can such a person truly attain the **Dao**?\n\n**The Immortals say:** Those who **despise their teachers and slight the method** (*qīngshī mànfǎ*) are **unworthy of being teachers**. Those who have **not yet begun cultivation** (*wèixué xiūxíng*) but **already claim to save others** are **saving themselves**. All are **guided by their merits and virtues** (*píng gōngdé xíngrén*), each recognizing their own **ancestral lineage and scriptural authority** (*zǔzōng kēpái*).\n\nThe **Highest Venerable** (*Tàishàng*) is the **ancestor**, Śākyamuni is the **master**, and the **Master** (*fūzǐ*) is the **scriptural authority** (*kēpái*).\n\nSince the **Three Teachings** have **fallen into stillness**, all men and women are **tossed in the River of Love** (*ài hé*) and **drift in the Sea of Suffering** (*kǔ hǎi*), enduring **affliction** (*fánnǎo*). They **sink into the Six Realms** (*liùdào chénlún*), neither **born nor extinguished**, neither **here nor gone**.\n\nThe **Holy Masters of the Three Teachings** (*Sān jiào shèngzhǔ*) and the **Holy Mothers of the Three Realms** (*Sān jiè shèngmǔ*) come to **save and guide their children** (*qiùlái jiùdù érnǚ*), with **names and manifestations** clearly recorded (*míng hào jì xiǎnbiān míng*). Their **lifespan seals** (*shòuyìn*) and **verification marks** (*xìn wéi*) serve as **proof of identity** (*qǎn tóng*).\n\n**Explanation:** The **whole body** (*yīshēn*) is **complete** (*wéi quán*). Those who **receive precepts** (*shòu jìe*) are **recorded** (*wéi jì*), and those who **awaken in understanding** (*xīn wù liǎo dá*) are **verified by fire** (*wéi huǒ*). The *Sūtra of Meeting Requests* (*Suíqiú jīng*) states: The **Print of the Wish-Fulfilling Jewel** (*Rúyì bǎo yìn*) reveals its **name from the heart** (*cóngxīn xiǎn míng*), and those with **ten names** (*shí hào*) are the **Ten Good Deeds** (*shíshàn*) or the **Able Ones** (*néngrén*). The first name is **Primordial Cultivation** (*Yuán xiū*), the second is **Clarification of Transformation** (*Zhuǎn míng*), the third is **Penetration of the Three Realms** (*Tōng sānjiè*), the fourth is **Longevity** (*Chángshēng*), the fifth is **Manifestation of Radiance** (*Guāngmíng xiǎn*), the sixth is **Harmony of Intent** (*Yì tóng*), the seventh is **Master of the Whole Body** (*Quánshēn zhǔ*), the eighth is **Increase of Fortune and Wealth** (*Fúlù zēng*), the ninth is **Primordial Cultivation of Heaven** (*Tiān yuán xiū*), and the tenth is the **Able One** (*Néngrén*).\n\nThe **Primordial Dao** (*Yuán Dào*)—when **qi** (*qì*) is added to the **ten names** (*shí hào*), **impermeable virtue** (*wúlòu gōngdé*) naturally arises.\n\nThe **Three Teachings** (*sān jiào*) are those that, according to one’s will, transform and guide beings—all without departing from the **Dao/Way** (*Dào*).\n\nThe ancients spoke thus: *\"Worldly affairs of life and death are profound.\"* Those who practice may suffer **birth, aging, sickness, and death** (*shēng lǎo bìng sǐ*), as well as **suffering** (*kǔ*). Yet people today do not recognize the **true Dao/Way** (*zhēn Dào*), often clinging to emptiness and thus falling into futility. Even now, they cannot grasp it—how then could they comprehend the **past** (*guòqù*)?\n\nMoreover, the **Dharma Scripture** (*Dá Mó jīng*) states: *\"The past is not spoken as true, the future is not considered real.\"*\n\nThe **Supreme Sage** (*Tàishàng*) refines the **Nine Transformations** (*jiǔ zhuǎn*) of the **Elixir** (*huán dān*), enabling one to **ward off sickness and illness** (*qù bìngjí*), **transcend life and death** (*liǎo shēngsǐ*).\n\n**Master Confucius** (*Fūzǐ*) taught **benevolence** (*rén*), **righteousness** (*yì*), **propriety** (*lǐ*), **wisdom** (*zhì*), and **trustworthiness** (*xìn*), fearing that people might **invite karmic retribution** (*zhāo yè*) upon themselves. Yet, those who cultivate these virtues can also **treat their ailments** (*zhì qí jíbìng*).\n\n**Question:** How does one **treat sickness and illness** (*bìngjí*)?\n**Formula:** *\"Remove the eyes—great remedy.\"* **Explanation:** *\"Long-term joy is the remedy.\"* **Formula:** *\"Joy is the root of this remedy. Constant vexation is the root of all diseases.\"*\n\nOr, those who **abide in stillness and tranquility** (*cháng qīngjìng*) are the **sprouts of the Great Dao** (*dà Dào zhī miáo*).\n\nYet, observing today’s practitioners—be they **monks, Daoists, or those of the Five Precepts** (*wúguǎn sān jiào wǔjiè*)—men and women alike, one wonders: **Why do they face sickness, impermanence, and suffering**?\n\nOr, **men and women who have partners yet lack spouses** (*yǒu fū wú fù*), their **Elisir Field** (*dān tián*) scatters the **Spirit Turtle** (*líng guī*), dissipating **true qi** (*zhēn qì*), leaving the **Lower Elixir Field** (*xià yuán*) cold and void—thus generating **all diseases** (*jiàn shēng wàn bìng*).\n\nWhen **men abide in stillness for sixty-four days**, their **semen-qi** (*jīng qì*) is full; when **women abide in stillness for forty-nine days**, their **blood-qi** (*xuè qì*) is full.\n\n**Extremes invert** (*wùjí zhě zé fǎn*): **stillness returns to motion** (*jìng wéi dòng fǎn*), **clarity returns to turbidity** (*qīng wéi zhuó fǎn*).\n\nWhen **heart and intent** (*xīn yì*) scatter, **true qi** flows from the **nine orifices** (*jiǔ qiào*), leaving the body depleted.\n\n**Turbid qi** (*zhuó qì*) causes **women’s menstrual flow** (*yuè shuǐ*) to increase and **men’s nocturnal emissions** (*yè mèng*), where **yīn-qi** (*yīn qì*) **steals the Seven Treasures and Eight Jewels** (*qiè le qī zēn bā bǎo*), thus leading to **disease** (*jíbìng*).\n\n**Question:** How does one **treat yīn-ghosts** (*yīn guǐ*)?\n**Answer:** *\"Use the **Sword and Chisel Method** (*Dāo guī zhī fǎ*).\"*\n**Question:** *\"What is the **Sword and Chisel Method**?\"*\n**Formula:** *\"The **Sword and Chisel** (*Dāo guī*) is **One** (*yī*). It contains **water** (*shuǐ*) and **qi** (*qì*), able to **generate all things** (*shēng wàn wù*).*\n**Qi** is the **Chisel** (*guī*), forming **clouds and rain** (*yún shuǐ*), and **rain** (*yǔ*).\n\n**Formula:** *\"Expelling **qi** is the **Sword** (*dāo*), drawing in **qi** is the **Chisel** (*guī*). When **function** (*xíng gōng*) is applied, it becomes **all things** (*wàn yǒu*). The **verified adept** (*yàn zhě*) practices the **Sword and Chisel**—this is the **Method of Reversing Aging and Restoring Youth** (*fǎn lǎo huán tóng*).\" The **Scripture** (*jīng*) says: *\"Fire issues from below the body, water from above—water and fire are the remedies.\"*\n\n**Formula:** *\"**Lotus Sprouts piercing the knees** (*lú yá chuān xī shàngxià hé chē*), **installing the furnace** (*ān niè zào*) is the **Purple River Cart** (*zǐ hé chē*). **Moving semen to nourish the brain** (*bān jīng bǔ nǎo*) is the **Upper Cart** (*shàng chē*). When **fire is advanced**, **water grows warm**; when **water is advanced**, **fire grows cool**. Those who **dual-circulate water and fire** (*shuǐ huǒ shuāng xíng*) are practicing the **Gentle Lead Furnace** (*wēn wēn yīn dǐng*). When **qi enters the furnace**, **rest** (*xiū*) arises. **Following the Golden Sovereign** (*jīn gōng dài jiǔ*), **Dragon and Tiger** (*lóng hǔ*) **qi** circulates—**semen and blood** (*jīng xuè*) **scatter into the hundred meridians** (*bǎi mài*), **skin and flesh become moist** (*pí fū zī rùn*), and the **body shines** (*shēn tǐ guāng zé*). This is the **Method of Nourishment and Cultivation** (*xiū yǎng zhī fǎ*).\n\n**Difficulty:** *\"Why do the fat first wither?\"* **Formula:** *\"The fat are those who **cultivate externally but neglect internally** (*xiū wài bù xiū nèi*), whose **bones lack marrow** (*gǔ zhōng wú suǐ*). Their **Elisir Field** scatters **true qi**—thus they **wither and fall ill** (*jiù shuāi bìng*).\" Those who **cultivate the Inner Dao** (*xiū nèi Dào*) are the **sprouts of eternal bliss and longevity** (*ān lè chángshēng zhī miáo*).\n\n**Formula:** *\"**Dragon Swirls around the Golden Furnace** (*lóng pán jīn dǐng*), **Tiger reaches the Elixir Field** (*hǔ dá dān tián*), the **Thunderbolt Coil** (*zhèn guà qǐ léi*) and the **Wind Coil** (*xùn guà qǐ fēng*)—when **function is applied**, **rinse the saliva** (*xǐ jīng*) in one great gulp, **swallow three times** (*fēn sān dù yàn*), and **press the qi downward in three cycles** (*àn qì xià xíng sān biàn*). **Dragon’s Brontes and Tiger’s Roars** (*lóng yīn hǔ xiào*) naturally arise.\n\nThis also **removes all abdominal diseases** (*chú fù zhōng wàn bìng*), and the sound is **like thunderbolts striking drums** (*ěr tīng zhī rú léi chuì huà gǔ*).\n\n**Ascending** (*shàng*) is **elevation** (*shēng*), **descending** (*xià*) is **reduction** (*jiàng*). The **hymn** (*sòng*) says:\n*\"The subtle truth of **True Emptiness** (*zhēn kōng*) few know,\nSitting at **Curve River** (*Qū Jiāng*), watching swallows fly.\nThunder shakes the earth, ghosts and spirits tremble—\nThis is the **moment of yīn-yáng transformation** (*zhèngshì yīn yáng zào huà shí*).\"*\n\nBefore **midday** (*wǔ shí*), **adjust fire and water** (*jiā jiǎn yòng shuǐ huǒ shēng jiān*), **Dragon and Tiger** follow the **Golden Sovereign** (*jīn gōng*), **drunk with wine** (*huáng pó zuì zhuài*). The **Yellow Grandmother** (*huáng pó*) **drags the King** (*dìng wáng*), asking: *\"Who are you?\"*\n\n**Question:** *\"The **Golden Sovereign** is **Deity** (*shén*), the **Yellow Grandmother** is **qi** (*qì*). **Yīn-qi** is the **infant** (*yīng ér*), **yáng-qi** is the **virgin** (*chī nǚ*).\"*\n**The Azure Dragon** (*qīng lóng*) is the **qi of the liver** (*gān zhī qì*), **The White Tiger** (*bái hǔ*) is the **qi of the lungs** (*fèi zhī qì*), **Kàn and Lí** (*kǎn lí*) are **semen and blood** (*jīng xuè*).\n\n**Formula:** *\"When **function** is applied, sit **like Mount Tài** (*rú Tàishān*), stand **like a Jewel Pagoda** (*rú bǎo tǎ*). **Secure the Four Gates** (*láo zhèn sì mén*), **knock firmly at the Mystic Pass** (*jǐn kòu xuán guān*). Rinse the **saliva** (*jīng*) in one gulp, **swallow it three times** (*wéi měng sān yàn xià*), **crossing the Kàn-Lí barrier** (*jiē qì guò lí gé*). **Activate it three times** (*huó zuò sān dù*), and naturally **Dragon and Tiger qi** will **move, rest, sit, or lie** (*xíng zhù zuò wò*), **closing the mouth and eyes** (*jìn kǒu bì mù*), **hearing no sound** (*ěr bù tīng shēng*), **seeing only inner landscapes** (*yǎn shì nèi jǐng*). **Fix the gaze upon the Elixir Field** (*yī rì zhèng guān dān tián*), **visualizing within the mind** (*yì zhōng xiǎng jiàn*), **following exhalation, qi descends** (*suí hū qì xià jiàng*), **following inhalation, qi ascends** (*suí xī qì shàng shēng*). It **does not cross the Kàn-Lí barrier** (*bù jiào lí gé*), nor **does it allow the qi to rush to the face** (*bù jiào zhù miàn mù shàng*). The **six qi** (*liù qì*) **each arrive** (*gè dào*), and at the **Middle Elixir Field** (*zhōng yuán*), they **meet** (*xiāng jiàn*).\n\n**Pure qi** (*qīng qì*) **moves rightward** (*yòu xíng*), **turbid qi** (*zhuó qì*) **moves leftward** (*zuǒ xíng*). Each **circulates nine times** (*gè zhuǎn jiǔ zāo*), and **qi cannot exit upward or downward** (*qì shàng xià bù néng chū*), nor **can it scatter left or right** (*zuǒ yòu jié chéng niè zào*). This is called the **Dragon Swirls, Tiger Retreats Method** (*lóng pán hǔ yuǎn zhī fǎ*), and **qi naturally harmonizes** (*qì zìrán hé huì*).\n\nMoreover, the **infant and virgin** (*yīng ér chī nǚ*) **pair as husband and wife** (*wéi fū fù zhī fǎ*), and **qi gathers at the spleen** (*pí shàng ān niè*)—this is the **Yellow Grandmother Matching Method** (*huáng pó pǐ qì zhī fǎ*). It is also called the **Heaven-Earth Intercourse Harmony Method** (*tiān dì jiāo tài zhī fǎ*), or the **Kàn-Lí Intercourse Method** (*kǎn lí jiāo gòu zhī fǎ*)—this is the **Method of Body Intercourse without Sexual Union** (*shēn jiāo shén bù jiāo zhī fǎ*).\n\n**Deity does not engage in intercourse** (*shén bù jiāo*)—this is the **Method of Stillness and Clarity** (*qīng jìng zhī fǎ*), the **Thousand Circulations without Movement** (*qiān biàn bù yáo zhī fǎ*).\n\nYet, people today **mostly practice external Dao** (*duō xiū wài Dào*), not **internal Dao** (*nèi Dào*), and **see the Dao only in past teachings** (*jiàn Dào guòqù fǎ*).\n\n**Cultivators** (*xiūxíng zhě*) may follow the **Three Great Teachings** (*sān jiào sān shēng*) on the **path**, but when they **advance three li**, they encounter **three great ravines** (*sān jiào sān shēng*) **without bottom** (*wú dǐ*). How then can they **cross**?\n\n**Formula:** *\"The **three great ravines** (*sān jiào sān shēng*) are the **Three Teachings and Three Vehicles** (*sān jiào sān shēng*), **awakening the Three Corpses** (*qǐ sān shī*), **establishing the Three Treasures** (*dìng sān bǎo*), **transcending the Three Realms** (*chuāo sān jiè*).\"*\n\n**Advancing another three li**, they see **six deep trenches** (*liù shēn gōu*), unable to **progress further** (*bù néng qián jìn*). What **gate** (*mén*) is this?\n\n**Formula:** *\"These are the **Six Perfections and Ten Thousand Practices** (*liù dù wàn xíng*), **Six Roots in Stillness** (*liù gēn qīng jìng*), **Severing the Six Bandits** (*zhǎn liù zéi*), **Restraining the Six Desires** (*jiè liù yù*), **Planting the Six Ladders** (*shù liù tī*).\"*\n\n**Advancing another three li**, they encounter **three ruined beams** (*sān chǎn fāng*). These are the **Treasure-Purification Beams** (*bǎo jìng fāng*), and when the **Seven Woods Corpses** (*qī lín shī*) **multiply**, this is the **Critical Moment of Application** (*lín zuò yòng*).\n\n「Advancing another three li**, they see **one garden** (*yī zuò yuán*), named the **Garden of Discarded Fruits** (*shě guǒ yuán*). There is an **old man** (*yī wēng*) who gazes fixedly at the garden gate; those with **affinity** (*yǒu yuán*) pass through with **empty hands** (*kòng shǒu*).\n\n**Advancing another three li** within the garden, they encounter **a great tree** upon which **a golden ox** (*jīn niú*) is struck and **fixed**. Beside the river, there are **five platforms** (*wǔ zuò tái*):\n\n- the **Male’s Yellow Gold Platform** (*nán zǐ huáng jīn tái*)\n- the **Female’s Phoenix Platform** (*nǚ zǐ fèng huáng tái*)\n- the **Divine Fishermen’s Platform** (*shén xiān diào yú tái*)\n- the **Eternal Peace, Thousand Flowers Platform** (*ān lè qiān huā tái*)\n- the **Platform of the Impermanent Homeland** (*wú cháng wàng xiāng tái*).\n\nAt the river’s mouth, there are **three women** (*sān gè nǚ zǐ*), and the **ferry** (*dù kǒu*) is the **witch’s crossing** (*mó nǚ*).\n\nWhen the **multitude fills the boat** (*zhòng shàn zhōu chuán*), they must **cross this river** (*guò cǐ hé*).\n\n**Advancing another three li**, they see **a great mountain** (*yī zuò dà shān*), named **Mount Sumeru** (*xū mí shān*). Upon its slopes, there are **three rams**:\n\n- a **green ram** (*qīng yáng*) on the eastern slope, which is **Laozi’s qi** (*lǎo jūn zhī qì*)\n- a **white ram** (*bái yáng*) on the western slope, which is **the Master’s qi** (*fū zǐ zhī qì*)\n- a **yellow ram** (*huáng yáng*) on the southern slope, which is **the Great Awakening Golden Immortal’s qi** (*dà jué jīn xiān zhī qì*).\n\nThe **three rams guide and escort** (*sān gè yáng ér yǐn jiē dà zhòng rù shān*) the multitude into the mountain, known as **Mount Three Yang Converging at the Cauldron** (*sān yáng jù dǐng shān*).\n\nWithin the mountain, there is **a walled city** (*yī zuò chéng*), named **Northern City** (*běi chéng*), with **four gates** (*sì mén*), each bearing a **plaque** (*pái*) inscribed with **characters** (*zì*):\n\n- the **Gate of Radiant Brilliance** (*kāi guāng mén*) to the east\n- the **Gate of Longevity** (*cháng shēng mén*) to the west\n- the **Gate of Golden Radiance** (*jīn guāng mén*) to the south\n- the **Gate of Great Sinking** (*dà lún mén*) to the north.\n\nThese correspond to the **four senses** (*sì mén*): **eye** (*yǎn*), **ear** (*ěr*), **nose** (*bí*), and **mouth** (*kǒu*).\n\nUpon entering the **four gates**, they see **four caverns** (*sì zuò dòng fǔ*):\n\n- the **Cavern of Celestial Music** (*tiān lè dòng*)\n- the **Cavern of White Clouds** (*bái yún dòng*)\n- the **Cavern of the Bamboo Grove** (*zhú guó dòng*)\n- the **Cavern of Longevity** (*cháng shēng dòng*).\n\nWithin the **four caverns**, they encounter **four temples** (*sì zuò sì*):\n\n- the **Temple of Non-Purity** (*wú jìng sì*)\n- the **Temple of Mysterious Emptiness** (*xuán kōng sì*)\n- the **Temple of the Bamboo Forest** (*zhú lín sì*).\n\n**[Upon entering the four temples,]**, there are **four fruits** (*sì zuò guǒ*):\n\n- the **Arhat of Tranquil Meditation** (*ān chán luó hàn*)\n- the **Stream-Enterer** (*sī tuó*)\n- the **Once-Returner** (*hán xū duō*)\n- the **Non-Returner Arhat** (*wú guān rú hán luó hàn*), who serve as the **four temple masters** (*sì sì zhǔ*), these being the **four fruit Immortals** (*sì guǒ xiān rén*).\n\n**Advancing further**, they see **five visions** (*wǔ guān*):\n\n1. the **Vision of Merit and Fame** (*gōng míng guān*)\n2. the **Vision of Medicine and Pharmacy** (*yī yào guān*)\n3. the **Vision of Eternal Peace** (*ān yáng guān*)\n4. the **Vision of True Suchness** (*zhēn rú guān*)\n5. the **Vision of Tuóshuà** (*diào shuài guān*).\n\nWithin the **five visions**, there are **five palaces** (*wǔ guān zhōng yǒu wǔ gōng*):\n\n- the **Palace of Twin Maidens** (*shuāng nǚ gōng*), which is the **eye**\n- the **Palace of the Great Dragon** (*dà lóng gōng*), which is the **mouth**\n- the **Palace of Upper Whiteness** (*shàng bái gōng*), which is the **nose**\n- the **Palace of Crystal Waters** (*shuǐ jīng gōng*), which is the **ear**\n- the **Palace of Celestial Scales** (*tiān chēng gōng*), which is the **mind** (*xīn*).\n\nInside sits **a grand pavilion** (*dà lóu gé*), with **twelve breaths** (*shàng xià shí èr hū xī*) above and below, named the **Twelve-Layered Pavilion** (*shí èr chóng lóu*).\n\nThere are also:\n- the **Central Palace Pavilion** (*zhōng gōng lóu*)\n- the **Moon Palace Pavilion** (*yuè gōng lóu*)\n- the **Heavenly Immortal Pavilion** (*tiān xiān lóu*)\n- the **Pavilion of Taking Treasures** (*qǔ bǎo lóu*)\n- the **Holy Well Pavilion** (*shèng jǐng lóu*)\n- the **Pavilion of Dao-Qi’s Wondrous Sound** (*fǎ qì miào yīn lóu*)\n- the **Pavilion of Knowing the Dao** (*shí dào lóu*)\n- the **Pavilion of Zen Summit** (*chán dǐng lóu*)\n- the **Pavilion of Bright Resonance** (*jǐng yáng lóu*)\n- the **Drum Tower Pavilion** (*zhōng gǔ lóu*)\n- the **Pavilion of the Two Saints** (*èr shèng lóu*).\n\nEach year on the **first day of the twelfth month** (*měi nián shí èr yuè yī rì*) at the **twelve earthly branches** (*shí èr shí*), the **human body contains the twelve monthly pavilions** (*shí èr yuè lóu*), where each pavilion corresponds to the **twelve zodiacal hours** (*shí èr jīng shí chén zhōng*).\n\nSurrounding this are **nine palaces** (*sì miàn yòu jiàn jiǔ gōng*), which are the **nine orifices** (*jiǔ qiào*) of the human body. The **nine palaces of the orifices** (*jiǔ qiào gōng*) are as follows:\n\n- to the east: the **Palace of Wind and Thunder** (*fēng léi gōng*) and the **Palace of Twin Groves** (*shuāng lín gōng*)\n- to the south: the **Palace of Purple Micro** (*zǐ wēi gōng*) and the **Palace of the Arhat** (*mó ní gōng*)\n- to the west: the **Palace of the Holy Mother** (*shèng mǔ guān*) and the **Palace of Benevolent Luo** (*huì luó gōng*)\n- to the north: the **Palace of the Brahman** (*fàn gōng*) and the **Palace of Crystal Waters** (*shuǐ jīng gōng*)\n- at the center: the **Palace of Tranquility** (*ān gōng*).\n\nThis is named the **Nine Palaces** (*jiǔ gōng*), akin to the **Nine Regions of Earth** (*dì liè jiǔ zhōu*).\n\nFurthermore, the **Nine Palaces and the Central Palace** (*jiǔ gōng fǔ yuán gòng jì shí zhōu*) total **ten regions** (*shí zhōu*), which are the **Ten Lands** (*shí guó*):\n\n- the **Land of the Jiao Ancestor** (*jiāo zǔ guó*)\n- the **Land of the Arhat** (*mó ní guó*)\n- the **Land of Blooming Flowers** (*kāi huā guó*)\n- the **Land of the Strict Deer** (*lù yán guó*)\n- the **Land of Golden Hue** (*jīn sè guó*)\n- the **Land of the Glass Bead** (*liú lí guó*)\n- the **Land of Śrāvastī** (*shě wèi guó*)\n- the **Land of Southern Zen** (*nán chán guó*)\n- the **Land of Heavenly India** (*tiān zhú guó*)\n- the **Land of Repeated Yang** (*chóng yáng guó*).\n\nThese **Ten Lands** (*shí guó*) are the **Ten Stages of Bodhisattva Perfection** (*shí dì*), where each stage contains **a seat of Mount Tài** (*yī zuò Tài shān*).\n\nWhat is the **body** (*shēn*)? It is the **source of great illness** (*zhì zhǒng dà bìng*), all of which **injure life** (*jiē shāng rén mìng*).\n\nThe body contains **four great seas** (*sì dà hǎi*):\n\n- **saliva** (*jīn*) as the **Eastern Sea** (*dōng hǎi*)\n- **blood** (*xuè*) as the **Southern Sea** (*nán hǎi*)\n- **marrow** (*suǐ*) as the **Western Sea** (*xī hǎi*)\n- **qi** (*qì*) as the **Northern Sea** (*běi hǎi*).\n\nAdditionally, there are **nine isles** (*jiǔ zhōu*), which are the **small intestine** (*xiǎo cháng*).\n\nThere are also **five lakes** (*wǔ hú*), where the **body is the Lake of the Moonlit Cavern** (*dòng tíng hú*):\n\n- **essence** (*jīng*) as the **Lake of Jade** (*yù hú*)\n- **sweet dew** (*gān lù*) as the **Lake of Clarified Butter** (*tí hú*)\n- **mind** (*xīn*) as the **Lake of Mysterious Depth** (*xuán hú*)\n- the **small intestine** (*xiǎo cháng*) as the **Lake of the River and Sea** (*jiāng hú*).\n\nThe **three luminaries** (*rì yuè xīng chén*) **wane** (*sān xiāo*), signifying the **decline of blood, qi, and essence** (*xuè qì jīng shuāi*).\n\nThis **waning** (*sān xiāo*) is like **mountains collapsing, seas drying up, and earth splitting** (*shān bēng hǎi jié dì liè*). Within the **twelve solar hours** (*yī rì shí èr shí chén zhōng*), one may **encounter the person of Mo** (*dé zuò Mò yuè qí rén*), achieving **fulfilled merit and perfect fruit** (*gōng chéng guǒ mǎn*). Males who **refine their form** (*liàn xíng*) become like **virgin boys** (*yīng nán*), and females become like **virgin girls** (*yīng nǚ*).\n\nThe scripture states: **\"Form and spirit both wondrously refined**, harmonizing with the **True Dao** (*hé zhēn*), this is the **method of extracting the embryo and replacing the bones** (*chōu tāi huàn gǔ zhī fǎ*), the **true formula of inverted yin and yang, and the Five Phases** (*wú xíng*).\n\nThe **Five Phases** (*wǔ xíng*) include **metal** (*jīn*), **wood** (*mù*), **water** (*shuǐ*), **fire** (*huǒ*), and **earth** (*tǔ*).\n\n- In **spring**, when **wood is vigorous** (*chūn mù wàng*), if **internal wood is not vigorous** (*nèi mù bù wàng*), people often **suffer from eye ailments** (*rén duō bìng yǎn jí*).\n- In **summer**, when **fire is vigorous** (*xià huǒ wàng*), if **internal fire is not vigorous** (*nèi huǒ bù wàng*), people often **suffer from dysentery** (*rén duō xiè lì*).\n- In **autumn**, when **metal is vigorous** (*qiū jīn wàng*), if **internal metal is not vigorous** (*nèi jīn bù wàng*), people often **suffer from coughing and wheezing** (*rén duō kě sǒu*).\n- In **winter**, when **water is vigorous** (*dōng shuǐ wàng*), if **internal water is not vigorous** (*nèi shuǐ bù wàng*), people often **suffer from hernia** (*rén duō cuì qì*).\n- The **spleen** (*pí*) is **earth** (*tǔ*), and its **four seasonal divisions** (*sì jì fèn*) are determined by the **yin and yang inversions and reversals** (*pí qì yīn yáng diān dào fǎn fù*) of the **spleen’s qi**.\n\nThe **Five Phases** (*wǔ xíng*) each **restrain one another** (*xiāng kè*), as follows:\n- **metal restrains wood** (*jīn kè mù*)\n- **wood restrains earth** (*mù kè tǔ*)\n- **earth restrains water** (*tǔ kè shuǐ*)\n- **water restrains fire** (*shuǐ kè huǒ*)\n- **fire restrains metal** (*huǒ kè jīn*).\n\n**Water and fire** (*shuǐ huǒ*) are the **yin and yang** (*yīn yáng*), and **one yin, one yang** (*yī yīn yī yáng*) is the **True Dao** (*zhēn dào*), which is **essence and blood** (*jīng xuè*).\n\nWhen people **suffer from myriad illnesses** (*yǒu wàn bìng*), none are **related to the five viscera** (*jìn bù guān wǔ zàng zhī shì*), but all stem from **the depletion of their parents’ essence and blood** (*shǔn liǎo fù mǔ jīng xuè*). If the **elixir field weakens** (*dān tián ruò*), sickness and disease **will arise** (*biàn shēng bìng jí*); thus, **urgently gather spirit and stabilize nature** (*jí shōu shén dìng xìng*).\n\nThe *Scripture of the Nine Immortals* (*Jiǔ Xiān Jīng*) states: **\"The Dao is one** (*dào zhě yī yě*). When a person **obtains the one** (*dé yī zhě*), all things **must be accomplished** (*wàn shì bì chéng*).\n\nWhen **practicing the work** (*xíng gōng shí*), the **spirit and qi transform** (*shén qì zhuǎn*), and the **qi follows the intent** (*qì zhú yì xíng*). During **circulation** (*yùn shí*), **advance and surge forward** (*qián gǎn qián chōng*), becoming the **yin general of the yin spirit** (*yīn zuǒ jiāng yīn shén*). The **six heavenly stems** (*liù jiā*) **drive and turn** (*qū zhuǎn*), and the **six aspects, eight recognitions** (*liù xiàng bā shí*) **encircle the one true spirit** (*kuáng yī zhēn líng nèi*), **wandering through the nine palaces** (*yóu jiǔ gōng*), **observing and playing with the ten lands** (*kàn wán shí guó*), **descending to the longevity platform** (*cháng shēng jiàng tái*), and **making the infant boy and maiden’s elixir field a stable furnace** (*shǐ yīng ér zhǐ nǚ dān tián ān lú zào, jìn huǒ shāo yào*).\n\nThe **two lower orifices** communicate with the **kidney hall** (*shèn táng*), drawing the **treasure of the breath** (*bǎo*) with the exhalation—**thirty-six spits** into the mouth yield **snowflake** (*xuě huā*), swallowed into the **elixir field** (*dān tián*) as **snow**. Then, **upper merging and lower closing** (*shàng hé xià bì*) follow, as **Heaven and Earth unite** (*qián kūn xiāng hé*), filling with **true qi** (*zhēn qì*).\n\nWhen the **spleen warms** (*pí nuǎn*), all maladies dissolve.\nLike **firing clay in a kiln**, it naturally completes when its time comes.\nLike a **hen brooding an egg**, or a **woman bearing child**, time is not reckoned—only when the body aches is it the **iron-black ox hauling the cart** (*tiě hēi niú bān chē*), the **true unity of qi and nature** (*zhēn yī qì, zhēn yī xìng*).\nThe **black** is the **lower qi** (*xià qì*); **painful qi** exits through **defecation**, **swollen qi** through **urination**.\n\nThere is also the **method of descending the Heavenly Pass and Earthly Axis** (*tiān guān dì zhóu*): gazing at the **item solar pass** (*xiàng yáng guān*) and **muddy homunculus palace** (*ní huán gōng*), drawing **true qi** long into the nose and mouth, **forcefully exhaling six times**—the **Heavenly Pass and Earthly Axis** remain motionless as death. Those who daily practice in the **palace** (*xíng gōng*) perpetually harmonize **yin and yang**.\n\nAt the **winter solstice**, **one yang is born**; at the **summer solstice**, **one yin is born**.\nThe **winter solstice** begins at the **child hour** (*zǐ shí*), watching the **eastward sunrise** as **yang**; the **summer solstice** begins at **noon** (*wǔ shí*), with **sunset** as **yin**.\nThis is the **principle of yin and yang returning and reversing**.\n\nWhen **earth-qi ascends** and **heavenly rain descends**, **three days of wind**, **ten mornings of rain**—if **wind and rain follow their season**, the people thrive, and so does one’s body: **enduring joy, free of illness**.\n\nIf a person has **ten thousand maladies**, each disease is cured by its **corresponding true practice** (*zhēn gōng*), naturally responding.\n\nThe **first great method of refining the Nine-Turn Elixir** (*jiǔ zhuàn huán dān*) includes:\n- The **method of the yellow sprout piercing the knee** (*huáng yá chuān xī*)\n- The **method of shooting the nine-layered iron drum** (*shè jiǔ céng tiě gǔ*)\n- The **method of the crown prince wandering the four gates** (*tài zǐ yóu sì mén*)\n- The **method of the golden rod pointing at the wheel** (*jīn biān zhǐ lún*)\n- The **method of the reed sprout piercing the knee** (*lú yá chuān xī*)\n- The **method of Xuanyuan straddling fire** (*xuān yuán kuà huǒ*)\n- The **method of the jade maiden caressing the body** (*yù nǚ mō shēn*)\n- The **method of Zhongli bearing the sword on his back** (*zhōng lí bèi jiàn*)\n- The **method of Lu the Old Man fishing** (*lǚ wēng diào yú*)\n- The **method of Chen Xiqi’s great sleep** (*chén xī qí dà shuì*)\n\nAll these are **practices of the Three Teachings**, each treating diseases.\n\nThose who can **transcend birth**—when a person practices this method, **true qi nurtures heat in the elixir field**, and at night, they often dream of **herding cattle on mountains**: the **cattle**—whether **red oxen**, **green oxen**, or **immortals, Daoists**, **palaces, temples**, **great roads, fine houses, high carriages, good trees**—or seeing **children and officials**—all signify **vigorous elixir-field qi**.\n\nIf one dreams of **wild thorns, evil men, broken houses, collapsing pagodas, tombs, fallen trees, or river crossings**, it means the **elixir-field qi is weak**—supplementation is needed.\n\n**Secret Key** (*jué*):\n*\"Seal the lips of these three—speak not of them.*\n*The six ears fear leaking the Daoist secrets.\"*\n\n**Secret Key**:\nThese three are:\n1. The **disrespectful husband** (*bù xiào zhī rén*)\n2. The **unfaithful husband** (*bù jìng xìn zhī rén*)\n3. The **husband who does not transmit the precepts well** (*bù chuán jiè bù shàn zhī rén*).\n\nDo not speak of this key. **Excluding these**, men, women, monks, Daoists, officials—**all may receive the law and precepts**.\n\nThose who perfect this **true secret key** are worth **gold from Mount Sumeru** (*xū mí jīn*).\nTaking all scriptures as **ancestors**, those who seek **ease** practice **small vehicle** (*xiǎo chéng*) methods.\nThough small, they are the **roots of the great vehicle** (*dà chéng*).\n\nThe **Cause-and-Effect Scripture** states that **eight fields of merit** exist in cultivation, and the **field of saving suffering and healing illness** is the **first in saving life**—stronger than **burning incense in southern temples** or **offering supplies in northern halls**.\n\nSaving one life is like **building a seven-tiered gemstone stupa**.\nIf men or women obtain this key, **do not transmit it recklessly**—to do so lightly **leaks the immortals’ secrets**, causing the **nine ancestors to fall into ruin**, eternally confined to **Yingdu**, never reborn in human form.\n**Beware! Take heed! Believe, receive, and practice faithfully.**\n\nThe **Golden Pass, Jade Lock Secret Key** of **True Yang Master** is complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "重阳真人金关玉锁诀 经名：重阳真人金关玉锁诀。 金王哲撰。 一卷。 底本出处：《正统道藏》太平部。 重阳真人金关玉锁诀 终南山重阳子王壮喆撰 或问曰：如何是修真妙理？ 答曰：第一先除无名烦恼，第二休贪恋酒色财气，此者便是修行之法。 夫人之一身，皆具天地之理。 天地所以含养万物，万物所以盈天地间，其天地之高明广大，未尝为万物所蔽。 修行之人，凡应万事，亦当体之。 难曰：天有昏暗，地有动摇，山有崩摧，海有枯竭，日月有盈缺。 且人有疾病、无常，如何治之？ 答曰：欲要治之，除是达太上炼五行之法。 问曰：如何是五行之法？ 诀曰：第一先须持戒，清静忍辱，慈悲实善，断除十恶，行方便，救度一切众生，忠君王，孝敬父母师资，此是修行之法。 然后习真功。 诀曰：第一身中东西，要识庚甲卯酉。 第二身中南北，要识坎离铅汞。 诀曰：庚甲卯酉者，为昼夜。 甲卯者，是肝之气。 八节中立春、春分，口中为津也。 庚酉者，是肺之气。 八节中立秋、秋分，口中为液也。 坎离者，寒暑。 离铅者，是身中心气，八节中立夏、夏至，身中为血也。 坎汞者，是肾中气。 八节中立冬、冬至，身中为精也。 精生魄，血生魂，精为性，血为命。 人了达性命者，便是真修行之法也。 诀曰：精血者，是肉身之根本。 真气者，是性命之根本。 故曰：有血者，能生真气也。 真气壮实者，自然长久，聚精血成形也。 问曰：既为人，因甚生死先后者，何也？ 答曰：先死者，为其人心着欲乐，贪恋境界。 是男子者损精，妇人损血。 白日不断无名烦恼，夜中不斩三尸阴鬼，男子妇人已有无常也。 问曰：不死之人何也？ 答曰：不死者，为其人身清静无垢，惜真炁在丹田，精血不衰，其人不死也。 难曰：多见今人清静休妻，亦不能成道者何也？ 答曰：虽是此人清静，却不达真清静之功，其人虽是一身清静，却不能定於精血养真气，此人身清心不清，其身静意不静。 岂不闻《清静经》云：夫道者，有清有浊，有动有静。 清者浊之源，动者静之基。 经云：不垢不净。 若论真清静者，眼内无泪，鼻内无脓，口内无唾，不炼大小便，男子养精，女子定血，万邪归正，万病不生，方可是丹田清静。 今人说清静者，都是假名。 夫修行若内外相应，未言大乘，先说小乘。 《心经》云：能小能大，未言过去，先说见在。 过去者是果，见在者是功。 又云：功成果满，未言真，是说假。 惟一灵是真，肉身四大是假相，借炼假成真，感合为一。 诀曰：见在一身安乐，为小乘，都是大乘之根。 初地法，心为小乘，结果为大乘。 小乘为根，大乘为梢。 诀曰：梢根相借，梢借根而生。 诀曰：皆不离阴阳所生，须借父精母血二物者，为身之本也。 今人修行，都不惜父精母血，耗散真气，损却元阳。 故有老，老有病，病中有死。 既有无常，何不治之。 夫真道者，空中有实，实中有空。 经云：大道无形，生育天地； 大道无名，长养万物。 从真性所生为人者，亦复如是。 昔日老君炼金、木、水、火、土，留下三乘妙言，行行灭罪，句句长生。 第一上有神仙抱一，第二中有富国安民，第三下有强兵战胜。 问曰：何者是神仙抱一？ 〔答曰〕：抱一者，天下人身之根本。",
      "translated_text": "**The Precepts of the Authentic Master of Chongyang: The Golden Lock and Jade Barrier**\n\n**Title:** *Precepts of the Authentic Master of Chongyang: The Golden Lock and Jade Barrier*\n**Author:** *The Golden Sage (金王哲, Jīn Wáng Zhé)*—attributed to Chongyang Master (终南山重阳子, Zhōngyáng Zǐ) Wang Zhuozhe (王壮喆).\n**Volume:** *One scroll.*\n**Source:** *The Canon of the Orthodox Daoist Treasure (正统道藏, Zhèngtǒng Dàozàng) – The Peaceful Section (太平部, Tàipíng Bù).*\n\n---\n\n**The Precepts of the Authentic Master of Chongyang: The Golden Lock and Jade Barrier**\n\nThe Chongyang Master of Zhongnan Mountain, Wang Zhuozhe, composed:\n\nSomeone asked: *\"What is the supreme principle of cultivating the True Way?\"*\nThe Master replied: *\"First, eliminate nameless afflictions; second, abstain from craving for wine, sex, wealth, and fortune. This is the method of cultivation.\"*\n\nThe human body contains all the principles of Heaven and Earth. Heaven and Earth nurture the myriad things, and the myriad things fill the space between Heaven and Earth. Yet the lofty and vast nature of Heaven and Earth is never obscured by the myriad things. Those who cultivate must embody this principle in all affairs.\n\nSomeone posed a difficulty: *\"Heaven has darkness, Earth has tremors, mountains crumble, seas dry up, and the sun and moon wax and wane. Moreover, humans fall ill and face death—how can these be addressed?\"*\nThe Master answered: *\"To rectify them, one must attain the methods of the Most High (太上, Tàishàng) to refine the Five Phases (五行, Wǔxíng).\"*\n\nSomeone asked: *\"What are the methods of the Five Phases?\"*\nThe Precepts stated: *\"First, one must uphold precepts: maintain purity, endure hardship with patience, practice compassionate goodness, sever the Ten Evils (十恶, Shí'è), act skillfully, and rescue all sentient beings. Serve the sovereign with loyalty, honor parents and teachers with filial piety—these are the methods of cultivation. Then, practice the True Function.\"*\n\nThe Precepts further stated: *\"Within the body, East and West must be discerned as Gēng-Jiǎ-Wù-Yǒu (庚甲卯酉). Second, within the body, South and North must be discerned as Kǎn-Lǐ-Qiān-Yóng (坎离铅汞).\"*\n\nThe Precepts explained: *\"Gēng-Jiǎ-Wù-Yǒu refers to day and night. Jiǎ-Wù (甲卯) is the **qi** of the liver. During the eight seasonal nodes of *Lìchūn* (立春) and *Chūnfèn* (春分), the mouth produces saliva (津, jīn). Gēng-Yǒu (庚酉) is the **qi** of the lungs. During the eight seasonal nodes of *Lìqiū* (立秋) and *Qiūfèn* (秋分), the mouth produces fluid (液, yè). Kǎn-Lǐ (坎离) refers to cold and heat. Lǐ-Qiān (离铅) is the **qi** of the heart. During the eight seasonal nodes of *Lìxià* (立夏) and *Xiàzhì* (夏至), the body’s **qi** manifests as blood (血, xuè). Kǎn-Yóng (坎汞) is the **qi** of the kidneys. During the eight seasonal nodes of *Lìdōng* (立冬) and *Dōngzhì* (冬至), the body’s **qi** manifests as essence (精, jīng). Essence gives rise to the shadow (魄, pò), blood to the spirit (魂, hún). Essence is one’s innate nature (性, xìng), blood is one’s life (命, mìng). Those who grasp the nature and life are practicing the True Way.\"*\n\nThe Precepts stated: *\"Essence and blood are the foundation of the physical form. True **qi** is the foundation of nature and life. Thus, it is said: ‘Where there is blood, true **qi** can arise.’ When true **qi** is robust and complete, longevity naturally follows, as essence and blood coalesce into form.\"*\n\nSomeone asked: *\"If one is already human, why do they experience death and decay in sequence? What is the reason?\"*\nThe Master answered: *\"Those who die early are those whose minds cling to sensual pleasures and cravings for the world. Men waste their essence, women deplete their blood. If one does not sever nameless afflictions by day nor slay the Three Corpses (三尸, Sānshī) and dark spirits (阴鬼, yīnguǐ) by night, then men and women alike will face death.\"*\n\nSomeone asked: *\"What makes one immortal?\"*\nThe Master answered: *\"The immortal are those whose bodies are pure and without defilement, who preserve their true **qi** in the elixir field (丹田, Dāntián), whose essence and blood do not diminish—these are the ones who do not die.\"*\n\nSomeone posed a difficulty: *\"Yet many today practice purity and abstain from wives, yet still fail to attain the Way—why is this?\"*\nThe Master answered: *\"Though such people may be outwardly pure, they do not grasp the True Function of purity. Their bodies may be still, but their minds are not. They may be pure in form, yet their intentions are not. Have you not heard the *Scripture of Purity and Stillness (清静经, Qīngjìng Jīng)* say: ‘The Dao has clarity and turbidity, movement and stillness. Clarity is the source of turbidity, movement the foundation of stillness.’ The Scripture also says: ‘Neither defiled nor pure.’ If one speaks of True Purity and Stillness, then: ‘The eyes produce no tears, the nose no pus, the mouth no saliva, and there is no need to refine the large and small excretions. Men preserve their essence, women stabilize their blood, and all malevolent influences return to harmony while all diseases do not arise.’ Only then is the elixir field truly pure and still. The purity and stillness spoken of by people today are merely hollow names.\"*\n\n*\"Cultivation, when inner and outer align, does not first speak of the Great Vehicle (大乘, Dàshèng), but rather the Small Vehicle (小乘, Xiǎoshèng). The *Heart Sutra (心经, Xīn Jīng)* states: ‘Capable of both small and great, it does not first speak of the past, but rather the present.’ The past refers to the fruit, the present to the function. It further says: ‘When function is complete and fruit is fulfilled, it does not first speak of the True, but rather the False.’ Only the One Spirit (一灵, Yīlíng) is True; the four great elements (肉身四大, Ròushēn Sìdà) of the physical body are False appearances. One refines the False to attain the True, merging them as one.\"*\n\nThe Precepts stated: *\"Present comfort in the body is the Small Vehicle, the root of the Great Vehicle. The initial stage of the Way, the heart is the Small Vehicle, the fruit is the Great Vehicle. The Small Vehicle is the root, the Great Vehicle the branch. The Precepts say: ‘The branch and root rely upon each other; the branch borrows the root to flourish.’ The Precepts further say: ‘All arise from yin and yang, relying upon the father’s essence and mother’s blood—these are the body’s foundation. Yet people today cultivate without preserving the father’s essence and mother’s blood, dissipating their true **qi**, damaging their primal yang (元阳, Yuánsāng). Thus, they age, age brings illness, and illness leads to death. Since death is inevitable, why not address it?\"*\n\n*\"The True Dao is such: in emptiness there is reality, in reality there is emptiness. The Scripture says: ‘The Great Dao is formless, yet gives birth to Heaven and Earth; the Great Dao is nameless, yet nourishes all things.’ Those born from true nature are likewise. In ancient times, the Venerable Lord Lao (老君, Lǎojūn) refined gold, wood, water, fire, and earth, leaving behind three profound teachings of the Great Vehicle: each line eradicates sins, each phrase brings longevity. The first is ‘Divine Immortals embrace the One (神仙抱一, Shénxiān Bào Yī)’, the second is ‘Wealth and peace for the realm and its people (富国安民, Fùguó Ānmín)’, the third is ‘Strengthened armies and victory in battle (强兵战胜, Qiángbīng Zhànshèng).’\"*\n\nSomeone asked: *\"What is ‘Divine Immortals embrace the One’?\"*\n**[The Master replied:]** *\"‘Embrace the One’ refers to the fundamental essence of all beings under Heaven.\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1243,
      "start_sentence": 0,
      "end_sentence": 68,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 24.544272899627686,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\重阳教化集.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "一者，是万物之根本。 一者为道也。 昔为初一者，真水也。 水中生气，气中生水。 万物者，从一生万物，是长养。 一生二，二生三，三生万物。 三中四智功，五眼恁起，六根扫荡，七魄运开，八卦说，九思真道。 凭无漏果圆融，意想自神长在丹田，抱守元炁，莫教散失，此者是抱一之法。 问曰：何者是富国安民？ 诀曰：男子、女人身中，各有九江四海龙宫，库藏中有七珍八宝，莫教六贼偷了，此是富国安民。 问曰：何者是强兵战胜？ 诀曰：夫战胜者，天下少人知。 夫战胜是常之法。 难曰：既论清静之法，何得说战胜理。 解曰：今人不达战胜之法，又能治於病疾无常。 战胜者，第一先战退无名烦恼； 第二夜间境中，要战退三尸阴鬼； 第三战退万法。 此者是战胜之法。 若人会得三乘－者，变殃恼为福也。 夫修行者，常清静为根本大乘之法。 欲为大乘者，须索从小乘而起，清不离浊，动不离静，静中便生动，浊中便自有清。 有天地，有日月，有水火，有阴阳，谓之真道。 经云：纯阳而不生，纯阴而不长，阴阳和合者，能生万物。 今人修道者，却不修真道。 道者了达性命也，性命者是精血也。 人有万病，是病者皆伤人之命矣。 有疾病者，尽不干五脏之事，都是损了精、气、血三宝，欲要安乐长生者，除是持清静之识。 或有未出家之人，年少时不能持清静之果，从小乘。 入中乘、上乘。 初地达法心为小乘，觉悟者为中乘，了达者为上乘。 第一是化城，第二是银城，第三是金城。 似一根大树，先有其根，后有其梢。 如常时只宜清静，大为正道也。",
      "translated_text": "「The **One** (一, *Yī*) is the fundamental essence of all things under Heaven. The **One** is the **Dao/Way** (道, *Dào*). In ancient times, the **One** at its inception was **True Water** (真水, *Zhēnshuǐ*). From True Water, **qi** (气, *qì*) arises; from **qi**, True Water arises again. All things under Heaven originate from the **One**, which then nurtures them. The **One** gives rise to the **Two**, the **Two** to the **Three**, and the **Three** to all things.\n\nWithin the **Three**, the **Four** manifest as **wisdom’s functions** (四智功, *Sìzhì Gōng*), the **Five** as **eyes awakened** (五眼恁起, *Wǔyǎn Nènqǐ*), the **Six** as **senses cleansed** (六根扫荡, *Liùgēn Sǎodàng*), the **Seven** as **spirits unfurled** (七魄运开, *Qīpò Yùnkāi*), the **Eight** as **trigrams expounded** (八卦说, *Bāguà Shuō*), and the **Nine** as **true reflections of the Dao** (九思真道, *Jiǔsī Zhēndào*). To rely on the **fruits of the unexhausted** (无漏果, *Wúlòu Guǒ*) in perfect harmony, and to let the mind and thoughts naturally extend within the **elixir field** (丹田, *Dāntián*), guarding the **original qi** (元炁, *Yuánguì*), without letting it disperse—this is the method of **embracing the One** (抱一, *Bàoyī*).\n\nSomeone asked: *\"What is ‘wealth and peace for the realm and its people’?\"*\n**[The Master replied:]**: *\"Within the bodies of men and women, each possesses the **Nine Rivers and Four Seas** (九江四海, *Jiǔjiāng Sìhǎi*), the **Dragon Palaces** (龙宫, *Lónggōng*). In their **treasuries** (库藏, *Kùcáng*), there lie the **Seven Treasures and Eight Jewels** (七珍八宝, *Qīzhēn Bābǎo*). Do not let the **Six Thieves** (六贼, *Liùzéi*) steal them—this is the way of **wealth and peace for the realm and its people** (富国安民, *Fùguó Ānmín*).*\n\nSomeone asked: *\"What is ‘strengthened armies and victory in battle’?\"*\n**[The Master replied:]**: *\"The way of **victory in battle** (战胜, *Zhànshèng*) is something few in the world know. Victory in battle is the **constant principle** (常之法, *Chángzhī Fǎ*).*\n**Difficulty:** *\"Since you have spoken of the **Pure and Quiet** (清静, *Qīngjìng*) method, why do you mention the principle of **victory in battle**?\"*\n**Resolution:** *\"The common people do not grasp the method of **victory in battle**, and thus they cannot cure illness and the **impermanence** (无常, *Wúcháng*) of suffering. The way of **victory in battle** is as follows: First, **vanquish nameless afflictions** (无名烦恼, *Wúmíng Fánnǎo*); second, in the **nightly realm** (夜间境, *Yèjiān Jìng*), **defeat the Three Corpses and Ghostly Thieves** (三尸阴鬼, *Sānshī Yīnguǐ*); third, **overcome all dharmas** (万法, *Wànfǎ*). This is the method of **victory in battle**.*\n\nIf one attains the **Three Vehicles** (三乘, *Sānshèng*), they transform **suffering and afflictions** (殃恼, *Yāngnǎo*) into **blessings** (福, *Fú*). For those who practice the **Dao/Way**, the **Pure and Quiet** (清静, *Qīngjìng*) method is the foundation of the **Great Vehicle** (大乘, *Dàshèng*). To become a practitioner of the Great Vehicle, one must first begin with the **Small Vehicle** (小乘, *Xiǎoshèng*). **Purity does not depart from impurity** (清不离浊, *Qīngbùlí Zhuó*), **movement does not depart from stillness** (动不离静, *Dòngbùlí Jìng*), yet within stillness, movement arises, and within impurity, purity emerges.\n\nThere are **Heaven and Earth** (天地, *Tiāndì*), **Sun and Moon** (日月, *Rìyuè*), **Water and Fire** (水火, *Shuǐhuǒ*), and **Yin and Yang** (阴阳, *Yīnyáng*)—these are called **True Dao/Way** (真道, *Zhēndào*). The **sutra** (经, *Jīng*) says: *“Pure Yang without creation, Pure Yin without growth; when Yin and Yang harmonize, they give birth to all things.”* Yet today’s practitioners of the **Dao/Way** do not practice the **True Dao/Way**.\n\nThe **Dao/Way** is the **enlightenment of life and death** (了达性命, *Liǎodá Xìngmìng*), and **life and death** (性命, *Xìngmìng*) are the **essence and blood** (精血, *Jīngxuè*). All the myriad diseases of humanity stem from harm to one’s **life and death** (命, *Mìng*). Those who suffer from illness do not affect the **Five Zang** (五脏, *Wǔzàng*) directly; rather, they diminish the **Three Treasures** (精、气、血三宝, *Jīng, qì, xuè sānbǎo*)—**essence, qi, and blood**. If one seeks **peace and longevity** (安乐长生, *Ānlè Chángshēng*), they must hold fast to the **awareness of purity and stillness** (清静之识, *Qīngjìngzhī Shí*).\n\nEven those not yet **out of the household** (出家, *Chūjiā*), in their youth, may not uphold the **fruits of purity and stillness** (清静之果, *Qīngjìngzhī Guǒ*) and thus begin with the **Small Vehicle**. They then ascend to the **Middle Vehicle** (中乘, *Zhōngshèng*) and the **Great Vehicle** (上乘, *Shàngshèng*). The **first stage** (初地, *Chūdì*) is the **awakening of the dharma-mind** (达法心, *Dáfǎxīn*)—this is the **Small Vehicle**. Those who **realize enlightenment** (觉悟者, *Juéwùzhě*) belong to the **Middle Vehicle**. Those who **fully comprehend** (了达者, *Liǎodázhě*) belong to the **Great Vehicle**.\n\nThe **first** is the **City of Transformation** (化城, *Huàchéng*), the **second** is the **City of Silver** (银城, *Yínchéng*), the **third** is the **City of Gold** (金城, *Jīnchéng*). Like a single great tree: first, there is its **root**; then, its **twigs**. As always, one should **abide in purity and stillness** (清静, *Qīngjìng*)—this is the **true path** (正道, *Zhèngdào).*",
      "overlap_context": "ngs of the Great Vehicle: each line eradicates sins, each phrase brings longevity. The first is ‘Divine Immortals embrace the One (神仙抱一, Shénxiān Bào Yī)’, the second is ‘Wealth and peace for the realm and its people (富国安民, Fùguó Ānmín)’, the third is ‘Strengthened armies and victory in battle (强兵战胜, Qiángbīng Zhànshèng).’\"*\n\nSomeone asked: *\"What is ‘Divine Immortals embrace the One’?\"*\n**[The Master replied:]** *\"‘Embrace the One’ refers to the fundamental essence of all beings under Heaven.\"*",
      "start_char": 1243,
      "end_char": 1849,
      "start_sentence": 69,
      "end_sentence": 102,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 22.137077569961548,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\重阳教化集.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "问曰：假令一身清静，却逢天魔之日，如何治之？ 又假令逢外道波巡，请曰如何治之？ 答曰：波巡者，界也。 境界皆有，只要识进退三要，辨清浊。 若逢阴阳者，加火入水却浊，不相煎之法。 诀曰：假令魔军来时，急须准备，检三千强兵。 诀曰：三千疏真功。 强兵者为其气也。 有来无去，千息数积，其气在丹田不散，只教暖不教冷，自结胎仙，为妙法也。 若人得如上妙者，永得如上真功，功成果满，永得安乐长生。 一切修功之人，临有难之日，小心准备。 问曰：如何治之？ 解曰：人临有难之日，先见其死相。 问曰：如何是死相？ 诀曰：天柱动摇，树倒山摧，六神俱乱，性命不能保，精神恍惚，天地暗，日月无光，便是无常之苗也。 有漏之身为地狱，无漏之果为天堂。 人有漏之身，须证无漏之果圆者，皆共成於道果。 问曰：假令白牛去时，如何擒捉？ 诀曰：白牛去时紧叩玄关，牢镇四门，急用仙人钓鱼之法，又用三岛手印指黄河逆流，掩上金关，纳合玉锁。 如大斩眼白牛，自然不走，名机出水登彼岸之法。 有十般定性命之法。 诀曰：一名金关玉锁定； 二名三岛回生换死定； 三名九曲黄河逆流定。 是名无漏果圆者，皆共成於仙道。 若定了宝时，休教滞了腰脚，昏了眼目，此是定三宝之法。 问曰：若有人收定三宝，搬运归寄何处？ 〔诀曰〕：先用芦芽穿膝之法，烹气冲宝炉，骨运气直至涌泉，补於二足。 然后七返还丹之法，如气滞定腰脚时，便行铁车黑牛功，然后开宰门。 如得元炁实肚者，先行肘后飞金晶之法。 如不用行此功者，不行穿膝之法，不行七返三岛之法，便行肘后搬精补脑之法，望长生不老。 今人行功，顾上不顾下，如小儿建塔，下不坚牢也。 如何是中炁实要坚牢也，又於坎宫便用羊、鹿、大牛三车搬，从荆山运宝。 诀曰：荆山却近有一人，姓卞名和。 有一日刻山打柴，却见一凤凰落於一块石上，卞和便知石中有宝，将来献帝，帝大怒，刖了卞和双足。 诀白：卞和者，识也，意顽石也。 凤凰者，是真气，成是身。 玉者，是骨中精髓。 刖者，是两足不行穿膝之法。 诀曰：善清静，名曰下元宝成，如日月相似，便用三车搬运，上昆仑顶。 叹曰：今人能道不能造，能说不能诀。 又曰：行功心行意不行，今人多迷，不修身体。 第一神性是大牛之车，须索动青牛拽车，车中载宝，是鹿车。 第二行白牛拽车，车中载宝。 第三暖气行火，是羊车，赤牛拽车，车中载宝。 三车行时，初离荆山尾闾，中入地轴，过天关，过下双关肾俞二穴，是腰腿入曹溪地，夹脊上双关，夹脊是也。 双射上苑岩、分水岭二名，天台岭三名。 女子运宝前安乳香，频进真火，如行此功一年，令妇人如童男。 意想铅汞二珠射蓬莱脑后开，天门自开透红霞，真炁入髓海自暖，令人头白再黑，名日肘后飞金晶之法。 我师言曰：皆见提并人，不见用绳儿。 无虽后生有神水还丹田。 夫行功之时，子午起踟趺坐，搓手，如真气煎体，过天桥，过额颅是也。 只教上腮、下腮上，用意分真气，两下流转，太阳元中落於腮，上流牙齿，从左口角右口角取液，又为玄珠甘露，用赤龙搅得匀停，漱为雪花白，有甘味也。 口是八色璃璃渠，一中八味水，二水中能生八识。",
      "translated_text": "「The Master was asked: *\"Suppose one’s body is in a state of purity and stillness, yet one encounters a day of celestial demons—how should one respond? And if one meets an external heretic (波巡), how should one treat them?\"*\nThe Master replied: *\"波巡 refers to the boundaries of the realm. All realms have their limits—one must only grasp the three essentials of advance and retreat and distinguish between purity and impurity. If encountering forces of yin and yang, one must add fire to water to clarify the turbid—this is the method of non-coagulation.\"*\n\nThe secret formula states: *\"When demonic armies arrive, one must prepare swiftly, inspecting the three thousand strong soldiers.\"* The secret formula continues: *\"The three thousand cures of true function.\"* These \"strong soldiers\" are the **qi**. When they come and do not depart, accumulated over a thousand breaths, their **qi** remains in the **dantian** without dispersing—only warmth is taught, not coldness—thus forming the embryonic **xian** (immortal), the supreme method.\n\nIf one attains such supreme mastery, one will forever possess this true function. When the work is complete and the fruit is ripe, one will forever achieve peace and eternal life.\n\nAll practitioners, when facing calamity, must prepare with caution.\n\nThe Master was asked: *\"How should one respond?\"*\nThe Master explained: *\"When one faces calamity, one first perceives the signs of death.\"*\n\nThe Master was asked: *\"What are the signs of death?\"*\nThe secret formula states: *\"When the celestial pillar trembles, trees fall and mountains crumble, the six spirits are in chaos, life and essence cannot be preserved, the spirit wanders in confusion, the heavens darken, and the sun and moon lose their light—this is the seed of impermanence. A body with leaks is hell; a fruit without leaks is paradise. Those with leaky bodies must attain the perfect fruit without leaks to fulfill the Dao’s fruit.\"*\n\nThe Master was asked: *\"If the White Ox departs, how should one capture it?\"*\nThe secret formula states: *\"When the White Ox departs, strike the **xuan** (mystic) gate urgently, firmly securing the four gates. Use the immortal’s fishing method, and with the Three Island hand seal, point toward the Yellow River flowing backward. Cover the Golden Gate and merge with the Jade Lock. As if beheading the White Ox, it will naturally not flee—this is the method of the machine emerging from water to reach the other shore.\"*\n\nThere are ten methods to stabilize life and essence. The secret formula states:\n*\"The first is the Golden Gate Jade Lock stabilization;\nThe second is the Three Island revival and exchange of life and death stabilization;\nThe third is the Nine Bend Yellow River reverse-flow stabilization.\nThese are the methods for those who attain the perfect fruit without leaks to fulfill the Dao of immortality. If one stabilizes the precious **qi**, do not let it stagnate the waist and legs or dim the eyes—this is the method of stabilizing the three treasures.\"*\n\nThe Master was asked: *\"If one stabilizes the three treasures and transports them to be stored where?\"*\nThe secret formula states: *\"First, use the method of piercing the knees with reed sprouts, boiling the **qi** in the treasure furnace, and transporting the bones’ **qi** to the surging spring, supplementing the two feet. Then, practice the seven returns of the elixir. If the **qi** stagnates and weakens the waist and legs, perform the Iron Chariot Black Ox function, then open the slaughter gate. If one attains the real **yuan** (primordial) **qi** filling the abdomen, first practice the method of flying golden crystals from the elbow. If one does not practice these methods—neither piercing the knees nor the seven returns of the Three Islands—then practice transporting essence from the elbow to supplement the brain, seeking eternal youth and life. Today’s practitioners focus on the upper body but neglect the lower, like a child building a tower with an unstable foundation.\"*\n\nThe Master explained: *\"How does one ensure the middle **qi**’s essence is firm and stable? Then, at the **kan** (water) palace, use the three vehicles—Sheep, Deer, and Great Ox—to transport the treasure from Jing Mountain.\"*\n\nThe secret formula states: *\"Near Jing Mountain, there was a man named Bian He. One day, while carving mountains for firewood, he saw a phoenix perched on a stone. Bian He knew there was treasure within, so he presented it to the emperor, who flew into a rage and had Bian He’s feet amputated.\"*\n\nThe secret formula explains: *\"Bian He represents insight; the stubborn stone is the mind. The phoenix is true **qi**, forming the body. The jade is the marrow’s essence within the bones. Amputation symbolizes failing to practice piercing the knees.\"*\n\nThe secret formula states: *\"Practicing purity and stillness is called completing the lower treasure—like the sun and moon. Then, use the three vehicles to transport it to the peak of Kunlun. Alas, today’s people can speak but cannot create, can explain but cannot reveal the secrets. They say, ‘The heart practices, but the intention does not move.’ Today’s people are mostly deluded and do not cultivate the body.\"*\n\nThe Master instructed: *\"When practicing, rise at the **zi** and **wu** hours in the sitting posture, rubbing the hands. As true **qi** seethes through the body, pass the heavenly bridge and the forehead—only guide the **qi** to the upper and lower jaws. With intention, divide the true **qi**, letting it circulate downward. The **yuan** essence of the sun falls into the jaws, flowing from the left corner of the mouth to the right, gathering the saliva as the **xuan** pearl and sweet dew. With the Red Dragon, stir it evenly until it settles, then rinse it as snow-white flowers—it has a sweet taste. The mouth is the eight-colored glass canal, where one essence produces eight flavors of water, and two waters can generate the eight consciousnesses.\"*",
      "overlap_context": "wùzhě*) belong to the **Middle Vehicle**. Those who **fully comprehend** (了达者, *Liǎodázhě*) belong to the **Great Vehicle**.\n\nThe **first** is the **City of Transformation** (化城, *Huàchéng*), the **second** is the **City of Silver** (银城, *Yínchéng*), the **third** is the **City of Gold** (金城, *Jīnchéng*). Like a single great tree: first, there is its **root**; then, its **twigs**. As always, one should **abide in purity and stillness** (清静, *Qīngjìng*)—this is the **true path** (正道, *Zhèngdào).*",
      "start_char": 1850,
      "end_char": 3079,
      "start_sentence": 103,
      "end_sentence": 156,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 11.725623607635498,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\重阳教化集.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "口含藏真气，真气中分八卦，艮为立春，震为春分，巽为立夏，离为夏至，坤为立秋，兑为秋分，乾为立冬，坎为冬至。 八卦中各生阴阳，阴阳中各分寒暑。 诀曰：咽津为阴，随后行气乃为阳，须索阴阳水火停分，二清津分三两咽，常留二停，恐树枯竭。 又云：惜水流不得江河断绝。 又问七返，诀曰：咽神水到气颗中，肺化为液，善治诸咳嗽，渐生於魄。 又云：咽津到心上，令人心开悟解，又是洗心神水，洗心见性。 颂曰：见花五叶开，步步入仙台。 神水化血，又咽神水到肝，肝为木，假名为青龙，龙得水时必旺，善治一切眼，气化为津。 又咽神水到脾，脾为土，土得水者能生黄芽。 腹为大小肠九曲，至脐中一寸三分，方圆一寸，左青右白，前赤后黑，中黄戊己，名为丹田。 田内一座宫，宫中名曰黄庭宫。 中有一垆，名为丹垆。 垆上坐定一只金鼎，下频进真火，上频添神水。 水火者，坎离也。 夫水火是君火，臣火，民火，三火者，为真味也，心性意是也。 今人未了达三般者，第一味不明，第二味不悟，第三味智不成道矣。 若人达三般者，三明六通也。 进火时，上用水洗，下用火煅。 经云：身下出火，身上出水，其上合下闭，乾坤相合，教龙盘金鼎，使虎远丹田者为妙。 名曰垆刀圭也。 若人行此功者，永得安乐长生也。 问曰：既刀圭，何者言为一粒刀圭，何者自饮刀圭，何者为铁离刀圭？ 诀曰：三刀圭者，为宝也，是精、气、血也。 诀曰：一粒刀圭者，津液； 自饮刀圭者，咽津服炁； 铁离刀圭者，是真炁行功，不退变，万邪皈正。 如行功时饥食金饭，渴饮玉浆，冷时进火，热时进水。 火者是真阳，水者是真阴。 此功者，是抽添加减之法。 诀曰：抽者从上收真炁，添者从下进暖炁入丹田，若人肾宫暖者，万病消除。 问曰：男子女人忽时便有疾病无常，何如也？ 答曰：为一切男子女人，心着欲乐贪恋境界之事，白日不断无名烦恼，夜间境中不能断三尸阴鬼，男子损却精，女人损却血炁，三宝走却元阳，故乃人有疾病无常也。 不闻神仙之语，人似破漏房屋，主人不修补者，宫殿倒塌，坏其梁柱，是人有疾病也。 难曰：因甚小儿清静不损三宝，亦有疾病无常者何也？ 诀曰：小儿有病者，昔日在母腹中，因母血气亏弱，受母十月胎气不足，又或犯风淫暑湿、四集不忌，受胎小儿故有疾病无常也。 问曰：因甚有丑好之人，何谓也？ 诀曰：貌正者，是日父母二气感应日月，午时已前，丑时已后，便得端正真实、长命有衣禄，貌正得父母喜悦之心。 午时已后，丑时已前受胎，有一貌不正者，或病、聋、喑痖，多性劣，不得人意，命穷无衣禄，寿命不长也。 此是造化之根本也。 问曰：假令逢冤魔者，如何治之？ 诀曰：宜清静。 忙中偷闲，闲中取静。 若人有难之时，急须回避，心王须用灌想之法，急驱神意入上泥丸神宫，正坐意想，眼见前仙男仙女各动仙乐，叩齿定意，看昆仑山景，见上牛羊鹿马玉兔，意想上拿住系定。 功时忽思上有一宝树，树上有花，花开结子，意摘取吞之，是吃了此物者，永得安乐长生。 此是修正法，一句了然，大牢镇四门。 诀曰：血海命门气定，无开闭户精定，不思外境神定。",
      "translated_text": "The Master said: *\"The mouth contains the hidden true **qi**. Within the true **qi** are divided the eight **guà**—**Gèn** for the start of spring, **Zhèn** for the spring equinox, **Xùn** for the start of summer, **Lí** for the summer solstice, **Kūn** for the start of autumn, **Duì** for the autumn equinox, **Qián** for the start of winter, and **Kǎn** for the winter solstice.\n\nWithin the eight **guà**, each produces **yīn** and **yáng**; within **yīn** and **yáng**, each divides into cold and heat.\nThe key is this: Swallowing saliva is **yīn**; guiding the **qi** afterward is **yáng**. One must seek the **yīn** and **yáng** waters of **xuan** pearl and sweet dew, swallowing them in three parts, leaving two to rest, lest the tree wither and exhaust itself.\nIt is also said: 'Cherish the water, lest it flow into the rivers and be cut off.'\n\nRegarding the seven returns, the key is this: When swallowing the **shén** water to the **qì kē** (vital node), the lungs transform it into fluid, which effectively treats all coughs and wheezes, gradually arising from the **pò** (ethereal soul).\nIt is also said: When swallowing saliva to the heart, it opens one’s mind to enlightenment, and it is the **xīnshén** (heart-mind) water that washes the heart to reveal true nature.\n\nThe hymn says: 'Seeing the five-petaled flower bloom, step by step ascending to the Immortal Platform.\nThe **shén** water transforms into blood; swallowing the **shén** water to the liver, the liver being wood, is called the **Qīnglóng** (Green Dragon). When the dragon receives water, it thrives, effectively treating all eye ailments, and the **qi** transforms into saliva.\nSwallowing the **shén** water to the spleen, the spleen being earth, when earth receives water, it produces the yellow sprout.\n\nThe abdomen contains the large and small intestines, winding nine times, reaching the navel’s center—one inch and three **fēn** (fingers), round like a coin, one inch in diameter—left green, right white, front red, back black, and center yellow, named the **Dāntián** (Elixir Field).\nWithin the Field stands a palace, named the **Huángtínggōng** (Yellow Court Palace).\nThere is a small mound within, called the **Dāntuó** (Elixir Mound).\nOn the mound sits a single golden **dǐng** (cauldron), below which true fire is constantly fed, and above which **shén** water is constantly added.\nThe water and fire are **Kǎn** and **Lí** (the **guà** of water and fire).\nThis fire and water are the **jūn** fire (sovereign fire), **chén** fire (minister fire), and **mín** fire (common fire); these three fires are the true flavors, the heart, nature, and intention.\n\nNowadays, people have not yet comprehended these three aspects: the first flavor is not clear, the second not enlightened, and the third, wisdom cannot yet attain the **Dao**. If one attains these three aspects, one achieves the **sān míng liù tōng** (three clarities and six penetrations).\nWhen feeding the fire, one washes above with water and tempers below with fire.\nThe scripture says: 'Fire emerges from below the body, water from above; when the upper unites with the lower and the lower seals the upper, **Qián** and **Kūn** (heaven and earth) harmonize, commanding the dragon to coil around the golden **dǐng** and the tiger to retreat from the **Dāntián**, this is the marvelous method.'\nIt is called the **Tuó dāo guī** (Mound-Knife Pill).\n\nIf one practices this method, they will forever attain peace, comfort, and longevity.\n\nThe question arises: 'Why does one speak of the **Tuó dāo guī** as a single grain, why as self-administered **Tuó dāo guī**, and why as **Tiělí Tuó dāo guī**?'\nThe key is this: The three **Tuó dāo guī** are treasures—**jīng** (essence), **qi**, and blood.\nThe key is this: The **single grain Tuó dāo guī** is the saliva; the **self-administered Tuó dāo guī** is swallowing saliva and ingesting **qi**; the **Tiělí Tuó dāo guī** is the true **qi** in practice, unchanging and unretreatable, driving all malevolent forces to rectification.\nAs when practicing, if hungry, one eats **jīn fàn** (golden food); if thirsty, one drinks **yù jiāng** (jade nectar). When cold, one feeds the fire; when hot, one adds the water.\nThe fire is true **yáng**; the water is true **yīn**.\nThis method is the art of **drawing, supplementing, reducing, and adding**.\n\nThe key is this: **Drawing** is collecting true **qi** from above; **supplementing** is drawing warm **qi** from below into the **Dāntián**. If one warms the **shèn gōng** (kidney palace), all diseases will be dispelled.\n\nThe question arises: 'Why do both men and women sometimes suffer sudden, irregular illnesses?'\nThe answer is this: It is because all men and women are entangled in desires, pleasures, and attachments to the world. By day, they cannot cease nameless vexations; by night, within the realm of senses, they cannot sever the **sān shī** (three corpses)—**yīn guǐ** (demonic spirits)—and thus men deplete their **jīng**, women deplete their blood-**qi**. The three treasures flee, and the original **yáng** is lost, hence the irregular illnesses.\n\nIf one does not heed the words of the **shénxiān** (immortal sages), it is like a leaky, ruined house—if the owner does not repair it, the palace collapses, damaging its beams and pillars, and thus one falls ill.\n\nThe difficulty is this: 'Why do even children, who are pure and undisturbed, not deplete the three treasures yet still suffer irregular illnesses?'\nThe key is this: Children who are sick were, in their past lives, conceived in their mother’s womb when her blood-**qi** was deficient. They did not receive the full ten months of prenatal **qi**, or they were exposed to **winds, excesses, heat, and dampness**, or the four **jì** (seasons) were not properly observed, causing the child to be born with irregular illnesses.\n\nThe question arises: 'Why are there those with ugly or beautiful appearances?'\nThe key is this: Those with a **zhèng** (correct) appearance were conceived when their parents’ **yīn** and **yáng** were harmonized with the **sun** and **moon**—before the **wǔ** hour and after the **chǒu** hour—thus attaining true beauty, longevity, and prosperity. Their correct appearance brings joy to their parents.\nIf conceived after the **wǔ** hour or before the **chǒu** hour, they may have deformed appearances—such as illness, deafness, muteness, or stunted growth—often with inferior natures, displeasing to others, short lives, and lack of prosperity. This is the foundation of **zào huà** (creation).\n\nThe question arises: 'If one encounters a **yuān mó** (grievous demon), how should one treat it?'\nThe key is this: **Qīngjìng** (purity and stillness) is essential.\nIn haste, steal moments of calm; in calm, seek stillness.\nWhen facing difficulties, one must swiftly retreat.\nThe **xīn wáng** (heart-king) must employ the **guàn xiǎng** (pervasive visualization) method, urgently driving the **shén yì** (spiritual intention) into the **shàng ní wán** (upper brain palace), sitting upright and visualizing: before the eyes, Immortal Men and Women dance with celestial music, striking the teeth and settling the mind, gazing upon the **Kūnlún** Mountain’s scenery, seeing the **shàng niú** (upper ox), **yáng** (sheep), **lù** (deer), **mǎ** (horse), and **yù tù** (jade rabbit), and with intention, seizing and binding them above.\nAt the time of practice, suddenly imagine a treasure tree above, with flowers blooming and bearing fruit. With intention, pluck and swallow the fruit—those who consume this will forever attain peace, comfort, and longevity.\nThis is the method of rectification; one sentence comprehended, the great **láo** (barrier) secures the four gates.\nThe key is this: **Xué hǎi mìng mén qì dìng** (the blood sea at the life gate is stabilized), **wú kāi bì hù jīng dìng** (the door of essence is neither opened nor closed), **bù sī wài jìng shén dìng** (the spirit is undisturbed by external affairs).\"",
      "overlap_context": "ith intention, divide the true **qi**, letting it circulate downward. The **yuan** essence of the sun falls into the jaws, flowing from the left corner of the mouth to the right, gathering the saliva as the **xuan** pearl and sweet dew. With the Red Dragon, stir it evenly until it settles, then rinse it as snow-white flowers—it has a sweet taste. The mouth is the eight-colored glass canal, where one essence produces eight flavors of water, and two waters can generate the eight consciousnesses.\"*",
      "start_char": 3079,
      "end_char": 4299,
      "start_sentence": 157,
      "end_sentence": 202,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 26.079057216644287,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\重阳教化集.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "精血散者，性命也。 一意者，为真主人也。 齿是为玄关，闭丹田者为下玄关，提金精上玄者为金关，紧叩齿者为玉锁，六根不动者是六度，号都关。 下纳上腮为顶阳关，鼻为天门，夹脊为双关，行功之时，一齐开锁。 神不动者，意不乱也。 意者恍惚也，此是清静之法也。 及春夏秋冬，但小儿小便黄色者，是丹田虚败，失却下元，存真炁，急用穿九曲之法，又名九转穿小肠，九透真炁入肾堂，小便自然青白色也。 一身便得安乐。 问曰：何者是三乘之法？",
      "translated_text": "The **essence and blood** that scatter are the **nature and life**. The **single-minded intent** is the **true sovereign**.\n\nThe **teeth** are the **Mystic Pass** (*Xuānguān*), the **closing of the elixir field** is the **lower Mystic Pass**, the **raising of the golden essence** to the upper pass is the **Golden Pass** (*Jīnguān*), and the **tight clenching of the teeth** is the **Jade Lock** (*Yùsuǒ*). When the **six senses** remain unmoved, this is the **Six Degrees** (*Liùdù*), called the **Universal Pass** (*Dōuguān*).\n\nThe **lower intake of the upper cheek** is the **Vertex Yang Pass** (*Dǐngyángguān*), the **nose** is the **Heavenly Gate** (*Tiānmén*), and the **spine’s cleft** is the **Double Pass** (*Shuāngguān*). When performing the work, all locks open simultaneously.\n\nWhen the **spirit** does not move, the **intent** does not stray. The **intent** is **flickering**—this is the method of **clarity and stillness**.\n\nIn **spring, summer, autumn, and winter**, if a child’s urine is **yellow**, it means the **elixir field** is **emptied and decayed**, having lost the **lower source**. To **preserve the true qi**, urgently use the **method of piercing the Nine Curves** (*Chuān Jiǔqū*), also called the **Nine Circulations of piercing the small intestine** (*Jiǔzhuàn Chuān xiǎocháng*). The **true qi** will **nine times penetrate the kidney hall**, and the urine will naturally become **greenish-white**. Then, the body will attain **peace and comfort**.\n\n**Question:** What is the **method of the Three Vehicles** (*Sānshèng zhī fǎ*)?",
      "overlap_context": "bearing fruit. With intention, pluck and swallow the fruit—those who consume this will forever attain peace, comfort, and longevity.\nThis is the method of rectification; one sentence comprehended, the great **láo** (barrier) secures the four gates.\nThe key is this: **Xué hǎi mìng mén qì dìng** (the blood sea at the life gate is stabilized), **wú kāi bì hù jīng dìng** (the door of essence is neither opened nor closed), **bù sī wài jìng shén dìng** (the spirit is undisturbed by external affairs).\"",
      "start_char": 4299,
      "end_char": 4502,
      "start_sentence": 203,
      "end_sentence": 211,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 4.717514514923096,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\重阳教化集.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "诀曰：下乘者如新生孩儿，中乘者如小儿坐地，上乘者如小儿行走。 若人通此三乘，便超三界，欲界、色界、无色界。 是心性意显具三身，清静法身，圆满报身，三昧化身。 三者各有显迹之神。 第一会太上炼甲乙木，是虚坦，会老君着青衣，度三千青衣道士者，转青神黄卷三十六部《灵宝尊经》，留下九转丹黄芽穿膝之法绝国。 第二会释迦佛留下，炼南方丙丁火，身被烈火袈裟，三千赤子比丘僧人，留下十二部《大乘尊经》，射九重铁鼓之法、芦芽穿膝之法。 龙华三会，夫子在鲁国之习学堂，炼西方庚辛金，三千白衣居士，留下十卷《论语》，并穿九曲明珠芦芽穿膝之法。 三教者如鼎三足，身同归一，无二无三，三教者不离真道也。 喻曰：似一根树生三枝也。 问曰：大道之中离几等神仙？ 解曰：闻《传道集》中有五等神仙。 第一不持戒，不断酒肉，不杀生，不思善，为鬼仙之类； 第二养真气长命者，为地仙； 第三好战争，是剑仙； 第四打坐修行者，为神仙； 第五孝养师长父母、六度万行方便，救一切众生，断除十恶，不杀生，不食酒肉，‘邪非偷盗出，意同天心，正直无私曲，名曰天仙。 当日初发善心处，便是吉祥之地。 为善法大修行人，后有禁忌之文。 诀曰：男女五月、六月宜清静大忌，十一月、十二月宜清静。 又男子五月、六月大杀之月，勿近妇人，为五劳七伤。 男损性命，女人损性者，是精血气也。 损者令人左瘫右痪，赤白带下。 若损五行真气为劳，损七宝为伤，万病者各有来处。 问曰：病从何生？ 诀曰：万病皆从八节不正之气而生。 问曰：何者八邪？ 诀曰：八卦中阴阳不顺，是八节中气。 令人入邪者，是饥饱劳役风寒暑湿。 饥来痛饱，寒极忧心，远行困倦，及玲热身醉，亦不可行功，变成大病也，宜清静行之。 行时舌上收玉液，丹鼻中收元阳，丹肾堂中收金液，丹如精髓满骨实者，死经百年筋骨不解，名为连子环镇骨。 诀曰：二十四忌大丹者，是一年二十四炁，上令告我师，愿求妙诀，须索意自息，肯舍重金净财。 第一舍身布施，第二将花献师，第三令膳而供养。 解曰：舍身布施者，若见师长父母危时，舍命求命。 将花献师者，若师长须打骂，须将喜笑迎之，面上无嗔恕。 令缮而供养者，食有好味，先奉其师。 此名三布施也。 仙人言曰：坚者为道，欢喜者为缘。 若求师不勤，岂至於道。 吕翁曰：不因师指，此事难知。 又云：学而不知者，不学而悟之，学而不从师，名为盗学也，是法中贼。 若掩祖上师得，促自己寿，与常人同例。 自扬己得，是断行做作，此人可以成道乎？ 其人谓：轻师慢法，不堪为师。 未学修行，先持救济他人者，为救自己者，凭功德行人，各认祖宗科牌。 太上为祖，释迦为宗，夫子为科牌。 自从三教既寂已后，一切男女在爱河内煎煮，苦海漂沉，受其烦恼，六道沉沦，不生不落去住。 三教圣主，三界圣母，却来救度儿女，名号记显现分明，寿印信为其勘同。 解曰：一身为全，受戒者为记，心悟了达者为火。 《随求经》云：如意宝印，从心显名为号，有十号者为十善，十号者为能人。 一号元修，二号转分明，三号通三界，四号长生，五号光明现，六号意通，七号全身主，八号福禄增，九号天元修，十号者为能人。",
      "translated_text": "---\n\n**Question:** What is the **method of the Three Vehicles** (*Sānshèng zhī fǎ*)?\n\n**Answer:** The **method of the Three Vehicles** is as follows: the **lower Vehicle** (*xiàshèng*) is like a newborn babe, the **middle Vehicle** (*zhōngshèng*) is like a child sitting on the ground, and the **upper Vehicle** (*shàngshèng*) is like a child walking.\n\nIf one attains these **Three Vehicles**, they transcend the **Three Realms**—the **Realm of Desire** (*yùjiè*), the **Realm of Form** (*sèjiè*), and the **Formless Realm** (*wúsèjiè*). This reveals the **Threefold Nature** of the mind and body: the **Law-body** (*fǎshēn*) of **clarity and stillness**, the **Reward-body** (*bàoshēn*) of **perfection**, and the **Transformation-body** (*hùeshēn*) of **threefold meditation**.\n\nEach of these has its own **manifested spirit** (*xiǎnjì zhī shén*). The first is the **method of the Highest Venerable** refining the **Wood of A and B**—this is the **Empty Plain** (*xūtǎn*), where the **Highest Venerable** (*Tàishàng*) teaches the **Laozi** in **green robes**, guiding the **Three Thousand Green-Robed Daoists** (*sānqiān qīngyī dào shì*). He leaves behind the **Nine Circulations of Piercing the Small Intestine** (*Jiǔzhuàn Chuān xiǎocháng*), specifically the **Ninefold Transformation of the Elixir’s Greenish-Yellow Sprout** (*Dānhuángyá Chuān xī*), a **supreme method** lost to the world.\n\nThe second is the **method of Śākyamuni Buddha**, refining the **Fire of C and D** (*jiàn diǎnfāng bǐngdīng huǒ*)—the body clad in the **flaming robe of the monastic order** (*lièhuà jiāshā*), where the **Three Thousand Red Children** (*sānqiān chìzǐ*)—the **monks and nuns** (*bīqú sēngrén*)—leave behind the **Twelvefold *Mahāyāna Sūtras*** (*Dàshèng zūn jīng shí’èrbù*). He also transmits the **method of striking the Ninefold Iron Drum** (*shè jiǔchóng tiěgǔ*) and the **Ninefold Transformation of the Reed Sprout** (*Lúyá Chuān xī*).\n\nThe **Dragon Flower Triple Assembly** (*Lónghuá Sān huì*)—where the **Master** (*fūzǐ*) in the **Confucian Study Hall of Lu** (*Lǔguó xíxué táng*)—refines the **Metal of G and H** (*jiàn xīfāng gēngxīn jīn*) for the **Three Thousand White-Robed Laymen** (*sānqiān báiyī jūshì*). He leaves behind the **Ten Volumes of the *Analects*** (*Lúnyǔ shí juàn*), along with the **method of piercing the Nine Curves with the Clear Pearl** (*Míngzhū Chuān Jiǔqū*) and the **Ninefold Transformation of the Reed Sprout** (*Lúyá Chuān xī*).\n\nThe **Three Teachings** are like the **three legs of a cauldron**—their essence converges into **One**. There is no duality, no triplicity; the **Three Teachings** do not depart from the **True Dao** (*zhēndào*).\n\n**Illustration:** It is like a single tree bearing three branches.\n\n**Question:** Within the **Great Dao** (*Dàdào*), how many ranks of **Immortal** (*shénxiān*) are there?\n\n**Answer:** The *Collection of Transmissions* (*Zhuàn Dàojí*) mentions **five ranks of Immortals** (*wǔ děng shénxiān*). The first rank does not uphold **precepts** (*jìe*), does not abstain from **alcohol and meat** (*jiǔròu*), does not refrain from killing, and does not cultivate **virtue** (*shàn*). Such are the **Ghostly Immortals** (*guǐxiān*).\n\nThe second rank cultivates **True Qi** (*zhēnqì*) for longevity and becomes **Earthly Immortals** (*dìxiān*).\n\nThe third rank loves **warfare** (*zhànzhēng*) and is called **Sword Immortals** (*jiànxiān*).\n\nThe fourth rank practices **sitting meditation** (*dǎzuò xiūxíng*) and is known as **Spirit Immortals** (*shénxiān*).\n\nThe fifth rank honors **teachers and elders**, **parents and children**, and practices the **Six Perfections** (*liùdù*) and **Ten Thousand Benevolent Means** (*wànxíng fāngbiàn*) to save all beings, cutting off the **Ten Evils** (*shí’è*), refraining from killing, and abstaining from **alcohol and meat** (*jiǔròu*). They embody **righteousness without deceit**, their **intent harmonizes with the Heavenly Mind** (*yì tóng tiānxīn*), and their **conduct is straight and unselfish** (*zhèngzhí wú sīqū*). Such are called **Heavenly Immortals** (*tiānxiān*).\n\nWhen one first awakens to **good intent** (*shànxīn*), that is the **auspicious land** (*jíxiáng zhī dì*). For those who practice **great cultivation** (*dà xiūxíng*) in the **good dharma**, there are **prohibitions** (*jìn jì*) to observe.\n\n**Prohibition:** In the **fifth and sixth months**, and the **twelfth month**, one must **preserve clarity and stillness** (*qīngjìng*), avoiding great disturbances.\n\nAdditionally, the **fifth and sixth months** are months of **great slaughter** (*dà shā*), so men must not approach women, lest they suffer the **Five Strains and Seven Injuries** (*wǔ láo qī shāng*). Men who damage their **vital essence and blood** (*jīngxiě qìyè*) lose their **life and vitality**, while women who damage their **vital essence** (*jīngxiě*) lose their **fertility**. This is because they harm the **True Qi of the Five Phases** (*wǔxíng zhēnqì*), resulting in **Five Strains** (*láo*), or the **Seven Treasures** (*qī bǎo*), causing **Seven Injuries** (*shāng*). All diseases arise from these imbalances.\n\n**Question:** How do diseases originate?\n\n**Answer:** All diseases stem from **improper alignment of the Eight Nodes** (*bājié bùzhèng zhī qì*).\n\n**Question:** What are the **Eight Evils** (*bāxié*)?\n\n**Answer:** The **Eight Evils** arise when **yin and yang** are **out of harmony** within the **Eight Trigrams** (*bāguà*), manifesting as **Eight Nodal Qi** (*bājié zhī qì*). They lead one into **evil** through **hunger, overindulgence, labor, exertion, wind, cold, heat, and dampness** (*jī lái tòng bǎo, hánjí yōuxīn, yuǎnxíng kùnjuàn, língrè shēnzuì*). During such times, one must not practice **internal alchemy** (*xínggōng*), as it may transform into **grave illness** (*dàbìng*), and **clarity and stillness** (*qīngjìng*) should be preserved.\n\nWhen practicing, one must **collect the Jade Essence** (*Yùyè*) on the tongue, **collect the Primordial Yang** (*Yuányáng*) in the **Elixir Nose** (*Dānbí*), **collect the Golden Essence** (*Jīnyè*) in the **Elixir Kidney Hall** (*Dāngǔtáng*), and **fill the bones with the refined marrow and essence** (*rújīng suǐ mǎn gǔ shí*). Such a body, even after **a hundred years of death**, remains **unrotted** (*jīnggǔ bùjiě*), known as the **method of the Connected Child and the Pearl that Secures the Bones** (*Liánzǐ huán zhèn gǔ*).\n\n**Prohibition:** The **Twenty-Four Great Prohibitions** (*èrshísì jìn*) for the **Great Elixir** (*Dàdān*) are the **Twenty-Four Qi of the Year** (*yīnián èrshísì qì*). If one wishes to seek **wondrous methods** (*miàojué*), they must first **calm their intent** (*yì zì xī*) and **surrender wealth and possessions** (*kěn shě zhòngjīn jìngcái*).\n\nThe first is **sacrificing one’s body** (*shěshēn bùshī*)—when one sees their **teachers, elders, parents, or children** in peril, they **offer their life to save another** (*shěmìng qiúmìng*).\n\nThe second is **presenting flowers to the teacher** (*jiānghuā xiànshī*)—when their **teachers or elders** are about to **scold or strike**, they must **welcome them with joy and smiles**, ensuring their face bears no **anger or resentment** (*miànshàng wú zhēnshù*).\n\nThe third is **preparing meals to honor the teacher** (*lìngshàn ér gōngyǎng*)—when food is **delicious**, they must first **offer it to their teacher** (*xiān fèng qí shī*). This is called the **Threefold Sacrifice** (*Sān bùshī*).\n\n**The Immortals say:** **Perseverance** (*jiān*) is the **Dao**, and **joy** (*huānxǐ*) is the **connection** (*yuán*). If one does not **diligently seek their teacher** (*qióng qí shī*), how can they attain the **Dao**?\n\n**Lu the Elder** (*Lǚ wēng*) says: Without the **teacher’s guidance** (*bùyīn shī zhǐ*), this matter is **difficult to know** (*cǐshì nánzhī*).\n\nAgain, it is said: **One who studies without understanding** (*xué ér bùzhì*) is not truly studying; **one who studies but does not follow their teacher** (*xué ér bùcóngshī*) is **stealing learning** (*dàoxué*), a **thief within the method**. If they **conceal their ancestral teachers** (*yǎn zǔshàng shīdé*), they **shorten their own lifespan** (*cù zìjǐ shòu*), just as ordinary people do.\n\n**To exalt oneself while belittling the teacher** is to **hold fast to false pretenses** (*qīnggōng zuòzuò*), a **disruptive practice**. Can such a person truly attain the **Dao**?\n\n**The Immortals say:** Those who **despise their teachers and slight the method** (*qīngshī mànfǎ*) are **unworthy of being teachers**. Those who have **not yet begun cultivation** (*wèixué xiūxíng*) but **already claim to save others** are **saving themselves**. All are **guided by their merits and virtues** (*píng gōngdé xíngrén*), each recognizing their own **ancestral lineage and scriptural authority** (*zǔzōng kēpái*).\n\nThe **Highest Venerable** (*Tàishàng*) is the **ancestor**, Śākyamuni is the **master**, and the **Master** (*fūzǐ*) is the **scriptural authority** (*kēpái*).\n\nSince the **Three Teachings** have **fallen into stillness**, all men and women are **tossed in the River of Love** (*ài hé*) and **drift in the Sea of Suffering** (*kǔ hǎi*), enduring **affliction** (*fánnǎo*). They **sink into the Six Realms** (*liùdào chénlún*), neither **born nor extinguished**, neither **here nor gone**.\n\nThe **Holy Masters of the Three Teachings** (*Sān jiào shèngzhǔ*) and the **Holy Mothers of the Three Realms** (*Sān jiè shèngmǔ*) come to **save and guide their children** (*qiùlái jiùdù érnǚ*), with **names and manifestations** clearly recorded (*míng hào jì xiǎnbiān míng*). Their **lifespan seals** (*shòuyìn*) and **verification marks** (*xìn wéi*) serve as **proof of identity** (*qǎn tóng*).\n\n**Explanation:** The **whole body** (*yīshēn*) is **complete** (*wéi quán*). Those who **receive precepts** (*shòu jìe*) are **recorded** (*wéi jì*), and those who **awaken in understanding** (*xīn wù liǎo dá*) are **verified by fire** (*wéi huǒ*). The *Sūtra of Meeting Requests* (*Suíqiú jīng*) states: The **Print of the Wish-Fulfilling Jewel** (*Rúyì bǎo yìn*) reveals its **name from the heart** (*cóngxīn xiǎn míng*), and those with **ten names** (*shí hào*) are the **Ten Good Deeds** (*shíshàn*) or the **Able Ones** (*néngrén*). The first name is **Primordial Cultivation** (*Yuán xiū*), the second is **Clarification of Transformation** (*Zhuǎn míng*), the third is **Penetration of the Three Realms** (*Tōng sānjiè*), the fourth is **Longevity** (*Chángshēng*), the fifth is **Manifestation of Radiance** (*Guāngmíng xiǎn*), the sixth is **Harmony of Intent** (*Yì tóng*), the seventh is **Master of the Whole Body** (*Quánshēn zhǔ*), the eighth is **Increase of Fortune and Wealth** (*Fúlù zēng*), the ninth is **Primordial Cultivation of Heaven** (*Tiān yuán xiū*), and the tenth is the **Able One** (*Néngrén*).",
      "overlap_context": "and decayed**, having lost the **lower source**. To **preserve the true qi**, urgently use the **method of piercing the Nine Curves** (*Chuān Jiǔqū*), also called the **Nine Circulations of piercing the small intestine** (*Jiǔzhuàn Chuān xiǎocháng*). The **true qi** will **nine times penetrate the kidney hall**, and the urine will naturally become **greenish-white**. Then, the body will attain **peace and comfort**.\n\n**Question:** What is the **method of the Three Vehicles** (*Sānshèng zhī fǎ*)?",
      "start_char": 4502,
      "end_char": 5740,
      "start_sentence": 212,
      "end_sentence": 261,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 41.10953116416931,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\重阳教化集.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "一加性十号，无漏功德自然成。 三教者，是随意演化众生，皆不离於道也。 古人言曰：世间性命事大。 修行者生、老、病、死、苦，今人各不晓真道，往往着空尽落空，现在亦不能了，何言过去之事。 又闻《达磨经》云：过去非言实，未来不为真。 太上炼九转还丹，令人去病疾，了生死。 夫子教仁、义、礼、智、信，恐人招业在身，令人修此亦能治其疾病。 问曰：如何治於病疾？ 诀曰：除眼大良药。 解曰：长大欢，为良药。 诀曰：欢喜者，是药之根本。 常烦恼者，是万病之根本。 或常清静者，是大道之苗。 但见今人修行，或僧道五戒，男子妇人，却因甚病疾无常。 或男子女人，有夫无妇者，丹田走却灵龟，耗散真炁，下元虚冷，渐生万病。 男子清静六十四日精炁满，女子清静四十九日血炁满。 物极者则返，清为浊返，静为动返。 心意散失，九窍走却真气。 炁浊令女子月水多，男子夜梦阴境，盗了七珍八宝，故人有疾病也。 问曰：阴鬼如何治之？ 答曰：用刀圭之法。 曰：何者为刀圭？ 诀曰：刀圭者，一也。 有水有气能生万物也。 炁为圭，为云水，为雨。 又曰：出炁为刀，入炁为圭，行功为万有，验者为刀圭，是返老还童也。 经云：身下出火，身上出水，水火为药。 诀曰：芦芽穿膝上下河车，安垆灶是紫河车，搬精补脑之上车，进火时水暖，进水时火凉，水火双行者，是温温铅鼎，鼎中入气起休，交上随车火时，散入百脉，皮肤滋润，身体光泽，此是修养之法。 难曰：因何人肥者先衰？ 诀曰：肥人者，修外不修裹，骨中无髓，丹田走却真炁，故衰病也。 修内道者，安乐长生之苗。 诀曰：长教龙盘金鼎，虎达丹田，震卦起雷，巽卦起风，行功时漱津一大口，分三度咽，按气下行三徧，自然有龙吟虎啸之声。 亦能除腹中万病，耳听之如雷槌画鼓。 上者为升，下者为降，颂曰：真空妙理无人知，曲江端坐看乌飞。 震地雷声惊鬼魅，正是阴阳造化时。 子后午前，加减用水火烹煎，龙虎随金公带酒，黄婆醉拽定王公问是谁。 问曰：金公是神，黄婆是炁，阳炁是婴儿，阴炁是姹女。 青龙者是肝之炁也，白虎者是肺之炁也，坎离者是精血。 诀曰：行功时坐如泰山，立如宝塔，牢镇四门，紧叩玄关，漱津一口，为猛三咽下，接炁过离隔，活作三度，自然龙虎之炁复如行住坐卧禁口闭目、耳不听声、眼视内景，一日正观丹田，意中想见，随呼炁下降，随吸炁上升，不过离隔，不教注面目上，六炁各到，中元相见。 清炁右行，浊气左行。 各转九遭，炁上下不能出，左右结成垆灶，号龙盘虎远，气自然和会。 又婴儿姹汝为夫妇之法，炁聚於脾上安垆，号黄婆匹配之法。 又名天地交泰之法。 又名坎离交媾，是体交神不交之法。 神不交者，是清静之法，千徧不摇不动之法。 今人者多修外道，不修内道，见在道过去法。 夫修行者，外有条大道教，内有正路，无人知处。 大众前行三里，见三条大涧亦无底，怎生过去？ 诀曰：三条大涧者，是三教三乘，起三尸，定三宝，超三界。 向前又行三里见六条深沟，不能前进，是何门？ 诀曰：是六度万行，六根清静，斩六贼，戒六欲，树六梯。 向前又行三里，见三产枋，是宝净枋，七林尸多便是临作用。",
      "translated_text": "The **Primordial Dao** (*Yuán Dào*)—when **qi** (*qì*) is added to the **ten names** (*shí hào*), **impermeable virtue** (*wúlòu gōngdé*) naturally arises.\n\nThe **Three Teachings** (*sān jiào*) are those that, according to one’s will, transform and guide beings—all without departing from the **Dao/Way** (*Dào*).\n\nThe ancients spoke thus: *\"Worldly affairs of life and death are profound.\"* Those who practice may suffer **birth, aging, sickness, and death** (*shēng lǎo bìng sǐ*), as well as **suffering** (*kǔ*). Yet people today do not recognize the **true Dao/Way** (*zhēn Dào*), often clinging to emptiness and thus falling into futility. Even now, they cannot grasp it—how then could they comprehend the **past** (*guòqù*)?\n\nMoreover, the **Dharma Scripture** (*Dá Mó jīng*) states: *\"The past is not spoken as true, the future is not considered real.\"*\n\nThe **Supreme Sage** (*Tàishàng*) refines the **Nine Transformations** (*jiǔ zhuǎn*) of the **Elixir** (*huán dān*), enabling one to **ward off sickness and illness** (*qù bìngjí*), **transcend life and death** (*liǎo shēngsǐ*).\n\n**Master Confucius** (*Fūzǐ*) taught **benevolence** (*rén*), **righteousness** (*yì*), **propriety** (*lǐ*), **wisdom** (*zhì*), and **trustworthiness** (*xìn*), fearing that people might **invite karmic retribution** (*zhāo yè*) upon themselves. Yet, those who cultivate these virtues can also **treat their ailments** (*zhì qí jíbìng*).\n\n**Question:** How does one **treat sickness and illness** (*bìngjí*)?\n**Formula:** *\"Remove the eyes—great remedy.\"* **Explanation:** *\"Long-term joy is the remedy.\"* **Formula:** *\"Joy is the root of this remedy. Constant vexation is the root of all diseases.\"*\n\nOr, those who **abide in stillness and tranquility** (*cháng qīngjìng*) are the **sprouts of the Great Dao** (*dà Dào zhī miáo*).\n\nYet, observing today’s practitioners—be they **monks, Daoists, or those of the Five Precepts** (*wúguǎn sān jiào wǔjiè*)—men and women alike, one wonders: **Why do they face sickness, impermanence, and suffering**?\n\nOr, **men and women who have partners yet lack spouses** (*yǒu fū wú fù*), their **Elisir Field** (*dān tián*) scatters the **Spirit Turtle** (*líng guī*), dissipating **true qi** (*zhēn qì*), leaving the **Lower Elixir Field** (*xià yuán*) cold and void—thus generating **all diseases** (*jiàn shēng wàn bìng*).\n\nWhen **men abide in stillness for sixty-four days**, their **semen-qi** (*jīng qì*) is full; when **women abide in stillness for forty-nine days**, their **blood-qi** (*xuè qì*) is full.\n\n**Extremes invert** (*wùjí zhě zé fǎn*): **stillness returns to motion** (*jìng wéi dòng fǎn*), **clarity returns to turbidity** (*qīng wéi zhuó fǎn*).\n\nWhen **heart and intent** (*xīn yì*) scatter, **true qi** flows from the **nine orifices** (*jiǔ qiào*), leaving the body depleted.\n\n**Turbid qi** (*zhuó qì*) causes **women’s menstrual flow** (*yuè shuǐ*) to increase and **men’s nocturnal emissions** (*yè mèng*), where **yīn-qi** (*yīn qì*) **steals the Seven Treasures and Eight Jewels** (*qiè le qī zēn bā bǎo*), thus leading to **disease** (*jíbìng*).\n\n**Question:** How does one **treat yīn-ghosts** (*yīn guǐ*)?\n**Answer:** *\"Use the **Sword and Chisel Method** (*Dāo guī zhī fǎ*).\"*\n**Question:** *\"What is the **Sword and Chisel Method**?\"*\n**Formula:** *\"The **Sword and Chisel** (*Dāo guī*) is **One** (*yī*). It contains **water** (*shuǐ*) and **qi** (*qì*), able to **generate all things** (*shēng wàn wù*).*\n**Qi** is the **Chisel** (*guī*), forming **clouds and rain** (*yún shuǐ*), and **rain** (*yǔ*).\n\n**Formula:** *\"Expelling **qi** is the **Sword** (*dāo*), drawing in **qi** is the **Chisel** (*guī*). When **function** (*xíng gōng*) is applied, it becomes **all things** (*wàn yǒu*). The **verified adept** (*yàn zhě*) practices the **Sword and Chisel**—this is the **Method of Reversing Aging and Restoring Youth** (*fǎn lǎo huán tóng*).\" The **Scripture** (*jīng*) says: *\"Fire issues from below the body, water from above—water and fire are the remedies.\"*\n\n**Formula:** *\"**Lotus Sprouts piercing the knees** (*lú yá chuān xī shàngxià hé chē*), **installing the furnace** (*ān niè zào*) is the **Purple River Cart** (*zǐ hé chē*). **Moving semen to nourish the brain** (*bān jīng bǔ nǎo*) is the **Upper Cart** (*shàng chē*). When **fire is advanced**, **water grows warm**; when **water is advanced**, **fire grows cool**. Those who **dual-circulate water and fire** (*shuǐ huǒ shuāng xíng*) are practicing the **Gentle Lead Furnace** (*wēn wēn yīn dǐng*). When **qi enters the furnace**, **rest** (*xiū*) arises. **Following the Golden Sovereign** (*jīn gōng dài jiǔ*), **Dragon and Tiger** (*lóng hǔ*) **qi** circulates—**semen and blood** (*jīng xuè*) **scatter into the hundred meridians** (*bǎi mài*), **skin and flesh become moist** (*pí fū zī rùn*), and the **body shines** (*shēn tǐ guāng zé*). This is the **Method of Nourishment and Cultivation** (*xiū yǎng zhī fǎ*).\n\n**Difficulty:** *\"Why do the fat first wither?\"* **Formula:** *\"The fat are those who **cultivate externally but neglect internally** (*xiū wài bù xiū nèi*), whose **bones lack marrow** (*gǔ zhōng wú suǐ*). Their **Elisir Field** scatters **true qi**—thus they **wither and fall ill** (*jiù shuāi bìng*).\" Those who **cultivate the Inner Dao** (*xiū nèi Dào*) are the **sprouts of eternal bliss and longevity** (*ān lè chángshēng zhī miáo*).\n\n**Formula:** *\"**Dragon Swirls around the Golden Furnace** (*lóng pán jīn dǐng*), **Tiger reaches the Elixir Field** (*hǔ dá dān tián*), the **Thunderbolt Coil** (*zhèn guà qǐ léi*) and the **Wind Coil** (*xùn guà qǐ fēng*)—when **function is applied**, **rinse the saliva** (*xǐ jīng*) in one great gulp, **swallow three times** (*fēn sān dù yàn*), and **press the qi downward in three cycles** (*àn qì xià xíng sān biàn*). **Dragon’s Brontes and Tiger’s Roars** (*lóng yīn hǔ xiào*) naturally arise.\n\nThis also **removes all abdominal diseases** (*chú fù zhōng wàn bìng*), and the sound is **like thunderbolts striking drums** (*ěr tīng zhī rú léi chuì huà gǔ*).\n\n**Ascending** (*shàng*) is **elevation** (*shēng*), **descending** (*xià*) is **reduction** (*jiàng*). The **hymn** (*sòng*) says:\n*\"The subtle truth of **True Emptiness** (*zhēn kōng*) few know,\nSitting at **Curve River** (*Qū Jiāng*), watching swallows fly.\nThunder shakes the earth, ghosts and spirits tremble—\nThis is the **moment of yīn-yáng transformation** (*zhèngshì yīn yáng zào huà shí*).\"*\n\nBefore **midday** (*wǔ shí*), **adjust fire and water** (*jiā jiǎn yòng shuǐ huǒ shēng jiān*), **Dragon and Tiger** follow the **Golden Sovereign** (*jīn gōng*), **drunk with wine** (*huáng pó zuì zhuài*). The **Yellow Grandmother** (*huáng pó*) **drags the King** (*dìng wáng*), asking: *\"Who are you?\"*\n\n**Question:** *\"The **Golden Sovereign** is **Deity** (*shén*), the **Yellow Grandmother** is **qi** (*qì*). **Yīn-qi** is the **infant** (*yīng ér*), **yáng-qi** is the **virgin** (*chī nǚ*).\"*\n**The Azure Dragon** (*qīng lóng*) is the **qi of the liver** (*gān zhī qì*), **The White Tiger** (*bái hǔ*) is the **qi of the lungs** (*fèi zhī qì*), **Kàn and Lí** (*kǎn lí*) are **semen and blood** (*jīng xuè*).\n\n**Formula:** *\"When **function** is applied, sit **like Mount Tài** (*rú Tàishān*), stand **like a Jewel Pagoda** (*rú bǎo tǎ*). **Secure the Four Gates** (*láo zhèn sì mén*), **knock firmly at the Mystic Pass** (*jǐn kòu xuán guān*). Rinse the **saliva** (*jīng*) in one gulp, **swallow it three times** (*wéi měng sān yàn xià*), **crossing the Kàn-Lí barrier** (*jiē qì guò lí gé*). **Activate it three times** (*huó zuò sān dù*), and naturally **Dragon and Tiger qi** will **move, rest, sit, or lie** (*xíng zhù zuò wò*), **closing the mouth and eyes** (*jìn kǒu bì mù*), **hearing no sound** (*ěr bù tīng shēng*), **seeing only inner landscapes** (*yǎn shì nèi jǐng*). **Fix the gaze upon the Elixir Field** (*yī rì zhèng guān dān tián*), **visualizing within the mind** (*yì zhōng xiǎng jiàn*), **following exhalation, qi descends** (*suí hū qì xià jiàng*), **following inhalation, qi ascends** (*suí xī qì shàng shēng*). It **does not cross the Kàn-Lí barrier** (*bù jiào lí gé*), nor **does it allow the qi to rush to the face** (*bù jiào zhù miàn mù shàng*). The **six qi** (*liù qì*) **each arrive** (*gè dào*), and at the **Middle Elixir Field** (*zhōng yuán*), they **meet** (*xiāng jiàn*).\n\n**Pure qi** (*qīng qì*) **moves rightward** (*yòu xíng*), **turbid qi** (*zhuó qì*) **moves leftward** (*zuǒ xíng*). Each **circulates nine times** (*gè zhuǎn jiǔ zāo*), and **qi cannot exit upward or downward** (*qì shàng xià bù néng chū*), nor **can it scatter left or right** (*zuǒ yòu jié chéng niè zào*). This is called the **Dragon Swirls, Tiger Retreats Method** (*lóng pán hǔ yuǎn zhī fǎ*), and **qi naturally harmonizes** (*qì zìrán hé huì*).\n\nMoreover, the **infant and virgin** (*yīng ér chī nǚ*) **pair as husband and wife** (*wéi fū fù zhī fǎ*), and **qi gathers at the spleen** (*pí shàng ān niè*)—this is the **Yellow Grandmother Matching Method** (*huáng pó pǐ qì zhī fǎ*). It is also called the **Heaven-Earth Intercourse Harmony Method** (*tiān dì jiāo tài zhī fǎ*), or the **Kàn-Lí Intercourse Method** (*kǎn lí jiāo gòu zhī fǎ*)—this is the **Method of Body Intercourse without Sexual Union** (*shēn jiāo shén bù jiāo zhī fǎ*).\n\n**Deity does not engage in intercourse** (*shén bù jiāo*)—this is the **Method of Stillness and Clarity** (*qīng jìng zhī fǎ*), the **Thousand Circulations without Movement** (*qiān biàn bù yáo zhī fǎ*).\n\nYet, people today **mostly practice external Dao** (*duō xiū wài Dào*), not **internal Dao** (*nèi Dào*), and **see the Dao only in past teachings** (*jiàn Dào guòqù fǎ*).\n\n**Cultivators** (*xiūxíng zhě*) may follow the **Three Great Teachings** (*sān jiào sān shēng*) on the **path**, but when they **advance three li**, they encounter **three great ravines** (*sān jiào sān shēng*) **without bottom** (*wú dǐ*). How then can they **cross**?\n\n**Formula:** *\"The **three great ravines** (*sān jiào sān shēng*) are the **Three Teachings and Three Vehicles** (*sān jiào sān shēng*), **awakening the Three Corpses** (*qǐ sān shī*), **establishing the Three Treasures** (*dìng sān bǎo*), **transcending the Three Realms** (*chuāo sān jiè*).\"*\n\n**Advancing another three li**, they see **six deep trenches** (*liù shēn gōu*), unable to **progress further** (*bù néng qián jìn*). What **gate** (*mén*) is this?\n\n**Formula:** *\"These are the **Six Perfections and Ten Thousand Practices** (*liù dù wàn xíng*), **Six Roots in Stillness** (*liù gēn qīng jìng*), **Severing the Six Bandits** (*zhǎn liù zéi*), **Restraining the Six Desires** (*jiè liù yù*), **Planting the Six Ladders** (*shù liù tī*).\"*\n\n**Advancing another three li**, they encounter **three ruined beams** (*sān chǎn fāng*). These are the **Treasure-Purification Beams** (*bǎo jìng fāng*), and when the **Seven Woods Corpses** (*qī lín shī*) **multiply**, this is the **Critical Moment of Application** (*lín zuò yòng*).",
      "overlap_context": "n of Transformation** (*Zhuǎn míng*), the third is **Penetration of the Three Realms** (*Tōng sānjiè*), the fourth is **Longevity** (*Chángshēng*), the fifth is **Manifestation of Radiance** (*Guāngmíng xiǎn*), the sixth is **Harmony of Intent** (*Yì tóng*), the seventh is **Master of the Whole Body** (*Quánshēn zhǔ*), the eighth is **Increase of Fortune and Wealth** (*Fúlù zēng*), the ninth is **Primordial Cultivation of Heaven** (*Tiān yuán xiū*), and the tenth is the **Able One** (*Néngrén*).",
      "start_char": 5740,
      "end_char": 6966,
      "start_sentence": 262,
      "end_sentence": 313,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 44.05089235305786,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\重阳教化集.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "行三里，又见一座园，名为舍果园。 一翁看定园门，有缘者空手得过。 向前园又行三里，见一根大树上击定金牛，河边上有座台，男子黄金台，女子凤凰台，神仙钓鱼台，安乐千花台，若无常望乡台。 河口有三个女子，渡口便是魔女。 众满舟船，过此河。 又行三里，见一座大山，名是须弥山，山束坡有一只青羊，是老君之炁，西坡见一只白羊，是夫子之炁，正南见一只黄羊，是大觉金仙之炁。 三个羊儿引接大众入山，名三阳聚鼎山。 山中有一座城，名为北城，有四门，门上有牌，牌上有字。 东是开光门，西是长生门，南是金光门，北是大沦门。 此是眼、耳、鼻、口。 入得四门，见四洞府，天乐洞、白云洞、竹国洞，长生洞。 入得四洞，见四寺，无净寺，玄空寺，竹林寺。 〔入四寺〕，有四果，安禅罗汉，斯陀，含须陀，洹阿那含阿罗汉，为四寺主，此是四果仙人也。 向前又见五观，第一功名观，第二医药观，第三安阳观，第四真如观，第五兜率观。 五观中有五宫，双女宫是眼，大龙宫是口，上白宫是鼻，水晶宫是耳，天秤宫是心。 内坐大楼阁，上下十二呼吸，名曰十二重楼也。 有中宫楼、月宫楼、天仙楼、取宝楼、圣井楼、法炁妙音楼、识道楼、禅顶楼、景阳楼、锺鼓楼、二圣楼。 每年十二月一日十二时，人身中有十二月楼，楼者按经十二经十二支干。 四面又见九宫，是人有九窍也。 夫九窍宫者，东有风雷宫，双林宫，南有紫微宫、牟尼宫，西有圣母官、惠罗宫，北有梵宫、水晶宫，中央号安宫。 此名为九宫，犹地列九州也。 又微府元共计十州也，是十国，焦祖国、牟尼国、开花国、鹿严国、金色国、琉璃国、舍卫国、南禅国、天竺国、重阳国。 十国者便是十地，每一地中一坐泰山。 身是甚物，是治种大病，皆伤人命。 身有四大海，津为东海，血为南海，髓为西海，气为北海。 更有九洲，小肠是也。 更有五湖，身是洞庭湖。 精是玉湖，甘露是醍醐，心为玄湖，小肠为江湖。 日月星辰三消，血、气、精衰也。 三消是山崩海竭地裂，一日十二时辰中，得坐莫越其人，功成果满，男子炼形如童男，女子炼形如童女。 经云：形神俱妙，与道合真，此是抽胎换骨之法，阴阳颠倒五行真诀。 五行含金、木、水、火、土。 春木旺，内木不旺，人多病眼疾。 夏火旺，内火不旺，人多泻痢。 秋金旺，内金不旺，人多咳嗽。 冬水旺、内水不旺，人多疝气。 脾为土，四季分了，脾气阴阳颠倒返复也。 五行各有相克，金克木、木克土、土克水、水克火、火克金。 水火者，是阴阳也。 一阴一阳真道也，精血也。 人有万病，尽不干五脏之事，都是损了父母精血，丹田弱便生病疾也，急收神定性。 《九仙经》云：道者，一也。 人得一者，万事必成。 行功时神气转，炁逐意行，运时前赶前冲，为阴左将阴神，六甲驱转，六相八识，匡一真灵内，游九宫，看玩十国，长生降台，使婴儿姹女丹田安炉灶，进火烧药，意想见炉红灶热，丹药方成。 意想青龙在左，白虎在右，朱雀在前，玄武在后，四坐大神各手执长枪阔剑，看定药炉，自服妙药，若人累行此功，永得长生，令邪气自散，真气自生，口若饮荆山玉泉，口中自然香甜也。",
      "translated_text": "「Advancing another three li**, they see **one garden** (*yī zuò yuán*), named the **Garden of Discarded Fruits** (*shě guǒ yuán*). There is an **old man** (*yī wēng*) who gazes fixedly at the garden gate; those with **affinity** (*yǒu yuán*) pass through with **empty hands** (*kòng shǒu*).\n\n**Advancing another three li** within the garden, they encounter **a great tree** upon which **a golden ox** (*jīn niú*) is struck and **fixed**. Beside the river, there are **five platforms** (*wǔ zuò tái*):\n\n- the **Male’s Yellow Gold Platform** (*nán zǐ huáng jīn tái*)\n- the **Female’s Phoenix Platform** (*nǚ zǐ fèng huáng tái*)\n- the **Divine Fishermen’s Platform** (*shén xiān diào yú tái*)\n- the **Eternal Peace, Thousand Flowers Platform** (*ān lè qiān huā tái*)\n- the **Platform of the Impermanent Homeland** (*wú cháng wàng xiāng tái*).\n\nAt the river’s mouth, there are **three women** (*sān gè nǚ zǐ*), and the **ferry** (*dù kǒu*) is the **witch’s crossing** (*mó nǚ*).\n\nWhen the **multitude fills the boat** (*zhòng shàn zhōu chuán*), they must **cross this river** (*guò cǐ hé*).\n\n**Advancing another three li**, they see **a great mountain** (*yī zuò dà shān*), named **Mount Sumeru** (*xū mí shān*). Upon its slopes, there are **three rams**:\n\n- a **green ram** (*qīng yáng*) on the eastern slope, which is **Laozi’s qi** (*lǎo jūn zhī qì*)\n- a **white ram** (*bái yáng*) on the western slope, which is **the Master’s qi** (*fū zǐ zhī qì*)\n- a **yellow ram** (*huáng yáng*) on the southern slope, which is **the Great Awakening Golden Immortal’s qi** (*dà jué jīn xiān zhī qì*).\n\nThe **three rams guide and escort** (*sān gè yáng ér yǐn jiē dà zhòng rù shān*) the multitude into the mountain, known as **Mount Three Yang Converging at the Cauldron** (*sān yáng jù dǐng shān*).\n\nWithin the mountain, there is **a walled city** (*yī zuò chéng*), named **Northern City** (*běi chéng*), with **four gates** (*sì mén*), each bearing a **plaque** (*pái*) inscribed with **characters** (*zì*):\n\n- the **Gate of Radiant Brilliance** (*kāi guāng mén*) to the east\n- the **Gate of Longevity** (*cháng shēng mén*) to the west\n- the **Gate of Golden Radiance** (*jīn guāng mén*) to the south\n- the **Gate of Great Sinking** (*dà lún mén*) to the north.\n\nThese correspond to the **four senses** (*sì mén*): **eye** (*yǎn*), **ear** (*ěr*), **nose** (*bí*), and **mouth** (*kǒu*).\n\nUpon entering the **four gates**, they see **four caverns** (*sì zuò dòng fǔ*):\n\n- the **Cavern of Celestial Music** (*tiān lè dòng*)\n- the **Cavern of White Clouds** (*bái yún dòng*)\n- the **Cavern of the Bamboo Grove** (*zhú guó dòng*)\n- the **Cavern of Longevity** (*cháng shēng dòng*).\n\nWithin the **four caverns**, they encounter **four temples** (*sì zuò sì*):\n\n- the **Temple of Non-Purity** (*wú jìng sì*)\n- the **Temple of Mysterious Emptiness** (*xuán kōng sì*)\n- the **Temple of the Bamboo Forest** (*zhú lín sì*).\n\n**[Upon entering the four temples,]**, there are **four fruits** (*sì zuò guǒ*):\n\n- the **Arhat of Tranquil Meditation** (*ān chán luó hàn*)\n- the **Stream-Enterer** (*sī tuó*)\n- the **Once-Returner** (*hán xū duō*)\n- the **Non-Returner Arhat** (*wú guān rú hán luó hàn*), who serve as the **four temple masters** (*sì sì zhǔ*), these being the **four fruit Immortals** (*sì guǒ xiān rén*).\n\n**Advancing further**, they see **five visions** (*wǔ guān*):\n\n1. the **Vision of Merit and Fame** (*gōng míng guān*)\n2. the **Vision of Medicine and Pharmacy** (*yī yào guān*)\n3. the **Vision of Eternal Peace** (*ān yáng guān*)\n4. the **Vision of True Suchness** (*zhēn rú guān*)\n5. the **Vision of Tuóshuà** (*diào shuài guān*).\n\nWithin the **five visions**, there are **five palaces** (*wǔ guān zhōng yǒu wǔ gōng*):\n\n- the **Palace of Twin Maidens** (*shuāng nǚ gōng*), which is the **eye**\n- the **Palace of the Great Dragon** (*dà lóng gōng*), which is the **mouth**\n- the **Palace of Upper Whiteness** (*shàng bái gōng*), which is the **nose**\n- the **Palace of Crystal Waters** (*shuǐ jīng gōng*), which is the **ear**\n- the **Palace of Celestial Scales** (*tiān chēng gōng*), which is the **mind** (*xīn*).\n\nInside sits **a grand pavilion** (*dà lóu gé*), with **twelve breaths** (*shàng xià shí èr hū xī*) above and below, named the **Twelve-Layered Pavilion** (*shí èr chóng lóu*).\n\nThere are also:\n- the **Central Palace Pavilion** (*zhōng gōng lóu*)\n- the **Moon Palace Pavilion** (*yuè gōng lóu*)\n- the **Heavenly Immortal Pavilion** (*tiān xiān lóu*)\n- the **Pavilion of Taking Treasures** (*qǔ bǎo lóu*)\n- the **Holy Well Pavilion** (*shèng jǐng lóu*)\n- the **Pavilion of Dao-Qi’s Wondrous Sound** (*fǎ qì miào yīn lóu*)\n- the **Pavilion of Knowing the Dao** (*shí dào lóu*)\n- the **Pavilion of Zen Summit** (*chán dǐng lóu*)\n- the **Pavilion of Bright Resonance** (*jǐng yáng lóu*)\n- the **Drum Tower Pavilion** (*zhōng gǔ lóu*)\n- the **Pavilion of the Two Saints** (*èr shèng lóu*).\n\nEach year on the **first day of the twelfth month** (*měi nián shí èr yuè yī rì*) at the **twelve earthly branches** (*shí èr shí*), the **human body contains the twelve monthly pavilions** (*shí èr yuè lóu*), where each pavilion corresponds to the **twelve zodiacal hours** (*shí èr jīng shí chén zhōng*).\n\nSurrounding this are **nine palaces** (*sì miàn yòu jiàn jiǔ gōng*), which are the **nine orifices** (*jiǔ qiào*) of the human body. The **nine palaces of the orifices** (*jiǔ qiào gōng*) are as follows:\n\n- to the east: the **Palace of Wind and Thunder** (*fēng léi gōng*) and the **Palace of Twin Groves** (*shuāng lín gōng*)\n- to the south: the **Palace of Purple Micro** (*zǐ wēi gōng*) and the **Palace of the Arhat** (*mó ní gōng*)\n- to the west: the **Palace of the Holy Mother** (*shèng mǔ guān*) and the **Palace of Benevolent Luo** (*huì luó gōng*)\n- to the north: the **Palace of the Brahman** (*fàn gōng*) and the **Palace of Crystal Waters** (*shuǐ jīng gōng*)\n- at the center: the **Palace of Tranquility** (*ān gōng*).\n\nThis is named the **Nine Palaces** (*jiǔ gōng*), akin to the **Nine Regions of Earth** (*dì liè jiǔ zhōu*).\n\nFurthermore, the **Nine Palaces and the Central Palace** (*jiǔ gōng fǔ yuán gòng jì shí zhōu*) total **ten regions** (*shí zhōu*), which are the **Ten Lands** (*shí guó*):\n\n- the **Land of the Jiao Ancestor** (*jiāo zǔ guó*)\n- the **Land of the Arhat** (*mó ní guó*)\n- the **Land of Blooming Flowers** (*kāi huā guó*)\n- the **Land of the Strict Deer** (*lù yán guó*)\n- the **Land of Golden Hue** (*jīn sè guó*)\n- the **Land of the Glass Bead** (*liú lí guó*)\n- the **Land of Śrāvastī** (*shě wèi guó*)\n- the **Land of Southern Zen** (*nán chán guó*)\n- the **Land of Heavenly India** (*tiān zhú guó*)\n- the **Land of Repeated Yang** (*chóng yáng guó*).\n\nThese **Ten Lands** (*shí guó*) are the **Ten Stages of Bodhisattva Perfection** (*shí dì*), where each stage contains **a seat of Mount Tài** (*yī zuò Tài shān*).\n\nWhat is the **body** (*shēn*)? It is the **source of great illness** (*zhì zhǒng dà bìng*), all of which **injure life** (*jiē shāng rén mìng*).\n\nThe body contains **four great seas** (*sì dà hǎi*):\n\n- **saliva** (*jīn*) as the **Eastern Sea** (*dōng hǎi*)\n- **blood** (*xuè*) as the **Southern Sea** (*nán hǎi*)\n- **marrow** (*suǐ*) as the **Western Sea** (*xī hǎi*)\n- **qi** (*qì*) as the **Northern Sea** (*běi hǎi*).\n\nAdditionally, there are **nine isles** (*jiǔ zhōu*), which are the **small intestine** (*xiǎo cháng*).\n\nThere are also **five lakes** (*wǔ hú*), where the **body is the Lake of the Moonlit Cavern** (*dòng tíng hú*):\n\n- **essence** (*jīng*) as the **Lake of Jade** (*yù hú*)\n- **sweet dew** (*gān lù*) as the **Lake of Clarified Butter** (*tí hú*)\n- **mind** (*xīn*) as the **Lake of Mysterious Depth** (*xuán hú*)\n- the **small intestine** (*xiǎo cháng*) as the **Lake of the River and Sea** (*jiāng hú*).\n\nThe **three luminaries** (*rì yuè xīng chén*) **wane** (*sān xiāo*), signifying the **decline of blood, qi, and essence** (*xuè qì jīng shuāi*).\n\nThis **waning** (*sān xiāo*) is like **mountains collapsing, seas drying up, and earth splitting** (*shān bēng hǎi jié dì liè*). Within the **twelve solar hours** (*yī rì shí èr shí chén zhōng*), one may **encounter the person of Mo** (*dé zuò Mò yuè qí rén*), achieving **fulfilled merit and perfect fruit** (*gōng chéng guǒ mǎn*). Males who **refine their form** (*liàn xíng*) become like **virgin boys** (*yīng nán*), and females become like **virgin girls** (*yīng nǚ*).\n\nThe scripture states: **\"Form and spirit both wondrously refined**, harmonizing with the **True Dao** (*hé zhēn*), this is the **method of extracting the embryo and replacing the bones** (*chōu tāi huàn gǔ zhī fǎ*), the **true formula of inverted yin and yang, and the Five Phases** (*wú xíng*).\n\nThe **Five Phases** (*wǔ xíng*) include **metal** (*jīn*), **wood** (*mù*), **water** (*shuǐ*), **fire** (*huǒ*), and **earth** (*tǔ*).\n\n- In **spring**, when **wood is vigorous** (*chūn mù wàng*), if **internal wood is not vigorous** (*nèi mù bù wàng*), people often **suffer from eye ailments** (*rén duō bìng yǎn jí*).\n- In **summer**, when **fire is vigorous** (*xià huǒ wàng*), if **internal fire is not vigorous** (*nèi huǒ bù wàng*), people often **suffer from dysentery** (*rén duō xiè lì*).\n- In **autumn**, when **metal is vigorous** (*qiū jīn wàng*), if **internal metal is not vigorous** (*nèi jīn bù wàng*), people often **suffer from coughing and wheezing** (*rén duō kě sǒu*).\n- In **winter**, when **water is vigorous** (*dōng shuǐ wàng*), if **internal water is not vigorous** (*nèi shuǐ bù wàng*), people often **suffer from hernia** (*rén duō cuì qì*).\n- The **spleen** (*pí*) is **earth** (*tǔ*), and its **four seasonal divisions** (*sì jì fèn*) are determined by the **yin and yang inversions and reversals** (*pí qì yīn yáng diān dào fǎn fù*) of the **spleen’s qi**.\n\nThe **Five Phases** (*wǔ xíng*) each **restrain one another** (*xiāng kè*), as follows:\n- **metal restrains wood** (*jīn kè mù*)\n- **wood restrains earth** (*mù kè tǔ*)\n- **earth restrains water** (*tǔ kè shuǐ*)\n- **water restrains fire** (*shuǐ kè huǒ*)\n- **fire restrains metal** (*huǒ kè jīn*).\n\n**Water and fire** (*shuǐ huǒ*) are the **yin and yang** (*yīn yáng*), and **one yin, one yang** (*yī yīn yī yáng*) is the **True Dao** (*zhēn dào*), which is **essence and blood** (*jīng xuè*).\n\nWhen people **suffer from myriad illnesses** (*yǒu wàn bìng*), none are **related to the five viscera** (*jìn bù guān wǔ zàng zhī shì*), but all stem from **the depletion of their parents’ essence and blood** (*shǔn liǎo fù mǔ jīng xuè*). If the **elixir field weakens** (*dān tián ruò*), sickness and disease **will arise** (*biàn shēng bìng jí*); thus, **urgently gather spirit and stabilize nature** (*jí shōu shén dìng xìng*).\n\nThe *Scripture of the Nine Immortals* (*Jiǔ Xiān Jīng*) states: **\"The Dao is one** (*dào zhě yī yě*). When a person **obtains the one** (*dé yī zhě*), all things **must be accomplished** (*wàn shì bì chéng*).\n\nWhen **practicing the work** (*xíng gōng shí*), the **spirit and qi transform** (*shén qì zhuǎn*), and the **qi follows the intent** (*qì zhú yì xíng*). During **circulation** (*yùn shí*), **advance and surge forward** (*qián gǎn qián chōng*), becoming the **yin general of the yin spirit** (*yīn zuǒ jiāng yīn shén*). The **six heavenly stems** (*liù jiā*) **drive and turn** (*qū zhuǎn*), and the **six aspects, eight recognitions** (*liù xiàng bā shí*) **encircle the one true spirit** (*kuáng yī zhēn líng nèi*), **wandering through the nine palaces** (*yóu jiǔ gōng*), **observing and playing with the ten lands** (*kàn wán shí guó*), **descending to the longevity platform** (*cháng shēng jiàng tái*), and **making the infant boy and maiden’s elixir field a stable furnace** (*shǐ yīng ér zhǐ nǚ dān tián ān lú zào, jìn huǒ shāo yào*).",
      "overlap_context": "* (*liù dù wàn xíng*), **Six Roots in Stillness** (*liù gēn qīng jìng*), **Severing the Six Bandits** (*zhǎn liù zéi*), **Restraining the Six Desires** (*jiè liù yù*), **Planting the Six Ladders** (*shù liù tī*).\"*\n\n**Advancing another three li**, they encounter **three ruined beams** (*sān chǎn fāng*). These are the **Treasure-Purification Beams** (*bǎo jìng fāng*), and when the **Seven Woods Corpses** (*qī lín shī*) **multiply**, this is the **Critical Moment of Application** (*lín zuò yòng*).",
      "start_char": 6966,
      "end_char": 8173,
      "start_sentence": 314,
      "end_sentence": 358,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 49.483779191970825,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\重阳教化集.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "二下穴通达肾堂，随呼气取之宝，气入口嗽三十六遍为雪花，咽入丹田为雪也。 随后便上合下闭，乾坤相合，真气满足。 脾暖者，万病消除。 似灶中烧瓦，时到自然成。 如鸡抱卵，妇人怀胎，不计时候，但觉身中疼痛者便是铁黑牛搬车也，是真一气、真一性。 黑者是下气也，痛气大便出，肿气小便出。 又有降天关地轴法，望项阳关泥丸宫，鼻中长引真气入口，大呵作六遍，天关地轴如死不动，每日行宫者，常调和阴阳。 冬至日一阳生，夏至日一阴生。 冬至者是子时已后，望东方日出为阳； 夏至者午时已后，日没是阴也。 阴阳返复之理也。 地气上腾，天雨下降，三日一风，十朝二雨，风雨顺时，人民便快乐，便是一身快乐无病，长久也。 人有万病者，每一病各一般真功治其病，自应也。 第一大炼九转还丹之法，有黄芽穿膝之法，射九重铁鼓之法，太子游四门之法，有金鞭指轮之法，有芦芽穿膝之法，有轩辕跨火之法，有玉女摸身之法，有锺离背剑之法，有吕翁钓鱼之法，有陈希夷大睡之法，三教内行法门者，尽各治於疾病也。 更有能超生者，人行转此功，丹田养热真气，夜间多梦见山上放牛。 其牛者，是赤牛，或青牛，或仙人、道士，宫观、寺院，大道、好房、高车、好树，夜见小儿女并大官人者，并是丹田气壮。 若梦见小道荒棘，恶人趁破房屋，塔墓树倒河渡。 恐怕并是丹田气衰弱，宜用补之。 诀曰：封三人休言说，六耳恐漏神仙之机。 诀曰：此三人者，第一对夫不孝之人，第二对夫不敬信之人，第三对夫不传戒不善之人。 莫说此诀，除此等人外，不分男子、女人、僧道、官人，皆得传法受戒。 此修真成诀者，价直须弥金。 取诸经为祖，对安乐者，是小乘之法。 虽是小乘却是大乘根本。 因果经中俱言修行有八般福田，救苦看病福田者，是第一救生性，强如南寺烧香，北院送供。 救一人之命、如造七级宝塔，若男子女人收得此诀，勿可乱传，如有乱传者，轻泄仙人妙机，九祖尽堕於沉沦，永镇酆都不得人身，慎之，戒之，信受奉行。 重阳真人金关玉锁诀竟",
      "translated_text": "The **two lower orifices** communicate with the **kidney hall** (*shèn táng*), drawing the **treasure of the breath** (*bǎo*) with the exhalation—**thirty-six spits** into the mouth yield **snowflake** (*xuě huā*), swallowed into the **elixir field** (*dān tián*) as **snow**. Then, **upper merging and lower closing** (*shàng hé xià bì*) follow, as **Heaven and Earth unite** (*qián kūn xiāng hé*), filling with **true qi** (*zhēn qì*).\n\nWhen the **spleen warms** (*pí nuǎn*), all maladies dissolve.\nLike **firing clay in a kiln**, it naturally completes when its time comes.\nLike a **hen brooding an egg**, or a **woman bearing child**, time is not reckoned—only when the body aches is it the **iron-black ox hauling the cart** (*tiě hēi niú bān chē*), the **true unity of qi and nature** (*zhēn yī qì, zhēn yī xìng*).\nThe **black** is the **lower qi** (*xià qì*); **painful qi** exits through **defecation**, **swollen qi** through **urination**.\n\nThere is also the **method of descending the Heavenly Pass and Earthly Axis** (*tiān guān dì zhóu*): gazing at the **item solar pass** (*xiàng yáng guān*) and **muddy homunculus palace** (*ní huán gōng*), drawing **true qi** long into the nose and mouth, **forcefully exhaling six times**—the **Heavenly Pass and Earthly Axis** remain motionless as death. Those who daily practice in the **palace** (*xíng gōng*) perpetually harmonize **yin and yang**.\n\nAt the **winter solstice**, **one yang is born**; at the **summer solstice**, **one yin is born**.\nThe **winter solstice** begins at the **child hour** (*zǐ shí*), watching the **eastward sunrise** as **yang**; the **summer solstice** begins at **noon** (*wǔ shí*), with **sunset** as **yin**.\nThis is the **principle of yin and yang returning and reversing**.\n\nWhen **earth-qi ascends** and **heavenly rain descends**, **three days of wind**, **ten mornings of rain**—if **wind and rain follow their season**, the people thrive, and so does one’s body: **enduring joy, free of illness**.\n\nIf a person has **ten thousand maladies**, each disease is cured by its **corresponding true practice** (*zhēn gōng*), naturally responding.\n\nThe **first great method of refining the Nine-Turn Elixir** (*jiǔ zhuàn huán dān*) includes:\n- The **method of the yellow sprout piercing the knee** (*huáng yá chuān xī*)\n- The **method of shooting the nine-layered iron drum** (*shè jiǔ céng tiě gǔ*)\n- The **method of the crown prince wandering the four gates** (*tài zǐ yóu sì mén*)\n- The **method of the golden rod pointing at the wheel** (*jīn biān zhǐ lún*)\n- The **method of the reed sprout piercing the knee** (*lú yá chuān xī*)\n- The **method of Xuanyuan straddling fire** (*xuān yuán kuà huǒ*)\n- The **method of the jade maiden caressing the body** (*yù nǚ mō shēn*)\n- The **method of Zhongli bearing the sword on his back** (*zhōng lí bèi jiàn*)\n- The **method of Lu the Old Man fishing** (*lǚ wēng diào yú*)\n- The **method of Chen Xiqi’s great sleep** (*chén xī qí dà shuì*)\n\nAll these are **practices of the Three Teachings**, each treating diseases.\n\nThose who can **transcend birth**—when a person practices this method, **true qi nurtures heat in the elixir field**, and at night, they often dream of **herding cattle on mountains**: the **cattle**—whether **red oxen**, **green oxen**, or **immortals, Daoists**, **palaces, temples**, **great roads, fine houses, high carriages, good trees**—or seeing **children and officials**—all signify **vigorous elixir-field qi**.\n\nIf one dreams of **wild thorns, evil men, broken houses, collapsing pagodas, tombs, fallen trees, or river crossings**, it means the **elixir-field qi is weak**—supplementation is needed.\n\n**Secret Key** (*jué*):\n*\"Seal the lips of these three—speak not of them.*\n*The six ears fear leaking the Daoist secrets.\"*\n\n**Secret Key**:\nThese three are:\n1. The **disrespectful husband** (*bù xiào zhī rén*)\n2. The **unfaithful husband** (*bù jìng xìn zhī rén*)\n3. The **husband who does not transmit the precepts well** (*bù chuán jiè bù shàn zhī rén*).\n\nDo not speak of this key. **Excluding these**, men, women, monks, Daoists, officials—**all may receive the law and precepts**.\n\nThose who perfect this **true secret key** are worth **gold from Mount Sumeru** (*xū mí jīn*).\nTaking all scriptures as **ancestors**, those who seek **ease** practice **small vehicle** (*xiǎo chéng*) methods.\nThough small, they are the **roots of the great vehicle** (*dà chéng*).\n\nThe **Cause-and-Effect Scripture** states that **eight fields of merit** exist in cultivation, and the **field of saving suffering and healing illness** is the **first in saving life**—stronger than **burning incense in southern temples** or **offering supplies in northern halls**.\n\nSaving one life is like **building a seven-tiered gemstone stupa**.\nIf men or women obtain this key, **do not transmit it recklessly**—to do so lightly **leaks the immortals’ secrets**, causing the **nine ancestors to fall into ruin**, eternally confined to **Yingdu**, never reborn in human form.\n**Beware! Take heed! Believe, receive, and practice faithfully.**\n\nThe **Golden Pass, Jade Lock Secret Key** of **True Yang Master** is complete.",
      "overlap_context": "ms** (*liù jiā*) **drive and turn** (*qū zhuǎn*), and the **six aspects, eight recognitions** (*liù xiàng bā shí*) **encircle the one true spirit** (*kuáng yī zhēn líng nèi*), **wandering through the nine palaces** (*yóu jiǔ gōng*), **observing and playing with the ten lands** (*kàn wán shí guó*), **descending to the longevity platform** (*cháng shēng jiàng tái*), and **making the infant boy and maiden’s elixir field a stable furnace** (*shǐ yīng ér zhǐ nǚ dān tián ān lú zào, jìn huǒ shāo yào*).",
      "start_char": 8173,
      "end_char": 8963,
      "start_sentence": 359,
      "end_sentence": 385,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 16.410156965255737,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\重阳教化集.txt",
        "category": "正统道藏太平部"
      }
    }
  ]
}