{
  "source_id": "金丹真一论",
  "source_file": "chunked_daozang\\金丹真一论.json",
  "total_chunks": 7,
  "total_original_chars": 8393,
  "total_translated_chars": 50797,
  "total_translation_time": 155.31390833854675,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\金丹真一论.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "**Title: Treatise on the True Unity of Golden Elixir**\n*(Original Attribution: Attributed to Bai Xuanzi, likely from the late Tang to Five Dynasties period. Compiled from various alchemical precepts, expounding on external elixir methods. One scroll. Source: *Zhengtong Daozang*, Taixuan Section.)*\n\n---\n\n**Treatise on the True Unity of Golden Elixir**\n\nThe origin of the soul-nurturing elixir lies in the essence of the True Unity *qi*.\nThe Treatise says:\nThe True Unity is the primordial water of the Great Dao.\nWater is *qi*; *qi* is the Dao.\nThe Dao originally has no name; through *qi*, it manifests as substance.\nSubstance is the form of all things.\nThe Dao initially is formless; through the Unity *qi*, it undergoes transformation.\nWhen transformation reaches the stage of form, form is what is named.\nThus it is said: The Dao originally has no name, yet it is forcibly named \"Dao.\"\nThe Dao is fundamentally One; One is the Mother.\nOne spreads transformation, giving birth to all things and benefiting the world.\nThe *Taishang* says: \"Spread the name of One throughout the world.\"\nThose who seek the Great Elixir all trace from root to branch.\nThe root is the source of True Unity, the Mother.\nThe child is the elixir.\nAll who cultivate the elixir seek the source of True Unity to transform *qi* into the child.\nThe marvel of the divine elixir lies here.\n\nOnce form and substance are distinguished, the pure and impure sources differ.\nThe pure is the yellow sprout.\nThis sprout is light and can float.\nThe impure is lead.\nThis lead is heavy and can settle.\nThe Great Mao Jun said to Qingxia Zi:\n\"Lead sinks, silver floats—this is called the yellow sprout.\nIt is also called refining autumn stone, also called yellow sprout.\"\nAfter refining through nine transformations of the divine elixir, the crucible must separate the pure and impure *qi* before one comprehends the authority of transformation.\nThe two *qi* are:\nOne *qi* is fully Yang, abiding in the correct position of the six *gua*.\nOne *qi* is fully Yin, also abiding in the correct position of the six *gua*,\nestablishing the principle of Yin-Yang completeness.\n*The Ode of the Yin Lord’s Return Elixir* says:\n\"The supreme Dao returns the elixir; Yin and Yang are complete.\nIt transmutes base matter into gold, elevating mortals to immortality.\"\nWhen this sprout is refined through nine crucibles, it becomes the aged sprout,\nonly then fit for use.\nThe elixir scripture says:\n\"The yellow sprout is the completion of transformation.\nHow much more so the aged Yang sprout, whose divine *qi* is now sufficient,\nfit for elixir use.\"\nThe number of days for the Northern River Vehicle is set.\nThe Vehicle refers to the daily count for elixir refining.\nIt means that when refining fire, one must complete thirty days,\nadhering to monthly cycles, never stopping the fire’s operation,\nwith Yin and Yang each occupying half, mutually nourishing.\nWhen *qi* circulates one full cycle, the elixir transforms once,\nand the Northern River Hexagram arises, drawing *qi* from the Yang line,\nuntil ten months pass, when Yin and Yang numbers are complete.\nThe divine water’s reception is thus determined.\nWhen refining the Great Elixir, first establish the divine water’s Hua Pool\nas its receptacle, so that the water aligns with true lead.\nThe elixir scripture says:\n\"When *qi* of the same kind converges, they assist each other like gods.\nIf the lead is not true, the divine water cannot receive it—\na taboo among immortals.\nThe taboo lies in differing kinds; hence, first establish the divine water,\nthen consider true lead.\"\n*The Parametric Accord* says:\n\"If the lead is not true, mercury cannot be contained.\"\nWhen referring to mercury, it is the divine water’s Hua Pool.\nThis *qi*, if not paired with true lead, cannot govern mercury.\nIf mercury is subdued, it has many names, not merely 'mercury.'\nIt is also called flowing pearl, golden liquid, golden paste, jade nectar,\nor purple wandering salve—all are the true lead within the divine water’s Hua Pool.\nTrue lead and true mercury—these two refined *qi*—congeal to form the elixir.\nElixir cultivators first establish the divine water’s Hua Pool as its receptacle.\nIf those who refine the elixir understand the divine water’s Hua Pool,\nthey will know the path to immortality is near.\nThe Great Elixir without divine water cannot achieve its spiritual efficacy.\nDivine water without true lead cannot emit and condense vital *qi*.\nWhen the two unite, they form the Return Elixir.\nThe Treatise says:\nWater’s count belongs to One; it contains mixed true *qi*,\naligning with position to become black, merging with true lead.\nTrue lead receives its nature, nurtured by the black *qi* of the North.\nThis black *qi* is the divine water itself.\nThis lead contains hidden light, naturally transforming.\nTrue lead embodies the five colors’ symbols.\nDaoists, every three hundred sixty moments, open the crucible once,\nadding increments to observe its marvels—\nsometimes black, sometimes white, or yellow, purple, red, or green,\ncorresponding to the true positions of Metal, Wood, Water, Fire, and Earth.\n*The Mirror of the Yin Lord’s Flowing Pearl* says:\n\"A single substance with five colors, eternally the immortals’ fortune.\"\nIt also says:\n\"Lead contains five colors; mercury emits three flowers.\"\nWhen the two substances merge, they are called the River Vehicle.\nThe River Vehicle is another name for the elixir.\nSometimes it sinks, sometimes floats—\ncapable or incapable, dispersed as the hidden dragon,\ncongealed as autumn stone.\n*The Precept of the Golden Tiger Marshal* says:\n\"Floating and sinking, vague as clouds,\nyet within lies essence, worthy of refinement—\nseemingly present, seemingly absent,\ndifficult to distinguish from the unadulterated.\"\nThis is the Marshal’s revelation of true lead,\npossessing the marvel of floating and sinking transformations.\nThe Treatise says:\nFloating and sinking are the crucible’s condensation of essence.\nThe condensed essence’s flower rises above,\ncalled the light-floating essence, also named divine talisman white snow,\nor stalactite, or horse-tooth railing—\nall are manifestations of the yellow sprout’s singular transformation within the crucible.\nNoble cultivators of the elixir, if they attain this stage of refined function,\nwill know that the nine-transformations divine elixir’s complete method lies in their hands,\nenabling them to approach the Celestial Capital and be inscribed in the Jade Register.\nAll above pertains to the transformation of the yellow sprout—\nthe sacred deeds of the Dao, treasured by immortals.\n\n**The Great Elixir Song by Xiao Ziyun, Minister of the Yellow Gate:**\n*\"A thousand words conceal only the secret of the yellow sprout;\nten thousand volumes of scripture expound on idle stone.\"*\n\nThe Treatise states:\n\nBefore the yellow sprout enters the crucible, one must first determine the auspicious time and day;\nrefine black lead to purify, then ascend and descend the essence of the *light-floating qi*.\nAgain, the *light-floating* essence is paired with the Azure Dragon,\nboth entering the golden cauldron.\nThough within the golden cauldron,\nit remains yet undivided in purity and turbidity.\nWhy so?\nBecause it has not yet received the *zào huà*[造化] vital *qi* of the cosmos—\nhow could it, relying on mere seasonal ordinances, partition purity and turbidity?\nThis requires the elixir artisan to master the five phases,\ndrive the *zào huà*[造化], and carefully observe the water clock,\nadvancing and retreating with the celestial talismans,\nbefore the yellow sprout can be fully transformed.\nIf the water and fire ratios are miscalculated,\nthe water clock is unregulated,\n*yīn* and *yáng* are out of measure,\nand the *qi* climate fails to align,\nthen the yellow sprout may not even arise—\nthis is the fault of the careless elixir artisan,\nwho neglects the proper timing.\n\nMaster Mao Zhenren said to Qingxiyun:\n*\"If *yīn* and *yáng* cannot harmonize,*\n*the sprout will never emerge at all.\"*\nThis is the shared prohibition of Daoists,\nfearing the leakage of celestial secrets.\n\nMoreover, observe how mortals today refine medicines,\npretending to emulate longevity,\nyet ignorant of the true source of the *lingdān*[灵丹],\nmistakenly identifying cinnabar as mercury.\nThe world is filled with those who mistake red cinnabar for mercury,\nusing lead flowers to forge it,\nburning silk as the elixir—\ntheir harm to lives is profound indeed.\n\nEven among ancient noble immortals,\nthere are no shortage of elixir scriptures,\nDaoist classics, hidden texts,\nand secret precepts of the sages,\nall meticulously revealed to answer human queries,\nunveil profound meanings,\nand guide future generations.\nBefore undertaking the Great Elixir,\none must first prepare the *qīngfù*[清釜] tortoise of the cauldron,\nthe elixir well and the *lìquán*[醴泉]—\nthese are the essential prerequisites for elixir cultivation.\nNow, I must inquire—\nwhat do mortals today use as true lead?\nHow do they discern the *shénshuǐ huáxī*[神水华池] of the well-tortoise?\nAnd when the elixir is formed,\neach well-tortoise has its own purpose.\nIf, on that day, they prove useless,\nhow could it be that the sages’ true *zào huà*[造化] lacks foundation,\nconfusing future generations?\n\nFurthermore, as the secret precepts state:\nOnce the elixir well is formed,\ndo not allow impurities to contaminate it.\nAfter the water channels are stabilized,\none must replace them,\npurifying stagnant currents,\nthen permitting celestial *qi* to flow freely,\nand letting stars and moon illuminate them.\n\nIn general, well water—\nif it contains sand-worms invisible to the eye—\nbut stored in gold or silver vessels,\nafter a decade the worms dissolve into lead.\n**Annotation:** If Daoists cannot prepare [proper vessels],\nuse only new, sealed oil bottles,\ncovering the mouth with waxed paper,\npreventing dust from entering.\nOnce the water’s nature is settled\nand the *tǔqì*[土气] is contained,\nthen take it to combine with the elixir.\n\nFor constructing the elixir well,\nif one finds a spring of greenish-white lead,\nit is the water of *yáng* channels—\nwhen refined, the elixir becomes even more potent.\nIf the soil is greenish mud,\nor the spring is yellow with red channels,\nor the water has an iron-like stench,\nthese are signs of mixed water currents,\nstagnant *yīn* earth,\nand muddled *tǔqì*[土气]—\nsuch water cannot be used for elixir refinement;\nanother well must be constructed.\n\nBut if the spring is clear,\nsweet, and *lì*[醴]-like,\ntreasure it most carefully.\nAs the secret precepts further explain in the twelfth chapter on elixir wells:\n\nWater is the source of all life,\nthe first of the five phases,\nthe singular *yīn* essence of the northern realm.\nHence it is said:\n*\"Water one, fire two, wood three, metal four, earth five—*\n*the five phases’ order,*\n*unified in the One,*\n*originating from the void,*\n*entering existence from non-being.\"*\n\nThe *lǜshuǐ*[绿水] is the body of the void,\nhence *\"entering non-being.\"*\nWhen it enters existence,\nit is born from this void *qi* through the five phases’ *zào huà*[造化],\nsuddenly generating the *huándān*[还丹]—\nhence *\"entering existence.\"*\n\nFrom existence, it returns to the void.\nThough the elixir exists,\nwhen the cauldron is replaced each month,\nit is continuously merged with the Azure Dragon,\nnurturing the White Tiger,\nand thus returns to non-being—\nhence *\"returning to the void.\"*\nAfter many cycles of return and rebirth,\nthe divine elixir appears.\n\nWithin the cauldron, the sacred medicine\nundergoes countless transformations—\nwhen complete, the cauldron is filled with a deep crimson glow,\nlike blood droplets,\nwith white *sū*[酥] rising within—\nonly sages and worthies\ncan fathom its mysterious shifts.\n\nIt follows the ebb and flow of the sun and moon,\nconforming to the five phases’ inclinations.\nFor instance, on the fifteenth and sixteenth days,\nwhen the moon is full and round,\nthe refined elixir’s *qi* is also at its peak—\nradiant and luminous.\nAs the moon wanes,\nthe elixir also retreats, concealing and condensing itself.\nThus, the cycles of return and rebirth—\nall nine transformations follow this pattern.\n\nWhen elixir texts speak of *\"nine returns, seven rebirths,\"*\nthis is what they mean.\nNine marks the beginning of *yáng* essence,\nseven the origin of *tài yīn*[太阴].\nIn refining the Great Elixir,\none must always pair *yīn* and *yáng*,\nascending and descending in rotation,\nthe nine-six *yáo*[爻] shifting.\n\nThe *Yì*[易] says:\n*\"The primal *yáng* employs the Nine—*\n*order is established beneath heaven.\"*\nAgain it says:\n*\"Employing the Nine reveals Heaven’s virtue.\"*\nThus, the elixir’s transformations\nmust all conform to celestial timing—\nwhen the phases align, act;\nwhen the method aligns, proceed.\nThe *Yì*[易] says:\n*\"Heaven and Earth regulate their phases,*\n*and the four seasons are complete.*\n*Yīn and yáng regulate their courses,*\n*and all things flourish.\"*\nThis is why elixir artisans emulate it—\njust as the cosmos generates all things,\ntransforming into countless wonders,\nthe red and yellow medicines bloom,\nand the branches and stems extend within the cauldron—\nall are the sages’ imitations of celestial change.\n\nThe *Yì*[易] says:\n*\"Heaven and Earth undergo transformation,*\n*sages emulate their patterns.*\n*Heaven displays its symbols,*\n*sages follow them.\"*\nWhen refining the elixir,\nthe *\"mastering talismans and phases\"* is what is meant.\nThus, the elixir may not fail to form.\n\nThe above clarifies the grand principle of *\"nine returns, seven rebirths,\"*\nall being the secrets of the elixir’s maturation.\nIf the elixir is not refined with proper timing,\nit cannot be contained or halted—\nnone will achieve its treasure.\n\nMoreover, elixir texts categorize the sages’ methods\naccording to the nature of all things beneath heaven,\nexhausting the principles of *yīn-yáng* pairing,\nrefining talismans and *zào huà*[造化],\nand mastering the five phases’ subtleties—\nwhen spring *qi* arises, flowers and plants flourish;\nwhen autumn *qi* gathers, all things bear fruit.\nThe *Tài Yì Dānshū*[太易丹书] says:\n*\"Returned and reborn, it reaches full maturity,*\n*the essence condenses and no longer disperses.\"*\n\nIf one extracts mercury from cinnabar,\ntakes the sprout from lead flowers,\nor mixes the eight minerals with three yellows,\nor combines the five metals arbitrarily,\nthese are all not of the Great Elixir’s origin.\n\n「Yet it can be used to subdue and transform—\nto transmute yellow and white,\nto augment worldly treasures,\nto aid the poor and assist the Dao,\nto rescue and shelter the lonely and the endangered.\n\nIf one were to forge this stubborn and sluggish substance into an elixir,\nhow could it compare to the scriptures of the immortals, which say:\n*\"Morning, dressed in a single tablet of elixir,*\n*by evening, one may grow wings and fly.\"*\n\nThis crude material could never match such lofty attainment.\nMoreover, cinnabar and liquid mercury possess tangible natures,\nand after undergoing fire refining,\nthey harbor *yáng* toxicity within their *yīn*—\ningesting them causes thirst, intestinal decay,\nand a throat constriction like fire;\nnot even ten thousand gold pieces could cure it—\nwhen the five *zàng*[藏] are already destroyed,\nwhat is the use of harming one’s precious body?\n\nMaster Ma Ming[马明] said:\n*\"The Great Elixir returns to its original form—*\n*when water is encountered, it takes on water’s essence,*\n*when fire is entered, it reverts to golden liquid.*\n*Ingestion is like wind and rain,*\n*dissolving and permeating into the hundred vessels.\"*\n\nThe Great Elixir transforms from its primordial fluid,\nhence the term *golden liquid*[金液].\nIt can dissolve into the hundred vessels—\nwhen taken, it irrigates and nourishes them,\ndispersing ailments like wind and rain,\nand expelling malevolent *qi*[氣].\n\nThe *Yīn Jūn*[阴君] states:\n*\"The Great Elixir is born from formlessness—*\n*common mercury and cinnabar need no manipulation.\"*\n\nThe commentary explains:\n*\"Formlessness refers to the *qi* of emptiness and non-being.*\n*This *qi* moves with breath, rises and falls in stillness and activity,*\n*and is not separate from its source.*\n*The source is water—*\n*water unites with true lead,*\n*forming the *Huá Chí*[华池] (Refined Pool),\n*which is the elixir field (*Dān Tiān*[丹田]).*\n*The elixir texts say:*\n*'Use lead, not lead—*\n*lead is the old elixir field.'*\n*Once the elixir is produced,*\n*it is called 'born essence' (生质),*\n*hence 'formlessness gives rise to essence is the Great Elixir.'*\n\n*The commentary further states:*\n*'Though water has form,*\n*it ultimately lacks essence (质).*\n*The divine and immortal use methods to govern it,*\n*and thus it can give rise to essence.*\n*The origin of born essence*\n*lies in the ascent and descent of green—*\n*ascent is when *yáng* *qi* surges upward in the crucible,*\n*descent is when *yīn* *qi* condenses downward in the retort.'*\n\n*The commentary continues:*\n*'The elixir dwells in formlessness—*\n*this is like the *Dùo yuè*[蠹钥] (borer-key) hidden within the refined *qi*[华气].*\n*River Master[河上公] said:*\n*'Seek the borer-key in the void,*\n*for only then can one have vital breath and *qi*.'*\n*A purely *qiān*[乾] *qi* follows the complete *Way of Yang*[阳道].*\n*A purely *kūn*[坤] *qi* follows the complete *Way of Yin*[阴道].*\n*Both are the union of *yīn-yáng*[阴阳],*\n*where the two *qi* form the true—*\n*the true is the elixir.*\n*The elixir is the condensed form,*\n*manifesting as red fluid.*\n*When the elixir is complete,*\n*it is no longer the shape of powdered sandalwood—*\n*all are symbols of red fluid.*\n\n*The secret instructions say:*\n*'First, rely on the clepsydra[刻漏] for precise timing,*\n*neither day nor night should differ.*\n*During the phase of retreating water and advancing fire,*\n*all occurs before noon.*\n*Burn incense without interruption,*\n*face upward and sincerely invoke the Highest Truth,*\n*ensuring the *qiān* fire is at its peak—*\n*lest the crucible falter.*\n*When the dragon is at its zenith,*\n*retreat is inevitable—*\n*this is the critical moment.*\n*To govern the harshness of excessive *yang*[刚],*\n*the virtue of the Nine Heavens is unrivaled,*\n*thus it is called 'the *qiān* fire at its peak.'*\n*Do not hastily abandon the alchemical chamber.*\n*Listen solely to the resounding voice of the dragon at its height,*\n*carefully observing the *yīn-yáng*[阴阳] harmony’s signs.*\n*If you hear a fierce, masculine tone,*\n*that is the *yang* of the overbearing dragon,*\n*a purely *yáng* force.*\n*As the green *yang*[绿阳] wanes,*\n*do not fail to advance the fire,*\n*responding to its proper measure.*\n*When the fire is fully obtained,*\n*there is no fear of sudden loss or excess,*\n*yet one must still guard against the crucible’s fragility.*\n*At such a masculine sound,*\n*be ever vigilant,*\n*adjusting fire and water in due time.*\n\n*Temporarily open the midday gate.*\n*The midday gate is the portal for the next phase of advancing fire,*\n*the beginning of receiving *yin*[阴].*\n*Open it briefly,*\n*allowing the fire *qi* to stretch and relax,*\n*waiting for the sound to become gentle and harmonious—*\n*like the faint, distant strains of strings or bamboo pipes.*\n*Then close it again—*\n*this is the moment of *qi* harmony.*\n*Gradually introduce fire *qi*,*\n*its voice clear and refined,*\n*slowly close once more—*\n*lest the *qi* stagnate,*\n*and the prolonged delay*\n*alter the elixir’s transformation.*\n*From this point onward,*\n*all is the *Way of Qiān*[乾道]’s transformation.*\n*Alchemists who skillfully guard and nurture*\n*will alone preserve their true and auspicious nature.*\n\n*The secret instructions continue:*\n*'Next, encounter the phase of advancing water and retreating fire.*\n*This occurs in the *Lǚ*[履] hexagram,*\n*governing one *yin* while restraining five *yang*[阳].*\n*When *Qiān*[乾] is harmonized,*\n*all things flourish,*\n*following the natural order,*\n*and thus attain completion with blessings.*\n*Stepping on frost yields solid ice—*\n*the beginning of *yin* condensation.*\n*In intense summer, thunder shakes the heavens,*\n*yet it subsides with the power of *lúo*[萝] (a medicinal herb).*\n*The sprout’s form gradually takes shape,*\n*proceeding without error.*\n*The clepsydra marks the second watch,*\n*when stability returns and auspiciousness is restored.*\n\n*The *Tài Yì*[太易] says:*\n*'In the *Lǚ* hexagram, the elixir condenses its auspicious signs,*\n*snow and frost are its essence.*\n*The embryo is sluggish, yet rich with potential—*\n*when *yin* submits to *yang*’s dominion,*\n*this is the pivotal mechanism of the *Way*.*\n*The borer-key hides like a tiger,*\n*stepping on frost radiates brilliance,*\n*solid ice grows cold and severe.*\n*At this moment, the elixir gradually condenses,*\n*the spirit water has transformed,*\n*and the Great *Way*’s alchemical work is complete.*\n*Once the yellow sprout is formed,*\n*refined through nine cycles,*\n*its luminous essence is evident,*\n*and it is called the *old sprout*[老芽],*\n*now fully mature.*\n\n*The yellow sprout must be clarified and perfected before it can be used,*\n*then refined into the elixir.*\n*The True Person of *Tài Yī*[太一]’s *Yù Hú Sòng*[玉壶颂] states:*\n*'In the tenth month, frost flies and snow thickens,*\n*the yellow sprout ripens within, its color vivid and bright.*\n*If one cultivates the elixir and sees the yellow sprout mature,*\n*how could one not ponder the golden tiger and celestial dragon?'*\n\n*Thus it is known:*\n*The yellow sprout reaches perfection only after nine cycles,*\n*sometimes resembling stalactites or coral,*\n*layered stones in towering grandeur,*\n*or myriad threads like horsehair and deer sinew,*\n*or jade pillars exquisitely formed.*\n*All these wondrous signs*\n*await the completion of the nine cycles,*\n*then gather this luminous sprout,*\n*ascend to the altar,*\n*and present it to Heaven,*\n*sincerely invoking with profound aspiration.*\n*Refine the luminous sprout once more,*\n*praying for the Great Medicine’s completion,*\n*offering morning and evening reverence,*\n*opening and closing the furnace altar,*\n*and from this point onward,*\n*dedicate oneself to cultivating the Great Elixir.*\n\n*The *Cān Tóng Qì*[参同契] states:*\n*'The yellow sprout is*\n*the root of the Great Medicine,*\n*the supreme treasure of longevity.’*\n*Yet the lone *yang* sprout*\n*cannot stand alone.*\n*Water unites *yin* and *yang*[阴阳],*\n*only then does it become the Great Medicine.*\n\n*The commentary explains:*\n*'Thus it is known that water*\n*is the origin of the Great Medicine,*\n*internalizing to solidify the elixir,*\n*externalizing to transform all things,*\n*uniting *yin* and *yang*—*\n*the mother of divine and immortal cultivation.’*\n\n*The *Tài Shàng*[太上] says:*\n*'Heaven obtains One to achieve clarity,*\n*Earth obtains One to achieve tranquility,*\n*and all things obtain One to generate the yellow sprout.*\n*Obtaining water alters its nature and form,*\n*transforming it into the Great Elixir,*\n*properly named the Great Medicine.\"*」\n\n「Thus, *The Paramitas of the Mysterious Concord*[《参同契》] states:\n*The lone *yang* sprout*\n*cannot stand alone.*\n*Water unites *yin* and *yang*—*\n*only then does it become the Great Medicine.*\n\n*This reveals the hidden workings of Heaven,*\n*which cannot be heard through ordinary means,*\n*a profound admonition.*\n\n*The commentary explains:*\n*Water itself is not divine,*\n*but when it aligns with the cosmic cycles,*\n*it becomes true.*\n*Hence, it is called *Divine Water*[神水].\n*This water is none other than*\n*the five phases[五行] harmonizing,*\n*the four seasons[四象] cycling,*\n*the eternal return of the Daoist furnace[陶家之输返],*\n*revolving through countless extremes,*\n*when its transformations are complete,*\n*all things have their appointed form.*\n\n*Moreover, the True Person[真人]*\n*creates and refines at the outset with purpose,*\n*and at the end with resolution.*\n*Before signs manifest,*\n*all things reveal themselves—*\n*what difficulty could there be?*\n\n*Like the sun and moon returning in their cycles,*\n*day and night perpetually alternating.*\n*Thus the world is formed,*\n*and its transformations extend infinitely to all beings.*\n*This is the beginning of understanding*\n*the measures of *yin* and *yang*,*\n*their revolving cycles,*\n*endless yet unexhausted.*\n\n*If one speaks of refining the Great Elixir[大丹],*\n*it must be done in resonance with the seasons,*\n*for its methods differ from worldly practices,*\n*and no two ages share the same laws.*\n*Divine Water is not inherently divine,*\n*but its marvels arise from the cosmic numbers.*\n\n*Furthermore, *The Book of Yin Symbols*[《阴符》] states:*\n*The arts of the Great Elixir number a hundred,*\n*but their essence lies in*\n*Divine Water and the Azure Pool[华池].*\n*Thus it is known that*\n*the Great Elixir, once obtained,*\n*transforms endlessly,*\n*constantly ascending,*\n*eternally harmonizing with Heaven and Earth.*\n\n*The commentary explains:*\n*Water’s nature is*\n*fully *yang* in form,*\n*yet capable of *yin*.*\n*Place a hundred *hu*[斛] in a cauldron,*\n*boil and dry it,*\n*and its formlessness is revealed.*\n*Yet it nourishes the vast Earth,*\n*and all things grow from it.*\n*Why then does it have form?*\n\n*This form*\n*steals the vital *qi* of Heaven and Earth,*\n*and arises from it.*\n*The classic states:*\n*\"All things in Heaven and Earth*\n*that steal the One*\n*are born by embracing *yin* and bearing *yang*.\"*\n*Thus, both Heaven’s transformations and all things’ appointed forms*\n*are fully explained,*\n*and the Great Elixir is perfected.*\n\n*The commentary explains:*\n*When the Great Elixir’s transformations are complete,*\n*where does the Divine Water return?*\n*The commentary explains:*\n*Divine Water is the Mother,*\n*True Lead[真铅] unites with it to form the embryo.*\n*Within the Golden Furnace[金鼎],*\n*it steals the numbers of the five phases,*\n*aligning with the daily celestial rotations,*\n*the stars and constellations in their proper order,*\n*the talismans and seals urging its progress,*\n*its water becomes divine,*\n*its *qi* descends as true,*\n*Black Lead emits its essence,*\n*Golden Flowers surge forth—*\n*yet none of it leaks,*\n*all coalescing into the Elixir.*\n*This is the perfected work of the Sage,*\n*the Great Elixir taking form as substance.*\n\n*This substance is not the same as Earth’s soil,*\n*yet shares its *qi*—*\n*the Sage still relies on the *Yijing*[易]*\n*to clarify the symbols.*\n\n*Wang Bi’s commentary states:*\n*\"Abiding in the center to attain correctness,*\n*reaching the limit of Earth’s soil,*\n*letting nature take its course,*\n*and things spontaneously arise,*\n*without artificial cultivation,*\n*yet the work is accomplished—*\n*thus, one does not practice it,*\n*and yet nothing is left unfulfilled.\"*\n\n*The commentary explains:*\n*Why does it not require practice yet bring benefit?*\n*Is this not a paradox?*\n*But by reversing the *yang* cycles*\n*and restoring the *yin* position,*\n*it requires no practice.*\n*Revolving through the paths,*\n*returning to its origin,*\n*it first reveals itself in its essence—*\n*what need is there to worry about its end?*\n*Thus, it requires no practice.*\n\n*This teaching further explains*\n*Heaven’s eternal principles,*\n*the sun and moon’s revolving cycles,*\n*and the interplay of *yang* and *yin*—*\n*their waxing and waning according to time,*\n*the origins of symbols and numbers,*\n*stolen and applied,*\n*transmitted among the worthy,*\n*rarely encountered by the world.*\n\n*Hence the classic states:*\n*\"The myriad forms cannot evade their numbers,*\n*how much less so humans,*\n*how much less so ghosts and spirits?\"*\n*Those who cannot align with*\n*these cosmic laws and cycles*\n*are merely the vulgar tastes of mortals.*\n*The Dao of the Sage and the Wise is not so.*\n\n*《The Book of Yin Symbols》 states:*\n*\"Heaven’s nature is human,*\n*humanity’s essence is the hidden mechanism.\"*\n*Establishing Heaven’s Dao*\n*to settle humanity’s mind.*\n*Thus, one alters Heaven’s heart,*\n*locks the transformations of the cosmos,*\n*reverses the five phases,*\n*cycles the eight trigrams,*\n*fixes the celestial nodes,*\n*and divides day and night.*\n*This is Heaven’s hidden mechanism,*\n*humanity’s theft of it.*\n*Obtaining it, the universe is within one’s grasp,*\n*and all things are within one’s body,*\n*for the mechanism of Heaven is now manifest in humanity.*\n\n*Once the profound symbols are clear,*\n*the Great Elixir is complete.*\n\n*The commentary explains:*\n*The Primordial *Yang* Child[元阳子] states,*\n*\"*Yang* Heaven is the Father,*\n*Earth *yin* is the Mother,*\n*The Vermilion Bird[朱雀] of the South,*\n*The Dark Warrior[玄武] of the North.*\n*At the year’s end and the season’s close,*\n*both become soil.*\n*Where does the common man seek*\n*Dragon and Tiger?\"*\n\n*Soil is the symbol of form,*\n*its virtue residing in the Yellow Position[黄位].*\n*The Yellow Position signifies*\n*the completion of the ninety-nine cycles,*\n*transformations fully realized,*\n*earning the name of soil,*\n*the initial stage of the Elixir.*\n\n*It is said that soil can overcome water,*\n*a great principle for*\n*consuming and refining the cauldron’s water,*\n*the Sage’s intent made clear—*\n*water returns to soil.*\n*Thus, it is not the soil of Earth,*\n*but the initial form of the Elixir,*\n*earning the name of the White Tiger,*\n*capable of swallowing the Green Dragon.*\n\n*The Elixir scriptures state:*\n*\"Dragon and Tiger*\n*alternately swallow and are swallowed,*\n*establishing the fixed position within.*\n*Through the eight celestial nodes,*\n*the cold and warm shift,*\n*gradually transforming into the root of the yellow sprout.\"*\n\n*Thus it is known that*\n*the yellow sprout belongs to soil,*\n*which can consume water.*\n\n*The commentary explains:*\n*Water has no stagnant form,*\n*it contains *qi* and blends with the true.*\n*Once the essence is refined,*\n*the Golden Elixir congeals.*\n\n*The Elixir scriptures state:*\n*\"The Golden Elixir is the Great Elixir—*\n*this is it.*\n*The world’s people fail to comprehend,*\n*losing their homes and livelihoods,*\n*unable to measure its depths.\"*\n\n*The commentary explains:*\n*The so-called Great Elixir*\n*is not a mineral of gold or stone,*\n*but borrows its name from the Western direction,*\n*its origin being the pure white.*\n*《The Paramitas of the Mysterious Concord》 states:*\n*\"Cinnabar[丹砂] is originally pure,*\n*not inherently red,*\n*yet its seasons sort it in the Southern Dwelling.\"*\n\n*The Southern Dwelling is the Green,*\n*the pulse that receives *yin* and the female,*\n*the descent of the *yin* principle.*\n*When the pulses gather,*\n*it turns red,*\n*the *yin* *qi* glowing crimson,*\n*its blood flowing with certainty.*\n\n*Xu Jun states:*\n*\"Male *qi* is white and emits essence,*\n*female *qi* is red and emits blood.\"*\n*The *yang* Dao is male,*\n*the *yin* Dao is female.*\n*Gathering *qi* forms the embryo,*\n*receiving *yin* establishes the master.*\n*Only when the Elixir receives *yin*\n*does its color change—*\n*it was never red from the start.*\n*Hence the classic states:*\n*\"Cinnabar is originally pure,*\n*not inherently red.\"*\n\n*The Autumn Stone[秋石]*\n*is also the White Stone mentioned earlier.*\n*Its symbol is in the West,*\n*thus it is called Autumn Stone.*\n\n*The commentary explains:*\n*In opening the Great Elixir,*\n*one takes the symbol of Metal’s vigor,*\n*White Dew being the first,*\n*its strength peaking at the *You* Earth[酉地].*\n*This is when*\n*Metal and Water’s *qi* are clear and settled,*\n*the Metal Autumn month is full and flourishing,*\n*the Golden Flowers abundant and overflowing—*\n*the proper time for refining the Elixir.*」\n\nWei Zhenren said:\n*\"The timing of gathering is fixed,\nthe season of taking is precise—\nyet the world uses it without knowing.*\n\n*How much more so the ancient immortals refining elixirs,\nwho merely await the Metal *qi*’s round brilliance,\nthe toad’s light at its fullest—\nall true persons share this,\nand even a tenth of it is unmatched.*\n\n*Again it is said:*\n*The Elixir obtains Water’s mutual nourishment,\nrising from emptiness to fullness,\nfrom non-being to being.*\n\n*In refining the Elixir,\none must grasp the True Unity.*\n*The True Unity is Water.*\n*Water nurtures the Elixir as a mother;\nTrue refers to *qi*—\n*qi* is the transformation of the Dao.*\n*Transformation means the movement of *qi*;\nonly when *qi* is sufficient does it become the Dao.*\n*The movement of *qi* is the interplay of the two *qi*’s.*\n*How much closer it is—\nvisible before one’s eyes.*\n\n*Bao Zhenren said:*\n*The True Unity method is ever-present,\nthe sun before one’s gaze.*\n\n*The Most High said:*\n*The Great Dao is vast—\nhow could it be confined to left or right?*\n*All things rely on it to live,\nliving without complaint—\nhow could it be distant?*\n\n*The classic further states:*\n*The mother contains the child’s womb,\nthe child hides within the mother’s body.\nKnowing White while guarding Black,\ndivine clarity comes naturally.*\n*White is the West’s Metal—\nMetal is the mother.*\n*Black is the North’s Water—\nWater is the child.*\n*Knowing the West’s Metal,*\n*the Elixir first arises from the North’s *Ren* and *Gui* (Water’s stems),*\n*for *Ren* and *Gui* are Water.*\n*The classic says:*\n*‘Metal depends on Water—\nonly by settling Water\ndoes one preserve the Elixir.’*\n*Thus the dual meaning of Black and White is clear.*\n\n*Hence the Elixir scripture states:*\n*‘Know White, guard Black—\nseek death and you shall not find it.’*\n\n*Qingxia Jun said:*\n*Water condenses to receive Fire,\nMetal disperses and enters Water.\nWhen Water and Fire *qi* intermingle,\nMetal’s form transforms—\nunsettled, without fixed direction,\nneither high nor low remains constant.*\n*Water obtains Fire and ascends,\nMetal obtains Water and descends;\nmutually dependent in transformation,\ncongealing within *qi*—\nhow could it be like cinnabar hiding Fire,\nmercury forming frost?*\n\n*The Elixir scripture says:*\n*‘Mirror-drawing to catch the gall,\nmountain-climbing to net fish—\nwhen shall this be achieved?’*\n\n*Refining the Elixir and the Spirit Water,\nonly with Water does the tooth form;\nthe Fire cauldron sears the Golden Medicine—\nthe Golden Medicine is the Three Flowers.*\n\n*Jin Hu Yuanjun said:*\n*Refining the Three Flowers merely removes their primordial hue,\nrestoring them to the West’s true color—pure white.*\n*The classic says:*\n*‘When pure white appears, the Golden Flower may be forged.’*\n*This Flower, once placed in the crucible,\nmust rely on the water clock’s division\nbefore purity and turbidity are separated.*\n*Without the water clock,\nno divine sprout will grow;\nthe Three Flowers enter the crucible.*\n*The verse says:*\n*‘Entry depends on the clock’s measure—\nwithout it, the Elixir fails.’*\n*Like the blind rushing without a staff,\nthe deaf strumming a zither—\nthe Great Elixir without the clock\nis like the blind stumbling without guidance,\nunable to proceed.*\n*Though one shouts for Water and Fire,\nthe moment is ill-timed—\nsilent and unseparated,\nhow could the *qi*’s ascent and descent be fixed?\nLike the deaf playing the zither,\nthey cannot distinguish at all.*\n\n*The commentary says:*\n*The clock is the day’s direct talisman;\nwhen the messenger’s talisman arrives,\ncalculate the true numbers of yin and yang,\nWater and Fire’s advance and retreat,\ndetermine their weight,\nalign with the hour and stem-branch,\nrespond to the crucible’s *qi*—\nfirst fix the timing of Heaven and Earth,\nthen act in accordance.*\n\n*The *Yinfu Classic* says:*\n*‘Yin and yang push each other,\nand transformation proceeds in harmony.’*\n\n*The commentary says:*\n*If the solar hour is near and the clock reports it,\ndeclare ‘The Great Sun’s number is fulfilled,\naccumulating merit to complete *Qian*.’*\n*If the lunar hour is near and the clock reports it,\ndeclare ‘The Great Yin’s number is fulfilled,\naccumulating merit to complete *Kun*.’*\n*Thus when *Qian* and *Kun* are both complete,\nyin and yang fully harmonized,\nyou seize Heaven and Earth’s creative power,\nplunder the four seasons’ generative duties—\nthe crucible’s divine medicine,\nonce perfected, yields crimson nectar,\nloved by both Heaven and humanity.*\n\n*The commentary says:*\n*Before the clock’s division,\nif the time is for refining the tooth,\nthe tooth will surely form.*\n*If the time is for refining the Elixir,\nthe Elixir will surely form.*\n*All follow this method to manifest the Heavenly symbol.*\n\n*The *Ziyang Jinbi Classic* says:*\n*The Dao of Returning the Elixir\nis the same as the Nine Crucible method;\nSpirit Water’s function\nis further refined through mutual circulation.*\n*First, the Nine Crucibles refine the tooth,\nthen the Nine Crucibles refine the Elixir—\nhence it is said the Dao of Returning the Elixir\nis the same as the Nine Crucible method.*\n\n*The *Zhouyi Parameters* say:*\n*Before the water clock’s half-mark passes,\nscaly fish dart and scatter.*\n*Thus, when the clock’s division is clear,\nits markings align with the Five Phases.*\n*Day and night’s mysterious operations\nrespond to the talisman’s nodes.*\n*The classic says:*\n*The nodes are the divisions of the twelve daily hours.*\n*Day and night proceed without pause,\nthe supreme Dao’s divine function\nadjusts to the clock’s ebb and flow.*\n*Yin and yang transform—\nfleeting yet shifting.*\n*Water pressed by Fire\ncannot endure the moment’s constraint.*\n\n*Hence Yuanjun says:*\n*‘Fleeting transformation\nlies in that very instant.’*\n\n*The *Parameters* say:*\n*‘In deep winter’s scorching heat,\nsummer’s frost and snow,\nthe solstices’ horizontal sweep\ndefies the clock’s measure.’*\n*This is the *Parameters*’ sacred intent,\nits profound and subtle meaning.*\n\n*The secret says:*\n*When refining the Elixir’s ascent and descent,\nnever abandon the furnace for an instant.\nListen for the *qi*’s murmurs,\nadjust the Fire’s temper—\ngradually increase the heat;\notherwise, prior efforts may be lost.*\n*Loss comes when Fire’s measure fails to align with the time.*\n*Spring Wood not yet full,\nSummer Fire already active—\nSummer’s blazing heat\nyet enforcing Winter’s order—\nthis is the fault of the furnace-tender’s negligence.*\n*Why then does the ash darken over years,\nFire nurtured for seasons,\nwhile cinnabar’s grains\nstill claim not to be subdued?*\n\n*The commentary says:*\n*As for the Golden Liquid Elixir,\nit is the condensed *qi* of the Golden Flower’s essence.\nWhen a person ingests it,\nit flows through the hundred channels,\npreserving youth and reversing aging,\nmoving swiftly as wind,\nimmune to all calamities—\ndragons and spirits revere it,\nEarth and spirits protect it.\nThose who take it for years\nexperience extraordinary events.*\n*After three years of ingestion,\ntruly divine and miraculous events occur.*\n*Further relying on yin’s concealment,\nawaiting its supreme ascent.\"*\n\nThis is the Ninefold Transformation of Golden Liquid,\ncondensed and refined into Returning Elixir.\nHow could it be mere cinnabar turned to powder,\nmercury as frost?\nThis regret is profound indeed.\n\nThis is called studying without examining antiquity,\nobscurely expounding scriptures and commentaries,\ncutting according to one’s own whims,\nabandoning the Dao and inverting virtue.\nFamilies squander their wealth,\nyet achieve nothing—\ntruly the fools of the world,\nwho can awaken them?\n\nYet the sages of old and the saints of later times,\ntheir profound elixir principles flow from a single source,\nso there is no second or third.\nThey fully illuminate the True Unity,\nmaster the marvelous calculations of the Five Phases,\ndelve into the interplay of yin and yang,\ngovern the circulation of cold and heat,\npassing down knowledge from benevolent and virtuous ones.\nThey broaden their practices and refine their wisdom,\nknowing the roots of lead and mercury,\nfixing the great numbers of water and fire—\nso clear and evident,\nonly then can one undertake their work.\n\nThe secret formula says:\n*Just as the pulse is one within the body,\nyet the hundred pores leak in a thousand moments,\ntime follows the pores’ flow,\nand the moments measure time.\nIf the pores cannot be controlled,\nthe elixir changes with each moment.*\n\nThis is a universal formula forbidden by all immortals,\na profound meaning of the *Qiánshān* [1] tradition.\nTo forget the scriptures and commentaries,\nto stray far from the subtle and extreme principles—\nthis is the essence of the elixir’s divine truth,\nnone surpass this formula.\n\n*The Great Ease* [2] says:\n*A day has twelve times—\nsix of yang, six of yin—\nthis is the reckoning of time.*\n\nThe revolving cycles return,\nconcealment and manifestation occur within time.\nHow could a dull heart measure days,\nor a flawed intention span years,\never lingering in darkness,\nwasting time in vain?\nThis is truly lamentable—\na pity to squander light and time.\nAspiring immortals,\nplease examine this carefully.\n\nJust as the *qi* is divided by nodes,\nthe general rule is five days for one phase,\ncounting sixty times [3].\nBirds and beasts, their eggs and births,\nchange according to the nodes.\nThe text says:\n*After five days, a sparrow entering water becomes a clam.*\n*After five days, a wild parrot entering water becomes a jellyfish.*\n*After five days, an eagle transforms into a dove.*\n*After five days, a field mouse becomes a tortoise.*\nTransformation is not free to command—\nwhen the time arrives, change occurs.\nThe principles of elixir and profound symbols\nare the same in their transformations.\n*After five days, the Divine Water’s form alters like ice and elixir—*\nthis is the heavens’ shared work,\nthe laws of time and transformation aligning with divine change.\n\nThe profound intentions of the saints,\nthe elixir schools’ many debates—\nthis is one such principle.\n\nAnother principle of the saints:\n*As today’s direct correspondence,\nunlocking the elixir’s transformation,\nthe Hexagram of Reunion is paramount,\nigniting the Fire Branch,\nawakening the trigrams to divine resonance,\nyet ending at the Geng [4] stem—\npure yang.*\n\n*Nǐ* [5] is the first of the received sounds,\ngathering and containing the primordial *qi*,\nyet ending at the Hài [6] stem—\npure yin.\n\nToday’s Fire Branch governs the numbers,\nharmonizing the Hexagrams of Heaven and Earth,\nshifting twelve lines [7],\ncounting twelve times.\nWithin these times,\nthere is yin and yang,\nlight and dark,\nmovement and stillness,\nadvance and retreat—\nascend and descend with each moment,\ncycling in full return.\nThe alchemical cauldron’s sacred medicine\nadapts to the hexagram’s changes,\nfive colors radiant in flowing light—\nheaven and humans rejoice together.\n\nThis formula is engraved on golden tablets externally,\nyet treasured within the heart internally.\nWhen passed to others,\nsaints and virtuous ones transmit it solemnly,\nwith fasting, purification, and solemn oaths,\nnever to be casually revealed.\n\nIt is the Primordial Beginning’s mysterious speech,\nthe ultimate golden principle—\ndo not betray the teacher’s sincerity.\n\nThe Lord of the Tea [8] earnestly wrote:\n*The Celestial Gate opens,\nthe Earthly Portal closes—\nthe saint’s secrets must not be divulged.*\n*To recklessly reveal the true formula,*\n*disaster will follow, leading to extinction.*\n*Is this not easy to understand?*\n\nIt is also said:\n*Those who receive it do not disclose it,\nthose who disclose it lose their virtue.*\n*Pass it on with words,*\n*yet warn to guard the profound silence.*\n\nThe commentary says:\n*If one obtains the medicine’s source,*\n*success is certain.*\n*It must benefit all beings,*\n*not just one.*\n\nWhen this medicine is perfected,\nit grants the power to elevate an entire household,\nnot just one person.\nYet see today’s practitioners refining elixirs—\nthough they speak of it,\nthey lack the true substance.\nDaily they speak of the Dao,\ndaily they discuss the elixir,\nyet when examining the genuine meaning,\nthey know not the saints’ intentions.\nSo obscured, they cannot even achieve their own goals—\nwho then can benefit all and elevate a household?\n\nThe scripture says:\n*If one remains ignorant of the medicine’s source,*\n*even one’s own life cannot be preserved.*\n*If one understands the Divine Water,*\n*the whole family returns to the True.*\n\nThe Divine Water and sacred stone—\none dragon, one tiger,\ntwo substances knowing their essence—\nthe foundation of immortality,\nthis is what is meant.\n\nThe commentary says:\n*Those who receive it grow wiser each day,\nyet only upon obtaining the medicine’s source\ncan cultivation be truly inspired.\nOnce a month, the elixir coalesces,\nthe cauldron is opened for bathing,\nobserving its hues,\ngradually perceiving the depths.\nEach cauldron’s transformation confirms its truth,\nbecoming profound function—\nits Dao renews daily,\nits importance is evident.*\n\n*Those who are lost grow more confused each day.*\n*Lost ones mistake cinnabar and mercury*\n*for the great medicine,*\n*boiling and refining them endlessly,*\n*turning them to dust or ash,*\n*never aligning with the principles,*\n*with no way to confirm its truth.*\n*Having strayed from the profound intent,*\n*their confusion only deepens,*\n*their heads white as thread—*\n*how can they awaken?*\n*Their Dao grows ever more distorted,*\n*their confusion ever more profound.*\n\n*Follow the Dao and uphold the One,*\n*Follow the Dao and remember lead,*\n*The marvel lies in upholding the One.*\n\nThe skin is pierced for calculation,\nspring commands its flourishing.\n\nThe scriptures say:\nThe Dao of *three-five* is ever-present in heaven and earth,\nused to measure time and regulate the flow of *qi* through the land,\nreturning to the *Zhongguan* [central official],\nits numbers manifest in five.\n*Three-five* and *One* are the utmost essence of heaven and earth,\nwhich may be entrusted to oral precepts,\nyet is difficult to record in writing.\n\nThe essence of the Great Elixir lies beyond mere numbers,\nwithout which its spirit cannot be known.\nDivine *qi* and the Alchemical Pool cannot be united\nwithout the true lead.\n\nIf one understands and upholds the *One*,\nalready knowing the fundamental principles of the Great Dao,\nnothing remains unfulfilled.\n\nThe Celestial Sovereign has no favorites.\nThe Highest Heaven nurtures all things universally,\nits love for humanity most profound,\nits mysterious symbols and heavenly mechanisms\nin harmony with humanity—\nwhen the Dao is realized, virtue attained,\nthe Jade Emperor becomes manifest,\nyet only the Dao can be truly cherished,\nas revealed to the Supreme Deity.\n\nMy life is in my own hands,\nnot decreed by Heaven to live or die.\nIt does not grant my birth nor decree my death.\nThe Three Realms endure eternally,\neach preserving its original essence,\nyet only humanity often fails to cultivate itself,\nunaware of refining the Great Elixir.\nThe Highest Heaven’s clear discernment,\nthe radiant patterns of the law,\nthe Great Dao’s precepts and sacred writings\nare everywhere—\nyet those without aspiration to learn\nbetray themselves,\nforfeit their lives like mud,\nand become mere specters.\n\nMoreover, what is difficult to accumulate through cultivation\nis no greater than my own body.\nWhat is easily lost through negligence\nis not heard of in the Dao of Immortals.\nYet true lead is not distant—\ncommon folk use it daily without knowing.\nThe Great Elixir is not far—\nyellow sprouts fill the markets yet none perceive it.\nEven the *jifu* [lowly scholar] struggle to learn,\nwhile the *shangshi* [exalted sage] cannot easily transmit.\nHow much more so for ordinary people who say,\n\"Great fate lies with Heaven!\"\n\nIf one does not awaken to this,\nhow can they ever hear the truth?\nIf one claims fate is by Heaven’s decree,\nthen why does a child’s ingestion of poison\nnot inevitably lead to death?\nExamining past and present who attained the Dao—\nthousands, even millions—\nthey began as common folk in study,\nhow could the Jade Emperor descend with edicts,\nor the sun ascend to the heavens in broad daylight?\nThus, those who seek life\nfind their life fulfilled,\nthose who remain ignorant of death\nsuffer it as their due.\nAscension and decline, gain and loss,\ncannot be spoken of as Heaven’s doing—\nfor my life is in my own hands.\n\nWithout the Elixir, life cannot persist.\nThe *chénbìng* [dust-illness] afflicts the lowly,\nwho indulge in meat and alcohol,\ngreasy and blood-rich, clogging the five *zàng* [viscera] and six *fǔ* [bowels].\nFilth and *qi* seethe,\nweighting the body like a hundred pounds—\nhow could it rise lightly?\nIf not for the Golden Elixir’s marvelous medicine,\nthere is no way to purify and transform.\nWith one dose of divine medicine,\naging reverses to youth,\nranking among the True Persons,\nname inscribed in the Jade Register,\nsharing eternal life with Heaven and Earth—\nwithout the Golden Elixir,\nlife cannot be preserved.\n\nCultivation requires enduring time,\nrefining the Elixir in the sacred chamber of *qi*.\nIt is not the work of a single morning or evening.\nNine transformations yield *yá* [alchemical tooth],\nnine more yield the Elixir,\nunlocking the principles of creation,\nrequiring secluded peaks,\na few like-minded companions,\nmorning and evening devotion,\nthe Alchemical Hall and furnace,\nwell-laid bricks and tiles,\ntwice-daily reverence,\nfasting gruel for sustenance,\nfocused intent to return to the True,\nunified spirit and clarity—\ntruly not easy,\nyears of effort alone suffice,\nhence it is said,\n\"Cultivation requires enduring time.\"\n\nNourishment grants eternal renewal,\nafter taking the medicine,\nthe *Three Corpses* [三尸虫] gradually depart,\nrefined essence returns to the marrow,\ncomplete restoration—\ndarkness becomes light,\nyouthful visage flourishes,\nspirit sharpens and transcends,\nDao-*qi* brings auspiciousness,\nthe Five Sacred Peaks’ numinous truths\ngather naturally,\nsoul and spirit pierce all,\nthe entire body like jade,\njoining the playful ranks of the Immortals—\nhence it is said,\n\"Nourishment grants eternal renewal.\"\n\nNumbers in harmony bring transformation,\nthe Sage refines the spirit-medicine,\nadjusting the numbers to govern the four seasons:\nspring unfolds and all things grow,\nsummer thrives with blazing fire,\nautumn gathers and gold ripens,\nwinter rests with water congealing.\nAlchemists’ craft lies in attuning to these seasonal *qi* flows—\nif one masters the four seasons’ breath,\nthe Golden Elixir naturally evolves,\nhence it is said,\n\"Numbers in harmony bring transformation.\"\n\nNumbers at their utmost become spirit,\nspeaking of the numbers’ completion.\nOnly when *yin-yang* numbers are fulfilled\ndoes the elixir’s formula become divine.\n*Yin* at its extreme yields hidden *yang*,\n*Yang* at its extreme yields suppressed *yin*,\nthe two *qi* mutually interact,\nthe natural way of the Dao.\nAgain, the \"extreme\" refers to\nthe exhaustion of all possible transformations,\nthus attaining the Dao of *yin-yang*—\nthe ultimate in numbers.\nThis is the subtlety of Immortals,\nthe law of transformation,\nhence it is said,\n\"Numbers at their utmost become spirit.\"\n\nGrasping this celestial mechanism,\nthe world’s accomplished deeds\nare nothing more than attaining the Dao.\nThe Dao’s attainment is simple—\nnone surpasses the Elixir.\nThe Elixir’s refinement lies in controlling *qi*,\ntransforming *qi* into form,\nnone beyond the mastery of numbers.\nNumbers forge the Golden Elixir,\n*three-five* and *One* united—\ngrasping this celestial mechanism,\nthe affairs of Immortals are complete.\nEternally ranked among the True Persons.\n\nThe *jindan zhenyi lun* [True One Golden Elixir Scripture] is now concluded.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "金丹真一论 经名：金丹真一论。 原题百玄子撰，约出於唐末五代。 引迷诸家丹诀，论外丹法。 一卷。 底本出处：《正统道藏》太玄部。 金丹真一论 夫灵丹之源，禀乎真一之气。 论曰：真一者，大道之源水也。 水者气也，气者道也。 道本无名，因气生质。 质者，有形之物也。 道始无形，从一气而受化，化及有形，形者名也。 故曰：道本无名，而强名曰道。 道本为一也，一者母也。 一能布化，生成万物，利用天下。 太上曰：布一名於天下。 几遇大丹，莫不寻本求末。 本者真一之源，为之母也。 子者丹也。 营丹之士，莫不求乎真一之源而化气成子。 神丹之妙，见於此矣。 形质既分，清源有异。 请者，黄芽也。 此芽能轻能浮。 浊者，铅也。 此｀铅能沈能滞。 大茅君谓青霞子曰：铅沈银浮，谓之黄芽。 亦日炼秋石，亦日黄芽。 几经炼九转神丹，鼎中须分清浊二气饰方悟造化之权。 二气者，一气全阳，守六爻正位。 一气全阴，亦守六爻正位，定阴阳两全之义。 《阴君还丹赋》曰：至道还丹，阴阳两全。 化瓦砾而成金，度几人而作仙。 此芽炼至九鼎，方为老芽，始堪入用。 丹书曰：黄芽者，造化之终也。 况老阳之芽，神气方足，堪用作丹也。 数起北方河车， 车者，还丹日数也。 谓言行火须满三十日，要法逐月节度，运火勿停，阴阳各半，互相受用，气行一周，丹转一次，始起北方复卦，从阳爻运气，而终十月，阴阳数足矣。 定神水之受用。 几运大丹，先定神水华池，为之受用，得水方与真铅同类。 丹书云：同类气合，相须如神。 若铅不真，神水无以能受。 仙家所忌。 忌类不同，是以先定神水，后议真铅。 《参同契》曰：若铅不真，其汞难住。 几称汞者，是神水华池也。 此气若非真铅，无以制其汞。 汞若得伏，有诸异名，且非独汞之名。 一名流珠，一名金液，一名金浆，一名玉醴，一名紫游膏，已上俱是神水华池中真铅也。 真铅真汞，二味华气，凝结成丹。 丹家先定神水华池，为之受用。 修丹之士若明神水华池，定知仙路不远矣。 大丹不得神水，无以变其灵通。 神水不遇真铅，无由吐结精气。 二物相合，乃成还丹。 论曰：水数属一，含气混真，配位而黑，得合真铅。 真铅受性，养在北方黑气。 黑气即神水是矣。 此铅含光隐迩，造化自然。 真铅含五色之象，道家每三百六十时，一度开鼎，添合铢两，便见其灵异，时黑时白，或黄或紫，或红或青，应金木水火土之正位。 《阴真君流珠金镜》云：一物有五彩，永作仙人禄。 又云：铅含五彩，汞吐三花。 二物合体，名为河车。 河车是丹之异名也。 或沈或浮，能有能无，散即潜龙，聚则秋石。 《金虎元君诀》曰：浮沈恍惚，渺邈如云，其中有精，可以经纶，似有似无，难辩素真。 此乃元君指显真铅，有此浮沈变化之妙。 论曰：浮沈者，鼎中收结也。 结精华之花，透出其上，谓之轻浮之精华，又名神符白雪，又名钟乳，又名马齿栏干。 俱是黄芽一体，鼎中变化异常也。 营丹高士，若运玄功及此，定知九转神丹，全科毕法在乎手矣，可以将近仙都，名标玉籍。 已上并是黄芽运化之道，殊圣之功，仙家贵重之事。 黄门侍郎萧子云大丹歌曰：千言只为秘黄芽，万卷方书说闲石。",
      "translated_text": "**Title: Treatise on the True Unity of Golden Elixir**\n*(Original Attribution: Attributed to Bai Xuanzi, likely from the late Tang to Five Dynasties period. Compiled from various alchemical precepts, expounding on external elixir methods. One scroll. Source: *Zhengtong Daozang*, Taixuan Section.)*\n\n---\n\n**Treatise on the True Unity of Golden Elixir**\n\nThe origin of the soul-nurturing elixir lies in the essence of the True Unity *qi*.\nThe Treatise says:\nThe True Unity is the primordial water of the Great Dao.\nWater is *qi*; *qi* is the Dao.\nThe Dao originally has no name; through *qi*, it manifests as substance.\nSubstance is the form of all things.\nThe Dao initially is formless; through the Unity *qi*, it undergoes transformation.\nWhen transformation reaches the stage of form, form is what is named.\nThus it is said: The Dao originally has no name, yet it is forcibly named \"Dao.\"\nThe Dao is fundamentally One; One is the Mother.\nOne spreads transformation, giving birth to all things and benefiting the world.\nThe *Taishang* says: \"Spread the name of One throughout the world.\"\nThose who seek the Great Elixir all trace from root to branch.\nThe root is the source of True Unity, the Mother.\nThe child is the elixir.\nAll who cultivate the elixir seek the source of True Unity to transform *qi* into the child.\nThe marvel of the divine elixir lies here.\n\nOnce form and substance are distinguished, the pure and impure sources differ.\nThe pure is the yellow sprout.\nThis sprout is light and can float.\nThe impure is lead.\nThis lead is heavy and can settle.\nThe Great Mao Jun said to Qingxia Zi:\n\"Lead sinks, silver floats—this is called the yellow sprout.\nIt is also called refining autumn stone, also called yellow sprout.\"\nAfter refining through nine transformations of the divine elixir, the crucible must separate the pure and impure *qi* before one comprehends the authority of transformation.\nThe two *qi* are:\nOne *qi* is fully Yang, abiding in the correct position of the six *gua*.\nOne *qi* is fully Yin, also abiding in the correct position of the six *gua*,\nestablishing the principle of Yin-Yang completeness.\n*The Ode of the Yin Lord’s Return Elixir* says:\n\"The supreme Dao returns the elixir; Yin and Yang are complete.\nIt transmutes base matter into gold, elevating mortals to immortality.\"\nWhen this sprout is refined through nine crucibles, it becomes the aged sprout,\nonly then fit for use.\nThe elixir scripture says:\n\"The yellow sprout is the completion of transformation.\nHow much more so the aged Yang sprout, whose divine *qi* is now sufficient,\nfit for elixir use.\"\nThe number of days for the Northern River Vehicle is set.\nThe Vehicle refers to the daily count for elixir refining.\nIt means that when refining fire, one must complete thirty days,\nadhering to monthly cycles, never stopping the fire’s operation,\nwith Yin and Yang each occupying half, mutually nourishing.\nWhen *qi* circulates one full cycle, the elixir transforms once,\nand the Northern River Hexagram arises, drawing *qi* from the Yang line,\nuntil ten months pass, when Yin and Yang numbers are complete.\nThe divine water’s reception is thus determined.\nWhen refining the Great Elixir, first establish the divine water’s Hua Pool\nas its receptacle, so that the water aligns with true lead.\nThe elixir scripture says:\n\"When *qi* of the same kind converges, they assist each other like gods.\nIf the lead is not true, the divine water cannot receive it—\na taboo among immortals.\nThe taboo lies in differing kinds; hence, first establish the divine water,\nthen consider true lead.\"\n*The Parametric Accord* says:\n\"If the lead is not true, mercury cannot be contained.\"\nWhen referring to mercury, it is the divine water’s Hua Pool.\nThis *qi*, if not paired with true lead, cannot govern mercury.\nIf mercury is subdued, it has many names, not merely 'mercury.'\nIt is also called flowing pearl, golden liquid, golden paste, jade nectar,\nor purple wandering salve—all are the true lead within the divine water’s Hua Pool.\nTrue lead and true mercury—these two refined *qi*—congeal to form the elixir.\nElixir cultivators first establish the divine water’s Hua Pool as its receptacle.\nIf those who refine the elixir understand the divine water’s Hua Pool,\nthey will know the path to immortality is near.\nThe Great Elixir without divine water cannot achieve its spiritual efficacy.\nDivine water without true lead cannot emit and condense vital *qi*.\nWhen the two unite, they form the Return Elixir.\nThe Treatise says:\nWater’s count belongs to One; it contains mixed true *qi*,\naligning with position to become black, merging with true lead.\nTrue lead receives its nature, nurtured by the black *qi* of the North.\nThis black *qi* is the divine water itself.\nThis lead contains hidden light, naturally transforming.\nTrue lead embodies the five colors’ symbols.\nDaoists, every three hundred sixty moments, open the crucible once,\nadding increments to observe its marvels—\nsometimes black, sometimes white, or yellow, purple, red, or green,\ncorresponding to the true positions of Metal, Wood, Water, Fire, and Earth.\n*The Mirror of the Yin Lord’s Flowing Pearl* says:\n\"A single substance with five colors, eternally the immortals’ fortune.\"\nIt also says:\n\"Lead contains five colors; mercury emits three flowers.\"\nWhen the two substances merge, they are called the River Vehicle.\nThe River Vehicle is another name for the elixir.\nSometimes it sinks, sometimes floats—\ncapable or incapable, dispersed as the hidden dragon,\ncongealed as autumn stone.\n*The Precept of the Golden Tiger Marshal* says:\n\"Floating and sinking, vague as clouds,\nyet within lies essence, worthy of refinement—\nseemingly present, seemingly absent,\ndifficult to distinguish from the unadulterated.\"\nThis is the Marshal’s revelation of true lead,\npossessing the marvel of floating and sinking transformations.\nThe Treatise says:\nFloating and sinking are the crucible’s condensation of essence.\nThe condensed essence’s flower rises above,\ncalled the light-floating essence, also named divine talisman white snow,\nor stalactite, or horse-tooth railing—\nall are manifestations of the yellow sprout’s singular transformation within the crucible.\nNoble cultivators of the elixir, if they attain this stage of refined function,\nwill know that the nine-transformations divine elixir’s complete method lies in their hands,\nenabling them to approach the Celestial Capital and be inscribed in the Jade Register.\nAll above pertains to the transformation of the yellow sprout—\nthe sacred deeds of the Dao, treasured by immortals.\n\n**The Great Elixir Song by Xiao Ziyun, Minister of the Yellow Gate:**\n*\"A thousand words conceal only the secret of the yellow sprout;\nten thousand volumes of scripture expound on idle stone.\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1265,
      "start_sentence": 0,
      "end_sentence": 74,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 18.55988311767578,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\金丹真一论.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "论曰：黄芽未入鼎已前，先须定时日，化炼黑铅，以腾倒精华之气。 又轻浮者配合青龙，同入金鼎。 虽入金鼎内，犹是未分清浊。 何故，盖未受造化正气，凭何节令推迁，拟分清浊。 此须是治丹之人，妙运五行，能驱造化，审看刻漏，进退节符，黄芽始可化成。 其或水火数差，漏刻无准，阴阳失度，气候不交，黄芽万一不生，斯乃理丹之人慢怠，差其候也。 茅真人谓青霞君曰：阴阳不能顺，毕竟不生牙。 斯乃道家共禁之法，恐泄天机。 且见今人炼药，拟效长生，不知灵丹之源，妄认朱汞。 世上多俟认朱砂，用此为汞，更以铅花合造，烧缎为丹，伤人之命甚矣。 且自古高真之士，不无丹书仙经，洞文藏经，众真内禁圣诀，备显人问，开露玄意，引接后人。 凡举大丹，先具清釜之鳌，丹井醴泉，是修丹急务之要。 未审今人炼药，以何物为真铅，如何是神水华池，井鳌之用。 而配众仙相继，丹成之后，各有丹井具存。 当日若或无用，岂真圣造化无端，惑乱后人也。 且如内禁诀中，凡丹井成后，无令杂秽使用，水脉定后，更宜换之，涤去滞泉，然后任露天通，星月照之。 大凡井水，或有沙虫，视之不见，但以金银宝器盛之，旬日虫化为脚。 注云：如道家未办，但以通油新瓶器盛之，以蜡纸封头，勿令尘入耳。 水性既定，土气已收，方取合丹。 凡造丹井，若得石脚泉青白色者，元是阳脉之水，运丹复灵，若值青泥黑壤、黄泉赤脉、铁腥味验，有此之象，并有水脉交杂，阴壤积滞，土气昏浊，不任炼丹，宜须别造。 但得清泉味甘而醴者，切宜宝之。 已上内禁诀中论丹井第十二篇论曰：且水者，利生万物，五行之首，北方阴气一也。 故言水一火二木三金四土五，五行之数，一以贯之，始自虚无，从无入有。 绿水是虚无之体，故言从无也。 入有者，从此虚无气中，运五行造化，忽生还丹，故言入有也。 从有返归於无。 其丹虽然有也，遇换鼎器之时，是逐月添合青龙，乳育白虎，还复无也，故日归於无也。 还返数终，神丹自睹。 鼎中灵药，数转已足，满鼎殷红，又如血滴，中有白酥涌起之状，惟圣与贤，莫测灵通变化也。 随日月之变迁，顺五行之情性。 且如十五、十六日月正圆，明丹亦气盛光明也。 月将亏损，丹亦伏藏收结也。 如是返覆之数，九转皆总如斯。 凡丹书云九还七返者，此之谓也。 九为阳气之初，七为太阴之始。 几运大丹，并须阴阳对用，升降轮还，九六爻变。 《易》曰：乾元用九，天下治也。 又曰：用九，乃见天德。 是以治丹之象，并奉天时，合节须节，合行即行。 《易》曰：天地节而四时成，阴阳节而万物生。 所以丹家盗之，一如推化万物，变移种种奇异，花药红黄，枝条垂布，俱存鼎中，圣人效之变化也。 《易》曰：天地变化，圣人效之。 天垂象，圣人则之。 几治丹言运符节者，此之谓也。 还丹得不生焉。 已上明论注解九还七返大义，俱是还丹成熟之诀。 丹若不节不克，不止不杀，无能成宝者哉。 又丹书圣人类天地万物之情，穷阴阳配合之道，治符造化，尽妙五行，春气发而草木华，秋气收而万物实也。 《太易丹书》云：还返既老，精凝不飞。 若以朱砂抽汞，铅花取芽，八石三黄，五金杂类，此俱不入大丹之源。",
      "translated_text": "The Treatise states:\n\nBefore the yellow sprout enters the crucible, one must first determine the auspicious time and day;\nrefine black lead to purify, then ascend and descend the essence of the *light-floating qi*.\nAgain, the *light-floating* essence is paired with the Azure Dragon,\nboth entering the golden cauldron.\nThough within the golden cauldron,\nit remains yet undivided in purity and turbidity.\nWhy so?\nBecause it has not yet received the *zào huà*[造化] vital *qi* of the cosmos—\nhow could it, relying on mere seasonal ordinances, partition purity and turbidity?\nThis requires the elixir artisan to master the five phases,\ndrive the *zào huà*[造化], and carefully observe the water clock,\nadvancing and retreating with the celestial talismans,\nbefore the yellow sprout can be fully transformed.\nIf the water and fire ratios are miscalculated,\nthe water clock is unregulated,\n*yīn* and *yáng* are out of measure,\nand the *qi* climate fails to align,\nthen the yellow sprout may not even arise—\nthis is the fault of the careless elixir artisan,\nwho neglects the proper timing.\n\nMaster Mao Zhenren said to Qingxiyun:\n*\"If *yīn* and *yáng* cannot harmonize,*\n*the sprout will never emerge at all.\"*\nThis is the shared prohibition of Daoists,\nfearing the leakage of celestial secrets.\n\nMoreover, observe how mortals today refine medicines,\npretending to emulate longevity,\nyet ignorant of the true source of the *lingdān*[灵丹],\nmistakenly identifying cinnabar as mercury.\nThe world is filled with those who mistake red cinnabar for mercury,\nusing lead flowers to forge it,\nburning silk as the elixir—\ntheir harm to lives is profound indeed.\n\nEven among ancient noble immortals,\nthere are no shortage of elixir scriptures,\nDaoist classics, hidden texts,\nand secret precepts of the sages,\nall meticulously revealed to answer human queries,\nunveil profound meanings,\nand guide future generations.\nBefore undertaking the Great Elixir,\none must first prepare the *qīngfù*[清釜] tortoise of the cauldron,\nthe elixir well and the *lìquán*[醴泉]—\nthese are the essential prerequisites for elixir cultivation.\nNow, I must inquire—\nwhat do mortals today use as true lead?\nHow do they discern the *shénshuǐ huáxī*[神水华池] of the well-tortoise?\nAnd when the elixir is formed,\neach well-tortoise has its own purpose.\nIf, on that day, they prove useless,\nhow could it be that the sages’ true *zào huà*[造化] lacks foundation,\nconfusing future generations?\n\nFurthermore, as the secret precepts state:\nOnce the elixir well is formed,\ndo not allow impurities to contaminate it.\nAfter the water channels are stabilized,\none must replace them,\npurifying stagnant currents,\nthen permitting celestial *qi* to flow freely,\nand letting stars and moon illuminate them.\n\nIn general, well water—\nif it contains sand-worms invisible to the eye—\nbut stored in gold or silver vessels,\nafter a decade the worms dissolve into lead.\n**Annotation:** If Daoists cannot prepare [proper vessels],\nuse only new, sealed oil bottles,\ncovering the mouth with waxed paper,\npreventing dust from entering.\nOnce the water’s nature is settled\nand the *tǔqì*[土气] is contained,\nthen take it to combine with the elixir.\n\nFor constructing the elixir well,\nif one finds a spring of greenish-white lead,\nit is the water of *yáng* channels—\nwhen refined, the elixir becomes even more potent.\nIf the soil is greenish mud,\nor the spring is yellow with red channels,\nor the water has an iron-like stench,\nthese are signs of mixed water currents,\nstagnant *yīn* earth,\nand muddled *tǔqì*[土气]—\nsuch water cannot be used for elixir refinement;\nanother well must be constructed.\n\nBut if the spring is clear,\nsweet, and *lì*[醴]-like,\ntreasure it most carefully.\nAs the secret precepts further explain in the twelfth chapter on elixir wells:\n\nWater is the source of all life,\nthe first of the five phases,\nthe singular *yīn* essence of the northern realm.\nHence it is said:\n*\"Water one, fire two, wood three, metal four, earth five—*\n*the five phases’ order,*\n*unified in the One,*\n*originating from the void,*\n*entering existence from non-being.\"*\n\nThe *lǜshuǐ*[绿水] is the body of the void,\nhence *\"entering non-being.\"*\nWhen it enters existence,\nit is born from this void *qi* through the five phases’ *zào huà*[造化],\nsuddenly generating the *huándān*[还丹]—\nhence *\"entering existence.\"*\n\nFrom existence, it returns to the void.\nThough the elixir exists,\nwhen the cauldron is replaced each month,\nit is continuously merged with the Azure Dragon,\nnurturing the White Tiger,\nand thus returns to non-being—\nhence *\"returning to the void.\"*\nAfter many cycles of return and rebirth,\nthe divine elixir appears.\n\nWithin the cauldron, the sacred medicine\nundergoes countless transformations—\nwhen complete, the cauldron is filled with a deep crimson glow,\nlike blood droplets,\nwith white *sū*[酥] rising within—\nonly sages and worthies\ncan fathom its mysterious shifts.\n\nIt follows the ebb and flow of the sun and moon,\nconforming to the five phases’ inclinations.\nFor instance, on the fifteenth and sixteenth days,\nwhen the moon is full and round,\nthe refined elixir’s *qi* is also at its peak—\nradiant and luminous.\nAs the moon wanes,\nthe elixir also retreats, concealing and condensing itself.\nThus, the cycles of return and rebirth—\nall nine transformations follow this pattern.\n\nWhen elixir texts speak of *\"nine returns, seven rebirths,\"*\nthis is what they mean.\nNine marks the beginning of *yáng* essence,\nseven the origin of *tài yīn*[太阴].\nIn refining the Great Elixir,\none must always pair *yīn* and *yáng*,\nascending and descending in rotation,\nthe nine-six *yáo*[爻] shifting.\n\nThe *Yì*[易] says:\n*\"The primal *yáng* employs the Nine—*\n*order is established beneath heaven.\"*\nAgain it says:\n*\"Employing the Nine reveals Heaven’s virtue.\"*\nThus, the elixir’s transformations\nmust all conform to celestial timing—\nwhen the phases align, act;\nwhen the method aligns, proceed.\nThe *Yì*[易] says:\n*\"Heaven and Earth regulate their phases,*\n*and the four seasons are complete.*\n*Yīn and yáng regulate their courses,*\n*and all things flourish.\"*\nThis is why elixir artisans emulate it—\njust as the cosmos generates all things,\ntransforming into countless wonders,\nthe red and yellow medicines bloom,\nand the branches and stems extend within the cauldron—\nall are the sages’ imitations of celestial change.\n\nThe *Yì*[易] says:\n*\"Heaven and Earth undergo transformation,*\n*sages emulate their patterns.*\n*Heaven displays its symbols,*\n*sages follow them.\"*\nWhen refining the elixir,\nthe *\"mastering talismans and phases\"* is what is meant.\nThus, the elixir may not fail to form.\n\nThe above clarifies the grand principle of *\"nine returns, seven rebirths,\"*\nall being the secrets of the elixir’s maturation.\nIf the elixir is not refined with proper timing,\nit cannot be contained or halted—\nnone will achieve its treasure.\n\nMoreover, elixir texts categorize the sages’ methods\naccording to the nature of all things beneath heaven,\nexhausting the principles of *yīn-yáng* pairing,\nrefining talismans and *zào huà*[造化],\nand mastering the five phases’ subtleties—\nwhen spring *qi* arises, flowers and plants flourish;\nwhen autumn *qi* gathers, all things bear fruit.\nThe *Tài Yì Dānshū*[太易丹书] says:\n*\"Returned and reborn, it reaches full maturity,*\n*the essence condenses and no longer disperses.\"*\n\nIf one extracts mercury from cinnabar,\ntakes the sprout from lead flowers,\nor mixes the eight minerals with three yellows,\nor combines the five metals arbitrarily,\nthese are all not of the Great Elixir’s origin.",
      "overlap_context": "function,\nwill know that the nine-transformations divine elixir’s complete method lies in their hands,\nenabling them to approach the Celestial Capital and be inscribed in the Jade Register.\nAll above pertains to the transformation of the yellow sprout—\nthe sacred deeds of the Dao, treasured by immortals.\n\n**The Great Elixir Song by Xiao Ziyun, Minister of the Yellow Gate:**\n*\"A thousand words conceal only the secret of the yellow sprout;\nten thousand volumes of scripture expound on idle stone.\"*",
      "start_char": 1265,
      "end_char": 2518,
      "start_sentence": 75,
      "end_sentence": 124,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 22.523115634918213,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\金丹真一论.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "但可以制伏，变化黄白，添为世宝，济贫助道，救接孤危。 若将此顽滞之物为丹，奈仙经云：朝服一刀圭，暮可生羽翼。 料兹顽质，必不及斯。 且朱砂水银有质之类，又经火缎，阳毒相含，服之发渴烂肠，喉结如火，千万莫能疗，五藏已亡，万金之身误伤何苦焉。 马明先生曰：还丹者，见水归水体，入火复金液，服食如风雨，消融归百脉。 还丹从浆液化，故言金液。 可以融百脉，服之注灌百脉，疾如风雨，驱除邪气也。 阴君曰：无质生质是还丹，凡汞凡砂不劳弄。 论曰：无质者，虚无之气是也。 此气呼吸动静，腾跃伏藏，非离母也。 母者水也，水合真铅，配为华池，华池便是丹田也。 丹书云：用铅不用铅，铅是旧丹田。 既产其丹，名为生质，故曰无质生质是还丹。 论曰：水虽有形，终而无质，神仙以法制之，能生质也。 生质之由，始绿升降致兹有也。 升即鼎中阳气上腾，降即壶中阴气下结也。 论曰：丹处虚无者，与蠹钥而伏华气是也。 河上公云：索钥空虚，故能有声气者也。 一气纯乾，全行阳道。 一气纯坤，全行阴道。 并是阴阳交媾，二气成真，真者丹也。 丹者凝结之象，红液是也。 丹成故非檀末之形，俱为红液之象也。 诀曰：切在先凭刻漏，昼夜无差，或退水进火之时，俱在午前分漏，焚香勿绝，仰告上真，乾火盛明，恐鼎有失。 亢龙有悔，是此时也。 治重刚之险，九天之德，莫盛於斯，故日乾火盛明也。 不可辄抛药堂，专听龙吟盛位之声，审察阴阳调理之候，或闻雄声稍武， 武是亢龙之火，纯阳也。 绿阳道将退，未免进火，应其时数也。 须满炉之火得，不忧兹惊失，又虑鼎器难禁。 有此雄声，切在小心，以时消息也。 暂开午门。 午门，是下次进火之门。 纳阴之首，暂且开之。 放火气伸缓，侯声稍和，清幽丝竹之类，却掩之，气和者也。 微通火气，其声清幽，徐而复掩，又恐歇气，多时节滞，神丹变化。 自此已上俱是乾道变化，治丹君子善守护持，方保贞吉。 诀曰：其次遇进水退火之时。 时在娠卦，治一阴而御五阳，乾元亨利，万物资生，承顺乎天，乃终有庆也。 履霜坚冰，阴始凝也。 盛暑雷震，息以威萝。 芽体渐成，循善无失。 漏应二更，贞而复吉。 《太易》曰：娠结其瑞，雪霜其素。 胎滞蒙肥，阴为阳主。 道之枢机，伏藏为虎，履霜光耀，坚冰寒冱。 此时丹渐凝结矣，神水已变，大道功全造化，既成黄芽，炼彻九转，灵质可观，号曰老芽，以兹方熟。 黄芽澄炼须熟，方堪入用，炼化为丹。 太一真人玉壶颂云：十月霜飞雪又浓，黄芽内熟色显显。 修丹若见黄芽熟，安得不思金虎龙。 是知黄芽九转方熟，或如栏干钟乳，迭石嵯峨，科计万条，丝文马脑，玉柱玲珑，种种灵异之象，直候九转将足，收此灵芽，上坛呈天，诚心仰告，弘愿惟深。 再炼灵芽，愿成大药，晨昏朝拜，开启坛炉，从此之后，志炼还丹。 《参同契》云：黄芽者，是大药之根基，长生之至宝。 其奈孤阳之芽，未可独立。 水合阴阳，方为大药。 论曰：故知水者，大药之宗，内固营丹，外化万物，合阴合阳，神仙之母。 太上曰：天得一以清，地得一以宁，万物得一以生黄芽。 得水改性换形，变为还丹，正名大药。",
      "translated_text": "「Yet it can be used to subdue and transform—\nto transmute yellow and white,\nto augment worldly treasures,\nto aid the poor and assist the Dao,\nto rescue and shelter the lonely and the endangered.\n\nIf one were to forge this stubborn and sluggish substance into an elixir,\nhow could it compare to the scriptures of the immortals, which say:\n*\"Morning, dressed in a single tablet of elixir,*\n*by evening, one may grow wings and fly.\"*\n\nThis crude material could never match such lofty attainment.\nMoreover, cinnabar and liquid mercury possess tangible natures,\nand after undergoing fire refining,\nthey harbor *yáng* toxicity within their *yīn*—\ningesting them causes thirst, intestinal decay,\nand a throat constriction like fire;\nnot even ten thousand gold pieces could cure it—\nwhen the five *zàng*[藏] are already destroyed,\nwhat is the use of harming one’s precious body?\n\nMaster Ma Ming[马明] said:\n*\"The Great Elixir returns to its original form—*\n*when water is encountered, it takes on water’s essence,*\n*when fire is entered, it reverts to golden liquid.*\n*Ingestion is like wind and rain,*\n*dissolving and permeating into the hundred vessels.\"*\n\nThe Great Elixir transforms from its primordial fluid,\nhence the term *golden liquid*[金液].\nIt can dissolve into the hundred vessels—\nwhen taken, it irrigates and nourishes them,\ndispersing ailments like wind and rain,\nand expelling malevolent *qi*[氣].\n\nThe *Yīn Jūn*[阴君] states:\n*\"The Great Elixir is born from formlessness—*\n*common mercury and cinnabar need no manipulation.\"*\n\nThe commentary explains:\n*\"Formlessness refers to the *qi* of emptiness and non-being.*\n*This *qi* moves with breath, rises and falls in stillness and activity,*\n*and is not separate from its source.*\n*The source is water—*\n*water unites with true lead,*\n*forming the *Huá Chí*[华池] (Refined Pool),\n*which is the elixir field (*Dān Tiān*[丹田]).*\n*The elixir texts say:*\n*'Use lead, not lead—*\n*lead is the old elixir field.'*\n*Once the elixir is produced,*\n*it is called 'born essence' (生质),*\n*hence 'formlessness gives rise to essence is the Great Elixir.'*\n\n*The commentary further states:*\n*'Though water has form,*\n*it ultimately lacks essence (质).*\n*The divine and immortal use methods to govern it,*\n*and thus it can give rise to essence.*\n*The origin of born essence*\n*lies in the ascent and descent of green—*\n*ascent is when *yáng* *qi* surges upward in the crucible,*\n*descent is when *yīn* *qi* condenses downward in the retort.'*\n\n*The commentary continues:*\n*'The elixir dwells in formlessness—*\n*this is like the *Dùo yuè*[蠹钥] (borer-key) hidden within the refined *qi*[华气].*\n*River Master[河上公] said:*\n*'Seek the borer-key in the void,*\n*for only then can one have vital breath and *qi*.'*\n*A purely *qiān*[乾] *qi* follows the complete *Way of Yang*[阳道].*\n*A purely *kūn*[坤] *qi* follows the complete *Way of Yin*[阴道].*\n*Both are the union of *yīn-yáng*[阴阳],*\n*where the two *qi* form the true—*\n*the true is the elixir.*\n*The elixir is the condensed form,*\n*manifesting as red fluid.*\n*When the elixir is complete,*\n*it is no longer the shape of powdered sandalwood—*\n*all are symbols of red fluid.*\n\n*The secret instructions say:*\n*'First, rely on the clepsydra[刻漏] for precise timing,*\n*neither day nor night should differ.*\n*During the phase of retreating water and advancing fire,*\n*all occurs before noon.*\n*Burn incense without interruption,*\n*face upward and sincerely invoke the Highest Truth,*\n*ensuring the *qiān* fire is at its peak—*\n*lest the crucible falter.*\n*When the dragon is at its zenith,*\n*retreat is inevitable—*\n*this is the critical moment.*\n*To govern the harshness of excessive *yang*[刚],*\n*the virtue of the Nine Heavens is unrivaled,*\n*thus it is called 'the *qiān* fire at its peak.'*\n*Do not hastily abandon the alchemical chamber.*\n*Listen solely to the resounding voice of the dragon at its height,*\n*carefully observing the *yīn-yáng*[阴阳] harmony’s signs.*\n*If you hear a fierce, masculine tone,*\n*that is the *yang* of the overbearing dragon,*\n*a purely *yáng* force.*\n*As the green *yang*[绿阳] wanes,*\n*do not fail to advance the fire,*\n*responding to its proper measure.*\n*When the fire is fully obtained,*\n*there is no fear of sudden loss or excess,*\n*yet one must still guard against the crucible’s fragility.*\n*At such a masculine sound,*\n*be ever vigilant,*\n*adjusting fire and water in due time.*\n\n*Temporarily open the midday gate.*\n*The midday gate is the portal for the next phase of advancing fire,*\n*the beginning of receiving *yin*[阴].*\n*Open it briefly,*\n*allowing the fire *qi* to stretch and relax,*\n*waiting for the sound to become gentle and harmonious—*\n*like the faint, distant strains of strings or bamboo pipes.*\n*Then close it again—*\n*this is the moment of *qi* harmony.*\n*Gradually introduce fire *qi*,*\n*its voice clear and refined,*\n*slowly close once more—*\n*lest the *qi* stagnate,*\n*and the prolonged delay*\n*alter the elixir’s transformation.*\n*From this point onward,*\n*all is the *Way of Qiān*[乾道]’s transformation.*\n*Alchemists who skillfully guard and nurture*\n*will alone preserve their true and auspicious nature.*\n\n*The secret instructions continue:*\n*'Next, encounter the phase of advancing water and retreating fire.*\n*This occurs in the *Lǚ*[履] hexagram,*\n*governing one *yin* while restraining five *yang*[阳].*\n*When *Qiān*[乾] is harmonized,*\n*all things flourish,*\n*following the natural order,*\n*and thus attain completion with blessings.*\n*Stepping on frost yields solid ice—*\n*the beginning of *yin* condensation.*\n*In intense summer, thunder shakes the heavens,*\n*yet it subsides with the power of *lúo*[萝] (a medicinal herb).*\n*The sprout’s form gradually takes shape,*\n*proceeding without error.*\n*The clepsydra marks the second watch,*\n*when stability returns and auspiciousness is restored.*\n\n*The *Tài Yì*[太易] says:*\n*'In the *Lǚ* hexagram, the elixir condenses its auspicious signs,*\n*snow and frost are its essence.*\n*The embryo is sluggish, yet rich with potential—*\n*when *yin* submits to *yang*’s dominion,*\n*this is the pivotal mechanism of the *Way*.*\n*The borer-key hides like a tiger,*\n*stepping on frost radiates brilliance,*\n*solid ice grows cold and severe.*\n*At this moment, the elixir gradually condenses,*\n*the spirit water has transformed,*\n*and the Great *Way*’s alchemical work is complete.*\n*Once the yellow sprout is formed,*\n*refined through nine cycles,*\n*its luminous essence is evident,*\n*and it is called the *old sprout*[老芽],*\n*now fully mature.*\n\n*The yellow sprout must be clarified and perfected before it can be used,*\n*then refined into the elixir.*\n*The True Person of *Tài Yī*[太一]’s *Yù Hú Sòng*[玉壶颂] states:*\n*'In the tenth month, frost flies and snow thickens,*\n*the yellow sprout ripens within, its color vivid and bright.*\n*If one cultivates the elixir and sees the yellow sprout mature,*\n*how could one not ponder the golden tiger and celestial dragon?'*\n\n*Thus it is known:*\n*The yellow sprout reaches perfection only after nine cycles,*\n*sometimes resembling stalactites or coral,*\n*layered stones in towering grandeur,*\n*or myriad threads like horsehair and deer sinew,*\n*or jade pillars exquisitely formed.*\n*All these wondrous signs*\n*await the completion of the nine cycles,*\n*then gather this luminous sprout,*\n*ascend to the altar,*\n*and present it to Heaven,*\n*sincerely invoking with profound aspiration.*\n*Refine the luminous sprout once more,*\n*praying for the Great Medicine’s completion,*\n*offering morning and evening reverence,*\n*opening and closing the furnace altar,*\n*and from this point onward,*\n*dedicate oneself to cultivating the Great Elixir.*\n\n*The *Cān Tóng Qì*[参同契] states:*\n*'The yellow sprout is*\n*the root of the Great Medicine,*\n*the supreme treasure of longevity.’*\n*Yet the lone *yang* sprout*\n*cannot stand alone.*\n*Water unites *yin* and *yang*[阴阳],*\n*only then does it become the Great Medicine.*\n\n*The commentary explains:*\n*'Thus it is known that water*\n*is the origin of the Great Medicine,*\n*internalizing to solidify the elixir,*\n*externalizing to transform all things,*\n*uniting *yin* and *yang*—*\n*the mother of divine and immortal cultivation.’*\n\n*The *Tài Shàng*[太上] says:*\n*'Heaven obtains One to achieve clarity,*\n*Earth obtains One to achieve tranquility,*\n*and all things obtain One to generate the yellow sprout.*\n*Obtaining water alters its nature and form,*\n*transforming it into the Great Elixir,*\n*properly named the Great Medicine.\"*」",
      "overlap_context": "huà*[造化],\nand mastering the five phases’ subtleties—\nwhen spring *qi* arises, flowers and plants flourish;\nwhen autumn *qi* gathers, all things bear fruit.\nThe *Tài Yì Dānshū*[太易丹书] says:\n*\"Returned and reborn, it reaches full maturity,*\n*the essence condenses and no longer disperses.\"*\n\nIf one extracts mercury from cinnabar,\ntakes the sprout from lead flowers,\nor mixes the eight minerals with three yellows,\nor combines the five metals arbitrarily,\nthese are all not of the Great Elixir’s origin.",
      "start_char": 2518,
      "end_char": 3780,
      "start_sentence": 125,
      "end_sentence": 182,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 27.04297113418579,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\金丹真一论.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "所以《参同契》云：孤阳之芽，未可独立。 水合阴阳，方为大药。 是知天机之事，不可得而闻之，玄诫也。 论曰：水本非神，得数则真。 故言神水也。 此水莫不五行共化，四象相推，陶家之输返，圆转数极，知来者成化备矣。 况乎真人，运造始而有则，终而有归，兆之未萌，万物斯睹，何难之有。 如日月输还，昼夜恒则。 所以造成世界，化及人民无穷也。 斯乃始得阴阳度数，运转有恒无竭也。 若言营造大丹，须藉感时相应，是以功殊物外，世法莫同，神水非神，从数而妙。 又《阴符》曰：金丹之术百数，其要在神水华池。 是知还丹得一，变化无穷，升举常个，永齐天地也。 论曰：水性全阳形而能阴。 置百斛於釜中，煎而乾之，显兹无质也。 而润及於大地，百物生焉。 何故有质也。 此质盗天地正气而生。 经云：天地万物之盗，俱是抱一负阴而生。 斯乃并论天象化备，万物有归，故成就也。 论曰：金丹化备，神水何归。 论曰：神水为，母，真铅合胎。 胤化於金鼎之中，盗五行之数应用，日辰旋运，纲斗相随，符节催逼，其水自神，其气降真，黑铅吐精，金花涌生，俱不泄内外结为丹，此是圣人化备，还丹成质也。 此质且非与地质而同其气，圣人犹托易而明象焉。 王弼注云：居中得正，极於地质，任其自然，而物自生，不假修营，而功自成，故不习焉，而无不利者也。 论曰：何故不习而能利焉，岂不然也。 但返乾数而复坤位，是以无所习也。 旋路还乡，始明於本，何忧末乎，故不习耳。 此说并论天道常用，日月轮还，乾坤刚柔，以时消息，象数所由，盗而用之，贤贤相受，世人罕遇。 故经云：万象不能逃其数，而况於人乎，况於鬼神乎。 此律历数不能契者，自是人之味也。 圣贤之道即不然。 《阴符》曰：天性人也，人心机也。 立天之道，以定人也。 所以易天心，关造化，返五行，运八卦，定节候，分昼夜，此乃天之机，人之盗也。 得不宇宙在乎手，万物在乎身，冲天之机於人而见矣。 玄象既明，还丹成矣。 论曰：元阳子云，乾天为阳坤为母，南方朱雀北玄武。 年终岁久俱成土，时人何处寻龙虎。 土者是有质之象，德居黄位。 黄位是九九数满之义，化物已成，得土之号，是丹牙也。 谓土能克水，是消化鼎水之大义，圣意明显，水归土也。 故非地土之土也，是丹牙之初体，得白虎之号，能噙食青龙。 丹书云：龙虎相噙复相吞，立生定位此中存。 八节运移寒与温，看看渐变黄芽根。 故知黄芽属土，能消水也。 论曰：水无滞质，含气混真，精华既结，金液复凝。 丹书曰：金液大还丹者，此是也。 世人不悟，亡家失业，罔测此焉。 论曰：所言金丹者，故非金石之类为丹，借位而呼之，禀西方之色，而本素也。 《参同》曰：丹砂本素元非赤，四季排来在南宅。 绿南宅是纳阴雌、降女子之脉，脉聚而赤，阴气红泽，行血信也。 徐君云：男气白精，女气赤血。 乾道为男，坤道为女。 聚气成胎，纳阴为主。 丹至纳阴，始变其色，元非赤也。 故经云：丹砂本素元非赤。 秋石者，亦向前说白石也。 白象西方，故日秋石。 论曰：凡开启大丹，取金旺之象，白露为首，旺於酉地，此是金水气正澄，炼煎金秋月圆盛，金花满盈，是炼丹之时候也。",
      "translated_text": "「Thus, *The Paramitas of the Mysterious Concord*[《参同契》] states:\n*The lone *yang* sprout*\n*cannot stand alone.*\n*Water unites *yin* and *yang*—*\n*only then does it become the Great Medicine.*\n\n*This reveals the hidden workings of Heaven,*\n*which cannot be heard through ordinary means,*\n*a profound admonition.*\n\n*The commentary explains:*\n*Water itself is not divine,*\n*but when it aligns with the cosmic cycles,*\n*it becomes true.*\n*Hence, it is called *Divine Water*[神水].\n*This water is none other than*\n*the five phases[五行] harmonizing,*\n*the four seasons[四象] cycling,*\n*the eternal return of the Daoist furnace[陶家之输返],*\n*revolving through countless extremes,*\n*when its transformations are complete,*\n*all things have their appointed form.*\n\n*Moreover, the True Person[真人]*\n*creates and refines at the outset with purpose,*\n*and at the end with resolution.*\n*Before signs manifest,*\n*all things reveal themselves—*\n*what difficulty could there be?*\n\n*Like the sun and moon returning in their cycles,*\n*day and night perpetually alternating.*\n*Thus the world is formed,*\n*and its transformations extend infinitely to all beings.*\n*This is the beginning of understanding*\n*the measures of *yin* and *yang*,*\n*their revolving cycles,*\n*endless yet unexhausted.*\n\n*If one speaks of refining the Great Elixir[大丹],*\n*it must be done in resonance with the seasons,*\n*for its methods differ from worldly practices,*\n*and no two ages share the same laws.*\n*Divine Water is not inherently divine,*\n*but its marvels arise from the cosmic numbers.*\n\n*Furthermore, *The Book of Yin Symbols*[《阴符》] states:*\n*The arts of the Great Elixir number a hundred,*\n*but their essence lies in*\n*Divine Water and the Azure Pool[华池].*\n*Thus it is known that*\n*the Great Elixir, once obtained,*\n*transforms endlessly,*\n*constantly ascending,*\n*eternally harmonizing with Heaven and Earth.*\n\n*The commentary explains:*\n*Water’s nature is*\n*fully *yang* in form,*\n*yet capable of *yin*.*\n*Place a hundred *hu*[斛] in a cauldron,*\n*boil and dry it,*\n*and its formlessness is revealed.*\n*Yet it nourishes the vast Earth,*\n*and all things grow from it.*\n*Why then does it have form?*\n\n*This form*\n*steals the vital *qi* of Heaven and Earth,*\n*and arises from it.*\n*The classic states:*\n*\"All things in Heaven and Earth*\n*that steal the One*\n*are born by embracing *yin* and bearing *yang*.\"*\n*Thus, both Heaven’s transformations and all things’ appointed forms*\n*are fully explained,*\n*and the Great Elixir is perfected.*\n\n*The commentary explains:*\n*When the Great Elixir’s transformations are complete,*\n*where does the Divine Water return?*\n*The commentary explains:*\n*Divine Water is the Mother,*\n*True Lead[真铅] unites with it to form the embryo.*\n*Within the Golden Furnace[金鼎],*\n*it steals the numbers of the five phases,*\n*aligning with the daily celestial rotations,*\n*the stars and constellations in their proper order,*\n*the talismans and seals urging its progress,*\n*its water becomes divine,*\n*its *qi* descends as true,*\n*Black Lead emits its essence,*\n*Golden Flowers surge forth—*\n*yet none of it leaks,*\n*all coalescing into the Elixir.*\n*This is the perfected work of the Sage,*\n*the Great Elixir taking form as substance.*\n\n*This substance is not the same as Earth’s soil,*\n*yet shares its *qi*—*\n*the Sage still relies on the *Yijing*[易]*\n*to clarify the symbols.*\n\n*Wang Bi’s commentary states:*\n*\"Abiding in the center to attain correctness,*\n*reaching the limit of Earth’s soil,*\n*letting nature take its course,*\n*and things spontaneously arise,*\n*without artificial cultivation,*\n*yet the work is accomplished—*\n*thus, one does not practice it,*\n*and yet nothing is left unfulfilled.\"*\n\n*The commentary explains:*\n*Why does it not require practice yet bring benefit?*\n*Is this not a paradox?*\n*But by reversing the *yang* cycles*\n*and restoring the *yin* position,*\n*it requires no practice.*\n*Revolving through the paths,*\n*returning to its origin,*\n*it first reveals itself in its essence—*\n*what need is there to worry about its end?*\n*Thus, it requires no practice.*\n\n*This teaching further explains*\n*Heaven’s eternal principles,*\n*the sun and moon’s revolving cycles,*\n*and the interplay of *yang* and *yin*—*\n*their waxing and waning according to time,*\n*the origins of symbols and numbers,*\n*stolen and applied,*\n*transmitted among the worthy,*\n*rarely encountered by the world.*\n\n*Hence the classic states:*\n*\"The myriad forms cannot evade their numbers,*\n*how much less so humans,*\n*how much less so ghosts and spirits?\"*\n*Those who cannot align with*\n*these cosmic laws and cycles*\n*are merely the vulgar tastes of mortals.*\n*The Dao of the Sage and the Wise is not so.*\n\n*《The Book of Yin Symbols》 states:*\n*\"Heaven’s nature is human,*\n*humanity’s essence is the hidden mechanism.\"*\n*Establishing Heaven’s Dao*\n*to settle humanity’s mind.*\n*Thus, one alters Heaven’s heart,*\n*locks the transformations of the cosmos,*\n*reverses the five phases,*\n*cycles the eight trigrams,*\n*fixes the celestial nodes,*\n*and divides day and night.*\n*This is Heaven’s hidden mechanism,*\n*humanity’s theft of it.*\n*Obtaining it, the universe is within one’s grasp,*\n*and all things are within one’s body,*\n*for the mechanism of Heaven is now manifest in humanity.*\n\n*Once the profound symbols are clear,*\n*the Great Elixir is complete.*\n\n*The commentary explains:*\n*The Primordial *Yang* Child[元阳子] states,*\n*\"*Yang* Heaven is the Father,*\n*Earth *yin* is the Mother,*\n*The Vermilion Bird[朱雀] of the South,*\n*The Dark Warrior[玄武] of the North.*\n*At the year’s end and the season’s close,*\n*both become soil.*\n*Where does the common man seek*\n*Dragon and Tiger?\"*\n\n*Soil is the symbol of form,*\n*its virtue residing in the Yellow Position[黄位].*\n*The Yellow Position signifies*\n*the completion of the ninety-nine cycles,*\n*transformations fully realized,*\n*earning the name of soil,*\n*the initial stage of the Elixir.*\n\n*It is said that soil can overcome water,*\n*a great principle for*\n*consuming and refining the cauldron’s water,*\n*the Sage’s intent made clear—*\n*water returns to soil.*\n*Thus, it is not the soil of Earth,*\n*but the initial form of the Elixir,*\n*earning the name of the White Tiger,*\n*capable of swallowing the Green Dragon.*\n\n*The Elixir scriptures state:*\n*\"Dragon and Tiger*\n*alternately swallow and are swallowed,*\n*establishing the fixed position within.*\n*Through the eight celestial nodes,*\n*the cold and warm shift,*\n*gradually transforming into the root of the yellow sprout.\"*\n\n*Thus it is known that*\n*the yellow sprout belongs to soil,*\n*which can consume water.*\n\n*The commentary explains:*\n*Water has no stagnant form,*\n*it contains *qi* and blends with the true.*\n*Once the essence is refined,*\n*the Golden Elixir congeals.*\n\n*The Elixir scriptures state:*\n*\"The Golden Elixir is the Great Elixir—*\n*this is it.*\n*The world’s people fail to comprehend,*\n*losing their homes and livelihoods,*\n*unable to measure its depths.\"*\n\n*The commentary explains:*\n*The so-called Great Elixir*\n*is not a mineral of gold or stone,*\n*but borrows its name from the Western direction,*\n*its origin being the pure white.*\n*《The Paramitas of the Mysterious Concord》 states:*\n*\"Cinnabar[丹砂] is originally pure,*\n*not inherently red,*\n*yet its seasons sort it in the Southern Dwelling.\"*\n\n*The Southern Dwelling is the Green,*\n*the pulse that receives *yin* and the female,*\n*the descent of the *yin* principle.*\n*When the pulses gather,*\n*it turns red,*\n*the *yin* *qi* glowing crimson,*\n*its blood flowing with certainty.*\n\n*Xu Jun states:*\n*\"Male *qi* is white and emits essence,*\n*female *qi* is red and emits blood.\"*\n*The *yang* Dao is male,*\n*the *yin* Dao is female.*\n*Gathering *qi* forms the embryo,*\n*receiving *yin* establishes the master.*\n*Only when the Elixir receives *yin*\n*does its color change—*\n*it was never red from the start.*\n*Hence the classic states:*\n*\"Cinnabar is originally pure,*\n*not inherently red.\"*\n\n*The Autumn Stone[秋石]*\n*is also the White Stone mentioned earlier.*\n*Its symbol is in the West,*\n*thus it is called Autumn Stone.*\n\n*The commentary explains:*\n*In opening the Great Elixir,*\n*one takes the symbol of Metal’s vigor,*\n*White Dew being the first,*\n*its strength peaking at the *You* Earth[酉地].*\n*This is when*\n*Metal and Water’s *qi* are clear and settled,*\n*the Metal Autumn month is full and flourishing,*\n*the Golden Flowers abundant and overflowing—*\n*the proper time for refining the Elixir.*」",
      "overlap_context": "r*\n*is the origin of the Great Medicine,*\n*internalizing to solidify the elixir,*\n*externalizing to transform all things,*\n*uniting *yin* and *yang*—*\n*the mother of divine and immortal cultivation.’*\n\n*The *Tài Shàng*[太上] says:*\n*'Heaven obtains One to achieve clarity,*\n*Earth obtains One to achieve tranquility,*\n*and all things obtain One to generate the yellow sprout.*\n*Obtaining water alters its nature and form,*\n*transforming it into the Great Elixir,*\n*properly named the Great Medicine.\"*」",
      "start_char": 3780,
      "end_char": 4996,
      "start_sentence": 183,
      "end_sentence": 242,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 25.2370388507843,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\金丹真一论.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "魏真人曰：采有日，取有时，世人用之而不知。 况乎古仙炼药，但取金气圆明，蟾光满盛，真人共用，万一皆同无二也。 又曰：金丹得水互兆滋，隆起自虚无，从无生有。 凡运金丹，须明真一。 真一者，水也。 育丹为母，真者气也，气为道化。 化者是行气之义，直侯气足，方名为道。 行气者，二气是也。 况乎非远，目前可见矣。 包真人云：真一法朝，日在眼前。 太上曰：大道泛兮，其可左右。 万物恃之而生，生而不辞，又何远乎。 又经曰：母藏子胞，子隐母胎，知白守黑，神明自来。 白者，西方金也，金者便是母也。 黑者，北方水也，水者便是子也。 知有西方金也。 丹首起北方壬癸，壬癸是水也。 经云：金胤於水但安水，叉存其丹，斯言黑白二义明矣。 故丹书云：知白守黑，求死不得，此之谓也。 青霞君云：水为凝而纳火，金消散而入水，水火之气相蒸，金形相转，往而不定，上下无常。 水得火而升，金得水而潜，相须变化，凝结气中，又何朱砂潜火，水银结霜。 丹书云：画镜照胆，登山网鱼，何日获之。 夫炼丹炼神水，有水始生牙，火釜烧金药，金药是三花。 金虎元君云：炼三花但去其玄色，色归西方之色正白。 经云：洁白见宝，可造金花矣。 此花入鼎，须凭刻漏，始分清浊。 如无漏刻，灵芽不生，三花入鼎。 歌曰：入鼎须凭漏，无漏不成丹。 如盲奔却杖，聋者抱琴弹。 大丹无漏，如盲者奔杖，无以能进。 虽加喊水火，奈时候不正，默而·不分，又何定气升降，如聋者弹琴，自不能分别也。 论曰：漏者便是此日直符，使者符到奉行，算阴阳水火正数，一进一退，定其斤两，合日辰，应运金·鼎，先定天地时而后行事，顺天地也。 《阴符经》曰：阴阳相推，而变化顺矣。 论曰：且如此日阳时将至，漏已来报，即称太阳应数，累功成乾。 其或阴时将至，漏已来报，即称太阴应数，累功成坤。 如是乾坤俱备，阴阳两全，夺天地造化之功，盗四时生成之务，鼎中灵药，万一成真，红液流珠，天人共爱。 论曰：已前分漏，时在运火，牙必成矣。 时在运丹，丹必成矣。 并同兹法天象成形。 又《紫阳金碧经》云：还丹之道，与九鼎法同，神水化功，更相运入斯。 乃前九鼎炼牙，后九鼎炼丹，故日还丹之道，与九鼎法同。 《周易参同》曰：漏刻未过半，鱼鳞狎猎起。 如是明分刻，漏显配五行。 昼夜玄功，应运符节。 经云：符节者，是分管此日十二时之候也。 昼夜应运，曾无暂停，至道神功，准漏消息，阴阳变化，恍惚而迁，水被火逼，时不相容。 故元君曰：恍惚变化，在於当时。 《参同》曰：隆冬大暑，盛夏霜雪，二分纵横，不依漏刻。 此是《参同》圣意，微密之妙旨也。 诀曰：若运丹升降之次，辄勿暂抛药炉，听察吟声，调燮火候，进火稍麓，前功恐失。 失者，是火数与时不相应也。 春木未满，夏火已行，夏暑炎炎，却行冬令，此是掌炉之人懈怠之过也。 是何灰暗日久，火养岁年，颗块朱砂，犹言未伏。 论曰：且如金液之丹，是金华之气凝结而成，人得服之，流胤百脉，驻颜返老，行疾如风，万灾莫及，龙神仰敬，土地护持，服之岁月，别有异常之事。 服药三年，别有真圣灵异之事。 更资阴隐，直候上升。",
      "translated_text": "Wei Zhenren said:\n*\"The timing of gathering is fixed,\nthe season of taking is precise—\nyet the world uses it without knowing.*\n\n*How much more so the ancient immortals refining elixirs,\nwho merely await the Metal *qi*’s round brilliance,\nthe toad’s light at its fullest—\nall true persons share this,\nand even a tenth of it is unmatched.*\n\n*Again it is said:*\n*The Elixir obtains Water’s mutual nourishment,\nrising from emptiness to fullness,\nfrom non-being to being.*\n\n*In refining the Elixir,\none must grasp the True Unity.*\n*The True Unity is Water.*\n*Water nurtures the Elixir as a mother;\nTrue refers to *qi*—\n*qi* is the transformation of the Dao.*\n*Transformation means the movement of *qi*;\nonly when *qi* is sufficient does it become the Dao.*\n*The movement of *qi* is the interplay of the two *qi*’s.*\n*How much closer it is—\nvisible before one’s eyes.*\n\n*Bao Zhenren said:*\n*The True Unity method is ever-present,\nthe sun before one’s gaze.*\n\n*The Most High said:*\n*The Great Dao is vast—\nhow could it be confined to left or right?*\n*All things rely on it to live,\nliving without complaint—\nhow could it be distant?*\n\n*The classic further states:*\n*The mother contains the child’s womb,\nthe child hides within the mother’s body.\nKnowing White while guarding Black,\ndivine clarity comes naturally.*\n*White is the West’s Metal—\nMetal is the mother.*\n*Black is the North’s Water—\nWater is the child.*\n*Knowing the West’s Metal,*\n*the Elixir first arises from the North’s *Ren* and *Gui* (Water’s stems),*\n*for *Ren* and *Gui* are Water.*\n*The classic says:*\n*‘Metal depends on Water—\nonly by settling Water\ndoes one preserve the Elixir.’*\n*Thus the dual meaning of Black and White is clear.*\n\n*Hence the Elixir scripture states:*\n*‘Know White, guard Black—\nseek death and you shall not find it.’*\n\n*Qingxia Jun said:*\n*Water condenses to receive Fire,\nMetal disperses and enters Water.\nWhen Water and Fire *qi* intermingle,\nMetal’s form transforms—\nunsettled, without fixed direction,\nneither high nor low remains constant.*\n*Water obtains Fire and ascends,\nMetal obtains Water and descends;\nmutually dependent in transformation,\ncongealing within *qi*—\nhow could it be like cinnabar hiding Fire,\nmercury forming frost?*\n\n*The Elixir scripture says:*\n*‘Mirror-drawing to catch the gall,\nmountain-climbing to net fish—\nwhen shall this be achieved?’*\n\n*Refining the Elixir and the Spirit Water,\nonly with Water does the tooth form;\nthe Fire cauldron sears the Golden Medicine—\nthe Golden Medicine is the Three Flowers.*\n\n*Jin Hu Yuanjun said:*\n*Refining the Three Flowers merely removes their primordial hue,\nrestoring them to the West’s true color—pure white.*\n*The classic says:*\n*‘When pure white appears, the Golden Flower may be forged.’*\n*This Flower, once placed in the crucible,\nmust rely on the water clock’s division\nbefore purity and turbidity are separated.*\n*Without the water clock,\nno divine sprout will grow;\nthe Three Flowers enter the crucible.*\n*The verse says:*\n*‘Entry depends on the clock’s measure—\nwithout it, the Elixir fails.’*\n*Like the blind rushing without a staff,\nthe deaf strumming a zither—\nthe Great Elixir without the clock\nis like the blind stumbling without guidance,\nunable to proceed.*\n*Though one shouts for Water and Fire,\nthe moment is ill-timed—\nsilent and unseparated,\nhow could the *qi*’s ascent and descent be fixed?\nLike the deaf playing the zither,\nthey cannot distinguish at all.*\n\n*The commentary says:*\n*The clock is the day’s direct talisman;\nwhen the messenger’s talisman arrives,\ncalculate the true numbers of yin and yang,\nWater and Fire’s advance and retreat,\ndetermine their weight,\nalign with the hour and stem-branch,\nrespond to the crucible’s *qi*—\nfirst fix the timing of Heaven and Earth,\nthen act in accordance.*\n\n*The *Yinfu Classic* says:*\n*‘Yin and yang push each other,\nand transformation proceeds in harmony.’*\n\n*The commentary says:*\n*If the solar hour is near and the clock reports it,\ndeclare ‘The Great Sun’s number is fulfilled,\naccumulating merit to complete *Qian*.’*\n*If the lunar hour is near and the clock reports it,\ndeclare ‘The Great Yin’s number is fulfilled,\naccumulating merit to complete *Kun*.’*\n*Thus when *Qian* and *Kun* are both complete,\nyin and yang fully harmonized,\nyou seize Heaven and Earth’s creative power,\nplunder the four seasons’ generative duties—\nthe crucible’s divine medicine,\nonce perfected, yields crimson nectar,\nloved by both Heaven and humanity.*\n\n*The commentary says:*\n*Before the clock’s division,\nif the time is for refining the tooth,\nthe tooth will surely form.*\n*If the time is for refining the Elixir,\nthe Elixir will surely form.*\n*All follow this method to manifest the Heavenly symbol.*\n\n*The *Ziyang Jinbi Classic* says:*\n*The Dao of Returning the Elixir\nis the same as the Nine Crucible method;\nSpirit Water’s function\nis further refined through mutual circulation.*\n*First, the Nine Crucibles refine the tooth,\nthen the Nine Crucibles refine the Elixir—\nhence it is said the Dao of Returning the Elixir\nis the same as the Nine Crucible method.*\n\n*The *Zhouyi Parameters* say:*\n*Before the water clock’s half-mark passes,\nscaly fish dart and scatter.*\n*Thus, when the clock’s division is clear,\nits markings align with the Five Phases.*\n*Day and night’s mysterious operations\nrespond to the talisman’s nodes.*\n*The classic says:*\n*The nodes are the divisions of the twelve daily hours.*\n*Day and night proceed without pause,\nthe supreme Dao’s divine function\nadjusts to the clock’s ebb and flow.*\n*Yin and yang transform—\nfleeting yet shifting.*\n*Water pressed by Fire\ncannot endure the moment’s constraint.*\n\n*Hence Yuanjun says:*\n*‘Fleeting transformation\nlies in that very instant.’*\n\n*The *Parameters* say:*\n*‘In deep winter’s scorching heat,\nsummer’s frost and snow,\nthe solstices’ horizontal sweep\ndefies the clock’s measure.’*\n*This is the *Parameters*’ sacred intent,\nits profound and subtle meaning.*\n\n*The secret says:*\n*When refining the Elixir’s ascent and descent,\nnever abandon the furnace for an instant.\nListen for the *qi*’s murmurs,\nadjust the Fire’s temper—\ngradually increase the heat;\notherwise, prior efforts may be lost.*\n*Loss comes when Fire’s measure fails to align with the time.*\n*Spring Wood not yet full,\nSummer Fire already active—\nSummer’s blazing heat\nyet enforcing Winter’s order—\nthis is the fault of the furnace-tender’s negligence.*\n*Why then does the ash darken over years,\nFire nurtured for seasons,\nwhile cinnabar’s grains\nstill claim not to be subdued?*\n\n*The commentary says:*\n*As for the Golden Liquid Elixir,\nit is the condensed *qi* of the Golden Flower’s essence.\nWhen a person ingests it,\nit flows through the hundred channels,\npreserving youth and reversing aging,\nmoving swiftly as wind,\nimmune to all calamities—\ndragons and spirits revere it,\nEarth and spirits protect it.\nThose who take it for years\nexperience extraordinary events.*\n*After three years of ingestion,\ntruly divine and miraculous events occur.*\n*Further relying on yin’s concealment,\nawaiting its supreme ascent.\"*",
      "overlap_context": "n Stone[秋石]*\n*is also the White Stone mentioned earlier.*\n*Its symbol is in the West,*\n*thus it is called Autumn Stone.*\n\n*The commentary explains:*\n*In opening the Great Elixir,*\n*one takes the symbol of Metal’s vigor,*\n*White Dew being the first,*\n*its strength peaking at the *You* Earth[酉地].*\n*This is when*\n*Metal and Water’s *qi* are clear and settled,*\n*the Metal Autumn month is full and flourishing,*\n*the Golden Flowers abundant and overflowing—*\n*the proper time for refining the Elixir.*」",
      "start_char": 4996,
      "end_char": 6247,
      "start_sentence": 243,
      "end_sentence": 298,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 26.306344270706177,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\金丹真一论.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "此是九转金液，凝结化为还丹。 岂是朱砂作粉，水银为霜，恨之甚矣。 是谓学不稽古，暗详经论，以意自裁，背道返德，万家倾产，一无可成，实为世愚，孰能开悟。 而况前贤后圣，大丹理贯一源，故无二三，尽明真一，妙算五行，钻簇阴阳，潜运寒暑，仁贤相授，广业经纶，知铅汞之根源，定水火之大数，如斯明白，始可经营矣。 诀曰：且如脉同一身，漏行百刻，时随漏应，准刻定时，漏既不得，丹随时变。 此一法众仙共禁之诀，荃蹄之义，息忘经纶，途远妙极之理，神明丹中要义，无过此诀矣。 《太易》曰：一日有十二时，阳六时，阴六时，便是时计之数也。 转运轮还，时内消息，又如何顽心度日，弊意弥年，一向灰暗，将延岁月，故堪取笑，实谓痛哉。 可惜光阴散亡，学仙之士，请细详焉。 且如定气分节，大凡五日一候，计六十时，禽类胎卵，应节变迁。 书云：后五日，雀入水化为蛤。 后五日，野鹦入水化为蜃。 后五日，鹰化为鸠。 后五日，田鼠化为驾。 制不自由，时至化也。 理丹玄象，运化亦同。 后五日，神水冰丹形变，斯乃天时共造，律历同迁神化也。 诸圣玄意，丹家多议，此一科也。 又圣意一科，且如今日直符，开启运丹，复卦为首，起火子位，发爻通灵，而终於已，纯阳也。 妮者，纳音之首，收摄元气，而终於亥，纯阴也。 此日行火大数，理乾坤二卦，变一十二爻，计一十二时，时数之内，有阴有阳，有明有暗，有动有静，有进有退，升降随时，周而一匝，鼎中灵药，随卦变通，五色流光，天人共贺。 此诀外镌金简，内宝存心，凡传於人，贤圣相授，斋修重誓，莫妄轻泄。 乃元始玄言，毕法金科，勿违师诚。 茅君诚文曰：天门开，地户闭，圣人机密，勿妄漏泄。 妄泄真诀，殃及绝灭。 岂非容易哉。 又云：得者不泄，泄者丧德。 付之以言，诫守玄默。 论曰：若得药源，万一成矣。 必利众生，且非一人。 此药得成，有全家拔宅之功，非独一人升举也。 且见今人炼药，虽有其言，而无其实。 朝朝说道，日日言丹，究论真诠，罔知圣意。 如斯暗昧，自尚未能，孰为利众，而全家升举者哉。 经云：若昧药源，一身难存。 若明神水，全家归真。 神水圣石，一龙一虎，二物知宗，神仙之倡，此之谓也。 论曰：得者日学日新， 但得药源，经营有神，一月一合，开鼎沐浴，观其颜色，渐睹幽深，鼎鼎见信，转为玄功，其道日新，可见重矣。 迷者日学日昏。 迷者错认朱砂水银，便为大药，千烧万缎，如末如灰，罔合经纶，无由取信。 既差玄旨，转益昏迷，皓首如丝，何以开悟。 其道转加，日昏迷之甚矣。 推道守一， 推道纪钢，妙在守一。",
      "translated_text": "This is the Ninefold Transformation of Golden Liquid,\ncondensed and refined into Returning Elixir.\nHow could it be mere cinnabar turned to powder,\nmercury as frost?\nThis regret is profound indeed.\n\nThis is called studying without examining antiquity,\nobscurely expounding scriptures and commentaries,\ncutting according to one’s own whims,\nabandoning the Dao and inverting virtue.\nFamilies squander their wealth,\nyet achieve nothing—\ntruly the fools of the world,\nwho can awaken them?\n\nYet the sages of old and the saints of later times,\ntheir profound elixir principles flow from a single source,\nso there is no second or third.\nThey fully illuminate the True Unity,\nmaster the marvelous calculations of the Five Phases,\ndelve into the interplay of yin and yang,\ngovern the circulation of cold and heat,\npassing down knowledge from benevolent and virtuous ones.\nThey broaden their practices and refine their wisdom,\nknowing the roots of lead and mercury,\nfixing the great numbers of water and fire—\nso clear and evident,\nonly then can one undertake their work.\n\nThe secret formula says:\n*Just as the pulse is one within the body,\nyet the hundred pores leak in a thousand moments,\ntime follows the pores’ flow,\nand the moments measure time.\nIf the pores cannot be controlled,\nthe elixir changes with each moment.*\n\nThis is a universal formula forbidden by all immortals,\na profound meaning of the *Qiánshān* [1] tradition.\nTo forget the scriptures and commentaries,\nto stray far from the subtle and extreme principles—\nthis is the essence of the elixir’s divine truth,\nnone surpass this formula.\n\n*The Great Ease* [2] says:\n*A day has twelve times—\nsix of yang, six of yin—\nthis is the reckoning of time.*\n\nThe revolving cycles return,\nconcealment and manifestation occur within time.\nHow could a dull heart measure days,\nor a flawed intention span years,\never lingering in darkness,\nwasting time in vain?\nThis is truly lamentable—\na pity to squander light and time.\nAspiring immortals,\nplease examine this carefully.\n\nJust as the *qi* is divided by nodes,\nthe general rule is five days for one phase,\ncounting sixty times [3].\nBirds and beasts, their eggs and births,\nchange according to the nodes.\nThe text says:\n*After five days, a sparrow entering water becomes a clam.*\n*After five days, a wild parrot entering water becomes a jellyfish.*\n*After five days, an eagle transforms into a dove.*\n*After five days, a field mouse becomes a tortoise.*\nTransformation is not free to command—\nwhen the time arrives, change occurs.\nThe principles of elixir and profound symbols\nare the same in their transformations.\n*After five days, the Divine Water’s form alters like ice and elixir—*\nthis is the heavens’ shared work,\nthe laws of time and transformation aligning with divine change.\n\nThe profound intentions of the saints,\nthe elixir schools’ many debates—\nthis is one such principle.\n\nAnother principle of the saints:\n*As today’s direct correspondence,\nunlocking the elixir’s transformation,\nthe Hexagram of Reunion is paramount,\nigniting the Fire Branch,\nawakening the trigrams to divine resonance,\nyet ending at the Geng [4] stem—\npure yang.*\n\n*Nǐ* [5] is the first of the received sounds,\ngathering and containing the primordial *qi*,\nyet ending at the Hài [6] stem—\npure yin.\n\nToday’s Fire Branch governs the numbers,\nharmonizing the Hexagrams of Heaven and Earth,\nshifting twelve lines [7],\ncounting twelve times.\nWithin these times,\nthere is yin and yang,\nlight and dark,\nmovement and stillness,\nadvance and retreat—\nascend and descend with each moment,\ncycling in full return.\nThe alchemical cauldron’s sacred medicine\nadapts to the hexagram’s changes,\nfive colors radiant in flowing light—\nheaven and humans rejoice together.\n\nThis formula is engraved on golden tablets externally,\nyet treasured within the heart internally.\nWhen passed to others,\nsaints and virtuous ones transmit it solemnly,\nwith fasting, purification, and solemn oaths,\nnever to be casually revealed.\n\nIt is the Primordial Beginning’s mysterious speech,\nthe ultimate golden principle—\ndo not betray the teacher’s sincerity.\n\nThe Lord of the Tea [8] earnestly wrote:\n*The Celestial Gate opens,\nthe Earthly Portal closes—\nthe saint’s secrets must not be divulged.*\n*To recklessly reveal the true formula,*\n*disaster will follow, leading to extinction.*\n*Is this not easy to understand?*\n\nIt is also said:\n*Those who receive it do not disclose it,\nthose who disclose it lose their virtue.*\n*Pass it on with words,*\n*yet warn to guard the profound silence.*\n\nThe commentary says:\n*If one obtains the medicine’s source,*\n*success is certain.*\n*It must benefit all beings,*\n*not just one.*\n\nWhen this medicine is perfected,\nit grants the power to elevate an entire household,\nnot just one person.\nYet see today’s practitioners refining elixirs—\nthough they speak of it,\nthey lack the true substance.\nDaily they speak of the Dao,\ndaily they discuss the elixir,\nyet when examining the genuine meaning,\nthey know not the saints’ intentions.\nSo obscured, they cannot even achieve their own goals—\nwho then can benefit all and elevate a household?\n\nThe scripture says:\n*If one remains ignorant of the medicine’s source,*\n*even one’s own life cannot be preserved.*\n*If one understands the Divine Water,*\n*the whole family returns to the True.*\n\nThe Divine Water and sacred stone—\none dragon, one tiger,\ntwo substances knowing their essence—\nthe foundation of immortality,\nthis is what is meant.\n\nThe commentary says:\n*Those who receive it grow wiser each day,\nyet only upon obtaining the medicine’s source\ncan cultivation be truly inspired.\nOnce a month, the elixir coalesces,\nthe cauldron is opened for bathing,\nobserving its hues,\ngradually perceiving the depths.\nEach cauldron’s transformation confirms its truth,\nbecoming profound function—\nits Dao renews daily,\nits importance is evident.*\n\n*Those who are lost grow more confused each day.*\n*Lost ones mistake cinnabar and mercury*\n*for the great medicine,*\n*boiling and refining them endlessly,*\n*turning them to dust or ash,*\n*never aligning with the principles,*\n*with no way to confirm its truth.*\n*Having strayed from the profound intent,*\n*their confusion only deepens,*\n*their heads white as thread—*\n*how can they awaken?*\n*Their Dao grows ever more distorted,*\n*their confusion ever more profound.*\n\n*Follow the Dao and uphold the One,*\n*Follow the Dao and remember lead,*\n*The marvel lies in upholding the One.*",
      "overlap_context": "Golden Liquid Elixir,\nit is the condensed *qi* of the Golden Flower’s essence.\nWhen a person ingests it,\nit flows through the hundred channels,\npreserving youth and reversing aging,\nmoving swiftly as wind,\nimmune to all calamities—\ndragons and spirits revere it,\nEarth and spirits protect it.\nThose who take it for years\nexperience extraordinary events.*\n*After three years of ingestion,\ntruly divine and miraculous events occur.*\n*Further relying on yin’s concealment,\nawaiting its supreme ascent.\"*",
      "start_char": 6247,
      "end_char": 7293,
      "start_sentence": 299,
      "end_sentence": 343,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 18.224509477615356,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\金丹真一论.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "起甲钻算，春令发扬。 经云：三五之道，天地常用，以时消息，巡历后土，归於中官，其数见五。 三五与一，天地至精，可付口诀，难以书传。 大丹之要，非数莫能知其神。 神水华池，非真铅不能合其道。 若明守一，已知大道纲纪，无不尽者也。 皇天无亲。 上天普育万物，爱人最深，玄象天机，与人相合，道成德就，玉皇可见，惟道可亲，昭于上帝也。 我命在我， 非天制我有其生，非天纵我亡其寿。 三才永固，各保元精，惟人摄养多乖，不悟营修大药，上天明鉴，法象昭然，大道经管，丹书遍载，自无志学，负己辜身，弃命如泥，却为鬼物。 且积修而难得者，莫贵於我身。 因循而易失者，不闻於仙道也。 况且真铅不远，百姓日用而不知。 大药非遥，满市黄芽而莫测。 几夫不学上士难传，而况常人有言，大命由乎天也。 如斯不悟，何以闻之。 若言命既由天，子之服毒，何政死乎。 历观今古得道者，千万余人，始自常夫从学，安得玉皇垂诏，白日冲天。 故知求生者，叉遂其生，昧死者，任从其死。 升沈得失，未可言天，我命在我者也。 非丹不存。 尘病下士，恣欲饮酒，腥膻血肉，沈滞五脏六腑，秽气蒸熏，身重百斤，何以轻举。 若非金丹妙药，无以涤荡，神药一化，返老为童，位列真人，名标玉籍，与天地齐休，若非金丹，不可存也。 炼之可久， 运造神室之丹，且非一朝一夕之功。 几九转成牙，九转成丹，开启造化，须处名山，同道数人，晨昏资备，药室坛炉，穿砌井宠，二时朝拜，斋粥资修，志念归真，神明如一，实非容易，岁久方成，故日炼之可久也。 饵之长新， 服药之后，三尸之虫渐去，还精补髓都全，暗室有光，童颜日盛，精神爽异，道气吉祥，五岳灵真，自然而会，神魂彻视，玉髓全身，趣戏仙都，故曰长新也。 数通即化， 圣人炼化灵药，大数运通四时，春季发而万物生，夏季旺而火炎盛，秋季收而金实，冬季伏而水凝，丹家制造，但得通此四时行气，金丹自然变化，故日数通则化也。 数极乃神， 言数之极满也。 但论阴阳数满，药方乃神。 阴极则阳潜，阳极则阴屈，二气互用，道之自然。 又言极者，是穷变之道尽矣。 乃得阴阳之道，极数者也。 是神仙之妙，变化之法，故日数极乃神。 获斯天机， 天下能事者，不过得道。 得道简易，莫出於丹。 治丹之妙，擒制於气。 化气有形，不过於数。 数造金丹，三五与一，获此天机，神仙事毕也。 永列真人。 世有数千玄卫，继约万端，若言永列真人。 一粒还丹，升举霄汉。 金丹真一论竟",
      "translated_text": "The skin is pierced for calculation,\nspring commands its flourishing.\n\nThe scriptures say:\nThe Dao of *three-five* is ever-present in heaven and earth,\nused to measure time and regulate the flow of *qi* through the land,\nreturning to the *Zhongguan* [central official],\nits numbers manifest in five.\n*Three-five* and *One* are the utmost essence of heaven and earth,\nwhich may be entrusted to oral precepts,\nyet is difficult to record in writing.\n\nThe essence of the Great Elixir lies beyond mere numbers,\nwithout which its spirit cannot be known.\nDivine *qi* and the Alchemical Pool cannot be united\nwithout the true lead.\n\nIf one understands and upholds the *One*,\nalready knowing the fundamental principles of the Great Dao,\nnothing remains unfulfilled.\n\nThe Celestial Sovereign has no favorites.\nThe Highest Heaven nurtures all things universally,\nits love for humanity most profound,\nits mysterious symbols and heavenly mechanisms\nin harmony with humanity—\nwhen the Dao is realized, virtue attained,\nthe Jade Emperor becomes manifest,\nyet only the Dao can be truly cherished,\nas revealed to the Supreme Deity.\n\nMy life is in my own hands,\nnot decreed by Heaven to live or die.\nIt does not grant my birth nor decree my death.\nThe Three Realms endure eternally,\neach preserving its original essence,\nyet only humanity often fails to cultivate itself,\nunaware of refining the Great Elixir.\nThe Highest Heaven’s clear discernment,\nthe radiant patterns of the law,\nthe Great Dao’s precepts and sacred writings\nare everywhere—\nyet those without aspiration to learn\nbetray themselves,\nforfeit their lives like mud,\nand become mere specters.\n\nMoreover, what is difficult to accumulate through cultivation\nis no greater than my own body.\nWhat is easily lost through negligence\nis not heard of in the Dao of Immortals.\nYet true lead is not distant—\ncommon folk use it daily without knowing.\nThe Great Elixir is not far—\nyellow sprouts fill the markets yet none perceive it.\nEven the *jifu* [lowly scholar] struggle to learn,\nwhile the *shangshi* [exalted sage] cannot easily transmit.\nHow much more so for ordinary people who say,\n\"Great fate lies with Heaven!\"\n\nIf one does not awaken to this,\nhow can they ever hear the truth?\nIf one claims fate is by Heaven’s decree,\nthen why does a child’s ingestion of poison\nnot inevitably lead to death?\nExamining past and present who attained the Dao—\nthousands, even millions—\nthey began as common folk in study,\nhow could the Jade Emperor descend with edicts,\nor the sun ascend to the heavens in broad daylight?\nThus, those who seek life\nfind their life fulfilled,\nthose who remain ignorant of death\nsuffer it as their due.\nAscension and decline, gain and loss,\ncannot be spoken of as Heaven’s doing—\nfor my life is in my own hands.\n\nWithout the Elixir, life cannot persist.\nThe *chénbìng* [dust-illness] afflicts the lowly,\nwho indulge in meat and alcohol,\ngreasy and blood-rich, clogging the five *zàng* [viscera] and six *fǔ* [bowels].\nFilth and *qi* seethe,\nweighting the body like a hundred pounds—\nhow could it rise lightly?\nIf not for the Golden Elixir’s marvelous medicine,\nthere is no way to purify and transform.\nWith one dose of divine medicine,\naging reverses to youth,\nranking among the True Persons,\nname inscribed in the Jade Register,\nsharing eternal life with Heaven and Earth—\nwithout the Golden Elixir,\nlife cannot be preserved.\n\nCultivation requires enduring time,\nrefining the Elixir in the sacred chamber of *qi*.\nIt is not the work of a single morning or evening.\nNine transformations yield *yá* [alchemical tooth],\nnine more yield the Elixir,\nunlocking the principles of creation,\nrequiring secluded peaks,\na few like-minded companions,\nmorning and evening devotion,\nthe Alchemical Hall and furnace,\nwell-laid bricks and tiles,\ntwice-daily reverence,\nfasting gruel for sustenance,\nfocused intent to return to the True,\nunified spirit and clarity—\ntruly not easy,\nyears of effort alone suffice,\nhence it is said,\n\"Cultivation requires enduring time.\"\n\nNourishment grants eternal renewal,\nafter taking the medicine,\nthe *Three Corpses* [三尸虫] gradually depart,\nrefined essence returns to the marrow,\ncomplete restoration—\ndarkness becomes light,\nyouthful visage flourishes,\nspirit sharpens and transcends,\nDao-*qi* brings auspiciousness,\nthe Five Sacred Peaks’ numinous truths\ngather naturally,\nsoul and spirit pierce all,\nthe entire body like jade,\njoining the playful ranks of the Immortals—\nhence it is said,\n\"Nourishment grants eternal renewal.\"\n\nNumbers in harmony bring transformation,\nthe Sage refines the spirit-medicine,\nadjusting the numbers to govern the four seasons:\nspring unfolds and all things grow,\nsummer thrives with blazing fire,\nautumn gathers and gold ripens,\nwinter rests with water congealing.\nAlchemists’ craft lies in attuning to these seasonal *qi* flows—\nif one masters the four seasons’ breath,\nthe Golden Elixir naturally evolves,\nhence it is said,\n\"Numbers in harmony bring transformation.\"\n\nNumbers at their utmost become spirit,\nspeaking of the numbers’ completion.\nOnly when *yin-yang* numbers are fulfilled\ndoes the elixir’s formula become divine.\n*Yin* at its extreme yields hidden *yang*,\n*Yang* at its extreme yields suppressed *yin*,\nthe two *qi* mutually interact,\nthe natural way of the Dao.\nAgain, the \"extreme\" refers to\nthe exhaustion of all possible transformations,\nthus attaining the Dao of *yin-yang*—\nthe ultimate in numbers.\nThis is the subtlety of Immortals,\nthe law of transformation,\nhence it is said,\n\"Numbers at their utmost become spirit.\"\n\nGrasping this celestial mechanism,\nthe world’s accomplished deeds\nare nothing more than attaining the Dao.\nThe Dao’s attainment is simple—\nnone surpasses the Elixir.\nThe Elixir’s refinement lies in controlling *qi*,\ntransforming *qi* into form,\nnone beyond the mastery of numbers.\nNumbers forge the Golden Elixir,\n*three-five* and *One* united—\ngrasping this celestial mechanism,\nthe affairs of Immortals are complete.\nEternally ranked among the True Persons.\n\nThe *jindan zhenyi lun* [True One Golden Elixir Scripture] is now concluded.",
      "overlap_context": "d mercury*\n*for the great medicine,*\n*boiling and refining them endlessly,*\n*turning them to dust or ash,*\n*never aligning with the principles,*\n*with no way to confirm its truth.*\n*Having strayed from the profound intent,*\n*their confusion only deepens,*\n*their heads white as thread—*\n*how can they awaken?*\n*Their Dao grows ever more distorted,*\n*their confusion ever more profound.*\n\n*Follow the Dao and uphold the One,*\n*Follow the Dao and remember lead,*\n*The marvel lies in upholding the One.*",
      "start_char": 7293,
      "end_char": 8306,
      "start_sentence": 344,
      "end_sentence": 391,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 17.420045852661133,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\金丹真一论.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}