{
  "source_id": "金木万灵论",
  "source_file": "chunked_daozang\\金木万灵论.json",
  "total_chunks": 2,
  "total_original_chars": 1579,
  "total_translated_chars": 10492,
  "total_translation_time": 35.64143419265747,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\众术类\\金木万灵论.txt",
    "category": "众术类"
  },
  "full_translation": "**The Treatise on the Golden-Wood Elixir of Ten Thousand Spirits**\n\nTitle: *The Treatise on the Golden-Wood Elixir of Ten Thousand Spirits*.\nOriginally attributed to Ge Yachuan (Ge Hong), but likely a forgery by a Tang or Song scholar. Compiled from excerpts of *Bao Pu Zi: The Golden Elixir Chapter* and *Tai Qing Yu Zhen Zi*. One scroll.\nSource: *The Daoist Canon of the Zhengtong Dao* (正统道藏), in the *Divine Mysteries Section* (洞神部), under *Miscellaneous Alchemical Treatises* (众术类).\n\n**The Treatise on the Golden-Wood Elixir of Ten Thousand Spirits**\nComposed by Ge Zhi (Ge Hong)\n\nIn my study of books on longevity, I have gathered methods for prolonged life, and among the thousands of scrolls I have perused, none fail to regard the return of the Golden Elixir (还丹) and Golden-Wood Elixir (金液) as the ultimate essence.\n\nYet these two matters are indeed the refined secrets of the mid-grade and exalted Daoists. If one takes them and does not attain transcendence (仙), then they are the methods of the ancient Primordial Immortals (古元仙). In times past, when China was in chaos, I fled to distant lands. Within the hundreds of states of Yu (豫), Jing (荆), Guang (广), and Jiang (江) and Xiang (襄), I observed countless vulgar Daoists—nearly a hundred in number.\n\nSome had merely heard their names, while others were said to dwell in the clouds beyond the world. Yet all were alike in their superficiality. Each claimed to possess several scrolls of Daoist scriptures, but none truly understood them—only the wealthy few who hoarded them.\n\nAt that time, there were those who practiced *qi*-cultivation (行气) and fasting (断谷), who relied on various herbal medicines, though their methods were but crudely aligned with the Dao. Few indeed were those who achieved anything.\n\nThey spoke of Daoist techniques and precepts, claiming these were the supreme secrets, and that they were created by Yin Xi (尹喜). I told them: \"These were written by Wang Tu (王图), a military supervisor of the Wei dynasty (魏世), not by an ancient sage. Wang Tu understood nothing of the profound alchemy (大药之妙), seeking only to cultivate *qi* in seclusion (入室求仙) and proclaiming that the Dao was complete within these methods. His ignorance was truly extreme.\"\n\nWhen I questioned these Daoists about the secrets of the Divine Elixir (神丹) and Golden-Wood Elixir (金液), the precepts of the Three Saints (三圣), and the laws of the Heavenly and Earthly deities (神祇), few had genuine knowledge. Half of them boasted of exaggerated longevity or claimed to have once consorted with Immortals (仙人), yet those who truly grasped the essence were rare.\n\nSome had heard of the Golden Elixir (金丹) but did not practice its true alchemical refinement (金作), yet they declared that Immortals of old must have known it. Others said, \"This matter is lost,\" or, \"We have not obtained the true scriptures (真经).\" Some possessed only scraps of miscellaneous prescriptions for prolonging life and curing illness (赞道救病杂丹碎方), yet they boasted that all elixir methods were contained therein.\n\nIn ancient times, Zuo Yuanfang (左元放) meditated deeply in the Tianzhu Mountains (天柱山), and a divine man (神人) bestowed upon him the *Golden Elixir Immortal Scripture* (金丹仙经). When the great upheaval of the late Han dynasty (汉末大乱) arose, he did not have time to refine and ingest it, and instead crossed the Yangtze River (渡江) to seek refuge in the counties (郡). Later, he returned to Tian Mountain (潜山) to cultivate the Dao.\n\nMy paternal uncle, Xian Fang (仙舫), also received from Zuo Yuanfang the *Tai Qing Dan Jing* (太清丹经) in three scrolls, the *Nine Cauldrons Scripture* (九鼎经) in one scroll, and the *Golden-Wood Elixir Scripture* (金液经) in one scroll. I was taught by Zheng Jun (郑君), who was a disciple of my uncle. My uncle passed these teachings to Zheng Jun, who then taught me. Hence, I am among those who truly comprehend the Dao.\n\nYet twenty years have passed since I received these teachings, and though I have accumulated resources (资) and labored endlessly (担石), I have not yet been able to fully practice them. My storehouses overflow with gold, and my wealth is piled like mountains, yet I still do not believe in this elixir of immortality (不死之药). Even if I did hear of it, I would not trust it.\n\nTo drink the residue of jade elixir (啜玉粕) is to discard the subtle essence of its refined nectar (浆蒋之薄味). To gaze upon Kunlun Mountain (昆仑) is to overlook the lofty mysteries beneath its humble slopes (丘墟之下卑). Once I have studied the Dao of the Golden Elixir (金丹之道), I no longer regard petty alchemical scrolls as worthy of attention. Yet if one cannot immediately attain the means to practice it, one must swear to cultivate virtue (积德) and perseverance.\n\nEven small progress (小益) is insufficient to achieve true longevity (长生). Thus, the *Laozi’s Precepts* (老君诀) say: \"Without attaining the return of the Golden Elixir (还丹) and Golden-Wood Elixir (金液), one only torments oneself in vain (徒自苦耳).\"\n\nThe Five Grains (五谷) can sustain life—if one consumes them, one lives; if one abstains, one dies. Yet the Divine Elixir (神丹) of the mid-grade and exalted Immortals (中品上仙) is a spiritual medicine (神药) that far surpasses the Five Grains in efficacy (岂不益人乎，岂不万亿於五谷邪). The Golden Elixir (神丹) is truly miraculous (灵), and its effects are beyond compare (逾妙). These two elixirs refine the body’s essence (炼体质), ensuring that one does not perish. Are they not akin to the vital essence of food (食物之精), strengthening the body from within, like fat that does not extinguish fire (脂不灭火)?\n\nMoreover, when copper verdigris (铜青) is applied to the feet, one does not rot in water—this is because it borrows copper’s power to temper the flesh (焊其肉). The Golden Elixir (金) entering the body strengthens the vital *qi* and fortifies the meridians (固营卫), yet it still requires the external transmission of copper verdigris (铜青外传).\n\nThe world is filled with those who doubt the supreme Dao (至道), and their ignorance is truly profound (鲦修然万). Even if one encounters a benevolent scholar (好事者), they cannot attain this method. Without prior study, one may never hear of the Dao’s marvels (元由闻世问美事).\n\nI briefly outline the elixir methods (丹法) here, to guide those of later generations who share my aspirations and seek them. One must not cling to vulgar, shallow practices (亵近) while hoping to attain the world’s salvation (度世).\n\nEven a single cup of wine (一卮酒) cannot compare to the refinement of nine fermentations (九酝之醇), yet the lesser elixirs (小丹) are still inferior to this. Common medicines from herbs and trees (草木) burn away upon heating (烧之即烬), but cinnabar (丹砂), when refined, becomes mercury (水银), which can then be transmuted into the Returned Golden Elixir (还丹). The methods of these elixirs are far removed from ordinary medicines (法去凡药亦远矣), hence their power to grant longevity (长生).\n\nOnly the Divine Elixir (神丹) reveals this profound truth (此理). How could it be compared to the shallow pursuits of the common folk (庸夫浅近思求)? The world’s people know little and are easily misled (少识多所惑), not comprehending that mercury (水银) originates from cinnabar (丹砂). Even when told, they remain skeptical.\n\nSome mock the Immortal Dao (仙道) with crude analogies, laughing in derision—are they not truly foolish (不亦愚乎)?\n\nThe true Immortals of antiquity, pitying those who might be taught in the future, thus expressed their methods in intricate detail (委曲其说). Longevity and immortality (长生不死) are attainable, yet the vulgar will always remain ignorant and disbelieving.\n\nThe transformations of Creation (造化) are ninefold, like the cycles of the sun and moon (日月所成), all following their own patterns (皆如方也). The True Person (真人) can perceive this, yet the commoner’s shallow mind cannot fathom it.\n\nFrom my youth, I have been enamored with alchemical arts (方术), and with earnest devotion (苦心), I have sought teachings, never wearying of distant journeys (不惮脸远). Whenever I encountered strange doctrines (异闻), I rejoiced and begged for their clarification, enduring scorn and rejection without resentment (纵被毁弃，不敢为憾). How do I know that future seekers will not fare as I have?\n\nThus, I have written this treatise, to show those who recognize its worth—this is no mere embellishment (岂崇饰哉). The radiant sun cannot revive withered wood (盛阳不能荣枯木), nor can the wisest sage transform the foolish (上智不能移下愚). The methods are for the virtuous and discerning (方为贤者传，法为识者贵).\"\n\nThe commoner wields a carved bow to drive away crows, while the barbarian dons mourning garb yet carries a weighing scale—what is there to say of those who lack understanding?\n\nGold refined as essence, stone as liquid—this is no mere daily elixir technique (金精石液，不日还丹术).\n\nIn the past, I heard from Master Zheng (郑君) that: \"Humanity's vital carriage (权舆) is composed of yin qi and yang qi (阴精阳精). When yang qi stands erect (阳精魂立), yin qi forms the vital breath (阴精魄成), these two qi intermingle, giving rise to spirit and clarity (而生神明). Spirit manifests through form (神以形用), form sustains spirit (形以神生). When spirit departs, form must perish (神之云逝，形必斯毙). Spirit is preserved by the Dao (道), form prolonged by technique (术). The Dao is hidden and nameless (道隐无名), technique is manifest and substantial (术彰有实). With substance, technique proceeds of itself; without name, the Dao is complete in itself (有实而术自行，无名而道自成). When the Dao is realized, spirit is preserved (道成而神自全), and when technique is practiced, form is prolonged (卫行而形自延).\n\nThe techniques for prolonging life include bending and stretching (俯仰屈伸), fetal breathing (胎息), swallowing saliva (咽津), consorting with virgins to reclaim one’s essence (御少女以还精), and ingesting the *Zhū’ér* (朱儿) to preserve the body (饵朱儿以存身). The techniques for prolonging life take gold’s essence (取金之精), combine stone’s liquid (合石之液), and fuse them as husband and wife (结为夫妇), arranging them as spirit and breath (列为魂魄), blending into a single chaos (一体混沌), where the two emotions are stirred (两情感激).\n\nOne yin and one yang are called the Dao (一阴一阳谓之道), one gold and one stone are called the elixir (一金一石谓之丹). Stone, riding the yang, becomes hot (石乘阳而热), gold, riding the yin, becomes cold (金乘阴而寒). In ingestion, one takes the robust yang to suppress the yin (取壮阳而伏阴). In its effects, one strengthens the spirit while refining the breath (俾魂壮而魄婵). It flows like water toward dampness (类水流而趋湿), or moves like fire toward dryness (若火动而赴乾). Such is the vitality of its gold and wood essences (如此之谓其金木之灵)—how can it be disputed? The *Gold-Wood Universal Vitality Theory* (金木万灵论).",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "金木万灵论 经名：金木万灵论。 原题葛雅川（葛洪）撰，疑系唐宋人伪托之作。 系摘录《抱朴子·金丹篇》及《太清玉砖子》而成。 一卷。 底本出处：《正统道，藏》洞神部众街类。 金木万灵论 筹稚川撰 余览养生之书，鸠集久视之方，曾所披涉篇目，已千余卷矣，莫不还丹金液为大要焉。 然则此二事，盖中品上仙妙也。 服之不仙，则古元仙矣。 往者中国丧乱，奔彼而出。 余周游豫荆广江襄数百州之内，窥见流俗道士约数百矣。 或素闻其名，乃在云表者，然率相似如一也。 各各有数卷仙书，并悉不解之徒富畜耳。 时有行气断谷者，服诸草药法，略为同文，人元不有。 云道机科条，以此为正秘，乃云是尹喜所造。 余告之曰：此是魏世军督王图所撰，非古人也。 王图子不晓大药之妙，只欲行气入室求仙，作此道机，谓道毕於此，乃俟之甚也。 余问诸道士神丹金液之事，及三圣秘要之诀，天地神祇之法，了元知者。 其於夸诞自誉，诳人云久寿，及曾与仙人游者，将太半矣，得尽微者殊鲜。 或有闻金丹而不为金作，皆言上古已来仙人，乃当晓之。 又云元此事，又云其不得真经矣。 或得赞道救病杂丹碎方，便云丹法尽於此矣。 昔左元放於天柱山中精思，而神人授之以金丹仙．经。 会汉末大乱，不遑合服，而渡江欲投诸郡，后於潜山修道。 余从祖仙舫，又从左元放授之《太清丹经》三卷，及《九鼎经》一卷，《金液经》一卷。 余师郑君，郑君是从祖仙翁之弟子也。 又於从祖以授郑君，郑君授余，故道士了元知者。 然受之二十年矣，资元担石，难以为之，畜积长久耳。 藏金盈柜，聚钱如山，复不知有此不死之药。 纵令闻之，亦元一信。 夫啜玉粕则去浆蒋之薄味，睹昆仑则去丘墟之下卑。 余既览金丹之道，则使人不复视小小方书。 然不可卒得办为之者，宜誓行积德也。 尚且小益，终不能遂长生耳。 故《老君诀》云：不得还丹金液，徒自苦耳。 夫五谷犹能活人，得之则生，绝之则死，而瓦中品上仙之神药，岂不益人乎，岂不万亿於五谷邪。 夫神丹之为灵，服之逾妙。 此二药炼体质，故令人不死。 此乃岂是食物之精耶，以自坚固也，又如脂不灭火矣。 且铜青涂脚，入水不腐，此是借铜之功以焊其肉。 金入身活固营卫，亦须铜青外传也。 世问不信至道，实甚鲦修然万。 一时遇有好事者，复不可遇此法。 不值先学，元由闻世问美事。 余略述丹法，以示后勤志同而求之，不可守亵近而求度世。 且一卮酒，不妨九酝之醇，然小丹者犹自，岂远草木之上也。 凡草木药烧之即烬，而丹砂炼之成水银，即变为还丹，法去凡药亦远矣，故能令人长生。 神丹独见此理，岂去俗人一何归恳乎。 世人少识多所惑，不知水银出於丹砂，告之尚不信悟。 或比喻其仙道，而大笑之，不亦愚乎。 上古真仙愍念将来可教者，故委曲其说，长生不死至矣。 然俗人终有不知不信。 造化九变，日月所成，皆如方也。 真人可以知此，不可以庸夫浅近思求耳。 余少好方术，苦心请问，不惮脸远，每有异闻，则喜意求请，纵被毁弃，不敢为憾，安知未来者之不如今也。 是以着此，以示识者，岂崇饰哉。 且盛阳不能荣枯木，上智不能移下愚。 方为贤者传，法为识者贵。",
      "translated_text": "**The Treatise on the Golden-Wood Elixir of Ten Thousand Spirits**\n\nTitle: *The Treatise on the Golden-Wood Elixir of Ten Thousand Spirits*.\nOriginally attributed to Ge Yachuan (Ge Hong), but likely a forgery by a Tang or Song scholar. Compiled from excerpts of *Bao Pu Zi: The Golden Elixir Chapter* and *Tai Qing Yu Zhen Zi*. One scroll.\nSource: *The Daoist Canon of the Zhengtong Dao* (正统道藏), in the *Divine Mysteries Section* (洞神部), under *Miscellaneous Alchemical Treatises* (众术类).\n\n**The Treatise on the Golden-Wood Elixir of Ten Thousand Spirits**\nComposed by Ge Zhi (Ge Hong)\n\nIn my study of books on longevity, I have gathered methods for prolonged life, and among the thousands of scrolls I have perused, none fail to regard the return of the Golden Elixir (还丹) and Golden-Wood Elixir (金液) as the ultimate essence.\n\nYet these two matters are indeed the refined secrets of the mid-grade and exalted Daoists. If one takes them and does not attain transcendence (仙), then they are the methods of the ancient Primordial Immortals (古元仙). In times past, when China was in chaos, I fled to distant lands. Within the hundreds of states of Yu (豫), Jing (荆), Guang (广), and Jiang (江) and Xiang (襄), I observed countless vulgar Daoists—nearly a hundred in number.\n\nSome had merely heard their names, while others were said to dwell in the clouds beyond the world. Yet all were alike in their superficiality. Each claimed to possess several scrolls of Daoist scriptures, but none truly understood them—only the wealthy few who hoarded them.\n\nAt that time, there were those who practiced *qi*-cultivation (行气) and fasting (断谷), who relied on various herbal medicines, though their methods were but crudely aligned with the Dao. Few indeed were those who achieved anything.\n\nThey spoke of Daoist techniques and precepts, claiming these were the supreme secrets, and that they were created by Yin Xi (尹喜). I told them: \"These were written by Wang Tu (王图), a military supervisor of the Wei dynasty (魏世), not by an ancient sage. Wang Tu understood nothing of the profound alchemy (大药之妙), seeking only to cultivate *qi* in seclusion (入室求仙) and proclaiming that the Dao was complete within these methods. His ignorance was truly extreme.\"\n\nWhen I questioned these Daoists about the secrets of the Divine Elixir (神丹) and Golden-Wood Elixir (金液), the precepts of the Three Saints (三圣), and the laws of the Heavenly and Earthly deities (神祇), few had genuine knowledge. Half of them boasted of exaggerated longevity or claimed to have once consorted with Immortals (仙人), yet those who truly grasped the essence were rare.\n\nSome had heard of the Golden Elixir (金丹) but did not practice its true alchemical refinement (金作), yet they declared that Immortals of old must have known it. Others said, \"This matter is lost,\" or, \"We have not obtained the true scriptures (真经).\" Some possessed only scraps of miscellaneous prescriptions for prolonging life and curing illness (赞道救病杂丹碎方), yet they boasted that all elixir methods were contained therein.\n\nIn ancient times, Zuo Yuanfang (左元放) meditated deeply in the Tianzhu Mountains (天柱山), and a divine man (神人) bestowed upon him the *Golden Elixir Immortal Scripture* (金丹仙经). When the great upheaval of the late Han dynasty (汉末大乱) arose, he did not have time to refine and ingest it, and instead crossed the Yangtze River (渡江) to seek refuge in the counties (郡). Later, he returned to Tian Mountain (潜山) to cultivate the Dao.\n\nMy paternal uncle, Xian Fang (仙舫), also received from Zuo Yuanfang the *Tai Qing Dan Jing* (太清丹经) in three scrolls, the *Nine Cauldrons Scripture* (九鼎经) in one scroll, and the *Golden-Wood Elixir Scripture* (金液经) in one scroll. I was taught by Zheng Jun (郑君), who was a disciple of my uncle. My uncle passed these teachings to Zheng Jun, who then taught me. Hence, I am among those who truly comprehend the Dao.\n\nYet twenty years have passed since I received these teachings, and though I have accumulated resources (资) and labored endlessly (担石), I have not yet been able to fully practice them. My storehouses overflow with gold, and my wealth is piled like mountains, yet I still do not believe in this elixir of immortality (不死之药). Even if I did hear of it, I would not trust it.\n\nTo drink the residue of jade elixir (啜玉粕) is to discard the subtle essence of its refined nectar (浆蒋之薄味). To gaze upon Kunlun Mountain (昆仑) is to overlook the lofty mysteries beneath its humble slopes (丘墟之下卑). Once I have studied the Dao of the Golden Elixir (金丹之道), I no longer regard petty alchemical scrolls as worthy of attention. Yet if one cannot immediately attain the means to practice it, one must swear to cultivate virtue (积德) and perseverance.\n\nEven small progress (小益) is insufficient to achieve true longevity (长生). Thus, the *Laozi’s Precepts* (老君诀) say: \"Without attaining the return of the Golden Elixir (还丹) and Golden-Wood Elixir (金液), one only torments oneself in vain (徒自苦耳).\"\n\nThe Five Grains (五谷) can sustain life—if one consumes them, one lives; if one abstains, one dies. Yet the Divine Elixir (神丹) of the mid-grade and exalted Immortals (中品上仙) is a spiritual medicine (神药) that far surpasses the Five Grains in efficacy (岂不益人乎，岂不万亿於五谷邪). The Golden Elixir (神丹) is truly miraculous (灵), and its effects are beyond compare (逾妙). These two elixirs refine the body’s essence (炼体质), ensuring that one does not perish. Are they not akin to the vital essence of food (食物之精), strengthening the body from within, like fat that does not extinguish fire (脂不灭火)?\n\nMoreover, when copper verdigris (铜青) is applied to the feet, one does not rot in water—this is because it borrows copper’s power to temper the flesh (焊其肉). The Golden Elixir (金) entering the body strengthens the vital *qi* and fortifies the meridians (固营卫), yet it still requires the external transmission of copper verdigris (铜青外传).\n\nThe world is filled with those who doubt the supreme Dao (至道), and their ignorance is truly profound (鲦修然万). Even if one encounters a benevolent scholar (好事者), they cannot attain this method. Without prior study, one may never hear of the Dao’s marvels (元由闻世问美事).\n\nI briefly outline the elixir methods (丹法) here, to guide those of later generations who share my aspirations and seek them. One must not cling to vulgar, shallow practices (亵近) while hoping to attain the world’s salvation (度世).\n\nEven a single cup of wine (一卮酒) cannot compare to the refinement of nine fermentations (九酝之醇), yet the lesser elixirs (小丹) are still inferior to this. Common medicines from herbs and trees (草木) burn away upon heating (烧之即烬), but cinnabar (丹砂), when refined, becomes mercury (水银), which can then be transmuted into the Returned Golden Elixir (还丹). The methods of these elixirs are far removed from ordinary medicines (法去凡药亦远矣), hence their power to grant longevity (长生).\n\nOnly the Divine Elixir (神丹) reveals this profound truth (此理). How could it be compared to the shallow pursuits of the common folk (庸夫浅近思求)? The world’s people know little and are easily misled (少识多所惑), not comprehending that mercury (水银) originates from cinnabar (丹砂). Even when told, they remain skeptical.\n\nSome mock the Immortal Dao (仙道) with crude analogies, laughing in derision—are they not truly foolish (不亦愚乎)?\n\nThe true Immortals of antiquity, pitying those who might be taught in the future, thus expressed their methods in intricate detail (委曲其说). Longevity and immortality (长生不死) are attainable, yet the vulgar will always remain ignorant and disbelieving.\n\nThe transformations of Creation (造化) are ninefold, like the cycles of the sun and moon (日月所成), all following their own patterns (皆如方也). The True Person (真人) can perceive this, yet the commoner’s shallow mind cannot fathom it.\n\nFrom my youth, I have been enamored with alchemical arts (方术), and with earnest devotion (苦心), I have sought teachings, never wearying of distant journeys (不惮脸远). Whenever I encountered strange doctrines (异闻), I rejoiced and begged for their clarification, enduring scorn and rejection without resentment (纵被毁弃，不敢为憾). How do I know that future seekers will not fare as I have?\n\nThus, I have written this treatise, to show those who recognize its worth—this is no mere embellishment (岂崇饰哉). The radiant sun cannot revive withered wood (盛阳不能荣枯木), nor can the wisest sage transform the foolish (上智不能移下愚). The methods are for the virtuous and discerning (方为贤者传，法为识者贵).\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1236,
      "start_sentence": 0,
      "end_sentence": 59,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 27.627236366271973,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\金木万灵论.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "庸夫得雕弓以驱乌，夷人得丧服将负秤，夫不知者亦何足云哉。 金精石液，不日还丹术。 余昔闻於郑君曰：人之权舆，阴精阳精。 阳精魂立，阴精魄成，二精相薄，而生神明。 神以形用，形以神生。 神之云逝，形必斯毙。 神以道全，形以术延，道隐无名，术彰有实。 有实而术自行，无名而道自成。 道成而神自全，卫行而形自延。 夫术有俯仰屈伸，胎息咽津，御少女以还精，饵朱儿以存身。 延身之术，取金之精，合石之液，结为夫妇，列为魂魄，一体混沌，两情感激。 夫一阴一阳谓之道，一金一石谓之丹。 石乘阳而热，金乘阴而寒。 其服食也，取壮阳而伏阴。 其征应也，俾魂壮而魄婵。 类水流而趋湿，若火动而赴乾。 如此之谓其金木之灵，何可议也。 金木万灵论",
      "translated_text": "The commoner wields a carved bow to drive away crows, while the barbarian dons mourning garb yet carries a weighing scale—what is there to say of those who lack understanding?\n\nGold refined as essence, stone as liquid—this is no mere daily elixir technique (金精石液，不日还丹术).\n\nIn the past, I heard from Master Zheng (郑君) that: \"Humanity's vital carriage (权舆) is composed of yin qi and yang qi (阴精阳精). When yang qi stands erect (阳精魂立), yin qi forms the vital breath (阴精魄成), these two qi intermingle, giving rise to spirit and clarity (而生神明). Spirit manifests through form (神以形用), form sustains spirit (形以神生). When spirit departs, form must perish (神之云逝，形必斯毙). Spirit is preserved by the Dao (道), form prolonged by technique (术). The Dao is hidden and nameless (道隐无名), technique is manifest and substantial (术彰有实). With substance, technique proceeds of itself; without name, the Dao is complete in itself (有实而术自行，无名而道自成). When the Dao is realized, spirit is preserved (道成而神自全), and when technique is practiced, form is prolonged (卫行而形自延).\n\nThe techniques for prolonging life include bending and stretching (俯仰屈伸), fetal breathing (胎息), swallowing saliva (咽津), consorting with virgins to reclaim one’s essence (御少女以还精), and ingesting the *Zhū’ér* (朱儿) to preserve the body (饵朱儿以存身). The techniques for prolonging life take gold’s essence (取金之精), combine stone’s liquid (合石之液), and fuse them as husband and wife (结为夫妇), arranging them as spirit and breath (列为魂魄), blending into a single chaos (一体混沌), where the two emotions are stirred (两情感激).\n\nOne yin and one yang are called the Dao (一阴一阳谓之道), one gold and one stone are called the elixir (一金一石谓之丹). Stone, riding the yang, becomes hot (石乘阳而热), gold, riding the yin, becomes cold (金乘阴而寒). In ingestion, one takes the robust yang to suppress the yin (取壮阳而伏阴). In its effects, one strengthens the spirit while refining the breath (俾魂壮而魄婵). It flows like water toward dampness (类水流而趋湿), or moves like fire toward dryness (若火动而赴乾). Such is the vitality of its gold and wood essences (如此之谓其金木之灵)—how can it be disputed? The *Gold-Wood Universal Vitality Theory* (金木万灵论).",
      "overlap_context": "enever I encountered strange doctrines (异闻), I rejoiced and begged for their clarification, enduring scorn and rejection without resentment (纵被毁弃，不敢为憾). How do I know that future seekers will not fare as I have?\n\nThus, I have written this treatise, to show those who recognize its worth—this is no mere embellishment (岂崇饰哉). The radiant sun cannot revive withered wood (盛阳不能荣枯木), nor can the wisest sage transform the foolish (上智不能移下愚). The methods are for the virtuous and discerning (方为贤者传，法为识者贵).\"",
      "start_char": 1236,
      "end_char": 1537,
      "start_sentence": 60,
      "end_sentence": 77,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 8.014197826385498,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\金木万灵论.txt",
        "category": "众术类"
      }
    }
  ]
}