{
  "source_id": "金箓十回度人早朝转经仪",
  "source_file": "chunked_daozang\\金箓十回度人早朝转经仪.json",
  "total_chunks": 7,
  "total_original_chars": 3345,
  "total_translated_chars": 22355,
  "total_translation_time": 59.45374655723572,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\金箓十回度人早朝转经仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**\"Ritual for the Tenfold Recitation of the Golden Sutra to Deliver All Beings: Three-Day Morning Ritual for Circulating the Sutra**\n\n**Title:** *Ritual for the Tenfold Circulation of the Golden Sutra to Deliver All Beings: Three-Day Morning Sutra-Recitation Ceremony*\n**One scroll.**\n\n**Source:** *Zhengtong Daozang* (Daoist Canon of the Zhengtong Era), in the *Tongxuan* (Cavernous Mysteries) section, under **Rituals of Awe and Reverence**.\n\n---\n\n**Early Morning Sutra-Circulation Ritual for the Tenfold Golden Sutra to Deliver All Beings**\n\n**Preface to the Ritual Hall**\n\n**Ritual Proceedings**\n\nThe High Master kneels and begins the invocation:\n*\"Your humble disciple, [Name], with utmost reverence, now humbly invokes the Most Authentic Daoist Master of the Golden Sutra, the Supreme Way (Dao) and the Most Mysterious Treasure—True Lord, the Golden Sutra Master, the Master of the Sacred Scripture, the Master of the Register, the Master of Deliverance, the Most Upright Celestial Master, the Female Master’s Lineage Successor, and the Golden Sutra Supervising Master of the Pure Fast—True Lord.*\n\n*With the sacred diagram revealed in crimson light (赤明开图), and the sacred grains of millet bestowed (黍珠授受), a single lineage of venerable teachers.*\n\n*In deep respect, I gaze upon Your divine benevolence and await Your compassionate insight.*\n\n*Your disciple hears that the Original Beginning (元始) taught the Sutra in a single session, completing it in one cycle. But the Tenfold Circulation of the Golden Sutra, overseen by the Most Authentic Daoist Master, delivers all beings in the East and reaches even to the lowest realms—no obstacle remains unvanquished, no calamity unforsaken. It grants life daily, and it transforms beings daily.*\n\n*Now, as I am to proclaim the Sutra’s teachings, I first humbly seek Your solemn authority.*\n\n*Today, I enter the ritual hall, leading the assembled officials, and ascend the platform to recite the *Supreme Most Authentic Cavernous Mysteries, Golden Sutra of Boundless Deliverance for All Beings—First Rank of Marvelous Scripture* (太上洞玄灵宝无量度人上品妙经) from the First to the Fourth Circulation.*\n\n*With reverence, I pray for the extension of Your boundless life and the preservation of Heaven’s eternal existence. May Your divine virtue (德) be the foundation of this ritual assembly.*\n\n*May the sincerity of all participants ascend to the heavens, and may the mysterious blessings shine brightly.*\n\n*May all sentient beings alike share in these merits.*\n\n*I await Your gracious command to perform the Sutra’s rites.*\n\n*Your disciple, though unworthy, dares not violate Your solemn precepts. My devout prayers are beyond expression.*\n\n*With the assembled officials, I ascend the platform and solemnly enact the prescribed rites.*\n\n*[Recitation of the Daoist Invocation to lead the procession to the hall’s entrance]*\n\n**Ritual Proceedings: Invitation of the Spirit King** (降神王)\"\n\n**Invocation to the Celestial Assembly**\n\nWith deepest reverence, I, [Name], humbly address the Ten Directions’ Boundless Flight-Heaven Spirit Kings—Great Saints of Immortal Life, the Limitless Savior Lords; the Ten Directions’ Flight-Heaven Envoys; the Ten Heavens’ Jade Maidens; and all the Celestial Spirits and Officials of the Ten Directions.\n\nMay Your boundless compassion turn Your radiant gaze upon us. With solemnity, I open this sacred text to reveal its mysteries, preparing to recite the Eight Canons of the Sutra while first paying homage to the Ten Directions and assuming the role of instructor.\n\nI pray for Your divine presence to descend upon this Daoist hall. For all beginnings, Your guiding force is essential; for every scripture, Your blessings make recitation fruitful. The assembled devotees, in pious sincerity, offer fasting and supplication—fasting, cloud-chariots, and scattered flowers.\n\n---\n\nI, [Name], humbly report: In the primordial era of Vermilion Brightness, the Original Beginning issued sacred texts; the Spirit Kings received their mandates at the void-song of the Azure Palace. Together, they ascended to the Hall of Precious Millet, receiving the edicts of Jade Voice. Charged with proclaiming the celestial decrees and overseeing the Sutra’s salvific power, they thus unfolded the profound mysteries of hidden teachings, making known the subtle truths that even distant and lofty scholars cannot deceive.\n\nTheir great merits were recorded since ancient times, and their boundless blessings should be extended to all who come after. Now, with reverence, I follow Your imperial edicts to solemnly observe the Golden Talisman Great Fast, praying for the extension of Your boundless life and the preservation of Heaven’s eternal existence.\n\nMay the Vermilion Phoenix and Azure Dragon return to the celestial expanse, and may the Crimson Chariot and Green Palanquin descend to this Daoist hall. May Your golden and jade decrees forever sustain the tenfold transformations; may Your silk edicts spread Your words to all sentient beings. Above, I uphold the boundless imperial winds; below, I fulfill the humble prayers of the faithful.\n\nWith this memorial submitted, I pray for Your gracious inspection. May Your compassion extend to the Ten Directions, aligning with the creation of all beings; may Your blessings transcend the Three Realms, fulfilling the merit of protection and elevation.\n\nNow, leading the assembly, we ascend the platform to perform the Sutra rites. The *Hua Xia* chant is invoked; the assembly ascends, offering incense. With faith, we pay homage to the Teacher, maintaining pure intent as prescribed.\n\nThe Nine-Heaven Splendor manifests its radiant glow; the vast cosmos shimmers with the True One’s luminous essence. We direct our offerings to the Central Sovereign, as the hundred spirits descend in response. The roots of suffering are severed; the Eight Hardships are dispelled. The Seven Ancestors ascend together, their blessings towering. Thus, the divine and immortal gather, the Eight Auspicious signs take flight.\n\nThe Supreme Daoist Lord of Primordial Mystery summons forth from within me the thirty-five officials of the Three Five [Celestial Bureaus], the left and right Envoys, the Incense-Bearing Golden Boys, the Speech-Conveying Jade Maidens, and the Five Emperors’ Direct-Symbol Direct-Sun Incense Officials—thirty-two in number—each emerging.\n\nIn accordance with Your command, I now pray that the Supreme Lord may descend and bestow upon me the Ten Directions’ Pure Essence *qi*, flowing into my body, so that my petition may swiftly reach the presence of the Supreme Emperor of the Thirty-Two Heavens, the Original Beginning’s Most August Deity.\n\nI now proclaim my rank: I, [Name], with utmost sincerity, address—\n\nThe Supreme Boundless Daoist Lord of Natural Void and Original Beginning, the Most Mysterious Emperor;\nThe Supreme Lord of Marvelous Non-Being, the Mysterious Sovereign;\nThe Supreme Lord of the Highest Dao, the Celestial Jade Dawn’s Most Sacred Treasure;\nThe Supreme Lord of the Primordial Void’s Ever-Changing Mystery, the Daoist Lord of Virtue and Power, the Most True Emperor;\nThe Jade Emperor of the Highest Heaven;\nThe Lord of Supreme Yang, the Merciful Paternal Daoist;\nThe Lord of the Celestial Treasure, the Maternal Daoist;\nThe Southern Polar Sovereign Emperor;\nThe Northern Polar Purple Micro Emperor;\nThe Lord of Vermilion Mound, the Celestial Decree Savior;\nThe Earthly Sovereign, the Imperial Soil Deity;\nThe Supreme Lords of the Ten Directions’ Boundless Celestial Treasures;\nThe Already-Enlightened Great Saints and Most True Lords;\nThe Thirty-Two Heavenly Emperors;\nThe Lords of Eastern Hua, Southern Polar, Western Spirit, and Northern Truth;\nThe Seven Treasures of the Golden Gate, the Jade Palace, the Seven Precious Towers, and the Purple Micro Upper Palace;\nThe Supreme Lord of the Celestial Treasure’s Most True Manifest Emperor;\nThe Supreme Minister, the Supreme Prime, the Supreme Protector, the Supreme Tutor;\nThe Most High Emperor of the Mysterious Center;\nThe Thirty-Six Departments of Sacred Scriptures;\nThe Great Daoist Master of the Mysterious Center;\nThe Five Emperors and Three Officials, the Four Bureaus and Nine Ministries;\nThe Sun, Moon, and Five Stars; the Southern Asterism and Northern Dipper; the Twenty-Eight Constellations; the Celestial Compass and Jade Balance; the Arrayed Star Spirits;\nThe Ten Directions’ Most True Great Gods;\nThe Flight-Heaven Spirit Kings, the Great Saints of Immortal Life, the Limitless Savior Lords;\nThe True Human of Heavenly Perfection, the Marvelous Conducted Sage;\nThe Three Lords of the Celestial Treasure;\nThe Supervising Fast Master;\nThe Five Emperors Attending the Sutra;\nThe Jade Boys and Jade Maidens, the Sutra-Bearing Jade Lads, the Three Caverns’ Sutra Attendants;\nThe Celestial Treasure Officials, the Three Realms’ Five Emperors, the Great Merit Magical Kings;\nThe Officials of the Three Realms;\nThe Responsive True Spirits.\n\nWith deepest reverence, I pray for Your boundless compassion to turn Your penetrating insight upon us.\n\nI have heard: In the profound and obscure, the Dao cannot be transmitted through words alone;\n\n「Pure and refined, the *Sutra* originates from the profound exposition of *Dharma*.\n\nIts subtleties are elusive—mysterious and inscrutable;\nYet its practical application is all-pervading—omnifaceted and accessible.\n\nI, a humble mortal, have observed the Celestial Treasure.\nAt the dawn of a single hour’s Daoic practice,\nI proclaim the *Sutra* of the Four Realms to fulfill its purpose.\nThe earth and heavens, ghosts and gods,\nSurely must perceive my devout and sincere intentions;\nThe four directions—east, west, south, and north—\nMay all hear the subtle and wondrous sounds.\n\nWith deepest reverence, I take refuge in the Limitless Dao.\nWith utmost sincerity, I take refuge in the *Sutra* Treasures of the Ten Directions,\nAnd pray that all beings may open their hearts to enlightenment,\nTo receive, uphold, recite, and study them.\n\nWith utmost sincerity, I take refuge in the Ten Directions’ *Dao* Treasures,\nAnd pray that all beings may arise with pure intent,\nTo pay homage, worship, and offer faith.\n\nWith utmost sincerity, I take refuge in the Ten Directions’ *Sutra* Masters,\nAnd pray that all beings may universally ascend the *Dharma* Bridge,\nEncountering no obstacles.\n\n**The Host of Past Lives Praises:**\nWith the *Sutra*-Attending and *Sutra*-Opening sciences,\nI prepare the *Enthronement Chant*,\nReflecting quietly as the *Law* dictates,\nKnocking my teeth thirty-two times,\nMeditating on the five-colored *qi* clouds,\nFilling the chamber completely.\n\nThe Azure Dragon and White Tiger,\nThe Vermilion Bird and Dark Tortoise,\nThe Lion and White Crane,\nThe Phoenix—all stand guard,\nTo the left, right, front, and rear.\n\nThe Golden Boys and Jade Maidens,\nThe Five Emperors’ divine soldiers and cavalry—\nEach with nine hundred million riders—\nEncamp around the fasting hall.\n\nThen I recite the *Sutra*,\nThe *Sutra*-Opening *Mystic Mantra*—\nFrom the *Cloud-Signs* of the Great Void,\nAt the onset of the vast calamity.\n\nNow distant, now near,\nSometimes submerged, sometimes floating.\nThe five directions hover,\nA span beyond.\n\nThe True Human of Heavenly Perfection,\nPresses the brush and begins to write.\nTo manifest the profound chapters,\nThen to inscribe the *Soul-Symbols*.\nThe Primordial Beginning descends,\nThe *True Text* spreads forth.\nIlluminating what exists,\nConcealing what does not.\n\nThe afflicted may heal themselves,\nThe weary and ensnared find support.\nThe dark and hidden gain reliance,\nThus ascending to the *Immortal Assembly*.\n\nI pray for the turning of the *Dharma* Wheel,\nFor the Master to inscribe the *Sutra*,\nAnd for the *Dao* to speak:\n*\"Once, within the Primordial Azure Sky,\nI ascended the Pure Highness through the clouds.*\n\n*Gazing upon the Thirty-Two Heavens,\nEach filled with colored *qi* clouds,*\n*Overlapping in layers.*\n\n*There are palaces and towers,\nThe Celestial Emperor’s crown and garments,*\n*Distinct and clear.*\n\n*This begins with the Self-Settled Spirit,*\n*At the Great Yellow Assembly of the True Human.*\n*Each Heaven, I knock my teeth once,*\n*Bow my heart once,*\n*Totaling thirty-two repetitions.*\n\n*Then, closing my eyes and meditating,*\n*The Three *Dantian* Fields emit three-colored *qi* clouds,*\n*Like threads, gradually departing the body.*\n\n*The *qi* clouds become dense,*\n*First enveloping my entire form,*\n*Then winding around my seat and table,*\n*Leaving nothing untouched.*\n\n*Next, they expand outward,*\n*Surrounding the altar,*\n*Encircling a region,*\n*And after a long while, merging in obscurity with the heavens and earth.*\n\n*Then I meditate:*\n*The Azure Dragon emerges from the liver,*\n*Standing to the left;*\n*The White Tiger from the lungs,*\n*Standing to the right;*\n*The Vermilion Bird from the heart,*\n*Standing before;*\n*The Dark Tortoise from the kidneys,*\n*Standing behind;*\n*The Lion from the lower *Dantian* beneath the spleen,*\n*With twelve heads standing to the left and right;*\n*The White Crane from the *Nezigong* (泥丸),*\n*Nine birds encircling the four directions.*\n\n*Again, I focus on the *Six Harmonies* between the brows:*\n*There is the sun and moon emerging from both eyes,*\n*Each nine *chi* from the face,*\n*Transforming into nine-colored circular forms,*\n*Piercing through inner and outer,*\n*So clear and distinct.*\n\n*I chant the *Mystic Mantra* in secret,*\n*Without letting it be heard by the ears.*\n*After the chanting,*\n*I draw in the eight pathways of the Eastern Azure *qi*,\n*Eight pathways of the Southern Vermilion *qi* into the heart,*\n*Eight pathways of the Western White *qi* into the lungs,*\n*Eight pathways of the Northern Black *qi* into the kidneys,*\n*With utmost sincerity.*\n\n*Next, I recite the second through ninth sections of this chapter,*\n*No longer reciting the *Dao* Lord’s Grand Preface,*\n*But beginning from this chapter.*\n\n*The tenth section follows the first,*\n*Reciting the Preface,*\n*Reflecting and meditating.*\n\n*After completing the *Sutra* recitation,*\n*I perform the *Dissolution Chant*,\n*The *Sutra*-Attending Reflection,*\n*And prepare the *Wisdom and Benevolence Praise*.*\n\n*The Master and the fasting officials then proceed to the Eastern direction,*\n*Lighting incense and bowing again.*\n\n*I, in reverence, rotate through the Eight Decks,*\n*As the *Sutra* session begins;\n*Entering the Nine Enclosures,*\n*The Emperor’s Seat attends in person.\"*\n\nWith deepest reverence to the **Eastern Limitless Supreme Spirit-Jewel Celestial Venerable Sovereign**,\nThe **Eastern Limitless Flying-Heaven Divine King, Eternal Saint of Boundless Salvation, Sovereign of All**,\nRiding the *Zhen* [thunder] to govern Spring, embodying the Primordial to nurture all things.\n\nBeneath the *Qian* [cypress] grove, You repeatedly imparted the subtle words of the Golden Mouth;\nWithin the *Shu* [millet]-pearl, I personally received the secret seal of the Jade Capital.\n\nMay You condescend to turn Your divine gaze,\nPiercing through the sincerity of this fasting ritual.\n\nThe Celestial Sovereign records merit,\nEntrusting the *Chao* [morning court] audience to bear witness;\nThe Eastern Hua [Celestial Bureau] oversees calculations,\nLending the *Hua* [transformation]-brush to inscribe this offering.\n\nWith the formal petition prepared,\nI now solemnly proclaim it.\n\n**Proclamation of the Petition** – *Burning the Offering*\n**Sutra-Attending Second Session** – *Opening the Sutra Rites*\n**Laying the Seat Chant**\n**Requesting the Transmission of the *Dharma* Discourse**\n**The Master Inscribes the Sutra**\n**The Assembly Recites Complete**\n**Laying the Seat Chant**\n**Sutra-Attending Reflection**\n**Wisdom and Benevolence Praise**,\nThen turning toward the **Southern Direction**.\n\nWith reverence, I unfold the **Jade Treasury Scriptures**,\nHaving fulfilled the Sutra’s merit,\nAnd once more stand before the **Jade Stair**—\nOnly the Heavenly Compassion returns to Heaven,\nListening with threefold grace.\n\nWith deepest reverence to the **Southern Limitless Supreme Spirit-Jewel Celestial Venerable Sovereign**,\nThe **Southern Limitless Flying-Heaven Divine King, Eternal Saint of Boundless Salvation, Sovereign of All**,\nWho attains Oneness to purify, turns toward Clarity, and governs with the *Dao*.\n\nEstablishing teachings for the ages, You entrust the full heart to propagate the Way;\nOverseeing the True to guide sentient beings, You surely will not fail this fasting plea.\n\nMay You observe my sincerity,\nRecording the Sutra’s merit.\n\nThe **Supreme Pole** is secure, blessed by the One;\nThe **Imperial Design** vast, extending eternally without bound.\n\nWith the formal petition prepared,\nI now solemnly proclaim it.\n\n**Proclamation of the Petition** – *Burning the Offering*\n\n**Third Session of the Sutra Proclamation – Opening the Sutra Rites**\n*(Ritual sequence follows the second session)*\n\nTurning to the **Western Quarter**, offering incense, and bowing twice,\nI, with humble reverence, grasp the teachings of the Three Sovereigns,\nCoarsely comprehending the **Dao**’s essence.\nWith unceasing sincerity, I trust my plea will reach the **Heavenly Heart**.\n\nWith deepest reverence to the **Western Limitless Supreme Spirit-Jewel Celestial Venerable Sovereign**,\nThe **Western Limitless Flying-Heaven Divine King, Eternal Saint of Boundless Salvation, Sovereign of All**,\nWhose merit is ever-renewing, whose station is in the **Luminous Marsh**.\n\nIn days past, the **Floating Lotus Assembly** gathered like fine rain and dense mist;\nNow, at the **Spirit-Jewel Ritual Altar**, You surely descend like clouds floating in the void.\n\nMay You record merit in the **Mysterious Capital’s** realm,\nAnd inscribe virtue in the **Pure Spirit’s** hall.\n\nYour **sacred virtue** ever-renews, enduring alongside Heaven and Earth;\nYour **Imperial Design** vast as the heavens, equal in honor to **Songshan and Huashan**.\n\nWith the formal petition prepared,\nI now solemnly proclaim it.\n\n**Proclamation of the Petition** – *Burning the Offering*\n\n---\n\n**Fourth Session of the Sutra Proclamation – Opening the Sutra Rites**\n*(Ritual sequence follows the second session)*\n\nTurning to the **Northern Quarter**, offering incense, and bowing twice,\nI, with humble reverence, grasp the **Jade Script Dragon Text**,\nIts profound meanings now fully encompassing the four directions;\nThe **Jade Tripod and Feathered Canopy** gather in unison at the **Spirit Altar**.\n\nWith deepest reverence to the **Northern Limitless Supreme Spirit-Jewel Celestial Venerable Sovereign**,\nThe **Northern Limitless Flying-Heaven Divine King, Eternal Saint of Boundless Salvation, Sovereign of All**,\nWhose kindness is as boundless as Heaven—\n*\"Laboring in the Abyss\"* (曰劳乎坎).\n\nReceiving the **Heart Seal of Millet-Pearls**, the **Dao** permeates the **Three Vehicles**;\nSpreading the **Spirit-Jewel Sect’s** teachings, Your grace extends to all sentient beings.\n\nMay You inscribe my name upon the **Golden Tablets**,\nAnd record virtue in the **Jade Scripts**.\n\nThe **Luminaries** shine in the **Purple Micro**, bestowing longevity and prosperity;\nThe **Six Dragons** descend upon the **Yellow Path**, broadly bestowing nurturing grace.\n\nWith the formal petition prepared,\nI now solemnly proclaim it.\n\n**Proclamation of the Petition** – *Burning the Offering*\n\n**Sutra of the Three Hearings – Vow of Renewal**\n\n**The Furnace Restored as Before**\n\nThe **Celestial Worthies and Immortal Officials**, the **Golden Boys and Jade Girls**, the **Five Emperors and Five Sacred Peaks’ Immortals and True Persons**, the **Three Qi Orthodox Deities**, the **Left and Right Dragon-Tiger Lords**, the **Heavenly and Earthly Immortals**, the **Five Spirit Officials of Fragrance**—\n\nNow, by summoning the **Ten Directions’ Orthodox Qi**, the **Golden Elixir** and **Jade Grass** naturally arise, their **spirit-petals** blooming.\n\nThe **Hundred Spirits and True Ones** gather here before the **Incense-Fire Furnace**.\n\nI now vow that the **Ten Directions’ Immortal Boys and Jade Girls** shall attend to the **fragrant smoke**, conveying my previous petition directly to the **Supreme Emperor of the Thirty-Two Heavens, the Original Beginning Dao/Way’s Most Exalted Sovereign**.\n\n**Preserve the Four Spirits**, each returning to their **Five Viscera and Ten Directions’ Heavenly True Selves**, ascending upon the clouds and departing.\n\nNext, with **three-colored clouds**, swallow into the **Three Elixir Fields**, strike the teeth **three times**, and swallow the saliva **three passes**.\n\n**Directly descending from the Upper Platform to the Lower Platform**, I go to the **curtain to thank the Teacher**.\n\n**The Teacher offers incense and bows twice**.\n\nWith utmost reverence, **Your humble servant [Name]**, in sincere devotion, now humbly presents this petition to:\n\n**The True Lord of the *Lingbao* Mystic Middle Great Dao Master**,\n**The *Lingbao* Sutra Master Lord, the Register Master Lord, the Salvation Master Lord**,\n**The Orthodox Celestial Master Lord**,\n**The Female Lineage, Successor, and System Master Lord**,\n**The *Lingbao* Supervising Fasting Great Dao Master True Lord**,\n**The *Chiming* Opener of Diagrams, the Millet-Pearl Transmission Lineage’s Patriarch**.\n\nWith deepest reverence, I **behold Your Teacherly kindness**, humbly gazing and offering gratitude with sincerity.\n\n**Your humble servant**, in past days, led the **official assembly**, ascending the platform to recite the *Supreme Dao/Way’s Mystic *Lingbao* Sutra of Boundless Salvation for the Upper Grade* from the **First Pervasion to the Fourth Pervasion**, fortunate in its completeness, directly praying for **Ten Thousand Years of Longevity** and **Heaven’s Eternal Preservation**.\n\nBy **Your Teacher’s grace**, I am **secretly upheld and silently guided**.\n\nNow, I **extend my thanks in reverence**, still hoping to fulfill the end.\n\nAwaiting the time of **the Lingering Phoenix’s Scrolls** and the day of **the Jade Halter’s Return**, I shall **repay virtue with virtue**, engraving it upon **bone and heart**.\n\n**Above, I propagate the *Lingbao* doctrines** to **broaden the Dao/Way of Compassion**.\n\nYour humble servants **dare to trespass upon Your Teacher’s severity**, our **lowly sentiments know no bounds**—we are **utterly trembling with awe**.\n\n**Past deeds, mindful of virtue.**\n\n**\"The Golden Talisman Tenfold Rites of Early Morning Scripture-Recitation for Salvation are now complete.\"**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "金箓十回度人三朝转经仪 经名：金箓十迥度人三朝转经仪。 一卷。 底本出处：《正统道藏》洞玄部威仪类。 金箓十回度人早朝转经仪 师堂序立 法事 高功跪启 具位臣，某重伸上启灵宝玄中大法师真君、灵宝经师君、籍师君、度师君、正一天师君、女师嗣师系师君、灵宝监斋大法师真君。 赤明开图，黍珠授受，一派宗师。 恭望师慈，俯回洞鉴。 臣闻，元始说经，一徧而终。 十徧众真，监度东方，而至下方，无所不辟，无所不禳。 日可以生，日可以化。 将宣经法，先叩师严。 臣今入意以今引领官众，升坛转诵《太上洞玄灵宝无量度人上品妙经》第一回至第四回。 敬为祝延万寿，保天长存。 金赖师慈，主盟坛席。 庶俾精诚上彻，玄贶孔昭。 一切有情，同沾利益。 专俟恩命，宣演经科。 臣干冒师严，下情不胜虔祷之至。 领众升坛，恭行典式。 唱道引至坛前序立。 法事 降神王",
      "translated_text": "**\"Ritual for the Tenfold Recitation of the Golden Sutra to Deliver All Beings: Three-Day Morning Ritual for Circulating the Sutra**\n\n**Title:** *Ritual for the Tenfold Circulation of the Golden Sutra to Deliver All Beings: Three-Day Morning Sutra-Recitation Ceremony*\n**One scroll.**\n\n**Source:** *Zhengtong Daozang* (Daoist Canon of the Zhengtong Era), in the *Tongxuan* (Cavernous Mysteries) section, under **Rituals of Awe and Reverence**.\n\n---\n\n**Early Morning Sutra-Circulation Ritual for the Tenfold Golden Sutra to Deliver All Beings**\n\n**Preface to the Ritual Hall**\n\n**Ritual Proceedings**\n\nThe High Master kneels and begins the invocation:\n*\"Your humble disciple, [Name], with utmost reverence, now humbly invokes the Most Authentic Daoist Master of the Golden Sutra, the Supreme Way (Dao) and the Most Mysterious Treasure—True Lord, the Golden Sutra Master, the Master of the Sacred Scripture, the Master of the Register, the Master of Deliverance, the Most Upright Celestial Master, the Female Master’s Lineage Successor, and the Golden Sutra Supervising Master of the Pure Fast—True Lord.*\n\n*With the sacred diagram revealed in crimson light (赤明开图), and the sacred grains of millet bestowed (黍珠授受), a single lineage of venerable teachers.*\n\n*In deep respect, I gaze upon Your divine benevolence and await Your compassionate insight.*\n\n*Your disciple hears that the Original Beginning (元始) taught the Sutra in a single session, completing it in one cycle. But the Tenfold Circulation of the Golden Sutra, overseen by the Most Authentic Daoist Master, delivers all beings in the East and reaches even to the lowest realms—no obstacle remains unvanquished, no calamity unforsaken. It grants life daily, and it transforms beings daily.*\n\n*Now, as I am to proclaim the Sutra’s teachings, I first humbly seek Your solemn authority.*\n\n*Today, I enter the ritual hall, leading the assembled officials, and ascend the platform to recite the *Supreme Most Authentic Cavernous Mysteries, Golden Sutra of Boundless Deliverance for All Beings—First Rank of Marvelous Scripture* (太上洞玄灵宝无量度人上品妙经) from the First to the Fourth Circulation.*\n\n*With reverence, I pray for the extension of Your boundless life and the preservation of Heaven’s eternal existence. May Your divine virtue (德) be the foundation of this ritual assembly.*\n\n*May the sincerity of all participants ascend to the heavens, and may the mysterious blessings shine brightly.*\n\n*May all sentient beings alike share in these merits.*\n\n*I await Your gracious command to perform the Sutra’s rites.*\n\n*Your disciple, though unworthy, dares not violate Your solemn precepts. My devout prayers are beyond expression.*\n\n*With the assembled officials, I ascend the platform and solemnly enact the prescribed rites.*\n\n*[Recitation of the Daoist Invocation to lead the procession to the hall’s entrance]*\n\n**Ritual Proceedings: Invitation of the Spirit King** (降神王)\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 368,
      "start_sentence": 0,
      "end_sentence": 25,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 8.791805505752563,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\金箓十回度人早朝转经仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "具位某上启十方无极飞天神王长生大圣无量度人君、十方飞天使者、十天玉女、十天一切灵仙官众。 咸望圣慈，洞回昭鉴。 恭以开函演奥，将修八纬以诵经； 监真度生，先叩十方而主教。 愿回灵驾，俯降道场。 有开必先，全赖提撕之力； 无文不度，庶成诵咏之功。 法众虔诚，修斋奉请 修斋 云舆 散花 具位某上启十方无极飞天神王长 生大圣无量度人君、十方飞天使者、十天玉女、十方一切灵仙官众。 伏闻元始出书，当赤明之初劫； 神王受命，会碧落之空歌。 同登宝黍之中，亲受玉音之旨。 承宣符命，监度经功。 由是曲畅旁通，秘蕴之精微发见； 遐盻极览，学人之功过难欺。 大勋既着於古初，美利宜开於来者。 以今钦奉纶音，崇修金箓大斋。 端为祝延万寿，保天长存。 伏愿来朱凤玄龙於霄汉，回丹舆绿辇於道场。 金玉尔音，永赖纲维於十转； 丝纶其出，愿言张布於万灵。 上弘荡荡之皇风，下副区区之丹祷。 具有启疏，谨用敷宣。 宣疏 疏文宣读，谅赐鉴观。 伏愿周回十方，密契生成之造； 过度三界，允符保举之功。 领众升坛，修行经法。 华夏引，众升坛，上香 信礼 各礼师，存念如法 九天上景，化生华晖。 晃漾太空，曜真紫微。 上致中皇，百神降回。 散根离苦，八难豁开。 七祖同升，福庆巍巍。 使我神仙，八景齐飞。 鸣法鼓二十四通 无上玄元太上道君，召出臣等身中三五功曹、左右官使者，侍香金童、传言玉女、五帝直符直日香官，各三十二人出。 关启所言，臣今为入意愿得太上降赐十方正真生炁，流注臣等身中，令臣所启，速达径御无上三十二天元始上帝至尊御前。 请称法位 具位臣，某谨同诚上启太上无极大道虚无自然元始天尊、妙无上帝，玄皇高圣太上玉晨大道君灵宝天尊、妙有上帝，混沌万变玄元老君道德天尊、至真上帝，昊天玉皇上帝，元阳慈父大道君，灵宝玉母大道君，南极天皇上帝，北极紫微大帝，朱陵度命天尊，后土皇地祇，十方无极太上灵宝天尊，已得道大圣众、至真诸君丈人，三十二天帝君、东华南极西灵北真玄都玉京金阙七宝琼台紫微上宫灵宝至真明皇道君，上相上宰、上保上傅、玄中太皇上帝高真，三十六部尊经，玄中大法师，五帝三官、四司九府，日月五星、南辰北斗、二十八宿、璇玑玉衡、列象星真，十方无极至真大神，飞天神王长生无量度人君、天真皇人妙行真人，灵宝三师，监斋大法师，侍经五帝，玉童玉女、典经玉郎、三洞侍经，灵宝官属、三界五帝、大勋魔王，三界官属，应感真灵。 恭望洪慈，俯回洞鉴。 臣闻，杳冥悦忽，道不可以言传；",
      "translated_text": "**Invocation to the Celestial Assembly**\n\nWith deepest reverence, I, [Name], humbly address the Ten Directions’ Boundless Flight-Heaven Spirit Kings—Great Saints of Immortal Life, the Limitless Savior Lords; the Ten Directions’ Flight-Heaven Envoys; the Ten Heavens’ Jade Maidens; and all the Celestial Spirits and Officials of the Ten Directions.\n\nMay Your boundless compassion turn Your radiant gaze upon us. With solemnity, I open this sacred text to reveal its mysteries, preparing to recite the Eight Canons of the Sutra while first paying homage to the Ten Directions and assuming the role of instructor.\n\nI pray for Your divine presence to descend upon this Daoist hall. For all beginnings, Your guiding force is essential; for every scripture, Your blessings make recitation fruitful. The assembled devotees, in pious sincerity, offer fasting and supplication—fasting, cloud-chariots, and scattered flowers.\n\n---\n\nI, [Name], humbly report: In the primordial era of Vermilion Brightness, the Original Beginning issued sacred texts; the Spirit Kings received their mandates at the void-song of the Azure Palace. Together, they ascended to the Hall of Precious Millet, receiving the edicts of Jade Voice. Charged with proclaiming the celestial decrees and overseeing the Sutra’s salvific power, they thus unfolded the profound mysteries of hidden teachings, making known the subtle truths that even distant and lofty scholars cannot deceive.\n\nTheir great merits were recorded since ancient times, and their boundless blessings should be extended to all who come after. Now, with reverence, I follow Your imperial edicts to solemnly observe the Golden Talisman Great Fast, praying for the extension of Your boundless life and the preservation of Heaven’s eternal existence.\n\nMay the Vermilion Phoenix and Azure Dragon return to the celestial expanse, and may the Crimson Chariot and Green Palanquin descend to this Daoist hall. May Your golden and jade decrees forever sustain the tenfold transformations; may Your silk edicts spread Your words to all sentient beings. Above, I uphold the boundless imperial winds; below, I fulfill the humble prayers of the faithful.\n\nWith this memorial submitted, I pray for Your gracious inspection. May Your compassion extend to the Ten Directions, aligning with the creation of all beings; may Your blessings transcend the Three Realms, fulfilling the merit of protection and elevation.\n\nNow, leading the assembly, we ascend the platform to perform the Sutra rites. The *Hua Xia* chant is invoked; the assembly ascends, offering incense. With faith, we pay homage to the Teacher, maintaining pure intent as prescribed.\n\nThe Nine-Heaven Splendor manifests its radiant glow; the vast cosmos shimmers with the True One’s luminous essence. We direct our offerings to the Central Sovereign, as the hundred spirits descend in response. The roots of suffering are severed; the Eight Hardships are dispelled. The Seven Ancestors ascend together, their blessings towering. Thus, the divine and immortal gather, the Eight Auspicious signs take flight.\n\nThe Supreme Daoist Lord of Primordial Mystery summons forth from within me the thirty-five officials of the Three Five [Celestial Bureaus], the left and right Envoys, the Incense-Bearing Golden Boys, the Speech-Conveying Jade Maidens, and the Five Emperors’ Direct-Symbol Direct-Sun Incense Officials—thirty-two in number—each emerging.\n\nIn accordance with Your command, I now pray that the Supreme Lord may descend and bestow upon me the Ten Directions’ Pure Essence *qi*, flowing into my body, so that my petition may swiftly reach the presence of the Supreme Emperor of the Thirty-Two Heavens, the Original Beginning’s Most August Deity.\n\nI now proclaim my rank: I, [Name], with utmost sincerity, address—\n\nThe Supreme Boundless Daoist Lord of Natural Void and Original Beginning, the Most Mysterious Emperor;\nThe Supreme Lord of Marvelous Non-Being, the Mysterious Sovereign;\nThe Supreme Lord of the Highest Dao, the Celestial Jade Dawn’s Most Sacred Treasure;\nThe Supreme Lord of the Primordial Void’s Ever-Changing Mystery, the Daoist Lord of Virtue and Power, the Most True Emperor;\nThe Jade Emperor of the Highest Heaven;\nThe Lord of Supreme Yang, the Merciful Paternal Daoist;\nThe Lord of the Celestial Treasure, the Maternal Daoist;\nThe Southern Polar Sovereign Emperor;\nThe Northern Polar Purple Micro Emperor;\nThe Lord of Vermilion Mound, the Celestial Decree Savior;\nThe Earthly Sovereign, the Imperial Soil Deity;\nThe Supreme Lords of the Ten Directions’ Boundless Celestial Treasures;\nThe Already-Enlightened Great Saints and Most True Lords;\nThe Thirty-Two Heavenly Emperors;\nThe Lords of Eastern Hua, Southern Polar, Western Spirit, and Northern Truth;\nThe Seven Treasures of the Golden Gate, the Jade Palace, the Seven Precious Towers, and the Purple Micro Upper Palace;\nThe Supreme Lord of the Celestial Treasure’s Most True Manifest Emperor;\nThe Supreme Minister, the Supreme Prime, the Supreme Protector, the Supreme Tutor;\nThe Most High Emperor of the Mysterious Center;\nThe Thirty-Six Departments of Sacred Scriptures;\nThe Great Daoist Master of the Mysterious Center;\nThe Five Emperors and Three Officials, the Four Bureaus and Nine Ministries;\nThe Sun, Moon, and Five Stars; the Southern Asterism and Northern Dipper; the Twenty-Eight Constellations; the Celestial Compass and Jade Balance; the Arrayed Star Spirits;\nThe Ten Directions’ Most True Great Gods;\nThe Flight-Heaven Spirit Kings, the Great Saints of Immortal Life, the Limitless Savior Lords;\nThe True Human of Heavenly Perfection, the Marvelous Conducted Sage;\nThe Three Lords of the Celestial Treasure;\nThe Supervising Fast Master;\nThe Five Emperors Attending the Sutra;\nThe Jade Boys and Jade Maidens, the Sutra-Bearing Jade Lads, the Three Caverns’ Sutra Attendants;\nThe Celestial Treasure Officials, the Three Realms’ Five Emperors, the Great Merit Magical Kings;\nThe Officials of the Three Realms;\nThe Responsive True Spirits.\n\nWith deepest reverence, I pray for Your boundless compassion to turn Your penetrating insight upon us.\n\nI have heard: In the profound and obscure, the Dao cannot be transmitted through words alone;",
      "overlap_context": "ngs shine brightly.*\n\n*May all sentient beings alike share in these merits.*\n\n*I await Your gracious command to perform the Sutra’s rites.*\n\n*Your disciple, though unworthy, dares not violate Your solemn precepts. My devout prayers are beyond expression.*\n\n*With the assembled officials, I ascend the platform and solemnly enact the prescribed rites.*\n\n*[Recitation of the Daoist Invocation to lead the procession to the hall’s entrance]*\n\n**Ritual Proceedings: Invitation of the Spirit King** (降神王)\"",
      "start_char": 368,
      "end_char": 1387,
      "start_sentence": 26,
      "end_sentence": 73,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 15.672295093536377,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\金箓十回度人早朝转经仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "洁净精微，经盖因於义显。 探其妙，则希夷微而莫测； 施之用，则周徧咸而可通。 臣，某猥以肉人，窃观天宝。 当清旦一时之行道，宣玄经四徧以为功。 天地鬼神，谅必鉴精虔之意； 东西南北，庶皆闻微妙之音。 稽首归依，无极大道。 至心归依，十方经宝，当愿众生，心开悟解，受持读诵。 至心归依，十方道宝，当愿众生，起心回向，一切信礼。 至心归依，十方师宝，当愿众生，普上法桥，无有障碍。 宿命赞 侍经开经科，另具 敷座吟 静念如法 叩齿三十二通，思五色云炁，覆满一室。 青龙白虎，朱雀玄武，狮子白鹤，凤凰备守，左右前后。 金童玉女，五帝神仙兵马，各九亿万骑，营卫斋堂； 然后诵经 开经玄蕴咒 云篆太虚，浩劫之初。 乍遐乍迩，或沈或浮。 五方徘徊，一丈之余。 天真皇人，按笔乃书。 以演洞章，次书灵符。 元始下降，真文诞敷。 昭昭其有，冥冥其无。 沈痾能自痊，尘劳溺可扶。 幽冥将有赖，由是升仙都。 请转法轮 师题经 道言，昔於始青天中，云云飞升上清。 目想三十二天，各色云气，交沓之中。 有宫阙楼观，天帝冠冤，衣服分明。 即存神自太皇黄会而始，每天叩齿一通，心拜一过，共三十二过讫。 即闭目静思，三丹田出三色云炁，如丝，渐渐离身。 云炁浓厚，先交络一身，次缠绕所座及几案，无不周徧。 然后蓊郁徧及坛外，围布一方，良久冥合天地。 次思，青龙自肝出，立左； 白虎自肺出，立右； 朱雀自心出； 立前； 玄武自肾出，立后； 狮子自脾下丹田出，十二头立左右； 白鹤自泥丸，九只围列四向。 又存眉间六合； 有日月出自两目，各离面九尺化为九色圆象，洞彻内外，如此分明。 念密咒，勿令耳闻。 咒毕，引东方青炁八道入肝，南方赤炁八道入心，西方白炁八道入肺，北方黑炁八道入肾，须加诚行之。 次诵本章第二回至第九回，不复诵道君大序，止从本章起。 第十回如第一回，诵序，存思。 诵经毕 解座吟 侍经回向，另具 智惠颂 师同斋官旋至东方，捻香再拜 臣恭以八陛旋行，经筵初启； 九重入奏，帝座亲临。",
      "translated_text": "「Pure and refined, the *Sutra* originates from the profound exposition of *Dharma*.\n\nIts subtleties are elusive—mysterious and inscrutable;\nYet its practical application is all-pervading—omnifaceted and accessible.\n\nI, a humble mortal, have observed the Celestial Treasure.\nAt the dawn of a single hour’s Daoic practice,\nI proclaim the *Sutra* of the Four Realms to fulfill its purpose.\nThe earth and heavens, ghosts and gods,\nSurely must perceive my devout and sincere intentions;\nThe four directions—east, west, south, and north—\nMay all hear the subtle and wondrous sounds.\n\nWith deepest reverence, I take refuge in the Limitless Dao.\nWith utmost sincerity, I take refuge in the *Sutra* Treasures of the Ten Directions,\nAnd pray that all beings may open their hearts to enlightenment,\nTo receive, uphold, recite, and study them.\n\nWith utmost sincerity, I take refuge in the Ten Directions’ *Dao* Treasures,\nAnd pray that all beings may arise with pure intent,\nTo pay homage, worship, and offer faith.\n\nWith utmost sincerity, I take refuge in the Ten Directions’ *Sutra* Masters,\nAnd pray that all beings may universally ascend the *Dharma* Bridge,\nEncountering no obstacles.\n\n**The Host of Past Lives Praises:**\nWith the *Sutra*-Attending and *Sutra*-Opening sciences,\nI prepare the *Enthronement Chant*,\nReflecting quietly as the *Law* dictates,\nKnocking my teeth thirty-two times,\nMeditating on the five-colored *qi* clouds,\nFilling the chamber completely.\n\nThe Azure Dragon and White Tiger,\nThe Vermilion Bird and Dark Tortoise,\nThe Lion and White Crane,\nThe Phoenix—all stand guard,\nTo the left, right, front, and rear.\n\nThe Golden Boys and Jade Maidens,\nThe Five Emperors’ divine soldiers and cavalry—\nEach with nine hundred million riders—\nEncamp around the fasting hall.\n\nThen I recite the *Sutra*,\nThe *Sutra*-Opening *Mystic Mantra*—\nFrom the *Cloud-Signs* of the Great Void,\nAt the onset of the vast calamity.\n\nNow distant, now near,\nSometimes submerged, sometimes floating.\nThe five directions hover,\nA span beyond.\n\nThe True Human of Heavenly Perfection,\nPresses the brush and begins to write.\nTo manifest the profound chapters,\nThen to inscribe the *Soul-Symbols*.\nThe Primordial Beginning descends,\nThe *True Text* spreads forth.\nIlluminating what exists,\nConcealing what does not.\n\nThe afflicted may heal themselves,\nThe weary and ensnared find support.\nThe dark and hidden gain reliance,\nThus ascending to the *Immortal Assembly*.\n\nI pray for the turning of the *Dharma* Wheel,\nFor the Master to inscribe the *Sutra*,\nAnd for the *Dao* to speak:\n*\"Once, within the Primordial Azure Sky,\nI ascended the Pure Highness through the clouds.*\n\n*Gazing upon the Thirty-Two Heavens,\nEach filled with colored *qi* clouds,*\n*Overlapping in layers.*\n\n*There are palaces and towers,\nThe Celestial Emperor’s crown and garments,*\n*Distinct and clear.*\n\n*This begins with the Self-Settled Spirit,*\n*At the Great Yellow Assembly of the True Human.*\n*Each Heaven, I knock my teeth once,*\n*Bow my heart once,*\n*Totaling thirty-two repetitions.*\n\n*Then, closing my eyes and meditating,*\n*The Three *Dantian* Fields emit three-colored *qi* clouds,*\n*Like threads, gradually departing the body.*\n\n*The *qi* clouds become dense,*\n*First enveloping my entire form,*\n*Then winding around my seat and table,*\n*Leaving nothing untouched.*\n\n*Next, they expand outward,*\n*Surrounding the altar,*\n*Encircling a region,*\n*And after a long while, merging in obscurity with the heavens and earth.*\n\n*Then I meditate:*\n*The Azure Dragon emerges from the liver,*\n*Standing to the left;*\n*The White Tiger from the lungs,*\n*Standing to the right;*\n*The Vermilion Bird from the heart,*\n*Standing before;*\n*The Dark Tortoise from the kidneys,*\n*Standing behind;*\n*The Lion from the lower *Dantian* beneath the spleen,*\n*With twelve heads standing to the left and right;*\n*The White Crane from the *Nezigong* (泥丸),*\n*Nine birds encircling the four directions.*\n\n*Again, I focus on the *Six Harmonies* between the brows:*\n*There is the sun and moon emerging from both eyes,*\n*Each nine *chi* from the face,*\n*Transforming into nine-colored circular forms,*\n*Piercing through inner and outer,*\n*So clear and distinct.*\n\n*I chant the *Mystic Mantra* in secret,*\n*Without letting it be heard by the ears.*\n*After the chanting,*\n*I draw in the eight pathways of the Eastern Azure *qi*,\n*Eight pathways of the Southern Vermilion *qi* into the heart,*\n*Eight pathways of the Western White *qi* into the lungs,*\n*Eight pathways of the Northern Black *qi* into the kidneys,*\n*With utmost sincerity.*\n\n*Next, I recite the second through ninth sections of this chapter,*\n*No longer reciting the *Dao* Lord’s Grand Preface,*\n*But beginning from this chapter.*\n\n*The tenth section follows the first,*\n*Reciting the Preface,*\n*Reflecting and meditating.*\n\n*After completing the *Sutra* recitation,*\n*I perform the *Dissolution Chant*,\n*The *Sutra*-Attending Reflection,*\n*And prepare the *Wisdom and Benevolence Praise*.*\n\n*The Master and the fasting officials then proceed to the Eastern direction,*\n*Lighting incense and bowing again.*\n\n*I, in reverence, rotate through the Eight Decks,*\n*As the *Sutra* session begins;\n*Entering the Nine Enclosures,*\n*The Emperor’s Seat attends in person.\"*",
      "overlap_context": "r;\nThe Five Emperors Attending the Sutra;\nThe Jade Boys and Jade Maidens, the Sutra-Bearing Jade Lads, the Three Caverns’ Sutra Attendants;\nThe Celestial Treasure Officials, the Three Realms’ Five Emperors, the Great Merit Magical Kings;\nThe Officials of the Three Realms;\nThe Responsive True Spirits.\n\nWith deepest reverence, I pray for Your boundless compassion to turn Your penetrating insight upon us.\n\nI have heard: In the profound and obscure, the Dao cannot be transmitted through words alone;",
      "start_char": 1387,
      "end_char": 2220,
      "start_sentence": 74,
      "end_sentence": 131,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 15.696428775787354,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\金箓十回度人早朝转经仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "恭惟东方无极太上灵宝天尊，东方无极飞天神王长生大圣无量度人君，乘震司春，体元育物。 骞林树下，屡传金口之微言； 黍米珠中，亲受玉京之密印。 伏愿俯回灵鉴，洞察斋忱。 上帝录功，托会朝之闻奏； 东华主算，借化笔之品题。 具有表文，谨当宣告。 宣表关 焚化 侍经宣第二回开经科 敷座吟 请转法论 师题经 众诵毕 解座吟 侍经回向 智惠颂，旋至南方 臣恭以启玉匮篇章，既演经功，而再至对玉阶，只天谅回天，听之有三，恭惟南方无极太上灵宝天尊，南方无极飞天神王长生大圣无量度人君，得一以清，向明而治。 垂世立教，委能尽弘道之心； 监真度生，谅不负修斋之请。 伏愿鉴观诚意，纪录经功。 皇极尊安，惟一人之有庆； 帝图广大，垂万世以无疆。 具有表文，谨当宣告。 宣表关 焚化",
      "translated_text": "With deepest reverence to the **Eastern Limitless Supreme Spirit-Jewel Celestial Venerable Sovereign**,\nThe **Eastern Limitless Flying-Heaven Divine King, Eternal Saint of Boundless Salvation, Sovereign of All**,\nRiding the *Zhen* [thunder] to govern Spring, embodying the Primordial to nurture all things.\n\nBeneath the *Qian* [cypress] grove, You repeatedly imparted the subtle words of the Golden Mouth;\nWithin the *Shu* [millet]-pearl, I personally received the secret seal of the Jade Capital.\n\nMay You condescend to turn Your divine gaze,\nPiercing through the sincerity of this fasting ritual.\n\nThe Celestial Sovereign records merit,\nEntrusting the *Chao* [morning court] audience to bear witness;\nThe Eastern Hua [Celestial Bureau] oversees calculations,\nLending the *Hua* [transformation]-brush to inscribe this offering.\n\nWith the formal petition prepared,\nI now solemnly proclaim it.\n\n**Proclamation of the Petition** – *Burning the Offering*\n**Sutra-Attending Second Session** – *Opening the Sutra Rites*\n**Laying the Seat Chant**\n**Requesting the Transmission of the *Dharma* Discourse**\n**The Master Inscribes the Sutra**\n**The Assembly Recites Complete**\n**Laying the Seat Chant**\n**Sutra-Attending Reflection**\n**Wisdom and Benevolence Praise**,\nThen turning toward the **Southern Direction**.\n\nWith reverence, I unfold the **Jade Treasury Scriptures**,\nHaving fulfilled the Sutra’s merit,\nAnd once more stand before the **Jade Stair**—\nOnly the Heavenly Compassion returns to Heaven,\nListening with threefold grace.\n\nWith deepest reverence to the **Southern Limitless Supreme Spirit-Jewel Celestial Venerable Sovereign**,\nThe **Southern Limitless Flying-Heaven Divine King, Eternal Saint of Boundless Salvation, Sovereign of All**,\nWho attains Oneness to purify, turns toward Clarity, and governs with the *Dao*.\n\nEstablishing teachings for the ages, You entrust the full heart to propagate the Way;\nOverseeing the True to guide sentient beings, You surely will not fail this fasting plea.\n\nMay You observe my sincerity,\nRecording the Sutra’s merit.\n\nThe **Supreme Pole** is secure, blessed by the One;\nThe **Imperial Design** vast, extending eternally without bound.\n\nWith the formal petition prepared,\nI now solemnly proclaim it.\n\n**Proclamation of the Petition** – *Burning the Offering*",
      "overlap_context": "first,*\n*Reciting the Preface,*\n*Reflecting and meditating.*\n\n*After completing the *Sutra* recitation,*\n*I perform the *Dissolution Chant*,\n*The *Sutra*-Attending Reflection,*\n*And prepare the *Wisdom and Benevolence Praise*.*\n\n*The Master and the fasting officials then proceed to the Eastern direction,*\n*Lighting incense and bowing again.*\n\n*I, in reverence, rotate through the Eight Decks,*\n*As the *Sutra* session begins;\n*Entering the Nine Enclosures,*\n*The Emperor’s Seat attends in person.\"*",
      "start_char": 2220,
      "end_char": 2565,
      "start_sentence": 132,
      "end_sentence": 157,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 5.452603578567505,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\金箓十回度人早朝转经仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "侍经宣第三回开经科 节次二回同 旋至西方，上香，再拜 臣恭以三后斯言，粗谙道体； 一诚不息，谅格天心。 恭惟西方无极太上灵宝天尊，西方无极飞天神王长生大圣无量度人君，功在有秋，位居丽泽。 昔浮黎经会，如细雨密雾而来； 今灵宝斋坛，谅飞云浮空而至。 伏愿奏功於玄都之境，纪善於素灵之宫。 圣德日新，与乾坤而并久； 皇图天广，等嵩华以齐尊。 具有表文，谨当宣告。 宣表关 焚化 侍经宣第四回开经科 节次如二回同 旋至北方，上香，再拜 臣恭以玉字龙文，四徧既周於妙义； 琼输羽盖，一时同会於灵坛。 恭惟北方无极太上灵宝天尊，北方无极飞天神王长生大圣无量度人君，其仁如天，曰劳乎坎。 受黍珠之心印，道贯三乘； 广灵宝之宗风，恩沾群有。 伏愿注名金简，纪善玉书。 列宿焕紫微，茂介寿康之福； 六龙降黄道，广覃化育之恩。 具有表文，谨当宣告。 宣表关 焚化",
      "translated_text": "**Third Session of the Sutra Proclamation – Opening the Sutra Rites**\n*(Ritual sequence follows the second session)*\n\nTurning to the **Western Quarter**, offering incense, and bowing twice,\nI, with humble reverence, grasp the teachings of the Three Sovereigns,\nCoarsely comprehending the **Dao**’s essence.\nWith unceasing sincerity, I trust my plea will reach the **Heavenly Heart**.\n\nWith deepest reverence to the **Western Limitless Supreme Spirit-Jewel Celestial Venerable Sovereign**,\nThe **Western Limitless Flying-Heaven Divine King, Eternal Saint of Boundless Salvation, Sovereign of All**,\nWhose merit is ever-renewing, whose station is in the **Luminous Marsh**.\n\nIn days past, the **Floating Lotus Assembly** gathered like fine rain and dense mist;\nNow, at the **Spirit-Jewel Ritual Altar**, You surely descend like clouds floating in the void.\n\nMay You record merit in the **Mysterious Capital’s** realm,\nAnd inscribe virtue in the **Pure Spirit’s** hall.\n\nYour **sacred virtue** ever-renews, enduring alongside Heaven and Earth;\nYour **Imperial Design** vast as the heavens, equal in honor to **Songshan and Huashan**.\n\nWith the formal petition prepared,\nI now solemnly proclaim it.\n\n**Proclamation of the Petition** – *Burning the Offering*\n\n---\n\n**Fourth Session of the Sutra Proclamation – Opening the Sutra Rites**\n*(Ritual sequence follows the second session)*\n\nTurning to the **Northern Quarter**, offering incense, and bowing twice,\nI, with humble reverence, grasp the **Jade Script Dragon Text**,\nIts profound meanings now fully encompassing the four directions;\nThe **Jade Tripod and Feathered Canopy** gather in unison at the **Spirit Altar**.\n\nWith deepest reverence to the **Northern Limitless Supreme Spirit-Jewel Celestial Venerable Sovereign**,\nThe **Northern Limitless Flying-Heaven Divine King, Eternal Saint of Boundless Salvation, Sovereign of All**,\nWhose kindness is as boundless as Heaven—\n*\"Laboring in the Abyss\"* (曰劳乎坎).\n\nReceiving the **Heart Seal of Millet-Pearls**, the **Dao** permeates the **Three Vehicles**;\nSpreading the **Spirit-Jewel Sect’s** teachings, Your grace extends to all sentient beings.\n\nMay You inscribe my name upon the **Golden Tablets**,\nAnd record virtue in the **Jade Scripts**.\n\nThe **Luminaries** shine in the **Purple Micro**, bestowing longevity and prosperity;\nThe **Six Dragons** descend upon the **Yellow Path**, broadly bestowing nurturing grace.\n\nWith the formal petition prepared,\nI now solemnly proclaim it.\n\n**Proclamation of the Petition** – *Burning the Offering*",
      "overlap_context": "overns with the *Dao*.\n\nEstablishing teachings for the ages, You entrust the full heart to propagate the Way;\nOverseeing the True to guide sentient beings, You surely will not fail this fasting plea.\n\nMay You observe my sincerity,\nRecording the Sutra’s merit.\n\nThe **Supreme Pole** is secure, blessed by the One;\nThe **Imperial Design** vast, extending eternally without bound.\n\nWith the formal petition prepared,\nI now solemnly proclaim it.\n\n**Proclamation of the Petition** – *Burning the Offering*",
      "start_char": 2565,
      "end_char": 2946,
      "start_sentence": 158,
      "end_sentence": 185,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 6.326487064361572,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\金箓十回度人早朝转经仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "三闻经 发愿 复炉如故 仙灵仙官、金童玉女、五帝五岳神仙真人、三炁正神、左右龙虎君、天仙地仙，五灵香官，当今召致十方正炁，自然生金液丹碧芝英。 百灵众真，交会在此，香火炉前。 当愿十方仙童玉女，侍卫香烟，传臣向来所启之言，速达径御无上三十二天元始上帝至尊几前。 存四灵，各还五藏十方天真，腾云而去。 次以三色云气，咽下三丹田，叩齿三通，咽液三过。 直坛引下坛，诣幕谢师 师上香再拜 具位臣某虔诚上启灵宝玄中大法师真君，灵宝经师君、籍师君、度师君，正一天师君，女师嗣师系师君，灵宝监斋大法师真君，赤明开图、黍珠授受一派宗师。 恭望师慈，俯观谢悃。 臣向来，引领官众，升坛转诵《太上洞玄灵宝无量度人上品妙经》第一徧至第四徧，幸以周圆，径为祝延万寿，保天长存。 仰荷师恩，冥扶默相。 谨伸谒谢，尚冀成终。 俟琅函卷轴之时，至玉辖回鸾之日，还功报德，镂骨铭心。 上弘灵宝之科，以广慈悲之化。 臣等干冒师严，下情无任，不胜战栗之至。 向来 念善",
      "translated_text": "**Sutra of the Three Hearings – Vow of Renewal**\n\n**The Furnace Restored as Before**\n\nThe **Celestial Worthies and Immortal Officials**, the **Golden Boys and Jade Girls**, the **Five Emperors and Five Sacred Peaks’ Immortals and True Persons**, the **Three Qi Orthodox Deities**, the **Left and Right Dragon-Tiger Lords**, the **Heavenly and Earthly Immortals**, the **Five Spirit Officials of Fragrance**—\n\nNow, by summoning the **Ten Directions’ Orthodox Qi**, the **Golden Elixir** and **Jade Grass** naturally arise, their **spirit-petals** blooming.\n\nThe **Hundred Spirits and True Ones** gather here before the **Incense-Fire Furnace**.\n\nI now vow that the **Ten Directions’ Immortal Boys and Jade Girls** shall attend to the **fragrant smoke**, conveying my previous petition directly to the **Supreme Emperor of the Thirty-Two Heavens, the Original Beginning Dao/Way’s Most Exalted Sovereign**.\n\n**Preserve the Four Spirits**, each returning to their **Five Viscera and Ten Directions’ Heavenly True Selves**, ascending upon the clouds and departing.\n\nNext, with **three-colored clouds**, swallow into the **Three Elixir Fields**, strike the teeth **three times**, and swallow the saliva **three passes**.\n\n**Directly descending from the Upper Platform to the Lower Platform**, I go to the **curtain to thank the Teacher**.\n\n**The Teacher offers incense and bows twice**.\n\nWith utmost reverence, **Your humble servant [Name]**, in sincere devotion, now humbly presents this petition to:\n\n**The True Lord of the *Lingbao* Mystic Middle Great Dao Master**,\n**The *Lingbao* Sutra Master Lord, the Register Master Lord, the Salvation Master Lord**,\n**The Orthodox Celestial Master Lord**,\n**The Female Lineage, Successor, and System Master Lord**,\n**The *Lingbao* Supervising Fasting Great Dao Master True Lord**,\n**The *Chiming* Opener of Diagrams, the Millet-Pearl Transmission Lineage’s Patriarch**.\n\nWith deepest reverence, I **behold Your Teacherly kindness**, humbly gazing and offering gratitude with sincerity.\n\n**Your humble servant**, in past days, led the **official assembly**, ascending the platform to recite the *Supreme Dao/Way’s Mystic *Lingbao* Sutra of Boundless Salvation for the Upper Grade* from the **First Pervasion to the Fourth Pervasion**, fortunate in its completeness, directly praying for **Ten Thousand Years of Longevity** and **Heaven’s Eternal Preservation**.\n\nBy **Your Teacher’s grace**, I am **secretly upheld and silently guided**.\n\nNow, I **extend my thanks in reverence**, still hoping to fulfill the end.\n\nAwaiting the time of **the Lingering Phoenix’s Scrolls** and the day of **the Jade Halter’s Return**, I shall **repay virtue with virtue**, engraving it upon **bone and heart**.\n\n**Above, I propagate the *Lingbao* doctrines** to **broaden the Dao/Way of Compassion**.\n\nYour humble servants **dare to trespass upon Your Teacher’s severity**, our **lowly sentiments know no bounds**—we are **utterly trembling with awe**.\n\n**Past deeds, mindful of virtue.**",
      "overlap_context": "Vehicles**;\nSpreading the **Spirit-Jewel Sect’s** teachings, Your grace extends to all sentient beings.\n\nMay You inscribe my name upon the **Golden Tablets**,\nAnd record virtue in the **Jade Scripts**.\n\nThe **Luminaries** shine in the **Purple Micro**, bestowing longevity and prosperity;\nThe **Six Dragons** descend upon the **Yellow Path**, broadly bestowing nurturing grace.\n\nWith the formal petition prepared,\nI now solemnly proclaim it.\n\n**Proclamation of the Petition** – *Burning the Offering*",
      "start_char": 2946,
      "end_char": 3374,
      "start_sentence": 186,
      "end_sentence": 205,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 7.042413949966431,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\金箓十回度人早朝转经仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "金箓十回度人早朝转经仪竟",
      "translated_text": "**\"The Golden Talisman Tenfold Rites of Early Morning Scripture-Recitation for Salvation are now complete.\"**",
      "overlap_context": "verence**, still hoping to fulfill the end.\n\nAwaiting the time of **the Lingering Phoenix’s Scrolls** and the day of **the Jade Halter’s Return**, I shall **repay virtue with virtue**, engraving it upon **bone and heart**.\n\n**Above, I propagate the *Lingbao* doctrines** to **broaden the Dao/Way of Compassion**.\n\nYour humble servants **dare to trespass upon Your Teacher’s severity**, our **lowly sentiments know no bounds**—we are **utterly trembling with awe**.\n\n**Past deeds, mindful of virtue.**",
      "start_char": 3374,
      "end_char": 3389,
      "start_sentence": 206,
      "end_sentence": 206,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 0.471712589263916,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\金箓十回度人早朝转经仪.txt",
        "category": "威仪类"
      }
    }
  ]
}