{
  "source_id": "长生胎元神用经",
  "source_file": "chunked_daozang\\长生胎元神用经.json",
  "total_chunks": 6,
  "total_original_chars": 7348,
  "total_translated_chars": 44860,
  "total_translation_time": 137.19161128997803,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\长生胎元神用经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The *Scripture of the Dao/Way on Nurturing the Primordial Qi for Longevity***\n\n**Title:** *Scripture of the Dao/Way on Nurturing the Primordial Qi for Longevity*\n**Attributed to:** Tang-dynasty Master Lang (野人郎肇注).\n**One scroll.**\n**Source of the base text:** *The Orthodox Daoist Canon* (正统道藏), First Section (正一部).\n**Cross-referenced editions:** *The Daoist Canon: Selected Essentials* (道藏辑要), included in Volume 11 of the *Collected Works* (斗集) [hereafter cited as *Selected Essentials*].\n\n**The Scripture of the Dao/Way on Nurturing the Primordial Qi for Longevity**\n**Annotated by Master Lang of the Wild**\n\nThe Master said: *\"He who knows the Supreme Dao/Way is not cut off by Heaven, he who cultivates the Primordial Qi is not extinguished by Earth.\"* The Supreme Dao/Way is not distant; it lies within one’s own body. With a refined and subtle mind, life will endure.\n\nMaster Liu’s *Secret Teachings* (秘旨) state: *\"To attain Longevity, one must cultivate that which gives birth to it.\"* The method of cultivation begins with the subtle refinement of Qi. When Qi coalesces into form, form becomes the foundation of receiving Qi, while Qi is the root origin of form. By observing how the Primordial Qi nourishes form, one may discern the principle of form’s dissolution.\n\nThe Scripture says: *\"Deep-rooted and firmly established, the Dao/Way of Longevity and enduring vision.\"* The Primordial Qi is the root foundation of the body. If one firmly establishes the Primordial Qi, the Dao/Way of Longevity will naturally unfold.\n\nWithin the form, there are the *yin* and *yang* (子母), why not guard them? For, the Qi serves as the *yin* (母) of the Spirit, while the Spirit is the *yang* (子) of the Qi. The *yang* (子) arises from the Qi of breathing, hence it is called the *yin* (母). Once the Qi of form is established, the Spirit emerges, thus the Spirit is called the *yang* (子).\n\nThe Qi of breathing originates from the *Mysterious Female* (玄牝) [i.e., the lower *Dantian*]. The nostrils govern the intake of pure, *yang* Qi, while the mouth governs the exhalation of impure, *yin* Qi.\n\nTo practice cultivation, one must first extinguish all thoughts, sever external concerns, and internally safeguard the True Spirit. Before each session of cultivation, one must first harmonize the Qi.\n\nThe method of harmonizing Qi is as follows: subtly inhale through the nostrils to draw in the pure, *yang* Qi, and subtly exhale through the mouth to release the impure, *yin* Qi. After ten or twenty breaths, close the mouth and allow the Spirit-Qi to flow continuously in and out without effort.\n\nThe Qi inhaled through the nostrils should be imagined as descending to the *Primordial Pearl* (玄珠) of the lower *Dantian*, enveloping and merging in all directions. Then, regard the *Primordial Pearl* as the sovereign of the lower *Dantian*. Do not allow any extraneous thoughts to arise, for such thoughts will disrupt the process. With persistent practice, the Qi will naturally condense into a pearl, and this is the *yin* (母).\n\nOnce the *yin* (母) is established, the *yang* (子) will naturally follow. The speed of attainment depends on one’s resolve. Do not dwell on external matters; focus the mind solely on the Spirit. Swiftly achieve Longevity, and the goal is attained.\n\nWhen the Spirit and Qi unite, guide them with intention, circulating through the viscera and bowels, riding the breath upward and downward. With prolonged practice, the Spirit will grow luminous and the Qi harmonious, illuminating the Five Zang Organs.\n\nAfter mastering the subtle techniques, one may internally perceive the True Spirit. When the Qi is harmonized and fully permeates the Four Limbs, it moves according to the will and can also heal others’ ailments.\n\nThe Yellow Emperor cultivated internal vision for three months and thereby gave birth to the Spirit. The Spirit of the Heart then transforms and generates, weaving through the Five Zang Organs. These words may be extrapolated to reveal their meaning.\n\nThe Yellow Emperor attained this secret and, after three months of internal vision, his Spirit was complete. Thus, he was born from Heaven.\n\nLiezi attained it after nine years and thereby became enlightened. The swiftness or delay depends on one’s resolve.\n\nThe Primordial Qi follows the will; stillness brings its attainment. When the Qi flows freely through the Dao/Way, the body naturally grows strong. The *Primordial Pearl* is the sovereign, and the Spirit becomes luminous.\n\nIn the present age, people allow the Spirit and Qi—*yin* and *yang*—to move independently, neither guarding the other. Although they breathe internally, their Spirit is constantly expended externally. Such methods only cause the Primordial Qi to scatter and lose its sovereign power, for if it does not flow fully, the Essence will dissipate.\n\nMoreover, people regard the Spirit as the master and the form as the dwelling. If the master does not tend to the dwelling but instead is always occupied externally, the dwelling will inevitably become empty and the body decay. As for the methods of this age, within the hundred *ke* (刻) of day and night, the Qi within the form totals thirteen thousand five hundred breaths, amounting to eighty-one thousand inches in length. All of these breaths exhaust the Spirit-Qi externally, leaving none to reside within, so how can one hope for Longevity?\n\nThe Master said: *\"If the Spirit-Qi governs the circulation of the *yin* and *yang*, then one attains Longevity and immortality. If there is no sovereign control, and one merely follows natural breathing, the Qi will only serve to nourish the viscera and digest food, unable to return the *yin* to the *yang* or replenish the blood and marrow.\"*\n\nBy attaining this method of breathing cultivation, the Primordial Qi condenses into an embryo. Within the embryo lies the Spirit, which preserves the Primordial Qi. If one has not yet attained this secret, the Qi will lack sovereign control, and all efforts will be in vain. One will only exhaustively practice breathing without penetrating to the root of receiving Qi, and the Primordial Qi will disperse among the Four Limbs, causing the flesh and skin to wither.\n\nThe Master said: *\"I regard the Spirit as the chariot and the Qi as the horse, driving them ceaselessly throughout the day without fatigue.\"* Always imagine the Spirit and Primordial Qi as united, moving according to the will without ceasing, hence they are called the chariot and the horse.\n\nHe also said: *\"When the Spirit drives the Qi, the nostrils do not lose their breath.\"* His words are profound!\n\nThe Spirit resides within the *Primordial Pearl*. It constantly governs the Primordial Qi in each inhalation and exhalation, always internally perceiving the True Spirit. Hence, it is called the sovereign control, uniting the Spirit and Qi so that the nostrils never lose their breath.\n\nThe method of driving the Qi extends from the *Nihuan* (泥丸) [upper *Dantian*] to the *Mingmen* (命门) [lower *Dantian*]. The *Nihuan* is located in the brain, serving as the upper *Dantian*. The *Mingmen* is three inches below the navel; the *Huangting Scripture* (黄庭经) states: *\"Behind lies the secret door, before the birth gate.\"* It is near the end of the lumbar spine, thus identifying the lower *Dantian*.\n\nThe Supreme Dao/Way of the Immortal Scriptures now reveals the *leakage* [of Qi], inspired by this teaching. The two *Dantian*s [upper and lower] are like lotuses in communion, capable of rescuing the aged and infirm.\n\nWhen the Primordial Qi of the lower *Dantian* is fully nurtured, it ascends in reverse, entering the *Nihuan* [upper *Dantian*]. This is called *Returning the Essence to Nourish the Marrow* (还精补脑), hence the saying: *\"The two *Dantian*s are in communion.\"*\n\nIf one cannot inhale with the Spirit as sovereign, not a single breath is complete. If one cannot exhale with the Spirit as sovereign, not a single breath is complete. If the Spirit and Qi are constantly united within each breath, then the Spirit and Qi are fully preserved.\n\nThe cultivation of *Qi* begins with its emission as breath. Inhalation is taken through the nostrils, imagined to reach the Primordial Pearl (*Xuanzhu*) of the lower *Dantian*, where it unites with the Spirit.\n\nOnly when the mind and abdomen are pure, and the eyes observe the breath, can one in meditation perceive the true Spirit and thus achieve a complete breath. If the gaze wanders and external thoughts arise, the Spirit follows the will outward, seeing only external matters, and the internal *Qi* fails to govern—this is called an incomplete breath.\n\nMoreover, it is said: *\"The embryo forms from the gathering of *Qi* within the abdomen. *Qi* within the embryo breathes.\"* If the embryo is formed internally, one cannot seek death. When *Qi* gathers within the embryo, it breathes—this is the meaning of *Returning the Essence* (返覆).\n\nBy inhaling through the nostrils and sending *Qi* down with the intention, prolonged practice will naturally condense and form the embryo. The embryo is formed from the gathering of Primordial *Qi*, and within it, *Qi* breathes—though this breath is imperceptible.\n\nThe child is like the Spirit, and the person is like one initially receiving the embryo, gradually taking form.\n\nThe Immortal Scriptures state: *\"After success, men close the *Guanyuan* [Gate of Origin] to gather *Jing* [Essence], while women’s *Tai* [embryo] and *Ze* [Sea] do not form the fetus.\"* Though moved by desire, one cannot contend with the Spirit—this is the embryo’s true essence, the *Returning of Essence* as Spirit. This is the *Shangqing* [Upper Clarity].\n\nThe key to self-cultivation lies in mastering the interplay of *Yin* and *Yang*, uniting their true nature. Every night, after midnight and before the fifth watch (when sleep first comes), first use the tongue to rinse and cleanse between the lips and teeth, expelling three mouthfuls of turbid saliva. Then inhale through the nose the pure, cold *Qi*, drawing it into the chest and diaphragm. Expel three to five mouthfuls of stale *Qi* that has accumulated from the previous day, and after a while, swallow.\n\nWhen lying down, stretch out both hands and feet, strike the teeth nine times, then follow the usual method of inhaling and exhaling, though not too deeply. Wait until the breathing *Qi* is even, neither leaving the body nor entering from outside. Close the *Qi*, swallow the Primordial *Qi* once, and with the hands, guide the *Qi* downward as you massage, drawing it to the *Qi* Sea (*Qihai*). After twenty days, when the *Qi* flows smoothly, add one swallow. After two months, add another, until one swallow suffices for three breaths. After a year, one swallow suffices for four breaths—no harm will come from this.\n\nEach day, after the child hour (*Zi*) and before noon (*Wu*), swallow on an empty stomach. At other times, swallow ten or five breaths, but never inhale external *Qi*. Before the child hour and after noon, swallowing is forbidden.\n\nThe *Classics* say: *\"After the child hour and before noon all belong to *Yang*; before the child hour and after noon is called *Yin*.\"*\n\nFor those who cultivate the *root of rest* (*Xugen*), at mealtime, rinse the mouth and imagine two streams of white *Qi* emerging from the upper *Dantian*, as thick as cloth strips, flowing down the neck to the spine, entering the *Qi* Sea below the navel. Gradually gather the *Qi* until it is the size of a goose egg, a fragrant cluster, naturally dispelling hunger. Avoid distractions, lest the nature be disordered.\n\nFor illness such as dry mouth, sticky tongue, or throat obstruction, these are signs of extreme heat in the upper burner (*Shangjiao*). At the fifth watch, inhale through the nose the pure, cold *Qi* into the chest and diaphragm, then expel it through the mouth three to five dozen times, or even a hundred or two. Gradually, one will feel sweetness in the mouth—this is the heat dispersing. Then cease, but do not overdo it.\n\nIf the *Water* (*Shui*) is cold, at dawn, inhale through the nose to block *Yang* *Qi*, and exhale through the mouth a hundred or so breaths of clear *Qi*. For any painful ailments—whether from snake venom, bites, or injuries by wolves or dogs—simply sit or lie still, close the *Qi*, and focus the intention. Direct the *Qi* to attack the afflicted area for a hundred or two repetitions, and all will heal.\n\nIn winter, for cold feet (*Ling*), swallow the hot *Qi* and imagine it flowing down to the soles, warming them before ceasing.\n\nIf one drinks alcohol and suffers from intoxication, simply expel through the mouth the toxic force (*Du*) that arises with the vessel’s rotation, and one will not become drunk.\n\n*Chi* *Shui* refers to saliva; *Xuanzhu* refers to *Qi*; *Qi* is the Spirit.\n\nWhen practicing, face north or south while seated, upright and eyes closed. With the gaze, imagine the lower *Dantian*—three inches below the navel, within the space of the two kidneys, three inches wide—where the *Qi* is green on the left, yellow on the right, white above, and red below, with *Qi* itself being crimson within.\n\nThe oral formula says:\n*\"Great as a bullet, yellow as an orange, with radiant flame,\nAbove—one crimson child, named *Yuanxian*, styled *Dijing*;\nMiddle—one True Person, named *Zidan*, styled *Guangjian*;\nBelow—one infant, named *Yuanyang*, styled *Guyuan*.\nEach Spirit-body is three inches long,\nWearing crimson robes and shoes,\nSeated on a golden throne,\nHolding a golden censer and jade ladle.\nBy day, they reside in the upper *Dantian*;\nBy night, they dwell in the lower *Dantian*.\nThis is the *Yindan* [Embryonic Elixir] of seven returns—\nWater, saliva, blood, essence, marrow, and *Qi* of the brain.\"*\n\nTo nourish the Spirit, one must first nourish the *Qi*;\nTo nourish the *Qi*, one must first nourish the brain;\nTo nourish the brain, one must first nourish the essence;\nTo nourish the essence, one must first nourish the blood;\nTo nourish the blood, one must first nourish the saliva;\nTo nourish the saliva, one must first nourish the water.\n\nWater is the five-flavored essence of saliva,\nThe refined essence of the five tastes,\nLocated beneath the tongue, beside the two teeth,\nCalled the *Water Pool* (*Shuichi*).\n\nWhen swallowed into the lung’s channel, it transforms into saliva;\nWhen saliva enters the heart’s channel, it becomes blood;\nWhen blood, after two hundred and fifty days, enters the kidney’s channel, it turns into essence;\nWhen essence enters the brain’s channel, it forms the *Nihuan* [Embryonic Palace].\n\nWithin the palace are two channels,\nFlowing beside the spine downward into the *Heihai* [Black Sea].\nThe Black Sea’s sovereign is clarity and wisdom.\n\nThe True Person says:\n*\"The Immortal’s greatest taboo is anger;\nDo not recklessly leak words.\nThe wise ruler keeps this secret.\"*\n\n**Guiding and Pulling Formula:**\nClasp the hands as if washing the face, then rub them together until they are warm, wiping the face until the skin wrinkles. Like a warrior drawing a stiff bow, pull left and right three times. Clench the fists and strike forward and backward several times, then lift both hands upward as if supporting a thousand-pound stone, alternating left and right.\n\nSit upright, fists clenched, and lean the body sideways like a mountain being pushed aside, alternating left and right. Slowly extend the fists forward, then swiftly retract them backward.\n\nThe **Running Embrace of the Head** is called the *Chouguan* [Drawing the Lock] technique.\nClench both fists against the earth, curl the body and arch the spine, raising and lowering the fists three times. Each time, return to strike the back three times. Sit upright, extend the legs, and with hands crossed behind, pull backward several times. Stand, cross the hands at the waist, and twist the body backward three times.\n\nWarm the palms and rub them over the soles of the feet and knees. Without rising, cross the arms behind the neck and strain with force several times. Stretch and extend, then retract and shake to open the *bai guan* [hundred passages].\n\nWarm the palms again, cover the eyes, and draw them forward to the ears, rotating the ears thirty times—practice this often. Warm the palms, press the sides of the nose, close the eyes, and breathe. When *qi* flows freely, stop.\n\nThe True Person says:\n*\"At the time of longevity, before noon, swallow the saliva seven times, close the eyes, and sit levelly. Internally visualize the five *zàng* [solid organs] and six *fǔ* [hollow organs].*\nIf practiced diligently over time, clarity will naturally arise.\n\nWhen first practicing the *Heihai* [Black Sea], one must focus on what the ears hear and what the mind thinks. Gradually, this arises with three breaths, five breaths, and a slow exhalation. If one stops at twelve breaths without exhaling, minor harmony is achieved. If one stops at one hundred twenty breaths without exhaling, great harmony is attained.\n\nDuring fasting and rest, cultivate the sun and moon within the mouth: by day, cultivate the sun; by night, cultivate the moon. They are as large as a ring—the sun’s color is red, with a purple nine-rayed light; the moon’s color is yellow, with a white ten-rayed light.\n\nCultivate the sun and moon within the *Mingtang* [Hall of Light]: the sun on the left, the moon on the right. Always cultivate the *ke* [essence] of the sun and moon’s rays as a black liquid, like sleeping with the sun on the forehead and the moon beneath the navel. If the body feels uneasy, press the tongue against the throat, swallow the saliva several times, then rest.\n\nWhere the *Heihai* resides, follow the birth of the *shen* [spirit]. When the spirit is present, the *Heihai* forms; when the spirit departs, the *Heihai* becomes empty.\n\nThe *Heihai* is the true *qi* of the twenty-four spirits. The *Heihai* forms the spirit, and the spirit forms the *Heihai*.\n\nWhen the *Heihai* disperses, it becomes mist; when it condenses, it becomes form and shadow. Externally, it transforms into an Immortal; internally, it transforms into the True One. Above, it binds the *San Yuan* [Three Origins]; below, it binds all things, cultivating the *Yi Zhen Jun* [One True Venerable].\n\nRecite the invocation while closing the eyes: Cultivate all hundred spirits into white *Heihai*, like a *yin* [female] emerging from the *Xuan Zhu* [Mysterious Pearl] through the *jing kong* [passage], entering my mouth. After lingering, feel the white *Heihai* descend through the *jing kong*, exit the soles of the feet, the feet’s center, and the *guan lian* [crown of the head], permeating the entire body with the white *Heihai* for a long time. The white *Heihai* suddenly transforms into purple clouds, lingering before entering my mouth, descending into the head, filling the five *zàng*, and saturating the abdomen. It then exits through the soles of the feet and palms, descending to the *jing kong* and *guan lian*. The body lingers as the purple clouds merge, and the form becomes indistinct.\n\nAfter a moment, again cultivate the purple *Heihai* filling the left and right chambers. Then visualize *feng qi* [wind *qi*] emerging from the mouth, fanning the purple clouds until they swirl and form a True Person—a male figure three inches tall, named *Dadong Di Yi Zun Jun* [Great Cavern Emperor, One Venerable Lord].\n\nAgain, visualize the Venerable Lord entering my mouth beneath the tongue, ascending to the *Zifang Gong* [Purple Chamber Palace] within the *Liu He* [Six Harmonies]. He sits facing outward, holding the *Zhao* [Manifestation] of the Five *Ji* [Records] in his left hand and the Five *Fu* [Symbols] in his right. On the left side of his mouth shines the sun’s nine-rayed light; on the right, the moon’s lingering light—sometimes white, sometimes red. The luminous *Heihai* descends into the five *zàng*, six *fǔ*, and hundred joints, filling the body like the sun. Recite the incantation with the heart:\n\n*\"Great Cavern Emperor One,\nToo Subtle and Venerable,\nFather Serene, Mother Still,\nTwo merging, dual unity,\nHundred Truths in great chaos,\nOne return, nature born,\nBody binds the Eight *Yin*,\nTransforming into the Primordial Infant,\nSun and moon’s precious light,\nMoving my form,\nTaiyi above,\nWilling to align with the Emperor,\nNihuan’s precious jade,\nFive *zàng* radiant,\nLong united with sun and moon,\nHolding the Cavern Scripture,\nStanding as the Immortal Lord,\nSpirit ascending to Shangqing,\nThirty-nine youths,\nFully corresponding to the Yu Ting [Jade Court].\"*\n\nAlways cultivate the *Dadong Di Yi Zun Jun* within the upper lip, beneath the nose, and between the inner and outer teeth. In sitting, standing, or moving, keep this in mind. The Venerable Lord’s mouth holds the sun and moon, illuminating the ten thousand caverns.\n\nBefore practicing *qi*, first cultivate the candle flame in the heart, burning through the body above and below, dispelling the *qi* toxins of the five grains. If not burned, cold will cling; if burned too long, it will cause agitation. After cultivating the flame, begin *qi* practice without distraction. Let the *qi* flow subtly—it will naturally permeate. Guide it with intention.\n\nTo practice the *qi* method, first reduce food intake gradually—do not do so abruptly. After a year, the *qi* will be full, and hunger will naturally vanish.\n\nThe six *shen* of the kidneys are:\n*Siji* [Master of Ceremonies], *Silu* [Recorder], *Siming* [Master of Fate], *Sili* [Supervisor], *Xiaowei* [Marshal], and *Qing* [Minister].\nLeft and right, they divide into eight hundred fifty.\n\nThe *jingling* [precise and numinous] *qi* of the sun and moon is the root of humanity. The left is the *Xuuanmiao Jun* [Mysterious and Subtle Lord], the right the *Xuuan Yuan Jun* [Primordial Lord].\n\nThe *Xuuan* and *Yuan* [Void and Origin] generate each other; cold and heat complete each other.\n\nMaster *Chonghe* instructed the *Longgang* [Dragon Ridge] *qi*-cultivation method:\n*\"What the form relies upon is *qi*; what *qi* depends on is the form. When *qi* is complete, the form is whole; when *qi* is exhausted, the form dies. Thus, those who nurture life refine both form and *qi* to preserve existence. There is no form without *qi*, nor *qi* without form. The two are inseparable—is this not clear?\"*\n\nI have long admired the Dao, searching through scriptures and histories, practicing restraint for over ten years. What I have seen and heard has never fully satisfied me.\n\nDuring the *Dali* era, I encountered *Lao Fu Wang Gong* [Master of Lao Fu] returning from *Bei Yue* [Northern Peak], leaning on his staff at the post station, gazing at me as before.\n\nI deemed him a singular man and invited him to converse, and indeed he proved to be a virtuous sage of the Dao.\n\nPitying my earnest resolve, he immediately bestowed upon me the methods of *tuna*—breath refinement and *zhentian*—cultivation of the True—transmitting them all verbally.\n\nHe spoke of the *Five Teeth* and *Six Characters* methods, as well as all *xī* [circulation] practices, as means of *shōu qì*—gathering *qi*.\n\nGathering *qi* is vigorous and forceful, not suited to ordinary mortals.\n\nAs for *nà qì*—receiving *qi*, it is the *tāixī*—embryonic breathing. Only *xíng qì*—conducting *qi* is the true Dao, the foundation of self-cultivation.\n\n**The Method of Advancing *Qi*:**\nFor those who wish to refine *qi*, first, one must dwell in a lofty, secluded chamber, burning *lùxiāng*—aloewood—on either side, using a thick, soft cushion three to four inches high for reclining, with a pillow one inch high. After midnight, when *qi* first stirs, or at dawn, when waking, exhale nine times from the abdomen to purge its turbid *qi*. If one wishes to regulate breathing, it need not be at midnight or dawn, but rather when the celestial *qi* is gentle and the abdomen is empty.\n\n**Conducting and Circulating *Qi*:**\nClose the eyes, strike the teeth thirty-six times to awaken the body’s spirit, press the hands against the outer corners of the eyes, then the sides of the nose, rotate the ears and stroke the face, and lift the *guān*—passages—to support the *shí*—stone (anus). Gradually guide and invigorate all joints, then press the tongue against the palate to gather saliva. Once the mouth is filled, swallow three times, directing the *qi* to the five *zàng*—viscera, making the face radiant. Then, relaxed and at ease, let the mind expand freely, as boundless as the void, casting off all burdens. Only then may one practice *tāo*—refining *qi*, closing the mouth firmly to seal the *Xuánfáng*—Mysterious Chamber (vagina) and retain the essence.\n\nFor beginners, before *qi* flows freely, one must not yet practice retention. After one hundred days to half a year, when the spirit-*qi* circulates smoothly and sweat appears, then retention may begin.\n\n**The Method of Refining *Qi*:**\nEach of the five *zàng* has its own spirit. At night, when closing the breath externally, if one feels *qi* rising after refinement, first stir the abdomen to expel stale food and old *qi*. Then, regulate the pulse: lie on your back, close the eyes, retain the breath, clench the fists at the sides of the breasts, straighten the knees, lift the back and torso, and close the *qi* to stir the *Hǎi*—Sea (lower abdomen). Make the internal and external *qi* rotate, exhaling nine times before regulating it.\n\n**The Method of Regulating *Qi*:**\nThe art of regulating *qi* lies in swallowing.\n\nCommon folk mistake external *qi* for internal *qi*, unable to distinguish. *Tūnà*—breathwork—must be practiced in seclusion, lest the nature be misused.\n\nThus, knowing that humans are born of Heaven and Earth, the body inherently possesses primal *qi* and its principles. Each time one swallows and receives, the internal *qi* harmonizes with the external. Naturally, the *Hǎi*—Sea’s *qi* responds, rising and falling with the sun and moon. At the moment of inhalation and exhalation, close the mouth swiftly and swallow, making a resonant, gurgling sound—*shuìshuì*—as if water dripping into a vessel, distinctly audible. First, guide it down the left side through twenty joints, like water seeping into a well. Then, from the right, thus making the internal *qi* luminous. With intent, send it downward, using the hands to assist, directing it into the *Qìhǎi*—Sea of *Qi* (lower abdomen, three inches below the navel), also called the *Xià Dāntián*—Lower Elixir Field.\n\nFor beginners, the upper *jiāo*—burner is not yet open. Use the hands to assist, swiftly guiding the *qi* down the throat. If it does not descend easily, use slight force to press and swallow, ensuring a sound as it descends. If the *qi* flows freely, no assistance is needed.\n\nThree swallows with the mouth closed, followed by two dry swallows, is called *Yúnxíng*—Cloud Movement. One wet swallow, taking saliva and swallowing it, is called *Yǔshī*—Rain Application.\n\nFor beginners, before *qi* flows freely, practice two swallows followed by *Yǔshī*. Only later will three swallows be achieved. A year of diligent practice yields minor success; two or three years bring great achievement.\n\n**The Method of *Xī* Circulation:**\nNear the Lower Elixir Field are two orifices leading to the spinal *mài*—vessels, connecting to the *Níwán*—Mud Pellet (pineal gland). The *Níwán* governs the brain.\n\nAfter three swallows, swiftly store the primal *qi* in the Lower Elixir Field. With intent, imagine this *qi* entering the two orifices, forming two white *xī*—circulations—along the spine, ascending into the *Níwán*. This steams and nourishes all the palaces, making the hair and skin of the head, neck, arms, hands, and fingers bristle. Then, it descends into the chest, the five *zàng*, the skin, and the Middle Elixir Field—heart palace—sequentially irrigating them before returning to the Lower Elixir Field. It passes through the *Sān Sān Xīng*—Three-Three Stars (perineum), down to the knees and ankles, reaching the *Yǒngquán*—Gushing Spring (sole).\n\nThus, dividing one *qi* to govern all, stirring it like thunder and nourishing it like wind and rain—just as Heaven and Earth possess springs, not relying on thunder to agitate, but on essence to nourish all things.\n\nHumans have saliva; without rinsing and swallowing, essence cannot irrigate the five *zàng*. Without retaining essence to nourish the brain, it cannot ascend through copulation. Without *tūnà*—breathwork, internal *qi* cannot be drawn upon.\n\nThus, the Dao of simplicity and moderation, the principles of application, are modeled after Heaven and Earth.\n\nIf one visualizes the turbid, malevolent, stagnant, and pathogenic *qi* within the body, as well as congealed blood, being purged by the true *qi*, they will naturally exit through the fingertips. To disperse *qi*, spread the fingers without retention—each such movement counts as one *tōng*—passage. When *qi* flows freely, there is no illness. Then, regulate it to make the *qi* even, and again, practice swallowing as before.\n\nLeisurely swallowing thirty-six times constitutes minor achievement. If not yet abstaining from grain, one must eat sparingly, ensuring the abdomen is empty. Then, in a state of emptiness and tranquility, seated outside, swallow ten times naturally—this equals three hundred sixty swallows.\n\nIf practiced for a long time until *qi* flows freely, reaching three hundred sixty swallows also counts as intermediate achievement. One thousand two hundred breaths constitute great achievement.\n\nIf one cannot refine the form and alter the substance, they remain like withered wood, their essence exhausted.\n\n**The Method of Refining *Qi*:**\n*\"In my leisure, I refine *qi*.\"*\n\nEntering the chamber, remove your clothing, loosen your hair, and recline facing outward, stretching both hands freely without clenching them. Spread your hair across the mat, then proceed with the **Method of Regulating *Qi*** by swallowing.\n\nUpon completion, enter a state of **mystic heart** (*míngxīn*) and **cut off thought** (*juéxiǎng*), allowing the *qi* to move naturally. If it reaches the **threshold of perception** (*guò lǐ*) and feels constricted, exhale it. If breathing becomes slightly hurried, regulate it again. When the *qi* flows smoothly and evenly, gradually increase the swallows to twenty, thirty, forty, or fifty—until the entire body sweats. If this occurs, it is a sign of success. Remain composed and still, avoiding any sudden gusts of external *qi*. Wait until your spirit feels bright and clear. If the *qi* grows sluggish and seeks to escape, do not force it. If your limbs feel stiff and unyielding, likewise refrain. Practice this once every fifteen days.\n\n**The Method of Closing *Qi*:**\nIf at any time your cultivation encounters **unfavorable conditions** (*guāiyí*), or if illness suddenly arises, quickly retreat to a secluded room. Arrange your hands and feet according to the **Method of Regulating *Qi***, then swallow to close the *qi*. Focus your mind on the afflicted area and, with intent, direct your **closed *qi*** (*bì qì*) to attack it. If the *qi* is extreme, regulate it first; upon completion, continue relentlessly until the *qi* is expelled. If the *qi* is urgent, cease; if it is sluggish, regulate and then attack again—twenty, thirty, forty, or fifty times. When the afflicted area feels relieved and sweat emerges, stop.\n\nIf the illness does not abate, then between midnight and the fifth watch (*wǔ gēng*), before dawn, repeatedly gather your intent to attack, until the symptoms ease. Only target the afflicted area; if the *qi* does not heal, it will not mend.\n\n**The Method of Distributing *Qi*:**\nWhen distributing *qi* to heal others, first inquire about the **afflicted areas** (*suǒkǔ*) of their **Five Zang** (*wǔzàng*) organs. Transfer your own *qi* into their body, positioning them so that the afflicted area faces you. Quiet the mind and still the thoughts.\n\nThis **distribution of *qi*** (*bù qì*) resembles the **swallowing of *qi*** (*yàn qì*), and the illness will naturally dissipate. All **hundred evils** (*bǎi xié*) will be permanently banished.\n\n**The Method of Regulating *Qi*:**\nHumans consume the **Five Flavors** (*wǔwèi*), each of which corresponds to one of the **Five Zang** organs. The turbid *qi* of each organ is either inhaled or exhaled through the mouth. Moreover, the **Six Fu** (*liùfǔ*) and **Three Jiao** (*sānjiāo*) accumulate impurities, which merge into turbid *qi*. When sleep first overtakes you, the **greasy and foul *qi*** (*hūn nì qì*) becomes unbearable.\n\nIf the mouth is dry and the tongue rough, or if both cheeks glow with a radiant luster and the person cannot eat, this is the **Upper Jiao heat sign** (*shàngjiāo rè hòu*), and you must immediately employ the **Great Opening method** (*dāngé dǎkāi*)—swallowing twenty to thirty times, then exhaling loudly seven or nine times, and finally swallowing. When the **saliva** (*jīnyè*) in the mouth becomes clear and sweet, like a **spring’s pure waters** (*qiánchū*), the heat has retreated, and the **Five Zang** are cooled.\n\nIf the saliva in the mouth is **pale and insipid** (*língdàn*), and food and drink lack flavor, while the heart feels **distended and unwilling to accept nourishment** (*yángyáng bùshòu shuǐgǔ*), this is the **cold sign** (*líng hòu*), and you must exhale to **dispel it** (*chuīlǐ zhī*).\n\n**The Method of Nourishing After Eating:**\nThose who practice *qi* cultivation must be cautious about what they consume. Eat what is beneficial, avoid what is harmful. If food disrupts the **true *qi*** (*zhèng qì*), the pulse will become disordered. If it aids the *qi*, eat it regularly; if it harms, avoid it entirely.\n\nEach morning at dawn, consume a small amount of **plain congee** (*dàn gāo*) or **hemp seed congee** (*húmázi gāo*), which nourishes the **spleen *qi*** (*pí qì*) and supplements the **saliva** (*jīnyè*). At noon, eat a small amount of **plain rice porridge** (*miǎnrì yàn*) or **steamed rice cakes** (*bǐng*), but never while hot, lest it disrupt the **true *qi***. **Onion and blue-green algae soup** (*cōnglán gēng*) is also beneficial. All grains should be soft, well-cooked, and slightly sweet. **Barley consumed over four seasons** (*dàmài jīng sìshí*) is excellent, but do not overindulge.\n\nWhen hunger arises, eat as needed. If someone practices **stillness** (*jìngxiū*) and **fasting** (*zhāijiè*), they may also **ascend as an immortal** (*shēngxiān*).\n\nThe **Thirty-Six Fowl** (*sānshíliù qín*), **straight days** (*zhí rì*), and **days of one’s birth year** (*běnmìng shǔ*) must not be consumed. **Dates, chestnuts, taro, wheat, and beans** (*zǎo, lì, yùzi, mài, yīng*) should not be eaten in excess, as they **agitate evil *qi*** (*fādòng xié qì*). **Southern Shennong grass** (*dān nán shù cǎo*) may be eaten in moderation. When hunger is slight, eat lightly—do not overindulge, lest it **injure the heart** (*shāngxīn*). Overindulgence causes **closure of the Five Zang** (*bìsè*), making *qi* circulation difficult.\n\n**Spicy, salty, sour, acrid, and stale foods** (*rè wù, xiánsuān xīnlà chénbài zhī wù*) hinder *qi* flow. After eating, immediately exhale to **dispel the poisonous *qi*** (*hēquè fùzhōng zhī dú qì*), keeping the intestines and stomach **empty and tranquil** (*xūjìng*). If even a mouthful is mistakenly consumed, the **poisonous residue** (*dúwù fùnèi*) will linger within. Be extremely cautious.\n\nBefore eating, swallow three to five breaths of *qi* to harmonize with the meal. Additionally, ingest two or three **raw *qi* beans** (*shēng qì dòu*), which **guide the *qi* through the Three Jiao** (*yǐn qì tōng sānjiāo*), **balance the Zang-Fu** (*hé zàngfǔ*), **clarify the eyes** (*míngmù*), **expel harmful substances** (*qūbèn èwù*), and **dissolve grains** (*xiāo gǔshí*) to **assist the true *qi***. Their benefits are too numerous to recount. The *Tai Qing Jing* contains additional methods.\n\nAfter cultivating *qi*, if **foul *qi*** (*suì qì*) descends and cannot be endured, lingering may **invite illness** (*yǒu qí shēngbìng*). Each day, before meals, drink one cup of wine as your **nature dictates** (*suíxìng*), warming it in winter and cooling it in summer. This also **aids the *qi*** (*zhù qì*) and **expels all evil *qi*** (*qiān xié qì*). The warning lies in excess—too much causes **sluggishness and confusion** (*hūnluàn*), intoxication **injures the spirit** (*shāngshén*), and **stagnant *qi*** (*zàng qì*) shortens lifespan. If drinking is unavoidable, immediately exhale twenty to fifty times afterward. Open the mouth wide while exhaling to **dispel the turbidity** (*chuīqīan miǎnzàng*), and the **poisonous effects** (*dú*) will not take hold. You will not be intoxicated, nor will you be affected by the wine’s **overpowering *qi***. The taste of wine and food will remain undiminished.\n\nAvoid **raw meat** (*chōngshēng chǎnzhì*), **corpse *qi*** (*sǐwáng zhī suì*), or **the *qi* of slaughtered livestock while in motion** (*chéng liùxìng zǒuzòu*). Do not **rush into foul odors** (*chōngchōng chòusù*), as they **damage the true *qi***. If encountered unexpectedly, quickly **avoid them** (*bìzhī*). If **evil *qi* enters the abdomen** (*è qì rù fù*), immediately employ the **Method of Regulating *Qi*** to **flush and expel it** (*dǎngé dǐdí*).\n\nIf drinking wine, consume three cups; if not, use **true *qi*** to **rinse it out** (*tāochū*). If it refuses to leave, do not **forcefully press** (*bùyòng guò lǐ pòzhī*), but allow it to **gradually exit** (*rèn jiànjiàn chūzhī*). If the **Upper Jiao heat** persists, you must **regulate the *qi*** to **harmonize it** (*shǐ qì pínghé*).\n\nConsume little **oily and greasy food** (*yóunì*), ensuring it does not **contact the true *qi***. If you have previously consumed such foods, do not repeat the offense while cultivating *qi*. After one year of **uninterrupted flow** (*tōng*), and three years of **fulfilled practice** (*gōngchéng*), the **true *qi* will solidify** (*zhèng qì suìníng*), and even if you encounter such foods again, they will cause no harm.\n\nPractice **a thousand swallows daily** (*qiān yàn*), and you will have no fear of **excessive return** (*duō fǎn*). Begin gradually from this point.\n\nThe **Scripture** (*Jīng*) states:\n*\"The *qi* transforms into blood, blood into essence, essence into marrow.\nOne year transforms the *qi*, two years the blood,\nthree years the pulse, four years the flesh,\nfive years the marrow, six years the sinews,\nseven years the bones, eight years the hair,\nnine years the form.\nAfter thirty-six thousand days of divine cultivation,\nall [36,000] *shén* [spirits/aspects] transform into immortality,\nand one is called a **True Person** (*Zhēnrén*).\"*\n\nUnceasingly cultivate the **fulfilled practice** (*gōngchéng*), linking joints and solidifying the five viscera—\ninternal *qi* does not escape, external *qi* does not enter,\ncold and heat cannot intrude.\nAscending and transforming, life aligns with the Three Luminaries.\n\n**Resting the Root Method** (*Xiūgēn Jué*) states:\nAfter diligently practicing for three years as before,\nthe true *qi* flows freely, essence and marrow are replete,\na hundred spirits guard, the Three Corpses flee—\none naturally no longer desires the *qi* of the Five Grains,\nconstantly pondering the difficulty of absolute abstinence.\nYet when hunger arises, simply swallow—\nno need for fixed times, morning or evening.\nOne may also combine this with medicinal elixirs.\nMost people fail to grasp this:\nthey consume mere trifles all day, obsessed with drugs,\nthus never attaining it—\nthis is not the path of the superior adept.\n\nThe *Huángtíng Scripture* (*Jīng*) says:\n*\"The grains’ fruits are earth’s refined essence,\nfive flavors’ allure—external demons’ stench.\nTheir stink confuses the spirit, scatters the embryonic *qi*—\nhow could one reverse aging, return to infancy?\"*\n\nThe Three Souls wander, the Corporeal Souls drift—\nwhy not nourish the **True One’s** (*Tàihé*) pure essence?\nThus, one may enter **Yellow Peace** (*Huángníng*) and not die.\n\nThe **Guardian Method** (*Shǒuhù Jué*) says:\nAll mortals crave desires—\nthis has been true from ancient to modern times.\nThe Daoist Scriptures state:\n*\"Only when death approaches do the wise begin to cherish their bodies,\ntheir crimes fulfilled, they seek to change their ways.\nWhen illness strikes, they scramble for remedies—\nthe Heavenly Net has already been cast.\nHow can they now escape?\"*\n\nThe virtuous do not wait for peril to value life;\nthey withdraw from the world, cultivate the heart, and aspire to the Dao.\nThe Dao is *qi*.\n*Qi* is the master of the body;\nthe master is the body’s life;\nlife is the body’s root.\nIf one cherishes essence and preserves *qi*,\nonly then is life fully sustained.\n\nThe **Method of *Qi*-Cultivation** (*Xíngqì Jué*) says:\nThe Dao is *qi*.\nPreserving *qi* attains the Dao—\nthus, longevity is achieved.\nThe spirit is essence.\nWhen essence remains, the spirit is bright;\nwhen essence scatters, the spirit departs.\nEssence is the flowing river of blood and vessels,\nthe vital fluid nourishing the bones.\nWhen essence is exhausted, the bones wither—\ndeath follows. This is not the fixed Dao.\n\nThe Daoist pursues essence;\none must always store and guard it,\nas **Pengzu** instructed **Wùchéngzǐ**:\n*\"Close the essence, fear neither cold nor heat.\nSuch a person naturally remains serene.\nI have spoken much of this.\"*\n\nThe Scripture says:\n*\"The Dao lies not in agitation.\nDo not lust after sounds and colors,\ndo not covet honor or shame,\ndo not weary the body.\nConstantly guide and draw—\nwhen internal *qi* rests in peace,\none may attain a thousand years.\nSeeking further the supreme elixir,\nlongevity becomes possible.\nIf one does not leak [essence],\nthis is called **nourishing essence** (*fújīng*).\nWhen all ten thousand thoughts cease,\ndesires grow few—\nthus, life is prolonged.\"*\n\nEach morning, before rising,\nfirst strike the teeth seven to nine times,\nthen kneel with face bound,\nharmonizing the black *qi*.\nDraw in the clear black through the nose,\nexpel the turbid black through the mouth,\nrubbing hands together as you do.\nGuide and draw as needed,\npress the tongue to the upper palate,\ngather and swallow the saliva until the mouth is full—\nswallow three times, then stop.\nNext, passively circulate from the crown to the soles,\nseven times each way,\nto treat the bones and joints,\nunblock the black vessels,\ndrain stagnant turbidity,\nand supplement exhaustion.\n\n**Method to Eliminate the Three Corpses and Nine Worms:**\n\nThe Corpses harbor nine worms:\n1. The **Lurking Worm** (*fúchóng*), four *fēn* long;\n2. The **Roundworm** (*huíchóng*), one *chǐ* long;\n3. The **White Worm** (*báichóng*), one *cùn* long;\n4. The **Flesh Worm** (*ròuchóng*), like rotting apricots;\n5. The **Lung Worm** (*fèichóng*), like silkworms;\n6. The **Stomach Worm** (*wèichóng*), like toads;\n7. The **Diaphragm Worm** (*géchóng*), like gourd slices;\n8. The **Red Worm** (*chìchóng*), like raw meat;\n9. The **Threadworm** (*nǐchóng*), like vegetable worms.\n\nOnly the Lurking Worm rules the others.\nThe Roundworm, piercing the heart, kills;\nthe White Worm multiplies—\nits offspring grow to four or five *chǐ*, also lethal.\nThe Flesh Worm causes restlessness,\nthe Lung Worm induces coughing,\nthe Stomach Worm provokes vomiting,\nthe Diaphragm Worm makes one spit excessively,\nthe Red Worm causes abdominal rumbling,\nthe Threadworm, dwelling in the intestines,\nif numerous, causes leprosy, hemorrhoids,\nand sores or eczema.\n\nAll nine may reside in the body, though not always in full.\nOther treatments exist, but here is one remedy:\n\n**Prescription to Eliminate the Three Corpses and Nine Worms:**\n- **Tube Crow** (*guǎnzhòng*) – five *fēn* – controls Threadworms\n- **White Dwarf Rhubarb** (*báizhí lú*) – twelve *fēn* – controls Roundworms\n- **Sichuan Lacquer** (*shǔqī*) – three *fēn* – controls White Worms\n- **Chinese Wolfberry** (*gōuqí*) – five *fēn* – controls Flesh Worms\n- **Stone Silkworm** (*shícán*) – five *fēn* – controls Lurking Worms\n- **Thick Bark** (*hòupò*) – three *fēn* – controls Lung Worms\n- **Wolf’s Tooth** (*lángyá*) – four *fēn* – controls Stomach Worms\n- **Dead Silkworm** (*jiāngcán*) – four *fēn* – controls Intestinal Worms\n- **Thunderberry** (*léiwánzǐ*) – six *fēn* – controls Red Worms\n*(Also called **Crow’s Solitude** (*yādú*) or **Earth Pipe** (*tǔyúzi*)*\n**Kudzu Vine** (*téng*) – like kudzu but with finer leaves)\n\nGrind all nine ingredients to a powder,\ntoast with *wǔhúo* (mild and strong) fire until golden,\nsift finely, and mix with refined honey into pills the size of **paulownia seeds** (*tóngzǐ*).\n\nTake five pills daily in warm water, three times a day,\ngradually increasing to ten.\nBy the twelfth day, stagnation will subside;\nby sixty days, all ailments will heal.\nAdjust the dose according to one’s strength—\nthe less taken, the better.\nWomen may take it, but must first observe dietary restrictions.\n\n**Scripture on Nourishing the Embryonic Spirit for Longevity** concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "长生胎元神用经 经名：长生胎元神用经。 唐·郎笔注。 一卷。 底本出处：《正统道藏》正一部。 参校版本：《道藏辑要》本，收入该书斗集第十一册（简称辑要本）。 长生胎元神用经 野人郎肇注 师曰：知至道者天不煞，服元炁者地不灭。 夫至道不远，祇在己身，用心精微，命乃长久。 刘君《秘旨》曰：欲得长生，当修所生。 所生之法，始用精微，炁结为形，形是受炁之本宗，炁是形之根元。 元炁禀形之由，可察灭形之理。 经云：深根固蒂，长生久视之道。 元炁是身之根蒂。 夫若固其元炁，自然长生之道。 形中子母，何不守之？ 且神以炁为母，母即以神为子。 子因呼吸之炁而成形，故为母也。 形炁既立而后有神，神聚为子也。 夫呼吸之炁，由於玄牝之门。 ，鼻主清炁为阳，口主浊炁为阴。 夫欲修习，但泯其念，外绝思虑，内守神真。 每欲修习之时，先须调炁。 调炁之法，鼻微微纳清炁，口微微吐浊炁，止十下二十下即闭口，一任神炁绵绵出入。 ｀鼻所纳炁，以意想至下元玄珠，蒙蒙四合，即存玄珠为下元之主。 不得生思，生思不成。 积习之，自然凝结成珠，习为母也。 既有其母，必有其子，功限运疾，其在志焉。 勿思外机，一心存神，速成长生至矣。 夫神与炁相合，以意引之，循环脏腑之内，驭呼吸以上下，久习之后，则神自明而炁自和，明照五脏。 细功成后，内视见其真神矣。 炁和而浃通於四肢，随意而到，亦可治他人之疾也。 黄帝内视三月而生神。 心神则化生，缠锦五脏，斯言可推而得之。 黄帝得此诀，内视三月而神全，则乃生天矣。 列子得之九年成道，迟速由其志也。 元炁随意，静即得。 炁道通流，形体自康，玄珠为主，神自光明也。 今世人神与炁子母各行，俱不相守，虽然呼吸於内，神常运物於外，如此之道，遂使炁元主掌而不通彻，既不通彻而精自散。 又以神为主人，形为宅舍。 主人不营於内而日用於外，自然宅舍空虚而形体衰矣。 况乎人世之道，昼夜百刻之中，炁於形内总一万三千五百息，长八万一千寸，皆外役其神炁，无一息住於内，而冀长生不亦远矣？ 先生曰：若神炁主子母之运行，而乃长生不死，若无主掌，任自呼吸，唯主通利脏腑，消化水谷而已，不能还阴返阳，填补血脑。 得此修息之门，元炁结而成胎。 胎中有神，神全使其元炁。 夫若未得此诀，自然炁无主掌，徒致功勤。 不穷受炁之元，空传於呼吸。 元炁若全，以意想下元，炁散在於四肢，遂使肌肤充悦也。 师曰：吾以神为车，以炁为马，终日驱驱而不倦。 常存想神与元炁相合，随意而动之不倦，故为车马也。 又曰：神能驱炁，则鼻不失息。 其言至矣！ 神在玄珠之中，常与元炁主一呼一吸，皆内想见其真神，故称为之主掌，令神炁混合，而鼻不失息。 驱炁之法，上至泥丸，下至命门。 泥丸在脑，为上元。 命门在脐下三寸，《黄庭经》云，后有密户前生门。 近腰脊之末，以认下元也仙经至道，方说泄露，因感而言之，二景相莲，可救老残。 夫存养下宫元炁满，则使炁溯流，上入泥丸宫，是名还精补脑，故曰：二景相通也。 若呼不得神宰，一息不全。 若吸不得神宰，亦一息不全。 若能息息之中神与炁常合，是谓神炁全也。",
      "translated_text": "**The *Scripture of the Dao/Way on Nurturing the Primordial Qi for Longevity***\n\n**Title:** *Scripture of the Dao/Way on Nurturing the Primordial Qi for Longevity*\n**Attributed to:** Tang-dynasty Master Lang (野人郎肇注).\n**One scroll.**\n**Source of the base text:** *The Orthodox Daoist Canon* (正统道藏), First Section (正一部).\n**Cross-referenced editions:** *The Daoist Canon: Selected Essentials* (道藏辑要), included in Volume 11 of the *Collected Works* (斗集) [hereafter cited as *Selected Essentials*].\n\n**The Scripture of the Dao/Way on Nurturing the Primordial Qi for Longevity**\n**Annotated by Master Lang of the Wild**\n\nThe Master said: *\"He who knows the Supreme Dao/Way is not cut off by Heaven, he who cultivates the Primordial Qi is not extinguished by Earth.\"* The Supreme Dao/Way is not distant; it lies within one’s own body. With a refined and subtle mind, life will endure.\n\nMaster Liu’s *Secret Teachings* (秘旨) state: *\"To attain Longevity, one must cultivate that which gives birth to it.\"* The method of cultivation begins with the subtle refinement of Qi. When Qi coalesces into form, form becomes the foundation of receiving Qi, while Qi is the root origin of form. By observing how the Primordial Qi nourishes form, one may discern the principle of form’s dissolution.\n\nThe Scripture says: *\"Deep-rooted and firmly established, the Dao/Way of Longevity and enduring vision.\"* The Primordial Qi is the root foundation of the body. If one firmly establishes the Primordial Qi, the Dao/Way of Longevity will naturally unfold.\n\nWithin the form, there are the *yin* and *yang* (子母), why not guard them? For, the Qi serves as the *yin* (母) of the Spirit, while the Spirit is the *yang* (子) of the Qi. The *yang* (子) arises from the Qi of breathing, hence it is called the *yin* (母). Once the Qi of form is established, the Spirit emerges, thus the Spirit is called the *yang* (子).\n\nThe Qi of breathing originates from the *Mysterious Female* (玄牝) [i.e., the lower *Dantian*]. The nostrils govern the intake of pure, *yang* Qi, while the mouth governs the exhalation of impure, *yin* Qi.\n\nTo practice cultivation, one must first extinguish all thoughts, sever external concerns, and internally safeguard the True Spirit. Before each session of cultivation, one must first harmonize the Qi.\n\nThe method of harmonizing Qi is as follows: subtly inhale through the nostrils to draw in the pure, *yang* Qi, and subtly exhale through the mouth to release the impure, *yin* Qi. After ten or twenty breaths, close the mouth and allow the Spirit-Qi to flow continuously in and out without effort.\n\nThe Qi inhaled through the nostrils should be imagined as descending to the *Primordial Pearl* (玄珠) of the lower *Dantian*, enveloping and merging in all directions. Then, regard the *Primordial Pearl* as the sovereign of the lower *Dantian*. Do not allow any extraneous thoughts to arise, for such thoughts will disrupt the process. With persistent practice, the Qi will naturally condense into a pearl, and this is the *yin* (母).\n\nOnce the *yin* (母) is established, the *yang* (子) will naturally follow. The speed of attainment depends on one’s resolve. Do not dwell on external matters; focus the mind solely on the Spirit. Swiftly achieve Longevity, and the goal is attained.\n\nWhen the Spirit and Qi unite, guide them with intention, circulating through the viscera and bowels, riding the breath upward and downward. With prolonged practice, the Spirit will grow luminous and the Qi harmonious, illuminating the Five Zang Organs.\n\nAfter mastering the subtle techniques, one may internally perceive the True Spirit. When the Qi is harmonized and fully permeates the Four Limbs, it moves according to the will and can also heal others’ ailments.\n\nThe Yellow Emperor cultivated internal vision for three months and thereby gave birth to the Spirit. The Spirit of the Heart then transforms and generates, weaving through the Five Zang Organs. These words may be extrapolated to reveal their meaning.\n\nThe Yellow Emperor attained this secret and, after three months of internal vision, his Spirit was complete. Thus, he was born from Heaven.\n\nLiezi attained it after nine years and thereby became enlightened. The swiftness or delay depends on one’s resolve.\n\nThe Primordial Qi follows the will; stillness brings its attainment. When the Qi flows freely through the Dao/Way, the body naturally grows strong. The *Primordial Pearl* is the sovereign, and the Spirit becomes luminous.\n\nIn the present age, people allow the Spirit and Qi—*yin* and *yang*—to move independently, neither guarding the other. Although they breathe internally, their Spirit is constantly expended externally. Such methods only cause the Primordial Qi to scatter and lose its sovereign power, for if it does not flow fully, the Essence will dissipate.\n\nMoreover, people regard the Spirit as the master and the form as the dwelling. If the master does not tend to the dwelling but instead is always occupied externally, the dwelling will inevitably become empty and the body decay. As for the methods of this age, within the hundred *ke* (刻) of day and night, the Qi within the form totals thirteen thousand five hundred breaths, amounting to eighty-one thousand inches in length. All of these breaths exhaust the Spirit-Qi externally, leaving none to reside within, so how can one hope for Longevity?\n\nThe Master said: *\"If the Spirit-Qi governs the circulation of the *yin* and *yang*, then one attains Longevity and immortality. If there is no sovereign control, and one merely follows natural breathing, the Qi will only serve to nourish the viscera and digest food, unable to return the *yin* to the *yang* or replenish the blood and marrow.\"*\n\nBy attaining this method of breathing cultivation, the Primordial Qi condenses into an embryo. Within the embryo lies the Spirit, which preserves the Primordial Qi. If one has not yet attained this secret, the Qi will lack sovereign control, and all efforts will be in vain. One will only exhaustively practice breathing without penetrating to the root of receiving Qi, and the Primordial Qi will disperse among the Four Limbs, causing the flesh and skin to wither.\n\nThe Master said: *\"I regard the Spirit as the chariot and the Qi as the horse, driving them ceaselessly throughout the day without fatigue.\"* Always imagine the Spirit and Primordial Qi as united, moving according to the will without ceasing, hence they are called the chariot and the horse.\n\nHe also said: *\"When the Spirit drives the Qi, the nostrils do not lose their breath.\"* His words are profound!\n\nThe Spirit resides within the *Primordial Pearl*. It constantly governs the Primordial Qi in each inhalation and exhalation, always internally perceiving the True Spirit. Hence, it is called the sovereign control, uniting the Spirit and Qi so that the nostrils never lose their breath.\n\nThe method of driving the Qi extends from the *Nihuan* (泥丸) [upper *Dantian*] to the *Mingmen* (命门) [lower *Dantian*]. The *Nihuan* is located in the brain, serving as the upper *Dantian*. The *Mingmen* is three inches below the navel; the *Huangting Scripture* (黄庭经) states: *\"Behind lies the secret door, before the birth gate.\"* It is near the end of the lumbar spine, thus identifying the lower *Dantian*.\n\nThe Supreme Dao/Way of the Immortal Scriptures now reveals the *leakage* [of Qi], inspired by this teaching. The two *Dantian*s [upper and lower] are like lotuses in communion, capable of rescuing the aged and infirm.\n\nWhen the Primordial Qi of the lower *Dantian* is fully nurtured, it ascends in reverse, entering the *Nihuan* [upper *Dantian*]. This is called *Returning the Essence to Nourish the Marrow* (还精补脑), hence the saying: *\"The two *Dantian*s are in communion.\"*\n\nIf one cannot inhale with the Spirit as sovereign, not a single breath is complete. If one cannot exhale with the Spirit as sovereign, not a single breath is complete. If the Spirit and Qi are constantly united within each breath, then the Spirit and Qi are fully preserved.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1235,
      "start_sentence": 0,
      "end_sentence": 61,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 23.75627565383911,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\长生胎元神用经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "夫治炁者，出炁为之息。 吸者，从鼻中入，想至下元玄珠口中，与神相合也。 唯澄心腹，目视呼吸。 修行之时存想见其真神，为之一息全也。 目瞥然生外想，神以随意在外，唯见外景中事，使内炁元主掌，谓之息不全也。 又曰：胎从服炁中结，炁从有胎中息。 胎若内结，求死不得也。 服元炁有息者，返覆言义也。 以鼻中纳炁，以意送下元中，久习自然凝结成胎。 胎因元炁结而成胎，中元炁而有息，息由不可也。 子犹神也，人如初受胎，渐渐而成形。 仙经曰：成功之后，男子关元炁聚精，女人胎泽不结婴。 虽动於欲不能与神争，此是成胎之中，真返精为神。 此是上清也。 夫自修之诀，能出入阴阳，合其真矣。 每取夜半之后五更睡觉之初，先以舌漱掠唇齿之问，澧浊津液吐出三口，鼻收清冻炁入於胸膈之中，淘隔宿来秽滞之炁呵出三口，良久咽。 吹即仰卧，展其两手足，叩齿九遍，次依寻常喘息吐纳，不得极深，直候喘息炁平，内不出外，外不入内，闭炁咽元炁一咽，以手随意炁摩下，引至炁海之中，二十日后炁通滑又加一咽，不用将手摩引，经两月后更加一咽，一炁三咽，一年后一炁四咽，无所妨损。 每日子后午前空腹咽之，时时十咽五咽，不得吸入外炁，每至子前午后，不得咽之。 经曰：子后午前皆属於阳，子前午后谓之阴。 夫休根者每至食时漱口，存想上元两条白炁从脑中出，大如布栈，沿流项至背膂，过入於脐下炁海之中，渐渐聚炁如鹅子大，一团香馥，自然不饥，不得杂想，恐有性乱。 或有疾病，口乾舌涩，喉中咽塞，皆是上焦热极，即以五更鼻吸清冻之炁入胸膈，淘荡却呵出三五十止一二百呵，渐觉口中甘甜，是热退散，即住，不得过妄。 如水藏冷，即以早晨日出之时鼻挡阳炁，以口吹出百十吹玲炁，如有病苦之处，一切疼痛，蛇竭蜇咬狼狗所伤，但以静意坐卧，闭炁存想，所患之处以炁攻之一二百度，无不痊愈也。 冬月脚 玲，但以咽热炁以意存想直至脚心下，暖即住。 如饮酒小户者，但随器物旋旋呵出缅够之毒力，即不醉也。 赤水者，血也； 玄珠者，炁也。 炁者，神也。 每修习之时，面束或南而坐，兀然冥目，以目存想下丹田脐下三寸两肾之间方三寸，左青右黄上白下炁中赤之炁。 口诀曰：大如弹丸黄如橘，有光焰，上一赤子名元先，字帝卿； 中一真人名子丹，字光坚； 下一婴儿名元阳，字谷元。 其神身长各三寸，环赤衣赤履，坐金状，手把金炉玉匕，具，昼在上丹田，夜在下丹田。 即说阴丹七返，水唾血精脑神炁也。 夫欲养神，先须养炁，养炁先须养脑，养脑先须养精，养精先须养血，养血先须养唾，养唾先须养水。 水者五华之津，五味之精，当在舌下两齿之问傍，名日水池。 咽下肺脉之主，则化为唾，唾入心之间则化为血，血二百五十日入肾脉中则代为精，精入脑脉之中则化为泥丸宫。 宫中有两条脉，夹脊膂流下贯入於黑海之中。 夫黑海王则聪明也。 真人曰：仙家大忌慎怒，不得乱泄言语，贤君秘之。 导引诀 两手相授如洗面，两手相擦令热，揩面令面元皱。 如战士挽硬弓，左右三遍，握拳左右前筑数回，两手各向上如托千斤石，左右同。 大坐，握固，斜身如排山，左右同，以拳慢舒向前，急掣向后。",
      "translated_text": "The cultivation of *Qi* begins with its emission as breath. Inhalation is taken through the nostrils, imagined to reach the Primordial Pearl (*Xuanzhu*) of the lower *Dantian*, where it unites with the Spirit.\n\nOnly when the mind and abdomen are pure, and the eyes observe the breath, can one in meditation perceive the true Spirit and thus achieve a complete breath. If the gaze wanders and external thoughts arise, the Spirit follows the will outward, seeing only external matters, and the internal *Qi* fails to govern—this is called an incomplete breath.\n\nMoreover, it is said: *\"The embryo forms from the gathering of *Qi* within the abdomen. *Qi* within the embryo breathes.\"* If the embryo is formed internally, one cannot seek death. When *Qi* gathers within the embryo, it breathes—this is the meaning of *Returning the Essence* (返覆).\n\nBy inhaling through the nostrils and sending *Qi* down with the intention, prolonged practice will naturally condense and form the embryo. The embryo is formed from the gathering of Primordial *Qi*, and within it, *Qi* breathes—though this breath is imperceptible.\n\nThe child is like the Spirit, and the person is like one initially receiving the embryo, gradually taking form.\n\nThe Immortal Scriptures state: *\"After success, men close the *Guanyuan* [Gate of Origin] to gather *Jing* [Essence], while women’s *Tai* [embryo] and *Ze* [Sea] do not form the fetus.\"* Though moved by desire, one cannot contend with the Spirit—this is the embryo’s true essence, the *Returning of Essence* as Spirit. This is the *Shangqing* [Upper Clarity].\n\nThe key to self-cultivation lies in mastering the interplay of *Yin* and *Yang*, uniting their true nature. Every night, after midnight and before the fifth watch (when sleep first comes), first use the tongue to rinse and cleanse between the lips and teeth, expelling three mouthfuls of turbid saliva. Then inhale through the nose the pure, cold *Qi*, drawing it into the chest and diaphragm. Expel three to five mouthfuls of stale *Qi* that has accumulated from the previous day, and after a while, swallow.\n\nWhen lying down, stretch out both hands and feet, strike the teeth nine times, then follow the usual method of inhaling and exhaling, though not too deeply. Wait until the breathing *Qi* is even, neither leaving the body nor entering from outside. Close the *Qi*, swallow the Primordial *Qi* once, and with the hands, guide the *Qi* downward as you massage, drawing it to the *Qi* Sea (*Qihai*). After twenty days, when the *Qi* flows smoothly, add one swallow. After two months, add another, until one swallow suffices for three breaths. After a year, one swallow suffices for four breaths—no harm will come from this.\n\nEach day, after the child hour (*Zi*) and before noon (*Wu*), swallow on an empty stomach. At other times, swallow ten or five breaths, but never inhale external *Qi*. Before the child hour and after noon, swallowing is forbidden.\n\nThe *Classics* say: *\"After the child hour and before noon all belong to *Yang*; before the child hour and after noon is called *Yin*.\"*\n\nFor those who cultivate the *root of rest* (*Xugen*), at mealtime, rinse the mouth and imagine two streams of white *Qi* emerging from the upper *Dantian*, as thick as cloth strips, flowing down the neck to the spine, entering the *Qi* Sea below the navel. Gradually gather the *Qi* until it is the size of a goose egg, a fragrant cluster, naturally dispelling hunger. Avoid distractions, lest the nature be disordered.\n\nFor illness such as dry mouth, sticky tongue, or throat obstruction, these are signs of extreme heat in the upper burner (*Shangjiao*). At the fifth watch, inhale through the nose the pure, cold *Qi* into the chest and diaphragm, then expel it through the mouth three to five dozen times, or even a hundred or two. Gradually, one will feel sweetness in the mouth—this is the heat dispersing. Then cease, but do not overdo it.\n\nIf the *Water* (*Shui*) is cold, at dawn, inhale through the nose to block *Yang* *Qi*, and exhale through the mouth a hundred or so breaths of clear *Qi*. For any painful ailments—whether from snake venom, bites, or injuries by wolves or dogs—simply sit or lie still, close the *Qi*, and focus the intention. Direct the *Qi* to attack the afflicted area for a hundred or two repetitions, and all will heal.\n\nIn winter, for cold feet (*Ling*), swallow the hot *Qi* and imagine it flowing down to the soles, warming them before ceasing.\n\nIf one drinks alcohol and suffers from intoxication, simply expel through the mouth the toxic force (*Du*) that arises with the vessel’s rotation, and one will not become drunk.\n\n*Chi* *Shui* refers to saliva; *Xuanzhu* refers to *Qi*; *Qi* is the Spirit.\n\nWhen practicing, face north or south while seated, upright and eyes closed. With the gaze, imagine the lower *Dantian*—three inches below the navel, within the space of the two kidneys, three inches wide—where the *Qi* is green on the left, yellow on the right, white above, and red below, with *Qi* itself being crimson within.\n\nThe oral formula says:\n*\"Great as a bullet, yellow as an orange, with radiant flame,\nAbove—one crimson child, named *Yuanxian*, styled *Dijing*;\nMiddle—one True Person, named *Zidan*, styled *Guangjian*;\nBelow—one infant, named *Yuanyang*, styled *Guyuan*.\nEach Spirit-body is three inches long,\nWearing crimson robes and shoes,\nSeated on a golden throne,\nHolding a golden censer and jade ladle.\nBy day, they reside in the upper *Dantian*;\nBy night, they dwell in the lower *Dantian*.\nThis is the *Yindan* [Embryonic Elixir] of seven returns—\nWater, saliva, blood, essence, marrow, and *Qi* of the brain.\"*\n\nTo nourish the Spirit, one must first nourish the *Qi*;\nTo nourish the *Qi*, one must first nourish the brain;\nTo nourish the brain, one must first nourish the essence;\nTo nourish the essence, one must first nourish the blood;\nTo nourish the blood, one must first nourish the saliva;\nTo nourish the saliva, one must first nourish the water.\n\nWater is the five-flavored essence of saliva,\nThe refined essence of the five tastes,\nLocated beneath the tongue, beside the two teeth,\nCalled the *Water Pool* (*Shuichi*).\n\nWhen swallowed into the lung’s channel, it transforms into saliva;\nWhen saliva enters the heart’s channel, it becomes blood;\nWhen blood, after two hundred and fifty days, enters the kidney’s channel, it turns into essence;\nWhen essence enters the brain’s channel, it forms the *Nihuan* [Embryonic Palace].\n\nWithin the palace are two channels,\nFlowing beside the spine downward into the *Heihai* [Black Sea].\nThe Black Sea’s sovereign is clarity and wisdom.\n\nThe True Person says:\n*\"The Immortal’s greatest taboo is anger;\nDo not recklessly leak words.\nThe wise ruler keeps this secret.\"*\n\n**Guiding and Pulling Formula:**\nClasp the hands as if washing the face, then rub them together until they are warm, wiping the face until the skin wrinkles. Like a warrior drawing a stiff bow, pull left and right three times. Clench the fists and strike forward and backward several times, then lift both hands upward as if supporting a thousand-pound stone, alternating left and right.\n\nSit upright, fists clenched, and lean the body sideways like a mountain being pushed aside, alternating left and right. Slowly extend the fists forward, then swiftly retract them backward.",
      "overlap_context": "wer *Dantian* is fully nurtured, it ascends in reverse, entering the *Nihuan* [upper *Dantian*]. This is called *Returning the Essence to Nourish the Marrow* (还精补脑), hence the saying: *\"The two *Dantian*s are in communion.\"*\n\nIf one cannot inhale with the Spirit as sovereign, not a single breath is complete. If one cannot exhale with the Spirit as sovereign, not a single breath is complete. If the Spirit and Qi are constantly united within each breath, then the Spirit and Qi are fully preserved.",
      "start_char": 1235,
      "end_char": 2481,
      "start_sentence": 62,
      "end_sentence": 105,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 21.38348412513733,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\长生胎元神用经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "跑抱头宛转名抽关，两拳据地，缩身曲脊，上下三举两拳，各返捶背三下，大坐，伸脚，用手叉返掣数回，起立，以手叉腰，拗身向后三回，热授手熨两脚心与腿膝，未起，两手相叉夹项争力数回，殷伸返张侧掣宣摇百关，授两手令热郁两目，引至耳前，两手旋耳三十遍，时时作之，授手令热，按鼻两傍，闭黑为之，气通即止。 真人曰：长生时子后午前，咽津七遍，闭目平坐，内视存见五脏六腑。 夫若久久行之，自然明了。 夫初学服黑，即须耳元所闻，心元所思，渐起於三息五息一舒黑，更渐吸之。 若止十二息不舒黑，得小通也。 百二十不舒，得大通也。 夫清斋休根，存日月在於口中，昼存日，夜存月，大如环，日色赤，有紫光九芒； 月色黄，有白光十芒。 存日月在於明堂中，日在左，月在右，常存咽芒之黑液，如睡存日在额上，月在脐下，若身有不安，反舌塞喉，咽唾元数，退即住。 天黑所在，随神黑之所生，神在则黑成，神去则黑虚。 黑者，二十四神之正黑，黑亦成神，神亦成黑。 黑散则为云雾，黑合则为形影，出化为仙，入化为真，上结三元，下结万物，存帝一真君。 祝名都闭目，存诸百神变成白黑，如姻之状从玄珠中出茎孔中，来入我口中，郁郁良久，觉见白黑下出茎孔，出两脚底，出两脚心，出冠缠中，乃至一身与白黑同烟上下良久，白黑忽变紫云，郁郁入我口内，归於头中，下五脏中，充满腹内，又从两脚心出，两手心出，下至茎孔冠缠中，一身郁郁，上下与紫云合，形不相见也。 须臾，又存想紫黑充满左右一室之内，又存想口出风黑，扇於紫云，令徘徊转绕成一真人，男形身长三寸号日大洞帝一尊君。 又存尊君直来入口中舌下，又上升紫房中六合宫内，端坐向外，尊君左手把兆五籍，右手把兆五符，尊君口左边有日光九分，尊君口右边有月光郁郁，或白或赤，常光黑下入五脏六腑百节之内，一身之中，状如白日，宜心咒曰： 大洞帝一，太素尊灵，父宁母静，二合双成，百真大混，一回性生，身结八姻，乃变元婴，日月宝光，动我体形，太一在上，愿与帝并，泥丸宝玉，五脏华明，长合日月，手执洞经，立为仙公，神升上清，三十九童，全符羽庭。 常存大洞帝一尊君在於鼻下人中上唇内齿内外，坐立起居常须在意，尊君口衔日月，明照万洞。 未行炁时，先存心中烛火烧遍身上下，荡除五谷之炁毒，若不烧之，必能拥寒，烧不可久，久即令人烦燥。 存火讫，即须行炁，不得杂想，任炁微微，元炁自通彻，以意行之。 欲行炁道，先须断谷，渐渐学之，不宜顿也。 一年之后，炁道充实，自然不饥。 肾神六人，司徒、司录、司命、司隶、校尉、卿，左右分为八百五十。 日月精灵之炁，人之根本，左为玄妙君，右为玄元君。 虚元相生，寒暑相成。 冲和先生授龙岗服炁诀：夫形之所恃者，炁也。 炁之所依者，形也。 炁全形全，炁竭形毙，是以摄养之士莫不炼形炁而保其生，未有有形而无炁、有炁而元形者也。 即形之与炁相须而成，岂不皎然哉！ 余夙慕至道，披寻经史，自行守慎，约向十余载，所见所闻，殊不惬心。 於大历年中遭遇罗浮王公自北岳而返，倚策邮亭，依然相顾。",
      "translated_text": "The **Running Embrace of the Head** is called the *Chouguan* [Drawing the Lock] technique.\nClench both fists against the earth, curl the body and arch the spine, raising and lowering the fists three times. Each time, return to strike the back three times. Sit upright, extend the legs, and with hands crossed behind, pull backward several times. Stand, cross the hands at the waist, and twist the body backward three times.\n\nWarm the palms and rub them over the soles of the feet and knees. Without rising, cross the arms behind the neck and strain with force several times. Stretch and extend, then retract and shake to open the *bai guan* [hundred passages].\n\nWarm the palms again, cover the eyes, and draw them forward to the ears, rotating the ears thirty times—practice this often. Warm the palms, press the sides of the nose, close the eyes, and breathe. When *qi* flows freely, stop.\n\nThe True Person says:\n*\"At the time of longevity, before noon, swallow the saliva seven times, close the eyes, and sit levelly. Internally visualize the five *zàng* [solid organs] and six *fǔ* [hollow organs].*\nIf practiced diligently over time, clarity will naturally arise.\n\nWhen first practicing the *Heihai* [Black Sea], one must focus on what the ears hear and what the mind thinks. Gradually, this arises with three breaths, five breaths, and a slow exhalation. If one stops at twelve breaths without exhaling, minor harmony is achieved. If one stops at one hundred twenty breaths without exhaling, great harmony is attained.\n\nDuring fasting and rest, cultivate the sun and moon within the mouth: by day, cultivate the sun; by night, cultivate the moon. They are as large as a ring—the sun’s color is red, with a purple nine-rayed light; the moon’s color is yellow, with a white ten-rayed light.\n\nCultivate the sun and moon within the *Mingtang* [Hall of Light]: the sun on the left, the moon on the right. Always cultivate the *ke* [essence] of the sun and moon’s rays as a black liquid, like sleeping with the sun on the forehead and the moon beneath the navel. If the body feels uneasy, press the tongue against the throat, swallow the saliva several times, then rest.\n\nWhere the *Heihai* resides, follow the birth of the *shen* [spirit]. When the spirit is present, the *Heihai* forms; when the spirit departs, the *Heihai* becomes empty.\n\nThe *Heihai* is the true *qi* of the twenty-four spirits. The *Heihai* forms the spirit, and the spirit forms the *Heihai*.\n\nWhen the *Heihai* disperses, it becomes mist; when it condenses, it becomes form and shadow. Externally, it transforms into an Immortal; internally, it transforms into the True One. Above, it binds the *San Yuan* [Three Origins]; below, it binds all things, cultivating the *Yi Zhen Jun* [One True Venerable].\n\nRecite the invocation while closing the eyes: Cultivate all hundred spirits into white *Heihai*, like a *yin* [female] emerging from the *Xuan Zhu* [Mysterious Pearl] through the *jing kong* [passage], entering my mouth. After lingering, feel the white *Heihai* descend through the *jing kong*, exit the soles of the feet, the feet’s center, and the *guan lian* [crown of the head], permeating the entire body with the white *Heihai* for a long time. The white *Heihai* suddenly transforms into purple clouds, lingering before entering my mouth, descending into the head, filling the five *zàng*, and saturating the abdomen. It then exits through the soles of the feet and palms, descending to the *jing kong* and *guan lian*. The body lingers as the purple clouds merge, and the form becomes indistinct.\n\nAfter a moment, again cultivate the purple *Heihai* filling the left and right chambers. Then visualize *feng qi* [wind *qi*] emerging from the mouth, fanning the purple clouds until they swirl and form a True Person—a male figure three inches tall, named *Dadong Di Yi Zun Jun* [Great Cavern Emperor, One Venerable Lord].\n\nAgain, visualize the Venerable Lord entering my mouth beneath the tongue, ascending to the *Zifang Gong* [Purple Chamber Palace] within the *Liu He* [Six Harmonies]. He sits facing outward, holding the *Zhao* [Manifestation] of the Five *Ji* [Records] in his left hand and the Five *Fu* [Symbols] in his right. On the left side of his mouth shines the sun’s nine-rayed light; on the right, the moon’s lingering light—sometimes white, sometimes red. The luminous *Heihai* descends into the five *zàng*, six *fǔ*, and hundred joints, filling the body like the sun. Recite the incantation with the heart:\n\n*\"Great Cavern Emperor One,\nToo Subtle and Venerable,\nFather Serene, Mother Still,\nTwo merging, dual unity,\nHundred Truths in great chaos,\nOne return, nature born,\nBody binds the Eight *Yin*,\nTransforming into the Primordial Infant,\nSun and moon’s precious light,\nMoving my form,\nTaiyi above,\nWilling to align with the Emperor,\nNihuan’s precious jade,\nFive *zàng* radiant,\nLong united with sun and moon,\nHolding the Cavern Scripture,\nStanding as the Immortal Lord,\nSpirit ascending to Shangqing,\nThirty-nine youths,\nFully corresponding to the Yu Ting [Jade Court].\"*\n\nAlways cultivate the *Dadong Di Yi Zun Jun* within the upper lip, beneath the nose, and between the inner and outer teeth. In sitting, standing, or moving, keep this in mind. The Venerable Lord’s mouth holds the sun and moon, illuminating the ten thousand caverns.\n\nBefore practicing *qi*, first cultivate the candle flame in the heart, burning through the body above and below, dispelling the *qi* toxins of the five grains. If not burned, cold will cling; if burned too long, it will cause agitation. After cultivating the flame, begin *qi* practice without distraction. Let the *qi* flow subtly—it will naturally permeate. Guide it with intention.\n\nTo practice the *qi* method, first reduce food intake gradually—do not do so abruptly. After a year, the *qi* will be full, and hunger will naturally vanish.\n\nThe six *shen* of the kidneys are:\n*Siji* [Master of Ceremonies], *Silu* [Recorder], *Siming* [Master of Fate], *Sili* [Supervisor], *Xiaowei* [Marshal], and *Qing* [Minister].\nLeft and right, they divide into eight hundred fifty.\n\nThe *jingling* [precise and numinous] *qi* of the sun and moon is the root of humanity. The left is the *Xuuanmiao Jun* [Mysterious and Subtle Lord], the right the *Xuuan Yuan Jun* [Primordial Lord].\n\nThe *Xuuan* and *Yuan* [Void and Origin] generate each other; cold and heat complete each other.\n\nMaster *Chonghe* instructed the *Longgang* [Dragon Ridge] *qi*-cultivation method:\n*\"What the form relies upon is *qi*; what *qi* depends on is the form. When *qi* is complete, the form is whole; when *qi* is exhausted, the form dies. Thus, those who nurture life refine both form and *qi* to preserve existence. There is no form without *qi*, nor *qi* without form. The two are inseparable—is this not clear?\"*\n\nI have long admired the Dao, searching through scriptures and histories, practicing restraint for over ten years. What I have seen and heard has never fully satisfied me.\n\nDuring the *Dali* era, I encountered *Lao Fu Wang Gong* [Master of Lao Fu] returning from *Bei Yue* [Northern Peak], leaning on his staff at the post station, gazing at me as before.",
      "overlap_context": " rub them together until they are warm, wiping the face until the skin wrinkles. Like a warrior drawing a stiff bow, pull left and right three times. Clench the fists and strike forward and backward several times, then lift both hands upward as if supporting a thousand-pound stone, alternating left and right.\n\nSit upright, fists clenched, and lean the body sideways like a mountain being pushed aside, alternating left and right. Slowly extend the fists forward, then swiftly retract them backward.",
      "start_char": 2481,
      "end_char": 3694,
      "start_sentence": 106,
      "end_sentence": 135,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 25.76718807220459,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\长生胎元神用经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "余意其异人也，延之与语，果乃有道之君子。 哀余恳志之心，便赐吐纳修真之道，悉传於口。 其人言五牙、六字及诸服熙法皆为收炁。 收炁刚劲，非俗中之士所宜也。 至如纳炁是日胎息，唯有行炁是正道，修身之基本也。 进取诀：凡欲服炁，先须高雅密室常以左右焚熏陆香，仍以状荐厚软，高三二尺，温暖，枕高一寸，夜半之后生炁之时，五更睡觉之初，呵出腹中浊羔九通，若要调息即不在半夜五更，但看天炁柔和，腹空之时。 导引行炁，闭目，叩齿三十六通，以警身中神，以手按目两毗，按鼻左右，旋耳摩面，拔关托石，随事少少引，宣畅百节，乃以舌柱上聘，欲掠津液满口中，即以咽下三通，使进於五脏，面有光泽，兀然放神纵心，自在如大空身，万累都遣，然后淘之，皆须闭口握固，以闭玄房与却精邪。 初学服炁，炁未流行不得握固，待到百日止半年，觉神炁通畅，身上汗出，可握固为之。 淘炁诀：凡人五脏各有一神，夜外闭息，如觉后服炁，先乃淘转腹内，令宿食故炁得出，然后调脉其法，仰外闭目，握固，仍两拳於乳侧，坚两膝，举背及尸，闭炁鼓海中之炁，使内外斡而转之，呵出一九遍则调之。 调炁诀：夫调炁之时，妙在乎咽。 世人因依外炁以为内炁，而不能分别。 吐纳在密而用炁，勿使错性。 故知人禀天地而生，身自有元炁而理。 每咽纳则内炁与外炁相应，自然海中随炁而至收吐候中日一吐纳之际则辄闭口速鼓而咽之，令使郁郁然，有声汨汨，左边而下经二十节，如水沥坎，闻之分明也。 别从右而下，如此则内炁皎然，而别以意送下，用手摩之，令入炁海。 炁海，脐下三寸，亦谓之下丹田。 初服炁人上焦未通，以手摩而助之，速令快下咽，或未下微用少力蹙而咽之，务令有声而下，若觉炁通流，不摩亦得。 三闭口三连咽，更二乾咽，号日云行。 一湿咽，取口中津液和而咽之，谓之雨施。 初服炁人，炁未通流，每一两咽则施行之，不遽得三连咽也。 一年细功方得小成，二年三年方得大功也。 行熙诀日：下丹田近后有二穴，通於脊脉，上连泥丸。 泥丸，脑官。 每三连咽则速存归下丹田中，以意想此元炁，令入二穴，作两条白熙夹脊双引上入泥丸，熏蒸诸宫，森然遍下毛发头面项颈两臂手指，一时下入胸膈、五脏、皮肤、中丹田心宫，次第灌注，却历下丹田，至於三三星遍尸脑，下入膝踝，达於涌泉脚心也。 所为分一炁而理，鼓之以雷霆，润之以风雨，亦由天地之有泉源，非云雷而腾动，则元以润於万物。 人有津液，非漱咽则元以灌於五脏，还精补脑，非交合则不能走而上之。 咽服内炁，非吐纳则不能相引而用之。 是知淡泊之道，运用之理，所以法天像地也。 夫存想身中浊恶结滞邪炁淤血被正炁荡涤，皆从手足指节端然而出，为之散炁则展手指，不须握固，如此一度则是一通，通则无病，又复调之使炁平平，又复鼓咽，一如前也。 闲鼓咽至三十六咽为之小成也，若未绝粒，常须少食，务令腹空，然得虚静元问坐外，腹空则咽之十度，自然三百六十咽矣。 若久服炁通顿至三百六十亦得，为之中成。 一千二百息，为之大成。 如不能炼形易质，凡同枯木，元精光也。 炼炁诀曰：余暇服炁。",
      "translated_text": "I deemed him a singular man and invited him to converse, and indeed he proved to be a virtuous sage of the Dao.\n\nPitying my earnest resolve, he immediately bestowed upon me the methods of *tuna*—breath refinement and *zhentian*—cultivation of the True—transmitting them all verbally.\n\nHe spoke of the *Five Teeth* and *Six Characters* methods, as well as all *xī* [circulation] practices, as means of *shōu qì*—gathering *qi*.\n\nGathering *qi* is vigorous and forceful, not suited to ordinary mortals.\n\nAs for *nà qì*—receiving *qi*, it is the *tāixī*—embryonic breathing. Only *xíng qì*—conducting *qi* is the true Dao, the foundation of self-cultivation.\n\n**The Method of Advancing *Qi*:**\nFor those who wish to refine *qi*, first, one must dwell in a lofty, secluded chamber, burning *lùxiāng*—aloewood—on either side, using a thick, soft cushion three to four inches high for reclining, with a pillow one inch high. After midnight, when *qi* first stirs, or at dawn, when waking, exhale nine times from the abdomen to purge its turbid *qi*. If one wishes to regulate breathing, it need not be at midnight or dawn, but rather when the celestial *qi* is gentle and the abdomen is empty.\n\n**Conducting and Circulating *Qi*:**\nClose the eyes, strike the teeth thirty-six times to awaken the body’s spirit, press the hands against the outer corners of the eyes, then the sides of the nose, rotate the ears and stroke the face, and lift the *guān*—passages—to support the *shí*—stone (anus). Gradually guide and invigorate all joints, then press the tongue against the palate to gather saliva. Once the mouth is filled, swallow three times, directing the *qi* to the five *zàng*—viscera, making the face radiant. Then, relaxed and at ease, let the mind expand freely, as boundless as the void, casting off all burdens. Only then may one practice *tāo*—refining *qi*, closing the mouth firmly to seal the *Xuánfáng*—Mysterious Chamber (vagina) and retain the essence.\n\nFor beginners, before *qi* flows freely, one must not yet practice retention. After one hundred days to half a year, when the spirit-*qi* circulates smoothly and sweat appears, then retention may begin.\n\n**The Method of Refining *Qi*:**\nEach of the five *zàng* has its own spirit. At night, when closing the breath externally, if one feels *qi* rising after refinement, first stir the abdomen to expel stale food and old *qi*. Then, regulate the pulse: lie on your back, close the eyes, retain the breath, clench the fists at the sides of the breasts, straighten the knees, lift the back and torso, and close the *qi* to stir the *Hǎi*—Sea (lower abdomen). Make the internal and external *qi* rotate, exhaling nine times before regulating it.\n\n**The Method of Regulating *Qi*:**\nThe art of regulating *qi* lies in swallowing.\n\nCommon folk mistake external *qi* for internal *qi*, unable to distinguish. *Tūnà*—breathwork—must be practiced in seclusion, lest the nature be misused.\n\nThus, knowing that humans are born of Heaven and Earth, the body inherently possesses primal *qi* and its principles. Each time one swallows and receives, the internal *qi* harmonizes with the external. Naturally, the *Hǎi*—Sea’s *qi* responds, rising and falling with the sun and moon. At the moment of inhalation and exhalation, close the mouth swiftly and swallow, making a resonant, gurgling sound—*shuìshuì*—as if water dripping into a vessel, distinctly audible. First, guide it down the left side through twenty joints, like water seeping into a well. Then, from the right, thus making the internal *qi* luminous. With intent, send it downward, using the hands to assist, directing it into the *Qìhǎi*—Sea of *Qi* (lower abdomen, three inches below the navel), also called the *Xià Dāntián*—Lower Elixir Field.\n\nFor beginners, the upper *jiāo*—burner is not yet open. Use the hands to assist, swiftly guiding the *qi* down the throat. If it does not descend easily, use slight force to press and swallow, ensuring a sound as it descends. If the *qi* flows freely, no assistance is needed.\n\nThree swallows with the mouth closed, followed by two dry swallows, is called *Yúnxíng*—Cloud Movement. One wet swallow, taking saliva and swallowing it, is called *Yǔshī*—Rain Application.\n\nFor beginners, before *qi* flows freely, practice two swallows followed by *Yǔshī*. Only later will three swallows be achieved. A year of diligent practice yields minor success; two or three years bring great achievement.\n\n**The Method of *Xī* Circulation:**\nNear the Lower Elixir Field are two orifices leading to the spinal *mài*—vessels, connecting to the *Níwán*—Mud Pellet (pineal gland). The *Níwán* governs the brain.\n\nAfter three swallows, swiftly store the primal *qi* in the Lower Elixir Field. With intent, imagine this *qi* entering the two orifices, forming two white *xī*—circulations—along the spine, ascending into the *Níwán*. This steams and nourishes all the palaces, making the hair and skin of the head, neck, arms, hands, and fingers bristle. Then, it descends into the chest, the five *zàng*, the skin, and the Middle Elixir Field—heart palace—sequentially irrigating them before returning to the Lower Elixir Field. It passes through the *Sān Sān Xīng*—Three-Three Stars (perineum), down to the knees and ankles, reaching the *Yǒngquán*—Gushing Spring (sole).\n\nThus, dividing one *qi* to govern all, stirring it like thunder and nourishing it like wind and rain—just as Heaven and Earth possess springs, not relying on thunder to agitate, but on essence to nourish all things.\n\nHumans have saliva; without rinsing and swallowing, essence cannot irrigate the five *zàng*. Without retaining essence to nourish the brain, it cannot ascend through copulation. Without *tūnà*—breathwork, internal *qi* cannot be drawn upon.\n\nThus, the Dao of simplicity and moderation, the principles of application, are modeled after Heaven and Earth.\n\nIf one visualizes the turbid, malevolent, stagnant, and pathogenic *qi* within the body, as well as congealed blood, being purged by the true *qi*, they will naturally exit through the fingertips. To disperse *qi*, spread the fingers without retention—each such movement counts as one *tōng*—passage. When *qi* flows freely, there is no illness. Then, regulate it to make the *qi* even, and again, practice swallowing as before.\n\nLeisurely swallowing thirty-six times constitutes minor achievement. If not yet abstaining from grain, one must eat sparingly, ensuring the abdomen is empty. Then, in a state of emptiness and tranquility, seated outside, swallow ten times naturally—this equals three hundred sixty swallows.\n\nIf practiced for a long time until *qi* flows freely, reaching three hundred sixty swallows also counts as intermediate achievement. One thousand two hundred breaths constitute great achievement.\n\nIf one cannot refine the form and alter the substance, they remain like withered wood, their essence exhausted.\n\n**The Method of Refining *Qi*:**\n*\"In my leisure, I refine *qi*.\"*",
      "overlap_context": "ine both form and *qi* to preserve existence. There is no form without *qi*, nor *qi* without form. The two are inseparable—is this not clear?\"*\n\nI have long admired the Dao, searching through scriptures and histories, practicing restraint for over ten years. What I have seen and heard has never fully satisfied me.\n\nDuring the *Dali* era, I encountered *Lao Fu Wang Gong* [Master of Lao Fu] returning from *Bei Yue* [Northern Peak], leaning on his staff at the post station, gazing at me as before.",
      "start_char": 3694,
      "end_char": 4917,
      "start_sentence": 136,
      "end_sentence": 169,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 16.23854970932007,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\长生胎元神用经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "入室脱衣，散发仰外，舒展两手，勿得握固，梳头发令布於席上，则以调炁咽之。 讫，便乃冥心绝想，任炁所行，如过理绝闷即以吐之，喘息稍急则须调之，候炁通流渐渐加至二十．三十四十五十，即令通身汗出，如有此状，即是效也。 安心定意，且外勿起冲风，候神情爽朗，若炁昏欲外，勿得行炁，四体不畅亦勿为之。 十五日一度为之。 闭炁诀曰：忽有修养乖宜，偶生病患，速投密室，依调炁法布其手足，则以调炁咽之，想念所苦之处，以意想注，闭炁攻之。 若是炁极则调之，讫，更以相续不断攻之，炁急则止，熙调亦复攻之，或二十、三十、四十、五十，攻觉所苦处，汗出通润即止。 如未痊，则每日半夜之后五更昼日之前，频频作意攻，以差为度，但有疾处攻之，元不愈也。 布熙诀曰：布炁与人疗疾，先问彼患人五脏所苦之处，取己之炁布入彼人身，止令病者面其方所，息心静虑．。 此布炁亦似咽炁，其疾自消，百邪永绝矣。 调炁诀曰：夫人食五味，五味各归一脏，每脏浊炁皆纳於口，亦出於口。 又六腑三焦秽滞并投合成浊炁，每至睡觉之初，荤秽之炁自不堪闻。 凡口乾舌涩，面两颊光泽不能吃食，此是上焦热候，即须依门户大开口一二十通，即呜天鼓七下，九下即以咽之，津液但候口中清甘泉出，即是热退，五脏冻也。 若以口中津液玲淡，食饮无味，心间佯佯不受水谷，即是玲候，即以吹理之。 饮食守护诀曰：凡服炁之人吃物须有避忌，可食者物则食，不可食者莫食，食必有损正炁则脉乱，有所益则常食，元益勿食。 每日平旦食少淡粥或胡麻子粥，益人脾炁，兼足津液。 日午食少淡缅饵饪，饼亦得，不得乘热吃之，恐乱正炁。 葱蓝羹亦好，诸饭食宜令软熟甜淡，大麦经四时好食，不必多矣。 临时堪食者，食之。 若有人静修斋戒亦升仙矣。 三十六禽直日及本命属，并不可食，枣、栗、芋子、麦、英，不宜多食，发动邪炁。 有单南蜀草亦得食，乍可微微a似饥，不得辄令伤饱，饱则伤心，五脏闭塞，炁难行也。 热物咸酸辛辣陈败之物，炁难行也，食了即须呵却腹中之毒炁，令人肠胃虚静，若误食一口，毒物腹内有毒也，切宜慎之。 每欲食时，先须咽三五口炁，与食为主，兼吞三二颗生炁豆，引炁通三焦，和脏腑，明目，驱趁恶物，消谷食以助正炁，功用不可备举。 《太清经》中别有方法。 夫服炁后有秽炁，下泄不可忍，留恐疾生耳。 每日空腹随性饮酒好者一杯，冬即温饮，夏即玲饮，亦能助炁遣诸邪炁，所戒在多，多即昏乱，醉即伤神，臧炁损寿，若事不获已且饮罢即呵出三五十下，饮即大开口，呵遣出缅够，毒即不醉也，亦不中酒，不失酒食味。 不用冲生产之家、死亡之秽，乘六畜走骤，勿冲臭秽，有损正炁，若卒逢之，速宜避之，如恶炁入腹，即以调炁荡涤逐出。 如饮酒，即饮三两杯，不饮即用正炁淘出，如不肯出不须过理逼之，但任渐渐出之。 若此上三焦热终须调炁理之，使炁平和。 少食油腻，勿令触正炁，若曾犯不令再犯服炁，一年通，三年功成，元炁遂凝，拟有触犯不能为患也。 日服千咽，亦不惧多返也，渐从此始矣。 经曰：炁化为血，血化为精，精化为髓，一年易炁，二年易血，三年易脉，四年易肉，五年易髓，六年易筋，七年易骨，八年易发，九年易形，三万六千神皆化为仙，号曰真人矣。",
      "translated_text": "Entering the chamber, remove your clothing, loosen your hair, and recline facing outward, stretching both hands freely without clenching them. Spread your hair across the mat, then proceed with the **Method of Regulating *Qi*** by swallowing.\n\nUpon completion, enter a state of **mystic heart** (*míngxīn*) and **cut off thought** (*juéxiǎng*), allowing the *qi* to move naturally. If it reaches the **threshold of perception** (*guò lǐ*) and feels constricted, exhale it. If breathing becomes slightly hurried, regulate it again. When the *qi* flows smoothly and evenly, gradually increase the swallows to twenty, thirty, forty, or fifty—until the entire body sweats. If this occurs, it is a sign of success. Remain composed and still, avoiding any sudden gusts of external *qi*. Wait until your spirit feels bright and clear. If the *qi* grows sluggish and seeks to escape, do not force it. If your limbs feel stiff and unyielding, likewise refrain. Practice this once every fifteen days.\n\n**The Method of Closing *Qi*:**\nIf at any time your cultivation encounters **unfavorable conditions** (*guāiyí*), or if illness suddenly arises, quickly retreat to a secluded room. Arrange your hands and feet according to the **Method of Regulating *Qi***, then swallow to close the *qi*. Focus your mind on the afflicted area and, with intent, direct your **closed *qi*** (*bì qì*) to attack it. If the *qi* is extreme, regulate it first; upon completion, continue relentlessly until the *qi* is expelled. If the *qi* is urgent, cease; if it is sluggish, regulate and then attack again—twenty, thirty, forty, or fifty times. When the afflicted area feels relieved and sweat emerges, stop.\n\nIf the illness does not abate, then between midnight and the fifth watch (*wǔ gēng*), before dawn, repeatedly gather your intent to attack, until the symptoms ease. Only target the afflicted area; if the *qi* does not heal, it will not mend.\n\n**The Method of Distributing *Qi*:**\nWhen distributing *qi* to heal others, first inquire about the **afflicted areas** (*suǒkǔ*) of their **Five Zang** (*wǔzàng*) organs. Transfer your own *qi* into their body, positioning them so that the afflicted area faces you. Quiet the mind and still the thoughts.\n\nThis **distribution of *qi*** (*bù qì*) resembles the **swallowing of *qi*** (*yàn qì*), and the illness will naturally dissipate. All **hundred evils** (*bǎi xié*) will be permanently banished.\n\n**The Method of Regulating *Qi*:**\nHumans consume the **Five Flavors** (*wǔwèi*), each of which corresponds to one of the **Five Zang** organs. The turbid *qi* of each organ is either inhaled or exhaled through the mouth. Moreover, the **Six Fu** (*liùfǔ*) and **Three Jiao** (*sānjiāo*) accumulate impurities, which merge into turbid *qi*. When sleep first overtakes you, the **greasy and foul *qi*** (*hūn nì qì*) becomes unbearable.\n\nIf the mouth is dry and the tongue rough, or if both cheeks glow with a radiant luster and the person cannot eat, this is the **Upper Jiao heat sign** (*shàngjiāo rè hòu*), and you must immediately employ the **Great Opening method** (*dāngé dǎkāi*)—swallowing twenty to thirty times, then exhaling loudly seven or nine times, and finally swallowing. When the **saliva** (*jīnyè*) in the mouth becomes clear and sweet, like a **spring’s pure waters** (*qiánchū*), the heat has retreated, and the **Five Zang** are cooled.\n\nIf the saliva in the mouth is **pale and insipid** (*língdàn*), and food and drink lack flavor, while the heart feels **distended and unwilling to accept nourishment** (*yángyáng bùshòu shuǐgǔ*), this is the **cold sign** (*líng hòu*), and you must exhale to **dispel it** (*chuīlǐ zhī*).\n\n**The Method of Nourishing After Eating:**\nThose who practice *qi* cultivation must be cautious about what they consume. Eat what is beneficial, avoid what is harmful. If food disrupts the **true *qi*** (*zhèng qì*), the pulse will become disordered. If it aids the *qi*, eat it regularly; if it harms, avoid it entirely.\n\nEach morning at dawn, consume a small amount of **plain congee** (*dàn gāo*) or **hemp seed congee** (*húmázi gāo*), which nourishes the **spleen *qi*** (*pí qì*) and supplements the **saliva** (*jīnyè*). At noon, eat a small amount of **plain rice porridge** (*miǎnrì yàn*) or **steamed rice cakes** (*bǐng*), but never while hot, lest it disrupt the **true *qi***. **Onion and blue-green algae soup** (*cōnglán gēng*) is also beneficial. All grains should be soft, well-cooked, and slightly sweet. **Barley consumed over four seasons** (*dàmài jīng sìshí*) is excellent, but do not overindulge.\n\nWhen hunger arises, eat as needed. If someone practices **stillness** (*jìngxiū*) and **fasting** (*zhāijiè*), they may also **ascend as an immortal** (*shēngxiān*).\n\nThe **Thirty-Six Fowl** (*sānshíliù qín*), **straight days** (*zhí rì*), and **days of one’s birth year** (*běnmìng shǔ*) must not be consumed. **Dates, chestnuts, taro, wheat, and beans** (*zǎo, lì, yùzi, mài, yīng*) should not be eaten in excess, as they **agitate evil *qi*** (*fādòng xié qì*). **Southern Shennong grass** (*dān nán shù cǎo*) may be eaten in moderation. When hunger is slight, eat lightly—do not overindulge, lest it **injure the heart** (*shāngxīn*). Overindulgence causes **closure of the Five Zang** (*bìsè*), making *qi* circulation difficult.\n\n**Spicy, salty, sour, acrid, and stale foods** (*rè wù, xiánsuān xīnlà chénbài zhī wù*) hinder *qi* flow. After eating, immediately exhale to **dispel the poisonous *qi*** (*hēquè fùzhōng zhī dú qì*), keeping the intestines and stomach **empty and tranquil** (*xūjìng*). If even a mouthful is mistakenly consumed, the **poisonous residue** (*dúwù fùnèi*) will linger within. Be extremely cautious.\n\nBefore eating, swallow three to five breaths of *qi* to harmonize with the meal. Additionally, ingest two or three **raw *qi* beans** (*shēng qì dòu*), which **guide the *qi* through the Three Jiao** (*yǐn qì tōng sānjiāo*), **balance the Zang-Fu** (*hé zàngfǔ*), **clarify the eyes** (*míngmù*), **expel harmful substances** (*qūbèn èwù*), and **dissolve grains** (*xiāo gǔshí*) to **assist the true *qi***. Their benefits are too numerous to recount. The *Tai Qing Jing* contains additional methods.\n\nAfter cultivating *qi*, if **foul *qi*** (*suì qì*) descends and cannot be endured, lingering may **invite illness** (*yǒu qí shēngbìng*). Each day, before meals, drink one cup of wine as your **nature dictates** (*suíxìng*), warming it in winter and cooling it in summer. This also **aids the *qi*** (*zhù qì*) and **expels all evil *qi*** (*qiān xié qì*). The warning lies in excess—too much causes **sluggishness and confusion** (*hūnluàn*), intoxication **injures the spirit** (*shāngshén*), and **stagnant *qi*** (*zàng qì*) shortens lifespan. If drinking is unavoidable, immediately exhale twenty to fifty times afterward. Open the mouth wide while exhaling to **dispel the turbidity** (*chuīqīan miǎnzàng*), and the **poisonous effects** (*dú*) will not take hold. You will not be intoxicated, nor will you be affected by the wine’s **overpowering *qi***. The taste of wine and food will remain undiminished.\n\nAvoid **raw meat** (*chōngshēng chǎnzhì*), **corpse *qi*** (*sǐwáng zhī suì*), or **the *qi* of slaughtered livestock while in motion** (*chéng liùxìng zǒuzòu*). Do not **rush into foul odors** (*chōngchōng chòusù*), as they **damage the true *qi***. If encountered unexpectedly, quickly **avoid them** (*bìzhī*). If **evil *qi* enters the abdomen** (*è qì rù fù*), immediately employ the **Method of Regulating *Qi*** to **flush and expel it** (*dǎngé dǐdí*).\n\nIf drinking wine, consume three cups; if not, use **true *qi*** to **rinse it out** (*tāochū*). If it refuses to leave, do not **forcefully press** (*bùyòng guò lǐ pòzhī*), but allow it to **gradually exit** (*rèn jiànjiàn chūzhī*). If the **Upper Jiao heat** persists, you must **regulate the *qi*** to **harmonize it** (*shǐ qì pínghé*).\n\nConsume little **oily and greasy food** (*yóunì*), ensuring it does not **contact the true *qi***. If you have previously consumed such foods, do not repeat the offense while cultivating *qi*. After one year of **uninterrupted flow** (*tōng*), and three years of **fulfilled practice** (*gōngchéng*), the **true *qi* will solidify** (*zhèng qì suìníng*), and even if you encounter such foods again, they will cause no harm.\n\nPractice **a thousand swallows daily** (*qiān yàn*), and you will have no fear of **excessive return** (*duō fǎn*). Begin gradually from this point.\n\nThe **Scripture** (*Jīng*) states:\n*\"The *qi* transforms into blood, blood into essence, essence into marrow.\nOne year transforms the *qi*, two years the blood,\nthree years the pulse, four years the flesh,\nfive years the marrow, six years the sinews,\nseven years the bones, eight years the hair,\nnine years the form.\nAfter thirty-six thousand days of divine cultivation,\nall [36,000] *shén* [spirits/aspects] transform into immortality,\nand one is called a **True Person** (*Zhēnrén*).\"*",
      "overlap_context": " state of emptiness and tranquility, seated outside, swallow ten times naturally—this equals three hundred sixty swallows.\n\nIf practiced for a long time until *qi* flows freely, reaching three hundred sixty swallows also counts as intermediate achievement. One thousand two hundred breaths constitute great achievement.\n\nIf one cannot refine the form and alter the substance, they remain like withered wood, their essence exhausted.\n\n**The Method of Refining *Qi*:**\n*\"In my leisure, I refine *qi*.\"*",
      "start_char": 4917,
      "end_char": 6190,
      "start_sentence": 170,
      "end_sentence": 201,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 30.51886248588562,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\长生胎元神用经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "修功不息，关节相连，五脏相固，内炁不出，外炁不入，寒暑不侵，升腾变化，寿同三光。 休根诀：依前勤修三年之后，正炁流通，精髓实满，百神守卫，三尸逃走，自不欲闻五谷之炁，常思不食要绝难也，但觉腹空即须咽之，元问早晚，何须约限，兼可以药物相问服之，人多不解，服熙区区，终日以药为务，故为未得，亦非上士之用也。 《黄庭经》云：百谷之实土地精，五味外美邪魔腥，臭乱神明胎炁零，那能返老得还婴。 三魂忽忽魄靡倾何不食炁太和精。 故能不死入黄宁。 守护诀云：世人率多嗜欲，古今共然。 仙经曰：夫人临终方始惜身，罪足而思迁善，病成而求其药，天网己发，何以追之。 贤者固未危之命，不依人寰，摄心慕道。 道者，炁也。 炁者，身之主，主者身之命，命者身之根也。 若惜精保炁，始全其生。 行炁诀曰：道者，炁也。 保炁得道，即长生矣。 神者，精也。 精在则神明，精散则神去。 精者血脉之川流，辅骨之灵液，精尽则骨枯，骨枯则死，非固道矣。 道者务其精，常须存守彭祖口付务成子日唯闭其精，不畏寒暑。 其人自然恬静。 余数闭之。 经曰：道不在烦，能不思声色，不思荣辱，不劳形体。 常须导引，内炁安息，可得千岁。 更求上药，可能长生。 如能不泄，是名服精。 夫若万虑皆息，为其寡欲，可以增寿也。 每朝早旦未起之时，先须叩齿七下至九下，面束跪坐，调黑平和，鼻取清黑入，口吐浊黑出，以手相摩，随事导引，舌柱上锷，集漱津液满口即咽，三咽则止。 即以次消息头上至脚心下各七遍，为之治诸骨节，通流黑脉，宣泻滞浊，用补虚劳也。 去三尸九虫方 夫尸者有九虫：一伏虫，长四分； 二蛔虫，长一尺； 三白虫，长一寸； 四肉虫，状如烂杏； 五肺虫，状如蚕； 六胃虫．’状如虾蟆； 七膈虫，状如瓜瓣； 八赤虫，状如生肉； 九蛲虫，状如菜虫。 唯有伏虫是诸虫之主，蛔虫贯心则杀人，白虫相生，子孙转大至长四五尺，亦能杀人，肉虫令人烦闷，肺虫令人咳嗽，胃虫呕逆，膈虫令人好唾，赤虫令人腹呜，蛲虫居人胴肠，多则令人患癞痔，亦为疮疥风等。 人身中皆有九种，不必尽多，别有治方： 管众五分，主蛲虫 白翟芦十二分，主蛔虫蜀漆三分，主白虫芜萸五分，主肉虫石蚕五分，主伏虫厚朴三分，主脉虫狼牙四分，主胃虫僵蚕四分，主肠虫。 雷丸子六分，主赤虫。 一名鸦独，二名土竽子藤，如葛而细叶 右件九味，皆以文武火焙令黄，细细捣罗，炼蜜丸如桐子大。 每日粉浆水内服五丸，一日三服，加至十丸。 十二日微取滞浊，六十日百病愈。 服者量力，且令少即妙。 妇人若服，即须斋戒，即得服之。 长生胎元神用经竟",
      "translated_text": "Unceasingly cultivate the **fulfilled practice** (*gōngchéng*), linking joints and solidifying the five viscera—\ninternal *qi* does not escape, external *qi* does not enter,\ncold and heat cannot intrude.\nAscending and transforming, life aligns with the Three Luminaries.\n\n**Resting the Root Method** (*Xiūgēn Jué*) states:\nAfter diligently practicing for three years as before,\nthe true *qi* flows freely, essence and marrow are replete,\na hundred spirits guard, the Three Corpses flee—\none naturally no longer desires the *qi* of the Five Grains,\nconstantly pondering the difficulty of absolute abstinence.\nYet when hunger arises, simply swallow—\nno need for fixed times, morning or evening.\nOne may also combine this with medicinal elixirs.\nMost people fail to grasp this:\nthey consume mere trifles all day, obsessed with drugs,\nthus never attaining it—\nthis is not the path of the superior adept.\n\nThe *Huángtíng Scripture* (*Jīng*) says:\n*\"The grains’ fruits are earth’s refined essence,\nfive flavors’ allure—external demons’ stench.\nTheir stink confuses the spirit, scatters the embryonic *qi*—\nhow could one reverse aging, return to infancy?\"*\n\nThe Three Souls wander, the Corporeal Souls drift—\nwhy not nourish the **True One’s** (*Tàihé*) pure essence?\nThus, one may enter **Yellow Peace** (*Huángníng*) and not die.\n\nThe **Guardian Method** (*Shǒuhù Jué*) says:\nAll mortals crave desires—\nthis has been true from ancient to modern times.\nThe Daoist Scriptures state:\n*\"Only when death approaches do the wise begin to cherish their bodies,\ntheir crimes fulfilled, they seek to change their ways.\nWhen illness strikes, they scramble for remedies—\nthe Heavenly Net has already been cast.\nHow can they now escape?\"*\n\nThe virtuous do not wait for peril to value life;\nthey withdraw from the world, cultivate the heart, and aspire to the Dao.\nThe Dao is *qi*.\n*Qi* is the master of the body;\nthe master is the body’s life;\nlife is the body’s root.\nIf one cherishes essence and preserves *qi*,\nonly then is life fully sustained.\n\nThe **Method of *Qi*-Cultivation** (*Xíngqì Jué*) says:\nThe Dao is *qi*.\nPreserving *qi* attains the Dao—\nthus, longevity is achieved.\nThe spirit is essence.\nWhen essence remains, the spirit is bright;\nwhen essence scatters, the spirit departs.\nEssence is the flowing river of blood and vessels,\nthe vital fluid nourishing the bones.\nWhen essence is exhausted, the bones wither—\ndeath follows. This is not the fixed Dao.\n\nThe Daoist pursues essence;\none must always store and guard it,\nas **Pengzu** instructed **Wùchéngzǐ**:\n*\"Close the essence, fear neither cold nor heat.\nSuch a person naturally remains serene.\nI have spoken much of this.\"*\n\nThe Scripture says:\n*\"The Dao lies not in agitation.\nDo not lust after sounds and colors,\ndo not covet honor or shame,\ndo not weary the body.\nConstantly guide and draw—\nwhen internal *qi* rests in peace,\none may attain a thousand years.\nSeeking further the supreme elixir,\nlongevity becomes possible.\nIf one does not leak [essence],\nthis is called **nourishing essence** (*fújīng*).\nWhen all ten thousand thoughts cease,\ndesires grow few—\nthus, life is prolonged.\"*\n\nEach morning, before rising,\nfirst strike the teeth seven to nine times,\nthen kneel with face bound,\nharmonizing the black *qi*.\nDraw in the clear black through the nose,\nexpel the turbid black through the mouth,\nrubbing hands together as you do.\nGuide and draw as needed,\npress the tongue to the upper palate,\ngather and swallow the saliva until the mouth is full—\nswallow three times, then stop.\nNext, passively circulate from the crown to the soles,\nseven times each way,\nto treat the bones and joints,\nunblock the black vessels,\ndrain stagnant turbidity,\nand supplement exhaustion.\n\n**Method to Eliminate the Three Corpses and Nine Worms:**\n\nThe Corpses harbor nine worms:\n1. The **Lurking Worm** (*fúchóng*), four *fēn* long;\n2. The **Roundworm** (*huíchóng*), one *chǐ* long;\n3. The **White Worm** (*báichóng*), one *cùn* long;\n4. The **Flesh Worm** (*ròuchóng*), like rotting apricots;\n5. The **Lung Worm** (*fèichóng*), like silkworms;\n6. The **Stomach Worm** (*wèichóng*), like toads;\n7. The **Diaphragm Worm** (*géchóng*), like gourd slices;\n8. The **Red Worm** (*chìchóng*), like raw meat;\n9. The **Threadworm** (*nǐchóng*), like vegetable worms.\n\nOnly the Lurking Worm rules the others.\nThe Roundworm, piercing the heart, kills;\nthe White Worm multiplies—\nits offspring grow to four or five *chǐ*, also lethal.\nThe Flesh Worm causes restlessness,\nthe Lung Worm induces coughing,\nthe Stomach Worm provokes vomiting,\nthe Diaphragm Worm makes one spit excessively,\nthe Red Worm causes abdominal rumbling,\nthe Threadworm, dwelling in the intestines,\nif numerous, causes leprosy, hemorrhoids,\nand sores or eczema.\n\nAll nine may reside in the body, though not always in full.\nOther treatments exist, but here is one remedy:\n\n**Prescription to Eliminate the Three Corpses and Nine Worms:**\n- **Tube Crow** (*guǎnzhòng*) – five *fēn* – controls Threadworms\n- **White Dwarf Rhubarb** (*báizhí lú*) – twelve *fēn* – controls Roundworms\n- **Sichuan Lacquer** (*shǔqī*) – three *fēn* – controls White Worms\n- **Chinese Wolfberry** (*gōuqí*) – five *fēn* – controls Flesh Worms\n- **Stone Silkworm** (*shícán*) – five *fēn* – controls Lurking Worms\n- **Thick Bark** (*hòupò*) – three *fēn* – controls Lung Worms\n- **Wolf’s Tooth** (*lángyá*) – four *fēn* – controls Stomach Worms\n- **Dead Silkworm** (*jiāngcán*) – four *fēn* – controls Intestinal Worms\n- **Thunderberry** (*léiwánzǐ*) – six *fēn* – controls Red Worms\n*(Also called **Crow’s Solitude** (*yādú*) or **Earth Pipe** (*tǔyúzi*)*\n**Kudzu Vine** (*téng*) – like kudzu but with finer leaves)\n\nGrind all nine ingredients to a powder,\ntoast with *wǔhúo* (mild and strong) fire until golden,\nsift finely, and mix with refined honey into pills the size of **paulownia seeds** (*tóngzǐ*).\n\nTake five pills daily in warm water, three times a day,\ngradually increasing to ten.\nBy the twelfth day, stagnation will subside;\nby sixty days, all ailments will heal.\nAdjust the dose according to one’s strength—\nthe less taken, the better.\nWomen may take it, but must first observe dietary restrictions.\n\n**Scripture on Nourishing the Embryonic Spirit for Longevity** concludes.",
      "overlap_context": "this point.\n\nThe **Scripture** (*Jīng*) states:\n*\"The *qi* transforms into blood, blood into essence, essence into marrow.\nOne year transforms the *qi*, two years the blood,\nthree years the pulse, four years the flesh,\nfive years the marrow, six years the sinews,\nseven years the bones, eight years the hair,\nnine years the form.\nAfter thirty-six thousand days of divine cultivation,\nall [36,000] *shén* [spirits/aspects] transform into immortality,\nand one is called a **True Person** (*Zhēnrén*).\"*",
      "start_char": 6190,
      "end_char": 7229,
      "start_sentence": 202,
      "end_sentence": 248,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 19.52725124359131,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\长生胎元神用经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}