{
  "source_id": "阴符经讲义",
  "source_file": "chunked_daozang\\阴符经讲义.json",
  "total_chunks": 16,
  "total_original_chars": 14629,
  "total_translated_chars": 82005,
  "total_translation_time": 245.3661720752716,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\藏外\\阴符经讲义.txt",
    "category": "藏外"
  },
  "full_translation": "**Lectures on the *Yinfu Jing* (宋 夏元鼎 *Yinfu Jing Jiāoyì*)**\n**Preface to the Summary (提要 序)**\n**Volume 1–4**\n\nThe *Lectures on the Yinfu Jing* (四卷) is authored by Xia Yuan ding (夏元鼎) of the Song dynasty.\n\nYuan ding, styled Zongyu (宗禹) and self-styled Yunfeng Hermit (云峰散人), was a native of Yongjia (永嘉). This work elucidates the *Yinfu Jing* through the Daoist alchemical (丹法) perspective.\n\nAt its close, the text appends diagrams and commentaries on:\n- The Inner and Outer Three Passes (内外三关图),\n- The Sacred Functions of Sun and Moon (日月圣功图),\n- The Marvelous Instruments of Ten Thousand Symbols (奇器万象图),\n- The Three Teachings in Unity (三教归一图),\n- The Primordial and Transformative (先天后天图),\n- The Upper and Lower Magpie Bridges (上下鹊桥图),\n- The Seventy-Two Stellar Phases (七十二候图),\n- The Generation of the Five Phases (五行生成图).\n\nAccording to the *Han Records* (《汉志》), the Daoist and Immortalist schools were distinct traditions. The *Yinfu Jing*, comprising 384 characters, was originally composed and annotated by Li Qian (李筌). Since Qian’s annotations make no mention of furnace-fire (炉火), it is clear that the text belongs to the Daoist rather than the Immortalist school. Later commentators, however, disregarded Qian’s own annotations, fabricating interpretations akin to *Ying Shu Yan Shu* (郢书燕说)—mere contrivances.\n\nYet, while the *Paramartha Agreement* (《参同契》) does not invoke the *Yijing*, Chen Tuan (陈抟) cited it in relation to the *Yijing*, thereby establishing his own school. Similarly, though the *Yinfu Jing* does not speak of alchemy, this work does so, thus forming another distinct tradition. These interpretations were transmitted successively and could not be discarded.\n\nHence, in this compilation, I have recorded the annotations of six schools on the *Yinfu Jing* to preserve its original intent, and included this work to account for its divergent branches—what is termed *\"from the same, to the same\"* (从同同也). Other works branching from these two traditions are omitted.\n\nAs for the two schools (二氏), only their broad outlines are retained; there is no need to exhaustively examine each.\n\nThe text opens with a preface by Lou Fang (楼昉) from the Baocheng era (宝庆二年), stating that Yuan ding, in his youth, studied with the elders of Yongjia and, though he admired the *Yinfu Jing*, did not fully grasp its meaning. Later, upon encountering a transcendent figure at the summit of Zhufong Peak (祝融峰), he seemed to receive instruction. Subsequently, upon re-reading the *Yinfu Jing*, he analyzed its chapters and sentences, and with a stroke of the brush, composed it anew—claiming that a divine force from the Yin seemed to assist him. Such is the tendency of the esoteric arts, ever prone to such mystifications.\n\nAdditionally, there is a preface by Liu Yuan gang (留元刚) from Baocheng Bingxu (宝庆丙戌), inviting Yuan ding to annotate the *Yao Jing* (药镜), along with Yuan ding’s own self-recorded account and preface, and a later preface by Wang Jiuman (王九万) from Baocheng Dinghai (宝庆丁亥). Yu Yan’s *Ruishang Futan* (席上腐谈) mentions that Yuan ding annotated the *Yinfu Jing*, the *Yao Jing*, and the *Wu Zhen* (悟真), with Zhen Xishan (真西山) providing a preface—all consistent with the other prefaces. However, the present text does not include his annotations on the *Yao Jing* or the *Wu Zhen*, nor does it retain the preface by De Xiu (德秀), likely lost in transmission. Moreover, De Xiu’s *Xishan Wenji* (西山文集) does not record the text, leaving its fate unexplained.\n\nBan Gu’s *Records of the Arts and Literature of the Han* catalogues military writings, listing four types of military texts: those emphasizing strategy (*quanmou*), those emphasizing terrain and formation (*xingshi*), those emphasizing *yin-yang* principles, and those emphasizing tactical techniques (*jiqiao*). Though he categorizes them separately—each school specializing in one aspect—nevertheless, their underlying currents are inseparably intertwined.\n\nBan Gu observed: *\"Strategy* is to defend the state with rectitude and to deploy armies with the unexpected, encompassing terrain and formation, embracing *yin-yang*, and applying tactical techniques.\"* Thus, the four schools are in truth one.\n\nYet Ban Gu subsumed *xingshi*, *yin-yang*, and *jiqiao* under *quanmou*, while I would rather unite *quanmou*, *xingshi*, and *jiqiao* under *yin-yang*—for between heaven and earth, there is only *yin* and *yang*.\n\nStrategy manifests as expansion and contraction; terrain and formation as separation and union; tactics as convergence and divergence—yet all these movements arise from the transformations of *yin-yang*. Hence it is said: *\"The interplay of *yin* and *yang* is the Dao.\"*\n\nFan Li’s schemes for Wu were refined in discerning the rhythms of contraction and expansion, early and late, extending even to the barrenness of rice and crabs—yet with a single strike, he captured the kingdom. He applied the same principles to his own family, embodying the saying: *\"Later generations build upon the foundations of their forebears.\"*\n\nThose who follow the times like fierce beasts or rapacious birds—are they not wielding *yin-yang*? Yet strategy, terrain, and tactics operate within this framework.\n\nAncient masters of warfare were never those who did not grasp *yin-yang*. The *Grasping of the Marvelous* by Feng Hu, the *Eight Arrays* of Wu Hou, and Li Wei Gong’s *Lone and Empty Crow Divination* are but its outward expressions.\n\nYet there are deeper layers still: Zhang Liang, kneeling at the bridge of Kuai, receiving teachings from an old man—Su Shi dismissed this as mere superstition, asking how one could know that the age of Qin lacked hidden sages. I too wonder how one could know that the age of Qin lacked immortals—Zhang Liang merely encountered a rare opportunity.\n\nThe *Yin-Shu Jing* (*Yin Symbol Classic*), attributed to the Yellow Emperor, is written in archaic and obscure language, so difficult that readers struggle to parse its sentences—let alone annotate it.\n\nMaster Xia Jun Zongyu, having come from Zhe to Min, showed me a single manuscript: his own commentary. Master Xia, in his youth, studied under the great scholars of Yongjia, yet uniquely devoted himself to this text, though he did not fully comprehend it.\n\nLater, while in Shangrao, he prayed in silence: *\"Before ascending the Dragon-Tiger Register, I shall first ascend Dragon-Tiger Mountain.\"* That night, he dreamed of an encounter with a transcendent figure atop the Zhufeng Peak, as if receiving instruction. Upon waking, he took up the book again, and with sudden clarity, parsed its chapters and sentences, writing annotations as if guided by an unseen force. Could this be mere imitation or conjecture, like the commentaries of the world?\n\nNo—this must be an intuitive resonance, a spontaneous understanding.\n\nYet warfare and immortality are not easily spoken of. To speak of warfare risks descending into deceit and guile; to speak of immortality risks falling into vagueness and fabrication. Immortality is not something sought externally—clarity and resolve are inherent within. When the will and *qi* are divine, then immortality and warfare become one. To master immortality is to understand warfare; to master warfare is to understand immortality.\n\nZhong Mingyi spent his life in seclusion on Hua Mountain, yet his descendants became renowned generals. Yao Pingzhong, though defeated in a minor skirmish in the capital, was suspected by some of fleeing to avoid death. Yet what my school terms *immortality* is not this—it lies elsewhere.\n\nThose who read Master Xia’s work must consider this perspective.\n\n**Preface by Jian Lou Peng, Autumn of the Second Year of Baocheng (宝庆二年秋八月中澣楼昉序)**\n\n**Volume One**\n\nThe Classic says: *\"Observe the Dao of Heaven, grasp the actions of Heaven, and it is complete.\"* The mandate of Heaven is called *xing* (性), and following *xing* is called the Dao.\n\nThe Dao is not something to be sought beyond the boundless void. Heaven’s Dao resides within us—if we exhaust its observable mysteries, then the Dao is manifest before our eyes, and the ultimate Dao is not convoluted.\n\nTo grasp Heaven’s actions, one must never stray from the twelve temporal cycles. Every word spoken, every silence held, every breath inhaled and exhaled—*yin* opens, *yang* cleaves; the sun sets in the west and rises in the east. Winds and clouds vent through the seven orifices, while *kan* and *li* converge in the primal palace. Heaven operates through this Dao to govern the ten thousand transformations, and I, too, embody this Dao in my conduct.\n\nCold and heat follow their cycles; the sun and moon align in their courses; the *gān* and *jian* trigrams move without cessation, and daily life unfolds endlessly.\n\nOne does not know whether I am Heaven or Heaven is I. *\"My fate lies within me, not in Heaven\"*—this is how it is.\n\nTo say it is complete is to say nothing more can be added.\n\nHeaven has five *zei* (贼, \"bandits\" or \"corrupting influences\"), and those who perceive them thrive. These five *zei* are the five phases (*wuxing*).\n\nHumans inherit the five phases from Heaven, yet within them lie five *zei* for humanity—is this not Heaven’s failure to transform? No. When the phases are inverted, the Dao of Great Perfection arises. In harmony, they perfect humanity; in reversal, they serve alchemical refinement—just as metal and wood must intermingle, water and fire must reach completion, and earth, though flourishing in all seasons, must also subdue water to fulfill its function. These are the five phases preying upon one another.\n\nThe profundity of the Dao—how can the world perceive this truth? Thus, those who see it prosper, for sincerity brings clarity, and clarity reveals it.\n\n*\"The empty chamber gives birth to whiteness\"*—this is the mystery of radiance in fullness.\n\nIt speaks of observing Heaven’s Dao and seeing Heaven’s prosperity—yet the ignorant pass by it blindly. Alas.\n\nThe five *zei* reside in the heart, manifesting in Heaven. The five phases and their *zei* are subtle in principle, yet the heart, as Heaven’s sovereign, truly governs them.\n\nThis manifestation in Heaven stems from the heart’s operations—indeed, the heart is Heaven, and Heaven is the heart. If one aligns with the singular Heaven within the heart, they can appropriate the marvels of creation, moving dynamically between ascent and descent, standing beside the Emperor, so that at the moment of action, one does not know which is Heaven and which is the heart.\n\nThe universe lies within the hand—\nthe hand is the pivot of the Three Passes.\nThose who study the Dao must know where to begin.\n\nThe *Huangting Jing* says:\n*\"The mouth is the heart’s Pass, where spirit and mind converge;\nthe foot is the life’s Pass, the gate of the natal earth;\nthe hand is the human’s Pass, grasping the rise and fall of fortune.\"*\n\nWhat is gained is not through the hand alone,\nyet one can press the Heavenly symbols and the four directions,\npropel the Five Phases and Six Qi,\ngrasp the firm to nourish harmony,\nflick the fingers to seize transformation,\ndiagnose with a glance to know the signs of Yin and Yang,\nand with a decisive gaze to commune with the spirits of ghosts and gods—\nall are within the hand.\n\nThe universe and the Six Directions are vast without bounds—\nif one attains the profound mystery,\nit is as though revealed upon the palm.\nThe *Shentong Xu* says:\n*\"The Yin Symbol of the Sixty-Four Hexagrams is in the palm—this is the Heavenly Pass.\"*\n\nAll transformations arise from the body.\nA single human body is a microcosm of Heaven and Earth.\nThere are the ascents and descents of Yin and Yang,\nthe comings and goings of the tortoise and hare,\nthe tides of fortune and the passing of seasons,\nthe winds and rains, the clarity and the murk,\nthe thunderous crashes and lightning flashes,\nthe exhalations and inhalations of clouds,\nthe rivers and mountains in their flowing stillness,\nthe flourishing and withering of grasses and trees—\nin motion and stillness, speech and silence,\nopening and closing, all changes without exception mirror Heaven.\nTruly, all transformations spring from here.\n\nYet those who have the Dao nurture transformations,\nwhile those without it see them fade.\nThe living align with Heaven as their master,\nwhile the dead dwell beside ghosts as neighbors.\n\nHow could one not cherish themselves?\n\nHeaven’s nature is humanity.\nHumanity’s heart is the mechanism.\nEstablishing Heaven’s Dao secures humanity’s fate.\nHeaven and humanity share one heart,\nmechanism and Dao move on the same path.\n\nFrom the Six Desires and Seven Emotions,\nsome may steal humanity’s true nature—\nthen the fires of karma and cognition blaze,\nand one no longer knows which is Heaven,\nwhich is humanity,\nwhich is the mechanism,\nand which is the Dao.\n\nThe Sage of boundless compassion elucidates the profound truth:\n*\"Nature is Heaven, Heaven is humanity*—\nthis ultimate principle is seamless and unassailable.\nIf one seizes the mechanism and responds to it,\nharmony naturally arises—this is the true mechanism.\nNot the worldly artifice of cleverness and deceit!\n\nIt is the mechanism’s silent operation,\nswift yet unhurried,\nits responses as precise as matching seals.\nIf one clarifies this mechanism,\ntheir heart aligns with creation—\nthe mechanism’s responses will never falter,\nand thus Heaven’s Dao stands firm,\nhumanity’s fate is secured.\n\nIt is not a matter of abandoning humanity’s Dao to establish Heaven’s Dao,\nnor of first establishing Heaven’s Dao and then securing humanity’s fate.\nFor humanity’s Dao is Heaven’s Dao,\nHeaven’s Dao is the Heavenly mechanism,\nthe Heavenly mechanism is Heaven’s nature—\nthis is why one must preserve the heart,\nnurture the nature,\nand thereby serve Heaven.\n\nWhen Heaven unleashes its killing mechanism,\ndragons and serpents rise upon the land.\nWhen Earth unleashes its killing mechanism,\nstars and constellations fall and are subdued.\nWhen humanity unleashes its killing mechanism,\nHeaven and Earth are overturned.\nWhen Heaven and humanity together unleash their mechanisms,\nall transformations find their foundation.\nThe Three Powers differ in position,\nyet share the same mechanism for life and death.\n\nYet killing is the means to generate,\nand generating is the means to kill.\nMoreover, when Yin doubts Yang, conflict ensues—\nits blood turns dark and yellow,\na vessel for the killing mechanism.\nWhat of the Three Yang in harmonious union,\nwhere all things flourish?\nWhen Heaven unleashes its killing mechanism,\nit dispels the malevolent *qi* of Yin below—\nthen thunder crashes and lightning sweeps,\nHeaven’s might is terrible,\ndragons and serpents retreat in hiding,\nunable to avoid it,\nrising only when Yang is at its peak;\nwhen Earth unleashes its killing mechanism,\nit receives the harsh force of the field—\nthen the Yellow Springs surge with waves,\nthe Yellow River flows backward,\nthe Big Dipper’s ladle shifts its position,\nunable to avoid rotation,\nsubdued only when Yin and Yang are in balanced victory.\n\nIf humanity recognizes this mechanism,\nthey can secretly seize creation’s marvels,\nturn the heavens and invert the earth,\nmake Earth and Heaven exchange to achieve harmony,\nand life and death settle to fulfill their function.\n\nThe True Person of the Great White sings:\n*\"The Five Phases in reverse—\ndragons emerge from fire.\nIf the Five Phases do not proceed in order,\ntigers rise from water.\nThis is the mechanism of reversal.\"*\n\nThough Heaven, Earth, and humanity are ranked as the Three Powers,\nlife and death share the same mechanism as *qi*.\nMencius says:\n*\"I excel in nurturing my vast and boundless *qi*,\nfilling the space between Heaven and Earth—\ncould I abandon my own body and seek another Heaven and Earth to fill?\"*\n\nThus, the movement of *qi* is not that Heaven has excess\nwhile humanity lacks—\nwhen Heaven and humanity act together,\nnot a hair’s breadth differs.\nThe mechanism operates silently yet responds perfectly,\nits transformations endless.\nThe foundation of the elixir is fixed,\nand the Great Dao flourishes.\n\nNature has cleverness and clumsiness,\nwhich can be concealed.\nForm and appearance are Heaven’s nature,\nyet skill arises from them.\nConcealment is waiting for the right moment,\nyet the Heavenly mechanism lies within.\nIf there is such a nature, then there is such a mechanism—\nnot that one ends in concealment without further care.\n\nThis is why one must cherish their innate talents\nand nurture their vast clarity in the proper time—\nthe true essence of the elixir’s secret.\n\nSome say Yin lead governs concealment,\nYang mercury governs ascent,\nand the Sage conceals Yang mercury to refine Yin lead—\nthus the use of great cleverness as clumsiness.\nNo—\n\nThey fail to understand that the Yellow Emperor speaks specifically of cleverness and clumsiness as inherent in nature,\nwhile concealment is waiting for the right moment.\nFor nature, if aligned with the Primordial Mystery,\nwhile lead and mercury are bound to form and substance.\nIf this nature is luminous and the Yang spirit thrives,\ncleverness and clumsiness cannot obscure it,\nconcealment awaits its time—\nwhen the Heavenly mechanism responds,\nHeaven’s nature is revealed.\n\nThis aligns with the Master of the Caverns’ teaching:\n*\"Sevenfold return to the elixir—\nbefore this, one must first refine oneself and wait for the time.\"*\n\nUnderstanding the principle of waiting for the time\nis to understand the nature of concealment and cleverness.\nThe Nine Orifices’ evils lie in the Three Essentials,\nwhich can be controlled through motion and stillness.\n\nThe human body has nine orifices—\nseven above, two below—\nnone without impurity.\nThose who study the Dao must examine these closely,\nseizing the Three Essentials,\nbefore motion and stillness can be free of evil thoughts.\n\nWhat are the Three Essentials?\nThey are the ears, eyes, and mouth.\nThe *Shentong Qi* states:\n*\"The Three Treasures must be firmly sealed,\nnever to be recklessly displayed.\"*\n\nThe myriad colors of the world, ever-changing yet transcended by clarity,\nshall not dim the mind’s brightness;\nthe myriad flavors of the world, ever-changing yet mastered by *Fuì*,\nshall not unsettle the heart’s reception.\nWhen one’s nature is naturally pure and luminous within,\none’s resolve and *qi* become as divine as the Dao.\nBetween motion and stillness,\none follows the true principle of Heaven—\nthough myriad evils cannot intrude.\n\nWhat harm can the Nine Orifices’ evils bring to me?\nThis is the true *Dao* of **\"See not what is unseemly, hear not what is unseemly, speak not what is unseemly\"**—\nhow could it be otherwise?\n\nFire arises from wood,\nand disaster must be overcome.\nDeceit arises within states,\nand unrest shall surely erupt when the time is right.\nTo know this and practice refinement—\nthat is called the Sage.\n\nWood can give rise to fire,\nyet it ends in self-consumption.\nA state can breed deceit,\nyet it ends in summoning chaos.\nThis is the inevitable suffering of such forces.\n\nThose who study the Dao must know:\nto let fire arise from wood yet prevent wood from burning,\nto let deceit arise within states yet prevent chaos—\njust as with food and sex,\nthe great desires of humanity persist,\nyet one must not recklessly suppress them.\n\nIf one indulges these desires,\nwhat will they not do?\nOnly by the Dao can they be governed—\nthen fire and wood nurture each other,\nnot as disaster but as blessing;\ndeceit and evil may stir,\nyet they become not evil but righteous.\nIs this not the Sage’s refined Dao?\n\nThis is what is meant by **\"dwelling in dust yet unsoiled, emerging from death into life.\"**\n\nYet fire and wood, in the Five Phases, are most potent,\nand in the human body, wood and fire are the rise and fall.\nIf the true essence is not diminished,\nthen wood and fire burn fiercely.\nTo subtly respond to Heaven’s mechanisms,\nthe common man recklessly harms himself—\nthis is to slight life and indulge deceit.\n\nThe Sage refines them to attain the Dao—\nthis is to return to the true Way.\nIf the true essence decays,\nthen fire and wood are extinguished,\nHeaven’s Way is broken,\nhumanity drifts far while the *guǐdào* (鬼道, way of demons) draws near.\nAlas!\n\nThe *Sutra* says:\n*\"Heaven generates, Heaven kills—\nthis is the Dao’s principle.\nWhen the *qi* resonates with the Yellow Bell (黃鍾),*\nall things sprout and move—\nthis is Heaven’s generation;\nwhen the *Lǜ* (律) aligns with the *Yízhé* (夷則),*\nall things wither and retreat—\nthis is Heaven’s killing.\"*\n\nYet why does Heaven both generate and kill?\nFor there is a principle of generation and killing between them.\nHow does one know to generate life?\nIf one can embody this Dao within oneself—\nto closely observe the workings of creation,\nthen spring’s birth and autumn’s death,\nthe exchange of yin and yang,\nnot confined to the year’s cycle but within the twelve hours,\none can seize Heaven’s marvelous function\nand attain the Dao’s profound principle.\n\nHeaven and Earth are thieves of all things;\nall things are thieves of humanity;\nhumanity is the thief of all things.\nIf the three thefts are in harmony,\nthe Three Talents (三才) are at peace.\nHeaven’s Way favors generation,\nEarth’s Way favors growth.\nHumanity is the spirit of all things,\nall things serve humanity’s use—\nhow can they be called thieves?\nIf Heaven and Earth are not benevolent,\ntreating all things as mere fodder,\nthen Heaven and Earth steal from all things,\npreventing their flourishing.\n\nThe Five Colors blind the eyes,\nthe Five Tones deaf the ears,\nthe Five Flavors dull the mouth—\nthis is how all things steal from humanity,\npreventing its eternal prosperity.\n\nThe axe and adze enter forests,\nfine nets descend into filthy pools,\nthe five grains and six livestock are cooked and devoured—\nthis is how humanity steals from all things,\npreventing their longevity.\n\nYet though the three thefts secretly erode each other,\nunaware yet inexorable,\nlife and death, flourishing and decay—\nnone can escape this fate.\n\nThe harm is not in Heaven, Earth, and all things,\nbut in humanity’s profound ignorance of it.\nHow does one know this?\nHeaven and Earth steal from all things yet sustain them,\nall things steal from humanity yet persist in their creation,\nand humanity, stealing from all things,\nrelies on them for sustenance—\nyet cannot ensure its own longevity,\nthus becoming the victim of all things.\nAlas!\n\nCan the people of the world deeply grasp this truth?\nIf they can, they will naturally know\nthat their refinement must be to guard the Three Treasures,\nnurture the *língzhū* (灵珠, spiritual pearl),\npreserve three and guard one,\nkeeping *jīng* (精, essence), *qì* (气, *qi*), and *shén* (神, spirit) whole—\nthen the *hèchì jīndān* (赫赤金丹, radiant cinnabar elixir)\nshines with abundant light,\nand how can Heaven, Earth, or all things steal from me?\n\nYet they fail to understand this,\nassuming that to live between Heaven and Earth,\none must rely on all things;\nthat all things benefit humanity,\none must rely on Heaven and Earth—\nthis is indeed natural.\nYet because they see it as natural,\nthey accept it without question.\nThe Sage laments this,\nsaying: *\"The three thefts are in harmony—\nhow can they be in harmony?\nThis is sorrow for their mutual destruction without end.*\n*The Three Talents are at peace—\nhow can they be at peace?\nThis is pity for their division yet contentment in theft.\"*\n\nDeeply mournful for the world’s ignorance of the Dao,\nunable to transcend the surface of creation,\nemerging from death into life,\nabandoning decay for flourishing,\nand aligning with Heaven, Earth, and all things in their eternal cycles.\n\nAh! This is why the Yellow Emperor attained the *jīndān* (金丹) and ascended to Heaven,\nand later worthies also ascended, following in his steps.\nWhat harm do the three thefts bring to those who follow the Dao?\n\nThus it is said:\n*\"To eat in season,\nthe hundred bones (百骸) are nourished.\nHuman life relies on the Four Great Elements (四大) for form,\nand limbs, bones, spirit, *qi*, and blood—\nwithout food, how can they be sustained?\nIf one misses the season,\nnot only is there no benefit,\nbut harm shall follow.\nHow much more so with the Great Dao of the *jīndān* (金丹),\nwhose gathering and taking have their proper times—\nits sweetness like honey,\nits size like an orange,\neating it grants immortality,\ngolden sinews and jade bones—\nthis is how the blood transforms into marrow,\nmarrow into *qi*,\n*qi* into spirit,\nascending to the golden gates (金阙).\nHow much more than simply nourishing the hundred bones?\"*\n\nTo stir its mechanism (动其机),\nall transformations are at peace.\nHeaven and Earth’s creation is profound and unfathomable;\n\nThe mechanism operates in silent motion—\nthe human body shares this principle.\n\nIf one seizes the mechanism,\nthen all movement brings good fortune,\nthough myriad transformations arise,\nthey remain stable and free from peril.\nShould one lose the mechanism,\nthen danger and peril are inevitable.\nWhere is there safety?\n\nPeople know their spirit as spirit,\nbut do not know what makes it so.\nGreat indeed is the function of spirit!\n\nYet it has hidden and revealed aspects,\nconcealed and exposed—\nthis is where the sage and the common differ.\n\nThe world knows only to arrange and manipulate,\nto speak and write without thought or effort,\nyet they take it as their own spirit.\nLittle do they know—\ntheir karma and perceptions are in constant flux,\nresponding to myriad changes,\nchasing after things and losing themselves,\nnever a moment’s peace.\n\nAlas! The blazing shall exhaust its oil,\nthe fragrant shall wither at its root—\nthey hasten their own depletion.\nWhy? Because their brilliance is too exposed.\n\nOnly the sage turns inward, seals the senses,\ncontains the flow, concealing all within.\nGhosts and spirits cannot fathom them.\n\nThus, vague and indistinct,\nas if without knowledge—\nyet within, there is substance.\nDim and murky,\nas if without spirit—\nyet within, there is essence.\n\nThis is not to deny the spirit,\nbut to attain the utmost spirit.\n\nWho but those of the Way can comprehend this?\n\nThe sun and moon follow their courses,\ngreat and small, their measures fixed.\nFrom this, the sage’s work arises,\nand the manifestation of spirit.\n\nThe sun is the Greater Yang—fire and soul,\nthe moon is the Lesser Yin—water and shadow.\nThe two symbols are manifest;\nhow could Yin and Yang lack their numbers?\n\nHeaven has three hundred sixty-five degrees and a quarter,\neach degree traversed in one day by day and night.\nThe moon moves twelve degrees and more in a day and night.\nThe sun moves slowly, completing a celestial circuit in a year;\nthe moon moves swiftly, completing it in a month.\nSlow and swift interact,\nYin and Yang depend on each other—\nthus there are great and small consummations,\ntheir numbers fixed and unchanging.\n\nWithin a human body,\nthere are also sun and moon,\ndegrees and measures—\nyet their celestial circuit is not yearly.\nCompressing years into months,\nmonths into days,\nwithin the twelve hours,\nYin and Yang naturally rise and fall,\nsoul and shadow generate in turn.\nTo harness the sage’s work,\none must make the tortoise and hare unite,\nthe dragon and tiger mate—\nstirred by thunder and rain,\nmoistened by wind,\nthe empty chamber births the white,\nentering the realm of *wuheyou* (無何有),\nmixing with the returning wind,\nachieved in the briefest moment—\nthis is called the emergence of spirit.\nYet they do not know:\nit is because of spirit that there is clarity,\nbecause of clarity that there is spirit.\n\nThe void within the having is the deepest mystery,\nthe having within the void is the subtlest wonder.\nEndless transformations, unfathomable depths—\nilluminating all phenomena, unobstructed clarity—\nthis is called spirit, beyond conception.\n\nYet to align with Heaven and Earth in virtue,\nto unite with the sun and moon in luminosity—\nthis is the Way.\n\nNow, people merely recite it with their mouths,\nyet do not practice it in their bodies.\nThey dismiss immortals as absurd—\nalas, what sorrow!\nTheir living corpses, their hollow pursuits—\nthey call it wealth and joy,\nyet know not the emptiness of dreams and shadows,\ndeeply pitiful indeed.\n\nAs for those who steal the mechanism,\nnone in the world can see or know.\nThe virtuous, obtaining it, endure hardship;\nthe petty, obtaining it, court death.\n\nThe parable of stealing the mechanism is profound.\nWhat is a thief? The unseen.\nWhat is the mechanism? The uncontrollable.\n\nTo carry it away in the dead of night—\nthis is theft.\nWho knows of it?\n\nIf the snare is set, this is the mechanism.\nWho can restrain it?\n\nYet this thief, this mechanism—\nthey harmonize the Three Realms,\nobtain creation’s opening and closing,\nand the uninterrupted flow of *qi*.\nThe mechanism seals itself in response;\nthe common folk use it daily without knowing.\n\nOnly those who study the Dao grasp it to endure hardship—\nnot that they cling to poverty,\nbut in their floating clouds of wealth and indulgence,\nthey avoid excess,\ndelight in emptiness,\nfollow simplicity—\nthis is the meaning of enduring hardship.\n\nThe petty, obtaining it, court death—\nnot that they seek blades and war,\nbut in their lust for women and battle,\ntheir drunkenness and music,\ntheir gluttony and greed—\nthis is what is meant by courting death.\n\nThough enduring hardship and courting death\ndistinguish the virtuous from the petty,\nthe activation of the mechanism\nhas no partiality toward gain or loss.\nIt is only that the virtuous understand the mechanism\nand use it to endure hardship,\nwhile the petty are ignorant of it\nand use it to court death.\n\nThis principle is profound and mysterious—\nit cannot be transmitted by oath alone,\nthus it is said: none in the world can see or know.\n\nThe blind excel in hearing,\nthe deaf excel in sight.\nCutting off one source of sense,\none’s teacher’s efficacy is tenfold;\nthree cycles of day and night,\nand it becomes ten thousandfold.\n\nThe blind lack sight,\nthe deaf lack hearing—\nif clarity and wisdom are abandoned,\nhow can vision and hearing be refined?\n\nIt is not this.\nPeople rely on ears and eyes for life,\nyet these same ears and eyes become burdens.\nSounds and colors assail the senses,\nvision and hearing are stirred within—\nwho knows what is master?\n\nOnly the blind, where the eyes cannot see,\nfocus the mind on hearing,\nand powdered faces and painted lips cannot intrude.\nOnly the deaf, where the ears cannot hear,\nfocus the mind on sight,\nand flute and drum cannot distract.\n\nThis is the marvel of undivided intent,\nconcentrated into spirit.\n\nTo cut off one source of sense\nis to have the mind in single use,\nsoftening the *qi* through concentration alone.\n\nThree cycles of day and night—\nthis is the rise and fall of the Three Palaces,\nendless coming and going;\ntenfold, thousandfold efficacy—\nthis is the spirit’s clash,\nmaking demons and external doctrines,\nevil thoughts and malicious intentions,\nsurrender without battle.\n\nTo abandon all desires and focus on the source,\ndissolving all burdens and distractions,\nwithout thought or deliberation,\npure and sincere in essence,\nno deviation in mind—\nthis is the realm of stillness and motionless repose.\n\n「Thus, within the span of day and night,\nthe Three Palaces rise and fall in endless cycle,\nas Yin and Yang ascend and descend without fail,\ntheir rhythm unbroken, revolving without end—\nthis is the wondrous work of response and attunement.\n\nAh! If this Dao is not seen in practice,\nnor tested in daily life,\nthen what use is there in speaking of it?\n\nYet even so, tenfold or thousandfold efficacy\nstill varies in depth—why is this?\n\nIt is because those who abandon wisdom and intelligence,\ndiscard their limbs and senses,\nwither like dried wood in form,\nand grow cold like dead ashes in heart,\nthough they may attain stillness and enter the Dao,\nsuffer the flaw of the *Buddha’s* (释) empty and void (空寂) extremism,\nlacking the power of transformation (运化),\nand ultimately become mere shades of darkness (阴灵), tormented by lingering desires (苦爽鬼) alone.\nThus, their efficacy remains only tenfold.\n\nBut if one cuts off all sensory desires (利一源)\nand yet can still endure the threefold cycle of day and night,\nnaturally preserving the True and embracing the One (守真抱一),\nascending and descending through the Three Palaces (升降三宫),\nrevolving through day and night without pause,\nthen all beings—human and celestial—are attuned in harmony,\nresponding as if by divine instinct (应若神),\nbeyond all comparison or reckoning.\nThis is the Dao of merging with Heaven and Earth’s virtue (合德),\nand uniting with the Sun and Moon’s luminosity (合明),\nwhose efficacy is truly unmatched—\nhow could it be anything but a thousandfold efficacy?\n\nIn ancient times, the Duke of Lu (鲁侯) questioned the Master Kangcangzi (亢仓子) about the Dao of *ear-vision* (耳视) and *eye-hearing* (目听).\nKangcangzi replied:\n*\"The transmitters are mistaken (妄矣).\nI can see and hear without relying on ears and eyes,\nbut I cannot reverse the function of ears and eyes.\nIt must be that the body attunes with the heart (体合于心),\nthe heart attunes with the *qi* (心合于气),\nthe *qi* attunes with the spirit (气合于神),\nand the spirit attunes with the Void (神合于无).\nThus, though there be the subtle distinction of existence (有介然之有),\nor the faintest sound (唯然之音),\nwhether distant beyond the Eight Desolations (八荒之外),\nor near as the eyelashes (目睫之间),\nnone can evade my seeing and hearing.\nIf the world knew Kangcangzi’s seeing and hearing,\nthey would understand the Yellow Emperor’s blindness and deafness (聋瞽) in seeing and hearing.\"*\n\nHow profound and mysterious (玄妙)!\n\nThe heart arises from things (物),\nand perishes from things (物),\nits mechanism lies in the eyes (机在目).\nThe heart and eyes are interdependent,\nlife and death are thus bound together,\nand things and their mechanisms respond in kind—\nnever ceasing, never breaking.\n\nHuman beings are the spirit (灵) of all things,\ndaily interacting with the myriad forms.\nWhen a thought arises,\nit follows that the heart is born from things;\nwhen a thought is extinguished,\nit follows that the heart perishes from things.\nYet the heart does not itself arise from things,\nits mechanism lies in the eyes and ears (机在目耳);\nthe heart does not itself perish from things,\nfor its mechanism remains in the eyes and ears.\n\nIf at that moment one cannot distinguish black from white,\nnor beauty from ugliness,\nthen the heart aligns with the Great Emptiness (太虚),\nand how could life and death ever take hold?\n\nIt is the mechanism that lies in the eyes (机关在目),\nstirred by the slightest touch.\nA single glimpse of beauty\nand suddenly love is born (倏然生爱);\na single sight of evil\nand instantly hatred grows (悠然增恶).\nThus, to love is to give rise to desire (欲心生),\nshowing that the heart is born from things;\nto hate is to extinguish desire (欲心死),\nshowing that the heart perishes from things.\nTrace its origin—\nis this truly the heart’s inherent nature?\nIt is all the mechanism that lies in the eyes.\n\nHence, the Sage of old had the *Inner Observation Canon* (内观之经),\nthe Daoist adept had the *method of veiling the eyes* (帘目之法),\nthe Confucian admonition: *\"Do not gaze upon what is not proper\"* (非礼勿视),\nand the Buddhist *cleansing of the eye-root* (清净眼根).\nTheir intent is profound,\nyet their principles are not far from truth.\n\nStill, even the blind (瞽者) have their cravings—\ndoes the mechanism lie solely in the eyes?\nThus it is said: *\"The heart and eyes are interdependent.\"*\n\nChapter Three, the Canon states:\n*\"Heaven’s lack of favor is itself the greatest favor.\"* (天之无恩而大恩生)\n\n「Swift thunder and fierce winds—\nyet all move sluggishly.\nWhat heart does Heaven possess?\n\nThe seasons march on,\nA hundred things flourish and grow,\nYet only when frost and snow congeal,\nWhen ice and cold are severe,\nDo all things return to their roots and fulfill their fate—\nThis is Heaven’s lack of favor yielding the greatest favor.\n\nMoreover, when swift thunder and fierce winds arise in spring and summer,\nAll things rejoice and thrive;\nEvery living, breathing creature\nCompletes its natural course in harmony.\n\nWhat is called the midst of raging flames,\nIs the very place where gold and treasures are forged.\n\nThe scholar who grasps this truth\nShall understand the *killing mechanism*,\nThe reversal of harm within benevolence,\nThe creation of boundless favor,\nAscending to the Mysterious Origin (玄元),\nBecoming the master of both Heaven and humanity.\n\nThe utmost joy lies in innate nature,\nThe utmost stillness is purity itself.\nEmotions may shift between sorrow and joy,\nYet nature abides in supreme joy;\nDesires may stir to action,\nYet the Dao rests in supreme stillness—\nThis is how the transcendent and the ordinary diverge.\n\nThe scholar who seeks the Dao\nShould first take joy in his innate nature,\nLetting not a single trace of depletion or excess burden it,\nThen sweetness and tranquility arise naturally;\nPurity in cultivation\nWill spontaneously align the heart with the Dao.\n\nBut those who wallow in the seven emotions and six desires,\nWho find sorrow and joy inconstant,\nWho provoke harm at every turn,\nWho daily entangle themselves in dusty snares,\nWith no escape in sight—\nHow can their nature be said to bring joy?\nHow can their stillness be pure?\n\nHeaven’s utmost partiality\nIs its utmost impartiality in practice.\nThe Dao of Heaven is impartial,\nYet in the matter of *Inner Elixir* (金丹),\nIt seems to have its preferences.\n\nHeaven’s heart may appear partial,\nYet toward the Great Dao,\nIt seems utterly impartial.\nHow so?\n\nHumans receive their endowment from Heaven—\nA single point of luminous awareness, the true nature (一点灵明真觉之性),\nA threefold state of effortless spontaneity, the natural fire (三昧无为自然之火),\nThe primal unity of the Preheaven (先天太一),\nThe essence that harbors the True (含真之精).\nWithout distinction of great or small,\nOf noble or base,\nOf transcendent or ordinary,\nAll receive their full measure—\nThis is Heaven’s impartiality.\n\nYet those who follow the Dao\nSee yin and yang rise and fall without fail,\nThe sun and moon unite in perfect accord,\nThey summon thunder, call forth rain,\nStir winds and flash lightning—\nTruly turning Heaven and Earth,\nTaming dragons and subduing tigers,\nWhereby sacred deeds arise,\nDivine brilliance emerges,\nWith wonders beyond reckoning.\n\nThose without the Dao fare otherwise—\nYin and yang stray from their appointed times,\nThe sun and moon lose their celestial cycles,\nThunder, lightning, wind, and rain act as they please.\nIf one’s body persists beyond the mere vessel of food and drink,\nIt becomes but a den of medicine and lust.\n\nIs it not that Heaven truly favors those with the Dao\nAnd neglects those without?\n\nI have seen the Dao-cultivators\nLive long upon this earth,\nThough their bodies perish, they ascend as immortals;\nThe undaoed, sickly and wretched,\nDecay swiftly with plants and trees.\n\nThus Heaven’s utmost partiality\nIs the very means of its utmost impartiality.\nShould one not take heed?\n\nThe principle of *transformation* (禽之制) lies in *qi*.\nAll things that live\nReceive one breath of *qi*.\nEven the most minute creature,\nSoaring through the boundless void,\nThough it knows the six wings that beat\nAnd the countless feathers that support,\nWithout the fullness of that single *qi*,\nIt would falter and fail to rise.\n\nThe scholar who knows this\nShall preserve and nurture the Original *Qi* (元和),\nCultivate the divine breath,\nMaking it most vast and most resolute,\nFilling Heaven and Earth without end.\n\nDoes not the *Classic of Poetry* say:\n*\"The kite flies to the heavens,\nThe fish leaps in the depths—\nIt is the *qi* that makes it so.\"*\n\nIs this not near at hand in the body,\nAnd far observed in all things?\n\nLife is the root of death,\nDeath is the root of life.\nBenevolence arises from harm,\nHarm arises from benevolence.\nTo comprehend the workings of creation,\nOne must know the roots of life and death;\nTo fathom the Great Dao,\nOne must discern the meaning of benevolence and harm.\n\nThis principle—\nApart from the Five Phases (五行) of creation,\nApart from the *Inner Elixir* and the Great Dao,\nHow else might it be understood?\n\nNow, gold is born in the *Perilous Month* (巳),\nDies in the *Child Month* (子),\nThe *Child Month* being the realm of water,\nYet gold can generate water.\nSo then, does gold truly die?\n\nWood is born in the *Boar Month* (亥),\nDies in the *Horse Month* (午),\nThe *Horse Month* being the domain of fire,\nYet wood can also generate fire.\nWater and earth are born in the *Monkey Month* (申),\nDie in the *Tiger Month* (卯),\nThe *Tiger Month* being the position of wood,\nYet water can generate wood.\nThus life is the root of death,\nAnd death is the root of life.\n\nYet the roots of life and death are fixed,\nWhile the meaning of benevolence and harm differs—\nOnly the transformations of gold and fire\nCannot be judged by life and death alone.\n\nThe *Dragon-Tiger Upper Canon* (《龙虎上经》) states:\n*\"Gold and fire are the true medicines.*\nThe art of *Inner Elixir* (丹术) finds its greatest clarity in gold and fire.\nMoreover, fire is born in the *Tiger Month* (寅),\nDies in the *Rooster Month* (酉),\nThe *Rooster Month* being the realm of gold,\nIts fire can only subdue gold—\nHow could it generate gold?\n\nThe *Rooster Month* is where gold thrives,\nYet fire is in the place of its own demise—\nUnable to subdue it as harm,\nYet gold, in turn, regards its flourishing as benevolence.\nBut how could gold generate itself?\n\nIt must rely on what generates it—\nOnly earth can generate gold,\nYet fire also generates earth.\nWithout the *Steel* (戊) and *Earth* (己) phases,\nNo *Inner Elixir* could be formed.\n\nAh, the Five Phases\nGenerate and subdue one another—\nProfound and subtle truths,\nFew scholars grasp them.\nAs for the *Inner Elixir* (金丹),\nThey speak of it with delight,\nYet seldom delve into its Mysterious Essence.\nNow I must clarify each point,\nTo instruct those who come after.\n\nMoreover, the inner and outer *Inner Elixirs* (二丹)\nDo not depart from the Five Phases’ transformations,\nYet they are not called *Elixir of Water, Fire, Wood, and Earth*,\nBut specifically *Inner Elixir of Gold* (金丹)—\nWhy is this?\n\nIt is because Heaven One (天一) generates water,\nThe *Kan* (坎) Trigram being the palace of water,\nWater being the mother of all things,\nThe cultivator of truth must first focus his heart in the *Kan* Palace.\n\nYet the water of the *Kan* Palace\nCannot generate itself—\nOnly gold can do so.\nThus the Original *Qi* of the Primordial Beginning\nIs transformed and born through gold.\n\nThe ancient song says:\n*\"Use lead or do not use lead,\nYou must act within the lead.\nWhen the time comes to use lead,\nUsing lead is still a mistake.\"*\n\nLead is the mother of gold,\nGold is the mother of water,\nWater is the mother of the *Inner Elixir*—\nSuch is their generating and completing truth.\n\nYet the Great Dao does not rely on generation for its use,\nBut on subduction for its function—\nIs it not that gold can subdue wood,\nWood being reduced to exhaustion,\nWood can subdue earth,\nEarth reaching emptiness at its peak?」\n\nEarth can subdue water, water blending into emptiness;\nWater can subdue fire, fire ending in extinction.\nThough fire subdues gold, gold remains unbroken—\nAshes fade, flames vanish, yet gold’s essence grows firm.\n\n*The Parametric Classic* states:\n*\"When gold enters fierce fire, its luster remains unquenched.\"*\n\nIs it not that harm gives rise to blessing,\nAnd blessing emerges from harm?\nThus it is called *Jinye* Elixir of Return,\nCalled *Changsheng* Immortality,\nCalled *Return to the Origin, Source Reclaimed*—\nFor only gold within water suffices.\n\nYet liver, heart, spleen, lungs, kidneys,\nEssence, fluids, *qi*, blood, and humors—\nThough their forms differ utterly,\nTheir life-principles are intertwined.\nThough their logic may be spoken,\nTheir Dao defies articulation.\nFor there are *zuancu* [concentrations],\n*hehe* [harmonizations],\nAlchemical medicines,\nFire’s precise moments,\nTrue and mundane,\nGuest and host.\n\nThe Sage transmits medicine, not fire—\nWithout a true master, guessing is futile.\nUnless one swears oath by blood to Heaven,\nOr marks the ground with sand and script,\nTransmission is forbidden.\nTo violate brings calamity to nine ancestors,\nDisaster first upon oneself.\n\nZhang Pingzhu’s transmission to the unworthy\nMet three punishments—\nHow could one not take heed?\n\nThe foolish revere the Sage’s cosmic patterns,\nI study temporal things to grasp profundity.\nThe wise may pity the foolish,\nYet I transcend the Sage’s limits—\nOthers await, I do not.\n\nThough Sage, Fool, Virtuous, and Wise share the same origin,\nTheir hearts’ breadth determines their attainment.\nFor Heaven, Earth, time, and things all bear patterns—\nTheir laws and symbols manifest without end,\nNeither within nor without.\nIf one gazes upward and downward,\nReflects deeply and acts with clarity—\nThen through mindfulness, one becomes Sage;\nThrough illumination, one becomes Wise.\n\nYet from foolishness to wisdom,\nFrom wisdom to Sagehood—\nAll stem from the heart’s expansion.\nThus the foolish may grasp Heaven and Earth’s vast patterns\nWithin upward gazing and downward contemplation,\nAnd though they reach Sagehood, it is possible.\n\nBut I am constrained by temporal patterns’ limits,\nObserving daily life’s mundane paths,\nAnd thus remain merely Wise.\n\nSagehood and wisdom diverge—\nPure and flawed, intentions differ.\nWhen the foolish attain Sagehood,\nIn Buddhism, it is called *direct transcendence*—\nLiberation beyond shores, seeing nature as Buddha.\nIn Daoism, it is called *eternal attainment*—\nAscending to immortality from the ground.\n\nOne deluded thought remains foolish;\nOne awakened thought attains Sagehood.\n\nYet the Wise are different—\nThough they strive earnestly for the Dao,\nThey may later drift, neglectful.\nWithout vigilance, they drift without bound,\nLosing what they hold, discarding what they possess,\nAnd risk sinking back into foolishness unaware.\n\nMy aspiration is Sagehood—\nHow could I settle for mere wisdom,\nThen relapse into folly?\n\nThus I transcend foolishness—\nNot merely to avoid foolishness and become Sage,\nNor to stop at Sagehood alone.\nFor the Sage’s attainment still bears measure,\nStill bound by Heaven and Earth’s patterns.\n\nI transcend form, abandon intellect,\nMerge with the Dao, and rise beyond all things—\nHow could this be confined to measure?\nThis is the ultimate transformation called Sagehood,\nYet Sagehood beyond measure is called *Divine*—\nThe Great Dao of the Golden Elixir.\n\nSpeaking thus, we speak of Fool, Sage, Wise.\nAt first, one enters the Dao through Heaven, Earth, time, and things’ patterns,\nYet ultimately, one forgets these patterns to attain the Dao.\n\nLike the Five Phases’ transformations,\nTen thousand phenomena in array—\nAll are the Dao’s manifestations.\nWords and speech, tiles and reeds—\nAll are the Dao’s dwelling.\n\nWithin the thirty-six thousand teachings,\nEach step practiced truly,\nWith accumulated effort over years,\nOne must never forget what one can do—\nFor even Confucius’ disciple Yan Hui\nDid not stray from *ren* for three months,\nWhile others reach it by days or months.\n\nBut Confucius’ grand compilation,\nKing Wen’s alignment with Heaven’s will—\nFlowing above and below with Heaven and Earth—\nHow could this be bound by measure?\n\nThose who cultivate emptiness say:\n*\"Even after eons, it remains void—\nWhat need for measure?\"*\nYet even if one endures the fires of kalpas,\nIf emptiness could destroy the Dao,\nHow is it different?\n\nThe Golden Elixir’s Great Dao\nOrigins in the *Taiji*,\nCompletes in the *Wuji*,\nFunctions in the finite,\nMysteries in the infinite—\nIt cannot be spoken of in mundane terms.\nDiscuss it carefully with the Immortals.\n\nTo sink in water, enter fire,\nIs to court death’s instruments.\nWater and fire bring burning and drowning,\nKnives and arms bring slaughter—\nEven the unwise know to avoid them.\n\nYet now one seeks to drown in water,\nWishes to enter fire,\nDelights in death by blade—\nNo fear of wind or madness,\nNor is it coercion by form or circumstance—\nThis plight is deeply pitiable.\n\nFor wine, sex, wealth, and *qi*—\nThese are but other names for water, fire, blades, and arms.\nAll lead to self-destruction within,\nYet they fear not—\nThey scoff at those who merely fast and purify,\nSaying even if they match Pengzu and Tianmen’s longevity,\nIt is but lonely suffering—\nWhy not take pleasure in wine and desire?\n\nAlas, moths drawn to flames—\nNo defense remains,\nOnly long sighs.\n\nThe Dao of Nature is still—\nThus Heaven, Earth, and all things thrive.\n\nThe Dao of Heaven and Earth is gradual—\nThus yin and yang prevail.\n\nYin and yang, in mutual succession, transform and flow in harmony.\nTherefore, the sage knows the Dao of Nature cannot be defied,\nAnd follows it to govern.\n\nThe Supreme Sage says:\nAll things teeming, each returns to its root.\nReturning to root is stillness—\nStillness is restoring the Mandate.\n\nAgain it is said:\nPush emptiness to its utmost,\nHold steadfast to stillness—\nThen all things arise together,\nAnd I observe their return.\n\nYet when emptiness and stillness are absolute,\nThe body merges with yin—\nHow then do all things arise?\n\nBut yin, if not extreme, gives no birth to yang,\nStillness, if not extreme, reveals no Dao.\n\nHow much more so—the Great Dao, formless,\nGiving birth to Heaven and Earth;\nThe Great Dao, nameless,\nNourishing all things.\n\nIf one does not conform to Nature,\nDwelling not in utter stillness,\nThen Heaven, Earth, and all things\nCould never generate.\n\nMan, with one body, partakes in Heaven and Earth’s functions—\nYet does he not know what stillness is?\n\nOnly his mind-monkey and will-horse\nDaily roam unrestrained in the field of desires,\nViewing the principles of Heaven and Earth’s creation—\nWhat relevance do they hold for him?\n\nMoreover, the Dao of Heaven and Earth\nIs like gradual infiltration—\nFrom one yang to six yangs,\nFrom one yin to six yins,\nAll growing by degrees, never abruptly.\n\nThus yin and yang, in mutual succession,\nFollow Nature’s order—\nOnly the sage knows this,\nAnd within *wuwei* there is action,\nWithin utmost motion there is utmost stillness,\nCausing all things to arise from stillness.\n\nWho but the Daoist can comprehend this?\n\nThe Dao of utmost stillness\nEven the calendar cannot measure.\nBirds and beasts are its example.\n\nThe calendar’s laws,\nCalculating celestial cycles,\nHave seventy-two *xiàng*,\nTwenty-four *qi*,\nFour seasons and eight nodes,\nWaning and waxing phases—\nAll are fixed numbers that cannot be defied.\n\nYet in regulating time and seasons,\nIn meticulous computation,\nOne doubts it contradicts the Dao of *wuwei* and Nature.\n\nOnly the sage, his Dao reaching utmost stillness,\nHis heart as boundless as the Void,\nSees yin and yang rise and fall,\nTransforming naturally—\nNot a trace of contrivance.\nIf the calendar’s artifices are excessive,\nIs it not the fate of birds and beasts?\n\nFor birds and beasts are the tortoise and hare—\nThe tortoise and hare are the sun and moon—\nThe sun and moon are water and fire—\nWater and fire are yin and yang—\nYin and yang are Heaven and Earth—\nHeaven and Earth are the Dao of pure stillness and *wuwei*, Nature’s great Way.\n\nThe Great Dao is the study\nOf penetrating principles, exhausting essence,\nExtending to the Mandate of life.\n\nLife and Mandate are the art\nOf eternal existence, the elixir’s method.\n\nThere exists a wondrous instrument,\nGiving birth to all phenomena.\nThe Eight Trigrams and Heavenly Stems,\nDivine mechanisms concealed like ghosts.\nThe arts of yin-yang victory\nAre clearly manifested in symbols.\n\nAh, the Dao! How vast!\nAh, the words! How profound!\n\n*The Yinshu Jing* are Yellow Emperor’s secret utterances on the Dao.\nI dare not hesitate—\nI explain their meaning,\nRevealing Heaven’s hidden machinations.\nTo gaze upon the end and summarize the beginning,\nIt is like the *xuan* of *Qian* and *Kun*,\nEmbracing the essence of all sixty-four hexagrams.\nIts probing of mysteries, reaching the profound,\nIs not easily fathomed.\nAh, how splendid!\n\nI dare to bow twice.\nThrough gradual influence, it is made clear—\nAnd the Great Dao of the elixir,\nWithin one’s body,\nHas its wondrous instrument—\nNot necessarily forged by fire and furnace.\n\nThe crescent furnace of **Yǎn Yuè**, the hearth of **Tài Yī**, the tripod with neither inside nor outside—\nthe most refined, most sacred elixir,\nwhich gives birth to all phenomena,\nall emerging from the natural order.\n\nDongbin spoke of a single grain of millet containing a world,\nthree *shāng* of a cauldron boiling mountains and rivers—\nwas this not truthful speech?\n\nThus, when spoken of through the Eight Trigrams,\n**Kàn** and **Lí** are the foundation;\nwhen spoken of through the Circulation of Heaven,\nthe **Child** (水) takes precedence.\n\nIts divine mechanism—\nits wondrous, boundless applications;\nits hidden essence—\nits concealment and revelation beyond measure.\n\nWhen yin overcomes yang,\nwater and fire achieve *Jìjí* (既济);\nwhen yang overcomes yin,\nsun and moon become *Hébì* (合璧).\n\nThe **Golden Crow** has the virtue of seizing the hare,\nthe **Wooden Dragon** the power of subduing the tiger.\nThe tortoise and serpent entwine their necks,\nthe clam and mussel hold pearls—\ntheir symbols hang resplendent,\nhardly concealable.\nIs this not the meaning of *chōngshí ér yǒu guānghuī* (充实而有光辉)—\nthe greatness of *dà ér huà zhī* (大而化之)—\nthe sainthood of *shèng ér bùkě cèzhī* (圣而不可测知)?\n\nThis is the Dao—\nthe very concern of our Confucian tradition.\nThe ignorant claim the elixir as heterodox, perverse learning—\nlike one who sits in a well and claims the sky is small.\nIs this the sky’s fault?\n\n**Yúnfēng** says:\nWho does not pass through the door?\nWhy not walk this Dao?\n\nThe door is a gate.\nOnly with a gate can one walk the true path.\nIf the gate is lost,\nthere arises reckless, wild behavior,\ndeviant and extravagant habits.\n\nThus it is said:\nWithin are the Three Gates—\nwith nature as master,\nwith vital qi as core—\nthe constant return inward,\nnever letting out.\n\nWithout are the Three Gates—\nthe mouth as hinge,\neyes and ears as locks—\nthe evils of the nine orifices lie in these three.\n\nThese are the daily, ordinary ways\nof the *Zhōngyōng* (中庸), the Great Dao.\n\nThe Dao is like a great road—\nwho does not walk it?\n\nAt its beginning,\neven women and children may understand it;\nwhen it reaches its height,\neven sages have things they do not know.\n\nThus it is said:\nTo be sung is to be good (*kě gē zhī wèi shàn*),\nto be within oneself is to be true (*yǒu zhū jǐ zhī wèi xìn*),\nto be full and radiant is to be great (*chōngshí ér yǒu guānghuī zhī wèi dà*),\nto transform and change is to be sage (*dà ér huà zhī zhī wèi shèng*),\nto be unfathomable is to be divine (*shèng ér bùkě cèzhī zhī wèi shén*).\n\nThis divinity—\nis it not the luminous, wondrous function,\nthe manifest transformation, the secret essence\nof the elixir’s true meaning?\n\n**Yúnfēng** on the *Diary of the Sun and Moon’s Sacred Functions*:\nThe Dao of Heaven and Earth—\none yin, one yang,\nthe primordial *qi* paired,\nand all things are born.\n\nThe suspended symbols, most manifest—\nnone greater than sun and moon.\n\nThe **Great Sun**, true fire,\ncorresponding to the southeast,\nborn from wood;\nexternally corresponding to spring and summer,\ngiving birth to all things.\n\nThe **Moon**, true yin-water,\ncorresponding to the northwest,\nnourished by metal,\npruning and killing all things.\n\nThese two are the mechanisms of Heaven and Earth’s birth and death,\nthus called *water and fire*,\n*Kàn and Lí*,\n*lead and mercury*,\n*Dragon and Tiger*—\nother names too numerous to count,\nall names for sun and moon.\n\nThe sage observed Heaven’s Dao,\ndiscerned its waxing and waning,\nrevealed its hidden depths,\nand divided the sun and moon’s *qi* into the Eight Trigrams—\ntwo for the sun’s fire,\none for the moon’s water.\nOnce one and two were divided,\nthe *guà*’s *qi* differentiated,\nthus forming sixty-four variations.\n\nThe first fifteen days:\n**Kūn** gives birth to **Zhèn**, which transforms into **Xuàn**,\n**Xuàn** transforms into **Gàn**,\n**Gàn**’s *qi* full and round,\nsuspended and shining in the east—\nmetal and water warm and gentle,\nmetal’s *qi* sufficient,\ngiving birth to true water.\n\nThe next fifteen days:\n**Gàn** diminishes into **Xùn**,\n**Xùn** returns to **Gèn**,\n**Gèn** diminishes into **Kūn**—\n**Kūn** and **Qián** unite,\nsun and moon intertwine,\ntheir essence most subtle, most refined—\nbeyond thought or speech.\n\nEven spirits, ghosts, and gods,\nlet alone humans and beasts,\ncannot hide a hair’s breadth.\n\nGreat indeed is the body of sun, moon, Heaven, and Earth!\n\nIf one can exhaust the sun and moon’s sacred functions,\nthen at new and full moons, observing Heaven’s symbols,\none may align with Heaven and Earth, sun and moon in their movements—\nhow could one not transcend the mundane, attain sainthood,\nescape death and enter life?\n\n**Yúnfēng’s Explanation of the *Wondrous Instrument, Ten Thousand Phenomena***:\nAs the *Yīnfǔ Jīng* says:\n*\"There exists a wondrous instrument,\nwhich gives birth to all phenomena.\nThe Eight Trigrams and Heavenly Stems—\ndivine mechanisms concealed like ghosts.\nGreat are the words!\"*\n\nA person’s body is itself this wondrous instrument—\nall phenomena complete,\nspirits and ghosts guarding it—\ntruly the most noble.\n\nThe **Tàishàng** says:\n*\"The body is hard to obtain,\nthe Central Land hard to be born in,\nand if born, the true law is hard to encounter.\"*\n\n**Píngshū** says:\n*\"First establish **Qián** and **Kūn** as the tripod,\nthen bring the crow and hare’s elixir to boil.\nWhy seek **Qián** and **Kūn** beyond the body,\nor take the crow and hare from the sun and moon’s palace?\"*\n\nThus it is known:\nthe wondrous instrument lies within the body,\nall phenomena are complete in oneself—\nthe Two Poles, the Three Luminaries, the Four Symbols,\nthe Five Phases, the Eight Trigrams,\nthe Nine Palaces, the Ten Stems, the Eleven Celestial Exaltations,\nthe Twelve Branches, the Twenty-Four Seasons,\nthe sixty *jiǎzǐ* of the Circulation of Heaven—\nall are complete in a single body.\n\nIf one can look upward and downward,\naligning with Heaven and Earth, yin and yang in their transformations,\nthen the mechanisms are sealed in harmony,\nghosts and gods cannot fathom,\nthe Three Powers stand together,\nlongevity and clear vision are attained—\nhow far could the Dao of transcendence be?\n\n**Yúnfēng’s Explanation of *The Three Teachings Merge as One***:\nThe Three Teachings follow different paths but converge.\nThe deluded create divisions.\n\nThey say Buddhism and Daoism are empty,\nunworthy of comparison with Confucianism—\nthis is true.\n\nBut when it comes to cultivating the true self,\nnurturing nature,\nand the Dao of rectifying the heart, sincerity of intent—\nthe distinctions are not so clear.\n\nOnly the Chan school stands apart in its strangeness.\nI wished to dispel its delusions,\nyet never grasped its essence.\n\nOne day, I pressed **Mèng’ān Cōng Lǎo**,\nasking how the transmission of the school’s nature and lamp might be clarified—\nand the discussion continued without end.\n\nThe great essence is thus: **The Dharma-body is the void**, the void is the **Dharma-body**.\n\nMoreover, he earnestly admonished me to reflect upon this,\nso I lit incense and candles,\nand invoked the **Three Jewels** as witness.\n\nIn a short while, after tea was done,\nsuddenly he called for the novice to attend to matters,\nand withdrew with me to the rear gallery.\nUpon exiting, he washed his hands and removed his armor,\nthen straightened his square-cloth robes,\nand asked me to return to my seat.\nHe then said, *\"The old monk is rather hungry—*\nlet us share a bowl of soup and dumplings.\"\n\nI hesitated and replied:\n*\"Just now, you spoke of the void and the **Dharma-body**,\nthe **Dharma-body** and the void—\nyet now hunger and thirst cannot be avoided.\nYou distinguish between defiled and pure,\nbut how can one suspect you of failing to grasp the void?\nWhat is this still?\"*\n\n**Mèng’ān Cōng Lǎo** was stunned,\nand found no words to answer.\n\nWhen we reached the **hall of the square room**,\nI saw there a *Snow Cave Sayings* (**Xuědòu Yǔlù**).\nAt the moment, I read it.\nWithin it, a monk asked **Zhìwèn** the Venerable:\n*\"How is the **Prajñā-body**?\"*\nHe replied: *\"A clam holding the autumn moon.\"*\n\nThe monk asked: *\"How is the **Prajñā-use**?\"*\nHe replied: *\"A rabbit bearing a fetus.\"*\n\nNot only does this settle the world of stillness,\nit also secures the realm of the **Dharma**.\nIf one can skillfully ponder and examine,\nthen let them stride alone in the **Lotus Land**.\n\nThe monk asked: *\"How is the Buddha’s supreme matter?\"*\nHe replied: *\"A staff’s tip lifts the sun and moon.\"*\n\nAgain, the Ancestor asked **Nánquán** the Venerable:\n*\"The **Mañjuśrī-bead**—if one does not recognize it,\nthe **Tathāgatagarbha** is personally gathered within.\nHow is the **Tathāgatagarbha**?\"*\n**Nánquán** said: *\"That which comes and goes with you is the treasure.\"*\nThe Ancestor said: *\"A Han within the grass.\"*\n**Nánquán** said: *\"That which neither comes nor goes is also the treasure.\"*\nThe Ancestor said: *\"Frost upon snow.\"*\nThe Ancestor said: *\"How is the bead?\"*\n**Nánquán** said: *\"To perform tricks at the hundred-foot staff’s peak—\nthat is no master’s hand.\nHere, if one catches sight of this,\nguest and host exchange places,\nand one may penetrate the tiger’s den.\nIf not so,\neven if the Ancestors awaken fully,\nit is still a dragon’s head and serpent’s tail.\"*\n\nThus, I pointed out to **Mèng’ān** a glimpse to cure his affliction.\nAt that moment, he attained great awakening\nand returned the incense at the stove to me.\n\nTruly, the Three Teachings differ in no essence—\ntheir original face is one and the same,\nonly their robes vary in hue.\nThus, I record this in detail\nto proclaim to the clear-eyed gentlemen of the world.\n\n---\n**The Diagram of Before-Heaven and After-Heaven**\n**Yúnfēng** said:\nBefore-Heaven is when the **Tàijí** has not yet divided,\nmixed and undifferentiated—\nwhich is **yáng**? Which is **yīn**?\nOnce the **Way** generates **One**,\nits substance is already revealed,\nits function already sprouted.\nThus, **One** is the odd number,\nthe **stem of the hexagram**,\nthe symbol of pure **yáng**.\n\nAfter-Heaven is when **Hóngméng** is split,\n**One** divides into **Two**,\n**One** becomes the paired number,\nthe **body of the hexagram**,\nthe symbol of pure **yīn**.\n\nSince **Qián** and **Kūn** differ,\nand **yīn** and **yáng** are divided,\ntheir transformations vary—\nhow then is this the **Way**?\n\nOnly the marvel of the **Golden Elixir**\nreturns to the root and source,\nseeks the root and plucks the bud,\nnurtures the **feminine** and embraces **One**,\ndiscards **yīn** and takes **yáng**,\nnot seeking unity in the difference of **Qián** and **Kūn**,\nnor harmony in the division of **yīn** and **yáng**.\nThus, the divided and the disparate belong to After-Heaven,\nwhile the unified and harmonized are truly Before-Heaven.\n\nBefore-Heaven is the **Primordial Ancestor**,\nthe **qi**’s original face;\nAfter-Heaven is the **stinking rot** turned into marvels,\nthe four **great elements** artificially combined.\n\nThe enlightened observer—\nif one knows the body is illusion,\nonly the **Way** is true,\nthen to delay practice by reflecting back the light\nis already too late.\n\n---\n**The Diagram of the Upper and Lower Magpie Bridge**\n*(Also called the Curve River Crow Bridge)*\n**Yúnfēng** said:\n**Lǚ Dòngbīn’s** *\"Qìn Yuán Chūn\"* reads:\n*\"On Curve River, the moon’s glow is clear and pure—\na crow flies there.\"*\n\nThe crow is the magpie.\nCurve River is the bridge.\n\nThe sun contains the **three-legged crow**,\nthe crow belongs to **yǒu** (the hour),\n**yǒu** belongs to **metal**.\nThe crow is the **metallic essence** of the West,\nthe **yang soul** of the sun,\nable to fly above Curve River—\nthus, the magpie can cross the bridge to transcendence.\n\nYet the bridge must be divided into upper and lower—\nwhy?\nBecause the **qi**-paths communicate:\none who can cross the lower bridge\nmust also be able to cross the upper.\nThose who can cross are **transcendents**,\nthose who cannot are **mortals**.\n\nThe **Buddhist** practice of tethering the horse to the **chūn tree**,\nor tethering the donkey to the **ruò stake**,\nalso conveys this meaning.\nBut their rigid adherence to the **good path of death**,\nstubbornly facing the wall,\ncannot make the crow fly or the magpie cross—\nthus, they fall into the second category.\n\nYet their original method was not so.\nAlas, later descendants strayed.\n\nThe details appear in the **Diagram of the Three Teachings as One**.\n\n---\n**The Diagram of the Seventy-Two Seasons**\n\n**The Diagram of the Seventy-Two Seasons**\n\nYúnfēng annotates *The Secret Speeches of the Primordial Origin* thus:\n*\"Vague and indistinct, the spirit arises from fire;\nObscure and murky, the essence forms within water.\nFire ascends in flame, sevenfold to birth the spirit;\nWater flows downward, sixfold to birth the essence.\nSeven and six transformations—above and below, they interweave.\nSpirit and essence circulate, the wondrous body enfolds the True.\nThe spirit, sevenfold transformed, generates True Fire;\nThe essence, sixfold refined, generates True Water.\nThe wondrous number of seven and six—thirty-three—\nExceeds not the water and fire of Heaven and Earth.\nThus, Heaven’s thirty-six yang seasons birth Fire,\nEarth’s thirty-six yin seasons birth Water,\nCombining seventy-two seasons to complete the Heavenly cycle.\n*The Daoist Scripture* states:\n‘Thirty-six above, thirty-six below,\nThe Great Mystery knows no bounds—\nWondrous, the *Great Cavern Scripture*!’\nYet why speak only of water and fire, not the Five Phases?\nFor water and fire are the sun and moon.\n*The Yinyufu Scripture* says:\n‘Sun and moon have their numbers, great and small have their limits—\nFrom this, the Sage’s work arises, the divine radiance emerges.\nIf one can observe above and below, mastering the Fire’s season,\nThen they align with Heaven and Earth in virtue,\nMerge with sun and moon in luminosity—\nTruly, they ascend to transcendence from the plain.’\n\n**The Diagram of the Five Phases’ Generation**\nYúnfēng says:\nThe *Taiji* divides to birth the Two Poles—Heaven and Earth.\nOnce Heaven and Earth take form, they cannot escape their cycles.\nThus, Heaven-One births Water, Earth-Two births Fire,\nHeaven-Three births Wood, Earth-Four births Metal,\nHeaven-Five births Soil—\nThe Five Phases weave the transformative pattern of Heaven and Earth,\nSo the Five *qi* shift and cycle, cold and heat alternate,\nThe Heavenly degrees unfold, clear as day.\nThus, thirty-six days of *jiǎ*, thirty-six days of *yǐ*—\nWood’s *qi* and numbers are complete;\nThirty-six days of *bǐng*, thirty-six days of *dīng*—\nFire’s *qi* and numbers are complete;\nThirty-six days of *wù*, thirty-six days of *jǐ*—\nSoil’s *qi* and numbers are complete;\nThirty-six days of *gēng*, thirty-six days of *xīn*—\nMetal’s *qi* and numbers are complete;\nThirty-six days of *rén*, thirty-six days of *guǐ*—\nWater’s *qi* and numbers are complete.\nCombining five sevens—thirty-five—\nWe calculate three hundred fifty days, plus two and a half ten days,\nTotaling three hundred sixty days—\nThus, the year’s twelve months align without discrepancy.\nThe remaining degrees of Heaven can be accumulated through intercalary months,\nTo shape the myriad transformations of the cosmos.\nYet humans, the most enlightened of all things,\nAre blind to the Five Phases’ operations,\nSeeing only day and night’s cycle, the four seasons’ succession,\nUnaware that the Five Phases’ transformations truly govern the profound—\nAh, the wondrous!\n\n**Yúnfēng’s Preface to the *Pharmaceutical Mirror* Annotation**\nComposed by *Lǐu Yuángàng*, Left Historiographer, Palace Attendant, and Imperial Petitioner,\nFor *Xià Zōngyǔ*, whose bold and unconventional strategies\nServed in the imperial bureaucracy, then transferred to frontier outposts,\nWhere fate’s oddities left him unpaired.\nHe wandered freely, seeking the arts of flying ascension and return,\nAnd so, through silent transmission, presented this annotated scroll to me.\n\nOnce, Su Dongpo said of An Qigeng: *\"In his age, he was known as a transcendent.\"*\nYet Sima Qian wrote: *\"Qióu Tōng, a skilled man from Qi, knew An Qigeng,\nWho used strategy to seek audience with Xiàng Yǔ.\nYǔ could not employ him, intending to bestow titles—\nBoth refused and fled.\"*\nEach time I read this, I cannot help but lay down my book and sigh:\nIf not such men, then who are the transcendent?\n\nThus, the scholars of the Warring States—like Lǔ Zhònglián and Yú Qīng—\nWere they not those who attained the Way?\nYú Qīng, unwilling to see Wei and Qi destroyed,\nSlipped away to Zhào, then fell into poverty in Lǐang, losing his chancellor’s post,\nAnd in despair, wrote his *Book*.\nQióu Tōng’s arguments went unheeded, so he feigned madness as a shaman,\nEscaped to Hóngkè, and composed his own treatise—\nWas this not mastery of the Way?\nHe refused office, upholding lofty principles,\nDebating the harm of the Wei and Qin emperors,\nResigning from his post as governor of Liáochéng.\nWhen offered gold to extend his life, he said:\n*\"What the world values in its worthies\nIs their ability to resolve calamities, alleviate hardships,\nDissolve strife—without seeking personal gain.\nIf they do seek gain, it is the merchant’s trade, which I cannot bear.\"*\nWhen offered nobility, he fled, saying:\n*\"I would rather be poor and scornful of the world,\nThan rich and noble, bowing to others.\"*\nAh! Only one like Lǔ Zhònglián could be called transcendent.\nAn Qigeng’s recorded in histories and scattered notes—\nSeeming fabulous, ungrounded.\nYet if he were like Lǔ Zhònglián, spitting a rainbow,\nOr like the mighty who lift the cauldron—\nBoth accounts are grossly mistaken.\nHis lingering legacy is but a fleeting trace.\nNow I understand: worldly scholars, when detached, may ride the dragon—\nThis is the truth.\n\nZōngyǔ’s annotations on the *Three Golden Books*\nSurpass the mundane, solidifying beyond the *Eight Immortals’ Precepts*,\nPiercing satire and political maneuver—\nThese are the writings of Lǔ Zhònglián and An Qigeng.\nAs for Yú Qīng and Qióu Tōng, mere strategists—\nHow can they compare with these two?\n\n**Written on the fifth day after the Winter Solstice, Bǐngxū of the Bǎobǎo era,\nBy Qīngyuān, the Hermit of Yúncūn Mountain.**\n\n**Yúnfēng’s Continuation**\n*\"Summer’s peaks are rich with strange formations\"*—\nA phrase the Jin poets treasured.\nI, with my illusory nature, adopt this illusory name—\nTruly, adding feet to a snake, a neck to a duck.\nPerhaps some will mimic Sima Qian’s fondness for the strange,\nOr steal the poet’s clever phrases,\nTo display themselves.\nAlas, summer is one of the four seasons,\nClouds are but *qi*—\nWhere do the peaks arise? Where does the strangeness come from?\nEmerging from the mists without intent,\nRiding the dragon without trace,\nBringing rain or drought,\nStirring wind or rain—\nThousands of oddities, countless transformations,\nUnfathomable, beyond measure—\nNone of this is my aspiration.\nIs it not that Heaven-One brings clarity,\nEarth-One brings tranquility,\nThe season is now the Vermilion Emperor,\nAnd the Flame Sovereign holds the balance?\n\n「Peaks of the Dao’s Record\n\n　　A fine wind from the south,\n　　The sun’s shield blazes like a steaming cauldron,\n　　The Fire Sovereign’s canopy burns fiercely,\n　　Gold and stone melt into congealed essence.\n　　These are not mere *qi*—they are clouds,\n　　These are not mere forms—they are peaks.\n　　The Lord of the Celestial Caverns,\n　　Gathers essence and concentrates spirit.\n　　The Hall of Illumination expands grandly,\n　　The Sovereign of the Purple Court sits upright and serene.\n　　The radiant and illustrious *Ding Gong*,\n　　Refines and tempers the golden essence.\n　　Kunlun rises in vigor,\n　　The Jade Well brims with clarity.\n　　The Supreme One’s furnace glows warm,\n　　The Crescent Furnace flickers with light.\n　　The *Huan* winds blend and swirl,\n　　Thunderclaps and lightning clash in resounding fury.\n　　Ascending to the celestial apertures,\n　　Descending to the abyssal depths.\n　　The Four Beasts of Luo and Wei,\n　　The Six *Ding* on either side.\n　　The revolutions of the *Zhou Tian*,\n　　Nine transformations, soaring aloft.\n　　At this moment of clouds and peaks,\n　　Why should they alone bear the name of strangeness?\n　　Profound indeed is the Great Dao,\n　　The virtue/power of Heaven and Earth coalesce.\n　　Before the Ancestor of the Primordial *Qi*,\n　　When yin and yang were yet undivided,\n　　Who could be the heavy turbid?\n　　Who the light and pure?\n　　When *Hongmeng* carved the distinction,\n　　Life gave rise to Heaven, Earth, and Man,\n　　Above covering, below embracing—\n　　Man is the most refined and responsive.\n　　The *Yunhua* stands firm and poisonous,\n　　Yet persists through endless *jie*—\n　　The black flies, the white rabbits,\n　　The suspended symbols, twinly bright.\n　　The waxing and waning of months and days,\n　　A single encounter spans three decades.\n　　Sudden and unaccountable—\n　　Nine summers pass, yet only these clouds display their peaks.\n　　When *Geng* approaches the Three Scorching,\n　　Fire must rush westward.\n　　The Golden Elixir’s mysteries,\n　　Fire as its divine essence.\n　　Clouds ascend as fiery *qi*,\n　　Peaks materialize as spiritual forms.\n　　Boiling in the *Kan* furnace, refining the marrow of *Li*,\n　　Plundering the essence of *Qian* and *Kun*.\n　　The insidious yin vanishes,\n　　Pure yang emerges.\n　　Heaven and Earth complete their union,\n　　Life triumphs over death.\n　　The strangeness of clouds and peaks—\n　　Unthinkable, beyond conception.\n　　Who but the True One could unlock their secrets?\n　　Perhaps some remain speechless,\n　　Only startled to call it marvelous.\n　　Now it is known:\n　　The Confucianists err in rigidity,\n　　The Buddhists in stagnation,\n　　The Daoists equal the Great Void—\n　　Yet within it lies the root and stem.\n　　Heaven and Earth vast and boundless,\n　　The Dao gives them birth;\n　　All things scatter and differentiate,\n　　The Dao sustains them;\n　　The sun and moon traverse east and west,\n　　The Dao sets them in motion;\n　　These clouds become peaks,\n　　The Dao truly attains them.\n　　I perceive the One True and Unmoving,\n　　Seizing and releasing all spirits,\n　　The two *qi* revolving in harmony,\n　　Generating all existence.\n　　Who knows if these are clouds or peaks?\n　　Thus, the Seven Returns and Nine Reversions,\n　　Are but these clouds and peaks;\n　　The Eight Return and Six Residence,\n　　Are likewise these clouds and peaks;\n　　The Primordial Pearl forming its symbol,\n　　Is but these clouds and peaks;\n　　And when the True Person appears,\n　　It is also these clouds and peaks.\n　　Profound! Mysterious!\n　　How could these be mere poetic phrases to be described?\n\n　　Recorded in the Summer of *Dou Cheng* by *Xia Yuan Ding*.\n　　Autobiographical Preface of Clouds and Peaks\n\n　　Disturbance as the root of one’s profession,\n　　Serenity as the mirror of medicine—\n　　This is the lawful speech of *Cui Gong*.\n　　Is it not that man’s existence,\n　　The Four Great Elements in borrowed unity,\n　　His tears, saliva, semen, vital breath, and blood—\n　　All are but yin’s insidiousness?\n　　Wine, lust, fame, and gain—\n　　Greed, anger, and delusion—\n　　All are but chaos.\n　　Only the medicine’s mirror of serenity and stillness\n　　Can subdue and govern them.\n\n　　What is meant by *medicine*?\n　　It is the cinnabar, mineral essence, and wood essence\n　　Obtaining gold and merging as one.\n\n　　What is meant by *mirror*?\n　　It is the luminous clarity of true awareness,\n　　The radiance that reflects light and returns vision.\n\n　　Thus the Sage teaches through the *Dao of the Spirit*,\n　　And uses the sun and moon as the *I Ching*;\n　　The Immortal Way takes enlightenment as its core,\n　　And uses the sun and moon as elixir;\n　　The Buddhist’s staff that prods the sun and moon,\n　　The transmission of nature through the lamp—\n　　All are but material things.\n\n　　*Cui Gong*’s compassion and mercy extend to all,\n　　His skill in allegory is unmatched.\n　　Thus, *Lü Dongbin* said:\n　　*\"Because of observing Cui Gong’s entry into the* **Yao Jing***,*\n　　*It makes one’s heart and mind turn clear.\"*\n\n　　Indeed, he is the teacher of both Heaven and Man.\n\n　　I have thrice perused the teachings of the *藏 (藏教, Zangjiao—Buddhist canon)*.\n　　Of the seven copies of the *Yao Jing* I obtained,\n　　Their texts all differ.\n　　This scripture totals **243 characters**,\n　　Its brevity matches its profundity—\n　　Like the *Taoist Canon’s* hidden mysteries,\n　　Like the *Spring and Autumn Annals’* rectified essence,\n　　It reveals the subtle and explores the profound,\n　　It delves into the abstruse and uncovers the hidden—\n　　No meaning is left unexplored,\n　　It is indeed the pivot of the Golden Elixir.\n\n　　On the occasion of the *Changjie* (菖节, a Daoist festival),\n　　Passing through the Eight Treasures (八宝, likely a place or sect),\n　　Resting at the left study of *Peng Zhongfu*,\n　　I questioned him about the furnace incense,\n　　And carelessly added this footnote\n　　To leave a legacy for the present age.\n\n　　To the enlightened gentlemen of *Yuzhang*—\n　　*Hu Ji Zhe* (灵源子胡季辙, \"Bar Season of the Spirit Source\"),\n　　And *Wang Hefu* (天台元漠子王和甫, \"Harmonious Master of the Primordial Mist\"),\n　　Both disciples of the Immortal Way—\n　　I dedicate this.\n\n　　Sequential Preface by *Xia Yuan Ding*.\n　　Postscript」\n\nProfessor Wang Jiuwàn of the New Prefecture of Xinzhou’s School,\n*Modifying Official Duties*:\n\nLi Yèhóu, at seven years old, was already skilled in letters,\nhaving read ten thousand volumes.\nYet he then donned Daoist robes,\nand devoted himself to the study of the Immortal Way,\nas if to make it his lifelong pursuit.\n\nOnly the careless and reckless could dismiss this, saying:\n*\"No need for idle words—just take the post of Chancellor for ten years.\"*\n\nLater, the Marquis plotted to serve his country,\nand his wisdom and strategy were not inferior to Zhang Liang.\nThe world speaks of those beyond the square—\nmust they indeed abandon the world and sever all ties?\nIs this so, or not?\n\nThose who follow the Dao merely use such detachment as a stepping-stone,\nnot as their final destination.\n\nIn Yongjia, Xia Yunfeng,\nas a youth, rode through the examination halls with his young scholar’s whip,\nvisiting all the great masters.\nLater, he moved among military camps,\nearning rewards through merit,\nand galloped across Shandong and Hebei.\nHe ascended the sunlit mounds to pay homage to Confucius’ grove,\nthus swelling the vast and unyielding *qi* within his breast.\n\nSeeing the world’s affairs as unworthy of his ambition,\nhe resigned his office and took up the Dao.\nOne day, he presented his annotated *Three Books*,\nand sent a messenger to gaze upon them—\nas if to say, *\"What is there to understand beyond this?\"*\nHow could one truly grasp it?\n\n「I have heard that the venerable ancestor, the late **Zeng Wangfu** (曾王父), who compiled the *Nine Classics* (先训九万) and bore the posthumous title **Zi Xian** (公讳子献), once accompanied the Chancellor **Lu Yuanzhi** (吕元直) and the Minister **Huo Anguo** (霍安国) in the **Xuanhe era** (宣和间), jointly undertaking the mission of transporting grain to **Yan** (燕).\n\nAt that time, the rebellious **Pei** (降虏) captives such as **Guo Yaoshi** (郭药师), **Liu Shunren** (刘舜仁), and **Zhang Lingwei** (张令徽) harbored hidden treachery. The three envoys, bearing the same commission, submitted a memorial pleading to abandon **Yan**, defying the **great** and **obstructive** **He** (大阖) and **Tan** (谭稹), and were all dismissed from office, unable to depart. The cunning of the **Pei** captives grew bolder, and the three envoys exerted every effort to defend and protect the realm, often staying awake through the night. **Zeng Wangfu**, through this ordeal, mastered the art of **nurturing one’s vital essence and guarding one’s *qi*** (神守气之术). Later, he lived to the age of eighty-nine, dying without illness.\n\nThe day before his passing, he still called for a lamp and wrote in small script to respond to Chancellor **Li Bojiji** (李伯纪). Among his disciples, **Yan Yizhong** (颜夷仲) once privately asked him about the matter. **Zeng Wangfu** replied that people often knew how to fill their bodies with *qi* but did not know how to use their vital essence to govern it. If the essence and *qi* were not harmonized and mutually guarded, this was not a true method of **nurturing life** (养生之善者).\n\nThe method of **governing *qi* with one’s essence** (以神御气) lies in **rectifying the heart and sincerely cultivating intention** (正心诚意), and in **quiet sitting while counting breaths** (宴坐而数出入息). For breath is *qi*, and counting is the essence. *Qi* is like a horse, the essence like its driver. If one uses the essence to guide the *qi* in its ebb and flow without separation, then one may achieve **longevity** (长生).\n\nThe *Zhuangzi* (《庄子》) states:\n*\"The breath of the True Person (真人) fills to the heels,\nwhile that of the common man fills only to the throat.\"*\n\nIf breath is not confined to the throat but instead dwells in the **elixir field and sea of *qi*** (丹田气海), one can avoid disturbing the essence with thoughts and desires, or agitating the *qi* with restless movements. Counting breath **continuously and subtly** (绵绵然数之), to the point where it becomes innumerable, progressing from shallow to deep, from coarse to refined, from presence to absence—then **harmonious *qi* permeates from crown to sole** (和气充塞于顶踵之间), and one cannot distinguish *qi* from essence, nor essence from *qi*. Its subtlety transcends all speech.\n\nIs this not akin to the **state of seated oblivion** (坐忘)?\nAs for his supplementary use of **classical Daoist techniques, stretching, and massage** (经伸按摩之术), it is also harmless, provided one does not grow weary of them.\n\n**Huanglong Master** (晦翁先生) once remarked:\n*\"This is the method of embryonic breath (胎息法), though it is but a remnant of the teachings in the *Shen Tong Qi* (参同契).\"*\n\nAnd who could surpass **Xia Yunfeng** (夏云峰) in his **alchemical and Daoist works** (金丹三书), which **transcend the ordinary** (超然自应), **manifest transformations** (显化通神), and **illuminate profound and subtle applications** (灵明妙用)?\n\nThough **Xia Yunfeng** began his cultivation as a youth, he attained the **Dao** (得道) on **Hengshan** (衡山), and spent over a decade in the tumult of military affairs—his path differed from **Yi Hou** (邺侯) yet mirrored his in the same era. Now, under the **awakened and extraordinary** (寤寐不凡) reign of the **sage emperor** (圣天子), those who rise to **achieve great deeds** (治功) should take **Yi Hou’s resolve** (邺侯之心) as their own. Let them **settle the Central Plains** (了中原) for the state, and then seek **Zi Xian** (子房) without delay.\n\nA preface by a **scholar of Wuyi Mountain** (武夷山人), written in the year **Dinghai of the Baocheng era** (宝庆丁亥).」",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "阴符经讲义 宋 夏元鼎 提要 序 卷一 卷二 卷三 卷四 《阴符经讲义》四卷，宋夏元鼎撰。 元鼎字宗禹，自号云峰散人，永嘉人。 是编以丹法释《阴符》之旨。 卷末附内外三关图、日月圣功图、奇器万象图、三教归一图、先天后天图、上下鹊桥图、七十二候图、五行生成图，各系以说。 案《汉志》道家、神仙家截然两派，《阴符》三百八十四字，本李筌自撰而自注之。 筌注不言炉火，则为道家之言而非神仙家言可知。 后人注筌之书，乃不用筌之自注，郢书燕说，殆类凿空。 然《参同契》不言《易》，陈抟引以言《易》，遂自为一家。 《阴符经》不言丹，此书引以言丹，亦遂自为一家，递相传授而不能废。 故今于《阴符》一书，录六家之注以存其初义，复录此书以备其旁支，所谓从同同也。 其馀衍此两派者则不更录焉。 二氏之书，姑存崖略而已，不必一一穷其说也。 是书前有宝庆二年楼昉序，称元鼎少从永嘉诸老游，好观《阴符》，未尽解。 后遇至人于祝融峰顶，若有所授者。 后取《阴符》读之，章断句析，援笔立成，若有神物阴来相助云云。 盖方术家务神其说，往往如是也。 又有宝庆丙戌留元刚云峰入药镜笺序一篇，及元鼎自记、自序二篇，宝庆丁亥王九万后序一篇，俞琰《席上腐谈》称元鼎注《阴符》、《药镜》、《悟真》三书，真西山为之序，与诸序所言悉合。 今未见其入《药镜》、《悟真篇》二注，而此本已无德秀序，殆传写佚之。 然德秀《西山文集》亦不载其文，则莫喻何故矣。 序",
      "translated_text": "**Lectures on the *Yinfu Jing* (宋 夏元鼎 *Yinfu Jing Jiāoyì*)**\n**Preface to the Summary (提要 序)**\n**Volume 1–4**\n\nThe *Lectures on the Yinfu Jing* (四卷) is authored by Xia Yuan ding (夏元鼎) of the Song dynasty.\n\nYuan ding, styled Zongyu (宗禹) and self-styled Yunfeng Hermit (云峰散人), was a native of Yongjia (永嘉). This work elucidates the *Yinfu Jing* through the Daoist alchemical (丹法) perspective.\n\nAt its close, the text appends diagrams and commentaries on:\n- The Inner and Outer Three Passes (内外三关图),\n- The Sacred Functions of Sun and Moon (日月圣功图),\n- The Marvelous Instruments of Ten Thousand Symbols (奇器万象图),\n- The Three Teachings in Unity (三教归一图),\n- The Primordial and Transformative (先天后天图),\n- The Upper and Lower Magpie Bridges (上下鹊桥图),\n- The Seventy-Two Stellar Phases (七十二候图),\n- The Generation of the Five Phases (五行生成图).\n\nAccording to the *Han Records* (《汉志》), the Daoist and Immortalist schools were distinct traditions. The *Yinfu Jing*, comprising 384 characters, was originally composed and annotated by Li Qian (李筌). Since Qian’s annotations make no mention of furnace-fire (炉火), it is clear that the text belongs to the Daoist rather than the Immortalist school. Later commentators, however, disregarded Qian’s own annotations, fabricating interpretations akin to *Ying Shu Yan Shu* (郢书燕说)—mere contrivances.\n\nYet, while the *Paramartha Agreement* (《参同契》) does not invoke the *Yijing*, Chen Tuan (陈抟) cited it in relation to the *Yijing*, thereby establishing his own school. Similarly, though the *Yinfu Jing* does not speak of alchemy, this work does so, thus forming another distinct tradition. These interpretations were transmitted successively and could not be discarded.\n\nHence, in this compilation, I have recorded the annotations of six schools on the *Yinfu Jing* to preserve its original intent, and included this work to account for its divergent branches—what is termed *\"from the same, to the same\"* (从同同也). Other works branching from these two traditions are omitted.\n\nAs for the two schools (二氏), only their broad outlines are retained; there is no need to exhaustively examine each.\n\nThe text opens with a preface by Lou Fang (楼昉) from the Baocheng era (宝庆二年), stating that Yuan ding, in his youth, studied with the elders of Yongjia and, though he admired the *Yinfu Jing*, did not fully grasp its meaning. Later, upon encountering a transcendent figure at the summit of Zhufong Peak (祝融峰), he seemed to receive instruction. Subsequently, upon re-reading the *Yinfu Jing*, he analyzed its chapters and sentences, and with a stroke of the brush, composed it anew—claiming that a divine force from the Yin seemed to assist him. Such is the tendency of the esoteric arts, ever prone to such mystifications.\n\nAdditionally, there is a preface by Liu Yuan gang (留元刚) from Baocheng Bingxu (宝庆丙戌), inviting Yuan ding to annotate the *Yao Jing* (药镜), along with Yuan ding’s own self-recorded account and preface, and a later preface by Wang Jiuman (王九万) from Baocheng Dinghai (宝庆丁亥). Yu Yan’s *Ruishang Futan* (席上腐谈) mentions that Yuan ding annotated the *Yinfu Jing*, the *Yao Jing*, and the *Wu Zhen* (悟真), with Zhen Xishan (真西山) providing a preface—all consistent with the other prefaces. However, the present text does not include his annotations on the *Yao Jing* or the *Wu Zhen*, nor does it retain the preface by De Xiu (德秀), likely lost in transmission. Moreover, De Xiu’s *Xishan Wenji* (西山文集) does not record the text, leaving its fate unexplained.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 590,
      "start_sentence": 0,
      "end_sentence": 26,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 9.08114218711853,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经讲义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "班孟坚志汉艺文，录兵书四种，以权谋言者十三家，以形势言者十一家，以阴阳言者十六家，以技巧言者亦十三家。 虽门分户析，各专其一，然血脉未尝不相为贯也。 孟坚之言曰：权谋者，以正守国，以奇用兵，兼形势，包阴阳，用技巧，者也。 然则四家实一家也。 虽然，孟坚以形势、阴阳、技巧总之以权谋，吾独以权谋、形势、技巧总之于阴阳，盖天地之间，一阴一阳而已矣。 权谋则有纵闭矣，形势则有离合矣，技巧则有翕张矣，而所以为之纵闭、离合、翕张者，阴阳之变化也。 故曰一阴一阳之谓道。 范蠡之谋吴也，精察于赢缩蚤晏之节，而推极于稻蟹之无种，然一鼓而俘之，既以此谋人之国。 亦以此自谋其家，所谓后人发先人。 至趋时若猛兽鸷鸟者，非阴阳之用乎？ 而权谋、形势、技巧固行乎其间矣。 古文善为兵者，未有不通乎阴阳者也。 风后之握奇，武侯之八阵，李卫公之孤虚乌占，特其着者尔。 抑又有进此者，张留侯亲屈圯下之膝，受书于老人，苏长公深排之，以为安知秦之世无隐君子者，吾亦以为秦之世安知无神仙者，子房盖偶有所遇耳。 《阴符经》黄帝所着，文词古奥奇涩，读者尚不能句，况敢下一注脚子乎？ 夏君宗禹自浙来闽，手一编示予，则所着讲义也。 夏君少从永嘉诸大老游，而窃独好观此书，然未尽解也。 他日之上饶，尝默祷曰：未登龙虎榜，先登龙虎山。 夜感异梦，后遇至人于祝融峰顶，若有所授者。 复取是书读之，章断句析，援笔立成，若有神物阴来相助。 此岂模拟料度如世之笺传义疏云尔哉？ 是必有油然自得而默契者矣。 虽然，兵与神仙，未易言也，言兵则流于诡谲变诈，言神仙则流于恍惚诞谩。 神仙岂自外求哉？ 清明在躬，志气如神，则神仙即兵。 通乎神仙则知兵，通乎兵则知神仙矣。 种明逸终身隐华山，而累世为名将，姚平仲京城小不利，或者以为遁去不死也。 特吾儒之所谓神仙者，固在此而不在彼耳。 读夏君之书者，又当以是观之。 宝庆二年秋八月中澣楼昉序。 卷一 经曰：观天之道，执天之行，尽矣。 天命之谓性，率性之谓道。 道也者非可仰求于冥漠之表也。 天道在吾身，我能尽其观之之妙，则目击道存，至道不繁矣。 要当执天之行，须臾不离于十二时中。 一语一默，一呼一吸，阴开阳辟，西没东升，风云发泄于七窍，坎离交会于元宫，天以是道而运行乎万化，我以是道而操履于一身。 寒暑同其往来，日月与之交合，干健以之不息，日用自然无穷。 不知我之为天，而天为之我也。 所谓我命在我不在天，其以是乎？ 谓之尽矣，不可以有加矣。 天有五贼，见之者昌。 五贼者，五行也。 人禀五行于天，有五贼于人，是岂天不化耶？ 非也。 行颠倒大道生焉，顺则成人，逆为丹用，如金木必欲交并，水火必欲既济，土旺四季而复以克水为功，是五行相贼。 道之玄奥，世人安得见此理乎？ 故见之者昌，亦诚则明，明则着。 虚室生白，充实而有光辉之妙也。 既曰观天之道，又曰见天之昌，圣人揭大道以示人，昧者当面蹉过。 惜哉。 五贼在心，施行于天。 五行五贼，其理幽微，心为天君，实能主宰。 此施行于天，皆在吾心之用，盖心即天也，天即心也，人能即一心之天，以窃造化之妙，即动静陟降，在帝左右，而施行之际，未知其孰为天，孰为心也。",
      "translated_text": "Ban Gu’s *Records of the Arts and Literature of the Han* catalogues military writings, listing four types of military texts: those emphasizing strategy (*quanmou*), those emphasizing terrain and formation (*xingshi*), those emphasizing *yin-yang* principles, and those emphasizing tactical techniques (*jiqiao*). Though he categorizes them separately—each school specializing in one aspect—nevertheless, their underlying currents are inseparably intertwined.\n\nBan Gu observed: *\"Strategy* is to defend the state with rectitude and to deploy armies with the unexpected, encompassing terrain and formation, embracing *yin-yang*, and applying tactical techniques.\"* Thus, the four schools are in truth one.\n\nYet Ban Gu subsumed *xingshi*, *yin-yang*, and *jiqiao* under *quanmou*, while I would rather unite *quanmou*, *xingshi*, and *jiqiao* under *yin-yang*—for between heaven and earth, there is only *yin* and *yang*.\n\nStrategy manifests as expansion and contraction; terrain and formation as separation and union; tactics as convergence and divergence—yet all these movements arise from the transformations of *yin-yang*. Hence it is said: *\"The interplay of *yin* and *yang* is the Dao.\"*\n\nFan Li’s schemes for Wu were refined in discerning the rhythms of contraction and expansion, early and late, extending even to the barrenness of rice and crabs—yet with a single strike, he captured the kingdom. He applied the same principles to his own family, embodying the saying: *\"Later generations build upon the foundations of their forebears.\"*\n\nThose who follow the times like fierce beasts or rapacious birds—are they not wielding *yin-yang*? Yet strategy, terrain, and tactics operate within this framework.\n\nAncient masters of warfare were never those who did not grasp *yin-yang*. The *Grasping of the Marvelous* by Feng Hu, the *Eight Arrays* of Wu Hou, and Li Wei Gong’s *Lone and Empty Crow Divination* are but its outward expressions.\n\nYet there are deeper layers still: Zhang Liang, kneeling at the bridge of Kuai, receiving teachings from an old man—Su Shi dismissed this as mere superstition, asking how one could know that the age of Qin lacked hidden sages. I too wonder how one could know that the age of Qin lacked immortals—Zhang Liang merely encountered a rare opportunity.\n\nThe *Yin-Shu Jing* (*Yin Symbol Classic*), attributed to the Yellow Emperor, is written in archaic and obscure language, so difficult that readers struggle to parse its sentences—let alone annotate it.\n\nMaster Xia Jun Zongyu, having come from Zhe to Min, showed me a single manuscript: his own commentary. Master Xia, in his youth, studied under the great scholars of Yongjia, yet uniquely devoted himself to this text, though he did not fully comprehend it.\n\nLater, while in Shangrao, he prayed in silence: *\"Before ascending the Dragon-Tiger Register, I shall first ascend Dragon-Tiger Mountain.\"* That night, he dreamed of an encounter with a transcendent figure atop the Zhufeng Peak, as if receiving instruction. Upon waking, he took up the book again, and with sudden clarity, parsed its chapters and sentences, writing annotations as if guided by an unseen force. Could this be mere imitation or conjecture, like the commentaries of the world?\n\nNo—this must be an intuitive resonance, a spontaneous understanding.\n\nYet warfare and immortality are not easily spoken of. To speak of warfare risks descending into deceit and guile; to speak of immortality risks falling into vagueness and fabrication. Immortality is not something sought externally—clarity and resolve are inherent within. When the will and *qi* are divine, then immortality and warfare become one. To master immortality is to understand warfare; to master warfare is to understand immortality.\n\nZhong Mingyi spent his life in seclusion on Hua Mountain, yet his descendants became renowned generals. Yao Pingzhong, though defeated in a minor skirmish in the capital, was suspected by some of fleeing to avoid death. Yet what my school terms *immortality* is not this—it lies elsewhere.\n\nThose who read Master Xia’s work must consider this perspective.\n\n**Preface by Jian Lou Peng, Autumn of the Second Year of Baocheng (宝庆二年秋八月中澣楼昉序)**\n\n**Volume One**\n\nThe Classic says: *\"Observe the Dao of Heaven, grasp the actions of Heaven, and it is complete.\"* The mandate of Heaven is called *xing* (性), and following *xing* is called the Dao.\n\nThe Dao is not something to be sought beyond the boundless void. Heaven’s Dao resides within us—if we exhaust its observable mysteries, then the Dao is manifest before our eyes, and the ultimate Dao is not convoluted.\n\nTo grasp Heaven’s actions, one must never stray from the twelve temporal cycles. Every word spoken, every silence held, every breath inhaled and exhaled—*yin* opens, *yang* cleaves; the sun sets in the west and rises in the east. Winds and clouds vent through the seven orifices, while *kan* and *li* converge in the primal palace. Heaven operates through this Dao to govern the ten thousand transformations, and I, too, embody this Dao in my conduct.\n\nCold and heat follow their cycles; the sun and moon align in their courses; the *gān* and *jian* trigrams move without cessation, and daily life unfolds endlessly.\n\nOne does not know whether I am Heaven or Heaven is I. *\"My fate lies within me, not in Heaven\"*—this is how it is.\n\nTo say it is complete is to say nothing more can be added.\n\nHeaven has five *zei* (贼, \"bandits\" or \"corrupting influences\"), and those who perceive them thrive. These five *zei* are the five phases (*wuxing*).\n\nHumans inherit the five phases from Heaven, yet within them lie five *zei* for humanity—is this not Heaven’s failure to transform? No. When the phases are inverted, the Dao of Great Perfection arises. In harmony, they perfect humanity; in reversal, they serve alchemical refinement—just as metal and wood must intermingle, water and fire must reach completion, and earth, though flourishing in all seasons, must also subdue water to fulfill its function. These are the five phases preying upon one another.\n\nThe profundity of the Dao—how can the world perceive this truth? Thus, those who see it prosper, for sincerity brings clarity, and clarity reveals it.\n\n*\"The empty chamber gives birth to whiteness\"*—this is the mystery of radiance in fullness.\n\nIt speaks of observing Heaven’s Dao and seeing Heaven’s prosperity—yet the ignorant pass by it blindly. Alas.\n\nThe five *zei* reside in the heart, manifesting in Heaven. The five phases and their *zei* are subtle in principle, yet the heart, as Heaven’s sovereign, truly governs them.\n\nThis manifestation in Heaven stems from the heart’s operations—indeed, the heart is Heaven, and Heaven is the heart. If one aligns with the singular Heaven within the heart, they can appropriate the marvels of creation, moving dynamically between ascent and descent, standing beside the Emperor, so that at the moment of action, one does not know which is Heaven and which is the heart.",
      "overlap_context": "Baocheng Dinghai (宝庆丁亥). Yu Yan’s *Ruishang Futan* (席上腐谈) mentions that Yuan ding annotated the *Yinfu Jing*, the *Yao Jing*, and the *Wu Zhen* (悟真), with Zhen Xishan (真西山) providing a preface—all consistent with the other prefaces. However, the present text does not include his annotations on the *Yao Jing* or the *Wu Zhen*, nor does it retain the preface by De Xiu (德秀), likely lost in transmission. Moreover, De Xiu’s *Xishan Wenji* (西山文集) does not record the text, leaving its fate unexplained.",
      "start_char": 591,
      "end_char": 1864,
      "start_sentence": 27,
      "end_sentence": 80,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 21.48354744911194,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经讲义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "宇宙在乎手， 手为三关之要，学道者当知所先矣。 《黄庭经》曰：口为心关，精神机； 足为命关，生地扉； 手为人关，把盛衰。 得非以手者，能按天象方隅，推五运六气，握固以养和，弹指以摄化，诊视以知阴阳之候，诀目以通鬼神之灵，无一而不在手也。 宇宙六合，广大无际，苟得玄妙，其犹示诸掌乎？ 《参同序》曰：运六十四卦之阴符，天关在掌是也。 万化生乎身。 人之一身，一天地也。 有阴阳升降有乌兔出没，有潮侯往来，有风雨明晦，有雷电轰闪，有云气吐吞，有山河流峙，有草木荣枯，动静语默，阖辟变化，无一不与天相似，信乎万化所由生也。 然有道者万化生，无道者万化息，生者与天为徒，而息者与鬼为邻也。 可不自爱乎？ 天性，人也。 人心，机也。 立天之道，以定人也。 天人一心，机道同辙。 自六欲七情，有以夺其性真，则业识火炽，不知其孰为天，孰为人，又孰为机，孰为道也。 上圣洪慈，阐明奥旨，谓性即天也，天即人也至理浑融，不可致诘，必得其机而应之，则自然吻合是机也。 岂世俗机巧变诈之为乎？ 非也。 乃机缄之运，不疾而速，机关之应，若合符节耳。 人能明此之机，心同造化，自然机应不失，则天道立矣，人道定矣。 固非曰舍人道而别立天道，亦非曰先立天道而后定人道也。 盖人道即天道，天道即天机，天机即天性，所谓存其心，养其性，所以事天也。 天发杀机，龙蛇起陆。 地发杀机，星辰陨伏。 人发杀机，天地反复。 天人合发，万化定基。 三才异位，生杀同机。 然杀者乃所以生之，而生者乃所以杀之也。 且阴疑于阳必战，其血玄黄，是杀机之所寓也。 况三阳交泰，万汇咸亨，天发杀机，下除阴邪之炁，则雷轰电扫，天威赫然，龙蛇垫藏，不容不起，陆于阳盛之时； 地发杀机，上承场刚之运，则涌泉起浪，黄河逆流，北斗杓躔，不容不旋，伏于阴阳交胜之际。 人识此机，则潜夺造化，旋乾转坤，翻天覆地，使地天交而为泰，生杀定而为功。 太白真人歌曰：五行颠倒术，龙从火里出。 五行不顺行，虎向水中生。 反复之机也。 虽然，天地与人列为三才，生杀与机同于一气。 孟子曰：我善养吾浩然之气，充塞乎天地之间，亦岂舍吾身之外而别有天地可充塞乎？ 故知一气之运，非以在天者有余，而在人者不足，天人合发，不差毫厘，机缄默应，变化万端，丹基一定，大道滋生矣。 性有巧拙，可以伏藏。 形色，天性也，而技巧出焉。 伏藏，待时也，而天机寓焉。 有是性则有是机，非曰终于伏藏而无所用心也。 所谓怀材养浩明时，正金丹之秘旨也。 或谓阴铅主伏，阳汞主飞，圣人伏阳汞以炼阴魄，故有大巧若拙之用，非也。 殊不知黄帝专言巧拙者在性，伏藏者待时，盖以性则合于玄元，而铅汞则拘于形质。 苟此性灵明，阳魂日盛，巧拙莫蔽，伏藏待时，天机一应，则天性见矣。 此正洞宾谓七返还丹，在人先须炼己待时也。 知待时之说，则知伏藏巧拙之性矣。 九窍之邪，在乎三要，可以动静。 人身九窍，上七下二，无非邪秽。 学道者审此，必摄乎三要，然后动静有无邪之思。 三要者何？ 耳目口是也。 《参同契》云：三宝固塞，勿发扬。 三者既关键，动静不竭，穷人能谨此三要，则天下之声万变而坎之，聪不为所夺；",
      "translated_text": "The universe lies within the hand—\nthe hand is the pivot of the Three Passes.\nThose who study the Dao must know where to begin.\n\nThe *Huangting Jing* says:\n*\"The mouth is the heart’s Pass, where spirit and mind converge;\nthe foot is the life’s Pass, the gate of the natal earth;\nthe hand is the human’s Pass, grasping the rise and fall of fortune.\"*\n\nWhat is gained is not through the hand alone,\nyet one can press the Heavenly symbols and the four directions,\npropel the Five Phases and Six Qi,\ngrasp the firm to nourish harmony,\nflick the fingers to seize transformation,\ndiagnose with a glance to know the signs of Yin and Yang,\nand with a decisive gaze to commune with the spirits of ghosts and gods—\nall are within the hand.\n\nThe universe and the Six Directions are vast without bounds—\nif one attains the profound mystery,\nit is as though revealed upon the palm.\nThe *Shentong Xu* says:\n*\"The Yin Symbol of the Sixty-Four Hexagrams is in the palm—this is the Heavenly Pass.\"*\n\nAll transformations arise from the body.\nA single human body is a microcosm of Heaven and Earth.\nThere are the ascents and descents of Yin and Yang,\nthe comings and goings of the tortoise and hare,\nthe tides of fortune and the passing of seasons,\nthe winds and rains, the clarity and the murk,\nthe thunderous crashes and lightning flashes,\nthe exhalations and inhalations of clouds,\nthe rivers and mountains in their flowing stillness,\nthe flourishing and withering of grasses and trees—\nin motion and stillness, speech and silence,\nopening and closing, all changes without exception mirror Heaven.\nTruly, all transformations spring from here.\n\nYet those who have the Dao nurture transformations,\nwhile those without it see them fade.\nThe living align with Heaven as their master,\nwhile the dead dwell beside ghosts as neighbors.\n\nHow could one not cherish themselves?\n\nHeaven’s nature is humanity.\nHumanity’s heart is the mechanism.\nEstablishing Heaven’s Dao secures humanity’s fate.\nHeaven and humanity share one heart,\nmechanism and Dao move on the same path.\n\nFrom the Six Desires and Seven Emotions,\nsome may steal humanity’s true nature—\nthen the fires of karma and cognition blaze,\nand one no longer knows which is Heaven,\nwhich is humanity,\nwhich is the mechanism,\nand which is the Dao.\n\nThe Sage of boundless compassion elucidates the profound truth:\n*\"Nature is Heaven, Heaven is humanity*—\nthis ultimate principle is seamless and unassailable.\nIf one seizes the mechanism and responds to it,\nharmony naturally arises—this is the true mechanism.\nNot the worldly artifice of cleverness and deceit!\n\nIt is the mechanism’s silent operation,\nswift yet unhurried,\nits responses as precise as matching seals.\nIf one clarifies this mechanism,\ntheir heart aligns with creation—\nthe mechanism’s responses will never falter,\nand thus Heaven’s Dao stands firm,\nhumanity’s fate is secured.\n\nIt is not a matter of abandoning humanity’s Dao to establish Heaven’s Dao,\nnor of first establishing Heaven’s Dao and then securing humanity’s fate.\nFor humanity’s Dao is Heaven’s Dao,\nHeaven’s Dao is the Heavenly mechanism,\nthe Heavenly mechanism is Heaven’s nature—\nthis is why one must preserve the heart,\nnurture the nature,\nand thereby serve Heaven.\n\nWhen Heaven unleashes its killing mechanism,\ndragons and serpents rise upon the land.\nWhen Earth unleashes its killing mechanism,\nstars and constellations fall and are subdued.\nWhen humanity unleashes its killing mechanism,\nHeaven and Earth are overturned.\nWhen Heaven and humanity together unleash their mechanisms,\nall transformations find their foundation.\nThe Three Powers differ in position,\nyet share the same mechanism for life and death.\n\nYet killing is the means to generate,\nand generating is the means to kill.\nMoreover, when Yin doubts Yang, conflict ensues—\nits blood turns dark and yellow,\na vessel for the killing mechanism.\nWhat of the Three Yang in harmonious union,\nwhere all things flourish?\nWhen Heaven unleashes its killing mechanism,\nit dispels the malevolent *qi* of Yin below—\nthen thunder crashes and lightning sweeps,\nHeaven’s might is terrible,\ndragons and serpents retreat in hiding,\nunable to avoid it,\nrising only when Yang is at its peak;\nwhen Earth unleashes its killing mechanism,\nit receives the harsh force of the field—\nthen the Yellow Springs surge with waves,\nthe Yellow River flows backward,\nthe Big Dipper’s ladle shifts its position,\nunable to avoid rotation,\nsubdued only when Yin and Yang are in balanced victory.\n\nIf humanity recognizes this mechanism,\nthey can secretly seize creation’s marvels,\nturn the heavens and invert the earth,\nmake Earth and Heaven exchange to achieve harmony,\nand life and death settle to fulfill their function.\n\nThe True Person of the Great White sings:\n*\"The Five Phases in reverse—\ndragons emerge from fire.\nIf the Five Phases do not proceed in order,\ntigers rise from water.\nThis is the mechanism of reversal.\"*\n\nThough Heaven, Earth, and humanity are ranked as the Three Powers,\nlife and death share the same mechanism as *qi*.\nMencius says:\n*\"I excel in nurturing my vast and boundless *qi*,\nfilling the space between Heaven and Earth—\ncould I abandon my own body and seek another Heaven and Earth to fill?\"*\n\nThus, the movement of *qi* is not that Heaven has excess\nwhile humanity lacks—\nwhen Heaven and humanity act together,\nnot a hair’s breadth differs.\nThe mechanism operates silently yet responds perfectly,\nits transformations endless.\nThe foundation of the elixir is fixed,\nand the Great Dao flourishes.\n\nNature has cleverness and clumsiness,\nwhich can be concealed.\nForm and appearance are Heaven’s nature,\nyet skill arises from them.\nConcealment is waiting for the right moment,\nyet the Heavenly mechanism lies within.\nIf there is such a nature, then there is such a mechanism—\nnot that one ends in concealment without further care.\n\nThis is why one must cherish their innate talents\nand nurture their vast clarity in the proper time—\nthe true essence of the elixir’s secret.\n\nSome say Yin lead governs concealment,\nYang mercury governs ascent,\nand the Sage conceals Yang mercury to refine Yin lead—\nthus the use of great cleverness as clumsiness.\nNo—\n\nThey fail to understand that the Yellow Emperor speaks specifically of cleverness and clumsiness as inherent in nature,\nwhile concealment is waiting for the right moment.\nFor nature, if aligned with the Primordial Mystery,\nwhile lead and mercury are bound to form and substance.\nIf this nature is luminous and the Yang spirit thrives,\ncleverness and clumsiness cannot obscure it,\nconcealment awaits its time—\nwhen the Heavenly mechanism responds,\nHeaven’s nature is revealed.\n\nThis aligns with the Master of the Caverns’ teaching:\n*\"Sevenfold return to the elixir—\nbefore this, one must first refine oneself and wait for the time.\"*\n\nUnderstanding the principle of waiting for the time\nis to understand the nature of concealment and cleverness.\nThe Nine Orifices’ evils lie in the Three Essentials,\nwhich can be controlled through motion and stillness.\n\nThe human body has nine orifices—\nseven above, two below—\nnone without impurity.\nThose who study the Dao must examine these closely,\nseizing the Three Essentials,\nbefore motion and stillness can be free of evil thoughts.\n\nWhat are the Three Essentials?\nThey are the ears, eyes, and mouth.\nThe *Shentong Qi* states:\n*\"The Three Treasures must be firmly sealed,\nnever to be recklessly displayed.\"*",
      "overlap_context": "e five phases and their *zei* are subtle in principle, yet the heart, as Heaven’s sovereign, truly governs them.\n\nThis manifestation in Heaven stems from the heart’s operations—indeed, the heart is Heaven, and Heaven is the heart. If one aligns with the singular Heaven within the heart, they can appropriate the marvels of creation, moving dynamically between ascent and descent, standing beside the Emperor, so that at the moment of action, one does not know which is Heaven and which is the heart.",
      "start_char": 1866,
      "end_char": 3139,
      "start_sentence": 81,
      "end_sentence": 138,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 19.58304786682129,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经讲义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "天下之色万变而离之，明不为所蔽； 天下之味万变而兑之，纳不为所乱； 自然清明在躬，志气如神，动静之间，一循天理之正，虽万邪不能干矣。 九窍之邪，何有于我哉？ 此正非礼勿视，非礼勿听，非礼勿言之道，岂异端乎？ 火生于木，祸发必克。 奸生于国，时动必溃。 知之修炼，谓之圣人。 木能生火，终于自焚。 国若生奸，终于召乱。 此势所必致之患。 学道者知之使火生于木而木不焚，奸生于国而国不乱，譬犹饮食男女，人之大欲存焉，固不可以其奸邪而屏绝之也。 苟纵是欲，则何所不为？ 惟以道而制之，则火木相生，不为祸而为福，奸邪虽动，不为邪而为正。 岂非圣人修炼之道乎？ 所谓居尘不染，出死入生者也。 然木火相生于五行为最盛，人身五行视木火为盛衰，如真元不亏，则木火炽然。 潜应天机，常人纵之以伤生，是轻命恣奸也。 圣人炼之以成道，是返归正也。 苟真元衰败，则木火灭矣，天道缺矣，人道远而鬼道近矣。 哀哉。 卷二 经曰：天生天杀，道之理也。 气应黄锺，万物萌动，此天生也； 律中夷则，则万物挚敛，天之杀也。 然天既生之而复杀之，何也？ 盖有生杀之理存乎其间，何以知生人能充是道于吾身？ 密参造化，则春生秋杀，阴阳代谢，不在一年之运而十二时中，自可以夺天之妙用，而得道之妙理矣。 天地，万物之盗； 万物，人之盗； 人，万物之盗。 三盗既宜，三才既安。 天道好生，地道好长。 人为万物之灵，万物为人之用，乌可以为盗耶？ 得非天地不仁，以万物为刍狗，是天地盗万物而不使之长荣矣。 五色令人目盲，五音令人耳聋，五味令人口爽，是万物盗于人而不使之永茂矣。 斧斤之入山林，数罟之入污池，五谷六蓄烹饪食啖，是人为万物之盗而不使之长生矣。 虽然，三盗之暗相销铄，潜互斲丧，不知不觉，而荣枯生死，莫可致诘。 在天地万物不足以为害，而在人者深所以为害也。 何以明之？ 天地贼万物而覆载者常存，万物贼于人而生成者不绝，至于人贼万物，本资以养生也，而反不能长生，乃为万物所盗，哀哉。 世人能深明此理乎？ 苟能明之，自然知所修为守护三宝，爱养灵珠，存三守一，精气神全，赫赤金丹，辉光充实，天地万物何能为盗于我哉？ 惟其昧于此也，乃以人生天地间，必资于万物； 万物利于人，必资于天地，其理固宜也。 惟其以为宜也，则必安之而不以为异也。 圣人忧之，故曰三盗既宜，岂其宜耶？ 是悲其互相戕贼而无有终穷也。 三才既安，岂其安耶？ 是怜其鼎分列位而安于相贼也。 深所以悯世人之不明乎道，不能超脱乎造化之表，而出死入生，弃枯就荣，与天地万物相为终始者也。 吁，此黄帝所以成金丹而登天，后贤亦拔宅而上升者相踵也。 三盗何加损于有道哉？ 故曰； 食其时，百骸理。 人之有生，四大假合，肢节百骸，精神血气，非食啖不能充养。 苟失其时，非徒无益，而反害之。 况金丹大道，其采亦有时，取亦有日，其甘如饴，其大如橘，食之登仙，金筋玉骨，此其血化为膏，膏化为气，气化为神，飞升金阙，奚止百骸理而已乎？ 动其机，万化安。 天地造化，深不可测；",
      "translated_text": "The myriad colors of the world, ever-changing yet transcended by clarity,\nshall not dim the mind’s brightness;\nthe myriad flavors of the world, ever-changing yet mastered by *Fuì*,\nshall not unsettle the heart’s reception.\nWhen one’s nature is naturally pure and luminous within,\none’s resolve and *qi* become as divine as the Dao.\nBetween motion and stillness,\none follows the true principle of Heaven—\nthough myriad evils cannot intrude.\n\nWhat harm can the Nine Orifices’ evils bring to me?\nThis is the true *Dao* of **\"See not what is unseemly, hear not what is unseemly, speak not what is unseemly\"**—\nhow could it be otherwise?\n\nFire arises from wood,\nand disaster must be overcome.\nDeceit arises within states,\nand unrest shall surely erupt when the time is right.\nTo know this and practice refinement—\nthat is called the Sage.\n\nWood can give rise to fire,\nyet it ends in self-consumption.\nA state can breed deceit,\nyet it ends in summoning chaos.\nThis is the inevitable suffering of such forces.\n\nThose who study the Dao must know:\nto let fire arise from wood yet prevent wood from burning,\nto let deceit arise within states yet prevent chaos—\njust as with food and sex,\nthe great desires of humanity persist,\nyet one must not recklessly suppress them.\n\nIf one indulges these desires,\nwhat will they not do?\nOnly by the Dao can they be governed—\nthen fire and wood nurture each other,\nnot as disaster but as blessing;\ndeceit and evil may stir,\nyet they become not evil but righteous.\nIs this not the Sage’s refined Dao?\n\nThis is what is meant by **\"dwelling in dust yet unsoiled, emerging from death into life.\"**\n\nYet fire and wood, in the Five Phases, are most potent,\nand in the human body, wood and fire are the rise and fall.\nIf the true essence is not diminished,\nthen wood and fire burn fiercely.\nTo subtly respond to Heaven’s mechanisms,\nthe common man recklessly harms himself—\nthis is to slight life and indulge deceit.\n\nThe Sage refines them to attain the Dao—\nthis is to return to the true Way.\nIf the true essence decays,\nthen fire and wood are extinguished,\nHeaven’s Way is broken,\nhumanity drifts far while the *guǐdào* (鬼道, way of demons) draws near.\nAlas!\n\nThe *Sutra* says:\n*\"Heaven generates, Heaven kills—\nthis is the Dao’s principle.\nWhen the *qi* resonates with the Yellow Bell (黃鍾),*\nall things sprout and move—\nthis is Heaven’s generation;\nwhen the *Lǜ* (律) aligns with the *Yízhé* (夷則),*\nall things wither and retreat—\nthis is Heaven’s killing.\"*\n\nYet why does Heaven both generate and kill?\nFor there is a principle of generation and killing between them.\nHow does one know to generate life?\nIf one can embody this Dao within oneself—\nto closely observe the workings of creation,\nthen spring’s birth and autumn’s death,\nthe exchange of yin and yang,\nnot confined to the year’s cycle but within the twelve hours,\none can seize Heaven’s marvelous function\nand attain the Dao’s profound principle.\n\nHeaven and Earth are thieves of all things;\nall things are thieves of humanity;\nhumanity is the thief of all things.\nIf the three thefts are in harmony,\nthe Three Talents (三才) are at peace.\nHeaven’s Way favors generation,\nEarth’s Way favors growth.\nHumanity is the spirit of all things,\nall things serve humanity’s use—\nhow can they be called thieves?\nIf Heaven and Earth are not benevolent,\ntreating all things as mere fodder,\nthen Heaven and Earth steal from all things,\npreventing their flourishing.\n\nThe Five Colors blind the eyes,\nthe Five Tones deaf the ears,\nthe Five Flavors dull the mouth—\nthis is how all things steal from humanity,\npreventing its eternal prosperity.\n\nThe axe and adze enter forests,\nfine nets descend into filthy pools,\nthe five grains and six livestock are cooked and devoured—\nthis is how humanity steals from all things,\npreventing their longevity.\n\nYet though the three thefts secretly erode each other,\nunaware yet inexorable,\nlife and death, flourishing and decay—\nnone can escape this fate.\n\nThe harm is not in Heaven, Earth, and all things,\nbut in humanity’s profound ignorance of it.\nHow does one know this?\nHeaven and Earth steal from all things yet sustain them,\nall things steal from humanity yet persist in their creation,\nand humanity, stealing from all things,\nrelies on them for sustenance—\nyet cannot ensure its own longevity,\nthus becoming the victim of all things.\nAlas!\n\nCan the people of the world deeply grasp this truth?\nIf they can, they will naturally know\nthat their refinement must be to guard the Three Treasures,\nnurture the *língzhū* (灵珠, spiritual pearl),\npreserve three and guard one,\nkeeping *jīng* (精, essence), *qì* (气, *qi*), and *shén* (神, spirit) whole—\nthen the *hèchì jīndān* (赫赤金丹, radiant cinnabar elixir)\nshines with abundant light,\nand how can Heaven, Earth, or all things steal from me?\n\nYet they fail to understand this,\nassuming that to live between Heaven and Earth,\none must rely on all things;\nthat all things benefit humanity,\none must rely on Heaven and Earth—\nthis is indeed natural.\nYet because they see it as natural,\nthey accept it without question.\nThe Sage laments this,\nsaying: *\"The three thefts are in harmony—\nhow can they be in harmony?\nThis is sorrow for their mutual destruction without end.*\n*The Three Talents are at peace—\nhow can they be at peace?\nThis is pity for their division yet contentment in theft.\"*\n\nDeeply mournful for the world’s ignorance of the Dao,\nunable to transcend the surface of creation,\nemerging from death into life,\nabandoning decay for flourishing,\nand aligning with Heaven, Earth, and all things in their eternal cycles.\n\nAh! This is why the Yellow Emperor attained the *jīndān* (金丹) and ascended to Heaven,\nand later worthies also ascended, following in his steps.\nWhat harm do the three thefts bring to those who follow the Dao?\n\nThus it is said:\n*\"To eat in season,\nthe hundred bones (百骸) are nourished.\nHuman life relies on the Four Great Elements (四大) for form,\nand limbs, bones, spirit, *qi*, and blood—\nwithout food, how can they be sustained?\nIf one misses the season,\nnot only is there no benefit,\nbut harm shall follow.\nHow much more so with the Great Dao of the *jīndān* (金丹),\nwhose gathering and taking have their proper times—\nits sweetness like honey,\nits size like an orange,\neating it grants immortality,\ngolden sinews and jade bones—\nthis is how the blood transforms into marrow,\nmarrow into *qi*,\n*qi* into spirit,\nascending to the golden gates (金阙).\nHow much more than simply nourishing the hundred bones?\"*\n\nTo stir its mechanism (动其机),\nall transformations are at peace.\nHeaven and Earth’s creation is profound and unfathomable;",
      "overlap_context": "Nine Orifices’ evils lie in the Three Essentials,\nwhich can be controlled through motion and stillness.\n\nThe human body has nine orifices—\nseven above, two below—\nnone without impurity.\nThose who study the Dao must examine these closely,\nseizing the Three Essentials,\nbefore motion and stillness can be free of evil thoughts.\n\nWhat are the Three Essentials?\nThey are the ears, eyes, and mouth.\nThe *Shentong Qi* states:\n*\"The Three Treasures must be firmly sealed,\nnever to be recklessly displayed.\"*",
      "start_char": 3139,
      "end_char": 4357,
      "start_sentence": 139,
      "end_sentence": 198,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 18.89865016937256,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经讲义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "机缄默运，人身同之。 苟得其机，则动罔不吉，万化虽众，安而不危。 傥失其机，则危殆必矣。 何安之有？ 人知其神而神，不知而所以神。 神之为用大矣哉。 然有隐有显，有藏有露，圣凡自此分也。 世人但知施设注措，言语文章不求而得，不思而中，以为我之神也，殊不知业识忙忙，应酬万变，逐物忘返，无须臾宁。 吁，焰烈者膏竭，芬郁者本枯，自速其尽而已，何者？ 以其显露甚也。 惟圣人内观反听，塞兑含流，隐藏于中，鬼神莫测。 故恍恍惚惚，若无知也，而其中有物焉； 杳杳冥冥，若不神也，而其中有精焉。 此不神其神，乃所以为至神。 非有道者，其孰能与于此？ 日月有数，大小有定。 圣功生焉，神明出焉。 日为太阳，月为太阴，太阳火魂，太阴水魄。 水火二象昭着，阴阳何有数耶？ 盖天有三百六十五度四分，度之一日，昼夜行一度，月昼夜行十二度有奇。 日行迟，故一岁一周天； 月行速，故一月一周天。 迟速相荡，阴阳相须，故有大尽小尽，其数一定而不易。 人之一身，亦有日月，亦有度数，其周天之运不在一年。 盖蹙年成月，蹙月成日，于十二时中，自然阴阳升降，魂魄相生，吾有圣功之用，必使之乌兔交合，龙虎交媾，鼓之以雷霆，润之以风雨，虚室生白，入于无何有之乡，混合回风，得于片饷工夫之际，谓之神明出者，不知其因神而明者，因明而神也。 无中有乃玄中之玄，有中无乃妙中之妙； 变化万端渊不可测，昭彻万象洞无所蔽，是谓神明，不可思议也。 虽然，与天地合德，日月合明者，即此道也。 今人但能诵之于口，而曾不践履于身，反以神仙为怪诞，哀哉。 其行尸行厕，自谓富贵快乐，不知梦幻泡影，深可悲伤之也。 其盗机也，天下莫能见，莫能知。 君子得之固穷，小人得之轻命。 盗机之喻妙矣哉。 盗者何？ 不可测知也。 机者何？ 不可御遏也。 夜半负之而去，此盗也，人孰知之？ 若虞机张，此机也，人孰遏之？ 然此盗此机，能通三才，造化得阴阳阖辟，一气流行，机缄自应，百姓日用而不知。 惟学道者得之以固穷，非曰特守贫穷也，凡其浮云富贵，不事肥甘，乐清虚，从淡泊，即固穷之义也。 小人得之轻命，非曰事刀兵也，凡其御房探战，嗜酣声乐，饮酒食，逞财气，即轻命之谓也。 虽然，固穷轻命既有君子小人之分，而盗机之发，亦何私于有无也？ 特君子明此机而用之以固穷，小人昧此机而用之以轻命耳。 此理幽玄，非盟誓不传，故曰天下莫能见，莫能知。 瞽者善听，聋者善视。 绝利一源，用师十倍； 三返昼夜，用师万倍。 瞽者无明，聋者不聪，聪明既黜，视听何善之有？ 非此之谓也，人以耳目为生，反以耳目为累，声色乱于前，视听动于中，知何者为主也？ 惟瞽者目所不睹，则心专于听，而粉白黛绿者不能杂也； 聋者耳所不闻，则心专于视，而泾娃鼓吹者不能夺也。 此用志不分，乃凝于神之妙也。 绝利一源，则心无二用，专气致柔而已。 三反昼夜者，乃三宫升降上下，往来无穷也； 用师十倍万倍者，乃精神折冲，使邪魔外道非心恶念有不战而屈之理也。 夫以弃绝于利欲精一于本源，万累消忘，无思无虑，精诚纯笃，一念不差，此寂然不动之境也。",
      "translated_text": "The mechanism operates in silent motion—\nthe human body shares this principle.\n\nIf one seizes the mechanism,\nthen all movement brings good fortune,\nthough myriad transformations arise,\nthey remain stable and free from peril.\nShould one lose the mechanism,\nthen danger and peril are inevitable.\nWhere is there safety?\n\nPeople know their spirit as spirit,\nbut do not know what makes it so.\nGreat indeed is the function of spirit!\n\nYet it has hidden and revealed aspects,\nconcealed and exposed—\nthis is where the sage and the common differ.\n\nThe world knows only to arrange and manipulate,\nto speak and write without thought or effort,\nyet they take it as their own spirit.\nLittle do they know—\ntheir karma and perceptions are in constant flux,\nresponding to myriad changes,\nchasing after things and losing themselves,\nnever a moment’s peace.\n\nAlas! The blazing shall exhaust its oil,\nthe fragrant shall wither at its root—\nthey hasten their own depletion.\nWhy? Because their brilliance is too exposed.\n\nOnly the sage turns inward, seals the senses,\ncontains the flow, concealing all within.\nGhosts and spirits cannot fathom them.\n\nThus, vague and indistinct,\nas if without knowledge—\nyet within, there is substance.\nDim and murky,\nas if without spirit—\nyet within, there is essence.\n\nThis is not to deny the spirit,\nbut to attain the utmost spirit.\n\nWho but those of the Way can comprehend this?\n\nThe sun and moon follow their courses,\ngreat and small, their measures fixed.\nFrom this, the sage’s work arises,\nand the manifestation of spirit.\n\nThe sun is the Greater Yang—fire and soul,\nthe moon is the Lesser Yin—water and shadow.\nThe two symbols are manifest;\nhow could Yin and Yang lack their numbers?\n\nHeaven has three hundred sixty-five degrees and a quarter,\neach degree traversed in one day by day and night.\nThe moon moves twelve degrees and more in a day and night.\nThe sun moves slowly, completing a celestial circuit in a year;\nthe moon moves swiftly, completing it in a month.\nSlow and swift interact,\nYin and Yang depend on each other—\nthus there are great and small consummations,\ntheir numbers fixed and unchanging.\n\nWithin a human body,\nthere are also sun and moon,\ndegrees and measures—\nyet their celestial circuit is not yearly.\nCompressing years into months,\nmonths into days,\nwithin the twelve hours,\nYin and Yang naturally rise and fall,\nsoul and shadow generate in turn.\nTo harness the sage’s work,\none must make the tortoise and hare unite,\nthe dragon and tiger mate—\nstirred by thunder and rain,\nmoistened by wind,\nthe empty chamber births the white,\nentering the realm of *wuheyou* (無何有),\nmixing with the returning wind,\nachieved in the briefest moment—\nthis is called the emergence of spirit.\nYet they do not know:\nit is because of spirit that there is clarity,\nbecause of clarity that there is spirit.\n\nThe void within the having is the deepest mystery,\nthe having within the void is the subtlest wonder.\nEndless transformations, unfathomable depths—\nilluminating all phenomena, unobstructed clarity—\nthis is called spirit, beyond conception.\n\nYet to align with Heaven and Earth in virtue,\nto unite with the sun and moon in luminosity—\nthis is the Way.\n\nNow, people merely recite it with their mouths,\nyet do not practice it in their bodies.\nThey dismiss immortals as absurd—\nalas, what sorrow!\nTheir living corpses, their hollow pursuits—\nthey call it wealth and joy,\nyet know not the emptiness of dreams and shadows,\ndeeply pitiful indeed.\n\nAs for those who steal the mechanism,\nnone in the world can see or know.\nThe virtuous, obtaining it, endure hardship;\nthe petty, obtaining it, court death.\n\nThe parable of stealing the mechanism is profound.\nWhat is a thief? The unseen.\nWhat is the mechanism? The uncontrollable.\n\nTo carry it away in the dead of night—\nthis is theft.\nWho knows of it?\n\nIf the snare is set, this is the mechanism.\nWho can restrain it?\n\nYet this thief, this mechanism—\nthey harmonize the Three Realms,\nobtain creation’s opening and closing,\nand the uninterrupted flow of *qi*.\nThe mechanism seals itself in response;\nthe common folk use it daily without knowing.\n\nOnly those who study the Dao grasp it to endure hardship—\nnot that they cling to poverty,\nbut in their floating clouds of wealth and indulgence,\nthey avoid excess,\ndelight in emptiness,\nfollow simplicity—\nthis is the meaning of enduring hardship.\n\nThe petty, obtaining it, court death—\nnot that they seek blades and war,\nbut in their lust for women and battle,\ntheir drunkenness and music,\ntheir gluttony and greed—\nthis is what is meant by courting death.\n\nThough enduring hardship and courting death\ndistinguish the virtuous from the petty,\nthe activation of the mechanism\nhas no partiality toward gain or loss.\nIt is only that the virtuous understand the mechanism\nand use it to endure hardship,\nwhile the petty are ignorant of it\nand use it to court death.\n\nThis principle is profound and mysterious—\nit cannot be transmitted by oath alone,\nthus it is said: none in the world can see or know.\n\nThe blind excel in hearing,\nthe deaf excel in sight.\nCutting off one source of sense,\none’s teacher’s efficacy is tenfold;\nthree cycles of day and night,\nand it becomes ten thousandfold.\n\nThe blind lack sight,\nthe deaf lack hearing—\nif clarity and wisdom are abandoned,\nhow can vision and hearing be refined?\n\nIt is not this.\nPeople rely on ears and eyes for life,\nyet these same ears and eyes become burdens.\nSounds and colors assail the senses,\nvision and hearing are stirred within—\nwho knows what is master?\n\nOnly the blind, where the eyes cannot see,\nfocus the mind on hearing,\nand powdered faces and painted lips cannot intrude.\nOnly the deaf, where the ears cannot hear,\nfocus the mind on sight,\nand flute and drum cannot distract.\n\nThis is the marvel of undivided intent,\nconcentrated into spirit.\n\nTo cut off one source of sense\nis to have the mind in single use,\nsoftening the *qi* through concentration alone.\n\nThree cycles of day and night—\nthis is the rise and fall of the Three Palaces,\nendless coming and going;\ntenfold, thousandfold efficacy—\nthis is the spirit’s clash,\nmaking demons and external doctrines,\nevil thoughts and malicious intentions,\nsurrender without battle.\n\nTo abandon all desires and focus on the source,\ndissolving all burdens and distractions,\nwithout thought or deliberation,\npure and sincere in essence,\nno deviation in mind—\nthis is the realm of stillness and motionless repose.",
      "overlap_context": "ith the Great Dao of the *jīndān* (金丹),\nwhose gathering and taking have their proper times—\nits sweetness like honey,\nits size like an orange,\neating it grants immortality,\ngolden sinews and jade bones—\nthis is how the blood transforms into marrow,\nmarrow into *qi*,\n*qi* into spirit,\nascending to the golden gates (金阙).\nHow much more than simply nourishing the hundred bones?\"*\n\nTo stir its mechanism (动其机),\nall transformations are at peace.\nHeaven and Earth’s creation is profound and unfathomable;",
      "start_char": 4357,
      "end_char": 5589,
      "start_sentence": 199,
      "end_sentence": 255,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 18.155615091323853,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经讲义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "而昼夜之间，三宫反复，阴阳升降，符节不爽，循环无穷，此感而遂通之妙也。 吁，此道非见之践履，验之日用，则曷与言哉？ 虽然，十倍万倍，其效犹有浅深，何也？ 盖黜聪明，堕肢体，槁木其形，死灰其心，虽可以定静而入道，而弊有释氏空寂之偏，不能运化，终为阴灵苦爽鬼而已，其效故止十倍也。 若夫绝利一源而复能三返昼夜，自然守真抱一，升降三宫，昼夜循环，靡有暂息，天人胥契机，应若神，不可拟议，此与天地合德，日月合明，其效实无敌也，非用师万倍而何？ 昔鲁侯问耳视目听之道于亢仓子，对曰：传之者妄矣，我能视听不用耳目，不能易耳目之用。 必使体合于心，心合于气，气合于神，神合于无，其有介然之有，唯然之音，虽远在八荒之外，近在目睫之间，皆莫能逃吾视听矣。 世人傥知亢仓子之视听，则知黄帝聋瞽之视听也。 玄妙哉。 心生于物，死于物，机在目。 心目相关，生死相因，物机相应，曾无间断也。 人生为万物之灵，日与万物交际。 一念之起，随念生于物； 一念之灭，随念死于物。 然心非自生于物也，其机在目耳； 心非自死于物也，其机亦在目耳。 使当时黑白不分，妍丑不别，则心同太虚，何由能生死也？ 惟机关在目，触之而动。 一睹美色，则倏然生爱； 一见恶，则悠然增恶。 故爱之而欲心生，是此心生于物也； 恶之而欲心死，是此心死于物也。 原其所自，岂是心之本然哉？ 皆其机之在目也。 故上圣有内观之经，仙家有帘目之法，儒之非礼勿视，释之清净眼根，其旨深，其则不远矣。 虽然，瞽者亦有嗜欲，岂机专在目耶？ 故曰心目相关。 卷三 经曰：天之无恩而大恩生。",
      "translated_text": "「Thus, within the span of day and night,\nthe Three Palaces rise and fall in endless cycle,\nas Yin and Yang ascend and descend without fail,\ntheir rhythm unbroken, revolving without end—\nthis is the wondrous work of response and attunement.\n\nAh! If this Dao is not seen in practice,\nnor tested in daily life,\nthen what use is there in speaking of it?\n\nYet even so, tenfold or thousandfold efficacy\nstill varies in depth—why is this?\n\nIt is because those who abandon wisdom and intelligence,\ndiscard their limbs and senses,\nwither like dried wood in form,\nand grow cold like dead ashes in heart,\nthough they may attain stillness and enter the Dao,\nsuffer the flaw of the *Buddha’s* (释) empty and void (空寂) extremism,\nlacking the power of transformation (运化),\nand ultimately become mere shades of darkness (阴灵), tormented by lingering desires (苦爽鬼) alone.\nThus, their efficacy remains only tenfold.\n\nBut if one cuts off all sensory desires (利一源)\nand yet can still endure the threefold cycle of day and night,\nnaturally preserving the True and embracing the One (守真抱一),\nascending and descending through the Three Palaces (升降三宫),\nrevolving through day and night without pause,\nthen all beings—human and celestial—are attuned in harmony,\nresponding as if by divine instinct (应若神),\nbeyond all comparison or reckoning.\nThis is the Dao of merging with Heaven and Earth’s virtue (合德),\nand uniting with the Sun and Moon’s luminosity (合明),\nwhose efficacy is truly unmatched—\nhow could it be anything but a thousandfold efficacy?\n\nIn ancient times, the Duke of Lu (鲁侯) questioned the Master Kangcangzi (亢仓子) about the Dao of *ear-vision* (耳视) and *eye-hearing* (目听).\nKangcangzi replied:\n*\"The transmitters are mistaken (妄矣).\nI can see and hear without relying on ears and eyes,\nbut I cannot reverse the function of ears and eyes.\nIt must be that the body attunes with the heart (体合于心),\nthe heart attunes with the *qi* (心合于气),\nthe *qi* attunes with the spirit (气合于神),\nand the spirit attunes with the Void (神合于无).\nThus, though there be the subtle distinction of existence (有介然之有),\nor the faintest sound (唯然之音),\nwhether distant beyond the Eight Desolations (八荒之外),\nor near as the eyelashes (目睫之间),\nnone can evade my seeing and hearing.\nIf the world knew Kangcangzi’s seeing and hearing,\nthey would understand the Yellow Emperor’s blindness and deafness (聋瞽) in seeing and hearing.\"*\n\nHow profound and mysterious (玄妙)!\n\nThe heart arises from things (物),\nand perishes from things (物),\nits mechanism lies in the eyes (机在目).\nThe heart and eyes are interdependent,\nlife and death are thus bound together,\nand things and their mechanisms respond in kind—\nnever ceasing, never breaking.\n\nHuman beings are the spirit (灵) of all things,\ndaily interacting with the myriad forms.\nWhen a thought arises,\nit follows that the heart is born from things;\nwhen a thought is extinguished,\nit follows that the heart perishes from things.\nYet the heart does not itself arise from things,\nits mechanism lies in the eyes and ears (机在目耳);\nthe heart does not itself perish from things,\nfor its mechanism remains in the eyes and ears.\n\nIf at that moment one cannot distinguish black from white,\nnor beauty from ugliness,\nthen the heart aligns with the Great Emptiness (太虚),\nand how could life and death ever take hold?\n\nIt is the mechanism that lies in the eyes (机关在目),\nstirred by the slightest touch.\nA single glimpse of beauty\nand suddenly love is born (倏然生爱);\na single sight of evil\nand instantly hatred grows (悠然增恶).\nThus, to love is to give rise to desire (欲心生),\nshowing that the heart is born from things;\nto hate is to extinguish desire (欲心死),\nshowing that the heart perishes from things.\nTrace its origin—\nis this truly the heart’s inherent nature?\nIt is all the mechanism that lies in the eyes.\n\nHence, the Sage of old had the *Inner Observation Canon* (内观之经),\nthe Daoist adept had the *method of veiling the eyes* (帘目之法),\nthe Confucian admonition: *\"Do not gaze upon what is not proper\"* (非礼勿视),\nand the Buddhist *cleansing of the eye-root* (清净眼根).\nTheir intent is profound,\nyet their principles are not far from truth.\n\nStill, even the blind (瞽者) have their cravings—\ndoes the mechanism lie solely in the eyes?\nThus it is said: *\"The heart and eyes are interdependent.\"*\n\nChapter Three, the Canon states:\n*\"Heaven’s lack of favor is itself the greatest favor.\"* (天之无恩而大恩生)",
      "overlap_context": "e.\n\nThree cycles of day and night—\nthis is the rise and fall of the Three Palaces,\nendless coming and going;\ntenfold, thousandfold efficacy—\nthis is the spirit’s clash,\nmaking demons and external doctrines,\nevil thoughts and malicious intentions,\nsurrender without battle.\n\nTo abandon all desires and focus on the source,\ndissolving all burdens and distractions,\nwithout thought or deliberation,\npure and sincere in essence,\nno deviation in mind—\nthis is the realm of stillness and motionless repose.",
      "start_char": 5589,
      "end_char": 6233,
      "start_sentence": 256,
      "end_sentence": 284,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 13.617475271224976,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经讲义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "迅雷烈风，莫不蠢然。 天何心哉？ 四时行焉，百物生马，然必风雪凝冱，冰霜凛冽，而后万物有归根复命之理，是天之无恩而大恩生矣。 况迅雷烈风发于春夏，而百嘉畅茂，凡蠢动含灵，莫不戢然遂其生理。 所谓猛火烈焰之中，乃金宝成就之地。 学者体此，当明杀机，反复害里，生恩造无，上之玄元，为天人宗匠也。 至乐性余，至静则廉。 情有悲欢，性则至乐，欲有动作，道则至静，此仙凡所由分也。 学者求先当以性天为乐，不使一毫穷通得丧累于其中，则甜淡无为； 廉于持养，自然心与道契。 彼其七情六欲，悲欢无常，动触祸机，日裹尘网，无有出期，何性之可乐，何静之可廉欤？ 天之至私，用之至公。 天道无私，然于金丹也，若有所私。 天心有私，然于大道也，若无所私。 何以言之？ 人禀赋于天，一点灵明真觉之性，三昧无为自然之火，先天太一，含真之精，无大无小，无贵无贱，无仙无凡，皆获具足，是天无所私也。 然而有道者，阴阳升降，不失其时，日月交合不差其候，呼雷唤雨，振风闪电，真能旋乾转坤，驱龙伏虎，圣功生焉，神明出焉，有不可思议之妙； 无道者反是，阴阳失升降之期，日月无交合之候，雷电风雨自视何有？ 一身所存，不为饭囊酒瓮，则为药肆淫房。 是天果私于有道而不私于无道耶？ 吾见其有道者，长生住世，虽数尽而飞仙； 无道者，疾病缠绵，速与草木俱腐。 是天之至私者乃所以极其至公者也。 可不警欤？ 禽之制在气。 万物有生，皆禀一气。 禽若至微，飞行太空，虽知六翮所鼓，众羽所扶，傥非一气之充，则亦废而不举。 学者知之，则保啬元和，培养神气，使之至大至刚，充塞天地而后已。 《诗》不云乎：鸢飞戾天，鱼跃于渊，气作之也。 夫亦近取诸身，远取诸物乎？ 生者，死之根； 死者，生之根。 恩生于害，害生于恩。 欲通造化，当知生死之根； 欲明大道，当识恩害之义。 是理也，舍五行造化、金丹大道，何以明之？ 且金生于巳，死于子，子为水乡，而金能生水。 然则金岂真死耶？ 木生于亥，死于午，午为火地，而木又能生火。 水土生于申，死于卯，卯为木位，而水又能生木。 是生者死之根，死者生之根也。 然而生死之根固然，而恩害之义却异，惟金火之造化，不可以生死论也。 《龙虎上经》曰：金火者，真药也。 丹术着明，莫大乎金火，且火生于寅，死于酉，酉为金乡，其火但能克金，岂能生金耶？ 况酉为金旺之乡，而火为就死之地，既不能克之为害，而金反以生旺为恩。 然金亦岂能自生？ 要必资于所生，惟土能生金，而火却又生土，若无戊己，不成丹者也。 嗟夫，五行相生相克，至理幽微，学者罕知，况金丹一说，只是喜谈乐道，曾不深究玄旨，再当一一分辩，以诏将来。 且内外二丹不出五行造化，独不曰水火木土之丹，而特曰金丹者，何也？ 盖天一生水，坎为水宫，水为万物之母，修真者必当先于坎宫留心也。 然坎宫之水，岂能自生，惟金能生之，是元始先天之气从金化生。 古歌曰：用铅不用铅，须向铅中作，及至用铅时，用铅还是错。 盖铅为金母，金为水母，水为丹母，其相生相成之义如此。 然大道不以相生为用，而以相克为功，岂非以金能克木，木归于尽，木能克土，土极于虚；",
      "translated_text": "「Swift thunder and fierce winds—\nyet all move sluggishly.\nWhat heart does Heaven possess?\n\nThe seasons march on,\nA hundred things flourish and grow,\nYet only when frost and snow congeal,\nWhen ice and cold are severe,\nDo all things return to their roots and fulfill their fate—\nThis is Heaven’s lack of favor yielding the greatest favor.\n\nMoreover, when swift thunder and fierce winds arise in spring and summer,\nAll things rejoice and thrive;\nEvery living, breathing creature\nCompletes its natural course in harmony.\n\nWhat is called the midst of raging flames,\nIs the very place where gold and treasures are forged.\n\nThe scholar who grasps this truth\nShall understand the *killing mechanism*,\nThe reversal of harm within benevolence,\nThe creation of boundless favor,\nAscending to the Mysterious Origin (玄元),\nBecoming the master of both Heaven and humanity.\n\nThe utmost joy lies in innate nature,\nThe utmost stillness is purity itself.\nEmotions may shift between sorrow and joy,\nYet nature abides in supreme joy;\nDesires may stir to action,\nYet the Dao rests in supreme stillness—\nThis is how the transcendent and the ordinary diverge.\n\nThe scholar who seeks the Dao\nShould first take joy in his innate nature,\nLetting not a single trace of depletion or excess burden it,\nThen sweetness and tranquility arise naturally;\nPurity in cultivation\nWill spontaneously align the heart with the Dao.\n\nBut those who wallow in the seven emotions and six desires,\nWho find sorrow and joy inconstant,\nWho provoke harm at every turn,\nWho daily entangle themselves in dusty snares,\nWith no escape in sight—\nHow can their nature be said to bring joy?\nHow can their stillness be pure?\n\nHeaven’s utmost partiality\nIs its utmost impartiality in practice.\nThe Dao of Heaven is impartial,\nYet in the matter of *Inner Elixir* (金丹),\nIt seems to have its preferences.\n\nHeaven’s heart may appear partial,\nYet toward the Great Dao,\nIt seems utterly impartial.\nHow so?\n\nHumans receive their endowment from Heaven—\nA single point of luminous awareness, the true nature (一点灵明真觉之性),\nA threefold state of effortless spontaneity, the natural fire (三昧无为自然之火),\nThe primal unity of the Preheaven (先天太一),\nThe essence that harbors the True (含真之精).\nWithout distinction of great or small,\nOf noble or base,\nOf transcendent or ordinary,\nAll receive their full measure—\nThis is Heaven’s impartiality.\n\nYet those who follow the Dao\nSee yin and yang rise and fall without fail,\nThe sun and moon unite in perfect accord,\nThey summon thunder, call forth rain,\nStir winds and flash lightning—\nTruly turning Heaven and Earth,\nTaming dragons and subduing tigers,\nWhereby sacred deeds arise,\nDivine brilliance emerges,\nWith wonders beyond reckoning.\n\nThose without the Dao fare otherwise—\nYin and yang stray from their appointed times,\nThe sun and moon lose their celestial cycles,\nThunder, lightning, wind, and rain act as they please.\nIf one’s body persists beyond the mere vessel of food and drink,\nIt becomes but a den of medicine and lust.\n\nIs it not that Heaven truly favors those with the Dao\nAnd neglects those without?\n\nI have seen the Dao-cultivators\nLive long upon this earth,\nThough their bodies perish, they ascend as immortals;\nThe undaoed, sickly and wretched,\nDecay swiftly with plants and trees.\n\nThus Heaven’s utmost partiality\nIs the very means of its utmost impartiality.\nShould one not take heed?\n\nThe principle of *transformation* (禽之制) lies in *qi*.\nAll things that live\nReceive one breath of *qi*.\nEven the most minute creature,\nSoaring through the boundless void,\nThough it knows the six wings that beat\nAnd the countless feathers that support,\nWithout the fullness of that single *qi*,\nIt would falter and fail to rise.\n\nThe scholar who knows this\nShall preserve and nurture the Original *Qi* (元和),\nCultivate the divine breath,\nMaking it most vast and most resolute,\nFilling Heaven and Earth without end.\n\nDoes not the *Classic of Poetry* say:\n*\"The kite flies to the heavens,\nThe fish leaps in the depths—\nIt is the *qi* that makes it so.\"*\n\nIs this not near at hand in the body,\nAnd far observed in all things?\n\nLife is the root of death,\nDeath is the root of life.\nBenevolence arises from harm,\nHarm arises from benevolence.\nTo comprehend the workings of creation,\nOne must know the roots of life and death;\nTo fathom the Great Dao,\nOne must discern the meaning of benevolence and harm.\n\nThis principle—\nApart from the Five Phases (五行) of creation,\nApart from the *Inner Elixir* and the Great Dao,\nHow else might it be understood?\n\nNow, gold is born in the *Perilous Month* (巳),\nDies in the *Child Month* (子),\nThe *Child Month* being the realm of water,\nYet gold can generate water.\nSo then, does gold truly die?\n\nWood is born in the *Boar Month* (亥),\nDies in the *Horse Month* (午),\nThe *Horse Month* being the domain of fire,\nYet wood can also generate fire.\nWater and earth are born in the *Monkey Month* (申),\nDie in the *Tiger Month* (卯),\nThe *Tiger Month* being the position of wood,\nYet water can generate wood.\nThus life is the root of death,\nAnd death is the root of life.\n\nYet the roots of life and death are fixed,\nWhile the meaning of benevolence and harm differs—\nOnly the transformations of gold and fire\nCannot be judged by life and death alone.\n\nThe *Dragon-Tiger Upper Canon* (《龙虎上经》) states:\n*\"Gold and fire are the true medicines.*\nThe art of *Inner Elixir* (丹术) finds its greatest clarity in gold and fire.\nMoreover, fire is born in the *Tiger Month* (寅),\nDies in the *Rooster Month* (酉),\nThe *Rooster Month* being the realm of gold,\nIts fire can only subdue gold—\nHow could it generate gold?\n\nThe *Rooster Month* is where gold thrives,\nYet fire is in the place of its own demise—\nUnable to subdue it as harm,\nYet gold, in turn, regards its flourishing as benevolence.\nBut how could gold generate itself?\n\nIt must rely on what generates it—\nOnly earth can generate gold,\nYet fire also generates earth.\nWithout the *Steel* (戊) and *Earth* (己) phases,\nNo *Inner Elixir* could be formed.\n\nAh, the Five Phases\nGenerate and subdue one another—\nProfound and subtle truths,\nFew scholars grasp them.\nAs for the *Inner Elixir* (金丹),\nThey speak of it with delight,\nYet seldom delve into its Mysterious Essence.\nNow I must clarify each point,\nTo instruct those who come after.\n\nMoreover, the inner and outer *Inner Elixirs* (二丹)\nDo not depart from the Five Phases’ transformations,\nYet they are not called *Elixir of Water, Fire, Wood, and Earth*,\nBut specifically *Inner Elixir of Gold* (金丹)—\nWhy is this?\n\nIt is because Heaven One (天一) generates water,\nThe *Kan* (坎) Trigram being the palace of water,\nWater being the mother of all things,\nThe cultivator of truth must first focus his heart in the *Kan* Palace.\n\nYet the water of the *Kan* Palace\nCannot generate itself—\nOnly gold can do so.\nThus the Original *Qi* of the Primordial Beginning\nIs transformed and born through gold.\n\nThe ancient song says:\n*\"Use lead or do not use lead,\nYou must act within the lead.\nWhen the time comes to use lead,\nUsing lead is still a mistake.\"*\n\nLead is the mother of gold,\nGold is the mother of water,\nWater is the mother of the *Inner Elixir*—\nSuch is their generating and completing truth.\n\nYet the Great Dao does not rely on generation for its use,\nBut on subduction for its function—\nIs it not that gold can subdue wood,\nWood being reduced to exhaustion,\nWood can subdue earth,\nEarth reaching emptiness at its peak?」",
      "overlap_context": "ept had the *method of veiling the eyes* (帘目之法),\nthe Confucian admonition: *\"Do not gaze upon what is not proper\"* (非礼勿视),\nand the Buddhist *cleansing of the eye-root* (清净眼根).\nTheir intent is profound,\nyet their principles are not far from truth.\n\nStill, even the blind (瞽者) have their cravings—\ndoes the mechanism lie solely in the eyes?\nThus it is said: *\"The heart and eyes are interdependent.\"*\n\nChapter Three, the Canon states:\n*\"Heaven’s lack of favor is itself the greatest favor.\"* (天之无恩而大恩生)",
      "start_char": 6233,
      "end_char": 7492,
      "start_sentence": 285,
      "end_sentence": 338,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 21.982904195785522,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经讲义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "土能克水，水混于空； 水能克火，火终于灭。 火虽克金而金曾不坏，烟消焰尽，金体愈坚。 《参同契》曰：金入于猛火，色不夺精光。 岂非害生恩，恩生于害乎？ 此其所以谓之金液还丹，谓之长生不死，谓之返本还源，惟只水中金，一味而已。 若肝心脾肺肾，精津气血液，其形质全不相干，其性命却又相干，其理虽有可言，其道则不可言，盖有攒簇，有合和，有药物，有火候，有真凡，有宾主。 圣人传药不传火，不遇真师莫强猜，非歃血盟天，划沙文地，不许妄授，违者殃及九祖，祸先一身。 张平叔传非人，三遭责罚，可不鉴欤？ 愚人以天地文理圣，我以时物文理哲。 哲人可以虞愚，我以不愚圣，人其期、我以不期。 圣愚贤哲同一初耳，自其心有广狭，则所造有分量。 且天地时物咸有文理，其法象着明，无内无外，人能仰观俯察，则克念而作圣，克明而作哲。 然由愚而哲，由哲而圣，皆自心之广狭推之，故愚能以天地文理之大，存于仰观俯察之间，虽至于圣，可也。 吾而梏于时物文理之小，察于日用常行之间，仅止于哲而已。 圣哲既分，纯疵异念。 愚人既圣，在释谓之直超彼岸，见性成佛； 在道谓之一得永得，平地登仙。 一念之迷，既纯于愚； 一念之觉，自纯于圣。 惟哲人则不然，其初若汲汲于明道，而终则复悠悠而慢道，苟不加防虞之力，则出入无时，操存舍亡，又将入于愚而不自觉矣。 我之所希者圣，其可以仅哲而复愚乎？ 故我以不愚，非特不愚而圣也，亦岂特至圣而已也？ 盖圣人其期，犹有限量之可名，是犹梏于天地文理之用也。 我乃离形去智，与道合一，而独超于万物之表，是岂可得而期哉？ 此大而化之之谓圣，若难造矣，而圣而不可测知之谓神，即金丹之大道也。 论至于此，则曰愚、曰圣、曰哲。 始也，以天地时物之文理而入道，终也，忘天地时物之文理而得道。 譬之五行造化，万象森罗，皆道之用； 文字语言，瓦砾梯秆，皆道之寓。 凡三千六百门中一一践履，真积力久月，无忘其所能，固以限期为验，如颜子之亚圣不违仁于三月之久，其余则日月至焉而已尔。 若夫孔子之集大成，文王之顺帝则，上下与天地同流者，何以期限为哉？ 彼修空寂者曰饶，君经万劫，终是落空，亡何，谓不可期也。 殊不知身经劫火，虽云坏道，若虚空能坏无异哉？ 金丹大道，肇于太极，成于无极，用于有穷，妙于无穷，不可以凡俗语，当共神仙子细推也。 没水入火，自死亡兵。 水火有焚溺之患，刀兵有杀伐之威，不待智者，皆知所畏避也。 今乃求没于水，愿入于火，乐毙于兵，曾不病风丧心，亦非形格势禁，其事深可悯恻，何也？ 彼酒色财气，乃水火刀兵之异名，入皆焚溺自尽于中，曾不知惧，且嗤学道者徒清修斋戒，纵与彭聃同年，亦谩孤苦一世，曷若我酒色为乐乎？ 噫，飞蛾扑灯，难以遮护，特为长叹息而已。 自然之道静，故天地万物生。",
      "translated_text": "Earth can subdue water, water blending into emptiness;\nWater can subdue fire, fire ending in extinction.\nThough fire subdues gold, gold remains unbroken—\nAshes fade, flames vanish, yet gold’s essence grows firm.\n\n*The Parametric Classic* states:\n*\"When gold enters fierce fire, its luster remains unquenched.\"*\n\nIs it not that harm gives rise to blessing,\nAnd blessing emerges from harm?\nThus it is called *Jinye* Elixir of Return,\nCalled *Changsheng* Immortality,\nCalled *Return to the Origin, Source Reclaimed*—\nFor only gold within water suffices.\n\nYet liver, heart, spleen, lungs, kidneys,\nEssence, fluids, *qi*, blood, and humors—\nThough their forms differ utterly,\nTheir life-principles are intertwined.\nThough their logic may be spoken,\nTheir Dao defies articulation.\nFor there are *zuancu* [concentrations],\n*hehe* [harmonizations],\nAlchemical medicines,\nFire’s precise moments,\nTrue and mundane,\nGuest and host.\n\nThe Sage transmits medicine, not fire—\nWithout a true master, guessing is futile.\nUnless one swears oath by blood to Heaven,\nOr marks the ground with sand and script,\nTransmission is forbidden.\nTo violate brings calamity to nine ancestors,\nDisaster first upon oneself.\n\nZhang Pingzhu’s transmission to the unworthy\nMet three punishments—\nHow could one not take heed?\n\nThe foolish revere the Sage’s cosmic patterns,\nI study temporal things to grasp profundity.\nThe wise may pity the foolish,\nYet I transcend the Sage’s limits—\nOthers await, I do not.\n\nThough Sage, Fool, Virtuous, and Wise share the same origin,\nTheir hearts’ breadth determines their attainment.\nFor Heaven, Earth, time, and things all bear patterns—\nTheir laws and symbols manifest without end,\nNeither within nor without.\nIf one gazes upward and downward,\nReflects deeply and acts with clarity—\nThen through mindfulness, one becomes Sage;\nThrough illumination, one becomes Wise.\n\nYet from foolishness to wisdom,\nFrom wisdom to Sagehood—\nAll stem from the heart’s expansion.\nThus the foolish may grasp Heaven and Earth’s vast patterns\nWithin upward gazing and downward contemplation,\nAnd though they reach Sagehood, it is possible.\n\nBut I am constrained by temporal patterns’ limits,\nObserving daily life’s mundane paths,\nAnd thus remain merely Wise.\n\nSagehood and wisdom diverge—\nPure and flawed, intentions differ.\nWhen the foolish attain Sagehood,\nIn Buddhism, it is called *direct transcendence*—\nLiberation beyond shores, seeing nature as Buddha.\nIn Daoism, it is called *eternal attainment*—\nAscending to immortality from the ground.\n\nOne deluded thought remains foolish;\nOne awakened thought attains Sagehood.\n\nYet the Wise are different—\nThough they strive earnestly for the Dao,\nThey may later drift, neglectful.\nWithout vigilance, they drift without bound,\nLosing what they hold, discarding what they possess,\nAnd risk sinking back into foolishness unaware.\n\nMy aspiration is Sagehood—\nHow could I settle for mere wisdom,\nThen relapse into folly?\n\nThus I transcend foolishness—\nNot merely to avoid foolishness and become Sage,\nNor to stop at Sagehood alone.\nFor the Sage’s attainment still bears measure,\nStill bound by Heaven and Earth’s patterns.\n\nI transcend form, abandon intellect,\nMerge with the Dao, and rise beyond all things—\nHow could this be confined to measure?\nThis is the ultimate transformation called Sagehood,\nYet Sagehood beyond measure is called *Divine*—\nThe Great Dao of the Golden Elixir.\n\nSpeaking thus, we speak of Fool, Sage, Wise.\nAt first, one enters the Dao through Heaven, Earth, time, and things’ patterns,\nYet ultimately, one forgets these patterns to attain the Dao.\n\nLike the Five Phases’ transformations,\nTen thousand phenomena in array—\nAll are the Dao’s manifestations.\nWords and speech, tiles and reeds—\nAll are the Dao’s dwelling.\n\nWithin the thirty-six thousand teachings,\nEach step practiced truly,\nWith accumulated effort over years,\nOne must never forget what one can do—\nFor even Confucius’ disciple Yan Hui\nDid not stray from *ren* for three months,\nWhile others reach it by days or months.\n\nBut Confucius’ grand compilation,\nKing Wen’s alignment with Heaven’s will—\nFlowing above and below with Heaven and Earth—\nHow could this be bound by measure?\n\nThose who cultivate emptiness say:\n*\"Even after eons, it remains void—\nWhat need for measure?\"*\nYet even if one endures the fires of kalpas,\nIf emptiness could destroy the Dao,\nHow is it different?\n\nThe Golden Elixir’s Great Dao\nOrigins in the *Taiji*,\nCompletes in the *Wuji*,\nFunctions in the finite,\nMysteries in the infinite—\nIt cannot be spoken of in mundane terms.\nDiscuss it carefully with the Immortals.\n\nTo sink in water, enter fire,\nIs to court death’s instruments.\nWater and fire bring burning and drowning,\nKnives and arms bring slaughter—\nEven the unwise know to avoid them.\n\nYet now one seeks to drown in water,\nWishes to enter fire,\nDelights in death by blade—\nNo fear of wind or madness,\nNor is it coercion by form or circumstance—\nThis plight is deeply pitiable.\n\nFor wine, sex, wealth, and *qi*—\nThese are but other names for water, fire, blades, and arms.\nAll lead to self-destruction within,\nYet they fear not—\nThey scoff at those who merely fast and purify,\nSaying even if they match Pengzu and Tianmen’s longevity,\nIt is but lonely suffering—\nWhy not take pleasure in wine and desire?\n\nAlas, moths drawn to flames—\nNo defense remains,\nOnly long sighs.\n\nThe Dao of Nature is still—\nThus Heaven, Earth, and all things thrive.",
      "overlap_context": "se lead or do not use lead,\nYou must act within the lead.\nWhen the time comes to use lead,\nUsing lead is still a mistake.\"*\n\nLead is the mother of gold,\nGold is the mother of water,\nWater is the mother of the *Inner Elixir*—\nSuch is their generating and completing truth.\n\nYet the Great Dao does not rely on generation for its use,\nBut on subduction for its function—\nIs it not that gold can subdue wood,\nWood being reduced to exhaustion,\nWood can subdue earth,\nEarth reaching emptiness at its peak?」",
      "start_char": 7492,
      "end_char": 8604,
      "start_sentence": 339,
      "end_sentence": 379,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 17.35474681854248,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经讲义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "天地之道浸，故阴阳胜。 阴阳相推变化顺矣。 是故圣人知自然之道不可违，因以制之。 太上曰：万物芸芸，各归其根。 归根曰静，静曰复命。 又曰，致虚极，守静笃，万物并作，吾以观其复。 且至虚至静，体疑于阴，万物从何而生？ 然阴不极则阳不生，静不极则道不见。 况大道无形，生育天地； 大道无名，长养万物。 傥不法于自然，处于至静，则天地万物决不能生。 人以一身参天地万物之用，得不知所谓静乎？ 惟其心猿意马，日放纵于利欲之场，视天地万物生成之理，于己何哉？ 况天地之道，君浸润焉，自一阳而浸至于六阳，自一阴而浸至于六阴，皆以渐而长，未有骤而进也。 故阴阳相推，皆顺自然之理，惟圣人知其然也，则无为中有为，至动中至静，使天地万物因静而生。 非有道者，孰能知之。 至静之道，律历即不能契。 鸟兽之谓也。 律历之法，推算天纪，有七十二候，有二十四气，有四时八节，有晦朔弦望，皆度数不可违也。 然治历明时，推步纤悉，疑非自然无为之理也。 惟圣人道极至静，心同太虚，阴阳升降，运化自然，曾无一毫造作，若律历之多事，得非鸟兽之谓乎？ 盖鸟兽者，乌兔也。 乌兔者，日月也。 日月者，水火也。 水火者，阴阳也。 阴阳者，天地也。 天地者，清静无为、自然之大道也。 大道者，即穷理尽性、以至于命之学也。 性命者，即长生不死、金丹之方也。 爰有奇器，是生万象。 八卦甲子，神机鬼藏。 阴阳相胜之术，昭昭然进乎象矣。 大哉，道乎。 至哉，言乎。 《阴符圣经》皆黄帝阐道秘言，予辄不揆，解释其义，妄泄天机，载观末后，数语总括始终，亦犹乾坤之彖辞，备六十四卦之大义，其探赜索隐，钧深致远，未易揣摩，猗欤休哉？ 敢再拜。 熏染而详明之，且金丹大道，其于一身，有奇器焉，非必铸冶也。",
      "translated_text": "The Dao of Heaven and Earth is gradual—\nThus yin and yang prevail.\n\nYin and yang, in mutual succession, transform and flow in harmony.\nTherefore, the sage knows the Dao of Nature cannot be defied,\nAnd follows it to govern.\n\nThe Supreme Sage says:\nAll things teeming, each returns to its root.\nReturning to root is stillness—\nStillness is restoring the Mandate.\n\nAgain it is said:\nPush emptiness to its utmost,\nHold steadfast to stillness—\nThen all things arise together,\nAnd I observe their return.\n\nYet when emptiness and stillness are absolute,\nThe body merges with yin—\nHow then do all things arise?\n\nBut yin, if not extreme, gives no birth to yang,\nStillness, if not extreme, reveals no Dao.\n\nHow much more so—the Great Dao, formless,\nGiving birth to Heaven and Earth;\nThe Great Dao, nameless,\nNourishing all things.\n\nIf one does not conform to Nature,\nDwelling not in utter stillness,\nThen Heaven, Earth, and all things\nCould never generate.\n\nMan, with one body, partakes in Heaven and Earth’s functions—\nYet does he not know what stillness is?\n\nOnly his mind-monkey and will-horse\nDaily roam unrestrained in the field of desires,\nViewing the principles of Heaven and Earth’s creation—\nWhat relevance do they hold for him?\n\nMoreover, the Dao of Heaven and Earth\nIs like gradual infiltration—\nFrom one yang to six yangs,\nFrom one yin to six yins,\nAll growing by degrees, never abruptly.\n\nThus yin and yang, in mutual succession,\nFollow Nature’s order—\nOnly the sage knows this,\nAnd within *wuwei* there is action,\nWithin utmost motion there is utmost stillness,\nCausing all things to arise from stillness.\n\nWho but the Daoist can comprehend this?\n\nThe Dao of utmost stillness\nEven the calendar cannot measure.\nBirds and beasts are its example.\n\nThe calendar’s laws,\nCalculating celestial cycles,\nHave seventy-two *xiàng*,\nTwenty-four *qi*,\nFour seasons and eight nodes,\nWaning and waxing phases—\nAll are fixed numbers that cannot be defied.\n\nYet in regulating time and seasons,\nIn meticulous computation,\nOne doubts it contradicts the Dao of *wuwei* and Nature.\n\nOnly the sage, his Dao reaching utmost stillness,\nHis heart as boundless as the Void,\nSees yin and yang rise and fall,\nTransforming naturally—\nNot a trace of contrivance.\nIf the calendar’s artifices are excessive,\nIs it not the fate of birds and beasts?\n\nFor birds and beasts are the tortoise and hare—\nThe tortoise and hare are the sun and moon—\nThe sun and moon are water and fire—\nWater and fire are yin and yang—\nYin and yang are Heaven and Earth—\nHeaven and Earth are the Dao of pure stillness and *wuwei*, Nature’s great Way.\n\nThe Great Dao is the study\nOf penetrating principles, exhausting essence,\nExtending to the Mandate of life.\n\nLife and Mandate are the art\nOf eternal existence, the elixir’s method.\n\nThere exists a wondrous instrument,\nGiving birth to all phenomena.\nThe Eight Trigrams and Heavenly Stems,\nDivine mechanisms concealed like ghosts.\nThe arts of yin-yang victory\nAre clearly manifested in symbols.\n\nAh, the Dao! How vast!\nAh, the words! How profound!\n\n*The Yinshu Jing* are Yellow Emperor’s secret utterances on the Dao.\nI dare not hesitate—\nI explain their meaning,\nRevealing Heaven’s hidden machinations.\nTo gaze upon the end and summarize the beginning,\nIt is like the *xuan* of *Qian* and *Kun*,\nEmbracing the essence of all sixty-four hexagrams.\nIts probing of mysteries, reaching the profound,\nIs not easily fathomed.\nAh, how splendid!\n\nI dare to bow twice.\nThrough gradual influence, it is made clear—\nAnd the Great Dao of the elixir,\nWithin one’s body,\nHas its wondrous instrument—\nNot necessarily forged by fire and furnace.",
      "overlap_context": "e—\nThis plight is deeply pitiable.\n\nFor wine, sex, wealth, and *qi*—\nThese are but other names for water, fire, blades, and arms.\nAll lead to self-destruction within,\nYet they fear not—\nThey scoff at those who merely fast and purify,\nSaying even if they match Pengzu and Tianmen’s longevity,\nIt is but lonely suffering—\nWhy not take pleasure in wine and desire?\n\nAlas, moths drawn to flames—\nNo defense remains,\nOnly long sighs.\n\nThe Dao of Nature is still—\nThus Heaven, Earth, and all things thrive.",
      "start_char": 8604,
      "end_char": 9311,
      "start_sentence": 380,
      "end_sentence": 416,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 9.356733322143555,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经讲义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "偃月之炉，太一之灶，无内无外之鼎，至灵至圣之药，是生万象，皆出自然。 洞宾谓一粒粟中藏世界，三升铛内煮山川，岂虚语乎？ 故以八卦言之，则坎离为本； 以周天言之，则子为先。 其机之神也，则妙用无方； 其鬼之藏也，则隐显莫测。 阴胜阳，则水火为既济； 阳胜阴，则日月为合璧。 金乌有搦兔之功，木龙有伏虎之德，龟蛇交颈，蚌螪含珠，悬象昭昭，殆不可掩，得非充实而有光辉之谓大，大而化之之谓圣，圣而不可测知之谓神者乎？ 是道也，即吾儒分内事也。 昧者谓金丹为异端曲学，是犹坐井观天而曰天小者，岂天之罪哉？ 卷四 云峰曰：谁能出不由户，何莫由斯道也。 盖户者，关也。 有关而后行于正道也。 傥元关，则有猖狂妄行之患，放僻邪侈之习矣。 故曰：内有三关，以性为主，以神气为宗，所谓常收归里，不放出外者是也。 外有三关，以口为枢，以耳目为键，所谓九窍之邪在乎三要者是也。 此皆日用常行，中庸大道之道也。 夫道若大路然，人岂不由之哉？ 其初也，妇人女子皆可与知，及其至也，虽圣人亦有所不知。 故曰：可歌之谓善，有诸己之谓信，充实而有光辉之谓大，大而化之之谓圣，圣而不可测知之谓神。 是神也，岂非灵明妙用，显化通神，即金丹之秘旨矣。 日月圣功图 云峰曰：天地之道，一阴一阳，元炁配合，万物生焉。 悬象着明，莫大乎日月者。 太阳真火，象应东南，从木而生； 外应春夏，发生万物； 月者太阴真水，象应西北，从金而长，肃杀万物。 此二者，乃天地生杀之机，故称曰水火，曰坎离，曰铅汞，曰龙虎，其它异名不胜数，皆日月之号也。 圣人观天之道，察其盛衰，明其幽隐，将日月二气划成八卦，以日之火为二，月之水为一，自一二既分，卦气以别，故变之为六十四。 上十五日，坤生震，而变兑，兑变成干，干气圆满，悬照东方，金水温温，金气既足，自生真水。 下十五日，干损成巽，巽复成艮，艮损成坤乾坤乃合，日月相交，至精至微，不可思议。 虽人物鬼神，推至异类，毫发不能隐。 大哉，日月天地之体也。 夫人能穷日月之圣功，则晦朔弦望，体天法象，可以与天地日月同其运用，岂不能超凡入圣、出死入生者乎？ 奇器万象图说 云峰按《阴符经》曰：爰有奇器，是生万象。 八卦甲子，神机鬼藏。 大哉，言乎。 人之一身即一奇器也，万象皆备，神鬼护持，可谓至贵。 太上曰：人身难得，中土难生，假使得生，正法难遇是也。 平叔曰； 先立乾坤为鼎器，次将乌兔药来烹。 岂舍吾身之外而求乾坤于冥漠之表，取乌兔于日月之宫乎？ 是知奇器在乎身，万象备于我，几二仪、三光、四象、五行、八卦，九宫、十干、十一曜、十二支、二十四气、周天六十甲子，皆备于人之一身。 苟能仰观俯察，与天地阴阳同其造化，则机缄密契，鬼神莫测，三才并立，长生久视，仙道岂远哉？ 三教归一图说 云峰曰：三教殊途同归，妄者自生分别。 彼谓释道虚无，不可与吾儒并论，是固然也。 自立人极应世变，言之则不侔，至于修真养性与正心、诚意之道，未易畦畛也。 惟禅宗一门，脱空异甚，思欲破其迷妄，每未得其要领。 一日，专扣蒙庵聪老，请问宗性传灯大意如何，辨答不已。",
      "translated_text": "The crescent furnace of **Yǎn Yuè**, the hearth of **Tài Yī**, the tripod with neither inside nor outside—\nthe most refined, most sacred elixir,\nwhich gives birth to all phenomena,\nall emerging from the natural order.\n\nDongbin spoke of a single grain of millet containing a world,\nthree *shāng* of a cauldron boiling mountains and rivers—\nwas this not truthful speech?\n\nThus, when spoken of through the Eight Trigrams,\n**Kàn** and **Lí** are the foundation;\nwhen spoken of through the Circulation of Heaven,\nthe **Child** (水) takes precedence.\n\nIts divine mechanism—\nits wondrous, boundless applications;\nits hidden essence—\nits concealment and revelation beyond measure.\n\nWhen yin overcomes yang,\nwater and fire achieve *Jìjí* (既济);\nwhen yang overcomes yin,\nsun and moon become *Hébì* (合璧).\n\nThe **Golden Crow** has the virtue of seizing the hare,\nthe **Wooden Dragon** the power of subduing the tiger.\nThe tortoise and serpent entwine their necks,\nthe clam and mussel hold pearls—\ntheir symbols hang resplendent,\nhardly concealable.\nIs this not the meaning of *chōngshí ér yǒu guānghuī* (充实而有光辉)—\nthe greatness of *dà ér huà zhī* (大而化之)—\nthe sainthood of *shèng ér bùkě cèzhī* (圣而不可测知)?\n\nThis is the Dao—\nthe very concern of our Confucian tradition.\nThe ignorant claim the elixir as heterodox, perverse learning—\nlike one who sits in a well and claims the sky is small.\nIs this the sky’s fault?\n\n**Yúnfēng** says:\nWho does not pass through the door?\nWhy not walk this Dao?\n\nThe door is a gate.\nOnly with a gate can one walk the true path.\nIf the gate is lost,\nthere arises reckless, wild behavior,\ndeviant and extravagant habits.\n\nThus it is said:\nWithin are the Three Gates—\nwith nature as master,\nwith vital qi as core—\nthe constant return inward,\nnever letting out.\n\nWithout are the Three Gates—\nthe mouth as hinge,\neyes and ears as locks—\nthe evils of the nine orifices lie in these three.\n\nThese are the daily, ordinary ways\nof the *Zhōngyōng* (中庸), the Great Dao.\n\nThe Dao is like a great road—\nwho does not walk it?\n\nAt its beginning,\neven women and children may understand it;\nwhen it reaches its height,\neven sages have things they do not know.\n\nThus it is said:\nTo be sung is to be good (*kě gē zhī wèi shàn*),\nto be within oneself is to be true (*yǒu zhū jǐ zhī wèi xìn*),\nto be full and radiant is to be great (*chōngshí ér yǒu guānghuī zhī wèi dà*),\nto transform and change is to be sage (*dà ér huà zhī zhī wèi shèng*),\nto be unfathomable is to be divine (*shèng ér bùkě cèzhī zhī wèi shén*).\n\nThis divinity—\nis it not the luminous, wondrous function,\nthe manifest transformation, the secret essence\nof the elixir’s true meaning?\n\n**Yúnfēng** on the *Diary of the Sun and Moon’s Sacred Functions*:\nThe Dao of Heaven and Earth—\none yin, one yang,\nthe primordial *qi* paired,\nand all things are born.\n\nThe suspended symbols, most manifest—\nnone greater than sun and moon.\n\nThe **Great Sun**, true fire,\ncorresponding to the southeast,\nborn from wood;\nexternally corresponding to spring and summer,\ngiving birth to all things.\n\nThe **Moon**, true yin-water,\ncorresponding to the northwest,\nnourished by metal,\npruning and killing all things.\n\nThese two are the mechanisms of Heaven and Earth’s birth and death,\nthus called *water and fire*,\n*Kàn and Lí*,\n*lead and mercury*,\n*Dragon and Tiger*—\nother names too numerous to count,\nall names for sun and moon.\n\nThe sage observed Heaven’s Dao,\ndiscerned its waxing and waning,\nrevealed its hidden depths,\nand divided the sun and moon’s *qi* into the Eight Trigrams—\ntwo for the sun’s fire,\none for the moon’s water.\nOnce one and two were divided,\nthe *guà*’s *qi* differentiated,\nthus forming sixty-four variations.\n\nThe first fifteen days:\n**Kūn** gives birth to **Zhèn**, which transforms into **Xuàn**,\n**Xuàn** transforms into **Gàn**,\n**Gàn**’s *qi* full and round,\nsuspended and shining in the east—\nmetal and water warm and gentle,\nmetal’s *qi* sufficient,\ngiving birth to true water.\n\nThe next fifteen days:\n**Gàn** diminishes into **Xùn**,\n**Xùn** returns to **Gèn**,\n**Gèn** diminishes into **Kūn**—\n**Kūn** and **Qián** unite,\nsun and moon intertwine,\ntheir essence most subtle, most refined—\nbeyond thought or speech.\n\nEven spirits, ghosts, and gods,\nlet alone humans and beasts,\ncannot hide a hair’s breadth.\n\nGreat indeed is the body of sun, moon, Heaven, and Earth!\n\nIf one can exhaust the sun and moon’s sacred functions,\nthen at new and full moons, observing Heaven’s symbols,\none may align with Heaven and Earth, sun and moon in their movements—\nhow could one not transcend the mundane, attain sainthood,\nescape death and enter life?\n\n**Yúnfēng’s Explanation of the *Wondrous Instrument, Ten Thousand Phenomena***:\nAs the *Yīnfǔ Jīng* says:\n*\"There exists a wondrous instrument,\nwhich gives birth to all phenomena.\nThe Eight Trigrams and Heavenly Stems—\ndivine mechanisms concealed like ghosts.\nGreat are the words!\"*\n\nA person’s body is itself this wondrous instrument—\nall phenomena complete,\nspirits and ghosts guarding it—\ntruly the most noble.\n\nThe **Tàishàng** says:\n*\"The body is hard to obtain,\nthe Central Land hard to be born in,\nand if born, the true law is hard to encounter.\"*\n\n**Píngshū** says:\n*\"First establish **Qián** and **Kūn** as the tripod,\nthen bring the crow and hare’s elixir to boil.\nWhy seek **Qián** and **Kūn** beyond the body,\nor take the crow and hare from the sun and moon’s palace?\"*\n\nThus it is known:\nthe wondrous instrument lies within the body,\nall phenomena are complete in oneself—\nthe Two Poles, the Three Luminaries, the Four Symbols,\nthe Five Phases, the Eight Trigrams,\nthe Nine Palaces, the Ten Stems, the Eleven Celestial Exaltations,\nthe Twelve Branches, the Twenty-Four Seasons,\nthe sixty *jiǎzǐ* of the Circulation of Heaven—\nall are complete in a single body.\n\nIf one can look upward and downward,\naligning with Heaven and Earth, yin and yang in their transformations,\nthen the mechanisms are sealed in harmony,\nghosts and gods cannot fathom,\nthe Three Powers stand together,\nlongevity and clear vision are attained—\nhow far could the Dao of transcendence be?\n\n**Yúnfēng’s Explanation of *The Three Teachings Merge as One***:\nThe Three Teachings follow different paths but converge.\nThe deluded create divisions.\n\nThey say Buddhism and Daoism are empty,\nunworthy of comparison with Confucianism—\nthis is true.\n\nBut when it comes to cultivating the true self,\nnurturing nature,\nand the Dao of rectifying the heart, sincerity of intent—\nthe distinctions are not so clear.\n\nOnly the Chan school stands apart in its strangeness.\nI wished to dispel its delusions,\nyet never grasped its essence.\n\nOne day, I pressed **Mèng’ān Cōng Lǎo**,\nasking how the transmission of the school’s nature and lamp might be clarified—\nand the discussion continued without end.",
      "overlap_context": "esitate—\nI explain their meaning,\nRevealing Heaven’s hidden machinations.\nTo gaze upon the end and summarize the beginning,\nIt is like the *xuan* of *Qian* and *Kun*,\nEmbracing the essence of all sixty-four hexagrams.\nIts probing of mysteries, reaching the profound,\nIs not easily fathomed.\nAh, how splendid!\n\nI dare to bow twice.\nThrough gradual influence, it is made clear—\nAnd the Great Dao of the elixir,\nWithin one’s body,\nHas its wondrous instrument—\nNot necessarily forged by fire and furnace.",
      "start_char": 9311,
      "end_char": 10553,
      "start_sentence": 417,
      "end_sentence": 469,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 22.107776403427124,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经讲义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "大要谓：法身即虚空，虚空即法身。 且叮咛俾于参省，特烧香秉烛，以三宝证明。 顷间，茶罢，忽唤行童代事，抽身同往后架。 出则洗手剔甲，再整方袍，请予归座，却道老僧颇饥，相伴汤饼。 予因难之曰：适间见教，虚空法身，法身虚空，今又饥渴难免，分别触净，猜人不得于虚空，事还作么生。 蒙庵愕然，无语可答。 及到方丈，见有《雪窦语录》，乘时阅之。 中有僧问智问和尚：如何是般若体？ 云：蚌含秋月。 僧云：如何是般若用？ 云：兔子怀胎。 非惟把定世界，亦乃安贴邦家。 若善能于参详，便请丹霄独步。",
      "translated_text": "The great essence is thus: **The Dharma-body is the void**, the void is the **Dharma-body**.\n\nMoreover, he earnestly admonished me to reflect upon this,\nso I lit incense and candles,\nand invoked the **Three Jewels** as witness.\n\nIn a short while, after tea was done,\nsuddenly he called for the novice to attend to matters,\nand withdrew with me to the rear gallery.\nUpon exiting, he washed his hands and removed his armor,\nthen straightened his square-cloth robes,\nand asked me to return to my seat.\nHe then said, *\"The old monk is rather hungry—*\nlet us share a bowl of soup and dumplings.\"\n\nI hesitated and replied:\n*\"Just now, you spoke of the void and the **Dharma-body**,\nthe **Dharma-body** and the void—\nyet now hunger and thirst cannot be avoided.\nYou distinguish between defiled and pure,\nbut how can one suspect you of failing to grasp the void?\nWhat is this still?\"*\n\n**Mèng’ān Cōng Lǎo** was stunned,\nand found no words to answer.\n\nWhen we reached the **hall of the square room**,\nI saw there a *Snow Cave Sayings* (**Xuědòu Yǔlù**).\nAt the moment, I read it.\nWithin it, a monk asked **Zhìwèn** the Venerable:\n*\"How is the **Prajñā-body**?\"*\nHe replied: *\"A clam holding the autumn moon.\"*\n\nThe monk asked: *\"How is the **Prajñā-use**?\"*\nHe replied: *\"A rabbit bearing a fetus.\"*\n\nNot only does this settle the world of stillness,\nit also secures the realm of the **Dharma**.\nIf one can skillfully ponder and examine,\nthen let them stride alone in the **Lotus Land**.",
      "overlap_context": "\nunworthy of comparison with Confucianism—\nthis is true.\n\nBut when it comes to cultivating the true self,\nnurturing nature,\nand the Dao of rectifying the heart, sincerity of intent—\nthe distinctions are not so clear.\n\nOnly the Chan school stands apart in its strangeness.\nI wished to dispel its delusions,\nyet never grasped its essence.\n\nOne day, I pressed **Mèng’ān Cōng Lǎo**,\nasking how the transmission of the school’s nature and lamp might be clarified—\nand the discussion continued without end.",
      "start_char": 10553,
      "end_char": 10782,
      "start_sentence": 470,
      "end_sentence": 482,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 4.970121622085571,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经讲义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "僧云：如何是佛向上事？ 云：柱杖头挑日月。 又祖师问南泉和尚云：摩尼珠人不识，如来藏里亲收得。 如何是如来藏？ 南云：与尔往来者是藏。 师云：草里汉。 南云：不往不来者亦是藏。 师云：雪上加霜。 师云：如何是珠？ 南云：崄百尺竿头作伎俩，不是好手。 这里着得个眼，宾主互换，便能深入虎穴。 若不恁么，纵饶师祖悟彻去，也是龙头蛇尾。 汉予遂指示蒙庵略露一斑以救其病。 渠当时大悟，再还灶香于予。 信知三教等无差别，本来面目只是一个，但服色不同耳。 故详录此以诏天下明眼君子。 先天后天图说 云峰曰：先天者，太极未判混成，孰为阳？ 孰为阴？ 自道生一，则其体已露，其用已萌，故一为数奇，为卦干，纯阳之象也。 后天者，鸿蒙剖破，柝一为二，一为数耦，为卦坤，纯阴之象也。 乾坤既异，阴阳既分，运化不同，何以为道？ 惟金丹之妙，反本还源，寻根摘蒂，守雌抱一，去阴取阳，不以乾坤之异而求其同； 不以阴阳之分而求其合，故异者分者为后天，而同者合者实先天也。 先天者，乃元始祖，炁本来面目； 后天者，乃臭腐神奇，四大假合者也。 达人大观，苟知吾身是幻，惟道是真，则回光返照，下手速修尤太迟矣。 上下鹊桥图说一名曲江乌桥 云峰曰：吕洞宾《沁园春》云：曲江上，月华莹净，有个乌飞。 盖乌即鹊也。 曲江，即有桥也。 日中有三足乌，乌属酉，酉属金。 乌是西方之金精，日中之阳魂，乃能飞于曲江之上，是鹊能度登仙之桥也。 然桥必分于上下，何也？ 盖气脉相通，能度下桥，必能度上桥矣。 能度者则为仙，不能度者则为凡矣。 释氏之系马椿、系驴橛者，亦此意也。 但其守死善道，块然面壁，不能使乌飞鹊度，故落第二义也。 然其祖法不然，奈后世子孙迷错耳。 其详见三教归一图说。 七十二候图说",
      "translated_text": "The monk asked: *\"How is the Buddha’s supreme matter?\"*\nHe replied: *\"A staff’s tip lifts the sun and moon.\"*\n\nAgain, the Ancestor asked **Nánquán** the Venerable:\n*\"The **Mañjuśrī-bead**—if one does not recognize it,\nthe **Tathāgatagarbha** is personally gathered within.\nHow is the **Tathāgatagarbha**?\"*\n**Nánquán** said: *\"That which comes and goes with you is the treasure.\"*\nThe Ancestor said: *\"A Han within the grass.\"*\n**Nánquán** said: *\"That which neither comes nor goes is also the treasure.\"*\nThe Ancestor said: *\"Frost upon snow.\"*\nThe Ancestor said: *\"How is the bead?\"*\n**Nánquán** said: *\"To perform tricks at the hundred-foot staff’s peak—\nthat is no master’s hand.\nHere, if one catches sight of this,\nguest and host exchange places,\nand one may penetrate the tiger’s den.\nIf not so,\neven if the Ancestors awaken fully,\nit is still a dragon’s head and serpent’s tail.\"*\n\nThus, I pointed out to **Mèng’ān** a glimpse to cure his affliction.\nAt that moment, he attained great awakening\nand returned the incense at the stove to me.\n\nTruly, the Three Teachings differ in no essence—\ntheir original face is one and the same,\nonly their robes vary in hue.\nThus, I record this in detail\nto proclaim to the clear-eyed gentlemen of the world.\n\n---\n**The Diagram of Before-Heaven and After-Heaven**\n**Yúnfēng** said:\nBefore-Heaven is when the **Tàijí** has not yet divided,\nmixed and undifferentiated—\nwhich is **yáng**? Which is **yīn**?\nOnce the **Way** generates **One**,\nits substance is already revealed,\nits function already sprouted.\nThus, **One** is the odd number,\nthe **stem of the hexagram**,\nthe symbol of pure **yáng**.\n\nAfter-Heaven is when **Hóngméng** is split,\n**One** divides into **Two**,\n**One** becomes the paired number,\nthe **body of the hexagram**,\nthe symbol of pure **yīn**.\n\nSince **Qián** and **Kūn** differ,\nand **yīn** and **yáng** are divided,\ntheir transformations vary—\nhow then is this the **Way**?\n\nOnly the marvel of the **Golden Elixir**\nreturns to the root and source,\nseeks the root and plucks the bud,\nnurtures the **feminine** and embraces **One**,\ndiscards **yīn** and takes **yáng**,\nnot seeking unity in the difference of **Qián** and **Kūn**,\nnor harmony in the division of **yīn** and **yáng**.\nThus, the divided and the disparate belong to After-Heaven,\nwhile the unified and harmonized are truly Before-Heaven.\n\nBefore-Heaven is the **Primordial Ancestor**,\nthe **qi**’s original face;\nAfter-Heaven is the **stinking rot** turned into marvels,\nthe four **great elements** artificially combined.\n\nThe enlightened observer—\nif one knows the body is illusion,\nonly the **Way** is true,\nthen to delay practice by reflecting back the light\nis already too late.\n\n---\n**The Diagram of the Upper and Lower Magpie Bridge**\n*(Also called the Curve River Crow Bridge)*\n**Yúnfēng** said:\n**Lǚ Dòngbīn’s** *\"Qìn Yuán Chūn\"* reads:\n*\"On Curve River, the moon’s glow is clear and pure—\na crow flies there.\"*\n\nThe crow is the magpie.\nCurve River is the bridge.\n\nThe sun contains the **three-legged crow**,\nthe crow belongs to **yǒu** (the hour),\n**yǒu** belongs to **metal**.\nThe crow is the **metallic essence** of the West,\nthe **yang soul** of the sun,\nable to fly above Curve River—\nthus, the magpie can cross the bridge to transcendence.\n\nYet the bridge must be divided into upper and lower—\nwhy?\nBecause the **qi**-paths communicate:\none who can cross the lower bridge\nmust also be able to cross the upper.\nThose who can cross are **transcendents**,\nthose who cannot are **mortals**.\n\nThe **Buddhist** practice of tethering the horse to the **chūn tree**,\nor tethering the donkey to the **ruò stake**,\nalso conveys this meaning.\nBut their rigid adherence to the **good path of death**,\nstubbornly facing the wall,\ncannot make the crow fly or the magpie cross—\nthus, they fall into the second category.\n\nYet their original method was not so.\nAlas, later descendants strayed.\n\nThe details appear in the **Diagram of the Three Teachings as One**.\n\n---\n**The Diagram of the Seventy-Two Seasons**",
      "overlap_context": "quare room**,\nI saw there a *Snow Cave Sayings* (**Xuědòu Yǔlù**).\nAt the moment, I read it.\nWithin it, a monk asked **Zhìwèn** the Venerable:\n*\"How is the **Prajñā-body**?\"*\nHe replied: *\"A clam holding the autumn moon.\"*\n\nThe monk asked: *\"How is the **Prajñā-use**?\"*\nHe replied: *\"A rabbit bearing a fetus.\"*\n\nNot only does this settle the world of stillness,\nit also secures the realm of the **Dharma**.\nIf one can skillfully ponder and examine,\nthen let them stride alone in the **Lotus Land**.",
      "start_char": 10782,
      "end_char": 11488,
      "start_sentence": 483,
      "end_sentence": 523,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 10.560124158859253,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经讲义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "云峰按《元始秘言》曰：恍恍惚惚，火中生神； 杳杳冥冥，水中生精。 火炎升上，七返生神； 水流就下，六化生精。 七六变化，上下相成。 精神往来，妙体含真。 神七变生真火，精六化生真水。 七六十有三之妙数，无出天地之水火。 故天候三十六阳而生火，地侯三十六阴而生水，合七十二候，而周天之数足矣。 《仙经》曰：天上三十六，地下三十六，太玄无边际，妙哉《大洞经》。 然不言五行而专言水火，何也？ 盖水火者，日月也。 《阴符经》曰：日月有数，大小有定，圣功生焉，神明出焉。 人能仰观俯察而得其火侯之秘，则与天地合德，日月合明，可谓平地登仙矣。 五行生成图说 云峰曰：太极分而生两仪，天地是也。 天地既有形名，难逃度数。 故天一生水，地二生火，天三生木，地四生金，天五生土，是五行造化弥纶天地之经，则五气推迁，寒暑往来，周天度数，可得而明矣。 故以三十六日甲、三十六日乙，而木之气数足矣； 三十六日丙，三十六日丁，而火之气数足矣； 三十六日戊，三十六日己，而土之气数足矣。 三十六日庚，三十六日辛，而金之气数足矣； 三十六日壬，三十六日癸，而水之气数足矣。 合五七三十五而计之，则得三百五十日又零二五一十日，通前共三百六十日，则一年十二月之度数无差。 其它天度之零，可以积闰而推，所以陶成万汇造化。 夫人为万物之灵，独昧于五行之运，徒见昼夜循环，四时代谢，而不知五行造化，实主宰之玄哉，妙哉。 云峰入药镜笺序 左史直院舍人朝请大夫留元刚撰 东嘉夏宗禹奇伟俶傥之画策，从事制幕，转徙边徼，数奇不耦。 浩然游方，访飞升还返之术，宜参默授，会稡笺解谒予书之。 昔苏东坡谓安期生世知其为仙者也，然太史公曰：蒯通善齐人安期生，生以策干项羽。 羽不能用，欲封此两人，两人终不肯受，亡去。 每读此，未尝不废书而叹，仙者非斯人而谁为之？ 故意战国之士，如鲁仲连、虞卿，皆得道者欤。 虞卿不忍魏齐，间行去赵，困梁失相，穷愁着书。 蒯通说信不听，阳狂为巫，逃亨客参，自序其说，是得为知道耶？ 必也。 不肯仕宦，好持高节，辩魏客帝秦之害，罢燕将聊城之守。 寿以金而辞，则曰； 所贵于天下之士者，为人排患释难，解纷乱而无取也，即有取者，是商贾之事而不忍为也。 欲爵之而逃，则曰：吾与富贵而诎于人，宁贫贱而轻世肆志焉。 嗟乎，有若鲁仲连而后可以为仙也。 安期生附载之史传，旁见杂记，似诞不经。 应如鲁仲连抵掌，吐长虹，难堪踞床洗，宁挹扛鼎雄事，既两大缪，飘然尔遗风。 乃知经世士出世或乘龙，斯得之矣。 宗禹所释金丹三书，超轶世外、固异八篇隽永，刺讥权变，是将为鲁仲连、安期生书。 彼虞卿、蒯通说士耳，又安足与二子并言哉？ 宝庆丙戌小雪后五日，清源齐云山人序。 云峰续记 夏云多奇峰，晋人得意句也。 予以幻质托此幻号，诚画蛇之足、续凫之颈也。 或者乃以效颦太史公之好奇，而窃诗人之巧语，以自表耳。 噫，夏为四时，云为一气，峰从何来？ 奇从何有？ 出岫无心，从龙无迹，为霖为旱，起风起雨，千奇百怪，变化莫测，皆非予之所志也。 得非以天一以清，地一以宁，时维朱明，炎帝持衡。",
      "translated_text": "**The Diagram of the Seventy-Two Seasons**\n\nYúnfēng annotates *The Secret Speeches of the Primordial Origin* thus:\n*\"Vague and indistinct, the spirit arises from fire;\nObscure and murky, the essence forms within water.\nFire ascends in flame, sevenfold to birth the spirit;\nWater flows downward, sixfold to birth the essence.\nSeven and six transformations—above and below, they interweave.\nSpirit and essence circulate, the wondrous body enfolds the True.\nThe spirit, sevenfold transformed, generates True Fire;\nThe essence, sixfold refined, generates True Water.\nThe wondrous number of seven and six—thirty-three—\nExceeds not the water and fire of Heaven and Earth.\nThus, Heaven’s thirty-six yang seasons birth Fire,\nEarth’s thirty-six yin seasons birth Water,\nCombining seventy-two seasons to complete the Heavenly cycle.\n*The Daoist Scripture* states:\n‘Thirty-six above, thirty-six below,\nThe Great Mystery knows no bounds—\nWondrous, the *Great Cavern Scripture*!’\nYet why speak only of water and fire, not the Five Phases?\nFor water and fire are the sun and moon.\n*The Yinyufu Scripture* says:\n‘Sun and moon have their numbers, great and small have their limits—\nFrom this, the Sage’s work arises, the divine radiance emerges.\nIf one can observe above and below, mastering the Fire’s season,\nThen they align with Heaven and Earth in virtue,\nMerge with sun and moon in luminosity—\nTruly, they ascend to transcendence from the plain.’\n\n**The Diagram of the Five Phases’ Generation**\nYúnfēng says:\nThe *Taiji* divides to birth the Two Poles—Heaven and Earth.\nOnce Heaven and Earth take form, they cannot escape their cycles.\nThus, Heaven-One births Water, Earth-Two births Fire,\nHeaven-Three births Wood, Earth-Four births Metal,\nHeaven-Five births Soil—\nThe Five Phases weave the transformative pattern of Heaven and Earth,\nSo the Five *qi* shift and cycle, cold and heat alternate,\nThe Heavenly degrees unfold, clear as day.\nThus, thirty-six days of *jiǎ*, thirty-six days of *yǐ*—\nWood’s *qi* and numbers are complete;\nThirty-six days of *bǐng*, thirty-six days of *dīng*—\nFire’s *qi* and numbers are complete;\nThirty-six days of *wù*, thirty-six days of *jǐ*—\nSoil’s *qi* and numbers are complete;\nThirty-six days of *gēng*, thirty-six days of *xīn*—\nMetal’s *qi* and numbers are complete;\nThirty-six days of *rén*, thirty-six days of *guǐ*—\nWater’s *qi* and numbers are complete.\nCombining five sevens—thirty-five—\nWe calculate three hundred fifty days, plus two and a half ten days,\nTotaling three hundred sixty days—\nThus, the year’s twelve months align without discrepancy.\nThe remaining degrees of Heaven can be accumulated through intercalary months,\nTo shape the myriad transformations of the cosmos.\nYet humans, the most enlightened of all things,\nAre blind to the Five Phases’ operations,\nSeeing only day and night’s cycle, the four seasons’ succession,\nUnaware that the Five Phases’ transformations truly govern the profound—\nAh, the wondrous!\n\n**Yúnfēng’s Preface to the *Pharmaceutical Mirror* Annotation**\nComposed by *Lǐu Yuángàng*, Left Historiographer, Palace Attendant, and Imperial Petitioner,\nFor *Xià Zōngyǔ*, whose bold and unconventional strategies\nServed in the imperial bureaucracy, then transferred to frontier outposts,\nWhere fate’s oddities left him unpaired.\nHe wandered freely, seeking the arts of flying ascension and return,\nAnd so, through silent transmission, presented this annotated scroll to me.\n\nOnce, Su Dongpo said of An Qigeng: *\"In his age, he was known as a transcendent.\"*\nYet Sima Qian wrote: *\"Qióu Tōng, a skilled man from Qi, knew An Qigeng,\nWho used strategy to seek audience with Xiàng Yǔ.\nYǔ could not employ him, intending to bestow titles—\nBoth refused and fled.\"*\nEach time I read this, I cannot help but lay down my book and sigh:\nIf not such men, then who are the transcendent?\n\nThus, the scholars of the Warring States—like Lǔ Zhònglián and Yú Qīng—\nWere they not those who attained the Way?\nYú Qīng, unwilling to see Wei and Qi destroyed,\nSlipped away to Zhào, then fell into poverty in Lǐang, losing his chancellor’s post,\nAnd in despair, wrote his *Book*.\nQióu Tōng’s arguments went unheeded, so he feigned madness as a shaman,\nEscaped to Hóngkè, and composed his own treatise—\nWas this not mastery of the Way?\nHe refused office, upholding lofty principles,\nDebating the harm of the Wei and Qin emperors,\nResigning from his post as governor of Liáochéng.\nWhen offered gold to extend his life, he said:\n*\"What the world values in its worthies\nIs their ability to resolve calamities, alleviate hardships,\nDissolve strife—without seeking personal gain.\nIf they do seek gain, it is the merchant’s trade, which I cannot bear.\"*\nWhen offered nobility, he fled, saying:\n*\"I would rather be poor and scornful of the world,\nThan rich and noble, bowing to others.\"*\nAh! Only one like Lǔ Zhònglián could be called transcendent.\nAn Qigeng’s recorded in histories and scattered notes—\nSeeming fabulous, ungrounded.\nYet if he were like Lǔ Zhònglián, spitting a rainbow,\nOr like the mighty who lift the cauldron—\nBoth accounts are grossly mistaken.\nHis lingering legacy is but a fleeting trace.\nNow I understand: worldly scholars, when detached, may ride the dragon—\nThis is the truth.\n\nZōngyǔ’s annotations on the *Three Golden Books*\nSurpass the mundane, solidifying beyond the *Eight Immortals’ Precepts*,\nPiercing satire and political maneuver—\nThese are the writings of Lǔ Zhònglián and An Qigeng.\nAs for Yú Qīng and Qióu Tōng, mere strategists—\nHow can they compare with these two?\n\n**Written on the fifth day after the Winter Solstice, Bǐngxū of the Bǎobǎo era,\nBy Qīngyuān, the Hermit of Yúncūn Mountain.**\n\n**Yúnfēng’s Continuation**\n*\"Summer’s peaks are rich with strange formations\"*—\nA phrase the Jin poets treasured.\nI, with my illusory nature, adopt this illusory name—\nTruly, adding feet to a snake, a neck to a duck.\nPerhaps some will mimic Sima Qian’s fondness for the strange,\nOr steal the poet’s clever phrases,\nTo display themselves.\nAlas, summer is one of the four seasons,\nClouds are but *qi*—\nWhere do the peaks arise? Where does the strangeness come from?\nEmerging from the mists without intent,\nRiding the dragon without trace,\nBringing rain or drought,\nStirring wind or rain—\nThousands of oddities, countless transformations,\nUnfathomable, beyond measure—\nNone of this is my aspiration.\nIs it not that Heaven-One brings clarity,\nEarth-One brings tranquility,\nThe season is now the Vermilion Emperor,\nAnd the Flame Sovereign holds the balance?",
      "overlap_context": "Buddhist** practice of tethering the horse to the **chūn tree**,\nor tethering the donkey to the **ruò stake**,\nalso conveys this meaning.\nBut their rigid adherence to the **good path of death**,\nstubbornly facing the wall,\ncannot make the crow fly or the magpie cross—\nthus, they fall into the second category.\n\nYet their original method was not so.\nAlas, later descendants strayed.\n\nThe details appear in the **Diagram of the Three Teachings as One**.\n\n---\n**The Diagram of the Seventy-Two Seasons**",
      "start_char": 11489,
      "end_char": 12734,
      "start_sentence": 524,
      "end_sentence": 579,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 19.270102500915527,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经讲义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "好风自南，盾日如蒸，火伞炽张，金石流凝。 是云非气，是峰非形。 洞洞天君，聚精会神。 明堂丕阐，端拱紫庭。 赫奕丁公，煅炼金晶。 昆仑勃郁，玉井泓澄。 太一灶暖，偃月炉荧。 徊风混合，霹雳铿轰。 上通天窍，下彻玄冥。 罗卫四兽，左右六丁。 周天数足，九转飞升。 云峰此时，曷独奇名？ 渊哉大道，天地德并。 元始祖炁，阴阳未分，孰为重浊？ 熟为轻清？ 鸿蒙剖判，生天地人，上覆下载，人为最灵。 运化亭毒，劫劫长存。 乌飞兔走，悬象双明。 弦望晦朔，一遇三旬。 胡然九夏，云独峰呈。 庚将三伏，火必西奔。 金丹玄妙，以火为神。 云腾火气，峰幻神形。 烹坎离髓，夺乾坤精。 阴邪潜消，纯阳乃成。 天地相毕，出死入生。 云峰之奇，不可思议。 非夫真一，孰抉其秘？ 或者无语，徒惊曰异。 乃知儒失之拘，释失之滞，道等太虚，中有根蒂。 天地广大，道能生之； 万物散殊，道能长之； 日月东西，道能运之； 是云为峰，道实得之。 吾见其一真不动，擒纵百灵，二气周交，生成万有。 不知其云者峰乎，峰者云乎。 故七返九还者，此云峰也； 八归六居者，亦此云峰也； 玄珠成象者，此云峰也； 而真人出现者，亦此云峰也； 玄哉妙哉，是岂诗句之奇可得而形容哉？ 斗城夏元鼎记。 云峰自序 动乱为业根，静定为药镜，此崔公之法言也。 岂非以人之有生，四大假合，涕唾精津血气液，无非阴邪； 酒色名利贪嗔痴，无非纷扰，惟一药镜之静定能摄伏之。 何谓药？ 丹砂木精得金乃并是也。 何谓镜？ 灵明真觉、回光返照是也。 故圣人以神道设教，以日月为易； 仙道以神明为宗，以日月为丹； 释氏之杖挑日月、宗性传灯者，皆是物也。 崔公慈悲接物，善于托喻，故吕洞宾谓：因看崔公入《药镜》，令人心地转分明。 信为天人之师也。 予三阅藏教，凡得《药镜》七本，其文各不同，此经总二百四十三字，言简理当，如《太上》之秘奥，《春秋》之正经，微显阐幽，探赜索隐，靡有余义，真金丹之枢辖也。 偶菖节，过八宝，憩于彭忠甫左塾，因其灶香问道，谩为下一注脚以贻当世。 明眼君子并寄豫章灵源子胡季辙、天台元漠子王和甫，皆学仙弟子也。 夏元鼎序。 后序",
      "translated_text": "「Peaks of the Dao’s Record\n\n　　A fine wind from the south,\n　　The sun’s shield blazes like a steaming cauldron,\n　　The Fire Sovereign’s canopy burns fiercely,\n　　Gold and stone melt into congealed essence.\n　　These are not mere *qi*—they are clouds,\n　　These are not mere forms—they are peaks.\n　　The Lord of the Celestial Caverns,\n　　Gathers essence and concentrates spirit.\n　　The Hall of Illumination expands grandly,\n　　The Sovereign of the Purple Court sits upright and serene.\n　　The radiant and illustrious *Ding Gong*,\n　　Refines and tempers the golden essence.\n　　Kunlun rises in vigor,\n　　The Jade Well brims with clarity.\n　　The Supreme One’s furnace glows warm,\n　　The Crescent Furnace flickers with light.\n　　The *Huan* winds blend and swirl,\n　　Thunderclaps and lightning clash in resounding fury.\n　　Ascending to the celestial apertures,\n　　Descending to the abyssal depths.\n　　The Four Beasts of Luo and Wei,\n　　The Six *Ding* on either side.\n　　The revolutions of the *Zhou Tian*,\n　　Nine transformations, soaring aloft.\n　　At this moment of clouds and peaks,\n　　Why should they alone bear the name of strangeness?\n　　Profound indeed is the Great Dao,\n　　The virtue/power of Heaven and Earth coalesce.\n　　Before the Ancestor of the Primordial *Qi*,\n　　When yin and yang were yet undivided,\n　　Who could be the heavy turbid?\n　　Who the light and pure?\n　　When *Hongmeng* carved the distinction,\n　　Life gave rise to Heaven, Earth, and Man,\n　　Above covering, below embracing—\n　　Man is the most refined and responsive.\n　　The *Yunhua* stands firm and poisonous,\n　　Yet persists through endless *jie*—\n　　The black flies, the white rabbits,\n　　The suspended symbols, twinly bright.\n　　The waxing and waning of months and days,\n　　A single encounter spans three decades.\n　　Sudden and unaccountable—\n　　Nine summers pass, yet only these clouds display their peaks.\n　　When *Geng* approaches the Three Scorching,\n　　Fire must rush westward.\n　　The Golden Elixir’s mysteries,\n　　Fire as its divine essence.\n　　Clouds ascend as fiery *qi*,\n　　Peaks materialize as spiritual forms.\n　　Boiling in the *Kan* furnace, refining the marrow of *Li*,\n　　Plundering the essence of *Qian* and *Kun*.\n　　The insidious yin vanishes,\n　　Pure yang emerges.\n　　Heaven and Earth complete their union,\n　　Life triumphs over death.\n　　The strangeness of clouds and peaks—\n　　Unthinkable, beyond conception.\n　　Who but the True One could unlock their secrets?\n　　Perhaps some remain speechless,\n　　Only startled to call it marvelous.\n　　Now it is known:\n　　The Confucianists err in rigidity,\n　　The Buddhists in stagnation,\n　　The Daoists equal the Great Void—\n　　Yet within it lies the root and stem.\n　　Heaven and Earth vast and boundless,\n　　The Dao gives them birth;\n　　All things scatter and differentiate,\n　　The Dao sustains them;\n　　The sun and moon traverse east and west,\n　　The Dao sets them in motion;\n　　These clouds become peaks,\n　　The Dao truly attains them.\n　　I perceive the One True and Unmoving,\n　　Seizing and releasing all spirits,\n　　The two *qi* revolving in harmony,\n　　Generating all existence.\n　　Who knows if these are clouds or peaks?\n　　Thus, the Seven Returns and Nine Reversions,\n　　Are but these clouds and peaks;\n　　The Eight Return and Six Residence,\n　　Are likewise these clouds and peaks;\n　　The Primordial Pearl forming its symbol,\n　　Is but these clouds and peaks;\n　　And when the True Person appears,\n　　It is also these clouds and peaks.\n　　Profound! Mysterious!\n　　How could these be mere poetic phrases to be described?\n\n　　Recorded in the Summer of *Dou Cheng* by *Xia Yuan Ding*.\n　　Autobiographical Preface of Clouds and Peaks\n\n　　Disturbance as the root of one’s profession,\n　　Serenity as the mirror of medicine—\n　　This is the lawful speech of *Cui Gong*.\n　　Is it not that man’s existence,\n　　The Four Great Elements in borrowed unity,\n　　His tears, saliva, semen, vital breath, and blood—\n　　All are but yin’s insidiousness?\n　　Wine, lust, fame, and gain—\n　　Greed, anger, and delusion—\n　　All are but chaos.\n　　Only the medicine’s mirror of serenity and stillness\n　　Can subdue and govern them.\n\n　　What is meant by *medicine*?\n　　It is the cinnabar, mineral essence, and wood essence\n　　Obtaining gold and merging as one.\n\n　　What is meant by *mirror*?\n　　It is the luminous clarity of true awareness,\n　　The radiance that reflects light and returns vision.\n\n　　Thus the Sage teaches through the *Dao of the Spirit*,\n　　And uses the sun and moon as the *I Ching*;\n　　The Immortal Way takes enlightenment as its core,\n　　And uses the sun and moon as elixir;\n　　The Buddhist’s staff that prods the sun and moon,\n　　The transmission of nature through the lamp—\n　　All are but material things.\n\n　　*Cui Gong*’s compassion and mercy extend to all,\n　　His skill in allegory is unmatched.\n　　Thus, *Lü Dongbin* said:\n　　*\"Because of observing Cui Gong’s entry into the* **Yao Jing***,*\n　　*It makes one’s heart and mind turn clear.\"*\n\n　　Indeed, he is the teacher of both Heaven and Man.\n\n　　I have thrice perused the teachings of the *藏 (藏教, Zangjiao—Buddhist canon)*.\n　　Of the seven copies of the *Yao Jing* I obtained,\n　　Their texts all differ.\n　　This scripture totals **243 characters**,\n　　Its brevity matches its profundity—\n　　Like the *Taoist Canon’s* hidden mysteries,\n　　Like the *Spring and Autumn Annals’* rectified essence,\n　　It reveals the subtle and explores the profound,\n　　It delves into the abstruse and uncovers the hidden—\n　　No meaning is left unexplored,\n　　It is indeed the pivot of the Golden Elixir.\n\n　　On the occasion of the *Changjie* (菖节, a Daoist festival),\n　　Passing through the Eight Treasures (八宝, likely a place or sect),\n　　Resting at the left study of *Peng Zhongfu*,\n　　I questioned him about the furnace incense,\n　　And carelessly added this footnote\n　　To leave a legacy for the present age.\n\n　　To the enlightened gentlemen of *Yuzhang*—\n　　*Hu Ji Zhe* (灵源子胡季辙, \"Bar Season of the Spirit Source\"),\n　　And *Wang Hefu* (天台元漠子王和甫, \"Harmonious Master of the Primordial Mist\"),\n　　Both disciples of the Immortal Way—\n　　I dedicate this.\n\n　　Sequential Preface by *Xia Yuan Ding*.\n　　Postscript」",
      "overlap_context": "s one of the four seasons,\nClouds are but *qi*—\nWhere do the peaks arise? Where does the strangeness come from?\nEmerging from the mists without intent,\nRiding the dragon without trace,\nBringing rain or drought,\nStirring wind or rain—\nThousands of oddities, countless transformations,\nUnfathomable, beyond measure—\nNone of this is my aspiration.\nIs it not that Heaven-One brings clarity,\nEarth-One brings tranquility,\nThe season is now the Vermilion Emperor,\nAnd the Flame Sovereign holds the balance?",
      "start_char": 12734,
      "end_char": 13574,
      "start_sentence": 580,
      "end_sentence": 639,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 21.029778718948364,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经讲义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "修职郎新处州州学教授王九万撰 李邺侯七岁能文，读书万卷，已乃衣道士衣，学神仙学，若将终身。 惟懒残勘破曰：无多语，领取十年宰相。 其后侯谋人国，智略辏不下张子房。 世言方外士，必遗世绝物，然欤否耶？ 意有道者特以此为陈迹，而非所以迹耳。 永嘉夏云峰，少由童子郎振策场屋，遍从诸大老游。 长出入兵间，以功得赏，驱驰于山东、河北。 登日欢拜孔林，以充大其胸中浩然之气。 视世间物无足当其意，遂弃官学道。 一日，出所注三书，使下走望洋向若是也。 乌足以知之然？",
      "translated_text": "Professor Wang Jiuwàn of the New Prefecture of Xinzhou’s School,\n*Modifying Official Duties*:\n\nLi Yèhóu, at seven years old, was already skilled in letters,\nhaving read ten thousand volumes.\nYet he then donned Daoist robes,\nand devoted himself to the study of the Immortal Way,\nas if to make it his lifelong pursuit.\n\nOnly the careless and reckless could dismiss this, saying:\n*\"No need for idle words—just take the post of Chancellor for ten years.\"*\n\nLater, the Marquis plotted to serve his country,\nand his wisdom and strategy were not inferior to Zhang Liang.\nThe world speaks of those beyond the square—\nmust they indeed abandon the world and sever all ties?\nIs this so, or not?\n\nThose who follow the Dao merely use such detachment as a stepping-stone,\nnot as their final destination.\n\nIn Yongjia, Xia Yunfeng,\nas a youth, rode through the examination halls with his young scholar’s whip,\nvisiting all the great masters.\nLater, he moved among military camps,\nearning rewards through merit,\nand galloped across Shandong and Hebei.\nHe ascended the sunlit mounds to pay homage to Confucius’ grove,\nthus swelling the vast and unyielding *qi* within his breast.\n\nSeeing the world’s affairs as unworthy of his ambition,\nhe resigned his office and took up the Dao.\nOne day, he presented his annotated *Three Books*,\nand sent a messenger to gaze upon them—\nas if to say, *\"What is there to understand beyond this?\"*\nHow could one truly grasp it?",
      "overlap_context": "easures (八宝, likely a place or sect),\n　　Resting at the left study of *Peng Zhongfu*,\n　　I questioned him about the furnace incense,\n　　And carelessly added this footnote\n　　To leave a legacy for the present age.\n\n　　To the enlightened gentlemen of *Yuzhang*—\n　　*Hu Ji Zhe* (灵源子胡季辙, \"Bar Season of the Spirit Source\"),\n　　And *Wang Hefu* (天台元漠子王和甫, \"Harmonious Master of the Primordial Mist\"),\n　　Both disciples of the Immortal Way—\n　　I dedicate this.\n\n　　Sequential Preface by *Xia Yuan Ding*.\n　　Postscript」",
      "start_char": 13575,
      "end_char": 13797,
      "start_sentence": 640,
      "end_sentence": 651,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 4.2120819091796875,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经讲义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "窃闻先训九万之曾王父殿撰公讳子献，宣和间尝偕吕元直丞相、霍安国尚书三人衔命漕燕。 是时降虏郭药师、刘舜仁、张令徽辈包藏不测，三使者同衔上章乞弃燕，忤大阖谭稹，各落职不得去。 黠虏愈张，三使者极力堤虞，每夕不寐，曾王父因是得以神守气之术，其后寿八十九，无疾而终。 前一日，尚呼灯作小楷以复李伯纪丞相，中间颜夷仲门下尝间以书，曾王父为言人知气为体之充，而不知以神御气，则神与气相离而不相守，非养生之善者。 夫以神御气者，在于正心诚意，宴坐而数出入息。 盖息者，气也。 数之者，神也。 气犹马，神犹驭，以神驭气之出入而不相离，则可以长生矣。 《庄子》曰：真人之息以踵，众人之息以喉。 夫息不于喉而在丹田气海中，能不以思欲干其神，不以蹶趋动其气，绵绵然数之，以至于不可胜数，自浅而之深，自粗而之微，自有而入于无，则和气充塞于顶踵之间，不知气之为神，神之为气，其妙有不容言者矣。 是几于坐忘者欤？ 至其助以经伸按摩之术，自亦无害，在乎不倦而已。 晦翁先生尝曰：此胎息法也，然亦《参同契》之绪余耳。 又孰若云峰金丹三书超然自应，显化通神，灵明妙用者哉？ 虽然，云峰发身于童子，而得道于衡山，又十余年颉颃兵间，其与邺侯之事异世同辙。 今圣天子寤寐不凡之士，共起治功，云峰其以邺侯之心为心，为国家了中原，而后访子房未迟也。 宝庆丁亥武夷山人序。",
      "translated_text": "「I have heard that the venerable ancestor, the late **Zeng Wangfu** (曾王父), who compiled the *Nine Classics* (先训九万) and bore the posthumous title **Zi Xian** (公讳子献), once accompanied the Chancellor **Lu Yuanzhi** (吕元直) and the Minister **Huo Anguo** (霍安国) in the **Xuanhe era** (宣和间), jointly undertaking the mission of transporting grain to **Yan** (燕).\n\nAt that time, the rebellious **Pei** (降虏) captives such as **Guo Yaoshi** (郭药师), **Liu Shunren** (刘舜仁), and **Zhang Lingwei** (张令徽) harbored hidden treachery. The three envoys, bearing the same commission, submitted a memorial pleading to abandon **Yan**, defying the **great** and **obstructive** **He** (大阖) and **Tan** (谭稹), and were all dismissed from office, unable to depart. The cunning of the **Pei** captives grew bolder, and the three envoys exerted every effort to defend and protect the realm, often staying awake through the night. **Zeng Wangfu**, through this ordeal, mastered the art of **nurturing one’s vital essence and guarding one’s *qi*** (神守气之术). Later, he lived to the age of eighty-nine, dying without illness.\n\nThe day before his passing, he still called for a lamp and wrote in small script to respond to Chancellor **Li Bojiji** (李伯纪). Among his disciples, **Yan Yizhong** (颜夷仲) once privately asked him about the matter. **Zeng Wangfu** replied that people often knew how to fill their bodies with *qi* but did not know how to use their vital essence to govern it. If the essence and *qi* were not harmonized and mutually guarded, this was not a true method of **nurturing life** (养生之善者).\n\nThe method of **governing *qi* with one’s essence** (以神御气) lies in **rectifying the heart and sincerely cultivating intention** (正心诚意), and in **quiet sitting while counting breaths** (宴坐而数出入息). For breath is *qi*, and counting is the essence. *Qi* is like a horse, the essence like its driver. If one uses the essence to guide the *qi* in its ebb and flow without separation, then one may achieve **longevity** (长生).\n\nThe *Zhuangzi* (《庄子》) states:\n*\"The breath of the True Person (真人) fills to the heels,\nwhile that of the common man fills only to the throat.\"*\n\nIf breath is not confined to the throat but instead dwells in the **elixir field and sea of *qi*** (丹田气海), one can avoid disturbing the essence with thoughts and desires, or agitating the *qi* with restless movements. Counting breath **continuously and subtly** (绵绵然数之), to the point where it becomes innumerable, progressing from shallow to deep, from coarse to refined, from presence to absence—then **harmonious *qi* permeates from crown to sole** (和气充塞于顶踵之间), and one cannot distinguish *qi* from essence, nor essence from *qi*. Its subtlety transcends all speech.\n\nIs this not akin to the **state of seated oblivion** (坐忘)?\nAs for his supplementary use of **classical Daoist techniques, stretching, and massage** (经伸按摩之术), it is also harmless, provided one does not grow weary of them.\n\n**Huanglong Master** (晦翁先生) once remarked:\n*\"This is the method of embryonic breath (胎息法), though it is but a remnant of the teachings in the *Shen Tong Qi* (参同契).\"*\n\nAnd who could surpass **Xia Yunfeng** (夏云峰) in his **alchemical and Daoist works** (金丹三书), which **transcend the ordinary** (超然自应), **manifest transformations** (显化通神), and **illuminate profound and subtle applications** (灵明妙用)?\n\nThough **Xia Yunfeng** began his cultivation as a youth, he attained the **Dao** (得道) on **Hengshan** (衡山), and spent over a decade in the tumult of military affairs—his path differed from **Yi Hou** (邺侯) yet mirrored his in the same era. Now, under the **awakened and extraordinary** (寤寐不凡) reign of the **sage emperor** (圣天子), those who rise to **achieve great deeds** (治功) should take **Yi Hou’s resolve** (邺侯之心) as their own. Let them **settle the Central Plains** (了中原) for the state, and then seek **Zi Xian** (子房) without delay.\n\nA preface by a **scholar of Wuyi Mountain** (武夷山人), written in the year **Dinghai of the Baocheng era** (宝庆丁亥).」",
      "overlap_context": "among military camps,\nearning rewards through merit,\nand galloped across Shandong and Hebei.\nHe ascended the sunlit mounds to pay homage to Confucius’ grove,\nthus swelling the vast and unyielding *qi* within his breast.\n\nSeeing the world’s affairs as unworthy of his ambition,\nhe resigned his office and took up the Dao.\nOne day, he presented his annotated *Three Books*,\nand sent a messenger to gaze upon them—\nas if to say, *\"What is there to understand beyond this?\"*\nHow could one truly grasp it?",
      "start_char": 13797,
      "end_char": 14345,
      "start_sentence": 652,
      "end_sentence": 668,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 13.702324390411377,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经讲义.txt",
        "category": "藏外"
      }
    }
  ]
}