{
  "source_id": "阴符经解",
  "source_file": "chunked_daozang\\阴符经解.json",
  "total_chunks": 5,
  "total_original_chars": 4667,
  "total_translated_chars": 31057,
  "total_translation_time": 75.6430389881134,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\藏外\\阴符经解.txt",
    "category": "藏外"
  },
  "full_translation": "**Pinjing Siku Quanshu**\n**Zibu (Classics Section) – Fourteen: *Yinfu Jing Jie* (Commentary on the *Yinfu Classic*)**\n**Daoist Category**\n\n**The Imperial Editors humbly note:**\nThe *Yinfu Jing Jie* (Commentary on the *Yinfu Classic*) in one scroll, attributed in old editions to Huangdi (the Yellow Emperor), with annotations by Taigong (Duke Zhou), Fan Li, Guiguzi, Zhang Liang, Zhuge Liang, and Li Kui—six schools in total. The *Chongwen Zongmu* (Comprehensive Catalogue of the Palace Library) records a *Yinfu Jing* preface in one scroll, unattributed to any dynasty, compiled after Taigong, with six subsequent commentators on the *Yinfu Jing*, including Huiguang’s descendants, appended. This appears to be the same work, though its transmission is now lost.\n\nMaster Chao Gongwu’s *Dushu Zhi* (Record of Books Read) cites Huang Tingjian’s remark that the *Yinfu* blends military strategy with absurd attributions to sages like Zhang Liang and Zhuge Liang. Thus, this edition’s annotations are the most ancient.\n\nThe *Sui Shu Jingji Zhi* (Sui Book of Libraries) lists *Taigong Yinfu* (Duke Zhou’s *Yinfu*) in one scroll and *Zhou Shu Yinfu* (Zhou Dynasty *Yinfu*) in nine scrolls, neither attributing it to Huangdi. Only in the Tang did Li Kui claim to have obtained this text from the Tiger’s Mouth Cave on Mount Song, inscribed by Wei Daoist Fang Qian, who transmitted it to sacred mountains but failed to elucidate its meaning. Later, on Mount Li, he encountered an old woman who taught him its secrets—yet the account is fantastical and untrustworthy. Hu Yinglin’s *Bicong* (Brush Talks) argues that the *Yinfu* Su Qin studied was this very text. Though the book itself is not spurious, its attribution to Huangdi is Li Kui’s fabrication. The *Zhan Guo Ce* (Strategies of the Warring States) explicitly records Su Qin discovering the *Taigong Yinfu*, and successive dynastic bibliographies classify the *Zhou Shu Yinfu* under military strategy while the *Huangdi Yinfu* under Daoism—sufficient evidence to distinguish the two texts. Hu Yinglin’s forced connections are baseless.\n\nAs for the claim that in the early Yonghui era of the Tang, Chu Suiliang copied a hundred volumes, the *Zhengming Shiting* (Stopping Cloud Studio Calligraphy) edition of Chu’s small-character *Yinfu Jing* indeed bears this note at its end. Yet Chu’s calligraphy appears in Mi Fu’s *Shuishi Baozhang* (Treasure of Calligraphic History) and the *Xuanhe Shupu* (Book of Calligraphy of the Xuanhe Era), neither of which records it. Later collectors also make no mention of it. By the mid-Ming, it suddenly emerged from Zheng Ming’s family in stone form—its authenticity remains uncertain. How then could it serve as proof of the text’s authenticity?\n\nThe editors retain this work despite its late composition because it contains profound insights, and many scholars have annotated it. The commentary includes references to a figure called \"Yin Yu\" (Emperor Yin), whose identity is unknown. The preface at the scroll’s beginning is unsigned and undated, containing phrases like *\"leaking the celestial mechanism\"* and *\"Stupid Yu, wise Yu\"*—crude Daoist jargon unworthy of serious inquiry. Only Chao Gongwu’s *Dushu Zhi* preserves Li Kui’s annotations, now missing from this edition, suggesting either scribal corruption or that this is not Li Kui’s original text.\n\n---\n**Yinfu Jing Kaoyi (Investigation of the *Yinfu Classic*)**\n**Daoist Category**\n\n**The Imperial Editors humbly note:**\nThe *Yinfu Jing Kaoyi* (Investigation of the *Yinfu Classic*) in one scroll, compiled by Song-era Zhu Xi (Master Zhu). Huang Tingjian held that the *Yinfu Jing* originated with Tang-era Li Kui, and Zhu Xi’s *Yulu* (Conversations) concurs. Yet Zhu Xi acknowledged that its profound passages could not have been authored by one unversed in the Dao. He thus collated the text, identifying the first 114 characters—*\"From the time when the foolish Yu became the sage Yu\"*—as the core scripture, based on the annotations of Chu Suiliang and Zhang [unclear].\n\nThe *Yulu* records Zhu Xi’s discussion with Lu Qiu Ci Meng, who praised the *Yinfu Jing*’s expression of *\"the natural Dao in stillness.\"* Zhu Xi declared Lu’s insight surpassed even the *Six Classics*, while Yang Daofu doubted the passage existed in the original text. Yang likely consulted the *Lishan Laomu* (Old Mother of Mount Li) edition, where the final lines read *\"I, with the times and things, refine my wisdom\"*—leading him to question whether the passage appeared in the original *Yinfu*.\n\nThe text includes an appendix by Huang Ruijie, whose citations are extensive. The *Jian’an Fu Zhi* (Gazetteer of Jian’an Prefecture) records Ruijie (style name Guanle, native of Anfu), who passed the county-level exams and served as county magistrate of Taihe before abandoning office in the late Yuan. He compiled and annotated works like the *Taiji Tu* (Diagram of the Supreme Ultimate), *Tongshu* (Comprehensive Book), *Xixing* (Western Inscription), *Yixue Qimeng* (Awakening to the Study of the *Yijing*), *Jiali Lülü Jingyi* (Essence of Rites and Music), and *Huangji Jingshi* (Scripture of the Sovereign’s Polity), among others—including, presumably, the *Cansong Qi* (Paramount Concordance) and *Shenxing* (Divine Transformation). The gazetteer omits these due to their Daoist associations. (Recorded in the 46th year of Qianlong, October, after reverent collation and submission.)\n\n**Chief Compilers:**\nMemorialist Ji Yun\nMemorialist Lu Xixiong\nMemorialist Sun Shiyi\n\n**Chief Proofreaders:**\nMemorialist Lu Feidi\n\n**Pinning the Four Treasures: Commentary on the *Yin Fu Jing***\n\n**Preface to the *Huangdi Yin Fu Jing* (The Sovereign’s *Yin Fu* with Commentary)**\n\nWhat is called *ming* is *xing* (性). *Xing* is capable of *ming* (命), yet its essence remains unfathomable; thus the Sage reveres it as the *Tianming* (天命)—fooling the common man while enlightening the Sage. Hence it is called the *Tianji* (天机), stretched yet never exhausted, slackened yet never stagnant. Behold the *Yin Fu*: its transformations lie in the hands; its life and death are at its command. Therefore the Sage conceals it in the heart, to refine and nurture the gathering and scattering of the cosmos beneath heaven, unseen in its traces—this is the *Tianji*.\n\nThus the Yellow Emperor attained it and ascended to rule the world; Tang and Wu gained it and became kings; the Five Hegemons secured it and united the feudal lords. Yet, *to be the subject and master the Way is difficult*—not to be taken lightly. The Duke of Zhou was ninety before he met his fate; it was not that he did not encounter the *Yin Fu*, but rather that he discerned his master’s nature. If a wise man were to wield it, even carving stone as sovereign or wood as ruler, he could still enjoy the world.\n\nIf the subject exhausts his virtue while the master grows fearful, possessing the *Yin Fu* is indeed difficult! Alas, without a virtuous ruler, the righteous scholar dies alone, refusing to serve. Better to scatter one’s resolve in mountain caves, nourishing life while awaiting the rise of the worthy—those who see Confucius as unlucky and Qin Yi as fortunate are mistaken. The Way lies in establishing the cosmos; how can one idle the heart and stoop to petty schemes?\n\nA true man would scorn such folly. Alas, later generations’ heroes and sages, discerning and applying it, saw Rang Li flourish through weighty resolve while Wen Zhong perished from recklessness. Did they not fear squandering the *Tianji*? The Sage hides such truths in sacred peaks, passing them to kindred spirits, lest the unworthy seize and misuse them. The first chapter reveals the Dao of observing Heaven, seizing its patterns, and exhausting its workings.\n\nThe Duke of Zhou said: Heaven has five thieves (*Wu Ze* 五賊)—one who steals *ming* (命), one who steals *wu* (物), one who steals *shi* (時), one who steals *gong* (功), and one who steals *shen* (神).\n- Stealing *ming* with one act consumes the world’s use of it for flavor.\n- Stealing *wu* with one act hastens the world’s use of it for profit.\n- Stealing *shi* with one act betrays the world’s trust in it for reversals.\n- Stealing *gong* with one act sows resentment where the world expects gratitude.\n- Stealing *shen* with one act distorts the world’s perception of it as small or great.\n\nYu Ji said: Of Heaven’s five thieves, none is more destructive than stealing *shen*. One takes the small to destroy the great—Heaven and Earth cannot thwart this, let alone man!\n\nGuan Yu remarked: The Yellow Emperor seized the thief of *ming*, ascending in broad daylight. The Shang and Zhou dynasties seized the thief of *shen*, using the small to vanquish the great. Guan Zhong seized the thief of *shi*, uniting the feudal lords in nine alliances. Fan Li seized the thief of *wu*, conquering the South and becoming hegemon. Zhang Liang seized the thief of *gong*, defeating the mighty Chu.\n\nThe five thieves lie within the heart, their application extending to Heaven. The cosmos is at one’s command, and myriad transformations arise from the body. The Duke of Zhou said: The Sage calls them five thieves; the world names them five *De* (德). Man feeds on the five flavors and lives; man feeds on the five flavors and dies. Yet none abandon them without grievance—this is the nature of the heart’s craving.\n\nYu Ji said: Stealing *ming* can lead to eternal life. The Yellow Emperor, when a maiden’s *jing* (精) and *qi* (氣) moved him, also saw the world’s things thus. Even winter grasses, covered and left untouched, do not die—expose them, and they wither. Plants and trees, rooted in nature, endure such trials; how much more so man, the most refined of all things, whose essence is that of a maiden’s *jing* and the timing of *shi*!\n\nBo Changzi said: This is the accumulation of fire to burn the Five Toxins (五毒)—the Five Toxins are the Five Flavors. Exhausting the Five Flavors can lead to eternal life.\n\nGuan Yu remarked: Man lives and dies through the Five Flavors. Each flavor has its master—harmonizing with it brings life; opposing it brings destruction. Prolonged indulgence accumulates *qi*, steeping and corrupting the five *zang* organs until they perish. Thus later generations cannot fulfill their natural lifespan—it is because of their excessive craving for life!\n\nTherefore, the Supreme Dao is serene, nurturing *taixi* (胎息) without indulgence. The arts of immortals and transcendent beings, though numerous, center on embracing unity and guarding the middle. The techniques of maidenly cultivation, though many, focus on returning *jing* (精) and adopting *qi*. The arts of elixirs, though countless, hinge on *shen shui* (神水) and the *Huaxi* (華池). The arts of governance, though myriad, depend on purity and self-transformation. The arts of warfare, though varied, rest on *qizheng* (奇正) and strategic maneuvering. These five arts—when rolled up and hidden in the heart, when applied to the spirit, when spread across Heaven, when given to Earth—can make the cosmos rise and fall in an instant, all at man’s command.\n\nThe Yellow Emperor attained them and first established the Three Palaces (三宮), then pacified the myriad states. The Cauldron of Destiny (鼎) was completed, and he tamed the Dragon, ascending to Heaven.\n\nHeaven’s nature is man’s nature; man’s heart is the *Tianji*. Establishing Heaven’s Dao determines man’s fate.\n\nYu Ji said: This is the Dao of establishing Heaven and determining man—it lies in the five thieves. When Heaven’s killing intent is unleashed, dragons and serpents rise. When man’s killing intent is unleashed, Heaven and Earth overturn.\n\nFan Yu said: In ancient times, Yi Yin served the Shang and released Heaven’s killing intent. The command to conquer Xia was fulfilled, and the response was swift—thus the eastern expedition against the Western Barbarians and the southern against the Northern Di. The Duke of Zhou said: Three years without tilling the fields brought great drought; ten years without digging wells caused the earth to collapse, killing tens of thousands. Violent winds and storms arose.\n\nYu Ji said: According to the records, when Chu’s armies slaughtered tens of thousands of Han soldiers, the sun vanished and day turned to night—Heaven and Earth seemed to overturn. The killing intent of Heaven and man converged, giving rise to myriad changes and fixed foundations.\n\nZhang Liang said: From this single act of trust, all trust is born—thus the foundation of myriad changes is established.\n\nGuan Yu said: Within the heart’s desires, there is no outward expression—this is called *Qi* (启). External evils do not penetrate—this is called *Bi* (闭). *Qi* is the thief’s intent, hard to discern like darkness, unmoving like a mountain. The thief’s cunning nature makes men unguarded, allowing them to be glimpsed.\n\nThe evils of the nine orifices (九窍) lie in the three *Yao* (要)—movement and stillness can be controlled.**\n\nThe Master Taigong said: The three *Yao* (critical points) are the ears, eyes, and mouth. The ears can be pierced and sealed, the eyes can be bored through, and the mouth can be made sharp yet speechless. When raising armies and mobilizing the masses, ten thousand soldiers will not dare to speak out. Its brilliance lies in whether one can move or still these three *Yao*.\n\nThe strategist said: Two leaves covering the eyes cannot hide Mount Tai; a single bean blocking the ears cannot drown out thunder. A single peppercorn brushing the tongue cannot silence speech. If all nine orifices are filled with evil, they are insufficient to discern changes in opportunity. What matters lies in these three: spirit, heart, and will. When opportunity moves, the spirit follows it. When opportunity is about to manifest, the heart plans for it. When opportunity arises and action is taken, the will decides it.\n\nWhen opportunity moves, it aligns with the Yang—even the Five Mountains cannot contain its corners, and the Four Seas cannot confine its boundaries. When opportunity is still, it aligns with the Yin—even wise men cannot manipulate its splendor, and deep wisdom cannot fathom its schemes. Heaven and Earth cannot alter its timing, let alone man.\n\nFire arises from wood; when it ignites, it consumes the wood. Treachery arises within the state; when it flourishes, the state perishes. Wood hides fire within it—fire begins in formlessness. The state hides treachery within it—treachery begins in no visible shape. Only the most sagely cannot cultivate self-restraint to prevent the fire of treachery from igniting. Thus, the state will have no military disasters nor calamities of misfortune.\n\nWith Ji Zi fleeing and bound in deerskin, Shangrong Yu imprisoned and Shao Shu weeping in the middle section—this is the Way of Heaven’s creation and destruction.\n\nZhang Liang said: Opportunity arises from the heart, like Heaven’s creation and destruction. Those who live believe they have secured their fate; those who die believe they have met their end.\n\nHeaven and Earth, along with all things, are thieves—stealing from all things through decay and old age. All things and man’s adornments are thieves—stealing from man through arrogance and excess. Man and the highest tools of all things are thieves—stealing from all things through ruin and destruction. All this unfolds naturally, each thief fulfilling its role, the Three Powers in harmony.\n\nThus it is said: Eat in season, and the hundred limbs function harmoniously. Act at the right moment, and all transformations are secure.\n\nThe Master Guigu said: Do not let future rulers amass treasures and hoard gold and silk. If they can discard them, even emptying rivers and filling seas would be insufficient. Food is what sustains the hundred limbs—lose its season, and the limbs are harmed. Action is what secures all things—lose its opportunity, and all things are harmed. Thus it is said: The arrival of the right moment allows no pause, not even the blink of an eye. Act too early, and it is excessive; act too late, and it fails. Therefore, the virtuous guard the moment, while the unworthy cling to fate.\n\nMen know the sagely’s sagacity but not the source of their sagacity.\n\nThe strategist said: All men possess the Way, yet not all value the foolishness of the sage. Once his sagacity is revealed, his foolishness is examined, and his sagacity is seen again. Thus the classics say: If one relies solely on keen insight, matters will not succeed. If one relies solely on obscurity, all actions will fail. Balance clarity and obscurity—then the masses will follow. Yi Yin was a tavern keeper, Taigong a butcher, Guan Zhong a leatherworker, and Bai Li a soup vendor. In times of decline and chaos, men deemed them unremarkable. Yet when they encountered Tang, Wen, Huan, or Mu, their Way flourished, their sagacity shone, and their deeds moved Heaven and Earth. Men then called them supremely sagely.\n\nThe sun and moon have their cycles; great and small have their limits. From these arise sagely deeds and divine brilliance.\n\nThe Master Guigu said: Future generations will ponder this and realize that Heaven and Earth are not to be prized above man.\n\nThe strategist said: In a year of 365 days, the days have their number, the months their sequence, and the intercalary months their fixed divisions—all drawing from the essence of Heaven and Earth. Even without sagely deeds or divine brilliance, this essence exists. Even without the sun and moon, this essence exists. Thus, success does not depend on Heaven and Earth, nor does failure blame Yin and Yang.\n\nIts thievery of opportunity—none under Heaven can see or know it. The noble who grasps it secures his life; the petty man who grasps it risks his fate.\n\nZhuang Liang said: Was not Master Taigong more virtuous than Sun Wu, Han Fei, and Bai Qi? Yet the noble and petty differ in their application. The four worthies’ courage reached the point of death—yet they failed to serve their masters and were killed.\n\nThe strategist said: The master of the season, Ling Yi, was unseen by all under Heaven, yet his opportunity was known. The source of Ling Yi’s rise was unseen, yet the opportunity for the rise of a hegemon or king was known. The source of their rise was unseen. The noble who seizes the opportunity aligns with Heaven and follows man, thus securing his life. The petty man who seizes the opportunity indulges in warfare and reckless violence, thus risking his fate.\n\nThe *Classic of Changes* says: The noble acts when he discerns the opportunity, not waiting until the day is complete. It also says: To know the opportunity is divine. Opportunity is easy to see but hard to know—near yet distant.\n\n**Lower Section:**\n\nThe blind excel in hearing; the deaf excel in sight. If one extreme is abandoned, its source is cut off. If tenfold armies are used, threefold reversals of day and night will suffice. If a hundredfold armies are used, ten thousandfold reversals of day and night will suffice.\n\nYin said: Deep contemplation exhausts the subtle.\n\nZhang Liang said: Future generations will ponder this—if the ears and eyes are severed from their source, their utility is lost.\n\nThe strategist said: Man’s ears and eyes are divided by the heart and perfected by the spirit. If the heart is divided, opportunity lacks spirit. If the spirit is perfected, opportunity lacks subtlety. Thus, Shimiang was blinded yet his ears sharpened; Lijiu’s ears were sealed yet his eyes brightened. If one extreme is utilized and the other abandoned, and the heart is employed to command armies, then all actions will succeed. Retreat and reflect three times—once at dawn, once at dusk—then act. If opportunity is seized and action taken, all will succeed.\n\nTaigong said: When the eyes move, the heart responds. If what is seen is favorable, act. If not, stop. The heart is born from things and dies from things; opportunity lies in the eyes.\n\nThe strategist said: For all under Heaven, nothing is closer to opportunity than the heart and eyes. The heart can ignite opportunity; the eyes can perceive it. When Qin Shihuang made his eastern expedition, he saw the opportunity in Jianli. When Xiang Yu saw the opportunity, he told Xiang Liang: “That man can be taken and replaced.” When the Jin army reached the Huai River and the Battle of Fei, Fu Jian saw the opportunity and told Fu Rong: “They are a formidable enemy—why are there so few?” Thus, it is known: the heart’s life and death lie in things, and the eyes reveal the opportunity of success and failure.\n\nHeaven, though without favor, gives rise to great kindness. Sudden thunder and violent winds—all creatures tremble in response.\n\nThe Master said: *\"Ah, how bustling it is!\"*\nThe Duke replied: *\"Be wary and cautious to invite blessings.\"*\n\nThe Strategist said: *\"Heaven’s heart has no favor, yet all things have hearts that return gratitude to Heaven.\"*\n\nLaozi said: *\"Heaven and Earth are without virtue, treating all things as grass-dogs. The Sage is without virtue, treating the people as grass-dogs. Thus, he acts without expecting return, gives life without claiming credit. Even when sudden thunder and violent winds strike, their power reaches far and near, and all creatures tremble in fear, yet they still revere Heaven. Heaven has no coercion, yet all creatures fear it. All things, though fearing, return that fear to Heaven. The Sage, when bestowing rewards, shows no favor to those who have merited them; when punishing, no coercion to those who have erred. Thus, rewards and punishments are established from above, while awe and grace flow downward.*\n\nThe utmost joy is in nature’s abundance; the utmost stillness is in nature’s restraint. The Master said: *\"Here lies the essence of opportunity!\"*\n\nThe Strategist said: *\"Joy leads to extravagance; stillness leads to integrity. Abundance dulls the spirit; restraint clarifies it. The spirit is the fountain of wisdom. When the spirit is clear, wisdom shines. Wisdom is the repository of the heart. When wisdom is balanced, the heart is even. None can discern truth in flowing water, but all see it in still water—because it is clear and level. When the spirit is clear and the mind is tranquil, one can perceive the true nature of things. The Sage does not indulge in utmost joy nor settle in utmost stillness, but dwells in the harmony of spirit and tranquility—this is called *guarding the Middle*. Thus, worldly gains cannot seduce him, music and color cannot disrupt him, eloquent speakers cannot persuade him, the wise cannot move him, nor the brave intimidate him. He foresees calamity beyond the mountain passes and anticipates disaster in the darkest depths. Heaven itself cannot thwart him—how much less the deceptive ways of war!\"*\n\n*\"Heaven’s utmost selfishness is its utmost impartiality.\"*\n\nEmperor said: *\"Governance reaches its peak in subtlety.\"*\nThe Master said: *\"Its opportunity is so refined that even if no commands are given, the world follows it without knowing why—or defying it.\"*\n\nThe Strategist said: *\"The Way of Heaven subtly completes all things, not neglecting even the gnarled *chun* tree or the lowly *yuan* bird—great and small, long and short, each finds its place. This is its utmost selfishness. Yet it sends rain, dispatches thunder and lightning, frost and hail, balancing life and death with utmost impartiality. The Sage follows Heaven, models Earth, and nurtures the people—this is his utmost selfishness. He enforces just decrees and applies laws with precision—this is his utmost impartiality.\"*\n\nSun Wu said: *\"Treat soldiers as beloved children—you can die together. Treat them as infants—you can send them into deep ravines.\"* To love without authority is like indulging a spoiled child. Thus, one governs with ritual and disciplines with force.\n\n*\"The principle governing creatures lies in *qi*.\"*\n\nThe Duke said: *\"Does it mean the small dominate the great?\"*\nEmperor said: *\"The *qi* of things is Heaven’s mechanism.\"*\n\nThe Strategist said: *\"The *qi* of the tortoise makes it eat serpents; the *qi* of the falcon strikes hares; the *qi* of the yellow-bellied weasel devours tigers; the *qi* of flying squirrels repels monkeys; the *qi* of toads and leeches drains fish; the *qi* of wolves terrifies deer; the *qi* of cranes intimidates hawks. Sweetness and softness overcome gold; the *qi* of the *heche* chariot is inexhaustible; jade and雄黄 transform iron; there are woods that do not burn and stones that float. Even creatures and objects, when attuned to their *qi*, can let the small overcome the great. How much more so for the Sage, who harnesses *qi* and cannot fail to pacify the world and master the cosmos!\"*\n\n*\"The living are the root of the dead; the dead are the root of the living. Gratitude arises from harm; harm arises from gratitude.\"*\n\nThe Duke said: *\"Those who diminish themselves are loved; those who aggrandize themselves are slighted.\"*\n\nThe Strategist said: *\"To seek life, one must first embrace death, then life follows. To master death, one must first experience life, then death comes. The *Lüguanzi* says: 'Without death, there is no life; without destruction, there is no completion.' Sun Wu said: 'Cast them into certain death, and they will live. Drive them to despair, and they will survive.' Wu Qi said: 'The battlefield is a place of corpses. To die is to live; to hope to live is to die.' Gratitude is the source of harm; harm is the source of gratitude. Wu Zixu took vengeance on Yue for the sake of gratitude, yet it bred harm. The Zhou overthrew the Shang through harm, yet it gave rise to gratitude. Life and death, gratitude and harm—opposite yet intertwined.\"*\n\n*\"The foolish see Heaven and Earth’s patterns as omens of chaos; the Sage sees the patterns of things and times as omens of order.\"*\n\nThe Duke said: *\"Observe the timing of birds and beasts, scrutinize the changes of all things.\"*\n\nThe Strategist said: *\"When the *jing* star appears, yellow dragons descend; phoenixes soar; sweet springs emerge; fine grains grow; the rivers overflow without spilling, the seas surge without waves; the sun and moon are eclipsed; the five stars stray from their courses; the four seasons overlap; day turns to night, night to day; mountains crumble, rivers dry; winter thunder and summer frost strike. The foolish see these as Heaven and Earth’s chaotic patterns. The Sage, with tranquil rule, spreads light to the four quarters, fulfills virtuous deeds, and harmonizes the nine clans and six offices. The three affairs proceed without mutual obstruction; the hundred grains flourish; the myriad people prosper. The ruler is depraved, ministers corrupt; laws are inconsistent, taxes oppressive, governance harsh—above and below are in disarray. Noble and humble alike indulge in wine, music, towering halls, and ornate walls. The people flee, longing for chaos, blaming the ruler above. I see these as the patterns of things and times—omens of order and chaos.\"*\n\n*\"Men are foolish by nature; the Sage is not. The Sage anticipates the extraordinary; I do not.\"*\n\nThe Strategist said: *\"The hearts of the wise are profound and subtle, beyond measure. The tracks of Yu the Great were observed, yet his responses to change were boundless. His wisdom turned with opportunity, inexhaustible. How could one guess his intentions by his traces? That would be true foolishness. Thus it is said: 'Plunge into water or fire, and you court annihilation.'\"*\n\nThe Master said: *\"To govern men is to court their death; to lead an army is to court defeat. If there is no death, there is no not-dying. If there is no life, there is no not-living. Thus, one who understands death and life ensures the nation’s security.\"*\n\n*\"The Way of Nature is stillness; thus Heaven and Earth and all things are born.\"*\n\nEmperor said: *\"The utmost stillness knows not how things are born.\"*\n\n*\"The Way of Heaven and Earth is gradual; thus yin and yang prevail.\"*\n\nThe Master said: *\"The Way of Heaven and Earth is subtle and pushes toward dominance. Yin and yang interact, and their transformations follow naturally.\"*\n\nThe Master said: *\"Yin and yang interact,激至变化在于目—thus the Sage knows the Way of Nature cannot be defied and follows it accordingly.\"*\n\nThe Duke said: *\"The noble see it as Nature; the wise see it as artifice; the foolish see it as transformation.\"*\n\nEmperor said: *\"To know the Way of Nature, all things cannot defy it. Thus, one acts in accordance with it.\"*\n\n*\"The utmost stillness transcends the reach of calendars and measurements.\"*\n\nThe Master said: *\"Observe the timing of birds and beasts, scrutinize the changes of all things. Birds and beasts embody utmost stillness, beyond the grasp of calendars and measurements. Follow their mechanisms.\"*\n\n*\"Thus arise wondrous instruments, generating all phenomena. The Eight Trigrams, the Heavenly Stems, and Earthly Branches conceal divine mechanisms.\"*\n\nThe Master said: *\"The six *ji* stems are Heaven’s repository—capable of concealment.\"*\n\n*\"The arts of yin and yang’s dominance are clearly manifested in symbols.\"*\n\nBright said: *\"Wondrous instruments are the Sage’s wisdom. Heaven displays symbols; the Sage follows them. By aligning the Heavenly Stems, drawing the Eight Trigrams, consulting the *shi* and tortoise shells, and examining calendars and measurements, the divine intent and the principles of yin and yang are clearly revealed in symbols, exhaustively.\"*\n\nBright said: *\"The Eight Trigrams’ symbols are extended in application; the sixty Heavenly Stems cycle in use. The divine emerges and withdraws—all is illuminated in unity.\"*\n\nThe Master said: *\"All things and all phenomena originate from the heart. The fusion of yin and yang’s arts, the numbers of sun and moon—all are clearly manifest in the human heart. Guangchengzi said: 'The Heavenly Stems combine the nine numbers of yang. The trigrams emerge as the laws of military deployment. Military deployment moves with rhythmic order, aligning with the divine, responding to the times—this is the Way of the divine mechanism.'\"*\n\n**The Exegesis of the *Yin Fu Jing***\n\n「昭昭乎进乎象矣\n　　Bright said: *\"The wondrous instrument is the sagely wisdom—Heaven displays symbols, and the sage follows them. Pushing forward the Heavenly Stems, delineating the Eight Trigrams, divining with *shi* and tortoise shells, consulting calendars and measurements—then the divine intent is revealed, and the principles of yin and yang are made manifest in symbols, exhaustively.\"*\n\n　　Bright said: *\"The symbols of the Eight Trigrams are extended in their application; the sixty Heavenly Stems cycle in their use. The divine emerges and withdraws—all is illuminated in unity.\"*\n\n　　The Master said: *\"All things and all phenomena arise from the heart. The fusion of yin and yang’s arts, the numbers of sun and moon—all are clearly manifest in the human heart. Guangchengzi declared: 'The Heavenly Stems combine the nine numbers of yang. The Trigrams manifest as the laws of military deployment. Military deployment moves with rhythmic order, aligning with the divine, responding to the times—this is the Dao of the divine mechanism.'\"」",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "钦定四库全书　　　　　子部十四 提要 阴符经解　　　　　　道家 【臣】等谨案阴符经解一卷旧本题黄帝撰太公范蠡谷子张良诸葛亮李筌六家注崇文总目云阴符经叙一卷不详何代人叙集太公以后为阴符经注者凡六家并以惠光嗣等传附之盖即此书而佚其传也 晁公武读书志引黄庭坚称阴符糅杂兵家语又妄托子房孔明诸贤训注则是书之注以此本为最古矣 案隋书经籍志有太公阴符钤录一卷又周书阴符九卷皆不云黄帝至唐李筌始称于嵩山虎口岩得此书题曰魏道士防谦之传诸名山而未晓其义后于骊山逢老母传授微防其说怪诞不足信胡应麟笔丛乃谓苏秦所读即此书故书非伪而托于黄帝则李筌之伪考战国策载苏秦发箧得太公阴符具有明文又历代史志皆以周书阴符入兵家而黄帝阴符入道家亦足为判然两书之证应麟假借牵合殊为未至所云唐永徽初褚遂良尝写一百本者考文征明停云馆帖所刻遂良小字阴符经卷末实有此文然遂良此帖自米芾书史宝章待访录宣和书谱俱不着录诸家鉴藏亦从不及其名明之中叶忽出于征明之家石刻之真伪尚不可定又乌可据以定书之真伪乎 特以书虽晚出而深有理致故文士多为注释今亦录而存之耳 注中别有称尹曰者不知何人卷首有序一篇不署名氏亦不署年月中有泄天机者沈三劫语盖粗野道流之鄙谈无足深诘惟晁公武读书志中所引筌注今不见于此本或传写有所窜乱又非筌之原本欤 阴符经考异　　　　　道家 【臣】等谨案阴符经考异一卷宋朱子撰黄庭坚以阴符经出唐李筌朱子语录亦以为然然以其时有精语非深于道者不能作故为考定其文中自人以愚虞圣而下一百十四字皆为经文盖用褚氏张氏二注本也 语录载闾邱次孟论阴符经自然之道静数语虽六经之言无以加朱子谓闾邱此等见处尽得而杨道夫以为阴符经无此语盖道夫所见乃世传骊山老母注本以我以时物文理哲为书之末句故疑其语不见于本经也 书中有黄瑞节附录征引亦颇赅备考吉安府志瑞节字观乐安福人举乡试授泰和州学正元季弃官居尝辑太极图通书西铭易学启蒙家礼律吕精义皇极经世诸书并加释注名曰朱子成书此及参同契盖亦其中之二种志盖以其学涉道家故讳而不载云乾隆四十六年十月恭校上 总纂官【臣】纪昀【臣】陆锡熊【臣】孙士毅 总　校　官　【臣】　陆　费　墀",
      "translated_text": "**Pinjing Siku Quanshu**\n**Zibu (Classics Section) – Fourteen: *Yinfu Jing Jie* (Commentary on the *Yinfu Classic*)**\n**Daoist Category**\n\n**The Imperial Editors humbly note:**\nThe *Yinfu Jing Jie* (Commentary on the *Yinfu Classic*) in one scroll, attributed in old editions to Huangdi (the Yellow Emperor), with annotations by Taigong (Duke Zhou), Fan Li, Guiguzi, Zhang Liang, Zhuge Liang, and Li Kui—six schools in total. The *Chongwen Zongmu* (Comprehensive Catalogue of the Palace Library) records a *Yinfu Jing* preface in one scroll, unattributed to any dynasty, compiled after Taigong, with six subsequent commentators on the *Yinfu Jing*, including Huiguang’s descendants, appended. This appears to be the same work, though its transmission is now lost.\n\nMaster Chao Gongwu’s *Dushu Zhi* (Record of Books Read) cites Huang Tingjian’s remark that the *Yinfu* blends military strategy with absurd attributions to sages like Zhang Liang and Zhuge Liang. Thus, this edition’s annotations are the most ancient.\n\nThe *Sui Shu Jingji Zhi* (Sui Book of Libraries) lists *Taigong Yinfu* (Duke Zhou’s *Yinfu*) in one scroll and *Zhou Shu Yinfu* (Zhou Dynasty *Yinfu*) in nine scrolls, neither attributing it to Huangdi. Only in the Tang did Li Kui claim to have obtained this text from the Tiger’s Mouth Cave on Mount Song, inscribed by Wei Daoist Fang Qian, who transmitted it to sacred mountains but failed to elucidate its meaning. Later, on Mount Li, he encountered an old woman who taught him its secrets—yet the account is fantastical and untrustworthy. Hu Yinglin’s *Bicong* (Brush Talks) argues that the *Yinfu* Su Qin studied was this very text. Though the book itself is not spurious, its attribution to Huangdi is Li Kui’s fabrication. The *Zhan Guo Ce* (Strategies of the Warring States) explicitly records Su Qin discovering the *Taigong Yinfu*, and successive dynastic bibliographies classify the *Zhou Shu Yinfu* under military strategy while the *Huangdi Yinfu* under Daoism—sufficient evidence to distinguish the two texts. Hu Yinglin’s forced connections are baseless.\n\nAs for the claim that in the early Yonghui era of the Tang, Chu Suiliang copied a hundred volumes, the *Zhengming Shiting* (Stopping Cloud Studio Calligraphy) edition of Chu’s small-character *Yinfu Jing* indeed bears this note at its end. Yet Chu’s calligraphy appears in Mi Fu’s *Shuishi Baozhang* (Treasure of Calligraphic History) and the *Xuanhe Shupu* (Book of Calligraphy of the Xuanhe Era), neither of which records it. Later collectors also make no mention of it. By the mid-Ming, it suddenly emerged from Zheng Ming’s family in stone form—its authenticity remains uncertain. How then could it serve as proof of the text’s authenticity?\n\nThe editors retain this work despite its late composition because it contains profound insights, and many scholars have annotated it. The commentary includes references to a figure called \"Yin Yu\" (Emperor Yin), whose identity is unknown. The preface at the scroll’s beginning is unsigned and undated, containing phrases like *\"leaking the celestial mechanism\"* and *\"Stupid Yu, wise Yu\"*—crude Daoist jargon unworthy of serious inquiry. Only Chao Gongwu’s *Dushu Zhi* preserves Li Kui’s annotations, now missing from this edition, suggesting either scribal corruption or that this is not Li Kui’s original text.\n\n---\n**Yinfu Jing Kaoyi (Investigation of the *Yinfu Classic*)**\n**Daoist Category**\n\n**The Imperial Editors humbly note:**\nThe *Yinfu Jing Kaoyi* (Investigation of the *Yinfu Classic*) in one scroll, compiled by Song-era Zhu Xi (Master Zhu). Huang Tingjian held that the *Yinfu Jing* originated with Tang-era Li Kui, and Zhu Xi’s *Yulu* (Conversations) concurs. Yet Zhu Xi acknowledged that its profound passages could not have been authored by one unversed in the Dao. He thus collated the text, identifying the first 114 characters—*\"From the time when the foolish Yu became the sage Yu\"*—as the core scripture, based on the annotations of Chu Suiliang and Zhang [unclear].\n\nThe *Yulu* records Zhu Xi’s discussion with Lu Qiu Ci Meng, who praised the *Yinfu Jing*’s expression of *\"the natural Dao in stillness.\"* Zhu Xi declared Lu’s insight surpassed even the *Six Classics*, while Yang Daofu doubted the passage existed in the original text. Yang likely consulted the *Lishan Laomu* (Old Mother of Mount Li) edition, where the final lines read *\"I, with the times and things, refine my wisdom\"*—leading him to question whether the passage appeared in the original *Yinfu*.\n\nThe text includes an appendix by Huang Ruijie, whose citations are extensive. The *Jian’an Fu Zhi* (Gazetteer of Jian’an Prefecture) records Ruijie (style name Guanle, native of Anfu), who passed the county-level exams and served as county magistrate of Taihe before abandoning office in the late Yuan. He compiled and annotated works like the *Taiji Tu* (Diagram of the Supreme Ultimate), *Tongshu* (Comprehensive Book), *Xixing* (Western Inscription), *Yixue Qimeng* (Awakening to the Study of the *Yijing*), *Jiali Lülü Jingyi* (Essence of Rites and Music), and *Huangji Jingshi* (Scripture of the Sovereign’s Polity), among others—including, presumably, the *Cansong Qi* (Paramount Concordance) and *Shenxing* (Divine Transformation). The gazetteer omits these due to their Daoist associations. (Recorded in the 46th year of Qianlong, October, after reverent collation and submission.)\n\n**Chief Compilers:**\nMemorialist Ji Yun\nMemorialist Lu Xixiong\nMemorialist Sun Shiyi\n\n**Chief Proofreaders:**\nMemorialist Lu Feidi",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 885,
      "start_sentence": 0,
      "end_sentence": 13,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 14.148905515670776,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经解.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "钦定四库全书 阴符经解 黄帝阴符经注序 所谓命者性也 性能命通故圣人尊之以天命愚其人而智其圣故曰天机张而不死地机弛而不生观乎 阴符造化在乎 手生死在乎 人故圣人藏之于心所以陶甄天地聚散天下而不见其迹者天机也 故黄帝得之以登天下汤武得之以王天下五霸得之以统诸侯夫臣易而主难不可以轻用太公九十非不遇盖审其主焉 若使哲士执而用之立石为主刻木为君亦可以享天下夫臣尽其心而主反怖有之不亦难乎 呜呼无贤君则义士自死而不仕莫若散志岩穴以养其命待生于泰阶世人以夫子为不遇以秦仪为得时不然志在立宇宙安能驰心下走哉 丈夫所耻呜呼后世英哲审而用之范蠡重而长文种轻而亡岂不为泄天机天机泄者沈三劫宜然故圣人藏诸名山传之同好之金匮恐小人而弄之 上篇 观天之道执天之行尽矣故天有五贼见之者昌太公曰其一贼命其次贼物其次贼时其次贼功其次贼神贼命以一消天下用之以味贼物以一急天下用之以利贼时以一信天下用之以反贼功以一恩天下用之以怨贼神以一验天下用之以小大谷子曰天之五贼莫若贼神此大而彼小以小而取大天地莫之能神而况于人乎筌曰黄帝得贼命之机白日上升殷周得贼神之验以小灭大管仲得贼时之信九合诸侯范蠡得贼物之急而霸南越张良得贼功之恩而败强楚 五贼在心施行于天宇宙在乎手万化生乎身 太公曰圣人谓之五贼天下谓之五德人食五味而生食五味而死无有怨而弃之者也 心之所味也 亦然谷子曰贼命可以长生不死黄帝以少女精炁感之时物亦然且经冬之草覆之而不死露之即见伤草木植性尚犹如此况人万物之灵其机则少女以时广成子曰以为积火焚五毒五毒即五味五味尽可以长生也 筌曰人因五味而生五味而死五味各有所主顺之则相生逆之则相胜久之则积炁薫蒸人腐五脏殆至灭亡后人所以不能终其天年者以其生生之厚矣 是以至道淡然胎息无味神仙之术百数其要在抱一守中少女之术百数其要在还精采炁金丹之术百数其要在神水华池治国之术百数其要在清净自化用兵之术百数其要在奇正权谋此五事者卷之藏于心于神施之弥于天给于地宇宙瞬息可在人之手万物荣枯可生人之身黄帝得之先固三宫后治万国鼎成而驭龙上升于天也 天性人也人心机也立天之道以定人也 亮曰以为立天定人其在于五贼 天发杀机龙蛇起陆人发杀机天地反覆 范曰昔伊尹佐殷发天杀之机克夏之命尽而事应之故有东征西夷怨南征北狄怨太公曰不耕三年大旱不凿十年地坏杀人过万大风暴起亮曰按楚杀汉兵数万大风杳冥昼晦有若天地反覆 天人合发万变定基 良曰从此一信而万信生故为万变定基矣筌曰大荒大乱兵水旱蝗是天杀机也虞舜陶甄夏禹拯骸殷系夏台周囚羑里汉祖亭长魏武乞丐俱非王者之位乘天杀之机也起陆而帝君子在野小人在位权臣擅威百姓思乱人杀机也成汤放桀周武伐纣项籍斩嬴婴魏废刘协是乘人杀之机也覆贵为贱反贱为贵有若天地反覆天人之机合发成败之理宜然万变千化圣人因之而定基业也 性有巧拙可以伏藏 良曰圣人见其巧拙彼此不利者其计在心彼此利者圣哲英雄道焉况用兵之务哉筌曰中欲不出谓之启外邪不入谓之闭内启是其机也难知如阴不动如山巧拙之性使人无间而得窥也 九窍之邪在乎三要可以动静",
      "translated_text": "**Pinning the Four Treasures: Commentary on the *Yin Fu Jing***\n\n**Preface to the *Huangdi Yin Fu Jing* (The Sovereign’s *Yin Fu* with Commentary)**\n\nWhat is called *ming* is *xing* (性). *Xing* is capable of *ming* (命), yet its essence remains unfathomable; thus the Sage reveres it as the *Tianming* (天命)—fooling the common man while enlightening the Sage. Hence it is called the *Tianji* (天机), stretched yet never exhausted, slackened yet never stagnant. Behold the *Yin Fu*: its transformations lie in the hands; its life and death are at its command. Therefore the Sage conceals it in the heart, to refine and nurture the gathering and scattering of the cosmos beneath heaven, unseen in its traces—this is the *Tianji*.\n\nThus the Yellow Emperor attained it and ascended to rule the world; Tang and Wu gained it and became kings; the Five Hegemons secured it and united the feudal lords. Yet, *to be the subject and master the Way is difficult*—not to be taken lightly. The Duke of Zhou was ninety before he met his fate; it was not that he did not encounter the *Yin Fu*, but rather that he discerned his master’s nature. If a wise man were to wield it, even carving stone as sovereign or wood as ruler, he could still enjoy the world.\n\nIf the subject exhausts his virtue while the master grows fearful, possessing the *Yin Fu* is indeed difficult! Alas, without a virtuous ruler, the righteous scholar dies alone, refusing to serve. Better to scatter one’s resolve in mountain caves, nourishing life while awaiting the rise of the worthy—those who see Confucius as unlucky and Qin Yi as fortunate are mistaken. The Way lies in establishing the cosmos; how can one idle the heart and stoop to petty schemes?\n\nA true man would scorn such folly. Alas, later generations’ heroes and sages, discerning and applying it, saw Rang Li flourish through weighty resolve while Wen Zhong perished from recklessness. Did they not fear squandering the *Tianji*? The Sage hides such truths in sacred peaks, passing them to kindred spirits, lest the unworthy seize and misuse them. The first chapter reveals the Dao of observing Heaven, seizing its patterns, and exhausting its workings.\n\nThe Duke of Zhou said: Heaven has five thieves (*Wu Ze* 五賊)—one who steals *ming* (命), one who steals *wu* (物), one who steals *shi* (時), one who steals *gong* (功), and one who steals *shen* (神).\n- Stealing *ming* with one act consumes the world’s use of it for flavor.\n- Stealing *wu* with one act hastens the world’s use of it for profit.\n- Stealing *shi* with one act betrays the world’s trust in it for reversals.\n- Stealing *gong* with one act sows resentment where the world expects gratitude.\n- Stealing *shen* with one act distorts the world’s perception of it as small or great.\n\nYu Ji said: Of Heaven’s five thieves, none is more destructive than stealing *shen*. One takes the small to destroy the great—Heaven and Earth cannot thwart this, let alone man!\n\nGuan Yu remarked: The Yellow Emperor seized the thief of *ming*, ascending in broad daylight. The Shang and Zhou dynasties seized the thief of *shen*, using the small to vanquish the great. Guan Zhong seized the thief of *shi*, uniting the feudal lords in nine alliances. Fan Li seized the thief of *wu*, conquering the South and becoming hegemon. Zhang Liang seized the thief of *gong*, defeating the mighty Chu.\n\nThe five thieves lie within the heart, their application extending to Heaven. The cosmos is at one’s command, and myriad transformations arise from the body. The Duke of Zhou said: The Sage calls them five thieves; the world names them five *De* (德). Man feeds on the five flavors and lives; man feeds on the five flavors and dies. Yet none abandon them without grievance—this is the nature of the heart’s craving.\n\nYu Ji said: Stealing *ming* can lead to eternal life. The Yellow Emperor, when a maiden’s *jing* (精) and *qi* (氣) moved him, also saw the world’s things thus. Even winter grasses, covered and left untouched, do not die—expose them, and they wither. Plants and trees, rooted in nature, endure such trials; how much more so man, the most refined of all things, whose essence is that of a maiden’s *jing* and the timing of *shi*!\n\nBo Changzi said: This is the accumulation of fire to burn the Five Toxins (五毒)—the Five Toxins are the Five Flavors. Exhausting the Five Flavors can lead to eternal life.\n\nGuan Yu remarked: Man lives and dies through the Five Flavors. Each flavor has its master—harmonizing with it brings life; opposing it brings destruction. Prolonged indulgence accumulates *qi*, steeping and corrupting the five *zang* organs until they perish. Thus later generations cannot fulfill their natural lifespan—it is because of their excessive craving for life!\n\nTherefore, the Supreme Dao is serene, nurturing *taixi* (胎息) without indulgence. The arts of immortals and transcendent beings, though numerous, center on embracing unity and guarding the middle. The techniques of maidenly cultivation, though many, focus on returning *jing* (精) and adopting *qi*. The arts of elixirs, though countless, hinge on *shen shui* (神水) and the *Huaxi* (華池). The arts of governance, though myriad, depend on purity and self-transformation. The arts of warfare, though varied, rest on *qizheng* (奇正) and strategic maneuvering. These five arts—when rolled up and hidden in the heart, when applied to the spirit, when spread across Heaven, when given to Earth—can make the cosmos rise and fall in an instant, all at man’s command.\n\nThe Yellow Emperor attained them and first established the Three Palaces (三宮), then pacified the myriad states. The Cauldron of Destiny (鼎) was completed, and he tamed the Dragon, ascending to Heaven.\n\nHeaven’s nature is man’s nature; man’s heart is the *Tianji*. Establishing Heaven’s Dao determines man’s fate.\n\nYu Ji said: This is the Dao of establishing Heaven and determining man—it lies in the five thieves. When Heaven’s killing intent is unleashed, dragons and serpents rise. When man’s killing intent is unleashed, Heaven and Earth overturn.\n\nFan Yu said: In ancient times, Yi Yin served the Shang and released Heaven’s killing intent. The command to conquer Xia was fulfilled, and the response was swift—thus the eastern expedition against the Western Barbarians and the southern against the Northern Di. The Duke of Zhou said: Three years without tilling the fields brought great drought; ten years without digging wells caused the earth to collapse, killing tens of thousands. Violent winds and storms arose.\n\nYu Ji said: According to the records, when Chu’s armies slaughtered tens of thousands of Han soldiers, the sun vanished and day turned to night—Heaven and Earth seemed to overturn. The killing intent of Heaven and man converged, giving rise to myriad changes and fixed foundations.\n\nZhang Liang said: From this single act of trust, all trust is born—thus the foundation of myriad changes is established.\n\nGuan Yu said: Within the heart’s desires, there is no outward expression—this is called *Qi* (启). External evils do not penetrate—this is called *Bi* (闭). *Qi* is the thief’s intent, hard to discern like darkness, unmoving like a mountain. The thief’s cunning nature makes men unguarded, allowing them to be glimpsed.\n\nThe evils of the nine orifices (九窍) lie in the three *Yao* (要)—movement and stillness can be controlled.**",
      "overlap_context": "ü Jingyi* (Essence of Rites and Music), and *Huangji Jingshi* (Scripture of the Sovereign’s Polity), among others—including, presumably, the *Cansong Qi* (Paramount Concordance) and *Shenxing* (Divine Transformation). The gazetteer omits these due to their Daoist associations. (Recorded in the 46th year of Qianlong, October, after reverent collation and submission.)\n\n**Chief Compilers:**\nMemorialist Ji Yun\nMemorialist Lu Xixiong\nMemorialist Sun Shiyi\n\n**Chief Proofreaders:**\nMemorialist Lu Feidi",
      "start_char": 896,
      "end_char": 2155,
      "start_sentence": 14,
      "end_sentence": 42,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 21.39155912399292,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经解.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "太公曰三要者耳目口也耳可凿而塞目可穿而口可利而讷兴师动众万夫莫议其奇在三者或可动或可静之筌曰两叶掩目不见泰山豆塞耳不闻雷霆一椒掠舌不能立言九窍皆邪不足以察机变其在三者神心志也机动未朕神以随之机兆将成心以图之机发事行志以断之其机动也与阳同其波五岳不能镇其隅四渎不能界其维其机静也与阴同其德智士不能运其荣深闻不能窍其谋天地不能夺其时而况于人乎 火生于木祸发必克奸生于国时动必溃知之修链谓之圣人 筌曰火生于木火发而木焚奸生于国奸成而国灭木中藏火火始于无形国中藏奸奸始于无象非至圣不能修身链行使奸火之不发夫国有无军之兵无灾之祸矣以箕子逃而缚裘牧商容囚而蹇叔哭中篇 天生天杀道之理也 良曰机出乎心如天之生如天之杀则生者自谓得其生死者自谓得其死 天地万物之盗万物人之盗人万物之盗三盗既宜三才既安 谷子曰三盗者彼此不觉知但谓之神明此三者况车马金帛弃之可以倾河填海移山覆地非命而动然后应之筌曰天地与万物生成盗万物以衰老万物与人之服御盗人以骄奢人与万物之上器盗万物以毁败皆自然而往三盗各得其宜三才递安其任 故曰食其时百骸理动其穖万化安 谷子曰不欲令后代人君广敛珍宝委积金帛若能弃之虽倾河填海未足难也食者所以治百骸失其时而伤百骸动者所以安万物失其机而伤万物故曰时之至间不容瞬息先之则太过后之则不及是以贤者守时不肖者守命也 人知其神之神不知不神之所以神也 筌曰人皆有圣人不贵圣人之愚既睹其圣又察其愚复睹其圣故书曰专用聪眀则事不成专用晦昧则事皆悖一明一晦众之所载伊尹酒保太公屠牛管仲作革百里奚卖粥当衰乱之时人皆谓之不神及乎逄成汤遭文王遇齐桓值秦穆道济生灵功格宇宙人皆谓之至神 日月有数大小有定圣功生焉神眀出焉 谷子曰后代伏思之则明天地不足贵而况于人乎筌曰一岁三百六十五日日之有数月次十二以积闰大小余分有定皆禀精自有不为圣功神明而生圣功神明亦禀精自有不为日月而生是故成不贵乎天地败不怨乎阴阳 其盗机也天下莫能见莫能知君子得之固躬小人得之轻命 诸亮曰夫子太公岂不贤于孙吴韩白所以君子小人异之四子之勇至于杀身固不得其主而见杀矣筌曰季主凌夷天下莫见凌夷之机而莫能知凌夷之源霸王开国之机而莫能知开国之机而莫能知开国之源君子得其机应天顺人乃固其躬小人得其机烦兵黩武乃轻其命易曰君子见机而作不俟终日又曰知机其神乎机者易见而难知见近知远 下篇 瞽者善听聋者善视绝利一源用师十倍三反昼夜用师万倍 尹曰思之精所以尽其微良曰后代伏思之耳目之利绝其一源筌曰人之耳目皆分于心而竟于神心分则机不精神竟则机不微是以师旷熏目而聪耳离朱漆耳而明目任一源之利而反用师于心举事发机十全成也退思三反经昼历夜思而后行举事发机万全成也太公曰目动而心应之见可则行见否则止 心生于物死于物机在于目 筌曰为天下机者莫近乎心目心能发目目能见机秦始皇东游防稽项羽目见其机心生于物谓项梁曰彼可取而代之晋师毕至于淮淝苻坚目见其机心死于物谓苻融曰彼勍敌也胡为少耶则知生死之心在乎物成败之机见于目焉 天之无恩而大恩生迅雷烈风莫不蠢然",
      "translated_text": "The Master Taigong said: The three *Yao* (critical points) are the ears, eyes, and mouth. The ears can be pierced and sealed, the eyes can be bored through, and the mouth can be made sharp yet speechless. When raising armies and mobilizing the masses, ten thousand soldiers will not dare to speak out. Its brilliance lies in whether one can move or still these three *Yao*.\n\nThe strategist said: Two leaves covering the eyes cannot hide Mount Tai; a single bean blocking the ears cannot drown out thunder. A single peppercorn brushing the tongue cannot silence speech. If all nine orifices are filled with evil, they are insufficient to discern changes in opportunity. What matters lies in these three: spirit, heart, and will. When opportunity moves, the spirit follows it. When opportunity is about to manifest, the heart plans for it. When opportunity arises and action is taken, the will decides it.\n\nWhen opportunity moves, it aligns with the Yang—even the Five Mountains cannot contain its corners, and the Four Seas cannot confine its boundaries. When opportunity is still, it aligns with the Yin—even wise men cannot manipulate its splendor, and deep wisdom cannot fathom its schemes. Heaven and Earth cannot alter its timing, let alone man.\n\nFire arises from wood; when it ignites, it consumes the wood. Treachery arises within the state; when it flourishes, the state perishes. Wood hides fire within it—fire begins in formlessness. The state hides treachery within it—treachery begins in no visible shape. Only the most sagely cannot cultivate self-restraint to prevent the fire of treachery from igniting. Thus, the state will have no military disasters nor calamities of misfortune.\n\nWith Ji Zi fleeing and bound in deerskin, Shangrong Yu imprisoned and Shao Shu weeping in the middle section—this is the Way of Heaven’s creation and destruction.\n\nZhang Liang said: Opportunity arises from the heart, like Heaven’s creation and destruction. Those who live believe they have secured their fate; those who die believe they have met their end.\n\nHeaven and Earth, along with all things, are thieves—stealing from all things through decay and old age. All things and man’s adornments are thieves—stealing from man through arrogance and excess. Man and the highest tools of all things are thieves—stealing from all things through ruin and destruction. All this unfolds naturally, each thief fulfilling its role, the Three Powers in harmony.\n\nThus it is said: Eat in season, and the hundred limbs function harmoniously. Act at the right moment, and all transformations are secure.\n\nThe Master Guigu said: Do not let future rulers amass treasures and hoard gold and silk. If they can discard them, even emptying rivers and filling seas would be insufficient. Food is what sustains the hundred limbs—lose its season, and the limbs are harmed. Action is what secures all things—lose its opportunity, and all things are harmed. Thus it is said: The arrival of the right moment allows no pause, not even the blink of an eye. Act too early, and it is excessive; act too late, and it fails. Therefore, the virtuous guard the moment, while the unworthy cling to fate.\n\nMen know the sagely’s sagacity but not the source of their sagacity.\n\nThe strategist said: All men possess the Way, yet not all value the foolishness of the sage. Once his sagacity is revealed, his foolishness is examined, and his sagacity is seen again. Thus the classics say: If one relies solely on keen insight, matters will not succeed. If one relies solely on obscurity, all actions will fail. Balance clarity and obscurity—then the masses will follow. Yi Yin was a tavern keeper, Taigong a butcher, Guan Zhong a leatherworker, and Bai Li a soup vendor. In times of decline and chaos, men deemed them unremarkable. Yet when they encountered Tang, Wen, Huan, or Mu, their Way flourished, their sagacity shone, and their deeds moved Heaven and Earth. Men then called them supremely sagely.\n\nThe sun and moon have their cycles; great and small have their limits. From these arise sagely deeds and divine brilliance.\n\nThe Master Guigu said: Future generations will ponder this and realize that Heaven and Earth are not to be prized above man.\n\nThe strategist said: In a year of 365 days, the days have their number, the months their sequence, and the intercalary months their fixed divisions—all drawing from the essence of Heaven and Earth. Even without sagely deeds or divine brilliance, this essence exists. Even without the sun and moon, this essence exists. Thus, success does not depend on Heaven and Earth, nor does failure blame Yin and Yang.\n\nIts thievery of opportunity—none under Heaven can see or know it. The noble who grasps it secures his life; the petty man who grasps it risks his fate.\n\nZhuang Liang said: Was not Master Taigong more virtuous than Sun Wu, Han Fei, and Bai Qi? Yet the noble and petty differ in their application. The four worthies’ courage reached the point of death—yet they failed to serve their masters and were killed.\n\nThe strategist said: The master of the season, Ling Yi, was unseen by all under Heaven, yet his opportunity was known. The source of Ling Yi’s rise was unseen, yet the opportunity for the rise of a hegemon or king was known. The source of their rise was unseen. The noble who seizes the opportunity aligns with Heaven and follows man, thus securing his life. The petty man who seizes the opportunity indulges in warfare and reckless violence, thus risking his fate.\n\nThe *Classic of Changes* says: The noble acts when he discerns the opportunity, not waiting until the day is complete. It also says: To know the opportunity is divine. Opportunity is easy to see but hard to know—near yet distant.\n\n**Lower Section:**\n\nThe blind excel in hearing; the deaf excel in sight. If one extreme is abandoned, its source is cut off. If tenfold armies are used, threefold reversals of day and night will suffice. If a hundredfold armies are used, ten thousandfold reversals of day and night will suffice.\n\nYin said: Deep contemplation exhausts the subtle.\n\nZhang Liang said: Future generations will ponder this—if the ears and eyes are severed from their source, their utility is lost.\n\nThe strategist said: Man’s ears and eyes are divided by the heart and perfected by the spirit. If the heart is divided, opportunity lacks spirit. If the spirit is perfected, opportunity lacks subtlety. Thus, Shimiang was blinded yet his ears sharpened; Lijiu’s ears were sealed yet his eyes brightened. If one extreme is utilized and the other abandoned, and the heart is employed to command armies, then all actions will succeed. Retreat and reflect three times—once at dawn, once at dusk—then act. If opportunity is seized and action taken, all will succeed.\n\nTaigong said: When the eyes move, the heart responds. If what is seen is favorable, act. If not, stop. The heart is born from things and dies from things; opportunity lies in the eyes.\n\nThe strategist said: For all under Heaven, nothing is closer to opportunity than the heart and eyes. The heart can ignite opportunity; the eyes can perceive it. When Qin Shihuang made his eastern expedition, he saw the opportunity in Jianli. When Xiang Yu saw the opportunity, he told Xiang Liang: “That man can be taken and replaced.” When the Jin army reached the Huai River and the Battle of Fei, Fu Jian saw the opportunity and told Fu Rong: “They are a formidable enemy—why are there so few?” Thus, it is known: the heart’s life and death lie in things, and the eyes reveal the opportunity of success and failure.\n\nHeaven, though without favor, gives rise to great kindness. Sudden thunder and violent winds—all creatures tremble in response.",
      "overlap_context": ", all trust is born—thus the foundation of myriad changes is established.\n\nGuan Yu said: Within the heart’s desires, there is no outward expression—this is called *Qi* (启). External evils do not penetrate—this is called *Bi* (闭). *Qi* is the thief’s intent, hard to discern like darkness, unmoving like a mountain. The thief’s cunning nature makes men unguarded, allowing them to be glimpsed.\n\nThe evils of the nine orifices (九窍) lie in the three *Yao* (要)—movement and stillness can be controlled.**",
      "start_char": 2155,
      "end_char": 3429,
      "start_sentence": 43,
      "end_sentence": 63,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 17.013888597488403,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经解.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "良曰熙熙哉太公曰诫惧致福筌曰天心无恩万物有心归恩于天老子曰天地不仁以万物为刍狗圣人不仁以百姓为刍狗是以施而不求其报生而不有其功及至迅雷烈风威远而惧迩万物蠢然而懐惧天无威而惧万物万物有惧而归威于天圣人行赏也无恩于有功行伐也无威于有罪故赏罚自立于上威恩自行于下也 至乐性余至静性廉 良曰夫机在于是也筌曰乐则奢余静则贞廉性余则神浊性廉则神清神者智之泉神清则智明智者心之府智公则心平人莫鉴于流水而鉴于澄水以其清且平神清意平乃能形物之情夫圣人者不淫于至乐不安于至静能栖神静乐之间谓之守中如此势利不能诱声色不能荡辩士不能说智者不能动勇者不能惧见祸于重关之外虑患于杳冥之内天且不违而况于兵之诡道者哉 天之至私用之至公 尹曰治极微良曰其机善虽不令天下而行之天下所不能知天下所不能违筌曰天道曲成万物而不遗椿菌鹏鴳巨细修短各得其所至私也云行雨施雷电霜雹生杀之均至公也圣人则天法地养万民察劳苦至私也行正令施法象至公也孙武曰视卒如爱子可以俱死视卒如婴儿可与之赴深溪爱而不能令譬若骄子是故令之以文齐之以武 禽之制在炁 太公曰岂以小大而相制哉尹曰者天之机筌曰龟食蟒鹯隼击鹄黄腰啖虎飞鼠防猿蜍蛭哜鱼狼犿啮鹤余甘柔金河车服之无穷化玉雄黄变铁有不灰之木浮水之石夫禽兽木石得其炁尚能以小制大况英雄得其而不能净寰海而御宇宙也 生者死之根死者生之根恩生于害害生于恩 太公曰损己者物爱之厚己者物薄之筌曰谋生者必先死而后生习死者必先生而后死鹖冠子曰不死不生不断不成孙武曰投之死地而后生致之亡地而后存吴起曰兵战之场立尸之地必死则生幸生则死恩者害之源害者恩之源吴树恩于越而害生周立害于殷而恩生死之与生也恩之与害相反纠缠也 愚人以天地文理圣我以时物文理哲 太公曰观鸟兽之时察万物之变筌曰景星见黄龙下翔凤至醴泉出嘉谷生河不满溢海不扬波日月薄蚀五星失行四时相错昼冥宵光山崩川涸冬雷夏霜愚人以此天地文理为理乱之机文思安安光被四表克明俊德以亲九族六府三事无相夺伦百谷用成兆民用康昏主邪臣法令不一重赋苛政上下相懿戚贵臣骄奢淫纵酣酒嗜音峻宇雕墙百姓流亡思乱怨上我以此时物文理为理乱之机也 人以愚虞圣我以不愚虞圣人以奇期圣我以不奇期圣 筌曰贤哲之心深妙难测由巢之迹人或窥之至于应变无方自机转而不穷之智人岂虞之以迹度心乃为愚者也 故曰沈水入火自取灭亡 良曰理人自死理军亡兵无死则无不死无生则无不生故知乎死生国家安宁 自然之道静故天地万物生 尹曰静之至不知所以生 天地之道浸故阴阳胜 良曰天地之道浸微而推胜之 阴阳相推而变化顺矣 良曰阴阳相推激至于变化在于目 是故圣人知自然之道不可违因而制之 良曰大人见之为自然英哲见之为制愚者见之为化尹曰知自然之道万物不能违故利而行之 至静之道律历所不能契 良曰观鸟兽之时察万物之变鸟兽至静律历所不能契从而机之 爰有奇器是生万象八卦甲子神机藏 良曰六癸为天藏可以伏藏也 阴阳相胜之术昭昭乎进乎象矣 亮曰奇器者圣智也天垂象圣人则之推甲子画八卦考蓍龟稽律历则神之情阴阳之理昭着乎象无不尽矣亮曰八卦之象申而用之六十甲子转而用之神出入万明一矣良曰万生万象者心也合藏阴阳之术日月之数昭昭乎在人心矣广成子曰甲子合阳九之数也卦象出师众之法出师以律动合神顺天应时而用神之道也",
      "translated_text": "The Master said: *\"Ah, how bustling it is!\"*\nThe Duke replied: *\"Be wary and cautious to invite blessings.\"*\n\nThe Strategist said: *\"Heaven’s heart has no favor, yet all things have hearts that return gratitude to Heaven.\"*\n\nLaozi said: *\"Heaven and Earth are without virtue, treating all things as grass-dogs. The Sage is without virtue, treating the people as grass-dogs. Thus, he acts without expecting return, gives life without claiming credit. Even when sudden thunder and violent winds strike, their power reaches far and near, and all creatures tremble in fear, yet they still revere Heaven. Heaven has no coercion, yet all creatures fear it. All things, though fearing, return that fear to Heaven. The Sage, when bestowing rewards, shows no favor to those who have merited them; when punishing, no coercion to those who have erred. Thus, rewards and punishments are established from above, while awe and grace flow downward.*\n\nThe utmost joy is in nature’s abundance; the utmost stillness is in nature’s restraint. The Master said: *\"Here lies the essence of opportunity!\"*\n\nThe Strategist said: *\"Joy leads to extravagance; stillness leads to integrity. Abundance dulls the spirit; restraint clarifies it. The spirit is the fountain of wisdom. When the spirit is clear, wisdom shines. Wisdom is the repository of the heart. When wisdom is balanced, the heart is even. None can discern truth in flowing water, but all see it in still water—because it is clear and level. When the spirit is clear and the mind is tranquil, one can perceive the true nature of things. The Sage does not indulge in utmost joy nor settle in utmost stillness, but dwells in the harmony of spirit and tranquility—this is called *guarding the Middle*. Thus, worldly gains cannot seduce him, music and color cannot disrupt him, eloquent speakers cannot persuade him, the wise cannot move him, nor the brave intimidate him. He foresees calamity beyond the mountain passes and anticipates disaster in the darkest depths. Heaven itself cannot thwart him—how much less the deceptive ways of war!\"*\n\n*\"Heaven’s utmost selfishness is its utmost impartiality.\"*\n\nEmperor said: *\"Governance reaches its peak in subtlety.\"*\nThe Master said: *\"Its opportunity is so refined that even if no commands are given, the world follows it without knowing why—or defying it.\"*\n\nThe Strategist said: *\"The Way of Heaven subtly completes all things, not neglecting even the gnarled *chun* tree or the lowly *yuan* bird—great and small, long and short, each finds its place. This is its utmost selfishness. Yet it sends rain, dispatches thunder and lightning, frost and hail, balancing life and death with utmost impartiality. The Sage follows Heaven, models Earth, and nurtures the people—this is his utmost selfishness. He enforces just decrees and applies laws with precision—this is his utmost impartiality.\"*\n\nSun Wu said: *\"Treat soldiers as beloved children—you can die together. Treat them as infants—you can send them into deep ravines.\"* To love without authority is like indulging a spoiled child. Thus, one governs with ritual and disciplines with force.\n\n*\"The principle governing creatures lies in *qi*.\"*\n\nThe Duke said: *\"Does it mean the small dominate the great?\"*\nEmperor said: *\"The *qi* of things is Heaven’s mechanism.\"*\n\nThe Strategist said: *\"The *qi* of the tortoise makes it eat serpents; the *qi* of the falcon strikes hares; the *qi* of the yellow-bellied weasel devours tigers; the *qi* of flying squirrels repels monkeys; the *qi* of toads and leeches drains fish; the *qi* of wolves terrifies deer; the *qi* of cranes intimidates hawks. Sweetness and softness overcome gold; the *qi* of the *heche* chariot is inexhaustible; jade and雄黄 transform iron; there are woods that do not burn and stones that float. Even creatures and objects, when attuned to their *qi*, can let the small overcome the great. How much more so for the Sage, who harnesses *qi* and cannot fail to pacify the world and master the cosmos!\"*\n\n*\"The living are the root of the dead; the dead are the root of the living. Gratitude arises from harm; harm arises from gratitude.\"*\n\nThe Duke said: *\"Those who diminish themselves are loved; those who aggrandize themselves are slighted.\"*\n\nThe Strategist said: *\"To seek life, one must first embrace death, then life follows. To master death, one must first experience life, then death comes. The *Lüguanzi* says: 'Without death, there is no life; without destruction, there is no completion.' Sun Wu said: 'Cast them into certain death, and they will live. Drive them to despair, and they will survive.' Wu Qi said: 'The battlefield is a place of corpses. To die is to live; to hope to live is to die.' Gratitude is the source of harm; harm is the source of gratitude. Wu Zixu took vengeance on Yue for the sake of gratitude, yet it bred harm. The Zhou overthrew the Shang through harm, yet it gave rise to gratitude. Life and death, gratitude and harm—opposite yet intertwined.\"*\n\n*\"The foolish see Heaven and Earth’s patterns as omens of chaos; the Sage sees the patterns of things and times as omens of order.\"*\n\nThe Duke said: *\"Observe the timing of birds and beasts, scrutinize the changes of all things.\"*\n\nThe Strategist said: *\"When the *jing* star appears, yellow dragons descend; phoenixes soar; sweet springs emerge; fine grains grow; the rivers overflow without spilling, the seas surge without waves; the sun and moon are eclipsed; the five stars stray from their courses; the four seasons overlap; day turns to night, night to day; mountains crumble, rivers dry; winter thunder and summer frost strike. The foolish see these as Heaven and Earth’s chaotic patterns. The Sage, with tranquil rule, spreads light to the four quarters, fulfills virtuous deeds, and harmonizes the nine clans and six offices. The three affairs proceed without mutual obstruction; the hundred grains flourish; the myriad people prosper. The ruler is depraved, ministers corrupt; laws are inconsistent, taxes oppressive, governance harsh—above and below are in disarray. Noble and humble alike indulge in wine, music, towering halls, and ornate walls. The people flee, longing for chaos, blaming the ruler above. I see these as the patterns of things and times—omens of order and chaos.\"*\n\n*\"Men are foolish by nature; the Sage is not. The Sage anticipates the extraordinary; I do not.\"*\n\nThe Strategist said: *\"The hearts of the wise are profound and subtle, beyond measure. The tracks of Yu the Great were observed, yet his responses to change were boundless. His wisdom turned with opportunity, inexhaustible. How could one guess his intentions by his traces? That would be true foolishness. Thus it is said: 'Plunge into water or fire, and you court annihilation.'\"*\n\nThe Master said: *\"To govern men is to court their death; to lead an army is to court defeat. If there is no death, there is no not-dying. If there is no life, there is no not-living. Thus, one who understands death and life ensures the nation’s security.\"*\n\n*\"The Way of Nature is stillness; thus Heaven and Earth and all things are born.\"*\n\nEmperor said: *\"The utmost stillness knows not how things are born.\"*\n\n*\"The Way of Heaven and Earth is gradual; thus yin and yang prevail.\"*\n\nThe Master said: *\"The Way of Heaven and Earth is subtle and pushes toward dominance. Yin and yang interact, and their transformations follow naturally.\"*\n\nThe Master said: *\"Yin and yang interact,激至变化在于目—thus the Sage knows the Way of Nature cannot be defied and follows it accordingly.\"*\n\nThe Duke said: *\"The noble see it as Nature; the wise see it as artifice; the foolish see it as transformation.\"*\n\nEmperor said: *\"To know the Way of Nature, all things cannot defy it. Thus, one acts in accordance with it.\"*\n\n*\"The utmost stillness transcends the reach of calendars and measurements.\"*\n\nThe Master said: *\"Observe the timing of birds and beasts, scrutinize the changes of all things. Birds and beasts embody utmost stillness, beyond the grasp of calendars and measurements. Follow their mechanisms.\"*\n\n*\"Thus arise wondrous instruments, generating all phenomena. The Eight Trigrams, the Heavenly Stems, and Earthly Branches conceal divine mechanisms.\"*\n\nThe Master said: *\"The six *ji* stems are Heaven’s repository—capable of concealment.\"*\n\n*\"The arts of yin and yang’s dominance are clearly manifested in symbols.\"*\n\nBright said: *\"Wondrous instruments are the Sage’s wisdom. Heaven displays symbols; the Sage follows them. By aligning the Heavenly Stems, drawing the Eight Trigrams, consulting the *shi* and tortoise shells, and examining calendars and measurements, the divine intent and the principles of yin and yang are clearly revealed in symbols, exhaustively.\"*\n\nBright said: *\"The Eight Trigrams’ symbols are extended in application; the sixty Heavenly Stems cycle in use. The divine emerges and withdraws—all is illuminated in unity.\"*\n\nThe Master said: *\"All things and all phenomena originate from the heart. The fusion of yin and yang’s arts, the numbers of sun and moon—all are clearly manifest in the human heart. Guangchengzi said: 'The Heavenly Stems combine the nine numbers of yang. The trigrams emerge as the laws of military deployment. Military deployment moves with rhythmic order, aligning with the divine, responding to the times—this is the Way of the divine mechanism.'\"*",
      "overlap_context": "Xiang Yu saw the opportunity, he told Xiang Liang: “That man can be taken and replaced.” When the Jin army reached the Huai River and the Battle of Fei, Fu Jian saw the opportunity and told Fu Rong: “They are a formidable enemy—why are there so few?” Thus, it is known: the heart’s life and death lie in things, and the eyes reveal the opportunity of success and failure.\n\nHeaven, though without favor, gives rise to great kindness. Sudden thunder and violent winds—all creatures tremble in response.",
      "start_char": 3429,
      "end_char": 4810,
      "start_sentence": 64,
      "end_sentence": 92,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 19.825835466384888,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经解.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "阴符经解",
      "translated_text": "**The Exegesis of the *Yin Fu Jing***\n\n「昭昭乎进乎象矣\n　　Bright said: *\"The wondrous instrument is the sagely wisdom—Heaven displays symbols, and the sage follows them. Pushing forward the Heavenly Stems, delineating the Eight Trigrams, divining with *shi* and tortoise shells, consulting calendars and measurements—then the divine intent is revealed, and the principles of yin and yang are made manifest in symbols, exhaustively.\"*\n\n　　Bright said: *\"The symbols of the Eight Trigrams are extended in their application; the sixty Heavenly Stems cycle in their use. The divine emerges and withdraws—all is illuminated in unity.\"*\n\n　　The Master said: *\"All things and all phenomena arise from the heart. The fusion of yin and yang’s arts, the numbers of sun and moon—all are clearly manifest in the human heart. Guangchengzi declared: 'The Heavenly Stems combine the nine numbers of yang. The Trigrams manifest as the laws of military deployment. Military deployment moves with rhythmic order, aligning with the divine, responding to the times—this is the Dao of the divine mechanism.'\"」",
      "overlap_context": "es and withdraws—all is illuminated in unity.\"*\n\nThe Master said: *\"All things and all phenomena originate from the heart. The fusion of yin and yang’s arts, the numbers of sun and moon—all are clearly manifest in the human heart. Guangchengzi said: 'The Heavenly Stems combine the nine numbers of yang. The trigrams emerge as the laws of military deployment. Military deployment moves with rhythmic order, aligning with the divine, responding to the times—this is the Way of the divine mechanism.'\"*",
      "start_char": 4815,
      "end_char": 4822,
      "start_sentence": 93,
      "end_sentence": 93,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 3.262850284576416,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经解.txt",
        "category": "藏外"
      }
    }
  ]
}