{
  "source_id": "阴符发秘",
  "source_file": "chunked_daozang\\阴符发秘.json",
  "total_chunks": 15,
  "total_original_chars": 12364,
  "total_translated_chars": 69720,
  "total_translation_time": 187.25986742973328,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\藏外\\阴符发秘.txt",
    "category": "藏外"
  },
  "full_translation": "**Newly Collated Zhang Qingye’s *Unveiling the Secrets of the Yin Fu* (《阴符发秘》)**\n**Preface (序)**\n**Autobiographical Note (自序)**\n\n**Volume One of *Unveiling the Secrets of the Yin Fu* (《阴符发秘》上卷)**\n**Volume Two of *Unveiling the Secrets of the Yin Fu* (《阴符发秘》中卷)**\n**Volume Three of *Unveiling the Secrets of the Yin Fu* (《阴符发秘》下卷)**\n**Corrected Commentary on the *Yin Fu Jing* (《阴符经》经传订正)**\n\n**Appendix I: *The Mystic Doctrine’s White Explanation* (《玄门戒白》), Qing Dynasty Year Bingyin (乾隆丙寅)**\n**Appendix II: Epilogue to the *Yin Fu Jing* Stele at Qingyang Palace (青羊宫《阴符经碑》跋)**\n**Appendix III: Biographical Note on Zhang Qingye, the Daoist of Self-Pasturing (自牧道人别传)**\n\n---\n\n**Zhang Qingye’s *Unveiling the Secrets of the Yin Fu*—Newly Collated (新校张清夜《阴符发秘》)**\n**Preface (序)**\nMy friend Wen Tong, in his recent study of Daoist teachings, has not only collated and annotated the *Commentaries and Meanings of the Laozi* by Tang Daoists Cheng Xuan Ying (成玄英) and Li Rong (李荣) before publishing them, but has also obtained *Unveiling the Secrets of the Yin Fu* by Zhang Qingye, the Daoist of Self-Pasturing (自牧道人) from the Qing era. Alongside this, he has arranged his chronology and plans to engrave it for dissemination. Wen Tong’s diligence in this endeavor is truly commendable.\n\nHe argues that Zen (禅宗) constitutes a uniquely Chinese branch of Buddhism, and that Song Confucianism (理学) emerged from it. The Complete Perfection (全真) school of Daoism further arose, inheriting from both Zen and Confucianism. This is indeed a profound understanding of the interconnected currents among the Three Teachings (三教), and I cannot refute his words.\n\nThe Daoist of Self-Pasturing (自牧道人) emerged late in history, and it is fitting that he could not entirely avoid the influence of Complete Perfection (全真) teachings. However, Fan Yibin’s (范宜宾) *Mystic Explication* (《玄解》), which follows *Unveiling the Secrets*, states in its preface: *\"The Daoist of Self-Pasturing resided in Shu (蜀), was well-versed in the Southern Palace’s (南宫) arts, yet ultimately attained Dao through Inner Alchemy (内丹).\"* Indeed, after the Song dynasty, Daoism split into Southern and Northern schools. The Northern school became the Complete Perfection (全真) sect, while the Southern school did not necessarily conform to this.\n\n*Unveiling the Secrets* elaborates on the principles of *\"Heaven and Man in Harmony\"* (天人合发) and *\"Sun and Moon Have Their Numbers\"* (日月有数), frequently citing the *Canon of Supreme Mystery* (《参同契》) and the works of Zhang Ziyang (张紫阳), both revered as foundational texts by the Southern school. Thus, the Daoist of Self-Pasturing’s teachings cannot be confined solely to the Complete Perfection sect.\n\nFan Yibin’s *Mystic Explication* leans toward the Southern school in its arguments.\n\nTo summarize, after Huang-Lao Daoism (黄老), the Daoist tradition grew increasingly mundane. Only Zhuang Zhou (庄周) embodied its vast and profound essence, illuminating the boundless Dao of *\"No Waiting\"* (无待) with his boundless play. The Wei-Jin (魏晋) era revered mystic emptiness (玄虚), yet also dismissed claims of transcendent immortality (神仙). Left Yuanfang (左元放) and Wei Boyang (魏伯阳) spoke of *\"Rectification and Guidance\"* (补导), which Zhang Ziyang adopted as the Southern school’s foundation. Though Wang Zhongyang (王重阳) drew near to Zen, his disciples’ discussions of cultivation stages (修习次第) still betrayed a focus on *\"Ascending the Void\"* (冲举). Thus, both Southern and Northern schools are fundamentally techniques (方术), not the Daoist arts (道术) of old.\n\nWhen one delves into techniques (术), their applications remain confined to the realm of sounds, colors, forms, and *qi* (形气). They may even be constrained by the minutiae of yin-yang calculations (阴阳度数). The more refined the technique, the narrower its grasp of the Dao. This is the degeneration of Daoism.\n\nYet the Daoist of Self-Pasturing’s teachings, though influenced by prior traditions, are expressed in the *Yin Fu*, a text highly esteemed in his time. How could one overlook it?\n\nThus, I preface *Unveiling the Secrets*, briefly articulating my thoughts and seeking Wen Tong’s critique.\n\nWritten in the twelfth month of the thirty-fifth year of the Republic of China (民国三十五年十二月), by Xie Wuliang (谢无量).\n\n---\n\n**Preface to *Unveiling the Secrets of the Yin Fu* (《阴符发秘》序)**\nThe works of ancient sages often elucidate principles through concrete events, but the *Yijing* (《易》) alone suspends its symbols in boundless space, encompassing all things and all principles within them. The rise and fall of dynasties, the order and chaos of governance—these are the *Yijing*’s divinations (占验) in action. The annals of scripture, history, philosophy, and literature—these are but its annotations (注脚).\n\nThe *Yin Fu Jing* (《阴符经》) is perhaps the complement to the *Yijing*! Though this text contains but four hundred words, it unfolds the Nine Heavens (九天) and Nine Earths (九地), the boundless beginning (无始) and end (无终), the singular origin of myriad distinctions (一本万殊), and the vast embrace of the minute (大含细入). Its essence aligns with the *Yijing*’s principle of *\"Authentic and Commencing\"* (贞下起元) and *\"Dynamic within the Static\"* (静中含动), sharing no divergent logic.\n\nHowever, its language is often strange, its characters perilous. Later scholars, fixated on these oddities, have only deepened confusion and obscured its true meaning. If one approaches it with a tranquil mind and open *qi*, reflecting inwardly and outward upon the world, then the Buddha’s *\"neither emptiness nor form\"* (非空非色), Laozi’s *\"constant clarity and stillness\"* (常清常静), and the Confucian’s *\"the Unexcelled and the Supreme Polarity\"* (无极太极)—all can be unified under a single thread.\n\nThe Daoist of Self-Pasturing abandoned Confucian robes for the Yellow Crown (黄冠), his storehouse of knowledge vast. Dwelling in Chengdu (成都) for over twenty years, he delved deeply into the Three Teachings (三教) beyond, yet found his greatest resonance in this text. The *Yin Fu*’s teachings on *\"the uses of three thieves and five robbers\"* (三盗五贼之用), the unleashing of *\"killing intent\"* (杀机), and the secrets of *\"wondrous implements\"* (奇器)—he embodied these through personal practice, thus revealing his profound insight. His elucidations surpass even Guo Xiang’s (郭注) annotations on the *Zhuangzi* in their practicality.\n\nAdmirable are the Daoist’s words: *\"The benevolent see it as benevolence; the wise see it as wisdom.\"* Using the *Yijing*’s structure to order this text, he leaves no hidden depths, while previous claims of its military strategy (兵法) and such were but superficial glimpses.\n\nI, too, am no expert in this text. Though I now possess it, I cannot read it fully, nor comprehend it entirely—only those who read the *Yijing* can read this, and those who understand the *Yijing* can interpret it.\n\nWritten in the Year Jiaxu (乾隆甲戌) of the Jia Ping reign (嘉平), during the upper purification (上浣), by Ruo Gu (若谷) Shen Yu (沈裕) in the Stone Chamber (石室) of Jincheng (锦城).\n\n---\n\n**Autobiographical Note (自序)**\nIn my youthful vigor, I wandered the four quarters, penetrating the fleeting nature of human existence (人世蜉蝣).\n\n「In the winter of the tenth *Gui* (癸) and fourth *Mao* (卯), I gained entry into Shu (蜀), witnessing the rugged and extraordinary landscapes, the shifting and changing of all things, and thus further affirming the Dao/Way’s principle of *造化* (creative transformation)—that it exists in both form and formlessness.\n\nIn the autumn of the sixth *Ji* (己) and tenth *You* (酉), I retired to the secluded grove of cypress trees (柏森森) in Rongcheng (蓉城), withdrawing from worldly dust to cultivate the pure and void, devoting myself solely to the evening and morning contemplation of the *Yinshu* (《阴符》).\n\nA guest asked: *\"Why do you take such delight in reading this text?\"* I smiled but gave no answer.\n\nThe guest further inquired: *\"I have heard that the *Yinshu* was composed by the Yellow Emperor (黄帝), others say it is a text from the Spring and Autumn Period (春秋), while Zhuzi (朱子) attributes it to the enlightened figures of the Warring States Period (战国). Now some call it a treatise on nurturing life (养生), others on royal governance (王政), and still others on military strategy (兵法). As for the various commentaries by scholars, they differ widely. I wish to know its full meaning.\"*\n\nI replied: *\"Your words are all correct yet all incorrect.\"*\n\nThe guest, indignant, reproached me: *\"How dare you speak so frivolously!\"*\n\nI said: *\"I do not speak frivolously. The *Yijing* states: 'The benevolent see it as benevolence; the wise see it as wisdom.' Thus, those who withdraw from the world may regard it as a text on nurturing life—correct. Those who govern may call it a treatise on royal governance—also correct. And those who study martial affairs may see it as a text on military strategy—equally correct. But if one insists on any one interpretation as the absolute truth, then it is wrong. The *Yinshu* transcends all rigid categorizations, its principles extending to all things and all reason, and thus it fulfills its purpose. It is the original text of the *Kongtong* (崆峒) tradition, the foundational scripture for all three teachings (三教) and the hundred schools (百家), elucidating the fundamental origins and ultimate ends of heaven and earth. It reveals the nature of humanity before birth and after, the reasons for life and death. For heaven, earth, and humanity are the three powers (三才) yet unified in principle (一理). Thus, it expounds the Dao/Way of heaven to clarify the Dao/Way of humanity, concise in words yet comprehensive in meaning, profound in doctrine yet simple in practice.\n\nIn summary, it begins with discerning subtle changes in things, proceeds to understanding movement and timing, and then to preventing disasters and failures. Its thoroughness from start to finish lies solely in the cultivation of natural stillness (自然至静) and adherence to the principle of *Fatianxingjian* (法天行健, \"acting in accordance with heaven’s virtue/power and the vigor of the Dao/Way\"). If one can truly comprehend, prevent, embody, and practice these, then one may transcend the realm of life and form, reaching the domain of silence and scentlessness (无声无臭), forgetting both birth and death, and uniting with the Great Void (太虚). How could it merely be about nurturing life, royal governance, or military strategy alone?\n\nThe claims of the Spring and Autumn and Warring States periods are unfounded; let them remain undiscussed for now.\n\nBecause you cling to distinctions, I say your words are all correct yet all incorrect.\n\nThe guest said: *\"Since I have heard your explanation, and you have devoted such care to it, you must surely have gained insights from it. Why not reveal the secrets you have uncovered and compose your own commentary to share with like-minded scholars, instead of keeping them hidden?\"*\n\nI replied: *\"Alas! Long ago, Master Lu Zhiqing (陆子静) said: 'The Six Classics are interpreted by me; how could I then again interpret the Six Classics?' The same holds true for the *Yinshu*.»\n\nThe guest said: *\"No, I know of the saying: 'Obtain the symbol and forget the words; obtain the principle and forget the symbol.' This is akin to catching the fish and forgetting the basket. But can one who is still using the basket to catch the fish forget it?\"*\n\nI replied: *\"Though it may be so, I do not dare to conceal it. But if one reveals their limited understanding in ink and paper, it is bound to be flawed. Those who claim it is correct or incorrect truly cannot know whether they speak truth or error, nor can they recognize their own frivolity. The tenth *Gui* (癸) and fifth *Wu* (戊), on the day of the spring equinox (仲春之望), the Daoist recluse Zhang Qingye (张清夜) of Changzhou (长洲) inscribed this at Ziyang Cave (紫阳洞).*\n*Upper Volume of *Yinshu Faxi* (《阴符发秘》)*\n*Commentary by Zhang Qingye (张清夜), the Eighty-Year-Old Child of Changzhou (长洲八十老孩)*\n*To observe the Dao/Way of heaven (观天之道) and to follow its course (执天之行) is to exhaust its fullness. 【Annotation: The Dao/Way of heaven is boundless void and tranquil stillness (冲虚静漠), not self-generating yet giving rise to all things. Heaven’s course is impartial and follows its own rhythm (无私任运), not transforming others yet transforming all things. Between these two lies the interplay of *qi* and mechanisms (气机阖辟), the exchange of sunlight and moonlight (日月交光), all pivotal operations of creative transformation (造化枢机) and profound models for self-cultivation (修身玄范). If one can truly discern these and embody them, then the full potential of the *Yinshu* is realized.】*\n\nHeaven has five thieves (五贼); those who see them flourish. The five thieves dwell within the heart, yet their influence extends to heaven. With them, the universe lies within one’s grasp, and all transformations arise from the body. 【Annotation: The five thieves of heaven are the offspring of the interactions between heaven, earth, yin, and yang (天地阴阳化生之子), such as colors, sounds, odors, tastes, and tactile sensations (色声臭味触之类). The five thieves dwelling within the heart are the perceptions and sensations born of human nature (天性所生之知觉), like those of the ears, eyes, nose, tongue, and body (耳目鼻舌身之类). These five can agitate the emotions, lead one astray through personal desires, and cause confusion and fixation, leaving them unaware until death—just as the *Taishang* (太上) says: 'The five colors blind the eyes; the five tones deaf the ears.' If one can recognize and penetrate these illusions, not mistaking the thieves for their own children, then they act in accordance with heaven. To act in accordance with heaven means to treat the five thieves as mere straw dogs (刍狗), without attachment or words. If one can truly do this, then the six directions become one body, and the ten thousand years one thought. The body aligns with creative transformation, and the heart governs the mechanisms of *qi*.】*\n\nHeaven’s nature is humanity (天性，人也); humanity’s heart is the mechanism (人心，机也). Establish the Dao/Way of heaven to settle humanity. 【Annotation: The heart that is not ensnared by the five thieves is heaven’s nature—its true essence, untouched by thought or action, serene and unmoving. The common person’s emotions, when confronted by sounds and colors, spawn countless distinctions of love and hate. These distinctions are the perilous mechanisms of the heart. If one quiets these mechanisms and fully harmonizes with heaven’s nature (尽性合天), then the heart and nature, heaven and humanity, are as one. To establish and to settle reflect a resolute understanding, without the slightest deviation or compromise.】」\n\nWhen heaven unleashes its *killing mechanism*, the stars shift their lodges; when earth unleashes its *killing mechanism*, dragons and serpents rise from the land. When humanity unleashes its *killing mechanism*, heaven and earth reverse their cycles. When heaven and humanity both unleash their *killing mechanisms*, the foundation of all transformations is set. 【*Killing mechanism* (杀机) refers to the latent movement of *qi* (气机), which, when stirred, disrupts the natural harmony of life and death. The stillness of *non-being* (寂然不动) and the fluidity of *being* (生灭两融) are disrupted by this stirring motion, as all things—from humble offerings to living creatures—are swept along by it. This is the meaning of *killing mechanism*, the implication of heaven and earth’s *non-virtue* (天地不仁). When the three luminaries shift rightward and the constellations move leftward, their light descends to illuminate below—this is the *supreme yin* (至阴), solemn and restrained, arising from heaven and merging with earth. When dragons and serpents emerge from their dormancy, ascending with vigor, the *qi* surges and stirs all things—this is the *supreme yang* (至阳), radiant and fierce, arising from earth and ascending to heaven. The human body is a miniature heaven and earth; when its *qi* and mechanisms (气机) swirl and move, it circulates through the six *emptinesses* (六虚), and the *kan* and *li* trigrams invert. Is this not the reversal of heaven and earth within humanity? The union of heaven and humanity’s mechanisms (天人合发) is thus: humanity exists within the interplay of yin and yang, yet its *qi* and mechanisms cannot align with heaven and earth’s movements, for it lacks self-mastery, surrendering instead to the five thieves’ (五贼) relentless drive. Thus, it diverges from the Dao/Way of heaven and fails to conform to its natural unfolding (天行). Having established heaven’s Dao/Way to settle humanity’s heart, heaven and humanity become indivisible. When humanity unleashes its *killing mechanism*, all things in heaven and earth move in concert with it—this is the union of heaven and humanity’s mechanisms (天人合发). *Millions of transformations* (万化) are rooted in this: at the moment when heaven and humanity’s mechanisms coalesce, it seizes the essence of heaven and earth’s harmonious interplay, and the subtleties of yin and yang’s transformative power. Only then can one firmly grasp the *Great Primordial Mechanism* (太机), re-establish the *foundational element* (根元), and thus the eternal generation of *non-being* (不生之生) and the pivotal transformation of *non-transformation* (不化之化) are realized. The essence of this passage lies entirely in the phrase *heaven and humanity’s mechanisms coalesce* (天人合发), encapsulating the core intent of this chapter of the *Yin Fu Jing* (《阴符经》).\n\nThe *yin* (阴) in *Yin Fu Jing* is not to be mistaken for *darkness* (暗). In antiquity, it was spoken of as *divided yin* (分阴) and *inch of yin* (寸阴), referring to *time* (时). According to the *Shen Tong Qi* (《参同契》), the meaning revolves around restraining the gates of *qi*, hastening the moments of *yin*—this is the essence of *seizing the moment and acting* (乘时下功), *stealing and seizing* (盗夺). The proof lies in the middle passage: *To eat of its time, all limbs function; to stir its mechanism, all transformations are at peace* (食其时，百骸理；动其机，万化安).\n\nNature has skill and clumsiness, yet it can be concealed. The nine orifices’ (九窍) malevolent influences lie within the three most vital: ears, eyes, and mouth—these can be regulated in motion or stillness. 【*Nature* (性) here refers to the innate *qi* and mechanisms within humanity. The sages’ nature aligns with heaven and earth, while common folk’s nature varies in skill and clumsiness, yet all can be concealed. *Concealed* (伏藏) means *retreat and hide* (退藏于密). For instance, when heaven gradually emits yang, the true yin remains dormant within earth, brewing the true yang. Only then can the solemn and radiant mechanisms of yin and yang rise and fall, ascending and descending, to achieve boundless brilliance and depth. Humanity’s inability to endure eternally stems from its failure to understand concealment. The reason for this failure lies in the neglect of the nine orifices within the body. These nine orifices are the gateways through which heaven’s nature and the five thieves interact. Without them, the five thieves cannot lure heaven’s nature into following evil, nor can the human heart transmit the five phases to disturb nature. Yet one must know that among the nine orifices, the most responsive are the ears, eyes, and mouth—the *three vital senses* (三要). These are the critical junctures for the sage’s work. When they move and *qi* leaks outward, they become the leaders of evil intrusion. When they are still and concealed, they serve as the bridge to cultivating the Dao. Thus, the ability to regulate the three vital senses in motion or stillness is the hinge upon which humanity’s ascent to sainthood or descent into madness turns.】\n\nThis passage of the *Yinfu* contains but twenty-four characters. If one believes and practices it sincerely, it truly holds the power to transform the ordinary into the sage. How can readers of the *Yinfu* afford to glance over it carelessly?\n\nIn my youth, I delighted in reading the *Yinfu*, never tiring through summer or winter. One day, in a state of thoughtless, dreamless stillness, I suddenly heard someone else reciting this scripture. At this passage, the words differed greatly from what I knew. I still recall their phrasing:\n\n*\"The heart arises from nature; when intention is raised, it must be subdued.\nQi gives birth to essence; when emotion stirs, it must be dispersed.\"*\n\nAt the time, I took this as a reckless alteration of the sacred text, and I was deeply displeased. But upon waking and reflecting, I found it subtly profound.\n\nTruly, fifty years ago, the ancient sages and worthies must have foreseen that someone would annotate the *Yinfu* today.\n\nHow strange it is!\n\n---\nFrom *The Hidden Secrets of the Yinfu*, Middle Scroll\nBy Zhang Qingye, an eighty-year-old child of Changzhou, revising the annotations:\n\n*\"Heaven’s birth and heaven’s death—this is the Dao’s principle.\"*\n\n**[Annotation:]**\nThis passage specially clarifies the true moment when heaven and humanity act in unison, as well as the fixed signs when humanity unleashes its killing intent. The first chapter does not yet plunge directly into the matter, so it first speaks of how all things flourish when born from heaven and earth, and wither when the time of austerity and death arrives—this is the natural order, as the *Tao Te Ching*’s *Supreme Ultimate* says: *\"Heaven and earth are without benevolence; they treat all things as straw dogs.\"* By \"without benevolence,\" it means heaven has no partiality—what is there of benevolence or cruelty? Just as the text says: *\"Heaven’s birth and heaven’s death—this is the Dao’s principle.\"*\n\n---\nHeaven and earth are the thieves of all things;\nAll things are humanity’s thieves;\nHumanity is all things’ thief;\nWhen the three thieves are harmonized, the Three Powers are at peace.\n\n**[Annotation:]**\nHeaven and earth bring about the rise and decline of seasons, marking the renewal and decay of all things—this is the principle of *\"Heaven’s birth and heaven’s death\"* from above. Yet humanity and all things prey upon one another: when all things cater to human desires, they can rob humanity of its true nature, hence *\"all things are humanity’s thieves.\"* Again, when humanity exploits all things to the point of destruction, it becomes *\"humanity, the thief of all things.\"* These are the three thieves not in harmony.\n\nIf humanity can eliminate the five thieves, recognize the *Heavenly Symbol*, and follow the times to observe transformations, then not only will it not be stolen by all things, but it will also be able to plunder the creative transformations of heaven and earth. Is this not the position where heaven and earth stand firm while all things flourish?\n\n---\nThus it is said:\n*\"Eat in season, and the hundred bones align;\nStir the mechanism, and all transformations are at peace.\"*\n\n**[Annotation:]**\n*\"Eat\"* here means to obtain [the Dao] as if intoxicated. *\"Stir\"* refers to the rising of dragon-serpent qi on land—the vital mechanisms of the human body. This passage directly follows the earlier *\"Eat in season\"* five characters, showing that the meaning of *\"the time of use\"* was already implied in the previous two sections.\n\nTo *\"eat in season\"* and *\"stir the mechanism\"* is for the sage to point out the moment when one practices. When the mechanism stirs, there is a fixed time; when the time arrives, the spirit knows it. Yin and yang revolve, earth marrow and [heavenly] [left: *yǐ* right: *yú*] converge, returning to the five viscera. The zang-fu organs relax in harmony, and form and spirit both attain marvelous refinement—now aligned with the Dao.\n\n---\nHumanity knows the spirit’s spirit,\nBut does not know how the unmanifest spirit manifests.\n\n「The spirit’s spirit refers to the uncanny and unfathomable—its extraordinary, unpredictable nature. The *unmanifest spirit* that manifests is the most ordinary yet most vital essence, seen by all yet fully unrecognized as the transcendent source that harmonizes with heaven and earth and nourishes all transformations. Were it not for this text directly pointing it out in its proper context, one might as well perish of thirst at the Yangtze’s head—never grasping its true significance.\n\nThis passage serves to introduce the subtle meaning of the daily and monthly cycles of small and great changes below. It first illustrates the phrase *\"the unmanifest spirit that manifests\"* to prove that the true emergence of divine illumination lies within this very unmanifested yet manifesting essence.\n\n---\nThe sun and moon follow their courses, their small and great cycles are fixed. From this, the sage’s work arises, and divine illumination manifests.\n\nThe explanation continues from the previous discussion of the *unmanifest spirit*—how the sage’s work comes to life and divine illumination emerges from it. Consider the sun’s ascent and descent, the moon’s waxing and waning—from youth to decline, from antiquity to the present—visible at every glance, yet their nature remains unrecognized. One fails to see that the transcendent power to transcend birth and death, to manifest all divine transformations, lies precisely here.\n\nIn these four sentences, only two words carry the essence of the text: the first two sentences emphasize *fixed*, and the latter two, *arise*. The sage’s work arises from the fixed cycles where the sun and moon intersect. How so? The sun and moon follow their courses through the *Great Heavenly Cycle*—the sun advancing one degree daily, the moon thirteen degrees and a fraction daily. When the sun and moon align in their respective phases, there are six *candidates* each month: three *Yang* phases before the full moon, corresponding to the *Zhen, Xuan, Qian* trigrams; and three *Yin* phases after, corresponding to the *Xun, Kan, Kun* trigrams. Together, they complete the sun’s five-degree daily movement and the moon’s sixty-degree monthly progression, hence the saying: *\"The moon’s nodes are five and six; the stars and constellations obey the sun’s command.\"* It is also said:\n\n*\"When the Yin fire subsides, the Yang fire fades,*\n*Its logic divides between rest and motion, following the *Xipao* lines.*\n*Further, it moves with the black and white of day’s edge,*\n*And the six candidates end at the eclipse of new and full moon’s exchange.\"*\n\nThis reflects the human body’s *Small Heavenly Cycle* of a month.\n\nThe sun, from the winter solstice, brings forth one *Yang* degree, advancing thirty degrees monthly, and in three hundred and sixty days, it intersects with the moon’s twelve *constellations* (*Xiu*)—this corresponds to the human body’s *Great Heavenly Cycle* of a year.\n\nWhen discussing the moon’s *small and great cycles* being fixed, it specifically refers to the harmonized response of heaven and humanity to the transformative timing of creation, where the three days before and after the new and full moon total seven days as *great*, and the three days before and after the two quarters total fourteen days as *small*. Now, the *Yin mechanism* responds only to the *great* and not the *small*, so the emergence of the *Great Medicine* must occur during the conjunction or full moon phases.\n\nThe text states: *\"Two sevens gather, supporting and shielding humanity\"*—this refers specifically to the three days before and after the new and full moon.\n\n*The Secret Transmission of the Mysterious Pulse* says: *\"The Perfect One practices, aligning with the sun and moon, calling it the Fire Seal.\"* The reason lies in this: all the water and fluids of humanity and earth—heaven—are transformations of the *Primordial Qi*. Thus, *Qi* is called the \"mother of water,\" yet one fails to see that the moon is the total sustainer of all *Qi* and all water. Even *Ghibber* says:\n\n*\"When the moon’s crescent is full, the body’s *Qi* and blood are abundant,*\n*Muscles firm and strong.*\n*When the moon’s crescent is empty,*\n*Muscles weaken, the *Wei Qi* departs,*\n*And the form stands alone.\"*\n\nThe aquatic creatures follow this pattern too: when the moon is waning, fish brains diminish; when the moon is full, clams and oysters are plump.\n\nThus, the *Yin Seal*’s grand principle aligns with the sun and moon, measuring the great and small phases, and acting in accordance with the timing—then the *Qi* mechanisms of heaven, earth, and the human body naturally follow the *Yin-Yang* correspondence, sealing and moving in harmony, known as *Wu Ji*. The *Wu Ji* of heaven aligns with the *Wu Ji*—the moon’s *Kan* water flows to the *Wu* day, the *Li* fire aligns with the *Ji* day, hence the term *heavenly Wu Ji*.\n\nOnce the *Fire Seal* is complete, all transformations begin anew—what need is there to fear that the sage’s work will not be sublime, or that divine illumination will not be extraordinary? This is the proof of what *Pure Yang Master* said:\n\n*\"There is a method of cultivation in the human realm,*\n*Pointing to the sun and moon’s wheels in the heavens.\"*\n\nThis is the very evidence.\n\nIt is also said:\n\n*\"Beneath the earth, the tides rise and fall like the moon above,*\n*Their waxing and waning follow the moon’s phases in response.\"*\n\nThis is the mechanism of ebb and flow, retreat and advance—\nthe very workshop of creation in the void.\nNot only this, but even the great breathing of heaven and earth,\ntheir mutual resonance,\nall take the moon’s greatest influence as their measure.\nObserve the three days before and after the new and full moon:\nthe moon’s influence is great, and the tides are great.\nObserve the three days after the two quarters:\nthe moon’s influence is small, and the tides are small.\n\nCui Xi Fan’s *Mirror of the Celestial Element Entering Medicine* states:\n*\"Heaven responds to stars, earth responds to tides.\"*\nAll follow this principle.\nHence, it is said: *\"small and great cycles are fixed.\"*\nThis interpretation truly reveals the *Yin Seal*’s profound, untransmitted essence across millennia.\n\n---\nAs for those who steal this mechanism,\nno one under heaven can perceive or comprehend them.\nThe *gentleman* who attains it safeguards his life,\nwhile the *petty man* who attains it risks his fate.\n\nThe explanation says:\nTo employ the *unmanifest spirit*’s essence,\nto harness the *non-action*’s power,\nto align with heaven and humanity’s timing,\nto resonate with the sun and moon’s seals,\nand to practice secretly, seizing opportunities in silence,\nblending with the mundane while preserving brilliance—\nthen his sinews and bones grow firm,\nand his spirit and form both reach marvelous refinement—\nthis is the *gentleman* safeguarding his life.\n\nThe lesser scholars hear this and laugh it off,\nor they borrow its divine power,\nrelying on their talent to act recklessly,\nuntil they meet ruin—losing their lives and their families,\ndying without enlightenment.\nIs this not to scorn the study of heaven and humanity as mere feathers,\nto equate life’s worth with dust?\nThis is the *petty man* risking his fate.\n\nThe proverb says:\n*\"A wicked man attains the true method—*\n*the true method becomes entirely wicked.\"*\nThis refers to the same.」\n\nThe Eighty-Year-Old Child of Changzhou, Zhang Qing, annotates at night:\n\nThe deaf excel in vision,\nthe blind in hearing.\nSevering one source of sensory gain,\nits use multiplies tenfold.\nReturning threefold through day and night,\nits use multiplies ten thousandfold.\n\n**[Note:] The opening chapter reiterates the three essentials of stillness and concealment from the previous scripture—all hinging on returning to the source and internal concealment. It also introduces the most subtle and vital principle within the three essentials, serving as the true pivot for attaining sainthood. Hence, it first speaks of severing the ear’s sensory gain—doubling even the clarity of hearing—and severing the eye’s sensory gain—doubling even the acuity of sight. What then of all three roots fully returned, and yet able to press on without respite through night and day? The thieving of essence and slaying of life’s bandits—how could its power be measured?**\n\nThe mind arises from things,\ndies from things—\nits mechanism lies in the eye.\n\n**[Note:] Among the three essentials of ear, eye, and mouth, why is the eye considered first? Because of this: Originally, at the dawn of human life, a single point of primordial spirit coalesced within, unaware and unknowing. Day by day, it grew into awareness, and the primordial spirit transformed into discerning mind. Then, the two eyes ascended, and the mind generated love and aversion, rising and falling with things. Thus, though intention rules the six senses, the eye is truly the vanguard of the five thieves. If this essential is returned to its source, the remaining nine gates and three essentials will return of their own accord.\n\nHence it is said: *The mind arises from things, dies from things—the mechanism lies in the eye.*\n\nI have heard that in Buddhist scriptures, the six senses and six dusts place the eye first. The *Taoist Canon*’s *Xi-Yi-Wei* ranks vision as paramount. Confucius’ four admonitions begin with *Do not gaze*. Even Emperor Yao’s reverent clarity and King Tang’s sagacious insight, the *Heart Sutra*’s *Omniscience*, the *Dao De Jing*’s *Observing the unobserved*, the Yellow Emperor’s three-month inward gaze, and the *Yin-Fu*’s *Mechanism in the eye*—the sacred sources of the Three Teachings all regard this as the pivotal turning point and the bridge for discerning the Way.**\n\nHeaven’s greatest cruelty breeds its greatest mercy:\nSwift thunder and fierce winds\nstun all things into motion.\nSupreme joy overflows essence,\nsupreme stillness preserves purity—\nHeaven’s utmost selfishness\nbecomes its utmost public use.\n\n**[Note:] The previous chapter spoke of blind inward observation as the function of returning light and illuminating darkness. This passage reveals the profound mystery of hearing resonance and awakening the mechanism.\n\nOrdinary people, entangled in affairs and clinging to worldly passions, do not recognize their original true awareness. Unless, in a moment of unintended shock—like thunder or lightning—they are briefly freed from their deluded nature, how could their innate purity ever be revealed? Hence it is said: *Heaven’s display of merciless thunder and lightning stuns all things—creeping, flying, moving, or rooted—into sudden awakening.* At such times, those who truly seek the Way naturally receive it directly.\n\nSupreme joy is the joy of Confucius and Yan Hui—the Western Sage’s *dhyanic bliss and lawful rapture, never before attained*. *Overflowing essence* means fully possessed. It speaks of how, in that instant of impact, the entire nature manifests—its boundless embrace permeating the six directions, yet utterly still and untainted. Hence it is said: *Supreme joy overflows essence, supreme stillness preserves purity.*\n\nIn my view, a single shock of cosmic void is but the collision of two *qi*—a fleeting occurrence. Yet what of the public or private? Still, no function is more divine than this single strike: Hence, Master Lü’s words—*Brightly illuminated, yet no trace remains; within the thunder’s crash, the root is spontaneously attained*—mirror the Zen school’s striking gongs, shouting, or prodding with staves, all meant to reveal this marvel of the ear’s perfect penetration.\n\nNot only this—even the three bodies of the Buddha do not surpass it. Why? Because *swift thunder and fierce winds stun all things into motion* means hearing the voice and receiving the Way directly, awakening all sentient beings to their Buddha-nature—that is the *Transformation Body*. *Supreme joy overflowing essence* means transcending delusion, body and mind at ease, the nature’s vast embrace pervading the *dharma-realm*—that is the *Reward Body*. *Supreme stillness preserving purity* means profound stillness, the Unmoved One, originally devoid of taking or rejecting, untouched by defilement—that is the *Dharma Body*.\n\nThe Buddha’s three bodies are nowhere else so clearly illuminated.**\n\n「The formation of birds is governed by *qi*. 【The note says: Birds are creatures of flight and exuberance, embodying the celestial nature that cannot be subdued or concealed. *Qi* is the primordial breath of *Tàihé* (Great Harmony), the subtle essence that resonates between heaven and humanity, the supreme treasure that alone can nurture emotions, embrace innate nature, condense essence, and refine spirit. The true essence unharmed by the Five Evils (of excess) originally coalesces through the interplay of yin and yang, refining the Five Agents (of wood, fire, earth, metal, water). Why then does this *qi* govern the formation of birds? Now, the spirit soars freely in the realm of worldly splendor, while *qi* succumbs to the depths of love and desire. Thus, the Sage, compelled by necessity, reveals the subtle principle of mutual regulation and completion.\n\nThe relationship of spirit to *qi* is akin to that of male to female, or fire to kindling—today, the formation of birds is governed by *qi*, just as the female is used to pair with the male, and kindling is employed to ignite the fire. Then, even the wandering soul may yearn for its lost home, and not stray like clouds or wild geese in flight.\n\nBut the intent is to harness *qi*—the scriptures never speak of *qi* within the body, but rather emphasize the mechanism where heaven and humanity converge in perfect harmony. For this physical form is of tangible substance, all belonging to postnatal development and thus cannot be utilized.】\n\nLife is the root of death, and death is the root of life; favor breeds harm, and harm engenders favor. 【The note says: All things that are born must die, hence it is said that \"life does not persist in life.\" The original spirit dies yet is reborn, hence \"learn death before death arrives.\" How so? The innate nature remains unshaken, ever abiding in stillness—what need is there for humans to speak of coming and going, birth and death? Yet, when the human heart strays outward in pursuit, one must skillfully practice concealment and restraint.\n\nConcealment and restraint is the Way of \"learning death before death arrives\"—the root of life lies in death. If one does not practice concealment, it is called life. The cycle of life and death is merely the heart’s attachment to things—once the heart clings to emotions and objects, the body itself changes and perishes with time. Hence, \"life does not persist in life,\" for death is the root of life.\n\nFavor arises from harm: the dragon and great serpent emerge from land, rooted in the devastation of frost and snow; thunder shakes and winds rage, beginning in the dormant season of hibernation.\n\nHarm arises from favor: wickedness festers in the realm of desire, and its fruition is sure to collapse; when leaves flourish and flowers bloom, it is the very beginning of their ruin.\n\nNot only this—even human emotions and worldly affairs follow the same pattern. Thus, the axe and poison often lurk in the midst of banquet and wine, while arrows fly and stones are cast by those who were once intimate in day and night. This is why the *Tàishàng* (Supreme Ruler) speaks of \"honor and disgrace as if they were sudden shocks,\" and the *Huǒhòu Tú* (Illustration of Fire and Timing) contains the principle of \"virtue and power mutually supporting yet opposing.\" All beings, both within and beyond the world, must heed these words.】\n\nFools revere the patterns of heaven and earth as sacred,\nI perceive the patterns of time and things as profound wisdom.\n\nThe annotator says: *\"People see the purpose of observing heaven and earth as lying in the stars and patterns of the earth, assuming that the study of the* Yīnfú *(*Obverse of the Mysterious*) must be found in celestial omens and terrestrial markings. They go so far as to dissect numbers, trace scriptural threads, and follow textual patterns—yet they fail to grasp that the Dao of seizing divine efficacy and altering fate lies not therein. Thus, those who revere the patterns of heaven and earth as sacred are fools.\n\nAs for the profound wisdom of time and things—this is what the earlier text means by 'not divine yet divine.' Time refers to the moment when calamity’s mechanism is set in motion; things refer to the tumult of desires. If one can, at the moment when calamity’s mechanism is set in motion, not only prevent it from reaching an inevitable victory or collapse but also know, cultivate, and even reverse it—then the pattern of time is already clear. If one can, amid the enticing chaos of desires, not only prevent mutual destruction and theft but also turn the mechanism inward, illuminate from within, gather and conceal—then the principle of things is truly profound.\n\nYet this pattern of time and this principle of things—are they not the very moments, from dawn to dusk, in every step and thought, every touch and encounter, where the closest is not distant and the most ordinary is the pivotal threshold for the transformation of the common and the sage? Fools abandon this for other paths—is this not seeking the far while discarding the near? The ancients said: 'The cauldron and furnace are natural, the medicines are ready-made, the talismans are spontaneously ignited'—these three phrases could only be spoken by the Sage after personal, verified practice.*\n\n---\n\nPeople deem me foolish and simple, yet I deem the Sage foolish and simple. People expect the Sage to be extraordinary, yet I expect the Sage to be unremarkable. To sink in water or plunge into fire is to court one’s own destruction.\n\n*The annotator says: The Sage appears plain and unadorned, blending with the dust of the world, while the vulgar shine brightly. I alone seem dim. Thus, when people measure the Sage by folly, they underestimate, like water sinking. The universe lies within the hand; all transformations arise from the body. From here, sage efficacy is born, and divine clarity emerges—this is the Dao of natural effortlessness. When the world measures the Sage by the extraordinary, they overestimate, like fire entering—both fail to speak of the Way. To sink in water or plunge into fire is to court one’s own destruction—just as the proverb says, 'Spitting upward at heaven only soils one’s own face.' Hence, I say: Only when the True Person arises does True Knowing arise. How could one know whether my Sage is not the people’s Sage, or the people’s Sage is not my Sage? Who knows whether my 'un-Sage' is the very Sage, or my 'un-divine' is the very divine?\"*\n\nThe Dao of Nature is still, and thus heaven and earth and all things are born. The Dao of heaven and earth is gradual, and thus yin and yang prevail. As yin and yang push against each other, transformation proceeds in harmony.\n\n*The annotator says: The first two sentences speak of the primordial—what is not born yet gives birth, with emptiness and stillness as the root of heaven and earth’s generation. The latter two speak of the subsequent—what gives birth does not itself arise, with the mechanism of yin and yang’s transformation following heaven and responding to time to flourish.\n\nThe Dao of Nature is still—this is the essence of the Primordial Supreme Ultimate. Stillness to its extreme becomes motion; motion to its extreme returns to stillness, and thus heaven and earth’s positions are fixed, giving rise to all things and beings.\n\nHow do beings arise? It is because of the gradual Dao of heaven and earth—gradual as moisture permeating dryness, seeping and soaking without cease, merely describing the movement of qi and the interplay of yin and yang. When yin and yang prevail, as yin gradually diminishes by a fraction, yang also gradually wanes by a fraction; as yin gradually prevails by a fraction, yang also gradually diminishes by a fraction. Thus, as they push and surge against each other, transformation proceeds in harmony, and all things and beings fulfill their growth.\n\nThis clarifies how the subsequent qi follows time in its nurturing. Yet the *Yì* says, 'To follow heaven’s timing,' knowing that this is the very moment when the *Yīnfú* speaks of the convergence of heaven and human, when time moves and time is consumed, when the sun and moon wax and wane—with no distinction in meaning. Later, the term *fire and timing* is used, showing that the *Yì*’s 'following heaven’s timing' is the origin of fire and timing’s principles.*\n\nThus, the Sage knows the Dao of Nature cannot be defied and acts accordingly. The Dao of utmost stillness cannot be measured by calendars or mathematical calculations, hence the creation of extraordinary instruments—those that generate all things, the Eight Trigrams, the Heavenly Stems and Earthly Branches, the divine mechanisms and hidden arts of yin and yang’s mutual prevalence—clearly manifesting in symbols.\n\n*The annotator says: This continues the earlier discussion of the Sage’s primordial Dao—heaven itself does not defy it, let alone humans. The Sage thus refines a method most precise and appropriate to exhaust the Dao of Nature. Yet the phrase 'acting accordingly' is still not a fixed law; it merely sets the stage for the following passage on 'extraordinary instruments.'\n\nThe Sage further states: The Dao of Nature is vast and formless, obscure and traceless—it cannot be sought through sound or calculated by symbols and numbers. Thus, the creation of extraordinary instruments becomes inevitable.\n\nAfter reviewing ancient and modern commentaries on the *Yīnfú*, I find that whenever the term 'extraordinary instruments' appears, they are either disjointed or fail to capture the text’s intent. Yet the first chapter of the *Yīnfú* itself has already explained it thoroughly. The text says: 'Establish heaven, define humanity,' and again, 'The foundation of all transformations is set.' The characters *establish*, *define*, and *foundation* are the hidden veins of 'extraordinary instruments.' This is also the *Yì*’s 'correcting position and solidifying fate.'\n\nHowever, the name 'extraordinary instruments' varies across texts: the *Dàodéjīng* calls it the *Mysterious Female*, the *Cāntóng Qì* names it the *Cauldron and Furnace*, and the *Huángtíng* refers to it as the *Dan Field*—names differ, yet their use is the same. All are metaphors for how the Sage steals yin and yang, concealing the workings of creation, necessarily requiring an established foundation and a place of cultivation.\"\n\nThe extraordinary is the name for what is paired;\nThe vessel is the repository of what is central.\nThus, the **Taiji** is the extraordinary vessel of heaven and earth,\nYet the extraordinary vessel is the **Taiji** of the human body.\n\nThis vessel does not stand alongside heaven and earth yet gives birth to them,\nDoes not consort with the myriad dharmas yet generates the myriad phenomena.\nIt transcends all living beings, most exalted with no equal—\nHence it is called the *extraordinary vessel*,\nTruly the origin of the Dao, the root of qi, the foundation of all transformations,\nThe progenitor of the *Yīnfú*,\nThe place where the Sage begins to act and apply his power.\n\nHere, the killing intent is unleashed from this vessel,\nHere, the Three Powers are stolen from this vessel,\nThe Three Treasures return to this vessel,\nAnd the unmanifested manifests itself here.\n\nFrom this vessel, nurturing yin and yang in accordance yields life for humans and things;\nFrom this vessel, reversing creation transforms one into a Sage or Immortal.\nThe Five Phases move, and the Eight Trigrams arise;\nThe Two Principles revolve, and the Heavenly Stems and Earthly Branches are arranged.\nUniting and tracing hidden mechanisms, the spirit beckons while ghosts retreat—\nSuch is the function of the extraordinary vessel.\n\nKnow that between heaven and earth, there are originally no myriad things,\nOnly myriad phenomena;\nOriginally no myriad phenomena,\nOnly trigrams and lines;\nOriginally no trigrams and lines,\nOnly Heavenly Stems and Earthly Branches;\nOriginally no Heavenly Stems and Earthly Branches,\nOnly the Eight Trigrams;\nOriginally no Eight Trigrams,\nOnly the Five Phases;\nOriginally no Five Phases,\nOnly the Four Symbols;\nOriginally no Four Symbols,\nOnly the Two Principles;\nOriginally no Two Principles,\nOnly the **Taiji**.\n\nObtaining the primal essence of the **Taiji**,\nThe Eight Trigrams naturally move within,\nThe Heavenly Stems and Earthly Branches naturally advance and retreat,\nAnd yin and yang naturally ascend and descend.\n\nWhen the perfecting of the Dao and the completion of its power is achieved,\nYin is exhausted and yang is pure, and the numinous naturally manifests.\nObtain this, and all things are accomplished—\nThis is the extraordinary vessel!\n\nOnce the true nature of the extraordinary vessel is attained,\nThen what was previously called the \"cosmos within the palm’s extraordinary power\"\nAnd the \"myriad transformations arising from the body’s marvel\"\nNow appears in the Three Treasures,\nFills the four limbs,\nPermeates the six directions,\nFills heaven and earth—\nClear and distinct, with nothing more manifest than this.\nThus it is said: *\"Shining brightly, it advances into the realm of phenomena.\"*\n\nAlas! The Three Celestial Luminaries shine in vain,\nThe myriad transformations are already complete—\nYet what does humanity do, that it would willingly abandon itself?\nStrive, oh strive!\n\n**First Scroll**\nObserve the Dao of Heaven, grasp Heaven’s actions.\n[*Complete.*]\n[*Commentary:* These two characters are a transmission—an encomium summarizing the entire text.]\n\nHeaven has five malefactors; those who perceive them prosper.\nThe five malefactors reside in the heart,\nand their operation extends to Heaven—\nthe cosmos lies within the hand’s power,\nthe myriad transformations arise from the body’s marvel.\n\n[*Heaven’s nature is humanity; humanity’s heart is the mechanism.\nEstablish the Dao of Heaven to steady humanity.*]\n[*Commentary:* These sixteen characters are a transmission—an exposition.\n*\"Heaven’s nature is humanity\"* elucidates the first two lines;\n*\"humanity’s heart is the mechanism\"* explains the five malefactors in the heart;\n*\"Establish the Dao of Heaven\"* clarifies the three lines on their operation.]\n\nThe above scripture comprises thirty-four characters.\n\nWhen Heaven unleashes its killing intent, stars and constellations fall;\nwhen Earth unleashes its killing intent, dragons and serpents rise upon the land;\nwhen humanity unleashes its killing intent, Heaven and Earth reverse their course;\nwhen Heaven and humanity jointly unleash their intent, the foundation of the myriad transformations is set.\n\nNature has skill and clumsiness, which can be concealed.\nThe nine orifices’ malevolence lies within the Three Treasures,\nand can be made to move or stilled.\n\nFire arises from wood—when calamity emerges, it must be overcome;\ntreachery arises in the realm—when it stirs, it must collapse.\nTo know and cultivate this is called the Sage.\n[*Heaven generates and Heaven kills—this is the logic of the Way.*]\n[*Commentary:* These eight characters are a transmission—an exposition.\nThe first segment embeds killing within generation;\nthe next embeds generation within killing;\nthe middle speaks of concealment and motion-stillness, demonstrating cultivation.\n*\"Heaven generates and Heaven kills\"* elucidates the logic of generation and killing in the Way, demonstrating cultivation.]\n\nThe above scripture totals seventy-six characters.\nIn all, one hundred ten characters.\n\nThe old text was composed as the upper section, yet the eight-character transmission was mistakenly taken as the opening line of the middle section. In the middle scroll:\n\n*The heavens and earth are the thieves of all things;\nAll things are the thieves of humankind;\nHumankind are the thieves of all things.*\n\nWhen the three thieves are harmonized, the Three Powers are at peace;\nThus it is said: *Eat of its season, and the hundred bones are in order,\nStrengthen its mechanism, and all transformations are at peace.*\n\nHumankind knows the spirit of the spirit,\nBut does not know how the non-spirit becomes spirit.\nThe sun and moon have their cycles,\nThe small and great have their limits;\nThus the Sage’s work is born,\nAnd the divine wisdom emerges.\n\n[*Its mechanism of theft is invisible—\nNo one in the world can see it, no one can know it.\nThe virtuous one who grasps it preserves himself,\nThe petty one who grasps it risks his life.*]\n\n【Commentary:】 A twenty-four-character transmission, an exposition.\nIt points to the mechanism of theft as the non-spirit of the spirit,\nThe hidden principle of the Sage’s wisdom.\n\nThe above scripture totals sixty-eight characters,\nThe old text as the middle section.\n\nIn the lower scroll:\n\n*The blind excel in hearing, the deaf excel in sight;\nSevering one source of profit,\nThe teacher’s use becomes tenfold;\nThree cycles of day and night,\nThe teacher’s use becomes ten thousandfold.*\n\n*The heart is born from things and dies from things,\nIts mechanism lies in the eyes.*\n*The heavens bestow no favor yet great favor arises—\nSwift thunder and fierce winds,\nAll things respond in confusion.*\n\n*Supreme joy is the nature’s excess,\nSupreme stillness is the nature’s restraint.*\n*The heavens’ utmost partiality,\nWhen applied, becomes the utmost public good;\nThe creatures’ design lies in their qi.*\n\n*The living are the root of the dead,\nThe dead are the root of the living.*\n*Favor arises from harm,\nHarm arises from favor.*\n\n[*Fools take the heavens’ patterns and logic as the Sage’s,\nI take the season’s patterns and logic as wisdom.\nPeople take folly as the Sage’s folly,\nI take non-folly as the Sage’s wisdom.\nPeople take the strange and the expected as the Sage’s,\nI take the non-strange and non-expected as the Sage’s.*]\n\n【Commentary:】 A thirty-seven-character transmission, an exposition of exclamations.\nPeople see the Sage sever profit and forget mechanism,\nAnd thus assume him to be foolish.\nThey see the Sage’s punishments and rewards,\nAnd thus assume him to be strange.\n\n*To sink in water and enter fire,\nIs to invite one’s own destruction.*\n*The Dao of nature is still,\nThus the heavens and earth, all things, are born.*\n[*The Dao of the heavens and earth is subtle,\nThus yin and yang prevail;\nYin and yang, in their mutual overcoming, bring forth transformations in harmony.\nThe Sage knows the Dao of nature cannot be defied,\nAnd thus regulates it accordingly.\nThe Dao of supreme stillness,\nCannot be measured by calendars and mathematical rules.*]\n\n【Commentary:】 A forty-two-character transmission, an exposition.\n\n*Hence there exists a wondrous instrument,\nWhich generates the myriad phenomena, the Eight Trigrams, the Heavenly Stems and Earthly Branches,\nThe divine and hidden mechanisms.*\n\n[*The art of yin and yang overcoming,\nIs clearly revealed in the patterns.*]\n\n【Commentary:】 This thirteen-character transmission is an exposition.\n\nAbove, the scripture comprises some **324 characters**, formerly designated as the lower section. In total, **142 additional transmission characters** are appended, yielding a combined text of **302 characters** in the scripture. Formerly, the total was **444 characters**, undifferentiated between scripture and transmission—a number far exceeding the three hundred mark. Now, by distinguishing their meanings, the scripture and transmission remain intact.\n\n**Appendix I: *The Vow of the Mystic Gate***\nIn the year **Gengyin of the Qianlong era** (乾隆丙寅), the **Pastoral Daoist** recorded in the quiet of night: After completing the rites of returning to bury my parents in the **Rensu year** (壬戌), I found myself suddenly detached from the world, as if my bonds had been severed.\n\nYet in the following year, **Guihai** (癸亥), I returned to **Sichuan**, dwelling in **Chengdu**, traveling between the **Qingyang Palace** and the **Wuhou Temple**. Reflecting on my fortunate circumstances, I grew ever more ashamed of my shallow self-cultivation. Day and night, I remained vigilant, striving for even the slightest progress, to repay the **Four Debts** above.\n\nBut since I have taken refuge in the **Pure Void**, there is no way to present my thoughts. Thus, I must lay bare what I have realized, to exhort those who follow.\n\nI declared to the assembly: The **Heavenly Dao is singular**, the **Sage’s intent is undivided**. Though their teachings may differ in form, their conduct is one. Thus, I know that **filial piety and fraternal duty, loyalty and sincerity** are the sovereign principles of the **Three Teachings**, while **rites, justice, modesty, and shame** are the fundamental threads of the **Sages**. Once the foundation is firm, ascension is no difficulty! But if the **Great Root is impaired**, how can one hope to ascend?\n\nAs for **heterodox and deceitful doctrines**, they arise from the errors of transmitters. Those who mislead the world and deceive the people do so because their learning is corrupt.\n\nMoreover, the **Five Thousand Words of the *Dao De Jing*** center on **clarity and stillness**; the **Four Hundred Characters of the *Golden Elixir*** seek only to **guard the true**; the *Paramartha Contract* and *Awakening to the True* make no mention of **summoning ghosts or driving spirits**; the *Heart-Seal Scripture* and *Green Flower Record* are not about **burning reeds or refining mercury**. Whether one practices **internal or external alchemy**, all depends on the depth of one’s **virtue and conduct**. Works like the **Saintly Stone’s *Pointer to the Mystic*** and **Master Cui’s *Mirror of Entering the Medicine*** are precise as **gold and jade**; the *Dragon-Tiger Scripture* and *Copper Talisman Iron Scroll* are as certain as **iron and stone**. Yet because their hearts are divided between public and private, their affairs meet with success or failure—and they blame their **forebears**, wandering through dusty kalpas, with no end in sight. How tragic!\n\nNow, I issue a **great vow of compassion**, pointing directly to the **true mechanism**, expounding the **essentials of the Way**, and swear by the **Azure**—dare you listen closely?\n\nFrom ancient times, those who **ascended in their earthly dwellings** were all **men of lofty virtue and abundant power**; those who **concentrated their spirits and harmonized their qi** were all **men of single-minded resolve**.\n\nThus, the **Three Thousand Eight Hundred** [precepts] stand with fixed measures,\nthe **Seven Returns and Nine Regressions** [1] are set by their ordained numbers.\nThe **True One’s** [2] *qi* of Embracing Reality is condensed through the **spirit’s** power—\nnot merely through swallowing essence and ingesting *qi*,\nbut when the **first stirrings of Yang** arise,\nit is met without contrivance, through **non-doing’s** natural convergence.\nIs it achieved by mere rigid sitting in empty void?\nOr does one merely tread the earth with certainty—\nwhen the work is done, success follows naturally—\nwhile others chase winds and shadows their whole lives,\nyet still fail to find a teacher in this age,\nthough teachers multiply and the **Way** grows ever more divergent,\nvirtue thins and minds grow ever more obscured.\nSome cling stubbornly to a single corner,\ndying without repentance;\nothers waver like a mouse’s head,\nnever making progress in life.\nSome feign madness to deceive others,\ntransgressing propriety with reckless abandon,\nwhile others exploit alchemy to ensnare the masses,\nbetraying principle and deceiving the heart.\nNo wonder the **Dao** is pursued by countless seekers,\nyet **transformation** remains as rare as rabbit’s horns—\neven to the point of burying corpses in wastelands,\nfilling ditches with the dead,\nevil winds following in succession,\nthe world recognizing their folly.\nThe **lineages of the Immortal Schools** are now nearly extinct.\nFor those who would heed this warning,\neach must **urgently reflect** and turn back without delay.\n\nStep by step, adhere to the **measure** and follow the **rule**;\nin all things, uphold **filial piety, fraternity, loyalty, and trustworthiness**,\nstrive diligently in **ritual propriety, righteousness, modesty, and shame**—\nknow that the **Great Dao** arises from **principles of order**,\nand beyond these principles, there is no **Great Dao**.\nThrough **broad and skillful means**, accumulate **meritorious deeds**,\nso that those who cultivate the **Inner Elixir** may subdue the **Dragon and Tiger** [3]\nand command reverence from **spirits and gods**,\nwhile those who focus on the **furnace’s fire** may dissolve **demonic obstructions**\nand gather **auspicious connections**.\nSeek thus, and attainment will be as certain as holding a **contract of guarantee**;\ntake this path, and success will be as easy as drawing from a **pouch**.\nAs for those who still doubt—\nlet them question the **Three Pure Ones** [4] in their hearts.\nIf they persist in slander,\nmay their **spirit** be consigned to the **Fourfold Realm of Retribution**.\n\n**Respectfully inscribed.**\n\n---\n**Appendix II: Postscript to the *Yinfu Jing* Stele of Qingyang Palace**\n\nMany have spoken of the *Yinfu Jing* [5].\nSome say it was composed by **Broad-Achieving Child** [6] and transmitted to the **Yellow Emperor**;\nothers claim it dates to the **Spring and Autumn period**;\n**Zhongyang Master** [7] asserts it was written by **Daoists of the Warring States**;\nstill others call it a treatise on **nourishment, governance, or warfare**.\nThe various commentaries diverge wildly, each inconsistent.\n\nI now resolve this with a single word:\n**All are correct, yet all are incorrect.**\n\nHow so? The *Yijing* states:\n*\"The virtuous see it as virtue, the wise see it as wisdom.\"*\nThus, those withdrawn from the world call it **nourishment**—correct;\nthose governing call it **statecraft**—also correct;\nthose of war call it **martial strategy**—equally valid.\nBut if one insists on which is *truly* correct,\nthen they are wrong.\n\nIts essence lies in what cannot be confined or fixed—\napplied to all things and all principles,\nyet never failing to strike the mark.\nThus is it the *Yinfu Jing*.\n\nIt is the **original text** of the **Kongtong transmission**,\nthe **ancestral script** of all **three teachings** and **hundred schools**,\ntracing the **origin and completion** of **dark and bright** [8] in heaven and earth,\nrevealing the **reason for life and death** before and after human existence.\nFor heaven, earth, and humanity share a single principle—\nthus it points to the **Heavenly Way** to illuminate the **Human Way**,\nits words concise yet encompassing, its meaning profound yet its practice easy.\n\nIn sum:\nFirst, it teaches **discerning mechanisms and observing things**,\nthen **knowing action and timing**,\nand **preventing collapse or defeat**.\nIts penetration from beginning to end\nrests solely on **natural stillness** as the **practice**,\nand **\"following Heaven’s vigor\"** as the **precept**.\nIf one can truly **know, prevent, embody, and act** in accordance,\nthen one may transcend the **born and formed**,\nand attain the **land of no sound, no stench**—\nforgetting birth and death,\nunifying with the **Great Void**.\nHow could it be limited to mere **nourishment, governance, or warfare**?\n\nThe claims of the **Spring and Autumn and Warring States** are baseless;\nI retain them without endorsement,\nfor I say: **All are correct, yet all are incorrect.**\n\nNow, **King Laitong** [9] has inscribed this text on stone at the **Daoist Hall**,\nhis **unshakable sincerity** not only advancing his own practice\nbut also inspiring future generations.\nThus, with joy, I write this postscript.\n\n**Written by the Daoist of Changzhou, Zhang Qingye.**\n\n**Qinglong Sixteenth Year, xīnwèi Fourth Month, Gǔ Rì**\nThe resident Daoist Master Wang Laichong respectfully established this inscription.\n**Appendix Three: A Biographical Sketch of the Self-Tending Daoist**\nComposed by Yang Runliu\n\nZhang Qingye, styled Zǐhái, with the Daoist sobriquet **Self-Tending Daoist**, was born Zhang Zūn. A native of Jiangnan’s Changzhou, he was born in the **Kangxi Fifteenth Year (1676, bǐngchén)**.\n\nIn his youth, he was a scholar-official, well-versed in learning and poetry, his calligraphy modeled after **Yán Rúgōng**, a celebrated figure of **East Wu**. He once traveled widely, his spirit unbound by worldly concerns. Upon reaching **Wudang’s Taizi Slope**, he took **yellow-crowned ordination** under Master Yú Tàiyuán.\n\nIn **Yongzheng First Year (1723, guǐmǎo)**, at age forty-eight, he ascended the river into Shu, traversing the wonders of **Emei and Qingcheng**. Witnessing the rugged beauty of mountains and waters, observing the shifts of human affairs, he grew ever more convinced of the subtle **presence and absence** of all things. He resided successively at **Línjiāng Temple in Chengdu**, **Xīzì Palace**, content with a single **zither and cot**, his solitude serene.\n\nEarlier, the **Shu provincial governor, Dú**, had repeatedly petitioned for an imperial decree, which was finally granted. His subordinates feared for him, but the Daoist merely adjusted a few characters in the petition, resubmitted it, and the matter was resolved. The governor was astonished and wished him to take office, but he declined, instead accepting the stewardship of **Wu Hou’s Shrine** (as recounted by Master Liú Yùbō).\n\nIn **Yongzheng Seventh Year (1729, jǐyǒu)**, at fifty-four, the Daoist moved to reside at **Wu Hou’s Shrine**, severing worldly ties, and immersed himself in **emptiness and stillness**. In his leisure, he studied the *Yīnfú*. With his remaining strength, he cultivated the **imperial mausoleum**, planting pines and cypresses, restoring halls and walls to pristine splendor. The shrine’s side courtyard held a lotus pond, planted by his own hands. A pavilion named **Ōu Chuán** stood to the south, beyond which lay the **Daoist Hall**—formerly called **Cángmì**—and further south, **Zǐyáng Cave**, its scenery profound and secluded. All these transformations were his doing (Note: In **Qinglong Fourth Year (1739, jǐwèi)**, at sixty-four, the Daoist inscribed the **ancestral tomb stele of Qingyang Palace** as **\"Reopening Wu Hou’s Shrine, Changzhou Daoist Zhang Qingye.\"** It is recorded that his administration of Qingyang Palace occurred in **Qinglong Eighth Year (1743)**, when he had only composed the stele, hence the self-inscription).\n\nIn **Qinglong Seventh Year (1742, rényǒu)**, at sixty-seven, he replanted cypresses in the rear hall (as per *Chéngdū Língmiào Zhì*). That year, he returned to Jiangnan to bury his parents, his mind and body freed from worldly cares, his spirit unbound. He was then sixty-seven.\n\nThe following year (**Qinglong Eighth Year, 1743, guǐhài**), he re-entered Shu. The **Hua yang magistrate, Ān Hóngdé**, and the **Chéngdū magistrate, Xià Shàoxīn**, having restored Qingyang Palace and its lands, honored his **high seclusion**, entrusting its management to him. The Daoist replied: *\"Though this is the ancestral hall of the Dao, it is within my duty. Yet I am old and powerless.\"* The prefect **Wén Gōng** (Note: The old records state the Chéngdū prefect was **Wáng Shíxiáng**) repeatedly urged him, and though he firmly declined, he allowed his disciple **Wāng Yīcuì** to take charge. The Daoist still frequently traveled between **Qingyang Palace and Wu Hou’s Shrine**.\n\nTwo years later (**Qinglong Tenth Year, 1745, yǐchǒu**), at seventy, he established **suspended bell and drum platforms** at Qingyang Palace to receive pilgrims from all directions. Daoist assemblies gathered in response, reviving the **pure rules**, and the place became a grand **monastic grove**.\n\nIn **Qinglong Eleventh Year (1746, bǐngyín)**, at seventy-one, reflecting on his fortunate circumstances, he lived in constant vigilance. He then composed *Xuánmén Jiébái*, expounding his realizations to guide future generations.\n\nIn **Qinglong Sixteenth Year (1751, xīnwèi)**, at seventy-six, **Resident Master Wang Laichong** inscribed the *Yīnfú* on stone, and the Daoist personally calligraphed it, adding his postscript.\n\nIn **Qinglong Nineteenth Year (1754, jiǎxū)**, at seventy-nine, he completed *Yīnfú Fāmì*, titling it **\"The Eighty-Year-Old Infant\"** (Note: At this time, he was actually seventy-nine). **Gǔ Yù** of **Yùshān** wrote its preface.\n\nIn **Qinglong Twenty-Fourth Year (1759, jǐmǎo)**, at eighty-four, Qingyang Palace’s halls were renovated, the work completed in stages over eleven years. A stele was erected for its reconstruction, with **Ān Hóngdé** as its inscription.\n\nIn **Qinglong Twenty-Eighth Year (1763, guǐwèi)**, the Daoist passed away peacefully at eighty-eight. His **snow-white hair** and **unbounded demeanor** were matched by his **refined speech and calligraphy**. He authored *Tán Dōng Cǎo*. Later, in **Qinglong Thirty-Seventh Year (1772, rénchén)**, **Fàn Yìbīn** of **Shènyáng** obtained a copy of *Fāmì*. As a disciple of **Shàoshān Master**, he recognized that the Daoist’s **secret precepts** aligned with his own tradition. Though the Daoist had already **ascended in body**, leaving no physical remains, Fàn lamented not having met him in person. Thus, he composed *Yīnfú Xuánjiě*, stating in its preface:\n*\"The Daoist was well-versed in **Southern Palace techniques**, yet his **inner elixir cultivation** led to transcendence. Alas, he departed before I could consult him face-to-face.\"*\n\nIt is further recorded that in **Mínguó Twenty-First Year (1932)**, **Master Liú Jiàobīn**, resident of Qingyang Palace, rebuilt the Daoist’s **tomb stele**, though its text was abbreviated. The *Chéngdū Zhì* also lacks detail.\n\nThe friend **Mèng Wéntōng**, citing the stele from Ānnán, learned that in the **Guānlóng jǐmǎo year** (1772), the Daoist was **eighty-four years old**. By examining various prefaces and records, he was able to **deduce** the Daoist’s **age, era, and life history** as follows. **Zhèng Fāngyīn** thus took this as the basis for his **separate transmission**, which may prove beneficial to those **seeking the lineage of the Dao**.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "新校张清夜《阴符发秘》 《阴符发秘》序 自序 《阴符发秘》上卷 《阴符发秘》中卷 《阴符发秘》下卷 《阴符经》经传订正 附录一：《玄门戒白》乾隆丙寅 附录二：青羊宫《阴符经碑》跋 附录三：自牧道人别传 新校张清夜《阴符发秘》序 吾友文通，近治道家言，既裒集唐道士成玄英、李荣二家《老子注、义》校而行之，又得清自牧道人张清夜所着《阴符发秘》，并次其年谱，将刻以行世，文通之用力于此勤矣。 因论禅宗为中国自成之佛学，而宋人之理学因之，道家之全真教又继禅宗及理学而起，此真能通三教之流别，吾不能易其言也。 自牧道人晚出，宜不能无取于全真教，惟范宜宾《玄解》嗣《发秘》而作，其《序》则谓：“自牧道人居蜀，素明南宫之术，却于内丹成道。 ”盖宋以后道家分南北二宗，北宗流为全真派，而南宗则未必然。 《发秘》所释天人合发、日月有数之旨加详，屡称《参同契》、张紫阳之书，皆南宗所奉为圭臬者也。 是自牧道人之学不可专以全真派目之。 《玄解》持论，则又似偏于南宗。 要之，道家自黄老以后，每降愈卑，惟庄周博大，能明无待之至游； 魏晋崇玄虚，亦尚不信神仙之说； 左元放、魏伯阳言补导，张紫阳宗之，以为南宗。 王重阳虽近禅，然其徒所论修习次第，不免于志在冲举。 故南北二宗实皆方术。 非古之所谓道术也。 夫入于术、则其运用不离乎声色形气之间，或拘于阴阳度数之末，术愈精而道愈小矣。 此道家之变也。 然自牧道人之学，固有所受之，而发之于《阴符》，其书甚为当世所重，又乌可忽乎哉!因序《发秘》，略申余意，并质诸文通。 时民国三十五年十二月谢无量序。 《阴符发秘》序 古圣贤书多据事以明理，惟《易》则空悬其象，而万事万理皆包孕其中。 后世兴亡治乱，即《易》之占验也； 古来经史子集，即《易》之注脚也。 《阴符经》殆与《易》为表里者欤!是经也，不过四百余言，而九天九地、无始无终、一本万殊、大含细入，其旨归所在，与《易经》贞下起元、静中含动，无二理也。 特其造语多奇，用字多险，后人遂于奇险处求之，致滋歧论而反晦其意。 试平心静气、反诸吾身而通诸载籍，则释氏之非空非色，老子之常清常静，与儒者之无极太极，皆一以贯之矣。 予乡牧道人去儒服改黄冠，腹笥甚富，寓居成都二十余年，于三教诸书外，深契是经之妙，所谓三盗五贼之用，杀机之发，奇器之秘，皆以身体力行者自写其会心之处，而津津道之，较之以郭注《庄》，尤见实际。 美矣道人之言曰：仁者见之谓之仁，知者见之谓之知，以《易》语序是经，始无遗蕴，而从前所称兵法云云，皆挂一而漏万。 予于是经非素所熟习，今得之而不能读，读之而不能尽解也，则亦以读《易》者读之、解《易》者解之而已。 乾隆甲戌嘉平上浣，若谷沈裕云书于锦城之石室。 自序 余少壮时，历游四方，洞悉人世蜉蝣。",
      "translated_text": "**Newly Collated Zhang Qingye’s *Unveiling the Secrets of the Yin Fu* (《阴符发秘》)**\n**Preface (序)**\n**Autobiographical Note (自序)**\n\n**Volume One of *Unveiling the Secrets of the Yin Fu* (《阴符发秘》上卷)**\n**Volume Two of *Unveiling the Secrets of the Yin Fu* (《阴符发秘》中卷)**\n**Volume Three of *Unveiling the Secrets of the Yin Fu* (《阴符发秘》下卷)**\n**Corrected Commentary on the *Yin Fu Jing* (《阴符经》经传订正)**\n\n**Appendix I: *The Mystic Doctrine’s White Explanation* (《玄门戒白》), Qing Dynasty Year Bingyin (乾隆丙寅)**\n**Appendix II: Epilogue to the *Yin Fu Jing* Stele at Qingyang Palace (青羊宫《阴符经碑》跋)**\n**Appendix III: Biographical Note on Zhang Qingye, the Daoist of Self-Pasturing (自牧道人别传)**\n\n---\n\n**Zhang Qingye’s *Unveiling the Secrets of the Yin Fu*—Newly Collated (新校张清夜《阴符发秘》)**\n**Preface (序)**\nMy friend Wen Tong, in his recent study of Daoist teachings, has not only collated and annotated the *Commentaries and Meanings of the Laozi* by Tang Daoists Cheng Xuan Ying (成玄英) and Li Rong (李荣) before publishing them, but has also obtained *Unveiling the Secrets of the Yin Fu* by Zhang Qingye, the Daoist of Self-Pasturing (自牧道人) from the Qing era. Alongside this, he has arranged his chronology and plans to engrave it for dissemination. Wen Tong’s diligence in this endeavor is truly commendable.\n\nHe argues that Zen (禅宗) constitutes a uniquely Chinese branch of Buddhism, and that Song Confucianism (理学) emerged from it. The Complete Perfection (全真) school of Daoism further arose, inheriting from both Zen and Confucianism. This is indeed a profound understanding of the interconnected currents among the Three Teachings (三教), and I cannot refute his words.\n\nThe Daoist of Self-Pasturing (自牧道人) emerged late in history, and it is fitting that he could not entirely avoid the influence of Complete Perfection (全真) teachings. However, Fan Yibin’s (范宜宾) *Mystic Explication* (《玄解》), which follows *Unveiling the Secrets*, states in its preface: *\"The Daoist of Self-Pasturing resided in Shu (蜀), was well-versed in the Southern Palace’s (南宫) arts, yet ultimately attained Dao through Inner Alchemy (内丹).\"* Indeed, after the Song dynasty, Daoism split into Southern and Northern schools. The Northern school became the Complete Perfection (全真) sect, while the Southern school did not necessarily conform to this.\n\n*Unveiling the Secrets* elaborates on the principles of *\"Heaven and Man in Harmony\"* (天人合发) and *\"Sun and Moon Have Their Numbers\"* (日月有数), frequently citing the *Canon of Supreme Mystery* (《参同契》) and the works of Zhang Ziyang (张紫阳), both revered as foundational texts by the Southern school. Thus, the Daoist of Self-Pasturing’s teachings cannot be confined solely to the Complete Perfection sect.\n\nFan Yibin’s *Mystic Explication* leans toward the Southern school in its arguments.\n\nTo summarize, after Huang-Lao Daoism (黄老), the Daoist tradition grew increasingly mundane. Only Zhuang Zhou (庄周) embodied its vast and profound essence, illuminating the boundless Dao of *\"No Waiting\"* (无待) with his boundless play. The Wei-Jin (魏晋) era revered mystic emptiness (玄虚), yet also dismissed claims of transcendent immortality (神仙). Left Yuanfang (左元放) and Wei Boyang (魏伯阳) spoke of *\"Rectification and Guidance\"* (补导), which Zhang Ziyang adopted as the Southern school’s foundation. Though Wang Zhongyang (王重阳) drew near to Zen, his disciples’ discussions of cultivation stages (修习次第) still betrayed a focus on *\"Ascending the Void\"* (冲举). Thus, both Southern and Northern schools are fundamentally techniques (方术), not the Daoist arts (道术) of old.\n\nWhen one delves into techniques (术), their applications remain confined to the realm of sounds, colors, forms, and *qi* (形气). They may even be constrained by the minutiae of yin-yang calculations (阴阳度数). The more refined the technique, the narrower its grasp of the Dao. This is the degeneration of Daoism.\n\nYet the Daoist of Self-Pasturing’s teachings, though influenced by prior traditions, are expressed in the *Yin Fu*, a text highly esteemed in his time. How could one overlook it?\n\nThus, I preface *Unveiling the Secrets*, briefly articulating my thoughts and seeking Wen Tong’s critique.\n\nWritten in the twelfth month of the thirty-fifth year of the Republic of China (民国三十五年十二月), by Xie Wuliang (谢无量).\n\n---\n\n**Preface to *Unveiling the Secrets of the Yin Fu* (《阴符发秘》序)**\nThe works of ancient sages often elucidate principles through concrete events, but the *Yijing* (《易》) alone suspends its symbols in boundless space, encompassing all things and all principles within them. The rise and fall of dynasties, the order and chaos of governance—these are the *Yijing*’s divinations (占验) in action. The annals of scripture, history, philosophy, and literature—these are but its annotations (注脚).\n\nThe *Yin Fu Jing* (《阴符经》) is perhaps the complement to the *Yijing*! Though this text contains but four hundred words, it unfolds the Nine Heavens (九天) and Nine Earths (九地), the boundless beginning (无始) and end (无终), the singular origin of myriad distinctions (一本万殊), and the vast embrace of the minute (大含细入). Its essence aligns with the *Yijing*’s principle of *\"Authentic and Commencing\"* (贞下起元) and *\"Dynamic within the Static\"* (静中含动), sharing no divergent logic.\n\nHowever, its language is often strange, its characters perilous. Later scholars, fixated on these oddities, have only deepened confusion and obscured its true meaning. If one approaches it with a tranquil mind and open *qi*, reflecting inwardly and outward upon the world, then the Buddha’s *\"neither emptiness nor form\"* (非空非色), Laozi’s *\"constant clarity and stillness\"* (常清常静), and the Confucian’s *\"the Unexcelled and the Supreme Polarity\"* (无极太极)—all can be unified under a single thread.\n\nThe Daoist of Self-Pasturing abandoned Confucian robes for the Yellow Crown (黄冠), his storehouse of knowledge vast. Dwelling in Chengdu (成都) for over twenty years, he delved deeply into the Three Teachings (三教) beyond, yet found his greatest resonance in this text. The *Yin Fu*’s teachings on *\"the uses of three thieves and five robbers\"* (三盗五贼之用), the unleashing of *\"killing intent\"* (杀机), and the secrets of *\"wondrous implements\"* (奇器)—he embodied these through personal practice, thus revealing his profound insight. His elucidations surpass even Guo Xiang’s (郭注) annotations on the *Zhuangzi* in their practicality.\n\nAdmirable are the Daoist’s words: *\"The benevolent see it as benevolence; the wise see it as wisdom.\"* Using the *Yijing*’s structure to order this text, he leaves no hidden depths, while previous claims of its military strategy (兵法) and such were but superficial glimpses.\n\nI, too, am no expert in this text. Though I now possess it, I cannot read it fully, nor comprehend it entirely—only those who read the *Yijing* can read this, and those who understand the *Yijing* can interpret it.\n\nWritten in the Year Jiaxu (乾隆甲戌) of the Jia Ping reign (嘉平), during the upper purification (上浣), by Ruo Gu (若谷) Shen Yu (沈裕) in the Stone Chamber (石室) of Jincheng (锦城).\n\n---\n\n**Autobiographical Note (自序)**\nIn my youthful vigor, I wandered the four quarters, penetrating the fleeting nature of human existence (人世蜉蝣).",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1129,
      "start_sentence": 0,
      "end_sentence": 40,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 23.573923110961914,
      "metadata": {
        "source_file": "dao\\藏外\\阴符发秘.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "癸卯冬，得入蜀，见山水之险异，事物之变迁，益信造化之有而无无也。 己酉秋，即遁迹于蓉城之柏森森处，谢尘俗，习清虚，惟日夕展玩《阴符》。 客曰：子何为而好读是经予笑而不答。 又曰：吾闻《阴符》黄帝所着，又云春秋时书，朱子谓战国见道之人所作，今或目为养生，或云王政，或云兵法，至于诸家注解，又纷然不一，请悉其详。 予曰：子之说皆是而皆非也。 客愤起而责曰：子何诞乎曰：非诞也。 《易》曰仁者见之谓之仁，知者见之谓之知，则出世者目为养生是也，为政者目为王政是也，师旅者云兵法亦无不是也，若执何者为是，即非矣。 惟其所莫能拘，莫能定，以之推及于万事万理而莫不至，当此其所以为《阴符》，乃崆峒授受之文，为坟典丘索三教百家经书文字之鼻祖，以天地幽明而原始要终，明夫人未生之前、有生之后，其所以生所以死之故，盖天地与人参三才而一理，是以指天道而明人道，言简而理该，义深而行易。 总之，首以明机察物，继以知动知时，而防克防溃，其彻始彻终，不过以自然至静为工夫，以法天行健为法则，审能如是而知之、防之、体之、行之，则可超乎有生有形之外，而至乎无声无臭之乡，生灭两忘，与太虚一体，岂止养生、王政、兵法而已哉!春秋战国之说无据，姑存而不论阙焉可也。 因子执于分别，故曰皆是而皆非也。 客曰：其旨既得闻矣，而子留心如是，自必有得之于心，盖（常道观抄本作盍）授中书君发其所得之秘成一家之注，以公同志，何乃自秘其秘乎余曰：噫!昔陆子静先生云：六经注我，我安得又注六经耶!《阴符》亦然。 客曰：不然，吾亦固知乎得象忘言、得理忘象，犹谓得鱼而忘筌矣，而方将鱼者可忘筌乎余曰：虽然，非敢秘也，但以一得之愚，发之楮墨，则必不能免，其人之曰是也、非也，诚不能自知其为是也、为非也，而亦不自知其为诞也。 乾隆甲戊仲春之望，长洲自牧道人张清夜序于紫阳洞。 《阴符发秘》上卷 长洲八十老孩张清夜子还注 观天之道，执天之行，尽矣。 【注曰：天之道，冲虚静漠，不自生而生生； 天之行，无私任运，不我化而化化。 其间气机阖辟，日月交光，皆造化枢机，修身玄范，人能明此，又能体此，则《阴符》之能事毕矣。 】 天有五贼，见之者昌，五贼在心，施行于天，宇宙在乎手，万化生乎身。 【注曰：天有五贼者，即天地阴阳化生之子也，如色声臭味触之类也。 五贼在心者，亦即天性所生之知觉也，如耳目鼻舌身之类也。 此五者皆能吸搅情尘，徇私驰逐，颠倒执迷，至死不悟，如太上所云“五色令人目盲，五音令人耳聋”是也。 若能识得破、看得透，不致认贼作子，便是施行于天也。 施行于天者，一如天之无私无言，以五贼为刍狗之意。 审能如是，则六合一躯、万年一念，身符造化、心统化机矣。 】 天性，人也； 人心，机也； 立天之道以定人也。 【注曰：不被五行所贼的心，便是天性，即无思无为、寂然不动之真体也。 庸人之情，一遇声色至前，便生出种种分别爱恶，即此分别爱恶，便是惟危之机心也。 人苟息了机心，尽合天性（常道观抄本作尽性合天），则心之与性、天之与人岂有二哉!曰立，曰定，乃确有卓见，无丝毫移易也。",
      "translated_text": "「In the winter of the tenth *Gui* (癸) and fourth *Mao* (卯), I gained entry into Shu (蜀), witnessing the rugged and extraordinary landscapes, the shifting and changing of all things, and thus further affirming the Dao/Way’s principle of *造化* (creative transformation)—that it exists in both form and formlessness.\n\nIn the autumn of the sixth *Ji* (己) and tenth *You* (酉), I retired to the secluded grove of cypress trees (柏森森) in Rongcheng (蓉城), withdrawing from worldly dust to cultivate the pure and void, devoting myself solely to the evening and morning contemplation of the *Yinshu* (《阴符》).\n\nA guest asked: *\"Why do you take such delight in reading this text?\"* I smiled but gave no answer.\n\nThe guest further inquired: *\"I have heard that the *Yinshu* was composed by the Yellow Emperor (黄帝), others say it is a text from the Spring and Autumn Period (春秋), while Zhuzi (朱子) attributes it to the enlightened figures of the Warring States Period (战国). Now some call it a treatise on nurturing life (养生), others on royal governance (王政), and still others on military strategy (兵法). As for the various commentaries by scholars, they differ widely. I wish to know its full meaning.\"*\n\nI replied: *\"Your words are all correct yet all incorrect.\"*\n\nThe guest, indignant, reproached me: *\"How dare you speak so frivolously!\"*\n\nI said: *\"I do not speak frivolously. The *Yijing* states: 'The benevolent see it as benevolence; the wise see it as wisdom.' Thus, those who withdraw from the world may regard it as a text on nurturing life—correct. Those who govern may call it a treatise on royal governance—also correct. And those who study martial affairs may see it as a text on military strategy—equally correct. But if one insists on any one interpretation as the absolute truth, then it is wrong. The *Yinshu* transcends all rigid categorizations, its principles extending to all things and all reason, and thus it fulfills its purpose. It is the original text of the *Kongtong* (崆峒) tradition, the foundational scripture for all three teachings (三教) and the hundred schools (百家), elucidating the fundamental origins and ultimate ends of heaven and earth. It reveals the nature of humanity before birth and after, the reasons for life and death. For heaven, earth, and humanity are the three powers (三才) yet unified in principle (一理). Thus, it expounds the Dao/Way of heaven to clarify the Dao/Way of humanity, concise in words yet comprehensive in meaning, profound in doctrine yet simple in practice.\n\nIn summary, it begins with discerning subtle changes in things, proceeds to understanding movement and timing, and then to preventing disasters and failures. Its thoroughness from start to finish lies solely in the cultivation of natural stillness (自然至静) and adherence to the principle of *Fatianxingjian* (法天行健, \"acting in accordance with heaven’s virtue/power and the vigor of the Dao/Way\"). If one can truly comprehend, prevent, embody, and practice these, then one may transcend the realm of life and form, reaching the domain of silence and scentlessness (无声无臭), forgetting both birth and death, and uniting with the Great Void (太虚). How could it merely be about nurturing life, royal governance, or military strategy alone?\n\nThe claims of the Spring and Autumn and Warring States periods are unfounded; let them remain undiscussed for now.\n\nBecause you cling to distinctions, I say your words are all correct yet all incorrect.\n\nThe guest said: *\"Since I have heard your explanation, and you have devoted such care to it, you must surely have gained insights from it. Why not reveal the secrets you have uncovered and compose your own commentary to share with like-minded scholars, instead of keeping them hidden?\"*\n\nI replied: *\"Alas! Long ago, Master Lu Zhiqing (陆子静) said: 'The Six Classics are interpreted by me; how could I then again interpret the Six Classics?' The same holds true for the *Yinshu*.»\n\nThe guest said: *\"No, I know of the saying: 'Obtain the symbol and forget the words; obtain the principle and forget the symbol.' This is akin to catching the fish and forgetting the basket. But can one who is still using the basket to catch the fish forget it?\"*\n\nI replied: *\"Though it may be so, I do not dare to conceal it. But if one reveals their limited understanding in ink and paper, it is bound to be flawed. Those who claim it is correct or incorrect truly cannot know whether they speak truth or error, nor can they recognize their own frivolity. The tenth *Gui* (癸) and fifth *Wu* (戊), on the day of the spring equinox (仲春之望), the Daoist recluse Zhang Qingye (张清夜) of Changzhou (长洲) inscribed this at Ziyang Cave (紫阳洞).*\n*Upper Volume of *Yinshu Faxi* (《阴符发秘》)*\n*Commentary by Zhang Qingye (张清夜), the Eighty-Year-Old Child of Changzhou (长洲八十老孩)*\n*To observe the Dao/Way of heaven (观天之道) and to follow its course (执天之行) is to exhaust its fullness. 【Annotation: The Dao/Way of heaven is boundless void and tranquil stillness (冲虚静漠), not self-generating yet giving rise to all things. Heaven’s course is impartial and follows its own rhythm (无私任运), not transforming others yet transforming all things. Between these two lies the interplay of *qi* and mechanisms (气机阖辟), the exchange of sunlight and moonlight (日月交光), all pivotal operations of creative transformation (造化枢机) and profound models for self-cultivation (修身玄范). If one can truly discern these and embody them, then the full potential of the *Yinshu* is realized.】*\n\nHeaven has five thieves (五贼); those who see them flourish. The five thieves dwell within the heart, yet their influence extends to heaven. With them, the universe lies within one’s grasp, and all transformations arise from the body. 【Annotation: The five thieves of heaven are the offspring of the interactions between heaven, earth, yin, and yang (天地阴阳化生之子), such as colors, sounds, odors, tastes, and tactile sensations (色声臭味触之类). The five thieves dwelling within the heart are the perceptions and sensations born of human nature (天性所生之知觉), like those of the ears, eyes, nose, tongue, and body (耳目鼻舌身之类). These five can agitate the emotions, lead one astray through personal desires, and cause confusion and fixation, leaving them unaware until death—just as the *Taishang* (太上) says: 'The five colors blind the eyes; the five tones deaf the ears.' If one can recognize and penetrate these illusions, not mistaking the thieves for their own children, then they act in accordance with heaven. To act in accordance with heaven means to treat the five thieves as mere straw dogs (刍狗), without attachment or words. If one can truly do this, then the six directions become one body, and the ten thousand years one thought. The body aligns with creative transformation, and the heart governs the mechanisms of *qi*.】*\n\nHeaven’s nature is humanity (天性，人也); humanity’s heart is the mechanism (人心，机也). Establish the Dao/Way of heaven to settle humanity. 【Annotation: The heart that is not ensnared by the five thieves is heaven’s nature—its true essence, untouched by thought or action, serene and unmoving. The common person’s emotions, when confronted by sounds and colors, spawn countless distinctions of love and hate. These distinctions are the perilous mechanisms of the heart. If one quiets these mechanisms and fully harmonizes with heaven’s nature (尽性合天), then the heart and nature, heaven and humanity, are as one. To establish and to settle reflect a resolute understanding, without the slightest deviation or compromise.】」",
      "overlap_context": "t. Though I now possess it, I cannot read it fully, nor comprehend it entirely—only those who read the *Yijing* can read this, and those who understand the *Yijing* can interpret it.\n\nWritten in the Year Jiaxu (乾隆甲戌) of the Jia Ping reign (嘉平), during the upper purification (上浣), by Ruo Gu (若谷) Shen Yu (沈裕) in the Stone Chamber (石室) of Jincheng (锦城).\n\n---\n\n**Autobiographical Note (自序)**\nIn my youthful vigor, I wandered the four quarters, penetrating the fleeting nature of human existence (人世蜉蝣).",
      "start_char": 1129,
      "end_char": 2372,
      "start_sentence": 41,
      "end_sentence": 74,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 22.269022226333618,
      "metadata": {
        "source_file": "dao\\藏外\\阴符发秘.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "】 天发杀机，移星易宿，地发杀机，龙蛟起陆，人发杀机，天地反覆，天人合发，万化定基。 【注曰：天地之发杀机者，无非言气机潜动之意，夫寂然不动，生灭两融，机动时行，刍狗万物，故曰杀机也，即天地不仁之意。 三辰右移，列宿左易，光明下照，所谓至阴肃肃，发乎天而交于地也。 龙蛟起蛰，潜然上飞，气腾物感，亦谓至阳赫赫，发乎地而交于天也。 人身，小天地也，其气机旋动之时，周行六虚，坎离颠倒，非吾身之天地反覆耶!天人合发者何也人在两交之中，而气机不能与天地同运并行者，盖为不能自作主宰，任为五贼驱驰，遂与天道相暌、天行不符。 今既云立天以定人矣，则天与人合一而不分，所以天地之发杀机而人与之俱发，人之发杀机则天地万物莫不与之俱发矣。 故曰天人合发。 万化定基者，于天人合发之际，夺尽天地冲和之运，夺尽阴阳化生之妙，始克重胚太机，再立根元，而不生之生生毓于此，不化之化化枢于此也。 此篇经旨，全归在天人合发一句，为一卷《阴符》之章旨也。 《阴符经》“阴”字，前人作暗字解，谬矣。 昔称分阴、寸阴，乃时字之义也。 按《参同契》有拘蓄禁门、促迫时阴之旨，始知天人合发乃乘时下功盗夺也。 何也中篇云：食其时，百骸理，动其机，万化安，足证此也。 】 性有巧拙，可以伏藏，九窍之邪，在乎三要，可以动静。 【注曰：圣人之性与天地参，众人之性有巧拙之不同，虽曰不同，然皆可以伏藏。 伏藏者，即退藏于密之谓也。 如天渐发阳中之真阴伏于地，以酝真阳，而后能令肃肃赫赫之机往来升降，成高明博厚于无尽。 人之所以不能悠久无疆者，只为不解伏藏； 其不能伏藏之故，只为身中九窍之不谨耳。 何也九窍者，天性与五贼往来之门户，故五贼无此，不能诱天性以随邪，人心无此，不能通五行以扰性。 又当知夫九窍中之最灵捷者，耳、目与口，谓之三要，此作圣工夫最吃紧处也。 可以动静者，言三要之动而外逸，为入邪之首领，静而伏藏，实为办道之津梁，所以三要之能动能静，即吾人作圣作狂之枢关也。 】 火生于木，祸发必克，奸生于国，时动必溃，知之修之，谓之圣人。 【注曰：此节前四句乃变先天为后天，化神奇为臭腐也。 后二句乃返后天而为先天，即臭腐而化为神奇也。 其经旨全在时动知修四字。 何也火生于木者，心之原于性也； 祸发必克者，天性之变为人心，即火之炎于上七窍也； 奸生于国者，情之本于性也； 时动必溃者，情之变为精，即水之滴于下二关也。 吁炎上而不返，溃下而不还，中宫有其空，舍何支乎但时动二字不可全作必溃会。 所以紧接知之修之一句何也夫时动者，即天人合发之时也，故时之动介乎先天后天之际、作圣作凡之间。 或因其时之动也，则情扰乎中，变先天为后天，此时动必溃之诫也； 或因其时之动也，能运我自然之杀机，可以返后天为先天，岂非万化定基之始乎!至于知之者，即是知此时动之机也； 修之者，即于机动之际及时下功行一得永得之道也。 紫阳真人有《真铅铭》可以证之，《铭》曰：一念之非，降而为漏，一念之见，守而成铅，升而接离，补而成乾，阴阳归化，是以还元，至虚至静，道法自然，人能行之，飞升而仙。",
      "translated_text": "When heaven unleashes its *killing mechanism*, the stars shift their lodges; when earth unleashes its *killing mechanism*, dragons and serpents rise from the land. When humanity unleashes its *killing mechanism*, heaven and earth reverse their cycles. When heaven and humanity both unleash their *killing mechanisms*, the foundation of all transformations is set. 【*Killing mechanism* (杀机) refers to the latent movement of *qi* (气机), which, when stirred, disrupts the natural harmony of life and death. The stillness of *non-being* (寂然不动) and the fluidity of *being* (生灭两融) are disrupted by this stirring motion, as all things—from humble offerings to living creatures—are swept along by it. This is the meaning of *killing mechanism*, the implication of heaven and earth’s *non-virtue* (天地不仁). When the three luminaries shift rightward and the constellations move leftward, their light descends to illuminate below—this is the *supreme yin* (至阴), solemn and restrained, arising from heaven and merging with earth. When dragons and serpents emerge from their dormancy, ascending with vigor, the *qi* surges and stirs all things—this is the *supreme yang* (至阳), radiant and fierce, arising from earth and ascending to heaven. The human body is a miniature heaven and earth; when its *qi* and mechanisms (气机) swirl and move, it circulates through the six *emptinesses* (六虚), and the *kan* and *li* trigrams invert. Is this not the reversal of heaven and earth within humanity? The union of heaven and humanity’s mechanisms (天人合发) is thus: humanity exists within the interplay of yin and yang, yet its *qi* and mechanisms cannot align with heaven and earth’s movements, for it lacks self-mastery, surrendering instead to the five thieves’ (五贼) relentless drive. Thus, it diverges from the Dao/Way of heaven and fails to conform to its natural unfolding (天行). Having established heaven’s Dao/Way to settle humanity’s heart, heaven and humanity become indivisible. When humanity unleashes its *killing mechanism*, all things in heaven and earth move in concert with it—this is the union of heaven and humanity’s mechanisms (天人合发). *Millions of transformations* (万化) are rooted in this: at the moment when heaven and humanity’s mechanisms coalesce, it seizes the essence of heaven and earth’s harmonious interplay, and the subtleties of yin and yang’s transformative power. Only then can one firmly grasp the *Great Primordial Mechanism* (太机), re-establish the *foundational element* (根元), and thus the eternal generation of *non-being* (不生之生) and the pivotal transformation of *non-transformation* (不化之化) are realized. The essence of this passage lies entirely in the phrase *heaven and humanity’s mechanisms coalesce* (天人合发), encapsulating the core intent of this chapter of the *Yin Fu Jing* (《阴符经》).\n\nThe *yin* (阴) in *Yin Fu Jing* is not to be mistaken for *darkness* (暗). In antiquity, it was spoken of as *divided yin* (分阴) and *inch of yin* (寸阴), referring to *time* (时). According to the *Shen Tong Qi* (《参同契》), the meaning revolves around restraining the gates of *qi*, hastening the moments of *yin*—this is the essence of *seizing the moment and acting* (乘时下功), *stealing and seizing* (盗夺). The proof lies in the middle passage: *To eat of its time, all limbs function; to stir its mechanism, all transformations are at peace* (食其时，百骸理；动其机，万化安).\n\nNature has skill and clumsiness, yet it can be concealed. The nine orifices’ (九窍) malevolent influences lie within the three most vital: ears, eyes, and mouth—these can be regulated in motion or stillness. 【*Nature* (性) here refers to the innate *qi* and mechanisms within humanity. The sages’ nature aligns with heaven and earth, while common folk’s nature varies in skill and clumsiness, yet all can be concealed. *Concealed* (伏藏) means *retreat and hide* (退藏于密). For instance, when heaven gradually emits yang, the true yin remains dormant within earth, brewing the true yang. Only then can the solemn and radiant mechanisms of yin and yang rise and fall, ascending and descending, to achieve boundless brilliance and depth. Humanity’s inability to endure eternally stems from its failure to understand concealment. The reason for this failure lies in the neglect of the nine orifices within the body. These nine orifices are the gateways through which heaven’s nature and the five thieves interact. Without them, the five thieves cannot lure heaven’s nature into following evil, nor can the human heart transmit the five phases to disturb nature. Yet one must know that among the nine orifices, the most responsive are the ears, eyes, and mouth—the *three vital senses* (三要). These are the critical junctures for the sage’s work. When they move and *qi* leaks outward, they become the leaders of evil intrusion. When they are still and concealed, they serve as the bridge to cultivating the Dao. Thus, the ability to regulate the three vital senses in motion or stillness is the hinge upon which humanity’s ascent to sainthood or descent into madness turns.】",
      "overlap_context": "re—its true essence, untouched by thought or action, serene and unmoving. The common person’s emotions, when confronted by sounds and colors, spawn countless distinctions of love and hate. These distinctions are the perilous mechanisms of the heart. If one quiets these mechanisms and fully harmonizes with heaven’s nature (尽性合天), then the heart and nature, heaven and humanity, are as one. To establish and to settle reflect a resolute understanding, without the slightest deviation or compromise.】」",
      "start_char": 2372,
      "end_char": 3609,
      "start_sentence": 75,
      "end_sentence": 113,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 15.013324499130249,
      "metadata": {
        "source_file": "dao\\藏外\\阴符发秘.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "此节经文止二十四字，人能信而行之，诚有转凡入圣之功，读《阴符》者奚可草率看过。 予幼时喜读《阴符》，寒暑靡间，一日于无想无梦时，忽闻有人亦诵此经，至是节，字句大有不同，犹记其句云：心生于性，念发必克，精生于气，情动必溃。 于时以为改窜圣经，大为不平，及醒而味之，颇觉微妙。 可知五十年前，古圣先贤预知今日之有注《阴符》也。 亦奇矣哉。 】 《阴符发秘》中卷 长洲八十老孩张清夜子还注 天生天杀，道之理也。 【注曰：篇中专为指明天人合发之真时，及人发杀机之定候，首章犹未陡然直下，故先言万物以天地发生之时而敷荣，以肃杀之候而凋谢，此自然而然之理，犹太上所云“天地不仁以万物为刍狗。 ”曰不仁者，言天本无私，何有于仁与不仁也。 即经云天生天杀，道之理也。 】 天地，万物之盗； 万物，人之盗； 人，万物之盗； 三盗既宜，三才乃安。 【注曰：天地以时之盛衰为万物之新故，即上文天生天杀道之理也。 惟人与万物互相戕贼，如万物适人嗜欲，便能贼人真性，故万物人之盗也。 又如人利用万物而能摧残万物，故人为万物之盗也。 此皆三盗之不相宜也。 若人能除五贼，识天符，顺时观化，则不但不为万物所盗，且又能盗天地万物之造化，岂非天地位而万物育乎!】 故曰：食其时，百骸理，动其机，万化安。 【注曰：食即得之者常似醉之意。 动者即龙蛇起陆、人身之气机也。 此节顿接故曰食其时五字，可见前二节已伏有用之时义矣。 夫食时动机者，圣人直指人用功之际，机动有时，时至神知，阴阳旋运，地髓天[左飠右臾]，咽归五内，脏腑安舒，形神俱妙，与道为期矣。 】 人知其神之神，不知不神之所以神。",
      "translated_text": "This passage of the *Yinfu* contains but twenty-four characters. If one believes and practices it sincerely, it truly holds the power to transform the ordinary into the sage. How can readers of the *Yinfu* afford to glance over it carelessly?\n\nIn my youth, I delighted in reading the *Yinfu*, never tiring through summer or winter. One day, in a state of thoughtless, dreamless stillness, I suddenly heard someone else reciting this scripture. At this passage, the words differed greatly from what I knew. I still recall their phrasing:\n\n*\"The heart arises from nature; when intention is raised, it must be subdued.\nQi gives birth to essence; when emotion stirs, it must be dispersed.\"*\n\nAt the time, I took this as a reckless alteration of the sacred text, and I was deeply displeased. But upon waking and reflecting, I found it subtly profound.\n\nTruly, fifty years ago, the ancient sages and worthies must have foreseen that someone would annotate the *Yinfu* today.\n\nHow strange it is!\n\n---\nFrom *The Hidden Secrets of the Yinfu*, Middle Scroll\nBy Zhang Qingye, an eighty-year-old child of Changzhou, revising the annotations:\n\n*\"Heaven’s birth and heaven’s death—this is the Dao’s principle.\"*\n\n**[Annotation:]**\nThis passage specially clarifies the true moment when heaven and humanity act in unison, as well as the fixed signs when humanity unleashes its killing intent. The first chapter does not yet plunge directly into the matter, so it first speaks of how all things flourish when born from heaven and earth, and wither when the time of austerity and death arrives—this is the natural order, as the *Tao Te Ching*’s *Supreme Ultimate* says: *\"Heaven and earth are without benevolence; they treat all things as straw dogs.\"* By \"without benevolence,\" it means heaven has no partiality—what is there of benevolence or cruelty? Just as the text says: *\"Heaven’s birth and heaven’s death—this is the Dao’s principle.\"*\n\n---\nHeaven and earth are the thieves of all things;\nAll things are humanity’s thieves;\nHumanity is all things’ thief;\nWhen the three thieves are harmonized, the Three Powers are at peace.\n\n**[Annotation:]**\nHeaven and earth bring about the rise and decline of seasons, marking the renewal and decay of all things—this is the principle of *\"Heaven’s birth and heaven’s death\"* from above. Yet humanity and all things prey upon one another: when all things cater to human desires, they can rob humanity of its true nature, hence *\"all things are humanity’s thieves.\"* Again, when humanity exploits all things to the point of destruction, it becomes *\"humanity, the thief of all things.\"* These are the three thieves not in harmony.\n\nIf humanity can eliminate the five thieves, recognize the *Heavenly Symbol*, and follow the times to observe transformations, then not only will it not be stolen by all things, but it will also be able to plunder the creative transformations of heaven and earth. Is this not the position where heaven and earth stand firm while all things flourish?\n\n---\nThus it is said:\n*\"Eat in season, and the hundred bones align;\nStir the mechanism, and all transformations are at peace.\"*\n\n**[Annotation:]**\n*\"Eat\"* here means to obtain [the Dao] as if intoxicated. *\"Stir\"* refers to the rising of dragon-serpent qi on land—the vital mechanisms of the human body. This passage directly follows the earlier *\"Eat in season\"* five characters, showing that the meaning of *\"the time of use\"* was already implied in the previous two sections.\n\nTo *\"eat in season\"* and *\"stir the mechanism\"* is for the sage to point out the moment when one practices. When the mechanism stirs, there is a fixed time; when the time arrives, the spirit knows it. Yin and yang revolve, earth marrow and [heavenly] [left: *yǐ* right: *yú*] converge, returning to the five viscera. The zang-fu organs relax in harmony, and form and spirit both attain marvelous refinement—now aligned with the Dao.\n\n---\nHumanity knows the spirit’s spirit,\nBut does not know how the unmanifest spirit manifests.",
      "overlap_context": "t know that among the nine orifices, the most responsive are the ears, eyes, and mouth—the *three vital senses* (三要). These are the critical junctures for the sage’s work. When they move and *qi* leaks outward, they become the leaders of evil intrusion. When they are still and concealed, they serve as the bridge to cultivating the Dao. Thus, the ability to regulate the three vital senses in motion or stillness is the hinge upon which humanity’s ascent to sainthood or descent into madness turns.】",
      "start_char": 3609,
      "end_char": 4279,
      "start_sentence": 114,
      "end_sentence": 142,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 8.82945990562439,
      "metadata": {
        "source_file": "dao\\藏外\\阴符发秘.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "【注曰：神之神者，灵异不测之谓也； 不神神者，乃是极寻常最灵现、人人共见、而全不觉其为参天地赞化育之灵源也。 若非此经当场直指，未免尽作扬子江头渴死汉矣。 此节本以启下文日月小大之微旨，故先示人不神而神一语，以证神明之出正在于此不神也。 】 日月有数，小大有定，圣功生焉，神明出焉。 【注曰：此承上文不神之中而圣功之所以生、神明之所以出也。 试问日之升沈、月之盈亏，自少至眊、自古迄今，举头便见，不识其为何物，殊不知超生脱死、一切神明变化正在于此也。 此节四句，只有两个字是经旨，上二句是大字，下二句是生字。 盖言圣功生者，定生于日月两交之处也。 何也日月有数者，即日月行周天之数，如太阳每日行一度，太阴每日行十三度有奇，其与太阳望合会照，每月有六候，望前为三阳，在卦为震兑乾，望后为三阴，在卦为巽艮坤，总以日行五度、月行六十度，故曰月节有五六，经纬奉日使。 又云：阴火息时阳火消，理分卧立顺羲爻，更随黑白天边月，六候方终晦朔交。 此应人身一月之小周天也。 太阳自冬至一阳来，复每月行三十度，三百六十日与太阴十二次交会，此应人身一年之大周天也。 又论日月之小大有定者，专言天人合发造化之应时而动，在朔望前后各三日共二七日为大，两弦前后各三日共十四日为小。 今天机阴符应大而不应小，故大药之发生必在会望之候也。 经曰：两七聚，辅翼人，此专指朔望前后日之各三日也。 《玄脉心传》曰：至人用功，契合日月，谓之火符。 其故何也凡一切人身天地之水与液，皆元气所化，故炁称水之母，殊不知太阴为万气万水之总持。 即岐伯亦云：月廓满则人身之气血实，肌肉坚，月廓空则肌肉减，卫气去，形乃独居。 即水族之为物亦然，故月虚而鱼脑减，月满而蚌蛤实也。 所以《阴符》大道准则日月，测候大小，依时下功，则天地人身之气机自然牝牡相从，合符行中，谓之戊己，天符戊己者，晦日朔旦，月中坎水，流戊日中，离火就己，故日天符。 符火既浃，万化旋萌，何虑功之不圣、神之不灵也耶!即纯阳子所云：有人间我修行法，遥指天边日月轮。 此其证也。 又云：地下海潮天上月，依此消长应圆缺。 此即抽添进退机，便是虚空造化窟。 不特此也，即大天地呼吸感应，无不以月之能力大处为征验也。 试观朔望前后各三日，月之能力大而海之潮汐亦大，两弦后各三日，月之能力小而海之潮汐亦小。 崔奚范《天元入药镜》曰：天应星，地应潮。 莫不本此。 故曰小大有定。 此解实为《阴符》大道千古不传之义蕴也。 】 【其盗机也，天下莫能见、莫能知，君子得之固躬，小人得之轻命。 注曰：用不神之神，运无为之功，合天人之候，契日月之符，潜修默夺，混俗和光，筋骨乃坚，神形俱妙，此君子得之固躬也。 下士闻道大笑之，或得藉彼神功，恃才妄作，直至丧身亡家，死而不悟，岂非藐天人之学于鸿毛，等性命之尊于尘芥，此小人得之轻命也。 谚云：邪人得正法，正法悉皆邪，亦指此也。 】 《阴符发秘》下卷",
      "translated_text": "「The spirit’s spirit refers to the uncanny and unfathomable—its extraordinary, unpredictable nature. The *unmanifest spirit* that manifests is the most ordinary yet most vital essence, seen by all yet fully unrecognized as the transcendent source that harmonizes with heaven and earth and nourishes all transformations. Were it not for this text directly pointing it out in its proper context, one might as well perish of thirst at the Yangtze’s head—never grasping its true significance.\n\nThis passage serves to introduce the subtle meaning of the daily and monthly cycles of small and great changes below. It first illustrates the phrase *\"the unmanifest spirit that manifests\"* to prove that the true emergence of divine illumination lies within this very unmanifested yet manifesting essence.\n\n---\nThe sun and moon follow their courses, their small and great cycles are fixed. From this, the sage’s work arises, and divine illumination manifests.\n\nThe explanation continues from the previous discussion of the *unmanifest spirit*—how the sage’s work comes to life and divine illumination emerges from it. Consider the sun’s ascent and descent, the moon’s waxing and waning—from youth to decline, from antiquity to the present—visible at every glance, yet their nature remains unrecognized. One fails to see that the transcendent power to transcend birth and death, to manifest all divine transformations, lies precisely here.\n\nIn these four sentences, only two words carry the essence of the text: the first two sentences emphasize *fixed*, and the latter two, *arise*. The sage’s work arises from the fixed cycles where the sun and moon intersect. How so? The sun and moon follow their courses through the *Great Heavenly Cycle*—the sun advancing one degree daily, the moon thirteen degrees and a fraction daily. When the sun and moon align in their respective phases, there are six *candidates* each month: three *Yang* phases before the full moon, corresponding to the *Zhen, Xuan, Qian* trigrams; and three *Yin* phases after, corresponding to the *Xun, Kan, Kun* trigrams. Together, they complete the sun’s five-degree daily movement and the moon’s sixty-degree monthly progression, hence the saying: *\"The moon’s nodes are five and six; the stars and constellations obey the sun’s command.\"* It is also said:\n\n*\"When the Yin fire subsides, the Yang fire fades,*\n*Its logic divides between rest and motion, following the *Xipao* lines.*\n*Further, it moves with the black and white of day’s edge,*\n*And the six candidates end at the eclipse of new and full moon’s exchange.\"*\n\nThis reflects the human body’s *Small Heavenly Cycle* of a month.\n\nThe sun, from the winter solstice, brings forth one *Yang* degree, advancing thirty degrees monthly, and in three hundred and sixty days, it intersects with the moon’s twelve *constellations* (*Xiu*)—this corresponds to the human body’s *Great Heavenly Cycle* of a year.\n\nWhen discussing the moon’s *small and great cycles* being fixed, it specifically refers to the harmonized response of heaven and humanity to the transformative timing of creation, where the three days before and after the new and full moon total seven days as *great*, and the three days before and after the two quarters total fourteen days as *small*. Now, the *Yin mechanism* responds only to the *great* and not the *small*, so the emergence of the *Great Medicine* must occur during the conjunction or full moon phases.\n\nThe text states: *\"Two sevens gather, supporting and shielding humanity\"*—this refers specifically to the three days before and after the new and full moon.\n\n*The Secret Transmission of the Mysterious Pulse* says: *\"The Perfect One practices, aligning with the sun and moon, calling it the Fire Seal.\"* The reason lies in this: all the water and fluids of humanity and earth—heaven—are transformations of the *Primordial Qi*. Thus, *Qi* is called the \"mother of water,\" yet one fails to see that the moon is the total sustainer of all *Qi* and all water. Even *Ghibber* says:\n\n*\"When the moon’s crescent is full, the body’s *Qi* and blood are abundant,*\n*Muscles firm and strong.*\n*When the moon’s crescent is empty,*\n*Muscles weaken, the *Wei Qi* departs,*\n*And the form stands alone.\"*\n\nThe aquatic creatures follow this pattern too: when the moon is waning, fish brains diminish; when the moon is full, clams and oysters are plump.\n\nThus, the *Yin Seal*’s grand principle aligns with the sun and moon, measuring the great and small phases, and acting in accordance with the timing—then the *Qi* mechanisms of heaven, earth, and the human body naturally follow the *Yin-Yang* correspondence, sealing and moving in harmony, known as *Wu Ji*. The *Wu Ji* of heaven aligns with the *Wu Ji*—the moon’s *Kan* water flows to the *Wu* day, the *Li* fire aligns with the *Ji* day, hence the term *heavenly Wu Ji*.\n\nOnce the *Fire Seal* is complete, all transformations begin anew—what need is there to fear that the sage’s work will not be sublime, or that divine illumination will not be extraordinary? This is the proof of what *Pure Yang Master* said:\n\n*\"There is a method of cultivation in the human realm,*\n*Pointing to the sun and moon’s wheels in the heavens.\"*\n\nThis is the very evidence.\n\nIt is also said:\n\n*\"Beneath the earth, the tides rise and fall like the moon above,*\n*Their waxing and waning follow the moon’s phases in response.\"*\n\nThis is the mechanism of ebb and flow, retreat and advance—\nthe very workshop of creation in the void.\nNot only this, but even the great breathing of heaven and earth,\ntheir mutual resonance,\nall take the moon’s greatest influence as their measure.\nObserve the three days before and after the new and full moon:\nthe moon’s influence is great, and the tides are great.\nObserve the three days after the two quarters:\nthe moon’s influence is small, and the tides are small.\n\nCui Xi Fan’s *Mirror of the Celestial Element Entering Medicine* states:\n*\"Heaven responds to stars, earth responds to tides.\"*\nAll follow this principle.\nHence, it is said: *\"small and great cycles are fixed.\"*\nThis interpretation truly reveals the *Yin Seal*’s profound, untransmitted essence across millennia.\n\n---\nAs for those who steal this mechanism,\nno one under heaven can perceive or comprehend them.\nThe *gentleman* who attains it safeguards his life,\nwhile the *petty man* who attains it risks his fate.\n\nThe explanation says:\nTo employ the *unmanifest spirit*’s essence,\nto harness the *non-action*’s power,\nto align with heaven and humanity’s timing,\nto resonate with the sun and moon’s seals,\nand to practice secretly, seizing opportunities in silence,\nblending with the mundane while preserving brilliance—\nthen his sinews and bones grow firm,\nand his spirit and form both reach marvelous refinement—\nthis is the *gentleman* safeguarding his life.\n\nThe lesser scholars hear this and laugh it off,\nor they borrow its divine power,\nrelying on their talent to act recklessly,\nuntil they meet ruin—losing their lives and their families,\ndying without enlightenment.\nIs this not to scorn the study of heaven and humanity as mere feathers,\nto equate life’s worth with dust?\nThis is the *petty man* risking his fate.\n\nThe proverb says:\n*\"A wicked man attains the true method—*\n*the true method becomes entirely wicked.\"*\nThis refers to the same.」",
      "overlap_context": "tir the mechanism\"* is for the sage to point out the moment when one practices. When the mechanism stirs, there is a fixed time; when the time arrives, the spirit knows it. Yin and yang revolve, earth marrow and [heavenly] [left: *yǐ* right: *yú*] converge, returning to the five viscera. The zang-fu organs relax in harmony, and form and spirit both attain marvelous refinement—now aligned with the Dao.\n\n---\nHumanity knows the spirit’s spirit,\nBut does not know how the unmanifest spirit manifests.",
      "start_char": 4280,
      "end_char": 5450,
      "start_sentence": 143,
      "end_sentence": 181,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 19.832881450653076,
      "metadata": {
        "source_file": "dao\\藏外\\阴符发秘.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "长洲八十老孩张清夜子还注 聋者善视，瞽者善听，绝利一源，用师十倍，三返昼夜，用师万倍。 【注曰：篇之首章，复申明上经三要静藏之机全在返源内伏，又以引起下文三要中而更有最神最要者以为入圣之真枢也，故先言绝耳根之利，则兼倍于明（常道观抄本作聪），绝视司之利则兼倍于聪（常道观抄本作明），何况三根尽返，而又能宵旦弗遑，其盗机克贼之功，可胜算哉】 心生于物，死于物，机在目。 【注曰：耳目口三要之中，何以为第一要耶曰目是也。 何以知之，曰原夫人生之初，一点元神，凝然中处，不识不知，朝成暮长，日渐知觉，元神变为神识，则上游两目，心生爱恶，随物生死，故曰意虽为六识之主宰，眼实为五贼之先锋，若得此要返元，其余九关三要不返而自返矣。 故曰心生于物、死于物、机在目。 予闻佛典之六根六尘以眼为先，太上有希夷微三者以视为首，孔子四非之箴勿视为先，至于帝尧之钦明、成汤之顾諟，《心经》之观自在，《道德经》之观有观无，黄帝之三月内视，《阴符》之机在目，三教圣人之源，莫不以此为转机辨道之津梁也。 】 天之无恩而大恩生，迅雷烈风，莫不蠢然，至乐性余，至静性廉，天之至私，用之至公。 【注曰：上章言冥目内观即回光返照之功，此节示闻响悟机乃声入心通之妙也。 世人营营事物，恋恋尘情，不知自己之本来真觉为何物，苟非于无意间风霆一震，何能暂脱狂迷天真觌露乎故曰天显无恩之迅雷烈风，则一切之飞潜动植莫不跃然蠢动，惕然惊醒。 时遇真心学道之人，自然直下承当。 至乐者乃孔颜之乐，即西圣所谓禅悦法喜得未曾有之意。 余者，充然具足也，盖言藉此一击之顷，则性之全体大现，见其涵容普徧，弥漫六合，且又凝然清静，胡能污染纤毫，故曰至乐性余，至静性廉也。 吾意太空一震，不过二气感触，偶尔云然，又何有所谓公私之可议哉然见陆之功莫神此一击也：故吕公有明明说向无消息，霹雳声中自得根之语，即宗门家之敲金击竹、棒喝拈椎，皆以显此耳根圆通之妙用也。 不特此也，即三身之妙谛亦不逾此，何也迅雷烈风莫不蠢然者，闻声见道，直下承当，蠢动含灵，皆证佛性，是名应化通身。 至乐性余者，远离颠倒，身心安乐，性体含弘，遍周法界，是名圆满报身。 至静性廉者，凝然湛寂，名不动尊，本无取舍，亦无污染，是名清静法身。 佛氏三身之说，无如此经之明了也。 】",
      "translated_text": "The Eighty-Year-Old Child of Changzhou, Zhang Qing, annotates at night:\n\nThe deaf excel in vision,\nthe blind in hearing.\nSevering one source of sensory gain,\nits use multiplies tenfold.\nReturning threefold through day and night,\nits use multiplies ten thousandfold.\n\n**[Note:] The opening chapter reiterates the three essentials of stillness and concealment from the previous scripture—all hinging on returning to the source and internal concealment. It also introduces the most subtle and vital principle within the three essentials, serving as the true pivot for attaining sainthood. Hence, it first speaks of severing the ear’s sensory gain—doubling even the clarity of hearing—and severing the eye’s sensory gain—doubling even the acuity of sight. What then of all three roots fully returned, and yet able to press on without respite through night and day? The thieving of essence and slaying of life’s bandits—how could its power be measured?**\n\nThe mind arises from things,\ndies from things—\nits mechanism lies in the eye.\n\n**[Note:] Among the three essentials of ear, eye, and mouth, why is the eye considered first? Because of this: Originally, at the dawn of human life, a single point of primordial spirit coalesced within, unaware and unknowing. Day by day, it grew into awareness, and the primordial spirit transformed into discerning mind. Then, the two eyes ascended, and the mind generated love and aversion, rising and falling with things. Thus, though intention rules the six senses, the eye is truly the vanguard of the five thieves. If this essential is returned to its source, the remaining nine gates and three essentials will return of their own accord.\n\nHence it is said: *The mind arises from things, dies from things—the mechanism lies in the eye.*\n\nI have heard that in Buddhist scriptures, the six senses and six dusts place the eye first. The *Taoist Canon*’s *Xi-Yi-Wei* ranks vision as paramount. Confucius’ four admonitions begin with *Do not gaze*. Even Emperor Yao’s reverent clarity and King Tang’s sagacious insight, the *Heart Sutra*’s *Omniscience*, the *Dao De Jing*’s *Observing the unobserved*, the Yellow Emperor’s three-month inward gaze, and the *Yin-Fu*’s *Mechanism in the eye*—the sacred sources of the Three Teachings all regard this as the pivotal turning point and the bridge for discerning the Way.**\n\nHeaven’s greatest cruelty breeds its greatest mercy:\nSwift thunder and fierce winds\nstun all things into motion.\nSupreme joy overflows essence,\nsupreme stillness preserves purity—\nHeaven’s utmost selfishness\nbecomes its utmost public use.\n\n**[Note:] The previous chapter spoke of blind inward observation as the function of returning light and illuminating darkness. This passage reveals the profound mystery of hearing resonance and awakening the mechanism.\n\nOrdinary people, entangled in affairs and clinging to worldly passions, do not recognize their original true awareness. Unless, in a moment of unintended shock—like thunder or lightning—they are briefly freed from their deluded nature, how could their innate purity ever be revealed? Hence it is said: *Heaven’s display of merciless thunder and lightning stuns all things—creeping, flying, moving, or rooted—into sudden awakening.* At such times, those who truly seek the Way naturally receive it directly.\n\nSupreme joy is the joy of Confucius and Yan Hui—the Western Sage’s *dhyanic bliss and lawful rapture, never before attained*. *Overflowing essence* means fully possessed. It speaks of how, in that instant of impact, the entire nature manifests—its boundless embrace permeating the six directions, yet utterly still and untainted. Hence it is said: *Supreme joy overflows essence, supreme stillness preserves purity.*\n\nIn my view, a single shock of cosmic void is but the collision of two *qi*—a fleeting occurrence. Yet what of the public or private? Still, no function is more divine than this single strike: Hence, Master Lü’s words—*Brightly illuminated, yet no trace remains; within the thunder’s crash, the root is spontaneously attained*—mirror the Zen school’s striking gongs, shouting, or prodding with staves, all meant to reveal this marvel of the ear’s perfect penetration.\n\nNot only this—even the three bodies of the Buddha do not surpass it. Why? Because *swift thunder and fierce winds stun all things into motion* means hearing the voice and receiving the Way directly, awakening all sentient beings to their Buddha-nature—that is the *Transformation Body*. *Supreme joy overflowing essence* means transcending delusion, body and mind at ease, the nature’s vast embrace pervading the *dharma-realm*—that is the *Reward Body*. *Supreme stillness preserving purity* means profound stillness, the Unmoved One, originally devoid of taking or rejecting, untouched by defilement—that is the *Dharma Body*.\n\nThe Buddha’s three bodies are nowhere else so clearly illuminated.**",
      "overlap_context": "is life.\n\nThe lesser scholars hear this and laugh it off,\nor they borrow its divine power,\nrelying on their talent to act recklessly,\nuntil they meet ruin—losing their lives and their families,\ndying without enlightenment.\nIs this not to scorn the study of heaven and humanity as mere feathers,\nto equate life’s worth with dust?\nThis is the *petty man* risking his fate.\n\nThe proverb says:\n*\"A wicked man attains the true method—*\n*the true method becomes entirely wicked.\"*\nThis refers to the same.」",
      "start_char": 5450,
      "end_char": 6385,
      "start_sentence": 182,
      "end_sentence": 202,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 11.05155634880066,
      "metadata": {
        "source_file": "dao\\藏外\\阴符发秘.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "禽之制在气。 【注曰：禽者飞扬之物，即天性之不能伏藏者也。 炁者，太和氤氲之元气，天人相应之秘机，独能含情抱性、凝精毓神之至宝也。 夫五贼未戕之真体，本以阴阳之妙合二五之精凝，曷用夫此气制此禽乎今也神既翱翔于纷华之域矣，气随陷溺于爱欲之场矣，所以圣人不得已而示以相制相成之妙旨。 盖神之与气，犹男之与女、火之与薪也，今日禽之制在气者，犹用女以配男、用薪以传火也，则天涯荡子庶几有乡关之恋恋，不致于云踪雁迹也。 但用气之旨，圣经绝不言身中之气，而必斤斤乎天人合发之机者，盖以此躯为有形有质，皆属于后天而不可用故也。 】 生者死之根，死者生之根，恩牛于害，害生于恩。 【注曰：万物生皆死，故曰生生者不生，元神死复生，故曰未死先学死，其意云何夫性体无摇，寂然常住，人何有去来生死之可议哉无如人心向外驰聘，是须善用伏藏。 伏藏者，未死先学死之道，即生之根于死也。 苟不伏藏，便谓之生矣，生死维何即心之生于物也，心既随情着物，身自依时变灭，故曰生生者不生，即死之根于生也。 恩生于害者，龙蛟起陆，根于霜雪之残，雷动风行，昉于蛰潜之候； 害生于恩者，奸邪蕴国，将成必溃之机，叶茂花明，实是摧残之始。 不独此也，即人情世道，莫不皆然，所以斧斤鸩毒，每在衽席豆觞之间，弯弓下石，起于朗夕亲昵之人，此太上所以有宠辱若惊之语，《火候图》有刑德相负之机也，世出世间请事斯语。 】 愚人以天地文理圣，我以时物文理哲。",
      "translated_text": "「The formation of birds is governed by *qi*. 【The note says: Birds are creatures of flight and exuberance, embodying the celestial nature that cannot be subdued or concealed. *Qi* is the primordial breath of *Tàihé* (Great Harmony), the subtle essence that resonates between heaven and humanity, the supreme treasure that alone can nurture emotions, embrace innate nature, condense essence, and refine spirit. The true essence unharmed by the Five Evils (of excess) originally coalesces through the interplay of yin and yang, refining the Five Agents (of wood, fire, earth, metal, water). Why then does this *qi* govern the formation of birds? Now, the spirit soars freely in the realm of worldly splendor, while *qi* succumbs to the depths of love and desire. Thus, the Sage, compelled by necessity, reveals the subtle principle of mutual regulation and completion.\n\nThe relationship of spirit to *qi* is akin to that of male to female, or fire to kindling—today, the formation of birds is governed by *qi*, just as the female is used to pair with the male, and kindling is employed to ignite the fire. Then, even the wandering soul may yearn for its lost home, and not stray like clouds or wild geese in flight.\n\nBut the intent is to harness *qi*—the scriptures never speak of *qi* within the body, but rather emphasize the mechanism where heaven and humanity converge in perfect harmony. For this physical form is of tangible substance, all belonging to postnatal development and thus cannot be utilized.】\n\nLife is the root of death, and death is the root of life; favor breeds harm, and harm engenders favor. 【The note says: All things that are born must die, hence it is said that \"life does not persist in life.\" The original spirit dies yet is reborn, hence \"learn death before death arrives.\" How so? The innate nature remains unshaken, ever abiding in stillness—what need is there for humans to speak of coming and going, birth and death? Yet, when the human heart strays outward in pursuit, one must skillfully practice concealment and restraint.\n\nConcealment and restraint is the Way of \"learning death before death arrives\"—the root of life lies in death. If one does not practice concealment, it is called life. The cycle of life and death is merely the heart’s attachment to things—once the heart clings to emotions and objects, the body itself changes and perishes with time. Hence, \"life does not persist in life,\" for death is the root of life.\n\nFavor arises from harm: the dragon and great serpent emerge from land, rooted in the devastation of frost and snow; thunder shakes and winds rage, beginning in the dormant season of hibernation.\n\nHarm arises from favor: wickedness festers in the realm of desire, and its fruition is sure to collapse; when leaves flourish and flowers bloom, it is the very beginning of their ruin.\n\nNot only this—even human emotions and worldly affairs follow the same pattern. Thus, the axe and poison often lurk in the midst of banquet and wine, while arrows fly and stones are cast by those who were once intimate in day and night. This is why the *Tàishàng* (Supreme Ruler) speaks of \"honor and disgrace as if they were sudden shocks,\" and the *Huǒhòu Tú* (Illustration of Fire and Timing) contains the principle of \"virtue and power mutually supporting yet opposing.\" All beings, both within and beyond the world, must heed these words.】\n\nFools revere the patterns of heaven and earth as sacred,\nI perceive the patterns of time and things as profound wisdom.",
      "overlap_context": " awakening all sentient beings to their Buddha-nature—that is the *Transformation Body*. *Supreme joy overflowing essence* means transcending delusion, body and mind at ease, the nature’s vast embrace pervading the *dharma-realm*—that is the *Reward Body*. *Supreme stillness preserving purity* means profound stillness, the Unmoved One, originally devoid of taking or rejecting, untouched by defilement—that is the *Dharma Body*.\n\nThe Buddha’s three bodies are nowhere else so clearly illuminated.**",
      "start_char": 6385,
      "end_char": 6976,
      "start_sentence": 203,
      "end_sentence": 218,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 9.206354141235352,
      "metadata": {
        "source_file": "dao\\藏外\\阴符发秘.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "【注曰：人见观天察地之旨，以为《阴符》之学必在天星地文，几至数绎分经，寻文理迹，而不知夺神功改天命之道岂在兹乎故以天地文理圣者，愚人也。 若夫时物文理哲者，即前文不神而神之谓也。 时者即祸发机动之时，物者即物欲纷然之际，人苟能于祸发机动之时，不惟不令其有必克必溃之势，且能知之修之而又能返之，此时文之既明也。 人又能于物诱纷纭之际，不惟不令其相残相盗，且能回机内照，翕聚伏藏，此物理之且哲也。 然此时文也、此物理也，岂非吾从朝至暮、举足动念、触着磕着，至亲非外，至近非遥，只此极平常处，实是凡圣转关之津要也。 愚人舍此而他歧，岂非弃近而求远乎古人云：天然鼎炉，现成药物，自然符火，此三语非圣人亲行实证不能道此也。 】 人以愚虞圣，我以不愚虞圣，人以奇期圣，我以不奇期圣，沈水入火，自取灭亡。 【注曰：圣人见素抱朴，和光同尘，俗人昭昭，我独若昏，故人以愚测圣，则失之于卑下也，犹沈水也。 宇宙在乎手，万化生乎身，圣功生焉，神明出焉，此自然无为之道也。 世人以奇测圣，则失之于过高也，犹入火也，皆不足以语道者也。 沈水入火，自取灭亡者，犹谚云仰面唾天、徒污己面之意，吾故曰且有真人而后有真知，庸知吾所谓圣之非人乎人之非圣乎谁知吾所谓不圣之所以圣圣、不神之所以神神乎】 自然之道静，故天地万物生，天地之道浸，故阴阳胜，阴阳相推而变化顺矣。 【注曰：此节上二句说先天，即不生而生生，以虚静自然为生天生地之根本； 下二句说后天，即生生者不生，以阴阳化机之奉天应时而发育也。 自然之道静者，先天太极之体也，静极则动，动极复静，则天地之定位矣，于是而人物生焉。 人物何以生盖以天地之道浸也，浸者如湿与乾渐沁渐渍，无非形容气机流动之象，即阴阳相胜之理如此。 阴阳相胜者，即如阴之渐渐消一分，则阳亦渐渐息一分，阴之渐渐胜一分，则阳亦渐渐损一分，如是相推相荡，则变化顺而人物得以遂其生矣。 此明后天气机之奉时而化育也。 然《易》谓奉天时者，当知即此经所言天人合发之时、时动食时之时、日月小大之时，了无间义也，后真用火候二字，是知《易》之所谓奉天时者，乃火候之宗源也。 】 是故圣人知自然之道不可违，因而制之，至静之道，律历所不能契，爰有奇器，是生万物、八卦、甲子、神机鬼藏，阴阳相胜之术，昭昭乎进乎象矣。 【注曰：此承上文言先天圣人之道，天且弗违，而况于人乎圣人由是而裁制一种至精至当之法，以尽其自然之道。 但因而制之一句犹非定法，不过虚翕下文爰有奇器一段经旨耳。 圣人又复言：自然之道，廓然无象，冥然无迹，既不可以音声求，又何可以象数计乎于是而奇器之制不得不逗漏焉。 予节阅古今《阴符》解注，至奇器二字，无有不支离曲说、不畅经旨，殊不知经之首篇早已言之详矣。 经云：立天定人，又曰万化定基，此立字、定字、基字，皆奇器之伏脉也。 亦即《易》之所谓正位凝命也。 但奇器之名，古今不一：如《道德经》名曰玄牝，而《参同契》命为鼎炉，《黄庭》谓之丹田，名乃异而用实同也。 无非喻圣人之所以盗阴阳、藏造化，必有建立之基、经营之所。",
      "translated_text": "The annotator says: *\"People see the purpose of observing heaven and earth as lying in the stars and patterns of the earth, assuming that the study of the* Yīnfú *(*Obverse of the Mysterious*) must be found in celestial omens and terrestrial markings. They go so far as to dissect numbers, trace scriptural threads, and follow textual patterns—yet they fail to grasp that the Dao of seizing divine efficacy and altering fate lies not therein. Thus, those who revere the patterns of heaven and earth as sacred are fools.\n\nAs for the profound wisdom of time and things—this is what the earlier text means by 'not divine yet divine.' Time refers to the moment when calamity’s mechanism is set in motion; things refer to the tumult of desires. If one can, at the moment when calamity’s mechanism is set in motion, not only prevent it from reaching an inevitable victory or collapse but also know, cultivate, and even reverse it—then the pattern of time is already clear. If one can, amid the enticing chaos of desires, not only prevent mutual destruction and theft but also turn the mechanism inward, illuminate from within, gather and conceal—then the principle of things is truly profound.\n\nYet this pattern of time and this principle of things—are they not the very moments, from dawn to dusk, in every step and thought, every touch and encounter, where the closest is not distant and the most ordinary is the pivotal threshold for the transformation of the common and the sage? Fools abandon this for other paths—is this not seeking the far while discarding the near? The ancients said: 'The cauldron and furnace are natural, the medicines are ready-made, the talismans are spontaneously ignited'—these three phrases could only be spoken by the Sage after personal, verified practice.*\n\n---\n\nPeople deem me foolish and simple, yet I deem the Sage foolish and simple. People expect the Sage to be extraordinary, yet I expect the Sage to be unremarkable. To sink in water or plunge into fire is to court one’s own destruction.\n\n*The annotator says: The Sage appears plain and unadorned, blending with the dust of the world, while the vulgar shine brightly. I alone seem dim. Thus, when people measure the Sage by folly, they underestimate, like water sinking. The universe lies within the hand; all transformations arise from the body. From here, sage efficacy is born, and divine clarity emerges—this is the Dao of natural effortlessness. When the world measures the Sage by the extraordinary, they overestimate, like fire entering—both fail to speak of the Way. To sink in water or plunge into fire is to court one’s own destruction—just as the proverb says, 'Spitting upward at heaven only soils one’s own face.' Hence, I say: Only when the True Person arises does True Knowing arise. How could one know whether my Sage is not the people’s Sage, or the people’s Sage is not my Sage? Who knows whether my 'un-Sage' is the very Sage, or my 'un-divine' is the very divine?\"*\n\nThe Dao of Nature is still, and thus heaven and earth and all things are born. The Dao of heaven and earth is gradual, and thus yin and yang prevail. As yin and yang push against each other, transformation proceeds in harmony.\n\n*The annotator says: The first two sentences speak of the primordial—what is not born yet gives birth, with emptiness and stillness as the root of heaven and earth’s generation. The latter two speak of the subsequent—what gives birth does not itself arise, with the mechanism of yin and yang’s transformation following heaven and responding to time to flourish.\n\nThe Dao of Nature is still—this is the essence of the Primordial Supreme Ultimate. Stillness to its extreme becomes motion; motion to its extreme returns to stillness, and thus heaven and earth’s positions are fixed, giving rise to all things and beings.\n\nHow do beings arise? It is because of the gradual Dao of heaven and earth—gradual as moisture permeating dryness, seeping and soaking without cease, merely describing the movement of qi and the interplay of yin and yang. When yin and yang prevail, as yin gradually diminishes by a fraction, yang also gradually wanes by a fraction; as yin gradually prevails by a fraction, yang also gradually diminishes by a fraction. Thus, as they push and surge against each other, transformation proceeds in harmony, and all things and beings fulfill their growth.\n\nThis clarifies how the subsequent qi follows time in its nurturing. Yet the *Yì* says, 'To follow heaven’s timing,' knowing that this is the very moment when the *Yīnfú* speaks of the convergence of heaven and human, when time moves and time is consumed, when the sun and moon wax and wane—with no distinction in meaning. Later, the term *fire and timing* is used, showing that the *Yì*’s 'following heaven’s timing' is the origin of fire and timing’s principles.*\n\nThus, the Sage knows the Dao of Nature cannot be defied and acts accordingly. The Dao of utmost stillness cannot be measured by calendars or mathematical calculations, hence the creation of extraordinary instruments—those that generate all things, the Eight Trigrams, the Heavenly Stems and Earthly Branches, the divine mechanisms and hidden arts of yin and yang’s mutual prevalence—clearly manifesting in symbols.\n\n*The annotator says: This continues the earlier discussion of the Sage’s primordial Dao—heaven itself does not defy it, let alone humans. The Sage thus refines a method most precise and appropriate to exhaust the Dao of Nature. Yet the phrase 'acting accordingly' is still not a fixed law; it merely sets the stage for the following passage on 'extraordinary instruments.'\n\nThe Sage further states: The Dao of Nature is vast and formless, obscure and traceless—it cannot be sought through sound or calculated by symbols and numbers. Thus, the creation of extraordinary instruments becomes inevitable.\n\nAfter reviewing ancient and modern commentaries on the *Yīnfú*, I find that whenever the term 'extraordinary instruments' appears, they are either disjointed or fail to capture the text’s intent. Yet the first chapter of the *Yīnfú* itself has already explained it thoroughly. The text says: 'Establish heaven, define humanity,' and again, 'The foundation of all transformations is set.' The characters *establish*, *define*, and *foundation* are the hidden veins of 'extraordinary instruments.' This is also the *Yì*’s 'correcting position and solidifying fate.'\n\nHowever, the name 'extraordinary instruments' varies across texts: the *Dàodéjīng* calls it the *Mysterious Female*, the *Cāntóng Qì* names it the *Cauldron and Furnace*, and the *Huángtíng* refers to it as the *Dan Field*—names differ, yet their use is the same. All are metaphors for how the Sage steals yin and yang, concealing the workings of creation, necessarily requiring an established foundation and a place of cultivation.\"",
      "overlap_context": "y and stones are cast by those who were once intimate in day and night. This is why the *Tàishàng* (Supreme Ruler) speaks of \"honor and disgrace as if they were sudden shocks,\" and the *Huǒhòu Tú* (Illustration of Fire and Timing) contains the principle of \"virtue and power mutually supporting yet opposing.\" All beings, both within and beyond the world, must heed these words.】\n\nFools revere the patterns of heaven and earth as sacred,\nI perceive the patterns of time and things as profound wisdom.",
      "start_char": 6977,
      "end_char": 8209,
      "start_sentence": 219,
      "end_sentence": 248,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 16.18340229988098,
      "metadata": {
        "source_file": "dao\\藏外\\阴符发秘.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "盖奇者对偶之称； 器者受衷之府； 故太极者，天地之奇器也； 而奇器者，乃人身之太极也。 此器不与天地并列而能生天地，不与万法为侣而能生万象，超出万灵，至尊无对，故曰奇器，实为道之原炁之本，万化之基，《阴符》之祖，圣人藉以下手施功之地也。 发杀机于此器发，盗三才于此器盗，三要返于此，不神之神神于此。 从此器而顺育阴阳则生人生物，由此器而逆施造化则成圣登真，五行运而八卦生，两仪旋而甲子布，合溯藏机，神迎鬼避，此统奇器之功能也如此。 要知天地间本无万物，只有万象，本无万象，只有卦爻，本无卦爻，只有干支，本无干支，只有八卦，本无八卦，只有五行，本无五行，只有四象，本无四象，只有两仪，本无两仪，只有太极，得其太极之元，则八卦自然内运，甲子自然进退，而阴阳自然升降矣。 至功圆道备之期，则阴尽阳纯而神明自然显象，得其一万事毕，其奇器之谓欤!既得奇器之真，则前所谓宇宙在乎手之奇，万化生乎身之妙，今也见乎三要，充乎四肢，弥漫六合，塞乎天地，历历分明，无有着现明显于此者，故曰昭昭乎进乎象矣。 呜呼!三辰昭假，万化现成，人亦何为，而甘自弃乎!勉之哉!勉之哉!】 《阴符经》经传订正 长洲八十老孩张清夜子还注",
      "translated_text": "The extraordinary is the name for what is paired;\nThe vessel is the repository of what is central.\nThus, the **Taiji** is the extraordinary vessel of heaven and earth,\nYet the extraordinary vessel is the **Taiji** of the human body.\n\nThis vessel does not stand alongside heaven and earth yet gives birth to them,\nDoes not consort with the myriad dharmas yet generates the myriad phenomena.\nIt transcends all living beings, most exalted with no equal—\nHence it is called the *extraordinary vessel*,\nTruly the origin of the Dao, the root of qi, the foundation of all transformations,\nThe progenitor of the *Yīnfú*,\nThe place where the Sage begins to act and apply his power.\n\nHere, the killing intent is unleashed from this vessel,\nHere, the Three Powers are stolen from this vessel,\nThe Three Treasures return to this vessel,\nAnd the unmanifested manifests itself here.\n\nFrom this vessel, nurturing yin and yang in accordance yields life for humans and things;\nFrom this vessel, reversing creation transforms one into a Sage or Immortal.\nThe Five Phases move, and the Eight Trigrams arise;\nThe Two Principles revolve, and the Heavenly Stems and Earthly Branches are arranged.\nUniting and tracing hidden mechanisms, the spirit beckons while ghosts retreat—\nSuch is the function of the extraordinary vessel.\n\nKnow that between heaven and earth, there are originally no myriad things,\nOnly myriad phenomena;\nOriginally no myriad phenomena,\nOnly trigrams and lines;\nOriginally no trigrams and lines,\nOnly Heavenly Stems and Earthly Branches;\nOriginally no Heavenly Stems and Earthly Branches,\nOnly the Eight Trigrams;\nOriginally no Eight Trigrams,\nOnly the Five Phases;\nOriginally no Five Phases,\nOnly the Four Symbols;\nOriginally no Four Symbols,\nOnly the Two Principles;\nOriginally no Two Principles,\nOnly the **Taiji**.\n\nObtaining the primal essence of the **Taiji**,\nThe Eight Trigrams naturally move within,\nThe Heavenly Stems and Earthly Branches naturally advance and retreat,\nAnd yin and yang naturally ascend and descend.\n\nWhen the perfecting of the Dao and the completion of its power is achieved,\nYin is exhausted and yang is pure, and the numinous naturally manifests.\nObtain this, and all things are accomplished—\nThis is the extraordinary vessel!\n\nOnce the true nature of the extraordinary vessel is attained,\nThen what was previously called the \"cosmos within the palm’s extraordinary power\"\nAnd the \"myriad transformations arising from the body’s marvel\"\nNow appears in the Three Treasures,\nFills the four limbs,\nPermeates the six directions,\nFills heaven and earth—\nClear and distinct, with nothing more manifest than this.\nThus it is said: *\"Shining brightly, it advances into the realm of phenomena.\"*\n\nAlas! The Three Celestial Luminaries shine in vain,\nThe myriad transformations are already complete—\nYet what does humanity do, that it would willingly abandon itself?\nStrive, oh strive!",
      "overlap_context": "is is also the *Yì*’s 'correcting position and solidifying fate.'\n\nHowever, the name 'extraordinary instruments' varies across texts: the *Dàodéjīng* calls it the *Mysterious Female*, the *Cāntóng Qì* names it the *Cauldron and Furnace*, and the *Huángtíng* refers to it as the *Dan Field*—names differ, yet their use is the same. All are metaphors for how the Sage steals yin and yang, concealing the workings of creation, necessarily requiring an established foundation and a place of cultivation.\"",
      "start_char": 8209,
      "end_char": 8705,
      "start_sentence": 249,
      "end_sentence": 260,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 7.842494964599609,
      "metadata": {
        "source_file": "dao\\藏外\\阴符发秘.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "首卷 观天之道，执天之行。 [尽矣。 ] 【注曰：二字传，赞辞。 以蔽全经意。 】 天有五贼，见之者昌，五贼在心，施行于天，宇宙在乎手，万化生乎身。 [天性，人也； 人心，机也。 立天之道，以定人也。 ] 【注曰：十六字传，释文。 天性人也，释首二句； 人心机也，释五贼在心； 立天之道二句，释施行三句。 】以上经文三十四字。 天发杀机，星辰陨伏； 地发杀机，龙蛇起陆； 人发杀机，天地反覆； 天人合发，万化定基。 性有巧拙，可以伏藏，九窍之邪，在乎三要，可以动静。 火生于木，祸发必克，奸生于国，时动必溃，知之修之，谓之圣人。 [天生天杀，道之理也。 ] 【注曰：八字传，释文。 经首段杀寓生； 次段生寓杀； 中伏藏、动静，示修炼。 天生天杀释生杀道之理，示修炼。 】以上经文共七十六字。 凡一百一十字。",
      "translated_text": "**First Scroll**\nObserve the Dao of Heaven, grasp Heaven’s actions.\n[*Complete.*]\n[*Commentary:* These two characters are a transmission—an encomium summarizing the entire text.]\n\nHeaven has five malefactors; those who perceive them prosper.\nThe five malefactors reside in the heart,\nand their operation extends to Heaven—\nthe cosmos lies within the hand’s power,\nthe myriad transformations arise from the body’s marvel.\n\n[*Heaven’s nature is humanity; humanity’s heart is the mechanism.\nEstablish the Dao of Heaven to steady humanity.*]\n[*Commentary:* These sixteen characters are a transmission—an exposition.\n*\"Heaven’s nature is humanity\"* elucidates the first two lines;\n*\"humanity’s heart is the mechanism\"* explains the five malefactors in the heart;\n*\"Establish the Dao of Heaven\"* clarifies the three lines on their operation.]\n\nThe above scripture comprises thirty-four characters.\n\nWhen Heaven unleashes its killing intent, stars and constellations fall;\nwhen Earth unleashes its killing intent, dragons and serpents rise upon the land;\nwhen humanity unleashes its killing intent, Heaven and Earth reverse their course;\nwhen Heaven and humanity jointly unleash their intent, the foundation of the myriad transformations is set.\n\nNature has skill and clumsiness, which can be concealed.\nThe nine orifices’ malevolence lies within the Three Treasures,\nand can be made to move or stilled.\n\nFire arises from wood—when calamity emerges, it must be overcome;\ntreachery arises in the realm—when it stirs, it must collapse.\nTo know and cultivate this is called the Sage.\n[*Heaven generates and Heaven kills—this is the logic of the Way.*]\n[*Commentary:* These eight characters are a transmission—an exposition.\nThe first segment embeds killing within generation;\nthe next embeds generation within killing;\nthe middle speaks of concealment and motion-stillness, demonstrating cultivation.\n*\"Heaven generates and Heaven kills\"* elucidates the logic of generation and killing in the Way, demonstrating cultivation.]\n\nThe above scripture totals seventy-six characters.\nIn all, one hundred ten characters.",
      "overlap_context": "nd the \"myriad transformations arising from the body’s marvel\"\nNow appears in the Three Treasures,\nFills the four limbs,\nPermeates the six directions,\nFills heaven and earth—\nClear and distinct, with nothing more manifest than this.\nThus it is said: *\"Shining brightly, it advances into the realm of phenomena.\"*\n\nAlas! The Three Celestial Luminaries shine in vain,\nThe myriad transformations are already complete—\nYet what does humanity do, that it would willingly abandon itself?\nStrive, oh strive!",
      "start_char": 8705,
      "end_char": 9046,
      "start_sentence": 261,
      "end_sentence": 292,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 5.545692205429077,
      "metadata": {
        "source_file": "dao\\藏外\\阴符发秘.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "旧作上篇，而以传文八字误作中篇首句。 中卷 天地，万物之盗； 万物，人之盗； 人，万物之盗。 三盗既宜，三才乃安； 故曰食其时，百骸理，劲其机，万化安。 人知其神之神，不知不神之所以神，日月有数，小大有定，圣功生焉，神明出焉。 [其盗机也，天下莫能见、莫能知，君子得之固躬，小人得之倾命。 ] 【注曰：二十四字传，赞辞。 指盗机为不神神，为圣之隐。 】以上经文六十八字，旧作中篇。 下卷 瞽者善听，聋者善视，绝利一源，用师十倍，三返昼夜，用师万倍。 心生于物、死于物，机在目。 天之无恩而大恩生，迅雷烈风，莫不蠢然。 至乐性余，至静性廉。 天之至私，用之至公，禽之制在气。 生者死之根，死者生之根。 恩生于害，害生于恩。 [愚人以天地文理圣，我以时物文理哲，人以愚虞圣，我以不愚虞圣，人以奇期圣，我以不奇期圣。 ] 【注曰：三十七字传，释叹辞。 人见圣人绝利忘机，遂以为愚，见圣人刑赏与夺，遂又以为奇。 】 沈水入火，自取灭亡，自然之道静，故天地万物生。 [天地之道浸，故阴阳胜，阴阳相推而变化顺矣。 圣人知自然之道不可违，因而制之。 至静之道，律历所不能契。 ] 【注曰：四十二字传，释文。 】 爰有奇器，是生万象、八卦、甲子，神机鬼藏。 [阴阳相胜之术，昭昭乎进乎象矣。 ] 【注曰：此十三字传，赞辞。",
      "translated_text": "The old text was composed as the upper section, yet the eight-character transmission was mistakenly taken as the opening line of the middle section. In the middle scroll:\n\n*The heavens and earth are the thieves of all things;\nAll things are the thieves of humankind;\nHumankind are the thieves of all things.*\n\nWhen the three thieves are harmonized, the Three Powers are at peace;\nThus it is said: *Eat of its season, and the hundred bones are in order,\nStrengthen its mechanism, and all transformations are at peace.*\n\nHumankind knows the spirit of the spirit,\nBut does not know how the non-spirit becomes spirit.\nThe sun and moon have their cycles,\nThe small and great have their limits;\nThus the Sage’s work is born,\nAnd the divine wisdom emerges.\n\n[*Its mechanism of theft is invisible—\nNo one in the world can see it, no one can know it.\nThe virtuous one who grasps it preserves himself,\nThe petty one who grasps it risks his life.*]\n\n【Commentary:】 A twenty-four-character transmission, an exposition.\nIt points to the mechanism of theft as the non-spirit of the spirit,\nThe hidden principle of the Sage’s wisdom.\n\nThe above scripture totals sixty-eight characters,\nThe old text as the middle section.\n\nIn the lower scroll:\n\n*The blind excel in hearing, the deaf excel in sight;\nSevering one source of profit,\nThe teacher’s use becomes tenfold;\nThree cycles of day and night,\nThe teacher’s use becomes ten thousandfold.*\n\n*The heart is born from things and dies from things,\nIts mechanism lies in the eyes.*\n*The heavens bestow no favor yet great favor arises—\nSwift thunder and fierce winds,\nAll things respond in confusion.*\n\n*Supreme joy is the nature’s excess,\nSupreme stillness is the nature’s restraint.*\n*The heavens’ utmost partiality,\nWhen applied, becomes the utmost public good;\nThe creatures’ design lies in their qi.*\n\n*The living are the root of the dead,\nThe dead are the root of the living.*\n*Favor arises from harm,\nHarm arises from favor.*\n\n[*Fools take the heavens’ patterns and logic as the Sage’s,\nI take the season’s patterns and logic as wisdom.\nPeople take folly as the Sage’s folly,\nI take non-folly as the Sage’s wisdom.\nPeople take the strange and the expected as the Sage’s,\nI take the non-strange and non-expected as the Sage’s.*]\n\n【Commentary:】 A thirty-seven-character transmission, an exposition of exclamations.\nPeople see the Sage sever profit and forget mechanism,\nAnd thus assume him to be foolish.\nThey see the Sage’s punishments and rewards,\nAnd thus assume him to be strange.\n\n*To sink in water and enter fire,\nIs to invite one’s own destruction.*\n*The Dao of nature is still,\nThus the heavens and earth, all things, are born.*\n[*The Dao of the heavens and earth is subtle,\nThus yin and yang prevail;\nYin and yang, in their mutual overcoming, bring forth transformations in harmony.\nThe Sage knows the Dao of nature cannot be defied,\nAnd thus regulates it accordingly.\nThe Dao of supreme stillness,\nCannot be measured by calendars and mathematical rules.*]\n\n【Commentary:】 A forty-two-character transmission, an exposition.\n\n*Hence there exists a wondrous instrument,\nWhich generates the myriad phenomena, the Eight Trigrams, the Heavenly Stems and Earthly Branches,\nThe divine and hidden mechanisms.*\n\n[*The art of yin and yang overcoming,\nIs clearly revealed in the patterns.*]\n\n【Commentary:】 This thirteen-character transmission is an exposition.",
      "overlap_context": " kills—this is the logic of the Way.*]\n[*Commentary:* These eight characters are a transmission—an exposition.\nThe first segment embeds killing within generation;\nthe next embeds generation within killing;\nthe middle speaks of concealment and motion-stillness, demonstrating cultivation.\n*\"Heaven generates and Heaven kills\"* elucidates the logic of generation and killing in the Way, demonstrating cultivation.]\n\nThe above scripture totals seventy-six characters.\nIn all, one hundred ten characters.",
      "start_char": 9046,
      "end_char": 9591,
      "start_sentence": 293,
      "end_sentence": 329,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 8.949280261993408,
      "metadata": {
        "source_file": "dao\\藏外\\阴符发秘.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "】以上经文几百二十四字，旧作下篇。 通共别出传文百四十二字，得经文三百零二字。 旧共四百四十四字，不分经传，于三百字之数太溢，今辨其文义，经传宛在。 附录一：《玄门戒白》 乾隆丙寅 牧道人清夜于壬戌岁归葬二亲毕，不觉身世两忘，倏然悬解。 乃至明年癸亥复入蜀，栖息成都，往来于青羊宫、武侯祠之间。 因念遭际之隆，益愧自修之浅，日夜兢惕，希累尺寸，以仰酬四重。 奈既托迹清虚，无由建白，惟有罄其所觉，以劝方来。 于是大白于众曰：皇天无二道，圣人无两心，教象虽殊，制行惟一，乃知孝弟忠信为三教之主宰，礼义廉耻实列圣之纲维，立基既固，冲举何难!大本一亏，飞升奚自其他异端邪说，皆因传者之讹，至若惑世诬民，盖缘学之不正。 且《道德》五千言，总以清静为宗，《金丹四百字》，惟期守真是务，《参同契》、《悟真篇》，并未及役鬼驱神，《心印经》、《青华录》何尝是烧茅炼汞，无论功修内外，胥依德行浅深，若圣石《指玄篇》、崔公《入药镜》，字字专精似金碧，《龙虎经》、《铜符铁卷文》，言言的确，只因心别公私，以致事有成败，而乃归咎先师，流浪尘劫； 永无出期，宁不悲哉!今我发大慈悲，立洪誓愿，直指真机，敷陈道要，披青作誓，敢希谛听。 夫自古拔宅飞升者，无非功高德厚之人； 凝神驳气者，悉皆专心致志之士。",
      "translated_text": "Above, the scripture comprises some **324 characters**, formerly designated as the lower section. In total, **142 additional transmission characters** are appended, yielding a combined text of **302 characters** in the scripture. Formerly, the total was **444 characters**, undifferentiated between scripture and transmission—a number far exceeding the three hundred mark. Now, by distinguishing their meanings, the scripture and transmission remain intact.\n\n**Appendix I: *The Vow of the Mystic Gate***\nIn the year **Gengyin of the Qianlong era** (乾隆丙寅), the **Pastoral Daoist** recorded in the quiet of night: After completing the rites of returning to bury my parents in the **Rensu year** (壬戌), I found myself suddenly detached from the world, as if my bonds had been severed.\n\nYet in the following year, **Guihai** (癸亥), I returned to **Sichuan**, dwelling in **Chengdu**, traveling between the **Qingyang Palace** and the **Wuhou Temple**. Reflecting on my fortunate circumstances, I grew ever more ashamed of my shallow self-cultivation. Day and night, I remained vigilant, striving for even the slightest progress, to repay the **Four Debts** above.\n\nBut since I have taken refuge in the **Pure Void**, there is no way to present my thoughts. Thus, I must lay bare what I have realized, to exhort those who follow.\n\nI declared to the assembly: The **Heavenly Dao is singular**, the **Sage’s intent is undivided**. Though their teachings may differ in form, their conduct is one. Thus, I know that **filial piety and fraternal duty, loyalty and sincerity** are the sovereign principles of the **Three Teachings**, while **rites, justice, modesty, and shame** are the fundamental threads of the **Sages**. Once the foundation is firm, ascension is no difficulty! But if the **Great Root is impaired**, how can one hope to ascend?\n\nAs for **heterodox and deceitful doctrines**, they arise from the errors of transmitters. Those who mislead the world and deceive the people do so because their learning is corrupt.\n\nMoreover, the **Five Thousand Words of the *Dao De Jing*** center on **clarity and stillness**; the **Four Hundred Characters of the *Golden Elixir*** seek only to **guard the true**; the *Paramartha Contract* and *Awakening to the True* make no mention of **summoning ghosts or driving spirits**; the *Heart-Seal Scripture* and *Green Flower Record* are not about **burning reeds or refining mercury**. Whether one practices **internal or external alchemy**, all depends on the depth of one’s **virtue and conduct**. Works like the **Saintly Stone’s *Pointer to the Mystic*** and **Master Cui’s *Mirror of Entering the Medicine*** are precise as **gold and jade**; the *Dragon-Tiger Scripture* and *Copper Talisman Iron Scroll* are as certain as **iron and stone**. Yet because their hearts are divided between public and private, their affairs meet with success or failure—and they blame their **forebears**, wandering through dusty kalpas, with no end in sight. How tragic!\n\nNow, I issue a **great vow of compassion**, pointing directly to the **true mechanism**, expounding the **essentials of the Way**, and swear by the **Azure**—dare you listen closely?\n\nFrom ancient times, those who **ascended in their earthly dwellings** were all **men of lofty virtue and abundant power**; those who **concentrated their spirits and harmonized their qi** were all **men of single-minded resolve**.",
      "overlap_context": "ates it accordingly.\nThe Dao of supreme stillness,\nCannot be measured by calendars and mathematical rules.*]\n\n【Commentary:】 A forty-two-character transmission, an exposition.\n\n*Hence there exists a wondrous instrument,\nWhich generates the myriad phenomena, the Eight Trigrams, the Heavenly Stems and Earthly Branches,\nThe divine and hidden mechanisms.*\n\n[*The art of yin and yang overcoming,\nIs clearly revealed in the patterns.*]\n\n【Commentary:】 This thirteen-character transmission is an exposition.",
      "start_char": 9591,
      "end_char": 10129,
      "start_sentence": 330,
      "end_sentence": 343,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 10.804231643676758,
      "metadata": {
        "source_file": "dao\\藏外\\阴符发秘.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "故三干八百，立有程规，七返九还，着其定数，太乙含真之气，盖藉神而凝，不徒是咽精服气，一阳初复之机，因无心而会，岂专在默坐顽空，似此脚踏实地，功到自然成，如彼捕风捉影，毕世何由觅近世师愈多而道愈歧，德愈薄而心愈昧，或偏执一隅，至死不回，或首鼠两端，终身罔济，或藉疯颠以欺人，踰闲荡检，或假黄白而蛊众，灭理欺心。 无怪牛毛学道，兔角成仙，甚至稿葬郊原，横填沟壑，恶风相继，举世知非，仙派源流，于今几绝，为劝方来，各宜猛省，急早回头。 步步踏矩循规，事事敦伦饬纪，尽力乎孝弟忠信，黾勉乎礼义廉耻，须知大道出自纲常，纲常外无大道，广行方便，多积阴功，庶几修内丹者龙虎伏而鬼神钦，专炉火者魔障消而福缘凑，准是以求，得同操券，爰兹而取，易若探囊，谓不信者，请质心于三清圣人，如涉是诬，愿投灵于四生别殻。 谨白。 附录二：青羊宫《阴符经碑》跋 世之论《阴符》者多矣，或曰广成子所作，授之黄帝； 或曰春秋时书； 紫阳氏谓战国见道之士所作； 或又云养生、王政、兵法。 诸家注解，纷然不一。 余今以一言断之曰：皆是而皆非也。 何以故《易》曰仁者见之谓之仁，知者见之谓之知，则出世者目为养生是也，为治者目为王政亦是也，师旅者云兵法亦无不是也。 若执何者为是，即非矣。 惟其所莫能拘、莫能定，以之推及于万事万理，而莫不至当，此其所以为《阴符》。 乃崆峒授受之文，为坟典丘索三教百家经书文字之祖，以天地幽明而原始要终，明天人未生之前、有生之后，其所以生所以死之故，盖天地与人参三才而一理，是以指天道而明人道，言简而理该，义深而行易。 总之，首以明机察物，继以知动知时，而防克防溃，其彻始彻终，不过以自然至静为功夫，以法天行健为法则，审能如是而知之防之、体之行之，则可超乎有生有形之外，而至于无声无臭之乡，生灭两忘，与太虚一体，岂止养生王政兵法而已哉!春秋战国之说无据，姑存而不论，故曰皆是而皆非也。 今王来通以是经勒石于道院，其一片至诚坚确之心，不独自行精进，实足以启发后人者，余因欣喜而为之跋。 长洲道人张清夜并书",
      "translated_text": "Thus, the **Three Thousand Eight Hundred** [precepts] stand with fixed measures,\nthe **Seven Returns and Nine Regressions** [1] are set by their ordained numbers.\nThe **True One’s** [2] *qi* of Embracing Reality is condensed through the **spirit’s** power—\nnot merely through swallowing essence and ingesting *qi*,\nbut when the **first stirrings of Yang** arise,\nit is met without contrivance, through **non-doing’s** natural convergence.\nIs it achieved by mere rigid sitting in empty void?\nOr does one merely tread the earth with certainty—\nwhen the work is done, success follows naturally—\nwhile others chase winds and shadows their whole lives,\nyet still fail to find a teacher in this age,\nthough teachers multiply and the **Way** grows ever more divergent,\nvirtue thins and minds grow ever more obscured.\nSome cling stubbornly to a single corner,\ndying without repentance;\nothers waver like a mouse’s head,\nnever making progress in life.\nSome feign madness to deceive others,\ntransgressing propriety with reckless abandon,\nwhile others exploit alchemy to ensnare the masses,\nbetraying principle and deceiving the heart.\nNo wonder the **Dao** is pursued by countless seekers,\nyet **transformation** remains as rare as rabbit’s horns—\neven to the point of burying corpses in wastelands,\nfilling ditches with the dead,\nevil winds following in succession,\nthe world recognizing their folly.\nThe **lineages of the Immortal Schools** are now nearly extinct.\nFor those who would heed this warning,\neach must **urgently reflect** and turn back without delay.\n\nStep by step, adhere to the **measure** and follow the **rule**;\nin all things, uphold **filial piety, fraternity, loyalty, and trustworthiness**,\nstrive diligently in **ritual propriety, righteousness, modesty, and shame**—\nknow that the **Great Dao** arises from **principles of order**,\nand beyond these principles, there is no **Great Dao**.\nThrough **broad and skillful means**, accumulate **meritorious deeds**,\nso that those who cultivate the **Inner Elixir** may subdue the **Dragon and Tiger** [3]\nand command reverence from **spirits and gods**,\nwhile those who focus on the **furnace’s fire** may dissolve **demonic obstructions**\nand gather **auspicious connections**.\nSeek thus, and attainment will be as certain as holding a **contract of guarantee**;\ntake this path, and success will be as easy as drawing from a **pouch**.\nAs for those who still doubt—\nlet them question the **Three Pure Ones** [4] in their hearts.\nIf they persist in slander,\nmay their **spirit** be consigned to the **Fourfold Realm of Retribution**.\n\n**Respectfully inscribed.**\n\n---\n**Appendix II: Postscript to the *Yinfu Jing* Stele of Qingyang Palace**\n\nMany have spoken of the *Yinfu Jing* [5].\nSome say it was composed by **Broad-Achieving Child** [6] and transmitted to the **Yellow Emperor**;\nothers claim it dates to the **Spring and Autumn period**;\n**Zhongyang Master** [7] asserts it was written by **Daoists of the Warring States**;\nstill others call it a treatise on **nourishment, governance, or warfare**.\nThe various commentaries diverge wildly, each inconsistent.\n\nI now resolve this with a single word:\n**All are correct, yet all are incorrect.**\n\nHow so? The *Yijing* states:\n*\"The virtuous see it as virtue, the wise see it as wisdom.\"*\nThus, those withdrawn from the world call it **nourishment**—correct;\nthose governing call it **statecraft**—also correct;\nthose of war call it **martial strategy**—equally valid.\nBut if one insists on which is *truly* correct,\nthen they are wrong.\n\nIts essence lies in what cannot be confined or fixed—\napplied to all things and all principles,\nyet never failing to strike the mark.\nThus is it the *Yinfu Jing*.\n\nIt is the **original text** of the **Kongtong transmission**,\nthe **ancestral script** of all **three teachings** and **hundred schools**,\ntracing the **origin and completion** of **dark and bright** [8] in heaven and earth,\nrevealing the **reason for life and death** before and after human existence.\nFor heaven, earth, and humanity share a single principle—\nthus it points to the **Heavenly Way** to illuminate the **Human Way**,\nits words concise yet encompassing, its meaning profound yet its practice easy.\n\nIn sum:\nFirst, it teaches **discerning mechanisms and observing things**,\nthen **knowing action and timing**,\nand **preventing collapse or defeat**.\nIts penetration from beginning to end\nrests solely on **natural stillness** as the **practice**,\nand **\"following Heaven’s vigor\"** as the **precept**.\nIf one can truly **know, prevent, embody, and act** in accordance,\nthen one may transcend the **born and formed**,\nand attain the **land of no sound, no stench**—\nforgetting birth and death,\nunifying with the **Great Void**.\nHow could it be limited to mere **nourishment, governance, or warfare**?\n\nThe claims of the **Spring and Autumn and Warring States** are baseless;\nI retain them without endorsement,\nfor I say: **All are correct, yet all are incorrect.**\n\nNow, **King Laitong** [9] has inscribed this text on stone at the **Daoist Hall**,\nhis **unshakable sincerity** not only advancing his own practice\nbut also inspiring future generations.\nThus, with joy, I write this postscript.\n\n**Written by the Daoist of Changzhou, Zhang Qingye.**",
      "overlap_context": "eir **forebears**, wandering through dusty kalpas, with no end in sight. How tragic!\n\nNow, I issue a **great vow of compassion**, pointing directly to the **true mechanism**, expounding the **essentials of the Way**, and swear by the **Azure**—dare you listen closely?\n\nFrom ancient times, those who **ascended in their earthly dwellings** were all **men of lofty virtue and abundant power**; those who **concentrated their spirits and harmonized their qi** were all **men of single-minded resolve**.",
      "start_char": 10129,
      "end_char": 10966,
      "start_sentence": 344,
      "end_sentence": 361,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 11.8327476978302,
      "metadata": {
        "source_file": "dao\\藏外\\阴符发秘.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "乾隆十六年辛未四月谷旦住持道人王来通敬立 附录三：自牧道人别传 杨润六撰 张清夜字子还，号自牧道人。 初名尊，江南长洲人，盖生于清之康熙十五年丙辰岁。 少为诸生，博学工诗，书法颜鲁公，东吴名士也。 尝游历四方，浩然有物外想。 至武当太子坡，遂从余太源真人为黄冠。 雍正元年（岁在癸卯，时道人年四十有八），溯江入蜀，遍览峨眉青城之胜，见山水之险异，察人事之变迁，益信事物有有无无之微妙。 先后居蓉垣临江寺，惜字宫，一琴一榻，萧然自得。 先是蜀抚宪德屡上书请事，末蒙朝允，幕僚咸忧之，道人为点窜数字，更奏，事遂得行。 蜀抚大异之，欲其出仕，不肯，乃请主武侯祠事（以上闻诸刘豫波先生）。 道人于雍正七年（岁在己酉，时道人年五十四）秋，移住武侯祠，谢绝尘俗，涵习清虚，暇惟展玩《阴符》。 复以余力培园陵，植松栢，殿宇垣墉，焕然一新。 祠之别院有池荷，道人所手种也。 有轩曰藕船，藕船迤南为道院，旧颜曰藏密，再南即紫阳洞，景物幽邃，去故启新，胥道人之力（按乾隆四年己未，道人年六十四，所撰青羊宫祖茔碑记，自题重开武候祠长洲道人张清夜。 考安夏属道人理青羊宫在乾隆八年，是时道人但为祖茔作碑记，故自题云耳）。 乾隆七年（岁在壬戌，时道人年六十七），复于后殿补植栢林（据成都陵庙志），是年道人旋归江南葬二亲毕，不觉身世两忘，绦然悬解，时年六十七矣。 翌年（时乾隆八年，岁在癸亥）复入蜀。 时华阳令安洪德、成都令夏绍新，既重新青羊宫，复其田亩，重道人之高隐，以青羊宫属理焉。 道人曰：此虽道教祖庭，为吾分内事，然吾老无能为也。 郡守文公（按旧志时成都知府为王时翔）又谆谆恳请，不克固辞，遂令其徒汪一萃任之。 道人亦时往来于青羊宫武侯祠之间。 越二年（乾隆十年，岁在乙丑，道人年七十），即于青羊宫创悬锺板，接待十方，一时道众闻声云集，清规复振，俨然一大丛林矣。 乾隆十一年丙寅（时道人年七十有一），道人因念遭际之隆，日夕兢惕，乃罄其所觉，以劝方来，作《玄门戒白》。 辛未（时乾隆十六年，道人七十六），住持王来通以《阴符》勒石，道人亲为书之，并跋其后。 甲戌（时乾隆十九年，道人年七十九），道人作《阴符发秘》成，题曰八十老孩（按是时道人实年七十九）。 若谷沈裕云为之序。 己卯（时乾隆二十四年，道人年八十四），青羊宫增饰殿闾，次第告成，先后已历十一载。 勒重建青羊宫碑，安洪德为撰碑文。 乾隆二十八年，岁次癸未，道人无疾而逝，世寿盖八十有八。 道人鹤发萧疏，吐词清妙，工书，着有《潭东草》厥后沈阳范宜宾于乾隆壬辰岁（时为乾隆三十七年），得道人《发秘》，宜宾绍嵩山先生之传，见道人秘诀，同出一途，其中秘密，道人已流露于前，则隐而未发之义，不得不解之于后，遂更作《阴符玄解》，其序云：“道人素明南宫之术，却于内丹成道，惜已尸解而去，不得面叩为恨耳。 ” 谨按民国二十一年青羊宫住持刘教宾重建道人墓碣，其文颇略，《成都志》亦复不详。",
      "translated_text": "**Qinglong Sixteenth Year, xīnwèi Fourth Month, Gǔ Rì**\nThe resident Daoist Master Wang Laichong respectfully established this inscription.\n**Appendix Three: A Biographical Sketch of the Self-Tending Daoist**\nComposed by Yang Runliu\n\nZhang Qingye, styled Zǐhái, with the Daoist sobriquet **Self-Tending Daoist**, was born Zhang Zūn. A native of Jiangnan’s Changzhou, he was born in the **Kangxi Fifteenth Year (1676, bǐngchén)**.\n\nIn his youth, he was a scholar-official, well-versed in learning and poetry, his calligraphy modeled after **Yán Rúgōng**, a celebrated figure of **East Wu**. He once traveled widely, his spirit unbound by worldly concerns. Upon reaching **Wudang’s Taizi Slope**, he took **yellow-crowned ordination** under Master Yú Tàiyuán.\n\nIn **Yongzheng First Year (1723, guǐmǎo)**, at age forty-eight, he ascended the river into Shu, traversing the wonders of **Emei and Qingcheng**. Witnessing the rugged beauty of mountains and waters, observing the shifts of human affairs, he grew ever more convinced of the subtle **presence and absence** of all things. He resided successively at **Línjiāng Temple in Chengdu**, **Xīzì Palace**, content with a single **zither and cot**, his solitude serene.\n\nEarlier, the **Shu provincial governor, Dú**, had repeatedly petitioned for an imperial decree, which was finally granted. His subordinates feared for him, but the Daoist merely adjusted a few characters in the petition, resubmitted it, and the matter was resolved. The governor was astonished and wished him to take office, but he declined, instead accepting the stewardship of **Wu Hou’s Shrine** (as recounted by Master Liú Yùbō).\n\nIn **Yongzheng Seventh Year (1729, jǐyǒu)**, at fifty-four, the Daoist moved to reside at **Wu Hou’s Shrine**, severing worldly ties, and immersed himself in **emptiness and stillness**. In his leisure, he studied the *Yīnfú*. With his remaining strength, he cultivated the **imperial mausoleum**, planting pines and cypresses, restoring halls and walls to pristine splendor. The shrine’s side courtyard held a lotus pond, planted by his own hands. A pavilion named **Ōu Chuán** stood to the south, beyond which lay the **Daoist Hall**—formerly called **Cángmì**—and further south, **Zǐyáng Cave**, its scenery profound and secluded. All these transformations were his doing (Note: In **Qinglong Fourth Year (1739, jǐwèi)**, at sixty-four, the Daoist inscribed the **ancestral tomb stele of Qingyang Palace** as **\"Reopening Wu Hou’s Shrine, Changzhou Daoist Zhang Qingye.\"** It is recorded that his administration of Qingyang Palace occurred in **Qinglong Eighth Year (1743)**, when he had only composed the stele, hence the self-inscription).\n\nIn **Qinglong Seventh Year (1742, rényǒu)**, at sixty-seven, he replanted cypresses in the rear hall (as per *Chéngdū Língmiào Zhì*). That year, he returned to Jiangnan to bury his parents, his mind and body freed from worldly cares, his spirit unbound. He was then sixty-seven.\n\nThe following year (**Qinglong Eighth Year, 1743, guǐhài**), he re-entered Shu. The **Hua yang magistrate, Ān Hóngdé**, and the **Chéngdū magistrate, Xià Shàoxīn**, having restored Qingyang Palace and its lands, honored his **high seclusion**, entrusting its management to him. The Daoist replied: *\"Though this is the ancestral hall of the Dao, it is within my duty. Yet I am old and powerless.\"* The prefect **Wén Gōng** (Note: The old records state the Chéngdū prefect was **Wáng Shíxiáng**) repeatedly urged him, and though he firmly declined, he allowed his disciple **Wāng Yīcuì** to take charge. The Daoist still frequently traveled between **Qingyang Palace and Wu Hou’s Shrine**.\n\nTwo years later (**Qinglong Tenth Year, 1745, yǐchǒu**), at seventy, he established **suspended bell and drum platforms** at Qingyang Palace to receive pilgrims from all directions. Daoist assemblies gathered in response, reviving the **pure rules**, and the place became a grand **monastic grove**.\n\nIn **Qinglong Eleventh Year (1746, bǐngyín)**, at seventy-one, reflecting on his fortunate circumstances, he lived in constant vigilance. He then composed *Xuánmén Jiébái*, expounding his realizations to guide future generations.\n\nIn **Qinglong Sixteenth Year (1751, xīnwèi)**, at seventy-six, **Resident Master Wang Laichong** inscribed the *Yīnfú* on stone, and the Daoist personally calligraphed it, adding his postscript.\n\nIn **Qinglong Nineteenth Year (1754, jiǎxū)**, at seventy-nine, he completed *Yīnfú Fāmì*, titling it **\"The Eighty-Year-Old Infant\"** (Note: At this time, he was actually seventy-nine). **Gǔ Yù** of **Yùshān** wrote its preface.\n\nIn **Qinglong Twenty-Fourth Year (1759, jǐmǎo)**, at eighty-four, Qingyang Palace’s halls were renovated, the work completed in stages over eleven years. A stele was erected for its reconstruction, with **Ān Hóngdé** as its inscription.\n\nIn **Qinglong Twenty-Eighth Year (1763, guǐwèi)**, the Daoist passed away peacefully at eighty-eight. His **snow-white hair** and **unbounded demeanor** were matched by his **refined speech and calligraphy**. He authored *Tán Dōng Cǎo*. Later, in **Qinglong Thirty-Seventh Year (1772, rénchén)**, **Fàn Yìbīn** of **Shènyáng** obtained a copy of *Fāmì*. As a disciple of **Shàoshān Master**, he recognized that the Daoist’s **secret precepts** aligned with his own tradition. Though the Daoist had already **ascended in body**, leaving no physical remains, Fàn lamented not having met him in person. Thus, he composed *Yīnfú Xuánjiě*, stating in its preface:\n*\"The Daoist was well-versed in **Southern Palace techniques**, yet his **inner elixir cultivation** led to transcendence. Alas, he departed before I could consult him face-to-face.\"*\n\nIt is further recorded that in **Mínguó Twenty-First Year (1932)**, **Master Liú Jiàobīn**, resident of Qingyang Palace, rebuilt the Daoist’s **tomb stele**, though its text was abbreviated. The *Chéngdū Zhì* also lacks detail.",
      "overlap_context": "ted to mere **nourishment, governance, or warfare**?\n\nThe claims of the **Spring and Autumn and Warring States** are baseless;\nI retain them without endorsement,\nfor I say: **All are correct, yet all are incorrect.**\n\nNow, **King Laitong** [9] has inscribed this text on stone at the **Daoist Hall**,\nhis **unshakable sincerity** not only advancing his own practice\nbut also inspiring future generations.\nThus, with joy, I write this postscript.\n\n**Written by the Daoist of Changzhou, Zhang Qingye.**",
      "start_char": 10966,
      "end_char": 12147,
      "start_sentence": 362,
      "end_sentence": 395,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 14.47110104560852,
      "metadata": {
        "source_file": "dao\\藏外\\阴符发秘.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "友人蒙文通据安碑知乾隆己卯道人年八十四，因考各序记，得推论道人之年世生平如此，正芳因取以为别传，于寻道家统绪者，倘有裨焉。",
      "translated_text": "The friend **Mèng Wéntōng**, citing the stele from Ānnán, learned that in the **Guānlóng jǐmǎo year** (1772), the Daoist was **eighty-four years old**. By examining various prefaces and records, he was able to **deduce** the Daoist’s **age, era, and life history** as follows. **Zhèng Fāngyīn** thus took this as the basis for his **separate transmission**, which may prove beneficial to those **seeking the lineage of the Dao**.",
      "overlap_context": "ot having met him in person. Thus, he composed *Yīnfú Xuánjiě*, stating in its preface:\n*\"The Daoist was well-versed in **Southern Palace techniques**, yet his **inner elixir cultivation** led to transcendence. Alas, he departed before I could consult him face-to-face.\"*\n\nIt is further recorded that in **Mínguó Twenty-First Year (1932)**, **Master Liú Jiàobīn**, resident of Qingyang Palace, rebuilt the Daoist’s **tomb stele**, though its text was abbreviated. The *Chéngdū Zhì* also lacks detail.",
      "start_char": 12147,
      "end_char": 12208,
      "start_sentence": 396,
      "end_sentence": 396,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 1.8543956279754639,
      "metadata": {
        "source_file": "dao\\藏外\\阴符发秘.txt",
        "category": "藏外"
      }
    }
  ]
}