{
  "source_id": "阴真君金石五相类",
  "source_file": "chunked_daozang\\阴真君金石五相类.json",
  "total_chunks": 16,
  "total_original_chars": 16840,
  "total_translated_chars": 100886,
  "total_translation_time": 341.40841603279114,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\众术类\\阴真君金石五相类.txt",
    "category": "众术类"
  },
  "full_translation": "**Dongshen Division: Miscellaneous Arts – *Yin Zhengjun’s Five Correspondences of Metals and Stones* (with Preface)**\n\n**Title:** *Yin Zhengjun’s Five Correspondences of Metals and Stones*\n**Author:** Unknown. Likely a Tang-dynasty Daoist who falsely attributed the work to the Han-era Yin Changsheng.\n**Volume:** One.\n**Source:** *Zhengtong Daozang* (Orthodox Daoist Canon of the Zhengtong era), **Dongshen Division: Miscellaneous Arts**.\n\nNow, the subtlest essence of Heaven and Earth is none other than the **Dao/Way**. Among the Five Phases, the most refined is none other than Black. Among all living things, the most spiritually animated is none other than Man. Among the cycles of light and darkness, none are clearer than the Sun and Moon. Among flowing vital essences, none surpass the rivers and seas. Among the rise and fall of kings, none are more profound than the Four Seasons. Among the principles of **克伐** (subjugation and restraint), none are more cyclical than the Six Celestial Stems (甲,乙,丙,丁,戊,己).\n\nThese correspondences, each relying on the Great **Dao/Way**, interact in both harmony and opposition, their effects varying with time and alignment. Yet if one applies **yin-yang** without discerning their true correspondences, even clever techniques will be in vain, laboring without reward.\n\nFor Heaven and Earth differ in nature—masculine and feminine, distinct in their operations—and their corresponding interactions bear no fixed reliance.\n\nIn ancient times, the most refined Daoist arts of the Celestial Worthies, sacred texts on prolonging life, were compiled into nine volumes. Within them, the trigrams of **Sanwu** (三五, Three and Five) were exhaustively explored, delving into the subtlest essence of **Dao/Way** and **virtue/power** (德), all applied to the harmonization of Heaven and Earth.\n\nEmerging from the Three Sovereigns (三皇), expounded in the Eight Trigrams (八卦), they first distinguished **Long** (Dragon) and **Hu** (Tiger)—two forces that complement each other, akin in nature to Metals and Stones.\n\nYu cast the Nine Cauldrons (九鼎), and the Earth established the Nine Palaces (九宫), dividing into Nine Regions (九州). The elixir undergoes nine transformations, and man has nine orifices—seven bright, two dark. The head contains nine **Zhen** (真, \"true\" or \"authentic\" essences), while the Big Dipper (北斗) has nine stars, two of which remain unseen. The realm has the Nine-and-Five (九五) hierarchy, and cosmic principles are governed by the Three Elements (三元).\n\nThus, these correspondences align with time and the Great **Dao/Way**, harmonizing in perfect accord.\n\nThose who grasp this principle may master the **San Dan** (三丹, Three Elixirs) method, for the **Dao/Way** lies before them—not in distant pursuit. Beyond the **San Dan**, there is nothing else to speak of.\n\nWhy so? The **San Dan** employs the Great Transformation’s Black essence to solidify, forming the true vital fluids of man in accordance with the Five Phases. From Nine to Nine, the **San Dan**’s ninefold elixir aligns with the **Shangqing** (上清, Supreme Clarity) Canon’s nine volumes, harmonizing with the symbols of the Eight Trigrams.\n\nIn the *Shiluji* (实录记, *Record of Authentic Scriptures*), the **Lingbao** (灵宝, \"Numinous Treasure\") Divine Symbols are ranked first, and the **Xuan Yuan** (玄元, \"Mysterious Origin\") teachings serve as the **sutra**. The **Hunyuan** (混元, \"Primordial Chaos\") White Snow Elixir, the **Jiuzhuan** (九转, \"Nine Circulations\") Eight-Precious Elixir, and the **San Dan** (三丹)—all are transformations of the Eight Trigrams and Nine Palaces, requiring no other external substances. Through cultivation, they become the ultimate **medicine**.\n\nYet if one speaks of lesser elixir methods using **Dan Sha** (丹砂, cinnabar) and miscellaneous arts, there are myriad techniques in the world. Though they may temporarily cure ailments, they lack the power to transcend the mundane.\n\nWhy so? Because their correspondences are confused and misaligned, their use of Black differs, and their **yin** and **yang** do not properly interact. Their methods vary, leading to discord.\n\nFor instance, in the preparation of Metal and Stone elixirs, there are seventy-two types of stone. Their origins lie in the deep, hidden layers of Earth, each possessing distinct **yin-yang** natures and temperaments.\n\nObtained from **Yin Mountains** (阴山), these are the **Yin Stones**—all varieties of **Qing** (青, blue-green). From **Yang Mountains** (阳山), one gathers **Yang Stones**—such as **Liu Huang** (硫黄, sulfur).\n\nIf one seeks to harmonize **Yin Stones** and **Yang Stones**, it is like the husband’s song and the wife’s response. If high and low are not properly aligned, the **medicine** will be flawed, and how can it harmonize?\n\nThus, the *Five Correspondences* is compiled into twenty chapters, passed on to like-minded seekers.\n\nFor example, if **Yin Stones** are taken from **Li Mountain** (离山, the South), and **Yang Stones** are obtained from **Beishan** (北山, the North)—where **Shuiyin** (水银, mercury) is produced—transforming **Shuiyin** into **Zhu Sha** (朱砂, cinnabar), which belongs to **Li** (Fire), what then is its origin?\n\nThough **Beishan** is of **Yin** nature, its **Lü** (green) varieties oppose and subjugate it, so it first forms **Shuiyin**, then **Zhu Sha**.\n\n**Zhu Sha**, receiving the Black essence of **Li Fire**, assumes a false crimson form, yet it never fully discards its **Shuiyin** nature. The **Lingbao** teachings, transmitted by **Biling Yangzi** (被陵阳子), reveal that **Zhu Sha**’s **Jin Ye** (金液, \"golden fluid\") is superficial, its **Zao Bai** (皂白, \"alkaline and sulfuric\") aspects merely divided. Through the method, one strips away its false crimson form, restoring its true essence, naming it **Tuoti Dan Sha** (脱体丹砂, \"Elixir Cinnabar of Detached Form\"), also called **Huangu Dan Sha** (换骨丹砂, \"Elixir Cinnabar of Transformed Bone\"), and also **Baihu Nao** (白虎脑, \"White Tiger’s Brain\"), thus achieving clarity.\n\nIn explaining this **sutra**, the correspondences of Metal and Stone’s **gateways** are aligned, the Five Categories harmonized, and nothing is lost from its original intent.\n\n**First Chapter: Correspondences of Metal and Stone’s Gateways (配合金公相类门)**\n**Five Principles (五条):**\n\n1. **The First Correspondence: Forming Metal’s True Essence (配金成质)**\n   Using **Lead** (铅), which contains **Yin** yet holds **Yang**, while its **Yang** is the **Silver** (银) within **Lead**. When refined into **Shuiyin** (水银, mercury), one extracts **Huang Hua** (黄华, \"yellow flower,\" a term for lead oxide or refined lead essence).\n   **Huang Hua** is the **qi** of **Lead**, **Silver** is the refined essence within **Lead**, and the three substances form the **vital essence** (命). When united as one, they achieve true alchemical substance.\n\n   If a **Daoist adept** (仙士) uses **Lead** to extract **Huang Hua**, the **Lead** lacks **qi**, and extracting the essence leaves **Lead** without its **bone and flesh**. If one substance must contain both **vital essence** and **substantial form**, then removing its **flesh** leaves its **bone** incomplete, removing its **bone** leaves its **flesh** incomplete, and removing its **Huang Hua** leaves it without **qi**—so what use is **Lead** then? If one body lacks its **hun-po** (魂魄, \"soul and spirit\"), how can it be used?\n\n   The transmitted Daoist teachings reveal how to resolve and discern this.\n\n   **Yin Zhengjun** explains: **Lead’s Huang Hua** is the **qi** of **Lead**, refined into a flower, to interact with **Shuiyin**. Though the two **qi** combine in form, they never fully coalesce into substance. After the **medicine** is prepared, they inevitably separate.\n\n   If one doubts this, refining the mixture into a liquid three times will reveal their separation and reunion, regardless of the method’s specifics.\n\n   The ultimate **medicine**, refined a hundred times into a liquid, circulates clearly without loss. Yet it retains its **hun-po**, making it suitable for ingestion and granting eternal life. If the **medicine** is merely prepared and then artificially constrained, its **form and spirit** will not endure—how could it then fortify one’s **vital essence** and **life force**?\n\n   This shows that **Lead** has lost the **qi** of **Huang Hua**, thus proving its incompleteness. The correspondences have reversed, its **sinews and bones** (筋骨) forever severed, and it remains fundamentally distinct.\n\n2. **The Second Correspondence: Extracting Silver from Lead (采铅中银)**\n   Known as **Tiansheng Ya** (天生芽, \"Heavenly Born Bud\").\n\n   Directly refining **Shuiyin** into substance, this substance relies on **Lead** for its formation, discarding **flesh** to take **bone**. Yet **bone** lacks **qi**, rendering it **form and spirit incomplete**.\n\n   The verse states:\n   *\"Do not destroy my Lead—my Vital Essence must remain whole.*\n   *If destroyed, Lead will have no bone, no flesh, no qi—*\n   *the Three Talents (三才) are incomplete—*\n   *what then is the Elixir Field (丹田)?\"*\n\n「Again the verse says:\n*\"Use Lead or not use Lead—*\n*when Lead is used, the Three Talents are whole.*\n*When Lead is used and the Three Talents are whole,*\n*that is the true Elixir Field.*\n\n*Lead must be whole,*\n*then one may recognize its category.*\n\nAll who acknowledge Lead must not harm its true essence—\nLead must not be mixed with external substances.\nIf mixed, its form and spirit lack **qi**—\nuntil the Elixir Field is thus,\nhow could it ever manifest?\n\nSince ancient times, **Daoists** (仙士) have used **Huang Hua** (黄华) and **Lead** (铅) in their purest form;\ntheir methods are extraordinary,\ndifferent from common practices,\nyet aligned without contradiction—\nDao can return to unity.\n\n**The Third Correspondence:** Using **Jin Gong** (金公) without harming it,\nthe **Divine Symbol** (神符) in its pure form becomes **Xuan Yuan** (玄元, \"Mysterious Origin\").\n\n**Xuan Yuan** is the **Heavenly Mirror** (天镜),\nthe Heavenly Mirror is the Three Talents undivided.\n**Huang Hua** (黄华) within Lead is **qi**,\n**Lead’s essence** (铅精) as Silver is bone,\nand **Lead’s substance** (铅质) is flesh—\nwhen the Three Talents are fully employed,\nthe pure essence of **Xuan Yuan** is not lost.\n\nOne day is **water** (水), two days is **fire** (火);\nLead contains the Three Talents whole—\nit can be used to attain the Dao,\nthus its efficacy is never lost.\n\nThe **Divine Symbol** is the head of Heaven and Earth,\nand the **superior elixir** originates from the *Five Symbol Scripture* (《五符经》).\nIts five **Symbols** (符) emerge from the **Spiritual Water Immortal Palace** (灵水仙宫),\nformed by water, used as elixir.\n\n**The Fourth Correspondence:** Refining **Lead** through **nine transformations** (九转),\nLead must remain whole.\n\nIf Lead is whole, the Three Talents are preserved—\nits **Huang Hua** does not lose its place,\nand its **Huang Hua** fully harnesses the **qi** of Lead.\n\nA furnace must have three feet—\nnone may be missing.\nIf **qi** is lacking, the Dao will never be achieved;\nif an elixir lacks spirit and essence, it will not be efficacious.\n\nWhy so?\n\nWithin **Huang Hua**, there are no sinews, bones, or flesh—\nthe Three Talents are thus incomplete.\nEven after half a year,\nif it is tested and found to be fully consumed,\nits **qi** cannot be contained—\nhow could one use what is powerless?\n\nCategories do not follow one another;\npreservation and combination yield success.\nGuest and host must unite,\nbut **Shuiyin** (水银) is contrary—\neach departs on its own.\n\n**The Fifth Correspondence:** The Dao of **Jin Gong** (金公),\npreserving its **great elixir** (大丹),\nwith form and spirit both complete,\nunchanged in its true nature—\nthe treasure of life lies within my true Lead.\n\nIf Lead is not true,\nits **mercury** (汞) will not be intimate;\nthe true is already whole in the Three Talents.\n\nFlesh is Heaven,\nalso the Mother—\nthe Mother within **Qian** (乾, \"Heaven\"),\ncontains the **yang Heaven** (阳天).\nWithin Lead, Silver is the **yin Earth** (阴地),\nEarth nurtures all things.\n**Huang Hua** is **qi**,\n**qi** sustains all things—\nif **Daoists** use it without breaking its **vehicle** (车),\nthen it is true Lead.\n\nThe verse says:\n*\"Do not break my vehicle,*\n*let me return home—*\n*for that is my life.*\n\nThe **vehicle** is another name for Lead;\nif broken, the Three Talents are incomplete—\nuseless for any purpose.\n\nAgain it is said:\n**Huanglong zhi** (黄龙汁, \"Yellow Dragon Essence\"),\nis the **Huang Hua** essence of Lead refined into a liquid.\nCommon folk use this liquid to administer it,\ncalling it **Lead’s Huang Hua**.\n\nIf Lead lacks this liquid,\nhow could it be of use?\n\nThe true Lead spoken of here\nis not of the five metals, earth, or stone variety.\nSeekers of the Dao must carefully examine and clarify its principles.»\n\n**Section Twenty: Alchemical Refining of Mercury (配合水银相类门第二十)**\n\n**First Name: Xuan Water (玄水)**\nXuan Water is the primordial *qi* of water in its embryonic state. After a thousand years, it congeals—neither fully solid nor fully formed—yet not yet a true embryo. Thus it is called Xuan Water, yet it is unfit for use.\n\n**Second Name: Xuan Pearl Flowing Mercury (玄珠流汞)**\nFlowing Mercury is the luminous *qi* of water. After two thousand years, it becomes Xuan Water Pearl, now true mercury, though still unrefined for elixir-making. This is the initial stage of mercury.\n\n**Third Name: Riverbank Old Woman (河上姥女)**\nThis is the three-thousand-year *qi* of water, now fully mercury, tinged with green. It is called *Riverbank Old Woman*—when exposed to fire’s *yang* *qi*, it flees at the slightest flame, yet cannot yet endure fire. Only those who practice the Dao of mercury should use this.\n\n**Fourth Name: Tai Yin (太阴)**\nAfter four thousand years, mercury surpasses the three-thousand-year mark and is called Tai Yin—aged mercury, now fit for use.\n\n**Fifth Name: Chi Emperor Flowing Mercury (赤帝流汞), also named Red Blood General (赤血将·军)**\nThis emerges from the Vermilion Palace’s red waters, infused with *yang* *qi* and redness, forming cinnabar. This is mercury’s alternate name.\nIt accumulates the *qi* of the Primordial Chaos, forming the Yin Mountain.\nYin Mountain is perilous—it yields mercury.\nMercury is the true *qi* of Chaos.\nUltimately, it is the refined *qi* of Tai Yin—unfaltering before fire, neither consumed nor diminished. When harmonized with the Great Transformation, it holds the supreme merit of immortality and transcendence.\n\n**Sixth Name: Xuan Water Golden Elixir (玄水金液), also named Xuan Water Mercury (玄水水银)**\nBorn from water, it congeals into mercury, then achieves the Great Transformation.\nDaoists refine it into the *Xuan Water Dan Lead* form, its upper essence named Golden Elixir—this is the divine talisman, originating from the Water Crystal Palace.\n\n**Seventh Name: Xuanming Dragon Grease (玄明龙膏), also named Drawn Dizziness Cinnabar (抽晕丹砂)**\nXuanming means without *qi* haze. Dragon Grease is another name for white snow.\nAfter suppression by fire, it remains unaltered. When ingested, its effects are beyond measure.\nYet if applied to malignant sores, it acts instantly—thus called Dragon Grease, with great efficacy.\n\n**Eighth Name: Mercury Tiger Alum (水银虎矾)**\nWhen mercury enters alum stones, it forms medicinal compounds, neutralizing all venomous creatures and refining into the five metals—treasured by the world.\nYet if ingested with alum, it becomes unusable.\n\n**Ninth Name: White Tiger Brain, Xuanwu Bone (白虎脑、玄武骨)**\nA collective term, also called White Cinnabar or Heavenly Sprout.\nDirectly processed mercury, which reunites with its essence upon exposure to fire.\nAlso called *Child-Mother Mutual Generation*—never departing its origin. This is the Heavenly Sprout.\n\n**Tenth Name: Sand Compliance (砂顺), also named Metal Stubbornness (金顽), also named Taiyang Flowing Pearl (太阳流珠)**\nThese three names of mercury possess transformative power, becoming worldly treasures—beneficial for ailments and immortality, rivaling Heaven and Earth’s creation. All things submit, forming the Dao.\n\n**Lingyang Ziming (陵阳子明)** is another name for mercury. This immortal sage, through countless kalpas, exhausted its elixir nature, combining Three Yellows, Two Greens, and One White. He gathered life’s essence from the Child-Midnight and Parent-Noon, merging with the Central Palace’s *yin-yang* harmony, penetrating the Yin Mountain to discern mercury’s true nature—thus defining its alternate names.\nIf fit for ingestion, it follows its prescribed methods. Yet without true understanding, even if used in alchemy, it risks flight or failure, lacking transcendental merit.\nAll clever deceits pale compared to recognizing mercury’s true nature—when properly aligned, they merge as one.\nLingyang Ziming examined Yin-Yang Mountains’ mercury, knowing its purity without flaw.\nTrue mercury contains crimson veins like blood—this is the supreme essence of aged Yin Mountain.\nGreen is called *Riverbank Old Woman*; white is called *Xuan Water Flowing Pearl*, also *White Tiger Brain*.\n*White Tiger Brain* is also named *White Cinnabar*.\nDaoists, stripping its *qi* haze, reveal its pristine whiteness—thus *White Cinnabar*, a name for the three-to-four-thousand-year stage.\nToday’s *Chénjǐn cinnabar* is also called *cinnabar*, but if Daoists harmonize *yin-yang* and suppress it with fire, it is called *Suppressed-Fire Mature Cinnabar*—not to be confused with *Cinnabar*.\n*White Tiger Brain* has three names: First, *White Tiger Brain*; Second, *White Golden Elixir*; Third, *White Cinnabar*.\n\nLingyang Ziming easily discerns mercury’s nature—its transformation into gold and immortality. When properly refined, the Great Transformation’s principles are never in vain.\n\n---\n**Section Three of the Copper Green Category (配合曾青相类门第三)**\n\n**First Name: Copper Green Dragon Grease (曾青青龙膏)**\nCopper Green Dragon Grease is mercury’s destiny.\nIf transformed with Copper Green into grease, mercury’s sacred Dao is fulfilled.\nIt is also mercury’s envoy, capable of refining mercury into an elixir.\nCalled *grease* because mercury within achieves elixir form—its elixir is spiritually potent, suitable for ascension.\nWithout Copper Green grease, mercury flees like a dragon before fire—thus Copper Green is mercury’s grease.\n\n**Second Name: Copper Green Phoenix Wing (青龙翘)**\nCopper Green originates from the *mu* wood category—wood contains fire, symbolizing Copper Green’s metallic essence.\nWithout fire in wood, Copper Green’s metal remains obscure—just as humans require *yin-yang* soul and spirit to manifest form.\n\n「This fourth significance illustrates how mercury is contained within the body of cinnabar.\nIts third name is **Copper Green Envoy (青腰使者)**.\nCopper Green resides in water—its name is also **Waterless (亦无二三)**.\nWhen alchemists prepare it, it resembles an elixir of ascension,\nand thus takes its name from the result obtained.\nYet when comparing its efficacy, each takes its own merit,\nand by examining its gains and losses,\none understands that Copper Green easily harmonizes with mercury’s nature.\nThe names **Copper Green Dragon Grease (青龙膏)** and **Copper Green Phoenix Wing (青龙翘)**\narise from mercury—\nmercury, like a dragon, flees at the sight of fire,\nbut Copper Green grease subdues and restrains it,\nearning the title **Dragon-Tiger Elixir (龙虎丹)**.\nWith five parallels now established,\nit is clear that Copper Green possesses the power to **restrain mercury (驻水银)**,\nand also to **restrain the vital essence of life (驻生灵之命)**,\nharmonizing with mercury’s nature as it aligns with Copper Green’s own.\n\nThus, it is known that Copper Green, paired with wood,\nis perfectly matched with mercury,\nand **Child of Clarity (子明)** refines it without error.\n\n**Category: Sulfur and Its Analogues (配合硫黄相类门第四)**\nSixth Name: **Sulfur’s First Name (玫始初之名)**,\nalso called **Sulfur (硫黄)**,\nwhich emerges from the **Yang Stone Mountains (阳石之山)**.\nWhen **Nuwa (女娲)** discovered it and used it to seal the **Pit of Stopped Fat (停脂穴)**,\nthe **Immortal Masters (真人)** deliberated upon it.\nThe **Green Pit (绿穴)** extends hundreds of feet deep,\nand within it flows a stone essence that hardens upon exposure to wind,\nresembling yellow gold in hue—\nthus, it is named **Sulfur (硫黄)**.\nOriginally, it was called **Stone-Stopped Fat (石停脂)**.\nIts second name is **Yellow Flower (黄英)**,\nfor it produces a yellow fluid from the **Yang Stone (阳石)**,\nwhich solidifies into stone—\nhence, the name **Yellow Flower (黄英)**.\nIts third name is **Yellow Candle (黄烛)**,\nalso a form of **Stone-Stopped Fat (石停脂)**,\nwhose nature carries the **essence of the Sun (太阳炁)**,\nflaming when exposed to fire—\nthus, it is named **Yellow Candle (黄烛)**.\nIts fourth name is **Lawful Yellow (法黄)**,\nfor when **Nuwa (女娲)** refined it, she attained the **Dao of Yellow (黄道)**,\nand thus it was named **Lawful Yellow (法黄)**.\nIts fifth name is **Nine Spirits of Pure Yang (九灵黄童)**.\nThe **Nine Spirits (九灵)** refer to the nine names of the Sun,\nand **Pure Yang (黄童)** denotes the nature of a **virgin boy (童子)**—\nfree from **yin**, hence its name.\n\nIts sixth name is **Yellow-White Sand (黄白砂)**.\nAccording to **Immortal Techniques (仙法)**,\nwhen **Stone-Stopped Fat (石停脂)** is subdued,\nand fire is restrained, yielding a yellow-white hue,\nits **Dao** will soon transform the **Five Metals (五金)** into treasures.\nLater, it is said:\n*Sulfur also stands alone as a category,*\n*possessing the method to **save the poor (救贫)**.*\n*With one category alone,*\n*it can transmute the **Five Metals (五金)** into worldly treasures.*\nIf one follows the **Heavenly Dao of the Immortals (天仙之法)**,\nand **restrains mercury to become white gold (住水银成白金)**,\nwhile **transforming Copper Green into the Sun’s essence (反曾青为太阳)****,\nthen it becomes the **elixir of Heaven and Man (天人之仙药)**.\n\nThe names of **Stone-Stopped Fat (停脂穴)** originate with **Nuwa (女娲)**,\nwho revealed its **divine transformation (神化之功)**,\nand passed its new name down through the ages.\nThe most refined essence of Heaven and Earth\ncannot surpass the **Dao (道)**.\nWithin the **Dao**, the subtlest aspect\ncannot surpass **qi (炁)**.\nTo **nurture qi and settle the soul (养炁安魂)**,\nnothing surpasses **mercury and the Sun’s essence (水银太阳)****.\nTo **refine the spirit and preserve the essence (炼魄存神)**,\nnothing surpasses **Sulfur (硫黄)**.\nFor **proclaiming restraint and explaining concealment (宣制解释)**,\nas well as **harboring and nourishing (含藏育养)****,\nnothing exceeds **Yellow Dragon Essence (黄龙汁)**—\nwhich is merely another name for **lead (铅)**.\nFor **tranquility and immobility (安静不动)**,\nnothing surpasses **Copper Green Envoy (青腰使者)**.\nThe **Copper Green Envoy (青腰使者)** possesses its own **divine transformation (神化之功)**,\n**pressing the strong and soothing the weak (压强抚弱)**,\n**harboring the hundred spirits of gold essence (含金液之百灵)***,\n**settling mercury’s true nature (定水银之真性)**,\n**calming the Four Spirits (安四神)***,\n**harmonizing the Five Zang Organs (调五藏)***,\n**aiding the Sea of Qi (助气海)***,\n**capable of both ascension and descent (能升能沉)**.\nIf one **understands its method (解)**, it ascends as **Yellow God (黄神)**;\nif one does not **understand (不解)**, it descends.\nDescending, it leads to death;\nascending, it grants immortality.\nIf one **settles (定)** the **Stone-Stopped Fat (停脂穴)**,\nthen it possesses the power to **nourish humanity (育人)**.\nIf one fails to **settle and subdue Sulfur’s nature (不定伏得硫黄之性)**,\nits toxicity will manifest late—\nit will surely **kill (杀人)**.\nIf an adept **settles and subdues the Three Yellows (雄黄黄芽，并水银之异性)***,\n**uniting them with Copper Green as Yellow God (解使曾青为黄神)***,\nand **binds and refines Copper Green into a yellow hue (胶炼曾青黄色)***,\nthen this is the **hidden name of the Supreme Dao (至道中)**.\nWhen the **great secret of subduing the Three Yellows (伏定三黄之大诀)***\nis mastered,\none can **transmute all things (变化万物)**—\nnothing cannot be transmuted.\nIf the **Three Yellows (三黄)** are subdued by fire,\neach must retain its **original hue (元色)**,\nand all must be **paired in parent-child succession (子母相承)**.\nIf one uses **unrelated substances (别性物)***,\nthey will not **enter the category (入类)**—\none should **ponder and discern (思知见)***,\n**generating treasures from treasures (以宝生宝)**.\nIf one **understands (解)**, it is swift;\nif one does not **understand (不解)**, it is as distant as two strangers facing each other.\nThe **Dao** lies within oneself—\nif one **attains it (得)**, the names will follow;\nif one **seeks and examines its parallels (类考寻知)***,\nand uses **nothing impure (不杂)***,\nthen one is **skilled (善)**.\n\n**Category: Realgar and Its Analogues (配合雄黄相类门第五)**\nEleventh Name: **Realgar (雄黄)**,\nwhich originates from the **Western Metal (西方兑宫)**—\nwhy so?\nRealgar is **Regal (庚)** and **Metal (辛)**,\nthe **offspring of Metal (兑金之苗)***,\nborrowing the **qi of Regal and Metal (庚辛之炁)***\nto coalesce into **Realgar (雄黄)****,\nemerging from **Wudu Mountain (武都山)**.\nThis mountain is most **numinous (灵)**—\nthose without **proper understanding (理)**, cannot obtain it.\nOne must **perform rituals and declarations (祝醮启告)***\nbefore beginning to **extract it (采)**.\nEven then, out of ten thousand who attempt it,\nnone truly **know its use (知其所用)**—\nthis is how its category was revealed.\nLater, in the **Later Han Dynasty (后汉)**, the **Dark Lord (阴君)** sought its location,\ndiscerned its **color and properties (色目)**,\nand through **examination of the arts of the Immortals and Saints (众仙圣之术)***,\ngained clarity.\nMoreover, Realgar has **ten general names (十一般名)***,\neach with its own **application (所用)**.\nThose who practice **Daoist alchemy (药道士)***\nmust **know its roots (根源)**.\nIf one takes **Realgar from Wudu Mountain (武都雄黄)***\nand attempts to **subdue and refine it into an elixir (伏炼丹)***,\none will **fail to understand its true use (不解用药)***,\nnor will one **grasp the Dao’s origins (会道之根源)**.\nEven if one **偶然 achieves a crude elixir (偶成丹)***,\nit will **not be fit for consumption (不堪服食)**.\nSome may **fail entirely (作不成)**,\nand later **blame it on spirits and gods (妄推鬼神所作)***,\nclaiming **rituals were ineffective (祭祀无功)**,\nyet they **err by relying on ancient texts (误凭古文)***,\n**using Realgar indiscriminately (信手称情)***—\nthis is not the **path of true Daoists (知道之流)**.\n\nIts first name is **Crimson Phoenix Sinew (朱雀筋)**.\n**Crimson Phoenix Sinew (朱雀筋)** refers to its **subdued qi forming substance (伏炁成质)***,\nfirst bearing a **crimson hue (朱色)**.\nAfter **five thousand years (五千年)**,\nit transforms into a **yellow color (黄色)**.\nIf one seeks **Crimson Phoenix Sinew (朱雀筋)**,\nthe **fresh yellow (黄新)** is unfit for **major use (大用)***,\nand its **power is weak (力又薄)**.\nThe common folk, seeing this,\n**contend it is fine Realgar (争言云好雄黄)***—\nthis is greatly mistaken.\nIf one **merely combines it with herbal elixirs (合草药小丹方)***,\nit may **serve minor purposes (任意用得)**.\nYet for **great, rational applications (入理大用)***,\nor to **subdue, refine, and transmute (拟制伏变化)***,\nit is **indeed unfit for use (实未堪用)**.\n\n「Its second name is **Gòuchén (勾陈)**—\nthis is **Realgar** after it has shed its crimson hue and gradually turns yellow, hence the name **Gòuchén**.\nIf used as medicine, **eight or nine times out of ten** it fails to achieve full efficacy,\nand it **cannot endure fire-refining**.\n\nIts third name is **Tàiyī (太一)**—\nthe **stone of the first decan**, its **medicinal form now fully yellow**, fit for fire-testing.\n\nIts fourth name is **Ròuhuáng (揉黄)**—\nhere, **Realgar** has fully formed.\nAt the end of a **great kalpa (大劫)**,\nit may be used **freely in any direction** without hesitation.\n\nIts fifth name is **Huángnú (黄奴)**—\n**Huángnú** is the **servant of mercury (水银之使)**,\nearning its name as it **preserves yin-yang qi** when immersed in mercury.\n\nIts sixth name is **Dìnánjīng (帝男精)**—\nanother name for **Huángnú**, akin to **Tàiyin (太阴)**,\nwhere **qi transforms daily** through their union—\nlike a woman receiving a man’s seed.\n\nIts seventh name is **Dānrìhún (丹日魂)**—\nthis is **Realgar in its extreme yang**, the **soul of the sun**,\nearning the title **Tàiyáng (太阳)**.\n\nIts eighth name is **Shíhuáng (石黄)**—\n**Shíhuáng** is the **essence of Realgar**,\nnot only used for **subduing and refining**,\nbut when **worn on the body**, it renders one **impervious to blades and arrows**.\nIf carried **raw and unrefined**, it suffices—\nbut when **further combined into the Three Yellows (三黄)**,\n**subdued by fire and transmuted**, it becomes a **treasure of supreme transformation (大造化之宝)**,\nand a **path to transcendence (出世之门)**—\nthis is no empty claim.\n\nIts ninth name is **Huángjīn (黄金)**—\nthis single substance, **subdued and refined by fire into yellow**,\nwhen **assisted by subtle yellow divine glue (微微黄神胶)**,\ncan **solely transmute the Five Metals into gold**,\nunbound by the **limits of alum (矾石)**.\n\nIts tenth name is **Huángcāng (黄苍)**—\n**Huángcāng** is **aged Realgar**.\nNot only can it be **refined into an elixir**,\nbut even a **touch carried by children** suffering from **demonic possession or illness (邪魅鬼病)** will **instantly cure them**.\n\nIts eleventh name is **Dìnánxuè (帝男血)**—\nhere, **Realgar** appears **cloaked in white**, yet **veined with blood-red light**,\ntranslucent as empty space, **bright as blood**—\nthis is **true Realgar**.\n\nIf **properly combined with qi at the right moment**,\nthe resulting product **harmonizes with the Three Realms (三才)**.\nAfter **three years of purification in the crucible**,\nwhen taken according to **prescribed measures (法度)**,\none may **ascend immediately**.\n\nIt originates from **extreme southern Wǔdū Mountain (极南武都山)**.\n\nOne substance, many names—\neach with its own application.\nThe **laws left by immortals** are **known in full**,\nand those who begin with skill **achieve success**.\n\nThe **Supreme Medicine** has undergone **ten thousand refinements**,\nthus earning its names.\nSome **establish distinct names**,\nbut when **unified in essence (总解)**,\nits **mystical principles (妙理)** are **fathomless**.\nWhen **aligned with the root source (根元)**,\nits use is **without error**,\nand when **harmonized with qi**, it **succeeds**.\n\nIf one **uses medicine indiscriminately without regard to its source**,\nand **names it Dao**—\nthis is **misguided**.\n\nFor **heaven’s essence is extreme yang**,\nwhile **earth’s essence is extreme yin**—\n**moistening downward**, it becomes **rivers and seas**,\n**nourishing earth’s meridians (血脉)**.\n**Heaven has the Milky Way (河)**,\nconnecting with **earth’s circulating qi (通炁)**,\nforming **suspended symbols (悬象)**—\n**heaven above has no water**.\n\nThe **ultimate precision of heaven and earth**\ndoes not exceed **holding fast to the One (守一)**,\nyet it **divides into the Three Realms (三才)**,\nmirroring the **Three Great Elixirs (三大丹)**,\n**inheriting the Five Virtues (五德)** to give birth.\n\nLater practitioners, following these **supreme methods**,\n**seek in myriad ways**,\napplying **heterodox and perverse techniques (邪异施)**—\nusing **substances devoid of qi**,\n**shifting with time**,\nand thus **inviting great calamity**.\n\nHow could the world know?\nThe **ultimate precision** does not exceed **holding fast to the One**,\nwhile **establishing principles** does not exceed the **Three Realms**.\n**Mutual generation** does not depart from the **Five Phases (五行)**,\n**concealment** does not depart from **water and fire**.\nThe **principle of correspondence** originates from **the One**.\n\nWhen **two complementary forces (两情)** are **paired**—\n**capable as husband, capable as wife**—\n**yin at its peak gives rise to yang**,\nand thus **perfect medicine is formed**—\nall such **depend on the Great Yang (太阳)** and **Great Yin (太阴)**.\n\n---\n**Pairing with Lead Essence (铅精) – Twenty-One Names**\n\n**Lead Essence (铅精)**, when used by immortals, has **many names**.\nIf one **knows how to apply it**, one **does not stray from the Way**.\n\n1. **Qiānhuā (铅花)**—\n   the **qi of lead**, capable of **subduing mercury**,\n   though it may **temporarily resist fire**,\n   it ultimately **lacks true completion (了义)**,\n   yet it **dissolves the Three Poisons (三毒)**,\n   **fully transforming into emptiness**.\n\n2. **Qiānjīng (铅精)**—\n   the **silver within lead**,\n   when **combined with mercury medicine**,\n   forms a **kindred substance**—\n   yet **lead’s nature** remains the **great affliction within the elixir**.\n\n3. **Xuánhuáng (玄黄)**—\n   the **essence of lead**,\n   when **united with mercury’s qi**,\n   **preserves the Three Realms**,\n   **unchanging in true nature**,\n   serving as **divine talisman (神符)** and **celestial mirror (天镜)**.\n   When **entered into lead**, it becomes **its sinew and bone**.\n\n4. **Huángyá (黄芽)**—\n   the **yellow bloom of lead**—\n   **yellow bloom** is the **qi of lead**,\n   when **united with mercury**,\n   **retains lead’s form**—\n   this is **Huángyá**.\n\n5. **Fēiqīng (飞轻)**—\n   the **refined essence of lead**,\n   though **extracted and combined with lead**,\n   it is **none other than cinnabar (丹砂)**.\n   When used, one must **know that two kinds share the Great Yang’s qi**—\n   **one must not be lacking**,\n   and they must be **interwoven in application**.\n\n**Heaven’s Canopy (天盖)** resides within lead—\n**Heaven’s Canopy** is the **Pool of Flowers (华池)**,\nand **Pool of Flowers** is the **water foundation**.\n\n6. **Huángjǔ (黄举)**,\n7. **Zǐgēn (紫根)**—\n   these **two names**, when **refined a hundred times**,\n   yield **medicine of absolute purity (绝粒之药)**,\n   whose **effects are immeasurable**.\n\n8. **Huánghuá (黄华)**,\n9. **Héchē (河车)**—\n   these **two names** can **subdue mercury**,\n   circulating **throughout the Microcosmic Orbit (周天)**,\n   **neither distant nor near**, **losing not a single grain**.\n\n10. **Lìzhìshí (立制石)**,\n11. **Qiānjīng (铅精)**,\n12. **Huángqīng (黄轻)**,\n13. **Huánglóng (黄龙)**,\n14. **Fúdān (伏丹)**,\n15. **Huángchí (黄池)**—\n\n**Lìzhìshí (立制石)** is **lead after it sheds its form**, turning **white as stone**,\ncapable of **subduing mercury**,\nbecoming the **supreme medicinal lead essence (至药铅精)**.\nImmortal methods **refine metals and stones**—\nif **poison remains**, it **cannot be ingested**.\n\n**Huángqīng (黄轻)** is another name for **yellow bloom (黄华)**—\nwhen used, it is **as light as bloom (轻华)**,\nyet **capable of heavy application**.\nIt can **transform yellow and white substances into treasure**.\n\n**Huánglóng (黄龙)** and **Fúdān (伏丹)** are alternate names for **lead bloom (铅华)**.»\n\nThe **Huángchí (黄池)** is another name for **refining lead (修铅)**.\n\nThe above are all **various names for lead in alchemical formulas (诸杂丹方回名立字)**.\nAncient Daoists practiced methods of **subduing mercury (制汞)**,\nearning their **yearly titles (当年之号)**,\nyet these were **never recorded in official annals (不上实录)**.\n\n16. **Jīngōng (金公)**,\n17. **Jiǎgōnghuáng (假公黄)**,\n18. **Mùxī (木锡)**,\n19. **Fēixióng (飞雄)**,\n20. **Tàisùjīn (太素金)**,\n21. **Tiānxuán (天玄)**—\n\nAll the above are **extracted from the *Divine Symbols Recorded Alchemical Dao/Way (神符录丹术大道记)***.\n\n**Jīngōng (金公)** is another name for **lead (铅)**.\nMoreover, **native lead of this region (本州土人)** must be used—\n**one must know the proper application and not err**.\n\n**Jiǎgōnghuáng (假公黄)** refers to **lead that has already produced silver and bloom (已出银并华了)**—\nit is said to **lack purity and essence (无精华)**, making it **unfit for use (不堪用)**.\n\n**Mùxī (木锡)** is the **refined essence of lead (铅之精华)**,\ncapable of **entering mercury as supreme medicinal lead (入汞为至药)**,\n**preserving its Dao/Way (不失其道)**.\n\n**Fēixióng (飞雄)** is **lead entering the Great Yang (太阳)**,\nbecoming **pure Yang (纯阳)**,\nand **can be forged into a cauldron (可作鼎)**.\nIt is also **akin to the *qi* of silver (炁银之类)**.\n\nThe names **Mùxī (木锡)** and **Fēixióng (飞雄)**,\nboth **Divine Symbols (神符)**,\nare recorded in the alchemical Dao/Way—\n**one must not lose the essence of lead (不得失铅精)**,\nand **the *qi* and spirit must be harmonized (炁魄合数)**.\n\n**Lead is fundamentally silver in nature (铅本是银质)**,\nwhile **silver is fundamentally lead in spirit (银本是铅胎)**.\n**Yin governs the Great Yang (太阳)**,\nwhile **Yang governs the Great Yin (太阴)**.\n**The Yang within Yin (阴中之阳)** is **lead containing silver essence (铅含银精)**.\n**The Yin within Yang (阳中之阴)** is **cinnabar embracing the *qi* of water-silver (朱砂怀水银之炁)**.\n\nIf **they are paired according to their kind (相配类)**,\nthey are collectively called **the *qi* of embryo and breath (胎息之炁)**,\nyet **they have not yet reached the rank of treasure (未见成宝之位)**.\n\nIf **one can grasp their intended use (解用之意)**, then **moistening (润)** them,\n**they become formless (无象)** when **properly transformed (成之)**.\n\n**The Three Treasures must be complete (三才必备)**,\n**the Four Symbols must remain unharmed (四象不伤)**,\n**preserving the *qi* in its entirety (全炁而行)**,\n**thus aligning with the Great Dao/Way (於其大道)**.\n\nIf **one cleverly misapplies their intent (巧计用意)**,\ntaking **formless substances (无炁之物)**,\nand **pairing them to forge an elixir (相配成丹)**,\n**one will fall into grave error (自大误矣)**.\n\nThe **secret key to the Three Spirits Elixir (三灵丹秘诀)** states:\n**The lead *qi* must be united with the primordial (铅炁合元)**,\n**the process must be fully embodied (事须体全)**,\n**like a man and woman in union (如人交合)**,\n**extracting the *qi* of a maiden (采少女之炁)**,\n**must merge with the original body (须合本体)**.\nThus, **pairing their kinds, Yin and Yang’s dual nature (配类阴阳二性)**,\n**the host and guest’s mutual affinity (主客两情)**,\n**whether they are close or not (亲不亲之)**,\n**whether they are obtained or not (得不得之)**,\n**the Two Principles must correspond in kind (两仪相类)**,\n**and the Dao/Way and virtue must transform cyclically (道德展转)**.\n\nLater disciples **use without understanding (用以不用)**,\n**act arbitrarily (任情而为)**.\nI **dare not proceed without proper intent (终不敢随意而行也)**.\n\nThe **Primeval Lead**, also called *Tàisù Jīn* (太素金), or **Dan Earth Yellow**, is refined from *húfěn* (胡粉) transformed into *qiān bái* (铅白). It is also named *Qīngjīn* (青金), another appellation for *Tàisù Jīn*. Its name aligns with the **Great Yang** (太阳), harmonized and refined through alchemical processes. When drained, it yields a **Celestial Indigo Elixir (青丹天玄)**, also called the **Suppressed Indigo Elixir (伏玄丹)**.\n\nIts preparation involves using *qiān huā* (铅华) as the **Flower Pool**, into which *shuǐyín* (水银) is introduced as the **Double Flower Elixir**. When fused in the crucible and burned into medicine, any residual *qiān jiāng* (铅浆) is of no use.\n\nThe above describes the **refined essence of lead (铅精)**, whose alchemical function is supreme and whose transformations are boundless. Those of shallow understanding grasp only its outward form, unable to seek its true essence. They recklessly adulterate it with foreign substances, corrupting its pure and refined essence.\n\nThose who seek ultimate truth must pursue **true lead (真铅)**, ensuring no impurities are mixed.\n\n---\n**Pairing with White Cinnabar (白丹砂) – Seventh and Sixth Classifications**\n\n1. **Heaven-Born Sprout Cinnabar (天生芽丹砂)**, known as **White Cinnabar (白丹砂)**.\n   The **Suppressed Primordial Spirit-Qi of the Great Yang (伏元神炁太阳)** is called **Natural Qi (自然之炁)**.\n   It contains the **Essence of Fire (含火之精)**, named **Spiritual Cinnabar (灵砂)**. Among all cinnabars, its sprouts grow longest. As recorded in the *Dan Book* (丹书) *Huáng Lù Jì* (黄录记):\n   *\"True cinnabar resembles true pearls; thus, the Immortals named it **True Pearl Cinnabar (真珠砂)**, also called **Heaven-Born Sprout (天生芽)**.\"*\n\n   Directly refining *gōng* (汞/mercury) without additional medicines, this cinnabar, when applied, causes mercury—regardless of quantity—to **suppress fire** upon exposure. It can **transform barren mercury into efficacy**, refining it to a golden hue. It can also **transmute the Five Metals into treasure**.\n\n2. **Immortal Cinnabar (仙砂)**.\n   Immortals require no external medicines for their elixir substance, nor do they use artificial crucibles or tripods. They simply ingest this white cinnabar to achieve longevity. They do not refine mercury into an elixir; thus, Immortals designate it as **White Cinnabar (白丹砂)**—the **Heaven-Born Sprout**.\n\n3. **Vermilion Black Cinnabar (朱乌砂)**.\n   This cinnabar originates from the **Southern Palace of the Fire Deity (离宫南方)**, belonging to Fire. Its name derives from its association with the Southern direction.\n\n4. **Mercury Cinnabar (汞砂)**.\n   Named for its unoxidized, pristine white form resembling sand.\n\n5. **Stone Spleen Cinnabar (石脾砂)**.\n   This cinnabar is found in **stone beds (石床)** or between layered stones, appearing white and resembling stone in color.\n\n6. **Red Emperor’s Salt (赤帝卤咸)**.\n   The Southern direction belongs to the **Red Emperor (赤帝)**. This cinnabar resembles white grains of salt, symbolizing its name. Immortals classify it differently.\n\n---\n**Pairing with Gold (金) – Eighth and Fourth Classifications**\n\n1. **Regal White Gold (庚辛白金)**.\n   Gold is numbered four, hence its four names. Originally formless, it is symbolized by the **Western direction (西方)**, associated with *Gēng* (庚) and *Xīn* (辛).\n   Thus, one understands the **Immortal Dao’s divine transformations**, where *qi* is paired and refined to form substances. It is unclear whether mercury originates from **golden water** or if gold itself is unfit for elixir-making. The Immortals’ symbolic teachings cannot be measured by conventional logic.\n\n   **Regal White Gold (庚辛白金)** is not formed from metallic gold but from **natural *qi*, creating a treasure of great transformation**. It is not artificial gold but the accumulation of ingested gold, refining the body into a **divine, transformed essence**. Thus, the **Great Dao is profound and mysterious**, beyond the grasp of ordinary minds.\n\n2. **Primeval Lead (太素金)**—its name reflects its original essence.\n3. **束方 Day-Sun (束方日阳)**.\n4. **Mao Wood Green-Gold (卯木青金)**—named after the **Three Sovereigns**, with Huangdi later establishing its title.\n   *束方 Day-Sun* is also called **Male Left (男左)**, representing **Mao Wood Green-Gold (卯木青金)**, all crafted by Immortals under distinct names.\n\nThe **Three Sovereigns** paired with the Western direction. Later, the **Great Sage (太上)** traveled to the **Flowing Sands (流沙)**, refining true lead into medicine, all originating from the teachings of *Gēng* and *Xīn*.\n\nThis is the **law of the Primordial Lord (元始君)**, who established symbols for humanity, who otherwise could not naturally form metallic substances. Thus, through ingesting gold, one achieves a **spiritually transformed body**.\n\nLater, in the **Year of the Tortoise Shell (龟甲元年)**, the **Emperor’s succession was disrupted by violent upheaval**, leading to the decline of the age and the Immortals’ withdrawal. The human world temporarily lost the **Primordial Teachings (元教)**, and no divine-transformed gold existed as an ultimate elixir.\n\nIn the **Year of the Tortoise Shell’s Upper Primordial (龟甲上元元年)**, the Immortal **Lóu Jìng (娄敬)** instructed the use of **water sand (水砂)** to extract gold for elixir-making. He excavated **Yīn Mountain (阴山)**, mining silver ore and extracting **white gold**, causing immense labor for the people. Due to the **tyrannical rule of the worldly emperor**, the lack of harmony between ruler and subjects, and the people’s resentment, the **Dao was severed**, and the **teachings of life and death were disrupted**. The people fled to the plains, blaming the **Heavenly Dao**.\n\nAfterward, when Immortals descended into the world, hiding among mortals, they gradually transformed society. **Divine gold (灵金)** emerged, and people came to enjoy medicines, valuing gold and treasures as mere dust. The world achieved great peace, and the people no longer resented the **Heavenly Dao**.\n\n---\nIn the **Highest Antiquity**, when Heaven and Earth first divided, the **Five Phases (金木水火土)** had not yet aligned, nor had deceitful artifices arisen. People lived in simplicity, and the **Sages governed above**, the **Immortal Teachings** faithfully observed.\n\nLater, **Huangdi established the calendar and the Five Phases**—though it is unclear who first systematized them in antiquity. Seeking the **ultimate elixir to save lives**, all claimed the **Three Sovereigns** had created it. At the time, there were no reliable records, and **green inscriptions (绿文字)** had not yet appeared. Later, those who attained the Dao relied on **seclusion from the world**.\n\nThe Immortals left behind **laws and teachings**, naming medicines and recording them in **verifiable annals**. Countless later practitioners refined and attained the Dao.\n\nAccording to ancient records, **Emperor Míng (明帝)** first obtained the **ultimate elixir**, then passed the **Treasure of the Throne** downward. Eventually, it reached **Yu of Xia (夏禹)**. The **people’s desires were too hasty**; Yu did not await the **treasures of the feudal lords**, and though he benefited from the elixir, his reign was too brief to fully harmonize with the lords. Thus, the **Treasure of the Throne** passed to **Qǐ (启)**, and the **Imperial elixir tradition vanished from the world**.\n\nAlthough many subjects attained it, they concealed their knowledge—some dwelling in the marketplace, others in secluded mountains and forests. Those who delighted in the Dao once glimpsed the **Ultimate Treasure**, yet it was not derived from earth, stone, water, or sand.\n\nLater scholars must **know and recognize** it: the **Primordial Golden Transformation**’s essence. **True cinnabar (确砂)**—classified under *Similarity of the Ninth and Fifth*—has several forms:\n\n1. **True cinnabar (确砂)**, whose origin lies in the **Yinshan Mountains**, where accumulated ice congeals into structured water, forming sand.\n2. **Red true cinnabar (赤狙砂)**, bearing a reddish hue—whether aged or fresh, it benefits all things without harm.\n3. **Cannon sand (炮砂)**, which people neither understand nor know its source; it damages substances and harms the body.\n4. **White sea sand (白海砂)**, a saline sand resembling frozen seawater, found in the **glacial north** (绿北庭), resembling white snow, with an earthly taste like brine—thus named. It is **fit for ingestion** and serves as the **Ultimate Elixir**.\n5. **Five Metals’ Thief (五金贼)**, so named because it **corrupts the Five Metals**. If used correctly, the metals remain unharmed; if misused, they are ruined. When applied in moderation, it yields strength—but overuse **destroys the body’s organs**, weakens the Five Metals, and brings swift death. This sand originates from **Poison Mountain**, where accumulated **yin-qi** congeals into its form. If forced, it must be withdrawn after formation; excessive use **guarantees death**, swiftly ravaging the **Five Viscera** and the Five Metals.\n\nThose who grasp its **mysterious principle** and recognize **True Cinnabar** attain the Dao through its use.\n\n---\n**Pairing with Niter (口硝石)**—classified under *Similarity of the Fourteenth*—has four forms:\n\n1. **Niter (硝石)**, the **Autumn Stone**, a **Yin Stone**, born from lands where **accumulated cold congeals frost**. This frost-earth is refined by boiling and distilling until it solidifies like **coagulated water**. Its applications differ: its **green nature** is cold, drawing **Kan-qi (北方坎子)** from the North, accumulating **yin** to subdue **yang’s toxicity**. Ancient Immortals used it to **refine substances**, transmute the Five Metals into treasure, and **forge the Dao through alchemical union**.\n2. **Northern Emperor’s Mysterious Pearl (北帝玄珠)**, sourced from the **Northern qi**, transformed into a pearl of **ice-frost essence**, adjacent to **Cannon Sand** yet differing in application. **True Cinnabar** guides other medicines, while **Niter** subdues them—each possessing distinct natures. **True Cinnabar** is **yang-stone qi**; **Niter** is **yin-stone qi**.\n3. **Aconite (乌头)**, named for the **yellowing autumn leaves** when frost first descends—symbolizing **withered grass**. Its variant,\n4. **Yellow Aconite (黄乌首)**, is harvested when **ulcers face north**, its head **welcoming the frost**. Immortals used it to **counter Giant Yang’s great toxicity**, thus ranking it among **sacred Daoist practices**, opposing **saintly virtue** yet aiding worldly benefit when applied correctly—its **mystery lies here**. It **specifically treats women’s stagnant blood-qi**.\n\n---\n**Pairing with Orpiment (空青)**—classified under *Similarity of the Eleventh*—has three forms:\n\n1. **Orpiment (空青)**, bearing a **feminine hue**, embodying **yin-qi** like the **West’s essence**—the **Regent and Xīn Metals (庚辛金)**, the **White Tiger’s qi**. **Green verdigris (曾青)**, by contrast, aligns with **Jia-Yǐ Wood (甲乙木)**, the **East’s essence**, the **Green Dragon’s qi**. Orpiment mirrors the **West’s Regent-Xīn Metals**, where **Wood-qi overcomes Metal**, yet it retains **Metal’s nature**. Though two names, their uses differ. **Verdigris subdues mercury**, acting as a **yang-messenger (使属阳)**, thus **masculine**. Orpiment’s **weak, hollow nature** earns its name, being **yin—feminine**. It **responds to verdigris’ qi**, enabling alchemical mastery. If **Orpiment is carelessly mixed** with other elixirs, it **fails to harmonize**. Once mercury is **fixed**, the **Three Yellows (三黄)** serve as messengers—but their union **becomes discordant**.\n2. **Midriff’s Maiden (青腰中女)**, named for its **non-mercury qi**, blending with mercury yet lacking **Male Taiyang’s force**, hence its **feminine designation**.\n3. **Green Sand (青砂)**, Orpiment’s **central hollow**, containing a **silver star**—a single grain, **pea-sized and green**, serving as the **Ultimate Elixir**. Ingesting it grants **longevity**. Also called **Mysterious Pearl (玄珠)** or **Mysterious Sand (玄砂)**. Without proper **alchemical pairing**, reckless labor yields nothing. The wise know that **Orpiment’s inner elixir** is **naturally formed**; Immortals who consume it **do not die**. Orpiment’s **silver star** is **yin—feminine**; **Verdigris’ gold star** is **yang—masculine**. It **commands mercury**, capable of **subduing the Three Yellows’ might**—the **secret technique**. The **Orpiment’s inner seed** is **heaven-born**, a **natural divine elixir**.\n\n---\n**Pairing with Sulfur (闷黄芽真性)**—classified under *Similarity of the Twelfth*—has four forms:\n\n1. **Yellow Sprout Lead (黄芽铅)**, which **subdues mercury**, earning its name. The lead must be **unblemished by the Three Talents (三才)** to qualify. When refining mercury, it first **whitens**, then **yellows**, shifting through **Five Colors**, each governing a direction—only then does it **sprout**, fulfilling the **Great Dao’s function**.\n2. **White Cinnabar Sand (白丹砂)**, another name for **Yellow Sprout**. This **White Cinnabar Sand** is the **true embryo of Vermilion Ape (朱乌)**, its **skeletal essence** directly subduing mercury—marking the **initial stage of the Dao**, its power **transcending mortal limits**. It first **whitens**, then **glows yellow**, before manifesting the **Five Directions’ hues**, achieving **harmony (兑)**—the **Regent-Xīn Metals’ medicine**, transforming mercury into its **symbolic form**. The classics state: *\"Extracting lead’s refined qi yields the **heaven-born sprout**.\"*\n3. **Sulfur (硫黄)**, also called **Yellow Sprout**.\n\nThe **Sulfur (硫黄)** used to subdue mercury is indeed temporary—though it may dwell, it ultimately **flee**. If the **Ghost Flame (鬼焰)** is not severed, the **poisonous qi (毒炁)** lingers, and mercury remains afflicted. Even if one briefly **overcomes the fire (伏火)**, it is still **unbearable to ingest (不堪服)**, and only **treatments for illness (疗病)** may suffice. Different substances belong to distinct lineages—none can **prolong the dwelling (延驻)**; they will **harm in the end (终害人)**.\n\nThe verse says:\n*\"Heaven-born sprout (天生芽), White Cinnabar Sand (白丹砂),\nUniting the two **qi (炁)**, as one kin (一家).\nNo deviation in the path (路不错), entering **Divine Transformation (神华)**—\nThe Dao lies here (道在此), this is the **River Vehicle (河车)**.\"*\n\nThe **Fourth Name: Lead-Yellow Flower White Cinnabar Sprout (铅黄华白丹芽)**—within lead, there is silver, hence its extraction by method. Obtaining silver’s **refined qi (精炁)**, it is called **White Cinnabar Sprout (白丹芽)**. **White Cinnabar Sprout (白丹芽)** is the **embryo formed by qi (炁结成胎)**, the essence of silver. Its **silver’s refined qi (银精炁)** subdues mercury as medicine, embodying the **Dao of Immortals (神仙之道)**. If used without harming the **Three Powers (三才)** and preserving its **qi-force (炁力)**, the verse declares:\n*\"Lead-Yellow Sprout (铅黄芽), perfecting the **Three Flowers (三华)**,\nExtract my **qi (炁)**, forming the Sand (结成砂).\nInitially white (初门白), refining fire (运火加),\nCycling the **Five Colors (轮五彩)**, rising like clouds and mists (起云霞).\n**Green Vitriol (曾青)** as the agent—\nThe **Great Dao (大道)** knows no deceit (无邪),\nWith three complete, it is the **family of Immortals (仙家)**.\"*\n\nThe **Sprout (芽)**, born of **Heaven, Earth, and Humanity (天地人三才)**, is fully named as such. The **Sprout (芽)** contains the **qi of Heaven and Earth (天地之炁)**, giving rise to all **ten thousand forms (万类)**. Its root is **unbroken and continuous (绵绵不断)**, hence it is called **Sprout (芽)**.\n\n**White Cinnabar Sand (白丹砂)** is the **precious essence (宝精)** of mercury. When used to subdue mercury, it acts as **lord and minister (如君如臣)**—none can fail to **respond (相禀)**. Mercury, over **four thousand years (四千年)**, transforms into **Cinnabar (朱砂)**, then into **gold (金)**, and finally into **White Tiger (白虎)**, the **stone-fluid (石液)** of ages. Yet even the **Immortal Teachings (仙教)** often vary—when one attains its **form and spirit (形神)**, it too **shifts and changes (变改)**. Before it is named **True Cinnabar Sand (真丹砂)**, the **green mercury (绿水银)** remains unstable in nature.\n\nOnly **White Cinnabar Sand (白朱砂)**, called by Immortals **Primordial Origin Sand (玄元砂)**, endures **ten thousand years (万载)** without alteration. Its **Primordial White nature (元白之性)** differs from mercury’s. The **Sand (砂)** is like a **worldly ruler (世国主)**—though human in form, its **qi (炁)** differs from the common. **Life and death are in its grasp (生杀在手)**, and **transformation is in its mind (变化在心)**. So too with **White Cinnabar Sand (白丹砂)**—only then does one know this **Sand (砂)** is the **Primordial Origin’s beginning (玄元之首)**.\n\nNone but those who **already possess Immortal Dao (宿有仙道者)** can obtain it by extraction. If alchemists wish to **attain the Heaven-born Sprout (天生芽)**, they must seek **Primordial Origin Sand (玄元砂)**—which is precisely the **Heaven-born Sprout (天生芽)** and **White Cinnabar Sand (白丹砂)**. Near the earth it does not grow—it thrives in **distant mountains (远山)**. Mountains hold **Kān-Lǐ caves (坎离之穴)**, yet alchemists cannot penetrate deeply. To extract my **Primordial Origin (玄元)**, one must **fathom the unfathomable depths of the Sand (莫测丹之浅深)**. Only **Jinzhou Cinnabar (锦州朱砂)**, refined into **precious grains (成颗者)**, is taken—by method, its **qi is drawn (抽晕)**, then **restored to its original form (却归旧体)**. **Overcoming the fire (伏火)** without harming the **Dao (道)**, it is also named **Yellow Sprout (黄芽)**.\n\nIt **sequentially subdues mercury (递相承制汞)**—like **minister meeting sovereign (臣见君)**, like **fire encountering kindling (火见薪)**, like **wind meeting clouds (风得云)**—none fails to **be overcome (不伏)**. Yet after **completing the Sand (成丹之后)**, it **cannot be ingested (不堪服食)**. Some may **craft it for worldly gain (制为世利)**, or **偶然 heal ailments (偶以愈疾)**, but it **never fulfills transcendence (终无出世之功)**—this can be **verified (验)**.\n\nAfter **one or two years (一二年)** of ingestion, **men’s yang pathways (阳道)** are **severed (俱绝)**—for **pure yin accumulates (纯阴之所积)**. Fellow seekers of the **Later Teachings (后学同志)**, follow only the **Ancient Teachings (古教)**. If one extracts this **Sand (砂)** and ingests it, **none will fail to attain the Dao (无不成道)**.\n\n**Green and White Cinnabar Sand (绿白丹砂)** is the **medicine of nature (自然之药)**. The method **encompasses the Three Powers (三才)**—using **Heaven and Earth as the furnace (天地为炉)**, the **Four Seasons as fuel (四时为炭)**. **Passing through water and fire (经水过火)**, enduring **kalpas (劫)**, it **refines into substance (成质焉)**. Alchemists must know—**wondrous Dao is not distant (妙道不远)**.\n\nIf one obtains this **Sand (砂)** and ingests it, simply **removing impurities (去却夹石)**, grinding it into **powder (研炼如粉面)**, with **nine steams (蒸)** as the measure. **Grinding it a hundred times (研及百过)**, like **Indian ink (如缅)**, forming **pills with date kernels (枣禳)** or **rotten rice (烂饭)**. The **pills (丸)**, the size of **mung beans (蒙豆)**, are taken **one daily (日服一丸)**—never more. Its **qi (炁)** is as **ingested (如服)**.\n\nAfter **one or two years (一二年)**, one may **attain transcendence (出世之功)**. Before **leisurely observation (闲观)**, it **differs from common folk (与常人不同)**. Its **refined light shines like the sun (精光耀日)**, its **qi (炁)** **naturally luminous (自明达)**.\n\nThe **principles of the Ultimate Dao (至道之理)** lie solely in **containing the essence and returning to the origin (含精返本)**, nourishing the **Divine qi (资神炁)**. Extracting its **true fluid (真液)**, restoring it to the **Primordial Ancestor (元祖)**, filling the **blood and marrow (填其血脑)**, one **naturally grows young again (老而复少)**, **withers and flourishes anew (枯而复荣)**. Thus the classics say:\n*\"Quicklime cast into charcoal fire (胡粉投炭火), its form destroyed, returns as lead (色坏还为铅).\nIce and snow plunged into warm broth (冰雪入温汤), dissolve and become the **Great Mysterious (太玄)**.\"*\n\nMoreover, **quicklime (胡粉)** is **lead burned (铅烧成)**, and **refined again (再炼)**, it **returns to its lead form (却归铅体)**. **Ice and snow (冰雪)** are **water congealed (水结成)**, yet **warmth’s qi (温暖之炁)** restores it to **water’s nature (水质)**. A man **begins young (年少)**, but with **ultimate refinement (至精)** and ingestion, he **reverts to childlike vigor (返其童颜)**, **returning to youthful essence (还归少质)**.\"\n\nThis is the **earnest instruction (殷勤教谕)** of ancient sages to **fellow seekers (同志之士)**. It also **pities this age’s people (哀悯当世之人)**, who **covet life yet lose principle (贪生失理)**, **cut down by sounds and colors (夭枉於声色)**, **withered by tastes and flavors (衰悴於滋味)**—thus their **Primordial qi (元炁)** **gradually decays (渐衰)**, and the **Great Destiny (大期)** **approaches silently (奄至)**. Hence, I **diligently expound (孜孜着论)**, warning those of the **future (将来者)**.\n\nMy **Primordial Origin Great Sage (玄元大圣)** is the **Sand of Martial and Civil Dao (文武神化)**—nothing more than the **true nature of Yellow Sprout (黄芽真性)**—the **Teaching of Primordial Origin (玄元之教)**. Thus, the term **Yellow Sprout (黄芽)** cannot be **sought by will (意求)** or **mastered by method (法则)** alone. **Heavenly Immortal’s secret arts (天仙秘术)** were transmitted by the ancients—**only through oral instructions (口诀)** can one **sequentially learn (递递为师)**. Do not **recklessly reveal (轻泄)** these truths. Without grasping their **marvelous principles (妙理)**, do not **arbitrarily entertain strange thoughts (异端之心)**.\n\n---\n**Chapter Thirteen: Pairing the Sand with Lead—The Doctrine of Their Affinities (配合丹铅魂相类门)**\n**Green Vitriol (曾青)** and **lead (铅)** are the **soul (魂)** of mercury.\nMercury is the **vital breath (魄)** of **Green Vitriol (曾青)**.\n\n**White Cinnabar Sand (白丹砂)** and **Heaven-born Sprout (天生芽)** are the **heavenly soul (天魂)** of mercury—**without mercury’s vital breath (无水银之精魄)**.\n**Sulfur (硫黄)** is the **wronged soul (冤魂)** of mercury—**concealing mercury’s wayward breath (隐水银之横魄)**.\n\n**Realgar (雄黄)**, **Orpiment (雌黄)**, **Arsenic Sulfide (毗黄)**, **Niter (硝石)**, **Calcined Cinnabar (炮砂)**, **Great Yin Mysterious Essence Stone (太阴玄精石)**, **Void Green (空青)**, and **Alum (矾石)**—each **embodies qi to form (各禀炁成形)**—yet **none align with Immortal arts (都与仙术不合)**. Their **souls and breaths do not correspond (魂魄不相类)**, and their **Dao differs (道不同)**.\n\n「If those who **embrace their affinities** (若相禀者),\ntheir **strength** (力) does not surpass **lead** (铅),\ntheir **command** (使) does not surpass **Green Vitriol** (曾青),\ntheir **achievement** (功) does not surpass **water and fire** (水火),\nand their **loss** (失) does not surpass **miscellaneous substances** (杂类).\n\n**Green Vitriol** (曾青者) is the **essence of wood** (木精).\n**Lead and mercury** (铅汞者) are the **affinities of metal** (金相类).\n\n**The Three Souls** (三魂):\n**Green Vitriol** (曾青), **First and Second** (甲乙), is the **first affinity** (第一), the **essence of wood** (木精).\n**Maid’s Daughter** (姥女), **White Cinnabar Sand** (白丹砂), **Third and Fourth** (丙丁), is the **second affinity** (第二), the **mercury of the Vermilion Bird** (朱雀汞).\n**Lead** (铅), **Seventh and Eighth** (庚辛), is the **third affinity** (第三), the **mercury of silver, gold, and Heaven-born Sprout** (铅银金水芽).\n\nThese **three colors** (此三色) each possess **divine transformations** (神化之功),\ncapable of **restraining mercury’s strength** (能制水银之力).\nIf one attains this **mysterious principle** (妙理),\nthen one will not **lose the Dao of Immortality** (失其仙道).\n\n**Next is Sulfur** (其次硫黄),\nalso a **path of the Intermediate Immortal** (中仙之道).\nThose who use it must **align its affinities** (使其相类) as **outer form** (表裹),\nas **ministerial assistant** (臣佐),\nand as **qi and force** (炁力).\nIf attained, one becomes an **Intermediate Immortal** (中仙),\nbut if not understood, one becomes a **deadly adept** (死士).\n\n**Sulfur** (硫黄) has **great toxicity** (大毒).\nOne kind is called **common Sulfur** (凡常硫黄).\n**Our Immortal Sulfur** (我仙家硫黄),\ncan **discriminate** (殊别),\nand when **greatly applied** (大用),\nlike the **ministers of the Three Platforms** (三台之臣),\nit can also **lead to transcendence** (有出世之路),\n**transform the five metals** (化五金之功),\nand possess a **separate method** (独行一门),\n**saving the poor** (救贫之法).\n\nThe **scripture says** (经云):\n*\"Refine it to gold color (炼如金色),\nand it can **transfuse stones into gold** (可以点输石成金),\nwithout falseness (不虚).\"*\n\nWhen **greatly applied** (大用者),\nit **assists in forming the Immortal’s divine elixir** (助成仙人神丹胎),\nand **none can do without it** (无不用之).\nTo use it, one must **avoid ghostly flames** (无鬼焰).\n\n**Green Vitriol** (曾青) shares **its fundamental affinity** (同本类) with **one color** (一色),\nbut **only possesses the divine transformation** (独有神化之功),\n**drawing mercury’s qi** (引水银之炁),\n**flowing and dispersing through the hundred meridians** (流散百脉).\n\nIf **practiced alone** (独行一门),\nit can **transform the five metals into worldly treasures** (化五金为世宝).\nWhen **used in its liquid form** (用化为液),\nthe **five metals** (五金) encounter it,\nand **none fail to change** (无不变改).\n\n**The mercury method** (水银一门):\n**Immortal elixir—White and Vermilion Cinnabar** (仙丹白朱砂宝),\nis **Heaven-born Sprout** (天生芽).\nIt **originates from mercury** (本从水银中生),\nits **spirit unaltered** (精神不变),\nand when it **forms White Cinnabar** (成白朱砂者),\nit is then called **Heaven-born Sprout** (始名天生芽).\nIf one **attains this sprout** (得此芽),\n**mercury will be subdued and transformed** (水银无不伏化).\n\nNow, **Daoists lack Heaven-born Sprout** (今道士无天生芽),\nso why not **borrow qi to form White Cinnabar Sand** (借炁而成白丹砂),\nand thus **align with its grand transformation** (即同其大造化)?\n\n**Ancient Immortals** (上古仙士) established the **Grand Transformation** (立言大造化),\nusing **Heaven and Earth as the furnace** (天地为炉),\nand the **four seasons as fuel** (四时为炭).\nIf one **refines with pure and profound understanding** (纯妙用),\nit also **aligns with the Grand Transformation** (亦同大造化),\nand does not **need to seek distant models** (不在远取其则).\n\nYet, **the Three Ones must be mutually required** (然三一相须),\ntheir **positions differ** (其居不同),\nbut their **purpose is singular** (其致一也).\nIf the **types and applications diverge** (若种类不同),\nand **intentions vary** (用意参差),\nthen **divided into two paths** (分两有异),\nhow can one **understand and extract** (如何解摘)?\nOnly **my divine transformation secret arts** (唯我神化秘术),\n**trust and follow** (信心所从).\n\n**The Doctrine of Their Affinities: Divine Elixir Palace** (配合神丹宫相类门第十四)\n**The Three Souls** (三魂):\n**Mercury’s spirit and vital breath** (水银灵魄),\n**form the three grades of Immortal elixir** (成三品神仙之丹).\n\nFrom **the Three Ones** (从三一起),\n**separating the Dao-principles** (分别道元),\n**one generates two** (一生二),\n**two generates three** (二生三),\nand **three generates the Three Talents** (三生三才).\n**The three elixirs align in affinity** (三丹相类),\n**divine symbols like White Snow** (神符白雪),\n**Nine-turned Golden Cinnabar** (九转金掖),\n**from the ninth to the ninth** (从九至九),\n**its liquid is unbroken** (液之不断),\nand **unbroken is the name of qi** (不断是有炁之名).\n\n**Accumulating qi to perfection** (积炁成功),\nit **becomes the Three Palaces of Upper Clarity** (为上清三宫).\nThe **first is called Purple Cloud Palace** (一名紫霞宫),\nthe **second is called Heavenly Sovereign’s Jade Palace** (二名天皇琼宫),\nand the **third is called Purple Hall** (三名紫宸官).\n\n**Heavenly One Palace** (天一宫) **unites with the Divine Elixir** (合神丹),\nand **its three grades of elixir** (其三品丹),\n**all belong to one method** (都在一门).\n**The three substances within the medicine** (药中三物) **coalesce to form** (共成),\n**entering Heavenly One Palace** (入天一宫).\n**Heavenly One Palace** (天一宫) is another name for **Heavenly Sovereign’s Jade Palace** (天皇琼宫之别名).\n\nIf one **refines the divine symbols for the upper elixir** (修神符上丹),\n**beginning from the Purple Cloud Palace** (从紫霞宫起首),\n**from yellow to purple** (从黄至紫),\n**without losing its original hue** (不夺旧色),\nthen it **cannot be named** (不可载其名).\n\n**Heavenly One Palace** (天一宫) is the **greatest**.\nThe **Three Palaces** (三宫) are the **realms of the Three Purity** (三清之境),\n**from the void and formless Purple Cloud Palace** (从虚无紫霞宫天皇前),\n**all things, great saints, converge** (一切，大圣悉皆归集).\n\nIf **worldly beings attain this true Immortal path** (世人若得此真仙之门),\n**without mixing, they align with the Grand Transformation of Heaven and Earth** (不杂亦同天地大造化).\n\n**The Great Dao** (大道者) is **Heaven and Earth** (天地).\n**Ordinary mercury**, if **attained by Green Vitriol** (凡水银如得曾青),\n**tested by fire and subdued** (以火试伏),\nand placed **within the crucible** (而於鼎中),\nits **spirit transforms into radiant brilliance** (其灵变光芒),\n**fire burns without consuming it** (火烧不烬),\nand it **becomes the Immortal’s elixir** (变成仙丹),\n**responding to the true divine elixir of the Upper Immortal’s Heavenly Palace** (以应上仙天宫真神丹).\n\nIt is called **Emperor of Light** (号明皇元君),\n**transformed from the Jade Morning Lord** (从玉晨君化成),\nand its **name derives from the White Snow** (其名因白雪而成道).\n\nAccording to **the *Scripture of Its Own Conduct*** (按《本行经》中载元始五老),\n**the Five Elders of Primordial Beginning** (元始五老),\nare the **highest revered by the Most High** (太上之尊).\nTheir **elixir** (其丹) **encompasses the wisdom of all Heavenly Palace saints** (上关天宫诸仙圣智),\n**yet remains concealed within the human body** (下在人身中而伏藏).\nIf **known both above and below** (上下知之),\none may **name it the Great Dao** (可名成大道).\n\n**The Doctrine of Their Affinities: Fetal Palace of Male and Female** (配合胎宫雌雄相类门第十五)\n**Within the fetal palace**, **aligning elixirs** (胎中配丹):\n**Sulfur and mercury** (以硫黄、水银) are **affinities** (相类).\n**The Four Spirits** (四神):\n**Realgar, Cinnabar Sand, Void Green** (雄黄、朱砂、空青) are **affinities** (相类),\nand **lead, tin, gold, copper** (铅锡金铜) are **affinities** (相类).\n\n**Miscellaneous elixir medicines** (杂诸丹药),\n**combined with alum** (合以矾石),\nand **herbal medicines** (并草药相类),\n**yellow elixir and niter** (黄丹、硝石) are **affinities** (相类).\n\n**Metal aligns with wood** (金合木),\n**water aligns with fire** (水合火),\n**qi aligns with wind** (炁合风),\n**yin aligns with yang** (阴合阳),\nand **all align in affinities to form grades** (并相类成品),\n**uniting qi with Dao** (以炁合道).\n\n**All miscellaneous elixir formulas and medicines** (凡所置杂丹方药),\n**lack transcendental efficacy** (并无出世之功),\nyet **temporarily possess healing abilities** (暂有治疾之能).\nIf one **mixes this alum with the Immortal’s protective qi** (将此矾石杂类),\nand **mercury is used as the elixir** (染我神仙之卫),\nthen **though it may temporarily reside** (水银为丹者，虽尔暂住),\n**it will ultimately depart** (终久还去).\n\nMoreover, **mercury’s nature is inherently slippery and pure** (且水银性自滑净),\n**untainted by dust or filth** (不染诸尘垢).\n**Daoists** (道士) **should not seek its affinities** (岂不相类求象),\n**to align with the Sacred Dao** (以合圣道).\n\nFor instance, **lead belongs to the North** (假如铅属北方),\nthe **Water position** (子，水位),\nand the **substance of qi** (炁之质).\nAs the **fetal palace containing silver** (为含银胎),\nits **silver fetus is yellow flower** (其银胎为黄花),\nlike **fire contained within wood** (如木中含火),\n**seeking affinities and configuring qi of lead** (禀类相求，而配其炁铅).\n\nThe **white** (白者) is the **metal’s essence** (金精),\nand the **qi** (炁者) is the **water’s foundation** (水基).\n**Mercury internally contains the fire of harmony** (水银内含火熙),\nsymbolizing **fire within wood** (象木中含火).\n**Water restrains fire** (水刑火),\n**as the Wood position (卯) aligns with the Tiger position (寅) for fire** (为卯合寅为火),\ncalled **Double Yang** (曰重阳),\nwith **fire concealed within** (火在其中伏藏).\n\nThus, the **Dao scripture says** (所以道经云):\n*\"Know the white and guard the qi\"* (知白守炁).\n**Qi** (炁者) is the **North position** (北方之位),\nwhere the **lead’s essence resides** (铅精所居),\n**the male** (为雄),\nand **the male is lead containing silver** (雄者为铅中含银).\n\n**Male aligns with female** (雄配雌),\nand **the female is mercury** (雌者水银),\n**whose nature contains yang** (体性含阳).\n**Female and male mutually require** (雌雄相须),\n**yin and yang unite** (阴阳相合),\n**forming the initial medicinal method** (为药初门),\n**transforming into White Cinnabar** (为化成白掖),\n**subduing mercury and causing its death** (伏汞而死).\n\n*The Classic of Changes* says:\n*\"The common people use it daily, yet do not know its Dao.\"*\n\nWater, the first of the Five Phases, alone can generate all things.\nDoes the Daoist not know the art of divine transformation within it?\n\nThe **male**—silver within lead—can transform mercury’s silver into **White Elixir**.\nThe **White Elixir** arises when the **male** and **female** mutually refine each other.\n\nThis is the **Immortal Pill**, the supreme grade of the **Mystic Teachings of the Upper Primordium**, named the **Divine Symbol Pill** in the *Five Symbol Scripture*.\n\nNext, one uses **copper acetate (曾青)**, **malachite (空青)**, **realgar (雄黄)**, **orpiment (雌黄)**, **yellow arsenic sulfide (毗黄)**, **sulfur (硫黄)**, **saltpeter (硝石)**, **calcined sand (炮砂)**, **arsenic trioxide (戎盥)**, and **lead oxide (铅华)**—for **lead oxide** is another name for the refined essence of silver within lead. All these medicines assist in completing the **Dao**; they must be used according to their **resonant affinities**.\n\nThis aligns with the *Changes*’ symbols—never misapplied. When refining at the furnace, if the **Three Powers** are complete, the **Heavenly Dao** succeeds, and nothing fails.\n\nAs for the **Three-Grade Supreme Pill**, it does not use **saltpeter or alum** and their ilk. Yet in the *Harbor Passage Key*, the **Five Metals’ System** belongs to the **Worldly Utility Gate**, where alum must be used to **harmonize affinities**, making them **flow smoothly** and aiding the **Gate’s function**—omission renders it incomplete.\n\nFor **minor pills** treating **lingering fevers**, common folk mistakenly mix alum with mercury to assist in pill formation. They do not grasp **resonant affinities**, recklessly taking their roots. Even if illness temporarily abates, it is because the patient’s **fate** allows it—not the pill’s power. Such methods are **groundless**.\n\nWhy? The **Five Viscera** cannot absorb alum.\n\nFurther, in herbology texts, many prescriptions use **white alum** and similar substances. When fire-refined, they become **raw or cooked essences**, yet their **alum nature** remains unchanged. Just as **dead mercury** does not lose its **mercurial essence**, nor does **cooked rice** lose its **raw rice nature**. Only their **timing** differs—**raw** is **urgent**, **cooked** is **slow**. The **beginning and end of qi’s swiftness and slowness** are fundamentally the same. As a person ages from youth to old age, their **essence** remains unaltered.\n\nOnly our **Three-Grade Divine Pill** harmonizes **qi by affinity**, aligns **qi by category**, never strays from the **Five Phases**, pairs **yin and yang**, omits no **water-fire methods**, mirrors its **colors** without exceeding **束 (restraint)**, forms by **affinity**, and never departs from **south and north**.\n\nIt **receives qi** and **issues commands** in a **cyclical order**, never exceeding the **Eight Trigrams**. It **commands sinews and bones** without overusing **copper acetate**. It **refines yin-yang essences**, yet its transformations never exceed **lead, gold, and White Elixir**. Its **concealment** never surpasses **water and fire**, and its **fulfillment** never exceeds **water’s foundation**.\n\n**Hidden in form**, it is **Divine**—**sulfur** is supreme.\n**Yellow arsenic sulfide**, a singular substance, moves alone as **Heaven’s One**. **Hermaphroditic saltpeter** transforms **white to yellow**, then **yellow to purple**, all **affinitive substances** never straying from the **Divine Pill**.\n\nMisdirected combinations **greatly err in the Dao**.\n\n---\n**Refining the Oral Divine Pill: The Sixteenth Gate of Affinitive Cultivation**\n\n**First Divine Pill: Divine Symbol, Supreme-Grade Pill.**\nIts pill is formed by **harmonizing qi**, becoming the **Great Pill**, named **Heaven’s Mirror**.\nThe **yellow bloom within lead** is silver, contained in lead, called **Yellow Bloom**—its **bloom-pool**.\nThe **bloom-pool** is **water’s foundation**, named **female**, which is **silver**, the **Western Planet’s White Star Constellation**, called **Regents Geng and Xin, the Young Maiden**—the **female**.\n**Lead’s refined essence-qi** is the **precursor bloom**, named **male**—previously called **Yellow Bloom Lead**. This **precursor qi** can refine mercury, hence **lead’s refined qi** is its **central male**, of the **Northern Position**.\nPaired with the **Western Lead’s male**, it forms the **bloom-pool**.\nIt aligns with the **Golden Young Maiden**, becoming the **male-female bloom-pool**.\nMercury, **shedding its form**, becomes **White Elixir**. When the **Elixir’s essence is pure**, it is **one qi**—**water’s foundation**, its position in the **Northern Child Trigram**.\n\n**Second: White Snow.**\n**White Snow** arises from mercury, used for the **Maiden’s function**. **Returning White Snow** aligns by **category**, merges with the **Dao’s original essence**, and all **qi coalesces into one**. It is also called the **Special-Mission Pill**.\n\nWhy does it require **varied flavors** to be supported?\nIts creation is easy, yet attainment is difficult. Why?\nBecause the **first assistant**, **copper acetate**, is **Heaven’s One, Wood’s essence**.\n**Yellow-sprouted lead essence**, **White Elixir’s gold essence**, and **Autumn Stone**—all **enter yin from yang**, drawing **Heaven and Earth’s qi**, passing through the **Dao’s true essence**. Once forged, it is **permanent**; no second effort is needed.\n\nIt is also called the **Gold-Sand Pill**. With **sun and moon’s successive addition**, **sulfur** is the **sprout**, **green waist** (arsenic trioxide) the **messenger**. When blended into **Gold-Sand**, a **surrounding mist** forms—named **Emerging Clouds and Mist**.\nObtained by **affinity**, it is taken without death.\n\nThe **Three Pills** align by **category**, each drawing its **qi**.\n**Divine Symbol** responds to **spring and summer**,\n**White Snow** to the **three autumns**,\n**Nine Circulations** to the **three winters**.\nSpring and summer belong to **yang—the male**.\n**Lead’s yellow sprout** is the **Divine Symbol**.\nAutumn and winter belong to **yin—the female**.\n**Cinnabar and mercury** are the **Maiden’s White Snow**; **White Snow** is **yang’s cinnabar**.\n**Nine Circulations** respond to the **three winters**—why?\n**Divine Symbol** responds to **spring and summer**, when **heaven’s clarity** issues commands, **stirring all phenomena** to life, **responding to movement** and receiving **mandate**, aligning with the **four seasons** and the **eight nodes**. This is also the **Supreme Immortal’s Pill**, named **Divine Symbol**.\n\nNext is **White Snow**, the **beginning of the three autumns**, relying on **chilling dew** to form **frost**, accumulating **yin-qi** into **snow**. It **checks and halts** (the heat), reducing all grasses to **ashes and dust**, while **movement retreats** into **earth-qi**. It is called the **Pill of Boundless Divine Transformation**, taken without death, its **creation** leaving **no trace**, beyond measure.\n\n**Third: Nine Circulations.**\nThe **Nine-Circulation Divine Symbol** is also called the **Gold-Liquid Pill**, aligning with the **ninefold ninefold count**.\n\n「**First: Nine Circulations.**\nThe **Nine-Circulation Divine Symbol** is also called the **Gold-Liquid Pill**, aligning with the **ninefold ninefold count**.\n\n**Nine Circulations (of the Gold-Liquid Pill):**\nThe **Nine-Circulation** employs **sulfur** (硫黄), which is **Taiyang** (太阳). Using **yang** to generate **yin**, it is named **Pure Gan** (纯乾). **Pure Gan** forms the **Great Daoist Transformation Qi** (大造化炁), known as the **Nine-Circulation Pill**.\n\nThe **Nine-Circulation Pill** harmonizes the **Five Phases** (五行) and **Three Talents** (三才), obtaining this **Pill’s Daoist Symbol** to bind **Wood** (木), the **Wood Sovereign** (木王) now standing **Pure Gan**.\n\nIn the **midst of the twelfth month**, at the **true beginning of the first month’s node** (正月节), the **thawing spring** (解冻之春) marks the **Divine Symbol** as the **highest achievement**, the **Nine-Circulation Pill** as the **secondary achievement**, and **White Snow** as the **martial achievement**. The **Divine Symbol** is the **civil achievement**. Among the **Heaven-Earth Pill** (经天地), **spring** (春) is supreme, and the **Divine Symbol** has the greatest efficacy.\n\nAll **immortal’s protective arts** (神仙之卫) do not exceed these **three pills**. The **three pills** were created by the **Three Sovereigns** (三皇). Their pill-making methods are diverse, with myriad techniques, but those that fail to align in **rank and kind** (品类相配) are not recorded in the **Immortal’s Registry** (仙录).\n\nThe **Nine-Circulation Pill’s emissary** (使者) uses **Yellow God Glue** (黄神胶), the **White Snow Pill’s emissary** uses **Tianyi Sulfur** (天一黄芽), both being classified under **Yellow God Glue** (同黄神胶为一房). The **Divine Symbol Pill’s emissary** uses **lead with sulfur** (铅黄芽). These **three grades of supreme pills** (三品上丹) are distinct in their preparation; the **day of pill-making must not be mistaken**, lest the **immortal’s teachings** (仙教) diverge in kind.\n\n**Failure to follow this kindred principle** (不涉入) is a **great error**. The **Seventeenth Gate of Aligning with Saltpeter and Sulfur** (配合传熙相类门第十七) involves **saltpeter** (硝石), **calcined realgar** (炮砂), **realgar** (雄黄), and **orpiment** (雌黄). These **four substances** are kindred in their **qi**, akin to general **subjugation techniques** (造伏), and can **refine mercury** (制水银) into **pill’s efficacy** (成丹之化). Their methods of **sensing qi** (感炁) are recorded in the **Key Gates** (要门).\n\nTheir **functions are distinct**, as **Heaven’s inherent categorization** (天生类别) dictates. For instance, **realgar** (雄黄) is kindred to **mercury** (水银) in forming **golden qi** (成金之炁), nurturing **gold’s essence** (辅金之苗), and producing **gold’s hue** (成金之色). When **cupric acetate** (曾青) is used as an **emissary** (使), it belongs to the **realgar kind**, forming **qi** in the same manner.\n\n**Orpiment** (雌黄) is **yin**, assisting **void green** (空青). When **void green** is used as an **emissary**, it is also akin to **mercury**. **Saltpeter** (硝石) is the **minister** (臣), aiding **realgar, orpiment, and mercury** like **shutting and sealing doors and windows** (关闭门牖) to prevent loss.\n\nThey are akin to **one family’s members** (一家之人) or **one kingdom’s sovereign and ministers** (一国之君臣), without **barbarian or杂州** (四夷诸杂) interlopers, to **break the Three Talents** (破三才). In **all pill-making and protective arts of yellow and white** (黄白卫), one must not exceed these **four kindred substances** (四般为类).\n\n**Calcined realgar** (炮砂) and the **Five Metals** (五金) must also **borrow qi** (借炁) for use. Their **dosage** must be known. If not aligned in kind, the **endeavor fails** (事不成). All **ten thousand things** (万物) follow this principle; it is not limited to **elixirs**. The **Gate of Refining** (修炼之门) succeeds when kindred substances are aligned.\n\n**Beyond these four ingredients**, there are **others that intrude**, leading to **many contradictions** (非端多端). These are **not to be revealed** (未可闻命).\n\n**The Eighteenth Gate of Aligning with Persian Lead** (配合波斯铅精相类门第十八):\n**Persian lead** (波斯铅) does not harm the **Three Talents** (三才), becoming the **Five Pill’s Heavenly Mirror** (五符天镜), forming **my great pill** (我大丹), and serving as **Yellow Ke** (黄芽), the **highest law of the heavens** (毕天之上法). **Persian lead** is the **White Tiger** (白虎) **regal metal** (庚辛金铅), named **Western Country’s Yellow Ke** (西国黄芽).\n\n**Lead from Jiayou** (嘉州铅) refined with **mercury** in **fierce fire** (猛火) until it turns **golden** is called **Yellow Ke**, bearing the **two characters: \"Break the Three Talents, Divide the Gold\"** (破三才分金公二字). It is also named **\"Corrupt Nature\"** (坏性), though it forms **Yellow Ke**, it is the **secondary law of the heavens** (日中天之次法), lacking the **Three Talents**.\n\n**Persian lead** refined with **mercury** in **fierce fire** until it turns **golden** must be **a hundred refineries** (百炼) to achieve the **golden hue**, then it can be used for **transmutation** (点化).\n\n**Adopted yellow flowers** (黄华) are used as **ke** (芽). **Transfuse and inject** (点输) into **stone** (石) and **realgar, orpiment, void green** (雄雌黄、空青), forming **Yellow Gold** (黄金) as the **treasure of the world** (世宝), also named **\"Heaven’s Ultimate Law\"** (毕天之法).\n\n**Jiayou lead** (嘉州铅) and **sulfur** (硫黄), refined with **mercury** into **powder**, are used to **refine mercury** into the **Taiyi Pill of Contained Transformation** (太一含化丹), also named **\"Central Heaven’s Law\"** (中天之法).\n\n**Jiayou lead** (嘉州铅) mixed with **sulfur** (硫黄) is **slightly consumed** (微微同销) into a **liquid**, using **greatest efficacy** (大功力). **Boiled in water** (水煮) for **a hundred days** (一百日), the **refining vessel** (盛器) yields **mercury** (成水银), which is also used as a **pill** (成丹用). The **Jiayou lead** is called **Hua Chi** (华池), refining **all mercury** into **substance** (成质), known as **True Lead, Golden Sovereign, Hua Chi Water** (真铅金公华池水).\n\n**Persian lead** (波斯铅) mixed with **mercury** (水银), refined in **fierce fire** (猛火), yields **six liang of yellow flowers** (六两黄华). When **mercury is refined** (熟丹砂), it is the **yang elixir, Wood Essence** (阳药木精). **Stored in a cabinet** (柜中) for **a hundred days** (养一百日), **refined and purified** (修炼擎出), the **pills** are formed like **Firmiana seeds** (梧桐子大), to be taken **one grain daily on an empty stomach** (每日空心服一粒). Following the **regulations**, it **enhances the mind and spirit** (益心神), **sharpens vision** (明目), and **revives qi, beard, and hair** (炁髭发).\n\nIf **not taken for two hundred days** (不经二百日), **gray hair rejuvenates** (再炁), which is the **minor efficacy’s law** (小功之法). One knows that the **Dao of Immortals** (神仙之道) is **not false**.\n\n**Jiayou lead** (嘉州铅) and **杂州 soil** (杂州土), refined into **powder** (为粉), **burned** to form **Yellow Pill** (成黄丹), also known as **Mieduo Seng** (蜜陀僧) or **Hufa** (胡粉). These are used to **make cabinets** (作柜子) for **subjugating elixirs** (伏丹药), serving as **gates for beneficial use** (堪为利用之门).\n\n**Jiayou lead** (嘉州铅) can form **elixir silver** (炁银), **copperware** (铜器), and **extract copper’s bloom** (抽铜晕) to make **silver**. **Persian lead** (波斯铅) is **not used**; if **mercury is refined alone** (空炼) for **one subjugation cycle** (一伏时), **yellow flowers** (黄华) are taken to **refine mercury** (制水银), ensuring **no loss** (无不伏者).\n\n**Refined alone for one cycle**, taking **yellow flowers** to **refine mercury** into **cinnabar powder** (成砂子). If it **endures fire in subjugation** (入火伏得住), it is also named **\"Central Pill\"** (中丹). For **great elixirs** (大药), **all leads are not used**.\n\n**Song (Chant):**\n*\"Great elixir does not use lead,\nUse lead and it must align in kind.\nAlign in kind and the Three Talents are complete,\nFail to align and things are ruined and shattered.\nYellow flowers all depend on lead,\nLead has transformations and changes.\nHeaven and Earth are inherently complete,\nEfficacy achieved and lead must withdraw.\nUltimate elixirs have no second or third,\nLead’s alignment brings them to completion.\nCompletion stems from the mind’s intent,\nIntent requires lead and yellow flowers present.\nAltering methods follow lead’s nature,\nWithout the Dao, success cannot be assured.\nAssured is the Heavenly Mirror’s efficacy.\nLead-Yellow Pill,\nThe world also calls it Yellow Ke Lead.\nHufa,\nThe world also calls it Yellow Ke Lead.\nFor subjugating fire to make vessels,\nTo receive mercury,\nIt is also named White Gold, Yellow Ke.\n**Jiayou lead**—one hundred catties (斤),\nRefined into **two liang** (一两), **white as snow**.\nAdd **one liang of sulfur** (硫黄),\nUse **one liang of mercury** (水银) refined by **water-flying** (水飞),\n**Yuyu Grain** (禹余粮) and **Kong Gong Nuisance** (孔公孽) each **one liang**.\nFirst, **consumed into liquid** (销成汁).\"*\n\nThen add the mercury, followed by the sulfur, then Kong Gong Nuisance and Yuyu Grain, stirring with the leftover bamboo branch tips.\n\nWait until they harmonize and emerge, then place them in a glazed stone basin and finely grind into a segment of purple powder.\n\nNext, place it in a crucible, seal tightly, and refine with controlled fire for a hundred days, using no more than one *jin* of fuel.\n\nAfter refining, remove and grind finely into powder, store in a silk pouch, and suspend it in an underground pit for three days before taking out.\n\nPlace it in a glazed stone container with rice, steam twice, then mix with human breast milk to form pills the size of *wu tong* seeds. Take one pill on an empty stomach.\n\nBegin with wine as the carrier, increasing to ten pills, then cease, thereafter using saliva alone.\n\nAfter a hundred days of ingestion, it will enhance complexion, thicken beard and hair, and even allow for fasting—this is a secondary Daoist remedy, though it does not lead to transcendence.\n\nWhy?\n\nThis green substance, though not of the formless kind, still contains within lead an unimaginable, boundless power, rivaling the Dao of immortality.\n\nIf one seeks to fast and nourish the body, or treat wind-related ailments, this alone suffices—no greater alchemical achievement is needed for worldly transcendence.\n\nThe **Persian Lead Flower Pool** can merge with verdigris, transforming the five metals into treasures of the age, acting as a singular agent.\n\nThe methods used are recorded in the *Secret Keys*.\n\nBut lead, when its Flower Pool is attained, can refine the five metals, subdue fire—if mastered, it harmonizes with *qi*, and when the proportions of the elixir are precise, it fulfills the grand transformations of Heaven and Earth.\n\nDaoists must pay close attention, carefully studying these lead techniques, which encompass sixteen methods, aligning with the Dao of Heaven and Earth. Those who master them become immortals.\n\nMoreover, worldly wealth and even the ability to alter one’s appearance into that of a maiden emerge from this lead. Its power grants longevity and eternal youth, encompassing all the gates of Heaven and Earth—all derived from this.\n\nBut with the true method obtained, nothing remains uncertain.\n\nNow, I briefly record these instructions.\n\n**Chapter Nineteen: The Method of Lateral Qi Communication—The Gate of Resemblance**\n\nThe method of lateral *qi* communication relies on subduing the Three Yellows and the Eight Stones. One must not alter their original essence, allowing each to subdue fire.\n\nWhen subduing fire, one must not let it consume or scorch—all this is due to the lateral use of *qi*, guiding *qi* back to its true nature, so that its fundamental essence remains unchanged. This is called the \"subdued fire of the Three Yellows.\"\n\nThe methods for subduing these medicines are like the eclipse of the sun and moon: though temporarily obscured, they ultimately return to clarity, reverting to their original essence.\n\nThe methods for subduing the Three Yellows also require the power of saltpeter. Saltpeter is named Autumn Stone.\n\nWhy is it called Autumn Stone? Daoist practitioners of flying elixir must know its origin. The Autumn Stone—these Three Yellows—belong to the *qi* of Spring’s Grand Solar Yang, which is killed in Autumn; thus, saltpeter can subdue yang medicines. If one subdues the Three Yellows without using saltpeter, the yang toxicity will never dissipate.\n\nThe Three Yellows and Eight Stones all belong to fire, being pure yang *qi*. Their generation is akin to that of mercury, but mercury, when subdued by fire, becomes dry silver, retaining its original form. The Three Yellows and Eight Stones are all born of yang *qi*—how could one know their transformations?\n\nBut if one subdues the Two Yellows and Eight Stones without altering their original essence, their efficacy is boundless—this is entirely due to the power of Autumn Stone.\n\nThus, Autumn Stone is the sovereign of yang medicines. When using medicines, mastering their profound principles is like a sage ruler obtaining virtuous ministers. Autumn Stone is that minister.\n\nThe method for subduing saltpeter begins with obtaining white cinnabar stone, refining it with fire and water into powder, then using it to subdue Autumn Stone. Autumn Stone originally forms in cold, sunlit places, accumulating frost and ice to become white cinnabar—a product of ancient, congealed ice-earth, forming a white stone bed. From this bed, cinnabar emerges. Saltpeter, being of similar *qi*, is used in lateral communication to subdue mercury and cinnabar, preventing their essences from dispersing.\n\nThus, Autumn Stone is of the same primordial category. When subduing the Three Yellows and Eight Stones with it, the utmost yin can restrain and subdue them without altering their true form—this is due to the innate natures of these two medicines.\n\nNext, sulfur is paired with Autumn Stone. Sulfur originally derives from saltpeter, inherently bearing a white hue. Though sulfur itself has not been subdued by fire, when paired with saltpeter and used in lateral *qi* communication, it strengthens the power of Autumn Stone and saltpeter.\n\n---\n**Chapter Twenty: The Gate of Resemblance—Pairing Methods**\n\nTake Persian lead, which originates from the west’s *gēng-xīn* metals (iron and mercury). Lead contains gold, with its floral essence resembling the west’s *gēng-xīn* metals, while its substance resembles the north’s *rén-guǐ* water. Thus, ancient immortals recognized the floral essence of lead as the Yellow Sprout.\n\nYet those who extract only from lead’s exterior resemble *qi* of the same category in use—within one substance, gold and water are generated together. This is called \"resemblance,\" referring to form and essence.\n\nThe *Yin Lord* and *Bóhé Master* explain: The *Primordial Teachings* of the Celestial Worthy originated from the Flowing Sands, where it was named \"paired lead.\" Han Dynasty lead, though having floral essence, lacks purity, differing from the Flowing Sands lead of the Western lands. The Most High thus ordained the Flowing Sands lead as the true lead.\n\nObtaining Flowing Sands lead yields the Three Grades of Dan Gold, the first true lead of the immortals. The *Primordial Teachings* of the Mysterious Embryo are named Flowing Sands lead—this is Persian lead.\n\nIts paired lead within is like a person possessing talent and skill—both are inherent, not outwardly displayed. Thus, according to the *Lingbao Five Talismans*, \"The adept who does not return to the elixir embraces its pure flow; if the child obtains it, the True Person may be sought.\"\n\nIf lead is used without harming the Three Realms, it becomes the supreme medicine of Heaven. If it harms the Three Realms, its floral essence must be extracted. If its floral essence is extracted, the lead loses its *qi* and power. Though still taken from lead, it will never be true—unworthy to serve as minister or assistant.\n\nWhy is lead’s power incomplete? Because its original *qi* is lacking, and its true nature is impaired.\n\nIf the Three Realms remain whole, this is the supreme method of Heaven. If its floral essence is extracted, this is the secondary method of the Middle Realm. If used as an auxiliary, this is the inferior method of the Middle Realm. These three methods all stem from the sixteen gates of lead.\n\nIf one seeks to use them, one must clearly understand the Great Dao’s Primordial Teachings—without error—thus achieving the Three Dan methods, corresponding to the Three One Palaces. The Three Palaces are the Three Purities: Supreme Purity, Upper Purity, and Jade Purity, unified as the One Primordial Palace of Heaven.\n\nThe Three Dans must encompass the true natures of the Three Realms: lead, mercury, and sulfur. Malachite serves as a unique envoy, embodying the true nature of the Eastern lands. The East is the first of the four seasons, generating all things—nothing is untouched by its influence. Thus, malachite is the envoy of lead, the sinews and bones of mercury.\n\nLike wood containing fire, it can make lead, mercury, and sulfur into the Yellow Divine Glue, providing the *qi* and power of ministers and assistants.\n\nIf one refines the elixir without understanding the principles of the Three Realms, recklessly using the Five Metals and Eight Stones, even if one achieves lead elixir, consuming five grains will turn one’s beard and hair white in ten days, making one’s face like a maiden’s. Though this may seem miraculous, it lacks the function of transcending the world and prolonging life—exhaustion leads to death.\n\nBut if the Three Realms are complete, and the elixir is refined with proper resemblance, consuming it will make one’s body eternal, with lifespan equal to Heaven and Earth.\n\nThus, since the division of Heaven and Earth, only the Green Waist Envoy was known. Later generations did not understand the Primordial Teachings’ transformations, nor how to extract the *qi* of the four seasons, nor how to draw upon spring, summer, autumn, and winter to form the Yellow Sprout. Unable to transcend the world, they lack even minor alchemical gates.\n\nNor do they understand how to borrow the Five Phases and Four *qi*, using furnace fire to transmute lead-*qi* into the Yellow Sprout’s pool.\n\nFor lead is the bone of the Yellow Sprout, lead powder its ministers, lead water its pool, and lead’s essence the vessel of the Five Metals. Lead’s function harmonizes with the Five Phases, entering sixteen applications—each distinct, yet within distinction lies the supreme treasure.\n\nLead belongs to the Right General, also called the feminine nature, or *yin*. It governs *yin* subduing *yang*—*yang* belongs to the Left, the masculine, which also generates the Three Yellows and Eight Stones. Yet its nature ultimately succumbs to *yin*’s subjugation, mirroring how a man’s essence spills into a woman’s womb—unaltered.\n\nThus, it is clear that *yang* dies under *yin*.\n\nHence, the world values preserving essence and safeguarding life—here lies the principle of medicine.\n\nYet the Three Yellows’ nature must be subjected to *yin*’s killing force, only then does it remain subdued and not dissipate, nor lose its original hue. Why? Because *yang* is ensconced within *yin*.\n\nThe world does not perceive *yin*-essence within the sun, as a man’s bond with his wife—constant in their union. This is *yang* being consumed by *yin*; when *yang* is established, it is met by *yin*’s subjugation.\n\nThe moon contains *yang*-essence, like a woman receiving her husband’s favor—devouring *yang*-*qi*, yet never parting. This is *yin* and *yang* responding, male and female merging in affectionate harmony, thus forming the Great Dao.\n\nThe sun is like a man—externally *yang*, internally *yin*.\nThe moon is like a woman—externally *yin*, internally *yang*.\nThe two *qi* interact.\n\nEvery thirty days they unite, each drawing the other’s refined essence to nurture all things.\n\nThe *Yijing* says: *\"The meaning of *yin* and *yang* corresponds to the sun and moon.\"*\nIt also says: *\"One *yin*, one *yang*—this is called the Dao.\"*\nAnd: *\"Suspended symbols, none greater than the sun and moon.\"*\nAll great elixirs are thus called sun and moon.\n\nThe elixir hymn states:\n*\"The Sage seizes the intent of Creation,\nWith hands clutching sun and moon within the furnace.\nSubtly stirring the essence of Heaven and Earth,\nPiercing *yin* and *yang* to move spirits and ghosts.\nWho recognizes the sun’s soul and moon’s shadow?\nThose who know are the Daoist immortals.\nRefining and ingesting for a thousand days,\nThe body then lacks *yin*—how could death come?\"*\n\nThus, the Three Yellows can be made into medicine only when subjected to *yin*’s killing force.\n\nAs when a woman bears a child for ten months—is it not nurtured within the *yin* womb to form its body?\n*Yang* cannot generate without *yin*; *yin* cannot bear without *yang*.\nThe sun cannot shine without the moon; the moon cannot illuminate without the sun—this is the natural order.\n\nWhen *yang* is exhausted and dies under *yin*, it is influenced by the Upper General’s power on the Right—the Upper, the Right. It governs subjugation.\n\nMen’s pulses flow leftward; women’s turn right—thus, though mercury contains *yang*-*qi*, it is not yet free from the *Taiyin* body.\nLead, though in the *Renzi* position, does not lack the essence of Golden Flower. Metal and water share affinities, and with fire, they manifest.\n\nMercury is the essence of *Taiyin*, containing cinnabar within. Cinnabar originally transforms from the *yin* palace yet resides in the *Li* position, sharing lineage with lead, born in the Golden Flower pool—essentially one.\n\nThe *Huagai* symbolizes Heaven’s canopy over all things. Though dense clouds may not rain, *yin*-*qi* forms mist and dew, nourishing all things.\nLead’s *Huagai* nurtures and covers.\n\nThe White Tiger is the Golden Flower’s *yang*—its *qi* aligns.\nAll dragons are the souls of clouds; clouds are the canopy of rain.\nRainwater mirrors lead water, a dam against metal.\nThe tiger is the soul of wind; wind is rain’s messenger—each holds its primal essence.\nThis *qi*’s law mirrors the cosmos: imprisonment, death, decay, rebirth, and kingship lie within.\nAll things’ generation is governed by this.\n\nThus, ancient Daoist masters preserved the primordial scene of Great Creation, refining the Three Elixirs, exhausting a hundred liquids, achieving ultimate truth from the Three Primordials. Their transformations are recorded in Heaven and Earth, verified through analogy and evidence, gathering ancient Daoist texts to perceive the mysteries of immortality. They unified the Primordial Teachings, encompassing Confucian and Buddhist doctrines alike.\n\nThe Four Symbols establish Heaven; the Eight Trigrams found Earth. The Three Elixirs’ true principles interdependently reside within the Twenty Chapters.\n\nTransmitted and practiced with precision, their essence flows without error—eternal principles, unchanging for ten thousand years.\n\nFor those refining the supreme medicine, ancient taboos must be observed. To repel ghosts, demons, and malevolent spirits, one must use analogous materials to forge potent tools, always kept beside the furnace. Shift their placement daily—these are the *Da Yao Bao Jin* instruments. Their use requires *gui ping* iron, forged white as a blade, one *chi* two *cun* long, or as short as five *cun*. If such iron is unavailable, pure steel suffices.\n\nNext is the copper blade, which must bear the *yin-yang* symbols of dragon and tiger to be efficacious. It must never have been used before—for once employed, it cannot endure near the furnace.\n\nAll tools that govern *qi* must be forged from *yin-yang* materials. Other tools are ineffective.\n\nMoreover, mercury and lead inherently embody *yin-yang* natures, merging to form their *qi*. Borrowing the essence of dragon and tiger, they guard each other—dragon and tiger are the substance of the Great Dao. Thus, malevolent spirits and ghosts dare not approach the furnace or cauldron.\n\nThis blade, when not in use, should rest beside the head, taken out once a year for purification with fragrant water, then polished and venerated. When refining elixirs, it patrols the furnace, driving away all evil spirits and instilling fear.\n\nYet it is known that the Great Dao uses tools to govern *qi*. Since the Primordial True Ones’ Three Elixirs are forged from metallic *qi*, the return elixir requires a metal tool to aid its completion.\n\nThe substances of like nature combine to form yin and yang—lead and mercury, the two names, both obtaining the essence of dragon and tiger. The Water and Fire phases never part; in all like substances, nothing fails to coalesce.\n\nThe Supreme Dao of Transcendence, within the *Secret Essentials of the Jade True One*, reveals its mysteries. The adept’s devotion—how could it not be manifest?\n\nThe Yin True Lord’s five metallic correspondences are now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞神部众术类 阴真君金石五相类并序 经名：阴真君金石五相类。 撰人不详，似为唐代道士假托汉人阴长生而撰。 一卷。 底本出处：《正统道藏》洞神部众术类。 夫天地至精，莫过於道。 五行至微，莫过於黑。 蠢动至灵，莫过於人。 明暗轮环，莫明於日月。 血脉通流，莫过於江海。 兴王盛衰，莫过於四时。 克伐回旋，莫过於六甲。 此之相类，各凭大道，相承反逆，两情莫不因时为用，配合生成。 若用阴阳，不辩其类，纵随巧义，徒费其功。 且天地不同，雄雌别行，相类交错者，并无所凭也。 昔天仙至术，修命宝书，共为九卷。 并三五相类，穷究至精，道德玄元，咸施天地。 出自三皇，着论八卦，始分龙虎，龙虎相须，类同金石。 禹铸九鼎，地立九宫，分为九州，丹有九变，人有九窍，七明二暗。 头有九真，北斗有九星，二星亦不现。 国有九五，理有三元。 所以相类时同，合於大道。 识之者三丹之法可通，道在目前，不合远取。 三丹之外，余无所言，何也。 三丹用大造化之黑而结成，应五行而为人之真液，从九至九，九九三品之丹，为上真经线九卷之中，合於八卦之象焉。 《实录记》中，名灵宝神符为首，玄元之教为经。 混元白雪，九转八琼三丹，皆八卦九宫变化成象，亦更无别药，修炼可为至药。 若论杂门丹砂之法，世有万般，纵得暂时疗病，终无出世之功。 何也，相类杂错，用黑不同，牝牡不交，法则差互。 假如金石用作，数有七十二石，石之出处二地厚藏伏，各有阴阳性格。 阴山出阴石，诸青之类也。 阳山出阳石，是硫黄之类也。 若解阴阳相配，即如夫唱妇随。 若高下不和，用药乖谬，即何以配合。 故作五相类，列成二十篇，传之同志。 假如阴石在离山，南方是也。 北山出水银，从水银变成朱砂，朱砂离之，所出何也。 北山势虽阴，绿类相反克，乃先成水银，后成朱砂。 朱砂受离火之黑，假赤晕成形，终未免水银之体。 被陵阳子明传得一经，知金液探浅，皂白始分，以法脱其赤晕，还其真性之身，号日脱体丹砂，亦名换骨丹砂，亦名白虎脑，而成分明。 叙经而说，配金石门户，五类相成，不失其所云。 配合金公相类门第一五条 第一配金成质，用同相类，兼辩得真骨肉法。 假如用铅，铅是阴中有阳，阳是铅中有银，兼销成水，采黄华。 黄华是铅之炁，银是铅中之精，三物为命，合其一体。 若仙士用铅采华，即铅无炁，采精即铅无骨肉。 如一物有命有质者，去其肉则骨何有之，去其骨即肉何有之，去其华即无炁，铅何用之，一体若令魂魄不备，即如何用之。 仙士传文，如何解辩矣。 阴君解云：铅黄华，是铅中之炁为华，将对水银为用。 虽即二炁合形，终不成质。 成药之后，未免去焉。 如其不信，销成汁三度，即可知其去就，不在作法之限。 夫至药百炼成汁，展转通明，不折分毫。 然乃存其魂魄，始堪服食，可得长生。 若为药了自制，形神不住，岂可坚人之性命者乎。 此则铅失黄华之炁力，即知其不全也。 为类返乖，失其筋骨，永各别也。 第二采铅中银，号天生芽。 直下制水银成质，质凭铅生，去肉取骨，骨即无炁，名曰形神不足。 歌日：莫坏我铅，我命得全。 若坏即铅无骨无肉无炁，三才不全，何名丹田。",
      "translated_text": "**Dongshen Division: Miscellaneous Arts – *Yin Zhengjun’s Five Correspondences of Metals and Stones* (with Preface)**\n\n**Title:** *Yin Zhengjun’s Five Correspondences of Metals and Stones*\n**Author:** Unknown. Likely a Tang-dynasty Daoist who falsely attributed the work to the Han-era Yin Changsheng.\n**Volume:** One.\n**Source:** *Zhengtong Daozang* (Orthodox Daoist Canon of the Zhengtong era), **Dongshen Division: Miscellaneous Arts**.\n\nNow, the subtlest essence of Heaven and Earth is none other than the **Dao/Way**. Among the Five Phases, the most refined is none other than Black. Among all living things, the most spiritually animated is none other than Man. Among the cycles of light and darkness, none are clearer than the Sun and Moon. Among flowing vital essences, none surpass the rivers and seas. Among the rise and fall of kings, none are more profound than the Four Seasons. Among the principles of **克伐** (subjugation and restraint), none are more cyclical than the Six Celestial Stems (甲,乙,丙,丁,戊,己).\n\nThese correspondences, each relying on the Great **Dao/Way**, interact in both harmony and opposition, their effects varying with time and alignment. Yet if one applies **yin-yang** without discerning their true correspondences, even clever techniques will be in vain, laboring without reward.\n\nFor Heaven and Earth differ in nature—masculine and feminine, distinct in their operations—and their corresponding interactions bear no fixed reliance.\n\nIn ancient times, the most refined Daoist arts of the Celestial Worthies, sacred texts on prolonging life, were compiled into nine volumes. Within them, the trigrams of **Sanwu** (三五, Three and Five) were exhaustively explored, delving into the subtlest essence of **Dao/Way** and **virtue/power** (德), all applied to the harmonization of Heaven and Earth.\n\nEmerging from the Three Sovereigns (三皇), expounded in the Eight Trigrams (八卦), they first distinguished **Long** (Dragon) and **Hu** (Tiger)—two forces that complement each other, akin in nature to Metals and Stones.\n\nYu cast the Nine Cauldrons (九鼎), and the Earth established the Nine Palaces (九宫), dividing into Nine Regions (九州). The elixir undergoes nine transformations, and man has nine orifices—seven bright, two dark. The head contains nine **Zhen** (真, \"true\" or \"authentic\" essences), while the Big Dipper (北斗) has nine stars, two of which remain unseen. The realm has the Nine-and-Five (九五) hierarchy, and cosmic principles are governed by the Three Elements (三元).\n\nThus, these correspondences align with time and the Great **Dao/Way**, harmonizing in perfect accord.\n\nThose who grasp this principle may master the **San Dan** (三丹, Three Elixirs) method, for the **Dao/Way** lies before them—not in distant pursuit. Beyond the **San Dan**, there is nothing else to speak of.\n\nWhy so? The **San Dan** employs the Great Transformation’s Black essence to solidify, forming the true vital fluids of man in accordance with the Five Phases. From Nine to Nine, the **San Dan**’s ninefold elixir aligns with the **Shangqing** (上清, Supreme Clarity) Canon’s nine volumes, harmonizing with the symbols of the Eight Trigrams.\n\nIn the *Shiluji* (实录记, *Record of Authentic Scriptures*), the **Lingbao** (灵宝, \"Numinous Treasure\") Divine Symbols are ranked first, and the **Xuan Yuan** (玄元, \"Mysterious Origin\") teachings serve as the **sutra**. The **Hunyuan** (混元, \"Primordial Chaos\") White Snow Elixir, the **Jiuzhuan** (九转, \"Nine Circulations\") Eight-Precious Elixir, and the **San Dan** (三丹)—all are transformations of the Eight Trigrams and Nine Palaces, requiring no other external substances. Through cultivation, they become the ultimate **medicine**.\n\nYet if one speaks of lesser elixir methods using **Dan Sha** (丹砂, cinnabar) and miscellaneous arts, there are myriad techniques in the world. Though they may temporarily cure ailments, they lack the power to transcend the mundane.\n\nWhy so? Because their correspondences are confused and misaligned, their use of Black differs, and their **yin** and **yang** do not properly interact. Their methods vary, leading to discord.\n\nFor instance, in the preparation of Metal and Stone elixirs, there are seventy-two types of stone. Their origins lie in the deep, hidden layers of Earth, each possessing distinct **yin-yang** natures and temperaments.\n\nObtained from **Yin Mountains** (阴山), these are the **Yin Stones**—all varieties of **Qing** (青, blue-green). From **Yang Mountains** (阳山), one gathers **Yang Stones**—such as **Liu Huang** (硫黄, sulfur).\n\nIf one seeks to harmonize **Yin Stones** and **Yang Stones**, it is like the husband’s song and the wife’s response. If high and low are not properly aligned, the **medicine** will be flawed, and how can it harmonize?\n\nThus, the *Five Correspondences* is compiled into twenty chapters, passed on to like-minded seekers.\n\nFor example, if **Yin Stones** are taken from **Li Mountain** (离山, the South), and **Yang Stones** are obtained from **Beishan** (北山, the North)—where **Shuiyin** (水银, mercury) is produced—transforming **Shuiyin** into **Zhu Sha** (朱砂, cinnabar), which belongs to **Li** (Fire), what then is its origin?\n\nThough **Beishan** is of **Yin** nature, its **Lü** (green) varieties oppose and subjugate it, so it first forms **Shuiyin**, then **Zhu Sha**.\n\n**Zhu Sha**, receiving the Black essence of **Li Fire**, assumes a false crimson form, yet it never fully discards its **Shuiyin** nature. The **Lingbao** teachings, transmitted by **Biling Yangzi** (被陵阳子), reveal that **Zhu Sha**’s **Jin Ye** (金液, \"golden fluid\") is superficial, its **Zao Bai** (皂白, \"alkaline and sulfuric\") aspects merely divided. Through the method, one strips away its false crimson form, restoring its true essence, naming it **Tuoti Dan Sha** (脱体丹砂, \"Elixir Cinnabar of Detached Form\"), also called **Huangu Dan Sha** (换骨丹砂, \"Elixir Cinnabar of Transformed Bone\"), and also **Baihu Nao** (白虎脑, \"White Tiger’s Brain\"), thus achieving clarity.\n\nIn explaining this **sutra**, the correspondences of Metal and Stone’s **gateways** are aligned, the Five Categories harmonized, and nothing is lost from its original intent.\n\n**First Chapter: Correspondences of Metal and Stone’s Gateways (配合金公相类门)**\n**Five Principles (五条):**\n\n1. **The First Correspondence: Forming Metal’s True Essence (配金成质)**\n   Using **Lead** (铅), which contains **Yin** yet holds **Yang**, while its **Yang** is the **Silver** (银) within **Lead**. When refined into **Shuiyin** (水银, mercury), one extracts **Huang Hua** (黄华, \"yellow flower,\" a term for lead oxide or refined lead essence).\n   **Huang Hua** is the **qi** of **Lead**, **Silver** is the refined essence within **Lead**, and the three substances form the **vital essence** (命). When united as one, they achieve true alchemical substance.\n\n   If a **Daoist adept** (仙士) uses **Lead** to extract **Huang Hua**, the **Lead** lacks **qi**, and extracting the essence leaves **Lead** without its **bone and flesh**. If one substance must contain both **vital essence** and **substantial form**, then removing its **flesh** leaves its **bone** incomplete, removing its **bone** leaves its **flesh** incomplete, and removing its **Huang Hua** leaves it without **qi**—so what use is **Lead** then? If one body lacks its **hun-po** (魂魄, \"soul and spirit\"), how can it be used?\n\n   The transmitted Daoist teachings reveal how to resolve and discern this.\n\n   **Yin Zhengjun** explains: **Lead’s Huang Hua** is the **qi** of **Lead**, refined into a flower, to interact with **Shuiyin**. Though the two **qi** combine in form, they never fully coalesce into substance. After the **medicine** is prepared, they inevitably separate.\n\n   If one doubts this, refining the mixture into a liquid three times will reveal their separation and reunion, regardless of the method’s specifics.\n\n   The ultimate **medicine**, refined a hundred times into a liquid, circulates clearly without loss. Yet it retains its **hun-po**, making it suitable for ingestion and granting eternal life. If the **medicine** is merely prepared and then artificially constrained, its **form and spirit** will not endure—how could it then fortify one’s **vital essence** and **life force**?\n\n   This shows that **Lead** has lost the **qi** of **Huang Hua**, thus proving its incompleteness. The correspondences have reversed, its **sinews and bones** (筋骨) forever severed, and it remains fundamentally distinct.\n\n2. **The Second Correspondence: Extracting Silver from Lead (采铅中银)**\n   Known as **Tiansheng Ya** (天生芽, \"Heavenly Born Bud\").\n\n   Directly refining **Shuiyin** into substance, this substance relies on **Lead** for its formation, discarding **flesh** to take **bone**. Yet **bone** lacks **qi**, rendering it **form and spirit incomplete**.\n\n   The verse states:\n   *\"Do not destroy my Lead—my Vital Essence must remain whole.*\n   *If destroyed, Lead will have no bone, no flesh, no qi—*\n   *the Three Talents (三才) are incomplete—*\n   *what then is the Elixir Field (丹田)?\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1244,
      "start_sentence": 0,
      "end_sentence": 61,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 28.084599256515503,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\阴真君金石五相类.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "又歌日：用铅不用铅，铅用三才全。 铅用三才全，即是真丹田。 铅须全，即可知其类也。 凡认铅者，不合损其真铅，铅即不得杂其外物。 杂即神形无炁力，至丹田如此，岂能成象。 自古仙士用铅黄华及铅精，事理殊异，与常流不同，相类不乖，道能归一。 第三用不损金公，即神符纯体为玄元。 玄元是天镜，天镜即三才全，未分别。 铅黄华为炁，铅精银为骨，铅质是肉，三才全用，不失纯元之体。 一日水，二日火，铅中三才全，可用成道，所以万不失其功。 神符为天地之首，上药出自《五符经》中。 其五符出於灵水仙宫，因水成符，以符为药。 第四用九转成铅，铅须全。 若铅全则存三才，即黄华不失其位，其黄华约铅力全为用。 凡鼎有三足，不可阙一。 一炁阙即万不成其道，药无神魂即不灵。 何也。 且黄华中并无筋骨及肉，即三才不备。 如至半年，终试之销讫，走犹不住，岂乃用其无力者乎。 类不相从，保合以成，客主终共，水银反乖，各自走去。 第五成金公之道，全其大丹，形神俱备，不动真性，生灵之宝在我真铅。 铅若不真，其汞难亲，真者已全三才也。 肉为天，亦为母，乾中之母，内含阳天铅中银，为阴地，地能生万物。 黄华为炁，炁能长万物，如仙士用之，不破其车，即为真铅矣。 歌日：莫破我车，令我还家，我由命也。 车是铅之别名也，破即三才不备，无所用也。 又曰：黄龙汁，是铅中黄精销成汁。 世人以汁投之，号日铅黄华是也。 铅若无汁，何堪为用。 所论真铅，非五金土 石之类。 学道者审而明其理也。",
      "translated_text": "「Again the verse says:\n*\"Use Lead or not use Lead—*\n*when Lead is used, the Three Talents are whole.*\n*When Lead is used and the Three Talents are whole,*\n*that is the true Elixir Field.*\n\n*Lead must be whole,*\n*then one may recognize its category.*\n\nAll who acknowledge Lead must not harm its true essence—\nLead must not be mixed with external substances.\nIf mixed, its form and spirit lack **qi**—\nuntil the Elixir Field is thus,\nhow could it ever manifest?\n\nSince ancient times, **Daoists** (仙士) have used **Huang Hua** (黄华) and **Lead** (铅) in their purest form;\ntheir methods are extraordinary,\ndifferent from common practices,\nyet aligned without contradiction—\nDao can return to unity.\n\n**The Third Correspondence:** Using **Jin Gong** (金公) without harming it,\nthe **Divine Symbol** (神符) in its pure form becomes **Xuan Yuan** (玄元, \"Mysterious Origin\").\n\n**Xuan Yuan** is the **Heavenly Mirror** (天镜),\nthe Heavenly Mirror is the Three Talents undivided.\n**Huang Hua** (黄华) within Lead is **qi**,\n**Lead’s essence** (铅精) as Silver is bone,\nand **Lead’s substance** (铅质) is flesh—\nwhen the Three Talents are fully employed,\nthe pure essence of **Xuan Yuan** is not lost.\n\nOne day is **water** (水), two days is **fire** (火);\nLead contains the Three Talents whole—\nit can be used to attain the Dao,\nthus its efficacy is never lost.\n\nThe **Divine Symbol** is the head of Heaven and Earth,\nand the **superior elixir** originates from the *Five Symbol Scripture* (《五符经》).\nIts five **Symbols** (符) emerge from the **Spiritual Water Immortal Palace** (灵水仙宫),\nformed by water, used as elixir.\n\n**The Fourth Correspondence:** Refining **Lead** through **nine transformations** (九转),\nLead must remain whole.\n\nIf Lead is whole, the Three Talents are preserved—\nits **Huang Hua** does not lose its place,\nand its **Huang Hua** fully harnesses the **qi** of Lead.\n\nA furnace must have three feet—\nnone may be missing.\nIf **qi** is lacking, the Dao will never be achieved;\nif an elixir lacks spirit and essence, it will not be efficacious.\n\nWhy so?\n\nWithin **Huang Hua**, there are no sinews, bones, or flesh—\nthe Three Talents are thus incomplete.\nEven after half a year,\nif it is tested and found to be fully consumed,\nits **qi** cannot be contained—\nhow could one use what is powerless?\n\nCategories do not follow one another;\npreservation and combination yield success.\nGuest and host must unite,\nbut **Shuiyin** (水银) is contrary—\neach departs on its own.\n\n**The Fifth Correspondence:** The Dao of **Jin Gong** (金公),\npreserving its **great elixir** (大丹),\nwith form and spirit both complete,\nunchanged in its true nature—\nthe treasure of life lies within my true Lead.\n\nIf Lead is not true,\nits **mercury** (汞) will not be intimate;\nthe true is already whole in the Three Talents.\n\nFlesh is Heaven,\nalso the Mother—\nthe Mother within **Qian** (乾, \"Heaven\"),\ncontains the **yang Heaven** (阳天).\nWithin Lead, Silver is the **yin Earth** (阴地),\nEarth nurtures all things.\n**Huang Hua** is **qi**,\n**qi** sustains all things—\nif **Daoists** use it without breaking its **vehicle** (车),\nthen it is true Lead.\n\nThe verse says:\n*\"Do not break my vehicle,*\n*let me return home—*\n*for that is my life.*\n\nThe **vehicle** is another name for Lead;\nif broken, the Three Talents are incomplete—\nuseless for any purpose.\n\nAgain it is said:\n**Huanglong zhi** (黄龙汁, \"Yellow Dragon Essence\"),\nis the **Huang Hua** essence of Lead refined into a liquid.\nCommon folk use this liquid to administer it,\ncalling it **Lead’s Huang Hua**.\n\nIf Lead lacks this liquid,\nhow could it be of use?\n\nThe true Lead spoken of here\nis not of the five metals, earth, or stone variety.\nSeekers of the Dao must carefully examine and clarify its principles.»",
      "overlap_context": "Known as **Tiansheng Ya** (天生芽, \"Heavenly Born Bud\").\n\n   Directly refining **Shuiyin** into substance, this substance relies on **Lead** for its formation, discarding **flesh** to take **bone**. Yet **bone** lacks **qi**, rendering it **form and spirit incomplete**.\n\n   The verse states:\n   *\"Do not destroy my Lead—my Vital Essence must remain whole.*\n   *If destroyed, Lead will have no bone, no flesh, no qi—*\n   *the Three Talents (三才) are incomplete—*\n   *what then is the Elixir Field (丹田)?\"*",
      "start_char": 1244,
      "end_char": 1845,
      "start_sentence": 62,
      "end_sentence": 93,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 12.8797767162323,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\阴真君金石五相类.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "配合水银相类门第二十名 一名玄水，玄水是水炁初胎，一千年后成结，似凝未凝，似胎未成胎，名日玄水，不堪为用。 二名玄珠流汞，流汞是水光之炁，二千年名玄水流珠，已成水银，尚未堪修炼为丹，是水银初地之名。 三名河上姥女，是三千年水炁，已成水银，带青色，号日初名水银，如飞炼对阳，被火炁影着即走，亦未禁火，未堪烧炼，但用水银道者，须用此事。 四名太阴，是四千年水银，已过三千年，故名太阴，是老水银，始堪用也。 五名赤帝流汞，又名赤血将·军。 此出自离宫赤水，含阳炁赤色，成朱砂，斯为汞之别名。 积混元之炁，而成阴山。 阴山极危险，出水银。 水银真混沌之炁也。 终是太阴之精炁，如拒火不飞，销泻不折分毫，即合大造化之力，其中有长生出世之大功。 六名玄水金液，亦名玄水水银，凭水而生，凝结成水银，后大造化。 仙人修入水藏形，号曰玄水丹铅。 盖其上凝结，号名金液。 即是得名神符，神符出自水精宫也。 七名玄明龙膏，亦名抽晕丹砂。 玄明者，无炁晕也。 龙膏者，白雪之异名。 伏火后不去，服食一道，有不可思量之功。 但有恶疮等，末着其上，即当日见效，名日龙膏，有大功也。 八名水银虎矾，水银入一切矾石中，用合成药，煞一切毒虫，及成五金，以为世宝。 若入诸矾石，即不堪服食。 九名白虎脑、玄武骨。 此是都名，亦名白朱砂，别名天生芽。 直下制汞，见火而合本体。 亦云子母相生，不离其本，此名为天生芽也。 十名砂顺，亦名金顽，亦名太阳流珠。 此三者水银，有变化之功，已成世宝，为利兼疗诸疾恶病，亦有上升不死之丹，夺天地造化之景，万物归依，共成一道。 陵阳子明是水银之别名，其仙君历劫仙人，穷其丹性，配合三黄二青一白，出处生灵，采子午入於中宫，类二仪合於胎息，穿阴山知其水银之性，用定别名。 如堪服食，即随其制度呼之，亦不以一名为总者。 看水银之性，临炉当火所用。 如道士得其真性，配合三才，成丹万无一失。 如不得真性，临炉当火，疆为燠伏，虽能将为药用，无诸制度，亦不免飞走，亦无出世之大功。 万般巧伪，不如识真水银之性，相类合同，俱成一体。 而乃子明历劫考寻阴阳二山用之，知其皂白，灵妙无差互。 乃观真水银，含紫色赤脉如血者，此老阴山之精，绝上也。 青色名姥女，白色名玄水流珠，又名白虎脑。 白虎脑者，号曰白丹砂。 仙人抽却炁晕，见洁白之体，遂名白丹砂，是三千年后四千年名号也。 今辰锦砂，时人亦呼为朱砂，如道士配合阴阳，巧令伏火者，此名伏火熟朱砂，不得号为丹砂。 其白虎脑有三名，第一名白虎脑，二名白金液，三名白丹砂。 陵阳子明易知水银之性，变水银之成金，亦有不死之功，相类成品，造化者不虚其道。 配合曾青相类门第三三名 曾青一名青龙膏，其青龙膏是水银之命○ 若变化得曾青成膏，即水银之圣道合矣。 亦是水银之使，亦能制水银为丹。 言其膏者，水银之中得成丹。 其丹通灵，可为上升之药。 如不得曾青膏水银。 如龙见火却飞，所以曾青水银之使，亦是水银脂膏。 二名青龙翘。 曾青本配束方之木，木中有火，象曾青中有金。 木中不见火，曾青金不明，如人有魂魄阴阳，岂有形。",
      "translated_text": "**Section Twenty: Alchemical Refining of Mercury (配合水银相类门第二十)**\n\n**First Name: Xuan Water (玄水)**\nXuan Water is the primordial *qi* of water in its embryonic state. After a thousand years, it congeals—neither fully solid nor fully formed—yet not yet a true embryo. Thus it is called Xuan Water, yet it is unfit for use.\n\n**Second Name: Xuan Pearl Flowing Mercury (玄珠流汞)**\nFlowing Mercury is the luminous *qi* of water. After two thousand years, it becomes Xuan Water Pearl, now true mercury, though still unrefined for elixir-making. This is the initial stage of mercury.\n\n**Third Name: Riverbank Old Woman (河上姥女)**\nThis is the three-thousand-year *qi* of water, now fully mercury, tinged with green. It is called *Riverbank Old Woman*—when exposed to fire’s *yang* *qi*, it flees at the slightest flame, yet cannot yet endure fire. Only those who practice the Dao of mercury should use this.\n\n**Fourth Name: Tai Yin (太阴)**\nAfter four thousand years, mercury surpasses the three-thousand-year mark and is called Tai Yin—aged mercury, now fit for use.\n\n**Fifth Name: Chi Emperor Flowing Mercury (赤帝流汞), also named Red Blood General (赤血将·军)**\nThis emerges from the Vermilion Palace’s red waters, infused with *yang* *qi* and redness, forming cinnabar. This is mercury’s alternate name.\nIt accumulates the *qi* of the Primordial Chaos, forming the Yin Mountain.\nYin Mountain is perilous—it yields mercury.\nMercury is the true *qi* of Chaos.\nUltimately, it is the refined *qi* of Tai Yin—unfaltering before fire, neither consumed nor diminished. When harmonized with the Great Transformation, it holds the supreme merit of immortality and transcendence.\n\n**Sixth Name: Xuan Water Golden Elixir (玄水金液), also named Xuan Water Mercury (玄水水银)**\nBorn from water, it congeals into mercury, then achieves the Great Transformation.\nDaoists refine it into the *Xuan Water Dan Lead* form, its upper essence named Golden Elixir—this is the divine talisman, originating from the Water Crystal Palace.\n\n**Seventh Name: Xuanming Dragon Grease (玄明龙膏), also named Drawn Dizziness Cinnabar (抽晕丹砂)**\nXuanming means without *qi* haze. Dragon Grease is another name for white snow.\nAfter suppression by fire, it remains unaltered. When ingested, its effects are beyond measure.\nYet if applied to malignant sores, it acts instantly—thus called Dragon Grease, with great efficacy.\n\n**Eighth Name: Mercury Tiger Alum (水银虎矾)**\nWhen mercury enters alum stones, it forms medicinal compounds, neutralizing all venomous creatures and refining into the five metals—treasured by the world.\nYet if ingested with alum, it becomes unusable.\n\n**Ninth Name: White Tiger Brain, Xuanwu Bone (白虎脑、玄武骨)**\nA collective term, also called White Cinnabar or Heavenly Sprout.\nDirectly processed mercury, which reunites with its essence upon exposure to fire.\nAlso called *Child-Mother Mutual Generation*—never departing its origin. This is the Heavenly Sprout.\n\n**Tenth Name: Sand Compliance (砂顺), also named Metal Stubbornness (金顽), also named Taiyang Flowing Pearl (太阳流珠)**\nThese three names of mercury possess transformative power, becoming worldly treasures—beneficial for ailments and immortality, rivaling Heaven and Earth’s creation. All things submit, forming the Dao.\n\n**Lingyang Ziming (陵阳子明)** is another name for mercury. This immortal sage, through countless kalpas, exhausted its elixir nature, combining Three Yellows, Two Greens, and One White. He gathered life’s essence from the Child-Midnight and Parent-Noon, merging with the Central Palace’s *yin-yang* harmony, penetrating the Yin Mountain to discern mercury’s true nature—thus defining its alternate names.\nIf fit for ingestion, it follows its prescribed methods. Yet without true understanding, even if used in alchemy, it risks flight or failure, lacking transcendental merit.\nAll clever deceits pale compared to recognizing mercury’s true nature—when properly aligned, they merge as one.\nLingyang Ziming examined Yin-Yang Mountains’ mercury, knowing its purity without flaw.\nTrue mercury contains crimson veins like blood—this is the supreme essence of aged Yin Mountain.\nGreen is called *Riverbank Old Woman*; white is called *Xuan Water Flowing Pearl*, also *White Tiger Brain*.\n*White Tiger Brain* is also named *White Cinnabar*.\nDaoists, stripping its *qi* haze, reveal its pristine whiteness—thus *White Cinnabar*, a name for the three-to-four-thousand-year stage.\nToday’s *Chénjǐn cinnabar* is also called *cinnabar*, but if Daoists harmonize *yin-yang* and suppress it with fire, it is called *Suppressed-Fire Mature Cinnabar*—not to be confused with *Cinnabar*.\n*White Tiger Brain* has three names: First, *White Tiger Brain*; Second, *White Golden Elixir*; Third, *White Cinnabar*.\n\nLingyang Ziming easily discerns mercury’s nature—its transformation into gold and immortality. When properly refined, the Great Transformation’s principles are never in vain.\n\n---\n**Section Three of the Copper Green Category (配合曾青相类门第三)**\n\n**First Name: Copper Green Dragon Grease (曾青青龙膏)**\nCopper Green Dragon Grease is mercury’s destiny.\nIf transformed with Copper Green into grease, mercury’s sacred Dao is fulfilled.\nIt is also mercury’s envoy, capable of refining mercury into an elixir.\nCalled *grease* because mercury within achieves elixir form—its elixir is spiritually potent, suitable for ascension.\nWithout Copper Green grease, mercury flees like a dragon before fire—thus Copper Green is mercury’s grease.\n\n**Second Name: Copper Green Phoenix Wing (青龙翘)**\nCopper Green originates from the *mu* wood category—wood contains fire, symbolizing Copper Green’s metallic essence.\nWithout fire in wood, Copper Green’s metal remains obscure—just as humans require *yin-yang* soul and spirit to manifest form.",
      "overlap_context": "er name for Lead;\nif broken, the Three Talents are incomplete—\nuseless for any purpose.\n\nAgain it is said:\n**Huanglong zhi** (黄龙汁, \"Yellow Dragon Essence\"),\nis the **Huang Hua** essence of Lead refined into a liquid.\nCommon folk use this liquid to administer it,\ncalling it **Lead’s Huang Hua**.\n\nIf Lead lacks this liquid,\nhow could it be of use?\n\nThe true Lead spoken of here\nis not of the five metals, earth, or stone variety.\nSeekers of the Dao must carefully examine and clarify its principles.»",
      "start_char": 1846,
      "end_char": 3104,
      "start_sentence": 94,
      "end_sentence": 145,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 13.805058002471924,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\阴真君金石五相类.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "此四义象水银含於朱砂之体内。 三名青腰使者。 曾青居水，一名亦无二三。 为仙人当配合之时，类同得成上药，便以所得意为名。 然相类制伏，各取其功，论其得失，乃知曾青合水银之性易之。 云青龙膏、青龙翘者，因水银而生二名。 水银如龙，见火即走。 曾青膏伏制得住，号龙虎丹。 五相类了，知曾青有驻水银之功，又能驻生灵之命，合配水银之性，与曾青类同也。 乃知曾青配木，合於水银，子明制之不错。 配合硫黄相类门第四六名 一名玫始初之名，号硫黄，出在阳石之山。 当女娲寻得炼石停脂穴，数真人共论之，绿穴深数百丈，穴中有石汁流出，见风坚硬如石，似黄金色，因而为名硫黄。 元本名号石停脂。 二名黄英，黄英本从阳石中生黄水，化为石，遂名黄英。 三名黄烛，黄烛者亦是石停脂，性带太阳炁，见火而生焰，而名黄烛。 四名法黄，当女娲炼之得法，而成黄道，遂名法黄。 五名九灵黄童。 九灵者，太阳，有九名，故曰九灵。 黄童，纯阳之名，谓童子之性，无阴故也。 六名黄白砂。 准仙法，凡伏得石停脂，伏火带黄白色，其道化五金成宝不远。 后说云：亦独行一门，乃有救贫之法。 独有一门，能化五金为世宝。 若能禀天仙之法，住水银成白金，反曾青为太阳者，即是天人之仙药焉。 炼石停脂名号，出自女娲，得其神化之功，易名垂於后世。 天地至精，莫过於道。 道中至微，莫过於炁。 养炁安魂，莫过於水银太阳。 炼魄存神，莫过於硫黄。 宣制解释，含藏育养，莫出於黄龙汁。 黄龙汁乃铅之别名耳。 安静不动，莫过於青腰使者。 青腰使者自有神化之功，压强抚弱，含金液之百灵，定水银之真性，安四神，调五藏，助气海，能升能沉，解作黄神之法则升，不解则沉，沉之则毙，升之则仙。 如定得石停脂，即有育人之功。 若不定伏得硫黄之性，即迟晚终有杀人之毒。 如道士定伏得硫黄雄黄黄芽，并水银之异性，解使曾青为黄神，胶炼曾青黄色是也，隐名是至道中。 伏定三黄之大诀如会得，即兼变化万物，无物不可变化。 若三黄伏火，各令不夺其元色，并须得各用子母相承。 若用别性物难入类，愿思知见，以宝生宝。 解者须臾，不解者对面陌路。 道在我身，得之名相，类考寻知，所用不杂者善。 配合雄黄相类门第五一十一名 雄黄者，出自西方兑宫，何也。 雄黄是庚辛，兑金之苗，借庚辛之炁，结成雄黄出武都山。 生此雄黄，其山甚灵，非理之人，采之不得。 事须祝醮启告，然始采得，些些万人采，无一人知其所用，相类得门。 后汉阴君寻知其处，辩其色目，元非独会，考其众仙圣之术，方得明白。 且雄黄自有十一般名，各有所用，用药道士切须要知其根源。 若取武都雄黄，拟伏炼丹，乃都不解用药，亦未会道之根源，纵得偶成丹，亦不堪服食。 或作不成，过后妄推鬼神所作，云祭祀无功，不知误凭古文 偶错，使雄黄信手称情，此非知道之流也。 一名朱雀筋，朱雀筋者，伏炁成质，先带朱色，五千年后，变成黄色b 寻朱雀筋，带朱色。 其黄新者不堪大用，力又薄○ 世人见此，争言云好雄黄，甚错。 如将合草药小丹方，即且任意用得。 若入理大用，拟制伏变化，即实未堪用。",
      "translated_text": "「This fourth significance illustrates how mercury is contained within the body of cinnabar.\nIts third name is **Copper Green Envoy (青腰使者)**.\nCopper Green resides in water—its name is also **Waterless (亦无二三)**.\nWhen alchemists prepare it, it resembles an elixir of ascension,\nand thus takes its name from the result obtained.\nYet when comparing its efficacy, each takes its own merit,\nand by examining its gains and losses,\none understands that Copper Green easily harmonizes with mercury’s nature.\nThe names **Copper Green Dragon Grease (青龙膏)** and **Copper Green Phoenix Wing (青龙翘)**\narise from mercury—\nmercury, like a dragon, flees at the sight of fire,\nbut Copper Green grease subdues and restrains it,\nearning the title **Dragon-Tiger Elixir (龙虎丹)**.\nWith five parallels now established,\nit is clear that Copper Green possesses the power to **restrain mercury (驻水银)**,\nand also to **restrain the vital essence of life (驻生灵之命)**,\nharmonizing with mercury’s nature as it aligns with Copper Green’s own.\n\nThus, it is known that Copper Green, paired with wood,\nis perfectly matched with mercury,\nand **Child of Clarity (子明)** refines it without error.\n\n**Category: Sulfur and Its Analogues (配合硫黄相类门第四)**\nSixth Name: **Sulfur’s First Name (玫始初之名)**,\nalso called **Sulfur (硫黄)**,\nwhich emerges from the **Yang Stone Mountains (阳石之山)**.\nWhen **Nuwa (女娲)** discovered it and used it to seal the **Pit of Stopped Fat (停脂穴)**,\nthe **Immortal Masters (真人)** deliberated upon it.\nThe **Green Pit (绿穴)** extends hundreds of feet deep,\nand within it flows a stone essence that hardens upon exposure to wind,\nresembling yellow gold in hue—\nthus, it is named **Sulfur (硫黄)**.\nOriginally, it was called **Stone-Stopped Fat (石停脂)**.\nIts second name is **Yellow Flower (黄英)**,\nfor it produces a yellow fluid from the **Yang Stone (阳石)**,\nwhich solidifies into stone—\nhence, the name **Yellow Flower (黄英)**.\nIts third name is **Yellow Candle (黄烛)**,\nalso a form of **Stone-Stopped Fat (石停脂)**,\nwhose nature carries the **essence of the Sun (太阳炁)**,\nflaming when exposed to fire—\nthus, it is named **Yellow Candle (黄烛)**.\nIts fourth name is **Lawful Yellow (法黄)**,\nfor when **Nuwa (女娲)** refined it, she attained the **Dao of Yellow (黄道)**,\nand thus it was named **Lawful Yellow (法黄)**.\nIts fifth name is **Nine Spirits of Pure Yang (九灵黄童)**.\nThe **Nine Spirits (九灵)** refer to the nine names of the Sun,\nand **Pure Yang (黄童)** denotes the nature of a **virgin boy (童子)**—\nfree from **yin**, hence its name.\n\nIts sixth name is **Yellow-White Sand (黄白砂)**.\nAccording to **Immortal Techniques (仙法)**,\nwhen **Stone-Stopped Fat (石停脂)** is subdued,\nand fire is restrained, yielding a yellow-white hue,\nits **Dao** will soon transform the **Five Metals (五金)** into treasures.\nLater, it is said:\n*Sulfur also stands alone as a category,*\n*possessing the method to **save the poor (救贫)**.*\n*With one category alone,*\n*it can transmute the **Five Metals (五金)** into worldly treasures.*\nIf one follows the **Heavenly Dao of the Immortals (天仙之法)**,\nand **restrains mercury to become white gold (住水银成白金)**,\nwhile **transforming Copper Green into the Sun’s essence (反曾青为太阳)****,\nthen it becomes the **elixir of Heaven and Man (天人之仙药)**.\n\nThe names of **Stone-Stopped Fat (停脂穴)** originate with **Nuwa (女娲)**,\nwho revealed its **divine transformation (神化之功)**,\nand passed its new name down through the ages.\nThe most refined essence of Heaven and Earth\ncannot surpass the **Dao (道)**.\nWithin the **Dao**, the subtlest aspect\ncannot surpass **qi (炁)**.\nTo **nurture qi and settle the soul (养炁安魂)**,\nnothing surpasses **mercury and the Sun’s essence (水银太阳)****.\nTo **refine the spirit and preserve the essence (炼魄存神)**,\nnothing surpasses **Sulfur (硫黄)**.\nFor **proclaiming restraint and explaining concealment (宣制解释)**,\nas well as **harboring and nourishing (含藏育养)****,\nnothing exceeds **Yellow Dragon Essence (黄龙汁)**—\nwhich is merely another name for **lead (铅)**.\nFor **tranquility and immobility (安静不动)**,\nnothing surpasses **Copper Green Envoy (青腰使者)**.\nThe **Copper Green Envoy (青腰使者)** possesses its own **divine transformation (神化之功)**,\n**pressing the strong and soothing the weak (压强抚弱)**,\n**harboring the hundred spirits of gold essence (含金液之百灵)***,\n**settling mercury’s true nature (定水银之真性)**,\n**calming the Four Spirits (安四神)***,\n**harmonizing the Five Zang Organs (调五藏)***,\n**aiding the Sea of Qi (助气海)***,\n**capable of both ascension and descent (能升能沉)**.\nIf one **understands its method (解)**, it ascends as **Yellow God (黄神)**;\nif one does not **understand (不解)**, it descends.\nDescending, it leads to death;\nascending, it grants immortality.\nIf one **settles (定)** the **Stone-Stopped Fat (停脂穴)**,\nthen it possesses the power to **nourish humanity (育人)**.\nIf one fails to **settle and subdue Sulfur’s nature (不定伏得硫黄之性)**,\nits toxicity will manifest late—\nit will surely **kill (杀人)**.\nIf an adept **settles and subdues the Three Yellows (雄黄黄芽，并水银之异性)***,\n**uniting them with Copper Green as Yellow God (解使曾青为黄神)***,\nand **binds and refines Copper Green into a yellow hue (胶炼曾青黄色)***,\nthen this is the **hidden name of the Supreme Dao (至道中)**.\nWhen the **great secret of subduing the Three Yellows (伏定三黄之大诀)***\nis mastered,\none can **transmute all things (变化万物)**—\nnothing cannot be transmuted.\nIf the **Three Yellows (三黄)** are subdued by fire,\neach must retain its **original hue (元色)**,\nand all must be **paired in parent-child succession (子母相承)**.\nIf one uses **unrelated substances (别性物)***,\nthey will not **enter the category (入类)**—\none should **ponder and discern (思知见)***,\n**generating treasures from treasures (以宝生宝)**.\nIf one **understands (解)**, it is swift;\nif one does not **understand (不解)**, it is as distant as two strangers facing each other.\nThe **Dao** lies within oneself—\nif one **attains it (得)**, the names will follow;\nif one **seeks and examines its parallels (类考寻知)***,\nand uses **nothing impure (不杂)***,\nthen one is **skilled (善)**.\n\n**Category: Realgar and Its Analogues (配合雄黄相类门第五)**\nEleventh Name: **Realgar (雄黄)**,\nwhich originates from the **Western Metal (西方兑宫)**—\nwhy so?\nRealgar is **Regal (庚)** and **Metal (辛)**,\nthe **offspring of Metal (兑金之苗)***,\nborrowing the **qi of Regal and Metal (庚辛之炁)***\nto coalesce into **Realgar (雄黄)****,\nemerging from **Wudu Mountain (武都山)**.\nThis mountain is most **numinous (灵)**—\nthose without **proper understanding (理)**, cannot obtain it.\nOne must **perform rituals and declarations (祝醮启告)***\nbefore beginning to **extract it (采)**.\nEven then, out of ten thousand who attempt it,\nnone truly **know its use (知其所用)**—\nthis is how its category was revealed.\nLater, in the **Later Han Dynasty (后汉)**, the **Dark Lord (阴君)** sought its location,\ndiscerned its **color and properties (色目)**,\nand through **examination of the arts of the Immortals and Saints (众仙圣之术)***,\ngained clarity.\nMoreover, Realgar has **ten general names (十一般名)***,\neach with its own **application (所用)**.\nThose who practice **Daoist alchemy (药道士)***\nmust **know its roots (根源)**.\nIf one takes **Realgar from Wudu Mountain (武都雄黄)***\nand attempts to **subdue and refine it into an elixir (伏炼丹)***,\none will **fail to understand its true use (不解用药)***,\nnor will one **grasp the Dao’s origins (会道之根源)**.\nEven if one **偶然 achieves a crude elixir (偶成丹)***,\nit will **not be fit for consumption (不堪服食)**.\nSome may **fail entirely (作不成)**,\nand later **blame it on spirits and gods (妄推鬼神所作)***,\nclaiming **rituals were ineffective (祭祀无功)**,\nyet they **err by relying on ancient texts (误凭古文)***,\n**using Realgar indiscriminately (信手称情)***—\nthis is not the **path of true Daoists (知道之流)**.\n\nIts first name is **Crimson Phoenix Sinew (朱雀筋)**.\n**Crimson Phoenix Sinew (朱雀筋)** refers to its **subdued qi forming substance (伏炁成质)***,\nfirst bearing a **crimson hue (朱色)**.\nAfter **five thousand years (五千年)**,\nit transforms into a **yellow color (黄色)**.\nIf one seeks **Crimson Phoenix Sinew (朱雀筋)**,\nthe **fresh yellow (黄新)** is unfit for **major use (大用)***,\nand its **power is weak (力又薄)**.\nThe common folk, seeing this,\n**contend it is fine Realgar (争言云好雄黄)***—\nthis is greatly mistaken.\nIf one **merely combines it with herbal elixirs (合草药小丹方)***,\nit may **serve minor purposes (任意用得)**.\nYet for **great, rational applications (入理大用)***,\nor to **subdue, refine, and transmute (拟制伏变化)***,\nit is **indeed unfit for use (实未堪用)**.",
      "overlap_context": "ause mercury within achieves elixir form—its elixir is spiritually potent, suitable for ascension.\nWithout Copper Green grease, mercury flees like a dragon before fire—thus Copper Green is mercury’s grease.\n\n**Second Name: Copper Green Phoenix Wing (青龙翘)**\nCopper Green originates from the *mu* wood category—wood contains fire, symbolizing Copper Green’s metallic essence.\nWithout fire in wood, Copper Green’s metal remains obscure—just as humans require *yin-yang* soul and spirit to manifest form.",
      "start_char": 3104,
      "end_char": 4342,
      "start_sentence": 146,
      "end_sentence": 201,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 31.043782949447632,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\阴真君金石五相类.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "二名勾陈，是雄黄初脱朱色，渐变黄色，乃名勾陈。 若用为药，十得八九，不得全功，且不堪入火炼之为用。 三名太一，旬首中石，其药已成黄色，堪入火试。 四名揉黄，其雄黄已成，大劫数终，纵横用得不疑。 五名黄奴，黄奴者是水银之使，得号为黄奴，入汞中即阴阳不失其气。 六名帝男精，帝男精者黄奴别名，与太阴合同，交会日变其炁，如女受男之精也。 七名丹日魂，其雄黄极阳，是日之魂，号为太阳之名，得丹日魂之号也。 八名石黄，其石黄是雄黄之精，非唯制伏用之，人带身上，刀箭射之不着，如得之生带，不用修炼，如更合成三黄，伏火变异，成大造化之宝，及有出世之门，而不虚也。 九名黄金，此之一味，伏火炼作黄色，入微微黄神胶助之，独变五金为黄，成黄金，不在用诸矾石之限。 十名黄苍，黄苍是老雄黄也。 不唯合炼成丹，有邪魅鬼病孩子生带少许，魅病立差。 十一名帝男血，其雄黄表带白衣，裹带血色，光透如空，鲜明如血，好雄黄也。 此者若合时得炁，相类成品，不失三才。 出炉鼎后，三年洗濯精洁，服食依法度，立可上升矣。 出离极南武都山也。 元一物数名，各有用处。 仙人留法，莫不遍知，下手得成。 上药经历万过，因而名之。 或各立异名，得之总解，妙理难穷，类合根元，用之不错，相类成品，得炁成功。 若总用药，不分根源，徒名道者。 且天之相类极阳也，地之相类极阴也，润下水为江海，利地之血脉。 天有河，连地之通炁，为悬象本天上无水。 天地至精，不过守一，而分三才，象三大丹也，承五德而生。 后人之就上法而生，万般类求，诸邪异施而用之，将无炁之物，以时推移，自生大患矣。 世人岂知，至精不过守一，立义不过三才，相生不出於五行，伏藏不出於水火，相类之道，元从一焉。 配合两情，能夫能妻，阴极阳生，而成至药者，莫不依我太阳、太阴者也。 配合铅精相类门第六二十一名 按铅精，仙人配用，方有多名。 人若知使用，即不失其道。 一铅花，二铅精，三玄黄，四黄芽，五飞轻。 已上五名，盖是神符、丹镜同用之法。 释曰：一铅华者，是铅之炁，堪伏汞，虽暂驻伏於火，终无了义，能消三毒，尽化为空。 二铅精者，是铅中之银，合水银之药成类，因铅质成胎，终始药中大患矣。 三玄黄者，是铅中精，合汞炁用之，三才俱存，不动真性，为神符玄录，天镜为用，而入铅中，为筋骨也。 四黄芽者，是铅中黄华。 黄华是铅中之炁，合汞为用，用即不失铅体，即为黄芽。 五飞轻者，是铅中精华，虽采用合铅，只丹砂是也。 用之人不觉，又须知两般共炁太阳，一种不得，交错用之。 天盖在铅内，天盖华池也。 华池水基也。 六黄举，七紫根，已上二名，百炼堪成绝粒之药，其功不可量也。 八黄华，九河车，已上二名，堪伏汞遍周天，远近不走，亦不减分毫。 十立制石，十一铅精，十二黄轻，十三黄龙，十四伏丹，十五黄池。 立制石，是铅脱胎化白色，似石，堪制伏汞，为至药铅精。 仙人解用制金石，中有毒自消，有毒则不堪服食。 黄轻者，是黄华之别名，用时如轻华？ 而能重用之。 用之而能制黄白物成宝。 黄龙、伏丹，是铅华之别名。",
      "translated_text": "「Its second name is **Gòuchén (勾陈)**—\nthis is **Realgar** after it has shed its crimson hue and gradually turns yellow, hence the name **Gòuchén**.\nIf used as medicine, **eight or nine times out of ten** it fails to achieve full efficacy,\nand it **cannot endure fire-refining**.\n\nIts third name is **Tàiyī (太一)**—\nthe **stone of the first decan**, its **medicinal form now fully yellow**, fit for fire-testing.\n\nIts fourth name is **Ròuhuáng (揉黄)**—\nhere, **Realgar** has fully formed.\nAt the end of a **great kalpa (大劫)**,\nit may be used **freely in any direction** without hesitation.\n\nIts fifth name is **Huángnú (黄奴)**—\n**Huángnú** is the **servant of mercury (水银之使)**,\nearning its name as it **preserves yin-yang qi** when immersed in mercury.\n\nIts sixth name is **Dìnánjīng (帝男精)**—\nanother name for **Huángnú**, akin to **Tàiyin (太阴)**,\nwhere **qi transforms daily** through their union—\nlike a woman receiving a man’s seed.\n\nIts seventh name is **Dānrìhún (丹日魂)**—\nthis is **Realgar in its extreme yang**, the **soul of the sun**,\nearning the title **Tàiyáng (太阳)**.\n\nIts eighth name is **Shíhuáng (石黄)**—\n**Shíhuáng** is the **essence of Realgar**,\nnot only used for **subduing and refining**,\nbut when **worn on the body**, it renders one **impervious to blades and arrows**.\nIf carried **raw and unrefined**, it suffices—\nbut when **further combined into the Three Yellows (三黄)**,\n**subdued by fire and transmuted**, it becomes a **treasure of supreme transformation (大造化之宝)**,\nand a **path to transcendence (出世之门)**—\nthis is no empty claim.\n\nIts ninth name is **Huángjīn (黄金)**—\nthis single substance, **subdued and refined by fire into yellow**,\nwhen **assisted by subtle yellow divine glue (微微黄神胶)**,\ncan **solely transmute the Five Metals into gold**,\nunbound by the **limits of alum (矾石)**.\n\nIts tenth name is **Huángcāng (黄苍)**—\n**Huángcāng** is **aged Realgar**.\nNot only can it be **refined into an elixir**,\nbut even a **touch carried by children** suffering from **demonic possession or illness (邪魅鬼病)** will **instantly cure them**.\n\nIts eleventh name is **Dìnánxuè (帝男血)**—\nhere, **Realgar** appears **cloaked in white**, yet **veined with blood-red light**,\ntranslucent as empty space, **bright as blood**—\nthis is **true Realgar**.\n\nIf **properly combined with qi at the right moment**,\nthe resulting product **harmonizes with the Three Realms (三才)**.\nAfter **three years of purification in the crucible**,\nwhen taken according to **prescribed measures (法度)**,\none may **ascend immediately**.\n\nIt originates from **extreme southern Wǔdū Mountain (极南武都山)**.\n\nOne substance, many names—\neach with its own application.\nThe **laws left by immortals** are **known in full**,\nand those who begin with skill **achieve success**.\n\nThe **Supreme Medicine** has undergone **ten thousand refinements**,\nthus earning its names.\nSome **establish distinct names**,\nbut when **unified in essence (总解)**,\nits **mystical principles (妙理)** are **fathomless**.\nWhen **aligned with the root source (根元)**,\nits use is **without error**,\nand when **harmonized with qi**, it **succeeds**.\n\nIf one **uses medicine indiscriminately without regard to its source**,\nand **names it Dao**—\nthis is **misguided**.\n\nFor **heaven’s essence is extreme yang**,\nwhile **earth’s essence is extreme yin**—\n**moistening downward**, it becomes **rivers and seas**,\n**nourishing earth’s meridians (血脉)**.\n**Heaven has the Milky Way (河)**,\nconnecting with **earth’s circulating qi (通炁)**,\nforming **suspended symbols (悬象)**—\n**heaven above has no water**.\n\nThe **ultimate precision of heaven and earth**\ndoes not exceed **holding fast to the One (守一)**,\nyet it **divides into the Three Realms (三才)**,\nmirroring the **Three Great Elixirs (三大丹)**,\n**inheriting the Five Virtues (五德)** to give birth.\n\nLater practitioners, following these **supreme methods**,\n**seek in myriad ways**,\napplying **heterodox and perverse techniques (邪异施)**—\nusing **substances devoid of qi**,\n**shifting with time**,\nand thus **inviting great calamity**.\n\nHow could the world know?\nThe **ultimate precision** does not exceed **holding fast to the One**,\nwhile **establishing principles** does not exceed the **Three Realms**.\n**Mutual generation** does not depart from the **Five Phases (五行)**,\n**concealment** does not depart from **water and fire**.\nThe **principle of correspondence** originates from **the One**.\n\nWhen **two complementary forces (两情)** are **paired**—\n**capable as husband, capable as wife**—\n**yin at its peak gives rise to yang**,\nand thus **perfect medicine is formed**—\nall such **depend on the Great Yang (太阳)** and **Great Yin (太阴)**.\n\n---\n**Pairing with Lead Essence (铅精) – Twenty-One Names**\n\n**Lead Essence (铅精)**, when used by immortals, has **many names**.\nIf one **knows how to apply it**, one **does not stray from the Way**.\n\n1. **Qiānhuā (铅花)**—\n   the **qi of lead**, capable of **subduing mercury**,\n   though it may **temporarily resist fire**,\n   it ultimately **lacks true completion (了义)**,\n   yet it **dissolves the Three Poisons (三毒)**,\n   **fully transforming into emptiness**.\n\n2. **Qiānjīng (铅精)**—\n   the **silver within lead**,\n   when **combined with mercury medicine**,\n   forms a **kindred substance**—\n   yet **lead’s nature** remains the **great affliction within the elixir**.\n\n3. **Xuánhuáng (玄黄)**—\n   the **essence of lead**,\n   when **united with mercury’s qi**,\n   **preserves the Three Realms**,\n   **unchanging in true nature**,\n   serving as **divine talisman (神符)** and **celestial mirror (天镜)**.\n   When **entered into lead**, it becomes **its sinew and bone**.\n\n4. **Huángyá (黄芽)**—\n   the **yellow bloom of lead**—\n   **yellow bloom** is the **qi of lead**,\n   when **united with mercury**,\n   **retains lead’s form**—\n   this is **Huángyá**.\n\n5. **Fēiqīng (飞轻)**—\n   the **refined essence of lead**,\n   though **extracted and combined with lead**,\n   it is **none other than cinnabar (丹砂)**.\n   When used, one must **know that two kinds share the Great Yang’s qi**—\n   **one must not be lacking**,\n   and they must be **interwoven in application**.\n\n**Heaven’s Canopy (天盖)** resides within lead—\n**Heaven’s Canopy** is the **Pool of Flowers (华池)**,\nand **Pool of Flowers** is the **water foundation**.\n\n6. **Huángjǔ (黄举)**,\n7. **Zǐgēn (紫根)**—\n   these **two names**, when **refined a hundred times**,\n   yield **medicine of absolute purity (绝粒之药)**,\n   whose **effects are immeasurable**.\n\n8. **Huánghuá (黄华)**,\n9. **Héchē (河车)**—\n   these **two names** can **subdue mercury**,\n   circulating **throughout the Microcosmic Orbit (周天)**,\n   **neither distant nor near**, **losing not a single grain**.\n\n10. **Lìzhìshí (立制石)**,\n11. **Qiānjīng (铅精)**,\n12. **Huángqīng (黄轻)**,\n13. **Huánglóng (黄龙)**,\n14. **Fúdān (伏丹)**,\n15. **Huángchí (黄池)**—\n\n**Lìzhìshí (立制石)** is **lead after it sheds its form**, turning **white as stone**,\ncapable of **subduing mercury**,\nbecoming the **supreme medicinal lead essence (至药铅精)**.\nImmortal methods **refine metals and stones**—\nif **poison remains**, it **cannot be ingested**.\n\n**Huángqīng (黄轻)** is another name for **yellow bloom (黄华)**—\nwhen used, it is **as light as bloom (轻华)**,\nyet **capable of heavy application**.\nIt can **transform yellow and white substances into treasure**.\n\n**Huánglóng (黄龙)** and **Fúdān (伏丹)** are alternate names for **lead bloom (铅华)**.»",
      "overlap_context": " **yellow color (黄色)**.\nIf one seeks **Crimson Phoenix Sinew (朱雀筋)**,\nthe **fresh yellow (黄新)** is unfit for **major use (大用)***,\nand its **power is weak (力又薄)**.\nThe common folk, seeing this,\n**contend it is fine Realgar (争言云好雄黄)***—\nthis is greatly mistaken.\nIf one **merely combines it with herbal elixirs (合草药小丹方)***,\nit may **serve minor purposes (任意用得)**.\nYet for **great, rational applications (入理大用)***,\nor to **subdue, refine, and transmute (拟制伏变化)***,\nit is **indeed unfit for use (实未堪用)**.",
      "start_char": 4343,
      "end_char": 5582,
      "start_sentence": 202,
      "end_sentence": 250,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 27.99519968032837,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\阴真君金石五相类.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "黄池是修铅之异名。 已上并是诸杂丹方回名立字，古仙流行制汞之方，以得当年之号，亦不上实录。 十六金公，十七假公黄，十八木锡，十九飞雄，二十太素金，二十一天玄。 已上并出《神符录丹术大道记》中。 金公者，铅之别名。 兼本州土人，用，要知当用勿错。 假公黄者，是铅已出银并华了，谓无精华，不堪用。 木锡是铅之精华，堪入汞为至药，不失其道。 飞雄者，是铅入太阳，成纯阳，可作鼎。 亦炁银之类。 木锡、飞雄二名，并是神符，录丹术不得失铅精，炁魄合数。 铅本是银质，银本是铅胎。 阴主太阳，阳主太阴，阴中之阳，是铅含银精。 阳中之阴，是朱砂怀水银之炁。 若相配类，总名胎息之炁，未见成宝之位。 若能解用之意即润，又成之则无象。 三才必备，四象不伤，全炁而行，於其大道。 若巧计用意，取无炁之物，相配成丹，自大误矣。 三灵丹秘诀云； 所用铅炁合元，事须体全，如人交合，采少女之炁，须合本体，所以配类阴阳二性，主客两情，亲不亲之，得不得之，两仪相类，道德展转。 后学用以不用，任情而为。 我终不敢随意而行也。",
      "translated_text": "The **Huángchí (黄池)** is another name for **refining lead (修铅)**.\n\nThe above are all **various names for lead in alchemical formulas (诸杂丹方回名立字)**.\nAncient Daoists practiced methods of **subduing mercury (制汞)**,\nearning their **yearly titles (当年之号)**,\nyet these were **never recorded in official annals (不上实录)**.\n\n16. **Jīngōng (金公)**,\n17. **Jiǎgōnghuáng (假公黄)**,\n18. **Mùxī (木锡)**,\n19. **Fēixióng (飞雄)**,\n20. **Tàisùjīn (太素金)**,\n21. **Tiānxuán (天玄)**—\n\nAll the above are **extracted from the *Divine Symbols Recorded Alchemical Dao/Way (神符录丹术大道记)***.\n\n**Jīngōng (金公)** is another name for **lead (铅)**.\nMoreover, **native lead of this region (本州土人)** must be used—\n**one must know the proper application and not err**.\n\n**Jiǎgōnghuáng (假公黄)** refers to **lead that has already produced silver and bloom (已出银并华了)**—\nit is said to **lack purity and essence (无精华)**, making it **unfit for use (不堪用)**.\n\n**Mùxī (木锡)** is the **refined essence of lead (铅之精华)**,\ncapable of **entering mercury as supreme medicinal lead (入汞为至药)**,\n**preserving its Dao/Way (不失其道)**.\n\n**Fēixióng (飞雄)** is **lead entering the Great Yang (太阳)**,\nbecoming **pure Yang (纯阳)**,\nand **can be forged into a cauldron (可作鼎)**.\nIt is also **akin to the *qi* of silver (炁银之类)**.\n\nThe names **Mùxī (木锡)** and **Fēixióng (飞雄)**,\nboth **Divine Symbols (神符)**,\nare recorded in the alchemical Dao/Way—\n**one must not lose the essence of lead (不得失铅精)**,\nand **the *qi* and spirit must be harmonized (炁魄合数)**.\n\n**Lead is fundamentally silver in nature (铅本是银质)**,\nwhile **silver is fundamentally lead in spirit (银本是铅胎)**.\n**Yin governs the Great Yang (太阳)**,\nwhile **Yang governs the Great Yin (太阴)**.\n**The Yang within Yin (阴中之阳)** is **lead containing silver essence (铅含银精)**.\n**The Yin within Yang (阳中之阴)** is **cinnabar embracing the *qi* of water-silver (朱砂怀水银之炁)**.\n\nIf **they are paired according to their kind (相配类)**,\nthey are collectively called **the *qi* of embryo and breath (胎息之炁)**,\nyet **they have not yet reached the rank of treasure (未见成宝之位)**.\n\nIf **one can grasp their intended use (解用之意)**, then **moistening (润)** them,\n**they become formless (无象)** when **properly transformed (成之)**.\n\n**The Three Treasures must be complete (三才必备)**,\n**the Four Symbols must remain unharmed (四象不伤)**,\n**preserving the *qi* in its entirety (全炁而行)**,\n**thus aligning with the Great Dao/Way (於其大道)**.\n\nIf **one cleverly misapplies their intent (巧计用意)**,\ntaking **formless substances (无炁之物)**,\nand **pairing them to forge an elixir (相配成丹)**,\n**one will fall into grave error (自大误矣)**.\n\nThe **secret key to the Three Spirits Elixir (三灵丹秘诀)** states:\n**The lead *qi* must be united with the primordial (铅炁合元)**,\n**the process must be fully embodied (事须体全)**,\n**like a man and woman in union (如人交合)**,\n**extracting the *qi* of a maiden (采少女之炁)**,\n**must merge with the original body (须合本体)**.\nThus, **pairing their kinds, Yin and Yang’s dual nature (配类阴阳二性)**,\n**the host and guest’s mutual affinity (主客两情)**,\n**whether they are close or not (亲不亲之)**,\n**whether they are obtained or not (得不得之)**,\n**the Two Principles must correspond in kind (两仪相类)**,\n**and the Dao/Way and virtue must transform cyclically (道德展转)**.\n\nLater disciples **use without understanding (用以不用)**,\n**act arbitrarily (任情而为)**.\nI **dare not proceed without proper intent (终不敢随意而行也)**.",
      "overlap_context": "**white as stone**,\ncapable of **subduing mercury**,\nbecoming the **supreme medicinal lead essence (至药铅精)**.\nImmortal methods **refine metals and stones**—\nif **poison remains**, it **cannot be ingested**.\n\n**Huángqīng (黄轻)** is another name for **yellow bloom (黄华)**—\nwhen used, it is **as light as bloom (轻华)**,\nyet **capable of heavy application**.\nIt can **transform yellow and white substances into treasure**.\n\n**Huánglóng (黄龙)** and **Fúdān (伏丹)** are alternate names for **lead bloom (铅华)**.»",
      "start_char": 5582,
      "end_char": 6014,
      "start_sentence": 251,
      "end_sentence": 272,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 14.334933042526245,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\阴真君金石五相类.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "太素金，又名铅白，一日丹地黄。 其名从胡粉中化为铅白，又名青金，亦太素金之别名。 其名配太阳，同和炼，泻成汁出，为青丹天玄，又名伏玄丹。 其名以铅华为华池，入水银为华华汁，合入鼎烧成药，余杂铅浆汁，亦无用处。 右已上配铅精了义，铅功最大，神化无穷。 自是浅见其道，不能求之真理，妄为穿凿，辄将他物，染我纯粹之体精。 欲求至理者，要在求其真铅，勿令错杂。 配合白丹砂相类门第七六名 一名天生芽丹砂者，是白丹砂。 伏元神炁太阳者，号自然之炁。 含火之精，名曰灵砂，众砂之芽长，有说自丹书《黄录记》中云：真丹砂色如真珠，乃真人立名真珠砂，亦名天生芽。 直下制汞，更不别用药。 水银得此芽，见火无问多少并伏火。 能变乾水银为利，炼至金色。 能化五金成宝。 二名仙砂。 仙人本无药为药质，亦未有造化之器为鼎鳌，即取此白砂为服食，遂得长生。 亦不烧炼至水银为丹药，故仙人立号为白丹砂。 是天生芽也。 三名朱乌砂，其砂出自离宫南方，属火，因方而立号焉。 四名汞砂，其名未赤之象，洁白成砂，因此为名汞砂。 五名石脾砂，其砂出於石床夹石床带，白色，砂同石色是也。 六名赤帝卤咸，南方是赤帝位，出砂之象，如颗盐白色，以象其名，就方取号。 仙人所置，各各不同。 配金相类门第八四名 一名庚辛白金，金数四，乃有四名。 元本无象，以西方庚辛为象。 可知大道仙人神化，以炁配合，相类成质。 亦未知水银出金水中，黄金不堪作丹。 仙人指象立谕，不可知悬数。 庚辛白金，实非水中金而成质，即是自然气而成质，岂不因炁成大造化之金宝。 非吹砂金而成象，乃服积金而成神化之身。 故知大道至幽灵隐，寻常之流莫能探测耳。 二太素金，其名乃始初之名。 三束方日阳，四卯木青金，从三皇号，黄帝后立名。 束方日阳，兼名男左，为卯木青金，皆凭仙人制造，各立一名。 三皇相类，配合西方，后太上诣流沙，采真铅炼化成药，皆起自庚辛之教。 是我大道元始君之垂法象，以世人本非自有法象而成金质，是服积金而成灵化之身。 后至龟甲元年，为帝位递相煞伐，时代灭亡，仙人归天，不同助理，人世暂绝元教，并无神化之金，可为至药。 后至龟甲上元元年，有仙人娄敬指，托水砂采金，可为至药，凿阴山，采其银矿，取白金，生民劳苦，不可胜计。 为世帝行无道，君臣不睦，兆人怨上，遂使世绝道教，有是有非，以煞止煞，人流亡於平野，成怨天道耳。 自后遇仙人出世，隐於市朝，渐化世人，灵金遂显，人渐乐药，视金宝如灰土，天下太平，人不怨天道矣。 上古天地始分，未有金木水火土五行相配，亦无巧伪万端，人执淳朴，圣人在上，仙教奉行。 自后黄帝制甲历，竺（子推五行，亦不知上古谁人起初。 推求至药，以救生灵，皆云三皇所造。 当时无可依信，绿文字未生。 后成道者，皆赖避世。 仙人垂法遗教，即药有名号，载于实录。 后人修练得道者，亦不可胜计。 按实录古之明帝，先得至药，后传宝位，迤迩相推，泊至夏后氏禹。 求人太速，不待诸侯之宝，得益而卒。 授之天下，益事禹日浅，於诸侯未洽，宝位遂归於启，而帝王至药，绝於世矣。",
      "translated_text": "The **Primeval Lead**, also called *Tàisù Jīn* (太素金), or **Dan Earth Yellow**, is refined from *húfěn* (胡粉) transformed into *qiān bái* (铅白). It is also named *Qīngjīn* (青金), another appellation for *Tàisù Jīn*. Its name aligns with the **Great Yang** (太阳), harmonized and refined through alchemical processes. When drained, it yields a **Celestial Indigo Elixir (青丹天玄)**, also called the **Suppressed Indigo Elixir (伏玄丹)**.\n\nIts preparation involves using *qiān huā* (铅华) as the **Flower Pool**, into which *shuǐyín* (水银) is introduced as the **Double Flower Elixir**. When fused in the crucible and burned into medicine, any residual *qiān jiāng* (铅浆) is of no use.\n\nThe above describes the **refined essence of lead (铅精)**, whose alchemical function is supreme and whose transformations are boundless. Those of shallow understanding grasp only its outward form, unable to seek its true essence. They recklessly adulterate it with foreign substances, corrupting its pure and refined essence.\n\nThose who seek ultimate truth must pursue **true lead (真铅)**, ensuring no impurities are mixed.\n\n---\n**Pairing with White Cinnabar (白丹砂) – Seventh and Sixth Classifications**\n\n1. **Heaven-Born Sprout Cinnabar (天生芽丹砂)**, known as **White Cinnabar (白丹砂)**.\n   The **Suppressed Primordial Spirit-Qi of the Great Yang (伏元神炁太阳)** is called **Natural Qi (自然之炁)**.\n   It contains the **Essence of Fire (含火之精)**, named **Spiritual Cinnabar (灵砂)**. Among all cinnabars, its sprouts grow longest. As recorded in the *Dan Book* (丹书) *Huáng Lù Jì* (黄录记):\n   *\"True cinnabar resembles true pearls; thus, the Immortals named it **True Pearl Cinnabar (真珠砂)**, also called **Heaven-Born Sprout (天生芽)**.\"*\n\n   Directly refining *gōng* (汞/mercury) without additional medicines, this cinnabar, when applied, causes mercury—regardless of quantity—to **suppress fire** upon exposure. It can **transform barren mercury into efficacy**, refining it to a golden hue. It can also **transmute the Five Metals into treasure**.\n\n2. **Immortal Cinnabar (仙砂)**.\n   Immortals require no external medicines for their elixir substance, nor do they use artificial crucibles or tripods. They simply ingest this white cinnabar to achieve longevity. They do not refine mercury into an elixir; thus, Immortals designate it as **White Cinnabar (白丹砂)**—the **Heaven-Born Sprout**.\n\n3. **Vermilion Black Cinnabar (朱乌砂)**.\n   This cinnabar originates from the **Southern Palace of the Fire Deity (离宫南方)**, belonging to Fire. Its name derives from its association with the Southern direction.\n\n4. **Mercury Cinnabar (汞砂)**.\n   Named for its unoxidized, pristine white form resembling sand.\n\n5. **Stone Spleen Cinnabar (石脾砂)**.\n   This cinnabar is found in **stone beds (石床)** or between layered stones, appearing white and resembling stone in color.\n\n6. **Red Emperor’s Salt (赤帝卤咸)**.\n   The Southern direction belongs to the **Red Emperor (赤帝)**. This cinnabar resembles white grains of salt, symbolizing its name. Immortals classify it differently.\n\n---\n**Pairing with Gold (金) – Eighth and Fourth Classifications**\n\n1. **Regal White Gold (庚辛白金)**.\n   Gold is numbered four, hence its four names. Originally formless, it is symbolized by the **Western direction (西方)**, associated with *Gēng* (庚) and *Xīn* (辛).\n   Thus, one understands the **Immortal Dao’s divine transformations**, where *qi* is paired and refined to form substances. It is unclear whether mercury originates from **golden water** or if gold itself is unfit for elixir-making. The Immortals’ symbolic teachings cannot be measured by conventional logic.\n\n   **Regal White Gold (庚辛白金)** is not formed from metallic gold but from **natural *qi*, creating a treasure of great transformation**. It is not artificial gold but the accumulation of ingested gold, refining the body into a **divine, transformed essence**. Thus, the **Great Dao is profound and mysterious**, beyond the grasp of ordinary minds.\n\n2. **Primeval Lead (太素金)**—its name reflects its original essence.\n3. **束方 Day-Sun (束方日阳)**.\n4. **Mao Wood Green-Gold (卯木青金)**—named after the **Three Sovereigns**, with Huangdi later establishing its title.\n   *束方 Day-Sun* is also called **Male Left (男左)**, representing **Mao Wood Green-Gold (卯木青金)**, all crafted by Immortals under distinct names.\n\nThe **Three Sovereigns** paired with the Western direction. Later, the **Great Sage (太上)** traveled to the **Flowing Sands (流沙)**, refining true lead into medicine, all originating from the teachings of *Gēng* and *Xīn*.\n\nThis is the **law of the Primordial Lord (元始君)**, who established symbols for humanity, who otherwise could not naturally form metallic substances. Thus, through ingesting gold, one achieves a **spiritually transformed body**.\n\nLater, in the **Year of the Tortoise Shell (龟甲元年)**, the **Emperor’s succession was disrupted by violent upheaval**, leading to the decline of the age and the Immortals’ withdrawal. The human world temporarily lost the **Primordial Teachings (元教)**, and no divine-transformed gold existed as an ultimate elixir.\n\nIn the **Year of the Tortoise Shell’s Upper Primordial (龟甲上元元年)**, the Immortal **Lóu Jìng (娄敬)** instructed the use of **water sand (水砂)** to extract gold for elixir-making. He excavated **Yīn Mountain (阴山)**, mining silver ore and extracting **white gold**, causing immense labor for the people. Due to the **tyrannical rule of the worldly emperor**, the lack of harmony between ruler and subjects, and the people’s resentment, the **Dao was severed**, and the **teachings of life and death were disrupted**. The people fled to the plains, blaming the **Heavenly Dao**.\n\nAfterward, when Immortals descended into the world, hiding among mortals, they gradually transformed society. **Divine gold (灵金)** emerged, and people came to enjoy medicines, valuing gold and treasures as mere dust. The world achieved great peace, and the people no longer resented the **Heavenly Dao**.\n\n---\nIn the **Highest Antiquity**, when Heaven and Earth first divided, the **Five Phases (金木水火土)** had not yet aligned, nor had deceitful artifices arisen. People lived in simplicity, and the **Sages governed above**, the **Immortal Teachings** faithfully observed.\n\nLater, **Huangdi established the calendar and the Five Phases**—though it is unclear who first systematized them in antiquity. Seeking the **ultimate elixir to save lives**, all claimed the **Three Sovereigns** had created it. At the time, there were no reliable records, and **green inscriptions (绿文字)** had not yet appeared. Later, those who attained the Dao relied on **seclusion from the world**.\n\nThe Immortals left behind **laws and teachings**, naming medicines and recording them in **verifiable annals**. Countless later practitioners refined and attained the Dao.\n\nAccording to ancient records, **Emperor Míng (明帝)** first obtained the **ultimate elixir**, then passed the **Treasure of the Throne** downward. Eventually, it reached **Yu of Xia (夏禹)**. The **people’s desires were too hasty**; Yu did not await the **treasures of the feudal lords**, and though he benefited from the elixir, his reign was too brief to fully harmonize with the lords. Thus, the **Treasure of the Throne** passed to **Qǐ (启)**, and the **Imperial elixir tradition vanished from the world**.",
      "overlap_context": "rge with the original body (须合本体)**.\nThus, **pairing their kinds, Yin and Yang’s dual nature (配类阴阳二性)**,\n**the host and guest’s mutual affinity (主客两情)**,\n**whether they are close or not (亲不亲之)**,\n**whether they are obtained or not (得不得之)**,\n**the Two Principles must correspond in kind (两仪相类)**,\n**and the Dao/Way and virtue must transform cyclically (道德展转)**.\n\nLater disciples **use without understanding (用以不用)**,\n**act arbitrarily (任情而为)**.\nI **dare not proceed without proper intent (终不敢随意而行也)**.",
      "start_char": 6014,
      "end_char": 7256,
      "start_sentence": 273,
      "end_sentence": 324,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 22.218223571777344,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\阴真君金石五相类.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "虽然臣下多得之，隐而不显，或处市朝，或秘山林，乐道者一时观至宝焉，非人问土石水砂所出也。 后学者切要知我识我，玄元大造化之金也。 配合确砂相类门第九五名 一名狙砂，其物出於阴山，积冰凝之，结水变成也。 二名赤狙砂，带赤色者，老壮堪用，无物不利。 三名炮砂，此砂人不解用，兼不知来处，损物坏人。 四名白海砂，其砂咸，如海水结成，绿北庭凝寒之地，状如白雪，土咸如卤，故号白海砂，实堪服食，为至药。 五名五金贼，其名因化五金，始知是贼。 若解用则五金不坏，若不解用是物必坏。 其砂若相类用之，不得过甚，但得力即止，过多即损物。 如人要服食，疾愈即休。 欲求他力，多服之，即必速死，何也。 此砂出自毒山，积阴之熙，而凝结成砂。 若劫力则得物成之后，宜退之。 若用过多，所服必死，速坏五藏，五金必败，万万如此矣。 若得其妙理识我真确砂，仙人用之通大道。 配合口硝石相类门第十四名 一名硝石，是秋石阴石也。 出积寒凝霜之土地而生，取此霜土，煎炼淋漓如法结成，亦如煮水成盥。 然用处各别，绿性较寒，取北方坎子为炁，积阴而用，制阳之毒。 上古仙人将制物，兼化五金成宝，假合成道。 二名北帝玄珠，其源采北方之炁，化成玄珠，是冰霜之炁，与炮砂相邻，作法则又与炮砂性不同。 确砂能导引诸药，硝石能制伏之，是其性不同也。 确砂是阳石炁，硝石是阴石炁。 三名乌头，其名因秋叶黄落时霜始降，因而得名，是草枯之意。 四名黄乌首，时疡北向，首迎霜，而采之。 仙人用制巨阳之大毒，故列名相类，与圣道抗行，作世利之门，而用即通。 此间之妙也。 偏治女人血炁块。 配合空青相类门第十一 三名 一名空青，色带雌，如阴中之炁，带雌配类，西方之炁象，乃西方庚辛金，白虎之炁也。 绿曾青配类，束方甲乙木雄，乃东方甲乙木精，青龙之炁也。 空青象西方庚辛金，金木相化，木之炁克於金，而怀金性。 二事名一，用类不同。 曾青能制伏水银，为使属阳，乃雄。 空青性弱体空，遂名空青，属阴。 乃雌能感曾青之炁，而成制药也。 如世上空青杂用，及合诸服食药，总得即不堪对。 水银定伏，三黄为使，用即乖矣。 二名青腰中女，其名中女，谓不同水银之炁，与水银同和，无男太阳之力，故得中女之名也。 三名青砂，乃空青中心空忽，有怀一银星子，中有一粒，青如麻子大，可以为至药，服食便得长生。 亦名玄珠，又名为玄砂。 若分配合造药物，不得其门，妄施劳力。 知者不妄，空青中还丹自然之药，仙士知之，服而不死。 空青有银星子，乃阴，是雌。 曾青中有金星子，乃阳，是雄。 能为水银之使，可以定服三黄之大，诀也。 空中青子，为天生芽，自然神丹也。 配合闷黄芽真性相类门第十二四名 一名黄芽铅，能制汞，谓之黄芽。 其铅须三才全不损伤者，可为黄芽。 将制汞，先白后黄，转成五彩色，各执一方，始为芽，全其大道之功。 二名白丹砂，是为黄芽。 其白丹砂，是朱乌真胎体之骨，直下制汞，为道初地，力通神化。 先白后带黄晕，后复五方之色，得其兑，兑是庚辛金之药，化汞变成象也。 经云：采铅之精炁，为天生芽。 三名硫黄，亦名黄芽。",
      "translated_text": "Although many subjects attained it, they concealed their knowledge—some dwelling in the marketplace, others in secluded mountains and forests. Those who delighted in the Dao once glimpsed the **Ultimate Treasure**, yet it was not derived from earth, stone, water, or sand.\n\nLater scholars must **know and recognize** it: the **Primordial Golden Transformation**’s essence. **True cinnabar (确砂)**—classified under *Similarity of the Ninth and Fifth*—has several forms:\n\n1. **True cinnabar (确砂)**, whose origin lies in the **Yinshan Mountains**, where accumulated ice congeals into structured water, forming sand.\n2. **Red true cinnabar (赤狙砂)**, bearing a reddish hue—whether aged or fresh, it benefits all things without harm.\n3. **Cannon sand (炮砂)**, which people neither understand nor know its source; it damages substances and harms the body.\n4. **White sea sand (白海砂)**, a saline sand resembling frozen seawater, found in the **glacial north** (绿北庭), resembling white snow, with an earthly taste like brine—thus named. It is **fit for ingestion** and serves as the **Ultimate Elixir**.\n5. **Five Metals’ Thief (五金贼)**, so named because it **corrupts the Five Metals**. If used correctly, the metals remain unharmed; if misused, they are ruined. When applied in moderation, it yields strength—but overuse **destroys the body’s organs**, weakens the Five Metals, and brings swift death. This sand originates from **Poison Mountain**, where accumulated **yin-qi** congeals into its form. If forced, it must be withdrawn after formation; excessive use **guarantees death**, swiftly ravaging the **Five Viscera** and the Five Metals.\n\nThose who grasp its **mysterious principle** and recognize **True Cinnabar** attain the Dao through its use.\n\n---\n**Pairing with Niter (口硝石)**—classified under *Similarity of the Fourteenth*—has four forms:\n\n1. **Niter (硝石)**, the **Autumn Stone**, a **Yin Stone**, born from lands where **accumulated cold congeals frost**. This frost-earth is refined by boiling and distilling until it solidifies like **coagulated water**. Its applications differ: its **green nature** is cold, drawing **Kan-qi (北方坎子)** from the North, accumulating **yin** to subdue **yang’s toxicity**. Ancient Immortals used it to **refine substances**, transmute the Five Metals into treasure, and **forge the Dao through alchemical union**.\n2. **Northern Emperor’s Mysterious Pearl (北帝玄珠)**, sourced from the **Northern qi**, transformed into a pearl of **ice-frost essence**, adjacent to **Cannon Sand** yet differing in application. **True Cinnabar** guides other medicines, while **Niter** subdues them—each possessing distinct natures. **True Cinnabar** is **yang-stone qi**; **Niter** is **yin-stone qi**.\n3. **Aconite (乌头)**, named for the **yellowing autumn leaves** when frost first descends—symbolizing **withered grass**. Its variant,\n4. **Yellow Aconite (黄乌首)**, is harvested when **ulcers face north**, its head **welcoming the frost**. Immortals used it to **counter Giant Yang’s great toxicity**, thus ranking it among **sacred Daoist practices**, opposing **saintly virtue** yet aiding worldly benefit when applied correctly—its **mystery lies here**. It **specifically treats women’s stagnant blood-qi**.\n\n---\n**Pairing with Orpiment (空青)**—classified under *Similarity of the Eleventh*—has three forms:\n\n1. **Orpiment (空青)**, bearing a **feminine hue**, embodying **yin-qi** like the **West’s essence**—the **Regent and Xīn Metals (庚辛金)**, the **White Tiger’s qi**. **Green verdigris (曾青)**, by contrast, aligns with **Jia-Yǐ Wood (甲乙木)**, the **East’s essence**, the **Green Dragon’s qi**. Orpiment mirrors the **West’s Regent-Xīn Metals**, where **Wood-qi overcomes Metal**, yet it retains **Metal’s nature**. Though two names, their uses differ. **Verdigris subdues mercury**, acting as a **yang-messenger (使属阳)**, thus **masculine**. Orpiment’s **weak, hollow nature** earns its name, being **yin—feminine**. It **responds to verdigris’ qi**, enabling alchemical mastery. If **Orpiment is carelessly mixed** with other elixirs, it **fails to harmonize**. Once mercury is **fixed**, the **Three Yellows (三黄)** serve as messengers—but their union **becomes discordant**.\n2. **Midriff’s Maiden (青腰中女)**, named for its **non-mercury qi**, blending with mercury yet lacking **Male Taiyang’s force**, hence its **feminine designation**.\n3. **Green Sand (青砂)**, Orpiment’s **central hollow**, containing a **silver star**—a single grain, **pea-sized and green**, serving as the **Ultimate Elixir**. Ingesting it grants **longevity**. Also called **Mysterious Pearl (玄珠)** or **Mysterious Sand (玄砂)**. Without proper **alchemical pairing**, reckless labor yields nothing. The wise know that **Orpiment’s inner elixir** is **naturally formed**; Immortals who consume it **do not die**. Orpiment’s **silver star** is **yin—feminine**; **Verdigris’ gold star** is **yang—masculine**. It **commands mercury**, capable of **subduing the Three Yellows’ might**—the **secret technique**. The **Orpiment’s inner seed** is **heaven-born**, a **natural divine elixir**.\n\n---\n**Pairing with Sulfur (闷黄芽真性)**—classified under *Similarity of the Twelfth*—has four forms:\n\n1. **Yellow Sprout Lead (黄芽铅)**, which **subdues mercury**, earning its name. The lead must be **unblemished by the Three Talents (三才)** to qualify. When refining mercury, it first **whitens**, then **yellows**, shifting through **Five Colors**, each governing a direction—only then does it **sprout**, fulfilling the **Great Dao’s function**.\n2. **White Cinnabar Sand (白丹砂)**, another name for **Yellow Sprout**. This **White Cinnabar Sand** is the **true embryo of Vermilion Ape (朱乌)**, its **skeletal essence** directly subduing mercury—marking the **initial stage of the Dao**, its power **transcending mortal limits**. It first **whitens**, then **glows yellow**, before manifesting the **Five Directions’ hues**, achieving **harmony (兑)**—the **Regent-Xīn Metals’ medicine**, transforming mercury into its **symbolic form**. The classics state: *\"Extracting lead’s refined qi yields the **heaven-born sprout**.\"*\n3. **Sulfur (硫黄)**, also called **Yellow Sprout**.",
      "overlap_context": "ing to ancient records, **Emperor Míng (明帝)** first obtained the **ultimate elixir**, then passed the **Treasure of the Throne** downward. Eventually, it reached **Yu of Xia (夏禹)**. The **people’s desires were too hasty**; Yu did not await the **treasures of the feudal lords**, and though he benefited from the elixir, his reign was too brief to fully harmonize with the lords. Thus, the **Treasure of the Throne** passed to **Qǐ (启)**, and the **Imperial elixir tradition vanished from the world**.",
      "start_char": 7256,
      "end_char": 8522,
      "start_sentence": 325,
      "end_sentence": 381,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 21.62745475769043,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\阴真君金石五相类.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "其硫黄用制汞，虽然暂住，终久还走。 不断鬼焰，毒炁常在，汞炁怀病，或暂得伏火，终不堪服，止疗病可也。 异类不同种，无延驻之功，终害人也。 歌日：天生芽，白丹砂，合二炁，同一家。 路不错，入神华，道在此，是河车。 四名铅黄华白丹芽，其铅中有银，所以因法而采之，得银之精炁，号曰白丹芽。 白丹芽者，是炁结成胎，银精是也。 其银精炁，制伏水银为药，有神仙之道。 如用之不得损其三才，兼不失其炁力。 歌曰：铅黄芽，全三华，采我炁，结成砂。 初门白，运火加，轮五彩，起云霞。 曾青为使，大道无邪，三者备，是仙家。 夫芽者，禀天地人三才，全名为芽。 芽含天地之炁，成万类而生，其根绵绵不断，号之曰芽也。 其白丹砂，本是水银之宝精，如用之制水银，如君如臣，无不相禀也。 其水银准年数变成朱砂，从朱砂变成金，从金变成白虎，四千年之石液也。 唯仙教亦多不定，得其形神，亦自变改，即未号真丹砂，绿水银性不定也。 唯我白朱砂，仙人号曰玄元砂者，盖为万载不易。 其元白之性，与水银有殊。 其砂犹如世国主，虽是人体，炁与凡人不同，生杀在手，变化在心，其白丹砂亦复如此，始知此砂是玄元之首。 其砂非宿有仙道者，采之不可得也。 如诸道士，要成天生芽者，须求玄元砂，即是天生芽，白丹砂也。 近地不生，生在远山。 山有坎离之穴，道士不能深入，采我玄元，莫测丹之浅深，只取锦州朱砂成颗者，以法抽晕，却归旧体，伏火不损其道，亦名为黄芽。 递相承制汞，如臣见君，如火见薪，如风得云，未有不伏者也。 然成丹之后，不堪服食。 或能制为世利，或偶以愈疾，终无出世之功，自可验也。 服经一二年后，男子阳道俱绝，盖纯阴之所积故也。 后学同志，但依古教，若采得此砂服食，无不成道。 绿白丹砂，自然之药。 法有三才，以天地为炉，四时为炭，经水过火，历劫而成质焉。 道士须知，妙道不远矣。 如得此砂服食，但去却夹石，研炼如粉面，九蒸为度，研及百过如缅，以枣禳或烂饭为丸，丸如蒙豆大，日服一丸，不得过，其炁如服。 经一二年问，方有出世之功。 未闲观之，与常人不同。 精光耀日，炁自明达。 凡至道之理，只在含精返本，资神炁也。 采其真液，却归元祖，填其血脑，自然老而复少，枯而复荣。 故经日：胡粉投炭火，色坏还为铅。 冰雪入温汤，解释成太玄。 且胡粉本铅烧成，再炼之却归铅体。 冰雪本是水结成，得温暖之炁还归水质。 人本年少，得至精而服食，返其童颜，还归少质。 此前贤古圣，殷勤教谕同志之士也。 亦哀悯当世之人，贪生失理，夭枉於声色，衰悴於滋味，所以元炁渐衰，大期奄至。 故孜孜着论，以警将来者耳。 我玄元大圣，文武神化之丹，不过黄芽真性，是玄元之教。 所以黄芽一字，不可意求，未可法则。 天仙秘术，古人传之，须在口诀，递递为师，不可轻泄。 若此不得其妙理，不可妄起异端之心也。 配合丹铅魂相类门第十三 曾青铅是水银之魂，水银是曾青之魄。 白丹砂、天生芽是水银之天魂，无水银之精魄，硫黄是水银之冤魂，隐水银之横魄。 雄黄、雌黄、毗黄、硝石、炮砂、太阴玄精石、空青并矾石，各禀炁成形，都与仙术不合，魂魄不相类，其道不同。",
      "translated_text": "The **Sulfur (硫黄)** used to subdue mercury is indeed temporary—though it may dwell, it ultimately **flee**. If the **Ghost Flame (鬼焰)** is not severed, the **poisonous qi (毒炁)** lingers, and mercury remains afflicted. Even if one briefly **overcomes the fire (伏火)**, it is still **unbearable to ingest (不堪服)**, and only **treatments for illness (疗病)** may suffice. Different substances belong to distinct lineages—none can **prolong the dwelling (延驻)**; they will **harm in the end (终害人)**.\n\nThe verse says:\n*\"Heaven-born sprout (天生芽), White Cinnabar Sand (白丹砂),\nUniting the two **qi (炁)**, as one kin (一家).\nNo deviation in the path (路不错), entering **Divine Transformation (神华)**—\nThe Dao lies here (道在此), this is the **River Vehicle (河车)**.\"*\n\nThe **Fourth Name: Lead-Yellow Flower White Cinnabar Sprout (铅黄华白丹芽)**—within lead, there is silver, hence its extraction by method. Obtaining silver’s **refined qi (精炁)**, it is called **White Cinnabar Sprout (白丹芽)**. **White Cinnabar Sprout (白丹芽)** is the **embryo formed by qi (炁结成胎)**, the essence of silver. Its **silver’s refined qi (银精炁)** subdues mercury as medicine, embodying the **Dao of Immortals (神仙之道)**. If used without harming the **Three Powers (三才)** and preserving its **qi-force (炁力)**, the verse declares:\n*\"Lead-Yellow Sprout (铅黄芽), perfecting the **Three Flowers (三华)**,\nExtract my **qi (炁)**, forming the Sand (结成砂).\nInitially white (初门白), refining fire (运火加),\nCycling the **Five Colors (轮五彩)**, rising like clouds and mists (起云霞).\n**Green Vitriol (曾青)** as the agent—\nThe **Great Dao (大道)** knows no deceit (无邪),\nWith three complete, it is the **family of Immortals (仙家)**.\"*\n\nThe **Sprout (芽)**, born of **Heaven, Earth, and Humanity (天地人三才)**, is fully named as such. The **Sprout (芽)** contains the **qi of Heaven and Earth (天地之炁)**, giving rise to all **ten thousand forms (万类)**. Its root is **unbroken and continuous (绵绵不断)**, hence it is called **Sprout (芽)**.\n\n**White Cinnabar Sand (白丹砂)** is the **precious essence (宝精)** of mercury. When used to subdue mercury, it acts as **lord and minister (如君如臣)**—none can fail to **respond (相禀)**. Mercury, over **four thousand years (四千年)**, transforms into **Cinnabar (朱砂)**, then into **gold (金)**, and finally into **White Tiger (白虎)**, the **stone-fluid (石液)** of ages. Yet even the **Immortal Teachings (仙教)** often vary—when one attains its **form and spirit (形神)**, it too **shifts and changes (变改)**. Before it is named **True Cinnabar Sand (真丹砂)**, the **green mercury (绿水银)** remains unstable in nature.\n\nOnly **White Cinnabar Sand (白朱砂)**, called by Immortals **Primordial Origin Sand (玄元砂)**, endures **ten thousand years (万载)** without alteration. Its **Primordial White nature (元白之性)** differs from mercury’s. The **Sand (砂)** is like a **worldly ruler (世国主)**—though human in form, its **qi (炁)** differs from the common. **Life and death are in its grasp (生杀在手)**, and **transformation is in its mind (变化在心)**. So too with **White Cinnabar Sand (白丹砂)**—only then does one know this **Sand (砂)** is the **Primordial Origin’s beginning (玄元之首)**.\n\nNone but those who **already possess Immortal Dao (宿有仙道者)** can obtain it by extraction. If alchemists wish to **attain the Heaven-born Sprout (天生芽)**, they must seek **Primordial Origin Sand (玄元砂)**—which is precisely the **Heaven-born Sprout (天生芽)** and **White Cinnabar Sand (白丹砂)**. Near the earth it does not grow—it thrives in **distant mountains (远山)**. Mountains hold **Kān-Lǐ caves (坎离之穴)**, yet alchemists cannot penetrate deeply. To extract my **Primordial Origin (玄元)**, one must **fathom the unfathomable depths of the Sand (莫测丹之浅深)**. Only **Jinzhou Cinnabar (锦州朱砂)**, refined into **precious grains (成颗者)**, is taken—by method, its **qi is drawn (抽晕)**, then **restored to its original form (却归旧体)**. **Overcoming the fire (伏火)** without harming the **Dao (道)**, it is also named **Yellow Sprout (黄芽)**.\n\nIt **sequentially subdues mercury (递相承制汞)**—like **minister meeting sovereign (臣见君)**, like **fire encountering kindling (火见薪)**, like **wind meeting clouds (风得云)**—none fails to **be overcome (不伏)**. Yet after **completing the Sand (成丹之后)**, it **cannot be ingested (不堪服食)**. Some may **craft it for worldly gain (制为世利)**, or **偶然 heal ailments (偶以愈疾)**, but it **never fulfills transcendence (终无出世之功)**—this can be **verified (验)**.\n\nAfter **one or two years (一二年)** of ingestion, **men’s yang pathways (阳道)** are **severed (俱绝)**—for **pure yin accumulates (纯阴之所积)**. Fellow seekers of the **Later Teachings (后学同志)**, follow only the **Ancient Teachings (古教)**. If one extracts this **Sand (砂)** and ingests it, **none will fail to attain the Dao (无不成道)**.\n\n**Green and White Cinnabar Sand (绿白丹砂)** is the **medicine of nature (自然之药)**. The method **encompasses the Three Powers (三才)**—using **Heaven and Earth as the furnace (天地为炉)**, the **Four Seasons as fuel (四时为炭)**. **Passing through water and fire (经水过火)**, enduring **kalpas (劫)**, it **refines into substance (成质焉)**. Alchemists must know—**wondrous Dao is not distant (妙道不远)**.\n\nIf one obtains this **Sand (砂)** and ingests it, simply **removing impurities (去却夹石)**, grinding it into **powder (研炼如粉面)**, with **nine steams (蒸)** as the measure. **Grinding it a hundred times (研及百过)**, like **Indian ink (如缅)**, forming **pills with date kernels (枣禳)** or **rotten rice (烂饭)**. The **pills (丸)**, the size of **mung beans (蒙豆)**, are taken **one daily (日服一丸)**—never more. Its **qi (炁)** is as **ingested (如服)**.\n\nAfter **one or two years (一二年)**, one may **attain transcendence (出世之功)**. Before **leisurely observation (闲观)**, it **differs from common folk (与常人不同)**. Its **refined light shines like the sun (精光耀日)**, its **qi (炁)** **naturally luminous (自明达)**.\n\nThe **principles of the Ultimate Dao (至道之理)** lie solely in **containing the essence and returning to the origin (含精返本)**, nourishing the **Divine qi (资神炁)**. Extracting its **true fluid (真液)**, restoring it to the **Primordial Ancestor (元祖)**, filling the **blood and marrow (填其血脑)**, one **naturally grows young again (老而复少)**, **withers and flourishes anew (枯而复荣)**. Thus the classics say:\n*\"Quicklime cast into charcoal fire (胡粉投炭火), its form destroyed, returns as lead (色坏还为铅).\nIce and snow plunged into warm broth (冰雪入温汤), dissolve and become the **Great Mysterious (太玄)**.\"*\n\nMoreover, **quicklime (胡粉)** is **lead burned (铅烧成)**, and **refined again (再炼)**, it **returns to its lead form (却归铅体)**. **Ice and snow (冰雪)** are **water congealed (水结成)**, yet **warmth’s qi (温暖之炁)** restores it to **water’s nature (水质)**. A man **begins young (年少)**, but with **ultimate refinement (至精)** and ingestion, he **reverts to childlike vigor (返其童颜)**, **returning to youthful essence (还归少质)**.\"\n\nThis is the **earnest instruction (殷勤教谕)** of ancient sages to **fellow seekers (同志之士)**. It also **pities this age’s people (哀悯当世之人)**, who **covet life yet lose principle (贪生失理)**, **cut down by sounds and colors (夭枉於声色)**, **withered by tastes and flavors (衰悴於滋味)**—thus their **Primordial qi (元炁)** **gradually decays (渐衰)**, and the **Great Destiny (大期)** **approaches silently (奄至)**. Hence, I **diligently expound (孜孜着论)**, warning those of the **future (将来者)**.\n\nMy **Primordial Origin Great Sage (玄元大圣)** is the **Sand of Martial and Civil Dao (文武神化)**—nothing more than the **true nature of Yellow Sprout (黄芽真性)**—the **Teaching of Primordial Origin (玄元之教)**. Thus, the term **Yellow Sprout (黄芽)** cannot be **sought by will (意求)** or **mastered by method (法则)** alone. **Heavenly Immortal’s secret arts (天仙秘术)** were transmitted by the ancients—**only through oral instructions (口诀)** can one **sequentially learn (递递为师)**. Do not **recklessly reveal (轻泄)** these truths. Without grasping their **marvelous principles (妙理)**, do not **arbitrarily entertain strange thoughts (异端之心)**.\n\n---\n**Chapter Thirteen: Pairing the Sand with Lead—The Doctrine of Their Affinities (配合丹铅魂相类门)**\n**Green Vitriol (曾青)** and **lead (铅)** are the **soul (魂)** of mercury.\nMercury is the **vital breath (魄)** of **Green Vitriol (曾青)**.\n\n**White Cinnabar Sand (白丹砂)** and **Heaven-born Sprout (天生芽)** are the **heavenly soul (天魂)** of mercury—**without mercury’s vital breath (无水银之精魄)**.\n**Sulfur (硫黄)** is the **wronged soul (冤魂)** of mercury—**concealing mercury’s wayward breath (隐水银之横魄)**.\n\n**Realgar (雄黄)**, **Orpiment (雌黄)**, **Arsenic Sulfide (毗黄)**, **Niter (硝石)**, **Calcined Cinnabar (炮砂)**, **Great Yin Mysterious Essence Stone (太阴玄精石)**, **Void Green (空青)**, and **Alum (矾石)**—each **embodies qi to form (各禀炁成形)**—yet **none align with Immortal arts (都与仙术不合)**. Their **souls and breaths do not correspond (魂魄不相类)**, and their **Dao differs (道不同)**.",
      "overlap_context": "rmilion Ape (朱乌)**, its **skeletal essence** directly subduing mercury—marking the **initial stage of the Dao**, its power **transcending mortal limits**. It first **whitens**, then **glows yellow**, before manifesting the **Five Directions’ hues**, achieving **harmony (兑)**—the **Regent-Xīn Metals’ medicine**, transforming mercury into its **symbolic form**. The classics state: *\"Extracting lead’s refined qi yields the **heaven-born sprout**.\"*\n3. **Sulfur (硫黄)**, also called **Yellow Sprout**.",
      "start_char": 8522,
      "end_char": 9769,
      "start_sentence": 382,
      "end_sentence": 435,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 34.845908403396606,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\阴真君金石五相类.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "若相禀者，力不过铅，使不过曾青，功不过水火，失不过杂类。 曾青者，木精也。 铅汞者，金相类也。 三魂，曾青甲乙为第一，木精也。 姥女白丹砂丙丁为第二，朱雀汞也。 铅庚辛为第三，铅银金水芽也。 此三色各有神化之功，能制水银之力。 如得此妙，即不失其仙道焉。 其次硫黄，亦是中仙之道。 用者使其相类为表裹，为臣佐，为炁力，得之者即为中仙，不解用之，即为死士也。 硫黄有大毒，一种名硫黄，乃凡常硫黄也。 我仙家硫黄，能殊别，如大用，如三台之臣，亦能有出世之路，亦能化五金之功，亦有独行一门，救贫之法。 经云：炼如金色，可以点输石成金，不虚。 如大用者，助成仙人神丹胎，无不用之。 用即须无鬼焰。 曾青同本类一色，独有神化之功，引水银之炁，流散百脉。 若独行一门，能化五金为世宝。 用化为液，五金见之，无不变改。 水银一门，仙丹白朱砂宝，是天生芽。 本从水银中生，精神不变，成白朱砂者，始名天生芽。 得此芽，水银无不伏化。 今道士无天生芽，何不借炁而成白丹砂，即同其大造化。 上古仙士立言大造化者，以天地为炉，四时为炭。 若纯妙用，亦同大造化，不在远取其则焉。 然三一相须，其居不同，其致一也。 若种类不同，用意参差，分两有异，即如何解摘，唯我神化秘术，信心所从。 配合神丹宫相类门第十四 三魂，水银灵魄，成三品神仙之丹。 从三一起，分别道元，为一。 一生二，二生三，三生三才，三丹相类，神符白雪，九转金掖，从九至九，液之不断，不断是有炁之名。 积炁成功，为上清三宫。 一名紫霞宫，二名天皇琼宫，三名紫宸官。 天一宫合神丹，其三品丹，都在一门。 药中三物共成，入天一宫也。 天一宫是天皇琼宫之别名也。 若修神符上丹，从紫霞宫起首，从黄至紫，不夺旧色者，不可载其名。 天一宫最大。 三宫，三清之境，从虚无紫霞宫天皇前，一切，大圣悉皆归集。 世人若得此真仙之门，不杂亦同天地大造化也。 大道者，天地也。 凡水银如得曾青，以火试伏，而於鼎中，其灵变光芒，火烧不烬，变成仙丹，以应上仙天宫真神丹也。 号明皇元君，从玉晨君化成，其名因白雪而成道焉。 按《本行经》中载元始五老，太上之尊也。 其丹上关天宫诸仙圣智，下在人身中而伏藏，上下知之，可名成大道矣。 配合胎宫雌雄相类门第十五 胎中配丹，以硫黄、水银相类。 四神，以雄黄、朱砂、空青相类，铅锡金铜相类。 杂诸丹药，合以矾石，并草药相类，黄丹、硝石相类。 金合木，水合火，炁合风，阴合阳，并相类成品，以炁合道焉。 凡所置杂丹方药，并无出世之功，暂有治疾之能。 若将此矾石杂类，染我神仙之卫，水银为丹者，虽尔暂住，终久还去。 且水银性自滑净，不染诸尘垢，道士岂不相类求象，以合圣道焉。 假如铅属北方，子，水位，炁之质也。 为含银胎，其银胎为黄花，如木中含火，禀类相求，而配其炁铅也。 白者金精，炁者水基。 水银内含火熙，象木中含火，水刑火，为卯合寅为火，曰重阳，火在其中伏藏。 所以道经云：知白守炁。 炁者，北方之位，铅精所居为雄，雄者为铅中含银也。 雄配雌，雌者水银，体性含阳也。 雌雄相须，阴阳相合，为药初门，为化成白掖，伏汞而死。",
      "translated_text": "「If those who **embrace their affinities** (若相禀者),\ntheir **strength** (力) does not surpass **lead** (铅),\ntheir **command** (使) does not surpass **Green Vitriol** (曾青),\ntheir **achievement** (功) does not surpass **water and fire** (水火),\nand their **loss** (失) does not surpass **miscellaneous substances** (杂类).\n\n**Green Vitriol** (曾青者) is the **essence of wood** (木精).\n**Lead and mercury** (铅汞者) are the **affinities of metal** (金相类).\n\n**The Three Souls** (三魂):\n**Green Vitriol** (曾青), **First and Second** (甲乙), is the **first affinity** (第一), the **essence of wood** (木精).\n**Maid’s Daughter** (姥女), **White Cinnabar Sand** (白丹砂), **Third and Fourth** (丙丁), is the **second affinity** (第二), the **mercury of the Vermilion Bird** (朱雀汞).\n**Lead** (铅), **Seventh and Eighth** (庚辛), is the **third affinity** (第三), the **mercury of silver, gold, and Heaven-born Sprout** (铅银金水芽).\n\nThese **three colors** (此三色) each possess **divine transformations** (神化之功),\ncapable of **restraining mercury’s strength** (能制水银之力).\nIf one attains this **mysterious principle** (妙理),\nthen one will not **lose the Dao of Immortality** (失其仙道).\n\n**Next is Sulfur** (其次硫黄),\nalso a **path of the Intermediate Immortal** (中仙之道).\nThose who use it must **align its affinities** (使其相类) as **outer form** (表裹),\nas **ministerial assistant** (臣佐),\nand as **qi and force** (炁力).\nIf attained, one becomes an **Intermediate Immortal** (中仙),\nbut if not understood, one becomes a **deadly adept** (死士).\n\n**Sulfur** (硫黄) has **great toxicity** (大毒).\nOne kind is called **common Sulfur** (凡常硫黄).\n**Our Immortal Sulfur** (我仙家硫黄),\ncan **discriminate** (殊别),\nand when **greatly applied** (大用),\nlike the **ministers of the Three Platforms** (三台之臣),\nit can also **lead to transcendence** (有出世之路),\n**transform the five metals** (化五金之功),\nand possess a **separate method** (独行一门),\n**saving the poor** (救贫之法).\n\nThe **scripture says** (经云):\n*\"Refine it to gold color (炼如金色),\nand it can **transfuse stones into gold** (可以点输石成金),\nwithout falseness (不虚).\"*\n\nWhen **greatly applied** (大用者),\nit **assists in forming the Immortal’s divine elixir** (助成仙人神丹胎),\nand **none can do without it** (无不用之).\nTo use it, one must **avoid ghostly flames** (无鬼焰).\n\n**Green Vitriol** (曾青) shares **its fundamental affinity** (同本类) with **one color** (一色),\nbut **only possesses the divine transformation** (独有神化之功),\n**drawing mercury’s qi** (引水银之炁),\n**flowing and dispersing through the hundred meridians** (流散百脉).\n\nIf **practiced alone** (独行一门),\nit can **transform the five metals into worldly treasures** (化五金为世宝).\nWhen **used in its liquid form** (用化为液),\nthe **five metals** (五金) encounter it,\nand **none fail to change** (无不变改).\n\n**The mercury method** (水银一门):\n**Immortal elixir—White and Vermilion Cinnabar** (仙丹白朱砂宝),\nis **Heaven-born Sprout** (天生芽).\nIt **originates from mercury** (本从水银中生),\nits **spirit unaltered** (精神不变),\nand when it **forms White Cinnabar** (成白朱砂者),\nit is then called **Heaven-born Sprout** (始名天生芽).\nIf one **attains this sprout** (得此芽),\n**mercury will be subdued and transformed** (水银无不伏化).\n\nNow, **Daoists lack Heaven-born Sprout** (今道士无天生芽),\nso why not **borrow qi to form White Cinnabar Sand** (借炁而成白丹砂),\nand thus **align with its grand transformation** (即同其大造化)?\n\n**Ancient Immortals** (上古仙士) established the **Grand Transformation** (立言大造化),\nusing **Heaven and Earth as the furnace** (天地为炉),\nand the **four seasons as fuel** (四时为炭).\nIf one **refines with pure and profound understanding** (纯妙用),\nit also **aligns with the Grand Transformation** (亦同大造化),\nand does not **need to seek distant models** (不在远取其则).\n\nYet, **the Three Ones must be mutually required** (然三一相须),\ntheir **positions differ** (其居不同),\nbut their **purpose is singular** (其致一也).\nIf the **types and applications diverge** (若种类不同),\nand **intentions vary** (用意参差),\nthen **divided into two paths** (分两有异),\nhow can one **understand and extract** (如何解摘)?\nOnly **my divine transformation secret arts** (唯我神化秘术),\n**trust and follow** (信心所从).\n\n**The Doctrine of Their Affinities: Divine Elixir Palace** (配合神丹宫相类门第十四)\n**The Three Souls** (三魂):\n**Mercury’s spirit and vital breath** (水银灵魄),\n**form the three grades of Immortal elixir** (成三品神仙之丹).\n\nFrom **the Three Ones** (从三一起),\n**separating the Dao-principles** (分别道元),\n**one generates two** (一生二),\n**two generates three** (二生三),\nand **three generates the Three Talents** (三生三才).\n**The three elixirs align in affinity** (三丹相类),\n**divine symbols like White Snow** (神符白雪),\n**Nine-turned Golden Cinnabar** (九转金掖),\n**from the ninth to the ninth** (从九至九),\n**its liquid is unbroken** (液之不断),\nand **unbroken is the name of qi** (不断是有炁之名).\n\n**Accumulating qi to perfection** (积炁成功),\nit **becomes the Three Palaces of Upper Clarity** (为上清三宫).\nThe **first is called Purple Cloud Palace** (一名紫霞宫),\nthe **second is called Heavenly Sovereign’s Jade Palace** (二名天皇琼宫),\nand the **third is called Purple Hall** (三名紫宸官).\n\n**Heavenly One Palace** (天一宫) **unites with the Divine Elixir** (合神丹),\nand **its three grades of elixir** (其三品丹),\n**all belong to one method** (都在一门).\n**The three substances within the medicine** (药中三物) **coalesce to form** (共成),\n**entering Heavenly One Palace** (入天一宫).\n**Heavenly One Palace** (天一宫) is another name for **Heavenly Sovereign’s Jade Palace** (天皇琼宫之别名).\n\nIf one **refines the divine symbols for the upper elixir** (修神符上丹),\n**beginning from the Purple Cloud Palace** (从紫霞宫起首),\n**from yellow to purple** (从黄至紫),\n**without losing its original hue** (不夺旧色),\nthen it **cannot be named** (不可载其名).\n\n**Heavenly One Palace** (天一宫) is the **greatest**.\nThe **Three Palaces** (三宫) are the **realms of the Three Purity** (三清之境),\n**from the void and formless Purple Cloud Palace** (从虚无紫霞宫天皇前),\n**all things, great saints, converge** (一切，大圣悉皆归集).\n\nIf **worldly beings attain this true Immortal path** (世人若得此真仙之门),\n**without mixing, they align with the Grand Transformation of Heaven and Earth** (不杂亦同天地大造化).\n\n**The Great Dao** (大道者) is **Heaven and Earth** (天地).\n**Ordinary mercury**, if **attained by Green Vitriol** (凡水银如得曾青),\n**tested by fire and subdued** (以火试伏),\nand placed **within the crucible** (而於鼎中),\nits **spirit transforms into radiant brilliance** (其灵变光芒),\n**fire burns without consuming it** (火烧不烬),\nand it **becomes the Immortal’s elixir** (变成仙丹),\n**responding to the true divine elixir of the Upper Immortal’s Heavenly Palace** (以应上仙天宫真神丹).\n\nIt is called **Emperor of Light** (号明皇元君),\n**transformed from the Jade Morning Lord** (从玉晨君化成),\nand its **name derives from the White Snow** (其名因白雪而成道).\n\nAccording to **the *Scripture of Its Own Conduct*** (按《本行经》中载元始五老),\n**the Five Elders of Primordial Beginning** (元始五老),\nare the **highest revered by the Most High** (太上之尊).\nTheir **elixir** (其丹) **encompasses the wisdom of all Heavenly Palace saints** (上关天宫诸仙圣智),\n**yet remains concealed within the human body** (下在人身中而伏藏).\nIf **known both above and below** (上下知之),\none may **name it the Great Dao** (可名成大道).\n\n**The Doctrine of Their Affinities: Fetal Palace of Male and Female** (配合胎宫雌雄相类门第十五)\n**Within the fetal palace**, **aligning elixirs** (胎中配丹):\n**Sulfur and mercury** (以硫黄、水银) are **affinities** (相类).\n**The Four Spirits** (四神):\n**Realgar, Cinnabar Sand, Void Green** (雄黄、朱砂、空青) are **affinities** (相类),\nand **lead, tin, gold, copper** (铅锡金铜) are **affinities** (相类).\n\n**Miscellaneous elixir medicines** (杂诸丹药),\n**combined with alum** (合以矾石),\nand **herbal medicines** (并草药相类),\n**yellow elixir and niter** (黄丹、硝石) are **affinities** (相类).\n\n**Metal aligns with wood** (金合木),\n**water aligns with fire** (水合火),\n**qi aligns with wind** (炁合风),\n**yin aligns with yang** (阴合阳),\nand **all align in affinities to form grades** (并相类成品),\n**uniting qi with Dao** (以炁合道).\n\n**All miscellaneous elixir formulas and medicines** (凡所置杂丹方药),\n**lack transcendental efficacy** (并无出世之功),\nyet **temporarily possess healing abilities** (暂有治疾之能).\nIf one **mixes this alum with the Immortal’s protective qi** (将此矾石杂类),\nand **mercury is used as the elixir** (染我神仙之卫),\nthen **though it may temporarily reside** (水银为丹者，虽尔暂住),\n**it will ultimately depart** (终久还去).\n\nMoreover, **mercury’s nature is inherently slippery and pure** (且水银性自滑净),\n**untainted by dust or filth** (不染诸尘垢).\n**Daoists** (道士) **should not seek its affinities** (岂不相类求象),\n**to align with the Sacred Dao** (以合圣道).\n\nFor instance, **lead belongs to the North** (假如铅属北方),\nthe **Water position** (子，水位),\nand the **substance of qi** (炁之质).\nAs the **fetal palace containing silver** (为含银胎),\nits **silver fetus is yellow flower** (其银胎为黄花),\nlike **fire contained within wood** (如木中含火),\n**seeking affinities and configuring qi of lead** (禀类相求，而配其炁铅).\n\nThe **white** (白者) is the **metal’s essence** (金精),\nand the **qi** (炁者) is the **water’s foundation** (水基).\n**Mercury internally contains the fire of harmony** (水银内含火熙),\nsymbolizing **fire within wood** (象木中含火).\n**Water restrains fire** (水刑火),\n**as the Wood position (卯) aligns with the Tiger position (寅) for fire** (为卯合寅为火),\ncalled **Double Yang** (曰重阳),\nwith **fire concealed within** (火在其中伏藏).\n\nThus, the **Dao scripture says** (所以道经云):\n*\"Know the white and guard the qi\"* (知白守炁).\n**Qi** (炁者) is the **North position** (北方之位),\nwhere the **lead’s essence resides** (铅精所居),\n**the male** (为雄),\nand **the male is lead containing silver** (雄者为铅中含银).\n\n**Male aligns with female** (雄配雌),\nand **the female is mercury** (雌者水银),\n**whose nature contains yang** (体性含阳).\n**Female and male mutually require** (雌雄相须),\n**yin and yang unite** (阴阳相合),\n**forming the initial medicinal method** (为药初门),\n**transforming into White Cinnabar** (为化成白掖),\n**subduing mercury and causing its death** (伏汞而死).",
      "overlap_context": "s vital breath (无水银之精魄)**.\n**Sulfur (硫黄)** is the **wronged soul (冤魂)** of mercury—**concealing mercury’s wayward breath (隐水银之横魄)**.\n\n**Realgar (雄黄)**, **Orpiment (雌黄)**, **Arsenic Sulfide (毗黄)**, **Niter (硝石)**, **Calcined Cinnabar (炮砂)**, **Great Yin Mysterious Essence Stone (太阴玄精石)**, **Void Green (空青)**, and **Alum (矾石)**—each **embodies qi to form (各禀炁成形)**—yet **none align with Immortal arts (都与仙术不合)**. Their **souls and breaths do not correspond (魂魄不相类)**, and their **Dao differs (道不同)**.",
      "start_char": 9769,
      "end_char": 11021,
      "start_sentence": 436,
      "end_sentence": 495,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 40.04372835159302,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\阴真君金石五相类.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "《易》曰：百姓日用，而不知其道。 五行水为初，一能生成万物。 ．道士岂不知神化之术，在其中也。 雄是铅中银，能化水中银为白液。 白液者，从雄以雌而化。 此其仙丹，上元玄教一品，号名神符丹字，出《五符经》中。 其次用曾青、空青、雄黄、雌黄、毗黄、硫黄、硝石、炮砂、戎盥、铅华，铅华是铅中银精别名，已上等药，助成上道，亦须当用之，日相类同体。 即合於易象，不得失错。 若临炉定火，三才具全，天道共成，更无不利也。 若言三品上丹，并不用硝炮、矾石等之类。 若《港通诀》五金制度，在世利之门，即须用矾石，相类制引，使其通利，助佐其门，不用不成。 如为小丹，治玲热之疾者，世人皆错用诸矾石，共制於水银，以助佐成丹者。 世人不识相类，浪取其根，纵服得病暂除，不知元是患人有命，非干丹事，必取无端。 何也。 人五藏不纳诸矾。 又说按诸草药方书，多载用白矾之类，火化为生熟元，不易矾性。 如生水银死了，岂兔离水银之性乎。 熟饭岂兔生米之性乎。 只为用时较生，生即性急，使即疾速，熟即和同，使即迟慢。 迟疾两炁终始，元是一般。 如人自少至老，元是一性，不可改易也。 唯我神丹三品，用炁相和，以炁相类，不失五行，配合两性，不遗水火之法，象其颜色，未越束西，相类成形，不离南北。 受炁行令周回，不出於八卦，役使筋骨，不过於曾青。 配合阴阳之精，变化不出於铅金白液，伏藏不过於水火，得志不过於水基。 隐形为神，硫黄第一。 毗黄一物，天一独行，雄雌硝炮，转白入黄，转黄入紫，相类品物，不出神丹。 杂错施行，大误其道。 配合口神丹伏炼相类门第十六 第一神丹神符，上品之丹。 其丹以炁相合，而成大丹，名日天镜。 铅中黄华为银，含在铅中，名黄华，盖其华池。 华池是水基，水基名曰雌，即银，是西方太白星宫，号庚辛少女，雌也。 铅精元炁为精华，名曰雄前者，十名雄铅黄华。 精炁能化水银，是以铅精炁为之中男，北方。 与兑西方雄铅也，作华池。 盖与金少女相合，为雌雄华池。 水银脱胎化白液，液正元为一炁者，水之基，水位在北方子位。 第二白雪，白雪乃从汞，为妮女之用，中还白雪配类，合道元本，众成一炁，别名号日特行丹。 何为众味，可得所扶，助成其炁。 造之甚易，得之甚难，何也。 由助佐臣第一曾青，乃天一木精也。 黄芽铅精，白液金精、秋石等，出阳入阴，禀天地之炁，通大道之正元。 一造永了，更无二功。 亦名金砂之丹，日月递加，硫黄为芽，青腰为使，调成金砂，周遭一雨，名出云霞。 相类得之，服而不死。 三丹相类，各禀其炁。 神符应春夏，白雪应三秋，九转应三冬，春夏属阳，阳者雄也。 铅黄芽神符也。 秋冬属阴，阴者雌也。 丹砂白汞，姥女白雪，白雪者丹阳也。 九转应三冬，何也。 神符应春夏，天色清明，发一年之号令，感万象而生成，应蠢动而受命，合四时，应八节，此亦上仙之丹，号曰神符。 其次白雪，三秋之首，凭寒露而成霜，积阴炁而为雪，从煞止煞，百草烬於灰尘，蠢动伏於地炁，号神化无穷特行之丹，服之永不死，造之永留根，不可思量。 第三九转，九转神符，亦名金液丹相类九九之数。",
      "translated_text": "*The Classic of Changes* says:\n*\"The common people use it daily, yet do not know its Dao.\"*\n\nWater, the first of the Five Phases, alone can generate all things.\nDoes the Daoist not know the art of divine transformation within it?\n\nThe **male**—silver within lead—can transform mercury’s silver into **White Elixir**.\nThe **White Elixir** arises when the **male** and **female** mutually refine each other.\n\nThis is the **Immortal Pill**, the supreme grade of the **Mystic Teachings of the Upper Primordium**, named the **Divine Symbol Pill** in the *Five Symbol Scripture*.\n\nNext, one uses **copper acetate (曾青)**, **malachite (空青)**, **realgar (雄黄)**, **orpiment (雌黄)**, **yellow arsenic sulfide (毗黄)**, **sulfur (硫黄)**, **saltpeter (硝石)**, **calcined sand (炮砂)**, **arsenic trioxide (戎盥)**, and **lead oxide (铅华)**—for **lead oxide** is another name for the refined essence of silver within lead. All these medicines assist in completing the **Dao**; they must be used according to their **resonant affinities**.\n\nThis aligns with the *Changes*’ symbols—never misapplied. When refining at the furnace, if the **Three Powers** are complete, the **Heavenly Dao** succeeds, and nothing fails.\n\nAs for the **Three-Grade Supreme Pill**, it does not use **saltpeter or alum** and their ilk. Yet in the *Harbor Passage Key*, the **Five Metals’ System** belongs to the **Worldly Utility Gate**, where alum must be used to **harmonize affinities**, making them **flow smoothly** and aiding the **Gate’s function**—omission renders it incomplete.\n\nFor **minor pills** treating **lingering fevers**, common folk mistakenly mix alum with mercury to assist in pill formation. They do not grasp **resonant affinities**, recklessly taking their roots. Even if illness temporarily abates, it is because the patient’s **fate** allows it—not the pill’s power. Such methods are **groundless**.\n\nWhy? The **Five Viscera** cannot absorb alum.\n\nFurther, in herbology texts, many prescriptions use **white alum** and similar substances. When fire-refined, they become **raw or cooked essences**, yet their **alum nature** remains unchanged. Just as **dead mercury** does not lose its **mercurial essence**, nor does **cooked rice** lose its **raw rice nature**. Only their **timing** differs—**raw** is **urgent**, **cooked** is **slow**. The **beginning and end of qi’s swiftness and slowness** are fundamentally the same. As a person ages from youth to old age, their **essence** remains unaltered.\n\nOnly our **Three-Grade Divine Pill** harmonizes **qi by affinity**, aligns **qi by category**, never strays from the **Five Phases**, pairs **yin and yang**, omits no **water-fire methods**, mirrors its **colors** without exceeding **束 (restraint)**, forms by **affinity**, and never departs from **south and north**.\n\nIt **receives qi** and **issues commands** in a **cyclical order**, never exceeding the **Eight Trigrams**. It **commands sinews and bones** without overusing **copper acetate**. It **refines yin-yang essences**, yet its transformations never exceed **lead, gold, and White Elixir**. Its **concealment** never surpasses **water and fire**, and its **fulfillment** never exceeds **water’s foundation**.\n\n**Hidden in form**, it is **Divine**—**sulfur** is supreme.\n**Yellow arsenic sulfide**, a singular substance, moves alone as **Heaven’s One**. **Hermaphroditic saltpeter** transforms **white to yellow**, then **yellow to purple**, all **affinitive substances** never straying from the **Divine Pill**.\n\nMisdirected combinations **greatly err in the Dao**.\n\n---\n**Refining the Oral Divine Pill: The Sixteenth Gate of Affinitive Cultivation**\n\n**First Divine Pill: Divine Symbol, Supreme-Grade Pill.**\nIts pill is formed by **harmonizing qi**, becoming the **Great Pill**, named **Heaven’s Mirror**.\nThe **yellow bloom within lead** is silver, contained in lead, called **Yellow Bloom**—its **bloom-pool**.\nThe **bloom-pool** is **water’s foundation**, named **female**, which is **silver**, the **Western Planet’s White Star Constellation**, called **Regents Geng and Xin, the Young Maiden**—the **female**.\n**Lead’s refined essence-qi** is the **precursor bloom**, named **male**—previously called **Yellow Bloom Lead**. This **precursor qi** can refine mercury, hence **lead’s refined qi** is its **central male**, of the **Northern Position**.\nPaired with the **Western Lead’s male**, it forms the **bloom-pool**.\nIt aligns with the **Golden Young Maiden**, becoming the **male-female bloom-pool**.\nMercury, **shedding its form**, becomes **White Elixir**. When the **Elixir’s essence is pure**, it is **one qi**—**water’s foundation**, its position in the **Northern Child Trigram**.\n\n**Second: White Snow.**\n**White Snow** arises from mercury, used for the **Maiden’s function**. **Returning White Snow** aligns by **category**, merges with the **Dao’s original essence**, and all **qi coalesces into one**. It is also called the **Special-Mission Pill**.\n\nWhy does it require **varied flavors** to be supported?\nIts creation is easy, yet attainment is difficult. Why?\nBecause the **first assistant**, **copper acetate**, is **Heaven’s One, Wood’s essence**.\n**Yellow-sprouted lead essence**, **White Elixir’s gold essence**, and **Autumn Stone**—all **enter yin from yang**, drawing **Heaven and Earth’s qi**, passing through the **Dao’s true essence**. Once forged, it is **permanent**; no second effort is needed.\n\nIt is also called the **Gold-Sand Pill**. With **sun and moon’s successive addition**, **sulfur** is the **sprout**, **green waist** (arsenic trioxide) the **messenger**. When blended into **Gold-Sand**, a **surrounding mist** forms—named **Emerging Clouds and Mist**.\nObtained by **affinity**, it is taken without death.\n\nThe **Three Pills** align by **category**, each drawing its **qi**.\n**Divine Symbol** responds to **spring and summer**,\n**White Snow** to the **three autumns**,\n**Nine Circulations** to the **three winters**.\nSpring and summer belong to **yang—the male**.\n**Lead’s yellow sprout** is the **Divine Symbol**.\nAutumn and winter belong to **yin—the female**.\n**Cinnabar and mercury** are the **Maiden’s White Snow**; **White Snow** is **yang’s cinnabar**.\n**Nine Circulations** respond to the **three winters**—why?\n**Divine Symbol** responds to **spring and summer**, when **heaven’s clarity** issues commands, **stirring all phenomena** to life, **responding to movement** and receiving **mandate**, aligning with the **four seasons** and the **eight nodes**. This is also the **Supreme Immortal’s Pill**, named **Divine Symbol**.\n\nNext is **White Snow**, the **beginning of the three autumns**, relying on **chilling dew** to form **frost**, accumulating **yin-qi** into **snow**. It **checks and halts** (the heat), reducing all grasses to **ashes and dust**, while **movement retreats** into **earth-qi**. It is called the **Pill of Boundless Divine Transformation**, taken without death, its **creation** leaving **no trace**, beyond measure.\n\n**Third: Nine Circulations.**\nThe **Nine-Circulation Divine Symbol** is also called the **Gold-Liquid Pill**, aligning with the **ninefold ninefold count**.",
      "overlap_context": ".\n**Qi** (炁者) is the **North position** (北方之位),\nwhere the **lead’s essence resides** (铅精所居),\n**the male** (为雄),\nand **the male is lead containing silver** (雄者为铅中含银).\n\n**Male aligns with female** (雄配雌),\nand **the female is mercury** (雌者水银),\n**whose nature contains yang** (体性含阳).\n**Female and male mutually require** (雌雄相须),\n**yin and yang unite** (阴阳相合),\n**forming the initial medicinal method** (为药初门),\n**transforming into White Cinnabar** (为化成白掖),\n**subduing mercury and causing its death** (伏汞而死).",
      "start_char": 11022,
      "end_char": 12254,
      "start_sentence": 496,
      "end_sentence": 549,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 18.58155655860901,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\阴真君金石五相类.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "初九用九转，相类九九之数。 初九用硫黄，硫黄是太阳。 以阳成阴，名曰纯乾。 纯乾成大造化炁，号九转。 九转合五行三才，得此丹象束方木，木王正纯乾。 十二月半，得正月节，解冻之春首，即神符为上功，九转为次功，白雪为武功，神符为文功，经天地以春为上也，神符功最大。 凡神仙之卫，不过三丹。 三丹三皇所造，其丹杂法，科有万数，不得品类相配，不在载於仙录之中。 九转使者用黄神胶，白雪使者用天一黄芽，同黄神胶为一房，神符使者用铅黄芽。 三品上丹，使用各别，造丹日不得错，其仙教即恐相类不同也。 而不涉入，自大谬也。 配合传熙相类门第十七 硝石、炮砂、雄黄、雌黄，此四者相类用炁，同於一般造伏，制水银成丹之化，有感炁之法，刊在要门。 分数有功，即天生类别。 其如雄黄类水银成金之炁，亦辅金之苗，亦成金之色。 其中用曾青为使，即是雄黄之类，同成炁也。 雌黄为阴，辅佐空青。 即是空青为使，亦同水银也。 硝石为臣，辅佐雄雌水银，如关闭门牖不走失也。 类同一家之人，亦同一国之君臣，无四夷诸杂之类，以破三才也。 凡制丹及黄白卫，不可过此四般为类也。 炮砂与五金，亦须借炁用之。 用须知其多少。 若不相类，则事不成。 凡万物皆然，非论至药。 修炼之门，取类同即合。 除此四味，别有横入者，是非多端，未可闻命。 配合波斯铅精相类门第十八十六门 波斯铅不损三才，为五符天镜，成我大丹，为黄芽，是毕天之上法。 波斯铅是白虎庚辛金铅，号西国黄芽。 嘉州铅以水银同於猛火中，炼成金色为黄芽，名破三才分金公二字，亦名坏性，纵成黄芽，号日中天之次法，法无三才也。 波斯铅如着水银，於猛火中炼如金色。 若未至金色，须百炼取金色，然后堪点化。 采黄华为芽用之，点输石及雄雌黄、空青等，成黄金为世宝，亦名毕天之法。 嘉州铅与硫黄，同炼水银成粉，将炼水银，成太一含化丹，亦名中天之法。 嘉州铅入硫黄，微微同销成汁，兼用大功力，水煮之，以盛器成水银，煮经一百日，其水银亦成丹用，亦成白银用之。 嘉州铅为华池，煮一切水银成质，号名真铅金公华池水。 波斯铅入水银，同於猛火中，炼取六两黄华，於熟丹砂，是阳药木精，柜中养一百日，修炼擎出，丸如梧桐子大，每日空心服一粒，律下，益心神，明目炁髭发。 不经二百日，白发再炁，是小功之法，知神仙之道不虚矣。 嘉州铅及杂州土，炼成为粉，烧成黄丹，亦成蜜陀僧，亦成胡粉。 作柜子伏丹药，堪为利用之门。 嘉州铅能成炁银，亦能成铜器，亦能抽铜晕成银。 波斯铅不用，入水银空炼一伏时，取黄华以制水银，无不伏者。 并空炼一伏时，取黄华将制水银成砂子。 若入火伏得住，亦名中丹。 若大药，即不用诸铅。 歌日：大药不用铅，用铅即须会。 会即三才全，不会坏物碎。 黄华皆凭铅，铅中有变改。 天地自全功，功成铅须退。 至药无二三，因铅始得会。 会本从心生，生须铅华在。 变法任铅情，不道不成盖。 盖是天镜也。 铅黄丹，世人亦将为黄芽铅。 胡粉，世人亦将为黄芽铅。 令伏火作器，受水银，亦号白金黄芽。 嘉州铅一斤百，炼成一两，白如雪。 下硫黄一两，用水飞水银一两，禹余粮、孔公孽各一两，先销成汁。",
      "translated_text": "「**First: Nine Circulations.**\nThe **Nine-Circulation Divine Symbol** is also called the **Gold-Liquid Pill**, aligning with the **ninefold ninefold count**.\n\n**Nine Circulations (of the Gold-Liquid Pill):**\nThe **Nine-Circulation** employs **sulfur** (硫黄), which is **Taiyang** (太阳). Using **yang** to generate **yin**, it is named **Pure Gan** (纯乾). **Pure Gan** forms the **Great Daoist Transformation Qi** (大造化炁), known as the **Nine-Circulation Pill**.\n\nThe **Nine-Circulation Pill** harmonizes the **Five Phases** (五行) and **Three Talents** (三才), obtaining this **Pill’s Daoist Symbol** to bind **Wood** (木), the **Wood Sovereign** (木王) now standing **Pure Gan**.\n\nIn the **midst of the twelfth month**, at the **true beginning of the first month’s node** (正月节), the **thawing spring** (解冻之春) marks the **Divine Symbol** as the **highest achievement**, the **Nine-Circulation Pill** as the **secondary achievement**, and **White Snow** as the **martial achievement**. The **Divine Symbol** is the **civil achievement**. Among the **Heaven-Earth Pill** (经天地), **spring** (春) is supreme, and the **Divine Symbol** has the greatest efficacy.\n\nAll **immortal’s protective arts** (神仙之卫) do not exceed these **three pills**. The **three pills** were created by the **Three Sovereigns** (三皇). Their pill-making methods are diverse, with myriad techniques, but those that fail to align in **rank and kind** (品类相配) are not recorded in the **Immortal’s Registry** (仙录).\n\nThe **Nine-Circulation Pill’s emissary** (使者) uses **Yellow God Glue** (黄神胶), the **White Snow Pill’s emissary** uses **Tianyi Sulfur** (天一黄芽), both being classified under **Yellow God Glue** (同黄神胶为一房). The **Divine Symbol Pill’s emissary** uses **lead with sulfur** (铅黄芽). These **three grades of supreme pills** (三品上丹) are distinct in their preparation; the **day of pill-making must not be mistaken**, lest the **immortal’s teachings** (仙教) diverge in kind.\n\n**Failure to follow this kindred principle** (不涉入) is a **great error**. The **Seventeenth Gate of Aligning with Saltpeter and Sulfur** (配合传熙相类门第十七) involves **saltpeter** (硝石), **calcined realgar** (炮砂), **realgar** (雄黄), and **orpiment** (雌黄). These **four substances** are kindred in their **qi**, akin to general **subjugation techniques** (造伏), and can **refine mercury** (制水银) into **pill’s efficacy** (成丹之化). Their methods of **sensing qi** (感炁) are recorded in the **Key Gates** (要门).\n\nTheir **functions are distinct**, as **Heaven’s inherent categorization** (天生类别) dictates. For instance, **realgar** (雄黄) is kindred to **mercury** (水银) in forming **golden qi** (成金之炁), nurturing **gold’s essence** (辅金之苗), and producing **gold’s hue** (成金之色). When **cupric acetate** (曾青) is used as an **emissary** (使), it belongs to the **realgar kind**, forming **qi** in the same manner.\n\n**Orpiment** (雌黄) is **yin**, assisting **void green** (空青). When **void green** is used as an **emissary**, it is also akin to **mercury**. **Saltpeter** (硝石) is the **minister** (臣), aiding **realgar, orpiment, and mercury** like **shutting and sealing doors and windows** (关闭门牖) to prevent loss.\n\nThey are akin to **one family’s members** (一家之人) or **one kingdom’s sovereign and ministers** (一国之君臣), without **barbarian or杂州** (四夷诸杂) interlopers, to **break the Three Talents** (破三才). In **all pill-making and protective arts of yellow and white** (黄白卫), one must not exceed these **four kindred substances** (四般为类).\n\n**Calcined realgar** (炮砂) and the **Five Metals** (五金) must also **borrow qi** (借炁) for use. Their **dosage** must be known. If not aligned in kind, the **endeavor fails** (事不成). All **ten thousand things** (万物) follow this principle; it is not limited to **elixirs**. The **Gate of Refining** (修炼之门) succeeds when kindred substances are aligned.\n\n**Beyond these four ingredients**, there are **others that intrude**, leading to **many contradictions** (非端多端). These are **not to be revealed** (未可闻命).\n\n**The Eighteenth Gate of Aligning with Persian Lead** (配合波斯铅精相类门第十八):\n**Persian lead** (波斯铅) does not harm the **Three Talents** (三才), becoming the **Five Pill’s Heavenly Mirror** (五符天镜), forming **my great pill** (我大丹), and serving as **Yellow Ke** (黄芽), the **highest law of the heavens** (毕天之上法). **Persian lead** is the **White Tiger** (白虎) **regal metal** (庚辛金铅), named **Western Country’s Yellow Ke** (西国黄芽).\n\n**Lead from Jiayou** (嘉州铅) refined with **mercury** in **fierce fire** (猛火) until it turns **golden** is called **Yellow Ke**, bearing the **two characters: \"Break the Three Talents, Divide the Gold\"** (破三才分金公二字). It is also named **\"Corrupt Nature\"** (坏性), though it forms **Yellow Ke**, it is the **secondary law of the heavens** (日中天之次法), lacking the **Three Talents**.\n\n**Persian lead** refined with **mercury** in **fierce fire** until it turns **golden** must be **a hundred refineries** (百炼) to achieve the **golden hue**, then it can be used for **transmutation** (点化).\n\n**Adopted yellow flowers** (黄华) are used as **ke** (芽). **Transfuse and inject** (点输) into **stone** (石) and **realgar, orpiment, void green** (雄雌黄、空青), forming **Yellow Gold** (黄金) as the **treasure of the world** (世宝), also named **\"Heaven’s Ultimate Law\"** (毕天之法).\n\n**Jiayou lead** (嘉州铅) and **sulfur** (硫黄), refined with **mercury** into **powder**, are used to **refine mercury** into the **Taiyi Pill of Contained Transformation** (太一含化丹), also named **\"Central Heaven’s Law\"** (中天之法).\n\n**Jiayou lead** (嘉州铅) mixed with **sulfur** (硫黄) is **slightly consumed** (微微同销) into a **liquid**, using **greatest efficacy** (大功力). **Boiled in water** (水煮) for **a hundred days** (一百日), the **refining vessel** (盛器) yields **mercury** (成水银), which is also used as a **pill** (成丹用). The **Jiayou lead** is called **Hua Chi** (华池), refining **all mercury** into **substance** (成质), known as **True Lead, Golden Sovereign, Hua Chi Water** (真铅金公华池水).\n\n**Persian lead** (波斯铅) mixed with **mercury** (水银), refined in **fierce fire** (猛火), yields **six liang of yellow flowers** (六两黄华). When **mercury is refined** (熟丹砂), it is the **yang elixir, Wood Essence** (阳药木精). **Stored in a cabinet** (柜中) for **a hundred days** (养一百日), **refined and purified** (修炼擎出), the **pills** are formed like **Firmiana seeds** (梧桐子大), to be taken **one grain daily on an empty stomach** (每日空心服一粒). Following the **regulations**, it **enhances the mind and spirit** (益心神), **sharpens vision** (明目), and **revives qi, beard, and hair** (炁髭发).\n\nIf **not taken for two hundred days** (不经二百日), **gray hair rejuvenates** (再炁), which is the **minor efficacy’s law** (小功之法). One knows that the **Dao of Immortals** (神仙之道) is **not false**.\n\n**Jiayou lead** (嘉州铅) and **杂州 soil** (杂州土), refined into **powder** (为粉), **burned** to form **Yellow Pill** (成黄丹), also known as **Mieduo Seng** (蜜陀僧) or **Hufa** (胡粉). These are used to **make cabinets** (作柜子) for **subjugating elixirs** (伏丹药), serving as **gates for beneficial use** (堪为利用之门).\n\n**Jiayou lead** (嘉州铅) can form **elixir silver** (炁银), **copperware** (铜器), and **extract copper’s bloom** (抽铜晕) to make **silver**. **Persian lead** (波斯铅) is **not used**; if **mercury is refined alone** (空炼) for **one subjugation cycle** (一伏时), **yellow flowers** (黄华) are taken to **refine mercury** (制水银), ensuring **no loss** (无不伏者).\n\n**Refined alone for one cycle**, taking **yellow flowers** to **refine mercury** into **cinnabar powder** (成砂子). If it **endures fire in subjugation** (入火伏得住), it is also named **\"Central Pill\"** (中丹). For **great elixirs** (大药), **all leads are not used**.\n\n**Song (Chant):**\n*\"Great elixir does not use lead,\nUse lead and it must align in kind.\nAlign in kind and the Three Talents are complete,\nFail to align and things are ruined and shattered.\nYellow flowers all depend on lead,\nLead has transformations and changes.\nHeaven and Earth are inherently complete,\nEfficacy achieved and lead must withdraw.\nUltimate elixirs have no second or third,\nLead’s alignment brings them to completion.\nCompletion stems from the mind’s intent,\nIntent requires lead and yellow flowers present.\nAltering methods follow lead’s nature,\nWithout the Dao, success cannot be assured.\nAssured is the Heavenly Mirror’s efficacy.\nLead-Yellow Pill,\nThe world also calls it Yellow Ke Lead.\nHufa,\nThe world also calls it Yellow Ke Lead.\nFor subjugating fire to make vessels,\nTo receive mercury,\nIt is also named White Gold, Yellow Ke.\n**Jiayou lead**—one hundred catties (斤),\nRefined into **two liang** (一两), **white as snow**.\nAdd **one liang of sulfur** (硫黄),\nUse **one liang of mercury** (水银) refined by **water-flying** (水飞),\n**Yuyu Grain** (禹余粮) and **Kong Gong Nuisance** (孔公孽) each **one liang**.\nFirst, **consumed into liquid** (销成汁).\"*",
      "overlap_context": "on **chilling dew** to form **frost**, accumulating **yin-qi** into **snow**. It **checks and halts** (the heat), reducing all grasses to **ashes and dust**, while **movement retreats** into **earth-qi**. It is called the **Pill of Boundless Divine Transformation**, taken without death, its **creation** leaving **no trace**, beyond measure.\n\n**Third: Nine Circulations.**\nThe **Nine-Circulation Divine Symbol** is also called the **Gold-Liquid Pill**, aligning with the **ninefold ninefold count**.",
      "start_char": 12254,
      "end_char": 13501,
      "start_sentence": 550,
      "end_sentence": 608,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 34.07056546211243,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\阴真君金石五相类.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "然后下水银，次下硫黄，次下孔公孽、禹粮等，以竹枝子余搅之。 总待相容受出之，入磁盆中，细研成一段紫粉。 又入坩埚中，密固济烧百日，用火不下一斤。 烧毕，出之细研成粉，绢袋盛，悬入地坑中，三日出之。 於磁合中盛饭，上蒸两遍，以人乳汁，和为梧桐子大，空心服一丸。 初日用酒下，增至十丸，即止，后并用津下。 服经百日，益人颜色，炁髭发，亦可以休粮，此是道门次中之药，即无出世之路。 何也。 此绿非类无质之物，然且要知铅中，有不思议无量之功，与仙道抗行。 若要休粮服食，治风病，即可无长生出世之大功矣。 波斯铅华池，能与曾青成合，五金相变易世宝，独行为一使。 所用方法，在秘要诀中。 但铅有华池，能煮炼五金，伏火如能解，感炁相类，用药分数，不失其理，於华池中有，毕天大造化之功力。 道士切须在意，参详上件铅功，有十六门之法，齐天地之道，解修炼者为仙人矣。 及有世财，并出此铅中，兼有变形容作处子之力，长生久视之功，毕天地之门，皆出於此也。 但得其真诀，无不定矣。 今略而记述之。",
      "translated_text": "Then add the mercury, followed by the sulfur, then Kong Gong Nuisance and Yuyu Grain, stirring with the leftover bamboo branch tips.\n\nWait until they harmonize and emerge, then place them in a glazed stone basin and finely grind into a segment of purple powder.\n\nNext, place it in a crucible, seal tightly, and refine with controlled fire for a hundred days, using no more than one *jin* of fuel.\n\nAfter refining, remove and grind finely into powder, store in a silk pouch, and suspend it in an underground pit for three days before taking out.\n\nPlace it in a glazed stone container with rice, steam twice, then mix with human breast milk to form pills the size of *wu tong* seeds. Take one pill on an empty stomach.\n\nBegin with wine as the carrier, increasing to ten pills, then cease, thereafter using saliva alone.\n\nAfter a hundred days of ingestion, it will enhance complexion, thicken beard and hair, and even allow for fasting—this is a secondary Daoist remedy, though it does not lead to transcendence.\n\nWhy?\n\nThis green substance, though not of the formless kind, still contains within lead an unimaginable, boundless power, rivaling the Dao of immortality.\n\nIf one seeks to fast and nourish the body, or treat wind-related ailments, this alone suffices—no greater alchemical achievement is needed for worldly transcendence.\n\nThe **Persian Lead Flower Pool** can merge with verdigris, transforming the five metals into treasures of the age, acting as a singular agent.\n\nThe methods used are recorded in the *Secret Keys*.\n\nBut lead, when its Flower Pool is attained, can refine the five metals, subdue fire—if mastered, it harmonizes with *qi*, and when the proportions of the elixir are precise, it fulfills the grand transformations of Heaven and Earth.\n\nDaoists must pay close attention, carefully studying these lead techniques, which encompass sixteen methods, aligning with the Dao of Heaven and Earth. Those who master them become immortals.\n\nMoreover, worldly wealth and even the ability to alter one’s appearance into that of a maiden emerge from this lead. Its power grants longevity and eternal youth, encompassing all the gates of Heaven and Earth—all derived from this.\n\nBut with the true method obtained, nothing remains uncertain.\n\nNow, I briefly record these instructions.",
      "overlap_context": " Pill,\nThe world also calls it Yellow Ke Lead.\nHufa,\nThe world also calls it Yellow Ke Lead.\nFor subjugating fire to make vessels,\nTo receive mercury,\nIt is also named White Gold, Yellow Ke.\n**Jiayou lead**—one hundred catties (斤),\nRefined into **two liang** (一两), **white as snow**.\nAdd **one liang of sulfur** (硫黄),\nUse **one liang of mercury** (水银) refined by **water-flying** (水飞),\n**Yuyu Grain** (禹余粮) and **Kong Gong Nuisance** (孔公孽) each **one liang**.\nFirst, **consumed into liquid** (销成汁).\"*",
      "start_char": 13501,
      "end_char": 13926,
      "start_sentence": 609,
      "end_sentence": 625,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 5.210367679595947,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\阴真君金石五相类.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "傍通气法相类门第十九 夫傍通气，用伏三黄八石事要，不夺元色，各令伏火。 伏火勿令销灼者，皆因傍通用炁，从炁归真性，共本质不殊，号名伏火三黄。 凡伏此药之法，如日月交蚀，虽暂昏暗，终久还明，却归元体。 凡伏三黄之法，亦须假硝石之力。 硝石自名秋石。 何名秋石，道士学飞炼，且须二知来处。 其秋石者，三黄，属春太阳王炁，杀於秋，故硝石能制阳药。 若伏炼三黄，不用硝石伏之，阳毒无由去矣。 其三黄八石，并属火，是纯阳之炁，生三黄亦同水银性，但有水银伏火成银乾，得不失水银之体。 其三黄八石，一种是阳炁所生，岂知各有变易乎。 但伏得二黄八石，不夺元体本性者，其功不可量也，此则全赖秋石之功也。 故知秋石，是阳药之主，用药得其妙理，亦如圣主得贤臣佐助之，秋石如贤臣也。 用伏硝石之法，先得白朱砂石，以火水化为粉，将伏秋石。 秋石元自生於寒地之熙，积冰霜而成白朱砂，亦是积万岁凝冰土，而结白石床。 白石床始生朱砂，其硝石相类合炁，故傍通用之，能伏水银、朱砂，二性都不走。 故知秋石是·元类不错，用伏三黄八石，被至阴伏制得住，不夺真容者。 盖由此二药至性也。 其次用硫黄对秋石，其硫黄元出於硝石，自带白色。 虽硫黄未伏火，假以硝石，傍通炁用之，壮秋石、硝石之力也。 配合同熙别名相类门第二十 假如波斯铅，本出西方庚辛金，铅裹有金，金华象西方庚辛金，铅质象北方壬癸水，可知自古仙士，认金华为黄芽。 不知铅中采者，象炁同类而用之，一物之中，便有金水相生之象。 象者，形质之谓也。 阴君师帛和君，解日：玄元上教，出自流沙，为配名配铅。 束方是汉国铅，汉国铅虽有华轻，不得纯体，不同西国流沙铅。 太上因度流沙，认其真铅。 得流沙铅为三品丹金，上仙第一真铅也。 元教玄胎之化，号名流沙铅，此波斯铅是也。 其配铅中华，如人身中有才有艺，皆是内怀，不显其外。 所以按《灵宝五符经》一不．还丹之士，抱其清流，子能得之，真人可求。 若用铅不损三才，即为毕天之上药。 若损三才，即铅须采华。 若采华，即铅无气力。 虽即不离铅中取，其铅必不得真，便不堪为臣佐也。 何为铅力不备，阙其元气，真性不全也。 凡三才若全，是毕天之上法。 如采其铅华，是中天之次法。 若以匡佐用之，是中天之下法。 此三者都出在铅中一十六门用之。 若拟用之，须明其大道元始之教，分明不错，即三丹成法，上应三一宫。 三宫者，三清也。 太清、上清、玉清，合一一兀始天一宫。 三丹须备三方，铅、水银、硫黄之真性。 曾青又独为一使，象束方之真性。 束方春上首也，春生万物，无物不利到，即万物尽感春生成，曾青是也。 能合铅，合水银，合硫黄，乃知一合三才，三才合五行，曾青是铅丹之使，水银之筋骨。 如木中含火，能令铅、水银、硫黄为黄神胶，共为臣佐之炁力不虚。 若修丹不识三才之理，浪用五金八石，虽得成丹铅，服之五粒，使髭发，十日内变白成炁，颜如处子。 虽即如户此，元无出世延年之功，算穷即死。 若三才得全，须备相类成丹，即服之，身便永在，寿与天地齐毕。 所以自天地始分以，只知有青腰使者，后人都不知用元教之化，不解采四时之炁，不解禀春夏秋冬为黄芽，既不能出世，亦无小小造化之门。",
      "translated_text": "**Chapter Nineteen: The Method of Lateral Qi Communication—The Gate of Resemblance**\n\nThe method of lateral *qi* communication relies on subduing the Three Yellows and the Eight Stones. One must not alter their original essence, allowing each to subdue fire.\n\nWhen subduing fire, one must not let it consume or scorch—all this is due to the lateral use of *qi*, guiding *qi* back to its true nature, so that its fundamental essence remains unchanged. This is called the \"subdued fire of the Three Yellows.\"\n\nThe methods for subduing these medicines are like the eclipse of the sun and moon: though temporarily obscured, they ultimately return to clarity, reverting to their original essence.\n\nThe methods for subduing the Three Yellows also require the power of saltpeter. Saltpeter is named Autumn Stone.\n\nWhy is it called Autumn Stone? Daoist practitioners of flying elixir must know its origin. The Autumn Stone—these Three Yellows—belong to the *qi* of Spring’s Grand Solar Yang, which is killed in Autumn; thus, saltpeter can subdue yang medicines. If one subdues the Three Yellows without using saltpeter, the yang toxicity will never dissipate.\n\nThe Three Yellows and Eight Stones all belong to fire, being pure yang *qi*. Their generation is akin to that of mercury, but mercury, when subdued by fire, becomes dry silver, retaining its original form. The Three Yellows and Eight Stones are all born of yang *qi*—how could one know their transformations?\n\nBut if one subdues the Two Yellows and Eight Stones without altering their original essence, their efficacy is boundless—this is entirely due to the power of Autumn Stone.\n\nThus, Autumn Stone is the sovereign of yang medicines. When using medicines, mastering their profound principles is like a sage ruler obtaining virtuous ministers. Autumn Stone is that minister.\n\nThe method for subduing saltpeter begins with obtaining white cinnabar stone, refining it with fire and water into powder, then using it to subdue Autumn Stone. Autumn Stone originally forms in cold, sunlit places, accumulating frost and ice to become white cinnabar—a product of ancient, congealed ice-earth, forming a white stone bed. From this bed, cinnabar emerges. Saltpeter, being of similar *qi*, is used in lateral communication to subdue mercury and cinnabar, preventing their essences from dispersing.\n\nThus, Autumn Stone is of the same primordial category. When subduing the Three Yellows and Eight Stones with it, the utmost yin can restrain and subdue them without altering their true form—this is due to the innate natures of these two medicines.\n\nNext, sulfur is paired with Autumn Stone. Sulfur originally derives from saltpeter, inherently bearing a white hue. Though sulfur itself has not been subdued by fire, when paired with saltpeter and used in lateral *qi* communication, it strengthens the power of Autumn Stone and saltpeter.\n\n---\n**Chapter Twenty: The Gate of Resemblance—Pairing Methods**\n\nTake Persian lead, which originates from the west’s *gēng-xīn* metals (iron and mercury). Lead contains gold, with its floral essence resembling the west’s *gēng-xīn* metals, while its substance resembles the north’s *rén-guǐ* water. Thus, ancient immortals recognized the floral essence of lead as the Yellow Sprout.\n\nYet those who extract only from lead’s exterior resemble *qi* of the same category in use—within one substance, gold and water are generated together. This is called \"resemblance,\" referring to form and essence.\n\nThe *Yin Lord* and *Bóhé Master* explain: The *Primordial Teachings* of the Celestial Worthy originated from the Flowing Sands, where it was named \"paired lead.\" Han Dynasty lead, though having floral essence, lacks purity, differing from the Flowing Sands lead of the Western lands. The Most High thus ordained the Flowing Sands lead as the true lead.\n\nObtaining Flowing Sands lead yields the Three Grades of Dan Gold, the first true lead of the immortals. The *Primordial Teachings* of the Mysterious Embryo are named Flowing Sands lead—this is Persian lead.\n\nIts paired lead within is like a person possessing talent and skill—both are inherent, not outwardly displayed. Thus, according to the *Lingbao Five Talismans*, \"The adept who does not return to the elixir embraces its pure flow; if the child obtains it, the True Person may be sought.\"\n\nIf lead is used without harming the Three Realms, it becomes the supreme medicine of Heaven. If it harms the Three Realms, its floral essence must be extracted. If its floral essence is extracted, the lead loses its *qi* and power. Though still taken from lead, it will never be true—unworthy to serve as minister or assistant.\n\nWhy is lead’s power incomplete? Because its original *qi* is lacking, and its true nature is impaired.\n\nIf the Three Realms remain whole, this is the supreme method of Heaven. If its floral essence is extracted, this is the secondary method of the Middle Realm. If used as an auxiliary, this is the inferior method of the Middle Realm. These three methods all stem from the sixteen gates of lead.\n\nIf one seeks to use them, one must clearly understand the Great Dao’s Primordial Teachings—without error—thus achieving the Three Dan methods, corresponding to the Three One Palaces. The Three Palaces are the Three Purities: Supreme Purity, Upper Purity, and Jade Purity, unified as the One Primordial Palace of Heaven.\n\nThe Three Dans must encompass the true natures of the Three Realms: lead, mercury, and sulfur. Malachite serves as a unique envoy, embodying the true nature of the Eastern lands. The East is the first of the four seasons, generating all things—nothing is untouched by its influence. Thus, malachite is the envoy of lead, the sinews and bones of mercury.\n\nLike wood containing fire, it can make lead, mercury, and sulfur into the Yellow Divine Glue, providing the *qi* and power of ministers and assistants.\n\nIf one refines the elixir without understanding the principles of the Three Realms, recklessly using the Five Metals and Eight Stones, even if one achieves lead elixir, consuming five grains will turn one’s beard and hair white in ten days, making one’s face like a maiden’s. Though this may seem miraculous, it lacks the function of transcending the world and prolonging life—exhaustion leads to death.\n\nBut if the Three Realms are complete, and the elixir is refined with proper resemblance, consuming it will make one’s body eternal, with lifespan equal to Heaven and Earth.\n\nThus, since the division of Heaven and Earth, only the Green Waist Envoy was known. Later generations did not understand the Primordial Teachings’ transformations, nor how to extract the *qi* of the four seasons, nor how to draw upon spring, summer, autumn, and winter to form the Yellow Sprout. Unable to transcend the world, they lack even minor alchemical gates.",
      "overlap_context": "n, carefully studying these lead techniques, which encompass sixteen methods, aligning with the Dao of Heaven and Earth. Those who master them become immortals.\n\nMoreover, worldly wealth and even the ability to alter one’s appearance into that of a maiden emerge from this lead. Its power grants longevity and eternal youth, encompassing all the gates of Heaven and Earth—all derived from this.\n\nBut with the true method obtained, nothing remains uncertain.\n\nNow, I briefly record these instructions.",
      "start_char": 13927,
      "end_char": 15206,
      "start_sentence": 626,
      "end_sentence": 677,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 18.451438426971436,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\阴真君金石五相类.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "亦不解借五行四炁，假炉火以铅炁为华池。 盖铅骨为黄芽，铅粉为臣佐，铅水为华池，铅质为五金之器，此铅功合五行，入一十六用之，用即各别，别中有至宝。 其铅属右将军，亦云女子性，又云阴，并属右，主阴煞阳，阳主左，左为男子，亦生三黄八石，性终被阴煞，象男子遗精於妇人之腹，不二也。 故阳死於阴者，明矣。 世人故合惜精保命，至药之理在此矣。 但三黄之性，须得阴杀，即伏之不走，亦不失元色者。 何也，为阳伏於阴故也。 世人不见日中有阴精，如人有妻，出入有常准矣。 是男子思妇人不去也。 是阳被阴煞，阳建即交阴杀也。 月中有阳精，如女人得婿之眷，为得阳之精炁所食，好杀阳精，而不相离也。 此是阴阳相感，男女交合，眷恋和畅，而成大道也。 日犹男，外阳而内阴。 月犹女，外阴而内阳。 二炁相感也。 三十日一交媾，而各相采其精华之炁，生育子孙万物也。 《易》日：阴阳之义配日月。 又曰．．一阴一阳之谓道。 又曰：悬象着明，莫大乎日月。 凡大丹亦呼为日月。 丹歌曰：圣人夺得造化意，手搏日月安炉裹。 微微腾倒天地精，钻簇阴阳走神鬼。 日魂月魄若个识，识者便是神仙子。 修之饵之千日斯，身已无阴那得死。 是知三黄，能得阴杀而成药焉。 如人怀孕十月而生，岂不是从阴腹伏养而成体也。 阳无阴不生，阴无阳不育，日无月不曜，月无日不明，终是历数。 阳毕死於阴者，感＇上将军处右之力，上者右也。 主煞伏。 男子脉左行，女子脉右转，乃知水银性虽含阳炁，未兔於太阴之体。 铅虽处壬子之位，不那内含金华之质，金水相类，得火成象矣。 水银是太阴之精，为内怀朱砂之体。 其朱砂元从阴宫变化，而居离位，与铅同宗，生於金华池，本乃一也。 华盖者，象天盖万物，虽密云不雨，然阴炁成雾露之炁，亦可润泽於万物。 铅华盖能覆育也。 白虎金鼎黄芽也，感气相类也。 凡龙是云之魂魄，云是雨之华盖。 雨水象铅水，於金堤防也。 虎是风之魂魄，风是雨之使者，各执一元元知，是炁法象於世界，囚死休废生王，只在其中。 万物生成，亦在其所。 故知从上古仙士。 存我玄元大造化之景，修炼三丹，计穷百液，成其至理，出於三元，变易载於天地，攀援引证，采摘名文，览自古之仙书，见神仙之妙理，合我玄元一教，儒释悉在其中。 齐通法象，起於庚辛，德号生於甲乙，根本伏於壬癸，得失不过丙丁，四象立天，八卦立地，三丹真理相须，类在於二十章中。 传而行之，审用勿错，名流大要，万载无歌。 凡修至药，古之忌讳，扶其鬼魅邪魔，亦须取相类物，而成利器，常置炉边，日移一方，名大要宝金之器，为用其器，取鬼缤铁，出白为刀，可长一尺二寸，下至五寸亦得。 如无此铁，纯钢亦得。 其次铜刀，亦须有雌雄之龙虎者，始得有灵。 切须人未曾用者，用者即不堪近炉。 凡以器制炁，须假雄雌之物而制之，诸器不入也。 且水银与铅，自禀雄雌之类，以合成其炁者。 假龙虎之质，相卫而行，龙虎是大道之质，所以邪魔鬼魅不敢近其炉鼎。 此刀若不烧药时，长在头边，一年一度出之，以香水沐浴，磨洗供养。 烧药即出巡行炉，则诸恶鬼魅远而畏之。 然亦知大道以器制炁，缘我玄元上真三丹，从金炁而成，还丹须得金利器以制之，助成其道焉。",
      "translated_text": "Nor do they understand how to borrow the Five Phases and Four *qi*, using furnace fire to transmute lead-*qi* into the Yellow Sprout’s pool.\n\nFor lead is the bone of the Yellow Sprout, lead powder its ministers, lead water its pool, and lead’s essence the vessel of the Five Metals. Lead’s function harmonizes with the Five Phases, entering sixteen applications—each distinct, yet within distinction lies the supreme treasure.\n\nLead belongs to the Right General, also called the feminine nature, or *yin*. It governs *yin* subduing *yang*—*yang* belongs to the Left, the masculine, which also generates the Three Yellows and Eight Stones. Yet its nature ultimately succumbs to *yin*’s subjugation, mirroring how a man’s essence spills into a woman’s womb—unaltered.\n\nThus, it is clear that *yang* dies under *yin*.\n\nHence, the world values preserving essence and safeguarding life—here lies the principle of medicine.\n\nYet the Three Yellows’ nature must be subjected to *yin*’s killing force, only then does it remain subdued and not dissipate, nor lose its original hue. Why? Because *yang* is ensconced within *yin*.\n\nThe world does not perceive *yin*-essence within the sun, as a man’s bond with his wife—constant in their union. This is *yang* being consumed by *yin*; when *yang* is established, it is met by *yin*’s subjugation.\n\nThe moon contains *yang*-essence, like a woman receiving her husband’s favor—devouring *yang*-*qi*, yet never parting. This is *yin* and *yang* responding, male and female merging in affectionate harmony, thus forming the Great Dao.\n\nThe sun is like a man—externally *yang*, internally *yin*.\nThe moon is like a woman—externally *yin*, internally *yang*.\nThe two *qi* interact.\n\nEvery thirty days they unite, each drawing the other’s refined essence to nurture all things.\n\nThe *Yijing* says: *\"The meaning of *yin* and *yang* corresponds to the sun and moon.\"*\nIt also says: *\"One *yin*, one *yang*—this is called the Dao.\"*\nAnd: *\"Suspended symbols, none greater than the sun and moon.\"*\nAll great elixirs are thus called sun and moon.\n\nThe elixir hymn states:\n*\"The Sage seizes the intent of Creation,\nWith hands clutching sun and moon within the furnace.\nSubtly stirring the essence of Heaven and Earth,\nPiercing *yin* and *yang* to move spirits and ghosts.\nWho recognizes the sun’s soul and moon’s shadow?\nThose who know are the Daoist immortals.\nRefining and ingesting for a thousand days,\nThe body then lacks *yin*—how could death come?\"*\n\nThus, the Three Yellows can be made into medicine only when subjected to *yin*’s killing force.\n\nAs when a woman bears a child for ten months—is it not nurtured within the *yin* womb to form its body?\n*Yang* cannot generate without *yin*; *yin* cannot bear without *yang*.\nThe sun cannot shine without the moon; the moon cannot illuminate without the sun—this is the natural order.\n\nWhen *yang* is exhausted and dies under *yin*, it is influenced by the Upper General’s power on the Right—the Upper, the Right. It governs subjugation.\n\nMen’s pulses flow leftward; women’s turn right—thus, though mercury contains *yang*-*qi*, it is not yet free from the *Taiyin* body.\nLead, though in the *Renzi* position, does not lack the essence of Golden Flower. Metal and water share affinities, and with fire, they manifest.\n\nMercury is the essence of *Taiyin*, containing cinnabar within. Cinnabar originally transforms from the *yin* palace yet resides in the *Li* position, sharing lineage with lead, born in the Golden Flower pool—essentially one.\n\nThe *Huagai* symbolizes Heaven’s canopy over all things. Though dense clouds may not rain, *yin*-*qi* forms mist and dew, nourishing all things.\nLead’s *Huagai* nurtures and covers.\n\nThe White Tiger is the Golden Flower’s *yang*—its *qi* aligns.\nAll dragons are the souls of clouds; clouds are the canopy of rain.\nRainwater mirrors lead water, a dam against metal.\nThe tiger is the soul of wind; wind is rain’s messenger—each holds its primal essence.\nThis *qi*’s law mirrors the cosmos: imprisonment, death, decay, rebirth, and kingship lie within.\nAll things’ generation is governed by this.\n\nThus, ancient Daoist masters preserved the primordial scene of Great Creation, refining the Three Elixirs, exhausting a hundred liquids, achieving ultimate truth from the Three Primordials. Their transformations are recorded in Heaven and Earth, verified through analogy and evidence, gathering ancient Daoist texts to perceive the mysteries of immortality. They unified the Primordial Teachings, encompassing Confucian and Buddhist doctrines alike.\n\nThe Four Symbols establish Heaven; the Eight Trigrams found Earth. The Three Elixirs’ true principles interdependently reside within the Twenty Chapters.\n\nTransmitted and practiced with precision, their essence flows without error—eternal principles, unchanging for ten thousand years.\n\nFor those refining the supreme medicine, ancient taboos must be observed. To repel ghosts, demons, and malevolent spirits, one must use analogous materials to forge potent tools, always kept beside the furnace. Shift their placement daily—these are the *Da Yao Bao Jin* instruments. Their use requires *gui ping* iron, forged white as a blade, one *chi* two *cun* long, or as short as five *cun*. If such iron is unavailable, pure steel suffices.\n\nNext is the copper blade, which must bear the *yin-yang* symbols of dragon and tiger to be efficacious. It must never have been used before—for once employed, it cannot endure near the furnace.\n\nAll tools that govern *qi* must be forged from *yin-yang* materials. Other tools are ineffective.\n\nMoreover, mercury and lead inherently embody *yin-yang* natures, merging to form their *qi*. Borrowing the essence of dragon and tiger, they guard each other—dragon and tiger are the substance of the Great Dao. Thus, malevolent spirits and ghosts dare not approach the furnace or cauldron.\n\nThis blade, when not in use, should rest beside the head, taken out once a year for purification with fragrant water, then polished and venerated. When refining elixirs, it patrols the furnace, driving away all evil spirits and instilling fear.\n\nYet it is known that the Great Dao uses tools to govern *qi*. Since the Primordial True Ones’ Three Elixirs are forged from metallic *qi*, the return elixir requires a metal tool to aid its completion.",
      "overlap_context": "nd the elixir is refined with proper resemblance, consuming it will make one’s body eternal, with lifespan equal to Heaven and Earth.\n\nThus, since the division of Heaven and Earth, only the Green Waist Envoy was known. Later generations did not understand the Primordial Teachings’ transformations, nor how to extract the *qi* of the four seasons, nor how to draw upon spring, summer, autumn, and winter to form the Yellow Sprout. Unable to transcend the world, they lack even minor alchemical gates.",
      "start_char": 15206,
      "end_char": 16467,
      "start_sentence": 678,
      "end_sentence": 731,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 16.90154194831848,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\阴真君金石五相类.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "相类品物，合成雌雄，铅汞二名，龙虎双得，坎离不离，相类一物，无不成焉。 通灵大道，秘要玉真诀中，道士用心，岂不见矣。 阴真君金石五相类竟",
      "translated_text": "The substances of like nature combine to form yin and yang—lead and mercury, the two names, both obtaining the essence of dragon and tiger. The Water and Fire phases never part; in all like substances, nothing fails to coalesce.\n\nThe Supreme Dao of Transcendence, within the *Secret Essentials of the Jade True One*, reveals its mysteries. The adept’s devotion—how could it not be manifest?\n\nThe Yin True Lord’s five metallic correspondences are now complete.",
      "overlap_context": "d ghosts dare not approach the furnace or cauldron.\n\nThis blade, when not in use, should rest beside the head, taken out once a year for purification with fragrant water, then polished and venerated. When refining elixirs, it patrols the furnace, driving away all evil spirits and instilling fear.\n\nYet it is known that the Great Dao uses tools to govern *qi*. Since the Primordial True Ones’ Three Elixirs are forged from metallic *qi*, the return elixir requires a metal tool to aid its completion.",
      "start_char": 16467,
      "end_char": 16537,
      "start_sentence": 732,
      "end_sentence": 734,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 1.3142812252044678,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\阴真君金石五相类.txt",
        "category": "众术类"
      }
    }
  ]
}