{
  "source_id": "陆先生道门科略",
  "source_file": "chunked_daozang\\陆先生道门科略.json",
  "total_chunks": 3,
  "total_original_chars": 3823,
  "total_translated_chars": 26073,
  "total_translation_time": 76.71386647224426,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太平部\\陆先生道门科略.txt",
    "category": "正统道藏太平部"
  },
  "full_translation": "**The *Lüsheng Dao* (Way of Master Lü) – Outline of Its Doctrines**\n\n**Title:** *Lüsheng Dao* – Outline of Its Doctrines.\n**Author:** The Daoist Lü Xiùjìng (陸修靜) of the Southern Song Dynasty (南朝劉宋).\n**Volume:** One.\n**Source:** *Zhèngtǒng Dàozàng* (正統道藏), **Tàipíng** (太平) Section.\n\n---\n\n**The *Lüsheng Dao* (Way of Master Lü) – Outline of Its Doctrines**\n\nThe Great Dao is void and tranquil, transcending all form and appearance;\nThe Most Exalted Sage’s conduct and teachings are embodied in words and precepts.\n\nSince the time of the Most High Laozi (太上老君) onward, ancient practices have fallen into disarray:\nPure and unadulterated, yet scattered and crude, the Three and Five (三五) were disordered,\nHumans and spirits confused, the Six Heavens’ residual *qi* (故氣) falsely claiming the titles of *Guānshàng* (官上) officials.\nThey amalgamated the hundred spirits (百精) and the Five Injured (五傷) ghosts,\nDefeated generals and slain soldiers, chaotic troops and fallen warriors—\nMen were called *Jiāngjūn* (將軍), women *Fūrén* (夫人),\nLeading ghostly armies, moving like wandering robbers across the heavens and earth,\nWielding arbitrary power, demanding tribute from households,\nSeeking offerings at ancestral shrines (飨祠), disturbing the people,\nSlaughtering the three kinds of sacrificial animals (三牲), consuming vast wealth,\nDraining finances and exhausting resources—\nYet they did not receive blessings in return,\nBut instead brought calamity upon those who honored them.\nPremature deaths and untimely fates (枉死橫夭) were countless.\n\nThe Most High, seeing such chaos, thus bestowed upon the *Tiānshī* (天師) the *Zhèngyī Miéngwēi* (正一盟威) precepts—\nInstituting prohibitions and doctrinal laws,\nExamining the conduct of all under heaven to determine their blessings and misfortunes, rewards and transgressions,\nSo they might know what is good and what is evil.\n\nEstablishing Twenty-Four *Zhì* (治) and Thirty-Six *Jìng* (靖) halls,\nWith two thousand four hundred Daoists—both inner and outer—\nUnder the *Qiān Èr Bǎi Guān Zhāngwén* (千二百官章文) of ten thousand decrees,\nThey wielded talismans to destroy temples (誅符伐廟),\nSlayed ghosts to save lives (殺鬼生人),\nPurified the cosmos (蕩涤宇宙),\nRestored the proper order of the Three and Five (明正三五),\nEncompassing the heavens and earth—\nNo more could the licentious and depraved ghosts (淫邪之鬼) prevail.\n\nThey abolished all forbidden altars (禁心),\nSimplified governance, and refined the administration of the people.\nThe gods did not partake in food and drink,\nThe Daoists did not accept money.\n\nThus the people were taught to cultivate inner filial piety and benevolence (內修慈孝),\nAnd to practice outer reverence and humility (外行敬讓),\nTo aid the times in harmonizing nature (佐時理化),\nAnd to assist the state in preserving life (助國扶命).\n\nOnly the Son of Heaven (天子) may sacrifice to Heaven,\nThe Three Exalted Ministers (三公) to the Five Sacred Peaks (五嶽),\nThe feudal lords (諸侯) to mountains and rivers,\nAnd the common folk on the five *Là* (腊) days and auspicious dates (吉日),\nHonoring their ancestors (祠先人),\nOr on the *Chūnqiū* (春秋) and *Shè* (社) days,\nSacrificing to the earth gods and kitchen altars (祭社灶).\nBeyond these occasions, no further sacrifices are permitted.\n\nIf one sacrifices to ancestors outside the five *Là* days or on non-auspicious dates,\nOr if one worships the earth gods and kitchen altars outside the *Chūnqiū* and *Shè* days,\nAll such acts are deemed *Yínzhì* (淫祠)—licentious sacrifices.\n\nIf the sick, unable to endure broths, medicines, acupuncture, or moxibustion,\nOnly take talismans and drink water,\nOr if one’s sins since birth—\nThose deserving death—are all pardoned,\nAnd chronic illnesses or lingering afflictions are healed,\nThen the highest virtue brings divine transcendence (上德神仙),\nThe middle virtue grants doubled lifespan (中德倍壽),\nAnd the lowest virtue extends years (下德延年).\n\nYet today’s adherents of the Dao have inverted these principles—\nNothing is done correctly, all is reversed.\n\nI humbly propose to rectify their ailments as follows:\nThe *Tiānshī* (天師) should establish proper governance and appoint officials,\nJust as the *Yángguān* (陽官) oversee prefectures, counties, and city halls,\nAnd all Daoists should be registered as household members (編戶著籍),\nEach belonging to their respective authority.\n\nOn the *Zhèngyuè Qīrì* (正月七日), *Qīyuè Qīrì* (七月七日), and *Shíyuè Wǔrì* (十月五日)—\nThree gatherings each year—\nThe people should assemble before their local Daoist masters (本治師),\nWho will then update the registers and records (改治錄籍),\nRemoving the dead and adding the living (落死上生),\nCorrecting hidden discrepancies and false declarations (隱實口數),\nEstablishing the true household ledgers (正定名簿),\nAnd issuing the Three Announcements and Five Commandments (三宣五令),\nSo the people may know the law.\n\nOn these days, the *Tiānguān* (天官) and earthly deities (地神) will all convene at the Daoist halls (師治),\nTo verify the records in person.\nBoth Daoists and laypeople must maintain solemn silence and purity (清靜肅然),\nRefraining from alcohol, meat, noise, or laughter.\nAfter the gathering, the people should return home\nAnd diligently convey the precepts, prohibitions, rituals, and teachings (聞科禁威儀教勑大小) to all,\nGreat and small, ensuring strict observance.\n\nThus the Dao’s influence will spread, and the land will know great peace (家國太平).\nYet today’s Daoists often fail to attend the gatherings,\nSome claiming the halls are too distant,\nOthers that this sect does not go there,\nAbandoning their true masters and visiting other halls instead.\nThey indulge in wine and feasting,\nMutually enticing one another in the streets.\nThe clear precepts and correct teachings are neglected,\nNo longer proclaimed, and the ancient laws and decrees (法典舊章) are thus lost.\n\nOnce the fundamental principles are abandoned,\nThen all else collapses into chaos (萬目亂溃),\nIgnorant of the precepts,\nOnly trusting in *Yínzhì* (淫祠) sacrifices.\nDaoist adherents do not recognize right and wrong,\nBut only seek food and drink in their rituals.\n\nBoth masters and disciples have strayed—\nNo longer is there proper guidance.\nThey act in secret, falsifying records,\nEvery movement is contrary to the law (動則乖喪),\nConfusing truth for falsehood, falsehood for truth,\nRight for wrong, wrong for right—\nIn myriad ways, nothing is done correctly.\nChaos and disorder reign, and they never realize their errors.\n\nSuch masters will perish, their lineage extinguished;\nSuch disciples will die young, their fates ruined.\nThough future generations may remain unaware,\nThe past has made this abundantly clear—\nThe enlightened and virtuous cannot fail to heed this warning.\n\nThe Daoist household registers (道科宅錄) are the people’s supplementary records.\nAll male and female names must be duly registered.\nThe officials who guard the registers must uphold their accuracy,\nAnd any changes in household numbers must be updated accordingly.\nIf a male child is born and reaches one month,\nOne hundred sheets of paper and a pair of writing brushes are offered,\nAnd an upper kitchen (上廚) of ten attendants is set.\nIf a female child is born and reaches one month,\nA broom and a dung basket—each one—are offered,\nAlong with a mat, and a middle kitchen (中廚) of five attendants is set.\n\nUpon marriage, an upper kitchen of ten attendants is established,\nAnd the register keeper must present the household records (宅錄) to the local Daoist master (本治),\nWho will then update the records in accordance with the true household ledgers (更相承錄，以注正命籍).\nOn the three gathering days, the Three Officials and Ten Thousand Gods (三官萬神) will cross-examine the registers.\n\nIf new births are not recorded, the Heavenly Bureau (天曹) will have no names;\nIf deaths are not removed, the ledgers will be inaccurate.\nYet today’s Daoists often register only one person at the start,\nAnd neglect to update the records for their descendants.\nOn the gathering days, they fail to submit their status,\nLacking both beginning and end—\nTheir true masters cannot know the situation,\nAnd they are held accountable to the previous year’s records.\n\nOr, when bones have rotted after death,\nThe registers still list them as living;\nOr, when a child is born and grows old,\nThey are never recorded at all.\nOr, when taking a wife, they fail to register her,\nOr, when a daughter is married off, they fail to remove her name.\n\nThus there are cases of century-old boys who have never been registered,\nAnd elderly virgins who have never been recorded as married.\nSuch confusion between life and death, presence and absence,\nLeads to false records on the day of illness—\nWhen they do not return to their true masters but instead appeal to other officials.\nThose other officials, not investigating the cause,\nSimply issue talismans without proper justification.\nFor those whose bodies are in agony,\nBut whose names are not in the registers,\nThese new talismans appear without reason—\nNot belonging to the guardians of the household records (非守宅所部),\nThe Three Masters (三師) do not recognize them,\nThe Three Heavens (三天) lack their names in the ledgers,\nThe *Sīmìng* (司命) officials have no record of them,\nAnd they are left to waste away in vain (徒碎首於地).\nThe documents are in disarray,\nThe rituals are not followed,\nAnd the Dao cannot bring salvation.\n\n「Such reasoning should not be overlooked. The Daoist rites of **commanding the Way** (奉道) are founded on the **Three Masters** (師) recording life and death (命籍). For the **Dao-citizens** (道民), faith (信) is the primary virtue.\n\nThe **Three Masters** register them with the **Three Heavens** (三天), and the **household guardians** (守宅之官) protect them according to their recorded names (籍口) to avert disasters and repel misfortunes. Though there are three annual assemblies (三会), the **Great Limit** (大限) is set on the fifth of the tenth month when the **life-and-death talisman** (信命) is delivered to the **Hall of Treatment** (治).\n\nIf a household remains secure, five **culinary officials** (厨) are appointed. If the number of mouths in the household decreases, the culinary officials are not set, yet the **life-and-death talisman** remains unchanged. If the **life-and-death talisman** fails to reach its destination, the records of life and death are not accepted.\n\nThough there are additional **heavy culinary blessings** (重厨福), they cannot compensate for the deficiency of this talisman. Thus, the teachings say: *\"Even if gold is precious, it cannot compare to the sacred talisman of life and death.\"* Households that command the Way without delivering the **life-and-death talisman** (命信) will, over time, see their names erased from the **Three Heavens'** ledgers** (三天削落名籍), their **household guardians** return to the **Celestial Bureau** (天曹), and the **Dao-qi** (道氣) no longer shield them. They will suffer harm from malevolent spirits (鬼贼), leading to untimely illness and death (丧疾夭横). Such households will never realize their peril, yet they blame their teachers and revile the Way—how could this not bring decline?\n\nFor households that command the Way, maintaining a **serene chamber** (靖室) is the place of utmost sincerity. Its exterior must be isolated, not connected to other dwellings; its interior must be pure and empty, free of extraneous objects. Opening and closing doors must be done with reverence, never carelessly or abruptly. Sweeping and tidying must be meticulous, as if the chamber were a **divine abode** (神居). Only a **fragrant censer** (香炉), **sacred lamp** (香灯), **talisman case** (章案), and **ritual knife** (书刀) should be placed there. These must be kept immaculately clean—even a hundred coins are insufficient to ensure their purity.\n\nCompare this to the **common households** (俗之家): their beds, seats, statues, banners, and coverings are adorned with countless embellishments. Is there not a stark difference between simplicity and extravagance, refinement and vulgarity?\n\nYet today, those who command the Way often lack a **serene chamber**. Some mark off a corner with a railing as their **treatment altar** (治坛), never clearing it of weeds and thorns that pierce the sky. Others, though they erect a dwelling, have no doors, allowing livestock to roam freely and filth to reach their knees. Some claim to have a **serene chamber**, yet store household goods within, with reckless comings and goings, and rats and dogs nesting there. How distant is such devotion from the **sublime and refined Way** (尊妙之道)?\n\nDaoist **ritual attire** (法服) is like the **court robes** (朝服) of the world. Officials, nobles, commoners, and all ranks have distinct gradations, governed by the **Five Hierarchies** (五等). Thus, the *Classic of Filial Piety* (《孝经》) states: *\"One does not dare wear the ritual robes of the ancient kings unless they are authentic.\"* The old ritual robes include **single garments** (单衣) and **black hemp mats** (祫帻), along with **arrow-generating robes** (箓生) and **cloth wrappings** (袴褶) for receiving the **talisman of Treatment** (受治之信). Males deliver **single garments of black** (单衣墨帻), while females offer **indigo robes** (绀衣). These clear distinctions suffice to resolve any doubts.\n\nThe **headwrap** (巾) and **rough hemp garments** (褐), as well as the **ritual apron** (帔) and **skirt** (裙), originate from the **Highest Dao** (上道). One wears the **rough hemp garments** when performing **rites of reverence** (礼拜), and the **ritual apron** when reciting **sutras** (诵经). These are the **precepts of the Three Caverns** (三洞)—how could they be trivial to lesser Daoists?\n\nRecently, those who have only just received the **minor talisman of Treatment** (小治) have secretly and improperly adopted the **arrow-generating robes** (箓生) and **cloth wrappings** (袴褶), already a grave error. Then they further compound it by wearing **caps and wrappings** (帽褶) with **skirts** (对裙), and **rough hemp garments** (帔褐) over **cloth wrappings** (着袴). Such chaotic mixing—how could it be called proper?\n\nThe **headwrap**, **rough hemp garments**, **skirt**, and **ritual apron** each have precise measurements in length and width, as well as the number of threads and seams. Thus, they are called **ritual attire** (法服), all bearing the **aura of威威 and神神** (威神). The **True Person of the Supreme Ultimate** (太极真人) declared: *\"If ritual attire is not made according to the precepts, the spirits and gods will punish the wearer.\"* Since these are not merely usurpations of rank but outright excess, how could misfortune be avoided?\n\nThe **precepts and teachings** (科教) state: *\"Three acts of diligence constitute one merit (功), and three merits constitute one virtue (德).\"* When a **Dao-citizen** (道民) possesses **three virtues**, they differ from the common folk and may be appointed to the **clerical ranks** (署箓). After receiving the **clerical talisman** (箓), they must further cultivate and advance through merit, progressing from the **talisman of the Ten Generals** (十将军箓) to the **rank of One Hundred Fifty** (百五十).\n\nIf among the **clerical officials** (箓吏) there are those who are **loyal and pure** (忠良质朴), **dutiful and cautious** (小心畏慎), **devoted to the Dao** (好道翘勤), and **versed in both old and new teachings** (温故知新), capable of **proclaiming the transformations** (宣化), they may be appointed as **scattered-qi Daoists** (散气道士). If among the **scattered-qi Daoists** there are those who **cultivate purity** (清修), they may be advanced to the **rank of separate treatment** (别治职任). If among those who **separately treat** (别治) there are those who **refine their practice** (精笃), they may be advanced to the **rank of wandering treatment** (游治职任). If among those who **wander and treat** (游治) there are those who **maintain strict discipline** (严能), they may be appointed as **lower treatment Daoists** (下治职任). If among the **lower treatment Daoists** there are those who **distinguish themselves by merit** (功称), they may be advanced to the **rank of paired treatment** (配治职任). If among those who **pairedly treat** (配治) there are those who **conform perfectly to the law** (合法), all **original treatment Daoists** (本治道士) should recommend them, presenting them as descendants of the **Celestial Master** (天师), for advancement to the **rank of Three Hundred Eighty** (三八之品).\n\nFirst, they are appointed to the **lower eight ranks** (下八之职). If they **diligently cultivate the Dao** (伏勤於道) and **persuade others with merit** (劝化有功), they may advance to the **middle eight ranks** (中八之职). If they **rescue all under heaven** (救治天下万姓), **support the perilous and aid the weak** (扶危济弱), and **can prolong life three times** (能度三命), they may advance to the **upper eight ranks** (上八之职). Those who **master the refinement of Dao-qi** (明炼道气), **save and benefit all beings** (救济一切), **dispel malevolent spiritual energy** (消灭鬼气), and **bring all under heaven to submission** (使万姓归伏) may be granted the **ranks of the Three Gases: Yangping, Lùtáng, and Hèmíng** (阳平、鹿堂、鹤鸣三气治职).\n\nThey must **scrutinize and implement** (精察施行) their **merits and virtues** (功德), seeking appropriate ranks and appointments. They must not **burden officials with unworthy individuals** (以人负官) nor **fail to appoint worthy individuals** (以官负人). If one **studies the Dao without proper lineage** (不由师成), they are **not a true root** (非根生). If one **does not inherit their original name** (不承本名), they are **rootless weeds** (无根之草). Receiving Daoist talismans out of proper order is called **not a true root** (非根生); not following one’s **original teacher** (本师) is called **not inheriting the original** (不承本).\n\nYet today, people receive Daoist talismans without these virtues, and they receive treatment without the requisite talent. These virtues refer to the **three virtues** (三德), and this talent is the **ability to proclaim transformations** (宣化之才). Some have no **teacher or talisman records** (师籍), though they may have previously commanded the Way, having lost their teacher long ago and never reattached themselves. Others were once common folk, wandering as strangers, taking up Daoism frivolously and with false pretenses. Daoists do not first **conform to the precepts and transform them** (依法化受), yet they are hastily granted talismans and treatment. Such individuals are entirely **devoid of substance** (虚妄), merely **pretending to be Daoists** (徒为道士). Even if they **diligently cultivate and perform good deeds** (修勤服善), the **Three Heavens** (三天) have no record of them, so they cannot escape **unjust suffering** (枉横). What then of those who **neglect and defy** (放慢违逆)?\n\nSome have **teachers without talisman records** (师无籍)—that is, though they have a teacher and master, they do not attend the **three annual assemblies** (三会), the **life-and-death talisman** does not reach its destination, their names are erased from the **Celestial Bureau** (天曹), hence they are **without**. Others, though they possess **teacher and talisman records**, lack virtue. On the day they receive their talismans, they instead **visit other officials**, neither returning to their **original teacher** nor ascending through proper ranks. They **recklessly accept appointments**, without discernment, and though many wear talismans and receive treatment, the treatment is **greatly flawed**. They compete to outdo one another in rank, advancing **unjustly**—so that one **personally receives the rank of lower treatment**, yet **appoints others to higher ranks**.」\n\nThe so-called disciples who have received the *Pínggài* and *Yùjú* talismans from the Celestial Master yet are appointed as *Yángpíng* or *Lùtáng* officials—these are the very ones who receive the *Bái Bǎn* and then impose it upon others.\n\nThose who have received the *Bái Bǎn* talisman, failing to present themselves to the Celestial Master for rectification, instead persist in passing it down to others for their entire lives. They act with reckless inversion, their misdeeds arising in chaotic confusion. With a body burdened by accumulated offenses, they wear hollow, false talismans. They have no household registration, yet maintain illicit correspondence. Some were once laypersons, burdened by ghostly sacrifices, who then entered Daoist practice without clearing their debts. From the moment they took up the path, their crimes and sins were rampant, yet they cling to their offenses, refusing repentance. They seek out deluded and false teachers, receiving untrue teachings.\n\nThey lack precepts and discipline, disregard instructions, violate prohibitions, and hold Dao and its laws in contempt. Those who receive the Dao must uphold precepts within and maintain proper decorum without, following prohibitions and adhering to instructions. Thus, the scriptures say: *\"If a Daoist does not receive the Old Lord’s one hundred and eighty precepts, they lack virtue and are not truly a Daoist. They may not receive the people’s worship, nor may they treat ghosts and spirits.\"* Since they are ignorant and unworthy, they do not understand the reverence of Daoist virtue. Their conduct is reckless and disrespectful toward sacred rites.\n\nThey indulge their greedy desires, drowning themselves in wine and gluttony. When practicing Daoist methods, they do not seek merit, and when treating others, they lack compassion. Their intentions are fixed on wealth and food, never instructing the people in prohibitions. They demand heavy tributes, inquire about fine foods, and consume the five pungent vegetables and the six kinds of meat—most taboo in Dao—violating prohibitions by slaughtering chickens, pigs, geese, and ducks. They drink to excess, then use this as an excuse to report their misconduct. Some even vomit beside the altar, and such individuals are not uncommon.\n\nThey abandon the pure and upright teachings of the *Alliance of威严* (威严盟), which states: *\"The teacher does not accept money, the spirits do not drink or eat\"*—this is called *Qīngyuē* (清约, purity and restraint). In treating illness, they do not use acupuncture, moxibustion, or herbal medicine, but only prescribe talismans and water. Their first offense is altering their conduct, submitting false reports instead. In matters of residence, tombs, relocation, or movement, they do not consult auspicious days or times, acting purely by whim, avoiding nothing. This is called *Yuē* (约, restraint). They neglect the myriad spirits and deities, yet claim to serve the Three Teachers of the Old Lord—this is called *Zhèngjiào* (正教, true teaching). Instead, they follow perverse and heretical methods:\n\n- Invoking ghosts and spirits for divination and fortune-telling is called *Xiān* (邪, heresy).\n- Speaking in the names of ghosts and spirits, predicting fortune and misfortune, is called *Xiān* (祆, Zoroastrian-like divination).\n- Creating taboos without proper Daoist authority is called *Wū* (巫, shamanistic).\n- Writing false charts for graves, residences, foundations, geomancy, or predicting calamities must be reported and expelled. Yet they still consult calendars, select days and times, and grow even more foolish. They refuse to follow the clear prohibitions, instead competing to use what the law forbids, turning from truth to falsehood—this is called *Dào* (倒, inversion).\n\nThey wield official seals and documents, wandering through villages. True Daoist practice is modest and unassuming, responding only when summoned, quietly refining their arts until seekers arrive. To parade through the streets is forbidden by law. When encountering those who violate prohibitions, they suffer misfortune. Though they claim to be Daoist followers, they have long abandoned their teachers, their talismans unregistered, their households without proper records. Some, though they have teachers, fail to attend the three auspicious assemblies on appointed days, yet when urgent matters arise, they hastily offer prayers and sacrifices, accepting favors without gratitude—this is called *Bū* (逋, delinquent). Though they profess Daoist practice, they disregard prohibitions, commit licentious acts, kill, believe in false divination, and engage in all manner of wickedness—this is called *Wéi* (违, transgression).\n\nAll who violate prohibitions will have their life-spans recorded in the Celestial Bureau erased, and the Three Officials will dispatch inspectors to guard their homes, interrogating their families and demanding they confess their misdeeds. Heavy crimes bring six calamities; lighter crimes bring five. These are: death, illness, legal troubles, imprisonment, fire, and theft. Such individuals, when facing urgent matters, should be Daoists who use scriptural prohibitions to avert punishment. If they repent sincerely, confess their sins, and swear to the Three Officials in writing, they may then be saved in accordance with the proper procedures.\n\nYet these deluded and false Daoists, lacking scriptural precepts to defend themselves, cannot distinguish truth from falsehood. They fabricate false reports, alter talismans at will—beginning and end mismatched, unworthy of reverence—yet presume to judge arbitrarily, defiling their cloths and inkstones, dishonoring paper and brushes. They scribble carelessly, staining their work with meat and alcohol, speaking whatever comes to mind, demanding false words without regard for truth. They reverse proper procedures, misjudging whether to absolve or bind, destroy or spare. Their actions are chaotic and unreliable. When submitting petitions, they do not examine the text carefully; what they understand, they proclaim loudly, heard by all neighbors. What they do not comprehend, they stammer and mumble, glossing over it carelessly. Such individuals are not fit to be messengers for officials or soldiers, and the Dao’s *qi* does not descend upon them. The more urgent the inspections become, the more desperate the sick grow, yet the results remain ineffective. Both patient and practitioner are misled, unaware of their errors, leading to slander of the Dao and blame upon the spirits. This may even result in the burning of talismans, destruction of altars, or abandonment of the practice. All such misdeeds invite retribution, bringing ruin to entire families.\n\nSuch failures must not go unexamined.\n\nThe *Lù Xiānshēng’s Daoist Precept Outline* is complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "陆先生道门科略 经名：陆先生道门科略。 南朝刘宋道士陆修静撰。 一卷。 底本出处：《正统道藏》太平部。 陆先生道门科略 夫大道虚寂，绝乎状貌； 至圣体行，寄之言教。 太上老君以下古委惹，淳浇朴散，三五失统，人鬼错乱，六天故气称官上号，构合百精及五伤之鬼、 败军死将、乱军死兵，男称将军，女称夫人，导从鬼兵，军行师止，游放天地，擅行威福，责人庙舍，求人飨祠，扰乱人民，宰杀三牲，费用万计，倾财竭产，不蒙其佑，反受其患，枉死横夭，不可称数。 太上患其若此，故授天师正一盟威之道，禁戒律科，检示万民逆顺、祸福、功过，令知好恶。 置二十四治、三十六靖庐，内外道士二千四百人，下《千二百官章文》万通，诛符伐庙，杀鬼生人，荡涤宇宙，明正三五，周天匝地，不得复有淫邪之鬼。 罢诸禁心，清约治民，神不饮食，师不受钱。 使民内修慈孝，外行敬让，佐时理化，助国扶命。 唯天子祭天，三公祭五岳，诸侯祭山川，民人五腊吉日祠先人、二月八月祭社灶，自此以外，不得有所祭。 若非五腊吉日而祠先人，非春秋社日而祭社灶，皆犯淫祠。 若疾病之人不胜汤药针灸，惟服符饮水，及首生年以来所犯罪过，罪应死者皆为原赦，积疾困病莫不生全。 故上德神仙，中德倍寿，下德延年。 而今之奉道，是事颠倒，无事不反。 余谨请为出其疾病如左，天师立治置职，犹阳官郡县城府治理民物，奉道者皆编户着籍，各有所属。 令以正月七日、七月七日、十月五日，一年三会，民各投集本治师，当改治录籍，落死上生，隐实口数，正定名簿，三宣五令，令民知法。 其日天官地神咸会师治，对校文书，师民皆当清静肃然，不得饮酒食肉，喧哗言笑。 会竟，民还家，当以闻科禁威仪教勑大小，务共奉行。 如此道化宣流，家国太平。 而今人奉道，多不赴会，或以道远为辞，或以此门不往，舍背本师，越诣他治。 唯高尚酒食，更相街诱。 明科正教，废不复宣，法典旧章，於是沦坠。 元纲既弛，则万目乱溃，不知科宪，唯信是亲。 道民不识逆顺，但肴馔是闻。 上下俱失，无复依承。 相与意断暗斫，动则乖丧，以真为伪，以伪为真，以是为非，以非为是，千端万绪，何事不僻，颠倒乱杂，永不自觉。 如此之师，则灭后绝种； 如此之民，则夭横破丧。 虽来者令昧然，过去甚昭然，明白君子，可不鉴之。 道科宅录，此是民之副籍。 男女口数，悉应注上。 守宅之官，以之为正，人口动止，皆当营卫，三时迁言，事有常典。 若口数增减，皆应改籍。 若生男满月，赍纸一百、笔一双，设上厨十人。 生女满月，赍扫帚、粪箕各一枚，席一领，设中厨五人。 娶妇，设上厨十人，籍主皆赍宅录诣本治，更相承录，以注正命籍。 三会之日，三官万神更相拣当。 若增口不上，天曹无名； 减口不除，则名簿不实。 今人奉道，或初化一人，至子孙不改。 三会之日又不投状，既无本末，本师不能得知，为依先上年。 或死骨烂，籍犹载存； 或生皓首，未被纪录； 或纳妻不上，或出嫁不除。 乃有百岁童男，期颐处女。 如此存亡混谬，有无不实，至於疾病之日，不归本师而告请他官。 他官不寻所由，便为作章，疾痛之身，录籍先无，今章忽有，非守宅所部，三师不领，三天阙籍，司命无名，徒碎首於地，文案纷纷，既不如法，道所不济。",
      "translated_text": "**The *Lüsheng Dao* (Way of Master Lü) – Outline of Its Doctrines**\n\n**Title:** *Lüsheng Dao* – Outline of Its Doctrines.\n**Author:** The Daoist Lü Xiùjìng (陸修靜) of the Southern Song Dynasty (南朝劉宋).\n**Volume:** One.\n**Source:** *Zhèngtǒng Dàozàng* (正統道藏), **Tàipíng** (太平) Section.\n\n---\n\n**The *Lüsheng Dao* (Way of Master Lü) – Outline of Its Doctrines**\n\nThe Great Dao is void and tranquil, transcending all form and appearance;\nThe Most Exalted Sage’s conduct and teachings are embodied in words and precepts.\n\nSince the time of the Most High Laozi (太上老君) onward, ancient practices have fallen into disarray:\nPure and unadulterated, yet scattered and crude, the Three and Five (三五) were disordered,\nHumans and spirits confused, the Six Heavens’ residual *qi* (故氣) falsely claiming the titles of *Guānshàng* (官上) officials.\nThey amalgamated the hundred spirits (百精) and the Five Injured (五傷) ghosts,\nDefeated generals and slain soldiers, chaotic troops and fallen warriors—\nMen were called *Jiāngjūn* (將軍), women *Fūrén* (夫人),\nLeading ghostly armies, moving like wandering robbers across the heavens and earth,\nWielding arbitrary power, demanding tribute from households,\nSeeking offerings at ancestral shrines (飨祠), disturbing the people,\nSlaughtering the three kinds of sacrificial animals (三牲), consuming vast wealth,\nDraining finances and exhausting resources—\nYet they did not receive blessings in return,\nBut instead brought calamity upon those who honored them.\nPremature deaths and untimely fates (枉死橫夭) were countless.\n\nThe Most High, seeing such chaos, thus bestowed upon the *Tiānshī* (天師) the *Zhèngyī Miéngwēi* (正一盟威) precepts—\nInstituting prohibitions and doctrinal laws,\nExamining the conduct of all under heaven to determine their blessings and misfortunes, rewards and transgressions,\nSo they might know what is good and what is evil.\n\nEstablishing Twenty-Four *Zhì* (治) and Thirty-Six *Jìng* (靖) halls,\nWith two thousand four hundred Daoists—both inner and outer—\nUnder the *Qiān Èr Bǎi Guān Zhāngwén* (千二百官章文) of ten thousand decrees,\nThey wielded talismans to destroy temples (誅符伐廟),\nSlayed ghosts to save lives (殺鬼生人),\nPurified the cosmos (蕩涤宇宙),\nRestored the proper order of the Three and Five (明正三五),\nEncompassing the heavens and earth—\nNo more could the licentious and depraved ghosts (淫邪之鬼) prevail.\n\nThey abolished all forbidden altars (禁心),\nSimplified governance, and refined the administration of the people.\nThe gods did not partake in food and drink,\nThe Daoists did not accept money.\n\nThus the people were taught to cultivate inner filial piety and benevolence (內修慈孝),\nAnd to practice outer reverence and humility (外行敬讓),\nTo aid the times in harmonizing nature (佐時理化),\nAnd to assist the state in preserving life (助國扶命).\n\nOnly the Son of Heaven (天子) may sacrifice to Heaven,\nThe Three Exalted Ministers (三公) to the Five Sacred Peaks (五嶽),\nThe feudal lords (諸侯) to mountains and rivers,\nAnd the common folk on the five *Là* (腊) days and auspicious dates (吉日),\nHonoring their ancestors (祠先人),\nOr on the *Chūnqiū* (春秋) and *Shè* (社) days,\nSacrificing to the earth gods and kitchen altars (祭社灶).\nBeyond these occasions, no further sacrifices are permitted.\n\nIf one sacrifices to ancestors outside the five *Là* days or on non-auspicious dates,\nOr if one worships the earth gods and kitchen altars outside the *Chūnqiū* and *Shè* days,\nAll such acts are deemed *Yínzhì* (淫祠)—licentious sacrifices.\n\nIf the sick, unable to endure broths, medicines, acupuncture, or moxibustion,\nOnly take talismans and drink water,\nOr if one’s sins since birth—\nThose deserving death—are all pardoned,\nAnd chronic illnesses or lingering afflictions are healed,\nThen the highest virtue brings divine transcendence (上德神仙),\nThe middle virtue grants doubled lifespan (中德倍壽),\nAnd the lowest virtue extends years (下德延年).\n\nYet today’s adherents of the Dao have inverted these principles—\nNothing is done correctly, all is reversed.\n\nI humbly propose to rectify their ailments as follows:\nThe *Tiānshī* (天師) should establish proper governance and appoint officials,\nJust as the *Yángguān* (陽官) oversee prefectures, counties, and city halls,\nAnd all Daoists should be registered as household members (編戶著籍),\nEach belonging to their respective authority.\n\nOn the *Zhèngyuè Qīrì* (正月七日), *Qīyuè Qīrì* (七月七日), and *Shíyuè Wǔrì* (十月五日)—\nThree gatherings each year—\nThe people should assemble before their local Daoist masters (本治師),\nWho will then update the registers and records (改治錄籍),\nRemoving the dead and adding the living (落死上生),\nCorrecting hidden discrepancies and false declarations (隱實口數),\nEstablishing the true household ledgers (正定名簿),\nAnd issuing the Three Announcements and Five Commandments (三宣五令),\nSo the people may know the law.\n\nOn these days, the *Tiānguān* (天官) and earthly deities (地神) will all convene at the Daoist halls (師治),\nTo verify the records in person.\nBoth Daoists and laypeople must maintain solemn silence and purity (清靜肅然),\nRefraining from alcohol, meat, noise, or laughter.\nAfter the gathering, the people should return home\nAnd diligently convey the precepts, prohibitions, rituals, and teachings (聞科禁威儀教勑大小) to all,\nGreat and small, ensuring strict observance.\n\nThus the Dao’s influence will spread, and the land will know great peace (家國太平).\nYet today’s Daoists often fail to attend the gatherings,\nSome claiming the halls are too distant,\nOthers that this sect does not go there,\nAbandoning their true masters and visiting other halls instead.\nThey indulge in wine and feasting,\nMutually enticing one another in the streets.\nThe clear precepts and correct teachings are neglected,\nNo longer proclaimed, and the ancient laws and decrees (法典舊章) are thus lost.\n\nOnce the fundamental principles are abandoned,\nThen all else collapses into chaos (萬目亂溃),\nIgnorant of the precepts,\nOnly trusting in *Yínzhì* (淫祠) sacrifices.\nDaoist adherents do not recognize right and wrong,\nBut only seek food and drink in their rituals.\n\nBoth masters and disciples have strayed—\nNo longer is there proper guidance.\nThey act in secret, falsifying records,\nEvery movement is contrary to the law (動則乖喪),\nConfusing truth for falsehood, falsehood for truth,\nRight for wrong, wrong for right—\nIn myriad ways, nothing is done correctly.\nChaos and disorder reign, and they never realize their errors.\n\nSuch masters will perish, their lineage extinguished;\nSuch disciples will die young, their fates ruined.\nThough future generations may remain unaware,\nThe past has made this abundantly clear—\nThe enlightened and virtuous cannot fail to heed this warning.\n\nThe Daoist household registers (道科宅錄) are the people’s supplementary records.\nAll male and female names must be duly registered.\nThe officials who guard the registers must uphold their accuracy,\nAnd any changes in household numbers must be updated accordingly.\nIf a male child is born and reaches one month,\nOne hundred sheets of paper and a pair of writing brushes are offered,\nAnd an upper kitchen (上廚) of ten attendants is set.\nIf a female child is born and reaches one month,\nA broom and a dung basket—each one—are offered,\nAlong with a mat, and a middle kitchen (中廚) of five attendants is set.\n\nUpon marriage, an upper kitchen of ten attendants is established,\nAnd the register keeper must present the household records (宅錄) to the local Daoist master (本治),\nWho will then update the records in accordance with the true household ledgers (更相承錄，以注正命籍).\nOn the three gathering days, the Three Officials and Ten Thousand Gods (三官萬神) will cross-examine the registers.\n\nIf new births are not recorded, the Heavenly Bureau (天曹) will have no names;\nIf deaths are not removed, the ledgers will be inaccurate.\nYet today’s Daoists often register only one person at the start,\nAnd neglect to update the records for their descendants.\nOn the gathering days, they fail to submit their status,\nLacking both beginning and end—\nTheir true masters cannot know the situation,\nAnd they are held accountable to the previous year’s records.\n\nOr, when bones have rotted after death,\nThe registers still list them as living;\nOr, when a child is born and grows old,\nThey are never recorded at all.\nOr, when taking a wife, they fail to register her,\nOr, when a daughter is married off, they fail to remove her name.\n\nThus there are cases of century-old boys who have never been registered,\nAnd elderly virgins who have never been recorded as married.\nSuch confusion between life and death, presence and absence,\nLeads to false records on the day of illness—\nWhen they do not return to their true masters but instead appeal to other officials.\nThose other officials, not investigating the cause,\nSimply issue talismans without proper justification.\nFor those whose bodies are in agony,\nBut whose names are not in the registers,\nThese new talismans appear without reason—\nNot belonging to the guardians of the household records (非守宅所部),\nThe Three Masters (三師) do not recognize them,\nThe Three Heavens (三天) lack their names in the ledgers,\nThe *Sīmìng* (司命) officials have no record of them,\nAnd they are left to waste away in vain (徒碎首於地).\nThe documents are in disarray,\nThe rituals are not followed,\nAnd the Dao cannot bring salvation.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1274,
      "start_sentence": 0,
      "end_sentence": 51,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 28.207125902175903,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\陆先生道门科略.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "如此之理，可不思乎。 奉道之科，师以命籍为本，道民以信为主。 师为列上三天，请守宅之官依籍口保护，禳灾却祸。 虽一年三会，大限以十月五日赍信一到治。 又若家居安全，设上厨五人。 若口数减落，厨则不设，赍信如故。 若命信不到，则命籍不上。 虽复别有重厨福，不解此信之阙。 故教云：千金虽贵，未若本宝之信命。 奉道之家不赍命信，动积年岁，如此三天削落名籍，守宅之官还天曹，道气不复覆盖，鬼贼所伤害，致丧疾夭横。 轗轲之家，永不自觉，反咎师怨道，可不衰哉。 奉道之家，靖室是致诚之所。 其外别绝，不连他屋； 其中清虚，不杂余物。 开闭门户，不妄触突。 洒扫精肃，常若神居。 唯置香炉、香灯、章案、书刀四物而已。 必其素净，政可堪百余钱耳。 比杂俗之家，床座形像幡盖众饰，不亦有繁简之殊，华素之异耶？ 而今奉道者，多无静室，或标栏一地为治坛，未曾修除，草莽刺天； 或虽立屋宇，无有门户，六畜游处，粪秽没膝； 或名为静室，而藏家什物，唐突出入，鼠犬栖止。 以此祈尊妙之道，不亦远耶？ 道家法服，犹世朝服，公侯士庶，各有品秩，五等之制，以别贵贱。 故《孝经》云：非先王之法服不敢服。 旧法服单衣祫帻，箓生袴褶，所以受治之信。 男赍单衣墨帻，女则绀衣。 此之明文，足以定疑。 巾褐及帔，出自上道。 礼拜着褐，诵经着帔。 三洞之轨范，岂小道之所预。 顷来才受小治，或箓生之法窃滥帔褐，已自大谬，乃复帽褶对裙，帔褐着袴，此之乱杂，何可称论。 夫巾褐裙帔，制作长短，条缝多少，各有准式，故谓之法服，皆有威神侍卫。 太极真人云：制作不得法，则鬼神罚人。 既非分僭滥，祸可无乎？ 科教云：民有三勤为一功，三功为一德。 民有三德则与凡异，听得署箓。 受箓之后，须有功更迁，从十将军箓，阶至百五十。 若箓吏中有忠良质朴，小心畏慎，好道翘勤，温故知新，堪任宣化，可署散气道士。 若散气中能有清修者，可迁别治职任。 若别治中复有精笃者，可迁署游治职任。 若游治中复有严能者，可署下治职任。 若下治中复有功称者，可迁署配治职任。 若配治中复有合法者，本治道士皆当保举，表天师子孙，迁除三八之品。 先署下八之职，若有伏勤於道，劝化有功，进中八之职。 若救治天下万姓，扶危济弱，能度三命，进上八之职。 能明炼道气，救济一切，消灭鬼气，使万姓归伏，便拜阳平、鹿堂、鹤鸣三气治职。 当精察施行功德，采求职署，勿以人负官，勿以官负人。 若学不由师成，非根生； 不承本名，为无根之草。 受道越次第，谓之非根生； 不缘本师起，谓之不承本也。 而今人受箓，无此德，受治，无此才。 此德谓三德，此才宣化之才也。 或都无师籍，人先虽奉道，失师来久，不复更属，或先是凡俗之民，一身流寓，浮好假信，道士不先依法化受，而便授箓治，如此之人皆是虚妄，徒为道士，纵复修勤服善，三天无名，故不兔於枉横矣。 况其放慢违逆者乎！ 或有师无籍，谓虽有师主，三会不到治，命信不上，天曹削籍，所以为无。 或虽有师籍而无德，於时受箓之日，越诣他官，既不归本，又不缘阶，妄相置署，不择其人，佩箓惟多，受治惟多，受治惟大，争先竞胜，更相高上，遂乃身受下治，署人上品。",
      "translated_text": "「Such reasoning should not be overlooked. The Daoist rites of **commanding the Way** (奉道) are founded on the **Three Masters** (師) recording life and death (命籍). For the **Dao-citizens** (道民), faith (信) is the primary virtue.\n\nThe **Three Masters** register them with the **Three Heavens** (三天), and the **household guardians** (守宅之官) protect them according to their recorded names (籍口) to avert disasters and repel misfortunes. Though there are three annual assemblies (三会), the **Great Limit** (大限) is set on the fifth of the tenth month when the **life-and-death talisman** (信命) is delivered to the **Hall of Treatment** (治).\n\nIf a household remains secure, five **culinary officials** (厨) are appointed. If the number of mouths in the household decreases, the culinary officials are not set, yet the **life-and-death talisman** remains unchanged. If the **life-and-death talisman** fails to reach its destination, the records of life and death are not accepted.\n\nThough there are additional **heavy culinary blessings** (重厨福), they cannot compensate for the deficiency of this talisman. Thus, the teachings say: *\"Even if gold is precious, it cannot compare to the sacred talisman of life and death.\"* Households that command the Way without delivering the **life-and-death talisman** (命信) will, over time, see their names erased from the **Three Heavens'** ledgers** (三天削落名籍), their **household guardians** return to the **Celestial Bureau** (天曹), and the **Dao-qi** (道氣) no longer shield them. They will suffer harm from malevolent spirits (鬼贼), leading to untimely illness and death (丧疾夭横). Such households will never realize their peril, yet they blame their teachers and revile the Way—how could this not bring decline?\n\nFor households that command the Way, maintaining a **serene chamber** (靖室) is the place of utmost sincerity. Its exterior must be isolated, not connected to other dwellings; its interior must be pure and empty, free of extraneous objects. Opening and closing doors must be done with reverence, never carelessly or abruptly. Sweeping and tidying must be meticulous, as if the chamber were a **divine abode** (神居). Only a **fragrant censer** (香炉), **sacred lamp** (香灯), **talisman case** (章案), and **ritual knife** (书刀) should be placed there. These must be kept immaculately clean—even a hundred coins are insufficient to ensure their purity.\n\nCompare this to the **common households** (俗之家): their beds, seats, statues, banners, and coverings are adorned with countless embellishments. Is there not a stark difference between simplicity and extravagance, refinement and vulgarity?\n\nYet today, those who command the Way often lack a **serene chamber**. Some mark off a corner with a railing as their **treatment altar** (治坛), never clearing it of weeds and thorns that pierce the sky. Others, though they erect a dwelling, have no doors, allowing livestock to roam freely and filth to reach their knees. Some claim to have a **serene chamber**, yet store household goods within, with reckless comings and goings, and rats and dogs nesting there. How distant is such devotion from the **sublime and refined Way** (尊妙之道)?\n\nDaoist **ritual attire** (法服) is like the **court robes** (朝服) of the world. Officials, nobles, commoners, and all ranks have distinct gradations, governed by the **Five Hierarchies** (五等). Thus, the *Classic of Filial Piety* (《孝经》) states: *\"One does not dare wear the ritual robes of the ancient kings unless they are authentic.\"* The old ritual robes include **single garments** (单衣) and **black hemp mats** (祫帻), along with **arrow-generating robes** (箓生) and **cloth wrappings** (袴褶) for receiving the **talisman of Treatment** (受治之信). Males deliver **single garments of black** (单衣墨帻), while females offer **indigo robes** (绀衣). These clear distinctions suffice to resolve any doubts.\n\nThe **headwrap** (巾) and **rough hemp garments** (褐), as well as the **ritual apron** (帔) and **skirt** (裙), originate from the **Highest Dao** (上道). One wears the **rough hemp garments** when performing **rites of reverence** (礼拜), and the **ritual apron** when reciting **sutras** (诵经). These are the **precepts of the Three Caverns** (三洞)—how could they be trivial to lesser Daoists?\n\nRecently, those who have only just received the **minor talisman of Treatment** (小治) have secretly and improperly adopted the **arrow-generating robes** (箓生) and **cloth wrappings** (袴褶), already a grave error. Then they further compound it by wearing **caps and wrappings** (帽褶) with **skirts** (对裙), and **rough hemp garments** (帔褐) over **cloth wrappings** (着袴). Such chaotic mixing—how could it be called proper?\n\nThe **headwrap**, **rough hemp garments**, **skirt**, and **ritual apron** each have precise measurements in length and width, as well as the number of threads and seams. Thus, they are called **ritual attire** (法服), all bearing the **aura of威威 and神神** (威神). The **True Person of the Supreme Ultimate** (太极真人) declared: *\"If ritual attire is not made according to the precepts, the spirits and gods will punish the wearer.\"* Since these are not merely usurpations of rank but outright excess, how could misfortune be avoided?\n\nThe **precepts and teachings** (科教) state: *\"Three acts of diligence constitute one merit (功), and three merits constitute one virtue (德).\"* When a **Dao-citizen** (道民) possesses **three virtues**, they differ from the common folk and may be appointed to the **clerical ranks** (署箓). After receiving the **clerical talisman** (箓), they must further cultivate and advance through merit, progressing from the **talisman of the Ten Generals** (十将军箓) to the **rank of One Hundred Fifty** (百五十).\n\nIf among the **clerical officials** (箓吏) there are those who are **loyal and pure** (忠良质朴), **dutiful and cautious** (小心畏慎), **devoted to the Dao** (好道翘勤), and **versed in both old and new teachings** (温故知新), capable of **proclaiming the transformations** (宣化), they may be appointed as **scattered-qi Daoists** (散气道士). If among the **scattered-qi Daoists** there are those who **cultivate purity** (清修), they may be advanced to the **rank of separate treatment** (别治职任). If among those who **separately treat** (别治) there are those who **refine their practice** (精笃), they may be advanced to the **rank of wandering treatment** (游治职任). If among those who **wander and treat** (游治) there are those who **maintain strict discipline** (严能), they may be appointed as **lower treatment Daoists** (下治职任). If among the **lower treatment Daoists** there are those who **distinguish themselves by merit** (功称), they may be advanced to the **rank of paired treatment** (配治职任). If among those who **pairedly treat** (配治) there are those who **conform perfectly to the law** (合法), all **original treatment Daoists** (本治道士) should recommend them, presenting them as descendants of the **Celestial Master** (天师), for advancement to the **rank of Three Hundred Eighty** (三八之品).\n\nFirst, they are appointed to the **lower eight ranks** (下八之职). If they **diligently cultivate the Dao** (伏勤於道) and **persuade others with merit** (劝化有功), they may advance to the **middle eight ranks** (中八之职). If they **rescue all under heaven** (救治天下万姓), **support the perilous and aid the weak** (扶危济弱), and **can prolong life three times** (能度三命), they may advance to the **upper eight ranks** (上八之职). Those who **master the refinement of Dao-qi** (明炼道气), **save and benefit all beings** (救济一切), **dispel malevolent spiritual energy** (消灭鬼气), and **bring all under heaven to submission** (使万姓归伏) may be granted the **ranks of the Three Gases: Yangping, Lùtáng, and Hèmíng** (阳平、鹿堂、鹤鸣三气治职).\n\nThey must **scrutinize and implement** (精察施行) their **merits and virtues** (功德), seeking appropriate ranks and appointments. They must not **burden officials with unworthy individuals** (以人负官) nor **fail to appoint worthy individuals** (以官负人). If one **studies the Dao without proper lineage** (不由师成), they are **not a true root** (非根生). If one **does not inherit their original name** (不承本名), they are **rootless weeds** (无根之草). Receiving Daoist talismans out of proper order is called **not a true root** (非根生); not following one’s **original teacher** (本师) is called **not inheriting the original** (不承本).\n\nYet today, people receive Daoist talismans without these virtues, and they receive treatment without the requisite talent. These virtues refer to the **three virtues** (三德), and this talent is the **ability to proclaim transformations** (宣化之才). Some have no **teacher or talisman records** (师籍), though they may have previously commanded the Way, having lost their teacher long ago and never reattached themselves. Others were once common folk, wandering as strangers, taking up Daoism frivolously and with false pretenses. Daoists do not first **conform to the precepts and transform them** (依法化受), yet they are hastily granted talismans and treatment. Such individuals are entirely **devoid of substance** (虚妄), merely **pretending to be Daoists** (徒为道士). Even if they **diligently cultivate and perform good deeds** (修勤服善), the **Three Heavens** (三天) have no record of them, so they cannot escape **unjust suffering** (枉横). What then of those who **neglect and defy** (放慢违逆)?\n\nSome have **teachers without talisman records** (师无籍)—that is, though they have a teacher and master, they do not attend the **three annual assemblies** (三会), the **life-and-death talisman** does not reach its destination, their names are erased from the **Celestial Bureau** (天曹), hence they are **without**. Others, though they possess **teacher and talisman records**, lack virtue. On the day they receive their talismans, they instead **visit other officials**, neither returning to their **original teacher** nor ascending through proper ranks. They **recklessly accept appointments**, without discernment, and though many wear talismans and receive treatment, the treatment is **greatly flawed**. They compete to outdo one another in rank, advancing **unjustly**—so that one **personally receives the rank of lower treatment**, yet **appoints others to higher ranks**.」",
      "overlap_context": "ustification.\nFor those whose bodies are in agony,\nBut whose names are not in the registers,\nThese new talismans appear without reason—\nNot belonging to the guardians of the household records (非守宅所部),\nThe Three Masters (三師) do not recognize them,\nThe Three Heavens (三天) lack their names in the ledgers,\nThe *Sīmìng* (司命) officials have no record of them,\nAnd they are left to waste away in vain (徒碎首於地).\nThe documents are in disarray,\nThe rituals are not followed,\nAnd the Dao cannot bring salvation.",
      "start_char": 1274,
      "end_char": 2519,
      "start_sentence": 52,
      "end_sentence": 109,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 31.716089487075806,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\陆先生道门科略.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "谓自受天师平盖、玉局之徒，乃署人阳平、鹿堂。 或自荷白板，而加板於人。 谓自受白板治，既不诣天师除正，遂以终身常后白板於人。 纵横颠倒，乱杂互起，以积衅之身，佩虚伪之治箓。 绝无户籍，有通信宿，或先是俗身，负鬼祭馔，越入道法，不收结赃直，立身以来，罪恶狼籍，而抱衅带咎，永不肯改，而诣狂伪之师，受不真之法也。 身无戒律，不顺教令，越科破禁，轻道贱法。 夫受道之人，内执戒律，外持威仪，依科避禁，遵承教令。 故经云：道士不受老君百八十戒，其身无德，则非道士，不得当百姓拜，不可以收治鬼神。 其既暗浊，不知道德尊重，则举止轻脱，贱慢法术也。 恣贪欲之性，而耽酒嗜食。 宣行道法，不期於功德，救治之日，非慈仁之意，但希望财利，念在酒食，永不以科禁示民，惟课责重，询求好食，五辛之菜，六畜之肉，道之至忌，啖之已自犯禁，乃复宰杀鸡纯鹅鸭，饮酒洪醉，乘以奏闻，遂有寝外靖坛，吐呕案侧，如斯之徒，往往有之。 背盟威清约之正教，盟威法：师不受钱，神不饮食，谓之清约。 治病不针灸扬药，唯服符饮水，首罪改行，章奏而已。 居宅安冢，移徙动止，百事不卜日问时，任心而行，无所避就，谓约。 千精万灵，一切神祇，皆所废弃，临奉老君三师，谓之正教。 向邪僻祆巫之倒法。 祭祀鬼神，祈求福祚，谓之邪。 称鬼神语，占察吉凶，谓之祆。 非师老科教而妄作忌讳，谓之巫。 书是图占、冢宅、地基、堪与、凶咎之属，须上章驱除。 乃复有历，拣日择时，愚僻转甚，正科所明，永不肯从，法之所禁，而竞尊用，背真向伪，谓之倒也。 把持刀笔，游走村里。 道法廉退，应而不唱，静躬修术，以待求者，告诉慊至，然后抚接。 若游行自街，法之所禁。 遇通违之民，婴考被灾。 虽是道民，失师来久，治无命籍，家无宅箓。 或有师主，三吉之日不赴会齐信，而有急之时下愿厨，蒙恩不解，谓之逋。 虽奉道法，不遵科禁，淫犯杀生，信邪卜问，百行不良，凶逆无状，谓之违。 凡通违之民，天曹夺算削籍，三官遣考，召君史潜守门户，考逮人口，令招灾害。 罪重遭六害，轻罪被五灾。 故令死丧、疾病、官府、牢狱、水火、盗贼。 如此之徒，有急师道，道士皆当以科法折却考劾罪祟。 若能柔伏，反善吐罪，投誓三官，画一为信。 然后依科次第拯救。 而愚伪道士，既无科戒可据，无以辩劾虚实，唯有误败故章、谬脱之符，头尾不应，不可承奉，而率思臆裁，妄加改易，秽巾垢砚，辱纸污笔，草书乱画，荤以酒肉，顺口随意，所索浮辞假语，不依事实，违源背理，干触考官。 或滥收无罪之鬼，枉劾非祟之神； 或宜解而反结，或应伐乃更迁。 换倒互错，事无准的。 入靖启奏，不辩文句，是其所识，则洪声鼓响，闻於四邻。 其所不解，则咳咤吟呀，抹略而过。 如此之徒，吏兵不为使，道气所不降，考逮日更急，病者转就，增虚益重。 卒无效验。 客主共迷，不悟其非，乃生谤毁，怨道咎神，或致焚箓、毁靖、化庐。 凡事鬼种，祸贿殃咎，至於灭门。 如此之失，可不省哉。 陆先生道门科略竟",
      "translated_text": "The so-called disciples who have received the *Pínggài* and *Yùjú* talismans from the Celestial Master yet are appointed as *Yángpíng* or *Lùtáng* officials—these are the very ones who receive the *Bái Bǎn* and then impose it upon others.\n\nThose who have received the *Bái Bǎn* talisman, failing to present themselves to the Celestial Master for rectification, instead persist in passing it down to others for their entire lives. They act with reckless inversion, their misdeeds arising in chaotic confusion. With a body burdened by accumulated offenses, they wear hollow, false talismans. They have no household registration, yet maintain illicit correspondence. Some were once laypersons, burdened by ghostly sacrifices, who then entered Daoist practice without clearing their debts. From the moment they took up the path, their crimes and sins were rampant, yet they cling to their offenses, refusing repentance. They seek out deluded and false teachers, receiving untrue teachings.\n\nThey lack precepts and discipline, disregard instructions, violate prohibitions, and hold Dao and its laws in contempt. Those who receive the Dao must uphold precepts within and maintain proper decorum without, following prohibitions and adhering to instructions. Thus, the scriptures say: *\"If a Daoist does not receive the Old Lord’s one hundred and eighty precepts, they lack virtue and are not truly a Daoist. They may not receive the people’s worship, nor may they treat ghosts and spirits.\"* Since they are ignorant and unworthy, they do not understand the reverence of Daoist virtue. Their conduct is reckless and disrespectful toward sacred rites.\n\nThey indulge their greedy desires, drowning themselves in wine and gluttony. When practicing Daoist methods, they do not seek merit, and when treating others, they lack compassion. Their intentions are fixed on wealth and food, never instructing the people in prohibitions. They demand heavy tributes, inquire about fine foods, and consume the five pungent vegetables and the six kinds of meat—most taboo in Dao—violating prohibitions by slaughtering chickens, pigs, geese, and ducks. They drink to excess, then use this as an excuse to report their misconduct. Some even vomit beside the altar, and such individuals are not uncommon.\n\nThey abandon the pure and upright teachings of the *Alliance of威严* (威严盟), which states: *\"The teacher does not accept money, the spirits do not drink or eat\"*—this is called *Qīngyuē* (清约, purity and restraint). In treating illness, they do not use acupuncture, moxibustion, or herbal medicine, but only prescribe talismans and water. Their first offense is altering their conduct, submitting false reports instead. In matters of residence, tombs, relocation, or movement, they do not consult auspicious days or times, acting purely by whim, avoiding nothing. This is called *Yuē* (约, restraint). They neglect the myriad spirits and deities, yet claim to serve the Three Teachers of the Old Lord—this is called *Zhèngjiào* (正教, true teaching). Instead, they follow perverse and heretical methods:\n\n- Invoking ghosts and spirits for divination and fortune-telling is called *Xiān* (邪, heresy).\n- Speaking in the names of ghosts and spirits, predicting fortune and misfortune, is called *Xiān* (祆, Zoroastrian-like divination).\n- Creating taboos without proper Daoist authority is called *Wū* (巫, shamanistic).\n- Writing false charts for graves, residences, foundations, geomancy, or predicting calamities must be reported and expelled. Yet they still consult calendars, select days and times, and grow even more foolish. They refuse to follow the clear prohibitions, instead competing to use what the law forbids, turning from truth to falsehood—this is called *Dào* (倒, inversion).\n\nThey wield official seals and documents, wandering through villages. True Daoist practice is modest and unassuming, responding only when summoned, quietly refining their arts until seekers arrive. To parade through the streets is forbidden by law. When encountering those who violate prohibitions, they suffer misfortune. Though they claim to be Daoist followers, they have long abandoned their teachers, their talismans unregistered, their households without proper records. Some, though they have teachers, fail to attend the three auspicious assemblies on appointed days, yet when urgent matters arise, they hastily offer prayers and sacrifices, accepting favors without gratitude—this is called *Bū* (逋, delinquent). Though they profess Daoist practice, they disregard prohibitions, commit licentious acts, kill, believe in false divination, and engage in all manner of wickedness—this is called *Wéi* (违, transgression).\n\nAll who violate prohibitions will have their life-spans recorded in the Celestial Bureau erased, and the Three Officials will dispatch inspectors to guard their homes, interrogating their families and demanding they confess their misdeeds. Heavy crimes bring six calamities; lighter crimes bring five. These are: death, illness, legal troubles, imprisonment, fire, and theft. Such individuals, when facing urgent matters, should be Daoists who use scriptural prohibitions to avert punishment. If they repent sincerely, confess their sins, and swear to the Three Officials in writing, they may then be saved in accordance with the proper procedures.\n\nYet these deluded and false Daoists, lacking scriptural precepts to defend themselves, cannot distinguish truth from falsehood. They fabricate false reports, alter talismans at will—beginning and end mismatched, unworthy of reverence—yet presume to judge arbitrarily, defiling their cloths and inkstones, dishonoring paper and brushes. They scribble carelessly, staining their work with meat and alcohol, speaking whatever comes to mind, demanding false words without regard for truth. They reverse proper procedures, misjudging whether to absolve or bind, destroy or spare. Their actions are chaotic and unreliable. When submitting petitions, they do not examine the text carefully; what they understand, they proclaim loudly, heard by all neighbors. What they do not comprehend, they stammer and mumble, glossing over it carelessly. Such individuals are not fit to be messengers for officials or soldiers, and the Dao’s *qi* does not descend upon them. The more urgent the inspections become, the more desperate the sick grow, yet the results remain ineffective. Both patient and practitioner are misled, unaware of their errors, leading to slander of the Dao and blame upon the spirits. This may even result in the burning of talismans, destruction of altars, or abandonment of the practice. All such misdeeds invite retribution, bringing ruin to entire families.\n\nSuch failures must not go unexamined.\n\nThe *Lù Xiānshēng’s Daoist Precept Outline* is complete.",
      "overlap_context": "k virtue. On the day they receive their talismans, they instead **visit other officials**, neither returning to their **original teacher** nor ascending through proper ranks. They **recklessly accept appointments**, without discernment, and though many wear talismans and receive treatment, the treatment is **greatly flawed**. They compete to outdo one another in rank, advancing **unjustly**—so that one **personally receives the rank of lower treatment**, yet **appoints others to higher ranks**.」",
      "start_char": 2519,
      "end_char": 3698,
      "start_sentence": 110,
      "end_sentence": 155,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 16.790651082992554,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\陆先生道门科略.txt",
        "category": "正统道藏太平部"
      }
    }
  ]
}