{
  "source_id": "陶真人内丹赋",
  "source_file": "chunked_daozang\\陶真人内丹赋.json",
  "total_chunks": 7,
  "total_original_chars": 6104,
  "total_translated_chars": 33881,
  "total_translation_time": 104.0152690410614,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\方法类\\陶真人内丹赋.txt",
    "category": "方法类"
  },
  "full_translation": "**Ertao Ren’s Treatise on Inner Alchemy with Preface**\n\n**Title:** *Ertao Ren’s Treatise on Inner Alchemy* (*Jīngmíng: Ertao Ren’s Treatise on Inner Alchemy*).\n**Author:** Daoist Tao Zhí of the late Tang and Five Dynasties period.\n**Preface and Commentary:** Both written by the same hand.\n**Original Intent:** The work was composed on the Dao of refining external *Dān* (elixir), yet it mistakenly addresses internal alchemy, hence its proper name should have been *Jīndān Fù* (Treatise on Golden Elixir).\n**Volume:** One.\n**Source:** *Zhèngtǒng Dàozàng* (Orthodox Daoist Canon), *Dòngzhēn* (Cavern of the True) section, *Fāngfǎ* (Methods) category.\n\n**Ertao Ren’s Treatise on Inner Alchemy**\n\nMan is born of the *Wǔxíng* (Five Phases) *Qì* (Qi), and his form is nourished by the *Sìxiàng* (Four Symbols) *Jīng* (Essence). He draws from the exhaustion of rivers and seas to prolong his life, and from the waning of sun and moon to invigorate his spirit. Thus, the Sage harmonizes gold with jade, refines stone to mend the heavens, and cultivates the *Tǐyòng* (Body-Mind) in its primal radiance—seeking to emulate the grandeur of sun and moon.\n\nNow, the Great Elixir of the Dragon and Tiger (the union of *Yīnyáng* forces) is the position where the South and North converge, born of the primordial *Yuán* (Origin) *Èr Sān* (Two and Three). It bears the name of East and West’s mutual ingress, as the *Wǔxíng* (Five Phases) merge into singular unity. The hues of blue, red, white, and black each govern the four cardinal directions; above and below are in perfect accord, radiating to all eight directions. The Five Sovereigns (*Wǔdì*) are established, the Three Powers (*Sāncái*) manifest their symbols, and all things take form.\n\nThe sixty-four *guà* (hexagrams) and their *yáo* (lines) are applied, the twenty-eight *sù* (lunar lodges) align with their degrees, contained within the seventy-two *hòu* (phenomenal phases) and the three hundred and sixty *xún* (solar terms). It begins with *Yuánsāng* (Primordial Yang) and ends at *Huìlà* (the final lunar phase of the year).\nHence the *Sūtra* (Scripture) states: *\"By merging with the virtue of Heaven and Earth, and the luminosity of sun and moon.\"*\n\nIn spring and summer, growth and flourishing advance, all derived from the Four Seasons (*Sìshí*). In autumn and winter, retreat and dormancy prevail—how could this be separate from the cyclical *Yùn* (Movement)?\n*Qián* (Heaven) is long in *Gèn* (Mountain), *Sūn* (Wind), and its form, as rigidness transforms into softness. *Kūn* (Earth) is generated by *Zhèn* (Thunder) and *Duì* (Lake) in their shapes, as the feminine returns to the masculine position.\n\nYet, when the functions of *Yīnyáng* (Yin-Yang) first manifest, the sun and moon exchange their breaths in mutual sighs. Thus, the *Lǐ* (Ritual) *Nǚ* (Female) separates from the *Kǎn* (Abyss) *Nán* (Male), and the *Jīn* (Metal) *Fū* (Husband) from the *Mù* (Wood) *Fù* (Wife). Their *Jīngqì* (Essence-Qi) is refined, and their marrow and sinews are tempered—ten months of labor yield a complete transformation of the spirit.\n\nIts essence becomes a fluid, congealing like the pure frost of frozen ice, or like snow when carved. Now, the principles of *Qiān* (Lead) and *Gǒng* (Mercury) are distinguished, and the sources of water and fire are first verified. The quintessences of the two *Xiàng* (Symbols) are combined, and the vital substances of the Five Phases are extracted. Thus, the Sage delves into the characters of sun and moon, penetrating the obscure and fathoming the dark.\n\nHe exhausts the Five Phases of metal and water, transcending the mundane to attain the sacred.\nThe *Cān* (Commentary) states: *\"Sun and moon are the foundation of the *Yì* (Changes), embodying the balance of rigid and yielding.\"* This refers to the three substances of water, earth, and metal—does the resolute scholar not recognize his own nature?\n\nTo reach the ultimate truth, one must:\n- Clarify the hexagrams of the *Lǐ* (Ritual) *Guà* (Hexagram),\n- Deeply grasp the interplay of *Yīnyáng*,\n- Discern celestial phenomena,\n- Seek the essence of the *Yì* (Changes),\n- Adjust the fire’s intensity,\n- Balance life and death,\n- Ensure purity in the external forms,\n- Harmonize the inner and outer responses.\n\nThe *Sānyuán Zhōushén Lùn* (Discourse on the Three Cycles and Divine Manifestations) states: *\"To understand the medicine, first understand oneself.\"* Realizing this single phrase reveals the myriad transformations.\n\nIf Heaven and Earth undergo change, and the male and female forces contend in their courses—if similar yet divergent, or dark and light intermingle—it is like ascending the stars with a ladder, or attempting to fish a whale with a suspended needle. Fortune smiles upon those worthy scholars who scrutinize and elucidate these truths—I dare not err in the sacred Dao!\n\nThe Way is spontaneous and natural—this is the primal *qi*. The primal *qi* is the void and boundless *qi* of Heaven and Earth. The void and boundless *qi* of Heaven and Earth gives rise to all things, marking the origin of the Mysterious Unity. Those who study the Elixir refine this *qi*; obtaining the void and boundless *qi* is called the True-One’s natural Way, the source of all transformations.\n\nThe *Laozi* says: *\"The formless cannot be named or described, so it is forcibly called Dao.\"* The Way of holding to the One is the natural *qi*—this is the mercury. The worthy scholar need only follow the method to refine it: from nothingness to substance, shedding the mortal coil to reveal the True-One—this is the natural Way.\n\nThe art distinguishes true and false:\nThe true is lead, refined into mercury, which is called the True-One, also White Gold, belonging to the *xī* (west) direction of the *duì* (trigram). The vulgar do not grasp the True-One’s Way; they refine lead, seeking its truth, yet the substance is buried—how could the true emerge? Thus the Classic says: *\"Do not destroy my lead, lest my life be forfeit.\"*\n\nThe Way of seeking the true form:\nIt draws upon the Three Lights above and responds to the Three Talents below. When the Six Harmonics are complete, transformations are boundless—this is the True-One’s Way.\n\nThe false arises from those who pursue immortality without studying the Classics, without guidance from a master, fabricating methods on their own. They take ordinary mercury and, without proper method, arbitrarily apply yin and yang, attempting to make the supreme elixir—thus failing. Li Cheng says: *\"How could ordinary lead and mercury be mistaken for the supreme elixir?\"* Not conforming to Heaven and Earth, they misuse clarity, causing yin and yang to clash, disrupting cold and heat—how could they not use false methods and later lament?\n\nThus the Classic says: *\"The shallow and profound, the wise and foolish, the true and false—these have existed since antiquity.\"*\n\nThe method follows the Two Principles—Heaven and Earth.\nTaking symbols from the Eight Trigrams,\nThe Great Elixir transforms and revolves, its body and structure adhering to these symbols.\nThe circulation of metal and water aligns with the Twenty-Eight Lunar Mansions, harmonizing with the Eight Trigrams to form the Eight Trigrams.\nEvery forty-five days completes one phase—this is one trigram.\nA year has three hundred sixty days, with eight phases of forty-five days, hence the Eight Trigrams are taken as symbols.\nFrom the *Taiyi* to the manifest, the Eight Trigrams are also the symbols of the sun and moon.\n\nTo open and distinguish Heaven and Earth—\n*\"Open\"* means to establish.\nTo clarify Heaven and Earth’s distinctions—\nHeaven and Earth’s positions are the cauldron’s tripod.\nFirst discuss the tripod, then the elixir; once Heaven and Earth’s positions are set, the revolutions of the Celestial Cycle are defined.\n\nCold and heat are harnessed, yin and yang contend—\nTiming must not miss the seasons; this is taking symbols.\nTo blend the transformations of yin and yang—\nYin and yang are *qi*; just and yielding are forms.\nThus the worthy scholar follows this pattern, with water and fire as masters.\nTheir separation has its time; only then can one discern the transformations of yin and yang.\n\nThe *Tongxuan Lun* states: *\"This is the mother of Heaven and Earth—sand and mercury.\"*\n\nPointing to the trigram *Kàn* and weaving with the Classic,\n*Kàn* is metal, positioned in the west.\n*Kūn* is water, yet it is also metal.\nWater and fire, the two substances, circulate and return, entering and exiting, bending and extending—their forms.\nGuo Zhenren says: *\"The west is bound as the weft; the *jiǎ* position is the binding.\"*\n*Jiǎ* is the first of the Ten Heavenly Stems; *jiǎ* is the divine child, the first of the Twelve Divine Ones.\nPairing *jiǎ* with *zǐ* (child), hence it is called the weft.\nIt corresponds to the south and north, taking and discarding.\nThus the song says:\n*\"Pick the south, take the north,\nChild and Mother contend.\nTurn north to west,\nPairing husband and wife—\nThis is not empty.\"*\n\nThus the elixir stone, one substance, bears only yin—\nThis is called taking and discarding.\nThe *Shìfáng* constellation leaps upon the Azure Dragon—\n*Shìfáng* is the *jiǎ* mansion, so mercury resides in the *Fáng* star.\nThe *Fáng* star belongs to the *mǎo* (east), green in hue—\nWood is born of water, and water belongs to the north, black in hue.\nGreen and black are called Azure, hence the Azure Dragon.\nZhang spreads its wings like a White Horse’s belt—\n*Zhāng* is the fire mansion of the south, symbolizing cinnabar.\nThis is the ancient immortals’ method of shedding its red aura,\nRestoring its true nature—\nCalled \"cinnabar that has shed its body,\" also White Sand,\nOr White Horse Tooth.\nThus the black-and-yellow forms—\nHeaven and Earth—\nAs the substance of vessels, their sinews are mercury,\nTheir bones are silver.\nUnder the influence of fire-*qi*, gold and water naturally shed their lead,\nGradually purifying impurities.\nOn the vessel, they fly and circulate,\nDispelling stagnation and adding mist—light and unrestrained.\n\nThey dwell in rocky crevices, straddle mountains, overlook rivers.\nMercury in the cauldron, submerged by metal and water,\nUnder roasting and boiling, surges and bubbles, unable to settle,\nGradually forming flowers above,\nOr gathering into a mass—\nDwelling in rocky crevices, hidden in valleys.\nOr lying dormant in the pan, like the form of mountains.\nObserving the sun’s radiance and the moon’s hues,\nThis spans years and accumulates over time.\nThe sun’s radiance is mercury; the moon’s hues are gold.\nGold and mercury forming shape—\nNot until the sun is full and the moon complete will it be achieved.\n\nThus a year governs twelve months, with three hundred sixty days.\nTime accumulates into months, months into years,\nUntil one Celestial Cycle encompasses four thousand three hundred ten days,\nSymbolizing the four thousand three hundred years of cosmic circulation.\nHence it is said: *\"Spanning years and accumulating over time—*\nThe worthy scholar examines and verifies this,\nUsing the Great Elixir to pair yin and yang,\nCreating cold and heat,\nYin consuming yang, yang nourishing yin—\nThe Returned Elixir does not submit to the Four Seasons and Five Phases unless their symbols are taken.\n\nTo exhaust the workings of transformation,\nTo follow Heaven’s time and serve Heaven.\nTo exhaust the Way of yin and yang,\nTo know the source of transformation.\nThe Master says: *\"*\n\nKnow the source of transformation—then you know the **Divine** *(shén)*.\n\nThus the Eight Trigrams are performed:\nFather and son, lord and minister,\nHard and soft paired in harmony,\nRanked by their high and low,\nThe Six Pitches completed in cycle,\nUniting to form the Great Dao.\nThe Five Phases and Six Pitches are fixed,\nSeventy-two Constellations, forty-five nodes,\nThe Twenty-four Qi marked by water clocks,\nGreat and small determined—\nThen chanting the Three Powers *(Tiān-Dì-Rén)*,\nTaking symbols from Heaven and Earth.\n\nThe *Cān* *(参)* says: *\"Exhaust the Divine to know transformation.\"*\nThus the Sage follows *for* *(fǎ)* as the Way of Heaven—\nNo other meaning exists.\n\nAt first, male and female pair in union,\nAt last, soaring they ascend as Immortals.\n*Begin* means *initial*—\nThe *Cān* says: *\"When the beginning is upright, the end is clear;\nThe *Gān* *(干)* is not yet firm.\"*\n\nThis is the male mercury and female gold,\nThe precious pair configured as medicine,\nFit for internal ingestion.\n*Soaring* refers to the *Jūquè* *(朱雀)* mercury.\n\nObtained, it lingers in hesitation—\nInheriting qi, it gradually ascends as fire,\nNamed the *Zhèngyáng* *(正阳)* Elixir.\n\nThere are those beyond things,\nWhose nature inherits Heaven’s purity,\nEmbracing the harmonious *chōnghé* *(冲和)* essence,\nDisgusted by the world’s clamor and dust.\n\nMaster Wú Yún said:\n*\"The Immortal is what people admire.\nDeath is what people detest.\nThus, if the spirit is not pure and the bones not refined,\nIt is not because they lacked the yang spirit’s breath—\nNor did they lack the yearning for Immortality.\"*\n\nThose who yearn for Immortality,\nAt the moment of receiving breath,\nEncounter the *Chángshēng* *(长生)* constellation,\nAnd meet the *Yángwáng* *(阳王)* office—\nThus, human nature inherits Heaven’s purity,\nRising beyond things,\nSerene and pure, the body harmonious, the spirit clear,\nDisgusted by the world, abandoning the dust.\n\nTo seek the method of non-death,\nTo find the secret of prolonged life,\nTo grasp the essence of the Golden Elixir,\nTo penetrate the profound and mysterious truth—\n\nThe method of non-death originates from the Yellow Emperor and Laozi.\nLaozi’s *Danjīng* *(丹经)*,\nThe secret of prolonged life is the *Cāntóng Qì* *(参同契)* and *Jīnbì Jīng* *(金碧经)*.\n\nIf a worthy scholar obtains this text,\nFirst, they must report to the Three Officials *(Sān Guān)* above,\nAnd to the Land and Soil True Lords *(Tǔdì Zhēnjūn)* below.\nThen, they must bathe and purify their heart,\nBurn incense in a cold chamber,\nStudy and verify it—\nOnly then will their mind open, enlightened,\nAnd the True Essence *(Zhēnyuán)* be revealed.\n\nScholars of the Dao must seek teachers and friends widely,\nRequesting even the minutest clarifications—\nNever act recklessly.\n\nThus, *yǎoyǎo míngmíng* *(杳杳冥冥)*—\nWithin its depths lies the essence.\n*Yǎomíng* *(杳冥)* is the appearance of dark, mysterious black.\nWithin it lies the essence—*yín* *(银)*.\nThe essence is *gǒng* *(汞)*.\n\nThis is silver hidden in the Great Yin,\nOnly receiving the breath of the Great Yang,\nNourished by warmth over time,\nIts form concealed, lurking within the Great Yin.\nWhen its root sprouts and its vitality is complete,\nIt is called *Fùhuǒ Shuǐyín* *(伏火水银)*.\n\nAgain, *yǎomíng* is the appearance of the unrefined.\nIt is as if it is, yet not—\nNot seen, yet visible.\nThus the Classic says:\n*\"In mysterious darkness, the spirit condenses—\nLead does not reveal its crudeness,\nMercury does not show its form.\"*\n\nThe Returned-to-the-Yang Master says:\n*\"Lead receives the blind acid—\nThus, wrapped in coarse cloth, it holds jade.\nGold inherits the mercury’s armor,\nIts embryo enters the water through hesitation.\"*\n\nInfusing the *Jīnhuā* *(金花)* with its breath,\nExamining the two names of water and fire.\n\nMaster Guó *(郭真人)* says:\n*\"First, melt the *Jīnhuā* into water,\nUse another vessel to warm the mercury and pour it into the pool.\nIts color congeals white,\nIts form resembles lead’s *sū* *(苏)*—\nThis is also called *sìfǒu* *(伺否).\"*\n\nThe *Yīqì* *(一气)* is the True One—\nOne transformation receives the talisman,\nThe position of the Green Dragon,\nBound by the *Shuāngfāng* *(束方)* and *Zhèn* *(震)*.\n\n*Zhèn* belongs to Wood,\nWood generates Fire—this is mercury.\nEarth can generate Metal—this is Yin silver.\n\nThus it is said: *\"Examine the two names of water and fire.\"*\n\nDistribute the Four Symbols,\nRefine the Five Phases,\nSummon the sun’s soul and call the moon’s shadow,\nFollow the tiger’s nature and harmonize with the dragon’s emotions.\n\nMaster Lǐ Chéng *(李澄)* said:\n*\"The characters *jīn* *(金)* and *mù* *(木)*,\nThe four symbols of *Kǎn* *(坎)* and *Lí* *(离)*,\nAre the body of the urgent medicine.\nLead and mercury are the gate of profound mystery,\nThe root of the Returned Elixir.\"*\n\nThis refers to the Green Dragon, White Tiger,\nVermilion Bird, and Dark Tortoise—\nThe Four Symbols.\nWhen the Four Symbols are complete, the Five Phases are fulfilled.\n\nThe Twenty-eight Constellations circle Heaven,\nThe sun and moon align in measure—\nThe dragon breathes to the tiger,\nThe tiger inhales the dragon’s breath—\nTheir natures and emotions harmonize,\nThe sun and moon complete their cycles—\nIs this not the Four Symbols and Five Phases refined?\n\nFrom this, the *Yì* *(易)* demonstrates its mechanism,\nThe *Sháo* *(杓)* star sets its position,\nFollowing the *Jī-Dǒu* *(箕斗)* to disperse its hues.\n\nMaster Lǐ Chúnfēng *(李淳风)* said:\n*\"The Northern Dipper’s seven stars,\nNear the *Zǐwēi* *(紫微)* office,\nLocated north of *Tàiwéi* *(太微)*,\nCalled the Imperial Chariot—\nIt issues commands,\nIts movement governs the center,\nOverseeing the four directions.\nIt establishes the Four Seasons,\nBalances the Five Phases,\nAdjusts the nodes,\nFixes all divisions—\nAll tied to the Dipper.\nIts *kuí* *(魁)* is the *Xuánjué* *(璇玑)*,\nIts handle has three—\nThe *Yùhéng* *(玉衡)*.\nThe text says:\n*'Xuánjué and Yùhéng,\nTo harmonize the Seven Governors.'*\n\n*Jī-Dǒu* are the positions of *yín-wèi* *(寅巳)*,\nFire arises here—\nThe *Jiǎ* *(甲)* disperses its hues.\n\nConnecting *Mián* *(绵)* and *Gèn* *(艮)* to *Duì* *(兑)*,\n*Gèn* is Mountain, *Duì* is Marsh.\nThe *Yì* says:\n*'In Heaven, it forms symbols;\nOn Earth, it forms shapes—\nTransformation is revealed.'*\n\nMaster Hàn Kāngbó *(韩康伯)* said:\n*'Symbols refer to the sun, moon, and stars;\nShapes refer to mountains, rivers, grasses, and trees.\nSuspended symbols revolve,\nCreating darkness and light.\nMountains and marshes communicate qi—\nThus clouds and rain descend,\nFlowing in endless cycles,\nQi circulates above and below—\nThis meaning is profound.\"*\n\nApply *xíng* *(刑)* and *dé* *(德)* together,\nHard and soft unite,\nEntering the Central Palace,\nReturning to *Wù-Jǐ* *(戊己)*.\n\n*Bò* *(播)* means *to apply*.\n*Xíng* governs yin destruction,\n*Dé* governs yang mercury—\nThus hard and soft naturally unite,\nEntering the Central Palace,\nReturning to *Wù-Jǐ*—\nThe Earth position,\nNamed *Huángdì Shēngchù Xuánlì* *(黄帝生处玄立)*.\n\nIt can also subdue water and silver,\nThus the Dark is concealed.\n\nThe *Jīnbì Jīng* says:\n*\"To govern the Great Peace,\nTogether with the Central Palace Earth.\"*\n\nThe *Cān* says:\n*\"The three substances belong to one family,\nAll returning to *Wù-Jǐ*.\"*\n\nThe three substances are water, fire, and metal.\nThen, through nine returns, its forms transform,\nSeven refineries reveal its beauty.\n\nNine corresponds to the *Qián* (乾) hexagram—\nThe *Wǔ-Jǐ* (么几) Dragon takes its station.\n\nSeven corresponds to the *Kūn* (坤) hexagram—\nThe Flying Dragon ascends to Heaven.\n\nThe Sage’s transformation:\nThe *Wǔ-Jǐ* Dragon meets regret—\nA calamity of exhaustion.\nThus, one returns from the Nine to the Seven.\n\nThe adept of cultivation must grasp the hexagrams,\nBending and stretching, motion and stillness,\nEmergence and retreat, unfolding and coiling,\nAscension and descent, advance and withdrawal—\nEach has its paired correspondence.\nOnly then, by holding to the One and refining the True,\nDoes the principle of *Jiāo-Tài* (交泰) reveal its splendor—\nThe timely pairing of male and female.\n\nCirculating water and fire to nourish each other,\nThe *Cān* says:\n*\"Its origin lies in copulation,\nFixed to bring forth life.\"*\n\nWith *Kǎn* (坎) as male and *Lí* (离) as female paired,\nThe Sun resides in the Moon’s abode,\nTheir essence subtly mingling.\nExhausting the *qi* yields the *yá* (牙) and *niè* (蘗).\n\nThe *Yì* says:\n*\"The Sun and Moon revolve—\nOne cold, one warm.\nThe Dao of *Qián* forms the male,\nThe Dao of *Kūn* forms the female.\n*Qián* knows the Great Beginning,\n*Kūn* completes the things.\"*\n\nThus, the Sun and Moon employ the functions of Heaven and Earth,\nGold and water merge their essences,\nWater and fire circulate and transform,\nReturning to exhaust the *yīyuán* (一元) *qi*.\nThe *yīyuán*—sixty days—\nFour *xī* (熙) complete.\n\nThe *Qì* says:\n*\"The first year is the hidden *yá*.\"*\n\nFrom inner sincerity to outer harmony—\nInner is metal, outer is water.\n\nMetal and water seek to act,\nFollowing the laws of yin and yang,\nUsing the *guà* (卦) and *yáo* (爻) for timing.\nInner is three yang lines,\nOuter is three yin lines.\nWhen in yang times, seek the outer from within.\nWhen in yin times, seek the inner from without.\nMetal within is the direct symbol of spring and summer,\nWater without is the direct symbol of autumn and winter.\nThe interplay of inner and outer\nDraws its analogy from the *guà*.\nThen it is made profound—\nAnd again profound.\nThe profound is the *Xuányuán* (玄元).\nAs the *Tàishàng* divides one *qi* into two meanings,\nThe two meanings are Heaven and Earth.\nEarth, cleaving one *qi* into true essence,\nIs called *Zhēnyī* (真一), thus it is the true profound.\nAgain, the profound—\nThis is transforming white into gold,\nGold being the supreme treasure,\nHence, \"profound again profound.\"\n\nThe *Jīng* says:\n*\"Those who practice *yǎnshì* (衍士) and alchemical nourishment\nShall attain longevity.*\nMetal’s nature does not decay,\nThus it is the treasure of all things.\nNot common metal—\nMetal, when transformed,\nBecomes the dragon spiraling east by fire,\nThe tiger turning west by water.\nThe tiger sheds its shell and discards its offspring,\nThe dragon departs from *bǐng* (丙) to summon rain.\n\nMount *Cuīmò* (崔昤) says:\nIts spirit transforms into liquid,\nCongealed, it becomes mercury—\nLike frost shimmering, resembling jade railings.\nThe pure essence flows crystalline,\nIts light and shadow like stars and drills.\nRefined ten thousand times, its form remains constant—\nFrom non-being to being, destroyed yet reborn,\nFrom being to non-being, extinguished yet revived.\nYin and yang unite,\nYin and yang merge,\nEndlessly transforming, becoming the essence of things.\nThe sage refines it a hundred times to attain *tōnglíng* (通灵).\nEndless return—this is called *huándān* (还丹).\n\nAnother song says:\n*The Five Phases invert and spread,\nThe dragon emerges from fire’s embrace.*\n*The Five Phases act disorderly,\nThe tiger is born from water.*\nThis reveals the method of the supreme elixir,\nWhere yin and yang contend,\nThe Five Phases clash and reign in turn.\n*Qi* first appears white and black, then yellow,\nBeginning with water and fire, ending with earth.\nThis is the form of metal and water,\nActing from *Fù* (复), until the tenth month completes *Kūn* (坤),\nTransforming its segments—\nFirst white, then yellow,\nRed and black intertwined,\nEach returning to its root—\nIts essence is the Great *Huándān*.\n\nFire first—\nFire’s count is two, water’s count is one.\nFire extinguished,\nThe four seasons converge into one *qi*,\nFifteen days, twenty-four *qì* (气),\nGiving birth to all things.\n*Huándān* mirrors water and fire creating all things,\nDrawing upon Heaven and Earth’s yin and yang *qi*,\n*Qi* balanced in hardness and softness,\nHarmonized with the four seasons,\nUnable to forge—\nThen the Dao of *Zhēnyī* is complete.\n\nAbandon the south, take the north,\n*Jiǎyǐ* (甲乙) as ancestral roots.\nThe *Jīng* says:\n*\"Within yang is yin, within yin is yang.*\nYin within yang—\nSand produces mercury.\nMercury departs from yang,\nThus returning to the natural water of the north.\nWater nourishes wood,\nWood resides in *jiǎyǐ*,\nWith fire as ancestral roots.\nAs it says: *Fire spiraling east becomes the dragon.*\n\nDivine water, sacred stone,\nThe imperial male and female—metal and mercury.\nDivine water is not the fermented brew of alcohol and vinegar,\nStone cannot be used.\nThis is yin-one controlling yang-one,\nThe meaning of *Huápó* (华池).\nHence, the imperial male and female—\nThe essence of the Three-One.\n\nThe Dao does not depart from *Xuányellow* (玄黄),\nGuarding One while preserving the Three and Five.\nThe original Dao—mercury.\nHeaven and Earth’s Three and Five *qi*.\nGuarding One while preserving—\nNot departing from mercury, already gold.\nThe determined scholar examines it meticulously,\nSpeaking of true principles.\n\nFrom *qīngyāo* (青腰) to distant attainment,\n*Xuánsù* (玄素) hooks the deep.\n*Qīngyāo*—verdigris,\n*Xuánsù*—gold,\nThe Green Dragon and White Tiger.\nHooking the deep—\nThe meaning of distant attainment.\n\nWind refers to the water of seven and eight,\nWater generates the gold of nine and six.\nWind is yang *qi*.\nFrom the fifteenth day onward, *Zhèn* (震) is active,\nMercury obtains metal *qi* and is drawn in,\nNaturally harmonized.\nWater generated—yin *qi*.\nFrom the sixteenth day onward, it turns to *Xùn* (巽),\nSoftening hardness,\nThus metal dissipates,\nEntering mercury and returning to the *Kūn* *guà*.\n\nThe *Cān* (参) says:\n*\"Seven and eight, fifteen days,\nSix and nine correspond as well.*\nThis is the sixty-four *guà* of one month’s cycle.\nHardness without, softness within—\nInner yang, outer yin.\nHardness without—metal.\nSoftness within—mercury.\nThe *Jīng* says:\n*'Yin is silver, yang is mercury.'*\nThus, inner yang and outer yin.\n\nAnother note says:\n*'Hardness is *Qián* (乾), softness is *Kūn* (坤).'*\nYin and yang unite in virtue,\nHardness and softness have form.\nYin and yang are *qi*,\nHardness and softness are substance.\nDrawing upon yin and yang to form metal and water,\nMetal and water’s forms established,\nTheir substances merge and congeal into solidity—\nThis is transformation.\nThe Green Dragon leaps while the White Tiger lies low,\nThe Vermilion Bird flies while the Black Tortoise sinks.\nThe Green Dragon is the wood spirit,\nThe White Tiger is the metal spirit.\nThe *Jīng* says:\n*'Cinnabar is wood essence,\nObtaining metal, they merge.*\nTaking Heaven’s mercury,\nCombining with Earth’s silver,\nGathering soul and spirit to form *huándān*.\nHeaven’s *Xuán*, Earth’s *Huáng*,\nHarmonizing cinnabar and mercury—\nAt the proper moment, both enter the divine chamber,\nRefining this spirit essence,\nFire, earth, and metal circulating,\nBalancing *Wén* (文) and *Wǔ* (武), swift and slow,\nResponding to the *zhōnglǜ* (钟律).\nThe Vermilion Bird is fire, the south’s position.\nThe Black Tortoise is water, the north’s position.\nSpeaking of mercury—\nSometimes it flees, sometimes it flies,\nFrom the south’s Vermilion Bird,\nThrough north’s water and fire.\nTwo waters merge, three times—east,\nGreen Dragon lead-water,\nThus it first leaps and subjugates the White Tiger.\nThe *Jīng* says:\n*'Dragon-yang, odd numbers to the left,\nTiger-yin, even numbers to the right.'*\nThus, the sun scatters the central male,\nThe moon bewilders the maiden.\nThe sun—fire.\nThe central male—metal essence as moon,\nObtaining fire *qi* and self-dissipating,\nMerging with mercury as one body,\nMercury transmitting metal *qi* and becoming confused,\nNeither fleeing nor flying—\nCalled the moon bewildering the maiden.\n\nThe astonished maiden—mercury.\nThe central male—gold.\n\nWei Jun said:\nFire consumes gold, gold strikes wood to flourish—\nThree and five unite with one,\nThe most refined essence of Heaven and Earth.\n\nEarth is strong, metal is fierce—\nCold and heat alternate.\nEarth is realgar, obtaining its position in the central official,\nA general’s name.\nIt can lie prone in water,\nYet also generate gold.\n\nCold and heat alternate—\nIgniting the martial and civil fires in due time.\n\nThe Dragon exhales, the Tiger inhales,\nThe Black Tortoise and Toad swallow and emit.\nThe Dragon is mercury,\nThe Tiger is gold,\nThe Black Tortoise and Toad are the essence of sun and moon.\n\nWhen gold and mercury obtain the *qi* of fire and water,\nWithin the crucible they transform—\nHigh and low in form,\nOperating the civil and martial fires in play—\nOne ascends, one descends,\nOne bows, one rears.\nOnce the phases of emergence and concealment are fixed,\nSwallowing and emitting follow their time—\nYellow and white are achieved,\nCalled *Jīnxīng* (金星, Golden Star) beautiful sand,\nOr *Jùshèng* (巨胜, Great Victory) purple covering powder.\n\nIf not fully transformed,\nThat which lies concealed within gold is called *Jīnlóng Dān* (金龙丹, Gold Dragon Elixir),\nAlso named *Fúhuǒ Zǐfěn* (伏火紫粉, Concealed-Fire Purple Powder)—\nBoth are Great Return Elixirs.\n\nSouth and North copulate in water and fire,\nThe Hare and Rooster revolve between the Child and Horse.\nMercury is the north’s position.\nFire is cinnabar, the south’s position.\nThe two directions come and go,\nEach guarding its fixed nature.\n\nCold comes from the north,\nHeat from the south—\nBoth act in their own time,\nReturning to their original posts.\n\nThe Hare is eastern mercury,\nThe Rooster is gold-mercury,\nCombining water and fire to return to the Child and Horse.\n\nThe *Zǐhéchē* (紫河车) Secret says:\nTwelve months give birth to a child—\nThe Child and Horse are they.\n\nSummarizing the strategies of Heaven and Earth,\nThe sovereign of effortless transformation.\nOperating the *Qián* and *Kūn* hexagrams,\nEach has its own strategy and numbers.\nThe *Qián* strategy’s yang lines—\nHalf a *zhǐ* yields six thousand nine hundred twelve.\nThe *Kūn* strategy’s yin lines—\nHalf yields four thousand six hundred eighty.\nTogether, they total eleven thousand five hundred twenty.\n\nThe sovereign is gold.\nGold as ruler, symbolizing the North Star.\nWhen *Qián* and *Kūn* interact,\nTheir motion never ceases,\nYet at the poles, they do not shift.\n\nGold and water within the vessel,\nAllowing water and fire to permeate naturally,\nThey spontaneously form the true body,\nEffortlessly transforming in accordance with the nodes.\n\nMother and child are enclosed within the square and circle,\nNurtured and refined within the crucible and cauldron.\nThis is the gold method—\nThe world’s hasty folk cannot know it.\n\nMother and child are gold and mercury.\nGold and mercury are the internal and external symbols of *Kǎn* and *Lí*,\nThe method of the two *qi* interlocking,\nTheir union within the crucible.\n\nWithin the crucible, light expands and radiates,\nLike the sun and moon in linked rings,\nWithin the six directions.\nWater and fire are the medicines,\nHeaven and Earth are the crucible,\nCapable of regulating the square and circle—\nThe principle of the golden crucible.\n\nThe *Cān* (参) says:\n*Kǎn* and *Lí*’s square and circle are the city walls.\nThe *Wǔxiàng Lèi* (五相类) says:\nWhen the city walls are complete, figures thrive.\nIndeed.\n\nThe world does not understand the golden crucible,\nOften using gold, silver, lead, and flowers—\nThis is a great regret.\n\nMeasure the *zhūliǎng* (铢两) to determine the cycle,\nObserve the *yáo* symbols to calculate the fire numbers.\nMeasuring *zhūliǎng*—\nSix *zhū* make one *fēn*,\nFour *fēn* make one *liǎng*,\nOne *liǎng* is twenty-four *zhū*,\nOne *jīn* totals three hundred eighty-four *zhū*—\nSymbolizing the sixty-four hexagrams with three hundred eighty-four lines.\n\nThe cycle returns and amplifies,\nObserving movement to determine the fire numbers.\nThe *Jīng* says:\nFire records are not false—\nPerforming the *Yì* to clarify it.\n\nAs for the two solstices opening and closing—\nWinter solstice, summer solstice.\nYin and yang succeed each other,\nFrom the Child to the Perch, yang is born,\nFrom the Horse to the Rooster, yin is born.\nTerminating at *Kūn*’s union and beginning at *Guàn*,\nRising at *Fù* and ending at *Lín*—\nPure *Qián* concludes,\nThen from the initial nine, one variation begins.\n\nNine-two becomes three—\nThree is *Pǐ* (否),\nNine-four is *Guān* (观),\nNine-five is *Bō* (剥),\nUpper nine is *Kūn* (坤),\nNine returns to seven—\nFire-Heaven, Great Possession.\n\nThis is the completion of *Qián* and the beginning of retreat.\n\nAgain, placing the pure *Kūn* hexagram,\nFollowing the previous from the lower position—\nInitial six varies as *Fù* (复),\nTwo as *Lín* (临),\nSix-three as *Tài* (泰),\nSix-four as *Dàzhuàng* (大壮),\nSix-five as *Yǒng* (央),\nUpper six as *Xū* (需).\nEight returns to six, residing in the water-earth *Bǐ* (比).\n\nThus the *Jīng* says:\nRising at *Lín* and ending at *Qián*.\n\nThe flying dragon, the reclining moon—\nThe flying dragon is mercury,\nThe reclining moon is the vessel.\nUpper and lower strings.\n\nLi Cheng said:\nWithin the Green Dragon’s second eight and White Tiger’s center—\nThe eighth and twenty-third days,\nGold and water, half a *jīn* each.\n\nYellow gold, white snow—\nDivine transformation naturally.\nYellow gold is the returned lead essence,\nCongealing into purple powder,\nBrilliant red—\nThus called yellow gold.\nWhite snow is the flying and concealed mercury,\nIts color like snow—\nThus called white snow.\nThis is the way of divine, natural transformation—\nTaking it brings feathered ascension.\n\nFusing *Kūn* and *Gèn* to form earth,\n*Kūn* is yin, *Gèn* is silver.\nThe *Sānpiān* says:\nGathering yin forms earth—indeed.\n\nGazing upward at *Qián* and *Duì* to form heaven.\n*Qián* is yang, *Duì* is gold.\nTao Jun said:\nAccumulating yang forms heaven—indeed.\n\nThe *Yì* says:\nMountain and marsh exchange *qi*.\nAgain it says:\nWhat is the *qi* of Heaven and Earth not exchanging?\nIt is the form and substance each transforming.\n\nMother and child’s affection and sorrow,\nMutually governing their connection.\nMother and child’s affection and sorrow—\nLead is refined by mercury,\nMercury can conceal lead,\nLead and mercury unite—\nThe way of yellow and white is complete.\n\nSilver originally comes from lead,\nFor lead embraces the child.\nConcealing lead within silver,\nSilver hidden within lead—\nThus they mutually govern their profound connection.\n\nIt is like a person in the Dao—\nThe Dao does not depart from the person.\nFish in water—\nWater departs from the fish.\nFish without water die,\nPeople without the Dao perish—\nThis is the profound principle of mutual governance.\n\nOne color, three and five—\nWater stirs mist and cloud.\nOne is the True One.\nThree is mercury.\nFive is realgar, the earth.\nThe True One and earth are heavy yin substances—\nThus they do not receive flight.\n\nObtaining harmony with mercury,\nIt ascends—**flight** is achieved.\nThe **flight** manifests as frost powder,\nCalled *\"water-stirred mist and cloud\"*,\nAlso arising from the vessel.\n\nThe *Daoist* **True Person**’s *inner alchemy* **Preface** is complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "陶真人内丹赋并序 经名：陶真人内丹赋。 唐末五代道士陶植撰。 序文及赋注皆出一人。 书修炼外丹之街，而非内丹，故书名原当作《金丹赋》。 一卷。 底本出处：《正统道藏》洞真部方法类。 陶真人内丹赋 夫人本以五行气而成体，乃以四象精而灌身，得江海竭而命更延，日月亏而神转壮。 故圣人理金镇玉，炼石补天，体用玄黄，要崇日月。 伏以龙虎大丹者，南北往来之位，本元二三，东西出入之名，运合归一。 青赤白黑，各定四维，上下俱通，辐赓八方，位成五帝，三才立象，万物有形。 六十四卦爻用，二十八宿合度，在七十二候之内，处三百六旬之中。 始自元阳，终於晦腊。 故经云：以天地合其德，日月合其明也。 春夏进长滋隆，皆禀於四时。 秋冬退伏垫藏，岂离於一运。 乾长於艮、巽之体，刚变为柔。 坤生於震、兑之形，阴归阳位。 然始阴阳之用，日月交叹，是以离女坎男，金夫木妇，妮其精气，陶炼髓筋，十月功成，一用方备其神也。 化之为液镕凝质，若坚冰变之玄霜，烹剖形如素雪。 方辨铅汞之理，始验水火之源。 合两象之精华，抽五行之血肉。 故圣人研日月二字，通幽洞冥。 穷金水五行，出凡入圣。 《参》云：日月为易，刚柔相当。 此名水土金之三物，志士岂不省己者哉。 欲达至真者，明闲卦象，痛会阴阳，晓察天文，精求易义，火候进退，生杀合宜，表裹清通，内外相应。 《三元周神论》云：欲明其药，先明自身。 悟此一言，而知万化矣。 若天地变易，雌雄抗行，相类不同，黑元交错者，如持梯而望升星汉，悬钩针而拟钓鲸说。 幸请贤者，细而详之，岂敢谬於神道耳。 又绿赋内沉论秘义，潜匿幽词，注解玄言，附成其旨。 赋曰 道法自然，",
      "translated_text": "**Ertao Ren’s Treatise on Inner Alchemy with Preface**\n\n**Title:** *Ertao Ren’s Treatise on Inner Alchemy* (*Jīngmíng: Ertao Ren’s Treatise on Inner Alchemy*).\n**Author:** Daoist Tao Zhí of the late Tang and Five Dynasties period.\n**Preface and Commentary:** Both written by the same hand.\n**Original Intent:** The work was composed on the Dao of refining external *Dān* (elixir), yet it mistakenly addresses internal alchemy, hence its proper name should have been *Jīndān Fù* (Treatise on Golden Elixir).\n**Volume:** One.\n**Source:** *Zhèngtǒng Dàozàng* (Orthodox Daoist Canon), *Dòngzhēn* (Cavern of the True) section, *Fāngfǎ* (Methods) category.\n\n**Ertao Ren’s Treatise on Inner Alchemy**\n\nMan is born of the *Wǔxíng* (Five Phases) *Qì* (Qi), and his form is nourished by the *Sìxiàng* (Four Symbols) *Jīng* (Essence). He draws from the exhaustion of rivers and seas to prolong his life, and from the waning of sun and moon to invigorate his spirit. Thus, the Sage harmonizes gold with jade, refines stone to mend the heavens, and cultivates the *Tǐyòng* (Body-Mind) in its primal radiance—seeking to emulate the grandeur of sun and moon.\n\nNow, the Great Elixir of the Dragon and Tiger (the union of *Yīnyáng* forces) is the position where the South and North converge, born of the primordial *Yuán* (Origin) *Èr Sān* (Two and Three). It bears the name of East and West’s mutual ingress, as the *Wǔxíng* (Five Phases) merge into singular unity. The hues of blue, red, white, and black each govern the four cardinal directions; above and below are in perfect accord, radiating to all eight directions. The Five Sovereigns (*Wǔdì*) are established, the Three Powers (*Sāncái*) manifest their symbols, and all things take form.\n\nThe sixty-four *guà* (hexagrams) and their *yáo* (lines) are applied, the twenty-eight *sù* (lunar lodges) align with their degrees, contained within the seventy-two *hòu* (phenomenal phases) and the three hundred and sixty *xún* (solar terms). It begins with *Yuánsāng* (Primordial Yang) and ends at *Huìlà* (the final lunar phase of the year).\nHence the *Sūtra* (Scripture) states: *\"By merging with the virtue of Heaven and Earth, and the luminosity of sun and moon.\"*\n\nIn spring and summer, growth and flourishing advance, all derived from the Four Seasons (*Sìshí*). In autumn and winter, retreat and dormancy prevail—how could this be separate from the cyclical *Yùn* (Movement)?\n*Qián* (Heaven) is long in *Gèn* (Mountain), *Sūn* (Wind), and its form, as rigidness transforms into softness. *Kūn* (Earth) is generated by *Zhèn* (Thunder) and *Duì* (Lake) in their shapes, as the feminine returns to the masculine position.\n\nYet, when the functions of *Yīnyáng* (Yin-Yang) first manifest, the sun and moon exchange their breaths in mutual sighs. Thus, the *Lǐ* (Ritual) *Nǚ* (Female) separates from the *Kǎn* (Abyss) *Nán* (Male), and the *Jīn* (Metal) *Fū* (Husband) from the *Mù* (Wood) *Fù* (Wife). Their *Jīngqì* (Essence-Qi) is refined, and their marrow and sinews are tempered—ten months of labor yield a complete transformation of the spirit.\n\nIts essence becomes a fluid, congealing like the pure frost of frozen ice, or like snow when carved. Now, the principles of *Qiān* (Lead) and *Gǒng* (Mercury) are distinguished, and the sources of water and fire are first verified. The quintessences of the two *Xiàng* (Symbols) are combined, and the vital substances of the Five Phases are extracted. Thus, the Sage delves into the characters of sun and moon, penetrating the obscure and fathoming the dark.\n\nHe exhausts the Five Phases of metal and water, transcending the mundane to attain the sacred.\nThe *Cān* (Commentary) states: *\"Sun and moon are the foundation of the *Yì* (Changes), embodying the balance of rigid and yielding.\"* This refers to the three substances of water, earth, and metal—does the resolute scholar not recognize his own nature?\n\nTo reach the ultimate truth, one must:\n- Clarify the hexagrams of the *Lǐ* (Ritual) *Guà* (Hexagram),\n- Deeply grasp the interplay of *Yīnyáng*,\n- Discern celestial phenomena,\n- Seek the essence of the *Yì* (Changes),\n- Adjust the fire’s intensity,\n- Balance life and death,\n- Ensure purity in the external forms,\n- Harmonize the inner and outer responses.\n\nThe *Sānyuán Zhōushén Lùn* (Discourse on the Three Cycles and Divine Manifestations) states: *\"To understand the medicine, first understand oneself.\"* Realizing this single phrase reveals the myriad transformations.\n\nIf Heaven and Earth undergo change, and the male and female forces contend in their courses—if similar yet divergent, or dark and light intermingle—it is like ascending the stars with a ladder, or attempting to fish a whale with a suspended needle. Fortune smiles upon those worthy scholars who scrutinize and elucidate these truths—I dare not err in the sacred Dao!",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 666,
      "start_sentence": 0,
      "end_sentence": 34,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 15.655065298080444,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\陶真人内丹赋.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "自然者，元气也。 元气者，是天地虚元之气。 天地虚无之气，即化生万物，玄元之始也。 学丹之流炼此，得虚无之气，名真一自然之道，为万物化元也。 《老子》日：无形不可名状，故强名曰道。 守一之道，日道者是自然之气，即是水银。 志士但依法炼之，出无入有，脱胎见真一，自然之道也。 术明真假， 真名铅也，炼得银，银号日真一，亦日白金，位属兑官西方。 俗士不晓真一之道，炼铅拟求其真，物被埋了岂有真。 故经云：莫坏我铅，令我命全。 求真象之道，上禀三光，下应三才，六律既备，变化无穷，即真一之道也。 假者，是学仙之流，不考经典，不从师授，托意自造，遂将几常水银，不依法则妄施阴阳，拟为至药，故不成也。 李澄云：岂将几铅常汞，便喻至药。 所以不法天地，谬用亏明，致阴阳结互，寒暑不时，岂不用假而自恨。 故经云：几圣浅深，愚智真假，自古有之。 法效两仪， 两仪天地。 取象八卦。 大药变转，体骨皆依法象。 金水运气，周功二十八宿，合度八卦，成八卦者。 每四十五日一节成，是一卦也。 一年三百六十日，有八个四十五日，故取象八卦。 太易至有八卦，日月有八卦是也。 辟天地以区分， 辟者，开也。 明天地以区分。 天地位者，乾坤鼎器也。 言先论鼎器，后言其药，天地位定，然后区分周天之义也。 寒暑驾驭，阴阳胜负，取时勿失节候，是取象。 混阴阳之变化。 混阴阳者，水火为药也。 是水银混沌，清浊未分，故号太易者，是阴阳之象，倾一处之义也。 然后阴阳合德，而刚柔有体。 阴阳者气也，刚柔者形也。 故志士则而行之，侯水火主也。 分判有时，方辩阴阳之变化。 《通玄论》云：此天地之母，砂汞也。 指乾坤而以经以纬， 乾为金，西为位。 坤为水，是金。 水火二物，交转往来，出入屈伸，体段也。 郭真人日：束西为纬，甲处为束。 甲为十干首，甲者神子，为十二神之先。 将甲配子，故云以纬也。 类南北而有取有舍。 故歌云：拾南取北，子母相克。 转北成西，配合夫妻。 此不虚也。 故丹石一药独负阴，谓之有取有拾。 氏房腾跃於苍龙， 氏房，是束方宿，故汞寄处於房星。 房星属卯为青，又木生於水，水属北方为黑。 青与黑谓之苍，号日苍龙者也。 张翼襟带於白马。 张翼，是南方火宿，象丹砂也。 是古仙以法脱其赤晕，还其真性之功，号日脱体丹砂，一名白砂，亦名白马牙是也。 故玄黄之形质，脱筋骨而潇洒。 玄黄者，天地也。 为器物之形质，筋是汞，骨是银，得火气熏蒸，金水等自脱其铅，渐除滓秽，於器上飞传往来，拂郁加雾而潇洒也。 栖岩隐壑，跨岳临川。 汞在鼎内，得金水伏，被煎灼涌沸不得停，渐结吐花於上，或成其熙，栖岩隐壑。 或伏盘不起，如山岳之形状也。 候日华之月彩，亦弥岁而历年。 日华是汞，月彩是金。 金汞成形，非日盈月满而不就也。 故一年主十二月，有三百六十日，时积日为月，积月为年，至一周天有四千三百丰十时，象四千三百年运气。 故云：弥岁之历年，志士审而察之，以大药阴阳相配，而成寒暑，阴煞阳养，还丹非四时五行而不伏，皆取其象。 穷造化而变化，顺天时而奉天。 穷阴阳之道，知变化之源。 夫子日；",
      "translated_text": "The Way is spontaneous and natural—this is the primal *qi*. The primal *qi* is the void and boundless *qi* of Heaven and Earth. The void and boundless *qi* of Heaven and Earth gives rise to all things, marking the origin of the Mysterious Unity. Those who study the Elixir refine this *qi*; obtaining the void and boundless *qi* is called the True-One’s natural Way, the source of all transformations.\n\nThe *Laozi* says: *\"The formless cannot be named or described, so it is forcibly called Dao.\"* The Way of holding to the One is the natural *qi*—this is the mercury. The worthy scholar need only follow the method to refine it: from nothingness to substance, shedding the mortal coil to reveal the True-One—this is the natural Way.\n\nThe art distinguishes true and false:\nThe true is lead, refined into mercury, which is called the True-One, also White Gold, belonging to the *xī* (west) direction of the *duì* (trigram). The vulgar do not grasp the True-One’s Way; they refine lead, seeking its truth, yet the substance is buried—how could the true emerge? Thus the Classic says: *\"Do not destroy my lead, lest my life be forfeit.\"*\n\nThe Way of seeking the true form:\nIt draws upon the Three Lights above and responds to the Three Talents below. When the Six Harmonics are complete, transformations are boundless—this is the True-One’s Way.\n\nThe false arises from those who pursue immortality without studying the Classics, without guidance from a master, fabricating methods on their own. They take ordinary mercury and, without proper method, arbitrarily apply yin and yang, attempting to make the supreme elixir—thus failing. Li Cheng says: *\"How could ordinary lead and mercury be mistaken for the supreme elixir?\"* Not conforming to Heaven and Earth, they misuse clarity, causing yin and yang to clash, disrupting cold and heat—how could they not use false methods and later lament?\n\nThus the Classic says: *\"The shallow and profound, the wise and foolish, the true and false—these have existed since antiquity.\"*\n\nThe method follows the Two Principles—Heaven and Earth.\nTaking symbols from the Eight Trigrams,\nThe Great Elixir transforms and revolves, its body and structure adhering to these symbols.\nThe circulation of metal and water aligns with the Twenty-Eight Lunar Mansions, harmonizing with the Eight Trigrams to form the Eight Trigrams.\nEvery forty-five days completes one phase—this is one trigram.\nA year has three hundred sixty days, with eight phases of forty-five days, hence the Eight Trigrams are taken as symbols.\nFrom the *Taiyi* to the manifest, the Eight Trigrams are also the symbols of the sun and moon.\n\nTo open and distinguish Heaven and Earth—\n*\"Open\"* means to establish.\nTo clarify Heaven and Earth’s distinctions—\nHeaven and Earth’s positions are the cauldron’s tripod.\nFirst discuss the tripod, then the elixir; once Heaven and Earth’s positions are set, the revolutions of the Celestial Cycle are defined.\n\nCold and heat are harnessed, yin and yang contend—\nTiming must not miss the seasons; this is taking symbols.\nTo blend the transformations of yin and yang—\nYin and yang are *qi*; just and yielding are forms.\nThus the worthy scholar follows this pattern, with water and fire as masters.\nTheir separation has its time; only then can one discern the transformations of yin and yang.\n\nThe *Tongxuan Lun* states: *\"This is the mother of Heaven and Earth—sand and mercury.\"*\n\nPointing to the trigram *Kàn* and weaving with the Classic,\n*Kàn* is metal, positioned in the west.\n*Kūn* is water, yet it is also metal.\nWater and fire, the two substances, circulate and return, entering and exiting, bending and extending—their forms.\nGuo Zhenren says: *\"The west is bound as the weft; the *jiǎ* position is the binding.\"*\n*Jiǎ* is the first of the Ten Heavenly Stems; *jiǎ* is the divine child, the first of the Twelve Divine Ones.\nPairing *jiǎ* with *zǐ* (child), hence it is called the weft.\nIt corresponds to the south and north, taking and discarding.\nThus the song says:\n*\"Pick the south, take the north,\nChild and Mother contend.\nTurn north to west,\nPairing husband and wife—\nThis is not empty.\"*\n\nThus the elixir stone, one substance, bears only yin—\nThis is called taking and discarding.\nThe *Shìfáng* constellation leaps upon the Azure Dragon—\n*Shìfáng* is the *jiǎ* mansion, so mercury resides in the *Fáng* star.\nThe *Fáng* star belongs to the *mǎo* (east), green in hue—\nWood is born of water, and water belongs to the north, black in hue.\nGreen and black are called Azure, hence the Azure Dragon.\nZhang spreads its wings like a White Horse’s belt—\n*Zhāng* is the fire mansion of the south, symbolizing cinnabar.\nThis is the ancient immortals’ method of shedding its red aura,\nRestoring its true nature—\nCalled \"cinnabar that has shed its body,\" also White Sand,\nOr White Horse Tooth.\nThus the black-and-yellow forms—\nHeaven and Earth—\nAs the substance of vessels, their sinews are mercury,\nTheir bones are silver.\nUnder the influence of fire-*qi*, gold and water naturally shed their lead,\nGradually purifying impurities.\nOn the vessel, they fly and circulate,\nDispelling stagnation and adding mist—light and unrestrained.\n\nThey dwell in rocky crevices, straddle mountains, overlook rivers.\nMercury in the cauldron, submerged by metal and water,\nUnder roasting and boiling, surges and bubbles, unable to settle,\nGradually forming flowers above,\nOr gathering into a mass—\nDwelling in rocky crevices, hidden in valleys.\nOr lying dormant in the pan, like the form of mountains.\nObserving the sun’s radiance and the moon’s hues,\nThis spans years and accumulates over time.\nThe sun’s radiance is mercury; the moon’s hues are gold.\nGold and mercury forming shape—\nNot until the sun is full and the moon complete will it be achieved.\n\nThus a year governs twelve months, with three hundred sixty days.\nTime accumulates into months, months into years,\nUntil one Celestial Cycle encompasses four thousand three hundred ten days,\nSymbolizing the four thousand three hundred years of cosmic circulation.\nHence it is said: *\"Spanning years and accumulating over time—*\nThe worthy scholar examines and verifies this,\nUsing the Great Elixir to pair yin and yang,\nCreating cold and heat,\nYin consuming yang, yang nourishing yin—\nThe Returned Elixir does not submit to the Four Seasons and Five Phases unless their symbols are taken.\n\nTo exhaust the workings of transformation,\nTo follow Heaven’s time and serve Heaven.\nTo exhaust the Way of yin and yang,\nTo know the source of transformation.\nThe Master says: *\"*",
      "overlap_context": ") states: *\"To understand the medicine, first understand oneself.\"* Realizing this single phrase reveals the myriad transformations.\n\nIf Heaven and Earth undergo change, and the male and female forces contend in their courses—if similar yet divergent, or dark and light intermingle—it is like ascending the stars with a ladder, or attempting to fish a whale with a suspended needle. Fortune smiles upon those worthy scholars who scrutinize and elucidate these truths—I dare not err in the sacred Dao!",
      "start_char": 666,
      "end_char": 1948,
      "start_sentence": 35,
      "end_sentence": 105,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 14.928996324539185,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\陶真人内丹赋.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "知变化之源，其知神乎。 故演八卦，父子君臣，刚柔相配，度其尊卑，运终六律，合成大道，定五行六律，七十二侯，四十五节，推二十四气刻漏，取定大小，而讽兴三才，取象天地。 《参》云：穷神以知化。 是故圣人法为顺天，无别义也。 始雄雌而偶匹，终翱翔而升仙。 始，初也。 《参》云：初正则终辩，干之未可持。 即是雄汞雌金，宝相配为药，可中服食。 翱翔者，义朱雀汞也。 得之伏徘徊，禀气渐升火，名日正阳之丹矣。 爰有物外之人，性禀天真，抱冲和之精气，厌寰海之嚣尘。 吴筠先生云：仙者，人之所美也。 死者，人之所恶也。 所以神不清骨不峻者，非禀於阳灵之气，所禀者叉无慕仙之心矣。 慕仙之心者，受气之时，得值长生之宿，兼逢阳王之官，所以人性禀天真，起於物外，恬淡纯粹，体和神清，厌於寰海，弃於嚣尘矣。 夫求不死之方，寻延龄之诀，得金丹之奥旨，洞玄妙之真说。 不死之方，出自黄老。 老子丹经，延龄之诀者，即《参同契》、《金碧经》是也。 如志士得获此本，先须上告三官，下告土地真君，然后沐浴斋心，冷室焚香，习而考之，方得心开悟解，了释真元。 学道之士。 须广求师友，请益毫厘，不可妄作也。 故杳杳冥冥，其中有精。 杳冥者，是阴黑玄之貌。 其中有精者，银也。 精者，汞也。 即是银於太阴之中，但受太阳之气，温养日久，冥遁其形，潜伏於太阴之内。 如有根萌熙足成形，号日伏火水银是也。 又杳冥者，不正之貌。 若无若有，不之而可见也。 故经云：冥冥凝神，不出我身。 铅不呈朴，汞不露形。 还阳子云：铅受辛盲，故被褐怀玉。 金禀汞甲，胎自着徘而入水。 灌金花之一气，察水火之两名。 郭真人日：先镕金花为水，别器暖汞投入池中，其色凝白，状如铅苏，义亦伺否。 又一气真一也，一化受符，青龙之位，为束方震。 震属木，木生火，谓之汞。 土能生金，谓之阴银。 故云：察水火之两名也。 分布四象，陶均五行，驻日魂而呼月魄，遵虎性而契龙情。 李澄云：金木二字，坎离四象，急药之体。 铅汞者，玄妙之门，还丹根基。 此言青龙白虎，朱．雀玄武，为四象也。 四象成而五行了。 二十八宿周天，日月合度，龙呼於虎，虎吸其龙，性情交泰，日月周毕，岂不是四象五行陶均也。 由是演易示机，杓星设位，循箕斗而散彩， 李淳风日：北斗七星也，近紫微官，在太微北，是为帝车，以主号令，运乎中央，而临制四方。 建四时，均五行，移节度，定诸纪分，系之於斗。 其魁为璇玑，其柄三，为玉衡。 书日：璇玑玉衡，以齐七政。 箕斗者，是寅巳之位，起火於此，甲之散彩。 绵艮兑而通气， 艮为山，兑为泽。 《易》日：在天成象，在地成形，变化见矣。 韩康伯日：象况日月星辰，形况山川草木，悬象运转，而成昏明。 山泽通气，而云雨施，行连循环，上下通气，此义深矣。 播刑德而合刚柔，入中宫而归戊己。 播，施也。 刑主阴煞，德主阳汞，而刚柔自合，故入中官，而归戊己。 戊己者，是土位，称黄帝生处玄立。 又能克水银，而玄伏矣。 《金碧经》云：以制太平，并中宫土。 《参》云：三物一家，都归戊己。 三物，水火金也。 尔乃九还变态，七返呈妍。",
      "translated_text": "Know the source of transformation—then you know the **Divine** *(shén)*.\n\nThus the Eight Trigrams are performed:\nFather and son, lord and minister,\nHard and soft paired in harmony,\nRanked by their high and low,\nThe Six Pitches completed in cycle,\nUniting to form the Great Dao.\nThe Five Phases and Six Pitches are fixed,\nSeventy-two Constellations, forty-five nodes,\nThe Twenty-four Qi marked by water clocks,\nGreat and small determined—\nThen chanting the Three Powers *(Tiān-Dì-Rén)*,\nTaking symbols from Heaven and Earth.\n\nThe *Cān* *(参)* says: *\"Exhaust the Divine to know transformation.\"*\nThus the Sage follows *for* *(fǎ)* as the Way of Heaven—\nNo other meaning exists.\n\nAt first, male and female pair in union,\nAt last, soaring they ascend as Immortals.\n*Begin* means *initial*—\nThe *Cān* says: *\"When the beginning is upright, the end is clear;\nThe *Gān* *(干)* is not yet firm.\"*\n\nThis is the male mercury and female gold,\nThe precious pair configured as medicine,\nFit for internal ingestion.\n*Soaring* refers to the *Jūquè* *(朱雀)* mercury.\n\nObtained, it lingers in hesitation—\nInheriting qi, it gradually ascends as fire,\nNamed the *Zhèngyáng* *(正阳)* Elixir.\n\nThere are those beyond things,\nWhose nature inherits Heaven’s purity,\nEmbracing the harmonious *chōnghé* *(冲和)* essence,\nDisgusted by the world’s clamor and dust.\n\nMaster Wú Yún said:\n*\"The Immortal is what people admire.\nDeath is what people detest.\nThus, if the spirit is not pure and the bones not refined,\nIt is not because they lacked the yang spirit’s breath—\nNor did they lack the yearning for Immortality.\"*\n\nThose who yearn for Immortality,\nAt the moment of receiving breath,\nEncounter the *Chángshēng* *(长生)* constellation,\nAnd meet the *Yángwáng* *(阳王)* office—\nThus, human nature inherits Heaven’s purity,\nRising beyond things,\nSerene and pure, the body harmonious, the spirit clear,\nDisgusted by the world, abandoning the dust.\n\nTo seek the method of non-death,\nTo find the secret of prolonged life,\nTo grasp the essence of the Golden Elixir,\nTo penetrate the profound and mysterious truth—\n\nThe method of non-death originates from the Yellow Emperor and Laozi.\nLaozi’s *Danjīng* *(丹经)*,\nThe secret of prolonged life is the *Cāntóng Qì* *(参同契)* and *Jīnbì Jīng* *(金碧经)*.\n\nIf a worthy scholar obtains this text,\nFirst, they must report to the Three Officials *(Sān Guān)* above,\nAnd to the Land and Soil True Lords *(Tǔdì Zhēnjūn)* below.\nThen, they must bathe and purify their heart,\nBurn incense in a cold chamber,\nStudy and verify it—\nOnly then will their mind open, enlightened,\nAnd the True Essence *(Zhēnyuán)* be revealed.\n\nScholars of the Dao must seek teachers and friends widely,\nRequesting even the minutest clarifications—\nNever act recklessly.\n\nThus, *yǎoyǎo míngmíng* *(杳杳冥冥)*—\nWithin its depths lies the essence.\n*Yǎomíng* *(杳冥)* is the appearance of dark, mysterious black.\nWithin it lies the essence—*yín* *(银)*.\nThe essence is *gǒng* *(汞)*.\n\nThis is silver hidden in the Great Yin,\nOnly receiving the breath of the Great Yang,\nNourished by warmth over time,\nIts form concealed, lurking within the Great Yin.\nWhen its root sprouts and its vitality is complete,\nIt is called *Fùhuǒ Shuǐyín* *(伏火水银)*.\n\nAgain, *yǎomíng* is the appearance of the unrefined.\nIt is as if it is, yet not—\nNot seen, yet visible.\nThus the Classic says:\n*\"In mysterious darkness, the spirit condenses—\nLead does not reveal its crudeness,\nMercury does not show its form.\"*\n\nThe Returned-to-the-Yang Master says:\n*\"Lead receives the blind acid—\nThus, wrapped in coarse cloth, it holds jade.\nGold inherits the mercury’s armor,\nIts embryo enters the water through hesitation.\"*\n\nInfusing the *Jīnhuā* *(金花)* with its breath,\nExamining the two names of water and fire.\n\nMaster Guó *(郭真人)* says:\n*\"First, melt the *Jīnhuā* into water,\nUse another vessel to warm the mercury and pour it into the pool.\nIts color congeals white,\nIts form resembles lead’s *sū* *(苏)*—\nThis is also called *sìfǒu* *(伺否).\"*\n\nThe *Yīqì* *(一气)* is the True One—\nOne transformation receives the talisman,\nThe position of the Green Dragon,\nBound by the *Shuāngfāng* *(束方)* and *Zhèn* *(震)*.\n\n*Zhèn* belongs to Wood,\nWood generates Fire—this is mercury.\nEarth can generate Metal—this is Yin silver.\n\nThus it is said: *\"Examine the two names of water and fire.\"*\n\nDistribute the Four Symbols,\nRefine the Five Phases,\nSummon the sun’s soul and call the moon’s shadow,\nFollow the tiger’s nature and harmonize with the dragon’s emotions.\n\nMaster Lǐ Chéng *(李澄)* said:\n*\"The characters *jīn* *(金)* and *mù* *(木)*,\nThe four symbols of *Kǎn* *(坎)* and *Lí* *(离)*,\nAre the body of the urgent medicine.\nLead and mercury are the gate of profound mystery,\nThe root of the Returned Elixir.\"*\n\nThis refers to the Green Dragon, White Tiger,\nVermilion Bird, and Dark Tortoise—\nThe Four Symbols.\nWhen the Four Symbols are complete, the Five Phases are fulfilled.\n\nThe Twenty-eight Constellations circle Heaven,\nThe sun and moon align in measure—\nThe dragon breathes to the tiger,\nThe tiger inhales the dragon’s breath—\nTheir natures and emotions harmonize,\nThe sun and moon complete their cycles—\nIs this not the Four Symbols and Five Phases refined?\n\nFrom this, the *Yì* *(易)* demonstrates its mechanism,\nThe *Sháo* *(杓)* star sets its position,\nFollowing the *Jī-Dǒu* *(箕斗)* to disperse its hues.\n\nMaster Lǐ Chúnfēng *(李淳风)* said:\n*\"The Northern Dipper’s seven stars,\nNear the *Zǐwēi* *(紫微)* office,\nLocated north of *Tàiwéi* *(太微)*,\nCalled the Imperial Chariot—\nIt issues commands,\nIts movement governs the center,\nOverseeing the four directions.\nIt establishes the Four Seasons,\nBalances the Five Phases,\nAdjusts the nodes,\nFixes all divisions—\nAll tied to the Dipper.\nIts *kuí* *(魁)* is the *Xuánjué* *(璇玑)*,\nIts handle has three—\nThe *Yùhéng* *(玉衡)*.\nThe text says:\n*'Xuánjué and Yùhéng,\nTo harmonize the Seven Governors.'*\n\n*Jī-Dǒu* are the positions of *yín-wèi* *(寅巳)*,\nFire arises here—\nThe *Jiǎ* *(甲)* disperses its hues.\n\nConnecting *Mián* *(绵)* and *Gèn* *(艮)* to *Duì* *(兑)*,\n*Gèn* is Mountain, *Duì* is Marsh.\nThe *Yì* says:\n*'In Heaven, it forms symbols;\nOn Earth, it forms shapes—\nTransformation is revealed.'*\n\nMaster Hàn Kāngbó *(韩康伯)* said:\n*'Symbols refer to the sun, moon, and stars;\nShapes refer to mountains, rivers, grasses, and trees.\nSuspended symbols revolve,\nCreating darkness and light.\nMountains and marshes communicate qi—\nThus clouds and rain descend,\nFlowing in endless cycles,\nQi circulates above and below—\nThis meaning is profound.\"*\n\nApply *xíng* *(刑)* and *dé* *(德)* together,\nHard and soft unite,\nEntering the Central Palace,\nReturning to *Wù-Jǐ* *(戊己)*.\n\n*Bò* *(播)* means *to apply*.\n*Xíng* governs yin destruction,\n*Dé* governs yang mercury—\nThus hard and soft naturally unite,\nEntering the Central Palace,\nReturning to *Wù-Jǐ*—\nThe Earth position,\nNamed *Huángdì Shēngchù Xuánlì* *(黄帝生处玄立)*.\n\nIt can also subdue water and silver,\nThus the Dark is concealed.\n\nThe *Jīnbì Jīng* says:\n*\"To govern the Great Peace,\nTogether with the Central Palace Earth.\"*\n\nThe *Cān* says:\n*\"The three substances belong to one family,\nAll returning to *Wù-Jǐ*.\"*\n\nThe three substances are water, fire, and metal.\nThen, through nine returns, its forms transform,\nSeven refineries reveal its beauty.",
      "overlap_context": " it is said: *\"Spanning years and accumulating over time—*\nThe worthy scholar examines and verifies this,\nUsing the Great Elixir to pair yin and yang,\nCreating cold and heat,\nYin consuming yang, yang nourishing yin—\nThe Returned Elixir does not submit to the Four Seasons and Five Phases unless their symbols are taken.\n\nTo exhaust the workings of transformation,\nTo follow Heaven’s time and serve Heaven.\nTo exhaust the Way of yin and yang,\nTo know the source of transformation.\nThe Master says: *\"*",
      "start_char": 1948,
      "end_char": 3211,
      "start_sentence": 106,
      "end_sentence": 170,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 24.155558586120605,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\陶真人内丹赋.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "九当乾卦，么几龙立位。 七当坤卦，飞龙在天。 大人造化，么几龙有悔，穷之灾也。 故从九位而返七。 夫修真之士，须明卦象，屈伸动静，出入卷舒，升降进退，各有所配，方守一而炼真，即见交泰呈妍之理，配男女以时也。 运水火而相鲜， 《参》云：本在交媾，定至生人。 以坎男离女配合，日居月诸，精彩潜媾。 尽一气而成牙蘗。 《易》日：日月运行，一寒一暑，乾道成男，坤道成女。 乾知太始，坤作成物。 是日月以天地之用，金水交精，水火运移，还尽一元之气。 一元者，六十日也，四熙成。 《契》云：元年乃牙潜也。 由内贞而外顺， 内者金，外者水。",
      "translated_text": "Nine corresponds to the *Qián* (乾) hexagram—\nThe *Wǔ-Jǐ* (么几) Dragon takes its station.\n\nSeven corresponds to the *Kūn* (坤) hexagram—\nThe Flying Dragon ascends to Heaven.\n\nThe Sage’s transformation:\nThe *Wǔ-Jǐ* Dragon meets regret—\nA calamity of exhaustion.\nThus, one returns from the Nine to the Seven.\n\nThe adept of cultivation must grasp the hexagrams,\nBending and stretching, motion and stillness,\nEmergence and retreat, unfolding and coiling,\nAscension and descent, advance and withdrawal—\nEach has its paired correspondence.\nOnly then, by holding to the One and refining the True,\nDoes the principle of *Jiāo-Tài* (交泰) reveal its splendor—\nThe timely pairing of male and female.\n\nCirculating water and fire to nourish each other,\nThe *Cān* says:\n*\"Its origin lies in copulation,\nFixed to bring forth life.\"*\n\nWith *Kǎn* (坎) as male and *Lí* (离) as female paired,\nThe Sun resides in the Moon’s abode,\nTheir essence subtly mingling.\nExhausting the *qi* yields the *yá* (牙) and *niè* (蘗).\n\nThe *Yì* says:\n*\"The Sun and Moon revolve—\nOne cold, one warm.\nThe Dao of *Qián* forms the male,\nThe Dao of *Kūn* forms the female.\n*Qián* knows the Great Beginning,\n*Kūn* completes the things.\"*\n\nThus, the Sun and Moon employ the functions of Heaven and Earth,\nGold and water merge their essences,\nWater and fire circulate and transform,\nReturning to exhaust the *yīyuán* (一元) *qi*.\nThe *yīyuán*—sixty days—\nFour *xī* (熙) complete.\n\nThe *Qì* says:\n*\"The first year is the hidden *yá*.\"*\n\nFrom inner sincerity to outer harmony—\nInner is metal, outer is water.",
      "overlap_context": "Entering the Central Palace,\nReturning to *Wù-Jǐ*—\nThe Earth position,\nNamed *Huángdì Shēngchù Xuánlì* *(黄帝生处玄立)*.\n\nIt can also subdue water and silver,\nThus the Dark is concealed.\n\nThe *Jīnbì Jīng* says:\n*\"To govern the Great Peace,\nTogether with the Central Palace Earth.\"*\n\nThe *Cān* says:\n*\"The three substances belong to one family,\nAll returning to *Wù-Jǐ*.\"*\n\nThe three substances are water, fire, and metal.\nThen, through nine returns, its forms transform,\nSeven refineries reveal its beauty.",
      "start_char": 3212,
      "end_char": 3480,
      "start_sentence": 171,
      "end_sentence": 186,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 9.202881574630737,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\陶真人内丹赋.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "金水欲行，盖顺阴阳之法，用候卦爻。 内为阳三画，外为阴三画，处阳之时，外求於内。 在阴之时，内求於外。 金居内为春夏直符也，水居於外为秋冬直符也。 内外之际，盖取象於卦中。 乃玄之而又玄。 玄者，玄元也。 如太上分一气为二义，二义天地也。 地也者，剖一气而真素，号日真一，故是真玄也。 又玄者，是变白为黄金，黄金为至宝，故云玄之又玄。 经日； 衍士服食之，寿命得长久。 金性不败朽，故为万物宝。 非服常金也。 金也，当其变也。 即火东旋而为龙，水西转而成虎，虎脱胎而弃子，龙辞丙而致雨。 崔昤山日：其神化之而为液，凝之即成汞，如霜璨烂，似玉阑干。 素魄流晶，光影星钻，千炼万化，其体常然，从无入有，坏而复成。 自有入无，灭而复生。 阳与阴合，阴与阳并，展转变化，遂为物精。 仙人百炼，而为通灵。 还返不穷，还丹是名。 又歌日：五行颠倒衍，龙从火裹出。 五行不顺行，虎自水中生。 此是明至药法，准此阴阳相克，五行错王而成者矣。 气惟先白黑而后黄，始水火而终土。 此是金水状貌，从复用事，至十月终坤，变转体段，先白后黄，赤黑连表，各还本位，其骨是大还丹也。 始火者，火数二，水数一。 火既灭，四时辐奏一气，十五日二十四气，生成万物。 夫还丹者，象水火成万物，禀天地阴阳之气，气以刚柔，合度四时，不能陶铸，则真一之道毕矣。 舍南取北，甲乙宗祖。 经日：阳中有阴，阴中有阳。 阴中有阳者，砂中产汞也。 汞离阳，故归北方自然水。 水能生木，木居甲乙，与火为宗祖也。 一文云：即火东旋而为龙是也。 神水圣石，帝男金女。 神水者，非酒醋之炼者，石不可作也。 是阴一制阳一，为华池之义。 故云帝男龙女，实三一之要也。 道本不离於玄黄，守一要存乎三五。 道本者，汞也。 天地与三五之气。 守一要存乎，不离金汞巳金也。 志士细而详之，言真实理也。 信由青腰致远，玄素钩深。 青腰曾青，玄素是金，即青龙白虎。 钩深，致远之义也。 风谓七八之水，水生九六之金。 风者，阳气也。 从十五日前，震卦用事，汞得金气钩留，自然调畅也。 水生者，阴气也。 十六日已后，转受巽，变刚为柔，是金消，故入汞而归坤卦也。 《参》云：七八数十五，六九亦相应。 是一月运六十四卦也。 刚表柔裹，内阳外阴。 刚表者，金也。 柔裹者，汞也。 经云：阴银而阳汞是也，故内阳而外阴。 别注云：刚者乾也，柔者坤也。 阴阳合德，而刚柔有体。 阴阳者气也，刚柔者形也。 禀阴阳成金水，金水之形既成，合体凝而成坚，是变易也。 青龙跃而白虎伏，朱雀飞而玄武沈。 青龙木神，白虎金神。 经云：丹砂木精，得金乃并。 取天之汞，合地之银，聚魂魄而成还丹。 天玄地黄，合度砂汞，乃当合之时，俱入神室之中，炼此神精，火土金运，摧文武急缓，以应锺律。 朱雀者火，南方之位也。 玄武者水，北方之位也。 言汞或走或飞，从南方朱雀中，北方水火。 二水一合数三，为东，青龙铅水，故先踊跃而伏白虎也。 经云：龙阳数奇左，虎阴数偶右也。 由是日烁中男，月迷姥女。 日者，火也。 中男者，金精为月，得火气而自消散，与汞合为一体，其汞传金气自迷，故不走不飞，谓之月迷妮女。",
      "translated_text": "Metal and water seek to act,\nFollowing the laws of yin and yang,\nUsing the *guà* (卦) and *yáo* (爻) for timing.\nInner is three yang lines,\nOuter is three yin lines.\nWhen in yang times, seek the outer from within.\nWhen in yin times, seek the inner from without.\nMetal within is the direct symbol of spring and summer,\nWater without is the direct symbol of autumn and winter.\nThe interplay of inner and outer\nDraws its analogy from the *guà*.\nThen it is made profound—\nAnd again profound.\nThe profound is the *Xuányuán* (玄元).\nAs the *Tàishàng* divides one *qi* into two meanings,\nThe two meanings are Heaven and Earth.\nEarth, cleaving one *qi* into true essence,\nIs called *Zhēnyī* (真一), thus it is the true profound.\nAgain, the profound—\nThis is transforming white into gold,\nGold being the supreme treasure,\nHence, \"profound again profound.\"\n\nThe *Jīng* says:\n*\"Those who practice *yǎnshì* (衍士) and alchemical nourishment\nShall attain longevity.*\nMetal’s nature does not decay,\nThus it is the treasure of all things.\nNot common metal—\nMetal, when transformed,\nBecomes the dragon spiraling east by fire,\nThe tiger turning west by water.\nThe tiger sheds its shell and discards its offspring,\nThe dragon departs from *bǐng* (丙) to summon rain.\n\nMount *Cuīmò* (崔昤) says:\nIts spirit transforms into liquid,\nCongealed, it becomes mercury—\nLike frost shimmering, resembling jade railings.\nThe pure essence flows crystalline,\nIts light and shadow like stars and drills.\nRefined ten thousand times, its form remains constant—\nFrom non-being to being, destroyed yet reborn,\nFrom being to non-being, extinguished yet revived.\nYin and yang unite,\nYin and yang merge,\nEndlessly transforming, becoming the essence of things.\nThe sage refines it a hundred times to attain *tōnglíng* (通灵).\nEndless return—this is called *huándān* (还丹).\n\nAnother song says:\n*The Five Phases invert and spread,\nThe dragon emerges from fire’s embrace.*\n*The Five Phases act disorderly,\nThe tiger is born from water.*\nThis reveals the method of the supreme elixir,\nWhere yin and yang contend,\nThe Five Phases clash and reign in turn.\n*Qi* first appears white and black, then yellow,\nBeginning with water and fire, ending with earth.\nThis is the form of metal and water,\nActing from *Fù* (复), until the tenth month completes *Kūn* (坤),\nTransforming its segments—\nFirst white, then yellow,\nRed and black intertwined,\nEach returning to its root—\nIts essence is the Great *Huándān*.\n\nFire first—\nFire’s count is two, water’s count is one.\nFire extinguished,\nThe four seasons converge into one *qi*,\nFifteen days, twenty-four *qì* (气),\nGiving birth to all things.\n*Huándān* mirrors water and fire creating all things,\nDrawing upon Heaven and Earth’s yin and yang *qi*,\n*Qi* balanced in hardness and softness,\nHarmonized with the four seasons,\nUnable to forge—\nThen the Dao of *Zhēnyī* is complete.\n\nAbandon the south, take the north,\n*Jiǎyǐ* (甲乙) as ancestral roots.\nThe *Jīng* says:\n*\"Within yang is yin, within yin is yang.*\nYin within yang—\nSand produces mercury.\nMercury departs from yang,\nThus returning to the natural water of the north.\nWater nourishes wood,\nWood resides in *jiǎyǐ*,\nWith fire as ancestral roots.\nAs it says: *Fire spiraling east becomes the dragon.*\n\nDivine water, sacred stone,\nThe imperial male and female—metal and mercury.\nDivine water is not the fermented brew of alcohol and vinegar,\nStone cannot be used.\nThis is yin-one controlling yang-one,\nThe meaning of *Huápó* (华池).\nHence, the imperial male and female—\nThe essence of the Three-One.\n\nThe Dao does not depart from *Xuányellow* (玄黄),\nGuarding One while preserving the Three and Five.\nThe original Dao—mercury.\nHeaven and Earth’s Three and Five *qi*.\nGuarding One while preserving—\nNot departing from mercury, already gold.\nThe determined scholar examines it meticulously,\nSpeaking of true principles.\n\nFrom *qīngyāo* (青腰) to distant attainment,\n*Xuánsù* (玄素) hooks the deep.\n*Qīngyāo*—verdigris,\n*Xuánsù*—gold,\nThe Green Dragon and White Tiger.\nHooking the deep—\nThe meaning of distant attainment.\n\nWind refers to the water of seven and eight,\nWater generates the gold of nine and six.\nWind is yang *qi*.\nFrom the fifteenth day onward, *Zhèn* (震) is active,\nMercury obtains metal *qi* and is drawn in,\nNaturally harmonized.\nWater generated—yin *qi*.\nFrom the sixteenth day onward, it turns to *Xùn* (巽),\nSoftening hardness,\nThus metal dissipates,\nEntering mercury and returning to the *Kūn* *guà*.\n\nThe *Cān* (参) says:\n*\"Seven and eight, fifteen days,\nSix and nine correspond as well.*\nThis is the sixty-four *guà* of one month’s cycle.\nHardness without, softness within—\nInner yang, outer yin.\nHardness without—metal.\nSoftness within—mercury.\nThe *Jīng* says:\n*'Yin is silver, yang is mercury.'*\nThus, inner yang and outer yin.\n\nAnother note says:\n*'Hardness is *Qián* (乾), softness is *Kūn* (坤).'*\nYin and yang unite in virtue,\nHardness and softness have form.\nYin and yang are *qi*,\nHardness and softness are substance.\nDrawing upon yin and yang to form metal and water,\nMetal and water’s forms established,\nTheir substances merge and congeal into solidity—\nThis is transformation.\nThe Green Dragon leaps while the White Tiger lies low,\nThe Vermilion Bird flies while the Black Tortoise sinks.\nThe Green Dragon is the wood spirit,\nThe White Tiger is the metal spirit.\nThe *Jīng* says:\n*'Cinnabar is wood essence,\nObtaining metal, they merge.*\nTaking Heaven’s mercury,\nCombining with Earth’s silver,\nGathering soul and spirit to form *huándān*.\nHeaven’s *Xuán*, Earth’s *Huáng*,\nHarmonizing cinnabar and mercury—\nAt the proper moment, both enter the divine chamber,\nRefining this spirit essence,\nFire, earth, and metal circulating,\nBalancing *Wén* (文) and *Wǔ* (武), swift and slow,\nResponding to the *zhōnglǜ* (钟律).\nThe Vermilion Bird is fire, the south’s position.\nThe Black Tortoise is water, the north’s position.\nSpeaking of mercury—\nSometimes it flees, sometimes it flies,\nFrom the south’s Vermilion Bird,\nThrough north’s water and fire.\nTwo waters merge, three times—east,\nGreen Dragon lead-water,\nThus it first leaps and subjugates the White Tiger.\nThe *Jīng* says:\n*'Dragon-yang, odd numbers to the left,\nTiger-yin, even numbers to the right.'*\nThus, the sun scatters the central male,\nThe moon bewilders the maiden.\nThe sun—fire.\nThe central male—metal essence as moon,\nObtaining fire *qi* and self-dissipating,\nMerging with mercury as one body,\nMercury transmitting metal *qi* and becoming confused,\nNeither fleeing nor flying—\nCalled the moon bewildering the maiden.",
      "overlap_context": "rm.\nThe Dao of *Qián* forms the male,\nThe Dao of *Kūn* forms the female.\n*Qián* knows the Great Beginning,\n*Kūn* completes the things.\"*\n\nThus, the Sun and Moon employ the functions of Heaven and Earth,\nGold and water merge their essences,\nWater and fire circulate and transform,\nReturning to exhaust the *yīyuán* (一元) *qi*.\nThe *yīyuán*—sixty days—\nFour *xī* (熙) complete.\n\nThe *Qì* says:\n*\"The first year is the hidden *yá*.\"*\n\nFrom inner sincerity to outer harmony—\nInner is metal, outer is water.",
      "start_char": 3480,
      "end_char": 4761,
      "start_sentence": 187,
      "end_sentence": 262,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 16.41007351875305,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\陶真人内丹赋.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "诧女者，汞也。 中男者，金也。 魏君日：火能消金，金伐木荣，三五与一，天地至精者矣。 土强金劲，一寒一暑。 土者雄黄，得位中官，将军之名。 能偃於水，又能生金。 一寒一暑者，发火文武及时者也。 龙呼虎吸，乌蟾吞吐。 龙者汞，虎者金，乌蟾者日月精也。 金汞得火水气，於鼎内变化，高低之貌，运文武火戏，一上一下，一俯一仰，出化没化既定，吞吐依时，黄白乃成，号日金星美砂、巨胜紫覆粉。 若不化定，伏在金中者，名日金龙丹，亦名伏火紫粉，都是大还丹。 南北交媾於水火，卯酉周旋於子午。 水银是北方之位也。 火是朱砂，南方之位也。 二方往来，各守定性。 寒从北方来，暑从南方至，二方各在用，还往本官也。 卯者东汞，酉者金汞，合水火而归於子午。 紫河车诀云：十二月生儿，子午是也。 总括乾坤之策，优游变化之主。 运乾坤二卦，皆有策数。 乾策阳爻，半支得六千九百一十二。 坤策阴爻，半得四千六百八。 总括万有一千五百二十。 主者金也。 金为君，象北辰。 乾坤交动之时运无辍，而居极是不移。 金水在器内，任其水火熏蒸，自然而成正体，优游随节变化也。 母子包罗於匡郭，修养因依於鼎釜。 此是金法，世人造次岂能知。 子母者，金水也。 金水者，坎离二用，为内象外象也。 二气合牙之道，交合於鼎。 鼎之中舒光照耀，象日月连环，在六合之中。 水火为药，乾坤为鼎，可理匡郭，金鼎之理。 《参》云：坎离匡郭者，城郭也。 《五相类》云：城郭完全，人物乃生。 是也。 世人不晓金鼎，多以金银及铅黄花为，此大恨也。 配铢两以定循环，察爻象而校火数。 配铢两者，六铢为一分，四分为一两，一两为二十四铢，一斤为合三百八十四铢，象六十四卦有三百八十四爻。 循还增喊，察察动而定其火数。 经云：火记不虚，演《易》以明也。 若夫二至启闭， 冬至夏至。 阴阳递迁， 从子至巳阳生，从午至亥阴生。 终坤媾而始逛，起复临而尽乾。 直纯乾讫，乃从初九一变为始。 九二为三，三为否，九四为观，九五为剥，上九为坤，九还七返，火天大有。 此是终乾始遁。 又置纯坤卦，依前从下位初六变为复，二为临，六三为泰，六四为大壮，六五为央，上六为需，八归六居水地比也。 故经云：起临而尽乾也。 飞龙偃月， 飞龙是汞，偃月是器。 上下两弦。 李澄日：青龙二八白虎中，是初八与二十三日，金水各半斤也。 黄金白雪，神化自然。 黄金者，还转铅精，凝为紫磨，赫然赤也，故日黄金。 白雪者，飞伏水银，色如雪，故日白雪。 乃是神化自然之道，服之羽化矣。 融坤艮以成地， 坤为阴，艮为银，三篇云：聚阴为地是也。 仰乾兑而为天。 乾为阳，兑为金。 陶君日； 积阳为天是也。 《易》日：山泽通气。 又云：天地不交之气何也，为形质各易。 母子恩戚，相主交连。 母子恩戚者，铅制於汞，汞能伏铅，铅汞合为，黄白之道毕矣。 银本从铅中生，盖铅抱於子也。 藏铅在银，银隐於铅中，故是相主勾连。 喻人之在道，道不离人。 鱼在水中，水离鱼。 鱼无水即死，人失道则亡，主相通玄理也。 一色三五，．水激云烟。 一者，真一也。 三者，汞也。 五者，雄黄土也。 真一与土，是阴重之物，故不受飞也。",
      "translated_text": "The astonished maiden—mercury.\nThe central male—gold.\n\nWei Jun said:\nFire consumes gold, gold strikes wood to flourish—\nThree and five unite with one,\nThe most refined essence of Heaven and Earth.\n\nEarth is strong, metal is fierce—\nCold and heat alternate.\nEarth is realgar, obtaining its position in the central official,\nA general’s name.\nIt can lie prone in water,\nYet also generate gold.\n\nCold and heat alternate—\nIgniting the martial and civil fires in due time.\n\nThe Dragon exhales, the Tiger inhales,\nThe Black Tortoise and Toad swallow and emit.\nThe Dragon is mercury,\nThe Tiger is gold,\nThe Black Tortoise and Toad are the essence of sun and moon.\n\nWhen gold and mercury obtain the *qi* of fire and water,\nWithin the crucible they transform—\nHigh and low in form,\nOperating the civil and martial fires in play—\nOne ascends, one descends,\nOne bows, one rears.\nOnce the phases of emergence and concealment are fixed,\nSwallowing and emitting follow their time—\nYellow and white are achieved,\nCalled *Jīnxīng* (金星, Golden Star) beautiful sand,\nOr *Jùshèng* (巨胜, Great Victory) purple covering powder.\n\nIf not fully transformed,\nThat which lies concealed within gold is called *Jīnlóng Dān* (金龙丹, Gold Dragon Elixir),\nAlso named *Fúhuǒ Zǐfěn* (伏火紫粉, Concealed-Fire Purple Powder)—\nBoth are Great Return Elixirs.\n\nSouth and North copulate in water and fire,\nThe Hare and Rooster revolve between the Child and Horse.\nMercury is the north’s position.\nFire is cinnabar, the south’s position.\nThe two directions come and go,\nEach guarding its fixed nature.\n\nCold comes from the north,\nHeat from the south—\nBoth act in their own time,\nReturning to their original posts.\n\nThe Hare is eastern mercury,\nThe Rooster is gold-mercury,\nCombining water and fire to return to the Child and Horse.\n\nThe *Zǐhéchē* (紫河车) Secret says:\nTwelve months give birth to a child—\nThe Child and Horse are they.\n\nSummarizing the strategies of Heaven and Earth,\nThe sovereign of effortless transformation.\nOperating the *Qián* and *Kūn* hexagrams,\nEach has its own strategy and numbers.\nThe *Qián* strategy’s yang lines—\nHalf a *zhǐ* yields six thousand nine hundred twelve.\nThe *Kūn* strategy’s yin lines—\nHalf yields four thousand six hundred eighty.\nTogether, they total eleven thousand five hundred twenty.\n\nThe sovereign is gold.\nGold as ruler, symbolizing the North Star.\nWhen *Qián* and *Kūn* interact,\nTheir motion never ceases,\nYet at the poles, they do not shift.\n\nGold and water within the vessel,\nAllowing water and fire to permeate naturally,\nThey spontaneously form the true body,\nEffortlessly transforming in accordance with the nodes.\n\nMother and child are enclosed within the square and circle,\nNurtured and refined within the crucible and cauldron.\nThis is the gold method—\nThe world’s hasty folk cannot know it.\n\nMother and child are gold and mercury.\nGold and mercury are the internal and external symbols of *Kǎn* and *Lí*,\nThe method of the two *qi* interlocking,\nTheir union within the crucible.\n\nWithin the crucible, light expands and radiates,\nLike the sun and moon in linked rings,\nWithin the six directions.\nWater and fire are the medicines,\nHeaven and Earth are the crucible,\nCapable of regulating the square and circle—\nThe principle of the golden crucible.\n\nThe *Cān* (参) says:\n*Kǎn* and *Lí*’s square and circle are the city walls.\nThe *Wǔxiàng Lèi* (五相类) says:\nWhen the city walls are complete, figures thrive.\nIndeed.\n\nThe world does not understand the golden crucible,\nOften using gold, silver, lead, and flowers—\nThis is a great regret.\n\nMeasure the *zhūliǎng* (铢两) to determine the cycle,\nObserve the *yáo* symbols to calculate the fire numbers.\nMeasuring *zhūliǎng*—\nSix *zhū* make one *fēn*,\nFour *fēn* make one *liǎng*,\nOne *liǎng* is twenty-four *zhū*,\nOne *jīn* totals three hundred eighty-four *zhū*—\nSymbolizing the sixty-four hexagrams with three hundred eighty-four lines.\n\nThe cycle returns and amplifies,\nObserving movement to determine the fire numbers.\nThe *Jīng* says:\nFire records are not false—\nPerforming the *Yì* to clarify it.\n\nAs for the two solstices opening and closing—\nWinter solstice, summer solstice.\nYin and yang succeed each other,\nFrom the Child to the Perch, yang is born,\nFrom the Horse to the Rooster, yin is born.\nTerminating at *Kūn*’s union and beginning at *Guàn*,\nRising at *Fù* and ending at *Lín*—\nPure *Qián* concludes,\nThen from the initial nine, one variation begins.\n\nNine-two becomes three—\nThree is *Pǐ* (否),\nNine-four is *Guān* (观),\nNine-five is *Bō* (剥),\nUpper nine is *Kūn* (坤),\nNine returns to seven—\nFire-Heaven, Great Possession.\n\nThis is the completion of *Qián* and the beginning of retreat.\n\nAgain, placing the pure *Kūn* hexagram,\nFollowing the previous from the lower position—\nInitial six varies as *Fù* (复),\nTwo as *Lín* (临),\nSix-three as *Tài* (泰),\nSix-four as *Dàzhuàng* (大壮),\nSix-five as *Yǒng* (央),\nUpper six as *Xū* (需).\nEight returns to six, residing in the water-earth *Bǐ* (比).\n\nThus the *Jīng* says:\nRising at *Lín* and ending at *Qián*.\n\nThe flying dragon, the reclining moon—\nThe flying dragon is mercury,\nThe reclining moon is the vessel.\nUpper and lower strings.\n\nLi Cheng said:\nWithin the Green Dragon’s second eight and White Tiger’s center—\nThe eighth and twenty-third days,\nGold and water, half a *jīn* each.\n\nYellow gold, white snow—\nDivine transformation naturally.\nYellow gold is the returned lead essence,\nCongealing into purple powder,\nBrilliant red—\nThus called yellow gold.\nWhite snow is the flying and concealed mercury,\nIts color like snow—\nThus called white snow.\nThis is the way of divine, natural transformation—\nTaking it brings feathered ascension.\n\nFusing *Kūn* and *Gèn* to form earth,\n*Kūn* is yin, *Gèn* is silver.\nThe *Sānpiān* says:\nGathering yin forms earth—indeed.\n\nGazing upward at *Qián* and *Duì* to form heaven.\n*Qián* is yang, *Duì* is gold.\nTao Jun said:\nAccumulating yang forms heaven—indeed.\n\nThe *Yì* says:\nMountain and marsh exchange *qi*.\nAgain it says:\nWhat is the *qi* of Heaven and Earth not exchanging?\nIt is the form and substance each transforming.\n\nMother and child’s affection and sorrow,\nMutually governing their connection.\nMother and child’s affection and sorrow—\nLead is refined by mercury,\nMercury can conceal lead,\nLead and mercury unite—\nThe way of yellow and white is complete.\n\nSilver originally comes from lead,\nFor lead embraces the child.\nConcealing lead within silver,\nSilver hidden within lead—\nThus they mutually govern their profound connection.\n\nIt is like a person in the Dao—\nThe Dao does not depart from the person.\nFish in water—\nWater departs from the fish.\nFish without water die,\nPeople without the Dao perish—\nThis is the profound principle of mutual governance.\n\nOne color, three and five—\nWater stirs mist and cloud.\nOne is the True One.\nThree is mercury.\nFive is realgar, the earth.\nThe True One and earth are heavy yin substances—\nThus they do not receive flight.",
      "overlap_context": ",\nGreen Dragon lead-water,\nThus it first leaps and subjugates the White Tiger.\nThe *Jīng* says:\n*'Dragon-yang, odd numbers to the left,\nTiger-yin, even numbers to the right.'*\nThus, the sun scatters the central male,\nThe moon bewilders the maiden.\nThe sun—fire.\nThe central male—metal essence as moon,\nObtaining fire *qi* and self-dissipating,\nMerging with mercury as one body,\nMercury transmitting metal *qi* and becoming confused,\nNeither fleeing nor flying—\nCalled the moon bewildering the maiden.",
      "start_char": 4761,
      "end_char": 6068,
      "start_sentence": 263,
      "end_sentence": 342,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 22.61604952812195,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\陶真人内丹赋.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "得汞相和，即飞也。 飞之为霜粉，谓之水激云烟，亦由器。 陶真人内丹赋竟",
      "translated_text": "Obtaining harmony with mercury,\nIt ascends—**flight** is achieved.\nThe **flight** manifests as frost powder,\nCalled *\"water-stirred mist and cloud\"*,\nAlso arising from the vessel.\n\nThe *Daoist* **True Person**’s *inner alchemy* **Preface** is complete.",
      "overlap_context": "den within lead—\nThus they mutually govern their profound connection.\n\nIt is like a person in the Dao—\nThe Dao does not depart from the person.\nFish in water—\nWater departs from the fish.\nFish without water die,\nPeople without the Dao perish—\nThis is the profound principle of mutual governance.\n\nOne color, three and five—\nWater stirs mist and cloud.\nOne is the True One.\nThree is mercury.\nFive is realgar, the earth.\nThe True One and earth are heavy yin substances—\nThus they do not receive flight.",
      "start_char": 6068,
      "end_char": 6105,
      "start_sentence": 343,
      "end_sentence": 345,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 1.0466442108154297,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\陶真人内丹赋.txt",
        "category": "方法类"
      }
    }
  ]
}