{
  "source_id": "雁门公妙解录",
  "source_file": "chunked_daozang\\雁门公妙解录.json",
  "total_chunks": 3,
  "total_original_chars": 2992,
  "total_translated_chars": 18393,
  "total_translation_time": 59.505056619644165,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\众术类\\雁门公妙解录.txt",
    "category": "众术类"
  },
  "full_translation": "**Preface to the *Wondrous Explanations of Yanmen Gong* and the *Wondrous Explanations* Itself**\n\n**Title:** *Wondrous Explanations of Yanmen Gong’s Alchemy* (雁门合妙解录).\nA work of the Tang dynasty. One scroll.\nSource: *Zhengtong Daozang* (正统道藏), under the *Dòngshén Bù* (洞神部) in the *Zhòngjiē Lèi* (众街类) category.\n\n---\n\n**Preface to the *Wondrous Explanations of Yanmen Gong* and the *Wondrous Explanations* Itself**\nIn my youth, I harbored illness and devoted myself entirely to cultivation and self-nurturing, even to the point of diligently seeking elixirs from minerals and stones.\n\nI have observed that in our present age, those who pursue alchemy do not spare wealth, laboring tirelessly over furnaces, claiming that the *Héchē* (河车) can be made to produce elixirs instantly, transforming soil and stone into *Jīndān* (金丹), and that *Dānshā* (丹砂) can be refined to strengthen sinews and marrow. Yet, time and again, they fall victim to the very medicines they seek, and physicians cannot save them. Why is this so?\n\nIs it because their foundational principles are flawed? Or because their methods and teachings are unclear? Why do their results never align with their expectations, and why does this occur so frequently?\n\nUpon examining Daoist texts, I chanced upon the *Nine Xīao* (九霄) Lord’s instructions to *Liú Hóng* (刘泓) regarding the essentials of elixir refinement. The Lord lamented that ordinary practitioners had yet to glimpse the slightest hint of the ultimate Dao, yet they presumptuously boasted of their proficiency, deceiving others. All their endeavors were merely swift paths to self-destruction—how could one not pity them?\n\nThe words of the true immortals are unerring. I, burdened by lingering doubts and still entangled in confusion, now extract the core teachings from this revelation and inscribe them on my study walls, naming it the *Wondrous Explanations* (妙解录). I hope that when others read it, their perplexities will be dispelled, and though they may not yet attain the *Jīnyè* (金液) for preserving life, they will at least avoid the perils of poisonous elixirs that harm the body. This would be a blessing from Heaven itself.\n\nIf there are those who share my earnest intent, I earnestly hope they will delve into what remains unclear. Written on the eighteenth day of the fifth month, in the year *Dàzhōng Jiǔ* (大中九), *Yǐhài* (乙亥), on the day *Jiāzǐ* (甲子).\n\n---\n\n**Discerning Alchemical Elixirs and Remedies Against Toxicity**\n\nDuring the reign of Emperor *Āndì* (安帝) of the Han dynasty, there was a man named *Liú Hóng* (刘泓), who studied the ultimate Dao for many years and abandoned his official post to enter the mountains. Later, in the eleventh month of the *Yán Guāng* (延光) era, the *Nine Xīao* (九霄) Lord descended to instruct him. Moved by pity for the alchemists’ ignorance of the true methods of refining elixirs, the Lord pointed out the essential principles of the highest medicine, distinguished the various schools of alchemy, and explained the methods for neutralizing mineral toxins in *Bǎoxiān Wán* (保仙丸) formulas, passing them on to Hóng, who then recorded them for posterity.\n\nThe *Nine Xīao* (九霄) Lord said to *Liú Hóng* (刘泓):\n*\"Those who study the refinement of *Jīnyè* (金液) and *Huándān* (还丹), and who consume *Dānshā* (丹砂) and *liúhuáng* (硫黄), along with other minerals like *rǔshí* (乳石), strain to obtain them, believing that once acquired, they will have attained the supreme medicine. Yet they fail to grasp their depths and shallows, rushing to learn and ingest these elixirs, all in the hope of eternal life. They do not realize that *Jīndān* (金丹) and other mineral medicines each possess their own inherent nature, and that great toxicity lies concealed within them. Since the time of *Yáo* (羲) and *Xuān* (轩), those who consume them have not survived even one in ten thousand—there has never been one who did not perish.*\n\n*Hóng* (泓) bowed twice and kowtowed, asking: *\"Why is this so?\"*\n\nThe *Nine Xīao* (九霄) Lord replied:\n*\"Ordinary people refine *Jīndān* (金丹) and consume elixirs in pursuit of longevity. The foolish among them exert themselves to acquire them, while the common folk desire to use the supreme medicine to transmute gold and silver, enriching their lifeless bodies and nourishing their servants and concubines. But once they harbor such intentions, it is a sign they are doomed to die—this is the fundamental reason why the medicine fails to manifest its efficacy. Only the alchemical teachings of the immortals possess unparalleled efficacy and dual-purpose utility.*\n\n*Moreover, people do not know that these medicines contain profound toxicity. After refining *Jīndān* (金丹), they only recognize that *Yúgānzǐ* (余甘子) can produce the *Héchē* (河车), that magnetite can attract needles, and that *liúhuáng* (硫黄) can dry *shuǐyín* (水银), believing that once these processes are complete, the elixir is free of toxicity. However, when ancient sages refined *Qiūshí* (秋石), which forms from *dìshuāng* (地霜) and can draw out living mercury, it can also neutralize the toxicity of minerals and stones. Yet if there is any residual toxicity, it will erupt mid-process, unstoppable, leading inevitably to death. Even if they do not die, they will suffer from malignant sores—this is the initial omen. Though *Qiūshí* (秋石) is said to resolve toxicity, it is capable of subduing *Zhūshā* (朱砂), *Zǐfěn* (紫粉), *Dúshuāng* (毒霜), and *liúhuáng* (硫黄), how could it still be toxic? The teachings of the ancient sages are difficult for the world to comprehend. Only the true immortals understand them, while ordinary people do not.*\n\n*Hóng* (泓) asked again: *\"Why are medicines used for transmuting copper and iron unfit for consumption?\"*\n\nThe *Nine Xīao* (九霄) Lord said:\n*\"Because the methods for transmuting metals often employ *fánshí* (矾石), *xiāoshí* (硝石), and *páoshā* (炮砂) and their ilk, which combine to form toxicity. Though they can dry mercury and transmute copper and iron, the timing and application of fire differ from those used in *Jīndān* (金丹) refinement. Green toxicity (绿毒) remains embedded within them, and even if refined a thousand or ten thousand times, the poison will never be fully expelled. It is like a poison within a person’s heart, not entering from without, or like fire hidden within wood, its origin internal. The transmuted medicines inherently contain poison within their very nature. Each follows its own color and method, with *qi* (气) passing between them, yet all retain their toxic properties. The sulfurous, mercurial, and other mineral substances—whether *xiāo* (雄), *cī* (雌), or refined with *páo* (炮)—aid one another in their fiery transformations, disregarding the laws of Heaven and Earth. Thus, they either draw near or remain distant from the true toxic nature, for they do not conform to the Dao of Heaven. Therefore, it is clear that ancient immortals never consumed these medicines, as their transmutative power is insufficient to overcome the toxicity.*\n\n*Hóng* (泓) asked again: *\"If transmuted medicines contain various impurities and toxins, they are indeed unfit for consumption. I have also heard that *Huántóu Zǐfěn* (换头紫粉) and *Qīfǎn Dānshā* (七返丹砂), when refined with *yuánfán* (元矾) and subjected to *páo* (炮), can be consumed. Is this true?\"*\n\nThe *Nine Xīao* (九霄) Lord said:\n*\"These two medicines—even if one in a thousand or ten thousand understands them—are still unfit for consumption. Why? Even if they can be refined, *Huántóu Zǐfěn* (换头紫粉) is a substance cultivated by immortals for use in palaces. It contains *liúhuáng* (硫黄), and when *shuǐyín* (水银) enters *liúhuáng*, the toxicity is immense—how could it be consumed?*\n\n*As for *Qīfǎn Dānshā* (七返丹砂), though it is subjected to repeated refining to suppress its toxicity, it still retains the fundamental essences of the *Sìxiàng* (四象) and *Wǔxíng* (五行)—the sinews, bones, blood, and flesh, along with the incomplete balance of *yīn* (阴) and *yáng* (阳) and *hēi* (黑). If consumed, it will dry the five *zàng* (藏) organs. When ordinary people’s blood is diminished, they weaken; when it is exhausted, they die.\"*\"\n\n*Hóng* (泓) asked again: *\"In the world, some alchemists refine *Dānshā* (丹砂), and though its grains and lumps remain unbroken and its color unchanged, it does not move even when subjected to intense fire. How should this be understood?\"*\n\n九霄君 said: *\"All cinnabar, when it first congeals, forms within sand and stone. Even the purest *liúhuáng* (硫黄), when powdered, yields only twelve *liǎng* (两) of mercury per *jīn* (斤), while the remaining four *liǎng* are the dregs of mountains and marshes—these contain immense toxicity. If Daoists do not extract these dregs, and instead consume them together, it will obstruct the flow of *qi* in the meridians, dry the blood, and how could this bring benefit?\n\nFrom ancient times to now, Daoists unversed in the highest teachings of transcendence have claimed that cinnabar refined by *fǔhuǒ* (伏火) is 'dead' mercury, falsely stating that metallic cinnabar entering the five *zàng* (藏) organs ensures an immortal fate—this is greatly mistaken. Who in the world does not know that those who consume it raw invariably die? Only *liúhuáng* stands alone, unadulterated with other medicines, yet can still dispel lingering *jīlíng* (积玲). Even so, it must not be consumed in excess, for it is a solitary *yáng* (阳) and its *qi* is incomplete.\n\nOther minor medicines are beyond consideration here.\n\n*Hóng* (泓) asked again: *\"Which medicines can be safely consumed to prolong life?\"*\n\n九霄君 replied: *\"The true elixirs of our Daoist immortals are all forged from the *rúnhún* (日魂) of the sun and the *yuèpò* (月魄) of the moon, shaped by the four *qì* (气) of nature. The *rúnhún* never departs from its solar essence, nor does the *yuèpò* leave the moon. If even the elixirs are inseparable from their origin in wood, why so? Wood’s verdant hue contains mercury, which harbors its fiery *yáng* (阳) essence—this is the symbol of cinnabar. Cinnabar belongs to the *Lí* (离) element, the domain of southern fire. Fire resides in cinnabar, just as fire is inherent in wood, and when wood and fire are harmonized with central *tǔ* (土), earth can subdue water while fire nourishes earth, thus completing the Dao. It is akin to a newborn child growing into adulthood, then becoming a parent, passing on the cycle eternally—this is the very principle at work.\n\nThe essence of the elixir originates from one source, never two. The fundamental root of the Dao is the heart, while its vital function lies in the four seasons’ *qì* (气), each manifesting its own purpose. The Dao arises with *qi* and perishes with *qi*. Those who consume the true elixir without death are because it does not mix with other flavors, retaining its original purity. When melted into a liquid and formed into vessels—whether square or round—it radiates a brilliant clarity, luminous both day and night. Only then is it fit for consumption. It dispels lethargy, steadies the spirit, banishes malevolent influences, endures cold and heat, moistens the skin, prevents graying of the beard and hair, and reverses aging—its effects can be verified within a thousand days. Thus, those who consume it do not die.\n\n*Hóng* asked again: *\"How many kinds of true elixirs exist?\"*\n\n九霄君 answered: *\"There are three authentic paths: the first is the *Shénfú Shàngxiān Shàngdān* (神符上仙上丹), the second is the *Báixuě Zhōngxiān Shàngdān* (白雪中仙上丹), and the third is the *Jiǔzhuǎn Xiàxiān Shàngdān* (九转下仙上丹). These three elixirs share a single origin but bear different names, each possessing its own three *yī* (一) prohibitions, which must not be carelessly imparted to others. Why should they not be transmitted lightly?\n\nFor instance, the *Shénfú Dān* (神符丹)—if it is forged in the *Tàiyī Gōng Tiānyī Guān* (太一宫天一官) and completed in one cycle—is called *yè* (液), never taking solid form. The *Tiānyī Guān* (天一官) is its collective name, and these three prohibitions must not be revealed.\n\nThe *Báixuě Dān* (白雪丹), if it does not solidify into ice nor undergo *tiáoqīng* (调青), and fails to incorporate the black and green phases—its toxic essence remains distinct—is like the sun lacking its primordial *wū* (乌) or the moon lacking its *yuèpò* (月魄), thus incomplete. These three prohibitions must not be transmitted.\n\nIf *Báixuě* (白雪) does not solidify, and *tiáoqīng* (调青) is not like lodestone attracting needles, these three prohibitions must not be revealed.\n\nWhen *Báixuě* (白雪) and *tiáoqīng* (调青) are properly congealed, the elixir enters its *Zǐgōng* (紫宫) phase, while the green undergoes the four *qì* (气) to encompass all phenomena and complete its form—these three prohibitions must not be transmitted.\n\nIf the elixir does not absorb the *hùndùn* (混沌) *qì* (气) of the four seasons, how could it be called the *Lónghǔ Dān* (龙虎之丹)? Thus, the Daoist immortals forge celestial treasures from the profound transformations of heaven and earth, mirroring the radiance of the sun and moon. When the *Shénfú* (神符) and *Báixuě* (白雪) elixirs are perfected, there is a path to ascension. The *Jiǔzhuǎn* (九转) elixir restores youth, making one’s complexion like that of a child, and grants a lifespan as enduring as the southern mountains.\n\nThese three prohibitions’ secrets must not be lightly divulged—how could this not be fitting?\n\n*Hóng* asked again: *\"The three prohibitions are profound and secretive; who then may receive this teaching?\"*\n\n九霄君 replied: *\"Only one such as myself may impart it. These three prohibitions are the mechanisms of *Zàohuà* (造化), the creation and transformation of the universe. They are not unique to the elixir, for the human body also inherently possesses them. If one can cultivate the three prohibitions within their own body, then the child and parent will not be separated, and the spirit-*qi* will naturally protect itself, serene and harmonious, its light clear and bright. The child will not fail to see the sun’s radiant *yáng* (阳) or the moon’s luminous *yuèpò* (月魄). No winds or clouds will arise, no fine dust will move, and the azure sky will remain tranquil—how could there be any obstruction?\n\nHumans too possess this. If one can constantly harmonize the three prohibitions, all anxieties will vanish, and their inner and outer *qi* will merge with the pristine essence of the sky, becoming radiant and unobstructed—thus, they too may ascend.\n\nSome in the world may steal a glimpse of this teaching, claiming it is the practice of consuming *qì* (气)—nasal inhalation, oral exhalation, and swallowing by puffing the cheeks—but such methods will swiftly lead to their downfall. It is like mistakenly ingesting a poisonous elixir in the midst of medicines, beyond all remedy.\n\nThus, the three prohibitions within the body are no different from those of the true elixir. These prohibitions too must not be lightly transmitted.\n\n*Hóng* asked again: *\"If someone has already consumed cinnabar, *rǔshí* (乳石), *liúhuáng* (硫黄), or *zǐfěn* (紫粉), and the toxicity manifests, how may they be saved?\"*\n\n九霄君 answered: *\"For those already dead from consumption, there is no need to speak of salvation. For those who ingested them afterward, they may still be saved. Urgently instruct the Daoist to forge *Bǎoxiān Wán* (保仙丸) to rescue them, and their life may yet be preserved.\n\nFor instance, if one consumes *zǐfěn* (紫粉) from *huàntóu* (换头), since it does not enter the congealed *báixuě* (白雪) to form bones—which are *yáng* (阳)—and if *tiáoqīng* (调青) is later introduced, it becomes *dàdú zǐfěn* (大毒紫粉). No matter the quantity consumed, near or far, once ingested, it is like eating impure substances—poisoning will manifest, regardless of the time of day or night, and it will not fall under the scope of medical prescriptions. Within three to five days, the original medicine can still save them.\"*\n\nIf one has ingested sulfur, *zǐfěn* (紫粉), suppressed *fúhuǒ* (伏火) cinnabar, or other *rǔshí* (乳石) and the poison manifests, the *Bǎoxiān Wán* (保仙丸) may still rescue them—**up to twelve or thirteen breaths remain**.\n\nIf one has previously ingested the poisons of these stone medicines, even if they have not yet manifested, by taking precautions and preemptively consuming the *Bǎoxiān Wán*, the effect is even more wondrous.\n\n**Hóng** further asked: *\"The Three Great Elixirs (三大丹) extend and sustain life—yet if the original poison remains, can they still be taken?\"*\n\nThe **Jiǔxiāo Jun** (九霄君) replied: *\"The *Shénfú Báixuě Jiǔzhuǎn* (神符白雪九转) has not undergone the *Tàiyī Gōng Tiānyī Gōng* (太一宫天一宫) refining—its Four Symbols (四象) are incomplete, and thus it cannot be ingested.*\n\nIf someone is about to take it and suddenly feels agitation or unease, they should immediately consume *fúlóng gānzhī* (伏龙肝汁), along with *gāncǎo tāng* (甘草汤) and *shēngméng dòuzhī* (生蒙豆汁)—this will stabilize them. Though death may still occur in rare cases, why? Because these three medicines, along with other miscellaneous substances, contain only empty fire-toxicity (*huǒdú*), thus failing to reach the point of fatality.\n\nApart from these three, other cinnabar-based elixirs—even if consumed in haste over a single day or night—can still enhance one’s complexion. But if agitation suddenly arises, their life is then in grave peril.\"\n\n**Hóng** said: *\"May I hear the method for the *Bǎoxiān Wán*?\"*\n\nThe **Jiǔxiāo Jun** replied: *\"The *Bǎoxiān Wǔzǐ Wán* (保仙五子丸) is a secret method of the Daoists. Yet I shall entrust it to those of Dao—those who guard life. Now I shall instruct you in detail, along with a general outline of the Three Elixirs. You must ponder this deeply, transmit it to save those yet unaware, and never forget my words. I shall depart now.\"*\n\n**Hóng** then wept, knelt, and bowed twice in reverence. The **Jiǔxiāo Jun** raised his hand in farewell before ascending into the clouds and vanishing.\n\n**Liú Hóng** (刘泓) then carved the teachings onto stone in the mountains, and later, a Daoist discovered and transcribed them, allowing the method to spread throughout the world. During the **Tang Dynasty’s Kāiyuán era (开元)**, the **Tōngxuán Xiānsheng Zhāng Guǒ** (通玄先生张果) presented this formula to the emperor. The emperor rejoiced and kept it secret within the palace. **Tōngxuán** also elaborated extensively on the virtues of the Three Elixirs, though the methods for refining them are omitted here to avoid redundancy.\n\nThe **Yànmén Gōng** (雁门公) recorded and understood this fully.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "雁门公妙解录并序 经名：雁门合妙解录。 唐代着作。 一卷。 底本出处：《正统道藏》洞神部众街类。 雁门公妙解录并序 余少抱其疾，专意修养，至於金石服饵，亦尝勤求。 窃见今时好事者，不顾货财，大修炉火，谓河车立成，变土石为金丹，丹砂立化，可壮筋髓。 然而往往为药所俟，医救莫及，何哉。 岂根源不正欤，将师法不明欤，奚终不相副，如此之甚也。 余因览道书，偶见九霄君告刘泓丹药要诀，乃论俗徒都未窥至道毫末，而妄自夸街，诳诱时人，凡所施为，无非自戕之捷径，能无悲乎。 真仙之言，定不诬矣。 余以怀滞惑方困於是，今故诀其要语，书之座隅，目之曰《妙解录》。 冀观览之时，疑挠尽释，虽未达金液保身之卫，当必免毒丹伤命之虞，亦天年之幸也。 如有同我斯志者，固愿攻其未悟耳。 大中九年乙亥岁五月十八日甲子谨序。 辩金石药并去毒诀 汉安帝时有刘泓者，久学至道，弃官入山。 后至延光元年十一月，九霄君来降，为悯道士不知烧丹正道，乃指陈至药之根源，分别杂丹之门户，并解金石毒保仙丸方，传付於泓，疏之於后。 九霄君谓刘泓日：夫学炼金液还丹，并服丹砂硫黄，兼诸乳石等。 世人苦求得之，将谓便成至药，不知深浅，竞学服饵，皆望长生不死者也。 并不悟金丹并诸石药，各有本性，怀大毒在其中，道士服之，从羲轩以来万不存一，未有不死者矣。 泓再拜稽首，问日：何也。 九霄君曰：世人所造金丹服饵，皆求长生。 愚者即劫力以资，俗人又欲将至药，求其点化金银，荣其行尸，以养仆妾。 但一起心，即是必死之兆，至药亦元因而见也。 惟仙教药无双能，功无二用。 又不知药有至毒，造成丹后，世人只知余甘子制河车，磁石引针，硫黄乾水银，将谓制金丹了，便元毒矣。 假如先贤炼秋石，秋石以地霜结成，能引生汞，亦能制金石毒。 如有伏者，中路毒发，不可禁止，必见死矣。 纵不死，亦卒患恶疮，此为先兆也。 秋石云能解毒，且见朱砂、紫粉、毒霜并硫黄等，被秋石制伏，岂有毒矣。 先圣遗教，世人难知焉，知之者真人也，不知者凡人也。 泓又问日：变化铜铁之药，并不堪服、何也。 九霄君日：缘点化药法，多用矾石、硝石、炮砂之类，共结成毒。 虽能乾汞及化钢铁，其用火时候亦与金丹药不同，绿毒成结在其中，纵千消万化，毒终不出。 亦如人毒在心内，不从外入。 亦如木中有火，火元在内。 其点化之道，本毒在内，各受其性色目，法作不同，气递相生，各怀毒性，雄雌硝炮杂类，相助其火候，不依天时地理之法，或近或远毒者，盖不禀天道而成。 则知古往仙人不服此药，明矣。 绿有大毒，造化之力不足也。 泓又问日：点化之药，为有杂石众毒，固不堪服。 常闻换头紫粉，七返丹砂，元矾炮所杂，可以服否。 九霄君曰：此二药，世人千百中元一人解者。 纵能为之，亦不堪服，何也。 且换头紫粉，是仙人所修，以为宫室所用，绿有硫黄在其中，水银入硫黄含大毒，岂可服哉。 又七返丹砂，虽燠令伏火，本元四象五行，筋骨血肉，阴阳黑不全，如服之，令人五藏血乾。 凡人血少即羸，血尽即死矣。 泓又问日：世人修丹砂，颗块不破颜色如故，大火烧之不动者，复如何。",
      "translated_text": "**Preface to the *Wondrous Explanations of Yanmen Gong* and the *Wondrous Explanations* Itself**\n\n**Title:** *Wondrous Explanations of Yanmen Gong’s Alchemy* (雁门合妙解录).\nA work of the Tang dynasty. One scroll.\nSource: *Zhengtong Daozang* (正统道藏), under the *Dòngshén Bù* (洞神部) in the *Zhòngjiē Lèi* (众街类) category.\n\n---\n\n**Preface to the *Wondrous Explanations of Yanmen Gong* and the *Wondrous Explanations* Itself**\nIn my youth, I harbored illness and devoted myself entirely to cultivation and self-nurturing, even to the point of diligently seeking elixirs from minerals and stones.\n\nI have observed that in our present age, those who pursue alchemy do not spare wealth, laboring tirelessly over furnaces, claiming that the *Héchē* (河车) can be made to produce elixirs instantly, transforming soil and stone into *Jīndān* (金丹), and that *Dānshā* (丹砂) can be refined to strengthen sinews and marrow. Yet, time and again, they fall victim to the very medicines they seek, and physicians cannot save them. Why is this so?\n\nIs it because their foundational principles are flawed? Or because their methods and teachings are unclear? Why do their results never align with their expectations, and why does this occur so frequently?\n\nUpon examining Daoist texts, I chanced upon the *Nine Xīao* (九霄) Lord’s instructions to *Liú Hóng* (刘泓) regarding the essentials of elixir refinement. The Lord lamented that ordinary practitioners had yet to glimpse the slightest hint of the ultimate Dao, yet they presumptuously boasted of their proficiency, deceiving others. All their endeavors were merely swift paths to self-destruction—how could one not pity them?\n\nThe words of the true immortals are unerring. I, burdened by lingering doubts and still entangled in confusion, now extract the core teachings from this revelation and inscribe them on my study walls, naming it the *Wondrous Explanations* (妙解录). I hope that when others read it, their perplexities will be dispelled, and though they may not yet attain the *Jīnyè* (金液) for preserving life, they will at least avoid the perils of poisonous elixirs that harm the body. This would be a blessing from Heaven itself.\n\nIf there are those who share my earnest intent, I earnestly hope they will delve into what remains unclear. Written on the eighteenth day of the fifth month, in the year *Dàzhōng Jiǔ* (大中九), *Yǐhài* (乙亥), on the day *Jiāzǐ* (甲子).\n\n---\n\n**Discerning Alchemical Elixirs and Remedies Against Toxicity**\n\nDuring the reign of Emperor *Āndì* (安帝) of the Han dynasty, there was a man named *Liú Hóng* (刘泓), who studied the ultimate Dao for many years and abandoned his official post to enter the mountains. Later, in the eleventh month of the *Yán Guāng* (延光) era, the *Nine Xīao* (九霄) Lord descended to instruct him. Moved by pity for the alchemists’ ignorance of the true methods of refining elixirs, the Lord pointed out the essential principles of the highest medicine, distinguished the various schools of alchemy, and explained the methods for neutralizing mineral toxins in *Bǎoxiān Wán* (保仙丸) formulas, passing them on to Hóng, who then recorded them for posterity.\n\nThe *Nine Xīao* (九霄) Lord said to *Liú Hóng* (刘泓):\n*\"Those who study the refinement of *Jīnyè* (金液) and *Huándān* (还丹), and who consume *Dānshā* (丹砂) and *liúhuáng* (硫黄), along with other minerals like *rǔshí* (乳石), strain to obtain them, believing that once acquired, they will have attained the supreme medicine. Yet they fail to grasp their depths and shallows, rushing to learn and ingest these elixirs, all in the hope of eternal life. They do not realize that *Jīndān* (金丹) and other mineral medicines each possess their own inherent nature, and that great toxicity lies concealed within them. Since the time of *Yáo* (羲) and *Xuān* (轩), those who consume them have not survived even one in ten thousand—there has never been one who did not perish.*\n\n*Hóng* (泓) bowed twice and kowtowed, asking: *\"Why is this so?\"*\n\nThe *Nine Xīao* (九霄) Lord replied:\n*\"Ordinary people refine *Jīndān* (金丹) and consume elixirs in pursuit of longevity. The foolish among them exert themselves to acquire them, while the common folk desire to use the supreme medicine to transmute gold and silver, enriching their lifeless bodies and nourishing their servants and concubines. But once they harbor such intentions, it is a sign they are doomed to die—this is the fundamental reason why the medicine fails to manifest its efficacy. Only the alchemical teachings of the immortals possess unparalleled efficacy and dual-purpose utility.*\n\n*Moreover, people do not know that these medicines contain profound toxicity. After refining *Jīndān* (金丹), they only recognize that *Yúgānzǐ* (余甘子) can produce the *Héchē* (河车), that magnetite can attract needles, and that *liúhuáng* (硫黄) can dry *shuǐyín* (水银), believing that once these processes are complete, the elixir is free of toxicity. However, when ancient sages refined *Qiūshí* (秋石), which forms from *dìshuāng* (地霜) and can draw out living mercury, it can also neutralize the toxicity of minerals and stones. Yet if there is any residual toxicity, it will erupt mid-process, unstoppable, leading inevitably to death. Even if they do not die, they will suffer from malignant sores—this is the initial omen. Though *Qiūshí* (秋石) is said to resolve toxicity, it is capable of subduing *Zhūshā* (朱砂), *Zǐfěn* (紫粉), *Dúshuāng* (毒霜), and *liúhuáng* (硫黄), how could it still be toxic? The teachings of the ancient sages are difficult for the world to comprehend. Only the true immortals understand them, while ordinary people do not.*\n\n*Hóng* (泓) asked again: *\"Why are medicines used for transmuting copper and iron unfit for consumption?\"*\n\nThe *Nine Xīao* (九霄) Lord said:\n*\"Because the methods for transmuting metals often employ *fánshí* (矾石), *xiāoshí* (硝石), and *páoshā* (炮砂) and their ilk, which combine to form toxicity. Though they can dry mercury and transmute copper and iron, the timing and application of fire differ from those used in *Jīndān* (金丹) refinement. Green toxicity (绿毒) remains embedded within them, and even if refined a thousand or ten thousand times, the poison will never be fully expelled. It is like a poison within a person’s heart, not entering from without, or like fire hidden within wood, its origin internal. The transmuted medicines inherently contain poison within their very nature. Each follows its own color and method, with *qi* (气) passing between them, yet all retain their toxic properties. The sulfurous, mercurial, and other mineral substances—whether *xiāo* (雄), *cī* (雌), or refined with *páo* (炮)—aid one another in their fiery transformations, disregarding the laws of Heaven and Earth. Thus, they either draw near or remain distant from the true toxic nature, for they do not conform to the Dao of Heaven. Therefore, it is clear that ancient immortals never consumed these medicines, as their transmutative power is insufficient to overcome the toxicity.*\n\n*Hóng* (泓) asked again: *\"If transmuted medicines contain various impurities and toxins, they are indeed unfit for consumption. I have also heard that *Huántóu Zǐfěn* (换头紫粉) and *Qīfǎn Dānshā* (七返丹砂), when refined with *yuánfán* (元矾) and subjected to *páo* (炮), can be consumed. Is this true?\"*\n\nThe *Nine Xīao* (九霄) Lord said:\n*\"These two medicines—even if one in a thousand or ten thousand understands them—are still unfit for consumption. Why? Even if they can be refined, *Huántóu Zǐfěn* (换头紫粉) is a substance cultivated by immortals for use in palaces. It contains *liúhuáng* (硫黄), and when *shuǐyín* (水银) enters *liúhuáng*, the toxicity is immense—how could it be consumed?*\n\n*As for *Qīfǎn Dānshā* (七返丹砂), though it is subjected to repeated refining to suppress its toxicity, it still retains the fundamental essences of the *Sìxiàng* (四象) and *Wǔxíng* (五行)—the sinews, bones, blood, and flesh, along with the incomplete balance of *yīn* (阴) and *yáng* (阳) and *hēi* (黑). If consumed, it will dry the five *zàng* (藏) organs. When ordinary people’s blood is diminished, they weaken; when it is exhausted, they die.\"*\"\n\n*Hóng* (泓) asked again: *\"In the world, some alchemists refine *Dānshā* (丹砂), and though its grains and lumps remain unbroken and its color unchanged, it does not move even when subjected to intense fire. How should this be understood?\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1242,
      "start_sentence": 0,
      "end_sentence": 48,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 27.57635235786438,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\雁门公妙解录.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "九霄君日：凡朱砂凝结之初，皆於砂石中成质。 纵是光明砂，飞之，每一斤只得十二两汞，其四两即是山泽滓渍之物，怀其大毒。 道士若不解出滓，便相和服之者，则涩人气脉，乾人血液，岂得益乎。 瓦从古至今，道士未经至仙之教，皆谓伏火丹砂是死水银，妄言金砂入五内，有不死之兆，甚错矣。 世人岂不知从生服者，未有不死之人。 唯硫黄独体，不入他药，犹能去人积玲。 不可多服，绿是孤阳，气不全耳。 其他小卫，固所不论。 泓又问曰：何药则堪服，可以延驻。 九霄君曰：我仙人所炼至药，例是日魂月魄，四气为象。 日魂不离日裹，月魄不离月中。 假如至药，亦不离从木而生，何也。 木之从青，以水银内含其火。 火为阳，以象朱砂。 朱砂属离，离为南方火之位。 火为朱砂，亦同木中有火，配木火入中宫之土，土能克水，火能生土，而成道。 如人初生婴孩，乃长大，还为人父母，递换相承，本处其一。 至药根本，亦不处二。 道之元根，以心为根。 道之元用，以四时受气发生，各得其所为用。 道因气之生，因气而死。 至药服之不死者，盖为不参杂诸味，元毒。 销成汁为器，或方或圆，并皆赫然通彻，昼夜光明，然始堪服。 去人昏沉，定人神思，除邪魅，耐寒暑，皮肤润泽，髭鬓不白，返老成少，千日可验，故服之不死。 泓又问日：至药有几般。 九霄君日：真正之门有三焉，一曰神符上仙上丹，二日白雪中仙上丹，三曰九转下仙上丹。 其三般丹，同出一门而异名，各有三一禁法，亦不可轻传於人。 何谓不可轻传。 假如神符丹，若元太一宫天一官成者．即名曰液，终不见成器。 绿天一宫总名，其三一此不可传。 白雪若不坚不成冰，不入调青，不受青黑，共粉毒元别，亦如日元乌而不明，月元桂而元魄相似。 绿凝成坚冰，调青如磁石引针，其三一不可传。 曾青白雪成质，其三一不可传。 白雪成结，即入其紫宫用，绿以四气纳万象而成质，其三一不可传。 夫至药若不受四气混沌气，岂得号曰龙虎之丹。 所以我仙人天地之玄化成宝，同日月之光。 如神符白雪修炼功毕，即有上升之路。 九转即返老成少，颜如童子，寿同南山矣。 其三一之诀，不许轻传，岂不宜哉。 泓又问曰：三一旨玄矣秘矣，未知何人，即可传授。 九霄君曰：如吾者即可传授。 夫三一者，造化之机关也。 非独至药有之，人身中亦皆有之自备。 若能修身中三一者，即子母不相离，神气自相守，怡怡和煦，光照明白。 子不见至阳之月，，当昼之景乎。 风云不生，纤埃不动，碧空澄静，岂有障翳哉。 人亦有之。 若能常调三一，万虑不生，与碧空之气相合，内外光明，虚元同体者，亦可升腾矣。 世人或有窃闻此道者，云是服气，乃鼻吸口吐，鼓腮咽之，立可致其陨毙。 亦如药中错服毒丹，不可救已。 所以身中三一，与至药三一不殊。 其身中三一，亦不轻传也。 泓又问日：如有人先服丹砂及乳石、硫黄、紫粉毒发者，如何救解之。 九霄君日； 已服死者，即不言也。 如有已后服者，只可救之。 递相劝道士，急造保仙丸救之，可存性命。 假如换头紫粉，缘不入凝白雪为骨，骨为阳。 及元调青入者，即名大毒紫粉，人服不看多少远近，如吃杂物犯者，不问日月迟晚发，不在医限例，不出三日五日，元药可救之。",
      "translated_text": "九霄君 said: *\"All cinnabar, when it first congeals, forms within sand and stone. Even the purest *liúhuáng* (硫黄), when powdered, yields only twelve *liǎng* (两) of mercury per *jīn* (斤), while the remaining four *liǎng* are the dregs of mountains and marshes—these contain immense toxicity. If Daoists do not extract these dregs, and instead consume them together, it will obstruct the flow of *qi* in the meridians, dry the blood, and how could this bring benefit?\n\nFrom ancient times to now, Daoists unversed in the highest teachings of transcendence have claimed that cinnabar refined by *fǔhuǒ* (伏火) is 'dead' mercury, falsely stating that metallic cinnabar entering the five *zàng* (藏) organs ensures an immortal fate—this is greatly mistaken. Who in the world does not know that those who consume it raw invariably die? Only *liúhuáng* stands alone, unadulterated with other medicines, yet can still dispel lingering *jīlíng* (积玲). Even so, it must not be consumed in excess, for it is a solitary *yáng* (阳) and its *qi* is incomplete.\n\nOther minor medicines are beyond consideration here.\n\n*Hóng* (泓) asked again: *\"Which medicines can be safely consumed to prolong life?\"*\n\n九霄君 replied: *\"The true elixirs of our Daoist immortals are all forged from the *rúnhún* (日魂) of the sun and the *yuèpò* (月魄) of the moon, shaped by the four *qì* (气) of nature. The *rúnhún* never departs from its solar essence, nor does the *yuèpò* leave the moon. If even the elixirs are inseparable from their origin in wood, why so? Wood’s verdant hue contains mercury, which harbors its fiery *yáng* (阳) essence—this is the symbol of cinnabar. Cinnabar belongs to the *Lí* (离) element, the domain of southern fire. Fire resides in cinnabar, just as fire is inherent in wood, and when wood and fire are harmonized with central *tǔ* (土), earth can subdue water while fire nourishes earth, thus completing the Dao. It is akin to a newborn child growing into adulthood, then becoming a parent, passing on the cycle eternally—this is the very principle at work.\n\nThe essence of the elixir originates from one source, never two. The fundamental root of the Dao is the heart, while its vital function lies in the four seasons’ *qì* (气), each manifesting its own purpose. The Dao arises with *qi* and perishes with *qi*. Those who consume the true elixir without death are because it does not mix with other flavors, retaining its original purity. When melted into a liquid and formed into vessels—whether square or round—it radiates a brilliant clarity, luminous both day and night. Only then is it fit for consumption. It dispels lethargy, steadies the spirit, banishes malevolent influences, endures cold and heat, moistens the skin, prevents graying of the beard and hair, and reverses aging—its effects can be verified within a thousand days. Thus, those who consume it do not die.\n\n*Hóng* asked again: *\"How many kinds of true elixirs exist?\"*\n\n九霄君 answered: *\"There are three authentic paths: the first is the *Shénfú Shàngxiān Shàngdān* (神符上仙上丹), the second is the *Báixuě Zhōngxiān Shàngdān* (白雪中仙上丹), and the third is the *Jiǔzhuǎn Xiàxiān Shàngdān* (九转下仙上丹). These three elixirs share a single origin but bear different names, each possessing its own three *yī* (一) prohibitions, which must not be carelessly imparted to others. Why should they not be transmitted lightly?\n\nFor instance, the *Shénfú Dān* (神符丹)—if it is forged in the *Tàiyī Gōng Tiānyī Guān* (太一宫天一官) and completed in one cycle—is called *yè* (液), never taking solid form. The *Tiānyī Guān* (天一官) is its collective name, and these three prohibitions must not be revealed.\n\nThe *Báixuě Dān* (白雪丹), if it does not solidify into ice nor undergo *tiáoqīng* (调青), and fails to incorporate the black and green phases—its toxic essence remains distinct—is like the sun lacking its primordial *wū* (乌) or the moon lacking its *yuèpò* (月魄), thus incomplete. These three prohibitions must not be transmitted.\n\nIf *Báixuě* (白雪) does not solidify, and *tiáoqīng* (调青) is not like lodestone attracting needles, these three prohibitions must not be revealed.\n\nWhen *Báixuě* (白雪) and *tiáoqīng* (调青) are properly congealed, the elixir enters its *Zǐgōng* (紫宫) phase, while the green undergoes the four *qì* (气) to encompass all phenomena and complete its form—these three prohibitions must not be transmitted.\n\nIf the elixir does not absorb the *hùndùn* (混沌) *qì* (气) of the four seasons, how could it be called the *Lónghǔ Dān* (龙虎之丹)? Thus, the Daoist immortals forge celestial treasures from the profound transformations of heaven and earth, mirroring the radiance of the sun and moon. When the *Shénfú* (神符) and *Báixuě* (白雪) elixirs are perfected, there is a path to ascension. The *Jiǔzhuǎn* (九转) elixir restores youth, making one’s complexion like that of a child, and grants a lifespan as enduring as the southern mountains.\n\nThese three prohibitions’ secrets must not be lightly divulged—how could this not be fitting?\n\n*Hóng* asked again: *\"The three prohibitions are profound and secretive; who then may receive this teaching?\"*\n\n九霄君 replied: *\"Only one such as myself may impart it. These three prohibitions are the mechanisms of *Zàohuà* (造化), the creation and transformation of the universe. They are not unique to the elixir, for the human body also inherently possesses them. If one can cultivate the three prohibitions within their own body, then the child and parent will not be separated, and the spirit-*qi* will naturally protect itself, serene and harmonious, its light clear and bright. The child will not fail to see the sun’s radiant *yáng* (阳) or the moon’s luminous *yuèpò* (月魄). No winds or clouds will arise, no fine dust will move, and the azure sky will remain tranquil—how could there be any obstruction?\n\nHumans too possess this. If one can constantly harmonize the three prohibitions, all anxieties will vanish, and their inner and outer *qi* will merge with the pristine essence of the sky, becoming radiant and unobstructed—thus, they too may ascend.\n\nSome in the world may steal a glimpse of this teaching, claiming it is the practice of consuming *qì* (气)—nasal inhalation, oral exhalation, and swallowing by puffing the cheeks—but such methods will swiftly lead to their downfall. It is like mistakenly ingesting a poisonous elixir in the midst of medicines, beyond all remedy.\n\nThus, the three prohibitions within the body are no different from those of the true elixir. These prohibitions too must not be lightly transmitted.\n\n*Hóng* asked again: *\"If someone has already consumed cinnabar, *rǔshí* (乳石), *liúhuáng* (硫黄), or *zǐfěn* (紫粉), and the toxicity manifests, how may they be saved?\"*\n\n九霄君 answered: *\"For those already dead from consumption, there is no need to speak of salvation. For those who ingested them afterward, they may still be saved. Urgently instruct the Daoist to forge *Bǎoxiān Wán* (保仙丸) to rescue them, and their life may yet be preserved.\n\nFor instance, if one consumes *zǐfěn* (紫粉) from *huàntóu* (换头), since it does not enter the congealed *báixuě* (白雪) to form bones—which are *yáng* (阳)—and if *tiáoqīng* (调青) is later introduced, it becomes *dàdú zǐfěn* (大毒紫粉). No matter the quantity consumed, near or far, once ingested, it is like eating impure substances—poisoning will manifest, regardless of the time of day or night, and it will not fall under the scope of medical prescriptions. Within three to five days, the original medicine can still save them.\"*",
      "overlap_context": "行)—the sinews, bones, blood, and flesh, along with the incomplete balance of *yīn* (阴) and *yáng* (阳) and *hēi* (黑). If consumed, it will dry the five *zàng* (藏) organs. When ordinary people’s blood is diminished, they weaken; when it is exhausted, they die.\"*\"\n\n*Hóng* (泓) asked again: *\"In the world, some alchemists refine *Dānshā* (丹砂), and though its grains and lumps remain unbroken and its color unchanged, it does not move even when subjected to intense fire. How should this be understood?\"*",
      "start_char": 1242,
      "end_char": 2488,
      "start_sentence": 49,
      "end_sentence": 107,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 24.48021173477173,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\雁门公妙解录.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "如服硫黄、紫粉、伏火丹砂及诸乳石，若毒发，保仙丸犹可、救i 丈之，十有二三命在。 若曾服诸石药之毒，虽未发，能防备，预服保仙丸，尤妙。 泓又问曰：三大丹既延驻人命，元毒，如未毕功，可以服否。 九霄君日：神符白雪九转＇，未经太一宫天一宫者，四象未全，不可服。 如有人俟服者，忽觉发动不安，但急服伏龙肝汁，并甘草汤、生蒙豆汁，乃立定，少见命终，何也。 绿此三药并元杂类相挠，只空有火毒，遂不至於死。 除此三般，其余丹砂之流，虽然一朝一夕强餐，亦能益色。 如忽发动，命即危矣。 泓曰：保仙丸法可得闻乎。 九霄君日：保仙五子丸，此法仙家所秘。 然亦令择有道之士以授之，护其性命。 今一一教尔，并粗举三丹大略。 尔宜熟思之，流传以救未悟者。 无忘吾言，吾将往矣。 泓乃雨泪稽显再拜，九霄君举手告别，入云不见矣。 刘泓乃於山中刻石书记，后有道士见之录出，遂流传於世。 至唐开元中通玄先生张果，献上此方。 明皇喜悦，秘於禁中。 通玄兼述三丹之功极备，但元修丹之法，今不书去繁也。 雁门公妙解录竟",
      "translated_text": "If one has ingested sulfur, *zǐfěn* (紫粉), suppressed *fúhuǒ* (伏火) cinnabar, or other *rǔshí* (乳石) and the poison manifests, the *Bǎoxiān Wán* (保仙丸) may still rescue them—**up to twelve or thirteen breaths remain**.\n\nIf one has previously ingested the poisons of these stone medicines, even if they have not yet manifested, by taking precautions and preemptively consuming the *Bǎoxiān Wán*, the effect is even more wondrous.\n\n**Hóng** further asked: *\"The Three Great Elixirs (三大丹) extend and sustain life—yet if the original poison remains, can they still be taken?\"*\n\nThe **Jiǔxiāo Jun** (九霄君) replied: *\"The *Shénfú Báixuě Jiǔzhuǎn* (神符白雪九转) has not undergone the *Tàiyī Gōng Tiānyī Gōng* (太一宫天一宫) refining—its Four Symbols (四象) are incomplete, and thus it cannot be ingested.*\n\nIf someone is about to take it and suddenly feels agitation or unease, they should immediately consume *fúlóng gānzhī* (伏龙肝汁), along with *gāncǎo tāng* (甘草汤) and *shēngméng dòuzhī* (生蒙豆汁)—this will stabilize them. Though death may still occur in rare cases, why? Because these three medicines, along with other miscellaneous substances, contain only empty fire-toxicity (*huǒdú*), thus failing to reach the point of fatality.\n\nApart from these three, other cinnabar-based elixirs—even if consumed in haste over a single day or night—can still enhance one’s complexion. But if agitation suddenly arises, their life is then in grave peril.\"\n\n**Hóng** said: *\"May I hear the method for the *Bǎoxiān Wán*?\"*\n\nThe **Jiǔxiāo Jun** replied: *\"The *Bǎoxiān Wǔzǐ Wán* (保仙五子丸) is a secret method of the Daoists. Yet I shall entrust it to those of Dao—those who guard life. Now I shall instruct you in detail, along with a general outline of the Three Elixirs. You must ponder this deeply, transmit it to save those yet unaware, and never forget my words. I shall depart now.\"*\n\n**Hóng** then wept, knelt, and bowed twice in reverence. The **Jiǔxiāo Jun** raised his hand in farewell before ascending into the clouds and vanishing.\n\n**Liú Hóng** (刘泓) then carved the teachings onto stone in the mountains, and later, a Daoist discovered and transcribed them, allowing the method to spread throughout the world. During the **Tang Dynasty’s Kāiyuán era (开元)**, the **Tōngxuán Xiānsheng Zhāng Guǒ** (通玄先生张果) presented this formula to the emperor. The emperor rejoiced and kept it secret within the palace. **Tōngxuán** also elaborated extensively on the virtues of the Three Elixirs, though the methods for refining them are omitted here to avoid redundancy.\n\nThe **Yànmén Gōng** (雁门公) recorded and understood this fully.",
      "overlap_context": "nsumes *zǐfěn* (紫粉) from *huàntóu* (换头), since it does not enter the congealed *báixuě* (白雪) to form bones—which are *yáng* (阳)—and if *tiáoqīng* (调青) is later introduced, it becomes *dàdú zǐfěn* (大毒紫粉). No matter the quantity consumed, near or far, once ingested, it is like eating impure substances—poisoning will manifest, regardless of the time of day or night, and it will not fall under the scope of medical prescriptions. Within three to five days, the original medicine can still save them.\"*",
      "start_char": 2488,
      "end_char": 2922,
      "start_sentence": 108,
      "end_sentence": 127,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 7.448492527008057,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\雁门公妙解录.txt",
        "category": "众术类"
      }
    }
  ]
}