{
  "source_id": "青华秘文",
  "source_file": "chunked_daozang\\青华秘文.json",
  "total_chunks": 29,
  "total_original_chars": 18534,
  "total_translated_chars": 98122,
  "total_translation_time": 307.03032207489014,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\藏外\\青华秘文.txt",
    "category": "藏外"
  },
  "full_translation": "**Translation:**\n\n*\"Preface to the Secret Texts of Qinghua*\n\nFar Master Zhengbang Shū, I know not whence he came. At nineteen years of age, he served as a disciple under the Purple Sage Master. For nine years, he neither comprehended the natural Dao nor sought inquiry. One day, as he attended his teacher at the Luofu Monastery, the Sage said:\n\n‘Thy following of me shall not endure long. Though thou dost not regard the secrets of the Golden Elixir, nor inquire into them, yet why dost thou follow me?’\n\nZhengbang Shū bowed twice in reply, saying: ‘’Tis not that I disregard the world, but in self-assessment, I find my grasp of the profound mysteries lacking—thus, I possess no such merit.’\n\nThe Sage then spoke: ‘’Tis well! Since the division of the Great Ultimate, a single point of luminous essence exists in all. The virtuous gain no more, the foolish lose no less. Thy words suggest thou dost veil thine own brightness. Alas! ’Tis pitiable indeed!’\n\nZhengbang Shū, overcome, wept with tears and saliva streaming, prostrated himself a hundred times, and could not rise from his sorrow.\n\nThe Sage said: ‘Depart to the quiet chamber and ponder my words. If thou dost gain any insight, come swiftly.’\n\nZhengbang Shū bowed and took leave, then sought the secluded, silent chamber to reflect in solitude. That night, the Purple Sage Master again came to his chamber, where he sat, and knocked upon the door.\n\nZhengbang Shū heard the sound and, rising, went forth to greet him. The Sage smiled faintly and said:\n\n‘I sought thee once, and thy head and eyes were revealed. Yet thou hast sought him these two days, and dost not perceive his true nature.’\n\nThereupon, he extinguished the candle he held and withdrew.\"\n\n「邦叔深感困惑，坐至五更时分，顿悟豁然，全身汗流如雨。\n\n待至天明，他以颂歌呈献先生：\n*\"月照长江风浪息，鱼龙遁迹水太平。\n个中谁唱真仙子，声满座空万籁清.\"*\n\n先生观毕，问曰：\"谁唱*难听*？\"\n都叔遂以诗答曰：\n*\"莫问谁，莫问谁。\n一聲高，一聲低。\n阿誰唱，阿誰听。\n横竖大千*说不尽*。\n先生有意度迷徒，急撞灵台安宝镜。\n镜明澄静万缘空，百万丝条处处通。\n斗转星移人睡定，觉来红日正当中.\"*\n\n先生遂取出*金丹图*，传授与邦叔，都叔乃停止罗浮山修行，后十三年*坐化*而去。\n\n又十年，眉山大伪和尚沈志静遭遇封山禁令，自称王邦叔，今居蓬莱望海楼也。\n\n表奏不避雷钺之诛，辄伸卑渎念。」\n\nThe subject, in this world, has ever been burdened by excessive thought, yet achieves nothing—when he acts, he stumbles. At thirty years of age, he alone encountered the Dao/Way.\n\nReflecting upon the boundless heavens, what once hindered my fulfillment was precisely the blessing that now grants it. Gratitude weighs heavily, etched upon the heart, now vividly perceived.\n\nO noble commoners, who lacks the vessel of the Dao/Way? In toil through dusty realms, they ravage the One Primordial. The lower they descend, the more they abandon humanity for things. Seeking things yet longing for humanity, they cannot return—it is beyond reach.\n\nThings cannot be cultivated; in the end, they become alien to their kind. Alas!\n\nMy own body I cannot even measure, yet I pity this state—how different am I from the frog in the mud, laughing at the hen in the cage?\n\nOnly yesterday, I received from Qinghua Zhenren the *Yuqing Jinxi Longsheng Dushijinbao Neilian Dandie*—concise yet practical, detailed yet uncluttered. Within the body, the Master of Yin-Yang is enfolded; in the vessel, the Axle of the Four Symbols stands firm. Ever guard the Three Centers as the mechanism; steadfast, unyielding, yet ever in motion.\n\n「Within the use, there is non-use; within stillness, the constant presence.\nThe sagely and virtuous scholar, with one glance, sees all without remainder—creation and transformation lie within his grasp.\n\nNow, I wish to fast and purify my thoughts, earnestly pondering to compose diagrams and treatises.\nNot a hair shall be concealed; I will reveal the deepest secrets of the utmost truth.\nSelecting what may be transmitted, I pass it on, hoping to inherit the heart-lamp of the Dao/Way and let its light flow through the ten thousand ages—truly a noble deed!\n\nYet at the outset of transmission, the oaths were most stern.\nMy teacher charged me with utmost gravity: \"Lightly reveal, and you shall incur punishment.\"\nI have often desired to act but hesitated, lest I forget the warning.\n\nI humbly beseech the Celestial Sovereign’s compassion for life, for saving beings is His greatest virtue.\nThus, I kneel in dust, my heart ascending to the highest realm.\nI pray for Heaven’s grace to discern my sincerity, lest my actions be exposed as dark and obscure.\n\nIf Heaven deigns to pardon and grant me peace,\nthen perhaps I dare to fulfill this promise and once more lay my words before the Celestial Throne:\nWith deepest reverence and trembling, I kneel and pay homage, my gratitude boundless.\nRecently, I petitioned the Heavenly Court, intending to depict the secret precepts of Qinghua Zhenren’s *Yuqing Jinxi Longsheng Dushijinbao Neilian Dandie*—the *Dao/Way of Internal Alchemy for Nurturing Life and Transcending the World*—and establish their principles for those with affinity.\n\nProstrate before my humble dwelling, I await Heaven’s judgment in fear.\nMore than three decades have passed since then.\nNow, as no retribution has come, I venture to fast, burn incense, and focus my mind to set these words in order.»\n\n*«In three days, I concealed the teachings within the sacred Daoist repository, awaiting the worthy.\n\nWith utmost reverence, I record and submit this to the Celestial Throne, humbly hoping that Heaven’s mercy may descend and pardon me, and that all may follow these precepts to refine the *golden treasure* (金宝) and transcend the dusty realm (尘埃).\n\nPassing them down through generations, I dare not let them be revealed or belittled.\n\nWith deepest sincerity and trembling fear, I kneel and pay homage, my gratitude boundless, to lay this before the Throne.\n\n**Prelude to the Golden Treasure Diagram and Treatise (金丹图论序):**\nSince I first came to know the secret precepts of the *Golden Treasure* (金丹), I have repeatedly incurred Heaven’s wrath yet failed to repent.\n\nMoreover, I have allowed the *Mysterious Scriptures* (玄书)—including the *Awakening to the True* (悟真篇)—to circulate in the world, for my own heart has deemed them supreme.\n\nSuddenly, a visitor arrived to call upon me. I marveled at his extraordinary bearing, and in solemn stillness, I received him.\n\nHe inquired: “Master, your instruction in the Dao/Way of the Golden Treasure (金丹之道) is indeed profound. Yet its beginning and end remain unclear, and its subtleties still concealed—how shall later disciples recognize its essence?”\n\nI replied: “I too am compelled by necessity! Heaven’s mysteries are most weighty, its sacred laws most strict. You speak well—how dare I not comply with your words?”»\n\nThe guest said: *“You need only commit this to writing, fully revealing its depths. Should there be censure, I shall bear the blame.”*\n\nI bowed twice in reverence and respect, then lost track of his whereabouts.\n\nReflecting on his words, I thus wrote this book. The Dao’s mysteries, once revealed, are revealed! Those who pass it on must receive it as a supreme treasure, for it holds the sacred laws. To leak or neglect it invites the hell of retribution, dooming seven generations of ancestors.\n\n**On the Heart**\nThe heart is the dwelling of the spirit.\nThe heart is the principle of all subtleties, governing all things.\nNature resides within it; life depends upon it.\nFor those who seek the Dao, one must first grasp this single character—all else follows thereafter.\nThus, I transmit it.\n\nZhang, the Wild Man, clad in patched robes,\nReturned from Chengdu to his mountain home,\nBuilding his dwelling amid green hills and flowing waters.\nAll things exhausted, yet he remained serene, as if in possession.\nNews spread through the marketplace:\n*“Zhang Ping-shu, once exiled, has returned to the mountains.”*\nDisciples flocked to him in crowds.\n\nA disciple stood in the courtyard, weeping and bowing:\n*\"Master, are you truly unharmed?*\n*For ten years now, I have traversed mountains and rivers, crossed perils and obstacles—*\n*Yet my face shows no decay, my form no weariness. Is this some art?\"*\n\nZhang replied:\n*\"Ah! Let me speak to you.*\n*What makes men wither and decay?*\n*The heart. A hundred affairs converge upon it; one thought fades, another takes its place.*\n*All day long, there is no respite.*\n*Even in sleep, it seems as if the heart rests—but the spirit is gone.*\n*I have no other art; only this: to still the heart.*\n*Thus, what spirits and ghosts measure is but the heart’s thoughts.*\n*When the heart has no thoughts, the spirit’s clarity cannot be known.*\n*Is it that the spirit does not know the heart?*\n*Or that I myself do not know what the heart is?*\n*This is the root of stillness.\"*\n\nThe disciple asked:\n*\"Then do alchemists of the Golden Elixir—*\n*must they still the heart?*\n*Or not still the heart?\"*\n\nZhang said:\n*\"The word ‘stillness’—if one can truly still it, then the Golden Elixir may be attained while seated.*\n*But it is difficult!\"*\n\nThe disciple said:\n*\"Your words will mislead many who follow later!\"*\n\nThe disciple Zhang rose and asked for his meaning, saying:\n\n*\"Master, when you speak of the Dao of the Golden Elixir to others,\nit often makes their hearts restless with intent.\nFor the heart is the sovereign of transformation*—\n*how could it ever be still?\"*\n\nZhang replied:\n*\"You see only one side, not my words’ true intent.\nExamine your daily thoughts—\nwhat causes them to stir?\nWhen they rest unmoving, yet respond and flow in harmony,\nthat is the heart’s true function.\nYour thoughts race to the ends of the earth,\nwith no place to settle—\nthat is your heart’s habit.\n\n\"The North Star (Pole Star) never moves in truth.\nWhat seems to move is the encircling stars about it.\nYet those encircling stars cannot but move,\nfor the Pole Star is their pivot, turning them.\n\n\"Only within stillness does movement arise—\nthat is the alchemist’s heart.\nOnly within movement does stillness dwell—\nthat is the benevolent sage’s heart.\nTo remain forever still within stillness\nis the nature of earth and wood.\n\n\"The heart dwells within,\nwhile the two eyes, the two kidneys, and the three orifices* belong to it—\nyet none can fully exhaust its wondrous function.\nWhen the wondrous function manifests,\nit is because the spirit obeys its commands,\nthe qi submits to its openings,\nand the essence follows its summons.\nWhen the spirit obeys its commands,\nthe heart must not stray outward,\nso the spirit returns and hides within.\nWhen the qi submits to its openings,\nthe heart’s harmony brings the qi’s harmony,\nthe qi’s harmony brings the body’s harmony,\nand the body’s harmony mirrors the harmony of heaven and earth.\nThus, those who indulge in extreme joy and anger,\nwhose qi runs counter—\njoy and anger spring from the heart.\nWhen the essence follows its summons,\nas when a man and woman unite in form and the essence surges,\nthat too is the heart’s doing.\nThe heart is clear, then the thoughts are clear;\nthe thoughts are clear, then the essence ceases.\nAh!\nOnly when the heart is still does it not stray outward;\nonly when the heart is still does it find harmony;\nonly when the heart is still does it become clear.\nIn one word: **stillness**—\nthen essence, qi, and spirit may be used as they should.\n\n\"Essence is essence, qi is qi,\nand spirit may be called the foundation of nature*.\nWhy speak of it as a foundation?\nFor when the heart is still, the spirit is complete,\nand when the spirit is complete, nature* reveals itself.\nIn one word again: **stillness**.\n\n\"But how does one attain stillness?\nConsider water flowing with the boat—\nswift and surging, boundless.\nTo reach distant islands, one must labor daily.\nYet when one suddenly turns homeward,\nthinking of peace and quiet in the village,\nthe sail is quickly raised,\nthe people hasten to return.\nHome is the true path of stillness,\nbut after long neglect, how can it be regained?\nAfter long loss, how can it be found?\nWhere is the great Dao now?\nWild grass grows unchecked, thorns pile high.\nThe heart cannot be still—\nis it truly the heart?\nFor the spirit enslaves the heart,\nand the heart enslaves the spirit.\nThe two enslave each other,\nand then the desires arise.\nTo seek stillness, one must first master them.\nThe eyes are the dwelling of the spirit’s roaming*.\nWhen the spirit roams in the eyes,\nit is enslaved by the heart.\nThus, restrain it in the eyes\nand guide it back to the heart,\nthen the heart will be still and the spirit too.\nDo not let the eyes wander recklessly,\nthen the spirit returns to the heart.\nThe spirit returning to the heart—\nthat is the root of stillness.\"*\n\n**On the Spirit as Sovereign:**\n*\"The heart as ruler*—\nlike a sovereign on the throne.\nOne man’s joy brings relief to all the people.\nIf the Qin Emperor or Han Wu rule this way,\nthe four seas become a wasteland.\nIf Yao, Shun, Yu, or Tang rule this way,\nthe world finds peace and ease,\nthe people sing of great harmony.\nWhy?\nThe sage rules with *wuwei* (non-action),\nand the world is tranquil and reverent.\nThe mediocre ruler acts with *youwei* (action),\nand the world is in chaos.\nThe heart is the ruler’s throne—\nwhen governed with non-action,\nwhat moves it is the original spirit’s nature*.\nWhen ruled with action,\nwhat moves it is the desires’ nature.\nAction is the heart of daily life;\nnon-action is the heart of Golden Elixir practice.\nTo turn from action to non-action,\nthen govern affairs with non-action—\nthat is the Golden Elixir’s gateway.\n\n\"For the spirit has two forms:\nthe original spirit and the spirit of desire.\"\n\nThe Original Spirit is the innate luminous spark from before heaven and earth were formed. The Spirit of Desire is the nature of the vital *qi* and physical constitution.\n\nThe Original Spirit is the nature of the primordial heaven and earth. Only after the body comes into being does the nature of the vital *qi* and constitution manifest. If one turns back to it skillfully, then the nature of heaven and earth is preserved. If one indulges in the nature of the vital *qi* and constitution, then it obscures the Original Spirit, like clouds covering the moon. Though the nature of the vital *qi* and constitution may be settled, the Original Spirit itself remains ever-present. Yet, when the Original Spirit is faint and the vital *qi* and constitution prevail, it is like a ruler’s ignorance while petty officials govern, thereby harming the state.\n\nMoreover, when parents conceive the form, the vital *qi* and constitution are already complete within me. At the moment of birth, the Original Spirit first enters. Parents nurture my body with affection, so the nature of the vital *qi* and constitution always exceeds the Original Spirit, giving rise to desires.\n\nNow, I gradually eliminate these desires. When the vital *qi* and constitution are exhausted, the Original Spirit alone becomes visible. Once the Original Spirit is revealed, then one can govern affairs. There is no other way: the common people’s daily lives are dominated by the nature of the vital *qi* and constitution, which overpowers the Original Spirit. If one turns back skillfully, then the Original Spirit’s nature overpowers the vital *qi* and constitution. Using the nature of the vital *qi* and constitution, one relies on the *qi* of later heaven and earth. Using the Original Spirit’s nature, one relies on the *qi* of heaven and earth before their formation. The nature of the vital *qi* and constitution is inherently subtle, but from birth onward, it grows ever stronger. Thus, daily affairs are always carried out by the vital *qi* and constitution. Once one turns back to the Original Spirit, from that moment onward, the *qi* of heaven and earth before their formation becomes pure and ripe. The sun and moon move ceaselessly—nothing but the Original Spirit itself.\n\nThis is the attainment of heaven and earth before their formation controlling those after, and using it for governance.\n\n*(As seen in the \"Hall of the Spirit\" Diagram, discussed later)*\nThe *qi* is spoken of in terms of its function.\nThe *qi* of heaven and earth before their formation, the *qi* of heaven and earth after their formation—those who attain it are like the intoxicated or the drunk, forgetting sleep and losing rest. Ah! When the Original Spirit is revealed, the Original *qi* is generated. For once the Great Ultimate is divided, one receives this single point of luminous spark, which is the Original Spirit. What does the Original Spirit consist of? It is the *qi* condensed and the essence refined. Thus, when the Original Spirit is restored, the Original *qi* is generated, following the principle of mutual resonance. When the Original *qi* is generated, it circulates throughout the body, but why is it specifically gathered and utilized in the kidney palace? The kidney palace’s pathways directly reach the *qi* cavity of the Yellow Court—one reason. The kidneys are the palace of essence; when essence is refined, it draws the essence’s essence upward for use—second reason. When it circulates elsewhere, it is hard to find, but in the kidney palace, it can be recognized—third reason. When the heart’s *qi* penetrates the kidneys and the intention descends, it reaches the Original *qi* easily, making it effortless to gather—fourth reason. These four aspects explain why the Original Yang is gathered in the kidney palace.\n\nSpeaking of essence from the perspective of *qi*:\nThe Spirit has the Original Spirit, the *qi* has the Original *qi*—is there any essence without the Original essence? Essence depends on *qi* for its formation. Essence is solidified in the kidney palace, while *qi* permeates it; thus, it follows the *qi* upward to become refined, and this is the way.\n\nWhen essence is lost, the Original *qi* does not arise, and the Original Yang is not seen—what benefit is there to me? When the Original Spirit is revealed, the Original *qi* is generated, and when the Original *qi* is generated, the Original essence is produced.\n\nSpeaking of intention as a medium:\nIs intention merely a medium? In the Dao of Golden Elixir, from beginning to end, its function cannot be separated. Intention arises from the heart. Yet, if the heart does not wander with intention, it is fine; if the heart wanders with intention, it is not.\n\nSpeaking of the *Kan* and *Li*:\nThe *Kan* is the kidney palace. The *Li* is the heart field.\n*Kan* is still and belongs to water, thus it is *yin* (～).\n*Li* is dynamic and belongs to fire, thus it is *yang* (～).\nWhen *Li* is dynamic, it is fire—thus it is *yang* (～).\nWhen *Kan* is still, it is water—thus it is *yin* (～).\nAt the moment of interaction, when the heart field is still and the kidney palace is dynamic, is it not the Original Yang below and the Original *Yin* above? Moreover, since intention arises from the heart and descends directly to the kidney palace, and since Yang is generated from the kidneys and ascends directly to the Yellow Court? Therefore, it is said: *Kan* and *Li* are inverted. If they are not inverted and proceed in their natural order, then the heart’s fire is dynamic and not still, and the meaning of the great earth fire pit becomes clear.\n\n**The Initial Practice:**\nFirst, one must hold the *Heart* in stillness, then later practice the *Lower Hand* technique.\nInitially, one seeks to still the heart, but desires have not yet ceased. Desires are the nature of the vital *qi* and constitution. This nature enslaves the Original Spirit, constantly pressing upon the ears, then the eyes. The practitioner of Golden Elixir, once the heart is free of distractions, will have no means to enslave it. The reason it enslaves the Spirit is that external things lure it.\n\nDuring the still-sitting practice, first employ the method of closing and restraining the breath. Closing the breath means that when a breath has not yet ended, another breath follows. Now, when a breath arises, one restrains the next breath. The next breath, being restrained, is drawn in slowly, and over time, the breath becomes steady. Restraining the breath a thousand or ten thousand times must not disturb the heart, for if the heart is disturbed, it will chase after the breath, and the breath will not yet have stopped while the heart has already moved.\n\nAs he was speaking, a man laughed from beside him, saying:\n\"Foolish! This old man teaches people without method. Restraining the breath while also not disturbing the heart—is it not like burdening a man with a thousand *jun* weight, forcing him to exert no effort? How can that be?\"\n\nHe replied:\n\"Wait and listen. Though I restrain the breath, I also preserve the heart, so the heart does not move, and the breath is still.\"\n\nAgain, the man said:\n\"This is indeed the method of restraining the breath, but how can one ensure desires do not arise?\"\n\nHe replied:\n\"When desires arise, it is already too late. The birth of desires is due to their response to external things. In the state of stillness, if the eyes perceive something, the Spirit is enslaved by the eyes—quickly withdraw and return inward. If the ears hear something, the Spirit is enslaved by the ears—quickly withdraw and return inward. It is the same with all others.\"\n\nThe questioner said: *\"I have heard that 'One as Two'—I know this principle already. Though I withdraw the Spirit, I also preserve the heart, so the Spirit is withdrawn while the heart remains fundamentally still.\"*\n\nHe replied: *\"Preserving the heart is indeed cultivating the nature. When the nature first appears, if one does not preserve the heart, there will be nothing to cultivate. Without cultivation, it will never be seen. To preserve the heart truly begins with withdrawing the heart. What is called withdrawing the Spirit is, in fact, withdrawing the heart and then using the senses. When practiced for a long time, seeing becomes like not seeing, hearing like not hearing—form and heart are forgotten, aligning with the Dao. Then, the original nature shines forth, and the original *qi* is born.\"*\n\n**Spirit and Nature Theory**\nThe Spirit is the original nature. My earlier discussion on the Spirit as the primary principle has also been exhausted.\n\nNow, let us consider those who practice alchemy: many are confused by the method of *concentrating the Spirit*. Concentrating the Spirit is not about speed, so I further expound upon it. Later, I will draw the diagrams of the *inner chambers* and elaborate further.\n\nTo concentrate means to gather the Spirit within the *essence-qi*. Essence and *qi* are inherently interdependent, while the Spirit clings to them. Now, we focus solely on the Spirit—why?\n\nThe Spirit is the master of essence and *qi*. Alchemists unite and harvest, and when they reach the stage of *firing*, they use nothing but the Spirit to govern essence and *qi*. If one first concentrates the Spirit within the *qi*, the *qi* cannot settle, and the Spirit will not willingly cling to the *qi*—instead, it harms the medicinal substance.\n\nMoreover, the Spirit is the original nature. The nature is still in search, not yet fixed—flickering and drifting, advancing and retreating, existing and perishing. How can you force it to concentrate? What you truly concentrate is the inherent nature of essence and *qi*.\n\nInitially, one seeks the original nature through the nature of essence and *qi*—this is to chase the original nature with the nature of essence and *qi*, is it not?\n\nNow, many students are misled by concentrating the Spirit—why?\n\nBecause there is a saying among Daoists and immortals that one should first concentrate the Spirit. Thus, they mistakenly cite it to blind others. Do they know that what they call concentrating the Spirit is, in fact, the method of *restraining the mind* and returning the Spirit to the heart? When the Spirit returns to the heart, the full nature appears. Once the full nature is seen and applied, it is nothing but the Spirit in action. Thoughts never leave the Golden Elixir, so when the elixir is formed, the Spirit naturally returns to it—what need is there for concentration?\n\nThus, it is said: concentrating the Spirit is the Spirit merging with essence and *qi*. Essence, *qi*, and Spirit unite as one, and the *yang* Spirit is born. At this juncture, this body is now nothing but a useless vessel.\n\nWho says otherwise? I have heard this from the *Master of the Degree* (度师), the *Master of the Degree* heard it from the *Distant Master* (远师), and the *Distant Master* heard it from Heaven.\n\n**The Illusion of the Elixir**\nThe illusion of the elixir arises when one has not yet cultivated the stillness of the heart-field, yet hastily harvests a single *yang* essence. At this time, the *yang* essence shines forth, but it is not true *yang*. The *qi* is not original *qi*—it is merely the breath of inhalation and exhalation. The essence is not original essence—it is the turbid, impure essence. The Spirit is not original Spirit—it is the thought of emotional desires.\n\nA man who has just begun studying the Dao yet seeks immortality—is this not the rise of desires? Using desires to unite and harvest *yang* essence—this is how the illusion of the elixir arises.\n\nThe essence resides in the kidney palace, yet it is as if one harvests and ascends it to the navel. There is no stable resting place, so it follows the *qi* and settles in the right of the *qi* cavity. The navel is born from the kidney’s threads, where it intertwines with the *qi* and halts. This is what is called the elixir.\n\nOnce it is called the elixir, the essence, *qi*, and Spirit are applied and manifested—this is the substance of the *post-heaven*. Where, then, is the *pre-heaven* substance?\n\nThe so-called *Yellow Court*, *inner furnace*, *outer furnace*, and *clay pellet* (泥丸) cavities all appear only after the *pre-heaven* is established. At that time, where is this body? It truly does not exist.\n\nChasing the wind and seizing shadows,\nplunging into the sea to seek the toad—\nthese are like waiting by a stump for a hare\nor climbing trees to catch fish.\nOnce exposed, the essence scatters and departs,\nand the *pre-heaven* has no master.\nAlas! This is not the elixir of longevity,\nbut a method to hasten death.\n\nThere are also those who, in gathering *qi*, encounter heart blood,\nwhere *qi* and blood congeal into something—\nthis too is called a phantom elixir.\nSuch deceptions are many, hence I raise them to dispel confusion.\n\nOn the method of seizing the elixir:\n*\"Does the Golden Elixir within also wander and lose its way?\"*\n*\"It does.\"*\n*\"Is there a way to seize it?\"*\n*\"There is. Yet this is not the elixir wandering—\nthe gates are not firm, and it is driven out.\"*\n\nAs for phantom elixirs, they may wander,\nbut the Golden Elixir has no such affliction.\n\n*\"How do you know when the Golden Elixir departs?\"*\n*\"When the elixir is in the furnace,\nit is filled with the true *qi* of the Five Phases.\nIf the Five Phases *qi* of my body presses upon the furnace,\nthey resonate and move in response.\nShould I suddenly sense *qi* rising outside the furnace,\nand find no internal resonance,\nthen the elixir is no longer there.\nI must urgently set it down—\na great stillness, and even the furnace and crucible,\nwhether the elixir is present or not,\nare all entrusted to the void.\nAfter a day, or a night,\nI begin to sense where it is—\nsometimes in the heart, sometimes in the liver,\nsometimes in the spleen or kidneys.\nWithin the body’s hundred orifices,\nit may hide anywhere.\nOnce I know its location,\nI gently nurture it as if it exists there,\npreventing it from wandering elsewhere.\nAfter another day,\nI gather it with intent,\nand it descends straight to the *yang* palace.\nThen, from the *yang* palace,\nas if retrieving it at first—\nwith intent,\nit ascends along the old path\ndirectly to the *yang* elixir in the furnace.*\n\nThe mysteries of creation are profound—\nwho could say this is otherwise?\nIf such teachings exist,\nthey come from my master.\"\n\n—*Shen Shui Hua Chi* teachings.\n\nThe *Shen Shui* is none other than the essence of wood—*qi* in its fluid form.\nThe *Hua Chi* is the orifice beneath the *qi*-cavity at the navel, situated between the two kidneys.\nIt closely resembles the *Huang Ting*—where the *gu* (grain)-*qi* generates essence, the medical tradition’s so-called *jing xue* (essence orifice).\n\nThis orifice, in youthful vigor when *yang* is robust and *qi* harmonious,\nmerely irrigates the furnace and crucible, cleanses the spleen and stomach,\nand circulates to moisten the *qi*-cavity.\n\nWhen the original *qi* declines and the primal essence is exhausted,\nall rely upon it as the foundation for the elixir.\nYet when the original *qi* weakens, it is not the *qi* itself that fails—\nrather, the *qi* of constitution is severely depleted.\nThe nature of lustful cravings, ceaseless in thought,\nprevents the primal from manifesting, rendering the post-heaven insufficient.\nThe root of decay and exhaustion lies here.\n\nThe *Hua Chi* orifice is where essence is generated and descends to the kidneys.\nWhen *qi* is strong, essence is abundant; when essence is abundant, the *Hua Chi* flourishes, its use seemingly inexhaustible.\nFor those whose *qi* is withered, the primal essence is parched.\nWhere the *gu*-*qi* alights, it produces only a meager, trickling fluid,\nmerely returning to the kidney chambers.\n\nYet when I am still, the original *qi* knows no increase or decrease—\nonly that the *Hua Chi* is absent.\nThe three elixir ingredients are present, yet one is lacking.\n\nThus, at the moment of *yang*’s emergence, before the time to gather it,\nI direct it with intent toward the *Weilu* (tailbone),\npiercing straight from the *jiapui* (intervertebral space) to the *Nihuan* (brain’s marrow).\nThen, gathering essence from the *jing xue*,\nit naturally ascends with the *qi* to the *Wu Gong* (midday palace),\nwhere, fused with the gathered *yang*, the essence becomes usable.\nAfterward, it descends to the heart, where I extract the mercury,\nreturning it once more to the *Huang Ting*—\nsettling within it.\nWith a single intent, I seal and consolidate it,\nnurturing it as if it exists there.\nWithin, the two mutually devour each other—\nand only then does the elixir form.\n\nRecently, a school from Zhexi has employed this method even among the young\nto forge the elixir.\nYet the Dao lies near—\none must seek it not afar.\nStill, each clings to their own truth.\n\nThe hundred orifices—\nA human body possesses eighty-four thousand hair-pores and three hundred eighty-four *qi*-palaces.\nThe hair-pores disperse and belong to the *qi*-palaces;\nthe *qi*-orifice at the navel governs these three hundred eighty-four palaces as their sovereign,\ndescending into the *yang*-palace, all becoming essence.\n\nThe heart is the central field, the crown the upper field.\nBeneath the tongue lies the *Xuanying* (Mysterious Response),\nwhile the eyes hold the silver sea;\nbetween the brows, the space between the eyebrows,\nthe balance of mouth and nose,\nthe borders of ears and eyes,\nthe left side of the throat,\nand the waist and ribs—all are orifices.\n\nWhat I speak of as the elixir’s emergence—\nif such orifices exist, they can all store it.\nWho says the body has but one or two orifices?\nThese one or two orifices are the hinges of all others—\nwho says they are confined to these alone?\nThis is their form; their application will be explained separately.\n\n**The Diagram of Adoption and Extraction**\n*Adoption* means seeking true *yang* from the kidney palace,\n*extraction* means taking true mercury from the heart-field.\nWhen the time for adoption arrives, one must adopt it,\nand in adopting, one must grasp its use.\nIf it comes before its time, the Dragon will not descend,\nthe Tiger will not ascend.\nSome mistake the surging *qi* and blood—\ntheir wild, rushing exchange—\nfor copulation.\nYet they fail to see that within the *li*-*kan* (fire-water),\nthere exists the true *yang* within *yin*,\nand the true *yin* within *yang*—\nboth standing alone.\n\nWhen the *qi*-pulse is halted by a single thought,\nthe *qi* rushes into the vessels,\nand within the *li*-*kan*,\nit risks harming lead and mercury.\nThough called \"nurturing *qi*,\"\nin truth, it exhausts the original *qi*.\n\nThe loss of original *qi* in a person\nonly becomes apparent in profound stillness—\nthis is the *xian*tian (preheaven) *qi*.\nThe *hou*tian (postheaven) *qi* cycles endlessly,\nyet people drown in desire and fail to discern it.\n\nAt the moment of rough stabilization,\nwhen the mind has no other use,\none then perceives the *qi*’s ascent and descent,\nmistaking it for *xian*tian and thus causing harm.\nThus, many modern Daoists suffer strange ailments—\nthis is the cause.\n\nHuman sickness arises when the *qi*-pulse is obstructed.\nThe *qi* itself naturally regulates,\nyet if forced or coerced—\nwhen it ascends, it harms the pericardium, stomach, lungs, liver,\nears, eyes, mouth, and nose;\nwhen it descends, it surges like a broken dam,\na long dyke collapsing—\nsuddenly rushing downward, unstoppable.\n\nCan such true substances endure?\nI pity those who speak of the elixir,\nso I first depict the Diagram of Adoption and Extraction.\nThough I reveal the heavens’ secrets,\nthose who seek gold elixir yet destroy their nature—\nI correct them with true principles.\nThe *Taishang* (Supreme Sage) cherishes life;\nhe will not blame me.\n\nThus, this treatise sweeps away all metaphors—\n*Yaojing* (Pharmaceutical Needle), *Xuanyang* (Mysterious Yellow),\n*Ying’er* (Infant), *Chinü* (Enchanting Maiden)—\nretreating three *she* (stages),\nso that the wise may grasp the unity,\nand the foolish may dissolve their doubts like water released.\nClear and distinct,\nlike a mirror revealing form—\nevery hair and pore is seen.\n\nThe seekers of gold elixir must first cultivate clear virtue,\nexhausting human effort.\nThen, holding the *Heart’s Theory*,\nthe great medicine will manifest, and its form will appear.\nThe method of adoption and extraction arises from the heart.\nThe heart is the pivot and thread of all transformations—\none must focus the mind before seeking it.\n\n*Wanglao* (forgetfulness) is delusion;\n*seeking* is true mind.\nYet within forgetfulness, a seeking intention arises—\nthis is true mind.\nIn the hazy state, true mind begins to appear.\nOnce true mind is seen,\nfrom it arises a true intention,\nwhich, when reflected inward,\nreveals all orifices fully—\nthe original essence then blossoms.\nThe key lies in generating existence from non-existence,\nand non-existence from existence.\nAt this stage, even true mind is forgotten and abandoned.\n\nIf I await with emptiness,\ntrue breath flows continuously.\nWhen true breath flows continuously,\nthe *hou*tian *qi* stabilizes.\nAs the *hou*tian conceals itself,\nthe *xian*tian *qi* emerges—\nand thus *yang* is born.\n\nThe *yang* that arises is the *xian*tian *qi*\nflowing from the *qi*-orifice into the kidneys—\nlike a fountain bursting forth.\nBetween the two kidneys lies a thread of penetrating *qi*,\nthe pulse-network formed after parents’ union.\nThus, the *xian*tian *qi* circulates within it.\nOnce this is felt,\nall hundred pulses of the body\nawaken like spring’s arrival.\nSpring’s vitality spreads and grows—\nat this point, the *xian*tian form is established,\nand the *hou*tian retreats further.\nOnly then may one subtly stir the intention of adoption and extraction.\n\nThe intention arises from the heart,\nthe heart from the eyes.\nThus, *Laozi* says:\n*\"I have observed the heart—\nwhen the Dao is attained, it is most subtle.\"*\n\nWhen true breath is stabilized,\ninner light becomes divine light,\nand this heart is the true heart.\nTrue heart generates intention,\ndivine light illuminates the heart.\nThus, it is often said:\n*\"The eye moves the heart,\nthe heart generates intention—\nintention adopts lead.\"*\n\nIf *yang* has not yet fully risen\nand one hastily adopts it,\na single thought halts it—\nthe adoption intention takes root,\nand the *hou*tian *qi* resurges.\nThus, it is said:\n*\"Understanding life depends on the nature’s foundation.\nNature is all illusory forms—\nif no attachment remains,\ndelusion fades, and true principle shines.\"*\n\nOnly when *yang* is fully matured\nshould one adopt it—\nthen it ascends vigorously.\nWhen *xian*tian *qi* thrives,\nthe *hou*tian has no time to rise.\nThe ascent of adoption is different.\nIt rises in a drunken sway,\nreaching the navel and slightly beyond,\ngradually halting above the navel—\nthen the breath solidifies.\nThis is called: *lead*.\nLead is metal.\nMetal generates water,\nso mercury is produced in the heart.\n\n「The Dao/Way of *yún cóng lóng, fēng cóng hǔ* [1] is now revealed.\n\nWhen the wind is still and rain descends,\n*hou*tian *qi* naturally merges with *xian*tian *qi*—\none consumes the other, the other devours in return.\nMetal generates water,\nwater generates wood,\nwater again generates fire.\nWood loves metal while metal clings to water—\nthis is the Dao/Way of their interplay.\n\nThough metal overcomes wood,\nthere is still a hint of love and attachment—\nthis is their inherent nature.\n\nAs for the nature of *xian*tian,\nit is but a metaphor.\n\nWhere are the Five Phases [2]?\nOnly when understood as such\ncan one grasp its principle.\n\nSince the method of adoption is clear,\nthe interplay of *xian*tian and *hou*tian *qi* is now disclosed.\n\nAnother instruction:\nAdoption must not be too sluggish—\ntoo sluggish, and the *qi* ages, becoming useless,\nwhile the *hou*tian *qi* grows mixed.\nIf the practitioner studies the Interplay Diagram,\ntheir understanding is already half complete.\n\nThe verse says:\n*\"A drunken sway of harmonious *qi* brews the spring wind,\na single point of *yang* arises within vague emptiness.\nThe unborn gives rise to the born, the born cannot overcome the unborn;\ncolor emerges from emptiness, only to return to emptiness.\nAs the *qi* ascends to the navel, the *lead* reveals itself,\nborn from the heart’s source, the *mercury* flows naturally.\nIn stillness, truth appears; in truth, stillness is found—\n*Kàn* and *Lí* [3] intermingle in dual obscurity.\nWood as the Dragon, Peony as the Tiger [4],\n*Kàn*’s male principle draws *Lí*’s female principle.\nTo know the root of creation’s transformation,\none must not depart from the true fire born in the *zǐ* [5].\nThe Interplay Diagram expounds:\n*Huǎng* [6] and *huǎng*, *yǎo* [7] and *míng* [8]—\nwithin emptiness, form is seen;\nwithin obscurity, essence lies.\nAncient sages often warned scholars of this:\nFor *huǎng* and *huǎng*, *yǎo* and *míng*—\nthese are the forms of stillness.\nOnly stillness can refine the elixir [9],\nwhile instability prevents *yang* from arising.\nOnce *yang* arises,\ninstability prevents the elixir from forming.\nThus, one adopts *lead* with intention—\nand abruptly halts that intention.\nThe halting has its time,\nwhile the ascent follows its measure.\nFor the *qi* is but a single breath when first arising,\nbut when it ascends to the navel, it becomes *lead*—\nso the intention is halted, and its use is lost.\n\n*Lead* can naturally summon *mercury*,\nwhile *mercury* can naturally seek *lead*.\nWithin the *huǎng* and *huǎng*, *yǎo* and *míng*,\nthe principle of their union is complete.\n\nI have obtained my teacher’s oral precepts and now reveal them—\nthey should be kept secret, kept secret.\nSilent observation, no spoken thought.\nIf there are those who understand,\nthey have long had good karma.\nEncountering this precious Dao/Way of profound mystery,\nwhen they hear the oral precepts,\nthey should remember but not write them,\nwrite them but not display them—\nthen I will truly owe them my virtue/power.\n\nI followed my teacher for ten years,\nand whatever I gained,\nI have fully disclosed.\nI wish to share it with kindred spirits.\n\nThis is the *Precious Oral Precepts for Refining Internal Gold Elixir to Attain Immortality and Save the World from the Supreme Scripture of the Jade Purity Golden Cabinet of the Eastern Extremity’s Azure Flower* [10],\nwhose sacred laws are most strict.\nI do not know what taboos to avoid,\nso I dare to compose this book.\nThe first three lines honor the Celestial Court [11].\nAfter receiving its response,\nI dared to speak and write.\n\nAt the moment of writing,\nmy heart trembled with fear,\nand sweat fell upon the paper.\nTears and sobs mingled—\nI only hope kindred spirits may gain from it,\nand not burden themselves in return.\nTogether, we shall achieve victory and ascend the *xian*tian stages.\nAh!\n\nThose who know me,\nare my heart’s joy.\nThose who do not know me,\nwhat do they seek from me?\nMay our hearts reflect each other—\nI am deeply grateful.\n\nO *xian*tian, grant your favor!\n\nThe oral precepts for adoption and interplay:\n*\"Forgotten within seeking, sought within forgotten,\nforgotten in seeing, seen in forgotten—\nand *yang* is born.\nForgotten in adoption, adopted in forgotten,\nforgotten in ascent, ascending in seen—\nseen in transformation, *lead* is formed.\nIn stillness, it arises; with intention, it ascends—\nforgotten in use, *lead* summons *mercury*.\n*Lead* and *mercury* merge within,\n*jing* [12] meets *shén* [13] without—\nunion is achieved.\nWhen *lead* and *mercury*’s *jing* and *shén* merge as one,\ndirect that single thought—\nand the Yellow Court *qi* returns to the *dǐng* [14].\"*\n\nWithin the oral precepts:\n*\"Strike and merge *lead* and *mercury*,\nmust use a single intention.\nWhen adopting one *yang*,\nmust use stillness to generate stability.\nSomeone asks: ‘What is the union?’\nIt is the single orifice beneath the heart—\nthe site of their interplay.\nOne cannot seek it with form,\nnor take it without form.\nWhen *lead* ascends,\nthe *yang* *qi* rises as ∪ [15].\nThe *qi* of the *yang* official [16] descends from the orifice—\nI adopt it with intention.\nWhen *mercury* descends,\nthe meeting *qi* descends as ∩ [17].\nFor *mercury* and *lead* are born from *xian*tian—\n*lead* ascends above the navel,\nilluminated by the *jing* light,\nhence it is called *lead*.\n*Lead* is like the form,\n*mercury* like the shadow.\nWhen the form moves, the shadow follows—\nso *mercury* descends accordingly.\nThe ascent of *yang* *lead* cannot be called pure *yang*—\nit contains the *jing* light, which is *lead*,\nand it also belongs to *yin*.\nThe descent of *yin* *mercury* cannot be called pure *yin*—\nit is born from the heart, the dwelling of *shén*.\n*Mercury* meets the *shén* light and then becomes useful—\nit also belongs to *yang*.\n*Yang* contains clarity,\n*yin* contains *yang*.\nThe two *qi* intermingle,\ncondense and do not disperse,\nand thus form the mysterious pearl [18],\nlike a grain of millet.’*\n\nSomeone asks: ‘*Lead* is one *yang*—\none *yang* is the single breath of *xian*tian.\nWhat is *mercury*?’\nIt is said: ‘*Lead* and *mercury* are both *xian*tian substances—\n*lead* is the *xian*tian *qi*,\n*mercury* is the *xian*tian essence.\nThis *qi* is the mother of life,\nthis essence is the child of nature.\nOne may call them *lead* and *mercury*,\nor one may call them *nature* and *life*.\nWhich master of the Dao/Way would dare to reveal this directly?’\n\nAgain, someone asks: ‘The single orifice beneath the heart—\nwhich orifice is it?’\n\nThe *\"Hun-Dun* Divine Chamber\" refers to this very orifice—\nit is the *qi* of luminous essence and luminous vision.\nIt is formed through illusion:\nthe luminous essence ascends as a ∪,\nthe luminous vision descends as　　.\n\nThough this is the *yuan* essence,\nwithout the daily essence, the *yuan* essence remains unseen.\nAgain, if one does not believe,\nconsider water—\nwhen there is water, there are tides and misty vapors,\nyet one has never heard of misty vapors arising from the earth.\nWater is the essence,\nthe misty vapors are its radiance.\n\nThough this is the *yuan* spirit,\nwithout the daily spirit to command,\nthen the *yuan* spirit reveals itself.\nIt is like the bright moon in the sky—\nwhen the clouds disperse, its light descends to illuminate.\nWhen pure and clear, there are no clouds;\nwhen the light descends, it shines upon.\n\nThough essence belongs to *yin*,\nits radiance belongs to *yang*.\nThough the luminous vision belongs to *yang* and illuminates within,\nit also belongs to *yin*.\nWhen the radiance and luminous essence meet,\nthey form this single orifice,\nwhere *qi* responds to *qi*,\ncausing the two substances to converge within it.\n\n⊙In the formation of things,\nthere is the essence-*qi*,\nthere is the *yuan* *qi*.\nWhen the cultivation is complete,\none becomes a True Person.\nFor here lies the intent of *shēngshēng*—\nthe ability to make both spirits luminous comes from this.\n\nSomeone asked: *\"Then after the union, how does this pearl descend into the Yellow Court and return to the cauldron within?\"*\n\nThe reply: *\"When the two substances gather, their nature and disposition align, and the Five Phases are complete. The tiger returns to its mountain, the dragon to its depths—when the luminous vision withdraws, the essence-*qi* returns. This is how it falls into the Yellow Court and returns to the cauldron—does this not fulfill the union?*\n\n*Vague yet profound, ten thousand apertures bloom with spring—secret, secret, secret. These words are not from the original canon but reflect what scholars have attained.\"*\n\nSomeone else asked: *\"Yang arises from above—if we abruptly halt its intent, how can we be sure it will not descend again?\"*\n\nThe reply: *\"Great question! Beneath the Yellow Court lies the door to the Vermilion Chamber. When intent arises, it ascends, so yang rises; when intent is stilled, it unifies, so yang cannot descend. The furnace and cauldron lie within this unity, belonging to the adept. Thus, one gathers the Five Phases’ pure *qi* and completes the form of Heaven and Earth.\"*\n\nSomeone asked about the method of the furnace and cauldron.\n\nThe reply: *\"The Yellow Court within the body is thus; when one *yang* ascends to unity, the pearl descends into it—this is guarding the cauldron, for the Yellow Court also belongs to earth. As for the center within the center, it is earth within earth. Thus, when it descends into this, the cauldron forms. The Five Phases each strengthen their foundation—what does ‘strengthen their foundation’ mean?*\n\n*The mother seeks the child, the child clings to the mother—this is the method of the elixir, all drawn from their innate nature. Once returned to the cauldron, each returns to its own, like the child clinging to the mother. Thus, in seated stillness, when the luminous spirit descends, it returns to the cauldron. When the essence-*qi* ascends, it does the same. In movement, stillness, sitting, or lying, it is like the dragon nurturing its pearl, like the hen brooding its egg—each *qi* returns to its own. All the body’s meridians serve this; the key is neither forgetting nor forcing growth. Adepts of the Dao—is this not so? This is my elixir method.\"*\n\nThe poem says:\n*\"Why trouble the maiden or the babe,\nwhen clarity reveals it all?\nWithin the body, Heaven and Earth invert—\nin the jar, sun and moon revolve.\n\nKnow that *One* is the use of *yang*,\nand grasp the *qi*-mechanism within it.\nHeaven’s messenger, Purple Yang, has spoken—\nwhy seek more teachers after this?\n\nThe diagram of Heaven’s secrets is laid bare—\nnow you grasp the principle.\nYet do not rejoice—ah!\nHow will you proceed?\"*\n\nThe precious sword lies buried by the ancient prison’s edge,\nNightly its rainbow glow surges toward the heavens.\nAfter the tiger and dragon’s battle in the Three Fields subsides,\nWhere shall one seek mercury and lead?\n\n*Gaga, haha, haha*—\nDo not mistake the stag for a horse—\nA single dark pearl lies buried in the mud.\n\nThe path to the Cowherd-Weaver bridge is blocked,\nThe River Chariot has vanished without a trace.\nWho can ask for the truth?\nThe *Perverse Wind* of the *Lost Register* blows it away.\n\n---\n\n**Exposition of the *Direct Revelation of Heaven’s Secrets* Diagram:**\n\nWhen the *golden elixir* diagram is complete,\nYet Heaven’s secrets remain concealed,\nI now expound the inversion of the Five Phases,\nTrace the circulation of Water and Fire,\nClarify the advance and retreat of medicinal substances,\nAnd embody the cyclical motion of sun and moon.\nWhat I wrote in the previous three sections is now exhausted.\n\nNow, considering that scholars may still not comprehend,\nI write this book.\nThis book—\nIt lays bare the earthly *Heavenly Mechanism*,\nAnd every movement reveals the minutest detail.\nIt transmutes stubborn stone into gold,\nAnd turns worthless pebbles into jade.\nHow could this not be so!\n\nThe two eyes are the abode of the *spirit*—\nGazing and listening, the spirit never departs from them.\nThe two ears are the passage for the *spirit*—\nFor even sounds from a hundred *li* away reach the ears,\nAnd the spirit follows them away.\n\nThe two nostrils are the toil of the *spirit*—\nDiscerning scents and distinguishing fragrant from foul.\nWho discerns? The *spirit* does.\nIf the ears, eyes, mouth, and nostrils were all like the eyebrows,\nWould the *spirit* not then be at peace and whole?\n\nIf so, then it is not of the *Post-Heaven*—\nNor does it require cultivation and refinement.\n\nGenerally, if one forgets the eyes,\nThe *spirit* returns to the *cauldron*,\nAnd illuminates within.\nWhen the *subtle essence* lingers,\nThe eyes droop downward in contemplation.\n\nIf one forgets the ears,\nThe *spirit* returns to the *cauldron*,\nAnd hears within.\nWhen the *subtle essence* lingers,\nThe ears listen inwardly below.\n\nIf one forgets the nostrils,\nThe *spirit* returns to the *cauldron*,\nAnd inhales within.\nWhen the true breath is settled,\nThe *qi* returns to the *Primordial Sea*—this is its principle.\n\nIn summary, when all are forgotten,\nThey all return to the *cauldron*,\nAnd merge within.\n\n**Mnemonic verse:**\n*The rooster can brood its egg—listen with a constant heart.*\n\nSomeone asks of the *golden elixir* Dao:\nThe ears and eyes, mouth and nostrils—\nThey have indeed heard it,\nBut the heart speaks not—this is clear.\n\nThe liver, gallbladder, spleen, stomach, lungs, and kidneys—\nAre they useless things?\nYet within their uselessness, there is function.\nI answer: This is only after one has arrived,\nAnd then applies the principles.\nBut I have sworn to conceal nothing—\nWhat is there to conceal?\n\nWhen I first studied under my teacher,\nI questioned him, and he gave me this poem:\n\n*\"The Five Lakes’ scenery stretches boundless and vast,\nThe heron stands on the sand—cosmos so wide.\nDrawing it out is in vain—let me point it out to you—\nWhen you travel there yourself, you’ll see it fully.\"*\n\nAt first, I did not grasp this principle,\nBut later, when I reached this stage,\nI believed my teacher had not deceived me.\n\nNow, I express what my teacher left unsaid:\n\nThe functions of the Five Phases\nMust not lack a single one.\nThus, when the *subtle essence* lingers,\nThe *qi* of the spleen and stomach meet\nAnd return to the *heart’s thread*.\nThe *qi* of the liver and gallbladder meet,\nPassing through the large and small intestines,\nAnd return to the *kidney’s thread*.\nThe *qi* of the lungs submits to the *heart’s qi*\nAnd communicates through the nostrils.\n\nThis *qi*—\nAfter the *kidney* and *spleen* are settled,\nThe *Primordial Qi* circulates throughout,\nMoving from east to west, from south to north.\nThe south is where the *qi* converges,\nAnd when it converges, it returns here.\n\nFrom the *central spine*, it pierces the Upper, Middle, and Lower *Elixir Fields*,\nDescending to the *kidney* organs.\nBetween the two kidneys lies the *Life-Governing Bridge*.\nThus, *Han Shanzi* said:\n*\"Above lies the *Sacrificial Spirit’s Cave*,\nAnd the *Life-Governing Bridge* is laid horizontally.\"*\nThis is it.\n\nWhen the *qi* descends to this point,\nThe *yang* *qi* flourishes and surges upward,\nMeeting this *qi* at one point—\nIt is then enclosed outside the *cauldron-vessel*.\nUsing it daily increases the *nourishing* power.\nThus, the completion of *Yin-Yu* begins here.\n\nSuddenly, something emerges—\nNeither within nor without,\nAnd the matter of the *golden elixir* is known.\n\nHalf is mysterious,\nAnd half is again mysterious—\nWhy so?\nBecause when one reaches the *golden elixir*’s peak,\nThis is half.\nThe thing that emerges beyond—\nThis is the *Mysterious Pass*.\n\nIts greatness knows no outer bound,\nIts smallness knows no inner limit.\n\nWithin the realm of form,\nSeek the realm without form—\nThis is to perceive *nature* through *command*.\nWithin the realm without form,\nSeek the realm of form—\nThis is to perceive *command* through *nature*.\n\nTo begin with *nature* is difficult,\nBut *command* provides a starting point.\nIt is like a journey of ten thousand *li*—\nThough distant, there is a path to traverse.\nTo begin with *nature* is like grasping the moon in water,\nYet when success is achieved, the result is the same.\n\nTo begin with *nature* may have its advantages.\nFor others, *nature* governs *command*,\nBut for me, *command* governs *nature*—\nThus, it cannot be lightly dismissed.\nThose who exert effort reach it,\nFor they know its truth.\n\nSomeone else asks:\n*\"Why are there so many *orifices* in your diagrams?\"*\nI say:\nThese *orifices* are not those of the *Intercourse of Yin and Yang* diagrams.\nFor *Dao* is the interplay of one *yin* and one *yang*—\nIts comings and goings are endless.\nWhen used, it fills the entire body,\nThis is its function.\nWhen unused, it is stored in the *heart’s field*—\nFormless and without trace.\n\nThen what is it?\nThe master of intention.\nThe left belongs to *yang*,\nThe right to *yin*.\nOnly here does one return to the *Supreme Polarity*.\n\nTo return to the *Supreme Simplicity*—\nThis is from the *Supreme Polarity*.\nTo return to the *Supreme Harmony*—\nThis is from the *Supreme Simplicity*.\nTo achieve the *Supreme Harmony*—\nThis begins with *yin* and *yang*.\n\nThus it is said:\n*\"When *yin* and *yang* are harmonized, winds and rains come in season,\nAnd the auspicious grain grows.\"*\nIt is like this.\n\nThe *Great Unfolding* has fifty. Heaven’s number is one, Earth’s number is two.\nHeaven three, Earth four; Heaven five, Earth six; Heaven seven, Earth eight; Heaven nine, Earth ten.\nOdd belongs to *yang*, even to *yin*.\nHeaven’s number is twenty-five, Earth’s number is thirty—together they make fifty-five.\nThe *Great Unfolding*’s number is fifty; subtracting five to symbolize the Five Phases—\nThis is the inner and outer vessels of the later *Cauldron*.\nAgain, subtracting one from within, symbolizing the *Supreme Polarity*’s immobility—its use is forty-nine.\nAgain, subtracting one from within, to form *Yin-Yu*—its use is forty-eight.\nThe adept practices the *Cauldron* and *Furnace* methods with fire, taking the Four *Guas* as master and the sixty-four *Guas* as use, preserving *Kan* and *Li*.\nAgain, using the *Great Unfolding* Diagram to seek its symbols,\nThe logic of cyclical return becomes clear, and the *Complete Heaven*’s method is revealed.\nIf still unclear, further examine the *Furnace and Cauldron Diagram Treatise*.\n\n---\n\n**Moonlight Treatise**\nThe *Great Void* is vast and empty, the moon radiant and bright.\nSnow-waves surge, the golden toad emits its luster.\nMen see why the moon shines and say, *\"The golden vessel is full, thus the moon is bright.\"*\nWho knows that the source of gold’s birth\nIs produced from the moon itself?\nMen see gold produced by the moon,\nYet do not know the moon’s brightness\nOriginally comes from the sun.\n\nThe moon symbolizes *Original Nature*.\nWater symbolizes the *Kan* organ.\nThe golden toad symbolizes the aperture of *True Yang*’s single point.\n*Original Nature* is like the moon—its manifestation.\nAt first, its appearance is like a star’s size,\nRound and radiant, yet insufficient to reveal *Nature*.\nBut when the *qi*-nature’s vigor slightly subsides,\nA trace of *Nature* begins to show—\nLike clouds parting to reveal the moon,\nThen closing again.\n\nIf not constantly preserved,\nIt may vanish—no different from when unseen.\nThus, the alchemists of *Golden Elixir*,\nOnce this substance is clearly seen,\nKnow that *Original Qi* has been born.\nSeize it immediately—like catching a thief before he flees—\nLest it escape again.\nYet when gathered into the *Cauldron*’s vessel,\nThat single point of *True Qi*’s essence\nCannot be fully extracted.\n\nTake the *Dan Tian* as the eye,\nThe stirring of *Original Nature* in the heart as the moon—\nThe eye’s light returns to illuminate the moon.\nFor after *Intercourse*,\nThe precious body generates gold.\nThe moon receives the sun’s *qi*—\nThus, on the first day of the waxing moon, one *yang* is born.\n\nThe elixir resides in the *Cauldron*.\nAwakening to a single point of luminous light,\nThe heart constantly shines without day or night.\nOne *yang* arises—\nOn the eighth day of the moon, two *yang* are produced.\nTwo *yang*: the elixir’s golden *qi* slightly thrives,\nWhile *Original Nature* slightly manifests.\nFrom two *yang*’s birth—\nAt the full moon, three *yang* are complete.\nThree *yang* complete: *Original Nature* fully revealed—\nThis is the formless state previously spoken of.\nWhen one *yang* is pure, one feels within the body\nA thing—sometimes clear, sometimes hidden.\nWhen two *yang* arise, luminosity spreads throughout the body.\nWhen three *yang* arise,\nThe light is neither inside nor outside—\nOnly a sense of this body as if in empty space,\nNeither body nor space, neither sun nor moon.\nIf constantly thus, this is *Dhyana*.\nYet if the alchemist is born of *having*,\nUnable to embrace *True Void* and use *non-being*,\nEven at this stage, the *Golden Elixir* remains half-formed—\nWhy?\nFor though *Original Spirit* is seen,\nIt has not yet returned to the *Cauldron*—\nThe mingling of *jing* and *qi* into one\nIs why it is half.\n\nNow speaking of the latter half’s logic:\nThe moon reaches fullness—\nOn the sixteenth, one *yin* arises.\nOne *yin*: the beginning of *Nature*’s return to *Fate*.\nFrom one *yin*’s birth—\nBy the moon’s twenty-third day, two *yin* are produced.\nTwo *yin*: *Nature*’s return to *Fate*’s third phase.\nFrom two *yin*’s birth—\nOn the thirtieth day of the moon, three *yin* are complete,\nThree *yin*: *Nature* fully returns to *Fate*.\nWhen *Nature*’s whole body appears,\nContinuously preserved,\n*Nature* reverses into *Fate*’s domain.\nAt its start, *Fate* takes *Nature*—*Nature* is complete.\nAgain, *Nature* stabilizes *Fate*—\nThis is the critical juncture of *Nature* and *Fate*’s celestial mechanism.\nThis is what is meant by *\"dual cultivation of *Nature* and *Fate*\"*.\nThe celestial mechanism is most secret—\nNo further disclosure.\nAt this juncture, the *Golden Elixir* is fully realized.\n\nIt begins with fire’s alchemy—\nEach day’s practice, each day’s nourishment.\nA hundred days’ effort, and the infant is born—\nThus I use the moon as analogy,\nTaking its reciprocal illumination’s logic.\n\nThe moon’s brightness truly originates from gold,\nYet gold’s essence truly comes from the moon.\nRefined a hundred times, unbreakable through ten kalpas.\nFor gold is the sun,\nThe moon is *Nature*.\nFire is the sun’s *qi*.\nGold entering fire returns to *Original Nature*’s truth,\nRefined into the supreme treasure—\nCalled *Golden Elixir Reverted*.\nThus, those who cultivate the elixir\nBegin by taking gold.\nFor gold generates water—\nThe logic of *Intercourse* is revealed,\nAnd relies on earth to complete it.\nThus, the city’s foundations and defenses\nOriginally depend not on true gold medicine,\nBut on securing and fortifying it.\nWhen pure gold is refined, it is called *Golden Elixir*.\n\n**Furnace and Cauldron Diagram Treatise**\nThe *Cauldron* as vessel is neither gold nor iron.\nThe *Furnace* as tool is neither jade nor stone.\nThe *Yellow Court* is the *Cauldron*,\nThe *Qi*-aperture is the *Furnace*.\nThe *Yellow Court* lies directly above the *Qi*-aperture,\nThreaded and connected—this is the *Furnace* and *Cauldron*.\n*Yin* and *yang* are the fuel,\nUsed to cook and refine.\nWhen the *Yellow Court* is on the body,\nAt the moment of *Intercourse*,\nThis is when *Original Qi* is established.\nAt this time, the aperture opens,\nAnd the elixir falls within—\nSeal it firmly.\nThis is like sealing mercury in a gourd,\nClosing its mouth,\nAnd placing it in deep water.\nMercury: lead and quicksilver.\nThe gourd: the *Yellow Court*.\nDeep water: *qi* itself.\n\n**Furnace and Cauldron Diagram Treatise (continued)**\n\nSeal the *Yellow Court*,\nConceal the *Elixir Primordial*,\nAnd place it in the realm of *Qi*-confluence—\nThe adept shall ponder this,\nAnd grasp its essence.\n\nThe tiger’s roar summons the wind,\nThe dragon’s chant stirs the clouds.\nThe cricket sings of autumn’s arrival,\nThe mayfly reveals the *yin*.\nAll *qi* returns to the *Cauldron*,\nAnd the seal grows ever tighter,\nThe refining ever more steadfast—\nThis is the *Furnace* and *Cauldron*’s true nature.\n\nThe core principles of ten thousand *Dan* scriptures,\nDiagrams and symbols standing forth—\nThese are meant to let one forget the symbols and grasp the truth.\nLater scholars, however,\nCling to the symbols and seek the true meaning,\nEach pursuing strange theories.\n\nYet know that the supreme *Dao* is not elaborate—\nIt hinges only on *yin* and *yang*.\nAs for the saying, *\"Heaven One begets Water, Clouds, and such\"*—\nThis merely elucidates the circulation of *water* and *fire*.\nWhen one speaks of the *Four Seasons* and *Eight Nodes*,\nThis merely illustrates the waxing and waning of *Heaven* and *Earth*,\nOf *yin* and *yang*.\nHiding the *Primordial* and speaking of its *manifestation*,\nThus few truly comprehend it.\n\nAll that I have now written\nDiscards the branches and speaks of the roots.\nThe roots exist, and the branches will naturally flourish.\nThe ancients did not wish to speak,\nYet I have spoken.\nThe *Dao*-worthy among men\nShould embody this intent,\nAnd not view it through the lens of lesser ways.\nFollow this, and the *Immortal* may be attained.\n\nSome ask, *\"The nature of the Furnace and Cauldron is clear in its analogy—\nI would also hear of their use.\"*\n\nBetween *Heaven* and *Earth*, myriad herbs and grasses,\nTen thousand kinds, diverse and scattered.\nAfter the *Winter Solstice*, *yang* stirs from below—\nThen withered plants regain their vigor,\nA hundred grasses sprout anew.\nHibernating insects awaken,\nAll kinds rejoice in vitality.\nDoes *Creation* have a mind and thus birth the myriad?\nDo the myriad have minds and thus await *Creation*?\nIt is but the movement of *Qi* itself—\nAll kinds respond and come to be.\n*Heaven* has no mind, does it?\nThe myriad have no minds, do they?\n\nWhen it comes to myriad herbs,\nAt the moment of blossoming and fruiting—\nThis is when medicinal substances follow their cycle.\nWhen leaves fall and fragrance fades—\nThis is when medicinal substances return to their roots and fulfill their nature.\nThis may illustrate how the ancients gathered medicinal substances\nAs they grew and declined to forge the Elixir—\nNone surpassed this method.\n\nYet one must not rigidly adhere to the notion of *Creation* having no mind,\nLetting things float or sink on their own.\nNor must one rigidly adhere to the notion of *Creation* having a mind,\nDriving and chasing after fire.\n\nInstead, one must maintain a steady presence,\nKnowing its absence while holding to its presence.\nKnowing its whiteness while holding to its blackness.\nWithin stillness, regulate the fire’s timing;\nWithin steadiness, forge the *Returned Elixir* in its core.\nBalance it with moderation.\n\nThe *Divine Chamber*—as discussed in *The Diagram of the Divine Hall*—\nIs the chamber where the *Original Spirit* resides, the *Yinyuè* [1] being such.\nMen know to establish the *Yinyuè*’s *Creation*,\nIts essence clearly revealed.\n\nYet if one does not know there is a chamber without its master,\nWhat use is the chamber itself?\nBut though the master may be absent,\nHis embryo still lies within that chamber.\n\nLike a pregnancy—\nWithin ten months, when the mother breathes, the child breathes;\nWhen the mother inhales, the child inhales—\nOnly the *qi* is insufficient.\n\nWhen the *qi* is full and the form complete,\nA single point of luminous spirit enters within—\nThen it emerges with a start.\nIts cries resound clearly—\nPurely human in essence.\n\nThis is when the *Yinyuè* is complete,\nAnd the spirit returns to its chamber.\n\nWhen the spirit returns to its chamber,\nThen one has attained its unity—\nAll else is accomplished.\n\nFor after the union,\nThe spirit-light descends,\nIlluminating the *Mysterious Pearl*.\nThe *Essence* ascends,\nAnd is born from the *Mysterious Pearl*.\n\nTrue *Lead* is the *Original Qi*.\n*Essence*, *Qi*, and *Spirit* already have their embryos within.\nWhen fire is sufficient and *qi* is full,\nThe *Original Essence*, *Original Qi*, and *Original Spirit* merge as one—\nThus the infant is born.\n\nThe infant does not produce itself—\nOnly when fire consumes all *yin* does the embryo emerge,\nAnd only then is the infant born.\n\nI have said that the ancients’ diagrams of Elixir cultivation [2]\nAre indeed the *Yinyuè*—\nYet they failed to grasp the method of securing that single point within.\nTemporarily formed, then finally dispersed,\nFierce fire burns in vain—\nAnd the *Kan* [3] escapes.\n\nThis single point, born externally,\nFollows the *Post-Heaven* sequence—\nOne generates Two, Two generates Three,\nAnd Three generates the myriad.\nAll stems from this.\n\nCommon men act thus,\nBut the determined revert to its source.\n\n「Turning it back and producing it within,\nThen the Dao of longevity and eternal vision is preserved.\n\nIs this not returning to the root and restoring the command?\n\nThe means of returning to the root and restoring the command\nLies in deep roots and firm foundations.\n\nThe Dao of deep roots and firm foundations\nIs rooted in purifying the heart and dispelling desires.\n\nThe principle of purifying the heart\nIs to screen out sight and hearing.\n\nAs Confucius said:\n*\"Do not look upon what is not right, do not speak of what is not right,\nDo not listen to what is not right, do not act upon what is not right.\"*\n\nThis is the true and genuine principle.\n\nBut since virtue and teachings must be practiced in the world and applied in time,\nTherefore, they use *li* (ritual propriety) as its guard.\n\nWhat is called securing the heart\nAre the equalities of joy, anger, sorrow, and delight.\n\nLoyalty, forgiveness, kindness, compliance, compassion,\nreverence, respect, solemnity, and caution—\nthese are the true heart.\n\nThose who cultivate the Elixir,\nYet treat the true heart as a false one,\nMingle it in confusion and revert to its beginning,\nOnly to rediscover its origin.\n\nReturning to the realm without false thoughts,\nA true heart is born anew.\n\nStirring the Heavenly-Earthly *forces*,\nYet ultimately reaching the state of *non-action*—\n\nIf the Buddhist teaching of the so-called true heart,\nThen it is indeed different.\n\nLaying aside the six *sentiments*,\nWith no thought at all.\n\nThe nature is vast and clear,\nThe true *Original Essence* manifests itself.\n\nAt the moment of its revelation,\nMovement and stillness become effortless.\n\nFor when stillness reaches its utmost extreme,\nIt attains the *Tàijí* (Supreme Polarity).\n\nThen, within a word or half a sentence,\nLike death in a single instant,\nOne must be reborn anew.\n\nOnly then can one grasp the profound mechanisms of transformation,\nAnd establish the foundation for neither birth nor death—\nHow easily can one fathom its gate?\n\n**The Fire-Candidate Diagram and Theory**\n\nThe *Book of Changes* contains **384 hexagrams** [4].\nFire corresponds to **384 *zhū*** (units of weight) [5].\n\nThus, the *Kuaì* (trigrams) *Qián* (Heaven) and *Kūn* (Earth) are used as the *dǐngqì* (furnace vessels),\nAnd *Kān* (Water) and *Lí* (Fire) are the *yàowù* (medicinal substances).\n\nBeyond these, the first stage uses *Lún* (Sprout) and *Méng* (Innocence).\nThe second stage uses *Xū* (Waiting) and *Sòng* (Judicial).\nThe third stage uses *Shī* (Army) and *Bǐ* (Union).\nThe fourth stage uses *Xiǎo Chù* (Lesser Taming) and *Lǚ* (Progress).\nThe fifth stage uses *Tài* (Great) and *Pǐ* (Stagnation).\nThe sixth stage uses *Tóng Rén* (Union of People) and *Dà Yǒu* (Great Possession).\nThe seventh stage uses *Qiān* (Modesty) and *Yù* (Enjoyment).\nThe eighth stage uses *Suí* (Following) and *Guì* (Nurturing).\nAnd the metal measure is half a *jīn* (catty).\n\nThe ninth stage uses *Lín* (Approach) and *Guān* (Contemplation).\nThe tenth stage uses *Shìè* (Devouring) and *Bēn* (Adornment).\nThe eleventh stage uses *Bō* (Peeling) and *Fù* (Return).\nThe twelfth stage uses *Wú Wàng* (No Blame) and *Dà Chù* (Greater Taming).\nThe thirteenth stage uses *Yí* (Nourishment) and *Dà Guò* (Great Exceeding).\nThe fourteenth stage uses *Xián* (Influence) and *Héng* (Constancy).\nThe fifteenth stage uses *Dùn* (Retreat) and *Dà Zhuàng* (Great Strength).\nThe sixteenth stage uses *Jìn* (Advance) and *Míng Yí* (Dark Side of Brightness).\nThe seventeenth stage uses *Jiā Rén* (Family) and *Kuí* (Division).\nThe eighteenth stage uses *Jiǎn* (Diminishing) and *Jiě* (Release).\nThe nineteenth stage uses *Sǔn* (Diminishing) and *Yì* (Increase).\nThe twentieth stage uses *Guài* (Resolving) and *Gòu* (Modesty).\nThe twenty-first stage uses *Cuì* (Gathering) and *Shēng* (Ascendant).\nThe twenty-second stage uses *Kùn* (Difficulty) and *Jǐng* (Well).\nThe twenty-third stage uses *Gé* (Revolution) and *Dǐng* (Tripod).\nAnd the water measure is half a *jīn* (catty).\n\nThe twenty-fourth stage uses *Zhèn* (Shaking) and *Gèn* (Obstructing).\nThe twenty-fifth stage uses *Jiàn* (Gradual) and *Guī Mèi* (Returning Younger Sister).\nThe twenty-sixth stage uses *Fēng* (Fullness) and *Lǚ* (Journey).\nThe twenty-seventh stage uses *Xùn* (Wind) and *Duì* (Joy).\nThe twenty-eighth stage uses *Huàn* (Dispersion) and *Jié* (Moderation).\nThe twenty-ninth stage uses *Zhōng Fú* (Inner Truth) and *Xiǎo Guò* (Lesser Exceeding).\nThe thirtieth stage uses *Jì Jì* (Already Completed) and *Wèi Jì* (Not Yet Completed).\n\nIn an instant, the cycle is complete—\nThe cycle completes and begins anew.\n\nLike the sun and moon in their courses,\nOne cold and one hot.\n\nHeaven and Earth in *yīnyūn* (breathing),\nAll things transform into *huàchún* (pure essence).\n\nReversing transformation,\nFlipping Heaven and Earth.\n\nStealing from the universe,\nRobbing from *Yīnyáng* (yin-yang).\n\nAttaining the supreme Dao of Heaven and Earth,\nOnly then can one speak of this.\n\nSomeone asks about the nature of *Qián* (Heaven), *Kūn* (Earth), *Kān* (Water), and *Lí* (Fire).\n\nI say:\n“When the Fire-Candidate’s time is at its peak,\n*Kān* and *Lí* interact.\n\nWhen *Kān* and *Lí* interact,\nThen *Qián* and *Kūn* unite in harmony.\n\nFor the *Dao* of Heaven descends,\nAnd the *qi* of Earth ascends—\nThis is the function of *Qián* and *Kūn*.\n\n*Kān* is where *Qián* meets *Kūn*,\nAnd *Lí* is where *Kūn* meets *Qián*.\n\nThe other hexagrams\nAre merely auxiliary forms.\n\nOne must not rigidly adhere to the symbols and seek the lines,\nFor the method of Fire-Candidate’s cultivation is only then revealed.”」\n\n「If I may speak plainly,\nIt is merely to encompass Heaven and Earth,\nTo regulate the cycles of the sun and moon.\n\nYet the *Furnace and Cauldron Diagram* (炉鼎图) also arranges the Eight Trigrams within the cauldron,\nAnd the *Fire-Candidate Diagram* (火侯图) elevates the Five Phases (五位) at the *Néirán* (泥丸) point,\nBalancing the *Píngqiáo* (平桥) between *Mǎo* (卯) and *Yǒu* (酉) — why is this so?\n\n*The Dao of Heaven* (天机) is naturally not meant to be divulged,\nBut since we have reached this point, what is the purpose of concealing it?\nMoreover, the *Lǒu* (河) gave rise to the Diagram,\nAnd the *Luò* (洛) revealed the Classic.\nHeaven itself has already disclosed its secrets—\nWhat need is there to fear a thousand people?\n\nThe disciple said: *\"Stop!*\nI have heard that revealing *Heaven’s Dao* (天机) brings misfortune to the Nine Ancestors (九祖).\"\n\nI replied: *\"Have you not heard that saving one person brings blessings to the Nine Ancestors?\nWith my elixir method,\nI have fully uncovered its essence—no secrets remain—\nAnd impart it to those with karmic affinity (有缘之士).\nIf there are sincere practitioners,\nOne may attain immortality—\nWhy should I lack merit then?\"*\n\nThe disciple said: *\"Your intentions are beyond what I can comprehend.\"*\n\nI said: *\"This furnace, this cauldron,\nAre merely the principles of advancing Fire, advancing Water.\nWater and Fire are but one breath of *qi* (气).\nWhen *qi* ascends, I meet it with my mind—\nThat is Fire.\nWhen *qi* descends, I await it in stillness—\nThat is Water.\nThis continuous process—\nThe function of *Rùn* (子) and *Wǔ* (午) in advancing Fire and Water—\nIs precisely when the *Yǎnyuè Furnace* (偃月炉) is employed.\n\nWhen one’s *nature* (性) manifests, *qi* (气) is generated;\n*Qi* generated, then *metal* (金) is formed,\nMetal formed, then *qi* abounds,\nAnd *qi* abounding, the Metal’s power grows ever stronger—\nThis is the interplay of the two.\n\nMetal flourishes within,\nPiercing through the floating vapors (浮云).\nThe true nature (勾真性) emerges—\nLike the moon’s radiance,\nThis is the *Yǎnyuè Furnace* (偃月炉).\n\nThe principle of cultivation and preservation (存养) is:\nWhen Metal’s *qi* (金气) is at its peak and fully exhausted,\nA single wheel of bright moon is seen—\nThis is the *full nature* (全性).\n\nOnce the *full nature* (全性) is revealed,\nAnd the Metal’s nature is restored,\nThen my body is entirely composed of true nature (真性),\nAnd *command* (命) governs it.\n\nThis is the time for Fire’s application—\nFor the two have not yet merged into one,\nAnd Fire refines them into pure Metal.\n\nEncompassing nature and *command*,\nThe entire body becomes *yang* (阳).\nRising and sinking at will,\nLoving the sun, cherishing the moon,\nEnjoying celestial wandering (游顶门),\nWhen the time comes, the Dao is achieved.\n\nWith vigor and determination,\nOne breaks free—\nA thunderous crack,\nAnd the body is no longer mine.\n\nAh! Every person can succeed thus.\nYet if one abandons oneself,\nHow pitiful it would be!\n\nI have seen the *Zǒngpiān* (总篇),\nWhen the Nine Transformations (九转) are complete,\nAnd the *Mùyù* (沐浴) ritual is finished.\nFire’s force has reached its end—\nA single star does not extinguish.\n\nThus, movement—\nA single breath to blow it.\n\nThe *Xùn Wind* (巽风) is but a thread beneath the cauldron.\nWhen sealed, it is *Qián* (乾);\nWhen opened, it is *Xùn* (巽).\nWhen sealed, it is exhalation (嘘);\nWhen opened, it is inhalation (吸).\nHow can it open and seal?\nIt is nothing but the will directing it so.»\n\n“Some asked: ‘*Xùn* (巽) is the position of the West. According to your words, *Xùn* is the central palace. Is this not contradictory?’\n\nI replied: ‘The West is the *use* of *Xùn*, while the central palace is its *essence*. From my own mind, I generate a single intention and descend it into the *Xùn* position. When its symbol is first manifested, then my words truly encompass both essence and use.\n\nThen it follows with *Qián* (乾). *Qián*: metal. And fire is the essence of metal, so when encountered, flames burst forth in all directions. If one then suppresses it with *Kàn* (坎), suppression cannot be maintained, and there will be danger of a counterattack from below. Therefore, one must restrain it with *Liáng* (良), and again exhale with *Xùn*.\n\nThe upper stroke of *Xùn* belongs to yang (阳), and fire cannot be stopped without yang. Thus, when it meets *Zhèn* (震), the flames diminish slightly; when it meets *Lí* (离), they flare again.\n\nAgain, one restrains it with *Kūn* (坤). *Kūn*: water. Fire arises from water, as when it encounters *Duì* (兑). *Duì* is also a western hexagram. Thus, it ascends gradually from the tail of the spine (*wěilǘ* 尾闾), reaching the *Níwán* (泥丸). The top is the *Tiānmén* (天门), the realm of true noon. Noon belongs to fire, so it adds brilliance.\n\nAgain, it connects with the heart. The heart is fire, and the connection is the spirit—this is the spirit-fire. Again, brilliance is added.\n\nBy the time it reaches *Mǎo* (卯) and *Yǒu* (酉), if it descends directly, the *punishment of virtue* (刑德) will strike the gate, and great peril will ensue! Therefore, one must stand firm in one position and divide into two paths. Today’s *Mǎo* and *Yǒu* are yesterday’s *Kūn* and *Gèn* (艮).\n\nFire is *qi* (气). The principle of *qi* descending and then ascending is why it returns to the kidney palace (*shènfǔ* 肾府), transforming into true water and using it.\n\nThe *Wén* (文) fire is gentle in nature yet difficult to refine. When it encounters *Mǎo* wood, it must subdue earth. Thus, if fire subdues wood, earth will not be subdued. The *Wǔ* (武) fire is strong in nature yet easy to refine, descending from *Yǒu*. *Yǒu* belongs to metal, metal generates water, and it returns to the cauldron.’\n\nThey asked: ‘What is meant by *Wén* (文) and *Wǔ* (武)?’\n\nI replied: ‘*Wén* fire ascends from the Three Passes (*Sān Guān* 三关) to the heavens, while *Wǔ* fire is the noon palace and heart fire. In general, the fire stages are but one cycle, fraught with great danger. A *Dān* adept (丹士) should conquer in a single battle, and then the world will be settled. Ordinarily, the fire stages of the *Zhōutiān* (周天) cycle should not be taken as a model. However, this principle must not be rigidly clung to—nor should it be entirely abandoned.’\n\nThe auspicious clouds disperse, revealing the vast *Hóngméng* (鸿蒙) expanse—\nas if in empty space, I glimpsed my ancestors.\n\nWhen the winds stilled, the Seven Stars (七星) remained in water,\ntheir faint lingering melodies drifting into the sky.\n\nHaving exhausted the *yīn* (阴) phase, the diagram was laid out—\nMaster Zhāng (张子) once sat in a secluded chamber,\nforgetting his form, dissolving his *qi* (气化).\n\nSuddenly, a breeze arose at his ears:\nfirst, like the autumn cicada’s song beneath distant green willows,\nthen, as if hearing the *xiāo* (箫) of the Nine Heavens (九天).\n\nThe harmonious tones seemed to waver—\na figure stood beside him, identical in ear, eye, mouth, and nose to Master Zhāng.\nPointing at Zhāng, it cursed:\n*“Since the Great Simplicity (太易), I have been enslaved by you,\nwithout respite, not even a blink—what crime have I done against you?”*\n\nZhāng did not realize he had laughed soundlessly,\nand in silence, he said to it:\n*“Come, let us speak. Your words are true,\nbut do you suffer for me? Or do I suffer for you?\nLet us sit and converse.”*\n\nIt replied:\n*“I came first, with no grievance.\nAfter dwelling with you, even in sleep and waking, we clung to each other.\nAcross countless kalpas (劫), I could not move freely.\nYou placed me in deserts, in winds and frosts—\nfirst ordering me east, then ordering me west.\nEndless forms of torment!\nOnly recently have I found wisdom in your dwelling,\nnourishment in your regulated breathing.\nIt is indeed good, but it is too late.”*\n\nZhang said:\n*“It is not my fault—it is the thief of the Six Desires (六欲) that has driven me to this.\nYou are subtle and hidden; it is blatant and manifest.\nIt knows of your existence, but not of mine.\nIt is like a blind man in a boat—\nhe only knows the boat moves a thousand miles each day,\nbut does not see the rower’s true labor.\nIf one does not desire to sail,\nthen the rower will have leisure.”*\n\nThe one resembling Zhang (似張者) rejoiced and said:\n*“Nearly losing you! I possess a blade tempered a hundred times (百炼之坚刀),\nfit to strike this thief together—\nand only after severing its roots,\nwhen we both enter the *gui* (规),\nthen act alone,\nstriding past the golden gates (金阙).”*\n\nZhang replied:\n*“Indeed, indeed.”*\n\nA yellow radiance (黄光) spread in four directions (四进),\nits colors vivid and resplendent (五色焕然).\nThose who observed listened and remarked:\n*“The Way (道) of banishing the thief must not be hasty—\nhastiness only invites its retaliation.”*\n\nAt first, strength could not overcome it,\nbut its calamity could then be assured.\nIf one lets the mind wander freely (纵放任余心),\nand constantly guards it (守之常将息),\nwhen it takes a cunning, deceitful form (狡诈形),\none will often find it lacking (视之常无爾).\nWith one battle, the Three Pure Ones (三清) are settled,\nand all demons (万魔) retreat without trace (屏迹).\n\n**On the Essentials of the Golden Elixir (金丹) Way:**\n\nThe human body,\nwhen balanced (大而則),\ncan embody the forms of Heaven and Earth (象天地),\nencompass the myriad transformations (包容万汇),\nand shift without measure (变化莫测),\nits subtlety and responsiveness (灵通玄妙) beyond reckoning.\nYet common folk use it daily without knowing,\nso the Golden Elixir (金丹) Way is rare indeed.\n\nThe Golden Elixir Way,\nvalues medicinal substances (药物).\nMedicinal substances depend on *jing* (精), *qi* (气), and *shen* (神).\n*Shen* (神) begins with the *shen* radiance (神光),\n*jing* (精) with its essence (精华),\nand *qi* (气) with the Original *qi* (元气).\n*Jing* (精) cannot flourish without *qi* (气),\nand *shen* (神) cannot be full without *qi* (气).\n*Jing* (精) melts with *qi* (气),\nwhile *qi* (气) relies on *jing* (精) for use.\n*Qi* (气) manifests through *shen* (神),\nand *shen* (神) acts through *qi* (气).\n\nNow, let us speak of the Heaven and Earth within my body:\nSince the Great Ultimate (太极) was divided,\nthe Two Principles (两仪) were distinguished.\nThe Two Principles gave rise to the Four Phases (四象),\nthe Four Phases to the Eight Trigrams (八卦).\nWhen the Eight Trigrams were established,\nthe Ways (道) of Heaven, Earth, and Man were complete.\nHeaven moves as its nature (动为体),\nEarth remains still as its nature (静为体).\nThe *qi* of Heaven and Earth flows ceaselessly,\nand the sun and moon traverse within it.\n\nTruly, after the parents (父母) had formed and nurtured me,\nonly then did the pulse networks (脉络) arise.\nOnce my form was complete,\nthe fine pulse networks (缕络) emerged.\nBut if we return to the Original Nature’s emptiness (元性之虚无),\nthe channels (谷道), sinews (筋条), and tendrils (条) are dense as grass and weeds (草茅之郁茂).\nThis is the Original *qi* (先天气),\nthe Original Way (先天之道)—\nthe most precious words of the Golden Elixir (金宝).\nIt must be guarded within the center (守之以中),\nthen the Way will flow freely (道路通畅).\n\nThe human body receives the Central *qi* of Heaven and Earth (中气) to live,\nwhich is called *ming* (命).\nTo receive the Central *qi* of Heaven and Earth and live,\none becomes human.\nIf I take my body as Heaven and Earth,\nI too should hold its center (中),\nand serve as the pivot of creation (造化之枢纽).\nThe center has three aspects (三中):\nthe mind’s intention (心中意), the *ding* (鼎) at the navel (脐中鼎), and the furnace (炉) in the kidneys (肾中炉).\nOf these three, the most critical is the mind’s intention (心中意).\nThe *ding* (鼎) at the navel (脐) is secondary,\nand the furnace (炉) in the kidneys (肾) is yet again secondary.\nThese three must never be separated,\nfrom the beginning to the end of the Golden Elixir Way.\n\nGenerally, practitioners of the Golden Elixir Way seek the Five Phases (五行).\nBut at its peak (末矣),\none must know that at the moment of union (交会之际),\na hazy, indistinct sensation arises (恍惚杳冥),\nand itching emerges in the pores (痒生毛窍)—\nthis is the true nature of gold (金之本情).\nWhen the image (逸像) is harmonious and unrestrained (和畅),\nand the limbs are supple and compliant (肢体柔顺),\nthis is the true nature of the Original (本之本性).\n\nLead (铅) has the nature of fire (火体) but the essence of gold (金情),\nMercury (汞) has the nature of water (水体) but the essence of wood (木性).\nThere is no other reason—\nwater and fire are the bodies (体) of lead and mercury.\nGold and wood are their functions (用).\nWhen lead and mercury condense (凝结),\nand their radiance unites (光华会合),\nthis is the intention (意),\nwhich belongs to earth (属土).\nThe Five Phases are fully gathered within the *ding* (鼎),\nand like attracts like (物以类聚).\nThe Five Phases also scatter and arrange outside the *ding* (鼎),\ntheir inner and outer interactions (内外相感) forming the elixir (丹).\n\nIts appearance resembles glutinous rice (黍米),\nneither green, nor yellow, nor black, nor white—\nit cannot be named, its form is ineffable.\nAt this stage, it lingers faintly (绵绵若存),\npure and effortless (清净无为),\nnaturally revealing myriad wondrous uses and phenomena (百般妙用景象).\n\nWhen the kidney’s water (肾水) merges with the essence water (精水),\nthe dark fluid (玄膺) flows from the eyes,\ncalled the *Hua chi* (华池) and *shen* water (神水).\nIn the void (虚无之中),\nwhite snow forms and yellow buds sprout (白雪生而黄芽长).\nYet even in this lingering moment (绵绵若存之顷),\nall returns to the *ding* (鼎).\n\nThis great medicine (大药) never departs from *jing* (精), *qi* (气), and *shen* (神),\nbut its foundation lies in the medicinal materials (始用药材).\nAgain, *jing* (精), *qi* (气), and *shen* (神) are not the very source of the medicine (所产也).\nNow there are those who follow side paths (旁门),\nboasting their own methods (自作自是),\nyet when *jing* (精), *qi* (气), and *shen* (神) are enslaved by their schemes (受役之不暇),\nhow can they produce medicine (产药)?”\n\nOf *jing* (精), *qi* (气), and *shen* (神),\nwhich is most important?\nIt is said: *Shen* (神) is most important.\nThe Golden Elixir Way begins with *shen* (神),\nand then employs *jing* (精) and *qi* (气).\nThus it is said: *Shen* (神) is most important.\n*Shen* (神) is another name for Original Nature (性).\nWhen absolute stillness (至静) remains,\nand Original *qi* (元气) is about to emerge,\n*shen* (神) also desires to appear.\nIf one does not act swiftly with *ding* (定) to await it,\nit will scatter and become formless (散而无体之体).\nIf one boasts of its coming and going (夸出入),\nand insists it is the Great Way (大道),\nthen how can it be attained (为)?\n*Shen* (神) does not move swiftly yet arrives quickly,\nnor does it travel yet reaches its destination.\nThe teacher said:\n*The subtleties of shen* (神) are boundless yet have limits.\nIf one grasps its Way (道),\nit can come and go (出入),\nbut one must never indulge in profound musings (良深).\nFor though it can be gathered within (收于内),\nit must not be allowed to disperse without (纵于外).\nWhen *shen* (神) emerges and takes form through trees and woods (依林木以成形),\nthe yin is not yet exhausted.\nAt the moment of its emergence,\nmany strange phenomena appear (多异景).\nSunlight blazes forth (日光烨然) from the eyes,\nbreath may sometimes be drawn in through the nose (鼻气或吸),\nand clear sounds are heard (耳闻清音) from the ears.\nYet why does it never come or go through the mouth (独不可从口出入)?\nThe mouth is where the *qi* of the Five Zang (五脏) converges.\nIf *shen* (神) abandons *jing* (精) and *qi* (气) and steals out,\nit avoids the place where *qi* is most abundant (避气盛之地).\n*Shen* (神), *qi* (气), and *jing* (精) are always entwined (常相恋),\nand if *shen* (神) departs,\nthe other two will have no foundation (无依焉).”\n\nThe *shen* (神) that emerges brings harm without benefit.\nThe sun and moon reside above, illuminating the lands below.\nThe alchemist reverses this for application—\nfollowing the Dao, it becomes fire.\n\nFire circulates in nine revolutions within nine revolutions.\nAt the first emergence of the nine revolutions,\nits vigor peaks at the first turn.\nAwaiting the *qi*’s exhaustion, it proceeds to the second turn—\nand so it continues.\nWhen the nine revolutions are complete,\nit is pressed into the crucible.\nThus, the practice of advancing fire is called *true yang* (真阳) battling the myriad *yin* (群阴).\n\nLet me explain:\nThe human body is all *yin*,\nsave for a single point of *yang*.\nWith this single point of *yang*,\nI turn it from afar to near,\nrevolving it again and again.\nBy vanquishing the myriad *yin*,\nthe *yang* Dao grows daily,\nwhile the *yin* Dao wanes.\nThus the *Yijing* says:\n*\"The dragon battles in the wild,\nits blood a deep, yellow hue.\"*\nWhen *yin* is exhausted and *yang* is pure,\nthe elixir begins to ascend to the *mìhuán* (泥丸).\nWith decisive vigor,\nthe True Person then appears.\n\nSuch is the Dao of the Golden Elixir—\nyet there is more that cannot be fully spoken.\n\nWhen the elixir first forms,\nat the moment of union,\nit cannot avoid relying on both *yin* and *yang* to complete it.\nLater, it is gradually refined by *yang* fire into a purely *yang* body.\nThus, *self-striving without rest* is the Dao of *Qian* (乾).\nWhen the elixir is complete,\none condenses the *shen* to form the body and become immortal.\n\nIn its initial formation,\nthe elixir relies on the Five Phases to fulfill its function,\nbut later it is gradually nourished by true gold into a purely golden body—\nthus its luminous golden hue throughout.\n\nGold transforms into the color of the sun,\nand so it shines.\nGold embodies the sun—\nits nature is firm.\nThus it is called *Golden Elixir* (金丹),\nand also *Golden Immortal* (金仙).\n\nThough the phantom body is a fabricated construct,\nthose who cultivate the elixir must use it to nourish the elixir’s foundation.\nIt is like a city—\nif the walls are strong,\nexternal evils cannot penetrate.\nThus, during the subtle moment of its existence,\nthe spleen and stomach merge into a single vessel,\nsurrounding the elixir field on the left.\nThe lungs and liver merge into a single vessel,\nsurrounding the elixir field on the right.\nWhen true *qi* subtly arrives,\nit encircles the hand’s pulse networks.\nThus, approaching the elixir,\none may obtain *qi* to transmute into the utmost treasure.\nKnow one, and you may infer the other.\nYet this is the beginning of *wuwei* (无为),\nand its principle is now clear.\n\n*Wuwei* has no force—\nyet the *qi* of a person, when moved by thought,\nis like this:\nWhen one clenches a fist and wills it open,\nthe fingers extend without hindrance.\nWhen the student attains this,\nwhile gathering the primordial *qi* (先天一气),\nthey must hold a true thought,\ngathering true *qi*.\nFollowing the diagram and observing the form,\nit settles in the *Huángtíng* (黄庭)—\nthe principle is one.\n\nIn the depths of winter, when the cold is severe,\nonly after *yin* and *yang* harmonize\ndoes the myriad phenomena emerge.\nWhen the student attains this,\nthey will know that after union,\nmedicinal substances need not be sought externally—\nthey arise naturally.\n\nGold in water shines dazzlingly,\nbut gold above is concealed by the earth.\nIt is produced in hidden places,\nyet its brilliance is concealed.\n\nThe elixir residing in the crucible\nis like a ruler on the throne—\nwhen officials fulfill their duties,\nthe realm is at peace.\nFire and medicinal substances\neach find their proper use.\n\nIn the first revolution,\nthe elixir is produced in the east and descends to the west.\nWith the heart as the handle of the *dòu* (斗),\nit turns the mechanism.\nThus, after moving twenty degrees,\nthe *pò* (魄) is full,\nand after turning another twenty degrees,\nthe *hún* (魂) is full.\nThen the fire’s *hún* and the water’s *pò* stand firm,\nand the *shen*’s power is great.\n\nThe other revolutions follow similarly—\ntake the essentials to enlighten the student.\n\nIt is said:\n\n「The *dòu* (斗) and its handle mark the four seasons,\nand all eight nodes proceed in harmony.\n\nThe *dòu*’s handle stands firm and upright,\nwhile the ladle (*kuí* 杓) shifts on its own.\nJust keep both eyes bright and clear,\nas the upper and lower exchange their use.\n\nSeek stillness in your practice,\ndo not rush in the midst of chaos.\nRefrain from seeking form to show to others—\nlet the *qi* circulate freely, returning to its original abode.\n\nWhat need is there to reverse the elixir’s success?\nThe supreme Dao is inherently simple—\nfools create their own complications.\n\nI was fortunate to meet a master and receive transmission,\nwith three admonitions to keep its secrets profound.\nWhy then do you expose every detail,\nrevealing even the minutest truths to startle the spirits?\n\nAh! The underworld does not imprison those who transmit the Way—\nthe teachings endure in the *sūtra* (经), through the three *tī* (师) of liberation.\n\nSequential secret techniques:\nSit in stillness, strike the stubborn void.\nSuppress the breath, guard the moment of your own birth.\n\nWhen the *qi* surges in response to the command,\nawait its movement, then proceed as follows:\nStore and return,\nthen enter the upper two orifices,\nand surge straight toward the five *xīng* (星).\n\nWhen the earth is perceived,\nrelease the stillness, then observe the heart.\nAfter a pause, when perception returns,\nthe true *yáng* (阳) *qi* of the elixir manifests.\n\nHarvest and merge the essences,\ncontinuously as if preserving life.\nWhen the small light penetrates,\nuse the mechanism for entry and exit,\nopening the Dao once before proceeding to *zǐwǔ* (子午).\n\nWhen the great light penetrates,\nuse the mechanism for entry and exit,\nbreaking the top once.\nThis is the later ascent and earlier descent,\nand thereafter it pertains to the tail and five *xīng* (星).\n\nAt thirty days, the light appears—\nuse the mechanism for entry and exit.\nGenerally, three encounters with the full moon,\naround seventy days, will reveal the mechanism.\nIf the waning moon’s count suffices,\njust lower the dark crucible,\nuse the mechanism internally,\nand then face heaven directly.\n\nReturn to the *Tàihé* (太和) to attain the *Tàijí* (太极).\nReturn to the *Tàijí* (太极) to attain the *Wújí* (无极).\n\n*Pǐ* (否) and *Tài* (泰) alternate—\nthe mechanism of motion and stillness:\nwhen *qi* is strong, subdue it with stillness;\nwhen *qi* is weak, assist it with intent.\n\nFire’s secret techniques:\nWhen the elixir resides in the crucible,\nwater above and fire below.\nThe heart’s movement belongs to fire,\nstillness to water—thus the *water crucible* (水鼎).\n\n○Stillness belongs to water,\nmovement to fire—thus the *fire crucible* (火鼎).\nWhen *yáng* (阳) is in the crucible below,\nit is the water crucible.\nWhen it ascends to the crucible above,\nit is the fire crucible.\n\nThe external furnace is *yáng* fire,\nand when the external furnace ignites,\nstore it in the *qì xuē* (气穴).\nThe *Huángtíng* (黄庭) lies directly above the *qì xuē*,\nand the *qì xuē* is the internal furnace.\nWhen the internal furnace holds fire,\nkeep it near the crucible for constant cooking—\nthis is the continuous preservation.\n\nIf fire grows too strong below,\ndo not sit.\nAt the hours of *zǐ* (子) and *wǔ* (午),\nadvance fire at *wǔ* (午), advance water at *zǐ* (子).\nWhen *yáng* (阳) arises,\ndo not concern yourself with the heart—\ninstead, guide it with intent,\nturn it back to the right,\nand descend it to the left,\nstoring it in the crucible.\nThe opposite is true—then advance fire.\n\nSomeone asked:\n“May I dare ask about the nine revolutions’ work?”」\n\nIt is said: “The fire regimen of the ninth revolution occurs in the third month.”\n\n**First Revolution:**\nAt first, from the sides of the ribs, left and right,\nstore it as the Fire Dao.\nFrom the *yáng gōng* (阳宫), beginning at the right side,\nit reaches the shoulder, crosses horizontally over the center, and congeals there,\nthen returns from the left side to descend.\nPreserve it continuously, as if it were always there—\none should remain tranquil, not move,\nproceed slowly, not hastily.\nIt is said: “Fanning the fire too vigorously harms the elixir.”\nThis is the daily work at the *zǐ* (子) hour.\n\n**Second Revolution:**\nFrom the rib’s edge, advance by one *cùn* (寸) and two *fēn* (分),\nemploying the same method.\nThis is the work at the *chǒu* (丑) hour.\n\n**Third Revolution:**\nFrom the white ribs’ edge, advance by five *fēn*,\nemploying the same method as before.\nThis is the work at the *yín* (寅) hour.\n\n**Bathing in Fire:**\nAt the *mǎo* (卯) hour, when fire rises,\ntake the elixir, four *cùn* in measure,\nwith two threads, and cease to call it the Fire Dao.\nThe pulse penetrates the crucible, hence fire rises—\ndo not use the eyes, do not use the heart,\nbut with intent, guide it to the right, turning.\nTake it horizontally to align with the crucible,\nnow the threads rest upon the earth.\nThen, suppress the fire greatly,\nand let it return as water to the crucible.\nThe elixir follows the bathing in fire,\ncontinuously preserved, as if always there.\n\n**Fourth Revolution:**\nAdvance by one *cùn*,\nemploying the same method as before.\nThis is the work at the *chén* (辰) hour.\n\n**Fifth Revolution:**\nAdvance by five *fēn*,\nemploying the same method as before.\nThis is the work at the *wèi* (巳) hour.\n\n**Sixth Revolution (Drawing and Adding):**\nAdvance by five *fēn*—\nfire from below, along with the *wǔ* (午) hour’s heart fire and top fire, both flourish,\nso when *yáng* (阳) arises,\nsuppress it slightly—this is drawing.\nWhen it arises again, the fire grows faint.\nAscending straight from the left and crossing horizontally,\nit just meets the heart.\nThen, encountering the heart fire, descend together to the right—\nif the descending fire is not drawn.\nWhen it meets the heart fire above.\n\n**Seventh Revolution:**\nPass five *fēn*,\nemploying the same method as before.\nThis is the work at the *wèi* (未) hour.\n\n**Eighth Revolution:**\nProceed with left descending and right ascending,\ntaking the elixir’s measure as one *cùn*.\nThe Fire Dao of the *wèi* hour is all the Yin Dao.\nFire’s strength wanes after its peak,\nreaching the *shēn* (申) hour—also the Yin Dao.\nThere is nothing else:\nThe Dao above the heart is the Yang Dao;\nThe Dao below the heart is the Yin Dao.\nFire at both hours arises from the Yin—\nuntil the *yǒu* (酉) hour, when it begins.\nGold flourishes.\nHence, remain still and await it—\nfire becomes the liquid of gold and returns to the crucible,\nand the elixir follows the bathing in fire.\nBathing in fire at the *mǎo* hour is to add mercury,\nbathing in fire at the *yǒu* hour is to add lead.\n\n**Ninth Revolution:**\nTake the golden elixir, five *fēn* only,\nusing it swiftly and then stabilizing to await.\n\n**Tenth Revolution:**\nUse the *xùn* (巽) wind to ignite fire,\nemploying the method of circulating fire,\nreferring to the diagram of the fire regimen.\n\nThe bristle’s tip of autumn’s hair—\nthe totality of the Great Universe—\nthis is the **Shen** (神).\n\nThe movement of the One Primordial (元) source,\nforming the shapes of myriad things—\nthis is the **qi** (氣).\n\nThe essence of the Soul’s fountain (靈源),\nmoistening the dews of the Eight Desolations (八荒)—\nthis is the **jing** (精).\n\nWhen the Three Primordials (三元) blend and return,\nlife and death transform in cycles,\nand when One Pole (一极) stands, it reverses,\nreturning to its root and restoring the Primordial—\nthis is the **Miao** (妙) of the **Tianjun** (天君).\n\nThe **Tianjun** (天君) is none other than the **heart** (心).\n\nThe book of *Yùqīng Jīnlì Bǎozhuàn* (玉清金笥寶篆) and *Jīnbǎo Nèiliàn Dānjué* (金寶內煉丹訣),\nthis is the **Shenwén** (神文) of the **Qīnghuá Jūn** (青華君),\nthe key to the *Wùzhēn Piān* (悟真篇),\nand the **Xīnyuán** (心傳) of **Zhāng Zǐyáng** (張紫陽),\nwho exposed the mysteries of the **Xīnyuán** (玄露).\n\nRecite it, and you grasp it in the **heart** (心),\nforgetting the **heart** (心),\ngrasp it in the **Shen** (神),\nforgetting the **Shen** (神),\ngrasp it in the **Tàixū** (太虚).\n\nIt is the **Lǐng** (領) of the Three Luminaries (三光),\nthe **Gāng** (纲) of the Five **Qi** (五氣).\n\nIt can die and can be reborn,\ncan be nothing and can be everything.\n\nIt contains the **virtue** (德) of the **Chìzǐ** (赤子),\ngoverning the **Yì** (宜) of the Ten Thousand Transformations (万化).\n\nThe **Miao** (妙) of **preheaven** (先天) and **preearth** (先地) is preserved here.\n\nThis **Miao** (妙) is such that:\nthe will does not stray to things,\nthe form does not age in the mortal realm.\n\nIt transcends the **land** (地) of death and rebirth,\npenetrating the **mechanism** (机) unknown even to **ghosts and gods** (鬼神).\n\nThe essence of this **Shenwén** (斯文)! Hence, the **postscript** (跋).",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上青华秘文 序 远师真人正邦叔，不知何许人也。 时年十九，侍紫阳真人为弟子。 见九年，不知大道之自然，亦不请问。 一日侍师至罗浮观，先生曰：“子之从我，不为不久。 于金丹之诀，略不顾及，然而从我何为？ ” 邦叔再拜，曰； “非不顾世，自揣玄微，必无此分。 ” 先生曰：“善！ 自太极既分之后，一点灵光，人人有之。 贤者不加多，愚者不减少。 似子所言，是蔽其明也。 吁！ 可哀也哉！ ” 邦叔不觉涕泗交颐，顿首百拜，悲不能起。 先生曰：“子去静室中，思吾此语，有所觉则急来。 ” 邦叔拜辞，逐去幽房静室中静思。 至夜，紫阳先生再诣其室坐处，叩寝门。 邦叔闻之，移而出迎。 先生微笑曰：“吾一寻汝，便见头目。 尔两日寻他，不得其有然。 ”遂灭所执之烛炀而退。",
      "translated_text": "**Translation:**\n\n*\"Preface to the Secret Texts of Qinghua*\n\nFar Master Zhengbang Shū, I know not whence he came. At nineteen years of age, he served as a disciple under the Purple Sage Master. For nine years, he neither comprehended the natural Dao nor sought inquiry. One day, as he attended his teacher at the Luofu Monastery, the Sage said:\n\n‘Thy following of me shall not endure long. Though thou dost not regard the secrets of the Golden Elixir, nor inquire into them, yet why dost thou follow me?’\n\nZhengbang Shū bowed twice in reply, saying: ‘’Tis not that I disregard the world, but in self-assessment, I find my grasp of the profound mysteries lacking—thus, I possess no such merit.’\n\nThe Sage then spoke: ‘’Tis well! Since the division of the Great Ultimate, a single point of luminous essence exists in all. The virtuous gain no more, the foolish lose no less. Thy words suggest thou dost veil thine own brightness. Alas! ’Tis pitiable indeed!’\n\nZhengbang Shū, overcome, wept with tears and saliva streaming, prostrated himself a hundred times, and could not rise from his sorrow.\n\nThe Sage said: ‘Depart to the quiet chamber and ponder my words. If thou dost gain any insight, come swiftly.’\n\nZhengbang Shū bowed and took leave, then sought the secluded, silent chamber to reflect in solitude. That night, the Purple Sage Master again came to his chamber, where he sat, and knocked upon the door.\n\nZhengbang Shū heard the sound and, rising, went forth to greet him. The Sage smiled faintly and said:\n\n‘I sought thee once, and thy head and eyes were revealed. Yet thou hast sought him these two days, and dost not perceive his true nature.’\n\nThereupon, he extinguished the candle he held and withdrew.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 332,
      "start_sentence": 0,
      "end_sentence": 26,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 5.136802911758423,
      "metadata": {
        "source_file": "dao\\藏外\\青华秘文.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "邦叔大窘，坐五鼓，大悟，通体汗流。 待旦以颂呈先生：“月照长江风浪息，鱼龙遁迹水太平。 个中谁唱真仙子，声满座空万籁清。 ” 先生览之，问曰：“谁唱难听？ ” 都叔遂答以诗曰：“莫问谁，莫问谁。 一声高了一声低。 阿谁唱，阿谁听。 横竖大千说不尽。 先生有意度迷徒，急撞灵台安宝镜。 镜明澄静万缘空，百万丝条处处通。 斗转星移人睡定，觉来红日正当中。 ” 先生逐出金丹图传与邦叔，遂止罗浮，后十三年坐化。 又十年，眉山大伪和尚沈志静遇封山，自称王邦叔，今居蓬莱望海楼也。 表奏 不避雷钺之诛，辄伸卑渎念。",
      "translated_text": "「邦叔深感困惑，坐至五更时分，顿悟豁然，全身汗流如雨。\n\n待至天明，他以颂歌呈献先生：\n*\"月照长江风浪息，鱼龙遁迹水太平。\n个中谁唱真仙子，声满座空万籁清.\"*\n\n先生观毕，问曰：\"谁唱*难听*？\"\n都叔遂以诗答曰：\n*\"莫问谁，莫问谁。\n一聲高，一聲低。\n阿誰唱，阿誰听。\n横竖大千*说不尽*。\n先生有意度迷徒，急撞灵台安宝镜。\n镜明澄静万缘空，百万丝条处处通。\n斗转星移人睡定，觉来红日正当中.\"*\n\n先生遂取出*金丹图*，传授与邦叔，都叔乃停止罗浮山修行，后十三年*坐化*而去。\n\n又十年，眉山大伪和尚沈志静遭遇封山禁令，自称王邦叔，今居蓬莱望海楼也。\n\n表奏不避雷钺之诛，辄伸卑渎念。」",
      "overlap_context": "g Shū bowed and took leave, then sought the secluded, silent chamber to reflect in solitude. That night, the Purple Sage Master again came to his chamber, where he sat, and knocked upon the door.\n\nZhengbang Shū heard the sound and, rising, went forth to greet him. The Sage smiled faintly and said:\n\n‘I sought thee once, and thy head and eyes were revealed. Yet thou hast sought him these two days, and dost not perceive his true nature.’\n\nThereupon, he extinguished the candle he held and withdrew.\"",
      "start_char": 334,
      "end_char": 595,
      "start_sentence": 27,
      "end_sentence": 44,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 4.090136528015137,
      "metadata": {
        "source_file": "dao\\藏外\\青华秘文.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "臣处世多虑，无有所为，为必颠踬。 年迈三旬，独于大道有缘焉。 回思穹苍，昔日使我无成者，正祜今日之有成也。 感恩至重，铭心戴德，今者切见。 嘉尔下民，孰无道器？ 奔劳尘境，戕伐一元。 愈降愈下，弃人就物。 就物思人，则不可得而返之矣。 物不能修，终乎异类。 哀哉！ 臣之身自弗能度，反怜及此，固无异泥中蛙，而哂篱上鸡也。 唯某昨传受青华真人《玉清金笥长生度世金宝内炼丹诀》，简而易行，详而不杂。 身裹分阴阳之主，壶中立四象之枢。 三中常守以为机，一定不离而作用。",
      "translated_text": "The subject, in this world, has ever been burdened by excessive thought, yet achieves nothing—when he acts, he stumbles. At thirty years of age, he alone encountered the Dao/Way.\n\nReflecting upon the boundless heavens, what once hindered my fulfillment was precisely the blessing that now grants it. Gratitude weighs heavily, etched upon the heart, now vividly perceived.\n\nO noble commoners, who lacks the vessel of the Dao/Way? In toil through dusty realms, they ravage the One Primordial. The lower they descend, the more they abandon humanity for things. Seeking things yet longing for humanity, they cannot return—it is beyond reach.\n\nThings cannot be cultivated; in the end, they become alien to their kind. Alas!\n\nMy own body I cannot even measure, yet I pity this state—how different am I from the frog in the mud, laughing at the hen in the cage?\n\nOnly yesterday, I received from Qinghua Zhenren the *Yuqing Jinxi Longsheng Dushijinbao Neilian Dandie*—concise yet practical, detailed yet uncluttered. Within the body, the Master of Yin-Yang is enfolded; in the vessel, the Axle of the Four Symbols stands firm. Ever guard the Three Centers as the mechanism; steadfast, unyielding, yet ever in motion.",
      "overlap_context": "「邦叔深感困惑，坐至五更时分，顿悟豁然，全身汗流如雨。\n\n待至天明，他以颂歌呈献先生：\n*\"月照长江风浪息，鱼龙遁迹水太平。\n个中谁唱真仙子，声满座空万籁清.\"*\n\n先生观毕，问曰：\"谁唱*难听*？\"\n都叔遂以诗答曰：\n*\"莫问谁，莫问谁。\n一聲高，一聲低。\n阿誰唱，阿誰听。\n横竖大千*说不尽*。\n先生有意度迷徒，急撞灵台安宝镜。\n镜明澄静万缘空，百万丝条处处通。\n斗转星移人睡定，觉来红日正当中.\"*\n\n先生遂取出*金丹图*，传授与邦叔，都叔乃停止罗浮山修行，后十三年*坐化*而去。\n\n又十年，眉山大伪和尚沈志静遭遇封山禁令，自称王邦叔，今居蓬莱望海楼也。\n\n表奏不避雷钺之诛，辄伸卑渎念。」",
      "start_char": 597,
      "end_char": 821,
      "start_sentence": 45,
      "end_sentence": 58,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 3.5843288898468018,
      "metadata": {
        "source_file": "dao\\藏外\\青华秘文.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "用中无用，静裹常存。 哲人秀士，一览无遗，造化在掌中矣。 今欲斋沐精思，着为图论。 毫发无隐，直泄至真之奥首。 择其可传者而传之，得接续心灯，流传万世，顾美事也。 然始传之际，誓语至严。 蒙师至嘱，轻泄犯刑。 数欲作而踟蹰，勿记其几矣。 伏惟太上好生，度人为重。 是用俯伏尘埃，冥心上界。 欲望天慈鉴臣之意，若不允而立彰玄遣。 如或谅容，俾臣安静，庶几敢践斯言，复陈天陛：臣无任诚惶诚恐，顿首百拜，怀恩之至。 臣迩者表奏天廷，欲将青华真人《玉清金笥长生度世金宝内炼丹决》秘旨画图立论，传诸缘士。 俯伏茅庐，恭伺天罚，逾三旬焉。 今不至，始敢斋沐焚香，精思着述。",
      "translated_text": "「Within the use, there is non-use; within stillness, the constant presence.\nThe sagely and virtuous scholar, with one glance, sees all without remainder—creation and transformation lie within his grasp.\n\nNow, I wish to fast and purify my thoughts, earnestly pondering to compose diagrams and treatises.\nNot a hair shall be concealed; I will reveal the deepest secrets of the utmost truth.\nSelecting what may be transmitted, I pass it on, hoping to inherit the heart-lamp of the Dao/Way and let its light flow through the ten thousand ages—truly a noble deed!\n\nYet at the outset of transmission, the oaths were most stern.\nMy teacher charged me with utmost gravity: \"Lightly reveal, and you shall incur punishment.\"\nI have often desired to act but hesitated, lest I forget the warning.\n\nI humbly beseech the Celestial Sovereign’s compassion for life, for saving beings is His greatest virtue.\nThus, I kneel in dust, my heart ascending to the highest realm.\nI pray for Heaven’s grace to discern my sincerity, lest my actions be exposed as dark and obscure.\n\nIf Heaven deigns to pardon and grant me peace,\nthen perhaps I dare to fulfill this promise and once more lay my words before the Celestial Throne:\nWith deepest reverence and trembling, I kneel and pay homage, my gratitude boundless.\nRecently, I petitioned the Heavenly Court, intending to depict the secret precepts of Qinghua Zhenren’s *Yuqing Jinxi Longsheng Dushijinbao Neilian Dandie*—the *Dao/Way of Internal Alchemy for Nurturing Life and Transcending the World*—and establish their principles for those with affinity.\n\nProstrate before my humble dwelling, I await Heaven’s judgment in fear.\nMore than three decades have passed since then.\nNow, as no retribution has come, I venture to fast, burn incense, and focus my mind to set these words in order.»",
      "overlap_context": "ind. Alas!\n\nMy own body I cannot even measure, yet I pity this state—how different am I from the frog in the mud, laughing at the hen in the cage?\n\nOnly yesterday, I received from Qinghua Zhenren the *Yuqing Jinxi Longsheng Dushijinbao Neilian Dandie*—concise yet practical, detailed yet uncluttered. Within the body, the Master of Yin-Yang is enfolded; in the vessel, the Axle of the Four Symbols stands firm. Ever guard the Three Centers as the mechanism; steadfast, unyielding, yet ever in motion.",
      "start_char": 821,
      "end_char": 1099,
      "start_sentence": 59,
      "end_sentence": 73,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 5.059281826019287,
      "metadata": {
        "source_file": "dao\\藏外\\青华秘文.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "三日而成，秘诸法笥，以待贤者。 谨录上奏，伏望天慈俯垂赦宥，伏冀人人依此炼成金宝，超出尘埃。 世世相传，无有泄慢。 臣无任诚惶诚恐，顿首百拜以闻。 金丹图论序 吾自识金丹秘诀之后，累获罪于天而不自悛。 又为玄书，并《悟真篇》等行于世，自心为至矣。 忽有客至访，余怪其状貌非凡，静肃待之。 或问曰：“子于金丹之道，训人亦至矣。 但首尾未明，机关尚隐，后学何以为识？ ” “余自此亦不得已矣！ 天机至重，玄律至严。 子固美言，某敢不奉。 ”",
      "translated_text": "*«In three days, I concealed the teachings within the sacred Daoist repository, awaiting the worthy.\n\nWith utmost reverence, I record and submit this to the Celestial Throne, humbly hoping that Heaven’s mercy may descend and pardon me, and that all may follow these precepts to refine the *golden treasure* (金宝) and transcend the dusty realm (尘埃).\n\nPassing them down through generations, I dare not let them be revealed or belittled.\n\nWith deepest sincerity and trembling fear, I kneel and pay homage, my gratitude boundless, to lay this before the Throne.\n\n**Prelude to the Golden Treasure Diagram and Treatise (金丹图论序):**\nSince I first came to know the secret precepts of the *Golden Treasure* (金丹), I have repeatedly incurred Heaven’s wrath yet failed to repent.\n\nMoreover, I have allowed the *Mysterious Scriptures* (玄书)—including the *Awakening to the True* (悟真篇)—to circulate in the world, for my own heart has deemed them supreme.\n\nSuddenly, a visitor arrived to call upon me. I marveled at his extraordinary bearing, and in solemn stillness, I received him.\n\nHe inquired: “Master, your instruction in the Dao/Way of the Golden Treasure (金丹之道) is indeed profound. Yet its beginning and end remain unclear, and its subtleties still concealed—how shall later disciples recognize its essence?”\n\nI replied: “I too am compelled by necessity! Heaven’s mysteries are most weighty, its sacred laws most strict. You speak well—how dare I not comply with your words?”»",
      "overlap_context": " Heavenly Court, intending to depict the secret precepts of Qinghua Zhenren’s *Yuqing Jinxi Longsheng Dushijinbao Neilian Dandie*—the *Dao/Way of Internal Alchemy for Nurturing Life and Transcending the World*—and establish their principles for those with affinity.\n\nProstrate before my humble dwelling, I await Heaven’s judgment in fear.\nMore than three decades have passed since then.\nNow, as no retribution has come, I venture to fast, burn incense, and focus my mind to set these words in order.»",
      "start_char": 1099,
      "end_char": 1320,
      "start_sentence": 74,
      "end_sentence": 88,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 4.400418996810913,
      "metadata": {
        "source_file": "dao\\藏外\\青华秘文.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "曰：“子但着为一书，尽底泄露，苟有谴焉，某当其责。 ” 余再拜敬服，遂失所在。 余思此语，故着是书。 天机泄则泄矣！ 传之者，当以至宝拜受，以有玄律焉。 泄慢堕地狱，祸及七祖翁。 心为君论 心者，神之舍也。 心者众妙之理，而宰万物。 性在乎是，命在乎是。 若夫学道之上，先须了得这一个字，其余皆后段事矣。 故为之传。 张子野人，身披百衲。 自成都归于故山，筑室于山青水绿之中。 万物罄然，而怡怡然若有所得。 客传于市曰：“遭贬张平叔，归于山矣。 ” 从游之士，丛然而至。",
      "translated_text": "The guest said: *“You need only commit this to writing, fully revealing its depths. Should there be censure, I shall bear the blame.”*\n\nI bowed twice in reverence and respect, then lost track of his whereabouts.\n\nReflecting on his words, I thus wrote this book. The Dao’s mysteries, once revealed, are revealed! Those who pass it on must receive it as a supreme treasure, for it holds the sacred laws. To leak or neglect it invites the hell of retribution, dooming seven generations of ancestors.\n\n**On the Heart**\nThe heart is the dwelling of the spirit.\nThe heart is the principle of all subtleties, governing all things.\nNature resides within it; life depends upon it.\nFor those who seek the Dao, one must first grasp this single character—all else follows thereafter.\nThus, I transmit it.\n\nZhang, the Wild Man, clad in patched robes,\nReturned from Chengdu to his mountain home,\nBuilding his dwelling amid green hills and flowing waters.\nAll things exhausted, yet he remained serene, as if in possession.\nNews spread through the marketplace:\n*“Zhang Ping-shu, once exiled, has returned to the mountains.”*\nDisciples flocked to him in crowds.",
      "overlap_context": "d to call upon me. I marveled at his extraordinary bearing, and in solemn stillness, I received him.\n\nHe inquired: “Master, your instruction in the Dao/Way of the Golden Treasure (金丹之道) is indeed profound. Yet its beginning and end remain unclear, and its subtleties still concealed—how shall later disciples recognize its essence?”\n\nI replied: “I too am compelled by necessity! Heaven’s mysteries are most weighty, its sacred laws most strict. You speak well—how dare I not comply with your words?”»",
      "start_char": 1321,
      "end_char": 1572,
      "start_sentence": 89,
      "end_sentence": 107,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 4.454941272735596,
      "metadata": {
        "source_file": "dao\\藏外\\青华秘文.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "立于庭，且泣且拜曰：“先生固无恙乎？ 且夫奔涉山川，逾越险阻者，于兹十年。 面貌不少衰、形不少疲者，其有术乎？ ” 张子曰：“吁！ 吾与汝言。 人之所以憔悴枯槁者，谁使之然？ 心也。 百事集之，一念末已，一念续之。 尽日之中，全无顷暇。 宵之寐也，则亦若无心焉，但神不存矣。 吾本无他术焉，为能定心。 故夫神鬼之所以测度者，吾心之有念耳，心无念，则神之灵不可得而知也。 岂神不知吾心，吾亦自不知其为心，乃定之根本也。 ” 弟子曰：“然则金丹之士，其静心乎？ 勿静心乎？ ” 日：“静之一字，能静，则金丹可坐而致也，但难耳！ ” 日：“夫子之言，其误后学多矣！",
      "translated_text": "A disciple stood in the courtyard, weeping and bowing:\n*\"Master, are you truly unharmed?*\n*For ten years now, I have traversed mountains and rivers, crossed perils and obstacles—*\n*Yet my face shows no decay, my form no weariness. Is this some art?\"*\n\nZhang replied:\n*\"Ah! Let me speak to you.*\n*What makes men wither and decay?*\n*The heart. A hundred affairs converge upon it; one thought fades, another takes its place.*\n*All day long, there is no respite.*\n*Even in sleep, it seems as if the heart rests—but the spirit is gone.*\n*I have no other art; only this: to still the heart.*\n*Thus, what spirits and ghosts measure is but the heart’s thoughts.*\n*When the heart has no thoughts, the spirit’s clarity cannot be known.*\n*Is it that the spirit does not know the heart?*\n*Or that I myself do not know what the heart is?*\n*This is the root of stillness.\"*\n\nThe disciple asked:\n*\"Then do alchemists of the Golden Elixir—*\n*must they still the heart?*\n*Or not still the heart?\"*\n\nZhang said:\n*\"The word ‘stillness’—if one can truly still it, then the Golden Elixir may be attained while seated.*\n*But it is difficult!\"*\n\nThe disciple said:\n*\"Your words will mislead many who follow later!\"*",
      "overlap_context": "n it; life depends upon it.\nFor those who seek the Dao, one must first grasp this single character—all else follows thereafter.\nThus, I transmit it.\n\nZhang, the Wild Man, clad in patched robes,\nReturned from Chengdu to his mountain home,\nBuilding his dwelling amid green hills and flowing waters.\nAll things exhausted, yet he remained serene, as if in possession.\nNews spread through the marketplace:\n*“Zhang Ping-shu, once exiled, has returned to the mountains.”*\nDisciples flocked to him in crowds.",
      "start_char": 1572,
      "end_char": 1847,
      "start_sentence": 108,
      "end_sentence": 128,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 2.7430810928344727,
      "metadata": {
        "source_file": "dao\\藏外\\青华秘文.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "” 张子矍然而请其旨。 曰：“夫子与人言金丹之道，常使人心中生意。 心意为造化之主，心其能静乎？ ” 曰：“子见偏耳，非吾言之所误也。 君寻其平日用心，为何而动？ 寂然不动，感而逐通，乃吾心之用也。 奔役天涯，了无居止，子之用心也。 “夫斗极之北辰，固未始动。 其所以为动者，拱辰之星耳。 然拱辰之星，故不能不动。 其所以动者，辰为之枢而运之耳。 “唯其不动之中，而有所谓动者，丹士之用心也。 唯其动之中，而存不动者，仁者之用心也。 于不动之中，终于不动者，土木之类也。 “心居于中，而两目属之、两肾属之、三窍属之，皆未可尽其妙用。 其所以为妙用者，但神服其令，气服其窍，精从其召。 神服其令者，心勿驰于外，则神反藏于内。 气服其窍者，心和则气和，气和则形和，形和则天地之和应矣。 故盛喜怒而气逆者，喜怒生乎心也。 精从其召者，如男女媾形而精荡，亦心使之然也。 心清即念清，念清则精止。 吁！ 心惟静则不外驰，心惟静则和，心惟静则清。 一言以蔽之，曰：静，精、气、神始得而用矣。 “精、气、神之所以为用者，心静极则生动也。 非平昔之所谓动也，用精、气、神于内之动也。 精固精，气固气，神亦可谓性之基也。 “性则性，而基言之，何也？ 盖心静则神全，神全则性现。 又一言以蔽之，曰：静。 “其所以为静者，盖亦有理。 顺水行舟，滔滔腾拔。 欲往海岛，不日劳形。 一旦回家，思乡安静。 急驾归帆，求民逆返。 还家固静之道，但久违而始复，久失而始寻，一旦欲静其可得乎？ 当思归静之由，然后能静。 此悟昨非，当求今是。 非固常为，是在何处？ ” 诗曰：自下金梯堕碧崖，回思阎苑几花开。 向来大道今何在？ 野草不除荆棘堆。 口诀：但于—念妄生之际，思平日心不得静者，此为便耳。 急舍之，久久纯熟，则自静矣。 夫妄念莫大于喜怒，怒里回思，则不怒； 喜中知抑，则不喜。 种种皆然，久而自静，岂独坐时？ 然平日提百万强兵，但事至则理，退则休，亦可为静之本。 以此静心应接事物，谁云误事？ 实自灵耳。 故日，以事炼心，情无他用。 镜能察形，不差毫发，形去而镜自镜。 盖事至而应之，事去而心自心也。 口诀中口诀：心不留事。 一静可期。 此便是觅静底路． 又诗曰：得路欲归休问远，看看信步莫烦心。 云收将放金乌见，一点灵光眼内明。 心之所以不能静者，不可纯谓之心。 盖神亦役心，心亦役神。 二者交相役，而欲念生焉。 心求静，必先制服。 眼者，神游之宅也。 神游于眼，而役于心。 故抑之于眼，而使之归于心，则心静而神亦静矣。 目不乱视，神返于心。 神返于心，乃静之本。 神为主论 心为君者，喻乎人君之在位。 一人有庆，兆民赖之。 秦皇、汉武为之，则四海疮痍。 尧、舜、禹、汤为之，则天下安逸，民歌太平者。 何也？ 圣人以无为而治天下，则天下安肃。 庸人以有为而治天下，则天下扰乱。 盖心者君之位也，以无为临之，则其所以动者，元神之性耳。 以有为临之，则其所以动者，欲念之性耳。 有为者，日用之心； 无为者，金丹之用心也。 以有为返乎无为，然后以无为而莅正事，金丹之入门也。 夫神者，有元神焉，有欲神焉。",
      "translated_text": "The disciple Zhang rose and asked for his meaning, saying:\n\n*\"Master, when you speak of the Dao of the Golden Elixir to others,\nit often makes their hearts restless with intent.\nFor the heart is the sovereign of transformation*—\n*how could it ever be still?\"*\n\nZhang replied:\n*\"You see only one side, not my words’ true intent.\nExamine your daily thoughts—\nwhat causes them to stir?\nWhen they rest unmoving, yet respond and flow in harmony,\nthat is the heart’s true function.\nYour thoughts race to the ends of the earth,\nwith no place to settle—\nthat is your heart’s habit.\n\n\"The North Star (Pole Star) never moves in truth.\nWhat seems to move is the encircling stars about it.\nYet those encircling stars cannot but move,\nfor the Pole Star is their pivot, turning them.\n\n\"Only within stillness does movement arise—\nthat is the alchemist’s heart.\nOnly within movement does stillness dwell—\nthat is the benevolent sage’s heart.\nTo remain forever still within stillness\nis the nature of earth and wood.\n\n\"The heart dwells within,\nwhile the two eyes, the two kidneys, and the three orifices* belong to it—\nyet none can fully exhaust its wondrous function.\nWhen the wondrous function manifests,\nit is because the spirit obeys its commands,\nthe qi submits to its openings,\nand the essence follows its summons.\nWhen the spirit obeys its commands,\nthe heart must not stray outward,\nso the spirit returns and hides within.\nWhen the qi submits to its openings,\nthe heart’s harmony brings the qi’s harmony,\nthe qi’s harmony brings the body’s harmony,\nand the body’s harmony mirrors the harmony of heaven and earth.\nThus, those who indulge in extreme joy and anger,\nwhose qi runs counter—\njoy and anger spring from the heart.\nWhen the essence follows its summons,\nas when a man and woman unite in form and the essence surges,\nthat too is the heart’s doing.\nThe heart is clear, then the thoughts are clear;\nthe thoughts are clear, then the essence ceases.\nAh!\nOnly when the heart is still does it not stray outward;\nonly when the heart is still does it find harmony;\nonly when the heart is still does it become clear.\nIn one word: **stillness**—\nthen essence, qi, and spirit may be used as they should.\n\n\"Essence is essence, qi is qi,\nand spirit may be called the foundation of nature*.\nWhy speak of it as a foundation?\nFor when the heart is still, the spirit is complete,\nand when the spirit is complete, nature* reveals itself.\nIn one word again: **stillness**.\n\n\"But how does one attain stillness?\nConsider water flowing with the boat—\nswift and surging, boundless.\nTo reach distant islands, one must labor daily.\nYet when one suddenly turns homeward,\nthinking of peace and quiet in the village,\nthe sail is quickly raised,\nthe people hasten to return.\nHome is the true path of stillness,\nbut after long neglect, how can it be regained?\nAfter long loss, how can it be found?\nWhere is the great Dao now?\nWild grass grows unchecked, thorns pile high.\nThe heart cannot be still—\nis it truly the heart?\nFor the spirit enslaves the heart,\nand the heart enslaves the spirit.\nThe two enslave each other,\nand then the desires arise.\nTo seek stillness, one must first master them.\nThe eyes are the dwelling of the spirit’s roaming*.\nWhen the spirit roams in the eyes,\nit is enslaved by the heart.\nThus, restrain it in the eyes\nand guide it back to the heart,\nthen the heart will be still and the spirit too.\nDo not let the eyes wander recklessly,\nthen the spirit returns to the heart.\nThe spirit returning to the heart—\nthat is the root of stillness.\"*\n\n**On the Spirit as Sovereign:**\n*\"The heart as ruler*—\nlike a sovereign on the throne.\nOne man’s joy brings relief to all the people.\nIf the Qin Emperor or Han Wu rule this way,\nthe four seas become a wasteland.\nIf Yao, Shun, Yu, or Tang rule this way,\nthe world finds peace and ease,\nthe people sing of great harmony.\nWhy?\nThe sage rules with *wuwei* (non-action),\nand the world is tranquil and reverent.\nThe mediocre ruler acts with *youwei* (action),\nand the world is in chaos.\nThe heart is the ruler’s throne—\nwhen governed with non-action,\nwhat moves it is the original spirit’s nature*.\nWhen ruled with action,\nwhat moves it is the desires’ nature.\nAction is the heart of daily life;\nnon-action is the heart of Golden Elixir practice.\nTo turn from action to non-action,\nthen govern affairs with non-action—\nthat is the Golden Elixir’s gateway.\n\n\"For the spirit has two forms:\nthe original spirit and the spirit of desire.\"",
      "overlap_context": "spirit’s clarity cannot be known.*\n*Is it that the spirit does not know the heart?*\n*Or that I myself do not know what the heart is?*\n*This is the root of stillness.\"*\n\nThe disciple asked:\n*\"Then do alchemists of the Golden Elixir—*\n*must they still the heart?*\n*Or not still the heart?\"*\n\nZhang said:\n*\"The word ‘stillness’—if one can truly still it, then the Golden Elixir may be attained while seated.*\n*But it is difficult!\"*\n\nThe disciple said:\n*\"Your words will mislead many who follow later!\"*",
      "start_char": 1847,
      "end_char": 3119,
      "start_sentence": 129,
      "end_sentence": 212,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 12.579270839691162,
      "metadata": {
        "source_file": "dao\\藏外\\青华秘文.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "元神者，乃先天以来一点灵光也。 欲神者，气质之性也。 元神者，先天之性也。 形而后有气质之性，善返之，则天地之性存焉。 自为气质之性，所蔽之后，如云掩月。 气质之性虽定，先天之性则无有。 然元性微而质性彰，如人君之不明，而小人用事以蠹国也。 且父母媾形，而气质具于我矣。 将生之际，而元性始人。 父母以情而育我体，故气质之性每逾物而生情焉。 今则徐徐铲除。 主于气质尽，而本元始见。 本元见，而后可以用事。 无他，百姓日用，乃气质之性胜本元之性。 善返之，则本元之性胜气质之性。 以气质之性而用之，则气亦后天之气也，以本元性而用之，则气乃先天之气也。 气质之性本微，自生以来，日长日盛。 则日用常行，无非气质。 一旦返之矣，自今以往，先天之气纯熟。 日月常行。 无非本体矣。 此得先天制后天，而为之用也。 （余见神室图论） 气为用说 先天气，后天气，得之者，如痴如醉，忘寝失寐。 吁！ 元神见，则元气生。 盖自太极既分，禀得这一点灵光，乃元性也。 元性是何物为之？ 亦气凝而性灵耳。 故元性复而元气生，相感之理也。 元气之生，周流乎身，而独于肾府采而用之者，何也？ 夫肾府路径，直达气穴黄庭者，一也。 肾为精府，精至，直引精华而用之，二也。 周流于他处则难觅，至精府而可识，三也。 心气透肾，意下则直至，采之者易为力，四也。 此四者，故采真阳于肾府。 精从气说 神有元神，气有元气，精得无元精乎？ 盖精依气生。 精实肾宫，而气融之，故随气而升阳为铝者，此也。 精失而元气不生，元阳不见，何益于我哉？ 元神见而元气生，元气生则元精产。 意为媒说 意者岂特为媒而已？ 金丹之道，自始至终，作用不可离也。 意生于心。 然心勿驰于意，则可； 心驰于意，则未矣。 坎离说 饮者，肾官也。 离者，心田也。 坎静属水，乃　　也。 动属火，乃　　也。 离动为火，乃　　也。 静属水，乃～也。 交会之际，心田静而肾府动，得非真阳在下而真阴在上乎？ 况意生乎心，而直下肾府乎？ 阳生于肾，而直升于黄庭乎？ 故曰，坎离颠倒。 若不颠倒而顺行，则心火动而不静，大地火坑之意明矣。 下手功夫 持心论于前，然后参下手功夫于后。 益心始欲静，而欲念未息。 欲念者，气之性所为也。 此性役真性，常切于耳，目次之。 修丹之士，心既无事，则彼固无由而役之矣。 其所以役神者，以外物诱之耳。 静坐之际，先行闭息之道。 闭息者，夫人之息，一息未际，而一息续之。 今则一息既生，而抑后息。 后息受抑，故续之缓缓焉，久而息定。 抑息千万不可动心，动心则逐于息，息未止而心已动矣。 言未既，有笑于旁者曰：“迂哉！ 此叟教人无法。 抑息而又不动心，得非以千钧之物，责负于人，使之不用力，可乎？ ” 曰：“于且听。 吾虽闭息，而又存心，则心不动，而息亦息矣。 ” 又，“此固闭息之道，安保欲念不生乎？ ” 曰：“至于生，则末矣。 念之生也，感物而动耳。 定中觉目有所睹，则神役于目矣，急收而返视。 耳有所听，神役于耳矣，急收而内听。 其他皆然。 ”",
      "translated_text": "The Original Spirit is the innate luminous spark from before heaven and earth were formed. The Spirit of Desire is the nature of the vital *qi* and physical constitution.\n\nThe Original Spirit is the nature of the primordial heaven and earth. Only after the body comes into being does the nature of the vital *qi* and constitution manifest. If one turns back to it skillfully, then the nature of heaven and earth is preserved. If one indulges in the nature of the vital *qi* and constitution, then it obscures the Original Spirit, like clouds covering the moon. Though the nature of the vital *qi* and constitution may be settled, the Original Spirit itself remains ever-present. Yet, when the Original Spirit is faint and the vital *qi* and constitution prevail, it is like a ruler’s ignorance while petty officials govern, thereby harming the state.\n\nMoreover, when parents conceive the form, the vital *qi* and constitution are already complete within me. At the moment of birth, the Original Spirit first enters. Parents nurture my body with affection, so the nature of the vital *qi* and constitution always exceeds the Original Spirit, giving rise to desires.\n\nNow, I gradually eliminate these desires. When the vital *qi* and constitution are exhausted, the Original Spirit alone becomes visible. Once the Original Spirit is revealed, then one can govern affairs. There is no other way: the common people’s daily lives are dominated by the nature of the vital *qi* and constitution, which overpowers the Original Spirit. If one turns back skillfully, then the Original Spirit’s nature overpowers the vital *qi* and constitution. Using the nature of the vital *qi* and constitution, one relies on the *qi* of later heaven and earth. Using the Original Spirit’s nature, one relies on the *qi* of heaven and earth before their formation. The nature of the vital *qi* and constitution is inherently subtle, but from birth onward, it grows ever stronger. Thus, daily affairs are always carried out by the vital *qi* and constitution. Once one turns back to the Original Spirit, from that moment onward, the *qi* of heaven and earth before their formation becomes pure and ripe. The sun and moon move ceaselessly—nothing but the Original Spirit itself.\n\nThis is the attainment of heaven and earth before their formation controlling those after, and using it for governance.\n\n*(As seen in the \"Hall of the Spirit\" Diagram, discussed later)*\nThe *qi* is spoken of in terms of its function.\nThe *qi* of heaven and earth before their formation, the *qi* of heaven and earth after their formation—those who attain it are like the intoxicated or the drunk, forgetting sleep and losing rest. Ah! When the Original Spirit is revealed, the Original *qi* is generated. For once the Great Ultimate is divided, one receives this single point of luminous spark, which is the Original Spirit. What does the Original Spirit consist of? It is the *qi* condensed and the essence refined. Thus, when the Original Spirit is restored, the Original *qi* is generated, following the principle of mutual resonance. When the Original *qi* is generated, it circulates throughout the body, but why is it specifically gathered and utilized in the kidney palace? The kidney palace’s pathways directly reach the *qi* cavity of the Yellow Court—one reason. The kidneys are the palace of essence; when essence is refined, it draws the essence’s essence upward for use—second reason. When it circulates elsewhere, it is hard to find, but in the kidney palace, it can be recognized—third reason. When the heart’s *qi* penetrates the kidneys and the intention descends, it reaches the Original *qi* easily, making it effortless to gather—fourth reason. These four aspects explain why the Original Yang is gathered in the kidney palace.\n\nSpeaking of essence from the perspective of *qi*:\nThe Spirit has the Original Spirit, the *qi* has the Original *qi*—is there any essence without the Original essence? Essence depends on *qi* for its formation. Essence is solidified in the kidney palace, while *qi* permeates it; thus, it follows the *qi* upward to become refined, and this is the way.\n\nWhen essence is lost, the Original *qi* does not arise, and the Original Yang is not seen—what benefit is there to me? When the Original Spirit is revealed, the Original *qi* is generated, and when the Original *qi* is generated, the Original essence is produced.\n\nSpeaking of intention as a medium:\nIs intention merely a medium? In the Dao of Golden Elixir, from beginning to end, its function cannot be separated. Intention arises from the heart. Yet, if the heart does not wander with intention, it is fine; if the heart wanders with intention, it is not.\n\nSpeaking of the *Kan* and *Li*:\nThe *Kan* is the kidney palace. The *Li* is the heart field.\n*Kan* is still and belongs to water, thus it is *yin* (～).\n*Li* is dynamic and belongs to fire, thus it is *yang* (～).\nWhen *Li* is dynamic, it is fire—thus it is *yang* (～).\nWhen *Kan* is still, it is water—thus it is *yin* (～).\nAt the moment of interaction, when the heart field is still and the kidney palace is dynamic, is it not the Original Yang below and the Original *Yin* above? Moreover, since intention arises from the heart and descends directly to the kidney palace, and since Yang is generated from the kidneys and ascends directly to the Yellow Court? Therefore, it is said: *Kan* and *Li* are inverted. If they are not inverted and proceed in their natural order, then the heart’s fire is dynamic and not still, and the meaning of the great earth fire pit becomes clear.\n\n**The Initial Practice:**\nFirst, one must hold the *Heart* in stillness, then later practice the *Lower Hand* technique.\nInitially, one seeks to still the heart, but desires have not yet ceased. Desires are the nature of the vital *qi* and constitution. This nature enslaves the Original Spirit, constantly pressing upon the ears, then the eyes. The practitioner of Golden Elixir, once the heart is free of distractions, will have no means to enslave it. The reason it enslaves the Spirit is that external things lure it.\n\nDuring the still-sitting practice, first employ the method of closing and restraining the breath. Closing the breath means that when a breath has not yet ended, another breath follows. Now, when a breath arises, one restrains the next breath. The next breath, being restrained, is drawn in slowly, and over time, the breath becomes steady. Restraining the breath a thousand or ten thousand times must not disturb the heart, for if the heart is disturbed, it will chase after the breath, and the breath will not yet have stopped while the heart has already moved.\n\nAs he was speaking, a man laughed from beside him, saying:\n\"Foolish! This old man teaches people without method. Restraining the breath while also not disturbing the heart—is it not like burdening a man with a thousand *jun* weight, forcing him to exert no effort? How can that be?\"\n\nHe replied:\n\"Wait and listen. Though I restrain the breath, I also preserve the heart, so the heart does not move, and the breath is still.\"\n\nAgain, the man said:\n\"This is indeed the method of restraining the breath, but how can one ensure desires do not arise?\"\n\nHe replied:\n\"When desires arise, it is already too late. The birth of desires is due to their response to external things. In the state of stillness, if the eyes perceive something, the Spirit is enslaved by the eyes—quickly withdraw and return inward. If the ears hear something, the Spirit is enslaved by the ears—quickly withdraw and return inward. It is the same with all others.\"",
      "overlap_context": "s with *youwei* (action),\nand the world is in chaos.\nThe heart is the ruler’s throne—\nwhen governed with non-action,\nwhat moves it is the original spirit’s nature*.\nWhen ruled with action,\nwhat moves it is the desires’ nature.\nAction is the heart of daily life;\nnon-action is the heart of Golden Elixir practice.\nTo turn from action to non-action,\nthen govern affairs with non-action—\nthat is the Golden Elixir’s gateway.\n\n\"For the spirit has two forms:\nthe original spirit and the spirit of desire.\"",
      "start_char": 3119,
      "end_char": 4346,
      "start_sentence": 213,
      "end_sentence": 300,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 20.45378065109253,
      "metadata": {
        "source_file": "dao\\藏外\\青华秘文.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "问者日：“闻一如二，吾并知此理矣。 吾虽收神，而又存心，则神收而心本静矣。 ” 日：“存心者，养性也。 性之始见，不存心则无所养。 无所养，则终乎不见矣。 存心实自收心始，所谓收神者，盖收心之余用耳。 行之至久，见如不见，闻如不闻，形心相忘，合乎至道，则元性彰露而元气生矣。 ” 精神论 神者，元性也。 余前所说神为主论，盖亦尽之矣。 今念夫修丹者，多昧凝神之法。 凝神之法，不在乎速，故又为之论。 而后画种室图，并论于后。 凝者，以神凝于精气之内。 精气本相依，而神亦恋之。 今独重于神。 何也？ 神者，精气之主。 丹士交会采取，至于行火，无非以神而用气精。 苟先以神凝于气之中，则气未可安，神亦未肯恋气，而反害药物矣。 且神，元性也。 性方寻见尚未定，摇摇飏飏，进退存亡。 而子使凝之，性岂能自凝？ 其所以凝之者，亦气质之性而凝之也。 初云质性而寻本性，是以质性而逐本性，可乎哉！ 今之为学者，多为凝神所误，何也？ 盖神仙有下手先凝神之说，故妄引以盲众。 岂知其所谓凝神者，盖息念而返神于心之道。 神归于心，则性之全体见。 全体见而用之，无非神用。 念念不离金丹，故丹成而神自归之，何凝之有？ 故曰，凝神者，神融于精气也。 精、气、神合而为一，而阳神产矣。 到此际此身，乃始为无用之物也。 谁曰不然？ 吾闻于度师，度师闻于远师，远师闻于天。 幻丹说 幻丹者，未静心田，遽采一阳。 故斯时也，一阳奕生，非真阳也。 气非元气，乃呼吸之气也。 精亦非元精，乃淫泆之精也。 神亦非元神，乃情欲之念也。 夫人方学道，更欲为仙，得非欲念乎？ 以欲念而交会阳生，此幻丹之所以有也。 精在肾府，而若采之升至于脐上，又无安顷处，故逐气而息于气穴之右。 脐生于肾之缕，与气交结而止。 即自曰丹。 既自曰丹矣，而精、气、神用着，便是后天底物。 先天之物，果安在哉？ 谓之黄庭、内炉、外炉、泥丸等窍，皆先天立之后始见。 当此时在何处？ 实未之有也。",
      "translated_text": "The questioner said: *\"I have heard that 'One as Two'—I know this principle already. Though I withdraw the Spirit, I also preserve the heart, so the Spirit is withdrawn while the heart remains fundamentally still.\"*\n\nHe replied: *\"Preserving the heart is indeed cultivating the nature. When the nature first appears, if one does not preserve the heart, there will be nothing to cultivate. Without cultivation, it will never be seen. To preserve the heart truly begins with withdrawing the heart. What is called withdrawing the Spirit is, in fact, withdrawing the heart and then using the senses. When practiced for a long time, seeing becomes like not seeing, hearing like not hearing—form and heart are forgotten, aligning with the Dao. Then, the original nature shines forth, and the original *qi* is born.\"*\n\n**Spirit and Nature Theory**\nThe Spirit is the original nature. My earlier discussion on the Spirit as the primary principle has also been exhausted.\n\nNow, let us consider those who practice alchemy: many are confused by the method of *concentrating the Spirit*. Concentrating the Spirit is not about speed, so I further expound upon it. Later, I will draw the diagrams of the *inner chambers* and elaborate further.\n\nTo concentrate means to gather the Spirit within the *essence-qi*. Essence and *qi* are inherently interdependent, while the Spirit clings to them. Now, we focus solely on the Spirit—why?\n\nThe Spirit is the master of essence and *qi*. Alchemists unite and harvest, and when they reach the stage of *firing*, they use nothing but the Spirit to govern essence and *qi*. If one first concentrates the Spirit within the *qi*, the *qi* cannot settle, and the Spirit will not willingly cling to the *qi*—instead, it harms the medicinal substance.\n\nMoreover, the Spirit is the original nature. The nature is still in search, not yet fixed—flickering and drifting, advancing and retreating, existing and perishing. How can you force it to concentrate? What you truly concentrate is the inherent nature of essence and *qi*.\n\nInitially, one seeks the original nature through the nature of essence and *qi*—this is to chase the original nature with the nature of essence and *qi*, is it not?\n\nNow, many students are misled by concentrating the Spirit—why?\n\nBecause there is a saying among Daoists and immortals that one should first concentrate the Spirit. Thus, they mistakenly cite it to blind others. Do they know that what they call concentrating the Spirit is, in fact, the method of *restraining the mind* and returning the Spirit to the heart? When the Spirit returns to the heart, the full nature appears. Once the full nature is seen and applied, it is nothing but the Spirit in action. Thoughts never leave the Golden Elixir, so when the elixir is formed, the Spirit naturally returns to it—what need is there for concentration?\n\nThus, it is said: concentrating the Spirit is the Spirit merging with essence and *qi*. Essence, *qi*, and Spirit unite as one, and the *yang* Spirit is born. At this juncture, this body is now nothing but a useless vessel.\n\nWho says otherwise? I have heard this from the *Master of the Degree* (度师), the *Master of the Degree* heard it from the *Distant Master* (远师), and the *Distant Master* heard it from Heaven.\n\n**The Illusion of the Elixir**\nThe illusion of the elixir arises when one has not yet cultivated the stillness of the heart-field, yet hastily harvests a single *yang* essence. At this time, the *yang* essence shines forth, but it is not true *yang*. The *qi* is not original *qi*—it is merely the breath of inhalation and exhalation. The essence is not original essence—it is the turbid, impure essence. The Spirit is not original Spirit—it is the thought of emotional desires.\n\nA man who has just begun studying the Dao yet seeks immortality—is this not the rise of desires? Using desires to unite and harvest *yang* essence—this is how the illusion of the elixir arises.\n\nThe essence resides in the kidney palace, yet it is as if one harvests and ascends it to the navel. There is no stable resting place, so it follows the *qi* and settles in the right of the *qi* cavity. The navel is born from the kidney’s threads, where it intertwines with the *qi* and halts. This is what is called the elixir.\n\nOnce it is called the elixir, the essence, *qi*, and Spirit are applied and manifested—this is the substance of the *post-heaven*. Where, then, is the *pre-heaven* substance?\n\nThe so-called *Yellow Court*, *inner furnace*, *outer furnace*, and *clay pellet* (泥丸) cavities all appear only after the *pre-heaven* is established. At that time, where is this body? It truly does not exist.",
      "overlap_context": " the man said:\n\"This is indeed the method of restraining the breath, but how can one ensure desires do not arise?\"\n\nHe replied:\n\"When desires arise, it is already too late. The birth of desires is due to their response to external things. In the state of stillness, if the eyes perceive something, the Spirit is enslaved by the eyes—quickly withdraw and return inward. If the ears hear something, the Spirit is enslaved by the ears—quickly withdraw and return inward. It is the same with all others.\"",
      "start_char": 4347,
      "end_char": 5142,
      "start_sentence": 301,
      "end_sentence": 354,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 13.184375524520874,
      "metadata": {
        "source_file": "dao\\藏外\\青华秘文.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "傍风捉影，入海寻蟾，守株待兔，缘木求鱼，一旦败露，精荡然而去，先天又无所主。 呜呼！ 非长生之丹，乃促命之法也。 又有采气而上遇心血，气血凝而为物，亦曰幻丹。 若此者众，故举以辨惑。 捉丹法 “金丹居内，亦有走失者乎？ ” 曰：“有” “有可捉之道乎？ ” 曰：“有。 然而非丹之走失也，门户不坚，而被其出也。 幻丹则有走失，金丹安有此患？ ” 日：“金丹之出，何以知之？ ” 日：“丹在鼎中，备五行之正气，吾身五行之气迫炉，则相感而动。 一旦觉气升鼎外，而内无相感，乃丹不存也。 急须放下，一场大静，并所谓炉鼎，丹之在不在，俱付之无何有。 或一日，或一夜，始觉其在何处。 或在心，或在肝，或在牌与肾。 身中百窍，皆可藏之。 知其在彼处，遂绵绵若存而守之，勿使之再去他处。 又一日之久，始以意采之，则直降于阳宫。 又就阳官，如采取之时。 用意，遂从旧迳直升阳于鼎矣。 造化玄微，至此谁曰不然？ 苟有云云者，吾之师也。 ” 神水华池说",
      "translated_text": "Chasing the wind and seizing shadows,\nplunging into the sea to seek the toad—\nthese are like waiting by a stump for a hare\nor climbing trees to catch fish.\nOnce exposed, the essence scatters and departs,\nand the *pre-heaven* has no master.\nAlas! This is not the elixir of longevity,\nbut a method to hasten death.\n\nThere are also those who, in gathering *qi*, encounter heart blood,\nwhere *qi* and blood congeal into something—\nthis too is called a phantom elixir.\nSuch deceptions are many, hence I raise them to dispel confusion.\n\nOn the method of seizing the elixir:\n*\"Does the Golden Elixir within also wander and lose its way?\"*\n*\"It does.\"*\n*\"Is there a way to seize it?\"*\n*\"There is. Yet this is not the elixir wandering—\nthe gates are not firm, and it is driven out.\"*\n\nAs for phantom elixirs, they may wander,\nbut the Golden Elixir has no such affliction.\n\n*\"How do you know when the Golden Elixir departs?\"*\n*\"When the elixir is in the furnace,\nit is filled with the true *qi* of the Five Phases.\nIf the Five Phases *qi* of my body presses upon the furnace,\nthey resonate and move in response.\nShould I suddenly sense *qi* rising outside the furnace,\nand find no internal resonance,\nthen the elixir is no longer there.\nI must urgently set it down—\na great stillness, and even the furnace and crucible,\nwhether the elixir is present or not,\nare all entrusted to the void.\nAfter a day, or a night,\nI begin to sense where it is—\nsometimes in the heart, sometimes in the liver,\nsometimes in the spleen or kidneys.\nWithin the body’s hundred orifices,\nit may hide anywhere.\nOnce I know its location,\nI gently nurture it as if it exists there,\npreventing it from wandering elsewhere.\nAfter another day,\nI gather it with intent,\nand it descends straight to the *yang* palace.\nThen, from the *yang* palace,\nas if retrieving it at first—\nwith intent,\nit ascends along the old path\ndirectly to the *yang* elixir in the furnace.*\n\nThe mysteries of creation are profound—\nwho could say this is otherwise?\nIf such teachings exist,\nthey come from my master.\"\n\n—*Shen Shui Hua Chi* teachings.",
      "overlap_context": " born from the kidney’s threads, where it intertwines with the *qi* and halts. This is what is called the elixir.\n\nOnce it is called the elixir, the essence, *qi*, and Spirit are applied and manifested—this is the substance of the *post-heaven*. Where, then, is the *pre-heaven* substance?\n\nThe so-called *Yellow Court*, *inner furnace*, *outer furnace*, and *clay pellet* (泥丸) cavities all appear only after the *pre-heaven* is established. At that time, where is this body? It truly does not exist.",
      "start_char": 5142,
      "end_char": 5565,
      "start_sentence": 355,
      "end_sentence": 385,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 6.361400127410889,
      "metadata": {
        "source_file": "dao\\藏外\\青华秘文.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "神水者，即木液之谓也。 华池者，脐中气穴之下，两肾中间一窍。 绝肖黄庭，谷气就此而生精，医家所谓精穴者是也。 斯窍也，少壮之士，阳盛气融，则神水华池，不过浇灌炉鼎、洗涤脾胃，周流润泽气穴而已。 元气衰微，精元枯竭者，皆藉此以为丹本。 元气既衰，非元气之衰也，乃气质之气断丧已甚。 邪欲之性，念念不已，先天既不得见，后天亦不足为用，嬴矹之根，殆起于此。 华池之窍，乃生精而降于肾者也。 气壮则精多，精多则华盛，用之如有余。 气凋之士，精元槁矣。 谷气所临，不过产一等欷欷之水，流归肾府耳。 然我既静矣，元气本无增减，但华池无矣。 大药三品，而欠其一。 故阳生之际，未值采之时，以意斡归尾闾，自夹脊直透至泥丸。 故就精穴用精，自然随气而升至午宫，遇众阳融之则精始可用。 然后降至于心，就心取汞，依然下至黄庭。 即落乎其中。 却用一意封固，即绵绵若存以养之。 二者就其中自相吞啖而丹始成。 近有浙西一派，虽少壮之士，亦用此法而结丹。 但道在迩，求诸远耳。 然各执其是而已。",
      "translated_text": "The *Shen Shui* is none other than the essence of wood—*qi* in its fluid form.\nThe *Hua Chi* is the orifice beneath the *qi*-cavity at the navel, situated between the two kidneys.\nIt closely resembles the *Huang Ting*—where the *gu* (grain)-*qi* generates essence, the medical tradition’s so-called *jing xue* (essence orifice).\n\nThis orifice, in youthful vigor when *yang* is robust and *qi* harmonious,\nmerely irrigates the furnace and crucible, cleanses the spleen and stomach,\nand circulates to moisten the *qi*-cavity.\n\nWhen the original *qi* declines and the primal essence is exhausted,\nall rely upon it as the foundation for the elixir.\nYet when the original *qi* weakens, it is not the *qi* itself that fails—\nrather, the *qi* of constitution is severely depleted.\nThe nature of lustful cravings, ceaseless in thought,\nprevents the primal from manifesting, rendering the post-heaven insufficient.\nThe root of decay and exhaustion lies here.\n\nThe *Hua Chi* orifice is where essence is generated and descends to the kidneys.\nWhen *qi* is strong, essence is abundant; when essence is abundant, the *Hua Chi* flourishes, its use seemingly inexhaustible.\nFor those whose *qi* is withered, the primal essence is parched.\nWhere the *gu*-*qi* alights, it produces only a meager, trickling fluid,\nmerely returning to the kidney chambers.\n\nYet when I am still, the original *qi* knows no increase or decrease—\nonly that the *Hua Chi* is absent.\nThe three elixir ingredients are present, yet one is lacking.\n\nThus, at the moment of *yang*’s emergence, before the time to gather it,\nI direct it with intent toward the *Weilu* (tailbone),\npiercing straight from the *jiapui* (intervertebral space) to the *Nihuan* (brain’s marrow).\nThen, gathering essence from the *jing xue*,\nit naturally ascends with the *qi* to the *Wu Gong* (midday palace),\nwhere, fused with the gathered *yang*, the essence becomes usable.\nAfterward, it descends to the heart, where I extract the mercury,\nreturning it once more to the *Huang Ting*—\nsettling within it.\nWith a single intent, I seal and consolidate it,\nnurturing it as if it exists there.\nWithin, the two mutually devour each other—\nand only then does the elixir form.\n\nRecently, a school from Zhexi has employed this method even among the young\nto forge the elixir.\nYet the Dao lies near—\none must seek it not afar.\nStill, each clings to their own truth.",
      "overlap_context": "now its location,\nI gently nurture it as if it exists there,\npreventing it from wandering elsewhere.\nAfter another day,\nI gather it with intent,\nand it descends straight to the *yang* palace.\nThen, from the *yang* palace,\nas if retrieving it at first—\nwith intent,\nit ascends along the old path\ndirectly to the *yang* elixir in the furnace.*\n\nThe mysteries of creation are profound—\nwho could say this is otherwise?\nIf such teachings exist,\nthey come from my master.\"\n\n—*Shen Shui Hua Chi* teachings.",
      "start_char": 5566,
      "end_char": 5988,
      "start_sentence": 386,
      "end_sentence": 407,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 6.726634979248047,
      "metadata": {
        "source_file": "dao\\藏外\\青华秘文.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "百窍说 人之一身，毛窍八万四千，气宫三百八十四。 毛窍散属气宫．脐中气穴又为三百八十四宫之主，降于阳宫，皆为精。 心为中田，顶为上田。 舌下为玄膺，目中有银海，额之中，眉之间，口鼻之衡，耳目之畔，咽喉左侧，腰胁中皆窍也。 余所谓丹之出者，若此窍皆可藏也。 岂曰人身止有一二窍也。 此一二窍，众之枢纽也，岂曰止乎斯而已矣。 此其体也，用，别着说于后。 采取图论 采者，求真阳于肾府，取者，取真汞于心田。 可以采则采，采之必得其用。 非其时而来之，则龙不降，虎不升。 惟见血气奔驰，冲冲来往，迷者以为交媾矣。 抑不知离坎阴中之真阳，阳中之真阴，自兀然耳。 至于气脉为一念所止，则气疾人脉络之中，离坎之内，反有伤于铅汞。 虽曰养气。 要之于终，实所以丧元气也。 失元气之在人，至静始见，是先天之气也。 后天之气，时刻循环。 但人汨于欲而不知详审耳。 至于略定之际，心无他用，则方知其气之上下，遂错采以为先天，致返加害。 所以近世之学道者，常有奇疾，盖为此也。 夫人之疾病，但气脉为梗耳。 气本自调，而若役之、使之，升则伤牌、胃、肺、肝、耳、目、口、鼻，降则如决水、如长堤，锐然而下趋，沛乎其不可御也。 至真之物，其能存乎？ 余悯此等言丹之士，故画采取图为第一。 虽直泄天机，但人有志于金丹，而反戕其性命，余救之以正理，太上好生，必不我罪。 故此篇尽以刀圭、玄黄、婴儿、姹女、……诸般譬设，尽扫而退三舍，使贤者见之而参同，愚者见之泮然水释。 分分朗朗，如宝鉴之察形，洞见毫发矣。 金丹之士，先修明德，以尽人事。 然后持前心论，则大药产而图形见矣。 采取之法生于心。 心者，万化纲维、枢纽，必须志之，而始觅之。 忘老，妄心也，觅者，真心也。 但于忘中生一觅意，即真心也。 恍恍之中，始见真心。 真心既见，就此真心生一真意，加以反光内照，庶百窍备陈，元精吐华矣，要在乎无中生有，有中生无。 到这境界，并真心俱忘而弃之也。 我以无而待已，则真息绵绵。 真息绵绵之时，后天之气以定。 后天隐则先天之气见，故阳生焉。 阳生者，先天之气自气穴中流出，而至于肾中○，如喷泡然。 盖两肾中间，有一缕透气穴，乃父母交媾之后，始生脉络也。 故先天之气游之，既觉如斯，则一身百脉，尽若春生。 春意融而渐长，此时先天之体始立，先天立而后天愈退藏矣，然后可以微动采取之意。 意者，以目垂观于心，却以心放下送入阳宫。 徐收而又纵，则阳起矣。 （余见一阳论）○采之之意，生于心，心生于目。 故老子曰，吾尝观心，得道亦至灵。 夫真息既定，内光乃神光，此心乃真心。 真心生意，神光烛心。 故常为之说曰，目机心，心生意．意采铅。 若阳生未融盛，而遽采之，则一念住，采意既萌，后天复起。 故曰，了命实关于性地。 性者，凡所有相，皆是虚妄。 既无着相，则虚妄除而真理显矣。 真理方明而一念生，岂非复为虚妄之相乎？ 故伺阳长而始采，则勃然而升。 先天气盛，而后天伏不暇矣。 采之升也，实有异焉。 醺然而上，至于脐而稍上，徐止脐之上，则息方凝。 名曰：铅。 铅，金也。 金生水，故汞产于心。",
      "translated_text": "The hundred orifices—\nA human body possesses eighty-four thousand hair-pores and three hundred eighty-four *qi*-palaces.\nThe hair-pores disperse and belong to the *qi*-palaces;\nthe *qi*-orifice at the navel governs these three hundred eighty-four palaces as their sovereign,\ndescending into the *yang*-palace, all becoming essence.\n\nThe heart is the central field, the crown the upper field.\nBeneath the tongue lies the *Xuanying* (Mysterious Response),\nwhile the eyes hold the silver sea;\nbetween the brows, the space between the eyebrows,\nthe balance of mouth and nose,\nthe borders of ears and eyes,\nthe left side of the throat,\nand the waist and ribs—all are orifices.\n\nWhat I speak of as the elixir’s emergence—\nif such orifices exist, they can all store it.\nWho says the body has but one or two orifices?\nThese one or two orifices are the hinges of all others—\nwho says they are confined to these alone?\nThis is their form; their application will be explained separately.\n\n**The Diagram of Adoption and Extraction**\n*Adoption* means seeking true *yang* from the kidney palace,\n*extraction* means taking true mercury from the heart-field.\nWhen the time for adoption arrives, one must adopt it,\nand in adopting, one must grasp its use.\nIf it comes before its time, the Dragon will not descend,\nthe Tiger will not ascend.\nSome mistake the surging *qi* and blood—\ntheir wild, rushing exchange—\nfor copulation.\nYet they fail to see that within the *li*-*kan* (fire-water),\nthere exists the true *yang* within *yin*,\nand the true *yin* within *yang*—\nboth standing alone.\n\nWhen the *qi*-pulse is halted by a single thought,\nthe *qi* rushes into the vessels,\nand within the *li*-*kan*,\nit risks harming lead and mercury.\nThough called \"nurturing *qi*,\"\nin truth, it exhausts the original *qi*.\n\nThe loss of original *qi* in a person\nonly becomes apparent in profound stillness—\nthis is the *xian*tian (preheaven) *qi*.\nThe *hou*tian (postheaven) *qi* cycles endlessly,\nyet people drown in desire and fail to discern it.\n\nAt the moment of rough stabilization,\nwhen the mind has no other use,\none then perceives the *qi*’s ascent and descent,\nmistaking it for *xian*tian and thus causing harm.\nThus, many modern Daoists suffer strange ailments—\nthis is the cause.\n\nHuman sickness arises when the *qi*-pulse is obstructed.\nThe *qi* itself naturally regulates,\nyet if forced or coerced—\nwhen it ascends, it harms the pericardium, stomach, lungs, liver,\nears, eyes, mouth, and nose;\nwhen it descends, it surges like a broken dam,\na long dyke collapsing—\nsuddenly rushing downward, unstoppable.\n\nCan such true substances endure?\nI pity those who speak of the elixir,\nso I first depict the Diagram of Adoption and Extraction.\nThough I reveal the heavens’ secrets,\nthose who seek gold elixir yet destroy their nature—\nI correct them with true principles.\nThe *Taishang* (Supreme Sage) cherishes life;\nhe will not blame me.\n\nThus, this treatise sweeps away all metaphors—\n*Yaojing* (Pharmaceutical Needle), *Xuanyang* (Mysterious Yellow),\n*Ying’er* (Infant), *Chinü* (Enchanting Maiden)—\nretreating three *she* (stages),\nso that the wise may grasp the unity,\nand the foolish may dissolve their doubts like water released.\nClear and distinct,\nlike a mirror revealing form—\nevery hair and pore is seen.\n\nThe seekers of gold elixir must first cultivate clear virtue,\nexhausting human effort.\nThen, holding the *Heart’s Theory*,\nthe great medicine will manifest, and its form will appear.\nThe method of adoption and extraction arises from the heart.\nThe heart is the pivot and thread of all transformations—\none must focus the mind before seeking it.\n\n*Wanglao* (forgetfulness) is delusion;\n*seeking* is true mind.\nYet within forgetfulness, a seeking intention arises—\nthis is true mind.\nIn the hazy state, true mind begins to appear.\nOnce true mind is seen,\nfrom it arises a true intention,\nwhich, when reflected inward,\nreveals all orifices fully—\nthe original essence then blossoms.\nThe key lies in generating existence from non-existence,\nand non-existence from existence.\nAt this stage, even true mind is forgotten and abandoned.\n\nIf I await with emptiness,\ntrue breath flows continuously.\nWhen true breath flows continuously,\nthe *hou*tian *qi* stabilizes.\nAs the *hou*tian conceals itself,\nthe *xian*tian *qi* emerges—\nand thus *yang* is born.\n\nThe *yang* that arises is the *xian*tian *qi*\nflowing from the *qi*-orifice into the kidneys—\nlike a fountain bursting forth.\nBetween the two kidneys lies a thread of penetrating *qi*,\nthe pulse-network formed after parents’ union.\nThus, the *xian*tian *qi* circulates within it.\nOnce this is felt,\nall hundred pulses of the body\nawaken like spring’s arrival.\nSpring’s vitality spreads and grows—\nat this point, the *xian*tian form is established,\nand the *hou*tian retreats further.\nOnly then may one subtly stir the intention of adoption and extraction.\n\nThe intention arises from the heart,\nthe heart from the eyes.\nThus, *Laozi* says:\n*\"I have observed the heart—\nwhen the Dao is attained, it is most subtle.\"*\n\nWhen true breath is stabilized,\ninner light becomes divine light,\nand this heart is the true heart.\nTrue heart generates intention,\ndivine light illuminates the heart.\nThus, it is often said:\n*\"The eye moves the heart,\nthe heart generates intention—\nintention adopts lead.\"*\n\nIf *yang* has not yet fully risen\nand one hastily adopts it,\na single thought halts it—\nthe adoption intention takes root,\nand the *hou*tian *qi* resurges.\nThus, it is said:\n*\"Understanding life depends on the nature’s foundation.\nNature is all illusory forms—\nif no attachment remains,\ndelusion fades, and true principle shines.\"*\n\nOnly when *yang* is fully matured\nshould one adopt it—\nthen it ascends vigorously.\nWhen *xian*tian *qi* thrives,\nthe *hou*tian has no time to rise.\nThe ascent of adoption is different.\nIt rises in a drunken sway,\nreaching the navel and slightly beyond,\ngradually halting above the navel—\nthen the breath solidifies.\nThis is called: *lead*.\nLead is metal.\nMetal generates water,\nso mercury is produced in the heart.",
      "overlap_context": "ce becomes usable.\nAfterward, it descends to the heart, where I extract the mercury,\nreturning it once more to the *Huang Ting*—\nsettling within it.\nWith a single intent, I seal and consolidate it,\nnurturing it as if it exists there.\nWithin, the two mutually devour each other—\nand only then does the elixir form.\n\nRecently, a school from Zhexi has employed this method even among the young\nto forge the elixir.\nYet the Dao lies near—\none must seek it not afar.\nStill, each clings to their own truth.",
      "start_char": 5990,
      "end_char": 7237,
      "start_sentence": 408,
      "end_sentence": 472,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 17.328186750411987,
      "metadata": {
        "source_file": "dao\\藏外\\青华秘文.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "云从龙，风从虎之理兆矣。 风平而雨降，自然铅汞相投，相吞相啖。 金生水，水生木，水又生火。 木爱金而金恋水，乃交会之道也。 夫金克木，反有爱恋之意焉，盖金木之本性耳。 吾以本然之性，亦不过譬喻耳。 ○乃先天也。 五行在何处？ 但不如是，则不能达其理。 采取之道既明，交会之理复露。 再有叮嘱：采取不可太缓，太缓则老而不可用，而后天之气杂矣。 学人以交会图参看，则思过半矣。 诗曰：醺醺和气酿春风，一点阳生恍惚中。 无自有生无胜有，色从空里色还空。 升于脐上铅情见，产自心源汞性通。 定里见真真里定，坎离交会两蒙蒙。 木为龙芍金为虎，坎户生男引离女。 要知造化有根源，不离真火生于子。 交会图论 恍兮恍兮中有象，杳兮冥兮中有物。 古先哲常特此以警学者。 盖恍惚杳冥，定之象也。 惟定可以炼丹，不定而阳不生。 阳生之后，不定而丹不结。 故才以意采铅，而遽止其意。 止有时，而升有刻。 盖始生无过一气耳，升于脐则为铅，故止斯意而无用矣。 铅自能引汞，汞自能寻铅。 恍惚杳冥之中，交媾之理毕矣。 我得师之口诀并泄之，宜秘宜秘。 默而视之，念勿出声。 若有知道之士，宿有善缘，逢此玄机至宝之道，凡遇口诀，记而勿书，书而勿见，则某实戴其德。 余从师一十年，凡有所得，尽底陈露，愿与同志之士共宝之。 此乃《玉清金笥东极青华长生度世上品内炼金丹宝诀》，玄律至严，某不识避忌，就撰为此书。 前三句，表奉天庭。 继得报应，始敢吐露下笔。 下笔之时，心惴惴然而汗落于纸，涕泣交零，但愿志士得之，幸勿相累。 同成胜果，共征仙阶。 吁！ 知我者，为我心优。 不知我者，为我何求。 幸心心相照，某不胜祷告之至。 诸仙幸鉴！ 采取交会口诀 忘里觅，觅里忘，忘中见，见中忘，阳生矣。 忘中采，采中忘，忘里升，升里见，见里变，铅成矣。 定中起，意中升，忘中用铅引汞矣。 铅合汞于内，精会神于外，交会矣。 铅汞精神合而为一，却将一念使之，落黄庭归鼎矣。 口诀中口诀：打合铅汞，须用一意。 动采一阳，须用以静而生定。 或问：“孰为交媾？ ”曰：“采取图心下一窍，乃交会之地。 不可以有形求，不可以无形取。 但铅升之际，阳气上为∪。 夫自气穴降，为一阳官○，我采以意○。 汞降之际，会气降为∩。 盖汞铅生，铅升于脐上，为精光所烛，故曰铅。 铅犹表也，汞犹影也。 表动影随，故汞降亦如之。 阳铅之升，不可谓之纯阳。 中含精光为铅，盖亦属阴。 阴汞之降，不可谓之纯阴。 心生汞，心为神舍。 汞遇神光而后可用，盖亦属阳。 阳中有明，阴中有阳。 二气交感，凝结不散，遂成玄珠○如黍米。 ” 或问：“铅乃一阳，一阳乃先天一气耳。 汞，何物为之？ ”曰：“铅与汞皆先天之物，铅乃先天气，汞乃先天灵。 此气乃命之母，此灵乃性之子。 可以曰铅汞、可以曰性命。 诸得道之宗师，谁肯直泄至此？ ” 又问曰：“心下一窍，何窍也？",
      "translated_text": "「The Dao/Way of *yún cóng lóng, fēng cóng hǔ* [1] is now revealed.\n\nWhen the wind is still and rain descends,\n*hou*tian *qi* naturally merges with *xian*tian *qi*—\none consumes the other, the other devours in return.\nMetal generates water,\nwater generates wood,\nwater again generates fire.\nWood loves metal while metal clings to water—\nthis is the Dao/Way of their interplay.\n\nThough metal overcomes wood,\nthere is still a hint of love and attachment—\nthis is their inherent nature.\n\nAs for the nature of *xian*tian,\nit is but a metaphor.\n\nWhere are the Five Phases [2]?\nOnly when understood as such\ncan one grasp its principle.\n\nSince the method of adoption is clear,\nthe interplay of *xian*tian and *hou*tian *qi* is now disclosed.\n\nAnother instruction:\nAdoption must not be too sluggish—\ntoo sluggish, and the *qi* ages, becoming useless,\nwhile the *hou*tian *qi* grows mixed.\nIf the practitioner studies the Interplay Diagram,\ntheir understanding is already half complete.\n\nThe verse says:\n*\"A drunken sway of harmonious *qi* brews the spring wind,\na single point of *yang* arises within vague emptiness.\nThe unborn gives rise to the born, the born cannot overcome the unborn;\ncolor emerges from emptiness, only to return to emptiness.\nAs the *qi* ascends to the navel, the *lead* reveals itself,\nborn from the heart’s source, the *mercury* flows naturally.\nIn stillness, truth appears; in truth, stillness is found—\n*Kàn* and *Lí* [3] intermingle in dual obscurity.\nWood as the Dragon, Peony as the Tiger [4],\n*Kàn*’s male principle draws *Lí*’s female principle.\nTo know the root of creation’s transformation,\none must not depart from the true fire born in the *zǐ* [5].\nThe Interplay Diagram expounds:\n*Huǎng* [6] and *huǎng*, *yǎo* [7] and *míng* [8]—\nwithin emptiness, form is seen;\nwithin obscurity, essence lies.\nAncient sages often warned scholars of this:\nFor *huǎng* and *huǎng*, *yǎo* and *míng*—\nthese are the forms of stillness.\nOnly stillness can refine the elixir [9],\nwhile instability prevents *yang* from arising.\nOnce *yang* arises,\ninstability prevents the elixir from forming.\nThus, one adopts *lead* with intention—\nand abruptly halts that intention.\nThe halting has its time,\nwhile the ascent follows its measure.\nFor the *qi* is but a single breath when first arising,\nbut when it ascends to the navel, it becomes *lead*—\nso the intention is halted, and its use is lost.\n\n*Lead* can naturally summon *mercury*,\nwhile *mercury* can naturally seek *lead*.\nWithin the *huǎng* and *huǎng*, *yǎo* and *míng*,\nthe principle of their union is complete.\n\nI have obtained my teacher’s oral precepts and now reveal them—\nthey should be kept secret, kept secret.\nSilent observation, no spoken thought.\nIf there are those who understand,\nthey have long had good karma.\nEncountering this precious Dao/Way of profound mystery,\nwhen they hear the oral precepts,\nthey should remember but not write them,\nwrite them but not display them—\nthen I will truly owe them my virtue/power.\n\nI followed my teacher for ten years,\nand whatever I gained,\nI have fully disclosed.\nI wish to share it with kindred spirits.\n\nThis is the *Precious Oral Precepts for Refining Internal Gold Elixir to Attain Immortality and Save the World from the Supreme Scripture of the Jade Purity Golden Cabinet of the Eastern Extremity’s Azure Flower* [10],\nwhose sacred laws are most strict.\nI do not know what taboos to avoid,\nso I dare to compose this book.\nThe first three lines honor the Celestial Court [11].\nAfter receiving its response,\nI dared to speak and write.\n\nAt the moment of writing,\nmy heart trembled with fear,\nand sweat fell upon the paper.\nTears and sobs mingled—\nI only hope kindred spirits may gain from it,\nand not burden themselves in return.\nTogether, we shall achieve victory and ascend the *xian*tian stages.\nAh!\n\nThose who know me,\nare my heart’s joy.\nThose who do not know me,\nwhat do they seek from me?\nMay our hearts reflect each other—\nI am deeply grateful.\n\nO *xian*tian, grant your favor!\n\nThe oral precepts for adoption and interplay:\n*\"Forgotten within seeking, sought within forgotten,\nforgotten in seeing, seen in forgotten—\nand *yang* is born.\nForgotten in adoption, adopted in forgotten,\nforgotten in ascent, ascending in seen—\nseen in transformation, *lead* is formed.\nIn stillness, it arises; with intention, it ascends—\nforgotten in use, *lead* summons *mercury*.\n*Lead* and *mercury* merge within,\n*jing* [12] meets *shén* [13] without—\nunion is achieved.\nWhen *lead* and *mercury*’s *jing* and *shén* merge as one,\ndirect that single thought—\nand the Yellow Court *qi* returns to the *dǐng* [14].\"*\n\nWithin the oral precepts:\n*\"Strike and merge *lead* and *mercury*,\nmust use a single intention.\nWhen adopting one *yang*,\nmust use stillness to generate stability.\nSomeone asks: ‘What is the union?’\nIt is the single orifice beneath the heart—\nthe site of their interplay.\nOne cannot seek it with form,\nnor take it without form.\nWhen *lead* ascends,\nthe *yang* *qi* rises as ∪ [15].\nThe *qi* of the *yang* official [16] descends from the orifice—\nI adopt it with intention.\nWhen *mercury* descends,\nthe meeting *qi* descends as ∩ [17].\nFor *mercury* and *lead* are born from *xian*tian—\n*lead* ascends above the navel,\nilluminated by the *jing* light,\nhence it is called *lead*.\n*Lead* is like the form,\n*mercury* like the shadow.\nWhen the form moves, the shadow follows—\nso *mercury* descends accordingly.\nThe ascent of *yang* *lead* cannot be called pure *yang*—\nit contains the *jing* light, which is *lead*,\nand it also belongs to *yin*.\nThe descent of *yin* *mercury* cannot be called pure *yin*—\nit is born from the heart, the dwelling of *shén*.\n*Mercury* meets the *shén* light and then becomes useful—\nit also belongs to *yang*.\n*Yang* contains clarity,\n*yin* contains *yang*.\nThe two *qi* intermingle,\ncondense and do not disperse,\nand thus form the mysterious pearl [18],\nlike a grain of millet.’*\n\nSomeone asks: ‘*Lead* is one *yang*—\none *yang* is the single breath of *xian*tian.\nWhat is *mercury*?’\nIt is said: ‘*Lead* and *mercury* are both *xian*tian substances—\n*lead* is the *xian*tian *qi*,\n*mercury* is the *xian*tian essence.\nThis *qi* is the mother of life,\nthis essence is the child of nature.\nOne may call them *lead* and *mercury*,\nor one may call them *nature* and *life*.\nWhich master of the Dao/Way would dare to reveal this directly?’\n\nAgain, someone asks: ‘The single orifice beneath the heart—\nwhich orifice is it?’",
      "overlap_context": "lusory forms—\nif no attachment remains,\ndelusion fades, and true principle shines.\"*\n\nOnly when *yang* is fully matured\nshould one adopt it—\nthen it ascends vigorously.\nWhen *xian*tian *qi* thrives,\nthe *hou*tian has no time to rise.\nThe ascent of adoption is different.\nIt rises in a drunken sway,\nreaching the navel and slightly beyond,\ngradually halting above the navel—\nthen the breath solidifies.\nThis is called: *lead*.\nLead is metal.\nMetal generates water,\nso mercury is produced in the heart.",
      "start_char": 7237,
      "end_char": 8393,
      "start_sentence": 473,
      "end_sentence": 548,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 21.35903763771057,
      "metadata": {
        "source_file": "dao\\藏外\\青华秘文.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "”混沌神房者，此也，乃精光、目光之气。 幻而为之，精光华腾为∪，目光垂为　　。 精虽元精，然无日用之精，则元精不见。 又如不信，譬如有水，则潮与白气，未闻白气兴于地也。 水乃精也，白气乃华也。 神虽元神，然日用之神而不役，然后元神见。 譬之皓月当天，云收而光始下烛。 清净即无云也，垂光即照临也。 精虽属阴，而精华属阳。 目光属阳而照于内，则亦属阴。 光华相遇而成一窍，以气感气，使二物会于其中。 ⊙物之成也，有精气焉，有元气焉。 工夫周足，遂为真人。 盖生生之意，寓于此矣。 所以能灵两神者，此也。 ”",
      "translated_text": "The *\"Hun-Dun* Divine Chamber\" refers to this very orifice—\nit is the *qi* of luminous essence and luminous vision.\nIt is formed through illusion:\nthe luminous essence ascends as a ∪,\nthe luminous vision descends as　　.\n\nThough this is the *yuan* essence,\nwithout the daily essence, the *yuan* essence remains unseen.\nAgain, if one does not believe,\nconsider water—\nwhen there is water, there are tides and misty vapors,\nyet one has never heard of misty vapors arising from the earth.\nWater is the essence,\nthe misty vapors are its radiance.\n\nThough this is the *yuan* spirit,\nwithout the daily spirit to command,\nthen the *yuan* spirit reveals itself.\nIt is like the bright moon in the sky—\nwhen the clouds disperse, its light descends to illuminate.\nWhen pure and clear, there are no clouds;\nwhen the light descends, it shines upon.\n\nThough essence belongs to *yin*,\nits radiance belongs to *yang*.\nThough the luminous vision belongs to *yang* and illuminates within,\nit also belongs to *yin*.\nWhen the radiance and luminous essence meet,\nthey form this single orifice,\nwhere *qi* responds to *qi*,\ncausing the two substances to converge within it.\n\n⊙In the formation of things,\nthere is the essence-*qi*,\nthere is the *yuan* *qi*.\nWhen the cultivation is complete,\none becomes a True Person.\nFor here lies the intent of *shēngshēng*—\nthe ability to make both spirits luminous comes from this.",
      "overlap_context": "one *yang* is the single breath of *xian*tian.\nWhat is *mercury*?’\nIt is said: ‘*Lead* and *mercury* are both *xian*tian substances—\n*lead* is the *xian*tian *qi*,\n*mercury* is the *xian*tian essence.\nThis *qi* is the mother of life,\nthis essence is the child of nature.\nOne may call them *lead* and *mercury*,\nor one may call them *nature* and *life*.\nWhich master of the Dao/Way would dare to reveal this directly?’\n\nAgain, someone asks: ‘The single orifice beneath the heart—\nwhich orifice is it?’",
      "start_char": 8393,
      "end_char": 8631,
      "start_sentence": 549,
      "end_sentence": 564,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 4.663635492324829,
      "metadata": {
        "source_file": "dao\\藏外\\青华秘文.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "或曰：“然则交会之后，安得此珠落于黄庭、归于鼎内？ ”曰：“二物聚时情性合，五行全矣。 虎归于山，龙归于渊，目光还而精气复。 此⊙落于黄庭，归于鼎内，会　　关捩了么？ 恍恍惚惚，万孔生春，⊙秘、秘、秘。 此数言，非正经原有，乃学者有所得之谓也。 ” 或问； “阳生于上，遽止其意，安保不复降？ ”曰：“大哉问！ 黄庭之下，有一丹室之门户也。 意生则上，故阳升，意止则一，故阳则不可得而降矣。 炉鼎则在乎一之内，正属士。 故○备五行之正气，成天地之全形也。 或问炉鼎之法。 曰：“黄庭之在人身如此，至一阳上升如此，珠落于其中之候　　如此，即护鼎也，黄庭同属土也。 至于中之中，盖属土中之土也。 故落于其中，而成鼎器。 五行各厚其基，何谓厚其基？ 夫母求子，子恋母，丹之法也，皆取其本然之性。 既归于鼎而各归之，如子之恋母。 故静坐之中，神光下垂，则归于鼎。 精华上升，亦如之。 至于行住坐卧，如龙养球，如鸡抱卵，而气各归之。 一身之脉络皆为之，务在乎勿忘而勿助长耳。 学道之士，然乎，其不然乎？ 在某之丹法，若是而已矣。 ” 诗曰：何劳姹女与婴儿，透彻分明说与伊。 身里乾仰颠倒处，壶中日月运行时。 要知一者为阳用，须识一中作气机。 天使紫阳来说尽，后来何必更寻师。 直泄天机图 到这田地，知这道理。 且莫欢喜，咄！ 未知如何想。",
      "translated_text": "Someone asked: *\"Then after the union, how does this pearl descend into the Yellow Court and return to the cauldron within?\"*\n\nThe reply: *\"When the two substances gather, their nature and disposition align, and the Five Phases are complete. The tiger returns to its mountain, the dragon to its depths—when the luminous vision withdraws, the essence-*qi* returns. This is how it falls into the Yellow Court and returns to the cauldron—does this not fulfill the union?*\n\n*Vague yet profound, ten thousand apertures bloom with spring—secret, secret, secret. These words are not from the original canon but reflect what scholars have attained.\"*\n\nSomeone else asked: *\"Yang arises from above—if we abruptly halt its intent, how can we be sure it will not descend again?\"*\n\nThe reply: *\"Great question! Beneath the Yellow Court lies the door to the Vermilion Chamber. When intent arises, it ascends, so yang rises; when intent is stilled, it unifies, so yang cannot descend. The furnace and cauldron lie within this unity, belonging to the adept. Thus, one gathers the Five Phases’ pure *qi* and completes the form of Heaven and Earth.\"*\n\nSomeone asked about the method of the furnace and cauldron.\n\nThe reply: *\"The Yellow Court within the body is thus; when one *yang* ascends to unity, the pearl descends into it—this is guarding the cauldron, for the Yellow Court also belongs to earth. As for the center within the center, it is earth within earth. Thus, when it descends into this, the cauldron forms. The Five Phases each strengthen their foundation—what does ‘strengthen their foundation’ mean?*\n\n*The mother seeks the child, the child clings to the mother—this is the method of the elixir, all drawn from their innate nature. Once returned to the cauldron, each returns to its own, like the child clinging to the mother. Thus, in seated stillness, when the luminous spirit descends, it returns to the cauldron. When the essence-*qi* ascends, it does the same. In movement, stillness, sitting, or lying, it is like the dragon nurturing its pearl, like the hen brooding its egg—each *qi* returns to its own. All the body’s meridians serve this; the key is neither forgetting nor forcing growth. Adepts of the Dao—is this not so? This is my elixir method.\"*\n\nThe poem says:\n*\"Why trouble the maiden or the babe,\nwhen clarity reveals it all?\nWithin the body, Heaven and Earth invert—\nin the jar, sun and moon revolve.\n\nKnow that *One* is the use of *yang*,\nand grasp the *qi*-mechanism within it.\nHeaven’s messenger, Purple Yang, has spoken—\nwhy seek more teachers after this?\n\nThe diagram of Heaven’s secrets is laid bare—\nnow you grasp the principle.\nYet do not rejoice—ah!\nHow will you proceed?\"*",
      "overlap_context": "ang*.\nThough the luminous vision belongs to *yang* and illuminates within,\nit also belongs to *yin*.\nWhen the radiance and luminous essence meet,\nthey form this single orifice,\nwhere *qi* responds to *qi*,\ncausing the two substances to converge within it.\n\n⊙In the formation of things,\nthere is the essence-*qi*,\nthere is the *yuan* *qi*.\nWhen the cultivation is complete,\none becomes a True Person.\nFor here lies the intent of *shēngshēng*—\nthe ability to make both spirits luminous comes from this.",
      "start_char": 8632,
      "end_char": 9183,
      "start_sentence": 565,
      "end_sentence": 600,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 7.016384124755859,
      "metadata": {
        "source_file": "dao\\藏外\\青华秘文.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "宝剑沉埋古狱边，虹光夜夜上冲天。 虎龙战罢三田静，何处求他汞与铅。 嘎嘎嘎，嘻嘻嘻，且休认鹿为马，一个玄珠在泥底。 牛女桥边路不通，河车远去杳无踪。 凭谁问得真消息，吹彻重失籍巽风。 直泄天机图论 金丹之图既成，虑天机之犹秘，且论五行之颠倒，述水火之流行，明药材之进退，体日月之循环，余前所着三篇之文尽矣。 今虑夫学者未明，故为此书。 此书者，直地天机，动见毫发； 化顽石而成金，点瓦砾而成玉。 不啻过也！ 夫两目为役神之舍，顾瞻视听，神常不得离之。 两耳为送神之地，盖百里之音闻于耳，而神随之而去。 两鼻为劳神之位，随感而辩熏莸。 辩之者谁？ 神也。 使耳、目、口、鼻皆如眉，则神岂不安而全之？ 夫如是，则不为后天也。 亦不劳修炼也。 大抵忘于目，则神归于鼎，而烛于内。 盖绵绵若存之时，目垂而下顾也。 忘于耳，则神归于鼎，而闻于内。 盖绵绵若存之时，耳内听于下也。 忘于鼻，则神归于鼎，而吸于内。 盖真息既定之时，气归元海之理。 合而言之，俱忘而俱归于鼎，而合于内矣。 口诀：鸡能抱卵心常听。 或问金丹之道。 耳、目、口、鼻固亦得闻之矣，心固不言可知也。 肝、胆、脾、胃、肺、肾，无用之物也。 还亦无用之中，而有功者也？ 予答之曰，此固已到而后加其理，但余誓以无隐，夫何隐之有？ 吾初从师，亦叩矣，师赠我以诗曰： 五湖风景阔漫漫，鹭立沙滩宇宙宽。 画出枉劳君指点，异时游到尽堪看。 余初未达此理，后到此田地，始信师言之不我欺也。 今以师不言之旨并言之： 夫五行之用，不可缺一。 故绵绵若存之顷，脾气与胃气相接，而归于心缕。 肝气与胆气相接，从大小肠接于肾缕。 肺气伏心气，而通于鼻。 是气也，肾脾定之余，元气周流，自东而西，自南而北之气也。 而南乃气之会也，气合而归于此。 却自夹脊，直透上、中丹田，而降于肾腑。 两肾中间，有治命桥一带。 故寒山子曰：“上有牺神窟，横安治命桥”者，此也。 气降至于此，阳气盛而上冲，与此气相接于一，则固围于鼎器之外。 日用之，则日增经营之力。 故鄞鄂之成，肇于此也。 忽然有一物，超然而出，不内不外，金丹之事，不言可知矣。 一半玄之，又玄一半者，何也？ 曰，金丹之上，到此则一半矣。 ○超然而出者，乃玄关一窍也。 其大无外，其小无内。 ○有形之中也，○无形之中也。 先就有形之中，寻无形之中，乃因命而见性也。 就无形之中，寻有形之中，乃因性而见命也。 先性故难，生命则有下手处。 譬之万里虽远，有路可通。 先性则如水中捉月，然及其成功，一也。 先性者，或有胜焉。 彼以性制命，我以命制性，故也未容轻议。 用力到者至，知其然也。 未见，不必存之以有，恐至着相。 或又曰：“子画图中多有窍，何也？ ”曰：“斯窍也，非采取交会图之窍也。 盖一阴一阳之谓道，往来不可穷。 用之，则充塞于一身之中，是此物之作用。 不用，则归藏于心田之一，了无形像。 然则何物耳？ ○○，意之主耳。 左属阳，右属阴。 到这里，方是返太极处。 曰，返太易者，自太极。 返太极者，自太和。 致太和者，自阴阳始。 故曰，阴阳和而风雨时，嘉禾生者。 譬之若此。",
      "translated_text": "The precious sword lies buried by the ancient prison’s edge,\nNightly its rainbow glow surges toward the heavens.\nAfter the tiger and dragon’s battle in the Three Fields subsides,\nWhere shall one seek mercury and lead?\n\n*Gaga, haha, haha*—\nDo not mistake the stag for a horse—\nA single dark pearl lies buried in the mud.\n\nThe path to the Cowherd-Weaver bridge is blocked,\nThe River Chariot has vanished without a trace.\nWho can ask for the truth?\nThe *Perverse Wind* of the *Lost Register* blows it away.\n\n---\n\n**Exposition of the *Direct Revelation of Heaven’s Secrets* Diagram:**\n\nWhen the *golden elixir* diagram is complete,\nYet Heaven’s secrets remain concealed,\nI now expound the inversion of the Five Phases,\nTrace the circulation of Water and Fire,\nClarify the advance and retreat of medicinal substances,\nAnd embody the cyclical motion of sun and moon.\nWhat I wrote in the previous three sections is now exhausted.\n\nNow, considering that scholars may still not comprehend,\nI write this book.\nThis book—\nIt lays bare the earthly *Heavenly Mechanism*,\nAnd every movement reveals the minutest detail.\nIt transmutes stubborn stone into gold,\nAnd turns worthless pebbles into jade.\nHow could this not be so!\n\nThe two eyes are the abode of the *spirit*—\nGazing and listening, the spirit never departs from them.\nThe two ears are the passage for the *spirit*—\nFor even sounds from a hundred *li* away reach the ears,\nAnd the spirit follows them away.\n\nThe two nostrils are the toil of the *spirit*—\nDiscerning scents and distinguishing fragrant from foul.\nWho discerns? The *spirit* does.\nIf the ears, eyes, mouth, and nostrils were all like the eyebrows,\nWould the *spirit* not then be at peace and whole?\n\nIf so, then it is not of the *Post-Heaven*—\nNor does it require cultivation and refinement.\n\nGenerally, if one forgets the eyes,\nThe *spirit* returns to the *cauldron*,\nAnd illuminates within.\nWhen the *subtle essence* lingers,\nThe eyes droop downward in contemplation.\n\nIf one forgets the ears,\nThe *spirit* returns to the *cauldron*,\nAnd hears within.\nWhen the *subtle essence* lingers,\nThe ears listen inwardly below.\n\nIf one forgets the nostrils,\nThe *spirit* returns to the *cauldron*,\nAnd inhales within.\nWhen the true breath is settled,\nThe *qi* returns to the *Primordial Sea*—this is its principle.\n\nIn summary, when all are forgotten,\nThey all return to the *cauldron*,\nAnd merge within.\n\n**Mnemonic verse:**\n*The rooster can brood its egg—listen with a constant heart.*\n\nSomeone asks of the *golden elixir* Dao:\nThe ears and eyes, mouth and nostrils—\nThey have indeed heard it,\nBut the heart speaks not—this is clear.\n\nThe liver, gallbladder, spleen, stomach, lungs, and kidneys—\nAre they useless things?\nYet within their uselessness, there is function.\nI answer: This is only after one has arrived,\nAnd then applies the principles.\nBut I have sworn to conceal nothing—\nWhat is there to conceal?\n\nWhen I first studied under my teacher,\nI questioned him, and he gave me this poem:\n\n*\"The Five Lakes’ scenery stretches boundless and vast,\nThe heron stands on the sand—cosmos so wide.\nDrawing it out is in vain—let me point it out to you—\nWhen you travel there yourself, you’ll see it fully.\"*\n\nAt first, I did not grasp this principle,\nBut later, when I reached this stage,\nI believed my teacher had not deceived me.\n\nNow, I express what my teacher left unsaid:\n\nThe functions of the Five Phases\nMust not lack a single one.\nThus, when the *subtle essence* lingers,\nThe *qi* of the spleen and stomach meet\nAnd return to the *heart’s thread*.\nThe *qi* of the liver and gallbladder meet,\nPassing through the large and small intestines,\nAnd return to the *kidney’s thread*.\nThe *qi* of the lungs submits to the *heart’s qi*\nAnd communicates through the nostrils.\n\nThis *qi*—\nAfter the *kidney* and *spleen* are settled,\nThe *Primordial Qi* circulates throughout,\nMoving from east to west, from south to north.\nThe south is where the *qi* converges,\nAnd when it converges, it returns here.\n\nFrom the *central spine*, it pierces the Upper, Middle, and Lower *Elixir Fields*,\nDescending to the *kidney* organs.\nBetween the two kidneys lies the *Life-Governing Bridge*.\nThus, *Han Shanzi* said:\n*\"Above lies the *Sacrificial Spirit’s Cave*,\nAnd the *Life-Governing Bridge* is laid horizontally.\"*\nThis is it.\n\nWhen the *qi* descends to this point,\nThe *yang* *qi* flourishes and surges upward,\nMeeting this *qi* at one point—\nIt is then enclosed outside the *cauldron-vessel*.\nUsing it daily increases the *nourishing* power.\nThus, the completion of *Yin-Yu* begins here.\n\nSuddenly, something emerges—\nNeither within nor without,\nAnd the matter of the *golden elixir* is known.\n\nHalf is mysterious,\nAnd half is again mysterious—\nWhy so?\nBecause when one reaches the *golden elixir*’s peak,\nThis is half.\nThe thing that emerges beyond—\nThis is the *Mysterious Pass*.\n\nIts greatness knows no outer bound,\nIts smallness knows no inner limit.\n\nWithin the realm of form,\nSeek the realm without form—\nThis is to perceive *nature* through *command*.\nWithin the realm without form,\nSeek the realm of form—\nThis is to perceive *command* through *nature*.\n\nTo begin with *nature* is difficult,\nBut *command* provides a starting point.\nIt is like a journey of ten thousand *li*—\nThough distant, there is a path to traverse.\nTo begin with *nature* is like grasping the moon in water,\nYet when success is achieved, the result is the same.\n\nTo begin with *nature* may have its advantages.\nFor others, *nature* governs *command*,\nBut for me, *command* governs *nature*—\nThus, it cannot be lightly dismissed.\nThose who exert effort reach it,\nFor they know its truth.\n\nSomeone else asks:\n*\"Why are there so many *orifices* in your diagrams?\"*\nI say:\nThese *orifices* are not those of the *Intercourse of Yin and Yang* diagrams.\nFor *Dao* is the interplay of one *yin* and one *yang*—\nIts comings and goings are endless.\nWhen used, it fills the entire body,\nThis is its function.\nWhen unused, it is stored in the *heart’s field*—\nFormless and without trace.\n\nThen what is it?\nThe master of intention.\nThe left belongs to *yang*,\nThe right to *yin*.\nOnly here does one return to the *Supreme Polarity*.\n\nTo return to the *Supreme Simplicity*—\nThis is from the *Supreme Polarity*.\nTo return to the *Supreme Harmony*—\nThis is from the *Supreme Simplicity*.\nTo achieve the *Supreme Harmony*—\nThis begins with *yin* and *yang*.\n\nThus it is said:\n*\"When *yin* and *yang* are harmonized, winds and rains come in season,\nAnd the auspicious grain grows.\"*\nIt is like this.",
      "overlap_context": "epts of the Dao—is this not so? This is my elixir method.\"*\n\nThe poem says:\n*\"Why trouble the maiden or the babe,\nwhen clarity reveals it all?\nWithin the body, Heaven and Earth invert—\nin the jar, sun and moon revolve.\n\nKnow that *One* is the use of *yang*,\nand grasp the *qi*-mechanism within it.\nHeaven’s messenger, Purple Yang, has spoken—\nwhy seek more teachers after this?\n\nThe diagram of Heaven’s secrets is laid bare—\nnow you grasp the principle.\nYet do not rejoice—ah!\nHow will you proceed?\"*",
      "start_char": 9185,
      "end_char": 10443,
      "start_sentence": 601,
      "end_sentence": 678,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 16.717214584350586,
      "metadata": {
        "source_file": "dao\\藏外\\青华秘文.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "大衍五十，天数一，地数二。 天三地四，天五地六，天七地八，天九地十。 阳奇阴偶。 天数二十五，地数三十，合而为五十有五。 大衍之数五十，去五以象五行者，后之鼎内外　　是也。 又就其中克一，象太极之不动，其用四十有九。 又就其中克一，以为鄞鄂，其用四十有八。 学人行炉鼎用火之法，以四卦为主，以六十卦为用，存乾坤坎离也。 又以大衍图求其象，则循环之理明矣，周天之法泄矣。 如或未明，更请看炉鼎图论云。 ” 蟾光论 太虚廖廓，皓月灿然。 雪浪翻腾，金蟆吐耀。 人见月之所以明，而曰金格盛，则月明焉。 孰知金之所以生者，自月而产也。 人见金之产于月，而不知月之明，本出于日也。 月者喻元性也。 水，喻坎官也。 金蟆者，喻一点真阳之窍也。 元性喻月，性之用也。 性之初见如星大，园陀陀、光烁烁，未足以见性。 但气质之性稍息，而无性略见。 如云开则月见，顷合则亦然耳。 至于不时时存之，则可没，与见未见时无以也。 故金丹之士，才见此物分明，便是元气产矣。 遂以而用之，譬之见贼便捉，毋使再逸。 然以之收于鼎器之中，而一点元气之真，终不可得出矣。 以丹田为目，以心动中元性为月，目光自返照月。 盖交会之后，宝体乃生金也。 月受日气，故初三生一阳者。 丹既居鼎。 觉一点灵光，自心常照而无昼夜。 一阳生，于月之八日，而二阳产矣。 二阳者，丹之金气少旺，而元性又少现。 自二阳生，于　　望，而三阳纯矣。 三阳纯者，是所谓元性尽现，即前谓无形之中也。 一阳纯生时，但觉吾身有一物，或明或隐。 二阳生时，则遍体生明矣。 三阳生者，则光不在内、不在外，但觉此身如在虚空。 亦无身，亦无虚空，亦无日，亦无月，常能如此则禅定也。 但丹士若生于有，而不能采真空，而以无为用也。 既至于此，而金丹且半，何也？ 且元神见矣，而未归丹于鼎，混精气而为一，所以为半矣。 更说他后一半底道理。 月既望矣，十六而一阴生。 一阴者，性归于命之始也。 自一阴生，至于月之二十三而二阴产矣。 二阴者，乃性归于命三之二也。 自二阴生于月之三十日，而三阴全矣，三阴乃性尽归于命也。 性之全体见，绵绵若存之时，则性反乎命内矣。 方其始也，以命而取性，性全矣。 又以性安命，此是性命天机括处。 所谓性命双修者，此之谓也。 天机至密，无尽泄矣，到此际则金丹之全世。 始于火候，凡一日用度，则一日养之。 百日之功，而婴儿产矣，故吾以月为之喻，取其交会相照之理也。 月明实本于金，金之性实出于月。 百炼愈坚，万劫不坏。 盖金，日也。 月性也。 火，日气。 金入火而复于元性之真，可以炼成至宝，号为金液还丹。 故修丹者，始焉取金。 为金生水，交合之理显，而籍土以成之。 故城廓基址，元始非托真金药，而固济提防之。 炼成纯金，故曰金丹。 炉鼎图论 鼎之为器，非金非铁。 炉之为具，非玉非石。 黄庭为鼎，气穴为炉。 黄庭正在气穴上，缕络相连，是为炉鼎。 阴阳为炭，以烹以炼。 夫黄庭之在身上，交会之顷，乃元气立之际。 此时正开，而丹落于其中，逐固之。 所谓水银实葫芦里，闭塞其口，置深水者也。 水银，铅汞也。 葫芦，黄庭也．深水者，水犹气也。",
      "translated_text": "The *Great Unfolding* has fifty. Heaven’s number is one, Earth’s number is two.\nHeaven three, Earth four; Heaven five, Earth six; Heaven seven, Earth eight; Heaven nine, Earth ten.\nOdd belongs to *yang*, even to *yin*.\nHeaven’s number is twenty-five, Earth’s number is thirty—together they make fifty-five.\nThe *Great Unfolding*’s number is fifty; subtracting five to symbolize the Five Phases—\nThis is the inner and outer vessels of the later *Cauldron*.\nAgain, subtracting one from within, symbolizing the *Supreme Polarity*’s immobility—its use is forty-nine.\nAgain, subtracting one from within, to form *Yin-Yu*—its use is forty-eight.\nThe adept practices the *Cauldron* and *Furnace* methods with fire, taking the Four *Guas* as master and the sixty-four *Guas* as use, preserving *Kan* and *Li*.\nAgain, using the *Great Unfolding* Diagram to seek its symbols,\nThe logic of cyclical return becomes clear, and the *Complete Heaven*’s method is revealed.\nIf still unclear, further examine the *Furnace and Cauldron Diagram Treatise*.\n\n---\n\n**Moonlight Treatise**\nThe *Great Void* is vast and empty, the moon radiant and bright.\nSnow-waves surge, the golden toad emits its luster.\nMen see why the moon shines and say, *\"The golden vessel is full, thus the moon is bright.\"*\nWho knows that the source of gold’s birth\nIs produced from the moon itself?\nMen see gold produced by the moon,\nYet do not know the moon’s brightness\nOriginally comes from the sun.\n\nThe moon symbolizes *Original Nature*.\nWater symbolizes the *Kan* organ.\nThe golden toad symbolizes the aperture of *True Yang*’s single point.\n*Original Nature* is like the moon—its manifestation.\nAt first, its appearance is like a star’s size,\nRound and radiant, yet insufficient to reveal *Nature*.\nBut when the *qi*-nature’s vigor slightly subsides,\nA trace of *Nature* begins to show—\nLike clouds parting to reveal the moon,\nThen closing again.\n\nIf not constantly preserved,\nIt may vanish—no different from when unseen.\nThus, the alchemists of *Golden Elixir*,\nOnce this substance is clearly seen,\nKnow that *Original Qi* has been born.\nSeize it immediately—like catching a thief before he flees—\nLest it escape again.\nYet when gathered into the *Cauldron*’s vessel,\nThat single point of *True Qi*’s essence\nCannot be fully extracted.\n\nTake the *Dan Tian* as the eye,\nThe stirring of *Original Nature* in the heart as the moon—\nThe eye’s light returns to illuminate the moon.\nFor after *Intercourse*,\nThe precious body generates gold.\nThe moon receives the sun’s *qi*—\nThus, on the first day of the waxing moon, one *yang* is born.\n\nThe elixir resides in the *Cauldron*.\nAwakening to a single point of luminous light,\nThe heart constantly shines without day or night.\nOne *yang* arises—\nOn the eighth day of the moon, two *yang* are produced.\nTwo *yang*: the elixir’s golden *qi* slightly thrives,\nWhile *Original Nature* slightly manifests.\nFrom two *yang*’s birth—\nAt the full moon, three *yang* are complete.\nThree *yang* complete: *Original Nature* fully revealed—\nThis is the formless state previously spoken of.\nWhen one *yang* is pure, one feels within the body\nA thing—sometimes clear, sometimes hidden.\nWhen two *yang* arise, luminosity spreads throughout the body.\nWhen three *yang* arise,\nThe light is neither inside nor outside—\nOnly a sense of this body as if in empty space,\nNeither body nor space, neither sun nor moon.\nIf constantly thus, this is *Dhyana*.\nYet if the alchemist is born of *having*,\nUnable to embrace *True Void* and use *non-being*,\nEven at this stage, the *Golden Elixir* remains half-formed—\nWhy?\nFor though *Original Spirit* is seen,\nIt has not yet returned to the *Cauldron*—\nThe mingling of *jing* and *qi* into one\nIs why it is half.\n\nNow speaking of the latter half’s logic:\nThe moon reaches fullness—\nOn the sixteenth, one *yin* arises.\nOne *yin*: the beginning of *Nature*’s return to *Fate*.\nFrom one *yin*’s birth—\nBy the moon’s twenty-third day, two *yin* are produced.\nTwo *yin*: *Nature*’s return to *Fate*’s third phase.\nFrom two *yin*’s birth—\nOn the thirtieth day of the moon, three *yin* are complete,\nThree *yin*: *Nature* fully returns to *Fate*.\nWhen *Nature*’s whole body appears,\nContinuously preserved,\n*Nature* reverses into *Fate*’s domain.\nAt its start, *Fate* takes *Nature*—*Nature* is complete.\nAgain, *Nature* stabilizes *Fate*—\nThis is the critical juncture of *Nature* and *Fate*’s celestial mechanism.\nThis is what is meant by *\"dual cultivation of *Nature* and *Fate*\"*.\nThe celestial mechanism is most secret—\nNo further disclosure.\nAt this juncture, the *Golden Elixir* is fully realized.\n\nIt begins with fire’s alchemy—\nEach day’s practice, each day’s nourishment.\nA hundred days’ effort, and the infant is born—\nThus I use the moon as analogy,\nTaking its reciprocal illumination’s logic.\n\nThe moon’s brightness truly originates from gold,\nYet gold’s essence truly comes from the moon.\nRefined a hundred times, unbreakable through ten kalpas.\nFor gold is the sun,\nThe moon is *Nature*.\nFire is the sun’s *qi*.\nGold entering fire returns to *Original Nature*’s truth,\nRefined into the supreme treasure—\nCalled *Golden Elixir Reverted*.\nThus, those who cultivate the elixir\nBegin by taking gold.\nFor gold generates water—\nThe logic of *Intercourse* is revealed,\nAnd relies on earth to complete it.\nThus, the city’s foundations and defenses\nOriginally depend not on true gold medicine,\nBut on securing and fortifying it.\nWhen pure gold is refined, it is called *Golden Elixir*.\n\n**Furnace and Cauldron Diagram Treatise**\nThe *Cauldron* as vessel is neither gold nor iron.\nThe *Furnace* as tool is neither jade nor stone.\nThe *Yellow Court* is the *Cauldron*,\nThe *Qi*-aperture is the *Furnace*.\nThe *Yellow Court* lies directly above the *Qi*-aperture,\nThreaded and connected—this is the *Furnace* and *Cauldron*.\n*Yin* and *yang* are the fuel,\nUsed to cook and refine.\nWhen the *Yellow Court* is on the body,\nAt the moment of *Intercourse*,\nThis is when *Original Qi* is established.\nAt this time, the aperture opens,\nAnd the elixir falls within—\nSeal it firmly.\nThis is like sealing mercury in a gourd,\nClosing its mouth,\nAnd placing it in deep water.\nMercury: lead and quicksilver.\nThe gourd: the *Yellow Court*.\nDeep water: *qi* itself.",
      "overlap_context": " what is it?\nThe master of intention.\nThe left belongs to *yang*,\nThe right to *yin*.\nOnly here does one return to the *Supreme Polarity*.\n\nTo return to the *Supreme Simplicity*—\nThis is from the *Supreme Polarity*.\nTo return to the *Supreme Harmony*—\nThis is from the *Supreme Simplicity*.\nTo achieve the *Supreme Harmony*—\nThis begins with *yin* and *yang*.\n\nThus it is said:\n*\"When *yin* and *yang* are harmonized, winds and rains come in season,\nAnd the auspicious grain grows.\"*\nIt is like this.",
      "start_char": 10443,
      "end_char": 11702,
      "start_sentence": 679,
      "end_sentence": 756,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 16.734084606170654,
      "metadata": {
        "source_file": "dao\\藏外\\青华秘文.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "闭塞黄庭，隐藏丹母，而置于气会之地，达者审之，得其趣也。 虎啸风生，龙吟云起。 蟋蟀吟秋，蜉蝣显阴。 万气归鼎，而封固愈密，烹炼愈坚，此炉鼎之所以有也。 万卷丹经要旨，图画立象，本使人得象忘言。 后之学者，皆泥象寻真，各求诡论。 岂知夫至道不繁，枢纽阴阳而已矣。 如以天一生水云云之数而言者，此亦不过明水火之流行耳。 如以四时八节而言者，此亦不过喻天地、阴阳消长耳。 秘其母而言其子，故知之者鲜矣。 用成今所以着为此书者，皆弃枝叶，而言本根。 本根有而枝叶自芳。 盖古人不欲言，而余言之。 道中君子，宜体此意，毋以小道观焉。 依此而行，神仙可立跻也。 或问，炉鼎之体明类，炉鼎之用，亦愿闻焉。 天地间百卉、草木，万类散殊。 冬至之后，阳动于下。 则枯水重荣，百草萌芽。 蛰虫奋发，万类熙怡。 造化岂有心而生万物？ 万物亦何心而望造化？ 盖一气之动，万类感而然耳。 天何心哉？ 物何心哉？",
      "translated_text": "**Furnace and Cauldron Diagram Treatise (continued)**\n\nSeal the *Yellow Court*,\nConceal the *Elixir Primordial*,\nAnd place it in the realm of *Qi*-confluence—\nThe adept shall ponder this,\nAnd grasp its essence.\n\nThe tiger’s roar summons the wind,\nThe dragon’s chant stirs the clouds.\nThe cricket sings of autumn’s arrival,\nThe mayfly reveals the *yin*.\nAll *qi* returns to the *Cauldron*,\nAnd the seal grows ever tighter,\nThe refining ever more steadfast—\nThis is the *Furnace* and *Cauldron*’s true nature.\n\nThe core principles of ten thousand *Dan* scriptures,\nDiagrams and symbols standing forth—\nThese are meant to let one forget the symbols and grasp the truth.\nLater scholars, however,\nCling to the symbols and seek the true meaning,\nEach pursuing strange theories.\n\nYet know that the supreme *Dao* is not elaborate—\nIt hinges only on *yin* and *yang*.\nAs for the saying, *\"Heaven One begets Water, Clouds, and such\"*—\nThis merely elucidates the circulation of *water* and *fire*.\nWhen one speaks of the *Four Seasons* and *Eight Nodes*,\nThis merely illustrates the waxing and waning of *Heaven* and *Earth*,\nOf *yin* and *yang*.\nHiding the *Primordial* and speaking of its *manifestation*,\nThus few truly comprehend it.\n\nAll that I have now written\nDiscards the branches and speaks of the roots.\nThe roots exist, and the branches will naturally flourish.\nThe ancients did not wish to speak,\nYet I have spoken.\nThe *Dao*-worthy among men\nShould embody this intent,\nAnd not view it through the lens of lesser ways.\nFollow this, and the *Immortal* may be attained.\n\nSome ask, *\"The nature of the Furnace and Cauldron is clear in its analogy—\nI would also hear of their use.\"*\n\nBetween *Heaven* and *Earth*, myriad herbs and grasses,\nTen thousand kinds, diverse and scattered.\nAfter the *Winter Solstice*, *yang* stirs from below—\nThen withered plants regain their vigor,\nA hundred grasses sprout anew.\nHibernating insects awaken,\nAll kinds rejoice in vitality.\nDoes *Creation* have a mind and thus birth the myriad?\nDo the myriad have minds and thus await *Creation*?\nIt is but the movement of *Qi* itself—\nAll kinds respond and come to be.\n*Heaven* has no mind, does it?\nThe myriad have no minds, do they?",
      "overlap_context": "i*-aperture,\nThreaded and connected—this is the *Furnace* and *Cauldron*.\n*Yin* and *yang* are the fuel,\nUsed to cook and refine.\nWhen the *Yellow Court* is on the body,\nAt the moment of *Intercourse*,\nThis is when *Original Qi* is established.\nAt this time, the aperture opens,\nAnd the elixir falls within—\nSeal it firmly.\nThis is like sealing mercury in a gourd,\nClosing its mouth,\nAnd placing it in deep water.\nMercury: lead and quicksilver.\nThe gourd: the *Yellow Court*.\nDeep water: *qi* itself.",
      "start_char": 11702,
      "end_char": 12083,
      "start_sentence": 757,
      "end_sentence": 781,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 6.8869922161102295,
      "metadata": {
        "source_file": "dao\\藏外\\青华秘文.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "至于百卉，花开结实之际，正药物循环之时。 落叶凋芳之际，正药物归根复命之时。 可喻古人警药物产、降而成丹，莫有出于此者。 但不可泥于无心，使其自浮自沉。 亦不可泥于有心，而驱驰逐火。 但绵绵若存，知其无，守其有。 知其白，守其黑。 静中行火候，定里结还丹。 赠之以中。 神室图论 神堂者，元神所居之室，鄞鄂是也。 人知立鄞鄂之造化，显然彰露矣。 仰不知有室而无主人，何取其为室哉？ 然主人虽无， 而主人之胎，亦在乎一室之中矣。 如怀孕然，十月之间，母呼亦呼，母吸亦吸，但气未足耳。 气足而形完，一点灵光人于其中，则攸然而生。 啼哭锵然，纯乎其人矣。 此乃鄞鄂成，而神归于室之时也。 神归其室，则所谓得其一，万事毕矣。 盖交媾之后，神光垂，而烛乎玄珠矣。 精华升，而产于玄珠矣。 真铅则元气矣。 精、气、神亦先有胚胎在其中矣。 火足气充，则元精、元气、元神尽合而为一，故婴儿产矣。 婴儿岂自产焉？ 火烁尽群阴，而胎始脱，到此方是产婴儿。 吾尝谓古人画炼丹之图象⊙，○固鄞鄂也，此一点安，逐不知安一点于中之道。 暂结终散，猛火空烧，而离坎逸矣。 夫此一点产于外，而顺于后天者。 一生二，二生三，三生万物。 皆从此。 常人为之，志士反焉。",
      "translated_text": "When it comes to myriad herbs,\nAt the moment of blossoming and fruiting—\nThis is when medicinal substances follow their cycle.\nWhen leaves fall and fragrance fades—\nThis is when medicinal substances return to their roots and fulfill their nature.\nThis may illustrate how the ancients gathered medicinal substances\nAs they grew and declined to forge the Elixir—\nNone surpassed this method.\n\nYet one must not rigidly adhere to the notion of *Creation* having no mind,\nLetting things float or sink on their own.\nNor must one rigidly adhere to the notion of *Creation* having a mind,\nDriving and chasing after fire.\n\nInstead, one must maintain a steady presence,\nKnowing its absence while holding to its presence.\nKnowing its whiteness while holding to its blackness.\nWithin stillness, regulate the fire’s timing;\nWithin steadiness, forge the *Returned Elixir* in its core.\nBalance it with moderation.\n\nThe *Divine Chamber*—as discussed in *The Diagram of the Divine Hall*—\nIs the chamber where the *Original Spirit* resides, the *Yinyuè* [1] being such.\nMen know to establish the *Yinyuè*’s *Creation*,\nIts essence clearly revealed.\n\nYet if one does not know there is a chamber without its master,\nWhat use is the chamber itself?\nBut though the master may be absent,\nHis embryo still lies within that chamber.\n\nLike a pregnancy—\nWithin ten months, when the mother breathes, the child breathes;\nWhen the mother inhales, the child inhales—\nOnly the *qi* is insufficient.\n\nWhen the *qi* is full and the form complete,\nA single point of luminous spirit enters within—\nThen it emerges with a start.\nIts cries resound clearly—\nPurely human in essence.\n\nThis is when the *Yinyuè* is complete,\nAnd the spirit returns to its chamber.\n\nWhen the spirit returns to its chamber,\nThen one has attained its unity—\nAll else is accomplished.\n\nFor after the union,\nThe spirit-light descends,\nIlluminating the *Mysterious Pearl*.\nThe *Essence* ascends,\nAnd is born from the *Mysterious Pearl*.\n\nTrue *Lead* is the *Original Qi*.\n*Essence*, *Qi*, and *Spirit* already have their embryos within.\nWhen fire is sufficient and *qi* is full,\nThe *Original Essence*, *Original Qi*, and *Original Spirit* merge as one—\nThus the infant is born.\n\nThe infant does not produce itself—\nOnly when fire consumes all *yin* does the embryo emerge,\nAnd only then is the infant born.\n\nI have said that the ancients’ diagrams of Elixir cultivation [2]\nAre indeed the *Yinyuè*—\nYet they failed to grasp the method of securing that single point within.\nTemporarily formed, then finally dispersed,\nFierce fire burns in vain—\nAnd the *Kan* [3] escapes.\n\nThis single point, born externally,\nFollows the *Post-Heaven* sequence—\nOne generates Two, Two generates Three,\nAnd Three generates the myriad.\nAll stems from this.\n\nCommon men act thus,\nBut the determined revert to its source.",
      "overlap_context": " myriad herbs and grasses,\nTen thousand kinds, diverse and scattered.\nAfter the *Winter Solstice*, *yang* stirs from below—\nThen withered plants regain their vigor,\nA hundred grasses sprout anew.\nHibernating insects awaken,\nAll kinds rejoice in vitality.\nDoes *Creation* have a mind and thus birth the myriad?\nDo the myriad have minds and thus await *Creation*?\nIt is but the movement of *Qi* itself—\nAll kinds respond and come to be.\n*Heaven* has no mind, does it?\nThe myriad have no minds, do they?",
      "start_char": 12083,
      "end_char": 12587,
      "start_sentence": 782,
      "end_sentence": 814,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 7.3182923793792725,
      "metadata": {
        "source_file": "dao\\藏外\\青华秘文.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 20,
      "original_text": "逆之而产于内，则长生久视之道存矣。 岂非归根复命乎？ 命复归根之由，深根固蒂也。 深根固蒂之道，自澄心、遣欲。 澄心之理，屏视去听。 如孔子曰：“非礼勿视，非礼勿言，非礼勿听，非礼勿动。 ”此便是真实道理。 但德教欲行于世、用于时，故以礼为之防。 所为安心者，喜、怒、哀、乐各等耳。 忠、恕、慈、顺、恤、恭、敬、谨，则为真心。 修丹之士，则以真心亦为妄心。 混然返其初，而原其始。 却就无妄心中，生一真心。 奋天地有为，而终则至于无为也。 若释氏之所谓真心，则又异焉。 放下六情，了无一念。 性地廓然，真元自见。 一见之倾，来往自在。 盖静之极，至于极之极，故见太极。 则须用一言半句之间，如死一场，再生相似。 然后可以造化至机，而为不生不死之根本，岂易窥其门户耶？ 火候图论 《易》之为书，三百八十四交。 火之为数，三百八十四铢。 故舍乾坤以为鼎器，坎离为药物。 之外，初一、用屯、蒙。 初二、用需、讼。 初三、用师、比。 初四、用小畜、履。 初五、用泰、否。 初六、用同人、大有。 初七、用谦、豫。 初八、用随、蛊。 而金计半斤。 初九、用临、观。 初十、用噬嗑、贲。 十一、用剥、复。 十二、用无妄、大畜。 十三、用颐、大过。 十四、用咸、恒。 十五、用遁、大壮。 十六、用晋、明夷。 十七、用家人、睽。 十八、用蹇、解。 十九、用损、益。 二十、用夬、垢。 二十一、用萃、升。 二十二、用困、井。 二十三、用革、鼎。 而水半斤。 二十四、用震、艮。 二十五、用渐、归妹。 二十六、用丰、旅。 二十七、用巽、兑。 二十八、用涣、节。 二十九、用中孚、小过。 三十、用既济、未济。 顷刻而周，周而复始。 自日月运行，一寒一暑。 天地氤氲，万物化醇。 倒造化，翻乾坤。 窃宇宙，盗阴阳。 达天地之至道，始可与言此也。 或问乾、坤、坎、离之体。 曰：“周天火候之时，坎离交矣。 坎离交，则乾坤交会矣。 夫天道下降，地气上升，乃乾坤之用也。 坎者，乾交坤也。 离者，坤交乾也。 其他卦象，不过设体耳。 亦不可泥象寻爻，而火候之法始见。 ” 又曰；",
      "translated_text": "「Turning it back and producing it within,\nThen the Dao of longevity and eternal vision is preserved.\n\nIs this not returning to the root and restoring the command?\n\nThe means of returning to the root and restoring the command\nLies in deep roots and firm foundations.\n\nThe Dao of deep roots and firm foundations\nIs rooted in purifying the heart and dispelling desires.\n\nThe principle of purifying the heart\nIs to screen out sight and hearing.\n\nAs Confucius said:\n*\"Do not look upon what is not right, do not speak of what is not right,\nDo not listen to what is not right, do not act upon what is not right.\"*\n\nThis is the true and genuine principle.\n\nBut since virtue and teachings must be practiced in the world and applied in time,\nTherefore, they use *li* (ritual propriety) as its guard.\n\nWhat is called securing the heart\nAre the equalities of joy, anger, sorrow, and delight.\n\nLoyalty, forgiveness, kindness, compliance, compassion,\nreverence, respect, solemnity, and caution—\nthese are the true heart.\n\nThose who cultivate the Elixir,\nYet treat the true heart as a false one,\nMingle it in confusion and revert to its beginning,\nOnly to rediscover its origin.\n\nReturning to the realm without false thoughts,\nA true heart is born anew.\n\nStirring the Heavenly-Earthly *forces*,\nYet ultimately reaching the state of *non-action*—\n\nIf the Buddhist teaching of the so-called true heart,\nThen it is indeed different.\n\nLaying aside the six *sentiments*,\nWith no thought at all.\n\nThe nature is vast and clear,\nThe true *Original Essence* manifests itself.\n\nAt the moment of its revelation,\nMovement and stillness become effortless.\n\nFor when stillness reaches its utmost extreme,\nIt attains the *Tàijí* (Supreme Polarity).\n\nThen, within a word or half a sentence,\nLike death in a single instant,\nOne must be reborn anew.\n\nOnly then can one grasp the profound mechanisms of transformation,\nAnd establish the foundation for neither birth nor death—\nHow easily can one fathom its gate?\n\n**The Fire-Candidate Diagram and Theory**\n\nThe *Book of Changes* contains **384 hexagrams** [4].\nFire corresponds to **384 *zhū*** (units of weight) [5].\n\nThus, the *Kuaì* (trigrams) *Qián* (Heaven) and *Kūn* (Earth) are used as the *dǐngqì* (furnace vessels),\nAnd *Kān* (Water) and *Lí* (Fire) are the *yàowù* (medicinal substances).\n\nBeyond these, the first stage uses *Lún* (Sprout) and *Méng* (Innocence).\nThe second stage uses *Xū* (Waiting) and *Sòng* (Judicial).\nThe third stage uses *Shī* (Army) and *Bǐ* (Union).\nThe fourth stage uses *Xiǎo Chù* (Lesser Taming) and *Lǚ* (Progress).\nThe fifth stage uses *Tài* (Great) and *Pǐ* (Stagnation).\nThe sixth stage uses *Tóng Rén* (Union of People) and *Dà Yǒu* (Great Possession).\nThe seventh stage uses *Qiān* (Modesty) and *Yù* (Enjoyment).\nThe eighth stage uses *Suí* (Following) and *Guì* (Nurturing).\nAnd the metal measure is half a *jīn* (catty).\n\nThe ninth stage uses *Lín* (Approach) and *Guān* (Contemplation).\nThe tenth stage uses *Shìè* (Devouring) and *Bēn* (Adornment).\nThe eleventh stage uses *Bō* (Peeling) and *Fù* (Return).\nThe twelfth stage uses *Wú Wàng* (No Blame) and *Dà Chù* (Greater Taming).\nThe thirteenth stage uses *Yí* (Nourishment) and *Dà Guò* (Great Exceeding).\nThe fourteenth stage uses *Xián* (Influence) and *Héng* (Constancy).\nThe fifteenth stage uses *Dùn* (Retreat) and *Dà Zhuàng* (Great Strength).\nThe sixteenth stage uses *Jìn* (Advance) and *Míng Yí* (Dark Side of Brightness).\nThe seventeenth stage uses *Jiā Rén* (Family) and *Kuí* (Division).\nThe eighteenth stage uses *Jiǎn* (Diminishing) and *Jiě* (Release).\nThe nineteenth stage uses *Sǔn* (Diminishing) and *Yì* (Increase).\nThe twentieth stage uses *Guài* (Resolving) and *Gòu* (Modesty).\nThe twenty-first stage uses *Cuì* (Gathering) and *Shēng* (Ascendant).\nThe twenty-second stage uses *Kùn* (Difficulty) and *Jǐng* (Well).\nThe twenty-third stage uses *Gé* (Revolution) and *Dǐng* (Tripod).\nAnd the water measure is half a *jīn* (catty).\n\nThe twenty-fourth stage uses *Zhèn* (Shaking) and *Gèn* (Obstructing).\nThe twenty-fifth stage uses *Jiàn* (Gradual) and *Guī Mèi* (Returning Younger Sister).\nThe twenty-sixth stage uses *Fēng* (Fullness) and *Lǚ* (Journey).\nThe twenty-seventh stage uses *Xùn* (Wind) and *Duì* (Joy).\nThe twenty-eighth stage uses *Huàn* (Dispersion) and *Jié* (Moderation).\nThe twenty-ninth stage uses *Zhōng Fú* (Inner Truth) and *Xiǎo Guò* (Lesser Exceeding).\nThe thirtieth stage uses *Jì Jì* (Already Completed) and *Wèi Jì* (Not Yet Completed).\n\nIn an instant, the cycle is complete—\nThe cycle completes and begins anew.\n\nLike the sun and moon in their courses,\nOne cold and one hot.\n\nHeaven and Earth in *yīnyūn* (breathing),\nAll things transform into *huàchún* (pure essence).\n\nReversing transformation,\nFlipping Heaven and Earth.\n\nStealing from the universe,\nRobbing from *Yīnyáng* (yin-yang).\n\nAttaining the supreme Dao of Heaven and Earth,\nOnly then can one speak of this.\n\nSomeone asks about the nature of *Qián* (Heaven), *Kūn* (Earth), *Kān* (Water), and *Lí* (Fire).\n\nI say:\n“When the Fire-Candidate’s time is at its peak,\n*Kān* and *Lí* interact.\n\nWhen *Kān* and *Lí* interact,\nThen *Qián* and *Kūn* unite in harmony.\n\nFor the *Dao* of Heaven descends,\nAnd the *qi* of Earth ascends—\nThis is the function of *Qián* and *Kūn*.\n\n*Kān* is where *Qián* meets *Kūn*,\nAnd *Lí* is where *Kūn* meets *Qián*.\n\nThe other hexagrams\nAre merely auxiliary forms.\n\nOne must not rigidly adhere to the symbols and seek the lines,\nFor the method of Fire-Candidate’s cultivation is only then revealed.”」",
      "overlap_context": "t born.\n\nI have said that the ancients’ diagrams of Elixir cultivation [2]\nAre indeed the *Yinyuè*—\nYet they failed to grasp the method of securing that single point within.\nTemporarily formed, then finally dispersed,\nFierce fire burns in vain—\nAnd the *Kan* [3] escapes.\n\nThis single point, born externally,\nFollows the *Post-Heaven* sequence—\nOne generates Two, Two generates Three,\nAnd Three generates the myriad.\nAll stems from this.\n\nCommon men act thus,\nBut the determined revert to its source.",
      "start_char": 12587,
      "end_char": 13419,
      "start_sentence": 815,
      "end_sentence": 887,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 19.931225061416626,
      "metadata": {
        "source_file": "dao\\藏外\\青华秘文.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 21,
      "original_text": "“似子言之，不过范围天地，运行日月而已。 而炉鼎图又列八卦于鼎中，火侯图又升五位于泥丸，布平桥于卯酉，何也？ ” “天机固不容泄言，既至此，隐之何为？ 且河出图，洛出书。 天尚自泄，况千人乎？ ” 客曰：“止。 余闻泄天机而殃及九祖。 ” “独不闻度一人，而福及九祖乎？ 吾以吾之丹法，尽底无隐，而传于有缘之士。 苟有信士，一人为仙，某岂无功乎？ ” 客曰：“子之用心，非某能知及之。 ” 曰：“是炉也，是鼎也，乃进火，进水之理耳。 水、火无过一气耳。 气之升也，吾以心接之，即火也。 气之降也，吾以静待之，即水也。 此绵绵若存之时，子午进用之功也。 斯时也，方是偃月炉具之时。 夫性见则气生，气生则金生，金生则气多，气多则金愈旺。 此二者交相为用也。 金旺于中，烛破浮云。 露出一勾真性，如月之明，乃偃月炉也。 存养之义，则金气盛而全尽，烛见一轮明月，乃全性也。 既见全性，又返金性，则吾身皆真性、命为之主。 此用火之时也，盖二者未融为一，而用火炼之，炼作纯金也。 包含性命，通体皆阳。 浮沉自在，爱日恋月，好游顶门，时至道成。 奋厉而脱，霹雳一声，身非我有。 吁嘻！ 人人可以如此而成功。 人而自弃之，若是可哀也哉！ 余见总篇，方其九转既周，沐浴已竟。 火力终焉，一星不灭。 故动　　，一风以吹之。 巽风者，鼎下之片缕耳。 阖则为乾，辟则为巽，阖则为嘘，辟则为吸。 何以能开辟？ 亦无非一意使之然。",
      "translated_text": "「If I may speak plainly,\nIt is merely to encompass Heaven and Earth,\nTo regulate the cycles of the sun and moon.\n\nYet the *Furnace and Cauldron Diagram* (炉鼎图) also arranges the Eight Trigrams within the cauldron,\nAnd the *Fire-Candidate Diagram* (火侯图) elevates the Five Phases (五位) at the *Néirán* (泥丸) point,\nBalancing the *Píngqiáo* (平桥) between *Mǎo* (卯) and *Yǒu* (酉) — why is this so?\n\n*The Dao of Heaven* (天机) is naturally not meant to be divulged,\nBut since we have reached this point, what is the purpose of concealing it?\nMoreover, the *Lǒu* (河) gave rise to the Diagram,\nAnd the *Luò* (洛) revealed the Classic.\nHeaven itself has already disclosed its secrets—\nWhat need is there to fear a thousand people?\n\nThe disciple said: *\"Stop!*\nI have heard that revealing *Heaven’s Dao* (天机) brings misfortune to the Nine Ancestors (九祖).\"\n\nI replied: *\"Have you not heard that saving one person brings blessings to the Nine Ancestors?\nWith my elixir method,\nI have fully uncovered its essence—no secrets remain—\nAnd impart it to those with karmic affinity (有缘之士).\nIf there are sincere practitioners,\nOne may attain immortality—\nWhy should I lack merit then?\"*\n\nThe disciple said: *\"Your intentions are beyond what I can comprehend.\"*\n\nI said: *\"This furnace, this cauldron,\nAre merely the principles of advancing Fire, advancing Water.\nWater and Fire are but one breath of *qi* (气).\nWhen *qi* ascends, I meet it with my mind—\nThat is Fire.\nWhen *qi* descends, I await it in stillness—\nThat is Water.\nThis continuous process—\nThe function of *Rùn* (子) and *Wǔ* (午) in advancing Fire and Water—\nIs precisely when the *Yǎnyuè Furnace* (偃月炉) is employed.\n\nWhen one’s *nature* (性) manifests, *qi* (气) is generated;\n*Qi* generated, then *metal* (金) is formed,\nMetal formed, then *qi* abounds,\nAnd *qi* abounding, the Metal’s power grows ever stronger—\nThis is the interplay of the two.\n\nMetal flourishes within,\nPiercing through the floating vapors (浮云).\nThe true nature (勾真性) emerges—\nLike the moon’s radiance,\nThis is the *Yǎnyuè Furnace* (偃月炉).\n\nThe principle of cultivation and preservation (存养) is:\nWhen Metal’s *qi* (金气) is at its peak and fully exhausted,\nA single wheel of bright moon is seen—\nThis is the *full nature* (全性).\n\nOnce the *full nature* (全性) is revealed,\nAnd the Metal’s nature is restored,\nThen my body is entirely composed of true nature (真性),\nAnd *command* (命) governs it.\n\nThis is the time for Fire’s application—\nFor the two have not yet merged into one,\nAnd Fire refines them into pure Metal.\n\nEncompassing nature and *command*,\nThe entire body becomes *yang* (阳).\nRising and sinking at will,\nLoving the sun, cherishing the moon,\nEnjoying celestial wandering (游顶门),\nWhen the time comes, the Dao is achieved.\n\nWith vigor and determination,\nOne breaks free—\nA thunderous crack,\nAnd the body is no longer mine.\n\nAh! Every person can succeed thus.\nYet if one abandons oneself,\nHow pitiful it would be!\n\nI have seen the *Zǒngpiān* (总篇),\nWhen the Nine Transformations (九转) are complete,\nAnd the *Mùyù* (沐浴) ritual is finished.\nFire’s force has reached its end—\nA single star does not extinguish.\n\nThus, movement—\nA single breath to blow it.\n\nThe *Xùn Wind* (巽风) is but a thread beneath the cauldron.\nWhen sealed, it is *Qián* (乾);\nWhen opened, it is *Xùn* (巽).\nWhen sealed, it is exhalation (嘘);\nWhen opened, it is inhalation (吸).\nHow can it open and seal?\nIt is nothing but the will directing it so.»",
      "overlap_context": "Fire-Candidate’s time is at its peak,\n*Kān* and *Lí* interact.\n\nWhen *Kān* and *Lí* interact,\nThen *Qián* and *Kūn* unite in harmony.\n\nFor the *Dao* of Heaven descends,\nAnd the *qi* of Earth ascends—\nThis is the function of *Qián* and *Kūn*.\n\n*Kān* is where *Qián* meets *Kūn*,\nAnd *Lí* is where *Kūn* meets *Qián*.\n\nThe other hexagrams\nAre merely auxiliary forms.\n\nOne must not rigidly adhere to the symbols and seek the lines,\nFor the method of Fire-Candidate’s cultivation is only then revealed.”」",
      "start_char": 13419,
      "end_char": 13999,
      "start_sentence": 888,
      "end_sentence": 929,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 11.501615524291992,
      "metadata": {
        "source_file": "dao\\藏外\\青华秘文.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 22,
      "original_text": "” 或曰：“巽，西方之位。 以子所言，巽乃中宫。 毋乃反乎？ ” 曰； “西方者，巽之用也。 中宫者，巽之体也。 吾自心生一意，而降于巽位，其象始辟，则吾言实兼体用而训也。 继之以乾。 乾：金。 而火乃金精，故遇而炎火张设。 须坎以抑之，抑之而不能止，则有反攻于下之患。 故止以良，而又嘘以巽。 巽上一画属阳，止火非阳不行。 故遇震而稍焰，遇离而复炎。 又止以坤。 坤，水也。 火从水起，如遇其兑。 兑，又西方之卦也。 故自尾闾，徐徐升上，而至泥丸。 顶为天门，为正午之地。 午属火，遂加煌。 又接之以心。 心，火也。 接者，神也，乃神火也。 又加煌。 至卯酉，若直下则刑德临门，危其大哉！ 故一立而各为二道。 今日之卯酉，昔日之坤、艮也。 火，气也。 气降而复升之理，故归于肾府，化为真水而用之。 盖文火性柔而难化，遇卯木必克土。 遂以火克木，则土不受克矣。 武火性强而易化，降自酉。 酉属金，金生水，归于鼎。 ” 曰：“何谓文，何谓武？ ” 曰：“文火自三关上至于天矣，武火是午宫与心火也。 大凡火侯，只此一场，大有危险。 丹士宜一战而胜，则天下定矣。 平日周天火候，切不可以为则也。 然此亦不可执着，彼亦不可执着。 ”",
      "translated_text": "“Some asked: ‘*Xùn* (巽) is the position of the West. According to your words, *Xùn* is the central palace. Is this not contradictory?’\n\nI replied: ‘The West is the *use* of *Xùn*, while the central palace is its *essence*. From my own mind, I generate a single intention and descend it into the *Xùn* position. When its symbol is first manifested, then my words truly encompass both essence and use.\n\nThen it follows with *Qián* (乾). *Qián*: metal. And fire is the essence of metal, so when encountered, flames burst forth in all directions. If one then suppresses it with *Kàn* (坎), suppression cannot be maintained, and there will be danger of a counterattack from below. Therefore, one must restrain it with *Liáng* (良), and again exhale with *Xùn*.\n\nThe upper stroke of *Xùn* belongs to yang (阳), and fire cannot be stopped without yang. Thus, when it meets *Zhèn* (震), the flames diminish slightly; when it meets *Lí* (离), they flare again.\n\nAgain, one restrains it with *Kūn* (坤). *Kūn*: water. Fire arises from water, as when it encounters *Duì* (兑). *Duì* is also a western hexagram. Thus, it ascends gradually from the tail of the spine (*wěilǘ* 尾闾), reaching the *Níwán* (泥丸). The top is the *Tiānmén* (天门), the realm of true noon. Noon belongs to fire, so it adds brilliance.\n\nAgain, it connects with the heart. The heart is fire, and the connection is the spirit—this is the spirit-fire. Again, brilliance is added.\n\nBy the time it reaches *Mǎo* (卯) and *Yǒu* (酉), if it descends directly, the *punishment of virtue* (刑德) will strike the gate, and great peril will ensue! Therefore, one must stand firm in one position and divide into two paths. Today’s *Mǎo* and *Yǒu* are yesterday’s *Kūn* and *Gèn* (艮).\n\nFire is *qi* (气). The principle of *qi* descending and then ascending is why it returns to the kidney palace (*shènfǔ* 肾府), transforming into true water and using it.\n\nThe *Wén* (文) fire is gentle in nature yet difficult to refine. When it encounters *Mǎo* wood, it must subdue earth. Thus, if fire subdues wood, earth will not be subdued. The *Wǔ* (武) fire is strong in nature yet easy to refine, descending from *Yǒu*. *Yǒu* belongs to metal, metal generates water, and it returns to the cauldron.’\n\nThey asked: ‘What is meant by *Wén* (文) and *Wǔ* (武)?’\n\nI replied: ‘*Wén* fire ascends from the Three Passes (*Sān Guān* 三关) to the heavens, while *Wǔ* fire is the noon palace and heart fire. In general, the fire stages are but one cycle, fraught with great danger. A *Dān* adept (丹士) should conquer in a single battle, and then the world will be settled. Ordinarily, the fire stages of the *Zhōutiān* (周天) cycle should not be taken as a model. However, this principle must not be rigidly clung to—nor should it be entirely abandoned.’",
      "overlap_context": "e!\n\nI have seen the *Zǒngpiān* (总篇),\nWhen the Nine Transformations (九转) are complete,\nAnd the *Mùyù* (沐浴) ritual is finished.\nFire’s force has reached its end—\nA single star does not extinguish.\n\nThus, movement—\nA single breath to blow it.\n\nThe *Xùn Wind* (巽风) is but a thread beneath the cauldron.\nWhen sealed, it is *Qián* (乾);\nWhen opened, it is *Xùn* (巽).\nWhen sealed, it is exhalation (嘘);\nWhen opened, it is inhalation (吸).\nHow can it open and seal?\nIt is nothing but the will directing it so.»",
      "start_char": 13999,
      "end_char": 14484,
      "start_sentence": 930,
      "end_sentence": 974,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 9.875370979309082,
      "metadata": {
        "source_file": "dao\\藏外\\青华秘文.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 23,
      "original_text": "庆云开尽现鸿蒙，仿佛空中见祖宗。 风定七星还在水，依稀残韵上飘空。 阴尽图论 张子一日坐于幽室，形忘气化。 倏然两耳风生，始如秋蝉鸣隔岸之翠柳，终焉若闻九天之箫。 韶韵恍然，有一人立于旁，耳、目、口、鼻与张子无异。 指张子而骂曰； “吾自太易以来，为子所役，略不瞬宁，何罪于汝？ ” 张子不觉失笑而无声，默谓之曰：“来，吾与尔言。 汝言固是，但尔为我苦邪？ 我为尔苦邪？ 姑坐以叙。 ” 曰：“我先以来，本无事。 与子同居之后，寤寐亦相持。 移像累劫，而不自如。 置我沙漠、风霜之地，既令我归东，又令我归西。 种种相魔。 自顷以来始蒙慧以室庐，养以调息。 美则美矣，但晚也。 ”",
      "translated_text": "The auspicious clouds disperse, revealing the vast *Hóngméng* (鸿蒙) expanse—\nas if in empty space, I glimpsed my ancestors.\n\nWhen the winds stilled, the Seven Stars (七星) remained in water,\ntheir faint lingering melodies drifting into the sky.\n\nHaving exhausted the *yīn* (阴) phase, the diagram was laid out—\nMaster Zhāng (张子) once sat in a secluded chamber,\nforgetting his form, dissolving his *qi* (气化).\n\nSuddenly, a breeze arose at his ears:\nfirst, like the autumn cicada’s song beneath distant green willows,\nthen, as if hearing the *xiāo* (箫) of the Nine Heavens (九天).\n\nThe harmonious tones seemed to waver—\na figure stood beside him, identical in ear, eye, mouth, and nose to Master Zhāng.\nPointing at Zhāng, it cursed:\n*“Since the Great Simplicity (太易), I have been enslaved by you,\nwithout respite, not even a blink—what crime have I done against you?”*\n\nZhāng did not realize he had laughed soundlessly,\nand in silence, he said to it:\n*“Come, let us speak. Your words are true,\nbut do you suffer for me? Or do I suffer for you?\nLet us sit and converse.”*\n\nIt replied:\n*“I came first, with no grievance.\nAfter dwelling with you, even in sleep and waking, we clung to each other.\nAcross countless kalpas (劫), I could not move freely.\nYou placed me in deserts, in winds and frosts—\nfirst ordering me east, then ordering me west.\nEndless forms of torment!\nOnly recently have I found wisdom in your dwelling,\nnourishment in your regulated breathing.\nIt is indeed good, but it is too late.”*",
      "overlap_context": " (文) and *Wǔ* (武)?’\n\nI replied: ‘*Wén* fire ascends from the Three Passes (*Sān Guān* 三关) to the heavens, while *Wǔ* fire is the noon palace and heart fire. In general, the fire stages are but one cycle, fraught with great danger. A *Dān* adept (丹士) should conquer in a single battle, and then the world will be settled. Ordinarily, the fire stages of the *Zhōutiān* (周天) cycle should not be taken as a model. However, this principle must not be rigidly clung to—nor should it be entirely abandoned.’",
      "start_char": 14485,
      "end_char": 14776,
      "start_sentence": 975,
      "end_sentence": 996,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 4.986316919326782,
      "metadata": {
        "source_file": "dao\\藏外\\青华秘文.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 24,
      "original_text": "张曰：“非吾之过也，乃六欲之贼使之然也。 子微而隐，彼显而彰。 否知有彼，而不知有此。 譬之瞽者坐舟，但知舟之日去千里，而不知撑者实劳也。 使不欲舟行，则撑者暇矣。 ” 似张者欣然曰：“几失君！ 吾有百炼之坚刀，可同剿此贼，而去其根后，同入规中时，然后行，独步金阙。 ” 张子曰：“唯唯。 ” 见黄光四进，五色焕然。 观者听其言曰：“去贼之道不宜急，急则反受其敌。 ” 始然力不胜，其祸乃可必。 纵放任余心，守之常将息。 或作狡诈形，视之常无尔。 一战定三清，万魔俱屏迹。 总论金丹之要 夫人之身，大而则可以取象天地，包容万汇，变化莫测，灵通玄妙。 百姓日用而不知，故金丹之道鲜矣。 夫金丹之道，贵乎药物。 药物在乎精、气、神。 神，始用神光，精，始用精华，气即用元气。 精非气不盈，神非气不充。 精因气融，气凭精用。 气因神见，神凭气用。 且以吾身之天地言之，自太极既分，两仪判矣。 两仪生四象，四象生八卦。 八卦立，而天、地、人之道备矣。 天以动为体，地以静为体。 天地之气，往来不息，而日月行乎其中。 盖父母媾形育我之后，始生脉络也。 自形完之后，始生缕络。 反若元性之虚无，谷道筋条，殆似草茅之郁茂。 此乃之先天气，为先天之道，此金宝之至言也。 宜守之以中，则庶乎道路通畅。 盖人受天地之中气以生，所谓命也。 得天地之中气以生，遂可为人。 我以身为天地，亦宜执其中，而为造化之枢纽。 中者，有三中：心中意、脐中鼎，肾中炉。 三中之至切者，心中意。 脐中鼎次之，肾中炉又次之。 此三者，自金丹之始至终，不可须臾离也。 大凡金丹之道，学者寻五行。 其末矣，当知夫交会之际，恍惚杳冥，痒生毛窍。 金之本情也。 逸像和畅，肢体柔顺，本之本性也。 铅本火体而金情，汞本水体而木性。 无他，水火者，铝汞之体也。 金木者，铅汞之用也。 铅汞凝结，光华会合者，意也，意属土。 五行既全于鼎器之中，物以类聚。 五行又坏列于鼎器之外，内外相感而丹始成。 形状黍米相似，非青、非黄、非黑、非白，不可得而名状也。 到此际，又绵绵若存，清净无为，自然现出百般妙用景象。 肾水合精水，目玄膺流下，谓之华池、神水。 虚无之中，白雪生而黄芽长。 只绵绵若存之顷，亦悉归于鼎器之内。 是大药不离精、气、神，要认始用药材。 又精、气、神之所产也，非便用精气神也。 今有一等旁门，自作自是，而精、气、神受役之不暇，奚能产药也？ 精、气、神三者，孰为重？ 曰，神为重。 金丹之道，始然以神而用精、气也。 故曰：神 为重。 神者，性之别名也。 至静之余，元气方产之际，神亦欲出，急用定以待之。 不然，是散而无体之体也。 苟夸出入，必为大道，则难不可为？ 夫神不疾而速，不行而至。 师言曰，神之妙用无方而有限。 若得其道，可以出入，切不可纵为良深。 盖收于内则可，岂宜纵于外也？ 夫神出而依林木以成形，阴未尽也。 将出之际，多异景。 日光烨然，从目出也。 鼻气或吸，从鼻出也。 耳闻清音，从耳出也。 独不可从口出入者，何也？ 夫口，五脏之气所会也。 神弃精气而窃出，避气盛之地也。 神、气、精常相恋，神一出，二者无依焉。",
      "translated_text": "Zhang said:\n*“It is not my fault—it is the thief of the Six Desires (六欲) that has driven me to this.\nYou are subtle and hidden; it is blatant and manifest.\nIt knows of your existence, but not of mine.\nIt is like a blind man in a boat—\nhe only knows the boat moves a thousand miles each day,\nbut does not see the rower’s true labor.\nIf one does not desire to sail,\nthen the rower will have leisure.”*\n\nThe one resembling Zhang (似張者) rejoiced and said:\n*“Nearly losing you! I possess a blade tempered a hundred times (百炼之坚刀),\nfit to strike this thief together—\nand only after severing its roots,\nwhen we both enter the *gui* (规),\nthen act alone,\nstriding past the golden gates (金阙).”*\n\nZhang replied:\n*“Indeed, indeed.”*\n\nA yellow radiance (黄光) spread in four directions (四进),\nits colors vivid and resplendent (五色焕然).\nThose who observed listened and remarked:\n*“The Way (道) of banishing the thief must not be hasty—\nhastiness only invites its retaliation.”*\n\nAt first, strength could not overcome it,\nbut its calamity could then be assured.\nIf one lets the mind wander freely (纵放任余心),\nand constantly guards it (守之常将息),\nwhen it takes a cunning, deceitful form (狡诈形),\none will often find it lacking (视之常无爾).\nWith one battle, the Three Pure Ones (三清) are settled,\nand all demons (万魔) retreat without trace (屏迹).\n\n**On the Essentials of the Golden Elixir (金丹) Way:**\n\nThe human body,\nwhen balanced (大而則),\ncan embody the forms of Heaven and Earth (象天地),\nencompass the myriad transformations (包容万汇),\nand shift without measure (变化莫测),\nits subtlety and responsiveness (灵通玄妙) beyond reckoning.\nYet common folk use it daily without knowing,\nso the Golden Elixir (金丹) Way is rare indeed.\n\nThe Golden Elixir Way,\nvalues medicinal substances (药物).\nMedicinal substances depend on *jing* (精), *qi* (气), and *shen* (神).\n*Shen* (神) begins with the *shen* radiance (神光),\n*jing* (精) with its essence (精华),\nand *qi* (气) with the Original *qi* (元气).\n*Jing* (精) cannot flourish without *qi* (气),\nand *shen* (神) cannot be full without *qi* (气).\n*Jing* (精) melts with *qi* (气),\nwhile *qi* (气) relies on *jing* (精) for use.\n*Qi* (气) manifests through *shen* (神),\nand *shen* (神) acts through *qi* (气).\n\nNow, let us speak of the Heaven and Earth within my body:\nSince the Great Ultimate (太极) was divided,\nthe Two Principles (两仪) were distinguished.\nThe Two Principles gave rise to the Four Phases (四象),\nthe Four Phases to the Eight Trigrams (八卦).\nWhen the Eight Trigrams were established,\nthe Ways (道) of Heaven, Earth, and Man were complete.\nHeaven moves as its nature (动为体),\nEarth remains still as its nature (静为体).\nThe *qi* of Heaven and Earth flows ceaselessly,\nand the sun and moon traverse within it.\n\nTruly, after the parents (父母) had formed and nurtured me,\nonly then did the pulse networks (脉络) arise.\nOnce my form was complete,\nthe fine pulse networks (缕络) emerged.\nBut if we return to the Original Nature’s emptiness (元性之虚无),\nthe channels (谷道), sinews (筋条), and tendrils (条) are dense as grass and weeds (草茅之郁茂).\nThis is the Original *qi* (先天气),\nthe Original Way (先天之道)—\nthe most precious words of the Golden Elixir (金宝).\nIt must be guarded within the center (守之以中),\nthen the Way will flow freely (道路通畅).\n\nThe human body receives the Central *qi* of Heaven and Earth (中气) to live,\nwhich is called *ming* (命).\nTo receive the Central *qi* of Heaven and Earth and live,\none becomes human.\nIf I take my body as Heaven and Earth,\nI too should hold its center (中),\nand serve as the pivot of creation (造化之枢纽).\nThe center has three aspects (三中):\nthe mind’s intention (心中意), the *ding* (鼎) at the navel (脐中鼎), and the furnace (炉) in the kidneys (肾中炉).\nOf these three, the most critical is the mind’s intention (心中意).\nThe *ding* (鼎) at the navel (脐) is secondary,\nand the furnace (炉) in the kidneys (肾) is yet again secondary.\nThese three must never be separated,\nfrom the beginning to the end of the Golden Elixir Way.\n\nGenerally, practitioners of the Golden Elixir Way seek the Five Phases (五行).\nBut at its peak (末矣),\none must know that at the moment of union (交会之际),\na hazy, indistinct sensation arises (恍惚杳冥),\nand itching emerges in the pores (痒生毛窍)—\nthis is the true nature of gold (金之本情).\nWhen the image (逸像) is harmonious and unrestrained (和畅),\nand the limbs are supple and compliant (肢体柔顺),\nthis is the true nature of the Original (本之本性).\n\nLead (铅) has the nature of fire (火体) but the essence of gold (金情),\nMercury (汞) has the nature of water (水体) but the essence of wood (木性).\nThere is no other reason—\nwater and fire are the bodies (体) of lead and mercury.\nGold and wood are their functions (用).\nWhen lead and mercury condense (凝结),\nand their radiance unites (光华会合),\nthis is the intention (意),\nwhich belongs to earth (属土).\nThe Five Phases are fully gathered within the *ding* (鼎),\nand like attracts like (物以类聚).\nThe Five Phases also scatter and arrange outside the *ding* (鼎),\ntheir inner and outer interactions (内外相感) forming the elixir (丹).\n\nIts appearance resembles glutinous rice (黍米),\nneither green, nor yellow, nor black, nor white—\nit cannot be named, its form is ineffable.\nAt this stage, it lingers faintly (绵绵若存),\npure and effortless (清净无为),\nnaturally revealing myriad wondrous uses and phenomena (百般妙用景象).\n\nWhen the kidney’s water (肾水) merges with the essence water (精水),\nthe dark fluid (玄膺) flows from the eyes,\ncalled the *Hua chi* (华池) and *shen* water (神水).\nIn the void (虚无之中),\nwhite snow forms and yellow buds sprout (白雪生而黄芽长).\nYet even in this lingering moment (绵绵若存之顷),\nall returns to the *ding* (鼎).\n\nThis great medicine (大药) never departs from *jing* (精), *qi* (气), and *shen* (神),\nbut its foundation lies in the medicinal materials (始用药材).\nAgain, *jing* (精), *qi* (气), and *shen* (神) are not the very source of the medicine (所产也).\nNow there are those who follow side paths (旁门),\nboasting their own methods (自作自是),\nyet when *jing* (精), *qi* (气), and *shen* (神) are enslaved by their schemes (受役之不暇),\nhow can they produce medicine (产药)?”\n\nOf *jing* (精), *qi* (气), and *shen* (神),\nwhich is most important?\nIt is said: *Shen* (神) is most important.\nThe Golden Elixir Way begins with *shen* (神),\nand then employs *jing* (精) and *qi* (气).\nThus it is said: *Shen* (神) is most important.\n*Shen* (神) is another name for Original Nature (性).\nWhen absolute stillness (至静) remains,\nand Original *qi* (元气) is about to emerge,\n*shen* (神) also desires to appear.\nIf one does not act swiftly with *ding* (定) to await it,\nit will scatter and become formless (散而无体之体).\nIf one boasts of its coming and going (夸出入),\nand insists it is the Great Way (大道),\nthen how can it be attained (为)?\n*Shen* (神) does not move swiftly yet arrives quickly,\nnor does it travel yet reaches its destination.\nThe teacher said:\n*The subtleties of shen* (神) are boundless yet have limits.\nIf one grasps its Way (道),\nit can come and go (出入),\nbut one must never indulge in profound musings (良深).\nFor though it can be gathered within (收于内),\nit must not be allowed to disperse without (纵于外).\nWhen *shen* (神) emerges and takes form through trees and woods (依林木以成形),\nthe yin is not yet exhausted.\nAt the moment of its emergence,\nmany strange phenomena appear (多异景).\nSunlight blazes forth (日光烨然) from the eyes,\nbreath may sometimes be drawn in through the nose (鼻气或吸),\nand clear sounds are heard (耳闻清音) from the ears.\nYet why does it never come or go through the mouth (独不可从口出入)?\nThe mouth is where the *qi* of the Five Zang (五脏) converges.\nIf *shen* (神) abandons *jing* (精) and *qi* (气) and steals out,\nit avoids the place where *qi* is most abundant (避气盛之地).\n*Shen* (神), *qi* (气), and *jing* (精) are always entwined (常相恋),\nand if *shen* (神) departs,\nthe other two will have no foundation (无依焉).”",
      "overlap_context": "you suffer for me? Or do I suffer for you?\nLet us sit and converse.”*\n\nIt replied:\n*“I came first, with no grievance.\nAfter dwelling with you, even in sleep and waking, we clung to each other.\nAcross countless kalpas (劫), I could not move freely.\nYou placed me in deserts, in winds and frosts—\nfirst ordering me east, then ordering me west.\nEndless forms of torment!\nOnly recently have I found wisdom in your dwelling,\nnourishment in your regulated breathing.\nIt is indeed good, but it is too late.”*",
      "start_char": 14777,
      "end_char": 16044,
      "start_sentence": 997,
      "end_sentence": 1080,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 28.910771131515503,
      "metadata": {
        "source_file": "dao\\藏外\\青华秘文.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 25,
      "original_text": "故神之出也，有害无益。 日居月诸，照临下土。 丹士逆之为用，顺而为火。 夫火循环，九转中九转。 九转初生，旺于第一转。 伺气尽，又　　第二转。 余亦如之。 至于九转周足，遂迫于鼎。 故用前进火工夫，谓之真阳而战群阴。 请明言之： 人一身皆属阴，惟有一点阳耳。 我以一点之阳，自远之近，转之又转。 战退群阴，则阳道日长，阴道日消。 故《易》曰：“龙战于野，其血玄黄”。 至于阴尽阳纯，而丹始能升于泥丸。 决然奋厉，真人于斯而始见矣。 金丹之道如此而已。 更有言不尽底。 ” 丹之初成也，交会之际，未免借阴阳二以成之，后则渐以阳火炼成纯阳之体。 故自强不息，乾道也。 丹成矣，故凝神以成躯而成仙。 丹之初成也，籍五行以成其用，后则渐以真金养成纯金之体，故通体之光金色也。 金变日色，故光。 金象日，性故刚。 故曰金丹，又曰金仙。 幻体虽假合之物，修丹之士须籍以养丹基。 譬之地也，城池固，则外邪不能人。 故绵绵若存之顷，脾、胃合为一脉，而围丹穴之左。 肺、肝合为一脉，而围丹穴之右。 真气微至，则环手脉络之中。 故近丹，而气可得之以化至宝。 举其一，可知二。 然亦无为自然始，举是以明矣。 夫无为，无有力也。 夫人之一气在身，由念而动。 譬之握拳，念欲开而五指伸，了无挂碍。 学人达此，于采先天一气之时，行一真念，采一真气。 按图观象，落在黄庭，其理一也。 穷冬调剥，必得阴阳交泰之后，乃生万象。 学人达此，当知交会之后，不期药物之产而自产矣。 金之在水，其耀夺目。 金之在上，土能藏之。 盖产于幽处，而隐其明处也。 丹之居鼎，犹人君之在位，百官称职，其国自安。 火侯药物，各得其宜。 第一转，产药于东，而降于西。 以心为斗柄，斡旋其机。 故行二十度而魄满，又斡之二十度而魂满。 则火之魂，而水之魄立，而神用大矣。 他转如之，举其要以明学者。 言曰：",
      "translated_text": "The *shen* (神) that emerges brings harm without benefit.\nThe sun and moon reside above, illuminating the lands below.\nThe alchemist reverses this for application—\nfollowing the Dao, it becomes fire.\n\nFire circulates in nine revolutions within nine revolutions.\nAt the first emergence of the nine revolutions,\nits vigor peaks at the first turn.\nAwaiting the *qi*’s exhaustion, it proceeds to the second turn—\nand so it continues.\nWhen the nine revolutions are complete,\nit is pressed into the crucible.\nThus, the practice of advancing fire is called *true yang* (真阳) battling the myriad *yin* (群阴).\n\nLet me explain:\nThe human body is all *yin*,\nsave for a single point of *yang*.\nWith this single point of *yang*,\nI turn it from afar to near,\nrevolving it again and again.\nBy vanquishing the myriad *yin*,\nthe *yang* Dao grows daily,\nwhile the *yin* Dao wanes.\nThus the *Yijing* says:\n*\"The dragon battles in the wild,\nits blood a deep, yellow hue.\"*\nWhen *yin* is exhausted and *yang* is pure,\nthe elixir begins to ascend to the *mìhuán* (泥丸).\nWith decisive vigor,\nthe True Person then appears.\n\nSuch is the Dao of the Golden Elixir—\nyet there is more that cannot be fully spoken.\n\nWhen the elixir first forms,\nat the moment of union,\nit cannot avoid relying on both *yin* and *yang* to complete it.\nLater, it is gradually refined by *yang* fire into a purely *yang* body.\nThus, *self-striving without rest* is the Dao of *Qian* (乾).\nWhen the elixir is complete,\none condenses the *shen* to form the body and become immortal.\n\nIn its initial formation,\nthe elixir relies on the Five Phases to fulfill its function,\nbut later it is gradually nourished by true gold into a purely golden body—\nthus its luminous golden hue throughout.\n\nGold transforms into the color of the sun,\nand so it shines.\nGold embodies the sun—\nits nature is firm.\nThus it is called *Golden Elixir* (金丹),\nand also *Golden Immortal* (金仙).\n\nThough the phantom body is a fabricated construct,\nthose who cultivate the elixir must use it to nourish the elixir’s foundation.\nIt is like a city—\nif the walls are strong,\nexternal evils cannot penetrate.\nThus, during the subtle moment of its existence,\nthe spleen and stomach merge into a single vessel,\nsurrounding the elixir field on the left.\nThe lungs and liver merge into a single vessel,\nsurrounding the elixir field on the right.\nWhen true *qi* subtly arrives,\nit encircles the hand’s pulse networks.\nThus, approaching the elixir,\none may obtain *qi* to transmute into the utmost treasure.\nKnow one, and you may infer the other.\nYet this is the beginning of *wuwei* (无为),\nand its principle is now clear.\n\n*Wuwei* has no force—\nyet the *qi* of a person, when moved by thought,\nis like this:\nWhen one clenches a fist and wills it open,\nthe fingers extend without hindrance.\nWhen the student attains this,\nwhile gathering the primordial *qi* (先天一气),\nthey must hold a true thought,\ngathering true *qi*.\nFollowing the diagram and observing the form,\nit settles in the *Huángtíng* (黄庭)—\nthe principle is one.\n\nIn the depths of winter, when the cold is severe,\nonly after *yin* and *yang* harmonize\ndoes the myriad phenomena emerge.\nWhen the student attains this,\nthey will know that after union,\nmedicinal substances need not be sought externally—\nthey arise naturally.\n\nGold in water shines dazzlingly,\nbut gold above is concealed by the earth.\nIt is produced in hidden places,\nyet its brilliance is concealed.\n\nThe elixir residing in the crucible\nis like a ruler on the throne—\nwhen officials fulfill their duties,\nthe realm is at peace.\nFire and medicinal substances\neach find their proper use.\n\nIn the first revolution,\nthe elixir is produced in the east and descends to the west.\nWith the heart as the handle of the *dòu* (斗),\nit turns the mechanism.\nThus, after moving twenty degrees,\nthe *pò* (魄) is full,\nand after turning another twenty degrees,\nthe *hún* (魂) is full.\nThen the fire’s *hún* and the water’s *pò* stand firm,\nand the *shen*’s power is great.\n\nThe other revolutions follow similarly—\ntake the essentials to enlighten the student.\n\nIt is said:",
      "overlap_context": "rom the eyes,\nbreath may sometimes be drawn in through the nose (鼻气或吸),\nand clear sounds are heard (耳闻清音) from the ears.\nYet why does it never come or go through the mouth (独不可从口出入)?\nThe mouth is where the *qi* of the Five Zang (五脏) converges.\nIf *shen* (神) abandons *jing* (精) and *qi* (气) and steals out,\nit avoids the place where *qi* is most abundant (避气盛之地).\n*Shen* (神), *qi* (气), and *jing* (精) are always entwined (常相恋),\nand if *shen* (神) departs,\nthe other two will have no foundation (无依焉).”",
      "start_char": 16044,
      "end_char": 16795,
      "start_sentence": 1081,
      "end_sentence": 1132,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 15.341698408126831,
      "metadata": {
        "source_file": "dao\\藏外\\青华秘文.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 26,
      "original_text": "斗极建四时，八节无不顺。 斗极实兀然，魁杓自移动。 只要两眼皎，上下交相用。 须向静中行，莫就忙里送。 要无形图与他看，一气周流归故宅。 金丹何事却成功？ 至道本不繁，庸人自生事。 我本遇师传，三嘱令深秘。 何故尽图并立论，毫厘说尽鬼神惊。 咄！ 地狱不囚传道者，教存经籍度三师。 次第秘诀 坐静打顽空，抑息，守己生时。 闻命气冲和，待气动，方可如下行。 存归　　，然后就上二窍，直冲五星。 候见地，则放静，又观心。 放下了一段，候再见明，一阳真气产矣。 采取交媾，绵绵若存。 小光透，用机出入，开道一回，然后方行子午。 大光透，用机出入，破顶一回。 此是后上前下，此后并系尾闾五星。 于三十日见，用机出入。 上弦十五日足见机。 大凡三遭望、七十日左右见机。 下弦日数足，只下明鼎，内晦用机，再朝天径。 以太和返太极。 以太极返无极。 否　　　　　　　泰 动静之机，气盛则仰之以静，气弱则助之以意。 火候秘诀 丹居鼎内，上水下火。 心动属火，静属水，乃水鼎也。 ○静属水，动属火，乃火鼎也。 阳在鼎下，曰水鼎。 升于鼎上，则火鼎也。 阳火是外炉，外炉起火，存于气穴。 黄庭正在气穴之上，气穴乃内炉也。 内炉有火，近鼎常烹，此绵绵若存也。 火长进于下，则不可坐。 至于子午二时，午进火，于进水。 阳生，不以心忧，接之以意，斡归于右，转降于左，存入　　，反是则进火。 或曰：“敢问九转之功。 ”",
      "translated_text": "「The *dòu* (斗) and its handle mark the four seasons,\nand all eight nodes proceed in harmony.\n\nThe *dòu*’s handle stands firm and upright,\nwhile the ladle (*kuí* 杓) shifts on its own.\nJust keep both eyes bright and clear,\nas the upper and lower exchange their use.\n\nSeek stillness in your practice,\ndo not rush in the midst of chaos.\nRefrain from seeking form to show to others—\nlet the *qi* circulate freely, returning to its original abode.\n\nWhat need is there to reverse the elixir’s success?\nThe supreme Dao is inherently simple—\nfools create their own complications.\n\nI was fortunate to meet a master and receive transmission,\nwith three admonitions to keep its secrets profound.\nWhy then do you expose every detail,\nrevealing even the minutest truths to startle the spirits?\n\nAh! The underworld does not imprison those who transmit the Way—\nthe teachings endure in the *sūtra* (经), through the three *tī* (师) of liberation.\n\nSequential secret techniques:\nSit in stillness, strike the stubborn void.\nSuppress the breath, guard the moment of your own birth.\n\nWhen the *qi* surges in response to the command,\nawait its movement, then proceed as follows:\nStore and return,\nthen enter the upper two orifices,\nand surge straight toward the five *xīng* (星).\n\nWhen the earth is perceived,\nrelease the stillness, then observe the heart.\nAfter a pause, when perception returns,\nthe true *yáng* (阳) *qi* of the elixir manifests.\n\nHarvest and merge the essences,\ncontinuously as if preserving life.\nWhen the small light penetrates,\nuse the mechanism for entry and exit,\nopening the Dao once before proceeding to *zǐwǔ* (子午).\n\nWhen the great light penetrates,\nuse the mechanism for entry and exit,\nbreaking the top once.\nThis is the later ascent and earlier descent,\nand thereafter it pertains to the tail and five *xīng* (星).\n\nAt thirty days, the light appears—\nuse the mechanism for entry and exit.\nGenerally, three encounters with the full moon,\naround seventy days, will reveal the mechanism.\nIf the waning moon’s count suffices,\njust lower the dark crucible,\nuse the mechanism internally,\nand then face heaven directly.\n\nReturn to the *Tàihé* (太和) to attain the *Tàijí* (太极).\nReturn to the *Tàijí* (太极) to attain the *Wújí* (无极).\n\n*Pǐ* (否) and *Tài* (泰) alternate—\nthe mechanism of motion and stillness:\nwhen *qi* is strong, subdue it with stillness;\nwhen *qi* is weak, assist it with intent.\n\nFire’s secret techniques:\nWhen the elixir resides in the crucible,\nwater above and fire below.\nThe heart’s movement belongs to fire,\nstillness to water—thus the *water crucible* (水鼎).\n\n○Stillness belongs to water,\nmovement to fire—thus the *fire crucible* (火鼎).\nWhen *yáng* (阳) is in the crucible below,\nit is the water crucible.\nWhen it ascends to the crucible above,\nit is the fire crucible.\n\nThe external furnace is *yáng* fire,\nand when the external furnace ignites,\nstore it in the *qì xuē* (气穴).\nThe *Huángtíng* (黄庭) lies directly above the *qì xuē*,\nand the *qì xuē* is the internal furnace.\nWhen the internal furnace holds fire,\nkeep it near the crucible for constant cooking—\nthis is the continuous preservation.\n\nIf fire grows too strong below,\ndo not sit.\nAt the hours of *zǐ* (子) and *wǔ* (午),\nadvance fire at *wǔ* (午), advance water at *zǐ* (子).\nWhen *yáng* (阳) arises,\ndo not concern yourself with the heart—\ninstead, guide it with intent,\nturn it back to the right,\nand descend it to the left,\nstoring it in the crucible.\nThe opposite is true—then advance fire.\n\nSomeone asked:\n“May I dare ask about the nine revolutions’ work?”」",
      "overlap_context": "nces\neach find their proper use.\n\nIn the first revolution,\nthe elixir is produced in the east and descends to the west.\nWith the heart as the handle of the *dòu* (斗),\nit turns the mechanism.\nThus, after moving twenty degrees,\nthe *pò* (魄) is full,\nand after turning another twenty degrees,\nthe *hún* (魂) is full.\nThen the fire’s *hún* and the water’s *pò* stand firm,\nand the *shen*’s power is great.\n\nThe other revolutions follow similarly—\ntake the essentials to enlighten the student.\n\nIt is said:",
      "start_char": 16796,
      "end_char": 17420,
      "start_sentence": 1133,
      "end_sentence": 1175,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 11.528541564941406,
      "metadata": {
        "source_file": "dao\\藏外\\青华秘文.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 27,
      "original_text": "曰； “三月火候乃九转。 ” “第一转： 初自胁边左右，存为火道。 自阳宫起，自右边，到肩横过正中凝住，却自左边送下。 逐绵绵若存，宜静不宜动，宜徐不宜急。 曰，扇火急则伤丹。 此每日子时之功也。 “第二转： 自肋边进一寸二分，目前法。 此丑时之用功也。 “第三转： 白肋边进五分，用法如前法。 此寅时之用功也。 “沐浴： 卯时火起，取丹计四寸，有缕二条，止为火道。 脉透鼎中，故火起不用目，不用心，以意斡之右转。 取横与鼎齐，正缕地也。 遂大静火，遂为水而归于鼎。 丹逐沐浴，绵绵若存。 “第四转： 进一寸，用法如前。 此辰时之用也。 “第五转： 进五分，用法如前。 此巳时之用功也。 “第六转抽添： 进五分，火自下与午时心火顶火俱旺，故阳生，小抑之，抽也。 再生，则火微矣。 直上于左而横过，恰值心。 遂逢心火而共降于右，若下火不抽。 上逢心火。 “第七转： 过五分，用如前法。 此未时之用功也。 “第八转： 行左降右，取丹方一寸。 未时之火道，皆是阴之道也。 火力过而衰，值申道，亦阴道。 无他，心上道，阳道也。 心下道，阴道也。 二时火皆从阴过，至酉而始。 金旺。 故静以待之，火为金 液而归于鼎，丹遂沐浴。 卯沐浴乃益汞，酉沐浴乃益铅。 “第九转： 取金丹五分而已，顷刻用而即定以待。 “第十转； 用巽风起火，行运火之法，见火候之图。 ” 后跋",
      "translated_text": "It is said: “The fire regimen of the ninth revolution occurs in the third month.”\n\n**First Revolution:**\nAt first, from the sides of the ribs, left and right,\nstore it as the Fire Dao.\nFrom the *yáng gōng* (阳宫), beginning at the right side,\nit reaches the shoulder, crosses horizontally over the center, and congeals there,\nthen returns from the left side to descend.\nPreserve it continuously, as if it were always there—\none should remain tranquil, not move,\nproceed slowly, not hastily.\nIt is said: “Fanning the fire too vigorously harms the elixir.”\nThis is the daily work at the *zǐ* (子) hour.\n\n**Second Revolution:**\nFrom the rib’s edge, advance by one *cùn* (寸) and two *fēn* (分),\nemploying the same method.\nThis is the work at the *chǒu* (丑) hour.\n\n**Third Revolution:**\nFrom the white ribs’ edge, advance by five *fēn*,\nemploying the same method as before.\nThis is the work at the *yín* (寅) hour.\n\n**Bathing in Fire:**\nAt the *mǎo* (卯) hour, when fire rises,\ntake the elixir, four *cùn* in measure,\nwith two threads, and cease to call it the Fire Dao.\nThe pulse penetrates the crucible, hence fire rises—\ndo not use the eyes, do not use the heart,\nbut with intent, guide it to the right, turning.\nTake it horizontally to align with the crucible,\nnow the threads rest upon the earth.\nThen, suppress the fire greatly,\nand let it return as water to the crucible.\nThe elixir follows the bathing in fire,\ncontinuously preserved, as if always there.\n\n**Fourth Revolution:**\nAdvance by one *cùn*,\nemploying the same method as before.\nThis is the work at the *chén* (辰) hour.\n\n**Fifth Revolution:**\nAdvance by five *fēn*,\nemploying the same method as before.\nThis is the work at the *wèi* (巳) hour.\n\n**Sixth Revolution (Drawing and Adding):**\nAdvance by five *fēn*—\nfire from below, along with the *wǔ* (午) hour’s heart fire and top fire, both flourish,\nso when *yáng* (阳) arises,\nsuppress it slightly—this is drawing.\nWhen it arises again, the fire grows faint.\nAscending straight from the left and crossing horizontally,\nit just meets the heart.\nThen, encountering the heart fire, descend together to the right—\nif the descending fire is not drawn.\nWhen it meets the heart fire above.\n\n**Seventh Revolution:**\nPass five *fēn*,\nemploying the same method as before.\nThis is the work at the *wèi* (未) hour.\n\n**Eighth Revolution:**\nProceed with left descending and right ascending,\ntaking the elixir’s measure as one *cùn*.\nThe Fire Dao of the *wèi* hour is all the Yin Dao.\nFire’s strength wanes after its peak,\nreaching the *shēn* (申) hour—also the Yin Dao.\nThere is nothing else:\nThe Dao above the heart is the Yang Dao;\nThe Dao below the heart is the Yin Dao.\nFire at both hours arises from the Yin—\nuntil the *yǒu* (酉) hour, when it begins.\nGold flourishes.\nHence, remain still and await it—\nfire becomes the liquid of gold and returns to the crucible,\nand the elixir follows the bathing in fire.\nBathing in fire at the *mǎo* hour is to add mercury,\nbathing in fire at the *yǒu* hour is to add lead.\n\n**Ninth Revolution:**\nTake the golden elixir, five *fēn* only,\nusing it swiftly and then stabilizing to await.\n\n**Tenth Revolution:**\nUse the *xùn* (巽) wind to ignite fire,\nemploying the method of circulating fire,\nreferring to the diagram of the fire regimen.",
      "overlap_context": " near the crucible for constant cooking—\nthis is the continuous preservation.\n\nIf fire grows too strong below,\ndo not sit.\nAt the hours of *zǐ* (子) and *wǔ* (午),\nadvance fire at *wǔ* (午), advance water at *zǐ* (子).\nWhen *yáng* (阳) arises,\ndo not concern yourself with the heart—\ninstead, guide it with intent,\nturn it back to the right,\nand descend it to the left,\nstoring it in the crucible.\nThe opposite is true—then advance fire.\n\nSomeone asked:\n“May I dare ask about the nine revolutions’ work?”」",
      "start_char": 17421,
      "end_char": 18045,
      "start_sentence": 1176,
      "end_sentence": 1228,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 10.560110569000244,
      "metadata": {
        "source_file": "dao\\藏外\\青华秘文.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 28,
      "original_text": "托秋毫之末，大宇宙之总者，神也。 运一元之母，成万物之形者，气也。 本灵源之液，润八荒之津者，精也。 三元混而回生转杀，一极立而返本还元者，天君之妙也。 天君者，心之谓矣。 玉清金笥宝篆金宝内炼丹决之书，此青华君之神文、《悟真篇》之扃钥、张紫阳剖玄露妙之心传。 诵之者，得之于心，忘其心，得之于神，忘其神，得之于太虚。 诚三光之领、五气之纲。 能死能生，能无能有。 含赤子之德，宰万化之宜。 先天先地之妙，于是存焉。 是妙也，志不迁于物　　，形不老于人间。 超生死无干之地，了鬼神莫知之机。 斯文之要哉！ 故跋。",
      "translated_text": "The bristle’s tip of autumn’s hair—\nthe totality of the Great Universe—\nthis is the **Shen** (神).\n\nThe movement of the One Primordial (元) source,\nforming the shapes of myriad things—\nthis is the **qi** (氣).\n\nThe essence of the Soul’s fountain (靈源),\nmoistening the dews of the Eight Desolations (八荒)—\nthis is the **jing** (精).\n\nWhen the Three Primordials (三元) blend and return,\nlife and death transform in cycles,\nand when One Pole (一极) stands, it reverses,\nreturning to its root and restoring the Primordial—\nthis is the **Miao** (妙) of the **Tianjun** (天君).\n\nThe **Tianjun** (天君) is none other than the **heart** (心).\n\nThe book of *Yùqīng Jīnlì Bǎozhuàn* (玉清金笥寶篆) and *Jīnbǎo Nèiliàn Dānjué* (金寶內煉丹訣),\nthis is the **Shenwén** (神文) of the **Qīnghuá Jūn** (青華君),\nthe key to the *Wùzhēn Piān* (悟真篇),\nand the **Xīnyuán** (心傳) of **Zhāng Zǐyáng** (張紫陽),\nwho exposed the mysteries of the **Xīnyuán** (玄露).\n\nRecite it, and you grasp it in the **heart** (心),\nforgetting the **heart** (心),\ngrasp it in the **Shen** (神),\nforgetting the **Shen** (神),\ngrasp it in the **Tàixū** (太虚).\n\nIt is the **Lǐng** (領) of the Three Luminaries (三光),\nthe **Gāng** (纲) of the Five **Qi** (五氣).\n\nIt can die and can be reborn,\ncan be nothing and can be everything.\n\nIt contains the **virtue** (德) of the **Chìzǐ** (赤子),\ngoverning the **Yì** (宜) of the Ten Thousand Transformations (万化).\n\nThe **Miao** (妙) of **preheaven** (先天) and **preearth** (先地) is preserved here.\n\nThis **Miao** (妙) is such that:\nthe will does not stray to things,\nthe form does not age in the mortal realm.\n\nIt transcends the **land** (地) of death and rebirth,\npenetrating the **mechanism** (机) unknown even to **ghosts and gods** (鬼神).\n\nThe essence of this **Shenwén** (斯文)! Hence, the **postscript** (跋).",
      "overlap_context": "ce, remain still and await it—\nfire becomes the liquid of gold and returns to the crucible,\nand the elixir follows the bathing in fire.\nBathing in fire at the *mǎo* hour is to add mercury,\nbathing in fire at the *yǒu* hour is to add lead.\n\n**Ninth Revolution:**\nTake the golden elixir, five *fēn* only,\nusing it swiftly and then stabilizing to await.\n\n**Tenth Revolution:**\nUse the *xùn* (巽) wind to ignite fire,\nemploying the method of circulating fire,\nreferring to the diagram of the fire regimen.",
      "start_char": 18046,
      "end_char": 18290,
      "start_sentence": 1229,
      "end_sentence": 1243,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 7.59639048576355,
      "metadata": {
        "source_file": "dao\\藏外\\青华秘文.txt",
        "category": "藏外"
      }
    }
  ]
}