{
  "source_id": "马王堆帛书十问",
  "source_file": "chunked_daozang\\马王堆帛书十问.json",
  "total_chunks": 19,
  "total_original_chars": 15049,
  "total_translated_chars": 90458,
  "total_translation_time": 368.4463880062103,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\藏外\\马王堆帛书十问.txt",
    "category": "藏外"
  },
  "full_translation": "**\"The Mawangdui Silk Manuscripts: *Ten Questions*, *On Harmonizing Yin-Yang*, *The Dao of the World’s Ultimate Way*, *On Conception and Birth*, *Miscellaneous Prohibitions*, *Nourishment Prescriptions*, *Refraining from Grains and Eating Qi*, *Guiding and Pulling [Exercises]*, *Ten Questions*\"\n\n---\n\n**Yellow Emperor asked the Celestial Master:**\n*\"How do all things come to move?\nHow do grasses and trees come to grow?\nHow do the sun and moon come to shine?\"*\n\n**The Celestial Master replied:**\n*\"Observe the nature of Heaven and Earth—\nYin and Yang are the norm.\nWhen all things lose them, they fail to endure;\nwhen they attain them, they flourish.\nTo eat Yin and emulate Yang,\nconsult the divine and the luminous.\n\nThe Way of eating Yin:\nEmpty the five viscera,\nexpand the three faults,\nyet do not abandon the uncarved.\nIts worth lies in stillness and the spirit-wind,\nstanding apart yet aligned—\nthreefold construction without completion,\nthen the spirit-wind arises, and the five sounds respond.\n\nInhale no more than five [breaths],\ndirect it to the mouth,\ncount it in the heart—\nthe four assistants are precious,\nand the Mysterious Vessel reaches its peak.\n\nDrink no more than five [mouthfuls],\nensure the taste is sweet,\nlet it reach the five viscera,\nthen the form will retreat to its utmost.\n\nStrike the flesh and skin,\ndown to the hair’s ends—\nthe vessels and pores will follow,\nYin-water will arrive,\nsplashing against the erect Yang,\nfirm and unyielding, never dying.\nNourishment as guest to the body—\nthis is called the *Restoration of the Marvelous*,\ncommuning with the divine.\"*\n\n---\n**The Celestial Master’s Way of Eating Spirit-Qi.**\n\n**Yellow Emperor asked Da Cheng:**\n*\"Why do people lose their complexion, turning ashen and sallow?\nHow do they attain smooth pores and radiant, luminous whiteness?\"*\n\n**Da Cheng answered:**\n*\"If you wish to refine your complexion to luminous whiteness,\nobserve the *cuivert* [尺蠖].\nThe *cuivert*’s diet harmonizes Yin-Yang—\neat blue, and it turns blue;\neat yellow, and it turns yellow.\nYour own complexion will shift with the five colors you consume.\n\nIf you eat Yin as your constant,\nsupplement with *Zhì* [柏] fruit—rich and pure,\ndrink the essence of the *walking-beast spring*,\nyou may reverse aging, restore vigor,\nand achieve a smooth, luminous glow.\n\nGather Yin in abundance,\nfollow with *flying insects*,\nspring *jué* [爵] birds and *yuánzǐ* [员子],\nawaken the *míngxióng* [鸣雄].\nThe *míngxióng* is potent—\nif you truly ingest this,\nthe *yùzhé* [玉策] will regenerate.\n\nThe Supreme Art arrives—\nblock the *yùdòu* [玉窦],\nfill it, then send it forth;\n*yuánzǐ* conveys it.\nIf the encounter is not firm,\nplace it in *mì* [].\nIf you truly ingest this,\nyou may even raise the dead.\"*\n\n「The Dao of the Supreme Art’s *resuscitation through bird-essence nourishment* begins. The Yellow Emperor asked Cao Nao, *\"Why do people die? Why do they live?\"*\nCao Nao replied, *\"Gather the bird’s essence while its life is still manifest. Wait for its *qi* to harmonize, then subtly stimulate its form. If you can stimulate its form, you may summon the five sounds, then enter its essence. The empty may be filled with vitality, the strong may endure in splendor, the aged may live forever. The method of eternal life lies in the *yùbì* [玉闭], when the *yùbì* is sealed, its *shénmíng* [神明] gathers. When the gathering is evident, the *yùbì* preserves its essence, ensuring the *yùquán* [玉泉] does not collapse, so that no hundred ailments afflict you—thus, eternal life is achieved. The method of gathering Yin must be done with a resolute heart. When form and *qi* are mutually preserved, it is said:\n\n*'One arrival—do not disperse, and the senses sharpen;\nTwo arrivals—do not disperse, and vitality ascends;\nThree arrivals—do not disperse, and the skin glows;\nFour arrivals—do not disperse, and the spine and marrow remain unharmed;\nFive arrivals—do not disperse, and the buttocks and hips grow strong;\nSix arrivals—do not disperse, and the hundred vessels flow freely;\nSeven arrivals—do not disperse, and misfortune departs for life;\nEight arrivals—do not disperse, and longevity extends;\nNine arrivals—do not disperse, and one attains *shénmíng* [神明].'*\n\nThis is Cao Nao’s method of gathering Yin to regulate *shénqì* [神气].\n\nThe Yellow Emperor then asked Rong Cheng, *\"When the people first practice *chúnliú* [淳溜] and *xíng* [刑], why do they live? When their *xíng* [刑] is complete, why do they die? Why do some live long while others perish young? Why do some have ill fortune while others thrive? I wish to hear the reason for the people’s *qì* [气] being either relaxed or taut.\"*\n\nRong Cheng answered, *\"If you wish for longevity, then observe the Dao of Heaven and Earth. Heaven’s *qi* waxes and wanes with the moon, so it endures forever. Earth’s *qi* has seasons of cold and heat, risk and ease, so Earth persists without decay. You must discern the nature of Heaven and Earth, then embody it in your own practice. There are signs to be known—even sages cannot fathom them without the Dao. The utmost essence of Heaven and Earth is born without signs, grows without form, and matures without substance. Those who grasp it live long; those who lose it die young. Thus, the adept in *qì* [气] cultivation and essence gathering must take ‘no signs’ as their accumulation. When *shénqì* [神气] overflows like a spring, they absorb *gānlù* [甘露] to store it, drink *yáoquán* [瑶泉] and *língzūn* [灵尊] to nourish their constitution, and abandon vice and excess, so their *shén* [神] may *chúnliú* [淳溜] and *xíng* [刑] naturally. The method of absorbing *qi* must be directed to the extremities, ensuring the essence is generated without collapse. Both upper and lower bodies are filled with essence—cold and warmth harmonized, life thrives naturally. Breathing must be deep and prolonged; fresh *qi* is easier to retain. Stale *qi* brings aging; fresh *qi* brings life. The adept in *qì* cultivation scatters stale *qi* at night, replenishes fresh *qi* at dawn, thus purifying the nine orifices and filling the six *fǔ* [府]. There are restrictions on nourishing *qi*: in spring, avoid turbid Yang; in summer, avoid scorching winds; in autumn, avoid frost and mist; in winter, avoid piercing Yin. Eliminate the four flaws, then practice deep breathing for longevity. The intent of morning breathing must align with Heaven—when exhaling, measure by the *guīmǎn* [闺满], as if storing in an abyss, so that old *qi* is daily exhausted while new *qi* is daily replenished, giving the body a radiant glow. When essence is abundant, one endures forever. The intent of midday breathing must be gentle—ears and eyes remain sharp, and Yin-Yin [阴阴] delights in the *qi*, preventing internal decay, so the body suffers no harm. The intent of evening breathing must be deep and sustained—keep the ears from hearing, and rest peacefully. When the soul and body are at ease, eternal life is achieved. At midnight, breathing must be slow and measured—do not alter your sleep posture, withdraw gently, and let the six *fǔ* [府] open fully, reaching the utmost limit of relaxation. To nourish the spirit for longevity, one must breathe through the pores. The essence of *qì* cultivation brings life from death and death from life. Delight in fine grains and this will fill your form—this is called *shénqì* [抟精]. There are principles in *qì* cultivation: focus on gathering essence. When essence is full, it must be dispersed; when essence is dispersed, it must be replenished. The timing of replenishment and dispersion is done at the *kuī* [窍]. Outflow and inflow must refine the *méi* [美], and when the *bái* [白] is externalized and the *chéng* [成] is internalized, what illness remains? For those born with misfortune, their Yin essence leaks away, the hundred vessels stagnate, their emotions are untimed, and they fail to grasp the Great Dao—thus, their vital *qi* departs. Common folk are born with flaws, relying on *wūyī* [巫医], yet even if they live past ten years, their forms will wither early. They praise life while hastening their own demise—how tragic! Death and life depend on the practitioner’s mastery. Seal the lower orifices to retain essence, and *qi* will not leak away. The heart governs life and death—who can undermine it? Guard diligently without loss, and eternal life spans generations. Generational longevity and ease come from accumulation. The abundance of life depends on observing Heaven above and Earth below—those who excel become divine, thus their forms dissolve. Those who understand the Great Dao move like clouds, ascending from the *shāngshān* [山], water flows far, dragons ascend high, fatigue does not weary them—*□□□□□□□* [巫成] *□□* [□□] does not die. *Wūchéng* [巫成] relies on the four seasons as assistants, Heaven and Earth as the *jīng* [经], and *Wūchéng* [巫成] and Yin-Yang as the sources of life. Yin-Yang does not die, and *Wūchéng* [巫成] and Yin-Yang regard each other mutually—those who follow the Dao are thus as well.\"*\n\n*\"Alcohol and five flavors, when used to regulate *qì*, sharpen the eyes and ears, make the skin luminous, fill the hundred vessels, and let Yin essence flourish. Thus, one may engage in prolonged intimacy and distant travel, achieving lasting longevity.\"*\n\nEmperor Yao asked Shun, *\"What is most precious in the world?\"*\nShun replied, *\"Life is most precious.\"*\nYao said, *\"How should one govern life?\"*\nShun replied, *\"Discern the balance of Yin-Yang.\"*\nYao asked, *\"The body has nine orifices and twelve nodes, all established and dwelling within—why does Yin essence arise with the body yet depart before it?\"*\nShun replied, *\"Because they do not moderate their eating and drinking, and they do not restrain their scheming thoughts. They conceal its name and obscure its form, yet its demands are excessive without any respite—thus, it arises with the body yet departs before it.\"*\n\n「Emperor Yao asked, *\"How should one govern this (Yin essence)?\"*\nShun replied, *\"One must cherish and delight in it, nurture and scheme for it, drink and eat with it. When engaging in intimacy, one must make it firm and strong yet gentle in its approach. One must absorb it fully without letting it escape, and must keep it in joy without draining it. Thus, its substance will accumulate, its qi will be preserved, and one may live a hundred years, surpassing those of earlier times.\"* This was Shun’s Dao of harmonizing with Yin and regulating qi.\n\nKing Wang Ziqiao’s father asked Pengzu, *\"How does human qi become the most refined essence?\"*\nPengzu answered, *\"Human qi cannot surpass the refining of essence. If one refines qi but it stagnates and closes off, the hundred vessels will breed disease. If one fails to refine qi properly, one cannot flourish in life, and thus longevity depends entirely on this refinement. To preserve and cherish refinement, one must fully integrate it into one’s nourishment and support—this is why those who follow the Dao can clarify their essence with a mere hand’s touch or arm’s stroke, and massage their abdomen, following Yin and Yang. One must first expel the old, then inhale refined qi, breathing in harmony with it, eating and drinking in harmony with it, completing one’s nourishment of refinement as if caring for an infant. Though the infant is capricious and often restless, one must be vigilant. Thus, one may engage in prolonged intimacy and distant travel, achieving lasting longevity. In daily life, one must cultivate beauty and moderation in all things, fortifying the inner essence to perfection—what illness could then take hold? If life brings afflictions, it is because one’s Yin essence leaks away, the hundred vessels stagnate and decay, emotions are untimely, and one does not grasp the Great Dao. Then, the vital essence departs. The vulgar crowd, lacking refinement, rely on sorcerers and physicians, yet by seventy years, their form is already stunted and buried in decay. They hasten their own demise through reckless conduct—how tragic! Death and life are but a matter of mastery. The true adept seals and preserves essence, letting no qi escape. The heart governs life and death—who could then fail? Guard it with care and never lose it, and one may attain longevity across generations. Longevity across generations comes from accumulation and preservation. The abundance of life stems from observing the heavens above and spreading roots below. The capable will surely become divine, thus achieving bodily transcendence. Those who grasp the Great Dao move like clouds, ascending to the highest peaks, their water flowing far, their dragons soaring high—never weary, never exhausted. [They] [endeavor with] [all] [their] [might], achieving radiant clarity, never dying. Radiant clarity relies on the four seasons as its assistants and heaven and earth as its framework, harmonizing with Yin and Yang in their eternal generation. Yin and Yang never die, and radiant clarity watches over them. Those who follow the Dao are likewise.»\n\nEmperor Pan Geng asked the aged sage, *\"I have heard that you harmonize with Yin to grow strong, absorbing the heavens’ essence to achieve lasting longevity. Where should I begin to practice this Dao?\"*\nThe sage replied, *\"A ruler must value that which arises with the body yet grows old before it—strengthening the weak, lengthening the short, enriching the poor with abundant grain. The practice is a balance of emptiness and fullness, governed by moderation: First, let limbs hang naturally, straighten the spine, and bend the hips; Second, loosen the thighs, move the Yin, and contract the waist; Third, close the eyes and ears, inhaling to fill the [vessels]; Fourth, savor the five flavors, drink the pure waters; Fifth, let all essence ascend, inhaling the Great Brightness. Stop at five, and the spirit will daily be at ease.\"* This was the sage’s Dao of harmonizing with Yin and nourishing the spirit.\n\nYu asked Master Shigeng, *\"With the wisdom of ears and eyes, I governed the world, balancing the heavy earth and following the flowing waters until I reached the Mount Kuaiji. There, I dwelt upon the waters for ten years. Now, my limbs are useless, my household is in chaos, and my governance is in disarray—how should I govern this?\"*\nMaster Shigeng answered, *\"All governance begins with oneself. When blood and qi should flow yet do not, this is called the ‘root of calamity,’ the origin of the six extremes. This is the continuation of blood and qi, the lineage of sinews and vessels—it must never be neglected. When the body is exhausted, one must apply nourishment; when the senses are dulled, one must shift tastes. Guide it with intention, move it with purpose. Without nourishment, there is no way to fill the inner and lengthen the lifespan; without intention, there is no way to know the inner balance of emptiness and fullness; without purpose, there is no way to move the four limbs and dispel illness.\"*\n\nThe **Way** of cultivating the spirit and **qi** is thus:\n\n*\"Awakening from sleep and drawing in the yin*—this is called **refining the sinews**;\n*stretching then bending*—this is called **refining the bones**.\nWhen movement is applied with proper measure, the vital essence flows like a spring.\n\nWho in this world could fail to be transformed by practicing this **Dao/Way**?\"\n\nYú then drank the **湩** (a type of fermented drink), partook of wine and the five flavors,\nand used his **intention** to govern his **qi**.\nHis eyes became clear, his ears sharp—his skin and flesh radiant,\nas the hundred vessels filled and the yin essence flourished.\nThus, his descendants were at peace, and his household returned to order.\n\nMaster Shigeng’s **Dao/Way** of cultivating spirit-**qi**.\n\nWhen **Wén Zhí** (文挚) saw **Qí Wēi Wáng** (齐威王), the king asked him about the **Dao/Way**, saying:\n*\"I have heard that you, Master Zhí, are well-versed in the **Dao/Way**.\nThough I am already attending to ancestral rites, I cannot spare the time to listen at length.\nI wish only to hear its essentials—just a few words.\"*\n\n**Wén Zhí** replied:\n*\"Your servant has expounded the **Dao/Way** in three hundred volumes,\nyet **意** (intention) is its most vital principle.\"*\n\nThe king asked:\n*\"You speak of **意**—how does it relate to eating and drinking?\"*\n\n**Wén Zhí** replied:\n*\"Pure wine and bitter leeks.\"*\n\nThe king asked:\n*\"Why do you praise the long leeks?\"*\n\n**Wén Zhí** replied:\n*\"After **Jiè** (后稷) first cultivated the land, the only grass that thrived for a thousand years was leek.\nThus, it was named accordingly.\nIt absorbs the **天气** (heavenly **qi**) early\nand retains the **地气** (earthly **qi**) well,\nso those who are **懹怯** (timid and fearful) grow bold when eating it;\nthose whose eyes fail to discern grow clear when eating it;\nthose whose ears fail to hear grow sharp when eating it.\"*\n\nThe king said:\n*\"In the spring, eating it [the leek] for three months—\nno minor ailments will flourish,\nand tendons and bones grow stronger.\nThis is called the sovereign of all grasses.\"*\n\nThe king asked:\n*\"Excellent. Why do you praise wine?\"*\n\n**Wén Zhí** replied:\n*\"Wine is the refined **qi** of the five grains.\nWhen it enters, it disperses and flows through the body,\npenetrating the meridians and reaching every passage\nwithout lingering in the **意** (intention) but fulfilling its purpose.\nThus, it is the foundation for all medicines.\"*\n\nThe king asked:\n*\"Excellent. But there are things contrary to your words—\nwhy do those who suffer from spring diarrhea,\nwhen eating leeks, not drink wine but instead eat eggs?\"*\n\n**Wén Zhí** replied:\n*\"That is also acceptable.\nThe chicken is a yang beast—\nit sharpens vision, clarifies hearing,\nand stretches its head while flaring its feathers.\nIn the three months of yin, it harmonizes with leeks,\nso those who follow the **Dao/Way** eat it.\"*\n\nThe king asked:\n*\"Excellent. Why do you praise **意** (intention)?\"*\n\n**Wén Zhí** replied:\n*\"**意** (Intention) is not merely for sustaining life.\nDucks, geese, cranes, wildfowl, turtles, fish, and all crawling creatures\nall eat and live.\nBut those who eat must cultivate **意** (intention) to complete their essence.\n**意** (Intention) ensures that food is not wasted,\ndisseminates medicine, and regulates punishment [of excess].\nCompare **意** (intention) to food as fire is to metal—\nwithout it for one night, recovery takes a hundred days.\nIf food is not transformed, it will become like a pure mass,\nbreeding stagnant **qi** and dark toxins,\nleading to danger, injury, and paralysis—\nthus, those who follow the **Dao/Way** revere **意** (intention).\"*\n\nThe king asked:\n*\"Excellent. I often drink late into the night—\nwill this cause harm?\"*\n\n**Wén Zhí** replied:\n*\"It causes no harm.\nConsider birds and beasts—\nthose that eat early rise early,\nthose that eat late rise late.\nHeaven receives the light, earth receives the dark,\nand those who follow the **Dao/Way** exhaust its principles and stop.\nWhen **qi** from food subtly enters and silently transforms,\nby midnight it reaches its full potential,\nconcentrating at the six extremities.\nWhen the six extremities are firm and refined,\nthe body becomes internally solid and externally balanced,\nno rashes or sores take root,\nand no abscesses or obstructions form—\nthis is the ultimate attainment of the **Dao/Way**.\"*\n\nThe king said:\n*\"Excellent.\"*\n\nThe king **Wáng Qī** arrived, and **Qín Zhào Wáng** asked him about these matters, saying:\n*\"I have heard that consuming **yin** (shadow/cooling) foods enhances vitality, and inhaling **qi** sharpens clarity. Where should I focus to prolong my life?\"*\n\n**Wáng Qī** replied:\n*\"You must align with the sun and moon and absorb their luminous **jing** (essence).\nEat pine and cypress, drink from the springs of swift-running beasts—\nthis can restore youth to old age and prolong vitality with radiance.\n\nIn the summer’s third month, avoid heat,\nusing daily sun-cooked meals—\nthen your spirit will be wise and your senses keen.\n\nFollowing the **Dao/Way** of **yin** (shadow/cooling),\nstrength comes from stillness,\ncalm your heart like water,\nlet the **linglù** (divine dew) dwell within.\nUse slow, measured movements—\nlet your heart not tremble or sway—\nas the five tones approach,\ndiscern which is short, which is long,\nand inhale their **shénwù** (spiritual mists),\ndrink the **tiānjiāng** (heavenly brew).\nConcentrate this within the five **zàng** (viscera),\nso it may sink deep and abide.\n\nBreathe like the **lóng** (dragon) at dawn,\nand your **qi** will become firm and strong.\nSupport [your practice] with [ritual] **xiāng** (incense),\nand dwell near flowing water—\nthen your **jing** and **qi** will remain vigorous and enduring.\n\nWhen the spirit is harmonized within,\nyour **húnpò** (ethereal soul/spirit) will flourish,\nthe five **zàng** (viscera) will be steadfast and resilient,\nyour complexion will regain its luster,\nand your lifespan will rival the sun and moon—\nyou will be the foremost **yīng** (hero) of Heaven and Earth.\"*\n\n**Zhāo Wáng** said:\n*\"Excellent.\"*\n\n**Hé yīn yáng** (Harmonizing **yin** and **yang**)\n\nTo harmonize **yin** and **yang**’s **Dao**/Way,\n\nhold the hand, extend the wrist’s **yáng** (阳),\npress the elbow’s **fáng** (房),\nblock the armpit’s **páng** (旁),\nascend the **gāng** (纲),\npress the neck’s **xiàng** (乡),\npress the **zhěng** (拯) and **kuàng** (匡),\ncover the **zhōu huán** (周环),\ndescend to the **quē pén** (缺盆),\npass the **lǐ jīn** (醴津),\ncross the **bó hǎi** (勃海),\nascend **héng shān** (恒山),\nenter the **xián mén** (玄门),\ncontrol the **jiāo jīn** (交筋),\nand elevate the **shénwù** (神雾) to invigorate the spirit—\nthen you may gaze long and abide with Heaven and Earth.\n\nThe **jiāo jīn** (交筋) refers to the **xián mén** (玄门)’s intersecting pulse.\nWhen grasped and pressed, the body thrills with **yáng** (痒),\ndelighted and pleased, as if drawn to its **hǎo** (好).\n\nEven if you wish not to act,\nthe signs appear: sighing, embracing,\nto indulge in the **xìdào** (戏道).\n**Xìdào** (戏道): First, **qi** rises hot above—\nslowly sigh; second, **rǔ** (乳) grows firm, nose sweats—\nslowly embrace; third, the tongue grows thin and slippery—\nslowly **tún** (屯); fourth, **yè** (液) descends, thighs grow damp—\nslowly press; fifth, the throat dries, saliva gathers—\nslowly **huǎn** (撼).\nThis is called the five **yù** (欲)’s signs.\n\nWhen all signs are present, elevate—\nelevate and do not withdraw,\nto gather the **qi**.\n**Qi** arrives, deeply withdraw and elevate it again,\nto release its heat;\nthen return it downward,\ndo not let the **qi** rest,\nor else the **nǚ** (女) will be utterly drained.\n\nThen ten **dòng** (动) arise,\ntouching ten **jié** (节),\nand ten **xiū** (修) intertwine.\nWhen the form is fully engaged,\ndirect the **qi** to the **zōngmén** (宗门),\nthen observe the eight **dòng** (动),\nlisten to the five **yīn** (音),\nand perceive the ten **yǐ** (已)’s signs.\n\nThe ten **dòng** (动):\nFirst **dòng** (动), then twenty, thirty, forty,\nfifty, sixty, seventy, eighty, ninety, a hundred—\n**qi** flows in and out without **xiè** (泻).\nOne **dòng** (动) without **xiè** (泻), ears and eyes grow keen;\ntwo **dòng**, voice and sound become clear;\nthree **dòng**, skin and flesh radiate light;\nfour **dòng**, spine and ribs grow strong;\nfive **dòng**, buttocks and thighs grow robust;\nsix **dòng**, the **shuǐdào** (水道) flows;\nseven **dòng**, firmness and strength arise;\neight **dòng**, pores and **lǐ** (理) shine;\nnine **dòng**, **shénmíng** (神明) becomes lucid;\nten **dòng**, the body remains constant—\nthis is called the ten **dòng** (动).\n\nThe ten **jié** (节):\nFirst, **hǔ yóu** (虎游);\nsecond, **chán fù** (蝉附);\nthird, **chǐ huò** (尺蠖);\nfourth, **gōng jiǎo** (囷角);\nfifth, **yáng zhé** (蝗磔);\nsixth, **yuán jù** (猿踞);\nseventh, **chán zhū** (蟾诸);\neighth, **tù wù** (兔骛);\nninth, **tíng líng** (蜻蛉);\ntenth, **yú zuǐ** (鱼嘬).\n\nThe ten **xiū** (修):\nFirst, **shàng** (上);\nsecond, **xià** (下);\nthird, **zuǒ** (左);\nfourth, **yòu** (右);\nfifth, **jí** (疾);\nsixth, **xú** (徐);\nseventh, **xī** (希);\neighth, **shuò** (数);\nninth, **qiǎn** (浅);\ntenth, **shēn** (深).\n\nThe eight **dòng** (动):\nFirst, **jiē shǒu** (接手)—\nto press the abdomen;\nsecond, **shēn zhǒu** (伸肘)—\nto massage and resist above;\nthird, **zhí zhǒng** (直踵)—\nto press deeply;\nfourth, **cè gōu** (侧钩)—\nto press obliquely;\nfifth, **shàng gōu** (上钩)—\nto press below;\nsixth, **jiāo gǔ** (交股)—\nto pierce too deeply;\nseventh, **píng yìng** (平踊)—\nto press lightly;\neighth, **zhèn dòng** (振动)—\nto urge the partner to hold long.\n\n**Zhènxī** (瘛息) is inward urgency;\n**chuǎnxī** (喘息) is supreme beauty.\n**Lěi’āi** (累哀) is when the **yùyè** (玉策) enters and **yáng** (痒) begins;\n**huì** (吙) is when **yán gān** (盐甘) is intense,\n**niè** (啮) is when the body trembles,\nurging the partner to endure long.\n\n**Hūn** (昏) is when the **nán** (男)’s **jīng** (精) is strong;\n**zǎo** (早) is when the **nǚ** (女)’s **jīng** (精) accumulates.\nI nourish my **jīng** (精) to cultivate the **nǚ**’s **jīng** (精),\nas the **qiánmài** (前脉) pulses,\nskin and flesh, **qi** and blood all respond—\nthus closed and blocked passages open,\nthe **zhōngfǔ** (中府) receives and overflows.\n\nThe ten **yǐ** (已)’s signs:\nFirst **yǐ** (已), **qīng** (清) **lù** (露) emerges;\nsecond **yǐ**, foul odor like **fán gǔ** (燔骨);\nthird **yǐ**, dryness;\nfourth **yǐ**, **gāo** (膏);\nfifth **yǐ**, **xiāng** (芗);\nsixth **yǐ**, slipperiness;\nseventh **yǐ**, **yǒu** (有);\neighth **yǐ**, **zhī** (脂);\nninth **yǐ**, **jiāo** (胶);\ntenth **yǐ**, **yǒu** (有).\n**Yǒu** (有) returns to slipperiness,\n**qīng** (清) **lù** (露) emerges again—\nthis is called **dàzú** (大卒).\n\nThe signs of **dàzú** (大卒):\nNose sweats, lips turn white,\nhands and feet tremble,\nthe buttocks do not touch the bed,\nthey rise and depart—\ndeath is thin.\nAt this time,\n**zhōngjí** (中极) **qi** expands,\n**shénmíng** (神明) returns to the **zàng** (藏),\nand **shénmíng** (神明) is born.\n\nThe **Dao**/Way of Heaven and Earth is the ultimate **Dao**/Way.\n\nThe **Yellow God** inquired of the **Left God**, saying: *\"Why do the nine orifices and twelve joints of yin-yang all arise, yet death comes first to one alone?\"*\n\nThe **Left God** replied: *\"Because one does not exert their strength, does not indulge in sorrow or joy, does not favor their diet—dwelling in extreme darkness yet never exposed to light—suddenly and violently using it, without waiting for its fullness, unable to endure the dual heat, thus hastening injury. To conceal its name and obscure its form, to engage in excessive violence without propriety, is why it arises with the body yet dies first alone.\"*\n\nWhen anger comes but is not great, the flesh is not fully engaged;\nwhen great yet not firm, the sinews are not fully engaged;\nwhen firm yet not heated, the **qi** is not fully engaged.\nIf the flesh is not engaged yet used, it becomes **wěi** (腄);\nif the **qi** is not engaged yet used, it becomes **bì** (避).\nWhen all three are engaged, this is called **sān zhì** (三诣).\n\nThe ultimate **Dao**/Way of Heaven and Earth is spoken of thus:\nLike water in taste, like the **qi** of spring and autumn,\nthose who depart are not seen, their merit not attained;\nthose who arrive are not obstructed, I feast upon their offerings.\nAh! Be cautious, for the matter of **shénmíng** (神明) lies in what is closed.\n\nWhen the **jade-like closure** (玉闭) is carefully managed,\n**shénmíng** (神明) will approach.\nIn general, those who cultivate the body\nmust strive to accumulate **jīng** (精).\nWhen **jīng** (精) is abundant, it must be released;\nwhen **jīng** (精) is deficient, it must be supplemented.\nAt the times of supplementation and release,\ndeficiency and abundance must be balanced.\nIf one sits in harmony with it,\nleaving the buttocks, anus, mouth, and nose open,\neach according to its proper time,\nsuddenly departing and arriving,\nwhen the utmost **jīng** (精) is about to be lost,\nhow can I prevent it?\n\nVitality and depletion have their constants;\nbe cautious in its use, forget not,\nneither exhaustion nor excess—\nlet sinews and bones be strong and resilient.\nWith the heels pressing the **jade spring** (玉泉),\nand nourishment from fragrant sustenance,\nentering and exiting subtly,\nawaiting fullness as the norm,\nwhen the three harmonies of **qi** are achieved,\nfirmness and vigor will strengthen.\n\nWhen one seeks to cultivate it,\nthey must first examine their words.\nWith the heels pressing the **jade closure** (玉闭),\none can achieve **unity with the Dao** (壹仙).\n**Unity with the Dao** (壹仙) once attained:\nthe first movement sharpens hearing and sight,\nthe second clarifies voice and speech,\nthe third brightens skin and flesh,\nthe fourth strengthens the spine and bones,\nthe fifth fortifies the buttocks and thighs,\nthe sixth activates the **waterways** (水道),\nthe seventh achieves the utmost firmness and strength,\nthe eighth elevates the will and pride,\nthe ninth aligns with the **Heavenly Vitality** (天英),\nthe tenth generates **shénmíng** (神明).\n\n**Qi** has eight benefits, yet also seven harms.\nIf one cannot harness the eight benefits\nor eliminate the seven harms,\nthen at **forty-nine** (四十九) years, the yin **qi** will be halved,\nat fifty, movement and rest will decline,\nat sixty, hearing and sight will dull,\nat seventy, the lower body withers while the upper detaches,\nand the yin **qi** unused will gush forth in tears.\nThere is a **Dao**/Way to restore vitality:\neliminate the seven harms to dispel illness,\nharness the eight benefits to double the **qi**,\nthus the aged regain their strength,\nand the strong do not decline.\n\nThe **virtuous** (君子) dwell in ease and comfort,\nindulge in food and drink as they please,\ntheir pores soft and dense,\ntheir **qi** and blood abundant and full,\ntheir bodies light and agile.\nIf illness enters inward yet cannot be **channeled** (道),\nthey will sweat, pant, and be troubled by **qi**;\nif it cannot be treated,\ninternal heat will arise;\nif one forces **qi** through medicines, cauterization, or acupuncture,\nand supplements with external tonics,\nyet still cannot **channel** (道) it,\nthey will develop **boils, tumors, or scrotal swelling** (痤肿睾);\nwhen **qi** and blood are abundant yet the nine orifices fail to **channel** (道),\nand the upper and lower body are unused,\n**boils and abscesses** (痤疽) will arise.\nThus, those who skillfully harness the eight benefits\nand eliminate the seven harms\nwill have no five illnesses.\n\nThe eight benefits:\n1. **Regulating qi** (治气),\n2. **Directing saliva** (致沫),\n3. **Knowing the times** (知时),\n4. **Retaining qi** (畜气),\n5. **Harmonizing saliva** (和沫),\n6. **Stealing and accumulating qi** (窃积气),\n7. **Awaiting fullness** (待盈),\n8. **Balancing inclinations** (定倾).\n\nThe seven harms:\n1. **Closure** (闭),\n2. **Depletion** (泄),\n3. **Exhaustion** (竭),\n4. **Neglect** (勿),\n5. **Disturbance** (烦),\n6. **Forced suppression** (绝),\n7. **Waste** (费).\n\nThe cultivation of the eight benefits:\nAt dawn, rise and sit upright,\nstraighten the spine,\nopen the buttocks,\ncontract the **state** (州),\nsuppress the lower regions—this is **regulating qi** (治气);\nafter eating and drinking, lower the buttocks,\nstraighten the spine,\ncontract the **state** (州),\nand **channel** the **qi**—this is **directing saliva** (致沫);\nfirst engage in playful and joyous activities,\nthen intermingle desires—this is **knowing the times** (知时).\nWhen doing so, straighten the spine,\ncontract the **state** (州),\nand suppress the lower regions—this is **retaining qi** (畜气);\nwhen doing so, neither hasten nor repeat,\nbut harmonize and treat the entering and exiting—this is **harmonizing saliva** (和沫);\nwhen **qi** is about to be released,\nlet someone rise and release it,\nthen vent the anger—this is **stealing and accumulating qi** (窃积气);\nwhen **qi** is nearly spent,\ncontract the spine inward,\ndo not move,\ncontract the **qi**,\nsuppress the lower regions,\nand still the body—this is **awaiting fullness** (待盈);\nwhen **qi** is released, scatter it,\nand when angered, release it—this is **balancing inclinations** (定倾).\nThis is the eight benefits.\n\nThe seven harms:\nWhen doing so, if one feels sudden pain—this is **internal closure** (内闭);\nif one sweats—this is **external depletion** (外泄);\nif one does not cease—this is **exhaustion** (竭);\nif one reaches the point of desire yet cannot complete it—this is **neglect** (勿);\nif one pants and is troubled by **qi**—this is **disturbance** (烦);\nif one does not desire yet forces it—this is **forced suppression** (绝);\nif one reaches the point of illness—this is **waste** (费).\nThis is the seven harms.\n\nThus, those who skillfully harness the eight benefits\nand eliminate the seven harms\nwill have keen hearing and sight,\na light and agile body,\nstrengthened yin **qi**,\nprolonged life and vitality,\nand enduring comfort in dwelling.\n\nTwo things in life are not learned by humans:\n1. **Breath** (息),\n2. **Nourishment** (食).\nApart from these two,\nthere is nothing that is not learned through study and practice.\nThus, **nourishment** (食) is the source of life,\nwhile **sexual indulgence** (色) is its detriment—\nthis is why the **sage** unites men and women only with proper restraint.\n\nThus:\n1. **Tiger’s Flow** (虎流),\n2. **Cicada’s Attachment** (蝉附),\nthinking outward,\n3. **Earthworm’s Inch-by-Inch** (尺蠖),\n4. **Antler’s Horn** (囷角),\n5. **Locust’s Severed** (蝗磔),\nthinking inward,\n6. **Monkey’s Squat** (猿踞),\nthinking outward,\n7. **Toad’s Gathering** (蟾诸),\n8. **Hare’s Leap** (兔骛),\n9. **Dragonfly’s Flutter** (蜻蛉),\nthinking outward,\n10. **Fish’s Suck** (鱼嘬).\nThis is called the **Ten Postures** (十势).\n\n1. **Directing qi** (致气),\n2. **Fixing flavor** (定味),\n3. **Treating the joints** (治节),\n4. **Laboring with fullness** (劳实),\n5. **Acting at the proper time** (必时),\n6. **Opening the talent** (通才),\n7. **Subtle movement** (微动),\n8. **Awaiting fullness** (待盈),\n9. **Equalizing vitality** (齐生),\n10. **Stillness of form** (息形).\nThis is called the **Ten Practices** (十修).\n\n1. **Elevating it** (高之),\n2. **Lowering it** (下之),\n3. **Directing it left** (左之),\n4. **Directing it right** (右之),\n5. **Deepening it** (深之),\n6. **Shallowing it** (浅之),\n7. **Hastening it** (疾之),\n8. **Slowing it** (徐之).\nThis is called the **Eight Methods** (八道).\n\nWhen the **Ten Practices** (十修) are complete,\nthe **Ten Postures** (十势) are prepared in advance,\nand the **Eight Methods** (八道) are combined with the **form** (形),\nthen the **form** is managed until **qi** is spent in **dusk** (昏).\n\n「Sweat does not reach the point of streaming, yet the **Way** (道) of **qi** and blood is opened.\nThe throat contracts, and the front is swayed—**pulse pathways** (脉) are unblocked, and **sinews** (筋) are made supple.\n\nThen observe the **Eight Movements** (八动),\nand where the **qi** (氣) resides.\nThen discern the **Five Sounds** (五言),\nwhich follow and which precede.\n**Eight Movements**:\n1. **Clasping the hands** (接手),\n2. **Extending the elbows** (伸肘),\n3. **Flattening the feet** (平踊),\n4. **Straightening the heels** (直踵),\n5. **Crossing the thighs** (交股),\n6. **Shaking and trembling** (振动),\n7. **Lateral hooking** (侧钩),\n8. **Hooking upward** (上钩).\n\n**Five Sounds**:\n1. **Throat gasping** (喉息),\n2. **Panting** (喘息),\n3. **Repeated sorrowful sighs** (累哀),\n4. **Guttural exhalations** (吙),\n5. **Gritting teeth** (啮).\n\nExamine the **Five Sounds** to understand their **mind** (心);\nExamine the **Eight Movements** to know their **delights** (所乐) and **openings** (所通).\n\n**Clasping the hands** (接手) is to **apply** (傅) to the abdomen;\n**Extending the elbows** (伸肘) is to **stroke and press** (摩且距) upward;\n**Lateral hooking** (侧钩) is to **stroke the sides** (旁欲摩);\n**Crossing the thighs** (交股) indicates **piercing** (刺) is excessive;\n**Straightening the heels** (直踵) means **deepening** (深) is insufficient;\n**Hooking upward** (上钩) means **lower** (下) does not reach the **heart** (心);\n**Flattening the feet** (平踊) indicates **shallowing** (浅);\n**Shaking and trembling** (振动) is the **ultimate skill** (至善).\nThis is called the **Eight Observations** (八观).\n\nWhen **qi** rises to the surface and heat appears,\n**slowly exhale** (徐呴).\nWhen the **breasts** (乳) harden and **nose sweat** (鼻汗) forms,\n**slowly embrace** (徐抱).\nWhen the **tongue** (舌) is thin and slippery,\n**slowly apply** (徐傅).\nWhen the **lower fluids** (下液) moisten the **thighs** (股),\n**slowly manipulate** (徐操).\nWhen the **lips** (嗌) are dry and **saliva** (唾) thickens in the throat,\n**slowly agitate** (徐撼).\nThis is called the **Five Manifestations** (五征),\nthis is called the **Five Desires** (五欲).\nWhen all **Manifestations** (征) are complete,\nthe **Way** (道) is ascended.\n\nAnger that does not flare intensely means the **skin** (肤) is not affected;\nAnger that flares but is not firm means the **sinews** (筋) are not reached;\nAnger that is firm but not heated means the **qi** (氣) is not engaged.\nWhen all three are present, **entry** (入) is achieved.\n\nThe first **stage** (已) is **cool and refreshing** (清凉);\nThe second **stage** (已) is foul-smelling like **rotting bones** (靡骨);\nThe third **stage** (已) is **dry** (燥);\nThe fourth **stage** (已) is **greasy** (膏);\nThe fifth **stage** (已) is **fragrant** (芗);\nThe sixth **stage** (已) is **dense and vital** (精) like **millet and wheat** (黍粱);\nThe seventh **stage** (已) is **stagnant** (滞);\nThe eighth **stage** (已) is **oily** (脂);\nThe ninth **stage** (已) is **slimy** (腻);\nThe tenth **stage** (已) is **congealed** (迄),\nthen **slippery again** (复滑),\nand the **morning qi** (朝气) emerges.\n\n1. **Hairpin-like radiance** (笄光),\n2. **Sealing the meridians** (封纪),\n3. **Empty gourd** (瓠),\n4. **Mouse-woman** (鼠妇),\n5. **Grain-flesh** (谷实),\n6. **Barley-teeth** (麦齿),\n7. **Virgin’s flesh** (婴女),\n8. **Returning to the void** (反去),\n9. **Where is it lodged?** (何寓),\n10. **Crimson** (赤),\n11. **Crimson Pearl Nine** (赤珠九),\n12. **Cavity Stone** (石).\nWhen obtained, **do not release** (勿释).\nIf **death** (死) is imminent, **thin the pulse** (走理毛),\n**place at the waist and heart** (置腰心),\nuntil the **lips** (唇) are fully white,\nand **sweat flows to the popliteal fossa** (汗流至腘).\nThe count reaches **hundreds** (百).\n\nEvery person has **talents** (善者),\nbut **women** (女人) are not lost—\n**women** (女人) possess them,\nbut only the **talented** (善者) can **master** (独能).\n**Do not give** (毋予) nor **treat** (毋治),\n**do not act nor doubt** (毋作毋疑).\n**It must be done slowly and sustained** (必徐以久),\n**subtly and persistently** (必微以持).\nIf **already achieved** (如已) yet **not perfected** (不已),\nthen the **woman** (女) will attain **great joy** (大怡).\n\n**Throat gasping** (喉息),\nthe **qi** (氣) descends, and **saliva** (阴) is expelled—\n**radiance** (光) is **yang** (阳), **sweat** (阴) is **yin** (阴);\n**Panting** (喘息),\nthe **qi** (氣) rises and **presses** (相薄),\nand **self-control** (自容) **expands** (张).\n\nThe **accumulation of ailments** (累疾者) arises when the **anus** (尻) suffers illness and **seals the meridians** (动封纪);\nThe **itching** (吙者) begins when one **holds bitter** (衔甘甚) and **itching** (痒) emerges;\nThe **gnawing** (啮者) causes **body tremors** (身振动), **settling** (置已) yet **persisting** (久).\n\nThus, **male and stallion** (雄牡) belong to **yang** (阳), **yang being external** (阳者外也);\n**Female and mare** (雌牝) belong to **yin** (阴), **yin being internal** (阴者内也).\nAll **male attributes** (牡之属) **rub externally** (摩表),\nAll **female attributes** (牝之属) **rub internally** (摩里).\nThis is called the **principles of yin and yang** (阴阳之数), the **laws of male and female** (牝牡之理).\nIf one **fails to grasp** (弗得) this, the fault lies in **excessive haste** (过在数已).\n\nThe **essence of delight** (嬲乐之要) lies in **slowness and endurance** (务在迟久).\nIf one can **delay and persist** (能迟久), then the **woman attains great joy** (女乃大喜),\n**loved as brothers** (亲之弟兄), **cherished as parents** (爱之父母).\nThose who **master this Dao** (能此道者) are called **Heavenly Worthies** (天士).\n\n---\n**The Classic of Conception** (胎产书):\n**Yu** questioned **Youpin** (幼频) and said:\n*\"I wish to **augment births and children** (殖人产子), how should one proceed to **ensure conception** (有)?\"*\nYoupin replied:\n*\"After the **new moon** (月朔已去), within **three days**, **follow** (从之), and **conception will occur** (有子).\nThe **first day** yields a **son** (男),\nThe **second day** yields a **daughter** (女).\"*\n\nThus, when a person **conceives** (产),\nThey **enter darkness** (入于冥冥) and **emerge from darkness** (出于冥冥) before becoming human (乃始为人).\n\n**The first month** is called **Flowing Punishment** (流刑):\n**Diet must be refined** (食饮必精),\n**Sour broths must be cooked** (酸羹必熟),\n**Avoid spicy and game meats** (毋食辛腥)—\nThis is called **preserving purity** (哉贞).\n\n**The second month** begins **grease formation** (始膏):\n**Avoid spicy and rancid foods** (毋食辛臊),\n**Dwell in quietude** (居处必静),\n**Men must not overwork** (男子勿劳),\nFor **all joints may ail** (百节皆病)—\nThis is called **initial storage** (始藏).\n\n**The third month** begins **fat formation** (始脂):\n**Fruits and vegetables take effect at night** (果蓏宵效),\nAt this time, **no fixed rituals exist** (未有定仪),\n**Forms transform with exposure** (见物而化).\nThus, **rulers and nobles** (君公大人)\n**Must not see dwarves** (毋使侏儒),\n**Must not observe monkeys** (不观沐猴),\n**Must not eat** (不食) **wild ginger** (姜) **or hare stew** (兔羹);\n**To conceive a son**, **place bows and arrows** (置弧矢),\n**Hunt male pheasants** (雄雉),\n**Ride stallions** (乘牡马),\n**Observe male tigers** (观牡虎);\n**To conceive a daughter**, **wear hairpins and earrings** (佩簪珥),\n**Adorn with pearls** (绅珠子)—\nThis is called **internal symbols forming the child** (内象成子).\n\n**The fourth month**, when **water is imparted** (水授之),\n**Blood begins to form** (乃始成血).\n**Rice and wheat** are consumed,\n**Fish is served in a vessel** (觯鱼),\nTo **clarify blood and brighten vision** (以清血而明目).\n\n**The fifth month**, when **fire is imparted** (火授之),\n**Qi begins to form** (乃始成气).\n**Rise late and bathe early** (晏起□沐),\n**Wear thick garments in the hall** (厚衣居堂),\n**Morning exposure to celestial light** (朝吸天光),\n**Avoid cold misfortunes** (避寒殃).\n**Rice and wheat** are eaten,\n**Cow and sheep broths** are prepared,\n**Mixed with tiaojiu** (和以茱萸),\n**Avoid** (毋食) **bitter foods** (□),\nTo **nourish the qi** (以养气).\n\n**The sixth month**, when **metal is imparted** (金授之),\n**Tendons begin to form** (乃始成筋).\n**Labor in moderation** (劳□□□),\n**Roam the wilds** (出游于野),\n**Frequently observe running dogs and horses** (数观走犬马),\n**Must consume** (必食) **sour and bitter** (□□),\n**Though** (未) **rituals are unclear** (□□□□),\nThis is called **transforming the skin and tendons** (变腠□筋),\n**Adjusting the pores and vessels** (□□□□).\n\n**The seventh month**, when **wood is imparted** (木授之),\n**Bones begin to form** (乃始成骨).\n**Dwell in dry places** (居燥处),\n**Do not remain stationary** (毋使定止),\n**...[text fragment unclear]...**\n**Avoid cold in diet** (饮食避寒),\n**...[text fragment unclear]...** to **preserve teeth** (美齿).\n\n**The eighth month**, when **earth is imparted** (土授之),\n**Skin and hide begin to form** (乃始成肤革),\n**...[text fragment unclear]...**\nThis is called **densifying pores and vessels** (密腠理).\n\n**The ninth month**, when **stone is imparted** (石授之),\n**Hair and fur begin to form** (乃始成毫毛),\n**...[text fragment unclear]...**\n**...[text fragment unclear]...** to **observe carefully** (伺之).\n\n**The tenth month**, when **qi stagnates** (气陈),\n**It becomes a **fetus** (以为胎).\n\n---\n**Methods for Childbirth and Postpartum Care:**\n**For those attending births** (凡治字者),\n**Wash the placenta** (澣胞) **with clear water** (以清水).\n\n**Method One:**\n*\"**Thoroughly wash the placenta** (必熟洒澣胞),\nThen **wash** (澣) **...[text fragment unclear]...**\nPlace in a **small earthenware jar** (以瓦瓯),\n**Prevent insects and ants from entering** (毋令虫蚁能入),\n**...[text fragment unclear]...**\n**Keep from sunlight** (毋见日所),\nSo the **infant has no blemishes** (婴儿无疕),\n**Smooth pores** (曼理),\n**Long life** (寿□).\"*\n\n**Method Two:**\n*\"**Bury the placenta beneath the birth mat** (埋胞席下),\n**No blemishes or itching** (不疕瘙).\"*\n\n**Within the placenta** (内中),\n**...[text fragment unclear]...**\n**Drink daily at dawn** (以建日饮).\n\nIf **a woman has many sons but no daughters** (字而多男无女) and **desires a daughter** (而欲女),\n**Later** (后) **...[text fragment unclear]...**\n**Bury the placenta beneath the southern wall** (埋阴垣下).\nIf **a woman has many daughters but no sons** (多女无男),\n**Also take the placenta and bury it beneath the northern wall** (亦取胞埋阳垣下).\n\n**Method Three:**\n*\"**Wrap the placenta in a woven cloth** (以甗衣约胞) and **bury it** (埋之).\"*\n\n**For pregnant women** (怀子者),\n**Boil the head of a white male dog** (为烹白牡狗首),\n**Let her consume it alone** (令独食之),\n**Her child will be fair and flawless** (其子美皙),\n**And birth will be easier** (又易出).\n\n**To make the child strong** (欲令子劲者),\n**...[text fragment unclear]...** **consume mare’s flesh at the right time** (□时食母马肉).\n\n**For those pregnant less than three months** (怀子未出三月者),\n**Swallow two** (吞) **jade jars** (爵瓮),\n**The child will be male** (其子男也).\n\n**Method Four:**\n*\"Take **three green-backed insects from a nest** (雀瓮中虫青背者三),\n**Swallow them raw** (生吞之),\n**Conception will be male** (必产男),\n**Guaranteed** (万全).\"*\n\n**Method Five:**\n*\"At the **right moment** (以方咀时),\nTake **three measures of hemp, male herbs, and leeches** (蒿、牡、蜱蛸),\n**Decoct and drink** (冶，饮之),\n**Conception will be male** (必产男).\n**Tested** (已试).\"*\n\n**...[text fragment unclear]...**\n*\"**Urinate half a升** (遗溺半升),\n**...[text fragment unclear]...** **firm yet scant** (□□坚而少汁).\"*\n\n**Method Six:**\n*\"Take **bee larvae and dog testicles** (蜂房中子、狗阴),\n**Dry and decoct** (干而冶之),\n**Drink while pregnant** (以饮怀子),\n**The child will be male** (怀子产男).\"*\n\n**Method Seven:**\n*\"**Consume fresh fish** (□鲜鱼□□) **...[text fragment unclear]...**.\"*\n\n**...[text fragment unclear]...**\n*\"**Dry and decoct** (□□□□□□□干，冶之),\n**Add to wine** (投酒中),\n**...[text fragment unclear]...**\n**Pregnant women** (怀子者) **will conceive** (产□□□),\n**Not to be done in the first three months** (三月不可以□).\"*\n\n**...[text fragment unclear]...**\n*\"**...[text fragment unclear]...**\n**Ensure conception of a son** (令□□□□□□□□□□产男).\"*\n\n**Method Eight:**\n*\"Take **male crow** (乌□□□□) **meat for men to eat alone** (男子独食肉歠汁),\n**Women sit on rush mats** (女子席莞□).\"*\n**To conceive a daughter** (欲产女),\n*\"Take **female crow** (乌雌□□) **and boil** (煮),\n**Let women eat the meat alone and drink the broth** (令女子独食肉歠汁),\n**Sit on rush mats** (席□).\"*\n\n---\n**The Method of Seeking a Child** (求子之道):\n*\"**Gather the nine-stemmed grass** (求九宗之草),\n**Let the husband and wife brew it into wine** (而夫妻共以为酒),\n**Drink it** (饮之).\"*\n\n**For those about to give birth** (字者，且垂字),\n**First take fertile soil** (先取市土濡清者),\n**Shape it into a square** (□之) **three to four feet wide** (方三四尺),\n**Three to four inches high** (高三四寸).\nAfter the child is born, **place it on the soil** (置土上),\n**Do not cover it** (勿庸□),\n**Let the infant lie upon it** (令婴儿□上),\n**So its body fully absorbs the earth** (其身尽得土),\nThen **bathe it** (乃浴之),\n**To make it strong and vigorous** (为劲有力).\n\nAfter birth, **burn the birth mat** (字者已，即燔其蓐),\n**Submerge it in water** (置水中),\n**Bathe the infant** (□□婴儿),\n**Preventing blemishes and itching** (不疕瘙).\nTake **half a cup of the bathwater** (及取婴儿所已浴者水半杯),\n**Feed it to the mother** (饮母),\n**So she suffers no lingering illness** (母亦无余病).\n\n**For women who rarely conceive** (女子鲜子者),\n**After giving birth** (产),\n**Have another person hold the placenta** (令它人抱其□),\n**Remove and rinse it** (以去□□濯其胞),\n**Wrap it in fresh cloth** (以新布裹之),\n**Bind it in three layers** (为三约以敛之),\n**Place it in a container** (入□中),\n**Let the mother carry it herself** (令其母自操),\n**Walk to a river valley** (入溪谷□□□之三),\n**Discard it and return without looking back** (置去，归勿顾);\"\n\n**Immediately command another to bury it properly.**\n\n**Miscellaneous Prohibitions and Prescriptions:**\nIf a dog barks fiercely at the altar or door, smear the area above the well five *chi* wide.\nIf a husband and wife harbor mutual resentment, smear the doorframe five *chi* wide.\nTo curry favor with a noble, smear the left and right sides of the door five *chi* wide.\nFor frequent nightmares, smear the base of the doorframe seven *chi* wide.\nIf a mother-in-law and daughter-in-law quarrel constantly, smear the doorframe five *chi* wide.\nIf an infant cries incessantly, smear the window frame five *chi* wide.\nIn legal disputes, write the opponent’s name on the sole of your shoe.\n\n**Charms for Attraction and Reconciliation:**\nTake the tails of two female birds, burn and refine them, then drink the ashes—you will be charming.\nTake a dog’s head facing east-west, burn and refine it, then drink it.\nIf a husband and wife are estranged, take the left eyebrow of one and place it in wine; when drunk, they will reunite.\n\n**Charms for Capturing a Person:**\nTake four claws from a rooster’s left foot and four from a young girl’s left foot, boil them in a pot, refine the mixture, and apply it—you will ensnare the person.\n\n**Charms for Attraction (repetition):**\nTake the tails of two female birds, burn and refine them, then drink the ashes—you will be charming.\nTake the left eyebrow of one and place it in wine; when drunk, they will reunite.\n\n**Prescriptions for Nourishing Life:**\n[The aged shall not rise...]\n\n**Prescriptions for Nourishing Life (continued):**\n\n**For the Aged Who Cannot Rise:**\n[If the aged cannot rise,] the stench of the body may be [treated] by [certain means]—when harmonized, it will [then] descend.\nOne method: **Preparation of *Dianji* (棘) Decoction**\nTake *Dianji* thorns, each one inch long, three *dou*—[boil them] until they are thoroughly refined. Use a *gu* vessel to cook them until the liquid is thick and the thorns are firm. When boiling ceases, let it settle, then cook again.\nIf this is too troublesome, take two and a half *dou* of thorns, place them in an old earthenware vessel, and boil them with two *dou* of *ju* millet until done. When the *qi* is ripe, [let it steep] for ten days in coldness—it will then dry. [After drying,] soak it again. After two days, it becomes *jiang* (浆).\nWhen ready, drink one *sheng* of this decoction near the inner chamber. If the decoction is not yet ready, squeeze its juice and mix it with the decoction, making it sour and sweet—then drink it. Even if the aged are [still] unable to rise, this will make them rise immediately.\n[The method of] preparing *jiang*:\nAnother method: Soak [the thorns] in *wu* (乌) [liquor] until it is ripe. There is also [another method].\n**Making *Li* (醴):**\nTo make *li*, take *shu* millet and rice, [and follow the process]—when the rice *li* is ripe, each morning, take it to satiate thirst, and [continue] as before.\n**For Those Who Cannot Rise:**\nFor those who cannot rise, in the morning, prepare good water congee and [consume it] to satiate thirst, as before. [Do this] twice, and they will rise.\nDo not [overdo it]. If unused for two days, [reheat with] hot water and [consume it]. If [still] unable to rise, take one sip, then another, then a third—do not exceed three sips. Afterward, use [additional] methods.\nWhen sipping, do not do so consecutively—[pause] between sips. If already applied, splash with cold water, and do not [forget to] sip again.\nWhen eating and drinking, [after spitting out water,] be sure to [inhale] the *qi* with an open mouth, facing upward. Gradually exhale through the nose, then [retain the *qi*]—this benefits the aged.\n**Additives (加):**\nIn the fifth month on the full moon, gather *lai* (莱) and *lan* (兰), dry them in the shade, and refine them. Also refine white pine resin—[use] equal parts of each. Wrap them well with leather, and drink one dose daily.\nEach time you drink, take a pinch [of the mixture] with three fingers into wine, [and consume it]. This will strengthen vitality and improve mobility. Even if taken in the morning or evening, it is effective.\n[For those who are] weak.\n\n**For the weak:**\n\nOn the full moon of the fifth month, gather the *lai* (莱) and *lan* (兰) from the *xiang* (乡) region, place them in a keyhole-shaped container filled to capacity. Let the container be five *zhang* (丈) long, place it in a steamer, and cook with a bamboo basket. When the steam rises, remove it, and repeatedly refine it until its nature is unknown. Then take the medicine from the container, as large as millet grains, and consume it.\n\nAnother method: In the fifth month, prepare *fúlíng* (茯苓) when it turns yellow, then refine and store it well—this is beneficial.\n\nAnother method: For treating the middle [region], cut *wū* (乌) [herb] and refine it, then consume it in wine. This is the method of *xiān* (酰).\n\n**For making wine:**\n\n**Making wine:** Use three *dòu* (斗) of fine wine to steep *mài* (麦) [grain], fermenting it into wine for consumption.\n\nFor men who are weak, use *lì* (醴) wine to cook *xiè* (薤).\n\n**Treatment:**\n\nTake one male *huángfēng* (黄蜂), crush it fresh, and bathe in wine. Dry it in the shade and refine it, adjusting the quantity like *huángfēng* itself. Soak it in wine for three days, then consume four *cùn* (寸) of the cured meat. This is sixty-five doses.\n\nAnother method: Take twenty *huángfēng* (黄蜂), place them in a cup of *lì* (醴), and drink it at noon for ten doses.\n\nAnother method: Take one hundred *huángfēng* (黄蜂), steep them in a cup of fine soy sauce for one day and one night, then use the liquid to soak *jiāng* (饘) and *zōu* (糗) in a ratio of nine *shēng* (升) and two *shēng*. Each meal, consume it with wine, taking a pinch with three fingers.\n\nAnother method: *Lǚ Lè* of *Pínglíng* (平陵), dry the *zhǎn* (蠃) worm in the shade and refine it. For twenty doses, use seven pinches; for ten doses, use three pinches, with one cup of wine.\n\n**Barley eggs:**\n\n**Barley eggs:** Regularly, in the morning, crush *mài* (麦) eggs into wine before drinking. Drink twice the next day, three times the following day; then drink once more, twice, and three times again. Thus, consume two eggs entirely, strengthening vitality and enhancing beauty.\n\nAnother method: In the eighth month, gather *túlú* (菟芦) seeds, dry them in the shade, separate the kernels, and refine them, wrapping them in leather. By spring, use the juice of a female bird’s egg to coat them, forming pills the size of mouse droppings. Dry them in the shade, then place eight pills in a bowl of bean sauce and consume them with food.\n\nAnother method: In spring, take one bird’s egg, crush it, and mix it into *zōu* (糗) to form pills the size of large *niú* (牛) lice. Consume many of them for benefit.\n\nAnother method: [Text incomplete] For those who have already dried and refined [the substance], [method unclear].\n\nOne method states: To treat *yīn* (阴, \"yin\" imbalance), soak [the pills] in bean sauce within [a certain container]. **◎◎** [unclear] **To enhance male potency:** Soak *bó* (勃, \"vigorous\") *lǎn* (蠃, *Lan* or *Bole* fungus) in [a substance] for fifteen days, then use the soaking liquid to treat the male—male potency is strengthened.\n\n**To cauterize (灼):** On the fifteenth day of the fifth month, gather *bó lǎn* (勃蠃), soak it in [a substance] within a linen cloth, dry it in the shade, and heat it with [a substance]. **Easy method:** Take dried ginger, cinnamon, *yǐn* (蔈, *Yin* or *Atractylodes*) root, *shé jiā* (蛇蚧, \"snake scales\"), and [missing], all refine them, weigh equally, mix with honey or date paste to form pills the size of a finger’s tip, wrap them in coarse linen, place them inside [a container], and heat them gently.\n\nAnother method: In the fifth month, gather three *dòu* (斗, \"dou\" measure) of *pú bó* (蒲薄蠃, *Pu Bole* fungus) and two *dòu* of *táo* (桃, \"peach\") fruit, pound them together, put them in a jar, and pour three *dòu* of fine *jiàng* (酱, \"fermented bean sauce\") over them. Seal the jar, bury it in the ground, and let it ferment for three *cùn* (寸, \"inches\"). Cover the top with a *dù* (杜, \"plug\") so it is level with the earth. Boil it continuously for four days, then filter and discard the dregs. Use the liquid to dye a three-*chǐ* (尺, \"feet\") length of cloth, dry it in the shade, and dye it again repeatedly. When the liquid is exhausted, wrap the cloth well, ensuring it is not coarse. **When used:** Cut a piece as large as a palm, insert it into the nostrils—it causes great itching and heat; when pressed against the arm, the arm becomes itchy, firm, and hot. Do not let it touch the face, for if it does, the itching is unbearable. Adjust the amount of cloth accordingly.\n\n**To increase sweetness (益甘):** [Text unclear] *Fú líng* (茯苓, *Poria*) is removed from its dregs, and its juice is used to fatten *pí* (豯, *Pi* or *Pigweed* seeds). Feed this to women to make them more sweet and beautiful.\n\nTake a cow’s cheek, roast and refine it, together with dried ginger, *jūn guì* (菌桂, *Jun Gui* or *Fuling* and *Guizhi* mixture), and [missing], all combined, put into a pouch, and soak it in [a substance]. **Place it inside [a container].**\n\nAnother method: **Extract the juice,** and mix it with cow or deer *xiāo* (殽, \"minced meat\"), instructing women to insert it into their **vaginal orifice (戒, *jie* or *vaginal cavity*)**.\n\nAnother method: Peel and soften [a substance], remove its upper **noxious layers**, and finally cut it finely. Boil it until the **qi (气)** is fully extracted and the liquid is clear, then discard the turbid part. Reboil the clear liquid until it is exhausted; when dry, pound it finely, and place it below [a container]. When the time is right, sprinkle it with water and let it steep for seven or eight days before use.\n\nAnother method: Take **unhatched bird eggs (不鷇者)**, and with one meal, consume four of them, **drenching the mouth** with their liquid, then dry them in the shade. When dry, **use them**.\n\n**For playful purposes (戏):** Those who **do this**, take the *shǒu gōng* (守宫, \"eunuch\" or *Toad-headed Lizard*), and **soak it in [a substance] for a long time**. Then, bury it below the **mouth (口)** of [a container], deeply. **Dye the cloth** with its extracted juice, and use it to dye a woman’s arm.\n\nWhen a woman and man engage in **playful intimacy (戏)**, the cloth **immediately breaks or tears**; when **ejaculation occurs (去)**, it **immediately departs**.\n\nTake the *shǒu gōng* and place it in a new jar, then place **cinnabar (丹)** in the jar, allowing the *shǒu gōng* to consume it. When it dies, refine it, and **paint the woman’s arm or body** with its juice.\n\nWhen she and a man engage in **playful intimacy (戏)**, she **becomes infertile (不明)**; when **used**, it **is discarded**.\n\nRemove its hair.\n\n**Removing Hair (去毛):**\nIf one wishes to remove hair, let them first bathe with fresh breast milk, then bathe the lower body before the upper. The hair will then depart.\n\nAnother method: Fry the neck of a white toad with a earthworm, mix with spiderwebs and bitter gourd, and quench with iron. Then apply its juice to the body.\n\nAnother method: In the fifth month, pluck the hair and apply it with a mixture of *chēnglǐ* (称醴, \"measured wine\").\n\n**For Severe Swelling (病最肿):**\nFor severe swelling: Refine willow bark (*liǔ gē*), mix it thoroughly with fat and grease, and apply to the swelling. Then wrap it with cloth. When done, proceed with the *Convenient for Nearness to the Inner* method.\n\n**Convenient for Nearness to the Inner (便近内):**\nTo prepare the *Convenient for Nearness to the Inner* formula: Take the root of the *prettle thorn* (颠棘, *diān jí*), slice it into pieces of one *cùn* in length, two *shēn* (参, \"hands\"), and dry it well. Then take a fully black male *mó* (雄□, likely 雄蜂, \"male bee\"), crush its heart, brain, and chest (with wings intact) into a powder, and boil it with two *shēng* (升) of water in an old iron steamer. When the liquid becomes thick and concentrated, strain it and remove the dregs. Then boil the heart, lungs, and liver of a black *liè* dog (骘犬, \"black dog\") aged over one year, and strain the liquid through thick, concentrated layers with *wú* (芵, unclear—possibly 麻, \"hemp\"). Mix these five substances together and use them to soak the cloth. When the time comes, remove it and dry it. When thoroughly dry, refine it again.\n\nAnother method: For *Convenient for Nearness to the Inner*, take four *dòu* (斗) of millet, four *dòu* of good-quality curdled milk, four *fèn* (分) of *tiān mǔ* (天牡, \"heavenly male,\" likely a type of male substance or animal), and peaches the size of dates. Take seven male *liú* (蝼, \"mole cricket\") heads and one *shāo* (赣, unclear—possibly 蛇, \"snake\") skin, and mix them with half a *shēng* (升) of *tiān shè* (天社, \"heavenly community,\" likely a type of insect or medicinal substance). Soak all these in the curdled milk. When done, strain the liquid and soak a piece of fine cloth one *chǐ* (尺) in length. When the soaking is complete, dry it, then soak it again. When the juice is exhausted, apply *gǔ* (榖, unclear—possibly 枸杞, \"goji berry\") and *yǐ* (椅, unclear—possibly 桐, \"paulownia\") juice to the cloth and dry it again. Store it well.\n\nWhen used, hold it with a *yù* (玉, \"jade\") staff while riding, and the stallion will become aroused. The *tiān shè* is the insect that feeds on peach and plum blossoms. The *táo kě* (桃可) is the peach when its hair is still present. The *mǔ liú* (牡蝼) are the heads of mole crickets. The *shāo* (赣) skin resembles that of a snake.\n\nAnother method: Burn *yáng sī* (杨思, unclear—possibly 杨树皮, \"willow bark\"), spread a cloth beneath it, and collect the falling ashes. Mix them with the juice of the cloth, then use the cloth to stimulate the female, and the stallion will become aroused.\n\n**Lightening the Body and Enhancing Vitality (轻身益力):**\nIf one wishes to lighten the body, take the substances discarded by humans after consuming *yáng sī* (杨思), *hóng mǐ* (红蜜, \"red honey\"), and *bān huáng* (斑黄, unclear—possibly 斑蝥, \"blister beetle\"), and mix them together. Use this as a post-meal supplement. In spring and autumn, consume four *dòu* (斗) each of *yáng sī*, *hóng mǐ*, and *bān huáng*, along with *tiān mǔ* (天牡) to nourish and strengthen the body.\n\nAnother method: For *Convenient for Nearness to the Inner*, take two *qì* (萩, \"lespedeza\") pods, refine them, and soak in one *shēn* (参) of water. Extract the juice well, then soak the cloth in it. When the time comes, remove it and dry it thoroughly. If it is not dry, soak it again.\n\nAnother method: Dry the male mouse’s kidneys in the shade, refine them, and mix with the crushed eggs of a *yì* bird (邑鸟, unclear—possibly 鹦鹉, \"parrot\"). Apply this to a new cloth.\n\nWhen used, stimulate both male and female with it.\n\nAnother method: Take one *dòu* (斗) of *dìng yíng* (岪嬴, unclear—possibly 丁香, \"clove\"), divide it into two parts, and soak one part in wine before exposing it to the sun. On winter days, place it above the fire until it boils thoroughly, then remove the *dìng yíng* and refine it. The rest is as before—soak the cloth in it and exhaust its juice. Then apply it to the cloth and use it to stimulate the male, causing the female to also become aroused.\n\nAnother method: Take four *dòu* (斗) of *bàng* (蠃, unclear—possibly 蚌, \"clamshell\"), four *dòu* (斗) of good-quality curdled milk, four *fèn* (分) of *tiān mǔ* (天牡), and peaches the size of dates. Take seven male *liú* (蝼) heads and one *shāo* (赣) skin, and mix them with half a *shēng* (升) of *tiān shè* (天社). Soak all these in the curdled milk. When done, strain the liquid and soak a piece of fine cloth in it. When the juice is exhausted, the process is complete.\n\nWhen used, moisten the cloth and hold it with a jade staff while riding, and the stallion will become aroused. The *tiān shè* is the insect that feeds on peach and plum blossoms. The *táo kě* (桃可) is the peach when its hair is still present. The *mǔ liú* (牡蝼) are the heads of mole crickets. The *shāo* (赣) skin resembles that of a snake.\n\nAnother method: Burn *yáng sī* (杨思), spread a cloth beneath it, and collect the falling ashes. Mix them with the juice of the cloth, then use the cloth to stimulate the female, and the stallion will become aroused. This lightens the body and enhances vitality.\n\nAnother method: For the cloth, take the substance discarded by humans after consuming *yáng sī* (杨思), *hóng mǐ* (红蜜), and *bān huáng* (斑黄), and mix them together. Use this as a post-meal supplement. In spring and autumn, consume four *dòu* (斗) each of *yáng sī*, *hóng mǐ*, and *bān huáng*, along with *tiān mǔ* (天牡) to nourish and strengthen the body.\n\n**Nourishing the Center and Augmenting Qi**\n\n**Nourishing the Center and Augmenting Qi:**\nTake fatty female goat meat and animal fat, all sun-dried and refined. Take a three-fingerful as a dose.\n\nAnother method: For those with joint ailments, the prescription includes bird’s nest, [illegible], *zéxiè* (泽泻), *chú* (朮), and sour jujube [illegible]. Refine these, mix with pine resin, and form into pills. Take after meals, adjusting the dose as needed.\n\nAnother method: In spring and autumn, gather *wǎn* (菀), sun-dry and refine it; take winter melon seeds, refine them, and combine with a three-fingerful to nourish the center.\n\nAnother method: Take *fángfēng* (防风) and [illegible]—three parts each—refine with mustard. Take a three-fingerful after meals.\n\nAnother method: Slice thin strips of beef, then take *bìxuè* (萆薢) pieces one inch long, place them between the beef slices, boil until done, then rest. Boil again, rest again—three cycles—then eat the meat. Collect the broth and *bìxuè*, then boil the meat again, repeating three times before discarding the broth. This strengthens the body without harming it. The amount of meat consumed may vary at will.\n\nAnother method: Take *bái yuán* (白芫), sun-dry and refine it, mix with horse sauce, and form into pills the size of a fingertip. Insert into the [illegible] orifice, expanding and enlarging it.\n\nAnother method: Refine equal parts *mǎn dōng* (满冬), [illegible], and *fángfēng*, then combine them.\n\nAnother method: Take two parts *guì* (桂), four parts *xìxīn* (细辛), one part *qì* (萩), one part *mǔlì* (牡蛎), and two parts *qín jiāo* (秦椒). Take a three-fingerful after meals to strengthen the body.\n\nAnother method: Chew *rú* (茹), grind it wet, and place it in a container. Those who eat heartily and drink wine should sniff it.\n\n[Illegible]—refine each thoroughly, combine, and take three days of a male deer’s blood, wrapping it in silk. Cover with leather and secure the male deer’s [illegible] for ten days. Use a bamboo joint one *zhǐ* (节) long, with a diameter of three *cùn* (寸).\n\nAnother method: In autumn, take the heads of three *bān chóu* (斑豆), refine them, and this strengthens the body.\n\nAnother method: Take [illegible] and refine it to strengthen the body.\n\nAnother method: Place [illegible] juice in a keyhole, and let a male bird [illegible] drink from water. This strengthens the body.\n\nAnother method: Take a pig’s fat the size of a hand, let bees [illegible], and mix with four *dòu* (斗) of refined wine dregs. Refine thoroughly. If no effect, sprinkle it.\n\nAnother method: [Illegible]—also take after meals.\n\nAnother method: Take a large male hare, skin it, and remove its intestines. Take one bunch of *bìxuè* (四寸), one bunch of *chú* (朮), and ten *wūhuì* (乌喙), peel and finely chop them. Add the hare’s meat to the mixture, dry thoroughly without exposure to sunlight, and wrap it for a hundred days. Take a three-fingerful after meals for a hundred days. At six or seven, one may eat freely as needed.\n\nAnother method: Take *xìxīn* (细辛), *gān jiāng* (干姜), *guì* (桂), and *wūhuì* (乌喙)—four substances in total. Refine each separately: four parts *xìxīn*, and two parts each of *gān jiāng*, *guì*, and *wūhuì*. Combine and take a three-fingerful after meals to augment qi and brighten the complexion.\n\nAnother method: Take two *liǎng* (两) each of *bái fú* (白苻), *hóng fú* (红符), and *fúlíng* (茯苓), ten slices of ginger, and three *chǐ* (尺) of *guì* (桂). Refine all, then mix with two *dòu* (斗) of fine vinegar. Take ten *liǎng* (两) of *xíngmǎ* (刑马) meat, dry-cure it thinly like three fingers, then soak it in the vinegar, repeatedly stirring and draining. After draining, sun-dry it, then boil it until tender. Slice it thinly, dry it again, and repeat the process until the meat is glossy. Finally, coat it with lacquer, dry, and store it properly. Eat three *cùn* (寸) portions in the morning, noon, and evening, always before meals.\n\n[Illegible]—refine each thoroughly and take after meals. Use sparingly.\n\nFor young men, use sparingly and clarify the essence. Mix with the blood of a male deer to form pills the size of sour jujubes. Take after meals to treat [illegible].\n\n[Illegible]—[illegible] *dòu* (斗) of [illegible], refine half a *dòu*, and take [illegible] *shēng* (升) of male deer tallow.\n\n**Strengthening Vitality:**\nStrengthening vitality: [illegible]—whether itching or not, use [illegible].\n\n**Blackening the Hair:**\nTo blacken the hair and augment qi, take [illegible] and refine it thoroughly. Place it in a container, then layer it again, and eat it. Keep the fire burning continuously for thirty days. Refine it, wrap it in [illegible], and use it as medicine in the eighth month.\n\n**Making *Lì* (醴):**\nTo make *lì*, use one *jīn* (斤) of *shígāo* (石膏), [illegible] *bēnběn* (本本), and *niúxī* (牛膝) [illegible]. Collect the juice, refine it thoroughly, and [illegible].\n\n**Augmenting Vitality:**\nTo augment vitality and clear away harmful *qi* from the chest, take the seeds from within *huái jiá* (槐荚), place five in a [illegible container], and if the itching is severe...\n\n**Strengthening Vitality:**\nWhether itching or not, **augment it**—until the body feels as if itching or not itching. [illegible].\n\n**Augmenting Longevity:**\nThere is a grain called *Tàishì* (泰室) or *Shàoshì* (少室), within which there is a stone named *pián shí* (骈石). Take the smaller one and [illegible]—it benefits longevity and treats [illegible] ailments.\n\n**Method:**\nTake the flesh of a horse that has been executed, and [illegible]. Use *sān wū* (三乌) one *shēng* (升), soaking it in refined wine. Remove its dregs, then mix [illegible] *yú* (舆), *chōng* (虋) each [illegible], *bì xī* (萆薢), and *niúxī* (牛膝) five *jīn* (斤) each, *huái jiá* (槐荚), *jiégēng* (桔梗), and *hòu huā* (厚花) two *chǐ* (尺), and *sān wū* (三乌) ten kernels. Combine all and soak in four *dòu* (斗) of refined wine, **do not remove its dregs**. When the wine is fully absorbed, wrap it in a leather pouch (*wéi tuó* 韦橐). Take a portion the size of three fingers as a post-meal supplement. After taking it for six months, one will be invigorated, and longevity will be augmented.\n\n**Another Method:**\nCombine *yúnmǔ* (云母) and melt *sōng zhī* (松脂), then roll them into pills with *mài qū* (麦曲). **Do not handle with bare hands**, making them as large as sour jujube. Swallow one pill daily, increasing by one each day until the tenth day. Then decrease by one each day until the tenth day again, **adjusting as needed**—this will make one’s lifespan **unendingly long**.\n\n**Making *Lì* (醴) for the Midsection:**\nTo make *lì* for the midsection: take the stem of *qī* (漆) and [illegible], refining them in various ways. Collect four and a half *dòu* (斗) of its clear juice, and [illegible]—ferment it as if making regular *lì*. Take eight *wū huì* (乌喙) kernels, and [illegible]—collect the juice from *qī* (漆) and *jié* (节), and add it to the fermenting mixture. Seal the jar tightly, allowing it to mature fully, then use *píng* (平) [illegible] to [illegible].\n\n**One Method:**\nUse nine *dòu* (斗) of wine. First, [illegible]—take two *shēng* (升) of it after ten days, and [illegible]—extract the [illegible] from the vessel. After taking it for a hundred days, the intestines will be free of disease.\n\n**Another Method:**\nTo make *láo* (醪), finely chop *qī* (漆) and *jié* (节) one *dòu* (斗) each, and soak them in five *shāng* (斛) of water. Use the juice to cook *zǐ wēi* (紫威) [illegible]. Then soak *qū* (曲) and *mài qū* (麦曲) one *dòu* (斗) each, and [illegible]. When the time is right, soak *shǔ* (黍) and *dào* (稻) [illegible] one *dòu* (斗) each, and combine them. Use the *qū* (曲) juice to moisten them, as if making regular rice gruel. Take three *wū huì* (乌喙) kernels, five pieces of dried ginger, and five of *jiāo* (焦) [illegible], and add them to the mixture. First place the [illegible] in a jar, then ferment the *shǔ* (黍) above it. Evenly moisten it with the juice, and again pour ten *dòu* (斗) of fine wine over it, **do not stir**, and [illegible]—coat it. After eleven days, it will be fully matured. Open it, **do not filter**, and gradually consume the clear juice. Again pour [illegible] wine over it, repeating this process three times. Use it as a porridge or drink one cup. After drinking, if the body itches, rub it. Take it for a hundred days, and one’s eyesight and hearing will improve, one’s strength will be fully restored, and **all ailments, including hemiplegia**, will be treated.\n\n**Treating [illegible]:**\nTake *fáng* (蠃) four *dòu* (斗), and soak it in vinegar for two days. Remove the *fáng* (蠃), and use its juice to soak [illegible] meat or *zhuàng zhū hū* (撞者) [illegible], such as *quǎn hū* (犬脯) [illegible]. Again soak it in the juice, and [illegible]. Eating one inch of the dried meat is equivalent to one person’s strength; ten inches is equivalent to ten people’s strength.\n\n**Breaking the Horns:**\n[Illegible]—roast *mò* (螑), and [illegible].\n\nWrap its ashes in a [illegible] and place them in a cow’s horn, and this can collapse the horn and break the horns.\n\n**Strengthening Vitality (Qi):**\nTake *bù lián* (非廉), *fāng kuí* (方葵), *shí wéi* (石韦), *jié gěng* (桔梗), and *zǐ wēi* (紫威) each in a small bundle, and three *wū chuǐ* (乌喙), along with [illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible] five inches in length. Take a *bái yuán shé* (白螣蛇) or *cāng gěng shé* (苍梗蛇) three to four inches long, or [illegible]—[illegible]—[illegible]—[illegible]—[illegible], each roasted and refined. Combine them into pills the size of dates, each as large as a sheep’s dung pellet. Take one every fifty *lǐ* (里).\n\nWhen *yīn jūn* (阴菌) emerges from *luò* (雒) [illegible], it is seven hundred [in number].\n\nOne method: Take five *wū chuǐ* (乌喙), three *lóng kuí* (龙葵), and one each of *shí wéi* (石韦), *fáng fēng* (防风), and *fú tú* (伏菟). Dry them in the shade, and [illegible]. Treat these five substances, steep them in wine for one day and one night, filter out the dregs, and soak glutinous rice in the juice. Eat it as if taking a meal. Dry the residue, dry it again, and collect the juice to form the medicine.\n\nOne method: Take two *wū chuǐ* (乌喙) and one *běi nán chén yáng* (北南陈阳) [illegible] bone, refine them, and wrap them together in fine white silk three times.\n\n**Cow Tallow (Mā Gāo) Method:**\nTake the tallow from a fat cow, and [illegible]. Boil *wǎ tái* (瓦苔) [illegible] as long as a middle finger. Place it in the [illegible] juice, remove the *wǎ tái* (瓦苔), and store it in a pouch. Each day, discard and bury the dregs. Then proceed: soak [illegible], and drink one cup of eastern flowing water. Place [illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible] twice to remove [illegible]. Expose it to sunlight before drinking.\n\nOne method: [Illegible]—[illegible]—[illegible] three *zú* (卒) [illegible], and half a *wū chuǐ* (乌喙), refine them, and [illegible].\n\n**For the Swift Walker:**\nTake a woman who has never experienced a man’s touch, refine *xiàn guǐ* (县枲) [illegible], and carry it in her bosom. When she sees a whirlwind, she should throw it in. When the wind stops, she should immediately tie it around her waist. The swift walker should refine and carry the belt of a cow-drawn carriage. To walk swiftly, bind it once.\n\n**For the Walker Who Wishes to Avoid Foot Pain:**\nFace south, take three steps in the *Yǔ bù* (禹步), and say: *\"What water does not boil, what path does not wither? Let the Dao/Way nourish my vitality!\"* Then take *tū mò* (突墨) [illegible]—[illegible]—[illegible]—[illegible] and place it in one’s shoes.\n\n**The Dao/Way of Vitality (Qi):**\nThe Dao/Way permeates all under heaven, and where there is Dao/Way, life emerges; where there is no Dao/Way, death ensues. This is the great virtue/power of the Dao/Way. When anger does not manifest greatly, the skin is not affected; when it is great but not firm, the sinews are not affected; when it is firm but not heated, the *qi* is not affected. If the skin is not affected but one acts, it will be excessive; if the sinews are not affected but one acts, it will be evasive; if the *qi* is not affected but one acts, it will be sluggish. Therefore, the sage must regulate these.\n\n**The Dialogue of the Dao/Way:**\nThe Dao/Way was seen on a favorable day in the third month within the [illegible]. The Great Yu transformed, his appearance vigorous and handsome, as if newly matured. When *Rù É* (娥) saw him, she [illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—\n\nShào É responded and said: \"The joys of women are marked by **illegible**—**illegible**—[as] **幼疾** (yòují, youthful ailments), where **良氣** (liángqì, true *qi*) surges forward and recedes violently, lacking moderation.\n\nYǔ said: \"Well spoken!\"\n\n[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—\n\nNow, my **血氣** (xuèqì, blood-*qi*) has already been **外揖** (wàiyè, [illegible])—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "马王堆简帛 十问 合阴阳 天下至道谈 胎产书 杂禁方 养生方 却谷食气 导引图 十问 黄帝问于天师曰：「万物何得而行？ 草木何得而长？ 日月何得而明？ 」天师曰：「尔察天地之情，阴阳为正，万物失之而不继，得之而赢。 食阴拟阳，稽于神明。 食阴之道，虚而五藏，广而三咎，若弗能出朴。 食之贵静而神风，距而两峙，参筑而毋遂，神风乃生，五声乃对。 吸毋过五，致之口，枚之心，四辅所贵，玄尊乃至。 饮毋过五，口必甘味，至之五藏，形乃极退。 搏而肌肤，及夫发末，毛脉乃遂，阴水乃至，溅彼阳勃，坚蹇不死，饮食宾体，此谓复奇之方，通于神明。 」天师之食神气之道。 黄帝问于大成曰：「民何失而颜色鹿黎，黑而苍？ 民何得而腠理靡曼，鲜白有光？ 」大成答曰：「君欲练色鲜白，则察观尺蠖。 尺蠖之食方，通于阴阳，食苍则苍，食黄则黄。 唯君所食，以变五色。 君必食阴以为常，助以柏实盛良，饮走兽泉英，可以老复壮，曼泽有光。 接阴将众，继以蜚虫，春爵雀员子，兴彼鸣雄，鸣雄有精，诚能服此，玉策复生。 太上艺遇，壅彼玉窦，盛乃从之，员子送之； 若不埶遇，置之以。 诚能服此，可以起死。",
      "translated_text": "**\"The Mawangdui Silk Manuscripts: *Ten Questions*, *On Harmonizing Yin-Yang*, *The Dao of the World’s Ultimate Way*, *On Conception and Birth*, *Miscellaneous Prohibitions*, *Nourishment Prescriptions*, *Refraining from Grains and Eating Qi*, *Guiding and Pulling [Exercises]*, *Ten Questions*\"\n\n---\n\n**Yellow Emperor asked the Celestial Master:**\n*\"How do all things come to move?\nHow do grasses and trees come to grow?\nHow do the sun and moon come to shine?\"*\n\n**The Celestial Master replied:**\n*\"Observe the nature of Heaven and Earth—\nYin and Yang are the norm.\nWhen all things lose them, they fail to endure;\nwhen they attain them, they flourish.\nTo eat Yin and emulate Yang,\nconsult the divine and the luminous.\n\nThe Way of eating Yin:\nEmpty the five viscera,\nexpand the three faults,\nyet do not abandon the uncarved.\nIts worth lies in stillness and the spirit-wind,\nstanding apart yet aligned—\nthreefold construction without completion,\nthen the spirit-wind arises, and the five sounds respond.\n\nInhale no more than five [breaths],\ndirect it to the mouth,\ncount it in the heart—\nthe four assistants are precious,\nand the Mysterious Vessel reaches its peak.\n\nDrink no more than five [mouthfuls],\nensure the taste is sweet,\nlet it reach the five viscera,\nthen the form will retreat to its utmost.\n\nStrike the flesh and skin,\ndown to the hair’s ends—\nthe vessels and pores will follow,\nYin-water will arrive,\nsplashing against the erect Yang,\nfirm and unyielding, never dying.\nNourishment as guest to the body—\nthis is called the *Restoration of the Marvelous*,\ncommuning with the divine.\"*\n\n---\n**The Celestial Master’s Way of Eating Spirit-Qi.**\n\n**Yellow Emperor asked Da Cheng:**\n*\"Why do people lose their complexion, turning ashen and sallow?\nHow do they attain smooth pores and radiant, luminous whiteness?\"*\n\n**Da Cheng answered:**\n*\"If you wish to refine your complexion to luminous whiteness,\nobserve the *cuivert* [尺蠖].\nThe *cuivert*’s diet harmonizes Yin-Yang—\neat blue, and it turns blue;\neat yellow, and it turns yellow.\nYour own complexion will shift with the five colors you consume.\n\nIf you eat Yin as your constant,\nsupplement with *Zhì* [柏] fruit—rich and pure,\ndrink the essence of the *walking-beast spring*,\nyou may reverse aging, restore vigor,\nand achieve a smooth, luminous glow.\n\nGather Yin in abundance,\nfollow with *flying insects*,\nspring *jué* [爵] birds and *yuánzǐ* [员子],\nawaken the *míngxióng* [鸣雄].\nThe *míngxióng* is potent—\nif you truly ingest this,\nthe *yùzhé* [玉策] will regenerate.\n\nThe Supreme Art arrives—\nblock the *yùdòu* [玉窦],\nfill it, then send it forth;\n*yuánzǐ* conveys it.\nIf the encounter is not firm,\nplace it in *mì* [].\nIf you truly ingest this,\nyou may even raise the dead.\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 470,
      "start_sentence": 0,
      "end_sentence": 30,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 8.55540943145752,
      "metadata": {
        "source_file": "dao\\藏外\\马王堆帛书十问.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "」大成之起死食鸟精之道。 黄帝问于曹熬曰：「民何失而死？ 何得而生？ 」曹熬答曰：「□□□□□而取其精。 待彼合气，而微动其形。 能动其形，以致五声，乃入其精，虚者可使充盈，壮者可使久荣，老者可使长生。 长生之稽，侦用玉闭，玉闭时辟，神明来积。 积必见章，玉闭坚精，必使玉泉毋倾，则百疾弗婴，故能长生。 接阴之道，必心塞葆。 形气相葆，故曰：壹至勿泻，耳目聪明； 再至勿泻，音气高扬； 三至勿泻，皮革有光； 四至勿泻，脊胠不伤； 五至勿泻，尻髀能壮； 六至勿泻，百脉通行； 七至勿泻，终身失殃； 八至勿泻，可以寿长； 九至勿泻，通于神明。 」曹熬之接阴治神气之道。 黄帝问于容成曰：「民始敷淳溜刑，何得而生？ 溜刑成体，何失而死？ 何泄之人也，有恶有好，有夭有寿？ 欲闻民气赢屈弛张之故。 」容成答曰：「君若欲寿，则顺察天地之道。 天气月尽月盈，故能长生。 地气岁有寒暑，险易相取，故地久而不腐。 君必察天地之情，而行之以身。 有征可知，间虽圣人，非其所能，唯道者知之。 天地之至精，生于无征，长于无形，成于无体，得者寿长，失者夭死。 故善治气抟精者，以无征为积，精神泉溢，吸甘露以为积，饮瑶泉灵尊以为经，去恶好俗，神乃溜刑。 吸气之道，必致之末，精生而不厥。 上下皆精，寒温安生？ 息必深而久，新气易守。 宿气为老，新气为寿。 善治气者，使宿气夜散，新气朝最，以彻九窍，而实六府。 食气有禁，春避浊阳，夏避汤风，秋避霜雾，冬避凌阴，必去四咎，乃深息以为寿。 朝息之志，其出也务合于天，其入也揆彼闺满，如藏于渊，则陈气日尽，而新气日盈，则形有云光。 以精为充，故能久长。 昼息之志，呼吸必微，耳目聪明，阴阴喜气，中不溃腐，故身无苛殃。 暮息之志，深息长除，使耳勿闻，且以安寝。 魂魄安形，故能长生。 夜半之息也，觉寤毋变寝形，深徐去势，六府皆发，以长为极。 将欲寿神，必以腠理息。 治气之精，出死入生，欢欣美谷，以此充形，此谓抟精。 治气有经，务在积精，精盈必泻，精出必补。 补泻之时，于为之。 出入，以修美浬，白内成，何病之有？ 彼生有殃，必其阴精漏泄，百脉菀废，喜怒不时，不明大道，生气去之。 俗人芒生，乃恃巫医，行年桼十，形必夭埋，颂事自杀，亦伤悲哉。 死生安在，彻士制之，实下闭精，气不漏泄。 心制死生，孰为之败？ 慎守勿失，长生累世。 累世安乐长寿，长寿生于蓄积。 彼生之多，上察于天，下播于地，能者必神，故能形解。 明大道者，其行陵云，上自榣，水流能远，龙登能高，疾不力倦，□□□□□□□巫成□□不死。 巫成以四时为辅，天地为经，巫成与阴阳皆生。 阴阳不死，巫成与相视，有道之士亦如此。 」酒食五味，以志治气。 目明耳聪，皮革有光，百脉充盈，阴乃盈生，繇使则可以久交，可以远行，故能寿长。 尧问于舜曰：「天下孰最贵？ 」舜曰：「生最贵。 」尧曰：「治生奈何？ 」舜曰：「审夫阴阳。 」尧曰：「人有九窍十二节，皆设而居，何故而阴与人俱生而先身去？ 」舜曰：「饮食弗以，谋虑弗使，讳其名而匿其体，其使甚多而无宽礼，故与身俱生而先身死。",
      "translated_text": "「The Dao of the Supreme Art’s *resuscitation through bird-essence nourishment* begins. The Yellow Emperor asked Cao Nao, *\"Why do people die? Why do they live?\"*\nCao Nao replied, *\"Gather the bird’s essence while its life is still manifest. Wait for its *qi* to harmonize, then subtly stimulate its form. If you can stimulate its form, you may summon the five sounds, then enter its essence. The empty may be filled with vitality, the strong may endure in splendor, the aged may live forever. The method of eternal life lies in the *yùbì* [玉闭], when the *yùbì* is sealed, its *shénmíng* [神明] gathers. When the gathering is evident, the *yùbì* preserves its essence, ensuring the *yùquán* [玉泉] does not collapse, so that no hundred ailments afflict you—thus, eternal life is achieved. The method of gathering Yin must be done with a resolute heart. When form and *qi* are mutually preserved, it is said:\n\n*'One arrival—do not disperse, and the senses sharpen;\nTwo arrivals—do not disperse, and vitality ascends;\nThree arrivals—do not disperse, and the skin glows;\nFour arrivals—do not disperse, and the spine and marrow remain unharmed;\nFive arrivals—do not disperse, and the buttocks and hips grow strong;\nSix arrivals—do not disperse, and the hundred vessels flow freely;\nSeven arrivals—do not disperse, and misfortune departs for life;\nEight arrivals—do not disperse, and longevity extends;\nNine arrivals—do not disperse, and one attains *shénmíng* [神明].'*\n\nThis is Cao Nao’s method of gathering Yin to regulate *shénqì* [神气].\n\nThe Yellow Emperor then asked Rong Cheng, *\"When the people first practice *chúnliú* [淳溜] and *xíng* [刑], why do they live? When their *xíng* [刑] is complete, why do they die? Why do some live long while others perish young? Why do some have ill fortune while others thrive? I wish to hear the reason for the people’s *qì* [气] being either relaxed or taut.\"*\n\nRong Cheng answered, *\"If you wish for longevity, then observe the Dao of Heaven and Earth. Heaven’s *qi* waxes and wanes with the moon, so it endures forever. Earth’s *qi* has seasons of cold and heat, risk and ease, so Earth persists without decay. You must discern the nature of Heaven and Earth, then embody it in your own practice. There are signs to be known—even sages cannot fathom them without the Dao. The utmost essence of Heaven and Earth is born without signs, grows without form, and matures without substance. Those who grasp it live long; those who lose it die young. Thus, the adept in *qì* [气] cultivation and essence gathering must take ‘no signs’ as their accumulation. When *shénqì* [神气] overflows like a spring, they absorb *gānlù* [甘露] to store it, drink *yáoquán* [瑶泉] and *língzūn* [灵尊] to nourish their constitution, and abandon vice and excess, so their *shén* [神] may *chúnliú* [淳溜] and *xíng* [刑] naturally. The method of absorbing *qi* must be directed to the extremities, ensuring the essence is generated without collapse. Both upper and lower bodies are filled with essence—cold and warmth harmonized, life thrives naturally. Breathing must be deep and prolonged; fresh *qi* is easier to retain. Stale *qi* brings aging; fresh *qi* brings life. The adept in *qì* cultivation scatters stale *qi* at night, replenishes fresh *qi* at dawn, thus purifying the nine orifices and filling the six *fǔ* [府]. There are restrictions on nourishing *qi*: in spring, avoid turbid Yang; in summer, avoid scorching winds; in autumn, avoid frost and mist; in winter, avoid piercing Yin. Eliminate the four flaws, then practice deep breathing for longevity. The intent of morning breathing must align with Heaven—when exhaling, measure by the *guīmǎn* [闺满], as if storing in an abyss, so that old *qi* is daily exhausted while new *qi* is daily replenished, giving the body a radiant glow. When essence is abundant, one endures forever. The intent of midday breathing must be gentle—ears and eyes remain sharp, and Yin-Yin [阴阴] delights in the *qi*, preventing internal decay, so the body suffers no harm. The intent of evening breathing must be deep and sustained—keep the ears from hearing, and rest peacefully. When the soul and body are at ease, eternal life is achieved. At midnight, breathing must be slow and measured—do not alter your sleep posture, withdraw gently, and let the six *fǔ* [府] open fully, reaching the utmost limit of relaxation. To nourish the spirit for longevity, one must breathe through the pores. The essence of *qì* cultivation brings life from death and death from life. Delight in fine grains and this will fill your form—this is called *shénqì* [抟精]. There are principles in *qì* cultivation: focus on gathering essence. When essence is full, it must be dispersed; when essence is dispersed, it must be replenished. The timing of replenishment and dispersion is done at the *kuī* [窍]. Outflow and inflow must refine the *méi* [美], and when the *bái* [白] is externalized and the *chéng* [成] is internalized, what illness remains? For those born with misfortune, their Yin essence leaks away, the hundred vessels stagnate, their emotions are untimed, and they fail to grasp the Great Dao—thus, their vital *qi* departs. Common folk are born with flaws, relying on *wūyī* [巫医], yet even if they live past ten years, their forms will wither early. They praise life while hastening their own demise—how tragic! Death and life depend on the practitioner’s mastery. Seal the lower orifices to retain essence, and *qi* will not leak away. The heart governs life and death—who can undermine it? Guard diligently without loss, and eternal life spans generations. Generational longevity and ease come from accumulation. The abundance of life depends on observing Heaven above and Earth below—those who excel become divine, thus their forms dissolve. Those who understand the Great Dao move like clouds, ascending from the *shāngshān* [山], water flows far, dragons ascend high, fatigue does not weary them—*□□□□□□□* [巫成] *□□* [□□] does not die. *Wūchéng* [巫成] relies on the four seasons as assistants, Heaven and Earth as the *jīng* [经], and *Wūchéng* [巫成] and Yin-Yang as the sources of life. Yin-Yang does not die, and *Wūchéng* [巫成] and Yin-Yang regard each other mutually—those who follow the Dao are thus as well.\"*\n\n*\"Alcohol and five flavors, when used to regulate *qì*, sharpen the eyes and ears, make the skin luminous, fill the hundred vessels, and let Yin essence flourish. Thus, one may engage in prolonged intimacy and distant travel, achieving lasting longevity.\"*\n\nEmperor Yao asked Shun, *\"What is most precious in the world?\"*\nShun replied, *\"Life is most precious.\"*\nYao said, *\"How should one govern life?\"*\nShun replied, *\"Discern the balance of Yin-Yang.\"*\nYao asked, *\"The body has nine orifices and twelve nodes, all established and dwelling within—why does Yin essence arise with the body yet depart before it?\"*\nShun replied, *\"Because they do not moderate their eating and drinking, and they do not restrain their scheming thoughts. They conceal its name and obscure its form, yet its demands are excessive without any respite—thus, it arises with the body yet departs before it.\"*",
      "overlap_context": "*,\nyou may reverse aging, restore vigor,\nand achieve a smooth, luminous glow.\n\nGather Yin in abundance,\nfollow with *flying insects*,\nspring *jué* [爵] birds and *yuánzǐ* [员子],\nawaken the *míngxióng* [鸣雄].\nThe *míngxióng* is potent—\nif you truly ingest this,\nthe *yùzhé* [玉策] will regenerate.\n\nThe Supreme Art arrives—\nblock the *yùdòu* [玉窦],\nfill it, then send it forth;\n*yuánzǐ* conveys it.\nIf the encounter is not firm,\nplace it in *mì* [].\nIf you truly ingest this,\nyou may even raise the dead.\"*",
      "start_char": 470,
      "end_char": 1696,
      "start_sentence": 31,
      "end_sentence": 95,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 22.2673499584198,
      "metadata": {
        "source_file": "dao\\藏外\\马王堆帛书十问.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "」尧曰：「治之奈何？ 」舜曰：「必爱而喜之，教而谋之，饮而食之，使其题坚强而缓事之，必盬之而勿予，必乐矣而勿泻，材将积，气将畜，行年百岁，贤于往者。 」舜之接阴治气之道。 王子乔父问彭祖曰：「人气何是为精乎？ 」彭祖答曰：「人气莫如朘精。 朘气菀闭，百脉生疾； 朘气不成，不能繁生，故寿尽在朘。 朘之葆爱，兼予成佐，是故道者发明唾手循臂，摩腹从阴从阳。 必先吐陈，乃吸朘气，与朘通息，与朘饮食，饮食完朘，如养赤子。 赤子骄悍数起，慎勿。 繇使则可以久交，可以远行，故能寿长。 出入，以修美理，固薄内成，何病之有？ 彼生有殃，必其阴精漏泄，百脉菀废，喜怒不时，不明大道，生气去之。 俗人芒性，乃恃巫医，行年七十，形必夭埋，容事自杀，亦伤悲哉。 死生安在，彻士制之，实下闭精，气不漏泄。 心制死生，孰为之败？ 慎守勿失，长生累世。 累世安乐长寿，长寿生于蓄积。 彼生之多，上察于天，下播于地，能者必神，故能形解。 明大道者，其行陵云，上自群瑶，水流能远，龙登能高，疾不力倦，□□□□□□□务成昭□□不死。 务成昭以四时为辅，天地为经，务成昭与阴阳皆生。 阴阳不死，务成昭与相视，有道之士亦如此。 」 帝盘庚问于耇老曰：「闻子接阴以为强，吸天之精，以为寿长，吾将何处而道可行？ 」耇老答曰：「君必贵夫与身俱生而先身老者，弱者使之强，短者使长，贫者使多粮。 其事壹虚壹实，治之有节：一曰垂肢，直脊，挠尻； 二曰疏股，动阴，缩州，三曰合睫毋听，吸气以充； 四曰含其五味，饮夫泉英； 五曰精皆上，吸其大明。 至五而止，精神日怡。 」耇老接阴食神气之道。 禹问于师癸曰：「明耳目之智，以治天下，上均沉地，下因江水，至会稽之山，处水十年矣。 今四肢不用，家大乱，治之奈何？ 」师癸答曰：「凡治政之纪，必自身始。 血气宜行而不行，此谓殃，六极之宗也。 此气血之续也，筋脉之族也，不可废忘也。 于也施，于味也移，导之以志，动之以事。 非味也，无以充其中而长其节； 非志也，无以知其中虚与实； 非事也，无以动其四肢而移去其疾。",
      "translated_text": "「Emperor Yao asked, *\"How should one govern this (Yin essence)?\"*\nShun replied, *\"One must cherish and delight in it, nurture and scheme for it, drink and eat with it. When engaging in intimacy, one must make it firm and strong yet gentle in its approach. One must absorb it fully without letting it escape, and must keep it in joy without draining it. Thus, its substance will accumulate, its qi will be preserved, and one may live a hundred years, surpassing those of earlier times.\"* This was Shun’s Dao of harmonizing with Yin and regulating qi.\n\nKing Wang Ziqiao’s father asked Pengzu, *\"How does human qi become the most refined essence?\"*\nPengzu answered, *\"Human qi cannot surpass the refining of essence. If one refines qi but it stagnates and closes off, the hundred vessels will breed disease. If one fails to refine qi properly, one cannot flourish in life, and thus longevity depends entirely on this refinement. To preserve and cherish refinement, one must fully integrate it into one’s nourishment and support—this is why those who follow the Dao can clarify their essence with a mere hand’s touch or arm’s stroke, and massage their abdomen, following Yin and Yang. One must first expel the old, then inhale refined qi, breathing in harmony with it, eating and drinking in harmony with it, completing one’s nourishment of refinement as if caring for an infant. Though the infant is capricious and often restless, one must be vigilant. Thus, one may engage in prolonged intimacy and distant travel, achieving lasting longevity. In daily life, one must cultivate beauty and moderation in all things, fortifying the inner essence to perfection—what illness could then take hold? If life brings afflictions, it is because one’s Yin essence leaks away, the hundred vessels stagnate and decay, emotions are untimely, and one does not grasp the Great Dao. Then, the vital essence departs. The vulgar crowd, lacking refinement, rely on sorcerers and physicians, yet by seventy years, their form is already stunted and buried in decay. They hasten their own demise through reckless conduct—how tragic! Death and life are but a matter of mastery. The true adept seals and preserves essence, letting no qi escape. The heart governs life and death—who could then fail? Guard it with care and never lose it, and one may attain longevity across generations. Longevity across generations comes from accumulation and preservation. The abundance of life stems from observing the heavens above and spreading roots below. The capable will surely become divine, thus achieving bodily transcendence. Those who grasp the Great Dao move like clouds, ascending to the highest peaks, their water flowing far, their dragons soaring high—never weary, never exhausted. [They] [endeavor with] [all] [their] [might], achieving radiant clarity, never dying. Radiant clarity relies on the four seasons as its assistants and heaven and earth as its framework, harmonizing with Yin and Yang in their eternal generation. Yin and Yang never die, and radiant clarity watches over them. Those who follow the Dao are likewise.»\n\nEmperor Pan Geng asked the aged sage, *\"I have heard that you harmonize with Yin to grow strong, absorbing the heavens’ essence to achieve lasting longevity. Where should I begin to practice this Dao?\"*\nThe sage replied, *\"A ruler must value that which arises with the body yet grows old before it—strengthening the weak, lengthening the short, enriching the poor with abundant grain. The practice is a balance of emptiness and fullness, governed by moderation: First, let limbs hang naturally, straighten the spine, and bend the hips; Second, loosen the thighs, move the Yin, and contract the waist; Third, close the eyes and ears, inhaling to fill the [vessels]; Fourth, savor the five flavors, drink the pure waters; Fifth, let all essence ascend, inhaling the Great Brightness. Stop at five, and the spirit will daily be at ease.\"* This was the sage’s Dao of harmonizing with Yin and nourishing the spirit.\n\nYu asked Master Shigeng, *\"With the wisdom of ears and eyes, I governed the world, balancing the heavy earth and following the flowing waters until I reached the Mount Kuaiji. There, I dwelt upon the waters for ten years. Now, my limbs are useless, my household is in chaos, and my governance is in disarray—how should I govern this?\"*\nMaster Shigeng answered, *\"All governance begins with oneself. When blood and qi should flow yet do not, this is called the ‘root of calamity,’ the origin of the six extremes. This is the continuation of blood and qi, the lineage of sinews and vessels—it must never be neglected. When the body is exhausted, one must apply nourishment; when the senses are dulled, one must shift tastes. Guide it with intention, move it with purpose. Without nourishment, there is no way to fill the inner and lengthen the lifespan; without intention, there is no way to know the inner balance of emptiness and fullness; without purpose, there is no way to move the four limbs and dispel illness.\"*",
      "overlap_context": " one govern life?\"*\nShun replied, *\"Discern the balance of Yin-Yang.\"*\nYao asked, *\"The body has nine orifices and twelve nodes, all established and dwelling within—why does Yin essence arise with the body yet depart before it?\"*\nShun replied, *\"Because they do not moderate their eating and drinking, and they do not restrain their scheming thoughts. They conceal its name and obscure its form, yet its demands are excessive without any respite—thus, it arises with the body yet departs before it.\"*",
      "start_char": 1696,
      "end_char": 2526,
      "start_sentence": 96,
      "end_sentence": 135,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 12.978214025497437,
      "metadata": {
        "source_file": "dao\\藏外\\马王堆帛书十问.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "故觉寝而引阴，此谓练筋； 既伸又屈，此谓练骨。 动用必当，精故泉出。 行此道也，何世不物忽？ 」禹于是饮湩，酒食五味，以志治气。 目明耳聪，皮革有光，百脉充盈，阴乃盈生。 以安后姚，家乃复宁。 师癸治神气之道。 文挚见齐威王，威王问道焉，曰：「寡人闻子大夫之博于道也，寡人已宗庙之祠，不暇其听，欲闻道之要者，二、三言而止。 」文挚答曰：「臣为道三百编，而最为首。 」威王曰：「子绎之，时食何是有？ 」文挚答曰：「淳酒毒韭。 」威王曰：「子之长韭何邪？ 」文挚答曰：「后稷播耰，草千岁者唯韭，故因而命之。 其受天气也早，其受地气也葆，故聂辟懹怯者，食之恒张； 目不察者，食之恒明； 耳不闻者，食之恒聪；",
      "translated_text": "The **Way** of cultivating the spirit and **qi** is thus:\n\n*\"Awakening from sleep and drawing in the yin*—this is called **refining the sinews**;\n*stretching then bending*—this is called **refining the bones**.\nWhen movement is applied with proper measure, the vital essence flows like a spring.\n\nWho in this world could fail to be transformed by practicing this **Dao/Way**?\"\n\nYú then drank the **湩** (a type of fermented drink), partook of wine and the five flavors,\nand used his **intention** to govern his **qi**.\nHis eyes became clear, his ears sharp—his skin and flesh radiant,\nas the hundred vessels filled and the yin essence flourished.\nThus, his descendants were at peace, and his household returned to order.\n\nMaster Shigeng’s **Dao/Way** of cultivating spirit-**qi**.\n\nWhen **Wén Zhí** (文挚) saw **Qí Wēi Wáng** (齐威王), the king asked him about the **Dao/Way**, saying:\n*\"I have heard that you, Master Zhí, are well-versed in the **Dao/Way**.\nThough I am already attending to ancestral rites, I cannot spare the time to listen at length.\nI wish only to hear its essentials—just a few words.\"*\n\n**Wén Zhí** replied:\n*\"Your servant has expounded the **Dao/Way** in three hundred volumes,\nyet **意** (intention) is its most vital principle.\"*\n\nThe king asked:\n*\"You speak of **意**—how does it relate to eating and drinking?\"*\n\n**Wén Zhí** replied:\n*\"Pure wine and bitter leeks.\"*\n\nThe king asked:\n*\"Why do you praise the long leeks?\"*\n\n**Wén Zhí** replied:\n*\"After **Jiè** (后稷) first cultivated the land, the only grass that thrived for a thousand years was leek.\nThus, it was named accordingly.\nIt absorbs the **天气** (heavenly **qi**) early\nand retains the **地气** (earthly **qi**) well,\nso those who are **懹怯** (timid and fearful) grow bold when eating it;\nthose whose eyes fail to discern grow clear when eating it;\nthose whose ears fail to hear grow sharp when eating it.\"*",
      "overlap_context": "is the continuation of blood and qi, the lineage of sinews and vessels—it must never be neglected. When the body is exhausted, one must apply nourishment; when the senses are dulled, one must shift tastes. Guide it with intention, move it with purpose. Without nourishment, there is no way to fill the inner and lengthen the lifespan; without intention, there is no way to know the inner balance of emptiness and fullness; without purpose, there is no way to move the four limbs and dispel illness.\"*",
      "start_char": 2526,
      "end_char": 2816,
      "start_sentence": 136,
      "end_sentence": 152,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 6.223486423492432,
      "metadata": {
        "source_file": "dao\\藏外\\马王堆帛书十问.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "春三月食之，苛疾不昌，筋骨益强，此谓百草之王。 」威王曰：「善。 子之长酒何邪？ 」文挚答曰：「酒者，五谷之精气也，其入中散流，其入理也彻而周，不胥而究理，故以为百药由。 」威王曰：「善。 然有不如子言者，夫春沃泻入入以韭者，何其不与酒而恒与卵邪？ 」文挚答曰：「亦可。 夫者，阳兽也，发明声聪，伸头羽张者也。 复阴三月，与韭俱彻，故道者食之。 」威王曰：「善。 子之长何邪？ 」文挚答曰：「夫，非徒生民之事也。 举凫雁、鹄、鹔相、蚖蟺、鱼蟞、蠕动之徒，胥食而生者也； 食者，胥而成者也。 夫，使食靡消，散药以流刑者也。 譬于食，如火于金。 故一夕不，百日不复。 食不化，必如纯鞠，是生甘心密墨，危伤痹蹶，故道者敬。 」威王曰：「善。 寡人恒善暮饮而连于夜，苟无苛乎？ 」文挚答曰：「无妨也。 譬如鸟兽，早早起，暮暮起，天者受明，地者受晦，道者究其事而止。 夫食气潜入而默移，夜半而□□□□□气，致之六极。 六极坚精，是以内实外平，痤弗处，痈噎不生，此道之至也。 」威王曰：「善。 」",
      "translated_text": "The king said:\n*\"In the spring, eating it [the leek] for three months—\nno minor ailments will flourish,\nand tendons and bones grow stronger.\nThis is called the sovereign of all grasses.\"*\n\nThe king asked:\n*\"Excellent. Why do you praise wine?\"*\n\n**Wén Zhí** replied:\n*\"Wine is the refined **qi** of the five grains.\nWhen it enters, it disperses and flows through the body,\npenetrating the meridians and reaching every passage\nwithout lingering in the **意** (intention) but fulfilling its purpose.\nThus, it is the foundation for all medicines.\"*\n\nThe king asked:\n*\"Excellent. But there are things contrary to your words—\nwhy do those who suffer from spring diarrhea,\nwhen eating leeks, not drink wine but instead eat eggs?\"*\n\n**Wén Zhí** replied:\n*\"That is also acceptable.\nThe chicken is a yang beast—\nit sharpens vision, clarifies hearing,\nand stretches its head while flaring its feathers.\nIn the three months of yin, it harmonizes with leeks,\nso those who follow the **Dao/Way** eat it.\"*\n\nThe king asked:\n*\"Excellent. Why do you praise **意** (intention)?\"*\n\n**Wén Zhí** replied:\n*\"**意** (Intention) is not merely for sustaining life.\nDucks, geese, cranes, wildfowl, turtles, fish, and all crawling creatures\nall eat and live.\nBut those who eat must cultivate **意** (intention) to complete their essence.\n**意** (Intention) ensures that food is not wasted,\ndisseminates medicine, and regulates punishment [of excess].\nCompare **意** (intention) to food as fire is to metal—\nwithout it for one night, recovery takes a hundred days.\nIf food is not transformed, it will become like a pure mass,\nbreeding stagnant **qi** and dark toxins,\nleading to danger, injury, and paralysis—\nthus, those who follow the **Dao/Way** revere **意** (intention).\"*\n\nThe king asked:\n*\"Excellent. I often drink late into the night—\nwill this cause harm?\"*\n\n**Wén Zhí** replied:\n*\"It causes no harm.\nConsider birds and beasts—\nthose that eat early rise early,\nthose that eat late rise late.\nHeaven receives the light, earth receives the dark,\nand those who follow the **Dao/Way** exhaust its principles and stop.\nWhen **qi** from food subtly enters and silently transforms,\nby midnight it reaches its full potential,\nconcentrating at the six extremities.\nWhen the six extremities are firm and refined,\nthe body becomes internally solid and externally balanced,\nno rashes or sores take root,\nand no abscesses or obstructions form—\nthis is the ultimate attainment of the **Dao/Way**.\"*\n\nThe king said:\n*\"Excellent.\"*",
      "overlap_context": ".\"*\n\nThe king asked:\n*\"Why do you praise the long leeks?\"*\n\n**Wén Zhí** replied:\n*\"After **Jiè** (后稷) first cultivated the land, the only grass that thrived for a thousand years was leek.\nThus, it was named accordingly.\nIt absorbs the **天气** (heavenly **qi**) early\nand retains the **地气** (earthly **qi**) well,\nso those who are **懹怯** (timid and fearful) grow bold when eating it;\nthose whose eyes fail to discern grow clear when eating it;\nthose whose ears fail to hear grow sharp when eating it.\"*",
      "start_char": 2816,
      "end_char": 3246,
      "start_sentence": 153,
      "end_sentence": 178,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 7.302893400192261,
      "metadata": {
        "source_file": "dao\\藏外\\马王堆帛书十问.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "王期见，秦昭王问道焉，曰：「寡人闻客食阴以为动强，吸气以为精明。 寡人何处而寿可长？ 」王期答曰：「必朝日月而吸其精光，食松柏，饮走兽泉英，可以老复壮，曼泽有光。 夏三月去火，以日爨烹，则神慧而聪明。 接阴之道，以静为强，平心如水，灵露内藏，款以玉策，心毋怵荡，五音进答，孰短孰长，吸其神雾，饮夫天浆，致之五藏，欲其深藏。 龙息以晨，气形乃刚，襄□□□，□□近水，精气凌健久长。 神和内得，魂魄皇□，五藏固薄，玉色重光，寿参日月，为天地英。 」昭王曰：「善。 」 合阴阳 合阴阳",
      "translated_text": "The king **Wáng Qī** arrived, and **Qín Zhào Wáng** asked him about these matters, saying:\n*\"I have heard that consuming **yin** (shadow/cooling) foods enhances vitality, and inhaling **qi** sharpens clarity. Where should I focus to prolong my life?\"*\n\n**Wáng Qī** replied:\n*\"You must align with the sun and moon and absorb their luminous **jing** (essence).\nEat pine and cypress, drink from the springs of swift-running beasts—\nthis can restore youth to old age and prolong vitality with radiance.\n\nIn the summer’s third month, avoid heat,\nusing daily sun-cooked meals—\nthen your spirit will be wise and your senses keen.\n\nFollowing the **Dao/Way** of **yin** (shadow/cooling),\nstrength comes from stillness,\ncalm your heart like water,\nlet the **linglù** (divine dew) dwell within.\nUse slow, measured movements—\nlet your heart not tremble or sway—\nas the five tones approach,\ndiscern which is short, which is long,\nand inhale their **shénwù** (spiritual mists),\ndrink the **tiānjiāng** (heavenly brew).\nConcentrate this within the five **zàng** (viscera),\nso it may sink deep and abide.\n\nBreathe like the **lóng** (dragon) at dawn,\nand your **qi** will become firm and strong.\nSupport [your practice] with [ritual] **xiāng** (incense),\nand dwell near flowing water—\nthen your **jing** and **qi** will remain vigorous and enduring.\n\nWhen the spirit is harmonized within,\nyour **húnpò** (ethereal soul/spirit) will flourish,\nthe five **zàng** (viscera) will be steadfast and resilient,\nyour complexion will regain its luster,\nand your lifespan will rival the sun and moon—\nyou will be the foremost **yīng** (hero) of Heaven and Earth.\"*\n\n**Zhāo Wáng** said:\n*\"Excellent.\"*\n\n**Hé yīn yáng** (Harmonizing **yin** and **yang**)",
      "overlap_context": "ht, earth receives the dark,\nand those who follow the **Dao/Way** exhaust its principles and stop.\nWhen **qi** from food subtly enters and silently transforms,\nby midnight it reaches its full potential,\nconcentrating at the six extremities.\nWhen the six extremities are firm and refined,\nthe body becomes internally solid and externally balanced,\nno rashes or sores take root,\nand no abscesses or obstructions form—\nthis is the ultimate attainment of the **Dao/Way**.\"*\n\nThe king said:\n*\"Excellent.\"*",
      "start_char": 3247,
      "end_char": 3487,
      "start_sentence": 179,
      "end_sentence": 189,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 5.6121649742126465,
      "metadata": {
        "source_file": "dao\\藏外\\马王堆帛书十问.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "凡将合阴阳之方，握手，出腕阳，揗肘房，抵腋旁，上纲，抵领乡，揗拯匡，覆周环，下缺盆，过醴津，陵勃海，上恒山，入玄门，御交筋，上欱精神，乃能久视而与天地侔存。 交筋者，玄门中交脉也，为得操揗之，使体皆乐痒，悦怿以好。 虽欲勿为，作相呴相抱，以恣戏道。 戏道：一曰气上面热，徐呴； 二曰乳坚鼻汗，徐抱； 三曰舌薄而滑，徐屯； 四曰下液股湿，徐操； 五曰嗌干咽唾，徐撼，此谓五欲之征。 征备乃上，上揕而勿内，以致其气。 气至，深内而上撅之，以抒其热，因复下反之，毋使其气歇，而女乃大竭。 然后热十动，接十节，杂十修。 接形已没，遂气宗门，乃观八动，听五音，察十已之征。 十动：始十，次廿、卅、、五十、六十、七十、八十、九十、百，出入而毋泻。 一动毋泻，耳目聪明，再而音声章，三而皮革光，四而脊胁强，五而尻髀壮，六而水道行，七而至坚以强，八而腠理光，九而通神明，十而为身常，此谓十动。 十节：一曰虎游，二曰蝉附，三曰尺蠖，四曰囷角，五曰蝗磔，六曰猿踞，七曰蟾诸，八曰兔骛，九曰蜻蛉，十曰鱼嘬。 十修：一曰上之，二曰下之，三曰左之，四曰右之，五曰疾之，六曰徐之，七曰希之，八曰数之，九曰浅之，十曰深之。 八动：一曰接手，二曰伸肘，三曰直踵，四曰侧钩，五曰上钩，六曰交股，七曰平踊，八曰振动。 夫接手者，欲腹之傅也； 伸肘者，欲上之摩且距也； 直踵者，深不及也； 侧钩者，旁欲摩也； 上钩者，欲下摩也； 交股者，刺太过也； 平踊者，欲浅也； 振动者，欲人久持之也。 瘛息者，内急也； 喘息，至美也； 累哀者，玉策入而痒乃始也； 吙者，盐甘甚也，啮者，身振动，欲人之久也。 昏者，男之精壮； 早者，女之精积。 吾精以养女精，前脉皆动，皮肤气血皆作，故能发闭通塞，中府受输而盈。 十已之征：一已而清出，再已而臭如燔骨，三已而燥，四已而膏，五已而芗，六已而滑，七已而，八已而脂，九已而胶，十已而，已复滑，清复出，是谓大卒。 大卒之征，鼻汗唇白，手足皆作，尻不傅席，起而去，成死为薄。 当此之时，中极气张，精神入藏，乃生神明。 天下至道谈",
      "translated_text": "To harmonize **yin** and **yang**’s **Dao**/Way,\n\nhold the hand, extend the wrist’s **yáng** (阳),\npress the elbow’s **fáng** (房),\nblock the armpit’s **páng** (旁),\nascend the **gāng** (纲),\npress the neck’s **xiàng** (乡),\npress the **zhěng** (拯) and **kuàng** (匡),\ncover the **zhōu huán** (周环),\ndescend to the **quē pén** (缺盆),\npass the **lǐ jīn** (醴津),\ncross the **bó hǎi** (勃海),\nascend **héng shān** (恒山),\nenter the **xián mén** (玄门),\ncontrol the **jiāo jīn** (交筋),\nand elevate the **shénwù** (神雾) to invigorate the spirit—\nthen you may gaze long and abide with Heaven and Earth.\n\nThe **jiāo jīn** (交筋) refers to the **xián mén** (玄门)’s intersecting pulse.\nWhen grasped and pressed, the body thrills with **yáng** (痒),\ndelighted and pleased, as if drawn to its **hǎo** (好).\n\nEven if you wish not to act,\nthe signs appear: sighing, embracing,\nto indulge in the **xìdào** (戏道).\n**Xìdào** (戏道): First, **qi** rises hot above—\nslowly sigh; second, **rǔ** (乳) grows firm, nose sweats—\nslowly embrace; third, the tongue grows thin and slippery—\nslowly **tún** (屯); fourth, **yè** (液) descends, thighs grow damp—\nslowly press; fifth, the throat dries, saliva gathers—\nslowly **huǎn** (撼).\nThis is called the five **yù** (欲)’s signs.\n\nWhen all signs are present, elevate—\nelevate and do not withdraw,\nto gather the **qi**.\n**Qi** arrives, deeply withdraw and elevate it again,\nto release its heat;\nthen return it downward,\ndo not let the **qi** rest,\nor else the **nǚ** (女) will be utterly drained.\n\nThen ten **dòng** (动) arise,\ntouching ten **jié** (节),\nand ten **xiū** (修) intertwine.\nWhen the form is fully engaged,\ndirect the **qi** to the **zōngmén** (宗门),\nthen observe the eight **dòng** (动),\nlisten to the five **yīn** (音),\nand perceive the ten **yǐ** (已)’s signs.\n\nThe ten **dòng** (动):\nFirst **dòng** (动), then twenty, thirty, forty,\nfifty, sixty, seventy, eighty, ninety, a hundred—\n**qi** flows in and out without **xiè** (泻).\nOne **dòng** (动) without **xiè** (泻), ears and eyes grow keen;\ntwo **dòng**, voice and sound become clear;\nthree **dòng**, skin and flesh radiate light;\nfour **dòng**, spine and ribs grow strong;\nfive **dòng**, buttocks and thighs grow robust;\nsix **dòng**, the **shuǐdào** (水道) flows;\nseven **dòng**, firmness and strength arise;\neight **dòng**, pores and **lǐ** (理) shine;\nnine **dòng**, **shénmíng** (神明) becomes lucid;\nten **dòng**, the body remains constant—\nthis is called the ten **dòng** (动).\n\nThe ten **jié** (节):\nFirst, **hǔ yóu** (虎游);\nsecond, **chán fù** (蝉附);\nthird, **chǐ huò** (尺蠖);\nfourth, **gōng jiǎo** (囷角);\nfifth, **yáng zhé** (蝗磔);\nsixth, **yuán jù** (猿踞);\nseventh, **chán zhū** (蟾诸);\neighth, **tù wù** (兔骛);\nninth, **tíng líng** (蜻蛉);\ntenth, **yú zuǐ** (鱼嘬).\n\nThe ten **xiū** (修):\nFirst, **shàng** (上);\nsecond, **xià** (下);\nthird, **zuǒ** (左);\nfourth, **yòu** (右);\nfifth, **jí** (疾);\nsixth, **xú** (徐);\nseventh, **xī** (希);\neighth, **shuò** (数);\nninth, **qiǎn** (浅);\ntenth, **shēn** (深).\n\nThe eight **dòng** (动):\nFirst, **jiē shǒu** (接手)—\nto press the abdomen;\nsecond, **shēn zhǒu** (伸肘)—\nto massage and resist above;\nthird, **zhí zhǒng** (直踵)—\nto press deeply;\nfourth, **cè gōu** (侧钩)—\nto press obliquely;\nfifth, **shàng gōu** (上钩)—\nto press below;\nsixth, **jiāo gǔ** (交股)—\nto pierce too deeply;\nseventh, **píng yìng** (平踊)—\nto press lightly;\neighth, **zhèn dòng** (振动)—\nto urge the partner to hold long.\n\n**Zhènxī** (瘛息) is inward urgency;\n**chuǎnxī** (喘息) is supreme beauty.\n**Lěi’āi** (累哀) is when the **yùyè** (玉策) enters and **yáng** (痒) begins;\n**huì** (吙) is when **yán gān** (盐甘) is intense,\n**niè** (啮) is when the body trembles,\nurging the partner to endure long.\n\n**Hūn** (昏) is when the **nán** (男)’s **jīng** (精) is strong;\n**zǎo** (早) is when the **nǚ** (女)’s **jīng** (精) accumulates.\nI nourish my **jīng** (精) to cultivate the **nǚ**’s **jīng** (精),\nas the **qiánmài** (前脉) pulses,\nskin and flesh, **qi** and blood all respond—\nthus closed and blocked passages open,\nthe **zhōngfǔ** (中府) receives and overflows.\n\nThe ten **yǐ** (已)’s signs:\nFirst **yǐ** (已), **qīng** (清) **lù** (露) emerges;\nsecond **yǐ**, foul odor like **fán gǔ** (燔骨);\nthird **yǐ**, dryness;\nfourth **yǐ**, **gāo** (膏);\nfifth **yǐ**, **xiāng** (芗);\nsixth **yǐ**, slipperiness;\nseventh **yǐ**, **yǒu** (有);\neighth **yǐ**, **zhī** (脂);\nninth **yǐ**, **jiāo** (胶);\ntenth **yǐ**, **yǒu** (有).\n**Yǒu** (有) returns to slipperiness,\n**qīng** (清) **lù** (露) emerges again—\nthis is called **dàzú** (大卒).\n\nThe signs of **dàzú** (大卒):\nNose sweats, lips turn white,\nhands and feet tremble,\nthe buttocks do not touch the bed,\nthey rise and depart—\ndeath is thin.\nAt this time,\n**zhōngjí** (中极) **qi** expands,\n**shénmíng** (神明) returns to the **zàng** (藏),\nand **shénmíng** (神明) is born.\n\nThe **Dao**/Way of Heaven and Earth is the ultimate **Dao**/Way.",
      "overlap_context": "** (incense),\nand dwell near flowing water—\nthen your **jing** and **qi** will remain vigorous and enduring.\n\nWhen the spirit is harmonized within,\nyour **húnpò** (ethereal soul/spirit) will flourish,\nthe five **zàng** (viscera) will be steadfast and resilient,\nyour complexion will regain its luster,\nand your lifespan will rival the sun and moon—\nyou will be the foremost **yīng** (hero) of Heaven and Earth.\"*\n\n**Zhāo Wáng** said:\n*\"Excellent.\"*\n\n**Hé yīn yáng** (Harmonizing **yin** and **yang**)",
      "start_char": 3488,
      "end_char": 4349,
      "start_sentence": 190,
      "end_sentence": 225,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 23.228332996368408,
      "metadata": {
        "source_file": "dao\\藏外\\马王堆帛书十问.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "黄神问于左神曰：「阴阳九窍十二节俱生而独先死，何也？ 」左神曰：「力事弗使，哀乐弗以，饮食弗右，其居甚阴而不见阳，猝而暴用，不待其壮，不忍两热，是故亟伤。 讳其名，匿其体，至多暴事而无礼，是故与身俱生而独先死。 」 怒而而不大者，肌不至也； 大而不坚者，筋不至也； 坚而不热者，气不至也。 肌不至而用则腄，气不至而用则避，三者皆至，此谓三诣。 天下至道谈 如水味淫，如春秋气，往者弗见，不得其功； 来者弗堵，吾飨其馈。 呜呼慎哉，神明之事，在于所闭。 审操玉闭，神明将至。 凡彼治身，务在积精。 精赢必舍，精缺必补，补舍之时，精缺为之。 为之合坐，阙尻鼻口，各当其时，忽往忽来，至精将失，吾奚以止之？ 虚实有常，慎用勿忘，勿困勿穷，筋骨隆强，踵以玉泉，食以芬芳，微出微入，待盈是常，三和气至，坚劲以强。 将欲治之，必审其言，踵以玉闭，可以壹仙。 壹动耳目聪明，再动声音章，三动皮革光，四动脊骨强，五动尻髀壮，六动水道行，七动至坚以强，八动志骄以扬，九动顺彼天英，十动生神明。 气有八益，又有七损。 不能用八益、去七损，则行年而阴气自半也，五十而起居衰，六十而耳目不聪明，七十下枯上脱，阴气不用，灌泣流出。 令之复壮有道，去七损以振其病，用八益以贰其气，是故老者复壮，壮者不衰。 君子居处安乐，饮食恣欲，皮腠曼密，气血充赢，身体轻利。 疾使内，不能道，生病出汗喘息，中烦气乱； 弗能治，生内热； 饮药灼灸以致其气，服饵以辅其外，强用之，不能道，生痤肿睾； 气血充赢，九窍不道，上下不用，生痤疽，故善用八益、去七损，五病者不作。 八益：一曰治气，二曰致沫，三曰知时，四曰畜气，五曰和沫，六曰窃积气，七曰待赢，八曰定倾。 七损：一曰闭，二曰泄，三曰竭，四曰勿，五曰烦，六曰绝，七曰费。 治八益：旦起起坐，直脊，开尻，翕州，抑下之，曰治气； 饮食，垂尻，直脊，翕州，通气焉，曰致沫； 先戏两乐，交欲为之，曰知时。 为而耎脊，翕州，抑下之，曰蓄气； 为而勿亟勿数，出入和治，曰和沫； 出，令人起之，怒释之，曰积气； 几已，内脊，毋动，翕气，抑下之，静身须之，曰待赢； 已而洒之，怒而舍之，曰定倾，此谓八益。 七损：为之而疾痛，曰内闭：为之出汗，曰外泄； 为之不已，曰竭； 臻欲之而不能，曰弗； 为之喘息中乱，曰烦； 弗欲强之，曰绝； 为之臻疾，曰费，此谓七损。 故善用八益，去七损，耳目聪明，身体轻利，阴气益强，延年益寿，居处乐长。 人生而所不学者二，一曰息，二曰食。 非此二者，无非学与服。 故贰生者食也，损生者色也，是以圣人合男女必有则也。 故： 一曰虎流，二曰蝉附，思外，三曰尺蠖，四曰囷角，五曰蝗磔，息内，六曰猿踞，思外，七曰蟾诸，八曰兔骛，九曰蜻蛉，思外，十曰鱼嘬，此谓十势。 一曰致气，二曰定味，三曰治节，四曰劳实，五曰必时，六曰通才，七曰微动，八曰待盈，九曰齐生，十曰息形，此谓十修。 一曰高之，二曰下之，三曰左之，四曰右之，五曰深之，六曰浅之，七曰疾之，八曰徐之，此谓八道。 十修既备，十势豫陈，八道杂□，接形以昏。",
      "translated_text": "The **Yellow God** inquired of the **Left God**, saying: *\"Why do the nine orifices and twelve joints of yin-yang all arise, yet death comes first to one alone?\"*\n\nThe **Left God** replied: *\"Because one does not exert their strength, does not indulge in sorrow or joy, does not favor their diet—dwelling in extreme darkness yet never exposed to light—suddenly and violently using it, without waiting for its fullness, unable to endure the dual heat, thus hastening injury. To conceal its name and obscure its form, to engage in excessive violence without propriety, is why it arises with the body yet dies first alone.\"*\n\nWhen anger comes but is not great, the flesh is not fully engaged;\nwhen great yet not firm, the sinews are not fully engaged;\nwhen firm yet not heated, the **qi** is not fully engaged.\nIf the flesh is not engaged yet used, it becomes **wěi** (腄);\nif the **qi** is not engaged yet used, it becomes **bì** (避).\nWhen all three are engaged, this is called **sān zhì** (三诣).\n\nThe ultimate **Dao**/Way of Heaven and Earth is spoken of thus:\nLike water in taste, like the **qi** of spring and autumn,\nthose who depart are not seen, their merit not attained;\nthose who arrive are not obstructed, I feast upon their offerings.\nAh! Be cautious, for the matter of **shénmíng** (神明) lies in what is closed.\n\nWhen the **jade-like closure** (玉闭) is carefully managed,\n**shénmíng** (神明) will approach.\nIn general, those who cultivate the body\nmust strive to accumulate **jīng** (精).\nWhen **jīng** (精) is abundant, it must be released;\nwhen **jīng** (精) is deficient, it must be supplemented.\nAt the times of supplementation and release,\ndeficiency and abundance must be balanced.\nIf one sits in harmony with it,\nleaving the buttocks, anus, mouth, and nose open,\neach according to its proper time,\nsuddenly departing and arriving,\nwhen the utmost **jīng** (精) is about to be lost,\nhow can I prevent it?\n\nVitality and depletion have their constants;\nbe cautious in its use, forget not,\nneither exhaustion nor excess—\nlet sinews and bones be strong and resilient.\nWith the heels pressing the **jade spring** (玉泉),\nand nourishment from fragrant sustenance,\nentering and exiting subtly,\nawaiting fullness as the norm,\nwhen the three harmonies of **qi** are achieved,\nfirmness and vigor will strengthen.\n\nWhen one seeks to cultivate it,\nthey must first examine their words.\nWith the heels pressing the **jade closure** (玉闭),\none can achieve **unity with the Dao** (壹仙).\n**Unity with the Dao** (壹仙) once attained:\nthe first movement sharpens hearing and sight,\nthe second clarifies voice and speech,\nthe third brightens skin and flesh,\nthe fourth strengthens the spine and bones,\nthe fifth fortifies the buttocks and thighs,\nthe sixth activates the **waterways** (水道),\nthe seventh achieves the utmost firmness and strength,\nthe eighth elevates the will and pride,\nthe ninth aligns with the **Heavenly Vitality** (天英),\nthe tenth generates **shénmíng** (神明).\n\n**Qi** has eight benefits, yet also seven harms.\nIf one cannot harness the eight benefits\nor eliminate the seven harms,\nthen at **forty-nine** (四十九) years, the yin **qi** will be halved,\nat fifty, movement and rest will decline,\nat sixty, hearing and sight will dull,\nat seventy, the lower body withers while the upper detaches,\nand the yin **qi** unused will gush forth in tears.\nThere is a **Dao**/Way to restore vitality:\neliminate the seven harms to dispel illness,\nharness the eight benefits to double the **qi**,\nthus the aged regain their strength,\nand the strong do not decline.\n\nThe **virtuous** (君子) dwell in ease and comfort,\nindulge in food and drink as they please,\ntheir pores soft and dense,\ntheir **qi** and blood abundant and full,\ntheir bodies light and agile.\nIf illness enters inward yet cannot be **channeled** (道),\nthey will sweat, pant, and be troubled by **qi**;\nif it cannot be treated,\ninternal heat will arise;\nif one forces **qi** through medicines, cauterization, or acupuncture,\nand supplements with external tonics,\nyet still cannot **channel** (道) it,\nthey will develop **boils, tumors, or scrotal swelling** (痤肿睾);\nwhen **qi** and blood are abundant yet the nine orifices fail to **channel** (道),\nand the upper and lower body are unused,\n**boils and abscesses** (痤疽) will arise.\nThus, those who skillfully harness the eight benefits\nand eliminate the seven harms\nwill have no five illnesses.\n\nThe eight benefits:\n1. **Regulating qi** (治气),\n2. **Directing saliva** (致沫),\n3. **Knowing the times** (知时),\n4. **Retaining qi** (畜气),\n5. **Harmonizing saliva** (和沫),\n6. **Stealing and accumulating qi** (窃积气),\n7. **Awaiting fullness** (待盈),\n8. **Balancing inclinations** (定倾).\n\nThe seven harms:\n1. **Closure** (闭),\n2. **Depletion** (泄),\n3. **Exhaustion** (竭),\n4. **Neglect** (勿),\n5. **Disturbance** (烦),\n6. **Forced suppression** (绝),\n7. **Waste** (费).\n\nThe cultivation of the eight benefits:\nAt dawn, rise and sit upright,\nstraighten the spine,\nopen the buttocks,\ncontract the **state** (州),\nsuppress the lower regions—this is **regulating qi** (治气);\nafter eating and drinking, lower the buttocks,\nstraighten the spine,\ncontract the **state** (州),\nand **channel** the **qi**—this is **directing saliva** (致沫);\nfirst engage in playful and joyous activities,\nthen intermingle desires—this is **knowing the times** (知时).\nWhen doing so, straighten the spine,\ncontract the **state** (州),\nand suppress the lower regions—this is **retaining qi** (畜气);\nwhen doing so, neither hasten nor repeat,\nbut harmonize and treat the entering and exiting—this is **harmonizing saliva** (和沫);\nwhen **qi** is about to be released,\nlet someone rise and release it,\nthen vent the anger—this is **stealing and accumulating qi** (窃积气);\nwhen **qi** is nearly spent,\ncontract the spine inward,\ndo not move,\ncontract the **qi**,\nsuppress the lower regions,\nand still the body—this is **awaiting fullness** (待盈);\nwhen **qi** is released, scatter it,\nand when angered, release it—this is **balancing inclinations** (定倾).\nThis is the eight benefits.\n\nThe seven harms:\nWhen doing so, if one feels sudden pain—this is **internal closure** (内闭);\nif one sweats—this is **external depletion** (外泄);\nif one does not cease—this is **exhaustion** (竭);\nif one reaches the point of desire yet cannot complete it—this is **neglect** (勿);\nif one pants and is troubled by **qi**—this is **disturbance** (烦);\nif one does not desire yet forces it—this is **forced suppression** (绝);\nif one reaches the point of illness—this is **waste** (费).\nThis is the seven harms.\n\nThus, those who skillfully harness the eight benefits\nand eliminate the seven harms\nwill have keen hearing and sight,\na light and agile body,\nstrengthened yin **qi**,\nprolonged life and vitality,\nand enduring comfort in dwelling.\n\nTwo things in life are not learned by humans:\n1. **Breath** (息),\n2. **Nourishment** (食).\nApart from these two,\nthere is nothing that is not learned through study and practice.\nThus, **nourishment** (食) is the source of life,\nwhile **sexual indulgence** (色) is its detriment—\nthis is why the **sage** unites men and women only with proper restraint.\n\nThus:\n1. **Tiger’s Flow** (虎流),\n2. **Cicada’s Attachment** (蝉附),\nthinking outward,\n3. **Earthworm’s Inch-by-Inch** (尺蠖),\n4. **Antler’s Horn** (囷角),\n5. **Locust’s Severed** (蝗磔),\nthinking inward,\n6. **Monkey’s Squat** (猿踞),\nthinking outward,\n7. **Toad’s Gathering** (蟾诸),\n8. **Hare’s Leap** (兔骛),\n9. **Dragonfly’s Flutter** (蜻蛉),\nthinking outward,\n10. **Fish’s Suck** (鱼嘬).\nThis is called the **Ten Postures** (十势).\n\n1. **Directing qi** (致气),\n2. **Fixing flavor** (定味),\n3. **Treating the joints** (治节),\n4. **Laboring with fullness** (劳实),\n5. **Acting at the proper time** (必时),\n6. **Opening the talent** (通才),\n7. **Subtle movement** (微动),\n8. **Awaiting fullness** (待盈),\n9. **Equalizing vitality** (齐生),\n10. **Stillness of form** (息形).\nThis is called the **Ten Practices** (十修).\n\n1. **Elevating it** (高之),\n2. **Lowering it** (下之),\n3. **Directing it left** (左之),\n4. **Directing it right** (右之),\n5. **Deepening it** (深之),\n6. **Shallowing it** (浅之),\n7. **Hastening it** (疾之),\n8. **Slowing it** (徐之).\nThis is called the **Eight Methods** (八道).\n\nWhen the **Ten Practices** (十修) are complete,\nthe **Ten Postures** (十势) are prepared in advance,\nand the **Eight Methods** (八道) are combined with the **form** (形),\nthen the **form** is managed until **qi** is spent in **dusk** (昏).",
      "overlap_context": "**yǐ**, **jiāo** (胶);\ntenth **yǐ**, **yǒu** (有).\n**Yǒu** (有) returns to slipperiness,\n**qīng** (清) **lù** (露) emerges again—\nthis is called **dàzú** (大卒).\n\nThe signs of **dàzú** (大卒):\nNose sweats, lips turn white,\nhands and feet tremble,\nthe buttocks do not touch the bed,\nthey rise and depart—\ndeath is thin.\nAt this time,\n**zhōngjí** (中极) **qi** expands,\n**shénmíng** (神明) returns to the **zàng** (藏),\nand **shénmíng** (神明) is born.\n\nThe **Dao**/Way of Heaven and Earth is the ultimate **Dao**/Way.",
      "start_char": 4350,
      "end_char": 5608,
      "start_sentence": 226,
      "end_sentence": 277,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 28.996320009231567,
      "metadata": {
        "source_file": "dao\\藏外\\马王堆帛书十问.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "汗不及走，遂气血门，翕咽摇前，通脉利筋。 乃察八动，观气所存，乃智五言，孰后孰先。 八动：一曰接手，二曰伸肘，三曰平踊，四曰直踵，五曰交股，六曰振动，七曰侧钩，八曰上钩。 五音：一曰喉息，二曰喘息，三曰累哀，四曰吙，五曰啮。 审察五音，以知其心； 审察八动，以知其所乐所通。 接手者，欲腹之傅； 伸肘者，欲上之摩且距也； 侧钩者，旁欲摩也； 交股者，刺太过也； 直踵者，深不及； 上钩者，下不及心也； 平踊者，欲浅； 振动者，至善也，此谓八观。 气上面热，徐呴； 乳坚鼻汗，徐抱； 舌薄而滑，徐傅； 下液股湿，徐操； 嗌干咽唾，徐撼，此谓五征，此谓五欲，征备乃上。 怒而不大者，肤不至也； 大而不坚者，筋不至也； 坚而不热者，气不至也； 三至乃入。 壹已清凉出，再已而臭如靡骨，三已而燥，四已而膏，五已而芗，六已而精如黍粱，七已而滞，八已而脂，九已而腻，十已而迄，迄而复滑，朝气乃出。 一曰笄光，二曰封纪，三曰瓠，四曰鼠妇，五曰谷实，六曰麦齿，七曰婴女，八曰反去，九曰何寓，十曰赤，十一曰赤珠九，十二曰石，得之而勿释，成死有薄，走理毛，置腰心，唇尽白，汗流至腘，已数以百。 人人有善者，不失女人，女人有之，善者独能，毋予毋治，毋作毋疑，必徐以久，必微以持，如已不已，女乃大怡。 喉息，下咸吐阴光阳； 喘息，气上相薄，自容张；",
      "translated_text": "「Sweat does not reach the point of streaming, yet the **Way** (道) of **qi** and blood is opened.\nThe throat contracts, and the front is swayed—**pulse pathways** (脉) are unblocked, and **sinews** (筋) are made supple.\n\nThen observe the **Eight Movements** (八动),\nand where the **qi** (氣) resides.\nThen discern the **Five Sounds** (五言),\nwhich follow and which precede.\n**Eight Movements**:\n1. **Clasping the hands** (接手),\n2. **Extending the elbows** (伸肘),\n3. **Flattening the feet** (平踊),\n4. **Straightening the heels** (直踵),\n5. **Crossing the thighs** (交股),\n6. **Shaking and trembling** (振动),\n7. **Lateral hooking** (侧钩),\n8. **Hooking upward** (上钩).\n\n**Five Sounds**:\n1. **Throat gasping** (喉息),\n2. **Panting** (喘息),\n3. **Repeated sorrowful sighs** (累哀),\n4. **Guttural exhalations** (吙),\n5. **Gritting teeth** (啮).\n\nExamine the **Five Sounds** to understand their **mind** (心);\nExamine the **Eight Movements** to know their **delights** (所乐) and **openings** (所通).\n\n**Clasping the hands** (接手) is to **apply** (傅) to the abdomen;\n**Extending the elbows** (伸肘) is to **stroke and press** (摩且距) upward;\n**Lateral hooking** (侧钩) is to **stroke the sides** (旁欲摩);\n**Crossing the thighs** (交股) indicates **piercing** (刺) is excessive;\n**Straightening the heels** (直踵) means **deepening** (深) is insufficient;\n**Hooking upward** (上钩) means **lower** (下) does not reach the **heart** (心);\n**Flattening the feet** (平踊) indicates **shallowing** (浅);\n**Shaking and trembling** (振动) is the **ultimate skill** (至善).\nThis is called the **Eight Observations** (八观).\n\nWhen **qi** rises to the surface and heat appears,\n**slowly exhale** (徐呴).\nWhen the **breasts** (乳) harden and **nose sweat** (鼻汗) forms,\n**slowly embrace** (徐抱).\nWhen the **tongue** (舌) is thin and slippery,\n**slowly apply** (徐傅).\nWhen the **lower fluids** (下液) moisten the **thighs** (股),\n**slowly manipulate** (徐操).\nWhen the **lips** (嗌) are dry and **saliva** (唾) thickens in the throat,\n**slowly agitate** (徐撼).\nThis is called the **Five Manifestations** (五征),\nthis is called the **Five Desires** (五欲).\nWhen all **Manifestations** (征) are complete,\nthe **Way** (道) is ascended.\n\nAnger that does not flare intensely means the **skin** (肤) is not affected;\nAnger that flares but is not firm means the **sinews** (筋) are not reached;\nAnger that is firm but not heated means the **qi** (氣) is not engaged.\nWhen all three are present, **entry** (入) is achieved.\n\nThe first **stage** (已) is **cool and refreshing** (清凉);\nThe second **stage** (已) is foul-smelling like **rotting bones** (靡骨);\nThe third **stage** (已) is **dry** (燥);\nThe fourth **stage** (已) is **greasy** (膏);\nThe fifth **stage** (已) is **fragrant** (芗);\nThe sixth **stage** (已) is **dense and vital** (精) like **millet and wheat** (黍粱);\nThe seventh **stage** (已) is **stagnant** (滞);\nThe eighth **stage** (已) is **oily** (脂);\nThe ninth **stage** (已) is **slimy** (腻);\nThe tenth **stage** (已) is **congealed** (迄),\nthen **slippery again** (复滑),\nand the **morning qi** (朝气) emerges.\n\n1. **Hairpin-like radiance** (笄光),\n2. **Sealing the meridians** (封纪),\n3. **Empty gourd** (瓠),\n4. **Mouse-woman** (鼠妇),\n5. **Grain-flesh** (谷实),\n6. **Barley-teeth** (麦齿),\n7. **Virgin’s flesh** (婴女),\n8. **Returning to the void** (反去),\n9. **Where is it lodged?** (何寓),\n10. **Crimson** (赤),\n11. **Crimson Pearl Nine** (赤珠九),\n12. **Cavity Stone** (石).\nWhen obtained, **do not release** (勿释).\nIf **death** (死) is imminent, **thin the pulse** (走理毛),\n**place at the waist and heart** (置腰心),\nuntil the **lips** (唇) are fully white,\nand **sweat flows to the popliteal fossa** (汗流至腘).\nThe count reaches **hundreds** (百).\n\nEvery person has **talents** (善者),\nbut **women** (女人) are not lost—\n**women** (女人) possess them,\nbut only the **talented** (善者) can **master** (独能).\n**Do not give** (毋予) nor **treat** (毋治),\n**do not act nor doubt** (毋作毋疑).\n**It must be done slowly and sustained** (必徐以久),\n**subtly and persistently** (必微以持).\nIf **already achieved** (如已) yet **not perfected** (不已),\nthen the **woman** (女) will attain **great joy** (大怡).\n\n**Throat gasping** (喉息),\nthe **qi** (氣) descends, and **saliva** (阴) is expelled—\n**radiance** (光) is **yang** (阳), **sweat** (阴) is **yin** (阴);\n**Panting** (喘息),\nthe **qi** (氣) rises and **presses** (相薄),\nand **self-control** (自容) **expands** (张).",
      "overlap_context": " (十修).\n\n1. **Elevating it** (高之),\n2. **Lowering it** (下之),\n3. **Directing it left** (左之),\n4. **Directing it right** (右之),\n5. **Deepening it** (深之),\n6. **Shallowing it** (浅之),\n7. **Hastening it** (疾之),\n8. **Slowing it** (徐之).\nThis is called the **Eight Methods** (八道).\n\nWhen the **Ten Practices** (十修) are complete,\nthe **Ten Postures** (十势) are prepared in advance,\nand the **Eight Methods** (八道) are combined with the **form** (形),\nthen the **form** is managed until **qi** is spent in **dusk** (昏).",
      "start_char": 5608,
      "end_char": 6169,
      "start_sentence": 278,
      "end_sentence": 305,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 18.377222299575806,
      "metadata": {
        "source_file": "dao\\藏外\\马王堆帛书十问.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "累者，尻彼疾而动封纪； 吙者，衔甘甚而痒乃始； 啮者，身振动，置已而久。 是以雄牡属，为阳，阳者外也； 雌牝属，为阴，阴者内也。 凡牡之属摩表，凡牝之属摩里，此谓阴阳之数，牝牡之理，为之弗得，过在数已。 嬲乐之要，务在迟久。 苟能迟久，女乃大喜，亲之弟兄，爱之父母。 凡能此道者，命曰天士。 胎产书 禹问幼频曰：我欲殖人产子，何如而有？ 幼频答曰：月朔已去汁□，三日中从之，有子。 其一日男，其二日女也。 故人之产也，入于冥冥，出于冥冥，乃始为人。 一月名曰流刑，食饮必精，酸羹必熟，毋食辛腥，是谓哉贞。 二月始膏，毋食辛臊，居处必静，男子勿劳，百节皆病，是谓始藏。 三月始脂，果蓏宵效，当是之时，未有定仪，见物而化，是故君公大人，毋使侏儒，不观沐猴，不食姜，不食兔羹； □欲产男，置弧矢，□雄雉，乘牡马，观牡虎； 欲产女，佩簪珥，绅珠子，是谓内象成子。 四月而水授之，乃始成血，其食稻麦，觯鱼□□，以清血而明目。 五月而火授之，乃始成气，晏起□沐，厚衣居堂，朝吸天光，避寒殃，其食稻麦，其羹牛羊，和以茱萸，毋食□，以养气。 六月而金授之，乃始成筋，劳□□□，出游于野，数观走犬马，必食□□也，未□□□，是谓变腠□筋，□□□□。 七月而木授之，乃始成骨，居燥处，毋使定止，□□□□□□□□□□□□，饮食避寒，□□□□□□□□□美齿。 八月而土授之，乃始成肤革，□□□□□□□□，是谓密腠理。 九月而石授之，乃始成毫毛，□□□□□□□□□□□□□□□□□□□□□□□□□□□□伺之。 十月气陈□□，以为。 凡治字者，以清水澣胞。 一曰：必熟洒澣胞，又以洒澣□□□□□□□□小□□□□□□□□□□□□□以瓦瓯，毋令虫蚁能入，而□□□□□□□毋见日所，使婴儿无疕，曼理，寿□。 一曰：埋胞席下，不疕瘙。 内中□□□□以建日饮。 字而多男无女者而欲女，后□□□□胞埋阴垣下。 多女无男，亦取胞埋阳垣下。 一曰：以甗衣约胞，埋之。 怀子者，为烹白牡狗首，令独食之，其子美皙，又易出。 欲令子劲者，□时食母马肉。 怀子未出三月者，吞爵瓮二，其子男也。 一曰：取雀瓮中虫青背者三，生吞之，必产男，万全。 一曰：以方咀时，取蒿、牡、蜱蛸三，冶，饮之，必产男。 已试。 一□曰：遗溺半升，□□坚而少汁。 一曰：取蜂房中子、狗阴，干而冶之，以饮怀子，怀子产男。 一曰：□鲜鱼□□食之。 □□□□□□□□干，冶之，投酒中，□□□怀子者产□□□三月不可以□。 □□□□□□□□令□□□□□□□□□□□□□□产男。 一曰：取乌□□□□男子独食肉歠汁，女子席莞。 欲产女，取乌雌煮，令女子独食肉歠汁，席。 求子之道曰：求九宗之草，而夫妻共以为酒，饮之。 字者，且垂字，先取市土濡清者，□之方三四尺，高三四寸。 子既产，置土上，勿庸□，令婴儿□上，其身尽得土，乃浴之，为劲有力。 字者已，即燔其蓐，置水中，□□婴儿，不疕瘙。 及取婴儿所已浴者水半杯饮母，母亦无余病。 女子鲜子者产，令它人抱其□，以去□□濯其胞，以新布裹之，为三约以敛之，入□中，令其母自操，入溪谷□□□之三，置去，归勿顾；",
      "translated_text": "The **accumulation of ailments** (累疾者) arises when the **anus** (尻) suffers illness and **seals the meridians** (动封纪);\nThe **itching** (吙者) begins when one **holds bitter** (衔甘甚) and **itching** (痒) emerges;\nThe **gnawing** (啮者) causes **body tremors** (身振动), **settling** (置已) yet **persisting** (久).\n\nThus, **male and stallion** (雄牡) belong to **yang** (阳), **yang being external** (阳者外也);\n**Female and mare** (雌牝) belong to **yin** (阴), **yin being internal** (阴者内也).\nAll **male attributes** (牡之属) **rub externally** (摩表),\nAll **female attributes** (牝之属) **rub internally** (摩里).\nThis is called the **principles of yin and yang** (阴阳之数), the **laws of male and female** (牝牡之理).\nIf one **fails to grasp** (弗得) this, the fault lies in **excessive haste** (过在数已).\n\nThe **essence of delight** (嬲乐之要) lies in **slowness and endurance** (务在迟久).\nIf one can **delay and persist** (能迟久), then the **woman attains great joy** (女乃大喜),\n**loved as brothers** (亲之弟兄), **cherished as parents** (爱之父母).\nThose who **master this Dao** (能此道者) are called **Heavenly Worthies** (天士).\n\n---\n**The Classic of Conception** (胎产书):\n**Yu** questioned **Youpin** (幼频) and said:\n*\"I wish to **augment births and children** (殖人产子), how should one proceed to **ensure conception** (有)?\"*\nYoupin replied:\n*\"After the **new moon** (月朔已去), within **three days**, **follow** (从之), and **conception will occur** (有子).\nThe **first day** yields a **son** (男),\nThe **second day** yields a **daughter** (女).\"*\n\nThus, when a person **conceives** (产),\nThey **enter darkness** (入于冥冥) and **emerge from darkness** (出于冥冥) before becoming human (乃始为人).\n\n**The first month** is called **Flowing Punishment** (流刑):\n**Diet must be refined** (食饮必精),\n**Sour broths must be cooked** (酸羹必熟),\n**Avoid spicy and game meats** (毋食辛腥)—\nThis is called **preserving purity** (哉贞).\n\n**The second month** begins **grease formation** (始膏):\n**Avoid spicy and rancid foods** (毋食辛臊),\n**Dwell in quietude** (居处必静),\n**Men must not overwork** (男子勿劳),\nFor **all joints may ail** (百节皆病)—\nThis is called **initial storage** (始藏).\n\n**The third month** begins **fat formation** (始脂):\n**Fruits and vegetables take effect at night** (果蓏宵效),\nAt this time, **no fixed rituals exist** (未有定仪),\n**Forms transform with exposure** (见物而化).\nThus, **rulers and nobles** (君公大人)\n**Must not see dwarves** (毋使侏儒),\n**Must not observe monkeys** (不观沐猴),\n**Must not eat** (不食) **wild ginger** (姜) **or hare stew** (兔羹);\n**To conceive a son**, **place bows and arrows** (置弧矢),\n**Hunt male pheasants** (雄雉),\n**Ride stallions** (乘牡马),\n**Observe male tigers** (观牡虎);\n**To conceive a daughter**, **wear hairpins and earrings** (佩簪珥),\n**Adorn with pearls** (绅珠子)—\nThis is called **internal symbols forming the child** (内象成子).\n\n**The fourth month**, when **water is imparted** (水授之),\n**Blood begins to form** (乃始成血).\n**Rice and wheat** are consumed,\n**Fish is served in a vessel** (觯鱼),\nTo **clarify blood and brighten vision** (以清血而明目).\n\n**The fifth month**, when **fire is imparted** (火授之),\n**Qi begins to form** (乃始成气).\n**Rise late and bathe early** (晏起□沐),\n**Wear thick garments in the hall** (厚衣居堂),\n**Morning exposure to celestial light** (朝吸天光),\n**Avoid cold misfortunes** (避寒殃).\n**Rice and wheat** are eaten,\n**Cow and sheep broths** are prepared,\n**Mixed with tiaojiu** (和以茱萸),\n**Avoid** (毋食) **bitter foods** (□),\nTo **nourish the qi** (以养气).\n\n**The sixth month**, when **metal is imparted** (金授之),\n**Tendons begin to form** (乃始成筋).\n**Labor in moderation** (劳□□□),\n**Roam the wilds** (出游于野),\n**Frequently observe running dogs and horses** (数观走犬马),\n**Must consume** (必食) **sour and bitter** (□□),\n**Though** (未) **rituals are unclear** (□□□□),\nThis is called **transforming the skin and tendons** (变腠□筋),\n**Adjusting the pores and vessels** (□□□□).\n\n**The seventh month**, when **wood is imparted** (木授之),\n**Bones begin to form** (乃始成骨).\n**Dwell in dry places** (居燥处),\n**Do not remain stationary** (毋使定止),\n**...[text fragment unclear]...**\n**Avoid cold in diet** (饮食避寒),\n**...[text fragment unclear]...** to **preserve teeth** (美齿).\n\n**The eighth month**, when **earth is imparted** (土授之),\n**Skin and hide begin to form** (乃始成肤革),\n**...[text fragment unclear]...**\nThis is called **densifying pores and vessels** (密腠理).\n\n**The ninth month**, when **stone is imparted** (石授之),\n**Hair and fur begin to form** (乃始成毫毛),\n**...[text fragment unclear]...**\n**...[text fragment unclear]...** to **observe carefully** (伺之).\n\n**The tenth month**, when **qi stagnates** (气陈),\n**It becomes a **fetus** (以为胎).\n\n---\n**Methods for Childbirth and Postpartum Care:**\n**For those attending births** (凡治字者),\n**Wash the placenta** (澣胞) **with clear water** (以清水).\n\n**Method One:**\n*\"**Thoroughly wash the placenta** (必熟洒澣胞),\nThen **wash** (澣) **...[text fragment unclear]...**\nPlace in a **small earthenware jar** (以瓦瓯),\n**Prevent insects and ants from entering** (毋令虫蚁能入),\n**...[text fragment unclear]...**\n**Keep from sunlight** (毋见日所),\nSo the **infant has no blemishes** (婴儿无疕),\n**Smooth pores** (曼理),\n**Long life** (寿□).\"*\n\n**Method Two:**\n*\"**Bury the placenta beneath the birth mat** (埋胞席下),\n**No blemishes or itching** (不疕瘙).\"*\n\n**Within the placenta** (内中),\n**...[text fragment unclear]...**\n**Drink daily at dawn** (以建日饮).\n\nIf **a woman has many sons but no daughters** (字而多男无女) and **desires a daughter** (而欲女),\n**Later** (后) **...[text fragment unclear]...**\n**Bury the placenta beneath the southern wall** (埋阴垣下).\nIf **a woman has many daughters but no sons** (多女无男),\n**Also take the placenta and bury it beneath the northern wall** (亦取胞埋阳垣下).\n\n**Method Three:**\n*\"**Wrap the placenta in a woven cloth** (以甗衣约胞) and **bury it** (埋之).\"*\n\n**For pregnant women** (怀子者),\n**Boil the head of a white male dog** (为烹白牡狗首),\n**Let her consume it alone** (令独食之),\n**Her child will be fair and flawless** (其子美皙),\n**And birth will be easier** (又易出).\n\n**To make the child strong** (欲令子劲者),\n**...[text fragment unclear]...** **consume mare’s flesh at the right time** (□时食母马肉).\n\n**For those pregnant less than three months** (怀子未出三月者),\n**Swallow two** (吞) **jade jars** (爵瓮),\n**The child will be male** (其子男也).\n\n**Method Four:**\n*\"Take **three green-backed insects from a nest** (雀瓮中虫青背者三),\n**Swallow them raw** (生吞之),\n**Conception will be male** (必产男),\n**Guaranteed** (万全).\"*\n\n**Method Five:**\n*\"At the **right moment** (以方咀时),\nTake **three measures of hemp, male herbs, and leeches** (蒿、牡、蜱蛸),\n**Decoct and drink** (冶，饮之),\n**Conception will be male** (必产男).\n**Tested** (已试).\"*\n\n**...[text fragment unclear]...**\n*\"**Urinate half a升** (遗溺半升),\n**...[text fragment unclear]...** **firm yet scant** (□□坚而少汁).\"*\n\n**Method Six:**\n*\"Take **bee larvae and dog testicles** (蜂房中子、狗阴),\n**Dry and decoct** (干而冶之),\n**Drink while pregnant** (以饮怀子),\n**The child will be male** (怀子产男).\"*\n\n**Method Seven:**\n*\"**Consume fresh fish** (□鲜鱼□□) **...[text fragment unclear]...**.\"*\n\n**...[text fragment unclear]...**\n*\"**Dry and decoct** (□□□□□□□干，冶之),\n**Add to wine** (投酒中),\n**...[text fragment unclear]...**\n**Pregnant women** (怀子者) **will conceive** (产□□□),\n**Not to be done in the first three months** (三月不可以□).\"*\n\n**...[text fragment unclear]...**\n*\"**...[text fragment unclear]...**\n**Ensure conception of a son** (令□□□□□□□□□□产男).\"*\n\n**Method Eight:**\n*\"Take **male crow** (乌□□□□) **meat for men to eat alone** (男子独食肉歠汁),\n**Women sit on rush mats** (女子席莞□).\"*\n**To conceive a daughter** (欲产女),\n*\"Take **female crow** (乌雌□□) **and boil** (煮),\n**Let women eat the meat alone and drink the broth** (令女子独食肉歠汁),\n**Sit on rush mats** (席□).\"*\n\n---\n**The Method of Seeking a Child** (求子之道):\n*\"**Gather the nine-stemmed grass** (求九宗之草),\n**Let the husband and wife brew it into wine** (而夫妻共以为酒),\n**Drink it** (饮之).\"*\n\n**For those about to give birth** (字者，且垂字),\n**First take fertile soil** (先取市土濡清者),\n**Shape it into a square** (□之) **three to four feet wide** (方三四尺),\n**Three to four inches high** (高三四寸).\nAfter the child is born, **place it on the soil** (置土上),\n**Do not cover it** (勿庸□),\n**Let the infant lie upon it** (令婴儿□上),\n**So its body fully absorbs the earth** (其身尽得土),\nThen **bathe it** (乃浴之),\n**To make it strong and vigorous** (为劲有力).\n\nAfter birth, **burn the birth mat** (字者已，即燔其蓐),\n**Submerge it in water** (置水中),\n**Bathe the infant** (□□婴儿),\n**Preventing blemishes and itching** (不疕瘙).\nTake **half a cup of the bathwater** (及取婴儿所已浴者水半杯),\n**Feed it to the mother** (饮母),\n**So she suffers no lingering illness** (母亦无余病).\n\n**For women who rarely conceive** (女子鲜子者),\n**After giving birth** (产),\n**Have another person hold the placenta** (令它人抱其□),\n**Remove and rinse it** (以去□□濯其胞),\n**Wrap it in fresh cloth** (以新布裹之),\n**Bind it in three layers** (为三约以敛之),\n**Place it in a container** (入□中),\n**Let the mother carry it herself** (令其母自操),\n**Walk to a river valley** (入溪谷□□□之三),\n**Discard it and return without looking back** (置去，归勿顾);\"",
      "overlap_context": "nor **treat** (毋治),\n**do not act nor doubt** (毋作毋疑).\n**It must be done slowly and sustained** (必徐以久),\n**subtly and persistently** (必微以持).\nIf **already achieved** (如已) yet **not perfected** (不已),\nthen the **woman** (女) will attain **great joy** (大怡).\n\n**Throat gasping** (喉息),\nthe **qi** (氣) descends, and **saliva** (阴) is expelled—\n**radiance** (光) is **yang** (阳), **sweat** (阴) is **yin** (阴);\n**Panting** (喘息),\nthe **qi** (氣) rises and **presses** (相薄),\nand **self-control** (自容) **expands** (张).",
      "start_char": 6169,
      "end_char": 7461,
      "start_sentence": 306,
      "end_sentence": 357,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 44.96157264709473,
      "metadata": {
        "source_file": "dao\\藏外\\马王堆帛书十问.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "即令它人善埋之。 杂禁方 有犬善嗥于坛与门，涂井上方五尺。 夫妻相恶，涂户□方五尺。 欲媚贵人，涂门左右方五尺。 多恶梦，涂下方七尺。 姑妇善，涂户方五尺。 婴儿善泣，涂牖上方五尺。 与人讼，书其名直履中。 取两雌隹尾，燔冶，自饮之，媚矣。 取东西向犬头，燔冶，饮。 夫妻相去，取其左眉置酒中，饮之，必得之。 取雄隹左爪四，小女子左爪四，以鍪熬，并冶，傅，人得矣。 取两雌隹尾，燔冶，自饮之，媚矣。 取其左眉置酒中，饮之，必得之。 养生方 老不起",
      "translated_text": "**Immediately command another to bury it properly.**\n\n**Miscellaneous Prohibitions and Prescriptions:**\nIf a dog barks fiercely at the altar or door, smear the area above the well five *chi* wide.\nIf a husband and wife harbor mutual resentment, smear the doorframe five *chi* wide.\nTo curry favor with a noble, smear the left and right sides of the door five *chi* wide.\nFor frequent nightmares, smear the base of the doorframe seven *chi* wide.\nIf a mother-in-law and daughter-in-law quarrel constantly, smear the doorframe five *chi* wide.\nIf an infant cries incessantly, smear the window frame five *chi* wide.\nIn legal disputes, write the opponent’s name on the sole of your shoe.\n\n**Charms for Attraction and Reconciliation:**\nTake the tails of two female birds, burn and refine them, then drink the ashes—you will be charming.\nTake a dog’s head facing east-west, burn and refine it, then drink it.\nIf a husband and wife are estranged, take the left eyebrow of one and place it in wine; when drunk, they will reunite.\n\n**Charms for Capturing a Person:**\nTake four claws from a rooster’s left foot and four from a young girl’s left foot, boil them in a pot, refine the mixture, and apply it—you will ensnare the person.\n\n**Charms for Attraction (repetition):**\nTake the tails of two female birds, burn and refine them, then drink the ashes—you will be charming.\nTake the left eyebrow of one and place it in wine; when drunk, they will reunite.\n\n**Prescriptions for Nourishing Life:**\n[The aged shall not rise...]",
      "overlap_context": "所已浴者水半杯),\n**Feed it to the mother** (饮母),\n**So she suffers no lingering illness** (母亦无余病).\n\n**For women who rarely conceive** (女子鲜子者),\n**After giving birth** (产),\n**Have another person hold the placenta** (令它人抱其□),\n**Remove and rinse it** (以去□□濯其胞),\n**Wrap it in fresh cloth** (以新布裹之),\n**Bind it in three layers** (为三约以敛之),\n**Place it in a container** (入□中),\n**Let the mother carry it herself** (令其母自操),\n**Walk to a river valley** (入溪谷□□□之三),\n**Discard it and return without looking back** (置去，归勿顾);\"",
      "start_char": 7461,
      "end_char": 7696,
      "start_sentence": 358,
      "end_sentence": 374,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 3.650151014328003,
      "metadata": {
        "source_file": "dao\\藏外\\马王堆帛书十问.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "老不起：□□□□□□□□□臭可□□□□□□□□□□□□□□□□□□□□□□□□□□□□□和则□乃□□□□□□下 一曰：□□以颠棘为浆方：刌颠棘长寸□节者三斗，□□□□□□□□之，以雚坚稠节者爨，大沸，止火，定，复爨之。 不欲如此，二斗半□□□□□□，以故瓦器盛，□为刚炊秫米二斗而足之。 气熟，□旬□寒□即干□□□□□沃之，居二日而□桨。 即已，近内而饮此浆一升。 浆□□□□□□□□□□□□□偫其汁，即浆□□以沃之，令酸甘□□饮之。 虽□□□□□□□□□□□□□□□□□□□□使人即起。 浆所。 一曰：□□□□□渍乌□□矣。 有。 为醴 为醴：为醴，取黍米、稻米□□□□□□□□□□□□□□□□□□□□□□□□稻醴熟，即每朝厌歠□□□□□□更。 不起 不起：为不起者，旦为善水粥而□□，以厌为故，□□□□□□□□□□□□□□□然，而□出之，如此二，且起矣。 勿□□有益二日不用□□以□水□之□□□□□□把，用□□，已后再歠一，已后三□，不过三歠，挺后用□□。 其歠毋相次□□□□□□□□歠。 若已施，以寒水溅，毋□□必又歠。 饮食□□□弃水已必以□□□□□气呴口仰之，比□，稍以鼻出气，□□复气，□老者。 加 加：以五月望取莱、兰，阴干冶之，又冶白松脂之□□□□□□□□□□□□□□各半之，善裹以韦，日一饮之。 每饮，三指撮入酒中，□□□□□□□□□□□□□力善行。 虽旦暮饮之，可也。 孱",
      "translated_text": "**Prescriptions for Nourishing Life (continued):**\n\n**For the Aged Who Cannot Rise:**\n[If the aged cannot rise,] the stench of the body may be [treated] by [certain means]—when harmonized, it will [then] descend.\nOne method: **Preparation of *Dianji* (棘) Decoction**\nTake *Dianji* thorns, each one inch long, three *dou*—[boil them] until they are thoroughly refined. Use a *gu* vessel to cook them until the liquid is thick and the thorns are firm. When boiling ceases, let it settle, then cook again.\nIf this is too troublesome, take two and a half *dou* of thorns, place them in an old earthenware vessel, and boil them with two *dou* of *ju* millet until done. When the *qi* is ripe, [let it steep] for ten days in coldness—it will then dry. [After drying,] soak it again. After two days, it becomes *jiang* (浆).\nWhen ready, drink one *sheng* of this decoction near the inner chamber. If the decoction is not yet ready, squeeze its juice and mix it with the decoction, making it sour and sweet—then drink it. Even if the aged are [still] unable to rise, this will make them rise immediately.\n[The method of] preparing *jiang*:\nAnother method: Soak [the thorns] in *wu* (乌) [liquor] until it is ripe. There is also [another method].\n**Making *Li* (醴):**\nTo make *li*, take *shu* millet and rice, [and follow the process]—when the rice *li* is ripe, each morning, take it to satiate thirst, and [continue] as before.\n**For Those Who Cannot Rise:**\nFor those who cannot rise, in the morning, prepare good water congee and [consume it] to satiate thirst, as before. [Do this] twice, and they will rise.\nDo not [overdo it]. If unused for two days, [reheat with] hot water and [consume it]. If [still] unable to rise, take one sip, then another, then a third—do not exceed three sips. Afterward, use [additional] methods.\nWhen sipping, do not do so consecutively—[pause] between sips. If already applied, splash with cold water, and do not [forget to] sip again.\nWhen eating and drinking, [after spitting out water,] be sure to [inhale] the *qi* with an open mouth, facing upward. Gradually exhale through the nose, then [retain the *qi*]—this benefits the aged.\n**Additives (加):**\nIn the fifth month on the full moon, gather *lai* (莱) and *lan* (兰), dry them in the shade, and refine them. Also refine white pine resin—[use] equal parts of each. Wrap them well with leather, and drink one dose daily.\nEach time you drink, take a pinch [of the mixture] with three fingers into wine, [and consume it]. This will strengthen vitality and improve mobility. Even if taken in the morning or evening, it is effective.\n[For those who are] weak.",
      "overlap_context": "unite.\n\n**Charms for Capturing a Person:**\nTake four claws from a rooster’s left foot and four from a young girl’s left foot, boil them in a pot, refine the mixture, and apply it—you will ensnare the person.\n\n**Charms for Attraction (repetition):**\nTake the tails of two female birds, burn and refine them, then drink the ashes—you will be charming.\nTake the left eyebrow of one and place it in wine; when drunk, they will reunite.\n\n**Prescriptions for Nourishing Life:**\n[The aged shall not rise...]",
      "start_char": 7696,
      "end_char": 8309,
      "start_sentence": 375,
      "end_sentence": 397,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 10.567743062973022,
      "metadata": {
        "source_file": "dao\\藏外\\马王堆帛书十问.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "孱：以五月望取乡軵者，入钥□盈，钥长五□□□□□□□□□□□□□□□之，置甗中，傅箕炊，泽上□□而出，重□□□□□□□□□□□□□□□□不知，即取钥中药大如黍，。 一曰：以五月□备茯苓，才黄，即□□□□□□□□□□□□□□□□□□□□□多为善藏 一曰：治中者，段乌□□□□□□□□□□□□□□□□□□□□□□□□□□此酰。 为醪酌 为醪酌：以美酒三斗渍麦□□□□□□□□□□□□□□□□成醪饮之。 男□□□以称醴煮薤。 治 治：取雄一，生搣，□浴之□□□□□□□□□，阴干而冶，多少如，◎◎◎◎□令大如□□□□□□□□□药，□其汁渍脯三日。 食脯四寸，六十五。 一曰：取黄蜂骀廿，置一杯醴中，□□日中饮之，一十。 易。 一曰：取黄蜂百，以美酱一杯渍，一日一夜而出，以汁渍饘糗九分升二。 每食，以酒饮三指撮。 一曰：平陵吕乐道，蠃中虫阴干冶，欲廿用七撮，欲十用三撮，酒一杯。 麦卵 麦卵：有恒以旦毁卵入酒中，前饮。 明饮二，明饮三； 又更饮一，明饮二，明饮三，如此尽二卵，令人强益色美。 一曰：八月取菟芦实阴干，干析取其米，冶，以韦裹。 到春，以牝鸟卵汁弁，丸如鼠矢，阴干，□入八丸菽酱中，以食。 一曰：□春日鸟卵一，毁投糗中，丸之，如大牛虮，食多之善。 一曰：。 已□干□者。",
      "translated_text": "**For the weak:**\n\nOn the full moon of the fifth month, gather the *lai* (莱) and *lan* (兰) from the *xiang* (乡) region, place them in a keyhole-shaped container filled to capacity. Let the container be five *zhang* (丈) long, place it in a steamer, and cook with a bamboo basket. When the steam rises, remove it, and repeatedly refine it until its nature is unknown. Then take the medicine from the container, as large as millet grains, and consume it.\n\nAnother method: In the fifth month, prepare *fúlíng* (茯苓) when it turns yellow, then refine and store it well—this is beneficial.\n\nAnother method: For treating the middle [region], cut *wū* (乌) [herb] and refine it, then consume it in wine. This is the method of *xiān* (酰).\n\n**For making wine:**\n\n**Making wine:** Use three *dòu* (斗) of fine wine to steep *mài* (麦) [grain], fermenting it into wine for consumption.\n\nFor men who are weak, use *lì* (醴) wine to cook *xiè* (薤).\n\n**Treatment:**\n\nTake one male *huángfēng* (黄蜂), crush it fresh, and bathe in wine. Dry it in the shade and refine it, adjusting the quantity like *huángfēng* itself. Soak it in wine for three days, then consume four *cùn* (寸) of the cured meat. This is sixty-five doses.\n\nAnother method: Take twenty *huángfēng* (黄蜂), place them in a cup of *lì* (醴), and drink it at noon for ten doses.\n\nAnother method: Take one hundred *huángfēng* (黄蜂), steep them in a cup of fine soy sauce for one day and one night, then use the liquid to soak *jiāng* (饘) and *zōu* (糗) in a ratio of nine *shēng* (升) and two *shēng*. Each meal, consume it with wine, taking a pinch with three fingers.\n\nAnother method: *Lǚ Lè* of *Pínglíng* (平陵), dry the *zhǎn* (蠃) worm in the shade and refine it. For twenty doses, use seven pinches; for ten doses, use three pinches, with one cup of wine.\n\n**Barley eggs:**\n\n**Barley eggs:** Regularly, in the morning, crush *mài* (麦) eggs into wine before drinking. Drink twice the next day, three times the following day; then drink once more, twice, and three times again. Thus, consume two eggs entirely, strengthening vitality and enhancing beauty.\n\nAnother method: In the eighth month, gather *túlú* (菟芦) seeds, dry them in the shade, separate the kernels, and refine them, wrapping them in leather. By spring, use the juice of a female bird’s egg to coat them, forming pills the size of mouse droppings. Dry them in the shade, then place eight pills in a bowl of bean sauce and consume them with food.\n\nAnother method: In spring, take one bird’s egg, crush it, and mix it into *zōu* (糗) to form pills the size of large *niú* (牛) lice. Consume many of them for benefit.\n\nAnother method: [Text incomplete] For those who have already dried and refined [the substance], [method unclear].",
      "overlap_context": "*]—this benefits the aged.\n**Additives (加):**\nIn the fifth month on the full moon, gather *lai* (莱) and *lan* (兰), dry them in the shade, and refine them. Also refine white pine resin—[use] equal parts of each. Wrap them well with leather, and drink one dose daily.\nEach time you drink, take a pinch [of the mixture] with three fingers into wine, [and consume it]. This will strengthen vitality and improve mobility. Even if taken in the morning or evening, it is effective.\n[For those who are] weak.",
      "start_char": 8309,
      "end_char": 8884,
      "start_sentence": 398,
      "end_sentence": 420,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 9.652562379837036,
      "metadata": {
        "source_file": "dao\\藏外\\马王堆帛书十问.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "一曰：治阴，以酱渍□□□□□□□□□□□□□□□□□□其中。 ◎◎洒男 洒男：□□□□□□□□□□□□□□□□三斗，渍梓实一斗五日，以洒男，男强。 灼 灼：曰以五月望取勃蠃，渍□□□□□布□中，阴干，以□□热。 易。 一曰：取干姜，桂、蔈苕、蛇、□□，皆冶之，各等，以蜜若枣脂和丸，大如指端，裹以疏布，入中，热细。 一曰：五月取蒲薄蠃三斗、桃实二斗，并挠，盛以缶，沃以美酨三斗，盖涂，埋中，令□□三寸，杜上，令与地平。 炊上昼日而火不绝，四日出，滤弃其滓。 以汁染布三尺，阴干，辄复染。 汁索，善裹布，勿令粗□。 用，取大如掌，窜鼻孔，小痒而热； 以据臂，臂大痒坚热； 勿令污面，污面痒不可支也。 为布多少以此衰之。 益甘 益甘□茯苓去滓，以汁肥豯，以食女子，令益甘中美。 取牛腮燔冶之，□干姜、菌桂◎皆并□，□□囊盛之，◎以酰渍之，入中。 一曰：□汁，以牛若鹿殽，令女子自探入其戒。 一曰：削予柔，去其上恶者，而卒斩之，以水煮□□气□□□□□□□□□□□□而清，取汁，去其浊者，复煮其清，令竭，干则□□□□□□□□□□□□□□□□下，如◎食顷，以水洒，支七八□□□尝。 一曰：取鸟产不鷇者，以一食其四□□□□□□□□□□□□□□□□□□□□□□□□□□□溅而阴干，干即。 戏 戏：□□者，取守宫，□以□□□甚，已，埋口下，深□□□◎□□水染其汁，以染女子臂。 女子与男子戏，□即破缺； □，即去。 取守宫置新瓮中，而置丹瓮中，令守宫食之。 须死，即冶，□画女子臂若身。 即与男子戏，即不明； 。 去毛",
      "translated_text": "One method states: To treat *yīn* (阴, \"yin\" imbalance), soak [the pills] in bean sauce within [a certain container]. **◎◎** [unclear] **To enhance male potency:** Soak *bó* (勃, \"vigorous\") *lǎn* (蠃, *Lan* or *Bole* fungus) in [a substance] for fifteen days, then use the soaking liquid to treat the male—male potency is strengthened.\n\n**To cauterize (灼):** On the fifteenth day of the fifth month, gather *bó lǎn* (勃蠃), soak it in [a substance] within a linen cloth, dry it in the shade, and heat it with [a substance]. **Easy method:** Take dried ginger, cinnamon, *yǐn* (蔈, *Yin* or *Atractylodes*) root, *shé jiā* (蛇蚧, \"snake scales\"), and [missing], all refine them, weigh equally, mix with honey or date paste to form pills the size of a finger’s tip, wrap them in coarse linen, place them inside [a container], and heat them gently.\n\nAnother method: In the fifth month, gather three *dòu* (斗, \"dou\" measure) of *pú bó* (蒲薄蠃, *Pu Bole* fungus) and two *dòu* of *táo* (桃, \"peach\") fruit, pound them together, put them in a jar, and pour three *dòu* of fine *jiàng* (酱, \"fermented bean sauce\") over them. Seal the jar, bury it in the ground, and let it ferment for three *cùn* (寸, \"inches\"). Cover the top with a *dù* (杜, \"plug\") so it is level with the earth. Boil it continuously for four days, then filter and discard the dregs. Use the liquid to dye a three-*chǐ* (尺, \"feet\") length of cloth, dry it in the shade, and dye it again repeatedly. When the liquid is exhausted, wrap the cloth well, ensuring it is not coarse. **When used:** Cut a piece as large as a palm, insert it into the nostrils—it causes great itching and heat; when pressed against the arm, the arm becomes itchy, firm, and hot. Do not let it touch the face, for if it does, the itching is unbearable. Adjust the amount of cloth accordingly.\n\n**To increase sweetness (益甘):** [Text unclear] *Fú líng* (茯苓, *Poria*) is removed from its dregs, and its juice is used to fatten *pí* (豯, *Pi* or *Pigweed* seeds). Feed this to women to make them more sweet and beautiful.\n\nTake a cow’s cheek, roast and refine it, together with dried ginger, *jūn guì* (菌桂, *Jun Gui* or *Fuling* and *Guizhi* mixture), and [missing], all combined, put into a pouch, and soak it in [a substance]. **Place it inside [a container].**\n\nAnother method: **Extract the juice,** and mix it with cow or deer *xiāo* (殽, \"minced meat\"), instructing women to insert it into their **vaginal orifice (戒, *jie* or *vaginal cavity*)**.\n\nAnother method: Peel and soften [a substance], remove its upper **noxious layers**, and finally cut it finely. Boil it until the **qi (气)** is fully extracted and the liquid is clear, then discard the turbid part. Reboil the clear liquid until it is exhausted; when dry, pound it finely, and place it below [a container]. When the time is right, sprinkle it with water and let it steep for seven or eight days before use.\n\nAnother method: Take **unhatched bird eggs (不鷇者)**, and with one meal, consume four of them, **drenching the mouth** with their liquid, then dry them in the shade. When dry, **use them**.\n\n**For playful purposes (戏):** Those who **do this**, take the *shǒu gōng* (守宫, \"eunuch\" or *Toad-headed Lizard*), and **soak it in [a substance] for a long time**. Then, bury it below the **mouth (口)** of [a container], deeply. **Dye the cloth** with its extracted juice, and use it to dye a woman’s arm.\n\nWhen a woman and man engage in **playful intimacy (戏)**, the cloth **immediately breaks or tears**; when **ejaculation occurs (去)**, it **immediately departs**.\n\nTake the *shǒu gōng* and place it in a new jar, then place **cinnabar (丹)** in the jar, allowing the *shǒu gōng* to consume it. When it dies, refine it, and **paint the woman’s arm or body** with its juice.\n\nWhen she and a man engage in **playful intimacy (戏)**, she **becomes infertile (不明)**; when **used**, it **is discarded**.\n\nRemove its hair.",
      "overlap_context": "hem in leather. By spring, use the juice of a female bird’s egg to coat them, forming pills the size of mouse droppings. Dry them in the shade, then place eight pills in a bowl of bean sauce and consume them with food.\n\nAnother method: In spring, take one bird’s egg, crush it, and mix it into *zōu* (糗) to form pills the size of large *niú* (牛) lice. Consume many of them for benefit.\n\nAnother method: [Text incomplete] For those who have already dried and refined [the substance], [method unclear].",
      "start_char": 8885,
      "end_char": 9569,
      "start_sentence": 421,
      "end_sentence": 450,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 13.932953119277954,
      "metadata": {
        "source_file": "dao\\藏外\\马王堆帛书十问.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "去毛：欲去毛，新乳始沐，即先沐下，乃沐，其氄毛去矣。 一曰：煎白婴颈蚯蚓，殽蜘蛛网及苦瓠，而淬铁，即以汁傅之。 一曰：以五月拔，而以称醴傅之。 病最肿 病最肿：冶柳柎，与脂膏相挐和，以傅肿者。 巳，即裹以布。 便近内 便近内：为便近内方：用颠棘根刌之，长寸者二参，善洒之； 又取全黑雄，合翼成□□□三之心脑胸，以水二升洎故铁甑，并煮之。 以雚坚稠节者爨之，令大沸一，即□□□去其滓，以其清煮黑骘犬卒岁以上者之心肺肝□，以雚坚稠节□□□□□□□□芵□□□□五物□□以□□□□□□以餔食食之，多少恣。 一曰：近内□□□□□□□□□□□□□□□□□□□□□□□□□□□□乌喙大者四□□□□□□□□□□□□□□□□□□□，取车前，生蒸之，大把二，气□□□□□□□□□□□□车前□□□者，以布橐若盛。 为欲用之，即食□之。 一曰：治中者，以汾囷始汾以出者，取，□令见日，阴干之。 须其干，□以稗□五、门冬二、茯苓一，即并捣，渍以水，令才掩，□而排取汁，以渍坟菌，亦令才掩，即出而干之。 令尽其干，即冶，参指撮，以□半杯饮之。 巾 巾：取才能讙者，生搣，尽去毛，遗两翼之末，而系县竿□□□□摩蜂房一大者，令之； 厌，又徙之，令以死。 死，即捝去其□□□□其肌，善冶，以布晒之，已，而以杂枣之脂弁之，而以涂布巾。 即以巾摩足□□□四五乃复，以二巾为卒。 □足者少气，此令人多气。 一曰：治巾，取杨思一升、赤蚁一升、斑廿，以美□半斗并渍之，掩□□□□其汁，以渍细布一尺。 已渍，旸之，干，复渍。 汁尽，即取榖、椅桐汁□□□□□涂所渍布，干之，即善藏之。 节（即）用之，操以揗玉策，马因惊矣。 杨思者，□□□□□状如小□□而螫人。 一曰：□□蛇泰半参、菻本二斗半、潘石三指撮一，桂尺者五挺□□□□□之菩半□□者一，以三月莤酨□，熟煮，◎◎令沸，而以布巾曼其□□□汁。 且为之，□□□□□□□□□□□□之，令肤急毋垂，又令男子足。 一曰：取萩荚二，冶之，以水一参沃之，善挑，即渍巾中，卒其时而抽之，□□□干，辄复渍。 一曰：阴干牡鼠肾，冶，取邑鸟卵溃，并以涂新布巾。 ，以抿男女。 一曰：取岪嬴一斗，二分之，以酨渍一分而暴之。 冬日置上，令极沸，即出岪选，□□□□，余如前，即以渍巾，尽其汁。 已，而渍巾，以抿男，令牝亦。 一曰：蠃四斗，美酪四斗，天牡四分升一，桃可大如枣，牡蝼首二七，□□□□□□□□□半升，并渍酪中。 已，取汁以□□□布□□渍，汁尽而已。 □用之，湿□□操玉策，则马骜矣。 所谓天社者，□□□食桃李花者也。 桃可者，桃实小时毛也。 牡蝼者，颉蠸□□□□□□□□□□□□者也。 □□者，状如赣皮。 一曰：燔□柎，张巾其□□□□□□□□□□□有□□□□□，以巾抏牝，马才。 轻身益力。 一曰：欲轻身者，取人所□□□□□□□□□□□□□□□□□□□□□□□□并□，以为后饭，春秋□□□□□□□□□□□□□□□□□□□□□□□□□□□□□之各四斗，与□□□养□□□□□□□□□□□□□□□□。",
      "translated_text": "**Removing Hair (去毛):**\nIf one wishes to remove hair, let them first bathe with fresh breast milk, then bathe the lower body before the upper. The hair will then depart.\n\nAnother method: Fry the neck of a white toad with a earthworm, mix with spiderwebs and bitter gourd, and quench with iron. Then apply its juice to the body.\n\nAnother method: In the fifth month, pluck the hair and apply it with a mixture of *chēnglǐ* (称醴, \"measured wine\").\n\n**For Severe Swelling (病最肿):**\nFor severe swelling: Refine willow bark (*liǔ gē*), mix it thoroughly with fat and grease, and apply to the swelling. Then wrap it with cloth. When done, proceed with the *Convenient for Nearness to the Inner* method.\n\n**Convenient for Nearness to the Inner (便近内):**\nTo prepare the *Convenient for Nearness to the Inner* formula: Take the root of the *prettle thorn* (颠棘, *diān jí*), slice it into pieces of one *cùn* in length, two *shēn* (参, \"hands\"), and dry it well. Then take a fully black male *mó* (雄□, likely 雄蜂, \"male bee\"), crush its heart, brain, and chest (with wings intact) into a powder, and boil it with two *shēng* (升) of water in an old iron steamer. When the liquid becomes thick and concentrated, strain it and remove the dregs. Then boil the heart, lungs, and liver of a black *liè* dog (骘犬, \"black dog\") aged over one year, and strain the liquid through thick, concentrated layers with *wú* (芵, unclear—possibly 麻, \"hemp\"). Mix these five substances together and use them to soak the cloth. When the time comes, remove it and dry it. When thoroughly dry, refine it again.\n\nAnother method: For *Convenient for Nearness to the Inner*, take four *dòu* (斗) of millet, four *dòu* of good-quality curdled milk, four *fèn* (分) of *tiān mǔ* (天牡, \"heavenly male,\" likely a type of male substance or animal), and peaches the size of dates. Take seven male *liú* (蝼, \"mole cricket\") heads and one *shāo* (赣, unclear—possibly 蛇, \"snake\") skin, and mix them with half a *shēng* (升) of *tiān shè* (天社, \"heavenly community,\" likely a type of insect or medicinal substance). Soak all these in the curdled milk. When done, strain the liquid and soak a piece of fine cloth one *chǐ* (尺) in length. When the soaking is complete, dry it, then soak it again. When the juice is exhausted, apply *gǔ* (榖, unclear—possibly 枸杞, \"goji berry\") and *yǐ* (椅, unclear—possibly 桐, \"paulownia\") juice to the cloth and dry it again. Store it well.\n\nWhen used, hold it with a *yù* (玉, \"jade\") staff while riding, and the stallion will become aroused. The *tiān shè* is the insect that feeds on peach and plum blossoms. The *táo kě* (桃可) is the peach when its hair is still present. The *mǔ liú* (牡蝼) are the heads of mole crickets. The *shāo* (赣) skin resembles that of a snake.\n\nAnother method: Burn *yáng sī* (杨思, unclear—possibly 杨树皮, \"willow bark\"), spread a cloth beneath it, and collect the falling ashes. Mix them with the juice of the cloth, then use the cloth to stimulate the female, and the stallion will become aroused.\n\n**Lightening the Body and Enhancing Vitality (轻身益力):**\nIf one wishes to lighten the body, take the substances discarded by humans after consuming *yáng sī* (杨思), *hóng mǐ* (红蜜, \"red honey\"), and *bān huáng* (斑黄, unclear—possibly 斑蝥, \"blister beetle\"), and mix them together. Use this as a post-meal supplement. In spring and autumn, consume four *dòu* (斗) each of *yáng sī*, *hóng mǐ*, and *bān huáng*, along with *tiān mǔ* (天牡) to nourish and strengthen the body.\n\nAnother method: For *Convenient for Nearness to the Inner*, take two *qì* (萩, \"lespedeza\") pods, refine them, and soak in one *shēn* (参) of water. Extract the juice well, then soak the cloth in it. When the time comes, remove it and dry it thoroughly. If it is not dry, soak it again.\n\nAnother method: Dry the male mouse’s kidneys in the shade, refine them, and mix with the crushed eggs of a *yì* bird (邑鸟, unclear—possibly 鹦鹉, \"parrot\"). Apply this to a new cloth.\n\nWhen used, stimulate both male and female with it.\n\nAnother method: Take one *dòu* (斗) of *dìng yíng* (岪嬴, unclear—possibly 丁香, \"clove\"), divide it into two parts, and soak one part in wine before exposing it to the sun. On winter days, place it above the fire until it boils thoroughly, then remove the *dìng yíng* and refine it. The rest is as before—soak the cloth in it and exhaust its juice. Then apply it to the cloth and use it to stimulate the male, causing the female to also become aroused.\n\nAnother method: Take four *dòu* (斗) of *bàng* (蠃, unclear—possibly 蚌, \"clamshell\"), four *dòu* (斗) of good-quality curdled milk, four *fèn* (分) of *tiān mǔ* (天牡), and peaches the size of dates. Take seven male *liú* (蝼) heads and one *shāo* (赣) skin, and mix them with half a *shēng* (升) of *tiān shè* (天社). Soak all these in the curdled milk. When done, strain the liquid and soak a piece of fine cloth in it. When the juice is exhausted, the process is complete.\n\nWhen used, moisten the cloth and hold it with a jade staff while riding, and the stallion will become aroused. The *tiān shè* is the insect that feeds on peach and plum blossoms. The *táo kě* (桃可) is the peach when its hair is still present. The *mǔ liú* (牡蝼) are the heads of mole crickets. The *shāo* (赣) skin resembles that of a snake.\n\nAnother method: Burn *yáng sī* (杨思), spread a cloth beneath it, and collect the falling ashes. Mix them with the juice of the cloth, then use the cloth to stimulate the female, and the stallion will become aroused. This lightens the body and enhances vitality.\n\nAnother method: For the cloth, take the substance discarded by humans after consuming *yáng sī* (杨思), *hóng mǐ* (红蜜), and *bān huáng* (斑黄), and mix them together. Use this as a post-meal supplement. In spring and autumn, consume four *dòu* (斗) each of *yáng sī*, *hóng mǐ*, and *bān huáng*, along with *tiān mǔ* (天牡) to nourish and strengthen the body.",
      "overlap_context": "an and man engage in **playful intimacy (戏)**, the cloth **immediately breaks or tears**; when **ejaculation occurs (去)**, it **immediately departs**.\n\nTake the *shǒu gōng* and place it in a new jar, then place **cinnabar (丹)** in the jar, allowing the *shǒu gōng* to consume it. When it dies, refine it, and **paint the woman’s arm or body** with its juice.\n\nWhen she and a man engage in **playful intimacy (戏)**, she **becomes infertile (不明)**; when **used**, it **is discarded**.\n\nRemove its hair.",
      "start_char": 9569,
      "end_char": 10852,
      "start_sentence": 451,
      "end_sentence": 494,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 22.06916069984436,
      "metadata": {
        "source_file": "dao\\藏外\\马王堆帛书十问.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "除中益气 除中益气：□□牸肉肥□□□膏者，皆阴干，冶，以三指撮一。 一曰□节者，其药以鸟□、□□、泽泻、朮、酸枣□□□□□□□□□□□□□等，冶，即以松脂和，以为丸，后饭，少多自。 一曰：春秋时取菀，阴干，冶之； 取冬葵种，冶，并之参指撮□□□□□□□□□□□□益中。 ◎。 一曰：□□、防风、□三等，芥当三物，冶，三指撮后饭。 一曰：取牛肉薄劙之，即取萆薢寸者，置□□牛肉中，炊沸，休，又炊沸，又休，三而出肉食之。 藏汁及萆薢，以复煮肉，三而去之。 □□人环益强而不伤人。 食肉多少恣也。 一曰：取白芫本，阴干而冶之，以马酱和，□丸，大如指端，□□□□□□孔中，张且大。 一曰：满冬、、防风，各冶之等，并之。 一曰：取菌桂二，细辛四，萩一，牡蛎一，秦椒二，三指撮以为后饭，令人强。 一曰：茹，湿磨，盛之，饱食饮酒□□者嗅之。 □□各善冶，皆并，三宿雄血□□□□□□，以缯装之，因以盖□以韦□雄□坚□□□旬。 竹缓节者一节，大径三寸。 一曰：以秋取斑□□首□□□□□三□□□之，强。 一曰：取□□□□□□□□□□□□□□□□强。 一曰：□□汁置钥中，牡鸟□□□□□□□□□置水中，饮之。 一曰：以猪膏大如手，令蜂□□□□□□□□□□□□□□□□□醇糟四斗，善冶□。 即弗欲，洒之。 一曰：□□□□□等，亦以□□后饭。 一曰：□□□大牡兔，皮，去肠。 取萆薢长四寸一把，朮一把，乌喙十□□□削皮细析，以大牡兔肉入药间，尽之，干，勿令见日，百日□裹。 以三指撮一为后饭百日，支六七岁，□食之可也，恣所用。 一曰：取细辛、干姜、菌桂、乌喙，凡四物，各冶之。 细辛四，干姜、菌桂、乌喙各二，并之，三指撮以为后饭，益气，又令人面泽。 一曰：取白苻、红符、茯苓各二两，姜十颗，桂三尺，皆各冶之，以美酰二斗和之。 即取刑马胪肉十□，善脯之，令薄如手三指，即渍之酰中，反复挑之，即漏之； 已漏，阴干炀之，□□□□沸，又复渍炀如前，尽汁而已。 炀之□修，即以椎薄段之，令泽，复炀□□□之，令□泽，□□□□□□□□□□□□□漆之，干，即善藏之。 朝日昼□夕食食各三寸，皆先饭□□□□□□□□□□□□。 □□□各冶等，以为后饭。 用少 用少男子用少而清，□□□□□□□□□□□□□□□□雄二之血和丸，大如酸枣，以为后饭，治一即。 □□□□□□□斗□□□□□□□□□□□□□□□以□化半斗，牡腊□□□□□□□□□升。 治力 治力：□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□身若痒若不痒，以。 黑发 ：黑发益气，取□□□□□□□□□□□□□□□□□□□□□□□□□行，复盛，以一复行□□□□□□□□□□□□□□□□□□□□□□□食，火毋绝，卅□□冶，以□□裹，□□□□□□□□□□□□□□□□□□□□□八月为药。 为醴 ：为醴，用石膏一斤少半，本、牛膝□□□□□□□□□□□□□□□□□□□□□二斗，上□其汁，淳□□□□□□□□□□□□□□□□□□□。 益力 ：益力，清除□心胸中恶气，取槐荚中实，置□□□□□□□□□□□□□五实，痒甚。",
      "translated_text": "**Nourishing the Center and Augmenting Qi**\n\n**Nourishing the Center and Augmenting Qi:**\nTake fatty female goat meat and animal fat, all sun-dried and refined. Take a three-fingerful as a dose.\n\nAnother method: For those with joint ailments, the prescription includes bird’s nest, [illegible], *zéxiè* (泽泻), *chú* (朮), and sour jujube [illegible]. Refine these, mix with pine resin, and form into pills. Take after meals, adjusting the dose as needed.\n\nAnother method: In spring and autumn, gather *wǎn* (菀), sun-dry and refine it; take winter melon seeds, refine them, and combine with a three-fingerful to nourish the center.\n\nAnother method: Take *fángfēng* (防风) and [illegible]—three parts each—refine with mustard. Take a three-fingerful after meals.\n\nAnother method: Slice thin strips of beef, then take *bìxuè* (萆薢) pieces one inch long, place them between the beef slices, boil until done, then rest. Boil again, rest again—three cycles—then eat the meat. Collect the broth and *bìxuè*, then boil the meat again, repeating three times before discarding the broth. This strengthens the body without harming it. The amount of meat consumed may vary at will.\n\nAnother method: Take *bái yuán* (白芫), sun-dry and refine it, mix with horse sauce, and form into pills the size of a fingertip. Insert into the [illegible] orifice, expanding and enlarging it.\n\nAnother method: Refine equal parts *mǎn dōng* (满冬), [illegible], and *fángfēng*, then combine them.\n\nAnother method: Take two parts *guì* (桂), four parts *xìxīn* (细辛), one part *qì* (萩), one part *mǔlì* (牡蛎), and two parts *qín jiāo* (秦椒). Take a three-fingerful after meals to strengthen the body.\n\nAnother method: Chew *rú* (茹), grind it wet, and place it in a container. Those who eat heartily and drink wine should sniff it.\n\n[Illegible]—refine each thoroughly, combine, and take three days of a male deer’s blood, wrapping it in silk. Cover with leather and secure the male deer’s [illegible] for ten days. Use a bamboo joint one *zhǐ* (节) long, with a diameter of three *cùn* (寸).\n\nAnother method: In autumn, take the heads of three *bān chóu* (斑豆), refine them, and this strengthens the body.\n\nAnother method: Take [illegible] and refine it to strengthen the body.\n\nAnother method: Place [illegible] juice in a keyhole, and let a male bird [illegible] drink from water. This strengthens the body.\n\nAnother method: Take a pig’s fat the size of a hand, let bees [illegible], and mix with four *dòu* (斗) of refined wine dregs. Refine thoroughly. If no effect, sprinkle it.\n\nAnother method: [Illegible]—also take after meals.\n\nAnother method: Take a large male hare, skin it, and remove its intestines. Take one bunch of *bìxuè* (四寸), one bunch of *chú* (朮), and ten *wūhuì* (乌喙), peel and finely chop them. Add the hare’s meat to the mixture, dry thoroughly without exposure to sunlight, and wrap it for a hundred days. Take a three-fingerful after meals for a hundred days. At six or seven, one may eat freely as needed.\n\nAnother method: Take *xìxīn* (细辛), *gān jiāng* (干姜), *guì* (桂), and *wūhuì* (乌喙)—four substances in total. Refine each separately: four parts *xìxīn*, and two parts each of *gān jiāng*, *guì*, and *wūhuì*. Combine and take a three-fingerful after meals to augment qi and brighten the complexion.\n\nAnother method: Take two *liǎng* (两) each of *bái fú* (白苻), *hóng fú* (红符), and *fúlíng* (茯苓), ten slices of ginger, and three *chǐ* (尺) of *guì* (桂). Refine all, then mix with two *dòu* (斗) of fine vinegar. Take ten *liǎng* (两) of *xíngmǎ* (刑马) meat, dry-cure it thinly like three fingers, then soak it in the vinegar, repeatedly stirring and draining. After draining, sun-dry it, then boil it until tender. Slice it thinly, dry it again, and repeat the process until the meat is glossy. Finally, coat it with lacquer, dry, and store it properly. Eat three *cùn* (寸) portions in the morning, noon, and evening, always before meals.\n\n[Illegible]—refine each thoroughly and take after meals. Use sparingly.\n\nFor young men, use sparingly and clarify the essence. Mix with the blood of a male deer to form pills the size of sour jujubes. Take after meals to treat [illegible].\n\n[Illegible]—[illegible] *dòu* (斗) of [illegible], refine half a *dòu*, and take [illegible] *shēng* (升) of male deer tallow.\n\n**Strengthening Vitality:**\nStrengthening vitality: [illegible]—whether itching or not, use [illegible].\n\n**Blackening the Hair:**\nTo blacken the hair and augment qi, take [illegible] and refine it thoroughly. Place it in a container, then layer it again, and eat it. Keep the fire burning continuously for thirty days. Refine it, wrap it in [illegible], and use it as medicine in the eighth month.\n\n**Making *Lì* (醴):**\nTo make *lì*, use one *jīn* (斤) of *shígāo* (石膏), [illegible] *bēnběn* (本本), and *niúxī* (牛膝) [illegible]. Collect the juice, refine it thoroughly, and [illegible].\n\n**Augmenting Vitality:**\nTo augment vitality and clear away harmful *qi* from the chest, take the seeds from within *huái jiá* (槐荚), place five in a [illegible container], and if the itching is severe...",
      "overlap_context": "uice of the cloth, then use the cloth to stimulate the female, and the stallion will become aroused. This lightens the body and enhances vitality.\n\nAnother method: For the cloth, take the substance discarded by humans after consuming *yáng sī* (杨思), *hóng mǐ* (红蜜), and *bān huáng* (斑黄), and mix them together. Use this as a post-meal supplement. In spring and autumn, consume four *dòu* (斗) each of *yáng sī*, *hóng mǐ*, and *bān huáng*, along with *tiān mǔ* (天牡) to nourish and strengthen the body.",
      "start_char": 10854,
      "end_char": 12179,
      "start_sentence": 495,
      "end_sentence": 539,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 15.560527563095093,
      "metadata": {
        "source_file": "dao\\藏外\\马王堆帛书十问.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "□之不痒，益之，令身若痒若不痒，□□□□□□□□□□□□□。 益寿 □谷名有泰室、少室，其中有石，名曰骈石，取小者□□□□□□□□□□□□□病益寿。 ：取刑马脱脯之。 段乌喙一升，以淳酒渍之，□去其滓，□□□□□□□□□□舆、虋冬各□□，萆薢、牛膝各五，□荚、桔梗、厚□二尺，乌喙十颗，并冶，以淳酒四斗渍之，毋去其滓，以◎□□尽之，□□□以韦橐裹。 食以三指撮为后饭。 服之六末强，益寿。 ：冶云母、消松脂等，并以麦丸之，勿□手，令大如酸枣，□之吞一丸。 日益一丸，至十日； 日后日捐一丸，至十日，日□□□□□□益损□□□□□，令人寿不老。 醪利中 醪利中：取漆□之茎，少多等，而□□□□□□□□□□□□□其清汁四斗半，□□□之间为之若□□□□□□□□□□□□□□□□□以酿之。 取熏乌喙八颗，□取漆、节之□□□□□□□□□□□□□□□□酿下，善封其罂口，令□□□□□□□□□□□□□□□□□□□□□□□□□之熟，而以平□□□□□□□□□□□□□□□□□□□□□□□□□□。 一曰：□九斗，先□□□□□□□□□□□□□□□□□□□□□□□□□□者二升其中十日，冶□□□□□□□□□□从器出□□□□□□□□□中，服之百日，令肠中无病。 一曰：为醪，细斩漆、节各一斗，以水五□□□□浚，以汁煮紫威□□□□□□□□，又浚◎◎◎曲、◎麦曲各一斗，□□□，卒其时，即浚□□□□黍稻□□□各一斗，并□，以曲汁滫之，如恒饭。 取乌喙三颗，干姜五，焦□□，凡三物，甫□□投之。 先置□罂中，即酿黍其上，□汁均沃之，又以美酒十斗沃之，勿挠，□□□涂之。 十一□熟矣，即发，勿酾，稍□□清汁尽，又以□□酒沃，如此三而□□。 以餔食饮一杯。 已饮，身体痒者，摩之。 服之百日，今目明耳聪，末皆强，□□病及偏枯。 治 治：取蠃四斗，以酢酨渍二日，去蠃，以其汁渍□肉撞者，□犬脯□□，复渍汁，□□。 食脯一寸胜一人，十寸胜十人。 折角 折角：燔螑，冶。",
      "translated_text": "**Strengthening Vitality:**\nWhether itching or not, **augment it**—until the body feels as if itching or not itching. [illegible].\n\n**Augmenting Longevity:**\nThere is a grain called *Tàishì* (泰室) or *Shàoshì* (少室), within which there is a stone named *pián shí* (骈石). Take the smaller one and [illegible]—it benefits longevity and treats [illegible] ailments.\n\n**Method:**\nTake the flesh of a horse that has been executed, and [illegible]. Use *sān wū* (三乌) one *shēng* (升), soaking it in refined wine. Remove its dregs, then mix [illegible] *yú* (舆), *chōng* (虋) each [illegible], *bì xī* (萆薢), and *niúxī* (牛膝) five *jīn* (斤) each, *huái jiá* (槐荚), *jiégēng* (桔梗), and *hòu huā* (厚花) two *chǐ* (尺), and *sān wū* (三乌) ten kernels. Combine all and soak in four *dòu* (斗) of refined wine, **do not remove its dregs**. When the wine is fully absorbed, wrap it in a leather pouch (*wéi tuó* 韦橐). Take a portion the size of three fingers as a post-meal supplement. After taking it for six months, one will be invigorated, and longevity will be augmented.\n\n**Another Method:**\nCombine *yúnmǔ* (云母) and melt *sōng zhī* (松脂), then roll them into pills with *mài qū* (麦曲). **Do not handle with bare hands**, making them as large as sour jujube. Swallow one pill daily, increasing by one each day until the tenth day. Then decrease by one each day until the tenth day again, **adjusting as needed**—this will make one’s lifespan **unendingly long**.\n\n**Making *Lì* (醴) for the Midsection:**\nTo make *lì* for the midsection: take the stem of *qī* (漆) and [illegible], refining them in various ways. Collect four and a half *dòu* (斗) of its clear juice, and [illegible]—ferment it as if making regular *lì*. Take eight *wū huì* (乌喙) kernels, and [illegible]—collect the juice from *qī* (漆) and *jié* (节), and add it to the fermenting mixture. Seal the jar tightly, allowing it to mature fully, then use *píng* (平) [illegible] to [illegible].\n\n**One Method:**\nUse nine *dòu* (斗) of wine. First, [illegible]—take two *shēng* (升) of it after ten days, and [illegible]—extract the [illegible] from the vessel. After taking it for a hundred days, the intestines will be free of disease.\n\n**Another Method:**\nTo make *láo* (醪), finely chop *qī* (漆) and *jié* (节) one *dòu* (斗) each, and soak them in five *shāng* (斛) of water. Use the juice to cook *zǐ wēi* (紫威) [illegible]. Then soak *qū* (曲) and *mài qū* (麦曲) one *dòu* (斗) each, and [illegible]. When the time is right, soak *shǔ* (黍) and *dào* (稻) [illegible] one *dòu* (斗) each, and combine them. Use the *qū* (曲) juice to moisten them, as if making regular rice gruel. Take three *wū huì* (乌喙) kernels, five pieces of dried ginger, and five of *jiāo* (焦) [illegible], and add them to the mixture. First place the [illegible] in a jar, then ferment the *shǔ* (黍) above it. Evenly moisten it with the juice, and again pour ten *dòu* (斗) of fine wine over it, **do not stir**, and [illegible]—coat it. After eleven days, it will be fully matured. Open it, **do not filter**, and gradually consume the clear juice. Again pour [illegible] wine over it, repeating this process three times. Use it as a porridge or drink one cup. After drinking, if the body itches, rub it. Take it for a hundred days, and one’s eyesight and hearing will improve, one’s strength will be fully restored, and **all ailments, including hemiplegia**, will be treated.\n\n**Treating [illegible]:**\nTake *fáng* (蠃) four *dòu* (斗), and soak it in vinegar for two days. Remove the *fáng* (蠃), and use its juice to soak [illegible] meat or *zhuàng zhū hū* (撞者) [illegible], such as *quǎn hū* (犬脯) [illegible]. Again soak it in the juice, and [illegible]. Eating one inch of the dried meat is equivalent to one person’s strength; ten inches is equivalent to ten people’s strength.\n\n**Breaking the Horns:**\n[Illegible]—roast *mò* (螑), and [illegible].",
      "overlap_context": "continuously for thirty days. Refine it, wrap it in [illegible], and use it as medicine in the eighth month.\n\n**Making *Lì* (醴):**\nTo make *lì*, use one *jīn* (斤) of *shígāo* (石膏), [illegible] *bēnběn* (本本), and *niúxī* (牛膝) [illegible]. Collect the juice, refine it thoroughly, and [illegible].\n\n**Augmenting Vitality:**\nTo augment vitality and clear away harmful *qi* from the chest, take the seeds from within *huái jiá* (槐荚), place five in a [illegible container], and if the itching is severe...",
      "start_char": 12179,
      "end_char": 13009,
      "start_sentence": 540,
      "end_sentence": 565,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 15.529680252075195,
      "metadata": {
        "source_file": "dao\\藏外\\马王堆帛书十问.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "裹其灰以□牛，可以翕壶折角。 益力。 走 走：非廉、方葵、石韦、桔梗、紫威各一小束，乌喙三颗，□□□□□□□□□大□□□五寸，白螣蛇若苍梗蛇长三四寸，若□□□□□□□□，各冶，并以□若枣脂丸，大如羊矢，五十里一食。 阴菌出雒□□□□□□□□。 七百。 一曰：乌喙五，龙葵三，石韦、防风、伏菟各□，阴干，□□□□□□□□去其□□治五物，入酒中一日一夜，浚去其滓，以汁渍滫饭，如食顷，□□干，干又复□□干，索汁而成。 一曰：乌喙二，北南陈阳□骨一，冶，并以细新白布裹三。 马膏□□□□栖肥鸡□□□□，复煮瓦苔长如中指，置□□□□汁，出苔，以囊盛，□□□□日弃埋□□滓。 即行，渍，东行水一杯，置□□□□□□□□□□□□□□二以出□□□见日饮之。 一曰：□□犬三卒乌喙一半，冶之，为。 一曰：走者，取女□□□□□□□□□□□□□□□□□□□□□□□□□□□□服一斗，取。 一曰：□□有□□□□□□□□□□□□□□□□□□□□晦渍，昼干之，尽□□□行百里。 一曰：行宿，自呼：「大山之阳，天□□□，□□先□，城郭不完，□以金关。 」即禹步三，曰以生荆长二寸周画中。 一曰：东向呼：「敢告东君明星，□来敢到画所者，席彼裂瓦，何人？ 」又即周中。 一曰：走疾欲善先者，取女子未尝男子者□县枲，怀之，见旋风以投之。 风止，即□□带之。 疾行 疾行：取牛车枲带之，欲疾，一约之。 一曰：行欲毋足痛者，南向禹步三，曰：「何水不酨，何道不枯，气我□□。 」末即取突墨□□□□□纳履中。 ：□□□□天下□□□□□□□□□□宗，有气则生，无气则死，是□□□□□□。 怒而不大者，肤不至也； 大而不坚者，筋不至也； 坚而不热者，气不至也。 肤不至而用则垂，筋不至而用则避，气不至而用则惰，是以圣人必□□之。 汤游于瑶台，陈□□于南宫，问◎◎男女之齐至相当、毋伤于身者若何？ 答曰：益生者食也，损产者色也，是以圣人必有法则：一曰麇触，二爰据，三曰蝉傅，四曰蟾诸，五曰鱼嘬，六曰青灵。 七曰兔骛。 一曰云石，二曰瓠，三曰濯昏，四伏□，五曰□□。 一曰高之，二曰下之，三曰左之，四曰右之，五曰深之，六曰浅之，一曰吙，二曰啮。 一曰□□，二曰震动。 一曰定味，二曰致气，三曰劳实，四曰时节。 □语 □语：□见三月吉日在□，禹乃□□入于璇房，其状变，色甚雄以美，乃若始壮。 娥见之，□□□□□□□□□□□□□□□□娥月之□治扣而见□，凡彼莫不既蒿有英。 今人□□□□□□□□□□□□□□□□□□□□□我须眉既化，血气不足，我无所乐，□□□□□□□□□□□□□□□□□□□□□□□□□欲毋言，王有□色，□□□□□□□□□□□□□□□□□□□□□□□□□□□□□昏有悟。 南娥□□□□女子之□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□不能已。 西娥□□□□□□□□□□□□俞曰：□□□□□□□□□□□□□□□□坚病而□而不已，恐过而不悟。 少娥□答眉睫□□□□□□□□□□□□□□□其□撞而问之，以谒情故。",
      "translated_text": "Wrap its ashes in a [illegible] and place them in a cow’s horn, and this can collapse the horn and break the horns.\n\n**Strengthening Vitality (Qi):**\nTake *bù lián* (非廉), *fāng kuí* (方葵), *shí wéi* (石韦), *jié gěng* (桔梗), and *zǐ wēi* (紫威) each in a small bundle, and three *wū chuǐ* (乌喙), along with [illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible] five inches in length. Take a *bái yuán shé* (白螣蛇) or *cāng gěng shé* (苍梗蛇) three to four inches long, or [illegible]—[illegible]—[illegible]—[illegible]—[illegible], each roasted and refined. Combine them into pills the size of dates, each as large as a sheep’s dung pellet. Take one every fifty *lǐ* (里).\n\nWhen *yīn jūn* (阴菌) emerges from *luò* (雒) [illegible], it is seven hundred [in number].\n\nOne method: Take five *wū chuǐ* (乌喙), three *lóng kuí* (龙葵), and one each of *shí wéi* (石韦), *fáng fēng* (防风), and *fú tú* (伏菟). Dry them in the shade, and [illegible]. Treat these five substances, steep them in wine for one day and one night, filter out the dregs, and soak glutinous rice in the juice. Eat it as if taking a meal. Dry the residue, dry it again, and collect the juice to form the medicine.\n\nOne method: Take two *wū chuǐ* (乌喙) and one *běi nán chén yáng* (北南陈阳) [illegible] bone, refine them, and wrap them together in fine white silk three times.\n\n**Cow Tallow (Mā Gāo) Method:**\nTake the tallow from a fat cow, and [illegible]. Boil *wǎ tái* (瓦苔) [illegible] as long as a middle finger. Place it in the [illegible] juice, remove the *wǎ tái* (瓦苔), and store it in a pouch. Each day, discard and bury the dregs. Then proceed: soak [illegible], and drink one cup of eastern flowing water. Place [illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible] twice to remove [illegible]. Expose it to sunlight before drinking.\n\nOne method: [Illegible]—[illegible]—[illegible] three *zú* (卒) [illegible], and half a *wū chuǐ* (乌喙), refine them, and [illegible].\n\n**For the Swift Walker:**\nTake a woman who has never experienced a man’s touch, refine *xiàn guǐ* (县枲) [illegible], and carry it in her bosom. When she sees a whirlwind, she should throw it in. When the wind stops, she should immediately tie it around her waist. The swift walker should refine and carry the belt of a cow-drawn carriage. To walk swiftly, bind it once.\n\n**For the Walker Who Wishes to Avoid Foot Pain:**\nFace south, take three steps in the *Yǔ bù* (禹步), and say: *\"What water does not boil, what path does not wither? Let the Dao/Way nourish my vitality!\"* Then take *tū mò* (突墨) [illegible]—[illegible]—[illegible]—[illegible] and place it in one’s shoes.\n\n**The Dao/Way of Vitality (Qi):**\nThe Dao/Way permeates all under heaven, and where there is Dao/Way, life emerges; where there is no Dao/Way, death ensues. This is the great virtue/power of the Dao/Way. When anger does not manifest greatly, the skin is not affected; when it is great but not firm, the sinews are not affected; when it is firm but not heated, the *qi* is not affected. If the skin is not affected but one acts, it will be excessive; if the sinews are not affected but one acts, it will be evasive; if the *qi* is not affected but one acts, it will be sluggish. Therefore, the sage must regulate these.\n\n**The Dialogue of the Dao/Way:**\nThe Dao/Way was seen on a favorable day in the third month within the [illegible]. The Great Yu transformed, his appearance vigorous and handsome, as if newly matured. When *Rù É* (娥) saw him, she [illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—",
      "overlap_context": "legia**, will be treated.\n\n**Treating [illegible]:**\nTake *fáng* (蠃) four *dòu* (斗), and soak it in vinegar for two days. Remove the *fáng* (蠃), and use its juice to soak [illegible] meat or *zhuàng zhū hū* (撞者) [illegible], such as *quǎn hū* (犬脯) [illegible]. Again soak it in the juice, and [illegible]. Eating one inch of the dried meat is equivalent to one person’s strength; ten inches is equivalent to ten people’s strength.\n\n**Breaking the Horns:**\n[Illegible]—roast *mò* (螑), and [illegible].",
      "start_char": 13009,
      "end_char": 14272,
      "start_sentence": 566,
      "end_sentence": 607,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 50.28595781326294,
      "metadata": {
        "source_file": "dao\\藏外\\马王堆帛书十问.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "少娥进答曰：女子之乐有□□□□□□□□□□□□□幼疾，暴进暴退，良气不节。 禹曰：善哉言乎。 □□□□□□□□□□□□□□□□我欲合气，男女蕃兹，为之若何？ 少娥曰：凡合气之道，必□□□□□□□□□□□曰：君何不羹茅必至□思？ 气不□郁。 禹曰：善哉乎！ 今我血气外揖艾，取甚湛，以实五赏石膏白□□□□□□□□□□□□□□□，端夜茨，白虽赏，登左下右，亦毋暴成。 食引 食引：利益气，食饮恒移阴动之，又引之，故曰：饮□□，又教诲之。 右引而曲左足。 却谷食气 却谷者食石韦，朔日食质，日加一节，旬五而止； 旬六始匡，日□一节，至晦而复质，与月进退。 为首重足轻体胗，则呴吹之，视利止。 食谷者食质而□，食气者为呴吹，则以始与始兴。 凡呴中息而吹。 年廿者朝廿暮廿，二日之暮二百； ◎年卅者朝卅暮卅，三日之暮三百，以此数谁之。 春食一去浊阳，和以镭光、朝霞，昏清可。 夏食一去汤风，和以朝霞、沆瀣，昏清可。 秋食一去□□、霜雾，霜雾和以输阳、镭，昏清可。 冬食一去凌阴，和以端阳、镭光、输阳、输阴，昏清可。 □□□□□者，□四塞，清风折首者也。 霜雾者，□□□□□□□。 浊阳者，黑四塞，天之乱气也，及日出而雾也。 汤风者，□风也，热而中人者也，日□。 凌阴者，入骨□□也，此五者不可食也。 朝霞者，□□□□□□□□□□□□□□□者，日出二干，春为浊□□□□□云如盖，蔽□□□□者也。 □□者，苑□□□□□□夏昏清风也。 凡食□□□□□□□□□□□□□□□□□□食谷者食方，食气者食圆，圆者天也，方者地也。 □□□者北向□□□□□□□□多食。 □□□□□□□□□□□□□□□□□□□□□则和以正阳。 夏气霞□□□□□□□□□□□□□多阴，日夜分□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□为青附，青附即多朝霞。 朝◎佚气为白附，白附即多镭光。 昏失气为黑附，黑附即多输□。 □□□□□□□□□食毋。",
      "translated_text": "Shào É responded and said: \"The joys of women are marked by **illegible**—**illegible**—[as] **幼疾** (yòují, youthful ailments), where **良氣** (liángqì, true *qi*) surges forward and recedes violently, lacking moderation.\n\nYǔ said: \"Well spoken!\"\n\n[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—\n\nNow, my **血氣** (xuèqì, blood-*qi*) has already been **外揖** (wàiyè, [illegible])—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible**]—[**illegible",
      "overlap_context": "egible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—[illegible]—",
      "start_char": 14272,
      "end_char": 15062,
      "start_sentence": 608,
      "end_sentence": 643,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 48.69468593597412,
      "metadata": {
        "source_file": "dao\\藏外\\马王堆帛书十问.txt",
        "category": "藏外"
      }
    }
  ]
}