{
  "source_id": "高上玉皇本行集经（唐佚名）",
  "source_file": "chunked_daozang\\高上玉皇本行集经（唐佚名）.json",
  "total_chunks": 13,
  "total_original_chars": 14940,
  "total_translated_chars": 86256,
  "total_translation_time": 215.13524508476257,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\本文类\\高上玉皇本行集经（唐佚名）.txt",
    "category": "本文类"
  },
  "full_translation": "**The Scripture of the Highest Supreme Jade Emperor’s Original Conduct (Volume 1)**\n*Title:* **The Scripture of the Highest Supreme Jade Emperor’s Original Conduct** (abbreviated as *The Jade Emperor Scripture*)\n*Author unknown; likely composed during the Sui-Tang period.*\n*Attributed to Yuan Shi Tianzun expounding the Daoist cultivation and ascension of the Jade Emperor, as well as the merits and rewards of reciting the Jade Emperor’s scriptures and incantations.*\n*Three volumes. Source text: The *Zhengtong Daozang*, *Dongzhen* section, *Benwen* category.\n\n---\n\n**Volume One: The Chapter of Divine Prowess in the Qingwei Celestial Palace**\n\nAt that time, Yuan Shi Tianzun sat upon the Radiant Seat in the Qingwei Celestial Palace, within the Seven-Treasured Mysterious Gardens of the Jade Emperor’s Golden Threshold in the Jade Capital of the Uppermost Realm. There, He expounded the *Lingbao* doctrine of Pure, Immaculate, True, and Undivided Dao to countless assemblies of the *Wu Yang* multitudes.\n\nThe Jade Emperor, in His august presence, stood with the myriad True Saints, the Flying Celestial Saints, the Gods of the Boundless, and the Nine Thousand Myriads of Spirit Boys and Jade Girls. They observed strict fasting and ceremonial rites, attending at His side.\n\nWhen the time drew near, the Jade Emperor manifested His Six Transcendent Powers, emitting boundless radiance that illuminated all the heavens and the Boundless Brahman abodes—every realm trembled in response. The ten directions of the Boundless worlds became as transparent as crystal and glass, with no obstruction between them. The assemblies from all directions arrived, riding five-colored jade wheels, lingyus, and emerald palanquins, nine-hued dark dragons, and ten-perfect feathered canopies. The phoenixes danced, the dragons sang, their melodious cries resounded, while Spirit Consorts scattered flowers and Golden Boys wafted incense. They chanted sacred hymns, floating through the air to the assembly.\n\nAt that moment, the Celestial Brahmans and all the Golden Immortals, the Great Vehicle Bodhisattvas, and the Four Assemblies of the Eight Departments—bathed in this radiance—rode upon golden clouds, nine-hued misty carriages, and jade palanquins, circling in the four celestial gatherings. The Three Celestial Luminaries exhaled fragrance, and the Eight Harmonious Melodies played as they revolved before the Dao. A shower of wondrous flowers descended like clouds, covering the entire assembly.\n\nThis radiance illuminated all the heavens and the lower Boundless worlds, merging with the Pure Capital’s domain. Even the mortal realm, reaching up to the Nine Heavens, became intimately connected. The lower Boundless worlds—mountains, ridges, valleys, and ravines—lay flat as the palm, with the six directions now near and the three realms no longer distant.\n\nThe Celestial Treasures Platforms dotted the mortal world, their jade and rare gems arrayed in splendor, shining along the cloudy thoroughfares. Seven-Treasured railings marked the paths, and jade trees with resplendent fruits and flowers flourished in the Vermilion Fields, their luster surpassing all.\n\nAt that time, even the lower realms beheld the heavens. The divine music of the Pin Heaven resounded spontaneously, its vibrations filling the air. They also heard the cranes’ cries and the phoenixes’ songs, their harmonious calls in perfect rhythm, while dragons danced and unicorns coiled in aerial grace. The celestial treasure flowers scattered across the paths, filling every road.\n\nThen, both mortals and immortals were astonished, their darkness dispelled by light. Celestial beings and humans rejoiced, leaping in delight. Even the common scholars ascended, gazing upward at the towering treasure platforms and downward at the vast purple clouds.\n\nAll the peoples of these worlds attained the Dao’s *qi*, their aged faces wrinkled and graying transformed into youthful radiance—blue-black hair turned crimson, their forms renewed in beauty. Their suffering vanished, and they were universally liberated, dwelling in perfect bliss. Across the land, songs of joy celebrated the Great Peace.\n\nAt that moment, the divine winds blew far and wide, the ten thousand *qi* surged, the earth trembled and split, and even the bones of the dead regenerated. Sunken corpses and wandering spirits rose anew. The Iron Enclosure of the Underworld and the Nine Dark Nights of eternal night were instantly shattered. The tormented souls of hell were reborn in the heavens, and the sufferings of the Three Evil Paths were all relieved.\n\nAt that time, even the guilty were, by this radiance’s power, born into the great celestial palaces of the ten directions.\n\nThe Jade Emperor then divided His body, manifesting in each of the ten-directional great celestial palaces. There, the palaces naturally transformed—white jade became the capital, yellow gold the threshold, and the Seven-Treasures Mysterious Gardens housed the Great Radiant Hall with its Radiant Seat. Banners, flags, and canopies of rare treasures and wondrous flowers adorned the place.\n\nThe Jade Emperor, through His divided forms, sat upon the Radiant Seat within the Golden Threshold of the White Jade Capital, the Seven-Treasures Mysterious Gardens, and the Great Radiant Hall. There, He universally expounded the Dao of Pure Liberation to the ten directions.\n\nThe transformed Jade Emperors, each attended by countless Heavenly True Saints, Marvelous Conduct Immortals, and Spirit Consorts and Jade Girls, stood at their sides. These Jade Girls possessed exquisite, peerless beauty, their features adorned with celestial rarities and treasures. Their voices were clear and melodious, delighting all who heard.\n\nMoreover, their bodies emitted a subtle, natural fragrance of liberation. This scent permeated the Boundless lands of the heavens and all the fortunate places of the great earth. All beings of the Six Paths who smelled it were universally enlightened—whether the Path of Heaven, the Path of Humans, the Path of Demons, the Path of Hell, the Path of Hungry Ghosts, or the Path of Beasts.\n\nFor those on the Path of Heaven, all celestial beings who heard this fragrance saw their Five Decays and Four Marks vanish, their heavenly blessings eternally increased.\n\nFor those on the Path of Humans, kings, ministers, and commoners who heard it attained the joys of human and celestial longevity. If their bodies perished, they achieved the *tuoké* liberation of the empty shell.\n\nFor those on the Path of Demons, all demons who heard it found rest in celestial palaces, free from the sufferings of war.\n\nFor those on the Path of Hell, all beings who heard it escaped the torments of hell and attained the bliss of Pure Lands.\n\nFor those on the Path of Hungry Ghosts, all hungry ghosts who heard it were sated, their hunger and thirst no longer tormenting them.\n\nFor those on the **Path of Beasts**, all beasts who heard this fragrance escaped the sufferings of animal existence and attained the joy of wisdom.\n\nAt that time, all the sinful beings born in heaven, having already been reborn in this supreme celestial palace, through the grace of the compassionate light’s guidance, awakened and clearly understood the causes and effects of sin and virtue. They performed celestial arts with their retinues before the Emperor and paid homage.\n\nThese beings, filled with sorrow, spoke in unison: *\"For countless kalpas and myriads of kalpas, we saw no sun, moon, or stars, dwelling always in darkness within the Three Evil Paths, enduring endless torment. By the Emperor’s compassionate light, we were rescued and born into heaven. Our evil deeds are now all extinguished, with no more bonds—we have attained rebirth.\"*\n\nThey then knelt and bowed before the Jade Emperor, arriving at the Dao field. After speaking thus, they prostrated themselves and returned to their seats.\n\nThe Jade Emperor then emitted a wondrous voice, addressing all the sacred assemblies of the ten directions: *\"Hear me well! These sinful beings, for eons without wisdom, committed the Ten Evils, defiled by the Six Dusts, entangled by the Three Karmas, indulging their hearts without awakening. Their hidden and manifest sins accumulated day by day, abandoning the Dao and betraying truth, following evil and rejecting righteousness. Every thought and intention bound them further. Thus, after death, they fell into the Three Realms, unable to escape. Had they not encountered this Dharma feast today, how could they have liberated themselves?\"*\n\nAt that moment, the Jade Emperor’s transformation body, without moving from his place, used divine power to transport all the heavenly and human beings to the Pure and Refined Heavenly Palace of the Jade Purity Sacred Realm beneath the Primordial Assembly. These beings were unaware of the journey.\n\nWhen the Heavenly Worthy and the assembly saw the ten-directional Jade Emperors’ transformation bodies gather before the Heavenly Worthy’s assembly, they shone like boundless mirrors reflecting countless forms, merging seamlessly. The great assembly then bowed in reverence.\n\nThe Jade Emperor’s transformation body, most exalted among the saints, grew in pure faith and joy, his resolve unshaken, his heart unyielding. The heavenly and human beings, newly born in heaven, suddenly beheld the Heavenly Worthy in this supreme Dao field, adorned with the merit of non-action, pure and first among all. Overwhelmed with joy, they prostrated themselves in homage, exclaiming in wonder.\n\nThe ten-directional transformation Jade Emperors then merged into one body, rose from their seats, and knelt northward.\n\nThe Heavenly Worthy spoke: *\"In a past age, there was a kingdom named Light-Strong and Wondrous-Joy. Its king was named Pure Virtue. The king had a queen named Treasure-Moonlight. Since the king had no heir, one day he pondered: ‘I am aging, yet have no prince. When I die, who will inherit the throne and temples?’ After this thought, he issued an edict to all Daoist assemblies in the palaces, following the rites, hanging banners, and making offerings in purity. For half a year, he never wavered in his devotion.\n\nOne night, Queen Treasure-Moonlight dreamed of the Most High Dao Lord and the Perfect Ones, their forms golden and jade-like, pure and refined, riding a five-colored dragon carriage, surrounded by radiant banners and canopies of misty clouds. The Most High Dao Lord sat in the carriage, holding an infant whose pores emitted a hundred billion lights, illuminating the palaces in a hundred treasures’ hues. The banners and flags led the way as they floated through the air. The queen, overjoyed, knelt in reverence before the Dao Lord and said: ‘The king has no heir. I beg you to grant this child as the future ruler. Please have mercy and grant my wish.’\n\nThe Dao Lord replied: ‘I grant this to you.’ The queen then thanked the Dao Lord and took the child. Upon waking, she found herself with child.\n\nAfter a year, in the first month of the *bingwu* year, at noon on the ninth day, she gave birth in the royal palace. At birth, the child’s body radiated treasure-light, filling the kingdom with splendor, his form exquisite and never-ending in beauty. As a child, he was quick and wise; as he grew, he was kind and benevolent. He distributed all the kingdom’s treasures—gold, jewels, and wealth—to the poor, the widowed, the orphaned, the homeless, the hungry, and the sick, his kindness and humility earning songs of praise. His influence reached distant lands, and all under heaven followed him, calling him the Prince of Virtue. The king rejoiced.\n\nAfter this, the king suddenly passed away, and the prince ruled in his place. Moved by the transient nature of life, he instructed the ministers in righteous governance, then abandoned the throne and retired to the Fragrant and Pure Mountain to cultivate the Dao, achieving transcendence through merit.\n\nAfter this kalpa, over eight hundred kalpas passed, and he repeatedly abandoned his kingdom for the sake of all beings, severing attachments to learn the Dao.\n\nIn the following eight hundred kalpas, he practiced medicine to heal the sick, rescuing beings and bringing them peace.\n\nAfter another eight hundred kalpas, he widely employed expedient means, expounding the Daoist canon, reciting sacred verses, and spreading true teachings to aid the nation and save people—from the hidden to the manifest.\n\nFollowing this, in another eight hundred kalpas, he sacrificed his body and life through endurance, offering his flesh and blood.\n\nThus, over three thousand two hundred kalpas of such practice, he finally attained the Golden Immortal rank, named the Pure and Natural Awakened King Asura, who taught the Bodhisattvas the sudden insight into the Great Vehicle’s true essence and gradually entered the wondrous Dao of Emptiness.\n\nAfter another hundred million kalpas of cultivation, he attained the rank of Jade Emperor.\"*\n\nAfter this discourse, the assembly of the Dao/Way was hushed, and all voices in unison sighed in wonder, exclaiming that such a thing had never been heard before.\n\nAt that moment, among the gathering, there arose a jade maiden named Yèguāng (夜光, \"Moonlight\"). She rose from her seat, adjusted her attire with solemn grace, and moved with composed elegance. Kneeling deeply before the Dao/Way, she addressed the Heavenly Venerable (天尊) thus: *\"Your humble servant has been most fortunate to serve in Your presence, offering reverent devotion and countless kalpas of worship. The Three Pure Ones’ realm, with its golden palaces and jade capitals, is serene and unbounded—a place of boundless joy and ease where I wander among sacred domains, feasting on the sounds of the Dao/Way. Yet even here, I have never witnessed such a rare and wondrous sight as this.\n\nI do not understand how, within the luminous interior of the past, the ten directions of all celestial realms (十方诸天) displayed their holy transformations—each with the Jade Emperor’s (玉帝) manifested dharmakāya (法身), the Heavenly True Saint (天真大圣), the Marvelous Conduct Immortal (妙行真人), and the Spirit Consort Jade Maidens (灵妃玉女) as attendants. These jade maidens possessed noble and refined features, exquisite forms, and emitted divine fragrances unmatched by any other.\n\nYet by the Jade Emperor’s divine powers (神通), they were summoned here, all now gathered in the Pure and Microcosmic Heaven (清微天). I do not know by what cause and condition this jade maiden has attained such a supreme and radiant form (色身). It is only by Your boundless compassion (圣慈) that she may now understand.\"*\n\nThen the Heavenly Venerable (天尊) replied to the Moonlight Jade Maiden (夜光玉女): *\"You have indeed just entered the sacred stream of the Dao/Way. Though you possess wisdom, you have yet to fully comprehend its depths.\n\nThese jade maidens, from countless kalpas past, cultivated marvelous practices (妙行), mastered the gates of liberation (解脱门), and shared in the Pure and Natural faith (清净自然), the Pure and Natural understanding (清净自然), the Pure and Natural mindfulness (清净念), the Pure and Natural conduct (清净行), the Pure and Natural body (清净身), the Pure and Natural heart (清净心), the Pure and Natural intention (清净意), and the Pure and Natural fruits and retributions (清净果、清净报). They also shared in the Great Compassion (大慈心) and Great Mercy (大悲心), sheltering beings as a mother cherishes her child, loving them as her own. With unwavering dedication to the precepts (奉戒专一), their minds illuminated by the Great Dao/Way (冥心大道), they observed strict fasting (清斋) and took grand vows (弘誓) for countless kalpas, reverently serving the Jade Emperor (玉帝).\n\nThese jade maidens are not truly maidens—they are the Heavenly Essence of Truth (天至真), appearing in the form of jade maidens solely to guide all beings. Thus, their radiant forms (身色), divine powers (神通), and wisdom (智慧) manifest in hidden and revealed transformations, all in harmony with the Emperor’s.\n\nWhen the Moonlight Jade Maiden (夜光) heard these words, her heart opened in enlightenment. She bowed her head in joy, then silently returned to her seat.\n\nAt that moment, the Sovereign of the High Void and Pure Clarity Heaven (高虚清明天主), along with the celestial retinue (眷属), rode in the Eight Auspicious Celestial Chariot (八景鸾舆) beneath the Nine Radiant Jewel Canopy (九光宝盖). They played celestial hymns of profound harmony (玄歌妙乐), recited the limitless sacred verses (无量洞章), scattered the Heavenly Treasure Flowers (天宝花), and sprayed the Heavenly True Fragrance (天真香). With steps suspended in the void, they approached the Dao/Way’s assembly.\n\nBy the Jade Emperor’s (玉帝) mighty virtue and power (威神之力), these Heavenly Treasure Flowers instantly formed a canopy in the air, sheltering all the gathered beings without exception. At that moment, the Sovereign of the High Void and Pure Clarity Heaven, seeing this rare wonder, knelt and bowed deeply, addressing the Heavenly Venerable Jade Emperor (天尊玉帝): *\"Your lowly servant was negligent and missed the earlier assembly. Today’s joyous occasion, this radiant bridge of the Dao/Way, spans the hidden and the manifest, the sacred and the mundane, and all beings partake in Your sacred blessings (圣泽). Your boundless light (大光明) shines forth in wondrous forms (希有相), illuminating the heavens above and the realms of the Four Celestial Kings (四梵) and the Six Desires (六欲) in all directions. The holy and true assemblies (真圣众) behold this light and converge in response, while below, the boundless worlds of the lower realms (下方无极世界) align with the Mysterious Capital (玄都境), drawing near to the Nine Heavens (九天). The spiritual winds play celestial melodies (灵风奏乐), the tones of the cosmos resonate in harmony (宫商相和), and the clouds echo with profound hymns (激朗云庭), all forming limitless sacred verses (洞章).\n\nAll beings, great and small, attain the Dao/Way’s transformation (道化). Even the tormented souls of the Iron Enclosure of the Netherworld (酆都铁围), the Nine Abysses of Eternal Night (长夜九幽), and all suffering beings in the various hells (一切地狱), by the power of this light (光力), are reborn in the heavens (诸天) and granted boundless joy (快乐).\n\nThe Heavenly Treasure Flowers (天宝奇花) scattered today have swiftly formed this canopy, sheltering all beings beneath its radiance. Your virtue and power (威神之力) are such that Your humble servants have accumulated merit over a thousand kalpas (千劫良因), the Nine Heavens (九天) have gathered in auspicious alignment (运会), and the august Dao/Way flourishes in its vastness (皇道荡荡), with the true teachings (正法) thriving. Today is a great day of fortune—all bow in reverence to Your sublime powers (玄功).\"*\n\nThen the Sovereign of the High Void and Pure Clarity Heaven (高虚清明天主) chanted a gāthā in praise of the Jade Emperor (玉帝):\n\n*\"O Sovereign of the Golden Palace and Mysterious Vault,\nThe Highest Jade Emperor, Your marvelous form surpasses all the heavens,\nYour compassionate radiance illuminates the Three Realms.\nYou are the True Saint, the Master of the Marvelous Dao/Way,\nThe support of both celestial beings and humans.\nWith the Great Vehicle’s teachings, You guide the lost,\nPointing toward the One True Essence.\nYour virtues and powers are as boundless as the void,\nPraise for You knows no end.\n\nYou are the Sovereign of the boundless cosmos,\nThe Venerable of the vast kalpas,\nWith profound insight and wisdom,\nUnmatched and peerless.\nIn serene stillness and true tranquility,\nVanishing yet ever-present,\nThe highest of saints and spirits,\nPossessing great divine powers,\nThe luminous treasury of the Dao/Way,\nThe Great Hero,\nYou open the path for all humanity and celestial beings,\nTeach the Dao/Way without end,\nWith great compassion and mercy,\nYour dharma-wheel shines forth,\nGuiding all beings—\nThus You are named the Jade Emperor.\n\nThe True Elder of the boundless cosmos,\nIn perfect roundness and purity,\nWith wisdom and eloquence,\nThe highest of the Dao/Way’s sovereigns,\nYou liberate all beings—\nThus You manifest this light.\"*\n\nWhen the Sovereign of the High Void and Pure Clarity Heaven (高虚清明天主) finished chanting his gāthā in praise, the Heavenly Venerable (天尊) proclaimed to the Four Assemblies (四众):\n\n*\"The Emperor’s body is the Dao/Way’s body, not an ordinary form (非常体). It is the body of boundless virtues and powers (无量功德之身), the Pure and Natural body (清净自然之身), the unshakable, divine, and luminous true void’s supreme dharmakāya (神明坚固不坏真空无上法身). His virtue and power are vast and encompassing (威灵恢廓), his fame resounding throughout the cosmos (名声周徧). There is no hidden realm He cannot illuminate (无幽不开), and His divine marvels are resplendent (神奇堂堂). Such a being is beyond measure.\n\nThe Emperor’s virtues and powers are not attained through worldly deeds (有为功德). Though in the past He descended into the human world for countless kalpas, demonstrating great divine powers (神通) while maintaining a Pure and Natural body (身清净), He never ceased to reside in the Golden Palace (金阙). Through His limitless transformations (分身变化), He manifested in response to all beings, benefiting them and guiding them toward the Dao/Way’s shore (超升道岸). He universally bestowed His teachings (普垂教法), awakening future generations, leading them to follow and attain true enlightenment (登真成道).\n\nBy the might of these virtues, His light perpetually fills the heavens (光明常充诸天), and His divine wisdom reaches beyond all measure (神智妙达). This radiant body (身光明) bears wondrous names: the Great Divine Power Light (大神通光), the Great Compassion and Mercy Light (大慈悲光), the Great Joyous Renunciation Light (大喜舍光), the Great Endurance Light (大忍辱光), the Great Equality Light (大平等光), the Great Gentle Harmony Light (大柔和光), the Great Freedom Light (大自在光), the Great Beneficial Light (大利益光), the Great As-You-Wish Light (大如意光), the Great Wisdom Light (大智慧光), the Great Auspicious Light (大吉祥光), the Great Liberation Light (大解脱光), the Great Refuge Light (大归依光), the Great Virtue and Power Light (大功德光), the Great Perfect Light (大圆满光), the Great Unobstructed Light (大无碍光), and the Unsurpassable Light (无能胜光).\"*\n\nThus, you who wish to behold this Sovereign—yet cannot—do so because your bodies and speech remain bound to defilements, clinging to habitual patterns and afflictive deeds. By this obstruction, you fail to glimpse His merciful countenance.\n\nNow, before this gathered assembly, I proclaim the method to sever these barriers. All of you must diligently practice it.\n\nAt these words, the great assembly rejoiced beyond measure, each prostrating before the Most Exalted Throne, bowing in reverence, all eager to hear.\n\nThe Celestial Sovereign spoke:\n\n*\"The method to sever barriers is this: cultivate boundless compassion, harbor no doubt or confusion, no greed or wrath, no lust, no jealousy or malice, no killing or harm, no mundane emotions, no mundane thoughts, no dullness or filth, no attachment to sounds and forms, no clinging to right or wrong, no aversion or fondness, no discrimination, no arrogance, no fixation.\n\nConcentrate your spirit, purify your thoughts—subdue all spirits, let your heart be as boundless void. Within and without, pure and untainted, containing all yet accepting all. Do not allow external evils to disrupt your Dao, to drag you from the True Path, to corrupt your sacred root, to steal your supreme treasure, lest you fall into the mundane realm for countless kalpas, ensnared in the net of the vulgar, assailed by myriad demons, condemned by ghosts and spirits, cycling endlessly through birth and death.\n\nTherefore, you must wholeheartedly resolve to safeguard the True Path, lest it be lost. As previously stated, all these barriers must be severed by you—thus your body attains purity, transcending all hardships.\n\nThis is the Dao-Treasure, the pillar of the Law.\n\nMoreover, you must revere and uphold this sacred text, approaching the Sovereign with reverence, meditating on His august form, extolling His sacred name—only then will you behold His merciful face, all receiving His protection, universally hearing the wondrous Law, personally offering devotion and worship, forever freed from transmigration.\"*\n\nAt these words, the Four Assemblies rejoiced, marveling as never before.\n\n**Volume I, Chapter II: The Great Perfect Light and Supreme Divine Spell of the Highest and Most Illuminating Dao**\n\nAt that time, the Five Elders—Heaven’s Primordial Ancestors—prostrated and knelt, addressing the Celestial Sovereign:\n\n*\"We humbly hear that the Highest and Most Illuminated Sovereign, in boundless compassion for the common folk, universally emanates divine light, illuminating the Dharma-realm. The Six Ordinary and Four Holy beings alike partake in the blessings of the Dao.\n\nAlas, as mortal lives are brief and the kalpa nears its end, the True Path must now be practiced to save the myriad people, enabling those who cultivate the True Way to ascend swiftly, while the common folk of the latter age all attain longevity.\n\nSince ancient times, the *Elemental Origins: Sacred and Mysterious Treasure—The Crimson Scripture of the True Text*, emerged before the Primordial Beginning, within the Void of Emptiness, before Heaven and Earth took form, before the sun and moon shone—dark and obscure, without origin or lineage, without qi or form, without color or name, without shape or trace, without sound or voice. It was the boundless chaos, yet within it, sacred scriptures glimmered, appearing and vanishing.\n\nThe Two Principles awaited its division, the Great Sun its illumination. As cosmic patterns shifted and celestial omens emerged, it manifested in response to the moment.\n\nThe Jade Emperor entrusted us with the Sacred Seal of the Treasure and the Inconceivable Divine Spell, thus Heaven and Earth were divided, the Three Lights shone forth. The sacred scriptures flourished, illuminating the Pure and Transcendent. They emanated from the Azure Beginning-Heaven, their hue undefinable, their branches winding and intricate, beyond tracing.\n\nThe Primordial Origin refined it in the Hall of Mystic Yang, tempered it in the Courtyard of Flowing Fire, revealing its true text, radiant with brilliance. The Yang-qi was crimson, hence its name: *Crimson Scripture*.\n\nWhen the sacred scriptures shone forth, ten thousand emperors paid homage to the True One, flying through the void, circling the Celestial Palace, burning incense and scattering flowers, chanting sacred hymns.\n\nAt that time, Heaven sent twelve mysterious auspices, Earth produced twenty-four responses, celebrating the nine heavens’ sacred mysteries, praising the three heavens’ treasured brilliance. The divine wind stirred, and the Imperial Dao flourished.\n\nThe Primordial Origin ascended to command, the Most True One took up the brush, the Jade Consort swept the table, casting gold tablets and carving the Jade Texts. The Five Elders recorded them, sealing them in the Celestial Treasury of the Nine Heavens.\n\nThe Jade Maiden attended to the incense, the Great Hua held the cloth, the Jade Boys stood guard, the Jade Terrace faced the hall, and the Nine Heavens’ decrees were beyond the hearing of ghosts and spirits.\n\nThus, Heaven treasured it to attain stability, Earth concealed it to ensure peace, the Five Emperors held it to secure dominion, the Three Lights rode upon it to ascend in splendor, the Sage Emperors upheld it to attain divinity, the Highest Exalted revered it to achieve the True, the Five Sacred Peaks followed it to gain spiritual power, the Son of Heaven obtained it to govern wisely, and the nation’s lineage enjoyed it to attain eternal peace.\n\nIts virtue is the wondrous power of the sacred scriptures, the primordial root of Heaven and Earth. Its might is vast and boundless, encompassing all without measure, sweeping through the great transformation as the source of divine wisdom.\n\nIts extent is unfathomable, towering in the boundless void. Its truth has a fixed principle, now to be put into practice.\n\nAt that time, the Primordial Origin shifted the cosmic patterns, the celestial omens unfolded, the sacred scriptures flourished, and divine manifestations appeared in the Five Directions, dividing Heaven and Earth, enlightening all living beings.\n\nThis is the work of the Great Ancestor—may we dare to glimpse its essence in the sacred repository?\n\nNow the Imperial Dao spreads and blesses the ten directions. Observing the kalpa’s end, the True Wind must prevail.\n\nOur humble wish is to let the clouds shade the eight extremes, the wind moisten the orchid groves, that withered branches may aspire to the luxuriance of Hua-Yang, and decaying bodies receive the elixir of the sacred isles.\n\nGazing upward in reverence to the Primordial Mercy, we humbly plead below: We pray for Your compassionate consideration of the common folk. Might the *Sacred Treasure Jade Texts* be granted to those unworthy, taught to those who have not heard?\n\nThus, the Primordial Celestial Sovereign, leaning on the table with uplifted bearing, concentrated His True Essence in profound contemplation. Observing that the time had come, He addressed the gathered assembly of all True Saints, determining yin and yang, calculating kalpas and cosmic cycles, comparing the Yellow River’s source, verifying celestial degrees, selecting worthy disciples, pointing to the Great Void, and chanting the Nine Mysteries. His words were not for the unenlightened, as if sealing the path to the True for those obstructed by ignorance.\"\n\nAt that moment, the Five Elder Celestial Sovereigns pressed their inquiries without ceasing. After a long while, the Primordial Celestial Sovereign then lowered His gaze in solemn contemplation and sighed deeply:\n\n\"How profound and subtle it is! What you now seek is not distant, yet its essence is vast. This is the **Primordial Dao’s Sacred Treasure**—the **True Texts of the Empty Void and Natural Mystery**—which gives birth to the heavens, establishes the earth, and enlightens the divine. It governs the Five Sacred Mountains, secures the realm, and brings prosperity to the people. The Sacred Treasure is **mysterious and profound**, the sovereign of all things; the heavens manifest this **primordial omen**, and the **spiritual response** arises naturally.\n\nNow, the **three celestial cycles** are in motion, the **six heavenly Dao**s unfold, and **diverse methods** of enlightenment are at work. There shall be **thirty-six thousand kinds of Dao** to select the hearts of those who come. When this **methodical cycle** concludes, after the **three dragons**, in the year **Gengzi**, the **mixed qi** will universally dissipate. All the heavens will rejoice in assembly, and then My **True Dao** shall be revealed. For now, it may be entrusted to you, but it shall be recorded in the **Upper Register** and not yet practiced in this lower world. The **mysterious teachings** are forbidden—do not transmit them lightly.\n\nYou may proceed to **Sacred Capital’s Purple Micro Upper Palace**, where you shall hear the **Celestial Sound** in the **Golden Register**, receive the **divine decree** from the **Spiritual Sovereign**, and then be granted the **completion of heavenly texts** to oversee the Primordial Dao’s celestial domain.\n\nThus, the Five Elder Celestial Sovereigns, along with all the **True Saints**, in **pure incense and solemn vows**, wandered the **cloud paths**, and with a **divine chant** addressed the **Ten Heavens**, ascending to the **Uppermost Pure and Mysterious Jade Capital**—the **Cold Spirit Hall of the Primordial Treasure**—in the **Purple Micro Upper Palace**, to receive the **divine decree** of reverence. Only then did they realize that the **Celestial Mystery** is precious and rare, difficult to hear immediately.\n\nReturning, they further visited the **Primordial Dao’s Hall**, seeking guidance on the **forbidden prohibitions**. They humbly declined, unable to grasp them.\n\nAt that time, the Celestial Sovereign’s **compassionate visage** pitied and instructed them. The **Spiritual Gate** opened wide, and the decree was given to the Five Elder Celestial Sovereigns to establish the **Hall of the Yang Void**. There, they unfolded the **Nine Radiant Eight-Colored** treasures—**cloud brocade’s pouch**—and produced the **Primordial Sacred Treasure’s Scarlet Book True Texts**, inscribed in **golden script and jade seals**, with **subtle and secret mysteries**, the **perfect and divine incantation** governing the **Great Radiance of the Primordial Void**. These were entrusted to the Five Elder Celestial Sovereigns and all the **True Saints**, commanding them to follow the **mysterious teachings** and adhere to the **method** in transmission.\n\nAt that time, the **Eastern Divine Treasure’s** **Green Spirit Elder Sovereign** received the **divine decree** of the **Nine Qi** from the **Primordial Sovereign of Jade Emperor**:\nThe **Eastern Nine Qi**, the **Primordial Sovereign of Azure Heaven**, where **Emerald Constellations** gather in dense layers. Within lies the **Elder Sovereign**, who oversees the **divine registers**, collects the **Qi**, and raises the **transcendent**. The **Twenty-Four-Character Eastern Sovereign’s Secret Texts**, written on the **Primordial Platform of the Nine Heavens**, govern the summoning of the **Nine Heavenly Sovereigns** and the **divine registers of immortals**. The **Year Star** assists the **Liver**, while **Jiao and Qiang** constrain the **True**. **Zi and Fang** regulate the **Heart and Tail**. The **Four Celestial Guardians** revolve in harmony. **Qi** presides over **Seven Celestial Beings**, while the **Upright Dipper** illuminates the **Wheel of Destiny**. **Capturing Qi and seizing the false**, they sweep away calamitous crowds. The **Thirty-Two-Character Secret Texts**, inscribed in the **Eastern Hall of the Purple Micro**, govern the summoning of **celestial officials**, the rectification of **heavenly divisions**, and the **establishment of celestial degrees**. The **Eastern Mountain’s Divine Incantation** collects the **Nine Heavens**. The **Scarlet Book’s Decree** commands the **Assembly of the Nether Mountains**. **Binding demons and dispatching ghosts**, none escape their judgment. All are summoned to the **Wood Palace**—none dare delay. The **Thirty-Two-Character Secret Texts**, written in the **Eastern Hall of the Primordial Spirit**, govern the **collection of ghosts and demons** and the **rectification of the Nine Heavenly Qi**. Below, they command the **Eastern River’s Water Sovereign**, the **Great Effort’s Dragon King**, the **Water Palace’s Paths**, and the **thousandfold routes**. The **Scarlet Book’s Decree** ensures **uninterrupted wind and fire**. The **Thirty-Two-Character Secret Texts**, inscribed in the **Primordial Jade Gate of the Nine Heavens’ Eastern-Northeast**, govern the **Eastern Sea’s Water Sovereign**, the **Great Effort’s flood**, and the **summoning of dragons and water spirits**.\n\nThis is the **Eastern Nine Qi’s Sacred Treasure True Texts**, totaling **one hundred and twenty characters**. All are the **Primordial Sovereign’s** **Great Perfect Divine Incantation** of the **Empty Void and Natural Mystery**, also known as the **True Chapter of the Primordial Spirit’s Preservation**, the **Eastern Mountain’s Divine Incantation**, and the **Eastern Sovereign’s Eightfold Strategy**.\n\nThe **rightful decree** of the **Jade Emperor** is hereby bestowed upon the **Eastern Nine Qi Sovereign**, commanding Him to oversee all the **eastern heavens and earths**, the **sun, moon, stars, and constellations**, the **sacred mountains and spiritous caverns**, the **Water Palace and Spring Courts**, the **highest saints and transcendent immortals**, and all **divine and potent beings**. Wherever the **decree and command** reach, they shall be followed as ordained.\n\nThe **Southern Divine Treasure’s** **True Elder Sovereign of Vermilion Spirit** received the **divine decree** from the **Primordial Sovereign of Scarlet Emperor**:\nThe **Southern Scarlet Heaven**, the **Scarlet Emperor’s Jade Hall**. Within lies the **Great God**, called the **Scarlet Sovereign**. Above, **flaming Qi** flows with smoke, and the **three Qi** radiate in brilliance. The **divine immortals** receive the command, responding to the **assembly of the Great Sun**. The **Thirty-Two-Character Scarlet Sovereign’s Secret Texts**, inscribed in the **Hall of the Yang Void**, govern the summoning of the **Nine Heavenly Immortals** and the **golden-named divine registers**. **Mars** assists the **Heart**, while **Well Ghosts** guard the **Four Rooms**. **Willow Stars** extend their wings, **resisting the four directions**. **The Southern Dipper** gathers the **Seven Celestial Beings**, while the **celestial constancy** revolves in return. The **summoning of celestial officials** hastens the **assembly**, and the **rectification of the Dao’s paths** aligns the **heavenly stations**.\n\nThe **Thirty-Two-Character Secret Texts**, inscribed on the **Three Qi’s Scarlet Platform**, titled in the **Southwest Rectified Yang**, govern the summoning of **celestial officials**, the **clarification of degrees**, and the **rectification of heavenly divisions**. The **Scarlet Decree’s command** constrains the **Nether Mountains**. The **binding and dispatching of demonic sects** extinguishes **evil roots**. Where the **decree and teachings** reach, the **guilt is manifest**. The **Southern Mountain’s Divine Incantation** subdues the **eight directions**. All **fiends vanish in ruin**, and **ten thousand trials are crushed**. The **Forty-Character Secret Texts**, inscribed in the **Southwest Rectified Yang Jade Gate**, govern the **command of the Nether Mountains** and the **rectification of ghostly Qi**. The **Southern River’s Water Sovereign**, the **Great Effort’s Dragon King**,—where the **divine incantation** flows, all **inauspicious omens** are swept away. The **great flood’s calamity** summons **dragons and water spirits**. The **paths of water** are opened, and **thousandfold routes** flow freely. Any who dare obstruct shall be **collected and dispatched** to the **Fire Palace**. The **Scarlet Book’s proclamation**—none shall disobey.\n\nThe **Forty-Eight-Character Secret Texts**, inscribed in the **Southwest Rectified Yang Western Gate**, govern the **Southern Sea’s Water Sovereign**, the **great cosmic cycles**, and the **flood’s four outpourings**, summoning **dragons and water spirits**.\n\nThis is the **Southern Three Qi’s Sacred Treasure True Texts**, totaling **one hundred and fifty-two characters**.\n\nAll are the **Supreme Most High Great Radiant Perfect Great Divine Incantation** of **emptiness and natural spontaneity**, also named the *Scripture of the South Cloud Piercing Heaven’s Precious Soul*, also named the *Nine-Heaven Supreme-Uppermost Incantation*, also named the *Red Sovereign’s Eight-Awe Command Text*.\n\nBy the **Jade Emperor’s decree**, it is bestowed upon the **Southern Celestial Treasure Illuminating Yang Danling True Elder Red Sovereign of the Three Qi**, commanding him to govern all **southern celestial and terrestrial realms, sun, moon, stars, constellations, sacred mountains, spirit caves, water palaces, spring courts, and all high and exalted saints, true immortals, and all awe-inspiring spirits**. Where the **talisman-decree descends, all shall comply as decreed**.\n\nThe **divine incantation-decree received by the Central Treasure-Effacing Cavern Pure Jade Precious Soul Primordial Elder Yellow Sovereign**:\n\n**Central Sovereign of All Spirits, Yellow Above Heaven’s Primordial.**\n\n**Five Elders first emerged, the Central Emperor Most High.**\n\n**Overseeing qi, supervising truth, leading all immortals.**\n\n**Recording the Mysterious Diagram, the Host’s Jade Texts.**\n\n**Urging the movement of Upper Qi, universally proclaiming to ten thousand spirits.**\n\nThe **Forty-Character Yellow Sovereign’s Secret Text**, inscribed on the **Great Mysterious Jade Precious Mysterious Platform**, governs the **summoning of gods and immortals, the Jade Tablet’s ancient names, and the total return of immortal qi.**\n\n**Controlling stars to assist the spleen, reversing to restore the Northern Primordial.**\n\n**[Illegible]—master of non-being, severing evil and cutting roots.**\n\n**[Illegible]—sweeping away filth and dispelling miasma.**\n\n**[Illegible]—rectifying the Mysterious Dipper, illuminating the Heavenly Pass.**\n\n**Nine-Heaven talisman-decrees, transmitted by the Golden Horse Relay.**\n\nThe **Forty-Character Secret Text**, inscribed on the **Mysterious Capital Jade Platform**, governs the **supervision of celestial officials and the rectification of heavenly measurements.**\n\nBy decree, **subduing the Northern Sovereign, blocking the Ghost Gate, cutting off inauspicious omens—none shall dare obstruct.**\n\nThe **Sixteen-Character Secret Text**, inscribed on the **Mysterious Capital Jade Platform**, governs the **subduing of the Northern Sovereign, rectifying heavenly qi, and inspecting ghostly spirits.**\n\nThe **Central Mountain Divine Incantation**, summoning dragons to ascend the clouds, controlling the confluence of the Yellow River, and the nine rivers’ sources.\n\n**None shall be negligent or indulgent—good and evil shall all be distinguished.**\n\n**Ten thousand demons and deceits shall be presented before the Celestial Lord.**\n\n**Dare any obstruct? The Sun’s wrath shall be aroused.**\n\n**The Scarlet Book’s Jade Characters—proclaimed universally heard.**\n\nThe **Forty-Eight-Character Secret Text**, inscribed on the **four walls of the Mysterious Capital Jade Platform**, governs the **subduing of the Central Sea Water Sovereign’s four springs’ waters and the calamitous surging of floods**, commanding water spirits and restraining dragon affairs.\n\nThis is the *Central One-Qi Soul-Precious Jade Chapter True Text*, totaling **one hundred and forty-four characters**.\n\nAll are the **Supreme Most High Great Radiant Perfect Great Divine Incantation** of **emptiness and natural spontaneity**, also named the *Treasure-Effacing Cavern Pure Nine-Heaven Soul Scripture*, also named the *Yellow Heaven Great Divine Incantation*, also named the *Yellow Sovereign’s Eight-Awe Command Text*.\n\nBy the **Jade Emperor’s decree**, it is bestowed upon the **Central Treasure-Effacing Cavern Pure Jade Precious Soul Primordial Elder Yellow Sovereign of One Qi**, commanding him to govern the **Central Imperial Heaven and Earth, sun, moon, stars, constellations, sacred mountains, spirit caves, water palaces, spring courts, and all high and exalted saints, true immortals, and all awe-inspiring spirits**. Where the **talisman-decree descends, all shall comply as decreed**.\n\nThe **divine incantation-decree received by the Western Seven-Treasure Golden Gate Luminous Sovereign Elder White Sovereign**:\n\n**Western Pure Heaven, the White Sovereign’s Seven Gates.**\n\n**Golden Spirits radiant, Taihua dispersing miasma.**\n\n**White stones towering, seven qi rising in vapor.**\n\n**Above, the Primordial Elder Great God emerged.**\n\n**Leading the Lung Qi, overseeing the Nine Heavens.**\n\n**Inspecting and verifying records, commanding the summoning of high immortals.**\n\nThe **Forty-Eight-Character White Sovereign’s Secret Text**, inscribed above the **Nine-Heaven Pure Spirit Official’s Northern Veranda**, governs the **summoning of immortal qi and elevating the Dao of immortality.**\n\n**Tai Bai inspects the Lung, Kui Lou guards the soul.**\n\n**Wei Mao Bi Li, governing the seven passes.**\n\n**Shen totals the Dipper’s apex, receiving the Northern Primordial’s talisman.**\n\nThe **Twenty-Four-Character Secret Text**, inscribed on the **Golden Gate Mysterious Window**, governs the **subduing of the White Sovereign’s celestial officials and rectifying the bright heavenly measurements.**\n\n**Scarlet Book’s Jade Characters, the Nine-Heaven Rectified Text.**\n\n**Subduing and summoning ten thousand qi, universally returning to the Celestial Lord.**\n\nThe **Sixteen-Character Secret Text**, inscribed in the **Nine-Heaven Golden Gate’s Three Diagram Hall**, governs the **subduing of the Six-Heaven Ghost Qi.**\n\nThe **Western Mountain Divine Incantation, Eight-Awe Seven Transmissions.**\n\n**Talismans summoning water dragons, clouds sent by mountains.**\n\n**All recorded and inspected, arriving together at the Imperial Gate.**\n\n**Assisting and guarding the High True Ones, slaying and extinguishing evil sources.**\n\n**If any inauspiciousness arises, it shall be severed by the Golden Pass.**\n\n**Scarlet Book talisman-decrees, transmitted by Wind-Fire Relay.**\n\nThe **Forty-Eight-Character Secret Text**, inscribed in the **Nine-Heaven Golden Gate’s Three Diagram Hall**, governs the **subduing of the Western Sea Water Sovereign, controlling the ten thousand monsters within the water, and the malevolent poisonous spirits**, summoning cloud dragons to prevent water and drought calamities.\n\nThis is the *Western Seven-Qi Soul-Precious Jade Chapter True Text*, totaling **one hundred and thirty-six characters**.\n\nAll are the **Supreme Most High Radiant Perfect Great Divine Incantation** of **emptiness and natural spontaneity**, also named the *Golden True Precious Bright Cavern Chapter*, also named the *Western Mountain Divine Incantation*, also named the *White Sovereign’s Eight-Awe Summoning-Dragon Text*.\n\nBy the **Jade Emperor’s decree**, it is bestowed upon the **Western Seven-Treasure Golden Gate Luminous Sovereign Elder White Sovereign of Seven Qi**, commanding him to govern the **western celestial and terrestrial realms, sun, moon, stars, constellations, sacred mountains, spirit caves, water palaces, spring courts, and all high and exalted saints, true immortals, and all awe-inspiring spirits**. Where the **talisman-decree descends, all shall comply as decreed**.\n\nThe **divine incantation-decree received by the Northern Cavern-Yin Lone Dark Absolute Five Spirits Mysterious Elder Black Sovereign**:\n\n**Northern Mysterious Heaven, five qi wandering.**\n\n**Within, the Black Sovereign, the Twin Sovereigns of Taiwei.**\n\n**Leading talisman-decrees, refining the Eight Awe.**\n\n**Green robes with feathered [ornaments], dragon patterns and phoenix robes.**\n\n**The Supreme Sovereign’s elevation, controlling arrival at the Jade Terrace.**\n\nThe **Forty-Character Black Sovereign Secret Scripture**, inscribed within the **Idle Single Boundless Primordial Purple Micro Northern Pavilion**, governs the summoning of all **true immortals and divine sages** through talismans and diagrams.\n\n**The Northern Dipper aids the kidneys, the Big Dipper guards the gate.**\n**The Female Void and Weighing Chamber open fourfold.**\n**The Seven Stars are gathered, seizing evil and rectifying wrong.**\n**Disaster is repelled, filth is swept away, the Dao is illuminated, and radiance moves.**\n\nThe **Thirty-Two-Character Secret Scripture**, inscribed within the **Heavenly Heart Northern Primordial Dipper**, governs the regulation of the northern celestial officials and rectifies the **Heavenly Qi**.\n\n**The Northern Mountain Divine Incantation** stirs the Yang, summoning thunder.\n**The flowing bells shine forth, the Azure Sky is steadied in its awe.**\n**The Northern Acres’ domain—ten thousand demons are annihilated and crushed.**\n\nThe **Twenty-Four-Character Secret Scripture**, inscribed upon the **Northern Cavern-Yin Lone Dark Absolute Boundless Primordial Terrace**, governs the subjugation of the **Northern Heavenly Demon Sovereign**, subduing malevolent spirits and ten thousand ghosts.\n**The Nine Rivers pour forth, the Bird Mother flies in flocks, the Qiao-Long clears the path, and the waterways open.**\n\n**Crimson script on jade tablets, borne by wind-dragon swiftness.**\n\nThe **Twenty-Four-Character Secret Scripture**, inscribed upon the **Northern Cavern-Yin Lone Dark Absolute Boundless Primordial Terrace**, governs the subjugation of the **Northern Sea Water Sovereign**, controlling the ten thousand spirits of the waters, summoning Qiao-Long, and summoning clouds to bring rain for its own sake.\n\nThis is the *Northern Five Qi Spirit Treasure Jade Chapter True Scripture*, totaling **one hundred twenty characters**. All are the **Most High Supreme Great Radiant Perfect Divine Incantation of the Void-Natural**, also named the *Native Command Purple Micro Primordial Spirit True Treasure Illuminating Scripture*, the *Northern Mountain Divine Incantation*, and the *Black Sovereign Eight Awe Heavenly Text*.\n\nBy the **Jade Emperor’s decree**, the **Northern Cavern-Yin Lone Dark Absolute Five Spirits Mysterious Elder Black Sovereign Five Qi Heavenly Lord** is granted authority to govern the northern **heavens and earths, sun, moon, stars, constellations, sacred mountains, spirit caves, water palaces, spring courts, all high and exalted saints, true immortals, and awe-inspiring spirits**. Where the talisman-decree descends, all shall comply as decreed.\n\nThe **Dao** speaks: This is the **Great Divine Incantation**—the **Primordial Beginning’s wondrous speech**, the **Jade Emperor’s true decree**, the **Upper Clarity Natural Sacred Scripture**, the **Nine Heavens’ nascent mystical tablet**, the **Void-Natural’s sacred chapter**, the **Supreme Sage’s secret words**, the **Jade Dawn’s exalted canon**. It establishes heaven and earth, unfolds ten thousand true ones, calms the spirits and steadies the divine, nurtures life and secures the people, rectifies the celestial revolutions, and preserves the heavens eternally.\n\nIt **controls the celestial mechanisms**, **oversees the Five Spirits**, **strategizes the earthly deities**, **summons the Yellow River’s source**, **directs the Yin-Yang transformations**, and **commands gods while dispatching immortals**. This is the **Ultimate True Mysterious Scripture**—divine response is natural, elevating heaven’s clarity, stabilizing earth’s firmness, and preserving the Five Sacred Peaks, ensuring all ten thousand things thrive.\n\nThe **Jade Emperor’s ancient scripture**, revered by the **Heavenly True One**, bears the **Self-Luminous Name**, inscribed upon imperial diagrams and tablets, illuminating future lives. This hidden text must not be casually glimpsed or heard. Those who obtain it shall **preserve the Ten Thousand Qi eternally**; through diligent practice and reverence, they shall attain divinity and immortality.\n\n---\n**Volume III: The Jade Emperor’s Merit and Virtue**\n\nAt that time, the **Jade Emptiness Supreme Emperor** spoke to the **Heavenly Venerable**:\n*\"May your compassion endure. May you benefit the Four Assemblies of Imperial Liberators, the Four Heavenly Kings, all celestial beings, all immortals, and all future beings who uphold this scripture for their benefit.\"*\n\nThe **Heavenly Venerable** replied to the **Jade Emptiness Supreme Emperor**:\n*\"How excellent your question! How virtuous you are!*\nIn compassion, you pity all beings and thus inquire of me.\"\n\nThe **Heavenly Venerable** said:\n*\"If there be a land in the Three Realms and Ten Directions—whether a kingdom’s ruler, ministers, or armies clashing in war—when pestilential qi spreads, or floods, droughts, locusts, or calamities bring famine, the king, queen, crown prince, prime ministers, and officials must, out of compassion for their people, **command all prefectures, counties, and magistrates** to **purify their halls, set great offerings, and recite the Dao six times daily**, turning this scripture. Thus shall their land be peaceful, the five grains abundant, and the people secure.*\n\n*\"If one enters mountains or forests and encounters venomous beasts, but **merely recalls this true scripture in thought**, the mountain spirits shall guard, and the beasts shall retreat, never harming them.*\n\n*\"If one enters rivers or seas to gather treasures, and encounters fierce winds, **reciting this true scripture as prescribed**, the winds and waves shall cease, and they shall reach shore safely.*\n\n*\"If in battle, when blades clash, **one silently recalls this true scripture**, the evil foes shall scatter.*\n\n*\"If imprisoned in shackles, **with a pure heart and steady mind, recalling this true scripture**, wrongs shall be righted, and liberation shall come.*\n\n*\"If tormented by malevolent spirits or demons, **reciting this true scripture as prescribed**, the evils shall flee, and healing shall follow naturally.*\n\n*\"If one seeks descendants, **revering and reciting this scripture as prescribed**, the **Jade Emperor’s decree** shall command the **Heavenly Tribunals** to inspect the **Dan Register**, and among the **Nine Ranks and Four Fruits of immortals**, those whose fate aligns shall be reborn to become their child—bright, eloquent, and noble among mortals.*\n\n*\"If a woman faces childbirth, **reciting this true scripture as prescribed**, mother and child shall be safe, bearing virtuous sons or daughters, beloved by all.*\n\n*\"If one seeks official promotion, noble rank, or favor from the sovereign, **reciting this true scripture as prescribed**, they shall ascend in office, their descendants honored, their lineage unbroken.\"*\n\nIf one seeks wealth and abundance, and **reveres and recites this true scripture as prescribed**, then treasures shall overflow, and sustenance shall come naturally. Blessings shall flow to their descendants, passed down through ten thousand generations.\n\nIf one is afflicted by malevolent stars, suffering in bed and couch, and **recites this true scripture as prescribed**, then these malevolent stars shall retreat, yielding auspicious fortune.\n\nIf one’s life is forfeit and they are destined for the underworld, their name recorded in the register of evils, then their parents, teachers, spouses, and children must **recite this true scripture** for them, or establish a Daoist ritual site with banners and floral offerings. Thus, the deceased’s ghostly records shall be erased, their spirit reborn in a pure land, and together with all suffering souls, they shall be protected and guided, attaining this supreme victory—all shall be born in heaven.\n\nMoreover, wherever this scripture resides, the **Ten Heavenly Sovereigns of Supreme Truth** and the **Limitless Flying Celestial Kings** shall always attend as guardians, offering reverence and sustenance.\n\nThose who uphold this scripture shall be entitled to call themselves **Orthodox One True Persons**. Such individuals, wherever they go, shall be invisibly protected by the **Supreme Saints of the Ten Directions**, the **Vajra Warriors**, as though guarding their own bodies. Whether entering or exiting, wherever they wander, all malevolent forces shall avoid their path, demons and ghosts shall be exterminated, spirits shall cower in hiding, and all calamities shall be powerless to approach.\n\nWhen such a person nears the end of their life, they shall not see the horrors of the underworld, but instead shall behold heavenly maidens bearing banners descending to welcome them, and they shall be born in heaven.\n\nWhen their heavenly blessings are exhausted and they are reborn in the mortal realm, they shall, across countless lifetimes, always be reborn as kings, great ministers, or sages, presiding over peaceful lands where the people prosper. They shall always retain their innate clarity, follow the Great Dao, and through successive cultivation, ultimately attain the Daoist path.\n\nSuch are the blessings bestowed upon those who uphold this scripture.\n\nFurthermore, if one who holds this scripture, when rain falls, arises with great compassion and, as prescribed, recites this scripture three times in its entirety toward the sky, then wherever the rain touches and in whatever direction they face, all beings—even those guilty of the five heinous and ten grave offenses, or bearing heavy sins—shall have their transgressions utterly erased. All grave illnesses shall be instantly cured.\n\nThese beings, upon death, shall not fall into the underworld but shall be reborn in pure lands, emerging from lotus flowers. How much more so for those who uphold this scripture itself.\n\nAgain, if one who holds this scripture walks the roads and encounters a great wind blowing, the dust that touches their body shall, wherever it lands, cause all beings to have their evil deeds utterly eradicated, sparing them from the three evil paths, and they shall be born in heaven.\n\nThus, the merits of upholding this scripture are unfathomable.\n\nIf such a person bathes in rivers, lakes, or the sea, the water that touches them shall, wherever it flows, cleanse all beings within—fish, turtles, and all aquatic creatures—of their sins.\n\nFor this lifetime alone, upon death, they shall no longer take rebirth in any form—whether as embryo, egg, or wet-born.\n\nWhatever words such a person speaks—whether good or evil—all heavenly demons and heterodox sects who hear them shall regard them as the pure sound of the law.\n\nIf such a person encounters a shrine, they may recite this scripture for the deities within. The ghosts and spirits who hear it shall escape the ghostly realm and ascend to the path of true immortality, revering this person as though they were the Emperor himself.\n\nIf one in this world is unfilial to their parents, disrespectful of the Three Jewels, guilty of killing, stealing, adultery, or false speech, and has committed the gravest offenses, and as they near death, if a virtuous and faithful being arises with great compassion and, while the dying still breathe, invokes the Emperor’s sacred name—whether for one, two, three, or four seven-day periods, up to a hundred or a thousand recitations—the deceased’s past misdeeds shall all be erased, and they shall avoid all evil destinies, ascending to the Ninth Heaven. How much more so for those who uphold this scripture.\n\nAgain, if one, from past eons to this very life, has cycled through the realms of humans and gods, drifting through the world with countless sins accumulated, and merely brushes against the shadow of one who upholds this scripture—or even hears their voice, as though receiving imperial edicts or comforting words from the Dao—their sins shall be permanently eradicated.\n\nIf one who upholds this scripture crafts a long banner inscribed with the Emperor’s name and hangs it on a tall pole, whether in a temple or a household, and the wind carries it, all beings in the direction it faces shall be blessed, and their evil deeds shall be utterly destroyed.\n\nIf one who upholds this scripture inscribes the Emperor’s name on any resonant object—bells, chimes, gongs, drums, or any Daoist ritual implements—whether used in ceremonies, performances, or carried by the wind, the sound they produce, near or far, shall purify all beings who hear it of their sins.\n\nIf one who upholds this scripture awakens to the nature of life and death, retreats into the mountains to cultivate the Dao, and gazes upon the world from afar, wherever their eyes rest—across mountains, forests, streams, and valleys—all living beings, visible and invisible, born of embryo, egg, or wetness, moving or still, flying or swimming, of every kind, shall have their sins permanently erased. Their body and mind shall be purified, and upon death, they shall be born in heaven. How much more so for those who uphold this scripture.\n\nKnow that such a person is the very embodiment of the Daoist Canon, a body of boundless merit.\n\nAt that time, the Celestial Sovereign spoke to the **Jade Emptiness Emperor**, saying: *\"Now I have spoken briefly, yet the wonders remain unexplained.\"*\n\nIf I were to expound at length, all who cling to heretical views and harbor doubts would remain in confusion and disbelief. The merits of this scripture transcend all kalpas and cannot be fully expressed.\n\nAt that time, the Jade Emptiness Emperor, upon hearing these words, rejoiced with a boundless heart, leaping with exhilaration. Gazing upon the Celestial Sovereign’s benevolent visage, he bowed deeply and chanted in praise:\n\n*\"Above the Nine Heavens lies the Great Luo,*\n*Where the Jade Capital and Golden Gates stand,*\n*Clouds piled high in majestic tiers.*\n*Within dwell the Heavenly Sovereigns,*\n*Renowned for mercy and harmony.*\n\n*The Dao is unrivaled, subduing all demons,*\n*Heaven’s treasures and sacred laws shine,*\n*With myriad gods and immortal hosts,*\n*Banners and flags unfurled in splendor.*\n*All who hear shall see their sins erased,*\n*Forever freed from the river of desire.*\n\n*This is the Jade Emperor,*\n*The Celestial Lord of the Vault of Heaven,*\n*Pure and radiant, wisdom and eloquence incarnate,*\n*The Supreme of the Dao,*\n*Teacher of the Three Realms,*\n*Primordial Ancestor of the Mystic One,*\n*None can surpass Him,*\n*The Merciful Father of the Four Births,*\n*The Highest Sage of the Upper Realms,*\n*The Great Benevolent One—*\n*Ten titles perfected,*\n*Ten thousand virtues embodied.*\n\n*He liberates countless beings,*\n*Rescuing them from the suffering of birth and death.\"*\n\nWhen the Jade Emptiness Emperor finished reciting this hymn and the Ten Titles, all the celestial hosts spoke in unison, marveling at what they had never before heard.\n\n**The *Highest Jade Emperor’s Original Conduct Scripture*, Volume Two**\n**Chapter Four: The Heavenly True Ones’ Protection**\n\nAt that time, the Celestial Sovereign of the Vault of Heaven, upon hearing the scripture’s teachings, rose from his seat and knelt long before the Emperor, addressing him: *\"O Jade Emperor, I humbly request permission to propagate this scripture’s benefits for all beings and celestial assemblies.\"*\n\nThe Jade Emperor, moved by compassion, opened the path of benefit and declared the sacred laws of the Jade Treasury, transmitting the *Lingbao* methods. He spoke to the Celestial Sovereign of the Vault of Heaven: *\"Listen carefully—I shall now expound upon the merits of upholding this scripture, its power to rescue the perishing, benefit the living and the dead, and perform divine wonders.\"*\n\nThe assembled immortals bowed in reverence and spoke in unison: *\"Your disciples today are fortunate to hear this eternal and abiding law. May it uplift the blessings of the Three Realms’ celestial hosts and dispel the poisons of the Three Lower Realms. We pray for Your compassion to unfold this wondrous meaning for our sake.\"*\n\nThe Emperor replied: *\"Should any being honor their parents, revere the Three Jewels, serve their ruler with loyalty, refrain from killing, stealing, lust, jealousy, anger, or malice, avoid arrogance and deceit, uphold precepts and observe fasts, cultivate the Dao with sincerity, and with reverence recite this scripture—I shall command the sands of the Western Regions to spread this teaching across the Ten Directions and the Boundless Worlds.\n\nI command the Eastern Heavenly Sovereign of Eastern Hua, with his green-clad celestial armies—innumerable in number—to descend and protect all who uphold this scripture.\nI command the Southeastern Sovereign of Fusan, with his retinue of celestial armies—innumerable in number—to descend and protect all who uphold this scripture.\nI command the Southern Sovereign of Zhuling, with his red-clad celestial armies—innumerable in number—to descend and protect all who uphold this scripture.\nI command the Southwest Sovereign of Taihua, with his retinue of celestial armies—innumerable in number—to descend and protect all who uphold this scripture.\nI command the Western Sovereign of Gaoling, with his white-clad celestial armies—innumerable in number—to descend and protect all who uphold this scripture.\nI command the Northwestern Sovereign of Huangtian, with his retinue of celestial armies—innumerable in number—to descend and protect all who uphold this scripture.\nI command the Northern Sovereign of Zimwei, with his black-clad celestial armies—innumerable in number—to descend and protect all who uphold this scripture.\nI command the Northeastern Sovereign of Chongxu, with his retinue of celestial armies—innumerable in number—to descend and protect all who uphold this scripture.\nI command the Central Sovereign of Kunlun, with his yellow-clad celestial armies—innumerable in number—to descend and protect all who uphold this scripture.\nI command the Upper Sovereign of Laihe, along with the mountain and cave immortals—innumerable in number—to descend and protect all who uphold this scripture.\nI command all the Golden Immortals of the Lower Realms, the Four Assemblies and Eight Departments, and their attendants—to descend and protect all who uphold this scripture.\nI command the Flying Heavenly Kings of the Ten Directions, the Great Flying Gods, the Three Officials and Four Saints, the Two Luminaries and Nine Stars, the Northern and Southern Dipper Constellations, the Eastern, Western, and Central Dipper Stars, the Twenty-Eight Lunar Mansions and the Celestial Hosts, the Vajra Warriors, and all divine kings with their retinues—to descend and protect all who uphold this scripture.\nI command the Demonic-Subduing Warriors, the Four Heavenly Gate Kings, the Five Sacred Mountains and Four Seas, the remaining mountains, the Four Oceans and Nine Rivers, the Twelve River Sources, and all rulers of mountains, forests, rivers, and marshes—to descend with their attendants and protect all who uphold this scripture, ensuring their safety in perilous places.\nI command all local land spirits, ditch and canal deities, and great ghostly kings of might—to protect all who uphold this scripture.\n\nLet all malevolent demons and heterodox forces be subdued, vanishing in fear, fleeing to distant skies or foreign lands. May all spirits summoned through mountain schemes, hall altars, blood offerings, or other rites self-destruct;\nMay the plague and pestilence spirits of the Five Directions, the hungry ghosts, the Wind King and water monsters, the malevolent dragons and demonic spirits, the earth and wood imps—all self-destruct;\nMay the Five Musts and Six Taboos, those who disrupt dreams, and practitioners of wild sorcery, curses, and poison—all self-destruct.\n\nFor those whose hearts harbor pure wishes, all desires shall be fulfilled.\nThose who uphold this scripture—whether they follow the prescribed rites, observe fasts, or possess pure precepts—yet hold it in faith and reverence, or even those who merely venerate this scripture alongside others who uphold fasts and pure precepts—all shall share in its protection.\"*\n\nThe virtues of such a person are boundless and unobstructed,\nfree and unrestrained—known as the Sage among mortals,\ntheir virtue and blessings ever renewed, equal to the Immortals.\n\nAt that time, the Celestial Sovereign of the Highest Heaven, upon hearing this,\ncomposed a song before the Celestial Assembly:\n\n*\"Great is the Dao of the Highest,\nFormless, nameless.\nVast through countless kalpas,\nThe Yellow Path opens clear.\nDivine and luminous,\nThe Nine Souls exhale their essence.\nThe Jade Void shines pure,\nThe Supreme Radiance ascends high.\nThe Jade Emperor’s transformation,\nUniversal salvation for Heaven and Earth.\nThe Three Primordials nourish the Dao,\nThe Two Symbols awe all life.\nSkillfully replanting ancient roots,\nWhat was withered blooms anew.\nThe sluggish stir to life,\nEternal transformation takes form.\nConceiving and gestating,\nAll attain birth.\nThe departed pass beyond,\nTheir spirits return to the Three Pure Ones,\nTheir souls receive the Chain of Degrees,\nAscending to the Southern Palace.\nThis day is most auspicious,\nAll are bathed in light.\nThe Five Degrees reflect their glory,\nProclaiming to all beings.\nTo the gods of Heaven and Earth,\nAnd the rivers’ sources.\nTo the Five Peaks and Four Seas,\nAnd the sacred mountains.\nTo the Caverns of Mystery and Emptiness,\nThe Caverns of Void and Immortality.\nTo the Supreme Saint of the Boundless,\nThe Most True and Noble Deity.\nBoundless and infinite,\nThey universally guide and save all beings.\nEvil roots are severed,\nNames recorded in the Mystic Capital.\nThe ranks of Immortals assemble,\nAll listen to the Emperor’s decree.\nThis is the Emperor’s edict,\nProtecting those who chant and uphold it.\nTo the utmost shores of the Dao,\nNo calamity shall intrude.\nI, by the Emperor’s command,\nProclaim this to all.\"*\n\nAt that time, the Celestial Sovereign of the Highest Heaven,\nhaving finished this song, addressed the Great Assembly:\n*\"This is the profound speech of the Jade Emperor,\nThe secret words of the Saints.\nThe path is cut off, the Dao is severed—\nSubtle and beyond thought,\nVast and all-encompassing,\nThe foundation of divine wisdom,\nGuarding the land and delivering beings from birth and death.\"*\n\nWhen the Celestial Sovereign spoke these words,\nThe gathered assembly, all reverent,\nGazed upward and attained enlightenment.\n\nThen the Heavenly Lord declared:\n*\"The Jade Emperor’s virtues are supreme,\nHis mysteries profound and deep.\nHe existed before the Great Calamity,\nHis transformations span ancient and modern times.\nNow I proclaim this wondrous scripture,\nOut of compassion for all sentient beings.\nThis is the most sublime of laws,\nThe foremost of virtues.\nThe name of the Great Radiant Sovereign,\nWhose power and virtue are unparalleled.\nHe can subdue violent demonic kings,\nAll bow their hearts in submission;\nHe can erase the gravest offenses,\nAll attain purity and justice.\nIf one hears this scripture,\nOr even the Emperor’s name,\nAnd bows in reverence,\nAll sins are annihilated.\nThe Ten Evils and Four Grave Offenses,\nThe Five Heinous Crimes against parents—\nWith but a single devout invocation,\nAll vanish at the sound.\nIt protects both heavenly and human hosts,\nFrom the Four Calamities and Five Decays.\nFrom the Three Realms’ extreme sufferings,\nFrom human misfortunes and disasters.\nFrom famine, plague, and poisonous drugs,\nFrom curses and malevolent spirits,\nFrom lawsuits and vengeful enemies,\nFrom battles and warfare’s torments,\nFrom the perils of wild mountains,\nFrom tigers, leopards, wolves, and hyenas,\nFrom venomous dragons of river and sea,\nFrom swift lightning, wind, and hail,\nFrom fire, thieves, and bandits,\nFrom sorcery and poisonous plots,\nFrom madness and loss of reason,\nFrom venomous snakes and noxious creatures,\nFrom malevolent demons and monstrous gods—\nAll who seek to harm,\nBy holding this true scripture,\nShall all disperse and perish.\nChronic illnesses, long endured,\nEven in dreams, bring no rest—\nNo unnatural death shall claim them,\nNo loss of treasures shall befall.\nThrough encountering this scripture,\nThey attain peace and freedom.\nAll desires and aspirations—\nWealth, treasures, and noble status—\nThrough this scripture’s virtues,\nShall be fulfilled as wished.\nThe divine power of the Immortal Sage,\nThe Eleven Lights of Virtue,\nThe Thirty-two Heavenly Lords,\nThe Twenty-eight Constellation Kings,\nThe Celestial Consorts and Jade Maidens,\nThe gods of Heaven and Earth,\nThe gods of the Three Realms and Void,\nThe Dragon Kings of rivers and seas,\nThe gods of water, fire, and wind,\nThe palaces and dwellings,\nThe mountains, forests, and trees,\nThe spirits of ditches, wells, and springs—\nAll, by upholding this scripture,\nShall protect and defend.\nFood and clothing shall come naturally,\nChildren shall dwell in wealth and honor.\nTheir words shall be heard with awe,\nAll shall revere them wherever they go.\nIf one seeks sons or daughters,\nAnd chants this true scripture,\nThe Emperor shall descend to the Celestial Bureau,\nRegistering them as Heavenly Immortals,\nCondescending to be reborn in their family,\nTo become their son or daughter.\nTheir descendants shall be noble and esteemed,\nSeven generations ascending to Immortality.\nTheir lineage shall flourish,\nBlessings extending to their parents.\"*\n\nThe blessings of auspiciousness shall ever flourish and thrive,\nWhile calamities and obstacles shall fail to intrude.\nTherefore, I now proclaim—\nThe assembly must listen with utmost care.\n\nWith boundless compassion, all shall attain the Upper Purity.\nThus, the Celestial Sage addressed the Four Assemblies:\n*\"All mortals who uphold and recite this scripture,\nWho receive and bear the Imperial Name,\nShall have deep Daoic roots and virtuous karmic ties from past lives.\nThis scripture is sublime and exalted,\nUniversal in its salvation of both heavenly and human beings.\nIf one devotes oneself with sincerity and reverence,\nTheir family and nation shall know peace,\nTheir life preserved, disasters averted,\nAll ill omens swept away.\n\nWhen emperors and kings uphold it,\nTheir realm shall know great harmony,\nBandits and tyrants shall be pacified,\nBorderlands shall know no strife.\nThe common folk shall sing in joy,\nAnd the land shall flourish in prosperity.\nAs the cosmic cycles turn,\nThe true Dao shall prevail.\nThose who attain this scripture—\nHeaven’s essence is profound and weighty;\nGuard it, guard it well.\n---\n**Section Five: Divine Retribution and Verification**\n\nAt that time, the True Persons of Compassionate Liberation, Seeking-Voice for Suffering, Saving-Life from Death, and Ten-Thousand Blessings for Protection—\nAll rose from their seats, stepping beyond their ranks,\nAnd together addressed the Celestial Sage:\n*\"If the common folk of the degenerate age,\nThough they may have past virtuous ties,\nEncounter this scripture yet are defiled by malevolent obstacles,\nTheir doubts—both origin and end—\nShall cause them to disbelieve in its merits.\nWhat retribution, then, shall they suffer in the hells of the past or present?\nWe humbly pray for Your Holiness\nTo expound upon their suffering in the evil destinies.\"*\n\nThe Celestial Sage then spoke to the Four True Persons:\n*\"If the world’s fierce, violent, and wicked beings,\nDay and night before Daoic images,\nHold no reverence, uttering blasphemies,\nTheir crime shall cast them into the Five Uninterrupted Hells.\nBut if they meet one who upholds this scripture,\nAnd through skillful means is led to repent,\nEven if their wicked hearts are but momentarily extinguished,\nAnd they take faith in this scripture,\nTheir sins shall be utterly purged without remainder.\n\nYet if there are those with perverse views and foolish obstinacy,\nSeeing one who holds this scripture,\nThey may harbor malice, cast sidelong glances,\nOr even conceive a single evil thought,\nUtter a single evil word,\nAnd slander those who uphold this scripture—\nTheir offense is such that, after death,\nThey shall fall into the Great Hell,\nWith no hope of escape.\nHow much more so for those in the world\nWho, though they encounter this scripture,\nGenerate no reverence,\nDefile it with unclean hands,\nRecite it with unclean mouths,\nPlace it upon impure beds,\nOr read it aloud in jest,\nTreating it as common scripture.\nSuch persons, after death,\nShall descend into the Uninterrupted Hell,\nWith no hope of escape,\nTheir misfortunes extending to nine generations,\nSubjected to torments in the Underworld’s prisons.\nTheir descendants shall be ensnared in suffering,\nEnduring uncountable eons of torment in hell,\nEncountering countless sages who rescue them,\nTheir sins slightly diminished.\nWhen rescued by a sage, they shall be reborn as hungry ghosts,\nSuffering for countless eons without even the name of water.\nFrom the ghostly realm, they shall be reborn as beasts,\nAnd from beasts, as humans—\nYet even then, as barbarians or heretics,\nOr as women in poverty and wretchedness,\nStricken with a hundred ailments,\nAbandoned by all, unable to live or die.\nThus, to slight this scripture brings such retribution.\n\nAgain, if one initially takes faith but later grows negligent,\nThe Virtuous Boys shall report them to the Three Officials,\nTheir names added to the Black Register,\nTheir merits subtracted from the Green Ledger.\nAfter death, they shall be imprisoned in the Netherworld,\nTraversing the Three Realms without escape.\nOr in this life, they shall suffer myriad diseases—\nLeprosy, scabs, and festering sores—\nAs karmic fruit.\nDay and night, they shall be tormented by sorrow,\nTheir bodies ravaged by sudden violence;\nOr imprisoned in chains, wrongfully harming themselves,\nOr mistakenly consuming poison;\nOr devoured by tigers, wolves, or venomous serpents,\nOr slain by enemies in vengeance;\nOr, wandering in forests, meeting bandits who slaughter them,\nHurl them from cliffs;\nOr harmed by malevolent spirits and goblins,\nOr burned and drowned by fire and water,\nOr slaughtered by blades and weapons.\nTo slight this scripture brings untimely death,\nSuch is their fruit, such their retribution.\nHow can one not grieve? How can one not lament?\n\nTherefore, I warn you—\nFollow this path with devotion,\nNurture no evil thoughts.\nIf no evil thoughts arise,\nAll entanglements shall cease,\nAnd defilements as vast as dust shall dissolve with the mind.\nAll calamitous demons shall be naturally extinguished.\nThe merits of this scripture are unfathomable.\nIt is the supreme, unparalleled, wondrous law,\nThe sovereign of all scriptures,\nOf great benefit.\n\nLet no commoner reveal it.\nIf heavenly and human beings,\nFacing decline and decay, the wheel of rebirth pressing in,\nCan abandon delusion and uphold this scripture,\nThey shall naturally summon celestial blessings,\nTheir lifespan extended, transcending the Three Realms,\nAnd abide with the Dao eternally.\n\nThis scripture is unmatched, unsurpassed.\nIt is the Great Powerful and Great Divine Spell,\nCapable of making withered branches sprout leaves and fruit,\nFlourishing and abundant,\nAble to eliminate the gravest sufferings of beings,\nAnd grant longevity to those with short lives.\nIts merits are unfathomable, beyond all praise.\n\nIf one lacks past Daoic roots,\nOr has not cultivated vast merit,\nEven the name of this scripture may not be heard—\nHow much less shall they see it?\nFor this scripture follows the true patterns of the Three Caverns,\nTransmitted but once in eighty thousand eons.\nIt is the treasure of the Most Pure and Supreme Sage of the Celestial Capital,\nSecreted within the Jade Capital’s Golden Gate Palace,\nExceedingly subtle and rare,\nDifficult to encounter.\nOnly those with innate Daoic essence—\nFuture Nine-Heaven True Immortals—\nShall, by fate’s design,\nReceive it from their master after oaths of allegiance,\nAnd only then may they inherit its transmission.\"\n\n**Translation:**\n\n*\"Do not reveal this lightly—revere it and guard it carefully.*\n\nThen, the Celestial Sage expounded this truth and spoke in verse:\n\n*If the waters of the Yangtze and Yellow Rivers*\n*Could sprout lotuses from their waves,*\n*If the raven’s feathers turned as white as snow,*\n*Still, this scripture would be as rare to encounter.*\n\n*If tortoises grew fur,*\n*Fit for weaving into robes,*\n*If moonlight could melt ice in the night,*\n*Still, this scripture would be as rare to encounter.*\n\n*If mosquitoes had feet,*\n*Strong enough to build bridges and boats,*\n*And could bear all heavy loads,*\n*Still, this scripture would be as rare to encounter.*\n\n*If young sparrows could carry the Five Peaks,*\n*Hurl them to distant lands,*\n*Still, this scripture would be as rare to encounter.*\n\n*If a single-leaf boat*\n*Could bear the weight of Kunlun,*\n*And sail the great sea,*\n*Still, this scripture would be as rare to encounter.*\n\n*If leeches grew teeth,*\n*As large as elephant tusks,*\n*Still, this scripture would be as rare to encounter.*\n\n*If broom and hemp leaves*\n*Could cover the boundless realms,*\n*Shading all beings without end,*\n*Still, this scripture would be as rare to encounter.*\n\n*If owls and kites*\n*Nested together in one tree,*\n*And fed each other with shared prey,*\n*Still, this scripture would be as rare to encounter.*\n\n*If rabbits grew horns,*\n*Fit for ladders to the heavens,*\n*And reached the highest peaks,*\n*Still, this scripture would be as rare to encounter.*\n\n*If shrews climbed those horned ladders,*\n*And ate the moon in the sky,*\n*Still, this scripture would be as rare to encounter.*\n\n*If donkeys’ lips turned*\n*The color of the *pīngpó* fruit,*\n*And they could sing and dance,*\n*Still, this scripture would be as rare to encounter.*\n\n*If flies could drink from stone jars,*\n*And drown in wild intoxication,*\n*Still, this scripture would be as rare to encounter.*\n\nAt that time, the Celestial Sage finished speaking the verse and declared to the Four Assemblies:\n\n*Thus, those who hold this scripture*\n*Are called the **Body of Virtue**—*\n*All beings benefit from its shade.*\n\n*Those who hold this scripture*\n*Are called the **Body of Mystic Power**—*\n*All auspiciousness gathers around them.*\n\n*Those who hold this scripture*\n*Are called the **Pure Body**—*\n*No evil deed can harm them.*\n\n*Those who hold this scripture*\n*Are called the **Body of Might and Virtue**—*\n*Heavenly demons and false paths cannot ensnare them.*\n\n*Those who hold this scripture*\n*Are called the **Body of the Unequaled**—*\n*The Sovereigns of Heaven sing in praise,*\n*And all spirits revere them.*\n\n*Those who hold this scripture*\n*Are called the **Body of Firmness**—*\n*No calamity or great disaster can diminish them.*\n\n*Those who hold this scripture*\n*Are called the **Body of the Daoic Treasury**—*\n*When words issue from their mouths,*\n*Ghosts and spirits bow in awe.*\n\n*Those who hold this scripture*\n*Are called the **Body of Compassion**—*\n*All beings in the Six Realms rely on its goodness.*\n\n*Those who hold this scripture*\n*Are called the **Body of the Great Dao**—*\n*Wherever they go, there is no fear.*\n\n*Those who hold this scripture*\n*Are called the **Body of the Skilled Physician**—*\n*They practice wondrous methods,*\n*Bringing ease and joy to all.*\n\n*Those who hold this scripture*\n*Are called the **Body of Radiance**—*\n*They are ever the Emperor’s light,*\n*Illuminating all they encompass.*\n\n*Those who hold this scripture*\n*Are called the **Body of Freedom**—*\n*They wander the celestial palaces,*\n*Their spirits unbound.*\n\n*The merits of this scripture are beyond measure.*\n\n*Moreover, if a Daoist adept,*\n*Having purified themselves,*\n*Wears new, clean robes,*\n*And at midnight, in solitude,*\n*In a quiet chamber,*\n*Knocks their teeth nine times,*\n*Sits facing east,*\n*And recites this scripture—*\n\n*Then, the Most Pure Sovereign takes their seat,*\n*The Jade Consort sweeps the hall,*\n*The myriad spirits assemble in ranks,*\n*The celestial hosts stand at attention,*\n*The Three Realms guard in attendance,*\n*And the Five Emperors oversee the welcome.*\n\n*Then, closing their eyes and stilling their mind,*\n*They visualize this scripture,*\n*And unknowingly find themselves within the Five Clouds.*\n*Suddenly, their body shines brightly,*\n*Ascending to the celestial palaces,*\n*Where the Immortals descend to greet them.*\n*Whatever they request is granted,*\n*And wondrous elixirs and treasures appear at will.*\n\n*Thus, one must focus their heart and follow this scripture’s methods.*\n*Even the Three-World Golden Immortals and the Ten-Direction Great Sages*\n*All depend on this scripture for their cultivation and attainment,*\n*And thereby swiftly realize the Supreme Wondrous Dao.*\n\n*This is the Emperor of all—*\n*The Teacher of the Buddhas,*\n*The King of the Saints.*\n\n*Therefore, even ordinary mortals who encounter this scripture*\n*Shall be aided by the Five Emperors,*\n*Summon spirits and immortals,*\n*Command the celestial palaces,*\n*Direct the forces of yin and yang,*\n*Receive reverence from the myriad True Ones,*\n*And cause all spirits to submit.*\n*All malevolent forces flee,*\n*And demons bind their forms.*\n*After death, they ascend to the Southern Palace for refinement,*\n*Walk the Flying Steps to Upper Purity,*\n*And dwell in boundless freedom,*\n*Living eternally with the Dao.*\n\n*Furthermore, if even worldly beings*\n*Have once heard this scripture*\n*And long for it with devotion,*\n*And in their homes choose a pure place,*\n*Paint the Emperor’s likeness,*\n*And with sincere reverence,*\n*Morning and evening offer incense, flowers, lamps, and fruit,*\n*Honoring and venerating the name—*\n\n*Such a person shall attain thirty kinds of supreme merit:*\n1. *The praise of the Immortals,*\n2. *The rebirth of the deceased in heaven,*\n3. *Liberation from past misfortunes,*\n4. *Smooth passage in all endeavors,*\n5. *Freedom from thieves and robbers,*\n6. *All desires fulfilled,*\n7. *Avoidance of water and fire calamities,*\n8. *The dissolution of hostile affairs,*\n9. *Auspicious dreams at night,*\n10. *No sickness or illness,*\n11. *Wisdom and clarity,*\n12. *The joy of all who see them,*\n13. *Abundant food and clothing,*\n14. *Honored and noble descendants,*\n15. *The delight of relatives,*\n16. *Harmony in their clan,*\n17. *Escape from the three evil retributions,*\n18. *Transformation from female to male,*\n19. *Graceful and dignified appearance,*\n20. *Appointment as a great minister of the realm,*\n21. *Birth as an emperor,*\n22. *The reverence of ghosts and spirits,*\n23. *Knowledge of past lives,*\n24. *The protection of all spirits,*\n25. *The blessings of the nine clans,*\n26. *A long life in this world,*\n27. *The reliance of all sentient beings on their goodness,*\n28. *The welcome of the Demon Kings,*\n29. *Transcendence beyond the Three Realms,*\n30. *Ascension in broad daylight.*\n\nAt that time, the Celestial Sage again declared to the Four Assemblies:\n\n*This scripture’s merits*\n*Can shatter iron-enclosed mountains,*\n*Drain the苦海 of suffering,*\n*Break the Great Hell,*\n*Extract the deepest sins,*\n*Subdue violent demon-kings,*\n*Protect all lands,*\n*Extinguish all malevolent ghosts,*\n*Remove all grave illnesses,*\n*Dissolve all poisons,*\n*Free one from all wicked men,*\n*Tame all venomous beasts,*\n*Crush all heretical paths—*\n*And all the celestial hosts*\n*Shall bow in submission.\"*\n\nThe remaining virtues are beyond measure.\n\nAt that time, the gathered assembly of the Dao/Way, the Golden Immortals and Bodhisattvas, and the true saints and their consorts, upon hearing these words, rejoiced and leapt in delight, bowed in reverence, and composed this hymn:\n\n*\"Great is the Supreme Dao/Way,\nWithout sect or ultimate truth.\nAbove, it transcends all celestial realms;\nBelow, it rescues the lost spirits.\nIt has no master or ancestor—\nThe Dao/Way itself is the body.\n\nIn the Dan Platform and Purple Bureaus,\nAt the Golden Gates and Jade Capitals,\nThis wondrous law is concealed,\nBestowing boundless blessings upon all living things.\n\nIt extinguishes my ten thousand sins,\nAnd prolongs my boundless years.\n\nTen thousand spirits pay homage,\nAnd the Demon Kings welcome in protection.\n\nIts virtues flourish grandly,\nRecorded in the Yellow Register of Merit.\nThrough countless eons, it grants me eternal life.\"*\n\nThus, the assembly having recited this hymn, bowed in homage and took refuge, then respectfully withdrew.\n\n*The Highest Jade Emperor’s Original Conduct Scripture, Volume Two, ends.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "高上玉皇本行集经（一） 经名：高上玉皇本行集经。 简称《玉皇经》。 撰人不详，约出於隋唐间。 假托元始天尊演说玉皇修道证仙故事，及诵念玉帝经咒之功德果报。 三卷。 底本出处：《正统道藏》洞真部本文类。 卷上　清微天宫神通品第一 尔时，元始天尊在清微天中玉京金阙七宝玄苑玉皇宫殿，升光明座，与无鞅数众宣说灵宝清净真一不二法门。 是时玉皇尊帝，与诸真圣、飞天大圣、无极神王、灵童玉女九千万人，清斋建节，侍在侧焉。 于时玉帝知时欲至，即於会前举六通力，放大光明，徧照诸天，无极梵剎一切境界，皆大震动； 十方无极一切世界，俱同瑠璃玻璃，无有隔碍； 十方来众，并乘五色琼轮琅舆碧辇、九色玄龙、十绝羽盖，麟舞凤唱，啸歌嗈嗈，灵妃散花，金童扬烟，赞咏洞章，浮空而来。 是时梵天一切金仙、大乘菩萨、四众八部，承斯光照，皆乘金碧九霞流景飞云玉舆，庆霄四会，三辰吐芳，飞香八奏，旋绕道前，雨众妙花，如云而下，遍覆会前。 是时其光徧照诸天，下烛下方无极世界，同玄都境。 凡彼人间，上近九天，通接交连，至亲至迩。 凡彼下方无极世界，山陵坡坂，沟涧溪谷，缅平如掌，六合至迩，三境非遥。 天宝台殿，星罗人间，琼瑰罗列，朗耀云衢，七宝栏楯，以界道路，玉树仙花，蒨灿珠实，景秀丹田，芝草绵覆。 时彼下方，皆见诸天。 钧天妙乐，随光旋转，自然振响。 又复皆见鸾啸凤唱，飞鸣应节，龙戏麟盘，翔舞天端。 诸天宝花，零乱散落，徧满道路。 是时凡圣骇异，幽暗开光，天人悦庆，踊跃欢忻，凡夫学士，尽得飞升，仰观劫仞宝台，俯眄紫云弥罗。 是诸世界一切人民，咸臻道炁，白首面皱，皆得化度，绀发朱颜、少壮幼稚，转得形容，光泽美好，苦恼痊平，普蒙解脱，安乐快然。 天下歌谣，欣国太平。 当尔之时，神风遐着，万炁扬津，天震地裂，枯骨更生，沈尸飞魄，皆起复形，酆都铁围、长夜九幽，即时破坏，地狱苦魂，化生诸天，三恶道苦，一时解脱。 时诸罪辈，以斯光力，得生十方诸大天宫。 尔时，玉皇即分其身，徧於十方诸大天宫，令诸天宫自然化现，白玉为京，黄金为阙，七宝玄苑大光明殿具光明座，幢节旛盖，异宝奇花，徧布是处。 尔时，玉皇即以所分之身，徧於是处，白玉京中黄金阙内，七宝玄苑大光明殿光明座上，普为十方演说清净解脱之道。 时化玉帝，各以无量天真大圣、妙行真人、灵妃玉女侍列左右。 是诸玉女颜容妹妙，端丽奇特，天珍异宝，庄严身相，言音清彻，众所乐闻。 如是诸女，其身复出微妙解脱自然之香。 是香芬馥，周徧诸天极妙乐土诸大地一切福处。 六道一切众生闻是香者，普蒙开度。 所谓天道、人道、魔道、地狱道、饿鬼道、畜生道。 若诸天道，一切天人或有能闻是此香者，五衰四相，永得除灭，转增天福。 若诸人道，王臣兆庶或有能闻是此香者，即得人天长寿之乐，身或灭度，乃得脱壳尸解之道。 若诸魔道，一切诸魔或有能闻是此香者，安处天宫，国战之苦，各得休息。 若诸地狱道，一切众生或有能闻是此香者，离地狱苦，得 净土乐。 若诸饿鬼道，一切饿鬼等或有能闻是此香者，即得饱满，无饥渴恼。",
      "translated_text": "**The Scripture of the Highest Supreme Jade Emperor’s Original Conduct (Volume 1)**\n*Title:* **The Scripture of the Highest Supreme Jade Emperor’s Original Conduct** (abbreviated as *The Jade Emperor Scripture*)\n*Author unknown; likely composed during the Sui-Tang period.*\n*Attributed to Yuan Shi Tianzun expounding the Daoist cultivation and ascension of the Jade Emperor, as well as the merits and rewards of reciting the Jade Emperor’s scriptures and incantations.*\n*Three volumes. Source text: The *Zhengtong Daozang*, *Dongzhen* section, *Benwen* category.\n\n---\n\n**Volume One: The Chapter of Divine Prowess in the Qingwei Celestial Palace**\n\nAt that time, Yuan Shi Tianzun sat upon the Radiant Seat in the Qingwei Celestial Palace, within the Seven-Treasured Mysterious Gardens of the Jade Emperor’s Golden Threshold in the Jade Capital of the Uppermost Realm. There, He expounded the *Lingbao* doctrine of Pure, Immaculate, True, and Undivided Dao to countless assemblies of the *Wu Yang* multitudes.\n\nThe Jade Emperor, in His august presence, stood with the myriad True Saints, the Flying Celestial Saints, the Gods of the Boundless, and the Nine Thousand Myriads of Spirit Boys and Jade Girls. They observed strict fasting and ceremonial rites, attending at His side.\n\nWhen the time drew near, the Jade Emperor manifested His Six Transcendent Powers, emitting boundless radiance that illuminated all the heavens and the Boundless Brahman abodes—every realm trembled in response. The ten directions of the Boundless worlds became as transparent as crystal and glass, with no obstruction between them. The assemblies from all directions arrived, riding five-colored jade wheels, lingyus, and emerald palanquins, nine-hued dark dragons, and ten-perfect feathered canopies. The phoenixes danced, the dragons sang, their melodious cries resounded, while Spirit Consorts scattered flowers and Golden Boys wafted incense. They chanted sacred hymns, floating through the air to the assembly.\n\nAt that moment, the Celestial Brahmans and all the Golden Immortals, the Great Vehicle Bodhisattvas, and the Four Assemblies of the Eight Departments—bathed in this radiance—rode upon golden clouds, nine-hued misty carriages, and jade palanquins, circling in the four celestial gatherings. The Three Celestial Luminaries exhaled fragrance, and the Eight Harmonious Melodies played as they revolved before the Dao. A shower of wondrous flowers descended like clouds, covering the entire assembly.\n\nThis radiance illuminated all the heavens and the lower Boundless worlds, merging with the Pure Capital’s domain. Even the mortal realm, reaching up to the Nine Heavens, became intimately connected. The lower Boundless worlds—mountains, ridges, valleys, and ravines—lay flat as the palm, with the six directions now near and the three realms no longer distant.\n\nThe Celestial Treasures Platforms dotted the mortal world, their jade and rare gems arrayed in splendor, shining along the cloudy thoroughfares. Seven-Treasured railings marked the paths, and jade trees with resplendent fruits and flowers flourished in the Vermilion Fields, their luster surpassing all.\n\nAt that time, even the lower realms beheld the heavens. The divine music of the Pin Heaven resounded spontaneously, its vibrations filling the air. They also heard the cranes’ cries and the phoenixes’ songs, their harmonious calls in perfect rhythm, while dragons danced and unicorns coiled in aerial grace. The celestial treasure flowers scattered across the paths, filling every road.\n\nThen, both mortals and immortals were astonished, their darkness dispelled by light. Celestial beings and humans rejoiced, leaping in delight. Even the common scholars ascended, gazing upward at the towering treasure platforms and downward at the vast purple clouds.\n\nAll the peoples of these worlds attained the Dao’s *qi*, their aged faces wrinkled and graying transformed into youthful radiance—blue-black hair turned crimson, their forms renewed in beauty. Their suffering vanished, and they were universally liberated, dwelling in perfect bliss. Across the land, songs of joy celebrated the Great Peace.\n\nAt that moment, the divine winds blew far and wide, the ten thousand *qi* surged, the earth trembled and split, and even the bones of the dead regenerated. Sunken corpses and wandering spirits rose anew. The Iron Enclosure of the Underworld and the Nine Dark Nights of eternal night were instantly shattered. The tormented souls of hell were reborn in the heavens, and the sufferings of the Three Evil Paths were all relieved.\n\nAt that time, even the guilty were, by this radiance’s power, born into the great celestial palaces of the ten directions.\n\nThe Jade Emperor then divided His body, manifesting in each of the ten-directional great celestial palaces. There, the palaces naturally transformed—white jade became the capital, yellow gold the threshold, and the Seven-Treasures Mysterious Gardens housed the Great Radiant Hall with its Radiant Seat. Banners, flags, and canopies of rare treasures and wondrous flowers adorned the place.\n\nThe Jade Emperor, through His divided forms, sat upon the Radiant Seat within the Golden Threshold of the White Jade Capital, the Seven-Treasures Mysterious Gardens, and the Great Radiant Hall. There, He universally expounded the Dao of Pure Liberation to the ten directions.\n\nThe transformed Jade Emperors, each attended by countless Heavenly True Saints, Marvelous Conduct Immortals, and Spirit Consorts and Jade Girls, stood at their sides. These Jade Girls possessed exquisite, peerless beauty, their features adorned with celestial rarities and treasures. Their voices were clear and melodious, delighting all who heard.\n\nMoreover, their bodies emitted a subtle, natural fragrance of liberation. This scent permeated the Boundless lands of the heavens and all the fortunate places of the great earth. All beings of the Six Paths who smelled it were universally enlightened—whether the Path of Heaven, the Path of Humans, the Path of Demons, the Path of Hell, the Path of Hungry Ghosts, or the Path of Beasts.\n\nFor those on the Path of Heaven, all celestial beings who heard this fragrance saw their Five Decays and Four Marks vanish, their heavenly blessings eternally increased.\n\nFor those on the Path of Humans, kings, ministers, and commoners who heard it attained the joys of human and celestial longevity. If their bodies perished, they achieved the *tuoké* liberation of the empty shell.\n\nFor those on the Path of Demons, all demons who heard it found rest in celestial palaces, free from the sufferings of war.\n\nFor those on the Path of Hell, all beings who heard it escaped the torments of hell and attained the bliss of Pure Lands.\n\nFor those on the Path of Hungry Ghosts, all hungry ghosts who heard it were sated, their hunger and thirst no longer tormenting them.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1219,
      "start_sentence": 0,
      "end_sentence": 39,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 15.029874563217163,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\高上玉皇本行集经（唐佚名）.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "若诸畜生道，一切畜生或有能闻是此香者，脱畜生苦，得智慧乐。 尔时，诸生天罪众，既得生是胜天宫已，缘承慈光摄受之故，便得觉悟，各各明了罪福因缘，与诸眷属作天伎乐，来诣帝前。 是诸众等，各各含悲，俱发声言，前后经千劫万劫，不见三光，常处黑暗三恶道中，多受苦恼。 伏蒙玉帝方便放光，愍救我等，皆生天上。 是诸恶业，悉皆灭尽，无诸系滞，皆得往生。 仰朝玉帝，各到道场。 是诸生天一切罪众，说是语已，稽首复位。 尔时，玉帝出大妙音，普告十方诸天圣众：汝等谛听，此诸罪辈，旷劫以来，纵无明性，造十恶业，六尘徧染，三业萦缠，肆意任心，曾无觉悟。 阴罪阳过，日积月深，背道违真，顺邪弃正，举心运念，动结愆尤。 遂使命过之后，身落三涂，不得解脱。 若非今日遇是法筵，何由出离？ 尔时，诸天化身玉帝，即以神通，不动其所，移接天人，皆令得至清微天宫玉清圣境元始会下，是诸众等，不觉不知。 是时天尊众会，见是十方玉帝化身，普皆来集天尊会前，如无边明镜，照诸影像，互相容入。 时诸大众，稽首瞻仰。 玉帝化身，圣中最尊，增长清信，益加志乐，心无退转，起大坚固。 时诸天人迩得生天，忽睹天尊，胜会道场，清 净第一，无为功德之所庄严，踊跃欢喜，一时作礼，叹未曾有。 尔时，十方诸化玉帝，俱复一体，从法座起，北向长跪。 天尊言曰：往昔去世，有国名号光严妙乐，其国王者名曰净德。 时王有后，名宝月光。 其王无嗣，尝因一日作是思惟，我今将老，而无太子，身或崩殁，社稷九庙，委付何人。 作是念已，即便敕下，诏诸道众於诸官殿，依诸科教，悬诸旛盖，清 净严洁，广陈供养，六时行道，徧祷真圣。 已经半载，不退初心。 忽夜宝月光皇后梦太上道君与诸至真，金姿玉质，清净之俦，驾五色龙舆，拥耀景旌，荫明霞盖。 是时太上道君安坐龙舆，抱一婴儿，身诸毛孔放百亿光，照诸宫殿，作百宝色，幢节前导，浮空而来。 是时皇后心生欢喜，恭敬接礼，长跪道前，白道君言：今王无嗣，愿乞此子为社稷主，伏愿慈悲，哀愍听许。 尔时，道君答皇后言：愿特赐汝。 是时皇后礼谢道君，而乃收之。 皇后收已，便从梦归，觉而有孕。 怀胎一年，于丙午岁正月九日午时诞于王宫。 当生之时，身宝光焰，充满王国，色相妙好，观者无厌。 幼而敏慧，长而慈仁，于其国中所有库藏、一切财宝，尽将散施穷乏困苦、鳏寡孤独、无所依怙、饥馑癃残一切众生，仁爱和逊，歌谣有道，化及遐方，天下仰从，归仁太子，父王加庆。 当尔之后，王忽告崩，太子治政，俯念浮生，告敕大臣，嗣位有道，遂舍其国，於普明香严山中修道，功成超度。 过是劫已，历八百劫，身常舍其国，为群生故，割爱学道。 於此后经八百劫，行药治病，拯救众生，令其安乐。 此劫尽已，又历八百劫，广行方便，启诸道藏，演说灵章，恢宣正化，敷扬神功，助国救人，自幽及显。 过此已后，再历八百劫，亡身殒命，行忍辱故，舍己血肉。 如是修行三千二百劫，始证金仙，号曰清 净自然觉王如来，教诸菩萨，顿悟大乘正宗，渐入虚无妙道。 如是修行，又经亿劫，始证玉帝。",
      "translated_text": "For those on the **Path of Beasts**, all beasts who heard this fragrance escaped the sufferings of animal existence and attained the joy of wisdom.\n\nAt that time, all the sinful beings born in heaven, having already been reborn in this supreme celestial palace, through the grace of the compassionate light’s guidance, awakened and clearly understood the causes and effects of sin and virtue. They performed celestial arts with their retinues before the Emperor and paid homage.\n\nThese beings, filled with sorrow, spoke in unison: *\"For countless kalpas and myriads of kalpas, we saw no sun, moon, or stars, dwelling always in darkness within the Three Evil Paths, enduring endless torment. By the Emperor’s compassionate light, we were rescued and born into heaven. Our evil deeds are now all extinguished, with no more bonds—we have attained rebirth.\"*\n\nThey then knelt and bowed before the Jade Emperor, arriving at the Dao field. After speaking thus, they prostrated themselves and returned to their seats.\n\nThe Jade Emperor then emitted a wondrous voice, addressing all the sacred assemblies of the ten directions: *\"Hear me well! These sinful beings, for eons without wisdom, committed the Ten Evils, defiled by the Six Dusts, entangled by the Three Karmas, indulging their hearts without awakening. Their hidden and manifest sins accumulated day by day, abandoning the Dao and betraying truth, following evil and rejecting righteousness. Every thought and intention bound them further. Thus, after death, they fell into the Three Realms, unable to escape. Had they not encountered this Dharma feast today, how could they have liberated themselves?\"*\n\nAt that moment, the Jade Emperor’s transformation body, without moving from his place, used divine power to transport all the heavenly and human beings to the Pure and Refined Heavenly Palace of the Jade Purity Sacred Realm beneath the Primordial Assembly. These beings were unaware of the journey.\n\nWhen the Heavenly Worthy and the assembly saw the ten-directional Jade Emperors’ transformation bodies gather before the Heavenly Worthy’s assembly, they shone like boundless mirrors reflecting countless forms, merging seamlessly. The great assembly then bowed in reverence.\n\nThe Jade Emperor’s transformation body, most exalted among the saints, grew in pure faith and joy, his resolve unshaken, his heart unyielding. The heavenly and human beings, newly born in heaven, suddenly beheld the Heavenly Worthy in this supreme Dao field, adorned with the merit of non-action, pure and first among all. Overwhelmed with joy, they prostrated themselves in homage, exclaiming in wonder.\n\nThe ten-directional transformation Jade Emperors then merged into one body, rose from their seats, and knelt northward.\n\nThe Heavenly Worthy spoke: *\"In a past age, there was a kingdom named Light-Strong and Wondrous-Joy. Its king was named Pure Virtue. The king had a queen named Treasure-Moonlight. Since the king had no heir, one day he pondered: ‘I am aging, yet have no prince. When I die, who will inherit the throne and temples?’ After this thought, he issued an edict to all Daoist assemblies in the palaces, following the rites, hanging banners, and making offerings in purity. For half a year, he never wavered in his devotion.\n\nOne night, Queen Treasure-Moonlight dreamed of the Most High Dao Lord and the Perfect Ones, their forms golden and jade-like, pure and refined, riding a five-colored dragon carriage, surrounded by radiant banners and canopies of misty clouds. The Most High Dao Lord sat in the carriage, holding an infant whose pores emitted a hundred billion lights, illuminating the palaces in a hundred treasures’ hues. The banners and flags led the way as they floated through the air. The queen, overjoyed, knelt in reverence before the Dao Lord and said: ‘The king has no heir. I beg you to grant this child as the future ruler. Please have mercy and grant my wish.’\n\nThe Dao Lord replied: ‘I grant this to you.’ The queen then thanked the Dao Lord and took the child. Upon waking, she found herself with child.\n\nAfter a year, in the first month of the *bingwu* year, at noon on the ninth day, she gave birth in the royal palace. At birth, the child’s body radiated treasure-light, filling the kingdom with splendor, his form exquisite and never-ending in beauty. As a child, he was quick and wise; as he grew, he was kind and benevolent. He distributed all the kingdom’s treasures—gold, jewels, and wealth—to the poor, the widowed, the orphaned, the homeless, the hungry, and the sick, his kindness and humility earning songs of praise. His influence reached distant lands, and all under heaven followed him, calling him the Prince of Virtue. The king rejoiced.\n\nAfter this, the king suddenly passed away, and the prince ruled in his place. Moved by the transient nature of life, he instructed the ministers in righteous governance, then abandoned the throne and retired to the Fragrant and Pure Mountain to cultivate the Dao, achieving transcendence through merit.\n\nAfter this kalpa, over eight hundred kalpas passed, and he repeatedly abandoned his kingdom for the sake of all beings, severing attachments to learn the Dao.\n\nIn the following eight hundred kalpas, he practiced medicine to heal the sick, rescuing beings and bringing them peace.\n\nAfter another eight hundred kalpas, he widely employed expedient means, expounding the Daoist canon, reciting sacred verses, and spreading true teachings to aid the nation and save people—from the hidden to the manifest.\n\nFollowing this, in another eight hundred kalpas, he sacrificed his body and life through endurance, offering his flesh and blood.\n\nThus, over three thousand two hundred kalpas of such practice, he finally attained the Golden Immortal rank, named the Pure and Natural Awakened King Asura, who taught the Bodhisattvas the sudden insight into the Great Vehicle’s true essence and gradually entered the wondrous Dao of Emptiness.\n\nAfter another hundred million kalpas of cultivation, he attained the rank of Jade Emperor.\"*",
      "overlap_context": "s of human and celestial longevity. If their bodies perished, they achieved the *tuoké* liberation of the empty shell.\n\nFor those on the Path of Demons, all demons who heard it found rest in celestial palaces, free from the sufferings of war.\n\nFor those on the Path of Hell, all beings who heard it escaped the torments of hell and attained the bliss of Pure Lands.\n\nFor those on the Path of Hungry Ghosts, all hungry ghosts who heard it were sated, their hunger and thirst no longer tormenting them.",
      "start_char": 1219,
      "end_char": 2436,
      "start_sentence": 40,
      "end_sentence": 77,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 14.699467420578003,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\高上玉皇本行集经（唐佚名）.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "说是语已，法筵清众异口同声，叹未曾有。 尔时，众中有一玉女，名曰夜光，从座而起，严整衣冠，从容雅步，长跪道前，白天尊言：臣宿昔何幸，仰侍御前，亲奉供养，已经亿劫。 三清境界，金阙玉京，寂淡逍遥，快乐自在，嬉游圣域，餐听法音，未尝见此希有之事。 不审向来光内所现十方诸天变现圣境，皆有玉帝应化法身，天真大圣、妙行真人、灵妃玉女以为侍卫。 是诸玉女相貌端严，形体姝妙，出众妙香，无与等者。 复蒙玉帝神通移接，今皆普集在清微天，未审今此玉女以何因缘，得证如是无上色身。 恩惟圣慈，示以未悟。 尔时，天尊谓夜光玉女言：汝固初入圣流，虽有智慧，未能明了。 此诸玉女乃自往昔无量劫中，修诸妙行，具解脱门，同清净信，同清净解，同清净念，同清净行，同清诤身，同清净心，同清 净意，同清净果，同清净报，同大慈心，同大悲心，覆护众生，如母抚念，爱於赤子，奉戒专一，冥心大道，清斋弘誓，千万劫中，尊奉玉帝。 此诸玉女，非实是女，皆天至真，为度群生，现玉女身。 是故身色、神通、智慧，隐显变化，与帝同焉。 尔时，夜光闻是说已，心得开悟，稽首欢喜，默然复位。 尔时，高虚清明天主与诸天眷属，驭八景鸾舆，荫九光宝盖，奏玄歌妙乐，咏无量洞章，散天宝花，喷天真香，飞步游空，来诣道前。 承天尊玉帝威神之力，是诸宝花即於空中化一宝盖，荫覆大众，无不周徧。 是时高虚清明天主见此希有，稽首长跪，白天尊玉帝言：贱臣懈怠，后会法筵，今日吉庆，兴此法桥，幽显圣凡，普沾圣泽，放大光明，现希有相，上照诸天，四梵六欲一切乐土，诸真圣众睹此光明，悉皆云集，下照下方无极世界，同玄都境，近接九天，灵风奏乐，宫商相和，激朗云庭，皆成洞章。 一切众生，咸臻道化，酆都铁围、长夜九幽、一切地狱受苦众生，尽承光力，皆生诸天，得受快乐。 今日所散天宝奇花，旋结成盖，徧覆大众，尽承斯光，威神之力，臣等千劫良因，九天运会，皇道荡荡，正法兴隆，今日大吉，咸仰玄功。 是时高虚清明天主以偈赞玉帝曰： 金阙玄穹主，高上玉皇尊，妙相冠诸天，慈光烛三界。 真圣妙道师，天人依仗师。 大乘垂法语，真一指迷途。 功德若虚空，赞扬无穷尽。 是穹苍主，浩劫之尊，妙见妙知，无等无伦，湛寂真静，杳亡杳存，上圣上灵，大神通、光明藏、大丈夫，开化人天，教道无穷，大慈大悲，流焕法轮，为度群生，是号玉皇。 穹苍真老，妙圆清 净，智慧辩才，至道至尊，开度众生，故放是光。 尔时，高虚清明天主说偈赞叹已，天尊普告四众云：是帝身即道身也，非常体也。 是无量功德之身，是清净自然之身，是神明坚固不坏真空无上法身。 威灵恢廓，名声周徧，无幽不开，神奇堂堂，难可称焉。 是帝非有为功德之所熏修，而帝昔虽下生人间，多劫行化，示大神通而身清 净，未尝不在金阙，分身变化，应现随，利济群生，超升道岸，普垂教法，开悟后人，依按奉行，登真成道。 以斯功德之所壮严，是故光明常充诸天，神智妙达，莫可度量。 是身光明，皆具妙号，所谓大神通光、大慈悲光、大喜舍光、大忍辱光、大平等光、大柔和光、大自在光、大利益光、大如意光、大智慧光、大吉祥光、大解脱光、大归依光、大功德光、大圆满光、大无碍光、无能胜光。",
      "translated_text": "After this discourse, the assembly of the Dao/Way was hushed, and all voices in unison sighed in wonder, exclaiming that such a thing had never been heard before.\n\nAt that moment, among the gathering, there arose a jade maiden named Yèguāng (夜光, \"Moonlight\"). She rose from her seat, adjusted her attire with solemn grace, and moved with composed elegance. Kneeling deeply before the Dao/Way, she addressed the Heavenly Venerable (天尊) thus: *\"Your humble servant has been most fortunate to serve in Your presence, offering reverent devotion and countless kalpas of worship. The Three Pure Ones’ realm, with its golden palaces and jade capitals, is serene and unbounded—a place of boundless joy and ease where I wander among sacred domains, feasting on the sounds of the Dao/Way. Yet even here, I have never witnessed such a rare and wondrous sight as this.\n\nI do not understand how, within the luminous interior of the past, the ten directions of all celestial realms (十方诸天) displayed their holy transformations—each with the Jade Emperor’s (玉帝) manifested dharmakāya (法身), the Heavenly True Saint (天真大圣), the Marvelous Conduct Immortal (妙行真人), and the Spirit Consort Jade Maidens (灵妃玉女) as attendants. These jade maidens possessed noble and refined features, exquisite forms, and emitted divine fragrances unmatched by any other.\n\nYet by the Jade Emperor’s divine powers (神通), they were summoned here, all now gathered in the Pure and Microcosmic Heaven (清微天). I do not know by what cause and condition this jade maiden has attained such a supreme and radiant form (色身). It is only by Your boundless compassion (圣慈) that she may now understand.\"*\n\nThen the Heavenly Venerable (天尊) replied to the Moonlight Jade Maiden (夜光玉女): *\"You have indeed just entered the sacred stream of the Dao/Way. Though you possess wisdom, you have yet to fully comprehend its depths.\n\nThese jade maidens, from countless kalpas past, cultivated marvelous practices (妙行), mastered the gates of liberation (解脱门), and shared in the Pure and Natural faith (清净自然), the Pure and Natural understanding (清净自然), the Pure and Natural mindfulness (清净念), the Pure and Natural conduct (清净行), the Pure and Natural body (清净身), the Pure and Natural heart (清净心), the Pure and Natural intention (清净意), and the Pure and Natural fruits and retributions (清净果、清净报). They also shared in the Great Compassion (大慈心) and Great Mercy (大悲心), sheltering beings as a mother cherishes her child, loving them as her own. With unwavering dedication to the precepts (奉戒专一), their minds illuminated by the Great Dao/Way (冥心大道), they observed strict fasting (清斋) and took grand vows (弘誓) for countless kalpas, reverently serving the Jade Emperor (玉帝).\n\nThese jade maidens are not truly maidens—they are the Heavenly Essence of Truth (天至真), appearing in the form of jade maidens solely to guide all beings. Thus, their radiant forms (身色), divine powers (神通), and wisdom (智慧) manifest in hidden and revealed transformations, all in harmony with the Emperor’s.\n\nWhen the Moonlight Jade Maiden (夜光) heard these words, her heart opened in enlightenment. She bowed her head in joy, then silently returned to her seat.\n\nAt that moment, the Sovereign of the High Void and Pure Clarity Heaven (高虚清明天主), along with the celestial retinue (眷属), rode in the Eight Auspicious Celestial Chariot (八景鸾舆) beneath the Nine Radiant Jewel Canopy (九光宝盖). They played celestial hymns of profound harmony (玄歌妙乐), recited the limitless sacred verses (无量洞章), scattered the Heavenly Treasure Flowers (天宝花), and sprayed the Heavenly True Fragrance (天真香). With steps suspended in the void, they approached the Dao/Way’s assembly.\n\nBy the Jade Emperor’s (玉帝) mighty virtue and power (威神之力), these Heavenly Treasure Flowers instantly formed a canopy in the air, sheltering all the gathered beings without exception. At that moment, the Sovereign of the High Void and Pure Clarity Heaven, seeing this rare wonder, knelt and bowed deeply, addressing the Heavenly Venerable Jade Emperor (天尊玉帝): *\"Your lowly servant was negligent and missed the earlier assembly. Today’s joyous occasion, this radiant bridge of the Dao/Way, spans the hidden and the manifest, the sacred and the mundane, and all beings partake in Your sacred blessings (圣泽). Your boundless light (大光明) shines forth in wondrous forms (希有相), illuminating the heavens above and the realms of the Four Celestial Kings (四梵) and the Six Desires (六欲) in all directions. The holy and true assemblies (真圣众) behold this light and converge in response, while below, the boundless worlds of the lower realms (下方无极世界) align with the Mysterious Capital (玄都境), drawing near to the Nine Heavens (九天). The spiritual winds play celestial melodies (灵风奏乐), the tones of the cosmos resonate in harmony (宫商相和), and the clouds echo with profound hymns (激朗云庭), all forming limitless sacred verses (洞章).\n\nAll beings, great and small, attain the Dao/Way’s transformation (道化). Even the tormented souls of the Iron Enclosure of the Netherworld (酆都铁围), the Nine Abysses of Eternal Night (长夜九幽), and all suffering beings in the various hells (一切地狱), by the power of this light (光力), are reborn in the heavens (诸天) and granted boundless joy (快乐).\n\nThe Heavenly Treasure Flowers (天宝奇花) scattered today have swiftly formed this canopy, sheltering all beings beneath its radiance. Your virtue and power (威神之力) are such that Your humble servants have accumulated merit over a thousand kalpas (千劫良因), the Nine Heavens (九天) have gathered in auspicious alignment (运会), and the august Dao/Way flourishes in its vastness (皇道荡荡), with the true teachings (正法) thriving. Today is a great day of fortune—all bow in reverence to Your sublime powers (玄功).\"*\n\nThen the Sovereign of the High Void and Pure Clarity Heaven (高虚清明天主) chanted a gāthā in praise of the Jade Emperor (玉帝):\n\n*\"O Sovereign of the Golden Palace and Mysterious Vault,\nThe Highest Jade Emperor, Your marvelous form surpasses all the heavens,\nYour compassionate radiance illuminates the Three Realms.\nYou are the True Saint, the Master of the Marvelous Dao/Way,\nThe support of both celestial beings and humans.\nWith the Great Vehicle’s teachings, You guide the lost,\nPointing toward the One True Essence.\nYour virtues and powers are as boundless as the void,\nPraise for You knows no end.\n\nYou are the Sovereign of the boundless cosmos,\nThe Venerable of the vast kalpas,\nWith profound insight and wisdom,\nUnmatched and peerless.\nIn serene stillness and true tranquility,\nVanishing yet ever-present,\nThe highest of saints and spirits,\nPossessing great divine powers,\nThe luminous treasury of the Dao/Way,\nThe Great Hero,\nYou open the path for all humanity and celestial beings,\nTeach the Dao/Way without end,\nWith great compassion and mercy,\nYour dharma-wheel shines forth,\nGuiding all beings—\nThus You are named the Jade Emperor.\n\nThe True Elder of the boundless cosmos,\nIn perfect roundness and purity,\nWith wisdom and eloquence,\nThe highest of the Dao/Way’s sovereigns,\nYou liberate all beings—\nThus You manifest this light.\"*\n\nWhen the Sovereign of the High Void and Pure Clarity Heaven (高虚清明天主) finished chanting his gāthā in praise, the Heavenly Venerable (天尊) proclaimed to the Four Assemblies (四众):\n\n*\"The Emperor’s body is the Dao/Way’s body, not an ordinary form (非常体). It is the body of boundless virtues and powers (无量功德之身), the Pure and Natural body (清净自然之身), the unshakable, divine, and luminous true void’s supreme dharmakāya (神明坚固不坏真空无上法身). His virtue and power are vast and encompassing (威灵恢廓), his fame resounding throughout the cosmos (名声周徧). There is no hidden realm He cannot illuminate (无幽不开), and His divine marvels are resplendent (神奇堂堂). Such a being is beyond measure.\n\nThe Emperor’s virtues and powers are not attained through worldly deeds (有为功德). Though in the past He descended into the human world for countless kalpas, demonstrating great divine powers (神通) while maintaining a Pure and Natural body (身清净), He never ceased to reside in the Golden Palace (金阙). Through His limitless transformations (分身变化), He manifested in response to all beings, benefiting them and guiding them toward the Dao/Way’s shore (超升道岸). He universally bestowed His teachings (普垂教法), awakening future generations, leading them to follow and attain true enlightenment (登真成道).\n\nBy the might of these virtues, His light perpetually fills the heavens (光明常充诸天), and His divine wisdom reaches beyond all measure (神智妙达). This radiant body (身光明) bears wondrous names: the Great Divine Power Light (大神通光), the Great Compassion and Mercy Light (大慈悲光), the Great Joyous Renunciation Light (大喜舍光), the Great Endurance Light (大忍辱光), the Great Equality Light (大平等光), the Great Gentle Harmony Light (大柔和光), the Great Freedom Light (大自在光), the Great Beneficial Light (大利益光), the Great As-You-Wish Light (大如意光), the Great Wisdom Light (大智慧光), the Great Auspicious Light (大吉祥光), the Great Liberation Light (大解脱光), the Great Refuge Light (大归依光), the Great Virtue and Power Light (大功德光), the Great Perfect Light (大圆满光), the Great Unobstructed Light (大无碍光), and the Unsurpassable Light (无能胜光).\"*",
      "overlap_context": "another eight hundred kalpas, he sacrificed his body and life through endurance, offering his flesh and blood.\n\nThus, over three thousand two hundred kalpas of such practice, he finally attained the Golden Immortal rank, named the Pure and Natural Awakened King Asura, who taught the Bodhisattvas the sudden insight into the Great Vehicle’s true essence and gradually entered the wondrous Dao of Emptiness.\n\nAfter another hundred million kalpas of cultivation, he attained the rank of Jade Emperor.\"*",
      "start_char": 2436,
      "end_char": 3725,
      "start_sentence": 78,
      "end_sentence": 107,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 28.270938396453857,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\高上玉皇本行集经（唐佚名）.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "是故汝等欲见是帝，乃不可得者，缘以汝等尚於身口，不舍结习，烦恼行业，由是障故，不能得睹是帝慈颜。 吾今为汝时会众等，宣示断障之法，汝等大众宜各奉行。 时诸大众不胜喜跃，各於至尊几前，稽首作礼，俱欲愿闻。 天尊言曰：断障之法，当生大悲，无起疑惑，无起贪嗔，无起淫欲，无起嫉妬，无起杀害，无起凡情，无起凡思，无起昏垢，无起声色，无起是非，无起憎爱，无起分别，无起高慢，无起执着。 凝神澄虑，万神调伏，心若太虚，内外贞白，无所不容，无所不纳。 无令外邪乱其至道，牵失真宗，败其灵根，盗其至宝，致尔万劫永堕凡流，透入俗网，万魔来攻，百千万劫，不闻妙法，鬼神执诛，从生入死。 是故汝等应当志心，善护真宗，无令丧失。 如前所说如是诸障，汝等各各当除断之，身得清 净，超度诸难。 是名道宝，持法栋梁。 更当修奉是此经典，如近是帝，生尊重心，注想尊容，称扬尊号，然后汝等得睹慈颜，咸蒙护度，普闻妙法，亲奉供养，永无流转。 是时四众闻已欢喜，叹未曾有。 高上玉皇本行集经卷上竟 卷中　太上大光明圆满大神咒品第二 尔时，天地始祖五老上帝，稽首长跪，白天尊言：伏闻高上玉皇慈念苍生，普放神光，照烛法界，六凡四圣普叨道荫。 窃以凡夫短景，劫运将终，正道宜行，以济兆民，使修真之子，有期轻举，末代烝民，俱获寿考。 自昔《元始洞玄灵宝赤书玉篇真文》，生於元始之先、空洞之中，天地未根，日月未光，幽幽冥冥，无祖无宗，无气无象，无色无名，无形无绪，无音无声，混沌太无，灵文庵蔼，乍存乍亡。 二仪待之以分，太阳待之以明。 灵图革运，玄象推迁，乘机应会，於是存焉。 玉帝授臣灵宝秘篆、大不可思议神咒，故天地得之而分判，三景得之而发光，灵文郁秀，洞映上清，发乎始青之天，而色无定方，支势曲折，不可寻详。 元始炼之於洞阳之馆，冶之於流火之庭，鲜其正文，莹发光芒，洞阳炁赤，故号赤书。 灵图既焕，万帝朝真，飞空步虚，旋行上宫，烧香散花，口咏灵章。 是时天降十二玄瑞，地发二十四应，上庆九天之灵奥，赞三天之宝明，神风既鼓，皇道咸畅。 元始登命，太真按笔，玉妃拂筵，铸金为简，刻书玉篇，五老掌录，秘九天灵都之馆。 玉女典香，太华执巾，玉童侍卫，玉陛朝轩，九天上书，非鬼神所闻。 故天宝之以致浮，地秘之以致安，五帝掌之以得镇，三光乘之以高明，上圣奉之以致神，高尊赏之以致真，五岳从之以得灵，天子得之以致治，国祚享之以太平。 实灵文之妙德，乃天地之玄根。 威灵恢廓，普加无穷，荡荡大化，为神明之宗。 其量莫测，巍巍乎太空，明真有格，今当以行。 是时元始革运，玄象开图，灵文郁秀，神表五方，分判天地，开化万灵。 此太宗之业，可得暂披於灵韫乎？ 今皇道敷畅，泽被十方，仰观劫运，真风宜行。 臣私心实欲使云荫八遐，风洒兰林，寒条仰希华阳之繁，朽骸蒙受灵澳之津。 仰对元慈，下伸丹恳，惟愿哀悯俯念苍生，不审《灵宝玉篇真文》可得见授，下教於未闻者乎？ 於是，元始天尊抚几高抗，凝真遐想，观时已至，普谓时会一切真圣，论定阴阳，推数劫会，移较河源，检录天度，选择种人，指拈太无，啸朗九玄，念无开听於陈辞，有若闭碍求真之路。",
      "translated_text": "Thus, you who wish to behold this Sovereign—yet cannot—do so because your bodies and speech remain bound to defilements, clinging to habitual patterns and afflictive deeds. By this obstruction, you fail to glimpse His merciful countenance.\n\nNow, before this gathered assembly, I proclaim the method to sever these barriers. All of you must diligently practice it.\n\nAt these words, the great assembly rejoiced beyond measure, each prostrating before the Most Exalted Throne, bowing in reverence, all eager to hear.\n\nThe Celestial Sovereign spoke:\n\n*\"The method to sever barriers is this: cultivate boundless compassion, harbor no doubt or confusion, no greed or wrath, no lust, no jealousy or malice, no killing or harm, no mundane emotions, no mundane thoughts, no dullness or filth, no attachment to sounds and forms, no clinging to right or wrong, no aversion or fondness, no discrimination, no arrogance, no fixation.\n\nConcentrate your spirit, purify your thoughts—subdue all spirits, let your heart be as boundless void. Within and without, pure and untainted, containing all yet accepting all. Do not allow external evils to disrupt your Dao, to drag you from the True Path, to corrupt your sacred root, to steal your supreme treasure, lest you fall into the mundane realm for countless kalpas, ensnared in the net of the vulgar, assailed by myriad demons, condemned by ghosts and spirits, cycling endlessly through birth and death.\n\nTherefore, you must wholeheartedly resolve to safeguard the True Path, lest it be lost. As previously stated, all these barriers must be severed by you—thus your body attains purity, transcending all hardships.\n\nThis is the Dao-Treasure, the pillar of the Law.\n\nMoreover, you must revere and uphold this sacred text, approaching the Sovereign with reverence, meditating on His august form, extolling His sacred name—only then will you behold His merciful face, all receiving His protection, universally hearing the wondrous Law, personally offering devotion and worship, forever freed from transmigration.\"*\n\nAt these words, the Four Assemblies rejoiced, marveling as never before.\n\n**Volume I, Chapter II: The Great Perfect Light and Supreme Divine Spell of the Highest and Most Illuminating Dao**\n\nAt that time, the Five Elders—Heaven’s Primordial Ancestors—prostrated and knelt, addressing the Celestial Sovereign:\n\n*\"We humbly hear that the Highest and Most Illuminated Sovereign, in boundless compassion for the common folk, universally emanates divine light, illuminating the Dharma-realm. The Six Ordinary and Four Holy beings alike partake in the blessings of the Dao.\n\nAlas, as mortal lives are brief and the kalpa nears its end, the True Path must now be practiced to save the myriad people, enabling those who cultivate the True Way to ascend swiftly, while the common folk of the latter age all attain longevity.\n\nSince ancient times, the *Elemental Origins: Sacred and Mysterious Treasure—The Crimson Scripture of the True Text*, emerged before the Primordial Beginning, within the Void of Emptiness, before Heaven and Earth took form, before the sun and moon shone—dark and obscure, without origin or lineage, without qi or form, without color or name, without shape or trace, without sound or voice. It was the boundless chaos, yet within it, sacred scriptures glimmered, appearing and vanishing.\n\nThe Two Principles awaited its division, the Great Sun its illumination. As cosmic patterns shifted and celestial omens emerged, it manifested in response to the moment.\n\nThe Jade Emperor entrusted us with the Sacred Seal of the Treasure and the Inconceivable Divine Spell, thus Heaven and Earth were divided, the Three Lights shone forth. The sacred scriptures flourished, illuminating the Pure and Transcendent. They emanated from the Azure Beginning-Heaven, their hue undefinable, their branches winding and intricate, beyond tracing.\n\nThe Primordial Origin refined it in the Hall of Mystic Yang, tempered it in the Courtyard of Flowing Fire, revealing its true text, radiant with brilliance. The Yang-qi was crimson, hence its name: *Crimson Scripture*.\n\nWhen the sacred scriptures shone forth, ten thousand emperors paid homage to the True One, flying through the void, circling the Celestial Palace, burning incense and scattering flowers, chanting sacred hymns.\n\nAt that time, Heaven sent twelve mysterious auspices, Earth produced twenty-four responses, celebrating the nine heavens’ sacred mysteries, praising the three heavens’ treasured brilliance. The divine wind stirred, and the Imperial Dao flourished.\n\nThe Primordial Origin ascended to command, the Most True One took up the brush, the Jade Consort swept the table, casting gold tablets and carving the Jade Texts. The Five Elders recorded them, sealing them in the Celestial Treasury of the Nine Heavens.\n\nThe Jade Maiden attended to the incense, the Great Hua held the cloth, the Jade Boys stood guard, the Jade Terrace faced the hall, and the Nine Heavens’ decrees were beyond the hearing of ghosts and spirits.\n\nThus, Heaven treasured it to attain stability, Earth concealed it to ensure peace, the Five Emperors held it to secure dominion, the Three Lights rode upon it to ascend in splendor, the Sage Emperors upheld it to attain divinity, the Highest Exalted revered it to achieve the True, the Five Sacred Peaks followed it to gain spiritual power, the Son of Heaven obtained it to govern wisely, and the nation’s lineage enjoyed it to attain eternal peace.\n\nIts virtue is the wondrous power of the sacred scriptures, the primordial root of Heaven and Earth. Its might is vast and boundless, encompassing all without measure, sweeping through the great transformation as the source of divine wisdom.\n\nIts extent is unfathomable, towering in the boundless void. Its truth has a fixed principle, now to be put into practice.\n\nAt that time, the Primordial Origin shifted the cosmic patterns, the celestial omens unfolded, the sacred scriptures flourished, and divine manifestations appeared in the Five Directions, dividing Heaven and Earth, enlightening all living beings.\n\nThis is the work of the Great Ancestor—may we dare to glimpse its essence in the sacred repository?\n\nNow the Imperial Dao spreads and blesses the ten directions. Observing the kalpa’s end, the True Wind must prevail.\n\nOur humble wish is to let the clouds shade the eight extremes, the wind moisten the orchid groves, that withered branches may aspire to the luxuriance of Hua-Yang, and decaying bodies receive the elixir of the sacred isles.\n\nGazing upward in reverence to the Primordial Mercy, we humbly plead below: We pray for Your compassionate consideration of the common folk. Might the *Sacred Treasure Jade Texts* be granted to those unworthy, taught to those who have not heard?\n\nThus, the Primordial Celestial Sovereign, leaning on the table with uplifted bearing, concentrated His True Essence in profound contemplation. Observing that the time had come, He addressed the gathered assembly of all True Saints, determining yin and yang, calculating kalpas and cosmic cycles, comparing the Yellow River’s source, verifying celestial degrees, selecting worthy disciples, pointing to the Great Void, and chanting the Nine Mysteries. His words were not for the unenlightened, as if sealing the path to the True for those obstructed by ignorance.\"",
      "overlap_context": "ght (大喜舍光), the Great Endurance Light (大忍辱光), the Great Equality Light (大平等光), the Great Gentle Harmony Light (大柔和光), the Great Freedom Light (大自在光), the Great Beneficial Light (大利益光), the Great As-You-Wish Light (大如意光), the Great Wisdom Light (大智慧光), the Great Auspicious Light (大吉祥光), the Great Liberation Light (大解脱光), the Great Refuge Light (大归依光), the Great Virtue and Power Light (大功德光), the Great Perfect Light (大圆满光), the Great Unobstructed Light (大无碍光), and the Unsurpassable Light (无能胜光).\"*",
      "start_char": 3725,
      "end_char": 4986,
      "start_sentence": 108,
      "end_sentence": 141,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 16.77184772491455,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\高上玉皇本行集经（唐佚名）.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "是时，五老上帝启问不已，良久，元始天尊乃垂眄眦之容，慨尔叹曰：微乎深哉！ 子今所叩，岂不远乎。 此元始灵宝之玄根，空洞自然之真文，生天立地，开化神明，施镇五岳，安国康民。 灵宝玄妙，为万物之尊，天发玄瑞，灵应自然。 今三天盭运，六天道行，杂法开化，当有三万六千种道以择来者之心。 此法运讫，三龙之后，庚子之年，杂气普消，诸天庆会，吾真道乃行。 今且可相付，当录於上绾，未得行於下世。 玄科有禁，不得便传。 子可诣灵都紫微上宫，听天音於金格，取俯仰於神王，然后当使得备天文，以总御元始之天也。 於是，五老上帝与诸真圣，清香执戒，徘徊云路，啸命十天，上诣上清太玄玉都寒灵丹殿紫微上官，受俯仰之格，乃知天真贵重，难可即闻。 还乃更诣元始道前，谘以禁戒之仪，逊谢不逮。 是时天尊慈颜愍喻，灵关廓开，登命五老上帝开洞阳之馆，披九光八色之韫、云锦之囊，出《元始灵宝赤书玉篇真文》，金书玉篆，微妙秘密，运御乾坤大光明圆满大神咒玉章，以付五老上帝及诸真圣，使依玄科，按法以传。 是时，东方安宝华林青灵始老苍帝所受神咒诰命： 东方九炁，始皇青天，碧霞郁垒，中有老人，总校图箓，摄炁举仙。 二十四字青帝秘文，书于九天元台，主召九天上帝，校神仙图箓。 岁星辅肝，角亢镇真。 氐房心尾，四景回旋。 箕主七辰，正斗明轮。 承炁捕非，扫除灾群。 三十二字秘文，书于紫微宫东华殿，主召星官，正天分度。 东山神咒，摄召九天。 赤书符命，制会酆山。 束魔送鬼，所诛无蠲。 悉诣木宫，敢有稽延。 三十二字秘文，书于东华玄灵之馆，主摄鬼魔，正九天炁。 下制东河，溟海水神，大劫洪灾，蛟龙负身。 水府开道，通径百千。 上帝赤文，风火无间。 三十二字秘文，书于九天东北玉阙丹台，主摄东海水帝，大劫洪灾，召蛟龙及水神事。 此《东方九炁灵宝玉篇真文》合一百二十字。 皆太上元上大光明圆满大神咒空洞自然之书，一名《生神保真洞玄章》，一名《东山神咒》，一名《青帝八威策文》。 右玉皇诰命，以锡东方安宝华林青灵始老苍帝九炁天君，令统御东方诸天诸地、日月星宿、名山灵洞、水府泉宫上圣高尊、真仙圣众、一切威灵，符命所临，如诰奉行。 南方梵宝昌阳丹灵真老赤帝所受神咒诰命： 南方丹天，赤帝玉堂。 中有大神，号曰赤皇。 上炎流烟，三炁勃光。 神仙受命，应会太阳。 三十二字赤帝秘文，书于九天洞阳之馆，主召九天神仙，图箓金名。 荧惑辅心，井鬼守房。 柳星张翼，抗御四乡。 轸总七宿，回转天常。 召运促会，正道驿行。 三十二字秘文，书于三炁丹台，题于西南正阳，主召星官，明度数，正天分。 赤文命灵，北摄酆山。 束送魔宗，斩灭邪根。 符教所讨，明列罪原。 南山神咒，威伏八方。 群妖灭爽，万试摧亡。 四十字秘文，书于西南阳正玉阙，主制北酆，正鬼炁。 南河水帝，太伯龙王。 神咒流行，普扫不祥。 洪水飞灾，上召蛟龙。 开除水径，千道万通。 敢有干试，摄送火宫。 赤书所告，莫有不从。 四十八字秘文，书于西南阳正西阙，主摄南海水帝，大运交期，洪水四出，召蛟龙及水神事。 此《南方三炁灵宝玉篇真文》，合一百五十二字。",
      "translated_text": "At that moment, the Five Elder Celestial Sovereigns pressed their inquiries without ceasing. After a long while, the Primordial Celestial Sovereign then lowered His gaze in solemn contemplation and sighed deeply:\n\n\"How profound and subtle it is! What you now seek is not distant, yet its essence is vast. This is the **Primordial Dao’s Sacred Treasure**—the **True Texts of the Empty Void and Natural Mystery**—which gives birth to the heavens, establishes the earth, and enlightens the divine. It governs the Five Sacred Mountains, secures the realm, and brings prosperity to the people. The Sacred Treasure is **mysterious and profound**, the sovereign of all things; the heavens manifest this **primordial omen**, and the **spiritual response** arises naturally.\n\nNow, the **three celestial cycles** are in motion, the **six heavenly Dao**s unfold, and **diverse methods** of enlightenment are at work. There shall be **thirty-six thousand kinds of Dao** to select the hearts of those who come. When this **methodical cycle** concludes, after the **three dragons**, in the year **Gengzi**, the **mixed qi** will universally dissipate. All the heavens will rejoice in assembly, and then My **True Dao** shall be revealed. For now, it may be entrusted to you, but it shall be recorded in the **Upper Register** and not yet practiced in this lower world. The **mysterious teachings** are forbidden—do not transmit them lightly.\n\nYou may proceed to **Sacred Capital’s Purple Micro Upper Palace**, where you shall hear the **Celestial Sound** in the **Golden Register**, receive the **divine decree** from the **Spiritual Sovereign**, and then be granted the **completion of heavenly texts** to oversee the Primordial Dao’s celestial domain.\n\nThus, the Five Elder Celestial Sovereigns, along with all the **True Saints**, in **pure incense and solemn vows**, wandered the **cloud paths**, and with a **divine chant** addressed the **Ten Heavens**, ascending to the **Uppermost Pure and Mysterious Jade Capital**—the **Cold Spirit Hall of the Primordial Treasure**—in the **Purple Micro Upper Palace**, to receive the **divine decree** of reverence. Only then did they realize that the **Celestial Mystery** is precious and rare, difficult to hear immediately.\n\nReturning, they further visited the **Primordial Dao’s Hall**, seeking guidance on the **forbidden prohibitions**. They humbly declined, unable to grasp them.\n\nAt that time, the Celestial Sovereign’s **compassionate visage** pitied and instructed them. The **Spiritual Gate** opened wide, and the decree was given to the Five Elder Celestial Sovereigns to establish the **Hall of the Yang Void**. There, they unfolded the **Nine Radiant Eight-Colored** treasures—**cloud brocade’s pouch**—and produced the **Primordial Sacred Treasure’s Scarlet Book True Texts**, inscribed in **golden script and jade seals**, with **subtle and secret mysteries**, the **perfect and divine incantation** governing the **Great Radiance of the Primordial Void**. These were entrusted to the Five Elder Celestial Sovereigns and all the **True Saints**, commanding them to follow the **mysterious teachings** and adhere to the **method** in transmission.\n\nAt that time, the **Eastern Divine Treasure’s** **Green Spirit Elder Sovereign** received the **divine decree** of the **Nine Qi** from the **Primordial Sovereign of Jade Emperor**:\nThe **Eastern Nine Qi**, the **Primordial Sovereign of Azure Heaven**, where **Emerald Constellations** gather in dense layers. Within lies the **Elder Sovereign**, who oversees the **divine registers**, collects the **Qi**, and raises the **transcendent**. The **Twenty-Four-Character Eastern Sovereign’s Secret Texts**, written on the **Primordial Platform of the Nine Heavens**, govern the summoning of the **Nine Heavenly Sovereigns** and the **divine registers of immortals**. The **Year Star** assists the **Liver**, while **Jiao and Qiang** constrain the **True**. **Zi and Fang** regulate the **Heart and Tail**. The **Four Celestial Guardians** revolve in harmony. **Qi** presides over **Seven Celestial Beings**, while the **Upright Dipper** illuminates the **Wheel of Destiny**. **Capturing Qi and seizing the false**, they sweep away calamitous crowds. The **Thirty-Two-Character Secret Texts**, inscribed in the **Eastern Hall of the Purple Micro**, govern the summoning of **celestial officials**, the rectification of **heavenly divisions**, and the **establishment of celestial degrees**. The **Eastern Mountain’s Divine Incantation** collects the **Nine Heavens**. The **Scarlet Book’s Decree** commands the **Assembly of the Nether Mountains**. **Binding demons and dispatching ghosts**, none escape their judgment. All are summoned to the **Wood Palace**—none dare delay. The **Thirty-Two-Character Secret Texts**, written in the **Eastern Hall of the Primordial Spirit**, govern the **collection of ghosts and demons** and the **rectification of the Nine Heavenly Qi**. Below, they command the **Eastern River’s Water Sovereign**, the **Great Effort’s Dragon King**, the **Water Palace’s Paths**, and the **thousandfold routes**. The **Scarlet Book’s Decree** ensures **uninterrupted wind and fire**. The **Thirty-Two-Character Secret Texts**, inscribed in the **Primordial Jade Gate of the Nine Heavens’ Eastern-Northeast**, govern the **Eastern Sea’s Water Sovereign**, the **Great Effort’s flood**, and the **summoning of dragons and water spirits**.\n\nThis is the **Eastern Nine Qi’s Sacred Treasure True Texts**, totaling **one hundred and twenty characters**. All are the **Primordial Sovereign’s** **Great Perfect Divine Incantation** of the **Empty Void and Natural Mystery**, also known as the **True Chapter of the Primordial Spirit’s Preservation**, the **Eastern Mountain’s Divine Incantation**, and the **Eastern Sovereign’s Eightfold Strategy**.\n\nThe **rightful decree** of the **Jade Emperor** is hereby bestowed upon the **Eastern Nine Qi Sovereign**, commanding Him to oversee all the **eastern heavens and earths**, the **sun, moon, stars, and constellations**, the **sacred mountains and spiritous caverns**, the **Water Palace and Spring Courts**, the **highest saints and transcendent immortals**, and all **divine and potent beings**. Wherever the **decree and command** reach, they shall be followed as ordained.\n\nThe **Southern Divine Treasure’s** **True Elder Sovereign of Vermilion Spirit** received the **divine decree** from the **Primordial Sovereign of Scarlet Emperor**:\nThe **Southern Scarlet Heaven**, the **Scarlet Emperor’s Jade Hall**. Within lies the **Great God**, called the **Scarlet Sovereign**. Above, **flaming Qi** flows with smoke, and the **three Qi** radiate in brilliance. The **divine immortals** receive the command, responding to the **assembly of the Great Sun**. The **Thirty-Two-Character Scarlet Sovereign’s Secret Texts**, inscribed in the **Hall of the Yang Void**, govern the summoning of the **Nine Heavenly Immortals** and the **golden-named divine registers**. **Mars** assists the **Heart**, while **Well Ghosts** guard the **Four Rooms**. **Willow Stars** extend their wings, **resisting the four directions**. **The Southern Dipper** gathers the **Seven Celestial Beings**, while the **celestial constancy** revolves in return. The **summoning of celestial officials** hastens the **assembly**, and the **rectification of the Dao’s paths** aligns the **heavenly stations**.\n\nThe **Thirty-Two-Character Secret Texts**, inscribed on the **Three Qi’s Scarlet Platform**, titled in the **Southwest Rectified Yang**, govern the summoning of **celestial officials**, the **clarification of degrees**, and the **rectification of heavenly divisions**. The **Scarlet Decree’s command** constrains the **Nether Mountains**. The **binding and dispatching of demonic sects** extinguishes **evil roots**. Where the **decree and teachings** reach, the **guilt is manifest**. The **Southern Mountain’s Divine Incantation** subdues the **eight directions**. All **fiends vanish in ruin**, and **ten thousand trials are crushed**. The **Forty-Character Secret Texts**, inscribed in the **Southwest Rectified Yang Jade Gate**, govern the **command of the Nether Mountains** and the **rectification of ghostly Qi**. The **Southern River’s Water Sovereign**, the **Great Effort’s Dragon King**,—where the **divine incantation** flows, all **inauspicious omens** are swept away. The **great flood’s calamity** summons **dragons and water spirits**. The **paths of water** are opened, and **thousandfold routes** flow freely. Any who dare obstruct shall be **collected and dispatched** to the **Fire Palace**. The **Scarlet Book’s proclamation**—none shall disobey.\n\nThe **Forty-Eight-Character Secret Texts**, inscribed in the **Southwest Rectified Yang Western Gate**, govern the **Southern Sea’s Water Sovereign**, the **great cosmic cycles**, and the **flood’s four outpourings**, summoning **dragons and water spirits**.\n\nThis is the **Southern Three Qi’s Sacred Treasure True Texts**, totaling **one hundred and fifty-two characters**.",
      "overlap_context": "with uplifted bearing, concentrated His True Essence in profound contemplation. Observing that the time had come, He addressed the gathered assembly of all True Saints, determining yin and yang, calculating kalpas and cosmic cycles, comparing the Yellow River’s source, verifying celestial degrees, selecting worthy disciples, pointing to the Great Void, and chanting the Nine Mysteries. His words were not for the unenlightened, as if sealing the path to the True for those obstructed by ignorance.\"",
      "start_char": 4987,
      "end_char": 6265,
      "start_sentence": 142,
      "end_sentence": 198,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 25.712549686431885,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\高上玉皇本行集经（唐佚名）.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "皆太上无上大光圆满大神咒空洞自然之书，一名《南云通天宝灵经》，一名《九天元上之上咒》，一名《赤帝八威策文》。 右玉皇诰命，以锡南方梵宝昌阳丹灵真老赤帝三炁天君，令统御南方诸天诸地、日月星宿、名山灵洞、水府泉宫上圣高尊、真仙圣众、一切威灵，符命所临，如诰奉行。 中央宝劫洞清玉宝元灵元老黄帝所受神咒诰命： 中央总灵，黄上天元。 始生五老，中皇高尊。 摄炁监真，总领群仙。 典录玄图，宿简玉文。 催运上炁，普告万神。 四十字黄帝秘文，书于太玄玉宝玄台，主召神仙，玉简宿名，总归仙炁。 镇星辅脾，回度北元。 □□主非，截邪斩根。 □□□□，扫秽除氛。 □正玄斗，明度天关。 九天符命，金马驿传。 四十字秘文，书于玄都玉台，主摄星官，正天度数。 敕摄北帝，遏塞鬼门，翦除不祥，莫有当前。 十六字秘文，书于玄都玉台，主摄北帝，正天气，检鬼精。 中山神咒，召龙上云，制会黄河，九水河源。 不得怠纵，善恶悉分。 千妖万奸，上对帝君。 敢有干试，太阳激愤。 赤书玉字，宣告普闻。 四十八字秘文，书于玄都玉台四壁，以摄中海水帝四泉之水、洪灾涌溢之数，主召水神，止蛟龙事。 此《中央一炁灵宝玉篇真文》，合一百四十四字。 皆太上无上大光明圆满大神咒空洞自然之书，一名《宝劫洞清九天灵书》，一名《黄天大神咒》，一名《黄帝八威策文》。 右玉皇诰命，以锡中央宝劫洞清玉宝元灵元老黄帝一炁天君，令统御中央皇天后土、日月星宿、名山灵洞、水府泉宫上圣高尊、真仙圣众、一切威灵，符命所临，如诰奉行。 西方七宝金门皓灵皇老白帝所受神咒诰命： 西方素天，白帝七门。 金灵皓映，太华流氛。 白石峨峨，七炁氤氲。 上有始生，皇老大神。 总领肺炁，主校九天。 检定图录，制召上仙。 四十八字白帝秘文，书于九天素灵官北轩之上，主召仙炁，举仙道也。 太白检肺，奎娄守魂。 胃昴毕赀，主制七关。 参总斗魁，受符北元。 二十四字秘文，书于金阙玄窗，主摄白帝星官，正明天度。 赤书玉字，九天正文。 摄召万炁，普归帝君。 十六字秘文，书于九天金阙三图之馆，以摄六天鬼炁。 西山神咒，八威七传。 符水上龙，召山送云。 在所校录，同到帝门。 辅卫上真，斩灭邪源。 若有不祥，截以金关。 赤书符命，风火驿传。 四十八字秘文，书于九天金阙三图之馆，主摄西海水帝，制水中万怪，恶毒之精，召云龙，以防水旱之灾也。 此《西方七炁灵宝玉篇真文》，合一百三十六字。 皆太上无上光明圆满大神咒空洞自然之书，一名《金真宝明洞微篇》，一名《西山神阮》，一名《白帝八威召龙文》。 右玉皇诰命，以锡西方七宝金门皓灵皇老白帝七炁天君，令统御西方诸天诸地、日月星宿、名山灵洞、水府泉宫上圣高尊、真仙圣众、一切威灵，符命所临，如诰奉行。 北方洞阴朔单郁绝五灵玄老黑帝所受神咒诰命： 北方玄天，五炁徘徊。 中有黑帝，双皇太微。 总领符命，仙炼八威。 青裙羽，龙文凤衣。 上帝所举，制到玉阶。 284",
      "translated_text": "All are the **Supreme Most High Great Radiant Perfect Great Divine Incantation** of **emptiness and natural spontaneity**, also named the *Scripture of the South Cloud Piercing Heaven’s Precious Soul*, also named the *Nine-Heaven Supreme-Uppermost Incantation*, also named the *Red Sovereign’s Eight-Awe Command Text*.\n\nBy the **Jade Emperor’s decree**, it is bestowed upon the **Southern Celestial Treasure Illuminating Yang Danling True Elder Red Sovereign of the Three Qi**, commanding him to govern all **southern celestial and terrestrial realms, sun, moon, stars, constellations, sacred mountains, spirit caves, water palaces, spring courts, and all high and exalted saints, true immortals, and all awe-inspiring spirits**. Where the **talisman-decree descends, all shall comply as decreed**.\n\nThe **divine incantation-decree received by the Central Treasure-Effacing Cavern Pure Jade Precious Soul Primordial Elder Yellow Sovereign**:\n\n**Central Sovereign of All Spirits, Yellow Above Heaven’s Primordial.**\n\n**Five Elders first emerged, the Central Emperor Most High.**\n\n**Overseeing qi, supervising truth, leading all immortals.**\n\n**Recording the Mysterious Diagram, the Host’s Jade Texts.**\n\n**Urging the movement of Upper Qi, universally proclaiming to ten thousand spirits.**\n\nThe **Forty-Character Yellow Sovereign’s Secret Text**, inscribed on the **Great Mysterious Jade Precious Mysterious Platform**, governs the **summoning of gods and immortals, the Jade Tablet’s ancient names, and the total return of immortal qi.**\n\n**Controlling stars to assist the spleen, reversing to restore the Northern Primordial.**\n\n**[Illegible]—master of non-being, severing evil and cutting roots.**\n\n**[Illegible]—sweeping away filth and dispelling miasma.**\n\n**[Illegible]—rectifying the Mysterious Dipper, illuminating the Heavenly Pass.**\n\n**Nine-Heaven talisman-decrees, transmitted by the Golden Horse Relay.**\n\nThe **Forty-Character Secret Text**, inscribed on the **Mysterious Capital Jade Platform**, governs the **supervision of celestial officials and the rectification of heavenly measurements.**\n\nBy decree, **subduing the Northern Sovereign, blocking the Ghost Gate, cutting off inauspicious omens—none shall dare obstruct.**\n\nThe **Sixteen-Character Secret Text**, inscribed on the **Mysterious Capital Jade Platform**, governs the **subduing of the Northern Sovereign, rectifying heavenly qi, and inspecting ghostly spirits.**\n\nThe **Central Mountain Divine Incantation**, summoning dragons to ascend the clouds, controlling the confluence of the Yellow River, and the nine rivers’ sources.\n\n**None shall be negligent or indulgent—good and evil shall all be distinguished.**\n\n**Ten thousand demons and deceits shall be presented before the Celestial Lord.**\n\n**Dare any obstruct? The Sun’s wrath shall be aroused.**\n\n**The Scarlet Book’s Jade Characters—proclaimed universally heard.**\n\nThe **Forty-Eight-Character Secret Text**, inscribed on the **four walls of the Mysterious Capital Jade Platform**, governs the **subduing of the Central Sea Water Sovereign’s four springs’ waters and the calamitous surging of floods**, commanding water spirits and restraining dragon affairs.\n\nThis is the *Central One-Qi Soul-Precious Jade Chapter True Text*, totaling **one hundred and forty-four characters**.\n\nAll are the **Supreme Most High Great Radiant Perfect Great Divine Incantation** of **emptiness and natural spontaneity**, also named the *Treasure-Effacing Cavern Pure Nine-Heaven Soul Scripture*, also named the *Yellow Heaven Great Divine Incantation*, also named the *Yellow Sovereign’s Eight-Awe Command Text*.\n\nBy the **Jade Emperor’s decree**, it is bestowed upon the **Central Treasure-Effacing Cavern Pure Jade Precious Soul Primordial Elder Yellow Sovereign of One Qi**, commanding him to govern the **Central Imperial Heaven and Earth, sun, moon, stars, constellations, sacred mountains, spirit caves, water palaces, spring courts, and all high and exalted saints, true immortals, and all awe-inspiring spirits**. Where the **talisman-decree descends, all shall comply as decreed**.\n\nThe **divine incantation-decree received by the Western Seven-Treasure Golden Gate Luminous Sovereign Elder White Sovereign**:\n\n**Western Pure Heaven, the White Sovereign’s Seven Gates.**\n\n**Golden Spirits radiant, Taihua dispersing miasma.**\n\n**White stones towering, seven qi rising in vapor.**\n\n**Above, the Primordial Elder Great God emerged.**\n\n**Leading the Lung Qi, overseeing the Nine Heavens.**\n\n**Inspecting and verifying records, commanding the summoning of high immortals.**\n\nThe **Forty-Eight-Character White Sovereign’s Secret Text**, inscribed above the **Nine-Heaven Pure Spirit Official’s Northern Veranda**, governs the **summoning of immortal qi and elevating the Dao of immortality.**\n\n**Tai Bai inspects the Lung, Kui Lou guards the soul.**\n\n**Wei Mao Bi Li, governing the seven passes.**\n\n**Shen totals the Dipper’s apex, receiving the Northern Primordial’s talisman.**\n\nThe **Twenty-Four-Character Secret Text**, inscribed on the **Golden Gate Mysterious Window**, governs the **subduing of the White Sovereign’s celestial officials and rectifying the bright heavenly measurements.**\n\n**Scarlet Book’s Jade Characters, the Nine-Heaven Rectified Text.**\n\n**Subduing and summoning ten thousand qi, universally returning to the Celestial Lord.**\n\nThe **Sixteen-Character Secret Text**, inscribed in the **Nine-Heaven Golden Gate’s Three Diagram Hall**, governs the **subduing of the Six-Heaven Ghost Qi.**\n\nThe **Western Mountain Divine Incantation, Eight-Awe Seven Transmissions.**\n\n**Talismans summoning water dragons, clouds sent by mountains.**\n\n**All recorded and inspected, arriving together at the Imperial Gate.**\n\n**Assisting and guarding the High True Ones, slaying and extinguishing evil sources.**\n\n**If any inauspiciousness arises, it shall be severed by the Golden Pass.**\n\n**Scarlet Book talisman-decrees, transmitted by Wind-Fire Relay.**\n\nThe **Forty-Eight-Character Secret Text**, inscribed in the **Nine-Heaven Golden Gate’s Three Diagram Hall**, governs the **subduing of the Western Sea Water Sovereign, controlling the ten thousand monsters within the water, and the malevolent poisonous spirits**, summoning cloud dragons to prevent water and drought calamities.\n\nThis is the *Western Seven-Qi Soul-Precious Jade Chapter True Text*, totaling **one hundred and thirty-six characters**.\n\nAll are the **Supreme Most High Radiant Perfect Great Divine Incantation** of **emptiness and natural spontaneity**, also named the *Golden True Precious Bright Cavern Chapter*, also named the *Western Mountain Divine Incantation*, also named the *White Sovereign’s Eight-Awe Summoning-Dragon Text*.\n\nBy the **Jade Emperor’s decree**, it is bestowed upon the **Western Seven-Treasure Golden Gate Luminous Sovereign Elder White Sovereign of Seven Qi**, commanding him to govern the **western celestial and terrestrial realms, sun, moon, stars, constellations, sacred mountains, spirit caves, water palaces, spring courts, and all high and exalted saints, true immortals, and all awe-inspiring spirits**. Where the **talisman-decree descends, all shall comply as decreed**.\n\nThe **divine incantation-decree received by the Northern Cavern-Yin Lone Dark Absolute Five Spirits Mysterious Elder Black Sovereign**:\n\n**Northern Mysterious Heaven, five qi wandering.**\n\n**Within, the Black Sovereign, the Twin Sovereigns of Taiwei.**\n\n**Leading talisman-decrees, refining the Eight Awe.**\n\n**Green robes with feathered [ornaments], dragon patterns and phoenix robes.**\n\n**The Supreme Sovereign’s elevation, controlling arrival at the Jade Terrace.**",
      "overlap_context": "struct shall be **collected and dispatched** to the **Fire Palace**. The **Scarlet Book’s proclamation**—none shall disobey.\n\nThe **Forty-Eight-Character Secret Texts**, inscribed in the **Southwest Rectified Yang Western Gate**, govern the **Southern Sea’s Water Sovereign**, the **great cosmic cycles**, and the **flood’s four outpourings**, summoning **dragons and water spirits**.\n\nThis is the **Southern Three Qi’s Sacred Treasure True Texts**, totaling **one hundred and fifty-two characters**.",
      "start_char": 6265,
      "end_char": 7481,
      "start_sentence": 199,
      "end_sentence": 256,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 17.580748081207275,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\高上玉皇本行集经（唐佚名）.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "四十字黑帝秘文，书于郁单无量玄元紫微台北轩之内，主召诸真人神仙图箓。 北辰辅肾，斗牛卫扉。 女虚危室，豁落四开。 璧总七星，执凶纠非。 却灾扫秽，明道动辉。 三十二字秘文，书于天心北元玄斗中，主摄北方星官，正天炁也。 北山神咒，激阳起雷。 流铃焕落，玃天镇威。 北酆所部，万妖灭摧。 二十四字秘文，书于北方洞阴朔单郁绝元台，主摄天魔北帝，制伏恶神万鬼事。 九河倾讫，鸟母群飞，蛟龙通道，水陌洞开。 赤文玉书，驿龙风驰。 二十四字秘文，书于洞阴朔单郁绝元台，以摄北海水帝，制水中万精，主召蛟龙，兴云致雨以负身。 此《北方五炁灵宝玉篇真文》，合一百二十字。 皆太上无上大光明圆满大神咒空洞自然之书，一名《本命紫微元神生真宝明文》。 一名《北山神咒》，一名《黑帝八威制天文》。 右玉皇诰命，以锡北方洞阴朔单郁绝五灵玄老黑帝五炁天君，令统御北方诸天诸地、日月星宿、名山灵洞、水府泉宫上圣高尊、真仙圣众、一切威灵，符命所临，如诰奉行。 道言：是大神咒者，元始之妙言，玉皇之真诰，上清自然之灵书，九天始生之玄札，空洞之灵章，上圣之秘语，玉晨之尊典，成天立地，开张万真，安神镇灵，成生兆民，匡御运度，保天长存。 上制天机，中检五灵，下策地祇，啸命河源，运役阴阳，召神使仙。 此至真之妙文，神应自然，致天高澄，令地固安，保镇五岳育，万品存焉。 玉帝昔授五老上帝，是时五老跪捧其章，秘题灵都之馆，天真皇人昔书其文，掌之於上清真境太玄玉都寒灵丹殿紫微上宫，累经劫运，而其文保固天根，无有毁沦，与运推迁。 是大神咒混之不浊，秽之愈清，毁之不灭，灭之极明。 大有之文，天真所尊，自光真名，帝图刻简，昭示来生。 斯文隐秘，不得窥闻，有得之子，保万炁长存，勤行修奉，克致神仙。 卷中　玉皇功德品第三 尔时，玉虚上帝白天尊言：惟愿慈悲，愿为四众帝释等，及四梵天王、一切诸天、一切诸仙，及未来一切众生持是经人，说利益事。 尔时，天尊告玉虚上帝言：快哉斯问，不亦善乎。 汝以慈悲，愍念众生，故请问於我。 天尊言曰：若有三界十方无量国土，及国王大臣，或兵戈并起，疫气大行，水旱虫蝗、凶灾饥馑，是其国君、后妃、太子、宰辅、大臣，当发慈悲，为其黎庶，徧敕国内州县镇宰，令诸道流清净严洁于其观内，设大斋醮，六时行道，为转此经，当得国土清平，五谷丰熟，黎庶安泰。 若复有人，入诸山林，遇毒恶兽，但能存想，一念真经，山神卫护，猛兽自退，终不害己。 若入江入海，采宝求珍，值遇恶风，如法持念是此真经，风浪顿止，安稳达岸。 若在军阵，戈戟既接，两刃相交，存心默念是此真经，是诸恶贼悉自退散。 若在牢狱，枷锁之中，净心定虑，存念真经，冤枉自伸，即得解脱。 若为邪精鬼贼众苦所加，如法持念是此真经，众邪远避，自然除愈。 若人为求嗣息，如法尊重，持念此经，帝敕天曹明检丹籍，九品之内，四果仙人，运应数合，谪降下生，为其作子，才辩明慧，人中尊贵。 若妇人临难之月，如法持念是此真经，即得母子平安，生福德男女，人所爱敬。 若为求官进职，爵禄亨达，贵遇人君，如法持念是此真经，即得职务迁转，子孙荣贵，世世不绝。",
      "translated_text": "The **Forty-Character Black Sovereign Secret Scripture**, inscribed within the **Idle Single Boundless Primordial Purple Micro Northern Pavilion**, governs the summoning of all **true immortals and divine sages** through talismans and diagrams.\n\n**The Northern Dipper aids the kidneys, the Big Dipper guards the gate.**\n**The Female Void and Weighing Chamber open fourfold.**\n**The Seven Stars are gathered, seizing evil and rectifying wrong.**\n**Disaster is repelled, filth is swept away, the Dao is illuminated, and radiance moves.**\n\nThe **Thirty-Two-Character Secret Scripture**, inscribed within the **Heavenly Heart Northern Primordial Dipper**, governs the regulation of the northern celestial officials and rectifies the **Heavenly Qi**.\n\n**The Northern Mountain Divine Incantation** stirs the Yang, summoning thunder.\n**The flowing bells shine forth, the Azure Sky is steadied in its awe.**\n**The Northern Acres’ domain—ten thousand demons are annihilated and crushed.**\n\nThe **Twenty-Four-Character Secret Scripture**, inscribed upon the **Northern Cavern-Yin Lone Dark Absolute Boundless Primordial Terrace**, governs the subjugation of the **Northern Heavenly Demon Sovereign**, subduing malevolent spirits and ten thousand ghosts.\n**The Nine Rivers pour forth, the Bird Mother flies in flocks, the Qiao-Long clears the path, and the waterways open.**\n\n**Crimson script on jade tablets, borne by wind-dragon swiftness.**\n\nThe **Twenty-Four-Character Secret Scripture**, inscribed upon the **Northern Cavern-Yin Lone Dark Absolute Boundless Primordial Terrace**, governs the subjugation of the **Northern Sea Water Sovereign**, controlling the ten thousand spirits of the waters, summoning Qiao-Long, and summoning clouds to bring rain for its own sake.\n\nThis is the *Northern Five Qi Spirit Treasure Jade Chapter True Scripture*, totaling **one hundred twenty characters**. All are the **Most High Supreme Great Radiant Perfect Divine Incantation of the Void-Natural**, also named the *Native Command Purple Micro Primordial Spirit True Treasure Illuminating Scripture*, the *Northern Mountain Divine Incantation*, and the *Black Sovereign Eight Awe Heavenly Text*.\n\nBy the **Jade Emperor’s decree**, the **Northern Cavern-Yin Lone Dark Absolute Five Spirits Mysterious Elder Black Sovereign Five Qi Heavenly Lord** is granted authority to govern the northern **heavens and earths, sun, moon, stars, constellations, sacred mountains, spirit caves, water palaces, spring courts, all high and exalted saints, true immortals, and awe-inspiring spirits**. Where the talisman-decree descends, all shall comply as decreed.\n\nThe **Dao** speaks: This is the **Great Divine Incantation**—the **Primordial Beginning’s wondrous speech**, the **Jade Emperor’s true decree**, the **Upper Clarity Natural Sacred Scripture**, the **Nine Heavens’ nascent mystical tablet**, the **Void-Natural’s sacred chapter**, the **Supreme Sage’s secret words**, the **Jade Dawn’s exalted canon**. It establishes heaven and earth, unfolds ten thousand true ones, calms the spirits and steadies the divine, nurtures life and secures the people, rectifies the celestial revolutions, and preserves the heavens eternally.\n\nIt **controls the celestial mechanisms**, **oversees the Five Spirits**, **strategizes the earthly deities**, **summons the Yellow River’s source**, **directs the Yin-Yang transformations**, and **commands gods while dispatching immortals**. This is the **Ultimate True Mysterious Scripture**—divine response is natural, elevating heaven’s clarity, stabilizing earth’s firmness, and preserving the Five Sacred Peaks, ensuring all ten thousand things thrive.\n\nThe **Jade Emperor’s ancient scripture**, revered by the **Heavenly True One**, bears the **Self-Luminous Name**, inscribed upon imperial diagrams and tablets, illuminating future lives. This hidden text must not be casually glimpsed or heard. Those who obtain it shall **preserve the Ten Thousand Qi eternally**; through diligent practice and reverence, they shall attain divinity and immortality.\n\n---\n**Volume III: The Jade Emperor’s Merit and Virtue**\n\nAt that time, the **Jade Emptiness Supreme Emperor** spoke to the **Heavenly Venerable**:\n*\"May your compassion endure. May you benefit the Four Assemblies of Imperial Liberators, the Four Heavenly Kings, all celestial beings, all immortals, and all future beings who uphold this scripture for their benefit.\"*\n\nThe **Heavenly Venerable** replied to the **Jade Emptiness Supreme Emperor**:\n*\"How excellent your question! How virtuous you are!*\nIn compassion, you pity all beings and thus inquire of me.\"\n\nThe **Heavenly Venerable** said:\n*\"If there be a land in the Three Realms and Ten Directions—whether a kingdom’s ruler, ministers, or armies clashing in war—when pestilential qi spreads, or floods, droughts, locusts, or calamities bring famine, the king, queen, crown prince, prime ministers, and officials must, out of compassion for their people, **command all prefectures, counties, and magistrates** to **purify their halls, set great offerings, and recite the Dao six times daily**, turning this scripture. Thus shall their land be peaceful, the five grains abundant, and the people secure.*\n\n*\"If one enters mountains or forests and encounters venomous beasts, but **merely recalls this true scripture in thought**, the mountain spirits shall guard, and the beasts shall retreat, never harming them.*\n\n*\"If one enters rivers or seas to gather treasures, and encounters fierce winds, **reciting this true scripture as prescribed**, the winds and waves shall cease, and they shall reach shore safely.*\n\n*\"If in battle, when blades clash, **one silently recalls this true scripture**, the evil foes shall scatter.*\n\n*\"If imprisoned in shackles, **with a pure heart and steady mind, recalling this true scripture**, wrongs shall be righted, and liberation shall come.*\n\n*\"If tormented by malevolent spirits or demons, **reciting this true scripture as prescribed**, the evils shall flee, and healing shall follow naturally.*\n\n*\"If one seeks descendants, **revering and reciting this scripture as prescribed**, the **Jade Emperor’s decree** shall command the **Heavenly Tribunals** to inspect the **Dan Register**, and among the **Nine Ranks and Four Fruits of immortals**, those whose fate aligns shall be reborn to become their child—bright, eloquent, and noble among mortals.*\n\n*\"If a woman faces childbirth, **reciting this true scripture as prescribed**, mother and child shall be safe, bearing virtuous sons or daughters, beloved by all.*\n\n*\"If one seeks official promotion, noble rank, or favor from the sovereign, **reciting this true scripture as prescribed**, they shall ascend in office, their descendants honored, their lineage unbroken.\"*",
      "overlap_context": "all shall comply as decreed**.\n\nThe **divine incantation-decree received by the Northern Cavern-Yin Lone Dark Absolute Five Spirits Mysterious Elder Black Sovereign**:\n\n**Northern Mysterious Heaven, five qi wandering.**\n\n**Within, the Black Sovereign, the Twin Sovereigns of Taiwei.**\n\n**Leading talisman-decrees, refining the Eight Awe.**\n\n**Green robes with feathered [ornaments], dragon patterns and phoenix robes.**\n\n**The Supreme Sovereign’s elevation, controlling arrival at the Jade Terrace.**",
      "start_char": 7481,
      "end_char": 8754,
      "start_sentence": 257,
      "end_sentence": 293,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 16.906052589416504,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\高上玉皇本行集经（唐佚名）.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "若人欲求资财殷富，如法奉持是此真经，即得财宝充溢，衣食自然，庆流子孙，传之万世。 若人被诸恶星之所照临，困苦床枕，如法持念是此真经，是诸恶星，返降吉祥。 若人命过，应入地狱，注名恶籍，父母师长、夫妻男女，当为亡人持念真经，或安置道场，旛花供养，即得亡者鬼籍尽除，神生净土，同苦罪众，咸蒙护度，承斯胜利，皆生天上。 又此经所在之处，常有十天至真大圣、无极飞天神王侍卫供养。 持是经人，当得自称为正一真人。 是人在处，自得十方至真至圣、金刚力士潜护其人，如护己身。 若出若入，游行之处，百邪避路，魔鬼殄除，精灵伏藏，一切灾殃，不能侵近。 是持经人，命欲终时，更不见诸地狱恶相，即见天宫一切玉女持幢下迎，而生天上。 如天福尽，下生人间，即得千生、万生中常为国王、大臣、圣贤庆会，国土清平，人民乐业，常得宿性通明，遵奉大道，展转修持，至登道岸。 是持经人，获福如是。 又若有持是经人，若雨下时起大悲心，如法向空，念此经三卷一徧，其雨所沾，面所向方，一切众生、五逆十恶、一切重罪，悉皆消灭； 一切重病，便得痊愈。 是诸众生，命终之后，不堕地狱，神生净土，莲花化生，何况持是经者。 又若有持是经人，若行於道路，值大风起吹，是持经之人触身之尘，是尘所沾，一切众生一切恶业悉皆灭尽，更不堕三恶道，当生天上。 故知持经功德，不可思议。 是持经人，若在江在河，在海沐浴其身，是水所沾，其中众生，鱼鳖鼋鼉、一切水族，是诸众罪，悉得除灭。 尽此一报之身，命过之后，更不受胎卵湿化一切等身。 是持经人，口出一切语言，或善或恶，一切天魔外道闻者，皆是清净法音。 是持经人，若遇诸神庙，能为其神诵咏是经，是诸鬼神得闻是经，即脱鬼趣，登真仙道，恭敬是人，如奉是帝。 若人在世，不孝父母，不敬三宝，杀生偷盗，邪淫妄语，作种种极重罪业，将命终时，若有道心正信众生，于其亡者未气断时，起大悲心，于其头边念帝尊号，或一七、二七、三七、四七，乃至百徧、千徧，是其亡者生前所造诸不善业，悉得消灭，更不堕诸恶趣，神升九天，何况受持是此经者。 又若复有人，自从往劫，乃至今身，轮转人天，漂沈世域，积千愆万过在於己身，若遇是持经人影暂映其身，如为帝光之所摄受，或与同语，或闻其声，如奉帝言，道语之所慰谕，彼人罪障，永得除灭。 又若持是经人，造作长旛，书帝名号于其旛上，悬诸长竿，或在观宇，或在家庭，是旛被诸风吹，所持方面，一切众生，皆沾胜利，一切恶业，悉得除灭。 又若有持是经人，书帝名号在一切有声物上，或钟或磬、铃铎铙钹，一切道具法事之属，或以道场，或以戏击，或被风触，是声出时，或远或近，一切众生，闻是声已，所有罪障，悉得清净。 又若有持是经人，了悟生死，深入山林，修真学道，或时登临，上山顾望，目所及处，山林溪谷，含生品类，有形无形，胎卵湿化，动植飞潜，种种诸类，所有罪业，永得除灭，身心清净，命终生天，何况受持是此经者。 当知是人即是道藏，功德身也。 尔时，天尊谓玉虚上帝言：今我略说，未尽其妙。",
      "translated_text": "If one seeks wealth and abundance, and **reveres and recites this true scripture as prescribed**, then treasures shall overflow, and sustenance shall come naturally. Blessings shall flow to their descendants, passed down through ten thousand generations.\n\nIf one is afflicted by malevolent stars, suffering in bed and couch, and **recites this true scripture as prescribed**, then these malevolent stars shall retreat, yielding auspicious fortune.\n\nIf one’s life is forfeit and they are destined for the underworld, their name recorded in the register of evils, then their parents, teachers, spouses, and children must **recite this true scripture** for them, or establish a Daoist ritual site with banners and floral offerings. Thus, the deceased’s ghostly records shall be erased, their spirit reborn in a pure land, and together with all suffering souls, they shall be protected and guided, attaining this supreme victory—all shall be born in heaven.\n\nMoreover, wherever this scripture resides, the **Ten Heavenly Sovereigns of Supreme Truth** and the **Limitless Flying Celestial Kings** shall always attend as guardians, offering reverence and sustenance.\n\nThose who uphold this scripture shall be entitled to call themselves **Orthodox One True Persons**. Such individuals, wherever they go, shall be invisibly protected by the **Supreme Saints of the Ten Directions**, the **Vajra Warriors**, as though guarding their own bodies. Whether entering or exiting, wherever they wander, all malevolent forces shall avoid their path, demons and ghosts shall be exterminated, spirits shall cower in hiding, and all calamities shall be powerless to approach.\n\nWhen such a person nears the end of their life, they shall not see the horrors of the underworld, but instead shall behold heavenly maidens bearing banners descending to welcome them, and they shall be born in heaven.\n\nWhen their heavenly blessings are exhausted and they are reborn in the mortal realm, they shall, across countless lifetimes, always be reborn as kings, great ministers, or sages, presiding over peaceful lands where the people prosper. They shall always retain their innate clarity, follow the Great Dao, and through successive cultivation, ultimately attain the Daoist path.\n\nSuch are the blessings bestowed upon those who uphold this scripture.\n\nFurthermore, if one who holds this scripture, when rain falls, arises with great compassion and, as prescribed, recites this scripture three times in its entirety toward the sky, then wherever the rain touches and in whatever direction they face, all beings—even those guilty of the five heinous and ten grave offenses, or bearing heavy sins—shall have their transgressions utterly erased. All grave illnesses shall be instantly cured.\n\nThese beings, upon death, shall not fall into the underworld but shall be reborn in pure lands, emerging from lotus flowers. How much more so for those who uphold this scripture itself.\n\nAgain, if one who holds this scripture walks the roads and encounters a great wind blowing, the dust that touches their body shall, wherever it lands, cause all beings to have their evil deeds utterly eradicated, sparing them from the three evil paths, and they shall be born in heaven.\n\nThus, the merits of upholding this scripture are unfathomable.\n\nIf such a person bathes in rivers, lakes, or the sea, the water that touches them shall, wherever it flows, cleanse all beings within—fish, turtles, and all aquatic creatures—of their sins.\n\nFor this lifetime alone, upon death, they shall no longer take rebirth in any form—whether as embryo, egg, or wet-born.\n\nWhatever words such a person speaks—whether good or evil—all heavenly demons and heterodox sects who hear them shall regard them as the pure sound of the law.\n\nIf such a person encounters a shrine, they may recite this scripture for the deities within. The ghosts and spirits who hear it shall escape the ghostly realm and ascend to the path of true immortality, revering this person as though they were the Emperor himself.\n\nIf one in this world is unfilial to their parents, disrespectful of the Three Jewels, guilty of killing, stealing, adultery, or false speech, and has committed the gravest offenses, and as they near death, if a virtuous and faithful being arises with great compassion and, while the dying still breathe, invokes the Emperor’s sacred name—whether for one, two, three, or four seven-day periods, up to a hundred or a thousand recitations—the deceased’s past misdeeds shall all be erased, and they shall avoid all evil destinies, ascending to the Ninth Heaven. How much more so for those who uphold this scripture.\n\nAgain, if one, from past eons to this very life, has cycled through the realms of humans and gods, drifting through the world with countless sins accumulated, and merely brushes against the shadow of one who upholds this scripture—or even hears their voice, as though receiving imperial edicts or comforting words from the Dao—their sins shall be permanently eradicated.\n\nIf one who upholds this scripture crafts a long banner inscribed with the Emperor’s name and hangs it on a tall pole, whether in a temple or a household, and the wind carries it, all beings in the direction it faces shall be blessed, and their evil deeds shall be utterly destroyed.\n\nIf one who upholds this scripture inscribes the Emperor’s name on any resonant object—bells, chimes, gongs, drums, or any Daoist ritual implements—whether used in ceremonies, performances, or carried by the wind, the sound they produce, near or far, shall purify all beings who hear it of their sins.\n\nIf one who upholds this scripture awakens to the nature of life and death, retreats into the mountains to cultivate the Dao, and gazes upon the world from afar, wherever their eyes rest—across mountains, forests, streams, and valleys—all living beings, visible and invisible, born of embryo, egg, or wetness, moving or still, flying or swimming, of every kind, shall have their sins permanently erased. Their body and mind shall be purified, and upon death, they shall be born in heaven. How much more so for those who uphold this scripture.\n\nKnow that such a person is the very embodiment of the Daoist Canon, a body of boundless merit.\n\nAt that time, the Celestial Sovereign spoke to the **Jade Emptiness Emperor**, saying: *\"Now I have spoken briefly, yet the wonders remain unexplained.\"*",
      "overlap_context": "Fruits of immortals**, those whose fate aligns shall be reborn to become their child—bright, eloquent, and noble among mortals.*\n\n*\"If a woman faces childbirth, **reciting this true scripture as prescribed**, mother and child shall be safe, bearing virtuous sons or daughters, beloved by all.*\n\n*\"If one seeks official promotion, noble rank, or favor from the sovereign, **reciting this true scripture as prescribed**, they shall ascend in office, their descendants honored, their lineage unbroken.\"*",
      "start_char": 8754,
      "end_char": 9959,
      "start_sentence": 294,
      "end_sentence": 319,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 13.323527336120605,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\高上玉皇本行集经（唐佚名）.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "若广说之，凡流邪见，疑惑不信。 是经功德，穷劫难言。 尔时，玉虚上帝闻是说已，心生欢喜，不胜踊跃，瞻仰慈颜，稽首赞叹，而作颂曰： 九天之上，谓之大罗，玉京金阙，云层峨峨。 中有天帝，仁慈惠和。 至道无敌，降伏众魔。 天宝灵符，玉律金科，神仙亿万，幢旛众多。 闻者罪灭，永出爱河。 是号玉皇，穹苍真老，妙圆清净，智慧辩才，至道至尊，三界师，混元祖，无能胜主，四生慈父，高天上圣，大慈仁者，十号圆满，万德周身。 无量度人，拔生死苦。 尔时，玉虚上帝说是颂及十号已，是诸天众，异口同音，叹未曾有。 高上玉皇本行集经卷中竟 卷下　天真护持品第四 尔时，昊天上帝闻说经法，从座而起，长跪帝前，白言玉帝，愿为大众及诸人天持是经人，说利益事。 尔时，玉皇尊帝兴方便意，开利益门，宣玉匮科，传灵宝法，告於昊天上帝言：汝今谛听，当为汝说受持功德，扶危拔苦，利益存亡，神妙之事。 众真稽首，俱发声言：弟子等，今日幸闻湛然常住之法，莫不上福三界诸天，下消三涂毒害。 惟愿慈悲，愍臣等故，演斯妙义。 玉帝告曰：若有众生，孝养父母，恭敬三宝，竭忠於君，不杀不盗，不淫不妬，不嗔不恨，不骄不诈，奉戒持斋，冥心大道，生尊重心，持诵是经，我即敕下周流沙界，徧传十方无极世界。 我敕东方东华帝君青骑神仙兵马，无鞅数众，悉令下降，覆护受持是此经者。 我敕东南扶桑大帝与其部众神仙兵马，无鞅数众，悉令下降，覆护受持是此经者。 我敕南方朱陵大帝赤骑、神仙兵马，无鞅数众，悉令下降，覆护受持是此经者。 我敕西南太华元老与其部众神仙兵马，无鞅数众，悉令下降，覆护受持是此经者。 我敕西方诰灵皇老白骑神仙兵马，无鞅数众，悉令下降，覆护受持是此经者。 我敕西北皇天上帝与其部众神仙兵马，无鞅数众，悉令下降，覆护受持是此经者。 我敕北方紫微帝君黑骑神仙兵马，无鞅数众，悉令下降，覆护受持是此经者。 我敕东北冲虚天君与其部众神仙兵马，无鞅数众，悉令下降，覆护受持是此经者。 我敕中央天皇大帝、昆仑苍老黄骑神仙兵马，无鞅数众，悉令下降，覆护受持是此经者。 我敕上方来和天君、名山大洞神仙兵马，无鞅数众，悉令下降，覆护受持是此经者。 我敕下方一切金仙、四众八部及诸眷属，悉令下降，覆护受持是此经者。 我敕十方飞天神王、飞天大神、三官四圣、二曜九星、北斗南斗、东西中斗、二十八宿周天众星、金刚力士、神王等众、各与部众、悉令下降，覆护受持是此经者。 我敕降魔力士、四天门王、五岳四渎及余诸山、四海九江、十二河源、山林川泽一切主者、令与眷属、覆护受持是此经者。 诸险恶处，令得安稳。 我敕所在一切土地灵官并沟渠等一切诸大力鬼王，皆令覆护受持是此经者。 令众魔外道，悉皆慑伏，潜形遁迹，高飞海外，远避他方，如是山林设计廊庙血食之宾、一切鬼神、当自消灭； 五方行病瘟疫鬼师、诸饿鬼神并风王水怪、孽龙妖神、土精木魅、尽自消灭； 五须六秏、梦寐乖常、野道咒诅蛊毒之类，皆自消灭。 心欲愿者，一切如意，皆得满足。 是持经人，或不依科教，未能修斋，未具净戒，以能信受尊重，景慕是此经典，并同修斋、护净戒者。",
      "translated_text": "If I were to expound at length, all who cling to heretical views and harbor doubts would remain in confusion and disbelief. The merits of this scripture transcend all kalpas and cannot be fully expressed.\n\nAt that time, the Jade Emptiness Emperor, upon hearing these words, rejoiced with a boundless heart, leaping with exhilaration. Gazing upon the Celestial Sovereign’s benevolent visage, he bowed deeply and chanted in praise:\n\n*\"Above the Nine Heavens lies the Great Luo,*\n*Where the Jade Capital and Golden Gates stand,*\n*Clouds piled high in majestic tiers.*\n*Within dwell the Heavenly Sovereigns,*\n*Renowned for mercy and harmony.*\n\n*The Dao is unrivaled, subduing all demons,*\n*Heaven’s treasures and sacred laws shine,*\n*With myriad gods and immortal hosts,*\n*Banners and flags unfurled in splendor.*\n*All who hear shall see their sins erased,*\n*Forever freed from the river of desire.*\n\n*This is the Jade Emperor,*\n*The Celestial Lord of the Vault of Heaven,*\n*Pure and radiant, wisdom and eloquence incarnate,*\n*The Supreme of the Dao,*\n*Teacher of the Three Realms,*\n*Primordial Ancestor of the Mystic One,*\n*None can surpass Him,*\n*The Merciful Father of the Four Births,*\n*The Highest Sage of the Upper Realms,*\n*The Great Benevolent One—*\n*Ten titles perfected,*\n*Ten thousand virtues embodied.*\n\n*He liberates countless beings,*\n*Rescuing them from the suffering of birth and death.\"*\n\nWhen the Jade Emptiness Emperor finished reciting this hymn and the Ten Titles, all the celestial hosts spoke in unison, marveling at what they had never before heard.\n\n**The *Highest Jade Emperor’s Original Conduct Scripture*, Volume Two**\n**Chapter Four: The Heavenly True Ones’ Protection**\n\nAt that time, the Celestial Sovereign of the Vault of Heaven, upon hearing the scripture’s teachings, rose from his seat and knelt long before the Emperor, addressing him: *\"O Jade Emperor, I humbly request permission to propagate this scripture’s benefits for all beings and celestial assemblies.\"*\n\nThe Jade Emperor, moved by compassion, opened the path of benefit and declared the sacred laws of the Jade Treasury, transmitting the *Lingbao* methods. He spoke to the Celestial Sovereign of the Vault of Heaven: *\"Listen carefully—I shall now expound upon the merits of upholding this scripture, its power to rescue the perishing, benefit the living and the dead, and perform divine wonders.\"*\n\nThe assembled immortals bowed in reverence and spoke in unison: *\"Your disciples today are fortunate to hear this eternal and abiding law. May it uplift the blessings of the Three Realms’ celestial hosts and dispel the poisons of the Three Lower Realms. We pray for Your compassion to unfold this wondrous meaning for our sake.\"*\n\nThe Emperor replied: *\"Should any being honor their parents, revere the Three Jewels, serve their ruler with loyalty, refrain from killing, stealing, lust, jealousy, anger, or malice, avoid arrogance and deceit, uphold precepts and observe fasts, cultivate the Dao with sincerity, and with reverence recite this scripture—I shall command the sands of the Western Regions to spread this teaching across the Ten Directions and the Boundless Worlds.\n\nI command the Eastern Heavenly Sovereign of Eastern Hua, with his green-clad celestial armies—innumerable in number—to descend and protect all who uphold this scripture.\nI command the Southeastern Sovereign of Fusan, with his retinue of celestial armies—innumerable in number—to descend and protect all who uphold this scripture.\nI command the Southern Sovereign of Zhuling, with his red-clad celestial armies—innumerable in number—to descend and protect all who uphold this scripture.\nI command the Southwest Sovereign of Taihua, with his retinue of celestial armies—innumerable in number—to descend and protect all who uphold this scripture.\nI command the Western Sovereign of Gaoling, with his white-clad celestial armies—innumerable in number—to descend and protect all who uphold this scripture.\nI command the Northwestern Sovereign of Huangtian, with his retinue of celestial armies—innumerable in number—to descend and protect all who uphold this scripture.\nI command the Northern Sovereign of Zimwei, with his black-clad celestial armies—innumerable in number—to descend and protect all who uphold this scripture.\nI command the Northeastern Sovereign of Chongxu, with his retinue of celestial armies—innumerable in number—to descend and protect all who uphold this scripture.\nI command the Central Sovereign of Kunlun, with his yellow-clad celestial armies—innumerable in number—to descend and protect all who uphold this scripture.\nI command the Upper Sovereign of Laihe, along with the mountain and cave immortals—innumerable in number—to descend and protect all who uphold this scripture.\nI command all the Golden Immortals of the Lower Realms, the Four Assemblies and Eight Departments, and their attendants—to descend and protect all who uphold this scripture.\nI command the Flying Heavenly Kings of the Ten Directions, the Great Flying Gods, the Three Officials and Four Saints, the Two Luminaries and Nine Stars, the Northern and Southern Dipper Constellations, the Eastern, Western, and Central Dipper Stars, the Twenty-Eight Lunar Mansions and the Celestial Hosts, the Vajra Warriors, and all divine kings with their retinues—to descend and protect all who uphold this scripture.\nI command the Demonic-Subduing Warriors, the Four Heavenly Gate Kings, the Five Sacred Mountains and Four Seas, the remaining mountains, the Four Oceans and Nine Rivers, the Twelve River Sources, and all rulers of mountains, forests, rivers, and marshes—to descend with their attendants and protect all who uphold this scripture, ensuring their safety in perilous places.\nI command all local land spirits, ditch and canal deities, and great ghostly kings of might—to protect all who uphold this scripture.\n\nLet all malevolent demons and heterodox forces be subdued, vanishing in fear, fleeing to distant skies or foreign lands. May all spirits summoned through mountain schemes, hall altars, blood offerings, or other rites self-destruct;\nMay the plague and pestilence spirits of the Five Directions, the hungry ghosts, the Wind King and water monsters, the malevolent dragons and demonic spirits, the earth and wood imps—all self-destruct;\nMay the Five Musts and Six Taboos, those who disrupt dreams, and practitioners of wild sorcery, curses, and poison—all self-destruct.\n\nFor those whose hearts harbor pure wishes, all desires shall be fulfilled.\nThose who uphold this scripture—whether they follow the prescribed rites, observe fasts, or possess pure precepts—yet hold it in faith and reverence, or even those who merely venerate this scripture alongside others who uphold fasts and pure precepts—all shall share in its protection.\"*",
      "overlap_context": "egg, or wetness, moving or still, flying or swimming, of every kind, shall have their sins permanently erased. Their body and mind shall be purified, and upon death, they shall be born in heaven. How much more so for those who uphold this scripture.\n\nKnow that such a person is the very embodiment of the Daoist Canon, a body of boundless merit.\n\nAt that time, the Celestial Sovereign spoke to the **Jade Emptiness Emperor**, saying: *\"Now I have spoken briefly, yet the wonders remain unexplained.\"*",
      "start_char": 9959,
      "end_char": 11254,
      "start_sentence": 320,
      "end_sentence": 357,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 17.789047479629517,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\高上玉皇本行集经（唐佚名）.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "是人功德，坦然无碍，自在逍遥，号人中圣，德惠长新，同诸真人。 尔时，昊天上帝闻是说已，即於帝前乃为歌曰： 大哉至道，无形无名。 渺渺亿劫，黄道开清。 神清朗耀，九魂吐精。 玉虚澄辉，太霞高明。 玉皇开化，溥度天人。 三元道养，二象慑生。 巧树故根，已枯复荣。 蠢动蜎息，长生化形。 怀胎含孕，俱得生成。 亡者命过，魂归三清，魄受链度，南宫飞升。 今日大吉，皆得光明。 五度鉴映，普告万灵。 天地神祇，及诸河源。 五岳四渎，及诸名山。 洞玄洞虚，洞空洞仙。 无极大圣，至真尊神。 无穷无极，普监度生。 恶根断绝，玄都记名。 众真班列，咸帝听言。 经是帝敕，保诵持人。 至度道岸，无使灾侵。 我奉帝命，一切咸听。 尔时，昊天上帝说是歌已，告大众言：此玉皇妙法语，诸圣秘密言，路绝道断，微妙难思，巍巍大范，为神明之宗，保镇国土，拔度生死。 尔时，昊天上帝说是语时，法筵清众，咸仰道言，溥得开悟。 于是天尊而说愒曰： 玉帝功德大，玄理极幽深。 生於浩劫前，运化於古今。 我今说妙经，愍念诸有情。 此诚极妙法，功德中功德。 名号最上乘，无比为第一。 大光明王尊，威德圣希有。 能破暴恶魔，皆令心降伏； 能灭极重罪，皆令得清诤。 若人闻是经，或闻是帝名，稽首生恭敬，一切罪消灭。 十恶四重罪，五逆害父母，信心一称名，随声尽消灭。 保护人天众，四相与五衰。 三涂极重苦，人间见厄难。 凶年饥馑丧，毒药及厌魅，刑狱与冤家，军阵斗战苦，山林恶道中，虎豹豺狼等，江海毒龙类，迅雷风雨雹，水火及盗贼，蛊毒所中心，失志发狂乱，蛇竭毒恶虫，邪魔凶怪神，伺求人便者，由持是真经，普皆自散灭。 恶病久沈绵，梦寐亦不安，非理欲残命，珍灭不为殃。 缘遇是经故，安稳得自在。 所有希求愿，财宝及富贵，以此经功德，如意皆称遂。 神威自在仙，众德十一曜，三十二天主，二十八宿王，灵妃玉女等，天神及地祇，三界虚空神，江海诸龙王，水火及风神，宫殿与宅舍，山林树木众，沟渠井泉神，由持是经故，一切皆拥护。 衣食常自然，子孙居富贵。 出言人希闻，所至皆恭敬。 若为求男女，持诵此真经，帝韶下天曹，落籍天仙人，谪降生其家，为其作男女。 显贵人崇重，七祖尽升仙。 光大庆其门，延及父母亲。",
      "translated_text": "The virtues of such a person are boundless and unobstructed,\nfree and unrestrained—known as the Sage among mortals,\ntheir virtue and blessings ever renewed, equal to the Immortals.\n\nAt that time, the Celestial Sovereign of the Highest Heaven, upon hearing this,\ncomposed a song before the Celestial Assembly:\n\n*\"Great is the Dao of the Highest,\nFormless, nameless.\nVast through countless kalpas,\nThe Yellow Path opens clear.\nDivine and luminous,\nThe Nine Souls exhale their essence.\nThe Jade Void shines pure,\nThe Supreme Radiance ascends high.\nThe Jade Emperor’s transformation,\nUniversal salvation for Heaven and Earth.\nThe Three Primordials nourish the Dao,\nThe Two Symbols awe all life.\nSkillfully replanting ancient roots,\nWhat was withered blooms anew.\nThe sluggish stir to life,\nEternal transformation takes form.\nConceiving and gestating,\nAll attain birth.\nThe departed pass beyond,\nTheir spirits return to the Three Pure Ones,\nTheir souls receive the Chain of Degrees,\nAscending to the Southern Palace.\nThis day is most auspicious,\nAll are bathed in light.\nThe Five Degrees reflect their glory,\nProclaiming to all beings.\nTo the gods of Heaven and Earth,\nAnd the rivers’ sources.\nTo the Five Peaks and Four Seas,\nAnd the sacred mountains.\nTo the Caverns of Mystery and Emptiness,\nThe Caverns of Void and Immortality.\nTo the Supreme Saint of the Boundless,\nThe Most True and Noble Deity.\nBoundless and infinite,\nThey universally guide and save all beings.\nEvil roots are severed,\nNames recorded in the Mystic Capital.\nThe ranks of Immortals assemble,\nAll listen to the Emperor’s decree.\nThis is the Emperor’s edict,\nProtecting those who chant and uphold it.\nTo the utmost shores of the Dao,\nNo calamity shall intrude.\nI, by the Emperor’s command,\nProclaim this to all.\"*\n\nAt that time, the Celestial Sovereign of the Highest Heaven,\nhaving finished this song, addressed the Great Assembly:\n*\"This is the profound speech of the Jade Emperor,\nThe secret words of the Saints.\nThe path is cut off, the Dao is severed—\nSubtle and beyond thought,\nVast and all-encompassing,\nThe foundation of divine wisdom,\nGuarding the land and delivering beings from birth and death.\"*\n\nWhen the Celestial Sovereign spoke these words,\nThe gathered assembly, all reverent,\nGazed upward and attained enlightenment.\n\nThen the Heavenly Lord declared:\n*\"The Jade Emperor’s virtues are supreme,\nHis mysteries profound and deep.\nHe existed before the Great Calamity,\nHis transformations span ancient and modern times.\nNow I proclaim this wondrous scripture,\nOut of compassion for all sentient beings.\nThis is the most sublime of laws,\nThe foremost of virtues.\nThe name of the Great Radiant Sovereign,\nWhose power and virtue are unparalleled.\nHe can subdue violent demonic kings,\nAll bow their hearts in submission;\nHe can erase the gravest offenses,\nAll attain purity and justice.\nIf one hears this scripture,\nOr even the Emperor’s name,\nAnd bows in reverence,\nAll sins are annihilated.\nThe Ten Evils and Four Grave Offenses,\nThe Five Heinous Crimes against parents—\nWith but a single devout invocation,\nAll vanish at the sound.\nIt protects both heavenly and human hosts,\nFrom the Four Calamities and Five Decays.\nFrom the Three Realms’ extreme sufferings,\nFrom human misfortunes and disasters.\nFrom famine, plague, and poisonous drugs,\nFrom curses and malevolent spirits,\nFrom lawsuits and vengeful enemies,\nFrom battles and warfare’s torments,\nFrom the perils of wild mountains,\nFrom tigers, leopards, wolves, and hyenas,\nFrom venomous dragons of river and sea,\nFrom swift lightning, wind, and hail,\nFrom fire, thieves, and bandits,\nFrom sorcery and poisonous plots,\nFrom madness and loss of reason,\nFrom venomous snakes and noxious creatures,\nFrom malevolent demons and monstrous gods—\nAll who seek to harm,\nBy holding this true scripture,\nShall all disperse and perish.\nChronic illnesses, long endured,\nEven in dreams, bring no rest—\nNo unnatural death shall claim them,\nNo loss of treasures shall befall.\nThrough encountering this scripture,\nThey attain peace and freedom.\nAll desires and aspirations—\nWealth, treasures, and noble status—\nThrough this scripture’s virtues,\nShall be fulfilled as wished.\nThe divine power of the Immortal Sage,\nThe Eleven Lights of Virtue,\nThe Thirty-two Heavenly Lords,\nThe Twenty-eight Constellation Kings,\nThe Celestial Consorts and Jade Maidens,\nThe gods of Heaven and Earth,\nThe gods of the Three Realms and Void,\nThe Dragon Kings of rivers and seas,\nThe gods of water, fire, and wind,\nThe palaces and dwellings,\nThe mountains, forests, and trees,\nThe spirits of ditches, wells, and springs—\nAll, by upholding this scripture,\nShall protect and defend.\nFood and clothing shall come naturally,\nChildren shall dwell in wealth and honor.\nTheir words shall be heard with awe,\nAll shall revere them wherever they go.\nIf one seeks sons or daughters,\nAnd chants this true scripture,\nThe Emperor shall descend to the Celestial Bureau,\nRegistering them as Heavenly Immortals,\nCondescending to be reborn in their family,\nTo become their son or daughter.\nTheir descendants shall be noble and esteemed,\nSeven generations ascending to Immortality.\nTheir lineage shall flourish,\nBlessings extending to their parents.\"*",
      "overlap_context": "t;\nMay the Five Musts and Six Taboos, those who disrupt dreams, and practitioners of wild sorcery, curses, and poison—all self-destruct.\n\nFor those whose hearts harbor pure wishes, all desires shall be fulfilled.\nThose who uphold this scripture—whether they follow the prescribed rites, observe fasts, or possess pure precepts—yet hold it in faith and reverence, or even those who merely venerate this scripture alongside others who uphold fasts and pure precepts—all shall share in its protection.\"*",
      "start_char": 11254,
      "end_char": 12139,
      "start_sentence": 358,
      "end_sentence": 406,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 13.498336791992188,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\高上玉皇本行集经（唐佚名）.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "吉祥常炽盛，灾障不能侵。 是故我今说，大众宜谛听。 慈悲度一切，皆令达上清。 于是天尊普告四众：凡人持念此经，受持帝号，皆道根深重，宿有善缘。 此经尊妙，普度天人。 但精心恭奉，家国安宁，保命度灾，扫诸不祥。 天子王侯得奉之者，致国太平，凶寇自夷，边域不争。 兆民歌唱，普天兴隆。 运推数周，正道当行。 有得之者，天真妙重，秘之秘之。 卷下　报应神验品第五 尔时，慈悲度厄真人、寻声救苦真人、济生度死真人、万福护身真人，俱从座起，越班而出，俱白天尊言：若诸世末凡夫，虽宿有善缘，得遇是经，被诸邪障之污，本末疑惑，不信是经功德。 如是之人，见在过去，於诸地狱得何罪报？ 惟愿圣慈，说其报应恶趣之苦。 是时天尊谓四真人云：若诸世间，刚强暴恶不善众生，终日竟夜，对诸道像，无恭敬心，出诽谤语，是罪当堕五无间狱。 若得值遇是持经人，设诸方便，诱引劝谕，如是之人，暂灭恶心，信向是经，彼人罪业净尽无余。 又若有邪见愚执恶人，睹持是经，生诸恶逆，偏眼邪视，乃至起一恶心，发一恶言，谤讟如是持经之人，其罪过是，命终之后，堕大地狱，永无出期，何况世间众生，得遇是经，不生敬仰，秽手污触，荤口读诵，床榻不净，便将安置，或读是经，讲习俗语，共同戏笑，以为常典。 如是之人，命过之后，堕无间狱，永无出期，殃缘九祖，受拷酆都； 累及后世，害缠子孙。 是人于地狱中，历无量劫，受大苦恼，遇无边圣，累承救拔，罪恶小减。 又遇圣人救拔得出，生饿鬼中，历千万劫，不闻浆水之名。 鬼报得出，生畜生中。 畜生报出，若生人中，更生边夷外道，而复女身，贫寒困苦，癃残百病，受无量苦，人所弃掷，求生不得，求死不得。 轻斯经故，获罪如是。 又若复有人，初虽信受，后复慢易，善恶童子上奏三官，黑簿添名，青编减算，身殁之后，拘闭幽牢，往复三涂，无由解脱。 或於见世受种种病，疥癞廱疽，以为果报，忧悲苦恼，日夜相煎，而身或被横恶所加； 或牢狱系锁，非分自害，误食毒药； 或被虎狼毒蛇之所啖食，或为冤家之所雠对； 或行山林，值遇恶人，被他屠割，推落崖岸； 或被邪精魍魉之所残害，或值水火之所焚漂，或被刀兵之所构诛。 轻斯经故，横丧天年，获如是果，获如是报。 可不悲欤，可不痛欤。 故报汝等，依此奉行，勿生邪念。 若诸念不生，万缘顿息，尘沙恶业随心消散； 一切灾魔，自然殄灭。 此经功德，不可思议。 是诚无比最上妙法、诸经之王，有大利益。 非人勿示。 若诸天人、五衰四相，轮回侵逼，能舍除妄想，受持是经，坐招自然，天福益固，身度三界，与道长存。 是此经典，无与等、无能胜。 是大威德大神咒，能令一切枯槁便生枝叶，花果茂盛，能除众生极重苦恼，能令短命众生而得长寿。 此经功德，不可思议，叹莫能尽。 若不宿植道本，广种福业，乃至经名尚不得闻，何况得见是经？ 盖是经依三洞真格，八万劫一传，此清都至真上圣所宝，秘於玉京金阙宸宫，甚为微妙，难可得遇。 如宿有仙骨，当为九天真仙之人，得遇斯文，承斯缘故，后当赍金宝，从师告盟受之，方当承机应运，乃可付焉。",
      "translated_text": "The blessings of auspiciousness shall ever flourish and thrive,\nWhile calamities and obstacles shall fail to intrude.\nTherefore, I now proclaim—\nThe assembly must listen with utmost care.\n\nWith boundless compassion, all shall attain the Upper Purity.\nThus, the Celestial Sage addressed the Four Assemblies:\n*\"All mortals who uphold and recite this scripture,\nWho receive and bear the Imperial Name,\nShall have deep Daoic roots and virtuous karmic ties from past lives.\nThis scripture is sublime and exalted,\nUniversal in its salvation of both heavenly and human beings.\nIf one devotes oneself with sincerity and reverence,\nTheir family and nation shall know peace,\nTheir life preserved, disasters averted,\nAll ill omens swept away.\n\nWhen emperors and kings uphold it,\nTheir realm shall know great harmony,\nBandits and tyrants shall be pacified,\nBorderlands shall know no strife.\nThe common folk shall sing in joy,\nAnd the land shall flourish in prosperity.\nAs the cosmic cycles turn,\nThe true Dao shall prevail.\nThose who attain this scripture—\nHeaven’s essence is profound and weighty;\nGuard it, guard it well.\n---\n**Section Five: Divine Retribution and Verification**\n\nAt that time, the True Persons of Compassionate Liberation, Seeking-Voice for Suffering, Saving-Life from Death, and Ten-Thousand Blessings for Protection—\nAll rose from their seats, stepping beyond their ranks,\nAnd together addressed the Celestial Sage:\n*\"If the common folk of the degenerate age,\nThough they may have past virtuous ties,\nEncounter this scripture yet are defiled by malevolent obstacles,\nTheir doubts—both origin and end—\nShall cause them to disbelieve in its merits.\nWhat retribution, then, shall they suffer in the hells of the past or present?\nWe humbly pray for Your Holiness\nTo expound upon their suffering in the evil destinies.\"*\n\nThe Celestial Sage then spoke to the Four True Persons:\n*\"If the world’s fierce, violent, and wicked beings,\nDay and night before Daoic images,\nHold no reverence, uttering blasphemies,\nTheir crime shall cast them into the Five Uninterrupted Hells.\nBut if they meet one who upholds this scripture,\nAnd through skillful means is led to repent,\nEven if their wicked hearts are but momentarily extinguished,\nAnd they take faith in this scripture,\nTheir sins shall be utterly purged without remainder.\n\nYet if there are those with perverse views and foolish obstinacy,\nSeeing one who holds this scripture,\nThey may harbor malice, cast sidelong glances,\nOr even conceive a single evil thought,\nUtter a single evil word,\nAnd slander those who uphold this scripture—\nTheir offense is such that, after death,\nThey shall fall into the Great Hell,\nWith no hope of escape.\nHow much more so for those in the world\nWho, though they encounter this scripture,\nGenerate no reverence,\nDefile it with unclean hands,\nRecite it with unclean mouths,\nPlace it upon impure beds,\nOr read it aloud in jest,\nTreating it as common scripture.\nSuch persons, after death,\nShall descend into the Uninterrupted Hell,\nWith no hope of escape,\nTheir misfortunes extending to nine generations,\nSubjected to torments in the Underworld’s prisons.\nTheir descendants shall be ensnared in suffering,\nEnduring uncountable eons of torment in hell,\nEncountering countless sages who rescue them,\nTheir sins slightly diminished.\nWhen rescued by a sage, they shall be reborn as hungry ghosts,\nSuffering for countless eons without even the name of water.\nFrom the ghostly realm, they shall be reborn as beasts,\nAnd from beasts, as humans—\nYet even then, as barbarians or heretics,\nOr as women in poverty and wretchedness,\nStricken with a hundred ailments,\nAbandoned by all, unable to live or die.\nThus, to slight this scripture brings such retribution.\n\nAgain, if one initially takes faith but later grows negligent,\nThe Virtuous Boys shall report them to the Three Officials,\nTheir names added to the Black Register,\nTheir merits subtracted from the Green Ledger.\nAfter death, they shall be imprisoned in the Netherworld,\nTraversing the Three Realms without escape.\nOr in this life, they shall suffer myriad diseases—\nLeprosy, scabs, and festering sores—\nAs karmic fruit.\nDay and night, they shall be tormented by sorrow,\nTheir bodies ravaged by sudden violence;\nOr imprisoned in chains, wrongfully harming themselves,\nOr mistakenly consuming poison;\nOr devoured by tigers, wolves, or venomous serpents,\nOr slain by enemies in vengeance;\nOr, wandering in forests, meeting bandits who slaughter them,\nHurl them from cliffs;\nOr harmed by malevolent spirits and goblins,\nOr burned and drowned by fire and water,\nOr slaughtered by blades and weapons.\nTo slight this scripture brings untimely death,\nSuch is their fruit, such their retribution.\nHow can one not grieve? How can one not lament?\n\nTherefore, I warn you—\nFollow this path with devotion,\nNurture no evil thoughts.\nIf no evil thoughts arise,\nAll entanglements shall cease,\nAnd defilements as vast as dust shall dissolve with the mind.\nAll calamitous demons shall be naturally extinguished.\nThe merits of this scripture are unfathomable.\nIt is the supreme, unparalleled, wondrous law,\nThe sovereign of all scriptures,\nOf great benefit.\n\nLet no commoner reveal it.\nIf heavenly and human beings,\nFacing decline and decay, the wheel of rebirth pressing in,\nCan abandon delusion and uphold this scripture,\nThey shall naturally summon celestial blessings,\nTheir lifespan extended, transcending the Three Realms,\nAnd abide with the Dao eternally.\n\nThis scripture is unmatched, unsurpassed.\nIt is the Great Powerful and Great Divine Spell,\nCapable of making withered branches sprout leaves and fruit,\nFlourishing and abundant,\nAble to eliminate the gravest sufferings of beings,\nAnd grant longevity to those with short lives.\nIts merits are unfathomable, beyond all praise.\n\nIf one lacks past Daoic roots,\nOr has not cultivated vast merit,\nEven the name of this scripture may not be heard—\nHow much less shall they see it?\nFor this scripture follows the true patterns of the Three Caverns,\nTransmitted but once in eighty thousand eons.\nIt is the treasure of the Most Pure and Supreme Sage of the Celestial Capital,\nSecreted within the Jade Capital’s Golden Gate Palace,\nExceedingly subtle and rare,\nDifficult to encounter.\nOnly those with innate Daoic essence—\nFuture Nine-Heaven True Immortals—\nShall, by fate’s design,\nReceive it from their master after oaths of allegiance,\nAnd only then may they inherit its transmission.\"",
      "overlap_context": "all dwell in wealth and honor.\nTheir words shall be heard with awe,\nAll shall revere them wherever they go.\nIf one seeks sons or daughters,\nAnd chants this true scripture,\nThe Emperor shall descend to the Celestial Bureau,\nRegistering them as Heavenly Immortals,\nCondescending to be reborn in their family,\nTo become their son or daughter.\nTheir descendants shall be noble and esteemed,\nSeven generations ascending to Immortality.\nTheir lineage shall flourish,\nBlessings extending to their parents.\"*",
      "start_char": 12139,
      "end_char": 13352,
      "start_sentence": 407,
      "end_sentence": 451,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 14.479454755783081,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\高上玉皇本行集经（唐佚名）.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "不得轻泄，敬之慎之。 於是天尊重宣此义，为说偈曰： 设使江河水，波浪能生莲，慈乌毛能白，如经故难遇。 设使龟生毛，堪采为衣服，夜月能消冰，如经故难遇。 设使蚊蠓足，堪构为舟桥，能载一切重，如经故难遇。 设使黄口雀，能衔诸太山，掷之他方界，如经故难遇。 设使一叶舟，力能载昆仑，浮渡於大海，如经故难遇。 设使诸水蛭，口能生巨齿，其大如象牙，如经故难遇。 设使蓬蒿叶，能覆无鞅界，荫芘无鞅众，如经故难遇。 设使乌枭类，同树一巢栖，衔食共相饲，如经故难遇。 设使兔生角，堪用为梯磴，上穷有顶天，如经故难遇。 设使鼷鼠等，缘於兔角梯，至天能食月，如经故难遇。 设使驴颜唇，色如苹婆果，复能作歌舞，如经故难遇。 设使蝇虫等，能饮钟石酒，迷荒而沈醉，如经故难遇。 尔时，天尊宣说偈已，普告四众：是故持是经人，名功德身，一切有情，被其荫故。 持是经人，名神通身，一切吉祥，咸臻集故。 持是经人，名清净身，是诸恶业，不能侵故。 持是经人，名威德身，天魔异道，不能摄故。 持是经人，名无等身，上帝谣唱，万神敬故。 持是经人，名坚固身，恶劫大难，不能损故。 持是经人，名道藏身，口出语言，鬼神仰故。 持是经人，名慈悲身，六道众生，赖其善故。 持是经人，名大道身，出入所在，无怖畏故。 持是经人，名良医身，善行妙法，安乐人故。 持是经人，名光明身，常为帝光，所摄受故。 持是经人，名自在身，天宫妙境，神能游故。 持经功德，说不可尽。 又若道士至人，能结坛诵经，着新净衣，於夜半后，阗寂独处清净室中，叩齿九通，东向端坐，诵咏是经。 於是时也，太真御几，玉妃拂筵，万神班列，诸天临轩，三界侍卫，五帝司迎。 然后闭目静思，存想是经，不觉身处五云之内，俄见其身光明赫奕，上升天宫，众真下迎，心有所请，一切应奉； 仙丹妙宝，随意自得。 故当依科闭心，奉行此经，乃至三世金仙、十方大圣，皆从此经依按修奉，故顿得超证无上妙道。 是此帝也，诸佛之师，众圣之王。 是故凡夫值遇是经，致以五帝辅翼，召使神仙，御役神宫，运导阴阳，千真敬仰，万神慑伏，百邪避路，群魔束形，命过之后，即得南宫受炼，飞步上清，逍遥自在，与道长存。 又设复世间众生，曾闻是经，心常渴仰，能於家中择清净处，画帝尊像，日夜虔虔，晨昏济济，香花灯果，尊重供养，称名瞻礼，是人当得三十种上妙功德： 一者诸仙赞重，二者先亡生天，三者宿殃解脱，四者所往通达，五者无盗贼事，六者所求遂心，七者除水火厄，八者横事潜消，九者夜梦吉祥，十者疾病不临，十一者智慧聪明，十二者人见欢喜，十三者衣食丰盛，十四者子孙荣贵，十五者六亲见喜，十六者门族和睦，十七者除三恶报，十八者转女成男，十九者形容端严，二十者为国大臣，二十一者生为帝王，二十二者鬼神钦仰，二十三者得宿命通，二十四者诸神护念，二十五者九族受荫，二十六者处世长年，二十七者有情赖善，二十八者魔王保迎，二十九者决超三界，三十者白日上升。 尔时，天尊复告四众：此经功德，能碎铁围诸山，竭苦海水，破大地狱，拔重罪苦，降暴恶魔，护诸国土，能灭一切恶鬼，能除一切重病，能解一切恶毒，能离一切恶人，能伏一切毒兽，能摧一切邪道，一切诸天，皆令降伏。",
      "translated_text": "**Translation:**\n\n*\"Do not reveal this lightly—revere it and guard it carefully.*\n\nThen, the Celestial Sage expounded this truth and spoke in verse:\n\n*If the waters of the Yangtze and Yellow Rivers*\n*Could sprout lotuses from their waves,*\n*If the raven’s feathers turned as white as snow,*\n*Still, this scripture would be as rare to encounter.*\n\n*If tortoises grew fur,*\n*Fit for weaving into robes,*\n*If moonlight could melt ice in the night,*\n*Still, this scripture would be as rare to encounter.*\n\n*If mosquitoes had feet,*\n*Strong enough to build bridges and boats,*\n*And could bear all heavy loads,*\n*Still, this scripture would be as rare to encounter.*\n\n*If young sparrows could carry the Five Peaks,*\n*Hurl them to distant lands,*\n*Still, this scripture would be as rare to encounter.*\n\n*If a single-leaf boat*\n*Could bear the weight of Kunlun,*\n*And sail the great sea,*\n*Still, this scripture would be as rare to encounter.*\n\n*If leeches grew teeth,*\n*As large as elephant tusks,*\n*Still, this scripture would be as rare to encounter.*\n\n*If broom and hemp leaves*\n*Could cover the boundless realms,*\n*Shading all beings without end,*\n*Still, this scripture would be as rare to encounter.*\n\n*If owls and kites*\n*Nested together in one tree,*\n*And fed each other with shared prey,*\n*Still, this scripture would be as rare to encounter.*\n\n*If rabbits grew horns,*\n*Fit for ladders to the heavens,*\n*And reached the highest peaks,*\n*Still, this scripture would be as rare to encounter.*\n\n*If shrews climbed those horned ladders,*\n*And ate the moon in the sky,*\n*Still, this scripture would be as rare to encounter.*\n\n*If donkeys’ lips turned*\n*The color of the *pīngpó* fruit,*\n*And they could sing and dance,*\n*Still, this scripture would be as rare to encounter.*\n\n*If flies could drink from stone jars,*\n*And drown in wild intoxication,*\n*Still, this scripture would be as rare to encounter.*\n\nAt that time, the Celestial Sage finished speaking the verse and declared to the Four Assemblies:\n\n*Thus, those who hold this scripture*\n*Are called the **Body of Virtue**—*\n*All beings benefit from its shade.*\n\n*Those who hold this scripture*\n*Are called the **Body of Mystic Power**—*\n*All auspiciousness gathers around them.*\n\n*Those who hold this scripture*\n*Are called the **Pure Body**—*\n*No evil deed can harm them.*\n\n*Those who hold this scripture*\n*Are called the **Body of Might and Virtue**—*\n*Heavenly demons and false paths cannot ensnare them.*\n\n*Those who hold this scripture*\n*Are called the **Body of the Unequaled**—*\n*The Sovereigns of Heaven sing in praise,*\n*And all spirits revere them.*\n\n*Those who hold this scripture*\n*Are called the **Body of Firmness**—*\n*No calamity or great disaster can diminish them.*\n\n*Those who hold this scripture*\n*Are called the **Body of the Daoic Treasury**—*\n*When words issue from their mouths,*\n*Ghosts and spirits bow in awe.*\n\n*Those who hold this scripture*\n*Are called the **Body of Compassion**—*\n*All beings in the Six Realms rely on its goodness.*\n\n*Those who hold this scripture*\n*Are called the **Body of the Great Dao**—*\n*Wherever they go, there is no fear.*\n\n*Those who hold this scripture*\n*Are called the **Body of the Skilled Physician**—*\n*They practice wondrous methods,*\n*Bringing ease and joy to all.*\n\n*Those who hold this scripture*\n*Are called the **Body of Radiance**—*\n*They are ever the Emperor’s light,*\n*Illuminating all they encompass.*\n\n*Those who hold this scripture*\n*Are called the **Body of Freedom**—*\n*They wander the celestial palaces,*\n*Their spirits unbound.*\n\n*The merits of this scripture are beyond measure.*\n\n*Moreover, if a Daoist adept,*\n*Having purified themselves,*\n*Wears new, clean robes,*\n*And at midnight, in solitude,*\n*In a quiet chamber,*\n*Knocks their teeth nine times,*\n*Sits facing east,*\n*And recites this scripture—*\n\n*Then, the Most Pure Sovereign takes their seat,*\n*The Jade Consort sweeps the hall,*\n*The myriad spirits assemble in ranks,*\n*The celestial hosts stand at attention,*\n*The Three Realms guard in attendance,*\n*And the Five Emperors oversee the welcome.*\n\n*Then, closing their eyes and stilling their mind,*\n*They visualize this scripture,*\n*And unknowingly find themselves within the Five Clouds.*\n*Suddenly, their body shines brightly,*\n*Ascending to the celestial palaces,*\n*Where the Immortals descend to greet them.*\n*Whatever they request is granted,*\n*And wondrous elixirs and treasures appear at will.*\n\n*Thus, one must focus their heart and follow this scripture’s methods.*\n*Even the Three-World Golden Immortals and the Ten-Direction Great Sages*\n*All depend on this scripture for their cultivation and attainment,*\n*And thereby swiftly realize the Supreme Wondrous Dao.*\n\n*This is the Emperor of all—*\n*The Teacher of the Buddhas,*\n*The King of the Saints.*\n\n*Therefore, even ordinary mortals who encounter this scripture*\n*Shall be aided by the Five Emperors,*\n*Summon spirits and immortals,*\n*Command the celestial palaces,*\n*Direct the forces of yin and yang,*\n*Receive reverence from the myriad True Ones,*\n*And cause all spirits to submit.*\n*All malevolent forces flee,*\n*And demons bind their forms.*\n*After death, they ascend to the Southern Palace for refinement,*\n*Walk the Flying Steps to Upper Purity,*\n*And dwell in boundless freedom,*\n*Living eternally with the Dao.*\n\n*Furthermore, if even worldly beings*\n*Have once heard this scripture*\n*And long for it with devotion,*\n*And in their homes choose a pure place,*\n*Paint the Emperor’s likeness,*\n*And with sincere reverence,*\n*Morning and evening offer incense, flowers, lamps, and fruit,*\n*Honoring and venerating the name—*\n\n*Such a person shall attain thirty kinds of supreme merit:*\n1. *The praise of the Immortals,*\n2. *The rebirth of the deceased in heaven,*\n3. *Liberation from past misfortunes,*\n4. *Smooth passage in all endeavors,*\n5. *Freedom from thieves and robbers,*\n6. *All desires fulfilled,*\n7. *Avoidance of water and fire calamities,*\n8. *The dissolution of hostile affairs,*\n9. *Auspicious dreams at night,*\n10. *No sickness or illness,*\n11. *Wisdom and clarity,*\n12. *The joy of all who see them,*\n13. *Abundant food and clothing,*\n14. *Honored and noble descendants,*\n15. *The delight of relatives,*\n16. *Harmony in their clan,*\n17. *Escape from the three evil retributions,*\n18. *Transformation from female to male,*\n19. *Graceful and dignified appearance,*\n20. *Appointment as a great minister of the realm,*\n21. *Birth as an emperor,*\n22. *The reverence of ghosts and spirits,*\n23. *Knowledge of past lives,*\n24. *The protection of all spirits,*\n25. *The blessings of the nine clans,*\n26. *A long life in this world,*\n27. *The reliance of all sentient beings on their goodness,*\n28. *The welcome of the Demon Kings,*\n29. *Transcendence beyond the Three Realms,*\n30. *Ascension in broad daylight.*\n\nAt that time, the Celestial Sage again declared to the Four Assemblies:\n\n*This scripture’s merits*\n*Can shatter iron-enclosed mountains,*\n*Drain the苦海 of suffering,*\n*Break the Great Hell,*\n*Extract the deepest sins,*\n*Subdue violent demon-kings,*\n*Protect all lands,*\n*Extinguish all malevolent ghosts,*\n*Remove all grave illnesses,*\n*Dissolve all poisons,*\n*Free one from all wicked men,*\n*Tame all venomous beasts,*\n*Crush all heretical paths—*\n*And all the celestial hosts*\n*Shall bow in submission.\"*",
      "overlap_context": " this scripture follows the true patterns of the Three Caverns,\nTransmitted but once in eighty thousand eons.\nIt is the treasure of the Most Pure and Supreme Sage of the Celestial Capital,\nSecreted within the Jade Capital’s Golden Gate Palace,\nExceedingly subtle and rare,\nDifficult to encounter.\nOnly those with innate Daoic essence—\nFuture Nine-Heaven True Immortals—\nShall, by fate’s design,\nReceive it from their master after oaths of allegiance,\nAnd only then may they inherit its transmission.\"",
      "start_char": 13352,
      "end_char": 14631,
      "start_sentence": 452,
      "end_sentence": 488,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 18.26357889175415,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\高上玉皇本行集经（唐佚名）.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "其余功德，说不可尽。 尔时，道场大众、金仙菩萨、真圣眷属闻是说已，欢喜踊跃，稽首敬礼，而作颂曰： 大哉至道，无宗上真。 上度诸天，下济幽魂。 上无师祖，惟道为身。 丹台紫府，金阙玉京，秘此妙法，溥福含灵。 灭我万罪，增我遐龄。 万神朝礼，魔王保迎。 功德昌盛，黄箓书名。 渺渺亿劫，使我长存。 於是众等说是颂毕，稽首皈依，奉辞而退。 高上玉皇本行集经卷下竟",
      "translated_text": "The remaining virtues are beyond measure.\n\nAt that time, the gathered assembly of the Dao/Way, the Golden Immortals and Bodhisattvas, and the true saints and their consorts, upon hearing these words, rejoiced and leapt in delight, bowed in reverence, and composed this hymn:\n\n*\"Great is the Supreme Dao/Way,\nWithout sect or ultimate truth.\nAbove, it transcends all celestial realms;\nBelow, it rescues the lost spirits.\nIt has no master or ancestor—\nThe Dao/Way itself is the body.\n\nIn the Dan Platform and Purple Bureaus,\nAt the Golden Gates and Jade Capitals,\nThis wondrous law is concealed,\nBestowing boundless blessings upon all living things.\n\nIt extinguishes my ten thousand sins,\nAnd prolongs my boundless years.\n\nTen thousand spirits pay homage,\nAnd the Demon Kings welcome in protection.\n\nIts virtues flourish grandly,\nRecorded in the Yellow Register of Merit.\nThrough countless eons, it grants me eternal life.\"*\n\nThus, the assembly having recited this hymn, bowed in homage and took refuge, then respectfully withdrew.\n\n*The Highest Jade Emperor’s Original Conduct Scripture, Volume Two, ends.*",
      "overlap_context": "at time, the Celestial Sage again declared to the Four Assemblies:\n\n*This scripture’s merits*\n*Can shatter iron-enclosed mountains,*\n*Drain the苦海 of suffering,*\n*Break the Great Hell,*\n*Extract the deepest sins,*\n*Subdue violent demon-kings,*\n*Protect all lands,*\n*Extinguish all malevolent ghosts,*\n*Remove all grave illnesses,*\n*Dissolve all poisons,*\n*Free one from all wicked men,*\n*Tame all venomous beasts,*\n*Crush all heretical paths—*\n*And all the celestial hosts*\n*Shall bow in submission.\"*",
      "start_char": 14631,
      "end_char": 14811,
      "start_sentence": 489,
      "end_sentence": 500,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 2.809821367263794,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\高上玉皇本行集经（唐佚名）.txt",
        "category": "本文类"
      }
    }
  ]
}