{
  "source_id": "高上大洞文昌司禄紫阳宝箓",
  "source_file": "chunked_daozang\\高上大洞文昌司禄紫阳宝箓.json",
  "total_chunks": 14,
  "total_original_chars": 11654,
  "total_translated_chars": 75391,
  "total_translation_time": 234.3674464225769,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\高上大洞文昌司禄紫阳宝箓.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**Highest Daoist Scripture of Wenchang, Lord of Fortune, Purple Yang Treasure Scrolls**\n*(Title: Highest Daoist Scripture of Wenchang, Lord of Fortune, Purple Yang Treasure Scrolls)*\n\n**Author Unknown**, approximately from the Ming Dynasty.\nFalsely attributed to Wenchang Di Jun (Celestial Lord of Literature and Fortune) descending to bestow talismans, diagrams, and divine spells.\nThree volumes.\nSource text: *Zhengtong Daozang* (Orthodox Daoist Canon), First Section.\n\n---\n\n**Volume One of the Highest Daoist Scripture of Wenchang, Lord of Fortune, Purple Yang Treasure Scrolls**\n\nA certain devout Daoist practitioner residing in [location], humbly states:\n*\"By fate, I was born on the [year], [month], [day], and [hour] of the [stellar time], under the governance of the [specific star] of the Northern Dipper. On that very day, with utmost reverence, I knelt before the Master of the Dao, the Celestial True Person of the Heavenly Teacher, and received the *Highest Daoist Scripture of Wenchang, Lord of Fortune, Purple Yang Treasure Scrolls*. I now wear it with devotion, swearing to uphold the orthodox teachings, discipline myself, enhance my talents, sharpen my wisdom, sever demonic obstacles, banish malevolent spirits, achieve scholarly distinction, and ascend to positions of fortune.*\n\n*After receiving this sacred text, I dare not reveal its mysteries lightly, lest I incur the wrath of the Daoist Master and betray my solemn vow. I shall strictly adhere to the laws and decrees of the Wenchang Upper Palace.\"*\n\n---\n\n**The Nine-Heavens Enlightenment Chapter of Wenchang**\n\nAt that time, the Sovereign of Nine-Heavens Enlightenment, the Radiant True Observer, the Precious Light Celestial Venerable (*Chéngzhēn Zhèngguān Bǎoguāng Tiānzūn*), in the year of *Chóngguāng Chìfèn Ruò* (a cyclical year name), when the sun was in the *Chuntuǐ* (a lunar mansion), and the moon was at the *Dōngbì* (East Wall) hour, descended into the *Bǎopíng Shān* (Treasure Screen Mountain) in the Shu capital, at the *Héshèng Yīngzhī Lóu* (Harmonious Sincerity Responding Hall) and the *Xuànhuì Yùxū Tán* (Mysterious Gathering Jade Emptiness Altar). He announced to the *Luánfǔ Shìxiān Zhēnrén* (Luanfu Attendant Immortal Sī Liú Ānshèng*), saying:\n\n*\"In past ages, I received the jade edict of the Most High Emperor, entrusted with overseeing the *Guìjí* (the celestial register of worthy scholars), promoting literary scholars to noble ranks, and advancing virtuous officials to aid the enlightened age. Thus, I was appointed to govern the Celestial Chancellery, specializing in bestowing fortune, recording the Underworld, determining noble ranks, measuring the Watery Realm, and selecting the worthy. I oversee the tripartite examinations of the Three Offices (Heaven, Earth, and Water).*\n\n*In the years of selection, I, together with the Three Elements and Three Officials, the Five Directions and Five Emperors, the Three Celestial Stems and Five Stars of the Dipper, and the myriad luminaries, coordinate with the Three Mysteries, examine the *qi* and fate, and decree the Celestial Chancellery’s Bureau of Fixed Destiny and Noble Rank, the Earthly Bureau of Tai Mountain, the Watery Bureau of the Northern Netherworld, and the Imperial Lord of Fúsāng. We convene the Nine-Heavens Enlightenment Wenchang Grand Marshal’s Office to assess the nine regions and their constellations, determining the ranks of the three fortunes, three noble ranks, and three virtues—high or low—and further investigate the ancestral, parental, and familial lineages across lifetimes, whether they possess hidden virtues and filial piety or accumulated grudges, debts, lawsuits, curses, karmic roots, and demonic foundations, as well as their Five Phases and fateful allotments, calculating their directional numbers and recording them all.*\n\n*If a lineage possesses hidden virtues and profound filial piety, with a sturdy foundation of virtue, even if their fate is declining, their merits will overcome it, and they shall be granted added fortune and longevity, ascending to noble selection and entering the register of fortune.*\n\n*If their virtues are great and their foundation strong, yet their grudges, debts, and calamities persist, they shall first be enrolled in the register of the worthy, their names recorded in the noble ranks, awaiting the exhaustion of their misfortune and the extinction of their guilt before receiving their fortune.*\n\n*If their fate aligns with noble rank and fortune, yet they lack hidden virtues, great deeds, or a hundred acts of loyalty and filial piety, their fortune shall be withdrawn, their noble rank stripped, their name erased from the register, and they shall await the establishment of virtue, the accumulation of goodness, and the gathering of blessings before being re-entered into the noble ranks and granted fortune and renown.*\n\n*Should literary scholars and worthy men, knowing their fate, repent their errors, cultivate virtue, and refine their studies—though their fate is noble and their hidden merits slight, their karmic bonds heavy with grudges and debts, and demonic spirits obstructing their advancement and clouding their divine insight—I shall bestow upon them the *Great Daoist Treasure Scrolls of Wenchang’s Upper Palace*, dispelling all demonic obstacles and awakening their innate wisdom.*\n\n*This text was formerly concealed within the jade palace of the Supreme Origin, the Holy Pure Realm, the Vast Effulgence Heavenly Palace, the Golden Gate Jade Chamber, and the cloud-silk pouch. It was transmitted to the Jade Sovereign Great Daoist Lord (*Yùchén Dà Dàojūn*), then passed from the Most High Laozi to the Purple Micro Emperor and the Supreme One Lord. It was further transmitted to the Holy Ancestor, the Yellow Emperor, then to Emperor Yao, Emperor Shun, and the Divine Yu.*\n\n*Yu transmitted it to Liu Yue, Yue to Wang Jing, Jing to Peng Taiji, Taiji to Deng Yuan, Yuan to Liu Yi, Yi to Liu Dongzhen, Dongzhen to Wang Yuan, Yuan to Peng Xiao, Xiao to Liu Xiyue, Xiyue to Lan Gongqiào, and Gongqiào to Peng Dezhi.*\n\n*Thus, ten thousand saints and true ones all received the transmission.*\n\n*Those with accumulated blessings and predestined fortune who seek a master to receive this transmission must sincerely present offerings, follow the ritual protocols, and pledge with gold and silk to uphold the covenant. The transmitting master must be one who has received the Three Daoist Canons, the Four Auxiliaries, and the Nine-Heavens Golden Scrolls, only then may they follow the protocols to initiate the transmission. If their virtue and rank are still modest and their merits unproven, they must not presumptuously claim the title of master or recklessly divulge the sacred texts.*\n\n*To hold and practice this scroll in accordance with its teachings can dissolve ancestral grudges, cease lawsuits and calamities, sever evil karmic roots, subdue demonic foundations, and dispel suffering. It can rob spirits of their divine insight, cause malevolent ghosts to flee, annihilate demons that disrupt nature, and crush evil that obstructs nobility. If one’s fate is grim and their destiny low, yet they revere this secret text without negligence, diligently tend to incense and offerings, and meditate upon the scriptures and incantations, they shall avert celestial calamities, repel earthly disasters, extend their fortune, sever demonic influences, clarify their divine nature, and flourish in literary brilliance.*\n\n*If one’s fate is not yet noble and their literary endeavors stifled, yet they faithfully adhere to this treasure scroll and practice accordingly, they must solely dedicate themselves to benefiting others—severing poison, healing the sick, and saving at least three hundred and sixty people. Accumulating such great merit, they shall ascend to high fortune and noble rank, be recorded in the worthy registers, and aid the enlightened age as the most noble of officials. Their fortune shall extend to their descendants, bringing glory to their lineage.\"*\n\n「If one can practice the wondrous *miao* methods (*妙行*) of the scriptures and treasure scrolls (*经箓*), maintaining purity of body and mind, clarity of *shen* and *qi*, and even in advanced years (*年齿既高*), they shall attain the *Taiyin* Refinement of Form (*太阴炼形*), achieving the *Shixie* Dao (*尸解之道*)—transcending the cycle of rebirth (*轮转*), ascending to the Daoist Celestial Capital (*仙都*), and becoming a True Person (*真人*).\n\nAll faithful and sincere practitioners (*清信之士*) who receive my treasure scrolls (*吾箓*) shall be petitioned by me before the Jade Emperor (*玉帝*) at the Golden Gate (*金阙*), recorded in the registers of the Three Elements (*三元*)—the Celestial Bureau of Fate (*天曹*), Earthly Bureau of Fate (*地府*), and Watery Bureau of Fate (*水府*)—for noble rank (*禄贵贤籍*), ensuring their body and mind remain ever enlightened (*究竟不昧*), and their entry into the ranks of the worthy (*贵籍*), aiding the enlightened age (*明时*).\n\nThe following are the Nine Heavenly Rankings (*九天较定*) for the Three Elements’ registers of noble rank (*天曹地府水府三禄三贵三贤科品*), now proclaimed:\n\n**First Bureau of the Heavenly Register (*上元天曹*) at Yuefu (*岳府*), overseeing celestial fortune (*司禄*), with three divisions (*三科三品*):**\n1. **First Division** – *Celestial Fortune Science (*天禄科*)*\n   Upper Rank: *Purple Micro Celestial Official (*紫微天官*)*\n   Middle Rank: *Grand Micro Celestial Official (*太微斗官*)*\n   Lower Rank: *Lesser Micro Celestial Official (*少微星官*)*\n\n2. **Second Division** – *Human Fortune Science (*人禄科*)*\n   Upper Rank: *Kings, Dukes, Marquesses, and Earls (*王公卿侯爵*)*\n   Middle Rank: *Regional Governors and Inspectors (*方伯监牧爵*)*\n   Lower Rank: *All other officials and scattered ranks (*百官散秩爵*)*\n\n3. **Third Division** – *Subterranean Fortune Science (*幽禄科*)*\n   Upper Rank: *Officials of Yuefu (*岳府官僚*)*\n   Middle Rank: *Officials of Dengdu (*邓都官僚*)*\n   Lower Rank: *Officials of Fusan (*扶桑官僚*)*\n\n**Second Bureau of the Earthly Register (*中元地府*) at Dengdu (*邓都*), determining noble rank (*定贵*), with three divisions (*三科三品*):**\n1. **First Division** – *Upper Noble Science (*上贵科*)*\n   Upper Rank: *Filial Piety (*孝行*)*\n   Middle Rank: *Chastity and Devotion (*守节*)*\n   Lower Rank: *Yin Virtue (*阴德*)*\n\n2. **Second Division** – *Middle Noble Science (*中贵科*)*\n   Upper Rank: *Kindness and Mercy (*仁慈*)*\n   Middle Rank: *Righteousness and Benevolence (*康义*)*\n   Lower Rank: *Moral Conduct (*德行*)*\n\n3. **Third Division** – *Lower Noble Science (*下贵科*)*\n   Upper Rank: *Worthy and Virtuous (*贤达*)*\n   Middle Rank: *Ancestral Virtue (*祖德*)*\n   Lower Rank: *Literary Merit (*文学*)*\n\n**Third Bureau of the Watery Register (*下元水府*) at Fusan (*扶桑*), advancing the worthy (*进贤*), with three divisions (*三科三品*):**\n1. **First Division** – *Upper Worthy Science (*上贤科*)*\n   Upper Rank: *Supreme Filial Piety (*至孝*)*\n   Middle Rank: *Great Loyalty (*大忠*)*\n   Lower Rank: *Kindness and Mercy (*慈仁*)*\n\n2. **Second Division** – *Middle Worthy Science (*中贤科*)*\n   Upper Rank: *Worthy through Righteousness and Benevolence (*康义之贤*)*\n   Middle Rank: *Worthy through Ritual and Law (*礼法之贤*)*\n   Lower Rank: *Worthy through Wisdom and Guidance (*智度之贤*)*\n\n3. **Third Division** – *Lower Worthy Science (*下贤科*)*\n   Upper Rank: *Worthy through Sincere Conduct (*笃行之贤*)*\n   Middle Rank: *Worthy through Talent and Learning (*才学之贤*)*\n   Lower Rank: *Worthy through Allotted Destiny (*分定之贤*)*\n\nAll the above divisions and ranks shall be used to evaluate the world’s people (*较录世人*). Those who enter these divisions and ranks shall be granted celestial fortune (*注禄*), noble rank (*定贵*), and advancement in the worthy registers (*进在贤籍*).\n\nI shall dispatch the *Yanpu* Daoist Officials (*演谱仙官*), who shall assist and extol virtuous deeds (*翊赞善功*), illuminate divine insight (*开明神鉴*), and send the *Chuzuo* Divine Assistants (*储佐列神*) to sever demonic obstacles (*断除魔障*), bestowing upon them the Heavenly Edicts and Jade Scriptures (*天章玉文*), safeguarding their vital fields (*镇护身田*). Auspicious signs shall manifest (*兆祥应寝*), and the True *Qi* of the Central Emperor (*中皇真炁*) shall nourish their body and mind (*启沃身心*). By imperial decree (*敕*), the gods of tranquil will and enlightened wisdom (*安志益慧之神*) shall be invoked to settle the hundred critical junctures (*定百关*), sharpen their acuity, and guide them to clarity (*开聪导明*), advancing their talents (*进其才华*) and refining their spiritual insight (*通其灵鉴*), just as decreed in the *Wenchang* Science and Legal Edicts (*文昌科法律令*).\n\n**The *Wenchang* Tianyanpu System of Ranks (*文昌天演谱系品*):**\nBy the Imperial Edict (*帝君圣诰*) of the Jade Gate’s High Minister (*金阙上相*), who inspects and oversees the Grand Master of All (*检校太师*), the Inner Assistant of the Mixed Primordial (*混元内辅*), and the Three Pure Ones’ Supreme Command (*三清上圣大都督府*), who governs the Three Realms (*三界*) and dispatches the Yin Armies (*阴兵*) as expedient (*行便宜事*), who oversees the judicial affairs of the Heavenly, Earthly, and Watery Realms (*管天地水三界狱事*), who collects the True Forms of the Five Peaks and Four Seas (*收五岳四渎真形虎符龙券*), who commands all celestial luminaries (*总诸天星曜*), who adjudicates the succession of the *Gui* Registers (*判桂禄嗣籍*), who is the Celestial Hero, the Most Noble True Person (*上仙英显元皇真人*), the Official in Charge of Fortune and True Recommendations (*司禄职贡举真君*), the Illuminating Sage of Penetrating Truth (*洞照通真先生*), the Compiler of the Flying Daoist Registers (*编修飞仙列籍*), and the Master of the Mixed Primordial Creation, Reincarnation, and Six Realms of Suffering (*掌混元造化轮回六道救苦救难慈尊*), the Pure Daoist of the Jade Realm (*玉清内境清净道真*), whose form is seen amidst the Purple Clouds (*身见紫云岩*), who wields the Auspicious Staff (*手持如意杖*), who governs all spirits and universally saves from suffering (*统御万灵普济诸苦*), the Most Supreme Benevolent, Merciful, and Holy Emperor of Non-Exalted Joy (*大仁大孝大圣大慈无上不骄乐天帝*), the Supreme Commander of the Mixed Heavenly Sincere Heart, who interfaces with all (*都总混天诚心接物万天教主*), the Compassionate Sovereign who Responds to Wishes (*随愿慈应天尊*), the Nine Heavenly Ruler of Destiny, Life Preservation, and Teaching (*九天定元保生扶教开化主宰*), the Great Emperor of Eternal Auspice and Abiding Assistance (*长乐永佑灵应大天帝君*), who governs the Five Lakes and Four Seas, overseeing the Twelve Rivers’ sources and the Watery Realm’s administration (*掌五湖四海总十二河源水府运使*), who Clarifies True Observations and Records Fortune (*澄真正观注禄定籍*), who Shines Benevolent Light to Govern the Age and Manifest the Dao (*宝光慈应治世显道*), who Preserves Peace and Extracts Guilt (*保安拔罪*), who Renews Life and Extends Eternity (*更生永命*), who Supports the Good and Relieves Suffering (*扶善济苦*), who Dissolves Calamities and Practices Transformation (*消劫行化*), and the Pure One of Unified Manifestation (*纯一显应天尊*).\n\nThis Sovereign (*帝君*) bears the surname Zhang (*张姓*), with the given name Ya (*讳亚*), corresponding to the constellations Zhang and Yi (*上应张翼二宿*), born in the Zhou Dynasty’s early era (*周初*) at the Radiant Gathering place (*昊会之地*), on the third day of the second month (*二月三日*) as his sacred birthday (*圣诞*).\n\nThe Mixed Primordial Parents (*混元父母*) are the same root as Heaven and Earth (*天地同根*). The siblings, born of the same *Qi* and flesh (*胞胎骨肉*), are one *Qi* divided into bodies (*一炁分身*).」\n\nThe cosmic threads of creation are woven with boundless illumination.\nThe Great Dao is proclaimed and the natural order is aided.\nDivine radiance descends, and a hundred blessings converge.\nEvil obstructions are repelled, and true *qi* endures eternally.\nSwiftly, as the decrees of the Celestial Worthy of Manifested Auspices!\n\nThe Celestial Worthy of Auspicious Regeneration and Accumulated Blessings,\nThe Great Saint of Eternal Life and Longevity, the Primordial Mother,\nThe Celestial Worthy of Accumulated Virtue and Auspicious Blessings,\nThe Celestial Worthy of Illustrious Harmony and Profound Mystery,\nThe True Lord of Succeeding Virtue and Celestial Auspices,\nThe Celestial Lord of Tranquil Response,\nThe True Lord of Auspicious Virtue and Celestial Destiny,\nThe Celestial Lord of Succeeding Auspices,\nThe Celestial Lord of Virtuous Purity and Serene Tranquility, the Eternal Worthy of Celestial Auspices,\nThe Sacred Consort of the Holy Palace, the Virtuous and Auspicious Four Consorts,\nThe Celestial Immortal of Accumulated Auspices,\nThe Celestial Lord of Accumulated Auspices,\nThe Celestial Immortal of Inherited Auspices,\nThe Celestial Lord of Inherited Auspices,\nThe Divine General of Ling Mountain, Zhang Zhongsi,\nThe Northern Gate Mountain God of Shu, Zhang Zhongzi,\nThe Divine General of Jian Mountain, Zhang Xun,\nThe Shu-Jian Mountain God, Zhang Xiaozhong,\nThe Divine General of Jinma Mountain, Zhang Lie,\nThe Prince of Zhao, Liu Ruyi,\nThe Celestial Marquis of Manifested Auspices,\nThe Celestial Duke of Illustrious Response,\nThe Celestial Duke of Received Auspices,\nThe Celestial Duke of Precious Spirit,\nThe Celestial Lady of Joyful Response,\nThe Celestial Lady of Wondrous Response,\nThe Celestial Princess of Gentle Virtue.\n\nTo the right, the Sacred Officials of the Eighty-One Celestial Ministers,\nCommanding armies as decreed by the scriptures.\nThe Celestial Assistants of Auspicious Regeneration, ranked among the gods:\nThe Duke of Outstanding Virtue,\nThe Lady of Manifested Cooperation,\nThe Duke of Divine Succession and Beauty,\nThe Duke of Divine Succession and Auspiciousness,\nThe Lady of Blessing,\nThe Lady of Serene Obedience,\nThe Grand Marshal of Celestial Auspices,\nThe Left and Right Marshals of Celestial Auspices,\nThe Left and Right Generals of Celestial Auspices,\nThe General of Celestial As-You-Wish,\nThe Left and Right Chancellors of Celestial Auspices,\nThe Left and Right Masters of Ceremonies of Celestial Auspices,\nThe Three Dukes and Nine Ministers of Celestial Auspices,\nThe Six Departments’ Secretaries of Celestial Auspices,\nThe Grand Censor of Celestial Auspices,\nThe Senior Marshal True Lord of Celestial Auspices,\nThe Junior Marshal True Lord of Celestial Auspices,\nThe Noble Minister True Lord of Celestial Auspices,\nThe True Lord of Celestial Destiny,\nThe True Lord of Celestial Destiny and Fortune,\nThe True Lord of Celestial Central Authority,\nThe True Lord of Celestial Nobility,\nThe True Lord of Celestial Letters,\nThe Celestial Marshal of Steadfast Virtue,\nThe Celestial Marshal of Steadfast Nobility,\nThe Celestial Marshal of the Arc Star,\nThe Celestial Marshal of the Solving Star,\nThe Celestial Marshal of Auspicious Response,\nThe Celestial Marshal of Descending Rest,\nThe Celestial Marshal of Tributary Offerings,\nThe Celestial Marshal of Inspecting Yin Merit,\nThe Celestial Marshal of Determining Grant or Denial,\nThe Celestial Marshal of Augmented Fortune and Destiny,\nThe Four Direct Functionaries of Celestial Auspices,\nThe Transmitting Edict Functionary of Celestial Auspices,\nThe Boy Attendant of the Laurel Register of Celestial Auspices,\nThe Grand General of Celestial Auspices for Descending Rest,\nThe Lady Consort of the Mountain King, the Illustrious Marquis of Transformation,\nOverseeing the Eight Scenic Jade Flower Hall Celestial Ministers.\n\nThe Celestial Duke of Auspicious Response of the Phoenix Cabinet.\n\nTo the right, the Celestial Assistants of Auspicious Regeneration,\nWith solemn and awe-inspiring demeanor,\nDividing the true and descending the numinous,\nGuarding and protecting the sacred body,\nAs decreed by the law.\n\nThe Sword Gate Mountain God, Bai Gui,\nThe Western Frontier Flying Yue Mountain God, Lian Jie,\nThe Western Domain Snow Mountain God, Bai Hui,\nThe Sword Gate Mountain God, Yuanchang,\nThe Qingli Mountain God, Haojian,\nThe Baigu Mountain God, Yimin,\nThe Great Min Mountain God, Weilian,\nThe Qingcheng Mountain God, Xiyiqiong,\nThe Min Mountain Cave Heaven God, Pengyuan,\nThe Min Mountain God, Heji,\nThe Great E Mountain God, Caoying,\nThe Xiao Min Mountain God, Yuguan,\nThe Emei Mountain God, Lishanyou,\nThe Wuyue Mountain God, Wangxuanfu,\nThe Fen Zhang Mountain God, Zhang Wei,\nThe Grand Commander of the Great General Staff, Wang Xiushui,\nThe Li Ruoshui of the Stone Rhinoceros Dragon Cave,\nThe Prefect of Guan Kou, the Dragon God Tan Long, Liu Chengzhi,\nThe City God of West Shu, Wei Gao,\nThe Community Order God of Yizhou, Du Qichang,\nThe Community Chief of West Shu’s Sword South, Deng Wen,\nThe West Shu Community God, Du Yu,\nThe West Shu West Vicinity Community Duke, Zhang,\nThe Phoenix Mountain God, Duqu Zheng,\nThe Domain God of Shu, Duan Xiu,\nThe Min Mountain Dragon God, Gou Pan,\nThe Guan Kou Supine Dragon Pool God, Jianzao,\nThe Qingyi Dragon God, Jing Boren,\nThe Yuezuo Mountain God, Xiao Fu,\nThe North Gate Mountain God, Zhang Shuhuo,\nThe West Sea Dragon God, Bai Guimin,\nThe Dongting Dragon God, Jingyuan,\nThe Junshan Mountain God, Tang Feng,\nThe Celestial Sea Water God, Pengyan,\nThe Domain God of Shu, Yu Qishu,\nThe Domain God of Qiongzhou, Sun He,\nThe West Shu Filial Piety God, Cui Juan,\nThe King of the Po Sa Ba, Xuan Anxing,\nThe Filial Piety Land God, Bai Zhi,\nThe Han Water Borough Land God, Kang Chao Wang,\nThe Ji Rao Borough God, Gong Sun Chang,\nThe Baxi Borough God, He Lai Sun,\nThe Bai Ma Borough God, Mo Zhi Jian,\nThe Ji Borough God, Su Gong Chang,\nThe Qiqu Mountain God, Quan Li.\n\nTo the right, the Forty-Five Departments of Auspicious Dragon Gods of the Seven Bends Phoenix Mountains,\nEach commanding armies and degrees.\n\nThe Celestial Auspices’ Jade Text of Heavenly Chapter,\nThe Southern Dipper’s Celestial Auspices Chapter:\nThe Mystic Transformation of the Supreme Ultimate,\nThe True Text and Profound Mechanism.\nOverseeing celestial charts, guarding terrestrial maps,\nRegulating the watery domains—together with the Three Primordials.\nThe Purple Court’s grand proclamation, heaven and earth alike responding.\nAs-you-wish in the heart, jade pressing in harmony.\nThis hidden text, the Three Realms united.\nRitual and music established, chaos now unfurled.\nThe Great Luo revealed, ascending the scene and stepping on the void.\nThe wise in learning, instructing the foolish below.\nSwiftly, as the decrees of the Jade Text Wheel!\n\nThe Auspicious Seizing Gem of the Jade Text—\nThis Jade Text amulet, inscribed on the wooden altar,\nEstablished on the *ding* day, with sandalwood incised,\nChild above, *chong* below, forming the Gate of the Center.\nFor the Gate of the Center.\n\nThe **Wenchang Palace’s Auspicious Seizing Gem**—\nWhen *Shēn* governs *Yǒu*, entering and exiting as the honored one.\nWhen *Chén* seeks *Xū*, the *Kui* and *Gāng* align with the Primordial.\nWhen *Mǎo* ascends to *Yín*, the Heavenly Primordial and Earthly Wheel unite.\nWithin *Chǒu*, seeking *Wèi*, the Gate of the Inner Chamber fully opens.\nWithin *Wèi*, obtaining *Hài*, the hidden and inverted harmonize.\n\nThe **Right Hidden Secret Incantation**—\nUnveiling the Three *Qi*’s True Text of *Wenchang*,\nThose who attain it should purify the heart and refine the *qi*,\nDiscarding falsehoods to embrace the True,\nCutting off all unrighteous thoughts—no evil imaginings.\nNaturally, wisdom and brilliance increase,\nLiterary splendor flourishes,\nAscending the *Yuèzhāng* Heavenly Seal—\nWorthy to wear and revere,\nWarding off evil, dispelling malevolence,\nDissolving all demonic obstructions.\n\n**Wenchang’s Heavenly Heart Jade Text**—\nA treasure of the Highest Heaven, secretly kept in the Mysterious Capital,\nWhere ten thousand spirits attend and the Three Realms obey.\nThe **Wenchang Upper Palace’s Jade Text of Ascending the *Yuèzhāng***—\nAbove, it governs the Heavenly Root;\nIn the middle, it inspects the stars;\nBelow, it discerns earth and water,\nPiercing the obscure and fathoming the dark.\nOpening benevolence and removing dullness,\nDispelling and repelling demonic mists.\nSevering the Three Corpses,\nDecapitating the Nine Vermin.\nDemons and ghouls retreat in hiding,\nDroughts and floods bring no obstruction.\nIf held with reverence, one ascends in broad daylight.\n\n**Wenchang’s Central Sovereign’s *Qi*-Generating Brand**—\n**The Sovereign’s Nine Paths Commanding Life’s *Qi*-Generating Diagram**—\nSince birth, humans receive their fate,\nTheir innate nature and roots vary—\nSome are born with brilliance and literary grace,\nA blessing of past karmic ties,\nWhile others are dull and obtuse,\nA result of past misdeeds.\nAmong those who strive for merit,\nFew attain even one in a hundred,\nAnd among those who delve into the Profound Mechanism,\nScarcely two or three in a thousand succeed.\nIf one turns the heart to the Dao,\nStudies the Text, and explores the Profound,\nThey should wear the *Qi*-Generating Diagram,\nRecite the *Huòluò* True Speech,\nNaturally invoking *Wenchang*,\nWhere celestial officials and spirit clerks guard their person,\nEnhancing wisdom and eloquence,\nIlluminating literary splendor,\nAdvancing in fortune and achieving renown.\n\nFor those born in **Child (Zǐ)** and **Ox (Chǒu)**—\nAspiring to literature and seeking the Profound,\nCommand the *Tiāngāng* Eight Learning Spirit Officials to attend their heart and mind.\nFor those born in **Tiger (Yín)**—\nStudying literature and advancing to the Profound,\nCommand the *Wēiliè* Northern Palace True Official to attend their heart and mind.\nFor those born in **Rabbit (Mǎo)**—\nMastering literature and exploring the Profound,\nCommand the *Dìngshén Yǎngruì* Positioned Spirit Lord to attend their heart and mind.\nFor those born in **Dragon (Chén)**—\nTurning to learning and entering the Profound,\nCommand the *Ānhuì Yèwén* True Person to attend their heart and mind.\nFor those born in **Snake (Wèi)**—\nPracticing scripture and indulging in the Profound,\nCommand the *Rénjiè Wēiguāng* Spirit Gentleman to attend their heart and mind.\nFor those born in **Horse (Wǔ)**—\nStudying scripture and broadly exploring the Profound,\nCommand the *Bǎoyì Dìngguāng* Grand Historian to attend their heart and mind.\nFor those born in **Sheep (Wèi)**—\nDiligently studying and clarifying the Profound,\nCommand the *Tàihé Liùxíng* Six Ranks Chancellor to attend their heart and mind.\nFor those born in **Monkey (Shēn)**—\nAdvancing to the *Luán* and ascending the Profound,\nCommand the *Yuánmìng Zǒngxiá* True Vizier to attend their heart and mind.\nFor those born in **Rooster (Yǒu)**—\nPracticing literature and striving for the Profound,\nCommand the *Dōnghuá Xiùyī* Embroidered-Robe Messenger to attend their heart and mind.\nFor those born in **Dog (Xū)** and **Pig (Hài)**—\nClarifying scripture and expounding the Profound,\nCommand the *Wenchang Yìjiè* Righteous Aid King to attend their heart and mind.\n\n**Seasonal Governance:**\nBefore and after the **Spring Equinox**, governing *Kàn* (North).\nBefore and after the **Summer Solstice**, governing *Lí* (South).\nBefore and after the **Autumn Equinox**, governing *Xùn* (East).\nBefore and after the **Winter Solstice**, governing *Kǎn* (West).\n\nThose who seek the Profound and fathom the subtle must examine their origins.\nOnly then will they know their innate reception—\nNoble or lowly, the gradations of rank,\nThe depth of their fate, their inner purity.\nIf merit arises from shame or neglect,\nAll their aspirations will be fulfilled.\nThis must be carefully considered.\n\n**Wenchang’s *Qi*-Generating Unified Form’s True Command *Huòluò* True Speech:**\n*Ōm lì lì nà, ā xī xī hū hū, hé hé kuí à, hē kǒu bàn pútí duō.*\n*Shì dòng zhà nán, jī xūkōng xún, qiāng gū dǐng yuè, hōng hōng ní ní.*\n*Shǎn shǎn shuò shuò, guāng wén huá qīng, dìng yì jí fù, qī xīng qiào yáo.*\n*Jìn dū huáng shén, móhē bōrú, dìng dīng dū lǜ, tǔ nà zhēnyuán shè.*\n*Hùnyuán zhēnbó, tōng wù xuán jī.*\nAs the decrees command!\n\n**Wenchang’s Stabilizing Will and Enhancing Wisdom Brand:**\n**Wenchang’s Commanding Fortune, Stabilizing Nobility, Calming Spirit, and Enhancing Wisdom Incantation**—\nOn the eastern bank of the Eastern River,\nTo the south of the Western Forest,\nThere is the God-King *Huá*,\nThe Primordial Sovereign who receives the Mandate.\nHe governs *Wenchang*’s noble office,\nEight Confluences vibrating with literature,\nNine Radiant Lights illuminating the scholar.\nThe Great Seal is firmly set,\nThe Jade Maiden assists in writing,\nThe Dragon Maiden of ten thousand,\nAiding the literary chamber.\nA hundred thousand clerks,\nStabilizing the heart, grasping the pivot,\nMaking my body one with the enlightened and luminous.\nThe Dao aligns with the times,\nTen thousand chapters brightly revealed,\nPaying homage to the Emperor, carving the Text,\nGazing upward to contract with the Imperial Scripture.\nLet my decrees be proclaimed,\nSitting to achieve peace—\nOn an auspicious day, receiving the talisman,\nUnfurling the chapter to perform the ritual.\nEight Auras bolstering courage,\nDragon radiance soaring through the sky,\nTen intelligences enhancing wisdom,\nThe *Huòluò* dispelling ignorance.\nMind at ease, will manifest,\nTen thousand transformations freely flowing,\nDivine insight discerning,\nHeaven’s aid manifesting in the Text.\nNobility should ride upon it,\nFortune should be augmented with it,\nLet me achieve greatness,\nLiterary splendor ever flourishing.\nPlucking the Azure Dragon Maiden,\nProclaiming the True Yang,\nReciting the Jade Chapter once,\nNine Heavens’ light opens.\nTen thousand transformations brightly revealed,\nDivine and luminous presiding,\nLet my divine function,\nAscend to loyal excellence.\nAs the decrees command!\n\nThis **Jade Chapter** is named the **Nine Heavens’ Opening Enlightenment Calming Spirit and Enhancing Wisdom Incantation**—\nA text of the Primordial Great Cataclysm’s Mysterious Capital,\nWords without melodious beauty,\nMusic without ornate grace,\nDeep beyond measure,\nWondrous beyond speech,\nUnheard in the mortal world,\nUntransmitted by the vulgar.\nIt is secretly kept in the *Zǐyáng* Jade Case of Cloud-Brocade.\n\nIn antiquity, the **Nine Dragons’ Ancestor, the Three Primordials’ Pure Substance Dao Lord**,\nBefore the **Primordial Beginning Heavenly Venerable**,\nPresided over the alliance and requested the talisman,\nPassing it down to the **Upper Primordial Lady** and the **Cloud-Hua Lady**,\nWho taught it to the world, instructing sincere and reverent scholars and virtuous officials.\nIf one sincerely wears and recites it,\nThey will attain radiant literary brilliance,\nDivine insight’s discernment,\nAscending to noble selection,\nAssisting the Imperial Will,\nBroadly promoting literary culture,\nPropagating the True Transformation,\nForever as a personal treasure,\nTo be followed and practiced as taught.\n\n**End of the Highest Mysterious Capital *Wenchang* Commanding Fortune *Zǐyáng* Sacred Register, Volume One**\n\n**Highest Mysterious Capital *Wenchang* Commanding Fortune *Zǐyáng* Sacred Register, Volume Two**\n\nAccording to the record of **a certain resident and devout Daoist practitioner**,\nBorn on the **year, month, day, and hour** of my life,\nBelonging to the **North Dipper’s** [star] Lord’s governance,\nI, with sincere devotion, respectfully knelt before the **Degree Master, Teaching Master, and Great True Person of the Dao**,\nBowing to receive the **Highest Mysterious Capital *Wenchang* Commanding Fortune *Zǐyáng* Sacred Register** in its entirety,\nAnd now wear and revere it as my body’s treasure.\n\nI solemnly vow to hold in highest reverence the **Imperial True One**,\nTo follow the **precepts and prohibitions** with devotion,\nTo advance in **literary cultivation** and accumulate **meritorious deeds**,\nTo awaken to the **Highest Sovereign’s** mysterious mechanisms,\nTo dispel demonic obstructions and ascend to the **Wenchang’s** noble register,\nTo achieve distinction in **scholarly rank** and benefit the world in peace,\nTo preserve life and benefit all beings.\n\nShould I violate these precepts,\nI shall offer my body in atonement to the **Three Officials of Heaven, Earth, and Water**,\nAs decreed by the **Mysterious Statutes**!\n\n---\n**Wenchang’s Simplified Review Sacred Diagram**\n\nThe **Wenchang Sacred Diagram** originates from the **Chaos’s primordial division**,\nWhen the **Highest Supreme Jade Emperor’s** *qi* coalesced into script,\nWith **crimson clouds and emerald mists** naturally forming chapters.\nIt emanates from the **Primordial Beginning Heavenly King**,\nYet bears a distinct name while sharing the same source.\nIt was sealed within the **Upper Clarity Dragon’s Network and Mysterious Phoenix Pavilion**,\nAnd enshrined in the **Purple Yang Nine-Light Phoenix Glory Gate**,\nWhere the **Wenchang Imperial Person, the Mysterious Origin Dao Lord, and Master** preside as sovereigns of the Diagram’s Gate.\nThis Sacred Diagram is commissioned to **generate virtuous scholars and worthy sages**,\nTo assist the **sacred lineage of kingship and the Dao’s path**,\nSo that **talented and cultured figures flourish eternally**.\nThose who wear and revere it shall receive the **Mysterious *qi* descending as spirit**,\nWith **literary brilliance and refined elegance**,\nTheir **talent and insight unbounded**,\nTheir **inner light reaching all things**,\nNo thousandfold obstruction able to block them.\nThey shall be attended by **three hundred sixty gold boys, jade girls, celestial officials, and divine clerks**,\nWho follow the talisman to guard their person.\n**You must revere and uphold this with sincerity.**\n\n---\n**Degrees of Wenchang’s Attendant Gold Boys (360)**\n**Degrees of Wenchang’s Attendant Jade Girls (360)**\n**Degrees of Wenchang’s Celestial Officials (360)**\n**Degrees of Wenchang’s Divine Clerks (360)**\n**Degrees of Wenchang’s Three-Five Destiny Clerks (360)**\n**Degrees of Wenchang’s Three-Five Mind Clerks (360)**\n**Degrees of Wenchang’s Three-Five Will Clerks (360)**\n**Degrees of Wenchang’s Three-Five Intent Clerks (360)**\n**Degrees of Wenchang’s Three-Five Hearing Clerks (360)**\n**Degrees of Wenchang’s Three-Five Wisdom Clerks (360)**\n**Degrees of Wenchang’s Three-Five Courage Clerks (360)**\n**Degrees of Wenchang’s Three-Five Harmonizing Spirit Clerks (360)**\n**Degrees of Wenchang’s Three-Five Uniting Spirit Clerks (360)**\n**Degrees of Wenchang’s Three-Five Reaching Clerks (360)**\n**Degrees of Wenchang’s Three-Five Opening Insight Clerks (360)**\n**Degrees of Wenchang’s Three-Five Comprehensive Knowledge Clerks (360)**\n**Degrees of Wenchang’s Three-Five Repelling Evil Clerks (360)**\n**Degrees of Wenchang’s Three-Five Removing Obstructions Clerks (360)**\n**Degrees of Wenchang’s Three-Five Generating *Qi* Clerks (360)**\n**Degrees of Wenchang’s Three-Five Literary Clerks (360)**\n**Degrees of Wenchang’s Three-Five Opening Nature Clerks (360)**\n**Degrees of Wenchang’s Three-Five Bestowing Fortune Clerks (360)**\n**Degrees of Wenchang’s Auspicious Sleeping Celestial Clerks (360)**\n**Degrees of Wenchang’s Assisting Virtuous Dragon Girls Clerks (360)**\n**Degrees of Wenchang’s Assisting Literary Jade Girls Clerks (360)**\n**Degrees of Wenchang’s Assisting Literary Water Clerks and Jade Consorts (1)**\n**Degrees of Wenchang’s Yellow Gods, Jade Seals, and Taiyi Envoys (8)**\n**Degrees of Wenchang’s Transcending Chapters, Encompassing Heaven Jade Girls (8)**\n**Degrees of Wenchang’s Eight Scenes, Jade Splendor Hall, and Seal-Bearing Officials (1)**\n**Degrees of Wenchang’s Sword-Master God-King Jade Girls (8)**\n\n---\nThis **Wenchang Sacred Diagram Jade Talisman** is bestowed upon disciple [name],\nEnrolled under the **gold boys, jade girls, celestial officials, and divine clerks**.\nWhen encountering the **Three Celestial Days**,\nPurify the heart with fasting, bathe in ritual purity,\nOffer sincere sacrifices to seek **auspicious repose** and advancement in **ranked merit**,\nAs per the **pledge and received faith**—to be upheld faithfully.\n\n---\n**Wenchang’s Fortune-Commanding Jade Talisman**\n\n**Upper Primordial Heavenly Bureau’s Fortune-Commanding True Lord (1)**\n**Upper Primordial Heavenly Treasury’s Fortune-Commanding True Lord (1)**\n**Upper Primordial Heavenly Treasury’s Celestial Fortune Clerks (81)**\n**Upper Primordial Heavenly Treasury’s Augmented Celestial Fortune Clerks (81)**\n**Upper Primordial Heavenly Treasury’s Human Fortune Clerks (81)**\n**Upper Primordial Heavenly Treasury’s Augmented Human Fortune Clerks (81)**\n**Upper Primordial Heavenly Treasury’s Celestial Rank Clerks (81)**\n**Upper Primordial Heavenly Treasury’s Augmented Celestial Rank Clerks (81)**\n**Upper Primordial Heavenly Treasury’s Human Rank Clerks (81)**\n**Upper Primordial Heavenly Treasury’s Augmented Human Rank Clerks (81)**\n**Upper Primordial Heavenly Treasury’s Nether Fortune Clerks (81)**\n**Upper Primordial Heavenly Treasury’s Augmented Nether Fortune Clerks (81)**\n**Upper Primordial Heavenly Treasury’s Nether Rank Clerks (81)**\n**Upper Primordial Heavenly Treasury’s Augmented Nether Rank Clerks (81)**\n\n---\nThis **Fortune-Commanding Jade Talisman** is bestowed upon disciple [name] to wear and cultivate,\nTo revere the **Wenchang Fortune-Commanding True Lords**,\nTo recite the **Highest Mysterious Purple Yang Jade Chapters**,\nNaturally summoning **celestial officials and divine clerks**,\nTo augment **wisdom and talent**, assist in **literary brilliance**,\nAnd ascend to **fortune and rank**,\nAs per the **pledged words**.\n\n---\n**Wenchang’s Destiny-Noble Golden Tablets**\n\n**Primordial Azure Heaven’s Cultivation Sovereign Destiny-Noble True Lord**\n**Supreme Azure Heaven’s Cultivation Sovereign Destiny-Noble True Lord**\n**Primordial Vermilion Heaven’s Cultivation Sovereign Destiny-Noble True Lord**\n**Supreme Vermilion Heaven’s Cultivation Sovereign Destiny-Noble True Lord**\n**Primordial White Heaven’s Cultivation Sovereign Destiny-Noble True Lord**\n**Supreme White Heaven’s Cultivation Sovereign Destiny-Noble True Lord**\n**Primordial Dark Heaven’s Cultivation Sovereign Destiny-Noble True Lord**\n**Supreme Dark Heaven’s Cultivation Sovereign Destiny-Noble True Lord**\n**Central Great Brahman Heaven’s Cultivation Sovereign Destiny-Noble True Lord**\n**Middle Primordial Underworld’s Upper-Rank Noble Clerks (36)**\n**Middle Primordial Underworld’s Middle-Rank Noble Clerks (36)**\n**Middle Primordial Underworld’s Lower-Rank Noble Clerks (36)**\n**Middle Primordial Underworld’s Imperial-Sage Noble Clerks (36)**\n**Middle Primordial Underworld’s Kingly Noble Clerks (36)**\n**Middle Primordial Underworld’s Ducal Noble Clerks (36)**\n**Middle Primordial Underworld’s Marquess Noble Clerks (36)**\n\n**Middle Primordial Underworld’s Count Noble Clerks (36)**\n**Middle Primordial Underworld’s Baron Noble Clerks (36)**\n**Middle Primordial Underworld’s Viscount Noble Clerks (36)**\n**Middle Primordial Underworld’s Official Noble Clerks (36)**\n**Middle Primordial Underworld’s Grandee Noble Clerks (36)**\n**Middle Primordial Underworld’s Parental Enfeoffment Clerks (36)**\n**Middle Primordial Underworld’s Official-Rank Clerks (36)**\n**Middle Primordial Underworld’s Shadowed-Son Noble Clerks (36)**\n**Middle Primordial Underworld’s Enfeoffed-Wife Noble Clerks (36)**\n**Middle Primordial Underworld’s Comprehensive Noble Registry Clerks (36)**\n**Middle Primordial Underworld’s Noble Lineage Clerks (36)**\n\n**The Golden Tablet of Registered Nobility**\nBy decree of the True Lords and Daoist Historians, the disciple [name] reverently receives and practices this scripture, thereby attaining the Golden Tablet of Registration. His name shall be inscribed in the Middle Primordial Underworld’s Noble Registry as an **Upper-Rank Noble**, granting him:\n- Honor in person,\n- Prosperity in livelihood,\n- Eminence in merit and fame,\n- Loyalty and filial piety before sovereign and kin,\n- Blessings extending to posterity—\nas sworn in the covenant.\n\n**The Jade Strategy of Advancing Merit**\n**Lower Primordial Watery Underworld’s Merit-Ascending Clerks (120 each):**\n- Upper Merit, Upper-Rank Noble Clerks\n- Upper Merit, Middle-Rank Noble Clerks\n- Upper Merit, Lower-Rank Noble Clerks\n- Middle Merit, Upper-Rank Noble Clerks\n- Middle Merit, Middle-Rank Noble Clerks\n- Middle Merit, Lower-Rank Noble Clerks\n- Lower Merit, Upper-Rank Noble Clerks\n- Lower Merit, Middle-Rank Noble Clerks\n- Lower Merit, Lower-Rank Noble Clerks\n- Merit-Ascending Virtuous Female Clerks (120)\n- Merit-Ascending Dragon-Maid Clerks (120)\n\nBy decree of the Watery Underworld’s officials, dragon-maid attendants, and divine consorts, the disciple [name], with diligent devotion, wears this scripture and:\n- Cultivates virtue and achieves merit,\n- Assists the Celestial Mandate,\n- Earns eternal renown—\nas sworn in the Merit Laws.\n\n**The Golden Seal of Demonic Subjugation**\n**Divine Clerks of the Central Bureau of Merit (10,000 each):**\n1. **First Merit Officer (Fu Xing)** – Leading Ten Thousand Generals\n2. **Second Merit Officer (Xun Ming)** – Leading Ten Thousand Generals\n3. **Third Merit Officer (Fei Zhi)** – Leading Ten Thousand Generals\n4. **Fourth Merit Officer (Pang Jue)** – Leading Ten Thousand Generals\n5. **Fifth Merit Officer (Lu Mao)** – Leading Ten Thousand Generals\n6. **Sixth Merit Officer (Song Bing)** – Leading Ten Thousand Generals\n7. **Seventh Merit Officer (Gao Yi)** – Leading Ten Thousand Generals\n8. **Eighth Merit Officer (Zhao Lu)** – Leading Ten Thousand Generals\n9. **Ninth Merit Officer (Zhao Qi)** – Leading Ten Thousand Generals\n10. **Tenth Merit Officer (Wang Shi)** – Leading Ten Thousand Generals\n\nBy the **Golden Seal of Demonic Subjugation**, the Merit Officers and Daoist Historians descend in unity to defend the disciple [name], who thereby:\n- Guards the heart-mind,\n- Illuminates true nature,\n- Ascends in nobility and fortune,\n- Achieves harmony and success,\n- Suppresses litigation and calamities with **Great Harmony True Qi**,\n- Crushes demons and banishes evil with **Great Cavern Celestial Soldiers**,\n- Resolves grievances and karmic debts,\n- Severing the roots of suffering,\n- Cultivating literary virtue and fame,\n- Ascending to noble registry,\n- Assisting the enlightened age—\nas decreed by the **File-Chang Laws**.\n\n**The Primordial Constitution of Transformation**\n**The Supreme Sovereign of the Purple Micro Celestial File-Chang**\n- Preserves the fate of kalpas,\n- Declares the mysteries of Heaven,\n- Transforms with flying cranes to benefit the world,\n- Protects life and extends years,\n- Enlightened practitioners attain sainthood and transcendence.\n\n**The Eastern Wall Celestial Diagram**\n**Jade and Pearl Scriptures of the Eastern Wall**\n*\"Five Phases converge in harmony—\nThe Eastern Wall’s celestial diagrams.\nBefore Heaven and Earth—\nJade tablets and pearls align.\nTrue Qi generates—\nThe transformative chariot moves.\nCultivate the literary, suppress the martial,\nPierce the mysteries of the Dark Metropolis.\nThe Minor Constellation’s recluse—\nThe virtuous dwell therein.\nI now study the lineage,\nAspiring to enter the Daoist thoroughfare.\nClarify true perception—\nThe Wish-Fulfilling Treasure Scroll.\n**Om! Ghosts, ghosts, ghosts, ghosts, ghosts, ghosts, ghosts!**\nAs decreed by the **Universal Marshal of the Great Void**!\"*\n\nBy this **Jade and Pearl Scripture of the Eastern Wall**, aligned with the Nine Heavens’ natural order and the **File-Chang’s arcane texts**, the recipient:\n- Opens divine insight,\n- Enhances talent and brilliance,\n- Invokes stellar blessings,\n- Dispels all obstructions and misfortunes—\nas decreed by the **Great Cavern File-Chang Laws**.\n\n**The Celestial Cavalry of the File-Chang Bureau**\n**Divine Clerks of the Great Cavern’s Celestial Cavalry (10,000 each):**\n- **Supreme General of the Golden Talisman** – Ten Thousand Armored Soldiers\n- **Supervising General of Merit** – Ten Thousand Armored Soldiers\n- **Cavalry General** – Ten Thousand Armored Soldiers\n\n*\"Nine Heavens open cultivation—\nThe File-Chang’s vast transformation.\nQi circulates universally—\nMysterious creation unfolds.\nTen thousand gods obey—\nTheir splendor soars.\nJade talismans and gold seals—\nBanish the Yellow Plague.\nDevour demons, consume ghosts—\nMonstrous calamities vanish.\nAwe resonates through the cosmos—\nUnshaken through kalpas.\nBy my decree, the Green Laws prevail—\nNo defiance of the oath!\nDivine light shall manifest instantly!\"*\n\n**One Hundred Twenty Rectifying Clerks** ascend.\n\n**Rectifying Clerks of the Dao:**\n\n- **One Hundred Twenty Clerks of Subduing Demons** ascend.\n- **One Hundred Twenty Clerks of Collecting and Consuming Plagues** ascend.\n- **One Hundred Twenty Clerks of Collecting and Consuming Demons** ascend.\n- **One Hundred Twenty Clerks of Collecting and Consuming Toxins** ascend.\n- **One Hundred Twenty Clerks of Collecting and Consuming Ghosts** ascend.\n- **One Hundred Twenty Clerks of Collecting and Consuming Spirits** ascend.\n- **One Hundred Twenty Clerks of Collecting and Consuming Black Qi** ascend.\n- **One Hundred Twenty Clerks of Collecting and Consuming Evil** ascend.\n- **One Hundred Twenty Clerks of Collecting and Consuming Vital Essence** ascend.\n- **One Hundred Twenty Clerks of Collecting and Consuming Demonic Beasts** ascend.\n- **One Hundred Twenty Clerks of Collecting and Consuming Monsters** ascend.\n- **One Hundred Twenty Clerks of Collecting and Consuming Malevolent Flocks** ascend.\n- **One Hundred Twenty Clerks of Collecting and Consuming Vermin** ascend.\n- **One Hundred Twenty Clerks of Punishing Evil and Destroying Shrines** ascend.\n- **One Hundred Twenty Clerks of Divine Physicians for Healing Illnesses** ascend.\n- **One Hundred Twenty Clerks of Relay Horses Reporting by Tablet** ascend.\n- **One Hundred Twenty Clerks of Flying Dragon Cavalry** ascend.\n\n**Right Palace Officials, Established with Commanding Seals, Overseeing Merit and Cavalry Generals of the Celestial Armored Soldiers:**\n\n*\"By decree, the Heavenly Armored Soldiers—\nSubduing evil, driving plagues—\nGuard the disciple’s body with radiant light,\nAwaken the mind with divine insight,\nExtinguish all malevolent obstructions,\nDrive away inauspicious omens.\nPlagues dare not intrude,\nMonsters vanish without trace.\nAll supplications are answered,\nWishes fulfilled as desired.\nAssisting in governing the sovereign’s virtue,\nProclaiming the orthodox Dao—\nAs decreed by the Sovereign Master of File-Chang,\nThe Golden Pattern of Purple Yang,\nThe order is proclaimed and obeyed.\"*\n\nThe disciple, **[Name]**, today with sincere devotion,\nHumbly prostrates before the Master of the Dao,\nThe Celestial Teacher, the Great True Person,\nReceiving the Supreme Scriptures and talismans,\nDevoted in body and spirit.\nAfter receiving the talismans,\nDaring not to slacken in diligence or betray sacred texts,\nAs sworn in the Celestial Precepts—\nIn accordance with the Highest Dao’s laws,\nAs recorded in the *Great Cavern File-Chang Bureau’s Register of Merit and Fortune*,\nThe *Purple Yang Golden Talisman Scroll*,\nNow complete.\n\n**Highest Supreme Great Cavern File-Chang Bureau’s Purple Yang Sacred Talisman Scroll, Lower Volume**\n\nAccording to the petition of the devout Daoist practitioner **[Name]**, residing in **[Location]**, who states:\n\n*\"By fate, I was born on the **[year]**, **[month]**, **[day]**, **[hour]**, under the governance of the **[specific star]** of the Northern Dipper. Today, with sincere devotion, I humbly prostrate before the Master of the Dao, the Teaching Sovereign, the Celestial Teacher, the Great True Person, receiving the *Highest Supreme Great Cavern File-Chang Bureau’s Purple Yang Sacred Talisman Scroll* in its entirety. With reverence, I accept and uphold it, earnestly aspiring to illuminate my true nature, penetrate my original mind, and not neglect study or reasoning, nor err in sight, hearing, speech, or action. I shall refine my virtue and talents, achieving success to assist the sovereign’s grand purpose, and when fortune is fulfilled, proclaim the orthodox Dao. I shall elevate the ruler above the sage-kings Tang and Yu, and benefit the people as in the reigns of Cheng and Kang. May blessings extend to my ancestors and descend through my lineage. I vow with diligence to uphold this path, eternally aiding the era of peace.*\n\n*Should I betray this oath, I shall abide by the original celestial decrees of the Nine-Heaven Sovereign.*\n\n**File-Chang, the Azure Heaven’s Nurtured Divine Rank**\n*Responding to the qi of the four solar Yang at the Spring Equinox.\"*\n\n**The Eastern Azure Heaven’s Sovereign, Master of the Orthodox Dao, holds the First Jade Chapter of Azure Heaven’s Nurtured Divine Rank**\n\n*Azure Heaven’s Jade Chapter unfolds,*\n*the Primordial Origin issues the Golden Decree.*\n*The Great Cavern opens the Celestial Palace of Azure Brilliance,*\n*the Radiant One’s light shines upon the Supreme Unity.*\n*The Azure Crystal returns the Seven Mansions,*\n*the myriad *qi* praise the Orthodox Dao of File-Chang.*\n\n*Jie-Ming aids the life of the Preeminent Sovereign,*\n*and his benevolent guidance extends without bound.*\n\nThis Jade Chapter,\neach morning attunes the voice and rectifies the *qi* by reciting the Nine Transgressions,\ngiving birth to the Primordial Spirit,\nand elevating one’s name to the Noble Rank.\n\n**The Eastern Azure Heaven’s Sovereign, Master of the Orthodox Dao, holds the First Jade Chapter of Azure Heaven’s Nurtured Divine Rank**\n*One Officer, Six Clerks,*\n*and ten thousand armored soldiers of the Great Cavern Heaven,*\n*transcending the ranks.*\n\n**File-Chang’s Rank of the Yang Heaven, assisting literary talents**\n*Responding to the *qi* of the six solar Yang at the Summer Solstice.*\n\n**The Southeastern Verdant Heaven’s Sovereign, Master of the Orthodox Dao, holds the Second Jade Chapter of Azure Heaven’s Nurtured Divine Rank**\n\n*The Great Cavern’s wind blows with might,*\n*The Dragon’s威 radiates through the Six *Qi*.*\n*Azure Heaven’s Jade Chapter spreads its divine strategy,*\n*and fixes the Noble Rank beneath the Three Primordial Cycles.*\n\n*It repels the obstructions of the Yin Demons,*\n*and opens the transmission of the Radiant One’s true nature.*\n*This Orthodox Dao preserves the blessings of the age,*\n*and its benevolent guidance extends without fault.*\n\nThis Jade Chapter,\neach morning calms the mind and rectifies the *qi* by reciting the Nine Transgressions,\nassisting and benefiting literary talents,\nand advancing one’s name in the Virtuous and Talented Ranks.\n\n**The Southeastern Verdant Heaven’s Sovereign, Master of the Orthodox Dao, holds the Second Jade Chapter of Azure Heaven’s Nurtured Divine Rank**\n*One Officer, Six Clerks,*\n*and ten thousand armored soldiers of the Great Cavern Heaven,*\n*transcending the ranks.*\n\n**File-Chang’s Rank of the Flaming Heaven, illuminating true talents**\n*Responding to the *qi* of the three Yin at the Autumnal Equinox.*\n\n**The Southern Crimson Heaven’s Sovereign, Master of the Orthodox Dao, holds the Third Jade Chapter of Azure Heaven’s Nurtured Divine Rank**\n\n*The Nine Marvels spread the wondrous *qi*,*\n*The Supreme Unity aids the Crimson Origin.*\n*It opens the luminous Heavenly Dipper,*\n*and the Sacred Light shines upon the Most Virtuous.*\n\n*The Emperor’s heart aligns with the divine strategy,*\n*The Godly Nature harmonizes with the Dragon’s compilation.*\n*Gathering the central concord of the landscape,*\n*This Orthodox Dao preserves the Great Completion.*\n\nThis Jade Chapter,\neach morning nourishes the spirit and attunes the *qi* by reciting the Nine Transgressions,\nilluminating true nature,\nand awakening innate talents.\n\n**The Southern Crimson Heaven’s Sovereign, Master of the Orthodox Dao, holds the Third Jade Chapter of Azure Heaven’s Nurtured Divine Rank**\n*One Officer, Six Clerks,*\n*and ten thousand armored soldiers of the Great Cavern Heaven,*\n*transcending the ranks.*\n\n**File-Chang’s Rank of the Vermilion Heaven, penetrating the Mysterious Dao**\n*Responding to the *qi* of the three Yin at the Autumnal Equinox.*\n\n**The Fourth Jade Chapter of Azure Heaven’s Nurtured Divine Rank,\nSovereign of the Southwest *Jǐngxiāo* Heaven**\n\n*Illuminating radiance condenses the eight wilds,*\n*The divine strategy aids the Central Sovereign.*\n*The elixir field expands luminous *qi*,\n*Clouds and flowers sharpen the light of wisdom.*\n\n*Leaning Lu slays demonic forces,*\n*The True Sovereign awakens Heaven’s Chapter.*\n*Literary splendor aids the Great Endeavor,*\n*Transcending aid forever flourishes.*\n\nThis Jade Chapter,\neach morning attunes mind and *qi* by reciting the Nine Transgressions,\npenetrating profound mysteries,\nas divine light spontaneously arises.\n\n**Sovereign of the Southwest Vermilion Heaven’s Opening Transformation,\nMaster of the *Jǐngxiāo* Penetrating the Mysterious Dao**\n*One Officer, Six Clerks,*\n*and ten thousand armored soldiers of the Great Cavern Heaven,*\n*ascending the ranks.*\n\n**File-Chang’s Crimson Heaven’s Noble Acclaim Rank**\n*Responding to the *qi* of the four Yin at the Autumnal Equinox.*\n\n---\n\n**The Fifth Jade Chapter of Azure Heaven’s Nurtured Divine Rank,\nSovereign of the Western *Yùxiāo* Heaven**\n\n*Purple Yang nourishes the Great Dawn,*\n*Refined essence deepens naturally.*\n*The Moon Mother births the Golden Son,*\n*The Mysterious Heaven enriches the Emperor’s heart.*\n\n*The Supreme True dances with wings unfurled,*\n*Yin and Yang unite in dual harmony.*\n*Literary Dao flourishes eternally,*\n*Crimson reishi thrives in the Jade Forest.*\n\nThis Jade Chapter,\neach morning steadies the heart and rectifies the *qi* by reciting the Nine Transgressions,\nentering the register of the worthy,\nand awakening to the Great Dao.\n\n**Sovereign of the Western Dawn Heaven’s Opening Transformation,\nMaster of the *Yùxiāo* Entering the Worthy Rank**\n*One Officer, Six Clerks,*\n*and ten thousand armored soldiers of the Great Cavern Heaven,*\n*ascending the ranks.*\n\n**File-Chang’s Gloomy Heaven’s Virtue Rank**\n*Responding to the *qi* of the six Yin at the Winter Solstice.*\n\n---\n\n**The Sixth Jade Chapter of Azure Heaven’s Nurtured Divine Rank,\nSovereign of the Northwest *Tàixiāo* Heaven**\n\n*The North is named profound and boundless,*\n*Literary grandeur rests beneath the Great Dawn.*\n*The Heavenly opens the Great Transformation,*\n*Purple Extremity aligns with the Dipper’s handle.*\n\n*The Primordial Father begets the Ninth Stem,*\n*File-Chang issues the Cavern’s hymns.*\n*The Nine Dragons proclaim the noble register,*\n*Wondrous use benefits the Mysterious Void.*\n\nThis Jade Chapter,\neach morning attunes mind and rectifies the *qi* by reciting the Nine Transgressions,\nestablishing the foundation of virtue,\nand talents soar beyond measure.\n\n**Sovereign of the Northwest Gloomy Heaven’s Opening Transformation,\nMaster of the *Tàixiāo* Virtue Rank**\n*One Officer, Six Clerks,*\n*and ten thousand armored soldiers of the Great Cavern Heaven.*\n\n**File-Chang’s Mysterious Heaven’s Noble Acclaim Rank**\n*Responding to the *qi* of one Yang at the Winter Solstice.*\n\n---\n\n**The Seventh Jade Chapter of Azure Heaven’s Nurtured Divine Rank,\nSovereign of the Northern *Zǐxiāo* Heaven**\n\n*The Primordial One expands the Origin,*\n*Divine communication reveals the wondrous spirit.*\n*Literary splendor aids the flourishing of File-Chang,*\n*Martial might subdues the demonic host.*\n\n*Converging gives birth to divine excellence,*\n*Heroic bearing renews with the sun.*\n*Preeminent Yang participates in the Great Transformation,*\n*Transcending aid supports Heaven and humanity.*\n\nThis Jade Chapter,\neach morning harmonizes voice and rectifies the *qi* by reciting the Nine Transgressions,\nascending to noble selection,\nas divine aid accelerates literary success.\n\n**Sovereign of the Northern Mysterious Heaven’s Opening Transformation,\nMaster of the *Zǐxiāo* Noble Acclaim Rank**\n*One Officer, Six Clerks,*\n*and ten thousand armored soldiers of the Great Cavern Heaven,*\n*ascending the ranks.*\n\n**File-Chang’s Changing Heaven’s Success Rank**\n*Responding to the *qi* of three Yang at the Spring Equinox.*\n\n---\n\n**The Eighth Jade Chapter of Azure Heaven’s Nurtured Divine Rank,\nSovereign of the Northeast *Lángxiāo* Heaven**\n\n*Changing envies Kunlun’s peak,*\n*Three gods shelter the Northern Mound.*\n*The *Lángxiāo* specializes in sovereignty,*\n*Opening Transformation aids successful endeavors.*\n\n*The Great Cavern’s Yang symbol is pure,*\n*Clear essence transforms into crimson and purple.*\n*Adhesive refinement flows as the Precious Dao,*\n*Transcending aid forever flourishes.*\n\nThis Jade Chapter,\neach morning steadies the heart and attunes the *qi* by reciting the Nine Transgressions,\nadvancing to the Bureau of Merit,\nand fame aids the world.\n\n**Sovereign of the Northeast Changing Heaven’s Opening Transformation,\nMaster of the *Lángxiāo* Success Rank**\n*One Officer, Six Clerks,*\n*and ten thousand armored soldiers of the Great Cavern Heaven,*\n*ascending the ranks.*\n\n**File-Chang’s Pinion Heaven’s Success Rank**\n*Responding to the *qi* of two Yang and five Yin, two Yin and five Yang in the seasons.*\n\n---\n\n**The Ninth Jade Chapter of Azure Heaven’s Nurtured Divine Rank,\nSovereign of the Central *Shénxiāo* Heaven**\n\n*The Supreme Ultimate balances the Pinion Mother,*\n*The Central governs the Dipper’s pivot.*\n*The Eight Primordials generate one *qi*,\n*The Nine Paths converge in the Central Register.*\n\n*Responding Transformation enriches literary splendor,*\n*Illuminating the Emperor’s virtue remains.*\n*This culture renews the Great Endeavor,*\n*Transcending aid benefits the Imperial Residence.*\n\nThis Jade Chapter,\neach morning harmonizes voice and rectifies the *qi* by reciting the Nine Transgressions,\nas virtuous deeds manifest,\nand ten thousand wishes are fulfilled.\n\n**Sovereign of the Central Pinion Heaven’s Opening Transformation,\nMaster of the *Shénxiāo* Success Rank**\n*One Officer, Six Clerks,*\n*and ten thousand armored soldiers of the Great Cavern Heaven,*\n*ascending the ranks.*\n\n---\n**The Nine Ranks of the Great Cavern File-Chang Azure Heaven Jade Chapters**\nEach morning, steady the heart and resolve,\nharmonize voice and rectify the *qi*,\nand with utmost reverence, bow and pay homage before the File-Chang Bureau of Merit True Lord’s seat.\nRecite the Nine Transgressions,\nand naturally the Nine Heavens will respond,\nbestowing the Nine Heavens’ Noble Acclaim Bureau of Merit, celestial scribes, and armored soldiers below,\nto guard the auspicious body,\neliminate obstacles,\nadvance literary merit,\nmanifest noble deeds,\nassist the Imperial Way,\nand propagate the Great Transformation—\njust as the Purple Yang decrees!\n\n**File-Chang’s Chamber Response Eight Diagrams Rank**\n\nThe *Xūjìng* Heavenly Master said:\nThis text is the supreme celestial bureau’s File-Chang Bureau of Merit True Lord’s Nine Heavens Opening Transformation Sovereign,\ntransmitted in a prior kalpa to the Three Primordials, the Supreme Substance Dao Lord, the Upper Primordial Lady, and the Soul Flower Upper Palace Lady.\nThis talisman, formerly sealed within the Jade Purity Great Possession’s Golden Gate and Jade Chamber,\nwas entrusted to the Nine Heavens’ Treasure Fortune Venerable Gods for protection,\nwith celestial armored soldiers guarding the talisman and the Life-Span and Merit True Lords.\nThe Bureau of Merit’s Grand Chancellor oversees bestowal and revocation,\nthe Bureau of Noble Acclaim and Success oversees the Nine Heavens’ officials and clerks,\nprotecting the Mysterious Texts,\nselecting scholars,\nand responding to timely examinations.\nThey assist the Imperial Plan,\naid the flourishing of peace,\nand are treasured through the ages.\n\nThose who receive this text must not falsify its transmission.\nFirst, manifest it in chamber meditation,\nor witness strange omens by day as a sign of receipt.\nIf chamber response is attained,\none shall surely ascend to noble rank.\n\nThe Bureau of Merit Register states:\nThe above eight chamber responses,\nwhether manifested in imperial omens or shown in dreams,\nare all auspicious signs,\nand one shall surely gain noble selection.\n\nBriefly enumerating ten omens to reveal the foreshadowing:\nDuring the reign of Emperor Dezong of Tang,\nYao Wei, a descendant of Yao Chong,\ndiligent in studies and skilled in literature,\nthough his lofty ambitions were unfulfilled...\n\nOn one day, he encountered the Daoist **Heda (賀達)**, who immediately recognized him as **Zhang’s (章)** distant descendant and bestowed this **fajia (箓)** upon him.\n\nBefore receiving it, **Yao Wei (姚炜)** dreamed of a white cat beside his pillow. When he opened the **fajia** after receiving it, a jade cat’s omen indeed appeared as a sign of confirmation. That very year, he passed the imperial examinations and later served in the **sifu (侍从)** ranks.\n\nDuring the **Shu (蜀)** reign of **Emperor Guangzheng (廣政)**, **Gao Qing’s (高慶孙)** grandson dreamed of riding a cow that struck its horns against the frame. When he spoke of this dream to the Daoist **Hudao Yuan (胡道遠)**, the latter rejoiced and said, *“This year, you shall surely pass the **jieke (解科)** examination—‘jie’ (解) is the cow’s horn, and this is an auspicious omen.”* True to his words, **Gao Qing’s** grandson was then selected for high office.\n\nIn the **Tang (唐)** reign of **Emperor Zhaozong (昭宗)**, the scholar **Zhu Han (朱涣)** was renowned for his literary brilliance. He received this **fajia** from **Zhu Daoyuan (朱道元)**, a kinsman of the imperial house, and dreamed of decapitating five tigers. The following year, he passed the examinations and rose to the rank of **Qingjin (清近)**.\n\nDuring the **Song (宋)** reign of **Emperor Taizong (太宗)**, in the **Jingde (景德)** era, **Zhou Liangfu (周良辅)** received this **fajia** from the Daoist **Liu Ruozhuo (劉若拙)** of **Laizhou (萊州)**. He dreamed of being trampled by a herd of deer, dying by the roadside, and awoke in terror. That very year, he passed the examinations and later became a **shuishen (帅臣)**.\n\nIn the **Song (宋)** reign of **Emperor Shenzong (神宗)**, **Su Shi (蘇軾)** of **Mizhou (眉州)** obtained this **fajia** from the recluse **Huang Ruoshui (黃若水)** at the **Yi Mountain (颐山)** tombs in his eastern village. His father, **Su Xun (蘇洵)**, dreamed of a large ghostly head emerging from a bamboo shoot, awoke in shock, and that year, **Su Shi’s (蘇軾)** brothers both achieved scholarly distinction.\n\n**Su Shi’s (蘇軾)** younger son, **Su Qie (蘇迨)**, one night dreamed of striking three men dead. Taking this as an omen of ill fortune, he spoke of it to his elder brother, **Su Mai (蘇迈)**. **Su Mai (蘇迈)** rejoiced and said, *“This is the **San Yuan (三元)** selection—it must be you, my younger brother.”* His words proved true.\n\n**Huang Shu (黃庶)**, styled **Yafa (亞夫)**, of **Hongzhou (洪州)**, dreamed of a black dog protecting his feet. He had received this **fajia** from **Qi Master (齐先生)**’s disciples and took this as a fortunate sign. That year, he passed the examinations and attained the rank of **Taizhong Daifu (太中大夫)** and **Da Li Si Cheng (大理寺丞)**.\n\n**Chao Gongwu (晁公武)**, styled **Zizheng (子正)**, on the night of **Shangyuan (上元)**, dreamed of striking three men dead in his study. He was bound by officials and brought before the authorities. Upon reaching prison, he saw his elder brother, **Chao Gongqu (晁公愬)**, styled **Zixi (子西)**, already bound and awaiting him. Startled and awoken, he said nothing. Later, when he visited **Baofeng (宝峰)** in **Lizhou (利州)**, he encountered a Daoist **Lu (鲁)**, who then showed him this **fajia**. Upon reaching the section on **chamber omens (寝应)**, he saw the omen of striking three men dead, and he performed a **jiao (醮)** to receive this **fajia**. Afterwards, his elder and younger brothers both passed the examinations with distinction.\n\n**Pang Wu (庞武)**, the **Taishi (太师)**, before attaining prominence, wandered to **Fenglin (凤林)** in **Luoxi (洛西)**. A Daoist named **Meng Ji (蒙吉)** shared a drink with him, and that evening, after the wine had flowed freely, **Pang Wu (庞武)** stayed at the **Fenglin (凤林)** abode. He dreamed of being bitten by a white horse, which caused him great pain. When he awoke, he told **Meng Ji (蒙吉)** of the dream.\n\n**Meng Ji (蒙吉)** said, *“You have received the **Eight Chamber Omens (八图)**—here is the **fajia** to confirm it. Accept it now.”* That year, **Pang Wu (庞武)** passed the examinations. Within fifteen years, he became a **zhizheng (执政)**, and both he and his son were appointed **Taishi (太师)**.\n\nToward the end of the **Jianyan (建炎)** era, **Liu Haoran (刘浩然)** of **Qiongzhou (邛州)**, from his youth studied diligently to seek advancement. He dreamed of **Sifu Zhenjun (司禄真君)** bestowing upon him the **Wenchang fajia (文昌箓)**. Upon waking, he recorded the dream and then journeyed to **Longhu Mountain (龙虎山)** to pay homage to the **Thirty-First Generation Tian Shi (天师)**, seeking to receive this **fajia**. The **Tian Shi (天师)** took it out and showed it to him, saying, *“This **fajia** is not meant for your advancement. You should pass it on, transmitting it to three nobles.”* Though he did not fully understand these words, he accepted the **fajia** and later practiced the **San Dong fajia (三洞法箓)**.\n\nDuring the **Shaoxing (绍兴)** era, **Liu Haoran (刘浩然)**’s **fajia** and talismans displayed miraculous efficacy. He could summon spirits to worship **Zhang (章)**, foreknow the future fortunes of others, and was highly regarded by the scholars and nobles of the time. **Yu Runwen (虞允文)**, a man of elegant letters from **Lungzhou (隆州)**, heard of his name and knocked on his door. **Liu Haoran (刘浩然)** told **Yu Runwen (虞允文)**, *“You shall gain midlife honor and rise to **zhizheng (执政)**. You can receive this **fajia** and I will aid your literary pursuits.”* **Yu Runwen (虞允文)** asked, *“What **fajia** can I receive?”* **Liu Haoran (刘浩然)** then bestowed this **fajia** upon him.\n\nThe following year, **Yu Runwen (虞允文)** dreamed of striking three men dead in the **Kua Bie (跨鳖)** study, and awoke sweating profusely. When he opened the **fajia**, he saw this very omen. The next year, he achieved the highest rank in the **San Yuan (三元)** examinations, and later became **Chancellor (宰相)**.\n\nIn all cases, virtuous scholars and eminent Confucian literati who receive the **fajia** beforehand must first manifest the **chamber omens (寝征)**. Then, they should seek a master to receive this **fajia**, aligning themselves with the **Heavenly Will (天意)**. Only then shall they surely reap the rewards of **scholarly success (功名)**.\n\nIf they hesitate and doubt, unable to faithfully accept it, then **Sifu Zhenjun (司禄真君)** shall withdraw their divine guidance, **the spirits shall obscure their judgment (灵鉴)**, and their **lifespan and fortune (寿禄)** shall be diminished, leaving them without achievement.\n\nIf the **chamber omens (寝征)** appear after receiving the **fajia**, they shall still achieve distinction. Omens that appear before receiving the **fajia** are the **superior chamber omens (上寝)**; those that appear after are secondary.\n\nIf one reverently upholds this **fajia**, it shall aid their literary pursuits, generate the **nine Dao (九道)** and **Wenchang qi (文昌之炁)**, clear past grievances, and prevent ancestral misfortunes from lingering. The spirits cannot take away their discernment, nor can demons obstruct their talent. It shall guide their **fate and destiny (命运)**, and even malevolent stars or **evil spirits (恶煞)** cannot harm them. With steadfast resolve and an open heart, divine wisdom shall sharpen their intellect, their scholarly achievements shall flourish, and their fortunes shall extend to their descendants.\n\nIf one treats this **sacred text (灵文)** lightly, or falsely claims it from others, then the **Three Officials (三官)** shall strike with their **gubiao (鼓笔)**, and the punishment shall not be slight.\n\n**End of the *Highest Daoist Cavern of Wenchang, Sifu Zhenjun, Ziyang Precious Fajia (高上大洞文昌司禄紫阳宝箓)* scroll.**\n\n**Request for Fajia Ritual Words**\n**Highest Daoist Cavern of Wenchang, Sifu Zhenjun, Ziyang Precious Fajia Ritual Words**\n\nOn the day of the **month, year, and time** of **certain year, month, and day**, the Daoist disciple **Certain Person (某人)**, born under the **Northern Dipper (北斗)** star **Certain Star (某星)** and originally from **Certain County (某乡)** and **Certain Prefecture (某贯)**, residing in **Certain Place (某居住)**, humbly and sincerely prostrates before the **Dushi (度师)**, **Jiaozhu (教主)**, and **Tian Shi (天师)**, the **Great True Person (大真人)**, to receive a copy of the **Highest Daoist Cavern of Wenchang, Sifu Zhenjun, Ziyang Precious Fajia (高上大洞文昌司禄紫阳宝箓)**** and uphold it in practice.\n\nI humbly acknowledge that the **jade seals and jade scriptures (玉篆琼书)**** are indeed the embryonic essence of the **Taiji (太极)**. The **golden platform and laurel registers (金台桂籍)**** are all under the command of **Wenchang (文昌)**.\n\nThey contain profound mysteries and condensed Daoist essences, holding within them the **refined essence and nurtured brilliance (精毓秀)****. Thus, the **creative transformation (造化)**** unfolds silently with its responses. In the interplay of **yin and yang (阴阳)**** and the waxing and waning of **xiang (消)**** and **zhang (长)****,** the **fajia**** resonates with the **principle of non-action (无为)****. It naturally manifests the **patterns of divine efficacy (符张翼之精)****, perpetuating the **Daoist teachings that assist ruler and subjects (教翊君臣之道)****.\n\nBy this means, their merit surpasses the **golden gates (金阙)****, overseeing the **laurel registers (禄籍)**** in the **Heavenly Court (天曹)****. Their noble station governs the **jade charts (瑶图)****, demonstrating the **imperial selection (铨衡)**** in human ranks. They reveal the **wonderful standards (妙范)****, regulate the **literary edicts (文纲)****, and promote or demote without bias. This is the reliance of **ancient and modern (古今)****.\n\nAt this juncture, I humbly reflect that this humble servant was born in an age of radiant virtue, encountering the true winds of the Dao. With deepest reverence, I submit my allegiance, desiring to wear the sacred scriptures of the Nine Heavens, thereby enhancing my wisdom and knowledge. I earnestly hope to comprehend the subtle teachings of the unified Dao, that my aspirations may soon be fulfilled in the Azure Clouds, and my oaths may be as steadfast as the White Sun.\n\nWith lofty aspirations, I seek instruction from above, and with utmost humility, I vow to practice and uphold them. My heartfelt gratitude knows no bounds, and I now present my words.\n\nTo the Celestial Master’s discipleship, I, the disciple [name], bring my earnest offerings and sincere devotion, humbly seeking to receive one copy of the *Highest Supreme Great Cavern Literary Glory and Jade Court Sacred Registers* (《高上大洞文昌司禄紫阳宝箓》), which I shall venerate for life. Additionally, I request the Celestial Master’s sacred name, talismans, diagrams, and esoteric methods, following the prescribed rituals for my practice.\n\nOn this very day, I solemnly pledge my oath to Heaven and Earth, swear before the Three Officials, and break the seal of my former vows to sever past ties. In accordance with the established rites, I now receive the transmission as follows:\n\n**Registers (箓) in three volumes (上中下三卷):**\n*Nine Heavens Opening and Transformation* (九天开化品),\n*Heavenly Evolution and Genealogy* (天演谱系品),\n*Divine Auxiliaries and Listed Gods* (储佐列神品),\n*Heavenly Talismans and Jade Scriptures* (天章玉文品),\n*Central Sovereign’s Birth of Qi* (中皇生炁品),\n*Stabilizing Aspirations and Enhancing Wisdom* (定志益慧品),\n*Reviewing Sacred Diagrams* (简阅宝图品),\n*Jade Talismans of Literary Glory* (司禄玉符品),\n*Golden Seals of Fixed Nobility* (定贵金简品),\n*Jade Strategies for Advancing Virtue* (进贤玉策品),\n*Golden Talismans for Dispelling Demons* (消魔金篆品),\n*Fundamental Principles of Transformation* (元纲演化品),\n*Eastern Wall’s Celestial Spheres* (东壁璇玑品),\n*Palace Officials and Mounted Guards* (宫曹骑卫品),\n*Azure Sky’s Nurturing of Gods* (苍天育神品),\n*Yang Heaven’s Assistance to Literature* (阳天辅文品),\n*Flame Heaven’s Illumination of Truth* (炎天明真品),\n*Vermilion Heaven’s Penetration of Mysteries* (朱天通玄品),\n*Exalted Heaven’s Entry into Virtue* (昊天入贤品),\n*Dark Heaven’s Establishment of Virtue* (幽天立德品),\n*Mysterious Heaven’s Response to Nobility* (玄天应贵品),\n*Changing Heaven’s Advancement of Fortune* (变天进禄品),\n*Hooked Heaven’s Achievement of Success* (钧天成功品),\n*Responsive Heaven’s Eight Sacred Diagrams* (应寝八图品).\n\n**Rituals (仪式):**\nA sealed oath of unity and shared devotion with the True One (盟真合同环券一封).\n\n**Daoist Rituals (正一修真旨要节目):**\nThe Sacred Essentials of Rectified Daoist Cultivation and Ritual Practice (正一修真旨要节目).\n\n**The Three Celestial Masters of the Rectified Dao (祖玄真三师宝号):**\nThe Celestial Master of the Nine Heavens, the Revered Sovereign of Opening and Governing (祖师九天开化主宰慈应大帝大慈更生永命天尊),\nThe Great Emperor of Profound Benevolence and Abundant Grace (祖师九天开化主宰慈应大帝大慈更生永命天尊).\nThe Grand Master of the Celestial Treasury, the Total Administrator of Land and Water Circulation and Bestower of Auspicious Grace (玄师天府掌水陆都转运使总桂禄二籍孚泽大帝).\nThe Supreme Emperor of Great Achievement and Sacred Literature, the Nine-Heaven Celestial Master of the Dao (真师大成至圣文宣王文昌皇人九天玄圣道君).\n\n**The Three Sacred Titles of the Scriptures and Ordinances (经籍度三师法讳):**\nThe Scripture Master of the Three Upper Purity Caverns (经师上清三洞经箓), the Celestial Officer of the Jade Treasury, the Grand Marshal of the Dao (都天大法主), the Fourth-Twenty-Second Celestial Master of the Han Lineage (嗣汉四十二代天师), Zhang Zhengchang (张正常).\nThe Ordinance Master of the Three Upper Purity Caverns (籍师上清三洞经箓), the Grand Marshal of the Dao who Upholds the Supreme Ultimate (太极执法真宰), the Celestial Officer of the Lingbao Scripture (灵宝领教真人都天大法主), the Forty-Third Celestial Master of the Han Lineage (嗣汉四十三代天师), Zhang Yuchu (张宇初).\nThe Ritual Master of the Three Upper Purity Caverns (度师上清三洞宝箓), the Celestial Officer of the Lingbao Scripture who Leads the Mysterious Transformation (灵宝领教玄化真人), the Ritual Officer of the Dao (南曹执法仙宰), the Celestial Officer of the Dao (都天大法主), the Forty-Fourth Celestial Master of the Han Lineage (嗣教四十四代天师), Zhang Yucheng (张宇清).\n\n**Names of the Masters at the Ritual Altar (临坛师法名):**\nSupervisor of the Dao (监　　度　　师),\nGuardian of Auspiciousness (保　　举　　师),\nAttestant of the Sacred Covenant (证　　盟　　师).\n\nThe **Secret Canon of Wenchang** (rightfully invoked) governs the **Nine Heavens’ Bureau of Rewards** (文昌秘典，掌九天司禄) with its **Grand Sieve of Merit** (之铨衡), its **Sacred Scriptures of the Great Caverns** (大洞灵章) elucidating the **Sevenfold Mysterious Transformation** (七曲) of the **True Immortals** (真仙之治化). With **Five Cloud-Signatures** (云篆五文) it unfolds the **Celestial Mandate’s Boundaries** (而开廓), and with **Eight-Angled Golden Scriptures** (金书八角) it extends the **Divine Radiance** (以垂芒). Resplendent is the **Celestial Sovereign’s Presence** (帝御所临), vast as the **Manifested Deity’s Essence** (神明如在). Cultivate it, and the **Ultimate Principles** (至理) shall be penetrated; comprehend it, and the **Profound Mysteries** (玄微) shall be transcended.\n\nOnly through **advancing one’s literary merit** (进文业於身) does one fulfill the **Dao’s Virtue** (至理), and only through **manifesting one’s deeds and name** (显功名於世) does one attain worldly glory. Its praise is boundless, its profundity unnameable. I sincerely align my intentions with rectitude, refine my conduct with caution, and follow the **Sacred Teachings** (圣训). Though I have not yet attained **few faults and few censures** (寡过而寡尤), I have devoted myself to the **True Lineage** (真宗), yet I remain unaware of the **constant purity and stillness** (常清而常静).\n\nI humbly pray that my **rewards ascend to the Guì Jié** (桂籍), my **name be inscribed in the Ruǐ Gōng** (蕊宫), and that my **single thought harmonize with the True** (通真). May I **penetrate the intent of the Scripture** (彻明经之旨趣), and in the **Three Celestial Cycles** (三元) be **fixed in noble status** (定贵), ranking among the **Highest Echelon** (上品) in the **Celestial Merit System** (科名).\n\nWith solemn reverence, I **pledge the Sacred Covenant** (恪谨盟言), eternally treasuring it as my **personal virtue** (身宝). Should I betray my original resolve, I shall **willingly submit to the Sacred Ordinances** (甘伏宪章).\n\n**Concluding the Sacred Ritual Words of the Great Caverns’ Wenchang Bureau of Rewards** (高上大洞文昌司禄紫阳宝箓法词竟).",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "高上大洞文昌司禄紫阳宝箓 经名：高上大洞文昌司禄紫阳宝箓。 撰人不详，约出於明代。 假托文昌帝君降授符图神咒。 三卷。 底本出处：《正统道藏》正一部。 高上大洞文昌司禄紫阳宝箓卷上 某贯居住奉道信士某词称：本命某年某月某日某时建生，上属北斗某星君主照，即日虔诚恭诣度师教主天师大真人门下，拜受《高上大洞文昌司禄紫阳宝箓》一部，皈身佩奉，誓以钦崇正教，律己修身，增益才华，开明鉴识，断除魔障，斥逐邪妖，显擢科名，进登禄位。 受佩之后，不敢轻泄玄文，怨咎道师，如负盟言，一依文昌上宫科法律令。 文昌九天开化品 尔时，九天开化主宰澄真正观宝光天尊，於重光赤奋若之岁、日躔鹑尾月、望东壁之辰，降于蜀都宝屏山中，和诚应之楼，玄会玉虚之坛，告鸾府侍仙真人刘安胜曰：吾昔奉上帝玉敕，职掌桂籍，兴文儒而擢贵品，进贤德而佐明时，故得掌隶天曹，秩专司禄，校录地府，位司定贵，诠量水府，职在进贤，应三府选举，吾总隶焉。 其选举之岁，吾同三元三官、五方五帝、三辰五斗、列曜众星，参统三微，研较气运，敕天曹定命定贵都司、天府岱岳地府北酆水府扶桑帝君，集会九天开化文昌大都督府，考定九州分野，合升选擢魁名品箓、三禄三贵三贤高下，仍较其祖宗父母族属己身世代历劫，有无大功阴隐孝行，及有无积衅冤债结恶遗殃，谴罪冢讼，咒诅业根，苦本魔基，并五行命运所得，定方数算，悉皆注定。 若世代有大功阴隐孝行，德基丰厚，虽命运衰蹇，以功行胜之，即与添禄加年，升入贵选，进登禄籍； 若功隆德厚，而冤债殃讼未息者，则先令注禄入品，名登贤籍，俟福盛罪灭，方得受禄； 若命运合得名秩克贵食禄，而无阴德大功、忠孝百行者，即当退禄削贵，落籍销名，以俟建乃立德积善集庆，方与注入贵籍，增禄成名。 其或文儒贤士，知命悔过，进德修业，运气贵而阴功微，业缘缚而冤债累，鬼邪窒其进取，妖魔障其灵鉴者，吾当授以《文昌上宫大洞宝箓》，消诸魔障，启沃身心。 此文昔秘於元始玉清圣境浩劫天宫金阙玉房云锦之囊，授之於玉宸大道君，太上老君授受於紫微帝君暨太一元君，次传於圣祖轩皇，嗣於帝尧、大舜、神禹。 禹授於刘月，月授於王经，经授於彭太极，太极授於邓元，元授於刘谊，谊授於刘洞真，洞真授於王远，远授於彭晓，晓授刘希岳，希岳授於兰公翘，公翘授於彭德直。 由是万圣千真，皆获受度。 宿缘积庆者，求师传受，必当诚恪投陈，遵依科格，金缯法信，以固约盟，其授箓之师，必经佩持三洞四辅九天金箓之人，方可依科付度，如德秩尚微，功勋未着，不可妄称师范，轻泄灵文。 持受此箓，依按修行，可以解累世冤结，可以止冢讼宿殃，断绝恶业地根，摧伏魔基苦本，夺灵鉴之神潜匿，晦文业之鬼遁逃，乱性之妖灭形，障贵之邪挫首。 若命运凶衰，定分卑浅，得此秘文，敬而勿怠，精勤香火，存念经诀，上消天灾，下禳地祸，增延禄算，断绝邪魔，神性清明，文华秀发。 若命运未贵，文业未舒，遵奉宝箓，依按修持，惟务济人，馘毒治病，救及三百六十人者，积成大功，高升禄秩，注入贵品，进在贤籍，当辅佐明时，得为至贵之臣，禄及子孙，光荣族属。",
      "translated_text": "**Highest Daoist Scripture of Wenchang, Lord of Fortune, Purple Yang Treasure Scrolls**\n*(Title: Highest Daoist Scripture of Wenchang, Lord of Fortune, Purple Yang Treasure Scrolls)*\n\n**Author Unknown**, approximately from the Ming Dynasty.\nFalsely attributed to Wenchang Di Jun (Celestial Lord of Literature and Fortune) descending to bestow talismans, diagrams, and divine spells.\nThree volumes.\nSource text: *Zhengtong Daozang* (Orthodox Daoist Canon), First Section.\n\n---\n\n**Volume One of the Highest Daoist Scripture of Wenchang, Lord of Fortune, Purple Yang Treasure Scrolls**\n\nA certain devout Daoist practitioner residing in [location], humbly states:\n*\"By fate, I was born on the [year], [month], [day], and [hour] of the [stellar time], under the governance of the [specific star] of the Northern Dipper. On that very day, with utmost reverence, I knelt before the Master of the Dao, the Celestial True Person of the Heavenly Teacher, and received the *Highest Daoist Scripture of Wenchang, Lord of Fortune, Purple Yang Treasure Scrolls*. I now wear it with devotion, swearing to uphold the orthodox teachings, discipline myself, enhance my talents, sharpen my wisdom, sever demonic obstacles, banish malevolent spirits, achieve scholarly distinction, and ascend to positions of fortune.*\n\n*After receiving this sacred text, I dare not reveal its mysteries lightly, lest I incur the wrath of the Daoist Master and betray my solemn vow. I shall strictly adhere to the laws and decrees of the Wenchang Upper Palace.\"*\n\n---\n\n**The Nine-Heavens Enlightenment Chapter of Wenchang**\n\nAt that time, the Sovereign of Nine-Heavens Enlightenment, the Radiant True Observer, the Precious Light Celestial Venerable (*Chéngzhēn Zhèngguān Bǎoguāng Tiānzūn*), in the year of *Chóngguāng Chìfèn Ruò* (a cyclical year name), when the sun was in the *Chuntuǐ* (a lunar mansion), and the moon was at the *Dōngbì* (East Wall) hour, descended into the *Bǎopíng Shān* (Treasure Screen Mountain) in the Shu capital, at the *Héshèng Yīngzhī Lóu* (Harmonious Sincerity Responding Hall) and the *Xuànhuì Yùxū Tán* (Mysterious Gathering Jade Emptiness Altar). He announced to the *Luánfǔ Shìxiān Zhēnrén* (Luanfu Attendant Immortal Sī Liú Ānshèng*), saying:\n\n*\"In past ages, I received the jade edict of the Most High Emperor, entrusted with overseeing the *Guìjí* (the celestial register of worthy scholars), promoting literary scholars to noble ranks, and advancing virtuous officials to aid the enlightened age. Thus, I was appointed to govern the Celestial Chancellery, specializing in bestowing fortune, recording the Underworld, determining noble ranks, measuring the Watery Realm, and selecting the worthy. I oversee the tripartite examinations of the Three Offices (Heaven, Earth, and Water).*\n\n*In the years of selection, I, together with the Three Elements and Three Officials, the Five Directions and Five Emperors, the Three Celestial Stems and Five Stars of the Dipper, and the myriad luminaries, coordinate with the Three Mysteries, examine the *qi* and fate, and decree the Celestial Chancellery’s Bureau of Fixed Destiny and Noble Rank, the Earthly Bureau of Tai Mountain, the Watery Bureau of the Northern Netherworld, and the Imperial Lord of Fúsāng. We convene the Nine-Heavens Enlightenment Wenchang Grand Marshal’s Office to assess the nine regions and their constellations, determining the ranks of the three fortunes, three noble ranks, and three virtues—high or low—and further investigate the ancestral, parental, and familial lineages across lifetimes, whether they possess hidden virtues and filial piety or accumulated grudges, debts, lawsuits, curses, karmic roots, and demonic foundations, as well as their Five Phases and fateful allotments, calculating their directional numbers and recording them all.*\n\n*If a lineage possesses hidden virtues and profound filial piety, with a sturdy foundation of virtue, even if their fate is declining, their merits will overcome it, and they shall be granted added fortune and longevity, ascending to noble selection and entering the register of fortune.*\n\n*If their virtues are great and their foundation strong, yet their grudges, debts, and calamities persist, they shall first be enrolled in the register of the worthy, their names recorded in the noble ranks, awaiting the exhaustion of their misfortune and the extinction of their guilt before receiving their fortune.*\n\n*If their fate aligns with noble rank and fortune, yet they lack hidden virtues, great deeds, or a hundred acts of loyalty and filial piety, their fortune shall be withdrawn, their noble rank stripped, their name erased from the register, and they shall await the establishment of virtue, the accumulation of goodness, and the gathering of blessings before being re-entered into the noble ranks and granted fortune and renown.*\n\n*Should literary scholars and worthy men, knowing their fate, repent their errors, cultivate virtue, and refine their studies—though their fate is noble and their hidden merits slight, their karmic bonds heavy with grudges and debts, and demonic spirits obstructing their advancement and clouding their divine insight—I shall bestow upon them the *Great Daoist Treasure Scrolls of Wenchang’s Upper Palace*, dispelling all demonic obstacles and awakening their innate wisdom.*\n\n*This text was formerly concealed within the jade palace of the Supreme Origin, the Holy Pure Realm, the Vast Effulgence Heavenly Palace, the Golden Gate Jade Chamber, and the cloud-silk pouch. It was transmitted to the Jade Sovereign Great Daoist Lord (*Yùchén Dà Dàojūn*), then passed from the Most High Laozi to the Purple Micro Emperor and the Supreme One Lord. It was further transmitted to the Holy Ancestor, the Yellow Emperor, then to Emperor Yao, Emperor Shun, and the Divine Yu.*\n\n*Yu transmitted it to Liu Yue, Yue to Wang Jing, Jing to Peng Taiji, Taiji to Deng Yuan, Yuan to Liu Yi, Yi to Liu Dongzhen, Dongzhen to Wang Yuan, Yuan to Peng Xiao, Xiao to Liu Xiyue, Xiyue to Lan Gongqiào, and Gongqiào to Peng Dezhi.*\n\n*Thus, ten thousand saints and true ones all received the transmission.*\n\n*Those with accumulated blessings and predestined fortune who seek a master to receive this transmission must sincerely present offerings, follow the ritual protocols, and pledge with gold and silk to uphold the covenant. The transmitting master must be one who has received the Three Daoist Canons, the Four Auxiliaries, and the Nine-Heavens Golden Scrolls, only then may they follow the protocols to initiate the transmission. If their virtue and rank are still modest and their merits unproven, they must not presumptuously claim the title of master or recklessly divulge the sacred texts.*\n\n*To hold and practice this scroll in accordance with its teachings can dissolve ancestral grudges, cease lawsuits and calamities, sever evil karmic roots, subdue demonic foundations, and dispel suffering. It can rob spirits of their divine insight, cause malevolent ghosts to flee, annihilate demons that disrupt nature, and crush evil that obstructs nobility. If one’s fate is grim and their destiny low, yet they revere this secret text without negligence, diligently tend to incense and offerings, and meditate upon the scriptures and incantations, they shall avert celestial calamities, repel earthly disasters, extend their fortune, sever demonic influences, clarify their divine nature, and flourish in literary brilliance.*\n\n*If one’s fate is not yet noble and their literary endeavors stifled, yet they faithfully adhere to this treasure scroll and practice accordingly, they must solely dedicate themselves to benefiting others—severing poison, healing the sick, and saving at least three hundred and sixty people. Accumulating such great merit, they shall ascend to high fortune and noble rank, be recorded in the worthy registers, and aid the enlightened age as the most noble of officials. Their fortune shall extend to their descendants, bringing glory to their lineage.\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1247,
      "start_sentence": 0,
      "end_sentence": 22,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 21.329840421676636,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\高上大洞文昌司禄紫阳宝箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "若能修持经箓中妙行法门，常令身心清净，神炁精明，年齿既高，当得太阴炼形，得尸解之道，不堕轮转，升入仙都，位为真人。 凡清信之士，受吾箓者，吾即奏上玉帝金阙，注录三元曹府禄贵贤籍，使其身心究竟不昧，应入贵籍，辅佐明时。 所有九天较定天曹地府水府三禄三贵三贤科品，宣传于后： 上元天曹岳府司禄，分一科三品： 一司　　天禄科。 上品紫微天官，中品太微斗官， 下品少微星官。 二司　　人禄科。 上品王公卿侯爵，中品方伯监牧爵，下品百官散秩爵。 三司　　幽禄科。 上品岳府官僚，中品邓都官僚，下品扶桑官僚。 中元地府邓都定贵，分三科三品： 一司　　上贵科。 孝行上品，守节中品，阴德下品。 二司　　中贵科。 仁慈上品，康义中品，德行下品。 三司　　下贵科。 贤达上品，祖德中品，文学下品。 下元水府扶桑进贤，分三科三品： 一司　　上贤科。 至孝上品，大忠中品，慈仁下品。 二司　　中贤科。 康义之贤上品，礼法之贤中品， 智度之贤下品。 三司　　下贤科。 笃行之贤上品，才学之贤中品，分定之贤下品。 已上科品，并以较录世人，如入科品者，即与注禄定贵，进在贤籍。 吾当遣演谱仙官，翊赞善功，开明神鉴，仍遣储佐列神，断除魔障，授之天章玉文，镇护身田，兆祥应寝，降中皇真炁启沃身心，敕安志益慧之神，安定百关，开聪导明，进其才华，通其灵鉴，一如文昌科法律令。 文昌天演谱系品 帝君圣诰 金阙上相检校太师、混元内辅三清上圣大都督府、都统三界阴兵行便宜事、管天地水三界狱事、收五岳四渎真形虎符龙券、总诸天星曜、判桂禄嗣籍、上仙英显元皇真人、司禄职贡举真君、洞照通真先生、编修飞仙列籍、掌混元造化轮回六道救苦救难慈尊、玉清内境清净道真、身见紫云岩，手持如意杖，统御万灵普济诸苦、大仁大孝大圣大慈无上不骄乐天帝、都总混天诚心接物万天教主、随愿慈应天尊、九天定元保生扶教开化主宰长乐永佑灵应大天帝君、掌五湖四海总十二河源水府运使、澄真正观注禄定籍、宝光慈应治世显道、保安拔罪、更生永命、扶善济苦、消劫行化纯一显应天尊。 帝君张姓讳亚，上应张翼二宿，生於周初昊会之地，以二月三日圣诞。 混元父母，天地同根。 胞胎骨肉，一炁分身。",
      "translated_text": "「If one can practice the wondrous *miao* methods (*妙行*) of the scriptures and treasure scrolls (*经箓*), maintaining purity of body and mind, clarity of *shen* and *qi*, and even in advanced years (*年齿既高*), they shall attain the *Taiyin* Refinement of Form (*太阴炼形*), achieving the *Shixie* Dao (*尸解之道*)—transcending the cycle of rebirth (*轮转*), ascending to the Daoist Celestial Capital (*仙都*), and becoming a True Person (*真人*).\n\nAll faithful and sincere practitioners (*清信之士*) who receive my treasure scrolls (*吾箓*) shall be petitioned by me before the Jade Emperor (*玉帝*) at the Golden Gate (*金阙*), recorded in the registers of the Three Elements (*三元*)—the Celestial Bureau of Fate (*天曹*), Earthly Bureau of Fate (*地府*), and Watery Bureau of Fate (*水府*)—for noble rank (*禄贵贤籍*), ensuring their body and mind remain ever enlightened (*究竟不昧*), and their entry into the ranks of the worthy (*贵籍*), aiding the enlightened age (*明时*).\n\nThe following are the Nine Heavenly Rankings (*九天较定*) for the Three Elements’ registers of noble rank (*天曹地府水府三禄三贵三贤科品*), now proclaimed:\n\n**First Bureau of the Heavenly Register (*上元天曹*) at Yuefu (*岳府*), overseeing celestial fortune (*司禄*), with three divisions (*三科三品*):**\n1. **First Division** – *Celestial Fortune Science (*天禄科*)*\n   Upper Rank: *Purple Micro Celestial Official (*紫微天官*)*\n   Middle Rank: *Grand Micro Celestial Official (*太微斗官*)*\n   Lower Rank: *Lesser Micro Celestial Official (*少微星官*)*\n\n2. **Second Division** – *Human Fortune Science (*人禄科*)*\n   Upper Rank: *Kings, Dukes, Marquesses, and Earls (*王公卿侯爵*)*\n   Middle Rank: *Regional Governors and Inspectors (*方伯监牧爵*)*\n   Lower Rank: *All other officials and scattered ranks (*百官散秩爵*)*\n\n3. **Third Division** – *Subterranean Fortune Science (*幽禄科*)*\n   Upper Rank: *Officials of Yuefu (*岳府官僚*)*\n   Middle Rank: *Officials of Dengdu (*邓都官僚*)*\n   Lower Rank: *Officials of Fusan (*扶桑官僚*)*\n\n**Second Bureau of the Earthly Register (*中元地府*) at Dengdu (*邓都*), determining noble rank (*定贵*), with three divisions (*三科三品*):**\n1. **First Division** – *Upper Noble Science (*上贵科*)*\n   Upper Rank: *Filial Piety (*孝行*)*\n   Middle Rank: *Chastity and Devotion (*守节*)*\n   Lower Rank: *Yin Virtue (*阴德*)*\n\n2. **Second Division** – *Middle Noble Science (*中贵科*)*\n   Upper Rank: *Kindness and Mercy (*仁慈*)*\n   Middle Rank: *Righteousness and Benevolence (*康义*)*\n   Lower Rank: *Moral Conduct (*德行*)*\n\n3. **Third Division** – *Lower Noble Science (*下贵科*)*\n   Upper Rank: *Worthy and Virtuous (*贤达*)*\n   Middle Rank: *Ancestral Virtue (*祖德*)*\n   Lower Rank: *Literary Merit (*文学*)*\n\n**Third Bureau of the Watery Register (*下元水府*) at Fusan (*扶桑*), advancing the worthy (*进贤*), with three divisions (*三科三品*):**\n1. **First Division** – *Upper Worthy Science (*上贤科*)*\n   Upper Rank: *Supreme Filial Piety (*至孝*)*\n   Middle Rank: *Great Loyalty (*大忠*)*\n   Lower Rank: *Kindness and Mercy (*慈仁*)*\n\n2. **Second Division** – *Middle Worthy Science (*中贤科*)*\n   Upper Rank: *Worthy through Righteousness and Benevolence (*康义之贤*)*\n   Middle Rank: *Worthy through Ritual and Law (*礼法之贤*)*\n   Lower Rank: *Worthy through Wisdom and Guidance (*智度之贤*)*\n\n3. **Third Division** – *Lower Worthy Science (*下贤科*)*\n   Upper Rank: *Worthy through Sincere Conduct (*笃行之贤*)*\n   Middle Rank: *Worthy through Talent and Learning (*才学之贤*)*\n   Lower Rank: *Worthy through Allotted Destiny (*分定之贤*)*\n\nAll the above divisions and ranks shall be used to evaluate the world’s people (*较录世人*). Those who enter these divisions and ranks shall be granted celestial fortune (*注禄*), noble rank (*定贵*), and advancement in the worthy registers (*进在贤籍*).\n\nI shall dispatch the *Yanpu* Daoist Officials (*演谱仙官*), who shall assist and extol virtuous deeds (*翊赞善功*), illuminate divine insight (*开明神鉴*), and send the *Chuzuo* Divine Assistants (*储佐列神*) to sever demonic obstacles (*断除魔障*), bestowing upon them the Heavenly Edicts and Jade Scriptures (*天章玉文*), safeguarding their vital fields (*镇护身田*). Auspicious signs shall manifest (*兆祥应寝*), and the True *Qi* of the Central Emperor (*中皇真炁*) shall nourish their body and mind (*启沃身心*). By imperial decree (*敕*), the gods of tranquil will and enlightened wisdom (*安志益慧之神*) shall be invoked to settle the hundred critical junctures (*定百关*), sharpen their acuity, and guide them to clarity (*开聪导明*), advancing their talents (*进其才华*) and refining their spiritual insight (*通其灵鉴*), just as decreed in the *Wenchang* Science and Legal Edicts (*文昌科法律令*).\n\n**The *Wenchang* Tianyanpu System of Ranks (*文昌天演谱系品*):**\nBy the Imperial Edict (*帝君圣诰*) of the Jade Gate’s High Minister (*金阙上相*), who inspects and oversees the Grand Master of All (*检校太师*), the Inner Assistant of the Mixed Primordial (*混元内辅*), and the Three Pure Ones’ Supreme Command (*三清上圣大都督府*), who governs the Three Realms (*三界*) and dispatches the Yin Armies (*阴兵*) as expedient (*行便宜事*), who oversees the judicial affairs of the Heavenly, Earthly, and Watery Realms (*管天地水三界狱事*), who collects the True Forms of the Five Peaks and Four Seas (*收五岳四渎真形虎符龙券*), who commands all celestial luminaries (*总诸天星曜*), who adjudicates the succession of the *Gui* Registers (*判桂禄嗣籍*), who is the Celestial Hero, the Most Noble True Person (*上仙英显元皇真人*), the Official in Charge of Fortune and True Recommendations (*司禄职贡举真君*), the Illuminating Sage of Penetrating Truth (*洞照通真先生*), the Compiler of the Flying Daoist Registers (*编修飞仙列籍*), and the Master of the Mixed Primordial Creation, Reincarnation, and Six Realms of Suffering (*掌混元造化轮回六道救苦救难慈尊*), the Pure Daoist of the Jade Realm (*玉清内境清净道真*), whose form is seen amidst the Purple Clouds (*身见紫云岩*), who wields the Auspicious Staff (*手持如意杖*), who governs all spirits and universally saves from suffering (*统御万灵普济诸苦*), the Most Supreme Benevolent, Merciful, and Holy Emperor of Non-Exalted Joy (*大仁大孝大圣大慈无上不骄乐天帝*), the Supreme Commander of the Mixed Heavenly Sincere Heart, who interfaces with all (*都总混天诚心接物万天教主*), the Compassionate Sovereign who Responds to Wishes (*随愿慈应天尊*), the Nine Heavenly Ruler of Destiny, Life Preservation, and Teaching (*九天定元保生扶教开化主宰*), the Great Emperor of Eternal Auspice and Abiding Assistance (*长乐永佑灵应大天帝君*), who governs the Five Lakes and Four Seas, overseeing the Twelve Rivers’ sources and the Watery Realm’s administration (*掌五湖四海总十二河源水府运使*), who Clarifies True Observations and Records Fortune (*澄真正观注禄定籍*), who Shines Benevolent Light to Govern the Age and Manifest the Dao (*宝光慈应治世显道*), who Preserves Peace and Extracts Guilt (*保安拔罪*), who Renews Life and Extends Eternity (*更生永命*), who Supports the Good and Relieves Suffering (*扶善济苦*), who Dissolves Calamities and Practices Transformation (*消劫行化*), and the Pure One of Unified Manifestation (*纯一显应天尊*).\n\nThis Sovereign (*帝君*) bears the surname Zhang (*张姓*), with the given name Ya (*讳亚*), corresponding to the constellations Zhang and Yi (*上应张翼二宿*), born in the Zhou Dynasty’s early era (*周初*) at the Radiant Gathering place (*昊会之地*), on the third day of the second month (*二月三日*) as his sacred birthday (*圣诞*).\n\nThe Mixed Primordial Parents (*混元父母*) are the same root as Heaven and Earth (*天地同根*). The siblings, born of the same *Qi* and flesh (*胞胎骨肉*), are one *Qi* divided into bodies (*一炁分身*).」",
      "overlap_context": "deavors stifled, yet they faithfully adhere to this treasure scroll and practice accordingly, they must solely dedicate themselves to benefiting others—severing poison, healing the sick, and saving at least three hundred and sixty people. Accumulating such great merit, they shall ascend to high fortune and noble rank, be recorded in the worthy registers, and aid the enlightened age as the most noble of officials. Their fortune shall extend to their descendants, bringing glory to their lineage.\"*",
      "start_char": 1247,
      "end_char": 2199,
      "start_sentence": 23,
      "end_sentence": 56,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 27.8988938331604,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\高上大洞文昌司禄紫阳宝箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "纲维造化，洞照无垠。 宣弘大道，济佑彝伦。 灵光下降，百福来臻。 斥除邪障，正炁长存。 急急一如文昌律令！ 显庆慈佑储真衍庆天尊，大圣长生寿母元君， 照德积庆慈懿储祥元君，昭懿冲和洞妙元君， 嗣德文昌衍庆真君，文昌静应天君， 昌德文昌司禄真君，文昌嗣庆天君， 淑真妙靖文昌万寿天君，圣宫懿淑四宫夫人， 文昌积庆真人，文昌积庆天君， 文昌袭庆真人，文昌袭庆天君， 灵山大神张忠嗣，蜀北门山神张仲子， 剑山大神张勋，蜀剑山神张孝仲， 金马山神张烈，赵王刘如意， 文昌绍应侯，文昌昭应公， 文昌承应公，文昌宝灵公， 文昌了喜夫人，文昌妙应夫人， 文昌柔贞公主。 右圣官曹治八十一仙官，领兵随箓度。 文昌储佐列神品 佐神英惠公，　　显应协惠夫人， 神嗣济美公，　　神嗣济惠公， 赞福夫人，　　　靖顺夫人， 文昌兴国大太尉，文昌左右二太尉， 文昌左右二将军，文昌如意大将军， 文昌左右二丞相，文昌左右二仆射， 文昌左右二太史，文昌三公九卿， 文昌六曹尚书，　文昌御史大夫， 文昌上将真君，　文昌次将真君， 文昌贵相真君，　文昌司命真君， 文昌司禄真君，　文昌司中真君， 文昌司贵真君，　文昌司文真君， 文昌定武仙官，　文昌定贵仙官， 文昌魁星仙官，　文昌解星仙官， 文昌应瑞仙官，　文昌降寝仙官， 文昌贡举仙官，　文昌检阴功仙官， 文昌定予夺仙官，文昌增福禄仙官， 文昌四直功曹，　文昌传奏功曹， 文昌掌桂籍童子，文昌应寝大将军， 山王明化侯夫人，主八景瑶华院仙官。 凤凰柜土地灵应侯。 右储佐列神，严肃威仪，分真降灵，卫护兆身，一如律令。 剑门山神白圭，　　　西陲飞越山神廉玠， 西域雪山神白辉，　　剑门山神公元长， 青黎山神昊肩，　　　白龟山神义敏， 大岷山神卫廉，　　　青城山神希夷公， 岷山洞天神彭元，　　岷山山神何机， 大峨山神曹英，　　　小岷山神虞观， 峨眉山神李善猷，　　巫山山神王玄父， 分樟山神张炜，　　　都大总部山神王秀水， 石犀龙洞李若水，　　灌口太守潭龙神刘成之， 西蜀都城隍韦皋，　　益州社令神杜其昌， 西蜀剑南社长邓文，　西蜀都社神杜宇， 西蜀西镇社公章，　　凤凰山神独孤正， 蜀里域神段秀，　　　岷山龙神勾盘恬， 灌口伏龙潭神蹇灶，　青衣龙神景伯仁， 越巂山神萧福，　　　北门山神张叔和， 西海龙神白龟悯，　　洞庭龙神景渊， 君山山神唐丰，　　　昊海水神彭暹， 蜀里域神虞奇叔，　　邛州里域神孙和叔， 蜀检孝神崔瑄，　　　婆娑巴王神轩安行， 检孝土地神白致一，　汉水邑里土神康潮王， 苴饶邑神公孙长，　　巴西邑神和来孙， 白马邑神栢之坚，　　苴邑神苏公长， 七曲山神全礼。 右七曲凤凰诸山佐顺龙神四十五部，各领兵度。 文昌天章玉文品 南斗文昌斗章 太极妙化，真文玄机。 掌天天文，护地地图。 理水水府，三元共敷。 紫庭大告，天地咸敷。 如意在心，玉压同居。 此文隐语，三才并居。 礼乐既作，混沌已舒。 大罗透彻，乘景蹑虚。 上智有学，训之下愚。 急急一如玉文轮掌律令！ 应宝摄妖玉文　此玉文佩眼陆坛立应丁甲日以檀香降刻之 子上冲午，为之端门。",
      "translated_text": "The cosmic threads of creation are woven with boundless illumination.\nThe Great Dao is proclaimed and the natural order is aided.\nDivine radiance descends, and a hundred blessings converge.\nEvil obstructions are repelled, and true *qi* endures eternally.\nSwiftly, as the decrees of the Celestial Worthy of Manifested Auspices!\n\nThe Celestial Worthy of Auspicious Regeneration and Accumulated Blessings,\nThe Great Saint of Eternal Life and Longevity, the Primordial Mother,\nThe Celestial Worthy of Accumulated Virtue and Auspicious Blessings,\nThe Celestial Worthy of Illustrious Harmony and Profound Mystery,\nThe True Lord of Succeeding Virtue and Celestial Auspices,\nThe Celestial Lord of Tranquil Response,\nThe True Lord of Auspicious Virtue and Celestial Destiny,\nThe Celestial Lord of Succeeding Auspices,\nThe Celestial Lord of Virtuous Purity and Serene Tranquility, the Eternal Worthy of Celestial Auspices,\nThe Sacred Consort of the Holy Palace, the Virtuous and Auspicious Four Consorts,\nThe Celestial Immortal of Accumulated Auspices,\nThe Celestial Lord of Accumulated Auspices,\nThe Celestial Immortal of Inherited Auspices,\nThe Celestial Lord of Inherited Auspices,\nThe Divine General of Ling Mountain, Zhang Zhongsi,\nThe Northern Gate Mountain God of Shu, Zhang Zhongzi,\nThe Divine General of Jian Mountain, Zhang Xun,\nThe Shu-Jian Mountain God, Zhang Xiaozhong,\nThe Divine General of Jinma Mountain, Zhang Lie,\nThe Prince of Zhao, Liu Ruyi,\nThe Celestial Marquis of Manifested Auspices,\nThe Celestial Duke of Illustrious Response,\nThe Celestial Duke of Received Auspices,\nThe Celestial Duke of Precious Spirit,\nThe Celestial Lady of Joyful Response,\nThe Celestial Lady of Wondrous Response,\nThe Celestial Princess of Gentle Virtue.\n\nTo the right, the Sacred Officials of the Eighty-One Celestial Ministers,\nCommanding armies as decreed by the scriptures.\nThe Celestial Assistants of Auspicious Regeneration, ranked among the gods:\nThe Duke of Outstanding Virtue,\nThe Lady of Manifested Cooperation,\nThe Duke of Divine Succession and Beauty,\nThe Duke of Divine Succession and Auspiciousness,\nThe Lady of Blessing,\nThe Lady of Serene Obedience,\nThe Grand Marshal of Celestial Auspices,\nThe Left and Right Marshals of Celestial Auspices,\nThe Left and Right Generals of Celestial Auspices,\nThe General of Celestial As-You-Wish,\nThe Left and Right Chancellors of Celestial Auspices,\nThe Left and Right Masters of Ceremonies of Celestial Auspices,\nThe Three Dukes and Nine Ministers of Celestial Auspices,\nThe Six Departments’ Secretaries of Celestial Auspices,\nThe Grand Censor of Celestial Auspices,\nThe Senior Marshal True Lord of Celestial Auspices,\nThe Junior Marshal True Lord of Celestial Auspices,\nThe Noble Minister True Lord of Celestial Auspices,\nThe True Lord of Celestial Destiny,\nThe True Lord of Celestial Destiny and Fortune,\nThe True Lord of Celestial Central Authority,\nThe True Lord of Celestial Nobility,\nThe True Lord of Celestial Letters,\nThe Celestial Marshal of Steadfast Virtue,\nThe Celestial Marshal of Steadfast Nobility,\nThe Celestial Marshal of the Arc Star,\nThe Celestial Marshal of the Solving Star,\nThe Celestial Marshal of Auspicious Response,\nThe Celestial Marshal of Descending Rest,\nThe Celestial Marshal of Tributary Offerings,\nThe Celestial Marshal of Inspecting Yin Merit,\nThe Celestial Marshal of Determining Grant or Denial,\nThe Celestial Marshal of Augmented Fortune and Destiny,\nThe Four Direct Functionaries of Celestial Auspices,\nThe Transmitting Edict Functionary of Celestial Auspices,\nThe Boy Attendant of the Laurel Register of Celestial Auspices,\nThe Grand General of Celestial Auspices for Descending Rest,\nThe Lady Consort of the Mountain King, the Illustrious Marquis of Transformation,\nOverseeing the Eight Scenic Jade Flower Hall Celestial Ministers.\n\nThe Celestial Duke of Auspicious Response of the Phoenix Cabinet.\n\nTo the right, the Celestial Assistants of Auspicious Regeneration,\nWith solemn and awe-inspiring demeanor,\nDividing the true and descending the numinous,\nGuarding and protecting the sacred body,\nAs decreed by the law.\n\nThe Sword Gate Mountain God, Bai Gui,\nThe Western Frontier Flying Yue Mountain God, Lian Jie,\nThe Western Domain Snow Mountain God, Bai Hui,\nThe Sword Gate Mountain God, Yuanchang,\nThe Qingli Mountain God, Haojian,\nThe Baigu Mountain God, Yimin,\nThe Great Min Mountain God, Weilian,\nThe Qingcheng Mountain God, Xiyiqiong,\nThe Min Mountain Cave Heaven God, Pengyuan,\nThe Min Mountain God, Heji,\nThe Great E Mountain God, Caoying,\nThe Xiao Min Mountain God, Yuguan,\nThe Emei Mountain God, Lishanyou,\nThe Wuyue Mountain God, Wangxuanfu,\nThe Fen Zhang Mountain God, Zhang Wei,\nThe Grand Commander of the Great General Staff, Wang Xiushui,\nThe Li Ruoshui of the Stone Rhinoceros Dragon Cave,\nThe Prefect of Guan Kou, the Dragon God Tan Long, Liu Chengzhi,\nThe City God of West Shu, Wei Gao,\nThe Community Order God of Yizhou, Du Qichang,\nThe Community Chief of West Shu’s Sword South, Deng Wen,\nThe West Shu Community God, Du Yu,\nThe West Shu West Vicinity Community Duke, Zhang,\nThe Phoenix Mountain God, Duqu Zheng,\nThe Domain God of Shu, Duan Xiu,\nThe Min Mountain Dragon God, Gou Pan,\nThe Guan Kou Supine Dragon Pool God, Jianzao,\nThe Qingyi Dragon God, Jing Boren,\nThe Yuezuo Mountain God, Xiao Fu,\nThe North Gate Mountain God, Zhang Shuhuo,\nThe West Sea Dragon God, Bai Guimin,\nThe Dongting Dragon God, Jingyuan,\nThe Junshan Mountain God, Tang Feng,\nThe Celestial Sea Water God, Pengyan,\nThe Domain God of Shu, Yu Qishu,\nThe Domain God of Qiongzhou, Sun He,\nThe West Shu Filial Piety God, Cui Juan,\nThe King of the Po Sa Ba, Xuan Anxing,\nThe Filial Piety Land God, Bai Zhi,\nThe Han Water Borough Land God, Kang Chao Wang,\nThe Ji Rao Borough God, Gong Sun Chang,\nThe Baxi Borough God, He Lai Sun,\nThe Bai Ma Borough God, Mo Zhi Jian,\nThe Ji Borough God, Su Gong Chang,\nThe Qiqu Mountain God, Quan Li.\n\nTo the right, the Forty-Five Departments of Auspicious Dragon Gods of the Seven Bends Phoenix Mountains,\nEach commanding armies and degrees.\n\nThe Celestial Auspices’ Jade Text of Heavenly Chapter,\nThe Southern Dipper’s Celestial Auspices Chapter:\nThe Mystic Transformation of the Supreme Ultimate,\nThe True Text and Profound Mechanism.\nOverseeing celestial charts, guarding terrestrial maps,\nRegulating the watery domains—together with the Three Primordials.\nThe Purple Court’s grand proclamation, heaven and earth alike responding.\nAs-you-wish in the heart, jade pressing in harmony.\nThis hidden text, the Three Realms united.\nRitual and music established, chaos now unfurled.\nThe Great Luo revealed, ascending the scene and stepping on the void.\nThe wise in learning, instructing the foolish below.\nSwiftly, as the decrees of the Jade Text Wheel!\n\nThe Auspicious Seizing Gem of the Jade Text—\nThis Jade Text amulet, inscribed on the wooden altar,\nEstablished on the *ding* day, with sandalwood incised,\nChild above, *chong* below, forming the Gate of the Center.\nFor the Gate of the Center.",
      "overlap_context": "尊*).\n\nThis Sovereign (*帝君*) bears the surname Zhang (*张姓*), with the given name Ya (*讳亚*), corresponding to the constellations Zhang and Yi (*上应张翼二宿*), born in the Zhou Dynasty’s early era (*周初*) at the Radiant Gathering place (*昊会之地*), on the third day of the second month (*二月三日*) as his sacred birthday (*圣诞*).\n\nThe Mixed Primordial Parents (*混元父母*) are the same root as Heaven and Earth (*天地同根*). The siblings, born of the same *Qi* and flesh (*胞胎骨肉*), are one *Qi* divided into bodies (*一炁分身*).」",
      "start_char": 2199,
      "end_char": 3604,
      "start_sentence": 57,
      "end_sentence": 137,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 19.399053812026978,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\高上大洞文昌司禄紫阳宝箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "申宫加酉，出入为尊。 辰来求戌，魁罡正元。 卯上通寅，天元地轮。 丑内寻巳，闱辟两全。 未中得亥，伏逆相存。 右隐诀秘咒，出文昌三炁至真之文，得之者，宜斋心炼炁，拾妄从真，绝口是心非之无诸邪想，自然增益聪明，文华奋发，越章天印，可以佩受，宝而敬之，辟恶除邪，消诸魔障。 文昌天心玉文　上天所宝秘之玄都万神侍卫三界奉行 文昌上宫，越章玉文。 上制天根，中检星辰。 下察地水，通幽彻冥。 开仁去钝，辟斥妖氛。 剪却三尸，馘灭九虫。 魑魅潜藏，旱涝无迍。 受持不怠，白日同升。 文昌中皇生炁品 中皇九道司命生炁符图 人生受命，禀质性根不一，或英华文明者，宿缘之庆，顽愚迷钝者，宿业所致。 考功行者，百仅一二，进玄机者，千无二三。 如皈心向道，参文究玄，当佩生炁符图，诵豁落真言，自然感召文昌，仙官神吏卫护兆身，增益智慧，词藻焕烂，进禄成名矣。 子丑生人趋文慕玄，敕天罡八学灵官附身心。 寅生人学文进玄，　敕威烈北府真官附身心。 卯生人通文究玄，　敕定神养锐位仙伯附身心。 辰生人向学入玄，　敕安惠叶文真人附身心。 巳生人习经耽玄，　敕仁济威广仙郎附身心。 午生人学经博玄，　敕宝益定光太史附身心。 未生人笃学明玄，　敕太华六行尚书附身心。 申生人进鸾升玄，　敕元命总辖真卿附身心。 酉生人习文趋玄，　敕东华绣衣使者附身心。 戌亥生人明经演玄，救文昌义济王附身心。 立春前后管乾　 　立夏前后管离 立秋前后管巽　 　立冬前后管坎 已上通玄究微之士，不可不考其源。 方知禀受，贵贱等差，命分深浅，方寸湛然。 功生愧负，则所求无不如意，切宜详之。 文昌生炁合形总真元命豁落真言 唵哩哩哪，啊息吸吽吽，诃诃魁啊，魒口半菩提哚。 适洞咤喃，唧虚空巡，腔辜顶越，轰轰霓霓。 闪闪烁烁，光文华清，定意疾缚，七星窍尧。 近都黄神，摩诃般若，定丁都律，吐纳真元摄。 混元真伯，通悟玄机。 一如律令！ 文昌定志益慧品 文昌司禄定贵安神益慧神咒 东河之阳，西林之南，有神王华，受命元皇。 主镇文昌，贵司之男，八会振文，九光明儒。 太一定策，玉女辅书，龙女十千，文房佐躯。 太吏百万，定心握枢，使我一身，与灵通明。 道合乘时，万章洞辉，谒帝埏文，仰契皇经。 使我策宣，坐致升平，吉日受符，披章行功。 八威助胆，龙曜飞空，十聪益慧，豁落除蒙。 意宁志显，万化疏通，神予之鉴，天佑之文。 贵宜乘之，禄宜与增，使我大成，文华益昌。 撷蓝龙姬，保宣正阳，一诵玉章，九天开光。 万化洞启，神明主张，使我神功，高致忠良。 一如律令！ 右玉章是名九天开化安神益慧神咒，乃元上浩劫大洞之文，言无韵丽，曲无华宛，深不可测，妙不可言，下世莫能闻，凡浊莫能传，秘之紫阳玉笈云锦之囊。 昔九龙始祖三元太素道君，於元始天尊前主盟请佩，而传於上元夫人、云华夫人，使下教世问，通儒贤士，诚恪佩诵，即得文彩昭明神予之鉴，高登贵选，佐助皇猷，广振文风，宣扬正化，永为身宝，准教奉行。 高上大洞文昌司禄紫阳宝箓卷上竟 高上大洞文昌司禄紫阳宝箓卷中 据某贯居住奉道信士某词称：本命某年月日时建生，上属北斗某星君主照，即日虔诚恭诣度师教主天师大真人门下，拜受《高上大洞文昌司禄紫阳宝箓》一部，皈身佩奉。",
      "translated_text": "The **Wenchang Palace’s Auspicious Seizing Gem**—\nWhen *Shēn* governs *Yǒu*, entering and exiting as the honored one.\nWhen *Chén* seeks *Xū*, the *Kui* and *Gāng* align with the Primordial.\nWhen *Mǎo* ascends to *Yín*, the Heavenly Primordial and Earthly Wheel unite.\nWithin *Chǒu*, seeking *Wèi*, the Gate of the Inner Chamber fully opens.\nWithin *Wèi*, obtaining *Hài*, the hidden and inverted harmonize.\n\nThe **Right Hidden Secret Incantation**—\nUnveiling the Three *Qi*’s True Text of *Wenchang*,\nThose who attain it should purify the heart and refine the *qi*,\nDiscarding falsehoods to embrace the True,\nCutting off all unrighteous thoughts—no evil imaginings.\nNaturally, wisdom and brilliance increase,\nLiterary splendor flourishes,\nAscending the *Yuèzhāng* Heavenly Seal—\nWorthy to wear and revere,\nWarding off evil, dispelling malevolence,\nDissolving all demonic obstructions.\n\n**Wenchang’s Heavenly Heart Jade Text**—\nA treasure of the Highest Heaven, secretly kept in the Mysterious Capital,\nWhere ten thousand spirits attend and the Three Realms obey.\nThe **Wenchang Upper Palace’s Jade Text of Ascending the *Yuèzhāng***—\nAbove, it governs the Heavenly Root;\nIn the middle, it inspects the stars;\nBelow, it discerns earth and water,\nPiercing the obscure and fathoming the dark.\nOpening benevolence and removing dullness,\nDispelling and repelling demonic mists.\nSevering the Three Corpses,\nDecapitating the Nine Vermin.\nDemons and ghouls retreat in hiding,\nDroughts and floods bring no obstruction.\nIf held with reverence, one ascends in broad daylight.\n\n**Wenchang’s Central Sovereign’s *Qi*-Generating Brand**—\n**The Sovereign’s Nine Paths Commanding Life’s *Qi*-Generating Diagram**—\nSince birth, humans receive their fate,\nTheir innate nature and roots vary—\nSome are born with brilliance and literary grace,\nA blessing of past karmic ties,\nWhile others are dull and obtuse,\nA result of past misdeeds.\nAmong those who strive for merit,\nFew attain even one in a hundred,\nAnd among those who delve into the Profound Mechanism,\nScarcely two or three in a thousand succeed.\nIf one turns the heart to the Dao,\nStudies the Text, and explores the Profound,\nThey should wear the *Qi*-Generating Diagram,\nRecite the *Huòluò* True Speech,\nNaturally invoking *Wenchang*,\nWhere celestial officials and spirit clerks guard their person,\nEnhancing wisdom and eloquence,\nIlluminating literary splendor,\nAdvancing in fortune and achieving renown.\n\nFor those born in **Child (Zǐ)** and **Ox (Chǒu)**—\nAspiring to literature and seeking the Profound,\nCommand the *Tiāngāng* Eight Learning Spirit Officials to attend their heart and mind.\nFor those born in **Tiger (Yín)**—\nStudying literature and advancing to the Profound,\nCommand the *Wēiliè* Northern Palace True Official to attend their heart and mind.\nFor those born in **Rabbit (Mǎo)**—\nMastering literature and exploring the Profound,\nCommand the *Dìngshén Yǎngruì* Positioned Spirit Lord to attend their heart and mind.\nFor those born in **Dragon (Chén)**—\nTurning to learning and entering the Profound,\nCommand the *Ānhuì Yèwén* True Person to attend their heart and mind.\nFor those born in **Snake (Wèi)**—\nPracticing scripture and indulging in the Profound,\nCommand the *Rénjiè Wēiguāng* Spirit Gentleman to attend their heart and mind.\nFor those born in **Horse (Wǔ)**—\nStudying scripture and broadly exploring the Profound,\nCommand the *Bǎoyì Dìngguāng* Grand Historian to attend their heart and mind.\nFor those born in **Sheep (Wèi)**—\nDiligently studying and clarifying the Profound,\nCommand the *Tàihé Liùxíng* Six Ranks Chancellor to attend their heart and mind.\nFor those born in **Monkey (Shēn)**—\nAdvancing to the *Luán* and ascending the Profound,\nCommand the *Yuánmìng Zǒngxiá* True Vizier to attend their heart and mind.\nFor those born in **Rooster (Yǒu)**—\nPracticing literature and striving for the Profound,\nCommand the *Dōnghuá Xiùyī* Embroidered-Robe Messenger to attend their heart and mind.\nFor those born in **Dog (Xū)** and **Pig (Hài)**—\nClarifying scripture and expounding the Profound,\nCommand the *Wenchang Yìjiè* Righteous Aid King to attend their heart and mind.\n\n**Seasonal Governance:**\nBefore and after the **Spring Equinox**, governing *Kàn* (North).\nBefore and after the **Summer Solstice**, governing *Lí* (South).\nBefore and after the **Autumn Equinox**, governing *Xùn* (East).\nBefore and after the **Winter Solstice**, governing *Kǎn* (West).\n\nThose who seek the Profound and fathom the subtle must examine their origins.\nOnly then will they know their innate reception—\nNoble or lowly, the gradations of rank,\nThe depth of their fate, their inner purity.\nIf merit arises from shame or neglect,\nAll their aspirations will be fulfilled.\nThis must be carefully considered.\n\n**Wenchang’s *Qi*-Generating Unified Form’s True Command *Huòluò* True Speech:**\n*Ōm lì lì nà, ā xī xī hū hū, hé hé kuí à, hē kǒu bàn pútí duō.*\n*Shì dòng zhà nán, jī xūkōng xún, qiāng gū dǐng yuè, hōng hōng ní ní.*\n*Shǎn shǎn shuò shuò, guāng wén huá qīng, dìng yì jí fù, qī xīng qiào yáo.*\n*Jìn dū huáng shén, móhē bōrú, dìng dīng dū lǜ, tǔ nà zhēnyuán shè.*\n*Hùnyuán zhēnbó, tōng wù xuán jī.*\nAs the decrees command!\n\n**Wenchang’s Stabilizing Will and Enhancing Wisdom Brand:**\n**Wenchang’s Commanding Fortune, Stabilizing Nobility, Calming Spirit, and Enhancing Wisdom Incantation**—\nOn the eastern bank of the Eastern River,\nTo the south of the Western Forest,\nThere is the God-King *Huá*,\nThe Primordial Sovereign who receives the Mandate.\nHe governs *Wenchang*’s noble office,\nEight Confluences vibrating with literature,\nNine Radiant Lights illuminating the scholar.\nThe Great Seal is firmly set,\nThe Jade Maiden assists in writing,\nThe Dragon Maiden of ten thousand,\nAiding the literary chamber.\nA hundred thousand clerks,\nStabilizing the heart, grasping the pivot,\nMaking my body one with the enlightened and luminous.\nThe Dao aligns with the times,\nTen thousand chapters brightly revealed,\nPaying homage to the Emperor, carving the Text,\nGazing upward to contract with the Imperial Scripture.\nLet my decrees be proclaimed,\nSitting to achieve peace—\nOn an auspicious day, receiving the talisman,\nUnfurling the chapter to perform the ritual.\nEight Auras bolstering courage,\nDragon radiance soaring through the sky,\nTen intelligences enhancing wisdom,\nThe *Huòluò* dispelling ignorance.\nMind at ease, will manifest,\nTen thousand transformations freely flowing,\nDivine insight discerning,\nHeaven’s aid manifesting in the Text.\nNobility should ride upon it,\nFortune should be augmented with it,\nLet me achieve greatness,\nLiterary splendor ever flourishing.\nPlucking the Azure Dragon Maiden,\nProclaiming the True Yang,\nReciting the Jade Chapter once,\nNine Heavens’ light opens.\nTen thousand transformations brightly revealed,\nDivine and luminous presiding,\nLet my divine function,\nAscend to loyal excellence.\nAs the decrees command!\n\nThis **Jade Chapter** is named the **Nine Heavens’ Opening Enlightenment Calming Spirit and Enhancing Wisdom Incantation**—\nA text of the Primordial Great Cataclysm’s Mysterious Capital,\nWords without melodious beauty,\nMusic without ornate grace,\nDeep beyond measure,\nWondrous beyond speech,\nUnheard in the mortal world,\nUntransmitted by the vulgar.\nIt is secretly kept in the *Zǐyáng* Jade Case of Cloud-Brocade.\n\nIn antiquity, the **Nine Dragons’ Ancestor, the Three Primordials’ Pure Substance Dao Lord**,\nBefore the **Primordial Beginning Heavenly Venerable**,\nPresided over the alliance and requested the talisman,\nPassing it down to the **Upper Primordial Lady** and the **Cloud-Hua Lady**,\nWho taught it to the world, instructing sincere and reverent scholars and virtuous officials.\nIf one sincerely wears and recites it,\nThey will attain radiant literary brilliance,\nDivine insight’s discernment,\nAscending to noble selection,\nAssisting the Imperial Will,\nBroadly promoting literary culture,\nPropagating the True Transformation,\nForever as a personal treasure,\nTo be followed and practiced as taught.\n\n**End of the Highest Mysterious Capital *Wenchang* Commanding Fortune *Zǐyáng* Sacred Register, Volume One**\n\n**Highest Mysterious Capital *Wenchang* Commanding Fortune *Zǐyáng* Sacred Register, Volume Two**\n\nAccording to the record of **a certain resident and devout Daoist practitioner**,\nBorn on the **year, month, day, and hour** of my life,\nBelonging to the **North Dipper’s** [star] Lord’s governance,\nI, with sincere devotion, respectfully knelt before the **Degree Master, Teaching Master, and Great True Person of the Dao**,\nBowing to receive the **Highest Mysterious Capital *Wenchang* Commanding Fortune *Zǐyáng* Sacred Register** in its entirety,\nAnd now wear and revere it as my body’s treasure.",
      "overlap_context": "dden text, the Three Realms united.\nRitual and music established, chaos now unfurled.\nThe Great Luo revealed, ascending the scene and stepping on the void.\nThe wise in learning, instructing the foolish below.\nSwiftly, as the decrees of the Jade Text Wheel!\n\nThe Auspicious Seizing Gem of the Jade Text—\nThis Jade Text amulet, inscribed on the wooden altar,\nEstablished on the *ding* day, with sandalwood incised,\nChild above, *chong* below, forming the Gate of the Center.\nFor the Gate of the Center.",
      "start_char": 3604,
      "end_char": 4983,
      "start_sentence": 138,
      "end_sentence": 197,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 27.82731032371521,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\高上大洞文昌司禄紫阳宝箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "誓以崇敬帝真，遵依科戒，进修文业，积习善功，悟太上之玄机，消除魔障，登文昌之贵籍，显达科名，济世安人，保身利物。 有违科约，以身谢天地水三官，一如玄科律令！ 文昌简阅宝图品 夫文昌宝图，乃自混沌初分，太元高上玉皇之炁结而成文，丹霞碧云自然成章，出於元始天王，同出而异名，閟於上清龙罗玄鸾之台，安紫阳九光凤华之阙，文昌皇人玄元道君夫子为文昌图阙帝主，命此宝图生化文儒贤士，辅佐圣统王道，使英俊文物世代克昌，佩受之士即得玄炁降神，文华清秀，才识通明，心光自然无所不至，百千障碍不能壅蔽，当有侍图金童玉女、天官神吏等三百六十人随符护身，子宜敬奉焉。 文昌侍图金童三百六十人度， 文昌侍图玉女三百六十人度， 文昌侍图天官三百六十人度， 文昌侍图神吏三百六十人度， 文昌三五定命吏三百六十人度， 文昌三五定心吏三百六十人度， 文昌三五定志吏三百六十人度， 文昌三五定意吏三百六十人度， 文昌三五定聪吏三百六十人度， 文昌三五定慧吏三百六十人度， 文昌三五定胆吏三百六十人度， 文昌三五和神吏三百六十人度， 文昌三五合神吏三百六十人度， 文昌三五通达吏三百六十人度， 文昌三五开鉴吏三百六十人度， 文昌三五通识吏三百六十人度， 文昌三五却邪吏三百六十人度， 文昌三五除障吏三百六十人度， 文昌三五生炁吏三百六十人度， 文昌三五文章吏三百六十人度， 文昌三五开性吏三百六十人度， 文昌三五注禄吏三百六十人度， 文昌应寝吉神吏三百六十人度， 文昌佐贤龙女吏三百六十人度， 文昌辅文玉女吏三百六十人度， 文昌辅文水吏玉妃一人度， 文昌黄神玉印太一使者八人度， 文昌越章环天玉女八人度， 文昌八景瑶华院印力士一人度， 文昌主剑神王玉女八人度。 右文昌宝图玉符，给付弟子某拨隶金童玉女仙官神史，如遇三元日，斋心沐浴，投诚醮祭，以求吉寝，进名科品，一如盟约信受奉行。 文昌司禄玉符品 上元天曹司禄真君一人， 上元天府司禄真君一人，. 上元天府司天禄吏八十一人， 上元天府司加天禄吏八十一人， 上元天府司人禄吏八十一人， 上元天府司加人禄吏八十一人， 上元天府司天爵吏八十一人， 上元天府司加天爵吏八十一人， 上元天府司人爵吏八十一人， 上元天府司加人爵吏八十一人， 上元天府司幽禄吏八十一人， 上元天府司加幽禄吏八十一人， 上元天府司幽爵吏八十一人， 上元天府司加幽爵吏八十一人。 右司禄玉符，给付弟子某佩受修持，崇奉文昌司禄真君，诵咏大洞紫阳玉章，自然感召仙官神吏，增益智慧，通才辅文，进登禄位，一如盟言。 文昌定贵金简品 始青天开化主宰定贵真君， 太青天开化主宰定贵真君， 始丹天开化主宰定贵真君， 太丹天开化主宰定贵真君， 始素天开化主宰定贵真君， 太素天开化主宰定贵真君， 始玄天开化主宰定贵真君， 太玄天开化主宰定贵真君， 中央大梵天开化主宰定贵真君， 中元地府定上品贵人吏三十六人， 中元地府定中品贵人吏三十六人， 中元地府定下品贵人吏三十六人， 中元地府定帝圣贵人吏三十六人， 中元地府定王爵贵人吏三十六人， 中元地府定公爵贵人吏三十六人， 中元地府定侯爵贵人吏三十六人，",
      "translated_text": "I solemnly vow to hold in highest reverence the **Imperial True One**,\nTo follow the **precepts and prohibitions** with devotion,\nTo advance in **literary cultivation** and accumulate **meritorious deeds**,\nTo awaken to the **Highest Sovereign’s** mysterious mechanisms,\nTo dispel demonic obstructions and ascend to the **Wenchang’s** noble register,\nTo achieve distinction in **scholarly rank** and benefit the world in peace,\nTo preserve life and benefit all beings.\n\nShould I violate these precepts,\nI shall offer my body in atonement to the **Three Officials of Heaven, Earth, and Water**,\nAs decreed by the **Mysterious Statutes**!\n\n---\n**Wenchang’s Simplified Review Sacred Diagram**\n\nThe **Wenchang Sacred Diagram** originates from the **Chaos’s primordial division**,\nWhen the **Highest Supreme Jade Emperor’s** *qi* coalesced into script,\nWith **crimson clouds and emerald mists** naturally forming chapters.\nIt emanates from the **Primordial Beginning Heavenly King**,\nYet bears a distinct name while sharing the same source.\nIt was sealed within the **Upper Clarity Dragon’s Network and Mysterious Phoenix Pavilion**,\nAnd enshrined in the **Purple Yang Nine-Light Phoenix Glory Gate**,\nWhere the **Wenchang Imperial Person, the Mysterious Origin Dao Lord, and Master** preside as sovereigns of the Diagram’s Gate.\nThis Sacred Diagram is commissioned to **generate virtuous scholars and worthy sages**,\nTo assist the **sacred lineage of kingship and the Dao’s path**,\nSo that **talented and cultured figures flourish eternally**.\nThose who wear and revere it shall receive the **Mysterious *qi* descending as spirit**,\nWith **literary brilliance and refined elegance**,\nTheir **talent and insight unbounded**,\nTheir **inner light reaching all things**,\nNo thousandfold obstruction able to block them.\nThey shall be attended by **three hundred sixty gold boys, jade girls, celestial officials, and divine clerks**,\nWho follow the talisman to guard their person.\n**You must revere and uphold this with sincerity.**\n\n---\n**Degrees of Wenchang’s Attendant Gold Boys (360)**\n**Degrees of Wenchang’s Attendant Jade Girls (360)**\n**Degrees of Wenchang’s Celestial Officials (360)**\n**Degrees of Wenchang’s Divine Clerks (360)**\n**Degrees of Wenchang’s Three-Five Destiny Clerks (360)**\n**Degrees of Wenchang’s Three-Five Mind Clerks (360)**\n**Degrees of Wenchang’s Three-Five Will Clerks (360)**\n**Degrees of Wenchang’s Three-Five Intent Clerks (360)**\n**Degrees of Wenchang’s Three-Five Hearing Clerks (360)**\n**Degrees of Wenchang’s Three-Five Wisdom Clerks (360)**\n**Degrees of Wenchang’s Three-Five Courage Clerks (360)**\n**Degrees of Wenchang’s Three-Five Harmonizing Spirit Clerks (360)**\n**Degrees of Wenchang’s Three-Five Uniting Spirit Clerks (360)**\n**Degrees of Wenchang’s Three-Five Reaching Clerks (360)**\n**Degrees of Wenchang’s Three-Five Opening Insight Clerks (360)**\n**Degrees of Wenchang’s Three-Five Comprehensive Knowledge Clerks (360)**\n**Degrees of Wenchang’s Three-Five Repelling Evil Clerks (360)**\n**Degrees of Wenchang’s Three-Five Removing Obstructions Clerks (360)**\n**Degrees of Wenchang’s Three-Five Generating *Qi* Clerks (360)**\n**Degrees of Wenchang’s Three-Five Literary Clerks (360)**\n**Degrees of Wenchang’s Three-Five Opening Nature Clerks (360)**\n**Degrees of Wenchang’s Three-Five Bestowing Fortune Clerks (360)**\n**Degrees of Wenchang’s Auspicious Sleeping Celestial Clerks (360)**\n**Degrees of Wenchang’s Assisting Virtuous Dragon Girls Clerks (360)**\n**Degrees of Wenchang’s Assisting Literary Jade Girls Clerks (360)**\n**Degrees of Wenchang’s Assisting Literary Water Clerks and Jade Consorts (1)**\n**Degrees of Wenchang’s Yellow Gods, Jade Seals, and Taiyi Envoys (8)**\n**Degrees of Wenchang’s Transcending Chapters, Encompassing Heaven Jade Girls (8)**\n**Degrees of Wenchang’s Eight Scenes, Jade Splendor Hall, and Seal-Bearing Officials (1)**\n**Degrees of Wenchang’s Sword-Master God-King Jade Girls (8)**\n\n---\nThis **Wenchang Sacred Diagram Jade Talisman** is bestowed upon disciple [name],\nEnrolled under the **gold boys, jade girls, celestial officials, and divine clerks**.\nWhen encountering the **Three Celestial Days**,\nPurify the heart with fasting, bathe in ritual purity,\nOffer sincere sacrifices to seek **auspicious repose** and advancement in **ranked merit**,\nAs per the **pledge and received faith**—to be upheld faithfully.\n\n---\n**Wenchang’s Fortune-Commanding Jade Talisman**\n\n**Upper Primordial Heavenly Bureau’s Fortune-Commanding True Lord (1)**\n**Upper Primordial Heavenly Treasury’s Fortune-Commanding True Lord (1)**\n**Upper Primordial Heavenly Treasury’s Celestial Fortune Clerks (81)**\n**Upper Primordial Heavenly Treasury’s Augmented Celestial Fortune Clerks (81)**\n**Upper Primordial Heavenly Treasury’s Human Fortune Clerks (81)**\n**Upper Primordial Heavenly Treasury’s Augmented Human Fortune Clerks (81)**\n**Upper Primordial Heavenly Treasury’s Celestial Rank Clerks (81)**\n**Upper Primordial Heavenly Treasury’s Augmented Celestial Rank Clerks (81)**\n**Upper Primordial Heavenly Treasury’s Human Rank Clerks (81)**\n**Upper Primordial Heavenly Treasury’s Augmented Human Rank Clerks (81)**\n**Upper Primordial Heavenly Treasury’s Nether Fortune Clerks (81)**\n**Upper Primordial Heavenly Treasury’s Augmented Nether Fortune Clerks (81)**\n**Upper Primordial Heavenly Treasury’s Nether Rank Clerks (81)**\n**Upper Primordial Heavenly Treasury’s Augmented Nether Rank Clerks (81)**\n\n---\nThis **Fortune-Commanding Jade Talisman** is bestowed upon disciple [name] to wear and cultivate,\nTo revere the **Wenchang Fortune-Commanding True Lords**,\nTo recite the **Highest Mysterious Purple Yang Jade Chapters**,\nNaturally summoning **celestial officials and divine clerks**,\nTo augment **wisdom and talent**, assist in **literary brilliance**,\nAnd ascend to **fortune and rank**,\nAs per the **pledged words**.\n\n---\n**Wenchang’s Destiny-Noble Golden Tablets**\n\n**Primordial Azure Heaven’s Cultivation Sovereign Destiny-Noble True Lord**\n**Supreme Azure Heaven’s Cultivation Sovereign Destiny-Noble True Lord**\n**Primordial Vermilion Heaven’s Cultivation Sovereign Destiny-Noble True Lord**\n**Supreme Vermilion Heaven’s Cultivation Sovereign Destiny-Noble True Lord**\n**Primordial White Heaven’s Cultivation Sovereign Destiny-Noble True Lord**\n**Supreme White Heaven’s Cultivation Sovereign Destiny-Noble True Lord**\n**Primordial Dark Heaven’s Cultivation Sovereign Destiny-Noble True Lord**\n**Supreme Dark Heaven’s Cultivation Sovereign Destiny-Noble True Lord**\n**Central Great Brahman Heaven’s Cultivation Sovereign Destiny-Noble True Lord**\n**Middle Primordial Underworld’s Upper-Rank Noble Clerks (36)**\n**Middle Primordial Underworld’s Middle-Rank Noble Clerks (36)**\n**Middle Primordial Underworld’s Lower-Rank Noble Clerks (36)**\n**Middle Primordial Underworld’s Imperial-Sage Noble Clerks (36)**\n**Middle Primordial Underworld’s Kingly Noble Clerks (36)**\n**Middle Primordial Underworld’s Ducal Noble Clerks (36)**\n**Middle Primordial Underworld’s Marquess Noble Clerks (36)**",
      "overlap_context": "\nAccording to the record of **a certain resident and devout Daoist practitioner**,\nBorn on the **year, month, day, and hour** of my life,\nBelonging to the **North Dipper’s** [star] Lord’s governance,\nI, with sincere devotion, respectfully knelt before the **Degree Master, Teaching Master, and Great True Person of the Dao**,\nBowing to receive the **Highest Mysterious Capital *Wenchang* Commanding Fortune *Zǐyáng* Sacred Register** in its entirety,\nAnd now wear and revere it as my body’s treasure.",
      "start_char": 4983,
      "end_char": 6397,
      "start_sentence": 198,
      "end_sentence": 265,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 19.530433177947998,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\高上大洞文昌司禄紫阳宝箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "中元地府定伯爵贵人吏三十六人， 中元地府定男爵贵人吏三十六人， 中元地府定子爵贵人吏三十六人， 中元地府定郎官贵人吏三十六人， 中元地府定大夫贵人吏三十六人， 中元地府定父母封爵吏三十六人， 中元地府定官爵官吏三十六人， 中元地府定荫子贵吏三十六人， 中元地府定封妻爵吏三十六人， 中元地府定富贵全籍吏三十六人， 中元地府定贵族官吏三十六人， 文昌掌禄籍判官主簿书列定上品贵人一千二百人随箓度。 右定贵金简，真君仙史依科传授，付弟子某敬奉修持，当得书名金简，注上中元定贵籍中，列字上品，荣身享禄，显达功名，忠孝君亲，流泽后裔，一如盟约奉行。 文昌进贤玉策品 下元水府进上科上品贵人吏从一百二十人度， 下元水府进上科中品贵人吏从一百二十人度， 下元水府进上科下品贵人吏从一百二十人度， 下元水府进中科上品贵人吏从一百二十人度， 下元水府进中科中品贵人吏从一百二十人度， 下元水府进中科下品贵人吏从一百二十人度， 下元水府进下科上品贵人吏从一百二十人度， 下元水府进下科中品贵人吏从一百二十人度， 下元水府进下科下品贵人吏从一百二十人度， 下元水府进贤女吏神妃从一百二十人度， 下元水府进贤龙女神妃从一百二十人度。 右进贤玉策，水府官吏龙女神妃卫护，受箓弟子某精勤佩奉，进德立功，上佐皇猷，垂名昭世，一如盟科奉行。 文昌消魔金篆品 护国消魔金篆中功曹神吏 第一功曹辅兴领将一万人度， 第二功曹荀明领将一万人度， 第三功曹费陟新领将一万人度， 第四功曹庞玠领将一万人度， 第五功曹鲁镠领将一万人度， 第六功曹宋炳领将一万人度， 第七功曹高逸领将一万人度， 第八功曹赵橹领将一万人度， 第九功曹赵期领将一万人度， 第十功曹王石领将一万人度， 右消魔金篆，功曹仙史一合下降拥护，弟子某镇卫心田，开明真性，进贵进禄，克亨克通，以太和真炁止讼消殃，以大洞仙兵摧魔斥恶，解释冤仇业债，断绝苦本地根，文德日昌，才名显达，进登贵籍，辅佐明时，一如文昌科法律令。 文昌元纲演化品 紫微上宫文昌太极都督灵章，上可保制劫运，宣化天机，中可以飞鸾演化，济世安民，下可以保身护命，度厄延年，得悟之者，证圣成真矣。 文昌东壁璇玑品 东壁图书琼瑶玉文 五运合景，东壁图书。 先天先地，合璧连珠。 正真生炁，运合化车。 修文偃武，洞达玄都。 少微处士，君子多居。 臣今学谱，愿入仙衢。 澄真正观，如意宝书。 唵鬼亨鬼晢魒鬼沓鬼禽鬼音鬼甫，急急一如溥天大元帅口敕律令！ 右东图书琼瑶玉文，上应九天自然之道，为文昌府玄秘之文，得之者，开明神鉴，进益才华，星宿垂光，降祥生熙，灭诸障得，消诸不祥，一如大洞文昌科法律令。 文昌宫曹骑卫品 文昌大洞宝箓建节大将军天驺甲卒 神吏一万人度， 文昌大洞宝箓监功大将军天驺甲卒 神吏一万人度， 文昌大洞宝箓骑卫大将军天驺甲卒 神吏一万人度， 九天开化，浩劫文昌。 一炁周流，玄造翕张。 万神奉令，赫奕飞扬。 玉符金篆，收灭瘟黄。 吞魔食鬼，怪孽消亡。 威振宇宙，万劫难当。 随吾敕召，青律有常。 毋违盟誓，立见神光。 急急一如文昌律令！ 治正执正吏百二十人度，",
      "translated_text": "**Middle Primordial Underworld’s Count Noble Clerks (36)**\n**Middle Primordial Underworld’s Baron Noble Clerks (36)**\n**Middle Primordial Underworld’s Viscount Noble Clerks (36)**\n**Middle Primordial Underworld’s Official Noble Clerks (36)**\n**Middle Primordial Underworld’s Grandee Noble Clerks (36)**\n**Middle Primordial Underworld’s Parental Enfeoffment Clerks (36)**\n**Middle Primordial Underworld’s Official-Rank Clerks (36)**\n**Middle Primordial Underworld’s Shadowed-Son Noble Clerks (36)**\n**Middle Primordial Underworld’s Enfeoffed-Wife Noble Clerks (36)**\n**Middle Primordial Underworld’s Comprehensive Noble Registry Clerks (36)**\n**Middle Primordial Underworld’s Noble Lineage Clerks (36)**\n\n**The Golden Tablet of Registered Nobility**\nBy decree of the True Lords and Daoist Historians, the disciple [name] reverently receives and practices this scripture, thereby attaining the Golden Tablet of Registration. His name shall be inscribed in the Middle Primordial Underworld’s Noble Registry as an **Upper-Rank Noble**, granting him:\n- Honor in person,\n- Prosperity in livelihood,\n- Eminence in merit and fame,\n- Loyalty and filial piety before sovereign and kin,\n- Blessings extending to posterity—\nas sworn in the covenant.\n\n**The Jade Strategy of Advancing Merit**\n**Lower Primordial Watery Underworld’s Merit-Ascending Clerks (120 each):**\n- Upper Merit, Upper-Rank Noble Clerks\n- Upper Merit, Middle-Rank Noble Clerks\n- Upper Merit, Lower-Rank Noble Clerks\n- Middle Merit, Upper-Rank Noble Clerks\n- Middle Merit, Middle-Rank Noble Clerks\n- Middle Merit, Lower-Rank Noble Clerks\n- Lower Merit, Upper-Rank Noble Clerks\n- Lower Merit, Middle-Rank Noble Clerks\n- Lower Merit, Lower-Rank Noble Clerks\n- Merit-Ascending Virtuous Female Clerks (120)\n- Merit-Ascending Dragon-Maid Clerks (120)\n\nBy decree of the Watery Underworld’s officials, dragon-maid attendants, and divine consorts, the disciple [name], with diligent devotion, wears this scripture and:\n- Cultivates virtue and achieves merit,\n- Assists the Celestial Mandate,\n- Earns eternal renown—\nas sworn in the Merit Laws.\n\n**The Golden Seal of Demonic Subjugation**\n**Divine Clerks of the Central Bureau of Merit (10,000 each):**\n1. **First Merit Officer (Fu Xing)** – Leading Ten Thousand Generals\n2. **Second Merit Officer (Xun Ming)** – Leading Ten Thousand Generals\n3. **Third Merit Officer (Fei Zhi)** – Leading Ten Thousand Generals\n4. **Fourth Merit Officer (Pang Jue)** – Leading Ten Thousand Generals\n5. **Fifth Merit Officer (Lu Mao)** – Leading Ten Thousand Generals\n6. **Sixth Merit Officer (Song Bing)** – Leading Ten Thousand Generals\n7. **Seventh Merit Officer (Gao Yi)** – Leading Ten Thousand Generals\n8. **Eighth Merit Officer (Zhao Lu)** – Leading Ten Thousand Generals\n9. **Ninth Merit Officer (Zhao Qi)** – Leading Ten Thousand Generals\n10. **Tenth Merit Officer (Wang Shi)** – Leading Ten Thousand Generals\n\nBy the **Golden Seal of Demonic Subjugation**, the Merit Officers and Daoist Historians descend in unity to defend the disciple [name], who thereby:\n- Guards the heart-mind,\n- Illuminates true nature,\n- Ascends in nobility and fortune,\n- Achieves harmony and success,\n- Suppresses litigation and calamities with **Great Harmony True Qi**,\n- Crushes demons and banishes evil with **Great Cavern Celestial Soldiers**,\n- Resolves grievances and karmic debts,\n- Severing the roots of suffering,\n- Cultivating literary virtue and fame,\n- Ascending to noble registry,\n- Assisting the enlightened age—\nas decreed by the **File-Chang Laws**.\n\n**The Primordial Constitution of Transformation**\n**The Supreme Sovereign of the Purple Micro Celestial File-Chang**\n- Preserves the fate of kalpas,\n- Declares the mysteries of Heaven,\n- Transforms with flying cranes to benefit the world,\n- Protects life and extends years,\n- Enlightened practitioners attain sainthood and transcendence.\n\n**The Eastern Wall Celestial Diagram**\n**Jade and Pearl Scriptures of the Eastern Wall**\n*\"Five Phases converge in harmony—\nThe Eastern Wall’s celestial diagrams.\nBefore Heaven and Earth—\nJade tablets and pearls align.\nTrue Qi generates—\nThe transformative chariot moves.\nCultivate the literary, suppress the martial,\nPierce the mysteries of the Dark Metropolis.\nThe Minor Constellation’s recluse—\nThe virtuous dwell therein.\nI now study the lineage,\nAspiring to enter the Daoist thoroughfare.\nClarify true perception—\nThe Wish-Fulfilling Treasure Scroll.\n**Om! Ghosts, ghosts, ghosts, ghosts, ghosts, ghosts, ghosts!**\nAs decreed by the **Universal Marshal of the Great Void**!\"*\n\nBy this **Jade and Pearl Scripture of the Eastern Wall**, aligned with the Nine Heavens’ natural order and the **File-Chang’s arcane texts**, the recipient:\n- Opens divine insight,\n- Enhances talent and brilliance,\n- Invokes stellar blessings,\n- Dispels all obstructions and misfortunes—\nas decreed by the **Great Cavern File-Chang Laws**.\n\n**The Celestial Cavalry of the File-Chang Bureau**\n**Divine Clerks of the Great Cavern’s Celestial Cavalry (10,000 each):**\n- **Supreme General of the Golden Talisman** – Ten Thousand Armored Soldiers\n- **Supervising General of Merit** – Ten Thousand Armored Soldiers\n- **Cavalry General** – Ten Thousand Armored Soldiers\n\n*\"Nine Heavens open cultivation—\nThe File-Chang’s vast transformation.\nQi circulates universally—\nMysterious creation unfolds.\nTen thousand gods obey—\nTheir splendor soars.\nJade talismans and gold seals—\nBanish the Yellow Plague.\nDevour demons, consume ghosts—\nMonstrous calamities vanish.\nAwe resonates through the cosmos—\nUnshaken through kalpas.\nBy my decree, the Green Laws prevail—\nNo defiance of the oath!\nDivine light shall manifest instantly!\"*\n\n**One Hundred Twenty Rectifying Clerks** ascend.",
      "overlap_context": "an Heaven’s Cultivation Sovereign Destiny-Noble True Lord**\n**Middle Primordial Underworld’s Upper-Rank Noble Clerks (36)**\n**Middle Primordial Underworld’s Middle-Rank Noble Clerks (36)**\n**Middle Primordial Underworld’s Lower-Rank Noble Clerks (36)**\n**Middle Primordial Underworld’s Imperial-Sage Noble Clerks (36)**\n**Middle Primordial Underworld’s Kingly Noble Clerks (36)**\n**Middle Primordial Underworld’s Ducal Noble Clerks (36)**\n**Middle Primordial Underworld’s Marquess Noble Clerks (36)**",
      "start_char": 6397,
      "end_char": 7772,
      "start_sentence": 266,
      "end_sentence": 334,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 17.620487689971924,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\高上大洞文昌司禄紫阳宝箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "消魔按魔吏百二十人度， 收瘟食瘟吏百二十人度， 收魔食魔吏百二十人度， 收毒食毒吏百二十人度， 收鬼食鬼吏百二十人度， 收神食神吏百二十人度， 收炁食黑吏百二十人度， 收邪食邪吏百二十人度， 收精食精吏百二十人度， 收妖食妖吏百二十人度， 收怪食怪吏百二十人度， 收歹羊食群吏百二十人度， 收虫食虫吏百二十人度， 诛邪破庙吏百二十人度， 治病神医吏百二十人度， 驿马上章吏百二十人度， 飞龙骑吏百二十人度， 右宫曹建节监功骑卫大将军天驺甲卒收邪驱瘟神史，护卫弟子某身有光明，心生灵鉴，灭诸邪障，驱部不祥，瘟疫无侵，怪妖削迹，应诸求祷，随愿克成，佐治皇风，敷扬正化，一如文昌主宰紫阳金格，宣令奉行。 弟子某即日虔诚恭诣度师教主天师大真人门下，拜受太上经箓，皈身崇奉，受佩之后，不敢始勤终怠，轻泄灵文，如负盟言，一如玄科律令 高上大洞文昌司禄紫阳宝箓卷中竟",
      "translated_text": "**Rectifying Clerks of the Dao:**\n\n- **One Hundred Twenty Clerks of Subduing Demons** ascend.\n- **One Hundred Twenty Clerks of Collecting and Consuming Plagues** ascend.\n- **One Hundred Twenty Clerks of Collecting and Consuming Demons** ascend.\n- **One Hundred Twenty Clerks of Collecting and Consuming Toxins** ascend.\n- **One Hundred Twenty Clerks of Collecting and Consuming Ghosts** ascend.\n- **One Hundred Twenty Clerks of Collecting and Consuming Spirits** ascend.\n- **One Hundred Twenty Clerks of Collecting and Consuming Black Qi** ascend.\n- **One Hundred Twenty Clerks of Collecting and Consuming Evil** ascend.\n- **One Hundred Twenty Clerks of Collecting and Consuming Vital Essence** ascend.\n- **One Hundred Twenty Clerks of Collecting and Consuming Demonic Beasts** ascend.\n- **One Hundred Twenty Clerks of Collecting and Consuming Monsters** ascend.\n- **One Hundred Twenty Clerks of Collecting and Consuming Malevolent Flocks** ascend.\n- **One Hundred Twenty Clerks of Collecting and Consuming Vermin** ascend.\n- **One Hundred Twenty Clerks of Punishing Evil and Destroying Shrines** ascend.\n- **One Hundred Twenty Clerks of Divine Physicians for Healing Illnesses** ascend.\n- **One Hundred Twenty Clerks of Relay Horses Reporting by Tablet** ascend.\n- **One Hundred Twenty Clerks of Flying Dragon Cavalry** ascend.\n\n**Right Palace Officials, Established with Commanding Seals, Overseeing Merit and Cavalry Generals of the Celestial Armored Soldiers:**\n\n*\"By decree, the Heavenly Armored Soldiers—\nSubduing evil, driving plagues—\nGuard the disciple’s body with radiant light,\nAwaken the mind with divine insight,\nExtinguish all malevolent obstructions,\nDrive away inauspicious omens.\nPlagues dare not intrude,\nMonsters vanish without trace.\nAll supplications are answered,\nWishes fulfilled as desired.\nAssisting in governing the sovereign’s virtue,\nProclaiming the orthodox Dao—\nAs decreed by the Sovereign Master of File-Chang,\nThe Golden Pattern of Purple Yang,\nThe order is proclaimed and obeyed.\"*\n\nThe disciple, **[Name]**, today with sincere devotion,\nHumbly prostrates before the Master of the Dao,\nThe Celestial Teacher, the Great True Person,\nReceiving the Supreme Scriptures and talismans,\nDevoted in body and spirit.\nAfter receiving the talismans,\nDaring not to slacken in diligence or betray sacred texts,\nAs sworn in the Celestial Precepts—\nIn accordance with the Highest Dao’s laws,\nAs recorded in the *Great Cavern File-Chang Bureau’s Register of Merit and Fortune*,\nThe *Purple Yang Golden Talisman Scroll*,\nNow complete.",
      "overlap_context": "Nine Heavens open cultivation—\nThe File-Chang’s vast transformation.\nQi circulates universally—\nMysterious creation unfolds.\nTen thousand gods obey—\nTheir splendor soars.\nJade talismans and gold seals—\nBanish the Yellow Plague.\nDevour demons, consume ghosts—\nMonstrous calamities vanish.\nAwe resonates through the cosmos—\nUnshaken through kalpas.\nBy my decree, the Green Laws prevail—\nNo defiance of the oath!\nDivine light shall manifest instantly!\"*\n\n**One Hundred Twenty Rectifying Clerks** ascend.",
      "start_char": 7772,
      "end_char": 8189,
      "start_sentence": 335,
      "end_sentence": 354,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 8.241880655288696,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\高上大洞文昌司禄紫阳宝箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "高上大洞文昌司禄紫阳宝箓卷下 据某贯居住奉道信士某词称：本命某年月日时建生，上属北斗某星君主照，即日虔诚恭诣度师教主天师大真人门下，拜受《高上大洞文昌司禄紫阳宝箓》一部，皈身佩奉行持，端冀开明真性，通悟本心，弗措於学问辨思，勿非於视听言动，进修德业，超益才华，名成而赞辅皇猷，禄遂则宣明正化，致君於唐虞之上，济民於成康之时，封及祖宗，泽垂后裔，誓勤修奉，永佐升平，如或背盟，一依九天主宰元降律令？ 文昌苍天育神品 应春分四阳之炁",
      "translated_text": "**Highest Supreme Great Cavern File-Chang Bureau’s Purple Yang Sacred Talisman Scroll, Lower Volume**\n\nAccording to the petition of the devout Daoist practitioner **[Name]**, residing in **[Location]**, who states:\n\n*\"By fate, I was born on the **[year]**, **[month]**, **[day]**, **[hour]**, under the governance of the **[specific star]** of the Northern Dipper. Today, with sincere devotion, I humbly prostrate before the Master of the Dao, the Teaching Sovereign, the Celestial Teacher, the Great True Person, receiving the *Highest Supreme Great Cavern File-Chang Bureau’s Purple Yang Sacred Talisman Scroll* in its entirety. With reverence, I accept and uphold it, earnestly aspiring to illuminate my true nature, penetrate my original mind, and not neglect study or reasoning, nor err in sight, hearing, speech, or action. I shall refine my virtue and talents, achieving success to assist the sovereign’s grand purpose, and when fortune is fulfilled, proclaim the orthodox Dao. I shall elevate the ruler above the sage-kings Tang and Yu, and benefit the people as in the reigns of Cheng and Kang. May blessings extend to my ancestors and descend through my lineage. I vow with diligence to uphold this path, eternally aiding the era of peace.*\n\n*Should I betray this oath, I shall abide by the original celestial decrees of the Nine-Heaven Sovereign.*\n\n**File-Chang, the Azure Heaven’s Nurtured Divine Rank**\n*Responding to the qi of the four solar Yang at the Spring Equinox.\"*",
      "overlap_context": "th sincere devotion,\nHumbly prostrates before the Master of the Dao,\nThe Celestial Teacher, the Great True Person,\nReceiving the Supreme Scriptures and talismans,\nDevoted in body and spirit.\nAfter receiving the talismans,\nDaring not to slacken in diligence or betray sacred texts,\nAs sworn in the Celestial Precepts—\nIn accordance with the Highest Dao’s laws,\nAs recorded in the *Great Cavern File-Chang Bureau’s Register of Merit and Fortune*,\nThe *Purple Yang Golden Talisman Scroll*,\nNow complete.",
      "start_char": 8189,
      "end_char": 8412,
      "start_sentence": 355,
      "end_sentence": 358,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 4.7031800746917725,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\高上大洞文昌司禄紫阳宝箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "东方青霄主宰文昌大洞紫阳玉章第一 紫阳开玉笈，元始出金章。 洞辟青华府，昭明太一光。 苍晶回七宿，万炁赞文昌。 颉明颛佐命，通济永无疆。 此玉章，每旦调声正炁诵之九过，生育元神，名登贵品。 东方苍天开化主宰青霄育神功曹一人、吏六人、大洞天驺甲卒兵万人度。 文昌阳天辅文品 应立夏六阳之炁 东南方碧霄主宰文昌大洞紫阳玉章第二 大洞回风振，龙威六气宣。 紫阳敷玉策，定贵下三元。 辟斥阴魔障，开 明正性传。 斯文垂宝运，通济永无愆。 此玉章，每旦平心正炁诵之九过，辅益文学，名进贤科。 东南方阳天开化主宰碧霄辅文功曹一人、吏六人、大洞天驺甲卒兵万人度。 文昌炎天明真品 应夏至一阴之炁 南方丹霄主宰文昌大洞紫阳玉章第三 九华敷妙炁，太一辅丹元。 开化明天斗，灵光灼至贤。 帝心符宝策，神性合龙编。 会集中和景，斯文保大全。 此玉章，每旦颐神调炁诵之九过，开明真性，颖悟良能。 南方炎天开化主宰丹霄明真功曹一人、吏六人、大洞天驺甲卒兵万人度。 文昌朱天通玄品 应立秋三阴之炁",
      "translated_text": "**The Eastern Azure Heaven’s Sovereign, Master of the Orthodox Dao, holds the First Jade Chapter of Azure Heaven’s Nurtured Divine Rank**\n\n*Azure Heaven’s Jade Chapter unfolds,*\n*the Primordial Origin issues the Golden Decree.*\n*The Great Cavern opens the Celestial Palace of Azure Brilliance,*\n*the Radiant One’s light shines upon the Supreme Unity.*\n*The Azure Crystal returns the Seven Mansions,*\n*the myriad *qi* praise the Orthodox Dao of File-Chang.*\n\n*Jie-Ming aids the life of the Preeminent Sovereign,*\n*and his benevolent guidance extends without bound.*\n\nThis Jade Chapter,\neach morning attunes the voice and rectifies the *qi* by reciting the Nine Transgressions,\ngiving birth to the Primordial Spirit,\nand elevating one’s name to the Noble Rank.\n\n**The Eastern Azure Heaven’s Sovereign, Master of the Orthodox Dao, holds the First Jade Chapter of Azure Heaven’s Nurtured Divine Rank**\n*One Officer, Six Clerks,*\n*and ten thousand armored soldiers of the Great Cavern Heaven,*\n*transcending the ranks.*\n\n**File-Chang’s Rank of the Yang Heaven, assisting literary talents**\n*Responding to the *qi* of the six solar Yang at the Summer Solstice.*\n\n**The Southeastern Verdant Heaven’s Sovereign, Master of the Orthodox Dao, holds the Second Jade Chapter of Azure Heaven’s Nurtured Divine Rank**\n\n*The Great Cavern’s wind blows with might,*\n*The Dragon’s威 radiates through the Six *Qi*.*\n*Azure Heaven’s Jade Chapter spreads its divine strategy,*\n*and fixes the Noble Rank beneath the Three Primordial Cycles.*\n\n*It repels the obstructions of the Yin Demons,*\n*and opens the transmission of the Radiant One’s true nature.*\n*This Orthodox Dao preserves the blessings of the age,*\n*and its benevolent guidance extends without fault.*\n\nThis Jade Chapter,\neach morning calms the mind and rectifies the *qi* by reciting the Nine Transgressions,\nassisting and benefiting literary talents,\nand advancing one’s name in the Virtuous and Talented Ranks.\n\n**The Southeastern Verdant Heaven’s Sovereign, Master of the Orthodox Dao, holds the Second Jade Chapter of Azure Heaven’s Nurtured Divine Rank**\n*One Officer, Six Clerks,*\n*and ten thousand armored soldiers of the Great Cavern Heaven,*\n*transcending the ranks.*\n\n**File-Chang’s Rank of the Flaming Heaven, illuminating true talents**\n*Responding to the *qi* of the three Yin at the Autumnal Equinox.*\n\n**The Southern Crimson Heaven’s Sovereign, Master of the Orthodox Dao, holds the Third Jade Chapter of Azure Heaven’s Nurtured Divine Rank**\n\n*The Nine Marvels spread the wondrous *qi*,*\n*The Supreme Unity aids the Crimson Origin.*\n*It opens the luminous Heavenly Dipper,*\n*and the Sacred Light shines upon the Most Virtuous.*\n\n*The Emperor’s heart aligns with the divine strategy,*\n*The Godly Nature harmonizes with the Dragon’s compilation.*\n*Gathering the central concord of the landscape,*\n*This Orthodox Dao preserves the Great Completion.*\n\nThis Jade Chapter,\neach morning nourishes the spirit and attunes the *qi* by reciting the Nine Transgressions,\nilluminating true nature,\nand awakening innate talents.\n\n**The Southern Crimson Heaven’s Sovereign, Master of the Orthodox Dao, holds the Third Jade Chapter of Azure Heaven’s Nurtured Divine Rank**\n*One Officer, Six Clerks,*\n*and ten thousand armored soldiers of the Great Cavern Heaven,*\n*transcending the ranks.*\n\n**File-Chang’s Rank of the Vermilion Heaven, penetrating the Mysterious Dao**\n*Responding to the *qi* of the three Yin at the Autumnal Equinox.*",
      "overlap_context": "I shall elevate the ruler above the sage-kings Tang and Yu, and benefit the people as in the reigns of Cheng and Kang. May blessings extend to my ancestors and descend through my lineage. I vow with diligence to uphold this path, eternally aiding the era of peace.*\n\n*Should I betray this oath, I shall abide by the original celestial decrees of the Nine-Heaven Sovereign.*\n\n**File-Chang, the Azure Heaven’s Nurtured Divine Rank**\n*Responding to the qi of the four solar Yang at the Spring Equinox.\"*",
      "start_char": 8412,
      "end_char": 8876,
      "start_sentence": 359,
      "end_sentence": 386,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 9.323220491409302,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\高上大洞文昌司禄紫阳宝箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "西南方景霄主宰文昌大洞紫阳玉章第四 建辉凝八野，景策辅中皇。 丹田舒灵炁，云华胁智光。 欹卢翦魔力，真宰启天章。 文华资大业，通济永弘昌。 此玉章，每旦调神理炁诵之九过，通彻玄机，神光自生。 西南方朱天开化主宰景霄通玄功曹一人、吏六人、大洞天驺甲卒兵万人度。 文昌昊天人贤品 应秋分四阴之炁 西方玉霄主宰文昌大洞紫阳玉章第五 紫阳敷太昊，华质自资深。 月母生金后，玄天益帝心。 太真歌舞翮，牝牡合重阴。 文道由昌盛，彤芝茂玉林。 此玉章，每旦平心正炁诵之九过，入登贤籍，克悟大道。 西方昊天开化主宰玉霄入贤功曹一人、吏六人、大洞天驺甲卒兵万人度。 文昌幽天立德品 应立冬六阴之炁 西北方太霄主宰文昌大洞紫阳玉章第六 北号名幽幽，文豪枕太霄。 上天开大化，紫极正魁杓。 元父生壬好，文昌发洞谣。 九龙宣贵籍，妙用益玄寥。 此玉章，每旦调神正炁诵之九过，建立德基，才猷超迈。 西北方幽天开化主宰太霄立德功曹一人、吏六人、大洞天驺甲卒兵万人。 文昌玄天应贵品 应冬至一阳之炁 北方紫霄主宰文昌大洞紫阳玉章第七 玄一弘元始，灵通大妙神。 弘文翊昌运，启武镇魔军。 翕合生神秀，英姿与日新。 颛阳参大化，通济辅天人。 此玉章，每旦调声平炁诵之九过，上应贵选，神助文捷。 北方玄天开化主宰紫霄应贵功曹一人、吏六人、大洞天驺甲卒兵万人度。 文昌变天进禄品 应立春三阳之炁 东北方琅霄主宰文昌大洞紫阳玉章第八 变羡昆仑顶，三神覆北酆。 琅霄专主宰，开化翊成功。 大洞阳符质，清生化紫彤。 胶修流梵宝，通济永昌隆。 此玉章，每旦平心理炁诵之九过，进擢禄司，扬名济世。 东北方变天开化主宰琅霄进禄功曹一人、吏六人、大洞天驺甲卒兵万人度。 文昌钧天成功品 应四季二阳五阴、二阴五阳之炁 中央神霄主宰文昌大洞紫阳玉章第九 太极钧天母，中央镇斗枢。 八元生一炁，九道会中书。 应化文华盛，开明帝德余。 斯文新大业，通济利皇居。 此玉章，每旦调声正炁诵之九过，行修功显，万愿克成。 中央钧天开化主宰神霄成功功曹一人、吏六人、大洞天驺甲卒兵万人度。 右大洞文昌紫阳玉章九品，每旦平心定志，调声正炁，稽首恭礼文昌司禄真君几前，各诵九过，自然感彻诸天，当得九霄定贵司禄功曹仙史天驺甲卒下降，翊卫兆身，灭除障碍，进文达德，显名着功，辅佐皇风，宣行大化，一如紫阳律令！ 文昌应寝八图品 虚靖天师曰：此文乃无上天曹文昌司禄真君九天开化主宰，於先劫拜三元太素道君、上元夫人、灵华上宫夫人传授，此箓号《文昌司禄辅文应寝紫阳宝箓》，昔秘於玉清大有金阙玉房之中，紫阳云锦之囊，敕九天储福尊神侍卫，天驺甲卒护箓司命司禄真君，予夺司都天大丞相予司夺，司定贵成功司九霄功曹官吏等，卫护玄文，明取儒士，以应时选，赞翊皇猷，佐运升平，历世宝之。 受此文者，不虚其传，必先形诸寝想，或日见异瑞为征兆，乃受箓之报也，若得寝应，必登贵品矣。 司禄谱云：已上八图寝应，或显见於朕兆间，或示像於寝寝中，皆为奇瑞，必获贵选。 略述十征，以见先兆。 唐德宗时，姚炜乃崇之后，力学能文，壮志未谐。",
      "translated_text": "**The Fourth Jade Chapter of Azure Heaven’s Nurtured Divine Rank,\nSovereign of the Southwest *Jǐngxiāo* Heaven**\n\n*Illuminating radiance condenses the eight wilds,*\n*The divine strategy aids the Central Sovereign.*\n*The elixir field expands luminous *qi*,\n*Clouds and flowers sharpen the light of wisdom.*\n\n*Leaning Lu slays demonic forces,*\n*The True Sovereign awakens Heaven’s Chapter.*\n*Literary splendor aids the Great Endeavor,*\n*Transcending aid forever flourishes.*\n\nThis Jade Chapter,\neach morning attunes mind and *qi* by reciting the Nine Transgressions,\npenetrating profound mysteries,\nas divine light spontaneously arises.\n\n**Sovereign of the Southwest Vermilion Heaven’s Opening Transformation,\nMaster of the *Jǐngxiāo* Penetrating the Mysterious Dao**\n*One Officer, Six Clerks,*\n*and ten thousand armored soldiers of the Great Cavern Heaven,*\n*ascending the ranks.*\n\n**File-Chang’s Crimson Heaven’s Noble Acclaim Rank**\n*Responding to the *qi* of the four Yin at the Autumnal Equinox.*\n\n---\n\n**The Fifth Jade Chapter of Azure Heaven’s Nurtured Divine Rank,\nSovereign of the Western *Yùxiāo* Heaven**\n\n*Purple Yang nourishes the Great Dawn,*\n*Refined essence deepens naturally.*\n*The Moon Mother births the Golden Son,*\n*The Mysterious Heaven enriches the Emperor’s heart.*\n\n*The Supreme True dances with wings unfurled,*\n*Yin and Yang unite in dual harmony.*\n*Literary Dao flourishes eternally,*\n*Crimson reishi thrives in the Jade Forest.*\n\nThis Jade Chapter,\neach morning steadies the heart and rectifies the *qi* by reciting the Nine Transgressions,\nentering the register of the worthy,\nand awakening to the Great Dao.\n\n**Sovereign of the Western Dawn Heaven’s Opening Transformation,\nMaster of the *Yùxiāo* Entering the Worthy Rank**\n*One Officer, Six Clerks,*\n*and ten thousand armored soldiers of the Great Cavern Heaven,*\n*ascending the ranks.*\n\n**File-Chang’s Gloomy Heaven’s Virtue Rank**\n*Responding to the *qi* of the six Yin at the Winter Solstice.*\n\n---\n\n**The Sixth Jade Chapter of Azure Heaven’s Nurtured Divine Rank,\nSovereign of the Northwest *Tàixiāo* Heaven**\n\n*The North is named profound and boundless,*\n*Literary grandeur rests beneath the Great Dawn.*\n*The Heavenly opens the Great Transformation,*\n*Purple Extremity aligns with the Dipper’s handle.*\n\n*The Primordial Father begets the Ninth Stem,*\n*File-Chang issues the Cavern’s hymns.*\n*The Nine Dragons proclaim the noble register,*\n*Wondrous use benefits the Mysterious Void.*\n\nThis Jade Chapter,\neach morning attunes mind and rectifies the *qi* by reciting the Nine Transgressions,\nestablishing the foundation of virtue,\nand talents soar beyond measure.\n\n**Sovereign of the Northwest Gloomy Heaven’s Opening Transformation,\nMaster of the *Tàixiāo* Virtue Rank**\n*One Officer, Six Clerks,*\n*and ten thousand armored soldiers of the Great Cavern Heaven.*\n\n**File-Chang’s Mysterious Heaven’s Noble Acclaim Rank**\n*Responding to the *qi* of one Yang at the Winter Solstice.*\n\n---\n\n**The Seventh Jade Chapter of Azure Heaven’s Nurtured Divine Rank,\nSovereign of the Northern *Zǐxiāo* Heaven**\n\n*The Primordial One expands the Origin,*\n*Divine communication reveals the wondrous spirit.*\n*Literary splendor aids the flourishing of File-Chang,*\n*Martial might subdues the demonic host.*\n\n*Converging gives birth to divine excellence,*\n*Heroic bearing renews with the sun.*\n*Preeminent Yang participates in the Great Transformation,*\n*Transcending aid supports Heaven and humanity.*\n\nThis Jade Chapter,\neach morning harmonizes voice and rectifies the *qi* by reciting the Nine Transgressions,\nascending to noble selection,\nas divine aid accelerates literary success.\n\n**Sovereign of the Northern Mysterious Heaven’s Opening Transformation,\nMaster of the *Zǐxiāo* Noble Acclaim Rank**\n*One Officer, Six Clerks,*\n*and ten thousand armored soldiers of the Great Cavern Heaven,*\n*ascending the ranks.*\n\n**File-Chang’s Changing Heaven’s Success Rank**\n*Responding to the *qi* of three Yang at the Spring Equinox.*\n\n---\n\n**The Eighth Jade Chapter of Azure Heaven’s Nurtured Divine Rank,\nSovereign of the Northeast *Lángxiāo* Heaven**\n\n*Changing envies Kunlun’s peak,*\n*Three gods shelter the Northern Mound.*\n*The *Lángxiāo* specializes in sovereignty,*\n*Opening Transformation aids successful endeavors.*\n\n*The Great Cavern’s Yang symbol is pure,*\n*Clear essence transforms into crimson and purple.*\n*Adhesive refinement flows as the Precious Dao,*\n*Transcending aid forever flourishes.*\n\nThis Jade Chapter,\neach morning steadies the heart and attunes the *qi* by reciting the Nine Transgressions,\nadvancing to the Bureau of Merit,\nand fame aids the world.\n\n**Sovereign of the Northeast Changing Heaven’s Opening Transformation,\nMaster of the *Lángxiāo* Success Rank**\n*One Officer, Six Clerks,*\n*and ten thousand armored soldiers of the Great Cavern Heaven,*\n*ascending the ranks.*\n\n**File-Chang’s Pinion Heaven’s Success Rank**\n*Responding to the *qi* of two Yang and five Yin, two Yin and five Yang in the seasons.*\n\n---\n\n**The Ninth Jade Chapter of Azure Heaven’s Nurtured Divine Rank,\nSovereign of the Central *Shénxiāo* Heaven**\n\n*The Supreme Ultimate balances the Pinion Mother,*\n*The Central governs the Dipper’s pivot.*\n*The Eight Primordials generate one *qi*,\n*The Nine Paths converge in the Central Register.*\n\n*Responding Transformation enriches literary splendor,*\n*Illuminating the Emperor’s virtue remains.*\n*This culture renews the Great Endeavor,*\n*Transcending aid benefits the Imperial Residence.*\n\nThis Jade Chapter,\neach morning harmonizes voice and rectifies the *qi* by reciting the Nine Transgressions,\nas virtuous deeds manifest,\nand ten thousand wishes are fulfilled.\n\n**Sovereign of the Central Pinion Heaven’s Opening Transformation,\nMaster of the *Shénxiāo* Success Rank**\n*One Officer, Six Clerks,*\n*and ten thousand armored soldiers of the Great Cavern Heaven,*\n*ascending the ranks.*\n\n---\n**The Nine Ranks of the Great Cavern File-Chang Azure Heaven Jade Chapters**\nEach morning, steady the heart and resolve,\nharmonize voice and rectify the *qi*,\nand with utmost reverence, bow and pay homage before the File-Chang Bureau of Merit True Lord’s seat.\nRecite the Nine Transgressions,\nand naturally the Nine Heavens will respond,\nbestowing the Nine Heavens’ Noble Acclaim Bureau of Merit, celestial scribes, and armored soldiers below,\nto guard the auspicious body,\neliminate obstacles,\nadvance literary merit,\nmanifest noble deeds,\nassist the Imperial Way,\nand propagate the Great Transformation—\njust as the Purple Yang decrees!\n\n**File-Chang’s Chamber Response Eight Diagrams Rank**\n\nThe *Xūjìng* Heavenly Master said:\nThis text is the supreme celestial bureau’s File-Chang Bureau of Merit True Lord’s Nine Heavens Opening Transformation Sovereign,\ntransmitted in a prior kalpa to the Three Primordials, the Supreme Substance Dao Lord, the Upper Primordial Lady, and the Soul Flower Upper Palace Lady.\nThis talisman, formerly sealed within the Jade Purity Great Possession’s Golden Gate and Jade Chamber,\nwas entrusted to the Nine Heavens’ Treasure Fortune Venerable Gods for protection,\nwith celestial armored soldiers guarding the talisman and the Life-Span and Merit True Lords.\nThe Bureau of Merit’s Grand Chancellor oversees bestowal and revocation,\nthe Bureau of Noble Acclaim and Success oversees the Nine Heavens’ officials and clerks,\nprotecting the Mysterious Texts,\nselecting scholars,\nand responding to timely examinations.\nThey assist the Imperial Plan,\naid the flourishing of peace,\nand are treasured through the ages.\n\nThose who receive this text must not falsify its transmission.\nFirst, manifest it in chamber meditation,\nor witness strange omens by day as a sign of receipt.\nIf chamber response is attained,\none shall surely ascend to noble rank.\n\nThe Bureau of Merit Register states:\nThe above eight chamber responses,\nwhether manifested in imperial omens or shown in dreams,\nare all auspicious signs,\nand one shall surely gain noble selection.\n\nBriefly enumerating ten omens to reveal the foreshadowing:\nDuring the reign of Emperor Dezong of Tang,\nYao Wei, a descendant of Yao Chong,\ndiligent in studies and skilled in literature,\nthough his lofty ambitions were unfulfilled...",
      "overlap_context": "i* by reciting the Nine Transgressions,\nilluminating true nature,\nand awakening innate talents.\n\n**The Southern Crimson Heaven’s Sovereign, Master of the Orthodox Dao, holds the Third Jade Chapter of Azure Heaven’s Nurtured Divine Rank**\n*One Officer, Six Clerks,*\n*and ten thousand armored soldiers of the Great Cavern Heaven,*\n*transcending the ranks.*\n\n**File-Chang’s Rank of the Vermilion Heaven, penetrating the Mysterious Dao**\n*Responding to the *qi* of the three Yin at the Autumnal Equinox.*",
      "start_char": 8876,
      "end_char": 10195,
      "start_sentence": 387,
      "end_sentence": 445,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 21.110559225082397,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\高上大洞文昌司禄紫阳宝箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "一日得遇方士贺达，即知章之玄孙也，授以斯箓。 未授间，炜寝枕中有白猫，及授箓开阅，果有玉猫应之征，是年登第，后至侍从。 蜀广政中，绵州高庆孙，寝乘牛扣角，因与玉局观道士胡道远语及此寝，道远贺曰：君今年必中解科，盖刀牛者解字也，寝此为瑞。 果如其言，遂中高选。 唐昭宗时，士人朱涣者，文学俊秀，受此箓於宗人朱道元，寝斩五虎，次年登第，官至清近。 宋太宗景德中，周良辅受此箓於莱州道士刘若拙，寝逐群鹿，为鹿所践，毙路中，寝惊，其年登科，官至帅臣。 神宗时，眉州苏轼，得此箓於乡东墓颐山处士黄若水，其父洵，寝见书笋中有大鬼头，惊而觉，其年轼兄弟俱登科名。 苏轼之次子迨，一夕寝击三人立死，以为不祥，语其兄迈，迈贺曰：奉庆三元之选，必吾弟也，果如其言。 洪州黄庶字亚夫，寝黑犬护其足，盖庶受此箓於齐先生坐下，以为吉兆，当年登第，官至太中大夫、大理寺丞。 晁公武，字子正，上元夜寝击死同斋三士人，被官吏缚之有司，及至狱，见其兄公愬字子西，已先缚在狱，惊觉而不言。 因到利州宝峰遇鲁道士，遂出示此箓，览至应寝图，有怒击三人应之征，遂设醮受此箓，后伯仲果中高第。 庞武太师，未遇时，游洛西凤林庵，有道士蒙吉者与之饮，是夕酒酣，宿於庵中，寝为白马所啮，甚痛，及觉，以语吉。 吉曰：公得八图之应，乃出此箓示之，就以传授，其年登科，不十五年，官至执政，父子皆为太师。 建炎末，邛州刘浩然，少读书谋进取，寝司禄真君授以文昌之箓，既觉，录以记之，遂诣龙虎山拜谒於三十代天师，求受此箓，天师取以示之，天师曰：此箓非子成名，子当传之，度及三贵，受讫不能详其言。 绍兴中，浩然行三洞法箓，符药灵显，能出神拜章，逆知人未来休咎，为当时士贵所称。 隆州虞允文字彬父，闻其名而扣之，浩然谓允文曰：君中年荣贵，必至执政，可以受箓，扶文进业，允文曰：何箓可受？ 浩然乃以此箓授之。 后一年，允文在跨鳖斋中，寝击三人卒而流汗，及披箓中，见有此征，次年果策名在三元之魁，后为宰相。 凡贤士名儒受箓之前，先得寝征，便当拜师求受此箓，则以迎合天意，必获功名之报。 若犹豫生疑，不能信奉，则予夺司之神，伐人之灵鉴，削人寿禄，终无成也。 若受箓之后，有此寝征，皆当成名，寝应於受箓之前为上寝，应於受箓之后者次之。 若敬奉此箓，则辅文进业，生九道文昌之炁，使宿昔冤讼自雪，祖宗殃注不胤，神不能夺其鉴，魔不能障其才，猷命运之，凶躔不能加既，恶煞不能肆其威，定志开心，有神益慧，科名显达，禄及子孙。 若轻慢灵文，妄示非人，则三官鼓笔，罪报不轻。 高上大洞文昌司禄紫阳宝箓卷下竟 请箓法词 高上大洞文昌司禄紫阳宝箓法词 维某年月日，具乡贯居住奉道弟子某人本命某年月日时建生，上属北斗某星君主照，即日虔诚恭诣度师教主天师大真人门下，拜受《高上大洞文昌司禄紫阳宝箓》一部，敬奉修行。 伏以玉篆琼书，实胚胎於太极，金台桂籍、悉隶属於文昌。 蕴妙凝玄，含精毓秀，故造化生成，默而有应，於阴阳消长，合以无为，自流形符张翼之精，累弘教翊君臣之道，由是功高金阙，司禄籍於天曹，贵掌瑶图，示铨衡於人爵，昭垂妙范，统制文纲，黜陟无私，古今有赖。",
      "translated_text": "On one day, he encountered the Daoist **Heda (賀達)**, who immediately recognized him as **Zhang’s (章)** distant descendant and bestowed this **fajia (箓)** upon him.\n\nBefore receiving it, **Yao Wei (姚炜)** dreamed of a white cat beside his pillow. When he opened the **fajia** after receiving it, a jade cat’s omen indeed appeared as a sign of confirmation. That very year, he passed the imperial examinations and later served in the **sifu (侍从)** ranks.\n\nDuring the **Shu (蜀)** reign of **Emperor Guangzheng (廣政)**, **Gao Qing’s (高慶孙)** grandson dreamed of riding a cow that struck its horns against the frame. When he spoke of this dream to the Daoist **Hudao Yuan (胡道遠)**, the latter rejoiced and said, *“This year, you shall surely pass the **jieke (解科)** examination—‘jie’ (解) is the cow’s horn, and this is an auspicious omen.”* True to his words, **Gao Qing’s** grandson was then selected for high office.\n\nIn the **Tang (唐)** reign of **Emperor Zhaozong (昭宗)**, the scholar **Zhu Han (朱涣)** was renowned for his literary brilliance. He received this **fajia** from **Zhu Daoyuan (朱道元)**, a kinsman of the imperial house, and dreamed of decapitating five tigers. The following year, he passed the examinations and rose to the rank of **Qingjin (清近)**.\n\nDuring the **Song (宋)** reign of **Emperor Taizong (太宗)**, in the **Jingde (景德)** era, **Zhou Liangfu (周良辅)** received this **fajia** from the Daoist **Liu Ruozhuo (劉若拙)** of **Laizhou (萊州)**. He dreamed of being trampled by a herd of deer, dying by the roadside, and awoke in terror. That very year, he passed the examinations and later became a **shuishen (帅臣)**.\n\nIn the **Song (宋)** reign of **Emperor Shenzong (神宗)**, **Su Shi (蘇軾)** of **Mizhou (眉州)** obtained this **fajia** from the recluse **Huang Ruoshui (黃若水)** at the **Yi Mountain (颐山)** tombs in his eastern village. His father, **Su Xun (蘇洵)**, dreamed of a large ghostly head emerging from a bamboo shoot, awoke in shock, and that year, **Su Shi’s (蘇軾)** brothers both achieved scholarly distinction.\n\n**Su Shi’s (蘇軾)** younger son, **Su Qie (蘇迨)**, one night dreamed of striking three men dead. Taking this as an omen of ill fortune, he spoke of it to his elder brother, **Su Mai (蘇迈)**. **Su Mai (蘇迈)** rejoiced and said, *“This is the **San Yuan (三元)** selection—it must be you, my younger brother.”* His words proved true.\n\n**Huang Shu (黃庶)**, styled **Yafa (亞夫)**, of **Hongzhou (洪州)**, dreamed of a black dog protecting his feet. He had received this **fajia** from **Qi Master (齐先生)**’s disciples and took this as a fortunate sign. That year, he passed the examinations and attained the rank of **Taizhong Daifu (太中大夫)** and **Da Li Si Cheng (大理寺丞)**.\n\n**Chao Gongwu (晁公武)**, styled **Zizheng (子正)**, on the night of **Shangyuan (上元)**, dreamed of striking three men dead in his study. He was bound by officials and brought before the authorities. Upon reaching prison, he saw his elder brother, **Chao Gongqu (晁公愬)**, styled **Zixi (子西)**, already bound and awaiting him. Startled and awoken, he said nothing. Later, when he visited **Baofeng (宝峰)** in **Lizhou (利州)**, he encountered a Daoist **Lu (鲁)**, who then showed him this **fajia**. Upon reaching the section on **chamber omens (寝应)**, he saw the omen of striking three men dead, and he performed a **jiao (醮)** to receive this **fajia**. Afterwards, his elder and younger brothers both passed the examinations with distinction.\n\n**Pang Wu (庞武)**, the **Taishi (太师)**, before attaining prominence, wandered to **Fenglin (凤林)** in **Luoxi (洛西)**. A Daoist named **Meng Ji (蒙吉)** shared a drink with him, and that evening, after the wine had flowed freely, **Pang Wu (庞武)** stayed at the **Fenglin (凤林)** abode. He dreamed of being bitten by a white horse, which caused him great pain. When he awoke, he told **Meng Ji (蒙吉)** of the dream.\n\n**Meng Ji (蒙吉)** said, *“You have received the **Eight Chamber Omens (八图)**—here is the **fajia** to confirm it. Accept it now.”* That year, **Pang Wu (庞武)** passed the examinations. Within fifteen years, he became a **zhizheng (执政)**, and both he and his son were appointed **Taishi (太师)**.\n\nToward the end of the **Jianyan (建炎)** era, **Liu Haoran (刘浩然)** of **Qiongzhou (邛州)**, from his youth studied diligently to seek advancement. He dreamed of **Sifu Zhenjun (司禄真君)** bestowing upon him the **Wenchang fajia (文昌箓)**. Upon waking, he recorded the dream and then journeyed to **Longhu Mountain (龙虎山)** to pay homage to the **Thirty-First Generation Tian Shi (天师)**, seeking to receive this **fajia**. The **Tian Shi (天师)** took it out and showed it to him, saying, *“This **fajia** is not meant for your advancement. You should pass it on, transmitting it to three nobles.”* Though he did not fully understand these words, he accepted the **fajia** and later practiced the **San Dong fajia (三洞法箓)**.\n\nDuring the **Shaoxing (绍兴)** era, **Liu Haoran (刘浩然)**’s **fajia** and talismans displayed miraculous efficacy. He could summon spirits to worship **Zhang (章)**, foreknow the future fortunes of others, and was highly regarded by the scholars and nobles of the time. **Yu Runwen (虞允文)**, a man of elegant letters from **Lungzhou (隆州)**, heard of his name and knocked on his door. **Liu Haoran (刘浩然)** told **Yu Runwen (虞允文)**, *“You shall gain midlife honor and rise to **zhizheng (执政)**. You can receive this **fajia** and I will aid your literary pursuits.”* **Yu Runwen (虞允文)** asked, *“What **fajia** can I receive?”* **Liu Haoran (刘浩然)** then bestowed this **fajia** upon him.\n\nThe following year, **Yu Runwen (虞允文)** dreamed of striking three men dead in the **Kua Bie (跨鳖)** study, and awoke sweating profusely. When he opened the **fajia**, he saw this very omen. The next year, he achieved the highest rank in the **San Yuan (三元)** examinations, and later became **Chancellor (宰相)**.\n\nIn all cases, virtuous scholars and eminent Confucian literati who receive the **fajia** beforehand must first manifest the **chamber omens (寝征)**. Then, they should seek a master to receive this **fajia**, aligning themselves with the **Heavenly Will (天意)**. Only then shall they surely reap the rewards of **scholarly success (功名)**.\n\nIf they hesitate and doubt, unable to faithfully accept it, then **Sifu Zhenjun (司禄真君)** shall withdraw their divine guidance, **the spirits shall obscure their judgment (灵鉴)**, and their **lifespan and fortune (寿禄)** shall be diminished, leaving them without achievement.\n\nIf the **chamber omens (寝征)** appear after receiving the **fajia**, they shall still achieve distinction. Omens that appear before receiving the **fajia** are the **superior chamber omens (上寝)**; those that appear after are secondary.\n\nIf one reverently upholds this **fajia**, it shall aid their literary pursuits, generate the **nine Dao (九道)** and **Wenchang qi (文昌之炁)**, clear past grievances, and prevent ancestral misfortunes from lingering. The spirits cannot take away their discernment, nor can demons obstruct their talent. It shall guide their **fate and destiny (命运)**, and even malevolent stars or **evil spirits (恶煞)** cannot harm them. With steadfast resolve and an open heart, divine wisdom shall sharpen their intellect, their scholarly achievements shall flourish, and their fortunes shall extend to their descendants.\n\nIf one treats this **sacred text (灵文)** lightly, or falsely claims it from others, then the **Three Officials (三官)** shall strike with their **gubiao (鼓笔)**, and the punishment shall not be slight.\n\n**End of the *Highest Daoist Cavern of Wenchang, Sifu Zhenjun, Ziyang Precious Fajia (高上大洞文昌司禄紫阳宝箓)* scroll.**\n\n**Request for Fajia Ritual Words**\n**Highest Daoist Cavern of Wenchang, Sifu Zhenjun, Ziyang Precious Fajia Ritual Words**\n\nOn the day of the **month, year, and time** of **certain year, month, and day**, the Daoist disciple **Certain Person (某人)**, born under the **Northern Dipper (北斗)** star **Certain Star (某星)** and originally from **Certain County (某乡)** and **Certain Prefecture (某贯)**, residing in **Certain Place (某居住)**, humbly and sincerely prostrates before the **Dushi (度师)**, **Jiaozhu (教主)**, and **Tian Shi (天师)**, the **Great True Person (大真人)**, to receive a copy of the **Highest Daoist Cavern of Wenchang, Sifu Zhenjun, Ziyang Precious Fajia (高上大洞文昌司禄紫阳宝箓)**** and uphold it in practice.\n\nI humbly acknowledge that the **jade seals and jade scriptures (玉篆琼书)**** are indeed the embryonic essence of the **Taiji (太极)**. The **golden platform and laurel registers (金台桂籍)**** are all under the command of **Wenchang (文昌)**.\n\nThey contain profound mysteries and condensed Daoist essences, holding within them the **refined essence and nurtured brilliance (精毓秀)****. Thus, the **creative transformation (造化)**** unfolds silently with its responses. In the interplay of **yin and yang (阴阳)**** and the waxing and waning of **xiang (消)**** and **zhang (长)****,** the **fajia**** resonates with the **principle of non-action (无为)****. It naturally manifests the **patterns of divine efficacy (符张翼之精)****, perpetuating the **Daoist teachings that assist ruler and subjects (教翊君臣之道)****.\n\nBy this means, their merit surpasses the **golden gates (金阙)****, overseeing the **laurel registers (禄籍)**** in the **Heavenly Court (天曹)****. Their noble station governs the **jade charts (瑶图)****, demonstrating the **imperial selection (铨衡)**** in human ranks. They reveal the **wonderful standards (妙范)****, regulate the **literary edicts (文纲)****, and promote or demote without bias. This is the reliance of **ancient and modern (古今)****.",
      "overlap_context": "hamber response is attained,\none shall surely ascend to noble rank.\n\nThe Bureau of Merit Register states:\nThe above eight chamber responses,\nwhether manifested in imperial omens or shown in dreams,\nare all auspicious signs,\nand one shall surely gain noble selection.\n\nBriefly enumerating ten omens to reveal the foreshadowing:\nDuring the reign of Emperor Dezong of Tang,\nYao Wei, a descendant of Yao Chong,\ndiligent in studies and skilled in literature,\nthough his lofty ambitions were unfulfilled...",
      "start_char": 10195,
      "end_char": 11492,
      "start_sentence": 446,
      "end_sentence": 474,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 32.29838418960571,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\高上大洞文昌司禄紫阳宝箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "伏念某生逢昭代，际遇真风，稽首投诚，愿佩九天之秘典，进文益智，冀通一贯之微言，志早遂於青云，盟有同於白日，仰希付度，俯谨修崇，某下情无任恳祷之至，谨词。 天师门下据弟子某赍持质信诣道自陈，求受《高上大洞文昌司禄紫阳宝箓》一部，终身敬奉，及请真师宝讳符图经诀，依按修行，即日告盟天地，立誓三官，破券分环，依科传授，给付如后： 箓一部上中下三卷 九天开化品，天演谱系品，储佐列神品，天章玉文品，中皇生炁品，定志益慧品，简阅宝图品，司禄玉符品，定贵金简品，进贤玉策品，消魔金篆品，元纲演化品，东壁璇玑品，宫曹骑卫品，苍天育神品，阳天辅文品，炎天明真品，朱天通玄品，昊天入贤品，幽天立德品，玄天应贵品，变天进禄品，钧天成功品，应寝八图品。 仪式 盟真合同环券一封。",
      "translated_text": "At this juncture, I humbly reflect that this humble servant was born in an age of radiant virtue, encountering the true winds of the Dao. With deepest reverence, I submit my allegiance, desiring to wear the sacred scriptures of the Nine Heavens, thereby enhancing my wisdom and knowledge. I earnestly hope to comprehend the subtle teachings of the unified Dao, that my aspirations may soon be fulfilled in the Azure Clouds, and my oaths may be as steadfast as the White Sun.\n\nWith lofty aspirations, I seek instruction from above, and with utmost humility, I vow to practice and uphold them. My heartfelt gratitude knows no bounds, and I now present my words.\n\nTo the Celestial Master’s discipleship, I, the disciple [name], bring my earnest offerings and sincere devotion, humbly seeking to receive one copy of the *Highest Supreme Great Cavern Literary Glory and Jade Court Sacred Registers* (《高上大洞文昌司禄紫阳宝箓》), which I shall venerate for life. Additionally, I request the Celestial Master’s sacred name, talismans, diagrams, and esoteric methods, following the prescribed rituals for my practice.\n\nOn this very day, I solemnly pledge my oath to Heaven and Earth, swear before the Three Officials, and break the seal of my former vows to sever past ties. In accordance with the established rites, I now receive the transmission as follows:\n\n**Registers (箓) in three volumes (上中下三卷):**\n*Nine Heavens Opening and Transformation* (九天开化品),\n*Heavenly Evolution and Genealogy* (天演谱系品),\n*Divine Auxiliaries and Listed Gods* (储佐列神品),\n*Heavenly Talismans and Jade Scriptures* (天章玉文品),\n*Central Sovereign’s Birth of Qi* (中皇生炁品),\n*Stabilizing Aspirations and Enhancing Wisdom* (定志益慧品),\n*Reviewing Sacred Diagrams* (简阅宝图品),\n*Jade Talismans of Literary Glory* (司禄玉符品),\n*Golden Seals of Fixed Nobility* (定贵金简品),\n*Jade Strategies for Advancing Virtue* (进贤玉策品),\n*Golden Talismans for Dispelling Demons* (消魔金篆品),\n*Fundamental Principles of Transformation* (元纲演化品),\n*Eastern Wall’s Celestial Spheres* (东壁璇玑品),\n*Palace Officials and Mounted Guards* (宫曹骑卫品),\n*Azure Sky’s Nurturing of Gods* (苍天育神品),\n*Yang Heaven’s Assistance to Literature* (阳天辅文品),\n*Flame Heaven’s Illumination of Truth* (炎天明真品),\n*Vermilion Heaven’s Penetration of Mysteries* (朱天通玄品),\n*Exalted Heaven’s Entry into Virtue* (昊天入贤品),\n*Dark Heaven’s Establishment of Virtue* (幽天立德品),\n*Mysterious Heaven’s Response to Nobility* (玄天应贵品),\n*Changing Heaven’s Advancement of Fortune* (变天进禄品),\n*Hooked Heaven’s Achievement of Success* (钧天成功品),\n*Responsive Heaven’s Eight Sacred Diagrams* (应寝八图品).\n\n**Rituals (仪式):**\nA sealed oath of unity and shared devotion with the True One (盟真合同环券一封).",
      "overlap_context": "t teachings that assist ruler and subjects (教翊君臣之道)****.\n\nBy this means, their merit surpasses the **golden gates (金阙)****, overseeing the **laurel registers (禄籍)**** in the **Heavenly Court (天曹)****. Their noble station governs the **jade charts (瑶图)****, demonstrating the **imperial selection (铨衡)**** in human ranks. They reveal the **wonderful standards (妙范)****, regulate the **literary edicts (文纲)****, and promote or demote without bias. This is the reliance of **ancient and modern (古今)****.",
      "start_char": 11492,
      "end_char": 11827,
      "start_sentence": 475,
      "end_sentence": 480,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 9.442419052124023,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\高上大洞文昌司禄紫阳宝箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "正一修真旨要节目。 祖玄真三师宝号 祖师九天开化主宰慈应大帝大慈更生永命天尊。 玄师天府掌水陆都转运使总桂禄二籍孚泽大帝。 真师大成至圣文宣王文昌皇人九天玄圣道君。 经籍度三师法讳 经师上清三洞经箓南曹真士玉府上卿都天大法主嗣汉四十二代天师张正常。 籍师上清三洞经箓太极执法真宰灵宝领教真人都天大法主嗣汉四十三代天师张宇初。 度师上清三洞宝箓灵宝领教玄化真人南曹执法仙宰都天大法主嗣教四十四代天师张宇清。 临坛师法名 监　　度　　师， 保　　举　　师， 证　　盟　　师，",
      "translated_text": "**Daoist Rituals (正一修真旨要节目):**\nThe Sacred Essentials of Rectified Daoist Cultivation and Ritual Practice (正一修真旨要节目).\n\n**The Three Celestial Masters of the Rectified Dao (祖玄真三师宝号):**\nThe Celestial Master of the Nine Heavens, the Revered Sovereign of Opening and Governing (祖师九天开化主宰慈应大帝大慈更生永命天尊),\nThe Great Emperor of Profound Benevolence and Abundant Grace (祖师九天开化主宰慈应大帝大慈更生永命天尊).\nThe Grand Master of the Celestial Treasury, the Total Administrator of Land and Water Circulation and Bestower of Auspicious Grace (玄师天府掌水陆都转运使总桂禄二籍孚泽大帝).\nThe Supreme Emperor of Great Achievement and Sacred Literature, the Nine-Heaven Celestial Master of the Dao (真师大成至圣文宣王文昌皇人九天玄圣道君).\n\n**The Three Sacred Titles of the Scriptures and Ordinances (经籍度三师法讳):**\nThe Scripture Master of the Three Upper Purity Caverns (经师上清三洞经箓), the Celestial Officer of the Jade Treasury, the Grand Marshal of the Dao (都天大法主), the Fourth-Twenty-Second Celestial Master of the Han Lineage (嗣汉四十二代天师), Zhang Zhengchang (张正常).\nThe Ordinance Master of the Three Upper Purity Caverns (籍师上清三洞经箓), the Grand Marshal of the Dao who Upholds the Supreme Ultimate (太极执法真宰), the Celestial Officer of the Lingbao Scripture (灵宝领教真人都天大法主), the Forty-Third Celestial Master of the Han Lineage (嗣汉四十三代天师), Zhang Yuchu (张宇初).\nThe Ritual Master of the Three Upper Purity Caverns (度师上清三洞宝箓), the Celestial Officer of the Lingbao Scripture who Leads the Mysterious Transformation (灵宝领教玄化真人), the Ritual Officer of the Dao (南曹执法仙宰), the Celestial Officer of the Dao (都天大法主), the Forty-Fourth Celestial Master of the Han Lineage (嗣教四十四代天师), Zhang Yucheng (张宇清).\n\n**Names of the Masters at the Ritual Altar (临坛师法名):**\nSupervisor of the Dao (监　　度　　师),\nGuardian of Auspiciousness (保　　举　　师),\nAttestant of the Sacred Covenant (证　　盟　　师).",
      "overlap_context": "品),\n*Flame Heaven’s Illumination of Truth* (炎天明真品),\n*Vermilion Heaven’s Penetration of Mysteries* (朱天通玄品),\n*Exalted Heaven’s Entry into Virtue* (昊天入贤品),\n*Dark Heaven’s Establishment of Virtue* (幽天立德品),\n*Mysterious Heaven’s Response to Nobility* (玄天应贵品),\n*Changing Heaven’s Advancement of Fortune* (变天进禄品),\n*Hooked Heaven’s Achievement of Success* (钧天成功品),\n*Responsive Heaven’s Eight Sacred Diagrams* (应寝八图品).\n\n**Rituals (仪式):**\nA sealed oath of unity and shared devotion with the True One (盟真合同环券一封).",
      "start_char": 11828,
      "end_char": 12090,
      "start_sentence": 481,
      "end_sentence": 493,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 7.8472278118133545,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\高上大洞文昌司禄紫阳宝箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "右伏以文昌秘典，掌九天司禄之铨衡，大洞灵章，阐七曲真仙之治化，云篆五文而开廓，金书八角以垂芒，昭昭乎帝御所临，洋洋乎神明如在，修之则贯通至理，悟之则超契玄微。 惟以进文业於身，惟以显功名於世，称扬莫尽，蕴奥难名。 某诚意正心，修身谨行，遵承圣训，未能寡过而寡尤，皈奉真宗，曷悟常清而常静。 伏愿禄登桂籍，名上蕊宫，一念通真，彻明经之旨趣，三元定贵，列上品之科名。 恪谨盟言，永为身宝，倘违初志，甘伏宪章。 高上大洞文昌司禄紫阳宝箓法词竟",
      "translated_text": "The **Secret Canon of Wenchang** (rightfully invoked) governs the **Nine Heavens’ Bureau of Rewards** (文昌秘典，掌九天司禄) with its **Grand Sieve of Merit** (之铨衡), its **Sacred Scriptures of the Great Caverns** (大洞灵章) elucidating the **Sevenfold Mysterious Transformation** (七曲) of the **True Immortals** (真仙之治化). With **Five Cloud-Signatures** (云篆五文) it unfolds the **Celestial Mandate’s Boundaries** (而开廓), and with **Eight-Angled Golden Scriptures** (金书八角) it extends the **Divine Radiance** (以垂芒). Resplendent is the **Celestial Sovereign’s Presence** (帝御所临), vast as the **Manifested Deity’s Essence** (神明如在). Cultivate it, and the **Ultimate Principles** (至理) shall be penetrated; comprehend it, and the **Profound Mysteries** (玄微) shall be transcended.\n\nOnly through **advancing one’s literary merit** (进文业於身) does one fulfill the **Dao’s Virtue** (至理), and only through **manifesting one’s deeds and name** (显功名於世) does one attain worldly glory. Its praise is boundless, its profundity unnameable. I sincerely align my intentions with rectitude, refine my conduct with caution, and follow the **Sacred Teachings** (圣训). Though I have not yet attained **few faults and few censures** (寡过而寡尤), I have devoted myself to the **True Lineage** (真宗), yet I remain unaware of the **constant purity and stillness** (常清而常静).\n\nI humbly pray that my **rewards ascend to the Guì Jié** (桂籍), my **name be inscribed in the Ruǐ Gōng** (蕊宫), and that my **single thought harmonize with the True** (通真). May I **penetrate the intent of the Scripture** (彻明经之旨趣), and in the **Three Celestial Cycles** (三元) be **fixed in noble status** (定贵), ranking among the **Highest Echelon** (上品) in the **Celestial Merit System** (科名).\n\nWith solemn reverence, I **pledge the Sacred Covenant** (恪谨盟言), eternally treasuring it as my **personal virtue** (身宝). Should I betray my original resolve, I shall **willingly submit to the Sacred Ordinances** (甘伏宪章).\n\n**Concluding the Sacred Ritual Words of the Great Caverns’ Wenchang Bureau of Rewards** (高上大洞文昌司禄紫阳宝箓法词竟).",
      "overlap_context": "The Ritual Master of the Three Upper Purity Caverns (度师上清三洞宝箓), the Celestial Officer of the Lingbao Scripture who Leads the Mysterious Transformation (灵宝领教玄化真人), the Ritual Officer of the Dao (南曹执法仙宰), the Celestial Officer of the Dao (都天大法主), the Forty-Fourth Celestial Master of the Han Lineage (嗣教四十四代天师), Zhang Yucheng (张宇清).\n\n**Names of the Masters at the Ritual Altar (临坛师法名):**\nSupervisor of the Dao (监　　度　　师),\nGuardian of Auspiciousness (保　　举　　师),\nAttestant of the Sacred Covenant (证　　盟　　师).",
      "start_char": 12090,
      "end_char": 12309,
      "start_sentence": 494,
      "end_sentence": 499,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 7.7945556640625,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\高上大洞文昌司禄紫阳宝箓.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}