{
  "source_id": "黄帝内经灵枢略",
  "source_file": "chunked_daozang\\黄帝内经灵枢略.json",
  "total_chunks": 3,
  "total_original_chars": 3373,
  "total_translated_chars": 18025,
  "total_translation_time": 46.88182353973389,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\黄帝内经灵枢略.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "**Title:** *Huangdi Neijing – Ling Shu (Abridged)*\n\n---\n\n**Huangdi Neijing – Ling Shu (Excerpt)**\n\nHuangdi asked: *\"When a person first takes form, what founds their essence? What establishes their order? What loss brings death? What attainment brings life?\"*\n\nQibo replied: *\"The mother is the foundation, the father the order. To lose the vital essence (*shén*) is to die; to preserve it is to live.\"*\n\nHuangdi asked: *\"What is this vital essence?\"*\n\nQibo answered: *\"When blood and qi harmonize, when the nourishing (*róng*) and defensive (*wèi*) circulations flow freely, when the five viscera are complete, and when the vital essence (*shén*) resides in the heart while the soul (*hún*) and spirit (*pò*) are fully present—only then is one fully formed. When the nourishing and defensive circulations move without deviation, when the six bowels transform grains, and when fluids are dispersed—only then can one endure long.\"*\n\nWithin heaven and earth, within the six directions, nothing exists apart from the Five Phases. So too does the human body conform.\n\nHuangdi asked: *\"What is meant by ‘virtue (*dé*) and qi generating essence, spirit, soul, spirit-soul (*pò*), heart, intention (*yì*), will (*zhì*), thought (*sī*), wisdom (*zhì*), and deliberation (*lǜ*)’? I wish to understand their origins.\"*\n\nQibo replied: *\"The heaven within us is virtue (*dé*); the earth within us is qi. When virtue flows and qi gathers, life emerges. Thus, the coming of life is called essence (*jīng*). When two essences converge, it is called spirit (*shén*). When spirit moves in and out, it is called soul (*hún*). When essence enters and exits together, it is called spirit-soul (*pò*). That which governs the body is called the heart. When the heart recalls, it is called intention (*yì*). Where intention dwells is called will (*zhì*). When will stores and transforms, it is called thought (*sī*). When thought reaches far and yearns, it is called deliberation (*lǜ*). When deliberation governs actions, it is called wisdom (*zhì*).*\n\n*Therefore, the wise in nurturing life must align with the Four Seasons, moderating cold and heat; harmonize joy and anger, securing dwelling; regulate yin and yang, balancing softness and firmness. Thus, perverse influences will not take hold, and longevity will follow.\"*\n\nQibo said: *\"Blood, qi, and spirit are what sustain life and circulate through nature and destiny. The channels are what conduct blood and qi, nourishing yin and yang, moistening sinews and bones, and lubricating joints. The defensive qi is what warms flesh and muscle, fills the skin, and governs the opening and closing of pores. Will and intention are what govern spirit, gather the soul and spirit-soul, and adapt to cold and heat, joy and anger.*\n\n*Thus, when blood harmonizes, the channels flow freely, nourishing and defensive circulations move, sinews and bones grow strong, and joints move smoothly. When defensive qi harmonizes, nails and hair grow firm, skin becomes supple, and pores close tightly. When will and intention harmonize, spirit becomes focused, soul and spirit-soul do not scatter, regret and anger do not arise, and the five viscera resist noxious influences. When cold and heat are balanced, the six bowels transform grains, rheumatic disorders do not arise, and the channels and joints remain unobstructed. This is the natural equilibrium of humanity.*\n\n*The five viscera store spirit, blood, qi, soul, and spirit-soul. The six bowels transform water and grain, conducting fluids. Thus, humanity fully receives what is granted by heaven.\"*\n\nQibo said: *\"When both yin and yang flourish, pathogenic influences find purchase.\"*\n\nQibo said: *\"When pathogenic and righteous influences invade from without and have not yet found a fixed lodging, when they wander through the viscera without a settled place, they move with the nourishing and defensive circulations, causing the soul and spirit-soul to flutter—this makes one restless externally and prone to vivid dreams.\"*\n\n---\n\n**Chapter on the Six Qi**\n\nHuangdi asked: *\"I have heard that humans possess essence, qi, fluids, blood, and vessels. I had thought these were but one qi. Now you distinguish them as six names. I do not understand. Pray, explain what is meant by essence?\"*\n\nQibo replied: *\"When two essences converge and form shape, they precede the body in existence—this is called essence (*jīng*).\"*\n\nHuangdi asked: *\"What is qi?\"*\n\nQibo replied: *\"The upper burner opens and disperses the flavors of the five grains, perfuming the skin, filling the body, and moistening the hair—like dew watering the earth. This is called qi.\"*\n\nHuangdi asked: *\"What are fluids (*jīn*)?\"*\n\nQibo replied: *\"When the pores emit sweat, this is called fluids (*jīn*).\"*\n\nHuangdi asked: *\"What is essence-fluid (*yè*)?\"*\n\nQibo replied: *\"When grain-qi is abundant, it descends as essence-fluid, moistening the bones so that joints bend and extend. It supplements the brain and marrow, and nourishes the skin and hair—this is called essence-fluid (*yè*).\"*\n\nHuangdi asked: *\"What is blood?\"*\n\nQibo replied: *\"The middle burner receives blood from the juices, transforming it into red—this is called blood.\"*\n\nHuangdi asked: *\"What are vessels (*mài*)?\"*\n\nQibo replied: *\"They contain and direct the nourishing qi, ensuring it has no place to evade—this is called vessels (*mài*).\"*\n\n*\"When one exhales, qi exits; when one inhales, qi enters. The celestial vital qi, in its great measure, exits three times for every once it enters. Thus, if grains are not ingested for half a day, qi weakens; if a full day passes, qi diminishes. The upper burner is like mist, the middle like a ditch, the lower like stagnant water.\"*\n\nHuangdi asked: *\"By what paths do the nourishing and defensive circulations enter and exit?\"*\n\nQibo replied: *\"The nourishing circulation emerges from the middle burner, the defensive from the upper. The pure is nourishing (*róng*), the impure is defensive (*wèi*). The nourishing resides within the vessels, the defensive without. The nourishing circulates endlessly, completing fifty cycles before reuniting. Yin and yang interpenetrate like an unbroken ring.*\n\n*The defensive qi travels twenty-five degrees through yin and twenty-five through yang, dividing day and night. Thus, qi moves toward yang and halts at yin.*\n\n*Essence-fluid is what irrigates essence and moistens the orifices. If the upper fluid pathway opens and tears flow uncontrollably, essence-fluid is exhausted. When essence-fluid is exhausted, essence cannot irrigate, and the eyes lose their sight.\"*\n\nThe Five Zang [organs] store the vital essence, spirit, soul, and ethereal soul within them. The Six Fu [bowels] receive the grains and conduct them, receive the qi and disperse it. The channels and vessels receive blood and nourish it, converging to govern the body.\n\nIn a healthy person, when the stomach is full, the intestines are empty; when the intestines are full, the stomach is empty. This alternating fullness and emptiness allow qi to flow upward and downward, stabilizing the Five Zang, harmonizing the blood and vessels, and allowing spirit to reside. Thus, spirit is the refined essence and qi of water and grains.\n\nWhen qi resides in the vessels, if evil qi is in the upper regions, it means the evil qi entering the body is high, hence its presence above. If turbid qi is in the middle, it means that water and grains all enter the stomach, with its refined qi ascending to the lungs, while turbid qi flows to the abdomen and stomach. This occurs when cold and heat are unbalanced, or when diet is improper, leading to illness in the abdomen and stomach—thus it is called turbid qi in the middle. If refined qi is in the lower regions, it means the damp and earthly qi must originate from the feet, hence refined qi is said to be below.\n\nWhen yin and yang separate, cold and heat contend, and the two qi clash, they coalesce into abscesses and pus.\n\nQibo said: *\"The qi that people receive is the essence of grains. The essence of grains flows into the stomach, which is the sea of water, grains, qi, and blood. From this sea, vapors rise and disperse into the vast heavens. The stomach’s output is qi and blood, flowing through the channels and vessels—the great networks of the Five Zang and Six Fu. The lungs pair with the large intestine, which is the transmitting Fu. The heart pairs with the small intestine, which is the receiving Fu. The liver pairs with the gallbladder, which is the repository of refined essence. The spleen pairs with the stomach, which is the Fu of the five grains. The kidneys pair with the bladder, which is the Fu of body fluids. The lesser yin belongs to the kidneys, and kidney qi ascends to connect with the lungs, thus governing the two Zang. The Triple Burner is the Fu of the middle, from which water flows. These are the Fu that pair with the Zang.*\n\n*The Five Zang constantly circulate within the upper seven orifices. Thus, lung qi connects to the nose, and when the nose is harmonized, it can discern fragrant and foul odors. Heart qi connects to the tongue, and when the tongue is harmonized, it can perceive the five flavors. Liver qi connects to the eyes, and when the eyes are harmonized, they can distinguish the five colors. Spleen qi connects to the mouth, and when the mouth is harmonized, it can recognize the five grains. Kidney qi connects to the ears, and when the ears are harmonized, they can hear the five tones. If the Five Zang are disharmonized, the seven orifices will not function. If the Six Fu are disharmonized, stagnation and blockages form as abscesses.\n\nThus, when evil is in the Fu, the yang vessels are obstructed, and when the yang vessels are obstructed, qi stagnates, causing yang qi to flourish. When yang qi flourishes excessively, the yin vessels are obstructed, and when the yin vessels are obstructed, qi stagnates, causing yin qi to flourish. When yin qi flourishes excessively, yang cannot nourish, hence *guān* [closure]. When yang qi flourishes excessively, yin cannot nourish, hence *gé* [blockage]. When both yin and yang flourish excessively and cannot nourish each other, it is called *guān gé* [closure-blockage]. Closure-blockage means death before the natural term.\n\nThe Yellow Emperor asked: *\"Why does qi circulate through the Five Zang but not nourish the Six Fu?\"*\n\nQibo replied: *\"Qi cannot cease to flow, like water flowing or the sun and moon moving endlessly. Thus, yin vessels nourish the Zang, and yang vessels nourish the Fu, like an unbroken ring with no beginning or end, eternally returning. The overflowing qi irrigates the Zang and Fu internally and moistens the body’s exterior.*\n\n*The mind resides in the heart, allowing one to know past and present. The heart is the great sovereign of the Five Zang and Six Fu, the dwelling of spirit. If its storage is firm, evil cannot penetrate. If it does, the heart is injured, spirit departs, and death follows. Retreat to a quiet place, letting spirit wander freely. Close doors and windows, and the soul and ethereal soul will not scatter. Focus the mind on one spirit, and essence and qi will not disperse. Exclude human sounds to gather essence, and concentrate the spirit. Close the outer gates, and true qi will be preserved.\"*\n\nThe Yellow Emperor asked: *\"There is a single vessel that generates over ten diseases—pain, abscesses, cold, heat, itching, numbness, or insensitivity—endlessly transforming. What is its cause?\"*\n\nQibo replied: *\"These are all generated by evil qi.\"*\n\nThe Emperor said: *\"I have heard of true qi, righteous qi, and evil qi. What is true qi?\"*\n\nQibo replied: *\"True qi is what one receives from Heaven, coexisting with grain qi to fill the body. Righteous qi is the proper wind, coming from one direction—neither solid nor hollow wind. Evil qi is the hollow wind’s harm, injuring people. When it enters deeply, it cannot depart on its own. When righteous wind enters, it does so shallowly and departs naturally. Its qi is gentle and weak, unable to overcome true qi, hence it departs. When hollow evil enters, it stirs the form, raises the body hair, and opens the pores. If it penetrates deeply, pressing against the bones, it causes bone numbness. If it presses against the vessels, blood does not flow, causing abscesses. If it presses internally, clashing with defensive qi, if yang prevails, it causes heat; if yin prevails, it causes cold. Cold drives true qi away, and when true qi departs, cold presses between the skin and flesh, causing the pores to open, raising the body hair, and dispersing qi—this is insensitivity. If hollow evil lodges unilaterally in the body, entering deeply and assaulting the nourishing and defensive qi, when these weaken, true qi departs while evil remains, manifesting as hemiplegia.\"*\n\nThe Yellow Emperor asked: *\"I have heard that the intestines and stomach receive grains, the upper burner produces qi to warm the nails and flesh while nourishing the bones and joints, and moistens the pores. The middle burner produces qi like dew, ascending to the valleys and seeping into the channels, harmonizing body fluids and transforming red into blood.\"*\n\nThe blood harmonizes, the channels and vessels first become full.\nWhen full, it flows into the collaterals;\nwhen the collaterals are all replete, it returns to the channels.\nWhen yin and yang are properly balanced, the breath moves accordingly.\n\nIts movement follows the great principles,\nits circulation adheres to natural laws,\nin harmony with Heaven’s rhythms,\nnever ceasing.\n\nWhen examined and regulated,\nfrom emptiness to fullness—\nif drained, deficiency ensues;\nif overstimulated, the qi is exhausted.\nIf retained in sequence,\nfrom fullness to emptiness—\nif supplemented, excess arises.\nOnce blood and qi are balanced,\nthe form and spirit are sustained.\n\nI have learned of the balance and imbalance of blood and qi,\nbut I do not know\nhow flaccid ulcers arise,\nthe timing of their success or failure,\nthe periods of life and death—\nnear or distant—\nand how to measure them.\nMay I inquire further?\n\n**Qibo replied:**\nThe channels and vessels flow without ceasing,\nin rhythm with Heaven’s degrees,\nin harmony with Earth’s cycles.\nThus, when celestial hosts stray from their courses,\nwhen eclipses obscure the sun and moon,\nwhen Earth’s pathways falter,\nwhen waterways overflow,\nwhen dwellings crumble and crops fail,\nwhen roads are impassable,\nwhen people cannot travel,\nwhen streets and settlements are abandoned—\nyet blood and qi still circulate.\nLet me explain the reason.\n\nThe blood and vessels, the defensive and nourishing,\ncirculate endlessly.\nAbove, they correspond to the stars and constellations;\nbelow, they align with the channel pathways.\n\nWhen cold qi invades the channels and vessels,\nthe blood congeals.\nWhen blood congeals, it does not flow;\nwhen it does not flow, the defensive qi converges there,\nunable to return.\nThus, flaccidity and swelling arise.\n\nWhen cold transforms into heat,\nheat prevails and rots the flesh.\nWhen flesh rots, it becomes pus;\nwhen pus does not drain, the sinews decay.\nWhen sinews decay, the bones are injured;\nwhen bones are injured, the marrow is consumed.\nWhen marrow is consumed, the bones hollow;\nwhen bones hollow and cannot drain,\nthe sinews wither and the bones become empty.\nThen sinews, bones, and muscles fail to nourish each other,\nthe channels and vessels deteriorate and leak,\ndarkening the five viscera.\nWhen the viscera are injured, death follows.\n\n---\n**Deranged Vision (Discussion on the Eyes)**\nQibo said:\nThe refined essences of the five viscera and six bowels\nall ascend to the eyes and form the pupil.\nThe eyes are the refined essences of the five viscera and six bowels,\nconstantly nourished by the defensive and nourishing,\nwhere spirit and vitality originate.\n\nThus, when the spirit is exhausted, the soul and ethereal spark scatter,\nand the will becomes disordered.\nTherefore, the black pupil follows yin,\nwhile the white sclera and red vessels follow yang.\nThus, when yin and yang move together, the eyes are clear.\n\nThe eyes are the heart’s emissaries,\nand the heart is the spirit’s dwelling.\nHence, when the spirit is divided and the eyes are disordered,\nthey do not turn.\nIf suddenly confronted with the extraordinary,\nthe spirit, soul, and ethereal spark scatter,\nunable to reunite,\nand derangement ensues.\n\n**The Yellow Emperor asked:**\nWhat qi causes a person to be prone to forgetfulness?\n\n**Qibo replied:**\nWhen the upper qi is insufficient and the lower qi is excessive,\nwhen the intestines and stomach are full while the heart and lungs are empty,\nemptiness causes the nourishing and defensive to linger below,\nand if they do not ascend in due time,\nforgetfulness ensues.\n\n---\n**Discussion on Speechlessness**\n**The Yellow Emperor asked:**\nWhat blocks the path, what qi does not flow,\nthat a person suddenly falls into sorrow and cannot speak?\nI wish to hear the method.\n\n**The Minor Teacher replied:**\nThe throat is the passage for water and grains;\nthe larynx is the conduit for ascending and descending qi;\nthe epiglottis is the door of sound;\nthe lips are the bellows of sound;\nthe tongue is the mechanism of sound;\nthe uvula is the gate of sound;\nthe cheeks and jaws are where divided qi disperses;\nthe hyoid bone is where spirit qi commands,\ngoverning the tongue’s release.\n\nThus, when nasal passages leak and tears flow uncontrollably,\nthe jaw does not close properly,\nand divided qi escapes.\n\nIf the epiglottis is small and thin,\nthe released qi is swift,\nits opening and closing agile,\nand the exhaled breath is effortless.\nIf the epiglottis is large and thick,\nits opening and closing are difficult,\nthe exhaled breath is slow,\nand speech becomes labored.\nThis is what is called \"heaviness of speech.\"\n\nIf suddenly speechless,\ncold qi invades the epiglottis,\npreventing its release.\nWhen the release fails to reach the tongue and lips,\ntheir opening and closing become sluggish,\nand thus, no sound emerges.\n\n---\n*The Yellow Emperor’s Inner Classic (Lingshu) concludes.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "黄帝内经灵枢略 经名：《黄帝内经灵枢略》。 撰人及成书年代不详。 一卷。 底本出处：《正统道藏》太玄部。 黄帝内经灵枢略 黄帝问曰：夫人之始生也，何筑为基？ 何立为顺？ 何失而死？ 何得而生？ 岐伯曰：以母为基，以父为顺，失神者死，得神者生。 黄帝日：何者为神？ 岐伯曰：血气和合，荣卫已通，五藏已成，神气舍心，魂魄毕具，乃成人也。 荣卫之行，不失其常，六府化谷，津液布扬，故能长久。 天地之问，六合之内，不离於五，人亦应之。 黄帝问日：何谓德气生精、神、魂、魄、心、意、志、思、智、虑？ 请闻其故。 岐伯对日：天之在我者德也，地之在我者气也，德流气薄，而生者也。 故生之来，谓之精，两精相薄谓之神，随神而往来谓之魂，并精而出入谓之魄，所以任物者谓之心，心有所忆谓之意，意之所存谓之志，因志而存变谓之思，因思而远慕谓之虑，因虑而处物谓之智。 故智者之养生也，必顺四时而适寒暑，和喜怒而安居处，节阴阳而调柔刚，如是则邪僻不至，长生久视矣。 岐伯日：血气精神者，所以奉於生，而周於性命者也。 经脉者，所以行血气而荣卫阴阳，濡筋骨而利关节者也。 卫气者，所以温爪肉而充皮肤，肥胜理而司开阖者也。 志意者，所以御精神收魂魄，适寒温和喜怒者也。 是故血和则经脉流行，荣卫阴阳，筋骨劲强，关节滑利矣。 卫气和则爪解筋滑和，皮肤调柔，胜理致密矣。 志意和则精神专直，魂魄不散，悔忿不至，五藏不受邪气矣。 寒温和则六府化谷，风痹不作，经脉通利肢节矣。 此人之常平也。 五藏者，所以藏精神血气魂魄也； 六府者，所以化水谷而行津液也。 此人之所以具受於天矣。 岐伯日：阴阳俱盛，邪乃得住。 岐伯曰：正邪从外袭内，而未有定舍，及淫於藏，不得定处，与荣卫俱行，而魂魄飞扬，使人外不安而善梦也。 六气论篇 黄帝问日：余闻人有精气津液血脉，余意以为一气耳。 今乃辩为六名，余不知所以，愿闻何谓精？ 岐伯对日：两神相薄，合而成形，常先身生，是谓精。 帝曰：何谓气？ 岐伯曰：上焦开发，宣五谷味，熏肤、充身、泽毛，若露之溉，是谓气。 帝曰：何谓津？ 岐伯日：胜理发泄，汗出胜，是谓津。 帝日：何谓液？ 岐伯日：谷气满，悼泽注於骨，骨属屈伸，以泽，补益脑髓，皮肤润泽，是谓液。 帝日：何谓血？ 岐伯日：中焦受血於汁，变化而赤，是谓血。 帝曰：何谓脉？ 岐伯日：拥遏荣气，令无所避，是谓脉也。 夫气呼则出，吸则入，天之精气，其大数常出三而入一也。 故谷不入半日则气衰，一日则气少矣。 上焦如雾，中焦如沟，下焦如渍。 帝曰：荣卫之行，皆何道出入？ 岐伯曰：荣出中焦，卫出上焦，清者为荣，浊者为卫，荣在脉中，卫在脉外。 黄帝问日：何气为荣？ 何气为卫？ 岐伯对日：人受气於谷，谷入於胃，以传与肺，五藏六府，皆以受气，其清者为荣，浊者为卫，荣在脉中，卫在脉外，荣周不休，五十周而复大会，阴阳相贯，如环无端。 卫气行於阴二十五度，行於阳亦二十五度，分为昼夜。 故气至阳而行，至阴而止。 夫液者，所以灌精而濡空窍者也。 故上液之道开，泣出不止，则液竭，液竭则精不灌，精不灌则目无所见矣。",
      "translated_text": "**Title:** *Huangdi Neijing – Ling Shu (Abridged)*\n\n---\n\n**Huangdi Neijing – Ling Shu (Excerpt)**\n\nHuangdi asked: *\"When a person first takes form, what founds their essence? What establishes their order? What loss brings death? What attainment brings life?\"*\n\nQibo replied: *\"The mother is the foundation, the father the order. To lose the vital essence (*shén*) is to die; to preserve it is to live.\"*\n\nHuangdi asked: *\"What is this vital essence?\"*\n\nQibo answered: *\"When blood and qi harmonize, when the nourishing (*róng*) and defensive (*wèi*) circulations flow freely, when the five viscera are complete, and when the vital essence (*shén*) resides in the heart while the soul (*hún*) and spirit (*pò*) are fully present—only then is one fully formed. When the nourishing and defensive circulations move without deviation, when the six bowels transform grains, and when fluids are dispersed—only then can one endure long.\"*\n\nWithin heaven and earth, within the six directions, nothing exists apart from the Five Phases. So too does the human body conform.\n\nHuangdi asked: *\"What is meant by ‘virtue (*dé*) and qi generating essence, spirit, soul, spirit-soul (*pò*), heart, intention (*yì*), will (*zhì*), thought (*sī*), wisdom (*zhì*), and deliberation (*lǜ*)’? I wish to understand their origins.\"*\n\nQibo replied: *\"The heaven within us is virtue (*dé*); the earth within us is qi. When virtue flows and qi gathers, life emerges. Thus, the coming of life is called essence (*jīng*). When two essences converge, it is called spirit (*shén*). When spirit moves in and out, it is called soul (*hún*). When essence enters and exits together, it is called spirit-soul (*pò*). That which governs the body is called the heart. When the heart recalls, it is called intention (*yì*). Where intention dwells is called will (*zhì*). When will stores and transforms, it is called thought (*sī*). When thought reaches far and yearns, it is called deliberation (*lǜ*). When deliberation governs actions, it is called wisdom (*zhì*).*\n\n*Therefore, the wise in nurturing life must align with the Four Seasons, moderating cold and heat; harmonize joy and anger, securing dwelling; regulate yin and yang, balancing softness and firmness. Thus, perverse influences will not take hold, and longevity will follow.\"*\n\nQibo said: *\"Blood, qi, and spirit are what sustain life and circulate through nature and destiny. The channels are what conduct blood and qi, nourishing yin and yang, moistening sinews and bones, and lubricating joints. The defensive qi is what warms flesh and muscle, fills the skin, and governs the opening and closing of pores. Will and intention are what govern spirit, gather the soul and spirit-soul, and adapt to cold and heat, joy and anger.*\n\n*Thus, when blood harmonizes, the channels flow freely, nourishing and defensive circulations move, sinews and bones grow strong, and joints move smoothly. When defensive qi harmonizes, nails and hair grow firm, skin becomes supple, and pores close tightly. When will and intention harmonize, spirit becomes focused, soul and spirit-soul do not scatter, regret and anger do not arise, and the five viscera resist noxious influences. When cold and heat are balanced, the six bowels transform grains, rheumatic disorders do not arise, and the channels and joints remain unobstructed. This is the natural equilibrium of humanity.*\n\n*The five viscera store spirit, blood, qi, soul, and spirit-soul. The six bowels transform water and grain, conducting fluids. Thus, humanity fully receives what is granted by heaven.\"*\n\nQibo said: *\"When both yin and yang flourish, pathogenic influences find purchase.\"*\n\nQibo said: *\"When pathogenic and righteous influences invade from without and have not yet found a fixed lodging, when they wander through the viscera without a settled place, they move with the nourishing and defensive circulations, causing the soul and spirit-soul to flutter—this makes one restless externally and prone to vivid dreams.\"*\n\n---\n\n**Chapter on the Six Qi**\n\nHuangdi asked: *\"I have heard that humans possess essence, qi, fluids, blood, and vessels. I had thought these were but one qi. Now you distinguish them as six names. I do not understand. Pray, explain what is meant by essence?\"*\n\nQibo replied: *\"When two essences converge and form shape, they precede the body in existence—this is called essence (*jīng*).\"*\n\nHuangdi asked: *\"What is qi?\"*\n\nQibo replied: *\"The upper burner opens and disperses the flavors of the five grains, perfuming the skin, filling the body, and moistening the hair—like dew watering the earth. This is called qi.\"*\n\nHuangdi asked: *\"What are fluids (*jīn*)?\"*\n\nQibo replied: *\"When the pores emit sweat, this is called fluids (*jīn*).\"*\n\nHuangdi asked: *\"What is essence-fluid (*yè*)?\"*\n\nQibo replied: *\"When grain-qi is abundant, it descends as essence-fluid, moistening the bones so that joints bend and extend. It supplements the brain and marrow, and nourishes the skin and hair—this is called essence-fluid (*yè*).\"*\n\nHuangdi asked: *\"What is blood?\"*\n\nQibo replied: *\"The middle burner receives blood from the juices, transforming it into red—this is called blood.\"*\n\nHuangdi asked: *\"What are vessels (*mài*)?\"*\n\nQibo replied: *\"They contain and direct the nourishing qi, ensuring it has no place to evade—this is called vessels (*mài*).\"*\n\n*\"When one exhales, qi exits; when one inhales, qi enters. The celestial vital qi, in its great measure, exits three times for every once it enters. Thus, if grains are not ingested for half a day, qi weakens; if a full day passes, qi diminishes. The upper burner is like mist, the middle like a ditch, the lower like stagnant water.\"*\n\nHuangdi asked: *\"By what paths do the nourishing and defensive circulations enter and exit?\"*\n\nQibo replied: *\"The nourishing circulation emerges from the middle burner, the defensive from the upper. The pure is nourishing (*róng*), the impure is defensive (*wèi*). The nourishing resides within the vessels, the defensive without. The nourishing circulates endlessly, completing fifty cycles before reuniting. Yin and yang interpenetrate like an unbroken ring.*\n\n*The defensive qi travels twenty-five degrees through yin and twenty-five through yang, dividing day and night. Thus, qi moves toward yang and halts at yin.*\n\n*Essence-fluid is what irrigates essence and moistens the orifices. If the upper fluid pathway opens and tears flow uncontrollably, essence-fluid is exhausted. When essence-fluid is exhausted, essence cannot irrigate, and the eyes lose their sight.\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1226,
      "start_sentence": 0,
      "end_sentence": 59,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 20.009214639663696,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\黄帝内经灵枢略.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "五藏者，合神气魂魄而藏之； 六府者，受谷而行之，受气而扬之； 经脉者，受血而荣之，合而以治。 夫平人，胃满则肠虚，肠满则胃虚，更满更虚，气得上下，五藏安定，血脉和利，精神乃居，故神者，水谷之精气也。 夫气之在脉也，邪气在上者，言邪气之中人也高，故在上也。 浊气在中者，言水谷皆入于胃，其清气上注于肺，浊气流于腹胃，言寒温不适，饮食不节，而病于腹胃，故命曰浊气在中也。 清气在下者，言清湿地之气，必从足始，故日清气在下也。 阴与阳别，寒与热争，两气相薄，合瘫脓。 岐伯日：人所受气者谷也，谷之所注者胃也，胃者水谷气血之海也，海之所出者云雾而布太虚也。 胃之所出者气血而行经隧也，经隧者五藏六府之大络也。 肺合大肠，大肠者传送之府也。 心合小肠，小肠者受盛之府也。 肝合胆，胆者中清之府也。 脾合胃，胃者五谷之府也。 肾合膀胱，膀胱者津液之府也。 少阴属肾，肾气上连肺，故将两藏。 三焦者，中渍之府也，水道出焉。 此六府之与合者也。 夫五藏常内阅於上七窍，故肺气通於鼻，鼻和则鼻能知臭香矣。 心气通於舌，舌和则舌能知五味矣。 肝气通於目，目和则目能辨五色矣。 脾气通於口，口和则口能知五谷矣。 肾气通於耳，耳和则耳能闻五音矣。 五藏不和则七窍不通，六府不和则留结为瘫。 故邪在府则阳脉不利，阳脉不利则气留之，气留之则阳气盛矣。 阳气大盛则阴脉不利，阴脉不利则气留之，气留之则阴气盛矣。 阴气大盛，则阳气弗能荣，故曰关。 阳气大盛，则阴气弗能荣，故日格。 阴阳俱盛，不得相荣，故曰关格。 关格者，不得尽期而死矣。 黄帝日：气独行五藏，不荣六府何也？ 岐伯日：气之不得无行也，如水之流，如日月之行不休，故阴脉营其藏，阳脉营其府，如环之无端，莫知其纪，终而复始，其溢之气，内溉藏府，外濡胜理也。 舍精神於心，以知古今，心者五藏六府之大主，精神之舍也。 其藏坚固，邪不能容，容之则心伤，心伤则神去，神去则死矣。 探居静处，与神往来，闭户塞牖，魂魄不散，专意一神，精气不分，无闻人声，以收其精，必一其神，’闭其外门，真气乃存。 黄帝问曰：有一脉生十余病者，或痛或瘫，或寒或热，或痒或痹，或不仁，变化无穷，其故何也？ 岐伯对日：此皆邪气之所生也。 帝日：余闻有真气，有正气，有邪气。 何谓真气？ 岐伯日：真气者，所受於天，与谷气并，而充身也。 正气者，正风也，从一方来，非实风，又非虚风也。 邪气者，虚风之贼，伤人者也，其中人也深，不能自去。 正风之中人也浅，合而自去，其气柔弱，不能胜真气，故自去。 虚邪之中人也，洒墀动形，起毫毛而发胜理，其入深。 内薄於骨，则为骨痹也。 薄於脉中，则血不通，则为瘫也。 薄於内，与卫气相薄，阳胜者则为热，阴胜者则为寒，寒则真气去，真气去则寒薄於皮肤之间，其气外发胜理，开毫毛，播气往来，则为不仁也。 虚邪偏客於身半，其入深，内干荣卫，荣卫稍衰，则真气去邪独留，发为偏枯也。 黄帝问日：余闻肠胃受谷，上焦出气，以温爪肉，而养骨节，通胜理。 中焦出气如露，上注溪谷，而渗经脉，津液和调，变化赤而为血。",
      "translated_text": "The Five Zang [organs] store the vital essence, spirit, soul, and ethereal soul within them. The Six Fu [bowels] receive the grains and conduct them, receive the qi and disperse it. The channels and vessels receive blood and nourish it, converging to govern the body.\n\nIn a healthy person, when the stomach is full, the intestines are empty; when the intestines are full, the stomach is empty. This alternating fullness and emptiness allow qi to flow upward and downward, stabilizing the Five Zang, harmonizing the blood and vessels, and allowing spirit to reside. Thus, spirit is the refined essence and qi of water and grains.\n\nWhen qi resides in the vessels, if evil qi is in the upper regions, it means the evil qi entering the body is high, hence its presence above. If turbid qi is in the middle, it means that water and grains all enter the stomach, with its refined qi ascending to the lungs, while turbid qi flows to the abdomen and stomach. This occurs when cold and heat are unbalanced, or when diet is improper, leading to illness in the abdomen and stomach—thus it is called turbid qi in the middle. If refined qi is in the lower regions, it means the damp and earthly qi must originate from the feet, hence refined qi is said to be below.\n\nWhen yin and yang separate, cold and heat contend, and the two qi clash, they coalesce into abscesses and pus.\n\nQibo said: *\"The qi that people receive is the essence of grains. The essence of grains flows into the stomach, which is the sea of water, grains, qi, and blood. From this sea, vapors rise and disperse into the vast heavens. The stomach’s output is qi and blood, flowing through the channels and vessels—the great networks of the Five Zang and Six Fu. The lungs pair with the large intestine, which is the transmitting Fu. The heart pairs with the small intestine, which is the receiving Fu. The liver pairs with the gallbladder, which is the repository of refined essence. The spleen pairs with the stomach, which is the Fu of the five grains. The kidneys pair with the bladder, which is the Fu of body fluids. The lesser yin belongs to the kidneys, and kidney qi ascends to connect with the lungs, thus governing the two Zang. The Triple Burner is the Fu of the middle, from which water flows. These are the Fu that pair with the Zang.*\n\n*The Five Zang constantly circulate within the upper seven orifices. Thus, lung qi connects to the nose, and when the nose is harmonized, it can discern fragrant and foul odors. Heart qi connects to the tongue, and when the tongue is harmonized, it can perceive the five flavors. Liver qi connects to the eyes, and when the eyes are harmonized, they can distinguish the five colors. Spleen qi connects to the mouth, and when the mouth is harmonized, it can recognize the five grains. Kidney qi connects to the ears, and when the ears are harmonized, they can hear the five tones. If the Five Zang are disharmonized, the seven orifices will not function. If the Six Fu are disharmonized, stagnation and blockages form as abscesses.\n\nThus, when evil is in the Fu, the yang vessels are obstructed, and when the yang vessels are obstructed, qi stagnates, causing yang qi to flourish. When yang qi flourishes excessively, the yin vessels are obstructed, and when the yin vessels are obstructed, qi stagnates, causing yin qi to flourish. When yin qi flourishes excessively, yang cannot nourish, hence *guān* [closure]. When yang qi flourishes excessively, yin cannot nourish, hence *gé* [blockage]. When both yin and yang flourish excessively and cannot nourish each other, it is called *guān gé* [closure-blockage]. Closure-blockage means death before the natural term.\n\nThe Yellow Emperor asked: *\"Why does qi circulate through the Five Zang but not nourish the Six Fu?\"*\n\nQibo replied: *\"Qi cannot cease to flow, like water flowing or the sun and moon moving endlessly. Thus, yin vessels nourish the Zang, and yang vessels nourish the Fu, like an unbroken ring with no beginning or end, eternally returning. The overflowing qi irrigates the Zang and Fu internally and moistens the body’s exterior.*\n\n*The mind resides in the heart, allowing one to know past and present. The heart is the great sovereign of the Five Zang and Six Fu, the dwelling of spirit. If its storage is firm, evil cannot penetrate. If it does, the heart is injured, spirit departs, and death follows. Retreat to a quiet place, letting spirit wander freely. Close doors and windows, and the soul and ethereal soul will not scatter. Focus the mind on one spirit, and essence and qi will not disperse. Exclude human sounds to gather essence, and concentrate the spirit. Close the outer gates, and true qi will be preserved.\"*\n\nThe Yellow Emperor asked: *\"There is a single vessel that generates over ten diseases—pain, abscesses, cold, heat, itching, numbness, or insensitivity—endlessly transforming. What is its cause?\"*\n\nQibo replied: *\"These are all generated by evil qi.\"*\n\nThe Emperor said: *\"I have heard of true qi, righteous qi, and evil qi. What is true qi?\"*\n\nQibo replied: *\"True qi is what one receives from Heaven, coexisting with grain qi to fill the body. Righteous qi is the proper wind, coming from one direction—neither solid nor hollow wind. Evil qi is the hollow wind’s harm, injuring people. When it enters deeply, it cannot depart on its own. When righteous wind enters, it does so shallowly and departs naturally. Its qi is gentle and weak, unable to overcome true qi, hence it departs. When hollow evil enters, it stirs the form, raises the body hair, and opens the pores. If it penetrates deeply, pressing against the bones, it causes bone numbness. If it presses against the vessels, blood does not flow, causing abscesses. If it presses internally, clashing with defensive qi, if yang prevails, it causes heat; if yin prevails, it causes cold. Cold drives true qi away, and when true qi departs, cold presses between the skin and flesh, causing the pores to open, raising the body hair, and dispersing qi—this is insensitivity. If hollow evil lodges unilaterally in the body, entering deeply and assaulting the nourishing and defensive qi, when these weaken, true qi departs while evil remains, manifesting as hemiplegia.\"*\n\nThe Yellow Emperor asked: *\"I have heard that the intestines and stomach receive grains, the upper burner produces qi to warm the nails and flesh while nourishing the bones and joints, and moistens the pores. The middle burner produces qi like dew, ascending to the valleys and seeping into the channels, harmonizing body fluids and transforming red into blood.\"*",
      "overlap_context": "leting fifty cycles before reuniting. Yin and yang interpenetrate like an unbroken ring.*\n\n*The defensive qi travels twenty-five degrees through yin and twenty-five through yang, dividing day and night. Thus, qi moves toward yang and halts at yin.*\n\n*Essence-fluid is what irrigates essence and moistens the orifices. If the upper fluid pathway opens and tears flow uncontrollably, essence-fluid is exhausted. When essence-fluid is exhausted, essence cannot irrigate, and the eyes lose their sight.\"*",
      "start_char": 1226,
      "end_char": 2436,
      "start_sentence": 60,
      "end_sentence": 109,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 14.875878810882568,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\黄帝内经灵枢略.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "血和则经脉先满，满乃注於经络，经络皆盈乃注於经脉，阴阳已张，因息乃行。 行有纲纪，周有道理，与天合同，不得休止。 切而调之，从虚去实，写则不足，疾则气臧，留之先后，从实去虚，补则有余，血气已调，形神乃持。 余已知血气之平与不平，未知瘫疽之所从生，成败之时，死生之期，期有远近，何以度之，可得闻乎？ 岐伯曰：经脉流行不止，与天同度，与地合纪，故天宿失度，日月薄蚀，地经失纪，水道流溢，草庐不成，五谷不殖，径路不通，民不往来，街聚邑居，别离异处，血气犹然，请言其故。 夫血脉荣卫，周流不休，上应星宿，下应经数。 寒气客於经脉之中，则血泣，血泣则不通，不通则卫气归之，不得复返，故瘫肿也。 寒气化为热，热胜则腐肉，腐肉则为脓，脓不泻则烂筋，筋烂则伤骨，骨伤则髓销，髓销则骨空，骨空不得泄泻，则筋枯骨虚，则筋骨肌肉不相荣，经脉败漏，黑於五藏，藏伤故死矣。 迷惑论篇 岐伯日：五藏六府之精气，皆上注於目而为睛。 目者，五藏六府之精，荣卫魂魄之所常荣，神气之所生也。 故神劳则魂魄散，志意乱也。 是故瞳子黑睛法於阴，白睛赤脉法於阳，故阴阳俱转而睛明也。 目者心之使，心者神之舍也，故神分睛乱而不转，卒然见非常之处，精神魂魄散，不得相因，而迷惑也。 黄帝问日：人之善忘者何气使然？ 岐伯对曰：上气不足，下气有余，肠胃实而心肺虚，虚则荣卫留於下，久不以时上，故善忘也。 无音论篇 黄帝问日：人之卒然忧患而无言者，何道之塞，何气之不行，使音不彰，愿闻其方？ 少师对曰：咽喉者，水谷之道也； 喉咙者，气之所以上下也； 会厌者，音声之户也； 唇者，音声之扇也； 舌者，音声之机也； 悬雍者，音声之关也； 颊颗者，分气之所泄也； 横骨者，神气之所使，主发舌者也。 故人之鼻洞涕出不收者，俯颗不闭，分气失也。 是故厌小而薄，则发气疾，其开阖利，其出气易。 厌大而厚，则开阖难，其出气迟，故重言也。 所谓吃者，其言重。 卒然无音者，寒气客於厌，则厌不能发，发不能至其机扇，其机扇开阖不利，故无音也。 黄帝内经灵枢略竟",
      "translated_text": "The blood harmonizes, the channels and vessels first become full.\nWhen full, it flows into the collaterals;\nwhen the collaterals are all replete, it returns to the channels.\nWhen yin and yang are properly balanced, the breath moves accordingly.\n\nIts movement follows the great principles,\nits circulation adheres to natural laws,\nin harmony with Heaven’s rhythms,\nnever ceasing.\n\nWhen examined and regulated,\nfrom emptiness to fullness—\nif drained, deficiency ensues;\nif overstimulated, the qi is exhausted.\nIf retained in sequence,\nfrom fullness to emptiness—\nif supplemented, excess arises.\nOnce blood and qi are balanced,\nthe form and spirit are sustained.\n\nI have learned of the balance and imbalance of blood and qi,\nbut I do not know\nhow flaccid ulcers arise,\nthe timing of their success or failure,\nthe periods of life and death—\nnear or distant—\nand how to measure them.\nMay I inquire further?\n\n**Qibo replied:**\nThe channels and vessels flow without ceasing,\nin rhythm with Heaven’s degrees,\nin harmony with Earth’s cycles.\nThus, when celestial hosts stray from their courses,\nwhen eclipses obscure the sun and moon,\nwhen Earth’s pathways falter,\nwhen waterways overflow,\nwhen dwellings crumble and crops fail,\nwhen roads are impassable,\nwhen people cannot travel,\nwhen streets and settlements are abandoned—\nyet blood and qi still circulate.\nLet me explain the reason.\n\nThe blood and vessels, the defensive and nourishing,\ncirculate endlessly.\nAbove, they correspond to the stars and constellations;\nbelow, they align with the channel pathways.\n\nWhen cold qi invades the channels and vessels,\nthe blood congeals.\nWhen blood congeals, it does not flow;\nwhen it does not flow, the defensive qi converges there,\nunable to return.\nThus, flaccidity and swelling arise.\n\nWhen cold transforms into heat,\nheat prevails and rots the flesh.\nWhen flesh rots, it becomes pus;\nwhen pus does not drain, the sinews decay.\nWhen sinews decay, the bones are injured;\nwhen bones are injured, the marrow is consumed.\nWhen marrow is consumed, the bones hollow;\nwhen bones hollow and cannot drain,\nthe sinews wither and the bones become empty.\nThen sinews, bones, and muscles fail to nourish each other,\nthe channels and vessels deteriorate and leak,\ndarkening the five viscera.\nWhen the viscera are injured, death follows.\n\n---\n**Deranged Vision (Discussion on the Eyes)**\nQibo said:\nThe refined essences of the five viscera and six bowels\nall ascend to the eyes and form the pupil.\nThe eyes are the refined essences of the five viscera and six bowels,\nconstantly nourished by the defensive and nourishing,\nwhere spirit and vitality originate.\n\nThus, when the spirit is exhausted, the soul and ethereal spark scatter,\nand the will becomes disordered.\nTherefore, the black pupil follows yin,\nwhile the white sclera and red vessels follow yang.\nThus, when yin and yang move together, the eyes are clear.\n\nThe eyes are the heart’s emissaries,\nand the heart is the spirit’s dwelling.\nHence, when the spirit is divided and the eyes are disordered,\nthey do not turn.\nIf suddenly confronted with the extraordinary,\nthe spirit, soul, and ethereal spark scatter,\nunable to reunite,\nand derangement ensues.\n\n**The Yellow Emperor asked:**\nWhat qi causes a person to be prone to forgetfulness?\n\n**Qibo replied:**\nWhen the upper qi is insufficient and the lower qi is excessive,\nwhen the intestines and stomach are full while the heart and lungs are empty,\nemptiness causes the nourishing and defensive to linger below,\nand if they do not ascend in due time,\nforgetfulness ensues.\n\n---\n**Discussion on Speechlessness**\n**The Yellow Emperor asked:**\nWhat blocks the path, what qi does not flow,\nthat a person suddenly falls into sorrow and cannot speak?\nI wish to hear the method.\n\n**The Minor Teacher replied:**\nThe throat is the passage for water and grains;\nthe larynx is the conduit for ascending and descending qi;\nthe epiglottis is the door of sound;\nthe lips are the bellows of sound;\nthe tongue is the mechanism of sound;\nthe uvula is the gate of sound;\nthe cheeks and jaws are where divided qi disperses;\nthe hyoid bone is where spirit qi commands,\ngoverning the tongue’s release.\n\nThus, when nasal passages leak and tears flow uncontrollably,\nthe jaw does not close properly,\nand divided qi escapes.\n\nIf the epiglottis is small and thin,\nthe released qi is swift,\nits opening and closing agile,\nand the exhaled breath is effortless.\nIf the epiglottis is large and thick,\nits opening and closing are difficult,\nthe exhaled breath is slow,\nand speech becomes labored.\nThis is what is called \"heaviness of speech.\"\n\nIf suddenly speechless,\ncold qi invades the epiglottis,\npreventing its release.\nWhen the release fails to reach the tongue and lips,\ntheir opening and closing become sluggish,\nand thus, no sound emerges.\n\n---\n*The Yellow Emperor’s Inner Classic (Lingshu) concludes.*",
      "overlap_context": "ply and assaulting the nourishing and defensive qi, when these weaken, true qi departs while evil remains, manifesting as hemiplegia.\"*\n\nThe Yellow Emperor asked: *\"I have heard that the intestines and stomach receive grains, the upper burner produces qi to warm the nails and flesh while nourishing the bones and joints, and moistens the pores. The middle burner produces qi like dew, ascending to the valleys and seeping into the channels, harmonizing body fluids and transforming red into blood.\"*",
      "start_char": 2436,
      "end_char": 3265,
      "start_sentence": 110,
      "end_sentence": 141,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 11.996730089187622,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\黄帝内经灵枢略.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}