{
  "source_id": "黄帝阴符经疏",
  "source_file": "chunked_daozang\\黄帝阴符经疏.json",
  "total_chunks": 11,
  "total_original_chars": 10964,
  "total_translated_chars": 64523,
  "total_translation_time": 182.3779947757721,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\玉诀类\\黄帝阴符经疏.txt",
    "category": "玉诀类"
  },
  "full_translation": "**Translation:**\n\n**Title of the Classic:** *The Obscure Symbols Classic of the Yellow Emperor with Commentary* (Huangdi Yin Fu Jing Shu).\n**Original Attribution:** Previously ascribed to Tang Li Quán’s commentary (Tang Li Quán Shu).\n**Authentic Verification:** According to *Daoist Canon Abstracts* (Daozang Tiyao), this appears to be a compilation by a Song-era scholar, blending Li Quán’s *Preface to the Obscure Symbols Classic* (Yin Fu Jing Xu) with Yuan Shuxian’s *Collected Explanations of the Obscure Symbols Classic* (Yin Fu Jing Jijie).\n**Volume:** Three scrolls.\n**Base Text Source:** *The Daoist Canon of the Zhengtong Era* (Zhengtong Daozang), in the **Divine Authenticity Section (Dongzhen Bu)**, under **Jade Precepts Category (Yujie Lei)**.\n**Collation Text:** The **Dream Hua Pavilion Edition** (Menghua Guan Ben) collected in *Newly Compiled Collected Books Series* (Congshu Jicheng Xinbian) [hereafter cited as \"Dream Edition\"].\n\n**Preface to the Commentary on the Obscure Symbols Classic of the Yellow Emperor:**\nThe **Master of Perception from Shaoshi Mountain** (Shaoshi Shan Daguanzi), **Li Quán** (Li Quán), was devoted to the **Dao of the Immortals** (Shenxian zhi Dao), often traversing sacred peaks and gathering esoteric techniques (fangshu).\nUpon reaching **Song Mountain’s Tiger Mouth Cliff** (Songshan Hukou Yan), within the stone-walled grotto, he discovered the **Obscure Symbols Classic** (Yin Fu Jing) inscribed on silk with vermilion lacquer seals (zhuqi zhou), bound in crimson silk (jianguan).\nThe inscription read: *\"In the second year of Wei Zhenjun’s reign (July 7th), the High Purity Daoist Ke Qianzhi (Wei Zhenjun Ke Qianzhi) concealed this within the sacred mountains, to be transmitted to those of like mind (tonghao).\"*\nThe text was worn and faded, as if reduced to ashes and obliteration.\nLi Quán made a brief transcription, though he recited it aloud, he ultimately failed to grasp its profound principles (yili).\n\nLi Quán then entered Qin, reaching the foot of **Lishan Mountain**, where he encountered an old woman—her hair piled atop her head, the rest hanging loose—leaning on a staff in ragged robes beside the road. She saw a fire burning a tree and muttered to herself: *\"Fire arises from wood; disaster strikes when it spreads.\"* Li Quán, startled, asked her, *\"This is the opening passage of the *Yellow Emperor’s Yin Fu Classic*—how do you know it?\"*\n\nThe woman replied, *\"I have received this symbol for three cycles of sixty years, through the six heavenly stems and ten celestial branches, completing the full reckoning.\"*\n\nLi Quán respectfully inquired, *\"According to the *Taiyi Dunjia Classic*, one cycle of sixty years completes one *jiazi* reckoning; three cycles make one hundred eighty years, three *jiazi* cycles form one full rotation, and six rotations total one thousand eight hundred years. How could one so young know this?\"*\n\nLi Quán bowed twice and recounted where he had found the text. The woman smiled and said, *\"Your cheeks glow at the life-gate, your fate-wheel aligns with the moon’s horn—your blood and vitality remain unspent, your spirit unclouded. You are virtuous yet drawn to the Dao, bold yet eager for wisdom. You are my disciple.*\n\n*\"Yet in fifty-six years, you shall face great calamity.\"* She then produced a crimson talisman, affixed it to his hat and staff, and pricked his tongue, commanding him to kneel and swallow it. *\"The heavens and earth preserve each other,\"* she declared, before seating herself beneath a tree to expound on the *Yin Fu’s* profound mysteries.\n\nWhen she finished, she warned him: *\"The *Yellow Emperor’s Yin Fu* consists of three hundred words—one hundred elucidating the Dao, one hundred the law, one hundred the technique. Together, they merge into an indivisible whole.\n\n*\"The sage learns it and grasps the Dao; the virtuous learn it and master the law; the wise learn it and wield the technique. The petty, however, invite ruin by their ignorance. Each attains only what their nature permits.\n\n*\"Its principles arise from celestial mechanics yet harmonize with human affairs—like the morning tide embracing all rivers, or still water reflecting myriad forms. When its mechanism unfurls, it encompasses the cosmos, binding the Nine Barbarians—yet this is but its grandeur. When it contracts, it conceals the finest dust, containing the mustard seed—yet this is but its subtlety.\n\n*\"Its precision surpasses the *Huangting*’s eight vistas; its essence transcends the classics and histories. Its ingenuity outstrips Sunzi, Wu Qi, Han Fei, and Bai Qi. Thus, the natures of growth and decay, the patterns of success and failure, the logic of life and death—all stem from this mechanism.\n\n*\"Its alternate name is *The Yellow Emperor’s Tianji Classic*. Those lacking limbs, senses, or clarity—those consumed by greed, stupidity, wind-illness, or madness—shall not hear it.\n\n*\"If passed to those of like mind, the recipient must first observe three days of purity. Age or station does not matter—only the worthy may teach it. Never let wealth elevate one above the law or poverty degrade another. To violate this, twenty *ji* of one’s lifespan shall be forfeited.\n\n*\"The *River Diagram* and *Luo Book* record the Yellow Emperor’s words: ‘When a sage is born, the Celestial Sovereign grants them thirty-six thousand seven hundred twenty *ji* of fate, one for each year. If they err, the Record-Keeper seizes them. When the *ji* are exhausted, the *ji* are gone, and life ends. But if they cultivate virtue, the Record-Keeper grants them more. When the *ji* accumulate, the *ji* endure, and immortality follows.’\n\n*\"Each year on the seventh day of the seventh month, one scroll must be copied and hidden in the sacred mountains’ cliffs—each copy granting a thousand two hundred years of vitality. To recite it seven times daily sharpens the mind, strengthens the will, repels malevolence, dispels calamities, expels the Three Corpses, and subdues the Nine Worms. Thus, the sages concealed it in the Golden Treasury, transmitting it only to the worthy.\"*\n\nAs the sun dipped toward evening, she said, *\"I have barley rice to share as sustenance.\"* From her sleeve, she produced a gourd and bade Li Quán fetch water.\n\n**#1** *Note: Original text reads \"傍\" (páng), corrected to \"旁\" (páng) according to the Dream Edition.*\n\n**Commentary on the *Huangdi Yinfu Jing* (卷上) by Li Quán of Shaoshi Mountain**\n*Explanation of the Title:*\nYin—darkness.\nFu—harmony.\nThe hidden harmony of the Dao/Way aligns with the workings of cosmic principle, hence the title *Yinfu*.\n\n**Chapter: The Sage Embracing Unity to Manifest the Dao/Way**\nTo observe the Dao/Way of Heaven and follow Heaven’s operations—this is complete.\n\nBut if one observes only the Dao/Way of Heaven in principle and follows Heaven’s Dao/Way, then the proper interplay of yin and yang, motion and stillness, is fully realized.\n\n**Commentary:**\nHeaven refers to the collective name for yin and yang.\nThe refined *qi* of yang is light and clear, ascending to form Heaven;\nThe refined *qi* of yin is heavy and turbid, descending to form Earth.\nThey are connected yet never separate, hence Zhuangzi’s *Liezi* dialogue with the man of Qi, who said to the people of Ruo: *\"Heaven is but accumulated *qi*, Earth but accumulated mass—from Earth upward, all is Heaven.\"* You walk through Heaven all day—why fear its collapse?\n\nThus, knowing Heaven and Earth reveals that within yin and yang’s *qi* lie the Five Phases.\nThe Five Phases are the functional expressions of Heaven and Earth’s yin and yang, from which all things arise; all things are the offspring of the Five Phases.\nIf one observes the Dao/Way of Heaven and Earth’s yin and yang, and follows the Five *qi* of Heaven, then the rise and fall of all things may be known, and life and death discerned. Beyond this, there is nothing further to observe or follow—thus it is said to be complete.\n\nHeaven possesses Five Thieves; those who perceive them thrive.\nThe Five Thieves reside in the heart, manifesting in Heaven’s operations.\nThe cosmos lies within the palm; all things spring from the body.\nHeaven generates the Five Phases—these are the Five Thieves.\nIf one attends with mind to observe and follow, aligning with Heaven’s operations, then the cosmos rests in the palm, and all things arise from the body.\n\n**Commentary:**\nThe Five Thieves are the *qi* of the Five Phases—namely, Metal, Wood, Water, Fire, and Earth.\nThe *Taigong* commentary states: The Sage establishes them as Five Thieves; the world follows them as Five Virtues.\nThough humans consume the Five Flavors and die, none abandon them—this is the meaning of the Five Thieves.\nThe term \"Thief\" refers to harm.\nIf one acts contrary to their nature, they bring harm to life—hence \"Thief.\"\n\nThis speaks of how yin and yang encompass the Five *qi*, hence: *Heaven has Five Thieves.*\nThe Five Thieves manifest as:\nIn Heaven, the Five Stars;\nOn Earth, the Five Sacred Peaks;\nIn governance, the Five Directions;\nIn things, the Five Colors;\nIn sound, the Five Tones;\nIn sustenance, the Five Flavors;\nIn the body, the Five Viscera;\nIn the Dao/Way, the Five Virtues.\nIf misused, they become Thieves.\nMoreover, the Five Thieves—through the mutual subjugation of the Five Phases, their cyclical generation and destruction without cease—can also steal life and death, the success and failure of all things; hence they are called Thieves.\n\nWhy does it say, *\"Those who perceive them thrive\"*?\nIf one merely understands the subjugating Dao/Way of the Five Phases and discerns the sources of yin and yang’s rise and fall, then following them is called perception.\nIf one perceives the Five Thieves and clearly understands them, it brings fortune—virtue flourishes.\nAgain, if one knows the Five Thieves, why hide them?\nThey reside in the heart, hence *\"the Five Thieves are in the heart.\"*\nOnce the heart knows them, one must use the mind to observe and follow the Five *qi*, discerning顺 (harmony) and逆 (contrariness) without error, aligning with Heaven’s intent without loss—then the cosmos lies in the palm, and all things arise from the body.\nThus, all undertakings prosper, and one moves in harmony with the Dao/Way—how could this not bring thriving?\n\nIn governance, if one upholds *rén* (benevolence), *yì* (righteousness), *lǐ* (propriety), *zhì* (wisdom), and *xìn* (faithfulness), then wealth, honor, and glory follow—how could this not bring thriving?\nIn military affairs, if one understands the顺 and逆 of the Five Phases, then victory in battle is assured—how could this not bring thriving?\nThus it is said: *\"Those who perceive them thrive.\"*\n\nIf one uses the Five Phases in their generative aspect, this aligns with virtue and the yang.\nIf one uses their subjugating aspect, this aligns with harm and the yin.\nThus the great masters of the Three Teachings all govern the world through principle; the scriptures they established speak only of cultivating goodness and calling it virtue/power, never of cultivating evil and calling it harm.\nThus, those who diligently cultivate virtue/power are aligned with the Dao/Way—they are the masters of yang.\nThose who indulge in yin’s evil and harm are demons—they are the essence of yin.\nBeyond this, myriad scriptures are but empty and vast in words.\nHence Confucius said: *\"In one word: ‘Think not evil.’\"*\nAnd again: *\"Choose the good and follow it; choose the ungood and change it.\"*\nThis is the supreme Dao/Way—why speak at length of cultivation?\n\nThe essence of the Dao/Way does not exceed this gate.\nThose who know the origins of Heaven and Earth’s yin and yang’s success and failure are fully revealed in the first chapter of the *Yinfu*.\nThe world sees few words and simple language, yet does not grasp its profundity—why seek it in the vast expanse of the Three Teachings’ scriptures?\nHence the Mother of Mount Li said:\n*\"To observe its refined principles, the Eight Scenes of the *Huangting* are insufficient for study;\nTo discern its utmost essence, the Classics and Histories are insufficient for exposition;\nTo employ its cunning intelligence, the strategies of Sunzi, Wu Qi, Han Fei, and Bai Qi are insufficient for ingenuity.\"*\n\n**Heaven’s nature is humanity.**\nThe human heart is the mechanism.\nEstablishing Heaven’s Dao/Way to govern humanity rests in the Five Thieves.\n\n**Commentary:**\nThe human heart is the seat of the spirit-soul (*hun*), the body the dwelling of the spirit (*shen*).\nThose who would wield the Five Thieves must first master the heart—thus those whose hearts align with the Dao/Way can plot and it will harmonize with Heaven’s operations.\nThough the cosmos may be vast, observation lies within the palm;\nThough myriad things exist, their life and death are governed by technique.\nHence it is said: *\"A rectified heart can repel evil.\"*\n\nWhen Heaven’s killing intent arises, dragons and serpents emerge on land.\nWhen humanity’s killing intent arises, Heaven and Earth reverse.\nWhen Heaven and humanity’s killing intents converge, the foundation of all transformations is set.\nHeaven’s killing intent is just retribution;\n\n「Humanity’s killing intent is private passion. Dragons and serpents heed public justice and tremble;\nPrivate passions in chaos, Heaven and Earth reverse.\n\nWhen Heaven and humanity unite in public justice, then myriad transformations and changes,\nall are fixed in their proper order.\n\n**Commentary:**\nHeaven contains the Five *qi* (vital energies), cyclically giving rise to life and death—\nthis is natural. Heaven’s Dao of life and death all conform to their proper occasions,\nnever acting arbitrarily. As yin and yang shift, eras pass, old gives way to new—\nthis too is Heaven’s killing intent, all of it just.\n\nRiding Heaven’s killing intent—whether as dragon or serpent—\nthe hidden and obscure all rise upon the heights and valleys.\nFollowing Heaven’s will and the times, acting freely in accordance,\nthis is to ride Heaven’s killing intent without losing its proper occasion.\n\nAs for humanity’s killing intent causing Heaven and Earth to reverse—\nhumans are children of the Five Phases, so they must conform to the Five *qi*’s life and death,\nsubmit to yin and yang’s nurturing influence. How can they presume to stir life and death on their own?\n\nEven in the world’s laws, those who kill are put to death,\nthose who kill living beings are punished—why? Because they act against Heaven’s ordained killing intent.\nHow can such people kill at will? It is said that humans must not act arbitrarily in killing intent.\n\nAs for traitorous ministers who rebel against proper order,\ndefy Heaven’s Dao, betray their sovereign and kin,\nindulge in cruelty and wickedness,\nharm the world, and recklessly slaughter—\ntheir chaos is like turning Heaven into Earth or Earth into Heaven.\nSuch great disorder is treason; Heaven’s greatest calamity—\nthis is called *Heaven and Earth reverse*.\n\nHere, the people’s resentment and the gods’ wrath converge,\nHeaven prepares to punish them, and the people join in killing them—\nall unite in their killing intent—\nthis is called *Heaven and humanity’s killing intents converge*,\nthe foundation of all transformations set.\n\nPunishing rebels and quelling traitors,\nfollowing Heaven’s will in execution—\nall align with Heaven’s proper killing intent.\nWhen one adheres to the just Dao,\nall things submit, none dare act recklessly—\nthis is called *fixed foundation*.\n\nThe Dao of ruler and subject is valued for its impartiality and rectitude.\nIf one can move and act in harmony with Heaven’s occasions,\nrespond to the times in accordance with Heaven’s Dao,\nthen humanity rests in peace, things find their proper place,\nthe Five Phases maintain their order, mountains and rivers preserve their spirits;\nAbove, moral virtue and power (*Dao* and *De*) are applied,\nbelow, benevolence and righteousness are practiced—\ndisasters do not arise, calamities do not occur,\nHeaven and humanity remain tranquil—\nthis is called *fixed foundation*.\n\nNature has its cleverness and clumsiness, which can be concealed.\nHuman cleverness and clumsiness must not be revealed;\nCultivate prudence in choosing what is good,\nlest misfortune arise.\n\n**Commentary:**\nHumans possess innate cleverness, clumsiness, and wisdom—\nboth the wise and foolish share these traits.\nYet why do those with slight cleverness and eloquence\nrush to display them, reckless of gain or loss,\nand openly invite calamity? Because they cannot conceal themselves,\ndo not restrain their hearts with caution,\nthus leading to their downfall.\n\nHence the *Dao De Jing* says:\n*\"Great eloquence seems taciturn, great cleverness seems clumsy.\"*\nThis speaks of concealment.\nThe *Yijing* says:\n*\"The ruler not concealed loses his subjects,\nthe subject not concealed loses his life,\nmatters not concealed invite harm.\"*\nThis is the same meaning.\n\nThose who can conceal—\neven if the sage and virtuous have cleverness, wisdom, eloquence,\nand vast learning—\nif their actions and stillness conform to proper occasions,\nthey need not be called clever. They can always conceal and hide,\nboth great and small, lest they be envied or slandered,\nand thus invite blame.\n\nMuch less the foolish and clumsy,\nwho act impulsively, stirring without restraint,\ndo not conceal themselves—\nthey immediately invite disaster.\nThe sage cultivates the Dao and nurtures virtue,\nso cleverness and clumsiness are concealed within body and mind.\nThen inwardly, they observe their true nature,\noutwardly, they avoid evil and licentiousness—\nwhat is good, they practice; what is not good, they abandon,\nrefining their bodies and actions to become a *sage*,\nso outsiders cannot know my innate cleverness or clumsiness.\nAll attribute my virtue to natural sageliness,\nnot knowing it is achieved through cultivation—\nthus it is called *concealment*.\n\nThe nine orifices’ evils reside in the three essentials,\nwhich can be stilled or stirred.\nIt is said that when a person’s nine orifices are all evil,\nthey can all give rise to illness—\nbut the most urgent evils of calamity and fortune lie in the three essentials:\nears, eyes, and mouth. Thus, one must guard them carefully,\nlest disaster strike.\n\n**Commentary:**\nThe *Nanhua* (Zhuangzi) says:\n*\"Humans have a hundred limbs, nine orifices, five viscera—\nbody them and preserve them. Humans receive the Five *qi* and take form,\nwith heads round and feet square, four limbs and five viscera,\nthree *hun* (spirits) and seven *po* (ethereal souls),\nalternately giving rise to evil and rectitude,\nmutually serving as sovereign and subject within the body.\nThe movement of the nine orifices—\nevil and rectitude, calamity and fortune—\nare most urgent in the three essentials:\nears, eyes, and mouth.\nThus the *Dao De Jing* says:\n*\"Five colors blind the eyes, five sounds deaf the ears,\nfive flavors dull the mouth.\"*\nThe virtuous do not let their eyes see evil colors,\ntheir ears hear evil sounds,\nor their mouths speak of evil matters—\nthus when proper matters arise, they see, hear, and speak accordingly—\nthis is called *stirring*.\nWhen encountering evil and falsehood,\nthey do not let their hearts see, hear, or speak—\nthis is called *stillness*.\nMaster Kong (Confucius) said:\n*\"Choose what is good and follow it—this is called stirring;\nchoose what is not good and abandon it—this is called stillness.\"*\nThe *Xiaojing* (Classic of Filial Piety) says:\n*\"In speech, fill the world without excess—\nin conduct, fill the world without resentment or evil—\nthis is because the body and mind are stilled and rectified, without evil,\nthus attaining this state.\"*\nBut when encountering good, one stirs;\nwhen encountering evil, one stills—\nthus the body remains free of calamity,\nall through guarding the ears, eyes, and mouth with caution.\nHence it is said:\n*\"Resides in the three essentials—\ncan be stilled, can be stirred.\"*\n\nFire arises from wood, calamity strikes and it is subdued.\nEvil arises in the realm, and when it stirs, it collapses.\nKnowing this and refining oneself—\nthis is called a *sage*.\nThe metaphor of *delinquent fire* refers to human nature,\n*wood-realm* refers to the human body.\nThis teaches one to govern the realm and preserve the body,\nso that delinquent fire does not arise—\nthen refine the body and actions to become a *sage.*」\n\nThe *Commentary* states:\n\nThis passage elaborates on the Sage’s intent in employing these metaphors. To reinforce the nine evils and three essentials of stirring and stillness from the preceding text, it urges constant vigilance, lest one fail to exhaustively grasp principle and refine nature. Thus, it invokes the metaphors of fire within wood and treacherous ministers within the realm to earnestly exhort cultivation toward sainthood.\n\nWood containing fire symbolizes the human heart harboring evil nature—five poisons’ flames. The *Grand Duke’s Commentary* states: Guangchengzi held that accumulated fire consumes the five poisons, thus knowing fire as the fierce *qi* of flame. The *Book of Documents* says: *\"Fire blazes upon Kun Mountain, reducing jade and stone to ash.\"* Wood concealing fire must not be pierced—once ignited, the wood burns. Likewise, if one neglects the evil poisons within the body and indulges them, all virtues perish, and the self collapses.\n\nWhen treachery arises in a realm, it inevitably crumbles when stirred. For any nation, there exist treacherous ministers and traitors, harboring malevolent designs to usurp power, seeking wealth and honor—such schemes abound, concealed within the state, unknown to the ruler. Yet if the sovereign embodies virtue and ministers remain loyal, the land thrives in harmony, and the world knows peace. Treacherous men, though harboring such intentions, dare not act without opportunity. But when the ruler’s Dao falters, ministerial loyalty decays; wars, floods, droughts, and locusts ravage the land; taxes grow oppressive; the people’s hearts turn rebellious, resenting their sovereign. In such times, all things harbor disorder—how much more so those already harboring treachery? When chaos reigns, all deceits erupt, and how could the realm not collapse?\n\nThis metaphor extends to the nine orifices and three essentials—skillful or clumsy, stirring or still. It teaches that if one possesses virtue and wisdom, hidden within body and mind, no evil or impurity can arise. But if evil erupts unchecked, the self dissolves. Thus, the metaphor of treacherous fire concealed in wood/realm illustrates the duality of evil and rectitude within body and mind.\n\nOnly the wise and sagely comprehend this text, penetrating its depths, awakening to the Dao’s essence, purging vice and preserving virtue—this is the knowing and refining that yields sainthood.\n\nHence it is said:\n*\"Above, there exists the Dao of the Immortal Embracing Unity—\nYellow Emperor attained it to ascend to the Cloudy Heights,\nTang and Wu obtained it to rule the world.\"*\n\nThe *Nüwa of Mount Li* states:\n*\"The Sage studies the Dao and attains its Way,\nharmonizing with Heaven’s timing,\nnurturing virtue within,\ntrusting the worthy without—\nknowing and refining to become a Sage,\nthus ascending to the Cloudy Heights, as Yellow Emperor did.\"*\n\nThe *Adept* studies the Dao and grasps its method,\naligning with the five phases’ rectitude,\nneither defying Heaven’s timing nor Earth’s order,\nsparing neither wealth nor life,\nenriching the realm and securing the people—\nthus attaining the method, the virtuous ruler, as Yao and Shun did.*\n\nThe *Wise* studies the Dao and masters its technique,\nemploying Heaven’s Way and Earth’s resources,\ndisciplining the body and moderating desires to honor parents,\nupholding *ren*, *yi*, *li*, *zhi*, *xin*,\nloyalty, filial piety, and reverence for kin,\nremaining steadfast in integrity and modesty,\npreserving one’s rank and blessings—\nthus attaining the technique, as the virtuous ministers Qiu and Yi did.*\n\nThe *Petty* studies the Dao and reaps its calamity,\nperverting Heaven’s *qi* and failing to cultivate virtue,\nexploiting cunning, eloquence, and deceit,\nengaging in ceaseless night-and-day rebellion,\nwaging wanton wars,\nconcocting plots to slaughter and harm,\npursuing fleeting luxury and plunder,\nthough briefly wealthy and honored,\nthey heed not the impending ruin,\ninviting their own and their descendants’ destruction—\nthis is reaping the calamity, as Lu Shan and Shi Ming did.*\n\nThe *Sage-Mother* further declares:\n*\"This text is profound, vast as the morning tide of the great sea,\nencompassing myriad phenomena, its mysteries divine.\nThis is the chapter of the Immortal Embracing Unity,\none hundred and five words,\nilluminating the Dao of yin and yang,\ndiscerning the logic of rise and fall,\nactivating its mechanisms with precision—\nthus refining body and conduct to become a Sage.\"*\n\nHence it is said:\n*\"Above, there exists the Dao of the Immortal Embracing Unity.\"*\n\nThe *Praise* reads:\n*\"Heaven’s Dao responds to the times,\nyin and yang, most divine.\nDiscern its essentials,\nlife and death rest in the self.\nThe enlightened act rightly,\nthe deluded stray from truth.\nKnowing and refining—\nthis is called a Sage.\"*\n\n*The Yellow Emperor’s* *Yin-Shu Commentary*, Volume One, concludes.\n\n---\n*Annotations (as per instructions, omitted in output but noted for consistency):\n- 五毒 (*wǔdú*): Five poisons (in Daoist/TCM, often lust, anger, greed, folly, and ignorance).\n- 广成子 (*Guǎngchéngzǐ*): Daoist sage associated with *Zhuangzi*.\n- 玉石俱焚 (*yùshí jù fén*): \"Jade and stone alike burn\" (from *Book of Documents*).\n- 九窍 (*jiǔqiào*): Nine orifices (eyes, ears, nostrils, mouth, anus, urethra).\n- 三反 (*sānfǎn*): Three rebellions (against Heaven, Earth, parents).\n- 黄帝阴符经 (*Huángdì Yīnfǔ Jīng*): *Yellow Emperor’s Classic of the Dark Symbol*.\n- 少室山李筌疏 (*Shàoshì Shān Lǐ Quán Cóng*): *Commentary by Li Quán of Mount Shaoshi*.\n- 禄山 (*Lùshān*): An Lushan, rebel against Tang.\n- 思明 (*Sīmíng*): Shi Siming, An Lushan’s successor.\n- 神仙抱一 (*Shénxiān bàoyī*): \"Immortal Embracing Unity\" (Daoist alchemical concept).\n- 黄帝得之以登云天 (*Huángdì dé zhī yǐ dēng yúntiān*): \"Yellow Emperor attained it to ascend to the Cloudy Heights\" (mythic Daoist transcendence).\n- 圣母 (*Shèngmǔ*): Likely refers to a Daoist or alchemical \"Sage-Mother\" figure (e.g., Xi Wangmu or a textual personification).\n- 依五行之善正 (*yī wǔxíng zhī shànzhèng*): \"Aligning with the five phases’ rectitude.\"\n- 仁义礼智信 (*rényìlǐzhìxìn*): The Five Virtues (Confucian).\n- 贞廉不失 (*zhēnlián bùshī*): \"Steadfast in integrity and modesty.\"\n- 保其禄位 (*bǎo qí lùwèi*): \"Preserving one’s rank and blessings.\"\n- 夔龙、伊尹 (*Kuí Lóng, Yī Yǐn*): Mythic and historical sage-ministers.\n- 三反昼夜 (*sānfǎn zhòuyè*): \"Ceaseless night-and-day rebellion\" (against natural order).\n- 黩武 (*dúwǔ*): \"Wanton warfare.\"*\n- 烦兵 (*fánbīng*): \"Excessive militarism.\"\n\n**Rich Nation, Peaceful People: The Doctrine of Theft**\n\nHeaven and Earth, the thieves of all things.\nHeaven covers, Earth bears—all things grow in secret,\nQi surging unseen—thus they are called thieves.\n\n*Commentary:* Heaven and Earth are yin and yang.\nYin and yang, extending to the Five Phases,\nTogether form the Seven Qi—\nBeyond this, how could there be greater confusion?\nFor all things—whether born from egg, womb, or dampness—\nGrains, grasses, and trees all draw upon these Seven Qi to grow,\nFrom formless to formed, nurtured unseen until their bodies take shape—\nLike thieves in the night, unaware and unknowing.\n\nHeaven and Earth secretly respond with their Qi in endless interplay,\nWhile all things silently accept their nurture, each finding its place of ease.\nThus it is said: *Heaven and Earth, the thieves of all things.*\n\nAll things are thieves of humanity;\nAll things steal from Heaven to sustain life,\nWhile humanity steals from all things to nourish itself.\nIf one knows the proper balance of giving and taking,\nThis too is the natural order.\n\n*Commentary:* Humanity and beasts, grasses, and trees all draw from yin and yang to live,\nBut humanity is the most refined—\nDwelling in the central palace of the cosmos,\nWith wisdom and discernment to reflect upon its nature,\nTo fathom origins and understand the fundamental Qi of yin, yang, and the Five Phases,\nThen to model its actions accordingly.\nThus the *Zhou Yi*’s sixty-four hexagrams and sixty jia-zi cycles.\n\nTherefore, the earlier text says: *To see this is to flourish.*\nWithin the Seven Qi, all things that form and grow,\nHumanity secretly takes to sustain itself—\nThus, theft refers to fields, silkworms, and grains.\nThe *Liezi* says:\n*A certain Guoshi of Qi was wealthy and declared,*\n*\"I excel at theft! Heaven has its seasons, Earth its advantages—\nI steal the timely bounty of Heaven and Earth.\nWhen rains moisten the earth, I steal from beasts on land,\nFrom fish and turtles in water.\nI began as a thief—\nIn one year, I was self-sufficient;\nIn two, I had abundance;\nIn three, I could bestow upon the realm.\nSince then, my wealth extended to the common folk.\nI stole from Heaven and Earth without misfortune.\nBut if a man steals gold and silk from another—\nHow can he be blameless?\"*\n\nAll things steal from Heaven and Earth to grow,\nGuoshi stole from all things to sustain himself—\nYet if one knows the proper balance,\nThis too is the natural order.\nThus, the theft of all things and humanity.\n\nHumanity, the thief of all things.\nWhen the three thefts align in harmony,\nThe Three Powers flourish in peace.\n*Ji* means \"exhausted\"—\nWhen the three thefts exhaust their proper balance,\nThe Three Powers exhaust their duties in harmony.\n\n*Commentary:* It is said that humanity steals from all things to fill its wealth and rank,\nYet it does not realize that all things, in turn, steal from humanity to bring misfortune.\nThe three mutual thefts spoken of earlier—\nThis too is the natural order.\nAll such theft must follow the Dao;\nIf in accord, it brings fortune;\nIf contrary, it brings calamity.\nThus the *Liezi* asks: *Is there a Dao of theft?*\nWhy should it be without principle?\nTo see hidden treasures—*this is sageliness;*\nTo know what is permissible—*this is wisdom;*\nTo enter first—*this is courage;*\nTo depart last—*this is righteousness;*\nTo divide fairly—*this is benevolence.*\nNo thief without these five virtues exists.\nThis is the Dao within theft.\n\nIn the three thefts, each must follow its principle,\nSo that the Three Powers act without error,\nTheir duties fulfilled without exceeding their nature,\nLest misfortune arise.\nThus it is said:\n*Eat in season, and the body remains unharmed.*\n*Stir the mechanisms, and all transformations are at peace.*\nIf humanity’s nourishment is timely,\nThe body knows no fault;\nIf actions align with their proper function,\nAll things find their ease.\n\n*Commentary:* Those who govern life and fate\nMust first attend to flavors and nourishment.\nThus the *Zuozhuan* says:\n*\"Flavor and the Dao’s Qi—\nQi fills the will, nourishes the form, and moistens the spirit—\nAll must return to food and drink.\"*\nThe Yellow Emperor said:\n*\"When humanity consumes food and drink,\nIt must first balance the five flavors, five meats, five vegetables, five fruits,\nAll adjusted to the seasons and taken in proper measure.\nCooked, they benefit the body;\nRaw, they harm the organs—\nThis is the meaning of eating in season.*\nThus, if food is consumed at the proper time,\nIf flavors do not exceed their due,\nIf one remains within the middle path,\nNeither transgressing nor harming nature,\nThen the four limbs move freely,\nThe five organs remain in harmony,\nFree of illness, preserving life to its end—\nIs this not the body’s ease?\"\n\nThus the *Kangzangzi* says:\n*\"Eat abundantly in winter, and the body stays warm;\nEat abundantly in summer, and the body stays cool.\nIf warmth and coolness align with the seasons,\nThen humanity knows no sickness or plague,\nAnd lives out its natural span.*\nThus it is said:\n*Grains are humanity’s Heaven—\nThe reason kings prioritize agriculture;\nIf a king neglects agriculture, he abandons his people.\nIf the people are abandoned, what kingdom remains?\"*\n\nYet when the three thefts align in harmony,\nAnd the Three Powers fulfill their duties in peace,\nThis too is the natural order.\nThen, a wise ruler and virtuous ministers must govern the world,\nRiding the moment when harmony and peace prevail—\nWith just laws, employing the capable,\nExtending benevolence to insects,\nTransforming even grasses and trees,\nSo that every action conforms to Heaven’s mechanisms,\nAnd yin and yang follow their course,\nBringing universal tranquility,\nEnsuring all people find their ease.\nThis is to *stir the mechanisms and bring all transformations to peace*—\nThus it is said: *Within lies the law of enriching the nation and pacifying the people.*\n\nHumanity knows its spirit as spirit,\nYet does not know that the unknowable is what makes it spirit.\nYin and yang generate all things—humanity calls this spirit;\nYet it does not know that the Ultimate Dao,\nSilent and still, is what generates them—\nYin and yang are the true spirit.\n\n*Commentary:* Spirit is subtle and unfathomable.\nThe *Yi* says: *Yin and yang, when unfathomable, are called spirit.*\nHumanity sees all things born from yin, yang, and the sun and moon,\nAnd calls this spirit—\nYet it does not realize that yin, yang, sun, and moon\nThemselves arise from the unmanifest.\n\nWhat is this \"not-spirit\"?\nIt is the Ultimate Dao.\nThe Ultimate Dao is empty and tranquil,\nSilent and still, yet not-spirit—\nWithin this \"not-spirit\" arise sun and moon,\nYin and yang, the Three Sovereigns, and all things,\nNurturing growth and securing ease and comfort,\nAll emerging from the Ultimate Dao’s empty tranquility—\nThis is the \"not-spirit\" yet containing spirit,\nThe principle now made clear.\n\nThe sun and moon have their appointed cycles,\nThe great and small have their fixed measures.\nFrom this arises the sacred function,\nAnd from this emerges the divine luminosity.\nWhen the sun and moon revolve without deviation in their cycles,\nAnd the great and small maintain their fixed measures,\nThen the sacred function’s power is revealed,\nAnd the divine luminosity’s work manifests.\n\n*Commentary:* The sun and moon are the essence of yin and yang.\nWithin the Six Extremes, they are the Ultimate Dao.\nThe cycles of the sun and moon,\nThe fixed measures of the great and small in calendars and regulations,\nAll have their appointed divisions,\nRevolving without deviation—\nThus it is said: *\"The sun and moon have their appointed cycles, the great and small have their fixed measures.\"*\nThe sacred function arises within the Six Extremes,\nRelying on the sun and moon’s illumination,\nAnd the interplay of yin and yang,\nTo generate all things—\nPlants and animals, each with their movements,\nTheir power subtly profound, reaching even to the sacred.\nThus it is said: *\"The sacred function arises from this.\"*\nThe divine luminosity emerges from this:\nYin and yang, unfathomable, are called spirit;\nThe sun and moon, clear and luminous, are called luminosity—\nThus it is said: *\"The divine luminosity.\"*\nAll things in the world,\nGreat and small, arise from the sacred function and divine luminosity—\nFrom non-being to being, their functions and uses clearly manifest—\nThus it is said: *\"The divine luminosity emerges from this.\"*\nMoreover, all things in the world,\nGreat and small, receive this sacred function and thus exist.\nThe great does not covet the small,\nThe small does not slight the great—\nThus *Zhuangzi* says: *\"The great and small each find ease in their own way, without envy or reproach,\"*\nThis is the meaning of *\"the great and small have their fixed measures.\"*\nFrom the highest nobles to the lowest commoners,\nEach has their appointed fate,\nWithout mutual encroachment or usurpation—\nAbove and below in harmony,\nYears of abundant harvests and prosperous seasons,\nThis is called the Great Peace.\nThus it is said: *\"Within lies the law of enriching the nation and pacifying the people.\"*\n\nAs for *stealing the mechanisms*,\nNo one in the world can see them,\nNo one can know them.\nThe virtuous who obtain them secure their bodies,\nThe petty who obtain them risk their lives.\nStealing the mechanisms is profound and subtle,\nEasy to see yet difficult to know.\nThe virtuous understand the mechanisms of accumulating virtue,\nThus securing their bodies;\nThe petty grasp the mechanisms of honor and disgrace,\nThus risking their lives.\n\n*Commentary:* Stealing the mechanisms refers again to the three thieves from earlier.\nIf a kingdom or family steals from Heaven to gain wealth,\nAll see the mechanisms of sowing and reaping,\nYet none know the profound principles behind their gains.\nWhy is it called *stealing the mechanisms*?\nBecause they take from where there was none before,\nAnd exploit where there was abundance before—\nIn secret they contrive schemes,\nMoving the mechanisms without awareness,\nUnknowingly plundering what is to come,\nTo enrich themselves—\nThis is called *stealing the mechanisms*.\nIt is said that all under Heaven see this stealing,\nYet none can know its profound principles.\nAmong the wise, the petty, and the virtuous,\nTheir perceptions differ—\nThe virtuous know the mechanisms of securing their bodies,\nThe petty know the mechanisms of risking their lives.\nThe mechanisms of securing the body:\nThe virtuous know that within the Ultimate Dao lies all virtue,\nAnd whatever they seek will surely be attained—\nLike echoes answering calls.\nThey merely set forth their virtuous schemes,\nSilently cultivate their practices,\nActivating the habit of virtue,\nIn harmony with the Dao—\nThus they achieve *guard-one and ponder*,\nConcentrating their essence and refining their nature,\nStealing the profound mysteries to nourish their lives,\nOr stealing *spirit-water, flower-pools, jade-essence, golden elixirs*\nTo attain immortality.\nThe worthy and virtuous, knowing these subtle mechanisms,\nCultivate and refine to become sages.\nThus it is said: *\"The virtuous who obtain them secure their bodies.\"*\n\nThe petty who obtain them risk their lives:\nThey only seek to amass gold and silk,\nSpurning no labor.\nOr they cultivate talents, skills, and martial arts,\nWithout regard for exhaustion,\nAdorning their cleverness and cunning to seize the mechanisms of worldly glory;\nOr they revel in honor and favor,\nOr in military defeat and ruin,\nTheir greed harming themselves;\nOr they indulge in wealth and lust,\nThough they gain fleeting glory,\nThey inevitably incur calamity and blame.\nIt is because they do not know the subtle mechanisms of the Dao,\nAnd instead rely on these.\nThus it is said: *\"The petty who obtain them risk their lives.\"*\n\nWithin this chapter on *enacting the laws of enriching the nation and pacifying the people*,\nAll ninety-two words instruct people in taking and discarding according to their mechanisms,\nIn discerning the divine luminosity of the Dao,\nAnd in securing their bodies and nurturing their lives through its profound principles.\nThus it is said: *\"Within lies the law of enriching the nation and pacifying the people.\"*\n\n*Praise:*\nHeaven and Earth, all things,\nYin and yang, the four seasons.\nMutually stealing from each other,\nPrecious in aligning with Heaven’s mechanisms.\nThe sacred function and divine luminosity,\nOnly the worthy can know.\nSecuring the body or risking the life—\nCarefully examine their suitability.\n\n*Conclusion of the Second Scroll of the Yellow Emperor’s Yinshu Commentary*\n*Beginning of the Third Scroll of the Yellow Emperor’s Yinshu Commentary*\n\n「Li Qin’s Commentary on *Yinshu* from Shaoshan:\n**Chapter on the Dao of Military Strength and Victory**\n\nThe blind excel in hearing, the deaf excel in sight.\nCut off one source of profit, and the use of troops becomes tenfold advantageous;\nThreefold reflection day and night, and the use of troops becomes ten thousandfold advantageous.\n\n*Cutting off profit* means:\nSeal the ears to see clearly, close the eyes to hear keenly,\nStrive to keep body and mind unperturbed, and focus the mind on affairs with precision.\n\nThe commentary says:\nWhen a man’s eyes are greedy for color, his ears fail to hear the true sound;\nWhen his ears indulge in lewd music, his eyes cannot behold the proper hue—\nFor sight and hearing are both governed by the mind.\n\nThe virtuous Daoist’s mind is free from deceit,\nThough his ears and eyes perceive myriad sounds and hues,\nHis mind remains steadfast and pure,\nUnshaken by love, desire, or avarice—\nEqual to one without ears or eyes,\nWhy must he be blind or deaf?\n\nOnly when the mind harbors rectitude,\nDo ears and eyes remain untainted;\nWhen ears and eyes are untainted,\nDo body and mind remain unperturbed;\nWhen body and mind are unperturbed,\nDo all actions, thoughts, and strategies align with Heaven’s Dao.\n\nCompared to the common man, this yields tenfold advantage.\nAll undertakings succeed—\nWhy must one rely solely on military strength?\n\nOthers follow this principle likewise.\nThreefold reflection day and night makes military strength ten thousandfold advantageous,\nFor the virtuous Daoist’s body and mind are steadfast,\nHis ears and eyes are sharp,\nHis actions and strategies tenfold more effective than the ordinary.\nWithin this, if he further practices threefold deliberation,\nDay and night with unwavering focus,\nHis actions and strategies become ten thousandfold more potent—\nWhy must he rely solely on military strength?\n\n*The Analects* states:\n“Think thrice before acting; twice, and it may be acceptable.”\nThis urges the mind to be meticulous and discerning—\nSuch is its meaning.\n\nWhat is meant by *troops* is *arms*.\n*Arms* are instruments of slaughter,\n*War* is a perilous affair.\nWhen stationed in lands of conflict or amid crises of life and death,\nOne must reflect threefold and deliberate deeply,\nPlan with foresight and strategy—\nIf he is negligent in counsel, reckless in advance or retreat,\nHe will surely meet defeat.\n\nThus, this teaching of sealing the ears and eyes,\nAnd of threefold reflection,\nIs likened to military strength\nTo compel one to refine his body through cultivation,\nNot to truly wield troops.\n\nThe virtuous Daoist detests evil as a sworn enemy,\nUnderstanding the source of *cutting off profit*\nAnd the principle of *threefold reflection*,\nHe remains profound, cautious, and unyielding,\nHis nature aligned with rectitude, his dwelling steadfast,\nRooting out the wicked and the sycophant—\nThus securing his own life for long.\nIn time, this becomes the Dao,\nAs when the Yellow Emperor subdued *Chiyou*.\n\nEven great generals of past and present—\nSunzi, Wuqi, Han Xin, Bai Qi, Zhuge Liang, and Wei Gong—\nAll excelled in military strategy,\nMastering threefold reflection day and night,\nAchieving success and establishing their names with honor.\nYet they still considered military strength and victory\nAs means to *lighten the burden of life*,\nForcing one to risk his fate—\nAs the Yellow Emperor did when ascending to the Cloudy Heights,\nAnd *Fuyue* did when dwelling in the *Xuanxiao* abyss.\n\nHence the earlier text says:\n“The noble attains security in his person; the petty man risks his life.”\n\nThe mind arises from things, perishes from things; the key lies in the eyes.\nWhen the mind is greedy for things, it shortens one’s lifespan;\nWhen the eyes gaze without restraint, the will becomes dissipated.\nBut if one guards the eyes and restrains the mind,\nThere will be no calamity or ruin.\n\nThe commentary says:\nThe virtuous Daoist’s mind does not give rise to falsehood,\nHis faculties do not move erratically,\nYet he attends to all things.\nBut those who indulge in excess,\nTaking all things to nourish their bodies and sustain their lives,\nAlso follow nature’s way—\nYet they must not overstep their bounds or act contrary to propriety,\nOr they will harm their own nature.\n\nHence *Gang Cangzi* says:\n“If ten thousand men each draw a bow,\nAnd shoot at a single target,\nNo arrow will miss.”\nThe target is a *mound*—\nOr it is said: the target is the *arrowman*.\nAll things are clearly visible,\nYet they harm but one life—\nA life that will surely be injured,\nFor the sake of nourishing its nature and sustaining its vitality.\n\nIn this age, the deluded take nature to nourish things,\nUnknowing how to rest and preserve themselves.\nThis speaks of how the mind, once greedy,\nIs stolen by things,\nBringing ruin and disaster to man.\n\n*The Family Sayings* states:\n“Those who indulge without restraint,\nWho seek without end,\nShall be punished with death.”\n\n*The Laozi* says:\n“Knowing contentment brings no disgrace,\nKnowing when to stop brings no peril.\nThis is the way to endure.”\n\nThus, the precious lesson is *knowing contentment*.\nModeration in all things,\nNot straining the mind with avarice for external gain,\nOr harming one’s true nature—\nThis is the path that does not injure.\n\nHence *Liuzi* says:\n“The meaning of nurturing birds in a firewood grove,\nAnd fish in a warm spring—\nIs to live by things, yet perish by things.”\n\n*Key lies in the eyes* means:\nWhen one’s movements give rise to falsehood,\nWhen the mind is drawn to things—\nAll originate from self-perception.\nThus it is said: *Key lies in the eyes*—\nCommand one to be vigilant in guarding them,\nNot to gaze upon lewd or licentious hues,\nSo that the mind does not generate false movements toward things,\nAnd thus his nature remains unharmed,\nSecuring his lifespan and preserving his person.\n\nHeaven’s nature is without favor yet great favor is born;\nHeaven and Earth give birth yet do not possess,\nThey act yet do not claim,\nNourishing all things without seeking repayment—\nYet all things, moved by their shelter and sustenance,\nGenerate favor in return.\n\n*End of the Third Scroll of Li Qin’s Commentary on the Yellow Emperor’s Yinshu*」\n\n「The *Commentary* states: Heaven and Earth, along with all ten thousand things, are naturally possessed. These are all nurtured by the supreme **Dao/Way**, which does not seek favor or repayment from all things. Instead, all things, receiving Heaven’s shelter and sustenance, naturally harbor gratitude toward Heaven. Hence, *Laozi* says: *\"Give birth yet do not possess; act yet do not claim; nourish yet do not slaughter.\"* When thunder crashes and winds rage, all tremble in fear. Thunder and wind arise from the movement of yin and yang; people naturally feel dread, and thus they tremble and are startled.\n\nThe *Commentary* states: **Thunder** is the sound of yin and yang clashing violently; **wind** is what *Zhuangzi* calls: *\"The Great Mass exhales **qi**—its name is wind.\"* All such winds and thunders are inherent to yin and yang, originally not meant to threaten humans, yet humans fear them, trembling and moving in response, filled with awe.\n\nThis describes the **Dao/Way** and **virtue/power** of the sage-ruler, who nurtures all living beings, mirroring Heaven and Earth’s lack of partiality. Thus, the land, the people, birds and beasts, plants and trees all spontaneously return their gratitude to the ruler, revering him as Heaven itself, each abiding by their station and prospering in their endeavors, all in perfect ease.\n\nA wise ruler merely implements just decrees, establishing the national order. When the people witness his authority, like the crashing thunder and raging winds, they tremble and are filled with fear, each self-alert and cautious in their conduct. Thus, in governing armies, generals become bold and soldiers strong, with the ruler inspiring fear below and commanding awe above, ensuring the suppression of tyranny and the pacification of chaos. Hence it is said: *\"There lies below the means to forge strong armies and conquer foes.\"*\n\n**Extreme joy** is a surplus of nature’s ease; **extreme stillness** brings forth **virtue/power**. When one upholds the utmost **virtue/power** of stillness and joy, the heart knows no fear or dread; when one’s emotions embrace delight and ease, there is boundless **adventure** and freedom.\n\nThe *Commentary* states: **Extreme joy** is not the frivolous music and revelry of strings and pipes. If one sought such pleasures, there would be no surplus. Hence, *The Family Sayings* say: *\"Extreme joy is silent, yet all under Heaven find peace.\"* *The Three Strategies* say: *\"A **Dao/Way**-governed ruler governs through joy.\"* This means that the virtuous sage, with a tranquil mind and rectified nature, does not deceive the world nor yield to temporal trends, ruling the state and securing the home without wanton punishments or excessive penalties, never transgressing the national order. The sage’s person remains unblemished, with no cause for fear or dread, and thus the heart naturally overflows with delight, emotions serene and at ease, with **adventure** and freedom in abundance. How could such **extreme joy** be compared to the fleeting pleasures of strings and pipes?\n\nAs for the ancients, they played the zither while gathering fallen grains, sang as they walked while awaiting their fate—hence it is said: *\"**Extreme joy** is a surplus of nature’s ease.\"* In **extreme stillness**, one who upholds **virtue/power** does not indulge in the vulgarities of the petty man, nor in the licentious pleasures of strings and pipes. Instead, they preserve their own fearless and carefree delight. Thus, they are not swayed by sounds and colors, maintaining a still nature, serene emotions, a steadfast spirit, and resolute **virtue/power**.\n\nGāng Cāngzǐ says: *\"Nobility brings harmony in speech; wealth brings harmony in the body; poverty brings harmony in thought; stillness brings harmony in the spirit.\"* These four harmonies stem from a single principle, hence they are called **extreme joy** and **extreme stillness**. When a person attains **extreme stillness**, they can achieve harmony of the spirit, which is why it is said: *\"**Extreme stillness** brings forth **virtue/power**.\"*\n\nThe nature of a military commander must uphold **virtue/power** and stillness, suppressing clamor and disorder. Rewards and punishments must be precise and just; father and son serve as one in the army, their hearts filled with joy, their spirits overflowing with vigor. Yet they can crush the wicked and vanquish enemies, their achievements certain to flourish. Hence it is said: *\"There lies below the means to forge strong armies and conquer foes.\"*\n\nFor the commander who dwells in the balance of spirit and stillness—what is called *guarding the center*—the six passions are untainted, and the two **qi** currents remain constant. Heaven’s utmost **privacy** manifests in its utmost **publicity**. The **Dao/Way** of Heaven is profound and elusive, beyond measure or scrutiny—this is its **privacy**. Yet all things are born and formed, their sacred functions evident and clear—this is its **publicity**.\n\nThe *Commentary* states: Heaven is the supreme **Dao/Way**. The supreme **Dao/Way** encompasses all classes of existence, its depths unfathomable and formless, beyond scrutiny—this is called **privacy**. Privacy refers to that which is hidden and concealed. Within the boundless void, it applies itself infinitely, giving birth to all things, each with their own form and name as they arise. This is the utmost **publicity**. Publicity means clarity and evident function, observable by all.\n\nThis describes the **Dao/Way** and **virtue/power** of the sage-ruler: their wisdom and foresight are vast, encompassing all affairs. Their strategies are both subtle and direct, their judgments both cunning and straightforward, all concealed within their profound mind, beyond human perception—this is **privacy**. Yet when they act, observing good and evil, discerning right and wrong, issuing decrees, and meting rewards and punishments, their actions are clear and evident, serving as a model for all under Heaven—this is **publicity**. Hence it is said: *\"Heaven’s utmost **privacy** manifests in its utmost **publicity**.\"*\n\nThe nature of a military commander, when they apply this principle with secrecy and cunning, making their schemes difficult to discern, and their rewards and punishments evident like thunder and wind, ensures that the leader remains pure while the soldiers are upright. Generals become bold and soldiers strong, crushing enemies and vanquishing the wicked, their achievements grand and flourishing. Hence it is said: *\"There lies below the means to forge strong armies and conquer foes.\"*\n\nThe method of birds lies in their **qi**. The **peng** bird soars to nine heavens, gathering **qi** to ascend; the **tiáo** and **jiū** birds flap their wings and rise swiftly. All can control their **qi**, moving forward and backward with freedom.\n\nThe *Commentary* states: Birds are the feathered and transformed creatures of the ten thousand things. **Qi** is the vital **qi** of Heaven and Earth, yin and yang. Human movement relies on hands and feet for advancement and retreat; birds rely on wings and feathers to agitate their **qi**. When the mind moves, the wings beat, and there is no place they cannot reach—ascending and descending as they will. How much more so for humans, the most refined of beings, who cannot even properly harness the **Dao/Way** and **virtue/power** of Heaven’s **qi**? They should instead cultivate their bodies and nourish their lives to achieve longevity and eternal vision.\n\nIf humans could master the **Dao/Way** and **virtue/power** of **moral qi**, they would wander effortlessly through the boundless **Great Void (Tàixū)**, surpassing even birds. For a military commander who skillfully employs the **qi** of the Five Phases in their cycles of flourishing and decline, and understands the sources of yin and yang’s control and subjugation, crushing the wicked and vanquishing enemies would be no challenge at all. Hence it is said: *\"There lies below the means to forge strong armies and conquer foes.\"*\n\n**Life** is the root of **death**;」\n\n「**Death** is the root of **Life**#1; the foolish cling to things and covet **Life**, thus hastening their own **death** by defying its natural principles. The virtuous sacrifice themselves to seek the **Dao/Way**, and those who grasp its subtlest **virtue/power** preserve their bodies without perishing. The *Cūshu* explains: This speaks of how mortals in this world, greedy for **Life** and loathing **Death**, indulge their own bodies excessively, fearing annihilation.\n\nTo nurture **Life** and body, one must depend on food, drink, clothing, and shelter—these too are the natural principles of Heaven. Hence *Zhuangzi* says: *\"Till the soil and eat; weave and wear.\"* Their **virtue/power** does not stray. To weave and wear, to till and eat—this is called **harmony of virtue/power**.\n\nThus it is known that **Life** must rely on the nourishment of clothing and food. Yet moderation and frugality bring fortune, while excess and indulgence invite calamity and harm **Life** itself. Even the ancients, dwelling in nests and caves, with simple and pure natures, knew nothing of longevity or brevity, following only the natural course and wandering at ease, their years long and enduring.\n\nIn later generations, the true **Dao/Way** was lost, superficiality arose, and palaces were grandly built with ornate dwellings, silken garments, and rich delicacies. They overindulged in luxuries, fearing their bodies might not thrive, yet they failed to realize that over-nurturing exhausts the mind, harms the thoughts, and in truth invites disaster—the very foundation of hastening **Death**. Hence it is said: **\"Life** is the root of **Death**, and **Death** is the root of **Life**.\"\n\nYet the **Dao/Way**-virtuous cultivate **Life** by self-sacrifice and ceasing toil, seeking the art of longevity. Some may dine on mist and wear **qi**, abstaining from grains and food, their hearts like cold ashes, their bodies withered as dry wood. To the world, they appear as symbols of **Death**, yet they truly grasp the foundation of **Life**. Hence it is said: **\"Death** is the root of **Life**.\"\n\nFor a military commander who understands that **Life** is but **Death** in waiting, and that **Death** can bring forth **Life**, they can safeguard their troops and preserve the multitude, becoming a great general. Hence the military arts say: *\"Drive the army to the brink of **Death** and bring it back to **Life**.\"* This is the method of strong armies and victory in battle.\n\n*Zhuangzi* says: *\"Life and death are simultaneous; death and life are simultaneous.\"* **Grace** arises from **harm**; **harm** arises from **grace**. The **Dao/Way**-virtuous strive for good and feel **grace**, thus **grace** arises from **harm**; the petty betray **grace** and invite **harm**, thus **harm** arises from **grace**. The *Cūshu* explains: This speaks of how human hearts incline or turn away, with **grace** and **harm** mutually generated.\n\nIn truth, there is neither **harm** nor **grace** inherently. When one rescues from **harm**, **grace** emerges—thus **grace** arises from **harm**. Even when the **Dao/Way**-virtuous face minor misfortunes, and others save them, they hold **grace** in their hearts and feel gratitude, never forgetting it in their lifetimes—this is **grace** arising from **harm**.\n\nYet when the petty receive the **grace** of the **Dao/Way**-virtuous and enjoy honor and wealth, failing to guard it with caution from beginning to end, they rely on favor but lose their standing, fall into legal ruin, and unaware of their own faults, breed resentment and **harm**—this is called **harm** arising from **grace**.\n\nThe **Dao/Way**-virtuous, moved by Heaven and Earth’s nurturing **grace**, do not betray the **virtue/power** of the **Dao/Way**’s creation. They cultivate goodness and rectify their conduct, returning to simplicity and the origin, thus no **harm** can arise from **grace**, nor can **grace** emerge from **harm**. They do not let **grace** and **harm** disrupt their nature, but uphold stillness and silence to generate purity and harmony.\n\nAs for those who let **grace** and **harm** cycle endlessly, and whose favor and disgrace alternate ceaselessly, these are the petty’s ways.\n\nFor a military commander, they bear no debt to the imperial **grace**, do not grow arrogant from honor or favor, and guard their virtue with the same care from beginning to end. They preserve the **grace** of their virtue, exhaust all efforts in loyalty, achieve success and establish deeds—thus **grace** cannot arise from **harm**, nor can **harm** emerge from **grace**. When they govern with **Dao/Way** and **virtue/power**, they march with purpose but do not wage war—how splendid!\n\nHence it is said: *\"There lies below the means of strong armies and victory in battle.\"* The foolish take Heaven and Earth’s patterns and principles as divine omens, while I see the patterns and principles of the times and things as profound wisdom. The foolish, seeing stars falling or solar halos, winds and rains, thunder and lightning, floods and droughts, locust plagues, grow anxious and fearful, yet they fail to recognize that the **virtue/power** of ruler and subject is harmonious, and the governance pure and balanced.\n\nThey pacify the common folk, turning calamity into fortune, and through this wisdom of the times and things, only the **Dao/Way**-virtuous and I know it. Hence Heaven and Earth hang the sun and moon to illuminate good and evil, and array the constellations to show auspicious and inauspicious signs—all are the natural principles of **Dao/Way** and **virtue/power**.\n\nThe foolish gaze upward at the three luminaries, observe the changes in celestial patterns, witness the wrath of thunder and lightning, or note the irregularity of cold and heat, or floods and droughts, or insect plagues, fearing disaster may strike them, and thus harbor endless dread. The foolish mistake these for Heaven and Earth’s patterns and principles.\n\nThe patterns and principles of the times and things are only this: when the ruler maintains purity and stillness, and the ministers exhibit loyalty and integrity, the magpies do not caw in discord, the frontier beacons are not falsely lit, the common folk live in peace, and the world is tranquil. Even if Heaven and Earth display omens of calamity, they cannot prevail.\n\nThe **Dao/Way**-virtuous and I know this as the patterns and principles of the times and things. Hence *Jiāyǔ* says: *\"In the time of Shang’s King Tàiwù, the **Dao/Way** was lost and governance corrupt, so the disaster of the wild mulberry appeared in the court—it grew seven days into a great arch. The diviner said: ‘The wild mulberry is a forest tree; it should grow in the suburbs. Now it grows in the court, the state will perish.’ King Tàiwù, fearful, turned to cultivating **virtue/power**, pondering the governance of ruler and subject, clarifying the way to nurture people. Three years later, distant lands admired his righteousness, and sixteen states came bearing tribute. Thus the wild mulberry could not bring disaster.\"*\n\nThe Master said: *\"The fate of survival or ruin, of fortune or misfortune, all lies within oneself. Heaven’s calamities and Earth’s portents cannot impose upon it.\"* Thus, portents of disaster cannot overcome virtuous governance, and strange dreams cannot overcome righteous conduct.\n\nEven when Yao faced the great flood for nine years, and Tang endured a great drought for seven years, the common folk lived in peace and none suffered hunger—why? Because the rulers followed the **Dao/Way**, their governance was balanced and harmonious, their word trusted and their ministers loyal, and the people revered them above. Though there were floods and droughts, they could not bring disaster.\n\nFloods and droughts are Heaven and Earth. Patterns and principles are the times and things. If one understands the principles of the times and things, they can all turn calamity into fortune and transform **Death** into **Life**.»\n\nThus it is said: *\"I understand the patterns and principles of the times and things.\"*\n\nFor the essence of a military strategist lies in omens such as the five-colored sun, stars flowing in the four cardinal directions, monstrous beasts charging the encampment, and wild birds entering dwellings—these are Heaven and Earth’s patterns and principles revealing disaster or blessing. Yet if one refines governance, devises strategies, and attends to the welfare of the troops, turning calamity into fortune, what enemy could dare resist? This is the mastery of the times and things’ patterns and principles.\n\nThus it is said: *\"Below, there are the arts of strong arms and victory in battle.\"*\n\nThe following hundred and thirteen words all urge deep contemplation and quiet reflection, so that harm and benefit do not arise, and one discerns survival and ruin. They reveal public and private, hidden and manifest, opening the way to affairs and observing Heaven’s signs and the times.\n\nThus it is said: *\"Below, there are the arts of strong arms and victory in battle.\"*\n\nThe praise reads:\n*\"Cutting off the source of profit, pondering three times over.\nFollowing the mechanisms of things, life and death are before one’s eyes.\nJoy arises from tranquility, while kindness breeds cruelty.\nHeaven and Earth’s disasters and blessings are the principles of the times for fortune.\nThe Dao/Way of Nature is still, hence Heaven and Earth and all things are born.\nThe Dao/Way of Heaven and Earth is gradual, hence yin and yang prevail.\nThe Sage says: The Dao/Way of Heaven and Earth is subtle and gradual, yet only the victorious understand it.\nYin and yang push against each other, and their transformations proceed in harmony.\nThe Sage says: When yin and yang push each other, their激至於自化—does this lie in the eyes?\nThus, the Sage knows that Nature cannot be forced, yet one must govern it accordingly.\nThe Sage says: Profound! Excellent! The common folk see it as Nature, the heroes as governance, and the foolish as transformation.\n\nThe Dao/Way of utter stillness cannot be measured by calendars or astronomical laws—\nEven birds and beasts embody this.\nThe Sage says: The stillness of birds and beasts cannot be calculated by calendars.\nFrom this arise wondrous instruments, giving birth to all phenomena.\nThe Eight Trigrams and the Heavenly Stems-Earthly Branches—\nThis is the One resolving the Ten Thousand.\nThe divine pivot hides its mysteries.\nThe Six *Ji* [癸]—these are the *Xuan Nü* [玄女] talismans.\nThe arts of yin and yang’s mutual conquest are clearly revealed in the symbols.\nThese seventy words exhaust the principles without omission.\"*\n\nThe *Yellow Emperor’s I Ching* *Yinfu Jing* concludes here.\n\n---\n*Original text notes:*\n1. *\"The living are the root of the dead; the dead are the root of the living\"*—reversed from the original *\"Dead are the root of the living; living are the root of the dead,\"* corrected according to the *Meng* [梦] text.\n2. *\"Liang\"*—originally *\"Liang\"* [亮], corrected to *\"Liang\"* [良] according to the *Meng* [梦] text.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "黄帝阴符经疏 经名：黄帝阴符经疏。 原题唐李筌疏。 据《道藏提要》考证，应为宋人取李筌《阴符经序》与袁淑真《阴符经集解》合编而成。 三卷。 底本出处：《正统道藏》洞真部玉诀类。 参校本：《丛书集成新编》所收梦华馆本（简称梦本）。 黄帝阴符经疏序 少室山达观子李筌，好神仙之道，常历名山，博采方术。 至嵩山虎口岩石壁中，得阴符本，绢素书，朱漆轴，以绛缯缄之。 封云：魏真君二年七月七日上清道士寇谦之藏诸名山，用传同好。 其本糜烂，应乎灰灭。 筌略抄记，虽诵在口，竟不能晓其义理。",
      "translated_text": "**Translation:**\n\n**Title of the Classic:** *The Obscure Symbols Classic of the Yellow Emperor with Commentary* (Huangdi Yin Fu Jing Shu).\n**Original Attribution:** Previously ascribed to Tang Li Quán’s commentary (Tang Li Quán Shu).\n**Authentic Verification:** According to *Daoist Canon Abstracts* (Daozang Tiyao), this appears to be a compilation by a Song-era scholar, blending Li Quán’s *Preface to the Obscure Symbols Classic* (Yin Fu Jing Xu) with Yuan Shuxian’s *Collected Explanations of the Obscure Symbols Classic* (Yin Fu Jing Jijie).\n**Volume:** Three scrolls.\n**Base Text Source:** *The Daoist Canon of the Zhengtong Era* (Zhengtong Daozang), in the **Divine Authenticity Section (Dongzhen Bu)**, under **Jade Precepts Category (Yujie Lei)**.\n**Collation Text:** The **Dream Hua Pavilion Edition** (Menghua Guan Ben) collected in *Newly Compiled Collected Books Series* (Congshu Jicheng Xinbian) [hereafter cited as \"Dream Edition\"].\n\n**Preface to the Commentary on the Obscure Symbols Classic of the Yellow Emperor:**\nThe **Master of Perception from Shaoshi Mountain** (Shaoshi Shan Daguanzi), **Li Quán** (Li Quán), was devoted to the **Dao of the Immortals** (Shenxian zhi Dao), often traversing sacred peaks and gathering esoteric techniques (fangshu).\nUpon reaching **Song Mountain’s Tiger Mouth Cliff** (Songshan Hukou Yan), within the stone-walled grotto, he discovered the **Obscure Symbols Classic** (Yin Fu Jing) inscribed on silk with vermilion lacquer seals (zhuqi zhou), bound in crimson silk (jianguan).\nThe inscription read: *\"In the second year of Wei Zhenjun’s reign (July 7th), the High Purity Daoist Ke Qianzhi (Wei Zhenjun Ke Qianzhi) concealed this within the sacred mountains, to be transmitted to those of like mind (tonghao).\"*\nThe text was worn and faded, as if reduced to ashes and obliteration.\nLi Quán made a brief transcription, though he recited it aloud, he ultimately failed to grasp its profound principles (yili).",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 235,
      "start_sentence": 0,
      "end_sentence": 12,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 6.533534526824951,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\黄帝阴符经疏.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "因入秦，至骊山下，逢一老母，髽髻当顶，余发倒垂，弊衣扶仗路旁＃1，见遗火烧树，自语曰：火生於木，祸发必克。 筌惊而问之，曰：此是《黄帝阴符》上文，母何得而言？ 母曰：吾受此符三元六甲周甲子矣。 谨按《太一遁甲经》云：一元六十岁，行一甲子，三元行一百八十岁，三甲子为一周，六周积算一千八十岁。 年少从何而知？ 筌稽首再拜，具告得处。 母笑曰：年少颧颊贯於生门，命轮齐於月角，血脑未减，心影不偏，性贤而好法，神勇而乐智，是吾弟子也。 然五十六年当有大厄。 因出丹书符，冠杖端，刺筌口，令跪而吞之，曰：天地相保，乃坐树下，说阴符玄义。 言竟诫筌曰：《黄帝阴符》三百言，百言演道，百言演法，百言演术。 参演其三，混而为一。 圣贤智愚，各量其分，得而学之矣。 上有神仙抱一之道，中有富国安人之法，下有强兵战胜之术。 圣人学之得其道，贤人学之得其法，智人学之得其术，小人学之受其殃，识分不同也。 皆内出於天机，外合於人事，若巨海之朝百谷，止水之含万象。 其机张，包宇宙，括九夷，不足以为大； 其机弥，隐微尘，纳芥子，不足以为小； 观其精微，《黄庭》八景不足以为学； 察其至要，经传子史不足以为文； 任其巧智，孙吴韩白不足以为奇。 是以动植之性、成败之数、死生之理，无非机者。 一名《黄帝天机》 之书。 九窍四肢不具，悭贪、愚痴、风痫、狂诳者，并不得闻。 如传同好，必清斋三日，不择卑幼，但有本者为师，不得以富贵为重、贫贱为轻，违者夺二十纪。 《河图》、《洛书》云：黄帝曰：圣人生，天帝赐算三万六千七百二十纪，主一岁，若有过，司命辄夺算，算尽夺纪，纪尽则身死。 有功德，司命辄与算，算得与纪，纪得则身不死，长生矣。 每年七月七日写一卷，藏诸名山岩石间，得算一千二百本命； 日诵七遍，令人多智慧，益心机，去邪魅，销灾害，出三尸，下九虫，所以圣人藏之金匮，不妄传也。 母语毕，日已晡矣，曰：吾有麦饭相与为食。 因袖中出一瓠，令筌取水。",
      "translated_text": "Li Quán then entered Qin, reaching the foot of **Lishan Mountain**, where he encountered an old woman—her hair piled atop her head, the rest hanging loose—leaning on a staff in ragged robes beside the road. She saw a fire burning a tree and muttered to herself: *\"Fire arises from wood; disaster strikes when it spreads.\"* Li Quán, startled, asked her, *\"This is the opening passage of the *Yellow Emperor’s Yin Fu Classic*—how do you know it?\"*\n\nThe woman replied, *\"I have received this symbol for three cycles of sixty years, through the six heavenly stems and ten celestial branches, completing the full reckoning.\"*\n\nLi Quán respectfully inquired, *\"According to the *Taiyi Dunjia Classic*, one cycle of sixty years completes one *jiazi* reckoning; three cycles make one hundred eighty years, three *jiazi* cycles form one full rotation, and six rotations total one thousand eight hundred years. How could one so young know this?\"*\n\nLi Quán bowed twice and recounted where he had found the text. The woman smiled and said, *\"Your cheeks glow at the life-gate, your fate-wheel aligns with the moon’s horn—your blood and vitality remain unspent, your spirit unclouded. You are virtuous yet drawn to the Dao, bold yet eager for wisdom. You are my disciple.*\n\n*\"Yet in fifty-six years, you shall face great calamity.\"* She then produced a crimson talisman, affixed it to his hat and staff, and pricked his tongue, commanding him to kneel and swallow it. *\"The heavens and earth preserve each other,\"* she declared, before seating herself beneath a tree to expound on the *Yin Fu’s* profound mysteries.\n\nWhen she finished, she warned him: *\"The *Yellow Emperor’s Yin Fu* consists of three hundred words—one hundred elucidating the Dao, one hundred the law, one hundred the technique. Together, they merge into an indivisible whole.\n\n*\"The sage learns it and grasps the Dao; the virtuous learn it and master the law; the wise learn it and wield the technique. The petty, however, invite ruin by their ignorance. Each attains only what their nature permits.\n\n*\"Its principles arise from celestial mechanics yet harmonize with human affairs—like the morning tide embracing all rivers, or still water reflecting myriad forms. When its mechanism unfurls, it encompasses the cosmos, binding the Nine Barbarians—yet this is but its grandeur. When it contracts, it conceals the finest dust, containing the mustard seed—yet this is but its subtlety.\n\n*\"Its precision surpasses the *Huangting*’s eight vistas; its essence transcends the classics and histories. Its ingenuity outstrips Sunzi, Wu Qi, Han Fei, and Bai Qi. Thus, the natures of growth and decay, the patterns of success and failure, the logic of life and death—all stem from this mechanism.\n\n*\"Its alternate name is *The Yellow Emperor’s Tianji Classic*. Those lacking limbs, senses, or clarity—those consumed by greed, stupidity, wind-illness, or madness—shall not hear it.\n\n*\"If passed to those of like mind, the recipient must first observe three days of purity. Age or station does not matter—only the worthy may teach it. Never let wealth elevate one above the law or poverty degrade another. To violate this, twenty *ji* of one’s lifespan shall be forfeited.\n\n*\"The *River Diagram* and *Luo Book* record the Yellow Emperor’s words: ‘When a sage is born, the Celestial Sovereign grants them thirty-six thousand seven hundred twenty *ji* of fate, one for each year. If they err, the Record-Keeper seizes them. When the *ji* are exhausted, the *ji* are gone, and life ends. But if they cultivate virtue, the Record-Keeper grants them more. When the *ji* accumulate, the *ji* endure, and immortality follows.’\n\n*\"Each year on the seventh day of the seventh month, one scroll must be copied and hidden in the sacred mountains’ cliffs—each copy granting a thousand two hundred years of vitality. To recite it seven times daily sharpens the mind, strengthens the will, repels malevolence, dispels calamities, expels the Three Corpses, and subdues the Nine Worms. Thus, the sages concealed it in the Golden Treasury, transmitting it only to the worthy.\"*\n\nAs the sun dipped toward evening, she said, *\"I have barley rice to share as sustenance.\"* From her sleeve, she produced a gourd and bade Li Quán fetch water.",
      "overlap_context": "ermilion lacquer seals (zhuqi zhou), bound in crimson silk (jianguan).\nThe inscription read: *\"In the second year of Wei Zhenjun’s reign (July 7th), the High Purity Daoist Ke Qianzhi (Wei Zhenjun Ke Qianzhi) concealed this within the sacred mountains, to be transmitted to those of like mind (tonghao).\"*\nThe text was worn and faded, as if reduced to ashes and obliteration.\nLi Quán made a brief transcription, though he recited it aloud, he ultimately failed to grasp its profound principles (yili).",
      "start_char": 235,
      "end_char": 1014,
      "start_sentence": 13,
      "end_sentence": 42,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 11.515262603759766,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\黄帝阴符经疏.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "＃1 旁：原作『傍』，据梦本改。 黄帝阴符经疏卷上 少室山李筌疏 释题：阴，暗也。 符，合也。 天机暗合於行事之机，故曰《阴符》。 神仙抱一演道章 观天之道，执天之行，尽矣。 但观天道而理，执天之道，则阴阳动静之宜尽矣。 疏曰：天者，阴阳之总名也。 阳之精炁轻清，上浮为天； 阴之精炁重浊，下沉为地。 相连而不相离，故列子御寇谓杞国人曰：天积炁耳，地积块耳，自地已上则皆天也。 子终日行於天，奈何忧乎天崩？ 故知天地则阴阳之二炁，炁中有子，名曰五行。 五行者，天地阴阳之用也，万物从而生焉，万物则五行之子也。 故使人观天地阴阳之道，执天五炁而行，则兴废可知，生死可察，除此外无可观执，故言尽矣。 天有五贼，见之者昌。 五贼在心，施行于天。 宇宙在乎手，万物生乎身。 天生五行，谓之五贼。 使人用心观执，奉天而行，则宇宙在乎掌中，万物生乎身上矣。 疏曰：五贼者，五行之炁也，则金、木、水、火、土焉。 太公注云：圣人为之五贼，天下为之五德。 人食五味而死，无有死而弃之者，此五贼之义。 所言贼者，害也。 逆之不顺，则与人生害，故曰贼也。 此言阴阳之中包含五炁，故云：天有五贼。 五＃2者在天为五星，在地为五岳，在位为五方，在物为五色，在声为五音，在食为五味，在人为五脏，在道为五德，不善用之则为贼。 又，贼者，五行更相制伏，递为生杀，昼夜不停，亦能盗窃人之生死、万物成败，故言贼也。 见之者昌，何也？ 人但能明此五行制伏之道，审阴阳兴废之源，则而行之，此为见也； 如人审五贼，善能明之则为福，德之昌盛也。 又人能知五贼，藏者何也？ 在其心故曰五贼在心，心既知之，故使人用心，观执五炁而行，睹逆顺而不差，合天机而不失，则宇宙在乎掌中，万物生乎身上。 如此则吉无不利，与道同游，岂不为昌乎？ 在仕宦之道，执仁义礼智信，则富贵荣华，岂不为昌乎？ 在军旅之道，明五行逆顺，则战取必胜，岂不为昌乎？ 故曰：见之者昌也。 但因此五行相生而用之，则为道德合於阳也； 相克之道用之，则为贼害合於阴也。 故三教大师皆用理世，所立经教，只言修善而称道德，不令修恶而称贼害也。 故知善修道德者，道也，是阳之主也； 阴恶贼害者，魔也，是阴之精。 除此之外，百万经教虚广故也。 故宣尼云：一言以蔽之，曰思无邪。 又曰：择其善者而从之，其不善者而改之。 此则至道也，何必广谈修习欤？ 合道之体，不出此门，能知天地阴阳成败之元者，皆在《阴符》首章而尽理矣。 世人见文少而言近，自不闲其要妙，亦何在三教经书广博所陈也？ 故骊山母云：观其精理，《黄庭》八景不足以为学； 察其至要，经传子史不足以为文； 任其巧智，孙吴韩白不足以为奇。 此之义也。 天性、人也。 人心，机也。 立天之道，以定人也。 言以立天定人，在乎五贼。 疏曰：夫人心主魂之官，身为神之府也。 将欲施行五贼者，莫尚乎心，故心能之士，有所图必合天道。 此则宇宙虽广，观览只在手中； 万物虽多，生杀不出於术内。 故曰：心正可以辟邪也。 天发杀机，龙蛇起陆。 人发杀机，天地反覆。 天人合发，万变定基＃3。 天发杀机，公道也；",
      "translated_text": "**#1** *Note: Original text reads \"傍\" (páng), corrected to \"旁\" (páng) according to the Dream Edition.*\n\n**Commentary on the *Huangdi Yinfu Jing* (卷上) by Li Quán of Shaoshi Mountain**\n*Explanation of the Title:*\nYin—darkness.\nFu—harmony.\nThe hidden harmony of the Dao/Way aligns with the workings of cosmic principle, hence the title *Yinfu*.\n\n**Chapter: The Sage Embracing Unity to Manifest the Dao/Way**\nTo observe the Dao/Way of Heaven and follow Heaven’s operations—this is complete.\n\nBut if one observes only the Dao/Way of Heaven in principle and follows Heaven’s Dao/Way, then the proper interplay of yin and yang, motion and stillness, is fully realized.\n\n**Commentary:**\nHeaven refers to the collective name for yin and yang.\nThe refined *qi* of yang is light and clear, ascending to form Heaven;\nThe refined *qi* of yin is heavy and turbid, descending to form Earth.\nThey are connected yet never separate, hence Zhuangzi’s *Liezi* dialogue with the man of Qi, who said to the people of Ruo: *\"Heaven is but accumulated *qi*, Earth but accumulated mass—from Earth upward, all is Heaven.\"* You walk through Heaven all day—why fear its collapse?\n\nThus, knowing Heaven and Earth reveals that within yin and yang’s *qi* lie the Five Phases.\nThe Five Phases are the functional expressions of Heaven and Earth’s yin and yang, from which all things arise; all things are the offspring of the Five Phases.\nIf one observes the Dao/Way of Heaven and Earth’s yin and yang, and follows the Five *qi* of Heaven, then the rise and fall of all things may be known, and life and death discerned. Beyond this, there is nothing further to observe or follow—thus it is said to be complete.\n\nHeaven possesses Five Thieves; those who perceive them thrive.\nThe Five Thieves reside in the heart, manifesting in Heaven’s operations.\nThe cosmos lies within the palm; all things spring from the body.\nHeaven generates the Five Phases—these are the Five Thieves.\nIf one attends with mind to observe and follow, aligning with Heaven’s operations, then the cosmos rests in the palm, and all things arise from the body.\n\n**Commentary:**\nThe Five Thieves are the *qi* of the Five Phases—namely, Metal, Wood, Water, Fire, and Earth.\nThe *Taigong* commentary states: The Sage establishes them as Five Thieves; the world follows them as Five Virtues.\nThough humans consume the Five Flavors and die, none abandon them—this is the meaning of the Five Thieves.\nThe term \"Thief\" refers to harm.\nIf one acts contrary to their nature, they bring harm to life—hence \"Thief.\"\n\nThis speaks of how yin and yang encompass the Five *qi*, hence: *Heaven has Five Thieves.*\nThe Five Thieves manifest as:\nIn Heaven, the Five Stars;\nOn Earth, the Five Sacred Peaks;\nIn governance, the Five Directions;\nIn things, the Five Colors;\nIn sound, the Five Tones;\nIn sustenance, the Five Flavors;\nIn the body, the Five Viscera;\nIn the Dao/Way, the Five Virtues.\nIf misused, they become Thieves.\nMoreover, the Five Thieves—through the mutual subjugation of the Five Phases, their cyclical generation and destruction without cease—can also steal life and death, the success and failure of all things; hence they are called Thieves.\n\nWhy does it say, *\"Those who perceive them thrive\"*?\nIf one merely understands the subjugating Dao/Way of the Five Phases and discerns the sources of yin and yang’s rise and fall, then following them is called perception.\nIf one perceives the Five Thieves and clearly understands them, it brings fortune—virtue flourishes.\nAgain, if one knows the Five Thieves, why hide them?\nThey reside in the heart, hence *\"the Five Thieves are in the heart.\"*\nOnce the heart knows them, one must use the mind to observe and follow the Five *qi*, discerning顺 (harmony) and逆 (contrariness) without error, aligning with Heaven’s intent without loss—then the cosmos lies in the palm, and all things arise from the body.\nThus, all undertakings prosper, and one moves in harmony with the Dao/Way—how could this not bring thriving?\n\nIn governance, if one upholds *rén* (benevolence), *yì* (righteousness), *lǐ* (propriety), *zhì* (wisdom), and *xìn* (faithfulness), then wealth, honor, and glory follow—how could this not bring thriving?\nIn military affairs, if one understands the顺 and逆 of the Five Phases, then victory in battle is assured—how could this not bring thriving?\nThus it is said: *\"Those who perceive them thrive.\"*\n\nIf one uses the Five Phases in their generative aspect, this aligns with virtue and the yang.\nIf one uses their subjugating aspect, this aligns with harm and the yin.\nThus the great masters of the Three Teachings all govern the world through principle; the scriptures they established speak only of cultivating goodness and calling it virtue/power, never of cultivating evil and calling it harm.\nThus, those who diligently cultivate virtue/power are aligned with the Dao/Way—they are the masters of yang.\nThose who indulge in yin’s evil and harm are demons—they are the essence of yin.\nBeyond this, myriad scriptures are but empty and vast in words.\nHence Confucius said: *\"In one word: ‘Think not evil.’\"*\nAnd again: *\"Choose the good and follow it; choose the ungood and change it.\"*\nThis is the supreme Dao/Way—why speak at length of cultivation?\n\nThe essence of the Dao/Way does not exceed this gate.\nThose who know the origins of Heaven and Earth’s yin and yang’s success and failure are fully revealed in the first chapter of the *Yinfu*.\nThe world sees few words and simple language, yet does not grasp its profundity—why seek it in the vast expanse of the Three Teachings’ scriptures?\nHence the Mother of Mount Li said:\n*\"To observe its refined principles, the Eight Scenes of the *Huangting* are insufficient for study;\nTo discern its utmost essence, the Classics and Histories are insufficient for exposition;\nTo employ its cunning intelligence, the strategies of Sunzi, Wu Qi, Han Fei, and Bai Qi are insufficient for ingenuity.\"*\n\n**Heaven’s nature is humanity.**\nThe human heart is the mechanism.\nEstablishing Heaven’s Dao/Way to govern humanity rests in the Five Thieves.\n\n**Commentary:**\nThe human heart is the seat of the spirit-soul (*hun*), the body the dwelling of the spirit (*shen*).\nThose who would wield the Five Thieves must first master the heart—thus those whose hearts align with the Dao/Way can plot and it will harmonize with Heaven’s operations.\nThough the cosmos may be vast, observation lies within the palm;\nThough myriad things exist, their life and death are governed by technique.\nHence it is said: *\"A rectified heart can repel evil.\"*\n\nWhen Heaven’s killing intent arises, dragons and serpents emerge on land.\nWhen humanity’s killing intent arises, Heaven and Earth reverse.\nWhen Heaven and humanity’s killing intents converge, the foundation of all transformations is set.\nHeaven’s killing intent is just retribution;",
      "overlap_context": "cred mountains’ cliffs—each copy granting a thousand two hundred years of vitality. To recite it seven times daily sharpens the mind, strengthens the will, repels malevolence, dispels calamities, expels the Three Corpses, and subdues the Nine Worms. Thus, the sages concealed it in the Golden Treasury, transmitting it only to the worthy.\"*\n\nAs the sun dipped toward evening, she said, *\"I have barley rice to share as sustenance.\"* From her sleeve, she produced a gourd and bade Li Quán fetch water.",
      "start_char": 1015,
      "end_char": 2270,
      "start_sentence": 43,
      "end_sentence": 109,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 22.214888095855713,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\黄帝阴符经疏.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "人发杀机，私情也。 龙蛇感公道而震； 私情紊乱，天地而反覆。 天人俱合於公道，则千变万化，无不定矣。 疏曰：天含五炁，递为生杀，自然有之。 天道生杀，皆合其机宜，不妄发动。 阴阳改变，时代迁谢，去故就新，此天发杀机，皆至公也。 乘天威杀之机，或龙或蛇，沉隐之类皆能震起於陵陆。 顺天应时，畅达於其间，为乘天之机，不失其宜也。 人发杀机，天地反覆者，人是五行之子，须顺五炁之生杀，任阴阳之陶运，何得擅自兴其生杀乎？ 至如世间之法，杀人者死，杀生者罪，何也？ 为非天之合杀，彼人奈何杀之乎？ 言人不合妄动杀机也。 至如奸臣逆节，违背天道，反叛君亲，恣行凶恶，损害於世，擅行屠戮，妄动杀机者，同翻天作地，覆地作天，如此之大乱为逆，天之大祸，是名天地反覆。 此则人怨神怒，天将诛之，人共杀之，俱合其杀机，是名天人合发，万变定基。 罚叛讨逆，顺天行诛，皆合天杀之机宜。 惬至公之正道，则万物咸伏，无敢妄动，名曰定基。 君臣之道贵其公正，若能动用合其天机，应运同其天道，此则人安其心，物安其体，五行安其位，岳渎安其灵； 上施道德，下行仁义，灾害不生，祸乱不作，天人静默，名曰定基。 性有巧拙，可以伏藏。 人之巧拙，不可显露； 慎之择善，无令患生也。 疏曰：人怀性智巧拙，贤愚悉共有之。 但少而言之，人有少巧智辩慧，便驰骋显露，不料得失，显招其咎者，何也？ 为不能隐密，不自诫慎，以致倾败耳。 故《道德经》云：大辩若讷，大巧若拙。 其言隐密也。 《易》曰：君不密则失臣，臣不密则失身，机事不密则害成。 此之谓也。 可以伏藏者，贤人君子纵有巧智辩慧之性、博学多闻之才，动静合其机宜，可不为巧乎？ 常能隐伏，藏匿巨细，用之恐被嫉佞谗毁，反招其咎耳。 况愚拙之人，自率於心，造次兴动，不自藏隐，立招祸患。 贤人养道育德，巧拙之性俱隐伏於身心，然后内观正性，外视邪淫，善则行之，不善则舍之，修身炼行而成圣人，外人焉能知我巧拙之性乎？ 皆谓我天然贤圣，不知我修而致之，故曰伏藏也。 九窍之邪，在乎三要，可以动静。 言人九窍俱邪，皆能生患，在於要者，耳目口也，切使械慎，无令祸生。 疏曰：《南华》云：人有百骸、九窍、五脏，体而存之，人禀五炁而成形，头圆足方，四肢五脏，三魂七魄，递生邪正，互为君臣，在身通流。 运动者，九窍也。 邪正祸福之急者，在三要焉，即耳、目、口也。 故《道德经》云：五色令人目盲、五音令人耳聋，五味令人口爽是也。 道德之士，眼不视邪色，耳不听邪声，口不谈邪事，所以正事则视听言谈之，此名动也； 涉其邪妄，悉不将心视听言说，此名静也。 宣尼云：择其善者而从之，此名动也； 择其不善者而改之，在此名静也。 《孝经》云：言满天下无口过，行满天下无怨恶者，所缘身心静正而无邪恶，以致此也。 但遇善即动，逢邪即静，此则身无祸患，皆在耳目口之防慎。 故云：在乎三要耳。 可以动，可以静也。 火生於木，祸发必克。 奸生於国，时动必溃。 知之修炼，谓之圣人。 奸火喻人之性，木国喻人之身。 使人治国安身，而今奸火不发，然后修身炼行，以成圣人。",
      "translated_text": "「Humanity’s killing intent is private passion. Dragons and serpents heed public justice and tremble;\nPrivate passions in chaos, Heaven and Earth reverse.\n\nWhen Heaven and humanity unite in public justice, then myriad transformations and changes,\nall are fixed in their proper order.\n\n**Commentary:**\nHeaven contains the Five *qi* (vital energies), cyclically giving rise to life and death—\nthis is natural. Heaven’s Dao of life and death all conform to their proper occasions,\nnever acting arbitrarily. As yin and yang shift, eras pass, old gives way to new—\nthis too is Heaven’s killing intent, all of it just.\n\nRiding Heaven’s killing intent—whether as dragon or serpent—\nthe hidden and obscure all rise upon the heights and valleys.\nFollowing Heaven’s will and the times, acting freely in accordance,\nthis is to ride Heaven’s killing intent without losing its proper occasion.\n\nAs for humanity’s killing intent causing Heaven and Earth to reverse—\nhumans are children of the Five Phases, so they must conform to the Five *qi*’s life and death,\nsubmit to yin and yang’s nurturing influence. How can they presume to stir life and death on their own?\n\nEven in the world’s laws, those who kill are put to death,\nthose who kill living beings are punished—why? Because they act against Heaven’s ordained killing intent.\nHow can such people kill at will? It is said that humans must not act arbitrarily in killing intent.\n\nAs for traitorous ministers who rebel against proper order,\ndefy Heaven’s Dao, betray their sovereign and kin,\nindulge in cruelty and wickedness,\nharm the world, and recklessly slaughter—\ntheir chaos is like turning Heaven into Earth or Earth into Heaven.\nSuch great disorder is treason; Heaven’s greatest calamity—\nthis is called *Heaven and Earth reverse*.\n\nHere, the people’s resentment and the gods’ wrath converge,\nHeaven prepares to punish them, and the people join in killing them—\nall unite in their killing intent—\nthis is called *Heaven and humanity’s killing intents converge*,\nthe foundation of all transformations set.\n\nPunishing rebels and quelling traitors,\nfollowing Heaven’s will in execution—\nall align with Heaven’s proper killing intent.\nWhen one adheres to the just Dao,\nall things submit, none dare act recklessly—\nthis is called *fixed foundation*.\n\nThe Dao of ruler and subject is valued for its impartiality and rectitude.\nIf one can move and act in harmony with Heaven’s occasions,\nrespond to the times in accordance with Heaven’s Dao,\nthen humanity rests in peace, things find their proper place,\nthe Five Phases maintain their order, mountains and rivers preserve their spirits;\nAbove, moral virtue and power (*Dao* and *De*) are applied,\nbelow, benevolence and righteousness are practiced—\ndisasters do not arise, calamities do not occur,\nHeaven and humanity remain tranquil—\nthis is called *fixed foundation*.\n\nNature has its cleverness and clumsiness, which can be concealed.\nHuman cleverness and clumsiness must not be revealed;\nCultivate prudence in choosing what is good,\nlest misfortune arise.\n\n**Commentary:**\nHumans possess innate cleverness, clumsiness, and wisdom—\nboth the wise and foolish share these traits.\nYet why do those with slight cleverness and eloquence\nrush to display them, reckless of gain or loss,\nand openly invite calamity? Because they cannot conceal themselves,\ndo not restrain their hearts with caution,\nthus leading to their downfall.\n\nHence the *Dao De Jing* says:\n*\"Great eloquence seems taciturn, great cleverness seems clumsy.\"*\nThis speaks of concealment.\nThe *Yijing* says:\n*\"The ruler not concealed loses his subjects,\nthe subject not concealed loses his life,\nmatters not concealed invite harm.\"*\nThis is the same meaning.\n\nThose who can conceal—\neven if the sage and virtuous have cleverness, wisdom, eloquence,\nand vast learning—\nif their actions and stillness conform to proper occasions,\nthey need not be called clever. They can always conceal and hide,\nboth great and small, lest they be envied or slandered,\nand thus invite blame.\n\nMuch less the foolish and clumsy,\nwho act impulsively, stirring without restraint,\ndo not conceal themselves—\nthey immediately invite disaster.\nThe sage cultivates the Dao and nurtures virtue,\nso cleverness and clumsiness are concealed within body and mind.\nThen inwardly, they observe their true nature,\noutwardly, they avoid evil and licentiousness—\nwhat is good, they practice; what is not good, they abandon,\nrefining their bodies and actions to become a *sage*,\nso outsiders cannot know my innate cleverness or clumsiness.\nAll attribute my virtue to natural sageliness,\nnot knowing it is achieved through cultivation—\nthus it is called *concealment*.\n\nThe nine orifices’ evils reside in the three essentials,\nwhich can be stilled or stirred.\nIt is said that when a person’s nine orifices are all evil,\nthey can all give rise to illness—\nbut the most urgent evils of calamity and fortune lie in the three essentials:\nears, eyes, and mouth. Thus, one must guard them carefully,\nlest disaster strike.\n\n**Commentary:**\nThe *Nanhua* (Zhuangzi) says:\n*\"Humans have a hundred limbs, nine orifices, five viscera—\nbody them and preserve them. Humans receive the Five *qi* and take form,\nwith heads round and feet square, four limbs and five viscera,\nthree *hun* (spirits) and seven *po* (ethereal souls),\nalternately giving rise to evil and rectitude,\nmutually serving as sovereign and subject within the body.\nThe movement of the nine orifices—\nevil and rectitude, calamity and fortune—\nare most urgent in the three essentials:\nears, eyes, and mouth.\nThus the *Dao De Jing* says:\n*\"Five colors blind the eyes, five sounds deaf the ears,\nfive flavors dull the mouth.\"*\nThe virtuous do not let their eyes see evil colors,\ntheir ears hear evil sounds,\nor their mouths speak of evil matters—\nthus when proper matters arise, they see, hear, and speak accordingly—\nthis is called *stirring*.\nWhen encountering evil and falsehood,\nthey do not let their hearts see, hear, or speak—\nthis is called *stillness*.\nMaster Kong (Confucius) said:\n*\"Choose what is good and follow it—this is called stirring;\nchoose what is not good and abandon it—this is called stillness.\"*\nThe *Xiaojing* (Classic of Filial Piety) says:\n*\"In speech, fill the world without excess—\nin conduct, fill the world without resentment or evil—\nthis is because the body and mind are stilled and rectified, without evil,\nthus attaining this state.\"*\nBut when encountering good, one stirs;\nwhen encountering evil, one stills—\nthus the body remains free of calamity,\nall through guarding the ears, eyes, and mouth with caution.\nHence it is said:\n*\"Resides in the three essentials—\ncan be stilled, can be stirred.\"*\n\nFire arises from wood, calamity strikes and it is subdued.\nEvil arises in the realm, and when it stirs, it collapses.\nKnowing this and refining oneself—\nthis is called a *sage*.\nThe metaphor of *delinquent fire* refers to human nature,\n*wood-realm* refers to the human body.\nThis teaches one to govern the realm and preserve the body,\nso that delinquent fire does not arise—\nthen refine the body and actions to become a *sage.*」",
      "overlap_context": "eaven’s operations.\nThough the cosmos may be vast, observation lies within the palm;\nThough myriad things exist, their life and death are governed by technique.\nHence it is said: *\"A rectified heart can repel evil.\"*\n\nWhen Heaven’s killing intent arises, dragons and serpents emerge on land.\nWhen humanity’s killing intent arises, Heaven and Earth reverse.\nWhen Heaven and humanity’s killing intents converge, the foundation of all transformations is set.\nHeaven’s killing intent is just retribution;",
      "start_char": 2270,
      "end_char": 3506,
      "start_sentence": 110,
      "end_sentence": 162,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 19.638803243637085,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\黄帝阴符经疏.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "疏曰； 此一科言圣意兴其喻也。 为上文九邪三要动静之宜，切令戒慎，恐未能穷理尽性，故兴此火木奸国为令喻殷勤修炼以成圣人。 木中有火者，喻人中有邪恶之性、五毒之火也。 太公注云：广成子以为积火焚五毒，故知火者猛烈之炁，《书》云：火炎昆冈，玉石俱焚矣。 木中藏火，慎勿钻研，火发则木焚矣。 身中邪毒，忽纵恣之，则万善俱灭，其身溃矣。 奸生於国，时动必溃者，凡有国则有奸臣贼子，包藏害心，思图篡夺，苟欲富贵，如此之类不一，皆潜藏国中，人君不可知之。 但君怀道德，臣效忠贞； 时自雍和，天下宁泰。 奸人徒有其心，无由妄敢兴动，皆候其时，合动安得？ 君道失，臣道丧，兵水旱蝗，征敛苛刻，人心变易，思乱怨上，当此之代，万物皆有乱心，何况怀奸之人乎？ 又奸者不一，乘此隳败之时，则诸奸竞发，其国得不溃乎？ 此喻上之九窍三要、巧拙动静也。 言人有道德定慧，隐伏身心之中，诸邪淫秽僻亦不能兴耳。 若邪竞发，则身溃矣。 故以奸火藏於木＃4国以喻邪正伏於身心。 此唯贤哲之士通详其文，晓达明悟，精念至道，去恶存善，是名知之修炼谓之圣人。 故曰：上有神仙抱一之道，黄帝得之以登云天，汤武得之以王天下。 骊山母云：圣人学之得其道，为顺天时，则内怀道德，外任贤良，知之修炼而成圣人，是得其道以升云天，黄帝是也。 贤人学之得其法，为依五行之善正，不违天时，不逆地理，不伤财，不害物，富国安人，身为贤明乃得其法，道德之君，尧舜是也。 智人学之得其术，为用天之道，分地之利，谨身节用以养父母，仁义礼智信，忠孝君亲，贞廉不失，保其禄位，是得其术，贤臣夔龙、伊尹是也。 小人学之得其殃，为将天道之炁不习善之，用以智巧辩慧之性，专事三反昼夜，烦兵黩武，阴谋屠害，苟求奢荣，倾夺於世，虽暂富贵，不思祸之将至，反招败亡，延及后世，是得其殃也。 禄山、思明篡逆悖乱之臣是也。 圣母又言：此文深奥，若巨海之朝百谷，含弘万象，妙义灵也。 此神仙抱一演道章上，一百五言，使人明阴阳之道，察兴废之理，动用其机宜，然后修身炼行以成圣人。 故曰：上有神仙抱一之道。 赞曰：天道应运，阴阳至神。 察其机要，存亡在身。 悟者为正，迷则非真。 知之修炼，谓之圣人。 黄帝阴符经疏卷上竟 ＃2 五：原作『此』，据梦本改。 ＃3 基：原作『机』，据梦本改。 ＃4 木：梦本作『才』。 黄帝阴符经疏卷中 少室山李筌疏",
      "translated_text": "The *Commentary* states:\n\nThis passage elaborates on the Sage’s intent in employing these metaphors. To reinforce the nine evils and three essentials of stirring and stillness from the preceding text, it urges constant vigilance, lest one fail to exhaustively grasp principle and refine nature. Thus, it invokes the metaphors of fire within wood and treacherous ministers within the realm to earnestly exhort cultivation toward sainthood.\n\nWood containing fire symbolizes the human heart harboring evil nature—five poisons’ flames. The *Grand Duke’s Commentary* states: Guangchengzi held that accumulated fire consumes the five poisons, thus knowing fire as the fierce *qi* of flame. The *Book of Documents* says: *\"Fire blazes upon Kun Mountain, reducing jade and stone to ash.\"* Wood concealing fire must not be pierced—once ignited, the wood burns. Likewise, if one neglects the evil poisons within the body and indulges them, all virtues perish, and the self collapses.\n\nWhen treachery arises in a realm, it inevitably crumbles when stirred. For any nation, there exist treacherous ministers and traitors, harboring malevolent designs to usurp power, seeking wealth and honor—such schemes abound, concealed within the state, unknown to the ruler. Yet if the sovereign embodies virtue and ministers remain loyal, the land thrives in harmony, and the world knows peace. Treacherous men, though harboring such intentions, dare not act without opportunity. But when the ruler’s Dao falters, ministerial loyalty decays; wars, floods, droughts, and locusts ravage the land; taxes grow oppressive; the people’s hearts turn rebellious, resenting their sovereign. In such times, all things harbor disorder—how much more so those already harboring treachery? When chaos reigns, all deceits erupt, and how could the realm not collapse?\n\nThis metaphor extends to the nine orifices and three essentials—skillful or clumsy, stirring or still. It teaches that if one possesses virtue and wisdom, hidden within body and mind, no evil or impurity can arise. But if evil erupts unchecked, the self dissolves. Thus, the metaphor of treacherous fire concealed in wood/realm illustrates the duality of evil and rectitude within body and mind.\n\nOnly the wise and sagely comprehend this text, penetrating its depths, awakening to the Dao’s essence, purging vice and preserving virtue—this is the knowing and refining that yields sainthood.\n\nHence it is said:\n*\"Above, there exists the Dao of the Immortal Embracing Unity—\nYellow Emperor attained it to ascend to the Cloudy Heights,\nTang and Wu obtained it to rule the world.\"*\n\nThe *Nüwa of Mount Li* states:\n*\"The Sage studies the Dao and attains its Way,\nharmonizing with Heaven’s timing,\nnurturing virtue within,\ntrusting the worthy without—\nknowing and refining to become a Sage,\nthus ascending to the Cloudy Heights, as Yellow Emperor did.\"*\n\nThe *Adept* studies the Dao and grasps its method,\naligning with the five phases’ rectitude,\nneither defying Heaven’s timing nor Earth’s order,\nsparing neither wealth nor life,\nenriching the realm and securing the people—\nthus attaining the method, the virtuous ruler, as Yao and Shun did.*\n\nThe *Wise* studies the Dao and masters its technique,\nemploying Heaven’s Way and Earth’s resources,\ndisciplining the body and moderating desires to honor parents,\nupholding *ren*, *yi*, *li*, *zhi*, *xin*,\nloyalty, filial piety, and reverence for kin,\nremaining steadfast in integrity and modesty,\npreserving one’s rank and blessings—\nthus attaining the technique, as the virtuous ministers Qiu and Yi did.*\n\nThe *Petty* studies the Dao and reaps its calamity,\nperverting Heaven’s *qi* and failing to cultivate virtue,\nexploiting cunning, eloquence, and deceit,\nengaging in ceaseless night-and-day rebellion,\nwaging wanton wars,\nconcocting plots to slaughter and harm,\npursuing fleeting luxury and plunder,\nthough briefly wealthy and honored,\nthey heed not the impending ruin,\ninviting their own and their descendants’ destruction—\nthis is reaping the calamity, as Lu Shan and Shi Ming did.*\n\nThe *Sage-Mother* further declares:\n*\"This text is profound, vast as the morning tide of the great sea,\nencompassing myriad phenomena, its mysteries divine.\nThis is the chapter of the Immortal Embracing Unity,\none hundred and five words,\nilluminating the Dao of yin and yang,\ndiscerning the logic of rise and fall,\nactivating its mechanisms with precision—\nthus refining body and conduct to become a Sage.\"*\n\nHence it is said:\n*\"Above, there exists the Dao of the Immortal Embracing Unity.\"*\n\nThe *Praise* reads:\n*\"Heaven’s Dao responds to the times,\nyin and yang, most divine.\nDiscern its essentials,\nlife and death rest in the self.\nThe enlightened act rightly,\nthe deluded stray from truth.\nKnowing and refining—\nthis is called a Sage.\"*\n\n*The Yellow Emperor’s* *Yin-Shu Commentary*, Volume One, concludes.\n\n---\n*Annotations (as per instructions, omitted in output but noted for consistency):\n- 五毒 (*wǔdú*): Five poisons (in Daoist/TCM, often lust, anger, greed, folly, and ignorance).\n- 广成子 (*Guǎngchéngzǐ*): Daoist sage associated with *Zhuangzi*.\n- 玉石俱焚 (*yùshí jù fén*): \"Jade and stone alike burn\" (from *Book of Documents*).\n- 九窍 (*jiǔqiào*): Nine orifices (eyes, ears, nostrils, mouth, anus, urethra).\n- 三反 (*sānfǎn*): Three rebellions (against Heaven, Earth, parents).\n- 黄帝阴符经 (*Huángdì Yīnfǔ Jīng*): *Yellow Emperor’s Classic of the Dark Symbol*.\n- 少室山李筌疏 (*Shàoshì Shān Lǐ Quán Cóng*): *Commentary by Li Quán of Mount Shaoshi*.\n- 禄山 (*Lùshān*): An Lushan, rebel against Tang.\n- 思明 (*Sīmíng*): Shi Siming, An Lushan’s successor.\n- 神仙抱一 (*Shénxiān bàoyī*): \"Immortal Embracing Unity\" (Daoist alchemical concept).\n- 黄帝得之以登云天 (*Huángdì dé zhī yǐ dēng yúntiān*): \"Yellow Emperor attained it to ascend to the Cloudy Heights\" (mythic Daoist transcendence).\n- 圣母 (*Shèngmǔ*): Likely refers to a Daoist or alchemical \"Sage-Mother\" figure (e.g., Xi Wangmu or a textual personification).\n- 依五行之善正 (*yī wǔxíng zhī shànzhèng*): \"Aligning with the five phases’ rectitude.\"\n- 仁义礼智信 (*rényìlǐzhìxìn*): The Five Virtues (Confucian).\n- 贞廉不失 (*zhēnlián bùshī*): \"Steadfast in integrity and modesty.\"\n- 保其禄位 (*bǎo qí lùwèi*): \"Preserving one’s rank and blessings.\"\n- 夔龙、伊尹 (*Kuí Lóng, Yī Yǐn*): Mythic and historical sage-ministers.\n- 三反昼夜 (*sānfǎn zhòuyè*): \"Ceaseless night-and-day rebellion\" (against natural order).\n- 黩武 (*dúwǔ*): \"Wanton warfare.\"*\n- 烦兵 (*fánbīng*): \"Excessive militarism.\"",
      "overlap_context": ":\n*\"Resides in the three essentials—\ncan be stilled, can be stirred.\"*\n\nFire arises from wood, calamity strikes and it is subdued.\nEvil arises in the realm, and when it stirs, it collapses.\nKnowing this and refining oneself—\nthis is called a *sage*.\nThe metaphor of *delinquent fire* refers to human nature,\n*wood-realm* refers to the human body.\nThis teaches one to govern the realm and preserve the body,\nso that delinquent fire does not arise—\nthen refine the body and actions to become a *sage.*」",
      "start_char": 3507,
      "end_char": 4468,
      "start_sentence": 163,
      "end_sentence": 199,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 17.836464166641235,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\黄帝阴符经疏.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "富国安人演法章 天地，万物之盗； 天覆地载，万物潜生，冲炁暗滋，故曰盗也。 疏曰：天地者，阴阳也。 阴阳二字，洎乎五行，共成其七，此外更改於物，则何惑之甚矣？ 言天地万物胎卵湿化，百谷草木悉承此七炁而生长，从无形至於有形，潜生覆育以成其体，如行窃盗，不觉不知。 天地亦潜与其炁应用无穷； 万物私纳其覆育，各获其安。 故曰：天地，万物之盗。 万物，人之盗； 万物盗天而长生，人盗万物以资身。 若知分合宜，亦自然之理。 疏曰：人与禽兽草木俱禀阴阳而生，人之最灵，位处中宫，心怀智度， 能反照自性，穷达本始，明会阴阳五行之炁，则而用之。 《周易》六十四卦、六十甲子是也。 故上文云：见之昌也。 人於七炁之中，所有生成之物，悉能潜取以资养其身，故言盗，则田蚕五谷之类是也。 《列子》曰：齐有国氏大富，云：吾善为盗矣，天有时，地有利，吾盗天地之时利。 雨泽之滂润，吾陆盗禽兽，水盗鱼鳖。 吾始为盗，一年而给，二年而足，三年大禳，自此以后，施及州闾。 吾盗天地而无殃咎。 若人盗人之金帛，奈何无辜乎？ 万物盗天地以生成，国氏盗万物以资身，但知分合宜，亦自然之理，此万物人之盗也。 人，万物之盗也。 三盗既宜，三才既安。 既，尽也。 三盗尽合其宜，则三才尽兴其任。 疏曰：言人但能盗万物资身以充荣禄富贵，殊不知万物反能盗人以生祸患。 言上来三义更相为盗者，亦自然之理。 凡此相盗，其中皆须有道，惬其宜则吉，乖其理则凶。 故《列子》言：盗亦有道乎？ 何适其无道也？ 见室中之藏，圣也； 知可否，智也； 入先，勇也； 出后，义也； 分均，仁也。 人无此五德而能行盗者，未之有也。 此盗中之道也。 向於三盗之中，皆须有道，令尽合其宜，则三才不差，尽安其任矣。 皆不令越分伤性，以生祸患者也。 故曰：食其时，百骸理。 动其机，万化安。 言人饮食不失其时，则身无患咎； 兴动合其机宜，则万化皆安矣。 疏曰：言人理性命者，皆须饮食滋味也。 故《左传》曰：味与道炁，炁以实志，滋形润神，必归饮食。 黄帝曰：人服饮食，必先五味、五肉、五菜、五果，皆须调候得所，量体而进。 熟则益人，生则伤脏，此食时之义也。 故使饮食不失其时，滋味不越其宜，适其中道，不令乖分伤性，则四肢调畅，五脏安和，无诸疾病，长寿保终，岂不为百骸理乎？ 故亢仓子曰：冬饱则身温，夏饱则身凉。 温凉时适，则人无疾疢，疫疠不行，得终其天年。 故曰：谷者，人之天也。 所以兴，王务农； 王不务农，是弃人也。 人既弃之，将何有国哉？ 但三盗既合其宜，三才尽安其任，此皆合自然之理。 然后须明君贤臣调御於世，乘此既宜尽安之时，当须法令平正，用贤使能，仁及昆虫，化被草木，举头皆合於天道之机宜，则阴阳顺时，寰宇清泰，使万民之类皆获其安宁，此则动其机而万化安，故云：中有富国安人之法也。 人知其神而神，不知不神所以神也。 阴阳生万物，人谓之神； 不知有至道，静默而不神； 能生万物，阴阳为至神矣。 疏曰：神者，妙而不测也。 《易》曰：阴阳不测谓之神。 人但见万物从阴阳日月而生谓之曰神，殊不知阴阳日月从不神而生焉。",
      "translated_text": "**Rich Nation, Peaceful People: The Doctrine of Theft**\n\nHeaven and Earth, the thieves of all things.\nHeaven covers, Earth bears—all things grow in secret,\nQi surging unseen—thus they are called thieves.\n\n*Commentary:* Heaven and Earth are yin and yang.\nYin and yang, extending to the Five Phases,\nTogether form the Seven Qi—\nBeyond this, how could there be greater confusion?\nFor all things—whether born from egg, womb, or dampness—\nGrains, grasses, and trees all draw upon these Seven Qi to grow,\nFrom formless to formed, nurtured unseen until their bodies take shape—\nLike thieves in the night, unaware and unknowing.\n\nHeaven and Earth secretly respond with their Qi in endless interplay,\nWhile all things silently accept their nurture, each finding its place of ease.\nThus it is said: *Heaven and Earth, the thieves of all things.*\n\nAll things are thieves of humanity;\nAll things steal from Heaven to sustain life,\nWhile humanity steals from all things to nourish itself.\nIf one knows the proper balance of giving and taking,\nThis too is the natural order.\n\n*Commentary:* Humanity and beasts, grasses, and trees all draw from yin and yang to live,\nBut humanity is the most refined—\nDwelling in the central palace of the cosmos,\nWith wisdom and discernment to reflect upon its nature,\nTo fathom origins and understand the fundamental Qi of yin, yang, and the Five Phases,\nThen to model its actions accordingly.\nThus the *Zhou Yi*’s sixty-four hexagrams and sixty jia-zi cycles.\n\nTherefore, the earlier text says: *To see this is to flourish.*\nWithin the Seven Qi, all things that form and grow,\nHumanity secretly takes to sustain itself—\nThus, theft refers to fields, silkworms, and grains.\nThe *Liezi* says:\n*A certain Guoshi of Qi was wealthy and declared,*\n*\"I excel at theft! Heaven has its seasons, Earth its advantages—\nI steal the timely bounty of Heaven and Earth.\nWhen rains moisten the earth, I steal from beasts on land,\nFrom fish and turtles in water.\nI began as a thief—\nIn one year, I was self-sufficient;\nIn two, I had abundance;\nIn three, I could bestow upon the realm.\nSince then, my wealth extended to the common folk.\nI stole from Heaven and Earth without misfortune.\nBut if a man steals gold and silk from another—\nHow can he be blameless?\"*\n\nAll things steal from Heaven and Earth to grow,\nGuoshi stole from all things to sustain himself—\nYet if one knows the proper balance,\nThis too is the natural order.\nThus, the theft of all things and humanity.\n\nHumanity, the thief of all things.\nWhen the three thefts align in harmony,\nThe Three Powers flourish in peace.\n*Ji* means \"exhausted\"—\nWhen the three thefts exhaust their proper balance,\nThe Three Powers exhaust their duties in harmony.\n\n*Commentary:* It is said that humanity steals from all things to fill its wealth and rank,\nYet it does not realize that all things, in turn, steal from humanity to bring misfortune.\nThe three mutual thefts spoken of earlier—\nThis too is the natural order.\nAll such theft must follow the Dao;\nIf in accord, it brings fortune;\nIf contrary, it brings calamity.\nThus the *Liezi* asks: *Is there a Dao of theft?*\nWhy should it be without principle?\nTo see hidden treasures—*this is sageliness;*\nTo know what is permissible—*this is wisdom;*\nTo enter first—*this is courage;*\nTo depart last—*this is righteousness;*\nTo divide fairly—*this is benevolence.*\nNo thief without these five virtues exists.\nThis is the Dao within theft.\n\nIn the three thefts, each must follow its principle,\nSo that the Three Powers act without error,\nTheir duties fulfilled without exceeding their nature,\nLest misfortune arise.\nThus it is said:\n*Eat in season, and the body remains unharmed.*\n*Stir the mechanisms, and all transformations are at peace.*\nIf humanity’s nourishment is timely,\nThe body knows no fault;\nIf actions align with their proper function,\nAll things find their ease.\n\n*Commentary:* Those who govern life and fate\nMust first attend to flavors and nourishment.\nThus the *Zuozhuan* says:\n*\"Flavor and the Dao’s Qi—\nQi fills the will, nourishes the form, and moistens the spirit—\nAll must return to food and drink.\"*\nThe Yellow Emperor said:\n*\"When humanity consumes food and drink,\nIt must first balance the five flavors, five meats, five vegetables, five fruits,\nAll adjusted to the seasons and taken in proper measure.\nCooked, they benefit the body;\nRaw, they harm the organs—\nThis is the meaning of eating in season.*\nThus, if food is consumed at the proper time,\nIf flavors do not exceed their due,\nIf one remains within the middle path,\nNeither transgressing nor harming nature,\nThen the four limbs move freely,\nThe five organs remain in harmony,\nFree of illness, preserving life to its end—\nIs this not the body’s ease?\"\n\nThus the *Kangzangzi* says:\n*\"Eat abundantly in winter, and the body stays warm;\nEat abundantly in summer, and the body stays cool.\nIf warmth and coolness align with the seasons,\nThen humanity knows no sickness or plague,\nAnd lives out its natural span.*\nThus it is said:\n*Grains are humanity’s Heaven—\nThe reason kings prioritize agriculture;\nIf a king neglects agriculture, he abandons his people.\nIf the people are abandoned, what kingdom remains?\"*\n\nYet when the three thefts align in harmony,\nAnd the Three Powers fulfill their duties in peace,\nThis too is the natural order.\nThen, a wise ruler and virtuous ministers must govern the world,\nRiding the moment when harmony and peace prevail—\nWith just laws, employing the capable,\nExtending benevolence to insects,\nTransforming even grasses and trees,\nSo that every action conforms to Heaven’s mechanisms,\nAnd yin and yang follow their course,\nBringing universal tranquility,\nEnsuring all people find their ease.\nThis is to *stir the mechanisms and bring all transformations to peace*—\nThus it is said: *Within lies the law of enriching the nation and pacifying the people.*\n\nHumanity knows its spirit as spirit,\nYet does not know that the unknowable is what makes it spirit.\nYin and yang generate all things—humanity calls this spirit;\nYet it does not know that the Ultimate Dao,\nSilent and still, is what generates them—\nYin and yang are the true spirit.\n\n*Commentary:* Spirit is subtle and unfathomable.\nThe *Yi* says: *Yin and yang, when unfathomable, are called spirit.*\nHumanity sees all things born from yin, yang, and the sun and moon,\nAnd calls this spirit—\nYet it does not realize that yin, yang, sun, and moon\nThemselves arise from the unmanifest.",
      "overlap_context": ".\n- 依五行之善正 (*yī wǔxíng zhī shànzhèng*): \"Aligning with the five phases’ rectitude.\"\n- 仁义礼智信 (*rényìlǐzhìxìn*): The Five Virtues (Confucian).\n- 贞廉不失 (*zhēnlián bùshī*): \"Steadfast in integrity and modesty.\"\n- 保其禄位 (*bǎo qí lùwèi*): \"Preserving one’s rank and blessings.\"\n- 夔龙、伊尹 (*Kuí Lóng, Yī Yǐn*): Mythic and historical sage-ministers.\n- 三反昼夜 (*sānfǎn zhòuyè*): \"Ceaseless night-and-day rebellion\" (against natural order).\n- 黩武 (*dúwǔ*): \"Wanton warfare.\"*\n- 烦兵 (*fánbīng*): \"Excessive militarism.\"",
      "start_char": 4468,
      "end_char": 5724,
      "start_sentence": 200,
      "end_sentence": 264,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 15.058584690093994,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\黄帝阴符经疏.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "不神者，何也？ 至道也。 言至道虚静，寂然而不神，此不神之中能生日月、阴阳、三才、万物种种，滋荣而获安畅，皆从至道虚静中来，此乃不神之中而有神矣，其理明矣。 饮食修炼之士，明悟无为不神之理，反照正性，而修无为之业，存思守一，反朴还淳，归无为之道，玄之又玄，方证寂默而不神，此则不神而能至神，故曰明矣。 日月有数，大小有定。 圣功生焉，神明出焉。 日月运转不差度数，大小有定，方显圣功之力生焉，神明之功出焉。 疏曰：日月者，阴阳之精炁也。 六合之内，为至道也。 日月度数、大小律历之所辩，咸有定分，运转不差，故云日月有数，大小有定，圣功生焉者，六合之内，赖此日月照烛，阴阳运行而生成，万物有动植，功力微妙至於圣一，故曰圣功生焉，神明出焉者，阴阳不测之谓神，日月晶朗之谓明，言阴阳之神，日月至明，故曰神明。 言天地万物皆承圣功神明而生有，从无出有，功用显着，故曰神明出焉。 又言世间万物，皆禀此圣功而生，大之与小，咸有定分，不相违越，则小不羡大，大不轻小。 故《庄子》言鹏鴳各自逍遥，不相谴羡，此大小有定之义。 又言上至王侯，下至黎庶，各有定分，不相倾夺，上下和睦，岁稔时雍，名曰太平。 故曰：中有富国安人之法。 其盗机也，天下莫不能见，莫不能知。 君子得之固躬，小人得之轻命。 盗机深妙，易见难知。 君子知积善之机，乃能固躬； 小人务荣辱之机，而轻命也。 疏曰：盗机者，重举上文三盗之义也。 假如国氏盗天而获富，人皆见种植之机，不知其所获之深理。 何名为盗机？ 缘己之先无，知彼之先有，暗设计谋而动其机数，不知不觉，窃盗将来以润其己，名曰盗机。 言天下之人咸共见此盗机，而莫能知其深理。 设有智者、小人、君子，所见不同，君子则知固躬之机，小人则知轻命之机。 固躬之机者，君子知至道之中包含万善，所求必致，如响应声。 但设其善计，暗默修行，动其习善之机，与道契合，乃致守一存思，精心念习，窃其深妙以滋其性，或盗神水、华池、玉英、金液以致神仙。 贤人君子知此妙道之机，修炼以成圣人。 故曰：君子得之固躬矣。 小人得之轻命者，但务营求金帛，不惮劬劳。 或修才学武艺，不辞疲瘁，饰情巧智以求世上浮荣之机； 或荣华宠辱，或军旅倾败，贪婪损己； 或耽财好色，虽暂得浮荣，终不免於患咎。 盖为不知其妙道之机，以政於此。 故曰：小人得之轻命也。 此富国安人演法章中，九十二言，皆使人取舍合其机宜，明察神明之道，安化养命固躬之机也。 故曰：中有富国安人之法也。 赞曰： 天地万物，阴阳四时。 更相为盗，贵合天机。 圣功神明，非贤莫知。 固躬轻命．，审察其宜。 黄帝阴符经疏卷中竟 黄帝阴符经疏卷下",
      "translated_text": "What is this \"not-spirit\"?\nIt is the Ultimate Dao.\nThe Ultimate Dao is empty and tranquil,\nSilent and still, yet not-spirit—\nWithin this \"not-spirit\" arise sun and moon,\nYin and yang, the Three Sovereigns, and all things,\nNurturing growth and securing ease and comfort,\nAll emerging from the Ultimate Dao’s empty tranquility—\nThis is the \"not-spirit\" yet containing spirit,\nThe principle now made clear.\n\nThe sun and moon have their appointed cycles,\nThe great and small have their fixed measures.\nFrom this arises the sacred function,\nAnd from this emerges the divine luminosity.\nWhen the sun and moon revolve without deviation in their cycles,\nAnd the great and small maintain their fixed measures,\nThen the sacred function’s power is revealed,\nAnd the divine luminosity’s work manifests.\n\n*Commentary:* The sun and moon are the essence of yin and yang.\nWithin the Six Extremes, they are the Ultimate Dao.\nThe cycles of the sun and moon,\nThe fixed measures of the great and small in calendars and regulations,\nAll have their appointed divisions,\nRevolving without deviation—\nThus it is said: *\"The sun and moon have their appointed cycles, the great and small have their fixed measures.\"*\nThe sacred function arises within the Six Extremes,\nRelying on the sun and moon’s illumination,\nAnd the interplay of yin and yang,\nTo generate all things—\nPlants and animals, each with their movements,\nTheir power subtly profound, reaching even to the sacred.\nThus it is said: *\"The sacred function arises from this.\"*\nThe divine luminosity emerges from this:\nYin and yang, unfathomable, are called spirit;\nThe sun and moon, clear and luminous, are called luminosity—\nThus it is said: *\"The divine luminosity.\"*\nAll things in the world,\nGreat and small, arise from the sacred function and divine luminosity—\nFrom non-being to being, their functions and uses clearly manifest—\nThus it is said: *\"The divine luminosity emerges from this.\"*\nMoreover, all things in the world,\nGreat and small, receive this sacred function and thus exist.\nThe great does not covet the small,\nThe small does not slight the great—\nThus *Zhuangzi* says: *\"The great and small each find ease in their own way, without envy or reproach,\"*\nThis is the meaning of *\"the great and small have their fixed measures.\"*\nFrom the highest nobles to the lowest commoners,\nEach has their appointed fate,\nWithout mutual encroachment or usurpation—\nAbove and below in harmony,\nYears of abundant harvests and prosperous seasons,\nThis is called the Great Peace.\nThus it is said: *\"Within lies the law of enriching the nation and pacifying the people.\"*\n\nAs for *stealing the mechanisms*,\nNo one in the world can see them,\nNo one can know them.\nThe virtuous who obtain them secure their bodies,\nThe petty who obtain them risk their lives.\nStealing the mechanisms is profound and subtle,\nEasy to see yet difficult to know.\nThe virtuous understand the mechanisms of accumulating virtue,\nThus securing their bodies;\nThe petty grasp the mechanisms of honor and disgrace,\nThus risking their lives.\n\n*Commentary:* Stealing the mechanisms refers again to the three thieves from earlier.\nIf a kingdom or family steals from Heaven to gain wealth,\nAll see the mechanisms of sowing and reaping,\nYet none know the profound principles behind their gains.\nWhy is it called *stealing the mechanisms*?\nBecause they take from where there was none before,\nAnd exploit where there was abundance before—\nIn secret they contrive schemes,\nMoving the mechanisms without awareness,\nUnknowingly plundering what is to come,\nTo enrich themselves—\nThis is called *stealing the mechanisms*.\nIt is said that all under Heaven see this stealing,\nYet none can know its profound principles.\nAmong the wise, the petty, and the virtuous,\nTheir perceptions differ—\nThe virtuous know the mechanisms of securing their bodies,\nThe petty know the mechanisms of risking their lives.\nThe mechanisms of securing the body:\nThe virtuous know that within the Ultimate Dao lies all virtue,\nAnd whatever they seek will surely be attained—\nLike echoes answering calls.\nThey merely set forth their virtuous schemes,\nSilently cultivate their practices,\nActivating the habit of virtue,\nIn harmony with the Dao—\nThus they achieve *guard-one and ponder*,\nConcentrating their essence and refining their nature,\nStealing the profound mysteries to nourish their lives,\nOr stealing *spirit-water, flower-pools, jade-essence, golden elixirs*\nTo attain immortality.\nThe worthy and virtuous, knowing these subtle mechanisms,\nCultivate and refine to become sages.\nThus it is said: *\"The virtuous who obtain them secure their bodies.\"*\n\nThe petty who obtain them risk their lives:\nThey only seek to amass gold and silk,\nSpurning no labor.\nOr they cultivate talents, skills, and martial arts,\nWithout regard for exhaustion,\nAdorning their cleverness and cunning to seize the mechanisms of worldly glory;\nOr they revel in honor and favor,\nOr in military defeat and ruin,\nTheir greed harming themselves;\nOr they indulge in wealth and lust,\nThough they gain fleeting glory,\nThey inevitably incur calamity and blame.\nIt is because they do not know the subtle mechanisms of the Dao,\nAnd instead rely on these.\nThus it is said: *\"The petty who obtain them risk their lives.\"*\n\nWithin this chapter on *enacting the laws of enriching the nation and pacifying the people*,\nAll ninety-two words instruct people in taking and discarding according to their mechanisms,\nIn discerning the divine luminosity of the Dao,\nAnd in securing their bodies and nurturing their lives through its profound principles.\nThus it is said: *\"Within lies the law of enriching the nation and pacifying the people.\"*\n\n*Praise:*\nHeaven and Earth, all things,\nYin and yang, the four seasons.\nMutually stealing from each other,\nPrecious in aligning with Heaven’s mechanisms.\nThe sacred function and divine luminosity,\nOnly the worthy can know.\nSecuring the body or risking the life—\nCarefully examine their suitability.\n\n*Conclusion of the Second Scroll of the Yellow Emperor’s Yinshu Commentary*\n*Beginning of the Third Scroll of the Yellow Emperor’s Yinshu Commentary*",
      "overlap_context": " makes it spirit.\nYin and yang generate all things—humanity calls this spirit;\nYet it does not know that the Ultimate Dao,\nSilent and still, is what generates them—\nYin and yang are the true spirit.\n\n*Commentary:* Spirit is subtle and unfathomable.\nThe *Yi* says: *Yin and yang, when unfathomable, are called spirit.*\nHumanity sees all things born from yin, yang, and the sun and moon,\nAnd calls this spirit—\nYet it does not realize that yin, yang, sun, and moon\nThemselves arise from the unmanifest.",
      "start_char": 5724,
      "end_char": 6799,
      "start_sentence": 265,
      "end_sentence": 309,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 15.147322177886963,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\黄帝阴符经疏.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "少室山李筌疏 强兵战胜演术章 瞽者善听，聋者善视。 绝利一源，用师十倍； 三反昼夜，用师万倍。 绝利者，塞耳则视明，闭目则听审，务使身心不乱，主事精专也。 疏曰； 言人眼贪色则耳不闻正声，听淫声则目不睹正色，此视听二徒俱主於心也。 道德之士心无邪妄，虽耳目闻见万种声色，其心正定，都无爱悦贪着之心，与无耳目不殊，何必在於聋瞽者哉？ 但心中纳正，则耳目无邪； 耳目无邪，则身心不乱； 身心不乱，则精思举事发机皆合於天道。 比之凡情，十倍利益。 事皆成遂，何必独在用师。 他皆仿此。 三反昼夜，用师万倍者，上云身心正定，耳目聪明，举事发机，比常十倍。 就中更能三思反覆，日夜精专，举事发机，比常情万倍，何必独在用师也？ 《论语》云：三思而后行，再，斯而可矣。 使人用心必须精审，此之义也。 所言师者，兵也。 兵者，凶器。 战者，危事。 处战争之地、危亡之际，必须三反精思，深谋远略，若寡於谋虑，轻为进退，竟致败亡。 所以将此耳目精思，引以用师为喻，切令修炼保护其身，非真用师也。 道德之士，嫉恶如雠，知此耳目绝利之源，三反精思之义，深沉审细，理正居贞，诛锄邪佞之贼，自固其躬久，久成道，则黄帝灭蚩尤是也。 至如古今名将，孙、吴、韩、白、武侯、卫公，皆善用师，悉能三反昼夜，成功立事以致荣华，然终谓强兵战胜之术，以为轻命之机，必也。 黄帝得之以登云天，傅说得之以处玄枵也。 故上文云：君子得之固躬，小人得之轻命。 心生於物，死於物，机在目。 心贪於物者损寿，目视无厌则意荒。 但戒目收心，则无祸败之患也。 疏曰：道德之士，心不妄生，机不妄动，辄加於物情。 而耽徇之人，取万物资身养命者，亦天然之理。 但不令越分乖宜，反伤其性。 故亢仓子言：万人操弓，共射一招，招无不中。 招，垛也。 亦云：招，箭人也。 万物彰彰，以害一生，生无不伤者，以养性命也。 今代之惑者，多以性养物，不知休息。 此言心生贪婪，为物所盗，使人祸败耳。 《家语》云：嗜欲无厌、贪求不止者，刑其杀之。 《老子》云：知足不辱，知止不殆。 可以长久。 所贵知足。 适其中，不令将心苦贪於物，反伤正性，必害於人。 故《刘子》云：火林养鸟、温汤养鱼之义，以生於物、死於物也。 机在目者，言人动生妄； 心加於物者，皆由自睹而心生。 故云：机在目欲，令戒慎其目，勿令妄视邪淫之色，使心於物不生妄动之机，不挠其性以固寿保躬也。 天之无恩而大恩生。 天地生而不有，为而不恃，长养万物，不求恩报，而万物感其覆育，自有恩生。",
      "translated_text": "「Li Qin’s Commentary on *Yinshu* from Shaoshan:\n**Chapter on the Dao of Military Strength and Victory**\n\nThe blind excel in hearing, the deaf excel in sight.\nCut off one source of profit, and the use of troops becomes tenfold advantageous;\nThreefold reflection day and night, and the use of troops becomes ten thousandfold advantageous.\n\n*Cutting off profit* means:\nSeal the ears to see clearly, close the eyes to hear keenly,\nStrive to keep body and mind unperturbed, and focus the mind on affairs with precision.\n\nThe commentary says:\nWhen a man’s eyes are greedy for color, his ears fail to hear the true sound;\nWhen his ears indulge in lewd music, his eyes cannot behold the proper hue—\nFor sight and hearing are both governed by the mind.\n\nThe virtuous Daoist’s mind is free from deceit,\nThough his ears and eyes perceive myriad sounds and hues,\nHis mind remains steadfast and pure,\nUnshaken by love, desire, or avarice—\nEqual to one without ears or eyes,\nWhy must he be blind or deaf?\n\nOnly when the mind harbors rectitude,\nDo ears and eyes remain untainted;\nWhen ears and eyes are untainted,\nDo body and mind remain unperturbed;\nWhen body and mind are unperturbed,\nDo all actions, thoughts, and strategies align with Heaven’s Dao.\n\nCompared to the common man, this yields tenfold advantage.\nAll undertakings succeed—\nWhy must one rely solely on military strength?\n\nOthers follow this principle likewise.\nThreefold reflection day and night makes military strength ten thousandfold advantageous,\nFor the virtuous Daoist’s body and mind are steadfast,\nHis ears and eyes are sharp,\nHis actions and strategies tenfold more effective than the ordinary.\nWithin this, if he further practices threefold deliberation,\nDay and night with unwavering focus,\nHis actions and strategies become ten thousandfold more potent—\nWhy must he rely solely on military strength?\n\n*The Analects* states:\n“Think thrice before acting; twice, and it may be acceptable.”\nThis urges the mind to be meticulous and discerning—\nSuch is its meaning.\n\nWhat is meant by *troops* is *arms*.\n*Arms* are instruments of slaughter,\n*War* is a perilous affair.\nWhen stationed in lands of conflict or amid crises of life and death,\nOne must reflect threefold and deliberate deeply,\nPlan with foresight and strategy—\nIf he is negligent in counsel, reckless in advance or retreat,\nHe will surely meet defeat.\n\nThus, this teaching of sealing the ears and eyes,\nAnd of threefold reflection,\nIs likened to military strength\nTo compel one to refine his body through cultivation,\nNot to truly wield troops.\n\nThe virtuous Daoist detests evil as a sworn enemy,\nUnderstanding the source of *cutting off profit*\nAnd the principle of *threefold reflection*,\nHe remains profound, cautious, and unyielding,\nHis nature aligned with rectitude, his dwelling steadfast,\nRooting out the wicked and the sycophant—\nThus securing his own life for long.\nIn time, this becomes the Dao,\nAs when the Yellow Emperor subdued *Chiyou*.\n\nEven great generals of past and present—\nSunzi, Wuqi, Han Xin, Bai Qi, Zhuge Liang, and Wei Gong—\nAll excelled in military strategy,\nMastering threefold reflection day and night,\nAchieving success and establishing their names with honor.\nYet they still considered military strength and victory\nAs means to *lighten the burden of life*,\nForcing one to risk his fate—\nAs the Yellow Emperor did when ascending to the Cloudy Heights,\nAnd *Fuyue* did when dwelling in the *Xuanxiao* abyss.\n\nHence the earlier text says:\n“The noble attains security in his person; the petty man risks his life.”\n\nThe mind arises from things, perishes from things; the key lies in the eyes.\nWhen the mind is greedy for things, it shortens one’s lifespan;\nWhen the eyes gaze without restraint, the will becomes dissipated.\nBut if one guards the eyes and restrains the mind,\nThere will be no calamity or ruin.\n\nThe commentary says:\nThe virtuous Daoist’s mind does not give rise to falsehood,\nHis faculties do not move erratically,\nYet he attends to all things.\nBut those who indulge in excess,\nTaking all things to nourish their bodies and sustain their lives,\nAlso follow nature’s way—\nYet they must not overstep their bounds or act contrary to propriety,\nOr they will harm their own nature.\n\nHence *Gang Cangzi* says:\n“If ten thousand men each draw a bow,\nAnd shoot at a single target,\nNo arrow will miss.”\nThe target is a *mound*—\nOr it is said: the target is the *arrowman*.\nAll things are clearly visible,\nYet they harm but one life—\nA life that will surely be injured,\nFor the sake of nourishing its nature and sustaining its vitality.\n\nIn this age, the deluded take nature to nourish things,\nUnknowing how to rest and preserve themselves.\nThis speaks of how the mind, once greedy,\nIs stolen by things,\nBringing ruin and disaster to man.\n\n*The Family Sayings* states:\n“Those who indulge without restraint,\nWho seek without end,\nShall be punished with death.”\n\n*The Laozi* says:\n“Knowing contentment brings no disgrace,\nKnowing when to stop brings no peril.\nThis is the way to endure.”\n\nThus, the precious lesson is *knowing contentment*.\nModeration in all things,\nNot straining the mind with avarice for external gain,\nOr harming one’s true nature—\nThis is the path that does not injure.\n\nHence *Liuzi* says:\n“The meaning of nurturing birds in a firewood grove,\nAnd fish in a warm spring—\nIs to live by things, yet perish by things.”\n\n*Key lies in the eyes* means:\nWhen one’s movements give rise to falsehood,\nWhen the mind is drawn to things—\nAll originate from self-perception.\nThus it is said: *Key lies in the eyes*—\nCommand one to be vigilant in guarding them,\nNot to gaze upon lewd or licentious hues,\nSo that the mind does not generate false movements toward things,\nAnd thus his nature remains unharmed,\nSecuring his lifespan and preserving his person.\n\nHeaven’s nature is without favor yet great favor is born;\nHeaven and Earth give birth yet do not possess,\nThey act yet do not claim,\nNourishing all things without seeking repayment—\nYet all things, moved by their shelter and sustenance,\nGenerate favor in return.\n\n*End of the Third Scroll of Li Qin’s Commentary on the Yellow Emperor’s Yinshu*」",
      "overlap_context": " enriching the nation and pacifying the people.\"*\n\n*Praise:*\nHeaven and Earth, all things,\nYin and yang, the four seasons.\nMutually stealing from each other,\nPrecious in aligning with Heaven’s mechanisms.\nThe sacred function and divine luminosity,\nOnly the worthy can know.\nSecuring the body or risking the life—\nCarefully examine their suitability.\n\n*Conclusion of the Second Scroll of the Yellow Emperor’s Yinshu Commentary*\n*Beginning of the Third Scroll of the Yellow Emperor’s Yinshu Commentary*",
      "start_char": 6799,
      "end_char": 7811,
      "start_sentence": 310,
      "end_sentence": 360,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 17.207148790359497,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\黄帝阴符经疏.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "疏曰：天地万物，自然有之。 此皆至道之所含育，不求恩报於万物，万物承天之覆育，自怀恩於天。 故《老子》言：生而不有，为而不恃，长而不宰。 迅雷烈风，莫不蠢然。 迅雷烈风，阴阳动用，人自怀惧，蠢然而惊。 疏曰：迅雷者，阴阳激搏之声也； 烈风者，《庄子》言：大块噫炁，其名为风。 凡此风雷，阴阳自有，本不威人，人自畏之，莫不蠢然而动，怀惊惧也。 此言道德之君，抚育万灵，同天地之不仁，则大地、人民、禽兽、草木皆自归恩於君，感戴如天，各守其分，各安其业，无不逍遥也。 明君但施其正令，以示国章，兆人睹其威命，如迅雷烈风，莫不蠢然而动，咸生恐惧之心，各自警戒，各自慎行也。 以此治军，则将勇兵强，上威下惧，必能诛暴定乱。 故言：下有强兵战胜之术也。 至乐性余，至静则廉。 至尚廉静，则心无忧惧； 情怀悦乐，而逍遥有余。 疏曰：至乐者，非丝竹欢娱之乐也。 若以此乐必无余。 故《家语》云：至乐无声，而天下之人安。 《三略》云：有道之君以乐乐人。 此言贤人君子以心平性正，不欺於物，不徇於时，理国安家，无淫刑滥罚，不越国章，身无过犯，无所忧惧，自然心怀悦乐，情性怡逸，逍遥有余。 岂将丝竹欢宴之乐而方比此乐乎？ 至如古人鼓琴拾穗，行歌待终，故曰：至乐性余也。 至静，则廉者既不为小人，丝竹奢淫之乐，自保其无忧无事之欢。 如此则不为声色所挠，而性静情逸，神贞志廉也。 亢仓子曰：贵则语通，富则身通，穷则意通，静则神通。 引此四通之体，义存乎一，故谓至乐至静也。 人能至静，可致神通，是名至静则廉也。 夫将帅之体，贵其廉静，杜其喧挠，赏罚不差，父子为军，心怀悦乐，性多余勇，然可摧凶克敌，功业必成。 故曰：下有强兵战胜之术也。 夫能栖神静乐之间，谓之守中，六情不染，二景常然。 天之至私，用之至公。 天道幽隐，不可窥测，至私也； 万物生成，圣功显着，至公也。 疏曰：天者，至道也。 言至道包含万类，幽深恍惚，无有形段，不可窥测，是名至私。 私者，隐匿之义也。 能於杳冥之中，应用无穷，生成万物，各具形体，随用立名。 乃至公也。 公者，明白显用，众可观之义也。 此言道德之君，智虑广博，包总万机，智谋巧拙，进退可否，悉能私隐於深心，人不可得而窥之，是至私也。 及其动用，观善恶，察是非，施政令，行赏罚，显然明白，为天下之可观，乃至公也。 故曰：天之至私，用之至公也。 为军帅之体，能用以隐密，机数难窥，取舍如神，威恩显着，上清下正，将勇兵强，克敌摧凶，功业盛茂，故曰：下有强兵战胜之术也。 禽之制在炁。 鹏搏九万，积炁而升； 蜩鸠抢揄，决起而上。 皆能制炁，进退而自由也。 疏曰：禽者，羽化百鸟之类也。 炁者，天地阴阳之炁也。 人之运动，皆以手足进退为利； 禽鸟运动，皆以翅羽鼓炁。 心动翅鼓，无所不之，上下由之； 况人最灵，不能善用天机道德之炁，固躬养命以致长生久视乎？ 若人善能制道德之炁，则遨游太虚，禽鸟不足比也。 为军帅之体，善用五行休王之炁，能知阴阳制伏之源，则摧凶克敌，不足为难。 故曰：下有强兵战胜之术者也。 生者，死之根；",
      "translated_text": "「The *Commentary* states: Heaven and Earth, along with all ten thousand things, are naturally possessed. These are all nurtured by the supreme **Dao/Way**, which does not seek favor or repayment from all things. Instead, all things, receiving Heaven’s shelter and sustenance, naturally harbor gratitude toward Heaven. Hence, *Laozi* says: *\"Give birth yet do not possess; act yet do not claim; nourish yet do not slaughter.\"* When thunder crashes and winds rage, all tremble in fear. Thunder and wind arise from the movement of yin and yang; people naturally feel dread, and thus they tremble and are startled.\n\nThe *Commentary* states: **Thunder** is the sound of yin and yang clashing violently; **wind** is what *Zhuangzi* calls: *\"The Great Mass exhales **qi**—its name is wind.\"* All such winds and thunders are inherent to yin and yang, originally not meant to threaten humans, yet humans fear them, trembling and moving in response, filled with awe.\n\nThis describes the **Dao/Way** and **virtue/power** of the sage-ruler, who nurtures all living beings, mirroring Heaven and Earth’s lack of partiality. Thus, the land, the people, birds and beasts, plants and trees all spontaneously return their gratitude to the ruler, revering him as Heaven itself, each abiding by their station and prospering in their endeavors, all in perfect ease.\n\nA wise ruler merely implements just decrees, establishing the national order. When the people witness his authority, like the crashing thunder and raging winds, they tremble and are filled with fear, each self-alert and cautious in their conduct. Thus, in governing armies, generals become bold and soldiers strong, with the ruler inspiring fear below and commanding awe above, ensuring the suppression of tyranny and the pacification of chaos. Hence it is said: *\"There lies below the means to forge strong armies and conquer foes.\"*\n\n**Extreme joy** is a surplus of nature’s ease; **extreme stillness** brings forth **virtue/power**. When one upholds the utmost **virtue/power** of stillness and joy, the heart knows no fear or dread; when one’s emotions embrace delight and ease, there is boundless **adventure** and freedom.\n\nThe *Commentary* states: **Extreme joy** is not the frivolous music and revelry of strings and pipes. If one sought such pleasures, there would be no surplus. Hence, *The Family Sayings* say: *\"Extreme joy is silent, yet all under Heaven find peace.\"* *The Three Strategies* say: *\"A **Dao/Way**-governed ruler governs through joy.\"* This means that the virtuous sage, with a tranquil mind and rectified nature, does not deceive the world nor yield to temporal trends, ruling the state and securing the home without wanton punishments or excessive penalties, never transgressing the national order. The sage’s person remains unblemished, with no cause for fear or dread, and thus the heart naturally overflows with delight, emotions serene and at ease, with **adventure** and freedom in abundance. How could such **extreme joy** be compared to the fleeting pleasures of strings and pipes?\n\nAs for the ancients, they played the zither while gathering fallen grains, sang as they walked while awaiting their fate—hence it is said: *\"**Extreme joy** is a surplus of nature’s ease.\"* In **extreme stillness**, one who upholds **virtue/power** does not indulge in the vulgarities of the petty man, nor in the licentious pleasures of strings and pipes. Instead, they preserve their own fearless and carefree delight. Thus, they are not swayed by sounds and colors, maintaining a still nature, serene emotions, a steadfast spirit, and resolute **virtue/power**.\n\nGāng Cāngzǐ says: *\"Nobility brings harmony in speech; wealth brings harmony in the body; poverty brings harmony in thought; stillness brings harmony in the spirit.\"* These four harmonies stem from a single principle, hence they are called **extreme joy** and **extreme stillness**. When a person attains **extreme stillness**, they can achieve harmony of the spirit, which is why it is said: *\"**Extreme stillness** brings forth **virtue/power**.\"*\n\nThe nature of a military commander must uphold **virtue/power** and stillness, suppressing clamor and disorder. Rewards and punishments must be precise and just; father and son serve as one in the army, their hearts filled with joy, their spirits overflowing with vigor. Yet they can crush the wicked and vanquish enemies, their achievements certain to flourish. Hence it is said: *\"There lies below the means to forge strong armies and conquer foes.\"*\n\nFor the commander who dwells in the balance of spirit and stillness—what is called *guarding the center*—the six passions are untainted, and the two **qi** currents remain constant. Heaven’s utmost **privacy** manifests in its utmost **publicity**. The **Dao/Way** of Heaven is profound and elusive, beyond measure or scrutiny—this is its **privacy**. Yet all things are born and formed, their sacred functions evident and clear—this is its **publicity**.\n\nThe *Commentary* states: Heaven is the supreme **Dao/Way**. The supreme **Dao/Way** encompasses all classes of existence, its depths unfathomable and formless, beyond scrutiny—this is called **privacy**. Privacy refers to that which is hidden and concealed. Within the boundless void, it applies itself infinitely, giving birth to all things, each with their own form and name as they arise. This is the utmost **publicity**. Publicity means clarity and evident function, observable by all.\n\nThis describes the **Dao/Way** and **virtue/power** of the sage-ruler: their wisdom and foresight are vast, encompassing all affairs. Their strategies are both subtle and direct, their judgments both cunning and straightforward, all concealed within their profound mind, beyond human perception—this is **privacy**. Yet when they act, observing good and evil, discerning right and wrong, issuing decrees, and meting rewards and punishments, their actions are clear and evident, serving as a model for all under Heaven—this is **publicity**. Hence it is said: *\"Heaven’s utmost **privacy** manifests in its utmost **publicity**.\"*\n\nThe nature of a military commander, when they apply this principle with secrecy and cunning, making their schemes difficult to discern, and their rewards and punishments evident like thunder and wind, ensures that the leader remains pure while the soldiers are upright. Generals become bold and soldiers strong, crushing enemies and vanquishing the wicked, their achievements grand and flourishing. Hence it is said: *\"There lies below the means to forge strong armies and conquer foes.\"*\n\nThe method of birds lies in their **qi**. The **peng** bird soars to nine heavens, gathering **qi** to ascend; the **tiáo** and **jiū** birds flap their wings and rise swiftly. All can control their **qi**, moving forward and backward with freedom.\n\nThe *Commentary* states: Birds are the feathered and transformed creatures of the ten thousand things. **Qi** is the vital **qi** of Heaven and Earth, yin and yang. Human movement relies on hands and feet for advancement and retreat; birds rely on wings and feathers to agitate their **qi**. When the mind moves, the wings beat, and there is no place they cannot reach—ascending and descending as they will. How much more so for humans, the most refined of beings, who cannot even properly harness the **Dao/Way** and **virtue/power** of Heaven’s **qi**? They should instead cultivate their bodies and nourish their lives to achieve longevity and eternal vision.\n\nIf humans could master the **Dao/Way** and **virtue/power** of **moral qi**, they would wander effortlessly through the boundless **Great Void (Tàixū)**, surpassing even birds. For a military commander who skillfully employs the **qi** of the Five Phases in their cycles of flourishing and decline, and understands the sources of yin and yang’s control and subjugation, crushing the wicked and vanquishing enemies would be no challenge at all. Hence it is said: *\"There lies below the means to forge strong armies and conquer foes.\"*\n\n**Life** is the root of **death**;」",
      "overlap_context": ",\nSo that the mind does not generate false movements toward things,\nAnd thus his nature remains unharmed,\nSecuring his lifespan and preserving his person.\n\nHeaven’s nature is without favor yet great favor is born;\nHeaven and Earth give birth yet do not possess,\nThey act yet do not claim,\nNourishing all things without seeking repayment—\nYet all things, moved by their shelter and sustenance,\nGenerate favor in return.\n\n*End of the Third Scroll of Li Qin’s Commentary on the Yellow Emperor’s Yinshu*」",
      "start_char": 7812,
      "end_char": 9057,
      "start_sentence": 361,
      "end_sentence": 417,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 21.662921905517578,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\黄帝阴符经疏.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "死者，生之根＃1； 愚人徇物而贪生，违生之理者促寿； 贤人损己以求道，德其妙者固躬而不亡。 疏曰：此言人之在世，贪生恶死，皆自厚养其身，恐致灭亡也。 鞠养身命，必须饮食衣服，此亦天然自合之理。 故《庄子》言：耕而食，识而衣，其德不离。 织而衣，耕而食，是谓同德。 故知人生必资衣食之育养也。 然在於俭约处中则吉，若纵恣奢溢过分则凶，而反害其生也。 至若上古之人巢居穴处，情性质朴，亦不知有长生短促之理，任自然，而逍遥，年寿长永； 后代真源道丧，浮薄将兴，广设华宇，衣服纨彩，滋味肴膳，越分怡养，恐身之不康，殊不知养之太过，役心损虑，反招祸患，为促寿之根本。 故曰：生者死之根，死者生之根者。 至如道德之士，损己忘劬以求长生之术，或则餐霞服炁，辟谷休粮，心若死灰，形同槁木，世人观之，必死之象，殊不知长生之根本也。 故曰：死者生之根也。 夫将帅之体，能知幸生即死，必死而反生者，则全军保众，为良将焉。 故兵术曰； 致兵於死地而反生。 此是强兵战胜之术也。 《庄子》曰：方生方死，方死方生也。 恩生於害，害生於恩。 君子勉善而感恩，恩生於害也； 小人辜恩而起害，害生於恩也。 疏曰：此言人心向背，恩害互生也。 本来无害亦无恩，因救害而有恩，则恩生於害。 至如贤人君子小有患难，得人拯拔，怀恩感激，终身不忘，是恩生於害也。 至如小人承君子之上恩顾，身居荣禄，不能戒慎终始保守，一朝恃宠失权，身陷刑网，不知己过，反生怨害，此曰害生於恩。 道德之士感天地覆育之恩，不辜至道生成之德，修善行正，反朴还元，则无害可生於恩，恩亦无由生於害，不将恩害以挠性，守静默以生淳和。 至如恩害相生，宠辱更致者，小人之道也。 为将帅之体，不负皇恩，不骄荣宠，慎终如始，保守恩光，竭力尽忠，成功立事，恩亦无由生於害，害亦无由起於恩，以道德临戎，有征无战，岂不美哉？ 故云：下有强兵战胜之术也。 愚人以天地文理圣，我以时物文理哲。 愚人见星流日晕、风雨雷电、水旱灾蝗而生忧惧，殊不知君臣道德、政理淳和矣。 安抚黎人，转祸为福，以此时物文理哲，唯圣我知之者矣。 故天地悬日月以照善恶，垂列宿以示吉凶，皆道德自然之理矣。 愚人仰视三光，观天文之变易，睹雷电之震怒，或寒暑不节，或水旱虫蝗，恐祸及身，悉怀忧惧，愚人以此为天地文理圣也。 时物文理者，但君怀廉静，臣效忠贞，獹鹊不喧，边烽无燧，兆人康乐，寰宇宁泰，纵天地灾祥，无能为也。 圣我以此为时物文理者，故《家语》云：殷太戊之时，道缺法邪，以致之孽桑谷忽生於朝，七日大拱。 占者曰：桑谷野木，合生於郊。 今生於朝，国亡矣，太戊恐惧，侧身修德，思君臣之政，明养人之道，三年之后，远方慕义，重译而至十有六国。 则桑谷无能为灾。 夫子曰：存亡祸福，皆在於己，天灾地妖不能加也。 则妖祸不胜善政，怪梦不胜善行。 又尧遭洪水九年，汤遭大旱七载，兆庶和平，人无饥色，何者？ 为君有道，政理均和，主信臣忠，百姓戴上，虽有水旱，不能为灾也。 水旱者，天地也。 文理者，时物也。 若明时物之理者，皆能转祸为福，易死而生。",
      "translated_text": "「**Death** is the root of **Life**#1; the foolish cling to things and covet **Life**, thus hastening their own **death** by defying its natural principles. The virtuous sacrifice themselves to seek the **Dao/Way**, and those who grasp its subtlest **virtue/power** preserve their bodies without perishing. The *Cūshu* explains: This speaks of how mortals in this world, greedy for **Life** and loathing **Death**, indulge their own bodies excessively, fearing annihilation.\n\nTo nurture **Life** and body, one must depend on food, drink, clothing, and shelter—these too are the natural principles of Heaven. Hence *Zhuangzi* says: *\"Till the soil and eat; weave and wear.\"* Their **virtue/power** does not stray. To weave and wear, to till and eat—this is called **harmony of virtue/power**.\n\nThus it is known that **Life** must rely on the nourishment of clothing and food. Yet moderation and frugality bring fortune, while excess and indulgence invite calamity and harm **Life** itself. Even the ancients, dwelling in nests and caves, with simple and pure natures, knew nothing of longevity or brevity, following only the natural course and wandering at ease, their years long and enduring.\n\nIn later generations, the true **Dao/Way** was lost, superficiality arose, and palaces were grandly built with ornate dwellings, silken garments, and rich delicacies. They overindulged in luxuries, fearing their bodies might not thrive, yet they failed to realize that over-nurturing exhausts the mind, harms the thoughts, and in truth invites disaster—the very foundation of hastening **Death**. Hence it is said: **\"Life** is the root of **Death**, and **Death** is the root of **Life**.\"\n\nYet the **Dao/Way**-virtuous cultivate **Life** by self-sacrifice and ceasing toil, seeking the art of longevity. Some may dine on mist and wear **qi**, abstaining from grains and food, their hearts like cold ashes, their bodies withered as dry wood. To the world, they appear as symbols of **Death**, yet they truly grasp the foundation of **Life**. Hence it is said: **\"Death** is the root of **Life**.\"\n\nFor a military commander who understands that **Life** is but **Death** in waiting, and that **Death** can bring forth **Life**, they can safeguard their troops and preserve the multitude, becoming a great general. Hence the military arts say: *\"Drive the army to the brink of **Death** and bring it back to **Life**.\"* This is the method of strong armies and victory in battle.\n\n*Zhuangzi* says: *\"Life and death are simultaneous; death and life are simultaneous.\"* **Grace** arises from **harm**; **harm** arises from **grace**. The **Dao/Way**-virtuous strive for good and feel **grace**, thus **grace** arises from **harm**; the petty betray **grace** and invite **harm**, thus **harm** arises from **grace**. The *Cūshu* explains: This speaks of how human hearts incline or turn away, with **grace** and **harm** mutually generated.\n\nIn truth, there is neither **harm** nor **grace** inherently. When one rescues from **harm**, **grace** emerges—thus **grace** arises from **harm**. Even when the **Dao/Way**-virtuous face minor misfortunes, and others save them, they hold **grace** in their hearts and feel gratitude, never forgetting it in their lifetimes—this is **grace** arising from **harm**.\n\nYet when the petty receive the **grace** of the **Dao/Way**-virtuous and enjoy honor and wealth, failing to guard it with caution from beginning to end, they rely on favor but lose their standing, fall into legal ruin, and unaware of their own faults, breed resentment and **harm**—this is called **harm** arising from **grace**.\n\nThe **Dao/Way**-virtuous, moved by Heaven and Earth’s nurturing **grace**, do not betray the **virtue/power** of the **Dao/Way**’s creation. They cultivate goodness and rectify their conduct, returning to simplicity and the origin, thus no **harm** can arise from **grace**, nor can **grace** emerge from **harm**. They do not let **grace** and **harm** disrupt their nature, but uphold stillness and silence to generate purity and harmony.\n\nAs for those who let **grace** and **harm** cycle endlessly, and whose favor and disgrace alternate ceaselessly, these are the petty’s ways.\n\nFor a military commander, they bear no debt to the imperial **grace**, do not grow arrogant from honor or favor, and guard their virtue with the same care from beginning to end. They preserve the **grace** of their virtue, exhaust all efforts in loyalty, achieve success and establish deeds—thus **grace** cannot arise from **harm**, nor can **harm** emerge from **grace**. When they govern with **Dao/Way** and **virtue/power**, they march with purpose but do not wage war—how splendid!\n\nHence it is said: *\"There lies below the means of strong armies and victory in battle.\"* The foolish take Heaven and Earth’s patterns and principles as divine omens, while I see the patterns and principles of the times and things as profound wisdom. The foolish, seeing stars falling or solar halos, winds and rains, thunder and lightning, floods and droughts, locust plagues, grow anxious and fearful, yet they fail to recognize that the **virtue/power** of ruler and subject is harmonious, and the governance pure and balanced.\n\nThey pacify the common folk, turning calamity into fortune, and through this wisdom of the times and things, only the **Dao/Way**-virtuous and I know it. Hence Heaven and Earth hang the sun and moon to illuminate good and evil, and array the constellations to show auspicious and inauspicious signs—all are the natural principles of **Dao/Way** and **virtue/power**.\n\nThe foolish gaze upward at the three luminaries, observe the changes in celestial patterns, witness the wrath of thunder and lightning, or note the irregularity of cold and heat, or floods and droughts, or insect plagues, fearing disaster may strike them, and thus harbor endless dread. The foolish mistake these for Heaven and Earth’s patterns and principles.\n\nThe patterns and principles of the times and things are only this: when the ruler maintains purity and stillness, and the ministers exhibit loyalty and integrity, the magpies do not caw in discord, the frontier beacons are not falsely lit, the common folk live in peace, and the world is tranquil. Even if Heaven and Earth display omens of calamity, they cannot prevail.\n\nThe **Dao/Way**-virtuous and I know this as the patterns and principles of the times and things. Hence *Jiāyǔ* says: *\"In the time of Shang’s King Tàiwù, the **Dao/Way** was lost and governance corrupt, so the disaster of the wild mulberry appeared in the court—it grew seven days into a great arch. The diviner said: ‘The wild mulberry is a forest tree; it should grow in the suburbs. Now it grows in the court, the state will perish.’ King Tàiwù, fearful, turned to cultivating **virtue/power**, pondering the governance of ruler and subject, clarifying the way to nurture people. Three years later, distant lands admired his righteousness, and sixteen states came bearing tribute. Thus the wild mulberry could not bring disaster.\"*\n\nThe Master said: *\"The fate of survival or ruin, of fortune or misfortune, all lies within oneself. Heaven’s calamities and Earth’s portents cannot impose upon it.\"* Thus, portents of disaster cannot overcome virtuous governance, and strange dreams cannot overcome righteous conduct.\n\nEven when Yao faced the great flood for nine years, and Tang endured a great drought for seven years, the common folk lived in peace and none suffered hunger—why? Because the rulers followed the **Dao/Way**, their governance was balanced and harmonious, their word trusted and their ministers loyal, and the people revered them above. Though there were floods and droughts, they could not bring disaster.\n\nFloods and droughts are Heaven and Earth. Patterns and principles are the times and things. If one understands the principles of the times and things, they can all turn calamity into fortune and transform **Death** into **Life**.»",
      "overlap_context": " qi**, they would wander effortlessly through the boundless **Great Void (Tàixū)**, surpassing even birds. For a military commander who skillfully employs the **qi** of the Five Phases in their cycles of flourishing and decline, and understands the sources of yin and yang’s control and subjugation, crushing the wicked and vanquishing enemies would be no challenge at all. Hence it is said: *\"There lies below the means to forge strong armies and conquer foes.\"*\n\n**Life** is the root of **death**;」",
      "start_char": 9057,
      "end_char": 10290,
      "start_sentence": 418,
      "end_sentence": 464,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 22.696988344192505,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\黄帝阴符经疏.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "故曰：我有时物文理哲。 夫为军师之体，日晕五色，星流四维，怪兽冲营，野鸟入室，以天地文理示其灾祥，但能修政令，设谋虑，思抚士卒，转祸为福，则敌何敢当？ 此乃时物文理哲也。 故曰：下有强兵战胜之术也。 下章一百三言，皆使人深思静虑，恩害不生，晓达存亡，公私隐密，开物成务，观天相时。 故曰：下有强兵战胜之术也。 赞曰：绝利一源，三思反覆。 徇物之机，生死在目。 乐出安静，恩生害酷。 天地灾祥，时理为福。 自然之道静，故天地万物生。 天地之道浸，故阴阳胜。 良曰：天地之道浸微，而唯胜者也。 阴阳相推而变化顺矣。 良曰：言阴阳相推，激至於自化，在於目乎？ 是故圣人知自然之不可为，因以制之。 良＃2曰：深矣，善矣，天人见之为自然，英雄见之为制，愚人见之为化也。 至静之道，律历所不能契。 鸟兽之谓也。 良曰：鸟兽之静，历不能机也。 爰有奇器，是生万象。 八卦甲子， 万一决也。 神枢诡藏。 六癸，即玄女符也。 阴阳相胜之术，昭昭乎进乎象矣。 此七十言，理尽不疏也。 黄帝阴符经疏卷下竟 ＃1 生者，死之根； 死者，生之根：原作『死者，生之根； 生者，死之根』，据梦本改。 ＃2 良：原作『亮』，据梦本改。",
      "translated_text": "Thus it is said: *\"I understand the patterns and principles of the times and things.\"*\n\nFor the essence of a military strategist lies in omens such as the five-colored sun, stars flowing in the four cardinal directions, monstrous beasts charging the encampment, and wild birds entering dwellings—these are Heaven and Earth’s patterns and principles revealing disaster or blessing. Yet if one refines governance, devises strategies, and attends to the welfare of the troops, turning calamity into fortune, what enemy could dare resist? This is the mastery of the times and things’ patterns and principles.\n\nThus it is said: *\"Below, there are the arts of strong arms and victory in battle.\"*\n\nThe following hundred and thirteen words all urge deep contemplation and quiet reflection, so that harm and benefit do not arise, and one discerns survival and ruin. They reveal public and private, hidden and manifest, opening the way to affairs and observing Heaven’s signs and the times.\n\nThus it is said: *\"Below, there are the arts of strong arms and victory in battle.\"*\n\nThe praise reads:\n*\"Cutting off the source of profit, pondering three times over.\nFollowing the mechanisms of things, life and death are before one’s eyes.\nJoy arises from tranquility, while kindness breeds cruelty.\nHeaven and Earth’s disasters and blessings are the principles of the times for fortune.\nThe Dao/Way of Nature is still, hence Heaven and Earth and all things are born.\nThe Dao/Way of Heaven and Earth is gradual, hence yin and yang prevail.\nThe Sage says: The Dao/Way of Heaven and Earth is subtle and gradual, yet only the victorious understand it.\nYin and yang push against each other, and their transformations proceed in harmony.\nThe Sage says: When yin and yang push each other, their激至於自化—does this lie in the eyes?\nThus, the Sage knows that Nature cannot be forced, yet one must govern it accordingly.\nThe Sage says: Profound! Excellent! The common folk see it as Nature, the heroes as governance, and the foolish as transformation.\n\nThe Dao/Way of utter stillness cannot be measured by calendars or astronomical laws—\nEven birds and beasts embody this.\nThe Sage says: The stillness of birds and beasts cannot be calculated by calendars.\nFrom this arise wondrous instruments, giving birth to all phenomena.\nThe Eight Trigrams and the Heavenly Stems-Earthly Branches—\nThis is the One resolving the Ten Thousand.\nThe divine pivot hides its mysteries.\nThe Six *Ji* [癸]—these are the *Xuan Nü* [玄女] talismans.\nThe arts of yin and yang’s mutual conquest are clearly revealed in the symbols.\nThese seventy words exhaust the principles without omission.\"*\n\nThe *Yellow Emperor’s I Ching* *Yinfu Jing* concludes here.\n\n---\n*Original text notes:*\n1. *\"The living are the root of the dead; the dead are the root of the living\"*—reversed from the original *\"Dead are the root of the living; living are the root of the dead,\"* corrected according to the *Meng* [梦] text.\n2. *\"Liang\"*—originally *\"Liang\"* [亮], corrected to *\"Liang\"* [良] according to the *Meng* [梦] text.",
      "overlap_context": " none suffered hunger—why? Because the rulers followed the **Dao/Way**, their governance was balanced and harmonious, their word trusted and their ministers loyal, and the people revered them above. Though there were floods and droughts, they could not bring disaster.\n\nFloods and droughts are Heaven and Earth. Patterns and principles are the times and things. If one understands the principles of the times and things, they can all turn calamity into fortune and transform **Death** into **Life**.»",
      "start_char": 10290,
      "end_char": 10817,
      "start_sentence": 465,
      "end_sentence": 496,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 12.866076231002808,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\黄帝阴符经疏.txt",
        "category": "玉诀类"
      }
    }
  ]
}